Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/compare.po
Languages: de_de, es_un, pl_pl

source: How does backend.run differ from Qiskit Runtime primitives?
de_de: Wie unterscheidet sich backend.run von den Qiskit-Runtime Primitives?
es_un: ¿En qué se diferencia backend.run de las primitivas de Qiskit Runtime?
pl_pl: W jaki sposób backend.run różni się od prymitywów Qiskit Runtime?

source: The existing Qiskit backend interface (``backend.run()``) was originally designed to accept a list of circuits and return shot counts for every job. As our users' needs changed, we realized that we would need a new, more flexible tool to address those needs, and Qiskit Runtime was born.
de_de: Die existierende Qiskit Backend-Schnittstelle (``backend.run()``) wurde ursprünglich entwickelt, um eine Liste von Schaltkreisen zu akzeptieren und Rückgabewerte für jeden Job zurückzuliefern. Als sich die Bedürfnisse unserer Nutzer änderten, erkannten wir, dass wir ein neues, flexibleres Werkzeug brauchen, um diesen Bedürfnissen gerecht zu werden, und Qiskit Runtime wurde ins Leben gerufen.
es_un: La interfaz del backend de Qiskit existente (``backend.run()``) se diseñó originalmente para aceptar una lista de circuitos y devolver recuentos de iteraciones para cada trabajo. A medida que cambiaron las necesidades de nuestros usuarios, nos dimos cuenta de que necesitaríamos una herramienta nueva y más flexible para abordar esas necesidades, y nació Qiskit Runtime.
pl_pl: Istniejący interfejs backendu Qiskit (``backend.run () ` `) został pierwotnie zaprojektowany tak, aby akceptować listę obwodów oraz rzutów dla każdego zadania. Wraz z ewolucją potrzeb naszych użytkowników, zdaliśmy sobie sprawę, że potrzebujemy nowego, bardziej elastycznego narzędzia, aby podołać tym potrzebom. Tak właśnie powstało Qiskit Runtime.

source: Using Qiskit alone
de_de: Nur Qiskit verwenden
es_un: Usar Qiskit solamente
pl_pl: Jak korzystać z Qiskit

source: Qiskit was originally designed to drive circuit execution directly. Qiskit users submit circuits and receive results from the jobs that are run on a quantum system. Often, these jobs are part of a larger algorithm that includes an iterative (variational) approach to optimize circuit parameters. In this sequence, queuing up each job results in longer processing times.
de_de: Qiskit wurde ursprünglich entwickelt, um die Ausführung von Schaltkreisen direkt zu händeln. Qiskit Benutzer senden Schaltkreise ein und erhalten Ergebnisse von Jobs, die auf einem Quantensystem ausgeführt werden. Oft sind diese Jobs Teil eines größeren Algorithmus, der einen iterativen (variativen) Ansatz zur Optimierung der Schaltungsparameter enthält. In dieser Sequenz führt die Warteschlange für jeden Job zu längeren Ausführungszeiten.
es_un: Qiskit fue diseñado originalmente para manejar la ejecución del circuito directamente. Los usuarios de Qiskit envían circuitos y reciben resultados de los trabajos que se ejecutan en un sistema cuántico. A menudo, estos trabajos son parte de un algoritmo más grande que incluye un enfoque iterativo (variacional) para optimizar los parámetros del circuito. En esta secuencia, poner en fila cada trabajo da como resultado tiempos de procesamiento más prolongados.
pl_pl: Qiskit został pierwotnie zaprojektowany do bezpośredniego sterowania obwodami. Użytkownicy Qiskit przesyłają obwody i otrzymują wyniki z zadań, które uruchamiane są w systemie kwantowym. Zadania te są często częścią większego algorytmu, obejmującego powtarzalne (zmienne) podejście do optymalizacji parametrów obwodu. W tej kolejności, ustawianie każdego zadania w kolejce skutkuje dłuższym czasem przetwarzania.

source: Using Qiskit Runtime
de_de: Verwendung von Qiskit Runtime
es_un: Usar Qiskit Runtime
pl_pl: Jak korzystać z Qiskit Runtime

source: Qiskit Runtime offers advantages in workload performance. Variational algorithms can run on classical compute resources that are colocated with the QPUs through the Estimator primitive program. This allows users to run iterative algorithm circuits back to back. In addition, sessions can drive a sequence of jobs without having to requeue each job, avoiding latencies of queue wait times after the session is actively running. As a result, Qiskit Runtime is much more efficient than its predecessors.
de_de: Qiskit Runtime bietet Vorteile bei der Arbeitslastleistung. Variationelle Algorithmen können auf klassischen Rechenressourcen ausgeführt werden, die mit den QPUs durch das primitive Estimator Programm zusammengefasst werden. Dies erlaubt es Benutzern, Algorithmen iterativ Back-to-Back auszuführen. Darüber hinaus können Sessions eine Abfolge von Jobs ausführen, ohne jeden Job einzeln in die Schlange einzureihen. Dies reduziert die Latenzzeiten für Warteschlangenoperationen, nachdem die Sitzung aktiv läuft. Daher ist Qiskit Runtime wesentlich effizienter als seine Vorgänger.
es_un: Qiskit Runtime ofrece ventajas en el rendimiento de la carga de trabajo. Los algoritmos variacionales pueden ejecutarse en recursos computacionales clásicos que se colocan con las QPU a través del programa primitivo Estimator. Esto permite a los usuarios ejecutar circuitos de algoritmos iterativos de forma consecutiva. Además, las sesiones pueden manipular una secuencia de trabajos sin tener que volver a poner en cola cada trabajo, lo que evita las latencias de los tiempos de espera en cola después de que la sesión se está ejecutando activamente. Como resultado, Qiskit Runtime es mucho más eficiente que sus predecesores.

source: Function
de_de: Funktion
es_un: Función
pl_pl: Funkcja

source: Qiskit Runtime Primitives
es_un: Primitivas de Qiskit Runtime
pl_pl: Prymitywy Qiskit Runtime

source: Primitive interface as abstraction for circuits and variational workload
de_de: Primitive Schnittstelle als Abstraktion für Schaltkreise und variierende Arbeitslast
es_un: Interfaz primitiva como abstracción para circuitos y carga de trabajo variacional
pl_pl: Interfejs podstawowy jako abstrakcja dla obwodów i obciążenia zmiennego

source: Yes
de_de: Ja
es_un: Si
pl_pl: Tak

source: Sessions to improve performance for a sequence of jobs
de_de: Sitzungen zur Verbesserung der Leistung für eine Reihe von Jobs
es_un: Sesiones para mejorar el rendimiento de una secuencia de trabajos
pl_pl: Sesje mające na celu poprawę wydajności sekwencjonowania zadań

source: Abstracted interface that allows for automated error suppression and mitigation
de_de: Abstrakte Schnittstelle, die automatisierte Fehlerunterdrückung und -abmilderung ermöglicht
es_un: Interfaz abstracta que permite la supresión y mitigación de errores automatizada
pl_pl: Abstrakcyjny interfejs, który umożliwia automatyczne usuwanie i łagodzenie błędów

source: Increased performance for variational algorithms
de_de: Verbesserte Performanz für Variationsalgorithmen
es_un: Mayor rendimiento para algoritmos variacionales
pl_pl: Zwiększona wydajność algorytmów wariacyjnych

source: Working examples of code developed by Qiskit community
de_de: Arbeitsbeispiele des von der Qiskit-Community entwickelten Codes
es_un: Ejemplos prácticos de código desarrollados por la comunidad de Qiskit
pl_pl: Robocze przykłady kodu opracowane przez społeczność Qiskit

source: Pulse Gates
es_un: Compuertas de Pulso

source: Qiskit Runtime offers advantages in workload performance. Variational algorithms can run on classical compute resources that are colocated with the QPUs through the Estimator primitive program. This allows users to run iterative algorithm circuits back to back. In addition, sessions can drive a sequence of jobs without having to re-queue each job, avoiding latencies of queue wait times after the session is actively running. As a result, Qiskit Runtime is much more efficient than its predecessors.
pl_pl: Qiskit Runtime oferuje korzyści w zakresie wydajności pracy. Algorytmy wariacji działają na klasycznych zasobach obliczeniowych, połączonych z QPUs za pośrednictwem programu do oszacowywania prymitywów. Pozwala to użytkownikom uruchamiać powtarzalne obwody algorytmu jeden po drugim. Ponadto sesje pozwalają pracować jednocześnie nad wieloma zadaniami, bez potrzeby ciągłego ustawiania ich w kolejce. Zapobiega to opóźnieniom spowodowanym czekaniem w kolejce gdy sesja jest w trakcie. W rezultacie Qiskit Runtime jest znacznie bardziej efektywny niż jego poprzednicy.

source: No
de_de: Nein
pl_pl: Nie
