Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/getting_started.po
Languages: de_de, es_un, fr_fr, ja_jp, ko_kr, pt_un, ta_in

source: Getting started
de_de: Erste Schritte
es_un: Primeros pasos
fr_fr: Premiers Pas
ja_jp: はじめに
ko_kr: 시작하기
pt_un: Primeiros Passos
ta_in: தொடங்குதல்

source: Install Qiskit packages
de_de: Qiskit-Pakete installieren
es_un: Instalar paquetes de Qiskit
fr_fr: Installation des packages Qiskit
ja_jp: Qiskit パッケージのインストール
ko_kr: Qiskit 패키지 설치하기
pt_un: Instale os pacotes do Qiskit
ta_in: Qiskit தொகுப்புகளை நிறுவவும்

source: Installing the following packages lets you create circuits and work with primitives through Qiskit Runtime:
ja_jp: 以下のパッケージをインストールします。 これにより、 Qiskit Runtimeを介して、回路を作成し、Primitive を処理できます。

source: Find your access credentials
de_de: Ihre Zugangsdaten finden
es_un: Encuentra tus credenciales de acceso
fr_fr: Accédez à vos identifiants
ja_jp: アクセス資格情報の検索
ko_kr: 접근 자격 증명 찾기
pt_un: Encontre suas credenciais de acesso
ta_in: உங்கள் அணுகல் சான்றுகளைக் கண்டறியவும்

source: You can access Qiskit Runtime from either IBM Quantum or IBM Cloud.
de_de: Sie können auf Qiskit Runtime entweder von IBM Quantum oder von IBM Cloud aus zugreifen.
es_un: Puedes acceder a Qiskit Runtime desde IBM Quantum o IBM Cloud.
fr_fr: Vous pouvez accéder à Qiskit Runtime à partir d'IBM Quantum ou d'IBM Cloud.
ja_jp: IBM Quantum または IBM Cloud のいずれかから、 Qiskit Runtime にアクセスできます。
ko_kr: IBM Quantum 또는 IBM Cloud를 통해 Qiskit Runtime에 접근할 수 있다.
pt_un: Podemos acessar o Qiskit Runtime pelo IBM Quantum ou pela IBM Cloud.
ta_in: IBM Quantum அல்லது IBM Cloud இலிருந்து Qiskit இயக்க நேரத்தை நீங்கள் அணுகலாம்.

source: `Retrieve your IBM Quantum token <https://quantum-computing.ibm.com/account>`_, and optionally save it for easy access later.
es_un: `Recupera tu token de IBM Quantum <https://quantum-computing.ibm.com/account>`_, y opcionalmente guárdalo para un fácil acceso más tarde.
ja_jp: `IBM Quantumトークンを取得し <https://quantum-computing.ibm.com/account>`_ 、保存しておくと、後で簡単にアカウントにアクセスできます。

source: Account credentials are saved in plain text, so only do so if you are using a trusted device.
es_un: Las credenciales de la cuenta se guardan en texto sin formato, así que solo hazlo si estás utilizando un dispositivo confiable.
ja_jp: アカウントの資格情報はプレーン・テキストで保存されるため、信頼できるデバイスを使用している場合にのみ実行してください。
ko_kr: 계정 신임 정보는 일반 텍스트로 저장되므로 신뢰할 수 있는 디바이스를 사용하는 경우에만 계정 신임 정보가 저장된다.

source: Retrieve your IBM Cloud access credentials, and optionally save it for easy access later.
es_un: Recupera tus credenciales de acceso a IBM Cloud y, opcionalmente, guárdalas para acceder fácilmente más adelante.
ja_jp: IBM Cloud のアクセス認証情報を取得し、オプションで後で簡単にアクセスできるように保存します。
ko_kr: 사용자의 클라우드 액세스 신임 정보를 검색하여 나중에 쉽게 액세스할 수 있도록 선택적으로 저장하기.

source: `Retrieve your IBM Cloud token <https://cloud.ibm.com/iam/apikeys>`__
es_un: `Recupera tu token de IBM Cloud <https://cloud.ibm.com/iam/apikeys>`__
ja_jp: ` IBM Cloud トークン <https://cloud.ibm.com/iam/apikeys>`__ を取得します。

source: To retrieve your Cloud Resource Name (CRN), open the `Instances page <https://cloud.ibm.com/quantum/instances>`__ and click your instance. In the page that opens, click the icon to copy your CRN.
es_un: Para recuperar tu Nombre de Recurso de Nube (Cloud Resource Name, CRN), abre la página `Instancias <https://cloud.ibm.com/quantum/instances>`__ y haz clic en tu instancia. En la página que se abre, haz clic en el icono para copiar tu CRN.
ja_jp: Cloud Resource Name（CRN）を取得するには、 `インスタンスページ <https://cloud.ibm.com/quantum/instances>`__ を開き、自分のインスタンスをクリックします。開いたページで、CRNをコピーするためのアイコンをクリックします。
ko_kr: 클라우드 리소스 이름 (CRN) 을 검색하려면 `인스턴스 페이지 <https://cloud.ibm.com/quantum/instances>`__ 를 열고 인스턴스를 클릭한다. 열리는 페이지에서 아이콘을 클릭하여 CRN을 복사한다.

source: Test your setup
de_de: Setup testen
es_un: Prueba tu configuración
fr_fr: Testez votre configuration
ja_jp: セットアップのテスト
ko_kr: 설정 테스트
pt_un: Teste o seu setup
ta_in: உங்கள் அமைப்பைச் சோதிக்கவும்

source: Run a simple circuit using `Sampler` to ensure that your environment is set up properly:
ja_jp: `Sampler` を使用して簡単な回路を実行し、環境が適切に設定されていることを確認します：

source: Getting started with primitives
es_un: Primeros pasos con las primitivas
fr_fr: Démarrer avec des primitives
ja_jp: primitives 入門
ko_kr: 프리미티브 시작하기

source: `See more tutorials <tutorials.html>`_
de_de: `Weitere Tutorials unter <tutorials.html>`_
es_un: `Consulta más tutoriales <tutorials.html>`_
fr_fr: `Voir plus de tutoriels <tutorials.html>`_
ja_jp: `その他のチュートリアルを見る <tutorials.html>`_
ko_kr: `추가 튜토리얼 보기 <tutorials.html>`_
pt_un: `Veja mais tutoriais <tutorials.html>`_
ta_in: `மேலும் பயிற்சிகளைக் காண்க <tutorials.html>`_

source: Install these packages. They let you create circuits and work with primitive programs via Qiskit Runtime.
de_de: Installieren Sie diese Pakete, mit denen Sie Schaltkreise erstellen und mit primitiven Programmen über Qiskit Runtime arbeiten können.
pt_un: Instale estes pacotes. Eles te permitem criar circuitos e trabalhar com programas primitivos atrav√©s do Qiskit Runtime.
ta_in: இந்தத் தொகுப்புகளை நிறுவவும். கிஸ்கிட் இயக்க நேரத்தின் மூலம் சர்க்யூட்களை உருவாக்கவும், பழமையான நிரல்களுடன் வேலை செய்யவும் அவை உங்களை அனுமதிக்கின்றன.

source: `Retrieve IBM Quantum token <https://quantum-computing.ibm.com/account>`_
de_de: `Abrufen des IBM Quantum Token <https://quantum-computing.ibm.com/account>`_
fr_fr: `Récupérer le jeton Quantum IBM <https://quantum-computing.ibm.com/account>`_
pt_un: `Recupere o token IBM Quantum <https://quantum-computing.ibm.com/account>`_
ta_in: `ஐபிஎம் குவாண்டம் டோக்கனை மீட்டெடுக்கவும் <https://quantum-computing.ibm.com/account>`_

source: `Retrieve IBM Cloud token <cloud/quickstart#credentials.html>`__
de_de: `Abrufen des IBM Cloud-Token <cloud/quickstart#credentials.html>`__

source: Run the Hello World program to ensure that your environment is set up properly:
de_de: Führen Sie das Programm "Hello World" aus, um sicherzustellen, dass Ihre Umgebung ordnungsgemäß konfiguriert ist:
fr_fr: Exécutez le programme Hello World pour vous assurer que votre environnement est correctement configuré :
pt_un: Execute o programa Hello World para certificar que o seu ambiente esta configurado corretamente:
ta_in: உங்கள் சூழல் சரியாக அமைக்கப்பட்டுள்ளதா என்பதை உறுதிப்படுத்த ஹலோ வேர்ல்ட் திட்டத்தை இயக்கவும்:

source: Getting started with Primitives
de_de: Erste Schritte mit Primitives
pt_un: Primeros pasos con os Primitivos
ta_in: ப்ரிமிட்டிவ்ஸுடன் தொடங்குதல்

source: Install these packages. They let you create circuits and work with primitive programs through Qiskit Runtime.
fr_fr: Installez ces packages. Ils vous permettent de créer des circuits et de travailler avec des programmes primitifs via Qiskit Runtime.

source: `Retrieve IBM Cloud token <https://cloud.ibm.com/iam/apikeys>`__
fr_fr: `Récupérer le jeton IBM Cloud <https://cloud.ibm.com/iam/apikeys>`__
