Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/primitives.po
Languages: es_un, ja_jp

source: Introduction to primitives
es_un: Introdución a las primitivas
ja_jp: プリミティブの概要

source: With Qiskit Runtime, we are introducing a new set of interfaces, in the form of primitives, to expand on how users run jobs on quantum computers.
es_un: Con Qiskit Runtime, introducimos un nuevo conjunto de interfaces, en forma de primitivas, para ampliar la forma en que los usuarios ejecutan trabajos en computadoras cuánticas.
ja_jp: Qiskit Runtimeでは、量子コンピューター上でのジョブ実行方法を拡張するために、primitiveの形で新しいインターフェースのセットを導入しています。

source: The existing Qiskit interface to backends (`backend.run()`) was originally designed to accept a list of circuits and return counts for every job. Over time, it became clear that users have diverse purposes for quantum computing, and therefore the ways in which they define the requirements for their computing jobs are expanding. Therefore, their results also look different.
es_un: La interfaz de Qiskit existente para backends (`backend.run()`) se diseñó originalmente para aceptar una lista de circuitos y devolver recuentos para cada trabajo. Con el tiempo, quedó claro que los usuarios tienen diversos propósitos para la computación cuántica y, por lo tanto, se están ampliando las formas en que definen los requisitos para sus trabajos computacionales. Por lo tanto, sus resultados también se ven diferentes.
ja_jp: 既存のQiskitのバックエンドへのインターフェース（ `backend.run()` ）は、もともと回路リストを受け取り、各ジョブのcountを返すように設計されています。しかし、量子コンピューターを利用する目的は様々であり、利用者がどのように計算ジョブの要件を定義するかは様々であることが分かってきました。そのため、結果もさまざまな見方があります。

source: For example, an algorithm researcher and developer cares about information beyond counts; they are more focused on efficiently calculating quasiprobabilities and expectation values of observables.
es_un: Por ejemplo, un investigador y desarrollador de algoritmos se preocupa por la información más allá de los recuentos; están más enfocados en calcular de manera eficiente las cuasiprobabilidades y los valores esperados de los observables.
ja_jp: 例えば、アルゴリズム研究者・開発者は、count だけでなく、準確率や観測値の期待値を効率的に計算することに重点を置いています。

source: Our primitives provide methods that make it easier to build modular algorithms and other higher-order programs. Instead of simply returning counts, they return more immediately meaningful information. Additionally, they provide a seamless way to access the latest optimizations in IBM Quantum hardware and software.
es_un: Nuestras primitivas proporcionan métodos que facilitan la construcción de algoritmos modulares y otros programas de orden superior. En lugar de simplemente devolver recuentos, devuelven información significativa más inmediata. Además, proporcionan una forma sencilla de acceder a las últimas optimizaciones en hardware y software de IBM Quantum.
ja_jp: 我々のprimitiveは、モジュール化されたアルゴリズムやその他の高次のプログラ ムを容易に構築するためのメソッドを提供します。単にcount数を返すのではなく、より即座に意味のある情報を返します。さらに、IBM Quantumのハードウェアとソフトウェアの最新の最適化にアクセスするためのシームレスな方法を提供します。

source: The basic operations that one can do with a probability distribution is to sample from it or to estimate quantities on it. Therefore, these operations form the fundamental building blocks of quantum algorithm development. Our first two Qiskit Runtime primitives (Sampler and Estimator) use these sampling and estimating operations as core interfaces to our quantum systems.
es_un: Las operaciones básicas que se pueden hacer con una distribución de probabilidad son tomar muestras de ella o estimar cantidades en ella. Por lo tanto, estas operaciones forman los bloques de construcción fundamentales del desarrollo de algoritmos cuánticos. Nuestras dos primeras primitivas en Qiskit Runtime (Sampler y Estimator) utilizan estas operaciones de muestreo y estimación como interfaces centrales para nuestros sistemas cuánticos.
ja_jp: 確率分布に対してできる基本的な操作は、確率分布からのサンプリングと確率分布上の数量の推定です。したがって、これらの操作は、量子アルゴリズム開発の基本的な構成要素を形成しています。Qiskitの最初の2つのRuntime primitives（SamplerとEstimator）は、量子システムへのコアインターフェースとして、サンプリングと推定演算を行います。

source: Available primitives
es_un: Primitivas disponibles
ja_jp: 利用可能なprimitives

source: The following primitives are available:
es_un: Las siguientes primitivas están disponibles:
ja_jp: 以下のprimitivesが使用できます：

source: Primitive
es_un: Primitiva

source: Description
es_un: Descripción
ja_jp: 説明

source: Example output
es_un: Ejemplo de salida
ja_jp: 出力例

source: Allows a user to specify a list of circuits and observables and selectively group between the lists to efficiently evaluate expectation values and variances for a parameter input. It is designed to enable users to efficiently calculate and interpret expectation values of quantum operators that are required for many algorithms.
es_un: Permite a un usuario especificar una lista de circuitos y observables y agrupar selectivamente entre las listas para evaluar de manera eficiente los valores esperados y las variaciones para un parámetro de entrada. Está diseñado para permitir a los usuarios calcular e interpretar de manera eficiente los valores esperados de los operadores cuánticos que se requieren para muchos algoritmos.
ja_jp: 回路と観測値のリストを指定し、そのリスト間を選択的にグループ化することで、パラメーター入力に対する期待値と分散を効率的に評価することができます。多くのアルゴリズムで必要とされる量子演算子の期待値を効率的に計算し、解釈できるように設計されているます。

source: Allows a user to input a circuit and then generate quasiprobabilities. This generation enables users to more efficiently evaluate the possibility of multiple relevant data points in the context of destructive interference.
es_un: Permite a un usuario ingresar un circuito y luego generar cuasiprobabilidades. Esta generación permite a los usuarios evaluar de manera más eficiente la posibilidad de múltiples puntos de datos relevantes en el contexto de la interferencia destructiva.
ja_jp: 回路を入力し、準確率を生成することができます。この生成により、ユーザーは破壊的干渉の文脈で複数の関連するデータ点の可能性をより効率的に評価することができるようになります。

source: How to use primitives
es_un: Cómo usar primitivas
ja_jp: Primitiveの使用方法

source: Primitive program interfaces vary based on the type of task that you want to run on the quantum computer and the corresponding data that you want returned as a result. After identifying the appropriate primitive for your program, you can use Qiskit to prepare inputs, such as circuits, observables (for Estimator), and customizable options to optimize your job. For more information, see the appropriate topic:
es_un: Las interfaces de programas primitivos varían según el tipo de tarea que deseas ejecutar en la computadora cuántica y los datos correspondientes que deseas obtener como resultado. Después de identificar la primitiva adecuada para su programa, puedes usar Qiskit para preparar entradas, como circuitos, observables (para Estimator) y opciones personalizables para optimizar tu trabajo. Para obtener más información, consulta el tema correspondiente:
ja_jp: Primitiveは、量子コンピューター上でどのような処理を行い、その結果をどのようなデータとして返すかによって使い分けられます。プログラムに適したprimitiveを特定した後、Qiskitを使用して、回路、観測値（Estimator用）、ジョブを最適化するためのカスタマイズ可能なオプションなどの入力を準備することができます。詳細については、該当するトピックを参照してください。

source: `Getting started with Estimator <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-estimator.html>`__
es_un: `Primeros pasos con Estimator <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-estimator.html>`__
ja_jp: `Estimator入門 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-estimator.html>`__

source: `Getting started with Sampler <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-sampler.html>`__
es_un: `Primeros pasos con Sampler <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-sampler.html>`__
ja_jp: `Sampler入門 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-sampler.html>`__
