Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/sessions.po
Languages: ja_jp, te_in

source: Introduction to sessions
ja_jp: Session 入門
te_in: సెషన్లకు పరిచయం

source: A session is a contract between the user and the Qiskit Runtime service that ensures that a collection of jobs can be grouped and jointly prioritized by the quantum computer’s job scheduler. This eliminates artificial delays caused by other users’ jobs running on the same quantum device during the session time.
ja_jp: Session とは、ユーザーとQiskit Runtimeサービスとの間のコントラクトであり、ジョブの集まりをグループ化し、量子コンピューターのジョブスケジューラーによって共同で優先順位をつけることができるようにするものです。これにより、session 時間中に同じ量子デバイス上で実行される他のユーザーのジョブによって引き起こされる人為的な遅延を排除することができます。
te_in: సెషన్ అనేది వినియోగదారు మరియు Qiskit Runtime సర్వీస్ మధ్య ఒక ఒప్పందం, ఇది క్వాంటం కంప్యూటర్ యొక్క జాబ్ షెడ్యూలర్ ద్వారా ఉద్యోగాల సేకరణను సమూహంగా మరియు ఉమ్మడిగా ప్రాధాన్యతనిస్తుందని నిర్ధారిస్తుంది. ఇది సెషన్ సమయంలో అదే క్వాంటం పరికరంలో ఇతర వినియోగదారుల ఉద్యోగాలు అమలు చేయడం వల్ల కలిగే కృత్రిమ ఆలస్యాన్ని తొలగిస్తుంది.

source: In simple terms, once your session is active, jobs submitted within the session are not interrupted by other users’ jobs.
ja_jp: 簡単に言うと、session がアクティブになると、session 内で投入されたジョブは、他のユーザーのジョブに邪魔されなくなります。
te_in: సాధారణ పదాల్లో, మీ సెషన్ సక్రియంగా ఉన్నప్పుడు, సెషన్‌లో సమర్పించిన ఉద్యోగాలకు ఇతర వినియోగదారుల ఉద్యోగాలు అంతరాయం కలిగించవు.

source: Compared with jobs that use the `fair-share scheduler <https://quantum-computing.ibm.com/lab/docs/iql/manage/systems/queue>`__, sessions become particularly beneficial when running programs that require iterative calls between classical and quantum resources, where a large number of jobs are submitted sequentially. This is the case, for example, when training a variational algorithm such as VQE or QAOA, or in device characterization experiments.
ja_jp: `fair-share scheduler <https://quantum-computing.ibm.com/lab/docs/iql/manage/systems/queue>`__ を使用するジョブに比べ、session は、古典リソースと量子リソースの間の反復的な呼び出しを必要とし、多数のジョブが連続して投入されるプログラムの実行時に特に有益です。例えば、VQEやQAOAのような変分アルゴリズムの学習や、デバイスの特性評価実験がこれにあたります。
te_in: `ఫెయిర్-షేర్ షెడ్యూలర్‌ను ఉపయోగించే ఉద్యోగాలతో పోలిస్తే <https://quantum-computing.ibm.com/lab/docs/iql/manage/systems/queue>` __, క్లాసికల్ మరియు క్వాంటం వనరుల మధ్య ఐటేటివ్ కాల్‌లు అవసరమయ్యే ప్రోగ్రామ్‌లను అమలు చేస్తున్నప్పుడు సెషన్‌లు చాలా ప్రయోజనకరంగా ఉంటాయి, ఇక్కడ పెద్ద సంఖ్యలో ఉద్యోగాలు వరుసగా సమర్పించబడతాయి. ఉదాహరణకు, VQE లేదా QAOA వంటి వైవిధ్యమైన అల్గారిథమ్‌కి శిక్షణ ఇస్తున్నప్పుడు లేదా పరికరం క్యారెక్టరైజేషన్ ప్రయోగాలలో ఇది జరుగుతుంది.

source: Runtime sessions can be used in conjunction with Qiskit Runtime primitives. Primitive program interfaces vary based on the type of task that you want to run on the quantum computer and the corresponding data that you want returned as a result. After identifying the appropriate primitive for your program, you can use Qiskit to prepare inputs, such as circuits, observables (for Estimator), and customizable options to optimize your job. For more information, see the `Primitives <primitives.html>`__ topic.
ja_jp: Runtime session は、Qiskit Runtime primitive と組み合わせて使用することができます。Primitiveは、量子コンピューター上でどのような処理を行い、その結果をどのようなデータとして返すかによって使い分けられます。プログラムに適したprimitiveを特定した後、Qiskitを使用して、回路、観測値（Estimator用）、ジョブを最適化するためのカスタマイズ可能なオプションなどの入力を準備することができます。詳細については、 `Primitives <primitives.html>`__ のトピックを参照してください。
te_in: రన్‌టైమ్ సెషన్‌లను క్విస్కిట్ రన్‌టైమ్ ప్రిమిటివ్‌లతో కలిపి ఉపయోగించవచ్చు. ప్రిమిటివ్ ప్రోగ్రామ్ ఇంటర్‌ఫేస్‌లు మీరు క్వాంటం కంప్యూటర్‌లో అమలు చేయాలనుకుంటున్న టాస్క్ రకం మరియు ఫలితంగా తిరిగి రావాలనుకుంటున్న సంబంధిత డేటా ఆధారంగా మారుతూ ఉంటాయి. మీ ప్రోగ్రామ్‌కు సముచితమైన ప్రాధమికాన్ని గుర్తించిన తర్వాత, మీరు మీ ఉద్యోగాన్ని ఆప్టిమైజ్ చేయడానికి సర్క్యూట్‌లు, పరిశీలించదగినవి (ఎస్టిమేటర్ కోసం) మరియు అనుకూలీకరించదగిన ఎంపికలు వంటి ఇన్‌పుట్‌లను సిద్ధం చేయడానికి Qiskitని ఉపయోగించవచ్చు. మరింత సమాచారం కోసం ` Primitives <primitives.html>` _ విషయం చూడండి.

source: Benefits of using sessions
ja_jp: Session を使用する利点
te_in: సెషన్లను ఉపయోగించడం వల్ల కలిగే ప్రయోజనాలు

source: There are several benefits to using sessions:
ja_jp: Session の使用には、次のような利点があります：
te_in: సెషన్లను ఉపయోగించడానికి అనేక ప్రయోజనాలు ఉన్నాయి:

source: Jobs that belong to a single algorithm run are run together without interruption, increasing efficiency if your program submits multiple sequential jobs.
ja_jp: 単一のアルゴリズム実行に属するジョブが中断することなく一緒に実行されるため、プログラムが複数の連続したジョブを投入する場合の効率が向上します。

source: The queuing time does not decrease for the first job submitted within a session. Therefore, a session does not provide any benefits if you only need to run a single job.
ja_jp: Session 内で最初に投入されたジョブについては、キューイング時間は短縮されません。したがって、単一のジョブだけを実行する必要がある場合、session は何のメリットもありません。
te_in: సెషన్‌లో సమర్పించిన మొదటి ఉద్యోగం కోసం క్యూలో సమయం తగ్గదు. అందువల్ల, మీరు ఒకే ఉద్యోగాన్ని అమలు చేయవలసి వస్తే సెషన్ ఎటువంటి ప్రయోజనాలను అందించదు.

source: Since data from the first session job is cached and used by subsequent jobs, if the first job is cancelled, subsequent session jobs will all fail.
ja_jp: 最初の session のジョブのデータはキャッシュされ、後続のジョブで使用されるため、最初のジョブがキャンセルされると、後続の session のジョブはすべて失敗します。
te_in: మొదటి సెషన్ ఉద్యోగం నుండి డేటా కాష్ మరియు తరువాతి ఉద్యోగాల ద్వారా ఉపయోగించబడుతుంది, మొదటి ఉద్యోగం రద్దు చేస్తే, తరువాతి సెషన్ ఉద్యోగాలు అన్ని విఫలమవుతాయి.

source: When using sessions, the uncertainty around queuing time is significantly reduced. This allows better estimation of a workload's total runtime and better resource management.
ja_jp: Session を使用すると、キューイング時間に関する不確実性が大幅に減少します。これにより、ワークロードの総実行時間をより良く見積もることができ、より良いリソース管理が可能になります。
te_in: సెషన్లను ఉపయోగించినప్పుడు, క్యూయింగ్ సమయం చుట్టూ అనిశ్చితి గణనీయంగా తగ్గుతుంది. ఇది పనిభారం యొక్క మొత్తం రన్‌టైమ్ మరియు మెరుగైన వనరుల నిర్వహణ యొక్క మెరుగైన అంచనాను అనుమతిస్తుంది.

source: In a device characterization context, being able to run experiments closely together helps prevent device drifts and provide more accurate results.
ja_jp: デバイスの特性評価において、実験を密に実行できるため、デバイスのドリフトを防ぎ、より正確な結果を得ることができます。
te_in: ఒక పరికర లక్షణ సందర్భంలో, ప్రయోగాలను దగ్గరగా అమలు చేయగలగడం పరికరం డ్రిఫ్ట్‌లను నిరోధించడంలో మరియు మరింత ఖచ్చితమైన ఫలితాలను అందించడంలో సహాయపడుతుంది.

source: While the session is active, you can submit different jobs, inspect job results, and re-submit new jobs without opening a new session.
ja_jp: Session がアクティブな間は、新しい session を開くことなく、異なるジョブの投入、ジョブ結果の確認、新しいジョブの再投入が可能です。

source: You maintain the flexibility to deploy your programs either remotely (cloud / on-premises) or locally (your laptop).
ja_jp: リモート（クラウド/オンプレミス）またはローカル（ラップトップ）のどちらでも、柔軟にプログラムを展開できます。

source: The mechanics of sessions (queuing)
ja_jp: Session（キューイング）の仕組み
te_in: సెషన్ల మెకానిక్స్ (క్యూయింగ్)

source: For each backend, the first job in the session waits its turn in the queue normally, but while the session is active, subsequent jobs within the same session take priority over any other queued jobs. If no jobs that are part of the active session are ready, the session is deactivated (paused), and the next job from the regular fair-share queue is run. See :ref:`ttl` for more information.
ja_jp: 各バックエンドにおいて、session 内の最初のジョブは通常通りキューで順番を待ちますが、session がアクティブな間は、同じ session 内の後続のジョブが、キューに入れられた他のジョブよりも優先されます。アクティブな session の一部であるジョブが準備できていない場合、session は非アクティブ化（一時停止）され、通常の fair-share キューから次のジョブが実行されます。詳細については、 :ref:`ttl` を参照してください。
te_in: ప్రతి బ్యాకెండ్ కోసం, సెషన్‌లోని మొదటి ఉద్యోగం సాధారణంగా క్యూలో తన వంతు కోసం వేచి ఉంటుంది, కానీ సెషన్ సక్రియంగా ఉన్నప్పుడు, అదే సెషన్‌లోని తదుపరి ఉద్యోగాలు ఏవైనా ఇతర క్యూలో ఉన్న ఉద్యోగాల కంటే ప్రాధాన్యతనిస్తాయి. సక్రియ సెషన్‌లో భాగమైన ఉద్యోగాలు ఏవీ సిద్ధంగా లేకుంటే, సెషన్ డియాక్టివేట్ చేయబడుతుంది (పాజ్ చేయబడింది), మరియు రెగ్యులర్ ఫెయిర్-షేర్ క్యూ నుండి తదుపరి ఉద్యోగం అమలు చేయబడుతుంది. మరింత సమాచారం కోసం :ref:` ttl ` చూడండి.

source: A quantum processor still executes one job at a time. Therefore, jobs that belong to a session still need to wait for their turn if one is already running.
ja_jp: 量子プロセッサーは、1度に1つのジョブを実行します。そのため、session に属するジョブがすでに実行されている場合は、そのジョブの順番を待つ必要があります。
te_in: క్వాంటం ప్రాసెసర్ ఇప్పటికీ ఒక సమయంలో ఒక పనిని అమలు చేస్తుంది. కాబట్టి, సెషన్‌కు చెందిన ఉద్యోగాలు ఇప్పటికే నడుస్తున్నట్లయితే వాటి టర్న్ కోసం వేచి ఉండవలసి ఉంటుంది.

source: Internal systems jobs such as calibration have priority over session jobs.
ja_jp: キャリブレーションなどの内部システムのジョブは、session のジョブよりも優先されます。

source: Iterations and batching
ja_jp: 反復とバッチ処理
te_in: ఇటేరేషన్లు మరియు బ్యాచ్ చేయుట

source: Sessions can be used for iterative or batch execution.
ja_jp: Session は反復またはバッチ実行に使用できます。
te_in: సెషన్లను ఇటేరేటివ్ లేదా బ్యాచ్ నిర్వర్తించేందుకు ఉపయోగించవచ్చు.

source: Iterative
ja_jp: 反復
te_in: ఇటేరేటివ్

source: Any session job submitted within the five-minute interactive timeout, also known as Time to live (TTL), is processed immediately. This allows some time for variational algorithms, such as VQE, to perform classical post-processing.
ja_jp: TTL (Time to live) とも呼ばれる5分間のインタラクティブタイムアウト内に投入されたsession ジョブは、即座に処理されます。これにより、VQEのような変分アルゴリズムが古典的な後処理を行うための時間が確保されます。

source: The quantum device is locked to the session user unless the TTL is reached.
ja_jp: TTLに達しない限り、量子デバイスは session ユーザーにロックされます。
te_in: TTLని చేరుకోకపోతే క్వాంటం పరికరం సెషన్ వినియోగదారుకు లాక్ చేయబడుతుంది.

source: Post-processing could be done anywhere, such as a personal computer, cloud service, or an HPC environment.
ja_jp: 後処理は、パーソナルコンピューター、クラウドサービス、HPC環境など、どこでも行うことができます。
te_in: పోస్ట్-ప్రాసెసింగ్ వ్యక్తిగత కంప్యూటర్, క్లౌడ్ సేవ లేదా HPC వాతావరణం వంటి ఎక్కడైనా చేయవచ్చు.

source: Batch
ja_jp: バッチ
te_in: బ్యాచ్

source: Ideal for running experiments closely together to avoid device drifts, that is, to maintain device characterization.
ja_jp: デバイスのドリフトを避けるため、つまりデバイス特性を維持するために、実験を密に実行するのに最適です。

source: Suitable for batching many jobs together.
ja_jp: 多くのジョブをまとめてバッチ処理するのに適しています。
te_in: అనేక ఉద్యోగాలను కలిసి బ్యాచ్ చేయడానికి అనుకూలం.

source: Jobs that fit within the maximum session time run back-to-back on hardware.
ja_jp: 最大 session 時間内に収まるジョブは、ハードウェア上で連続して実行されます。
te_in: అత్యధిక సెషన్ సమయంలో సరిపోయే ఉద్యోగాలు హార్డ్‌వేర్‌లో బ్యాక్-టు-బ్యాక్ నడుస్తాయి.

source: When batching, jobs are not guaranteed to run in the order they are submitted.
ja_jp: バッチ処理では、ジョブが送信された順番に実行されることは保証されません。
te_in: బ్యాచింగ్ చేస్తున్నప్పుడు, ఉద్యోగాలు సమర్పించిన క్రమంలో అమలు అవుతాయని హామీ ఇవ్వబడదు.

source: How long a session stays active
ja_jp: Session の有効期間
te_in: సెషన్ ఎంతకాలం క్రియాశీలంగా ఉంటుంది

source: The length of time a session is active is controlled by the *maximum session timeout* (``max_time``) value and the *interactive* timeout value (TTL). The ``max_time`` timer starts when the session becomes active. That is, when the first job runs, not when it is queued. It does not stop if a session becomes inactive. The TTL timer starts each time a session job finishes.
ja_jp: Session がアクティブである時間の長さは、 *最大 Session タイムアウト* (``max_time``) 値と *インタラクティブな* タイムアウト値(TTL) によって制御されます。 ``max_time`` タイマーは session がアクティブになったときに開始します。つまり、それは、最初のジョブが実行されたときであり、キューに入れられたときではありません。また、Session が非アクティブになっても停止しません。TTLタイマーは session ジョブが終了するたびに開始します。

source: For an Open plan user, the maximum session timeout is 15 minutes.
ja_jp: オープンプランのユーザーの場合、最大 session タイムアウトは15分です。

source: Maximum session timeout
ja_jp: 最大 Session タイムアウト
te_in: అత్యధిక సెషన్ సమయం ముగిసింది

source: When a session is started, it is assigned a *maximum session timeout* value. You can set this value by using the ``max_time`` parameter, which can be greater than the program's ``max_execution_time``. For instructions, see `Run a primitive in a session <how_to/run_session.html>`__.
ja_jp: Session が開始される際、 *最大session タイムアウト* 値が割り当てられます。 この値は、``max_time`` パラメーターを使用して設定できます。このパラメーターは、プログラムの ``max_execution_time`` より大きくてもかまいません。手順については、 `Session内でprimitiveを実行する <how_to/run_session.html>`__ を参照してください。
te_in: సెషన్ ప్రారంభించబడినప్పుడు, దానికి *గరిష్ట సెషన్ గడువు* విలువ కేటాయించబడుతుంది. మీరు ``max_time`` పరామితిని ఉపయోగించి ఈ విలువను సెట్ చేయవచ్చు, ఇది ప్రోగ్రామ్ యొక్క ``max_execution_time`` కంటే ఎక్కువగా ఉండవచ్చు. సూచనల కోసం, `సెషన్‌లో ప్రిమిటివ్‌ను రన్ చేయి చూడండి <how_to/run_session.html>` __.

source: If you do not specify a timeout value, it is the smaller of these values:
ja_jp: タイムアウト値を指定しない場合は、以下の値のうち小さい方の値となります：
te_in: మీరు గడువు ముగింపు విలువను పేర్కొనకుంటే, ఈ విలువల్లో ఇది చిన్నది:

source: The system limit
ja_jp: システムの制限値
te_in: వ్యవస్థ పరిమితి

source: The ``max_execution_time`` defined by the program
ja_jp: プログラムによって定義された ``max_execution_time``
te_in: ప్రోగ్రామ్ ద్వారా నిర్వచించబడిన ``గరిష్ట_ఎగ్జిక్యూషన్_టైమ్``

source: See `What is the maximum execution time for a Qiskit Runtime job? <faqs/max_execution_time.html>`__ to determine the system limit and the ``max_execution_time`` for primitive programs.
ja_jp: Primitive プログラムのシステム制限と ``max_execution_time`` を決定するには、 `What is the maximum execution time for a Qiskit Runtime job? <faqs/max_execution_time.html>`__ を参照ください。
te_in: చూడండి `Qiskit Runtime job కోసం గరిష్టంగా అమలు చేసే సమయం ఎంత? <faqs/max_execution_time.html>` (__) ఇది సిస్టమ్ పరిమితిని మరియు ప్రాధమిక ప్రోగ్రామ్‌ల కోసం ``max_execution_time``ని నిర్ణయించడానికి.

source: Interactive timeout value
ja_jp: インタラクティブなタイムアウト値
te_in: ఇంటరాక్టివ్ గడువు ముగింపు విలువ

source: Every session has an *interactive timeout value*, or time to live (TTL), of five minutes, which cannot be changed. If there are no session jobs queued within the TTL window, the session is temporarily deactivated and normal job selection resumes. A deactivated session can be resumed if it has not reached its maximum timeout value. The session is resumed when a subsequent session job starts. Once a session is deactivated, its next job waits in the queue like other jobs.
ja_jp: すべての session には5分間の *インタラクティブなタイムアウト値* 、つまり存続時間 ( time to live, TTL) が設定されており、これを変更することはできません。TTLウィンドウ内にキューに入っている session ジョブがない場合、sessionは一時的に非アクティブになり、通常のジョブ選択が再開されます。無効化された session は、最大タイムアウト値に達していなければ再開できます。Session は、後続の session ジョブが開始したときに再開されます。Session が非アクティブ化されると、その次のジョブは他のジョブと同様にキューで待機します。

source: After a session is deactivated, the next job in the queue is selected to run. This newly selected job (which can belong to a different user) can run as a singleton, but it can also start a different session. In other words, a deactivated session does not block the creation of other sessions. Jobs from this new session would then take priority until it is deactivated or closed, at which point normal job selection resumes.
ja_jp: Session が非活性化されると、キュー内の次のジョブが選択されて実行されます。この新しく選択されたジョブ（異なるユーザーに属することができる）は、シングルトンとして実行することができますが、異なる session を開始することもできます。言い換えると、無効化された session は、他の session の作成をブロックしません。この新しい session からのジョブは、それが非活性化されるか閉じられるまで優先され、その時点で通常のジョブ選択が再開されます。
te_in: సెషన్ నిష్క్రియం చేయబడిన తర్వాత, క్యూలో తదుపరి ఉద్యోగం అమలు చేయడానికి ఎంపిక చేయబడుతుంది. కొత్తగా ఎంచుకున్న ఈ ఉద్యోగం (వేరొక వినియోగదారుకు చెందినది కావచ్చు) సింగిల్‌టన్‌గా అమలు చేయగలదు, కానీ ఇది వేరే సెషన్‌ను కూడా ప్రారంభించవచ్చు. మరో మాటలో చెప్పాలంటే, క్రియారహితం చేయబడిన సెషన్ ఇతర సెషన్‌ల సృష్టిని నిరోధించదు. ఈ కొత్త సెషన్ నుండి ఉద్యోగాలు డియాక్టివేట్ చేయబడే వరకు లేదా మూసివేయబడే వరకు ప్రాధాన్యతనిస్తాయి, ఆ సమయంలో సాధారణ ఉద్యోగ ఎంపిక మళ్లీ ప్రారంభమవుతుంది.

source: When running jobs through the Open Plan, the interactive timeout value is two seconds.
ja_jp: オープンプランでジョブを実行する場合、インタラクティブなタイムアウトの値は2秒です。

source: What happens when a session ends
ja_jp: Session が終了するとどうなるか
te_in: ఒక సెషన్ ముగిసినప్పుడు ఏమి జరుగుతుంది

source: A session ends by reaching its maximum timeout value or when it is manually closed by the user. Do not close a session until all jobs **complete**. See `Close a session <how_to/run_session.html#close session>`__ for details. After a session is closed, the following occurs:
ja_jp: Session は、最大タイムアウト値に達するか、ユーザーによって手動で閉じられると終了します。すべてのジョブが **完了** するまで、session を閉じないでください。詳細については、 `Session を閉じる <how_to/run_session.html#close session>`__ を参照してください。Session が閉じられると、以下が発生します：
te_in: ఒక సెషన్ దాని గరిష్ట గడువు ముగింపు విలువను చేరుకోవడం ద్వారా లేదా వినియోగదారు దానిని మాన్యువల్‌గా మూసివేసినప్పుడు ముగుస్తుంది. అన్ని ఉద్యోగాలు **పూర్తి** వరకు సెషన్‌ను మూసివేయవద్దు. చూడండి ` సెషన్‌ను మూసివేయండి <how_to/run_session.html#close session>` _ వివరాలు. ఒక సెషన్ మూసివేసిన తరువాత, క్రింది వస్తుంది:

source: Any queued jobs remaining in the session (whether they are queued or not) are put into a failed state.
ja_jp: Session に残っているキューに入れられたジョブ（キューに入れられたかどうかにかかわらず）は、すべて失敗状態になります。
te_in: సెషన్‌లో మిగిలి ఉన్న ఏమైనా క్యూలో ఉన్న ఉద్యోగాలు (అవి క్యూలో ఉన్నా లేదా లేకపోయినా) విఫలమైన స్థితిలో ఉంచబడతాయి.

source: No further jobs can be submitted to the session.
ja_jp: その session に、それ以上ジョブを投入することはできません。
te_in: సెషన్‌కు తదుపరి ఉద్యోగాలు ఏవీ సమర్పించబడవు.

source: The session cannot be reopened.
ja_jp: Session を再開することはできません。
te_in: సెషన్ మళ్లీ తెరవబడదు.

source: Sessions and reservations
ja_jp: Session と予約
te_in: సెషన్లు మరియు రిజర్వేషన్లు

source: IBM Quantum Premium users can access both reservations and sessions on specific backends. Such users should plan ahead and decide whether to use a session or a reservation. You *can* use a session within a reservation. However, if you use a session within a reservation and some session jobs don’t finish during the reservation window, the remaining pending jobs might fail. If you use session inside a reservation, we suggest you set a realistic ``max_time`` value.
ja_jp: IBM Quantum Premiumユーザーは、特定のバックエンドで予約と session の両方にアクセスできます。このようなユーザーは、事前に計画を立て、session と予約のどちらを使用するかを決定する必要があります。予約の中で session を使用することも *できます* 。ただし、予約内で session を使用し、一部の session ジョブが予約ウィンドウ内に終了しなかった場合、保留中の残りのジョブが失敗する可能性があります。予約の中で session を使用する場合は、現実的な ``max_time`` 値を設定することをお勧めします。

source: Next steps
ja_jp: 次のステップ
te_in: తదుపరి దశలు

source: `Run a primitive in a session <how_to/run_session.html>`__
ja_jp: `Session内でprimitiveを実行する <how_to/run_session.html>`__
te_in: `సెషన్‌లో ప్రిమిటివ్‌ని అమలు చేయండి <how_to/run_session.html>` __

source: Jobs that belong to a single algorithm run are run together without interruptions, increasing efficiency if your program submits multiple sequential jobs.
te_in: ఒకే అల్గారిథమ్ రన్‌కు చెందిన ఉద్యోగాలు అంతరాయాలు లేకుండా కలిసి అమలు చేయబడతాయి, మీ ప్రోగ్రామ్ బహుళ సీక్వెన్షియల్ ఉద్యోగాలను సమర్పించినట్లయితే సామర్థ్యం పెరుగుతుంది.

source: As long as the session is active, you can submit different jobs, inspect job results, and re-submit new jobs without opening a new session.
te_in: సెషన్ క్రియాశీలంగా ఉన్నంత వరకు, మీరు కొత్త సెషన్‌ను తెరవకుండానే వివిధ ఉద్యోగాలను సమర్పించవచ్చు, ఉద్యోగ ఫలితాలను తనిఖీ చేయవచ్చు మరియు కొత్త ఉద్యోగాలను మళ్లీ సమర్పించవచ్చు.

source: You maintain the flexibility to deploy your programs either remotely (cloud / on-premise) or locally (your laptop).
te_in: మీరు మీ ప్రోగ్రామ్‌లను రిమోట్‌గా (క్లౌడ్ / ఆన్-ప్రాంగణంలో) లేదా స్థానికంగా (మీ ల్యాప్‌టాప్) అమలు చేయడానికి సౌలభ్యాన్ని కలిగి ఉంటారు.

source: Systems jobs such as calibration have priority over session jobs.
te_in: సెషన్ ఉద్యోగాల కంటే క్రమాంకనం వంటి సిస్టమ్‌ల ఉద్యోగాలకు ప్రాధాన్యత ఉంటుంది.

source: Any session job submitted within the five-minute interactive timeout (TTL) is processed immediately. This allows some time for variational algorithms, such as VQE, to perform classical post-processing.
te_in: ఐదు నిమిషాల ఇంటరాక్టివ్ గడువు (TTL) లోపు సమర్పించబడిన ఏదైనా సెషన్ ఉద్యోగం వెంటనే ప్రాసెస్ చేయబడుతుంది. ఇది క్లాసికల్ పోస్ట్-ప్రాసెసింగ్‌ను నిర్వహించడానికి VQE వంటి వైవిధ్య అల్గారిథమ్‌లకు కొంత సమయాన్ని అనుమతిస్తుంది.

source: Ideal for running experiments closely together to avoid device drifts, that is, to maintain device characterzation.
te_in: పరికర డ్రిఫ్ట్‌లను నివారించడానికి, అనగా పరికరం క్యారెక్టరైజేషన్‌ను నిర్వహించడానికి ప్రయోగాలను దగ్గరగా అమలు చేయడానికి అనువైనది.

source: The length of time a session is active is controlled by the *maximum session timeout* (`max_time`) value and the *interactive* timeout value (TTL). The `max_time` timer starts when the session becomes active. That is, when the first job runs, not when it is queued. It does not stop if a session becomes inactive. The TTL timer starts each time a session job finishes.
te_in: సెషన్ సక్రియంగా ఉన్న సమయం * అత్యధిక సెషన్ గడువు ముగిసిన విలువ * (` max_time `) మరియు * ఇంటరాక్టివ్ * గడువు ముగిసిన విలువ (TTL) చే నియంత్రించబడుతుంది. సెషన్ క్రియాశీలంగా మారినప్పుడు ` max_time ` timer మొదలవుతుంది. అంటే, మొదటి పని ఎప్పుడు నడుస్తుంది, అది క్యూలో ఉన్నప్పుడు కాదు. సెషన్ నిష్క్రియంగా మారితే అది ఆగదు. సెషన్ ఉద్యోగం పూర్తయిన ప్రతిసారీ TTL టైమర్ ప్రారంభమవుతుంది.

source: Every session has an *interactive timeout value* (TTL) of five minutes, which cannot be changed. If there are no session jobs queued within the TTL window, the session is temporarily deactivated and normal job selection resumes. A deactivated session can be resumed if it has not reached its maximum timeout value. The session is resumed when a subsequent sesssion job starts. Once a session is deactivated, its next job waits in the queue like other jobs.
te_in: ప్రతి సెషన్‌లో ఐదు నిమిషాల *ఇంటరాక్టివ్ గడువు ముగింపు విలువ* (TTL) ఉంటుంది, దానిని మార్చలేరు. TTL విండో లోపల సెషన్ ఉద్యోగాలు వరుసగా లేకపోయినట్లయితే, సెషన్ తాత్కాలికంగా నిష్క్రియం చెయ్యబడుతోంది మరియు సాధారణ ఉద్యోగ ఎంపిక పునర్వస్తుంది. క్రియారహితం చేయబడిన సెషన్ దాని గరిష్ట గడువు ముగింపు విలువను చేరుకోనట్లయితే దాన్ని పునఃప్రారంభించవచ్చు. తదుపరి సెషన్ ఉద్యోగం ప్రారంభమైనప్పుడు సెషన్ పునఃప్రారంభించబడుతుంది. సెషన్ నిష్క్రియం చేయబడిన తర్వాత, దాని తదుపరి ఉద్యోగం ఇతర ఉద్యోగాల వలె క్యూలో వేచి ఉంటుంది.

source: IBM Quantum Premium users can access both reservations and sessions on specific backends. Such users should plan ahead and decide whether to use a session or a reservation. You *can* use a session within a reservation. However, if you use a session within a reservation and some session jobs don’t finish during the reservation window, the remaining pending jobs might fail. If you use session inside a reservation we recommend that you set a realistic `max_time` value.
te_in: IBM క్వాంటమ్ ప్రీమియం వినియోగదారులు ప్రత్యేక బ్యాకెండ్లపై రిజర్వేషన్లు మరియు సెషన్లను అందుకోవచ్చు. అటువంటి వినియోగదారులు ముందుగానే ప్లాన్ చేసుకోవాలి మరియు సెషన్‌ను ఉపయోగించాలా లేదా రిజర్వేషన్‌ను ఉపయోగించాలా అని నిర్ణయించుకోవాలి. మీరు ఒక రిజర్వేషన్లో ఒక సెషన్ను ఉపయోగించవచ్చు. మీరు ఒక రిజర్వేషన్ లోపల ఒక సెషన్ ను ఉపయోగించినట్లయితే మరియు కొన్ని సెషన్ ఉద్యోగాలు రిజర్వేషన్ విండో సమయంలో ముగించకపోయినా, మిగిలిన పెండింగ్ ఉద్యోగాలు విఫలం కావచ్చు. మీరు ఒక రిజర్వేషన్ లోపల సెషన్ను ఉపయోగించినట్లయితే మీరు వాస్తవిక `max_time` విలువను సెట్ చేయాలని మేము సిఫార్సు చేస్తున్నాము.
