Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/how_to/account-management.po
Languages: es_un, ja

source: Manage your account
es_un: Administrar tu cuenta
ja: アカウントの管理

source: Qiskit Runtime is available on both IBM Cloud and IBM Quantum Platform. The former requires an IBM Cloud account and the latter requires an IBM Quantum account. If you don't have the necessary account, refer to the appropriate link:
es_un: Qiskit Runtime está disponible tanto en IBM Cloud como en IBM Quantum Platform. El primero requiere una cuenta de IBM Cloud y el segundo requiere una cuenta de IBM Quantum. Si no tienes la cuenta necesaria, consulta el enlace correspondiente:
ja: Qiskit RuntimeはIBM CloudとIBM Quantum Platformの両方で利用できます。 前者はIBM Cloudアカウントを必要とし、後者はIBM Quantumアカウントを必要とします。 必要なアカウントをお持ちでない場合は、次のリンクを参照してください。

source: `Setting up your IBM Cloud account <https://cloud.ibm.com/docs/account?topic=account-account-getting-started>`__
es_un: `Configurar tu cuenta de IBM Cloud <https://cloud.ibm.com/docs/account?topic=account-account-getting-started>`__
ja: `IBM Cloud アカウントの設定 <https://cloud.ibm.com/docs/account?topic=account-account-getting-started>`__

source: `Access your IBM Quantum account <https://quantum-computing.ibm.com/account>`__
es_un: `Acceder a tu cuenta de IBM Quantum <https://quantum-computing.ibm.com/account>`__
ja: `IBM Quantumアカウントを取得する <https://quantum-computing.ibm.com/account>`_

source: There are several methods for account management. Your account credentials can be saved to disk or used in a session and never saved.
es_un: Hay varios métodos para la administración de cuentas. Las credenciales de tu cuenta pueden guardarse en disco o usarse en una sesión y nunca guardarse.
ja: アカウント管理の方法はいくつかあります。 アカウント資格情報は、ディスクに保存することも、セッションで使用して保存しないこともできます。

source: `save_account()`: Save your account to disk for future use.
es_un: `save_account()`: Guarda tu cuenta en disco para su uso futuro.
ja: `save_account()`: 今後使用するためにアカウントをディスクに保存します。

source: `delete_account()`: Delete the saved account from disk.
es_un: `delete_account()`: Elimina la cuenta guardada en disco.
ja: `delete_account()`: 保存されたアカウントをディスクから削除します。

source: `active_account()`: List the account currently in the session.
es_un: `active_account()`: Enlista la cuenta actualmente en sesión.
ja: `active_account()`: セッション内の現在のアカウントを一覧表示します。

source: `saved_account()`: List the account stored on disk.
es_un: `saved_account()`: Enlista la cuenta almacenada en disco.
ja: `saved_account()`: ディスクに保管されているアカウントをリストします。

source: Store credentials
es_un: Almacenar credenciales
ja: 資格情報の保存

source: The ``save_account()`` method can be used to store your account credentials on disk, in the ``$HOME/.qiskit/qiskit-ibm.json`` file. After the credentials are saved, you will only need to use ``QiskitRuntimeService()`` to initialize your account in the future.
es_un: El método ``save_account()`` se puede utilizar para almacenar las credenciales de tu cuenta en disco, en el archivo ``$HOME/.qiskit/qiskit-ibm.json``. Después de guardar las credenciales, solo necesitarás usar ``QiskitRuntimeService()`` para inicializar tu cuenta en el futuro.
ja: ``save_account()`` メソッドを使用すると、アカウントの認証情報をディスク上の ``$HOME/.qiskit/qiskit-ibm.json`` ファイルに保存することが可能です。認証情報を保存した後は、今後 ``QiskitRuntimeService()`` を使用してアカウントを初期化するだけでよくなります。

source: Account credentials are saved in plain text, so only do so if you are using a trusted device.
es_un: Las credenciales de la cuenta se guardan en texto sin formato, así que solo hazlo si estás utilizando un dispositivo confiable.
ja: アカウントの資格情報はプレーン・テキストで保存されるため、信頼できるデバイスを使用している場合にのみ実行してください。

source: Following are examples of saving an IBM Cloud and an IBM Quantum account. The ``channel`` parameter allows to distinguish between different account types. If you are saving multiple accounts per channel, consider using the ``name`` parameter to differentiate them.
es_un: Los siguientes son ejemplos de cómo guardar una cuenta de IBM Cloud e IBM Quantum. El parámetro ``channel`` permite distinguir entre diferentes tipos de cuenta. Si estás guardando varias cuentas por canal, considera usar el parámetro ``name`` para diferenciarlas.
ja: IBM Cloud と IBM Quantum のアカウントを保存する例を以下に示します。 ``channel`` パラメーターを使用すると、異なるアカウント・タイプを区別することができます。 チャネルごとに複数のアカウントを保存する場合は、 ``name`` パラメーターを使用して区別することを検討してください。

source: Initialize your account
es_un: Inicializar tu cuenta
ja: アカウントの初期化

source: You need to initialize your account in a Python session before you can start using Qiskit Runtime. If you have the credentials already saved, you can initialize an ``QiskitRuntimeService`` instance without additional parameters.
es_un: Necesitas inicializar tu cuenta en una sesión de Python antes de poder comenzar a usar Qiskit Runtime. Si ya tienes las credenciales guardadas, puedes inicializar una instancia de ``QiskitRuntimeService`` sin parámetros adicionales.
ja: Qiskit Runtime の使用を開始する前に、 Python セッションでアカウントを初期化する必要があります。資格情報が既に保存されている場合は、追加のパラメーターを指定せずに ``QiskitRuntimeService`` インスタンスを初期化できます。

source: If you have both an IBM Cloud and an IBM Quantum accounts saved, ``QiskitRuntimeService()`` loads the IBM Cloud account by default. To load the IBM Quantum account instead, specify ``QiskitRuntimeService(channel="ibm_quantum")``.
es_un: Si tienes guardadas una cuenta de IBM Cloud y una de IBM Quantum, ``QiskitRuntimeService()`` carga la cuenta de IBM Cloud de forma predeterminada. Para cargar la cuenta de IBM Quantum, especifica ``QiskitRuntimeService(channel="ibm_quantum")``.
ja: IBM Cloud と IBM Quantum の両方のアカウントを保存している場合、 ``QiskitRuntimeService()`` はデフォルトで IBM Cloud アカウントをロードします。代わりにIBM Quantumのアカウントをロードするには、 ``QiskitRuntimeService(channel="ibm_quantum")`` を指定してください。

source: Alternatively, if you specified a name for your account when saving it, you can also specify the name of the account to load.
es_un: Alternativamente, si especificaste un nombre para tu cuenta al guardarla, también puedes especificar el nombre de la cuenta a cargar.
ja: また、保存時にアカウントにnameを指定した場合は、ロードするアカウントの名前を指定することもできます。

source: If you want to use your credentials for just the session instead of saving it, you can pass the credentials in when initializing the ``QiskitRuntimeService`` instance:
ja: セッションを保存するのではなく、単にセッションに対して資格情報を使用する場合は、 ``QiskitRuntimeService`` インスタンスを初期化する際に資格情報を渡すことができます。
