Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/how_to/backends.po
Languages: es_un, ja

source: Run on quantum backends
es_un: Ejecutar en backends cuánticos
ja: 量子バックエンドで実行

source: A **backend** represents either a simulator or a real quantum computer and are responsible for running quantum circuits and/or pulse schedules and returning results.
es_un: Un **backend** representa un simulador o una computadora cuántica real y es responsable de ejecutar circuitos cuánticos y/o planificadores de pulsos y devolver resultados.
ja: **バックエンド** は、シミュレーターまたは実際の量子コンピューターのいずれかを表し、量子回路および/またはパルススケジュールの実行と結果の返送を担当します。

source: In qiskit-ibm-runtime, a backend is represented by an instance of the ``IBMBackend`` class. Attributes of this class provides information about this backend. For example:
es_un: En qiskit-ibm-runtime, un backend está representado por una instancia de la clase ``IBMBackend``. Los atributos de esta clase proporcionan información sobre este backend. Por ejemplo:
ja: qiskit-ibm-runtimeでは、バックエンドは ``IBMBackend`` クラスのインスタンスによって表されます。 このクラスの属性はこのバックエンドに関する情報を提供します。 例えば、

source: name: Name of the backend.
es_un: name: Nombre del backend.
ja: name: バックエンドの名前。

source: instructions: A list of instructions the backend supports.
es_un: instructions: Una lista de instrucciones que admite el backend.
ja: instructions: バックエンドがサポートする命令のリスト。

source: operation_names: A list of instruction names the backend supported.
es_un: operation_names: Una lista de nombres de instrucciones que admite el backend.
ja: operation_names: バックエンドがサポートしている命令名のリスト。

source: num_qubits: The number of qubits the backend has.
es_un: num_qubits: El número de qubits que tiene el backend.
ja: num_qubits: バックエンドが持つ量子ビット数。

source: coupling_map: Coupling map of the backend.
es_un: coupling_map: Mapa de acoplamiento del backend.
ja: coupling_map: バックエンドのカップリングマップ。

source: dt: System time resolution of input signals.
es_un: dt: Resolución del tiempo del sistema de las señales de entrada.
ja: dt: 入力信号のシステム時間分解能。

source: dtm: System time resolution of output signals.
es_un: dtm: Resolución del tiempo del sistema de las señales de salida.
ja: dtm: 出力信号のシステム時間分解能。

source: Refer to the `API reference <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__ for a complete list of attributes and methods.
es_un: Consulta la `referencia de la API <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__ para obtener una lista completa de atributos y métodos.
ja: 属性およびメソッドのすべてのリストは、 `APIリファレンス <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__ を参照してください。

source: Initialize the service
es_un: Inicializar el servicio
ja: サービスの初期化

source: Before calling ``IBMBackend``, inialize the service:
es_un: Antes de llamar a ``IBMBackend``, inicializa el servicio:
ja: ``IBMBackend`` を呼び出す前にサービスを初期化します：

source: List backends
es_un: Lista de backends
ja: バックエンドの一覧

source: Use the ``backends()`` method to list all backends you have access to. This method returns a list of ``IBMBackend`` instances:
es_un: Usa el método ``backends()`` para listar todos los backends a los que tienes acceso. Este método devuelve una lista de instancias de ``IBMBackend``:
ja: アクセスできるすべてのバックエンドを一覧表示するには ``backends()`` メソッドを使用します。このメソッドは ``IBMBackend`` インスタンスのリストを返します。

source: The ``backend()`` (note that this is singular: *backend*) method takes the name of the backend as the input parameter and returns an ``IBMBackend`` instance representing that particular backend:
es_un: El método ``backend()`` (ten en cuenta que esto es singular: *backend*) toma el nombre del backend como parámetro de entrada y devuelve una instancia de ``IBMBackend`` que representa ese backend en particular:
ja: Backend()`` (これは単数形であることに注意してください: *backend*) メソッドは、バックエンドの名前を入力パラメーターとして受け取り、そのバックエンドを表す ``IBMBackend`` のインスタンスを返します。

source: Filter backends
es_un: Filtrar backends
ja: バックエンドをフィルターする

source: You may also optionally filter the set backends, by passing arguments that query the backend's configuration, status, or properties. For more general filters, you can make advanced functions using a lambda function. Refer to the API documentation for more details.
es_un: Opcionalmente, también puedes filtrar los backends establecidos, pasando argumentos que consultan la configuración, el estado o las propiedades del backend. Para filtros más generales, puedes hacer funciones avanzadas usando una función lambda. Consulta la documentación de la API para obtener más detalles.
ja: オプションで、バックエンドの構成、ステータス、またはプロパティを照会する引数を渡すことにより、セットのバックエンドをフィルタリングすることもできます。 より一般的なフィルターの場合、ラムダ関数を使用して高度な関数を作成できます。 詳細については、APIドキュメントを参照してください。

source: Let's try getting only backends that fit these criteria:
es_un: Intentemos obtener sólo los backends que se ajusten a estos criterios:
ja: これらの基準に合うバックエンドのみを取得してみましょう:

source: Are real quantum devices (``simulator=False``)
es_un: Son dispositivos cuánticos reales (``simulator=False``)
ja: 実際の量子デバイス ( ``simulator=False`` )

source: Are currently operational (``operational=True``)
es_un: Están actualmente operativos (``operational=True``)
ja: 現在稼働中 ( ``operal=True`` )

source: Have at least 5 qubits (``min_num_qubits=5``)
es_un: Tienen al menos 5 qubits (``min_num_qubits=5``)
ja: 少なくとも 5 量子ビットを持つ ( ``min_num_qubits=5`` )

source: A similar method is ``least_busy()``, which takes the same filters as ``backends()`` but returns the backend that matches the filters and has the least number of jobs pending in the queue:
es_un: Un método similar es ``least_busy()``, que toma los mismos filtros que ``backends()``, pero devuelve el backend que coincide con los filtros y tiene la menor cantidad de trabajos (jobs) pendientes en la fila:
ja: 同様の方法は ``least_busy()`` です。 これは ``backends()`` と同じフィルタを取りますが、フィルタに一致するバックエンドを返し、キューに保留中のジョブの最小数を返します:

source: Some programs also define the type of backends they need in the ``backend_requirements`` field of the program metadata.
es_un: Algunos programas también definen el tipo de backends que necesitan en el campo ``backend_requirements`` de los metadatos del programa.
ja: プログラムによっては、プログラムメタデータの ``backend_requirements`` フィールドに必要なバックエンドの種類を定義するものもあります。

source: The hello-world program, for example, needs a backend that has at least 5 qubits:
es_un: El programa hello-world, por ejemplo, necesita un backend que tenga al menos 5 qubits:
ja: 例えば、hello-world プログラムには、少なくとも 5 個の量子ビットを持つバックエンドが必要です。

source: After determining the backend requirements, you can find backends that meet the criteria:
es_un: Después de determinar los requerimientos del backend, puedes encontrar backends que cumplan con los criterios:
ja: バックエンド要件を決定した後、基準を満たすバックエンドを見つけることができます:

source: Determine backend attributes
es_un: Determinar los atributos del backend
ja: バックエンド属性の決定

source: As mentioned previously, the ``IBMBackend`` class attributes provide information about the backend. For example:
es_un: Como se mencionó anteriormente, los atributos de la clase ``IBMBackend`` proporcionan información sobre el backend. Por ejemplo:
ja: 前述のように、``IBMBackend`` クラス属性はバックエンドに関する情報を提供します。例えば:

source: See the `IBMBackend class documentation <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__ for the full list of backend attributes.
es_un: Consulta la `documentación de la clase IBMBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__ para obtener la lista completa de atributos del backend.
ja: バックエンド属性のすべてのリストは、 `IBMBackend class documentation <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__を参照してください。

source: Find backend information from other channels
es_un: Encontrar información del backend de otros canales
ja: 他のチャンネルからバックエンド情報を探す

source: To find your available systems and simulators on **IBM Cloud**, view the `Compute resources page <https://cloud.ibm.com/quantum/resources/your-resources>`__. You must be logged in to see your available compute resources. You are shown a snapshot of each backend. To see full details, click the backend name. You can also search for backends from this page.
es_un: Para encontrar tus sistemas y simuladores disponibles en **IBM Cloud**, consulta la página de `Recursos computacionales <https://cloud.ibm.com/quantum/resources/your-resources>`__. Debes iniciar sesión para ver tus recursos computacionales disponibles. Se te muestra una fotografía de cada backend. Para ver los detalles completos, haz clic en el nombre del backend. También puedes buscar backends desde esta página.
ja: **IBM Cloud** で利用可能なシステムとシミュレーターを見つけるには、`Compute resources ページ <https://cloud.ibm.com/quantum/resources/your-resources>`__をご覧ください。利用可能なコンピュート・リソースを確認するには、ログインする必要があります。各バックエンドのスナップショットが表示されます。 詳細な情報を見るには、バックエンドの名前をクリックしてください。また、このページからバックエンドを検索することもできます。

source: To find your available systems and simulators on **IBM Quantum Platform**, view the `Compute resources page <https://quantum-computing.ibm.com/services/resources>`__. You are shown a snapshot of each backend. To see full details, click the backend name. You can also sort, filter, and search from this page.
es_un: Para encontrar tus sistemas y simuladores disponibles en **IBM Quantum Platform**, consulta la página de `Recursos computacionales <https://quantum-computing.ibm.com/services/resources>`__. Se te muestra una fotografía de cada backend. Para ver los detalles completos, haz clic en el nombre del backend. También puedes ordenar, filtrar y buscar desde esta página.
ja: **IBM Quantum Platform** で利用可能なシステムとシミュレーターを見つけるには、``Compute resources ページ <https://quantum-computing.ibm.com/services/resources>`__をご覧ください。各バックエンドのスナップショットが表示されます。 詳細な情報を見るには、バックエンドの名前をクリックしてください。また、このページではソート、フィルター、検索が可能です。

source: Specify a backend when running a job
es_un: Especificar un backend al ejecutar un trabajo
ja: ジョブ実行時のバックエンドの指定

source: To specify a backend when running a job, add the ``backend`` option when starting your session. For details about working with sessions, see `Run a primitive in a session <run_session.html>`__.
es_un: Para especificar un backend al ejecutar un trabajo (job), agrega la opción ``backend`` al iniciar tu sesión. Para obtener detalles sobre cómo trabajar con sesiones, consulta `Ejecutar una primitiva en una sesión <run_session.html>`__.
ja: ジョブを実行する際にバックエンドを指定するには、Sessionを開始する際に ``backend`` オプションを追加します。Sessionでの作業について詳しくは、 `Sessionでprimitiveを実行する <run_session.html>`__ を参照してください。
