Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/how_to/error-mitigation.po
Languages: es_un, ja

source: Level 1 uses matrix-free measurement mitigation (M3) routine to mitigate readout error. M3 works in a reduced subspace defined by the noisy input bit strings that are to be corrected. Because the number of unique bit strings can be much smaller than the dimensionality of the full multi-qubit Hilbert space, the resulting linear system of equations is nominally much easier to solve.
es_un: El nivel 1 utiliza la rutina de mitigación de medición sin matriz (matrix-free measurement mitigation, M3) para mitigar el error de lectura. M3 funciona en un subespacio reducido definido por las cadenas de bits de entrada ruidosas que deben corregirse. Debido a que el número de cadenas de bits únicas puede ser mucho más pequeño que la dimensionalidad del espacio completo de Hilbert de múltiples qubits, el sistema lineal de ecuaciones resultante es nominalmente mucho más fácil de resolver.
ja: Level 1 は、読み出しエラーを軽減するために、マトリクス・フリー・メジャーメント・ミティゲーション（M3）ルーチンを使用します。M3は、補正すべきノイズの多い入力ビット列で定義される縮小部分空間で動作します。ビット列の数は、マルチ量子ビットのヒルベルト空間の次元よりもはるかに小さいため、結果として得られる連立方程式は、名目上、はるかに簡単に解くことができます。

source: This image illustrates the M3 routine.
es_un: Esta imagen ilustra la rutina M3.
ja: この画像はM3ルーチンを示しています。

source: Illustration of the M3 method
es_un: Ilustración del método M3
ja: M3 方式の図

source: Advanced resilience options
es_un: Opciones avanzadas de resiliencia
ja: 高度なresilienceオプション

source: You can tune advanced options to configure your resilience strategy further. These methods can be used alongside resilience levels where you change the specific options of interest and let your previously set resilience level manage the rest.
es_un: Puedes ajustar las opciones avanzadas para configurar aún más su estrategia de resiliencia. Estos métodos se pueden usar junto con los niveles de resiliencia en los que cambias las opciones específicas de interés y dejas que tu nivel de resiliencia establecido previamente gestione el resto.
ja: 高度なオプションを調整することで、resilience戦略をさらに設定することができます。これらの方法は、resilience level と一緒に使うことができ、関心のある特定のオプションを変更し、残りは以前に設定したresilience level に管理させることができます。

source: As a part of the beta release of the resilience options, users will be able configure ZNE by using the following advanced options. We will soon add options to tune other resilience levels that include PEC.
es_un: Como parte de la versión beta de las opciones de resiliencia, los usuarios podrán configurar ZNE utilizando las siguientes opciones avanzadas. Pronto agregaremos opciones para ajustar otros niveles de resiliencia que incluyen PEC.
ja: Resilience オプションのbeta版リリースの一環として、ユーザーは高度なオプションを使用してZNEを設定することができます。 PECを含む他のresilience level を調整するためのオプションは今後すぐにリリースされます。

source: Options
es_un: Opciones
ja: オプション

source: Inputs
es_un: Entradas
ja: インプット

source: Description
es_un: Descripción
ja: 概要

source: select your amplification strategy
es_un: seleccionar tu estrategia de amplificación
ja: 増幅のストラテジーを選択してください

source: Amplifies noise of all two qubit gates by performing local gate folding.
es_un: Amplifica el ruido de las compuertas de dos qubits al realizar el plegado de la compuerta local.
ja: ローカルゲートのフォールディングを実行することで、すべての2量子ビットゲートのノイズを増幅します。

source: Amplifies noise of all CNOT gates by performing local gate folding.
es_un: Amplifica el ruido de todas las compuertas CNOT al realizar el plegado de la compuerta local.
ja: ローカルゲートのフォールディングを実行することで、すべてのCNOTゲートのノイズを増幅します。

source: Amplifies noise of all gates by performing local gate folding.
es_un: Amplifica el ruido de todas las compuertas al realizar el plegado de la compuerta local.
ja: ローカルゲートのフォールデイングを実行することで、すべてのゲートのノイズを増幅します。

source: Amplifies noise of the input circuit by performing global folding of the entire input circuit.
es_un: Amplifica el ruido del circuito de entrada realizando un plegamiento global de todo el circuito de entrada.
ja: 入力回路全体の全体的なフォールディングを行うことによって、入力回路のノイズを増幅します。

source: Noise amplification factors, where `1` represents the baseline noise. They all need to be greater than or equal to the baseline.
es_un: Factores de amplificación de ruido, donde `1` representa el ruido de referencia. Todos deben ser mayores o iguales que la línea base.
ja: ノイズの増幅率。`1` はベースライン・ノイズを表します。いずれもベースライン以上であることが必要です。

source: Polynomial extrapolation of degree one.
es_un: Extrapolación polinomial de grado uno.
ja: 次数1の多項式外挿。

source: Polynomial extrapolation of degree two and lower.
es_un: Extrapolación polinomial de grado dos e inferior.
ja: 2次以下の多項式外挿。

source: Polynomial extrapolation of degree three and lower.
es_un: Extrapolación polinomial de grado tres e inferior.
ja: 3次以下の多項式外挿。

source: Polynomial extrapolation of degree four and lower.
es_un: Extrapolación polinomial de grado cuatro e inferior.
ja: 次数4以下の多項式外挿。

source: Example of adding ``resilience_options`` into your estimator session
es_un: Ejemplo de cómo agregar ``resilience_options`` en tu sesión de estimator
ja: Estimator session に ``resilience_options`` を追加する例

source: As you increase the resilience level, you will be able to use additional methods to improve the accuracy of your result. However, because the methods become more advanced with each level, they require additional sampling overhead (time) to generate more accurate expectation values. Note that higher resilience levels do not guarantee better quality. Higher levels only mean greater overhead. Each method has its strengths and weaknesses. For example, TREX (Twirled Readout Error eXtinction) is good for shallow circuits because of its readout error mitigation whereas ZNE (Zero Noise Extrapolation) is good for deeper circuits. PEC can mitigate arbitrary errors but may not work in practice because of its large overhead.
ja: Resilience level を上げると、結果の精度を向上させるために追加のメソッドを使用することができます。 しかし、レベルが上がるごとに手法が高度になるため、より正確な期待値を生成するためには、さらにサンプリングのオーバーヘッド（時間）が必要になります。 Resilience level が高いからといって、品質が保証されるわけではないことに注意してください。レベルが高いほどオーバーヘッドが大きくなるだけです。それぞれの方法は、その長所と短所があります。例えば、 TREX(Twirled Readout Error eXtinct) は読み出し誤差を軽減するために浅い回路に適していますが、ZNE(Zero Noise Extolation) はより深い回路に適しています。 PECは任意のエラーを緩和できますが、オーバーヘッドが大きいため、実際には機能しない可能性があります。

source: options.resilience.extrapolator(Optional[str])
ja: options.resilience.extrapolator(オプション[str])
