Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/how_to/error-suppression.po
Languages: es_un, ja

source: Configure error suppression
es_un: Configurar la supresión de errores
ja: Error抑制の設定

source: Error suppression techniques optimize and transform your circuit at the point of compilation to minimize errors. This is the most basic error handling technique.
es_un: Las técnicas de supresión de errores optimizan y transforman tu circuito en el punto de compilación para minimizar los errores. Esta es la técnica de manejo de errores más básica.
ja: エラー抑制技術は、コンパイルの時点で回路を最適化して変形させ、エラーを最小にする技術です。最も基本的なエラー処理技術です。

source: Error suppression typically results in some classical pre-processing overhead to your overall runtime. Therefore, it is important to achieve a balance between perfecting your results and ensuring that your job completes in a reasonable amount of time.
es_un: La supresión de errores generalmente genera una sobrecarga clásica de preprocesamiento en el tiempo de ejecución general. Por lo tanto, es importante lograr un equilibrio entre perfeccionar tus resultados y garantizar que tu trabajo (job) se complete en un tiempo razonable.
ja: エラー抑制は通常、古典的な前処理のオーバーヘッドを全体のランタイムにもたらします。したがって、結果を完璧にすることと、妥当な時間でジョブが完了することのバランスをとることが重要です。

source: Primitives let you employ error suppression techniques by setting the optimization level (``optimization_level`` option) and by choosing advanced transpilation options.
es_un: Las primitivas te permiten emplear técnicas de supresión de errores configurando el nivel de optimización (opción ``optimization_level``) y eligiendo opciones avanzadas de transpilación.
ja: Primitive では、最適化レベル (``optimization_level`` オプション) の設定や、高度なトランスパイル・オプションの選択により、エラー抑制テクニックを使用することができます。

source: Setting the optimization level
es_un: Configurar del nivel de optimización
ja: 最適化レベルの設定

source: The ``optimization_level`` setting specifies how much optimization to perform on the circuits. Higher levels generate more optimized circuits, at the expense of longer transpilation times.
es_un: La configuración ``optimization_level`` especifica cuánta optimización realizar en los circuitos. Los niveles más altos generan circuitos más optimizados, a expensas de tiempos de transpilación más largos.
ja: ``optimization_level`` の設定は、回路に対してどの程度の最適化を行うかを指定します。レベルを上げると、より最適化された回路が生成されますが、その代償としてトランスパイルの時間が長くなります。

source: Optimization Level
es_un: Nivel de Optimización
ja: 最適化レベル

source: Estimator & Sampler
es_un: Estimator y Sampler

source: No optimization: typically used for hardware characterization
es_un: Sin optimización: normalmente se utiliza para la caracterización de hardware
ja: 最適化なし：通常、ハードウェアの特性評価に使用されます。

source: basic translation
es_un: traducción básica
ja: 基本の変換

source: layout (as specified)
es_un: disposición (como se especifica)
ja: レイアウト (指定されたとおり)

source: routing (stochastic swaps)
es_un: enrutamiento (intercambios estocásticos)
ja: ルーティング (確率スワップ)

source: Light optimization:
es_un: Optimización ligera:
ja: 軽度の最適化

source: Layout (trivial → vf2 → SabreLayout if routing is required)
es_un: Disposición (trivial → vf2 → SabreLayout si se requiere enrutamiento)
ja: レイアウト (微小 → vf2 → ルーティングが必要な場合はSabreLayout)

source: routing (SabreSWAPs if needed)
es_un: enrutamiento (SabreSWAPs si es necesario)
ja: ルーティング (SabreSWAP が必要な場合)

source: 1Q gate optimization
es_un: Optimización de compuerta de 1Q
ja: 1量子ビットゲートの最適化

source: Error Suppression: Dynamical Decoupling
es_un: Supresión de Errores: Desacoplamiento Dinámico
ja: エラーの抑制: 動的デカップリング

source: Medium optimization:
es_un: Optimización media:
ja: 中程度の最適化

source: Layout/Routing: Optimization level 1 (without trivial) + heuristic optimized with greater
es_un: Disposición/Enrutamiento: Nivel de optimización 1 (sin trivial) + heurística optimizada con mayor
ja: レイアウト/ルーティング: 最適化レベル1(微小ではない)+ヒューリスティックな更なる最適化

source: search depth and trials of optimization function
es_un: profundidad de búsqueda y pruebas de función de optimización
ja: 最適化関数の深さと試行の探索

source: commutative cancellation
es_un: cancelación conmutativa
ja: 可換ゲートのキャンセル

source: High Optimization:
es_un: Optimización Alta:
ja: 高度な最適化

source: Optimization level 2 + heuristic optimized on layout/routing further with greater effort/trials
es_un: Nivel de optimización 2 + heurística optimizada en disposición/enrutamiento más con mayor esfuerzo/pruebas
ja: 最適化レベル2＋より強力な労力と試行でレイアウト/ルーティングをさらにヒューリスティックに最適化

source: 2 qubit KAK optimization
es_un: Optimización KAK de 2 qubits
ja: 2量子ビットのKAK最適化

source: Example: configure Estimator with optimization levels
es_un: Ejemplo: configurar Estimator con niveles de optimización
ja: 例: 最適化レベルを使用した Estimator の構成

source: If optimization level is not specified, the service uses ``optimization_level = 3``.
es_un: Si no se especifica el nivel de optimización, el servicio usa ``optimization_level = 3``.
ja: 最適化レベルが指定されていない場合は、サービスは ``optimization_level = 3`` を使用します。

source: Example: configure Sampler with optimization levels
es_un: Ejemplo: configurar Sampler con niveles de optimización
ja: 例: 最適化レベルを使用した Sampler の構成

source: Advanced transpilation options
es_un: Opciones avanzadas de transpilacion
ja: 高度なトランスパイル・オプション

source: You also have the ability to tune a variety of advanced options to configure your transpilation strategy further. These methods can be used alongside optimization levels. They allow you to change the options of interest and let your optimization level manage the rest.
es_un: También tienes la capacidad de ajustar una variedad de opciones avanzadas para configurar aún más tu estrategia de transpilación. Estos métodos se pueden utilizar junto con los niveles de optimización. Te permiten cambiar las opciones de interés y dejar que tu nivel de optimización administre el resto.
ja: また、トランスパイル戦略をさらに構成するために、さまざまな高度なオプションを調整することができます。これらの方法は、最適化レベルと並行して使用することができます。 これにより、関心のあるオプションを変更し、残りを最適化レベルに管理させることができます。

source: Most of the transpilation options are inherited from `qiskit.compiler.transpile <https://qiskit.org/documentation/stubs/qiskit.compiler.transpile.html>`__.
es_un: La mayoría de las opciones de transpilación se heredan de `qiskit.compiler.transpile <https://qiskit.org/documentation/stubs/qiskit.compiler.transpile.html>`__.
ja: トランスパイル・オプションのほとんどは、 `qiskit.compiler.transpile <https://qiskit.org/documentation/stubs/qiskit.compiler.transpile.html>`__ から継承されます。

source: Options
es_un: Opciones
ja: オプション

source: Description
es_un: Descripción
ja: 説明

source: Initial position of virtual qubits on physical qubits.
es_un: Posición inicial de qubits virtuales en qubits físicos.
ja: 物理量子ビットの上の仮想量子ビットの初期位置。

source: Name of layout selection pass. One of ``trivial``, ``dense``, ``noise_adaptive``, ``sabre``.
es_un: Nombre del pase de selección de la disposición. Uno de ``trivial``, ``dense``, ``noise_adaptive``, ``sabre``.
ja: レイアウト選択パスの名前。``trivial``, ``dense``, ``noise_adaptive``, ``sabre`` のいずれか。

source: Name of routing pass: ``basic``, ``lookahead``, ``stochastic``, ``sabre``, ``none``.
es_un: Nombre del pase de enrutamiento: ``basic``, ``lookahead``, ``stochastic``, ``sabre``, ``none``.
ja: ルーティングパスの名前: ``basic``, ``lookahead``, ``stochastic``, ``sabre``, ``none``.

source: This option is specific to Qiskit Runtime primitives. Allows for skipping transpilation entirely. If you use this method, make sure to verify that your circuit in written using the basis gates on the backend you are running on.
es_un: Esta opción es específica de las primitivas de Qiskit Runtime. Permite omitir la transpilación por completo. Si usas este método, asegúrate de verificar que tu circuito esté escrito usando las compuertas base en el backend en el que estás ejecutando.
ja: このオプションは Qiskit Runtime primitive に固有です。完全にトランスパイルをスキップできます。 この方法を使用する場合は、回路が実行しているバックエンドの基底ゲートを使用して書かれていることを確認してください。

source: heuristic dial used for circuit approximation (1.0=no approximation, 0.0=maximal approximation). Defaults to no approximation for all optimization levels
es_un: dial heurístico utilizado para la aproximación del circuito (1,0=sin aproximación, 0,0=aproximación máxima). El valor predeterminado es sin aproximación para todos los niveles de optimización
ja: 回路近似に使用されるヒューリスティック・ダイアル (1.0=近似なし、0.0=最大近似)。デフォルトはすべての最適化レベルの近似なしです。

source: 3 (default)
ja: 3 (デフォルト)
