Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/how_to/error-mitigation.po
Languages: es_un, ja

source: Configure error mitigation
es_un: Configurar la mitigación de errores
ja: 誤り軽減の設定

source: Error mitigation techniques allow users to mitigate circuit errors by modeling the device noise at the time of execution. This typically results in quantum pre-processing overhead related to model training and classical post-processing overhead to mitigate errors in the raw results by using the generated model.
es_un: Las técnicas de mitigación de errores permiten a los usuarios mitigar los errores del circuito modelando el ruido del dispositivo en el momento de la ejecución. Esto generalmente da como resultado una sobrecarga de preprocesamiento cuántico relacionada con el entrenamiento del modelo y una sobrecarga de posprocesamiento clásico para mitigar los errores en los resultados sin procesar mediante el uso del modelo generado.
ja: 誤り軽減技術により、ユーザーは実行時のデバイス・ノイズをモデル化することで、回路エラーを軽減できます。 これは通常、モデルのトレーニングに関連する量子的な前処理のオーバーヘッドと、生成モデルを使用して生の結果のエラーを軽減するための古典的な後処理のオーバーヘッドになります。

source: The error mitigation techniques built in to primitives are advanced resilience options. To specify these options, use the ``resilience_level`` option when submitting your job.
es_un: Las técnicas de mitigación de errores integradas en las primitivas son opciones de resiliencia avanzadas. Para especificar estas opciones, utiliza la opción ``resilience_level`` al enviar tu trabajo (job).
ja: Primitive に組み込まれているエラー緩和手法には、高度なレジリエンス・オプションがあります。これらのオプションを指定するには、ジョブを送信するときに ``resilience_level`` オプションを使います。

source: The resilience level specifies how much resilience to build against errors. Higher levels generate more accurate results, at the expense of longer processing times. Resilience levels can be used to configure the cost/accuracy trade-off when applying error mitigation to your primitive query. Error mitigation reduces errors (bias) in results by processing the outputs from a collection, or ensemble, of related circuits. The degree of error reduction depends on the method applied. The resilience level abstracts the detailed choice of error mitigation method to allow users to reason about the cost/accuracy trade that is appropriate to their application.
es_un: El nivel de resiliencia especifica cuánta resiliencia construir contra los errores. Los niveles más altos generan resultados más precisos, a expensas de tiempos de procesamiento más prolongados. Los niveles de resiliencia se pueden usar para configurar el equilibrio costo/precisión al aplicar la mitigación de errores a tu consulta primitiva. La mitigación de errores reduce los errores (sesgo) en los resultados al procesar las salidas de una colección o conjunto de circuitos relacionados. El grado de reducción de errores depende del método aplicado. El nivel de resiliencia abstrae la elección detallada del método de mitigación de errores para permitir a los usuarios razonar sobre el intercambio de costo/precisión que es apropiado para su aplicación.
ja: resilience levelでは、エラーに対してどの程度のresilienceを構築するかを指定します。レベルが高いほど、処理時間が長くなりますが、より正確な結果が生成されます。resilience levelを使用しprimitiveクエリーに誤り軽減を適用することで、コスト／精度のトレードオフを構成できます。誤り軽減は、関連する回路のコレクションまたはアンサンブルからの出力を処理することにより、結果のエラー (バイアス) を削減します。誤り削減の程度は、適用される手法によって異なります。resilience levelは誤り軽減手法の詳細な選択を抽象化し、ユーザーがアプリケーションに適したコスト／精度のトレードについて推論できるようにします。

source: Given this, each level corresponds to a method or methods with increasing level of quantum sampling overhead to enable you experiment with different time-accuracy tradeoffs. The following table shows you which levels and corresponding methods are available for each of the primitives.
es_un: Dado esto, cada nivel corresponde a un método o métodos con un nivel creciente de sobrecarga de muestreo cuántico para permitirte experimentar con diferentes compensaciones de precisión de tiempo. La siguiente tabla te muestra qué niveles y métodos correspondientes están disponibles para cada una de las primitivas.
ja: これを考えると、それぞれのレベルは、量子サンプリングのオーバーヘッドのレベルに応じた1つまたは複数のメソッドに対応しており、時間対精度のトレードオフの異なった組み合わせを試すことができます。 次の表は、それぞれのprimitive ごとの、使用できるレベルと対応するメソッドを示しています。

source: Error mitigation is task specific so the techniques you are able to apply vary based whether you are sampling a distribution or generating expectation values.
es_un: La mitigación de errores es específica de la tarea, por lo que las técnicas que puedes aplicar varían en función de si estás muestreando una distribución o generando valores esperados.
ja: エラー緩和はタスク固有のものなので、分布値をサンプリングするか期待値を生成するかによって、適用できるテクニックはさまざまに異なります。

source: Resilience Level
es_un: Nivel de Resiliencia

source: Definition
es_un: Definición
ja: 定義

source: No mitigation
es_un: Sin mitigación
ja: 緩和なし

source: None
es_un: Ninguna
ja: 無し

source: Minimal mitigation costs: Mitigate error associated with readout errors
es_un: Costos mínimos de mitigación: Mitigar el error asociado con los errores de lectura
ja: 最小の軽減コスト: 読み出しエラーに関連するエラーを軽減します。

source: Twirled Readout Error eXtinction (:ref:`TREX <TREX>`)
es_un: Extinción de Error de Lectura Torcida (:ref:`TREX <TREX>`)
ja: トワイルド・リードアウトエラー・エクスティンクション (:ref:`TREX <TREX>`)

source: Medium mitigation costs. Typically reduces bias in estimators, but is not guaranteed to be zero bias.
es_un: Costos de mitigación medios. Por lo general, reduce el sesgo en los estimators, pero no se garantiza que sea un sesgo cero.
ja: 中程度の軽減コスト。通常、estimatorのバイアスを削減しますが、バイアスがゼロであることは保証されていません。

source: Zero Noise Extrapolation (:ref:`ZNE <ZNE>`)
es_un: Extrapolación de Ruido Cero (:ref:`ZNE <ZNE>`)
ja: ゼロノイズ外挿（:ref:`ZNE <ZNE>`）

source: Heavy mitigation with layer sampling. Theoretically expected to deliver zero bias estimators.
es_un: Mitigación intensa con muestreo de capas. Teóricamente se espera que entregue estimadores de sesgo cero.
ja: レイヤー・サンプリングによる重い軽減。理論的には、ゼロバイアスのestimatorが得られることが期待されている。

source: Probabilistic Error Cancellation (:ref:`PEC <PEC>`)
es_un: Cancelación Probabilística de Errores (:ref:`PEC <PEC>`)
ja: 確率論的エラーキャンセル (:ref:`PEC <PEC>`)

source: Resilience levels are currently in beta so sampling overhead and solution quality will vary from circuit to circuit. New features, advanced options and management tools will be released on a rolling basis. Specific error mitigation methods are not guaranteed to be applied at each resilience level.
es_un: Los niveles de resiliencia se encuentran actualmente en versión beta, por lo que la sobrecarga de muestreo y la calidad de la solución variarán de un circuito a otro. Se lanzarán nuevas funciones, opciones avanzadas y herramientas de administración de forma continua. No se garantiza que se apliquen métodos específicos de mitigación de errores en cada nivel de resiliencia.
ja: Resilience levelは現在ベータ版のため、サンプリングのオーバーヘッドとソリューションの品質は回路によって異なります。 新機能、高度なオプションおよび管理ツールは、順次リリースされる予定です。 具体的なエラー軽減方法は、各Resilience levelで適用されることを保証するものではありません。

source: Configure the Estimator with resilience levels
es_un: Configurar el Estimator con niveles de resiliencia
ja: Resilience levelによるestimatorの設定

source: No error mitigation is applied to the user program.
es_un: No se aplica mitigación de errores al programa de usuario.
ja: ユーザープログラムにエラー軽減は適用されません。

source: Level 1 applies error mitigation methods that particularly address readout errors. In the Estimator, we apply a model-free technique known as Twirled Readout Error eXtinction (TREX). It reduces measurement error by diagonalizing the noise channel associated with measurement by randomly flipping qubits through X gates immediately before measurement, and flipping the corresponding measured bit if an X gate was applied. A rescaling term from the diagonal noise channel is learned by benchmarking random circuits initialized in the zero state. This allows the service to remove bias from expectation values that result from readout noise. This approach is described further in `Model-free readout-error mitigation for quantum expectation values <https://arxiv.org/abs/2012.09738>`__.
es_un: El nivel 1 aplica métodos de mitigación de errores que abordan en particular los errores de lectura. En el Estimator, aplicamos una técnica sin modelo conocida como Extinción de Error de Lectura Torcida (Twirled Readout Error eXtinction, TREX). Reduce el error de medición al diagonalizar el canal de ruido asociado con la medición mediante la inversión aleatoria de qubits a través de compuertas X inmediatamente antes de la medición, y la inversión del bit medido correspondiente si se aplicó una compuerta X. Se aprende un término de reescalado del canal de ruido diagonal comparando circuitos aleatorios inicializados en el estado cero. Esto permite que el servicio elimine el sesgo de los valores esperados que resultan del ruido de lectura. Este enfoque se describe con más detalle en `Model-free readout-error mitigation for quantum expectation values <https://arxiv.org/abs/2012.09738>`__.
ja: Level 1では、特に読み出しエラーに対応したエラー緩和手法を適用しています。Estimator では、TREX（Twirled Readout Error eXtinction）と呼ばれるモデルフリー技術を適用しています。これは、測定直前にXゲートを介してランダムに量子ビットを反転させ、Xゲートが適用された場合には対応する測定ビットを反転させることにより、測定に関連するノイズチャンネルを対角化することで測定誤差を低減するものです。対角化されたノイズチャンネルからのリスケーリング項は、ゼロ状態で初期化されたランダム回路のベンチマークによって学習されます。これにより、読み出しノイズに起因する期待値からのバイアスを除去することができます。この手法については、`Model-free readout-error mitigation for quantum expectation values <https://arxiv.org/abs/2012.09738>`__で詳しく説明しています。

source: Level 2 uses the Zero Noise Extrapolation method (ZNE) which computes an expectation value of the observable for different noise factors (amplification stage) and then uses the measured expectation values to infer the ideal expectation value at the zero-noise limit (extrapolation stage). This approach tends to reduce errors in expectation values, but is not guaranteed to produce an unbiased result.
es_un: El nivel 2 usa el método de Extrapolación de Ruido Cero (Zero Noise Extrapolation, ZNE) que calcula un valor esperado del observable para diferentes factores de ruido (etapa de amplificación) y luego usa los valores esperados medidos para inferir el valor esperado ideal en el límite de ruido cero (etapa de extrapolación). Este enfoque tiende a reducir los errores en los valores esperados, pero no garantiza que produzca un resultado sin sesgo.
ja: Level 2では、ゼロノイズ外挿法（ZNE）を用いて、異なるノイズ因子に対する観測値の期待値を計算し（増幅ステージ）、測定した期待値を用いてゼロノイズ限界における理想的な期待値を推測します（外挿ステージ）。この方法は期待値の誤差を少なくする傾向がありますが、不偏の結果を得ることが保証されているわけではありません。

source: This image shows a graph that compares the noise amplification factor to expectation values.
es_un: Esta imagen muestra una gráfica que compara el factor de amplificación de ruido con los valores esperados.
ja: この画像は、ノイズの増幅率を期待値と比較したグラフです。

source: Illustration of the ZNE method
es_un: Ilustración del método ZNE
ja: ZNE方式の図

source: The overhead of this method scales with the number of noise factors. The default settings sample the expectation value at three noise factors, leading to a roughly 3x overhead when employing this resilience level.
es_un: La sobrecarga de este método escala con el número de factores de ruido. La configuración predeterminada muestra el valor esperado en tres factores de ruido, lo que lleva a una sobrecarga de aproximadamente 3 veces cuando se emplea este nivel de resiliencia.
ja: この方法のオーバーヘッドは、ノイズファクターの数でスケールします。デフォルトの設定では、3つのノイズファクターで期待値をサンプリングするため、このresilience levelを採用した場合、およそ3倍のオーバーヘッドとなります。

source: Level 3 enables the Probabilistic Error Cancellation (PEC) method. This approach mitigates error by learning and inverting a sparse noise model that is able to capture correlated noise. PEC returns an unbiased estimate of an expectation value so long as learned noise model faithfully represents the actual noise model at the time of mitigation. In practice, the experimental procedure for learning the noise model has ambiguities due to certain error terms that cannot be independently distinguished. These are resolved by a symmetry assumption, which depending on the true underlying noise may lead a biased estimate of the mitigated expectation values due to using an imperfect noise model.
es_un: El nivel 3 habilita el método de Cancelación Probabilística de Errores (Probabilistic Error Cancellation, PEC). Este enfoque mitiga el error al aprender e invertir un modelo de ruido disperso que puede capturar el ruido correlacionado. PEC devuelve una estimación sin sesgo de un valor esperado siempre que el modelo de ruido aprendido represente fielmente el modelo de ruido real en el momento de la mitigación. En la práctica, el procedimiento experimental para aprender el modelo de ruido tiene ambigüedades debido a ciertos términos de error que no se pueden distinguir de forma independiente. Estos se resuelven mediante una suposición de simetría que, dependiendo del verdadero ruido subyacente, puede conducir a una estimación sesgada de los valores esperados mitigados debido al uso de un modelo de ruido imperfecto.
ja: Level 3では、PEC（Probabilistic Error Cancellation）方式を実現しました。この手法は、相関のあるノイズを捉えることができる疎なノイズモデルを学習し、反転させることでエラーを軽減するものです。PECは、学習されたノイズモデルが軽減時の実際のノイズモデルを忠実に表現している限り、期待値の不偏推定値を返します。 実際には、ノイズモデルを学習する実験手順は、独立に区別できないある種の誤差項による曖昧さがあります。これらは対称性の仮定によって解決されるが、真の基底ノイズによっては、不完全なノイズモデルを使用することにより、軽減された期待値の推定値に偏りが生じる可能性があります。

source: The Qiskit Runtime primitive implementation of PEC specifically addresses noise in self-inverse two-qubit gates, so it first *stratifies* each input circuit into an alternating sequence of simultaneous 1-qubit gates followed by a layer of simultaneous 2-qubit gates. Then it learns the noise model associated with each unique 2-qubit gate layer.
es_un: La implementación primitiva de Qiskit Runtime de PEC aborda específicamente el ruido en las compuertas autoinversas de dos qubits, por lo que primero *estratifica* cada circuito de entrada en una secuencia alterna de compuertas simultáneas de 1 qubit seguidas de una capa de compuertas simultáneas de 2 qubits. Luego aprende el modelo de ruido asociado con cada capa única de compuerta de 2 qubits.
ja: PECのQiskit Runtime Primitives 実装は、特に自己逆2量子ビットゲートにおけるノイズを扱うため、まず各入力回路を、同時1量子ビットゲートと同時2量子ビットゲートの層が交互に並ぶように *層別* します。そして、それぞれの2量子ビットゲート層に関連するノイズモデルを学習します。

source: This image shows a stratified circuit.
es_un: Esta imagen muestra un circuito estratificado.
ja: この図は層化された回路を示しています。

source: This is an example of a `stratified` circuit, where the layers of two-qubit gates are labeled layer 1 through n. Note that each :math:`U_l` is composed of two-qubit gates on the native connectivity graph of the quantum processor. The open boxes represent arbitrary single-qubit gates.
es_un: Este es un ejemplo de un circuito `estratificado`, donde las capas de compuertas de dos qubits están etiquetadas como capa 1 a n. Ten en cuenta que cada :math:`U_l` se compone de compuertas de dos qubits en la gráfica de conectividad nativa del procesador cuántico. Las cajas vacías representan compuertas arbitrarias de un solo qubit.
ja: 層別回路の例で、2量子ビットゲートの層は1層からn層とラベル付けされています。各 :math:`U_l` は量子プロセッサーのネイティブな接続グラフ上の2量子ビットゲートで構成されていることに注意してください。文字の入っていないボックスは、任意の1量子ビットゲートを表しています。

source: PEC uses a quasi-probability method to mimic the effect of inverting the learned noise. This requires sampling from a randomized circuit family associated with the user’s original circuit. Applying PEC will increase the variability of the returned expectation value estimates unless the number of samples per circuit is also increased for both input and characterization circuits. The amount of samples required to counter this variability scales exponentially with the noise strength of the mitigated circuit.
es_un: PEC utiliza un método de cuasi probabilidad para imitar el efecto de invertir el ruido aprendido. Esto requiere el muestreo de una familia de circuitos aleatorios asociada con el circuito original del usuario. La aplicación de PEC aumentará la variabilidad de las estimaciones del valor esperado devuelto, a menos que también aumente el número de muestras por circuito para los circuitos de entrada y de caracterización. La cantidad de muestras necesarias para contrarrestar esta variabilidad aumenta exponencialmente con la intensidad del ruido del circuito mitigado.
ja: PECは、学習したノイズを反転させる効果を模倣するために、準確率的な方法を使用します。このため、ユーザーの元の回路に関連するランダムな回路ファミリーからサンプリングする必要があります。PECを適用すると、入力回路と特性化回路の両方について回路あたりのサンプル数を増やさない限り、返される期待値推定値のばらつきが大きくなります。このばらつきに対処するために必要なサンプル数は、軽減された回路のノイズ強度に対して指数関数的に増加します。

source: How this works:
es_un: Cómo funciona esto:
ja: 動作説明：

source: When estimating an unmitigated Pauli observable :math:`\langle P\rangle` the standard error in the estimated expectation value is given by :math:`\frac{1}{\sqrt{N_{\mbox{shots}}}}\left(1- \langle P\rangle^2\right)` where :math:`N_{\mbox{shots}}` is the number of shots used to estimate :math:`\langle P\rangle`. When applying PEC mitigation, the standard error becomes :math:`\sqrt{\frac{S}{N_{\mbox{samples}}}}\left(1- \langle P\rangle^2\right)` where :math:`N_{\mbox{samples}}` is the number of PEC samples.
es_un: Al estimar un observable de Pauli no mitigado :math:`\langle P\rangle` el error estándar en el valor esperado estimado viene dado por :math:`\frac{1}{\sqrt{N_{\mbox{shots}}}}\left(1- \langle P\rangle^2\right)` donde :math:`N_{\mbox{shots}}` es el número de iteraciones usadas para estimar :math:`\langle P\rangle`. Al aplicar la mitigación de PEC, el error estándar se convierte en :math:`\sqrt{\frac{S}{N_{\mbox{samples}}}}\left(1- \langle P\rangle^2\right)` donde :math:`N_{\mbox{samples}}` es el número de muestras de PEC.
ja: 軽減されていないパウリの観測量 :math:`\langle P\rangle` を推定する場合、推定された期待値の標準誤差は :math:`\frac{1}{\sqrt{N_{\mbox{shots}}}}\left(1- \langle P\rangle^2\right)` で与えられます。ここで :math:`N_{\mbox{shots}}` は :math:`\langle P\rangle` を推定するために使用されるショット数です。 PEC軽減を適用すると、標準誤差は :math:`\sqrt{\frac{S}{N_{\mbox{samples}}}}\left(1- \langle P\rangle^2\right)` になります。 :math:`N_{\mbox{samples}}` は PEC サンプルの数です。

source: The sampling overhead scales exponentially with a parameter that characterizes the collective noise of the input circuit. As the Qiskit Runtime primitive learns the noise of your circuit, it will return metadata about the sampling overhead associated with that particular layer. Let's label the overhead of layer :math:`l` as :math:`\gamma_l`. Then the total sampling overhead for mitigating your circuit is the product of all the layer overheads, that is:
es_un: La sobrecarga de muestreo escala exponencialmente con un parámetro que caracteriza el ruido colectivo del circuito de entrada. A medida que la primitiva de Qiskit Runtime aprenda el ruido de tu circuito, devolverá metadatos sobre la sobrecarga de muestreo asociada con esa capa en particular. Etiquetemos la sobrecarga de la capa :math:`l` como :math:`\gamma_l`. Entonces, la sobrecarga de muestreo total para mitigar tu circuito es el producto de todas las sobrecargas de capa, es decir:
ja: サンプリング・オーバーヘッドは、入力回路の集合的なノイズを特徴付けるパラメーターで指数関数的にスケールします。Qiskit Runtime Primitives は回路のノイズを学習すると、その特定のレイヤーに関連するサンプリング・オーバーヘッドに関するメタデータを返します。 ここでは、レイヤー :math:`l` のオーバーヘッドを :math:`\gamma_l` とラベル付けしてみましょう。そして、回路を軽減するための総サンプリング・オーバーヘッドは、すべてのレイヤーのオーバーヘッドの積、つまり、以下の通りです。

source: When the Estimator completes the model-learning phase of the primitive query, it will return metadata about the total sampling overhead for circuit.
es_un: Cuando el Estimator complete la fase de aprendizaje del modelo de la consulta primitiva, devolverá metadatos sobre la sobrecarga de muestreo total para el circuito.
ja: Estimator がPrimitiveのクエリーのモデル学習フェーズを完了すると、回路の総サンプリング・オーバーヘッドに関するメタデータが返されます。

source: Depending on the precision required by your application, you will need to scale the number of samples accordingly. The following plot illustrates the relationship between estimator error and number of circuit samples for different total sampling overheads.
es_un: Dependiendo de la precisión requerida por tu aplicación, deberás escalar el número de muestras en consecuencia. La siguiente gráfica ilustra la relación entre el error del estimator y el número de muestras del circuito para diferentes sobrecargas de muestreo totales.
ja: アプリケーションで要求される精度に応じて、サンプル数を適宜増減させる必要があります。以下のプロットは、異なるサンプリング・オーバーヘッドの場合のEstimator エラーと回路サンプル数の関係を示しています。

source: This image shows that sampling overhead goes down as the number of samples increases.
es_un: Esta imagen muestra que la sobrecarga de muestreo disminuye a medida que aumenta el número de muestras.
ja: このイメージは、サンプル数が増加すると、 サンプリング・オーバーヘッドが減少することを示しています。

source: Note that the number of samples required to deliver a desired accuracy is not known before the primitive query because the mitigation scaling factor is discovered during the learning phase of PEC.
es_un: Ten en cuenta que la cantidad de muestras requeridas para brindar la precisión deseada no se conoce antes de la consulta primitiva porque el factor de escala de mitigación se descubre durante la fase de aprendizaje de PEC.
ja: なお、軽減スケーリング・ファクターはPECの学習段階で発見されるため、所望の精度を実現するために必要なサンプル数は、Primitive クエリーの前にはわからないことに注意してください。

source: We suggest starting with short depth circuits to get a feel for the scaling of the sampling overhead of PEC before attempting larger problems.
es_un: Sigerimos comenzar con circuitos de profundidad corta para tener una idea de la escala de la sobrecarga de muestreo de PEC antes de intentar problemas más grandes.
ja: より大きな問題に挑戦する前に、PECのサンプリング・オーバーヘッドのスケーリングに関する感触を得るために、短い深さの回路から始めることをお勧めします。

source: Example
es_un: Ejemplo
ja: 例

source: The Estimator interface lets users seamlessly work with the variety of error mitigation methods to reduce error in expectation values of observables. The following code uses Zero Noise Extrapolation by simply setting ``resilience_level 2``.
es_un: La interfaz de Estimator permite a los usuarios trabajar sin problemas con la variedad de métodos de mitigación de errores para reducir el error en los valores esperados de los observables. El siguiente código usa la Extrapolación de Ruido Cero (Zero Noise Extrapolation) simplemente configurando ``resilience_level 2``.
ja: Estimatorのインターフェースでは、観測値の期待値の誤差を軽減するために、様々なエラー緩和手法をシームレスに使用することができます。次のコードでは、単純に ``resilience_level 2`` を設定することで、ゼロノイズ外挿を使用しています。

source: As you increase the resilience level, you will be able to use additional methods to improve the accuracy of your result. However, because the methods become more advanced with each level, they require additional sampling overhead (time) to generate more accurate expectation values.
es_un: A medida que aumentes el nivel de resiliencia, podrás usar métodos adicionales para mejorar la precisión de tu resultado. Sin embargo, debido a que los métodos se vuelven más avanzados con cada nivel, requieren una sobrecarga de muestreo adicional (tiempo) para generar valores esperados más precisos.

source: Configure Sampler with resilience levels
es_un: Configurar Sampler con niveles de resiliencia
ja: Resilience levelによるSampler の設定

source: The Sampler default resilience setting (level 1) enables readout error mitigation to allow users to generate mitigated quasi-probability distributions.
es_un: La configuración de resiliencia predeterminada de Sampler (nivel 1) habilita la mitigación de errores de lectura para que los usuarios puedan generar distribuciones de cuasi probabilidad mitigadas.
ja: Samplerのデフォルトのresilience設定（level 1）では、読み出し誤差を緩和し、緩和された準確率分布を生成することができます。
