Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/how_to/filter_backends.po
Languages: es_un, fr_fr, ja_jp, ko_kr, pt_un

source: This page was generated from `docs/how_to/filter_backends.ipynb`__.
es_un: Esta página fue generada a partir de `docs/how_to/filter_backends.ipynb`__.
fr_fr: Cette page a été traduite et générée à partir de `docs/how_to/filter_backends.ipynb`__.
ja_jp: このページは `docs/how_to/filter_backends.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/03_backends.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/how_to/filter_backends.ipynb`__.

source: Filter backends
es_un: Filtrar backends
fr_fr: Filtrer les backends
ja_jp: バックエンドをフィルターする
ko_kr: 백엔드 필터링
pt_un: Filtrar backends

source: This guide shows you how to apply filters for selecting backends.
es_un: Esta guía te muestra cómo aplicar filtros para seleccionar backends.
fr_fr: Ce guide vous montre comment appliquer des filtres pour la sélection des backends.
ja_jp: このガイドでは、バックエンドの選択の際にフィルターする方法を説明します。
ko_kr: 이 가이드는 백엔드의 선택을 위해 필터를 적용하는 방법을 설명한다.
pt_un: Este guia mostra como aplicar filtros para selecionar backends.

source: Before you begin
es_un: Antes de que empieces
fr_fr: Avant de commencer
ja_jp: 始める前に
ko_kr: 시작하기 전에
pt_un: Antes de começar

source: Throughout this guide, we will assume that you have `setup the Qiskit Runtime service instance <../getting_started.rst>`__ and initialize it as ``service``:
es_un: A lo largo de esta guía, supondremos que has `configurado la instancia del servicio Qiskit Runtime <../getting_started.rst>`__ e inicializado como ``service``:
fr_fr: Tout au long de ce guide, nous supposerons que vous avez `configuré l'instance de service Qiskit Runtime <../getting_started.rst>` __ et l'initialisez en tant que ``service ``:
ja_jp: このガイド全体を通して、 `Qiskit Runtime サービス・インスタンス <../getting_started.rst>`__ をセットアップし、それを ``service`` として初期化すると仮定します。
ko_kr: 이 가이드에서 `Qiskit Runtime service 가 설치<../getting_started.rst>`__ 되어 있다고 가정한다. 그리고 이를 ``service``객체로 초기화한다:
pt_un: Ao longo deste guia, vamos supor que você tenha `configurado a instância do serviço Qiskit Runtime <../getting_started.rst>`__ e inicializado como ``service``:

source: Filtering options
es_un: Opciones de filtrado
fr_fr: Options de filtrage
ja_jp: フィルター・オプション
ko_kr: 필터링 옵션
pt_un: Opções de filtragem

source: You can apply filters for choosing backends including the following options: ``name``, ``min_num_qubits``, ``instance``, ``filters`` and ``**kwargs``. See `the API reference <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.backends.html>`__ for more details. Code examples for each option are shown in the following sections.
es_un: Puedes aplicar filtros para elegir backends, incluidas las siguientes opciones: ``name``, ``min_num_qubits``, ``instance``, ``filters`` y ``**kwargs``. Consulta `la referencia de la API <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.backends.html>`__ para obtener más detalles. Los ejemplos de código para cada opción se muestran en las siguientes secciones.
fr_fr: Vous pouvez appliquer des filtres pour choisir des backends incluant les options suivantes : ``name``, ``min_num_qubits``, ``instance``, ``filters`` et ``**kwargs``. Voir `la référence de l'API <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.backends.html>`__ pour plus de détails. Des exemples de code pour chaque option sont affichés dans les sections suivantes.
ja_jp: 次のオプションを含むバックエンドを選択するためのフィルターを適用できます： ``name``, ``min_num_qubits``, ``instance``, ``filters`` および ``**kwargs``。詳細については、 `API リファレンス <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.backends.html>`__ を参照してください。 次のセクションでは、各オプションのコード例を示します。
ko_kr: 백엔드를 선택하기 위해 다음의 옵션들로 필터를 적용할 수 있다: ``name``, ``min_num_qubits``, ``instance``, ``filters``, ``**kwargs``. 자세한 내용은 `API 레퍼런스 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.backends.html>`__ 를 참조하여 알 수 있다. 각 옵션에 대한 예시 코드는 다음 섹션들에 표시되어 있다.
pt_un: Você pode aplicar filtros para escolher backends incluindo as seguintes opções: ``name``, ``min_num_qubits``, ``instance``, ``filters`` e ``**kwargs``. Consulte `a referência da API <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.backends.html>`__ para obter mais detalhes. Exemplos de código para cada opção são mostrados nas seções a seguir.

source: Note
es_un: Nota
fr_fr: Remarque
ja_jp: 注記
ko_kr: 노트
pt_un: Nota

source: The output of the following cells will depend on the channel (IBM Quantum or IBM Cloud) you are accessing Qiskit Runtime, the hub/group/project (for IBM Quantum) or the plan (for IBM Cloud).
es_un: La salida de las siguientes celdas dependerá del canal (IBM Quantum o IBM Cloud) del cual estás accediendo Qiskit Runtime, el hub/group/project (para IBM Quantum) o el plan (para IBM Cloud).
fr_fr: La sortie des cellules suivantes dépend du canal (IBM Quantum ou IBM Cloud) auquel vous accédez à Qiskit Runtime, le projet hub/group/project (pour IBM Quantum) ou le plan (pour IBM Cloud).
ja_jp: 以下のセルの出力は、Qiskit Runtime にアクセスしているチャネル（IBM Quantum またはIBM Cloud）、hub/group/project（IBM Quantum の場合）、または plan（IBM Cloudの場合）によって異なります。
ko_kr: 아래 셀들의 실행 결과는 사용하는 Qiskit Runtime의 채널(IBM Quantum 또는 IBM Cloud), hub/group/project (IBM Quantum의 경우), 또는 플랜(IBM Cloud) 에 따라 달라질 수 있다.
pt_un: A saída das células a seguir dependerá do canal (IBM Quantum ou IBM Cloud) que você está acessando o Qiskit Runtime, o hub/group/project (para IBM Quantum) ou o plan (para IBM Cloud).

source: Filter by backend name
es_un: Filtrar por nombre del backend
fr_fr: Filtrer par nom de backend
ja_jp: バックエンド名によるフィルター
ko_kr: 백엔드 이름으로 필터링
pt_un: Filtrar pelo nome do backend

source: You can choose a backend by specifying the backend name. Here is an example to get the ``ibmq_qasm_simulator`` backend:
es_un: Puedes elegir un backend especificando el nombre del mismo. Aquí hay un ejemplo para obtener el backend ``ibmq_qasm_simulator``:
fr_fr: Vous pouvez choisir un backend en spécifiant le nom du backend. Voici un exemple pour obtenir le backend ``ibmq_qasm_simulateur`` :
ja_jp: バックエンド名を指定することにより、バックエンドを選択できます。 以下に、 ``ibmq_qasm_simulator`` バックエンドを取得する例を示します。
ko_kr: 백엔드 이름을 지정하여 백엔드를 선택할 수 있다. 다음은 ``ibmq_qasm_simulator`` 백엔드를 가져오는 예시이다:
pt_un: Você pode escolher um backend especificando o nome do mesmo. Aqui está um exemplo para obter o backend ``ibmq_qasm_simulator``:

source: Filter by minimum number of qubits
es_un: Filtrar por número mínimo de qubits
fr_fr: Filtrer par nombre minimum de qubits
ja_jp: 最小量子ビット数によるフィルター
ko_kr: 최소 큐비트 수로 필터링
pt_un: Filtrar por número mínimo de qubits

source: You can filter backends by specifying the minimum number of qubits. Here is an example to get backends that has at least 20 qubits:
es_un: Puedes filtrar backends especificando la cantidad mínima de qubits. Aquí hay un ejemplo para obtener backends que tienen al menos 20 qubits:
fr_fr: Vous pouvez filtrer les backends en spécifiant le nombre minimum de qubits. Voici un exemple pour obtenir des backends qui ont au moins 20 qubits:
ja_jp: 最小量子ビット数を指定することにより、バックエンドをフィルタリングできます。 以下に、 20 個以上の量子ビットを持つバックエンドを取得する例を示します。
ko_kr: 최소 큐비트 수를 지정하여 백엔드를 필터링할 수 있다. 다음은 20개 이상의 큐비트가 있는 백엔드를 가져오는 예시이다:
pt_un: Você pode filtrar backends especificando o número mínimo de qubits. Aqui está um exemplo para obter backends com pelo menos 20 qubits:

source: Filter by IBM Quantum hub/group/project
es_un: Filtrar por hub/group/project de IBM Quantum
fr_fr: Filtrer par IBM Quantum hub/groupe/projet
ja_jp: IBM Quantum hub/group/project によるフィルター
ko_kr: IBM Quantum hub/group/project로 필터링
pt_un: Filtrar por hub/group/project do IBM Quantum

source: If you are accessing Qiskit Runtime service from IBM Quantum platform, you can filter backends using the ``hub/group/project`` format. See `IBM Quantum account page <https://quantum-computing.ibm.com/account>`__ for the list of hub/group/project you have access to. Here is an example to get backends that are available to the default IBM Quantum open access hub/group/project:
es_un: Si accedes al servicio Qiskit Runtime desde la plataforma IBM Quantum, puedes filtrar los backends utilizando el formato ``hub/group/project``. Consulta la `página de cuenta de IBM Quantum <https://quantum-computing.ibm.com/account>`__ para ver la lista de hub/group/project a los que tienes acceso. Este es un ejemplo para obtener backends que están disponibles para el hub/group/project de acceso abierto predeterminado de IBM Quantum:
fr_fr: Si vous accédez au service Qiskit Runtime à partir de la plateforme IBM Quantum, vous pouvez filtrer les backends en utilisant le format ``hub/group/project``. Consultez la `page de compte IBM Quantum <https://quantum-computing.ibm.com/account>`__ pour la liste de hub/group/project auxquels vous avez accès. Voici un exemple pour obtenir des backends qui sont disponibles pour le hub/group/project d'accès ouvert IBM Quantum par défaut :
ja_jp: IBM Quantum プラットフォームから Qiskit Runtime サービスにアクセスしている場合は、 ``hub/group/project`` フォーマットを使用してバックエンドをフィルターに掛けることができます。 アクセス権限のある hub/group/project のリストについては `IBM Quantum アカウント・ページ <https://quantum-computing.ibm.com/account>`__ を参照してください。 以下は、デフォルトの IBM Quantum オープン・アクセス hub/group/project で使用可能なバックエンドを取得する例です。
ko_kr: IBM Quantum platform으로 Qiskit Runtime 서비스에 액세스하는 경우에는 ``hub/group/project`` 형식을 사용하여 백엔드를 필터링할 수 있다. 액세스 권한이 있는 hub/group/project 목록은 `IBM Quantum 계정 <https://quantum-computing.ibm.com/account>`__ 을 참조한다. 다음은 기본값인 오픈 액세스 hub/group/project에 사용할 수 있는 백엔드를 가져오는 예시이다:
pt_un: Se você estiver acessando o serviço Qiskit Runtime da plataforma IBM Quantum, poderá filtrar backends usando o formato ``hub/group/project``. Consulte `Página de conta do IBM Quantum <https://quantum-computing.ibm.com/account>`__ para obter a lista de hub/group/project ao qual você tem acesso. Aqui está um exemplo para obter backends que estão disponíveis para o hub/group/project de acesso aberto padrão do IBM Quantum:

source: Filter by complex filters
es_un: Filtrar por filtros complejos
fr_fr: Filtrer par filtres complexes
ja_jp: 複合フィルターによるフィルター
ko_kr: 복합 필터를 이용한 필터링
pt_un: Filtrar por filtros complexos

source: You can also apply more complex filters such as lambda functions. Here is an example to get backends that has quantum volume of 32 or above:
es_un: También puedes aplicar filtros más complejos, como funciones lambda. Aquí hay un ejemplo para obtener backends que tienen un volumen cuántico de 32 o superior:
fr_fr: Vous pouvez également appliquer des filtres plus complexes tels que les fonctions lambda. Voici un exemple pour obtenir des backends qui ont un volume quantique de 32 ou plus :
ja_jp: ラムダ関数などのより複雑なフィルターを適用することもできます。 以下に、量子ボリューム数が 32 以上のバックエンドを取得する例を示します。
ko_kr: 람다 함수를 이용해 더 복잡한 필터를 적용할 수도 있다. 다음은 32이상의 양자 볼륨을 가진 백엔드를 가져오는 예시이다:
pt_un: Você também pode aplicar filtros mais complexos, como funções lambda. Aqui está um exemplo para obter backends com volume quântico de 32 ou superior:
