Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/how_to/noisy_simulators.po
Languages: es_un, ja

source: Noisy simulators in Qiskit Runtime
es_un: Simuladores ruidosos en Qiskit Runtime

source: This notebook shows how to set up ``ibmq_qasm_simulator`` and map a basic noise model for an IBM Quantum hardware device in **Qiskit Runtime**, and use this noise model to perform noisy simulations of ``QuantumCircuits`` using ``Sampler`` and ``Estimator`` to study the effects of errors which occur on real devices.
es_un: Este cuaderno muestra cómo configurar ``ibmq_qasm_simulator`` y mapear un modelo de ruido básico para un dispositivo de hardware IBM Quantum en **Qiskit Runtime**, y usar este modelo de ruido para realizar simulaciones ruidosas de ``QuantumCircuits`` usando ``Sampler`` y ``Estimator`` para estudiar los efectos de los errores que se producen en dispositivos reales.

source: Set up your local development environment
es_un: Configurar tu entorno de desarrollo local
ja: ローカル開発環境のセットアップ

source: This tutorial requires a Qiskit Runtime service instance to be setup. If you haven’t done so already, follow `these steps <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ to set one up.
es_un: Este tutorial requiere que se configure una instancia del servicio Qiskit Runtime. Si aún no lo has hecho, sigue `estos pasos <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ para configurar uno.

source: Preparing the environment
es_un: Preparar el entorno
ja: 環境の準備

source: To demonstrate the routine, we shall proceed with running an example routine. One of the major benefits of using primitives is simplification of binding multiple parameters in parameterized circuits. To check this, here is an example circuit with a controlled `P-gate <https://qiskit.org/documentation/stubs/qiskit.circuit.library.PhaseGate.html>`__ as implemented in the following code. Here, we parametrise the ``P-gate`` with a rotation parameter ``theta``. To learn how to create circuits and bind parameters to them by using Qiskit, see the `Circuit Basics <https://qiskit.org/documentation/tutorials/circuits/01_circuit_basics.html>`__ and `Advanced Circuits <https://qiskit.org/documentation/tutorials/circuits_advanced/01_advanced_circuits.html#Parameterized-circuits>`__ in Qiskit documentation.
es_un: Para demostrar la rutina, procederemos a ejecutar una rutina de ejemplo. Uno de los principales beneficios del uso de primitivas es la simplificación de vincular múltiples parámetros en circuitos parametrizados. Para verificar esto, aquí hay un circuito de ejemplo con una `compuerta P <https://qiskit.org/documentation/stubs/qiskit.circuit.library.PhaseGate.html>`__ controlada como se implementa en el siguiente código. Aquí, parametrizamos la ``P-gate`` con un parámetro de rotación ``theta``. Para aprender a crear circuitos y vincularles parámetros usando Qiskit, consulta `Aspectos Básicos de un Circuito <https://qiskit.org/documentation/tutorials/circuits/01_circuit_basics.html>`__ y `Circuitos Avanzados <https://qiskit.org/documentation/tutorials/circuits_advanced/01_advanced_circuits.html#Parameterized-circuits>`__ en la documentación de Qiskit.

source: The circuit shown by the previous cell is parameterized with the eigenvalue being kicked back into qubit 0 to be measured. The amount of kickback will be determined by the parameter theta. Now in the following cell, we shall define our parameters for our circuit as a list. The parameters here will be from :math:`0` to :math:`2\pi` divided over 50 evenly spaced points.
es_un: El circuito que se muestra en la celda anterior está parametrizado con el valor propio que se devuelve (kickback) al qubit 0 a ser medido. La cantidad de retroceso (kickback) estará determinada por el parámetro theta. Ahora, en la siguiente celda, definiremos nuestros parámetros para nuestro circuito como una lista. Los parámetros aquí serán de :math:`0` a :math:`2\pi` divididos en 50 puntos espaciados uniformemente.

source: Running on the ideal simulator
es_un: Ejecutar en el simulador ideal
ja: 理想的なシミュレーターでの実行

source: Set the backend and options to use
es_un: Establecer el backend y las opciones a usar
ja: 使用するバックエンドとオプションの設定

source: First we shall demonstrate a run using an ideal case without any ``noise_model``, ``optimization_level`` or ``resilience_level`` for both Sampler and Estimator. We shall proceed to setup the options in the following code:
es_un: Primero demostraremos una ejecución usando un caso ideal sin ningún ``noise_model``, ``optimization_level`` o ``resilience_level`` tanto para Sampler como para Estimator. Procederemos a configurar las opciones en el siguiente código:

source: Run the circuits on Sampler
es_un: Ejecutar los circuitos en Sampler
ja: Samplerでの回路の実行

source: We shall now sample the circuit to get the result probability distribution using the `Sampler primitive <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Sampler.html>`__ to do the same. To learn how to use the ``Sampler`` primitive and how to get started using Qiskit Runtime Sessions, you can check this tutorial: `Get started with the Sampler primitive <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-sampler.html>`__.
es_un: Ahora probaremos el circuito para obtener el resultado de la distribución de probabilidad utilizando la `primitiva Sampler <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Sampler.html>`__ para hacer lo mismo. Para aprender a usar la primitiva ``Sampler`` y cómo comenzar a usar las Sesiones de Qiskit Runtime, puedes consultar este tutorial: `Primeros pasos con la primitiva Sampler <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-sampler.html>`__.

source: Run the circuits on Estimator
es_un: Ejecutar los circuitos en Estimator
ja: Estimatorでの回路の実行

source: To learn how to start a session for Estimator, you may check this tutorial: `Get started with the Estimator primitive <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-estimator.html>`__.
es_un: Para aprender cómo iniciar una sesión para Estimator, puedes consultar este tutorial: `Primeros pasos con la primitiva Estimator <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-estimator.html>`__.
ja: Estimator のためのセッションを開始する方法を学ぶには、次のチュートリアルの確認してください: `Estimator primitive 入門 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-estimator.html>`__

source: The Estimator will bind single-qubit rotations to get Hamiltonians before it returns expectation values of quantum operators. Therefore, the circuit doesn’t require any measurements. Currently the circuit ``qc`` has measurements so we will remove these with ``remove_final_measurements``.
es_un: El Estimator vinculará las rotaciones de un solo qubit para obtener Hamiltonianos antes de devolver los valores esperados de los operadores cuánticos. Por lo tanto, el circuito no requiere ninguna medición. Actualmente, el circuito ``qc`` tiene mediciones, por lo que las eliminaremos con ``remove_final_measurements``.

source: With this observable, the expectation value is calculated by the following equation.
es_un: Con este observable, el valor esperado se calcula mediante la siguiente ecuación.

source: The next cell will implement this as shown.
es_un: La siguiente celda implementará esto como se muestra.

source: Running a noisy simulation
es_un: Ejecutar una simulación ruidosa
ja: ノイズのあるシミュレーションの実行

source: Now we’ll setup our simulator to run a noisy simulation rather than the ideal one. We can pass a custom ``noise_model`` to the simulator on Runtime by specifying it in the ``Options`` parameter. Here we will try to mimic a real backend and map on the ``noise_model`` from a ``FakeBackend`` class. The noise model can be extracted from the ``FakeBackend`` and passed as a ``simulator`` parameter in options. If you want to know more about ``fake_provider``, check `Fake Provider <https://qiskit.org/documentation/apidoc/providers_fake_provider.html>`__ in Qiskit documentation.
es_un: Ahora configuraremos nuestro simulador para ejecutar una simulación ruidosa en lugar de la ideal. Podemos pasar un ``noise_model`` personalizado al simulador en Runtime especificándolo en el parámetro ``Options``. Aquí intentaremos imitar un backend real y mapear en el ``noise_model`` de una clase ``FakeBackend``. El modelo de ruido se puede extraer de ``FakeBackend`` y pasarlo como un parámetro ``simulator`` en las opciones. Si deseas obtener más información sobre ``fake_provider``, consulta `Fake Provider <https://qiskit.org/documentation/apidoc/providers_fake_provider.html>`__ en la documentación de Qiskit.

source: Since we are trying to mimic a real backend, we can also pass in the ``coupling_map`` that the backend topology has and the ``basis_gates`` that the backend supports to have a more realistic noisy simulation.
es_un: Dado que estamos tratando de imitar un backend real, también podemos pasar el ``coupling_map`` que tiene la topología del backend y las ``basis_gates`` que admite el backend para tener una simulación ruidosa más realista.
ja: 本物のバックエンドを模倣しようとしているので、より現実的なノイズ・シミュレーションをサポートするための、バックエンドのトポロジーを表す ``coupling_map`` と、バックエンドがサポートする ``basis_gates``を渡すこともできます。

source: The ``ibmq_qasm_simulator`` allows for the activation of the ``resilience_levels`` offered by the Qiskit Runtime Service, and use of these levels on simulators is best demonstrated using the noisy simulation as we have described previously.
es_un: El ``ibmq_qasm_simulator`` permite la activación de ``resilience_levels`` ofrecidos por el Servicio Qiskit Runtime, y el uso de estos niveles en simuladores se demuestra mejor usando la simulación ruidosa como se ha descrito anteriormente.

source: To see the comparison, we shall define two set of ``Options``. The ``ibmq_qasm_simulator`` allows for the activation of the resilience levels offered by Qiskit Runtime, and the use of these levels on simulators is best demonstrated using the noisy simulation that we have built. Here, ``options`` is set to\ ``resilience level`` = ``0`` to represent a normal run without error mitigation, and ``options with em`` is set to ``resilience level`` = ``1`` to represent a run with error mitigation enabled.
es_un: Para ver la comparación, definiremos dos conjuntos de ``Options``. El ``ibmq_qasm_simulator`` permite la activación de los niveles de resiliencia ofrecidos por Qiskit Runtime, y el uso de estos niveles en simuladores se demuestra mejor mediante la simulación ruidosa que hemos creado. Aquí, ``options`` se establece en\ ``resilience level`` = ``0`` para representar una ejecución normal sin mitigación de errores, y ``options with em`` se establece en ``resilience level`` = ``1`` para representar una ejecución con la mitigación de errores habilitada.

source: When you set the ``resilience_level`` to 1, M3 is activated in Sampler. All available resilience level configurations can be found `here <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/error-mitigation.html>`__.
es_un: Cuando estableces ``resilience_level`` en 1, M3 se activa en Sampler. Todas las configuraciones de nivel de resiliencia disponibles se pueden encontrar `aquí <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/error-mitigation.html>`__.
ja: ``resilience_level`` を 1 に設定すると、SamplerでM3が有効になります。利用可能なすべてのresilienceレベルの設定は、 `ここ <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/error-mitigation.html>`__ で確認できます。

source: ``T-REx`` is triggered in Estimator when the resilience level is set to 1.
es_un: ``T-REx`` se activa en Estimator cuando el nivel de resiliencia se establece en 1.
ja: ``T-REx`` はresilienceレベルが 1 に設定されている場合に、Estimator で起動されます。

source: Resilience levels are currently in beta so sampling overhead and solution quality will vary from circuit to circuit. New features, advanced options and management tools will be released on a rolling basis. You can also play around with higher levels of resilience and explore additional options offered by them. If you want to learn more about activating features like *Digital-ZNE*, *PEC* in addition to *M3* and *T-REx* as shown in the previous examples, check out this tutorial: `Error suppression and error mitigation with Qiskit Runtime <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/Error-Suppression-and-Error-Mitigation.html>`__.
es_un: Los niveles de resiliencia se encuentran actualmente en versión beta, por lo que la sobrecarga de muestreo y la calidad de la solución variarán de un circuito a otro. Se lanzarán nuevas funciones, opciones avanzadas y herramientas de gestión de forma continua. También puedes jugar con niveles más altos de resiliencia y explorar opciones adicionales que ofrecen. Si deseas obtener más información sobre la activación de funciones como *Digital-ZNE*, *PEC* además de *M3* y *T-REx* como se muestra en los ejemplos anteriores, consulta este tutorial: `Supresión y mitigación de errores con Qiskit Runtime <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/Error-Suppression-and-Error-Mitigation.html>`__.

source: Noisy Simulators in Qiskit Runtime
ja: Qiskit Runtimeのノイズのあるシミュレーター

source: This notebook shows how to setup ``ibmq_qasm_simulator`` and map a basic noise model for an IBM Quantum hardware device in **Qiskit Runtime**, and use this noise model to do noisy simulations of ``QuantumCircuits`` on ``Sampler`` and ``Estimator`` to study the effects of errors which occur on real devices.
ja: このノートブックは、 ``ibmq_qasm_simulator`` をセットアップし、**Qiskit Runtime** でIBM Quantumハードウェア・デバイス用の基本的なノイズモデルをマッピングする方法を示します。 実際のデバイスで発生するエラーの影響を調べるために、このノイズモデルを使用して、 ``Sampler`` と ``Estimator`` 上で ``QuantumCircuits`` のノイズ・シミュレーションを行います。

source: This tutorial requires a Qiskit Runtime service instance to be setup. If you haven’t done so already, please follow `these steps <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ to set one up.
ja: このチュートリアルでは、Qiskit Runtime サービス・インスタンスが必要です。まだ実行していない場合は、`これらの手順 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ に従ってセットアップします。

source: To demonstrate the routine, we shall proceed with running an example routine. One of the major benefits of using primitives is simplification of binding multiple parameters in parameterized circuits. To check this, here is an example circuit with a controlled `P-gate <https://qiskit.org/documentation/stubs/qiskit.circuit.library.PhaseGate.html>`__ as implemented right below. Here, we parametrise the ``P-gate`` with a rotation parameter ``theta``. To learn how to create circuits and bind parameters to them by using Qiskit, see the `Circuit Basics <https://qiskit.org/documentation/tutorials/circuits/01_circuit_basics.html>`__ and `Advanced Circuits <https://qiskit.org/documentation/tutorials/circuits_advanced/01_advanced_circuits.html#Parameterized-circuits>`__ in Qiskit documentation.
ja: デモンストレーションをするために、サンプル・ルーチンを実行していきましょう。 primitiveを使用する主な利点の 1 つは、パラメーター化された回路で、複数のパラメーターの結合を単純化することです。 これを確認するために、制御 `P ゲート <https://qiskit.org/documentation/stubs/qiskit.circuit.library.PhaseGate.html>`__ を持つ回路の例を以下に示します。 ここでは、``P-gate`` を回転パラメーター ``theta`` でパラメーター化します。 Qiskitを使用して回路作成しパラメーターを結合する方法を学習するには、 Qiskit ドキュメンテーションの `回路の基本 <https://qiskit.org/documentation/tutorials/circuits/01_circuit_basics.html>`__ および `回路の応用 <https://qiskit.org/documentation/tutorials/circuits_advanced/01_advanced_circuits.html#Parameterized-circuits>`__ を参照してください。

source: The circuit shown above is parameterized with the eigenvalue being kicked back into qubit 0 to be measured. The amount of kickback will be determined by the parameter theta. Now in the cell below, we shall define our parameters for our above circuit as a list. The parameters here will be from :math:`0` to :math:`2\pi` divided over 50 evenly spaced points.
ja: 上記の回路は、測定する量子ビット0にキックバックされる固有値でパラメーター化されます。 キックバックの量はパラメーター thetaによって決定されます。 以下のセルでは、上記の回路のパラメーターをリストとして定義します。 ここでのパラメーターは、 :math:`0` から :math:`2\pi` までで、50個の均等な間隔の点に分けられます。

source: First we shall demonstrate a run using an ideal case without any ``noise_model``, ``optimization_level`` or ``resilience_level`` for both Sampler and Estimator. We shall proceed to setup the options as shown below:
ja: 最初に、Sampler と Estimator の両方で ``noise_model`` 、``optimization_level`` または ``reverence_level`` がない理想的なケースを使用して実行することを示します。 以下のようにオプションの設定に進みます。

source: We shall now sample the circuit to get the result probability distribution. We shall be utilizing the `Sampler primitive <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Sampler.html>`__ to do the same. To learn how to use the ``Sampler`` primitive and how to get started using Qiskit Runtime Sessions, you can check this tutorial: `Get started with the Sampler primitive <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-sampler.html>`__.
ja: 結果の確率分布を得るために回路のサンプリングをしましょう。 `Sampler primitive <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Sampler.html>`__ を活用して同じことをします。 ``Sampler`` primitive の使用方法および Qiskit Runtime Sessionの使用開始方法については、次のチュートリアルで確認することができます: `Sampler primitive 入門<https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-sampler.html>`__

source: The Estimator will bind single-qubit rotations to get hamiltonians before it returns expectation values of quantum operators. Therefore, the circuit doesn’t require any measurements. Currently the circuit ``qc`` has measurements so we will remove these with ``remove_final_measurements``.
ja: このEstimatorは、量子演算子の期待値を返す前に、単一量子ビット回転を結合してハミルトニアンを得ます。 したがって、回路は測定を必要としません。現在の回路 ``qc`` には測定がありますので、``remove_final_measurements`` でこれを削除します。

source: With this observable, the expectation value is calculated by the equation below.
ja: この観測量を使用すると、期待値は以下の式で計算されます。

source: The next cell will implement the above as shown.
ja: 次のセルは、上記で示したものを実装します。

source: Now we’ll setup our simulator to run a noisy simulation rather than the ideal one. We can pass a custom ``noise_model`` to the simulator on Runtime by specifying it in the ``Options`` parameter. Here we will try to mimic a real backend and map on the noise_model from a ``FakeBackend`` class. The noise model can be extracted from the ``FakeBackend`` and passed as a ``simulator`` parameter in options. If you want to know more about ``fake_provider``, check `Fake Provider <https://qiskit.org/documentation/apidoc/providers_fake_provider.html>`__ in Qiskit documentation.
ja: 次に、理想的なシミュレーションではなく、ノイズのあるシミュレーションを実行するためのシミュレーターを設定します。 ``Options`` パラメーターに指定することで、Runtime のシミュレーターにカスタムの ``noise_model`` を渡すことができます。 ここでは実際のバックエンドを模倣し、``FakeBackend`` クラスから noise_model をマップします。 ノイズモデルは ``FakeBackend`` から抽出し、オプションの ``simulator`` パラメーターとして渡すことができます。 ``fake_provider`` についてもっと知りたい場合は、Qiskit ドキュメンテーションの `Fake Provider <https://qiskit.org/documentation/apidoc/providers_fake_provider.html>`__ を参照してください。

source: The ``ibmq_qasm_simulator`` allows for the activation of the ``resilience_levels`` offered by the Qiskit Runtime Service, and use of these levels on simulators is best demonstrated using the noisy simulation as we have described above.
ja: ``ibmq_qasm_simulator`` は、Qiskit Runtime Service が提供する ``resilience_levels`` を有効にします。 シミュレーターでこれらのレベルを使用することで、上記のようなノイズのあるシミュレーションが最もよくデモンストレーションされます。

source: To see the comparision, we shall define two set of ``Options``. The ibmq qasm simulator allows for the activation of the resilience levels offered by Qiskit Runtime, and the use of these levels on simulators is best demonstrated using the noisy simulation that we have built. Here, ``options`` is set to\ ``resilience level`` = ``0`` to represent a normal run without error mitigation, and ``options with em`` is set to ``resilience level`` = ``1`` to represent a run with error mitigation enabled.
ja: 比較を見るには、``Options`` の2つのセットを定義します。 ibmq qasmシミュレーターは、Qiskit Runtimeによって提供されるresilienceレベルの有効化します。シミュレーターでのこれらのレベルの使用は我々が構築したノイズのあるシミュレーションで 最もよく示されています。 ここで、``options`` はエラー軽減なしの通常の実行を表すために ``resilience level`` = ``0`` に設定されます。 そして ``options with em`` は ``resilience level`` = ``1`` に設定され、エラー緩和が有効になっている実行を表します。

source: Resilience levels are currently in beta so sampling overhead and solution quality will vary from circuit to circuit. New features, advanced options and management tools will be released on a rolling basis. You can also play around wtih higher levels of resilience and explore additional options offered by them. If you wish to learn more about activating features like *Digital-ZNE*, *PEC* in addition to *M3* and *T-REx* as shown in the examples above, check out this tutorial: `Error supression and error mitigation with Qiskit Runtime <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/Error-Suppression-and-Error-Mitigation.html>`__.
ja: resilience レベルは現在ベータ版のため、サンプリングのオーバーヘッドとソリューションの品質は回路によって異なります。 新機能、高度なオプションおよび管理ツールは、循環的にリリースされます。 またより高いレベルのresilienceを設定し、それらによって提供される追加オプションを探索することもできます。 上記の例で示した *M3* や *T-REx* に加えて、 *Digital-ZNE* や *PEC* のような機能の有効化についてもっと知りたい場合は、次のチュートリアルを確認してください: `Qiskit Runtimeによるエラーの抑制とエラーの軽減 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/Error-Suppression-and-Error-Mitigation.html>`__
