Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/how_to/options.po
Languages: es_un, ja

source: Configure primitive options
es_un: Configurar las opciones de las primitivas
ja: Primitive optionの設定

source: When calling the primitives, you can pass in options, as shown in the line ``estimator = Estimator(options=options)`` in the following code example:
es_un: Al llamar a las primitivas, puedes pasar opciones, como se muestra en la línea ``estimator = Estimator(options=options)`` en el siguiente ejemplo de código:
ja: Primitives を呼び出す場合、次のコードの行の ``estimator = Estimator(options=options)`` に示すように、オプションを渡すことができます:

source: You can also overwrite specific options for a job when calling ``run()``. In the following code example, the job will run with optimization level 1 and 4000 shots (instead of 1000):
es_un: También puedes sobrescribir opciones específicas para un trabajo (job) al llamar a ``run()``. En el siguiente ejemplo de código, el trabajo se ejecutará con el nivel de optimización 1 y 4000 iteraciones (en lugar de 1000):
ja: ``run()`` を呼び出す際に、ジョブの特定の option を上書きすることもできます。以下のコード例では、ジョブは optimization level 1 と4000 shots（1000 shots の代わりに）で実行されます：

source: The most commonly used options are for error suppression and mitigation, which are described in this topic. For a full list of available options, see the `Options API reference <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`__.
es_un: Las opciones más utilizadas son para la supresión y mitigación de errores, que se describen en este tema. Para obtener una lista completa de las opciones disponibles, consulta la `Referencia de la API de Opciones <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`__.
ja: 最も一般的に使用されるオプションは、このトピックで説明されているエラー抑制と緩和のためのオプションです。 利用可能なオプションの完全なリストについては、 `Options API reference <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`__ を参照してください。

source: Overview of error suppression and mitigation
es_un: Descripción general de la supresión y mitigación de errores
ja: エラー抑制と軽減の概要

source: No computing platform is perfect, and because quantum computers are such new and complex technology, we have to find new ways of dealing with these imperfections. There are several possible causes for errors: “noise” - disturbances in the physical environment, and “bit errors”, which cause the qubit's value or phase to change. IBM builds redundancy into the hardware to ensure that even if some qubits error out, an accurate result is still returned. However, we can further address errors by using error suppression and error mitigation techniques These strategies make use of pre- and post-processing to improve the quality of the results produced for the input circuit.
es_un: Ninguna plataforma de computación es perfecta, y debido a que las computadoras cuánticas son una tecnología tan nueva y compleja, tenemos que encontrar nuevas formas de lidiar con estas imperfecciones. Hay varias causas posibles de errores: “ruido”: perturbaciones en el entorno físico y “errores de bit”, que hacen que cambie el valor o la fase del qubit. IBM crea redundancia en el hardware para garantizar que incluso si se produce un error en algunos qubits, aún se devuelve un resultado preciso. Sin embargo, podemos abordar aún más los errores mediante el uso de técnicas de supresión y mitigación de errores. Estas estrategias hacen uso del procesamiento previo y posterior para mejorar la calidad de los resultados producidos para el circuito de entrada.
ja: コンピューティングプラットフォームに完璧はありません。量子コンピューターは新しく複雑な技術であるため、このような不完全性に対処する新しい方法を見つけなければならないのです。エラーの原因はいくつか考えられます：物理環境の乱れである「ノイズ」や、量子ビットの値や位相が変化してしまう「ビットエラー」。IBMでは、一部の量子ビットがエラーになっても正確な結果が返されるように、ハードウェアに冗長性を持たせています。しかし、エラー抑制やエラー緩和の技術を用いることで、さらにエラーに対処することができます。これらの戦略は、入力回路に対して生成される結果の質を向上させるために、事前および事後の処理を利用します。

source: **Error suppression**: Techniques that optimize and transform your circuit at the point of compilation to minimize errors. This is the most basic error handling technique. Error suppression typically results in some classical pre-processing overhead to your overall runtime.
es_un: **Supresión de errores**: Técnicas que optimizan y transforman tu circuito en el punto de compilación para minimizar los errores. Esta es la técnica de manejo de errores más básica. La supresión de errores generalmente genera una sobrecarga clásica de preprocesamiento en el tiempo de ejecución general.
ja: **エラー抑制**: コンパイルの時点で回路を最適化したり変形させたりして、エラーを最小限に抑える技術。最も基本的なエラー処理技術です。 エラー抑制は、通常、runtime 全体に古典的な前処理オーバーヘッドをもたらします。

source: Primitives let you employ error suppression techniques by setting the optimization level (``optimization_level`` option) and by choosing advanced transpilation options. See `Configure error suppression <error-suppression.html>`__ for details.
es_un: Las primitivas te permiten emplear técnicas de supresión de errores configurando el nivel de optimización (opción ``optimization_level``) y eligiendo opciones avanzadas de transpilación. Consulta `Configurar la supresión de errores <error-suppression.html>`__ para obtener más información.
ja: Primitive では、最適化レベルの設定 (``optimization_level`` オプション) や、高度なトランスパイルオプションの選択によって、エラー抑制のテクニックを使用することができます。 詳しくは `エラー抑制の設定 <error-suppression.html>`__ を参照してください。

source: **Error mitigation**: Techniques that allow users to mitigate circuit errors by modeling the device noise at the time of execution. This typically results in quantum pre-processing overhead related to model training, and classical post-processing overhead to mitigate errors in the raw results by using the generated model.
es_un: **Mitigación de errores**: Técnicas que permiten a los usuarios mitigar errores de circuito modelando el ruido del dispositivo en el momento de la ejecución. Esto generalmente da como resultado una sobrecarga de preprocesamiento cuántico relacionada con el entrenamiento del modelo y una sobrecarga de posprocesamiento clásico para mitigar errores en los resultados sin procesar mediante el uso del modelo generado.
ja: **誤り軽減**: 実行時のデバイス・ノイズをモデル化することで、回路エラーを軽減する技術です。 これは通常、モデルのトレーニングに関連する量子的な前処理のオーバーヘッドと、生成モデルを使用して生の結果のエラーを軽減するための古典的な後処理のオーバーヘッドになります。

source: The error mitigation techniques built in to primitives are advanced resilience options. To specify these options, use the ``resilience_level`` when submitting your job. See `Configure error mitigation <error-mitigation.html>`__ for details.
es_un: Las técnicas de mitigación de errores integradas en las primitivas son opciones de resiliencia avanzadas. Para especificar estas opciones, usa ``resilience_level`` al enviar tu trabajo (job). Consulta `Configurar mitigación de errores <error-mitigation.html>`__ para obtener más detalles.
ja: Primitive に組み込まれた誤り軽減技術は、高度なresilienceオプションです。 これらのオプションを指定するには、ジョブを投入する際に ``resilience_level`` を使用します。 詳細は `エラー緩和の設定 <error-mitigation.html>`__ を参照してください。
