Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/how_to/retrieve_job_results.po
Languages: es_un, ja_jp, ko_kr, pt_un

source: This page was generated from `docs/how_to/retrieve_job_results.ipynb`__.
es_un: Esta página fue generada a partir de `docs/how_to/retrieve_job_results.ipynb`__.
ja_jp: このページは `docs/how_to/retrieve_job_results.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/how_to/retrieve_job_results.ipynb`__에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/how_to/retrieve_job_results.ipynb`__.

source: Retrieve job and job results
es_un: Recuperar el trabajo y los resultados del trabajo

source: This guide shows you how to retrieve a previously run job and its final results.
es_un: Esta guía te muestra cómo recuperar un trabajo ejecutado anteriormente y sus resultados finales.

source: Before you begin
es_un: Antes de comenzar
ja_jp: 始める前に
ko_kr: 시작하기 전에
pt_un: Antes de começar

source: If you haven’t already, check out the guide on `running a job using QiskitRuntimeService.run(). <run_a_job.ipynb>`__
es_un: Si aún no lo has hecho, consulta la guía sobre `ejecutar un trabajo usando QiskitRuntimeService.run(). <run_a_job.ipynb>`__

source: We will retrieve an old job with job id in this guide.
es_un: Recuperaremos un trabajo anterior con identificador en esta guía.
ja_jp: このガイドでは、ジョブIDを持つ古いジョブを取得します。
ko_kr: 이 가이드에서는 작업 ID가 있는 이전 작업을 검색한다.
pt_un: Neste guia vamos recuperar um trabalho antigo utilizando o ID.

source: If you don’t have the job ID, or if you want to retrieve multiple jobs, you can instead use the `QiskitRuntimeService.jobs() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.jobs.html#qiskit_ibm_runtime.QiskitRuntimeService.jobs>`__ method. This method has several filters that allow you to narrow down your search. The API documentation provides a list of all the filters and their descriptions.
es_un: Si no tienes el ID del trabajo, o si deseas recuperar varios trabajos, puedes utilizar el método `QiskitRuntimeService.jobs() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.jobs.html#qiskit_ibm_runtime.QiskitRuntimeService.jobs>`__. Este método tiene varios filtros que te permiten acotar tu búsqueda. La documentación de la API proporciona una lista de todos los filtros y sus descripciones.

source: The ``jobs()`` method returns a list of `RuntimeJob <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`__ instances. The ``job`` variable used in this guide is of the same type.
es_un: El método ``jobs()`` devuelve una lista de instancias `RuntimeJob <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`__. La variable ``job`` utilizada en esta guía es del mismo tipo.

source: Check job status
es_un: Comprobar el estado del trabajo
ja_jp: ジョブステータスの確認
ko_kr: 작업 상태 확인
pt_un: Verifique o status do trabalho

source: You can retrieve a job any time after running it. But you can only retrieve job results after the job has been completed. To check the job status, you can run:
es_un: Puedes recuperar un trabajo en cualquier momento después de ejecutarlo. Pero solo puedes recuperar los resultados del trabajo después de que se haya completado el mismo. Para verificar el estado del trabajo, puedes ejecutar:

source: If it returns ``<JobStatus.DONE: 'job has successfully run'>``, the job has been completed.
es_un: Si devuelve ``<JobStatus.DONE: 'job has successfully run'>``, el trabajo se ha completado.

source: Retrieve job results
es_un: Recuperar los resultados de un trabajo
ja_jp: ジョブ結果の取得
ko_kr: 작업 결과 검색하기
pt_un: Recuperar os resultados de um trabalho

source: You can retrieve job results using the `RuntimeJob.result <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.result.html#qiskit_ibm_runtime.RuntimeJob.result>`__ method.
es_un: Puedes recuperar los resultados del trabajo mediante el método `RuntimeJob.result <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.result.html#qiskit_ibm_runtime.RuntimeJob.result>`__.

source: You don’t have to wait for the job to complete before calling this method, but the method will block until the job is completed and results retrieved.
es_un: No tienes que esperar a que se complete el trabajo antes de llamar a este método, pero el método se bloqueará hasta que se complete el trabajo y se recuperen los resultados.

source: This guide shows you how to view final job results after running a job.
ja_jp: このガイドでは、ジョブの実行後に最終的なジョブ結果を表示する方法を示します。
ko_kr: 이 가이드에서는 작업을 수행한 후 최종 작업 결과를 살펴볼 수 있는 방법을 설명한다.
pt_un: Este guia mostra como visualizar os resultados finais do trabalho após a sua execução.

source: Throughout this guide we will assume that you have set the job you want to retrieve results as variable ``job`` by any of the following methods:
ja_jp: このガイドでは、以下のいずれかの方法により、結果を取得するジョブを変数 ``job`` として設定したと想定します。
ko_kr: 이 가이드는 다음 방법을 통해 결과를 검색해보기 위한 ``job`` 변수를 설정한다.
pt_un: Ao longo deste guia, vamos supor que você definiu o trabalho que deseja obter os resultados como a variável ``job`` por qualquer um dos seguintes métodos:

source: `run a job using QiskitRuntimeService.run(). <run_a_job.ipynb>`__
ja_jp: `QiskitRuntimeService.run()を使用して、ジョブを実行します。 <run_a_job.ipynb>`__
ko_kr: `QiskitRuntimeService.run()를 사용하여 작업을 실행한다.<run_a_job.ipynb>`__
pt_un: `execute um trabalho usando QiskitRuntimeService.run(). <run_a_job.ipynb>`__

source: retrieve a job that has been ran before.
ja_jp: 以前に実行されたジョブを取得します。
ko_kr: 이전에 실행된 작업을 검색한다.
pt_un: recuperar um trabalho que foi executado antes.

source: You can only retrieve job results afer the job has been completed. To check the job status, you can run:
ja_jp: ジョブの結果は、ジョブが完了した後でのみ取得できます。 ジョブのステータスを確認するには、次のコマンドを実行します。
ko_kr: 작업이 완료된 작업 결과만 검색할 수 있다. 작업 상태를 확인하려면, 다음을 실행한다:
pt_un: Só é possível recuperar os resultados do trabalho após sua conclusão. Para verificar o status do trabalho, podes executar:

source: If it returns ``<JobStatus.DONE: 'job has successfully run'>``, the job has been completed and you can proceed to retrieve job results.
ja_jp: ``<JobStatus.DONE: 'job has successfully run'>`` が返された場合、ジョブは完了しており、ジョブ結果の取得に進むことができます。
ko_kr: ``<JobStatus.DONE: 'job has successfully run'>`` 을 반환하면 작업이 완료되었음을 의미하고, 작업 결과 검색을 진행할 수 있다.
pt_un: Se retornar ``<JobStatus.DONE: 'job has successfully run'>``, o trabalho foi concluído e você pode prosseguir para recuperar os resultados do mesmo.

source: You can retrieve job results using:
ja_jp: 以下を使用してジョブ結果を取得できます：
ko_kr: 다음을 사용하여 작업 결과를 검색할 수 있다:
pt_un: É possível recuperar os resultados do trabalho usando:
