Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/how_to/retrieve_results.po
Languages: es_un, ja

source: Retrieve job results
es_un: Recuperar los resultados de un trabajo
ja: ジョブ結果の取得

source: After submitting your job, a `RuntimeJob <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`_ instance is returned. Use the job instance to check the job status or retrieve the results by calling the appropriate method:
ja: ジョブを投入すると、 `RuntimeJob <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`_ インスタンスが返されます。ジョブインスタンスを使用して、ジョブの状態を確認したり、適切なメソッドを呼び出して結果を取得したりすることができます：

source: Job methods
ja: Job メソッド

source: Review job results immediately after the job completes. Job results are available after the job completes. Therefore, `job.result()` is a blocking call until the job completes.
es_un: Revisa los resultados del trabajo inmediatamente después de que se completa este. Los resultados del trabajo están disponibles una vez que es completado. Por lo tanto, `job.result()` es una llamada de bloqueo hasta que se completa el trabajo.
ja: ジョブ完了後、すぐのジョブ結果の確認です。ジョブ結果は、ジョブが完了した後に利用できます。 したがって、 `job.result()` はジョブが完了するまでコールがブロックされています。

source: Return the ID that uniquely identifies that job. Retrieving the job results at a ltar time requires the job ID. Therefore, it is recommended that you save the IDs of jobs you might want to retrieve later.
es_un: Devuelve el ID que identifica de forma única a ese trabajo (job). La recuperación de los resultados del trabajo en un momento posterior requiere el ID del trabajo. Por lo tanto, se recomienda que guardes los ID de los trabajos que desees recuperar más adelante.
ja: そのジョブを一意に識別するIDを返します。後日、ジョブ結果を取得する際には、job IDが必要となります。そのため、後で検索する可能性のあるジョブのIDを保存しておくことをお勧めします。

source: Check the job status.
es_un: Comprobar el estado del trabajo.
ja: ジョブステータスの確認

source: Retrieve a job you previously submitted. This call requires the job ID.
es_un: Recupera un trabajo (job) que enviaste anteriormente. Esta llamada requiere el ID del trabajo.
ja: 以前に送信したジョブを取得します。この呼び出しには、job IDが必要です。

source: Jobs are also listed on the Jobs page for your quantum service channel:
es_un: Los trabajos también son listados en la página Jobs de tu canal de servicio cuántico:
ja: また、ジョブは、量子サービス・チャネルの「ジョブ」ページにもリストされます。

source: For the IBM Cloud channel, from the IBM Cloud console quantum `Instances page <https://cloud.ibm.com/quantum/instances>`__, click the name of your instance, then click the Jobs tab. To see the status of your job, click the refresh arrow in the upper right corner.
es_un: Para el canal de IBM Cloud, en la página de `Instancias <https://cloud.ibm.com/quantum/instances>`__ cuánticas de la consola de IBM Cloud, haz clic en el nombre de tu instancia y, a continuación, haz clic en la pestaña Jobs. Para ver el estado de tu trabajo, haz clic en la flecha de actualización en la esquina superior derecha.
ja: IBM Cloud チャネル：IBM Cloud コンソールの量子型 `Instances ページ <https://cloud.ibm.com/quantum/instances>`__ から、インスタンスの名前をクリックし、Jobs タブをクリックします。 ジョブの状況を確認するには、右上隅のリフレッシュ矢印をクリックします。

source: For the IBM Quantum channel, in IBM Quantum platform, open the `Jobs page <https://quantum-computing.ibm.com/jobs>`__.
es_un: Para el canal de IBM Quantum, en la plataforma de IBM Quantum, abre la `página de Jobs <https://quantum-computing.ibm.com/jobs>`__.
ja: IBM Quantum チャネル：IBM Quantum platformでは、`Jobs ページ <https://quantum-computing.ibm.com/jobs>`__ を開きます。

source: Retrieve job results at a later time
es_un: Recuperar los resultados del trabajo en un momento posterior
ja: 後でジョブ結果を取得する。

source: Call `service.job(<job ID>)` to retrieve a job you previously submitted. If you don't have the job ID, or if you want to retrieve multiple jobs at once; including jobs from retired systems, call `service.jobs()` with optional filters instead. See `QiskitRuntimeService.jobs <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.jobs.html>`__.
es_un: Llama a `service.job(<job ID>)` para recuperar un trabajo (job) que enviaste anteriormente. Si no tienes el ID del trabajo o si deseas recuperar varios trabajos a la vez; incluyendo trabajos de sistemas retirados, llama a `service.jobs()` con filtros opcionales en su lugar. Consulta `QiskitRuntimeService.jobs <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.jobs.html>`__.
ja: 以前に投入したジョブを取得するには、 `service.job(<job ID>)` を呼び出します。job IDがわからない場合や、引退したシステムのジョブも含めて複数のジョブを一度に取得したい場合は、代わりにオプションのフィルターを付けて `service.jobs()` を呼び出します。 `QiskitRuntimeService.jobs <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.jobs.html>`__ を参照してください。

source: `service.jobs()` returns only Qiskit Runtime jobs. To retrieve other jobs, use `qiskit-ibm-provider <https://qiskit.org/documentation/partners/qiskit_ibm_provider/stubs/qiskit_ibm_provider.IBMBackend.html#qiskit_ibm_provider.IBMBackend>`__ instead.
es_un: `service.jobs()` solo devuelve trabajos de Qiskit Runtime. Para recuperar otros trabajos, utiliza `qiskit-ibm-provider <https://qiskit.org/documentation/partners/qiskit_ibm_provider/stubs/qiskit_ibm_provider.IBMBackend.html#qiskit_ibm_provider.IBMBackend>`__ en su lugar.
ja: `service.jobs()` は Qiskit ランタイム・ジョブのみを返します。 他のジョブを取得するには、代わりに `qiskit-ibm-provider <https://qiskit.org/documentation/partners/qiskit_ibm_provider/stubs/qiskit_ibm_provider.IBMBackend.html#qiskit_ibm_provider.IBMBackend>`__ を使用します。

source: Example
es_un: Ejemplo
ja: 例

source: This example returns the 10 most recent runtime jobs that were run on ``ibmq_qasm_simulator``:
ja: この例は、``ibmq_qasm_simulator`` で実行された最新の 10 個のランタイム・ジョブを返します。
