Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/how_to/run_a_job.po
Languages: es_un, ja_jp, ko_kr, pt_un

source: This page was generated from `docs/how_to/run_a_job.ipynb`__.
es_un: Esta página fue generada a partir de `docs/how_to/run_a_job.ipynb`__.
ja_jp: このページは `docs/how_to/run_a_job.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/how_to/run_a_job.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/how_to/run_a_job.ipynb`__.

source: Run a job
es_un: Ejecutar un trabajo
ja_jp: ジョブの実行
ko_kr: 작업 수행하기
pt_un: Execute um job

source: This guide shows you how to run a job using a Qiskit Runtime program.
es_un: Esta guía te muestra cómo ejecutar un trabajo usando un programa de Qiskit Runtime.
ja_jp: このガイドでは、 Qiskit Runtime プログラムを使用してジョブを実行する方法について説明します。
ko_kr: 이 가이드는 Qiskit Runtime 프로그램을 사용하여 작업을 수행하는 방법을 설명한다.
pt_un: Este guia mostra como executar uma tarefa usando um programa do Qiskit Runtime.

source: Before you begin
es_un: Antes de que empieces
ja_jp: 始める前に
ko_kr: 시작하기 전에
pt_un: Antes de começar

source: Throughout this guide, we will assume that you have `setup the Qiskit Runtime service instance <../getting_started.rst>`__ and initialize it as ``service``:
es_un: A lo largo de esta guía, supondremos que has `configurado la instancia del servicio Qiskit Runtime <../getting_started.rst>`__ e inicializado como ``service``:
ja_jp: このガイド全体を通して、 `Qiskit Runtime サービス・インスタンス <../getting_started.rst>`__ をセットアップし、それを ``service`` として初期化すると仮定します。
ko_kr: 이 가이드에서 `Qiskit Runtime service 가 설치<../getting_started.rst>`__ 되어 있다고 가정한다. 그리고 이를 ``service``객체로 초기화한다:
pt_un: Ao longo deste guia, vamos supor que você tenha `configurado a instância do serviço Qiskit Runtime <../getting_started.rst>`__ e inicializado como ``service``:

source: Program parameters
es_un: Parámetros del programa
ja_jp: プログラム・パラメーター
ko_kr: 프로그램 매개변수
pt_un: Parâmetros do programa

source: You can use the `QiskitRuntimeService.run() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.run.html>`__ method to invoke a runtime program. This method takes the following parameters:
es_un: Puedes utilizar el método `QiskitRuntimeService.run() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.run.html>`__ para invocar un programa de runtime. Este método toma los siguientes parámetros:
ja_jp: Runtimeプログラムを呼び出すには、 `QiskitRuntimeService.run() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.run.html>`__ メソッドを使用できます。 このメソッドは以下のパラメーターを取ります。
ko_kr: `QiskitRuntimeService.run() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.run.html>`__ 메서드를 사용해서 런타임 프로그램을 호출할 수 있다. 이 메서드는 다음 매개변수를 사용한다:
pt_un: Pode-se usar o método `QiskitRuntimeService.run() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.run.html>`__ para chamar um programa do Runtime. Este método usa os seguintes parâmetros:

source: ``program_id``: ID of the program to run.
es_un: ``program_id``: ID del programa a ejecutar.
ja_jp: ``program_id``: 実行するプログラムの ID 。
ko_kr: ``program_id``: 실행할 프로그램의 ID.
pt_un: ``program_id``: ID do programa a ser executado.

source: ``inputs``: Program input parameters. These input values are passed to the runtime program.
es_un: ``inputs``: Parámetros de entrada del programa. Estos valores de entrada se pasan al programa de runtime.
ja_jp: ``inputs``: プログラム入力パラメーター。 これらの入力値は、Runtimeプログラムに渡されます。
ko_kr: ``inputs``: 프로그램 입력 매개변수. 이 입력 값은 런타임 프로그램에 전달된다.
pt_un: ``inputs``: Parâmetros de entrada do programa. Esses valores de entrada são passados para o programa do Runtime.

source: ``options``: Runtime options. These options control the execution environment. Currently the only available option is ``backend_name``, which is required for IBM Quantum but it’s optional for IBM Cloud. If you do not specify one, the job is sent to the least busy device that you have access to.
es_un: ``options``: Opciones de runtime. Estas opciones controlan el entorno de ejecución. Actualmente, la única opción disponible es ``backend_name``, que es necesaria para IBM Quantum, pero es opcional para IBM Cloud. Si no especificas uno, el trabajo se envía al dispositivo menos ocupado al que tienes acceso.
ja_jp: ``options``: Runtimeオプション。 これらのオプションは、実行環境を制御します。 現在使用可能なオプションは ``backend_name`` のみです。これは、IBM Quantumには必須ですが、IBM Cloudではオプションです。 指定しない場合、ジョブはアクセスできる最もビジーでないデバイスに送信されます。
ko_kr: ``options``: 런타임 옵션. 이 옵션은 실행 환경을 제어한다. 현재 유일하게 사용 가능한 옵션은 ``backend_name`` 이며, 이는 IBM Quantum에서는 필수지만, IBM Cloud에서는 선택 사항이다. 하나를 지정하지 않으면 액세스 권한이 있는 최소 사용 중인 장치로 작업이 송신된다.
pt_un: ``options``: Opções do Runtime. Essas opções controlam o ambiente de execução. Atualmente, a única opção disponível é ``backend_name``, que é necessário para o IBM Quantum, mas é opcional para o IBM Cloud. Se você não especificar um, a tarefa será enviada para o dispositivo menos ocupado ao qual você tem acesso.

source: ``callback``: Callback function to be invoked for any interim results and final result. The callback function will receive two positional parameters: job ID and result.
es_un: ``callback``: Función de devolución de llamada que se invocará para cualquier resultado intermedio y final. La función de devolución de llamada recibirá dos parámetros posicionales: ID del trabajo y resultado.
ja_jp: ``callback``: 中間結果と最終結果に対して呼び出されるコールバック関数。 コールバック関数は、ジョブIDと結果の2つの位置パラメーターを受け取ります。
ko_kr: ``callback``: 중간 결과 및 최종 결과에 대해 호출될 콜백 함수. 이 콜백 함수는 2개의 위치 매개 변수를 받는다: job ID (작업 ID) 와 결과.
pt_un: ``callback``: Função de callback a ser invocada para quaisquer resultados provisórios e resultado final. A função de callback receberá dois parâmetros posicionais: ID da tarefa e resultado.

source: ``result_decoder``: Optional class used to decode the job result.
es_un: ``result_decoder``: Clase opcional utilizada para decodificar el resultado del trabajo.
ja_jp: ``result_decoder``: ジョブ結果のデコードに使用されるオプションのクラス。
ko_kr: ``result_decoder``: 작업 결과를 디코딩하는 데 사용되는 선택적인 클래스.
pt_un: ``result_decoder``: Classe opcional usada para decodificar o resultado da tarefa.

source: Example: ``hello-world`` program
es_un: Ejemplo: programa ``hello-world``
ja_jp: 例: ``hello-world`` プログラム
ko_kr: 예제: ``hello-world`` 프로그램
pt_un: Exemplo: programa ``hello-world``

source: Here is an example of running the ``hello-world`` program:
es_un: Aquí hay un ejemplo de cómo ejecutar el programa ``hello-world``:
ja_jp: 以下は ``hello-world`` プログラムを実行する例です。
ko_kr: 다음은 ``hello-world`` 프로그램을 수행하는 예제이다:
pt_un: Aqui está um exemplo de execução do programa ``hello-world``:
