Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/how_to/run_session.po
Languages: es_un, ja

source: Run a primitive in a session
es_un: Ejecutar una primitiva en una sesión
ja: Session内でprimitiveを実行する

source: A Qiskit Runtime session allows you to group a collection of iterative calls to the quantum computer. A session is started when the first job within the session is started. As long as the session is active, subsequent jobs within the session are prioritized by the scheduler to minimize artificial delay within an iterative algorithm. Data used within a session, such as transpiled circuits, is also cached to avoid unnecessary overhead. As a result, sessions allow you to more efficiently run programs that require iterative calls between classical and quantum resources while giving you the flexibility to deploy your programs remotely on cloud or on-premise classical resources (including your laptop).
es_un: Una sesión de Qiskit Runtime te permite agrupar una colección de llamadas iterativas a la computadora cuántica. Una sesión se inicia cuando se inicia el primer trabajo (job) dentro de la sesión. Siempre que la sesión esté activa, el planificador prioriza los trabajos posteriores dentro de la sesión para minimizar el retraso artificial dentro de un algoritmo iterativo. Los datos utilizados dentro de una sesión, como los circuitos transpilados, también se almacenan en caché para evitar una sobrecarga innecesaria. Como resultado, las sesiones te permiten ejecutar programas de manera más eficiente que requieren llamadas iterativas entre recursos clásicos y cuánticos, mientras que te brinda la flexibilidad de desplegar tus programas de forma remota en la nube o en recursos clásicos locales (incluida tu computadora portátil).
ja: Qiskit Runtime のセッションは、量子コンピューターへの反復呼び出しの集合をグループ化することができます。セッションは、セッションの最初のジョブが開始されたときに開始されます。セッションがアクティブである限り、セッション内の後続のジョブはスケジューラによって優先順位がつけられ、反復アルゴリズム内の人為的な遅延が最小にされます。トランスパイルされた回路など、セッション内で使用されるデータも、不要なオーバーヘッドを避けるためにキャッシュされます。この結果、古典と量子の間でリソースの繰り返し呼び出しが必要なプログラムをセッションによって効率的に実行することができ、プログラムをリモートでクラウドやオンプレミスの古典リソース（自分のノートPCを含む）へデプロイする柔軟さが得られます。

source: Before you begin
es_un: Antes de comenzar
ja: 始める前に

source: Before starting a session, you must `Set up Qiskit Runtime <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ and initialize it as a service:
es_un: Antes de iniciar una sesión, debes `Configurar Qiskit Runtime <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ e inicializarlo como un servicio:
ja: セッションを開始する前に、`Qiskit Runtime <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ をサービスとして初期化する必要があります。

source: Run a job in a session
es_un: Ejecutar un trabajo en una sesión
ja: Session でジョブを実行する

source: You can set up a runtime session by using the context manager (``with ...:``), which automatically opens the session for you. A session is started when the first primitive job in this context manager starts. For example, the following code creates an Estimator instance inside a Session context manager.
es_un: Puedes configurar una sesión de runtime utilizando el administrador de contexto (``with ...:``), que abre automáticamente la sesión por ti. Una sesión se inicia cuando se inicia el primer trabajo (job) primitivo en este administrador de contexto. Por ejemplo, el siguiente código crea una instancia de Estimator dentro de un administrador de contexto de Session.
ja: コンテキストマネージャー (``with ...:``) を使用してruntime sessionを設定することができます。コンテキストマネージャーによってsessionは自動的にオープンされます。 コンテキストマネージャー内で最初のprimitive ジョブが開始されると、session が開始されます。 たとえば、次のコードは、Sessionコンテキストマネージャー内にEstimatorインスタンスを作成します。

source: Start by loading the options into a primitive constructor, then pass in circuits, parameters, and observables:
es_un: Comienza cargando las opciones en un constructor primitivo, luego pasa circuitos, parámetros y observables:
ja: Primitive コンストラクターにoptions をロードしてから、circuits、parameters、observable を渡します。

source: Session options
es_un: Opciones de sesión
ja: Session のオプション

source: When you start your session, you can specify options, such as the backend to run on. For the full list of options, see the `Sessions API documentation <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Session.html#qiskit_ibm_runtime.Session>`__
ja: Session を開始する際には、実行するバックエンドなどのオプションを指定できます。 オプションの完全なリストについては、 `Sessions API ドキュメント <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Session.html#qiskit_ibm_runtime.Session>`__ を参照してください。

source: **Example:**
es_un: **Ejemplo:**
ja: **例:**

source: When running in IBM Cloud, if you don't specify a backend, the least busy backend is used.
es_un: Cuando se ejecuta en IBM Cloud, si no especificas un backend, se utiliza el backend menos ocupado.
ja: IBM Cloudで実行している場合、バックエンドを指定しなければ、最もビジーでないバックエンドが使用されます。

source: Full example
es_un: Ejemplo completo
ja: 完全な例

source: This example starts a session, runs an Estimator job, and outputs the result:
es_un: Este ejemplo inicia una sesión, ejecuta un trabajo de Estimator y genera el resultado:
ja: この例では、session を開始し、Estimatorジョブを実行し、結果を出力します:

source: How long a session stays active
es_un: Cuánto tiempo permanece activa una sesión
ja: Session の有効期間

source: When a session is started, it is assigned a maximum session timeout value. You can set this value by using the ``max_time`` parameter, which can be greater than the program's ``max_execution_time``.
es_un: Cuando se inicia una sesión, se le asigna un valor máximo de tiempo de espera de sesión. Puedes establecer este valor utilizando el parámetro ``max_time``, que puede ser mayor que el ``max_execution_time`` del programa.
ja: Session が開始される際、session タイムアウトの最大値が割り当てられます。 この値は、``max_time`` パラメーターを使用して設定できます。このパラメーターは、プログラムの ``max_execution_time`` より大きくてもかまいません。

source: If you do not specify a timeout value, it is set to the initial job's maximum execution time and is the smaller of these values:
es_un: Si no especificas un valor de tiempo de espera, se establece en el tiempo de ejecución máximo del trabajo inicial y es el menor de estos valores:
ja: タイムアウト値を指定しない場合、最初のジョブの最大実行時間に設定されます。これは次のうち小さい方の値です。

source: The system limit (8 hours for physical systems).
es_un: El límite del sistema (8 horas para sistemas físicos).
ja: システム制限値(物理システムの場合は8時間)。

source: The ``max_execution_time`` defined by the program.
es_un: El ``max_execution_time`` definido por el programa.
ja: プログラムによって定義された ``max_execution_time`` 。

source: After this time limit is reached, the session is permanently closed and any queued jobs are put into an error state.
es_un: Una vez que se alcanza este límite de tiempo, la sesión se cierra de forma permanente y todos los trabajos encolados se ponen en un estado de error.
ja: この制限時間に達すると、session は永久に閉じられ、キューに入れられたジョブはエラー状態になります。

source: Additionally, there is an *interactive* timeout value. If there are no session jobs queued within that window, the session is temporarily deactivated and normal job selection resumes. After a session is deactivated, a subsequent job could start an additional session. Jobs for the new session would then take priority until the new session deactivates or is closed. After the new session becomes inactive, if the job scheduler gets a job from the original session and its maximum timeout value has not been reached, the session is reactivated until its maximum timeout value is reached.
es_un: Adicionalmente, hay un valor de tiempo de espera *interactivo*. Si no hay trabajos (jobs) de sesión en fila dentro de esa ventana, la sesión se desactiva temporalmente y se reanuda la selección normal de trabajos. Después de que se desactiva una sesión, un trabajo posterior podría iniciar una sesión adicional. Los trabajos para la nueva sesión tendrán prioridad hasta que la nueva sesión se desactive o se cierre. Después de que la nueva sesión se vuelve inactiva, si el planificador de trabajos obtiene un trabajo de la sesión original y no se ha alcanzado su valor de tiempo de espera máximo, la sesión se reactiva hasta que se alcanza su valor de tiempo de espera máximo.
ja: さらに、*対話的* タイムアウト値もあります。 そのウィンドウ内にキューイングされたセッションジョブがない場合、セッションは一時的に無効化され、通常のジョブ選択が再開されます。 セッションが非アクティブ化されると、後続のジョブが別のセッションを開始する可能性があります。 新しいセッションのジョブは、新しいセッションが停止またはクローズされるまで優先されます。 この新しいセッションが非アクティブになった後、もしジョブスケジューラが元のセッションからジョブを取得し、かつ最大タイムアウト値に達していなければ、最大タイムアウト値に達するまでセッションが再開されます。

source: When you are done submitting jobs, you are encouraged to use ``session.close()`` to close the session. This allows the scheduler to run the next job without waiting for the session timeout. Keep in mind, however, that you cannot submit more jobs to a closed session.
es_un: Cuando hayas terminado de enviar trabajos, se te alienta a utilizar ``session.close()`` para cerrar la sesión. Esto permite que el planificador ejecute el siguiente trabajo sin esperar el tiempo de espera de la sesión. Sin embargo, ten en cuenta que no puedes enviar más trabajos a una sesión cerrada.
ja: ジョブの送信が完了したら、``session.close()`` を使用してセッションを閉じることをお勧めします。 これにより、スケジューラはセッションのタイムアウトを待たずに次のジョブを実行できます。 ただし、クローズされたセッションにこれ以上のジョブを送信することはできません。

source: Retrieve previous job results
es_un: Recuperar resultados de trabajos anteriores
ja: 以前のジョブの結果を取得する

source: You can review job results immediately after the job completes by calling ``job.result()``, but there are also several ways to retrieve your results later. After starting your job, a job instance returned. Run ``job.job_id()`` to get the ID. After the job completes, you can view the results.
es_un: Puedes revisar los resultados del trabajo (job) inmediatamente después de que sea completado llamando a ``job.result()``, pero también hay varias formas de recuperar los resultados más adelante. Después de comenzar tu trabajo, una instancia de trabajo fue devuelta. Ejecuta ``job.job_id()`` para obtener el ID. Una vez que se completa el trabajo, puedes ver los resultados.
ja: ジョブが完了した直後、``job.result()`` を呼び出すことによりジョブの結果を確認することができますが、後で結果を取得するいくつかの方法もあります。 ジョブを開始した後、ジョブ・インスタンスが戻されます。 ``job.job_id()`` を実行して IDを取得してください。 ジョブの完了後に、結果を表示できます。

source: You can check the status of your job by calling ``job.status()``.
es_un: Puedes comprobar el estado de tu trabajo llamando a ``job.status()``.
ja: ``job.status()`` を呼び出すことでジョブの状態を確認できます。

source: If you ran other jobs since running the job you want to investigate, run ``job = service.job(job_id)`` then run ``job.status()``.
es_un: Si ejecutaste otros trabajos desde que el trabajo que deseas investigar fue ejecutado, ejecuta ``job = service.job(job_id)`` y luego ejecuta ``job.status()``.
ja: 調査したいジョブを実行した後に他のジョブを実行していた場合は、 ``job = service.job(job_id)`` を実行してから ``job.status()`` を実行します。

source: Jobs are also listed on the Jobs page for your quantum service instance.
es_un: Los trabajos también son listados en la página Jobs de tu instancia de servicio cuántico.
ja: また、ジョブは、量子サービス・インスタンスの「ジョブ」ページにもリストされます。

source: From the IBM Cloud console quantum `Instances page <https://cloud.ibm.com/quantum/instances>`__, click the name of your instance, then click the Jobs tab. To see the status of your job, click the refresh arrow in the upper right corner.
es_un: En la página de `Instances <https://cloud.ibm.com/quantum/instances>`__ cuánticas de la consola de IBM Cloud, haz clic en el nombre de tu instancia y, a continuación, haz clic en la pestaña Jobs. Para ver el estado de tu trabajo, haz clic en la flecha de actualización en la esquina superior derecha.
ja: IBM Cloud コンソールの量子型 `Instances ページ <https://cloud.ibm.com/quantum/instances>`__ から、インスタンスの名前をクリックし、Jobs タブをクリックします。 ジョブの状況を確認するには、右上隅のリフレッシュ矢印をクリックします。

source: In IBM Quantum Platform, open the `Jobs page <https://quantum-computing.ibm.com/jobs>`__.
es_un: En la Plataforma de IBM Quantum, abre la `página de Jobs <https://quantum-computing.ibm.com/jobs>`__.
ja: IBM Quantum Platformでは、`Jobs ページ <https://quantum-computing.ibm.com/jobs>`__ を開きます。

source: How session jobs fit into the job queue
es_un: Cómo encajan los trabajos de sesión en la fila de trabajos
ja: セッションジョブがジョブキューにどのように収まるか

source: For each backend, the first job in the session waits its turn in the queue normally, but while the session is active, subsequent jobs within the same session take priority over any other queued jobs. If there are no jobs that are part of a session, the next job from the regular fair-share queue is run. Jobs still run one at a time. Thus, jobs that belong to a session still queue up if you already have one running, but you do not have to wait for them to complete before submitting more jobs.
es_un: Para cada backend, el primer trabajo (job) de la sesión normalmente espera su turno en la fila, pero mientras la sesión está activa, los trabajos subsecuentes dentro de la misma sesión tienen prioridad sobre cualquier otro trabajo en la fila. Si no hay trabajos que formen parte de una sesión, se ejecuta el siguiente trabajo de la fila regular de participación justa. Los trabajos aún se ejecutan uno a la vez. Por lo tanto, los trabajos que pertenecen a una sesión aún se ponen en la fila si ya tienes uno ejecutándose, pero no tienes que esperar a que se completen para enviar más trabajos.
ja: バックエンドごとに、通常はセッション内の最初のジョブがキューでの順番を待機します。ただしセッションがアクティブな間は、同じセッション内の後続ジョブが、キューイングされている他のジョブよりも優先されます。 セッションの一部であるジョブが存在しない場合、通常の fair-share キューからの次のジョブが実行されます。 ジョブはいずれにしても一度にひとつだけ実行されます。 このように、セッションに属するジョブは、すでに実行されているものがあればキューにたまりますが、さらにジョブをサブミットするのにそれらが完了するのを待つ必要はありません。
