Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/how_to/specify_the_backend.po
Languages: ja_jp, pt_un, ta_in

source: This page was generated from `docs/how_to/specify_the_backend.ipynb`__.
ja_jp: このページは `docs/how_to/specify_the_backend.ipynb`__ から生成されました。
pt_un: Esta página foi gerada a partir de `docs/how_to/specify_the_backend.ipynb`__.
ta_in: இந்தப் பக்கம் `docs/how_to/specify_the_backend.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Specify the backend
ja_jp: バックエンドの指定
pt_un: Especifique o backend
ta_in: பின்தளத்தைக் குறிப்பிடவும்

source: This guide shows you how to specify the backend to run a runtime programs.
ja_jp: このガイドでは、バックエンドを指定してRuntimeプログラムを実行する方法を説明します。
pt_un: Este guia mostra como especificar o backend para executar programas do Runtime.
ta_in: இயக்க நேர நிரல்களை இயக்கப் பின்தளத்தை எவ்வாறு குறிப்பிடுவது என்பதை இந்த வழிகாட்டி காட்டுகிறது.

source: Before you begin
ja_jp: 始める前に
pt_un: Antes de começar
ta_in: நீங்கள் தொடங்கும் முன்

source: Throughout this guide, we will assume that you have `setup the Qiskit Runtime service instance <../getting_started.rst>`__ and initialize it as ``service``:
ja_jp: このガイド全体を通して、 `Qiskit Runtimeサービス・インスタンス <../getting_started.rst>`__ をセットアップし、それを ``service`` として初期化すると仮定します。
pt_un: Ao longo deste guia, vamos supor que você tenha `configurado a instância do serviço Qiskit Runtime <../getting_started.rst>`__ e inicializado como ``service``:
ta_in: இந்த வழிகாட்டி முழுவதும், நீங்கள் `Qiskit இயக்க நேர சேவை நிகழ்வை <../getting_started.rst>`__ அமைத்து, அதை ``service`` எனத் தொடங்கியுள்ளீர்கள் என்று கருதுவோம்:

source: Steps
ja_jp: ステップ
pt_un: Passos
ta_in: படிகள்

source: You can specify the backend to run a runtime program by specifying the ``backend_name`` option and pass to the program:
ja_jp: ``backend_name`` オプションを指定してプログラムに渡すことによって、Runtimeプログラムを実行するバックエンドを指定できます。
pt_un: É possível escolher o backend para executar um programa do Runtime especificando a opção ``backend_name`` e passar para o programa:
ta_in: ``backend_name`` விருப்பத்தைக் குறிப்பிட்டு, நிரலுக்கு அனுப்புவதன் மூலம், இயக்க நேர நிரலை இயக்கப் பின்தளத்தைக் குறிப்பிடலாம்:

source: Note
ja_jp: 注記
pt_un: Nota
ta_in: குறிப்பு

source: For IBM Quantum, specifying the backend is required.
ja_jp: IBM Quantumの場合は、バックエンドを指定する必要があります。
pt_un: Para IBM Quantum, é necessário especificar o backend.
ta_in: IBM Quantum க்கு, பின்தளத்தைக் குறிப்பிடுவது அவசியம்.

source: For IBM Cloud, specifying the backend is optional. If you do not specify one, the job is sent to the least busy device that you have access to.
ja_jp: IBM Cloudの場合、バックエンドの指定はオプションです。 指定しない場合、ジョブはアクセスできる最もビジーでないデバイスに送信されます。
pt_un: Para o IBM Cloud, especificar o backend é opcional. Se você não especificar um, a tarefa será enviada para o dispositivo menos ocupado ao qual você tem acesso.
ta_in: IBM Cloud க்கு, பின்தளத்தைக் குறிப்பிடுவது விருப்பமானது. நீங்கள் ஒன்றைக் குறிப்பிடவில்லை என்றால், நீங்கள் அணுகக்கூடிய குறைந்த பிஸியான சாதனத்திற்கு வேலை அனுப்பப்படும்.
