Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/getting_started.po
Languages: bn_bn, es_un, fr_fr, ja_jp, ko_kr, pt_un, ru_ru, ta_in, tr_tr, vi_vn

source: Getting started
bn_bn: শুরুর নির্দেশনা
es_un: Primeros pasos
fr_fr: Premiers Pas
ja_jp: はじめに
ko_kr: 시작하기
pt_un: Primeiros passos
ru_ru: Начало работы
ta_in: தொடங்குதல்
tr_tr: Başlarken
vi_vn: Bắt đầu

source: Installation
bn_bn: স্থাপন (ইনস্টলেশন)
es_un: Instalación
ja_jp: インストール
ko_kr: 설치
pt_un: Instalação
ru_ru: Инструкция по установке
ta_in: நிறுவல்
tr_tr: Kurulum
vi_vn: Cài đặt

source: Qiskit Nature depends on the main Qiskit package which has its own `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ detailing the installation options for Qiskit and its supported environments/platforms. You should refer to that first. Then the information here can be followed which focuses on the additional installation specific to Qiskit Nature.
bn_bn: Qiskit Nature মূল Qiskit প্যাকেজের উপর নির্ভর করে যার নিজস্ব `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ Qiskit এবং এর সমর্থিত পরিবেশ/প্ল্যাটফর্মগুলির জন্য ইনস্টলেশন বিকল্পগুলি বিশদ বর্ণনা করে। আপনার প্রথমে উল্লেখ করা উচিত। তারপরে এখানকার তথ্য অনুসরণ করা যেতে পারে যা Qiskit অপটিমাইজার এর সাথে সম্পর্কিত অতিরিক্ত ইনস্টলেশনকে কেন্দ্র করে।
es_un: Qiskit Nature depende del paquete principal de Qiskit, que tiene su propio `Qiskit Primeros Pasos <https://qiskit.org/documentation/getting_started.html>`__ que detalla las opciones de instalación de Qiskit y sus entornos/plataformas compatibles. Deberías referirte a eso primero. Luego, se puede seguir la información que está aquí, la cual se centra en la instalación adicional específica de Qiskit Nature.
fr_fr: Qiskit Nature dépend du paquet principal Qiskit qui a son propre `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ détaillant les options d'installation pour Qiskit et ses environnements/plateformes pris en charge. Vous devriez d'abord y faire référence, puis vous pouvez suivre les informations ici qui se concentrent sur l'installation supplémentaire spécifique pour Qiskit Nature.
ko_kr: Qiskit Nature는 Qiskit 및 지원되는 환경/플랫폼의 설치 옵션을 자세히 설명하는 `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ 를 가지고 있는 기본 Qiskit 패키지에 의존한다. 먼저 그것을 참고해야 한다. 그 후 Qiskit Nature의 추가 설치에 초점을 맞추는 이 내용을 따라라.
pt_un: O Qiskit Nature depende do pacote Qiskit principal que tem seu próprio `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ detalhando as opções de instalação para Qiskit e seus ambientes/plataformas suportados. Você deve se referir a isso primeiro. Em seguida, as informações aqui podem ser seguidas, as quais se concentram na instalação adicional específica para Qiskit Nature.
ru_ru: Пакет Qiskit Nature зависит от основного пакета Qiskit, который имеет свою собственную страницу `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>` __ с подробным описанием опций установки Qiskit и поддерживаемых сред/платформ. Обратите на это внимание в первую очередь. Далее здесь можно найти информацию, которая сфокусируется на дополнительной установке, специфичной для Qiskit Nature.
ta_in: Qiskit நேச்சர் அதன் சொந்த `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ மற்றும் அதன் ஆதரவு சூழல்கள் / தளங்களுக்கான நிறுவல் விருப்பங்களை விவரிக்கும் முக்கிய qiskit தொகுப்பைப் பொறுத்தது. நீங்கள் அதை முதலில் குறிப்பிட வேண்டும். Qiskit நேச்சருக்கு குறிப்பிட்ட கூடுதல் நிறுவலை மையமாகக் கொண்ட தகவல்களை இங்கே பின்பற்றலாம்.
tr_tr: Qiskit Nature; Qiskit için kurulum seçeneklerini ve onun desteklenen ortam/platformlarını detaylandıran `Qiskit Başlarken <https://qiskit.org/documentation/getting_started.html>`__ adındaki kendi ana Qiskit paketine bağlıdır. Öncelikle buna bakmalısınız. Sonrasında, burada yer alan Qiskit Nature'a özgü ek kuruluma ilişkin bilgiler takip edilebilir.
vi_vn: Qiskit Nature phụ thuộc vào gói Qiskit chính sở hữu ' Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>` __ riêng, trình bày các lựa chọn cài đặt cho Qiskit và các môi trường/nền tảng được hỗ trợ của nó. Bạn nên tham khảo mục đó trước. Tiếp đó, các thông tin tập trung vào những cài đặt bổ sung cụ thể cho Qiskit Nature có thể được xem thêm tại đây.

source: Qiskit Nature has some functions that have been made optional where the dependent code and/or support program(s) are not (or cannot be) installed by default. These include, for example, classical library/programs for molecular problems. See :ref:`optional_installs` for more information.
bn_bn: Qiskit Nature এর কিছু ফাংশন রয়েছে যা ঐচ্ছিকভাবে তৈরি করা হয়েছে যেখানে নির্ভরযোগ্য কোড এবং/বা সমর্থন প্রোগ্রাম (গুলি) ডিফল্টরূপে ইনস্টল করা হয় না (বা করা যায় না)। এর মধ্যে রয়েছে, উদাহরণস্বরূপ, আণবিক সমস্যার জন্য ক্লাসিক্যাল library/প্রোগ্রাম। আরও তথ্যের জন্য :ref:`optional_installs` দেখুন।
es_un: Qiskit Nature tiene algunas funciones que se han hecho opcionales cuando el código dependiente y/o los programa(s) de soporte no están (o no pueden ser) instalados de forma predeterminada. Estos incluyen, por ejemplo, librerías/programas clásicos para problemas moleculares. Consulta :ref:`optional_installs` para más información.
fr_fr: Certaines fonctions de Qiskit Nature ont été rendues facultatives lorsque le code ou le programme de support dépendants ne sont pas (ou ne peuvent pas être) installés par défaut. Celles-ci comprennent, par exemple, la bibliothèque classique/les programmes pour les problèmes moléculaires. Voir :ref:`optional_installs` pour plus d'informations.
ja_jp: Qiskit Natureには、デフォルトで依存コードまたはサポート・プログラム ( あるいはその両方 ) がインストールされていない (または、それらを使用できない ) ような、オプション機能がいくつかあります。例えば、分子問題に対する古典的なライブラリやプログラムです。詳細については、 :ref:`optional_installs` を参照してください。
ko_kr: Qiskit Nature에는 종속 코드 및/또는 지원 프로그램이 기본적으로 설치되어 있지 않은 (또는 설치될 수 없는) 일부 선택적인 기능들이 있다. 이에는 분자 (molecular) 문제들을 위한 고전적인 라이브러리/프로그램들이 있다. 자세한 내용은 :ref:`optional_installs` 를 참조하여라.
pt_un: O Qiskit Nature tem algumas funções que se tornaram opcionais onde o código dependente e/ou programa(s) de suporte não são (ou não podem ser) instalados por padrão. Estes incluem, por exemplo, biblioteca/programas clássicos para problemas moleculares. Veja :ref:`optional_installs` para mais informações.
ru_ru: В Qiskit Nature есть некоторые функции, которые были сделаны необязательными, если зависимые программы и/или программы поддержки не установлены (или не могут быть) установлены по умолчанию. К ним относятся, например, классическая библиотека/программы для молекулярных задач. Дополнительная информация приведена в разделе :ref:`optional_installs`.
ta_in: Qiskit நேச்சர் சில செயல்பாடுகளைக் கொண்டுள்ளது, அவை கட்டாயமற்றவையாக அமைக்கப்பட்டுள்ளது அங்கு சார்பு குறியீடு மற்றும் / அல்லது ஆதரவு நிரல் (கள்) இயல்பாக நிறுவப்படவில்லை (அல்லது இருக்க முடியாது). எடுத்துக்காட்டாக, மூலக்கூறு சிக்கல்களுக்கான கிளாசிக்கல் நூலகம் / நிரல்கள் இதில் அடங்கும். மேலும் தகவலுக்கு :ref:`optional_installs` ஐப் பார்க்கவும்.
tr_tr: Qiskit Nature, bağımlı kodun ve/veya destek program(lar)ının varsayılan olarak kurulmadığı (veya kurulamadığı) durumlarda isteğe bağlı hâle getirilmiş bazı işlevlere sahiptir. Bunlar, örneğin moleküler problemler için klasik kütüphaneleri/programları içerir. Daha fazla bilgi için :ref:`opsiyonel_kurulumlar` bölümüne bakınız.
vi_vn: Qiskit Nature có một số chức năng đã được điều chỉnh thành tùy chọn để các code phụ thuộc và/hoặc (các) chương trình hỗ trợ không (hoặc không thể) được cài đặt theo mặc định. Các chức năng đó bao gồm, lấy ví dụ như, thư viện cổ điển/các chương trình cho các bài toán phân tử. Xem :ref:`optional_installs` để biết thêm thông tin.

source: Start locally
bn_bn: স্থানীয়ভাবে শুরু করা
es_un: Comenzar localmente
fr_fr: Démarrer localement
ja_jp: ローカルからの開始
ko_kr: 로컬에서 시작
pt_un: Iniciar localmente
ru_ru: Запустить локально
ta_in: குறிப்பிட்ட இடத்தில் தொடங்கு
tr_tr: Yerel Olarak Başlatma
vi_vn: Bắt đầu cục bộ

source: The simplest way to get started is to follow the `getting started 'Start locally' guide for Qiskit <https://qiskit.org/documentation/getting_started.html>`__
es_un: La forma más sencilla de comenzar es seguir la `guía de primeros pasos 'Comenzar localmente' para Qiskit <https://qiskit.org/documentation/getting_started.html>`__

source: In your virtual environment where you installed Qiskit simply add ``nature`` to the extra list in a similar manner to how the extra ``visualization`` support is installed for Qiskit, i.e:
bn_bn: আপনার ভার্চুয়াল পরিবেশে যেখানে আপনি কিস্কিট (Qiskit) ইনস্টল করেছেন, কিস্কিটের জন্য কীভাবে অতিরিক্ত ``visualization`` সাহায্যকারীটি ইনস্টল করা হয়েছে তার সাথে একইভাবে অতিরিক্ত তালিকায় ``nature`` যুক্ত করুন:
es_un: En tu entorno virtual donde instalaste Qiskit, simplemente agrega ``nature`` a la lista adicional de manera similar a cómo se instala el soporte adicional de ``visualization`` para Qiskit, es decir:
fr_fr: Dans votre environnement virtuel où vous avez installé Qiskit ajoutez simplement ``nature`` à la liste supplémentaire de manière similaire à la façon dont le support supplémentaire de ``visualization`` est installé pour Qiskit, i.e :
ko_kr: Qiskit을 설치한 가상 환경에서 추가적인 ``visualization`` 지원을 설치한 방법과 마찬가지로 ``nature`` 를 단순히 추가 리스트에 추가한다.
pt_un: Em seu ambiente virtual onde você instalou o Qiskit, simplesmente adicione ``nature`` à lista extra de maneira semelhante a como o suporte extra ``visualization`` é instalado para o Qiskit, ou seja:
ru_ru: В виртуальной среде, где Вы установили Qiskit, просто добавьте ``nature`` в дополнительный список пакетов подобно тому как устанавливается дополнительная поддержка ``visualization`` в Qiskit, например:
ta_in: நீங்கள் qiskit-டை நிறுவிய உங்கள் மெய்நிகர் சூழலில்,qiskit-டிற்கு கூடுதல் ``visualization`` ஆதரவு எவ்வாறு நிறுவப்பட்டுள்ளது என்பதற்கு ஒத்த வகையில் கூடுதல் பட்டியலில் ``nature`` ஐச் சேர்க்கவும், அதாவது:
tr_tr: Qiskit'i kurduğunuz sanal ortamınızda, Qiskit için ekstra "görselleştirme" desteğinin nasıl kurulduğuna benzer şekilde, "nature"ı ekstra listeye eklemeniz yeterlidir, yani:
vi_vn: Trong môi trường ảo mà bạn đã cài đặt Qiskit, chỉ cần thêm ``nature`` vào danh sách bổ sung tương tự như cách cài đặt hỗ trợ bổ sung ``visualization`` cho Qiskit, nghĩa là:

source: It is worth pointing out that if you're a zsh user (which is the default shell on newer versions of macOS), you'll need to put ``qiskit[nature]`` in quotes:
bn_bn: মনে করিয়ে দেয়া প্রয়োজন, আপনি যদি zsh (macOS এর নতুনতর সংস্করণগুলোতে এটি পূর্বনির্ধারিত (ডিফল্ট) শেল) ব্যবহারকারী হয়ে থাকেন তাহলে আপনাকে উদ্ধৃতির মধ্যে ``qiskit[nature]`` লিখতে হবে:
es_un: Vale la pena señalar que si eres usuario de zsh (que es el shell predeterminado en las versiones más recientes de macOS), deberás poner ``qiskit[nature]`` entre comillas:
fr_fr: Il est utile de signaler que si vous êtes un utilisateur de zsh (qui est le shell par défaut sur les nouvelles versions de macOS), vous aurez besoin de mettre ``qiskit[nature]`` entre guillemets :
ko_kr: Zsh 사용자 (최신 버전의 macOS 기본 shell) 인 경우 ``qiskit[nature]`` 을 따옴표로 묶어야 한다:
pt_un: Vale a pena ressaltar que se você for um usuário zsh (que é o shell padrão nas versões mais recentes do macOS), você precisará usar ``qiskit[nature]`` entre aspas:
ru_ru: Стоит отметить, что если Вы используете zsh (оболочка по умолчанию для более новых версий macOS), Вам нужно указать ``qiskit[nature]`` в кавычках:
ta_in: நீங்கள் ஒரு zsh பயனராக இருந்தால் (இது மேக்ஓஸின் புதிய பதிப்புகளில் இயல்புநிலை ஷெல்), நீங்கள் மேற்கோள்களில் ``qiskit[nature]`` வைக்க வேண்டும் என்பதை சுட்டிக்காட்ட வேண்டியது அவசியம்:
tr_tr: Bir zsh kullanıcısıysanız (macOS'un daha yeni sürümlerinde varsayılan kabuktur), ``qiskit[nature]``ı tırnak içine koymanız gerekeceğini belirtmekte fayda var:
vi_vn: Một điều đáng lưu ý là nếu bạn là một người sử dụng zsh (shell mặc định trên các phiên bản mới hơn của macOS), bạn sẽ cần phải đặt ``qiskit[nature]`` vào trong dấu nháy đơn:

source: Install from source
bn_bn: উৎস থেকে স্থাপন
es_un: Instalar desde el código fuente
fr_fr: Installation à partir de la source
ja_jp: ソースからのインストール
ko_kr: 소스로부터 설치하기
pt_un: Instalando da Fonte
ru_ru: Установить из исходного кода
ta_in: ஆரம்ப இடத்திலிருந்து நிறுவவும்
tr_tr: Kaynaktan Yükleme
vi_vn: Cài đặt từ nguồn

source: Installing Qiskit Nature from source allows you to access the most recently updated version under development instead of using the version in the Python Package Index (PyPI) repository. This will give you the ability to inspect and extend the latest version of the Qiskit Nature code more efficiently.
bn_bn: উৎস থেকে Qiskit Nature ইনস্টল করলে আপনি Qiskit এর উন্নয়নের অধীনে অতি সম্প্রতি আপডেট হওয়া সংস্করণটি ব্যবহার করতে পারবেন Python Package Index (PyPI) রিপোজিটরি থেকে ইনস্টল করার পরিবর্তে। এটি আপনাকে Qiskit Nature কোডের সর্বশেষ সংস্করণটি আরও নিখুঁত ভাবে পরিদর্শন করার এবং প্রসারিত করার দক্ষতা দেবে।.
es_un: La instalación de Qiskit Nature desde el código fuente te permite acceder a la versión actualizada más recientemente en desarrollo en lugar de usar la versión en el repositorio Python Package Index (PyPI). Esto te dará la capacidad de inspeccionar y extender la última versión del código de Qiskit Nature de manera más eficiente.
fr_fr: L'installation de Qiskit Nature à partir des sources vous permet d'accéder à la dernière version mise à jour en cours de développement au lieu d'utiliser la version dans le dépôt Python Package Index (PyPI). Cela vous permettra d'inspecter et d'étendre plus efficacement la dernière version du code de Qiskit Nature.
ja_jp: ソースから Qiskit Natureをインストールすることにより、Python Package Index (PyPI) リポジトリーのバージョンを使う代わりに、最新の Qiskit バージョンにアクセスすることができます。これにより、Qiskit Natureコードの最新版を調査したり、拡張することがより効果的にできるようになります。
ko_kr: 소스 코드로부터 Qiskit Nature를 설치하는 것은 Python Package Index (PyPI) repository로 부터 설치하는 것 대신에 가장 최신에 업데이트된 버전을 사용하도록 해준다. 이를 통해 손쉽게 Qiskit Nature의 최신 코드를 들여다 보고 확장할 수 있다.
pt_un: A instalação do Qiskit Nature da fonte permite que você acesse a versão atualizada mais recentemente em desenvolvimento, em vez de usar a versão no repositório Python Package Index (PyPI). Isso lhe dará a capacidade de inspecionar e estender a versão mais recente do código Qiskit Nature com mais eficiência.
ru_ru: Установка элементов из исходного кода позволит Вам получить доступ к последней обновленной версии Qiskit Nature вместо использования версии из репозитория Python Package Index (PyPI). Это даст Вам возможность более эффективно изучить и внести свой вклад в улучшение последней версии кода Qiskit Nature.
ta_in: ஆரம்ப இடத்திலிருந்து Qiskit நேச்சரை நிறுவுவது பைத்தான் தொகுப்பு அட்டவணை (பைபிஐ) களஞ்சியத்தில் பதிப்பைப் பயன்படுத்துவதற்குப் பதிலாக, சமீபத்தில் புதுப்பிக்கப்பட்ட பதிப்பை வளர்ச்சியின் கீழ் அணுக அனுமதிக்கிறது. இது Qiskit நேச்சர் குறியீட்டின் சமீபத்திய பதிப்பை மிகவும் திறமையாக ஆய்வு செய்து நீட்டிக்கும் திறனை உங்களுக்கு வழங்கும்.
tr_tr: Qiskit Nature'ı kaynaktan yüklemek, Python Paket Dizini (PyPI) deposundaki sürümü kullanmak yerine, geliştirilmekte olan en son güncellenen sürüme erişmenizi sağlar. Bu size Qiskit Nature kodunun en son sürümünü daha verimli bir şekilde inceleme ve genişletme kabiliyeti verecektir.
vi_vn: Cài đặt Qiskit Nature từ nguồn cho phép bạn truy cập phiên bản đang phát triển được cập nhật gần nhất thay vì sử dụng phiên bản trong kho lưu trữ Python Package Index (PyPI). Điều này sẽ giúp bạn kiểm tra và mở rộng code của phiên bản Qiskit Nature mới nhất một cách hiệu quả hơn.

source: Since Qiskit Nature depends on Qiskit, and its latest changes may require new or changed features of Qiskit, you should first follow Qiskit's `"Install from source"` instructions here `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
bn_bn: যেহেতু Qiskit Nature কিস্কিটের উপর নির্ভর করে, এবং এর সর্বশেষ পরিবর্তনগুলির জন্য কিস্কিটের নতুন বা পরিবর্তিত বৈশিষ্ট্যগুলির প্রয়োজন হতে পারে, তাই আপনাকে প্রথমে কিস্কিটের `"Install from source"` নির্দেশাবলী `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ এ অনুসরণ করতে হবে
es_un: Dado que Qiskit Nature depende de Qiskit, y sus últimos cambios pueden requerir características nuevas o modificadas de Qiskit, primero debes seguir las instrucciones de `"Instalar desde el código fuente"` de Qiskit aquí `Qiskit Primeros Pasos <https://qiskit.org/documentation/getting_started.html>`__
fr_fr: Étant donné que Qiskit Nature dépend de Qiskit, et que ses derniers changements peuvent nécessiter des fonctionnalités nouvelles ou modifiées de Qiskit, vous devriez d'abord suivre les instructions de Qiskit `"Installer à partir de la source"` ici `Qiskit pour commencer <https://qiskit.org/documentation/getting_started.html>`__
ja_jp: Qiskit Natureは Qiskit に依存しており、最新の変更が Qiskit の新規機能または変更された機能を必要とする場合があるので、まず「 `Qiskit はじめに <https://qiskit.org/documentation/getting_started.html>`__ 」の `「ソースからのインストール」` の指示に従ってください。
ko_kr: Qiskit Nature는 Qiskit에 의존하므로 최신 변경 사항에는 Qiskit의 새로운 기능이나 변경된 기능이 필요할 수 있다. 따라서 다음 문서에 있는 Qiskit의 `"Install from source"` 의 지시사항을 먼저 수행해야 한다: `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
pt_un: Uma vez que o Qiskit Nature depende do Qiskit, e suas últimas mudanças podem exigir recursos novos ou modificados do Qiskit, você deve primeiro seguir as instruções `"Install from source"` do Qiskit aqui `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
ru_ru: Так как Qiskit Nature зависит от Qiskit, и его последние изменения могут потребовать новых или измененных функций Qiskit, сначала следуйте инструкциям `"Установить из исходного кода"` здесь `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
ta_in: Qiskit நேச்சர் கிஸ்கிட்டைப் பொறுத்தது என்பதால், அதன் சமீபத்திய மாற்றங்களுக்கு Qiskit-டின் புதிய அல்லது மாற்றப்பட்ட அம்சங்கள் தேவைப்படலாம் என்பதால், நீங்கள் முதலில் Qiskit-டின் `"Install from source"` இங்கே வழிமுறைகளைப் பின்பற்ற வேண்டும் `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
tr_tr: Qiskit Nature, Qiskit'e bağlı olduğundan ve onun son değişiklikleri Qiakit'in yeni ya da değiştirilmiş özelliklerini gerektirebileceğinden, ilk olarak burayı takip etmeniz gerekmektedir: `"Install from source"` instructions here `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
vi_vn: Do Qiskit Nature phụ thuộc vào Qiskit, và những thay đổi mới nhất của nó có thể sẽ yêu cầu các tính năng mới hoặc chỉnh sửa các tính năng của Qiskit, nên trước tiên bạn cần làm theo hướng dẫn `"Install from source"` của Qiskit tại `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__

source: Using the same development environment that you installed Qiskit in you are ready to install Qiskit Nature.
bn_bn: আপনি যেই কিস্কিট ইনস্টল করেছেন সেই একই কর্মপরিবেশ ব্যবহার করে আপনি Qiskit Nature ইনস্টল করতে প্রস্তুত।
es_un: Usando el mismo entorno de desarrollo en el que instalaste Qiskit, estás listo para instalar Qiskit Nature.
fr_fr: En utilisant le même environnement de développement que celui où vous avez installé Qiskit, vous êtes prêt à installer Qiskit Nature.
ja_jp: Qiskit をインストールしたものと同じ開発環境を使用して、 Qiskit Natureをインストールすることができます。
ko_kr: Qiskit을 설치한 동일한 개발 환경을 사용하여 Qiskit Nature를 설치할 준비가 되었다.
pt_un: Usando o mesmo ambiente de desenvolvimento em que instalou o Qiskit, você está pronto para instalar o Qiskit Nature.
ru_ru: Используя ту же среду разработки, в которой Вы установили Qiskit, Вы можете установить пакет Qiskit Nature.
ta_in: நீங்கள் Qiskit-டை நிறுவிய அதே வளர்ச்சி சூழலைப் பயன்படுத்தி Qiskit நேச்சரை நிறுவ தயாராக உள்ளீர்கள்.
tr_tr: Qiskit'i kurduğunuz aynı geliştirme ortamını kullanarak Qiskit Nature'ı kurmaya hazırsınız.
vi_vn: Bây giờ bạn đã sẵn sàng để cài đặt Qiskit Nature trên cùng môi trường phát triển mà bạn đã cài đặt Qiskit trước đó.

source: Clone the Qiskit Nature repository.
bn_bn: Qiskit Nature রিপোজিটরি প্রতিলিপি করুন।
es_un: Clonar el repositorio de Qiskit Nature.
fr_fr: Cloner le dépôt de Qiskit Nature.
ja_jp: Qiskit Natureリポジトリーをクローンします。
ko_kr: Qiskit Nature 저장소를 복제하라.
pt_un: Clone o repositório Qiskit Nature.
ru_ru: Клонируйте репозиторий Qiskit Nature.
ta_in: Qiskit நேச்சர் களஞ்சியத்தை குளோன் செய்யுங்கள்.
tr_tr: Qiskit Nature deposunu klonla.
vi_vn: Nhân bản kho lưu trữ của Qiskit Nature.

source: Cloning the repository creates a local folder called ``qiskit-nature``.
bn_bn: রিপোজিটোরিটি ক্লোন করলে ``qiskit-nature`` নামক একটি স্থানীয় ফোল্ডার তৈরী হবে।
es_un: La clonación del repositorio crea una carpeta local llamada ``qiskit-nature``.
fr_fr: Un répertoire local appelé ``qiskit-nature`` est créé automatiquement.
ja_jp: レポジトリーをクローンすると、 ``qiskit-nature`` という名前のローカル・フォルダが作成されます。
ko_kr: 저장소를 복제하면 ``qiskit-nature`` 라는 이름의 로컬 폴더가 생성된다.
pt_un: A clonagem do repositório cria uma pasta local chamada ``qiskit-nature``.
ru_ru: Клонирование репозитория создает локальную папку с названием ``qiskit-nature``.
ta_in: களஞ்சியத்தை குளோன் செய்வது ``qiskit-nature`` என்ற அந்த இடத்திற்குறிய கோப்புறையை உருவாக்குகிறது.
tr_tr: Depoyu klonlamak, ``qiskit-nature`` adlı yerel bir klasör oluşturur.
vi_vn: Nhân bản kho lưu trữ sẽ tạo ra một thư mục cục bộ có tên ``qiskit-nature``.

source: If you want to run tests or linting checks, install the developer requirements.
bn_bn: টেস্ট রান করানোর জন্য বা লিনটিং চেক করার জন্য, ডেভেলপারের রিকোয়ারমেন্টগুলি ইনস্টল করুন।
es_un: Si quieres ejecutar pruebas o verificaciones de linting, instala los requerimientos de desarrollador.
fr_fr: Si vous voulez exécuter des tests ou des vérifications de liaison, installez les prérequis du développeur.
ja_jp: もし、テストを実行したり文法をチェックしたい場合は、開発者向けライブラリをインストールします。
ko_kr: 만약 테스트 코드를 실행하거나 철자법 검사를 하고자 한다면, 개발자 요구사항 라이브러리를 설치하라.
pt_un: Se você quiser executar testes ou análise de código, instale os requisitos de desenvolvedor.
ru_ru: Если Вы хотите запустить тесты, установите необходимые инструменты разработчика.
ta_in: நீங்கள் சோதனைகள் அல்லது மெல்லிய சரிபார்ப்புகளை இயக்க விரும்பினால், டெவலப்பர் தேவைகளை நிறுவவும்.
tr_tr: Test veya tiftikleme kontrolleri yapmak istiyorsanız, geliştirici gereksinimlerini yükleyin.
vi_vn: Nếu bạn muốn chạy test hoặc linting, hãy cài đặt các yêu cầu dành cho nhà phát triển.

source: Install ``qiskit-nature``.
bn_bn: ``qiskit-nature`` ইনস্টল করুন।
es_un: Instalar ``qiskit-nature``.
fr_fr: Installez ``qiskit-nature``.
ja_jp: ``qiskit-nature`` をインストールします。
ko_kr: ``qiskit-nature`` 를 설치하라.
pt_un: Instale ``qiskit-nature``.
ru_ru: Установите ``qiskit-nature``.
ta_in: ``qiskit-nature`` ஐ நிறுவவும்.
tr_tr: ``qiskit-nature`` yükleyin.
vi_vn: Cài đặt ``qiskit-nature``.
