Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/getting_started.po
Languages: bn_bn, es_un, fr_fr, ja_jp, ko_kr, pt_un, ru_ru, ta_in, tr_tr, vi_vn

source: If you want to install it in editable mode, meaning that code changes to the project don't require a reinstall to be applied, you can do this with:
bn_bn: আপনি যদি এটিকে সম্পাদনযোগ্য মোডে ইনস্টল করতে চান, মানে এই প্রকল্পের কোড পরিবর্তনের জন্য প্রয়োগ করার জন্য পুনরায় ইনস্টল করা প্রয়োজন না, আপনি এটি করতে পারেন:
es_un: Si deseas instalarlo en modo editable, lo que significa que los cambios de código en el proyecto no requieren una reinstalación para ser aplicados, puedes hacerlo con:
fr_fr: Si vous voulez l'installer en mode édition, ce qui signifie que les modifications de code du projet ne nécessitent pas de réinstallation pour être appliquées, vous pouvez le faire avec:
ja_jp: 編集可能モード(プロジェクトのコードを変更しても再インストールする必要なし) でインストールする場合は、次の手順を実行します:
ko_kr: 만약, 프로젝트에 코드가 변화하였을 때 재설치가 필요하지 않는, 수정 가능한 모드로 설치하고자 한다면, 다음의 명령어를 사용하라.
pt_un: Se você quiser instalá-lo em modo editável, o que significa que as alterações de código no projeto não requerem que uma reinstalação seja aplicada, você pode fazer isso com:
ru_ru: Если Вы хотите установить пакет в редактируемом режиме, который позволяет не переустанавливать пакет в случае изменения кода в проекте, Вы можете сделать это с помощью:
ta_in: நீங்கள் இதை திருத்தக்கூடிய முறையில் நிறுவ விரும்பினால், திட்டத்தின் குறியீடு மாற்றங்களுக்கு மீண்டும் நிறுவல் தேவையில்லை என்று பொருள், இதை நீங்கள் செய்யலாம்:
tr_tr: Düzenlenebilir modda yüklemek istiyorsanız, yani projedeki kod değişikliklerinin yeniden yüklenmesi gerekmiyorsa, bunu şu şekilde yapabilirsiniz:
vi_vn: Nếu bạn muốn cài đặt ở chế độ có thể chỉnh sửa được, nghĩa là khi bạn thay đổi code trong project thì bạn không cần phải cài đặt lại, làm điều này bằng cách:

source: Optional installs
bn_bn: ঐচ্ছিক ইনস্টল
es_un: Instalaciones opcionales
fr_fr: Installations optionnelles
ja_jp: オプションのインストール
ko_kr: 선택적 설치
pt_un: Instalações opcionais
ru_ru: Необязательные установки
ta_in: விருப்ப நிறுவல்கள்
tr_tr: Opsiyonel yüklemeler
vi_vn: Các cài đặt tùy chọn

source: Qiskit Nature supports the use of different classical libraries and programs, via drivers, which compute molecular information, such as one and two body integrals. This is needed as problem input to algorithms that compute properties of molecules, such as the ground state energy, so at least one such library/program should be installed. As you can choose which driver you use, you can install as many, or as few as you wish, that are supported by your platform etc.
bn_bn: Qiskit Nature ড্রাইভারের মাধ্যমে বিভিন্ন ক্লাসিক্যাল লাইব্রেরি এবং প্রোগ্রামের ব্যবহার সমর্থন করে, যা আণবিক তথ্য গণনা করে, যেমন এক এবং দুটি বডি ইন্টিগ্রাল। এটি অ্যালগরিদমের সমস্যা ইনপুট হিসাবে প্রয়োজন যা অণুর বৈশিষ্ট্যগুলি যেমন গ্রাউন্ড স্টেট এনার্জি হিসাব করে, তাই কমপক্ষে একটি লাইব্রেরি/প্রোগ্রাম ইনস্টল করা উচিত। আপনি যে ড্রাইভারটি ব্যবহার করতে পারেন তা আপনি বেছে নিতে পারেন, আপনি আপনার প্ল্যাটফর্ম ইত্যাদি দ্বারা সমর্থিত যতগুলি বা যতটা ইচ্ছা ইনস্টল করতে পারেন।
es_un: Qiskit Nature admite el uso de diferentes bibliotecas y programas clásicos, a través de controladores (drivers), que calculan información molecular, como integrales de uno y dos cuerpos. Esto es necesario como entrada del problema a los algoritmos que calculan las propiedades de las moléculas, como la energía del estado fundamental, por lo que se debe instalar al menos una biblioteca/programa de este tipo. Como puedes elegir qué controlador utilizar, puedes instalar tantos o tan pocos como desees, que sean compatibles con tu plataforma, etc.
fr_fr: Qiskit Nature prend en charge l'utilisation de différentes bibliothèques et programmes classiques, par l'intermédiaire de pilotes, qui calculent des informations moléculaires, comme les intégrales d'un et deux corps. Ceci est nécessaire comme une entrée de problème pour les algorithmes qui calculent les propriétés des molécules, comme l'énergie de l'état fondamental, donc au moins une telle bibliothèque/programme devrait être installée. Comme vous pouvez choisir le pilote que vous utilisez, vous pouvez en installer autant que vous le souhaitez, qui sont supportés par votre plate-forme, etc.
ja_jp: Qiskit Natureは、1体、2体積分などの分子情報を計算するドライバーを介して、異なる古典ライブラリやプログラムの使用をサポートしています。 これは分子の性質、例えば基底状態のエネルギーを計算するアルゴリズムへの問題入力として必要となります。 ですので、少なくとも1つのライブラリ/プログラムをインストールする必要があります。 どのドライバーを使用するか選択できるので、できるだけ多くインストールすることも、必要な数だけインストールすることも、プラットフォームなどによってサポートされている数だけインストールすることもできます。
ko_kr: Qiskit Nature는 일체 (one body) 및 이체 (two body) 적분과 같은 분자 정보를 계산하는 드라이버를 통해 다양한 고전적인 라이브러리와 프로그램의 사용을 지원한다. 이는 바닥 상태 에너지와 같은 분자의 특성을 계산하는 알고리즘의 입력에 필요하므로, 적어도 하나 이상의 라이브러리/프로그램이 설치되어야 한다. 주어진 플랫폼이 지원하는 한, 사용할 드라이버를 원하는 만큼 많게 또는 적게 선택하여 설치할 수 있다.
pt_un: O Qiskit Nature suporta o uso de diferentes bibliotecas e programas clássicos, por meio de drivers, que calculam informação molecular, como integrais de um e dois corpos. Isso é necessário como entrada do problema para algoritmos que calculam propriedades de moléculas, como a energia do estado fundamental, logo pelo menos uma biblioteca/programa deve ser instalada. Como você pode escolher qual driver utilizar, você pode instalar quantos desejar, que sejam suportados por sua plataforma etc.
ru_ru: Qiskit Nature поддерживает использование различных классических библиотек и программ с помощью драйверов, вычисляющих молекулярную информацию, например, одно- или двух- частичные интегралы. Это необходимо в качестве ввода в алгоритм задачи, вычисляющих свойства молекул, таких как энергии основного состояния, поэтому по крайней мере одна такая библиотека/программа должна быть установлена. Также вы можете выбрать, какой драйвер вы используете и установить столько, сколько нужно, поддерживающихся вашей платформой и т.д.
ta_in: ஒன்று மற்றும் இரண்டு உடல் ஒருங்கிணைப்புகள் போன்ற மூலக்கூறு தகவல்களைக் கணக்கிடும் இயக்கிகள் வழியாக Qiskit நேச்சர் வெவ்வேறு கிளாசிக்கல் நூலகங்கள் மற்றும் நிரல்களைப் பயன்படுத்துவதை ஆதரிக்கிறது. தரை நிலை ஆற்றல் போன்ற மூலக்கூறுகளின் பண்புகளை கணக்கிடும் வழிமுறைகளுக்கு சிக்கல் உள்ளீடாக இது தேவைப்படுகிறது, எனவே குறைந்தபட்சம் இதுபோன்ற ஒரு நூலகம் / நிரல் நிறுவப்பட வேண்டும். நீங்கள் எந்த இயக்கியைப் பயன்படுத்துகிறீர்கள் என்பதைத் தேர்வுசெய்யும்போது, ​​உங்கள் இயங்குதளத்தால் ஆதரிக்கப்படும் பலவற்றை அல்லது நீங்கள் விரும்பும் சிலவற்றை நிறுவலாம்.
tr_tr: Qiskit Nature, bir ve iki gövde integralleri gibi moleküler bilgileri hesaplayan sürücüler aracılığıyla farklı klasik kitaplıkların ve programların kullanımını destekler. Bu, temel durum enerjisi gibi moleküllerin özelliklerini hesaplayan algoritmalar için problem girdisi olarak gereklidir, bu nedenle bu tür en az bir kitaplık/program kurulmalıdır. Hangi sürücüyü kullanacağınızı seçebildiğiniz gibi, platformunuz tarafından desteklenen vb. istediğiniz kadar çok veya az yükleyebilirsiniz.

source: See `Driver installation <./apidocs/qiskit_nature.second_q.drivers.html>`__ which lists each driver and how to install the dependent library/program that it requires.
es_un: Consulta la `Instalación del controlador <./apidocs/qiskit_nature.second_q.drivers.html>`__ que enumera cada controlador y cómo instalar la biblioteca/programa dependiente que requiere.
ja_jp: 各ドライバーのリストや必要な依存ライブラリ/プログラムのインストール方法については、`ドライバーのインストール <./apidocs/qiskit_nature.second_q.drivers.html>`__ を参照してください。

source: Additionally, you may find the following optional dependencies useful:
es_un: Además, puedes encontrar útiles las siguientes dependencias opcionales:
ja_jp: さらに、以下のオプションの依存関係が役立つ場合があります。

source: `sparse <https://github.com/pydata/sparse/>`_, a library for sparse multi-dimensional arrays. When installed, Qiskit Nature can leverage this to reduce the memory requirements of your calculations.
es_un: `sparse <https://github.com/pydata/sparse/>`_, una biblioteca para arreglos multidimensionales dispersos. Cuando está instalada, Qiskit Nature puede aprovechar esto para reducir los requerimientos de memoria de sus cálculos.
ja_jp: `sparse <https://github.com/pydata/sparse/>`_ スパース多次元配列のライブラリ。インストールすると、Qiskit Natureがこれを利用して計算のメモリ要件を減らすことができます。

source: `opt_einsum <https://github.com/dgasmith/opt_einsum>`_, a tensor contraction order optimizer for ``np.einsum``.
es_un: `opt_einsum <https://github.com/dgasmith/opt_einsum>`_, un optimizador de orden de contracción de tensor para ``np.einsum``.
ja_jp: `opt_einsum <https://github.com/dgasmith/opt_einsum>`_ ``np.einsum``のためのテンソルの縮約順序オプティマイザー

source: Ready to get going?...
bn_bn: আরো এগোতে প্রস্তুত?...
es_un: ¿Listo para empezar?...
fr_fr: Prêt à y aller ?...
ja_jp: 準備はいいですか？...
ko_kr: 시작할 준비가 다 되었다면...
pt_un: Pronto para começar?...
ru_ru: Готовы идти дальше?...
ta_in: செல்ல தயாரா?...
tr_tr: Başlamaya hazır mısınız?...
vi_vn: Bạn đã sẵn sàng khởi hành?...

source: Now that Qiskit Nature is installed, let's try a chemistry application experiment using the :class:`~qiskit.algorithms.minimum_eigensolvers.VQE` (Variational Quantum Eigensolver) algorithm to compute the ground-state (minimum) energy of a molecule.
es_un: Ahora que Qiskit Nature está instalado, probemos un experimento de aplicación de química usando el algoritmo :class:`~qiskit.algorithms.minimum_eigensolvers.VQE` (Variational Quantum Eigensolver, Solucionador Propio Variacional Cuántico) para calcular la energía del estado fundamental (mínimo) de una molécula.

source: The program above computes the ground state energy of molecular Hydrogen, H<sub>2</sub>, where the two atoms are configured to be at a distance of 0.735 angstroms. The molecular input specification is processed by the PySCF driver. This driver produces an :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem` which gathers all the problem information required by Qiskit Nature. The second-quantized operators contained in that problem can be mapped to qubit operators with a :class:`~qiskit_nature.second_q.mappers.QubitMapper`. Here, we chose the :class:`~qiskit_nature.second_q.mappers.ParityMapper` which automatically removes 2 qubits due to inherit symmetries when the `num_particles` are provided to it; a reduction in complexity that is particularly advantageous for NISQ computers.
es_un: El programa anterior calcula la energía del estado fundamental del Hidrógeno molecular, H<sub>2</sub>, donde los dos átomos están configurados para estar a una distancia de 0.735 angstroms. La especificación de entrada molecular es procesada por el controlador PySCF. Este controlador produce un :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem` que recopila toda la información del problema requerida por Qiskit Nature. Los operadores de segunda cuantización contenidos en ese problema se pueden mapear a operadores de qubit con un :class:`~qiskit_nature.second_q.mappers.QubitMapper`. Aquí, elegimos :class:`~qiskit_nature.second_q.mappers.ParityMapper` que elimina automáticamente 2 qubits debido a las simetrías heredadas cuando se le proporcionan `num_particles`; una reducción en la complejidad que es particularmente ventajosa para las computadoras NISQ.
ja_jp: 上記プログラムは、2つの原子が0.735オングストロームの距離で構成されている水素分子 H<sub>2</sub> の基底エネルギーを計算します。分子の入力仕様はPySCFドライバーにより処理されます。ドライバーはQiskit Natureが要求するすべての問題情報を集めた :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem` クラスを生成します。その問題に含まれた第２量子化オペレーターは、 :class:`~qiskit_nature.second_q.mappers.QubitMapper` クラスと量子ビット・オペレーターにマップされます。ここで、 `num_particles` が与えられたとき対称性を継承するため２量子ビットを自動的に除去する :class:`~qiskit_nature.second_q.mappers.ParityMapper` クラスを選択します。NISQコンピューターでは特に有用な複雑さの軽減を実現しています。

source: For actually finding the ground state solution, the Variational Quantum Eigensolver (:class:`~qiskit.algorithms.minimum_eigensolvers.VQE`) algorithm is used. Its main three components are the estimator primitive (:class:`~qiskit.primitives.Estimator`), wavefunction ansatz (:class:`~qiskit_nature.second_q.circuit.library.UCCSD`), and optimizer (:class:`~qiskit.algorithms.optimizers.L_BFGS_B`). The :class:`~qiskit_nature.second_q.circuit.library.UCCSD` component is the only one provided directly by Qiskit Nature and it is usually paired with the :class:`~qiskit_nature.second_q.circuit.library.HartreeFock` initial state and an all-zero initial point for the optimizer.
es_un: Para encontrar realmente la solución del estado fundamental, se utiliza el algoritmo Solucionador Propio Variacional Cuántico (Variational Quantum Eigensolver, :class:`~qiskit.algorithms.minimum_eigensolvers.VQE`). Sus tres componentes principales son la primitiva estimator (:class:`~qiskit.primitives.Estimator`), el ansatz de función de onda (:class:`~qiskit_nature.second_q.circuit.library.UCCSD`) y el optimizador (:class:`~qiskit.algorithms.optimizers.L_BFGS_B`). El componente :class:`~qiskit_nature.second_q.circuit.library.UCCSD` es el único proporcionado directamente por Qiskit Nature y generalmente se combina con el estado inicial de :class:`~qiskit_nature.second_q.circuit.library.HartreeFock` y un punto inicial todo en cero para el optimizador.

source: The entire problem is then solved using a :class:`~qiskit_nature.second_q.algorithms.GroundStateEigensolver` which wraps both, the :class:`~qiskit_nature.second_q.mappers.ParityMapper` and :class:`~qiskit.algorithms.minimum_eigensolvers.VQE`. Since an :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem` is provided to it (which was the output of the :class:`~qiskit_nature.second_q.drivers.PySCFDriver`) it also returns an :class:`~qiskit_nature.second_q.problems.ElectronicStructureResult`.
es_un: Luego, todo el problema se resuelve utilizando un :class:`~qiskit_nature.second_q.algorithms.GroundStateEigensolver` que encapsula tanto el :class:`~qiskit_nature.second_q.mappers.ParityMapper` como el :class:`~qiskit.algorithms.minimum_eigensolvers.VQE`. Dado que se le proporciona un :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem` (que fue el resultado del :class:`~qiskit_nature.second_q.drivers.PySCFDriver`), también devuelve un :class:`~qiskit_nature.second_q.problems.ElectronicStructureResult`.

source: Qiskit Nature depends on Qiskit, which has its own `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ detailing the installation options and its supported environments/platforms. You should refer to that first. Then the information here can be followed which focuses on the additional installation specific to Qiskit Nature.
ja_jp: Qiskit Natureは、インストール・オプションとそのサポート環境/プラットフォームを詳述した「`Qiskit はじめに <https://qiskit.org/documentation/getting_started.html>`__ 」にて説明されたQiskitに依存しています。 まずそれを参照してください。次に、ここで説明する情報に従って、Qiskit Natureに固有の追加インストールをしましょう。

source: The simplest way to get started is to first follow the `getting started 'Start locally' guide for Qiskit <https://qiskit.org/documentation/getting_started.html>`__
ja_jp: 最も簡単な方法は「 `Qiskit はじめに <https://qiskit.org/documentation/getting_started.html>`__ 」の「ローカルで始める」のガイドを参照して開始することです。

source: PySCF via `qiskit-nature-pyscf <https://qiskit-community.github.io/qiskit-nature-pyscf/>`_
ja_jp: PySCF、`qiskit-nature-pyscf <https://qiskit-community.github.io/qiskit-nature-pyscf/>`_ 経由

source: If you are interested in using Psi4, we are actively looking for help to get started on a similar integration in `qiskit-nature-psi4 <https://github.com/qiskit-community/qiskit-nature-psi4>`_
ja_jp: Psi4 の利用に興味がある場合は、 `qiskit-nature-psi4 <https://github.com/qiskit-community/qiskit-nature-psi4>`_ での同様の統合を開始するのを手伝っていただける方を積極的に探しています。

source: Now that Qiskit Nature is installed, let's try a chemistry application experiment using the :class:`~qiskit_algorithms.VQE` (Variational Quantum Eigensolver) algorithm to compute the ground-state (minimum) energy of a molecule.
ja_jp: Qiskit Natureがインストールされたので、分子の基底状態 (最小) エネルギーを計算するための :class:`~qiskit_algorithms.VQE` (Variational Quantum Eigensolver) アルゴリズムを使用して化学アプリケーションの実験を試してみましょう。

source: For actually finding the ground state solution, the Variational Quantum Eigensolver (:class:`~qiskit_algorithms.VQE`) algorithm is used. Its main three components are the estimator primitive (:class:`~qiskit.primitives.Estimator`), wavefunction ansatz (:class:`~qiskit_nature.second_q.circuit.library.UCCSD`), and optimizer (:class:`~qiskit_algorithms.optimizers.L_BFGS_B`). The :class:`~qiskit_nature.second_q.circuit.library.UCCSD` component is the only one provided directly by Qiskit Nature and it is usually paired with the :class:`~qiskit_nature.second_q.circuit.library.HartreeFock` initial state and an all-zero initial point for the optimizer.
ja_jp: 基底状態の解を実際に見つけるために、Variational Quantum Eigensolver (:class:`~qiskit_algorithms.VQE`) アルゴリズムが使用されます。主な 3 つの構成要素は、estimator primitive (:class:`~qiskit.primitives.Estimator`)、波動関数ansatz (:class:`~qiskit_nature.second_q.circuit.library.UCCSD`)、およびオプティマイザー (:class:`~qiskit_algorithms.optimizers.L_BFGS_B`) です。 :class:`~qiskit_nature.second_q.circuit.library.UCCSD` コンポーネントは、直接 Qiskit Natureによって提供される唯一のコンポーネントであり、通常は :class:`~qiskit_nature.second_q.circuit.library.HartreeFock` の初期状態と最適化プログラムのすべてのゼロの初期点と対になっています。

source: The entire problem is then solved using a :class:`~qiskit_nature.second_q.algorithms.GroundStateEigensolver` which wraps both, the :class:`~qiskit_nature.second_q.mappers.ParityMapper` and :class:`~qiskit_algorithms.VQE`. Since an :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem` is provided to it (which was the output of the :class:`~qiskit_nature.second_q.drivers.PySCFDriver`) it also returns an :class:`~qiskit_nature.second_q.problems.ElectronicStructureResult`.
ja_jp: 問題全体は、:class:`~qiskit_nature.second_q.mappers.ParityMapper` と :class:`~qiskit_algorithms.VQE`の両方をラップする :class:`~qiskit_nature.second_q.algorithms.GroundStateEigensolver` で解決されます。 :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem` が提供されているので( :class:`~qiskit_nature.second_q.drivers.PySCFDriver`の出力)、 :class:`~qiskit_nature.second_q.problems.ElectronicStructureResult` も返します。

source: The simplest way to get started is to follow the getting started 'Start locally' for Qiskit here `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
bn_bn: সহজ করে শুরু করার উপায় হল 'Start locally' থেকে শুরু করুন, `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
fr_fr: La façon la plus simple de commencer est de suivre le début de 'Démarrer localement' pour Qiskit ici `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
ko_kr: 시작할 수 있는 가장 간단한 방법은 Qiskit 에서 '로컬로 시작하기' `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ 를 따르는 것이다.
ta_in: Qiskit தொடங்குவதற்கான எளிய வழி இங்கே 'Start locally' என்பதைப் பின்பற்றுவது `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__

source: See `Driver installation <./apidocs/qiskit_nature.drivers.second_quantization.html#drivers>`__ which lists each driver and how to install the dependent library/program that it requires.
bn_bn: `Driver installation <./apidocs/qiskit_nature.drivers.second_quantization.html#drivers>`__ এ দেখুন যা প্রতিটি ড্রাইভার তালিকাভুক্ত করে এবং কিভাবে নির্ভরশীল লাইব্রেরি/প্রোগ্রাম ইনস্টল করতে হয়।
ko_kr: `드라이버 설치 <./apidocs/qiskit_nature.drivers.second_quantization.html#drivers>`__ 에서 드라이버 목록과 의존성 라이브러리/프로그램 설치 방법을 확인하라.
ta_in: `Driver installation <./apidocs/qiskit_nature.drivers.second_quantization.html#drivers>`__ இது ஒவ்வொரு டிரைவரையும் பட்டியலிடுகிறது மற்றும் அது தேவைப்படும் சார்பு நூலகம்/நிரலை எவ்வாறு நிறுவுவதை பார்க்கவும்.
