Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/index.po
Languages: es_un, ja_jp

source: Overview
es_un: Descripción general
ja_jp: 概要

source: Getting Started
es_un: Primeros Pasos
ja_jp: はじめに

source: Migration Guides
es_un: Guías de Migración
ja_jp: 移行ガイド

source: Tutorials
es_un: Tutoriales
ja_jp: チュートリアル

source: How-Tos
es_un: Guías Prácticas
ja_jp: 使い方

source: API Reference
es_un: Referencia de la API
ja_jp: API リファレンス

source: Release Notes
es_un: Notas de la Versión
ja_jp: リリースノート

source: Qiskit Nature overview
es_un: Descripción general de Qiskit Nature
ja_jp: Qiskit Nature の概要

source: **Qiskit Nature** is an open-source framework which supports solving quantum mechanical natural science problems using quantum computing algorithms. This includes finding ground and excited states of electronic and vibrational structure problems, measuring the dipole moments of molecular systems, solving the Ising and Fermi-Hubbard models on lattices, and much more.
es_un: **Qiskit Nature** es un framework de código abierto que soporta la resolución de problemas de ciencias naturales de la mecánica cuántica mediante algoritmos de computación cuántica. Esto incluye encontrar estados fundamentales y excitados de problemas de estructuras electrónicas y vibracionales, medir los momentos dipolares de sistemas moleculares, resolver los modelos de Ising y Fermi-Hubbard en retículas, y mucho más.
ja_jp: **Qiskit Nature** は、量子コンピューティングアルゴリズムを使用して量子力学的自然科学の問題を解決することをサポートするオープンソースフレームワークです。 これには、電子および振動構造の問題の基底状態と励起状態の検出、分子システムの双極子モーメントの測定、格子上のイジングモデルとFermi-Hubbardモデルの解決などが含まれます。

source: Qiskit Nature Design
es_un: Diseño de Qiskit Nature
ja_jp: Qiskit Nature のデザイン

source: The code comprises various modules revolving around:
es_un: El código comprende varios módulos que giran en torno a:
ja_jp: このコードは、以下を中心とした様々なモジュールで構成されています：

source: data loading from chemistry drivers or file formats
es_un: carga de datos desde controladores de química o formatos de archivo
ja_jp: 化学ドライバーやファイルフォーマットからのデータロード

source: second-quantized operator construction and manipulation
es_un: construcción y manipulación del operador de segunda cuantización
ja_jp: 第二量子化演算子の構築と操作

source: translating from the second-quantized to the qubit space
es_un: traduciendo la segunda cuantización al espacio de qubits
ja_jp: 第二量子化空間から量子ビット空間への変換

source: a quantum circuit library of natural science targeted ansatze
es_un: una biblioteca de circuitos cuánticos de ciencias naturales orientada a ansatze
ja_jp: 自然科学分野をターゲットとした量子回路ライブラリー

source: natural science specific algorithms and utilities to make the use of Qiskit Terra's algorithms easier
es_un: algoritmos y utilidades específicos de ciencias naturales para facilitar el uso de los algoritmos de Qiskit Terra

source: and much more
es_un: y mucho más
ja_jp: そしてさらに

source: Citation
es_un: Cita
ja_jp: 引用

source: If you use Qiskit Nature, please cite the following references:
es_un: Si utilizas Qiskit Nature, cita las siguientes referencias:
ja_jp: Qiskit Natureを使用する場合は、以下のリファレンスを参照してください。

source: Qiskit, as per the provided `BibTeX file <https://github.com/Qiskit/qiskit/blob/master/Qiskit.bib>`_.
es_un: Qiskit, según el `archivo BibTeX <https://github.com/Qiskit/qiskit/blob/master/Qiskit.bib>`_ proporcionado.
ja_jp: Qiskit は、提供される `BibTeX file <https://github.com/Qiskit/qiskit/blob/master/Qiskit.bib>`_ に従って。

source: Qiskit Nature, as per https://doi.org/10.5281/zenodo.7828767
es_un: Qiskit Nature, según https://doi.org/10.5281/zenodo.7828767
ja_jp: Qiskit Nature、https://doi.org/10.5281/zenodo.7828767 について

source: Next Steps
es_un: Siguientes Pasos
ja_jp: 次のステップ

source: `Getting started <getting_started.html>`_
es_un: `Primeros pasos <getting_started.html>`_
ja_jp: `はじめに <getting_started.html>`_

source: `Migration Guides <migration/index.html>`_
es_un: `Guías de Migración <migration/index.html>`_
ja_jp: `移行ガイド <migration/index.html>`_

source: `Tutorials <tutorials/index.html>`_
es_un: `Tutoriales <tutorials/index.html>`_
ja_jp: `チュートリアル <tutorials/index.html>`_

source: `How-Tos <howtos/index.html>`_
es_un: `Guía Práctica <howtos/index.html>`_
ja_jp: `使い方 <howtos/index.html>`_
