Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials.po
Languages: tr_tr

source: To have a different number of modals per mode:
tr_tr: Her durum başına farklı sayıda modellere sahip olmak için:

source: Now that the Hamiltonian is ready, it can be used in a quantum algorithm to find information about the vibrational structure of the corresponding molecule. Check out our tutorials on Ground State Calculation and Excited States Calculation to learn more about how to do that in Qiskit Nature!
tr_tr: Hamiltonyen artık hazır olduğuna göre, karşılık gelen molekülün titreşim yapısı hakkında bilgi bulmak için bir kuantum algoritmasında kullanılabilir. Qiskit Nature'da bunun nasıl yapılacağı hakkında daha fazla bilgi edinmek için Ground State Hesaplaması ve Uyarılmış Durumlar Hesaplaması hakkındaki eğitici derslerimize göz atın!

source: Ground state solvers
tr_tr: Taban enerji seviyesi çözücüleri

source: In this tutorial we are going to discuss the ground state calculation interface of Qiskit Chemistry. The goal is to compute the ground state of a molecular Hamiltonian. This Hamiltonian can be electronic or vibrational. To know more about the preparation of the Hamiltonian, check out the Electronic structure and Vibrational structure tutorials.
tr_tr: Bu öğretici derste Qiskit Kimya'nın temel durum hesaplama arayüzünü tartışacağız. Amaç, moleküler bir Hamiltoniyenin temel durumunu hesaplamaktır. Bu Hamiltonyen elektronik veya titreşimli olabilir. Hamiltonian'ın hazırlanması hakkında daha fazla bilgi edinmek için elektronik yapı ve titreşimsel yapı öğretici derslerini inceleyin.

source: The first step is to define the molecular system. In the following we ask for the electronic part of a hydrogen molecule.
tr_tr: İlk adım moleküler sistemi tanımlamaktır. Aşağıdakilerde bir hidrojen molekülünün elektronik kısmını istiyoruz.

source: The Solver
tr_tr: Çözücü

source: Then we need to define a solver. The solver is the algorithm through which the ground state is computed.
tr_tr: O zaman bir çözücü tanımlamamız gerekiyor. Çözücü, temel durumun hesaplandığı algoritmadır.

source: Let’s first start with a purely classical example: the NumPy minimum eigensolver. This algorithm exactly diagonalizes the Hamiltonian. Although it scales badly, it can be used on small systems to check the results of the quantum algorithms.
tr_tr: Önce tamamen klasik bir örnekle başlayalım: NumPy minimum özçözücü. Bu algoritma Hamiltoniyeni tam olarak köşegenleştirir. Kötü ölçeklenmesine rağmen, kuantum algoritmalarının sonuçlarını kontrol etmek için küçük sistemlerde kullanılabilir.

source: To find the ground state we coul also use the Variational Quantum Eigensolver (VQE) algorithm. The VQE algorithms works by exchanging information between a classical and a quantum computer as depicted in the following figure.
tr_tr: Temel enerji durumunu bulmak için Variational Quantum Eigensolver (VQE) algoritmasını da kullanabiliriz. VQE algoritmaları, aşağıdaki şekilde gösterildiği gibi klasik ve kuantum bilgisayar arasında bilgi alışverişi yaparak çalışır.

source: Let’s initialize a VQE solver.
tr_tr: Bir VQE çözümleyiciyi başlatalım.

source: To define the VQE solver one needs two essential elements:
tr_tr: VQE çözümleyici tanımlamak için iki öğeye ihtiyacımız var:

source: A variational form: here we use the Unitary Coupled Cluster (UCC) ansatz (see for instance [Physical Review A 98.2 (2018): 022322]). Since it is a chemistry standard, a factory is already available allowing a fast initialization of a VQE with UCC. The default is to use all single and double excitations. However, the excitation type (S, D, SD) as well as other parameters can be selected.
tr_tr: Değişik bir şekil: burada ansatz (UCC) tekil çiftleştirilmiş kümeyi kullanırız, (örnek olarak [Physical Review A 98.2 (2018): 022322] bakınız). Kimya alakalı bir terim olduğungan, UCC ile bir VQE hızlıca başlamasına izin veren bir fabrika mevcuttur. Varsayılan olan ise tek veya çift az uyarmaların tamamını kullanılmasıdır. Halbuki (S, D, SD) uyarılma türü de diğer parametreler gibi seçilebilir.

source: An initial state: the initial state of the qubits. In the factory used above, the qubits are initialized in the Hartree-Fock (see the electronic structure tutorial) initial state (the qubits corresponding to occupied MOs are :math:`|1\rangle` and those corresponding to virtual MOs are :math:`|0\rangle`.
tr_tr: Başlangıç hali: Kübitlerin başlangınç hali. Yukarda kullanılan fabrikasında, kübitler Hartree-Fock başlangıç halinde başlatılır (elektronik yapı materyale başvurunuz), (Dolu MO'lara ait kübitler :math:`|1\rangle` , virtual MO'lara ait olan ise :math:`|0\rangle` olandır).

source: The backend: this is the quantum machine on which the right part of the figure above will be performed. Here we ask for the perfect quantum emulator (``statevector_simulator``).
tr_tr: Backend: Yukarıdaki resmin sağ kısmının gerçekleştirileceği kuantum makinesidir. Burada mükemmel (``statevector_simulator``) kuantum emulatörü istiyoruz.

source: One could also use any available ansatz / initial state or even define one’s own. For instance,
tr_tr: Kişi ayrıca mevcut herhangi bir ansatz / başlangıç ​​durumunu kullanabilir veya hatta kendi durumunu tanımlayabilir. Örneğin,

source: The calculation and results
tr_tr: Hesaplama ve sonuçlar

source: We are now ready to run the calculation.
tr_tr: Artık hesaplamayı çalıştırmaya hazırız.

source: We can compare the VQE results to the NumPy exact solver and see that they match.
tr_tr: VQE sonuçlarını NumPy tam çözücüyle karşılaştırabilir ve eşleştiğini görebiliriz.

source: Using a filter function
tr_tr: Bir filtre işlevi kullanma

source: Sometimes the true ground state of the Hamiltonian is not of interest because it lies in a different symmetry sector of the Hilbert space. In this case the NumPy eigensolver can take a filter function to return only the eigenstates with for example the correct number of particles. This is of particular importance in the case of vibrational structure calculations where the true ground state of the Hamiltonian is the vacuum state. A default filter function to check the number of particles is implemented in the different transformations and can be used as
tr_tr: Bazen Hamiltonyen'in gerçek temel durumu ilgi çekici değildir çünkü Hilbert uzayının farklı bir simetri sektöründe yer alır. Bu durumda NumPy özçözücü, örneğin doğru sayıda parçacıkla yalnızca özdurumları döndürmek için bir filtre işlevi alabilir. Hamiltoniyen'in gerçek temel durumunun vakum durumu olduğu titreşim yapısı hesaplamaları durumunda bu özellikle önemlidir. Parçacık sayısını kontrol etmek için varsayılan bir filtre işlevi, farklı dönüşümlerde uygulanır ve şu şekilde kullanılabilir

source: Excited states solvers
tr_tr: Uyarılmış enerji durumu çözücüleri

source: In this tutorial we are going to discuss the excited states calculation interface of Qiskit Chemistry. The goal is to compute the excited states of a molecular Hamiltonian. This Hamiltonian can be electronic or vibrational. To know more about the preparation of the Hamiltonian, check out the Electronic structure and Vibrational structure tutorials.
tr_tr: Bu eğitici derste, Qiskit Kimya'nın uyarılmış durum hesaplama arayüzünü tartışacağız. Amaç, moleküler bir Hamiltoniyenin uyarılmış durumlarını hesaplamaktır. Bu Hamiltonyen elektronik veya titreşimli olabilir. Hamiltonyenin hazırlanması hakkında daha fazla bilgi edinmek için elektronik yapı ve titreşimsel yapı eğitici derslerini inceleyin.

source: Let’s first start with a purely classical example: the NumPy eigensolver. This algorithm exactly diagonalizes the Hamiltonian. Although it scales badly, it can be used on small systems to check the results of the quantum algorithms. Here, we are only interested to look at eigenstates with a given number of particle. To compute only those states a filter function can be passed to the NumPy eigensolver. A default filter function is already implemented in Qiskit and can be used in this way:
tr_tr: Önce tamamen klasik bir örnekle başlayalım: NumPy özçözücü. Bu algoritma Hamiltoniyeni tam olarak köşegenleştirir. Kötü ölçeklenmesine rağmen, kuantum algoritmalarının sonuçlarını kontrol etmek için küçük sistemlerde kullanılabilir. Burada sadece belirli sayıda parçacık içeren özdurumlara bakmakla ilgileniyoruz. Yalnızca bu durumları hesaplamak için NumPy eigensolver'a bir filtre işlevi iletilebilir. Qiskit'te zaten bir varsayılan filtre işlevi uygulanmıştır ve şu şekilde kullanılabilir:

source: The excitation energies can also be accessed with the qEOM algorithm [arXiv preprint arXiv:1910.12890 (2019)]. The EOM method finds the excitation energies (differences in energy between the ground state and all :math:`n`\ th excited states) by solving the following pseudo-eigenvalue problem.
tr_tr: Uyarma enerjilerine qEOM algoritmasıyla da erişilebilir [arXiv preprint arXiv:1910.12890 (2019)]. EOM yöntemi, aşağıdaki sözde özdeğer problemini çözerek uyarma enerjilerini (temel durum ile tüm uyarılmış durumlar arasındaki enerji farkları all :math:`n`\ th excited states ) tarafından bulur.

source: Although the previous equation can be solved classically, each matrix element must be measured on the quantum computer with the corresponding ground state. To use the qEOM as a solver in Qiskit, we have to define a ground state calculation first, providing to the algorithm information on how to find the ground state. With this the qEOM solver can be initialized:
tr_tr: Önceki denklem klasik olarak çözülebilse de, her matris elemanı, karşılık gelen temel durum ile kuantum bilgisayarda ölçülmelidir. qEOM'u Qiskit'te bir çözücü olarak kullanmak için, önce algoritmaya temel durumun nasıl bulunacağına dair bilgi sağlayan bir temel durum hesaplaması tanımlamamız gerekir. Bununla qEOM çözücü başlatılabilir:

source: The results are computed and printed
tr_tr: Sonuçlar hesaplanır ve yazdırılır

source: One can see from these results that one state is missing from the NumPy results. The reason for this is because the spin is also used as a filter and only singlet states are shown. In the following we use a custom filter function to check consistently our results and only filter out states with incorrect number of particle (in this case the number of particle is 2).
tr_tr: Bu sonuçlardan NumPy sonuçlarında bir durumun eksik olduğu görülebilir. Bunun nedeni spinin de filtre olarak kullanılması ve sadece singlet durumlarının gösterilmesidir. Aşağıda, sonuçlarımızı tutarlı bir şekilde kontrol etmek için özel bir filtre işlevi kullanıyoruz ve yalnızca yanlış sayıda parçacık içeren durumları filtreliyoruz (bu durumda parçacık sayısı 2'dir).

source: Sampling the potential energy surface
tr_tr: Potansiyel enerji yüzeyinin örneklenmesi

source: This interactive notebook demonstrates how to utilize the Potential Energy Surface (PES) samplers algorithm of qiskit chemistry to generate the dissociation profile of a molecule. We use the Born-Oppenhemier Potential Energy Surface (BOPES)and demonstrate how to exploit bootstrapping and extrapolation to reduce the total number of function evaluations in computing the PES using the Variational Quantum Eigensolver (VQE).
tr_tr: Bu etkileşimli defter, bir molekülün ayrışma profilini oluşturmak için qiskit kimyasının Potansiyel Enerji Yüzeyi (PES) örnekleyici algoritmasının nasıl kullanılacağını gösterir. Biz Born-Oppenhemier Potansiyel Enerji Yüzeyini (BOPES) kullanıyoruz ve Variational Quantum Eigensolver (VQE) kullanarak PES'in hesaplanmasında toplam fonksiyon değerlendirme sayısını azaltmak için önyükleme ve ekstrapolasyondan nasıl yararlanılacağını gösteriyoruz.

source: Here, we use the H2 molecule as a model system for testing.
tr_tr: Burada, test için bir model sistem olarak H2 Hidrojen molekülünü kullanıyoruz.

source: Make a perturbation to the molecule along the absolute_stretching dof
tr_tr: Absolute_streching dof boyunca molekülü pertübe edin

source: Calculate bond dissociation profile using BOPES Sampler
tr_tr: BOPES örneklemesini kullanarak bağ ayrışma profilini hesaplayın

source: Here, we pass the molecular information and the VQE to a built-in type called the BOPES Sampler. The BOPES Sampler allows the computation of the potential energy surface for a specified set of degrees of freedom/points of interest.
tr_tr: Burada moleküler bilgiyi ve VQE'yi BOPES Sampler adı verilen yerleşik bir türe aktarıyoruz. BOPES Sampler, belirli bir serbestlik derecesi/ilgi noktaları kümesi için potansiyel enerji yüzeyinin hesaplanmasına izin verir.

source: First we compare no bootstrapping vs bootstrapping
tr_tr: İlk önyükleme olmayan ile önyükleme olanı kıyaslıyoruz

source: Bootstrapping the BOPES sampler involves utilizing the optimal variational parameters for a given degree of freedom, say r (ex. interatomic distance) as the initial point for VQE at a later degree of freedom, say r + :math:`\epsilon`. By default, if boostrapping is set to True, all previous optimal parameters are used as initial points for the next runs.
tr_tr: BOPES örnekleyicisinin önyüklenmesi, belirli bir serbestlik derecesi için optimal varyasyon parametrelerinin kullanılmasını içerir, örneğin r (ör. atomlar arası mesafe), daha sonraki bir serbestlik derecesinde VQE için başlangıç ​​noktası olarak, diyelim ki r + :math:`\epsilon`. Varsayılan olarak, yükseltme "doğru" olarak ayarlanırsa, önceki tüm optimal parametreler sonraki çalıştırmalar için başlangıç ​​noktaları olarak kullanılır.

source: Compare to classical eigensolver
tr_tr: Klasik eigensolver ile karşılaştırın

source: Plot results
tr_tr: Taslak sonuçları

source: Compare number of evaluations
tr_tr: Değerlendirme sayısını karşılaştırın

source: Extrapolation
tr_tr: Sonuçların genişletilmesi

source: Here, an extrapolator added that will try to fit each (param,point) set to some specified function and suggest an initial parameter set for the next point (degree of freedom).
tr_tr: Burada, her (param,point) setini belirli bir fonksiyona sığdırmaya çalışacak ve bir sonraki nokta (serbestlik derecesi) için bir başlangıç ​​parametre seti önerecek bir ekstrapolatör eklendi.

source: Extrapolator is based on an external extrapolator that sets the ‘window’, that is, the number of previous points to use for extrapolation, while the internal extrapolator proceeds with the actual extrapolation.
tr_tr: Ekstrapolatör, ‘window’, yani ekstrapolasyon için kullanılacak önceki noktaların sayısını ayarlayan harici bir ekstrapolatöre dayanırken, dahili ekstrapolatör gerçek ekstrapolasyonla ilerler.

source: In practice, the user sets the window by specifying an integer value to num_bootstrap - which is also the number of previous points to use for bootstrapping. Additionally, the external extrapolator defines the space within how to extrapolate - here PCA, clustering and the standard window approach.
tr_tr: Pratikte, kullanıcı, önyükleme için kullanılacak önceki noktaların sayısı olan num_bootstrap için bir tamsayı değeri belirterek pencereyi ayarlar. Ek olarak, harici ekstrapolatör, uzayı nasıl tahmin edileceğini tanımlar - burada PCA, kümeleme ve standart pencere yaklaşımı.

source: In practice, if no extrapolator is defined and bootstrapping is True, then all previous points will be bootstrapped. If an extrapolator list is defined and no points are specified for bootstrapping, then the extrapolation will be done based on all previous points.
tr_tr: Pratikte, eğer herhangi bir ekstrapolatör tanımlanmadıysa ve önyükleme doğru ise, önceki tüm noktalar önyüklenir. Bir ekstrapolatör listesi tanımlanmışsa ve önyükleme için hiçbir nokta belirtilmemişse, o zaman ekstrapolasyon önceki tüm noktalara dayalı olarak yapılacaktır.

source: Window Extrapolator: An extrapolator which wraps another extrapolator, limiting the internal extrapolator’s ground truth parameter set to a fixed window size
tr_tr: Pencere Ekstrapolatörü: Başka bir ekstrapolatörü saran, dahili ekstrapolatörün kesinlik parametre setini sabit bir pencere boyutuna sınırlayan bir ekstrapolatör

source: PCA Extrapolator: A wrapper extrapolator which reduces the points’ dimensionality with PCA, performs extrapolation in the transformed pca space, and untransforms the results before returning.
tr_tr: PCA Ekstrapolatörü: Noktaların PCA ile boyutsallığını azaltan, dönüştürülmüş pca uzayında ekstrapolasyon gerçekleştiren ve geri dönmeden önce sonuçları dönüştürmeyen bir sarmalayıcı ekstrapolatör.

source: Sieve Extrapolator: A wrapper extrapolator which performs an extrapolation, then clusters the extrapolated parameter values into two large and small clusters, and sets the small clusters’ parameters to zero.
tr_tr: Sieve Ekstrapolatörü: Bir ekstrapolasyon gerçekleştiren, daha sonra ekstrapolasyonlu parametre değerlerini iki büyük ve küçük kümede kümeleyen ve küçük kümelerin parametrelerini sıfıra ayarlayan bir sarmalayıcı ekstrapolatör.

source: Polynomial Extrapolator: An extrapolator based on fitting each parameter to a polynomial function of a user-specified degree.
tr_tr: Polinom Ekstrapolatörü: Her parametrenin kullanıcı tarafından belirlenen derecede bir polinom fonksiyonuna uydurulmasına dayanan bir ekstrapolatördür.

source: Differential Extrapolator: An extrapolator based on treating each param set as a point in space, and performing regression to predict the param set for the next point. A user-specified degree also adds derivatives to the values in the point vectors which serve as features in the training data for the linear regression.
tr_tr: Diferansiyel Ekstrapolatörü: Her parametreyi bir alanda nokta olarak kabul etmeye ve sonraki noktanınki parametre setini tahmin etmek için gerileme yapmaya dayalı olan bir ektrapolatördür. Belirli bir kullanıcının derecesi nokta vektörlerinin değerlerine doğrusal regresyon için deneme verilerinde özellikler olarak çalışan türevlerini ekler.

source: Here we test two different extrapolation techniques
tr_tr: Burada iki farklı ekstrapolasyon tekniğini test ediyoruz

source: Calculating Thermodynamics Observables with a quantum computer
tr_tr: Bir kuantum bilgisayarıyla termodinamik gözlemlenebilirlikleri hesaplama

source: A preliminary draft with more information related to this tutorial can be found in preprint: Stober et al, arXiv 2003.02303 (2020)
tr_tr: Bu eğitim ile ilgili daha fazla bilgi içeren bir ön taslak şu preprintte bulunabilir: Stober et al, arXiv 2003.02303 (2020)

source: Calculation of the Born Oppenheimer Potential Energy Surface (BOPES)
tr_tr: Born Oppenheimer Potansiyel Enerjinin yüzeyinin Hesaplanması (BOPES)

source: To compute thermodynamic observables we begin with single point energy calculation which calculates the wavefunction and charge density and therefore the energy of a particular arrangement of nuclei. Here we compute the Born-Oppenheimer potential energy surface of a hydrogen molecule, as an example, which is simply the electronic energy as a function of bond length.
tr_tr: Termodinamik gözlemlerini hesaplamak için dalga fonksiyonunu ve şarj yoğunluğunu ve bununla birlikte belirli bir çekirdek düzenini hesaplayan tek nokta enerjisi hesaplamasıyla başlıyoruz. Burada, örnek olarak basitçe bağ uzunluğu ile elektronik enerji fonksiyonu olan hidrojen molekülünün Born-Oppenheimer potansiyel enerjinin yüzeyini ölçüyoruz.

source: Calculation of the molecular Vibrational Energy levels
tr_tr: Moleküler titreşimli enerji sevilerinin hesaplaması

source: The Born-Oppeheimer approximation removes internuclear vibrations from the molecular Hamiltonian and the energy computed from quantum mechanical ground-state energy calculations using this approximation contain only the electronic energy. Since even at absolute zero internuclear vibrations still occur, a correction is required to obtain the true zero-temperature energy of a molecule. This correction is called the zero-point vibrational energy (ZPE), which is computed by summing the contribution from internuclear vibrational modes. Therefore, the next step in computing thermodynamic observables is determining the vibrational energy levels. This can be done by constructing the Hessian matrix based on computed single point energies close to the equilibrium bond length. The eigenvalues of the Hessian matrix can then be used to determine the vibrational energy levels and the zero-point vibrational energy
tr_tr: Born-Oppenheimer yaklaşımı moleküler Hamiltonian'dan gelen nükleer arası titreşimlerini ve kuantum mekaniklik taban enerji seviyesinin hesaplanan enejisini kaldırır, bu yaklaşımı kullanıldığında sadece elektronik enerjisini tutar. Madem ki nğkleer arası titreşimleri mutlak sıfırda bile meydana geliyor, Bir molekülün gerçek sıfır sıcaklığının enerjisini elde etmek için bir düzeltme gerekiyor. Nükleer arası titreşimsel modlarından gelen katkılarının toplanmasıyla hesaplanan bu düzeltme (ZPE) sıfır nokta titreşimsel enerji diye adlandırılıyor. Bu nedenle termodinamik gözlemlerinin hesaplanmasında sonraki adım, titreşimsel enerji seviyelerinin belirtmektir. Bu da bağ uzunluğunun dengesine yakın hesaplanmış tek nokta enerjilerine dayalı olan Hessian matrisini oluşturarak yapılabilir. Hessian matrisinin özvektörleri, bu takdirde, titreşimsel enerji sevilerini ve titreşimsel sıfır nokta enerjisini belirtmek için kullanılabilirler

source: :nbsphinx-math:`\begin{equation} {\rm ZPE} = \frac{1}{2}\, \sum_i ^M \nu_i \, , \end{equation}` with :math:`\nu_i` being the vibrational frequencies, :math:`M = 3N − 6` or :math:`M = 3N − 5` for non-linear or linear molecules, respectively, and :math:`N` is number of the particles.
tr_tr: titreşim frekansları olarak :math:`\nu_i` ile :nbsphinx-math:`\begin{equation} {\rm ZPE} = \frac{1}{2}\, \sum_i ^M \nu_i \, , \end{equation}`, lineer ve lineer olmayan moleküler için sırasıyla :math:`M = 3N − 6` or :math:`M = 3N − 5`, ve parçacıkların miktarı olarak :math:`N`.

source: Here we fit a “full” energy surface using a 1D spline potential and use it to evaluate molecular vibrational energy levels.
tr_tr: Burada 1 boyut spline potansiyel kullanarak “full” bir enerji yüzeyini uyduruyor ve onu Moleküler titreşimsel enerji seviyelerini değerlendirmek için kullanırız.

source: Create a partition function for the calculation of heat capacity
tr_tr: Isı sığasının hesaplanması için bölüşüm fonksiyonunu oluşturuyoruz

source: The partition function for a molecule is the product of contributions from translational, rotational, vibrational, electronic, and nuclear degrees of freedom. Having the vibrational frequencies, now we can obtain the vibrational partition function :math:`q_{\rm vibration}` to compute the whole molecular partition function :nbsphinx-math:`\begin{equation} q_{\rm vibration} = \prod_{i=1} ^M \frac{\exp\,(-\Theta_{\nu_i}/2T)}{1-\exp\,(-\Theta_{\nu_i}/2T} \, . \end{equation}` Here :math:`\Theta_{\nu_i}= h\nu_i/k_B`, :math:`T` is the temperature and :math:`k_B` is the Boltzmann constant.
tr_tr: Bir molekülün bölüşüm fonksiyonu, ötelemeli, rotasyonel, titreşimsel, elektronik ve nükleer serbestlik derecelerinin katkısının sonucudur. Titreşimsel frekanslarını elde ederek, şimdi biz :nbsphinx-math:`\begin{equation} q_{\rm vibration} = \prod_{i=1} ^M \frac{\exp\,(-\Theta_{\nu_i}/2T)}{1-\exp\,(-\Theta_{\nu_i}/2T} \, moleküler bölüşüm fonksiyonunun tamamını hesaplamak için :math:`q_{\rm vibration}` olan titreşimsel bölüşüm fonksiyonunu elde edebiliriz. \end{equation}` burada :math:`\Theta_{\nu_i}= h\nu_i/k_B`, :math:`T` sıcaklık oluyor ve :math:`k_B` Boltzmann sabitidir.
