Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials.po
Languages: tr_tr

source: Run interactively in jupyter notebook.
tr_tr: Jupyter not defterinde etkileşimli olarak çalıştırın.

source: Electronic structure
tr_tr: Elektronik yapı

source: Introduction
tr_tr: Giriş

source: The molecular Hamiltonian is
tr_tr: Moleküler Hamiltonyen şu şekildedir

source: Because the nuclei are much heavier than the electrons they do not move on the same time scale and therefore, the behavior of nuclei and electrons can be decoupled. This is the Born-Oppenheimer approximation.
tr_tr: Çekirdekler elektronlardan çok daha ağır oldukları için aynı zaman ölçeğinde hareket etmezler ve bu nedenle çekirdek ve elektronların davranışı ayrılabilir. Bu, Born-Oppenheimer yaklaşımıdır.

source: Therefore, one can first tackle the electronic problem with nuclear coordinate entering only as parameters. The energy levels of the electrons in the molecule can be found by solving the non-relativistic time independent Schroedinger equation,
tr_tr: Bu nedenle, ilk olarak, yalnızca parametre olarak girilen nükleer koordinat ile elektronik problem çözülebilir. Moleküldeki elektronların enerji seviyeleri, göreli olmayan zamandan bağımsız Schrödinger denklemi çözülerek bulunabilir,

source: where
tr_tr: nerede

source: In particular the ground state energy is given by:
tr_tr: Özellikle temel durum enerjisi şu şekilde verilir:

source: where :math:`\Psi_0` is the ground state of the system.
tr_tr: burada :math:`\Psi_0` sistemin temel durumudur.

source: However, the dimensionality of this problem grows exponentially with the number of degrees of freedom. To tackle this issue we would like to prepare :math:`\Psi_0` on a quantum computer and measure the Hamiltonian expectation value (or :math:`E_0`) directly.
tr_tr: Ancak, bu sorunun boyutu, serbestlik derecesi sayısı ile katlanarak büyür. Bu sorunu çözmek için bir kuantum bilgisayarda :math:`\Psi_0` hazırlamak ve Hamiltonyen beklenti değerini (veya :math:`E_0`) doğrudan ölçmek istiyoruz.

source: So how do we do that concretely?
tr_tr: Peki bunu somut olarak nasıl yapacağız?

source: The Hartree-Fock initial state
tr_tr: Hartree-Fock başlangıç ​​durumu

source: A good starting point for solving this problem is the Hartree-Fock (HF) method. This method approximates a N-body problem into N one-body problems where each electron evolves in the mean-field of the others. Classically solving the HF equations is efficient and leads to the exact exchange energy but does not include any electron correlation. Therefore, it is usually a good starting point to start adding correlation.
tr_tr: Bu sorunu çözmek için iyi bir başlangıç ​​noktası Hartree-Fock (HF) yöntemidir. Bu yöntem, bir N cisim problemini, her elektronun diğerlerinin ortalama alanında geliştiği N adet tek cisim problemine yaklaştırır. HF denklemlerini klasik olarak çözmek verimlidir ve tam değişim enerjisine yol açar, ancak herhangi bir elektron korelasyonu içermez. Bu nedenle, korelasyon eklemeye başlamak için genellikle iyi bir başlangıç ​​noktasıdır.

source: The Hamiltonian can then be re-expressed in the basis of the solutions of the HF method, also called Molecular Orbitals (MOs):
tr_tr: Hamiltonyen daha sonra Moleküler Orbitaller (MO'lar) olarak da adlandırılan HF yönteminin çözümleri temelinde yeniden ifade edilebilir:

source: with the 1-body integrals
tr_tr: 1-cisim integralleri ile

source: and 2-body integrals
tr_tr: ve 2-cisim integraller

source: The MOs (:math:`\phi_u`) can be occupied or virtual (unoccupied). One MO can contain 2 electrons. However, in what follows we actually work with Spin Orbitals which are associated with a spin up (:math:`\alpha`) of spin down (:math:`\beta`) electron. Thus Spin Orbitals can contain one electron or be unoccupied.
tr_tr: MO'lar (:math:`\phi_u`) dolu veya sanal (boş) olabilir. Bir MO 2 elektron içerebilir. Ancak, bundan sonraki kısımda aslında bir yukarı (:math:`\alpha`) spin aşağı (:math:`\beta`) elektronuyla ilişkili olan spin orbitalleri ile çalışıyoruz. Böylece spin orbitalleri bir elektron içerebilir veya boş olabilir.

source: We now show how to concretely realise these steps with Qiskit.
tr_tr: Şimdi bu adımları somut olarak nasıl gerçekleştireceğimizi Qiskit ile gösteriyoruz.

source: Qiskit is interfaced with different classical codes which are able to find the HF solutions. Interfacing between Qiskit and the following codes is already available: \* Gaussian \* Psi4 \* PyQuante \* PySCF
tr_tr: Qiskit, HF çözümlerini bulabilen farklı klasik kodlarla arayüzlenmiştir. Qiskit ile takip eden kodlar arasında arayüz oluşturma zaten mevcuttur: \* Gaussian \* Psi4 \* PyQuante \* PySCF

source: In the following we set up a PySCF driver, for the hydrogen molecule at equilibrium bond length (0.735 angstrom) in the singlet state and with no charge.
tr_tr: Aşağıda, denge bağ uzunluğundaki (0.735 angstrom) hidrojen molekülü için singlet durumunda ve ücretsiz bir PySCF sürücüsü ayarladık.

source: For further information about the drivers see https://qiskit.org/documentation/nature/apidocs/qiskit_nature.drivers.html
tr_tr: Sürücüler hakkında daha fazla bilgi için https://qiskit.org/documentation/nature/apidocs/qiskit_nature.drivers.html adresine bakınız

source: The mapping from fermions to qubits
tr_tr: Fermiyonlardan kübitlere eşleme

source: The Hamiltonian given in the previous section is expressed in terms of fermionic operators. To encode the problem into the state of a quantum computer, these operators must be mapped to spin operators (indeed the qubits follow spin statistics).
tr_tr: Önceki bölümde verilen Hamiltonyen, fermiyonik operatörler cinsinden ifade edilir. Problemi bir kuantum bilgisayar durumuna kodlamak için, bu operatörlerin spin operatörlerine eşlenmesi gerekir (aslında kübitler spin istatistiklerini takip eder).

source: There exist different mapping types with different properties. Qiskit already supports the following mappings: \* The Jordan-Wigner ‘jordan_wigner’ mapping (über das paulische äquivalenzverbot. In The Collected Works of Eugene Paul Wigner (pp. 109-129). Springer, Berlin, Heidelberg (1993)). \* The Parity ‘parity’ (The Journal of chemical physics, 137(22), 224109 (2012)) \* The Bravyi-Kitaev ‘bravyi_kitaev’ (Annals of Physics, 298(1), 210-226 (2002))
tr_tr: Farklı özelliklere sahip farklı eşleme türleri vardır. Qiskit halihazırda aşağıdaki eşlemeleri desteklemektedir: \* The Jordan-Wigner ‘jordan_wigner’ mapping (über das paulische äquivalenzverbot. In The Collected Works of Eugene Paul Wigner (pp. 109-129). Springer, Berlin, Heidelberg (1993)). \* The Parity ‘parity’ (The Journal of chemical physics, 137(22), 224109 (2012)) \* The Bravyi-Kitaev ‘bravyi_kitaev’ (Annals of Physics, 298(1), 210-226 (2002))

source: The Jordan-Wigner mapping is particularly interesting as it maps each Spin Orbital to a qubit (as shown on the Figure above).
tr_tr: Jordan-Wigner eşlemesi (yukarıdaki şekilde gösterildiği gibi), her spin orbitali bir kübite eşlediği için özellikle ilginçtir.

source: Here we set up the Electronic Structure Problem to generate the Second quantized operator and a qubit converter that will map it to a qubit operator.
tr_tr: Burada, İkinci nicelenmiş operatörü ve onu bir kübit operatörüne eşleyecek bir kübit dönüştürücüyü oluşturmak için Elektronik Yapı Problemini kurduk.

source: If we now transform this Hamiltonian for the given driver defined above we get our qubit operator:
tr_tr: Eğer şimdi bu Hamiltonyeni yukarıda tanımlanan sürücü için dönüştürürsek, kübit operatörümüzü elde ederiz:

source: In the minimal (STO-3G) basis set 4 qubits are required. We can reduce the number of qubits by using the Parity mapping, which allows for the removal of 2 qubits by exploiting known symmetries arising from the mapping.
tr_tr: Minimum (STO-3G) temel setinde 4 kübit gereklidir. Eşlemeden kaynaklanan bilinen simetrilerden yararlanarak 2 kübitin çıkarılmasına izin veren Parite eşlemesini kullanarak kübit sayısını azaltabiliriz.

source: This time only 2 qubits are needed.
tr_tr: Bu sefer sadece 2 kübit gerekiyor.

source: Now that the Hamiltonian is ready, it can be used in a quantum algorithm to find information about the electronic structure of the corresponding molecule. Check out our tutorials on Ground State Calculation and Excited States Calculation to learn more about how to do that in Qiskit!
tr_tr: Artık Hamiltonian hazır olduğuna göre, karşılık gelen molekülün elektronik yapısı hakkında bilgi bulmak için bir kuantum algoritmasında kullanılabilir. Bunu Qiskit'te nasıl yapacağınız hakkında daha fazla bilgi edinmek için Ground State Hesaplaması ve Excited States Hesaplaması hakkındaki eğitimlerimize göz atın!

source: Vibrational structure
tr_tr: Titreşimli yapı

source: Within the Born-Oppenheimer approximation, a molecular wave function is factorized as a product of an electronic part, which is the solution of the electronic Schroedinger equation, and a vibro-rotational one, which is the solution of the nuclear Schroedinger equation in the potential energy surface (PES) generated by sampling the eigenvalues of the electronic Schroedinger equation for different geometries.
tr_tr: Born-Oppenheimer yaklaşımında, bir moleküler dalga fonksiyonu, elektronik Schroedinger denkleminin çözümü ve vibro-rotasyonel olan, nükleer Schroedinger denkleminin potansiyel enerji zeminindeki (PES) elektornik Schroedinger denkleminin farklı geometriler için olan özdeğerlerinin örneklendirilmesiyle oluşturulmuş çözümü olan elektronik parçanın ürünü olarak çarpanlarına ayrılmıştır.

source: The nuclear Schroedinger equation is usually solved in two steps, in analogy with its electronic counterpart. A single-particle basis (the basis functions are called, in this case, modals) is obtained either by the harmonic approximation applied to the PES or from a vibrational self-consistent field (VSCF) calculation. Vibrational anharmonic correlations are added a-posteriori with perturbative or variational approaches. The latter include Vibrational Configuration Interaction (VCI) and Vibrational Coupled Cluster (VCC) for highly-accurate anharmonic energies. The main advantage of VCI and VCC over alternative approaches (such as perturbation theories) is that their accuracy can be systematically improved towards the complete basis set limit for a given PES. However, their applicability is limited to small molecules with up to about 10 atoms due to their unfavorable scaling with system size.
tr_tr: Nükleer Schrödinger denklemi, elektronik karşılığına benzer şekilde genellikle iki adımda çözülür. Tek parçacık temeli (temel fonksiyonlar, bu durumda modal olarak adlandırılır) ya PES'e uygulanan harmonik yaklaşımla ya da bir titreşimsel kendi kendine tutarlı alan (VSCF) hesaplamasından elde edilir. Titreşimsel anharmonik korelasyonlar, pertürbatif veya varyasyonel yaklaşımlarla a-posteriori olarak eklenir. İkincisi, son derece doğru anharmonik enerjiler için Titreşimsel Yapılandırma Etkileşimi (VCI) ve Titreşimsel Bağlantılı Küme (VCC) içerir. VCI ve VCC'nin alternatif yaklaşımlara (pertürbasyon teorileri gibi) göre ana avantajı, doğruluklarının belirli bir PES için tam temel set limitine doğru sistematik olarak geliştirilebilmesidir. Bununla birlikte, sistem boyutu ile elverişsiz ölçeklenmeleri nedeniyle, uygulanabilirlikleri yaklaşık 10 atoma kadar olan küçük moleküllerle sınırlıdır.

source: To tackle the scaling problem we would like to use quantum algorithms.
tr_tr: Ölçekleme problemini çözmek için kuantum algoritmalarını kullanmak istiyoruz.

source: The nuclear Schroedinger equation is
tr_tr: Nükleer Schrödinger denklemi şu şekildedir

source: The so-called Watson Hamiltonian (neglecting vibro-rotational coupling terms) is
tr_tr: Watson Hamiltonyen (titreşim-dönme kuplaj terimlerinin ihmal edilmesi) olarak adlandırılan bu

source: where :math:`Q_l` are the harmonic mass-weighted normal coordinates.
tr_tr: burada :math:`Q_l` harmonik kütle ağırlıklı normal koordinatlardır.

source: :math:`\mathcal{H}_\text{vib}` must be mapped to an operator that acts on the states of a given set of :math:`N_q` qubits in order to calculate its eigenfunctions on quantum hardware. In electronic structure calculations, the mapping is achieved by expressing the non-relativistic electronic Hamiltonian in second quantization, :nbsphinx-math:`\textit{i.e.}` by projecting it onto the complete set of antisymmetrized occupation number vectors (ONV) generated by a given (finite) set of orbitals. To encode the vibrational Hamiltonian in an analogous second quantization operators, we expand the potential :math:`V(Q_1, \ldots, Q_L)` with the :math:`n`-body expansion as follows:
tr_tr: Özfonksiyonlarını bir kuantum donanımı üzerinde hesaplayabilmek için; :math:`\mathcal{H}_\text{vib}`in, :math:`N_q` kübitlerinde işleyen bir operatörde haritalanması gerek. Elektronik yapı hesaplamalarında haritalama, göreli olmayan elektronik Hamiltonyen ikinci kuantlaşmasını :nbsphinx-math:`\textit{i.e.}` verilmiş (sınırlı) bir kümedeki orbitaller tarafından oluşturulmuş antisimetrik dolu sayı vektörleri (ONV) kümesine yansıtarak elde edilir. Titreşimsel Hamiltonyen muadili olan ikinci kuantlaşma seviyesindeki operatörlerde kodlamak için :math:`n`- cisim büyütmesi ile :math:`V(Q_1, \ldots, Q_L)` i potansiyelini aşağıda gösterildiği gibi genişletiyoruz:

source: where :math:`V_0` is the electronic energy of the reference geometry, the one-mode term :math:`V^{[l]}(Q_l)` represents the variation of the PES upon change of the :math:`l`-th normal coordinate from the equilibrium position. Similarly, the two-body potential :math:`V^{[l,m]}(Q_l, Q_m)` represents the change in the exact PES upon a simultaneous displacement along the :math:`l`-th and :math:`m`-th coordinates. Often, including terms up to three-body in the :math:`L`-body expansion is sufficient to obtain an accuracy of about 1~cm\ :math:`^{-1}`. We highlight that the many-body expansion of the potential operator defining the Watson Hamiltonian contains arbitrarily high coupling terms. This is a crucial difference compared to the non-relativistic electronic-structure Hamiltonian that contains only pairwise interactions.
tr_tr: burada :math:`V_0` referans geometrinin elektronik enerjisidir, tek modlu terim :math:`V^{[l]}(Q_l)`, :math:` PES’in :math:`l` inci normal koordinatı üzerinde denge konumundaki varyasyonu temsil eder. Benzer şekilde, iki cisim potansiyeli :math:`V^{[l,m]}(Q_l, Q_m)`, :math:`l`-th ve :math boyunca aynı anda bir yer değiştirme üzerine tam PES'teki değişikliği temsil eder. :`m`-inci koordinatlar. Genellikle, :math:`L`-gövde genişletmesine üç cisimli terimleri dahil etmek, yaklaşık 1~cm\ :math:`^{-1}` doğruluk elde etmek için yeterlidir. Watson Hamiltonyen'i tanımlayan potansiyel operatörün çok cisimli genişlemesinin keyfi olarak yüksek birleştirme terimleri içerdiğini vurguluyoruz. Bu, yalnızca ikili etkileşimler içeren göreli olmayan elektronik yapı Hamiltonyen ile karşılaştırıldığında çok önemli bir farktır.

source: A flexible second quantization form of the Watson Hamiltonian is obtained within the so-called n-mode representation. Let us assume that each mode :math:`l` is described by a :math:`N_l`-dimensional basis set :math:`S_l` defined as follows:
tr_tr: Watson Hamiltonyenin esnek bir ikinci kuantizasyon formu, n-modu gösterimi içinde elde edilir. Her bir modun :math:`l` bir :math:`N_l` boyutlu temel set :math:`S_l` tarafından aşağıdaki şekilde tanımlandığını varsayalım:

source: The :math:`n`-mode wave function can be expanded in the product basis :math:`\mathcal{S} = \otimes_{i=1}^L \mathcal{S}_i` as the following CI-like expansion:
tr_tr: :math:`n`-mode dalga fonksiyonu ürün bazında genişletilebilir :math:`\mathcal{S} = \otimes_{i=1}^L \mathcal{S}_i` olarak takip eden CI benzeri olarak genişletme:

source: The many-body basis function :math:`\phi_{k_1}^{(1)}(Q_1) \cdots \phi_{k_L}^{(L)}(Q_L)` are encoded within the so-called :math:`n`-mode second quantization as occupation-number vectors (ONVs) as follows:
tr_tr: :math:`\phi_{k_1}^{(1)}(Q_1) \cdots \phi_{k_L}^{(L)}(Q_L)` çok cisim fonksiyonu :math:`n`- modunun ikinci kuantlaşmasında aşağıda gösterildiği gibi doluluk-sayı vektörleri (ONV) olarak kodlanır:

source: The ONV defined above is, therefore, the product of :math:`L` mode-specific ONVs, each one describing an individual mode. Since each mode is described by one and only one basis function, the occupation of each mode-specific ONV is one. From a theoretical perspective, each mode can be interpreted as a distinguishable quasi-particle (defined as phonons in solid-state physics). Distinguishability arises from the fact that the PES is not invariant by permutation of two modes, also in this case unlike the Coulomb interaction between two equal particles. From this perspective, a molecule can be interpreted as a collection of :math:`L` indistinguishable particles that interact through the PES operator.
tr_tr: Bu nedenle yukarıda tanımlanan ONV, her biri ayrı bir modu tanımlayan :math:`L' moduna özgü ONV'lerin ürünüdür. Her mod bir ve yalnızca bir temel fonksiyonla tanımlandığından, her moda özgü ONV'nin yerleştiği yer tektir. Teorik bir perspektiften, her mod, ayırt edilebilir bir yarı-quasi-parçacık (katı hal fiziğinde fononlar olarak tanımlandı) olarak yorumlanabilir. Ayırt edilebilirlik, PES'in iki modun permütasyonuyla değişmez olmaması gerçeğinden kaynaklanmaktadır, bu durumda da iki eşit parçacık arasındaki Coulomb etkileşiminden farklı olmasından kaynaklanır. Bu perspektiften, bir molekül, PES operatörü aracılığıyla etkileşime giren :math:'L' ayırt edilemez parçacıkların bir koleksiyonu yani toplanması olarak yorumlanabilir.

source: Based on this second-quantization representation we introduce a pair of creation and annihilation operators per mode :math:`l` :nbsphinx-math:`\textit{and}` per basis function :math:`k_l` defined as:
tr_tr: Bu ikinci kuantlaşma temsiline dayanarak, mod başına bir çift yaratma ve yok etme operatörü sunuyoruz :math:`l` :nbsphinx-math:`\textit{and}` her temel fonksiyon için :math:`k_l` şu şekilde tanımlanır:

source: with
tr_tr: ile

source: The second quantization form is obtained by expressing the potential as
tr_tr: İkinci kuantizasyon formu, potansiyelin şu şekilde ifade edilmesiyle elde edilir

source: We highlight here the difference between the operators defined here above and the electronic structure one. First, as we already mentioned, the potential contains (in principle) three- and higher-body coupling terms that lead to strings with six (or more) second-quantization operators. Moreover, the Hamiltonian conserves the number of particles for each mode, as can be seen from the fact that the number of creation and annihilation operators for a given mode is the same in each term. Nevertheless, different modes are coupled by two- (and higher) body terms containing SQ operators belonging to different modes :math:`l` and :math:`m`.
tr_tr: Burada yukarıda tanımlanan operatörler ile elektronik yapı arasındaki farkı vurguluyoruz. İlk olarak, daha önce bahsettiğimiz gibi, potansiyel (prensipte) altı (veya daha fazla) ikinci nicemleme operatörlü dizilere yol açan üç ve daha yüksek gövdeli birleştirme terimlerini içerir. Ayrıca, Hamiltonian, belirli bir mod için yaratma ve yok etme operatörlerinin sayısının her terimde aynı olması gerçeğinden görülebileceği gibi, her mod için parçacık sayısını korur. Bununla birlikte, farklı kipler, farklı kiplere ait SQ operatörlerini içeren iki (ve daha yüksek) gövde terimleriyle birleştirilir :math:`l` ve :math:`m`.

source: Reference: Ollitrault, Pauline J., et al., arXiv:2003.12578 (2020).
tr_tr: Referans: Ollitrault, Pauline J., ve diğerleri, arXiv:2003.12578 (2020).

source: Compute the electronic potential
tr_tr: Elektronik potansiyeli hesaplayın

source: Solving the ESE for different nuclear configurations to obtain the PES function :math:`V(Q_1, \ldots, Q_L)`. So far Qiskit gives the possibility to approximate the PES with a quartic force field.
tr_tr: PES işlevini elde etmek için farklı nükleer konfigürasyonlar için ESE'yi çözme :math:`V(Q_1, \ldots, Q_L)`. Şimdiye kadar Qiskit, PES'e bir kuartik kuvvet alanı ile yaklaşma imkanı veriyor.

source: The advantage of such form for the PES is that the anharmonic force fields (:math:`k_{ij}`, :math:`k_{ijk}`, :math:`k_{ijkl}`) can be calculated by finite-difference approaches. For methods for which the nuclear energy Hessian can be calculated analytically with response theory-based methods (such as HF and DFT), the quartic force field can be calculated by semi-numerical differentiation as:
tr_tr: PES için böyle bir formun avantajı, anharmonik kuvvet alanlarının (:math:`k_{ij}`, :math:`k_{ijk}`, :math:`k_{ijkl}`) sonlu-farklı yaklaşımlar tarafından hesaplanabilmesidir. Nükleer enerji Hessian'ın yanıt teorisine dayalı yöntemlerle (HF ve DFT gibi) analitik olarak hesaplanabildiği yöntemler için, kuartik kuvvet alanı aşağıdaki gibi yarı sayısal türevle hesaplanabilir:

source: and
tr_tr: ve

source: Such numerical procedure is implemented, for instance, in the Gaussian suite of programs.
tr_tr: Bu tür sayısal prosedür, örneğin Gaussian programlarının paketinde uygulanmaktadır.

source: In practice this can be done with Qiskit using the GaussianForceDriver.
tr_tr: Pratikte bu, GaussianForceDriver kullanılarak Qiskit ile yapılabilir.

source: Map to a qubit Hamiltonian
tr_tr: Bir kübit Hamiltonyeni haritalanması

source: Now that we have an approximation for the potential, we need to write the Hamiltonian in second quantization. To this end we need to select a modal basis to calculate the one-body integrals :math:`\langle\phi_{k_i}| V(Q_i) | \phi_{h_i} \rangle`, two-body integrals :math:`\langle\phi_{k_i} \phi_{k_j}| V(Q_i,Q_j) | \phi_{h_i} \phi_{h_j} \rangle`\ …
tr_tr: Şimdi, mademki potansiyel için bir yaklaşımımız var, Hamiltonyeni ikinci kuantlaşma seviyesinde yazmamız gerekir. Sonunda biz :math:`\langle\phi_{k_i}| V(Q_i) | \phi_{h_i} \rangle` tek cisimli ve :math:`\langle\phi_{k_i} \phi_{k_j}| V(Q_i,Q_j) | \phi_{h_i} \phi_{h_j} \rangle`\ … çift cisimli integralleri hesaplamak için bir mod bazı seçmemiz gerekir…

source: In the simplest case, the :math:`\phi` functions are the harmonic-oscillator eigenfunctions for each mode. The main advantage of this choice is that the integrals of a PES expressed as a Taylor expansion are easy to calculate with such basis. A routine for computing these integrals is implemented in Qiskit.
tr_tr: En basit durumda, :math:`\phi` işlevleri, her mod için harmonik osilatör özfonksiyonlarıdır. Bu seçimin ana avantajı, Taylor açılımı olarak ifade edilen bir PES'in integrallerinin böyle bir temelde hesaplanmasının kolay olmasıdır. Bu integralleri hesaplamak için bir rutin Qiskit'te uygulanmaktadır.

source: The bosonic operator, :math:`\mathcal{H}_\text{vib}^{SQ}`, is then created and must be mapped to a qubit operator. The direct mapping introduced in the first section of this tutorial can be used is Qiskit as follows:
tr_tr: Bozonik operatör :math:`\mathcal{H}_\text{vib}^{SQ}` daha sonra oluşturulur ve bir kübit operatörüyle eşlenmesi gerekir. Bu öğreticinin ilk bölümünde tanıtılan doğrudan eşleme aşağıdaki gibi Qiskit'te kullanılabilir:

source: The Vibrational operator for the problem now reads as
tr_tr: Sorun için titreşim operatörü şimdi şu şekilde okur:

source: In the previous cell we defined a bosonic transformation to express the Hamiltonian in the harmonic modal basis, with 2 modals per mode with the potential truncated at order 2 and the ‘direct’ boson to qubit mapping. The calculation is then ran as:
tr_tr: Önceki hücrede, Hamiltonyeni harmonik mod bazında ifade etmek için, mod başına 2 modlu, potansiyel ikinci sırada kesilen ve ‘direct’ bozonu kübit eşlemeye sahip bir bozonik dönüşüm tanımladık. Hesaplama daha sonra şu şekilde çalıştırılır:
