Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials.po
Languages: tr_tr

source: The single-point energy calculations and the resulting partition function can be used to calculate the (constant volume or constant pressure) heat capacity of the molecules. The constant volume heat capacity, for example, is given by
tr_tr: Tek nokta enerji hesaplamalarını ve bölüşüm fonksiyonunun sonucunu molekülerin ısı sığasını (sabit hacim veya sabit basınç) hesaplamak için kullanılabilir. Isı sığasının sabit hacim, örnek olarak, bu şekilde veriliyor

source: :nbsphinx-math:`\begin{equation} C_v = \left.\frac{\partial U}{\partial T}\right|_{N,V}\, , \qquad {\rm with} \quad U=k_B T^2 \left.\frac{\partial {\rm ln} Q}{\partial T}\right|_{N,V} . \end{equation}`
tr_tr: \begin{equation} C_v = \left.\frac{\partial U}{\partial T}\right|_{N,V}\, , \qquad {\rm with} \quad U=k_B T^2 \left.\frac{\partial {\rm ln} Q}{\partial T}\right|_{N,V} . \end{equation}

source: :math:`U` is the internal energy, :math:`V` is the volume and :math:`Q` is the partition function.
tr_tr: :math:`U` entegral enerji, :math:`V` hacim ve :math:`Q` bölüşüm fonksiyonudur.

source: Here we illustrate the simplest usage of the partition function, namely creating a Thermodynamics object to compute properties like the constant pressure heat capacity defined above.
tr_tr: Burada bölüşüm fonksiyonunun en basit kullanışını göstermiş oluyoruz, yani yukarıda tanımlanan ısı sığasının sabit basıncı gibi özellikleri hesaplamak için termodinamik bir nesne oluşturuyoruz.

source: Here we demonstrate how to access particular components (the rotational part) of the partition function, which in the H2 case we can further split to para-hydrogen and ortho-hydrogen components.
tr_tr: Burada bölüşüm fonksiyonunun belirli bileşenlere (rotasyonel kısmına) nasıl giriş yapabileceğimizi gösteriyoruz, H2 durumunda da biz para-hidrojen ve orto-hidrojen bileşenler olarak ayırabiliriz.

source: We will now plot the constant volume heat capacity (of the rotational part) demonstrating how we can call directly the functions in the ‘thermodynamics’ module, providing a callable object for the partition function (or in this case its rotational component). Note that in the plot we normalize the plot dividing by the universal gas constant R (Avogadro’s number times Boltzman’s constant) and we use crossed to compare with experimental data found in literature.
tr_tr: Şimdi, 'thermodynamics' modülündeki fonksiyonları doğrudan nasıl çağırabileceğimizi gösteren sabit hacim ısı kapasitesini (dönel parçanın) çizeceğiz, bölme fonksiyonu (veya bu durumda onun dönme bileşeni) için çağrılabilir bir nesne sağlayarak. Grafikte, evrensel gaz sabiti R (Avogadro sayısı çarpı Boltzman sabiti) ile bölen grafiği normalleştirdiğimizi ve literatürde bulunan deneysel verilerle karşılaştırmak için crossed kullandığımızı unutmayın.

source: Leveraging Qiskit Runtime
tr_tr: Qiskit Runtime'dan Yararlanma

source: Iterative algorithms, such as the Variational Quantum Eigensolver (VQE), traditionally send one batch of circuits (one “job”) to be executed on the quantum device in each iteration. Sending a job involves certain overhead, mainly
tr_tr: Variational Quantum Eigensolver (VQE) gibi yinelemeli algoritmalar, geleneksel olarak, her yinelemede kuantum cihazında yürütülmek üzere bir grup devre (bir “job”) gönderir. Bir iş göndermek, esas olarak belirli bir ek yükü içerir

source: the time to process the requests and send the data (API overhead, usually about 10s)
tr_tr: istekleri işleme ve verileri gönderme zamanı (API genel, genellikle yaklaşık 10sn)

source: the job queue time, that is how long you have to wait before it’s your turn to run on the device (usually about 2min)
tr_tr: iş kuyruğu süresi, cihazda çalışma sıranız gelmeden önce ne kadar beklemeniz gerektiğidir (genellikle yaklaşık 2dk)

source: If we send hundreds of jobs iteratively, this overhead quickly dominates the execution time of our algorithm. Qiskit Runtime allows us to tackle these issues and significantly speed up (especially) iterative algorithms. With Qiskit Runtime, one job does not contain only a batch of circuits but the *entire* algorithm. That means we only experience the API overhead and queue wait *once* instead of in every iteration! You’ll be able to either upload algorithm parameters and delegate all the complexity to the cloud, where your program is executed, or upload your personal algorithm directly.
tr_tr: Yüzlerce işi yinelemeli olarak gönderirsek, bu ek yük, algoritmamızın yürütme süresine hızla hakim olur. Qiskit Runtime, bu sorunları çözmemize ve (özellikle) yinelemeli algoritmaları önemli ölçüde hızlandırmamıza olanak tanır. Qiskit Runtime ile bir iş yalnızca bir grup devreyi değil, *tüm* algoritmayı içerir. Bu, her yineleme yerine yalnızca API ek yükü ve kuyrukta bekleme *bir kez* deneyimlediğimiz anlamına gelir! Algoritma parametrelerini yükleyebilir ve tüm karmaşıklığı programınızın yürütüldüğü buluta devredebilir veya kişisel algoritmanızı doğrudan yükleyebilirsiniz.

source: For the VQE, the integration of Qiskit Runtime in your existing code is a piece of cake. There is a (almost) drop-in replacement, called ``VQEProgram`` for the ``VQE`` class.
tr_tr: VQE için, Qiskit Runtime'ın mevcut kodunuza entegrasyonu çocuk oyuncağıdır. ``VQE`` sınıfı için ``VQEProgram`` olarak adlandırılan (neredeyse) bir bırakma (drop-in) yer değiştirmesi var.

source: Let’s see how you can leverage the runtime on a simple chemistry example: Finding the ground state energy of the lithium hydrate (LiH) molecule at a given bond distance.
tr_tr: Basit bir kimya örneğinde çalıştırma zamanından nasıl yararlanabildiğinizi görelim: Lityum Hidrat (LiH) molekülünün zemin devlet enerjisini belirli bir bağ mesafesi ile buluyorsunuz.

source: Problem specification: LiH molecule
tr_tr: Problem spesifikasyonu: LiH molekülü

source: First, we specify the molecule whose ground state energy we seek. Here, we look at LiH with a bond distance of 2.5 Å.
tr_tr: İlk olarak, topraklı devlet enerjisini aradığımız molekülü belirliyoruz. Burada, LiH ' e 2,5 lik bir bağ mesafesi ile bakıyoruz.

source: Classical reference solution
tr_tr: Klasik referans çözümü

source: As a reference solution we can solve this system classically with the ``NumPyEigensolver``.
tr_tr: Referans çözümü olarak bu sistemi klasik olarak ``NumPYEigensolver`` ile çözebiliriz.

source: To run the VQE we need to select a parameterized quantum circuit acting as ansatz and a classical optimizer. Here we’ll choose a heuristic, hardware efficient ansatz and the SPSA optimizer.
tr_tr: VQE'yi çalıştırmak için, ansatz ve klasik bir optimize edici olarak hareket eden bir kuantum devresi seçmemiz gerekiyor. Burada bir buluşsal, donanım tasarruflu ansatz ve SPSA Optimizer'ı seçeceğiz.

source: Before executing the VQE in the cloud using Qiskit Runtime, let’s execute a local VQE first.
tr_tr: Qiskit Runtime kullanarak bulutta VQE'yi çalıştırmadan önce, yerel bir VQE çalıştıralım.

source: Runtime VQE
tr_tr: Çalışma zamanı VQE'si

source: Let’s exchange the eigensolver from a local VQE algorithm to a VQE executed using Qiskit Runtime – simply by exchanging the ``VQE`` class by the ``VQEProgram``.
tr_tr: Qiskit Runtime kullanılarak yürütülen bir VQE algoritmasını basitçe ``VQE`` sınıfı ile ``VQEProgram`` ile değiş tokuş ederek yerel bir VQE algoritmasıyla değiştirelim.

source: First, we’ll have to load a provider to access Qiskit Runtime. **Note:** You have to replace the next cell with your provider.
tr_tr: İlk olarak, Qiskit Runtime'a erişmek için bir sağlayıcı yüklemek zorunda olacağız. **Not ** Bir sonraki hücreyi sağlayıcınızla değiştirmeniz gerekir.

source: Now we can set up the ``VQEProgram``. In this first release, the optimizer must be provided as a dictionary, in future releasess you’ll be able to pass the same optimizer object as in the traditional VQE.
tr_tr: Şimdi, ``VQEProgram``ı ayarlayabiliriz. Bu ilk yayın düzeyinde, optimize edici bir sözlük olarak sağlanmalıdır, gelecekte releasix olarak, geleneksel VQE'de olduğu gibi aynı optimize edici nesnesini geçebileceksiniz.

source: If we are interested in the development of the energy, the ``VQEProgram`` allows access to the history of the optimizer, which contains the loss per iteration (along with the parameters and a timestamp). We can access this data via the ``raw_result`` attribute of the ground state solver.
tr_tr: Eğer enerjinin gelişimi ile ilgileniyorsak, ``VQEProgram``ı yineleme başına kaybı (parametreler ve zaman dalgası ile birlikte) içeren optimize edicinin geçmişine erişim sağlar. Bu verilere zemin durumu çözücünün ``raw_result`` özelliği ile erişebiliriz.

source: Qiskit Nature Tutorials
tr_tr: Qiskit Nature Eğitimleri
