Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/01_neural_networks.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, hi_in, ja, ml_in, pt_un, ta, zh_tw

source: In this tutorial, we introduced the two neural networks classes provided by ``qiskit-machine-learning``, namely the ``EstimatorQNN`` and ``SamplerQNN``, which extend the base ``NeuralNetwork`` class. We provided some theoretical background, the key steps for QNN initialization, basic use in forward and backward passes, and advanced functionality.
es_un: En este tutorial, presentamos las dos clases de redes neuronales proporcionadas por ``qiskit-machine-learning``, es decir, ``EstimatorQNN`` y ``SamplerQNN``, que amplían la clase base ``NeuralNetwork``. Brindamos algunos antecedentes teóricos, los pasos clave para la inicialización de QNN, el uso básico en pasos hacia adelante y hacia atrás y funcionalidad avanzada.
ja: このチュートリアルでは、``qiskit-machine-learning`` によって提供される2つのニューラルネットワーク・クラス、つまり ``EstimatorQNN`` と ``SamplerQNN`` について紹介しました。 QNN初期化のための重要なステップ、フォワードおよびバックワード・パスでの基本的な使用法、および高度な機能のいくつかの理論的背景を提供しました。
ta: இந்த டுடோரியலில், ``கிஸ்கிட்-மெஷின்-லேர்னிங்`` வழங்கும் இரண்டு நரம்பியல் நெட்வொர்க்குகள் வகுப்புகளை அறிமுகப்படுத்தினோம், அதாவது ``EstimatorQNN`` மற்றும் ``SamplerQNN``, இது அடிப்படை ``NeuralNetwork`` வகுப்பை விரிவுபடுத்துகிறது. நாங்கள் சில கோட்பாட்டு பின்னணி, QNN துவக்கத்திற்கான முக்கிய படிகள், முன்னோக்கி மற்றும் பின்தங்கிய பாஸ்களில் அடிப்படை பயன்பாடு மற்றும் மேம்பட்ட செயல்பாடுகளை வழங்கினோம்.

source: We now encourage you to play around with the problem setup and see how different circuit sizes, input, and weight parameter lengths influence the output shapes.
es_un: Ahora te alentamos a que juegues con la configuración del problema y veas cómo los diferentes tamaños de circuito, la entrada y las longitudes de los parámetros de peso influyen en las formas de salida.
ja: この問題設定を扱って、さまざまな回路のサイズ、入力、重みパラメーターの長さが、出力形状にどのように影響を与えるか確認することをお勧めします。
ta: சிக்கல் அமைப்பைச் சுற்றி விளையாடவும், வெவ்வேறு சுற்று அளவுகள், உள்ளீடு மற்றும் எடை அளவுரு நீளங்கள் வெளியீட்டு வடிவங்களை எவ்வாறு பாதிக்கின்றன என்பதைப் பார்க்கவும் நாங்கள் இப்போது உங்களை ஊக்குவிக்கிறோம்.

source: `NeuralNetwork <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.NeuralNetwork.html>`__: The interface for neural networks. This is an abstract class all QNNs inherit from.
es_un: `NeuralNetwork <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.NeuralNetwork.html>`__: La interfaz para redes neuronales. Esta es una clase abstracta de la que heredan todas las QNN.
ja: `NeuralNetwork <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.NeuralNetwork.html>`__: ニューラルネットワークのインターフェイス。これは全ての QNN が継承する抽象クラスです。

source: `EstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__: A network based on the evaluation of quantum mechanical observables.
es_un: `EstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__: Una red basada en la evaluación de observables mecánicos cuánticos.
ja: `EstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__: 量子力学的観測可能量の評価に基づくネットワーク。

source: `SamplerQNN <https://qiskit.org/documentation/machine-learning/locale/fr_FR/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__: A network based on the samples resulting from measuring a quantum circuit.
es_un: `SamplerQNN <https://qiskit.org/documentation/machine-learning/locale/fr_FR/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__: Una red basada en las muestras resultantes de medir un circuito cuántico.
ja: `SamplerQNN <https://qiskit.org/documentation/machine-learning/locale/fr_FR/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__: 量子回路の測定から得られたサンプルを基にしたネットワーク。

source: It's important to note that ``NeuralNetwork``\ s are "stateless". They do not contain any training capabilities (these are pushed to the actual algorithms or applications: `classifiers <https://qiskit.org/documentation/machine-learning/apidocs/qiskit_machine_learning.algorithms.html#classifiers>`__, `regressors <https://qiskit.org/documentation/machine-learning/apidocs/qiskit_machine_learning.algorithms.html#regressors>`__, etc), nor do they store the values for trainable weights.
ja: ``NeuralNetwork`` は「ステートレス」であることに注意する必要があります。学習能力を有さず (学習能力は実際のアルゴリズムやアプリケーションに任されます: `分類器 <https://qiskit.org/documentation/machine-learning/apidocs/qiskit_machine_learning.algorithms.html#classifiers>`__, `回帰器 <https://qiskit.org/documentation/machine-learning/apidocs/qiskit_machine_learning.algorithms.html#regressors>`__, など) 、訓練可能ウェイトの値を保持しません。

source: This notebook demonstrates the different generic quantum neural network (QNN) implementations provided in Qiskit Machine Learning. The networks are meant as application-agnostic computational units that can be used for many different use cases. Depending on the application, a particular type of network might more or less suitable and might require to be set up in a particular way. The following different available neural networks will now be discussed in more detail:
bn_bn: এই নোটবুকটিতে Qiskit মেশিন লার্নিং এর বিভিন্ন সাধারণ কোয়ান্টাম নিউরাল নেটওয়ার্ক (কিউ এন এন) এর বাস্তবায়ন (ইমপ্লিমেন্টেশন) দেখানো হয়েছে। এই নেটওয়ার্ক গুলো প্রয়োগ-নিরপেক্ষ কম্পিউটেশনাল ইউনিট হিসেবে বোঝানো হয় যা অনেক গুলি বিভিন্ন ক্ষেত্রে ব্যবহার করা যেতে পারে। প্রয়োগের উপর নির্ভর করে, একটি নির্দিষ্ট ধরনের নেটওয়ার্ক কম-বেশি উপযুক্ত হতে পারে এবং একটি নির্দিষ্ট উপায়ে সেট আপ বা গঠন করার প্রয়োজনীয়তা দেখা দিতে পারে। নিম্নে বিভিন্ন নিউরাল নেটওয়ার্ক গুলো আরো বিশদ ভাবে আলোচনা করা হবেঃ
de_de: Dieses Notebook demonstriert die verschiedenen generischen Implementierungen von Quantennetzwerken (QNN) in Qiskit Machine Learning. Sie sind als allgemeine rechnerische Einheiten ohne bestimmten Anwendungsfall gedacht. Abhängig von der Anwendung kann eine gewisse Art von Netzwerk mehr oder weniger gut geeignet sein, oder muss möglicherweise auf eine bestimmte Art konfiguriert werden. Die verfügbaren neuronalen Netze werden nun genauer vorgestellt:
el_gr: Αυτό το σημειωματάριο επιδεικνύει τις διάφορες γενικές υλοποιήσεις κβαντικού νευρικού δικτύου (quantum neural network, QNN) που παρέχονται στο Qiskit Machine Learning. Τα δίκτυα προορίζονται ως εφαρμογές-agnostic υπολογιστικές μονάδες που μπορούν να χρησιμοποιηθούν για πολλές διαφορετικές περιπτώσεις χρήσης. Ανάλογα με την εφαρμογή, ένας συγκεκριμένος τύπος δικτύου μπορεί να είναι περισσότερο ή λιγότερο κατάλληλος και μπορεί να χρειαστεί να δημιουργηθεί με συγκεκριμένο τρόπο. Τα ακόλουθα διαφορετικά διαθέσιμα νευρωνικά δίκτυα θα συζητηθούν με περισσότερες λεπτομέρειες:
fr_fr: Ce bloc-notes illustre les différentes implémentations génériques du réseau de neurones (QNN) fournies dans Qiskit Machine Learning. Les réseaux sont conçus comme des unités de calcul qui peuvent être utilisées pour de nombreux cas d'utilisation différents. Selon l'application, un type particulier de réseau peut être plus ou moins adapté et peut nécessiter d'être mis en place d'une manière particulière. Les différents réseaux de neurones suivants sont disponible est vont être détaillés :
hi_in: यह नोटबुक Qiskit Machine Learning में उपलब्ध कराई गई विभिन्न सामान्य क्वांटम तंत्रिका नेटवर्क या क्वांटम न्यूरल नेटवर्क (QNN) कार्यान्वयन को प्रदर्शित करता है। नेटवर्क का अर्थ अनुप्रयोग-अज्ञेयवादी अभिकलन इकाइयों के रूप में किया जाता है जिनका प्रयोग कई प्रकार के उपयोग मामलों में किया जा सकता है । आवेदन के आधार पर, एक विशेष प्रकार का नेटवर्क अधिक या कम उपयुक्त हो सकता है और इसे एक विशेष प्रकार से स्थापित करने की आवश्यकता हो सकती है। निम्नलिखित अलग उपलब्ध तंत्रिका नेटवर्क अब और अधिक विस्तार में चर्चा की जाएगी:
ml_in: ഈ നോട്ട്ബുക്ക് ക്വിസ്കിറ്റ് മെഷീൻ ലേണിംഗിൽ നൽകിയിട്ടുള്ള വ്യത്യസ്ത ജനറിക് ക്വാണ്ടം ന്യൂറൽ നെറ്റ്‌വർക്ക് (QNN) നടപ്പാക്കലുകൾ കാണിക്കുന്നു. വ്യത്യസ്‌ത ഉപയോഗ കേസുകൾ‌ക്ക് ഉപയോഗിക്കാൻ‌ കഴിയുന്ന ആപ്ലിക്കേഷൻ‌-അജ്ഞ്ഞേയ കംപ്യൂട്ടേഷണൽ‌ യൂണിറ്റുകളാണ് നെറ്റ്‌വർ‌ക്കുകൾ‌. ആപ്ലിക്കേഷനെ ആശ്രയിച്ച്, ഒരു പ്രത്യേക തരം നെറ്റ്‌വർക്ക് കൂടുതലോ കുറവോ അനുയോജ്യമായേക്കാം, ഇവയെ ഒരു പ്രത്യേക രീതിയിൽ സജ്ജീകരിക്കേണ്ടതുണ്ട്. ലഭ്യമായ വ്യത്യസ്ത ന്യൂറൽ നെറ്റ്‌വർക്കുകൾ ഇപ്പോൾ കൂടുതൽ വിശദമായി ചർച്ചചെയ്യും:
pt_un: Este notebook demonstra as diferentes implementações genéricas de rede neural (QNN) fornecidas no módulo Machine Learning do Qiskit. As redes são feitas como unidades computacionais de aplicação agnóstica que podem ser usadas para muitos casos de uso diferentes. Dependendo da aplicação, um determinado tipo de rede neural pode ser mais adequada ou menos adequada e pode exigir ser configurado de uma maneira particular. As seguintes redes neurais disponíveis agora serão discutidas em mais detalhes:
zh_tw: 本筆記本介紹了由 Qiskit 機器學習提供的各種通用量子神經網絡 (QNN) 實作。該網絡可作為獨立於應用程序的計算單元用於各種使用範例。根據您的應用程序，某些類型的網絡可能或多或少適合，或者您可能需要以特定方式設置它們。本節詳細介紹以下類型的神經網絡：

source: ``NeuralNetwork``: The interface for neural networks.
bn_bn: ``NeuralNetwork``: নিউরাল নেটওয়ার্কের ইন্টারফেস
de_de: ``NeuralNetwork``: Das Interface für neuronale Netze.
el_gr: "NeuralNetwork": Η διεπαφή για τα νευρωνικά δίκτυα.
fr_fr: ``NeuralNetwork``: L'interface pour les réseaux de neurones.
hi_in: ``NeuralNetwork``: तंत्रिका नेटवर्क के लिए अंतरापृष्ठ।
ml_in: ``NeuralNetwork``: ന്യൂറൽ നെറ്റ്‌വർക്കുകൾക്കായുള്ള ഇന്റർഫേസ്.
pt_un: ` ` NeuralNetwork ` `: A interface para redes neurais.
zh_tw: ``NeuralNetwork``：神經網絡介面。

source: ``OpflowQNN``: A network based on the evaluation of quantum mechanical observables.
bn_bn: ``OpflowQNN``: কোয়ান্টাম বলবিদ্যার পর্যবেক্ষণের মূল্যায়নের উপর ভিত্তি করে একটি নেটওয়ার্ক।
de_de: ``OpflowQNN``: Ein Netzwerk, das auf der Auswertung von quantenmechanischen Observablen basiert.
el_gr: ``OpflowQNN``: Ένα δίκτυο βασισμένο στην αξιολόγηση κβαντικών μηχανικών παρατηρήσεων.
fr_fr: ``OpflowQNN``: Un réseau basé sur l'évaluation des observables mécaniques quantiques.
hi_in: ``OpflowQNN``: प्रमात्रा यांत्रिक वेधशालाओं के मूल्यांकन पर आधारित एक नेटवर्क
ml_in: ``OpflowQNN``: ക്വാണ്ടം മെക്കാനിക്കൽ നിരീക്ഷണങ്ങളുടെ വിലയിരുത്തലിനെ അടിസ്ഥാനമാക്കിയുള്ള ഒരു നെറ്റ്‌വർക്ക്.
pt_un: § ` OpflowQNN ` `: Uma rede baseada na avaliação de observáveis.
zh_tw: ``OpflowQNN``：基於量子物理觀察量評估的網絡。

source: ``TwoLayerQNN``: A special ``OpflowQNN`` implementation for convenience.
bn_bn: ``TwoLayerQNN``: কাজের সুবিধার জন্য একটি বিশেষ ``OpflowQNN`` বাস্তবায়ন।
de_de: ``TwoLayerQNN``: Eine bequeme Implementierung von ``OpflowQNN``.
el_gr: " ` TwoLayerQNN ` `: Μια ειδική υλοποίηση ` ` OpflowQNN ` ` για ευκολία.
fr_fr: ``TwoLayerQNN``: Une implémentation spéciale de ``OpflowQNN`` pour plus de commodité.
hi_in: ``TwoLayerQNN``: एक विशेष ``OpflowQNN`` सुविधा के लिए कार्यान्वयन।
ml_in: ``TwoLayerQNN``: സൗകര്യാർത്ഥം ഒരു പ്രത്യേക ``OpflowQNN`` നടപ്പാക്കൽ.
pt_un: § ` TwoLayerQNN ` `: Uma aplicação especial de ` ` OpflowQNN ` ` ` feita por conveniência.
zh_tw: `` TwoLayerQNN``：為方便起見的`` OpflowQNN`` 的特殊實作。

source: ``CircuitQNN``: A network based on the samples resulting from measuring a quantum circuit.
bn_bn: ``CircuitQNN``: একটি নেটওয়ার্ক যা কোয়ান্টাম বর্তনী (সার্কিট) পরিমাপ করে পাওয়া নমুনাগুলির উপর ভিত্তি করে রচিত।
de_de: ``CircuitQNN``: Ein Netzwerk, das auf den Samples basiert, die aus der Messung einer Quantenschaltung resultieren.
el_gr: ``CircuitQNN``: Ένα δίκτυο βασισμένο στα δείγματα που προκύπτουν από τη μέτρηση ενός κβαντικού κυκλώματος.
fr_fr: ``CircuitQNN``: Un réseau basé sur les échantillons résultant de la mesure d'un circuit quantique.
hi_in: ``CircuitQNN``: क्वांटम सर्किट को मापने के परिणामस्वरूप नमूनों पर आधारित एक नेटवर्क।
ml_in: ``CircuitQNN``: ഒരു ക്വാണ്ടം സർക്യൂട്ട് അളക്കുന്നതിന്റെ ഫലമായ സാമ്പിളുകളെ അടിസ്ഥാനമാക്കിയുള്ള ഒരു നെറ്റ്‌വർക്ക്.
pt_un: `` CircuitQNN ` `: Uma rede baseada nas amostras resultantes da medição de um circuito quântico.
zh_tw: ``CircuitQNN``：基於通過測量量子電路獲得的樣本的網絡。

source: 1. ``NeuralNetwork``
bn_bn: ১. ``NeuralNetwork``

source: The ``NeuralNetwork`` represents the interface for all neural networks available in Qiskit Machine Learning. It exposes a forward and a backward pass taking the data samples and trainable weights as input. A ``NeuralNetwork`` does not contain any training capabilities, these are pushed to the actual algorithms / applications. Thus, a ``NeuralNetwork`` also does not store the values for trainable weights. In the following, different implementations of this interfaces are introduced.
bn_bn: ``NeuralNetwork`` Qiskit মেশিন লার্নিংয়ে পাওয়া যায় এমন সব নিউরাল নেটওয়ার্কগুলির ইন্টারফেসের প্রতিনিধিত্ব করে। এটি ইনপুট হিসাবে তথ্য (ডেটা) নমুনা এবং প্রশিক্ষণযোগ্য (ট্রেইনেবল) ওয়েট গ্রহণ করে একটি ফরোয়ার্ড (সম্মুখ) এবং একটি ব্যাকওয়ার্ড (পশ্চাৎ) পাস উন্মুক্ত করে। একটি ``NeuralNetwork`` কোনও প্রশিক্ষণ (ট্রেইনিং) ক্ষমতা রাখে না, এগুলি প্রকৃত ধারাক্রম (অ্যালগরিদম) / প্রয়োগক্ষেত্রে (অ্যাপ্লিকেশন) ব্যবহার করা যায়।সুতরাং একটি, ``NeuralNetwork`` প্রশিক্ষণযোগ্য ওয়েটের মানগুলিও সঞ্চয় করে না। নিচে, এই ইন্টারফেসগুলির বিভিন্ন প্রয়োগ দেখানো হয়েছে।
de_de: Das ``NeuralNetwork`` stellt die Schnittstelle für alle neuronalen Netze dar, die in Qiskit Machine Learning zur Verfügung stehen. Sie legt einen Forward- und einen Backward-Pass vor, wobei die Daten-Samples und trainierbaren Gewichte als Inputs verwendet werden. Ein ``NeuralNetwork`` ermöglicht kein Training. Dieses wird in die eigentlichen Algorithmen/Anwendungen veragert. Ein ``NeuralNetwork`` speichert also auch nicht die Werte von trainierbaren Gewichten. Im Folgenden werden unterschiedliche Implementierungen dieser Schnittstellen eingeführt.
el_gr: Το ` ` NeuralNetwork ` ` αντιπροσωπεύει τη διεπαφή για όλα τα νευρωνικά δίκτυα διαθέσιμα στο Qiskit Machine Learning. Εκθέτει ένα προς τα εμπρός και ένα προς τα πίσω πέρασμα λαμβάνοντας τα δείγματα δεδομένων και τα εφαρμόσιμα βάρη ως είσοδο. Ένα ` ` NeuralNetwork ` ` δεν περιέχει εκπαιδευτικές δυνατότητες, αυτές προωθούνται στους πραγματικούς αλγορίθμους/εφαρμογές. Έτσι, ένα "NeuralNetwork `" επίσης δεν αποθηκεύει τις τιμές για εφαρμόσιμα βάρη. Στις ακόλουθες περιπτώσεις, εισάγονται διαφορετικές υλοποιήσεις των διεπαφών.
fr_fr: ``NeuralNetwork`` représente l'interface pour tous les réseaux de neurones disponibles dans Qiskit Machine Learning. Il expose une passe vers l'avant et vers l'arrière en prenant les échantillons de données et les poids entraînables en entrée. Un ``NeuralNetwork`` ne contient aucune capacité d'entraînement, les capacités d'entrainement se trouvent au niveau des algorithmes et applications. Ainsi, un ``NeuralNetwork`` ne stocke pas non plus les valeurs des poids. Dans ce qui suit, différentes implémentations de ces interfaces sont introduites.
hi_in: ``NeuralNetwork`` Qiskit Machine Learning में उपलब्ध सभी तंत्रिका नेटवर्क के लिए अंतरापृष्ठ का प्रतिनिधित्व करता है। यह इनपुट के रूप में आँकड़ो के नमूने और प्रशिक्षण योग्य भार लेते हुए अग्रिम और पश्चवर्ती पास को उजागर करता है। एक ``NeuralNetwork`` में कोई प्रशिक्षण क्षमता नहीं होती है, इन्हें वास्तविक एल्गोरिदम/अनुप्रयोगों पर धकेल दिया जाता है। इस प्रकार, एक ``NeuralNetwork`` भी प्रशिक्षित वजन के लिए मूल्यों को संग्रहीत नहीं करता है। निम्नलिखित में, इस अंतरापृष्ठ के विभिन्न कार्यान्वयन पेश किए गए हैं।
ml_in: ക്വിസ്കിറ്റ് മെഷീൻ ലേണിംഗിൽ ലഭ്യമായ എല്ലാ ന്യൂറൽ നെറ്റ്‌വർക്കുകൾക്കുമായുള്ള ഇന്റർഫേസിനെ ``NeuralNetwork`` പ്രതിനിധീകരിക്കുന്നു. ഡാറ്റാ സാമ്പിളുകളും ട്രെയിനബിൾ വെയ്റ്റുകളും ഇൻപുട്ടായി എടുക്കുന്ന ഒരു ഫോർവേഡ്, ബാക്ക്വേർഡ് പാസ് ഇത് തുറന്നുകാട്ടുന്നു. ഒരു ``NeuralNetwork``യിൽ പരിശീലന ശേഷികളൊന്നും അടങ്ങിയിട്ടില്ല, ഇവയെ യഥാർത്ഥ അൽഗോരിതം / ആപ്ലിക്കേഷനുകളിലേക്ക് തള്ളപ്പെടുന്നു. അതിനാൽ, ``NeuralNetwork``ഒരുപരിശീലനയോഗ്യമായ വെയ്റ്റിംൻ്റെ മൂല്യങ്ങളൊന്നും സംഭരിക്കുന്നില്ല. ഇനിപ്പറയുന്നവയിൽ, ഈ ഇന്റർഫേസുകളുടെ വ്യത്യസ്ത നടപ്പാക്കലുകൾ അവതരിപ്പിക്കുന്നു.
pt_un: O ``NeuralNetwork`` representa a interface para toda a rede neural disponível no Qiskit Machine Learning. Ele expõe um passe para frente e um para trás tomando as amostras de dados e pesos treináveis como input. O ``NeuralNetwork`` não contém nenhuma capacidade de treino, estes são destinados aos algoritmos/aplicações. Assim, um ``NeuralNetwork`` também não armazena os valores para os pesos treináveis. A seguir, diferentes implementações dessas interfaces serão introduzidas.

source: Suppose a ``NeuralNetwork`` called ``nn``. Then, the ``nn.forward(input, weights)`` pass takes either flat inputs for the data and weights of size ``nn.num_inputs`` and ``nn.num_weights``, respectively. ``NeuralNetwork`` supports batching of inputs and returns batches of output of the corresponding shape.
bn_bn: ধরুন, একটি ``NeuralNetwork`` যার সংক্ষিপ্ত নাম ``nn``। এরপরে, ``nn.forward(input, weights)`` পাসের জন্য যথাক্রমে ``nn.num_inputs`` এবং ``nn.num_weights``এর ইনপুট তথ্য ও ওয়েট (ওজন) লাগে। ``NeuralNetwork`` ইনপুটের ব্যাচিং সমর্থন করে এবং সংশ্লিষ্ট আকৃতির ফলাফলের ব্যাচ প্রদান করে।
de_de: Angenommen, ein ` ` NeuralNetwork ` ` ` namens ` ` nn ` `. Dann nimmt der ` `nn.forward (Eingabe, Gewichte) ` ` -Pass entweder flache Eingaben für die Daten und Gewichte der Größe ` `nn.num_inputs ` ` bzw. ` `nn.num_Gewichte ` ` an. ` ` NeuralNetwork ` ` unterstützt die Stapelung von Eingaben und gibt Chargen der Ausgabe der entsprechenden Form zurück.
el_gr: Ας υποθέσουμε ότι ένα ``NeuralNetwork`` ονομάζεται ``nn``. Στη συνέχεια, το ``nn.forward(input, weights)`` περνά είτε επίπεδες εισόδους για τα δεδομένα και τα βάρη του μεγέθους ``nn. um_inputs`` και ``nn.num_weights```, αντίστοιχα. ``NeuralNetwork`` υποστηρίζει παρτίδες εισόδου και επιστρέφει παρτίδες εξόδου του αντίστοιχου σχήματος.
fr_fr: Soit un ``NeuralNetwork`` appelé ``nn``. Alors, le ``nn.forward (input, wieghts)`` prend des entrées égales pour les données et les poids ``nn.num_inputs`` et ``nn.num_weights``, respectivement. ``NeuralNetwork`` prend en charge les entrées et renvoie les sorties selon la même forme.
hi_in: मान लीजिए कि एक ``न्यूरलनेटवर्क`` ``एनएन`` कहा जाता है। फिर, ``nn.forward(input, weights)`` पास क्रमशः `nn.num_inputs` और `nn.num_weights` आकार के डेटा और वज़न के लिए फ्लैट इनपुट लेता है। ``न्यूरलनेटवर्क` इनपुट के बैचिंग का समर्थन करता है और संबंधित आकार के आउटपुट के बैच लौटाता है।
ml_in: ``nn`` എന്ന് വിളിക്കുന്ന ഒരു ``NeuralNetwork`` കരുതുക. തുടർന്ന്, ``nn.forward(input, weights)`` പാസ് യഥാക്രമം ``nn.num_inputs``, ``nn.num_weights`` എന്നിവയുടെ വലുപ്പത്തിനും ഡാറ്റയ്‌ക്കുമുള്ള ഫ്ലാറ്റ് ഇൻ‌പുട്ടുകൾ‌ എടുക്കുന്നു. ``NeuralNetwork`` ഇൻപുട്ടുകൾ ബാച്ച് ചെയ്യുന്നതിനെ പിന്തുണയ്ക്കുകയും അനുബന്ധ ആകൃതിയുടെ (shape) ഔട്ട്‌പുട്ടിന്റെ ബാച്ചുകൾ നൽകുകയും ചെയ്യുന്നു.
pt_un: Suponha um ``NeuralNetwork`` chamado ``nn``. Então, o ``nn.forward(input, weights)`` passa a receber inputs planos para os dados e pesos de tamanho ``nn.num_inputs`` e ``nn.num_weights``, respectivamente. ``NeuralNetwork`` suporta lotes de inputs e retorna com lotes de outputs da forma correspondente.

source: 2. ``OpflowQNN``
bn_bn: ২. ``OpflowQNN``

source: The ``OpflowQNN`` takes a (parametrized) operator from Qiskit and leverages Qiskit’s gradient framework to provide the backward pass. Such an operator can for instance be an expected value of a quantum mechanical observable with respect to a parametrized quantum state. The Parameters can be used to load classical data as well as represent trainable weights. The ``OpflowQNN`` also allows lists of operators and more complex structures to construct more complex QNNs.
bn_bn: ``OpflowQNN`` Qiskit থেকে একটি (পরামিতিক বা প্যারামিট্রাইজড) অপারেটর নেয় এবং পিছনের পাসটি সরবরাহের জন্য Qiskit এর গ্রেডিয়েন্ট কাঠামোটি ব্যবহার করে। যেমন একটি অপারেটর একটি প্যারামিট্রাইজড কোয়ান্টাম অবস্থার (স্টেট) সাপেক্ষে কোয়ান্টাম যান্ত্রিক পর্যবেক্ষণটির প্রত্যাশিত মান হতে পারে। প্যারামিটারগুলি ধ্রুপদী (ক্লাসিক্যাল) তথ্য ( ডেটা ) লোড বা আনয়ন করার পাশাপাশি প্রশিক্ষণযোগ্য ওজন (ট্রেইনেবল ওয়েট) উপস্থাপন করতে ব্যবহার করা যেতে পারে। ``OpflowQNN`` অপারেটরগুলির তালিকা এবং আরও জটিল কাঠামোকে আরও জটিল কিউএনএন (QNN) তৈরি করার সুযোগ করে দেয়।
de_de: ``OpflowQNN`` nimmt einen (parametrisierten) Operator von Qiskit auf und nutzt Qiskits Gradient Framework, um den Backward-Pass bereitzustellen. Ein solcher Operator kann zum Beispiel der Erwartungswert einer quantenmechanischen Observablen sein, der in Bezug auf einen parametrisierten Quantenzustand beobachtet werden kann. Die Parameter können sowohl zum Laden klassischer Daten als auch zur Darstellung trainierbarer Gewichte verwendet werden. ``OpflowQNN`` erlaubt auch Listen von Operatoren und komplexere Strukturen um komplexere QNN zu konstruieren.
el_gr: Ο ``OpflowQNN`` παίρνει έναν (παραμετροποιημένο) χειριστή από το Qiskit και αξιοποιεί το πλαίσιο διαβάθμισης του Qiskit για να παρέχει το πίσω πέρασμα. Ένας τέτοιος χειριστής μπορεί για παράδειγμα να είναι μια αναμενόμενη τιμή ενός κβαντικού μηχανικού παρατηρούμενου σε σχέση με μια παραμετροποιημένη κβαντική κατάσταση. Οι παράμετροι μπορούν να χρησιμοποιηθούν για τη φόρτωση κλασικών δεδομένων καθώς και για την αναπαράσταση εκπαιδεύσιμων βαρών. Το ``OpflowQNN`` επιτρέπει επίσης λίστες χειριστών και πιο σύνθετες δομές για την κατασκευή πιο σύνθετων QNN.
fr_fr: ``OpflowQNN`` prend un opérateur (paramétrable) de Qiskit et s'appuie sur le cadre de gradient de Qiskit pour fournir le passage en arrière. Un tel opérateur peut par exemple être une valeur d'espérance d'un observable de mécanique quantique par rapport à un état quantique paramétré. Les paramètres peuvent être utilisés pour charger des données classiques ainsi que pour représenter des poids à entraîner. ``OpflowQNN`` permet également la création de listes d'opérateurs et de structures plus complexes pour construire des réseaux de neurones quantiques plus complexes.
hi_in: ``OpflowQNN` किस्किट से एक (पैरामीट्रिज्ड) ऑपरेटर लेता है और पश्चवर्ती पास प्रदान करने के लिए किस्किट के ग्रेडिएंट फ्रेमवर्क का लाभ उठाता है। उदाहरण के लिए, ऐसा ऑपरेटर पैरामीट्रिज्ड क्वांटम अवस्था के संबंध में देखने योग्य क्वांटम मैकेनिकल का अपेक्षित मूल्य हो सकता है। पैरामीटर का उपयोग प्रतिष्ठित आँकड़ो को लोड करने के साथ-साथ प्रशिक्षित वजन का प्रतिनिधित्व करने के लिए किया जा सकता है। ``OpflowQNN`` ऑपरेटरों की सूची और अधिक जटिल संरचनाओं को अधिक जटिल QNN बनाने की अनुमति देता है।
ml_in: ``OpflowQNN`` ക്വിസ്കിറ്റിൽ‌ നിന്നും ഒരു (പാരാമീറ്ററൈസ്ഡ്) ഓപ്പറേറ്ററെടുക്കുകയും ബാക്ക്‌വേർ‌ഡ് പാസ് നൽ‌കുന്നതിന് ക്വിസ്കിറ്റിന്റെ ഗ്രേഡിയൻറ് ഫ്രെയിംവർ‌ക്കിനെ പരമാവധി ഉപയോഗപെടുത്തുന്നു. അത്തരമൊരു ഓപ്പറേറ്ററിന് ഒരു പാരാമീറ്ററൈസ്ഡ് ക്വാണ്ടം അവസ്ഥയുമായി(Quantum State) ബന്ധപ്പെട്ട് നിരീക്ഷിക്കാവുന്ന ഒരു ക്വാണ്ടം മെക്കാനിക്കലിന്റെ പ്രതീക്ഷിത മൂല്യമാകാം. ക്ലാസിക്കൽ ഡാറ്റ ലോഡുചെയ്യുന്നതിനും പരിശീലിപ്പിക്കാവുന്ന ഭാരം പ്രതിനിധീകരിക്കുന്നതിനും പാരാമീറ്ററുകൾ ഉപയോഗിക്കാം. കൂടുതൽ‌ സങ്കീർ‌ണ്ണമായ QNN കൾ‌ നിർമ്മിക്കുന്നതിന് ഓപ്പറേറ്റർ‌മാരുടെ പട്ടികകളും കൂടുതൽ‌ സങ്കീർ‌ണ്ണ ഘടനകളും ``OpflowQNN`` അനുവദിക്കുന്നു.
pt_un: O ``OpflowQNN`` recebe um operador (parametrizado) do Qiskit e alavanca o framework gradiente do Qiskit para fornecer o passe para trás. Tal operador pode por exemplo ser um valor esperado de um quantum mecânico observável com respeito a um estado quantum parametrizado. Os parâmetros podem ser usados para carregar dados clássicos e também para representar pesos treináveis. O ``OpflowQNN`` também permite lista de operadores e estruturas mais complexas para construir QNNs mais complexos.
