Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/01_neural_networks.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, hi_in, ja, ml_in, pt_un, ta, zh_tw

source: This page was generated from `docs/tutorials/01_neural_networks.ipynb`__.
bn_bn: এই পাতাটি `docs/tutorials/01_neural_networks.ipynb`__ থেকে তৈরি হয়েছে।
es_un: Esta página fue generada a partir de `docs/tutorials/01_neural_networks.ipynb`__.
fr_fr: Cette page a été générée à partir de ` docs/tutorials/01_neural_networks.ipynb ` __.
ja: このページは `docs/tutorials/01_neural_networks.ipynb`__ から生成されました。
pt_un: Esta página foi gerada a partir de `docs/tutorials/01_neural_networks.ipynb`__.
ta: இந்தப் பக்கம் `docs/tutorials/01_neural_networks.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
zh_tw: 此頁面是從 `docs/tutorials/01_neural_networks.ipynb`__ 產生的。

source: Quantum Neural Networks
bn_bn: কোয়ান্টাম নিউরাল নেটওয়ার্ক
de_de: Neuronale Quantennetze
el_gr: Κβαντικά Νευρωνικά Δίκτυα
es_un: Redes Neuronales Cuánticas
fr_fr: Réseaux de neurones quantiques
hi_in: क्वांटम न्यूरल नेटवर्क
ja: 量子ニューラル・ネットワーク
ml_in: ക്വാണ്ടം ന്യൂറൽ നെറ്റ്‌വർക്കുകൾ
pt_un: Redes Neurais Quânticas
ta: குவாண்டம் நியூரல் நெட்வொர்க்குகள்
zh_tw: 量子神經網絡

source: Overview
es_un: Descripción General
ja: 概要
ta: கண்ணோட்டம்

source: This notebook demonstrates different quantum neural network (QNN) implementations provided in ``qiskit-machine-learning``, and how they can be integrated into basic quantum machine learning (QML) workflows.
es_un: Este cuaderno muestra diferentes implementaciones de redes neuronales cuánticas (quantum neural network, QNN) proporcionadas en ``qiskit-machine-learning``, y cómo se pueden integrar en flujos de trabajo básicos de machine learning cuántico (quantum machine learning, QML).
ja: このノートブックでは、 ``qiskit-machine-learning`` で提供されるさまざまな量子ニューラルネットワーク (QNN) の実装と、それらを基本的な量子機械学習 (QML) ワークフローに統合する方法について説明します。
ta: குறிப்பேடு.

source: The tutorial is structured as follows:
es_un: El tutorial está estructurado de la siguiente manera:
ja: このチュートリアルの構造は以下のとおりです。
ta: பயிற்சி பின்வருமாறு கட்டப்பட்டிருக்கிறது:

source: `Introduction <#1.-Introduction>`__
es_un: `Introducción <#1.-Introducción>`__
ja: `はじめに <#1.-Introduction>`__
ta: முன்னுரை <#1.-Introduction>`__

source: `How to Instantiate QNNs <#2.-How-to-Instantiate-QNNs>`__
es_un: `Cómo Instanciar QNNs <#2.-Cómo-Instanciar-QNNs>`__
ja: `QNNをインスタンス化する方法 <#2. - How-to-Instantiate-QNNs>`__
ta: `எப்படி QNNகளை உடனுக்குடன் உருவாக்குவது <#2.-How-to-Instantiate-QNNs>`__

source: `How to Run a Forward Pass <#3.-How-to-Run-a-Forward-Pass>`__
es_un: `Cómo Ejecutar un Paso hacia Adelante <#3.-Cómo-Ejecutar-un-Paso-hacia-Adelante>`__
ja: `フォワード・パスの実行方法 <#3.-How-to-Run-a-Forward-Pass>`__
ta: `ஃபார்வர்டு பாஸை எப்படி இயக்குவது <#3.-How-to-Run-a-Forward-Pass>`__

source: `How to Run a Backward Pass <#4.-How-to-Run-a-Backward-Pass>`__
es_un: `Cómo Ejecutar un Paso hacia Atrás <#4.-Cómo-Ejecutar-un-Paso-hacia-Atrás>`__
ja: `バックワード・パスの実行方法 <#4.-How-to-Run-a-Backward-Pass>`__
ta: `எப்படி பேக்வர்ட் பாஸை இயக்குவது <#4.-How-to-Run-a-Backward-Pass>`__

source: `Advanced Functionality <#5.-Advanced-Functionality>`__
es_un: `Funcionalidad Avanzada <#5.-Funcionalidad-Avanzada>`__
ja: `拡張機能 <#5.-Advanced-Functionality>`__
ta: `மேம்பட்ட செயல்பாடு <#5.-மேம்பட்ட-செயல்பாடு>`__

source: `Conclusion <#6.-Conclusion>`__
es_un: `Conclusión <#6.-Conclusión>`__
ja: `結論 <#6.-Conclusion>`__
ta: `முடிவு <#6.-முடிவு>`__

source: 1. Introduction
es_un: 1. Introducción
ja: 1. はじめに
ta: 1. முன்னுரை

source: 1.1. Quantum vs. Classical Neural Networks
ja: 1.1. 量子対古典的ニューラルネットワーク
ta: 1.1 குவாண்டம் எதிராகக் கிளாசிக்கல் நியூரல் நெட்வொர்க்குகள்

source: Classical neural networks are algorithmic models inspired by the human brain that can be trained to recognize patterns in data and learn to solve complex problems. They are based on a series of interconnected nodes, or *neurons*, organized in a layered structure, with parameters that can be learned by applying machine or deep learning training strategies.
es_un: Las redes neuronales clásicas son modelos algorítmicos inspirados en el cerebro humano que se pueden entrenar para reconocer patrones en los datos y aprender a resolver problemas complejos. Se basan en una serie de nodos interconectados, o *neuronas*, organizados en una estructura en capas, con parámetros que se pueden aprender aplicando estrategias de entrenamiento de machine learning o deep learning.
ja: 古典的なニューラルネットワークは、人間の脳に触発されたアルゴリズム・モデルで、データのパターンを認識し、複雑な問題の解決を学習できます。 一連の相互接続されたノード (*ニューロン*) が基礎となり、層構造で構成され、機械学習や深層学習の戦略を適用することで学習できるパラメーターから成ります。
ta: கிளாசிக்கல் நியூரல் நெட்வொர்க்குகள் மனித மூளையால் ஈர்க்கப்பட்ட அல்காரிதம் மாதிரிகள் ஆகும், அவை தரவுகளில் உள்ள வடிவங்களை அடையாளம் காணவும் கடினமான சிக்கல்களைத் தீர்க்க கற்றுக்கொள்ளவும் பயிற்சியளிக்கப்படுகின்றன. அவை ஒன்றோடொன்று இணைக்கப்பட்ட முனைகளின் வரிசையை அடிப்படையாகக் கொண்டவை, அல்லது *நியூரான்கள்*, ஒரு அடுக்கு அமைப்பில் ஒழுங்கமைக்கப்பட்டவை, இயந்திரம் அல்லது ஆழ்ந்த கற்றல் பயிற்சி உத்திகளைப் பயன்படுத்துவதன் மூலம் கற்றுக்கொள்ளக்கூடிய அளவுருக்கள்.

source: The motivation behind quantum machine learning (QML) is to integrate notions from quantum computing and classical machine learning to open the way for new and improved learning schemes. QNNs apply this generic principle by combining classical neural networks and parametrized quantum circuits. Because they lie at an intersection between two fields, QNNs can be viewed from two perspectives:
es_un: La motivación detrás del machine learning cuántico (QML) es integrar nociones de computación cuántica y de machine learning clásico para abrir el camino a esquemas de aprendizaje nuevos y mejorados. Las QNNs aplican este principio genérico al combinar redes neuronales clásicas y circuitos cuánticos parametrizados. Debido a que se encuentran en una intersección entre dos campos, las QNNs se pueden ver desde dos perspectivas:
ja: 量子機械学習 (QML) の背後にある動機は、量子コンピューティングと古典的機械学習からの概念を統合し、新しくかつ改良された学習スキームの方法を開くことです。QNN は、古典的なニューラルネットワークとパラメーター化された量子回路を結合することにより、この一般的な原理を適用します。2 つの分野間の交差点に位置するため、 QNN は次の 2 つの観点から見ることができます。
ta: குவாண்டம் மெஷின் லேர்னிங்கின் (க்யூஎம்எல்) உந்துதல், குவாண்டம் கம்ப்யூட்டிங் மற்றும் கிளாசிக்கல் மெஷின் லேர்னிங்கில் இருந்து புதிய மற்றும் மேம்படுத்தப்பட்ட கற்றல் திட்டங்களுக்கு வழி திறக்கும் கருத்துக்களை ஒருங்கிணைப்பதாகும். கிளாசிக்கல் நியூரல் நெட்வொர்க்குகள் மற்றும் அளவுருக் குவாண்டம் சுற்றுகளை இணைப்பதன் மூலம் QNNகள் இந்த பொதுவான கொள்கையைப் பயன்படுத்துகின்றன. அவை இரண்டு புலங்களுக்கு இடையில் ஒரு குறுக்குவெட்டில் இருப்பதால், QNNகளை இரண்டு கண்ணோட்டங்களில் பார்க்க முடியும்:

source: From a **machine learning perspective**, QNNs are, once again, algorithmic models that can be trained to find hidden patterns in data in a similar manner to their classical counterparts. These models can **load** classical data (**inputs**) into a quantum state, and later **process** it with quantum gates parametrized by **trainable weights**. Figure 1 shows a generic QNN example including the data loading and processing steps. The output from measuring this state can then be plugged into a loss function to train the weights through backpropagation.
es_un: Desde una **perspectiva de machine learning**, las QNNs son, una vez más, modelos algorítmicos que se pueden entrenar para encontrar patrones ocultos en los datos de manera similar a sus contrapartes clásicas. Estos modelos pueden **cargar** datos clásicos (**entradas**) en un estado cuántico, y luego **procesarlos** con compuertas cuánticas parametrizadas por **pesos entrenables**. La Figura 1 muestra un ejemplo genérico de QNN que incluye los pasos de carga y procesamiento de datos. La salida de la medición de este estado se puede conectar a una función de pérdida para entrenar los pesos (ponderaciones) a través de la retropropagación.
ja: **機械学習の観点**から言うと、 QNN は、改めて、古典的なものと同様にデータの隠れたパターンを見つけるために訓練できるアルゴリズム・モデルです。 これらのモデルは、古典データ (**入力**) を量子状態に **読み込む** ことができ、**訓練可能な重み** によりパラメーター化された量子ゲートとともに **処理** されます。 図1は、データの読み込みおよび処理のステップを含む、汎用 QNN の例を示しています。 この状態を測定した出力を損失関数に差し込んで、誤差逆伝播法を通して重みを訓練することができます。
ta: ஒரு **இயந்திர கற்றல் கண்ணோட்டத்தில்**, QNNகள் மீண்டும் ஒருமுறை, அவற்றின் கிளாசிக்கல் சகாக்களுக்கு ஒத்த முறையில் தரவுகளில் மறைந்திருக்கும் வடிவங்களைக் கண்டறிய பயிற்சியளிக்கப்படும் அல்காரிதம் மாதிரிகள் ஆகும். இந்த மாதிரிகள் **லோட்** கிளாசிக்கல் தரவை (**உள்ளீடுகள்**) ஒரு குவாண்டம் நிலையில், பின்னர் **செயல்படுத்தும்** **பயிற்சி செய்யக்கூடிய எடைகள்** மூலம் குவாண்டம் கேட் அளவுருக்களுடன். தரவு ஏற்றுதல் மற்றும் செயலாக்க படிகள் உட்பட பொதுவான QNN உதாரணத்தை படம் 1 காட்டுகிறது. இந்த நிலையை அளப்பதன் மூலம் கிடைக்கும் வெளியீடு, பின் பரப்புதல் மூலம் எடைகளைப் பயிற்றுவிக்க இழப்புச் செயல்பாட்டில் செருகப்படலாம்.

source: From a **quantum computing perspective**, QNNs are quantum algorithms based on parametrized quantum circuits that can be trained in a variational manner using classical optimizers. These circuits contain a **feature map** (with input parameters) and an **ansatz** (with trainable weights), as seen in Figure 1.
es_un: Desde la **perspectiva de la computación cuántica**, las QNNs son algoritmos cuánticos basados en circuitos cuánticos parametrizados que se pueden entrenar de forma variacional utilizando optimizadores clásicos. Estos circuitos contienen un **mapa de características** (con parámetros de entrada) y un **ansatz** (con pesos entrenables), como se ve en la Figura 1.
ja: **量子コンピューティングの観点** から言うと、QNNはパラメーター化された量子回路に基づいた量子アルゴリズムで、古典的なオプティマイザーを使用して変分法で訓練することができます。 これらの回路には、図1に示すように **フィーチャーマップ** (入力パラメーター付き) と **ansatz** (訓練可能な重み付き) が含まれています。
ta: ஒரு **குவாண்டம் கம்ப்யூட்டிங் கண்ணோட்டத்தில்**, QNNகள் குவாண்டம் அல்காரிதங்கள் ஆகும், அவை அளவுரு குவாண்டம் சர்க்யூட்களை அடிப்படையாகக் கொண்டவை, அவை கிளாசிக்கல் ஆப்டிமைசர்களைப் பயன்படுத்தி மாறுபட்ட முறையில் பயிற்சியளிக்கப்படலாம். இந்த சுற்றுகள் படம் 1 இல் காணப்படுவது போல் **அம்ச வரைபடம்** (உள்ளீட்டு அளவுருக்களுடன்) மற்றும் **ansatz** (பயிற்சிக்கு ஏற்ற எடைகளுடன்) உள்ளன.

source: *Figure 1. Generic quantum neural network (QNN) structure.*
es_un: *Figura 1. Estructura genérica de una red neuronal cuántica (QNN).*
ja: *図1. 一般的な量子ニューラルネットワーク(QNN) の構造*
ta: *படம் 1. பொதுவான குவாண்டம் நியூரல் நெட்வொர்க் (QNN) அமைப்பு.*

source: As you can see, these two perspectives are complementary, and do not necessarily rely on strict definitions of concepts such as "quantum neuron" or what constitutes a QNN's "layer".
ja: ご覧の通り、これらの 2 つの視点は補完なものであり、必ずしも「量子ニューロン」や QNNの「層」といった概念の厳密な定義に依存するわけではありません。
ta: நீங்கள் பார்க்கிறபடி, இந்த இரண்டு முன்னோக்குகளும் ஒன்றுக்கொன்று நிரப்புகின்றன, மேலும் அவை "குவாண்டம் நியூரான்" அல்லது QNN இன் "அடுக்கு" போன்ற கருத்துகளின் கடுமையான வரையறைகளை நம்பியிருக்க வேண்டிய அவசியமில்லை.

source: 1.2. Implementation in ``qiskit-machine-learning``
es_un: 1.2. Implementación en ``qiskit-machine-learning``
ja: 1.2. ``qiskit-machine-learning`` での実装
ta: 1.2 ``கிஸ்கிட்-மெஷின்-லேர்னிங்`` இல் செயல்படுத்துதல்

source: The QNNs in ``qiskit-machine-learning`` are meant as application-agnostic computational units that can be used for different use cases, and their setup will depend on the application they are needed for. The module contains an interface for the QNNs and two specific implementations:
es_un: Las QNNs en ``qiskit-machine-learning`` están pensadas como unidades computacionales independientes de la aplicación en las que se pueden usar para diferentes casos de uso, y su configuración dependerá de la aplicación para la que se necesiten. El módulo contiene una interfaz para las QNNs y dos implementaciones específicas:
ja: ``qiskit-machine-learning`` の QNN は、さまざまなユースケースで使用できるアプリケーションに依存しない計算ユニットとして使用されます。 それらの設定は必要なアプリケーションによって異なります このモジュールには、QNNのインターフェースと 2 つの特定の実装が含まれています。
ta: ``qiskit-machine-learning`` இல் உள்ள QNNகள் வெவ்வேறு பயன்பாட்டு நிகழ்வுகளுக்குப் பயன்படுத்தக்கூடிய பயன்பாட்டு-அஞ்ஞானக் கணக்கீட்டு அலகுகளாகக் குறிக்கப்படுகின்றன, மேலும் அவற்றின் அமைப்பு அவை தேவைப்படும் பயன்பாட்டைப் பொறுத்தது. தொகுதி QNNகளுக்கான இடைமுகம் மற்றும் இரண்டு குறிப்பிட்ட செயலாக்கங்களைக் கொண்டுள்ளது:

source: `NeuralNetwork <https://qiskit.org/ecosystem/machine-learning/stubs/qiskit_machine_learning.neural_networks.NeuralNetwork.html>`__: The interface for neural networks. This is an abstract class all QNNs inherit from.
ta: `NeuralNetwork <https://qiskit.org/ecosystem/machine-learning/stubs/qiskit_machine_learning.neural_networks.NeuralNetwork.html>`__: நரம்பியல் நெட்வொர்க்குகளுக்கான இடைமுகம். இது அனைத்து QNNகளும் பெறப்பட்ட ஒரு சுருக்க வகுப்பாகும்.

source: `EstimatorQNN <https://qiskit.org/ecosystem/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__: A network based on the evaluation of quantum mechanical observables.
ta: `EstimatorQNN <https://qiskit.org/ecosystem/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__: குவாண்டம் மெக்கானிக்கல் அவதானிப்புகளின் மதிப்பீட்டின் அடிப்படையில் ஒரு நெட்வொர்க்.

source: `SamplerQNN <https://qiskit.org/ecosystem/machine-learning/locale/fr_FR/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__: A network based on the samples resulting from measuring a quantum circuit.
ta: `SamplerQNN <https://qiskit.org/ecosystem/machine-learning/locale/fr_FR/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__: ஒரு சர்க்யூட் அளவை அளப்பதன் விளைவாக உருவான மாதிரிகளின் அடிப்படையில் ஒரு நெட்வொர்க்.

source: These implementations are based on the `qiskit primitives <https://qiskit.org/documentation/apidoc/primitives.html>`__. The primitives are the entry point to run QNNs on either a simulator or real quantum hardware. Each implementation, ``EstimatorQNN`` and ``SamplerQNN``, takes in an optional instance of its corresponding primitive, which can be any subclass of ``BaseEstimator`` and ``BaseSampler``, respectively.
es_un: Estas implementaciones se basan en las `primitivas de qiskit <https://qiskit.org/documentation/apidoc/primitives.html>`__. Las primitivas son el punto de entrada para ejecutar QNNs en un simulador o en hardware cuántico real. Cada implementación, ``EstimatorQNN`` y ``SamplerQNN``, toma una instancia opcional de su primitiva correspondiente, que puede ser cualquier subclase de ``BaseEstimator`` y ``BaseSampler``, respectivamente.
ja: これらの実装は `qiskit primitive <https://qiskit.org/documentation/apidoc/primitives.html>`__ に基づいています。 primitiveは、シミュレーターまたは実際の量子ハードウェア上で QNN を実行するエントリー・ポイントです。 それぞれの実装である ``EstimatorQNN`` と ``SamplerQNN`` は、対応するprimitive (``BaseEstimator`` と ``BaseSampler`` の任意のサブクラス) のオプション・インスタンスを取り込みます。
ta: இந்தச் செயலாக்கங்கள் `qiskit primitives <https://qiskit.org/documentation/apidoc/primitives.html>`__ ஐ அடிப்படையாகக் கொண்டவை. சிமுலேட்டர் அல்லது உண்மையான குவாண்டம் வன்பொருளில் QNNகளை இயக்குவதற்கான நுழைவுப் புள்ளியாக ப்ரிமிடிவ்கள் உள்ளன. ஒவ்வொரு செயலாக்கமும், ``EstimatorQNN`` மற்றும் ``SamplerQNN``, அதனுடன் தொடர்புடைய பழமையான ஒரு விருப்ப நிகழ்வை எடுத்துக்கொள்கிறது, இது முறையே ``BaseEstimator`` மற்றும் ``BaseSampler`` இன் துணைப்பிரிவாக இருக்கலாம்.

source: The ``qiskit.primitives`` module provides a reference implementation for the ``Sampler`` and ``Estimator`` classes to run statevector simulations. By default, if no instance is passed to a QNN class, an instance of the corresponding reference primitive (``Sampler`` or ``Estimator``) is created automatically by the network. For more information about primitives please refer to the `primitives documentation <https://qiskit.org/documentation/apidoc/primitives.html>`__.
es_un: El módulo ``qiskit.primitives`` proporciona una implementación de referencia para las clases ``Sampler`` y ``Estimator`` para ejecutar simulaciones de vectores de estado. De forma predeterminada, si no se pasa ninguna instancia a una clase QNN, la red crea automáticamente una instancia de la primitiva de referencia correspondiente (``Sampler`` o ``Estimator``). Para obtener más información sobre las primitivas, consulta la `documentación de las primitivas <https://qiskit.org/documentation/apidoc/primitives.html>`__.
ja: ``qiskit.primitives`` モジュールは、状態ベクトル・シミュレーションを実行するための ``Sampler`` と ``Estimator`` クラスの参照実装を提供します。 デフォルトでは、QNNクラスにインスタンスが渡されていない場合、対応する参照primitiveのインスタンス (``Sampler`` または ``Estimator``) は、ネットワークによって自動的に作成されます。 primitiveについての詳細は、 `primitiveドキュメント <https://qiskit.org/documentation/apidoc/primitives.html>`__ を参照してください。
ta: ``qiskit.primitives`` தொகுதியானது ஸ்டேட்வெக்டர் உருவகப்படுத்துதல்களை இயக்க ``மாதிரி`` மற்றும் ``மதிப்பீட்டாளர்`` வகுப்புகளுக்கான குறிப்புச் செயலாக்கத்தை வழங்குகிறது. முன்னிருப்பாக, QNN வகுப்பிற்கு எந்த நிகழ்வும் அனுப்பப்படவில்லை எனில், அதனுடன் தொடர்புடைய முதன்மையான (``Sampler`` அல்லது ``Estimator``) ஒரு நிகழ்வு பிணையத்தால் தானாகவே உருவாக்கப்படும். ப்ரிமிடிவ்ஸ் பற்றிய கூடுதல் தகவலுக்கு, தயவு செய்து `primitives documentation <https://qiskit.org/documentation/apidoc/primitives.html>`__ ஐப் பார்க்கவும்.

source: The ``NeuralNetwork`` class is the interface for all QNNs available in ``qiskit-machine-learning``. It exposes a forward and a backward pass that take data samples and trainable weights as input.
es_un: La clase ``NeuralNetwork`` es la interfaz para todas las QNNs disponibles en ``qiskit-machine-learning``. Expone un paso hacia adelante y hacia atrás que toman muestras de datos y pesos entrenables como entrada.
ja: ``NeuralNetwork`` クラスは、``qiskit-machine-learning`` で利用可能なすべての QNN のインターフェイスです。 これは、データ・サンプルと訓練可能な重みを入力として取るフォワードおよびバックワード・パスを公開します。
ta: ``நியூரல்நெட்வொர்க்`` வகுப்பு என்பது ``கிஸ்கிட்-மெஷின்-லேர்னிங்`` இல் கிடைக்கும் அனைத்து QNNகளுக்கான இடைமுகமாகும். தரவு மாதிரிகள் மற்றும் பயிற்சியளிக்கக்கூடிய எடைகளை உள்ளீடாக எடுக்கும் முன்னோக்கி மற்றும் பின்தங்கிய பாஸை இது வெளிப்படுத்துகிறது.

source: It's important to note that ``NeuralNetwork``\ s are "stateless". They do not contain any training capabilities (these are pushed to the actual algorithms or applications: `classifiers <https://qiskit.org/ecosystem/machine-learning/apidocs/qiskit_machine_learning.algorithms.html#classifiers>`__, `regressors <https://qiskit.org/ecosystem/machine-learning/apidocs/qiskit_machine_learning.algorithms.html#regressors>`__, etc), nor do they store the values for trainable weights.
ta: ``நியூரல்நெட்வொர்க்``\கள் "நிலையற்றவை" என்பதைக் கவனத்தில் கொள்ள வேண்டியது அவசியம். அவற்றில் எந்தப் பயிற்சித் திறன்களும் இல்லை (இவை உண்மையான வழிமுறைகள் அல்லது பயன்பாடுகளுக்குத் தள்ளப்படுகின்றன: <https://qiskit.org/ecosystem/machine-learning/apidocs/qiskit_machine_learning.algorithms.html

source: Let's now look into specific examples for the two ``NeuralNetwork`` implementations. But first, let's set the algorithmic seed to ensure that the results don't change between runs.
ja: では、2 つの ``NeuralNetwork`` 実装の具体的な例を見てみましょう。 しかし、まず、実行間で結果が変わらないようにアルゴリズムのシードを設定しましょう。
ta: இரண்டு ``நியூரல் நெட்வொர்க்`` செயல்படுத்தலுக்கான குறிப்பிட்ட உதாரணங்களை இப்போது பார்க்கலாம். ஆனால் முதலில், ரன்களுக்கு இடையில் முடிவுகள் மாறாமல் இருப்பதை உறுதிசெய்ய அல்காரிதம் விதையை அமைப்போம்.

source: 2. How to Instantiate QNNs
es_un: 2. Cómo Instanciar QNNs
ja: 2. QNNをインスタンス化する方法
ta: 2. QNNகளை எவ்வாறு உடனடியாக உருவாக்குவது

source: 2.1. ``EstimatorQNN``
ta: 2.1. ``எஸ்டிமேட்டர்QNN``

source: The ``EstimatorQNN`` takes in a parametrized quantum circuit as input, as well as an optional quantum mechanical observable, and outputs expectation value computations for the forward pass. The ``EstimatorQNN`` also accepts lists of observables to construct more complex QNNs.
es_un: La ``EstimatorQNN`` toma como entrada un circuito cuántico parametrizado, así como un observable mecánico cuántico opcional, y genera cálculos de valor esperado para el paso hacia adelante. La ``EstimatorQNN`` también acepta listas de observables para construir QNNs más complejas.
ja: ``EstimatorQNN`` は、オプションの量子力学的観測可能量と同様に、パラメーター化された量子回路を入力として取り込み、フォワード・パスの期待値計算を出力します。 ``EstimatorQNN`` は、より複雑な QNN を構築するために観測量のリストも受け入れます。
ta: ` ` EstimatorQNN ` ` எடுத்துக்காட்டு ஒரு பராமரிப்பு வளிமண்டல சுற்றுச்சூழல் உள்ளீடு, மற்றும் ஒரு விருப்பமான கோட்பாடு යාන්ත්රික கணக்கீடும், மற்றும் முன்னணி மதிப்பு கணக்கீடுகளின் மதிப்பு கணக்கீடுகள். ` ` EstimatorQNN ` ` மேலும் சிக்கலான QNNகளை உருவாக்க ஆவணங்களின் பட்டியல்களை ஏற்றுக்கொள்கிறது.

source: Let's see an ``EstimatorQNN`` in action with a simple example. We start by constructing the parametrized circuit. This quantum circuit has two parameters, one represents a QNN input and the other represents a trainable weight:
ja: 簡単な例を使って、 ``EstimatorQNN`` の動きを見てみましょう。パラメーター化回路の構築から始めます。この量子回路には2つのパラメータがあります。1つはQNNの入力を表し、もう1つは訓練可能な重みを表します。
ta: ஒரு எளிய எடுத்துக்காட்டு நடவடிக்கையில் ` ` EstimatorQNN ` ` பார்க்கலாம். நாம் பராமரிப்பு சுற்றுப்பாதை கட்டி தொடங்கினோம். இந்த குவாண்ட் சுற்றுச்சொல் இரண்டு அளபுருக்கள் கொண்டது, ஒரு QNN உள்ளீட்டை குறிக்கும் மற்றொன்று ஒரு சுழல் எடை குறிக்கிறது:

source: We can now create an observable to define the expectation value computation. If not set, then the ``EstimatorQNN`` will automatically create the default observable :math:`Z^{\otimes n}`. Here, :math:`n` is the number of qubits of the quantum circuit.
es_un: Ahora podemos crear un observable para definir el cálculo del valor esperado. Si no se establece, ``EstimatorQNN`` creará automáticamente el observable predeterminado :math:`Z^{\otimes n}`. Aquí, :math:`n` es el número de qubits del circuito cuántico.
ja: これで、期待値計算を定義するための観測量を作成できるようになりました。 設定していない場合、 ``EstimatorQNN`` は自動的にデフォルトの観測量 :math:`Z^{\otimes n}` :math:を作成します。 ここで、:math:`n` は量子回路の量子ビット数です。
ta: நாம் இப்பொழுது எதிர்பார்ப்பு மதிப்பு கணக்கெடுப்பை வரையறுக்கப்பட முடியும். அமைக்கப்படவில்லை என்றால், ` ` EstimatorQNN ` ` தானாகவே முன்னிருப்பாக :math:` Z ^ {\otimes n} `. இங்கு, :math:` n `. குவாண்ட் சுற்றுப்பின் எண்ணிக்கை.

source: In this example, we will change things up and use the :math:`Y^{\otimes n}` observable:
es_un: En este ejemplo, cambiaremos las cosas y usaremos el observable :math:`Y^{\otimes n}`:
ja: この例では、一転して :math:`Y^{\otimes n}` 観測量を使用します。
ta: இந்த உதாரணத்தில், நாம் விஷயத்தை மாற்ற மற்றும் :math:` Y ^ {\otimes n} ` பார்வை:

source: Together with the quantum circuit defined above, and the observable we have created, the ``EstimatorQNN`` constructor takes in the following keyword arguments:
es_un: Junto con el circuito cuántico definido anteriormente y el observable que hemos creado, el constructor de ``EstimatorQNN`` toma los siguientes argumentos de palabras clave:
ja: 上記で定義された量子回路と作成した観測量と共に、 ``EstimatorQNN`` のコンストラクタは次のキーワード引数を取ります。
ta: மேலே வரையறுக்கப்பட்ட குவாண்டம் சுற்றியோடு, மற்றும் நாம் உருவாக்க முடியும், ` ` EstimatorQNN ` ` கட்டமைப்புகள் பின்வரும் விசைப்புச் சொற்களில் எடுத்துக்கொள்கிறது:

source: ``estimator``: optional primitive instance
es_un: ``estimator``: instancia primitiva opcional
ja: ``estimator``: オプションのprimitiveインスタンス
ta: ``மதிப்பீடு``: விருப்பமான பழமையான நிகழ்வு

source: ``input_params``: list of quantum circuit parameters that should be treated as "network inputs"
ja: ``input_params``: 「ネットワーク入力」として扱うべき量子回路パラメーターのリスト
ta: ``input_params``: "நெட்வொர்க் உள்ளீடுகள்" எனக் கருதப்பட வேண்டிய குவாண்டம் சர்க்யூட் அளவுருக்களின் பட்டியல்

source: ``weight_params``: list of quantum circuit parameters that should be treated as "network weights"
ja: ``weight_params``:「ネットワークの重み」として扱われるべき量子回路パラメーターのリスト
ta: ``weight_params``: "நெட்வொர்க் எடைகள்" எனக் கருதப்பட வேண்டிய குவாண்டம் சர்க்யூட் அளவுருக்களின் பட்டியல்
