Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/01_neural_networks.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, hi_in, ja, ml_in, pt_un, ta, zh_tw

source: Combining multiple observables in a ``ListOp`` also allows to create more complex QNNs
bn_bn: একাধিক পর্যবেক্ষণযোগ্য (অবজারভেবল) বিষয়কে ``ListOp`` এ এক করে আরও জটিল QNN বানানো সম্ভব​
de_de: Die Kombination mehrerer Observables in einem ``ListOp`` erlaubt es auch die Erstellung komplexerer QNN
fr_fr: La combinaison de plusieurs observables dans une ``ListOp`` permet également de créer des réseaux de neurones quantiques plus complexes
hi_in: एक ``ListOp`` में कई वेधशालाओं का संयोजन भी अधिक जटिल QNN बनाने की अनुमति देता है
ml_in: ``ListOp`` -ൽ ഒന്നിലധികം നിരീക്ഷണങ്ങൾ സംയോജിപ്പിക്കുന്നത് കൂടുതൽ സങ്കീർണ്ണമായ QNN- കൾ സൃഷ്ടിക്കാൻ അനുവദിക്കുന്നു
pt_un: Combinando múltiplos observáveis em uma ``ListOp`` também permite criar QNNs mais complexos
zh_tw: 您還可以通過將多個在``ListOp``觀察量結合來創建更複雜的 QNNs。

source: 3. ``TwoLayerQNN``
bn_bn: ৩. ``TwoLayerQNN``
de_de: 3. ``TwoLayerQN``

source: The ``TwoLayerQNN`` is a special ``OpflowQNN`` on :math:`n` qubits that consists of first a feature map to insert data and second an ansatz that is trained. The default observable is :math:`Z^{\otimes n}`, i.e., parity.
bn_bn: ``TwoLayerQNN`` হল :math:`n` কিউবিটসমূহের ওপর একটি বিশেষ ``OpflowQNN`` যাতে প্রথমে তথ্য (ডেটা) সন্নিবেশ করানোর জন্য একটি বৈশিষ্ট্য নকশা (ফিচার ম্যাপ) এবং একটি প্রশিক্ষিত (ট্রেইনড) ansatz থাকে। প্রাথমিক পর্যবেক্ষণযোগ্য বিষয় হলো :math:`Z^{\otimes n}`, উদাহরণস্বরূপ, সমতা (প্যারিটি) ।
de_de: ``TwoLayerQN`` ist ein spezielles ``OpflowQNN`` auf :math:`n` Qubit, das erstens aus einer Feature-Map zum Einfügen von Daten und zweitens einem trainierten Ansatz. Die standardmäßige Observable ist :math:`Z^{\otimes n}`, d.h. die Parität.
el_gr: Το ` ` ` TwoLayerQNN ` ` είναι ένα ειδικό ` ` OpflowQNN ` ` σε :math:` n ` qubits που αποτελείται από ένα χάρτη χαρακτηριστικών για την εισαγωγή δεδομένων και τη δεύτερη ansatz που εκπαιδεύεται. Η προεπιλεγμένη τιμή είναι :math:` Z ^ {\oφορές n} `, δηλαδή, ισοτιμία.
fr_fr: ``TwoLayerQNN`` est un ``OpflowQNN`` spécial sur les qubits :math:`n` qui consiste en une première carte de features pour insérer des données et un ansatz qui est entraîné. L'observable par défaut est :math:`Z^{\otimes n}`, c'est-à-dire la parité.
hi_in: ``TwoLayerQNN`` :math:`n`कुबित्स जो पहले आँकड़ो को डालने के लिए एक फीचर मैप और दूसरा प्रशिक्षित ansatz से बनी होती है पर एक विशेष ``OpflowQNN`` है। वितथ अवलोकन योग्य है: गणित: `Z ^ {\ otimes n}`, यानी, समता।
ml_in: ``TwoLayerQNN`` എന്നത് ഒരു പ്രത്യേക ``OpflowQNN`` എന്നതിലെ :math:`n` ക്യൂബിറ്റുകൾ, അതിൽ ആദ്യം ഡാറ്റ ഉൾപ്പെടുത്തുന്നതിനുള്ള സവിശേഷത മാപ്പും രണ്ടാമത് പരിശീലനം ലഭിച്ച ഒരു അൻസാറ്റ്സും(ansatz) അടങ്ങിയിരിക്കുന്നു. സ്ഥിരസ്ഥിതിയായി നിരീക്ഷിക്കാനാകുന്നത് :math:`Z^{\otimes n}`, അതായത്, പാരിറ്റി.
pt_un: O ``TwoLayerQNN`` é um ``OpflowQNN`` especial em :math:`n`qubits que consiste em primeiro, um mapa de recursos para inserir dados e, em segundo lugar, um ansatz que é treinado. O padrão observável é :math:`Z^{\otimes n}`, ou seja, paridade.
zh_tw: ``TwoLayerQNN`` 是一個特殊的``OpflowQNN`` 在:math:`n`量子位元上，由首先插入數據的特徵圖和第二個學習的擬設組成。預設觀察值是 :math:`Z^{\otimes n}`，即奇偶校驗。

source: 4. ``CircuitQNN``
bn_bn: ৪. ``CircuitQNN``

source: The ``CircuitQNN`` is based on a (parametrized) ``QuantumCircuit``. This can take input as well as weight parameters and produces samples from the measurement. The samples can either be interpreted as probabilities of measuring the integer index corresponding to a bitstring or directly as a batch of binary output. In the case of probabilities, gradients can be estimated efficiently and the ``CircuitQNN`` provides a backward pass as well. In case of samples, differentiation is not possible and the backward pass returns ``(None, None)``.
bn_bn: ``CircuitQNN`` একটি (পরামিতিক বা প্যারামিট্রাইজড) ``QuantumCircuit`` এর উপর ভিত্তি করে গঠিত। এটি ইনপুট নেয়ার পাশাপাশি প্যারামিটার মাপতে পারে এবং পরিমাপ থেকে নমুনা তৈরি করে। নমুনাগুলি হয় একটি বিটস্ট্রিংয়ের সাথে সম্পর্কিত পূর্ণসংখ্যা সূচকটি পরিমাপের সম্ভাব্যতা হিসাবে বা সরাসরি দ্বিমিক (বাইনারি) ফলাফলের ব্যাচ হিসাবে ব্যাখ্যা করা যেতে পারে। সম্ভাবনার ক্ষেত্রে গ্রেডিয়েন্টগুলি দক্ষতার সাথে অনুমান করা যায় এবং এর পাশাপাশি ``CircuitQNN`` একটি পশ্চাৎ পাস সরবরাহ করে। নমুনার ক্ষেত্রে, পার্থক্য করা সম্ভব নয় এবং পিছনের পাসটি ``(None, None)`` ফেরত দেয়।
de_de: Der ``CircuitQNN`` basiert auf einem (parametrisierten) ``QuantumCircuit`` und kann sowohl Eingaben als auch Gewichtsparameter annehmen und Samples aus der Messung erzeugen. Die Samples können entweder als Wahrscheinlichkeiten für die Messung des Integer-Index, der einem Bitstring entspricht, oder als Stapel von binären Ausgaben interpretiert werden. Im Falle von Wahrscheinlichkeiten können Gradienten effizient geschätzt werden, und das ``CircuitQNN`` stellt auch einen Backward-Pass zur Verfügung. Im Fall von Samples ist eine Ableitung unmöglich und der Backward-Pass gibt ``(None, None)`` zurück.
fr_fr: ``CircuitQNN`` est basé sur un ``QuantumCircuit`` (paramétré). Il admet des paramètres d'entrée ainsi que des paramètres de poids et produit des échantillons à partir de la mesure. Les échantillons peuvent être interprétés comme des probabilités de mesure de l'index correspondant à une chaîne de bits ou directement comme une valeur de sortie binaire. Dans le cas des probabilités, les gradients peuvent être estimés efficacement et ``CircuitQNN`` fournit également une retropropagation. Dans le cas d'échantillons, la différenciation n'est pas possible et la rétropropagation renvoie le résultat `` (None, None)``.
hi_in: ''CircuitQNN'' (पैरामीटराइज्ड) '' क्वांटम सर्किट" पर आधारित है । यह इनपुट के साथ-साथ वजन के मापदण्डों को भी ले सकता है और माप से नमूने तैयार करता है । नमूने को या तो बिटस्ट्रिंग के अनुरूप पूर्णांक सूचकांक को मापने की संभावना के रूप में व्याख्या किया जा सकता है या सीधे बाइनरी आउटपुट के एक बैच के रूप में. संभावनाओं के मामले में, ग्रेडिएंट्स का कुशलतापूर्वक अनुमान लगाया जा सकता है और ''CircuitQNN'' एक पश्चवर्ती पास प्रदान करता है । नमूनों के मामले में, विभेदीकरण संभव नहीं है और पिछे हुए पास का परिणाम ``(नहीं, नहीं)`` वापस होता है ।
ml_in: ``CircuitQNN`` ഒരു (പാരാമീറ്ററൈസ്ഡ്) ``QuantumCircuit`` അടിസ്ഥാനമാക്കിയുള്ളതാണ്. ഇത് ഇൻപുട്ടുകളും വെയിറ്റ് പാരാമീറ്ററുകളും എടുക്കുകയും ഇവയുടെ അളവുകളിൽ നിന്ന് സാമ്പിളുകൾ നിർമ്മിക്കുകയും ചെയ്യും. സാമ്പിളുകളെ ഒരു ബിറ്റ്സ്ട്രിംഗിന് സമാനമായ സംഖ്യ സൂചിക അളക്കുന്നതിനുള്ള സാധ്യതകളായി അല്ലെങ്കിൽ നേരിട്ട് ഒരു ബൈനറി ഔട്ട്പുട്ടായിട്ടും വ്യാഖ്യാനിക്കാം. സാധ്യതകളുടെ കാര്യത്തിൽ, ഗ്രേഡിയന്റുകളെ കാര്യക്ഷമമായി കണക്കാക്കാം, കൂടാതെ ``CircuitQNN`` ഒരു പിന്നാക്ക പാസും നൽകുന്നു. സാമ്പിളുകളുടെ കാര്യത്തിൽ, ഡിഫ്രൻസിയേശൻ (differentiation) സാധ്യമല്ല, പിന്നോക്ക പാസ്ന ``(None, None)`` നൽകുന്നു.
pt_un: O ``CircuitQNN`` é baseado em um (parametrizado) ``QuantumCircuit``. Isto pode receber parâmetros de entrada bem como de peso e produzir amostras a partir da medição. As amostras podem ser interpretadas como probabilidades de medir o índice inteiro correspondendo a um bitstring ou diretamente como um lute de saída binário. No caso de probabilidades, gradientes podem ser estimados eficientemente e o ``CircuitQNN`` provê também um passe para trás. No caso de amostras, diferenciação não é possível e o passe para trás retorna ``(None, None)``.
zh_tw: `` CircuitQNN`` 基於（參數化的）`` QuantumCircuit``。這可以獲取輸入以及重量參數並從測量中生成樣本。樣本可以解釋為測量位元串對應的整數索引的概率，或可以直接解釋為一批二進制的輸出。在概率的情況下，可以有效地估計梯度，並且 ``CircuitQNN`` 還提供了反向傳遞。對於樣本，區分是不可能的，反向傳遞返回`` (None, None) ``。

source: Further, the ``CircuitQNN`` allows to specify an ``interpret`` function to post-process the samples. This is expected to take a measured integer (from a bitstring) and map it to a new index, i.e. non-negative integer. In this case, the output shape needs to be provided and the probabilities are aggregated accordingly.
bn_bn: উপরন্তু, ``CircuitQNN`` নমুনাগুলি পরে প্রক্রিয়া করার জন্য একটি ``interpret`` ফাংশন নির্দিষ্ট করার অনুমতি দেয়। এটি একটি পরিমাপ করা পূর্ণসংখ্যা (একটি বিটস্ট্রিং থেকে) গ্রহণ করবে এবং একটি নতুন সূচকে, যেমন অঋণাত্মক পূর্ণসংখ্যায় ম্যাপ করবে বলে আশা করা হয়। এই ক্ষেত্রে, ফলাফলের আকৃতি সরবরাহ করা প্রয়োজন এবং সম্ভাব্যতাগুলি সেই অনুযায়ী সংযুক্ত করা হয়।
fr_fr: De plus, ``CircuitQNN`` permet de spécifier une ``fonction d'interprétation`` pour le post traitement des échantillons. On s'attend à ce que cela prenne un entier mesuré (à partir d'une chaîne de bits) et le mapper à un nouvel index, c'est à dire un entier non négatif. Dans ce cas, la forme de sortie doit être fournie et les probabilités sont agrégées en conséquence.
hi_in: इसके अलावा, ``CircuitQNN`` नमूनों को पोस्ट-प्रोसेस करने के लिए ``interpret`` फ़ंक्शन निर्दिष्ट करने की अनुमति देता है। यह एक मापा जाता पूर्णांक (एक bitstring से) लेने के लिए और एक नया सूचकांक है, यानी गैर नकारात्मक पूर्णांक से मैप की उम्मीद है। इस मामले में, आउटपुट आकार प्रदान करने की आवश्यकता है और संभावनाओं को तदनुसार एकत्रित किया जाता है।
pt_un: Avançando, o ``CircuitQNN`` permite especificar uma função ``interpret`` para pós-processar as amostras. É esperado que pegue a medição de um inteiro (de uma bitstring) e mapeie isto para um novo índice, ou seja, inteiro não negativo. Neste caso, o formato da saída precisa ser especificado e as probabilidades são agregadas em conformidade.
zh_tw: 此外，``CircuitQNN`` 允許您指定一個 `` interpret`` 函數來對樣本進行後處理。期望獲取一個測量的整數（來自一個位元串）並將其映射到一個新的索引，即一個非負整數。在這種情況下，您需要提供輸出的形式，而概率將相應調整。

source: A ``CircuitQNN`` can be configured to return sparse as well as dense probability vectors. If no ``interpret`` function is used, the dimension of the probability vector scales exponentially with the number of qubits and a sparse recommendation is usually recommended. In case of an ``interpret`` function it depends on the expected outcome. If, for instance, an index is mapped to the parity of the corresponding bitstring, i.e., to 0 or 1, a dense output makes sense and the result will be a probability vector of length 2.
bn_bn: একটি ``CircuitQNN`` কে ঘন এবং বিক্ষিপ্ত (স্পার্স) সম্ভাব্যতা দিকরাশি (ভেক্টর) ফেরত পেতে সাজানো (কনফিগার) করা যেতে পারে। যদি কোনও ``interpret`` ফাংশন ব্যবহার না করা হয় তবে সম্ভাব্যতা দিকরাশির (ভেক্টর) মাত্রা স্পষ্টতই কিউবিটের সংখ্যার সাথে সূচকীয় (এক্সপোনেন্সিয়াল) হারে থাকে এবং একটি বিক্ষিপ্ত (স্পার্স) ব্যবস্থা সাধারণত ঠিক করা হয়। ``interpret`` ফাংশনের ক্ষেত্রে এটি প্রত্যাশিত ফলাফলের উপর নির্ভর করে। উদাহরণস্বরূপ, যদি একটি সূচক একটি বিটস্ট্রিং এর সমতায় (প্যারিটি) ম্যাপ করা হয়, যেমন, ০ বা ১, তাহলে একটি ঘন (ডেন্স) ফলাফল বোধগম্য হয় এবং ফলাফলটি ২ দৈর্ঘ্যের সম্ভাব্যতা দিকরাশি (ভেক্টর) হবে।
de_de: Ein ``CircuitQN`` kann so konfiguriert werden, dass es schwach besetzte und dichte Wahrscheinlichkeitsvektoren zurückgibt. Wenn keine ``interpret`` Funktion verwendet wird, skaliert die Dimension des Wahrscheinlichkeitsvektors exponentiell mit der Anzahl der Qubits und es wird in der Regel eine schwache Variante empfohlen. Im Falle einer ``interpret`` Funktion hängt dies vom erwarteten Ergebnis ab. Wenn zum Beispiel ein Index der Parität des entsprechenden Bitstrings zugeordnet wird, also 0 oder 1, ist ein dichter Output sinnvoll und das Ergebnis wird ein Wahrscheinlichkeitsvektor von Länge 2 sein.
fr_fr: ``CircuitQNN`` peut être configuré pour renvoyer des vecteurs de probabilité épars ou denses. Si aucune fonction `ìnterpret`` n'est utilisée, la dimension des vecteurs de probabilité se calcule exponentiellement avec le nombre de qubits et une recommandation éparse est généralement recommandée. Dans le cas où une fonction `ìnterpret``est utilisée, cela dépend du résultat attendu. Si, par exemple, un index est mappé à la parité de la chaîne de caractères correspondante, c'est-à-dire à 0 ou 1, une sortie dense a du sens et le résultat sera un vecteur de probabilités de longueur 2.
hi_in: एक ``CircuitQNN``' को विरल तथा सघन संभावना वेक्टर की वापसी के लिए विन्यस्त किया जा सकता है।यदि 'व्याख्या' फलन का प्रयोग नहीं किया जाता है, तो संभावना सदिश के आयाम को क्विबिट की संख्या के साथ विस्तार से की जाती है और एक कम सिफारिश की सिफारिश की जाती है. 'अर्थ व्याख्या' फलन के मामले में यह अपेक्षित परिणाम पर निर्भर करता है।यदि, उदाहरण के लिए, एक सूचकांक को अनुरूप बिटस्ट्रिंग की समानता से मैप किया जाता है, यानी, 0 या 1 से, एक सघन आउटपुट समझ में आता है और परिणाम एक संभावना वेक्टर की लंबाई 2 होगी।
ml_in: സ്പാർസും ഡെൻസ് പ്രോബബിലിറ്റി വെക്ടറുകളിലേക്കും മടങ്ങുന്നതിന് ഒരു ``CircuitQNN`` -ന് ക്രമീകരിക്കാൻ‌ കഴിയും. ``interpret`` -ൻ്റെ ഫംഗ്ഷനൊന്നും ഉപയോഗിക്കുന്നില്ലെങ്കിൽ, പ്രോബബിലിറ്റി വെക്റ്ററിന്റെ അളവ് ക്യൂബിറ്റുകളുടെ എണ്ണത്തിനനുസരിച്ച് എക്‌സ്‌പോണൻസലായി വർധിക്കുന്നു, അങ്ങനെ ഒരു സ്പാർസ് റെക്കമൻ്റേഷൻ സാധാരണയായി ശുപാർശ ചെയ്യുന്നു.ഒരു ``interpret`` ഫംഗ്ഷന്റെ കാര്യത്തിൽ അത് പ്രതീക്ഷിച്ച ഫലത്തെ ആശ്രയിച്ചിരിക്കുന്നു. ഉദാഹരണത്തിന്, ഒരു സൂചിക അനുബന്ധ ബിറ്റ്സ്ട്രിംഗിന്റെ തുല്യതയിലേക്ക് മാപ്പുചയ്തിട്ടുണ്ടെങ്കിൽ, അതായത്, 0 അല്ലെങ്കിൽ 1 ലേക്ക്, ഡെൻസ് ഔട്ട്‌പുട്ട് അർത്ഥമാക്കുന്നു, ഫലം 2 ദൈർഘ്യമുള്ള പ്രോബബിലിറ്റി വെക്ടറായിരുക്കും.
pt_un: Um ``CircuitQNN`` pode ser configurado para retornar vetores de probabilidade esparsos, bem como densos. Se nenhuma função ``interpret`` for utilizada, a dimensão do vetor de probabilidade aumenta exponencialmente com o número de qubits e uma recomendação esparsa é geralmente recomendada. No caso de uma função ``interpret`` depende do resultado esperado. Se, por exemplo, um índice for mapeado para a paridade da bitstring correspondente, ou seja, para 0 ou 1, uma saída densa faz sentido e o resultado será um vetor de probabilidade de tamanho 2.
zh_tw: `` CircuitQNN`` 可以設置為返回稀疏概率向量和密集概率向量。如果不使用 `interpret` 函數，隨機向量的維數會隨著量子位元的數量呈指數增長，因此通常建議使用稀疏的。當使用 `` interpret`` 函數時，它取決於預期的結果。例如，如果將索引映射到相應位元串的奇偶校驗，即映射到 0 或 1，那麼密集輸出就有意義，結果是長度為 2 的隨機向量。

source: 4.1 Output: sparse integer probabilities
bn_bn: ৪.১ ফলাফলঃ বিক্ষিপ্ত (স্পার্স) পূর্ণসংখ্যার সম্ভাবনা
de_de: 4.1 Ausgabe: Schwach besetzte Integer-Wahrscheinlichkeiten
el_gr: 4.1 Έξοδος: αραιές ακέραιες πιθανότητες
fr_fr: 4.1 Sortie: probabilités entières clairsemées
hi_in: 4.1 आउटपुट: विरल पूर्णांक की संभावनाएँ
ml_in: 4.1 ഔട്ട്‌പുട്ട്: സ്പാർസ് സംഖ്യാ പ്രോബബിലിറ്റികൾ
pt_un: 4.1 Saída: probabilidades de número inteiro esparsas
zh_tw: 4.1 輸出：稀疏整數的概率

source: 4.2 Output: dense parity probabilities
bn_bn: ৪.২ ফলাফলঃ ঘন (ডেন্স) সমতা (প্যারিটি) সম্ভাবনা
de_de: 4.2 Ausgabe: Dichte Paritätswahrscheinlichkeiten
el_gr: 4.2 Έξοδος: πυκνές πιθανότητες ισοτιμίας
fr_fr: 4.2 Sortie: probabilités de parité denses
hi_in: 4.2 आउटपुट: सघन समता की संभावनाएँ
ml_in: 4.2 ഔട്ട്‌പുട്ട്: ഡെൻസ് പാരിറ്റി പ്രോബബിലിറ്റികൾ
pt_un: 4.2 Saída: probabilidade de paridade densa
zh_tw: 4.2 輸出：密集奇偶概率

source: 4.3 Output: Samples
bn_bn: ৪.৩ ফলাফলঃ নমুনা (স্যাম্পল)
de_de: 4.3 Ausgabe: Samples
el_gr: 4.3 Έξοδος: Δείγματα
fr_fr: 4.3 Sortie: Exemples
hi_in: 4.3 आउटपुट: नमूने
ml_in: 4.3 ഔട്ട്‌പുട്ട്: സാമ്പിളുകൾ
pt_un: 4.3 Saída: Amostras
zh_tw: 4.3 輸出：樣本

source: 4.4 Output: Parity Samples
bn_bn: ৪.৪ ফলাফলঃ সমতা (প্যারিটি) নমুনা (স্যাম্পল)
de_de: 4.4 Ausgabe: Paritäts-Samples
el_gr: 4.4 Έξοδος: Δείγματα ισοτιμίας
fr_fr: 4.4 Sortie: Exemples de parité
hi_in: 4.4 आउटपुट: समानता नमूने
ml_in: 4.4 ഔട്ട്‌പുട്ട്: പാരിറ്റി സാമ്പിളുകൾ
pt_un: 4.4 Saída: Amostras de Paridade
zh_tw: 4.4 輸出：奇偶校驗樣本

source: Run interactively in jupyter notebook.
hi_in: Jupyter नोटबुक में अंतःक्रियात्मक रूप से चलाएं |
