Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/01_neural_networks.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, hi_in, ja, ml_in, pt_un, ta, zh_tw

source: In this example, we previously decided that the first parameter of ``params1`` should be the input, while the second should be the weight. As we are performing a local statevector simulation, we will not set the ``estimator`` parameter; the network will create an instance of the reference ``Estimator`` primitive for us. If we needed to access cloud resources or ``Aer`` simulators, we would have to define the respective ``Estimator`` instances and pass them to the ``EstimatorQNN``.
es_un: En este ejemplo, previamente decidimos que el primer parámetro de ``params1`` debería ser la entrada, mientras que el segundo debería ser el peso. Como estamos realizando una simulación de vector de estado local, no estableceremos el parámetro ``estimator``; la red creará una instancia de la primitiva ``Estimator`` de referencia para nosotros. Si necesitáramos acceder a recursos en la nube o simuladores ``Aer``, tendríamos que definir las respectivas instancias de ``Estimator`` y pasarlas al ``EstimatorQNN``.
ja: この例では、``params1`` の最初のパラメーターを入力とし、2番目のパラメーターを重みとしました。 ローカルの状態ベクトル・シミュレーションを実行しているので、``estimator`` パラメーターを設定しません。ネットワークは、参照 ``Estimator`` primitiveのインスタンスを作成します。 クラウド・リソースや ``Aer`` シミュレーターにアクセスする必要がある場合は、それぞれの ``Estimator`` インスタンスを定義し、それらを ``EstimatorQNN`` に渡す必要があります。
ta: இந்த உதாரணத்தில், "பரம்ஸ்1"-இன் முதல் அளவுரு உள்ளீடாகவும், இரண்டாம் அளவுரு எடையாகவும் இருக்கவேண்டுமென்று தீர்மானித்தோம். நாம் உள்ளூர் ஸ்டேட்வெக்டர் ஒப்புருவாக்கி பயன்படுத்தும்போது, "எஸ்டிமேடர்" அளவுரை அமைக்கபடாது; வலைப்பின்னல் "எஸ்டிமேடர்" ப்ரிமிட்டிவ் குறிப்பை இன்ஸ்டன்ஸ்-ஆக நமக்கு உருவாக்கும். நாம் கிளவுட் வளங்களை அல்லது "ஏர்" ஒப்புருவாக்கி அணுக வேண்டுமென்றால், "எஸ்டிமேடர்" இன்ஸ்டன்ஸ்-ஐ வரையறுத்து "எஸ்டிமேடர் க்யூ எண் எண்"-ுக்கு அனுப்ப வேண்டும்.

source: We'll see how to use the QNN in the following sections, but before that, let's check out the ``SamplerQNN`` class.
ja: 次のセクションでQNNの使い方を見ていきますが、その前に ``SamplerQNN`` クラスを見てみましょう。
ta: பின்வரும் பகுதிகளில் QNN (QNN) பயன்படுத்த எப்படி பார்க்க வேண்டும், ஆனால் அந்த முன், ` சம்ப்லெர்க் QNN ` ` வகுப்பை வெளியே சரிபார்க்கலாம்.

source: 2.2. ``SamplerQNN``
ta: 2.2. ``சாமப்லர்QNN``

source: The ``SamplerQNN`` is instantiated in a similar way to the ``EstimatorQNN``, but because it directly consumes samples from measuring the quantum circuit, it does not require a custom observable.
es_un: La ``SamplerQNN`` se instancia de manera similar a la ``EstimatorQNN``, pero debido a que consume muestras directamente al medir el circuito cuántico, no requiere un observable personalizado.
ja: ``SamplerQNN`` は、``EstimatorQNN`` と同様にインスタンス化されます。 しかし、量子回路の測定から直接サンプルを吸収するので、カスタム観測量を必要としません。
ta: ` ` SamplerQNN ` ` ` EstimatorQNN ` `, ஆனால் அது நேரடியாக மாதிரிகளில் இருந்து மாதிரிகளை ஏற்றுக்கொள்ளும் ஏனெனில், அது ஒரு வழக்கமான ஒத்திசைவு தேவை இல்லை.

source: These output samples are interpreted by default as the probabilities of measuring the integer index corresponding to a bitstring. However, the ``SamplerQNN`` also allows us to specify an ``interpret`` function to post-process the samples. This function should be defined so that it takes a measured integer (from a bitstring) and maps it to a new value, i.e. non-negative integer.
ja: これらの出力サンプルは、デフォルトでは、ビット文字列に対応する整数インデックスを測定する確率として解釈されます。 しかし、``SamplerQNN`` ではサンプルを後処理するための ``interpret`` 関数を指定することもできます。 この関数は (ビット文字列から) 測定された整数を取って、それを新しい値、すなわち非負の整数にマップするように定義する必要があります。
ta: இந்த வெளியீட்டு மாதிரிகளை ஒரு பிட்வரிசைக்கு ஒதுக்கப்பட்ட முழு அட்டவணை அளவுகோள்களின் இயல்புகளாக முன்னிருப்பாக வரையறுக்கப்படுகிறது. எனினும், ` ` சாம்பல்QNN ` ` கூட மாதிரிகளை புதுப்பிக்கப்படுவதற்கு ` ` தவிர்க்க ` ` குறிப்பிடுவதற்கு உதவுகிறது. இந்த செயல்கூறு வரையறுக்கப்படவேண்டும் அதனால் அது அளவிடப்பட்ட முழு (பிட்ரசில் இருந்து) மற்றும் அதை ஒரு புதிய மதிப்பு, அதாவது, எதிர்மறை எண்ணை வரையறுக்கிறது.

source: **(!)** It's important to note that if a custom ``interpret`` function is defined, the ``output_shape`` cannot be inferred by the network, and **needs to be provided explicitly**.
ja: **(!)** カスタムの ``interpret`` 関数が定義されている場合、 ``output_shape`` はネットワークでは推論できないので、 **明示的に提供する必要がある** ことに注意してください。
ta: **(!)** தனிப்பயன் ``விளக்கம்`` செயல்பாடு வரையறுக்கப்பட்டால், ``அவுட்புட்_ஷேப்`` பிணையத்தால் ஊகிக்கப்படாது, மேலும் **வெளிப்படையாக வழங்கப்பட வேண்டும்**.

source: **(!)** It's also important to keep in mind that if no ``interpret`` function is used, the dimension of the probability vector will scale exponentially with the number of qubits. With a custom ``interpret`` function, this scaling can change. If, for instance, an index is mapped to the parity of the corresponding bitstring, i.e., to 0 or 1, the result will be a probability vector of length 2 independently of the number of qubits.
ja: **(!)** ``interpret`` 関数を使用しない場合、確率ベクトルの次元は量子ビット数に応じて指数関数的に増加することにも注意してください。 カスタム ``interpret`` 関数を使用する場合、この増加を変更できます。例えば、インデックスが対応するビット文字列のパリティにマッピングされる場合、つまり0または1にマッピングされる場合、結果は量子ビット数に関係なく長さ2の確率ベクトルになります。
ta: **(!)** ``விளக்கம்`` செயல்பாடு பயன்படுத்தப்படாவிட்டால், நிகழ்தகவு வெக்டரின் பரிமாணம் குவிட்களின் எண்ணிக்கையுடன் அதிவேகமாக அளவிடப்படும் என்பதையும் நினைவில் கொள்ள வேண்டியது அவசியம். தனிப்பயன் ``விளக்கம்`` செயல்பாட்டின் மூலம், இந்த அளவிடுதல் மாறலாம். எடுத்துக்காட்டாக, ஒரு குறியீட்டை தொடர்புடைய பிட்ஸ்ட்ரிங் சமநிலைக்கு, அதாவது 0 அல்லது 1 க்கு வரைபடமாக்கினால், இதன் விளைவாக க்யூபிட்களின் எண்ணிக்கையிலிருந்து சுயாதீனமாக நீளம் 2 நிகழ்தகவு திசையன் இருக்கும்.

source: Let's create a different quantum circuit for the ``SamplerQNN``. In this case, we will have two input parameters and four trainable weights that parametrize a two-local circuit.
ja: ``SamplerQNN`` 用に別の量子回路を作成しましょう。 この場合、2 つの入力パラメーターと 4 つの訓練可能な重みを持ち、2 つのローカル回路をパラメーター化します。
ta: இந்த வழக்கில், நாம் இரு உள்ளீட்டு அளபுருக்கள் மற்றும் நான்கு சுற்றுச்சூழல் வீட்டில் இரண்டு உள்ளீட்டு சுற்றுப்பயணத்தை உருவாக்க வேண்டும்.

source: Similarly to the ``EstimatorQNN``, we must specify inputs and weights when instantiating the ``SamplerQNN``. In this case, the keyword arguments will be: - ``sampler``: optional primitive instance - ``input_params``: list of quantum circuit parameters that should be treated as "network inputs" - ``weight_params``: list of quantum circuit parameters that should be treated as "network weights"
ja: ``EstimatorQNN`` と同様に、``SamplerQNN`` をインスタンス化する際に入力と重みを指定する必要があります。 この場合、キーワード引数は以下のようになります: - ``sampler``: オプションのprimitiveインスタンス - ``input_params``: 「ネットワーク入力」として扱われるべき量子回路パラメーターのリスト - ``weight_params``: 「ネットワーク重み」として扱われるべき量子回路パラメーターのリスト
ta: அப்படியே ` ` சம்ப்லர் QNN ` ` ` சம்ப்ரீக்னென் ` ` `. இந்த வழக்கில், விசைப்பெயர் வார்த்தைகள் ` ` samplerQNN ` ` ` ` samplerQNN ` `: விருப்பத் தன்மையான உதாரணம் ` ` input_params ` `: list of quantum circuit parameters that should be to be with "network inputs"-` ` weight_ params ` `: list of quantum circuit parameters that should be to be with "network weights"

source: Please note that, once again, we are choosing not to set the ``Sampler`` instance to the QNN and relying on the default.
es_un: Ten en cuenta que, una vez más, estamos eligiendo no configurar la instancia de ``Sampler`` en la QNN y confiando en el valor predeterminado.
ja: 再び、``Sampler`` インスタンスを QNN に設定しないことを選択し、デフォルトに依存していることに注意してください。
ta: தயவு செய்து, மீண்டும் ஒரு முறை, நாங்கள் QNN க்கு ` ` சாம்பலர் ` ` உதாரணம் அமைக்க இல்லையென்றால், முன்னிருப்பில் மறுபடியும் தேர்ந்தெடுக்கப்படவில்லை.

source: In addition to the basic arguments shown above, the ``SamplerQNN`` accepts three more settings: ``input_gradients``, ``interpret``, and ``output_shape``. These will be introduced in sections 4 and 5.
es_un: Además de los argumentos básicos que se muestran arriba, la ``SamplerQNN`` acepta tres configuraciones más: ``input_gradients``, ``interpret``, y ``output_shape``. Estos se introducirán en las secciones 4 y 5.
ja: 上記の基本的な引数に加えて、``SamplerQNN`` は ``input_gradients`` と ``interpret`` と ``output_shape`` の 3 つの設定を受け付けます。 これらはセクション4とセクション5で紹介されます。
ta: மேலே காட்டப்பட்ட அடிப்படை தருமதிப்புகளின் கூடுதலாக, ` சம்ப்லர் QNN ` இன்னும் மூன்று அமைப்புகளை ஏற்றுக்கொள்கிறது: ` ` input_gradients-action ` `, and ` output_shape ` `. இவை 4 மற்றும் 5 பகுதிகளில் அறிமுகப்படுத்தப்படும்.

source: 3. How to Run a Forward Pass
es_un: 3. Cómo Ejecutar un Paso hacia Adelante
ja: 3. フォワード・パスの実行方法
ta: 3. முன்னோக்கி பாஸை எவ்வாறு இயக்குவது

source: 3.1. Set-Up
es_un: 3.1. Configuración
ja: 3.1. セットアップ
ta: 3.1 அமைவு

source: In a real setting, the inputs would be defined by the dataset, and the weights would be defined by the training algorithm or as part of a pre-trained model. However, for the sake of this tutorial, we will specify random sets of input and weights of the right dimension:
es_un: En un entorno real, las entradas estarían definidas por el conjunto de datos y los pesos estarían definidos por el algoritmo de entrenamiento o como parte de un modelo preentrenado. Sin embargo, por el bien de este tutorial, especificaremos conjuntos aleatorios de entrada y pesos de la dimensión correcta:
ja: 実際の設定では、入力はデータセットによって定義され、重みは学習アルゴリズムや学習済みモデルの一部として定義されます。しかし、このチュートリアルのために、適切な次元の入力と重みのランダムなセットを指定します。
ta: உண்மையான அமைப்பில், உள்ளீடுகள் தரவுத்தொகுப்பால் வரையறுக்கப்படும், மேலும் எடைகள் பயிற்சி அல்காரிதம் அல்லது முன் பயிற்சி பெற்ற மாதிரியின் ஒரு பகுதியாக வரையறுக்கப்படும். இருப்பினும், இந்த டுடோரியலுக்காக, சரியான பரிமாணத்தின் உள்ளீடு மற்றும் எடைகளின் சீரற்ற தொகுப்புகளை நாங்கள் குறிப்பிடுவோம்:

source: 3.1.1. ``EstimatorQNN`` Example
es_un: 3.1.1. Ejemplo de ``EstimatorQNN``
ja: 3.1.1. ``EstimatorQNN`` の例
ta: 3.1.1.`` EstimatorQNN `` எடுத்துக்காட்டு

source: 3.1.2. ``SamplerQNN`` Example
es_un: 3.1.2. Ejemplo de ``SamplerQNN``
ja: 3.1.2. ``SamplerQNN`` の例
ta: 3.1.2. ``SamplerQNN`` எடுத்துக்காட்டு

source: Once we have the inputs and the weights, let's see the results for batched and non-batched passes.
ja: 入力と重みを設定したら、バッチパスと非バッチパスの結果を確認しましょう。
ta: எங்களிடம் உள்ளீடுகள் மற்றும் எடைகள் கிடைத்ததும், பேட்ச் மற்றும் பேட்ச் அல்லாத பாஸ்களுக்கான முடிவுகளைப் பார்ப்போம்.

source: 3.2. Non-batched Forward Pass
es_un: 3.2. Paso hacia Adelante Sin Lotes
ja: 3.2. 非バッチ・フォワード・パス
ta: 3.2 தொகுதி அல்லாத முன்னோக்கி பாஸ்

source: 3.2.1. ``EstimatorQNN`` Example
es_un: 3.2.1. Ejemplo de ``EstimatorQNN``
ja: 3.2.1. ``EstimatorQNN`` の例
ta: 3.2.1. ``EstimatorQNN`` எடுத்துக்காட்டு

source: For the ``EstimatorQNN``, the expected output shape for the forward pass is ``(1, num_qubits * num_observables)`` where ``1`` in our case is the number of samples:
es_un: Para la ``EstimatorQNN``, la forma de salida esperada para el paso hacia adelante es ``(1, num_qubits * num_observables)`` donde ``1`` en nuestro caso es el número de muestras:
ja: ``EstimatorQNN`` では、フォワード・パスの期待される出力形状は ``(1, num_qubits * num_observables)`` です。ここで ``1`` はサンプル数です:
ta: ``EstimatorQNN``க்கு, முன்னோக்கி பாஸிற்கான எதிர்பார்க்கப்படும் வெளியீட்டு வடிவம் ``(1, num_qubits * num_observables)`` ஆகும், இங்கு ``1`` என்பது மாதிரிகளின் எண்ணிக்கை:

source: 3.2.2. ``SamplerQNN`` Example
es_un: 3.2.2. Ejemplo de ``SamplerQNN``
ja: 3.2.2. ``SamplerQNN`` の例
ta: 3.2.2. ``SamplerQNN`` எடுத்துக்காட்டு

source: For the ``SamplerQNN`` (without a custom interpret function), the expected output shape for the forward pass is ``(1, 2**num_qubits)``. With a custom interpret function, the output shape will be ``(1, output_shape)``, where ``1`` in our case is the number of samples:
es_un: Para la ``SamplerQNN`` (sin una función de interpretación personalizada), la forma de salida esperada para el paso hacia adelante es ``(1, 2**num_qubits)``. Con una función de interpretación personalizada, la forma de salida será ``(1, output_shape)``, donde ``1`` en nuestro caso es el número de muestras:
ja: ``SamplerQNN`` (カスタム interpret 関数なし) では、フォワード・パスの期待される出力形状は ``(1, 2**num_qubits)`` になります。 カスタム interpret 関数を使用すると、出力形状は ``(1, output_shape)`` になります。ここで、``1`` はサンプル数です。
ta: ``SamplerQNN`` (தனிப்பயன் விளக்கம் செயல்பாடு இல்லாமல்), முன்னோக்கி பாஸிற்கான எதிர்பார்க்கப்படும் வெளியீடு வடிவம் ``(1, 2**num_qubits)`` ஆகும். தனிப்பயன் விளக்கச் செயல்பாட்டின் மூலம், வெளியீட்டு வடிவம் ``(1, output_shape)`` ஆக இருக்கும், இங்கு ``1`` என்பது மாதிரிகளின் எண்ணிக்கை:

source: 3.3. Batched Forward Pass
es_un: 3.3. Paso hacia Adelante Con Lotes
ja: 3.3. バッチ・フォワード・パス
ta: 3.3 பேட்ச்டு ஃபார்வர்டு பாஸ்

source: 3.3.1. ``EstimatorQNN`` Example
es_un: 3.3.1. Ejemplo de ``EstimatorQNN``
ja: 3.3.1. ``EstimatorQNN`` の例
ta: 3.3.1. ``EstimatorQNN`` எடுத்துக்காட்டு

source: For the ``EstimatorQNN``, the expected output shape for the forward pass is ``(batch_size, num_qubits * num_observables)``:
es_un: Para el ``EstimatorQNN``, la forma de salida esperada para el paso hacia adelante es ``(batch_size, num_qubits * num_observables)``:
ja: ``EstimatorQNN`` では、フォワード・パスの期待される出力形状は``(batch_size, num_qubits * num_observables)`` になります。
ta: ``EstimatorQNN``க்கு, முன்னோக்கி பாஸிற்கான எதிர்பார்க்கப்படும் வெளியீட்டு வடிவம் ``(batch_size, num_qubits * num_observables)``:

source: 3.3.2. ``SamplerQNN`` Example
es_un: 3.3.2. Ejemplo de ``SamplerQNN``
ja: 3.3.2. ``SamplerQNN`` の例
ta: 3.3.2. ` ` SamplerQNN ` எடுத்துக்காட்டு

source: For the ``SamplerQNN`` (without custom interpret function), the expected output shape for the forward pass is ``(batch_size, 2**num_qubits)``. With a custom interpret function, the output shape will be ``(batch_size, output_shape)``.
es_un: Para la ``SamplerQNN`` (sin la función de interpretación personalizada), la forma de salida esperada para el paso hacia adelante es ``(batch_size, 2**num_qubits)``. Con una función de interpretación personalizada, la forma de salida será ``(batch_size, output_shape)``.
ja: ``SamplerQNN`` (カスタム interpret 関数なし) では、フォワード・パスの期待される出力形状は ``(batch_size, 2**num_qubits)`` になります。 カスタム interpret 関数を使用すると、出力形状は ``(batch_size, output_shape)`` になります。
ta: ` ` SamplerQNN ` ` (தனிப்பட்ட விளக்க செயல்கூறு இல்லாமல்), எதிர்பார்க்கப்பட்ட வெளியீடு வடிவம் ` ` (batch_size, 2 * *num_qubits) ` `. With a custom interpret function, the output shape will be ` (batch_size, output_shape) ` `.

source: 4. How to Run a Backward Pass
es_un: 4. Cómo Ejecutar un Paso hacia Atrás
ja: 4. バックワード・パスの実行方法
ta: 4. எப்படி ஒரு பின்னணி பாஸ் இயக்குவது

source: Let's take advantage of the inputs and weights defined above to show how the backward pass works. This pass returns a tuple ``(input_gradients, weight_gradients)``. By default, the backward pass will only calculate gradients with respect to the weight parameters.
ja: 上記で定義した入力と重みを利用して、バックワード・パスの動作を示しましょう。このパスはタプル ``(input_gradients, weight_gradients)`` を返します。 デフォルトでは、バックワード・パスは重みパラメーターに対する勾配のみを計算します。
ta: பின்தங்கிய பாஸ் எவ்வாறு செயல்படுகிறது என்பதைக் காட்ட மேலே வரையறுக்கப்பட்ட உள்ளீடுகள் மற்றும் எடைகளைப் பயன்படுத்திக் கொள்வோம். இந்த பாஸ் ஒரு டூப்பிள் ``(உள்ளீடு_கிரேடியண்ட்ஸ், எடை_கிரேடியண்ட்ஸ்)`` வழங்கும். முன்னிருப்பாக, பின்தங்கிய பாஸ் எடை அளவுருக்கள் தொடர்பான சாய்வுகளை மட்டுமே கணக்கிடும்.

source: If you want to enable gradients with respect to the input parameters, you should set the following flag during the QNN instantiation:
es_un: Si deseas habilitar gradientes con respecto a los parámetros de entrada, debes configurar el siguiente indicador durante la instanciación de la QNN:
ja: 入力パラメーターに対して勾配を有効にする場合は、QNN インスタンスを作成するときに次のフラグを設定する必要があります。
ta: நீங்கள் உள்ளீட்டு அளபுருக்களுக்கு மதிப்புடன் சாங்குகளை செயலாக்க விரும்பினால், QNN instantiation க்குள் பின்வரும் குறியை அமைக்க வேண்டும்:

source: Please remember that input gradients are **required** for the use of ``TorchConnector`` for PyTorch integration.
es_un: Recuerda que los gradientes de entrada son **requeridos** para el uso de ``TorchConnector`` para la integración de PyTorch.
ja: PyTorchとの統合に ``TorchConnector`` を使用するには、入力勾配が **必要** であることを忘れないでください。
ta: தயவு செய்து நினைவில் கொள்ளும்படி உள்ளீட்டு சாதனங்கள் ** ` TorchConnector ` ` ` ` TorchConnector ` ` இன் பயன்பாடு.

source: 4.1. Backward Pass without Input Gradients
es_un: 4.1. Paso hacia Atrás sin Gradientes de Entrada
ja: 4.1. 入力勾配のないバックワード・パス
ta: 4.1 உள்ளீடு சரிவுகள் இல்லாமல் பின்தங்கிய பாஸ்

source: 4.1.1. ``EstimatorQNN`` Example
es_un: 4.1.1. Ejemplo de ``EstimatorQNN``
ja: 4.1.1. ``EstimatorQNN`` の例
ta: 4.1.1. ` ` EstimatorQNN ` எடுத்துக்காட்டு

source: For the ``EstimatorQNN``, the expected output shape for the weight gradients is ``(batch_size, num_qubits * num_observables, num_weights)``:
es_un: Para ``EstimatorQNN``, la forma de salida esperada para los gradientes de peso es ``(batch_size, num_qubits * num_observables, num_weights)``:
ja: ``EstimatorQNN`` では、重み勾配の期待される出力形状は ``(batch_size, num_qubits * num_observables, num_weights)`` になります。
ta: ` ` EstimatorQNN ` `, எடை சார்ந்துகளுக்கு எதிர்பார்க்கப்பட்ட வெளியீடு வடிவம் ` ` (batch_size, num_qubits * num_observables, num_weights) ` `:

source: 4.1.2. ``SamplerQNN`` Example
es_un: 4.1.2. Ejemplo de ``SamplerQNN``
ja: 4.1.2. ``SamplerQNN`` の例
ta: 4.1.2. ` ` SamplerQNN ` எடுத்துக்காட்டு

source: For the ``SamplerQNN`` (without custom interpret function), the expected output shape for the forward pass is ``(batch_size, 2**num_qubits, num_weights)``. With a custom interpret function, the output shape will be ``(batch_size, output_shape, num_weights)``.:
es_un: Para la ``SamplerQNN`` (sin la función de interpretación personalizada), la forma de salida esperada para el paso hacia adelante es ``(batch_size, 2**num_qubits, num_weights)``. Con una función de interpretación personalizada, la forma de salida será ``(batch_size, output_shape, num_weights)``.:
ja: ``SamplerQNN`` (カスタム interpret 関数なし) では、フォワード・パスの期待される出力形状は ``(batch_size, 2**num_qubits, num_weights)`` になります。 カスタム interpret 関数を使用すると、出力形状は ``(batch_size, output_shape, num_weights)`` になります。
ta: ` ` SamplerQNN ` ` (தனிப்பட்ட விளக்கச்சீட்டு செயல்கூறு இல்லாமல்), முன்னோடியான வெளியீட்டு வடிவம் ` ` (batch_size, 2 * *num_qubits, num_weights) ` `. தனிப்பயன் வடிவமைப்புடன் வெளியீட்டு வடிவம் ` ` (batch_size, output_shape, num_weights) ` `.:

source: 4.2. Backward Pass with Input Gradients
es_un: 4.2. Paso hacia Atrás con Gradientes de Entrada
ja: 4.2. 入力勾配のあるバックワード・パス
ta: 4.2 உள்ளீட்டு சாய்வுகளுடன் பின்தங்கிய பாஸ்

source: Let's enable the ``input_gradients`` to show what the expected output sizes are for this option.
ja: ``input_gradients`` を有効にして、このオプションで期待される出力サイズを表示しましょう。
ta: எதிர்பார்க்கப்பட்ட வெளியீட்டுக் அளவுகள் இந்த விருப்பத்துக்கு என்ன ` ` input_gradients - > ` ` ` input_gradients-action

source: 4.2.1. ``EstimatorQNN`` Example
es_un: 4.2.1. Ejemplo de ``EstimatorQNN``
ja: 4.2.1. ``EstimatorQNN`` の例
ta: 4.2.1. ` ` EstimatorQNN ` எடுத்துக்காட்டு

source: For the ``EstimatorQNN``, the expected output shape for the input gradients is ``(batch_size, num_qubits * num_observables, num_inputs)``:
es_un: Para la ``EstimatorQNN``, la forma de salida esperada para los gradientes de entrada es ```(batch_size, num_qubits * num_observables, num_inputs)``:
ja: ``EstimatorQNN`` では、重み勾配の期待される出力形状は ``(batch_size, num_qubits * num_observables, num_inputs)`` になります。
ta: ` ` EstimatorQNN ` `, உள்ளீட்டு சாதனங்களுக்கான எதிர்பார்க்கப்பட்ட வெளியீடு வடிவம் ` ` (batch_size, num_qubits * num_observables, num_inputs) ` `:

source: 4.2.2. ``SamplerQNN`` Example
es_un: 4.2.2. Ejemplo de ``SamplerQNN``
ja: 4.2.2. ``SamplerQNN`` の例
ta: 4.2.2. ` ` SamplerQNN ` எடுத்துக்காட்டு

source: For the ``SamplerQNN`` (without custom interpret function), the expected output shape for the input gradients is ``(batch_size, 2**num_qubits, num_inputs)``. With a custom interpret function, the output shape will be ``(batch_size, output_shape, num_inputs)``.
es_un: Para la ``SamplerQNN`` (sin función de interpretación personalizada), la forma de salida esperada para los gradientes de entrada es ``(batch_size, 2**num_qubits, num_inputs)``. Con una función de interpretación personalizada, la forma de salida será ``(batch_size, output_shape, num_inputs)``.
ja: ``SamplerQNN`` (カスタム interpret 関数なし) では、入力勾配に対する期待される出力形状は ``(batch_size, 2**num_qubits, num_inputs)`` になります。 カスタム interpret 関数を使用すると、出力形状は ``(batch_size, output_shape, num_inputs)`` になります。
ta: ` ` SamplerQNN ` ` (தனிப்பட்ட விளக்க செயல்கூறு இல்லாமல்), உள்ளீட்டு சாதனங்களுக்கான எதிர்பார்க்கப்பட்ட வெளியீடு வடிவம் ` ` (batch_size, 2 * *num_qubits, num_inputs) ` `. தனிப்பயன் வடிவமைப்புடன் வெளியீட்டு வடிவம் ` ` (batch_size, output_shape, num_inputs) ` `.

source: 5. Advanced Functionality
es_un: 5. Funcionalidad Avanzada
ja: 5. 拡張機能
ta: 5. மேம்பட்ட செயல்பாடுகள்

source: 5.1. ``EstimatorQNN`` with Multiple Observables
es_un: 5.1. ``EstimatorQNN`` con Múltiples Observables
ja: 5.1. 複数の観測量を持つ ``EstimatorQNN``
ta: 5.1 ``EstimatorQNN`` பல அவதானிப்புகளுடன்

source: The ``EstimatorQNN`` allows to pass lists of observables for more complex QNN architectures. For example (note the change in output shape):
es_un: La ``EstimatorQNN`` permite pasar listas de observables para arquitecturas QNN más complejas. Por ejemplo (ten en cuenta el cambio en la forma de salida):
ja: ``EstimatorQNN`` では、より複雑な QNN アーキテクチャーのために観測量のリストを渡すことができます。例えば (出力形状の変化に注意してください)
ta: ` ` EstimatorQNN ` ` மேலும் சிக்கலான QNN கட்டிடக்கலுக்கான ஆவணங்களின் பட்டியல்களை கடக்க அனுமதிக்கிறது. உதாரணமாக (வெளியீட்டு வடிவத்தில் மாற்றம் குறிப்பு):

source: 5.2. ``SamplerQNN`` with custom ``interpret``
es_un: 5.2. ``SamplerQNN`` con ``interpret`` personalizado
ja: 5.2. カスタム ``interpret`` 付き ``SamplerQNN``
ta: 5. 2. ` ` SamplerQNN ` ` தனிப்பயன் ` ` ` `

source: One common ``interpret`` method for ``SamplerQNN`` is the ``parity`` function, which allows it to perform binary classification. As explained in the instantiation section, using interpret functions will modify the output shape of the forward and backward passes. In the case of the parity interpret function, ``output_shape`` is fixed to ``2``. Therefore, the expected forward and weight gradient shapes are ``(batch_size, 2)`` and ``(batch_size, 2, num_weights)``, respectively:
es_un: Un método ``interpret`` común para ``SamplerQNN`` es la función ``parity``, que le permite realizar una clasificación binaria. Como se explicó en la sección de creación de instancias, el uso de funciones de interpretación modificará la forma de salida de los pasos hacia adelante y hacia atrás. En el caso de la función de interpretación de paridad, ``output_shape`` se fija en ``2``. Por lo tanto, las formas esperadas del gradiente de peso y gradiente hacia adelante son ``(batch_size, 2)`` y ``(batch_size, 2, num_weights)``, respectivamente:
ja: ``SamplerQNN`` の一般的な ``interpret`` メソッドの 1 つは ``parity`` 関数で、バイナリ分類を行うことができます。 インスタンス作成のセクションで説明したように、interpret 関数を使うことで、フォワードとバックワード・パスの出力形状が変更されます。 パリティinterpret関数の場合、``output_shape`` は ``2`` に固定されます。 そこで期待される前方および重み勾配の形状は、おそれぞれ ``(batch_size, 2)`` と ``(batch_size, 2, num_weights)`` です。
ta: ஒரு பொதுவான ` ` சம்ப்லர் QNN ` ` என்ற முறையை ` ` parity ` ` என்ற முறையில், இது இரும வகைப்பாட்டை செயல்படுத்துவதற்கு அனுமதிக்கிறது. எடுத்துக்காட்டு விகிதத்தில் விளக்கப்படாமல், விளக்கச் செயல்களைப் பயன்படுத்தி முன்னணி மற்றும் பின்னூட்டிகளின் வெளியீட்டு வடிவத்தை மாற்றும். பார்சி உரையாடல் செயல்கூறு, ` ` output_shape ` ` ` ` output_shape ` `. அதனால், எதிர்பார்க்கப்பட்ட முன்னேற்றம் மற்றும் எடை கிரீடென்ட் வடிவங்கள் ` ` (batch_size, 2) ` ` (batch_size, 2, num_weights) ` ` ` Batch_size, 2, num_weights) `.

source: 6. Conclusion
es_un: 6. Conclusión
ja: 6. 結論
ta: 6. முடிவுரை
