Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/02_neural_network_classifier_and_regressor.po
Languages: bn_bn, de, es_un, fr, hi_in, ja, ml_in, pt_un, ta, zh_tw

source: This page was generated from `docs/tutorials/02_neural_network_classifier_and_regressor.ipynb`__.
bn_bn: এই পেজটি `docs/tutorials/02_neural_network_classifier_and_regressor.ipynb`__ থেকে তৈরি হয়েছে।
de: Diese Seite wurde aus ` docs/tutorials/02_neural_network_classifier_and_regressor.ipynb ` __ generiert.
es_un: Esta página fue generada a partir de `docs/tutorials/02_neural_network_classifier_and_regressor.ipynb`__.
fr: Cette page a été générée à partir de `docs/tutorials/02_neural_network_classifier_and_regressor.ipynb`__.
ja: このページは `docs/tutorials/02_neural_network_classifier_and_regressor.ipynb`__ から生成されました。
pt_un: Esta página foi gerada a partir `docs/tutorials/02_neural_network_classifier_and_regressor.ipynb`__.
ta: இந்தப் பக்கம் `docs/tutorials/02_neural_network_classifier_and_regressor.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
zh_tw: 此頁面是從 `docs/tutorials/02_neural_network_classifier_and_regressor.ipynb`__ 產生的。

source: Neural Network Classifier & Regressor
bn_bn: নিউরাল নেটওয়ার্ক শ্রেণিবিন্যাসকরক (ক্লাসিফায়ার) এবং রিগ্রেসর
de: Neuronales-Netzwerk-Klassifikator & -Regressor
es_un: Redes Neuronales de Clasificación y Regresión
fr: Classification et régression de réseau de neurones
hi_in: तंत्रिका नेटवर्क वर्गीकरण और प्रतिगामी
ja: ニューラル・ネットワーク分類器と回帰器
ml_in: ന്യൂറൽ നെറ്റ്‌വർക്ക് ക്ലാസിഫയർ & റിഗ്രസ്സർ
pt_un: Classificador & Regressor utilizando uma Rede Neural
ta: நரம்பியல் நெட்வொர்க் வகைப்படுத்தி & பின்னடைவு
zh_tw: 神經網絡分類器和迴歸器

source: In this tutorial we show how the ``NeuralNetworkClassifier`` and ``NeuralNetworkRegressor`` are used. Both take as an input a (Quantum) ``NeuralNetwork`` and leverage it in a specific context. In both cases we also provide a pre-configured variant for convenience, the Variational Quantum Classifier (``VQC``) and Variational Quantum Regressor (``VQR``). The tutorial is structured as follows:
bn_bn: এই পাঠসমূহ বা টিউটোরিয়ালে আমরা দেখাব কিভাবে ``NeuralNetworkClassifier`` এবং ``NeuralNetworkRegressor`` ব্যবহার করা হয়। উভয়ই একটি ইনপুট হিসাবে একটি (কোয়ান্টাম) ``NeuralNetwork`` গ্রহণ করে এবং একটি নির্দিষ্ট প্রসঙ্গে এটি লিভারেজ করে। উভয় ক্ষেত্রেই আমরা সুবিধার জন্য একটি পূর্ব-কনফিগার করা ভেরিয়েন্ট, ভেরিয়েশনাল কোয়ান্টাম ক্লাসিফায়ার (``VQC``) এবং ভেরিয়েশনাল কোয়ান্টাম রিগ্রসর (``VQR``) প্রদান করি। পাঠসমূহ (টিউটোরিয়াল) টি নিম্নরূপ গঠন করা হয়েছে:
de: In diesem Tutorial zeigen wir, wie ``NeuralNetworkClassifier`` und ``NeuralNetworkRegressor`` verwendet werden. Beide nehmen als Input ein (Quantum) ``NeuralNetwork`` und nutzen es in einem bestimmten Kontext. In beiden Fällen bieten wir auch praktische, vorkonfigurierte Varianten an, den Variational-Quantum-Classifier (``VQC``) und Variational-Quantum-Regressor (``VQR``). Das Tutorial ist wie folgt strukturiert:
es_un: En este tutorial mostramos cómo se utiliza la ``NeuralNetworkClassifier`` y la ``NeuralNetworkRegressor``. Ambas toman como entrada una ``NeuralNetwork`` (Cuántica) y la aprovechan en un contexto específico. En ambos casos, también ofrecemos una variante preconfigurada para mayor comodidad, el Clasificador Cuántico Variacional (Variational Quantum Classifier, ``VQC``) y el Regresor Cuántico Variacional (Variational Quantum Regressor, ``VQR``). El tutorial está estructurado de la siguiente manera:
fr: Dans ce tutoriel, nous montrons comment utiliser ``NeuralNetworkClassifier`` et ``NeuralNetworkRegressor``. Les deux prennent comme entrée (Quantique) ``NeuralNetwork`` et l'exploitent dans un contexte spécifique. Dans les deux cas, nous proposons également pour plus de commodité, une variante préconfigurée : Le Classificateur Variationnel Quantique (``VQC``) et le Régresseur Variationnel Quantique (``VQR``). Le didacticiel est structuré comme suit :
hi_in: इस ट्यूटोरियल में हम बताते हैं कि किस तरह 'NeuralNetworkClassifier' और ''NeuralNetworkRegressor '' का इस्तेमाल किया जाता है। दोनों ही एक इनपुट के रूप में (क्वांटम) ``NeuralNetwork'' लेते हैं और इसे एक विशिष्ट संदर्भ में उपयोग करते हैं. दोनों ही मामलों में हम सुविधा के लिए पूर्व-विन्यस्त संस्करण भी प्रदान करते हैं, परिवर्तनशील क्वांटम वर्गीकृत (` ` VQC ` `) और परिवर्तनशील क्वांटम प्रतिगामी (` ` VQR ` ` '). ट्यूटोरियल के रूप में संरचित है:
ja: このチュートリアルでは、``NeuralNetworkClassifier`` と ``NeuralNetworkRegressor`` がどのように使用されるかを示します。どちらも入力として (量子) ``NeuralNetwork`` を受け取り、特定のコンテキストでそれを活用します。どちらの場合も、利便性のためにあらかじめ設定されたバリエーション、変分量子分類器 (Variational Quantum Classifier, ``VQC``) と変分量子回帰器 (Variational Quantum Regressor, ``VQR``) を提供しています。チュートリアルの構成は以下の通りです。
ml_in: ഈ ട്യൂട്ടോറിയലിൽ ``NeuralNetworkClassifier``, ``NeuralNetworkRegressor``എന്നിവ എങ്ങനെ ഉപയോഗിക്കുന്നുവെന്ന് ഞങ്ങൾ കാണിക്കുന്നു. രണ്ടും ഇൻപുട്ടായി ഒരു (ക്വാണ്ടം) ``NeuralNetwork`` എടുത്ത് ഒരു പ്രത്യേക സന്ദർഭത്തിൽ അത് പ്രയോജനപ്പെടുത്തുന്നു. രണ്ട് സാഹചര്യങ്ങളിലും ഞങ്ങൾ സൗകര്യത്തിനായി മുൻകൂട്ടി ക്രമീകരിച്ച വേരിയൻ്റുകൾ, വേരിയേഷൻൽ ക്വാണ്ടം ക്ലാസിഫയർ (``VQC``), വേരിയേഷൻൽ ക്വാണ്ടം റിഗ്രെസർ (``VQR``) എന്നിവ നൽകുന്നു. ട്യൂട്ടോറിയൽ ഇനിപ്പറയുന്ന രീതിയിൽ ക്രമീകരിച്ചിരിക്കുന്നു:
pt_un: Neste tutorial nós mostramos como o ``NeuralNetworkClassifier`` e ``NeuralNetworkRegressor`` são usados. Ambos recebem como entrada um (Quantum) ``NeuralNetwork`` e alavancam em um contexto especifico. Em ambos os casos nós também provemos uma variante pré-configurada por conveniência, o Variational Quantum Classifier (``VQC``) e o Variational Quantum Regressor (``VQR``). O tutorial é estruturado da seguinte forma:
ta: இந்த டுடோரியலில் ``NeuralNetworkClassifier`` மற்றும் ``NeuralNetworkRegressor`` எவ்வாறு பயன்படுத்தப்படுகின்றன என்பதைக் காட்டுகிறோம். இருவரும் ஒரு உள்ளீடாக ஒரு (குவாண்டம்) ``NeuralNetwork`` ஐ எடுத்து ஒரு குறிப்பிட்ட சூழலில் பயன்படுத்துகிறார்கள். இரண்டு நிகழ்வுகளிலும் வசதிக்காக முன்பே உள்ளமைக்கப்பட்ட மாறுபாட்டை நாங்கள் வழங்குகிறோம், மாறுபட்ட குவாண்டம் வகைப்படுத்தி (``VQC``) மற்றும் மாறுபட்ட குவாண்டம் பின்னடைவு (``VQR``). பயிற்சி பின்வருமாறு கட்டமைக்கப்பட்டுள்ளது:
zh_tw: 本教程將展示如何使用 ``NeuralNetworkClassifier``和``NeuralNetworkRegressor`` 。兩者都將（量子）``NeuralNetwork`` 作為輸入並在特定環境中利用它。在這兩種情況下，為了方便起見，預設了變體，變分量子分類器（``VQC``）和變分量子迴歸器（``VQR``）。本教程的結構如下。

source: `Classification <#Classification>`__
de: ` Klassifikation <#Classification> ` __
es_un: `Clasificación <#Classification>`__
hi_in: `वर्गीकरण <#Classification>`__
ja: `分類 <#Classification>`__
pt_un: `Classificação <#Classification>`__
zh_tw: `分類 <#Classification>`__

source: Classification with an ``EstimatorQNN``
de: Klassifikation mit einem ``EstimatorQNN``
es_un: Clasificación con una ``EstimatorQNN``
fr: Classification avec ``EstimatorQNN``
ja: ``EstimatorQNN`` による分類
ta: ``EstimatorQNN`` உடன் வகைப்படுத்துதல்

source: Classification with a ``SamplerQNN``
de: Klassifikation mit einem ``SamplerQNN``
es_un: Clasificación con una ``SamplerQNN``
fr: Classification avec un ``SamplerQNN``
ja: ``SamplerQNN`` による分類
ta: ``SamplerQNN`` உடன் வகைப்படுத்துதல்

source: Variational Quantum Classifier (``VQC``)
bn_bn: পরিবর্তনশীল (ভ্যারিয়েশনাল) কোয়ান্টাম শ্রেণিবিন্যাসকরক (ক্লাসিফায়ার) (ভি.কিউ.সি)
de: Variationaler Quantenregressor (``VQR``)
es_un: Clasificador Cuántico Variacional (Variational Quantum Classifier, ``VQC``)
fr: Classifieur Variationnel Quantique (VQC)
hi_in: वैरिएशनल क्वांटम क्लासिफायर (``VQC``)
ja: 変分量子分類器 (``VQC``)
ml_in: വേരിയേഷൻൽ ക്വാണ്ടം ക്ലാസിഫയർ(``VQC``)
pt_un: Classificador Variacional Quântico (``VQC``)
ta: மாறுபட்ட குவாண்டம் வகைப்படுத்தி (``VQC``)
zh_tw: 變分量子分類器（``VQC``）

source: `Regression <#Regression>`__
es_un: `Regresión <#Regression>`__
fr: `Régression <#Regression>` __
hi_in: `रिग्रेशन <#Regression>`__
ja: `回帰 <#Regression>`__
pt_un: ` Regressão <#Regression> ` __
zh_tw: `迴歸 <#Regression>`__

source: Regression with an ``EstimatorQNN``
de: Regression mit einem ``EstimatorQNN``
es_un: Regresión con una ``EstimatorQNN``
fr: Classification avec ``EstimatorQNN``
ja: `EstimatorQNN`` による回帰
ta: ``EstimatorQNN`` உடன் பின்னடைவு

source: Variational Quantum Regressor (``VQR``)
bn_bn: পরিবর্তনশীল (ভ্যারিয়েশনাল) কোয়ান্টাম রিগ্রেসর (ভি.কিউ.আর)
de: Variationaler Quantenregressor (``VQR``)
es_un: Regresor Cuántico Variacional (Variational Quantum Regressor, ``VQR``)
fr: Régresseur Variationnel Quantique (``VQR``)
hi_in: वैरिएशनल क्वांटम रेजिस्टर (``VQR``)
ja: 変分量子回帰器 (``VQR``)
ml_in: വേരിയേഷൻൽ ക്വാണ്ടം റിഗ്രസ്സർ(``VQR``)
pt_un: Regressor Variacional Quântico (` ` VQR ` `)
ta: மாறுபட்ட குவாண்டம் பின்னடைவு (`` VQR``)
zh_tw: 變分量子迴歸器（``VQR``）

source: Classification
bn_bn: শ্রেণিবিভাগ (ক্লাসিফিকেশন)
de: Klassifikation
es_un: Clasificación
ja: 分類
pt_un: Classificação
ta: வகைப்படுத்துதல்
zh_tw: 分類

source: We prepare a simple classification dataset to illustrate the following algorithms.
bn_bn: এই ধারাক্রম (অ্যালগোরিদম​) কে বোঝানোর জন্য আমরা একটি সহজ শ্রেণিবিন্যাসকরণ তথ্যশালা (ক্লাসিফিকেশন ডাটাসেট​) বানিয়েছি।
de: Wir bereiten einen einfachen Klassifikationsdatensatz vor, um die folgenden Algorithmen zu veranschaulichen.
es_un: Preparamos un conjunto de datos de clasificación simple para ilustrar los siguientes algoritmos.
fr: Nous préparons un ensemble de données de classification simple pour illustrer les algorithmes suivants.
hi_in: हम निम्नलिखित एल्गोरिदम को स्पष्ट करने के लिए एक सरल वर्गीकरण डेटासेट तैयार करते हैं।
ja: 以下のアルゴリズムを説明するために、簡単な分類データセットを用意します。
ml_in: ഇനിപ്പറയുന്ന അൽ‌ഗോരിതം വിശദീകരിക്കുന്നതിന് ഞമ്മൾ ഒരു ലളിതമായ ക്ലാസ്സിഫിക്കേഷൻ ഡാറ്റാസെറ്റ് തയ്യാറാക്കുന്നു.
pt_un: Preparamos um "dataset" de classificação simples para ilustrar os algoritmos a seguir.
ta: பின்வரும் வழிமுறைகளை விளக்குவதற்கு எளிய வகைப்பாடு தரவுத்தொகுப்பை நாங்கள் தயார் செய்கிறோம்.
zh_tw: 為了說明下面的演算法，我們有一個簡單的分類資料集。

source: Classification with the an ``EstimatorQNN``
es_un: Clasificación con una ``EstimatorQNN``

source: First we show how an ``EstimatorQNN`` can be used for classification within a ``NeuralNetworkClassifier``. In this context, the ``EstimatorQNN`` is expected to return one-dimensional output in :math:`[-1, +1]`. This only works for binary classification and we assign the two classes to :math:`\{-1, +1\}`.
de: Zuerst zeigen wir, wie ein ``EstimatorQNN`` zur Klassifizierung innerhalb eines ``NeuralNetworkClassifier`` verwendet werden kann. In diesem Zusammenhang wird erwartet, dass der ``EstimatorQNN`` eindimensionale Ausgabe in :math:`[-1, +1]` zurückgibt. Dies funktioniert nur für die binäre Klassifikation und wir weisen die beiden Klassen :math:`\{-1, +1\}` zu.
es_un: Primero mostramos cómo se puede usar una ``EstimatorQNN`` para la clasificación dentro de un ``NeuralNetworkClassifier``. En este contexto, se espera que ``EstimatorQNN`` devuelva una salida unidimensional en :math:`[-1, +1]`. Esto solo funciona para la clasificación binaria y asignamos las dos clases a :math:`\{-1, +1\}`.
fr: Premièrement, nous montrons comment ``EstimatorQNN`` peut être utilisé pour la classification dans un ``NeuralNetworkClassifier``. Dans ce contexte, ``EstimatorQNN`` est censé renvoyer une sortie unidimensionnelle dans :math:`[-1, +1]`. Cela ne fonctionne que pour la classification binaire et nous affectons les deux classes à :math:` \{ -1, + 1\}`.
ja: まず、 ``EstimatorQNN`` が ``NeuralNetworkClassifier`` の中でどのように分類に使われるかを示します。ここでは、 ``OpflowQNN`` は、 :math:`[-1, +1]` の1次元の出力を返すことが期待されています。 これは、二値分類にしか使えないので、2つのクラスを :math:`\{-1, +1\}` に割り当てます。

source: Create a quantum neural network
de: Erstelle ein neuronales Quantenetzwerk
es_un: Crear una red neuronal cuántica
fr: Création d'un réseau de neurones quantique
ja: 量子ニューラル・ネットワークの作成
ta: ஒரு குவாண்டம் நியூரல் நெட்வொர்க்கை உருவாக்கவும்

source: We will add a callback function called ``callback_graph``. This will be called for each iteration of the optimizer and will be passed two parameters: the current weights and the value of the objective function at those weights. For our function, we append the value of the objective function to an array so we can plot iteration versus objective function value and update the graph with each iteration. However, you can do whatever you want with a callback function as long as it gets the two parameters mentioned passed.
bn_bn: আমরা ``callback_graph`` নামে একটি কলব্যাক ফাংশন যোগ করব। এটি অপ্টিমাইজারের প্রতিটি পুনরাবৃত্তির জন্য বলা হবে এবং দুটি পরামিতি পাস করা হবে: বর্তমান ওজন এবং সেই ওজনগুলিতে উদ্দেশ্যমূলক কাজের মান। আমাদের ফাংশনের জন্য, আমরা উদ্দেশ্য ফাংশনের মানকে একটি অ্যারেতে যুক্ত করি যাতে আমরা পুনরাবৃত্তি বনাম বস্তুনিষ্ঠ ফাংশন ভ্যালু প্লট করতে পারি এবং প্রতিটি পুনরাবৃত্তির সাথে গ্রাফ আপডেট করতে পারি। যাইহোক, আপনি কলব্যাক ফাংশন দিয়ে যতটুকু চান তা করতে পারেন যতক্ষণ না এটি দুটি প্যারামিটার পাস করে।
de: Wir fügen eine Callback-Funktion mit dem Namen ` ` callback_graph ` ` hinzu. Diese wird bei jeder Iteration des Optimierungsprogramms aufgerufen und bekommt zwei Parameter übergeben: die aktuellen Gewichte und den Wert der Zielfunktion bei diesen Gewichte. Für unsere Funktion hängen wir den Wert der Zielfunktion an ein Array an, so dass wir Iteration gegen die Zielfunktionswerte plotten können und die Grafik mit jeder Iteration aktualisieren können. Mit einer Callback-Funktion können Sie jedoch tun was Sie wollen, solange die beiden genannten Parameter übergeben werden.
es_un: Agregaremos una función de devolución de llamada nombrada ``callback_graph``. Esto se llamará para cada iteración del optimizador y se le pasarán dos parámetros: los pesos actuales y el valor de la función objetivo en esos pesos. Para nuestra función, agregamos el valor de la función objetivo a un arreglo para que podamos graficar la iteración frente al valor de la función objetivo y actualizar la gráfica con cada iteración. Sin embargo, puedes hacer lo que desees con una función de devolución de llamada siempre y cuando se pasen los dos parámetros mencionados.
fr: Nous allons ajouter une fonction de rappel appelée ``callback_graph``. Elle sera appelée pour chaque itération de l'optimiseur et recevra deux paramètres : les poids actuels et la valeur de la fonction objectif à ces pondérations. Pour notre fonction, nous ajoutons la valeur de la fonction objectif à un tableau pour que nous puissions tracer la valeur de l'itération par rapport à la fonction objectif et mettre à jour le graphe avec chaque itération. Cependant, vous pouvez faire ce que vous voulez avec une fonction de rappel tant qu'elle obtient les deux paramètres mentionnés.
ja: ``callback_graph`` というコールバック関数を追加します。 これはオプティマイザの反復ごとに呼び出され、現在の重みとその重みでの目的関数の値という、2つのパラメータが渡されます。 ここでは関数に、目的関数の値を配列に追加します。これによって反復と目的関数の値をプロットし、反復ごとにグラフを更新することができます。とはいえ、2つのパラメータが渡される限り、コールバック関数であなたは何でも好きなことをすることができます。
pt_un: Vamos adicionar uma função de callback chamada ``callback_graph``. Ela será chamada para cada iteração do otimizador e dois parâmetros serão passados: os pesos atuais e o valor da função objetivo nesses pesos. Para nossa função, acrescentamos o valor da função objetivo a um array para que possamos plotar a iteração versus o valor da função objetivo e atualizar o gráfico com cada iteração. No entanto, você pode fazer o que quiser com uma função de callback, desde que os dois parâmetros mencionados sejam passados.
ta: ``callback_graph`` எனப்படும் திரும்ப அழைக்கும் செயல்பாட்டைச் சேர்ப்போம். இது ஆப்டிமைசரின் ஒவ்வொரு மறு செய்கைக்கும் அழைக்கப்படும் மற்றும் இரண்டு அளவுருக்கள் அனுப்பப்படும்: தற்போதைய எடைகள் மற்றும் அந்த எடைகளில் புறநிலை செயல்பாட்டின் மதிப்பு. எங்கள் செயல்பாட்டிற்காக, புறநிலை செயல்பாட்டின் மதிப்பை ஒரு வரிசையில் சேர்க்கிறோம், எனவே மறு செய்கை மற்றும் புறநிலை செயல்பாட்டு மதிப்புக்கு எதிராக திட்டமிடலாம் மற்றும் ஒவ்வொரு மறு செய்கையுடன் வரைபடத்தைப் புதுப்பிக்கலாம். இருப்பினும், குறிப்பிடப்பட்ட இரண்டு அளவுருக்களைப் பெறும் வரை நீங்கள் திரும்ப அழைக்கும் செயல்பாட்டின் மூலம் நீங்கள் விரும்பியதைச் செய்யலாம்.

source: Now, when the model is trained, we can explore the weights of the neural network. Please note, the number of weights is defined by ansatz.
de: Nun, wenn das Modell trainiert ist, können wir die Gewichte des neuronalen Netzwerks erforschen. Bitte beachte, dass die Anzahl der Gewichte durch den Ansatz definiert ist.
es_un: Ahora, cuando el modelo está entrenado, podemos explorar los pesos de la red neuronal. Ten en cuenta que el número de pesos está definido por el ansatz.
fr: Maintenant, quand le modèle est entraîné, nous pouvons explorer les poids du réseau neuronal. Veuillez noter que le nombre de poids est défini par ansatz.
ja: さて、モデルの学習が完了したら、ニューラルネットワークの重みを探索することができます。重みの数はansatzで定義されていることに注意してください。
ta: இப்போது, மாதிரி பயிற்சியளிக்கப்படும்போது, ​​நரம்பியல் வலையமைப்பின் எடைகளை நாம் ஆராயலாம். தயவுசெய்து கவனிக்கவும், எடைகளின் எண்ணிக்கை ansatz மூலம் வரையறுக்கப்படுகிறது.

source: Next we show how a ``SamplerQNN`` can be used for classification within a ``NeuralNetworkClassifier``. In this context, the ``SamplerQNN`` is expected to return :math:`d`-dimensional probability vector as output, where :math:`d` denotes the number of classes. The underlying ``Sampler`` primitive returns quasi-distributions of bit strings and we just need to define a mapping from the measured bitstrings to the different classes. For binary classification we use the parity mapping.
de: Als nächstes zeigen wir, wie ein ``SamplerQNN`` zur Klassifizierung innerhalb eines ``NeuralNetworkClassifier`` verwendet werden kann. In diesem Zusammenhang wird erwartet, dass der ``SamplerQNN`` :math:`d`-dimensionale Wahrscheinlichkeitsvektoren als Ausgabe zurückgibt, wobei :math:`d` die Anzahl der Klassen angibt. Die zugrunde liegende ``Sampler`` primitive gibt Quasi-Distributionen von Bit-Strings zurück und wir müssen nur ein Mapping von den gemessenen Bitstrings zu den verschiedenen Klassen definieren. Für die Binärklassifizierung verwenden wir das Paritätsmapping.
es_un: A continuación mostramos cómo se puede usar una ``SamplerQNN`` para la clasificación dentro de un ``NeuralNetworkClassifier``. En este contexto, se espera que ``SamplerQNN`` devuelva un vector de probabilidad de dimensión :math:`d` como salida, donde :math:`d` denota el número de clases. La primitiva ``Sampler`` subyacente devuelve cuasi-distribuciones de cadenas de bits y solo necesitamos definir un mapeo de las cadenas de bits medidas a las diferentes clases. Para la clasificación binaria usamos el mapeo de paridad.
fr: Ensuite, nous montrons comment ``SamplerQNN`` peut être utilisé pour la classification à l'intérieur d'un ``NeuralNetworkClassifier``. Dans ce contexte, le ``SamplerQNN`` est censé renvoyer le vecteur de probabilité :math:`d`-dimensionnel comme sortie, où :math:`d` indique le nombre de classes. La primitive sous jacente ``Sampler`` reetourne les quasi-distributions de bit strings , et il suffit de définir une correspondance entre les bitstrings mesuré et les différeentes classes. Pour une classification binaire, nous utilisons le maaping de parité.
ja: 次に、 ``SamplerQNN`` が ``NeuralNetworkClassifier`` の中でどのように分類に使われるかを示します。ここでは、 ``SamplerQNN`` は、 :math:`d` -次元の確率ベクトルを出力として返すことが期待されます。ここで :math:`d` はクラス数です。基礎となる ``Sampler`` primitiveはビット列の準分布を返すので、測定されたビット列から異なるクラスへのマッピングを定義するだけでよいのです。2値分類には、パリティーマッピングを用います。
ta: அடுத்து, ``நியூரல்நெட்வொர்க் கிளாசிஃபையர்``க்குள் வகைப்படுத்துவதற்கு `` மாதிரிக்யூஎன்என்`` எவ்வாறு பயன்படுத்தப்படலாம் என்பதைக் காட்டுகிறோம். இந்த சூழலில், ``SamplerQNN`` ஆனது :math:`d`-பரிமாண நிகழ்தகவு வெக்டரை வெளியீட்டாக வழங்கும் என்று எதிர்பார்க்கப்படுகிறது, இங்கு :math:`d` என்பது வகுப்புகளின் எண்ணிக்கையைக் குறிக்கிறது. அடிப்படையான ``சாம்ப்ளர்`` பிட் சரங்களின் அரை-பகிர்வுகளை வழங்குகிறது, மேலும் அளவிடப்பட்ட பிட்ஸ்ட்ரிங்கில் இருந்து வெவ்வேறு வகுப்புகளுக்கு ஒரு மேப்பிங்கை நாம் வரையறுக்க வேண்டும். பைனரி வகைப்பாட்டிற்கு நாம் சமநிலை மேப்பிங்கைப் பயன்படுத்துகிறோம்.

source: Again, once the model is trained we can take a look at the weights. As we set ``reps=1`` explicitly in our ansatz, we can see less parameters than in the previous model.
de: Wieder einmal können wir uns die Gewichte ansehen, sobald das Modell trainiert ist. Da wir ``reps=1`` explizit in unserem Ansatz, gesetzt haben, können wir weniger Parameter sehen als im vorherigen Modell.
es_un: Nuevamente, una vez que el modelo está entrenado, podemos echar un vistazo a los pesos. Como configuramos explícitamente ``reps=1`` en nuestro ansatz, podemos ver menos parámetros que en el modelo anterior.
fr: Encore une fois, une fois le modèle entraîné, nous pouvons examiner les poids. Comme nous avons défini ``reps=1``explicitement dans notre ansatz, nous pouvons voir moins de paramètres que dans le modèle précédent.
ja: 繰り返しになりますが、モデルの学習が完了したら、重みを見ることができます。Ansatzで明示的に ``reps=1`` を設定しているので、前のモデルよりもパラメーターが少なくなっていることがわかります。
ta: மீண்டும், மாதிரிப் பயிற்சி பெற்றவுடன் நாம் எடைகளைப் பார்க்கலாம். எங்கள் ansatz இல் வெளிப்படையாக ``reps=1`` அமைக்கும்போது, முந்தைய மாதிரியைவிட குறைவான அளவுருக்களைக் காணலாம்.

source: The ``VQC`` is a special variant of the ``NeuralNetworkClassifier`` with a ``SamplerQNN``. It applies a parity mapping (or extensions to multiple classes) to map from the bitstring to the classification, which results in a probability vector, which is interpreted as a one-hot encoded result. By default, it applies this the ``CrossEntropyLoss`` function that expects labels given in one-hot encoded format and will return predictions in that format too.
de: Der ``VQC`` ist eine spezielle Variante des ``NeuralNetworkClassifier`` mit einem ``SamplerQNN``. Es wird eine Paritätsabbildung (oder Erweiterungen für mehrere Klassen) verwendet, die den Bitstring auf die Klasse abbilden, was zu einem Wahrscheinlichkeitsvektor führt, der als ein one-hot-kodiertes Ergebnis interpretiert wird. Standardmäßig wird hierfür die ``CrossEntropyLoss``-Funktion angewendet, die Labels in one-hot-kodiertem Format erwartet und auch Vorhersagen in diesem Format zurückgibt.
es_un: El ``VQC`` es una variante especial del ``NeuralNetworkClassifier`` con una ``SamplerQNN``. Aplica un mapeo de paridad (o extensiones a varias clases) para mapear desde la cadena de bits hasta la clasificación, lo que da como resultado un vector de probabilidad, que se interpreta como un resultado codificado con one-hot. Por defecto, aplica esta función ``CrossEntropyLoss`` que espera etiquetas dadas en el formato codificado con one-hot y devolverá predicciones en ese formato también.
fr: ``VQC`` est une variante spéciale de ``NeuralNetworkClassifier`` avec un ``SamplerQNN``. Il applique une correspondance de parité (ou des extensions à plusieurs classes) pour mapper la chaîne de bits à la classification, ce qui donne lieu à un vecteur de probabilité, qui est interprété comme un résultat à encodage 1 parmi n (one-hot encoding). Par défaut, il applique la fonction ``CrossEntropyLoss`` qui attend les étiquettes données en un format d'encodage 1 parmi n et qui renverra également les prédictions dans ce format.
ja: ``VQC`` は、``SamplerQNN`` を用いた ``NeuralNetworkClassifier`` の特別なバリエーションです。``VQC`` は、パリティー・マッピング（または複数のクラスへの拡張）を適用して、ビット列から分類にマッピングし、その結果、確率ベクトルが得られ、ワンショットでエンコードされた結果として解釈されます。デフォルトでは、 ``CrossEntropyLoss`` 関数を適用します。この関数は、ワンショットでエンコードされたフォーマットで与えられたラベルを想定しており、そのフォーマットでも予測値を返します。
ta: ``VQC`` என்பது ``SamplerQNN`` உடன் ``NeuralNetworkClassifier``ன் ஒரு சிறப்பு மாறுபாடு ஆகும். இது பிட்ஸ்ட்ரிங்கில் இருந்து வகைப்பாடு வரை வரைபடத்திற்கு ஒரு சமநிலை மேப்பிங்கை (அல்லது பல வகுப்புகளுக்கு நீட்டிப்புகள்) பயன்படுத்துகிறது, இதன் விளைவாக ஒரு நிகழ்தகவு திசையன் ஏற்படுகிறது, இது ஒரு சூடான குறியிடப்பட்ட முடிவாக விளக்கப்படுகிறது. இயல்பாக, இது ஒரு சூடான குறியாக்கப்பட்ட வடிவத்தில் கொடுக்கப்பட்ட லேபிள்களை எதிர்பார்க்கும் ``CrossEntropyLoss`` செயல்பாட்டைப் பயன்படுத்துகிறது மற்றும் அந்த வடிவமைப்பிலும் கணிப்புகளை வழங்கும்.

source: Multiple classes with VQC
de: Mehrere Klassen mit VQC
es_un: Clases múltiples con VQC
fr: Classes multiples avec VQC
ja: VQC を使用した複数のクラス
ta: VQC உடன் பல வகுப்புகள்
