Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/02_neural_network_classifier_and_regressor.po
Languages: bn_bn, de, es_un, fr, hi_in, ja, ml_in, pt_un, ta, zh_tw

source: In this section we generate an artificial dataset that contains samples of three classes and show how to train a model to classify this dataset. This example shows how to tackle more interesting problems in machine learning. Of course, for a sake of short training time we prepare a tiny dataset. We employ ``make_classification`` from SciKit-Learn to generate a dataset. There 10 samples in the dataset, 2 features, that means we can still have a nice plot of the dataset, as well as no redundant features, these are features are generated as a combinations of the other features. Also, we have 3 different classes in the dataset, each classes one kind of centroid and we set class separation to ``2.0``, a slight increase from the default value of ``1.0`` to ease the classification problem.
de: In diesem Abschnitt generieren wir einen künstlichen Datensatz, der Stichproben von drei Klassen enthält und zeigt, wie man ein Modell für die Klassifizierung dieses Datensatzes trainiert. Dieses Beispiel zeigt, wie man interessantere Probleme im maschinellen Lernen angeht. Natürlich bereiten wir für eine kurze Trainingszeit einen kleinen Datensatz vor. Wir verwenden ``make_classification`` von SciKit-Learn um einen Datensatz zu generieren. Es gibt 10 Beispiele im Datensatz und 2 Features, das bedeutet, dass wir noch eine schöne Abbildung des Datensatzes haben können, sowie keine redundanten Features. Das sind Features, wleche als Kombination der anderen Features generiert werden. Außerdem haben wir 3 verschiedene Klassen im Datensatz, jede Klasse hat einen Schwerpunkt und wir setzen die Klassentrennung auf ``2. ``, eine leichte Erhöhung gegenüber dem Standardwert von ``1.0`` um das Klassifizierungsproblem zu vereinfachen.
es_un: En esta sección generamos un conjunto de datos artificial que contiene muestras de tres clases y mostramos cómo entrenar un modelo para clasificar este conjunto de datos. Este ejemplo muestra cómo abordar problemas más interesantes en el machine learning. Por supuesto, en aras del corto tiempo de entrenamiento, preparamos un pequeño conjunto de datos. Empleamos ``make_classification`` de SciKit-Learn para generar un conjunto de datos. Hay 10 muestras en el conjunto de datos, con 2 características, lo que significa que todavía podemos tener una buena gráfica del conjunto de datos, así como características redundantes, estas características se generan como una combinación de las otras. Además, tenemos 3 clases diferentes en el conjunto de datos, cada clase tiene un tipo de centroide y establecemos la separación de clases en ``2.0``, un ligero aumento del valor predeterminado de ``1.0`` para facilitar el problema de clasificación.
fr: Dans cette section, nous générons un jeu de données artificiel contenant des échantillons de trois classes et montrant comment former un modèle pour classer ce jeu de données. Cet exemple montre comment résoudre des problèmes plus intéressants dans l'apprentissage automatique. Bien sûr, pour des raisons de durée d'entraînement, nous préparons un petit jeu de données. Nous utilisons ``make_classification`` de SciKit-Learn pour générer un jeu de données. Il y a 10 échantillons dans le jeu de données, 2 fonctionnalités, ce qui signifie que nous pouvons encore avoir un joli tracé du jeu de données, ainsi qu’aucune fonctionnalité redondante, ces fonctionnalités sont générées en tant que combinaisons des autres fonctionnalités. De plus, nous avons 3 classes différentes dans le jeu de données, chaque classe un type de centroid et nous définissons la séparation de classe à ``2. ``, une légère augmentation à partir de la valeur par défaut de ``1.0`` pour faciliter le problème de classification.
ja: この節では，3つのクラスのサンプルを含む人工データセットを生成し，このデータセットを分類するモデルをどのように学習するかを示します。この例は，機械学習におけるより興味深い問題への取り組み方を示しています。もちろん、学習時間を短くするために、小さなデータセットを用意します。SciKit-Learnの ``make_classification`` を用いてデータセットを生成します。データセットには10個のサンプル、2個の特徴量がありますが、これはデータセットをきれいにプロットできることと、冗長な特徴はなく、これらは他の特徴量の組み合わせとして生成されることを意味しています。また、データセットには3つの異なるクラスがあり、それぞれのクラスには1種類のセントロイドがあります。クラス分離は、分類問題を緩和するために、デフォルト値の ``1.0`` から少し増やして ``2.0`` に設定しました。
ta: இந்தப் பிரிவில், மூன்று வகுப்புகளின் மாதிரிகளைக் கொண்ட செயற்கைத் தரவுத்தொகுப்பை உருவாக்கி, இந்தத் தரவுத்தொகுப்பை வகைப்படுத்துவதற்கு ஒரு மாதிரியைப் பயிற்றுவிப்பது எப்படி என்பதைக் காட்டுகிறோம். இயந்திர கற்றலில் மிகவும் சுவாரஸ்யமான சிக்கல்களை எவ்வாறு சமாளிப்பது என்பதை இந்த எடுத்துக்காட்டு காட்டுகிறது. நிச்சயமாக, குறுகிய பயிற்சி நேரத்திற்காக நாங்கள் ஒரு சிறிய தரவுத்தொகுப்பை தயார் செய்கிறோம். தரவுத்தொகுப்பை உருவாக்க SciKit-Learn இலிருந்து ``make_classification`` ஐப் பயன்படுத்துகிறோம். தரவுத்தொகுப்பில் 10 மாதிரிகள் உள்ளன, 2 அம்சங்கள், அதாவது தரவுத்தொகுப்பின் நல்ல சதித்திட்டத்தை நாம் இன்னும் வைத்திருக்க முடியும், அதே போல் தேவையற்ற அம்சங்கள் எதுவும் இல்லை, இவை மற்ற அம்சங்களின் கலவையாக உருவாக்கப்பட்ட அம்சங்கள். மேலும், தரவுத்தொகுப்பில் எங்களிடம் 3 வெவ்வேறு வகுப்புகள் உள்ளன, ஒவ்வொரு வகுப்புகளும் ஒரு வகையான சென்ட்ராய்டு மற்றும் வகுப்பைப் பிரிப்பதை ``2.0`` ஆக அமைக்கிறோம், வகைப்படுத்தல் சிக்கலை எளிதாக்க, இயல்புநிலை மதிப்பான ``1.0`` இலிருந்து சிறிது அதிகரிப்பு.

source: Once the dataset is generated we scale the features into the range ``[0, 1]``.
de: Sobald der Datensatz erstellt wurde, skalieren wir die Funktionen in den Bereich ``[0, 1]``.
es_un: Una vez que el conjunto de datos es generado, escalamos las características en el rango ``[0, 1]``.
fr: Une fois que le jeu de données est généré, nous mettons à l'échelle les fonctionnalités dans la plage ``[0, 1]``.
ja: データセットが生成されると、その機能を ``[0, 1]`` の範囲に拡大します。
ta: தரவுத்தொகுப்பு உருவாக்கப்பட்டவுடன் அம்சங்களை ``[0, 1]`` வரம்பிற்குள் அளவிடுவோம்.

source: Let’s see how our dataset looks like.
es_un: Veamos cómo se ve nuestro conjunto de datos.

source: We also transform labels and make them categorical.
de: Wir transformieren auch Labels und machen sie kategorisch.
es_un: También transformamos las etiquetas y las convertimos en categóricas.
ja: また、ラベルを変換してカテゴリー化することもできます。
ta: நாங்கள் லேபிள்களை மாற்றி அவற்றை வகைப்படுத்துகிறோம்.

source: We create an instance of ``VQC`` similar to the previous example, but in this case we pass a minimal set of parameters. Instead of feature map and ansatz we pass just the number of qubits that is equal to the number of features in the dataset, an optimizer with a low number of iteration to reduce training time, a quantum instance, and a callback to observe progress.
de: Wir erstellen eine Instanz von ``VQC`` ähnlich dem vorherigen Beispiel, aber in diesem Fall übergeben wir einen minimalen Satz an Parametern. Anstelle von Merkmalskarte und Ansatz übergeben wir nur die Anzahl der Qubits, die der Anzahl der Features im Datensatz entspricht, einen Optimierer mit einer geringen Anzahl von Iterationen um die Trainingszeit zu verkleinern, eine Quanteninstanz und einen Callback, um den Fortschritt zu beobachten.
es_un: Creamos una instancia de ``VQC`` similar al ejemplo anterior, pero en este caso pasamos un conjunto mínimo de parámetros. En lugar de un mapa de características y un ansatz, pasamos solo la cantidad de qubits que es igual a la cantidad de características en el conjunto de datos, un optimizador con un bajo número de iteraciones para reducir el tiempo de entrenamiento, una instancia cuántica (quantum instance) y una devolución de llamada (callback) para observar el progreso.
ja: 前の例と同様に ``VQC`` のインスタンスを作成しますが、今回は最小限のパラメーターを渡します。特徴量マップとansatzの代わりに、データセットの特徴量数に等しい量子ビットの数、学習時間を短縮するための低い反復回数のオプティマイザー、量子インスタンス、そして進捗を確認するためのコールバックを渡します。
ta: முந்தைய உதாரணத்தைப் போலவே ``VQC`` இன் நிகழ்வை உருவாக்குகிறோம், ஆனால் இந்த விஷயத்தில் நாம் குறைந்தபட்ச அளவுருக்களை அனுப்புகிறோம். அம்ச வரைபடம் மற்றும் அன்சாட்ஸுக்குப் பதிலாக, தரவுத்தொகுப்பில் உள்ள அம்சங்களின் எண்ணிக்கைக்கு சமமான குவிட்களின் எண்ணிக்கையை மட்டுமே கடந்து செல்கிறோம், பயிற்சி நேரத்தைக் குறைக்க குறைந்த எண்ணிக்கையிலான மறு செய்கையுடன் கூடிய ஆப்டிமைசர், ஒரு குவாண்டம் நிகழ்வு மற்றும் முன்னேற்றத்தைக் காண திரும்பவும்.

source: Start the training process in the same way as in previous examples.
de: Starte den Trainingsprozess in der gleichen Weise wie in den vorherigen Beispielen.
es_un: Inicia el proceso de entrenamiento de la misma forma que en los ejemplos anteriores.
ja: 前の例と同じ方法でトレーニング・プロセスを開始します。
ta: முந்தைய எடுத்துக்காட்டுகளைப் போலவே பயிற்சி செயல்முறையைத் தொடங்கவும்.

source: Despite we had the low number of iterations, we achieved quite a good score. Let see the output of the ``predict`` method and compare the output with the ground truth.
de: Trotz der geringen Anzahl von Wiederholungen haben wir eine recht gute Punktzahl erreicht. Lass die Ausgabe der ``predict`` Methode sehen und die Ausgabe mit der Grundwahrheit zu vergleichen.
es_un: A pesar de que tuvimos el bajo número de iteraciones, logramos una puntuación bastante buena. Veamos el resultado del método ``predict`` y comparemos el resultado con la verdad fundamental.
ja: 反復回数が少なかったにもかかわらず、私たちはかなり良いスコアを達成しました。 ``predict`` メソッドの出力を確認し、出力と基本となる真の値と比較してみましょう。
ta: எங்களிடம் குறைந்த எண்ணிக்கையிலான மறு செய்கைகள் இருந்தபோதிலும், நாங்கள் நல்ல மதிப்பெண்ணைப் பெற்றுள்ளோம். ``முன்கணிப்பு`` முறையின் வெளியீட்டைப் பார்க்கலாம் மற்றும் வெளியீட்டை அடிப்படை உண்மையுடன் ஒப்பிடலாம்.

source: Regression
bn_bn: রিগ্রেশন
es_un: Regresión
fr: Régression
ja: 回帰
pt_un: Regressão
ta: பின்னடைவு
zh_tw: 迴歸

source: We prepare a simple regression dataset to illustrate the following algorithms.
bn_bn: এই ধারাক্রম গুলিকে (অ্যালগোরিদমস​​) কে বোঝানোর জন্য আমরা একটি সহজ রিগ্রেশন​ তথ্যশালা (ডাটাসেট​) বানাই।
de: Wir bereiten einen einfachen Regressionsdatensatz vor, um die folgenden Algorithmen zu veranschaulichen.
es_un: Preparamos un conjunto de datos de regresión simple para ilustrar los siguientes algoritmos.
fr: Nous préparons un ensemble de données de régression simple pour illustrer les algorithmes suivants.
hi_in: हम निम्नलिखित एल्गोरिदम को स्पष्ट करने के लिए एक साधारण प्रतिगमन डेटासेट तैयार करते हैं।
ja: 以下のアルゴリズムを説明するために、簡単な回帰データセットを用意します。
ml_in: ഇനിപ്പറയുന്ന അൽ‌ഗോരിതം വിശദീകരിക്കുന്നതിന് ഞമ്മൾ ഒരു ലളിതമായ റിഗ്രഷൻ ഡാറ്റാസെറ്റ് തയ്യാറാക്കുന്നു.
pt_un: Preparamos um conjunto de dados de regressão simples para ilustrar os algoritmos a seguir.
ta: பின்வரும் வழிமுறைகளை விளக்குவதற்கு எளிய பின்னடைவு தரவுத்தொகுப்பை நாங்கள் தயார் செய்கிறோம்.
zh_tw: 為了說明下面的演算法，我們有一個簡單的迴歸資料集。

source: Here we restrict to regression with an ``EstimatorQNN`` that returns values in :math:`[-1, +1]`. More complex and also multi-dimensional models could be constructed, also based on ``SamplerQNN`` but that exceeds the scope of this tutorial.
de: Hier beschränken wir uns auf Regression mit einem ``EstimatorQNN`` der Werte in :math:`[-1, +1]` zurückgibt. Komplexere und auch mehrdimensionale Modelle könnten mit ``SamplerQNN`` ebenfalls konstruiert werden, aber das ginge über den Rahmen dieses Tutorials hinaus.
es_un: Aquí restringimos la regresión con una ``EstimatorQNN`` que devuelve valores entre :math:`[-1, +1]`. Se podrían construir modelos más complejos y también multidimensionales, así como basados en ``SamplerQNN``, pero eso excede el alcance de este tutorial.
ja: ここでは、 :math:`[-1, +1]` の値を返す ``EstimatorQNN`` を使った回帰に限定します。もっと複雑で多次元のモデルを ``SamplerQNN`` をベースにして構築することもできますが、このチュートリアルの範囲を超えています。
ta: இங்கு மதிப்புகளை :math:`[-1, +1]` இல் வழங்கும் ``EstimatorQNN`` மூலம் பின்னடைவைக் கட்டுப்படுத்துகிறோம். மிகவும் சிக்கலான மற்றும் பல பரிமாண மாதிரிகள் உருவாக்கப்படலாம், மேலும் ``SamplerQNN`` அடிப்படையிலும் உருவாக்கப்படலாம் ஆனால் அது இந்த டுடோரியலின் நோக்கத்தை மீறுகிறது.

source: Similarly to the classification models, we can obtain an array of trained weights by querying a corresponding property of the model. In this model we have only one parameter defined as ``param_y`` above.
de: Ähnlich wie bei den Klassifikationsmodellen können wir eine Reihe von trainierten Gewichten erhalten, indem wir eine entsprechende Eigenschaft des Modells abfragen. In diesem Modell haben wir nur einen Parameter, oben definiert als ``param_y``.
es_un: De manera similar a los modelos de clasificación, podemos obtener una matriz de pesos entrenados consultando una propiedad correspondiente del modelo. En este modelo solo tenemos un parámetro arriba definido como ``param_y``.
ja: 分類モデルと同様に、モデルの対応するプロパティーを問い合わせることで、学習済み重みの配列を取得することができます。このモデルでは，上記の ``param_y`` として定義されたパラメーターを1つだけ持ちます。
ta: வகைப்பாடு மாதிரிகளைப் போலவே, மாதிரியின் தொடர்புடைய பண்புகளை வினவுவதன் மூலம் பயிற்சி பெற்ற எடைகளின் வரிசையைப் பெறலாம். இந்த மாதிரியில் மேலே ``param_y`` என வரையறுக்கப்பட்ட ஒரு அளவுரு மட்டுமே உள்ளது.

source: Regression with the Variational Quantum Regressor (``VQR``)
bn_bn: পরিবর্তনশীল (ভ্যারিয়েশনাল) কোয়ান্টাম রিগ্রেশর (``VQR``) দ্বারা রিগ্রেশন।
de: Regression mit dem Variationalen Quantenregressor (``VQR``)
es_un: Regresión con el Regresor Cuántico Variacional (Variational Quantum Regressor, ``VQR``)
fr: Régression avec le Régresseur Quantique Variationnel (``VQR``)
hi_in: वैरिएशनल क्वांटम रेजिस्टर के साथ रिग्रेशन (``VQR``)
ja: 変分量子回帰器 (``VQR``) による回帰
ml_in: വേരിയേഷൻൽ ക്വാണ്ടം റിഗ്രസർ (``VQR``) ഉപയോഗിച്ചുള്ള റിഗ്രഷൻ
pt_un: Regressão com o Regressor Quântico Variacional (`` VQR``)
ta: மாறுபட்ட குவாண்டம் பின்னடைவுடன் பின்னடைவு (``VQR``)
zh_tw: 通過變分量子迴歸器迴歸（``VQR``）

source: Similar to the ``VQC`` for classification, the ``VQR`` is a special variant of the ``NeuralNetworkRegressor`` with a ``EstimatorQNN``. By default it considers the ``L2Loss`` function to minimize the mean squared error between predictions and targets.
de: Ähnlich wie der ``VQC`` für die Klassifizierung, ist der ``VQR`` eine spezielle Variante des ``NeuralNetworkRegressor`` mit einem ``EstimatorQNN``. Standardmäßig verwendet es die ``L2Loss``-Funktion, um die mittlere quadratische Abweichung zwischen Vorhersagen und Zielwerte zu minimieren.
es_un: Similar al ``VQC`` para la clasificación, el ``VQR`` es una variante especial del ``NeuralNetworkRegressor`` con una ``EstimatorQNN``. De forma predeterminada, considera la función ``L2Loss`` para minimizar el error cuadrático medio entre las predicciones y los objetivos.
ja: ``VQR`` は、分類用の ``VQC`` と同様に、``EstimatorQNN`` を用いた ``NeuralNetworkRegressor`` の特別な改良版です。デフォルトでは、予測値と目標値の間の平均二乗誤差を最小化するために、 ``L2Loss`` 関数を考慮します。
ta: வகைப்படுத்தலுக்கான ``VQC` போன்றது, ``VQR` என்பது ``EstimatorQNN`` உடன் ``NeuralNetworkRegressor``ன் சிறப்பு மாறுபாடாகும். முன்னறிவிப்புகள் மற்றும் இலக்குகளுக்கு இடையே சராசரி ஸ்கொயர் பிழையைக் குறைக்க, இயல்பாக இது ``L2Loss`` செயல்பாட்டைக் கருதுகிறது.

source: Let's see how our dataset looks like.
ja: データセットがどのように見えるか見てみましょう。
ta: நமது தரவுத்தொகுப்பு எப்படி இருக்கிறது என்று பார்ப்போம்.

source: Classification with an ``OpflowQNN``
bn_bn: ``OpflowQNN`` সহ শ্রেণিবিন্যাসকরণ (ক্লাসিফিকেশন)
hi_in: ``OpflowQNN`` के साथ वर्गीकरण
ml_in: ``OpflowQNN`` ഉപയോഗിച്ചുള്ള ക്ലാസിഫിക്കേഷൻ
pt_un: Classificação com um ``OpflowQNN``
zh_tw: 按``OpflowQNN``分類

source: Classification with a ``CircuitQNN``
bn_bn: ``CircuitQNN`` সহ শ্রেণিবিন্যাসকরণ (ক্লাসিফিকেশন)
hi_in: ``CircuitQNN`` के साथ वर्गीकरण
ml_in: ``CircuitQNN`` ഉപയോഗിച്ചുള്ള ക്ലാസിഫിക്കേഷൻ
pt_un: Classificação com um ``CircuitQNN``
zh_tw: 按 ` `CircuitQNN`` 分類

source: Regression with an ``OpflowQNN``
bn_bn: ``OpflowQNN`` দিয়ে রিগ্রেশন
hi_in: ``OpflowQNN`` के साथ प्रतिगमन
ml_in: ``OpflowQNN`` ഉപയോഗിച്ചുള്ള റിഗ്രഷൻ
pt_un: Regressão com ` ` OpflowQNN ` `
zh_tw: 按``OpflowQNN``進行回歸

source: Classification with the an ``OpflowQNN``
bn_bn: ``OpflowQNN`` সহ শ্রেণিবিন্যাসকরণ (ক্লাসিফিকেশন)
hi_in: ``OpflowQNN`` के साथ वर्गीकरण
ml_in: ``OpflowQNN`` ഉപയോഗിച്ചുള്ള ക്ലാസ്സിഫിക്കേഷൻ
pt_un: Classificação com um ``OpflowQNN``
zh_tw: 按``OpflowQNN``分類

source: First we show how an ``OpflowQNN`` can be used for classification within a ``NeuralNetworkClassifier``. In this context, the ``OpflowQNN`` is expected to return one-dimensional output in :math:`[-1, +1]`. This only works for binary classification and we assign the two classes to :math:`\{-1, +1\}`. For convenience, we use the ``TwoLayerQNN``, which is a special type of ``OpflowQNN`` defined via a feature map and an ansatz.
bn_bn: প্রথমে আমরা দেখি কীভাবে একটি ``OpflowQNN``-এর মধ্যে শ্রেণিবিন্যাসের জন্য একটি ``NeuralNetworkClassifier`` ব্যবহার করা যায়। এই প্রসঙ্গে, ``OpflowQNN`` :math:`[-1, +1]` তে এক-মাত্রিক আউটপুট ফেরত প্রত্যাশিত। এটি শুধুমাত্র বাইনারি শ্রেণিবিন্যাসের জন্য কাজ করে এবং আমরা দুটি ক্লাসকে :math:`\{-1, +1\}` এ বরাদ্দ করি। সুবিধার জন্য, আমরা ``TwoLayerQNN`` ব্যবহার করি, যা একটি বিশেষ ধরণের ``OpflowQNN`` যা বৈশিষ্ট্যের মানচিত্র এবং আনস্যাটজের মাধ্যমে সংজ্ঞায়িত করা হয়।
hi_in: पहले हम दिखाते हैं कि कैसे एक ``OpflowQNN`` का उपयोग ``NeuralNetworkClassifier`` में वर्गीकरण के लिए किया जा सकता है। इस संदर्भ में, ``OpflowQNN`` से :math:`[-1, +1]` में एक-आयामी उत्पाद लौटाने की उम्मीद है। यह केवल द्विचर वर्गीकरण के लिए काम करता है और हम दो वर्गों को :math:`\{-1, +1\}` पर निर्दिष्ट करते हैं। सुविधा के लिए, हम ``TwoLayerQNN`` का उपयोग करते हैं, जो एक विशेष प्रकार का ``OpflowQNN`` है जिसे फीचर मैप और ansatz के माध्यम से परिभाषित किया गया है।
ml_in: ഒരു ``NeuralNetworkClassifier`` ``OpflowQNN``എങ്ങനെ ക്ലാസ്സിഫിക്കേഷനിനായി ഉപയോഗിക്കാമെന്ന് ആദ്യം ഞങ്ങൾ കാണിക്കുന്നു. ഈ സന്ദർഭത്തിൽ, ``OpflowQNN`` :math:`[-1, +1]` എന്ന രൂപത്തിൽ ഒരു-ഡൈമൻഷണൽ ഔട്ട്‌പുട്ട് നൽകുമെന്ന് പ്രതീക്ഷിക്കുന്നു. ഇത് ബൈനറി വർഗ്ഗീകരണത്തിന് മാത്രമേ പ്രവർത്തിക്കൂ, അതിനാൽ ഞമ്മൾ രണ്ട് ക്ലാസുകൾ ഇവയിലേക്ക് നിയോഗിക്കുന്നു :math:`\{-1, +1\}`. സൗകര്യത്തിനായി, ഞമ്മൾ ഒരു സവിശേഷത മാപ്പിലൂടെയും അൻസാറ്റ്സിലൂടെയും നിർവചിച്ചിരിക്കുന്ന ഒരു പ്രത്യേക തരം ``OpflowQNN`` ആയ ``TwoLayerQNN`` ഉപയോഗിക്കുന്നത്.
pt_un: Primeiro, nós mostramos como um ``OpflowQNN`` pode ser usado para classificação dentro de um ``NeuralNetworkClassifier``. Neste contexto, é esperado que o ``OpflowQNN`` retorne uma saída unidimensional :math:`[-1, +1]`. Isto funciona apenas para classificação binária e nós atribuímos as duas classes para :math:`\{-1, +1\}`. Por conveniência, nós utilizamos o ``TwoLayerQNN``, que é um tipo especial do ``OpflowQNN`` definido por meio de um mapa de características e um ansatz.
zh_tw: 首先，我們展示如何使用``OpflowQNN``在``NeuralNetworkClassifier``中進行分類。這裡，``OpflowQNN`` 預計會返回一維輸出 :math:`[-1, +1]`。這只能用於二元分類，因此將兩個類分配給 :math:`\{-1, +1\}`。為方便起見，我們使用``TwoLayerQNN``，它是一種特殊類型的``OpflowQNN`` ，定義了一個特徵圖和擬設。

source: Next we show how a ``CircuitQNN`` can be used for classification within a ``NeuralNetworkClassifier``. In this context, the ``CircuitQNN`` is expected to return :math:`d`-dimensional probability vector as output, where :math:`d` denotes the number of classes. Sampling from a ``QuantumCircuit`` automatically results in a probability distribution and we just need to define a mapping from the measured bitstrings to the different classes. For binary classification we use the parity mapping.
bn_bn: পরবর্তী আমরা দেখাব কিভাবে একটি ``CircuitQNN`` একটি ``NeuralNetworkClassifier`` এর মধ্যে শ্রেণিবিন্যাসের জন্য ব্যবহার করা যেতে পারে। এই প্রেক্ষাপটে, ``CircuitQNN`` প্রত্যাশিত হবে: :math:`d`- মাত্রিক সম্ভাবনা ভেক্টর আউটপুট হিসাবে, যেখানে :math:`d`-শ্রেণীর সংখ্যা নির্দেশ করে কোনও ``QuantumCircuit`` থেকে নমুনা দেওয়ার ফলে স্বয়ংক্রিয়ভাবে সম্ভাবনা বন্টনের ফলাফল হয় এবং আমাদের কেবলমাত্র পরিমাপ করা বিটস্ট্রিংগুলি থেকে বিভিন্ন শ্রেণিতে ম্যাপিং সংজ্ঞায়িত করতে হবে। বাইনারি শ্রেণিবিন্যাসের জন্য আমরা প্যারিটি ম্যাপিং ব্যবহার করি।
hi_in: अब हम दिखाते हैं कि कैसे ``CircuitQNN`` का उपयोग ``NeuralNetworkClassifier`` में वर्गीकरण के लिए किया जा सकता है। इस संदर्भ में, ``CircuitQNN`` से :math:`d`-आयामी प्रायिकता वेक्टर के उत्पाद की उम्मीद है, जहां :math:`d` वर्गों की संख्या को दर्शाता है। ``QuantumCircuit`` से नमूना लेने से स्वचालित रूप से एक संभाव्यता वितरण होता है और हमें केवल मापा बिटस्ट्रिंग से विभिन्न वर्गों की मैपिंग को परिभाषित करने की आवश्यकता होती है। द्विचर वर्गीकरण के लिए हम समता मानचित्रण का उपयोग करते हैं।
ml_in: അടുത്തതായി ഒരു ``NeuralNetworkClassifier`` ``CircuitQNN`` എങ്ങനെ ക്ലാസ്സിഫിക്കേഷനിനായി ഉപയോഗിക്കാമെന്ന് ഞങ്ങൾ കാണിക്കുന്നു. ഈ സന്ദർഭത്തിൽ, ``CircuitQNN`` :math:`d`-ഡൈമൻഷണൽ പ്രോബബിലിറ്റി വെക്റ്റർ ഔട്ട്‌പുട്ടായി നൽകുമെന്ന് പ്രതീക്ഷിക്കുന്നു, ഇവിടെ :math:`d` ക്ലാസുകളുടെ എണ്ണത്തെ സൂചിപ്പിക്കുന്നു. ഒരു ``QuantumCircuit``ൽ നിന്നുള്ള സാമ്പിൾ ഓട്ടോമാറ്റിക്കായി ഒരു പ്രോബബിലിറ്റി വിതരണത്തിന് കാരണമാകുന്നു, മാത്രമല്ല അളന്ന ബിറ്റ്സ്ട്രിംഗുകളിൽ നിന്ന് വ്യത്യസ്ത ക്ലാസുകളിലേക്കുള്ള മാപ്പിംഗ് ഞമ്മൾ നിർവചിക്കേണ്ടതുണ്ട്. ബൈനറി ക്ലാസ്സിഫിക്കേഷനിനായി ഞമ്മൾ പാരിറ്റി മാപ്പിംഗ് ഉപയോഗിക്കുന്നു.
pt_un: A seguir, mostramos como um ``CircuitQNN`` pode ser utilizado para classificação dentro de um ``NeuralNetworkClassifier``. Neste contexto, é esperado que o ``CircuitQNN`` retorne um vetor de probabilidade :math:`d`-dimensional como saída, onde :math:`d` denota o numero de classes. A amostragem de um ``QuantumCircuit`` automaticamente resulta na probabilidade de distribuição e nós precisamos apenas definir um mapeamento de medição de bitstrings para as diferentes classes. Para classificação binária nós utilizamos o mapeamento de paridade.
zh_tw: 下面展示如何在 ``NeuralNetworkClassifier`` 中使用 ``CircuitQNN`` 進行分類。此處，“CircuitQNN”預計將返回一個:math:`d`維隨機向量作為輸出。其中:math:`d` 是類別的數量。從 ``QuantumCircuit`` 採樣會自動變成概率分佈，因此我們要做的就是定義從測量的位元串到不同類別的映射。使用奇偶對映進行二元分類。

source: The ``VQC`` is a special variant of the ``NeuralNetworkClassifier`` with a ``CircuitQNN``. It applies a parity mapping (or extensions to multiple classes) to map from the bitstring to the classification, which results in a probability vector, which is interpreted as a one-hot encoded result. By default, it applies this the ``CrossEntropyLoss`` function that expects labels given in one-hot encoded format and will return predictions in that format too.
bn_bn: ``VQC`` একটি ``CircuitQNN`` সহ ``NeuralNetworkClassifier`` এর একটি বিশেষ রূপ। এটি শ্রেণিবিন্যাসের বিটস্ট্রিং থেকে মানচিত্রের জন্য একটি প্যারিটি ম্যাপিং (বা একাধিক ক্লাসে এক্সটেনশনগুলি) প্রয়োগ করে, যার ফলস্বরূপ সম্ভাবনা ভেক্টর তৈরি হয়, যা এক-হট এনকোডযুক্ত ফলাফল হিসাবে ব্যাখ্যা করা হয়। ডিফল্টরূপে , এটি এই ``CrossEntropyLoss`` ফাংশনটি প্রয়োগ করে যা এক-হট এনকোডযুক্ত ফর্ম্যাটে দেওয়া লেবেলগুলির প্রত্যাশা করে এবং সেই ফর্ম্যাটেও পূর্বাভাস প্রত্যাবর্তন করবে।
hi_in: ``VQC`` ``CircuitQNN`` के साथ ``NeuralNetworkClassifier`` का एक विशेष प्रकार है। यह बिटस्ट्रिंग से वर्गीकरण कॊ मैप करने के लिए समता मानचित्रण (या कई वर्गों के विस्तार) लागू करता है, जिसके परिणामस्वरूप एक संभाव्यता वेक्टर होता है, जिसे एक-हॉट एन्कोडेड परिणाम के रूप में व्याख्या किया जाता है। डिफ़ॉल्ट रूप से, यह इसपर ``CrossEntropyLoss`` फ़ंक्शन लागू करता है जो एक-हॉट एन्कोडेड प्रारूप में दिए गए नामपत्र की अपेक्षा करता है और उस प्रारूप में पूर्वानुमान भी लौटाएगा।
ml_in: ``CircuitQNN`` ഉള്ള ``NeuralNetworkClassifier`` ഒരു പ്രത്യേക വകഭേദമാണ് ``VQC``. ബിറ്റ്സ്ട്രിംഗിൽ നിന്ന് ക്ലാസ്സിഫിക്കേഷനിലേക്ക് മാപ്പ് ചെയ്യുന്നതിന് ഇത് ഒരു പാരിറ്റി മാപ്പിംഗ് (അല്ലെങ്കിൽ ഒന്നിലധികം ക്ലാസുകളിലേക്കുള്ള വിപുലീകരണങ്ങൾക്ക്) പ്രയോഗിക്കുന്നു, ഇത് പ്രോബബിലിറ്റി വെക്റ്ററിന് കാരണമാകുന്നു, ഇത് വൻ-ഹോട്ട് എൻ‌കോഡുചെയ്‌ത (one-hot encoded) ഫലമായി വ്യാഖ്യാനിക്കപ്പെടുന്നു. സ്ഥിരസ്ഥിതിയായി, ഇത് ഒരു ഹോട്ട് എൻ‌കോഡുചെയ്‌ത ഫോർ‌മാറ്റിൽ‌ ലേബലുകൾ‌ പ്രതീക്ഷിക്കുന്ന ``CrossEntropyLoss`` ഫംഗ്ഷൻ‌ പ്രയോഗിക്കുന്നു, മാത്രമല്ല ഇത് അതേ ഫോർ‌മാറ്റിലേക്ക് തന്നെ പ്രവചനങ്ങൾ‌ നൽ‌കുകയും ചെയ്യുന്നു.
pt_un: O ``VQC`` é uma variante especial do ``NeuralNetworkClassifier`` com a ``CircuitQNN``. Ele aplica um mapeamento de paridade (ou extensões para várias classes) para mapear do bitstring para classificação, o qual resulta em um vetor de probabilidade, que é interpretado como um resultado codificado one-hot. Por padrão, ele aplica a função ``CrossEntropyLoss`` que espera rótulos dados em formato de codificação one-hot e irá retornar previsões neste formato também.
zh_tw: ``VQC`` 是``NeuralNetworkClassifier`` 和``CircuitQNN`` 的特殊變體。它應用奇偶對映（或擴展到多個類別）將位元串映射到分類，從而產生概率向量，將其解釋為一次性編碼結果。預設情況下，應用``CrossEntropyLoss`` 函數，此函數假定一個以一次性編碼格式給出的標籤，並以該格式返回預測值。
