Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/02_neural_network_classifier_and_regressor.po
Languages: bn_bn, de, es_un, fr, hi_in, ja, ml_in, pt_un, ta, zh_tw

source: Here we restrict to regression with an ``OpflowQNN`` that returns values in :math:`[-1, +1]`. More complex and also multi-dimensional models could be constructed, also based on ``CircuitQNN`` but that exceeds the scope of this tutorial.
bn_bn: এই সহায়িকাতে আমরা ``OpflowQNN`` রিগ্রেশন ব্যবহার করব যা আমাদের :math:`[-1, +1]` ভ্যালু দিবে। আরো জটিল এবং বহুমাত্রিক মডেল এই রিগ্রেশন দ্বারা তৈরি করা যাবে, এই ক্ষেত্রে আমাদের ``CircuitQNN`` ব্যবহার করতে হবে, যা এই সহায়িকার বা টিউটোরিয়ালের সীমার বাইরে।
hi_in: यहां हम एक ``OpflowQNN`` के साथ प्रतिगमन तक सीमित हैं जो :math:`[-1, +1]` में मान लौटाता है। ``CircuitQNN`` के आधार पर अधिक जटिल और बहु-आयामी मॉडल भी बनाए जा सकते हैं, लेकिन यह इस ट्यूटोरियल के दायरे से अधिक है।
ml_in: ഇനിപ്പറയുന്നവയിൽ :math:`[-1, +1]` എന്ന വാല്യു നൽകുന്ന ഒരു ``OpflowQNN`` ഉപയോഗിച്ച് റിഗ്രഷൻ ഞമ്മൾ പരിമിതപ്പെടുത്തുന്നു. ``CircuitQNN`` അടിസ്ഥാനമാക്കി കൂടുതൽ‌ സങ്കീർ‌ണ്ണവും മൾ‌ട്ടി-ഡൈമെൻ‌ഷനലുമായ മോഡലുകളും നിർമ്മിക്കാൻ‌ കഴിയും, പക്ഷേ അത് ഈ ട്യൂട്ടോറിയലിന്റെ വ്യാപ്തി കവിയുന്നു.
pt_un: Aqui nós restringimos para regressão com um ``OpflowQNN`` que retorna valores em :math:`[-1, +1]`. Modelos mais complexos e também multi-dimensionais podem ser construídos, também baseados no ``CircuitQNN`` mas que excedem o escopo deste tutorial.
zh_tw: 這僅限於使用`` OpflowQNN`` 的迴歸，它返回的值是 :math:`[-1, +1]`。可以基於``CircuitQNN``構建更複雜的多維模型，但這超出了本教程的範圍。

source: Similar to the ``VQC`` for classification, the ``VQR`` is a special variant of the ``NeuralNetworkRegressor`` with a ``OpflowQNN``. By default it considers the ``L2Loss`` function to minimize the mean squared error between predictions and targets.
bn_bn: ``VQC`` শ্রেণিবিন্যাসকরণ (ক্লাসিফিকেশন) এর মতই ``VQR`` একটি বিশেষ প্রকরণ যা ``NeuralNetworkRegressor`` এবং ``OpflowQNN`` এর অন্তর্ভুক্ত। স্বতঃসিদ্ধ নিয়মানুসারে এটি একটি ``L2Loss`` ফাংশন যা অনুমান (প্রেডিকশন) এবং প্রত্যাশিত ফলাফল (টারগেট) এর গড় বর্গ মান অবনমন (মিনিমাইজ) করে।
hi_in: वर्गीकरण के लिए ``VQC` के समान, ``VQR`` `OpflowQNN`` के साथ ``NeuralNetworkRegressor`` का एक विशेष प्रकार है। डिफ़ॉल्ट रूप से यह पूर्वानुमानों और लक्ष्यों के बीच माध्य चुकता त्रुटि को कम करने के लिए ``L2Loss`` फ़ंक्शन पर विचार करता है।
ml_in: ക്ലാസ്സിഫിക്കേഷനിനായുള്ള ``VQC``ക്ക് സമാനമായി, ``VQR`` എന്നത് ``OpflowQNN`` ഉള്ള ``NeuralNetworkRegressor`` ഒരു പ്രത്യേക വകഭേദമാണ്. സ്ഥിരസ്ഥിതിയായി ഇത് പ്രവചനങ്ങളും ടാർഗെറ്റുകളും തമ്മിലുള്ള ശരാശരി സ്ക്വയർഡ് ഇറർ (mean squared error) കുറയ്ക്കുന്നതിന് ``L2Loss`` ഫംഗ്ഷനെ പരിഗണിക്കുന്നു.
pt_un: Similar ao ``VQC`` para classificação, o ``VQR`` é uma variante especial do ``NeuralNetworkRegressor`` com um ``OpflowQNN``. Por padrão, ele considera a função ``L2Loss`` para minimizar o erro quadrático médio entre as previsões e os alvos.
zh_tw: 與 ``VQC``進行分類類似， ``VQR`` 是 ``OpflowQNN`` 的 ` `NeuralNetworkRegressor` ` 的特殊變式。依預設，它會考量 ``L2Ross`` 函數被認為可以最小化預測值和目標值之間的均方誤差。
