Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/02a_training_a_quantum_model_on_a_real_dataset.po
Languages: es_un, ja

source: This page was generated from `docs/tutorials/02a_training_a_quantum_model_on_a_real_dataset.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/02a_training_a_quantum_model_on_a_real_dataset.ipynb`__.
ja: このページは `docs/tutorials/02a_training_a_quantum_model_on_a_real_dataset.ipynb`__ から生成されました。

source: Training a Quantum Model on a Real Dataset
es_un: Entrenamiento de un Modelo Cuántico en un Conjunto de Datos Real
ja: 実際のデータセットでの量子モデルの学習

source: This tutorial will demonstrate how to train a quantum machine learning model to tackle a classification problem. Previous tutorials have featured small, artificial datasets. Here we will increase the problem complexity by considering a real-life classical dataset. We decided to pick a very well-known – albeit still relatively small – problem: the Iris flower dataset. This dataset even has its own Wikipedia `page <https://en.wikipedia.org/wiki/Iris_flower_data_set>`__. Although the Iris dataset is well known to data scientists, we will briefly introduce it to refresh our memories. For comparison, we'll first train a classical counterpart to the quantum model.
es_un: Este tutorial demostrará cómo entrenar un modelo de machine learning cuántico para abordar un problema de clasificación. Los tutoriales anteriores han presentado pequeños conjuntos de datos artificiales. Aquí aumentaremos la complejidad del problema al considerar un conjunto de datos clásico de la vida real. Decidimos elegir un problema muy conocido, aunque todavía relativamente pequeño: el conjunto de datos de la flor Iris. Este conjunto de datos incluso tiene su propia `página de Wikipedia <https://en.wikipedia.org/wiki/Iris_flower_data_set>`__. Aunque el conjunto de datos de Iris es bien conocido por los científicos de datos, lo presentaremos brevemente para refrescarnos la memoria. A modo de comparación, primero entrenaremos una contraparte clásica del modelo cuántico.
ja: このチュートリアルでは、分類問題に取り組むために、量子機械学習モデルをどのように学習させるかを説明します。これまでのチュートリアルでは、小規模で人工的なデータセットを取り上げてきました。今回は、現実の古典的なデータセットを用いて、問題の複雑性を高めることにします。我々は、非常に有名ですが、まだ比較的小さな問題であるアイリスの花のデータセットを選ぶことにしました。このデータセットにはWikipediaの `ページ <https://en.wikipedia.org/wiki/Iris_flower_data_set>`__ があるくらいです。アイリスデータセットはデータサイエンティストにはよく知られていますが、記憶を呼び覚ますために簡単に紹介します。比較のために、まず量子モデルに対応する古典的なモデルを学習します。

source: So, let's get started:
es_un: Entonces, empecemos:
ja: では、さっそく始めましょう：

source: First, we'll load the dataset and explore what it looks like.
es_un: Primero, cargaremos el conjunto de datos y exploraremos cómo se ve.
ja: まず、データセットをロードし、それがどのように見えるかを探ります。

source: Next, we'll train a classical model using `SVC <https://scikit-learn.org/stable/modules/generated/sklearn.svm.SVC.html>`__ from `scikit-learn <https://scikit-learn.org/>`__ to see how well the classification problem can be solved using classical methods.
es_un: A continuación, entrenaremos un modelo clásico usando `SVC <https://scikit-learn.org/stable/modules/generated/sklearn.svm.SVC.html>`__ de `scikit-learn <https://scikit-learn.org/>`__ para ver qué tan bien se puede resolver el problema de clasificación usando métodos clásicos.
ja: 次に、`scikit-learn <https://scikit-learn.org/>`__ の `SVC <https://scikit-learn.org/stable/modules/generated/sklearn.svm.SVC.html>`__ を使って古典的なモデルを学習し、古典的な手法で分類問題がどの程度解決できるかを見てみましょう。

source: After that, we'll introduce the Variational Quantum Classifier (VQC).
es_un: Después de eso, presentaremos el Clasificador Cuántico Variacional (Variational Quantum Classifier, VQC).
ja: その後、Variational Quantum Classifier(VQC) を紹介します。

source: To conclude, we'll compare the results obtained from both models.
es_un: Para concluir, compararemos los resultados obtenidos con ambos modelos.
ja: 最後に、両方のモデルから得られた結果を比較します。

source: 1. Exploratory Data Analysis
es_un: 1. Análisis de Datos Exploratorios
ja: 1. データ分析の探索

source: First, let us explore the Iris dataset this tutorial will use and see what it contains. For our convenience, this `dataset <https://scikit-learn.org/stable/datasets/toy_dataset.html#iris-dataset>`__ is available in scikit-learn and can be loaded easily.
es_un: Primero, exploremos el conjunto de datos de Iris que usarás este tutorial y veamos qué contiene. Para nuestra comodidad, este `conjunto de datos <https://scikit-learn.org/stable/datasets/toy_dataset.html#iris-dataset>`__ está disponible en scikit-learn y se puede cargar fácilmente.
ja: まず、このチュートリアルで使用するアイリスのデータセットを調べて、何が含まれているかを見てみましょう。便宜上、この `データセット <https://scikit-learn.org/stable/datasets/toy_dataset.html#iris-dataset>`__ は scikit-learn で利用可能で、簡単にロードすることができます。

source: If no parameters are specified in the ``load_iris`` function, then a dictionary-like object is returned by scikit-learn. Let's print the description of the dataset and see what is inside.
es_un: Si no se especifican parámetros en la función ``load_iris``, scikit-learn devuelve un objeto similar a un diccionario. Imprimamos la descripción del conjunto de datos y veamos qué hay dentro.
ja: ``load_iris`` 関数でパラメーターを指定しなかった場合、辞書のようなオブジェクトが scikit-learn によって返されます。データセットの記述を出力して、中身を見てみましょう。

source: There are a few interesting observations we can find from this dataset description:
es_un: Hay algunas observaciones interesantes que podemos encontrar en esta descripción del conjunto de datos:
ja: このデータセットの説明から、いくつかの興味深い点を見出すことができます。

source: There are 150 samples (instances) in the dataset.
es_un: Hay 150 muestras (instancias) en el conjunto de datos.
ja: データセットには150のサンプル(インスタンス) があります。

source: There are four features (attributes) in each sample.
es_un: Hay cuatro características (atributos) en cada muestra.
ja: 各サンプルには4つの特徴量 (属性) があります。

source: There are three labels (classes) in the dataset.
es_un: Hay tres etiquetas (clases) en el conjunto de datos.
ja: データセットには3つのラベル(クラス) があります。

source: The dataset is perfectly balanced, as there are the same number of samples (50) in each class.
es_un: El conjunto de datos está perfectamente equilibrado, ya que hay el mismo número de muestras (50) en cada clase.
ja: 各クラスに同じ数のサンプル(50) があるため、データセットは完全にバランスが取れています。

source: We can see features are not normalized, and their value ranges are different, e.g., :math:`[4.3, 7.9]` and :math:`[0.1, 2.5]` for sepal length and petal width, respectively. So, transforming the features to the same scale may be helpful.
es_un: Podemos ver que las características no están normalizadas y sus rangos de valores son diferentes, por ejemplo, :math:`[4.3, 7.9]` y :math:`[0.1, 2.5]` para la longitud del sépalo y el ancho del pétalo, respectivamente. Por lo tanto, puede ser útil transformar las características a la misma escala.
ja: 例えば、がくの長さ(sepal width)は :math:`[4.3, 7.9]` 、花弁の幅(petal width)は :math:`[0.1, 2.5]` というように、特徴量が正規化されておらず、値の範囲も異なっていることが分かります。そこで、特徴量を同じスケールに変換することが有効な場合があります。

source: As stated in the table above, feature-to-class correlation in some cases is very high; this may lead us to think that our model should cope well with the dataset.
es_un: Como se indica en la tabla anterior, la correlación de característica a clase en algunos casos es muy alta; esto puede llevarnos a pensar que nuestro modelo debería adaptarse bien al conjunto de datos.
ja: 上の表にあるように、いくつかのケースでは特徴量とクラスの相関が非常に高く、このことから、我々のモデルはデータセットにうまく対応できるはずだと思われるかもしれません。

source: We only examined the dataset description, but additional properties are available in the ``iris_data`` object. Now we are going to work with features and labels from the dataset.
es_un: Solo examinamos la descripción del conjunto de datos, pero hay propiedades adicionales disponibles en el objeto ``iris_data``. Ahora vamos a trabajar con características y etiquetas del conjunto de datos.
ja: 今回はデータセットの説明だけを調べましたが、 ``iris_data`` オブジェクトにはその他のプロパティも用意されています。それでは、データセットに含まれる特徴量とラベルを操作してみましょう。

source: Firstly, we'll normalize the features. Namely, we will apply a simple transformation to represent all features on the same scale. In our case, we squeeze all features onto the interval :math:`[0, 1]`. Normalization is a common technique in machine learning and often leads to better numerical stability and convergence of an algorithm.
es_un: En primer lugar, normalizaremos las características. Es decir, aplicaremos una transformación simple para representar todas las características en la misma escala. En nuestro caso, comprimimos todas las funciones en el intervalo :math:`[0, 1]`. La normalización es una técnica común en el machine learning y, a menudo, conduce a una mejor estabilidad numérica y convergencia de un algoritmo.
ja: まず、特徴量を正規化します。つまり、すべての特徴量を同じ尺度で表現するために、簡単な変換を行います。この例では、すべての特徴量を区間 :math:`[0, 1]` に絞り込みます。正規化は機械学習において一般的な手法であり、しばしばアルゴリズムの数値的安定性や収束性を向上させることにつながります。

source: We can use ``MinMaxScaler`` from scikit-learn to perform this. Without specifying parameters, this does exactly what is required: maps data onto :math:`[0, 1]`.
es_un: Podemos usar ``MinMaxScaler`` de scikit-learn para realizar esto. Sin especificar parámetros, esto hace exactamente lo que se requiere: mapea los datos a :math:`[0, 1]`.
ja: Scikit-learn の ``MinMaxScaler`` を使用して、この処理を行うことができます。これはパラメーターを指定せずに、必要なことだけを行うもので、データを :math:`[0, 1]` にマップします。

source: Let's see how our data looks. We plot the features pair-wise to see if there's an observable correlation between them.
es_un: Veamos cómo se ven nuestros datos. Graficamos las características por pares para ver si hay una correlación observable entre ellas.
ja: では、データがどのように見えるか見てみましょう。特徴量を対にしてプロットし、それらの間に観測可能な相関があるかどうかを確認します。

source: From the plots, we see that class ``0`` is easily separable from the other two classes, while classes ``1`` and ``2`` are sometimes intertwined, especially regarding the "sepal width" feature.
es_un: De las gráficas, vemos que la clase ``0`` es fácilmente separable de las otras dos clases, mientras que las clases ``1`` y ``2`` a veces están empalmadas, especialmente con respecto a la característica del "ancho del sépalo".
ja: プロットから、クラス ``0`` と他の2つのクラスは容易に分離可能であることがわかりますが、クラス ``1`` と ``2`` は、特に「がくの幅（sepal width）」の特徴に関して、時々絡み合っていることがわかります。

source: Next, let's see how classical machine learning handles this dataset.
es_un: A continuación, veamos cómo el machine learning clásico maneja este conjunto de datos.
ja: 次に、古典的な機械学習がこのデータセットをどのように扱うか見てみましょう。

source: 2. Training a Classical Machine Learning Model
es_un: 2. Entrenamiento de un Modelo Clásico de Machine Learning
ja: 2. 古典的な機械学習モデルの学習

source: Before we train a model, we should split the dataset into two parts: a training dataset and a test dataset. We'll use the former to train the model and the latter to verify how well our models perform on unseen data.
es_un: Antes de entrenar un modelo, debemos dividir el conjunto de datos en dos partes: un conjunto de datos de entrenamiento y un conjunto de datos de prueba. Usaremos el primero para entrenar el modelo y el segundo para verificar qué tan bien funcionan nuestros modelos en datos no vistos.
ja: モデルを学習する前に、データセットをトレーニングデータセットとテストデータセットの2つに分ける必要があります。前者はモデルの学習に、後者は未知のデータに対してモデルがどの程度の性能を発揮するかを検証するために使います。

source: As usual, we'll ask scikit-learn to do the boring job for us. We'll also fix the seed to ensure the results are reproducible.
es_un: Como de costumbre, le pediremos a scikit-learn que haga el trabajo aburrido por nosotros. También fijaremos la semilla para garantizar que los resultados sean reproducibles.
ja: いつものように、退屈な仕事はscikit-learnにお願いすることにします。また、結果が再現できるようにseedを固定します。

source: We train a classical Support Vector Classifier from scikit-learn. For the sake of simplicity, we don't tweak any parameters and rely on the default values.
es_un: Entrenamos un clasificador de vectores de soporte clásico de scikit-learn. En aras de la simplicidad, no modificamos ningún parámetro y confiamos en los valores predeterminados.
ja: Scikit-learnの古典的なサポートベクター分類器を学習させます。簡単のため、パラメーターはいじらず、デフォルトの値を使用します。

source: Now we check out how well our classical model performs. We will analyze the scores in the conclusion section.
es_un: Ahora comprobamos qué tan bien funciona nuestro modelo clásico. Analizaremos las puntuaciones en el apartado de conclusiones.
ja: ここで、我々の古典的なモデルがどの程度のパフォーマンスを示すかを確認します。結論の部分でそのスコアを分析します。

source: As can be seen from the scores, the classical SVC algorithm performs very well. Next up, it's time to look at quantum machine learning models.
es_un: Como puede verse en las puntuaciones, el algoritmo SVC clásico funciona muy bien. A continuación, es hora de analizar los modelos de machine learning cuántico.
ja: スコアからわかるように、古典的なSVCアルゴリズムは非常に良いパフォーマンスを見せています。次は、量子機械学習モデルについてです。

source: 3. Training a Quantum Machine Learning Model
es_un: 3. Entrenamiento de un Modelo de Machine Learning Cuántico
ja: 2. 量子機械学習モデルの学習

source: As an example of a quantum model, we'll train a variational quantum classifier (VQC). The VQC is the simplest classifier available in Qiskit Machine Learning and is a good starting point for newcomers to quantum machine learning who have a background in classical machine learning.
es_un: Como ejemplo de un modelo cuántico, entrenaremos un clasificador cuántico variacional (variational quantum classifier, VQC). El VQC es el clasificador más simple disponible en Qiskit Machine Learning y es un buen punto de partida para los recién llegados al machine learning cuántico que tienen experiencia en el machine learning clásico.
ja: 量子モデルの例として、変分量子分類器(VQC) を学習します。VQCは Qiskit Machine Learning で利用できる最もシンプルな分類器であり、古典的な機械学習のバックグラウンドを持つ量子機械学習初心者に適した出発点です。

source: But before we train a model, let's examine what comprises the ``VQC`` class. Two of its central elements are the feature map and ansatz. What these are will now be explained.
es_un: Pero antes de entrenar un modelo, examinemos qué comprende la clase ``VQC``. Dos de sus elementos centrales son el mapa de características y el ansatz. Ahora se explicará cuáles son.
ja: しかし、モデルを学習する前に、``VQC`` クラスを構成するものを調べてみましょう。その中心的な要素は特徴量マップとansatzです。これらが何かを説明します。

source: Our data is classical, meaning it consists of a set of bits, not qubits. We need a way to encode the data as qubits. This process is crucial if we want to obtain an effective quantum model. We usually refer to this mapping as data encoding, data embedding, or data loading and this is the role of the feature map. While feature mapping is a common ML mechanism, this process of loading data into quantum states does not appear in classical machine learning as that only operates in the classical world.
es_un: Nuestros datos son clásicos, lo que significa que consisten en un conjunto de bits, no de qubits. Necesitamos una forma de codificar los datos como qubits. Este proceso es crucial si queremos obtener un modelo cuántico efectivo. Por lo general, nos referimos a este mapeo como codificación de datos, incrustación de datos o carga de datos, y esta es la función del mapa de características. Si bien el mapeo de características es un mecanismo común de ML, este proceso de carga de datos en estados cuánticos no aparece en el machine learning clásico, ya que solo funciona en el mundo clásico.
ja: 私たちのデータは古典的なもので、量子ビットではなくビットの集合で構成されています。データを量子ビットとして符号化する方法が必要なのです。このプロセスは、有効な量子モデルを得るために非常に重要です。我々は通常、このマッピングをデータエンコーディング、データエンベッディング、データローディングと呼び、これが特徴量マップの役割となります。特徴量マップは一般的なMLメカニズムですが、この量子状態へのデータロードのプロセスは、古典的な世界でのみ作用するため、古典的な機械学習には登場しません。

source: Once the data is loaded, we must immediately apply a parameterized quantum circuit. This circuit is a direct analog to the layers in classical neural networks. It has a set of tunable parameters or weights. The weights are optimized such that they minimize an objective function. This objective function characterizes the distance between the predictions and known labeled data. A parameterized quantum circuit is also called a parameterized trial state, variational form, or ansatz. Perhaps, the latter is the most widely used term.
es_un: Una vez cargados los datos, debemos aplicar inmediatamente un circuito cuántico parametrizado. Este circuito es un análogo directo a las capas en las redes neuronales clásicas. Tiene un conjunto de parámetros o pesos ajustables. Los pesos se optimizan de manera que minimicen una función objetivo. Esta función objetivo caracteriza la distancia entre las predicciones y los datos etiquetados conocidos. Un circuito cuántico parametrizado también se denomina estado de prueba parametrizado, forma variacional o ansatz. Quizás, este último es el término más utilizado.
ja: データを読み込んだら、すぐにパラメーター化された量子回路を適用しなければなりません。この回路は、古典的なニューラルネットワークの層と直接的に類似しています。この回路は、調整可能なパラメーター（重み）を持っています。重みは、ある目的関数を最小化するように最適化されます。この目的関数は、予測値と既知のラベル付けされたデータとの距離を特徴づけます。パラメーター化された量子回路は、パラメーター化された試行状態、変分形式、ansatzとも呼ばれます。おそらく、後者が最も広く用いられている用語でしょう。

source: For more information, we direct the reader to the `Quantum Machine Learning Course <https://learn.qiskit.org/course/machine-learning>`__.
es_un: Para obtener más información, dirigimos al lector al `Curso de Machine Learning Cuántico <https://learn.qiskit.org/course/machine-learning>`__.
ja: 詳しくは、 `量子機械学習のコース <https://learn.qiskit.org/course/machine-learning>`__ をご覧ください。

source: Our choice of feature map will be the ``ZZFeatureMap``. The ``ZZFeatureMap`` is one of the standard feature maps in the Qiskit circuit library. We pass ``num_features`` as ``feature_dimension``, meaning the feature map will have ``num_features`` or ``4`` qubits.
es_un: Nuestra elección de mapa de características será ``ZZFeatureMap``. El ``ZZFeatureMap`` es uno de los mapas de características estándar en la biblioteca de circuitos de Qiskit. Pasamos ``num_features`` como ``feature_dimension``, lo que significa que el mapa de características tendrá ``num_features`` o ``4`` qubits.
ja: ここでは ``ZZFeatureMap`` を使用することにします。 ``ZZFeatureMap`` はQiskitのcircuit ライブラリーに含まれる標準的な特徴量マップの一つです。 ``num_features`` を ``feature_dimension`` として渡すと、特徴量マップは ``num_features`` または ``4`` 個の量子ビットを持つことになります。

source: We decompose the feature map into its constituent gates to give the reader a flavor of how feature maps may look.
es_un: Descomponemos el mapa de características en sus compuertas constituyentes para darle al lector una idea de cómo pueden verse los mapas de características.
ja: 特徴量マップをゲートに分解し、特徴量マップがどのように見えるかを伝えます。

source: If you look closely at the feature map diagram, you will notice parameters ``x[0], ..., x[3]``. These are placeholders for our features.
es_un: Si observas detenidamente el diagrama del mapa de características, notarás los parámetros ``x[0], ..., x[3]``. Estos son marcadores de posición para nuestras funciones.
ja: 特徴量ダイアグラムをよく見ると、パラメーター ``x[0], ..., x[3]`` が見えます。これらは、特徴量のプレースホルダーです。

source: Now we create and plot our ansatz. Pay attention to the repetitive structure of the ansatz circuit. We define the number of these repetitions using the ``reps`` parameter.
es_un: Ahora creamos y mostramos nuestro ansatz. Presta atención a la estructura repetitiva del circuito ansatz. Definimos el número de estas repeticiones usando el parámetro ``reps``.
ja: Ansatzを作成してプロットします。Ansatz回路の反復構造に注意してください。 これらの繰り返しの数は ``reps`` パラメーターを使用して定義します。

source: This circuit has 16 parameters named ``θ[0], ..., θ[15]``. These are the trainable weights of the classifier.
es_un: Este circuito tiene 16 parámetros llamados ``θ[0], ..., θ[15]``. Estos son los pesos entrenables del clasificador.
ja: この回路には16個のパラメーターがあり、そのパラメーターには ``θ[0], ..., θ[15]`` があります。これらは分類器の訓練可能な重みです。

source: We then choose an optimization algorithm to use in the training process. This step is similar to what you may find in classical deep learning frameworks. To make the training process faster, we choose a gradient-free optimizer. You may explore other optimizers available in Qiskit.
es_un: Luego elegimos un algoritmo de optimización para usar en el proceso de entrenamiento. Este paso es similar a lo que puedes encontrar en los frameworks clásicos de deep learning. Para acelerar el proceso de entrenamiento, elegimos un optimizador sin gradiente. Puedes explorar otros optimizadores disponibles en Qiskit.
ja: 次に、学習プロセスで使用する最適化アルゴリズムを選択します。このステップは、古典的な深層学習フレームワークで見られるものと似ています。学習プロセスを高速化するために、勾配なしオプティマイザーを選択します。Qiskitで利用可能な他のオプティマイザーを探索することもできます。

source: In the next step, we define where to train our classifier. We can train on a simulator or a real quantum computer. Here, we will use a simulator. We create an instance of the ``Sampler`` primitive. This is the reference implementation that is statevector based. Using qiskit runtime services you can create a sampler that is backed by a quantum computer.
es_un: En el siguiente paso, definimos dónde entrenar nuestro clasificador. Podemos entrenar en un simulador o en una computadora cuántica real. Aquí, usaremos un simulador. Creamos una instancia de la primitiva ``Sampler``. Esta es la implementación de referencia en la que está basado el vector de estado. Con los servicios de qiskit runtime, puedes crear un sampler que esté respaldado por una computadora cuántica.
ja: 次のステップでは、分類器をどこで学習させるかを定義します。学習にはシミュレーターと実物の量子コンピューターがあります。ここでは、シミュレーターを使用します。 ``Sampler`` primitiveのインスタンスを作成します。これは状態ベクトルベースのリファレンス実装です。qiskitのruntimeサービスを使用すると、量子コンピューターを使ったsamplerを作成することができます。

source: We will add a callback function called ``callback_graph``. ``VQC`` will call this function for each evaluation of the objective function with two parameters: the current weights and the value of the objective function at those weights. Our callback will append the value of the objective function to an array so we can plot the iteration versus the objective function value. The callback will update the plot at each iteration. Note that you can do whatever you want inside a callback function, so long as it has the two-parameter signature we mentioned above.
es_un: Agregaremos una función de devolución de llamada nombrada ``callback_graph``. ``VQC`` llamará a esta función para cada evaluación de la función objetivo con dos parámetros: los pesos actuales y el valor de la función objetivo en esos pesos. Nuestra devolución de llamada agregará el valor de la función objetivo a una matriz para que podamos graficar la iteración frente al valor de la función objetivo. La devolución de llamada actualizará la gráfica en cada iteración. Ten en cuenta que puedes hacer lo que quieras dentro de una función de devolución de llamada, siempre que tenga la firma de dos parámetros que mencionamos anteriormente.
ja: ここでは、``callback_graph`` というコールバック関数を追加します。VQCは目的関数を評価するたびに、現在の重みとその重みにおける目的関数の値という2つのパラメーターを指定して、この関数を呼び出します。コールバックは目的関数の値を配列に追加し、反復計算を目的関数の値に対してプロットできるようにします。コールバックは各反復ごとにプロットを更新します。コールバック関数の内部では、先ほど説明した2パラメーターのシグネチャーを持つ限り、どんなことでもできることに注意してください。

source: Now we are ready to construct the classifier and fit it.
es_un: Ahora estamos listos para construir el clasificador y ajustarlo.
ja: これで、分類器を構築し、適合させる準備が整いました。

source: ``VQC`` stands for "variational quantum classifier." It takes a feature map and an ansatz and constructs a quantum neural network automatically. In the simplest case it is enough to pass the number of qubits and a quantum instance to construct a valid classifier. You may omit the ``sampler`` parameter, in this case a ``Sampler`` instance will be created for you in the way we created it earlier. We created it manually for illustrative purposes only.
es_un: ``VQC`` significa "clasificador cuántico variacional" ("variational quantum classifier."). Toma un mapa de características y un ansatz y construye una red neuronal cuántica automáticamente. En el caso más simple, basta con pasar el número de qubits y una quantum instance para construir un clasificador válido. Puedes omitir el parámetro ``sampler``, en este caso se creará una instancia de ``Sampler`` de la forma en que la creamos anteriormente. Lo creamos manualmente solo con fines ilustrativos.
ja: ``VQC`` は、「変分量子分類器」の略称です。特徴量とansatzを受け取り、量子ニューラルネットワークを自動的に構築します。最も単純なケースでは、量子ビットの数と量子インスタンスを渡すだけで、有効な分類器を構築することができます。 ``Sampler`` パラメーターを省略することも可能です。この場合、先ほど作成した方法で ``Sampler`` インスタンスが作成されます。ここでは、説明のために手動で作成しました。
