Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/02a_training_a_quantum_model_on_a_real_dataset.po
Languages: es_un, ja

source: Training may take some time. Please, be patient.
es_un: El entrenamiento puede tomar algún tiempo. Por favor sé paciente.
ja: 学習には時間がかかる場合があります。少しお待ちください。

source: Let's see how the quantum model performs on the real-life dataset.
es_un: Veamos cómo se comporta el modelo cuántico en el conjunto de datos en la vida real.
ja: それでは、量子モデルが実際のデータセットでどのようなパフォーマンスを発揮するのか見てみましょう。

source: As we can see, the scores are high, and the model can be used to predict labels on unseen data.
es_un: Como podemos ver, las puntuaciones son altas y el modelo se puede usar para predecir etiquetas en datos no vistos.
ja: 見ての通り、スコアは高く、このモデルを使って未見のデータに対するラベルを予測することが可能です。

source: Now let's see what we can tune to get even better models.
es_un: Ahora veamos qué podemos ajustar para obtener modelos aún mejores.
ja: では、さらに良いモデルを得るために、どのようなチューニングをすればよいのかを見ていきましょう。

source: The key components are the feature map and the ansatz. You can tweak parameters. In our case, you may change the ``reps`` parameter that specifies how repetitions of a gate pattern we add to the circuit. Larger values lead to more entanglement operations and more parameters. Thus, the model can be more flexible, but the higher number of parameters also adds complexity, and training such a model usually takes more time. Furthermore, we may end up overfitting the model. You can try the other feature maps and ansatzes available in the `Qiskit circuit library <https://qiskit.org/documentation/apidoc/circuit_library.html#n-local-circuits>`__, or you can come up with custom circuits.
es_un: Los componentes clave son el mapa de características y el ansatz. Puedes ajustar los parámetros. En nuestro caso, puedes cambiar el parámetro ``reps`` que especifica cuántas repeticiones de un patrón de compuertas agregamos al circuito. Los valores más grandes conducen a más operaciones de entrelazamiento y más parámetros. Por lo tanto, el modelo puede ser más flexible, pero la mayor cantidad de parámetros también agrega complejidad, y el entrenamiento de dicho modelo suele llevar más tiempo. Además, podemos terminar sobreajustando el modelo. Puedes probar los otros mapas de características y ansatzes disponibles en la `biblioteca de circuitos de Qiskit <https://qiskit.org/documentation/apidoc/circuit_library.html#n-local-circuits>`__, o puedes crear circuitos personalizados.
ja: 重要な構成要素は、特徴量マップとansatzです。パラメーターを調整することができます。この例では、回路に追加するゲートパターンの繰り返しを指定する ``reps`` パラメーターを変更することができます。この値を大きくすると、より多くのエンタングルメント演算が行われるようになり、パラメーターも多くなります。このように、モデルはより柔軟になりますが、パラメーターが多くなることで複雑さが増し、モデルのトレーニングに時間がかかるのが一般的です。さらに、モデルをオーバーフィットさせてしまう可能性もあります。 `Qiskit circuit library <https://qiskit.org/documentation/apidoc/circuit_library.html#n-local-circuits>`__ で利用可能な他の特徴量マップやansatzを試すこともできますし、カスタム回路を考え出すこともできます。

source: You may try other optimizers. Qiskit contains a bunch of them. Some of them are gradient-free, others not. If you choose a gradient-based optimizer, e.g., ``L_BFGS_B``, expect the training time to increase. Additionally to the objective function, these optimizers must evaluate the gradient with respect to the training parameters, which leads to an increased number of circuit executions per iteration.
es_un: Puedes probar otros optimizadores. Qiskit contiene un montón de ellos. Algunos de ellos están libres de gradientes, otros no. Si eliges un optimizador basado en gradiente, por ejemplo, ``L_BFGS_B``, espera que aumente el tiempo de entrenamiento. Además de la función objetivo, estos optimizadores deben evaluar el gradiente con respecto a los parámetros de entrenamiento, lo que conduce a un mayor número de ejecuciones del circuito por iteración.
ja: 他のオプティマイザーを試してみるのもよいでしょう。Qiskitには色々なオプティマイザーがあります。その中には勾配がないものもあれば、そうでないものもあります。例えば ``L_BFGS_B`` のような勾配ベースのオプティマイザーを選択した場合、トレーニング時間が増加することが予想されます。目的関数に加えて、これらのオプティマイザーは学習パラメーターに関して勾配を評価する必要があり、これは反復あたりの回路実行数の増加につながります。

source: Another option is to randomly (or deterministically) sample ``initial_point`` and fit the model several times.
es_un: Otra opción es muestrear aleatoriamente (o de manera determinista) el ``initial_point`` y ajustar el modelo varias veces.
ja: もう一つの方法は、ランダムに（または決定論的に） ``initial_point`` をサンプリングし、何度もモデルを適合させることです。

source: But what if a dataset contains more features than a modern quantum computer can handle? Recall, in this example, we had the same number of qubits as the number of features in the dataset, but this may not always be the case.
es_un: Pero, ¿qué sucede si un conjunto de datos contiene más características de las que puede manejar una computadora cuántica moderna? Recuerda, en este ejemplo, teníamos la misma cantidad de qubits que la cantidad de características en el conjunto de datos, pero es posible que este no sea siempre el caso.
ja: しかし、データセットに含まれる素性が、最新の量子コンピューターが処理できる量よりも多い場合はどうでしょうか。この例では、データセットの特徴量と同じ数の量子ビットを用意しましたが、必ずしもそうではないかもしれません。

source: 4. Reducing the Number of Features
es_un: 4. Reducción del Número de Características
ja: 4. 特徴量の数の削減

source: In this section, we reduce the number of features in our dataset and train our models again. We'll move through faster this time as the steps are the same except for the first, where we apply a PCA transformation.
es_un: En esta sección, reducimos la cantidad de características en nuestro conjunto de datos y volvemos a entrenar nuestros modelos. Avanzaremos más rápido esta vez, ya que los pasos son los mismos, excepto el primero, donde aplicamos una transformación PCA.
ja: このセクションでは、データセットの特徴量数を減らし、再度モデルを学習します。今回は、最初のPCA変換を行う以外は同じステップなので、より速く進めます。

source: We transform our four features into two features only. This dimensionality reduction is for educational purposes only. As you saw in the previous section, we can train a quantum model using all four features from the dataset.
es_un: Transformamos nuestras cuatro características en solo dos características. Esta reducción de dimensionalidad es solo para fines educativos. Como viste en la sección anterior, podemos entrenar un modelo cuántico usando las cuatro características del conjunto de datos.
ja: 4つの特徴量を2つの特徴量のみに変換します。この次元削減は教育的な目的のために行うのであり、前節で見たように、データセットの4つの特徴量を全て使って量子モデルを学習することができます。

source: Now, we can easily plot these two features on a single figure.
es_un: Ahora, podemos graficar fácilmente estas dos características en una sola figura.
ja: さて、この2つの特徴量を1つの図に簡単にプロットすることができます。

source: As usual, we split the dataset first, then fit a classical model.
es_un: Como de costumbre, primero dividimos el conjunto de datos y luego ajustamos un modelo clásico.
ja: いつものように、まずデータセットを分割し、次に古典的なモデルを当てはめます。

source: The results are still good but slightly worse compared to the initial version. Let's see how a quantum model deals with them. As we now have two qubits, we must recreate the feature map and ansatz.
es_un: Los resultados siguen siendo buenos pero ligeramente peores en comparación con la versión inicial. Veamos cómo los trata un modelo cuántico. Como ahora tenemos dos qubits, debemos recrear el mapa de características y el ansatz.
ja: 結果はまだ良いのですが、最初のバージョンと比べると若干悪くなっています。量子モデルがそれらをどのように扱うか見てみましょう。量子ビットが2つになったので、特徴量マップとAnsatzを作り直さなければなりません。

source: We also reduce the maximum number of iterations we run the optimization process for, as we expect it to converge faster because we now have fewer qubits.
es_un: También reducimos la cantidad máxima de iteraciones para las que ejecutamos el proceso de optimización, ya que esperamos que converja más rápido porque ahora tenemos menos qubits.
ja: また、最適化プロセスを実行する反復回数の最大値を減らしました。

source: Now we construct a quantum classifier from the new parameters and train it.
es_un: Ahora construimos un clasificador cuántico a partir de los nuevos parámetros y lo entrenamos.
ja: ここで、新しいパラメーターから量子分類器を構築し、学習させます。

source: Well, the scores are higher than a fair coin toss but could be better. The objective function is almost flat towards the end, meaning increasing the number of iterations won't help, and model performance will stay the same. Let's see what we can do with another ansatz.
es_un: Bueno, las puntuaciones son más altas que en un lanzamiento de moneda balanceada, pero podrían ser mejores. La función objetivo es casi plana hacia el final, lo que significa que aumentar el número de iteraciones no ayudará y el rendimiento del modelo seguirá siendo el mismo. Veamos qué podemos hacer con otro ansatz.
ja: さて、スコアは公平なコイントスよりも高いのですが、もっと良くなる可能性があります。目的関数は最後に向かってほぼフラットです。つまり、反復回数を増やしても、モデルの性能は変わらないということです。別のansatzで何ができるかを見てみましょう。

source: The scores are better than in the previous setup. Perhaps if we had used more iterations, we could do even better.
es_un: Las puntuaciones son mejores que en la configuración anterior. Quizás si hubiéramos usado más iteraciones, podríamos hacerlo aún mejor.
ja: スコアは前回の設定よりも良くなっています。おそらく、もっと反復回数を増やせば、さらに良い結果が得られると思います。

source: 5. Conclusion
es_un: 5. Conclusión
ja: 5. 結論

source: In this tutorial, we have built two classical and three quantum machine learning models. Let's print an overall table with our results.
es_un: En este tutorial, hemos construido dos modelos de machine learning clásicos y tres cuánticos. Imprimamos una tabla general con nuestros resultados.
ja: このチュートリアルでは、2つの古典的なモデルと3つの量子機械学習モデルを構築しました。結果とともに全体的な表を出力してみます。

source: Unsurprisingly, the classical models perform better than their quantum counterparts, but classical ML has come a long way, and quantum ML has yet to reach that level of maturity. As we can see, we achieved the best results using a classical support vector machine. But the quantum model trained on four features was also quite good. When we reduced the number of features, the performance of all models went down as expected. So, if resources permit training a model on a full-featured dataset without any reduction, you should train such a model. If not, you may expect to compromise between dataset size, training time, and score.
es_un: Como era de esperar, los modelos clásicos funcionan mejor que sus homólogos cuánticos, pero el ML clásico ha recorrido un largo camino y el ML cuántico aún tiene que alcanzar ese nivel de madurez. Como podemos ver, logramos los mejores resultados utilizando una máquina de vectores de soporte clásica. Pero el modelo cuántico entrenado con cuatro características también fue bastante bueno. Cuando redujimos la cantidad de características, el rendimiento de todos los modelos disminuyó como se esperaba. Por lo tanto, si los recursos permiten entrenar un modelo en un conjunto de datos con todas las características sin ninguna reducción, debes entrenar dicho modelo. De lo contrario, es posible que te comprometas entre el tamaño del conjunto de datos, el tiempo de entrenamiento y la puntuación.
ja: 当然ながら、古典的なモデルの方が量子的なモデルよりも性能が良いです。古典的なMLは長い道のりを歩んできており、量子MLはまだそのレベルに到達していないのです。見ての通り、我々は古典的なサポートベクターマシンを使って最高の結果を得ました。しかし、4つの特徴量で学習させた量子モデルも非常に良い結果でした。しかし、特徴量の数を減らすと、予想通り全てのモデルの性能が落ちました。ですから、もしリソースが許すのであれば、全特徴を持つデータセットでモデルを学習させるべきでしょう。そうでない場合は、データセットサイズ、学習時間、スコアの間で妥協することになるかもしれません。

source: Another observation is that even a simple ansatz change can lead to better results. The two-feature model with the ``EfficientSU2`` ansatz performs better than the one with ``RealAmplitudes``. That means the choice of hyperparameters plays the same critical role in quantum ML as in classical ML, and searching for optimal hyperparameters may take a long time. You may apply the same techniques we use in classical ML, such as random/grid or more sophisticated approaches.
es_un: Otra observación es que incluso un simple cambio de ansatz puede conducir a mejores resultados. El modelo de dos características con el ansatz ``EfficientSU2`` funciona mejor que el de ``RealAmplitudes``. Eso significa que la elección de los hiperparámetros desempeña el mismo papel fundamental en el ML cuántico que en el ML clásico, y la búsqueda de hiperparámetros óptimos puede llevar mucho tiempo. Puedes aplicar las mismas técnicas que usamos en el ML clásico, como la aleatoriedad/cuadrícula o enfoques más sofisticados.
ja: もう一つの観察は、単純なAnsatzの変更でさえ、より良い結果につながるということです。 ``EfficientSU2`` ansatz を用いた2成分モデルは、 ``RealAmplitudes`` を用いたモデルよりも良好な結果を得ることができました。つまり、量子MLでも古典MLと同様にハイパーパラメーターの選択が重要であり、最適なハイパーパラメーターを探索するには長い時間がかかる可能性があります。古典的なMLと同じ手法、例えばランダム/グリッドや、より洗練されたアプローチを適用することができます。

source: We hope this brief tutorial helps you to take the leap from classical to quantum ML.
es_un: Esperamos que este breve tutorial te ayude a dar el salto del ML clásico al ML cuántico.
ja: この簡単なチュートリアルで、あなたが古典から量子MLへと飛躍することを期待しています。
