Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/03_quantum_kernel.po
Languages: bn_bn, de_de, es_un, fr_fr, hi_in, ja, ml_in, pt_un, zh_tw

source: In this notebook, we use ``qiskit`` to calculate a kernel matrix using a quantum feature map, then use this kernel matrix in ``scikit-learn`` classification and clustering algorithms.
bn_bn: এই নোটবুকে আমরা কোয়ান্টাম ফিচার ম্যাপ ব্যবহার করে কার্নেল ম্যাটিক্স হিসাব করতে ``qiskit`` ব্যবহার করব। তারপরে এই কার্নেল ম্যাটিক্সটি ``scikit-learn` ক্লাসিফিকেশন ক্লাস্টারিং অ্যালোগরিদমে ব্যাবহার করব।
de_de: In diesem Notebook verwenden wir ``qiskit`` um eine Kernel-Matrix mit einer Quanten-Feature-Map zu berechnen, dann verwenden Sie diese Kernel-Matrix in Klassifikation- und Clustering-Algorithmen von ``scikit-learn``.
fr_fr: Dans ce bloc-notes, nous utilisons ` ` qiskit ` ` pour calculer une matrice de noyau à l'aide d'une mappe de fonctions quantiques, puis utilisez cette matrice de noyau dans les algorithmes de classification et de classification de ` ` scikit-learn ` `.
hi_in: इस पुस्तक में, हम प्रमात्रा फीचर मैप का उपयोग करके कर्नेल मैट्रिक्स की गणना करने के लिए ``qiskit`` का उपयोग करते हैं, फिर इस कर्नेल मैट्रिक्स का उपयोग ``scikit-learn`` वर्गीकरण और गुच्छन कलन विधि में करते हैं।
ml_in: ഈ നോട്ട്ബുക്കിൽ, ഒരു ക്വാണ്ടം ഫീച്ചർ മാപ്പ് ഉപയോഗിച്ച് ഒരു കേർണൽ മാട്രിക്സ് കണക്കാക്കാൻ ഞമ്മൾ ``qiskit`` ഉപയോഗിക്കുന്നു, തുടർന്ന് ``scikit-learn`` ക്ലാസ്സിഫിക്കേഷനിലും ക്ലസ്റ്ററിംഗ് അൽഗോരിതങ്ങളിലും ഈ കേർണൽ മാട്രിക്സ് ഉപയോഗിക്കുന്നു.
pt_un: Neste notebook, nós utilizamos ``qiskit`` para calcular uma matriz de núcleo usando um mapa de recursos quânticos, em seguida, usamos esta matriz de núcleo na classificação ``scikit-learn`` e agrupamento de algoritmos.
zh_tw: 本筆記本藉由量子特徵圖使用``qiskit`` 計算核心矩陣，並在``scikit-learn`` 的分類和聚類演算法中使用該核心矩陣。

source: Classification
bn_bn: শ্রেণিবিভাগ (ক্লাসিফিকেশন)
de_de: Klassifikation
hi_in: वर्गीकरण
pt_un: Classificação
zh_tw: 分類

source: For our classification example, we will use the *ad hoc dataset* as described in `Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__, and the ``scikit-learn`` `support vector machine <https://scikit-learn.org/stable/modules/svm.html>`__ classification (``svc``) algorithm.
bn_bn: এবার ক্লাসিফিকেশনের উদাহরনের জন্য আমরা `Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__ এ উল্লেখিত *ad hoc dataset* এবং ``scikit-learn`` `support vector machine <https://scikit-learn.org/stable/modules/svm.html>`__ ক্লাসিফিকেশন (``svc``) অ্যালোগরিদমটি ব্যবহার করব।
de_de: Für unser Klassifikationsbeispiel verwenden wir das * Ad-hoc-Dataset *, wie in ` Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>` __, and the ``scikit-learn`` ` support vector machine <https://scikit-learn.org/stable/modules/svm.html>` __ classification (``svc``) Algorithmus beschrieben.
fr_fr: Pour notre exemple de classification, nous utiliserons * l'ensemble de données ad hoc * tel que décrit dans la section "Apprentissage supervisé avec les espaces de fonctions améliorés quantiques <https://arxiv.org/pdf/1804.11326.pdf>` __, et l'algorithme de type" science vectorielle " <https://scikit-learn.org/stable/modules/svm.html>` __ classification (` ` svc ` `).
hi_in: हमारे वर्गीकरण उदाहरण के लिए, हम *तदर्थ डेटासेट* का उपयोग करेंगे जैसा कि `Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__, और ``scikit-learn`` `support vector machine <https://scikit-learn.org/stable/modules/svm.html>`__ वर्गीकरण (``svc``) विधि कलन में वर्णित है।
ml_in: ഞമ്മളുടെ വർഗ്ഗീകരണ ഉദാഹരണത്തിനായി, `Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__ പഠനത്തിൽ വിവരിച്ചിരിക്കുന്നതുപോലെ *ad hoc dataset* ഉം, കൂടാതെ ``scikit-learn`` `support vector machine <https://scikit-learn.org/stable/modules/svm.html>`__ (``svc``)അൽഗോരിതവും ഉപയോഗിക്കും.
pt_un: Para o nosso exemplo de classificação, nós iremos utilizar um *conjunto de dados ad hoc* como descrito em `Aprendizado supervisionado com espaços de recursos quânticos aprimorados <https://arxiv.org/pdf/1804.11326.pdf>`__, e o ``scikit-learn`` `maquina de vetor de suporte <https://scikit-learn.org/stable/modules/svm.html>`__ classificação de algoritmo (``svc``).
zh_tw: 對於我們的分類範例，我們將使用 `Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__ 中的*ad hoc dataset*，以及 ``scikit-learn`` `support vector machine <https://scikit-learn.org/stable/modules/svm.html>`__ 分類(``svc``)演算法。

source: With our training and testing datasets ready, we set up the ``QuantumKernel`` class to calculate a kernel matrix using the `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__, and the ``BasicAer`` ``qasm_simulator`` using 1024 shots.
bn_bn: ট্রেনিং এবং টেস্টিং ডেটাসেট তৈরি হওয়ার পর আমরা `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ এবং ``BasicAer`` ``qasm_simulator`` এ ১০২৪ ষটস(shots) দিয়ে ``QuantumKernel`` ক্লাসটি সেট করে দেব।
de_de: Mit unseren Trainings- und Testdatensätzen haben wir die ``QuantumKernel``-Klasse eingerichtet, um eine Kernel-Matrix mit der `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__, durch den ``BasicAer`` ``qasm_simulator`` mit 1024 Shots berechnen zu lassen.
fr_fr: Avec nos jeux de données de formation et de test prêt, nous avons configuré la classe ` ` QuantumKernel ` ` pour calculer la matrice du noyau à l'aide de la ` ` ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>` __, et du ` ` BasicAer ` ` ` ` qasm_simulateur ` ` utilisant 1024 coups.
hi_in: हमारे प्रशिक्षण और परीक्षण डेटासेट तैयार होने के साथ, हम `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ और ``BasicAer`` ``qasm_simulator`` 1024 शॉट्स का उपयोग करके कर्नेल मैट्रिक्स की गणना करने के लिए ``QuantumKernel`` वर्ग की स्थापना करते हैं।
ml_in: ഞമ്മളുടെ പരിശീലനവും പരിശോധന ഡാറ്റാസെറ്റുകളും തയ്യാറായതോടെ, the `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ ഉപയോഗിച്ച് ഒരു കേർണൽ മാട്രിക്സ് കണക്കാക്കാൻ ഞമ്മൾ ``QuantumKernel`` ക്ലാസ് സജ്ജമാക്കുന്നു. കൂടാതെ 1024 ഷോട്ടുകൾ‌ ഉപയോഗിക്കുന്ന ``BasicAer`` ``qasm_simulator`` -ഉം.
pt_un: Com nossos conjuntos de dados de treinos e testes preparados, nós configuramos a classe ``QuantumKernel`` para calcular a matriz do núcleo executando o `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__, e o ``BasicAer`` ``simulador_qasm `` utilizando 1024 shots.
zh_tw: 一旦訓練和測試資料集準備就緒，藉由使用`ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>` __ 設置``QuantumKernel``類別去計算核心矩陣。然後使用 ``BasicAer`` ``qasm_simulator``運行 1024 個測量次數。

source: The ``scikit-learn`` ``svc`` algorithm allows us to define a `custom kernel <https://scikit-learn.org/stable/modules/svm.html#custom-kernels>`__ in two ways: by providing the kernel as a callable function or by precomputing the kernel matrix. We can do either of these using the ``QuantumKernel`` class in ``qiskit``.
bn_bn: ``scikit-learn`` ``svc`` অ্যালোগরিদমটি একটি `custom kernel <https://scikit-learn.org/stable/modules/svm.html#custom-kernels>`__ বর্ণনা করতে দুইভাবে সাহায্য করতে পারে: কার্নেলটাকে একটা কলযোগ্য ফাংশন হিসেবে প্রস্তুত করার মাধ্যমে অথবা কার্নেল ম্যাট্রিক্সটি আগেই হিসাব করার মাধ্যমে। আমরা এই দুটো পদ্ধতিই ``qiskit`` এর ``QuantumKernel`` ক্লাস ব্যবহার করে করতে পারি।
de_de: Der ``svc``-Algorithmus von ``scikit-learn`` erlaubt es uns, einen `custom kernel <https://scikit-learn.org/stable/modules/svm.html#custom-kernels>`__ auf zwei Arten zu definieren, indem der Kernel als aufrufbare Funktion oder als vorherberechnete Kernel-Matrix bereitgestellt wird. Wir können beides mit der ``QuantumKernel``-Klasse in ``qiskit`` tun.
fr_fr: L'algorithme ` ` scikit-learn ` ` ` ` svc ` ` nous permet de définir un noyau'personnalisé <https://scikit-learn.org/stable/modules/svm.html#custom-kernels>` __ de deux manières: en fournissant le noyau comme une fonction appelable ou en précalculant la matrice du noyau. Nous pouvons faire l'un ou l'autre de ces outils en utilisant la classe ` ` QuantumKernel ` ` dans ` ` qiskit ` `.
hi_in: ``scikit-learn````svc`` एल्गोरिथम हमें एक `कस्टम कर्नेल <https://scikit-learn.org/stable/modules/svm.html#custom-kernels>`__ को दो तरह से परिभाषित करने की अनुमति देता है: कर्नेल को कॉल करने योग्य फ़ंक्शन के रूप में प्रदान करके या कर्नेल मैट्रिक्स को प्रीकंप्यूटिंग करके। हम इनमें से कोई भी `qiskit` में ``QuantumKernel`` वर्ग का उपयोग करके कर सकते हैं।
ml_in: ഒരു `custom kernel <https://scikit-learn.org/stable/modules/svm.html#custom-kernels>`__നെ രണ്ട് തരത്തിൽ നിർവചിക്കാൻ ``scikit-learn`` ``svc`` അൽ‌ഗോരിതം ഞമ്മളെ അനുവദിക്കുന്നു: കേർ‌ണലിനെ വിളിക്കാൻ‌ കഴിയുന്ന പ്രവർ‌ത്തനമായി നൽ‌കുന്നതിലൂടെ അല്ലെങ്കിൽ‌ കേർ‌ണൽ‌ മാട്രിക്സ് മുൻ‌കൂട്ടി കംപ്യൂട്ട് ചെയ്യുന്നതിലൂടെ. ``qiskit`` ലെ ``QuantumKernel`` ക്ലാസ് ഉപയോഗിച്ച് നമുക്ക് ഇവയിലേതെങ്കിലും ചെയ്യാൻ കഴിയുന്നതാണ്.
pt_un: O algoritmo ``scikit-learn`` ``svc`` nos permite definir um `núcleo personalizado <https://scikit-learn.org/stable/modules/svm.html#custom-kernels>`__ de duas maneiras: Fornecendo o núcleo como uma função exigível ou pré-computando a matriz do núcleo. Nós podemos fazer qualquer uma das duas utilizando a classe ``QuantumKernel`` no ``qiskit``.
zh_tw: ``scikit-learn``中的``svc``演算法可讓我們以兩種方式定義`custom kernel <https://scikit-learn.org/stable/modules/svm.html#custom-kernels>`__ ，方法是將核心提供為可調用函數，或通過預計算核心矩陣。 我們可以使用 ``qiskit`` 中的``QuantumKernel``類別來執行這些。

source: The following code gives the kernel as a callable function:
bn_bn: নিম্নলিখিত কোডটি কার্নেলকে একটি কলযোগ্য ফাংশন হিসেবে দেয়।
de_de: Der folgende Code liefert den Kernel als aufrufbare Funktion:
fr_fr: Le code suivant donne au noyau une fonction appelable:
hi_in: निम्नालिखित कोड कर्नेल को कॉल करने योग्य फ़ंक्शन के रूप में देता है:
ml_in: ഇനിപ്പറയുന്ന കോഡ് കേർണലിനെ വിളിക്കാവുന്ന ഫംഗ്ഷനായി നൽകുന്നു:
pt_un: O código a seguir nos retorna o núcleo como função exigível:
zh_tw: 下列程式碼將核心提供為可調用的函數：

source: The following code precomputes and plots the training and testing kernel matrices before providing them to the ``scikit-learn`` ``svc`` algorithm:
bn_bn: নিচের কোডটি শিক্ষণ (ট্রেনিং) ডেটা আগেই হিসাব করে রাখে এবং ``scikit-learn`` ``svc`` অ্যালোগরিদমে পাঠিয়ে দেয়ার আগে টেস্টিং কার্নেল ম্যাট্রিক্সগুলোকে স্পথাপন করে।
de_de: Der folgende Code berechnet und plottet die Matrizen zum Trainieren und Testen des Kernels, bevor diese dem ``scikit-learn`` ``svc``-Algorithmus zur Verfügung gestellt werden:
fr_fr: Le code suivant précalcule et trace la formation et teste les matrices du noyau avant de les fournir à l'algorithme ` ` scikit-learn ` ` ` svc ` `:
hi_in: निम्नलिखित कोड ``scikit-learn````svc`` एल्गोरिथम प्रदान करने से पहले प्रशिक्षण और परीक्षण कर्नेल matrices को प्रीकंप्यूट करता है और प्लॉट करता है:
ml_in: പരിശീലന, ടെസ്റ്റിംഗ് കേർണൽ മെട്രിക്സുകൾ ``scikit-learn`` ``svc`` അൽ‌ഗോരിതം നൽകുന്നതിനുമുമ്പ് ഇനിപ്പറയുന്ന കോഡ് മുൻ‌കൂട്ടി തയ്യാറാക്കുകയും പ്ലോട്ട് ചെയ്യുകയും ചെയ്യുന്നു:
pt_un: O código a seguir, pré-computa e plota as matrizes de núcleo de treinamento e testes antes de fornecê-las ao algoritmo ``scikit-learn`` ``svc``:
zh_tw: 下列程式碼預先計算並繪製訓練和測試核心矩陣，然後再將它們提供給``scikit-learn`` ``svc``演算法：

source: ``qiskit`` also contains the ``qsvc`` class that extends the ``sklearn svc`` class, that can be used as follows:
bn_bn: ``qiskit`` এ ``qsvc`` ক্লাস(class) থাকে যা ``sklearn svc`` ক্লাসকে বর্ধিত করে, এটা নিম্নলিখিত উপায়ে ব্যবহৃত হয়:
de_de: ``qiskit`` enthält auch die ``qsvc`` Klasse, welche die ``sklearn svc``-Klasse erweitert, die wie folgt verwendet werden kann:
fr_fr: ` ` qiskit ` ` contient également la classe ` ` qsvc ` ` qui étend la classe ` ` sklearn svc ` `, qui peut être utilisée comme suit:
hi_in: ``qiskit`` में ``qsvc`` वर्ग भी शामिल है जो ``sklearn svc`` वर्ग का विस्तार करता है, जिसका उपयोग निम्नानुसार किया जा सकता है:
ml_in: ``qiskit`` ൽ ``sklearn svc`` ക്ലാസ് വിപുലീകരിക്കുന്ന ``qsvc`` ക്ലാസും അടങ്ങിയിരിക്കുന്നു, അത് ഇനിപ്പറയുന്ന രീതിയിൽ ഉപയോഗിക്കാം:
pt_un: O ``qiskit`` também contem a classe ``qsvc`` que extende a classe ``sklearn svc``, esta pode ser utilizada da seguinte forma:
zh_tw: ``qiskit`` 還包括 ``qsvc`` 類別，它是``sklearn svc``類別的擴展，可以使用如下：

source: Clustering
bn_bn: ক্লাস্টারিং
hi_in: गुच्छन
ml_in: ക്ലസ്റ്ററിംഗ്
pt_un: Agrupamento
zh_tw: 聚類

source: For our clustering example, we will again use the *ad hoc dataset* as described in `Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__, and the ``scikit-learn`` ``spectral`` clustering algorithm.
bn_bn: ক্লাস্টারিং উদাহরনের জন্য আমরা আবার পূর্বের অনুরূপ `Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__ এবং ``scikit-learn`` ``spectral`` ক্লাস্টারিং অ্যালোগরিদমের মধ্যে *ad hoc dataset* ব্যবহার করব।
de_de: Für unser Clustering-Beispiel verwenden wir erneut das *Ad-hoc-Dataset*, wie in ` Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>` __ beschrieben wird, und den ``scikit-learn`` ``Spektralclustering``-Algorithmus.
fr_fr: Pour notre exemple de classification, nous utiliserons *ad hoc dataset* tel que décrit dans la section "Apprentissage supervisé avec les espaces de fonctions améliorés quantiques <https://arxiv.org/pdf/1804.11326.pdf>` __, et le ``scikit-learn`` l'algorithme de regroupement ``spectral``.
hi_in: हमारे गुच्छन उदाहरण के लिए, हम फिर से *तदर्थ डेटासेट* का उपयोग करेंगे जैसा कि `Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__, और `scikit-learn`` ``spectral`` गुच्छन कलन विधि में वर्णित है।
ml_in: ഞമ്മളുടെ ക്ലസ്റ്ററിംഗ് ഉദാഹരണത്തിനായി, `Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__ പഠനത്തിൽ വിവരിച്ചിരിക്കുന്നതുപോലെ *ad hoc dataset* ഉം, കൂടാതെ ``scikit-learn`` ``spectral``അൽഗോരിതവും ഉപയോഗിക്കും.
pt_un: Para nosso exemplo de agrupamento, nós usaremos novamente o *conjunto de dados ad hoc* como descrito em `Aprendizado supervisionado com espaços de recursos quânticos aprimorados <https://arxiv.org/pdf/1804.11326.pdf>`__, e o algoritmo de agrupamento ``scikit-learn`` ``spectral``.
zh_tw: 對於我們的聚類範例，我們將再次使用`Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__中的 *ad hoc dataset*，和 ``scikit-learn`` ``spectral``聚類演算法。

source: We will regenerate the dataset with a larger gap between the two classes, and as clustering is an unsupervised machine learning task, we don’t need a test sample.
bn_bn: আমরা দুটি ক্লাসের ভেতর বিশাল গ্যাপ দিয়ে পুনরায় ডেটাসেটটি সৃষ্টি করব। যেহেতু ক্লাস্টারিং হল এক প্রকার আনসুপারভাইজড মেশিন লার্নিং কাজ, কাজেই আমাদের কোনো টেস্ট স্যাম্পল প্রয়োজন নেই।
de_de: Wir werden den Datensatz mit einer größeren Lücke zwischen den beiden Klassen regenerieren, und weil Clustering eine unüberwahcte Machine-Learning-Aufgabe ist, brauchen wir kein Test-Set.
fr_fr: Nous allons régénérer le jeu de données avec un écart plus grand entre les deux classes, et comme le regroupement est une tâche d'apprentissage automatique non supervisée, nous n'avons pas besoin d'un échantillon de test.
hi_in: हम दोनों वर्गों के बीच एक बड़े अंतर के साथ डेटासेट को पुन: उत्पन्न करेंगे, और चूंकि गुच्छन एक अपर्यवेक्षित मशीन शिक्षण कार्य है, हमें एक परीक्षण नमूने की जरूरत नहीं है।
ml_in: രണ്ട് ക്ലാസുകൾക്കിടയിലുള്ള വലുതാക്കിയ വിടവ് ഉപയോഗിച്ചു ഞമ്മൾ ഡാറ്റാസെറ്റിനെ ഉണ്ടാക്കുകയും, കൂടാതെ ക്ലസ്റ്ററിംഗ് ഒരു മേൽനോട്ടമില്ലാത്ത മെഷീൻ ലേണിംഗ് ടാസ്ക് ആയതിനാൽ, ഞങ്ങൾക്ക് ഒരു പരീക്ഷണ സാമ്പിൾ ആവശ്യമില്ല.
pt_un: Nós regeramos o dataset com uma lacuna maior entre as duas classes, e como agrupamento é uma tarefa de aprendizado de máquina não supervisionada, não precisamos de uma amostra de teste.
zh_tw: 我們會重新生成兩個類別之間有很大差距的資料集。聚類是一項無監督的機器學習任務，因此不需要測試樣本。

source: We again set up the ``QuantumKernel`` class to calculate a kernel matrix using the `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__, and the BasicAer ``qasm_simulator`` using 1024 shots.
bn_bn: আবারও আমরা `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ ব্যবহার করে একটি কার্নেল ম্যাট্রিক্স এবং ১০২৪ শটস(shots) এর মাধ্যমে BasicAer ``qasm_simulator`` দিয়ে হিসাব করতে ``QuantumKernel`` ক্লাসটি বসাব।
de_de: Wir haben erneut die ``QuantumKernel``-Klasse eingerichtet, um eine Kernel-Matrix mit der `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__, und dem BasicAer ``qasm_simulator`` mit 1024 Samples zu berechnen.
fr_fr: Avec nos jeux de données de formation et de test prêt, nous avons configuré la classe ` ` QuantumKernel ` ` pour calculer la matrice du noyau à l'aide de la ` ` ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>` __, et du ` ` BasicAer ` ` ` ` qasm_simulateur ` ` utilisant 1024 coups.
hi_in: हमने `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__, और १०२४ शॉट्स का उपयोग करते BasicAer ``qasm_simulator`` का उपयोग करके कर्नेल मैट्रिक्स की गणना करने के लिए फिर से ``QuantumKernel`` वर्ग की स्थापना की।
ml_in: ഞമ്മളുടെ പരിശീലനവും പരിശോധന ഡാറ്റാസെറ്റുകളും തയ്യാറായതോടെ, `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ ഉപയോഗിച്ച് ഒരു കേർണൽ മാട്രിക്സ് കണക്കാക്കാൻ വീണ്ടും ഞമ്മൾ ``QuantumKernal`` ക്ലാസ് സജ്ജമാക്കുന്നു. കൂടാതെ 1024 ഷോട്ടുകൾ‌ ഉപയോഗിക്കുന്ന BasicAer ``qasm_simulator`` -ഉം.
pt_un: Nós novamente configuramos a classe ``QuantumKernel`` para calcular a matriz do núcleo utilizando o `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__, e o BasicAer ``qasm_simulator`` usando 1024 shots.
zh_tw: 我們再次使用 `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__設置 `` QuantumKernel`` 類別去計算核心矩陣，然後使用 BasicAer ``qasm_simulator`` 運行1024 個測量次數。

source: The scikit-learn spectral clustering algorithm allows us to define a [custom kernel] in two ways: by providing the kernel as a callable function or by precomputing the kernel matrix. Using the QuantumKernel class in qiskit, we can only use the latter.
bn_bn: scikit-learn স্পেক্ট্রাল ধারাক্রম ক্লাস্টারিং অ্যালোগরিদমটি একটি [বিশেষায়িত (কাস্টম) কার্নেল ] কে দুটি উপায়ে বোঝাতে সাহায্য করে: কার্নেলটিকে একটা কল যোগ্য ফাংশন হিসেবে প্রস্তুত করার মাধ্যমে অথবা কার্নেল ম্যাট্রিক্সটি আগেই হিসাব করার মাধ্যমে। Qiskit এ QuantumKernel ক্লাস ব্যবহার করে আমরা শুধুমাত্র পরবর্তী উপায়টি ব্যাবহার করতে পারি।
de_de: Der Spektralclustering-Algorithmus von Scikit-Learn erlaubt es uns, einen [benutzerdefinierten Kernel] auf zwei Arten zu definieren, indem er den Kernel als aufrufbare Funktion zur Verfügung stellt oder indem er die Kernel-Matrix vorherberechnet. Mit der QuantumKernel-Klasse in qiskit können wir nur die letztere Methode verwenden.
fr_fr: L'algorithme de regroupement spectral scikit-learn nous permet de définir [un noyau personnalisé] de deux manières: En fournissant un noyau en tant que fonction appelable ou en précalculant la matrice du noyau. En utilisant la class QuantumKernel dans Qiskit, nous pouvons utiliser que cette dernière.
hi_in: Scikit-learn वर्णक्रम संबंधी गुच्छन कलन विधि हमें एक [कस्टम कर्नेल] को दो तरीकों से परिभाषित करने की अनुमति देता है: कर्नेल को कॉल करने योग्य फ़ंक्शन के रूप में प्रदान करके या कर्नेल मैट्रिक्स को पूर्व गणना करके। Qiskit में QuantumKernelQiskit वर्ग का उपयोग करके, हम केवल बाद वाले तरीके का उपयोग कर सकते हैं।
ml_in: ഒരു [custom kernel] -നെ രണ്ട് തരത്തിൽ നിർവചിക്കാൻ സൈകിറ്റ്-ലേൺ സ്പെക്ട്രൽ ക്ലസ്റ്ററിംഗ് അൽ‌ഗോരിതം നമ്മളെ അനുവദിക്കുന്നു: കേർ‌ണലിനെ വിളിക്കാൻ‌ കഴിയുന്ന പ്രവർ‌ത്തനമായി നൽ‌കുന്നതിലൂടെ അല്ലെങ്കിൽ‌ കേർ‌ണൽ‌ മാട്രിക്സ് മുൻ‌കൂട്ടി കംപ്യൂട്ട് ചെയ്യുന്നതിലൂടെ. ക്വിസ്‌കിറ്റ്ലെ ക്വാണ്ടം കേർണൽ ക്ലാസ് ഉപയോഗിച്ച് നമുക്ക് ഇവയിലേതെങ്കിലും ചെയ്യാൻ കഴിയുന്നതാണ്.
pt_un: O algoritmo de agrupamento spectral scikit-learn nos permite definir um [núcleo personalizado] de duas maneiras: Fornecendo o núcleo como uma função exigível ou pré-computando a matriz do núcleo. Usando a classe QuantumKernel no Qiskit, só podemos usar o último.
zh_tw: Scikit-learn 光譜聚類演算法允許您以兩種方式定義[自訂的核心]。也就是說，藉由提供核心作為可調用函數，或藉由預測核心矩陣。如果使用 Qiskit 的 QuantumKernel 類別，則只能使用後者。

source: The following code precomputes and plots the kernel matrices before providing it to the scikit-learn spectral clustering algorithm, and scoring the labels using normalized mutual information, since we a priori know the class labels.
bn_bn: নিম্নলিখিত কোডটি ট্রেইনিং ডাটা আগেই হিসাব করে রাখে এবং scikit-learn স্পেক্ট্রাল অ্যালোগরিদমে পাঠিয়ে দেয়ার আগে এবং যেহেতু আমরা আগে থেকেই ক্লাস লেবেলগুলো জানি, তাই এই লেবেলগুলোকে নরমালাইজড মিউচুয়াল ইনফরমেশন (normalized_mutual_info_score) স্কোর করেই তারপর টেস্টিং কার্নেল ম্যাট্রিক্সগুলোকে স্পথাপন করে।
de_de: Der folgende Code berechnet und plottet die Kernel-Matrizen bevor er sie dem Scikit-Learn-Spektralclustering-Algorithmus zur Verfügung stellt und die Bewertung der Bezeichnungen unter Verwendung normalisierter gegenseitiger Informationen dürchführt, da wir a priori die Klassen-Bezeichnungen kennen.
fr_fr: Le code suivant précalcule et affiche les matrices de noyau avant de les fournir à l'algorithme de regroupement spectral scikit-learn, et de marquer les étiquettes à l'aide d'informations mutuelles normalisées, puisque nous connaissons a priori les labels des classes.
hi_in: निम्न कोड scikit-learn स्पेक्ट्रल क्लस्टरिंग एल्गोरिथम को प्रदान करने से पहले कर्नेल मैट्रिस को प्रीकंप्यूट और प्लॉट करता है, और सामान्यीकृत पारस्परिक जानकारी का उपयोग करके लेबल को स्कोर करता है, क्योंकि हम एक प्राथमिकता वर्ग लेबल जानते हैं।
pt_un: O código a seguir pré-computa e plota as matrizes do núcleo antes de fornecê-las ao algoritmo de agrupamento espectral scikit-learn, e pontua o rótulo usando informação mútua normalizada, já que conhecemos a priori os rótulos das classes.
zh_tw: 由於我們事先知道類別標籤，下面的程式碼預先計算並繪製核心矩陣，然後將其放入scikit-learn的光譜聚類演算法中，用歸一化互信息對標籤進行評分。

source: ``scikit-learn`` has other algorithms that can use a precomputed kernel matrix, here are a few:
bn_bn: ``scikit-learn`` এর অন্যান্য অ্যালোগরিদমসমূহ আছে যেগুলো কার্নেল ম্যাট্রিক্স আগেভাগে হিসাব করার কাজে ব্যবহৃত হয়। তন্মধ্যে কিছুসংখ্যক নিম্নরুপ,
de_de: ``scikit-learn`` hat weitere Algorithmen, die eine vorberechnete Kernel-Matrix verwenden können. Hier sind ein paar:
fr_fr: ``scikit-learn`` a d'autres algorithmes qui peuvent utiliser une matrice de noyau précalculée, voici quelques uns:
hi_in: ``scikit-learn`` के अन्य एल्गोरिथ्म हैं जो पूर्वगणना कर्नेल मैट्रिक्स का उपयोग कर सकते हैं, यहाँ कुछ हैं:
ml_in: മുൻ‌കൂട്ടി തയ്യാറാക്കിയ കേർണൽ മാട്രിക്സുകൾ ഉപയോഗിക്കാൻ‌ കഴിയുന്ന മറ്റ് അൽ‌ഗോരിതം ``scikit-learn`` (സൈകിറ്റ്-ലേണി)-ന് ഉണ്ട്, അവയിൽ ചിലത് ഇതാ:
pt_un: O ``scikit-learn`` tem outros algoritmos que pré-computam a matriz do núcleo, aqui estão alguns:
zh_tw: `` scikit-learn`` 有其他演算法可以使用預先計算的核心矩陣，這裡有其他範例：

source: `Agglomerative clustering <https://scikit-learn.org/stable/modules/generated/sklearn.cluster.AgglomerativeClustering.html>`__
de_de: `Agglomeratives Clustern <https://scikit-learn.org/stable/modules/generated/sklearn.cluster.AgglomerativeClustering.html>`__
fr_fr: `Regroupement Agglomératif <https://scikit-learn.org/stable/modules/generated/sklearn.cluster.AgglomerativeClustering.html>` __
hi_in: क्लस्टरिंग ढेर <https://scikit-learn.org/stable/modules/generated/sklearn.cluster.AgglomerativeClustering.html>`__
pt_un: `Agrupamento aglomerativo <https://scikit-learn.org/stable/modules/generated/sklearn.cluster.AgglomerativeClustering.html>`__
