Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/03_quantum_kernel.po
Languages: bn_bn, de_de, es_un, fr_fr, hi_in, ja, ml_in, pt_un, zh_tw

source: This page was generated from `docs/tutorials/03_quantum_kernel.ipynb`__.
bn_bn: এই পেজটি `docs/tutorials/03_quantum_kernel.ipynb`__ থেকে তৈরি হয়েছে।
de_de: Diese Seite wurde aus ` docs/tutorials/03_quantum_kernel.ipynb ` __ generiert.
es_un: Esta página fue generada a partir de `docs/tutorials/03_quantum_kernel.ipynb`__.
fr_fr: Cette page a été générée à partir de `docs/tutorials/03_quantum_kernel.ipynb`__.
ja: このページは `docs/tutorials/03_quantum_kernel.ipynb`__ から生成されました。
pt_un: Esta página foi gerada a partir `docs/tutorials/03_quantum_kernel.ipynb`__.
zh_tw: 此頁面是從 `docs/tutorials/03_quantum_kernel.ipynb`__產生的。

source: Quantum Kernel Machine Learning
bn_bn: কোয়ান্টাম কার্নেল মেশিন লার্নিং
de_de: Quantenkernel-Machine-Learning
es_un: Machine Learning con Kernel Cuántico
fr_fr: Apprentissage automatique du noyau quantique
hi_in: प्रमात्रा कर्नेल मशीन लर्निंग
ja: 量子カーネル法機械学習
ml_in: ക്വാണ്ടം കേർണൽ മെഷീൻ ലേണിംഗ്
pt_un: Núcleo Quântico de Aprendizagem de Máquina
zh_tw: 量子核心機器學習

source: Overview
es_un: Descripción General
ja: 概要

source: The general task of machine learning is to find and study patterns in data. For many datasets, the datapoints are better understood in a higher dimensional feature space. This is the fundamental principle behind a series of machine learning algorithms known as *kernel methods*.
es_un: La tarea general del machine learning es encontrar y estudiar patrones en los datos. Para muchos conjuntos de datos, los puntos de datos se comprenden mejor en un espacio de características de mayor dimensión. Este es el principio fundamental detrás de una serie de algoritmos de machine learning conocidos como *métodos de kernel*.
ja: 機械学習の一般的なタスクは、データのパターンを見つけて学習することです。 多くのデータセットでは、データポイントは高次元の特徴空間でよりよく理解されます。 これは、*カーネル・メソッド*として知られる一連の機械学習アルゴリズムの背後にある基本原理です。

source: In this notebook, you will learn how to define quantum kernels using ``qiskit-machine-learning`` and how these can be plugged into different algorithms to solve classification and clustering problems.
es_un: En este cuaderno, aprenderás a definir kernels cuánticos utilizando ``qiskit-machine-learning`` y cómo estos pueden conectarse a diferentes algoritmos para resolver problemas de clasificación y agrupación (clustering).
ja: このノートブックでは、 ``qiskit-machine-learning`` を使用して量子カーネルを定義する方法と、これらをさまざまなアルゴリズムにプラグインして分類とクラスタリングの問題を解決する方法を学習します。

source: All examples used in this tutorial are based on this reference paper: `Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__.
es_un: Todos los ejemplos utilizados en este tutorial se basan en este artículo de referencia: `Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__.
ja: このチュートリアルで使用されているすべての例は、次のリファレンス ペーパーに基づいています。 `Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__

source: The content is structured as follows:
es_un: El contenido está estructurado de la siguiente manera:
ja: このコンテンツの構造は以下のとおりです。

source: `Introduction <#1.-Introduction>`__
es_un: `Introducción <#1.-Introducción>`__
ja: `はじめに <#1.-Introduction>`__

source: `Classification <#2.-Classification>`__
es_un: `Clasificación <#2.-Clasificación>`__
ja: `分類 <#2.-Classification>`__

source: `Clustering <#3.-Clustering>`__
es_un: `Agrupación (Clustering) <#3.-Agrupación-(Clustering)>`__
ja: `クラスタリング <#3.-Clustering>`__

source: `Kernel Principal Components Analysis <#4.-Kernel-Principal-Component-Analysis>`__
es_un: `Análisis de los Componentes Principales del Kernel <#4.-Análisis-de-los-Componentes-Principales-del-Kernel>`__

source: `Conclusion <#5.-Conclusion>`__
es_un: `Conclusión <#5.-Conclusión>`__
ja: `結論 <#5.-Conclusion>`__

source: 1. Introduction
es_un: 1. Introducción
ja: 1. はじめに

source: 1.1. Kernel Methods for Machine Learning
es_un: 1.1. Métodos de Kernel para Machine Learning
ja: 1.1. 機械学習のカーネル・メソッド

source: Kernel methods are a collection of pattern analysis algorithms that use kernel functions to operate in a high-dimensional feature space. The best-known application of kernel methods is in **Support Vector Machines (SVMs)**, supervised learning algorithms commonly used for classification tasks. The main goal of SVMs is to find decision boundaries to separate a given set of data points into classes. When these data spaces are not linearly separable, SVMs can benefit from the use of kernels to find these boundaries.
es_un: Los métodos de kernel son una colección de algoritmos de análisis de patrones que utilizan funciones de kernel para operar en un espacio de características de alta dimensión. La aplicación más conocida de los métodos de kernel se encuentra en **Soporte de Máquinas de Vectores (Support Vector Machines, SVM)**, algoritmos de aprendizaje supervisado comúnmente utilizados para tareas de clasificación. El objetivo principal de las SVM es encontrar límites de decisión para separar un conjunto dado de puntos de datos en clases. Cuando estos espacios de datos no son linealmente separables, las SVM pueden beneficiarse del uso de kernels para encontrar estos límites.
ja: カーネル法は、高次元特徴量空間で動作するカーネル関数を使用するパターン分析アルゴリズムのコレクションです。カーネル法の最もよく知られた応用は **サポートベクターマシン（SVM）** で、分類タスクによく使われる教師あり学習アルゴリズムです。SVMの主な目的は、与えられたデータ・ポイントをクラスに分離するための決定境界を見つけることです。このデータ空間が線形分離可能でない場合、SVMはこれらの境界を見つけるためにカーネルを使用することで利益を得ることができます。

source: Formally, decision boundaries are hyperplanes in a high dimensional space. The kernel function implicitly maps input data into this higher dimensional space, where it can be easier to solve the initial problem. In other words, kernels may allow data distributions that were originally non-linearly separable to become a linearly separable problem. This is an effect known as the "kernel trick".
es_un: Formalmente, los límites de decisión son hiperplanos en un espacio de alta dimensionalidad. La función de kernel mapea implícitamente los datos de entrada en este espacio dimensional superior, donde puede ser más fácil resolver el problema inicial. En otras palabras, los kernels pueden permitir que las distribuciones de datos que originalmente no eran separables linealmente se conviertan en un problema separable linealmente. Este es un efecto conocido como el "truco del kernel".
ja: 形式的には、決定境界は高次元空間の超平面です。カーネル関数は、入力データをこの高次元空間に暗黙的にマッピングし、与えられた問題をより簡単に解くことがでます。言い換えれば、カーネルは元々非線形分離可能であったデータ分布を線形分離可能な問題にすることができます。これは「カーネル・トリック」として知られる効果です。

source: There are use-cases for kernel-based unsupervised algorithms too, for example, in the context of clustering. **Spectral Clustering** is a technique where data points are treated as nodes of a graph, and the clustering task is viewed as a graph partitioning problem where nodes are mapped to a space where they can be easily segregated to form clusters.
es_un: También hay casos de uso para algoritmos no supervisados basados ​​en kernel, por ejemplo, en el contexto de la agrupación (clustering). **La Agrupación Espectral** es una técnica en la que los puntos de datos se tratan como nodos de un grafo y la tarea de agrupación en clústeres se ve como un problema de partición de grafos en el que los nodos se asignan a un espacio en el que se pueden segregar fácilmente para formar grupos.
ja: カーネルベースの教師なしアルゴリズムにも、例えばクラスタリングの文脈で使われるケースがあります。 **スペクトル・クラスタリング** は、データ点をグラフのノードとして扱う手法であり、クラスタリング・タスクは、ノードがクラスタを形成するために容易に分離できる空間にマッピングされるグラフ分割問題として見なされます。

source: 1.2. Kernel Functions
es_un: 1.2. Funciones de Kernel
ja: 1.2 . カーネル関数

source: Mathematically, kernel functions follow:
es_un: Matemáticamente, las funciones de kernel siguen:
ja: 数学的には、カーネル関数は次のとおりです：

source: where \* :math:`k` is the kernel function \* :math:`\vec{x}_i, \vec{x}_j` are :math:`n` dimensional inputs \* :math:`f` is a map from :math:`n`-dimension to :math:`m`-dimension space and \* :math:`\langle a,b \rangle` denotes the inner product
es_un: donde \* :math:`k` es la función de kernel \* :math:`\vec{x}_i, \vec{x}_j` son entradas :math:`n` dimensionales \* :math:`f` es un mapa del espacio :math:`n`-dimensional al espacio :math:`m`-dimensional y \* :math:`\langle a,b \rangle` denota el producto interno
ja: ここで、 \* :math:`k` はカーネル関数、 \* :math:`\vec{x}_i, \vec{x}_j` は :math:`n` 次元の入力、 \* :math:`f` は :math:`n` 次元から :math:`m` 次元の空間への写像、 \* :math:`\langle a,b \rangle` は内積を表します。

source: When considering finite data, a kernel function can be represented as a matrix:
es_un: Al considerar datos finitos, una función de kernel se puede representar como una matriz:
ja: 有限データを考慮する場合、カーネル関数は次のような行列として表現することができます。

source: 1.3. Quantum Kernels
es_un: 1.3. Kernels Cuánticos
ja: 1.3 量子カーネル

source: The main idea behind quantum kernel machine learning is to leverage quantum feature maps to perform the kernel trick. In this case, the quantum kernel is created by mapping a classical feature vector :math:`\vec{x}` to a Hilbert space using a quantum feature map :math:`\phi(\vec{x})`. Mathematically:
es_un: La idea principal detrás del machine learning de kernel cuántico es aprovechar los mapas de características cuánticos para realizar el truco del kernel. En este caso, el kernel cuántico se crea asignando un vector de características clásico :math:`\vec{x}` a un espacio de Hilbert usando un mapa de características cuánticas :math:`\phi(\vec{x})`. Matemáticamente:
ja: 量子カーネル機械学習の背後にある主なアイデアは、量子特徴量マップを活用してカーネル トリックを実行することです。 この場合、量子カーネルは、量子特徴量マップ :math:`\phi(\vec{x})` を使用して古典的特徴量ベクトル :math:`\vec{x}` をヒルベルト空間にマッピングすることによって作成されます。 数学的には以下です:

source: where \* :math:`K_{ij}` is the kernel matrix \* :math:`\vec{x}_i, \vec{x}_j` are :math:`n` dimensional inputs \* :math:`\phi(\vec{x})` is the quantum feature map \* :math:`\left| \langle a|b \rangle \right|^{2}` denotes the overlap of two quantum states :math:`a` and :math:`b`
es_un: donde \* :math:`K_{ij}` es la matriz del kernel \* :math:`\vec{x}_i, \vec{x}_j` son entradas :math:`n` dimensionales \* :math:`\phi(\vec{x})` es el mapa de características cuántico \* :math:`\left| \langle a|b \rangle \right|^{2}` denota la superposición de dos estados cuánticos :math:`a` y :math:`b`
ja: ここで、 \* :math:`K_{ij}` はカーネル行列、 \* :math:`\vec{x}_i, \vec{x}_j` は :math:`n` 次元の入力、 \* :math:`\phi(\vec{x})` は量子特徴量マップ、 \* :math:`\left| \langle a|b \rangle \right|^{2}` は 2 つの量子状態 :math:`a` と :math:`b` の重なりを表します。

source: Quantum kernels can be plugged into common classical kernel learning algorithms such as SVMs or clustering algorithms, as you will see in the examples below. They can also be leveraged in new quantum kernel methods like ``QSVC`` `class <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QSVC.html>`__ provided by ``qiskit-machine-learning`` which is explored in this tutorial, and other methods as shown in later tutorials on `Pegasos QSVC <https://github.com/Qiskit/qiskit-machine-learning/blob/main/docs/tutorials/07_pegasos_qsvc.ipynb>`__ and `QKA <https://github.com/Qiskit/qiskit-machine-learning/blob/main/docs/tutorials/08_quantum_kernel_trainer.ipynb>`__.
es_un: Los kernels cuánticos se pueden conectar a algoritmos de aprendizaje de kernel clásicos comunes, como SVM o algoritmos de agrupamiento (clustering), como verás en los ejemplos a continuación. También se pueden aprovechar en nuevos métodos de kernel cuánticos como la `clase <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QSVC.html>`__ ``QSVC`` proporcionada por ``qiskit-machine-learning`` que se explora en este tutorial y otros métodos, como se muestra en tutoriales posteriores sobre `Pegasos QSVC <https://github.com/Qiskit/qiskit-machine-learning/blob/main/docs/tutorials/07_pegasos_qsvc.ipynb>`__ y `QKA <https://github.com/Qiskit/qiskit-machine-learning/blob/main/docs/tutorials/08_quantum_kernel_trainer.ipynb>`__.
ja: 以下の例でわかるように、量子カーネルは、SVM やクラスタリング アルゴリズムなどの一般的な古典的なカーネル学習アルゴリズムに接続できます。 これらは、このチュートリアルで説明する ``qiskit-machine-learning`` によって提供される ``QSVC`` `class <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QSVC.html>`__ のような新しい量子カーネル メソッドや、後の `Pegasos QSVC <https://github.com/Qiskit/qiskit-machine-learning/blob/main/docs/tutorials/07_pegasos_qsvc.ipynb>`__ および量`QKA <https://github.com/Qiskit/qiskit-machine-learning/blob/main/docs/tutorials/08_quantum_kernel_trainer.ipynb>`__ で示される他のメソッドでも利用できます。

source: Before introducing any example, we set up the global seed to ensure reproducibility:
es_un: Antes de presentar cualquier ejemplo, configuramos la semilla global para garantizar la reproducibilidad:
ja: 例を紹介する前に、再現性を確保するためにグローバル・シードをセットアップします。

source: 2. Classification
es_un: 2. Clasificación
ja: 2.分類

source: This section illustrates a quantum kernel classification workflow using ``qiskit-machine-learning``.
es_un: Esta sección ilustra un flujo de trabajo de clasificación de kernel cuántico usando ``qiskit-machine-learning``.
ja: このセクションでは、 ``qiskit-machine-learning`` を使用した量子カーネル分類ワークフローについて説明します。

source: 2.1. Defining the dataset
es_un: 2.1. Definición del conjunto de datos
ja: 2.1. データセットの定義

source: For this example, we will use the *ad hoc dataset* as described in the reference `paper <https://arxiv.org/pdf/1804.11326.pdf>`__.
es_un: Para este ejemplo, usaremos el *conjunto de datos ad hoc* como se describe en el `artículo <https://arxiv.org/pdf/1804.11326.pdf>`__ de referencia.
ja: この例では、 `paper <https://arxiv.org/pdf/1804.11326.pdf>`__ の中で説明されているように、 *ad hoc dataset* を使用します。

source: We can define the dataset dimension and get our train and test subsets:
es_un: Podemos definir la dimensión del conjunto de datos y obtener nuestros subconjuntos de entrenamiento y prueba:
ja: データセットの次元を定義し、訓練とテストのサブセットを取得します。

source: This dataset is two-dimensional, the two features are represented by the :math:`x` and :math:`y` coordinates, and it has two class labels: A and B. We can plot it and see what the distribution looks like. We define utility functions to plot the dataset.
es_un: Este conjunto de datos es bidimensional, las dos características están representadas por las coordenadas :math:`x` y :math:`y`, y tiene dos etiquetas de clase: A y B. Podemos graficarlo y ver cómo se ve la distribución. Definimos funciones de utilidad para graficar el conjunto de datos.
ja: このデータセットは2次元で、 :math:`x` と :math:`y` 座標で表されます。 AとBの2つのクラスラベルがあります。データセットをプロットするためのユーティリティ関数を定義します。

source: Now we actually plot the dataset for classification:
es_un: Ahora graficamos el conjunto de datos para la clasificación:
ja: さて分類のためのデータセットを実際にプロットします。

source: 2.2. Defining the quantum kernel
es_un: 2.2. Definición del kernel cuántico
ja: 2.2. 量子カーネルの定義

source: The next step is to create a quantum kernel instance that will help classify this data.
es_un: El siguiente paso es crear una instancia del kernel cuántico que ayude a clasificar estos datos.
ja: 次のステップは、このデータを分類するのに役立つ量子カーネルインスタンスを作成することです。

source: We use the ``FidelityQuantumKernel`` `class <https://github.com/Qiskit/qiskit-machine-learning/blob/main/qiskit_machine_learning/kernels/fidelity_quantum_kernel.py>`__, and pass two input arguments to its constructor:
es_un: Usamos la `clase <https://github.com/Qiskit/qiskit-machine-learning/blob/main/qiskit_machine_learning/kernels/fidelity_quantum_kernel.py>`__ ``FidelityQuantumKernel``, y pasamos dos argumentos de entrada a su constructor:
ja: ``FidelityQuantumKernel`` `class <https://github.com/Qiskit/qiskit-machine-learning/blob/main/qiskit_machine_learning/kernels/fidelity_quantum_kernel.py>`__ を使用し、2つの入力引数をコンストラクターに渡します:

source: ``feature_map``: in this case, a two-qubit ``ZZFeatureMap`` `instance <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__.
es_un: ``feature_map``: en este caso, una `instancia <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ ``ZZFeatureMap`` de dos qubits.
ja: ``feature_map``: この場合、2 qubit の ``ZZFeatureMap`` `instance <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ です。

source: ``fidelity``: in this case, the ``ComputeUncompute`` `fidelity <https://qiskit.org/documentation/stubs/qiskit.algorithms.state_fidelities.ComputeUncompute.html>`__ subroutine that leverages the ``Sampler`` `primitive <https://qiskit.org/documentation/stubs/qiskit.primitives.Sampler.html>`__.
es_un: ``fidelity``: en este caso, la subrutina de `fidelidad <https://qiskit.org/documentation/stubs/qiskit.algorithms.state_fidelities.ComputeUncompute.html>`__ de ``ComputeUncompute`` que aprovecha la `primitiva <https://qiskit.org/documentation/stubs/qiskit.primitives.Sampler.html>`__ ``Sampler``.
ja: ``fidelity``: この場合、``ComputeUncompute`` `fidelity <https://qiskit.org/documentation/stubs/qiskit.algorithms.state_fidelities.ComputeUncompute.html>`__ サブルーチンは、``Sampler`` `primitive <https://qiskit.org/documentation/stubs/qiskit.primitives.Sampler.html>`__ を利用します。

source: **NOTE:** If you don't pass a ``Sampler`` or ``Fidelity`` instance, then the instances of the reference ``Sampler`` and ``ComputeUncompute`` classes (found in ``qiskit.primitives``) will be created by default.
es_un: **NOTA:** Si no pasas una instancia ``Sampler`` o ``Fidelity``, entonces las instancias de las clases de referencia ``Sampler`` y ``ComputeUncompute`` (que se encuentran en ``qiskit.primitives``) serán creadas de forma predeterminada.
ja: **注意:** ``Sampler`` または ``Fidelity`` インスタンスを渡さない場合は、``Sampler`` と ``ComputeUncompute`` クラス (``qiskit.primitives`` にあります) はデフォルトで作成されます。

source: 2.3. Classification with SVC
es_un: 2.3. Clasificación con SVC
ja: 2.3. SVCによる分類

source: The quantum kernel can now be plugged into classical kernel methods, such as the ``SVC`` `algorithm <https://scikit-learn.org/stable/modules/svm.html>`__ from ``scikit-learn``. This algorithm allows us to define a `custom kernel <https://scikit-learn.org/stable/modules/svm.html#custom-kernels>`__ in two ways: 1. by providing the kernel as a **callable function** 2. by precomputing the **kernel matrix**
es_un: El kernel cuántico ahora se puede conectar a métodos de kernel clásicos, como el `algoritmo <https://scikit-learn.org/stable/modules/svm.html>`__ ``SVC`` de ``scikit-learn``. Este algoritmo nos permite definir un `kernel personalizado <https://scikit-learn.org/stable/modules/svm.html#custom-kernels>`__ de dos maneras: 1. proporcionando el kernel como **función invocable** 2. precalculando la **matriz del kernel**
ja: 量子カーネルは、 ``scikit-learn`` の ``SVC`` `algorithm <https://scikit-learn.org/stable/modules/svm.html>`__ のような古典的なカーネルメソッドに接続することができます。このアルゴリズムでは、2つの方法で `カスタムカーネル <https://scikit-learn.org/stable/modules/svm.html#custom-kernels>`__ を定義することができます： 1. カーネルを **呼び出し可能な関数** として提供する 2. **カーネル行列** を事前に計算する

source: Kernel as a callable function
es_un: Kernel como una función invocable
ja: 呼び出し可能な関数としてのカーネル

source: We define a SVC model and directly pass the ``evaluate`` function of the quantum kernel as a callable. Once the model is created, we train it by calling the ``fit`` method on the training dataset and evaluate the model for accuracy with ``score``.
es_un: Definimos un modelo SVC y pasamos directamente la función ``evaluate`` del kernel cuántico como un invocable. Una vez que se crea el modelo, lo entrenamos llamando al método ``fit`` en el conjunto de datos de entrenamiento y evaluamos la precisión del modelo con ``score``.
ja: SVC モデルを定義し、量子カーネルの ``evaluate`` 関数を呼び出し可能として直接渡します。 モデルが作成されたら、トレーニング データセットに対して ``fit`` メソッドを呼び出してモデルをトレーニングし、モデルの精度を ``score`` で評価します。

source: Precomputed kernel matrix
es_un: Matriz de kernel precalculada
ja: 事前計算されたカーネル行列

source: Instead of passing a function of the quantum kernel as a callable, we can also precompute training and testing kernel matrices before passing them to the ``scikit-learn`` ``SVC`` algorithm.
es_un: En lugar de pasar una función de kernel cuántico como invocable, también podemos calcular previamente las matrices del kernel de entrenamiento y prueba antes de pasarlas al algoritmo ``SVC`` de ``scikit-learn``.
ja: 量子カーネルの関数を呼び出し可能として渡す代わりに、 ``scikit-learn`` ``SVC`` アルゴリズムに渡す前に、トレーニングとテストのカーネル行列を事前計算することもできます。

source: To extract the train and test matrices, we can call ``evaluate`` on the previously defined kernel and visualize them graphically as follows:
es_un: Para extraer las matrices de entrenamiento y prueba, podemos llamar a ``evaluate`` en el kernel previamente definido y visualizarlas gráficamente de la siguiente manera:
ja: トレインとテスト行列を抽出するには、以前に定義したカーネルの ``evaluate`` を呼び出し、次のようにグラフィカルに視覚化します。

source: To use these matrices, we set the ``kernel`` parameter of a new ``SVC`` instance to ``"precomputed"``. We train the classifier by calling ``fit`` with the training matrix and training dataset. Once the model is trained, we evaluate it using the test matrix on the test dataset.
es_un: Para usar estas matrices, establecemos el parámetro ``kernel`` de una nueva instancia de ``SVC`` con ``"precomputed"``. Entrenamos al clasificador llamando a ``fit`` con la matriz de entrenamiento y el conjunto de datos de entrenamiento. Una vez que se entrena el modelo, lo evaluamos usando la matriz de prueba en el conjunto de datos de prueba.
ja: これらの行列を使用するには、新しい ``SVC`` インスタンスの ``kernel`` パラメーターを ``"precomputed"`` に設定します。 トレーニング行列とトレーニング データセットを使用して ``fit`` を呼び出して分類器をトレーニングします。 モデルがトレーニングされたら、テスト データセットのテスト行列を使用してモデルを評価します。

source: 2.4. Classification with QSVC
es_un: 2.4. Clasificación con QSVC
ja: 2.4. SVCによる分類

source: ``QSVC`` is an alternative training algorithm provided by ``qiskit-machine-learning`` for convenience. It is an extension of ``SVC`` that takes in a quantum kernel instead of the ``kernel.evaluate`` method shown before.
es_un: ``QSVC`` es un algoritmo de entrenamiento alternativo proporcionado por ``qiskit-machine-learning`` por conveniencia. Es una extensión de ``SVC`` que acepta un kernel cuántico en lugar del método ``kernel.evaluate`` mostrado anteriormente.
ja: ``QSVC`` は、便宜上 ``qiskit-machine-learning`` によって提供される代替トレーニング アルゴリズムです。 これは、前に示した ``kernel.evaluate`` メソッドの代わりに量子カーネルを取り込む ``SVC`` の拡張機能です。

source: 2.5. Evaluation of models used for classification
es_un: 2.5. Evaluación de modelos utilizados para la clasificación
ja: 2.5. 分類に使用されるモデルの評価

source: As the classification dataset is small, we find that the three models achieve 100% accuracy.
es_un: Como el conjunto de datos de clasificación es pequeño, encontramos que los tres modelos logran una precisión del 100%.
ja: 分類データセットが小さいため、3つのモデルが100%の精度を達成していることがわかります。

source: 3. Clustering
es_un: 3. Agrupación (Clustering)
ja: 3. クラスタリング

source: The second workflow in this tutorial focuses on a clustering task using ``qiskit-machine-learning`` and the spectral clustering algorithm from ``scikit-learn``.
es_un: El segundo flujo de trabajo de este tutorial se centra en una tarea de agrupamiento (clustering) utilizando ``qiskit-machine-learning`` y el algoritmo de agrupamiento espectral de ``scikit-learn``.
ja: このチュートリアルの 2 番目のワークフローは、``qiskit-machine-learning`` を使用したクラスタリングタスクと、``scikit-learn`` からのスペクトルクラスタリングアルゴリズムに焦点を当てています。

source: 3.1. Defining the dataset
es_un: 3.1. Definición del conjunto de datos
ja: 3.1. データセットの定義

source: We will once again use the *ad hoc dataset*, but now generated with a higher gap of ``0.6`` (previous example: ``0.3``) between the two classes.
es_un: Una vez más usaremos el *conjunto de datos ad hoc*, pero ahora generado con una brecha mayor de ``0.6`` (ejemplo anterior: ``0.3``) entre las dos clases.
ja: 再び *ad hoc dataset* を使用しますが、2つのクラス間で ``0.6`` (以前の例では ``0.3` `) のギャップで生成されます。
