Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/03_quantum_kernel.po
Languages: bn_bn, de_de, es_un, fr_fr, hi_in, ja, ml_in, pt_un, zh_tw

source: `Support vector regression <https://scikit-learn.org/stable/modules/generated/sklearn.svm.SVR.html>`__
de_de: ` Support-Vektor-Regression <https://scikit-learn.org/stable/modules/generated/sklearn.svm.SVR.html>` __
fr_fr: `Régression à vecteur de support <https://scikit-learn.org/stable/modules/generated/sklearn.svm.SVR.html>` __
hi_in: सहयोग वैक्टर प्रतिगमन <https://scikit-learn.org/stable/modules/generated/sklearn.svm.SVR.html>`__
pt_un: `Suporte regressão vetorial <https://scikit-learn.org/stable/modules/generated/sklearn.svm.SVR.html>`__

source: `Ridge regression <https://scikit-learn.org/stable/modules/generated/sklearn.kernel_ridge.KernelRidge.html>`__
fr_fr: `Régression dorsale <https://scikit-learn.org/stable/modules/generated/sklearn.kernel_ridge.KernelRidge.html>` __
hi_in: चोटी प्रतिगमन <https://scikit-learn.org/stable/modules/generated/sklearn.kernel_ridge.KernelRidge.html>`__
pt_un: `Cume de regressão <https://scikit-learn.org/stable/modules/generated/sklearn.kernel_ridge.KernelRidge.html>`__

source: `Principal component analysis <https://scikit-learn.org/stable/modules/generated/sklearn.decomposition.KernelPCA.html>`__
de_de: `Hauptkomponentenanalyse <https://scikit-learn.org/stable/modules/generated/sklearn.decomposition.KernelPCA.html>`__
fr_fr: `Analyse en composantes principales <https://scikit-learn.org/stable/modules/generated/sklearn.decomposition.KernelPCA.html>` __
hi_in: प्रमुख घटक विश्लेषण <https://scikit-learn.org/stable/modules/generated/sklearn.decomposition.KernelPCA.html>`__
pt_un: `Análise do componente principal <https://scikit-learn.org/stable/modules/generated/sklearn.decomposition.KernelPCA.html>`__
