Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/03_quantum_kernel.po
Languages: bn_bn, de_de, es_un, fr_fr, hi_in, ja, ml_in, pt_un, zh_tw

source: Note that clustering falls under the category of unsupervised machine learning, so a test dataset is not required.
es_un: Ten en cuenta que la agrupación en clústeres se incluye en la categoría de machine learning no supervisado, por lo que no se requiere un conjunto de datos de prueba.
ja: クラスタリングは教師なし機械学習のカテゴリに属するため、テストデータセットは必要ありません。

source: We plot the clustering dataset below:
es_un: Graficamos el conjunto de datos de agrupamiento a continuación:
ja: クラスタリングデータセットを以下にプロットします。

source: 3.2. Defining the Quantum Kernel
es_un: 3.2. Definición del Kernel Cuántico
ja: 3.2. 量子カーネルの定義

source: We use an identical setup as in the classification example. We create another instance of the ``FidelityQuantumKernel`` class with a ``ZZFeatureMap``, but you might notice that in this case we do not provide a ``fidelity`` instance. This is because the ``ComputeUncompute`` method provided in the previous case is instantiated by default when the fidelity instance is not provided explicitly.
es_un: Usamos una configuración idéntica a la del ejemplo de clasificación. Creamos otra instancia de la clase ``FidelityQuantumKernel`` con un ``ZZFeatureMap``, pero puedes notar que en este caso no proporcionamos una instancia de ``fidelity``. Esto se debe a que el método ``ComputeUncompute`` proporcionado en el caso anterior es instanciado de forma predeterminada cuando la instancia de fidelidad no se proporciona explícitamente.
ja: 分類例と同じセットアップを使用します。 ``ZZFeatureMap`` を使用した ``FidelityQuantumKernel`` クラスの別のインスタンスを作成します。 しかし、この場合、``fidelity`` インスタンスは提供されません。 これは、fidelityインスタンスが明示的に提供されていない場合、前のケースで提供されている``ComputeUncompute`` メソッドがデフォルトでインスタンス化されるためです。

source: 3.3. Clustering with the Spectral Clustering Model
es_un: 3.3. Agrupamiento (Clustering) con el Modelo de Agrupamiento Espectral
ja: 3.3. スペクトルクラスタリングモデルとクラスタリング

source: The ``scikit-learn`` spectral clustering algorithm allows us to define a custom kernel in two ways (just like ``SVC``): 1. by providing the kernel as a **callable function** 2. by precomputing the **kernel matrix**.
es_un: El algoritmo de agrupamiento espectral de ``scikit-learn`` nos permite definir un kernel personalizado de dos maneras (al igual que ``SVC``): 1. proporcionando el kernel como una **función invocable** 2. precalculando la **matriz del kernel**.
ja: ``scikit-learn`` のスペクトラル・クラスタリング・アルゴリズムでは、(``SVC`` のように) カスタム・カーネルを2つの方法で定義することができます: 1. カーネルを **呼び出し可能な関数** として提供するか、2. カーネル行列を事前計算するかです。

source: With the current ``FidelityQuantumKernel`` class in ``qiskit-machine-learning``, we can only use the latter option, so we precompute the kernel matrix by calling ``evaluate`` and visualize it as follows:
es_un: Con la clase ``FidelityQuantumKernel`` actual en ``qiskit-machine-learning``, solo podemos usar la última opción, por lo que precalculamos la matriz del kernel llamando a ``evaluate`` y la visualizamos de la siguiente manera:
ja: ``qiskit-machine-learning`` の現在の ``FidelityQuantumKernel`` クラスでは、後者のオプションのみを使用できます。 カーネル行列を事前に計算し、``evaluate`` を呼び出し、次のように視覚化します。

source: Next, we define a spectral clustering model and fit it using the precomputed kernel. Further, we score the labels using normalized mutual information, since we know the class labels a priori (before hand).
es_un: A continuación, definimos un modelo de agrupamiento espectral y lo ajustamos utilizando el kernel precalculado. Además, calificamos las etiquetas utilizando información mutua normalizada, ya que conocemos las etiquetas de clase a priori (de antemano).
ja: 次に、スペクトルクラスタリングモデルを定義し、あらかじめ計算されたカーネルを使用してそれを適合させます。 さらに、正規化された相互情報を使ってラベルをスコアします。クラスのラベルはプリオリ(手前) であることが分かっています。

source: 4. Kernel Principal Component Analysis
es_un: 4. Análisis de Componentes Principales del Kernel
ja: 4. カーネル主成分解析

source: This section focuses on a Principal Component Analysis task using a kernel PCA algorithm. We calculate a kernel matrix using a ``ZZFeatureMap`` and show that this approach translates the original features into a new space, where axes are chosen along principal components. In this space the classification task can be performed with a simpler model rather than an SVM.
es_un: Esta sección se centra en una tarea de análisis de componentes principales utilizando un algoritmo PCA de kernel. Calculamos una matriz del kernel usando un ``ZZFeatureMap`` y mostramos que este enfoque traduce las características originales a un nuevo espacio, donde los ejes se eligen a lo largo de los componentes principales. En este espacio, la tarea de clasificación se puede realizar con un modelo más simple en lugar de una SVM.
ja: このセクションでは、カーネルPCAアルゴリズムを使用した主成分分析タスクに焦点を当てます。 ``ZZFeatureMap`` を使用してカーネルマトリックスを計算し、このアプローチが元の機能を新しい空間に変換することを示します。 軸を主成分に沿って選びます。この分野では、SVMではなく単純なモデルで分類作業を行うことができます。

source: 4.1. Defining the dataset
es_un: 4.1. Definición del conjunto de datos
ja: 4.1. データセットの定義

source: We again use the *ad hoc dataset* with a gap of ``0.6`` between the two classes. This dataset resembles the dataset we had in the clustering section, the difference is that in this case ``test_size`` is not zero.
es_un: Nuevamente, usamos el *conjunto de datos ad hoc* con una brecha de ``0.6`` entre las dos clases. Este conjunto de datos se asemeja al conjunto de datos que teníamos en la sección de agrupamiento, la diferencia es que en este caso ``test_size`` no es cero.
ja: 2 つのクラス間の ``0.6`` のギャップを持つ *ad hoc dataset* を使用します。 このデータセットは、クラスタリングセクションにあるデータセットに似ています。この場合、``test_size`` はゼロではありません。

source: We plot the training and test datasets below. Our ultimate goal in this section is to construct new coordinates where the two classes can be linearly separated.
es_un: Graficamos los conjuntos de datos de entrenamiento y prueba a continuación. Nuestro objetivo final en esta sección es construir nuevas coordenadas donde las dos clases se puedan separar linealmente.
ja: トレーニングとテストのデータセットを以下に示します。 このセクションの最終目標は、二つのクラスを直線的に分離できる新しい座標を構築することです。

source: 4.2. Defining the Quantum Kernel
es_un: 4.2. Definición del Kernel Cuántico
ja: 4.2. 量子カーネルの定義

source: We proceed with the same kernel setup as it was in the classification task, namely a ``ZZFeatureMap`` circuit as a feature map and an instance of ``FidelityQuantumKernel``.
es_un: Procedemos con la misma configuración del kernel que en la tarea de clasificación, es decir, un circuito ``ZZFeatureMap`` como un mapa de características y una instancia de ``FidelityQuantumKernel``.
ja: 分類作業と同じカーネルセットアップを進めます。 つまり、特徴量マップとしての ``ZZFeatureMap`` 回路と、 ``FidelityQuantumKernel`` のインスタンスです。

source: Then, we evaluate kernel matrices for the training and test features.
es_un: Luego, evaluamos las matrices del kernel para las características de entrenamiento y prueba.
ja: 次に、トレーニングとテスト機能のカーネル行列を評価します。

source: 4.3. Comparison of Kernel PCA on gaussian and quantum kernel
es_un: 4.3. Comparación del Kernel PCA con kernel gaussiano y cuántico
ja: 4.3. ガウシアンのカーネルPCAと量子カーネルの比較

source: In this section we use the ``KernelPCA`` implementation from ``scikit-learn``, with the ``kernel`` parameter set to "rbf" for a gaussian kernel and "precomputed" for a quantum kernel. The former is very popular in classical machine learning models, whereas the latter allows using a quantum kernel defined as ``qpca_kernel``.
es_un: En esta sección usamos la implementación ``KernelPCA`` de ``scikit-learn``, con el parámetro ``kernel`` establecido en "rbf" para un kernel gaussiano y "precalculado" para un kernel cuántico. El primero es muy popular en los modelos clásicos de machine learning, mientras que el segundo permite usar un kernel cuántico definido como ``qpca_kernel``.
ja: このセクションでは、``scikit-learn`` から ``KernelPCA`` 実装を使用します。 gaussian カーネルの ``kernel`` パラメータを "rbf" に、量子カーネルの "precomputed" に設定します。 前者は古典的な機械学習モデルで非常に人気がありますが、後者は ``qpca_kernel`` として定義された量子カーネルを使用できます。

source: One can observe that the gaussian kernel based Kernel PCA model fails to make the dataset linearly separable, while the quantum kernel succeeds.
es_un: Se puede observar que el modelo Kernel PCA basado en el kernel gaussiano no logra que el conjunto de datos sea linealmente separable, mientras que el kernel cuántico sí lo logra.
ja: ガウス系カーネルベースのKernel PCAモデルは、データセットを線形に分離可能にできず、量子カーネルは成功していることがわかります。

source: While usually PCA is used to reduce the number of features in a dataset, or in other words to reduce dimensionality of a dataset, we don't do that here. Rather we keep the number of dimensions and employ the kernel PCA, mostly for visualization purposes, to show that classification on the transformed dataset becomes easily tractable by linear methods, like logistic regression. We use this method to separate two classes in the principal component space with a ``LogisticRegression`` model from ``scikit-learn``. As usual we train it by calling the ``fit`` method on the training dataset and evaluate the model for accuracy with ``score``.
es_un: Si bien PCA generalmente se usa para reducir la cantidad de características en un conjunto de datos o, en otras palabras, para reducir la dimensionalidad de un conjunto de datos, no lo hacemos aquí. Más bien, mantenemos el número de dimensiones y empleamos el kernel PCA, principalmente con fines de visualización, para mostrar que la clasificación en el conjunto de datos transformado se vuelve fácilmente tratable mediante métodos lineales, como la regresión logística. Usamos este método para separar dos clases en el espacio de componentes principales con un modelo ``LogisticRegression`` de ``scikit-learn``. Como de costumbre, lo entrenamos llamando al método ``fit`` en el conjunto de datos de entrenamiento y evaluamos la precisión del modelo con ``score``.
ja: 通常、PCAはデータセットの特徴量の数を減らすために使用されます。 言い換えればデータセットの次元数を減らすために使われますが、ここではそのようには使いません。次元の数を保ち、カーネルPCAを使用するのは、主に可視化目的のためです。 変換されたデータセットの分類がロジスティック回帰のような線形手法で容易に扱えることを示します。このメソッドを使用して、主要コンポーネント空間内の 2 つのクラスを ``scikit-learn`` の ``LogisticRegression`` モデルを使って分離します。 いつものように、トレーニングデータセットに ``fit`` メソッドを呼び出し、モデルの正確性を ``score`` で評価することで訓練します。

source: Here we train and score a model.
es_un: Aquí entrenamos y puntuamos un modelo.
ja: モデルを訓練して得点をつけます。

source: Let's plot the results. First, we plot the transformed dataset we get with the quantum kernel. On the same plot we also add model results. Then, we plot the transformed dataset we get with the gaussian kernel.
es_un: Grafiquemos los resultados. Primero, graficamos el conjunto de datos transformados que obtenemos con el kernel cuántico. En la misma gráfica también agregamos los resultados del modelo. Luego, graficamos el conjunto de datos transformados que obtenemos con el kernel gaussiano.
ja: 結果をプロットしてみましょう。まず、量子カーネルで得られる変換されたデータセットをプロットします。 同じプロットでは、モデルの結果も追加します。そして、ガウスカーネルで得られる変換されたデータセットをプロットします。

source: As we can see, the data points on the right figure are not separable, but they are on the left figure, hence in case of quantum kernel we can apply linear models on the transformed dataset and this is why SVM classifier works perfectly well on the *ad hoc* dataset as we saw in the `classification section <#2.-Classification>`__.
es_un: Como podemos ver, los puntos de datos en la figura de la derecha no son separables, pero están en la figura de la izquierda, por lo tanto, en el caso del kernel cuántico, podemos aplicar modelos lineales en el conjunto de datos transformado y es por eso que el clasificador SVM funciona perfectamente bien en el conjunto de datos *ad hoc* como vimos en la `sección de clasificación <#2.-Clasificación>`__.
ja: ご覧のとおり、右の図のデータ ポイントは分離可能ではありませんが、左の図では分離可能です。したがって、量子カーネルの場合、変換されたデータセットに線形モデルを適用できます。これが、 `分類セクション <#2.-Classification>`__ で見た *ad hoc* データセットでSVM 分類器で分離可能である理由です。

source: 5. Conclusion
es_un: 5. Conclusión
ja: 5. 結論

source: In this tutorial:
es_un: En este tutorial:
ja: このチュートリアルでは:

source: We reviewed the fundamentals of quantum kernel learning
es_un: Revisamos los fundamentos del aprendizaje del kernel cuántico

source: We understood how to define quantum kernels as instances of ``FidelityQuantumKernel``
es_un: Entendimos cómo definir kernels cuánticos como instancias de ``FidelityQuantumKernel``

source: We learned how to use the ``scikit-learn`` ``SVC`` algorithm with a custom quantum kernel as a callable function vs precomputed quantum kernel matrix for classification
es_un: Aprendimos a usar el algoritmo ``SVC`` de ``scikit-learn`` con un kernel cuántico personalizado como una función invocable frente a una matriz de kernel cuántico precalculada para la clasificación

source: We learned how to train classifiers with the ``QSVC`` algorithm from ``qiskit-machine-learning``
es_un: Aprendimos a entrenar clasificadores con el algoritmo ``QSVC`` de ``qiskit-machine-learning``

source: We learned how to use the ``scikit-learn`` ``SpectralClustering`` algorithms with a precomputed quantum kernel matrix for clustering
es_un: Aprendimos a usar los algoritmos ``SpectralClustering`` de ``scikit-learn`` con una matriz de kernel cuántico precalculada para la agrupación (clustering)

source: We investigated how to plug in a quantum kernel into ``scikit-learn``'s ``KernelPCA`` algorithm and transform the ad-hoc dataset into a new one that can be tackled by a linear model.
es_un: Investigamos cómo conectar un kernel cuántico en el algoritmo ``KernelPCA`` de ``scikit-learn`` y transformar el conjunto de datos ad-hoc en uno nuevo que pueda ser abordado por un modelo lineal.

source: For further reference, ``scikit-learn`` has other algorithms that can use a precomputed kernel matrix, such as:
es_un: Para mayor referencia, ``scikit-learn`` tiene otros algoritmos que pueden usar una matriz de kernel precalculada, como:

source: `Gaussian process regression <https://scikit-learn.org/stable/modules/gaussian_process.html>`__
de_de: `Gaußsche Prozessregression <https://scikit-learn.org/stable/modules/gaussian_process.html>`__
es_un: `Guassian process regression <https://scikit-learn.org/stable/modules/gaussian_process.html>`__
fr_fr: `Régression du processus Gaussien <https://scikit-learn.org/stable/modules/gaussian_process.html>` __
hi_in: `Gaussian प्रक्रिया प्रतिगमन <https://scikit-learn.org/stable/modules/gaussian_process.html>`__
pt_un: `Processo de regressão Gaussiana <https://scikit-learn.org/stable/modules/gaussian_process.html>`__

source: The general task of machine learning is to find and study patterns in data. For many datasets, the datapoints are better understood in a higher dimensional feature space, through the use of a kernel function: :math:`k(\vec{x}_i, \vec{x}_j) = \langle f(\vec{x}_i), f(\vec{x}_j) \rangle` where :math:`k` is the kernel function, :math:`\vec{x}_i, \vec{x}_j` are :math:`n` dimensional inputs, :math:`f` is a map from :math:`n`-dimension to :math:`m`-dimension space and :math:`\langle a,b \rangle` denotes the dot product. When considering finite data, a kernel function can be represented as a matrix: :math:`K_{ij} = k(\vec{x}_i,\vec{x}_j)`.
bn_bn: মেশিন লার্নিং এর কাজ হচ্ছে তথ্য ( ডেটা ) বিন্যাস করা। ডেটাসেটসমূহ খুব ভালোভাবে বিশ্লেষন করা যায় উচ্চ মাত্রার ফিচার স্পেস পর্যবেক্ষন করে, এইজন্য প্রয়োজন একটি কার্নেল ফাংশনঃ :math:`k(\vec{x}_i, \vec{x}_j) = \langle f(\vec{x}_i), f(\vec{x}_j) \rangle`, যেখানে :math:`k` হচ্ছে কার্নেল ফাংশন, :math:`\vec{x}_i, \vec{x}_j` হচ্ছে :math:`n` মাত্রিক ইনপুট বা ডাইমেনশনাল ইনপুট, :math:`f` হচ্ছে একটি ম্যাপিং যা :math:`n` ডাইমেনশন থেকে :math:`m` ডাইমেনশন স্পেস এবং :math:`\langle a,b \rangle` হচ্ছে ডট গুণন। যখন কোন সসীম ডাটা হিসাব করা হয় তখন, কার্নেল ফাংশন কে রিপ্রেসেন্ট করা হয় : :math:`K_{ij} = k(\vec{x}_i,\vec{x}_j)`এই ম্যাট্রিক্স দ্বারা।
de_de: Die allgemeine Aufgabe des maschinellen Lernens ist es, Muster in Daten zu finden und zu untersuchen. Für viele Datensätze werden die Datenpunkte in einem hochdimensionalen Feature-Raum besser durch Verwendung einer Kernel-Funktion verstanden: :math:`k(\vec{x}_i, \vec{x}_j) = \langle f(\vec{x}_i), f(\vec{x}_j) \rangle` wobei :math:`k` die Kernel-Funktion ist, :math:`\vec{x}_i, \vec{x}_j` sind :math:`n` dimensionale Inputs, :math:`f` ist eine Abbildung von :math:`n`-dimensionalen zu :math:`m`-dimensionalen Räumen und :math:`\langle a, \rWinkel` bezeichnet das innere Produkt. Wenn endliche Daten in Betracht gezogen werden, kann eine Kernel-Funktion als Matrix dargestellt werden: :math:`K_{ij} = k(\vec{x}_i,\vec{x}_j)`.
fr_fr: La tâche générale de l'apprentissage automatique est de trouver et d'étudier des modèles dans les données. Pour de nombreux jeux de données, les points de données sont mieux compris dans un espace de plus grande dimension par l'utilisation d'une fonction du noyau : :math:`k(\vec{x}_i, \vec{x}_j) = \langle f(\vec{x}_i), f(\vec{x}_j) \rangle` où :math:`k` est la fonction du noyau, :math:`\vec{x}_i, \vec{x}_j` sont :math:`n` entrées dimensionnelles, :math:`f` est une carte de :math:`n`-dimension à :math:`m`-dimension espace et :math:`\langle a, \rangle` indique le produit à point. Lorsque l'on considère les données finies, une fonction du noyau peut être représentée par une matrice : :math:`K_{ij} = k(\vec{x}_i,\vec{x}_j)`.
hi_in: आम तौर पर मशीन-लर्निंग का कार्य डेटा में पैटर्न खोजने और अध्ययन करना है, कई डेटासेट के लिए कर्नेल फंक्शन के उपयोग के माध्यम से डेटापॉइंट को उच्च आयामी फीचर स्पेस में बेहतर ढंग से समझा जाता है : :math:`k(\vec{x}_i, \vec{x}_j) = \langle f(\vec{x}_i), f(\vec{x}_j) \rangle` जहाँ :math:`k` कर्नेल फंक्शन है, :math:`\vec{x}_i, \vec{x}_j` are :math:`n` आयामी इनपुट, :math:`f` एक :math:`n`-आयाम से :math:`m`-आयाम स्थान का मैप है और :math:`\langle a,b \rangle` डॉट उत्पाद को दर्शाता है. परिमित डेटा पर विचार करते समय, कर्नेल फ़ंक्शन को मैट्रिक्स के रूप में दर्शाया जा सकता है: :math:`K_{ij} = k(\vec{x}_i,\vec{x}_j)`.
ml_in: ഡാറ്റയിലെ പാറ്റേണുകൾ കണ്ടെത്തുകയും പഠിക്കുകയും ചെയ്യുക എന്നതാണ് മെശീൻ ലേണിംഗിൻ്റെ പൊതുവായ ചുമതല.പല ഡാറ്റാസെറ്റുകൾ‌ക്കും, കേർ‌ണൽ‌ ഫംഗ്ഷന്റെ ഉപയോഗത്തിലൂടെ ഡാറ്റാ പോയിൻറുകൾ‌ ഉയർന്ന ഡൈമെൻ‌ഷൻ‌ ഫീച്ചർ‌ സ്‌പെയ്‌സിൽ‌ നന്നായി മനസ്സിലാക്കാം: :math:`k(\vec{x}_i, \vec{x}_j) = \langle f(\vec{x}_i), f(\vec{x}_j) \rangle` ഇവിടെ :math:`k` എന്നത് കേർണൽ ഫംഗ്ഷനാണ്, :math:`\vec{x}_i, \vec{x}_j` ഇവ :math:`n` ഡൈമൻഷണൽ ഇൻപുട്ടുകളാണ്, :math:`f` എന്നത് :math:`n`- ഡൈമൻഷനിൽ നിന്ന് :math:`m`- ഡൈമൻഷൻ സ്‌പെയ്‌സിലേക്കുള്ള മാപ്പാണ്, കൂടാതെ :math:`\langle a,b \rangle` എന്നത് ഡോട്ട് പ്രൊഡക്റ്റിനെ സൂചിപ്പിക്കുന്നു. പരിമിത ഡാറ്റ പരിഗണിക്കുമ്പോൾ, ഒരു കേർണൽ ഫംഗ്ഷനെ ഒരു മാട്രിക്സായി പ്രതിനിധീകരിക്കാം: :math:`K_{ij} = k(\vec{x}_i,\vec{x}_j)`.
pt_un: A tarefa geral do machine learning é encontrar e estudar padrões em dados. Para muitos conjuntos de dados, os pontos de dados são melhores entendidos em um espaço de recursos de dimensão superior, através do uso de uma função kernel: :math:`k(\vec{x}_i, \vec{x}_j) = \langle f(\vec{x}_i), f(\vec{x}_j) \rangle` onde :math:`k` representa a função kernel, :math:`\vec{x}_i, \vec{x}_j` são :math:`n` inputs dimensionais, :math:`f` é um mapa da :math:`n`-dimensão para :math:`m`-dimensão espacial e :math:`\langle a,b \rangle` denota o produto escalar. Quando consideramos dados finitos, a função kernel pode ser representada como uma matrix: :math:`K_{ij} = k(\vec{x}_i,\vec{x}_j)`.
zh_tw: 機器學習中的一項常見任務是從數據中發現和學習模式。對於很多資料集，數據點可以藉由核心函數:math:`k(\vec{x}_i, \vec{x}_j) = \langle f(\vec{x}_i), f(\vec{x}_j) \rangle`在高維特徵空間中理解，其中:math:`k`是核心函數， :math:`\vec{x}_i, \vec{x}_j`是 n 維輸入，並且:math:`f` 是從 :math:`n`-維空間到:math:`m`-維空間的映射， :math:`\langle a,b \rangle` 表示內積。對於有限數據，核心函數可以用矩陣表示 :math:`K_{ij} = k(\vec{x}_i,\vec{x}_j)`。

source: In quantum kernel machine learning, a quantum feature map :math:`\phi(\vec{x})` is used to map a classical feature vector :math:`\vec{x}` to a quantum Hilbert space, :math:`| \phi(\vec{x})\rangle \langle \phi(\vec{x})|`, such that :math:`K_{ij} = \left| \langle \phi^\dagger(\vec{x}_j)| \phi(\vec{x}_i) \rangle \right|^{2}`. See `Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__ for more details.
bn_bn: কার্নেল মেশিন লার্নিং এ ক্লাসিক্যাল ফিচার ভেক্টর :math:`\vec{x}` কে কোয়ান্টাম হিলবার্ট স্পেস :math:`| \phi(\vec{x})\rangle \langle \phi(\vec{x})|` যেমন, :math:`K_{ij} = \left| \langle \phi^\dagger(\vec{x}_j)| \phi(\vec{x}_i) \rangle \right|^{2}` এ ম্যাপিং করে গুছিয়ে নিতে একটি কোয়ান্টাম ফিচার ম্যাপ :math:`\phi(\vec{x})` ব্যবহৃত হয়। আরও জানতে `Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__ পেপারটি দেখুন।
de_de: Beim Quantenkernel-Maschine-Learning wird eine Quantum-Featur-Map :math:`\phi(\vec{x})` verwendet, um einen klassischen Feature-Vektor :math:`\vec{x}` einem Quanten-Hilbert-Raum :math:`| \phi(\vec{x})\rangle \langle \phi(\vec{x})|` zuzuordnen, so dass :math:`K_{ij} = \links| \langle \phi^\dagger(\vec{x}_j)| \phi(\vec{x}_i) \rWinkel \right|^{2}`. Siehe `Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__ für weitere Details.
fr_fr: Dans l'apprentissage de la machine quantique du noyau, une carte de fonction quantique :math:`\phi(\vec{x})` est utilisée pour mapper un vecteur de trait classique :math:`\vec{x}` à un espace Hilbert quantique, :math:`| \\phi(\vec{x})\rangle \langle \\phi(\vec{x})|`, tel que :math:`K_{ij} = \left| \langle \phi^\dagger(\vec{x}_j)| \\phi(\vec{x}_i) \rangle \right|^{2}`. Voir `Apprentissage supervisé avec des espaces de fonctionnalités améliorés quantiques <https://arxiv.org/pdf/1804.11326.pdf>`__ pour plus de détails.
hi_in: क्वांटम कर्नेल मशीन लर्निंग में, एक क्वांटम फीचर मैप :math:`\phi(\vec{x})` का उपयोग एक शास्त्रीय फीचर :math:`\vec{x}` को क्वांटम एक हिल्बर्ट स्थान :math:`| \phi(\vec{x})\rangle \langle \phi(\vec{x})|`,में मैप करने के लिए उपयोग किया जाता है जिससे हमें :math:`K_{ij} = \left| \langle \phi^\dagger(\vec{x}_j)| \phi(\vec{x}_i) \rangle \right|^{2}`.मिलता है. अधिक विवरण के लिए देखें `Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__.
ml_in: ക്വാണ്ടം കേർണൽ മെഷീൻ ലേണിംഗിൽ, ഒരു ക്വാണ്ടം സവിശേഷത മാപ്പ് :math:`\phi(\vec{x})` നെ ഒരു ക്ലാസിക്കൽ സവിശേഷത വെക്റ്ററിനെ :math:`\vec{x}` ഒരു ക്വാണ്ടം ഹിൽബർട്ട് സ്പേസിലേക്ക് :math:`| \phi(\vec{x})\rangle \langle \phi(\vec{x})|` മാപ്പ് ചെയ്യാൻ ഉപയോഗിക്കുന്നു, അങ്ങനെ :math:`K_{ij} = \left| \langle \phi^\dagger(\vec{x}_j)| \phi(\vec{x}_i) \rangle \right|^{2}`. കൂടുതൽ വിവരങ്ങൾക്ക് `Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__ കാണുക.
pt_un: No aprendizado de máquina do kernel quântico, um mapa de recurso quântico :math:`\phi(\vec{x})` é utilizado para mapear um vetor de funcionalidade clássico :math:`\vec{x}` para um espaço quântico Hilbert :math:`| \phi(\vec{x})\rangle \langle \phi(\vec{x})|`, como este :math:`K_{ij} = \left| \langle \phi^\dagger(\vec{x}_j)| \phi(\vec{x}_i) \rangle \right|^{2}`. Veja `Aprendizado supervisionado com espaços de recursos quânticos aprimorados <https://arxiv.org/pdf/1804.11326.pdf>`__ para mais detalhes.
zh_tw: 在量子核心機器學習中，量子特徵圖 :math:`\phi(\vec{x})` 常被用來將古典的特徵向量 :math:`\vec{x}` 映射到量子希爾伯特空間:math:`| \phi(\vec{x})\rangle \langle \phi(\vec{x})|`, 像 :math:`K_{ij} = \left| \langle \phi^\dagger(\vec{x}_j)| \phi(\vec{x}_i) \rangle \right|^{2}`。有關更多信息，請參閱`Supervised learning with quantum enhanced feature spaces <https://arxiv.org/pdf/1804.11326.pdf>`__ 。
