Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/04_qgans_for_loading_random_distributions.po
Languages: bn_bn, de_de, fr_fr, hi_in, ml_in, zh_tw

source: This page was generated from `docs/tutorials/04_qgans_for_loading_random_distributions.ipynb`__.
bn_bn: এই পেজটি `docs/tutorials/04_qgans_for_loading_random_distributions.ipynb`__ থেকে নেয়া হয়েছে।
fr_fr: Cette page a été générée à partir de `docs/tutorials/04_qgans_for_loading_random_distributions.ipynb`__.
hi_in: यह पृष्ठ `docs/tutorials/04_qgans_for_loading_random_distributions.ipynb`__ से उत्पन्न किया गया है।
zh_tw: 此頁面是從 `docs/tutorials/04_qgans_for_loading_random_distributions.ipynb `__ 產生的。

source: qGANs for Loading Random Distributions
bn_bn: দৈব বণ্টন (র‍্যান্ডম ডিস্ট্রিবিউশন) লোড করার জন্য qGANS
de_de: qGANs zum Laden von Zufallsverteilungen
fr_fr: qGANs pour le chargement de distributions aléatoires
hi_in: यादृच्छिक वितरण लोड करने के लिए क्यूगेएन
ml_in: റാൻഡം ഡിസ്ട്രിബൂഷൻ ലോഡുചെയ്യുന്നതിനുള്ള qGAN- കൾ
zh_tw: 使用 qGAN 編寫隨機分佈

source: Given :math:`k`-dimensional data samples, we employ a quantum Generative Adversarial Network (qGAN) to learn the data’s underlying random distribution and to load it directly into a quantum state:
bn_bn: :math:`k` - মাত্রার ডেটা নমুনা (স্যাম্পল) দেয়া থাকলে আমরা ডেটার আড়ালে থাকা দৈব বিতরণ (র‍্যান্ডম ডিস্ট্রিবিউশন) শিক্ষণের জন্য এবং সেটি সরাসরি কোয়ান্টাম মান বা অবস্থায় (স্টেট) লোড করার জন্য একটি কোয়ান্টাম উৎপাদনক্ষম বৈষম্যমূলক নেটওয়ার্ক (জেনারেটিভ অ্যাডভারসারিয়াল নেটওয়ার্ক) নিযুক্ত করতে পারি।
de_de: Für :math:`k`-dimensionale Daten-Samples verwenden wir ein „Quantum Generative Adversarial Network“ (qGAN), um die zufällige Verteilung der Daten zu lernen und sie direkt in einen Quantenzustand zu laden:
fr_fr: A partir des données d'exemple :math:`k`-dimensionnelles, nous utilisons un réseau antagoniste génératif quantique (qGAN) pour apprendre la distribution aléatoire sous-jacente des données et la charger directement dans un état quantique:
hi_in: दिए गए :math:`k`- आयामी डेटा नमूने देखते हुए, हम डेटा के अंतर्निहित यादृच्छिक वितरण को जानने के लिए और इसे सीधे क्वांटम स्थिति में लोड करने के लिए एक क्वांटम जनरेटिव एडवरसरी नेटवर्क (गेएन ) को नियोजित करते हैं:
ml_in: നൽകിയിട്ടുള്ളത് :math:`k`-ഡൈമൻഷണൽ ഡാറ്റ സാമ്പിളുകൾ, ഡാറ്റയുടെ അടിസ്ഥാന റാൻഡം ഡിസ്ട്രിബൂഷനിനെക്കുറിച്ച് മനസിലാക്കുന്നതിനും നേരിട്ട് ഒരു ക്വാണ്ടം അവസ്ഥയിലേക്ക് ലോഡുചെയ്യുന്നതിനും ഞമ്മൾ ഒരു ക്വാണ്ടം ജനറേറ്റീവ് അഡ്വേർസറിയൽ നെറ്റ്‌വർക്ക് (qGAN) ഉപയോഗിക്കുന്നു:
zh_tw: 給定 :math:`k`維度的數據樣本，我們使用quantum Generative Adversarial Network (qGAN) 來學習數據背後的隨機分佈並將其直接加載到量子狀態中。

source: where :math:`p_{\theta}^{j}` describe the occurrence probabilities of the basis states :math:`\big| j\rangle`.
bn_bn: যেখানে :math:`p_{\theta}^{j}` বর্ণনা করে বেসিস বা ভিত্তি মানের (বেসিস স্টেটস) সংঘটন সম্ভাবনা :math:`\big| j\rangle`।
de_de: wobei :math:`p_{\theta}^{j}` die Wahrscheinlichkeit des Vorkommens der Basiszustände :math:`\big| j\rangle` beschreibt.
fr_fr: où :math:`p_{\theta}^{j}` décrit la probabilité de l'occurrence des états de base :math:`\big| j\rangle`.
hi_in: जहां :math:`p_{\theta}^{j}` आधार स्थिति के घटना की संभावनाओं का वर्णन करता है :math:`\big| j\rangle`।
ml_in: ഇവിടെ :math:`p_{\theta}^{j}` അടിസ്ഥാന സംഭവങ്ങളുടെ സാധ്യതകൾ വിവരിക്കുന്നു :math:`\big| j\rangle`.
zh_tw: 其中 :math:`p_{\theta}^{j}`表示基態出現的概率:math:`\big| j\rangle`。

source: The aim of the qGAN training is to generate a state :math:`\big| g_{\theta}\rangle` where :math:`p_{\theta}^{j}`, for :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, describe a probability distribution that is close to the distribution underlying the training data :math:`X=\left\{x^0, \ldots, x^{k-1} \right\}`.
bn_bn: qGAN শিক্ষণের (ট্রেনিং) উদ্দেশ্য হচ্ছে এমন একটি মান বা অবস্থা :math:`\big| g_{\theta}\rangle` তৈরি করা যেখানে :math:`j\in \left\{0, \ldots, {2^n-1} \right\}` এর জন্য :math:`p_{\theta}^{j}` একটি সম্ভাবনার বিতরণ বর্ণনা করে, যা শিক্ষণ (ট্রেনিং) ডেটা :math:`X=\left\{x^0, \ldots, x^{k-1} \right\}` এর বিতরণের কাছাকাছি।
de_de: Das Ziel des qGAN-Trainings ist es, einen Status :math:`\big| g_{\theta}\rangle` zu generieren, in dem :math:`p_{\theta}^{j}` für :math:`j\in \left\{0, \ldots, {2^n-1} \right\}` eine Wahrscheinlichkeitsverteilung beschreibt, die nah an der den Trainingsdaten zugrunde liegenden Verteilung :math:`X=\left\{x^0, \ldots, x^{k-1} \right\}` liegt.
fr_fr: Le but de l'apprentissage qGAN est de générer un état :math:`\big| g_{\theta}\rangle`où :math:`p_{\theta}^{j}`, pour :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, décrit la probabilité de distribution qui est proche de la distribution sous-jacente des données d'apprentissage :math:`X=\left\{x^0, \ldots, x^{k-1} \right\}`.
hi_in: क्यूगेएन प्रशिक्षण का उद्देश्य एक स्थिति उत्पन्न करना है :math:`\big| g_{\theta}\rangle` जहां :math:`p_{\theta}^{j}`, के लिए :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, एक संभाव्यता वितरण का वर्णन करें जो प्रशिक्षण डेटा को अंतर्निहित वितरण के करीब हो :math:`X=\left\{x^0, \ldots, x^{k-1} \right\}`।
ml_in: പരിശീലന ഡാറ്റ :math:`X=\left\{x^0, \ldots, x^{k-1} \right\}` അടിസ്ഥാനമായ വിതരണത്തിന് സമീപമുള്ള പ്രോബബിലിറ്റി ഡിസ്‌ട്രിബ്യൂഷൻ വിവരിക്കുന്ന :math:`p_{\theta}^{j}`, :math:`j\in \left\{0, \ldots, {2^n-1} \right\} യി ഒരു സ്റ്റേറ്റ് :math:`\big| g_{\theta}\rangle` സൃഷ്ടിക്കുക എന്നതാണ് qGAN പരിശീലനത്തിന്റെ ലക്ഷ്യം.
zh_tw: Qgan 學習的目的是生成量子態 :math:`\big| g_{\theta}\rangle`。其中:math:`p_{\theta}^{j}`是:math:`j\in \left\{0, \ldots, {2^n-1} \right\}`描述一個接近訓練數據基礎分佈:math:`X=\left\{x^0, \ldots, x^{k-1} \right\}`的概率分佈

source: For further details please refer to `Quantum Generative Adversarial Networks for Learning and Loading Random Distributions <https://arxiv.org/abs/1904.00043>`__ *Zoufal, Lucchi, Woerner* [2019].
bn_bn: বিস্তারিত জানতে `Quantum Generative Adversarial Networks for Learning and Loading Random Distributions <https://arxiv.org/abs/1904.00043>`__ *Zoufal, Lucchi, Woerner* [2019] দেখুন।
de_de: Weitere Details finden Sie unter `Quantum generative Adversarial Networks for Learning and Loading Random Distributions <https://arxiv.org/abs/1904.00043>`__ *Zoufal, Lucchi, Woerner* [2019].
fr_fr: Pour plus de détails, merci de vous référer à "Réseaux Antagonistes Génératifs Quantique pour l'Apprentissage et le chargement de distribution aléatoire" <https://arxiv.org/abs/1904.00043>`__ *Zoufal, Lucchi, Woerner* [2019].
hi_in: अधिक जानकारी के लिए कृपया `Quantum Generative Adversarial Networks for Learning and Loading Random Distributions <https://arxiv.org/abs/1904.00043>`__ *Zoufal, Lucchi, Woerner* [2019] के उल्लेलख को देखे।
ml_in: കൂടുതൽ വിവരങ്ങൾക്ക് കാണുക `Quantum Generative Adversarial Networks for Learning and Loading Random Distributions <https://arxiv.org/abs/1904.00043>`__ *Zoufal, Lucchi, Woerner* [2019].
zh_tw: 有關更多信息，請參閱`Quantum Generative Adversarial Networks for Learning and Loading Random Distributions <https://arxiv.org/abs/1904.00043>`__ *Zoufal, Lucchi, Woerner* [2019]。

source: For an example of how to use a trained qGAN in an application, the pricing of financial derivatives, please see the `Option Pricing with qGANs <https://github.com/Qiskit/qiskit-finance/tree/main/docs/tutorials/10_qgan_option_pricing.ipynb>`__ tutorial.
bn_bn: একটি প্রশিক্ষিত (ট্রেইনড) qGAN কীভাবে অ্যাপ্লিকেশনে ব্যবহার করতে হয় এবং কীভাবে ফিনানশিয়াল ডেরিভেটিভসের প্রাইসিং ব্যবহার করতে হয় জানার জন্য দয়া করে `Option Pricing with qGANs <https://github.com/Qiskit/qiskit-finance/tree/main/docs/tutorials/10_qgan_option_pricing.ipynb>__ পাঠসমূহ (টিউটোরিয়াল) বা টিউটোরিয়ালসমূহ দেখুন।
de_de: Für ein Beispiel, wie ein trainiertes qGAN in einer Anwendung eingesetzt wird, nämlich die Preisgestaltung von Finanzderivaten, siehe das `Option Pricing with qGANs <https://github.com/Qiskit/qiskit-finance/tree/main/docs/tutorials/10_qgan_option_pricing.ipynb>`__ Tutorial.
fr_fr: Pour un exemple d'utilisation d'un qGAN entraîné pour une application, la tarification des produits financiers dérivés par exemple, veuillez consulter le tutoriel `Tarification des options avec qGANs <https://github.com/Qiskit/qiskit-finance/tree/main/docs/tutorials/10_qgan_option_pricing.ipynb>`__ tutoriel.
hi_in: प्रशिक्षित क्यूगेएन का एप्लीकेशन में प्रयोग का एक उदाहरण, वित्तीय डेरिवेटिव का मूल्य निर्धारण है, देखें 'क्यूगेएन विकल्प प्राजिकीकरण' <https://github.com/Qiskit/qiskit-finance/tree/main/docs/tutorials/10_qgan_option_pricing.ipynb>`__
ml_in: ഒരു അപ്ലിക്കേഷനിൽ പരിശീലനം ലഭിച്ച qGAN എങ്ങനെ ഉപയോഗിക്കാമെന്നതിന്റെ ഉദാഹരണത്തിനായി, സാമ്പത്തിക ഡെറിവേറ്റീവുകളുടെ വിലനിർണ്ണയം, `Option Pricing with qGANs <https://github.com/Qiskit/qiskit-finance/tree/main/docs/tutorials/10_qgan_option_pricing.ipynb>`__ ട്യൂട്ടോറിയൽ കാണുക.
zh_tw: 作為如何在應用程式中使用受過訓練的 qGAN 的例子，金融導數的價格，請參閱`Option Pricing with qGANs <https://github.com/Qiskit/qiskit-finance/tree/main/docs/tutorials/10_qgan_option_pricing.ipynb>`__教程。

source: Load the Training Data
bn_bn: শিক্ষণ (ট্রেনিং) ডেটা লোড করুন
de_de: Trainingsdaten laden
fr_fr: Chargement des données d'apprentissage
hi_in: प्रशिक्षण डेटा लोड करें
ml_in: പരിശീലന ഡാറ്റ ലോഡുചെയ്യുക
zh_tw: 載入訓練數據

source: First, we need to load the :math:`k`-dimensional training data samples (here k=1).
bn_bn: প্রথমত, আমাদের :math:`k`-মাত্রিক (ডাইমেনশনাল) শিক্ষণ (ট্রেনিং) ডেটা নমুনা (স্যাম্পল) লোড করতে হবে (এখানে k=1)।
de_de: Zuerst müssen wir die :math:`k`-dimensionale Trainingsdaten-Samples laden (hier ist k=1).
fr_fr: Premièrement, nous devons charger les échantillons de données d'apprentissage de dimension :math:"k" (ici k= 1).
hi_in: सबसे पहले हमे :math:`k`-आयामी प्रशिक्षण डेटा नमूनों (यहाँ k =1 )को लोड करना पड़ेगा .
ml_in: ആദ്യം, ഞമ്മൾ :math:`k`- ഡൈമൻഷണൽ പരിശീലന ഡാറ്റ സാമ്പിളുകൾ ലോഡുചെയ്യേണ്ടതുണ്ട് (ഇവിടെ k = 1).
zh_tw: 首先，我們需要載入 :math:`k' 維訓練數據樣本（這裡 k=1）。

source: Next, the data resolution is set, i.e. the min/max data values and the number of qubits used to represent each data dimension.
bn_bn: তারপর, ডেটা রেজোল্যুশন ঠিক করা হলো। অর্থাৎ, প্রত্যেক ডেটার মাত্রা (ডাইমেনশন) প্রকাশের জন্য min/max ডেটা মান এবং কিউবিট সংখ্যা ব্যবহার করা হয়েছে।
de_de: Als nächstes wird die Datenauflösung eingestellt, d.h. die min/max-Werte der Daten und die Anzahl der Qubits, die zur Darstellung jeder Datendimension verwendet werden.
fr_fr: Ensuite, la résolution des données est définie, c'est-à-dire les valeurs de données min/max et le nombre de qubits utilisés pour représenter chaque dimension de données.
hi_in: इसके, बाद हम डाटा रेसोलुशन अर्थात न्यूनतम/अधिकतम डेटा मान और क्यूबिट की संख्या सेट करते है जो कि प्रत्येक डेटा के आयाम का प्रतिनिधित्व करने के लिए इस्तेमाल किया जाता है.
ml_in: അടുത്തതായി, ഡാറ്റ റിസൊലൂഷൻ സജ്ജമാക്കുന്നു, അതായത് മിനിമം / പരമാവധി ഡാറ്റ മൂല്യങ്ങൾ, ഒപ്പം ഓരോ ഡാറ്റ അളവിനെയും പ്രതിനിധീകരിക്കുന്നതിന് ഉപയോഗിക്കുന്ന ക്യൂബിറ്റുകളുടെ എണ്ണവും.
zh_tw: 接下來，設置數據解析，即最小和最大數據值，以及用於表示每個數據維度的量子位元。

source: Initialize the qGAN
bn_bn: qGAN প্রারম্ভ করুন
de_de: Initialisierung des qGAN
fr_fr: Initialiser le qGAN
hi_in: क्यूगेएन का आरम्भीकरण
ml_in: qGAN സമാരംഭിക്കുക
zh_tw: Qgan 初始化

source: The qGAN consists of a quantum generator :math:`G_{\theta}`, i.e., an ansatz, and a classical discriminator :math:`D_{\phi}`, a neural network.
bn_bn: qGAN-এ রয়েছে একটি কোয়ান্টাম জেনারেটর :math:`G_{\theta}`, অর্থাৎ , একটি অন্সাৎজ(Ansartz) এবং একটি প্রথাগত (ক্লাসিক্যাল) বৈষম্যকারী(discriminator) :math:`D_{\phi}`, একটি নিউরাল নেটওয়ার্ক ধারণ করে।
de_de: Die qGAN besteht aus einem Quantengenerator :math:`G_ {\theta}`, also einem Ansatz und einem klassischen Diskriminator :math:`D_ {\phi}`, einem neuronalen Netz.
fr_fr: Le qGAN consiste en un générateur quantique :math:`G_ {\theta}`, c'est-à-dire, un circuit quantique variationnel, et un discriminateur classique :math:`D_ { \phi }` implémenté grâce à un réseau neuronal.
hi_in: क्यूगेएन में क्वांटम जनरेटर :math:`G_{\theta}` ,अर्थात एक अंसात्ज़ और शास्त्रीय डिस्क्रिमिनटोर :math:`D_{\phi}`, एक न्यूरलनेटवर्क होते है।
ml_in: qGANൽ ഒരു ക്വാണ്ടം ജനറേറ്റർ :math:`G_{\theta}` , അതായത്, ഒരു അൻസാറ്റ്സും, ഒരു ക്ലാസിക്കൽ ഡിസ്ക്രിമിനേറ്റർ :math:`D_{\phi}` :, ഒരു ന്യൂറൽ നെറ്റ്‌വർക്കും ഉൾക്കൊള്ളുന്നു.
zh_tw: Qgan 由一個量子生成器 :math:`G_{\theta}`，即所謂的擬設，和一個神經網絡古典分類器:math:`D_{\phi}`。

source: To implement the quantum generator, we choose a depth-\ :math:`1` ansatz that implements :math:`R_Y` rotations and :math:`CZ` gates which takes a uniform distribution as an input state. Notably, for :math:`k>1` the generator’s parameters must be chosen carefully. For example, the circuit depth should be :math:`>1` because higher circuit depths enable the representation of more complex structures.
bn_bn: কোয়ান্টাম জেনারেটর বাস্তবায়নের জন্য আমরা \ :math:`1` গভীরতার ansatz (অন্সাৎজ) বেছে নিয়েছি যা :math:`R_Y` ঘূর্ণন এবং :math:`CZ` যুক্তিবর্তনী (গেইট) বাস্তবায়ন করে যা একটি একরূপ বিতরণকে (ইউনিফর্ম ডিস্ট্রিবিউশন) ইনপুট অবস্থা (স্টেট) হিসাবে নেয়। লক্ষ্যণীয় যে, :math:`k>1` এর জন্য জেনারেটরের পরামিতি (প্যারামিটার) খুব সতর্কতার সাথে নির্ধারণ করতে হবে। উদাহরন সরূপ, বর্তনীর (সার্কিট) গভীরতা :math:`>1` হতে হবে কারণ বেশি গভীরতার বর্তনী (সার্কিট) জটিল অবয়বকে সক্ষম করে তোলে।
de_de: Um den Quantengenerator zu implementieren, wählen wir einen Ansatz der Tiefe\ :math:`1`, welcher die :math:`R_Y`-Rotationen und :math:`CZ`-Gatter implementiert, die eine einheitliche Verteilung als Eingabezustand verwenden. Für :math:`k>1` müssen die Parameter des Generators sorgfältig ausgewählt werden. Zum Beispiel sollte die Schaltungstiefe :math:`>1` sein, da höhere Schaltungstiefen die Darstellung komplexerer Strukturen ermöglichen.
fr_fr: Pour implémenter le générateur quantique, nous choisissons une forme variationnelle de profondeur-\ :math:`1` qui utilise des rotations :math:`R_Y` et des portes :math:`CZ` et qui prend une distribution uniforme en tant qu'état d'entrée. Notamment, pour :math:`k>1`, les paramètres du générateur doivent être choisis avec soin. Par exemple, la profondeur du circuit doit être :math:`>1` car des profondeurs de circuit plus élevées permettent la représentation de structures plus complexes.
hi_in: क्वांटम जनरेटर को लागू करने के लिए, हम एक गहराई-\ :math:`1` ansatz चुनते हैं जो :math:`R_Y` घुमावों को लागू करता है और :math:`CZ` गेट जो एक इनपुट स्थिति के रूप में एक समान वितरण लेता है। विशेष रूप से, :math:`k>1` जनरेटर के मापदंडों को सावधानी से चुना जाना चाहिए। उदाहरण के लिए, सर्किट की गहराई होनी चाहिए :math:`>1` क्योंकि उच्च सर्किट गहराई अधिक जटिल संरचनाओं के प्रतिनिधित्व को सक्षम करती है।
ml_in: ക്വാണ്ടം ജനറേറ്റർ നടപ്പിലാക്കാൻ, :math:`R_Y` റൊട്ടേഷനുകളും :math:`CZ` ഗേറ്റുകളും നടപ്പിലാക്കുന്ന ഒരു ഡെപ്ത്-\ :math:`1` അൻസാറ്റ്സ് ഞമ്മൾ തിരഞ്ഞെടുക്കുന്നു, അത് ഇൻപുട്ട് സ്റ്റേറ്റായി യൂണിഫോം ഡിസ്ട്രിബൂഷൻ എടുക്കുന്നു. ശ്രദ്ധേയമായി, ഇതിനായി :math:`k>1` ജനറേറ്ററിന്റെ പാരാമീറ്ററുകൾ ശ്രദ്ധാപൂർവ്വം തിരഞ്ഞെടുക്കണം. ഉദാഹരണത്തിന്, സർക്യൂട്ട് ഡെപ്ത് ഇതായിരിക്കണം :math:`>1` കാരണം ഉയർന്ന സർക്യൂട്ട് ഡെപ്ത് കൂടുതൽ സങ്കീർണ്ണമായ ഘടനകളുടെ പ്രാതിനിധ്യം പ്രാപ്തമാക്കുന്നു.
zh_tw: 為了實作量子生成器，我們使用深度-\ :math:`1`的擬設，包含一個 :math:`R_Y` 旋轉和一個:math:`CZ`閘，以均勻分佈作為輸入。值得注意的是，必須仔細選擇生成器參數，例如:電路深度為 :math:`>1`，因為電路越深，能夠表示的結構越複雜。

source: The classical discriminator used here is based on a neural network implementation using NumPy. There is also a discriminator based on PyTorch which is not installed by default when installing Qiskit - see `Optional Install <https://github.com/Qiskit/qiskit-machine-learning#optional-installs>`__ for more information.
bn_bn: এখানে যে ক্লাসিক্যাল ডিসক্রিমিনেটর ব্যবহার করা হয়েছে তা আসলে NumPy এর মাধ্যমে তৈরি একটি নিউরাল নেটওয়ার্কের ইমপ্লিমেন্টেশনের উপর ভিত্তি করে দাঁড়িয়ে আছে। PyTorch ভিত্তিক একটি ডিসক্রিমিনেটরও রয়েছে যেটি Qiskit ইন্সটলের সময় নিজে থেকে ইন্সটল হয়না। আরো তথ্যের জন্য `Optional Install <https://github.com/Qiskit/qiskit-aqua#optional-installs>`__ দেখুন।
de_de: Der hier verwendete klassische Diskriminator basiert auf der Implementierung eines neuronalen Netzwerks mit NumPy. Es gibt auch einen Diskriminator basierend auf PyTorch, welcher standardmäßig nicht mit Qiskit installiert wird - siehe `Optionale Installation <https://github.com/Qiskit/qiskit-machine-learning#optional-installs>`__ für weitere Informationen.
fr_fr: Le discriminateur classique utilisé ici est basé sur une implémentation de réseau neuronal à l'aide de NumPy. Il existe également un discriminateur basé sur PyTorch qui n'est pas installé par défaut lors de l'installation de Qiskit - voir `Installation en option <https://github.com/Qiskit/qiskit-aqua#optional-installs>`__ pour plus d'informations.
hi_in: यहां इस्तेमाल किया जाने वाला शास्त्रीय विवेचक NumPy का उपयोग करते हुए एक तंत्रिका नेटवर्क कार्यान्वयन पर आधारित है। PyTorch पर आधारित एक विभेदक भी है जो Qiskit को स्थापित करते समय डिफ़ॉल्ट रूप से स्थापित नहीं होता है - अधिक जानकारी के लिए `वैकल्पिक इंस्टॉल <https://github.com/Qiskit/qiskit-machine-learning#Optional-installs>`__ देखें।
ml_in: ഇവിടെ ഉപയോഗിക്കുന്ന ക്ലാസിക്കൽ ഡിസ്ക്രിമിനേറ്റർ NumPy ഉപയോഗിച്ചുള്ള ഒരു ന്യൂറൽ നെറ്റ്‌വർക്ക് നടപ്പിലാക്കലിനെ അടിസ്ഥാനമാക്കിയുള്ളതാണ്. ക്വിസ്കിറ്റ് ഇൻസ്റ്റാൾ ചെയ്യുമ്പോൾ സ്ഥിരസ്ഥിതിയായി ഇൻസ്റ്റാൾ ചെയ്യാത്ത PyTorchനെ അടിസ്ഥാനമാക്കിയുള്ള ഒരു ഡിസ്ക്രിമിനേറ്ററുമുണ്ട് - കൂടുതൽ വിവരങ്ങൾക്ക് `Optional Install <https://github.com/Qiskit/qiskit-machine-learning#optional-installs>`__ കാണുക.
zh_tw: 這裡使用的經典分類器基於 NumPy 的神經網絡實作。還有一些基於 PyTorch 的分類器，當你未依預設安裝Qiskit。有關更多信息，請參閱 `Optional Install <https://github.com/Qiskit/qiskit-machine-learning#optional-installs>`。

source: Here, both networks are updated with the ADAM optimization algorithm (ADAM is qGAN optimizer default).
bn_bn: এখানে, উভয় নেটওয়ার্কই ADAM অনুকূলকরণ (অপটিমাইজার) ধারাক্রম (অ্যালগোরিদম) দ্বারা হালনাগাদ (ADAM হচ্ছে qGAN অনুকূলায়ক ডিফল্ট) করা হয়েছে।
de_de: Hier werden beide Netzwerke mit dem ADAM-Optimierungsalgorithmus aktualisiert. (ADAM ist der qGAN-Optimierer-Standard.)
fr_fr: Ici, les deux réseaux sont mis à jour avec l'algorithme d'optimisation ADAM (ADAM est la valeur par défaut de l'optimiseur qGAN).
hi_in: यहां, दोनों नेटवर्क को ADAM ऑप्टिमाइज़ेशन एल्गोरिथम के साथ अपडेट किया गया है (ADAM qGAN ऑप्टिमाइज़र डिफ़ॉल्ट है)।
ml_in: ഇവിടെ, രണ്ട് നെറ്റ്‌വർക്കുകളും ADAM ഒപ്റ്റിമൈസേഷൻ അൽഗോരിതം ഉപയോഗിച്ച് അപ്‌ഡേറ്റുചെയ്‌തതാണ് (ADAM qGANൻ്റെ ഒപ്റ്റിമൈസർ സ്ഥിരസ്ഥിതിയാണ്).
zh_tw: 在這裡，兩個網絡都由 ADAM 最佳化演算法更新（ADAM 是 qGAN 的預設優化器）。

source: Run the qGAN Training
bn_bn: কিউজিএএন (qGAN) শিক্ষণ (ট্রেনিং) চালান
de_de: Ausführung des qGAN-Trainings
fr_fr: Exécuter la formation qGAN
hi_in: qGAN प्रशिक्षण चलाएं
ml_in: qGAN പരിശീലനം പ്രവർത്തിപ്പിക്കുക
zh_tw: 執行 qGAN 訓練

source: During the training the discriminator’s and the generator’s parameters are updated alternately w.r.t the following loss functions:
bn_bn: শিক্ষণের (ট্রেনিং) সময় ডিসক্রিমিনেটর এবং জেনারেটরের পরামিতি (প্যারামিটার) লস ফাংশনের সাথে সামঞ্জস্য রেখে হালনাগাদ করা হয়।
de_de: Während des Trainings werden die Parameter des Diskriminators und des Generators abwechselnd bezüglich der Verlustfunktion aktualisiert:
fr_fr: Pendant la formation, les paramètres du discriminateur et du générateur sont mis à jour alternativement avec les fonctions coût suivantes:
hi_in: प्रशिक्षण के दौरान विवेक और जेनेरेटर के मापदंड वैकल्पिक रूप से अद्यतन किए जाते हैं:
ml_in: പരിശീലന സമയത്ത് ഡിസ്ക്രിമിനേറ്ററുടെയും ജനറേറ്ററിന്റെയും പാരാമീറ്ററുകൾ ഇനിപ്പറയുന്ന ലോസ് ഫംഗ്ഷനുമായി ബന്ധപ്പെട്ട് മാറിമാറി അപ്‌ഡേറ്റുചെയ്യുന്നു:
zh_tw: 在訓練中，分類器和生成器參數根據以下損失函數交替更新：

source: and
bn_bn: এবং
de_de: und
fr_fr: et
hi_in: और
ml_in: കൂടാതെ
zh_tw: 和

source: with :math:`m` denoting the batch size and :math:`g^l` describing the data samples generated by the quantum generator.
bn_bn: :math:`m` ব্যাচের আকার এবং :math:`g^l` কোয়ান্টাম জেনারেটরে উৎপন্ন ডেটা নমুনা (স্যাম্পল) বর্ণনা করে।
de_de: wobei :math:`m` für die Batch-Größe und :math:`g^l` für die vom Quantengenerator generierten Daten-Samples steht.
fr_fr: avec :math:`m` dénotant la taille du lot et :math:`g^l` décrivant les échantillons de données générés par le générateur quantique.
hi_in: साथ :math:`m` बैच आकार को दर्शाता है और :math:`g^l` क्वांटम जनरेटर द्वारा उत्पन्न डेटा नमूनों का वर्णन करता है।
ml_in: :math:`m` ബാച്ച് വലുപ്പത്തെ സൂചിപ്പിക്കുകയും ക്വാണ്ടം ജനറേറ്റർ ജനറേറ്റുചെയ്‌ത ഡാറ്റ സാമ്പിളുകൾ വിവരിക്കുന്ന :math:`g^l` ഉപയോഗിച്ച്.
zh_tw: 其中 :math:`m`表示批量大小，而 :math:`g^l` 表示由量子生成器生成的數據樣本。

source: Please note that the training, for the purpose of this notebook, has been kept briefer by the selection of a known initial point (``init_params``). Without such prior knowledge be aware training may take some while.
bn_bn: দয়া করে নোট করুন যে এই নোটবুকের উদ্দেশ্যে প্রশিক্ষণটি একটি পরিচিত প্রাথমিক পয়েন্ট (`` init_params``) নির্বাচন করে সংক্ষিপ্ত রাখা হয়েছে। এই ব্যাপারে সচেতন থাকা দরকার যে , এই ধরনের পূর্ব জ্ঞান ছাড়া প্রশিক্ষণের কিছুটা সময় নিতে পারে।
de_de: Bitte beachten Sie, dass das Training in diesem Notebook durch die Auswahl eines bekannten Ausgangsspunkts (``init_params``) verkürzt wurde. Ohne ein solches Vorwissen kann das Training einige Zeit dauern.
fr_fr: Veuillez noter que la formation, aux fins de ce notebook, a été raccourcie par la sélection d'un point initial connu (``init_params``). Sans ces connaissances préalables, l'entraînement peut prendre un certain temps.
hi_in: कृपया ध्यान दें कि इस नोटबुक के प्रयोजन के लिए प्रशिक्षण को एक ज्ञात प्रारंभिक बिंदु (``init_params``) के चयन द्वारा संक्षिप्त रखा गया है। इस तरह के पूर्व ज्ञान के बिना जागरूक रहें प्रशिक्षण में कुछ समय लग सकता है।
ml_in: അറിയപ്പെടുന്ന ഒരു പ്രാരംഭ പോയിന്റ് (`` init_params``) തിരഞ്ഞെടുക്കുന്നതിലൂടെ ഈ നോട്ട്ബുക്കിന്റെ ഉദ്ദേശ്യത്തിനായി പരിശീലനം സൂക്ഷ്മമായി സൂക്ഷിച്ചിരിക്കുന്നു. അത്തരം മുൻ‌ അറിവില്ലാത്ത വർ അറിഞ്ഞിരിക്കുക, പരിശീലനം കുറച്ച് സമയമെടുക്കും.
zh_tw: 請注意，為了筆記本的目的，藉由指定已知初始點（``init_params``）保持簡短。如果沒有這些先備知識，訓練可能需要一些時間。

source: Training Progress & Outcome
bn_bn: শিক্ষণ (ট্রেনিং) উন্নতি এবং ফলাফল
de_de: Trainingsfortschritt & Ergebnisse
fr_fr: Progrès & Résultats de la formation
hi_in: प्रशिक्षण प्रगति और परिणाम
ml_in: പരിശീലന പുരോഗതിയും ഫലവും
zh_tw: 訓練進度與成果

source: Now, we plot the evolution of the generator’s and the discriminator’s loss functions during the training, as well as the progress in the relative entropy between the trained and the target distribution.
bn_bn: এখন আমরা শিক্ষণের সময় (ট্রেনিং) জেনারেটরের বিবর্তন এবং ডিসক্রিমিনেটরের লস ফাংশন লেখচিত্র অঙ্কন করব। একই সাথে ট্রেইনড এবং লক্ষ্য বিতরণের আপেক্ষিক বিশৃঙ্খলাও (এনট্রপি) লেখচিত্র হিসেবে অঙ্কন করব।
de_de: Nun plotten wir die Evolution des Generators und die Verlustfunktionen des Diskriminators während des Trainings. sowie den Fortschritt der relativen Entropie zwischen der trainierten und der Zielverteilung.
fr_fr: Maintenant, nous traçons l'évolution des fonctions de coût du générateur et du discriminateur pendant la formation, ainsi que les progrès de l'entropie relative entre la distribution formée et la distribution cible.
hi_in: अब, हम प्रशिक्षण के दौरान जनरेटर के विकास और विवेचक के नुकसान कार्यों के साथ-साथ प्रशिक्षित और लक्ष्य वितरण के बीच सापेक्ष एन्ट्रापी में प्रगति की साजिश रचते हैं।
ml_in: ഇപ്പോൾ, പരിശീലന സമയത്ത് ജനറേറ്ററിന്റെ പരിണാമവും ഡിസ്ക്രിമിനേറ്ററുടെ ലോസ്സ് ഫംഗ്ഷനും, അതുപോലെ തന്നെ പരിശീലനം നേടിയതും ടാർഗെറ്റ് ചെയ്ത ഡിസ്ട്രിബൂഷനും തമ്മിലുള്ള എൻട്രോപ്പിയിലെ(relative entropy) പുരോഗതിയും, ഞമ്മൾ പ്ലോട്ട് ചെയ്യുന്നു.
zh_tw: 接下來，我們繪製訓練中生成器和判別器的損失函數的轉移，以及訓練分佈和目標分佈之間的相對熵的轉移。

source: Finally, we also compare the cumulative distribution function (CDF) of the trained distribution to the CDF of the target distribution.
bn_bn: শেষপর্যন্ত, আমরা প্রশিক্ষিত (ট্রেইনড) বিতরণের ক্রমবর্ধমান (কিউম্যুলেটিভ) বিতরণ ফাংশন (সিডিএফ) লক্ষ্য বিতরণের সিডিএফের সাথে তুলনা করব।
de_de: Schließlich vergleichen wir auch die kumulierte Verteilungsfunktion (CDF) der trainierten Verteilung mit der CDF der Zielverteilung.
fr_fr: Enfin, nous comparons également la fonction de distribution cumulative (CDF) de la distribution entraînée au CDF de la distribution cible.
hi_in: अंत में, हम प्रशिक्षित वितरण के संचयी वितरण फ़ंक्शन (सीडीएफ) की तुलना लक्ष्य वितरण के सीडीएफ से भी करते हैं।
ml_in: അവസാനമായി, പരിശീലനം ലഭിച്ച വിതരണത്തിന്റെ ക്യുമുലേറ്റീവ് ഡിസ്ട്രിബ്യൂഷൻ ഫംഗ്ഷനും (CDF) ടാർഗെറ്റ് ഡിസ്ട്രിബ്യൂഷന്റെ സിഡിഎഫുമായി താരതമ്യം ചെയ്യുന്നു.
zh_tw: 最後，我們還將訓練分佈的累積分佈函數 (CDF) 與目標分佈的 CDF 進行比較。
