Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/04_torch_qgan.po
Languages: es_un, ja

source: This page was generated from `docs/tutorials/04_torch_qgan.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/04_torch_qgan.ipynb`__.
ja: このページは `docs/tutorials/04_torch_qgan.ipynb`__ から生成されました。

source: PyTorch qGAN Implementation
es_un: Implementación de PyTorch qGAN
ja: PyTorchによるqGANの実装

source: Overview
es_un: Descripción General
ja: 概要

source: This tutorial introduces step-by-step how to build a PyTorch-based Quantum Generative Adversarial Network algorithm.
es_un: Este tutorial presenta paso a paso cómo construir un algoritmo de Red de Adversarios Generativos Cuántica basado en PyTorch.
ja: このチュートリアルでは、PyTorchベースの量子敵対的生成ネットワークのアルゴリズムを構築する方法をステップバイステップで紹介します。

source: Context
es_un: Contexto
ja: 説明

source: The qGAN [1] is a hybrid quantum-classical algorithm used for generative modeling tasks. The algorithm uses the interplay of a quantum generator :math:`G_{\theta}`, i.e., an ansatz, and a classical discriminator :math:`D_{\phi}`, a neural network, to learn the underlying probability distribution given training data.
es_un: El qGAN [1] es un algoritmo híbrido cuántico-clásico utilizado para tareas de modelado generativo. El algoritmo utiliza la interacción de un generador cuántico :math:`G_{\theta}`, es decir, un ansatz, y un discriminador clásico :math:`D_{\phi}`, una red neuronal, para aprender la distribución de probabilidad subyacente dados los datos de entrenamiento.
ja: QGAN [1]は、生成的なモデリングを行うために使用されるハイブリッド量子古典アルゴリズムです。このアルゴリズムでは、量子生成器 :math:`G_{theta}` (ansatz) と古典識別器 :math:`D_{phi}` (ニューラルネットワーク) の相互作用により、学習データから基本的な確率分布の学習を行います。

source: The generator and discriminator are trained in alternating optimization steps, where the generator aims at generating samples that will be classified by the discriminator as training data samples (i.e, samples extracted from the real training distribution), and the discriminator tries to differentiate between original training data samples and data samples from the generator (in other words, telling apart the real and generated distributions). The final goal is for the quantum generator to learn a representation for the training data’s underlying probability distribution. The trained quantum generator can, thus, be used to load a quantum state which is an approximate model of the target distribution.
es_un: El generador y el discriminador se entrenan en pasos de optimización alternantes, donde el generador apunta a generar muestras que serán clasificadas por el discriminador como muestras de datos de entrenamiento (es decir, muestras extraídas de la distribución de entrenamiento real), y el discriminador trata de diferenciar entre muestras de datos del entrenamiento original y muestras de datos del generador (en otras palabras, distinguir las distribuciones reales y generadas). El objetivo final es que el generador cuántico aprenda una representación de la distribución de probabilidad subyacente de los datos de entrenamiento. El generador cuántico entrenado puede, por lo tanto, usarse para cargar un estado cuántico que es un modelo aproximado de la distribución objetivo.
ja: 生成器と識別器は交互に最適化され、生成器は識別器が学習データのサンプルとして分類するサンプル（実際の学習分布から抽出したサンプル）の生成を目指し、識別器は元の学習データサンプルと生成器のデータサンプルを区別する（つまり、実際の分布と生成した分布を区別する）ことを目指します。最終的な目標は、量子生成器が学習データの確率分布の表現を学習することです。この学習により、量子生成器は、学習データの確率分布を近似的に表現した量子状態を読み込むことができるようになります。

source: **References:**
es_un: **Referencias:**
ja: **参考文献: **

source: Application: qGANs for Loading Random Distributions
es_un: Aplicación: qGANs para Cargar Distribuciones Aleatorias
ja: 応用例：qGANによるランダム分布の読み込み

source: Given :math:`k`-dimensional data samples, we employ a quantum Generative Adversarial Network (qGAN) to learn the data’s underlying random distribution and to load it directly into a quantum state:
es_un: Dadas las muestras de datos :math:`k`-dimensionales, empleamos una Red de Adversarios Generativos cuántica (quantum Generative Adversarial Network, qGAN) para conocer la distribución aleatoria subyacente de los datos y cargarlos directamente en un estado cuántico:
ja: :math:`k` 次元のデータサンプルが与えられた場合、量子敵対的生成ネットワーク(qGAN) を使用して、データの基礎となるランダム分布を学習し、それを量子状態に直接ロードします。

source: where :math:`p_{\theta}^{j}` describe the occurrence probabilities of the basis states :math:`\big| j\rangle`.
es_un: donde :math:`p_{\theta}^{j}` describen las probabilidades de ocurrencia de los estados base :math:`\big| j\rangle`.
ja: ここで :math:`p_{\theta}^{j}` は、基底状態 :math:`\big| j\rangle` の発生確率を表します。

source: The aim of the qGAN training is to generate a state :math:`\big| g_{\theta}\rangle` where :math:`p_{\theta}^{j}`, for :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, describe a probability distribution that is close to the distribution underlying the training data :math:`X=\left\{x^0, \ldots, x^{k-1} \right\}`.
es_un: El objetivo del entrenamiento qGAN es generar un estado :math:`\big| g_{\theta}\rangle` donde :math:`p_{\theta}^{j}`, para :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, describe una distribución de probabilidad cercana a la distribución subyacente a los datos de entrenamiento :math:`X=\left\{x^0, \ldots, x^{k-1} \right\}`.
ja: qGAN学習の目的は、状態 :math:`\big| g_{\theta}\rangle` を生成することです。ここで、 :math:`p_{\theta}^{j}` は、 :math:`j\in \left\{0, \ldots, {2^n-1} \right\}` の場合、 学習データ :math:`X=\left\{x^0, \ldots, x^{k-1} \right\}` の基礎となる分布に近い確率分布を表します。

source: For further details please refer to `Quantum Generative Adversarial Networks for Learning and Loading Random Distributions <https://arxiv.org/abs/1904.00043>`__ *Zoufal, Lucchi, Woerner* [2019].
es_un: Para obtener más detalles, consulta `Quantum Generative Adversarial Networks for Learning and Loading Random Distributions <https://arxiv.org/abs/1904.00043>`__ *Zoufal, Lucchi, Woerner* [2019].
ja: 詳細については、 `Quantum Generative Adversarial Networks for Learning and Loading Random Distributions <https://arxiv.org/abs/1904.00043>`__ *Zoufal, Lucchi, Woerner* [2019] を参照してください。

source: For an example of how to use a trained qGAN in an application, the pricing of financial derivatives, please see the `Option Pricing with qGANs <https://github.com/Qiskit/qiskit-finance/tree/main/docs/tutorials/10_qgan_option_pricing.ipynb>`__ tutorial.
es_un: Para un ejemplo de cómo utilizar una qGAN entrenada en una aplicación, la fijación de precios de derivados financieros, consulta el tutorial `Fijación de Precios de Opciones con qGANs <https://github.com/Qiskit/qiskit-finance/tree/main/docs/tutorials/10_qgan_option_pricing.ipynb>`__.
ja: 学習済みの qGAN の実用例として、金融デリバティブの価格設定については、チュートリアルの `qGANs によるオプション価格推定 <https://github.com/Qiskit/qiskit-finance/tree/main/docs/tutorials/10_qgan_option_pricing.ipynb>`__ を参照してください。

source: Tutorial
ja: チュートリアル

source: Data and Representation
es_un: Datos y Representación
ja: データと表現

source: First, we need to load our training data :math:`X`.
es_un: Primero, necesitamos cargar nuestros datos de entrenamiento :math:`X`.
ja: まず、学習データ :math:`X` をロードする必要があります。

source: In this tutorial, the training data is given by samples from a 2D multivariate normal distribution.
es_un: En este tutorial, los datos de entrenamiento están dados por muestras de una distribución normal multivariante 2D.
ja: このチュートリアルでは、学習データは2次元多変量正規分布からのサンプルで与えられます。

source: The goal of the generator is to learn how to represent such distribution, and the trained generator should correspond to an :math:`n`-qubit quantum state :nbsphinx-math:`\begin{equation} |g_{\text{trained}}\rangle=\sum\limits_{j=0}^{k-1}\sqrt{p_{j}}|x_{j}\rangle, \end{equation}` where the basis states :math:`|x_{j}\rangle` represent the data items in the training data set :math:`X={x_0, \ldots, x_{k-1}}` with :math:`k\leq 2^n` and :math:`p_j` refers to the sampling probability of :math:`|x_{j}\rangle`.
es_un: El objetivo del generador es aprender a representar dicha distribución, y el generador entrenado debe corresponder a un estado cuántico de :math:`n` qubits :nbsphinx-math:`\begin{equation} |g_{\text{trained}}\rangle=\sum\limits_{j=0}^{k-1}\sqrt{p_{j}}|x_{j}\rangle, \end{equation}` donde el estado base :math:`|x_{j}\rangle` representa los elementos de datos en el conjunto de datos de entrenamiento :math:`X={x_0, \ldots, x_{k-1}}` con :math:`k\leq 2^n` y :math:`p_j` se refiere a la probabilidad de muestreo de :math:`|x_{j}\rangle`.
ja: 生成器の目標は、そのような分布を表す方法を学習することであり、トレーニングされた生成器は :math:`n`-qubit 量子状態に対応する必要があります :nbsphinx-math:`\begin{equation} |g_{\text{trained }}\rangle=\sum\limits_{j=0}^{k-1}\sqrt{p_{j}}|x_{j}\rangle, \end{equation}` ここで、基底状態 :math:`|x_{j}\rangle` はトレーニング データ セット内のデータ項目を表します :math:`X={x_0, \ldots, x_{k-1}}` with :math:` k\leq 2^n` と :math:`p_j` は :math:`|x_{j}\rangle` のサンプリング確率を指します。

source: To facilitate this representation, we need to map the samples from the multivariate normal distribution to discrete values. The number of values that can be represented depends on the number of qubits used for the mapping. Hence, the data resolution is defined by the number of qubits. If we use :math:`3` qubits to represent one feature, we have :math:`2^3 = 8` discrete values.
es_un: Para facilitar esta representación, necesitamos mapear las muestras de la distribución normal multivariante a valores discretos. La cantidad de valores que se pueden representar depende de la cantidad de qubits utilizados para el mapeo. Por lo tanto, la resolución de datos se define por el número de qubits. Si usamos :math:`3` qubits para representar una característica, tenemos :math:`2^3 = 8` valores discretos.
ja: この表現を容易にするために、多変量正規分布からのサンプルを離散的な値にマッピングする必要があります。表現できる値の数はマッピングに使用する量子ビットの数に依存します。したがって、データの分解能は量子ビットの数によって定義されます。math:`3` 個の量子ビットを使って 1 つの特徴を表現すると、 :math:`2^3 = 8` 個の離散値を持つことになります。

source: We first begin by fixing seeds in the random number generators, then we will import the libraries and packages we will need for this tutorial.
es_un: Primero comenzamos fijando semillas en los generadores de números aleatorios, luego importaremos las bibliotecas y los paquetes que necesitaremos para este tutorial.
ja: まず、乱数発生器のシードを固定することから始め、このチュートリアルで必要なライブラリーやパッケージをインポートします。

source: Then, we sample some data from a 2D multivariate normal distribution as described above.
es_un: Luego, muestreamos algunos datos de una distribución normal multivariante 2D como se describe anteriormente.
ja: 次に、上述したように2次元の多変量正規分布からいくつかのデータをサンプリングします。

source: Let’s visualize our distribution and samples. The ``discretize_and_truncate`` function discretized the classical data we got from the multivariate normal so, a plot of the probability density function looks very coarse. But it is still a bell-shaped bivariate normal distribution.
es_un: Visualicemos nuestra distribución y muestras. La función ``discretize_and_truncate`` discretizó los datos clásicos que obtuvimos de la normal multivariada, por lo que una gráfica de la función de densidad de probabilidad parece muy tosca. Pero sigue siendo una distribución normal bivariada en forma de campana.
ja: 分布とサンプルを可視化しましょう。離散化関数 ``discretize_and_truncate`` は、多変量正規分布から得られた古典的なデータを離散化するので、確率密度関数のプロットは非常に粗く見えます。しかし、それはベル型の2変量正規分布のままです。

source: On the next figure we prove that the training data was discretized. We passed data resolution as an array ``[3, 3]``, This array defined the number of qubits used to represent each data dimension. Thus, we can define :math:`2^3 = 8` discrete values and all training samples should fall under one of these discrete values. On the next figure there is a histogram for each random variable and to see actual discretization we increased the number of bins. Some of the bins are empty and there are 8 non-empty bins for each variable.
es_un: En la siguiente figura demostramos que los datos de entrenamiento fueron discretizados. Pasamos la resolución de datos como un arreglo de ``[3, 3]``. Este arreglo definió la cantidad de qubits utilizados para representar cada dimensión de datos. Por lo tanto, podemos definir :math:`2^3 = 8` valores discretos y todas las muestras de entrenamiento deben caer bajo uno de estos valores discretos. En la siguiente figura hay un histograma para cada variable aleatoria y para ver la discretización real aumentamos el número de contenedores (bins). Algunos de los contenedores están vacíos y hay 8 contenedores no vacíos para cada variable.
ja: 次の図では、学習データが離散化されていることを証明しています。データの分解能は配列 ``[3, 3]`` として渡され、この配列は各データ次元を表現するために使用される量子ビットの数を定義しています。したがって、 :math:`2^3 = 8` の離散値を定義することができ、すべてのトレーニングサンプルはこれらの離散値のいずれかに該当するはずです。次の図は、各ランダム変数のヒストグラムです。実際の離散化を見るために、棒グラフの棒の数を増やしました。いくつかの棒は空で、各変数には空でない棒が8つあります。

source: We move to PyTorch modeling and start from converting data arrays into tensors and create a data loader from our training data.
es_un: Pasamos al modelado con PyTorch y comenzamos convirtiendo arreglos de datos en tensores y creamos un cargador de datos a partir de nuestros datos de entrenamiento.
ja: PyTorchのモデリングに移り、データ配列をテンソルに変換するところから始め、学習データからデータローダーを作成します。

source: Backend Configurations
es_un: Configuraciones del Backend
ja: バックエンドの構成

source: Next, we need to choose a backend that is used to run the quantum generator. The presented method is compatible with all shot-based backends (qasm, fake hardware, real hardware) provided by Qiskit.
es_un: A continuación, debemos elegir un backend que se utilice para ejecutar el generador cuántico. El método presentado es compatible con todos los backends basados en iteraciones o shots (qasm, hardware falso, hardware real) proporcionados por Qiskit.
ja: 次に、量子生成器を実行するために使用するバックエンドを選択する必要があります。提示した方法は、Qiskitが提供するすべてのショットベースのバックエンド（qasm、fake hardware、real hardware）と互換性があります。

source: First, we create a quantum instance for the training where the batch size defines the number of shots.
es_un: Primero, creamos una instancia cuántica (quantum instance) para el entrenamiento, donde el tamaño del lote (batch) define la cantidad de iteraciones (shots).
ja: まず、学習用の量子インスタンスを作成し、バッチサイズによってショット数を定義します。

source: Then we create a quantum instance for the evaluation purposes, we choose a higher number of shots to get better insights.
es_un: Luego creamos una instancia cuántica para fines de evaluación, elegimos una mayor cantidad de iteraciones para obtener una mejor apreciación.
ja: 次に、評価用の量子インスタンスを作成し、より良い知見を得るためにショット数を多くすることにしました。

source: Initialize the quantum neural network ansatz
es_un: Inicializar la red neuronal cuántica ansatz
ja: 量子ニューラルネットワークのansatzの初期化

source: Now, we define the parameterized quantum circuit :math:`G\left(\boldsymbol{\theta}\right)` with :math:`\boldsymbol{\theta} = {\theta_1, ..., \theta_k}` which will be used in our quantum generator.
es_un: Ahora, definimos el circuito cuántico parametrizado :math:`G\left(\boldsymbol{\theta}\right)` con :math:`\boldsymbol{\theta} = {\theta_1, ..., \theta_k}` que será uilizado en nuestro generador cuántico.
ja: ここで、量子生成器に用いるパラメータ化量子回路 :math:`G\left(\boldsymbol{\theta}\right)` を :math:`\boldsymbol{\theta} = {\theta_1, ..., \theta_k}` で定義します。 これは、量子生成器で使用されます。

source: To implement the quantum generator, we choose a depth-:math:`2` ansatz that implements :math:`R_Y` rotations and :math:`CX` gates which takes a uniform distribution as an input state. Notably, for :math:`k>1` the generator’s parameters must be chosen carefully. For example, the circuit depth should be more than :math:`1` because higher circuit depths enable the representation of more complex structures.
es_un: Para implementar el generador cuántico, elegimos un ansatz de profundidad :math:`2` que implementa rotaciones :math:`R_Y` y compuertas :math:`CX` que toman una distribución uniforme como estado de entrada. En particular, para :math:`k>1` los parámetros del generador deben elegirse con cuidado. Por ejemplo, la profundidad del circuito debe ser mayor que :math:`1` porque las profundidades de circuito más altas permiten la representación de estructuras más complejas.
ja: 量子生成器を実装するために、一様分布を入力に取るような、:math:`R_Y` 回転と :math:`CX` ゲートからなる深さ :math:`2` のansatzを用います。特に :math:`k>1` の場合、生成器のパラメーターは慎重に選ばれなければなりません。例えば、回路が深いほどより複雑な構造を表現できるので、回路の深さは :math:`1` より大きくなるべきです。

source: Let’s draw our circuit and see what it looks like.
es_un: Dibujemos nuestro circuito y veamos cómo se ve.
ja: 回路を描いて見てみましょう。

source: Definition of the quantum generator
es_un: Definición del generador cuántico
ja: 量子生成器の定義

source: Next, we define a function that creates the quantum generator from a given parameterized quantum circuit. As parameters this function takes a quantum instance to be used for data sampling. We wrap a created quantum neural network in ``TorchConnector`` to make use of PyTorch-based training.
es_un: A continuación, definimos una función que crea el generador cuántico a partir de un circuito cuántico parametrizado dado. Como parámetros, esta función toma una instancia cuántica que se utilizará para el muestreo de datos. Encapsulamos una red neuronal cuántica creada en ``TorchConnector`` para hacer uso del entrenamiento basado en PyTorch.
ja: 次に、パラメーター化された量子回路から量子生成器を作成する関数を定義します。パラメーターとして、データのサンプリングに使用する量子インスタンスを受け取ります。作成された量子ニューラルネットワークを ``TorchConnector`` でラップし、PyTorchベースの学習を利用することができるようにします。

source: Definition of the classical discriminator
es_un: Definición del discriminador clásico
ja: 古典識別器の定義

source: Next, we define a PyTorch-based classical neural network that represents the classical discriminator. The underlying gradients can be automatically computed with PyTorch.
es_un: Después, definimos una red neuronal clásica basada en PyTorch que representa el discriminador clásico. Los gradientes subyacentes se pueden calcular automáticamente con PyTorch.
ja: 次に、古典的な識別器を表すPyTorchベースの古典的ニューラルネットワークを定義します。基礎となる勾配はPyTorchで自動的に計算することができます。

source: Definition of the loss functions
es_un: Definición de las funciones de pérdida
ja: 損失関数の定義

source: We want to train the generator and the discriminator with binary cross entropy as loss function:
es_un: Queremos entrenar el generador y el discriminador con entropía cruzada binaria como función de pérdida:
ja: 損失関数として2値クロスエントロピーを用い、生成器と識別器を学習させたいと思います。

source: where :math:`x_j` refers to a data sample and :math:`y_j` to the corresponding label.
es_un: donde :math:`x_j` se refiere a una muestra de datos, mientras que :math:`y_j` a la etiqueta correspondiente.
ja: ここで、 :math:`x_j` はデータサンプル、 :math:`y_j` はそれに対応するラベルを表します。

source: Evaluation of custom gradients for the generator BCE loss function
es_un: Evaluación de gradientes personalizados para la función de pérdida BCE del generador
ja: 生成器BCE損失関数のカスタム勾配の評価

source: The evaluation of custom gradients for the quantum generator requires us to combine quantum gradients :math:`\frac{\partial p_j\left(\boldsymbol{\theta}\right)}{\partial \theta_l}` that we compute with Qiskit’s gradient framework with the binary cross entropy as follows:
es_un: La evaluación de gradientes personalizados para el generador cuántico requiere que combinemos gradientes cuánticos :math:`\frac{\partial p_j\left(\boldsymbol{\theta}\right)}{\partial \theta_l}` que calculamos con el framework de gradiente de Qiskit con la entropía cruzada binaria de la siguiente manera:
ja: 量子生成器のカスタム勾配を評価するには、Qiskitのgradient frameworkで計算した量子勾配 :math:`frac{partial p_j̮left(\boldsymbol{theta}right)}{partial \theta_l}` と2値クロスエントロピーを次のように結合させる必要があります。

source: \frac{\partial L\left(\boldsymbol{\theta}\right)}{\partial \theta_l} = \sum_j \frac{\partial p_j\left(\boldsymbol{\theta}\right)}{\partial \theta_l} \left[y_j\log(x_j) + (1-y_j)\log(1-x_j)\right].
ja: \frac{\partial L\left(\boldsymbol{\theta}\right)}{\partial \theta_l} = \sum_j \frac{\partial p_j\left(\boldsymbol{\theta}\right)}{\part \theta_l} \left[y_j\log(x_j) + (1-y_j)\log(1-x_j)\right].

source: First, we need to define how gradients will be evaluated. Depending on the backend, the gradients may be returned in a sparse format. Since PyTorch provides only a limited support for sparse gradients, we need to write a custom function for gradient based training.
es_un: Primero, necesitamos definir cómo se evaluarán los gradientes. Según el backend, los gradientes pueden devolverse en un formato disperso. Dado que PyTorch proporciona solo un soporte limitado para gradientes dispersos, necesitamos escribir una función personalizada para el entrenamiento basado en gradientes.
ja: まず、勾配がどのように評価されるかを定義する必要があります。バックエンドによっては、gradientsはsparseなフォーマットで返されるかもしれません。PyTorchはスパース勾配を限定的にしかサポートしていないので、勾配ベースの学習用のカスタム関数を書く必要があります。

source: Here, we define the custom function that evaluates gradients of the generator loss function considering the custom gradients of the quantum generator. As the parameters the function takes a list of parameter values and the discriminator as a classical neural network. The function returns a list of gradient values.
es_un: Aquí, definimos la función personalizada que evalúa los gradientes de la función de pérdida del generador considerando los gradientes personalizados del generador cuántico. Como los parámetros, la función toma una lista de valores de parámetros y el discriminador como una red neuronal clásica. La función devuelve una lista de valores de gradiente.
ja: ここでは、量子生成器のカスタム勾配を考慮した生成器損失関数の勾配を評価するカスタム関数を定義します。パラメーターとして，パラメーター値のリストと識別器（古典ニューラルネットワーク）を受け取ります。そして、この関数は勾配値のリストを返します。

source: Relative entropy as benchmarking metric
es_un: Entropía relativa como métrica de evaluación comparativa
ja: ベンチマーク指標としての相対エントロピー

source: The relative entropy describes a distance metric for distributions. Hence, we can use it to benchmark how close/far away the trained distribution is from the target distribution.
es_un: La entropía relativa describe una métrica de distancia para las distribuciones. Por lo tanto, podemos usarla para comparar qué tan cerca/lejos está la distribución entrenada de la distribución objetivo.
ja: 相対エントロピーは，分布の距離指標を記述します。したがって、学習された分布が目的の分布にどれだけ近いか／遠いかを評価するために使うことができます。

source: In the next function we computes relative entropy between target and trained distribution.
es_un: En la siguiente función, calculamos la entropía relativa entre la distribución objetivo y la entrenada.
ja: 次の関数では、目標とする分布と学習させた分布の相対的なエントロピーを計算します。

source: Definition of the optimizers
es_un: Definición de los optimizadores
ja: オプティマイザーの定義

source: In order to train the generator and discriminator, we need to define optimization schemes. In the following, we employ a momentum based optimizer called Adam, see `Kingma et al., Adam: A method for stochastic optimization <https://arxiv.org/abs/1412.6980>`__ for more details.
es_un: Para entrenar el generador y el discriminador, necesitamos definir esquemas de optimización. A continuación, empleamos un optimizador basado en el momento llamado Adam, consulta `Kingma et al., Adam: A method for stochastic optimization <https://arxiv.org/abs/1412.6980>`__ para obtener más detalles.
ja: 生成器と識別器を学習させるためには、最適化スキームを定義する必要があります。以下では、Adamと呼ばれる運動量ベースの最適化手法を採用します。詳しくは `Kingma et al., Adam: A method for stochastic optimization <https://arxiv.org/abs/1412.6980>`__ を参照してください。

source: Visualization of the training process
es_un: Visualización del proceso de entrenamiento
ja: 学習過程の可視化
