Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/04_torch_qgan.po
Languages: es_un, ja

source: We will visualize what is happening during the training by plotting the evolution of the generator’s and the discriminator’s loss functions during the training, as well as the progress in the relative entropy between the trained and the target distribution. We define a function that plots the loss functions and relative entropy. We call this function once an epoch of training is complete.
es_un: Visualizaremos lo que sucede durante el entrenamiento graficando la evolución de las funciones de pérdida del generador y del discriminador durante el entrenamiento, así como el progreso en la entropía relativa entre la distribución entrenada y objetivo. Definimos una función que grafique las funciones de pérdida y la entropía relativa. Llamamos a esta función una vez que se completa una época de entrenamiento.
ja: 学習中の生成器と識別器の損失関数の推移と、学習後の分布と目標分布の相対エントロピーの推移をプロットすることで、学習中に何が起こっているかを可視化します。損失関数と相対エントロピーのプロットを行う関数を定義します。この関数は、1エポックの学習が終了した時点で呼び出されます。

source: Visualization of the training process begins when training data is collected across two epochs.
es_un: La visualización del proceso de entrenamiento comienza cuando los datos de entrenamiento se recopilan en dos épocas.
ja: 学習過程の可視化は、2つのエポックに渡って学習データが収集された時点から開始されます。

source: Training
es_un: Entrenamiento
ja: 学習

source: Now, we are ready to train our model. It may take some time to train the model so be patient.
es_un: Ahora, estamos listos para entrenar nuestro modelo. Puede llevar algo de tiempo entrenar al modelo, así que ten paciencia.
ja: これで、モデルを学習させる準備が整いました。モデルのトレーニングには時間がかかるかもしれませんので、気長にお待ちください。

source: Results: cumulative distribution functions
es_un: Resultados: funciones de distribución acumulativas
ja: 結果：累積分布関数

source: In the final section we compare the cumulative distribution function (CDF) of the trained distribution to the CDF of the target distribution.
es_un: En la sección final, comparamos la función de distribución acumulativa (cumulative distribution function, CDF) de la distribución entrenada con la CDF de la distribución objetivo.
ja: 最後のセクションでは、学習した分布の累積分布関数（CDF）と目標分布のCDFを比較します。

source: We create a new generator for sampling that takes more shots and, hence, gives more information. Recall, the sampling quantum instance was created with a larger number of shots. Then, we set the weights of the sampling generator to the values obtained in the training process.
es_un: Creamos un nuevo generador de muestreo que toma más iteraciones y, por lo tanto, brinda más información. Recuerda, la instancia cuántica de muestreo se creó con una mayor cantidad de iteraciones. Luego, ajustamos los pesos del generador de muestreo a los valores obtenidos en el proceso de entrenamiento.
ja: サンプリングのための新しい生成器を作成し、より多くのショットを取り、それゆえ、より多くの情報を与えます。サンプリング量子インスタンスは、より多くのショット数で作成されたことを思い出してください。そして、サンプリング生成器の重みを学習プロセスで得られた値に設定します。

source: Next, we wet the generator data samples, corresponding sampling probabilities, and plot the cumulative distribution functions.
es_un: A continuación, obtenemos las muestras de datos del generador, las probabilidades de muestreo correspondientes y graficamos las funciones de distribución acumulativa.
ja: 次に、生成器データのサンプルと対応するサンプリング確率を取得し、累積分布関数をプロットします。

source: On the plot above, in the blue color the generated distribution is shown and in the orange color the training one. You may find that both CDFs are similar to each other.
es_un: En la gráfica de arriba, en color azul, se muestra la distribución generada y en color naranja la de entrenamiento. Puedes encontrar que ambos CDF son similares entre sí.
ja: 上のプロットでは、青色は生成された分布、オレンジ色は学習された分布を示しています。両方のCDFが互いに似ていることがわかると思います。

source: Conclusion
es_un: Conclusión
ja: 結論

source: Quantum generative adversarial networks employ the interplay of a generator and discriminator to map an approximate representation of a probability distribution underlying given data samples into a quantum channel. This tutorial presents a self-standing PyTorch-based qGAN implementation where the generator is given by a quantum channel, i.e., a variational quantum circuit, and the discriminator by a classical neural network, and discusses the application of efficient learning and loading of generic probability distributions – implicitly given by data samples – into quantum states. Since, this approximate loading requires only :math:`\mathscr{O}\left(poly\left(n\right)\right)` gates and can enable the use of potentially advantageous quantum algorithms by offering an efficient data loading scheme.
es_un: Las redes de adversarios generativos cuánticas emplean la interacción de un generador y un discriminador para mapear una representación aproximada de una distribución de probabilidad subyacente a muestras de datos dadas en un canal cuántico. Este tutorial presenta una implementación autónoma de qGAN basada en PyTorch, donde el generador está dado por un canal cuántico, es decir, un circuito cuántico variacional, y el discriminador por una red neuronal clásica, y analiza la aplicación de aprendizaje eficiente y carga de distribuciones de probabilidad genéricas, dadas implícitamente por muestras de datos, en estados cuánticos. Dado que esta carga aproximada requiere solo compuertas :math:`\mathscr{O}\left(poly\left(n\right)\right)` y puede permitir el uso de algoritmos cuánticos potencialmente ventajosos al ofrecer un esquema de carga de datos eficiente.
ja: 量子生成敵対ネットワークは、生成器と識別器の相互作用により、与えられたデータサンプルの下にある確率分布の近似表現を量子チャンネルに写像するものです。このチュートリアルでは、生成器を量子チャネル、すなわち変分量子回路、識別器を古典的なニューラルネットワークとして、PyTorchベースのqGANを実装し、データサンプルによって暗黙的に与えられる一般的な確率分布を効率的に学習して量子状態へロードする応用について議論しました。この近似的なローディングに必要なゲートは :math:`mathscr{O}left(poly\left(n\right)\right)` だけであり、効率的なデータローディング方式を提供することにより、潜在的に有利な量子アルゴリズムを使用できるようになります。
