Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/05_torch_connector.po
Languages: bn_bn, fr_fr, hi_in, it_it, ko_kr, pt_un, ru_ru, ta_in, vi_vn, zh_tw

source: If we perform a quick visualization we can see that the train dataset consists of images of handwritten 0s and 1s.
bn_bn: ছোট করে একটি দৃশ্যায়ন বা চিত্রায়ন করলে লক্ষ করা যাবে যে ডেটাসেটিতে ইংরাজিতে হাতে লেখা ০ এবং ১ রয়েছে।
fr_fr: Si nous réalisons une visualisation rapide, nous pouvons voir que le jeu de données d'entrainement est constitué d'images de 0 et de 1 manuscrits.
hi_in: यदि हम एक त्वरित विज़ुअलाइज़ेशन करते हैं तो हम देख सकते हैं कि ट्रेन डेटासेट में हस्तलिखित 0s और 1s की छवियां होती हैं।
it_it: Con una rapida visualizzazione, possiamo osservare che il train dataset consiste di immagini di 0 e 1 scritti a mano.
ko_kr: 빠른 시각화를 수행하는 경우 훈련 데이터 셋이 손으로 쓴 0과 1의 이미지로 구성되어 있음을 알 수 있다.
pt_un: Se nós executarmos uma visualização simples, nós podemos ver que este treinamento de conjunto de dados consiste em imagens de 0s e 1s manuscritos.
ru_ru: Если мы выполним быструю визуализацию, то станет видно, что набор данных для обучения состоит из изображений написанных вручную цифр 0 и 1.
ta_in: நாம் விரைவான காட்சிப்படுத்தலைச் செய்தால், ரயில் தரவுத்தொகுப்பு கையால் எழுதப்பட்ட 0 கள் மற்றும் 1 களின் படங்களைக் கொண்டிருப்பதைக் காணலாம்.
vi_vn: Nếu chúng ta thực hiện một hiển thị nhanh, chúng ta có thể thấy rằng tập dữ liệu đào tạo bao gồm các hình ảnh của các số 0 và 1 được viết tay.
zh_tw: 執行簡單的可視化後，您可以看到訓練資料集由手寫的 0 和 1 圖像組成。

source: Step 2: Defining the QNN and Hybrid Model
bn_bn: ধাপ ২: কোয়ান্টাম নিউরাল নেটওয়ার্ক বানানো এবং দোআঁশলা (Hybrid) মডেল
fr_fr: Étape 2 : Définition du QNN et du modèle hybride
hi_in: चरण 2: QNN और हाइब्रिड मॉडल को परिभाषित करना
it_it: Step 2: Definire la QNN ed il Modello Ibrido
ko_kr: 단계 2: QNN및 하이브리드 모델 정의
pt_un: Passo 2: Definindo o QNN e Modelo Híbrido
ru_ru: Шаг 2: Определение QNN и гибридной модели
ta_in: படி 2: QNN மற்றும் கலப்பின மாதிரியை வரையறுத்தல்
vi_vn: Bước 2: Xác định QNN và Hybrid Model (mô hình lai)
zh_tw: 步驟 2：定義 QNN 和混合式模型

source: This second step shows the power of the ``TorchConnector``. After defining our quantum neural network layer (in this case, a ``TwoLayerQNN``), we can embed it into a layer in our torch ``Module`` by initializing a torch connector as ``TorchConnector(qnn)``.
bn_bn: ``TorchConnector`` এর ক্ষমতা এই দ্বিতীয় ধাপে দেখা যাচ্ছে। আমাদের কোয়ান্টাম নিউরাল নেটওয়ার্কটি (এই ক্ষেত্রে একটি ``TwoLayerQNN``) বানানোর পরে এটা আমরা নিজেদের torch ``Module`` - এ ``TorchConnector(qnn)`` দ্বারা ঢোকাতে পারবো
fr_fr: Cette seconde étape montre la puissance de ``TorchConnector``. Après avoir défini notre couche de réseau neuronal quantique (dans ce cas, un ``TwoLayerQNN``) nous pouvons l'intégrer dans une couche de notre ``Module`` Torch en initialisant un connecteur comme ``TorchConnector(qnn)``.
hi_in: यह दूसरा चरण ``TorchConnector`` की शक्ति को दर्शाता है। हमारे क्वांटम न्यूरल नेटवर्क लेयर (इस मामले में, एक ``TwoLayerQNN``) को परिभाषित करने के बाद, हम एक टॉर्च कनेक्टर को ``TorchConnector(qnn)`` के रूप में आरंभ करके इसे अपने मशाल ``मॉड्यूल`` में एक परत में एम्बेड कर सकते हैं।
it_it: Questo secondo step mostra il potere del ``TorchConnector``. Dopo aver definito il nostro layer di quantum neural network ( in questo caso una ``TwoLayerQNN``), inizializzando un torch connector nel modo seguente ``TorchConnector(qnn)``, possiamo inglobarla in un layer ``Module`` di Torch.
ko_kr: 이 두 번째 단계는 ``TorchConnector`` 의 힘을 보여주고 있다. 우리의 양자신경망 (이 경우에는 ``TwoLayerQNN`` )을 정의한 후 torch connector를 ``TorchConnector(qnn)`` 로 초기화함으로써 우리는 Torch의 ``Module`` 에 있는 레이어에 끼워 넣을 수 있다.
pt_un: Neste segundo passo mostramos o poder do ``TorchConnector``. Depois de definirmos nossa camada de rede neural (neste caso, um ``TwoLayerQNN``), nós podemos embutir isto em uma camada em nosso ``Module`` Torch inicializando o conector Torch como ``TorchConnector(qnn)``.
ru_ru: Данный второй шаг раскрывает мощь ``TorchConnector``. После определения нашего квантового слоя нейросети (в данном случае ``TwoLayerQN``), мы можем встроить его в наш ``Module``, инициализируя его как ``TorchConnector(qnn)``.
ta_in: இந்த இரண்டாவது படி ``TorchConnector`` இன் சக்தியைக் காட்டுகிறது. எங்கள் குவாண்டம் நரம்பியல் நெட்வொர்க் லேயரை வரையறுத்த பிறகு (இந்த விஷயத்தில், ``TwoLayerQNN``), ``TorchConnector(qnn)`` என டார்ச் கனெக்டரை துவக்குவதன் மூலம் அதை ``Module`` இல் ஒரு லேயரில் உட்பொதிக்கலாம்.
vi_vn: Bước thứ hai này cho thấy sức mạnh của ``TorchConnector``. Sau khi xác định lớp neural network lượng tử của chúng tôi (trong trường hợp này là một ``TwoLayerQNN``), chúng tôi có thể nhúng nó vào một lớp trong ``Module`` torch bằng cách khởi tạo một đầu nối torch ``TorchConnector(qnn)``.
zh_tw: 第二步展示了``TorchConnector`` 的強大功能。在定義了量子神經網絡層（在本例中為``TwoLayerQNN``）之後，我們可以通過將torch connector 初始化為`` TorchConnector (qnn) `` 並將其嵌入到 ``Module``中。

source: **⚠️ Attention:** In order to have an adequate gradient backpropagation in hybrid models, we MUST set the initial parameter ``input_gradients`` to TRUE during the qnn initialization.
bn_bn: **⚠️ সাবধান:** কোয়ান্টাম নিউরাল নেটওয়ার্ক বানানোর সময়ে আমাদের প্রাথমিক ``input_gradients`` স্থিতিমাপ বা প্যারামিটারটি TRUE থাকা দরকার যাতে নতিমাত্রা যথেষ্ট ভাবে পিছনের দিকে প্রচার করা (ব্যাকপ্রপাগেশন) যায়।
fr_fr: **⚠️ Attention : ** Pour avoir une rétropropagation de gradient adéquate dans les modèles hybrides, nous DEVEZ définir le paramètre initial ``input_gradients`` à TRUE lors de l'initialisation du qnn.
hi_in: **⚠️ ध्यान दें:** हाइब्रिड मॉडल में पर्याप्त ग्रेडिएंट बैकप्रोपेगेशन के लिए, हमें qnn इनिशियलाइज़ेशन के दौरान प्रारंभिक पैरामीटर ``input_gradients` को TRUE पर सेट करना होगा।
it_it: **⚠️ Attenzione:** Per avere una adeguate backpropagation dei gradienti dei modelli ibridi DOBBIAMO impostare il parametro iniziale ``input_gradients`` a TRUE durante l'inializzazione della qnn.
ko_kr: **⚠️ 주의:** 하이브리드 모델에서 적절한 그라디언트 역전파를 수행하려면 qnn 초기화 중에 초기 매개변수 ``input_gradients`` 를 TRUE로 설정해야 한다.
pt_un: **⚠️ Atenção:** Em ordem de ter uma retropropagação gradiente adequada em modelos híbridos, nós DEVEMOS configurar o parâmetro inicial ``input_gradients`` como TRUE durante a inicialização qnn.
ru_ru: **⚠️ Внимание:** Для правильного использования метода обратного распространения ошибки (backpropagation) для градиента в гибридных моделях, НЕОБХОДИМО установить начальный параметр ``input_gradients`` в значение TRUE во время инициализации qnn.
ta_in: **⚠️கவனம்: ** கலப்பின மாடல்களில் போதிய சாய்வு பின்னணி இருக்க, நாம் qnn துவக்கத்தின் போது ஆரம்ப அளவுரு ``input_gradients`` ஐ TRUE க்கு அமைக்க வேண்டும்.
vi_vn: **⚠️ Chú ý:** Để có sự lan truyền ngược gradient đầy đủ trong các mô hình kết hợp, chúng ta PHẢI đặt tham số ban đầu ``input_gradients`` thành TRUE trong quá trình khởi tạo qnn.
zh_tw: ** ⚠️ 注意：** 為了在混合模型中得到正確的梯度反向傳播，我們必須在 QNN 初始化期間設置初始參數 `` input_gradients`` 為 TRUE 。

source: Step 3: Training
bn_bn: ধাপ ৩: প্রশিক্ষণ
fr_fr: Étape 3 : Entraînement
hi_in: चरण 3: प्रशिक्षण
it_it: Step 3: Addestramento (Training)
ko_kr: 단계 3: 훈련
pt_un: Passo 3: Treinamento
ru_ru: Шаг 3: Обучение
ta_in: படி 3: பயிற்சி
vi_vn: Bước 3: Đào tạo
zh_tw: 步驟 3：訓練

source: Step 4: Evaluation
bn_bn: ধাপ ৪: মূল্যায়ন
fr_fr: Étape 4 : Évaluation
hi_in: चरण 4: मूल्यांकन
it_it: Step 4: Valutazione del modello (Evaluation)
ko_kr: 단계 4: 평가
pt_un: Passo 4: Avaliação
ru_ru: Шаг 4: Оценка
ta_in: படி 4: மதிப்பீடு
vi_vn: Bước 4: Đánh giá
zh_tw: 步驟 4 ：評估

source: 🎉🎉🎉🎉 **You are now able to experiment with your own hybrid datasets and architectures using Qiskit Machine Learning.** **Good Luck!**
bn_bn: 🎉🎉🎉🎉 ** Qiskit Machine Learning দিয়ে এই পর্যায়ে এসে আশা করা যায় যে আপনারা এবার নিজের গবেষণার জনে দোআঁশলা (Hybrid) ডেটাসেট এবং স্থাপত্য (architectures) বানাতে পারবেন।** **আমাদের শুভকামনা রইলো!**
fr_fr: 🎉🎉🎉🎉 **Vous pouvez maintenant expérimenter avec vos propres jeux de données et architectures hybrides en utilisant Qiskit Machine Learning.** **Bonne chance !**
hi_in: 🎉🎉🎉🎉 **अब आप Qiskit Machine Learning का उपयोग करके अपने स्वयं के हाइब्रिड डेटासेट और आर्किटेक्चर के साथ प्रयोग करने में सक्षम हैं।** **सौभाग्य!**
it_it: 🎉🎉🎉🎉 **Ora sei in grado di sperimentare con architetture ibride personalizzate e con nuovi dataset usando Qiskit Machine Learning.** **Buona Fortuna!**
ko_kr: 🎉🎉🎉🎉 **이제 Qiskit Machine Learning을 사용하여 자체 하이브리드 데이터 세트 및 아키텍처를 실험할 수 있다. ** **행운을 빈다!**
pt_un: 🎉🎉🎉🎉 **Você agora é capaz de experimentar os seus próprios conjuntos de dados híbridos e arquiteturas usando o Qiskit Machine Learning.** **Boa sorte!**
ru_ru: 🎉🎉🎉🎉 **Теперь вы можете экспериментировать с собственными гибридными наборами данных и архитектурами, используя Qiskit Machine Learning.** **Удачи!**
ta_in: 🎉🎉🎉🎉 **நீங்கள் இப்போது உங்கள் சொந்த கலப்பின தரவுத்தொகுப்புகள் மற்றும் கட்டிடக்கலைகளை Qiskit இயந்திரக் கற்றலைப் பயன்படுத்திப் பரிசோதிக்க முடியும்.** **அதிர்ஷ்டம் உங்களுக்கு உரித்தாகட்டும்!**
vi_vn: 🎉🎉🎉🎉 **Bây giờ bạn có thể thử nghiệm với kiến trúc và bộ dữ liệu lai của riêng bạn bằng cách sử dụng Qiskit Machine Learning.** **Chúc may mắn!**

source: This page was generated from `docs/tutorials/05_torch_connector.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/05_torch_connector.ipynb`__ -থেকে বানানো হয়েছে।
fr_fr: Cette page a été générée à partir de `docs/tutorials/05_torch_connector.ipynb`__.
it_it: Questa pagina è stata generata da `docs/tutorials/05_torch_connector.ipynb`__.
pt_un: Esta página foi gerada a partir `docs/tutorials/05_torch_connector.ipynb`__.
ru_ru: Страница создана на основе `docs/tutorials/05_torch_connector.ipynb`__.
ta_in: இந்தப் பக்கம் `docs/tutorials/05_torch_connector.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
vi_vn: Trang này được tạo từ `docs/tutorials/05_torch_connector.ipynb`__.
zh_tw: 此頁面是從 `docs/tutorials/05_torch_connector.ipynb`__ 產生的。
