Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/05_torch_connector.po
Languages: bn_bn, fr_fr, hi_in, it_it, ko_kr, pt_un, ru_ru, ta_in, vi_vn, zh_tw

source: In particular, we must make sure that we are returning a dense array of probabilities in the network’s forward pass (``sparse=False``). This parameter is set up to ``False`` by default, so we just have to make sure that it has not been changed.
bn_bn: বিশেষ করে, আমাদের এটা নিশ্চিত করতে হবে যে নেটওয়ার্কের সামনের দিকে যাবার সময় আমরা সম্ভাবনার একটি ঘন বিন্যাস (array) ফেরাচ্ছি (``sparse=False`` করে)। এই স্থিতিমাপ বা প্যারামিটারটা স্বতঃসিদ্ধ নিয়মানুসারে ``False`` এই থাকে।
fr_fr: En particulier, nous devons nous assurer que nous retournons une gamme dense de probabilités dans le passage direct du réseau (``sparse=False``). Ce paramètre est défini sur ``False`` par défaut, donc il suffit de s'assurer qu'il n'a pas été modifié.
hi_in: विशेष रूप से, हमें यह सुनिश्चित करना चाहिए कि हम नेटवर्क के फॉरवर्ड पास (``sparse=False``) में संभावनाओं की एक सघन सरणी लौटा रहे हैं। यह पैरामीटर डिफ़ॉल्ट रूप से ``गलत`` पर सेट है, इसलिए हमें केवल यह सुनिश्चित करना है कि इसे बदला नहीं गया है।
it_it: In particolare, dobbiamo assicurarci di restituire un vettore di probabilità denso nel pass forward della rete (``sparse=False``). Questo parametro è impostato a ``False`` di default, quindi dobbiamo solo essere sicuri che non venga modificato.
ko_kr: 특히, 우리는 네트워크의 포워드 패스(``sparse=False``) 에서 고밀도의 확률 배열을 리턴하고 있는지 확인해야 한다. 이 매개변수는 기본적으로 ``False`` 로 설정되어 있으므로 변경되지 않았는지 확인하기만 하면 된다.
pt_un: Em particular, devemos ter certeza de que estamos retornando uma matriz densa de probabilidades no passe de encaminhamento de rede (``sparse=False``). Este parâmetro é configurado como ``False`` por padrão, então nós apenas precisamos ter certeza de que ele não foi alterado.
ru_ru: В частности, мы должны убедиться, что мы возвращаем плотный массив вероятностей при прямом прохождении сети (``sparse=False``). Этот параметр имеет значение ``False`` по умолчанию, поэтому мы просто должны убедиться, что он не был изменен.
ta_in: குறிப்பாக, நெட்வொர்க்கின் முன்னோக்கி பாஸில் அடர்த்தியான சாத்தியக்கூறுகளை நாங்கள் திருப்பித் தருகிறோம் என்பதை உறுதி செய்ய வேண்டும் (``spares=False``). இந்த அளவுரு இயல்பாக ``False`` என அமைக்கப்பட்டுள்ளது, எனவே அது மாற்றப்படவில்லை என்பதை நாம் உறுதி செய்ய வேண்டும்.
vi_vn: Đặc biệt, chúng tôi phải đảm bảo rằng chúng tôi đang trả về một mảng dày đặc các xác suất trong tính toán trực tiếp của mạng (``sparse=False``). Tham số này được thiết lập mặc định thành `False``, vì vậy chúng tôi chỉ cần đảm bảo rằng nó không bị thay đổi.
zh_tw: 特別是，我們必須確保我們在網絡的前向傳遞中返回一個密集的概率數組(``sparse=False``)。 依預設，此參數設定為 ``False`` ，因此我們必須確定它尚未變更。

source: **⚠️ Attention:** If we define a custom interpret function ( in the example: ``parity``), we must remember to explicitly provide the desired output shape ( in the example: ``2``). For more info on the initial parameter setup for ``CircuitQNN``, please check out the `official qiskit documentation <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__.
bn_bn: **⚠️ সাবধান:** যদি একটি বিশেষায়িত (কাস্টম) ফাংশন ব্যাখ্যা কর থাকে (উদাহরণে: "সমতা") তবে আকাঙ্ক্ষিত আউটপুটের আকার দেওয়া দরকার এখানে। `Qiskit এর প্রদর্শকের (ডকুমেন্টেশন) <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ মধ্যে ``CircuitQNN`` এর স্থিতিমাপ বা প্যারামিটার নিয়ে আরো চর্চা করা রয়েছে
fr_fr: **⚠️ Attention : **Si nous définissons une fonction d'interprétation personnalisée (dans cet exemple: ``parity``), nous ne devons pas oublier de fournir explicitement la forme de sortie souhaitée (dans l'exemple: ``2``). Pour plus d'informations sur la configuration initiale du paramètre pour ``CircuitQNN``, veuillez consulter la `documentation officielle de qiskit <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>` __.
it_it: **⚠️ Attenzione:** Se definiamo una funzione interpret personalizzata (nell'esempio ``parity``), dobbiamo ricordarci di fornire in modo esplicito la dimensione dell'output desiderato (nell'esempio ``2``). Per più informazioni sulle impostazioni dei parametri iniziali per ``CircuitQNN``, per favore far riferimento alla `documentazione ufficiale di qiskit <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__.
ko_kr: **⚠️ 주의: ** 사용자 정의 해석 함수를 정의하는 경우 (예: ``parity``), 원하는 출력 형태를 명시적으로 제공해야 한다 (예:``2``). ``CircuitQNN`` 에 대한 초기 매개변수 설정에 대한 자세한 정보는`공식 Qiskit 문서 <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__를 참고하여라.
pt_un: **⚠️ Atenção:** Se nós definirmos uma função de interpretação personalizada (No exemplo: ``paridade``), nós devemos lembrar de fornecer explicitamente a forma de saída desejada (No exemplo: ``2``). Para mais informações sobre a configuração dos parâmetros iniciais para ``CircuitQNN``, por favor vá até `Documentação oficial do Qiskit <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__.
ru_ru: **⚠️ Внимание:** Если мы определим пользовательскую функцию интерпретации (в примере - ``parity``), мы должны явно предоставить желаемую форму вывода (в примере - ``2``). Для получения дополнительной информации о начальной настройке параметра ``CircuitQNN``, ознакомьтесь с `официальной документацией qiskit <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__.
ta_in: **⚠️ கவனம்:** தனிப்பயன் விளக்கச் செயல்பாட்டை நாம் வரையறுத்தால் (எடுத்துக்காட்டில்: ``சமநிலை``), விரும்பிய வெளியீட்டு வடிவத்தை வெளிப்படையாக வழங்க நினைவில் கொள்ள வேண்டும் (எடுத்துக்காட்டில்: ``2``). ``CircuitQNN`` க்கான ஆரம்ப அளவுரு அமைவு பற்றிய மேலும் தகவலுக்கு, தயவுசெய்து `அதிகாரப்பூர்வ qiskit ஆவணத்தை <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN_hml>`__.
vi_vn: **⚠️ Chú ý:** Nếu chúng ta xác định một hàm thông dịch tùy chỉnh (trong ví dụ: ``parity``), chúng ta phải nhớ cung cấp rõ ràng hình dạng đầu ra mong muốn (trong ví dụ: ``2``). Để biết thêm thông tin về thiết lập tham số ban đầu cho ``CircuitQNN``, vui lòng xem `tài liệu qiskit chính thức <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__.
zh_tw: **⚠️ 注意：** 如果我們定義自訂解譯功能（在範例中：``parity``），我們必須記住明確提供所需的輸出形狀（範例： ``2``）。 如需 ` ` CircuitQNN`` 起始參數設定的相關資訊，請參閱 `official qiskit documentation <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__。

source: For a reminder on optimizer and loss function choices, you can go back to `this section <#Optimizer>`__.
bn_bn: অনুকূলায়ক (অপটিমাইজার) এবং লস ফাংশন পছন্দগুলির একটি স্মরণচিহ্নর জন্য, আপনি `এই অধ্যায় <#Optimizer>`__ ফিরে যেতে পারেন।
fr_fr: Pour un rappel sur les choix de fonctions d'optimisation et de perte, vous pouvez retourner à `cette section <#Optimizer>`__.
hi_in: ऑप्टिमाइज़र और हानि फ़ंक्शन विकल्पों पर अनुस्मारक के लिए, आप `इस अनुभाग <#Optimizer>`__ पर वापस जा सकते हैं।
it_it: Per un ripasso su come scegliere gli optimizer e le funzione di costo, puoi andare indietro a `questa sezione <#Optimizer>`__.
ko_kr: 옵티마이저 및 손실 함수 선택사항에 대해서는 `이 섹션 <#Optimizer>`__으로 돌아갈 수 있음을 기억해라.
pt_un: Para um lembrete sobre as opções de função de perda e otimizador, você pode voltar para `esta sessão <#Optimizer>`__.
ru_ru: Для выбора оптимизатора и функции потерь вы можете вернуться к `этому разделу <#Optimizer>`__.
ta_in: ஆப்டிமைசெர் மற்றும் loss function தேர்வுகள் பற்றிய நினைவூட்டலுக்கு, நீங்கள் `இந்தப் பிரிவுக்குச் செல்லலாம் <#Optimizer>`__.
vi_vn: Để có lời nhắc về các lựa chọn trình tối ưu hóa và hàm mất mát, bạn có thể quay lại `phần này <#Optimizer>`__.

source: 2. Regression
bn_bn: 2. রিগ্রেশন
fr_fr: 2. Régression
hi_in: 2. प्रतिगमन
it_it: 2. Regressione
ko_kr: 2. 회귀
pt_un: 2. Regressão
ru_ru: 2. Регрессия
ta_in: 2. பின்னடைவு
vi_vn: 2. Hồi quy
zh_tw: 2. 迴歸

source: We use a model based on the ``TwoLayerQNN`` to also illustrate how to perform a regression task. The chosen dataset in this case is randomly generated following a sine wave.
bn_bn: কিভাবে রিগ্রেশনের কাজ করা যাবে সেটার জন্যেও আমরা ``TwoLayerQNN`` এর ওপরে বানানো মডেল এখানে ব্যবহার করছি । এই ক্ষেত্রে আমরা সাইন ওয়েভ মিলিয়ে একটি ইচ্ছামতন বানানো ডেটাসেট ব্যবহার করছি।
fr_fr: Nous utilisons un modèle basé sur le ``TwoLayerQNN`` pour illustrer la manière d'effectuer une tâche de regression. Le jeu de données choisi dans ce cas est généré de façon aléatoire à partir d'une onde sinusoïdale.
hi_in: हम ``TwoLayerQNN`` पर आधारित एक मॉडल का उपयोग यह भी बताने के लिए करते हैं कि प्रतिगमन कार्य कैसे करें। इस मामले में चुना गया डेटासेट एक साइन वेव के बाद बेतरतीब ढंग से उत्पन्न होता है।
it_it: Utilizziamo un modello basato su ``TwoLayerQNN`` per mostrare anche un esempio su come eseguire una regressione. Il dataset scelto in questo caso è stato generato in modo casuale seguendo una funzione seno.
ko_kr: 회귀 작업을 수행하는 방법을 설명하기 위해 ``TwoLayerQNN`` 을 기반으로 한 모델을 사용한다. 이 경우 선택한 데이터 셋은 사인파를 따라 무작위로 생성된다.
pt_un: Nós usamos um modelo baseado em ``TwoLayerQNN`` para também ilustrar como executar uma tarefa de regressão. A escolha de conjunto de dados neste caso é randomicamente gerada seguindo uma onda senoidal.
ru_ru: Чтобы продемонстрировать выполнение задачи регрессии, мы также используем модель на основе ``TwoLayerQNN``. Выбранный набор данных в данном случае является случайно сгенерированным и имеет форму синусоидальной волны.
ta_in: ஒரு பின்னடைவு பணியை எப்படிச் செய்வது என்பதை விளக்குவதற்கு ``TwoLayerQNN`` அடிப்படையிலான மாதிரியைப் பயன்படுத்துகிறோம். இந்த வழக்கில் தேர்ந்தெடுக்கப்பட்ட தரவுத் தொகுப்பு சைன் அலைகளைத் தொடர்ந்து தோராயமாக உருவாக்கப்பட்டது.
vi_vn: Chúng tôi sử dụng mô hình dựa trên ``TwoLayerQNN`` để minh họa cách thực hiện tác vụ hồi quy. Tập dữ liệu đã chọn trong trường hợp này được tạo ngẫu nhiên theo sóng sin.
zh_tw: 我們使用以 ``TwoLayerQNN`` 為基礎的模型，也說明如何執行迴歸作業。在這種情況下，選擇的資料集是在正弦波之後隨機生成的。

source: A. Regression with PyTorch and ``OpflowQNN``
bn_bn: A. PyTorch এবং ``OpflowQNN`` দিয়ে রিগ্রেশন
fr_fr: A. Régression avec PyTorch et ``OpflowQNN``
hi_in: A. PyTorch और ``OpflowQNN`` के साथ प्रतिगमन
it_it: A. Regressione con PyTorch e ``OpflowQNN``
ko_kr: A. PyTorch와 ``OpflowQNN`` 을 통한 회귀
pt_un: A. Regressão com PyTorch e ``OpflowQNN``
ru_ru: A. Регрессия с PyTorch ``OpflowQNN``
ta_in: A. PyTorch மற்றும் ``OpflowQNN`` உடன் பின்னடைவு
vi_vn: A. Hồi quy với PyTorch và ``OpflowQNN``
zh_tw: A. 使用PyTorch 及 ``OpflowQNN`` 進行迴歸

source: The network definition and training loop will be analogous to those of the classification task using ``TwoLayerQNN``. In this case, we define our own feature map and ansatz, instead of using the default values.
bn_bn: নেটওয়ার্ক সংজ্ঞা এবং প্রশিক্ষণ লুপ ``TwoLayerQNN`` এর সাথে শ্রেণিবিন্যাসকরণ (ক্লাসিফিকেশন) এর সঙ্গে অনুরূপ হবে। এই ক্ষেত্রে গতানুগতিক মান না ব্যবহার করে আমরা নিজেদের বৈশিষ্ট্য নকশা (ফিচার ম্যাপ) এবং অন্সাৎজ (ansatz) ব্যবহার করবো।
fr_fr: La définition du réseau et routine d'entrainement du réseau seront analogues à celles de la tâche de classification utilisant ``TwoLayerQNN``. Dans ce cas, nous définissons notre propre jeu de features et ansatz, au lieu d'utiliser les valeurs par défaut.
hi_in: नेटवर्क परिभाषा और प्रशिक्षण लूप ``TwoLayerQNN`` का उपयोग करने वाले वर्गीकरण कार्य के अनुरूप होंगे। इस मामले में, हम डिफ़ॉल्ट मानों का उपयोग करने के बजाय, अपने स्वयं के फीचर मैप और ansatz को परिभाषित करते हैं।
it_it: La definizione della rete e il processo di allenamento saranno gli stessi del caso della classificazione con la ``TwoLayerQNN``. In questo caso definiamo la nostra feature map e l'ansatz, invece di usare valori predefiniti.
ko_kr: 네트워크 정의와 훈련 루프는 ``TwoLayerQNN`` 을 사용하는 분류작업과 유사하게 될 것이다. 이 경우에 우리는 기본 값들을 사용하는 대신 우리만의 feature map과 ansatz를 정의한다.
pt_un: A definição de rede e treinamento de loop serão análogos aos da tarefa de classificação usando o ``TwoLayerQNN``. Neste caso, nós definimos nosso próprio mapa de recursos e ansatz, ao invés de usar os valores padrões.
ru_ru: При использовании ``TwoLayerQNN`` определение сети и цикл обучения будут аналогичны задачам классификации. В этом случае мы определяем собственную карту признаков и анзац, а не используем значения по умолчанию.
ta_in: நெட்வொர்க் வரையறை மற்றும் பயிற்சி வளையம் ``TwoLayerQNN`` ஐப் பயன்படுத்தி வகைப்பாடு பணிக்கு ஒத்ததாக இருக்கும். இந்த வழக்கில், இயல்புநிலை மதிப்புகளைப் பயன்படுத்துவதற்குப் பதிலாக, எங்கள் சொந்த அம்ச வரைபடம் மற்றும் அன்சாட்ஸை நாங்கள் வரையறுக்கிறோம்.
vi_vn: Định nghĩa mạng và vòng lặp đào tạo sẽ tương tự với các định nghĩa của tác vụ phân loại bằng sử dụng ``TwoLayerQNN``. Trong trường hợp này, chúng tôi xác định bản đồ tính năng và ansatz của riêng mình, thay vì sử dụng các giá trị mặc định.
zh_tw: 網路定義和訓練迴圈會與使用 ``TwoLayerQNN`` 的分類任務類似。在此情況下，我們定義了自己的特徵圖和擬設，而不是使用預設值。

source: Part 2: MNIST Classification, Hybrid QNNs
bn_bn: দ্বিতীয় অধ্যায়: MNIST এর শ্রেণিবিন্যাসকরণ (ক্লাসিফিকেশন), দোআঁশলা (Hybrid) কোয়ান্টাম নিউরাল নেটওয়ার্ক
fr_fr: Partie 2 : Classification MNIST, QNNs hybrides
hi_in: भाग 2: MNIST वर्गीकरण, हाइब्रिड QNNs
it_it: Part 2: Classificazione su MNIST, QNNs Ibride
ko_kr: 파트 2: MNIST 분류, 하이브리드 QNN
pt_un: Parte 2: Classificação MNIST, QNNs híbridas
ru_ru: Часть 2: Классификация MNIST, гибридные QNN
ta_in: பகுதி 2: MNIST வகைப்பாடு, கலப்பின QNN கள்
vi_vn: Phần 2: Phân loại MNIST, các QNN lai
zh_tw: 第 2 部分：MNIST分類、混合式 QNNs

source: In this second part, we show how to leverage a hybrid quantum-classical neural network using ``TorchConnector``, to perform a more complex image classification task on the MNIST handwritten digits dataset.
bn_bn: এই দ্বিতীয় অধ্যায়ে আমরা ``TorchConnector`` এর সাহায্যে হাইব্রিড কোয়ান্টাম নিউরাল নেটওয়ার্ক বানানো এবং সেটা দিয়ে কিভাবে MNIST (হাতে লেখা সংখ্যা) ডেটাসেটের ওপরে আরো জটিল ছবির শ্রেণিবিন্যাসকরণ (ক্লাসিফিকেশন) কাজ করা যায় সেটা দেখিয়েছি।
fr_fr: Dans cette seconde partie, nous montrons comment tirer parti d'un réseau neuronal quantique hybride à l'aide de ``TorchConnector`` pour effectuer une tâche de classification d'image plus complexe sur le jeu de données des écritures manuelles du MNIST.
hi_in: इस दूसरे भाग में, हम दिखाते हैं कि MNIST हस्तलिखित अंकों के डेटासेट पर अधिक जटिल छवि वर्गीकरण कार्य करने के लिए ``TorchConnector` का उपयोग करके एक हाइब्रिड क्वांटम-शास्त्रीय तंत्रिका नेटवर्क का लाभ कैसे उठाया जाए।
it_it: In questa seconda parte, mostriamo come sfruttare una neural network ibrida quantistica-classica, usando ``TorchConnector``, per eseguire una complessa classificazione sul dataset MNIST che contiene immagini di numeri scritti a mano.
ko_kr: 이 두 번째 부분에서는 ``TorchConnector`` 를 사용하여 하이브리드 양자-고전 신경망을 활용하여 MNIST 자필 숫자 데이터 셋에 보다 복잡한 이미지 분류 작업을 수행하는 방법을 설명한다.
pt_un: Nesta segunda parte, nós mostramos como aproveitar uma rede neural híbrida quântica-clássica usando ``TorchConnector``, para executar uma imagem de tarefa de classificação mais complexa no conjunto de dados de dígitos manuscritos MNIST.
ru_ru: В этой второй части мы показываем, как использовать гибридно-классическую нейронную сеть с помощью ``TorchConnector`` для выполнения более сложной задачи по классификации изображений на наборе данных с рукописными буквами MNIST.
ta_in: இந்த இரண்டாம் பாகத்தில், MNIST கையால் எழுதப்பட்ட இலக்கங்கள் தரவுத்தொகுப்பில் மிகவும் சிக்கலான பட வகைப்பாடு பணியைச் செய்ய, ``TorchConnector`` ஐப் பயன்படுத்தி ஒரு கலப்பின குவாண்டம்-கிளாசிக்கல் நரம்பியல் நெட்வொர்க்கை எவ்வாறு மேம்படுத்துவது என்பதைக் காண்பிப்போம்.
vi_vn: Trong phần thứ hai này, chúng tôi chỉ ra cách tận dụng một neural network cổ điển-lượng tử lai bằng cách sử dụng ``TorchConnector``, để thực hiện nhiệm vụ phân loại hình ảnh phức tạp hơn trên tập dữ liệu chữ số viết tay MNIST.
zh_tw: 第二部分展示如何通過 ``TorchConnector``利用混合量子古典神經網絡。在 MNIST 手寫數字資料集上執行更複雜的圖像分類任務。

source: For a more detailed (pre-``TorchConnector``) explanation on hybrid quantum-classical neural networks, you can check out the corresponding section in the `Qiskit Textbook <https://qiskit.org/textbook/ch-machine-learning/machine-learning-qiskit-pytorch.html>`__.
bn_bn: `Qiskit Textbook <https://qiskit.org/textbook/ch-machine-learning/machine-learning-qiskit-pytorch.html>`__ - এ আরো সবিশেষ ভাবে দোআঁশলা (Hybrid) কোয়ান্টাম নিউরাল নেটওয়ার্কের ব্যাপারে বোঝানো হয়েছে।
fr_fr: Pour une explication plus détaillée (pre-``TorchConnector``) sur les réseaux neuronaux hybrides quantiques classiques, vous pouvez consulter la section correspondante dans le manuel `Qiskit Textbook <https://qiskit.org/textbook/ch-machine-learning/machine-learning-qiskit-pytorch.html>` __.
hi_in: हाइब्रिड क्वांटम-शास्त्रीय तंत्रिका नेटवर्क पर अधिक विस्तृत (पूर्व-`` टॉर्च कनेक्टर`) स्पष्टीकरण के लिए, आप `किस्किट पाठ्यपुस्तक में संबंधित अनुभाग देख सकते हैं। <https://qiskit.org/textbook/ch-machine-learning/machine-learning-qiskit-pytorch.html>`__.
it_it: Puoi leggere la sezione dedicata nel `Qiskit Textbook <https://qiskit.org/textbook/ch-machine-learning/machine-learning-qiskit-pytorch.html>`__. per una più dettagliata spiegazione sulle neural network ibride quantistico-classiche (pre-``TorchConnector``).
ko_kr: 하이브리드 양자-고전 신경망에 대한 보다 자세한 설명 (pre-``TorchConnector``) 에 대해서는 `Qiskit Textbook <https://qiskit.org/textbook/ch-machine-learning/machine-learning-qiskit-pytorch.html>`__의 해당 섹션을 확인할 수 있다.
pt_un: Para uma explicação mais detalhada sobre (pre-``TorchConnector``) uma rede neural híbrida quântica-clássica, você pode checar a sessão correspondente no `Qiskit Textbook <https://qiskit.org/textbook/ch-machine-learning/machine-learning-qiskit-pytorch.html>`__.
ru_ru: Для более подробного (до ``TorchConnector``) объяснения гибридных кванто-классических нейронных сетей вы можете посмотреть соответствующий раздел в `Qiskit Textbook <https://qiskit.org/textbook/ch-machine-learning/machine-learning-qiskit-pytorch.html>`__.
ta_in: ஹைபிரிட் குவாண்டம்-கிளாசிக்கல் நியூரல் நெட்வொர்க்குகள் பற்றிய விரிவான (முன்-``TorchConnector``) விளக்கத்திற்கு, நீங்கள் `Qiskit Textbook <https://qiskit.org/textbook/ch-machine-learning/machine-learning-qiskit-pytorch.html>`__ இல் தொடர்புடைய பிரிவைப் பார்க்கலாம்.
vi_vn: Để có giải thích chi tiết hơn (trước ``TorchConnector``) về neural network cổ điển-lượng tử lai, bạn có thể xem phần tương ứng trong `Qiskit Textbook <https://qiskit.org/textbook/ch-machine-learning/machine-learning-qiskit-pytorch.html>`__.
zh_tw: 有關混合量子古典神經網絡的更多信息（在``TorchConnector``之前），請參閱`Qiskit Textbook <https://qiskit.org/textbook/ch-machine-learning/machine-learning-qiskit-pytorch.html>`__ 相對應的部分。

source: Step 1: Defining Data-loaders for train and test
bn_bn: ধাপ ১: প্রশিক্ষণ এবং পরীক্ষার জন্য ডেটা-লোডার সংজ্ঞায়িত করা
fr_fr: Étape 1 : Définir des chargeurs de données pour l'entrainement et le test
hi_in: चरण 1: ट्रेन और परीक्षण के लिए डेटा लोडर को परिभाषित करना
it_it: Step 1: Definire i Data-loader per train e test
ko_kr: 1단계: 훈련 및 테스트를 위한 데이터 로더 정의
pt_un: Passo 1: Definindo Data-Loaders para treinamento e teste
ru_ru: Шаг 1: Определение загрузчиков данных для обучения и тестирования
ta_in: படி 1: ரயில் மற்றும் சோதனைக்கான தரவு ஏற்றிகளை வரையறுத்தல்
vi_vn: Bước 1: Xác định Bộ tải dữ liệu cho đào tạo và kiểm tra
zh_tw: 步驟 1：定義用於訓練和測試的數據加載器

source: We take advantage of the ``torchvision`` `API <https://pytorch.org/vision/stable/datasets.html>`__ to directly load a subset of the `MNIST dataset <https://en.wikipedia.org/wiki/MNIST_database>`__ and define torch ``DataLoader``\ s (`link <https://pytorch.org/docs/stable/data.html>`__) for train and test.
bn_bn: প্রশিক্ষণ এবং পরিক্ষার জন্যে ``torchvision`` `API <https://pytorch.org/vision/stable/datasets.html>`__ এর সাহায্যে সরাসরি `MNIST dataset <https://en.wikipedia.org/wiki/MNIST_database>`__ এর একাংশ লোড করে ``DataLoader``\ s (`link <https://pytorch.org/docs/stable/data.html>`__) বর্ণনা করছি ।
fr_fr: Nous tirons profit de l'API `torchvision<https://pytorch.org/vision/stable/datasets.html>` __ pour charger directement un sous-ensemble de l'ensemble de données MNIST <https://en.wikipedia.org/wiki/MNIST_database>` __ et définir le `` DataLoader`` Torch (` link <https://pytorch.org/docs/stable/data.html>` __) pour l'entrainement et le test.
hi_in: हम ``torchvision`` `API <https://pytorch.org/vision/stable/datasets.html>`__ का लाभ उठाते हुए `MNIST डेटासेट <https://en.wikipedia.org/wiki/MNIST_database>`__के सबसेट को सीधे लोड करते हैं और ट्रेन और परीक्षण के लिए मशाल ``DataLoader``\ s (`लिंक <https://pytorch.org/docs/stable/data.html>`__) को परिभाषित करें।
it_it: Utilizziamo la `API <https://pytorch.org/vision/stable/datasets.html>`__ ``torchvision`` per scaricare direttamente un sottoinsieme del `MNIST dataset <https://en.wikipedia.org/wiki/MNIST_database>`__ e definire un torch ``DataLoader`` (`link <https://pytorch.org/docs/stable/data.html>`__) per train e test.
ko_kr: 우리는 ``torchvision`` `API <https://pytorch.org/vision/stable/datasets.html>`__ 를 이용하여 `MNIST dataset <https://en.wikipedia.org/wiki/MNIST_database>`__ 의 서브셋을 직접 로드하고, torch ``DataLoader``\ s (`link <https://pytorch.org/docs/stable/data.html>`__)를 훈련과 테스트에 사용할 수 있도록 한다.
pt_un: Nós aproveitamos a vantagem da ``torchvision`` `API <https://pytorch.org/vision/stable/datasets.html>`__ para carregar diretamente um subconjunto do `MNIST dataset <https://en.wikipedia.org/wiki/MNIST_database>`__ e definir o Torch ``DataLoader``\ s (`link <https://pytorch.org/docs/stable/data.html>`__) para treinamento e teste.
ru_ru: Мы пользуемся преимуществом ``torchvision`` `API <https://pytorch.org/vision/stable/datasets.html>`__ для непосредственной загрузки подмножества `набора данных MNIST <https://en.wikipedia.org/wiki/MNIST_database>`__ и определения ``DataLoader`` (`link <https://pytorch.org/docs/stable/data.html>`__) для обучения и тестирования.
ta_in: நாங்கள் ``torchvision`` `API <https://pytorch.org/vision/stable/datasets.html>`__ ஐப் பயன்படுத்தி `MNIST தரவுத்தொகுப்பு <https: //en. org/wiki/MNIST_database>`__ மற்றும் டார்ச்சை வரையறுக்கவும் ``DataLoader``\ s (`இணைப்பு <https://pytorch.org/docs/stable/data.html>`__) ரயில் மற்றும் சோதனை.
vi_vn: Chúng tôi tận dụng ``torchvision`` `API <https://pytorch.org/vision/stable/datasets.html>`__ để tải trực tiếp một tập con của `Tập dữ liệu MNIST <https://en.wikipedia.org/wiki/MNIST_database>`__ và xác định torch ``DataLoader``\ s (`link <https://pytorch.org/docs/stable/data.html>`__) để đào tạo và kiểm tra.
zh_tw: 利用``torchvision`` `API <https://pytorch.org/vision/stable/datasets.html>` __去加載一個子集 `MNIST dataset <https://en.wikipedia.org/wiki/MNIST_database> ，並直接定義一個 ``DataLoader``\ s (`link <https://pytorch.org/docs/stable/data.html>`__) 用於訓練和測試。
