Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/05_torch_connector.po
Languages: bn_bn, fr_fr, hi_in, it_it, ko_kr, pt_un, ru_ru, ta_in, vi_vn, zh_tw

source: Run interactively in jupyter notebook.
hi_in: Jupyter नोटबुक में अंतःक्रियात्मक रूप से चलाएं।
ko_kr: Jupyter 노트북에서 대화식으로 실행하라.

source: Torch Connector and Hybrid QNNs
bn_bn: টর্চ (PyTorch) সংযোগকারী এবং দোআঁশলা কোয়ান্টাম নিউরাল নেটওয়ার্ক
fr_fr: Connecteur à Torch et QNNs hybrides
hi_in: मशाल कनेक्टर और हाइब्रिड QNNs
it_it: Torch Connector e QNNs Ibride
ko_kr: 토치 커넥터 및 하이브리드 QNN
pt_un: Conector Torch e QNNs híbridas
ru_ru: Torch Connector и гибридные QNN
ta_in: டார்ச் இணைப்பான் மற்றும் கலப்பின QNN கள்
vi_vn: Torch Connector và Hybrid QNNs
zh_tw: Torch 連接器及混合式 QNNs

source: This tutorial introduces Qiskit’s ``TorchConnector`` class, and demonstrates how the ``TorchConnector`` allows for a natural integration of any ``NeuralNetwork`` from Qiskit Machine Learning into a PyTorch workflow. ``TorchConnector`` takes a Qiskit ``NeuralNetwork`` and makes it available as a PyTorch ``Module``. The resulting module can be seamlessly incorporated into PyTorch classical architectures and trained jointly without additional considerations, enabling the development and testing of novel **hybrid quantum-classical** machine learning architectures.
bn_bn: এই পাঠসমূহতে (টিউটোরিয়াল) Qiskit - এর ``TorchConnector`` ক্লাস ব্যবহার করে কিভাবে Qiskit Machine Learning - এর ``NeuralNetwork`` যেকোনো PyTorch কর্মধারায় সংযোজন করা যেতে পারে সেটা দেখানো হয়েছে। Qiskit এর ``NeuralNetwork`` - টি ``TorchConnector`` একটি PyTorch ``Module`` হিসাবে উপলব্ধ করে। সেই মডিউল (``Module``) যেকোনো PyTorch এর প্রথাগত স্থাপত্যতে নির্বিঘ্নে অন্তর্ভুক্ত করা যেতে পারে এবং অতিরিক্ত বিবেচনা ছাড়াই যৌথভাবে প্রশিক্ষিত করা যেতে পারে। এই ভাবে এটি নতুন **দোআঁশলা কোয়ান্টাম - ক্লাসিক্যাল** মেশিন লার্নিং স্থাপত্তের উন্নয়ন এবং পরীক্ষা করা অত্যন্ত সহজ বানিয়ে ফেলে।
fr_fr: Ce tutoriel présente la classe ``TorchConnector`` de Qiskit et montre comment le ``TorchConnector`` permet une intégration naturelle de ``NeuralNetwork`` de Qiskit Machine Learning dans un flux de travail PyTorch. ``TorchConnector`` prend un ``NeuralNetwork`` de Qiskit et le rend disponible en tant que ``Module`` de PyTorch. Le module qui en résulte peut être intégré de façon transparente dans les architectures classiques de PyTorch et être formé conjointement sans considérations supplémentaires, ce qui permet le développement et la mise à l'essai de nouvelles architectures **hybrides classique-quantique**.
hi_in: यह ट्यूटोरियल Qiskit के ``TorchConnector`` वर्ग का परिचय देता है, और दर्शाता है कि कैसे ``TorchConnector`` Qiskit Machine Learning से PyTorch वर्कफ़्लो में किसी भी ``NeuralNetwork`` के प्राकृतिक एकीकरण की अनुमति देता है। ``TorchConnector`` एक Qiskit ``NeuralNetwork`` लेता है और इसे एक PyTorch ``मॉड्यूल`` के रूप में उपलब्ध कराता है। परिणामी मॉड्यूल को मूल रूप से PyTorch शास्त्रीय आर्किटेक्चर में शामिल किया जा सकता है और अतिरिक्त विचारों के बिना संयुक्त रूप से प्रशिक्षित किया जा सकता है, जिससे उपन्यास **hybrid quantum-classical** मशीन लर्निंग आर्किटेक्चर के विकास और परीक्षण को सक्षम किया जा सकता है।
it_it: Questo tutorial introduce la classe di Qiskit ``TorchConnector`` e dimostra come essa permetta una facile integrazione di qualsiasi ``NeuralNetwork`` da Qiskit Machine Learning in un flusso di lavoro in PyTorch. ``TorchConnector`` rende disponibile una ``NeuralNetwork`` di Qiskit come un ``Module`` di PyTorch. Il modulo che ne risulta può essere perfettamente incorporato in una classica architettura PyTorch e allenato senza considerazioni addizionali, permettendo quindi lo sviluppo ed il testing di nuove architetture di machine learning **ibride quantistiche-classiche**.
ko_kr: 이 튜토리얼에서는 Qiskit의 ``TorchConnector`` 클래스를 소개하고 ``TorchConnector`` 가 Qiskit Machine Learning 에서 PyTorch 워크플로우로 ``NeuralNetwork`` 를 자연스럽게 통합하는 방법을 설명합니다.``TorchConnector`` 는 Qiskit의 ``NeuralNetwork`` 을 받아 PyTorch의 ``Module`` 로 사용할 수 있도록 한다. 결과 모듈은 PyTorch 클래식 아키텍처에 완벽하게 통합되어 추가적인 고려사항 없이 공동으로 train될 수 있으며, 새로운 **양자-고전 하이브리드** 기계 학습 아키텍처를 개발하고 테스트할 수 있다.
pt_un: Este tutorial introduz a classe ``TorchConnector`` do Qiskit, e demonstra como o ``TorchConnector`` permite permite uma integração natural de qualquer ``NeuralNetwork`` do Qiskit Machine Learning em um fluxo de trabalho PyTorch. O ``TorchConnector`` recebe um Qiskit ``NeuralNetwork`` e o torna disponível como um ``Módulo`` PyTorch. O módulo resultante pode ser perfeitamente incorporado na arquitetura clássica do PyTorch e treinado em conjunto sem considerações adicionais, permitindo o desenvolvimento e o teste de relação **híbrido quântico-classico** na arquitetura de machine learning.
ru_ru: Этот учебный материал представляет класс ``TorchConnector`` из Qiskit и демонстрирует, как ``TorchConnector`` позволяет интегрировать любую ``NeuralNetwork`` из Qiskit Machine Learning в рабочий процесс PyTorch. ``TorchConnector`` принимает Qiskit ``NeuralNetwork`` и делает его доступным как ``Module`` PyTorch. Результирующий модуль можно легко интегрировать в классические архитектуры PyTorch и обучать без дополнительных сложностей, открывая возможность разработки и тестирования **гибридных квантово-классических** архитектур машинного обучения.
ta_in: இந்த பயிற்சிகள் Qiskit-ன் ``TorchConnector`` வகுப்பை அறிமுகப்படுத்துகிறது, மேலும் ``TorchConnector`` Qiskit பொறி கற்றலிருந்து எந்த ஒரு ``நியூரல் நெட்வொர்க்`` ஐ ஒரு இயற்கையான ஒருங்கிணைப்பை அனுமதிக்கிறது. ``TorchConnector`` ஒரு Qiskit ``NeuralNetwork`` ஐ எடுத்து அதை PyTorch ``தொகுதி`` ஆக கிடைக்கச் செய்கிறது. இதன் விளைவாக தொகுதி PyTorch கிளாசிக்கல் கட்டமைப்புகளில் தடையின்றி இணைக்கப்படலாம் மற்றும் கூடுதல் பரிசீலனைகள் இல்லாமல் கூட்டாக பயிற்சி பெறலாம், நாவல் **hybrid quantum-classical** பொறி கற்றல் கட்டமைப்புகளின் வளர்ச்சி மற்றும் சோதனைக்கு உதவுகிறது.
vi_vn: Hướng dẫn này giới thiệu lớp ``TorchConnector`` của Qiskit và trình bày cách ``TorchConnector`` cho phép tích hợp tự nhiên bất kỳ ``NeuralNetwork`` nào từ Qiskit Machine Learning vào một quy trình làm việc PyTorch. ``TorchConnector`` sử dụng Qiskit ``NeuralNetwork`` và cung cấp nó dưới dạng ``Module`` PyTorch. Module kết quả có thể được tích hợp liền mạch vào các kiến trúc cổ điển PyTorch và được đào tạo chung mà không cần cân nhắc thêm, cho phép phát triển và thử nghiệm các kiến trúc học máy **lai lượng tử-cổ điển** mới.
zh_tw: 本教程介紹 Qiskit 的 ``TorchConnector`` 類別。然後展示了``TorchConnector`` 如何自然地將來自 Qiskit 機器學習的 ``NeuralNetwork`` 整合到 PyTorch 工作流程中。 `` TorchConnector`` 採用 Qiskit 的 ``NeuralNetwork`` 並將其作為 PyTorch 的 ``Module`` 使用。生成的模塊可以無縫融合到 PyTorch 的古典架構中並一起訓練，無需任何額外考慮。它還支持新**hybrid quantum-classical** 機器學習架構的開發和測試。

source: Content:
bn_bn: সুচি:
fr_fr: Contenu :
hi_in: विषय-सूची
it_it: Contenuto:
ko_kr: 내용:
pt_un: Conteúdo:
ru_ru: Содержание:
ta_in: உள்ளடக்கம்:
vi_vn: Nội dung:
zh_tw: 內容：

source: `Part 1: Simple Classification & Regression <#Part-1:-Simple-Classification-&-Regression>`__
bn_bn: `প্রথম অধ্যায়: সরল শ্রেণীবিভাগ ও প্রত্যাবর্তন <#Part-1:-Simple-Classification-&-Regression>`__
fr_fr: `Partie 1: Classification & Régression Simple <#Part-1:-Simple-Classification- &-Regression>` __
hi_in: `भाग 1: सरल वर्गीकरण और प्रतिगमन <#Part-1:-Simple-Classification-&-Regression>`__
it_it: `Parte 1: Semplice Classificazione & Regressione <#Part-1:-Simple-Classification-&-Regression>`__
ko_kr: `파트 1: 단순 분류 및 회귀 <#Part-1:-Simple-Classification-&-Regression>`__
pt_un: `Parte 1: Classificação e Regressão Simples <#Part-1:-Simple-Classification-&-Regression>`__
ru_ru: `Часть 1: Простая классификация и регрессия <#Part-1:-Simple-Classification-&-Regression>`__
ta_in: `பகுதி 1: எளிய வகைப்பாடு & பின்னடைவு <#Part-1:-Simple-Classification-&-Regression>`__
vi_vn: `Phần 1: Phân loại đơn giản & Hồi quy <#Part-1:-Simple-Classification-&-Regression>`__
zh_tw: `第 1 部分：簡單分類和回歸 <# 第 1 部分：-Simple-Classification-&-Regression>` __

source: The first part of this tutorial shows how quantum neural networks can be trained using PyTorch’s automatic differentiation engine (``torch.autograd``, `link <https://pytorch.org/tutorials/beginner/blitz/autograd_tutorial.html>`__) for simple classification and regression tasks.
bn_bn: এই পাঠসমূহের প্রথম ভাগে কিভাবে কোয়ান্টাম নিউরাল নেটওয়ার্ক PyTorch - এর স্বয়ংক্রিয় বিভাজন যন্ত্র (``torch.autograd``, `link <https://pytorch.org/tutorials/beginner/blitz/autograd_tutorial.html>`__) দিয়ে সহজ শ্রেণিবিন্যাস এবং রিগ্রেশন কাজের জন্যে প্রশিক্ষণ করা যেতে পারে সেটা দেখানো হয়েছে।
fr_fr: La première partie de ce tutoriel montre comment les réseaux neuronaux quantiques peuvent être formés à l'aide du moteur de différenciation automatique de PyTorch (``torch.autograd``, lien <https://pytorch.org/tutorials/beginner/blitz/autograd_tutorial.html>` __) pour des tâches simples de classification et de régression.
hi_in: इस ट्यूटोरियल का पहला भाग दिखाता है कि कैसे PyTorch के स्वचालित विभेदन इंजन का उपयोग करके क्वांटम न्यूरल नेटवर्क को प्रशिक्षित किया जा सकता है (``torch.autograd``, `link <https://pytorch.org/tutorials/beginner/blitz/autograd_tutorial.html>`__) सरल वर्गीकरण और प्रतिगमन कार्यों के लिए।
it_it: La prima parte di questo tutorial dimostra come, per semplici compiti di classificazione e regressione, si possa allenare una quantum neural network usando un motore di differenziazione automatica di PyTorch (``torch.autograd``, `link <https://pytorch.org/tutorials/beginner/blitz/autograd_tutorial.html>`__).
ko_kr: 이 튜토리얼의 첫 번째 부분에서는 양자신경망을 간단한 분류 및 회귀 작업을 위해 PyTorch의 자동 분화 엔진 (``torch.autograd``, `link <https://pytorch.org/tutorials/beginner/blitz/autograd_tutorial.html>`__) 을 사용하여 어떻게 훈련시킬 수 있는지를 보여 준다.
pt_un: A primeira parte deste tutorial mostra como redes neurais podem ser treinadas usando a ferramenta de diferenciação automática do PyTorch (``torch.autograd``, `link <https://pytorch.org/tutorials/beginner/blitz/autograd_tutorial.html>`__) para tarefas simples de classificação e regressão.
ru_ru: Первая часть этого урока показывает, как квантовые нейронные сети могут быть обучены с помощью механизма автоматического дифференцирования PyTorch (``torch.autograd``, ``ссылка <https://pytorch.org/tutorials/beginner/blitz/autograd_tutorial.html>`__) для простых задач классификации и регрессии.
ta_in: இந்த பயிற்சிகளின் முதல் பகுதி எளிய வகைப்பாடு மற்றும் பின்னடைவு பணிகளுக்கு பைடார்ச்சின் தானியங்கி வேறுபாடு இயந்திரத்தை (``torch.autograd``, `link <https://pytorch.org/tutorials/beginner/blitz/autograd_tutorial.html>`__) பயன்படுத்தி எப்படி குவாண்டம் neural network-களைப் பயிற்றுவிக்க முடியும் என்பதைக் காட்டுகிறது.
vi_vn: Phần đầu tiên của hướng dẫn này cho thấy cách mạng neural lượng tử có thể được đào tạo bằng cách sử dụng công cụ phân biệt tự động của PyTorch (``torch.autograd``, `link <https://pytorch.org/tutorials/beginner/blitz/autograd_tutorial.html>`__) cho các nhiệm vụ phân loại và hồi quy đơn giản.
zh_tw: 本教程的第一部分使用 PyTorch 的自動區分引擎(``torch.autograd``, `link <https://pytorch.org/tutorials/beginner/blitz/autograd_tutorial.html>`__)。它展示如何訓練用於簡單分類和回歸任務的量子神經網絡。

source: `Classification <#1.-Classification>`__
bn_bn: `শ্রেণিবিন্যাসকরণ (ক্লাসিফিকেশন) <#1.-Classification>`__
hi_in: `वर्गीकरण <#1.-Classification>`__
it_it: `Classificazione <#1.-Classification>`__
ko_kr: `분류 <#1.-Classification>`__
pt_un: `Classificação <#1.-Classification>`__
ru_ru: `Классификация <#1.-Classification>`__
ta_in: `வகைப்பாடு <#1.-Classification>`__
vi_vn: `Phân loại <#1.-Classification>`__
zh_tw: `分類 <#1.-Classification>`__

source: Classification with PyTorch and ``OpflowQNN``
bn_bn: PyTorch এবং ``OpflowQNN`` দ্বারা শ্রেণিবিন্যাসকরণ
fr_fr: Classification avec PyTorch et ``OpflowQNN``
hi_in: PyTorch और ``OpflowQNN`` के साथ वर्गीकरण
it_it: Classificazione con PyTorch e ``OpflowQNN``
ko_kr: PyTorch와 ``OpflowQNN`` 을 이용한 분류
pt_un: Classificação com PyTorch e ``OpflowQNN``
ru_ru: Классификация с PyTorch и ``OpflowQNN``
ta_in: PyTorch மற்றும் ``OpflowQNN`` உடன் வகைப்பாடு
vi_vn: Phân loại với PyTorch và ``OpflowQNN``
zh_tw: 使用 PyTorch 及 ``OpflowQNN`` 進行分類

source: Classification with PyTorch and ``CircuitQNN``
bn_bn: PyTorch এবং ``CircuitQNN`` দ্বারা শ্রেণিবিন্যাসকরণ
fr_fr: Classification avec PyTorch et le ``CircuitQNN``
hi_in: PyTorch और ``OpflowQNN`` के साथ वर्गीकरण
it_it: Classificazione con PyTorch e ``CircuitQNN``
ko_kr: PyTorch와 ``CircuitQNN`` 을 이용한 분류
pt_un: Classificação com PyTorch e ``CircuitQNN``
ru_ru: Классификация с PyTorch и ``CircuitQNN``
ta_in: PyTorch மற்றும் ``CircuitQNN`` உடன் வகைப்பாடு
vi_vn: Phân loại với PyTorch và ``CircuitQNN``
zh_tw: 使用 PyTorch 及 ``CircuitQNN`` 進行分類

source: `Regression <#2.-Regression>`__
bn_bn: `রিগ্রেশন <#2.-Regression>`__
fr_fr: `Régression <#2.-Regression>`__
hi_in: `प्रतिगमन <#2.-Regression>`__
it_it: `Regressione <#2.-Regression>`__
ko_kr: `회귀 <#2.-Regression>`__
pt_un: `Regressão <#2.-Regression>`__
ru_ru: `Регрессия <#2.-Regression>`__
ta_in: `பின்னடைவு <#2.-Regression>`__
vi_vn: `Hồi quy <#2.-Regression>`__
zh_tw: `迴歸 <#2.-Regression>`__

source: Regression with PyTorch and ``OpflowQNN``
bn_bn: PyTorch এবং ``OpflowQNN`` দ্বারা রিগ্রেশন
fr_fr: Régression avec ``OpflowQNN``
hi_in: PyTorch और ``OpflowQNN`` के साथ प्रतिगमन
it_it: Regressione con PyTorch e ``OpflowQNN``
ko_kr: PyTorch와 ``OpflowQNN`` 을 통한 회귀
pt_un: Regressão com PyTorch e ``OpflowQNN``
ru_ru: Регрессия с PyTorch и ``OpflowQNN``
ta_in: PyTorch மற்றும் ``OpflowQNN`` உடன் பின்னடைவு
vi_vn: Hồi quy với PyTorch và ``OpflowQNN``
zh_tw: 使用PyTorch 與 ``OpflowQNN`` 進行迴歸

source: `Part 2: MNIST Classification, Hybrid QNNs <#Part-2:-MNIST-Classification,-Hybrid-QNNs>`__
fr_fr: `Partie 2: Classification MNIST, QNNs hybrides <#Part-2: -MNIST-Classification>`__
hi_in: `भाग 2: MNIST वर्गीकरण, हाइब्रिड QNNs <#Part-2:-MNIST-Classification,-Hybrid-QNNs>`__
it_it: `Parte 2: Classificazione su MNIST, QNNs Ibride <#Part-2:-MNIST-Classification,-Hybrid-QNNs>`__
ko_kr: `Part 2: MNIST 분류, 하이브리드 QNN <#Part-2:-MNIST-Classification,-Hybrid-QNNs>`__
pt_un: `Parte 2: Classificação MNIST, QNNs Híbrido <#Part-2:-MNIST-Classification,-Hybrid-QNNs>`__
ru_ru: `Часть 2: Классификация MNIST, гибридные QNNs <#Part-2:-MNIST-Classification,-Hybrid-QNNs>`__
ta_in: `பகுதி 2: MNIST வகைப்பாடு, கலப்பின QNN கள் <#Part-2:-MNIST-Classification,-Hybrid-QNNs>`__
vi_vn: `Part 2: Phân loại MNIST, Hybrid QNNs <#Part-2:-MNIST-Classification,-Hybrid-QNNs>`__
zh_tw: `第 2 部分：MNIST 分類，混合 QNN<#Part-2:-MNIST-Classification,-Hybrid-QNNs>`__

source: The second part of this tutorial illustrates how to embed a (Quantum) ``NeuralNetwork`` into a target PyTorch workflow (in this case, a typical CNN architecture) to classify MNIST data in a hybrid quantum-classical manner.
bn_bn: এই পাঠসমূহের দ্বিতীয় ভাগে PyTorch কর্মধারায় (কোয়ান্টাম) ``NeuralNetwork`` বসিয়ে MNIST থেকে নেওয়া তথ্য দোআঁশলা কোয়ান্টাম - ক্লাসিক্যাল পদ্ধতি দিয়ে শ্রেণীবদ্ধ কিভাবে করা যেতে পারে সেটা দেখানো হয়েছে। এই ক্ষেত্রে একটি সাধারণ CNN (বিভ্রান্তিকর নিউরাল নেটওয়ার্ক) ব্যবহার করা হয়েছে।
fr_fr: La seconde partie de ce tutoriel montre comment intégrer un ``NeuralNetwork`` (Quantum) dans un workflow PyTorch cible (dans ce cas, une architecture typique de CNN) pour classer les données MNIST d'une manière hybride quantique-classique.
hi_in: इस ट्यूटोरियल का दूसरा भाग बताता है कि हाइब्रिड क्वांटम-शास्त्रीय तरीके से MNIST डेटा को वर्गीकृत करने के लिए एक (क्वांटम) ``न्यूरलनेटवर्क`` को लक्ष्य PyTorch वर्कफ़्लो (इस मामले में, एक विशिष्ट CNN आर्किटेक्चर) में कैसे एम्बेड किया जाए।
it_it: La seconda parte di questo tutorial mostra come incorporare una (Quantum) ``NeuralNetwork`` in un flusso di lavoro specifico di PyTorch (in questo caso una tipica architettura di CNN) al il fine di classificare i dati MNIST in modalità ibrida quantistica-classica.
ko_kr: 이 튜토리얼의 두 번째 부분에서는 하이브리드 양자-고전 방식으로 MNIST 데이터를 분류하기 위해 (이 경우에는 전형적인 CNN 아키텍처인) 대상 PyTorch 워크플로에 (양자) ``NeuralNetwork`` 를 삽입하는 방법을 설명한다.
pt_un: A segunda parte deste tutorial ilustra como embutir uma ``NeuralNetwork`` (Quântico) em um fluxo de trabalho alvo PyTorch (Neste caso, uma arquitetura típica CNN) para classificar dados MNIST de uma maneira híbrida quântica-clássica.
ru_ru: Вторая часть этого урока показывает, как встроить (квантовую) ``NeuralNetwork`` в целевой рабочий процесс PyTorch (в данном случае, типичную архитектуру CNN) для классификации данных MNIST гибридным квантово-классическим способом.
ta_in: இந்த பயிற்சிகளின் இரண்டாம் பாகம் ஒரு (குவாண்டம்) ``நியூரல்நெட்வொர்க்`` ஐ ஒரு இலக்கு PyTorch பணிப்பாய்வு (இந்த வழக்கில், ஒரு பொதுவான CNN கட்டமைப்பு) ஒரு கலப்பின குவாண்டம்-கிளாசிக்கல் முறையில் MNIST தரவை வகைப்படுத்த விளக்குகிறது.
vi_vn: Phần thứ hai của hướng dẫn này minh họa cách nhúng một ``NeuralNetwork`` (Lượng tử) vào một quy trình làm việc PyTorch mục tiêu (trong trường hợp này là kiến trúc CNN điển hình) để phân loại dữ liệu MNIST theo cách lai cổ điển-lượng tử.
zh_tw: 在教程的第二部分說明如何將（Quantum） ``NeuralNetwork`` 嵌入目標 PyTorch 工作流程（在此案例中，是典型的 CNN 架構），以混合式量子古典方式分類 MNIST 數據。

source: Part 1: Simple Classification & Regression
bn_bn: পর্ব 1: সরল শ্রেণিবিন্যাসকরণ (ক্লাসিফিকেশন) ও রিগ্রেশন
fr_fr: Partie 1: Classification simple et régression
hi_in: भाग 1: सरल वर्गीकरण एवं प्रतिगमन
it_it: Parte 1: Semplice Classificazione & Regressione
ko_kr: 파트 1: 단순 분류 및 회귀
pt_un: Parte 1: Classificação e regressão simples
ru_ru: Часть 1: Простая классификация и регрессия
ta_in: பகுதி 1: எளிய வகைப்பாடு மற்றும் பின்னடைவு
vi_vn: Phần 1: Phân loại đơn giản và Hồi quy
zh_tw: 第一部分：簡單分類與迴歸

source: 1. Classification
bn_bn: 1. শ্রেণিবিভাগ (ক্লাসিফিকেশন)
hi_in: 1. वर्गीकरण
it_it: 1. Classificazione
ko_kr: 1. 분류
pt_un: 1. Classificação
ru_ru: 1. Классификация
ta_in: 1. வகைப்பாடு
vi_vn: 1. Phân loại
zh_tw: 1. 分類

source: First, we show how ``TorchConnector`` allows to train a Quantum ``NeuralNetwork`` to solve a classification tasks using PyTorch’s automatic differentiation engine. In order to illustrate this, we will perform **binary classification** on a randomly generated dataset.
bn_bn: প্রথমত কিভাবে PyTorch - এর স্বয়ংক্রিয় বিভাজন যন্ত্র ব্যবহার করে ``TorchConnector`` একটি কোয়ান্টাম ``NeuralNetwork`` দ্বারা শ্রেণিবিন্যাসকরণ করতে সাহায্য করে সেটা আমরা দেখিয়েছি। উদাহরণ হিসাবে আমরা এখানে একটি যথেচ্ছভাবে বানানো ডেটাসেটের ওপরে দুইভাগবিশিষ্ট / দ্বিমূল শ্রেণীবিন্যাস করেছি।
fr_fr: Tout d'abord, nous montrons comment ``TorchConnector`` permet de former Quantum ``NeuralNetwork`` pour résoudre une tâche de classification à l'aide du moteur de différenciation automatique de PyTorch. Pour illustrer cela, nous allons effectuer une **classification binaire** sur un jeu de données généré de façon aléatoire.
hi_in: सबसे पहले, हम दिखाते हैं कि कैसे ``TorchConnector`` क्वांटम ``NeuralNetwork`` को प्रशिक्षित करने की अनुमति देता है ताकि PyTorch के स्वचालित विभेदन इंजन का उपयोग करके वर्गीकरण कार्यों को हल किया जा सके। इसे स्पष्ट करने के लिए, हम बेतरतीब ढंग से उत्पन्न डेटासेट पर **binary classification** करेंगे।
it_it: Per prima cosa, mostriamo come ``TorchConnector`` permetta di allenare una Quantum ``NeuralNetwork`` per risolvere i compiti di classificazione usando il motore di differenziazione automatica in PyTorch. Per illustrare ciò, eseguiremo una **classificazione binaria** su un dataset generato in modo casuale.
ko_kr: 먼저, 우리는 ``TorchConnector`` 가 PyTorch의 자동 분화엔진을 사용하여 분류 작업을 해결하기 위해 양자 ``NeuralNetwork`` 를 훈련시키는 방법을 설명한다. 이를 설명하기 위해 무작위로 생성된 데이터 세트에 **이진 분류** 를 수행한다.
pt_un: Primeiro, nós mostramos como o ``TorchConnector`` permite treinar uma ``NeuralNetwork`` Quântica para resolver tarefas de classificação usando sistema de diferenciação automática do PyTorch. Em ordem de ilustrar isso, nós vamos executar **classificação binária** em um conjunto de dados gerado randomicamente.
ru_ru: Сначала мы покажем, как ``TorchConnector'' позволяет обучить Quantum ``NeuralNetwork`` для решения задач классификации с помощью механизма автоматического дифференцирования PyTorch. Чтобы проиллюстрировать это, мы выполним **бинарную классификацию** на случайно сгенерированном наборе данных.
ta_in: முதலில், ``TorchConnector`` ஒரு குவாண்டம் ``NeuralNetwork`` ஐ எவ்வாறு பயிற்சி அளிக்க அனுமதிக்கிறது என்பதை PyTorch இன் தானியங்கி வேறுபாடு இயந்திரத்தைப் பயன்படுத்தி ஒரு வகைப்படுத்தல் பணிகளைத் தீர்க்க உதவுகிறது. இதை விளக்கும் பொருட்டு, **binary classification** தோராயமாக உருவாக்கப்பட்ட தரவுத்தொகுப்பில் செய்வோம்.
vi_vn: Đầu tiên, chúng tôi chỉ ra cách mà ``TorchConnector`` cho phép đào tạo một ``NeuralNetwork`` lượng tử để giải quyết các nhiệm vụ phân loại bằng cách sử dụng công cụ phân biệt tự động của PyTorch. Để minh họa cho điều này, chúng tôi sẽ thực hiện **phân loại nhị phân** trên một tập dữ liệu được tạo ngẫu nhiên.
zh_tw: 首先，我們展示了``TorchConnector``如何使用 PyTorch 的自動區分引擎來訓練量子``NeuralNetwork``來解決分類任務。為了說明這一點，我們會準備一個隨機生成資料集的**binary classification**

source: A. Classification with PyTorch and ``OpflowQNN``
bn_bn: A. PyTorch এবং ``OpflowQNN`` দ্বারা শ্রেণিবিন্যাসকরণ (ক্লাসিফিকেশন)
fr_fr: A. Classification avec PyTorch et l' ``OpflowQNN``
hi_in: A. PyTorch और ``OpflowQNN`` के साथ वर्गीकरण
it_it: A. Classificazione con PyTorch e ``OpflowQNN``
ko_kr: A. PyTorch와 ``OpflowQNN`` 을 이용한 분류
pt_un: A. Classificação com PyTorch e ``OpflowQNN``
ru_ru: A. Классификация с PyTorch и ``OpflowQNN``
ta_in: A. PyTorch மற்றும் ``OpflowQNN`` உடன் வகைப்பாடு
vi_vn: A. Phân loại với PyTorch và ``OpflowQNN``
zh_tw: A. 使用 PyTorch 及 ``OpflowQNN`` 進行分類

source: Linking an ``OpflowQNN`` to PyTorch is relatively straightforward. Here we illustrate this using the ``TwoLayerQNN``, a sub-case of ``OpflowQNN`` introduced in previous tutorials.
bn_bn: PyTorch এর সাথে একটি ``OpflowQNN`` লিঙ্ক করা তুলনামূলকভাবে সহজবোধ্য। এখানে আমরা ``TwoLayerQNN``, পূর্ববর্তী পাঠসমূহে (টিউটোরিয়ালস) ``OpflowQNN`` এর একটি সাব-কেস ব্যবহার করে এটি ব্যাখ্যা করেছি।
fr_fr: Lier un ``OpflowQNN`` à PyTorch est relativement simple. Ici, nous l'illustrons en utilisant le ``TwoLayerQNN``, un sous-cas de ``OpflowQNN`` introduit dans des tutoriels précédents.
hi_in: एक ``OpflowQNN`` को PyTorch से जोड़ना अपेक्षाकृत सरल है। यहां हम इसे ``TwoLayerQNN``, ``OpflowQNN`` का एक उप-मामला जो पिछले ट्यूटोरियल में पेश किया गया था, का उपयोग करते हुए स्पष्ट करते हैं।
it_it: Collegare una ``OpflowQNN`` a PyTorch è relativamente semplice. Qui lo illustriamo usando la ``TwoLayerQNN``, un caso minore delle ``OpflowQNN`` introdotto nei tutorial precedenti.
ko_kr: ``OpflowQNN`` 을 PyTorch로 연결하는 것은 비교적 간단하다. 여기에서는 이전 튜토리얼에서 소개한 ``OpflowQNN`` 의 서브 케이스인 ``TwoLayerQNN``을 사용하여 이를 설명한다.
pt_un: Ligando um ``OpflowQNN`` no PyTorch é relativamente simples. Aqui, ilustramos isto usando o ``TwoLayerQNN``, um sub-caso do ``OpflowQNN`` introduzido em tutoriais passados.
ru_ru: Привязать ``OpflowQNN`` к PyTorch относительно просто. Здесь мы проиллюстрируем это на примере ``TwoLayerQNN``, подслучая ``OpflowQNN``, представленного в предыдущих уроках.
ta_in: ஒரு ``OpflowQNN`` ஐ PyTorch உடன் இணைப்பது ஒப்பீட்டளவில் நேரடியானது. முந்தைய பயிற்சிகளில் அறிமுகப்படுத்தப்பட்ட ``OpflowQNN`` இன் துணை வழக்கு ``TwoLayerQNN`` ஐப் பயன்படுத்தி இங்கே விளக்குகிறோம்.
vi_vn: Liên kết một ``OpflowQNN`` với PyTorch tương đối đơn giản. Ở đây chúng tôi minh họa điều này bằng cách sử dụng ``TwoLayerQNN``, một trường hợp con của `` OpflowQNN '' đã được giới thiệu trong các hướng dẫn trước.
zh_tw: 將 ``OpflowQNN``鏈接到 PyTorch 相對容易。本節使用“TwoLayerQNN”，它是之前教程中介紹的“OpflowQNN”的一個子案例。

source: Optimizer
bn_bn: অনুকূলায়ক
fr_fr: Optimiseur
hi_in: आप्टमाइज़र
ko_kr: 최적화 도구
pt_un: Otimizador
ru_ru: Оптимизатор
ta_in: ஆப்டிமைசெர்
vi_vn: Trình tối ưu
