Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/05_torch_connector.po
Languages: bn_bn, fr_fr, hi_in, it_it, ko_kr, pt_un, ru_ru, ta_in, vi_vn, zh_tw

source: The choice of optimizer for training any machine learning model can be crucial in determining the success of our training’s outcome. When using ``TorchConnector``, we get access to all of the optimizer algorithms defined in the [``torch.optim``] package (`link <https://pytorch.org/docs/stable/optim.html>`__). Some of the most famous algorithms used in popular machine learning architectures include *Adam*, *SGD*, or *Adagrad*. However, for this tutorial we will be using the L-BFGS algorithm (``torch.optim.LBFGS``), one of the most well know second-order optimization algorithms for numerical optimization.
bn_bn: যে কোন মেশিন লার্নিং মডেলকে প্রশিক্ষণের জন্য অনুকূলায়ক -এর (অপটিমাইজার) পছন্দ আমাদের প্রশিক্ষণের ফলাফলের সাফল্য নির্ধারণে গুরুত্বপূর্ণ হতে পারে। ``TorchConnector`` ব্যবহার করার সময়, আমরা [``torch.optim``] প্যাকেজে (`link <https://pytorch.org/docs/stable/optim.html>`__) সংজ্ঞায়িত সমস্ত অপটিমাইজার অ্যালগরিদমগুলিতে অ্যাক্সেস পাই। জনপ্রিয় মেশিন লার্নিং আর্কিটেকচারে ব্যবহৃত কিছু বিখ্যাত অ্যালগরিদমের মধ্যে রয়েছে *অ্যাডাম *, *এসজিডি *, অথবা *অ্যাডাগ্রেড *(Adagrad)। যাইহোক, এই টিউটোরিয়ালের জন্য আমরা L-BFGS অ্যালগরিদম (``torch.optim.LBFGS``) ব্যবহার করব, সংখ্যাসূচক অপ্টিমাইজেশনের জন্য সবচেয়ে ভালোভাবে পরিচিত দ্বিতীয়-অর্ডার অনুকূলকরণ (অপটিমাইজার) অ্যালগরিদম।
fr_fr: Le choix de l'optimiseur pour la formation de n'importe quel modèle d'apprentissage automatique peut être crucial pour déterminer le succès du résultat de notre formation. Lors de l'utilisation de ``TorchConnector``, nous avons accès à tous les algorithmes de l'optimiseur définis dans le paquet [``torch.optim``] (`lien <https://pytorch.org/docs/stable/optim.html>` __). Parmi les algorithmes les plus célèbres utilisés dans les architectures d'apprentissage en machine populaires figurent *Adam*, *SGD* ou *Adagrad *. Cependant, pour ce tutoriel, nous utiliserons l'algorithme L-BFGS (``torch.optim.LBFGS``), l'un des algorithmes d'optimisation de second ordre les plus connu pour l'optimisation numérique.
hi_in: किसी भी मशीन लर्निंग मॉडल के प्रशिक्षण के लिए अनुकूलक का चुनाव हमारे प्रशिक्षण के परिणाम की सफलता को निर्धारित करने में महत्वपूर्ण हो सकता है। ``TorchConnector`` का उपयोग करते समय, हमें [``torch.optim``] पैकेज (`link <https://pytorch.org/docs/stable/optim.html> `__)में परिभाषित सभी अनुकूलक एल्गोरिदम तक पहुंच प्राप्त होती है। लोकप्रिय मशीन लर्निंग आर्किटेक्चर में उपयोग किए जाने वाले कुछ सबसे प्रसिद्ध एल्गोरिदम में *Adam*, *SGD*, या *Adagrad* शामिल हैं। हालाँकि, इस ट्यूटोरियल के लिए हम L-BFGS एल्गोरिथम (``torch.optim.LBFGS``) का उपयोग करेंगे, जो संख्यात्मक अनुकूलन के लिए सबसे अच्छी तरह से ज्ञात दूसरे क्रम के अनुकूलन एल्गोरिदम में से एक है।
it_it: La scelta dell'optimizer può essere cruciale per il successo dell'addestramento di qualsiasi modello di machine learning. Quando usiamo ``TorchConnector``, abbiamo accesso a tutti gli algoritmi di ottimizzazione definiti nel package [``torch.optim``] (`link <https://pytorch.org/docs/stable/optim.html>`__). Alcuni degli algoritmi più famosi usati in popolari architetture di machine learning includono *Adam*, *SGD*, o *Adagrad*. Ad ogni modo, in questo tutorial useremo l'algoritmo L-BFGS (``torch.optim.LBFGS``), che è uno uno dei più conosciuti algoritmi di ottimizzazione di secondo-ordine per compiti di ottimizzazione numerica.
ko_kr: 시스템 학습 모델을 훈련하기 위한 최적화 프로그램을 선택하는 것은 훈련 결과의 성공 여부를 결정하는 데 중요할 수 있다. ``TorchConnector`` 를 사용할 때에는 [``torch.optim``] 패키지 (`link <https://pytorch.org/docs/stable/optim.html>`__) 에서 정의한 모든 최적화 프로그램 알고리즘에 액세스할 수 있다. 인기있는 기계 학습 아키텍처에서 사용되는 가장 유명한 알고리즘들에는 *Adam*, *SGD*, 또는 *Adagrad* 이 포함된다. 그러나 이 튜토리얼에서는 수치 최적화를 위한 가장 잘 알려진 2차 최적화 알고리즘 중 하나인 L-BFGS 알고리즘 (``torch.optim.LBFGS``) 을 사용하게 된다.
pt_un: A escolha do otimizador para treinar qualquer modelo de machine learning pode ser crucial em determinar o sucesso do nosso resultado de treinamento. Quando usamos o ``TorchConnector``, nós ganhamos acesso a todos os algoritmos otimizadores definidos no pacote [``torch.optim`` (`link <https://pytorch.org/docs/stable/optim.html>`__). Alguns dos algoritmos mais famosos usados em populares arquiteturas de machine learning, incluindo *Adam*, *SGD*, ou *Adagrad*. Contudo, para este tutorial vamos usar o algoritmo L-BFGS (``torch.optim.LBFGS``), um dos mais bem conhecidos algoritmo otimizador de segunda-ordem para otimização numérica.
ru_ru: Выбор оптимизатора для обучения любой модели машинного обучения может иметь решающее значение для определения успеха нашего обучения. При использовании ``TorchConnector``, мы получаем доступ ко всем алгоритмам оптимизатора, определенным в пакете [``torch.optim``] (`ссылка на источник <https://pytorch.org/docs/stable/optim.html>`__). Некоторые наиболее известные алгоритмы, используемые в популярных архитектурах машинного обучения, включают *Adam*, *SGD*, или *Adagrad*. Однако, для этого урока мы будем использовать алгоритм L-BFGS (``torch.optim.LBFGS``), один из наиболее известных алгоритмов оптимизации второго порядка для числовой оптимизации.
ta_in: எந்த இயந்திர கற்றல் மாதிரியையும் பயிற்றுவிப்பதற்கான ஆப்டிமைசரின் தேர்வு எங்கள் பயிற்சியின் முடிவின் வெற்றியை தீர்மானிப்பதில் முக்கியமானதாக இருக்கும். ``TorchConnector`` ஐப் பயன்படுத்தும் போது, [``torch.optim``] தொகுப்பில் (`இணைப்பு <https://pytorch.org/docs/stable/optim.html>`__) வரையறுக்கப்பட்ட அனைத்து ஆப்டிமைசர் வழிமுறைகளையும் அணுகலாம். பிரபலமான இயந்திர கற்றல் கட்டமைப்புகளில் பயன்படுத்தப்படும் மிகவும் பிரபலமான வழிமுறைகளில் *Adam*, *SDG*, அல்லது *Adagrad* ஆகியவை அடங்கும். எவ்வாறாயினும், இந்த டுடோரியலுக்கு நாம் L-BFGS அல்காரிதம் (``torch.optim.LBFGS``) ஐப் பயன்படுத்துவோம்.
vi_vn: Việc lựa chọn trình tối ưu hóa để đào tạo bất kỳ mô hình học máy nào có thể rất quan trọng trong việc xác định sự thành công của kết quả đào tạo. Khi sử dụng ``TorchConnector``, chúng tôi có quyền truy cập vào tất cả các thuật toán của trình tối ưu hóa được xác định trong gói [``torch.optim``] (`link <https://pytorch.org/docs/stable/optim.html>`__). Một số thuật toán nổi tiếng nhất được sử dụng trong kiến trúc học máy thông dụng bao gồm *Adam*, *SGD*, hoặc *Adagrad*. Tuy nhiên, đối với hướng dẫn này, chúng tôi sẽ sử dụng thuật toán L-BFGS (``torch.optim.LBFGS``), một trong những thuật toán tối ưu hóa bậc hai được biết đến nhiều nhất để tối ưu hóa số.
zh_tw: 選擇用於訓練任何機器學習模型的優化器對於確定學習結果非常重要。使用``TorchConnector``時，在[``torch.optim``]套件中（`link <https://pytorch.org/docs/stable/optim.html>` __）我們可以使用所有優化器演算法。常見機器學習架構中最著名的演算法有 * Adam *、* SGD * 或 * Adagrad *。但是，本教程使用 L-BFGS 演算法（``torch.optim.LBFGS``）。它是最著名的用於數值優化的二階優化演算法之一。

source: Loss Function
bn_bn: হ্রাস ফাংশন (Loss Function)
fr_fr: Fonction de perte
hi_in: लॉस फंकशन
it_it: Funzione di Costo
ko_kr: 손실 함수
pt_un: Funçao de Perda
ru_ru: Функция потерь
vi_vn: Hàm mất mát
zh_tw: 損失函數

source: As for the loss function, we can also take advantage of PyTorch’s pre-defined modules from ``torch.nn``, such as the `Cross-Entropy <https://pytorch.org/docs/stable/generated/torch.nn.CrossEntropyLoss.html>`__ or `Mean Squared Error <https://pytorch.org/docs/stable/generated/torch.nn.MSELoss.html>`__ losses.
bn_bn: হ্রাস (লস) ফাংশনের ক্ষেত্রে, আমরা ``torch.nn`` থেকে PyTorch- এর পূর্বনির্ধারিত মডিউলগুলির সুবিধা নিতে পারি, যেমন `Cross-Entropy <https://pytorch.org/docs/stable/generated/torch.nn.CrossEntropyLoss.html>`__ অথবা `Mean Squared Error <https://pytorch.org/docs/stable/generated/torch.nn.MSELoss.html>`__ হ্রাস।
fr_fr: Quant à la fonction de perte, nous pouvons également tirer profit des modules prédéfinis de PyTorch de ``torch.nn``, tels que la `Cross-Entropy <https://pytorch.org/docs/stable/generated/torch.nn.CrossEntropyLoss.html>` __ ou ` Mean Squared Error <https://pytorch.org/docs/stable/generated/torch.nn.MSELoss.html>`__ .
hi_in: हानि फ़ंक्शन के लिए, हम `torch.nn` से PyTorch के पूर्व-निर्धारित मॉड्यूल का भी लाभ उठा सकते हैं, जैसे कि `Cross-Entropy <https://pytorch.org/docs/stable/generated/torch.nn.CrossEntropyLoss.html>`__ या `माध्य चुकता त्रुटि <https://pytorch.org/docs/stable/generated/torch.nn.MSELoss.html>`__ हानियाँ।
it_it: Per quanto riguarda la funzioni di costo (loss function), possiamo sfruttare i moduli predefiniti di PyTorch che si posso trovare in ``torch.nn``, come ad esempio le loss `Cross-Entropy <https://pytorch.org/docs/stable/generated/torch.nn.CrossEntropyLoss.html>`__ o `Mean Squared Error <https://pytorch.org/docs/stable/generated/torch.nn.MSELoss.html>`__.
ko_kr: 손실 함수에 대해서는 `크로스 엔트로피<https://pytorch.org/docs/stable/generated/torch.nn.CrossEntropyLoss.html>` 또는 `평균 제곱 오차 <https://pytorch.org/docs/stable/generated/torch.nn.MSELoss.html>`__ 손실과 같은 PyTorch ``torch.nn`` 의 사전 정의된 모듈을 이용할 수도 있다.
pt_un: Quanto a função de perda, também podemos tirar proveito dos módulos predefinidos do PyTorch do ``torch.nn``, como o `Cross-Entropy <https://pytorch.org/docs/stable/generated/torch.nn.CrossEntropyLoss.html>`__ ou `Mean Squared Error <https://pytorch.org/docs/stable/generated/torch.nn.MSELoss.html>`__.
ru_ru: Что касается функции потерь, то мы также можем воспользоваться предопределенными модулями PyTorch с ``torch.nn``, например, `Cross-Entropy <https://pytorch.org/docs/stable/generated/torch.nn.CrossEntropyLoss.html>`__ или `Mean Squared Error <https://pytorch.org/docs/stable/generated/torch.nn.MSELoss.html>`__.
ta_in: Loss function பொறுத்தவரை, ``டார்ச்.என்என்`` இலிருந்து பைடார்ச்சின் முன் வரையறுக்கப்பட்ட தொகுதிகளையும் நாம் பயன்படுத்திக் கொள்ளலாம், அதாவது, `கிராஸ்-என்ட்ரோபி <https://pytorch.org/docs/stable/generated/torch. nn.CrossEntropyLoss.html>`__ அல்லது `சராசரி சதுர பிழை <https://pytorch.org/docs/stable/generated/torch.nn.MSELoss.html>`__ இழப்புகள்.
vi_vn: Đối với loss function (hàm mất mát), chúng tôi cũng có thể tận dụng các module được xác định trước của PyTorch từ ``torch.nn``, chẳng hạn như `Cross-Entropy <https://pytorch.org/docs/stable/generated/torch.nn.CrossEntropyLoss.html>`__ hoặc `Mean Squared Error <https://pytorch.org/docs/stable/generated/torch.nn.MSELoss.html>`__.
zh_tw: 至於損失函數，我們也可以從 ` `torch. nn``中利用 PyTorch的預先定義模組，例如 `Cross-Entropy <https://pytorch.org/docs/stable/generated/torch.nn.CrossEntropyLoss.html>`__ 或`Mean Squared Error <https://pytorch.org/docs/stable/generated/torch.nn.MSELoss.html>`__ losses.

source: **💡 Clarification :** In classical machine learning, the general rule of thumb is to apply a Cross-Entropy loss to classification tasks, and MSE loss to regression tasks. However, this recommendation is given under the assumption that the output of the classification network is a class probability value in the [0,1] range (usually this is achieved through a Softmax layer). Because the following example for ``TwoLayerQNN`` does not include such layer, and we don’t apply any mapping to the output (the following section shows an example of application of parity mapping with ``CircuitQNNs``), the QNN’s output can take any value in the range [-1,1]. In case you were wondering, this is the reason why this particular example uses MSELoss for classification despite it not being the norm (but we encourage you to experiment with different loss functions and see how they can impact training results).
bn_bn: **💡 স্পষ্টীকরণ :** সাধারণত প্রথাগত (ক্লাসিক্যাল) মেশিন লার্নিং- এ আমরা শ্রেণিবিন্যাসকরণ (ক্লাসিফিকেশন) এর সময় ক্রস-এনট্রপি ক্ষতিমাপ এবং রিগ্রেশনের ক্ষেত্রে ক্ষতির দ্বিঘাত রাশিতে উন্নীতকরণ করা গড় ক্ষতিমাপ হিসাবে ব্যবহার করি। কিন্তু এইটা এই ভেবে করা হয়ে যে শ্রেণিবিন্যাসকরণ (ক্লাসিফিকেশন) নেটওয়ার্কের আউটপুট [০, ১] এর মধ্যে বিভাগের সম্ভাবনার হয়ে (সফটমাক্স স্তর এর জন্যে)। ``TwoLayerQNN`` এর ক্ষেত্রে এরম স্তর না থাকায় এবং আউটপুটের ওপরে কোনো রকম ম্যাপিং (চিত্রায়ন) না করে থাকায়(``CircuitQNNs`` এর সাথে সমতা ম্যাপিং (চিত্রায়ন) ব্যবহার করবে উদাহরণ পরের ভাগে দেখানো রয়েছে) কোয়ান্টাম নিউরাল নেটওয়ার্ক এর আউটপুট [-১, ১] এর মধ্যে থাকবে। এই জন্যেই আমরা এখানে ক্ষতির দ্বিঘাত রাশিতে উন্নীতকরণ করা গড় ক্ষতিমাপ (MSELoss) ব্যবহার করেছি। কিন্তু আমরা পাঠকদের বিভিন্ন ক্ষতির ফাংশন নিয়ে পরীক্ষা -নিরীক্ষা করে দেখতে বলবো এবং সেই খতিমাপ ব্যবহার প্রশিক্ষণের ফলাফলকে কিভাবে প্রভাবিত করতে পারে তা দেখতে বলবো।
fr_fr: **💡 Clarification: ** Dans l'apprentissage machine automatique, la règle générale consiste à appliquer une perte inter-entropie aux tâches de classification, et la perte MSE aux tâches de régression. Cependant, cette recommandation est donnée en partant de l'hypothèse que la sortie du réseau de classification est une valeur de probabilité dans la gamme [0, 1] (ce qui est généralement obtenu par le biais d'une couche de Softmax). Etant donné que l'exemple suivant pour ``TwoLayerQNN`` n'inclut pas cette couche, et que nous n'appliquons aucun mappage à la sortie (la section suivante montre un exemple d'application du mappage de parité avec ``CircuitQNNs``), la sortie QNN peut prendre n'importe quelle valeur dans la plage [-1,1]. Au cas où vous vous poseriez la question, c'est la raison pour laquelle cet exemple particulier utilise MSELoss pour la classification alors qu'il n'est pas la norme (mais nous vous encourageons à expérimenter différentes fonctions de perte et voir comment elles peuvent avoir un impact sur les résultats de l'entraînement).
hi_in: **💡 स्पष्टीकरण:** क्लासिकल मशीन लर्निंग में, सामान्य नियम यह है कि वर्गीकरण कार्यों के लिए क्रॉस-एंट्रॉपी हानि, और प्रतिगमन कार्यों के लिए एमएसई हानि को लागू किया जाए। हालांकि, यह सिफारिश इस धारणा के तहत दी गई है कि वर्गीकरण नेटवर्क का आउटपुट [0,1] श्रेणी में एक वर्ग संभाव्यता मान है (आमतौर पर यह सॉफ्टमैक्स परत के माध्यम से प्राप्त किया जाता है)। क्योंकि ``TwoLayerQNN`` के लिए निम्न उदाहरण में ऐसी परत शामिल नहीं है, और हम आउटपुट पर कोई मैपिंग लागू नहीं करते हैं (निम्न अनुभाग ``CircuitQNNs` के साथ समता मानचित्रण के अनुप्रयोग का एक उदाहरण दिखाता है), QNN का आउटपुट [-1,1] की सीमा में कोई भी मान ले सकते हैं। यदि आप सोच रहे थे, यही कारण है कि यह विशेष उदाहरण वर्गीकरण के लिए MSELoss का उपयोग करता है, जबकि यह मानक नहीं है (लेकिन हम आपको विभिन्न हानि कार्यों के साथ प्रयोग करने के लिए प्रोत्साहित करते हैं और देखें कि वे प्रशिक्षण परिणामों को कैसे प्रभावित कर सकते हैं)।
it_it: **💡 Chiarificazione :** Nel machine learning classico, in genere si utilizza la funzione di costo Cross-Entropy nel caso della classificazione, mentre la MSE nel caso della regressione. Tuttavia, questa raccomandazione assume che l'output della rete di classificazione sia una classe di probabilità con valori nel range [0, 1] (solitamente ottenuto tramite un layer Softmax). Poiché nell'esempio seguente per ``TwoLayerQNN`` non c'è questo layer e non applichiamo nessun mapping all'output ( la sezione successiva mostra una esempio di applicazione di un mapping di parità utilizzando ``CircuitQNNs``), l'output della QNN può assumere qualsiasi valore nel range [-1, 1]. In caso te lo stessi domandando, per quanto non sia la norma, è esattamente questa la ragione per cui la MSELoss viene utilizzata in questo esempio di classificazione (ma incoraggiamo a sperimentare con diverse funzioni di costo e vedere qual è l' impatto sui risultati sul training).
ko_kr: **💡 설명: ** 고전적인 머신러닝에서 일반적으로는 분류 작업에 교차 엔트로피 손실을 적용하고 MSE 손실을 회귀 작업에 적용한다. 그러나, 이것은 분류 네트워크의 출력이 [0, 1] 범위 내의 클래스 확률 값이라는 가정 하에 추천하는 사항이다 (보통 이것은 Softmax 층을 통해 달성된다). ``TwoLayerQNN`` 에 대한 다음 예제는 이러한 레이어를 포함하지 않고, 출력에 어떠한 매핑도 적용하지 않기 때문에 (다음 섹션에서는 ``CircuitQNNs`` 를 사용한 패리티 매핑을 적용한 예를 보여준다), QNN의 출력은 [-1, 1] 범위의 값을 취할 수 있다. 여러분이 궁금해할 경우를 대비해, 이것이 노름(norm) 이 아닌데도 불구하고 MSELoss를 사용하는 이유라는 것을 밝혀둔다 (하지만 우리는 당신이 다른 손실 함수를 사용하여 실험하고 훈련 결과에 어떤 영향을 미칠 수 있는지 알아보는 것을 권장한다).
pt_un: **💡 Esclarecimento :** Em um machine learning clássico, a regra geral é aplicar uma perda de entropia cruzada para classificar tarefas, e perda de MSE para regressão de tarefas. Contudo, esta recomendação é dada assumindo que a saída da rede de classificação é um valor de probabilidade de classe no intervalo de [0,1] (Geralmente isto se consegue por meio de uma camada Softmax). Porque o exemplo a seguir para ``TwoLayerQNN`` não inclui essa camada, e nós não aplicamos nenhum mapeamento para saída (A sessão a seguir apresenta um exemplo de aplicação de mapeamento de paridade com ``CircuitQNNs``), as saídas QNNs podem tomar qualquer valor no intervalo [-1,1]. Caso você esteja se perguntando, está é a razão pela qual este exemplo em particular usa MSELoss para classificação apesar de não ser uma norma (Mas nós encorajamos você a experimentar com diferentes funções de perda e ver como elas podem impactar nos resultados do treino).
ru_ru: **💡 Уточнение :** В процессе классического обучения общим правилом большого пальца является применение Cross-Entropy loss к задачам классификации, и MSE loss в регрессионных задачах. Однако, эта рекомендация приводится исходя из предположения о том, что результатом работы системы классификации является значение вероятности в диапазоне [0, 1] (обычно это достигается через слой Softmax). Поскольку следующий пример ``TwoLayerQN`` не включает такой слой, и мы не применяем никакие сопоставления с результатами (следующий раздел показывает пример приложения с parity mapping для ``CircuitQNs``), вывод QNN может принимать любое значение в диапазоне [-1,1]. Именно поэтому в данном примере используется MSELoss для классификации, несмотря на то, что она не является нормой (но мы рекомендуем вам экспериментировать с различными функциями потерь и посмотреть, как они могут повлиять на результаты обучения).
ta_in: **💡விளக்கம்:**, இந்த பரிந்துரை வகைப்படுத்தல் நெட்வொர்க்கின் வெளியீடு [0,1] வரம்பில் ஒரு வகுப்பு நிகழ்தகவு மதிப்பு என்ற அனுமானத்தின் கீழ் வழங்கப்படுகிறது (பொதுவாக இது ஒரு Softmax அடுக்கு மூலம் அடையப்படுகிறது). ``TwoLayerQNN`` க்கான பின்வரும் உதாரணம் அத்தகைய லேயரை உள்ளடக்கவில்லை, மேலும் வெளியீட்டில் எந்த மேப்பிங்கையும் நாங்கள் பயன்படுத்தவில்லை (பின்வரும் பிரிவு ``CircuitQNN`` உடன் சமநிலை மேப்பிங்கின் உதாரணத்தைக் காட்டுகிறது), QNN வெளியீடு வரம்பில் எந்த மதிப்பையும் எடுக்கலாம் [-1,1]. நீங்கள் ஆச்சரியப்படுகிறீர்கள் என்றால், இந்த குறிப்பிட்ட உதாரணம் MSELoss ஐ வகைப்படுத்தலுக்குப் பயன்படுத்துவதற்கு இது விதிமுறையாக இல்லாவிட்டாலும் (ஆனால் வெவ்வேறு இழப்புச் செயல்பாடுகளை பரிசோதிக்கவும், பயிற்சி முடிவுகளை எப்படி பாதிக்கலாம் என்பதைப் பார்க்கவும் நாங்கள் ஊக்குவிக்கிறோம்).
vi_vn: ** 💡 Làm rõ: ** Trong học máy cổ điển, nguyên tắc chung là áp dụng tổn thất Cross-Entropy cho các tác vụ phân loại và tổn thất MSE cho các tác vụ hồi quy. Tuy nhiên, lời khuyên này được đưa ra với giả định rằng đầu ra của mạng phân loại là một giá trị xác suất lớp trong phạm vi [0,1] (thường điều này đạt được thông qua một lớp Softmax). Vì ví dụ sau cho ``TwoLayerQNN`` không bao gồm lớp như vậy và chúng tôi không áp dụng bất kỳ ánh xạ nào cho đầu ra (phần sau trình bày một ví dụ về ứng dụng của ánh xạ chẵn lẻ với ``CircuitQNNs``), đầu ra của QNN có thể nhận bất kỳ giá trị nào trong khoảng [-1,1]. Trong trường hợp bạn thắc mắc, đây là lý do tại sao ví dụ cụ thể này sử dụng MSELoss để phân loại mặc dù nó không phải là chuẩn (nhưng chúng tôi khuyến khích bạn thử nghiệm với các hàm mất mát khác nhau và xem chúng có thể tác động như thế nào đến kết quả đào tạo).
zh_tw: ** 💡 說明：** 在古典機器學習中的一個常見經驗法則是將交叉熵損失應用於分類任務，將 MSE 損失應用於迴歸任務。但是，這個推薦是在假設分類網絡的輸出是[0, 1] 範圍內的類別概率值（通常通過Softmax層實現）。下面的``TwoLayerQNN`` 範例不包含這樣的層，也沒有任何對輸出應用映射（以下顯示了使用“CircuitQNNs”應用奇偶校驗映射的範例)。因此，QNN 的輸出可以取[-1,1] 範圍內的任何值。順便說一句，這就是我們在這個特定範例中使用 MSELoss 進行分類的原因，即使它並不是範數（但我們建議你去嘗試不同的損失函數以查看它們如何影響訓練結果）。

source: The red circles indicate wrongly classified data points.
bn_bn: লাল বৃত্তগুলি ভুলভাবে শ্রেণিবদ্ধ ডেটা পয়েন্ট নির্দেশ করছে।
fr_fr: Les cercles rouges indiquent des points de données mal classifiés.
hi_in: लाल घेरे गलत रूप से वर्गीकृत डेटा बिंदुओं को दर्शाते हैं।
it_it: I cerchi rossi indicano dei dati che sono stati classificati in modo errato.
ko_kr: 빨간색 원은 잘못 분류된 데이터 포인트들을 나타낸다.
pt_un: Os círculos vermelhos indicam pontos de dados classificados incorretamente.
ru_ru: Красными кружками отмечены неверно классифицированные данные.
ta_in: சிவப்பு வட்டங்கள் தவறாக வகைப்படுத்தப்பட்ட தரவு புள்ளிகளைக் குறிக்கின்றன.
vi_vn: Vòng tròn màu đỏ biểu thị các điểm dữ liệu bị phân loại sai.
zh_tw: 紅色圓圈表示錯誤的分類數據點。

source: B. Classification with PyTorch and ``CircuitQNN``
bn_bn: B. PyTorch এবং ``CircuitQNN`` এর সঙ্গে শ্রেণিবিন্যাসকরণ (ক্লাসিফিকেশন)
fr_fr: B. Classification avec PyTorch et le ``CircuitQNN``
hi_in: B. PyTorch और ``CircuitQNN`` के साथ वर्गीकरण
it_it: B. Classificazione con PyTorch e ``CircuitQNN``
ko_kr: B. Pytorch와 ``CircuitQNN`` 를 이용한 분류
pt_un: B. Classificação com PyTorch e ``CircuitQNN``
ru_ru: B. Классификация с PyTorch и ``CircuitQNN``
ta_in: B. PyTorch மற்றும் ``CircuitQNN`` உடன் வகைப்பாடு
vi_vn: B. Phân loại với PyTorch và ``CircuitQNN``
zh_tw: B. 使用 PyTorch 和 ` CircuitQNN`` 進行分類

source: Linking an ``CircuitQNN`` to PyTorch requires a bit more attention than ``OpflowQNN``. Without the correct setup, backpropagation is not possible.
bn_bn: PyTorch এর সাথে ``CircuitQNN`` যোগ করাটা ``OpflowQNN``- এর যোগ করা থেকে অনেকটা আলাদা। ঠিক করে যোগ না করলে পিছনের দিকে প্রচার করাটা (ব্যাকপ্রপাগেশন) সম্ভব হয়ে উঠবে না।
fr_fr: La liaison d'un ``CircuitQNN`` à PyTorch nécessite un peu plus d'attention que ``OpflowQNN``. Sans une configuration correcte, la rétropropagation n'est pas possible.
hi_in: एक ``CircuitQNN`` को PyTorch से जोड़ने के लिए ``OpflowQNN`` की तुलना में थोड़ा अधिक ध्यान देने की आवश्यकता है। सही सेटअप के बिना, बैकप्रोपेगेशन संभव नहीं है।
it_it: Collegare una ``CircuitQNN`` a PyTorch richiede un po' più di attenzione rispetto alle ``OpflowQNN``. Senza il setup corretto non sarà possibile la backpropagation.
ko_kr: ``CircuitQNN`` 을 PyTorch에 연결하는 것은 ``OpflowQNN`` 보다 좀 더 주의를 요하는 것이다. 정확한 설정이 없다면, 역전파는 불가능하다.
pt_un: Ligar o ``CircuitQNN`` ao PyTorch requer um pouco mais atenção que o ``OpflowQNN``. Sem as configurações corretas, retropropagação não é possível.
ru_ru: Связание ``CircuitQNNN`` с PyTorch требует немного больше внимания, чем ``OpflowQNN``. Без правильной настройки использование метода обратного распространения ошибки (backpropagation) невозможно.
ta_in: PyTorch உடன் ஒரு ``CircuitQNN`` ஐ இணைப்பதற்கு ``OpflowQNN`` ஐ விட சற்று அதிக கவனம் தேவை. சரியான அமைப்பு இல்லாமல், பின்னடைவு சாத்தியமில்லை.
vi_vn: Việc liên kết một ``CircuitQNN`` với PyTorch cần chú ý hơn một chút so với ``OpflowQNN``. Nếu không có thiết lập chính xác, giải thuật lan truyền ngược là không thể.
zh_tw: 將“CircuitQNN”鏈接到PyTorch需要比“OpflowQNN”更加小心。沒有正確的設置，反向傳播是不可能的。
