Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/06_torch_runtime.po
Languages: de_de, es_un, ja_jp, ko_kr, pt_un, ta_in

source: In the example, we use the following custom scoring function to calculate a score. The scoring function returns 1, if the trained model successfully classified the input. Otherwise, it returns 0. An overall average is calculated in ``score()`` in the end.
de_de: Im Beispiel wird die folgende benutzerdefinierte Scoring-Funktion verwendet, um eine Punktzahl zu berechnen. Die Punktestandfunktion gibt 1 zurück, wenn das trainierte Modell die Eingabe erfolgreich klassifiziert hat. Andernfalls gibt sie 0 zurück. Ein Gesamtdurchschnitt wird am Ende in ``score()`` berechnet.
es_un: En el ejemplo, usamos la siguiente función de puntuación personalizada para calcular una puntuación. La función de puntuación devuelve 1, si el modelo entrenado clasificó correctamente la entrada. De lo contrario, devuelve 0. Al final, se calcula un promedio general en ``score()``.
ja_jp: この例では、次のカスタムスコアリング関数を使用してスコアを計算します。トレーニングされたモデルが入力を正常に分類した場合、スコアリング関数は1を返します。それ以外の場合は0を返します。全体の平均は最終的に ``score()`` で計算されます。
ko_kr: 이 예제에서는 점수를 계산하기 위해 사용자 정의 점수 함수를 사용한다. 학습된 모델이 입력을 성공적으로 분류한 경우 점수 함수는 1을 반환하고, 그렇지 않으면 0을 반환한다. 전체 평균은 마지막에 ``score()``에서 계산된다.
pt_un: No exemplo, utilizamos a seguinte função personalizada para calcular uma pontuação. A função de pontuação retorna 1 caso o modelo treinado tenha classificado os dados de entrada corretamente. Do contrário, retorna 0. Uma média geral é calculada utilizando a ``score()`` ao final do processo.
ta_in: எடுத்துக்காட்டில், மதிப்பெண்ணைக் கணக்கிட பின்வரும் தனிப்பயன் ஸ்கோரிங் செயல்பாட்டைப் பயன்படுத்துகிறோம். பயிற்சியளிக்கப்பட்ட மாதிரி உள்ளீட்டை வெற்றிகரமாக வகைப்படுத்தினால், மதிப்பெண் செயல்பாடு 1ஐ வழங்கும். இல்லையெனில், அது 0 ஐ வழங்கும். ஒட்டுமொத்த சராசரியானது இறுதியில் ``score()`` இல் கணக்கிடப்படும்.

source: 3. How to use hooks in training
de_de: 3. Verwendung von Hooks im Training
es_un: 3. Cómo utilizar hooks en el entrenamiento
ja_jp: 3.トレーニングでフックを使用する方法
ko_kr: 3. 학습에 hook를 사용하는 방법
pt_un: 3. Como utilizar hooks no treinamento

source: Qiskit Machine Learning offers a base hook class, ``HookBase``. It is a base class for a hook that is a set of callback functions used in the training process. Users can implement their own hook classes from this base class to handle complicated callback processes. This structure provides high flexibility in the callback processes. Each hook can implement 6 methods, and each method is called before/after the corresponding processes during training. The way they are called is demonstrated in the following snippet:
de_de: Qiskit Machine Learning bietet eine Basisklasse, ``HookBase``. Es ist eine Basisklasse für einen Hook, der eine Reihe von Callback-Funktionen enthält, die im Trainingsprozess verwendet werden. Benutzer können ihre eigenen Hook Klassen aus dieser Basisklasse implementieren, um komplizierte Callback-Prozesse zu verwalten. Diese Struktur bietet dabei eine hohe Flexibilität. Jeder Hook kann 6 Methoden implementieren und jede Methode wird bei den entsprechenden Prozessen während des Trainings aufgerufen. Die Art und Weise, wie sie aufgerufen werden, wird im folgenden Snippet dargestellt:
es_un: Qiskit Machine Learning ofrece una clase de enlace (hook) base, ``HookBase``. Es una clase base para un hook que es un conjunto de funciones de devolución de llamada (callback) utilizadas en el proceso de entrenamiento. Los usuarios pueden implementar sus propias clases hook desde esta clase base para manejar procesos de devolución de llamada complicados. Esta estructura proporciona una gran flexibilidad en los procesos de devolución de llamada. Cada hook puede implementar 6 métodos, y cada método se llama antes/después de los procesos correspondientes durante el entrenamiento. La forma en que se llaman se demuestra en el siguiente fragmento:
ja_jp: Qiskit Machine Learning は、基本フッククラスである ``HookBase`` を提供します。これは、トレーニングプロセスで使用されるコールバック関数のセットであるフックの基本クラスです。ユーザーは、この基本クラスから独自のフッククラスを実装して、複雑なコールバックプロセスを処理できます。この構造は、コールバックプロセスに高い柔軟性を提供します。各フックは6つのメソッドを実装でき、各メソッドはトレーニング中に対応するプロセスの前後に呼び出されます。それらが呼び出される方法は、次のスニペットに示されています。
ko_kr: Qiskit Machine Learning은 기본 hook 클래스인 ``HookBase``를 제공한다. 이 클래스는 학습 과정에서 사용되는 콜백 함수 집합인 hook의 기본 클래스이다. 사용자는 이 기본 클래스에서 자신만의 hook 클래스를 구현하여 복잡한 콜백 과정을 처리할 수 있다. 이 구조는 콜백 과정에서 높은 유연성을 제공한다. 각 hook는 6개의 메소드를 구현할 수 있으며 각 메소드는 학습 중 해당 과정 이전/이후에 호출된다. 호출되는 방법은 다음 면에 설명되어 있다.
pt_un: Qiskit Machine Learning oferece uma classe base de hook, ``HookBase``. Trata-se de uma classe base para um hook que é um conjunto de funções de callback usadas no processo de treinamento. Os usuários podem implementar suas próprias classes de hook a partir dessa classe base, para poderem lidar com processos de callback complexos. Essa estrutura gera mais flexibilidade nos processos de callback. Cada hook pode implementar 6 métodos, e cada método é chamado antes/depois dos processos correspondentes durante o treino. A forma de chamá-los é demonstrada no seguinte trecho:
ta_in: கிஸ்கிட் மெஷின் லேர்னிங் ஒரு அடிப்படை ஹூக் வகுப்பை வழங்குகிறது, ``HookBase``. இது ஒரு ஹூக்கிற்கான அடிப்படை வகுப்பாகும், இது பயிற்சி செயல்பாட்டில் பயன்படுத்தப்படும் அழைப்பு செயல்பாடுகளின் தொகுப்பாகும். சிக்கலான கால்பேக் செயல்முறைகளைக் கையாள பயனர்கள் இந்த அடிப்படை வகுப்பிலிருந்து தங்கள் சொந்த ஹூக் வகுப்புகளைச் செயல்படுத்தலாம். இந்த அமைப்பு திரும்ப திரும்ப செயல்முறைகளில் அதிக நெகிழ்வுத்தன்மையை வழங்குகிறது. ஒவ்வொரு கொக்கியும் 6 முறைகளை செயல்படுத்த முடியும், மேலும் ஒவ்வொரு முறையும் பயிற்சியின் போது தொடர்புடைய செயல்முறைகளுக்கு முன் / பின் அழைக்கப்படுகிறது. அவைகள் அழைக்கப்படும் விதம் பின்வரும் துணுக்கில் நிரூபிக்கப்பட்டுள்ளது:

source: In the hook methods, users can access ``TorchTrainer`` via ``self.trainer`` to access more context properties(e.g., model, current iteration, or config). The following snippet describes available properties that might be useful for a hook.
de_de: In den Hook-Methoden können Benutzer über ``self.trainer`` auf ``TorchTrainer`` zugreifen, um mehr Kontexteigenschaften (z.B. model, aktuelle Iteration, oder config) abzufragen. Das folgende Snippet beschreibt die verfügbaren Eigenschaften, die für einen Hook nützlich sein könnten.
es_un: En los métodos hook, los usuarios pueden acceder al ``TorchTrainer`` a través de ``self.trainer`` para acceder a más propiedades de contexto (por ejemplo, modelo, iteración actual o configuración). El siguiente fragmento describe las propiedades disponibles que podrían ser útiles para un hook.
ja_jp: フックメソッドでは、ユーザーは ``self.trainer`` を介して ``TorchTrainer`` にアクセスし、より多くのコンテキストプロパティ（モデル、現在の反復、構成など）にアクセスできます。次のスニペットは、フックに役立つ可能性のある使用可能なプロパティについて説明しています。
ko_kr: Hook 메소드에서 사용자는 ``self.trainer``을 통해 ``TorchTrainer``를 통해 더 많은 컨텍스트 속성 (모델, 현재 반복, 구성 등) 에 접근할 수 있다. 다음면에서는 hook에 유용할 수 있는 사용 가능한 속성에 대해 설명한다.
pt_un: Nos métodos de hook, os usuários podem acessar ``TorchTrainer`` via ``self.trainer`` para verem mais propriedades de contexto (ex: modelo, iteração atual ou configurações). O seguinte trecho descreve as propriedades disponíveis que podem ser úteis para um hook.
ta_in: ஹூக் முறைகளில், பயனர்கள் கூடுதல் சூழல் பண்புகளை (எ.கா., மாதிரி, தற்போதைய மறு செய்கை அல்லது கட்டமைப்பு) அணுக, ``self.trainer`` வழியாக ``TorchTrainer` ஐ அணுகலாம். பின்வரும் துணுக்கு ஒரு கொக்கிக்கு பயனுள்ளதாக இருக்கும் கிடைக்கக்கூடிய பண்புகளை விவரிக்கிறது.

source: TorchTrainer has:
de_de: TorchTrainer hat:
es_un: TorchTrainer tiene:
ja_jp: TorchTrainer は以下を持ちます：
ko_kr: TorchTrainer는 다음을 가지고 있다:
pt_un: TorchTrainer tem:
ta_in: TorchTrainer கொண்டுள்ளவை:

source: ``model``: A model to be trained.
de_de: ``model``: Ein Modell, das trainiert werden soll.
es_un: ``model``: Un modelo para entrenar.
ja_jp: ``model`` ：トレーニングされるモデル。
ko_kr: ``model``: 학습할 모델.
pt_un: ``model``: Um modelo a ser treinado.
ta_in: ``model``: பயிற்சி பெற வேண்டிய மாதிரி.

source: ``optimizer``: An optimizer used for the training.
de_de: ``optimizer``: Ein Optimierer, der für das Training verwendet wird.
es_un: ``optimizer``: Un optimizador utilizado para el entrenamiento.
ja_jp: ``optimizer`` ：トレーニングに使用されるオプティマイザー。
ko_kr: ``optimizer``: 학습에 사용될 최적화 도구.
pt_un: ``optimizer``: Um otimizador utilizado para o treinamento.
ta_in: ``optimizer``: பயிற்சிக்குப் பயன்படுத்தப்படும் உகப்பாக்கி.

source: ``loss_func``: A loss function for the training.
de_de: ``loss_func``: Eine Verlustfunktion für das Training.
es_un: ``loss_func``: Una función de pérdida para el entrenamiento.
ja_jp: ``loss_func`` ：トレーニングの損失関数。
ko_kr: ``loss_func``: 학습을 위한 손실 함수.
pt_un: ``loss_func``: Uma função-custo para o treinamento.
ta_in: ` ` loss_func ` `: பயிற்சிக்காக ஒரு இழப்பு செயல்பாடு.

source: ``train_loader``: A PyTorch data loader object containing a training dataset.
de_de: ``train_loader``: Ein PyTorch-Datenladeobjekt, das einen Trainingsdatensatz enthält.
es_un: ``train_loader``: Un objeto cargador de datos de PyTorch que contiene un conjunto de datos de entrenamiento.
ja_jp: ``train_loader`` ：トレーニングデータセットを含む PyTorch データローダーオブジェクト。
ko_kr: ``train_loader``: 학습 데이터 세트를 포함하는 PyTorch 데이터 로더 객체.
pt_un: ``train_loader``: Um objeto PyTorch para carregar dados contendo um dataset de treino.
ta_in: ``train_loader``: பயிற்சி தரவுத்தொகுப்பைக் கொண்ட பைடார்ச் தரவு ஏற்றி பொருள்.

source: ``val_loader``: A PyTorch data loader object containing a validation dataset.
de_de: ``val_loader``: Ein PyTorch-Datenladeobjekt, das einen Validierungsdatensatz enthält.
es_un: ``val_loader``: Un objeto cargador de datos de PyTorch que contiene un conjunto de datos de validación.
ja_jp: ``val_loader`` ：検証データセットを含む PyTorch データローダーオブジェクト。
ko_kr: ``val_loader``: 검증 데이터 세트를 포함하는 PyTorch 데이터 로더 객체.
pt_un: ``val_loader``: Um objeto PyTorch para carregar dados contendo um dataset de validação.
ta_in: ``val_loader``: சரிபார்ப்பு தரவுத்தொகுப்பைக் கொண்ட பைடார்ச் தரவு ஏற்றி பொருள்.

source: ``max_epoch``: The maximum number of training epochs.
de_de: ``max_epoch``: Die maximale Anzahl an Übungsiterationen.
es_un: ``max_epoch``: El número máximo de épocas de entrenamiento.
ja_jp: ``max_epoch`` ：トレーニングエポックの最大数。
ko_kr: ``max_epoch``: 최대 학습 횟수.
pt_un: ``max_epoch``: O número máximo de épocas usadas no treino.
ta_in: ``max_epoch``: பயிற்சி சகாப்தங்களின் அதிகபட்ச எண்ணிக்கை.

source: ``log_period``: A logging period for a train history and a validation history. By default, there will be logs every epoch (``log_period``\ =1).
de_de: ``log_period``: Ein Logging-Zeitraum für einen Trainingsverlauf und einen Validierungsverlauf. Standardmäßig wird jede Epoche protokolliert (``log_period``\ =1).
es_un: ``log_period``: Un período de logging para un historial de entrenamiento y un historial de validación. De forma predeterminada, habrá registros en cada época. (``log_period``\ =1).
ja_jp: ``log_period`` ：学習の履歴と検証の履歴のログ期間。 デフォルトでは、エポックごとにログがあります（ ``log_period = 1``）。
ko_kr: ``log_period``: 학습 기록과 검증 기록을 위한 로깅 시간. 기본값으로 모든 epoch (``log_period``=1) 에 로그가 있다.
pt_un: ``log_period``: Um período de registro para histórico de treino e validação. Por padrão, há registros em cada época (``log_period``\ =1).
ta_in: ` ` log_period ` `: ஒரு பயிற்சி வரலாறு மற்றும் மதிப்பீடு வரலாறு. முன்னிருப்பாக, ஒவ்வொரு epoch (` ` log_period ` `\= 1) உள்வாங்கும்.

source: ``start_epoch``: An initial epoch for warm-start training. By default, 0.
de_de: ``start_epoch``: Eine erste Epoche für das Warm-Start-Training. Standardmäßig 0.
es_un: ``start_epoch``: Una época inicial para el entrenamiento de arranque en caliente. Por defecto, 0.
ja_jp: ``start_epoch`` ：ウォームスタート学習の初期エポック。デフォルトでは、0です。
ko_kr: ``start_epoch``: 웜 스타트 훈련의 최초 epoch. 기본값은 0이다.
pt_un: ``start_epoch``: Uma época inicial para treinamento ``warm-start``. Por padrão, é 0.
ta_in: ``start_epoch``: சூடான தொடக்கப் பயிற்சிக்கான ஆரம்ப காலக்கட்டம். இயல்பாக, 0.

source: ``epoch``: The current number of epochs.
de_de: ``epoch``: Die aktuelle Anzahl an Epochen.
es_un: ``epoch``: El número actual de épocas.
ja_jp: ``epoch`` ：現在のエポック数。
ko_kr: ``epoch``: 현재 epoch 수.
pt_un: ``epoch``: O número atual de épocas.
ta_in: `` epoch``: காலக்கட்டங்களின் தற்போதைய எண்ணிக்கை.

source: ``global_step``: The current number of steps.
de_de: ``global_step``: Die aktuelle Anzahl an Schritten.
es_un: ``global_step``: El número actual de pasos.
ja_jp: ``global_step`` ：現在のステップ数。
ko_kr: ``global_step``: 현재 단계 수.
pt_un: ``global_step``: O número atual de passos.
ta_in: ``global_step``: தற்போதைய படிகளின் எண்ணிக்கை.

source: ``train_logger``: A logger for a training history. Use ``train_logger.metrics`` to access a list of logs. A log for each epoch is stored as a dictionary similar to ``TorchRuntimeResult.train_history``
de_de: ``train_logger``: Ein Logger für eine Trainingshistorie. Benutze ``train_logger.metrics`` um auf eine Liste von Logs zuzugreifen. Ein Log für jede Epoche wird als Dictionary gespeichert, ähnlich wie ``TorchRuntimeResult.train_history``
es_un: ``train_logger``: Un logger para un historial de entrenamiento. Utiliza ``train_logger.metrics`` para acceder a una lista de logs. Un log para cada época se almacena como un diccionario similar a ``TorchRuntimeResult.train_history``
ja_jp: ``train_logger`` ：学習履歴のロガー。 ``train_logger.metrics`` を使用して、ログのリストにアクセスします。各エポックのログは、 ``TorchRuntimeResult.train_history`` のような辞書として保存されます。
ko_kr: ``train_logger``: 학습 기록을 위한 로거. 로그 목록에 액세스하기 위해 ``train_logger.metrics``를 사용한다. 각 epoch에 대한 로그는 ``TorchRuntimeResult.train_history``와 비슷한 사전으로 저장된다.
pt_un: ``train_logger``: Um registrador para histórico de treinos. Use ``train_logger.metrics`` para acessar uma lista de logs. Um log por época é guardado como dicionário análogo a ``TorchRuntimeResult.train_history``
ta_in: ``train_logger``: பயிற்சி வரலாற்றிற்கான லாகர். பதிவுகளின் பட்டியலை அணுக ``train_logger.metrics`` ஐப் பயன்படுத்தவும். ஒவ்வொரு காலக்கட்டத்திற்கும் ஒரு பதிவு, ``TorchRuntimeResult.train_history`` போன்ற அகராதியாகச் சேமிக்கப்படுகிறது

source: ``val_logger``: A logger for a validation history. Logs are stored in the same way as train_logger.
de_de: ``val_logger``: Ein Logger für einen Validierungsverlauf. Protokolle werden genauso wie train_logger gespeichert.
es_un: ``val_logger``: Un logger para un historial de validación. Los logs se almacenan de la misma forma que en train_logger.
ja_jp: ``val_logger`` ：検証履歴のロガー。ログは train_logger と同じ方法で保存されます。
ko_kr: ``val_logger``: 검증 기록을 위한 로거. 로그는 train_logger와 동일한 방법으로 저장된다.
pt_un: ``val_logger``: Um registrados de histórico de validação. Os logs são guardados da mesma forma que o train_logger.
ta_in: ``val_logger``: சரிபார்ப்பு வரலாற்றிற்கான லாகர். Train_loggerஐப் போலவே பதிவுகளும் சேமிக்கப்படுகின்றன.

source: Users can pass a single hook instance or a list of hook instances to ``hooks`` argument.
de_de: Benutzer können eine einzelne Hook-Instanz oder eine Liste von Hook-Instanzen an das ``hooks`` Argument übergeben.
es_un: Los usuarios pueden pasar una única instancia de hook o una lista de instancias de hook al argumento ``hooks``.
ja_jp: ユーザーは、単一のフックインスタンスまたはフックインスタンスのリストを ``hooks`` 引数に渡すことができます。
ko_kr: 사용자는 단일 hook 인스턴스 또는 hook 인스턴스 목록을 ``hook`` 인자로 전달할 수 있다.
pt_un: Os usuários podem passar uma única instância de hook ou uma lista de instâncias para o argumento ``hooks``.
ta_in: பயனர்கள் ஒற்றை ஹூக் நிகழ்வு அல்லது ஹூக் நிகழ்வுகளின் பட்டியலை ``hooks`` வாதத்திற்கு அனுப்பலாம்.

source: The following example is a hook for early stopping. If the current loss is smaller than the threshold after an epoch, the training will be terminated.
de_de: Das folgende Beispiel ist ein Hook für einen frühen Stopp. Ist der aktuelle Verlust kleiner als der Schwellenwert nach einer Epoche, wird das Training beendet.
es_un: El siguiente ejemplo es un hook para detenerse antes de tiempo. Si la pérdida actual es menor que el umbral después de una época, el entrenamiento terminará.
ja_jp: 次の例は、早期停止のフックです。エポック後、現在の損失がしきい値よりも小さい場合、トレーニングは終了します。
ko_kr: 다음 예제는 early stopping을 위한 hook이다. 만약 현재 손실이 epoch 다음의 임계값보다 작으면 학습이 종료된다.
pt_un: No exemplo seguinte, há um hook para parada antecipada. Se a função custo atual for menor ou igual ao valor limite após uma época, o treino é interrompido.
ta_in: பின்வரும் உதாரணம் முன்கூட்டியே நிறுத்துவதற்கான ஒரு கொக்கி. தற்போதைய இழப்பு ஒரு காலக்கட்டத்திற்குப் பிறகு வரம்பைவிடச் சிறியதாக இருந்தால், பயிற்சி நிறுத்தப்படும்.

source: As we can see, training was interrupted after the first epoch despite we set the number of epochs to 5 in the ``TorchRuntimeClient`` configuration.
de_de: Es ist ersichtlich, dass das Training nach der ersten Epoche unterbrochen wurde, obwohl wir die Anzahl der Epochen in der ``TorchRuntimeClient`` Konfiguration auf 5 gesetzt haben.
es_un: Como podemos ver, el entrenamiento se interrumpió después de la primera época a pesar de que establecimos el número de épocas en 5 en la configuración de ``TorchRuntimeClient``.
ja_jp: ご覧のとおり、 ``TorchRuntimeClient`` 構成でエポック数を5に設定したにもかかわらず、最初のエポックの後でトレーニングが中断されました。
ko_kr: ``TorchRuntimeClient`` 구성에서 epoch 수를 5로 설정했음에도 불구하고 첫 번째 epoch 이후에 학습이 중단된 것을 볼 수 있다.
pt_un: Como podemos ver, o treino foi interrompido após a primeira época, mesmo que tenhamos escolhido o número de épocas como 5 nas configurações do ``TorchRuntimeClient``.
ta_in: நாம் பார்க்கிறபடி, ``TorchRuntimeClient`` உள்ளமைவில் காலக்கட்டங்களின் எண்ணிக்கையை 5 ஆக அமைத்திருந்தாலும், முதல் காலக்கட்டத்திற்குப் பிறகு பயிற்சி தடைபட்டது.

source: First, we show how to use Torch Runtime via ``TorchRuntimeClient`` using the simple regression example. In the example, we will perform a regression task on a randomly generated dataset following a sine wave.
de_de: Zuerst zeigen wir, wie man Torch Runtime via ``TorchRuntimeClient`` mithilfe des einfachen Regression-Beispiels nutzt. Im Beispiel wird eine Regressionsaufgabe auf einem zufällig erzeugten sinuswelligen Datensatz ausgeführt.
ko_kr: 먼저, ``TorchRuntimeClient`` 를 이용하여 Torch Runtime을 사용하는 방법을 간단한 회귀 분석 예제로 설명한다. 이 예제에서는 사인파(sine wave)를 따라 무작위로 생성된 데이터 세트에 회귀 분석 작업을 수행한다.
pt_un: Primeiro, mostramos como usar o Torch Runtime via ``TorchRuntimeClient`` usando o exemplo de regressão simples. No exemplo, realizaremos uma tarefa de regressão em um conjunto de dados gerado aleatoriamente seguindo uma onda senoidal.
ta_in: முதலில், எளிய பின்னடைவு உதாரணத்தைப் பயன்படுத்தி ``டார்ச்இயக்க நேர கிளையண்ட்`` வழியாக டார்ச் இயக்க நேரத்தை எவ்வாறு பயன்படுத்துவது என்பதைக் காட்டுகிறோம். எடுத்துக்காட்டில், சைன் அலையைத் தொடர்ந்து தோராயமாக உருவாக்கப்பட்ட தரவுத்தொகுப்பில் பின்னடைவு பணியைச் செய்வோம்.
