Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/06_torch_runtime.po
Languages: de_de, es_un, ja_jp, ko_kr, pt_un, ta_in

source: This page was generated from `docs/tutorials/06_torch_runtime.ipynb`__.
de_de: Diese Seite wurde aus `docs/tutorials/06_torch_runtime.ipynb`__ generiert.
es_un: Esta página fue generada a partir de `docs/tutorials/06_torch_runtime.ipynb`__.
ja_jp: このページは `docs/tutorials/06_torch_runtime.ipynb`__ から生成されました。
ko_kr: 이 페이지는 "docs/tutorials/06_torch_runtime.ipynb" 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/06_torch_runtime.ipynb`__.
ta_in: இந்தப் பக்கம் `docs/tutorials/06_torch_runtime.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Torch Runtime
de_de: Torch Laufzeit
ja_jp: Torch ランタイム
ta_in: டார்ச் ரன்டைம்

source: In this tutorial, we introduce Torch Runtime, and show how to use it via the ``TorchRuntimeClient`` class in Qiskit Machine Learning. Torch Runtime leverages Qiskit Runtime for hybrid quantum-classical machine learning based on a PyTorch ``Module``. It allows training models or predicting the outputs with trained models significantly faster. We show how to use Torch Runtime with two simple examples for regression and classification tasks in the following.
de_de: In diesem Tutorial wird die Torch Runtime vorgestellt und gezeigt wie sie über die ``TorchRuntimeClient`` Klasse in Qiskit Machine Learning benutzt wird. Torch Runtime nutzt Qiskit Runtime für hybrides quantenklassisches maschinelles lernen, basierend auf einem PyTorch ``Module``. Das ermöglicht deutlich schnellere Trainingsmodelle und Vorhersage der Ergebnisse von trainierten Modellen. Es wird im Folgenden gezeigt wie Torch Runtime mit zwei einfachen Beispielen für Regressions- und Klassifizierungsaufgaben verwendet werden.
es_un: En este tutorial, presentamos Torch Runtime y mostramos cómo usarlo a través de la clase ``TorchRuntimeClient`` en Qiskit Machine Learning. Torch Runtime aprovecha Qiskit Runtime para el aprendizaje automático híbrido cuántico-clásico basado en un ``Module`` de PyTorch. Permite entrenar modelos o predecir los resultados con modelos entrenados significativamente más rápido. A continuación, mostramos cómo usar Torch Runtime con dos ejemplos simples para tareas de regresión y clasificación.
ja_jp: このチュートリアルでは、Torch Runtimeを紹介し、Qiskit機械学習の ``TorchRuntimeClient`` クラスを介してそれを使用する方法を示します。Torch Runtime は、Qiskit Runtime を活用して、PyTorch ``Module`` に基づくハイブリッド量子古典機械学習を実現します。これにより、モデルのトレーニングや、トレーニングされたモデルを使用した出力の予測が大幅に高速化されます。以下に、回帰タスクと分類タスクの2つの簡単な例を使用してTorchRuntimeを使用する方法を示します。
ko_kr: 본 튜토리얼에서는 Torch Runtime을 소개하고, Qiskit Machine Learning 에서 ` ` TorchRuntimeClient " 클래스를 통해 이를 사용하는 방법을 설명한다. 토치 런타임은 PyTorch ` ` 모듈 `을 기반으로 하이브리드 퀀텀 클래식 머신 러닝을 위한 Qiskit 런타임을 활용하며 훈련 모델을 지원하거나 훈련된 모델의 출력을 훨씬 빠르게 예측할 수 있다. 다음의 회귀 및 분류 태스크에 대해 간단한 두 가지 예제를 사용하여 Torch Runtime을 사용하는 방법을 설명한다.
pt_un: Neste tutorial, apresentamos o Torch Runtime e mostramos como usá-lo através da classe ``TorchRuntimeClient`` no Qiskit Machine Learning. O Torch Runtime aproveita o Qiskit Runtime para aprendizado de máquina quântico-clássico híbrido baseado em um ``Módulo`` do PyTorch. Ele permite treinar modelos ou prever as saídas com modelos treinados de forma significativamente mais rápida. Mostramos a seguir como usar o Torch Runtime com dois exemplos simples para tarefas de regressão e classificação.

source: 1. Regression
es_un: 1. Regresión
ja_jp: 1. 回帰
ko_kr: 1. 회귀
pt_un: 1. Regressão
ta_in: 1. பின்னடைவு

source: First, we show how to use Torch Runtime via ``TorchRuntimeClient`` using the simple regression example. In the example, we will perform a regression task on a randomly generated dataset following a sin wave.
es_un: Primero, mostramos cómo usar Torch Runtime a través de ``TorchRuntimeClient`` usando el ejemplo de regresión simple. En el ejemplo, realizaremos una tarea de regresión en un conjunto de datos generado aleatoriamente siguiendo una onda senoidal.
ja_jp: 最初に、単純な回帰の例を使用して、 ``TorchRuntimeClient`` を介して Torch Runtime を使用する方法を示します。この例では、正弦波に続いてランダムに生成されたデータセットに対し、回帰タスクを実行します。

source: ``TorchRuntimeClient`` requires a PyTorch ``DataLoader`` as an input for training/predicting. For that purpose, we create a custom torch dataset class.
de_de: ``TorchRuntimeClient`` erfordert einen PyTorch ``DataLoader`` als Eingabe für Training/Vorhersage. Dafür wird eine benutzerdefinierte torch Dataset-Klasse erstellt.
es_un: ``TorchRuntimeClient`` requiere un ``DataLoader`` de PyTorch como entrada para entrenar/predecir. Para ese propósito, creamos una clase de conjunto de datos de torch personalizada.
ja_jp: ``TorchRuntimeClient`` には、トレーニング／予測 の入力として PyTorch ``DataLoader`` が必要です。そのために、カスタムトーチデータセットクラスを作成します。
ko_kr: ``TorchRuntimeClient`는 PyTorch ``DataLoader``를 학습/예측의 입력으로 요구한다. 이를 위해, 사용자 정의 토치 데이터 세트 클래스를 생성한다.
pt_un: ``TorchRuntimeClient`` requer um PyTorch ``DataLoader`` como entrada para treinamento/previsão. Para isso, criamos uma classe de conjunto de dados de tocha personalizada.
ta_in: ``TorchRuntimeClient`` க்கு பயிற்சி/கணிப்புக்கான உள்ளீடாக PyTorch ``DataLoader`` தேவைப்படுகிறது. அந்த நோக்கத்திற்காக, தனிப்பயன் டார்ச் டேட்டாசெட் வகுப்பை உருவாக்குகிறோம்.

source: Create an instance of ``TorchConnector`` to wrap a QNN model and be able to use pytorch to train the model, then set up an optimizer and a loss function as usual.
de_de: Erstelle eine Instanz von ``TorchConnector``, um ein QNN Modell zu verpacken und in der Lage zu sein das Modell mit pytorch zu trainieren. Dann richte wie gewohnt einen Optimierer und eine Verlustfunktion ein.
es_un: Crea una instancia de ``TorchConnector`` para envolver un modelo QNN y poder usar pytorch para entrenar el modelo, luego configura un optimizador y una función de pérdida como de costumbre.
ja_jp: ``TorchConnector`` のインスタンスを作成してQNNモデルをラップし、pytorchを使用してモデルをトレーニングできるようにしてから、通常どおりオプティマイザーと損失関数を設定します。
ko_kr: ``TorchConnector`` 의 인스턴스를 생성하여 QNN 모델을 감싸고 pytorch로 해당 모델을 학습시킬 수 있도록 하며, 최적화 프로그램과 손실 함수를 일반적인 경우와 같이 설정한다.
pt_un: Crie uma instância do ``TorchConnector`` para englobar um modelo QNN e para poder usar o pytorch para treinar o modelo, e então prepare um otimizador e uma função custo normalmente.

source: Load a provider and specify a backend for the runtime service.
de_de: Lade einen Provider und gib ein Backend für den Laufzeitdienst an.
es_un: Carga un proveedor y especifica un backend para el servicio en tiempo de ejecución.
ja_jp: プロバイダーをロードし、ランタイムサービスのバックエンドを指定します。
ko_kr: 공급자를 로드하고 런타임 서비스의 백엔드를 지정한다.
pt_un: Carregue um provedor e especifique um backend para o serviço de tempo de execução.
ta_in: வழங்குநரைச் ஏற்றி, இயக்க நேரச் சேவைக்கான பின்தளத்தைக் குறிப்பிடவும்.

source: Create a Torch Runtime Client instance with the model, the optimizer, and other configurations.
de_de: Erstelle eine Torch Runtime Client Instanz mit dem Modell, dem Optimierer und anderen Konfigurationen.
es_un: Crea una instancia de Torch Runtime Client con el modelo, el optimizador y otras configuraciones.
ja_jp: モデル、オプティマイザ、およびその他の構成を使用して Torch Runtime Client インスタンスを作成します。
ko_kr: 모델, 최적화 및 기타 구성을 사용하여 Torch Runtime Client 인스턴스를 생성한다.
pt_un: Crie uma instância de um cliente de execução Torch com o modelo, o otimizador, e outras configurações.
ta_in: மாடல், ஆப்டிமைசர் மற்றும் பிற உள்ளமைவுகளுடன் டார்ச் இயக்க நேர கிளையண்ட் நிகழ்வை உருவாக்கவும்.

source: Call ``fit()`` to train the model
de_de: Rufe ``fit()`` zum Training des Modells auf
es_un: Llama a ``fit()`` para entrenar el modelo
ja_jp: ``fit()`` を呼び出してモデルをトレーニングする
ko_kr: 모델을 훈련시키기 위해 ``fit()`` 을 호출한다.
pt_un: Chame a ``fit()`` para treinar o modelo
ta_in: மாதிரியைப் பயிற்றுவிக்க ``fit()`` ஐ அழைக்கவும்

source: Call the ``fit`` method in ``TorchRuntimeClient`` with the data loader to train the model.
de_de: Rufe die ``fit``-Methode in ``TorchRuntimeClient`` mit dem Data Loader auf, um das Modell zu trainieren.
es_un: Llama al método ``fit`` en ``TorchRuntimeClient`` con el cargador de datos para entrenar el modelo.
ja_jp: データローダーを使用して ``TorchRuntimeClient`` の ``fit`` メソッドを呼び出し、モデルをトレーニングします。
ko_kr: 모델을 훈련시키기 위해 데이터 로더를 이용해 ``TorchRuntimeClient``에 ``fit`` 메소드를 호출한다.
pt_un: Chame o método ``fit`` dentro da ``TorchRuntimeClient`` com o carregador de dados para treinar o modelo.
ta_in: மாதிரியைப் பயிற்றுவிக்க, டேட்டா லோடருடன் ``TorchRuntimeClient`` இல் ``fit`` முறையை அழைக்கவும்.

source: You can access training result information by querying properties of the ``fit_result`` variable, that is an instance of the ``TorchRuntimeResult`` class. Also, model’s parameters in ``TorchRuntimeClient`` are updated with trained ones.
de_de: Die Informationen zum Trainingsergebnis sind unter den Eigenschaften der ``fit_result``-Variable abrufbar. Das ist eine Instanz der ``TorchRuntimeResult`` Klasse. Auch die Parameter des Modells in ``TorchRuntimeClient`` werden mit geschulten aktualisiert.
es_un: Puedes acceder a la información de los resultados del entrenamiento consultando las propiedades de la variable ``fit_result``, que es una instancia de la clase ``TorchRuntimeResult``. Además, los parámetros del modelo en ``TorchRuntimeClient`` se actualizan con los entrenados.
ja_jp: ``TorchRuntimeResult`` クラスのインスタンスである ``fit_result`` 変数のプロパティを照会することでトレーニング結果情報にアクセスできます。また、 ``TorchRuntimeClient`` のモデルのパラメーターは、トレーニングされたパラメーターで更新されます。
ko_kr: ```fit_result`` 변수의 특성을 쿼리하여 학습 결과를 볼 수 있으며, 이는 ``TorchRuntimeClient`` 클래스의 인스턴스이다. 또한, ``TorchRuntimeClient``에서 모델의 매개변수는 학습된 것으로 업데이트된다.
pt_un: Você pode acessar informações sobre resultado dos treinos pesquisando propriedades da variável ``fit_result``, a qual é uma instância da classe ``TorchRuntimeResult``. Além disso, os parâmetros do modelo na ``TorchRuntimeClient`` são atualizados com os parâmetros dos treinos.
ta_in: ``fit_result`` மாறியின் பண்புகளை வினவுவதன் மூலம் பயிற்சி முடிவுத் தகவலை நீங்கள் அணுகலாம், இது ``TorchRuntimeResult`` வகுப்பின் உதாரணம். மேலும், ``TorchRuntimeClient`` இல் உள்ள மாதிரியின் அளவுருக்கள் பயிற்சி பெற்றவைகளுடன் புதுப்பிக்கப்படும்.

source: You can also query the ``train_history`` property, which is a list of dictionaries, each per epoch. In a dictionary you can find properties like: - ``epoch``, epoch index - ``loss``, loss value at this epoch - ``forward_time``, time spent in the forward pass, in seconds - ``backward_time``, time spent in the backward pass, in seconds - ``epoch_time``, epoch time, in seconds."
de_de: Man kann auch die ``train_history`` Eigenschaft abfragen, die eine Liste von Dictionaries pro Epoche ist. In einem Dictionary findest du Eigenschaften wie: - ``epoch``, epoch index - ``loss``, loss value at this epoch - ``forward_time``, time spent in the forward pass, in seconds - ``backward_time``, time spent in the backward pass, in seconds - ``epoch_time``, epoch time, in seconds."
es_un: También puedes consultar la propiedad ``train_history``, que es una lista de diccionarios, cada uno por época. En un diccionario puedes encontrar propiedades como: - ``epoch``, índice de época - ``loss``, valor de pérdida en esta época - ``forward_time``, tiempo empleado en el paso hacia adelante (forward pass), en segundos - ``backward_time``, tiempo empleado en el paso hacia atrás (backward pass), en segundos - ``epoch_time``, tiempo de época, en segundos. "
ja_jp: また、エポックごとに辞書のリストである ``train_history`` プロパティをクエリすることもできます。辞書には、次のようなプロパティがあります。 - ``epoch``、エポックインデックス - ``loss`` 、このエポックでの損失値 - ``forward_time`` 、フォワード・パスに費やされた時間（秒） - ``backward_time`` 、バックワード・パスに費やされた時間（秒） - ``epoch_time`` 、エポック時間、秒単位。
ko_kr: 또한 각 epoch마다 사전 목록인 ``train_history`` 속성도 쿼리할 수 있다. 사전에서는 -``epoch``, epoch 인덱스 -``loss``, loss 값 -``forward_time``, forward pass에 소요된 시간 - ``backward_time``, backward pass에 소요된 시간 - ``epoch_time``와 같은 특성을 찾을 수 있다.
pt_un: Você também pode pesquisar a propriedade ``train_history``, que é uma lista de dicionários, um por época. Em um dicionário você pode encontrar propriedades como - ``epoch``, índice da época - ``loss``, valor da função custo em tal época - ``forward_time``, o tempo gasto na passagem direta, em segundos - ``backward_time``, o tempo gasto na passagem reversa, em segundos - ``epoch_time``, o tempo da época, em segundos."
ta_in: நீங்கள் ``Train_history`` சொத்தை வினவலாம், இது ஒவ்வொரு சகாப்தத்திற்கும் அகராதிகளின் பட்டியல். அகராதியில் நீங்கள் போன்ற பண்புகளைக் காணலாம்: - `` சகாப்தம்``, சகாப்த அட்டவணை - ``இழப்பு``, இந்த சகாப்தத்தில் இழப்பு மதிப்பு - ``முன்னோக்கி_நேரம்``, முன்னோக்கிச் சென்ற நேரம், நொடிகளில் - ``பின்னோக்கி_நேரம் ``, பின்தங்கிய நிலையில் கழித்த நேரம், நொடிகளில் - `` சகாப்தம்_நேரம்``, சகாப்த நேரம், நொடிகளில்."

source: Training with validation
de_de: Training mit Validierung
es_un: Entrenamiento con validación
ja_jp: 検証を伴うトレーニング
ko_kr: 검증을 이용하여 학습
pt_un: Treinando com validação
ta_in: மதிப்பீட்டுடன் பயிற்சி

source: Torch Runtime can also perform validation while training a model by passing a validation data loader to the ``fit`` method.
de_de: Torch Runtime kann auch während des Trainings eines Modells eine Validierung durchführen, indem ein Validierungsdaten-Loader an die ``fit``-Methode übergeben wird.
es_un: Torch Runtime también puede realizar la validación mientras se entrena un modelo pasando un cargador de datos de validación al método ``fit``.
ja_jp: Torch Runtime は、検証データローダーを ``fit`` メソッドに渡すことにより、モデルのトレーニング中に検証を実行することもできます。
ko_kr: Torch Runtime은 또한 검증 데이터 로더를 ``fit`` 메소드에 전달하여 모델을 학습시키는 동시에 검증을 수행할 수 있다.
pt_un: O tempo de execução do Torch também pode fazer validações enquanto treina um modelo, passando o carregador de dados de validação para o método ``fit``.
ta_in: டார்ச் இயக்க நேரமும் சரிபார்ப்பு தரவு ஏற்றியை ``ஃபிட்`` முறைக்கு அனுப்புவதன் மூலம் மாதிரியைப் பயிற்றுவிக்கும் போது சரிபார்ப்பைச் செய்யலாம்.

source: You can query the ``val_history`` property, which is a list of dictionaries for the validation processes, each per epoch. In a dictionary you can find the same properties as ``train_history``.
de_de: Du kannst die ``val_history`` Eigenschaft abfragen, die eine Liste von Dictionaries für die Validierungsprozesse pro Epoche darstellt. In einem Dictionary findest du die gleichen Eigenschaften wie in ``train_history``.
es_un: Puedes consultar la propiedad ``val_history``, que es una lista de diccionarios para los procesos de validación, cada uno por época. En un diccionario puedes encontrar las mismas propiedades que en ``train_history``.
ja_jp: エポックごとに、検証プロセスのディクショナリのリストである ``val_history`` プロパティをクエリできます。辞書には、 ``train_history`` と同じプロパティがあります。
ko_kr: 각 epoch마다 검증 과정의 사전 목록인 ``val_history`` 속성을 쿼리할 수 있다. 사전에서는 ``train_history``와 같은 특성을 찾을 수 있다.
pt_un: Você pode pesquisar a propriedade ``val_history``, que é uma lista de dicionários para os processos de validação, um por época. Em um dicionário, você encontra as mesmas propriedades da ``train_history``.
ta_in: நீங்கள் ``val_history`` சொத்தை வினவலாம், இது சரிபார்ப்பு செயல்முறைகளுக்கான அகராதிகளின் பட்டியலாகும், ஒவ்வொன்றும் ஒரு சகாப்தத்திற்கு. அகராதியில் நீங்கள் ``train_history`` போன்ற அதே பண்புகளைக் காணலாம்.

source: Call ``predict()`` to perform prediction
de_de: Rufe ``predict()`` auf, um eine Vorhersage durchzuführen
es_un: Llama a ``predict()`` para realizar la predicción
ja_jp: 予測の実行のため ``predict()`` を呼び出す
ko_kr: 예측을 수행하기 위해 ``predict()``을 호출한다.
pt_un: Chame o ``predict()`` para fazer a predição
ta_in: கணிப்பைச் செய்ய ``predict()`` என அழைக்கவும்

source: Call the ``predict`` method in ``TorchRuntimeClient`` with the data loader to perform prediction on the passed data using the trained model.
de_de: Rufe die ``predict``-Methode in ``TorchRuntimeClient`` mit dem Datenloader auf, um die übergebenen Daten mit Hilfe des trainierten Modells vorherzusagen.
es_un: Llama al método ``predict`` en ``TorchRuntimeClient`` con el cargador de datos para realizar predicciones sobre los datos pasados utilizando el modelo entrenado.
ja_jp: データローダーを使用して ``TorchRuntimeClient`` の ``predict`` メソッドを呼び出し、トレーニング済みモデルを使用して渡されたデータの予測を実行します。
ko_kr: 학습된 모델로 전달된 데이터에 대한 예측을 수행하기 위해 데이터 로더와 함께 ``TorchRuntimeClient``에서 ``predict`` 메소드를 호출한다.
pt_un: Chame o método ``predict`` na ``TorchRuntimeClient`` com o carregador de dados para fazer a predição dos dados passados usando o modelo treinado.
ta_in: பயிற்சியளிக்கப்பட்ட மாதிரியைப் பயன்படுத்தி அனுப்பப்பட்ட தரவைக் கணிக்க, தரவு ஏற்றி மூலம் ``TorchRuntimeClient`` இல் ``முன்கணிப்பு`` முறையை அழைக்கவும்.

source: A red line, blue dots, and a green line on the plot show the original function, the training data, and a function constructed out of the predicted values, respectively.
de_de: Eine rote Linie, blaue Punkte und eine grüne Linie auf dem Plot zeigen die ursprüngliche Funktion, die Trainingsdaten und eine aus den vorhergesagten Werten konstruierte Funktion.
es_un: Una línea roja, puntos azules y una línea verde en la gráfica muestran la función original, los datos de entrenamiento y una función construida a partir de los valores predichos, respectivamente.
ja_jp: プロット上の赤い線、青い点、および緑の線は、それぞれ元の関数、トレーニングデータ、および予測値から構築された関数を示しています。
ko_kr: 그래프의 빨간색 선, 파란색 점 및 초록색 선은 각각 원래 함수, 학습 데이터, 그리고 예측 값으로 구성된 함수이다.
pt_un: Uma linha vermelha, pontos azuis, e uma linha verde no gráfico mostram a função original, os dados de treinamento, e uma função construída a partir dos valores previstos, respectivamente.
ta_in: ஒரு சிவப்பு கோடு, நீல புள்ளிகள் மற்றும் plotல் ஒரு பச்சை கோடு ஆகியவை முறையே அசல் செயல்பாடு, பயிற்சி தரவு மற்றும் கணிக்கப்பட்ட மதிப்புகளிலிருந்து கட்டமைக்கப்பட்ட செயல்பாடு ஆகியவற்றைக் காட்டுகின்றன.

source: Call ``score()`` to calculate a score
de_de: Rufe ``score()`` auf, um eine Punktzahl zu berechnen
es_un: Llama a ``score()`` para calcular un puntaje
ja_jp: スコアを計算するには、 ``score()`` を呼び出す
ko_kr: 점수를 계산하기 위해 ``score()``을 호출한다.
pt_un: Chame ``score()`` para calcular a pontuação
ta_in: மதிப்பெண்ணைக் கணக்கிட, ``score()`` என அழைக்கவும்

source: Call the ``score`` method in ``TorchRuntimeClient`` with the data loader to calculate a score, for the trained model. You should pass either ``"regression\"`` or ``"classification"`` to the ``score_func`` argument to use one of the pre-defined scores functions. Also, you can pass a custom scoring function defined as:
de_de: Rufe die ``score`` Methode in ``TorchRuntimeClient`` mit dem Datenloader auf, um eine Punktzahl für das trainierte Modell zu berechnen. Du solltest entweder ``"regression\"`` oder ``"classification"`` an das ``score_func`` Argument übergeben, um eine der vordefinierten Score-Funktionen zu verwenden. Du kannst auch eine benutzerdefinierte Scoring-Funktion verwenden:
es_un: Llama al método ``score`` en ``TorchRuntimeClient`` con el cargador de datos para calcular una puntuación, para el modelo entrenado. Debes pasar ``"regression\"`` o ``"classification"`` al argumento ``score_func`` para usar una de las funciones de puntaje predefinidas. Además, puedes pasar una función de puntuación personalizada definida como:
ja_jp: トレーニングされたモデルのスコアを計算するには、データローダーを使用して ``TorchRuntimeClient`` の ``score`` メソッドを呼び出します。事前定義されたスコア関数の1つを使用するには、 ``score_func`` 引数に ``"regression"`` または ``"classification"`` のいずれかを渡す必要があります。また、次のように定義されたカスタムスコアリング関数を渡すことができます。
ko_kr: 학습된 모델의 점수를 계산하기 위해 데이터 로더와 함께 ``TorchRuntimeClient``에 ``score`` 메소드를 호출한다. 사전 정의된 점수 함수 중 하나를 사용하려면 ``regression`` 또는 ``classification``를 ``score_func`` 인자로 전달해야 한다. 또한 다음과 같이 정의된 사용자 정의 점수 함수를 전달할 수 있다.
pt_un: Chame o método ``score`` em ``TorchRuntimeClient`` com o carregador de dados para calcular uma pontuação para o modelo treinado. Você deve passar ``"regression\"`` ou ``"classification"`` para o argumento ``score_func`` para usar uma das funções de pontuação pré-definidas. Além disso, você pode passar uma função de pontuação personalizada, definida como:
ta_in: பயிற்சியளிக்கப்பட்ட மாதிரிக்கான மதிப்பெண்ணைக் கணக்கிட, டேட்டா லோடருடன் "TorchRuntimeClient" இல் "ஸ்கோர்" முறையை அழைக்கவும். முன் வரையறுக்கப்பட்ட மதிப்பெண்கள் செயல்பாடுகளில் ஒன்றைப் பயன்படுத்த, நீங்கள் "பின்னடைவு (regression)" அல்லது "வகைப்படுத்தல் (classification)" என்பதை "score_func" argument அனுப்ப வேண்டும். மேலும், நீங்கள் பின்வருமாறு வரையறுக்கப்பட்ட தனிப்பயன் ஸ்கோரிங் செயல்பாட்டை அனுப்பலாம்:

source: where: - ``model_output`` are the values predicted by the model, - ``target`` ground truth values.
de_de: wobei: - ``model_output`` die vom Modell vorausgesagten Werte sind, - ``target`` die tatsächlichen Werte.
es_un: donde: - ``model_output`` son los valores predichos por el modelo, - ``target`` son valores fundamentales verdaderos.
ja_jp: ここで、 - ``model_output`` はモデルによって予測された値であり、 - ``target`` はの正解値です。
ko_kr: - ``model_output``은 모델에 의해 예측되는 값인 ``target``값이다.
pt_un: em que: - ``model_output`` são os valores previstos pelo modelo, - ``target`` os valores reais.
ta_in: எங்கே: - ``model_output`` என்பது மாதிரியால் கணிக்கப்படும் மதிப்புகள், - ``target`` அடிப்படை உண்மை மதிப்புகள்.

source: Note that the result of the ``score`` call also contains predicted values that were calculated in the process of scoring the model.
de_de: Beachte, dass das Ergebnis von ``score`` auch vorhergesagte Werte enthält, die beim Scoring des Modells berechnet wurden.
es_un: Ten en cuenta que el resultado de la llamada a ``score`` también contiene valores predichos que se calcularon en el proceso de puntuación del modelo.
ja_jp: ``score`` 呼び出しの結果には、モデルのスコアリングの過程で計算された予測値も含まれていることに注意してください。
ko_kr: 또한 ``score`` 의 결과에는 모델의 점수를 매기는 과정에서 계싼된 예측값이 포함되어 있다.
pt_un: Note que o resultado da chamada da ``score`` também pode conter valores previstos que foram calculados no processo de pontuar o modelo.
ta_in: ``ஸ்கோர்`` அழைப்பின் முடிவானது, மாதிரியை ஸ்கோரிங் செய்யும் போது கணக்கிடப்பட்ட கணிக்கப்பட்ட மதிப்புகளையும் கொண்டுள்ளது என்பதை நினைவில் கொள்ளவும்.

source: 2. Classification
de_de: 2. Klassifikation
es_un: 2. Clasificación
ja_jp: 2.分類
ko_kr: 2. 분류
pt_un: 2. Classificação
ta_in: 2. வகைப்பாடு

source: Second, we show how to perform a simple classification task using Torch Runtime. In the example, we will perform binary classification on a randomly generated dataset.
de_de: Zweitens wird gezeigt, wie man eine einfache Klassifikationsaufgabe mit Torch Runtime durchführt. Im Beispiel wird eine binäre Klassifizierung auf einem zufällig generierten Datensatz durchgeführt.
es_un: En segundo lugar, mostramos cómo realizar una tarea de clasificación simple usando Torch Runtime. En el ejemplo, efectuaremos una clasificación binaria en un conjunto de datos generado aleatoriamente.
ja_jp: 次に、Torch Runtime を使用して簡単な分類タスクを実行する方法を示します。この例では、ランダムに生成されたデータセットに対して二値分類を実行します。
ko_kr: 두 번째로, Torch Runtime을 사용하여 간단한 분류 작업을 수행하는 방법을 보여준다. 이 예제에서는 무작위로 생성된 데이터 세트에 대해 이진 분류를 수행할 것이다.
pt_un: Segundo, mostramos como realizar uma tarefa de classificação simples usando Torch Runtime. No exemplo, faremos uma classificação binária em um dataset gerado aleatoriamente.
ta_in: இரண்டாவதாக, டார்ச் இயக்க நேரத்தைப் பயன்படுத்தி எளிய வகைப்பாடு (classification) பணியை எப்படிச் செய்வது என்பதைக் காட்டுகிறோம். எடுத்துக்காட்டில், தோராயமாக உருவாக்கப்பட்ட தரவுத்தொகுப்பில் (dataset) பைனரி (binary) வகைப்பாட்டைச் செய்வோம்.

source: You can also query the ``train_history`` and the ``val_history`` properties.
de_de: Du kannst auch die ``train_history`` und die ``val_history`` Eigenschaften abfragen.
es_un: También puedes consultar las propiedades ``train_history`` y ``val_history``.
ja_jp: ``train_history`` プロパティと ``val_history`` プロパティをクエリすることもできます。
ko_kr: 또한 ``train_hisotry``와 ``val_history``의 특성을 쿼리할 수 있다.
pt_un: Você também pode pesquisar as propriedades ``train_history`` e ``val_history``.
ta_in: நீங்கள் ``train_history`` மற்றும் ``val_history`` பண்புகளையும் (properties) வினவலாம்.

source: The red circles indicate wrongly classified data points.
de_de: Die roten Kreise weisen auf falsch klassifizierte Datenpunkte hin.
es_un: Los círculos rojos indican puntos de datos clasificados incorrectamente.
ja_jp: 赤い丸は、誤って分類されたデータポイントを示します。
ko_kr: 빨간색 원은 잘못 분류된 데이터 포인트들을 나타낸다.
pt_un: Os círculos vermelhos indicam pontos classificados incorretamente.
ta_in: சிவப்பு வட்டங்கள் தவறாக வகைப்படுத்தப்பட்ட தரவு புள்ளிகளைக் குறிக்கின்றன.
