Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/07_pegasos_qsvc.po
Languages: es_un, ja, ko_kr, pt_un

source: This page was generated from `docs/tutorials/07_pegasos_qsvc.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/07_pegasos_qsvc.ipynb`__.
ja: このページは `docs/tutorials/07_pegasos_qsvc.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/07_pegasos_qsvc.ipynb`에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/07_pegasos_qsvc.ipynb`__.

source: Pegasos Quantum Support Vector Classifier
es_un: Clasificador Cuántico de Vectores de Soporte tipo Pegasos
ja: ペガソス量子サポートベクター分類器サポート
pt_un: Classificador quântico de vetores de suporte Pegasos

source: There’s another SVM based algorithm that benefits from the quantum kernel method. Here, we introduce an implementation of a another classification algorithm, which is an alternative version to the ``QSVC`` available in Qiskit Machine Learning and shown in the `“Quantum Kernel Machine Learning” <./03_quantum_kernel.ipynb>`__ tutorial. This classification algorithm implements the Pegasos algorithm from the paper “Pegasos: Primal Estimated sub-GrAdient SOlver for SVM” by Shalev-Shwartz et al., see: https://home.ttic.edu/~nati/Publications/PegasosMPB.pdf.
es_un: Hay otro algoritmo basado en SVM que se beneficia del método del kernel cuántico. Aquí presentamos una implementación de otro algoritmo de clasificación, que es una versión alternativa al ``QSVC`` disponible en Qiskit Machine Learning y que se muestra en el tutorial `“Machine Learning con Kernel Cuántico” <./03_quantum_kernel.ipynb>`__. Este algoritmo de clasificación implementa el algoritmo Pegasos del artículo “Pegasos: Primal Estimated sub-GrAdient SOlver for SVM” de Shalev-Shwartz et al., ver: https://home.ttic.edu/~nati/Publications/PegasosMPB.pdf.
ja: 量子カーネル法の恩恵を受けたSVMベースのアルゴリズムがもう一つあります。これはQiskit Machine Learningで利用できる ``QSVC`` の代替バージョンで、 `"量子カーネル法機械学習" <./03_quantum_kernel.ipynb>`__ tutorial で紹介されているものとは別の分類アルゴリズムの実装を紹介します。この分類アルゴリズムは、Shalev-Shwartz et al. による論文「Pegasos: Primal Estimated sub-GrAdient SOlver for SVM」のペガソスアルゴリズムを実装しています。https://home.ttic.edu/~nati/Publications/PegasosMPB.pdf を参照してください。

source: This algorithm is an alternative to the dual optimization from the ``scikit-learn`` package, benefits from the kernel trick, and yields a training complexity that is independent of the size of the training set. Thus, the ``PegasosQSVC`` is expected to train faster than QSVC for sufficiently large training sets.
es_un: Este algoritmo es una alternativa a la optimización dual del paquete ``scikit-learn``, se beneficia del truco del kernel y produce una complejidad de entrenamiento que es independiente del tamaño del conjunto de entrenamiento. Por lo tanto, se espera que ``PegasosQSVC`` entrene más rápido que QSVC para conjuntos de entrenamiento suficientemente grandes.
ja: このアルゴリズムは、 ``scikit-learn`` パッケージの二重最適化に代わるものであり、カーネルトリックの恩恵を受け、トレーニングセットのサイズに依存しないトレーニングの複雑さをもたらします。したがって、 ``PegasosQSVC`` は、十分に大きなトレーニングセットに対して、QSVC よりも高速なトレーニングが期待されます。

source: The algorithm can be used as direct replacement of ``QSVC`` with some hyper-parameterization.
es_un: El algoritmo se puede utilizar como reemplazo directo de ``QSVC`` con un poco de hiperparametrización.
ja: このアルゴリズムは、 ``QSVC`` をハイパーパラメーターに直接置き換わるものとして使用できます。
ko_kr: 이 알고리즘은 일부 하이퍼 파라미터로 ``QSVC``를 직접 대체하는데 사용될 수 있다.
pt_un: O algoritmo pode ser usado como substituição direta do ``QSVC`` com um pouco de hiper-parametrização.

source: Let’s generate some data:
es_un: Generemos algunos datos:
ja: 次のデータを生成します。
ko_kr: 몇개의 데이터를 생성한다:
pt_un: Vamos gerar alguns dados:

source: We pre-process the data to ensure compatibility with the rotation encoding and split it into the training and test datasets.
es_un: Procesamos previamente los datos para garantizar la compatibilidad con la codificación de rotación y los dividimos en conjuntos de datos de entrenamiento y prueba.
ja: ローテーション・エンコーディングとの互換性を確保するためにデータを前処理し、トレーニングデータセットとテストデータセットに分割します。
ko_kr: 회전 인코딩과 호환성을 보장하기 위해 데이터를 전처리하고 이를 학습 및 테스트 데이터 세트로 분할한다.
pt_un: Pré-processamos os dados para garantir a compatibilidade com a codificação de rotação e os dividimos nos conjuntos de dados de treinamento e teste.

source: We have two features in the dataset, so we set a number of qubits to the number of features in the dataset.
es_un: Tenemos dos características en el conjunto de datos, por lo que establecemos una cantidad de qubits para la cantidad de características en el conjunto de datos.
ja: データセットには2つの特徴があるため、データセット内の特徴の数を量子ビットの数に設定します。
ko_kr: 데이터 세트에는 두 가지 특징이 있으므로 데이터 세트의 특징 수에 따라 큐비트를 설정한다.
pt_un: Temos dois recursos no conjunto de dados, então definimos um número de qubits para o número de recursos no conjunto de dados.

source: Then we set :math:`\tau` to the number of steps performed during the training procedure. Please note that, there is no early stopping criterion in the algorithm. The algorithm iterates over all :math:`\tau` steps.
es_un: Luego establecemos :math:`\tau` al número de pasos realizados durante el procedimiento de entrenamiento. Ten en cuenta que no existe un criterio de detención anticipada en el algoritmo. El algoritmo itera sobre todos los pasos :math:`\tau`.
ja: 次に、 :math:`\tau` をトレーニング手順中に実行されるステップ数に設定します。アルゴリズムにはアーリーストッピングの基準がないことに注意してください。アルゴリズムはすべての :math:`\tau` ステップを繰り返します。
ko_kr: 그리고 나서 :math:`tau`를 학습 과정에서 수행되는 단계 수로 설정한다. 알고리즘에는 조기 종료 기준이 없다. 알고리즘은 모든 :math:`tau` 단계를 반복한다.
pt_un: Em seguida, definimos :math:`\tau` para o número de etapas realizadas durante o procedimento de treinamento. Observe que não há critério de parada antecipada no algoritmo. O algoritmo itera em todas as etapas de :math:`\tau`.

source: And the last one is the hyperparameter :math:`C`. This is a positive regularization parameter. The strength of the regularization is inversely proportional to :math:`C`. Smaller :math:`C` induce smaller weights which generally helps preventing overfitting. However, due to the nature of this algorithm, some of the computation steps become trivial for larger :math:`C`. Thus, larger :math:`C` improve the performance of the algorithm drastically. If the data is linearly separable in feature space, :math:`C` should be chosen to be large. If the separation is not perfect, :math:`C` should be chosen smaller to prevent overfitting.
es_un: Y el último es el hiperparámetro :math:`C`. Este es un parámetro de regularización positivo. La magnitud de la regularización es inversamente proporcional a :math:`C`. Entre más pequeño :math:`C` induce pesos más pequeños, lo que generalmente ayuda a prevenir el sobreajuste. Sin embargo, debido a la naturaleza de este algoritmo, algunos de los pasos de cálculo se vuelven triviales para :math:`C` más grandes. Por lo tanto, entre más grande :math:`C` mejora drásticamente el rendimiento del algoritmo. Si los datos se pueden separar linealmente en el espacio de características, :math:`C` debe elegirse para que sea grande. Si la separación no es perfecta, :math:`C` debe elegirse más pequeño para evitar el sobreajuste.
ja: そして最後のひとつはハイパーパラメータ :math:`C` です。これは正の正則化パラメータです。正則化の強さは :math:`C` に反比例します。 :math:`C` が小さいほど重みが小さくなり、一般的にオーバーフィッティングを防ぐのに役立ちます。ただし、このアルゴリズムの性質上、 :math:`C` が大きいほど、計算ステップの一部が軽薄なものになります。したがって、 :math:`C` が大きいほど、アルゴリズムのパフォーマンスが大幅に向上します。データが特徴空間で線形分離可能である場合は、 :math:`C` を大きく選択する必要があります。分離が完全でない場合は、過剰適合を防ぐためにCを小さく選択する必要があります。
ko_kr: 그리고 마지막은 하이퍼 파라미터 :math:`C`이다. 이것은 양의 정규화 매개변수다. 정규화의 강도는 :math:`C`에 반비례한다. 더 작은 :math:`C`는 일반적으로 과적합을 방지하는데 도움이 되는 작은 가중치를 유도한다. 그러나 이 알고리즘의 특성으로 인해 일부 계산 단계는 큰 :math:`C`이 된다. 그러므로 :math:`C`가 클수록 알고리즘의 성능이 크게 향상된다. 만약 데이터가 feature space에서 선형으로 분리할 수 있으면 :math:`C`를 큰 값으로 선택해야 한다. 그렇지 않다면, 과적합을 방지하기 위해 :math:`C`를 더 작게 선택해야 한다.
pt_un: E o último é o hiperparâmetro :math:`C`. Este é um parâmetro de regularização positivo. A força da regularização é inversamente proporcional a :math:`C`. :math:`C` menores induzem pesos menores que geralmente ajudam a prevenir sobreajuste. No entanto, devido à natureza deste algoritmo, alguns dos passos de computação tornam-se triviais para :math:`C` maiores. Assim, maiores :math:`C` melhoram drasticamente o desempenho do algoritmo. Se os dados são separáveis ​​linearmente no espaço de características, :math:`C` deve ser escolhido para ser grande. Se a separação não for perfeita, :math:`C` deve ser escolhido menor para evitar sobreajuste.

source: The algorithm will run using:
es_un: El algoritmo se ejecutará usando:
ja: アルゴリズムは以下を使用して実行されます。
ko_kr: 알고리즘은 다음을 사용하여 실행된다:
pt_un: O algoritmo rodará usando:

source: The default fidelity instantiated in ``FidelityQuantumKernel``
es_un: La fidelidad predeterminada instanciada en ``FidelityQuantumKernel``
ja: ``FidelityQuantumKernel`` でインスタンス化されたデフォルトのフィデリティ

source: A quantum kernel created from ``ZFeatureMap``
es_un: Un kernel cuántico creado a partir de ``ZFeatureMap``
ja: ``ZFeatureMap`` から作成された量子カーネル
ko_kr: ``ZFeatureMap`` 에서 생성된 양자 커널
pt_un: Um kernel quântico criado a partir de ``ZFeatureMap``

source: The implementation ``PegasosQSVC`` is compatible with the ``scikit-learn`` interfaces and has a pretty standard way of training a model. In the constructor we pass parameters of the algorithm, in this case there are a regularization hyper-parameter :math:`C` and a number of steps.
es_un: La implementación ``PegasosQSVC`` es compatible con las interfaces ``scikit-learn`` y tiene una forma bastante estándar de entrenar un modelo. En el constructor pasamos parámetros del algoritmo, en este caso hay un hiperparámetro de regularización :math:`C` y un número de pasos.
ja: ``PegasosQSVC`` の実装は、 ``scikit-learn`` インターフェースと互換性があり、モデルをトレーニングするためのごく標準的な方法があります。コンストラクターでは、アルゴリズムのパラメーターを渡します。この場合、正則化ハイパーパラメーター :math:`C` といくつパラメーターかのステップがあります。
ko_kr: ``PegasosQSVC`` 구현은 ``scikit-learn`` 인터페이스와 호환되며 매우 표준적인 모델 훈련 방식을 가지고 있다. 생성자에서 알고리즘의 매개변수를 전달하는데, 이 경우 정규화 하이퍼-파라미터 :math:`C` 와 여러 단계가 있다.
pt_un: A implementação ``PegasosQSVC`` é compatível com as interfaces ``scikit-learn`` e tem uma maneira muito usual de treinar um modelo. No construtor passamos parâmetros do algoritmo, neste caso há um hiperparâmetro de regularização :math:`C` e uma série de passos.

source: Then we pass training features and labels to the ``fit`` method, which trains a models and returns a fitted classifier.
es_un: Luego pasamos las características de entrenamiento y las etiquetas al método ``fit``, que entrena un modelo y devuelve un clasificador ajustado.
ja: 次に、トレーニングする特徴量とラベルを ``fit`` メソッドに渡し、学習済みの分類器を返します。
ko_kr: 그런 다음 모델을 훈련하고 적합한 분류기를 반환하는 ``fit`` 메서드에 훈련 데이터의 특징과 레이블을 전달한다.
pt_un: Em seguida, passamos recursos de treinamento e rótulos para o método ``fit``, que treina um modelo e retorna um classificador ajustado.

source: Afterwards, we score our model using test features and labels.
es_un: Luego, calificamos nuestro modelo usando características de prueba y etiquetas.
ja: その後、テスト機能とラベルを使用してモデルにスコアを付けます。
ko_kr: 그런 다음 테스트 데이터의 특징과 레이블을 사용하여 모델에 점수를 매긴다.
pt_un: Depois, pontuamos nosso modelo usando recursos de teste e rótulos.

source: For visualization purposes we create a mesh grid of a predefined step that spans our minimum and maximum values we applied in MinMaxScaler. We also add some margin to the grid for better representation of the training and test samples.
es_un: Para fines de visualización, creamos una cuadrícula de malla de un paso predefinido que abarca nuestros valores mínimo y máximo que aplicamos en MinMaxScaler. También agregamos algo de margen a la cuadrícula para una mejor representación de las muestras de entrenamiento y prueba.
ja: 可視化を目的として、MinMaxScaler で適用した最小値と最大値にまたがる定義済みのステップのメッシュグリッドを作成します。また、トレーニングとテストのサンプルをより適切に表現するため、グリッドにマージンを追加します。
ko_kr: 시각화를 위해 MinMaxScaler에 적용한 최소값과 최대값을 포괄하는 사전 정의된 단계의 격자점을 만든다. 또한 훈련 및 테스트 샘플의 더 나은 표현을 위해 격자에 약간의 마진(margin)을 추가한다.
pt_un: Para fins de visualização, criamos uma grade de malha de uma etapa predefinida que abrange nossos valores mínimo e máximo que aplicamos no MinMaxScaler. Também adicionamos alguma margem à grade para melhor representação das amostras de treinamento e teste.

source: We convert the grid to the shape compatible with the model, the shape should be ``(n_samples, n_features)``. Then for each grid point we predict a label. In our case predicted labels will be used for coloring the grid.
es_un: Convertimos la cuadrícula a la forma compatible con el modelo, la forma debe ser ``(n_samples, n_features)``. Luego, para cada punto de la cuadrícula, predecimos una etiqueta. En nuestro caso, las etiquetas predichas se utilizarán para colorear la cuadrícula.
ja: グリッドをモデルと互換性のある形状に変換します。形状は ``(n_samples, n_features)`` である必要があります。次に、グリッドポイントごとのラベルを予測します。この場合、予測ラベルはグリッドの色付けに使用されます。
ko_kr: 격자를 모델과 호환되는 모양으로 변환하며 모양은 ``(n_samples, n_features)`` 이어야 한다. 그런 다음 각 격자점에 대해 레이블을 예측한다. 예측된 레이블은 격자점의 색상을 지정하는데 사용된다.
pt_un: Convertemos a grade para uma forma compatível com o modelo, a forma deve ser ``(n_samples, n_features)``. Então, para cada ponto da grade, prevemos um rótulo. No nosso caso, os rótulos previstos serão usados ​​para colorir a grade.

source: Finally, we plot our grid according to the labels/colors we obtained from the model. We also plot training and test samples.
es_un: Finalmente, graficamos nuestra cuadrícula de acuerdo con las etiquetas/colores que obtuvimos del modelo. También graficamos las muestras de entrenamiento y prueba.
ja: 最後に、モデルから取得したラベル/色に従ってグリッドをプロットします。 また、トレーニングとテストのサンプルもプロットします。
ko_kr: 마지막으로 모델에서 얻은 레이블/색상에 따라 격자를 그린다. 훈련 및 테스트 샘플들도 그림에 표시한다.
pt_un: Por fim, traçamos nossa grade de acordo com os rótulos/cores que obtivemos do modelo. Também traçamos amostras de treinamento e teste.

source: There’s another SVM based algorithm that benefits from the quantum kernel method. Here, we introduce an implementation of a another classification algorithm, which is an alternative version to the QSVC shown above. This classification algorithm implements the Pegasos algorithm from the paper “Pegasos: Primal Estimated sub-GrAdient SOlver for SVM” by Shalev-Shwartz et al., see: https://home.ttic.edu/~nati/Publications/PegasosMPB.pdf.
ko_kr: 양자 커널 메소드로부터 얻을 수 있는 또 다른 SVM 기반 알고리즘이 있다. 여기에서는 위에 표시된 QSVC의 대체 버전인 다른 분류 알고리즘의 구현을 소개한다. 이 분류 알고리즘은 Shalev-Shwartz 등의 논문 ``Pegasos: Primal Estimated sub-GrAdient SOlver for SVM`` (https://home.ttic.edu/~nati/Publications/PegasosMPB.pdf 참조)에서 Pegasos 알고리즘을 구현한다.
pt_un: Há outro algoritmo baseado em SVM que se beneficia do método do kernel quântico. Aqui, apresentamos uma implementação de outro algoritmo de classificação, que é uma versão alternativa ao QSVC mostrado acima. Este algoritmo de classificação implementa o algoritmo Pegasos do artigo “Pegasos: Primal Estimated sub-GrAdient SOlver for SVM” de Shalev-Shwartz et al., consulte: https://home.ttic.edu/~nati/Publications/PegasosMPB.pdf.

source: This algorithm is an alternative to the dual optimization from the ``scikit-learn`` package, beneficial of the kernel trick, and yields a training complexity that is independent of the size of the training set. Thus, the ``PegasosQSVC`` is expected to train faster than QSVC for sufficiently large training sets.
ko_kr: 이 알고리즘은 커널 트릭의 이점인 ``scikit-learn`` 패키지의 이중 최적화를 대체하는 것으로 학습 세트의 크기와 무관한 학습 복잡도를 산출한다. 따라서 ``PegasosQSVC``는 충분히 큰 학습 세트에서 QSVC보다 빠르게 학습할 수 있을 것으로 예상된다.
pt_un: Este algoritmo é uma alternativa à otimização dupla do pacote ``scikit-learn``, se beneficia do truque do kernel, e produz uma complexidade de treinamento que é independente do tamanho do conjunto de treinamento. Assim, espera-se que o ``PegasosQSVC`` treine mais rápido que o QSVC para conjuntos de treinamento suficientemente grandes.

source: A statevector simulator
ko_kr: 상태벡터 시뮬레이터
pt_un: Um simulador de vetor de estado
