Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/08_quantum_kernel_trainer.po
Languages: es_un, ja, ko_kr, pt_un

source: This page was generated from `docs/tutorials/08_quantum_kernel_trainer.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/08_quantum_kernel_trainer.ipynb`__.
ja: このページは `docs/tutorials/08_quantum_kernel_trainer.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/08_quantum_kernel_trainer.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/08_quantum_kernel_trainer.ipynb`__.

source: Quantum Kernel Training for Machine Learning Applications
es_un: Entrenamiento de Kernel Cuántico para Aplicaciones de Machine Learning
ja: 機械学習アプリケーション向けの量子カーネルトレーニング
ko_kr: 기계 학습 응용프로그램(Application) 을 위한 양자 커널 학습
pt_un: Treinamento de Kernel Quântico para Aplicatições em Machine Learning

source: In this tutorial, we will train a quantum kernel on a labeled dataset for a machine learning application. To illustrate the basic steps, we will use Quantum Kernel Alignment (QKA) for a binary classification task. QKA is a technique that iteratively adapts a parametrized quantum kernel to a dataset while converging to the maximum SVM margin. More information about QKA can be found in the preprint, `"Covariant quantum kernels for data with group structure." <https://arxiv.org/abs/2105.03406>`__
ja: このチュートリアルでは、機械学習アプリケーション用のラベル付きデータセットで量子カーネルをトレーニングします。基本的な手順を説明するために、二値分類タスクに Quantum Kernel Alignment（QKA）を使用します。QKAは、最大SVMマージンに収束しながら、パラメーター化された量子カーネルをデータセットに繰り返し適応させる手法です。QKAの詳細については、プレプリントの `“Covariant quantum kernels for data with group structure” <https://arxiv.org/abs/2105.03406>`__ を参照してください。

source: The entry point to training a quantum kernel is the ``QuantumKernelTrainer`` class. The basic steps are:
es_un: El punto de entrada para entrenar un kernel cuántico es la clase ``QuantumKernelTrainer``. Los pasos básicos son:
ja: 量子カーネルをトレーニングするためのエントリポイントは、 ``QuantumKernelTrainer`` クラスです。基本的な手順は次のとおりです。
ko_kr: 양자 커널 학습의 시작점은 ``QuantumKernelTrainer`` 클래스이다. 기본 단계들은 다음과 같다:
pt_un: O ponto de entrada para treinar um kernel quântico é a classe ``QuantumKernelTrainer``. Os passos básicos são:

source: Prepare the dataset
es_un: Preparar el conjunto de datos
ja: データセットを準備する
ko_kr: 데이터셋 준비
pt_un: Prepare o dataset

source: Define the quantum feature map
es_un: Definir el mapa cuántico de características
ja: 量子特徴マップを定義する
ko_kr: 양자 특징 맵(feature map) 정의
pt_un: Definir o mapa de recursos quânticos

source: Set up an instance of ``TrainableKernel`` and ``QuantumKernelTrainer`` objects
es_un: Configurar una instancia de los objetos ``TrainableKernel`` y ``QuantumKernelTrainer``
ja: ``TrainableKernel`` インスタンスと ``QuantumKernelTrainer`` オブジェクトを設定する

source: Use the ``QuantumKernelTrainer.fit`` method to train the kernel parameters on the dataset
es_un: Utilizar el método ``QuantumKernelTrainer.fit`` para entrenar los parámetros del kernel sobre el conjunto de datos
ja: ``QuantumKernelTrainer.fit`` メソッドを使用して、データセットのカーネルパラメーターをトレーニングする
ko_kr: ``QuantumKernelTrainer.fit`` 메소드를 활용하여 주어진 데이터셋에서 커널 매개변수들을 학습
pt_un: Use o método ``QuantumKernelTrainer.fit`` para treinar os parâmetros do kernel no conjunto de dados

source: Pass the trained quantum kernel to a machine learning model
es_un: Pasar el kernel cuántico entrenado a un modelo de machine learning
ja: トレーニングされた量子カーネルを機械学習モデルに渡す
ko_kr: 학습된 양자 커널을 기계학습 모델로 전달
pt_un: Passe o kernel quântico treinado para um modelo de machine learning

source: Import Local, External, and Qiskit Packages and define a callback class for our optimizer
es_un: Importar Paquetes Locales, Externos y de Qiskit y definir una clase de devolución de llamada (callback) para nuestro optimizador
ja: ローカル、外部、Qiskitパッケージをインポートし、オプティマイザーのコールバッククラスを定義する
ko_kr: 로컬, 외부 및 Qiskit 패키지 가져오기 & 최적화를 위한 콜백(callback) 클래스 정의
pt_un: Importe pacotes locais, externos e do Qiskit e defina uma classe de callback para nosso otimizador

source: Prepare the Dataset
es_un: Preparar el Conjunto de Datos
ja: データセットを準備する
ko_kr: 데이터셋 준비
pt_un: Prepare o Dataset

source: In this guide, we will use Qiskit Machine Learning's ``ad_hoc.py`` dataset to demonstrate the kernel training process. See the documentation `here <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.datasets.ad_hoc_data.html>`__.
ja: このガイドでは、Qiskit Machine Learning の ``ad_hoc.py`` データセットを使用して、カーネルトレーニングプロセスを示します。 `こちら <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.datasets.ad_hoc_data.html>`__ のドキュメントを参照してください。

source: Define the Quantum Feature Map
es_un: Definir el Mapa Cuántico de Características
ja: 量子特徴マップを定義する
ko_kr: 양자 특징 맵(Quantum Feature Map) 정의
pt_un: Defina o mapa de recursos quânticos

source: Next, we set up the quantum feature map, which encodes classical data into the quantum state space. Here, we use a ``QuantumCircuit`` to set up a trainable rotation layer and a ``ZZFeatureMap`` from ``Qiskit`` to represent the input data.
es_un: A continuación, configuramos el mapa cuántico de características, que codifica datos clásicos en el espacio de estados cuánticos. Aquí, usamos un ``QuantumCircuit`` para configurar una capa de rotación entrenable y un ``ZZFeatureMap`` de ``Qiskit`` para representar los datos de entrada.
ja: 次に、古典的なデータを量子状態空間にエンコードする量子特徴マップを設定します。ここでは、 ``QuantumCircuit`` を使用してトレーニング可能な回転レイヤーを設定し、 ``Qiskit`` の ``ZZFeatureMap`` を使用して入力データを表します。
ko_kr: 다음으로, 고전적인 데이터를 양자 상태 공간으로 인코딩하는 양자 특징 맵을 설정한다. 훈련 가능한 회전 레이어를 설정하기 위해 ``QuantumCircuit`` 을 사용하고 입력 데이터를 표현하기 위해 ``Qiskit`` 에서 ``ZZFeatureMap`` 을 사용한다.
pt_un: Em seguida, configuramos o mapa de recursos quânticos, que codifica dados clássicos no espaço de estados quânticos. Aqui, usamos um ``QuantumCircuit`` para configurar uma camada de rotação treinável e um ``ZZFeatureMap`` do ``Qiskit`` para representar os dados de entrada.

source: Set Up the Quantum Kernel and Quantum Kernel Trainer
es_un: Configurar el Kernel Cuántico y el Entrenador de Kernel Cuántico
ja: 量子カーネルと量子カーネルトレーナーを設定する
ko_kr: 양자 커널 및 Quantum 커널 Trainer 설정
pt_un: Configure o Quantum Kernel e o Quantum Kernel Trainer

source: To train the quantum kernel, we will use an instance of ``TrainableFidelityQuantumKernel`` (holds the feature map and its parameters) and ``QuantumKernelTrainer`` (manages the training process).
es_un: Para entrenar el kernel cuántico, usaremos una instancia de ``TrainableFidelityQuantumKernel`` (que contiene el mapa de características y sus parámetros) y de ``QuantumKernelTrainer`` (que administra el proceso de entrenamiento).
ja: 量子カーネルをトレーニングするには、 ``TrainableFidelityQuantumKernel`` （特徴マップとそのパラメーターを保持）と ``QuantumKernelTrainer`` （トレーニングプロセスを管理）が必要です。

source: We will train using the Quantum Kernel Alignment technique by selecting the kernel loss function, ``SVCLoss``, as input to the ``QuantumKernelTrainer``. Since this is a Qiskit-supported loss, we can use the string, ``"svc_loss"``; however, note that default settings are used when passing the loss as a string. For custom settings, instantiate explicitly with the desired options, and pass the ``KernelLoss`` object to the ``QuantumKernelTrainer``.
es_un: Entrenaremos usando la técnica Quantum Kernel Alignment seleccionando la función de pérdida de kernel, ``SVCLoss``, como entrada al ``QuantumKernelTrainer``. Dado que esta es una pérdida compatible con Qiskit, podemos utilizar la cadena, ``"svc_loss"``; sin embargo, ten en cuenta que la configuración predeterminada se utiliza cuando se pasa la pérdida como una cadena. Para configuraciones personalizadas, crea una instancia explícitamente con las opciones deseadas y pasa el objeto ``KernelLoss`` al ``QuantumKernelTrainer``.
ja: ``QuantumKernelTrainer`` への入力としてカーネル損失関数 ``SVCLoss`` を選択することにより、Quantum Kernel Alignment 手法を使用してトレーニングします。これはQiskitでサポートされている損失であるため、文字列 ``svc_loss`` を使用できます。ただし、損失を文字列として渡す場合は、デフォルト設定が使用されることに注意してください。カスタム設定の場合は、必要なオプションを使用して明示的にインスタンス化し、 ``KernelLoss`` オブジェクトを ``QuantumKernelTrainer`` に渡します。
ko_kr: 커널 손실 함수인 ``SVCLoss`` 를 ``QuantumKernelTrainer`` 의 입력으로 선택하여 양자 커널 정렬(Alignment) 을 사용하여 훈련한다. 이는 Qiskit이 제공하는 손실값이므로 ``svc_loss`` 문자열을 사용할 수 있으며 손실값을 문자열로 전달할 때는 기본 설정이 사용됨에 유의한다. 사용자 지정 설정의 경우 원하는 옵션을 사용하여 명시적으로 인스턴스화하고 ``KernelLoss`` 객체를 ``QuantumKernelTrainer`` 에 전달한다.
pt_un: Vamos treinar usando a técnica Quantum Kernel Alignment selecionando a função de perda do kernel, ``SVCLoss``, como entrada para o ``QuantumKernelTrainer``. Como esta é uma perda suportada pelo Qiskit, podemos usar a string, ``"svc_loss"``; no entanto, observe que as configurações padrão são usadas ao passar a perda como uma string. Para configurações personalizadas, instancie explicitamente com as opções desejadas e passe o objeto ``KernelLoss`` para o ``QuantumKernelTrainer``.

source: We will select SPSA as the optimizer and initialize the trainable parameter with the ``initial_point`` argument. Note: The length of the list passed as the ``initial_point`` argument must equal the number of trainable parameters in the feature map.
es_un: Seleccionaremos SPSA como optimizador e inicializaremos el parámetro entrenable con el argumento ``initial_point``. Nota: La longitud de la lista pasada como el argumento ``initial_point`` debe ser igual al número de parámetros entrenables en el mapa de características.
ja: オプティマイザーとして SPSA を選択し、 ``initial_point`` 引数を使用してトレーニング可能なパラメーターを初期化します。注： ``initial_point`` 引数として渡されるリストの長さは、特徴量マップ内のトレーニング可能なパラメーターの数と等しくなければなりません。
ko_kr: 옵티마이저로 SPSA를 선택하고 ``initial_point`` 인자를 사용하여 학습할 수 있는 매개변수를 초기화한다. 참고: ``initial_point`` 인자로 전달된 목록의 길이는 feature map에 있는 학습 가능한 매개변수의 수와 같아야 한다.
pt_un: Vamos selecionar SPSA como o otimizador e inicializar o parâmetro treinável com o argumento ``initial_point``. Nota: O comprimento da lista passada como argumento ``initial_point`` deve ser igual ao número de parâmetros treináveis no mapa de recursos.

source: Train the Quantum Kernel
es_un: Entrenar el Kernel Cuántico
ja: 量子カーネルをトレーニングする
ko_kr: 양자 커널 학습
pt_un: Treine o Kernel Quântico

source: To train the quantum kernel on the dataset (samples and labels), we call the ``fit`` method of ``QuantumKernelTrainer``.
es_un: Para entrenar el kernel cuántico en el conjunto de datos (muestras y etiquetas), llamamos al método ``fit`` de ``QuantumKernelTrainer``.
ja: データセット（サンプルとラベル）で量子カーネルをトレーニングするために、 ``QuantumKernelTrainer`` の ``fit`` メソッドを呼び出します。
ko_kr: 양자 커널을 학습하기 위해 데이터 세트 (샘플과 레이블) 에 ``QuantumKernelTrainer`` 의 ``fit`` 함수를 호출한다.
pt_un: Para treinar o kernel quântico no conjunto de dados (amostras e rótulos), chamamos o método ``fit`` de ``QuantumKernelTrainer``.

source: The output of ``QuantumKernelTrainer.fit`` is a ``QuantumKernelTrainerResult`` object. The results object contains the following class fields: - ``optimal_parameters``: A dictionary containing {parameter: optimal value} pairs - ``optimal_point``: The optimal parameter value found in training - ``optimal_value``: The value of the loss function at the optimal point - ``optimizer_evals``: The number of evaluations performed by the optimizer - ``optimizer_time``: The amount of time taken to perform optimization - ``quantum_kernel``: A ``TrainableKernel`` object with optimal values bound to the feature map
es_un: La salida de ``QuantumKernelTrainer.fit`` es un objeto ``QuantumKernelTrainerResult``. El objeto de resultados contiene los siguientes campos de clase: - ``optimal_parameters``: Un diccionario que contiene pares {parameter: optimal value} - ``optimal_point``: El valor del parámetro óptimo encontrado en el entrenamiento - ``optimal_value``: El valor de la función de pérdida en el punto óptimo - ``optimizer_evals``: El número de evaluaciones realizadas por el optimizador - ``optimizer_time``: La cantidad de tiempo necesario para realizar la optimización - ``quantum_kernel``: Un objeto ``TrainableKernel`` con valores óptimos vinculados al mapa de características
ja: ``QuantumKernelTrainer.fit`` の出力は、 ``QuantumKernelTrainerResult`` オブジェクトです。結果オブジェクトには、次のクラスフィールドが含まれます。 - ``optimal_parameters`` ： {parameter: optimal value} ペアを含む辞書 - ``optimal_point`` ：トレーニングで見つかった最適なパラメーター値 - ``optimal_value`` ：最適なポイントでの損失関数の値 - ``optimizer_evals`` ：数値 オプティマイザーによって実行される評価の数 - ``optimizer_time`` ：最適化の実行にかかる時間 - ``quantum_kernel`` ：特徴マップにバインドされた最適値を持つ ``TrainableKernel`` オブジェクト

source: Fit and Test the Model
es_un: Ajustar y Probar el Modelo
ja: モデルの適合とテスト
ko_kr: 모델 적합(fit) 및 모델 테스트
pt_un: Ajuste e teste o modelo

source: We can pass the trained quantum kernel to a machine learning model, then fit the model and test on new data. Here, we will use Qiskit's ``QSVC`` for classification.
ja: トレーニングされた量子カーネルを機械学習モデルに渡し、モデルを適合させて新しいデータでテストすることができます。ここでは、分類に Qiskit の ``QSVC`` を使用します。

source: Visualize the Kernel Training Process
es_un: Visualizar el Proceso de Entrenamiento del Kernel
ja: カーネルトレーニングプロセスを視覚化する
ko_kr: 커널 학습 과정 시각화
pt_un: Visualize o processo de treinamento do kernel

source: From the callback data, we can plot how the loss evolves during the training process. We see it converges rapidly and reaches high test accuracy on this dataset with our choice of inputs.
es_un: A partir de los datos de la devolución de llamada (callback), podemos graficar cómo evoluciona la pérdida durante el proceso de entrenamiento. Vemos que converge rápidamente y alcanza una alta precisión de prueba en este conjunto de datos con nuestra elección de entradas.
ja: コールバックデータから、トレーニングプロセス中に損失がどのように変化するかをプロットできます。入力を選択すると、急速に収束し、このデータセットで高いテスト精度に達することがわかります。

source: We can also display the final kernel matrix, which is a measure of similarity between the training samples.
es_un: También podemos mostrar la matriz del kernel final, que es una medida de similitud entre las muestras de entrenamiento.
ja: トレーニングサンプル間の類似性の尺度である最終的なカーネル行列を表示することもできます。
ko_kr: 또한 학습 샘플들 간의 유사성 측도인 최종 커널 행렬을 표시할 수 있다.
pt_un: Também podemos exibir a matriz final do kernel, que é uma medida de similaridade entre as amostras de treinamento.

source: In this tutorial, we will train a quantum kernel on a labeled dataset for a machine learning application. To illustrate the basic steps, we will use Quantum Kernel Alignment (QKA) for a binary classification task. QKA is a technique that iteratively adapts a parametrized quantum kernel to a dataset while converging to the maximum SVM margin. More information about QKA can be found in the preprint, `“Covariant quantum kernels for data with group structure.” <https://arxiv.org/abs/2105.03406>`__
ko_kr: 본 튜토리얼에서는, 기계학습 응용을 위해 레이블이 지정된 데이터셋에서 양자 커널을 학습시킬 것이다. 기본 단계들을 설명하기 위해,우리는 이진 분류 태스크에 대해 양자 커널 정렬 (Quantum Kernel Alignment, QKA)을 사용할 것이다. QKA는 최대 SVM (서포트 벡터 머신) 여백으로 수렴하면서 매개변수화된 양자 커널을 데이터셋에 반복적으로 적응시키는 기술이다. QKA에 대한 자세한 정보는 `“Covariant quantum kernels for data with group structure.” <https://arxiv.org/abs/2105.03406>`__ 에서 찾을 수 있다.
pt_un: Neste tutorial, treinaremos um kernel quântico em um conjunto de dados rotulado para aplicação de machine learning. Para ilustrar as etapas básicas, usaremos o Quantum Kernel Alignment (QKA) para uma tarefa de classificação binária. QKA é uma técnica que adapta iterativamente um kernel quântico parametrizado a um conjunto de dados enquanto converge para a margem SVM máxima. Mais informações sobre o QKA podem ser encontradas no artigo, `“Covariant quantum kernels for data with group structure.” <https://arxiv.org/abs/2105.03406>`__

source: Set up the ``QuantumKernel`` and ``QuantumKernelTrainer`` objects
ko_kr: ``QuantumKernel`` 과 ``QuantumKernelTrainer`` 객체 설정

source: In this guide, we will use Qiskit Machine Learning’s ``ad_hoc.py`` dataset to demonstrate the kernel training process. See the documentation `here <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.datasets.ad_hoc_data.html>`__.
ko_kr: 이번에는 Qiskit Machine Learning의 ``ad_hoc.py`` 데이터 세트를 사용하여 커널 훈련 과정을 살펴보자. `이 <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.datasets.ad_hoc_data.html>`__ 문서를 참고한다.
pt_un: Neste guia, usaremos o conjunto de dados ``ad_hoc.py`` do Qiskit Machine Learning para demonstrar o processo de treinamento do kernel. Consulte a documentação `aqui <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.datasets.ad_hoc_data.html>`__.

source: To train the quantum kernel, we need a ``QuantumKernel`` (holds the feature map and its parameters) and ``QuantumKernelTrainer`` (manages the training process).
ko_kr: 양자 커널을 훈련시키기 위해서는 ``QuantumKernel`` (feature map과 해당 매개변수를 가지고 있음) 과 ``QuantumKernelTrainer`` (훈련 프로세스 관리) 가 필요하다.

source: The output of ``QuantumKernelTrainer.fit`` is a ``QuantumKernelTrainerResult`` object. The results object contains the following class fields: - ``optimal_parameters``: A dictionary containing {parameter: optimal value} pairs - ``optimal_point``: The optimal parameter value found in training - ``optimal_value``: The value of the loss function at the optimal point - ``optimizer_evals``: The number of evaluations performed by the optimizer - ``optimizer_time``: The amount of time taken to perform optimization - ``quantum_kernel``: A ``QuantumKernel`` object with optimal values bound to the feature map
ko_kr: ``QuantumKernelTrainer.fit`` 의 출력값은 ``QuantumKernelTrainerResult`` 객체이다. 결과 객체는 다음과 같은 클래스 필드를 포함한다: - ``optimal_parameters``: {parameter: optimal value} 쌍을 포함하는 자료구조 - ``optimal_point``: 학습과정에서 발견되는 최적의 매개변수 값 - ``optimal_value``: 최적점에서의 손실 함수 값 - ``optimizer_evals``: 옵티마이저에서 수행되는 평가의 수 - ``optimizer_time``: 최적화를 수행하는데 소요되는 시간 - ``quantum_kernel``: feature map에 바인딩된 최적값을 갖는 ``QuantumKernel`` 객체

source: We can pass the trained quantum kernel to a machine learning model, then fit the model and test on new data. Here, we will use Qiskit’s ``QSVC`` for classification.
ko_kr: 학습된 양자 커널을 기계 학습 모델에 전달한 후 모델에 적합(fit)시키고, 새로운 데이터를 사용하여 테스트할 수 있다. 여기서, 우리는 분류를 위해 Qiskit의 ``QSVC`` 를 사용할 것이다.
pt_un: Podemos passar o kernel quântico treinado para um modelo de machine learning, ajustar o modelo e testar novos dados. Aqui, usaremos o ``QSVC`` do Qiskit para classificação.

source: From the callback data, we can plot how the loss evolves during the training process. We see it converges rapidly and reaches 100% test accuracy on this dataset with our choice of inputs.
ko_kr: 콜백 데이터로부터 학습이 진행됨에 따라 손실이 어떻게 변화하는지 그릴 수 있다. 손실이 빠르게 수렴하며, 선택한 입력값들에 대해 이 데이터에서 테스트 정확도가 100%에 도달하는 것을 볼 수 있다.
