Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/09_saving_and_loading_models.po
Languages: de, fr, ja, ko, ta

source: Next, we want to alter the model in a way it can be trained further and on another simulator. To do so, we set the ``warm_start`` property. When it is set to ``True`` and ``fit()`` is called again the model uses weights from previous fit to start a new fit. We also set the ``sampler`` property of the underlying network to the second instance of the ``Sampler`` primitive we created in the beginning of the tutorial. Finally, we create and set a new optimizer with ``maxiter`` is set to ``80``, so the total number of iterations is ``100``.
de: Als nächstes wollen wir das Modell so ändern, dass es auf einem anderen Simulator weiter trainiert werden kann. Dazu setzen wir die ``warm_start`` Eigenschaft. Wenn es auf ``True`` gesetzt ist und ``fit()`` erneut aufgerufen wird, verwendet das Modell Gewichte aus dem vorherigen Fit, um einen neuen Fit zu starten. Wir haben auch die ``sampler`` Eigenschaft des zugrunde liegenden Netzwerkes auf die zweite Instanz des ``Sampler`` gesetzt, das wir zu Beginn des Tutorials erstellt haben. Schließlich erstellen und setzen wir einen neuen Optimierer mit ``maxiter`` auf ``80``, so dass die Gesamtzahl der Iterationen ``100`` ist.
ja: 次に、このモデルをさらに別のシミュレーターで学習できるように変更したいと思います。そのために、 ``warm_start`` プロパティを設定します。このプロパティを ``True`` に設定し、再び ``fit()`` を呼び出すと、モデルは前回のフィットで得られた重みを使用して、新しいフィットを開始します。また、基礎となるネットワークの ``sampler`` プロパティを、チュートリアルの最初に作成した ``Sampler`` primitive の2番目のインスタンスに設定します。最後に、新しいオプティマイザーを作成し、 ``maxiter`` を ``80`` に設定して、反復処理の合計回数を ``100`` に設定します。
ta: அடுத்து, மாடலை மேலும் மற்றும் மற்றொரு சிமுலேட்டரில் பயிற்சியளிக்கக்கூடிய வகையில் மாற்ற விரும்புகிறோம். அவ்வாறு செய்ய, ``warm_start`` சொத்தை அமைக்கிறோம். இது ``True`` என அமைக்கப்பட்டு ``fit()`` என அழைக்கப்படும் போது, ​​மாடல் புதிய பொருத்தத்தைத் தொடங்க முந்தைய பொருத்தத்தின் எடையைப் பயன்படுத்துகிறது. டுடோரியலின் தொடக்கத்தில் நாங்கள் உருவாக்கிய ``sampler`` ப்ரிமிட்டிவ் இன் இரண்டாவது நிகழ்வாக அடிப்படை நெட்வொர்க்கின் ``Sampler`` பண்புகளையும் அமைத்துள்ளோம். இறுதியாக, ``maxiter`` ``80`` என அமைக்கப்பட்ட புதிய ஆப்டிமைசரை உருவாக்கி அமைக்கிறோம், எனவே மொத்த மறு செய்கைகளின் எண்ணிக்கை ``100`` ஆகும்.

source: Now we continue training our model from the state we finished in the previous section.
de: Jetzt trainieren wir unser Modell aus dem Zustand, den wir im vorherigen Abschnitt fertig gestellt haben.
ja: 次に、前のセクションで終了した状態からモデルのトレーニングを続けます。
ko: 이제 이전 섹션을 완료한 상태에서 모델을 계속 학습한다.
ta: இப்போது நாங்கள் முந்தைய பிரிவில் முடித்த மாநிலத்திலிருந்து எங்கள் மாதிரியைத் தொடர்ந்து பயிற்சி செய்கிறோம்.

source: Plot the whole dataset and the highlight the points that were classified incorrectly.
de: Zeichne den gesamten Datensatz und hebe die Punkte hervor, die falsch eingestuft wurden.
ja: データセット全体をプロットし、誤って分類されたポイントを強調表示します。
ko: 전체 데이터 세트의 그래프를 그리고, 잘못 분류된 점을 강조 표시한다.
ta: முழு தரவுத்தொகுப்பையும் வரைந்து, தவறாக வகைப்படுத்தப்பட்ட புள்ளிகளை முன்னிலைப்படுத்தவும்.

source: So, if you have a large dataset or a large model you can train it in multiple steps as shown in this tutorial.
de: Wenn du also einen großen Datensatz oder ein großes Modell hast, kannst du ihn in mehreren Schritten trainieren, wie in diesem Tutorial gezeigt.
ja: したがって、大きなデータセットまたは大きなモデルがある場合は、このチュートリアルに示すように、複数のステップでトレーニングできます。
ko: 따라서 거대한 데이터 세트가 있거나 거대한 모델이 있는 경우, 이 튜토리얼에 표시된 여러 단계를 거쳐 학습할 수 있다.
ta: எனவே, உங்களிடம் பெரிய தரவுத்தொகுப்பு அல்லது பெரிய மாதிரி இருந்தால், இந்த டுடோரியலில் காட்டப்பட்டுள்ளபடி அதைப் பல படிகளில் பயிற்சி செய்யலாம்.

source: 4. PyTorch hybrid models
de: 4. PyTorch Hybridmodelle
fr: 4. Modèles hybrides PyTorch
ja: 4. PyTorchハイブリッドモデル
ko: 4. PyTorch 하이브리드 모델
ta: 4. PyTorch கலப்பின மாதிரிகள்

source: To save and load hybrid models, when using the TorchConnector, follow the PyTorch recommendations of saving and loading the models. For more details please refer to the PyTorch Connector tutorial `here <https://qiskit.org/documentation/machine-learning/tutorials/05_torch_connector.html>`__ where a short snippet shows how to do it.
de: Um Hybrid-Modelle zu speichern und zu laden, folge den PyTorchConnector-Empfehlungen zum Speichern und Laden der Modelle. Weitere Details findest du im Tutorial `hier <https://qiskit.org/documentation/machine-learning/tutorials/05_torch_connector.html>`__ des PyTorch-Connector, in dem ein kurzes Snippet zeigt, wie man es macht.
ja: ハイブリッドモデルを保存およびロードするには、TorchConnector を使用する場合、モデルの保存およびロードに関する PyTorch の推奨事項に従ってください。 詳細については、 `こちら <https://qiskit.org/documentation/machine-learning/tutorials/05_torch_connector.html>`__ のPyTorch Connectorチュートリアルを参照してください。ここでは、短いスニペットでその方法を示しています。
ko: 하이브리드 모델을 저장 및 로드하려면 TorchConnector를 사용하여 모델을 저장 및 로드하는 PyTorch 권장사항을 따른다. 자세한 내용은 PyTorch Connector 지침서 `여기 <https://qiskit.org/documentation/machine-learning/tutorials/05_torch_connector.html>`__ 를 참조하시오. 여기서 짧은 스니펫(snippet)을 통해 이를 수행하는 방법을 알 수 있다.
ta: கலப்பின மாடல்களைச் சேமிக்கவும் ஏற்றவும், டார்ச் கனெக்டரைப் பயன்படுத்தும் போது, ​​மாடல்களைச் சேமித்து ஏற்றுவதற்கான பைடார்ச் பரிந்துரைகளைப் பின்பற்றவும். மேலும் விவரங்களுக்கு, PyTorch Connector டுடோரியலைப் பார்க்கவும், `இங்கே <https://qiskit.org/documentation/machine-learning/tutorials/05_torch_connector.html>`__ அதை எப்படி செய்வது என்று ஒரு சிறிய துணுக்கைக் காட்டுகிறது.

source: Take a look at this pseudo-like code to get the idea:
de: Wirf einen Blick auf diesen pseudo-artigen Code, um eine Idee davon zu bekommen:
ja: この疑似的なコードを見て、アイデアを見つけてください。
ko: 아이디어를 얻기 위해서 다음의 준 유사 코드를 살펴보자.
ta: யோசனையைப் பெற இந்தப் போலி போன்ற குறியீட்டைப் பாருங்கள்:

source: First off, we start from the required imports. We'll heavily use SciKit-Learn on the data preparation step. In the next cell we also fix a random seed for reproducibility purposes.
fr: Tout d'abord, nous commençons par les importations requises. Nous utiliserons beaucoup SciKit-Learn pour l'étape de préparation des données. Dans la cellule suivante, nous définissons également une graine aléatoire à des fins de reproductibilité.

source: We will be using two quantum simulators, in particular, two instances of the ``Sampler`` primitive. We'll start training on the first one, then will resume training on the second one. The approach shown in this tutorial can be used to train a model on a real hardware available on the cloud and then re-use the model for inference on a local simulator.
fr: Nous allons utiliser deux simulateurs quantiques, plus particulièrement, deux instances de la primitive ``Sampler``. Nous débuterons la phase apprentissage sur la première, puis reprendrons l'apprentissage sur la deuxième. L'approche illustrée dans ce tutoriel peut être utilisée pour entraîner un modèle sur un véritable système disponible sur le cloud, puis réutiliser le modèle pour un simulateur local.

source: Let's take a look at the features of the first ``5`` samples of our dataset after the transformation.
fr: Examinons les variables des premiers ``5`` échantillons de notre ensemble de données, après la transformation.

source: Let's take a look at the labels of the first ``5`` labels of the dataset. The labels should be one-hot encoded.
fr: Examinons l'étiquetage des premiers ``5`` échantillons de l'ensemble de données. Les étiquettes devraient être encodées one-hot.

source: Now it is time to see how our dataset looks like. Let's plot it.
fr: Maintenant, il est temps de voir à quoi ressemble notre ensemble de données. Représentons le graphiquement.

source: We'll train our model using solid dots and verify it using empty dots.
fr: Nous allons former notre modèle à l'aide de points solides et le vérifier à l'aide de points vides.

source: We'll train our model in two steps. On the first step we train our model in ``20`` iterations.
fr: Nous formerons notre modèle en deux étapes. Pour la première étape, nous formons notre modèle en ``20`` itérations.

source: Let's see how well our model performs after the first step of training.
fr: Voyons à quel point notre modèle fonctionne bien après la première étape de la formation.
