Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/09_saving_and_loading models.po
Languages: pt_un

source: This page was generated from `docs/tutorials/09_saving_and_loading models.ipynb`__.
pt_un: Esta página foi gerada a partir de `docs/tutorials/09_saving_and_loading models.ipynb`__.

source: Saving, Loading Qiskit Machine Learning Models and Continuous Training
pt_un: Salvando, carregando modelos de machine learning do Qiskit e treinamento contínuo

source: In this tutorial we will show how to save and load Qiskit machine learning models. Ability to save a model is very important, especially when a significant amount of time is invested in training a model on a real hardware. Also, we will show how to resume training of the previously saved model.
pt_un: Neste tutorial, mostraremos como salvar e carregar modelos de aprendizado de máquina do Qiskit. A capacidade de salvar um modelo é muito importante, especialmente quando uma quantidade significativa de tempo é investida no treinamento de um modelo em um hardware real. Além disso, mostraremos como retomar o treinamento do modelo salvo anteriormente.

source: In this tutorial we will cover how to:
pt_un: Neste tutorial, abordaremos como:

source: Generate a simple dataset, split it into training/test datasets and plot them
pt_un: Gere um conjunto de dados simples, divida-o em conjuntos de dados de treinamento/teste e plote-os

source: Train and save a model
pt_un: Treine e salve um modelo

source: Load a saved model and resume training
pt_un: Carregue um modelo salvo e retome o treinamento

source: Evaluate performance of models
pt_un: Avalie o desempenho dos modelos

source: PyTorch hybrid models
pt_un: Modelos híbridos do PyTorch

source: First off, we start from the required imports. We’ll heavily use SciKit-Learn on the data preparation step. In the next cell we also fix a random seed for reproducibility purposes.
pt_un: Primeiro, começamos com as importações necessárias. Usaremos bastante o SciKit-Learn na etapa de preparação de dados. Na próxima célula também fixamos uma semente aleatória para fins de reprodutibilidade.

source: We will be using two quantum simulators. We’ll start training on the QASM simulator then will resume training on the statevector simulator. The approach shown in this tutorial can be used to train a model on a real hardware available on the cloud and then re-use the model for inference on a local simulator.
pt_un: Estaremos usando dois simuladores quânticos. Começaremos o treinamento no simulador QASM e retomaremos o treinamento no simulador de vetor de estado. A abordagem mostrada neste tutorial pode ser usada para treinar um modelo em um hardware real disponível na nuvem e, em seguida, reutilizar o modelo para inferência em um simulador local.

source: 1. Prepare a dataset
pt_un: 1. Prepare o dataset

source: Next step is to prepare a dataset. Here, we generate some data in the same way as in other tutorials. The difference is that we apply some transformations to the generated data. We generates ``40`` samples, each sample has ``2`` features, so our features is an array of shape ``(40, 2)``. Labels are obtained by summing up features by columns and if the sum is more than ``1`` then this sample is labeled as ``1`` and ``0`` otherwise.
pt_un: O próximo passo é preparar um conjunto de dados. Aqui, geramos alguns dados da mesma forma que em outros tutoriais. A diferença é que aplicamos algumas transformações nos dados gerados. Nós geramos ``40`` amostras, cada amostra tem ``2`` recursos, então nossos recursos são uma matriz de forma ``(40, 2)``. Os rótulos são obtidos somando os recursos por colunas e, se a soma for maior que ``1``, essa amostra será rotulada como ``1`` e, caso contrário, ``0``.

source: Then, we scale down our features into a range of ``[0, 1]`` by applying ``MinMaxScaler`` from SciKit-Learn. Model training convergence is better when this transformation is applied.
pt_un: Em seguida, reduzimos nossos recursos em uma faixa de ``[0, 1]`` aplicando ``MinMaxScaler`` do SciKit-Learn. A convergência de treinamento do modelo é melhor quando essa transformação é aplicada.

source: Let’s take a look at the features of the first ``5`` samples of our dataset after the transformation.
pt_un: Vamos dar uma olhada nos recursos das primeiras ``5`` amostras do nosso conjunto de dados após a transformação.

source: We choose ``VQC`` or Variational Quantum Classifier as a model we will train. This model, by default, takes one-hot encoded labels, so we have to transform the labels that are in the set of ``{0, 1}`` into one-hot representation. We employ SciKit-Learn for this transformation as well. Please note that the input array must be reshaped to ``(num_samples, 1)`` first. The ``OneHotEncoder`` encoder does not work with 1D arrays and our labels is a 1D array. In this case a user must decide either an array has only one feature(our case!) or has one sample. Also, by default the encoder returns sparse arrays, but for dataset plotting it is easier to have dense arrays, so we set ``sparse`` to ``False``.
pt_un: Escolhemos ``VQC`` ou Variational Quantum Classifier como modelo que iremos treinar. Este modelo, por padrão, aceita rótulos codificados one-hot, então temos que transformar os rótulos que estão no conjunto de ``{0, 1}`` em representação one-hot. Também empregamos o SciKit-Learn para essa transformação. Observe que o array de entrada deve ser remodelado para ``(num_samples, 1)`` primeiro. O codificador ``OneHotEncoder`` não funciona com arrays 1D e nossos rótulos são arrays 1D. Neste caso, o usuário deve decidir se um array tem apenas um recurso (nosso caso!) ou tem uma amostra. Além disso, por padrão, o codificador retorna arrays dispersos, mas para plotagem de conjuntos de dados é mais fácil ter arrays densos, então configuramos ``sparse`` para ``False``.

source: Let’s take a look at the labels of the first ``5`` labels of the dataset. The labels should be one-hot encoded.
pt_un: Vamos dar uma olhada nos rótulos dos primeiros ``5`` rótulos do conjunto de dados. Os rótulos devem ser codificados em one-hot.

source: Now we split our dataset into two parts: a training dataset and a test one. As a rule of thumb, 80% of a full dataset should go into a training part and 20% into a test one. Our training dataset has ``30`` samples. The test dataset should be used only once, when a model is trained to verify how well the model behaves on unseen data. We employ ``train_test_split`` from SciKit-Learn.
pt_un: Agora dividimos nosso conjunto de dados em duas partes: um conjunto de dados de treinamento e um de teste. Como regra geral, 80% de um conjunto de dados completo deve ir para uma parte de treinamento e 20% para uma parte de teste. Nosso conjunto de dados de treinamento tem ``30`` amostras. O conjunto de dados de teste deve ser usado apenas uma vez, quando um modelo é treinado para verificar como o modelo se comporta em dados não vistos. Nós empregamos ``train_test_split`` do SciKit-Learn.

source: Now it is time to see how our dataset looks like. Let’s plot it.
pt_un: Agora é hora de ver como nosso conjunto de dados se parece. Vamos plotá-lo.

source: On the plot above we see:
pt_un: No gráfico acima vemos:

source: Solid blue dots are the samples from the training dataset labeled as ``0``
pt_un: Os pontos azuis sólidos são as amostras do conjunto de dados de treinamento, rotulado como ``0``

source: Empty blue dots are the samples from the test dataset labeled as ``0``
pt_un: Os pontos azuis vazios são as amostras do conjunto de dados de teste, rotulado como ``0``

source: Solid green dots are the samples from the training dataset labeled as ``1``
pt_un: Os pontos verdes sólidos são as amostras do conjunto de dados de treinamento, rotulado como ``1``

source: Empty green dots are the samples from the test dataset labeled as ``1``
pt_un: Os pontos verdes vazios são as amostras do conjunto de dados de teste, rotulado como ``1``

source: We’ll train our model using solid dots and verify it using empty dots.
pt_un: Treinaremos nosso modelo usando pontos sólidos e o verificaremos usando pontos vazios.

source: 2. Train a model and save it
pt_un: 2. Treine um modelo e salve-o

source: We’ll train our model in two steps. On the first step we train our model in ``20`` iterations.
pt_un: Vamos treinar nosso modelo em duas etapas. Na primeira etapa treinamos nosso modelo em ``20`` iterações.

source: Create an empty array for callback to store values of the objective function.
pt_un: Crie uma matriz vazia de callback para armazenar valores da função objetivo.

source: We re-use a callback function from the Neural Network Classifier & Regressor tutorial to plot iteration versus objective function value with some minor tweaks to plot objective values at each step.
pt_un: Reutilizamos a função callback do tutorial do Classificador & Regressor de Rede Neural para plotar iteração versus valores da função objetiva com alguns pequenos ajustes para plotar valores objetivos em cada etapa.

source: As mentioned above we train a ``VQC`` model and set ``COBYLA`` as an optimizer with a chosen value of the ``maxiter`` parameter. Then we evaluate performance of the model to see how well it was trained. Then we save this model for a file. On the second step we load this model and will continue to work with it.
pt_un: Como mencionado acima, treinamos um modelo ``VQC`` e definimos ``COBYLA`` como um otimizador com um valor escolhido do parâmetro ``maxiter``. Em seguida, avaliamos o desempenho do modelo para ver quão bem ele foi treinado. Em seguida, salvamos esse modelo em um arquivo. Na segunda etapa, carregamos esse modelo e continuaremos trabalhando com ele.

source: Here, we manually construct an ansatz to fix an initial point where to start optimization from.
pt_un: Aqui, construímos manualmente um ansatz para fixar um ponto de partida para iniciar a otimização.

source: We create a model and set a quantum instance to the QASM simulator we created earlier.
pt_un: Criamos um modelo e definimos uma instância quântica para o simulador QASM que criamos anteriormente.

source: Now it is time to train the model.
pt_un: Agora é hora de treinar o modelo.

source: Let’s see how well our model performs after the first step of training.
pt_un: Vamos ver o desempenho do nosso modelo após a primeira etapa do treinamento.

source: Next, we save the model. You may choose any file name you want. Please note that the ``save`` method does not append an extension if it is not specified in the file name.
pt_un: Em seguida, salvamos o modelo. Você pode escolher qualquer nome de arquivo que desejar. Observe que o método ``save`` não adiciona uma extensão se não for especificado no nome do arquivo.

source: 3. Load a model and continue training
pt_un: 3. Carregue um modelo e continue o treinamento

source: To load a model a user have to call a class method ``load`` of the corresponding model class. In our case it is ``VQC``. We pass the same file name we used in the previous section where we saved our model.
pt_un: Para carregar um modelo o usuário tem que chamar o método de classe ``load`` da classe de modelo correspondente. No nosso caso é ``VQC``. Passamos o mesmo nome de arquivo que usamos na seção anterior onde salvamos nosso modelo.

source: Next, we want to alter the model in a way it can be trained further and on another simulator. To do so, we set the ``warm_start`` property. When it is set to ``True`` and ``fit()`` is called again the model uses weights from previous fit to start a new fit. We also set quantum instance of the underlying network to the statevector simulator we created in the beginning of the tutorial. Finally, we create and set a new optimizer with ``maxiter`` is set to ``80``, so the total number of iterations is ``100``.
pt_un: Em seguida, queremos alterar o modelo de forma que possa ser treinado ainda mais e em outro simulador. Para isso, definimos a propriedade ``warm_start``. Quando é definido como ``True`` e ``fit()`` é chamado novamente, o modelo usa os pesos do ajuste anterior para iniciar um novo ajuste. Também definimos a instância quântica da rede subjacente para o simulador de vetor de estado que criamos no início do tutorial. Finalmente, criamos e configuramos um novo otimizador com ``maxiter`` definido como ``80``, então o número total de iterações é ``100``.

source: Now we continue training our model from the state we finished in the previous section.
pt_un: Agora continuamos treinando nosso modelo a partir do estado que terminamos na seção anterior.

source: Let’s see which data points were misclassified. First, we call ``predict`` to infer predicted values from the training and test features.
pt_un: Vamos ver quais pontos de dados foram classificados incorretamente. Primeiro, chamamos ``predict`` para inferir valores previstos dos recursos de treinamento e teste.

source: Plot the whole dataset and the highlight the points that were classified incorrectly.
pt_un: Plote todo o conjunto de dados e destaque os pontos que foram classificados incorretamente.

source: So, if you have a large dataset or a large model you can train it in multiple steps as shown in this tutorial.
pt_un: Portanto, se você tiver um grande conjunto de dados ou um modelo grande, poderá treiná-lo em várias etapas, conforme mostrado neste tutorial.

source: 4. PyTorch hybrid models
pt_un: 4. Modelos híbridos do PyTorch

source: To save and load hybrid models, when using the TorchConnector, follow the PyTorch recommendations of saving and loading the models. For more details please refer to the PyTorch Connector tutorial `here <https://qiskit.org/documentation/machine-learning/tutorials/05_torch_connector.html>`__ where a short snippet shows how to do it.
pt_un: Para salvar e carregar modelos híbridos, ao usar o TorchConnector, siga as recomendações do PyTorch de salvar e carregar os modelos. Para obter mais detalhes, consulte o tutorial do conector PyTorch `aqui <https://qiskit.org/documentation/machine-learning/tutorials/05_torch_connector.html>`__ onde um pequeno trecho mostra como fazê-lo.

source: Take a look at this pseudo-like code to get the idea:
pt_un: Dê uma olhada neste pseudo-código para ter uma ideia:
