Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/09_saving_and_loading_models.po
Languages: de, fr, ja, ko, ta

source: This page was generated from `docs/tutorials/09_saving_and_loading_models.ipynb`__.
de: Diese Seite wurde aus `docs/tutorials/09_saving_and_loading_models.ipynb`__ generiert.
fr: Cette page a été générée à partir de `docs/tutorials/05_uploading_program.ipynb`__.
ja: このページは `docs/tutorials/09_saving_and_loading_models.ipynb`__ から生成されました。
ta: இந்தப் பக்கம் `docs/tutorials/௦௯_saving_and_loading_models.app`__ சட்டத்தால் உருவாக்கப்பட்டது.

source: Saving, Loading Qiskit Machine Learning Models and Continuous Training
de: Speichern, Laden von Qiskit Machine Learning Modellen und kontinuierliches Training
fr: Sauvegarder, Charger les modèles Qiskit Machine Learning et Entraînement Continu
ja: Qiskit機械学習モデルの保存、読み込み、継続的なトレーニング
ko: 저장, Qiskit 머신 러닝 모델 로딩 및 연속 학습
ta: சேமிப்பு, கிஸ்கிட் இயந்திர கற்றல் மாதிரிகளை ஏற்றுதல் மற்றும் தொடர்ச்சியான பயிற்சி

source: In this tutorial we will show how to save and load Qiskit machine learning models. Ability to save a model is very important, especially when a significant amount of time is invested in training a model on a real hardware. Also, we will show how to resume training of the previously saved model.
de: In diesem Tutorial werden wir zeigen, wie man Qiskit-Maschine-Lerning-Modelle speichert und lädt. Die Möglichkeit, ein Modell zu speichern, ist sehr wichtig, insbesondere wenn ein beträchtlicher Zeitaufwand in das Training eines Modells auf einer realen Hardware investiert wird. Außerdem werden wir zeigen, wie das Training des zuvor gespeicherten Modells wieder aufgenommen werden kann.
fr: Dans ce tutoriel nous montrerons comment enregistrer et charger les modèles d'apprentissage automatique Qiskit. La fonctionalité de sauvegarde d'un modèle est très importante, surtout lorsque beaucoup de temps est investi dans l'entraînment d'un modèle sur un véritable système. De plus, nous montrerons comment reprendre l'entraînment du modèle précédemment enregistré.
ja: このチュートリアルでは、Qiskit機械学習モデルを保存およびロードする方法を示します。モデルを保存する機能は非常に重要です。特に、実際のハードウェアでモデルをトレーニングするためにかなりの時間が費やされている場合です。また、以前に保存したモデルのトレーニングを再開する方法も示します。
ko: 이 튜토리얼에서는 Qiskit 머신 러닝 모델을 저장하고 로드하는 방법을 다룬다. 모델을 저장하는 기능은 특히 실제 하드웨어에서 모델을 학습하는 데에 많은 시간을 소모되는 경우 매우 중요합니다. 또한 이전에 저장한 학습 모델을 재 사용하는 방법을 보여준다.
ta: இந்த டுடோரியலில் Qiskit இயந்திர கற்றல் மாதிரிகளை எவ்வாறு சேமிப்பது மற்றும் ஏற்றுவது என்பதைக் காண்பிப்போம். ஒரு மாதிரியைச் சேமிக்கும் திறன் மிகவும் முக்கியமானது, குறிப்பாக உண்மையான வன்பொருளில் ஒரு மாதிரியைப் பயிற்றுவிப்பதில் கணிசமான அளவு நேரத்தை முதலீடு செய்யும் போது. மேலும், முன்பு சேமித்த மாதிரியின் பயிற்சியை எவ்வாறு மீண்டும் தொடங்குவது என்பதை நாங்கள் காண்பிப்போம்.

source: In this tutorial we will cover how to:
de: In diesem Tutorial schauen wir uns Folgendes an:
fr: Dans ce tutoriel, nous allons apprendre à :
ja: このチュートリアルでは、次の方法について説明します。
ko: 이 사용 지침서에서는 다음을 수행하는 방법에 대해 설명한다:
ta: இந்த டுடோரியலில், எப்படி செய்வது என்று பார்ப்போம்:

source: Generate a simple dataset, split it into training/test datasets and plot them
de: Erstelle einen einfachen Datensatz, teile ihn in Trainings-/Test-Datensätze und gib ihn aus
fr: Générer un simple ensemble de données, le diviser en ensembles d'apprentissage et de test, et les représenter graphiquement
ja: 単純なデータセットを生成し、それをトレーニング/テストデータセットに分割してプロットします
ko: 간단한 데이터셋을 생성하고 학습/테스트 데이터셋으로 분할하고 그래프를 그려본다.
ta: எளிய தரவுத்தொகுப்பை உருவாக்கி, அதை பயிற்சி/சோதனை தரவுத்தொகுப்புகளாகப் பிரித்து அவற்றைத் திட்டமிடுங்கள்

source: Train and save a model
de: Ein Modell trainieren und speichern
fr: Entraînez et sauvegarder un modèle
ja: モデルをトレーニングして保存する
ko: 모델 훈련후 저장
ta: ஒரு மாதிரியைப் பயிற்றுவித்துச் சேமிக்கவும்

source: Load a saved model and resume training
de: Ein gespeichertes Modell laden und das Training fortsetzen
fr: Charger un modèle sauvegardé et reprendre l'apprentissage
ja: 保存したモデルをロードしてトレーニングを再開します
ko: 저장된 모델 로드 및 학습 재개
ta: சேமித்த மாதிரியை ஏற்றிப் பயிற்சியை மீண்டும் தொடங்கவும்

source: Evaluate performance of models
de: Leistung von Modellen bewerten
fr: Évaluer la performance des modèles
ja: モデルのパフォーマンスを評価する
ko: 모델 성능 평가
ta: மாதிரிகளின் செயல்திறனை மதிப்பிடுங்கள்

source: PyTorch hybrid models
de: PyTorch-Hybridmodelle
fr: Modèles hybrides PyTorch
ja: PyTorchハイブリッドモデル
ko: PyTorch 하이브리드 모델
ta: பைடார்ச் கலப்பின மாதிரிகள்

source: 1. Prepare a dataset
de: 1. Datensatz vorbereiten
fr: 1. Préparer un ensemble de données
ja: 1. データセットの準備
ko: 1. 데이터셋 준비
ta: 1. தரவுத்தொகுப்பைத் தயாரிக்கவும்

source: Next step is to prepare a dataset. Here, we generate some data in the same way as in other tutorials. The difference is that we apply some transformations to the generated data. We generates ``40`` samples, each sample has ``2`` features, so our features is an array of shape ``(40, 2)``. Labels are obtained by summing up features by columns and if the sum is more than ``1`` then this sample is labeled as ``1`` and ``0`` otherwise.
de: Der nächste Schritt besteht darin, einen Datensatz vorzubereiten. Hier erzeugen wir einige Daten auf die gleiche Weise wie in anderen Tutorials. Der Unterschied besteht darin, dass wir einige Transformationen auf die erzeugten Daten anwenden. Wir generieren ``40`` Proben, jedes Beispiel hat ``2`` Features, also sind unsere Features ein Array der Form ``(40, 2)``. Labels werden durch das Summieren von Features in Spalten erhalten und wenn die Summe mehr als ``1`` ist, wird dieses Sample mit ``1`` gelabelt und ``0`` andernfalls.
fr: L'étape suivante consiste à préparer un ensemble de données. Ici, nous générons des données de la même façon que dans d'autres tutoriels. La différence est que nous appliquons certaines transformations aux données générées. Nous générons ``40`` échantillons, chaque échantillon a ``2`` variables, donc nos variables sont un ensemble de forme ``(40, 2)``. L'étiquetage est obtenu en additionnant les variables par colonnes et si la somme est supérieure à ``1``, alors cet échantillon est marqué comme ``1`` et ``0`` autrement.
ja: 次のステップは、データセットを準備することです。ここでは、他のチュートリアルと同じ方法でいくつかのデータを生成します。違いは、生成されたデータにいくつかの変換を適用することです。 ``40`` のサンプルを生成し、各サンプルには ``2`` の特徴があるため、私たちの特徴は形状 ``(40, 2)`` の配列です。ラベルは、列ごとに特徴を合計することによって取得され、合計が ``1`` より大きい場合、このサンプルは ``1`` および ``0`` としてラベル付けされます。
ko: 다음 단계는 데이터셋을 준비하는 것이다. 여기서는 다른 튜토리얼과 동일한 방법으로 일부 데이터를 생성한다. 차이점은 생성된 데이터에 일부 변환을 적용한다는 것이다. ``40`` 개의 샘플을 생성하고, 각 샘플은 ``2`` 개의 특징을 가지고 있으므로 특징은 크기가 ``(40, 2)`` 인 배열이다. 레이블은 열별로 특징들을 합산하여 얻으며 합계가 ``1`` 보다 크면 이 샘플은 ``1`` 그렇지 않으면 ``0`` 으로 표기한다.
ta: அடுத்த படி தரவுத்தொகுப்பைத் தயாரிப்பது. மற்ற டுடோரியல்களைப் போலவே இங்கேயும் சில தரவுகளை உருவாக்குகிறோம். வித்தியாசம் என்னவென்றால், உருவாக்கப்பட்ட தரவுகளுக்கு சில மாற்றங்களைப் பயன்படுத்துகிறோம். நாங்கள் ``40`` மாதிரிகளை உருவாக்குகிறோம், ஒவ்வொரு மாதிரியிலும் ``2`` அம்சங்கள் உள்ளன, எனவே எங்கள் அம்சங்கள் ``(40, 2)`` வடிவத்தின் வரிசையாகும். நெடுவரிசைகள் மூலம் அம்சங்களைச் சுருக்கி லேபிள்கள் பெறப்படுகின்றன, மேலும் கூட்டுத்தொகை ``1``க்கு அதிகமாக இருந்தால், இந்த மாதிரி ``1`` மற்றும் ``0`` என லேபிளிடப்படும்.

source: Then, we scale down our features into a range of ``[0, 1]`` by applying ``MinMaxScaler`` from SciKit-Learn. Model training convergence is better when this transformation is applied.
de: Dann reduzieren wir unsere Funktionen auf einen Bereich von ``[0, 1]`` indem wir ``MinMaxScaler`` von SciKit-Learn anwenden. Die Konvergenz der Trainingsmodelle ist besser, wenn diese Transformation angewandt wird.
fr: Ensuite, nous réduisons nos variables à ``[0, 1]`` en appliquant ``MinMaxScaler`` de SciKit-Learn. La convergence de l'entraînement du modèle est meilleure lorsque cette transformation est appliquée.
ja: 次に、SciKit-Learnの ``MinMaxScaler`` を適用して、特徴量を ``[0, 1]`` の範囲に削減します。この変換を適用すると、モデルトレーニングの収束が向上します。
ko: 그런 다음 SciKit-Learn의 ``MinMaxScaler`` 를 적용하여 기능을 ``[0, 1]`` 범위로 축소한다. 이러한 변환을 적용하면 모델을 학습시킬 때 더 잘 수렴한다.
ta: பிறகு, SciKit-Learn இலிருந்து ``MinMaxScaler`` ஐப் பயன்படுத்துவதன் மூலம் எங்கள் அம்சங்களை ``[0, 1]`` வரம்பிற்குள் அளவிடுகிறோம். இந்த மாற்றம் பயன்படுத்தப்படும்போது மாதிரிப் பயிற்சி ஒருங்கிணைப்பு சிறப்பாக இருக்கும்.

source: We choose ``VQC`` or Variational Quantum Classifier as a model we will train. This model, by default, takes one-hot encoded labels, so we have to transform the labels that are in the set of ``{0, 1}`` into one-hot representation. We employ SciKit-Learn for this transformation as well. Please note that the input array must be reshaped to ``(num_samples, 1)`` first. The ``OneHotEncoder`` encoder does not work with 1D arrays and our labels is a 1D array. In this case a user must decide either an array has only one feature(our case!) or has one sample. Also, by default the encoder returns sparse arrays, but for dataset plotting it is easier to have dense arrays, so we set ``sparse`` to ``False``.
de: Wir wählen ``VQC`` oder Variational Quantum Classifier als Modell, das wir trainieren. Dieses Modell nimmt standardmäßig eine one-hot Kodierte-Bezeichnung auf, also müssen wir die Labels, die im Satz ``{0, 1}`` sind, in eine one-hot Repräsentation umwandeln. Wir verwenden auch SciKit-Learn für diese Transformation. Bitte beachte, dass das Eingabearray zuerst in ``(num_samples, 1)`` umgestaltet werden muss. Der ``OneHotEncoder`` funktioniert nicht mit 1D Arrays und unsere Labels sind ein 1D Array. In diesem Fall muss ein Benutzer entscheiden, ob ein Array nur ein Feature hat (unser Fall!) oder ein Sample. Außerdem gibt der Encoder standardmäßig sparse Arrays zurück, aber für das Plotten von Datensätzen ist es einfacher, dichte Arrays zu haben. Daher setzen wir ``sparse`` auf ``False``.
ja: トレーニングするモデルとして、``VQC`` または変分量子分類器を選択します。このモデルは、デフォルトでワンホットエンコードされたラベルを使用するため、 ``{0, 1}`` のセットに含まれるラベルをワンホット表現に変換する必要があります。この変換にもSciKit-Learnを採用しています。入力配列は、最初に ``(num_samples, 1)`` に再変換する必要があることに注意してください。 ``OneHotEncoder`` エンコーダーは一次元配列では機能せず、ラベルは一次元配列です。この場合、ユーザーは、配列に特徴量がひとつしかない（この場合！）か、サンプルがひとつあるかを判断する必要があります。また、デフォルトでは、エンコーダーはスパース配列を返しますが、データセットプロットの場合、密な配列を使用する方が簡単なので、 ``sparse`` を ``False`` に設定します。
ko: 훈련할 모델로는 ``VQC`` 혹은 변분 양자 분류기(Variational Quantum Classifier)를 선택한다. 기본적으로 이 모델은 one-hot 인코딩된 레이블을 사용하므로, ``{0, 1}`` 세트에 있는 레이블을 one-hot 표현법으로 변환해야 한다. 이 변환을 위해서 동일하게 SciKit-Learn를 이용한다. 입력 배열이 ``(num_samples, 1)`` 과 같은 형태로 바뀌게 됨에 주의한다. ``OneHotEncoder`` 인코더는 1D 배열에는 작동하지 않지만, 우리의 레이블은 1D 배열 이므로, 이 경우 사용자는 배열이 우리가 직면한 문제와 같이 하나의 feature 만을 갖는지, 또는 하나의 sample 만을 갖는 것인지 결정해야 한다. 또한 기본적으로 인코더는 희소 배열을 반환하지만, 조밀한 배열을 갖는 것이 데이터 세트를 플롯팅하기에 더 쉽기 때문에, ``sparse`` 를 ``False`` 로 설정한다.
ta: நாங்கள் பயிற்சியளிக்கும் மாதிரியாக ``VQC` அல்லது மாறுபாடு குவாண்டம் வகைப்படுத்தியைத் தேர்வு செய்கிறோம். இந்த மாதிரி, இயல்பாக, ஒரு சூடான குறியிடப்பட்ட லேபிள்களை எடுக்கும், எனவே ``{0, 1}`` தொகுப்பில் உள்ள லேபிள்களை ஒரு சூடான பிரதிநிதித்துவமாக மாற்ற வேண்டும். இந்த மாற்றத்திற்கும் நாங்கள் SciKit-Learn ஐப் பயன்படுத்துகிறோம். உள்ளீட்டு அணிவரிசை முதலில் ``(num_samples, 1)`` என மறுவடிவமைக்கப்பட வேண்டும் என்பதை நினைவில் கொள்ளவும். ``OneHotEncoder`` குறியாக்கி 1D வரிசைகளுடன் வேலை செய்யாது மற்றும் எங்கள் லேபிள்கள் 1D வரிசையாகும். இந்த வழக்கில், ஒரு வரிசைக்கு ஒரே ஒரு அம்சம் (எங்கள் வழக்கு!) அல்லது ஒரு மாதிரி உள்ளது என்பதை பயனர் தீர்மானிக்க வேண்டும். மேலும், முன்னிருப்பாக, குறியாக்கி அரிதான வரிசைகளை வழங்குகிறது, ஆனால் தரவுத்தொகுப்பு திட்டமிடலுக்கு அடர்த்தியான வரிசைகளை வைத்திருப்பது எளிதாக இருக்கும், எனவே நாம் ``sparse`` என்பதை `False`` என அமைக்கிறோம்.

source: Now we split our dataset into two parts: a training dataset and a test one. As a rule of thumb, 80% of a full dataset should go into a training part and 20% into a test one. Our training dataset has ``30`` samples. The test dataset should be used only once, when a model is trained to verify how well the model behaves on unseen data. We employ ``train_test_split`` from SciKit-Learn.
de: Jetzt haben wir unseren Datensatz in zwei Teile aufgeteilt: einen Trainingsdatensatz und einen Testdatensatz. Als Faustregel gilt, dass 80 % des gesamten Datensatzes in einen Trainingsteil und 20 % in einen Testteil gehen sollten. Unser Trainingsdatensatz enthält ``30`` Beispiele. Der Testdatensatz sollte nur einmal verwendet werden, wenn ein Modell trainiert wird, um zu überprüfen, wie gut sich das Modell bei noch nicht gesehenen Daten verhält. Wir verwenden ``train_test_split`` von SciKit-Learn.
fr: Maintenant, nous divisons notre ensemble de données en deux parties : un ensemble de données d'entraînement et un ensemble de données de test. En règle générale, 80 % d'un ensemble de données devrait être dédié à l'entraînement et 20 % au test. Notre ensemble de données d'entraînement a ``30`` échantillons. L'ensemble de données de test ne devrait être utilisé qu'une seule fois, lorsqu'un modèle est formé pour vérifier comment le modèle se comporte sur les données nouvelles. Nous utilisons ``train_test_split`` de SciKit-Learn.
ja: 次に、データセットをトレーニングデータセットとテストデータセットの2つの部分に分割します。経験則として、完全なデータセットの80％はトレーニング部分に、20％はテスト部分に入れる必要があります。トレーニングデータセットには ``30`` のサンプルがあります。テストデータセットは、モデルが見えないデータでどの程度適切に動作するかを検証するためにモデルがトレーニングされている場合に、一度だけ使用する必要があります。SciKit-Learnの ``train_test_split`` を採用しています。
ko: 이제 데이터 세트를 훈련 데이터 세트와 테스트 데이터 세트의 두 부분으로 나눈다. 일반적으로 전체 데이터 세트의 80%는 훈련 부분에, 20%는 테스트 부분에 할당한다. 우리의 경우 훈련 데이터 세트에는 ``30`` 개의 샘플이 있다. 테스트 데이터 세트는 모델이 보이지 않는 데이터에 대해 모델이 얼마나 잘 작동하는지 확인하도록 훈련될 때 한 번만 사용하도록 한다. SciKit-Learn의 ``train_test_split``을 사용하여 데이터를 나눈다.
ta: இப்போது எங்கள் தரவுத்தொகுப்பை இரண்டு பகுதிகளாகப் பிரிக்கிறோம்: பயிற்சி தரவுத்தொகுப்பு மற்றும் சோதனை ஒன்று. கட்டைவிரல் விதியாக, முழு தரவுத்தொகுப்பில் 80% பயிற்சிப் பகுதியிலும் 20% சோதனையிலும் செல்ல வேண்டும். எங்கள் பயிற்சி தரவுத்தொகுப்பில் ``30`` மாதிரிகள் உள்ளன. சோதனை தரவுத்தொகுப்பு ஒரு முறை மட்டுமே பயன்படுத்தப்பட வேண்டும், மாடல் பார்க்காத தரவில் எவ்வளவு சிறப்பாக செயல்படுகிறது என்பதை சரிபார்க்க ஒரு மாதிரி பயிற்சி அளிக்கப்படும். நாங்கள் SciKit-Learn இலிருந்து ``Train_test_split`` ஐப் பயன்படுத்துகிறோம்.

source: On the plot above we see:
de: Auf dem Diagramm oben sehen wir:
fr: Sur le graphique ci-dessus, nous remarquons :
ja: 上記のプロットでは、次のようになります。
ko: 위의 그래프를 보면 다음과 같다:
ta: மேலே உள்ள சதியில் நாம் பார்க்கிறோம்:

source: Solid blue dots are the samples from the training dataset labeled as ``0``
de: Ausgefüllte blaue Punkte beschreiben die Proben aus dem Trainingsdatensatz, welche mit ``0`` gelabelt sind
fr: Les points bleus solides sont les échantillons de l'ensemble de données d'entraînement, annotés ``0``
ja: 青に塗られた点は、 ``0`` というラベルの付いたトレーニングデータセットからのサンプルです。
ko: 안이 채워진 청색 점은 ``0`` 으로 표시된 훈련 데이터 셋의 샘플이다.
ta: திட நீல புள்ளிகள் என்பது ``0`` எனப் பெயரிடப்பட்ட பயிற்சி தரவுத்தொகுப்பிலிருந்து மாதிரிகள்

source: Empty blue dots are the samples from the test dataset labeled as ``0``
de: Leere blaue Punkte beschreiben die Proben aus dem Testdatensatz, welche mit ``0`` gelabelt sind
fr: Les points bleus vides sont les échantillons de l'ensemble de données de test, annotés ``0``
ja: 青い枠線だけの点は、 ``0`` というラベルの付いたテストデータセットからのサンプルです。
ko: 비어 있는 파란색 점은 ``0`` 으로 레이블 된 테스트 데이터 셋의 샘플이다.
ta: வெற்று நீல புள்ளிகள் என்பது ``0`` என லேபிளிடப்பட்ட சோதனை தரவுத்தொகுப்பிலிருந்து மாதிரிகள்

source: Solid green dots are the samples from the training dataset labeled as ``1``
de: Ausgefüllte grüne Punkte beschreiben die Proben aus dem Trainingsdatensatz, welche mit ``1`` gelabelt sind
fr: Les points verts solides sont les échantillons de l'ensemble de données d'entraînement, annotés ``1``
ja: 緑に塗られた点は、 ``1`` というラベルの付いたトレーニングデータセットからのサンプルです。
ko: 안이 채워진 녹색 점은 ``1`` 로 표시된 훈련 데이터 셋의 샘플이다.
ta: திட பச்சை புள்ளிகள் என்பது ``1`` எனப் பெயரிடப்பட்ட பயிற்சி தரவுத்தொகுப்பிலிருந்து மாதிரிகள்

source: Empty green dots are the samples from the test dataset labeled as ``1``
de: Leere grüne Punkte beschreiben die Proben aus dem Testdatensatz, welche mit ``1`` gelabelt sind
fr: Les points verts vides sont les échantillons de l'ensemble de données de test, annotés ``1``
ja: 緑色の枠線だけの点は、 ``1`` というラベルの付いたテストデータセットからのサンプルです。
ko: 비어 있는 초록색 점은 ``1`` 로 레이블된 테스트 데이터 셋의 샘플이다.
ta: வெற்று பச்சை புள்ளிகள் என்பது ``1`` என லேபிளிடப்பட்ட சோதனை தரவுத்தொகுப்பிலிருந்து மாதிரிகள்

source: 2. Train a model and save it
de: 2. Trainiere ein Modell und speicher es
fr: 2. Entraîner un modèle et le sauvegarder
ja: 2. モデルをトレーニングして保存する
ko: 2. 모델을 훈련 시키고 저장하기
ta: 2. ஒரு மாதிரியைப் பயிற்றுவித்து அதைச் சேமிக்கவும்

source: Create an empty array for callback to store values of the objective function.
de: Erstelle ein leeres Array für das Callback, um Werte der Zielfunktion zu speichern.
fr: Créez un tableau vide pour le rappel afin de stocker les valeurs de la fonction objectif.
ja: 目的関数の値を格納するためのコールバック用の空の配列を作成します。
ko: 목표 함수의 값을 저장하는 콜백을 위해서 비어 있는 배열을 생성하라.
ta: புறநிலை செயல்பாட்டின் மதிப்புகளைச் சேமிப்பதற்காகத் திரும்ப அழைப்பதற்கு வெற்று வரிசையை உருவாக்கவும்.

source: We re-use a callback function from the Neural Network Classifier & Regressor tutorial to plot iteration versus objective function value with some minor tweaks to plot objective values at each step.
de: Wir verwenden eine Callback-Funktion aus dem Tutorial "Neural Network Classifier & Regressor", um mit einigen kleineren Anpassungen ein Diagramm mit Iteration gegenüber dem Zielfunktionswert zu erstellen, um Diagramme der Zielwerte bei jedem Schritt zu erstellen.
fr: Nous réutiliserons une fonction de rappel à partir du tutoriel Classificateur de réseau de neurones & Regressor pour tracer la valeur de l'itération par rapport à la valeur de la fonction objectif avec quelques petits tweaks pour tracer des valeurs objectives à chaque étape.
ja: ニューラル・ネットワーク分類（Neural Network Classifier & Regressor）のチュートリアルのコールバック関数を再利用して、反復と目的関数の値をプロットし、いくつかの微調整を加えて、各ステップで目的値をプロットします。
ko: 각 단계에서 목표 값을 플롯하기 위해, Neural Network Classifier & Regressor tutorial의 콜백 함수를 다시 사용하여 약간의 수정을 가한 목표 함수의 값을 iteration에 대해 플롯한다.
ta: நியூரல் நெட்வொர்க் கிளாசிஃபையர் & ரீக்ரஸர் டுடோரியலிலிருந்து மீண்டும் கால்பேக் செயல்பாட்டைப் பயன்படுத்தி, ஒவ்வொரு அடியிலும் புறநிலை மதிப்புகளைத் திட்டமிடுவதற்கு சில சிறிய மாற்றங்களுடன் மறு செய்கை மற்றும் புறநிலை செயல்பாடு மதிப்பைத் திட்டமிடுவோம்.

source: As mentioned above we train a ``VQC`` model and set ``COBYLA`` as an optimizer with a chosen value of the ``maxiter`` parameter. Then we evaluate performance of the model to see how well it was trained. Then we save this model for a file. On the second step we load this model and will continue to work with it.
de: Wie oben erwähnt, trainieren wir ein ``VQC`` Modell und setzen ``COBYLA`` als Optimierer mit einem ausgewählten Wert des ``maxiter`` Parameters. Dann bewerten wir die Leistung des Modells, um zu sehen, wie gut es trainiert wurde, und speichern dieses Modell für eine Datei. Im zweiten Schritt werden wir dieses Modell laden und weiter daran arbeiten.
fr: Comme mentionné ci-dessus, nous formons un modèle ` ` VQC ` ` et définissez ` ` COBYLA ` ` en tant qu'optimiseur avec une valeur choisie du paramètre ` ` maxiter ` `. Ensuite, nous évaluons les performances du modèle pour voir à quel point il a été formé. Ensuite, nous sauvegartons ce modèle pour un fichier. Au cours de la deuxième étape, nous chargerons ce modèle et nous continuerons à travailler avec lui.
ja: 上記のように、 ``VQC`` モデルをトレーニングし、 ``maxiter`` パラメーターの選択された値を使用して ``COBYLA`` をオプティマイザーとして設定します。次に、モデルのパフォーマンスを評価して、モデルがどの程度適切にトレーニングされたかを確認します。次に、このモデルをファイルに保存します。2番目のステップでは、このモデルをロードし、引き続き作業します。
ko: 위에서 언급한 것과 같이 ``VQC`` 모델을 훈련시키고 ``maxiter`` 매개변수를 갖는 ``COBYLA`` 를 최적화 알고리즘으로 설정했다. 그런 다음 모델의 성능을 평가하여 얼마나 잘 훈련되었는지 확인하고, 이 모델을 파일로 저장한다. 두 번째 단계에서는 이 모델을 불러와서 작업을 계속한다.
ta: மேலே குறிப்பிட்டுள்ளபடி, ``VQC`` மாதிரியைப் பயிற்றுவித்து, ``maxiter`` அளவுருவின் தேர்ந்தெடுக்கப்பட்ட மதிப்பைக் கொண்டு ``COBYLA`` ஐ ஆப்டிமைசராக அமைக்கிறோம். மாதிரியின் செயல்திறன் எவ்வளவு நன்றாகப் பயிற்றுவிக்கப்பட்டது என்பதைப் பார்க்க, அதன் செயல்திறனை மதிப்பீடு செய்கிறோம். இந்த மாதிரியை ஒரு கோப்பிற்காக சேமிக்கிறோம். இரண்டாவது கட்டத்தில், இந்த மாதிரியை ஏற்றுகிறோம், அதனுடன் தொடர்ந்து வேலை செய்வோம்.

source: Here, we manually construct an ansatz to fix an initial point where to start optimization from.
de: Hier erstellen wir manuell einen Ansatz, um einen Anfangspunkt zu fixieren, von dem aus mit der Optimierung begonnen werden soll.
fr: Ici, nous construisons manuellement un ansatz pour fixer un point initial où commencer l'optimisation à partir de.
ja: ここでは、最適化を開始する最初のポイントを修正するために、手動で ansatzを作成します。
ko: 여기에서, 최적화를 시작할 초기 지점을 조정하기 위해 직접 ansatz를 구성한다.
ta: இங்கே, மேம்படுத்தலைத் தொடங்குவதற்கான ஆரம்பப் புள்ளியைச் சரிசெய்ய, ஒரு ansatz ஐ கைமுறையாக உருவாக்குகிறோம்.

source: We create a model and set a sampler to the first sampler we created earlier.
de: Wir erstellen ein Modell und setzen einen Sampler auf den ersten Sampler, den wir früher erstellt haben.
fr: Nous créons un modèle et nous fixons un échantillonneur au premier échantillonneur que nous avons créé précédemment.
ja: モデルを作成し、sampler を先ほど作成した最初のsampler に設定します。
ta: நாங்கள் ஒரு மாதிரியை உருவாக்கி, முன்பு உருவாக்கிய முதல் மாதிரிக்கு ஒரு மாதிரியை அமைக்கிறோம்.

source: Now it is time to train the model.
de: Nun ist es an der Zeit, das Modell zu trainieren.
fr: Il est maintenant temps de former le modèle.
ja: 次に、モデルをトレーニングします。
ko: 이제 우리의 모델을 학습해보자.
ta: இப்போது மாதிரியைப் பயிற்றுவிப்பதற்கான நேரம் இது.

source: Next, we save the model. You may choose any file name you want. Please note that the ``save`` method does not append an extension if it is not specified in the file name.
de: Als Nächstes speichern wir das Modell. Du kannst einen beliebigen Dateinamen auswählen. Bitte beachte, dass die ``save`` Methode keine Erweiterung anhängt, wenn sie nicht im Dateinamen angegeben ist.
ja: 次に、モデルを保存します。任意のファイル名を選択できます。ファイル名に拡張子が指定されていない場合、 ``save`` メソッドは拡張子を追加しないことに注意してください。
ko: 다음으로 모델을 저장한다. 원하는 파일 이름을 선택할 수 있다. 파일 이름이 지정되지 않은 경우 ``save`` 메소드는 확장자를 추가하지 않는다.
ta: அடுத்து, மாதிரியைச் சேமிக்கிறோம். நீங்கள் விரும்பும் எந்தக் கோப்பு பெயரையும் தேர்வு செய்யலாம். கோப்பு பெயரில் குறிப்பிடப்படாவிட்டால், ``save`` முறை நீட்டிப்பைச் சேர்க்காது என்பதை நினைவில் கொள்ளவும்.

source: 3. Load a model and continue training
de: 3. Ein Modell laden und das Training fortsetzen
fr: 3. Charger un modèle et poursuivre la formation
ja: 3. モデルをロードし、トレーニングを続行する
ko: 3. 모델을 불러오고 계속 학습하기
ta: 3. ஒரு மாதிரியை ஏற்றிப் பயிற்சியைத் தொடரவும்

source: To load a model a user have to call a class method ``load`` of the corresponding model class. In our case it is ``VQC``. We pass the same file name we used in the previous section where we saved our model.
de: Um ein Modell zu laden, muss ein Benutzer eine Klassenmethode ``load`` der entsprechenden Modellklasse aufrufen. In unserem Fall ist es ``VQC``. Wir übergeben den gleichen Dateinamen wie im vorherigen Abschnitt, wo wir unser Modell gespeichert haben.
ja: モデルをロードするには、ユーザーは対応するモデルクラスのクラスメソッド ``load`` を呼び出す必要があります。 私たちの場合は ``VQC`` です。モデルを保存した前のセクションで使用したのと同じファイル名を渡します。
ko: 모델을 불러오려면 사용자가 해당 모델 클래스의 ``load`` 클래스 메소드를 호출해야 한다. 우리의 경우에는 ``VQC`` 이다. 우리는 이전 섹션에서 사용한 것과 같은 파일 이름을 사용하여 모델을 저장했다.
ta: ஒரு மாதிரியை ஏற்றுவதற்கு, ஒரு பயனர், தொடர்புடைய மாதிரி வகுப்பின் வகுப்பு முறையை ``load`` என்று அழைக்க வேண்டும். எங்கள் விஷயத்தில் அது ``VQC``. எங்கள் மாதிரியைச் சேமித்த முந்தைய பிரிவில் நாங்கள் பயன்படுத்திய அதே கோப்புப் பெயரை நாங்கள் அனுப்புகிறோம்.
