Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/10_effective_dimension.po
Languages: es_un, ja, ko, pt_un, ta

source: We can define the number of input samples and weight samples and the class will randomly sample a corresponding array from a normal (for ``input_samples``) or a uniform (for ``weight_samples``) distribution. Instead of passing a number of samples we can pass an array, sampled manually.
es_un: Podemos definir el número de muestras de entrada y muestras de peso y la clase muestreará aleatoriamente un arreglo correspondiente a una distribución normal (para ``input_samples``) o uniforme (para ``weight_samples``). En lugar de pasar una cantidad de muestras, podemos pasar un arreglo, muestreado manualmente.
ja: 入力サンプルと重みサンプルの数を定義できます。クラスは、正規（ ``input_samples`` の場合）または均一（ ``weight_samples`` の場合）の分布から対応する配列をランダムにサンプリングします。 多数のサンプルを渡す代わりに、手動でサンプリングされた配列を渡すことができます。
ko: 사용자는 입력 샘플과 가중치 샘플의 수를 정의할 수 있으며 클래스는 정규(``input_samples`` 의 경우) 또는 균일(``weight_samples`` 의 경우) 분포에서 해당 배열을 무작위로 샘플링한다. 샘플의 갯수를 전달하는 대신 수동으로 샘플링된 배열을 전달할 수 있다.
pt_un: Podemos definir o número de amostras de entrada e amostras de peso e a classe irá amostrar aleatoriamente um array correspondente de uma distribuição normal (para ``input_samples``) ou uma distribuição uniforme (para ``weight_samples``). Em vez de passar um número de amostras, podemos passar um array, amostrado manualmente.
ta: உள்ளீட்டு மாதிரிகள் மற்றும் எடை மாதிரிகளின் எண்ணிக்கையை நாம் வரையறுக்கலாம் மற்றும் வகுப்பு தோராயமாக ஒரு சாதாரண (``input_samples``) அல்லது ஒரு சீரான (``weight_samples``) விநியோகத்திலிருந்து தொடர்புடைய வரிசையை மாதிரி செய்யும். பல மாதிரிகளை அனுப்புவதற்குப் பதிலாக, ஒரு வரிசையை கைமுறையாக மாதிரியாக அனுப்பலாம்.

source: If we want to test a specific set of input samples and weight samples, we can provide it directly to the ``EffectiveDimension`` class as shown in the following snippet:
es_un: Si queremos probar un conjunto específico de muestras de entrada y muestras de peso, podemos proporcionarlo directamente a la clase ``EffectiveDimension`` como se muestra en el siguiente fragmento de código:
ja: 入力サンプルと重みサンプルの特定のセットをテストする場合は、次のスニペットに示すように、それを ``EffectiveDimension`` クラスに直接提供できます。
ko: 특정 세트의 입력 샘플과 가중치 샘플을 테스트하려는 경우 다음 스니펫과 같이 ``EffectiveDimension`` 클래스에 직접 전달할 수 있다.
pt_un: Se quisermos testar um conjunto específico de amostras de entrada e amostras de peso, podemos fornecê-lo diretamente à classe ``EffectiveDimension``, conforme mostrado no trecho a seguir:
ta: உள்ளீட்டு மாதிரிகள் மற்றும் எடை மாதிரிகளின் குறிப்பிட்ட தொகுப்பைச் சோதிக்க விரும்பினால், பின்வரும் துணுக்கில் காட்டப்பட்டுள்ளபடி நேரடியாக ``EffectiveDimension`` வகுப்பிற்கு வழங்கலாம்:

source: The effective dimension algorithm also requires a dataset size. In this example, we will define an array of sizes to later see how this input affects the result.
es_un: El algoritmo de dimensión efectiva también requiere un tamaño de conjunto de datos. En este ejemplo, definiremos un arreglo de tamaños para luego ver cómo esta entrada afecta el resultado.
ja: 有効な次元アルゴリズムには、データセットサイズも必要です。この例では、サイズの配列を定義して、後でこの入力が結果にどのように影響するかを確認します。
ko: 유효 차원 알고리즘을 위해 데이터 세트 크기도 제공해야 한다. 이 예에서는 나중에 이 입력이 결과에 어떤 영향을 미치는지 확인하기 위해 크기 배열을 설정한다.
pt_un: O algoritmo de dimensão efetiva também requer um tamanho de conjunto de dados. Neste exemplo, definiremos uma matriz de tamanhos para ver posteriormente como essa entrada afeta o resultado.
ta: பயனுள்ள பரிமாண அல்காரிதத்திற்கு தரவுத்தொகுப்பு அளவும் தேவைப்படுகிறது. இந்த எடுத்துக்காட்டில், இந்த உள்ளீடு முடிவை எவ்வாறு பாதிக்கிறது என்பதைப் பார்க்க, அளவுகளின் வரிசையை வரையறுப்போம்.

source: 3.3 Compute Global Effective Dimension
es_un: 3.3 Calcular la Dimensión Efectiva Global
ja: 3.3 グローバル実効次元の計算
ko: 3.3 글로벌 유효 차원 계산
pt_un: 3.3 Calcular Dimensão Efetiva Global
ta: 3.3 உலகளாவிய பயனுள்ள பரிமாணத்தைக் கணக்கிடுங்கள்

source: Let’s now calculate the effective dimension of our network for the previously defined set of input samples, weights, and a dataset size of 5000.
es_un: Ahora calculemos la dimensión efectiva de nuestra red para el conjunto previamente definido de muestras de entrada, pesos y un tamaño de conjunto de datos de 5000.
ja: 次に、以前に定義した一連の入力サンプル、重み、および5000のデータセットサイズについて、ネットワークの有効な次元を計算しましょう。
ko: 이제, 사전 정의된 입력 샘플 세트, 가중치 및 5000개의 데이터 세트 크기에 대해 네트워크의 유효 차원을 계산해 보자.
pt_un: Vamos agora calcular a dimensão efetiva de nossa rede para o conjunto previamente definido de amostras de entrada, pesos e um tamanho de conjunto de dados de 5.000.

source: The effective dimension values will range between 0 and ``d``, where ``d`` represents the dimension of the model, and it’s practically obtained from the number of weights of the QNN. By dividing the result by ``d``, we can obtain the normalized effective dimension, which correlates directly with the capacity of the model.
es_un: Los valores efectivos de dimensión oscilarán entre 0 y ``d``, donde ``d`` representa la dimensión del modelo, y se obtiene prácticamente a partir del número de pesos de la QNN. Al dividir el resultado entre ``d``, podemos obtener la dimensión efectiva normalizada, que se correlaciona directamente con la capacidad del modelo.
ja: 有効な次元値の範囲は0〜 ``d`` です。ここで、 ``d`` はモデルの次元を表し、実際にはQNNの重みの数から取得されます。結果を ``d`` で割ることにより、モデルの容量と直接相関する正規化された実効次元を取得できます。
ko: 유효 차원 값의 범위는 0부터 ``d`` 까지이다. 여기서 ``d`` 는 모델의 차원을 나타내며 실제로 QNN의 가중치 수에서 얻는다. 결과를 ``d`` 로 나누면 정규화된 유효 차원을 얻을 수 있으며 이 값은 모델의 용량(capacity)과 직접적인 상관관계가 있다.
pt_un: Os valores de dimensão efetiva irão variar entre 0 e ``d``, onde ``d`` representa a dimensão do modelo, e é praticamente obtido a partir do número de pesos do QNN. Ao dividir o resultado por ``d``, podemos obter a dimensão efetiva normalizada, que se correlaciona diretamente com a capacidade do modelo.

source: By calling the ``EffectiveDimension`` class with an array if input sizes ``n``, we can monitor how the effective dimension changes with the dataset size.
es_un: Al llamar a la clase ``EffectiveDimension`` con un arreglo de tamaños de entrada ``n``, podemos monitorear cómo cambia la dimensión efectiva con el tamaño del conjunto de datos.
ja: 入力サイズが ``n`` の場合に配列を使用して ``EffectiveDimension`` クラスを呼び出すことにより、データセットサイズによって有効な次元がどのように変化するかを監視できます。
ko: 입력 크기가 ``n`` 인 경우 배열로 ``EffectiveDimension`` 클래스를 호출하면 데이터 세트 크기에 따라 유효 차원이 어떻게 변하는지 모니터링할 수 있다.
pt_un: Ao chamar a classe ``Effective Dimension`` com um array se os tamanhos de entrada forem ``n``, podemos monitorar como a dimensão efetiva muda com o tamanho do conjunto de dados.
ta: உள்ளீட்டு அளவுகள் ``n`` எனில் அணிவரிசையுடன் ``EffectiveDimension`` வகுப்பை அழைப்பதன் மூலம், தரவுத்தொகுப்பின் அளவுடன் பயனுள்ள பரிமாணம் எவ்வாறு மாறுகிறது என்பதைக் கண்காணிக்கலாம்.

source: 4. Local Effective Dimension Example
es_un: 4. Ejemplo de Dimensión Efectiva Local
ja: 4. ローカル有効次元の例
ko: 4. 로컬 유효 차원 예제
pt_un: 4. Exemplo de dimensão local efetiva
ta: 4. லோக்கல் எஃபெக்டிவ் டைமன்ஷன் உதாரணம்

source: As explained in the introduction, the local effective dimension algorithm only uses **one** set of weights, and it can be used to monitor how training affects the expressiveness of a neural network. The ``LocalEffectiveDimension`` class enforces this constraint to ensure that these calculations are conceptually separate, but the rest of the implementation is shared with ``EffectiveDimension``.
es_un: Como se explicó en la introducción, el algoritmo de dimensión efectiva local solo usa **un** conjunto de pesos y se puede usar para monitorear cómo el entrenamiento afecta la expresividad de una red neuronal. La clase ``LocalEffectiveDimension`` impone esta restricción para garantizar que estos cálculos sean conceptualmente independientes, pero el resto de la implementación se comparte con ``EffectiveDimension``.
ja: はじめに説明したように、ローカル有効次元アルゴリズムは **1** セットの重みのみを使用し、トレーニングがニューラルネットワークの表現力にどのように影響するかを監視するために使用できます。 ``LocalEffectiveDimension`` クラスは、これらの計算が概念的に分離されていることを確認するためにこの制約を適用しますが、実装の残りの部分は ``EffectiveDimension`` と共有されます。
ko: 앞에서 살펴본 것과 같이, 로컬 유효 차원 알고리즘은 **하나의** 가중치 집합만 사용하며 훈련이 신경망의 표현력에 미치는 영향을 모니터링하는 데 사용할 수 있다. ``LocalEffectiveDimension`` 클래스가 제약 조건을 적용함으로서 계산의 중요한 기능을 구현하는 동시에 계산의 나머지 부분은 ``EffectiveDimension`` 과 공유된다.
pt_un: Conforme explicado na introdução, o algoritmo de dimensão efetiva local usa apenas **um** conjunto de pesos e pode ser usado para monitorar como o treinamento afeta a expressividade de uma rede neural. A classe ``LocalEffectiveDimension`` impõe essa restrição para garantir que esses cálculos sejam conceitualmente separados, mas o resto da implementação é compartilhada com ``EffectiveDimension``.
ta: அறிமுகத்தில் விளக்கப்பட்டுள்ளபடி, உள்ளூர் பயனுள்ள பரிமாண வழிமுறையானது **ஒன்று** எடைகளின் தொகுப்பை மட்டுமே பயன்படுத்துகிறது, மேலும் பயிற்சியானது நரம்பியல் வலையமைப்பின் வெளிப்பாட்டை எவ்வாறு பாதிக்கிறது என்பதைக் கண்காணிக்கப் பயன்படுகிறது. இந்தக் கணக்கீடுகள் கருத்தியல் ரீதியாக தனித்தனியாக இருப்பதை உறுதிசெய்ய ``LocalEffective Dimension`` வகுப்பு இந்தக் கட்டுப்பாட்டைச் செயல்படுத்துகிறது, ஆனால் மீதமுள்ள செயல்படுத்தல் ``Effective Dimension`` உடன் பகிரப்படுகிறது.

source: This example shows how to leverage the ``LocalEffectiveDimension`` class to analyze the effect of training on QNN expressiveness.
es_un: Este ejemplo muestra cómo aprovechar la clase ``LocalEffectiveDimension`` para analizar el efecto del entrenamiento en la expresividad de la QNN.
ja: この例は、 ``LocalEffectiveDimension`` クラスを活用して、QNNの表現力に対するトレーニングの効果を分析する方法を示しています。
ko: 이 예제는 학습이 QNN 표현력에 미치는 영향을 분석하기 위해 ``LocalEffectiveDimension`` 클래스를 활용하는 방법을 보여준다.
pt_un: Este exemplo mostra como aproveitar a classe ``LocalEffectiveDimension`` para analisar o efeito do treinamento na expressividade do QNN.
ta: QNN வெளிப்பாட்டின் மீதான பயிற்சியின் விளைவை பகுப்பாய்வு செய்ய ``LocalEffective Dimension`` வகுப்பை எவ்வாறு பயன்படுத்துவது என்பதை இந்த எடுத்துக்காட்டு காட்டுகிறது.

source: 4.1 Define Dataset and QNN
es_un: 4.1 Definir el Conjunto de Datos y la QNN
ja: 4.1 データセットとQNNの定義
ko: 4.1 데이터셋 및 QNN 정의
pt_un: 4.1 Defina o Conjunto de Dados e QNN
ta: 4.1 தரவுத்தொகுப்பு மற்றும் QNN ஐ வரையறுக்கவும்

source: We start by creating a 3D binary classification dataset using ``make_classification`` function from scikit-learn.
es_un: Comenzamos creando un conjunto de datos de clasificación binaria 3D utilizando la función ``make_classification`` de scikit-learn.
ja: まず、scikit-learnの ``make_classification`` 関数を用いて、3Dバイナリー分類データセットを作成することから始めます。

source: The next step is to create a QNN, an instance of ``EstimatorQNN`` in our case in the same fashion we created an instance of ``SamplerQNN``.
es_un: El siguiente paso es crear una QNN, una instancia de ``EstimatorQNN`` en nuestro caso de la misma manera que creamos una instancia de ``SamplerQNN``.
ja: 次のステップはQNNを作成することで、この場合は ``EstimatorQNN`` のインスタンスを ``SamplerQNN`` のインスタンスと同じ方法で作成します。

source: 4.2 Train QNN
es_un: 4.2 Entrenar la QNN
ja: 4.2 QNNのトレーニング
ko: 4.2 QNN 학습
pt_un: 4.2 Treine o QNN
ta: 4.2 ரயில் QNN

source: We can now proceed to train the QNN. The training step may take some time, be patient. You can pass a callback to the classifier to observe how the training process is going on. We fix ``initial_point`` for reproducibility purposes as usual.
es_un: Ahora podemos proceder a entrenar la QNN. El paso de entrenamiento puede tomar algún tiempo, sé paciente. Puedes pasar una devolución de llamada al clasificador para observar cómo se desarrolla el proceso de entrenamiento. Fijamos ``initial_point`` con fines de reproducibilidad, como de costumbre.
ja: これで、QNNのトレーニングに進むことができます。トレーニングステップには時間がかかる場合があります。しばらくお待ちください。 分類器にコールバックを渡して、トレーニングプロセスがどのように進行しているかを観察できます。 通常どおり、再現性のために ``initial_point`` を修正します。
ko: 이제 QNN 학습을 시작해보자. 학습 단계는 다소 시간이 걸릴 수 있다. 학습 과정이 어떻게 진행되고 있는지 살펴보기 위해 분류기에 콜백을 전달할 수도 있다. 다른 예제에서와 같이 재현성을 위해 initial_point 를 고정한다.
pt_un: Agora podemos prosseguir para treinar o QNN. A etapa de treinamento pode levar algum tempo, seja paciente. Você pode passar um callback para o classificador para observar como o processo de treinamento está acontecendo. Corrigimos o ``initial_point`` para fins de reprodutibilidade, como de costume.
ta: நாம் இப்போது QNN க்கு பயிற்சி அளிக்கத் தொடரலாம். பயிற்சி படி சிறிது நேரம் ஆகலாம், பொறுமையாக இருங்கள். பயிற்சி செயல்முறை எவ்வாறு நடக்கிறது என்பதைக் கவனிக்க, வகைப்படுத்திக்கு நீங்கள் திரும்ப அழைப்பை அனுப்பலாம். வழக்கம்போல் மறுஉருவாக்கம் நோக்கங்களுக்காக ``initial_point`` ஐ சரிசெய்கிறோம்.

source: The classifier can now differentiate between classes with an accuracy of:
es_un: El clasificador ahora puede diferenciar entre clases con una precisión de:
ja: 分類器は、次の精度でクラスを区別できるようになりました。
ko: 만들어진 분류기는 아래와 같은 정확도로 클래스를 구별할 수 있다:
pt_un: O classificador agora pode diferenciar entre classes com uma precisão de:
ta: வகைப்படுத்தி இப்போது வகுப்புகளை துல்லியமாக வேறுபடுத்த முடியும்:

source: 4.3 Compute Local Effective Dimension of trained QNN
es_un: 4.3 Calcular la Dimensión Efectiva Local de QNN entrenadas
ja: 4.3 トレーニングされたQNNのローカル有効次元を計算する
ko: 4.3 학습된 QNN의 로컬 유효 차원 계산
pt_un: 4.3 Calcular Dimensão Efetiva Local do QNN treinado
ta: 4.3 பயிற்சியளிக்கப்பட்ட QNN இன் உள்ளூர் பயனுள்ள பரிமாணத்தைக் கணக்கிடுங்கள்

source: Now that we have trained our network, let’s evaluate the local effective dimension based on the trained weights. To do that we access the trained weights directly from the classifier.
es_un: Ahora que hemos entrenado nuestra red, evaluemos la dimensión efectiva local en función de los pesos entrenados. Para ello accedemos a los pesos entrenados directamente desde el clasificador.
ja: ネットワークをトレーニングしたので、トレーニングした重みに基づいてローカルの有効次元を評価しましょう。そのために、分類器から直接トレーニング済みの重みにアクセスします。
ko: 네트워크 학습이 마무리 되었으므로, 학습된 가중치를 기반으로 로컬 유효 차원을 평가해 보자. 이를 위해 분류기에서 직접 학습된 가중치에 액세스한다.
pt_un: Agora que treinamos nossa rede, vamos avaliar a dimensão efetiva local com base nos pesos treinados. Para isso, acessamos os pesos treinados diretamente do classificador.

source: 4.4 Compute Local Effective Dimension of untrained QNN
es_un: 4.4 Calcular la Dimensión Efectiva Local de QNN no entrenadas
ja: 4.4 トレーニングされていないQNNのローカル有効次元を計算する
ko: 4.4 학습되지 않은 QNN의 로컬 유효 차원 계산
pt_un: 4.4 Calcular Dimensão Efetiva Local de QNN não treinado
ta: 4.4 பயிற்சி பெறாத QNN இன் உள்ளூர் பயனுள்ள பரிமாணத்தைக் கணக்கிடுங்கள்

source: We can compare this result with the effective dimension of the untrained network, using the ``initial_point`` as our weight sample:
es_un: Podemos comparar este resultado con la dimensión efectiva de la red no entrenada, usando el ``initial_point`` como nuestra muestra de peso:
ja: 重みのサンプルとして ``initial_point`` を使用して、この結果をトレーニングされていないネットワークの有効な次元と比較できます。
ko: 가중치 샘플로 ``initial_point`` 를 사용하여 이 결과를 훈련되지 않은 네트워크의 유효 차원과 비교할 수 있다.
pt_un: Podemos comparar este resultado com a dimensão efetiva da rede não treinada, usando o ``initial_point`` como nossa amostra de peso:
ta: எங்கள் எடை மாதிரியாக ``initial_point`` ஐப் பயன்படுத்தி, பயிற்சி பெறாத நெட்வொர்க்கின் பயனுள்ள பரிமாணத்துடன் இந்த முடிவை ஒப்பிடலாம்:

source: 4.5 Plot and analyze results
es_un: 4.5 Graficar y analizar resultados
ja: 4.5 結果のプロットと分析
ko: 4.5 결과를 도식화 하고(Plot) 분석하기
pt_un: 4.5 Plote e analise os resultados
ta: 4.5 முடிவுகளை வரைந்து பகுப்பாய்வு செய்யுங்கள்

source: If we plot the effective dimension values before and after training, we can see the following result:
es_un: Si graficamos los valores de las dimensiones efectivas antes y después del entrenamiento, podemos ver el siguiente resultado:
ja: トレーニングの前後の実効次元値をプロットすると、次の結果が得られます。
ko: 학습 전과 후의 유효 차원 값을 플롯하면 아래와 같은 결과를 볼 수 있다:
pt_un: Se plotarmos os valores de dimensão efetivos antes e depois do treinamento, podemos ver o seguinte resultado:
ta: பயிற்சிக்கு முன்னும் பின்னும் பயனுள்ள பரிமாண மதிப்புகளை நாம் திட்டமிட்டால், பின்வரும் முடிவைக் காணலாம்:

source: In general, we should expect the value of the local effective dimension to decrease after training. This can be understood by looking back into the main goal of machine learning, which is to pick a model that is expressive enough to fit your data, but not too expressive that it overfits and performs badly on new data samples.
es_un: En general, deberíamos esperar que el valor de la dimensión efectiva local disminuya después del entrenamiento. Esto se puede entender mirando hacia atrás en el objetivo principal del machine learning, que es elegir un modelo que sea lo suficientemente expresivo como para ajustarse a tus datos, pero no demasiado expresivo como para que se sobreajuste y funcione mal en nuevas muestras de datos.
ja: 一般に、トレーニング後にローカル有効次元の値が減少することを期待する必要があります。これは、機械学習の主な目標を振り返ることで理解できます。これは、データに適合するのに十分な表現力があるが、新しいデータサンプルに適合しすぎてパフォーマンスが悪いほど表現力のないモデルを選択することです。
ko: 일반적으로 훈련 후에 로컬 유효 차원의 값이 감소할 것으로 예상할 수 있다. 이는 사용된 데이터에 적합할 만큼 표현력이 뛰어나면서도 과적합되어 새로운 데이터 샘플에 대해 성능이 나쁘지 않은 적절한 모델을 선택해야 하는 것과 같은, 머신 러닝의 중요한 목표와도 맥락을 같이 한다.
pt_un: Em geral, devemos esperar que o valor da dimensão efetiva local diminua após o treinamento. Isso pode ser entendido olhando para o objetivo principal de machine learning, que é escolher um modelo que seja expressivo o suficiente para ajustar seus dados, mas não tão expressivo que se ajuste demais e tenha um desempenho ruim em novas amostras de dados.
ta: பொதுவாக, பயிற்சிக்குப் பிறகு உள்ளூர் பயனுள்ள பரிமாணத்தின் மதிப்பு குறையும் என்று எதிர்பார்க்க வேண்டும். மெஷின் லேர்னிங்கின் முக்கிய இலக்கைத் திரும்பிப் பார்ப்பதன் மூலம் இதைப் புரிந்து கொள்ள முடியும், இது உங்கள் தரவுகளுக்குப் பொருந்தக்கூடிய அளவுக்கு வெளிப்படுத்தக்கூடிய மாதிரியைத் தேர்ந்தெடுப்பது, ஆனால் புதிய தரவு மாதிரிகளில் மிகையாகப் பொருந்தி மோசமாகச் செயல்படும் மாதிரியைத் தேர்ந்தெடுப்பது அல்ல.

source: Certain optimizers help regularize the overfitting of a model by learning parameters, and this action of learning inherently reduces a model’s expressiveness, as measured by the local effective dimension. Following this logic, a randomly initialized parameter set will most likely produce a higher effective dimension that the final set of trained weights, because that model with that particular parameterization is “using more parameters” unnecessarily to fit the data. After training (with the implicit regularization), a trained model will not need to use so many parameters and thus have more “inactive parameters” and a lower effective dimension.
es_un: Ciertos optimizadores ayudan a regularizar el sobreajuste de un modelo mediante el aprendizaje de parámetros, y esta acción de aprendizaje reduce inherentemente la expresividad de un modelo, medida por la dimensión efectiva local. Siguiendo esta lógica, lo más probable es que un conjunto de parámetros inicializados aleatoriamente produzca una dimensión efectiva más alta que el conjunto final de pesos entrenados, porque ese modelo con esa parametrización particular está “usando más parámetros” innecesariamente para ajustar los datos. Después del entrenamiento (con la regularización implícita), un modelo entrenado no necesitará usar tantos parámetros y, por lo tanto, tendrá más “parámetros inactivos” y una dimensión efectiva menor.
ja: 特定のオプティマイザは、パラメータを学習することでモデルの過剰適合を正規化するのに役立ちます。この学習アクションは、ローカルの有効次元で測定されるように、モデルの表現力を本質的に低下させます。このロジックに従うと、ランダムに初期化されたパラメーターセットは、トレーニングされた重みの最終セットよりも有効な次元を生成する可能性が高くなります。これは、その特定のパラメーター化を使用したモデルが、データを適合させるために不必要に「より多くのパラメーターを使用する」ためです。 トレーニング後（暗黙の正則化を使用）、トレーニングされたモデルはそれほど多くのパラメーターを使用する必要がないため、「非アクティブなパラメーター」が多くなり、有効な次元が低くなります。
ko: 특정 옵티마이저는 매개변수를 학습하여 모델의 과적합을 조절하는데 도움을 주기도 하며 이 과정은 본질적으로 로컬 유효차원으로 측정할 수 있는 모덿의 표현력을 감소시킨다. 같은 논리로 무작위로 초기화된 매개 변수 세트는 훈련된 가중치의 최종 학습 세트보다 더 높은 유효차원을 가질 확률이 높으며, 이는 이 무작위 변수 세트를 지닌 모델이 데이터를 모두 맞추기 위해 불필요하게 ”더 많은 매개변수”를 사용하게 되기 때문이다. 학습이 종료 후(어느정도 조정이 이루어진) 학습된 모델은 더 적은 수의 매개변수를 사용해도 충분하기 때문에 더 많은 ”비활성 매개변수”와 더 낮은 유효 차원을 갖게 된다.
pt_un: Certos otimizadores ajudam a regularizar o overfitting de um modelo por meio de parâmetros de aprendizado, e essa ação de aprendizado reduz inerentemente a expressividade de um modelo, medida pela dimensão efetiva local. Seguindo essa lógica, um conjunto de parâmetros inicializado aleatoriamente provavelmente produzirá uma dimensão efetiva mais alta que o conjunto final de pesos treinados, porque esse modelo com essa parametrização específica está “usando mais parâmetros” desnecessariamente para ajustar os dados. Após o treinamento (com a regularização implícita), um modelo treinado não precisará usar tantos parâmetros e, portanto, terá mais “parâmetros inativos” e uma dimensão efetiva menor.
ta: கற்றல் அளவுருக்கள் மூலம் ஒரு மாதிரியின் அதிகப்படியான பொருத்தத்தை முறைப்படுத்த சில உகப்பாக்கிகள் உதவுகின்றன, மேலும் இந்த கற்றல் செயல், உள்ளூர் பயனுள்ள பரிமாணத்தால் அளவிடப்படும் மாதிரியின் வெளிப்பாட்டுத்தன்மையை இயல்பாகவே குறைக்கிறது. இந்த தர்க்கத்தைப் பின்பற்றி, தோராயமாக துவக்கப்பட்ட அளவுரு தொகுப்பு, பயிற்சி பெற்ற எடைகளின் இறுதித் தொகுப்பை விட அதிக செயல்திறன் கொண்ட பரிமாணத்தை உருவாக்கும், ஏனெனில் அந்த குறிப்பிட்ட அளவுருவுடன் கூடிய அந்த மாதிரியானது தரவை பொருத்துவதற்கு தேவையில்லாமல் "அதிக அளவுருக்களைப் பயன்படுத்துகிறது". பயிற்சிக்குப் பிறகு (மறைமுகமான முறைப்படுத்தலுடன்), பயிற்சியளிக்கப்பட்ட மாதிரி பல அளவுருக்களைப் பயன்படுத்த வேண்டிய அவசியமில்லை, இதனால் அதிக "செயலற்ற அளவுருக்கள்" மற்றும் குறைந்த செயல்திறன் பரிமாணம் இருக்கும்.

source: We must keep in mind though that this is the general intuition, and there might be cases where a randomly selected set of weights happens to provide a lower effective dimension than the trained weights for a specific model.
es_un: Sin embargo, debemos tener en cuenta que esta es la intuición general, y puede haber casos en los que un conjunto de pesos seleccionados al azar proporcione una dimensión efectiva más baja que los pesos entrenados para un modelo específico.
ja: これは一般的な洞察であり、あるモデルの訓練された重みよりもランダムに選ばれた重みが偶然低い有効次元を提供するなど、さまざまな場合がありうることに留意しなければなりません。
ko: 이것은 그저 보편적인 경우에 대한 통찰일 뿐이며 무작위로 선택된 가중치 세트가 특정 모델에 대해 훈련된 가중치보다 낮은 유효 차원을 제공하는 경우도 있음을 유념한다.
pt_un: Devemos ter em mente que esta é a intuição geral, e pode haver casos em que um conjunto de pesos selecionados aleatoriamente forneça uma dimensão efetiva menor do que os pesos treinados para um modelo específico.

source: 3. Basic Example (CircuitQNN)
pt_un: 3. Exemplo Básico (CircuitQNN)

source: This example shows how to set up a QNN model problem and run the global effective dimension algorithm. Both Qiskit ``CircuitQNN`` (shown in this example) and ``OpflowQNN`` (shown in a later example) can be used with the ``EffectiveDimension`` class.
pt_un: Este exemplo mostra como configurar um problema de modelo QNN e executar o algoritmo de dimensão efetiva global. Ambos, Qiskit ``CircuitQNN`` (mostrado neste exemplo) e ``OpflowQNN`` (mostrado em um exemplo posterior), podem ser usados com a classe ``EffectiveDimension``.

source: The first step to create a ``CircuitQNN`` is to define a parametrized feature map and ansatz. In this toy example, we will use 3 qubits, and we will define the circuit used in the ``TwoLayerQNN`` class.
pt_un: O primeiro passo para criar um ``CircuitQNN`` é definir um mapa de características parametrizado e ansatz. Neste exemplo simplório, usaremos 3 qubits e definiremos o circuito usado na classe ``TwoLayerQNN``.

source: The parametrized circuit can then be sent together with an optional interpret map (parity in this case) to the ``CircuitQNN`` constructor.
pt_un: O circuito parametrizado pode então ser enviado junto com um mapa de interpretação opcional (paridade neste caso) para o construtor ``CircuitQNN``.

source: We start by creating a 3D binary classification dataset:
pt_un: Começamos criando um conjunto de dados de classificação binária 3D:

source: The next step is to create a QNN, an instance of ``TwoLayerQNN`` in our case. Since we pass only the number of inputs, the network will continue with the default values for feature map and ansatz.
pt_un: O próximo passo é criar um QNN, uma instância de ``TwoLayerQNN`` no nosso caso. Como passamos apenas o número de entradas, a rede continuará com os valores padrão para mapa de recursos e ansatz.
