Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/10_effective_dimension.po
Languages: es_un, ja, ko, pt_un, ta

source: This page was generated from `docs/tutorials/10_effective_dimension.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/10_effective_dimension.ipynb`__.
ja: このページは `docs/tutorials/10_effective_dimension.ipynb`__ から生成されました。
ko: 이 페이지는 `docs/tutorials/10_effective_dimension.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/10_effective_dimension.ipynb`__.
ta: இந்தப் பக்கம் `docs/tutorials/10_effective_dimension.ipynb`__. லிருந்து உருவாக்கப்பட்டது.

source: Effective Dimension of Qiskit Neural Networks
es_un: Dimensión Efectiva de las Redes Neuronales de Qiskit
ja: Qiskitニューラルネットワークの有効な次元
ko: Qiskit Neural Networks의 유효 차원
pt_un: Dimensão efetiva das redes neurais Qiskit
ta: கிஸ்கிட் நரம்பியல் நெட்வொர்க்குகளின் பயனுள்ள பரிமாணம்

source: In this tutorial, we will take advantage of the ``EffectiveDimension`` and ``LocalEffectiveDimension`` classes to evaluate the power of Quantum Neural Network models. These are metrics based on information geometry that connect to notions such as trainability, expressibility or ability to generalize.
es_un: En este tutorial, aprovecharemos las clases ``EffectiveDimension`` y ``LocalEffectiveDimension`` para evaluar el poder de los modelos de redes neuronales cuánticas. Son métricas basadas en la geometría de la información que conectan con nociones como la entrenabilidad, la expresibilidad o la capacidad de generalización.
ja: このチュートリアルでは、 ``EffectiveDimension`` クラスと ``LocalEffectiveDimension`` クラスを利用して、量子ニューラルネットワークモデルの能力を評価します。これらは、トレーニング可能性、表現可能性、一般化能力などの概念に関連する情報幾何学に基づくメトリックです。
ko: 이 튜토리얼에서는 ``EffectiveDimension`` 및 ``LocalEffectiveDimension`` 클래스의 이점을 활용하여 양자 신경망 모델의 성능을 평가할 것이다. 이 것들은 학습 가능성, 표현 가능성 또는 일반화 능력과 같은 개념과 연결되는 정보 기하학을 기반으로 하는 메트릭이다.
pt_un: Neste tutorial, vamos aproveitar as classes ``EffectiveDimension`` e ``LocalEffectiveDimension`` para avaliar o poder dos modelos de Rede Neural Quântica. São métricas baseadas na geometria da informação que se conectam a noções como treinabilidade, expressibilidade ou capacidade de generalização.
ta: இந்த டுடோரியலில், நாம் பயன்படுத்திக்கொள்வோம் ``EffectiveDimension`` மற்றும்``LocalEffectiveDimension`` வகுப்பு குவாண்டம் நியூரல் நெட்வொர்க் மாதிரிகளின் சக்தியை மதிப்பிடுவதற்கு. இவை தகவல் வடிவவியலின் அடிப்படையிலான அளவீடுகள் ஆகும், அவை பயிற்சி, வெளிப்படுத்துதல் அல்லது பொதுமைப்படுத்தும் திறன் போன்ற கருத்துகளுடன் இணைக்கப்படுகின்றன.

source: Before diving into the code example, we will briefly explain what is the difference between these two metrics, and why are they relevant to the study of Quantum Neural Networks. More information about global effective dimension can be found in `this paper <https://arxiv.org/pdf/2011.00027.pdf>`__, while the local effective dimension was introduced in a `later work <https://arxiv.org/abs/2112.04807>`__.
es_un: Antes de profundizar en el ejemplo de código, explicaremos brevemente cuál es la diferencia entre estas dos métricas y por qué son relevantes para el estudio de las redes neuronales cuánticas. Se puede encontrar más información sobre la dimensión efectiva global en `este artículo <https://arxiv.org/pdf/2011.00027.pdf>`__, mientras que la dimensión efectiva local se introdujo en un `trabajo posterior <https://arxiv.org/abs/2112.04807>`__.
ja: コード例に飛び込む前に、これら2つのメトリックの違いと、それらが量子ニューラルネットワークの研究に関連する理由を簡単に説明します。グローバル有効次元の詳細については、 `この論文 <https://arxiv.org/pdf/2011.00027.pdf>`__ を参照してください。ローカル有効ディメンションは、 `後の研究 <https://arxiv.org/abs/2112.04807>`__ で紹介されています。
ko: 코드 예제로 들어가기 전, 이 두 측정항목의 차이점과 양자 신경망 연구와 관련된 이유를 간략하게 살펴보자. 글로벌 유효 차원에 대한 자세한 내용은 `본 논문 <https://arxiv.org/pdf/2011.00027.pdf>`__ 에서 확인할 수 있으며, 로컬 유효 차원은 `심화 읽기 자료 <https://arxiv. org/abs/2112.04807>`__ 에서 확인 할 수 있다.
pt_un: Antes de mergulhar no exemplo de código, explicaremos brevemente qual é a diferença entre essas duas métricas e por que elas são relevantes para o estudo de Redes Neurais Quânticas. Mais informações sobre a dimensão efetiva global podem ser encontradas neste artigo <https://arxiv.org/pdf/2011.00027.pdf>`__, enquanto a dimensão efetiva local foi introduzida em um trabalho posterior <https://arxiv. org/abs/2112.04807>`__.
ta: குறியீட்டு எடுத்துக்காட்டில் நுழைவதற்கு முன், இந்த இரண்டு அளவீடுகளுக்கும் இடையே உள்ள வித்தியாசம் என்ன என்பதையும், குவாண்டம் நியூரல் நெட்வொர்க்குகளின் ஆய்வுக்கு அவை ஏன் பொருத்தமானவை என்பதையும் சுருக்கமாக விளக்குவோம். உலகளாவிய பயனுள்ள பரிமாணத்தைப் பற்றிய கூடுதல் தகவல்களைக் காணலாம் `this paper <https://arxiv.org/pdf/2011.00027.pdf>`__, உள்ளூர் பயனுள்ள பரிமாணம் அறிமுகப்படுத்தப்பட்டது `later work <https://arxiv.org/abs/2112.04807>`__.

source: 1. Global vs. Local Effective Dimension
es_un: 1. Dimensión Efectiva Global vs. Local
ja: 1. グローバルとローカルの有効次元
ko: 1. 글로벌 대 로컬 유효 차원
pt_un: 1. Dimensão Efetiva Global vs. Local

source: Both classical and quantum machine learning models share a common goal: being good at **generalizing**, i.e. learning insights from data and applying them on unseen data.
es_un: Tanto el modelo de machine learning clásico como el cuántico comparten un objetivo común: ser bueno para **generalizar**, es decir, aprender información de los datos y aplicarla en datos ocultos.
ja: 古典的な機械学習モデルと量子機械学習モデルはどちらも共通の目標を共有しています。それは **一般化** に長けていること、つまりデータから洞察を学び、それらを目に見えないデータに適用することです。
ko: 클래식 및 양자 머신 러닝 모델은 모두 **일반화** 를 잘 하는 것을 목표로 한다. 즉, 기존의 데이터에서 통찰력을 학습하고 이를 새 데이터에 적용하는 것이다.
pt_un: Os modelos de machine learning clássico e quântico compartilham um objetivo comum: ser bom em **generalizar**, i.e. aprender insights de dados e aplicá-los em dados não vistos.

source: Finding a good metric to assess this ability is a non-trivial matter. In `The Power of Quantum Neural Networks <https://arxiv.org/pdf/2011.00027.pdf>`__, the authors introduce the **global** effective dimension as a useful indicator of how well a particular model will be able to perform on new data. In `Effective Dimension of Machine Learning Models <https://arxiv.org/pdf/2112.04807.pdf>`__, the **local** effective dimension is proposed as a new capacity measure that bounds the generalization error of machine learning models.
es_un: Encontrar una buena métrica para evaluar esta capacidad no es un asunto trivial. En `The Power of Quantum Neural Networks <https://arxiv.org/pdf/2011.00027.pdf>`__, los autores presentan la dimensión efectiva **global** como un indicador útil de qué tan bien un modelo en particular podrá desempeñarse con nuevos datos. En `Effective Dimension of Machine Learning Models <https://arxiv.org/pdf/2112.04807.pdf>`__, la dimensión efectiva **local** se propone como una nueva medida de capacidad que limita el error de generalización de los modelos de machine learning.
ja: この能力を評価するための適切な指標を見つけることは重要なことです。 `The Power of Quantum Neural Networks <https://arxiv.org/pdf/2011.00027.pdf>`__ で、著者は、特定のモデルが新しいデータに対してどれだけうまく機能できるかを示す有用な指標として、**グローバル** な有効次元を紹介しています。 `Effective Dimension of Machine Learning Models <https://arxiv.org/pdf/2112.04807.pdf>`__ では、機械学習モデルの汎化誤差を制限する新しい容量測定値として、**ローカル** 有効次元が提案されています。
ko: 이 능력을 평가하기 위한 좋은 지표를 찾는 것은 중요한 문제이다. `The Power of Quantum Neural Networks <https://arxiv.org/pdf/2011.00027.pdf>`__ 에서 저자는 **글로벌(global)** 유효 차원을 새로운 데이터에 대해 특정 모델이 얼마나 잘 수행할 수 있는지에 대한 유용한 지표로 소개한다. `Effective Dimension of Machine Learning Models <https://arxiv.org/pdf/2112.04807.pdf>`__ 에서는 기계 학습 모델의 일반화 오차를 제한하는 새로운 용량 척도로 **로컬(local)** 유효 차원이 제안되었다.
pt_un: Encontrar uma boa métrica para avaliar essa capacidade não é uma questão trivial. Em `The Power of Quantum Neural Networks <https://arxiv.org/pdf/2011.00027.pdf>`__, os autores apresentam a dimensão efetiva **global** como um indicador útil de quão bem um modelo específico será capaz de performar em novos dados. Em `Dimensão efetiva de modelos de aprendizado de máquina <https://arxiv.org/pdf/2112.04807.pdf>`__, a dimensão efetiva **local** é proposta como uma nova medida de capacidade que limita o erro de generalização de modelos de machine learning.
ta: இந்தத் திறனை மதிப்பிடுவதற்கு ஒரு நல்ல அளவீட்டைக் கண்டறிவது என்பது அற்பமான விஷயம் அல்ல. `தி பவர் ஆஃப் குவாண்டம் நியூரல் நெட்வொர்க்குகளில் <https://arxiv.org/pdf/2011.00027.pdf>`__, ஒரு குறிப்பிட்ட மாதிரியானது புதிய தரவுகளில் எவ்வளவு சிறப்பாகச் செயல்பட முடியும் என்பதற்கான பயனுள்ள குறிகாட்டியாக ஆசிரியர்கள் **உலகளாவிய** பயனுள்ள பரிமாணத்தை அறிமுகப்படுத்துகின்றனர். `இயந்திர கற்றல் மாதிரிகளின் பயனுள்ள பரிமாணத்தில் <https://arxiv.org/pdf/2112.04807.pdf>`__, இயந்திர கற்றல் மாதிரிகளின் பொதுமைப்படுத்தல் பிழையை கட்டுப்படுத்தும் புதிய திறன் அளவீடாக **உள்ளூர்** பயனுள்ள பரிமாணம் முன்மொழியப்பட்டது.

source: The key difference between global (``EffectiveDimension`` class) and **local** effective dimension (``LocalEffectiveDimension`` class) is actually not in the way they are computed, but in the nature of the parameter space that is analyzed. The global effective dimension incorporates the **full parameter space** of the model, and is calculated from a **large number of parameter (weight) sets**. On the other hand, the local effective dimension focuses on how well the **trained** model can generalize to new data, and how **expressive** it can be. Therefore, the local effective dimension is calculated from **a single** set of weight samples (training result). This difference is small in terms of practical implementation, but quite relevant at a conceptual level.
es_un: La diferencia clave entre la dimensión efectiva global (clase ``EffectiveDimension``) y **local** (clase ``LocalEffectiveDimension``) no está en la forma en que se calculan, sino en la naturaleza del espacio de parámetros que se analiza. La dimensión efectiva global incorpora el **espacio de parámetros completo** del modelo y se calcula a partir de una **gran cantidad de conjuntos de parámetros (peso)**. Por otro lado, la dimensión efectiva local se enfoca en qué tan bien el modelo **entrenado** puede generalizar a nuevos datos y qué tan **expresiva** puede ser. Por lo tanto, la dimensión efectiva local se calcula a partir de **un solo** conjunto de muestras de peso (resultado del entrenamiento). Esta diferencia es pequeña en términos de implementación práctica, pero bastante relevante a nivel conceptual.
ja: グローバル（ ``EffectiveDimension`` クラス）と **ローカル** 有効ディメンション（ ``LocalEffectiveDimension`` クラス）の主な違いは、実際には計算方法ではなく、分析されるパラメーター空間の性質にあります。グローバル有効次元は、モデルの **完全なパラメーター空間** を組み込み、 **多数のパラメーター（重み）セット** から計算されます。一方、ローカルの有効な次元は、**トレーニングされた** モデルが新しいデータにどれだけうまく一般化できるか、そしてそれがどれほど **表現力** があるかに焦点を当てています。したがって、局所的な有効寸法は、**単一の** 重みサンプルのセットから計算されます（トレーニング結果）。この違いは、実際の実装に関してはわずかですが、概念レベルでは非常に重要です。
ko: 글로벌 (``EffectiveDimension`` 클래스)과 **로컬** 유효 차원(``LocalEffectiveDimension`` 클래스)의 주요 차이점은 실제로 계산되는 방식이 아니라 분석되는 매개변수 공간의 특성에 있다 . 글로벌 유효 차원은 모델의 **전체 매개변수 공간** 을 통합하며 **많은 수의 매개변수(가중치) 세트** 에서 된다. 반면에 로컬 유효 차원은 **훈련된** 모델이 새 데이터에 얼마나 잘 일반화될 수 있는지, 그리고 얼마나 **표현적** 일 수 있는지에 중점을 둔다. 따라서 로컬 유효 차원은 **단일** 가중치 샘플 세트(훈련 결과)에서 계산된다. 이 차이는 실제 구현 측면에서는 차이는 크지 않지만 개념적 수준에서는 상당한 의미를 지닌다.
pt_un: A principal diferença entre a dimensão efetiva global (classe ``EffectiveDimension``) e a dimensão efetiva **local** (classe ``LocalEffectiveDimension``) não está na forma como são calculadas, mas na natureza do espaço de parâmetros que é analisado. A dimensão efetiva global incorpora o **espaço de parâmetro completo** do modelo e é calculada a partir de um **grande número de conjuntos de parâmetros (peso)**. Por outro lado, a dimensão efetiva local se concentra em quão bem o modelo **treinado** pode generalizar para novos dados e quão **expressivo** pode ser. Portanto, a dimensão efetiva local é calculada a partir de **um único** conjunto de amostras de peso (resultado do treinamento). Essa diferença é pequena em termos de implementação prática, mas bastante relevante em nível conceitual.
ta: உலகளாவிய (``எஃபெக்டிவ் டைமன்ஷன்`` வகுப்பு) மற்றும் **உள்ளூர்** பயனுள்ள பரிமாணம் (``லோக்கல் எஃபெக்டிவ் டைமன்ஷன்`` வகுப்பு) ஆகியவற்றுக்கு இடையேயான முக்கிய வேறுபாடு உண்மையில் அவை கணக்கிடப்படும் விதத்தில் இல்லை, ஆனால் பகுப்பாய்வு செய்யப்படும் அளவுரு இடத்தின் தன்மையில் உள்ளது.. உலகளாவிய பயனுள்ள பரிமாணம் மாதிரியின் **முழு அளவுரு இடத்தை** ஒருங்கிணைக்கிறது, மேலும் **பெரிய எண்ணிக்கையிலான அளவுரு (எடை) தொகுப்புகளிலிருந்து** கணக்கிடப்படுகிறது. மறுபுறம், உள்ளூர் பயனுள்ள பரிமாணம், **பயிற்சி பெற்ற** மாதிரியானது புதிய தரவுகளுக்கு எவ்வளவு நன்றாகப் பொதுமைப்படுத்த முடியும், மேலும் அது எவ்வாறு **வெளிப்படையாக** இருக்கும் என்பதில் கவனம் செலுத்துகிறது. எனவே, உள்ளூர் பயனுள்ள பரிமாணம் **ஒரே** எடை மாதிரிகளின் தொகுப்பிலிருந்து கணக்கிடப்படுகிறது (பயிற்சி முடிவு). நடைமுறைச் செயலாக்கத்தின் அடிப்படையில் இந்த வேறுபாடு சிறியது, ஆனால் கருத்தியல் மட்டத்தில் மிகவும் பொருத்தமானது.

source: 2. The Effective Dimension Algorithm
es_un: 2. El Algoritmo de Dimensión Efectiva
ja: 2. 有効次元アルゴリズム
ko: 2. 효과적인 차원 알고리즘
pt_un: 2. O Algoritmo de Dimensão Efetiva
ta: 2. தி எஃபெக்டிவ் டைமன்ஷன் அல்காரிதம்

source: Both the global and local effective dimension algorithms use the Fisher Information matrix to provide a measure of complexity. The details on how this matrix is calculated are provided in the `reference paper <https://arxiv.org/pdf/2011.00027.pdf>`__, but in general terms, this matrix captures how sensitive a neural network’s output is to changes in the network’s parameter space.
es_un: Los algoritmos de dimensión efectiva global y local utilizan la matriz de Información de Fisher para proporcionar una medida de la complejidad. Los detalles sobre cómo se calcula esta matriz se proporcionan en el `artículo de referencia <https://arxiv.org/pdf/2011.00027.pdf>`__, pero en términos generales, esta matriz captura qué tan sensible es la salida de una red neuronal a los cambios en el espacio de parámetros de la red.
ja: グローバルおよびローカルの有効次元アルゴリズムはどちらも、フィッシャー情報量マトリックスを使用して複雑さの尺度を提供します。この行列の計算方法の詳細は `参考論文 <https://arxiv.org/pdf/2011.00027.pdf>`__ に記載されていますが、一般的にこの行列は、ニューラルネットワークの出力がネットワークのパラメータ空間の変化に対してどれほど敏感であるかを示しています。
ko: 글로벌 및 로컬 유효 차원 알고리즘은 피셔 정보 (Fisher Information) 행렬을 사용하여 복잡성의 척도를 제공한다. 이 행렬이 계산되는 방법에 대한 자세한 내용은 `reference paper <https://arxiv.org/pdf/2011.00027.pdf>`__ 에 제공되지만, 일반적으로 이 행렬은 신경망의 출력이 네트워크 매개 변수 공간의 변화에 얼마나 민감한지를 보여준다.
pt_un: Os algoritmos de dimensão efetiva global e local usam a matriz informação Fisher para fornecer uma medida de complexidade. Os detalhes sobre como essa matriz é calculada são fornecidos no `documento de referência <https://arxiv.org/pdf/2011.00027.pdf>`__, mas em termos gerais, essa matriz captura a sensibilidade da saída de uma rede neural às alterações no espaço de parâmetros da rede.

source: In particular, this algorithm follows 4 main steps:
es_un: En particular, este algoritmo sigue 4 pasos principales:
ja: 特に、このアルゴリズムは4つの主要なステップに従います。
ko: 특히, 이 알고리즘은 4가지 주요 단계로 구성되어 있다.
pt_un: Em particular, este algoritmo segue 4 passos principais:
ta: குறிப்பாக, இந்த அல்காரிதம் 4 முக்கிய படிகளைப் பின்பற்றுகிறது:

source: **Monte Carlo simulation:** the forward and backward passes (gradients) of the neural network are computed for each pair of input and weight samples.
es_un: **Simulación de Monte Carlo:** los pasos hacia adelante y hacia atrás (gradientes) de la red neuronal se calculan para cada par de muestras de entrada y peso.
ja: **モンテカルロシミュレーション** ：ニューラルネットワークの順方向パスと逆方向パス（勾配）は、入力サンプルと重みサンプルの各ペアに対して計算されます。
ko: **Monte Carlo simulation:** 신경망의 전방 및 후방 패스(기울기) 는 입력 및 가중치 샘플의 각 쌍에 대해 계산된다.
pt_un: **Simulação de Monte Carlo:** os passos para frente e para trás (gradientes) da rede neural são calculadas para cada par de amostras de entrada e peso.
ta: **மான்டே கார்லோ உருவகப்படுத்துதல்:** ஒவ்வொரு ஜோடி உள்ளீடு மற்றும் எடை மாதிரிகளுக்கும் நரம்பியல் வலையமைப்பின் முன்னோக்கி மற்றும் பின்தங்கிய பாஸ்கள் (சாய்வுகள்) கணக்கிடப்படுகின்றன.

source: **Fisher Matrix Computation:** these outputs and gradients are used to compute the Fisher Information Matrix.
es_un: **Cálculo de Matriz de Fisher:** estos resultados y gradientes se utilizan para calcular la Matriz de Información de Fisher.
ja: **フィッシャー行列の計算** ：これらの出力と勾配は、フィッシャー情報量の計算に使用されます。
ko: **Fisher Matrix Computation:** 이 출력 과 그래디언트들은 피셔 정보 행렬을 계산하는 데 사용된다.
pt_un: **Computação da Matriz de Fisher:** essas saídas e gradientes são usados para calcular a Matriz de Informações de Fisher.
ta: **ஃபிஷர் மேட்ரிக்ஸ் கணக்கீடு:** இந்த வெளியீடுகளும் சாய்வுகளும் ஃபிஷர் தகவல் மேட்ரிக்ஸைக் கணக்கிடப் பயன்படுத்தப்படுகின்றன.

source: **Fisher Matrix Normalization:** averaging over all input samples and dividing by the matrix trace
es_un: **Normalización de la Matriz de Fisher:** promediando todas las muestras de entrada y dividiendo por la traza de la matriz
ja: **フィッシャー行列の正規化** ：すべての入力サンプルの平均と行列トレースによる除算
ko: **Fisher Matrix Normalization:** 모든 입력 샘플에 대한 평균을 구하고 매트릭스 트레이스로 나눈다.
pt_un: **Normalização da matriz de Fisher:** calcular a média de todas as amostras de entrada e dividir pelo traço da matriz
ta: **ஃபிஷர் மேட்ரிக்ஸ் இயல்பாக்கம்:** அனைத்து உள்ளீட்டு மாதிரிகளின் சராசரி மற்றும் மேட்ரிக்ஸ் ட்ரேஸ் மூலம் வகுத்தல்

source: **Effective Dimension Calculation:** according to the formula from `Abbas et al. <https://arxiv.org/pdf/2011.00027.pdf>`__
es_un: **Cálculo de la Dimensión Efectiva:** según la fórmula de `Abbas et al. <https://arxiv.org/pdf/2011.00027.pdf>`__
ja: **有効寸法の計算** ： `Abbas et al. <https://arxiv.org/pdf/2011.00027.pdf>`__ の式による。
ko: **Effective Dimension Calculation:** `Abbas et al. <https://arxiv.org/pdf/2011.00027.pdf>`__ 공식을 따른다.
pt_un: **Cálculo da Dimensão Efetiva:** de acordo com a fórmula de `Abbas et al. <https://arxiv.org/pdf/2011.00027.pdf>`__
ta: **பயனுள்ள பரிமாணக் கணக்கீடு:** `அப்பாஸ் மற்றும் பலர் வழங்கிய சூத்திரத்தின்படி. <https://arxiv.org/pdf/2011.00027.pdf>`__

source: 3. Basic Example (SamplerQNN)
es_un: 3. Ejemplo Básico (SamplerQNN)
ja: 3. 基本的な例（SamplerQNN）

source: This example shows how to set up a QNN model problem and run the global effective dimension algorithm. Both Qiskit ``SamplerQNN`` (shown in this example) and ``EstimatorQNN`` (shown in a later example) can be used with the ``EffectiveDimension`` class.
es_un: Este ejemplo muestra cómo configurar un problema de modelo QNN y ejecutar el algoritmo de dimensión efectiva global. Tanto ``SamplerQNN`` de Qiskit (que se muestra en este ejemplo) como ``EstimatorQNN`` (que se muestra en un ejemplo posterior) se pueden usar con la clase ``EffectiveDimension``.
ja: この例は、QNNモデルの問題を設定し、グローバル有効次元アルゴリズムを実行する方法を示しています。Qiskit ``SamplerQNN``（この例に示されている）と ``EstimatorQNN`` （後の例に示されている）の両方を ``EffectiveDimension`` クラスで使用できます。

source: We start off from the required imports and a fixed seed for the random number generator for reproducibility purposes.
es_un: Partimos con las importaciones requeridas y una semilla fija para el generador de números aleatorios con fines de reproducibilidad.
ja: 再現性を目的として、必要なインポートと乱数ジェネレーターの固定シードから開始します。
ko: 필요한 라이브러리들을 불러옴과 동시에 재현성을 위해 난수 생성기를 위한 고정 시드를 생성한다.
pt_un: Partimos das importações necessárias e uma semente fixa para o gerador de números aleatórios para fins de reprodutibilidade.
ta: தேவையான இறக்குமதிகள் மற்றும் மறுஉற்பத்தி நோக்கங்களுக்காக சீரற்ற எண் ஜெனரேட்டருக்கான நிலையான விதையிலிருந்து தொடங்குகிறோம்.

source: 3.1 Define QNN
es_un: 3.1 Definir la QNN
ja: 3.1 QNNを定義する
ko: 3.1 QNN 정의
pt_un: 3.1 Definir QNN
ta: 3.1 QNN ஐ வரையறுக்கவும்

source: The first step to create a ``SamplerQNN`` is to define a parametrized feature map and ansatz. In this toy example, we will use 3 qubits, and we will define the circuit used in the ``SamplerQNN`` class.
es_un: El primer paso para crear una ``SamplerQNN`` es definir un mapa de características parametrizado y un ansatz. En este ejemplo de juguete, usaremos 3 qubits y definiremos el circuito usado en la clase ``SamplerQNN``.
ja: ``SamplerQNN`` を作成するための最初のステップは、パラメーター化された特徴量マップとAnsatz を定義することです。このトイ・サンプルでは、3量子ビットを使用し、 ``SamplerQNN`` クラスで使用される回路を定義します。

source: The parametrized circuit can then be sent together with an optional interpret map (parity in this case) to the ``SamplerQNN`` constructor.
es_un: El circuito parametrizado se puede enviar junto con un mapa de interpretación opcional (paridad en este caso) al constructor de ``SamplerQNN``.
ja: 次に、パラメーター化された回路をオプションの解釈マップ（この場合はパリティ）と一緒に ``SamplerQNN`` コンストラクタに送信できます。

source: 3.2 Set up Effective Dimension calculation
es_un: 3.2 Configurar el cálculo de la Dimensión Efectiva
ja: 3.2 実効次元計算の設定
ko: 3.2 유효 차원 계산 설정
pt_un: 3.2 Configure o cálculo da Dimensão Efetiva
ta: 3.2 பயனுள்ள பரிமாண கணக்கீட்டை அமைக்கவும்

source: In order to compute the effective dimension of our QNN using the ``EffectiveDimension`` class, we need a series of sets of input samples and weights, as well as the total number of data samples available in a dataset. The ``input_samples`` and ``weight_samples`` are set in the class constructor, while the number of data samples is given during the call to the effective dimension computation, to be able to test and compare how this measure changes with different dataset sizes.
es_un: Para calcular la dimensión efectiva de nuestra QNN usando la clase ``EffectiveDimension``, necesitamos una serie de conjuntos de muestras y pesos de entrada, así como el número total de muestras de datos disponibles en un conjunto de datos. Las ``input_samples`` y ``weight_samples`` se establecen en el constructor de la clase, mientras que el número de muestras de datos se proporciona durante la llamada al cálculo de la dimensión efectiva, para poder probar y comparar cómo cambia esta medida con diferentes tamaños de conjuntos de datos.
ja: ``EffectiveDimension`` クラスを使用してQNNの有効次元を計算するには、一連の入力サンプルと重みのセット、およびデータセットで使用可能なデータサンプルの総数が必要です。 ``input_samples`` と ``weight_samples`` はクラスコンストラクターで設定され、データサンプルの数は有効なディメンション計算の呼び出し中に指定されるため、このメジャーがさまざまなデータセットサイズでどのように変化するかをテストおよび比較できます。
ko: ``EffectiveDimension`` 클래스를 사용해서 QNN의 유효 차원을 계산하려면, 데이터 세트에서 사용할 수 있는 전체 데이터 샘플 수를 비롯한 일련의 입력 샘플 및 가중치 세트가 필요하다. ``input_samples`` 과 ``weight_samples`` 는 클래스 생성자에서 설정하고, 데이터 샘플의 수는 유효 차원을 계산하는 호출에서 얻는다. 이로써 데이터 세트의 크기가 다를 경우 이러한 측정값이 어떻게 바뀌는지 테스트하고 비교할 수 있다.
pt_un: Para calcular a dimensão efetiva de nosso QNN usando a classe ``EffectiveDimension``, precisamos de uma série de conjuntos de amostras e pesos de entrada, bem como o número total de amostras de dados disponíveis em um conjunto de dados. O ``input_samples`` e o ``weight_samples`` são definidos no construtor da classe, enquanto o número de amostras de dados é dado durante a chamada para o cálculo da dimensão efetiva, para poder testar e comparar como esta medida muda com diferentes conjuntos de dados tamanhos.
ta: ``EffectiveDimension`` வகுப்பைப் பயன்படுத்தி எங்கள் QNN இன் பயனுள்ள பரிமாணத்தைக் கணக்கிடுவதற்கு, உள்ளீட்டு மாதிரிகள் மற்றும் எடைகளின் தொடர் தொகுப்புகள் மற்றும் தரவுத்தொகுப்பில் கிடைக்கும் தரவு மாதிரிகளின் மொத்த எண்ணிக்கையும் தேவை. ``input_samples`` மற்றும் ``weight_samples`` ஆகியவை வகுப்பு கட்டமைப்பாளரில் அமைக்கப்பட்டுள்ளன, அதே நேரத்தில் பயனுள்ள பரிமாணக் கணக்கீட்டிற்கான அழைப்பின் போது தரவு மாதிரிகளின் எண்ணிக்கை வழங்கப்படுகிறது, இந்த அளவீடு வெவ்வேறு தரவுத்தொகுப்புடன் எவ்வாறு மாறுகிறது என்பதைச் சோதித்து ஒப்பிட்டுப் பார்க்க முடியும். அளவுகள்.
