Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/11_quantum_convolutional_neural_networks.po
Languages: es_un, ja, ko_kr

source: Figure 3: Parametrized two qubit unitary circuit for :math:`N(\alpha, \beta, \gamma) = exp(i[\alpha \sigma_x\sigma_x + \beta \sigma_y\sigma_y + \gamma \sigma_z\sigma_z ])` as seen in [3], where :math:`\alpha = \frac{\pi}{2} - 2\theta`, :math:`\beta = 2\phi - \frac{\pi}{2}` and :math:`\gamma = \frac{\pi}{2} - 2\lambda` as seen in the circuit. This two qubit unitary will be applied to all neighboring qubits in our feature map.
es_un: Figura 3: Circuito unitario parametrizado de dos qubits para :math:`N(\alpha, \beta, \gamma) = exp(i[\alpha \sigma_x\sigma_x + \beta \sigma_y\sigma_y + \gamma \sigma_z\sigma_z ])` como se ve en [3], donde :math:`\alpha = \frac{\pi}{2} - 2\theta`, :math:`\beta = 2\phi - \frac{\pi}{2}` y :math:`\gamma = \frac{\pi}{2} - 2\lambda` como se ve en el circuito. Esta unitaria de dos qubits se aplicará a todos los qubits vecinos en nuestro mapa de funciones.
ja: 図 3: :math:`N(\alpha, \beta, \gamma) = exp(i[\alpha \sigma_x\sigma_x + \beta \sigma_y\sigma_y + \gamma \sigma_z\sigma_z ] のパラメーター化された 2 量子ビット ユニタリー回路 )` [3] に見られるように、ここで :math:`\alpha = \frac{\pi}{2} - 2\theta`, :math:`\beta = 2\phi - \frac{\pi}{2}` と :math:`\gamma = \frac{\pi}{2} - 2\lambda` が回路に見られます。 この 2 量子ビットユニタリーは、特徴量マップ内の隣接するすべての量子ビットに適用されます。
ko_kr: 그림 3: [3] 에서 보는 바와 같이 :math:`N(\alpha, \beta, \gamma) = exp(i[\alpha \sigma_x\sigma_x + \beta \sigma_y\sigma_y + \gamma \sigma_z\sigma_z ])` 에 대한 2 큐비트 유니타리 회로를 매개 변수화하였으며, 여기서 :math:`\alpha = \frac{\pi}{2} - 2\theta`, :math:`\beta = 2\phi - \frac{\pi}{2}`, :math:`\gamma = \frac{\pi}{2} - 2\lambda` 는 회로에서 보는 바와 같다. 이러한 2 큐비트 유니타리는 특징 지도의 모든 인접한 큐비트에 적용할 것이다.

source: 2.1 Convolutional Layer
es_un: 2.1 Capa Convolucional
ja: 2.1 畳み込み層
ko_kr: 2.1 합성곱 층

source: The next step in this tutorial is to define the Convolutional Layers of our QCNN. These layers are then applied to the qubits after the data has been encoded through use of the feature map.
es_un: El siguiente paso en este tutorial es definir las Capas Convolucionales de nuestra QCNN. Luego, estas capas se aplican a los qubits después de que los datos se hayan codificado mediante el uso del mapa de características.
ja: このチュートリアルの次のステップは、QCNNの畳み込み層を定義することです。これらの層は、データが特徴量マップの使用によりエンコードされた後、量子ビットに適用されます。
ko_kr: 이 튜토리얼의 다음 단계는 QCNN의 합성곱 층을 정의한다. 이러한 층은 특징 지도를 사용하여 데이터를 인코딩한 후 큐비트에 적용된다.

source: To do so we first need to determine a parametrized unitary gate, which will be used to create our convolutional and pooling layers.
es_un: Para hacerlo, primero debemos determinar una compuerta unitaria parametrizada, que se utilizará para crear nuestras capas convolucionales y de reducción.
ja: そのためには、まず、畳み込み層とプーリング層の作成に使用するパラメーター化されたユニタリーゲートを決定する必要があります。
ko_kr: 먼저 합성곱 및 풀링 층을 만드는 데 사용될 매개 변수화된 유니타리 게이트를 결정해야 한다.

source: Now that we have defined these unitaries, it is time to create a function for the convolutional layer in our QCNN. To do so, we apply the two qubit unitary to neighboring qubits as seen in the ``conv_layer`` function below.
es_un: Ahora que hemos definido estas unitarias, es hora de crear una función para la capa convolucional en nuestra QCNN. Para hacerlo, aplicamos la unitaria de dos qubits a los qubits vecinos como se ve en la función ``conv_layer`` a continuación.
ja: さて、これらのユニタリーを定義したところで、QCNNの畳み込み層の関数を作成することにします。これを行うには、以下の ``conv_layer`` 関数で見られるように、隣接する量子ビットに2量子ビットのユニタリーを適用します。
ko_kr: 유니타리를 정의했으므로 QCNN에서 합성곱 층에 대한 함수를 생성해야 한다. 아래 ``conv_layer`` 함수에 표시된 것처럼 두 개의 큐비트 유니타리를 인접한 큐비트에 적용한다.

source: Note that we first apply the two qubit unitary to all even pairs of qubits followed by applying to odd pairs of qubits in a circular coupling manner, i.e. the as well as neighboring qubits being coupled, the first and final qubit are also coupled through a unitary gate.
es_un: Ten en cuenta que primero aplicamos la unitaria de dos qubits a todas las parejas de qubits que son pares seguidos de la aplicación a las parejas impares de qubits de manera circular, es decir, los qubits vecinos y los qubits que se acoplan, el primer y último qubit también se acoplan a través de una compuerta unitaria.
ja: つまり、隣接する量子ビットが結合されるのと同様に、最初と最後の量子ビットもユニタリーゲートを通して結合されるのです。

source: Note that we add barriers into our quantum circuits for convenience when plotting, however they are not required for the actual QCNN and can be extracted from the following circuits.
es_un: Ten en cuenta que agregamos barreras en nuestros circuitos cuánticos por conveniencia al graficar, sin embargo, no son necesarias para la QCNN real y se pueden extraer de los siguientes circuitos.
ja: なお、プロットする際の便宜上、量子回路にバリアーを追加していますが、実際のQCNNでは不要であり、以下の回路から削除することが可能です。
ko_kr: 그래프를 그릴때 편의를 위해 양자 회로에 배리어를 추가하지만 실제 QCNN에는 필요하지 않으며 다음 회로에서 추출할 수 있다.

source: 2.2 Pooling Layer
es_un: 2.2 Capa de Reducción
ja: 2.2 プーリング層
ko_kr: 2.2 풀링 층

source: The purpose of a pooling layer is to reduce the dimensions of our Quantum Circuit, i.e. reduce the number of qubits in our circuit, while retaining as much information as possible from previously learned data. Reducing the amount of qubits also reduces the computational cost of the overall circuit, as the number of parameters that the QCNN needs to learn decreases.
es_un: El propósito de una capa de agrupación (pooling) es reducir las dimensiones de nuestro circuito cuántico, es decir, reducir la cantidad de qubits en nuestro circuito, mientras que conserva la mayor cantidad de información posible de los datos aprendidos previamente. Reducir la cantidad de qubits también reduce el costo computacional del circuito general, ya que disminuye la cantidad de parámetros que la QCNN necesita aprender.
ja: プーリング層の目的は、以前に学習したデータからできるだけ多くの情報を保持しながら、量子回路の次元を小さくすること、すなわち回路の量子ビットの数を減らすことです。量子ビットの数を減らすことは、QCNNが学習する必要のあるパラメーターの数が減るため、回路全体の計算コストも減らすことができます。

source: However, one cannot simply decrease the amount of qubits in our quantum circuit. Because of this, we must define the pooling layer in a different manner compared with the classical approach.
es_un: Sin embargo, uno no puede simplemente disminuir la cantidad de qubits en nuestro circuito cuántico. Debido a esto, debemos definir la capa de reducción de una manera diferente en comparación con el enfoque clásico.
ja: しかし、量子回路に含まれる量子ビットの数を単純に減らすことはできません。このため、古典的なアプローチとは異なる方法でプーリング層を定義する必要があります。
ko_kr: 그러나 양자 회로의 큐비트의 양을 단순히 줄일 수는 없다. 이 때문에 풀링 층을 기존의 접근 방식과 다른 방식으로 정의해야 한다.

source: To 'artificially' reduce the number of qubits in our circuit, we first begin by creating pairs of the :math:`N` qubits in our system.
es_un: Para reducir 'artificialmente' la cantidad de qubits en nuestro circuito, primero comenzamos creando pares de :math:`N` qubits en nuestro sistema.
ja: 回路内の量子ビットの数を「人為的に」減らすために、まずシステム内の :math:`N` 個の量子ビットのペアを作ることから始めます。

source: After initially pairing all the qubits, we apply our generalized 2 qubit unitary to each pair, as described previously. After applying this two qubit unitary, we then ignore one qubit from each pair of qubits for the remainder of the neural network.
es_un: Después de emparejar inicialmente todos los qubits, aplicamos nuestra unitaria generalizada de 2 qubits a cada par, como se describió anteriormente. Después de aplicar esta unitaria de dos qubits, ignoramos un qubit de cada par de qubits para el resto de la red neuronal.
ja: 最初にすべての量子ビットをペアリングした後、前述のように一般化された2量子ビットユニタリーを各ペアに適用します。この2量子ビットのユニタリーを適用した後、ニューラルネットワークの残りの部分では、各ペアの量子ビットから1つの量子ビットを無視します。
ko_kr: 처음에 모든 큐비트를 쌍으로 구성한 후 앞에서 설명한 것처럼 일반화된 2 큐비트 유니타리를 각 쌍에 적용한다. 이 2 큐비트 유니타리를 적용한 후, 신경망의 나머지 부분에는 각 큐비트 쌍마다 하나의 큐비트를 무시한다.

source: This layer therefore has the overall effect of 'combining' the information of the two qubits into one qubit by first applying the unitary circuit, encoding information from one qubit into another, before disregarding one of qubits for the remainder of the circuit and not performing any operations or measurements on it.
es_un: Por lo tanto, esta capa tiene el efecto general de 'combinar' la información de los dos qubits en un qubit aplicando primero la unitaria de circuito, codificando la información de un qubit a otro, antes de descartar uno de los qubits para el resto del circuito y no realizar ninguna operación ni medición en él.
ja: この層は、まずユニタリー回路を適用して、1つの量子ビットの情報を別の量子ビットに符号化し、残りの回路では一方の量子ビットを無視し、それに対していかなる演算や測定も行わないことで、2つの量子ビットの情報を1つに「結合」する全体効果を持ちます。

source: We note that one could also apply a dynamic circuit to reduce the dimensionality in the pooling layers. This would involve performing measurements on certain qubits in the circuit and having an intermediate classical feedback loop in our pooling layers. By applying these measurements, one would also be reducing the dimensionality of the circuit.
es_un: Observamos que también se podría aplicar un circuito dinámico para reducir la dimensionalidad en las capas de reducción. Esto implicaría realizar mediciones en ciertos qubits en el circuito y tener un ciclo de retroalimentación clásico intermedio en nuestras capas de reducción. Al aplicar estas mediciones, también se estaría reduciendo la dimensionalidad del circuito.
ja: プーリング層の次元を減らすために動的回路を適用することも可能であることに留意してください。これは、回路内の特定の量子ビットの測定を行い、我々のプーリング層に中間的な古典的なフィードバック・ループを持たせることになります。これらの測定を適用することによって、回路の次元を減らすこともできるでしょう。
ko_kr: 풀링 층에서 차원수를 줄이기 위해 동적 회로를 적용할 수도 있다. 회로의 특정 큐비트에 대한 측정을 수행하고 풀링 층에서 중간의 고전적 피드백 루프를 갖는 것을 포함한다. 이러한 측정을 적용함으로써 회로의 차원수도 줄일 수 있다.

source: In this tutorial, we apply the former approach, and disregard qubits in each pooling layer. Using this approach, we thus create a QCNN Pooling Layer which transforms the dimensions of our :math:`N` qubit Quantum Circuit to :math:`N/2`.
es_un: En este tutorial, aplicamos el enfoque anterior e ignoramos los qubits en cada capa de reducción. Con este enfoque, creamos una Capa de Reducción de la QCNN que transforma las dimensiones de nuestro circuito cuántico de :math:`N` qubits en :math:`N/2`.
ja: このチュートリアルでは、前者のアプローチを適用し、各プーリング層の量子ビットを無視します。このアプローチを用いて、私たちは :math:`N` 量子回路の次元を :math:`N/2` に変換するQCNNプーリング層を作成します。
ko_kr: 이 튜토리얼에서는 이전 접근 방식을 적용하고 각 풀링 층의 큐비트를 무시한다. 따라서 이 접근 방식을 사용하여 :math:`N` 큐비트 양자 회로의 차원수를 :math:`N/2` 로 변환하는 QCNN 풀링 층을 만든다.

source: To do so, we first define a two qubit unitary, which transforms the two qubit system to one.
es_un: Para hacerlo, primero definimos una unitaria de dos qubits, que transforma el sistema de dos qubits en uno.
ja: そのために、まず、2量子ビット系を1量子ビットに変換する2量子ビットユニタリーを定義します。
ko_kr: 이를 위해 먼저 2 큐비트 시스템을 하나로 변환하는 2 큐비트 유니타리를 정의한다.

source: After applying this two qubit unitary circuit, we neglect the first qubit (q0) in future layers and only use the second qubit (q1) in our QCNN
es_un: Después de aplicar este circuito unitario de dos qubits, ignoramos el primer qubit (q0) en capas futuras y solo usamos el segundo qubit (q1) en nuestra QCNN
ja: この2量子ビットのユニタリー回路を適用した後、その後の層では第1量子ビット (q0) を無視し、第2量子ビット (q1) のみをQCNNで使用します。
ko_kr: 이 2 큐비트 유니타리 회로를 적용한 후, 다음층에서 첫 번째 큐비트(q0)를 무시하고 QCNN에서 두 번째 큐비트(q1)만 사용한다.

source: We apply this two qubit pooling layer to different pairs of qubits to create our pooling layer for N qubits. As an example we then plot it for four qubits.
es_un: Aplicamos esta capa de reducción de dos qubits a diferentes pares de qubits para crear nuestra capa de reducción para N qubits. Como ejemplo, lo graficamos para cuatro qubits.
ja: この2量子ビットのプーリング層を異なる量子ビットのペアに適用し、N量子ビットのプーリング層を作成します。例として、4つの量子ビットについてプロットしてみます。
ko_kr: 2 큐비트 풀링 층을 다른 큐비트 쌍에 적용하여 N 큐비트에 대한 풀링 층을 생성한다. 4개의 큐비트에 대해 그래프를 그려 예를 들어보겠다.

source: In this particular example, we reduce the dimensionality of our four qubit circuit to the last two qubits, i.e. the last two qubits in this particular example. These qubits are then used in the next layer, while the first two are neglected for the remainder of the QCNN.
es_un: En este ejemplo particular, reducimos la dimensionalidad de nuestro circuito de cuatro qubits a dos qubits, es decir, los dos últimos qubits en este ejemplo particular. Estos qubits luego se usan en la siguiente capa, mientras que los dos primeros se ignoran por el resto de la QCNN.
ja: この特定の例では、4つの量子ビット回路の次元を最後の2つの量子ビットにまで縮小します。これらの量子ビットは次の層で使用され、最初の2つはQCNNの残りの部分では無視されます。

source: 3. Data Generation
es_un: 3. Generación de Datos
ja: 3. データ生成
ko_kr: 3. 데이터 생성

source: One common use of a CCNN is an image classifier, where a CCNN detects particular features and patterns (such as straight lines or curves) of the pixelated images through the use of the feature maps in the convolutional layer. By learning the relationship between these features, it can then classify and label handwritten digits with ease.
es_un: Un uso común de una CCNN es un clasificador de imágenes, donde una CCNN detecta características y patrones particulares (como líneas rectas o curvas) de las imágenes pixeladas mediante el uso de mapas de características en la capa convolucional. Al aprender la relación entre estas características, puede clasificar y etiquetar los dígitos escritos a mano con facilidad.
ja: CCNNは、畳み込み層の特徴量マップを利用して、ピクセル化された画像の特定の特徴やパターン (直線や曲線など) を検出することができます。これらの特徴量間の関係を学習することで、手書きの数字を簡単に分類し、ラベル付けすることができます。
ko_kr: CCNN의 일반적인 용도는 이미지 분류기로, CCNN은 합성곱 층에서 특징 지도를 사용하여 픽셀화된 이미지의 (직선 또는 곡선 등)특정 특징과 패턴을 감지한다. 이러한 특징간의 관계를 학습함으로써 손으로 쓴 숫자를 쉽게 분류하고 라벨을 지정 할 수 있다.

source: Because of a classical CNN's ability to recognize features and patterns easily, we will train our QCNN to also determine patterns and features of a given set of pixelated images, and classify between two different patterns.
es_un: Debido a la capacidad de una CNN clásica para reconocer características y patrones fácilmente, entrenaremos a nuestra QCNN para que también determine patrones y características de un conjunto dado de imágenes pixeladas y clasifique entre dos patrones diferentes.
ja: 古典的なCNNは特徴やパターンを簡単に認識できるため、QCNNも与えられた画素画像のパターンや特徴を判断し、2つの異なるパターンの間で分類できるように訓練します。

source: To simplify the dataset, we only consider 2 x 4 pixelated images. The patterns we will train the QCNN to distinguish will be a horizontal or vertical line, which can be placed anywhere in the image, alongside a noisy background.
es_un: Para simplificar el conjunto de datos, solo consideramos imágenes pixeladas de 2 x 4. Los patrones que entrenaremos en la QCNN para distinguir serán una línea horizontal o vertical, que se puede colocar en cualquier lugar de la imagen, junto con un fondo ruidoso.
ja: データセットを単純化するために、我々は2×4ピクセルの画像のみを考慮します。QCNNが識別するために訓練するパターンは、水平または垂直の線であり、画像内のどこにでも配置でき、ノイズの多い背景と一緒に配置できます。
ko_kr: 데이터셋을 단순화하기 위해 2 x 4 픽셀 이미지만 고려한다. QCNN을 학습하여 구별하는 패턴은 노이즈가 많은 배경과 동시에 이미지 어디에나 놓일 수 있는 수평 또는 수직선이 될 것이다.

source: We first begin by generating this dataset. To create a 'horizontal' or 'vertical' line, we assign pixels value to be :math:`\frac{\pi}{2}` which will represent the line in our pixelated image. We create a noisy background by assigning every other pixel a random value between :math:`0` and :math:`\frac{\pi}{4}` which will create a noisy background.
es_un: Primero comenzamos generando este conjunto de datos. Para crear una línea 'horizontal' o 'vertical', asignamos el valor de pixeles para que sea :math:`\frac{\pi}{2}`, que representará la línea en nuestra imagen pixelada. Creamos un fondo ruidoso asignando alternadamente a un pixel si y a otro no, un valor aleatorio entre :math:`0` y :math:`\frac{\pi}{4}` lo que creará un fondo ruidoso.
ja: まず、このデータセットを生成することから始めます。 「水平」または「垂直」な線を作成するために、ピクセル値を :math:`frac{\pi}{2}` に割り当てます。これは、ピクセル化された画像中の線を表現します。他のピクセルには :math:`0` から :math:`frac{\pi}{4}` の間のランダムな値を割り当てて、ノイズの多い背景を作成します。

source: Note that when we create our dataset, we need to split it into the training set and testing set of images, the datasets we train and test our neural network respectively.
es_un: Ten en cuenta que cuando creamos nuestro conjunto de datos, debemos dividirlo en el conjunto de imágenes de entrenamiento y en el conjunto de imágenes de prueba, los conjuntos de datos con los que entrenamos y probamos nuestra red neuronal, respectivamente.
ja: なお、データセットを作成する際には、画像のトレーニングセットとテストセットに分割する必要があり、それぞれニューラルネットワークのトレーニングとテストを行うデータセットとなります。
ko_kr: 데이터셋을 만들 때 신경망을 각각 훈련하고 테스트하는 데이터셋인 학습 세트와 테스트 이미지 세트로 분할해야 한다.

source: We also need to label our datasets such that the QCNN can learn to differentiate between the two patterns. In this example we label images with a horizontal line with -1 and images with a vertical line +1.
es_un: También necesitamos etiquetar nuestros conjuntos de datos de manera que la QCNN pueda aprender a diferenciar entre los dos patrones. En este ejemplo, etiquetamos las imágenes con una línea horizontal con -1 y las imágenes con una línea vertical +1.
ja: また、QCNNが2つのパターンを区別することを学習できるように、データセットにラベル付けする必要があります。この例では、横線のある画像に-1、縦線のある画像に+1のラベルを付けます。
ko_kr: 또한 QCNN이 두 패턴을 구별하는 방법을 배울 수 있도록 데이터셋에 레이블을 지정해야 한다. 이 예제에서는 이미지에서의 수평선을 -1, 이미지에서의 수직선을 +1로 레이블 하였다.

source: Let's now create our dataset below and split it into our test and training datasets.
es_un: Ahora vamos a crear nuestro conjunto de datos a continuación y dividirlo en nuestros conjuntos de datos de prueba y entrenamiento.
ja: それでは、以下のようにデータセットを作成し、テスト用とトレーニング用のデータセットに分割してみましょう。

source: Let's see some examples in our dataset
es_un: Veamos algunos ejemplos en nuestro conjunto de datos
ja: データセットでいくつかの例を見てみましょう。

source: As we can see each image contains either a vertical or horizontal line, that the QCNN will learn how to differentiate. Now that we have built our dataset, it is time to discuss the components of the QCNN and build our model.
es_un: Como podemos ver, cada imagen contiene una línea vertical u horizontal, que la QCNN aprenderá a diferenciar. Ahora que hemos construido nuestro conjunto de datos, es hora de discutir los componentes de la QCNN y construir nuestro modelo.
ja: 見ての通り、各画像には縦線と横線があり、QCNNはそれを区別する方法を学習します。さて、データセットが構築できたので、次はQCNNの構成要素について議論し、モデルを構築する番です。
ko_kr: 각 이미지에는 수직 또는 수평선이 포함되어 있으므로 QCNN은 구별하는 방법을 학습한다. 데이터셋을 구축했으므로 이제 QCNN의 구성 요소에 대해 논의하고 모델을 구축해보자.

source: 4. Modeling our QCNN
es_un: 4. Modelar nuestra QCNN
ja: 4. QCNNのモデリング
ko_kr: 4. QCNN 모델링

source: Now that we have defined both the convolutional layers it is now time to build our QCNN, which will consist of alternating pooling and convolutional layers.
es_un: Ahora que hemos definido ambas capas convolucionales, es el momento de construir nuestra QCNN, que consistirá en capas alternas de reducción y convolucionales.
ja: さて、両方の畳み込み層を定義したので、次は QCNN を構築する番であり、プーリング層と畳み込み層を交互に構成します。
ko_kr: 이제 두 합성곱 층을 모두 정의했으므로 이제 풀링 층과 합성곱 층이 교대로 구성될 QCNN을 구축해보자.

source: As the images in our dataset contains 8 pixels, we will use 8 qubits in our QCNN.
es_un: Como las imágenes en nuestro conjunto de datos contienen 8 píxeles, usaremos 8 qubits en nuestra QCNN.
ja: データセットの画像は8ピクセルであるため、QCNNでは8個の量子ビットを使用することにします。
ko_kr: 데이터셋의 이미지는 8개의 픽셀을 포함하므로 QCNN에서 8개의 큐비트를 사용한다.

source: We encode our dataset into our QCNN by applying a feature map. One can create a feature map using one of Qiskit's built in feature maps, such as ZFeatureMap or ZZFeatureMap.
es_un: Codificamos nuestro conjunto de datos en nuestra QCNN aplicando un mapa de características. Se puede crear un mapa de características utilizando uno de los mapas de funciones integrados de Qiskit, como ZFeatureMap o ZZFeatureMap.
ja: 我々は、特徴量マップを適用することによってデータセットをQCNNにエンコードします。特徴量マップは、ZFeatureMapやZZFeatureMapなど、Qiskitに組み込まれている特徴量マップのいずれかを使用して作成することができます。

source: After analyzing several different Feature maps for this dataset, it was found that QCNN obtains the greatest accuracy when the Z feature map is used. Therefore, throughout the remainder of the tutorial we will use the Z feature Map, of which can be seen below.
es_un: Después de analizar varios mapas de características diferentes para este conjunto de datos, se encontró que la QCNN obtiene la mayor precisión cuando se usa el mapa de características Z. Por lo tanto, durante el resto del tutorial utilizaremos el mapa de características Z, como se puede ver a continuación.
ja: このデータセットに対していくつかの異なる特徴量マップを分析した結果、QCNN は Z feature mapを使用した場合に最も高い精度が得られることがわかりました。したがって、このチュートリアルの残りの部分では、以下に示すZ feature map を使用することにします。
ko_kr: 이 데이터셋에 대해 여러 가지 다른 기능 맵을 분석한 결과, Z 특징 지도를 사용할 때 QCNN이 가장 높은 정확도를 얻는 것으로 나타났다. 따라서 나머지 튜토리얼에서는 Z 특징 지도를 사용할 것이며 아래에서 확인할 수 있다.

source: We create a function for our QCNN, which will contain three sets of alternating convolutional and pooling layers, which can be seen in the schematic below. Through the use of the pooling layers, we thus reduce the dimensionality of our QCNN from eight qubits to one.
es_un: Creamos una función para nuestra QCNN, que contendrá tres conjuntos de capas convolucionales y de reducción alternas, que se pueden ver en el siguiente esquema. Mediante el uso de las capas de agrupación (pooling), reducimos la dimensionalidad de nuestra QCNN de ocho qubits a uno.
ja: QCNNの関数を作成します。この関数は、以下の概略図に見られるように、畳み込み層とプーリング層を3つ交互に含みます。プーリング層の使用により、我々はQCNNの次元を8量子ビットから1量子ビットに減少させることができます。
ko_kr: 아래 개략도에서 볼 수 있는 것처럼 3개 세트의 합성곱 및 풀링 층이 교대로 배치된 QCNN에 대한 함수를 만든다. 따라서 풀링 층을 사용하여 QCNN의 차원수를 8개의 큐비트에서 1개의 큐비트로 줄인다.

source: To classify our image dataset of horizontal and vertical lines, we measure the expectation value of the Pauli Z operator of the final qubit. Based on the obtained value being +1 or -1, we can conclude that the input image contained either a horizontal or vertical line.
es_un: Para clasificar nuestro conjunto de datos de imágenes de líneas horizontales y verticales, medimos el valor esperado del operador de Pauli Z del qubit final. Según el valor obtenido +1 o -1, podemos concluir que la imagen de entrada contenía una línea horizontal o vertical.
ja: 水平線と垂直線の画像データセットを分類するために、最後の量子ビットのパウリZ演算子の期待値を測定します。得られた値が+1または-1であることに基づいて、入力画像に水平または垂直な線が含まれていると結論付けることができます。
ko_kr: 수평선과 수직선의 이미지 데이터셋을 분류하기 위해 최종 큐비트의 파울리 Z 연산자의 기댓값을 측정한다. 얻어진 값이 +1 또는 -1인지에 따라 입력 이미지가 수평선 또는 수직선을 포함하였다고 결론지을 수 있다.

source: 5. Training our QCNN
es_un: 5. Entrenar nuestra QCNN
ja: 5. QCNNのトレーニング
ko_kr: 5. QCNN 학습

source: The next step is to build our model using our training data.
es_un: El siguiente paso es construir nuestro modelo usando nuestros datos de entrenamiento.
ja: 次のステップは、学習データを使ってモデルを構築することです。
ko_kr: 다음 단계는 학습 데이터를 사용하여 모델을 구축하는 것이다.

source: To classify our system, we perform a measurement from the output circuit. The value we obtain will thus classify whether our input data contains either a vertical line or horizontal line.
es_un: Para clasificar nuestro sistema, realizamos una medición desde el circuito de salida. El valor que obtengamos clasificará si nuestros datos de entrada contienen una línea vertical o una línea horizontal.
ja: このシステムを分類するために、出力回路から計測を行います。この測定値により、入力データが縦線か横線かを分類します。
ko_kr: 시스템을 분류하기 위해 출력 회로에서 측정을 수행한다. 따라서 얻은 값은 입력 데이터에 수직선이 포함되는지 수평선이 포함되는지 여부를 분류할 것이다.

source: The measurement we have chosen in this tutorial is :math:`<Z>`, i.e. the expectation value of the Pauli Z qubit for the final qubit. Measuring this expectation value, we obtain +1 or -1, which correspond to a vertical or horizontal line respectively.
es_un: La medición que hemos elegido en este tutorial es :math:`<Z>`, es decir, el valor esperado de la Pauli Z para el qubit final. Midiendo este valor esperado, obtenemos +1 o -1, que corresponden a una línea vertical u horizontal respectivamente.
ja: このチュートリアルで選んだ測定値は :math:`<Z>` 、すなわち、最終的な量子ビットに対するPauli Z量子ビットの期待値です。この期待値を測定すると、+1または-1が得られ、それぞれ垂直線または水平線に対応します。

source: We will also define a callback function to use when training our model. This allows us to view and plot the loss function per each iteration in our training process.
es_un: También definiremos una función de devolución de llamada para usar al entrenar nuestro modelo. Esto nos permite ver y graficar la función de pérdida por cada iteración en nuestro proceso de entrenamiento.
ja: また、モデルの学習時に使用するコールバック関数も定義します。これにより、学習過程における各反復ごとの損失関数を表示し、プロットすることができます。
ko_kr: 또한 모델을 학습할 때 사용할 콜백 함수를 정의한다. 이를 통해 학습 과정의 각 회차당 손실 함수를 보고 표시 할 수 있다.
