Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/11_quantum_convolutional_neural_networks.po
Languages: es_un, ja, ko_kr

source: In this example, we will use the COBYLA optimizer to train our classifier, which is a numerical optimization method commonly used for classification machine learning algorithms.
es_un: En este ejemplo, usaremos el optimizador COBYLA para entrenar nuestro clasificador, que es un método de optimización numérica comúnmente utilizado para clasificar algoritmos de machine learning.
ja: この例では、分類器の学習にCOBYLAオプティマイザーを使用します。これは、分類機械学習アルゴリズムによく使用される数値最適化手法です。
ko_kr: 이 예에서, 분류 기계 학습 알고리즘에 일반적으로 사용되는 수치 최적화 방법인 분류기를 학습하기 위해 COBYLA 최적화기를 사용한다.

source: We then place the the callback function, optimizer and operator of our QCNN created above into Qiskit's built in Neural Network Classifier, which we can then use to train our model.
es_un: Luego colocamos la función de devolución de llamada, el optimizador y el operador de nuestra QCNN creado anteriormente en el clasificador de redes neuronales integrado de Qiskit, que luego podemos usar para entrenar nuestro modelo.
ja: そして、上記で作成したQCNNのコールバック関数、オプティマイザー、演算子をQiskitに内蔵されたニューラルネットワーク分類器に配置し、それを使ってモデルの学習を行います。

source: Since model training may take a long time we have already pre-trained the model for some iterations and saved the pre-trained weights. We'll continue training from that point by setting ``initial_point`` to a vector of pre-trained weights.
es_un: Dado que el entrenamiento del modelo puede llevar mucho tiempo, ya hemos entrenado previamente el modelo para algunas iteraciones y hemos guardado los pesos previamente entrenados. Continuaremos entrenando desde ese punto configurando ``initial_point`` a un vector de pesos preentrenados.
ja: モデルの学習には長い時間がかかる可能性があるため、すでにいくつかの反復で事前学習したモデルがあり、事前学習済みの重みを保存してあります。 ``initial_point`` に学習済みの重みのベクトルを設定することで、その時点から学習を継続することにします。

source: After creating this classifier, we can train our QCNN using our training dataset and each image's corresponding label. Because we previously defined the callback function, we plot the overall loss of our system per iteration.
es_un: Después de crear este clasificador, podemos entrenar nuestra QCNN usando nuestro conjunto de datos de entrenamiento y la etiqueta correspondiente de cada imagen. Debido a que previamente definimos la función de devolución de llamada, graficamos la pérdida general de nuestro sistema por iteración.
ja: この分類器を作成した後、学習データセットと各画像に対応するラベルを用いてQCNNを学習することができます。コールバック関数を定義したので、反復ごとのシステムの全体的な損失をプロットします。

source: It may take some time to train the QCNN so be patient!
es_un: ¡Puede tomar algún tiempo entrenar la QCNN, así que ten paciencia!
ja: QCNNの学習には時間がかかるので、気長に待ちましょう。
ko_kr: QCNN을 학습하는 데 시간이 걸릴 수 있으므로 인내심이 필요하다.

source: As we can see from above, the QCNN converges slowly, hence our ``initial_point`` was already close to an optimal solution. The next step is to determine whether our QCNN can classify data seen in our test image data set.
es_un: Como podemos ver desde arriba, la QCNN converge lentamente, por lo que nuestro ``initial_point`` ya estaba cerca de una solución óptima. El siguiente paso es determinar si nuestra QCNN puede clasificar los datos vistos en nuestro conjunto de datos de imágenes de prueba.
ja: 上図からわかるように、QCNN はゆっくりと収束するので、``initial_point`` は既に最適解に近いものでした。次のステップは、このQCNNがテスト画像データセットに見られるデータを分類できるかどうかを判断することです。

source: 6. Testing our QCNN
es_un: 6. Probar nuestra QCNN
ja: 6. QCNNのテスト
ko_kr: 6. QCNN 테스트

source: After building and training our dataset we now test whether our QCNN can predict images that are not from our test data set.
es_un: Después de construir y entrenar nuestro conjunto de datos, ahora probamos si nuestra QCNN puede predecir imágenes que no son de nuestro conjunto de datos de prueba.
ja: データセットの構築と学習が完了したら、今度はQCNNがテストデータセット以外の画像を予測できるかどうかをテストしてみましょう。
ko_kr: 데이터셋을 구축하고 학습한 후, QCNN이 테스트 데이터셋에 없는 이미지를 예측할 수 있는지 테스트한다.

source: From above, we can indeed see that our QCNN can classify horizontal and vertical lines! Congratulations! Through the use of quantum circuits and quantum convolutional and pooling layers, you have built a Quantum Convolutional Neural Network!
es_un: ¡De lo anterior, podemos ver que nuestra QCNN puede clasificar líneas horizontales y verticales! ¡Felicidades! Mediante el uso de circuitos cuánticos y capas cuánticas convolucionales y de reducción (pooling), ¡has creado una Red Neuronal Cuántica Convolucional!
ja: 上図から、私たちのQCNNは水平線と垂直線を分類できることがわかります。おめでとうございます。量子回路と量子畳み込み層と量子プーリング層を使って、あなたは量子畳み込みニューラルネットワークを構築しました!
ko_kr: 위에서 보면, QCNN이 수평선과 수직선을 분류할 수 있다는 것을 알 수 있다. 드디어 양자 회로와 양자 합성곱 및 풀링 층을 사용하여 양자 합성곱 신경망을 구축하는데 성공했다!

source: 7. References
es_un: 7. Referencias
ja: 7. 参考文献
ko_kr: 7. 참조

source: Throughout this tutorial, we discuss a Quantum Convolutional Neural Network (QCNN), first proposed by Cong et. al. [1]. We implement such a QCNN on Qiskit by modeling both the convolutional layers and pooling layers using a quantum circuit. After building such a network, we train it to differentiate horizontal and vertical lines from a pixelated image. The following tutorial is thus divided accordingly;
ko_kr: 이 튜토리얼을 통해 Cong et, al. [1] 에서 처음 제안한 양자 합성곱 신경망(QCNN)에 대해 다뤄볼 것이다. 양자 회로를 사용하여 합성곱 층과 풀링 층을 모델링하여 Qiskit에 QCNN을 구현한다. 이러한 네트워크를 구축한 후 픽셀화된 이미지에서 수평선과 수직선을 구별하도록 훈련한다. 다음의 튜토리얼은 아래 목차와 같이 구성되어있다.

source: Quantum Convolutional Neural Networks (QCNN) behave in a similar manner to CCNNs. First, we encode our pixelated image into a quantum circuit using a given feature map, such Qiskit’s ZFeatureMap or ZZFeatureMap or others available in the circuit library.
ko_kr: 양자 합성곱 신경망(QCNN)은 CCNN과 유사한 방식으로 동작한다. Qiskit의 ZFeatureMap 또는 ZZFeatureMap과 같은 주어진 특성 지도를 사용하여 이미지의 픽셀 값을 양자 회로로 인코딩한다.

source: For the Quantum Pooling Layer, we cannot do the same as is done classically to reduce the dimension, i.e. the number of qubits in our circuit. Instead, we reduce the number of qubits by performing operations upon each until a specific point and then disregard certain qubits in a specific layer. It is these layers where we stop performing operations on certain qubits that we call our ‘pooling layer’. Details of the pooling layer is discussed further in the next section.
ko_kr: 양자 풀링 층의 경우, 회로의 큐비트 수와 같은 차원수를 줄이기 위해 고전적으로 행해진 것과 같은 것을 할 수 없다. 대신, 특정 지점까지 각각에 대한 작업을 수행한 다음 특정 층의 특정 큐비트를 무시함으로써 큐비트의 수를 줄인다. 이러한 것을 '풀링 층'이라고 부르고 특정 큐비트에서 작업을 수행하는 것을 중단하는 층이다. 풀링 층에 대한 자세한 내용은 다음 섹션에서 자세히 설명한다.

source: Note that we first apply the two qubit unitary to all even pairs of qubits followed by applying to odd pairs of qubits in a circular coupling manner, i.e. the as well as neighboring qubits being coupled, the first and final qubit are also coupled through a unitary gate.
ko_kr: 먼저 2 큐비트 유니타리를 모든 짝수 큐비트 쌍에 적용한 후 원형 커플링 방식으로 홀수 큐비트 쌍에 적용한다. 즉, 커플링 중인 인접하는 큐비트뿐만 아니라 첫 번째 큐비트와 마지막 큐비트도 유니타리 게이트를 통해 커플링된다.

source: The purpose of a pooling layer is to reduce the dimensions of our Quantum Circuit, i.e. reduce the number of qubits in our circuit, while retaining as much information as possible from previously learned data. Reducing the amount of qubits also reduces the computational cost of the overall circuit, as the number of parameters that the QCNN needs to learn decreases.
ko_kr: 풀링 층의 목적은 이전에 학습한 데이터에서 가능한 많은 정보를 유지하면서 양자 회로의 차원수를 줄이는 것이다. 큐비트의 수를 줄이면 QCNN이 학습해야 하는 매개 변수의 수가 줄어들기 때문에 전체 회로의 계산 비용도 감소한다.

source: To ‘artificially’ reduce the number of qubits in our circuit, we first begin by creating pairs of the :math:`N` qubits in our system.
ko_kr: 회로의 큐비트 수를 '인위적으로' 줄이기 위해 먼저 시스템에서 :math:`N` 큐비트 쌍을 만드는 것으로 시작한다.

source: This layer therefore has the overall effect of ‘combining’ the information of the two qubits into one qubit by first applying the unitary circuit, encoding information from one qubit into another, before disregarding one of qubits for the remainder of the circuit and not performing any operations or measurements on it.
ko_kr: 따라서 이 층은 먼저 유니타리 회로를 적용하여 두개의 큐비트의 정보를 하나의 큐비트로 '결합'하는 전반적인 효과를 가지고 있으며, 나머지 회로에 대해 큐비트 중 하나를 무시하고 어떠한 연산이나 측정을 수행하지 않는다.

source: In this particular example, we reduce the dimensionality of our four qubit circuit to the last two qubits, i.e. the last two qubits in this particular example. These qubits are then used in the next layer, while the first two are neglected for the remainder of the QCNN.
ko_kr: 이 특정 예제에서는 4개의 큐비트 회로의 차원수를 마지막 2개의 큐비트로 줄인다. 이러한 큐비트는 다음 층에서 사용되는 반면 처음 두 개는 나머지 QCNN에서 무시된다.

source: Because of a classical CNN’s ability to recognize features and patterns easily, we will train our QCNN to also determine patterns and features of a given set of pixelated images, and classify between two different patterns.
ko_kr: 특징과 패턴을 쉽게 인식하는 고전적인 CNN의 능력으로 인해, QCNN을 학습시켜 주어진 픽셀화된 이미지 세트의 패턴과 특징을 결정하고 두 개의 다른 패턴을 분류한다.

source: We first begin by generating this dataset. To create a ‘horizontal’ or ‘vertical’ line, we assign pixels value to be :math:`\frac{\pi}{2}` which will represent the line in our pixelated image. We create a noisy background by assigning every other pixel a random value between :math:`0` and :math:`\frac{\pi}{4}` which will create a noisy background.
ko_kr: 먼저 이 데이터셋을 생성하는 것으로 시작한다. '수평' 또는 '수직' 선을 생성하기 위해 픽셀 값을 픽셀화된 이미지에서 선을 나타낼 :math:`\frac{\pi}{2}` 로 할당한다. 모든 다른 픽셀을 :math:`0` 과 :math:`\frac{\pi}{4}` 사이에 임의의 값을 할당하여 노이즈가 많은 배경을 만든다.

source: Let’s now create our dataset below and split it into our test and training datasets.
ko_kr: 이제 아래에 데이터셋을 만들고 테스트 및 학습 데이터셋으로 나눠보자.

source: Let’s see some examples in our dataset
ko_kr: 데이터셋에서 몇 가지 예를 살펴보자.

source: We encode our dataset into our QCNN by applying a feature map. One can create a feature map using one of Qiskit’s built in feature maps, such as ZFeatureMap or ZZFeatureMap.
ko_kr: 특징 지도를 적용하여 데이터셋을 QCNN으로 인코딩한다. ZFeatureMap 또는 ZZFeatureMap과 같은 Qiskit에 내장된 특징 지도 중 하나를 사용하여 특징 지도를 생성할 수 있다.

source: The measurement we have chosen in this tutorial is :math:`<Z>`, i.e. the expectation value of the Pauli Z qubit for the final qubit. Measuring this expectation value, we obtain +1 or -1, which correspond to a vertical or horizontal line respectively.
ko_kr: 이 튜토리얼에서 선택한 측정은 최종 큐비트에 대한 파울리 Z 큐비트의 기대값인 :math:`<Z>` 이다. 이 기댓값을 측정하면 각각 수직선과 수평선에 해당하는 +1 또는 -1을 얻을 수 있다.

source: We then place the the callback function, optimizer and operator of our QCNN created above into Qiskit’s built in Neural Network Classifier, which we can then use to train our model.
ko_kr: 그런 다음 위에서 생성된 QCNN의 콜백 함수, 옵티마이저, 연산자를 Qiskit의 신경망 분류기에 배치하여 모델을 학습하는 데 사용할 수 있다.

source: After creating this classifier, we can train our QCNN using our training dataset and each image’s corresponding label. Because we previously defined the callback function, we plot the overall loss of our system per iteration.
ko_kr: 이 분류기를 생성한 후, 학습 데이터 세트와 각 이미지의 해당 레이블을 사용하여 QCNN을 학습시킬 수 있다. 이전에 콜백 함수를 정의했기 때문에 반복당 전체 시스템 손실을 그래프로 표시한다.
