Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/11_quantum_convolutional_neural_networks.po
Languages: es_un, ja, ko_kr

source: This page was generated from `docs/tutorials/11_quantum_convolutional_neural_networks.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/11_quantum_convolutional_neural_networks.ipynb`__.
ja: このページは `docs/tutorials/11_quantum_convolutional_neural_networks.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/11_quantum_convolutional_neural_networks.ipynb`__ 에서 생성되었다.

source: The Quantum Convolution Neural Network
es_un: La Red Neuronal Convolucional Cuántica
ja: 量子畳み込みニューラル・ネットワーク
ko_kr: 양자 합성곱 신경망

source: 1. Introduction
es_un: 1. Introducción
ja: 1. はじめに
ko_kr: 1. 소개

source: Throughout this tutorial, we discuss a Quantum Convolutional Neural Network (QCNN), first proposed by Cong et. al. [1]. We implement such a QCNN on Qiskit by modeling both the convolutional layers and pooling layers using a quantum circuit. After building such a network, we train it to differentiate horizontal and vertical lines from a pixelated image. The following tutorial is thus divided accordingly;
es_un: A lo largo de este tutorial, analizamos una red neuronal convolucional cuántica (Quantum Convolutional Neural Network, QCNN), propuesta por primera vez por Cong et. al. [1]. Implementamos una QCNN de este tipo en Qiskit mediante el modelado de las capas convolucionales y las capas de agrupación mediante un circuito cuántico. Después de construir una red de este tipo, la entrenamos para diferenciar las líneas horizontales y verticales de una imagen pixelada. El siguiente tutorial se divide en consecuencia;
ja: このチュートリアルでは、Convolutional Neural Network(QCNN)の量子畳み込みニューラルネットワークについて説明します。[1]. 量子回路を使用して畳み込み層とプール層の両方をモデリングすることによって、QiskitにこのようなQCNNを実装します。 このようなネットワークを構築した後、ピクセル化された画像から水平線と垂直線を区別するように学習します。以下のチュートリアルはそれに応じて分割されます。

source: Differences between a QCNN and CCNN
es_un: Diferencias entre una QCNN y una CCNN
ja: QCNNとCCNNの違い
ko_kr: QCNN과 CCNN의 차이점

source: Components of a QCNN
es_un: Componentes de una QCNN
ja: QCNN の構成要素
ko_kr: QCNN의 구성 요소

source: Data Generation
es_un: Generación de Datos
ja: データ生成
ko_kr: 데이터 생성

source: Building a QCNN
es_un: Construir una QCNN
ja: QCNN のビルド
ko_kr: QCNN 구축

source: Training our QCNN
es_un: Entrenar nuestra QCNN
ja: QCNNのトレーニング
ko_kr: QCNN 학습

source: Testing our QCNN
es_un: Probar nuestra QCNN
ja: QCNNのテスト
ko_kr: QCNN 테스트

source: References
es_un: Referencias
ja: 参考文献
ko_kr: 참고문헌

source: We first begin by importing the libraries and packages we will need for this tutorial.
es_un: Primero comenzamos importando las bibliotecas y los paquetes que necesitaremos para este tutorial.
ja: まず始めに、このチュートリアルで必要となるライブラリーおよびパッケージをインポートします。
ko_kr: 먼저 이 튜토리얼에 필요한 라이브러리와 패키지를 불러온다.

source: 1. Differences between a QCNN and CCNN
es_un: 1. Diferencias entre una QCNN y una CCNN
ja: 1. QCNNとCCNNの違い
ko_kr: 1. QCNN과 CCNN의 차이점

source: 1.1 Classical Convolutional Neural Networks
es_un: 1.1 Redes Neuronales Convolucionales Clásicas
ja: 1.1 古典的な畳み込みニューラル・ネットワーク
ko_kr: 1.1 고전 합성곱 신경망

source: Classical Convolutional Neural Networks (CCNNs) are a subclass of artificial neural networks which have the ability to determine particular features and patterns of a given input. Because of this, they are commonly used in image recognition and audio processing.
es_un: Las Redes Neuronales Convolucionales Clásicas (Classical Convolutional Neural Networks, CCNN) son una subclase de redes neuronales artificiales que tienen la capacidad de determinar características y patrones particulares de una entrada determinada. Debido a esto, se utilizan comúnmente en el reconocimiento de imágenes y el procesamiento de audio.
ja: Classical Convolutional Neural Networks (CCNNs) は、人工のニューラルネットワークのサブクラスであり、与えられた入力の特徴やパターンを決定することができます。 このため、画像認識処理や音声処理などで一般的に使用されています。
ko_kr: 고전 합성곱 신경망(CCNN)은 입력의 특정한 특징과 패턴을 결정할 수 있는 인공 신경망의 하위 개념이다. 이 같은 이유로 이미지 인식 및 오디오 처리에 일반적으로 사용된다.

source: The capability of determining features is a result of the two types of layers used in a CCNN, the convolutional layer and pooling layer.
es_un: La capacidad de determinar características es el resultado de los dos tipos de capas que se utilizan en una CCNN, la capa convolucional y la capa de reducción (pooling).
ja: フィーチャーを決定するのは 、CCNN で使われている畳み込み層とプーリング層の２種類の層の結果です。
ko_kr: CCNN에서 사용되는 합성곱 층과 풀링 층을 이용해서 입력데이터의 특징을 추출할 수 있다.

source: An example of a CCNN can be seen in Figure 1, where a CCNN is trained to determine whether an input image either contains a cat or a dog. To do so, the input image passes through a series of alternating convolutional (C) and pooling layers (P), all of which detect patterns and associate each pattern to a cat or a dog. The fully connected layer (FC) provides us with an output which allows us to determine whether the input image was a cat or dog.
es_un: Se puede ver un ejemplo de CCNN en la Figura 1, donde se entrena a una CCNN para determinar si una imagen de entrada contiene un gato o un perro. Para hacerlo, la imagen de entrada pasa a través de una serie de capas alternas convolucionales (C) y de reducción (P), todas las cuales detectan patrones y asocian cada patrón a un gato o un perro. La capa totalmente conectada (FC) nos proporciona una salida que nos permite determinar si la imagen de entrada era un gato o un perro.
ja: CCNN の例を図 1 に示します。CCNN は、入力画像に猫と犬のどちらが含まれているかを判断するようにトレーニングされています。 そのために、入力画像は一連の畳み込み層 (C) とプーリング層 (P) を交互に通過します。すべての層でパターンが検出され、各パターンが猫または犬に関連付けられます。 全結合層 (FC) は、入力画像が猫か犬かを判断できる出力を提供します。
ko_kr: 그림 1의 CCNN 모델은 입력 이미지가 고양이 혹은 개를 포함하는지 판단하도록 학습되었다. 이를 위해 입력 이미지는 일련의 합성곱 층(C)과 풀링 층(P)을 교대로 통과한하고, 모든 층에서 패턴을 감지되고 각 패턴이 고양이 또는 개와 연결한다. 전결합 층(FC)은 입력 이미지가 고양이인지 개인지를 결정할 수 있는 출력을 제공한다.

source: The convolutional layer makes use of a kernel, which can determine features and patterns of a particular input. An example of this is feature detection in an image, where different layers detect particular patterns in the input image. This is demonstrated in Figure 1, where the :math:`l^{th}` layer recognizes features and patterns along the :math:`ij` plane. It can then associate such features with a given output in the training process, and can use this process to train the dataset.
es_un: La capa convolucional utiliza un kernel, que puede determinar características y patrones de una entrada en particular. Un ejemplo de esto es la detección de características en una imagen, donde diferentes capas detectan patrones particulares en la imagen de entrada. Esto se demuestra en la Figura 1, donde la capa :math:`l^{th}` reconoce características y patrones a lo largo del plano :math:`ij`. Luego, puede asociar dichas características con un resultado dado en el proceso de entrenamiento y puede usar este proceso para entrenar el conjunto de datos.
ja: 畳み込み層はカーネルを利用し、特定の入力の特徴量やパターンを決定することができます。この例は画像の特徴量検出であり、異なる層が入力画像中の特定のパターンを検出します。これは図1に示されており、 :math:`l^{th}` 層は :math:`ij` 平面に沿って特徴やパターンを認識します。そして、学習プロセスにおいて、そのような特徴量を与えられた出力と関連付けることができ、このプロセスを用いてデータセットを学習させることができます。
ko_kr: 합성곱 층은 특정 입력의 특징 및 패턴을 판단할 수 있는 커널을 사용한다. 이것의 예는 이미지에서의 특징 검출이며, 여기서 각각의 층들은 입력 이미지 내의 특정 패턴들을 검출한다. 이는 :math:`ij` 평면을 따라 특징 및 패턴을 인식하는 :math:`l^{th}` 층이 있는 그림 1에 도시되어 있다. 그런 다음 이러한 특징을 학습 과정에서 주어진 출력과 연관시킬 수 있으며, 이러한 과정을 통해 데이터셋을 학습할 수 있다.

source: On the other hand, a pooling layer reduces the dimensionality of the input data, reducing the computational cost and amount of learning parameters in the CCNN. A schematic of a CCNN can be seen below.
es_un: Por otro lado, una capa de reducción (pooling) reduce la dimensionalidad de los datos de entrada, reduciendo el costo computacional y la cantidad de parámetros de aprendizaje en la CCNN. A continuación se puede ver un esquema de una CCNN.
ja: 一方、プーリング層は入力データの次元を減らし、CCNNの計算コストと学習パラメーターの量を減らすことができます。CCNNの模式図を以下に示します。
ko_kr: 한편, 풀링 층은 입력 데이터의 차원수를 감소시키고, CCNN 에서 학습 매개변수의 양과 연산 비용을 감소시킨다. CCNN의 개략도는 아래에서 볼 수 있다.

source: For further information on CCNN, see [2].
es_un: Para obtener más información sobre CCNN, consulta [2].
ja: CCNNの詳細については、 [2] を参照してください。
ko_kr: CCNN에 대한 추가 정보는 [2]를 참조하십시오.

source: |Screenshot%202022-08-09%20at%2017.03.09.png| Figure 1. A schematic demonstration of the use of a CCNN to classify between images of a cat and dog. Here, we see the several convolutional and pooling layers being applied, all of which are decreasing in dimensionality due to the use of the pooling layers. The output of the CCNN determines whether the input image was a cat or dog. Image obtained form [1].
es_un: |Screenshot%202022-08-09%20at%2017.03.09.png| Figura 1. Una demostración esquemática del uso de una CCNN para clasificar entre imágenes de un gato y un perro. Aquí, vemos que se aplican varias capas convolucionales y de reducción, todas están disminuyendo en dimensionalidad debido al uso de las capas de reducción. La salida de la CCNN determina si la imagen de entrada era un gato o un perro. Imagen obtenida de [1].
ja: |Screenshot%2022-08-09%20at%2017.03.09.png| 図1. 猫と犬の画像の間を分類するためにCCNNを使用する概略的なデモンストレーション。ここでは、いくつかの畳み込み層とプーリング層が適用されており、プーリング層の使用により、すべての次元が減少していることがわかります。CCNNの出力は、入力画像が猫であるか犬であるかを決定します。画像は[1]の形から得られました。
ko_kr: |Screenshot%202022-08-09%20at%2017.03.09.png| Figure 1. CCNN을 사용하여 고양이와 개의 이미지를 분류하는 개략적인 시연이다. 풀링 층의 사용으로 인해 차원수가 감소하는 여러 합성곱 층과 풀링 층이 적용되는 것을 볼 수 있다. CCNN의 출력을 통해 입력 이미지가 고양이인지 개인지를 결정한다. [1] 에서 가져온 이미지이다.

source: 1.2 Quantum Convolutional Neural Networks
es_un: 1.2 Redes Neuronales Convolucionales Cuánticas
ja: 1.2 量子畳み込みニューラル・ネットワーク
ko_kr: 1.2 양자 합성곱 신경망

source: Quantum Convolutional Neural Networks (QCNN) behave in a similar manner to CCNNs. First, we encode our pixelated image into a quantum circuit using a given feature map, such Qiskit's ZFeatureMap or ZZFeatureMap or others available in the circuit library.
es_un: Las Redes Neuronales Convolucionales Cuánticas (Quantum Convolutional Neural Networks, QCNN) se comportan de manera similar a las CCNN. Primero, codificamos nuestra imagen pixelada en un circuito cuántico utilizando un mapa de características determinado, como ZFeatureMap o ZZFeatureMap de Qiskit u otros disponibles en la biblioteca de circuitos.
ja: 量子畳み込みニューラルネットワーク（QCNN）は、CCNNと同様の動作をします。まず、QiskitのZFeatureMapやZZFeatureMapなど、circuit ライブラリーにある所定の特徴量マップを用いて、画素化した画像を量子回路にエンコードします。

source: After encoding our image, we apply alternating convolutional and pooling layers, as defined in the next section. By applying these alternating layers, we reduce the dimensionality of our circuit until we are left with one qubit. We can then classify our input image by measuring the output of this one remaining qubit.
es_un: Después de codificar nuestra imagen, aplicamos capas convolucionales y de reducción (pooling) alternas, como se define en la siguiente sección. Al aplicar estas capas alternas, reducimos la dimensionalidad de nuestro circuito hasta que nos quedamos con un qubit. Luego podemos clasificar nuestra imagen de entrada midiendo la salida de este qubit restante.
ja: 画像を符号化した後、次のセクションで定義するように、畳み込み層とプーリング層を交互に適用します。これらの層を交互に適用することで、回路の次元を減らし、1つの量子ビットを残すことができます。そして、この残った1つの量子ビットの出力を測定することで、入力画像を分類することができます。
ko_kr: 이미지를 인코딩한 후 다음 섹션에서 정의된 대로 합성곱 층과 풀링 층을 교대로 적용한다. 이러한 층들을 교대로 적용함으로써, 회로의 차원을 큐비트가 한개만 남을 때까지 감소시킨다. 그런 다음 이 남은 큐비트의 출력을 측정하여 입력 이미지를 분류할 수 있다.

source: The Quantum Convolutional Layer will consist of a series of two qubit unitary operators, which recognize and determine relationships between the qubits in our circuit. This unitary gates are defined below in the next section.
es_un: La Capa Convolucional Cuántica consistirá en una serie de operadores unitarios de dos qubits, que reconocen y determinan las relaciones entre los qubits en nuestro circuito. Estas compuertas unitarias se definen a continuación en la siguiente sección.
ja: 量子畳み込み層は一連の2量子ビットユニタリー演算子で構成され、回路内の量子ビットの関係を認識し決定します。このユニタリーゲートは次のセクションで定義されます。
ko_kr: 양자 합성곱 층은 회로의 큐비트 간의 관계를 인식하고 결정하는 두 개의 큐비트 유니타리 연산자로 구성된다. 이 유니타리 게이트는 다음 섹션에서 아래에 정의된다.

source: For the Quantum Pooling Layer, we cannot do the same as is done classically to reduce the dimension, i.e. the number of qubits in our circuit. Instead, we reduce the number of qubits by performing operations upon each until a specific point and then disregard certain qubits in a specific layer. It is these layers where we stop performing operations on certain qubits that we call our 'pooling layer'. Details of the pooling layer is discussed further in the next section.
es_un: Para la Capa de Reducción Cuántica, no podemos hacer lo mismo que se hace clásicamente para reducir la dimensión, es decir, la cantidad de qubits en nuestro circuito. En cambio, reducimos la cantidad de qubits realizando operaciones en cada uno hasta un punto específico y luego ignoramos ciertos qubits en una capa específica. Son estas capas donde dejamos de realizar operaciones en ciertos qubits que llamamos nuestra 'capa de reducción'. Los detalles de la capa de reducción se analizan más a fondo en la siguiente sección.
ja: 量子プーリング層では、古典的に行われているような、回路の次元、すなわち量子ビットの数を減らすようなことはできません。その代わりに、ある時点まで各量子ビットの演算を行い、特定の層で特定の量子ビットを無視することによって、量子ビット数を減らします。特定の量子ビットの演算を停止するこれらの層を、私たちは「プーリング層」と呼んでいます。プーリング層の詳細については、次のセクションでさらに説明します。

source: In the QCNN, each layer contains parametrized circuits, meaning we alter our output result by adjusting the parameters of each layer. When training our QCNN, it is these parameters that are adjusted to reduce the loss function of our QCNN.
es_un: En QCNN, cada capa contiene circuitos parametrizados, lo que significa que alteramos nuestro resultado de salida ajustando los parámetros de cada capa. Al entrenar nuestra QCNN, son estos parámetros los que se ajustan para reducir la función de pérdida de nuestra QCNN.
ja: QCNNでは各層にパラメーター化された回路があり、各層のパラメーターを調整することで出力結果を変化させられます。QCNNを学習する際には、これらのパラメーターを調整し、QCNNの損失関数を減少させます。
ko_kr: QCNN에서 각 층은 매개 변수화된 회로를 포함하며, 각 층의 매개 변수를 조정하여 출력 결과를 변경한다는 것을 의미한다. QCNN을 학습할 때 이러한 매개 변수는 QCNN의 손실 함수를 줄이기 위해 조정된다.

source: A simple example of four qubit QCNN can be seen below.
es_un: A continuación se puede ver un ejemplo simple de QCNN de cuatro qubits.
ja: 4量子ビットのQCNNの簡単な例を以下に示します。
ko_kr: 4개의 큐비트 QCNN의 간단한 예는 아래에서 볼 수 있다.

source: Figure 2: Example QCNN containing four qubits. The first Convolutional Layer acts on all the qubits. This is followed by the first pooling layer, which reduces the dimensionality of the QCNN from four qubits to two qubits by disregarding the first two. The second Convolutional layer then detects features between the two qubits still in use in the QCNN, followed by another pooling layer, which reduces the dimensionality from two qubits to one, which will be our output qubit.
es_un: Figura 2: Ejemplo de QCNN que contiene cuatro qubits. La primera Capa Convolucional actúa sobre todos los qubits. A esto le sigue la primera capa de reducción, que disminuye la dimensionalidad de la QCNN de cuatro qubits a dos qubits al ignorar los dos primeros. Luego, la segunda Capa Convolucional detecta características entre los dos qubits que aún están en uso en la QCNN, seguida de otra capa de reducción, que disminuye la dimensionalidad de dos qubits a uno, que será nuestro qubit de salida.
ja: 図2: 4つの量子ビットを含むQCNNの例。最初の畳み込み層は全ての量子ビットに作用します。これは最初の2つの量子ビットを無視することによって、QCNNの次元を4つの量子ビットから2つの量子ビットに減少させるものです。次に2番目の畳み込み層が、QCNNでまだ使用されている2つの量子ビットの間の特徴を検出し、さらにプーリング層が続いて、2つの量子ビットから1つに次元を減少させ、これが我々の出力量子ビットとなります。
ko_kr: 그림 2: 4개의 큐비트를 포함하는 QCNN의 예시. 첫 번째 합성곱 층은 모든 큐비트에 작용한다. 이는 첫 번째 풀링 층에 이어 첫 번째 두 개를 무시하여 QCNN의 차원수를 4개의 큐비트에서 2개의 큐비트로 감소시킨다. 그런 다음 두 번째 합성곱 층 QCNN에서 여전히 사용 중인 두 큐비트 사이의 특징을 감지하고 이어서 다른 풀링 층을 감지하여 2개의 큐비트에서 출력 큐비트가 되는 1개의 큐비트로 차원수를 감소시킨다.

source: 2. Components of a QCNN
es_un: 2. Componentes de una QCNN
ja: 2. QCNN の構成要素
ko_kr: 2. QCNN의 구성요소

source: As discussed in Section 1 of this tutorial, a CCNN will contain both convolutional and pooling layers. Here, we define these layers for the QCNN in terms of gates applied to a Quantum Circuit and demonstrate an example for each layer for 4 qubits.
es_un: Como se discutió en la Sección 1 de este tutorial, una CCNN contendrá capas convolucionales y de reducción (agrupación). Aquí, definimos estas capas para la QCNN en términos de compuertas aplicadas a un circuito cuántico y demostramos un ejemplo para cada capa para 4 qubits.
ja: このチュートリアルのセクション 1 で議論したように、CCNN は畳み込み層とプーリング層の両方を含むことになります。ここでは、量子回路に適用されるゲートという観点から QCNN のためにこれらの層を定義し、4量子ビットのための各層の例を示します。
ko_kr: 이 튜토리얼의 섹션 1에서 논의한 바와 같이, CCNN은 합성곱 층과 풀링 층을 모두 포함할 것이다. 여기서, 양자 회로에 적용되는 게이트의 관점에서 QCNN에 대한 이러한 층을 정의하고 4개의 큐비트에 대한 각 층의 예를 보여준다.

source: Each of these layers will contain parameters which are tuned throughout the training process to minimize the loss function and train the QCNN to classify between horizontal and vertical lines.
es_un: Cada una de estas capas contendrá parámetros que se ajustan a lo largo del proceso de entrenamiento para minimizar la función de pérdida y entrenar a la QCNN para clasificar entre líneas horizontales y verticales.
ja: これらの各層は、損失関数を最小化し、QCNNが水平線と垂直線を分類するように学習プロセスを通じて調整されるパラメーターを含んでいます。
ko_kr: 이러한 각 층에는 손실 함수를 최소화하고 QCNN이 수평선과 수직선 사이를 분류하도록 학습하기 위해 학습 과정 전반에 걸쳐 조정된 매개 변수가 포함된다.

source: In theory, one could apply any parametrized circuit for both the convolutional and pooling layers of our network. For example in [2], the Gellmann Matrices (which are the three dimensional generalization of the Pauli Matrices) are used as generators for each unitary gate acting on a pair of qubits.
es_un: En teoría, se podría aplicar cualquier circuito parametrizado para las capas convolucional y de reducción de nuestra red. Por ejemplo, en [2], las Matrices de Gellmann (que son la generalización tridimensional de las Matrices de Pauli) se utilizan como generadores para cada compuerta unitaria que actúa sobre un par de qubits.
ja: 理論的には、我々のネットワークの畳み込み層とプーリング層の両方に、任意のパラメーター化された回路を適用することができます。例えば、[2] では、Gellmann行列(Pauli行列の3次元一般化) が、1組の量子ビットに作用する各ユニタリーゲートの生成子として使用されています。
ko_kr: 이론적으로, 네트워크의 합성곱 층과 풀링 층 모두에 매개 변수화된 회로를 적용할 수 있다. 예를 들어 [2] 에서 (파울리 행렬의 3차원 일반화인) Gellmann 행렬은 한 쌍의 큐비트에 작용하는 각 유니타리 게이트의 생성기로 사용된다.

source: Here, we take a different approach and form our parametrized circuit based on the two qubit unitary as proposed in [3]. This states that every unitary matrix in :math:`U(4)` can be decomposed such that
es_un: Aquí, tomamos un enfoque diferente y formamos nuestro circuito parametrizado basado en la unitaria de dos qubits como se propone en [3]. Esto establece que cada matriz unitaria en :math:`U(4)` se puede descomponer de tal manera que
ja: ここでは、異なるアプローチとして、[3]で提案された2量子ビットのユニタリーに基づいてパラメーター化された回路を構成します。これは、 :math:`U(4)` のすべてのユニタリー行列が、以下のように分解できることを述べています。
ko_kr: 여기서, 다른 접근법을 취하고 [3] 에서 제안된 것처럼 두 개의 큐비트 유니타리를 기반으로 매개 변수화된 회로를 형성한다. 이것은 :math:`U(4)` 의 모든 유니타리 행렬이 다음과 같이 분해될 수 있음을 나타낸다.

source: U = (A_1 \otimes A_2) \cdot N(\alpha, \beta, \gamma) \cdot (A_3 \otimes A_4)
ja: U = (A_1 \otime A_2) \cdot N(\alpha, \beta, \gamma) \cdot (A_3 \otime A_4)

source: where :math:`A_j \in \text{SU}(2)`, :math:`\otimes` is the tensor product, and :math:`N(\alpha, \beta, \gamma) = exp(i[\alpha \sigma_x\sigma_x + \beta \sigma_y\sigma_y + \gamma \sigma_z\sigma_z ])`, where :math:`\alpha, \beta, \gamma` are the parameters that we can adjust.
es_un: donde :math:`A_j \in \text{SU}(2)`, :math:`\otimes` es el producto tensorial, y :math:`N(\alpha, \beta, \gamma) = exp(i[\alpha \sigma_x\sigma_x + \beta \sigma_y\sigma_y + \gamma \sigma_z\sigma_z ])`, donde :math:`\alpha, \beta, \gamma` son los parámetros que podemos ajustar.
ja: ここで、 :math:`A_j \in \text{SU}(2)` 、 :math:`\otimes` はテンソル積、 :math:`N(\alpha, \beta, \gamma) = exp(i [\alpha \sigma_x\sigma_x + \beta \sigma_y\sigma_y + \gamma \sigma_z\sigma_z ])` 、ここで :math:`\alpha, \beta, \gamma` は調整できるパラメーターです。
ko_kr: 여기서 :math:`A_j \in \text{SU}(2)` 이고, :math:`\otimes` 는 텐서 곱이며 :math:`N(\alpha, \beta, \gamma) = exp(i[\alpha \sigma_x\sigma_x + \beta \sigma_y\sigma_y + \gamma \sigma_z\sigma_z ])` 에서의 :math:`\alpha, \beta, \gamma` 는 조절할 수 있는 매개 변수이다.

source: From this, it is evident that each unitary depends on 15 parameters and implies that in order for the QCNN to be able to span the whole Hilbert space, each unitary in our QCNN must contain 15 parameters each.
es_un: A partir de esto, es evidente que cada unitaria depende de 15 parámetros e implica que para que la QCNN pueda abarcar todo el espacio de Hilbert, cada unitaria en nuestra QCNN debe contener 15 parámetros cada una.
ja: このことから、各ユニタリーは15個のパラメーターに依存しており、QCNNがHilbert空間全体をカバーするためには、我々のQCNNの各ユニタリーはそれぞれ15個のパラメーターを含んでいなければならないことがわかります。
ko_kr: 이로부터, 각 유니타리는 15개의 매개 변수에 의존한다는 것이 분명하며, QCNN이 전체 힐베르트 공간을 포괄할 수 있으려면 QCNN의 각 유니타리가 각각 15개의 매개 변수를 포함해야 한다는 것을 암시한다.

source: Tuning this large amount of parameters would be difficult and would lead to long training times. To overcome this problem, we restrict our ansatz to a particular subspace of the Hilbert space and define the two qubit unitary gate as :math:`N(\alpha, \beta, \gamma)`. These two qubit unitaries, as seen in [3] can be seen below and are applied to all neighboring qubits each of the layers in the QCNN.
es_un: Ajustar esta gran cantidad de parámetros sería difícil y daría lugar a largos tiempos de entrenamiento. Para superar este problema, restringimos nuestro ansatz a un subespacio particular del espacio de Hilbert y definimos la compuerta unitaria de dos qubits como :math:`N(\alpha, \beta, \gamma)`. Estas unitarias dos qubits, como se muestra en [3], se pueden ver a continuación y se aplican a todos los qubits vecinos de cada una de las capas de la QCNN.
ja: この大量のパラメーターを調整するのは難しく、学習時間が長くなってしまいます。この問題を克服するために、私たちはansatzをヒルベルト空間の特定の部分空間に制限し、2量子ビットユニタリーゲートを :math:`N(\alpha, \beta, \gamma)` として定義します。これらの2量子ビットのユニタリーは[3]に見られるように、QCNNの各層で隣接するすべての量子ビットに適用されるもので、以下のようになります。
ko_kr: 이렇게 많은 양의 매개변수를 조정하는 것은 어렵고 긴 학습 시간이 필요할 것이다. 이 문제를 극복하기 위해, ansatz를 힐베르트 공간의 특정 하위 공간으로 제한하고 2 큐비트 유니타리 게이트를 :math:`N(\alpha, \beta, \gamma)` 로 정의한다. [3] 에서 볼 수 있는 이 2 큐비트 유니타리들은 아래에서 볼 수 있으며 QCNN의 각 층에 대한 모든 인접 큐비트에 적용된다.

source: Note that by only using :math:`N(\alpha, \beta, \gamma)` as our two qubit unitary for the parametrized layers, we are restricting our QCNN to a particular subspace, one in which the optimal solution may not be contained in and reducing the accuracy of the QCNN. For the purpose of this tutorial, we will use this parametrized circuit to decrease the training time of our QCNN.
es_un: Ten en cuenta que al usar solo :math:`N(\alpha, \beta, \gamma)` como nuestra unitaria de dos qubits para las capas parametrizadas, estamos restringiendo nuestra QCNN a un subespacio particular, uno en el que la solución óptima puede no estar contenida y reduciendo la precisión de la QCNN. A los efectos de este tutorial, utilizaremos este circuito parametrizado para disminuir el tiempo de entrenamiento de nuestra QCNN.
ja: QCNN を特定の部分空間に限定することで、最適解が含まれない可能性があり、QCNN の精度が低下することに注意してください。このチュートリアルの目的では、このパラメーター化された回路を使ってQCNNの学習時間を短縮することにします。
ko_kr: :math:`N(\alpha, \beta, \gamma)` 를 매개 변수화된 층에 대한 2 큐비트 유니타리로만 사용함으로써, QCNN을 최적의 솔루션이 포함되지 않을 수 있는 특정 하위 공간으로 제한하고 QCNN의 정확도를 감소시킨다는 점에 유의한다. 이 튜토리얼의 의도대로 이 매개 변수화된 회로를 사용하여 QCNN의 학습 시간을 단축할 것이다.
