Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/12_quantum_autoencoder.po
Languages: es_un, ja

source: This page was generated from `docs/tutorials/12_quantum_autoencoder.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/12_quantum_autoencoder.ipynb`__.
ja: このページは `docs/tutorials/12_quantum_autoencoder.ipynb`__ から生成されました。

source: The Quantum Autoencoder
es_un: El Autocodificador Cuántico
ja: 量子オートエンコーダー

source: The goal of this tutorial is to build an Quantum Autoencoder, a circuit which can compress a quantum state onto a smaller amount of qubits, while retaining the information from the initial state.
es_un: El objetivo de este tutorial es construir un Autocodificador Cuántico, un circuito que puede comprimir un estado cuántico en una cantidad más pequeña de qubits, mientras retiene la información del estado inicial.
ja: このチュートリアルの目的は、量子オートエンコーダを作ることです。量子オートエンコーダーは、初期状態からの情報を保持しながら、より少ない量子ビットに量子状態を圧縮できる回路です。

source: Throughout this tutorial, we explain the architecture of a Quantum Autoencoder and how one can design and train such a system to compress and encode information. Following this discussion, we give two examples to demonstrate the capabilities of such a system to compress different quantum states, as well as the ability to compress images of zeros and ones.
es_un: A lo largo de este tutorial, explicamos la arquitectura de un Autocodificador Cuántico y cómo se puede diseñar y entrenar dicho sistema para comprimir y codificar información. Después de esta discusión, damos dos ejemplos para demostrar las capacidades de dicho sistema para comprimir diferentes estados cuánticos, así como la capacidad de comprimir imágenes de ceros y unos.
ja: このチュートリアルでは、量子オートエンコーダーのアーキテクチャーと、情報を圧縮し符号化するためにどのように設計し訓練できるかを説明します。この議論に続いて、このようなシステムが異なる量子状態を圧縮する能力と、0と1の画像を圧縮する能力を示すために、2つの例を挙げます。

source: Contents
es_un: Contenido
ja: 目次

source: The following tutorial is broken down as follows:
es_un: El siguiente tutorial se desglosa de la siguiente manera:
ja: チュートリアルは、以下のように構成されています。

source: What is an Autoencoder?
es_un: ¿Qué es un Autocodificador?
ja: オートエンコーダーとは何か?

source: Components of a Quantum Autoencoder
es_un: Componentes de un Autocodificador Cuántico
ja: 量子オートエンコーダーの構成要素

source: Choosing a Loss Function
es_un: Elegir una Función de Pérdida
ja: 損失関数の選択

source: Building our Autoencoder
es_un: Construir nuestro Autocodificador
ja: オートエンコーダーの構築

source: A Simple Example: The Domain Wall
es_un: Un Ejemplo Simple: La Pared de Dominio
ja: 簡単な例：領域の壁

source: A Quantum Autoencoder for Noisy Images of Digits
es_un: Un Autocodificador Cuántico para Imágenes Ruidosas de Dígitos
ja: ノイズがある数字の画像のための量子オートエンコーダー

source: Applications of a Quantum Autoencoder
es_un: Aplicaciones de un Autocodificador Cuántico
ja: 量子オートエンコーダーの応用

source: References
es_un: Referencias
ja: 参考文献

source: 1. What is an Autoencoder?
es_un: 1. ¿Qué es un Autocodificador?
ja: 1. オートエンコーダーとは何か?

source: A classical autoencoder (CAE) is a type of neural network architecture that is commonly used to efficiently compress and encode information from the input using of representation learning. Following compression, one can then uncompress the data through the use of a decoder.
es_un: Un autocodificador clásico (classical autoencoder, CAE) es un tipo de arquitectura de red neuronal que se usa comúnmente para comprimir y codificar de manera eficiente la información de la entrada mediante el aprendizaje de representación. Después de la compresión, se pueden descomprimir los datos mediante el uso de un decodificador.
ja: 古典的オートエンコーダー (CAE) はニューラルネットワークの一種で、表現学習を利用して入力から情報を効率的に圧縮し、符号化するためによく使われるアーキテクチャーです。圧縮した後、デコーダーを使ってデータを復元することができます

source: Typical autoencoders are commonly divided into three layers, as seen in Figure 1.
es_un: Los autocodificadores típicos se dividen comúnmente en tres capas, como se ve en la Figura 1.
ja: 一般的なオートエンコーダーは、図 1に示すように 3 つの層に分けられています。

source: |qae_fig1_wide.png| Figure 1: Example of a Classical Autoencoder which includes the input, bottleneck and output layer.
es_un: |qae_fig1_wide.png| Figura 1: Ejemplo de un Autocodificador Clásico que incluye la capa de entrada, cuello de botella y salida.
ja: | qae_fig1_wide.png| 図 1:入力層、ボトルネック層、出力層を含む古典的なオートエンコーダーの例。

source: The first layer is called the Input Layer (1) and is the layer of which we input our data of length :math:`n`.
es_un: La primera capa se llama Capa de Entrada (1) y es la capa en la que ingresamos nuestros datos de longitud :math:`n`.
ja: 最初の層は入力層 (1)と呼ばれ、長さ :math:`n` のデータを入力する層です。

source: The input data then passes through an encoder and travels to the next layer, which has less nodes or is reduced in dimensions and is known as the Bottleneck Layer (2). The input layer is compressed through this process. Common CAEs may have several layers.
es_un: Luego, los datos de entrada pasan a través de un codificador y viajan a la siguiente capa, que tiene menos nodos o tiene dimensiones reducidas y se conoce como la capa de Cuello de Botella (2). La capa de entrada se comprime a través de este proceso. Los CAE comunes pueden tener varias capas.
ja: 入力データはエンコーダーを通過し、次の層に移動します。この層はノード数が少ないか、次元が小さく、ボトルネック層 (2) と呼ばれます。入力層は、このプロセスを通じて圧縮されます。一般的なCAEでは、いくつかの層を持つことがあります。

source: The final layer is called the Output Layer (3). Here the compressed data is reconstructed to its original size, :math:`n`, from the compressed data through the process of a decoder.
es_un: La capa final se llama Capa de Salida (3). Aquí, los datos comprimidos se reconstruyen a su tamaño original, :math:`n`, a partir de los datos comprimidos mediante el proceso de un decodificador.
ja: 最後の層は出力層 (3) と呼ばれます。ここでは、圧縮されたデータから、デコーダーの処理によって元のサイズである :math:`n` に復元されます。

source: By passing our input data through a CAE, we are therefore able to reduce the dimensionality of our input data, as seen in the bottleneck layer, while retaining as much information as possible from the input data. Because of this feature, common uses of CAE are Image Denoising, Anomaly Detection and Facial Recognition devices. For more information on classical autoencoders, see [1].
es_un: Al pasar nuestros datos de entrada a través de un CAE, podemos reducir la dimensionalidad de nuestros datos de entrada, como se ve en la capa de cuello de botella, mientras retenemos la mayor cantidad de información posible de los datos de entrada. Debido a esta característica, los usos comunes del CAE son dispositivos de eliminación de ruido de imagen, detección de anomalías y reconocimiento facial. Para obtener más información sobre los autocodificadores clásicos, consulta [1].
ja: このように、入力データをCAEに通すことで、入力データからできるだけ多くの情報を保持したまま、ボトルネック層に見られるように入力データの次元を小さくできるのです。この特徴から、CAEの一般的な用途としては、画像ノイズ除去、異常検出、顔認識装置などが挙げられます。古典的なオートエンコーダの詳細については、[1] を参照してください。

source: 2. The Quantum Autoencoder
es_un: 2. El Autocodificador Cuántico
ja: 2. 量子オートエンコーダー

source: We can also define a quantum counterpart to the CAE, the Quantum Autoencoder. Much like the CAE, the Quantum Autoencoder aims to reduce the dimensionality of the input of the neural network, in this case a quantum state. A pictorial representation of this can be seen in Figure 2.
es_un: También podemos definir una contraparte cuántica del CAE, el Autocodificador Cuántico (Quantum Autoencoder). Al igual que el CAE, el Autocodificador Cuántico tiene como objetivo reducir la dimensionalidad de la entrada de la red neuronal, en este caso un estado cuántico. Una representación pictórica de esto se puede ver en la Figura 2.
ja: CAEに対応する量子オートエンコーダーを定義することもできます。CAEと同様に、量子オートエンコーダーはニューラルネットワークの入力（この場合は量子状態）の次元を小さくすることを目的としています。図2にそのイメージを示します。

source: |qae_fig2_wide.png| Figure 2: Pictorial Representation of a Quantum Autoencoder. Here one can see the similarities with the CAE, with the circuit having an input state, bottleneck state and an output state.
es_un: |qae_fig2_wide.png| Figura 2: Representación pictórica de un Autocodificador Cuántico. Aquí se pueden ver las similitudes con el CAE, teniendo el circuito un estado de entrada, un estado de cuello de botella y un estado de salida.
ja: |qae_fig2_wide.png| 図2：量子オートエンコーダの図解。ここでは、回路が入力状態、ボトルネック状態、出力状態を持つという、CAEとの類似性を見ることができます。

source: Much like its classical counterpart, our circuit contains three layers. We first input our state :math:`|\psi>` (which contains :math:`n` qubits), of which we wish to compress. This is our input layer (1).
es_un: Al igual que su contraparte clásica, nuestro circuito contiene tres capas. Primero ingresamos nuestro estado :math:`|\psi>` (que contiene :math:`n` qubits), el cual deseamos comprimir. Esta es nuestra capa de entrada (1).
ja: 古典的なものと同じように、この回路は3つの層で構成されています。まず、圧縮したい状態 :math:`|psi>` (これは :math:`n` 個の量子ビットを含む) を入力します。これが入力層 (1) です。

source: We then apply our parametrized circuit on our input state, which will act as our encoder and 'compresses' our quantum state, reducing the dimensionality of our state to :math:`n-k` qubits. Our new compressed state is of the form :math:`|\psi_{comp}> \otimes |0>^{\otimes k}`, where :math:`|\psi_{comp}>` contains :math:`n-k` qubits.
es_un: Luego aplicamos nuestro circuito parametrizado en nuestro estado de entrada, que actuará como nuestro codificador y 'comprimirá' nuestro estado cuántico, reduciendo la dimensionalidad de nuestro estado a :math:`n-k` qubits. Nuestro nuevo estado comprimido tiene la forma :math:`|\psi_{comp}> \otimes |0>^{\otimes k}`, donde :math:`|\psi_{comp}>` contiene :math:`n-k` qubits.

source: This parametrized circuit will depend on a set of parameters, which will be the nodes of our Quantum Autoencoder. Throughout the training process, these parameters will be updated to optimize the loss function.
es_un: Este circuito parametrizado dependerá de un conjunto de parámetros, que serán los nodos de nuestro Autocodificador Cuántico. A lo largo del proceso de entrenamiento, estos parámetros se actualizarán para optimizar la función de pérdida.
ja: このパラメーター化された回路は、量子オートエンコーダーのノードとなるパラメーターのセットに依存します。学習プロセスを通じて、これらのパラメーターは損失関数を最適化するために更新されます。

source: We disregard the remaining :math:`k` qubits for the remainder of the circuit. This is our bottleneck layer (2) and our input state is now compressed.
es_un: Ignoramos los :math:`k` qubits restantes para el resto del circuito. Esta es nuestra capa de cuello de botella (2) y nuestro estado de entrada ahora está comprimido.
ja: 残りの :math:`k` 量子ビットは無視します。これがボトルネック層(2)であり、入力状態は圧縮された状態です。

source: The final layer consists of the addition of :math:`k` qubits (all in the state :math:`|0\rangle`) and applying another parametrized circuit between the compressed state and the new qubits. This parametrized circuit acts as our decoder and reconstructs the input state from the compressed state using the new qubits. After the decoder, we retain the original state as the state travels to the output layer (3).
es_un: La capa final consiste en la adición de :math:`k` qubits (todos en el estado :math:`|0\rangle`) y aplicar otro circuito parametrizado entre el estado comprimido y los nuevos qubits. Este circuito parametrizado actúa como nuestro decodificador y reconstruye el estado de entrada a partir del estado comprimido usando los nuevos qubits. Después del decodificador, retenemos el estado original a medida que el estado viaja a la capa de salida (3).
ja: 最後の層は :math:`k` 個の量子ビット (全て :math:`|0\rangle` 状態) を追加し、圧縮された状態と新しい量子ビットの間に別のパラメーター化された回路を適用します。このパラメーター化された回路はデコーダーとして機能し、新しい量子ビットを使って圧縮された状態から入力状態を再構成します。デコーダーの後、状態が出力層 (3) に移動する際に元の状態を保持します。

source: 3. Components of a Quantum Autoencoder
es_un: 3. Componentes de un Autocodificador Cuántico
ja: 3. 量子オートエンコーダーの構成要素

source: Before building our Quantum Autoencoder, we must note a few subtleties.
es_un: Antes de construir nuestro Autocodificador Cuántico, debemos tener en cuenta algunas sutilezas.
ja: 量子オートエンコーダーを構築する前に、いくつかの微妙な点について注意しなければなりません。

source: We first note that we cannot introduce or disregard qubits in the middle of a Quantum Circuit when implementing an autoencoder using Qiskit.
es_un: Primero notamos que no podemos introducir o descartar qubits en medio de un circuito cuántico cuando implementamos un autocodificador usando Qiskit.
ja: まず、Qiskitを使ってオートエンコーダーを実装するとき、量子回路の途中で量子ビットを導入したり無視したりできないことに注意します。

source: Because of this we must include our reference state as well as our auxiliary qubits (whose role will be described in later sections) at the beginning of the circuit.
es_un: Por eso, debemos incluir nuestro estado de referencia, así como nuestros qubits auxiliares (cuya función se describirá en secciones posteriores) al comienzo del circuito.
ja: このため、回路の最初に参照状態と補助量子ビット (その役割は後のセクションで説明します) を含めなければなりません。

source: Therefore our input state will consist of our input state, reference state and one auxiliary qubit, as well as a classical register to perform measurements (which will be described in the next section). A pictorial representation of this can be seen in Figure 3.
es_un: Por lo tanto, nuestra capa de entrada consistirá en nuestro estado de entrada, el estado de referencia y un qubit auxiliar, así como un registro clásico para realizar mediciones (que se describirá en la siguiente sección). Una representación pictórica de esto se puede ver en la Figura 3.
ja: したがって、入力状態は、入力状態、参照状態、1つの補助量子ビット、そして測定を行うための古典的なレジスター (次のセクションで説明します) で構成されることになります。これを絵で表したのが図3です。

source: |qae_fig3_wide.png| Figure 3: Pictorial Representation of input state of Quantum Autoencoder. Note that we must also include an auxiliary qubit, the reference state and classical register at the beginning of the circuit, even though they are not used until later in the circuit.
es_un: |qae_fig3_wide.png| Figura 3: Representación pictórica del estado de entrada de un Autocodificador Cuántico. Ten en cuenta que también debemos incluir un qubit auxiliar, el estado de referencia y el registro clásico al comienzo del circuito, aunque no se usan hasta más adelante en el circuito.
ja: |qae_fig3_wide.png| 図3：量子オートエンコーダーの入力状態の図解。補助量子ビット、参照状態、古典レジスターも、回路の後半まで使用されないにもかかわらず、回路の最初に含めなければならないことに注意してください。

source: 4. Choosing a Loss Function
es_un: 4. Elegir una Función de Pérdida
ja: 4. 損失関数の選択

source: We now define our cost function, which we will use to train our Quantum Autoencoder, to return the input state. There's a bit of math involved here, so skip this section if you're not interested!
es_un: Ahora definimos nuestra función de costo, que usaremos para entrenar nuestro Autocodificador Cuántico, para devolver el estado de entrada. Hay un poco de matemáticas involucradas aquí, ¡así que omite esta sección si no estás interesado!

source: We take the cost function as defined in [2], which tries to maximize the fidelity between the input and output state of our Quantum Autoencoder.
es_un: Tomamos la función de costo como se define en [2], que trata de maximizar la fidelidad entre el estado de entrada y salida de nuestro Autocodificador Cuántico.
ja: この関数は、量子オートエンコーダーの入力と出力の状態の間の忠実度を最大化しようとするもので、[2] で定義されているように、コスト関数を取ります。

source: We first define subsystems :math:`A` and :math:`B` to contain :math:`n` and :math:`k` qubits respectively, while :math:`B'` is the space which will contain our reference space. We call the subsystem :math:`A` our latent space, which will contain the compressed qubit state, and :math:`B` our trash space, which contain the qubits of which we disregard throughout compression.
es_un: Primero definimos los subsistemas :math:`A` y :math:`B` para contener :math:`n` y :math:`k` qubits respectivamente, mientras que :math:`B'` es el espacio que contendrá nuestro espacio de referencia. Llamamos al subsistema :math:`A` nuestro espacio latente, que contendrá el estado de qubit comprimido, y :math:`B` nuestro espacio basura, que contiene los qubits que ignoramos durante la compresión.
ja: まず、サブシステム :math:`A` と :math:`B` を定義し、それぞれ :math:`n` と :math:`k` の量子ビットを格納することにします。:math:`B'` は参照空間です。我々は、サブシステム :math:`A` を潜在空間と呼び、圧縮された量子ビットの状態を格納します。また、 :math:`B` をゴミ空間と呼び、圧縮時に無視された量子ビットを格納します。

source: Our input state therefore :math:`|\psi_{AB}>` contains :math:`n + k` qubits. We define the reference space :math:`B'` which contains the reference state :math:`|a>_{B'}`. This space will contain the additional :math:`k` qubits we use in the decoder. All of these subsystems can be seen in Figure 3.
es_un: Por lo tanto, nuestro estado de entrada :math:`|\psi_{AB}>` contiene :math:`n + k` qubits. Definimos el espacio de referencia :math:`B'` que contiene el estado de referencia :math:`|a>_{B'}`. Este espacio contendrá los :math:`k` qubits adicionales que usamos en el decodificador. Todos estos subsistemas se pueden ver en la Figura 3.
ja: したがって、入力状態 :math:`|psi_{AB}>` は :math:`n + k` 個の量子ビットを含んでいます。参照状態 :math:`|a>_{B'}` を含む参照空間 :math:`B'` を定義します。この空間には、デコーダーで使用する追加の :math:`k` 量子ビットが含まれます。これらの全てのサブシステムを図3に示します。

source: We define the parameterized circuit as :math:`U(\theta)` which we will use as our encoder. However the structure and parameters of our parametrized circuit is currently unknown to us and may vary for different input states. To determine the parameters to compress our input state, we must train our device to maximally compress the state by adjusting the values of the parameters :math:`\theta`. For the decoder we will use :math:`U^{\dagger}(\theta)`.
es_un: Definimos el circuito parametrizado como :math:`U(\theta)` que usaremos como nuestro codificador. Sin embargo, la estructura y los parámetros de nuestro circuito parametrizado son actualmente desconocidos para nosotros y pueden variar para diferentes estados de entrada. Para determinar los parámetros para comprimir nuestro estado de entrada, debemos entrenar nuestro dispositivo para comprimir al máximo el estado ajustando los valores de los parámetros :math:`\theta`. Para el decodificador usaremos :math:`U^{\dagger}(\theta)`.
ja: パラメーター化された回路を :math:`U(\theta)` と定義し、これをエンコーダーとして使用することにします。しかし、パラメーター化された回路の構造やパラメーターは今のところ不明であり、異なる入力状態に対して変化する可能性があります。入力状態を圧縮するためのパラメーターを決定するために、パラメーター :math:`\theta` の値を調整することによって、状態を最大限に圧縮するようにデバイスを訓練する必要があります。デコーダーには :math:`U^{\dagger}(\theta)` を使用します。

source: Our goal therefore is to maximize the fidelity between the input and output states, i.e.
es_un: Por lo tanto, nuestro objetivo es maximizar la fidelidad entre los estados de entrada y salida, es decir,
ja: したがって、我々の目標は、入力と出力の状態の間の忠実度を最大化すること、つまり、以下を最大化します。

source: where
es_un: donde
ja: ここで

source: We can maximize this fidelity by tuning the parameters :math:`\theta` in our parametrized circuit. However, this fidelity can at times be complicated to determine and may require a large amount of gates needed to calculate the fidelity between two states, i.e. the larger the number of qubits, the more gates required which results to deeper circuits. Therefore we look for alternative means of comparing the input and output states.
es_un: Podemos maximizar esta fidelidad ajustando los parámetros :math:`\theta` en nuestro circuito parametrizado. Sin embargo, esta fidelidad a veces puede ser complicada de determinar y puede requerir una gran cantidad de compuertas necesarias para calcular la fidelidad entre dos estados, es decir, cuanto mayor es el número de qubits, más compuertas se requieren, lo que da como resultado circuitos más profundos. Por lo tanto, buscamos medios alternativos para comparar los estados de entrada y salida.

source: As shown in [2] a simpler way of determining an optimally compressed state is to perform a swap gate between the trash state and reference state. These states usually have a smaller number of qubits and are therefore easier to compare, due to the smaller amount of gates required. As shown in [2] maximizing the fidelity of such these two states is equivalent to maximizing the fidelity of the input and output state and thus determining an optimal compression of our input circuit.
es_un: Como se muestra en [2], una forma más sencilla de determinar un estado comprimido de manera óptima es realizar una compuerta de intercambio entre el estado basura y el estado de referencia. Estos estados suelen tener una menor cantidad de qubits y, por lo tanto, son más fáciles de comparar debido a la menor cantidad de compuertas requeridas. Como se muestra en [2], maximizar la fidelidad de estos dos estados es equivalente a maximizar la fidelidad del estado de entrada y salida y, en consecuencia, determinar una compresión óptima de nuestro circuito de entrada.
ja: [2] で示したように、最適な圧縮状態を決定するより簡単な方法は、ゴミ状態と参照状態との間でスワップゲートを実行することです。これらの状態は通常、より少ない数の量子ビットを持ち、したがって、必要なゲートの量が少ないため、比較しやすくなっています。[2] で示したように、これら2つの状態の忠実度を最大化することは、入力と出力の状態の忠実度を最大化することと等しく、したがって、入力回路の最適な圧縮を決定できるのです。

source: Keeping our reference state fixed, our cost function will now be a function of the trash state and is denoted as;
es_un: Manteniendo fijo nuestro estado de referencia, nuestra función de costo ahora será una función del estado basura y se denota como;
ja: 参照状態を固定すると、コスト関数はゴミ状態の関数となり、次のように示されます。

source: Throughout the training process, we adjust the parameters :math:`\theta` in our encoder and perform a swap test (as described below) to determine the fidelity between these trash and reference states. In doing so, we must include an additional qubit, our auxiliary qubit, which will be used throughout the swap test and measured to determine the overall fidelity of the trash and reference states. This is the reason why we included both an auxiliary qubit and classical register in the previous section when initializing our circuit.
es_un: A lo largo del proceso de entrenamiento, ajustamos los parámetros :math:`\theta` en nuestro codificador y realizamos una prueba swap o de intercambio (como se describe a continuación) para determinar la fidelidad entre estos estados basura y de referencia. Al hacerlo, debemos incluir un qubit adicional, nuestro qubit auxiliar, que se usará a lo largo de la prueba swap y se medirá para determinar la fidelidad general de los estados basura y de referencia. Esta es la razón por la que incluimos un qubit auxiliar y un registro clásico en la sección anterior al inicializar nuestro circuito.
ja: 学習プロセスを通して、エンコーダーのパラメーター :math:`\theta` を調整し、スワップテスト (後述) を行い、ゴミ状態と参照状態の間の忠実度を決定します。その際、補助量子ビットを追加する必要があります。この量子ビットはスワップテストの間中使用され、ゴミ状態と参照状態の全体的な忠実度を決定するために測定されます。これが、前節で回路の初期化時に補助量子ビットと古典レジスターの両方を含めた理由です。

source: The SWAP Test
es_un: La Prueba SWAP
ja: SWAP テスト

source: The SWAP Test is a procedure commonly used to compare two states by applying CNOT gates to each qubit (for further information see [3]). By running the circuit :math:`M` times, and applying the SWAP test, we then measure the auxiliary qubit. We use the number of states in the state :math:`|1\rangle` to compute:
es_un: La Prueba SWAP (prueba de intercambio) es un procedimiento comúnmente utilizado para comparar dos estados mediante la aplicación de compuertas CNOT a cada qubit (para obtener más información, consulta [3]). Al ejecutar el circuito :math:`M` veces y aplicar la prueba SWAP, medimos el qubit auxiliar. Usamos el número de estados en el estado :math:`|1\rangle` a calcular:
ja: SWAPテストとは、各量子ビットに対してCNOTゲートを適用し、2つの状態を比較するためによく使われる手順です (詳しくは[3]を参照してください)。回路を :math:`M` 回走らせ、SWAPテストを適用し、次に補助量子ビットを測定します。このとき、状態 :math:`|1\rangle` である状態の数を使って計算します:

source: where :math:`L` is the count for the states in the :math:`|1\rangle` state. As shown in [3], maximizing this function corresponds to the two states of which we are comparing being identical. We therefore aim to maximize this function, i.e. minimize :math:`\frac{2}{M}L`. This value will be therefore be our cost function.
es_un: donde :math:`L` es el recuento de los estados en el estado :math:`|1\rangle`. Como se muestra en [3], maximizar esta función corresponde a que los dos estados que estamos comparando sean idénticos. Por lo tanto, nuestro objetivo es maximizar esta función, es decir, minimizar :math:`\frac{2}{M}L`. Este valor será en consecuencia nuestra función de costo.
