Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/12_quantum_autoencoder.po
Languages: es_un, ja

source: Quantum Autoencoder's can be used for various different applications, including
es_un: El Autocodificador Cuántico se puede usar para varias aplicaciones diferentes, que incluyen

source: Digital Compression: where information can be encoded into a smaller amount of qubits. This can be hugely beneficial for near term quantum devices, as smaller systems of qubits are less prone to noise.
es_un: Compresión digital: donde la información se puede codificar en una cantidad menor de qubits. Esto puede ser muy beneficioso para los dispositivos cuánticos de término cercano, ya que los sistemas de qubits más pequeños son menos propensos al ruido.
ja: デジタル圧縮: 情報をより少ない量の量子ビットにエンコードすることができます。これは、より小さな量子ビットのシステムは、ノイズの影響を受けにくいので、近い将来の量子デバイスに非常に有益です。

source: Denoising: where one can use Quantum Autoencoder to extract relevant features from the initial quantum state or encoded data, while neglecting any additional noise.
es_un: Eliminación de ruido: donde se puede usar Autocodificación Cuántica para extraer características relevantes del estado cuántico inicial o datos codificados, mientras se ignora cualquier ruido adicional.
ja: ノイズ除去: 量子オートエンコーダーを使って、初期量子状態や符号化されたデータから関連する特徴を抽出し、追加されているノイズを無視することができます。

source: Quantum Chemistry: in which a Quantum Autoencoder can be used as an ansatz for systems, such as the Hubbard Model. This is commonly used to describe electron-electron interactions in molecules.
es_un: Química Cuántica: en la que se puede utilizar un Autocodificador Cuántico como ansatz para sistemas, como el Modelo Hubbard. Esto se usa comúnmente para describir las interacciones electrón-electrón en las moléculas.
ja: 量子化学: 量子オートエンコーダーは、ハバードモデルのようなシステムのAnsatzとして使用することができます。これは、分子内の電子-電子相互作用を記述するために一般的に使用されます。

source: 9. References
es_un: 9. Referencias
ja: 9. 参考文献

source: A wikipedia page on Autoencoder: https://en.wikipedia.org/wiki/Autoencoder
es_un: Una página de wikipedia sobre el Autocodificador: https://en.wikipedia.org/wiki/Autoencoder

source: Swap Test Algorithm: https://en.wikipedia.org/wiki/Swap_test
es_un: Algoritmo de la Prueba de Swap: https://en.wikipedia.org/wiki/Swap_test

source: We then apply our parametrized circuit on our input state, which will act as our encoder and ‘compresses’ our quantum state, reducing the dimensionality of our state to :math:`n-k` qubits. Our new compressed state is of the form :math:`|\psi_{comp}> \otimes |0>^{\otimes k}`, where :math:`|\psi_{comp}>` contains :math:`n-k` qubits.
ja: この回路はエンコーダーとして働き、量子状態を「圧縮」し、量子ビットの次元を :math:`n-k` まで減少させます。圧縮された新しい状態は :math:`|psi_{comp}> \otimes |0>^{\otimes k}` という形式で、ここで :math:`|psi_{comp}>` は :math:`n-k` 個の量子ビットを含みます。

source: We now define our cost function, which we will use to train our Quantum Autoencoder, to return the input state. There’s a bit of math involved here, so skip this section if you’re not interested!
ja: 量子オートエンコーダーの訓練に使用する、入力状態を返すためのコスト関数を定義します。ここで少し数学が絡んでくるので、興味のない方はこのセクションを飛ばしてください。

source: We can maximize this fidelity by tuning the parameters :math:`\theta` in our parametrized circuit. However, this fidelity can at times be complicated to determine and may require a large amount of gates needed to calculate the fidelity between two states, i.e. the larger the number of qubits, the more gates required which results to deeper circuits. Therefore we look for alternative means of comparing the input and output states.
ja: この忠実度は、パラメーター化された回路のパラメーター :math:`\theta` を調整することで最大化することができます。しかし、この忠実度を決定するのは複雑で、2つの状態の忠実度を計算するために大量のゲートを必要とすることがあります。つまり、量子ビットの数が大きくなればなるほど、より多くのゲートが必要となり、結果として回路が深くなってしまいます。そこで私たちは、入力と出力の状態を比較する別の方法を探します。

source: where :math:`L` is the count for the states in the :math:`|1\rangle` state. As shown in [3], maximizing this function corresponds to the two states of which we are comparing being identical. We therefore aim to maximize this function, i.e. minimize :math:`\frac{2}{M}L`. This value will be therefore be our cost function.
ja: ここで、 :math:`L` は :math:`|1\rangle` 状態の数です。[3]で示したように、この関数を最大化することは、比較する2つの状態が同一であることに対応します。したがって、この関数を最大化すること、すなわち :math:`\frac{2}{M}L` を最小化することを目指します。したがって、この値が我々のコスト関数となります。

source: First, we implement IBM’s Qiskit to build our Quantum Autoencoder. We first begin by importing in the necessary libraries and fixing the seed.
ja: まず、IBMのQiskitを実装して、量子オートエンコーダーを構築します。まず、必要なライブラリーをインポートし、シードを指定するところから始めます。

source: Let’s draw this ansatz with :math:`5` qubits and see what it looks like.
ja: このansatzを :math:`5` 量子ビットで描いて見ましょう。

source: Let’s first begin with a simple example, a state known as the Domain Wall, which for :math:`5` qubits is given by :math:`|00111\rangle`. Here we will try and compress this state from :math:`5` qubits to :math:`3` qubits, with the remaining qubits in the trash space, in the state :math:`|00\rangle`. We can create a function to build the domain wall state below.
ja: まず、簡単な例から始めましょう。ドメインウォールとして知られる状態は、 :math:`5` 量子ビットに対して :math:`|00111\rangle` によって与えられます。ここで、この状態を :math:`5` 量子ビットから :math:`3` 量子ビットに圧縮しようと試み、残りの量子ビットはゴミ状態 :math:`|00\rangle` に入れましょう。 以下のドメインウォール状態を構築する関数を作成できます。

source: Now let’s train our Autoencoder to compress this state from 5 qubits to 3 qubits (qubits 0,1 and 2), with the remaining qubits in the trash space (qubits 3 and 4) being in the \|00> state.
ja: さて、この状態を5量子ビットから3量子ビット (量子ビット0、1、2) に圧縮し、ゴミ空間の残りの量子ビット (量子ビット3、4) は \|00> 状態になるようにオートエンコーダーを学習させましょう。

source: Looks like it has converged! After training our Quantum Autoencoder, let’s build it and see how well it compresses the state!
ja: どうやら収束したようです! 量子オートエンコーダーを学習させた後、それを構築し、状態をどれだけ圧縮できるかを見てみましょう。

source: Let’s first apply our circuit to the Domain Wall State, using the parameters we obtained when training our Quantum Autoencoder. (Note we have included barriers in our circuit below, however these are not necessary for the implementation of the Quantum Autoencoder and are used to determine between different sections of our circuit).
ja: まず、量子オートエンコーダのトレーニングで得たパラメータを用いて、ドメインウォールの状態に我々の回路を適用してみましょう (この回路にはバリアーが含まれていますが、これは量子オートエンコーダーの実装には必要なく、回路の異なるセクションの間を決定するために使用されます) 。

source: Now let’s get the statevectors of our Domain Wall state and output circuit and calculate the fidelity!
ja: それでは、ドメインウォール状態と出力回路の状態ベクトルを取得し、忠実度を計算してみましょう！

source: Each image contains :math:`32` pixels of which can be encoded into :math:`5` qubits by Amplitude Encoding. This can be done using Qiskit’s ``RawFeatureVector`` feature map.
ja: 各画像は :math:`32` ピクセルを含み、振幅エンコーディングによって :math:`5` 個の量子ビットにエンコードされます。これはQiskitの ``RawFeatureVector`` 特徴量マップを使用して行うことができます。

source: Let’s input one of our digits and see our circuit for the Autoencoder below.
ja: 1桁の数字を入力し、オートエンコーダーの回路を以下に示します。

source: We build our cost function, based on the swap test between the reference and trash space for the digit dataset. To do this, we again use Qiskit’s CircuitQNN network and use the same interpret function as we are measuring the probability of getting the final qubit in the :math:`|1\rangle` state.
ja: 我々は、数字データセットの参照空間とゴミ空間の間のスワップテストに基づいて、コスト関数を構築します。これを行うには、再びQiskitのCircuitQNNネットワークを使用し、最終的な量子ビットが :math:`|1\rangle` 状態になる確率を測定しているのと同じ解釈関数を使用します。

source: Since model training may take a long time we have already pre-trained the model for some iterations and saved the pre-trained weights. We’ll continue training from that point by setting ``initial_point`` to a vector of pre-trained weights.
ja: モデルの学習には長い時間がかかる可能性があるため、すでにいくつかの反復でモデルを事前学習し、事前学習済みの重みを保存しています。 ``initial_point`` に学習済みの重みのベクトルを設定することで、その時点から学習を継続することにします。

source: By minimizing this cost function, we can thus determine the required parameters to compress our noisy images. Let’s see if we can encode our images!
ja: このコスト関数を最小化することで、ノイズの多い画像を圧縮するために必要なパラメーターを決定できるのです。それでは、画像をエンコードしてみましょう。

source: Now let’s build our Encoder and Decoder using the parameters obtained from the training period. After applying this circuit to our new dataset, we can then compare our input and output data and see if we were able to retain the images efficiently throughout the compression!
ja: では、学習期間中に得られたパラメーターを使って、エンコーダーとデコーダーを構築してみましょう。この回路を新しいデータセットに適用した後、入力データと出力データを比較し、圧縮の間、画像を効率的に保持できたかどうかを確認します!

source: It looks like our Quantum Autoencoder can be trained to encode digits as well! Now it’s your turn to build your own Quantum Autoencoder and come up with ideas and datasets to compress!
ja: この量子オートエンコーダーは、数字のエンコードもできるようです。さあ、次はあなたが量子オートエンコーダーを作り、圧縮するためのアイデアやデータセットを考える番です。

source: Quantum Autoencoder’s can be used for various different applications, including
ja: 量子オートエンコーダは、以下のような様々な用途に使用することができます。
