Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/tutorials/12_quantum_autoencoder.po
Languages: es_un, ja

source: 5. Building the Quantum Autoencoder Ansatz
es_un: 5. Construir el Ansatz del Autocodificador Cuántico
ja: 5. 量子オートエンコーダーAnsatz の構築

source: First, we implement IBM's Qiskit to build our Quantum Autoencoder. We first begin by importing in the necessary libraries and fixing the seed.
es_un: Primero, importamos Qiskit de IBM para construir nuestro Autocodificador Cuántico. Primero comenzamos importando las bibliotecas necesarias y fijando la semilla.

source: We begin by defining our parametrized ansatz for the Quantum Autoencoder. This will be our parametrized circuit where we can tune the parameters to maximize the fidelity between the trash and reference states.
es_un: Comenzamos definiendo nuestro ansatz parametrizado para el Autocodificador Cuántico. Este será nuestro circuito parametrizado donde podemos ajustar los parámetros para maximizar la fidelidad entre los estados basura y de referencia.
ja: まず、量子オートエンコーダーのためのパラメーター化されたansatzを定義することから始めます。この回路はパラメーターを調整することで、ゴミ状態と参照状態の間の忠実度を最大にできる、パラメーター化された回路となります。

source: The Parametrized Circuit
es_un: El Circuito Parametrizado
ja: パラメーター化された回路

source: The parametrized circuit we will use below for our encoder is the RealAmplitude Ansatz available in Qiskit. One of the reasons why we have chosen this ansatz is because it is a 2-local circuit, the prepared quantum states will only have real amplitudes, and does not rely on full connectivity between each qubits, which is hard to implement or can lead to deep circuits.
es_un: El circuito parametrizado que usaremos a continuación para nuestro codificador es el Ansatz RealAmplitude disponible en Qiskit. Una de las razones por las que hemos elegido este ansatz es porque es un circuito 2-local, los estados cuánticos preparados solo tendrán amplitudes reales y no dependen de la conectividad completa entre cada qubit, lo cual es difícil de implementar o puede conducir a circuitos profundos.
ja: 私たちのエンコーダーに使用するパラメーター化された回路は、Qiskitで利用可能なRealAmplitude Ansatzです。この回路を選んだ理由の1つは、2ローカル回路であり、準備された量子状態は実振幅のみを持ち、実装が困難で深い回路になってしまう各量子ビット間の完全な接続性に依存しないからです。

source: We define our parametrized circuit for our Encoder below, where we set the repetition parameter to ``reps=5``, to increase the number of parameters in our circuit allowing greater flexibility.
es_un: Definimos nuestro circuito parametrizado para nuestro codificador a continuación, donde configuramos el parámetro de repetición en ``reps=5``, para aumentar la cantidad de parámetros en nuestro circuito y permitir una mayor flexibilidad.
ja: この回路では、繰り返しパラメーターを ``reps=5`` とし、パラメーター数を増やすことでより柔軟な回路を実現しています。

source: Let's draw this ansatz with :math:`5` qubits and see what it looks like.
es_un: Dibujemos este ansatz con :math:`5` qubits y veamos cómo se ve.

source: We now apply this Encoder to the state we wish to compress. In this example, we divide our initial :math:`5` qubit state into a :math:`3` qubit latent state (:math:`n = 3`) and :math:`2` qubit trash space (:math:`k = 2`).
es_un: Ahora aplicamos este Codificador al estado que deseamos comprimir. En este ejemplo, dividimos nuestro estado inicial de :math:`5` qubits en un estado latente de :math:`3` qubits (:math:`n = 3`) y un espacio basura de :math:`2` qubits (:math:`k = 2`).
ja: 次に、このエンコーダーを圧縮したい状態に適用します。この例では、最初の :math:`5` 個の量子ビットの状態を :math:`3` 個の量子ビット潜在状態 (:math:`n = 3`) と :math:`2` 個の量子ビットゴミ空間 (:math:`k = 2`) に分割しています。

source: As explained in the previous section, we must also include a :math:`2` qubit reference space in our circuit, as well as an auxiliary qubit to perform the swap test between the reference and trash states. We will therefore have a total of :math:`2 + 3 + 2 + 1 = 8` qubits and :math:`1` classical register in our circuit.
es_un: Como se explicó en la sección anterior, también debemos incluir un espacio de referencia de :math:`2` qubits en nuestro circuito, así como un qubit auxiliar para realizar la prueba swap entre los estados de referencia y basura. Por lo tanto, tendremos un total de :math:`2 + 3 + 2 + 1 = 8` qubits y :math:`1` registro clásico en nuestro circuito.
ja: 前のセクションで説明したように、私たちの回路には :math:`2` 量子ビットの参照空間と、参照状態とゴミ状態の間でスワップテストを行うための補助量子ビットも含める必要があります。したがって、私たちの回路には合計で :math:`2 + 3 + 2 + 1 = 8` 個の量子ビットと :math:`1` 個の古典レジスターが含まれることになります。

source: After initializing our state, we apply our parametrized circuit.
es_un: Después de inicializar nuestro estado, aplicamos nuestro circuito parametrizado.
ja: 状態を初期化した後、パラメーター化された回路を適用します。

source: Following this, we then split our initial state into the latent space (the compressed state) and trash space (the part of the state we will disregard) and perform the swap test between the reference state and the trash space. The last qubit is then measured to determine the fidelity between the reference and trash states. A pictorial representation of this is given below in Figure 4.
es_un: Después de esto, dividimos nuestro estado inicial en el espacio latente (el estado comprimido) y el espacio basura (la parte del estado que descartaremos) y realizamos la prueba swap entre el estado de referencia y el espacio basura. Luego se mide el último qubit para determinar la fidelidad entre los estados de referencia y basura. Una representación pictórica de esto se da a continuación en la Figura 4.
ja: 続いて、初期状態を潜在空間 (圧縮された状態) とゴミ空間 (無視する部分) に分割し、参照状態とゴミ空間とのスワップテストを行います。そして、最後の量子ビットを測定して、参照状態とゴミ状態の間の忠実度を決定します。これを絵で表したのが、以下の図4です。

source: Figure 4: Example of a Quantum Autoencoder in the training process. We use the swap test to determine the fidelity between the trash and reference space.
es_un: Figura 4: Ejemplo de un Autocodificador Cuántico en proceso de entrenamiento. Usamos la prueba swap para determinar la fidelidad entre los espacios basura y de referencia.
ja: 図4：学習過程における量子オートエンコーダーの例。ゴミ空間と参照空間の間の忠実度を判断するためにスワップテストを用います。

source: We define a function below to implement the above circuit configuration to the :math:`5` qubit domain wall state :math:`|00111\rangle` and plot an example below. Here qubits :math:`5` and :math:`6` are the reference state, :math:`0, 1, 2, 3, 4` are the initial state we wish to compress and qubit :math:`7` is our auxiliary qubit which is used in the swap test. We also include a classical register to measure the results of qubit :math:`7` in the swap test.
es_un: Definimos una función a continuación para implementar la configuración del circuito anterior en el estado de pared de dominio :math:`|00111\rangle` de :math:`5` qubits y graficar un ejemplo a continuación. Aquí los qubits :math:`5` y :math:`6` son el estado de referencia, :math:`0, 1, 2, 3, 4` son el estado inicial que deseamos comprimir y el qubit :math:`7` es nuestro qubit auxiliar que se usa en la prueba swap. También incluimos un registro clásico para medir los resultados del qubit :math:`7` en la prueba swap.
ja: ここでは、 :math:`5` 量子ビットのドメインウォール状態 :math:`|00111\rangle` に対して上記の回路を実装するための関数を定義し、その例を以下に示します。ここで、量子ビット :math:`5` と :math:`6` は参照状態、 :math:`0, 1, 2, 3, 4` は圧縮したい初期状態、量子ビット :math:`7` はスワップテストに使用する補助的な量子ビットです。また、スワップテストにおける量子ビット :math:`7` の結果を測定するための古典的なレジスターも含まれています。

source: In order to reconstruct the original input state, we must apply the adjoint of our parametrized circuit after the swap test. However, during training, we are only interested in the trash state and the reference state. We can therefore exclude the gates following compression until we wish to reconstruct our initial input.
es_un: Para reconstruir el estado de entrada original, debemos aplicar el adjunto de nuestro circuito parametrizado después de la prueba swap. Sin embargo, durante el entrenamiento, solo nos interesa el estado basura y el estado de referencia. Por lo tanto, podemos excluir las compuertas que siguen a la compresión hasta que deseemos reconstruir nuestra entrada inicial.
ja: 元の入力状態を復元するためには、スワップテスト後にパラメーター化された回路の随伴行列を適用する必要があります。しかし、学習中はゴミ状態と参照状態にしか興味がありません。したがって、最初の入力を再構成したいときまで、圧縮後のゲートを除外することができます。

source: After building our Quantum Autoencoder, the next step is to train our Quantum Autoencoder to compress the state and maximize the cost function and determine the parameters :math:`\theta`.
es_un: Después de construir nuestro Autocodificador Cuántico, el siguiente paso es entrenarlo para comprimir el estado y maximizar la función de costo y determinar los parámetros :math:`\theta`.
ja: 量子オートエンコーダーを構築したら、次は量子オートエンコーダーを訓練して状態を圧縮し、コスト関数を最大化し、パラメータ :math:`\theta` を決定する必要があります。

source: 6. A Simple Example: The Domain Wall Autoencoder
es_un: 6. Un Ejemplo Simple: El Autocodificador de la Pared de Dominio
ja: 6. 簡単な例：ドメインウォール・オートエンコーダー

source: Let's first begin with a simple example, a state known as the Domain Wall, which for :math:`5` qubits is given by :math:`|00111\rangle`. Here we will try and compress this state from :math:`5` qubits to :math:`3` qubits, with the remaining qubits in the trash space, in the state :math:`|00\rangle`. We can create a function to build the domain wall state below.
es_un: Comencemos primero con un ejemplo simple, un estado conocido como Pared de Dominio (Domain Wall), que para :math:`5` qubits viene dado por :math:`|00111\rangle`. Aquí intentaremos comprimir este estado de :math:`5` qubits a :math:`3` qubits, con los qubits restantes en el espacio basura, en el estado :math:`|00\rangle`. Podemos crear una función para construir el estado de la pared de dominio a continuación.

source: Now let's train our Autoencoder to compress this state from 5 qubits to 3 qubits (qubits 0,1 and 2), with the remaining qubits in the trash space (qubits 3 and 4) being in the \|00> state.
es_un: Ahora entrenemos nuestro Autocodificador para comprimir este estado de 5 qubits a 3 qubits (qubits 0,1 y 2), con los qubits restantes en el espacio basura (qubits 3 y 4) en el estado \|00>.

source: We create a circuit to be used in the loss function, as described in Section 4, which determines the fidelity between the two states below using the swap test for our particular AutoEncoder function. For further information on the swap test, see [1].
es_un: Creamos un circuito para usar en la función de pérdida, como se describe en la Sección 4, que determina la fidelidad entre los dos estados a continuación usando la prueba swap para nuestra función particular de Autocodificador. Para obtener más información sobre la prueba swap, consulta [1].
ja: 我々は、セクション4で説明するように、損失関数で使用する回路を作成し、我々の特定のAutoEncoder関数に対するスワップテストを使用して、以下の2つの状態間の忠実度を決定します。スワップテストの詳細については、[1] を参照してください。

source: Then, we create a quantum neural network and pass the circuit as a parameter. We note that this network must take an interpret function, which determines how we map the output of the network to the output shape. Since we measure only one qubit, the output of the network is a bit string either :math:`0` or :math:`1`, so the output shape is :math:`2`, the number of possible outcomes. Then, we introduce an identity mapping. The output of the network is a vector of probabilities of getting interpret-mapped bit strings. Thus, we get probabilities of getting :math:`0` or :math:`1` and this is exactly what we are looking for. In the cost function we make use of the probability of getting :math:`1` and penalize the outcomes that lead to :math:`1`, therefore maximizing the fidelity between the trash space and the reference space.
es_un: Luego, creamos una red neuronal cuántica y pasamos el circuito como parámetro. Notamos que esta red debe tomar una función de interpretación, que determina cómo mapeamos la salida de la red a la forma de salida. Dado que medimos solo un qubit, la salida de la red es una cadena de bits, ya sea :math:`0` o :math:`1`, por lo que la forma de salida es :math:`2`, el número de resultados posibles. Luego, introducimos un mapeo de identidad. La salida de la red es un vector de probabilidades de obtener cadenas de bits interpretadas. Por lo tanto, obtenemos las probabilidades de obtener :math:`0` o :math:`1` y esto es exactamente lo que estamos buscando. En la función de costo hacemos uso de la probabilidad de obtener :math:`1` y penalizamos los resultados que llevan a :math:`1`, maximizando así la fidelidad entre el espacio basura y el espacio de referencia.
ja: 次に、量子ニューラルネットワークを作成し、その回路をパラメーターとして渡します。このネットワークは、ネットワークの出力をどのように出力形状にマッピングするかを決定する、解釈関数を受け取らなければならないことに注意してください。量子ビットは1つだけなので、ネットワークの出力は :math:`0` か :math:`1` のビット列となり、出力形状は :math:`2` となります (これは可能な結果の数です)。次に、恒等写像を導入します。ネットワークの出力は、解釈マッピングされたビット文字列を得る確率のベクトルです。つまり、 :math:`0` や :math:`1` を得る確率が得られ、これはまさに我々が求めているものです。コスト関数では、:math:`1` を得る確率を利用し、 :math:`1` につながる結果にペナルティを与えることで、ゴミ空間と参照空間の間の忠実度を最大化します。

source: Next we create our cost function. As described in the previous section, our aim is to minimize :math:`\frac{2}{M}L`, which is the twice the probability of getting the final qubit in the :math:`|1\rangle` state. We therefore wish to minimize the of getting a :math:`|1\rangle` on qubit 7.
es_un: A continuación, creamos nuestra función de costo. Como se describe en la sección anterior, nuestro objetivo es minimizar :math:`\frac{2}{M}L`, que es el doble de probabilidad de obtener el qubit final en el estado :math:`|1\rangle`. Por lo tanto, deseamos minimizar la posibilidad de obtener un :math:`|1\rangle` en el qubit 7.
ja: 次に、コスト関数を作成します。前のセクションで説明したように、我々の目的は:math:`\frac{2}{M}L` を最小化することで、これは最終的に量子ビットが :math:`|1\rangle` 状態となる確率の2倍です。したがって、量子ビット7で :math:`|1\rangle` を得る確率を最小にしたいのです。

source: The cost function will also plot out the objective value at each cost function evaluation.
es_un: La función de costo también graficará el valor objetivo en cada evaluación de la función de costo.
ja: また、コスト関数は、各コスト関数評価時の目的値をプロットすることになります。

source: Now we will train our Autoencoder to reduce the dimension of the Hilbert space from :math:`5` qubits to :math:`3`, while leaving the trash space in the state :math:`|00\rangle`. We initially set the parameters :math:`\theta` to random values and tune these parameters to minimize our cost function through the use of the COBYLA optimizer.
es_un: Ahora entrenaremos nuestro Autocodificador para reducir la dimensión del espacio de Hilbert de :math:`5` qubits a :math:`3`, dejando el espacio basura en el estado :math:`|00\rangle`. Inicialmente, establecemos los parámetros :math:`\theta` en valores aleatorios y ajustamos estos parámetros para minimizar nuestra función de costo mediante el uso del optimizador COBYLA.
ja: ここでは、Hilbert空間の次元を :math:`5` 量子ビットから :math:`3` に減らし、ゴミ空間は :math:`|00\rangle` の状態のままにして、オートエンコーダーを学習させます。パラメーター :math:`\theta` をランダムな値に初期設定し、COBYLAオプティマイザーを使用してコスト関数を最小化するようにこれらのパラメーターをチューニングします。

source: Looks like it has converged! After training our Quantum Autoencoder, let's build it and see how well it compresses the state!
es_un: ¡Parece que ha convergido! Después de entrenar nuestro Autocodificador Cuántico, ¡construyámoslo y veamos qué tan bien comprime el estado!

source: To do this, we first apply our Autoencoder to a :math:`5` qubit Domain Wall state. After applying this state, the compressed state should be of the form :math:`|00\rangle`. Therefore resetting the last two qubits should not effect our over all state.
es_un: Para hacer esto, primero aplicamos nuestro autocodificador a un estado de pared de dominio de :math:`5` qubits. Después de aplicar este estado, el estado comprimido debe tener la forma :math:`|00\rangle`. Por lo tanto, restablecer los dos últimos qubits no debería afectar a nuestro estado general.
ja: これを行うには、まずオートエンコーダーを :math:`5` 量子ビット・ドメインウォール状態に適用します。この状態を適用した後、圧縮された状態は :math:`|00\rangle` のような形になるはずです。したがって、最後の2つの量子ビットをリセットしても、全体的な状態に影響を与えることはありません。

source: After resetting we apply our decoder (the hermitian conjugate of our encoder) and compare it to the initial state by determining the fidelity. If our fidelity is one, then our Autoencoder has encoded all the information of the domain wall efficiently into a smaller set of qubits and when decoding, we retain the original state!
es_un: Después de restablecer, aplicamos nuestro decodificador (el conjugado hermitiano de nuestro codificador) y lo comparamos con el estado inicial determinando la fidelidad. Si nuestra fidelidad es uno, entonces nuestro Autocodificador ha codificado toda la información de la pared de dominio de manera eficiente en un conjunto más pequeño de qubits y al decodificar, ¡retenemos el estado original!
ja: リセット後、デコーダー (エンコーダーのエルミート共役) を適用し、忠実度を決定することによって初期状態と比較します。忠実度が1であれば、オートエンコーダーはドメインウォールのすべての情報をより小さな量子ビットの集合に効率的にエンコードしたことになり、デコード時には元の状態を保持することになります！

source: Let's first apply our circuit to the Domain Wall State, using the parameters we obtained when training our Quantum Autoencoder. (Note we have included barriers in our circuit below, however these are not necessary for the implementation of the Quantum Autoencoder and are used to determine between different sections of our circuit).
es_un: Primero apliquemos nuestro circuito al estado de la pared de dominio, utilizando los parámetros que obtuvimos al entrenar nuestro Autocodificador Cuántico. (Ten en cuenta que hemos incluido barreras en nuestro circuito a continuación, sin embargo, estas no son necesarias para la implementación del Autocodificador Cuántico y se utilizan para determinar las diferentes secciones de nuestro circuito).

source: Now we assign the parameter values obtained in the training.
es_un: Ahora asignamos los valores de los parámetros obtenidos en el entrenamiento.
ja: ここで、学習で得られたパラメーター値を代入します。

source: Now let's get the statevectors of our Domain Wall state and output circuit and calculate the fidelity!
es_un: ¡Ahora obtengamos los vectores de estado de nuestro circuito de salida y estado de la Pared de Dominio y calculemos la fidelidad!

source: As you can see our fidelity is quite high and our Autoencoder has thus compressed our dataset while retaining all the information from the input state!
es_un: Como puedes ver, nuestra fidelidad es bastante alta y, por lo tanto, nuestro autocodificador ha comprimido nuestro conjunto de datos mientras ¡retiene toda la información del estado de entrada!
ja: このように、オートエンコーダーは入力状態の情報をすべて保持したまま、データセットを圧縮しているのです。

source: Now we will see if we can apply such a Quantum Autoencoder to more complicated datasets containing noise, such as images of the numbers zero and one.
es_un: Ahora veremos si podemos aplicar dicho Autocodificador Cuántico a conjuntos de datos más complicados que contienen ruido, como imágenes de los números cero y uno.
ja: 次に、このような量子オートエンコーダーを、ノイズを含むより複雑なデータセット、例えば数字の0と1の画像に適用できるかどうか見てみましょう。

source: 7. A Quantum Autoencoder for Digital Compression
es_un: 7. Un Autocodificador Cuántico para Compresión Digital
ja: 7. デジタル圧縮のための 量子オートエンコーダー

source: One can also apply a Quantum Autoencoder to more complicated examples, such as a set of handwritten digits in order to compress the dataset. Below, we will show that we can indeed train an Quantum Autoencoder to compress such an example, giving us the ability to store data more efficiently on a Quantum Computer.
es_un: También se puede aplicar un Autocodificador Cuántico a ejemplos más complicados, como un conjunto de dígitos escritos a mano para comprimir el conjunto de datos. A continuación, mostraremos que, de hecho, podemos entrenar un Autocodificador Cuántico para comprimir un ejemplo de este tipo, lo que nos brinda la capacidad de almacenar datos de manera más eficiente en una computadora cuántica.
ja: また、データセットを圧縮するために、手書きの数字の集合のような、より複雑な例にも量子オートエンコーダーを適用することができます。以下では、実際に量子オートエンコーダーを訓練してこのような例を圧縮できることを示し、量子コンピューターでより効率的にデータを保存できるようにします。

source: For this tutorial, we will build a Quantum Autoencoder for a noisy dataset containing zeros and ones, which can be seen below.
es_un: Para este tutorial, crearemos un Autocodificador Cuántico para un conjunto de datos ruidoso que contiene ceros y unos, que se puede ver a continuación.
ja: このチュートリアルでは、0と1を含むノイズの多いデータセットに対して、量子オートエンコーダーを構築します（下図）。

source: After encoding our image into :math:`5` qubits, we begin to train our Quantum Autoencoder to compress this state into :math:`3` qubits.
es_un: Después de codificar nuestra imagen en :math:`5` qubits, comenzamos a entrenar nuestro Autocodificador Cuántico para comprimir este estado en :math:`3` qubits.
ja: Math:`5`量子ビットに画像をエンコードした後、この状態を :math:`3` 量子ビットに圧縮するために量子オートエンコーダーの学習を開始します。

source: We repeat the steps in the previous example and write a cost function, again based on the Swap Test between the trash and latent space. We can also use the same Autoencoder function as given in the previous example, as the input state and trash space contain the same amount of qubits.
es_un: Repetimos los pasos del ejemplo anterior y escribimos una función de costo, nuevamente basada en la Prueba Swap entre los espacios basura y latente. También podemos usar la misma función de Autocodificador que se proporciona en el ejemplo anterior, ya que el estado de entrada y el espacio basura contienen la misma cantidad de qubits.
ja: 前の例のステップを繰り返し、再びゴミ空間と潜在空間間のスワップテストに基づいたコスト関数を書きます。入力状態とゴミ空間が同じ量の量子ビットを含むので、前の例で与えられたのと同じオートエンコーダー関数を使用することもできます。

source: Let's input one of our digits and see our circuit for the Autoencoder below.
es_un: Ingresemos uno de nuestros dígitos y veamos nuestro circuito para el Autocodificador a continuación.

source: Again, we can see the swap test being performed on the qubits :math:`3`, :math:`4`, :math:`5` and :math:`6`, which will determine the value of our cost function.
es_un: Nuevamente, podemos ver la prueba swap que se realiza en los qubits :math:`3`, :math:`4`, :math:`5` y :math:`6`, que determinarán el valor de nuestra función de costo.
ja: ここでも、スワップテストが量子ビット :math:`3`, :math:`4`, :math:`5`, :math:`6` に対して行われ、コスト関数の値を決定していることがわかります。

source: Since model training may take a long time we have already pre-trained the model for some iterations and saved the pre-trained weights. We'll continue training from that point by setting ``initial_point`` to a vector of pre-trained weights.
es_un: Dado que el entrenamiento del modelo puede llevar mucho tiempo, ya hemos entrenado previamente el modelo para algunas iteraciones y hemos guardado los pesos previamente entrenados. Continuaremos entrenando desde ese punto configurando ``initial_point`` a un vector de pesos preentrenados.

source: By minimizing this cost function, we can thus determine the required parameters to compress our noisy images. Let's see if we can encode our images!
es_un: Al minimizar esta función de costo, podemos determinar los parámetros necesarios para comprimir nuestras imágenes ruidosas. ¡Veamos si podemos codificar nuestras imágenes!

source: Looks like it has converged!
es_un: ¡Parece que ha convergido!
ja: 収束したようです!

source: Now let's build our Encoder and Decoder using the parameters obtained from the training period. After applying this circuit to our new dataset, we can then compare our input and output data and see if we were able to retain the images efficiently throughout the compression!
es_un: Ahora construyamos nuestro Codificador y Decodificador usando los parámetros obtenidos del periodo de entrenamiento. Después de aplicar este circuito a nuestro nuevo conjunto de datos, podemos comparar nuestros datos de entrada y salida y ¡ver si pudimos retener las imágenes de manera eficiente durante la compresión!

source: It looks like our Quantum Autoencoder can be trained to encode digits as well! Now it's your turn to build your own Quantum Autoencoder and come up with ideas and datasets to compress!
es_un: ¡Parece que nuestro Autocodificador Cuántico también se puede entrenar para codificar dígitos! ¡Ahora es tu turno de construir tu propio Autocodificador Cuántico y generar ideas y conjuntos de datos a comprimir!

source: 8. Applications of a Quantum Autoencoder
es_un: 8. Aplicaciones de un Autocodificador Cuántico
ja: 8. 量子オートエンコーダーの応用
