Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/aqua_tutorials/Qiskit Algorithms Migration Guide.po
Languages: es_un, fr_fr, ja_jp, ko_kr, pt_br, ta_in, tr_tr

source: For Hamiltonians from combinatorial optimization (like ours: :math:`Z \otimes I`) we can use the QAOA algorithm.
es_un: Para los Hamiltonianos de optimización combinatoria (como el nuestro: :math:`Z \otimes I`) podemos usar el algoritmo QAOA.
fr_fr: Pour les Hamiltoniens de l'optimisation combinatoire (comme : :math:` Z \otimes I'), nous pouvons utiliser l'algorithme QAOA.
ja_jp: 組合せ最適化によるハミルトニアン（ :math:`Z \otimes I` のようなもの）に対しては、QAOAアルゴリズムを使用することができます。
ko_kr: 조합 최적화 (예를 들어, :math:`Z \otimes I` 와 같음) 의 해밀토니안에 대해 QAOA 알고리즘을 사용할 수 있다.
pt_br: Para Hamiltonianos a partir de otimização combinatória (como nossa: :math:` Z \otimes I `) podemos utilizar o algoritmo QAOA.
ta_in: ஒருங்கிணைந்த தேர்வுமுறையிலிருந்து ஹாமில்டோனியர்களுக்கு (எங்களைப் போன்றது :math:`Z \otimes I`) நாம் QAOA வழிமுறையைப் பயன்படுத்தலாம்.
tr_tr: Kombinatoryal optimizasyondan Hamiltonlar için (bizimki gibi: :math:`Z \otimes I`) QAOA algoritmasını kullanabiliriz.

source: **More examples:**
es_un: **Más ejemplos:**
fr_fr: ** Autres exemples : **
ja_jp: **その他の例:**
ko_kr: **추가 예시:**
pt_br: **Mais exemplos:**
ta_in: **மேலும் எடுத்துக்காட்டுகள்:**
tr_tr: Daha fazla örnek

source: Classical CPLEX
es_un: CPLEX clásico
fr_fr: CPLEX classique
ko_kr: 전통적인 CPLEX
pt_br: CPLEX clássico
ta_in: கிளாசிக்கல் CPLEX
tr_tr: Klasik CPLEX

source: The ``ClassicalCPLEX`` algorithm is now available via the ``CplexOptimizer`` interface in the machine learning module.
es_un: El algoritmo ``ClassicalCPLEX`` ahora está disponible a través de la interfaz ``CplexOptimizer`` en el módulo de aprendizaje automatizado.
fr_fr: L'algorithme ``ClassicalCPLEX`` est désormais disponible via l'interface ``CplexOptimizer``dans le module d'apprentissage automatique.
ja_jp: ``ClassicalCPLEX`` アルゴリズムは現在、機械学習モジュールの ``CplexOptimizer`` インターフェースを通じて利用できるようになっています。
ko_kr: 기계학습 모듈의 ``CplexOptimizer`` 인터페이스를 통해 ``ClassicalCPLEX`` 알고리즘을 사용할 수 있게 되었다.
pt_br: O algoritmo ` ` ClassicalCPLEX ` ` agora está disponível através da interface ` ` CplexOptimizer ` ` no módulo de aprendizado de máquina.
ta_in: ``ClassicalCPLEX`` வழிமுறை இப்போது இயந்திர கற்றல் தொகுதியில் ``CplexOptimizer`` இடைமுகம் வழியாக கிடைக்கிறது.
tr_tr: ``ClassicalCPLEX`` algoritmasına artık makine öğrenimi modülündeki ``CplexOptimizer`` arayüzü üzerinden erişilebilir.

source: (General) Eigenvalues
es_un: (General) Valores propios
fr_fr: Valeurs propres (générales)
ja_jp: ( 一般的な) 固有値問題
ko_kr: (일반) 고윳값
pt_br: (Geral) Eigenvalues
ta_in: (பொது) ஐகென்வேல்யூஸ்
tr_tr: (Genel) Özdeğerler

source: As for the ``MinimumEigenSolver``, the only change for the ``EigenSolver`` is the type for the observable and the import path.
es_un: En cuanto al ``MinimumEigenSolver``, el único cambio para el ``EigenSolver`` es el tipo de la ruta observable y de importación.
fr_fr: En ce qui concerne ``MinimumEigenSolver``, le seul changement pour ``EigenSolver`` est le type pour le chemin observable et le chemin d'importation.
ja_jp: ``MinimumEigenSolver`` では、``EigenSolver`` の唯一の変更は、observableとインポートパスの型です。
ko_kr: ``MinimumEigenSolver`` 에 대해서는, ``EigenSolver`` 의 유일한 변화는 observable의 타입과 import 경로이다.
pt_br: Quanto ao ``MinimumEigenSolver``, a única mudança para o ``EigenSolver`` é o tipo para o observável e o caminho de importação.
ta_in: ``குறைந்தபட்ச ஈஜென்சால்வர்`` ஐப் பொறுத்தவரை, ``ஈஜென்சால்வர்`` க்கான ஒரே மாற்றம் கவனிக்கத்தக்க மற்றும் இறக்குமதி பாதைக்கான வகையாகும்.
tr_tr: ``MinimumEigenSolver``'a gelince, ``EigenSolver`` için tek değişiklik, gözlemlenebilirin türü ve içe aktarma yolu.

source: Shor’s algorithm
es_un: Algoritmo de Shor
fr_fr: Algorithme de Shor
ja_jp: Shorのアルゴリズム
ko_kr: 쇼어 알고리즘
pt_br: Algoritmo de Shor
ta_in: ஷோர்ஸ் வழிமுறை
tr_tr: Shor algoritması

source: The arguments ``N`` and ``a`` moved from the initializer to the ``Shor.factor`` method.
es_un: Los argumentos ``N`` y ``a`` se movieron del inicializador al método ``Shor.factor``.
fr_fr: Les arguments ``N`` et ``a`` sont passés de l'initialiseur à la méthode ``Shor.factor``.
ja_jp: 引数の ``N`` と ``a`` は、イニシャライザから ``Shor.factor`` メソッドに移動しました。
ko_kr: 매개변수 ``N`` 과 ``a`` 는 초기화 함수에서 ``Shor.factor`` 메서드로 이동했다.
pt_br: Os argumentos ``N`` e ``a`` foram movidos do inicializador para o método ``Shor.factor``.
ta_in: ``N`` மற்றும் ``a`` ஆகிய வாதங்கள் துவக்கத்திலிருந்து ``Shor.factor`` முறைக்கு நகர்த்தப்பட்டன.
tr_tr: ``N`` ve ``a`` bağımsız değişkenleri, başlatıcıdan ``Shor.factor`` yöntemine taşındı.

source: We’ll be using a shot-based readout for speed here.
es_un: Aquí usaremos una lectura de salida basada en iteraciones para la rapidez.
fr_fr: Nous utiliserons ici une lecture basée sur le nobmre d'exéctuiont pour aller plus vite.
ja_jp: ここでは、速度を上げるためにショットベースの読み出しを使用します。
ko_kr: 우리는 여기서 속도를 위해 샷 기반 해독을 사용할 것이다.
pt_br: Nós vamos usar uma leitura shot-based para velocidade aqui.
ta_in: வேகத்திற்கான ஷாட் அடிப்படையிலான வாசிப்பைப் பயன்படுத்துகிறோம்.
tr_tr: Burada hız için tek tabanlı bir dışa okuma, verinin dijital gösterimini kullanacağız.

source: HHL has been completely refactored to allow an intuitive interface and return an efficient, circuit-based representation of the result.
es_un: HHL se ha refactorizado por completo para permitir una interfaz intuitiva y devolver una representación del resultado eficiente y basada en circuitos.
fr_fr: HHL a été complètement restructuré afin de permettre une interface intuitive et de rendre une représentation efficace du résultat, basée sur le circuit.
ja_jp: HHL は完全にリファクタリングされ、直感的なインタフェースと効果的な回路ベースの結果の表現を返すようになりました。
ko_kr: HHL은 직관적인 인터페이스를 허용하고 결과의 효율적인 회로 기반 표현을 리턴하도록 완전히 리팩토링되었다.
pt_br: A HHL foi completamente refatorada para permitir uma interface intuitiva e retornar uma representação eficiente, baseada em circuito, do resultado.
ta_in: ஒரு உள்ளுணர்வு இடைமுகத்தை அனுமதிக்க மற்றும் முடிவின் திறமையான, சர்க்யூட் அடிப்படையிலான பிரதிநிதித்துவத்தை வழங்க HHL முற்றிலும் மறுசீரமைக்கப்பட்டுள்ளது.
tr_tr: HHL, sezgisel bir arayüze izin vermek ve sonucun verimli, devre tabanlı bir temsilini döndürmek için tamamen yeniden düzenlendi.

source: Assume we want to solve the following linear system
es_un: Supongamos que queremos resolver el siguiente sistema lineal
fr_fr: Supposons que nous voulions résoudre le système linéaire suivant
ja_jp: 次の線形問題を解きたいとします
ko_kr: 다음 선형 시스템을 해결하고자 한다고 가정하자
pt_br: Suponha que queremos resolver o seguinte sistema linear
ta_in: பின்வரும் நேரியல் முறையை தீர்க்க விரும்புகிறோம் என்று வைத்துக் கொள்ளுங்கள்
tr_tr: Aşağıdaki lineer sistemi çözmek istediğimizi varsayalım

source: Note that the solution vector is not returned, since that would require an exponentially expensive simulation of the solution circuit. Instead, the circuit can be used to evaluate observables on the solution. For details, see the documentation and docstrings of HHL.
es_un: Ten en cuenta que el vector de solución no se devuelve, ya que eso requeriría una simulación exponencialmente costosa del circuito de solución. En cambio, el circuito se puede usar para evaluar observables en la solución. Para obtener más información, consulte la documentación y las docstrings de HHL.
fr_fr: Notez que le vecteur de solution n'est pas renvoyé, car cela nécessiterait une simulation exponentiellement onéreuse du circuit de solution. En revanche, le circuit peut être utilisé pour évaluer les observables de la solution. Pour plus de détails, voir la documentation et les chaînes de HHL.
ja_jp: 解のベクトルが返らないことに注意してください。これは解の回路の指数関数的に高いシミュレーションが必要になることを防ぐためです。その代わりに、回路は解の観測量を評価することに使えます。詳しくは、HHL のドキュメントとdocstringを参照してください。
ko_kr: 솔루션 벡터는 솔루션 회로의 기하급수적으로 비싼 시뮬레이션이 필요하므로 솔루션 벡터가 리턴되지 않는다. 대신에, 회로는 솔루션의 observable들을 평가하는데 사용될 수 있다. 자세한 내용은 HHL의 문서 및 docstring을 참조하여라.
pt_br: Observe que o vetor de solução não é retornado, uma vez que isso exigiria uma simulação exponencialmente cara do circuito de soluções. Em vez disso, o circuito pode ser usado para avaliar observáveis na solução. Para obter detales, consulte a documentação e os docstrings do HLL.
ta_in: தீர்வு திசையன் திரும்பப் பெறப்படவில்லை என்பதை நினைவில் கொள்க, ஏனெனில் அதற்கு தீர்வு சர்க்யூட்டின் அதிவேக விலையுயர்ந்த உருவகப்படுத்துதல் தேவைப்படும். அதற்கு பதிலாக, தீர்வில் காணக்கூடியவற்றை மதிப்பீடு செய்ய சுற்று பயன்படுத்தப்படலாம். விவரங்களுக்கு, HHL இன் ஆவணங்கள் மற்றும் ஆவணங்களை பார்க்கவும்.
tr_tr: Çözüm devresinin katlanarak pahalı bir simülasyonunu gerektireceğinden, çözüm vektörünün döndürülmediğine dikkat edin. Bunun yerine devre, çözüm üzerindeki gözlemlenebilirleri değerlendirmek için kullanılabilir. Ayrıntılar için, HHL belgelerine ve belgelerine bakın.

source: NumPy-based linear solver
es_un: Solucionador lineal basado en NumPy
fr_fr: Solveur linéaire à base de NumPy
ja_jp: NumPyベースの線形ソルバー
ko_kr: NumPy 기반 linear solver
pt_br: Solucionador linear NumPy-based
ta_in: NumPy- அடிப்படையிலான நேரியல் தீர்வி
tr_tr: NumPy tabanlı lineer çözücü

source: Phase estimation
es_un: Estimación de fase
fr_fr: Estimation de phase
ja_jp: 位相推定
ko_kr: 위상 추정
pt_br: Estimação de fase
ta_in: கட்ட மதிப்பீடு
tr_tr: Faz tahmini

source: Phase estimation has been completely refactored and instead of just one ``qiskit.aqua.algorithms.QPE`` class that was used to compute the eigenvalue of a Hamiltonian, we now have two separate implementations: the ``HamiltonianPhaseEstimation`` taking the role of the old ``QPE`` and a new ``PhaseEstimation`` algorithm for textbook phase estimation.
es_un: La estimación de fase se ha refactorizado por completo y en lugar de solo una clase ``qiskit.aqua.algorithms.QPE`` que se usó para calcular el valor propio de un Hamiltoniano, ahora tenemos dos implementaciones separadas: la ``HamiltonianPhaseEstimation`` que toma el papel del antiguo ``QPE`` y un nuevo algoritmo ``PhaseEstimation`` para la estimación de fase de libro de texto.
fr_fr: L'estimation de la phase a été complètement restructurée et au lieu d'une seule classe ``qiskit.aqua.algorithms.QPE`` qui a été utilisée pour calculer la valeur propre d'un hamiltonien, nous avons maintenant deux implémentations distinctes: la ``HamiltonianPhaseEstimation`` prenant le rôle de l'ancien ``QPE`` et un nouvel algorithme ``PhaseEstimation`` pour l'estimation de la phase classique.
ja_jp: 位相推定は完全にリファクタリングされ、ハミルトニアンの固有値を計算するために使われていた1つの ``qiskit.aqua.algorithm.QPE`` クラスの代わりに、2つの独立した実装があります： ``HamiltonianPhaseEstimation`` が古い ``QPE`` の役割を果たし、教科書的な位相推定のための新しい ``PhaseEstimation`` アルゴリズムがあります。
ko_kr: 위상 추정은 완전히 리팩토링되었고 헤밀토니안의 고윳값을 계산하기 위해 사용되었던 ``qiskit.aqua.algorithms.QPE`` 하나만이 아닌, 이제는 두 개의 분리된 구현이 존재한다: 이전 ``QPE`` 의 역할을 대체하는 ``HamiltonianPhaseEstimation`` 과 텍스트북 위상 추정을 위한 새로운 ``PhaseEstimation`` 알고리즘이다.
pt_br: A estimativa de fase foi completamente reformulada e ao invés de apenas uma classe ``qiskit.aqua.algorithms.QPE`` que era usada para calcular o eigenvalue de um Hamiltoniano, agora usa duas implementações separadas: o ``HamiltonianPhaseEstimation`` que assume o papel do antigo ``QPE`` e um novo algoritmo ``PhaseEstimation`` para a estimativa de fase didática.
ta_in: கட்ட மதிப்பீடு முற்றிலும் மறுசீரமைக்கப்பட்டுள்ளது, மேலும் ஒரு ஹாமில்டோனியனின் சமநிலைக் கணக்கீட்டைப் பயன்படுத்தப் பயன்படுத்தப்பட்ட ஒரு ``qiskit.aqua.algorithms.QPE`` வகுப்பிற்குப் பதிலாக, இப்போது எங்களுக்கு இரண்டு தனித்தனி செயலாக்கங்கள் உள்ளன: ``HamiltonianPhaseEstimation`` பங்கு வகிக்கிறது பழைய ``QPE`` மற்றும் பாடநூல் கட்ட மதிப்பீட்டிற்கான புதிய ``PhaseEstimation`` வழிமுறை.
tr_tr: Faz tahmini tamamen yeniden düzenlendi ve bir Hamiltoniyenin özdeğerini hesaplamak için kullanılan sadece bir "qiskit.aqua.algorithms.QPE" sınıfı yerine, şimdi iki ayrı uygulamamız var: "HamiltonianPhaseEstimation" rolü üstlenen ders kitabı faz tahmini için eski "QPE" ve yeni "PhaseEstimation" algoritması.

source: The iterative phase estimation, ``qiskit.aqua.algorithms.IQPE`` is not yet replaced but will follow soon.
es_un: La estimación de la fase iterativa, ``qiskit.aqua.algorithms.IQPE`` aún no se ha reemplazado, pero pronto sucederá.
fr_fr: L'estimation de la phase itérative, ``qiskit.aqua.algorithms.IQPE ` ` n'est pas encore remplacée mais suivra bientôt.
ja_jp: 反復位相推定である ``qiskit.aqua.algorithms.IQPE`` はまだ置き換えられていませんが、すぐに置き換えられる予定です。
ko_kr: 반복적인 위상 추정인 ``qiskit.aqua.algorithms.IQPE`` 는 아직 대체되지 않았지만 곧 뒤따를 것이다.
pt_br: A estimativa de fase iterativa, ``qiskit.aqua.algorithms.IQPE`` ainda não foi substituída, mas o vai em breve.
ta_in: செயல்பாட்டு கட்ட மதிப்பீடு, ``qiskit.aqua.algorithms.IQPE`` இன்னும் மாற்றப்படவில்லை, ஆனால் விரைவில் பின்பற்றப்படும்.
tr_tr: Tekrar eden aşama tahmini, ``qiskit.aqua.algorithms.IQPE`` henüz yenilenmedi, ancak yakında olacak.

source: Let’s consider the problem of finding the eigenvalue of
es_un: Consideremos el problema de encontrar el valor propio de
fr_fr: Considérons le problème de trouver la valeur propre de
ja_jp: 以下の固有値を求める問題を考えます。
ko_kr: 다음의 고윳값을 찾는 문제를 생각해 보자.
pt_br: Vamos considerar o problema de encontrar o eigenvalue de
ta_in: இன் சமத்துவ மதிப்பைக் கண்டுபிடிப்பதில் உள்ள சிக்கலைக் கருத்தில் கொள்வோம்
tr_tr: Haydı özdeğerini bulma problemini ele alalım

source: with the input state :math:`|0\rangle`.
es_un: con el estado de entrada :math:`|0\rangle`.
fr_fr: avec l'état d'entrée :math:`|0\rangle` .
ja_jp: 初期状態は、 :math:`|0\rangle` です。
ko_kr: 입력 상태는 :math:`|0\rangle` 이다.
pt_br: com o estado de entrada :math:`|0\rangle`.
ta_in: உள்ளீட்டு நிலையில் :math:`|0\rangle`.
tr_tr: giriş durumuyla :math:`|0\rangle`.

source: Now we can also do standard phase estimation to solve
es_un: Ahora también podemos hacer una estimación de fase estándar para resolver
fr_fr: Maintenant, nous pouvons aussi faire une estimation de phase standard pour résoudre
ja_jp: 標準的な位相推定も使えるようになりました
ko_kr: 이제 표준 위상 추정을 수행하여 해결할 수 있다
pt_br: Agora também podemos fazer estimativa da fase padrão para resolver
ta_in: இப்போது நாம் தீர்க்க நிலையான கட்ட மதிப்பீட்டையும் செய்யலாம்
tr_tr: Şimdi çözmek için standart faz tahmini de yapabiliriz

source: ``VQC`` changed the location to ``qiskit_machine_learning.algorithms.VQC`` and is now implemented as ``NeuralNetworkClassification`` object instead of a generic variational algorithm. The interface has been updated accordingly, see the tutorials below.
es_un: ``VQC`` cambió su ubicación a ``qiskit_machine_learning.algorithms.VQC`` y ahora se implementa como un objeto ``NeuralNetworkClassification`` en lugar de un algoritmo variacional genérico. La interfaz se ha actualizado en consecuencia, consulte los tutoriales a continuación.
fr_fr: ``VQC`` est à présent dans ``qiskit_machine_learning.algorithms.VQC`` et est maintenant implémenté en tant qu'objet ``NeuralNetworkClassification`` au lieu d'un algorithme variationnel générique. L'interface a été mise à jour en conséquence, voir les tutoriels ci-dessous.
ko_kr: ``VQC`` 는 ``qiskit_machine_learning.algorithms.VQC`` 로 위치가 변경되었으며 이제 일반적인 변형 알고리즘이 아닌 ``NeuralNetworkClassification`` 객체로 구현된다. 이에 따라 인터페이스가 업데이트되었다. 아래에 있는 튜토리얼을 참조하여라.
pt_br: ` ` VQC ` ` alterou o local para ` ` ` qiskit_machine_learning.algoritthms.VQC ` ` e é agora implementado como um objeto ` ` NeuralNetworkClassification ` ` em vez de um algoritmo variacional genérico. A interface foi atualizada de acordo, veja os tutoriais abaixo.
ta_in: ``VQC`` இருப்பிடத்தை ``qiskit_machine_learning.algorithms.VQC`` என மாற்றியது, இப்போது இது பொதுவான மாறுபட்ட வழிமுறைக்கு பதிலாக ``NeuralNetworkClassification`` பொருளாக செயல்படுத்தப்படுகிறது. இடைமுகம் அதற்கேற்ப புதுப்பிக்கப்பட்டுள்ளது, கீழே உள்ள பயிற்சிகளைப் பார்க்கவும்.
tr_tr: "VQC", konumu "qiskit_machine_learning.algorithms.VQC" olarak değiştirdi ve artık genel bir varyasyon algoritması yerine "NeuralNetworkClassification" nesnesi olarak uygulandı. Arayüz buna göre güncellendi, aşağıdaki öğretici derslere bakın.

source: Since the examples are rather lengthy, we refer to a comparison of the previous and new tutorials.
es_un: Dado que los ejemplos son bastante extensos, nos referimos a una comparación de los tutoriales anteriores y nuevos.
fr_fr: Comme les exemples sont assez longs, nous nous référons à une comparaison entre les tutoriels précédents et les nouveaux.
ko_kr: 예제가 다소 길기 때문에 이전 및 새 학습서의 비교를 참조한다.
pt_br: Uma vez que os exemplos são bastante longos, referimo-nos a uma comparação dos tutoriais anteriores e dos novos.
ta_in: எடுத்துக்காட்டுகள் நீளமாக இருப்பதால், முந்தைய மற்றும் புதிய பயிற்சிகளின் ஒப்பீட்டைக் குறிப்பிடுகிறோம்.
tr_tr: Örnekler oldukça uzun olduğu için, önceki ve yeni öğreticilerin bir karşılaştırmasına atıfta bulunuyoruz.

source: The ``QSVM`` workflow has been replaced by a more generic ``QuantumKernel`` routine to better highlight the possibly advantage of quantum computers in computing kernels.
es_un: El flujo de trabajo de ``QSVM`` ha sido reemplazado por una rutina más genérica ``QuantumKernel`` para resaltar mejor la posible ventaja de las computadoras cuánticas en los núcleos de computación.
fr_fr: Le workflow ``QSVM`` a été remplacé par une routine ``QuantumKernel`` plus générique pour mieux mettre en évidence l'avantage éventuel des ordinateurs quantiques dans le calcul des noyaux.
ko_kr: ``QSVM`` 워크플로우는 컴퓨팅 커널에서 양자 컴퓨터의 장점을 더욱 잘 부각시키기 위해 보다 일반적인 ``QuantumKernel`` 루틴으로 대체되었다.
pt_br: O fluxo de trabalho ` ` QSVM ` ` foi substituído por uma rotina mais genérica ` ` QuantumKernel ` ` para realçar melhor a possivel vantagem dos computadores quânticos em kernels de computação.
ta_in: கம்ப்யூட்டிங் கர்னல்களில் குவாண்டம் கணினிகளின் நன்மைகளை சிறப்பாக எடுத்துக்காட்டுவதற்காக ``QSVM`` பணிப்பாய்வு மிகவும் பொதுவான ``QuantumKernel`` வழக்கத்தால் மாற்றப்பட்டுள்ளது.
tr_tr: "QSVM" iş akışı, kuantum bilgisayarların hesaplama çekirdeklerindeki olası avantajını daha iyi vurgulamak için daha genel bir "QuantumKernel" rutini ile değiştirildi.

source: The interface and methods remained the same, only the import location of the algorithm and it’s components changed from ``qiskit.aqua`` to ``qiskit_machine_learning``.
es_un: La interfaz y los métodos permanecieron iguales, solo la ubicación de importación del algoritmo y sus componentes cambiaron de ``qiskit.aqua`` a ``qiskit_machine_learning``.
fr_fr: L'interface et les méthodes sont restées les mêmes, seul l'emplacement d'importation de l'algorithme et ses composants ont changé de ``qiskit.aqua`` à ``qiskit_machine_learning``.
ko_kr: 인터페이스와 메소드는 변함이 없고, 알고리즘과 그 컴포넌트의 import 위치가 ``qiskit.aqua`` 에서 ``qiskit_machine_learning`` 으로 바뀌었다.
pt_br: A interface e os métodos permaneceram os mesmos, apenas a localização de importação do algoritmo e seus componentes foram alterados do ``qiskit.aqua`` para o ``qiskit_machine_learning``.
ta_in: இடைமுகமும் முறைகளும் அப்படியே இருந்தன, வழிமுறையின் இறக்குமதி இருப்பிடம் மட்டுமே மற்றும் அதன் கூறுகள் ``qiskit.aqua`` இலிருந்து ``qiskit_machine_learning`` என மாற்றப்பட்டுள்ளன.
tr_tr: Arayüz ve yöntemler aynı kaldı, yalnızca algoritmanın içe aktarma konumu ve bileşenleri "qiskit.aqua"dan "qiskit_machine_learning"e değiştirildi.

source: Educational algorithms
es_un: Algoritmos educativos
fr_fr: Algorithmes éducatifs
ja_jp: 教育用アルゴリズム
ko_kr: 교육 알고리즘들
pt_br: Algoritmos educacionais
ta_in: கல்வி வழிமுறைகள்
tr_tr: Eğitimsel algoritmalar

source: All educational algorithms have been deprecated and most are now available in the textbook.
es_un: Todos los algoritmos educativos han quedado obsoletos y la mayoría ahora están disponibles en el libro de texto.
fr_fr: Tous les algorithmes éducatifs sont devenus obsolètes et la plupart sont maintenant disponibles dans le manuel.
ja_jp: 教育用アルゴリズムは廃止され、ほとんどの教育用アルゴリズムはテキストブックにあります。
ko_kr: 모든 교육 알고리즘은 더 이상 사용되지 않으며 현재 대부분의 알고리즘은 텍스트북에서 사용할 수 있다.
pt_br: Todos os algoritmos educacionais foram descontinuados e a maioria agora está disponível no textbook.
ta_in: அனைத்து கல்வி வழிமுறைகளும் நீக்கப்பட்டன, பெரும்பாலானவை இப்போது பாடப்புத்தகத்தில் கிடைக்கின்றன.
tr_tr: Tüm eğitim algoritmaları kullanımdan kaldırıldı ve şimdi çoğu ders kitabında mevcut.

source: Deutsch-Josza
ja_jp: ドイチュ-ジョザ
ko_kr: 도이치-조사 (Deutsch-Josza)

source: Moved to the textbook: https://qiskit.org/textbook/ch-algorithms/deutsch-jozsa.html.
es_un: Trasladado al libro de texto: https://qiskit.org/textbook/ch-algorithms/deutsch-jozsa.html.
fr_fr: Déplacé dans le manuel : https://qiskit.org/textbook/ch-algorithms/deutsch-jozsa.html.
ja_jp: テキストブックに移動しました: https://qiskit.org/textbook/ch-algorithms/deutsch-jozsa.html
ko_kr: https://qiskit.org/textbook/ch-algorithms/deutsch-jozsa.html 로 이동됨
pt_br: Movido para o livro-texto: https://qiskit.org/textbook/ch-algorithms/deutsch-jozsa.html.
ta_in: பாடப்புத்தகத்திற்கு நகர்த்தப்பட்டது: https://qiskit.org/textbook/ch-algorithms/deutsch-jozsa.html.
tr_tr: Ders kitabına taşındı: https://qiskit.org/textbook/ch-algorithms/deutsch-jozsa.html.

source: Bernstein-Vazirani
ja_jp: ベルンシュタイン-バジラニ
ko_kr: 번스타인-바즈라니(Bernstein-Vazirani)

source: Moved to the textbook: https://qiskit.org/textbook/ch-algorithms/bernstein-vazirani.html.
es_un: Trasladado al libro de texto: https://qiskit.org/textbook/ch-algorithms/bernstein-vazirani.html.
fr_fr: Déplacé dans le manuel: https://qiskit.org/textbook/ch-algorithms/bernstein-vazirani.html.
ja_jp: テキストブックに移動しました: https://qiskit.org/textbook/ch-algorithms/bernstein-vazirani.html
ko_kr: https://qiskit.org/textbook/ch-algorithms/bernstein-vazirani.html 로 이동됨
pt_br: Movido para o livro-texto: https://qiskit.org/textbook/ch-algorithms/bernstein-vazirani.html.
ta_in: பாடப்புத்தகத்திற்கு நகர்த்தப்பட்டது: https://qiskit.org/textbook/ch-algorithms/bernstein-vazirani.html.
tr_tr: Ders kitabına taşınmıştır: https://qiskit.org/textbook/ch-algorithms/bernstein-vazirani.html.

source: Simon
ja_jp: サイモン
ko_kr: 사이먼 (Simon)

source: Moved to the textbook: https://qiskit.org/textbook/ch-algorithms/simon.html.
es_un: Trasladado al libro de texto: https://qiskit.org/textbook/ch-algorithms/simon.html.
fr_fr: Déplacé dans le manuel : https://qiskit.org/textbook/ch-algorithms/simon.html.
ja_jp: テキストブックに移動しました: https://qiskit.org/textbook/ch-algorithms/simon.html
ko_kr: https://qiskit.org/textbook/ch-algorithms/simon.html 로 이동되었다
pt_br: Movido para o livro-texto: https://qiskit.org/textbook/ch-algorithms/simon.html.
ta_in: பாடப்புத்தகத்திற்கு நகர்த்தப்பட்டது: https://qiskit.org/textbook/ch-algorithms/simon.html.
tr_tr: Ders kitabına taşınmıştır: https://qiskit.org/textbook/ch-algorithms/simon.html.

source: The Evolution of Hamiltonian algorithm is can now be implemented with basic tools from ``qiskit.opflow``.
es_un: El algoritmo de Evolución del Hamiltoniano ahora se puede implementar con herramientas básicas de ``qiskit.opflow``.
fr_fr: L'évolution de l'algorithme de Hamiltonien est maintenant implémentée avec les outils de base de ``qiskit.opflow``.
ko_kr: 해밀턴 알고리즘의 진화는 이제 ``qiskit.opflow`` 로부터 기본적인 도구로 구현될 수 있다.
pt_br: A Evolução do algoritmo Hamiltoniano agora pode ser implementado com ferramentas básicas do ``qiskit.opflow``.
ta_in: ஹாமில்டோனிய வழிமுறையின் பரிணாமம் இப்போது அடிப்படை கருவிகளைக் கொண்டு செயல்படுத்தப்படலாம் ``qiskit.opflow``.
tr_tr: Hamiltonyen algoritmasının evrimi artık ``qiskit.opflow``dan temel araçları ile uygulanabilir.

source: https://github.com/Qiskit/qiskit-machine-learning/blob/main/docs/tutorials/02_neural_network_classifier_and_regressor.ipynb
tr_tr: https://github.com/Qiskit/qiskit-machine-learning/blob/master/docs/tutorials/02_neural_network_classifier_and_regressor.ipynb

source: https://github.com/Qiskit/qiskit-machine-learning/blob/main/docs/tutorials/03_quantum_kernel.ipynb
tr_tr: https://github.com/Qiskit/qiskit-machine-learning/blob/master/docs/tutorials/03_quantum_kernel.ipynb

source: https://github.com/Qiskit/qiskit-machine-learning/blob/main/docs/tutorials/04_qgans_for_loading_random_distributions.ipynb
tr_tr: https://github.com/Qiskit/qiskit-machine-learning/blob/master/docs/tutorials/04_qgans_for_loading_random_distributions.ipynb
