Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/aqua_tutorials/Qiskit Algorithms Migration Guide.po
Languages: es_un, fr_fr, ja_jp, ko_kr, pt_br, ta_in, tr_tr

source: Since we are streamlining all algorithms to use the ``QuantumCircuit`` class as base primitive, defining oracles using the ``qiskit.aqua.compontents.Oracle`` class is deprecated. Instead of using e.g. the ``LogicalExpressionOracle`` you can now use the ``PhaseOracle`` circuit from the circuit library.
es_un: Dado que estamos optimizando todos los algoritmos para usar la clase ``QuantumCircuit`` como base primitiva, la definición de oráculos usando la clase ``qiskit.aqua.compontents.Oracle`` está en desuso. En lugar de usar, por ejemplo, el ``LogicalExpressionOracle`` ahora puedes usar el circuito ``PhaseOracle`` de la biblioteca de circuitos.
fr_fr: Puisque nous rationalisons tous les algorithmes pour utiliser la classe ``QuantumCircuit`` comme primitive, la définition des oracles à l'aide de la classe ``qiskit.aqua.compontents.Oracle`` est obsolète. Au lieu d'utiliser, par exemple, la ``LogicalExpressionOracle`` vous pouvez maintenant utiliser le circuit ``PhaseOracle`` de la bibliothèque de circuits.
ja_jp: 基本プリミティブとして ``QuantumCircuit`` クラスを使うようにすべてのアルゴリズムを合理化しているので、``qiskit.aqua.compontents.Oracle`` クラスを使ってオラクルを定義することは非推奨となっています。例えば ``LogicalExpressionOracle`` を使う代わりに、circuit libraryの ``PhaseOracle`` 回路を使うことができます。
ko_kr: 우리가 모든 알고리즘을 능률화하여 ``QuantumCircuit`` 클래스를 기본 primitive로 사용하기 때문에 ``qiskit.aqua.compontents.Oracle`` 클래스를 사용하여 oracle들을 정의하는 것은 더 이상 사용되지 않는다. ``LogicalExpressionOracle`` 을 사용하는 대신, 이제 회로 라이브러리에서 ``PhaseOracle`` 회로를 사용할 수 있다.
pt_br: Uma vez que estamos simplificando todos os algoritmos para usar a classe ``QuantumCircuit`` como base primitiva, definir oracles usando a classe ``qiskit.aqua.compontents.Oracle`` foi descontinuado. Em vez de usar, por exemplo, o ``LogicalExpressionOracle``, agora você pode usar o circuito ``PhaseOracle`` a partir da biblioteca de circuitos.
ta_in: ``QuantumCircuit`` வகுப்பை அடிப்படை பழமையானதாகப் பயன்படுத்துவதற்கான அனைத்து வழிமுறைகளையும் நாங்கள் நெறிப்படுத்துகிறோம் என்பதால், ``qiskit.aqua.compontents.Oracle`` வகுப்பைப் பயன்படுத்தி ஆரக்கிள்களை வரையறுக்கிறோம், எ.கா. ``LogicalExpressionOracle`` பயன்படுத்துவதற்கு பதிலாக இப்போது நீங்கள் சர்க்யூட் நூலகத்திலிருந்து ``PhaseOracle`` சர்க்யூட் பயன்படுத்தலாம்.
tr_tr: "QuantumCircuit" sınıfını temel ilkel olarak kullanmak için tüm algoritmaları düzene soktuğumuzdan, "qiskit.aqua.compontents.Oracle" sınıfını kullanarak kara kutu tanımlamak artık tercih edilmemektedir. Örneğin ``LogicalExpressionOracle`` kullanmak yerine artık devre kütüphanesinden ``PhaseOracle`` devresini kullanabilirsiniz.

source: The ``qiskit.aqua.components.oracles.TruthTableOracle`` is not yet ported, but the behaviour can easily be achieved with the ``qiskit.circuit.classicalfunction`` module, see the tutorials on Grover’s algorithm.
es_un: El ``qiskit.aqua.components.oracles.TruthTableOracle`` aún no se ha transferido, pero el comportamiento se puede lograr fácilmente con el módulo ``qiskit.circuit.classicalfunction``, consulta los tutoriales sobre el algoritmo de Grover.
fr_fr: Le ``qiskit.aqua.components.oracles.TruthTableOracle`` n'est pas encore re-implémenté, mais il peut être facilement réalisé avec le module ``qiskit.circuit.classicalfunction``, voir pour cela les tutoriels sur l'algorithme de Grover.
ja_jp: ``qiskit.aqua.components.oracles.TruthTableOracle`` はまだ移植されていませんが、その動作は ``qiskit.circuit.classicalfunction`` モジュールで簡単に実現できます。グローバーのアルゴリズムに関するチュートリアルをご覧ください。
ko_kr: ``qiskit.aqua.components.oracles.TruthTableOracle`` 은 아직 포팅되지 않았지만, 이는 ``qiskit.circuit.classicalfunction`` 을 통해 쉽게 동작시킬 수 있고, 이에 관해서는 Grover의 알고리즘에 관한 튜토리얼을 참조하여라.
pt_br: O ``qiskit.aqua.components.oracles.TruthTableOracle`` ainda não foi convertido, mas o comportamento pode ser facilmente obtido com o módulo ``qiskit.circuit.classicalfunction``, veja os tutoriais no algoritmo Grover.
ta_in: ``qiskit.aqua.components.oracles.TruthTableOracle`` இன்னும் பொருத்தப்ப்படுத்தப்படவில்லை, ஆனால் ``qiskit.circuit.classicalfunction`` தொகுதி மூலம் நடத்தை எளிதில் அடைய முடியும், க்ரோவரின் வழிமுறையின் பயிற்சிகளைப் பார்க்கவும்.
tr_tr: ``qiskit.aqua.components.oracles.TruthTableOracle`` henüz taşınmadı, ancak davranış, ``qiskit.circuit.classicalfunction`` modülü ile kolayca gerçekleştirilebilir, Grover algoritması hakkındaki öğretici derslere bakın.

source: More examples
es_un: Más ejemplos
fr_fr: Autres exemples
ja_jp: その他の例
ko_kr: 추가 예제
pt_br: Mais exemplos
ta_in: மேலும் எடுத்துக்காட்டுகள்
tr_tr: Daha fazla örnek

source: To construct the circuit we can call ``construct_circuit`` and pass the problem instance we are interested in:
es_un: Para construir el circuito podemos llamar a ``construct_circuit`` y pasar la instancia del problema que nos interesa:
fr_fr: Pour construire le circuit que nous pouvons appeler ``construct_circuit`` et passer l'instance de problème, nous nous intéressons à :
ja_jp: 回路を構築するには、 ``construct_circuit`` を呼び出し、対象となる問題インスタンスを渡します。
ko_kr: 회로를 구성하기 위해 ``construct_circuit`` 를 호출하고 관심 있는 인스턴스를 다음으로 전달할 수 있다:
pt_br: Para construir o circuito, podemos chamar ``construct_circuit`` e passar a instância de problema em que estamos interessados:
ta_in: சுற்றுவட்டத்தை உருவாக்க நாம் ``construct_circuit`` என்று அழைக்கலாம் மற்றும் நாங்கள் ஆர்வமாக உள்ள சிக்கல் நிகழ்வை அனுப்பலாம்:
tr_tr: Devreyi kurmak için ``construct_circuit`` çağırabilir ve ilgilendiğimiz problem örneğini iletebiliriz:

source: Amplitude estimation
es_un: Estimación de amplitud
fr_fr: Estimation de l'amplitude
ja_jp: 振幅推定
ko_kr: 진폭 추정
pt_br: Estimativa da amplitude
ta_in: அலைவீச்சு மதிப்பீடு
tr_tr: Genlik tahmini

source: For all amplitude estimation algorithms \* ``AmplitudeEstimation`` \* ``IterativeAmplitudeEstimation`` \* ``MaximumLikelihoodAmplitudeEstimation``, and \* ``FasterAmplitudeEstimation``
es_un: Para todos los algoritmos de estimación de amplitud \* ``AmplitudeEstimation`` \* ``IterativeAmplitudeEstimation`` \* ``MaximumLikelihoodAmplitudeEstimation``, y \* ``FasterAmplitudeEstimation``
fr_fr: Pour tous les algorithmes d'estimation de l'amplitude \* ``AmplitudeEstimation`` \* ``IterativeAmplitudeEstimation`` \* ``MaximumLikelihoodAmplitudeEstimation`` et \* ``FasterAmplitudeEstimation``
ja_jp: すべての振幅推定アルゴリズムである \* ``AmplitudeEstimation`` \* ``IterativeAmplitudeEstimation`` \* ``MaximumLikelihoodAmplitudeEstimation`` \* ``FasterAmplitudeEstimation`` について
ko_kr: 모든 진폭 추정 알고리즘: \* ``AmplitudeEstimation`` \* ``IterativeAmplitudeEstimation`` \* ``MaximumLikelihoodAmplitudeEstimation``, \* ``FasterAmplitudeEstimation`` 의 경우
pt_br: Para todos os algoritmos de estimativa de amplitude \* ``AmplitudeEstimation`` \* ``IterativeAmplitudeEstimation`` \* ``MaximumLikelihoodAmplitudeEstimation`` e \* ``FasterAmplitudeEstimation``
ta_in: அனைத்து அலைவீச்சு மதிப்பீட்டு வழிமுறைகளுக்கும் \* ``AmplitudeEstimation`` \* ``IterativeAmplitudeEstimation`` \* ``MaximumLikelihoodAmplitudeEstimation``, மற்றும் \* ``FasterAmplitudeEstimation``
tr_tr: Tüm genlik tahmin algoritmaları için \* ``AmplitudeEstimation`` \* \* ``IterativeAmplitudeEstimation`` \* ``MaximumLikelihoodAmplitudeEstimation`` ve \* ``FasterAmplitudeEstimation``

source: the interface changed from
es_un: la interfaz cambió desde
fr_fr: l'interface a changé de
ja_jp: インターフェースが、以下から変更されて、
ko_kr: 인터페이스가 다음과 같이 변경되었다
pt_br: a interface alterada de
ta_in: இடைமுகம் மாற்றப்பட்டது
tr_tr: arayüz değişti

source: to split problem/oracle settings and algorithm settings
es_un: para dividir la configuración del problema/oráculo y la configuración del algoritmo
fr_fr: pour séparer les paramètres du problème/oracle et des algorithmes
ja_jp: 問題/オラクルの設定とアルゴリズムの設定に分けられました。
ko_kr: 이것은 해결하고자 하는 문제 및 오라클 설정과 알고리즘 설정을 분리하기 위해서이다
pt_br: para dividir as configurações de problemas/oraculo e configurações de algoritmo
ta_in: சிக்கல் / ஆரக்கிள் அமைப்புகள் மற்றும் வழிமுறை அமைப்புகளைப் பிரிக்க
tr_tr: problem/kara kutu ayarlarını ve algoritma ayarlarını bölmek için

source: Here, we’d like to estimate the probability of measuring a :math:`|1\rangle` in our single qubit. If the state preparation is provided as circuit
es_un: Aquí, nos gustaría estimar la probabilidad de medir a :math:`|1\rangle` en nuestro único qubit. Si la preparación del estado se proporciona como circuito
fr_fr: Ici, nous aimerions estimer la probabilité de mesurer un angle :math:`|1\rangle` dans notre seul qubit. Si la préparation de l'état est fournie en tant que circuit
ja_jp: ここでは、単一量子ビットで :math:`|1\rangle` を測定する確率を推定したいと思います。状態が以下の回路として提供されている場合
ko_kr: 여기서 우리는 단일 큐비트에서 :math:`|1\rangle` 를 측정하는 확률을 추산하고자 한다. 준비된 상태가 회로로서 제공되는 경우
pt_br: Aqui, gostaríamos de estimar a probabilidade de medir um :math:`|1\rangle` no nosso único qubit. Se a preparação do estado for fornecida como circuito
ta_in: இங்கே, எங்கள் ஒற்றை க்யூபிட்-ல் :math:`|1\rangle` ஐ அளவிடுவதற்கான நிகழ்தகவை மதிப்பிட விரும்புகிறோம். நிலை தயாரிப்பு சர்க்யூட் என வழங்கப்பட்டால்
tr_tr: Burada, tek kübitimizde bir :math:`|1\rangle` ölçme olasılığını tahmin etmek istiyoruz. Devre olarak durum hazırlığı sağlanmışsa,

source: **Now:**
es_un: **Ahora:**
fr_fr: **Maintenant :**
ja_jp: **現在:**
ko_kr: **현재:**
pt_br: **Agora:**
ta_in: **இப்போது:**
tr_tr: **Şimdi:**

source: Note that the old class used the last qubit in the ``state_preparation`` as objective qubit as default, if no other indices were specified. This default does not exist anymore to improve transparency and remove implicit assumptions.
es_un: Ten en cuenta que la clase anterior usaría el último qubit en el ``state_preparation`` como el qubit objetivo por defecto, si no se especificaran otros índices. Este valor predeterminado ya no existe para mejorar la transparencia y eliminar los supuestos implícitos.
fr_fr: Notez que l'ancienne classe utilisait le dernier qubit dans la ``state_preparation`` comme un qubit objectif par défaut, si aucun autre indice n'a été spécifié. Cette valeur par défaut n'existe plus pour améliorer la transparence et supprimer les hypothèses implicites.
ja_jp: 古いクラスは ``state_preparation`` でインデックスが指定されない場合、デフォルトとして最後の量子ビットを目的の量子ビットとしていたことに注意してください。このデフォルトは透明性と暗黙の仮定を除くために無くなりました。
ko_kr: 이전의 클래스는 다른 index 들이 지정되지 않은 경우에는 ``state_preparation`` 의 마지막 큐비트를 기본값으로 사용했다는 점에 유의하여라. 이 기본값은 투명성을 개선하고 내재된 가정을 제거하기 위해 더 이상 존재하지 않는다.
pt_br: Note que a antiga classe usou o último qubit no ``state_preparation`` como padrão objetivo, se nenhum outro índice foi especificado. Este padrão não existe mais para melhorar a transparência e remover pressupostos implícitos.
ta_in: வேறு எந்த குறியீடுகளும் குறிப்பிடப்படவில்லை எனில், பழைய வகுப்பு ``state_preparation`` இல் உள்ள கடைசி க்யூபிட் முன்னிருப்பாக புறநிலை க்யூபிட்டாகப் பயன்படுத்தியது என்பதை நினைவில் கொள்க. வெளிப்படைத்தன்மையை மேம்படுத்துவதற்கும் மறைமுகமான அனுமானங்களை அகற்றுவதற்கும் இந்த இயல்புநிலை இனி இருக்காது.
tr_tr: Başka bir endeks belirtilmemişse, eski sınıfın "durum_hazırlığı"ndaki son kübiti varsayılan olarak nesnel kübit olarak kullandığını unutmayın. Bu varsayılan, şeffaflığı artırmak ve örtük varsayımları kaldırmak için artık mevcut değil.

source: To construct the circuit for amplitude estimation, we can do
es_un: Para construir el circuito para la estimación de amplitud, podemos hacer
fr_fr: Pour construire le circuit pour l'estimation de l'amplitude, on peut faire
ja_jp: 振幅推定回路を構築するには、次の手順を実行します。
ko_kr: 진폭 추정을 위한 회로를 구성하기 위하여, 우리는 다음과 같은 걸 할 수 있다
pt_br: Para construir o circuito para estimativa de amplitude, nós podemos fazer
ta_in: வீச்சு மதிப்பீட்டிற்கான சுற்றுவட்டத்தை உருவாக்க, நாம் செய்யலாம்
tr_tr: Genlik tahmini için devreyi kurmak için şunları yapabiliriz

source: Now that the problem is separated from the algorithm we can exchange ``AmplitudeEstimation`` with any other algorithm that implements the ``AmplitudeEstimator`` interface.
es_un: Ahora que el problema está separado del algoritmo, podemos intercambiar ``AmplitudeEstimation`` con cualquier otro algoritmo que implemente la interfaz ``AmplitudeEstimator``.
fr_fr: Maintenant que le problème est séparé de l'algorithme, nous pouvons échanger ``AmplitudeEstimation`` avec tout autre algorithme qui implémente l'interface``AmplitudeEstimator``.
ja_jp: これで、問題がアルゴリズムから分離されたので、``AmpliutudeEstimation`` インタフェースを実装する他のアルゴリズムと ``AmpliutudeEstimation`` を交換することができます。
ko_kr: 이제 해결하고자 하는 문제는 알고리즘과 분리되어, ``AmplitudeEstimation`` 을 ``AmplitudeEstimator`` 인터페이스를 구현하는 다른 알고리즘으로 대체할 수 있다.
pt_br: Agora que o problema está separado do algoritmo que podemos trocar ``AmplitudeEstimation`` com qualquer outro algoritmo que implemente a interface ``AmplitudeEstimator``.
ta_in: இப்போது சிக்கல் வழிமுறையிலிருந்து பிரிக்கப்பட்டுள்ளதால், ``AmplitudeEstimation`` ஐ வேறு எந்த வழிமுறையுடனும் பரிமாறிக் கொள்ளலாம், அது ``AmplitudeEstimator`` இடைமுகத்தை செயல்படுத்துகிறது.
tr_tr: Artık problem algoritmadan ayrıldığına göre, "Genlik Tahmini"ni "Genlik Tahmincisi" arayüzünü uygulayan diğer herhangi bir algoritma ile değiştirebiliriz.

source: Minimum eigenvalues
es_un: Valores propios mínimos
fr_fr: Valeurs propres minimales
ja_jp: 最小固有値
ko_kr: 최소 고윳값
pt_br: Autovalores mínimos
ta_in: குறைந்தபட்ச ஐகென்வேல்யூஸ்
tr_tr: Minimum Öz değerlikler

source: The interface remained mostly the same, but where previously it was possible to pass the operator in the initializer .
es_un: La interfaz permaneció prácticamente igual, pero donde anteriormente era posible pasar el operador en el inicializador.
fr_fr: L'interface est restée essentiellement la même, mais où il était auparavant possible de passer l'opérateur dans l'initialiseur.
ja_jp: インターフェイスはほぼ同じままですが、以前はinitializerで演算子を渡すことができました。
ko_kr: 인터페이스는 대부분 동일하게 유지되지만, 이전에는 초기화 함수에 연산자를 전달할 수 있었다.
pt_br: A interface permaneceu principalmente a mesma, mas onde anteriormente era possível passar o operador no inicializador .
ta_in: இடைமுகம் பெரும்பாலும் ஒரே மாதிரியாகவே இருந்தது, ஆனால் முன்பு துவக்கத்தில் ஆபரேட்டரை அனுப்ப முடிந்தது.
tr_tr: Arayüz çoğunlukla aynı kaldı, ancak daha önce operatörün başlatıcıya iletilmesinin mümkün olduğu yerlerde.

source: The operators must now be constructed with operators from ``qiskit.opflow`` instead of ``qiskit.aqua.operators``.
es_un: Los operadores ahora deben construirse con operadores de ``qiskit.opflow`` en lugar de ``qiskit.aqua.operators``.
fr_fr: Les opérateurs doivent à présent être construits avec des opérateurs de ``qiskit.opflow`` au lieu de ``qiskit.aqua.operators``.
ja_jp: 演算子は、 ``qiskit.aqua.operators`` ではなく ``qiskit.opflow`` の演算子を使用して構築する必要があります。
ko_kr: 연산자들은 이제 ``qiskit.aqua.operators`` 대신 ``qiskit.opflow`` 에 있는 것들로 구성되어야 한다.
pt_br: Os operadores devem agora ser construídos com operadores do ``qiskit.opflow`` ao invés do ``qiskit.aqua.operators``.
ta_in: ஆபரேட்டர்கள் இப்போது ``qiskit.aqua.operators`` க்கு பதிலாக ``qiskit.opflow`` இலிருந்து ஆபரேட்டர்களுடன் கட்டமைக்கப்பட வேண்டும்.
tr_tr: Operatörler artık "qiskit.aqua.operators" yerine "qiskit.opflow"dan operatörlerle oluşturulmalıdır.

source: The ``VQE`` argument ``var_form`` has been renamend to ``ansatz``.
es_un: El argumento ``var_form`` de ``VQE`` se ha cambiado a ``ansatz``.
fr_fr: L'argument ``var_form`` de ``VQE`` a été rebaptisé ``ansatz``.
ja_jp: ``VQE`` の引数の ``var_form`` は ``ansatz`` に名前が変更されました。
ko_kr: ``VQE`` 의 인수인 ``var_form`` 은 ``ansatz`` 로 이름이 바뀌었다.
pt_br: O argumento ``VQE`` ``var_form`` foi renomeado para ``ansatz``.
ta_in: ``VQE`` ஆர்கியுமென்ட்டான ``var_form``, ``ansatz`` ஆக மறுபெயரிடப்பட்டது.
tr_tr: ``VQE`` argümanı ``var_form`` ``ansatz`` olarak yeniden adlandırıldı.

source: Assume we want to find the minimum eigenvalue of
es_un: Supongamos que queremos encontrar el valor propio mínimo de
fr_fr: Supposons que nous voulons trouver la valeur propre minimale de
ja_jp: 以下の最小固有値を求めたいとします。
ko_kr: 다음의 최소 고윳값을 찾고 싶다고 가정하면
pt_br: Suponha que queremos encontrar o valor mínimo do auto valor de
ta_in: குறைந்தபட்ச ஐகென்வேல்யூவை நாம் கண்டுபிடிக்க விரும்புகிறோம் என்று வைத்துக் கொள்ளுங்கள்
tr_tr: Minimum özdeğerini bulmak istediğimizi varsayın

source: NumPy-based eigensolver
es_un: Solucionador propio basado en NumPy
fr_fr: Eigensolver basé sur NumPy
ja_jp: NumPyを使った固有値ソルバー
ko_kr: NumPy 기반 eigensolver
pt_br: Eigensolver NumPy-based
ta_in: NumPy-அடிப்படையிலான ஐகென்சால்வர்
tr_tr: NumPy tabanlı öz çözücü

source: Previously we imported the operators from ``qiskit.aqua.operators``:
es_un: Previamente importamos los operadores de ``qiskit.aqua.operators``:
fr_fr: Auparavant, nous importions les opérateurs de ``qiskit.aqua.operators``:
ja_jp: 以前は ``qiskit.aqua.operators`` から演算子をインポートし、
ko_kr: 이전에는 ``qiskit.aqua.operators`` 로부터 연산자들을 import 해왔다.
pt_br: Anteriormente importamos os operadores de ``qiskit.aqua.operators``:
ta_in: முன்பு நாங்கள் ஆபரேட்டர்களை இறக்குமதி செய்தோம் ``qiskit.aqua.operators``:
tr_tr: Daha önce operatörleri ``qiskit.aqua.operators``dan içe aktarmıştık:

source: and then solved for the minimum eigenvalue using
es_un: y luego resuelto para el valor propio mínimo usando
fr_fr: puis nous trouvions la valeur propre minimale en utilisant
ja_jp: そして、以下のようにして最小固有値を求めていました。
ko_kr: 그리고 최소 고윳값에 대해 다음을 사용하여 해결된다
pt_br: e depois resolvido para o eigenvalue mínimo usando
ta_in: பின்னர் குறைந்தபட்ச ஐகென்வேல்யூவைப் பயன்படுத்தி தீர்க்கப்படும்
tr_tr: ve daha sonra kullanılarak, minimum özdeğer için çözüldü

source: It used to be possible to pass the observable in the initializer, which is now not allowed anymore due to the problem-algorithm separation.
es_un: Solía ser posible pasar el observable al inicializador, que ahora ya no está permitido debido a la separación problema-algoritmo.
fr_fr: Il était possible de transmettre l'observable dans l'initialiseur, ce qui n'est plus autorisé maintenant en raison de la séparation de l'algorithme du problème.
ja_jp: 以前は initializerでオブザーバブルを渡すことが可能でしたが、問題とアルゴリズムの分離のために現在は許可されていません。
ko_kr: 이전에는 초기 설정자에 observable을 넘겨줄 수 있었지만, 문제-알고리즘 분리로 인해 해당 동작은 더 이상 허용되지 않는다.
pt_br: Costumava ser possível passar o observável no inicializador, o que agora não é mais permitido devido à separação de problemas-algoritmo.
ta_in: துவக்கத்தில் காணக்கூடியதை கடந்து செல்ல இது பயன்படுகிறது, இது சிக்கல்-வழிமுறை பிரிப்பு காரணமாக இப்போது அனுமதிக்கப்படாது.
tr_tr: Önceden, problem-algoritma ayrımı nedeniyle artık izin verilmeyen başlatıcıda gözlemlenebiliri iletmek mümkündü.

source: Now we need to import from ``qiskit.opflow`` but the other syntax remains exactly the same:
es_un: Ahora necesitamos importar desde ``qiskit.opflow`` pero la otra sintaxis sigue siendo exactamente la misma:
fr_fr: Maintenant nous devons importer depuis ``qiskit.opflow`` mais le reste de la syntaxe reste exactement la même:
ja_jp: ``qiskit.opflow`` からインポートする必要がありますが、他の構文はまったく同じです。
ko_kr: 이제는 ``qiskit.opflow`` 에서 import 해야 하지만 다른 구문은 정확히 동일하다:
pt_br: Agora precisamos importar de ``qiskit.opflow`` mas a outra sintaxe permanece exatamente a mesma:
ta_in: இப்போது நாம் ``qiskit.opflow`` இலிருந்து இறக்குமதி செய்ய வேண்டும், ஆனால் மற்ற தொடரியல் அப்படியே உள்ளது:
tr_tr: Şimdi ``qiskit.opflow`` dosyasından içe aktarmamız gerekiyor, ancak diğer sözdizimi tamamen aynı kalır:

source: The same changes hold for VQE. Let’s use the ``RealAmplitudes`` circuit as ansatz:
es_un: Los mismos cambios son válidos para VQE. Usemos el circuito ``RealAmplitudes`` como ansatz:
fr_fr: Les mêmes changements s'appliquent à VQE. Prenons le circuit ``RealAmplitudes`` en tant que ansatz :
ja_jp: 同じ変更がVQEにも当てはまります。 ``RealAmplitudes`` 回路をansatzとして使用しましょう。
ko_kr: VQE에 대해 동일한 변경이 유지된다. ``RealAmplitudes`` 회로를 사용해 보자:
pt_br: As mesmas alterações aplicam-se para o VQE. Vamos usar o circuito ``RealAmplitudes`` como ansatz:
ta_in: அதே மாற்றங்கள் VQE க்கும் உள்ளன. ``RealAmplitudes`` சர்க்யூட்க்கு அன்சாட்ஸாகப் பயன்படுத்தலாம்:
tr_tr: Aynı değişiklikler VQE için de geçerli olur. "RealAmplitudes `" devresini "ansatz" olarak kullanalım:

source: Previously, we had to import both the optimizer and operators from Qiskit Aqua:
es_un: Anteriormente, teníamos que importar tanto el optimizador como los operadores de Qiskit Aqua:
fr_fr: Auparavant, nous devions importer à la fois l'optimiseur et les opérateurs de Qiskit Aqua:
ja_jp: 以前は、optimizerとoperatorの両方をQiskit Aquaからインポートする必要がありました。
ko_kr: 이전에는 Qiskit Aqua 에서 옵티마이저와 연산자를 모두 임포트해야 했다:
pt_br: Anteriormente, tivemos que importar tanto o otimizador quanto os operadores do Qiskit Aqua:
ta_in: முன்னதாக, Qiskit அக்வாவிலிருந்து ஆப்டிமைசர் மற்றும் ஆபரேட்டர்கள் இரண்டையும் இறக்குமதி செய்ய வேண்டியிருந்தது:
tr_tr: Önceden, hem optimize ediciyi hem de operatörleri Qiskit Aqua'dan içe aktarmamız gerekiyordu:

source: Now we import optimizers from ``qiskit.algorithms.optimizers`` and operators from ``qiskit.opflow``.
es_un: Ahora importamos los optimizadores de ``qiskit.algorithms.optimizers`` y los operadores de ``qiskit.opflow``.
fr_fr: Maintenant, nous importons des optimiseurs de ``qiskit.algorithms.optimizers`` et des opérateurs de ``qiskit.opflow``.
ja_jp: 現在は、 ``qiskit.algorithms.optimizers`` から optimizerをインポートし、 ``qiskit.opflow`` からoperatorをインポートします。
ko_kr: 이제 ``qiskit.algorithms.optimizers`` 로부터 옵티마이저를, ``qiskit.opflow`` 로부터 연산자를 가져온다.
pt_br: Agora importamos otimizadores de ``qiskit.algorithms.optimizers`` e operadores de ``qiskit.opflow``.
ta_in: இப்போது ``qiskit.algorithms.optimizers`` மற்றும் ஆபரேட்டர்கள் ``qiskit.opflow`` இலிருந்து ஆப்டிமைசர்களை இறக்குமதி செய்கிறோம்.
tr_tr: Şimdi optimize edicileri ``qiskit.algorithms.optimizers``dan ve operatörleri ``qiskit.opflow``dan içe aktarıyoruz.

source: Note that the ``qiskit.aqua.components.variational_forms`` are completely deprecated in favor of circuit objects. Most variational forms have already been ported to circuit library in previous releases and now also ``UCCSD`` is part of the Qiskit Nature’s circuit library:
es_un: Ten en cuenta que ``qiskit.aqua.components.variational_forms`` están completamente en desuso a favor de los objetos de circuito. La mayoría de las formas variacionales ya se han trasladado a la librería de circuitos en versiones anteriores y ahora también ``UCCSD`` es parte de la librería de circuitos de Qiskit Nature:
fr_fr: Notez que ``qiskit.aqua.components.variational_forms`` est entièrement déprécié en faveur des objets de circuit. La plupart des formes variationnelles ont déjà été portées vers la bibliothèque de circuits dans les versions précédentes et à présent ``UCCSD`` fait également partie de la bibliothèque de circuits de Qiskit Nature :
ja_jp: ``qiskit.aqua.components.variational_forms`` は完全に非推奨になり、circuitオブジェクトが優先されることに注意してください。ほとんどの変分形式は、以前のリリースですでにcircuitライブラリーに移植されており、 ``UCCSD`` もQiskit Natureのcircuit ライブラリーの一部になっています。
ko_kr: ``qiskit.aqua.components.variational_forms``은 회로 오브젝트를 위해 완전히 사용되지 않는다는 점에 유의하여라. 대부분의 변형된 형태는 이미 이전 릴리즈에서 회로 라이브러리로 이식되었으며 현재는 "UCCSD" 가 Qiskit 네이처의 회로 라이브러리의 일부이기도 하다:
pt_br: Observe que o ``qiskit.aqua.components.variational_forms`` está completamente obsoleto em favor de objetos de circuito. A maioria das formas variacionais já foi portada para a biblioteca de circuitos em versões anteriores e agora também ``UCCSD`` faz parte da biblioteca de circuitos da Qiskit Nature:
ta_in: சர்க்யூட் ஆப்ஜெக்ட்களுக்கு ஆதரவாக ``qiskit.aqua.components.variational_forms`` முற்றிலும் நீக்கப்பட்டது என்பதை நினைவில் கொள்க. முந்தைய வெளியீடுகளில் பெரும்பாலான மாறுபட்ட வடிவங்கள் ஏற்கனவே சர்க்யூட் நூலகத்திற்கு அனுப்பப்பட்டுள்ளன, இப்போது ``UCCSD`` என்பது Qiskit நேச்சரின் சர்க்யூட் நூலகத்தின் ஒரு பகுதியாகும்:
tr_tr: ``qiskit.aqua.components.variational_forms`` devre nesneleri lehine tamamen kullanımdan kaldırıldığını unutmayın. Çoğu varyasyon formu, önceki sürümlerde devre kitaplığına taşınmıştır ve şimdi "UCCSD" de Qiskit Nature'ın devre kitaplığının bir parçasıdır:
