Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/aqua_tutorials/Qiskit Algorithms Migration Guide.po
Languages: es_un, fr_fr, ja_jp, ko_kr, pt_br, ta_in, tr_tr

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/aqua_Qiskit Algorithms Migration Guide.ipynb>`_.
fr_fr: Exécuter en mode interactif depuis `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/aqua_Qiskit Algorithms Migration Guide.ipynb>` _.
ta_in: இயக்குநிலை தொடர்புக்கு `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/aqua_Qiskit Algorithms Migration Guide.ipynb>`_.

source: Grover
ta_in: குரோவர்
