Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/aqua_tutorials/Qiskit Algorithms Migration Guide.po
Languages: es_un, fr_fr, ja_jp, ko_kr, pt_br, ta_in, tr_tr

source: This page was generated from `aqua_tutorials/Qiskit Algorithms Migration Guide.ipynb`__.
es_un: Esta página fue generada a partir de `aqua_tutorials/Qiskit Algorithms Migration Guide.ipynb`__.
fr_fr: Cette page a été générée à partir de `aqua_tutorials/Qiskit Algorithms Migration Guide.ipynb`__.
ja_jp: このページは `aqua_tutorials/Qiskit Algorithms Migration Guide.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `aqua_tutorials/Qiskit Algorithms Migration Guide.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada a partir de `aqua_tutorials/Qiskit Algorithms Migration Guide.ipynb`__.
ta_in: இந்த பக்கம் `aqua_tutorials/Qiskit Algorithms Migration Guide.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
tr_tr: Bu sayfa `aqua_tutorials/Qiskit Algorithms Migration Guide.ipynb`__ adresinden oluşturulmuştur.

source: Qiskit Algorithms Migration Guide
es_un: Guía de Migración de Qiskit Aqua
fr_fr: Guide de migration Qiskit Aqua
ja_jp: Qiskit Algorithms 移行ガイド
ko_kr: Qiskit 알고리즘 마이그레이션 가이드
pt_br: Guia de Migração dos algoritmos do Qiskit
ta_in: Qiskit வழிமுறைகள் இடம்பெயர்வு வழிகாட்டி
tr_tr: Qiskit Algoritmaları Geçiş Kılavuzu

source: **Restructuring the applications**
es_un: **Reestructurando las aplicaciones**
fr_fr: **Restructuration des applications**
ja_jp: **アプリケーションの再構築**
ko_kr: **애플리케이션 재구성**
pt_br: **Reestruturando os aplicativos**
ta_in: **பயன்பாடுகளை மறுசீரமைத்தல்**
tr_tr: **Uygulamaların yeniden yapılandırılması**

source: The Qiskit 0.25.0 release includes a restructuring of the applications and algorithms. What previously has been referred to as Qiskit Aqua, the single applications and algorithms module of Qiskit, is now split into dedicated application modules for Optimization, Finance, Machine Learning and Nature (including Physics & Chemistry). The core algorithms and opflow operator functionality are moved to Qiskit Terra.
es_un: La versión 0.25.0 de Qiskit incluye una restructuración de las aplicaciones y algoritmos. A lo que antes se le llamaba Qiskit Aqua, el módulo único de aplicaciones y algoritmos de Qiskit, ahora esta separado en módulos de aplicaciones dedicados a Optimización, Finanzas, Aprendizaje de Máquina y Naturaleza (que incluye Física y Química). Los algoritmos centrales y la función del operador opflow han sido trasladados a Qiskit Terra.
fr_fr: La version 0.25.0 de Qiskit comprend une restructuration des applications et des algorithmes. Ce qui a déjà été désigné sous le nom de Qiskit Aqua, le module d'applications et d'algorithmes unique de Qiskit, est maintenant divisé en modules d'applications dédiés à l'Optimisation, les Finances, l'Apprentissage Automatique et la Nature (comprenant la physique et la chimie). Les algorithmes de base et la fonctionnalité de l'opérateur opflow sont déplacés vers Qiskit Terra.
ja_jp: Qiskit 0.25.0 releaseには、アプリケーションとアルゴリズムの再構築が含まれています。 Qiskit Aqua、Qiskitの単一のアプリケーションとアルゴリズムモジュールと呼ばれていたものが、現在、 Optimization、Finance、Machine Learning、Nature (Physics と Chemistryを含む)専用アプリケーション・モジュールに分割されています。 コア・アルゴリズムと opflow オペレーターの機能は Qiskit Terra に移動しました。
ko_kr: Qiskit 0.25.0 릴리즈에는 애플리케이션 및 알고리즘의 재구성이 포함되어 있다. Qiskit Aqua라고 명명했던 Qiskit의 단일 애플리케이션 및 알고리즘 모듈은 이제 최적화, 재무, 기계 학습 및 자연 (물리 및 화학 포함) 을 위한 전용 애플리케이션 모듈로 분할된다. 코어 알고리즘 및 opflow 연산자 기능은 Qiskit Terra로 이동된다.
pt_br: A release do Qiskit 0.25.0 inclui uma reestruturação dos aplicativos e algoritmos. O que anteriormente foi referido como Qiskit Aqua, o módulo único de aplicações e algoritmos do Qiskit, está agora dividido em módulos de aplicação dedicados para Otimização, Finanças, Machine Learning (Aprendizagem Automática) e Natureza (incluindo Física e Química). As funcionalidades principais de algoritmos e operador opflow foram movidas para o Qiskit Terra.
ta_in: Qiskit 0.25.0 வெளியீட்டில் பயன்பாடுகள் மற்றும் வழிமுறைகளின் மறுசீரமைப்பு அடங்கும். முன்பு Qiskit அக்வா என குறிப்பிடப்பட்டவை, Qiskit-டின் ஒற்றை பயன்பாடுகள் மற்றும் வழிமுறைகள் தொகுதி, இப்போது உகப்பாக்கம், நிதி, இயந்திர கற்றல் மற்றும் இயற்கை (இயற்பியல் மற்றும் வேதியியல் உட்பட) ஆகியவற்றிற்கான பிரத்யேக பயன்பாட்டு தொகுதிகளாக பிரிக்கப்பட்டுள்ளது. முக்கிய வழிமுறைகள் மற்றும் ஆப்ஃப்ளோ ஆபரேட்டர் செயல்பாடு Qiskit டெர்ராவுக்கு நகர்த்தப்படுகின்றன.
tr_tr: Qiskit 0.25.0 sürümü, uygulamaların ve algoritmaların yeniden yapılandırılmasını içerir. Daha önce Qiskit Aqua olarak adlandırılan, Qiskit'in tek uygulamalar ve algoritmalar modülü, şimdi Optimizasyon, Finans, Makine Öğrenimi ve Doğa (Fizik ve Kimya dahil) için özel uygulama modüllerine bölünmüştür. Çekirdek algoritmalar ve opflow operatörü işlevselliği Qiskit Terra'ya taşındı.

source: **Algorithm interfaces**
es_un: **Interfaces de los algoritmos**
fr_fr: **Interfaces algorithmiques**
ja_jp: **アルゴリズム・インターフェース**
ko_kr: **알고리즘 인터페이스들**
pt_br: **Interface de algoritmos**
ta_in: **அல்காரிதம் இடைமுகங்கள்**
tr_tr: **Algoritma arayüzleri**

source: Additionally to the restructuring, all algorithms follow a new unified paradigm: algorithms are classified according to the problems they solve, and within one application class algorithms can be used interchangeably to solve the same problem. This means that, unlike before, algorithm instances are decoupled from the problem they solve. We can summarize this in a flowchart:
es_un: Además de la restructuración, los algoritmos siguen un nuevo paradigma unificado: los algoritmos son clasificados de acuerdo a los problemas que resuelven y dentro de una clase de aplicaciones, los algoritmos pueden ser utilizados de manera intercambiable para resolver el mismo problema. Esto significa que, a diferencia de antes, las instancias de algoritmos están desacopladas de los problemas que resuelven. Podemos resumir esto en un diagrama de flujo:
fr_fr: En plus de la restructuration, tous les algorithmes suivent un nouveau paradigme unifié : les algorithmes sont classés en fonction des problèmes qu'ils résolvent, et au sein d'une même classe d'applications, les algorithmes peuvent être utilisés de manière interchangeable pour résoudre le même problème. Cela signifie que, contrairement à avant, les instances d'algorithme sont découplées du problème qu'elles résolvent. Nous pouvons résumer ceci dans un diagramme:
ja_jp: 再構築に加えて、すべてのアルゴリズムは新しい統一されたパラダイムに従います。アルゴリズムは、解決する問題に従って分類され、1つのアプリケーションクラス内で、アルゴリズムを交換して使用して同じ問題を解決できます。これは、以前とは異なり、アルゴリズムインスタンスが解決する問題から切り離されていることを意味します。 これをフローチャートに要約できます。
ko_kr: 또한, 모든 알고리즘은 새로운 통합 패러다임을 따른다: 알고리즘은 그들이 해결하는 문제에 따라 분류되며, 하나의 애플리케이션 클래스 알고리즘 내에서는 동일한 문제를 해결하기 위해 상호 교환적으로 사용될 수 있다. 이는 이전과 달리 알고리즘 인스턴스가 해결하는 문제점과 분리되어 있음을 의미한다. 이를 플로우차트에서 요약할 수 있다.
pt_br: Adicionalmente à reestruturação, todos os algoritmos seguem um novo paradigma unificado: os algoritmos são classificados de acordo com os problemas que eles resolvem e, dentro de uma classe de aplicações para algoritmos, podem ser usados de forma intercambiável para resolver o mesmo problema. Isso significa que, ao contrário de antes, as instâncias de algoritmo são dissociadas do problema que resolvem. Podemos resumir isso em um fluxograma:
ta_in: மறுசீரமைப்பிற்கு கூடுதலாக, அனைத்து வழிமுறைகளும் ஒரு புதிய ஒருங்கிணைந்த முன்னுதாரணத்தைப் பின்பற்றுகின்றன: வழிமுறைகள் அவை தீர்க்கும் சிக்கல்களுக்கு ஏற்ப வகைப்படுத்தப்படுகின்றன, மேலும் ஒரு பயன்பாட்டு வகுப்பு வழிமுறைகள் ஒரே சிக்கலைத் தீர்க்க மாறி மாறிப் பயன்படுத்தலாம். இதன் பொருள், முன்பு போலல்லாமல், வழிமுறை நிகழ்வுகள் அவை தீர்க்கும் சிக்கலில் இருந்து துண்டிக்கப்படுகின்றன. இதை ஒரு வரைபடத்தில் சுருக்கமாகக் கூறலாம்:
tr_tr: Yeniden yapılandırmaya ek olarak, tüm algoritmalar yeni bir birleşik paradigmayı takip eder: algoritmalar çözdüğü problemlere göre sınıflandırılır ve bir uygulama sınıfı içinde aynı problemi çözmek için algoritmalar birbirinin yerine kullanılabilir. Bu, öncekinden farklı olarak, algoritma örneklerinin çözdüğü problemden ayrıldığı anlamına gelir. Bunu bir akış şemasında özetleyebiliriz:

source: For example, the variational quantum eigensolver, ``VQE`` is a ``MinimumEigensolver`` as it computes the minimum eigenvalue of an operator. The problem here is specified with the operator, whose eigenvalue we seek, while properties such as the variational ansatz circuit and classical optimizer are properties of the algorithm. That means the ``VQE`` has the following structure
es_un: Por ejemplo, el solucionador propio variacional cuántico (variational quantum eigensolver), ``VQE`` es un ``MinimumEigensolver`` ya que calcula el valor propio mínimo de un operador. El problema aquí es especificado con el operador, cuyos valores propios buscamos, mientras que propiedades como el circuito variacional ansatz y el optimizador son propiedades del algoritmo. Esto significa que ``VQE`` tiene la siguiente estructura
fr_fr: Par exemple, l'eigensolver quantique variationnel, ``VQE`` est un ``MinimumEigensolver`` car il calcule la valeur propre minimale d'un opérateur. Le problème ici est spécifié avec l'opérateur, dont nous recherchons la valeur propre, alors que les propriétés telles que le circuit variationnel ansatz et l'optimiseur classique sont des propriétés de l'algorithme. Cela signifie que le ``VQE`` a la structure suivante
ja_jp: 例えば、変分量子固有ソルバーである ``VQE`` は、演算子の最小固有値を計算する ``MinimumEigensolver`` です。 ここでの問題は、固有値を求める演算子で指定されますが、変分ansatz回路や古典オプティマイザーなどのプロパティはアルゴリズムのプロパティです。 つまり、 ``VQE`` の構造は次のとおりです。
ko_kr: 예를 들어, 변형 양자 고윳값 알고리즘인 ``VQE`` 는 연산자의 최소한의 고윳값을 계산하기 때문에 ``MinimumEigensolver`` 이다. 한편 변형 ansatz 회로나 전통적인 최적화기(optimizer) 같은 특성들은 알고리즘의 특성들을 내포하기에 여기서 연산자의 고윳값을 찾는 것은 문제로 명시된다. 즉 ``VQE`` 는 다음과 같은 구조를 가지고 있다.
pt_br: Por exemplo, o eigensolver quântico variacional, ``VQE`` é um ``MinimumEigensolver`` uma vez que computa o eigenvalue mínimo de um operador. O problema aqui é especificado com o operador, cujo eigenvalue buscamos, enquanto propriedades como circuito variacional de ansatz e o otimizador clássico são propriedades do algoritmo. Isso significa que o ``VQE`` tem a seguinte estrutura
ta_in: எடுத்துக்காட்டாக, மாறுபட்ட குவாண்டம் ஐகென்சால்வர், ``VQE`` என்பது ஒரு ஆபரேட்டரின் குறைந்தபட்ச ஐகென்வேல்யூவைக் கணக்கிடுகையில் ``MinimumEigensolver`` ஆகும். இங்கே சிக்கல் ஆபரேட்டருடன் குறிப்பிடப்பட்டுள்ளது, அதன் ஐகென்வேல்யூவை நாங்கள் தேடுகிறோம், அதே நேரத்தில் மாறுபட்ட அன்சாட்ஸ் சர்க்யூட் மற்றும் கிளாசிக்கல் ஆப்டிமைசர் போன்ற பண்புகள் வழிமுறையின் பண்புகள். அதாவது ``VQE`` பின்வரும் கட்டமைப்பைக் கொண்டுள்ளது
tr_tr: Örneğin, değişken kuantum özçözücü, "VQE", bir operatörün minimum özdeğerini hesapladığı için bir "Minimum Özçözücü"dür. Buradaki problem, özdeğerini aradığımız operatör ile belirtilirken, varyasyonel yaklaşım devresi ve klasik optimizer gibi özellikler algoritmanın özellikleridir. Bu, "VQE"nin aşağıdaki yapıya sahip olduğu anlamına gelir

source: We can exchange the ``VQE`` with any other algorithm that implements the ``MinimumEigensolver`` interface to compute the eigenvalues of your operator, e.g.
es_un: Podemos intercambiar el ``VQE`` con cualquier otro algoritmo que implemente la interface ``MinimumEigensolver`` para calcular los valores propios de tu operador, por ejemplo,
fr_fr: Nous pouvons échanger le ``VQE`` avec tout autre algorithme qui implémente l'interface ``MinimumEigensolver`` pour calculer les valeurs propres de votre opérateur, par exemple.
ja_jp: ``VQE`` を、 ``MinimumEigensolver`` インターフェースを実装する他のアルゴリズムと交換して、以下のように演算子の固有値を計算できます。
ko_kr: 연산자의 고윳값을 계산하기 위해 우리는 ``VQE`` 알고리즘을 ``MinimumEigensolver`` 인터페이스를 구현하는 다른 알고리즘으로 대체할 수 있다. 예를 들어,
pt_br: Podemos trocar o ``VQE`` com qualquer outro algoritmo que implemente a interface ``MinimumEigensolver`` para calcular os eigenvalues (auto valor) do seu operador, por exemplo
ta_in: உங்கள் ஆபரேட்டரின் சமமான மதிப்புகளைக் கணக்கிடுவதற்கு ``MinimumEigensolver`` இடைமுகத்தை செயல்படுத்தும் வேறு எந்த வழிமுறையுடனும் ``VQE`` ஐ பரிமாறிக்கொள்ளலாம், எ.கா.
tr_tr: Operatörünüzün özdeğerlerini hesaplamak için "MinimumEigensolver" arayüzünü uygulayan diğer herhangi bir algoritma ile "VQE"yi değiştirebiliriz, örneğin

source: This allows you to easily switch between different algorithms, check against classical references, and provide your own implementation :math:`-` you just have to implement the existing interface.
es_un: Esto te permite cambiar entre algoritmos fácilmente, comparar con referencias clásicas y proporcionar tu propia implementación :math:`-` solo necesitas implementar la interface existente.
fr_fr: Cela vous permet de basculer facilement entre différents algorithmes, de vérifier les références classiques et de fournir votre propre implémentation :math:`-" vous n'avez qu'à implémenter l'interface existante.
ja_jp: これにより、さまざまなアルゴリズムを簡単に切り替えたり、古典的手法を照合し、独自の実装を提供したりできます。つまり、既存のインターフェイスを実装するだけです。
ko_kr: 이를 통해 서로 다른 알고리즘 간에 쉽게 전환하고, 전통적인 레퍼런스들과 비교하고, 자체적으로 구현한 것을 제공할 수도 있다 :math:`-` 기존 인터페이스를 구현하기만 하면 된다.
pt_br: Isso permite alternar facilmente entre algoritmos diferentes, comparar com as referências clássicas e fornecer sua própria implementação :math:`-` você apenas tem que implementar a interface existente.
ta_in: இது வெவ்வேறு வழிமுறைகளுக்கு இடையில் எளிதாக மாறவும், கிளாசிக்கல் குறிப்புகளுக்கு எதிராக சரிபார்க்கவும், உங்கள் சொந்த செயலாக்கத்தை வழங்கவும் உங்களை அனுமதிக்கிறது :math:`-` நீங்கள் ஏற்கனவே இருக்கும் இடைமுகத்தை செயல்படுத்த வேண்டும்.
tr_tr: Bu, farklı algoritmalar arasında kolayca geçiş yapmanıza, klasik referansları kontrol etmenize ve kendi uygulamanızı sağlamanıza izin verir :math:`-` sadece mevcut arayüzü uygulamanız yeterlidir.

source: This notebook serves as migration guide to facilitate changing your current code using Qiskit Aqua to the new structure.
es_un: Este cuaderno sirve como una guía de migración para facilitar el cambio de tu código actual, que utiliza Qiskit Aqua, a la nueva estructura.
fr_fr: Ce bloc-notes sert de guide de migration pour faciliter la modification de votre code actuel en utilisant Qiskit Aqua dans la nouvelle structure.
ja_jp: このノートブックは、Qiskit Aquaを使用したコードを新しい構造に簡単に変更するための移行ガイドです。
ko_kr: 이 노트북은 Qiskit Aqua를 사용하여 현재 코드를 새로운 구조로 변경하는 데 도움이 되는 마이그레이션 가이드 역할을 한다.
pt_br: Este notebook serve como guia de migração para facilitar a mudança do seu código atual usando Qiskit Aqua para a nova estrutura.
ta_in: Qiskit அக்வாவைப் பயன்படுத்தி உங்கள் தற்போதைய குறியீட்டை புதிய கட்டமைப்பிற்கு மாற்றுவதற்கு இந்த நோட்புக் இடம்பெயர்வு வழிகாட்டியாக செயல்படுகிறது.
tr_tr: Bu not defteri Qiskit Aqua kullanarak mevcut kodunuzu yeni yapıya dönüştürmeyi kolaylaştırmak için geçiş kılavuzu olarak hizmet eder.

source: We’re disabling deprecation warning for this notebook so you won’t see any when we instantiate an object from ``qiskit.aqua``. Note though, that the entire package is deprecated and will emit a warning like the following:
es_un: Deshabilitamos la advertencia de obsoletización para este cuaderno para que no las veas cuando instanciemos un objeto desde ``qiskit.aqua``. Sin embargo, toma en cuenta que el paquete entero está obsoleto y va a emitir una advertencia como la siguiente:
fr_fr: Nous désactivons l'avertissement d'obsolescence pour ce bloc-notes pour que vous ne le voyiez pas quand nous instancions un objet de ``qiskit.aqua``. Notez cependant que le paquet entier est obsolète et émettera un avertissement comme suit :
ja_jp: このノートブックでは、非推奨の警告を無効にしているため、 ``qiskit.aqua`` からオブジェクトをインスタンス化したときに何も表示されません。ただし、パッケージ全体が非推奨で、次のような警告が表示されることに注意してください。
ko_kr: 이 노트북에서는 ``qiskit.aqua`` 에서 오브젝트를 인스턴스화할 때 아무 것도 보이지 않도록 하기 위해 이 노트북에 대한 경고를 비활성화한다. 하지만 전체 패키지가 더 이상 사용되지 않으며 다음과 같은 경고가 생성될 것이라는 걸 알아두어라:
pt_br: Estamos desativando o aviso de depreciação para este notebook e você não verá nenhum quando instanciarmos um objeto de ``qiskit. qua``. No entanto, observe que o pacote inteiro está obsoleto e emitirá um aviso como o seguinte:
ta_in: இந்த நோட்புக்கிற்கான நீக்குதல் எச்சரிக்கையை நாங்கள் முடக்குகிறோம், எனவே ``qiskit.aqua`` இலிருந்து ஒரு பொருளை உடனடியாக நிறுவும்போது நீங்கள் எதையும் பார்க்க மாட்டீர்கள். இருப்பினும், முழு தொகுப்பும் நீக்கப்பட்டது மற்றும் பின்வருவது போன்ற எச்சரிக்கையை வெளியிடும் என்பதை நினைவில் கொள்க:
tr_tr: Bu not defteri için kullanımdan kaldırma uyarısını devre dışı bırakıyoruz, böylece ``qiskit.aqua``dan bir nesne başlattığımızda hiçbir şey görmeyeceksiniz. Ancak, paketin tamamının kullanımdan kaldırıldığını ve aşağıdaki gibi bir uyarı vereceğini unutmayın:

source: The ``QuantumInstance`` moved the import location from
es_un: La ``QuantumInstance`` ha cambiado la ubicación de importación desde
fr_fr: ``QuantumInstance`` a déplacé l'emplacement d'importation à partir de
ja_jp: ``QuantumInstance`` はインポートするところを次の場所から
ko_kr: ``QuantumInstance`` 는 import 하는 위치가 옮겨졌다.
pt_br: A ``QuantumInstance`` moveu o local de importação de
ta_in: ``QuantumInstance`` இறக்குமதி இருப்பிடத்திலிருந்து நகர்த்தப்பட்டது
tr_tr: ``QuantumInstance``, içe aktarma konumunu

source: to
es_un: a
fr_fr: vers
ja_jp: 以下へ移動しました。
ko_kr: 에서
pt_br: para
tr_tr: için

source: **Previously:**
es_un: **Anteriormente:**
fr_fr: **Précédemment :**
ja_jp: **以前のコード:**
ko_kr: **과거:**
pt_br: **Anteriormente:**
ta_in: **முன்பு:**
tr_tr: **Öncesinde**

source: **New:**
es_un: **Nuevo:**
fr_fr: **Maintenant.**
ja_jp: **新コード:**
ko_kr: **현재:**
pt_br: **Novo:**
ta_in: **புதியது:**
tr_tr: ** Yeni:**

source: Operators
es_un: Operadores
fr_fr: Opérateurs
ko_kr: 연산자들
pt_br: Operadores
ta_in: ஆபரேட்டர்கள்
tr_tr: Operatörler

source: The Opflow operators moved from
es_un: Los operadores de Opflow se han movido desde
fr_fr: Les opérateurs Opflow sont passés de
ja_jp: Opflow 演算子は以下から
ko_kr: Opflow 연산자는 다음에서 이동했다
pt_br: Os operadores do Opflow movidos de
ta_in: ஒப்ஃப்ளோ ஆபரேட்டர்கள் நகர்ந்தனர்
tr_tr: Taşınan Opflow operatörleri

source: **Additional features:**
es_un: **Características adicionales:**
fr_fr: **Fonctionnalités supplémentaires.**
ja_jp: **追加機能:**
ko_kr: **추가 기능들:**
pt_br: **Recursos adicionais**
ta_in: **கூடுதல் அம்சங்கள்:**
tr_tr: **Ek özellikler:**

source: With ``qiskit.opflow`` we introduce a new, more efficient representation of sums of Pauli strings, which can significantly speed up computations on very large sums of Paulis. This efficient representation is automatically used if Pauli strings are summed:
es_un: Con ``qiskit.opflow`` introducimos una representación nueva y más eficiente de las sumas de cadenas de Pauli, las cuales pueden acelerar significativamente los cálculos en sumas de Paulis muy grandes. Esta representación eficiente es utilizada automáticamente si las cadenas de Pauli son sumadas:
fr_fr: Avec ``qiskit.opflow`` nous introduisons une nouvelle représentation plus efficace des sommes de chaines de Pauli, ce qui peut considérablement accélérer les calculs sur des sommes très importantes de Paulis. Cette représentation efficace est automatiquement utilisée si les chaînes de Pauli sont additionnées:
ja_jp: ``qiskit.opflow`` を使用して、Pauli stringの和の新しい、より効率的な表現を導入します。これにより、非常に大きなPauliの合計の計算を大幅に高速化できます。 この効率的な表現は、Pauli stringの和が取られた場合に自動的に使われます。
ko_kr: ``qiskit.opflow`` 를 통해 Pauli 스트링의 합계를 새롭고 보다 효율적으로 표현할 수 있게 되었는데, 이는 엄청나게 큰 Pauli 스트링의 합계를 계산하는 속도를 상당히 단축시킬 수 있다. 이 효율적인 표현은 파울리 문자열이 합산되는 경우 자동으로 사용된다.
pt_br: Com ``qiskit.opflow`` nós apresentamos uma nova e mais eficiente representação de somas de Pauli strings, que pode acelerar significativamente os cálculos em somas muito grandes de Paulis. Esta representação eficiente é usada automaticamente se as strings de Pauli forem calculadas:
ta_in: ``Qiskit.opflow`` உடன், Pauli ஸ்ட்ரிங்களின் தொகைகளின் புதிய, திறமையான பிரதிநிதித்துவத்தை நாங்கள் அறிமுகப்படுத்துகிறோம், இது Paulis-ன் மிகப் பெரிய தொகைகளில் கணக்கீடுகளை கணிசமாக விரைவுபடுத்துகிறது. Pauli ஸ்ட்ரிங்களை சுருக்கமாகக் கூறினால் இந்த திறமையான பிரதிநிதித்துவம் தானாகவே பயன்படுத்தப்படுகிறது:
tr_tr: ``qiskit.opflow`` ile, Pauli dizilerinin toplamlarının yeni ve daha verimli bir temsiliyle tanışıyoruz; bu, çok büyük Paulis toplamları üzerindeki hesaplamaları önemli ölçüde hızlandırabilir. Pauli karakter dizeleri toplanırsa, bu verimli gösterim otomatik olarak kullanılır:

source: Optimizers
es_un: Optimizadores
fr_fr: Optimiseurs
ko_kr: 최적화 도구들
pt_br: Otimizadores
ta_in: ஆப்டிமைசெர்
tr_tr: Optimize ediciler

source: The classical optimization routines changed locations from
es_un: Las rutinas de optimización clásica han cambiado de ubicación, desde
fr_fr: Les routines d'optimisation classiques ont changé d'emplacement de
ja_jp: 古典的な最適化ルーチンの場所は以下から
ko_kr: 고전적인 최적화 루틴은 위치가 변경되었다
pt_br: As rotinas de otimização clássica mudaram de local de
ta_in: கிளாசிக்கல் தேர்வுமுறை நடைமுறைகள் இருப்பிடங்களை மாற்றின
tr_tr: Klasik optimizasyon rutinleri yerleri değiştirdi

source: Summary
es_un: Resumen
fr_fr: En résumé
ja_jp: 概要
ko_kr: 요약
pt_br: Resumo
ta_in: சுருக்கம்
tr_tr: Özet

source: The previous structure
es_un: La estructura anterior
fr_fr: La structure précédente
ja_jp: 以前の構造
ko_kr: 이전 구조
pt_br: A estrutura anterior
ta_in: முந்தைய அமைப்பு
tr_tr: Önceki yapı

source: is changed to split problem/oracle settings and algorithm settings, to
es_un: se cambia para dividir las configuraciones de problemas/oráculos y de algoritmo, a
fr_fr: est modifié pour séparer les paramètres du problème/oracle et les paramètres de l'algorithme, à
ja_jp: は、問題/オラクルの設定とアルゴリズムの設定に変更されます。
ko_kr: 는 문제 및 오라클 설정과 알고리즘 설정을 나누기 위해서 아래와 같이 바뀐다.
pt_br: foi alterado para dividir as configurações de problemas/oraculo e configurações de algoritmo, para
ta_in: பிரித்தல் சிக்கல் / ஆரக்கிள் அமைப்புகள் மற்றும் வழிமுறை அமைப்புகளுக்கு மாற்றப்பட்டுள்ளது
tr_tr: problem/kara kutu ayarlarını ve algoritma ayarlarını bölmek için değiştirildi,

source: Migration guide
es_un: Guía de migración
fr_fr: Guide de migration
ja_jp: 移行ガイド
ko_kr: 마이그레이션 가이드
pt_br: Guia de migração
ta_in: இடம்பெயர்வு வழிகாட்டி
tr_tr: Geçiş kılavuzu

source: For oracles provided as circuits and a ``is_good_state`` function to determine good states
es_un: Para oráculos proporcionados como circuitos y una función ``is_good_state`` para determinar estados buenos
fr_fr: Pour les oracles fournis comme circuits et une fonction ``is_good_state`` pour déterminer les bons états
ja_jp: 回路として提供されるオラクルと、良い状態を判断する ``is_good_state`` 関数に対して
ko_kr: 회로들과 우수한 상태를 판별하는 ``is_good_state`` 함수가 제공되는 오라클인 경우
pt_br: Para oraculos fornecidos como circuitos e a função ``is_good_state`` para determinar estados bons
ta_in: சுற்றுகளாக வழங்கப்பட்ட ஆரக்கிள்களுக்கும், நல்ல நிலைகளைத் தீர்மானிக்க ``is_good_state`` செயல்பாட்டிற்கும்
tr_tr: Devreler olarak sağlanan kara kutular ve iyi durumları belirlemek için bir ``is_good_state`` işlevi
