Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/migration/01_migration_guide_0.5.po
Languages: de, es_un, ja, ta, te

source: In the new implementation we start from creating a Fidelity instance. Fidelity is optional and quantum kernel will create it automatically if none is passed. But here, we create it manually for illustrative purposes. To create a fidelity instance we pass a sampler. The sampler is the reference implementation and defines where our quantum circuits are executed. You may create a sampler instance from `QiskitRuntimeService <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html>`__ to leverage Qiskit runtime services.
de: In der neuen Implementierung beginnen wir mit der Erstellung einer Fidelität-Instanz. Die Fidalität ist optional und der Quantum Kernel wird ihn automatisch erzeugen, wenn er nicht angegeben wird. Hier erstellen wir ihn jedoch manuell zum Zweck der Illustration. Um eine Fidelität-Instanz zu erstellen, übergeben wir einen Sampler. Der Sampler ist die Referenzimplementierung und definiert, wo unsere Quantenschaltungen ausgeführt werden. Man kann eine Beispiel-Instanz von `QiskitRuntimeService <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html>`__ erstellen, um Qiskit-Runtime-Dienste zu nutzen.
es_un: En la nueva implementación, comenzamos con la creación de una instancia de Fidelity. La fidelidad es opcional y el kernel cuántico la creará automáticamente si no se pasa ninguna. Pero aquí, la creamos manualmente con fines ilustrativos. Para crear una instancia de fidelidad pasamos un sampler. El sampler es la implementación de referencia y define dónde se ejecutan nuestros circuitos cuánticos. Puedes crear una instancia de sampler desde `QiskitRuntimeService <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html>`__ para aprovechar los servicios de ejecución de Qiskit.
ja: 新しい実装では、Fidelityのインスタンスを作成するところから始めます。Fidelityはオプションで、何も渡されない場合は量子カーネルが自動的に作成します。しかし、ここでは、説明のために手動で作成します。Fidelityのインスタンスを作成するために、Samplerを渡します。Samplerとは、量子回路を実行する際に参照する実装のことであり、量子回路が実行される場所を定義します。QiskitのRuntime serviceを活用するために、`QiskitRuntimeService <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html>` からSampler インスタンスを作成することができます。
ta: புதிய செயலாக்கத்தில் நாம் ஒரு ஃபிடிலிட்டி நிகழ்வை உருவாக்குவதிலிருந்து தொடங்குகிறோம். நம்பகத்தன்மை விருப்பமானது மற்றும் எதுவும் அனுப்பப்படாவிட்டால் குவாண்டம் கர்னல் தானாகவே அதை உருவாக்கும். ஆனால் இங்கே, விளக்க நோக்கங்களுக்காக அதை கைமுறையாக உருவாக்குகிறோம். நம்பகத்தன்மை நிகழ்வை உருவாக்க, ஒரு மாதிரியை அனுப்புகிறோம். மாதிரி என்பது குறிப்பு செயல்படுத்தல் மற்றும் எங்கள் குவாண்டம் சுற்றுகள் எங்கு செயல்படுத்தப்படுகின்றன என்பதை வரையறுக்கிறது. Qiskit இயக்க நேர சேவையைப் பயன்படுத்த, `QiskitRuntimeService <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html>`__ இலிருந்து மாதிரி நிகழ்வை உருவாக்கலாம்.
te: కొత్త ఇంప్లిమెంటేషన్‌లో మనం ఫిడెలిటీ ఇన్‌స్టెన్స్‌ని సృష్టించడం నుండి ప్రారంభిస్తాము. ఫిడెలిటీ అనేది ఐచ్ఛికం మరియు ఏదీ పాస్ కాకపోతే క్వాంటం కెర్నల్ దానిని స్వయంచాలకంగా సృష్టిస్తుంది. కానీ ఇక్కడ, మనము దానిని దృష్టాంత ప్రయోజనాల కోసం మాన్యువల్‌గా సృష్టిస్తాము. ఫిడెలిటీ ఇన్‌స్టెన్స్‌ను సృష్టించడానికి మనము సాంప్లర్ను పాస్ చేస్తాము. సాంప్లర్ అనేది రిఫరెన్స్ ఇంప్లిమెంటేషేన్ మరియు మన క్వాంటం సర్క్యూట్‌లు ఎక్కడ అమలు చేయబడతాయో నిర్వచిస్తుంది. Qiskit రన్‌టైమ్ సేవలను వినియోగించుకోవడానికి మీరు `QiskitRuntimeService <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html>`__ నుండి సామ్ప్లెర్ ఇనిస్టాన్స్ను సృష్టించవచ్చు.

source: Next, we create a new quantum kernel with the fidelity instance.
de: Als Nächstes erstellen wir einen neuen Quantum-Kernel mit der Fidelität-Instanz.
es_un: A continuación, creamos un nuevo kernel cuántico con la instancia de fidelity.
ja: 次に、fidelify (忠実度) インスタンスで新しい量子カーネルを作成します。
ta: அடுத்து, நம்பகத்தன்மை நிகழ்வைக் கொண்டு புதிய குவாண்டம் கர்னலை உருவாக்குகிறோம்.
te: తరువాత, మనము ఫిడిలిటీ ఇనిస్టాన్స్ తో కొత్త క్వాంటం కెర్నల్‌ను సృష్టిస్తాము.

source: Then we fit an SVM classifier the same way as before.
de: Dann fitten wir einen SVM-Klassifizierer genauso wie zuvor.
es_un: Luego ajustamos un clasificador SVM de la misma manera que antes.
ja: そして、前と同じようにSVM分類器を当てはめます。
ta: பின்னர் SVM வகைப்படுத்தியை முன்பு போலவே பொருத்துகிறோம்.
te: మునుపటి మాదిరిగానే SVM వర్గీకరణకు ఫిట్ చేస్తున్నాం.

source: Changes in the quantum neural networks are not as dramatic as in quantum kernels. In addition, and as a replacement to the existing neural networks, two new networks are introduced. The new networks introduced are `SamplerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__ and `EstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ which are detailed below and are replacements for the pre-existing `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__, `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ and `TwoLayerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.TwoLayerQNN.html>`__ which are now pending deprecated.
de: Änderungen in den neuronalen Quantennetzen sind nicht so dramatisch wie in Quantum-Kernels. Zusätzlich werden als Ersatz für die bestehenden neuronalen Netzwerke zwei neue Netzwerke eingeführt. Die neu eingeführten Netzwerke sind `SamplerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__ und `EstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ die unten ausgeführt sind und dienen als Ersatz für den bereits existierenden `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__, `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ und `TwoLayerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.TwoLayerQNN.html>`__ die nun veraltet sind.
es_un: Los cambios en las redes neuronales cuánticas no son tan dramáticos como en los kernels cuánticos. Además, y como sustitución de las redes neuronales existentes, se introducen dos nuevas redes. Las nuevas redes introducidas son `SamplerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__ y `EstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ que se detallan a continuación y reemplazan a las preexistentes `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__, `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ y `TwoLayerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.TwoLayerQNN.html>`__ que ahora están pendientes de ser obsoletas.
ja: 量子ニューラルネットワークの変更は、量子カーネルほど劇的なものではありません。また、既存のニューラルネットワークを置き換えるものとして、2つの新しいネットワークが導入されています。 `SamplerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__ と `EstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ で、既存の `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ 、 `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ 、 `TwoLayerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.TwoLayerQNN.html>`__ を置き換えるもので、詳細は以下の通りです。
ta: குவாண்டம் நரம்பியல் நெட்வொர்க்குகளில் ஏற்படும் மாற்றங்கள் குவாண்டம் கர்னல்களைப் போல வியத்தகு முறையில் இல்லை. கூடுதலாக, தற்போதுள்ள நரம்பியல் நெட்வொர்க்குகளுக்கு மாற்றாக, இரண்டு புதிய நெட்வொர்க்குகள் அறிமுகப்படுத்தப்பட்டுள்ளன. அறிமுகப்படுத்தப்பட்ட புதிய நெட்வொர்க்குகள் `SamplerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__ மற்றும் `EstimatorQNN <https://qiskit.org/docuine. learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ இவை கீழே விவரிக்கப்பட்டுள்ளன மற்றும் முன்பே இருக்கும் `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs_Network.N..html>`__, `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ மற்றும் `TwoLayerQNN <https://chqiscoine. -learning/stubs/qiskit_machine_learning.neural_networks.TwoLayerQNN.html>`__ இப்போது நிலுவையில் உள்ளவை நிறுத்தப்பட்டன.
te: క్వాంటం న్యూరల్ నెట్‌వర్క్‌లలో మార్పులు క్వాంటం కెర్నల్స్‌లో వలె నాటకీయంగా లేవు. అదనంగా, మరియు ఇప్పటికే ఉన్న న్యూరల్ నెట్‌వర్క్‌లకు ప్రత్యామ్నాయంగా, రెండు కొత్త నెట్‌వర్క్‌లు ప్రవేశపెట్టబడ్డాయి. ప్రవేశపెట్టబడిన కొత్త నెట్‌వర్క్‌లు `SamplerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__ మరియు `EstimatorQNN <https://qiskit.org/doine learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ ఇవి క్రింద వివరించబడ్డాయి మరియు ముందుగా ఉన్న `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__, `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ మరియు `TwoLayerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.TwoLayerQNN.html>`__ ఇప్పుడు పెండింగ్‌లో ఉన్నవి నిలిపివేయబడ్డాయి.

source: SamplerQNN
ta: மாதிரிக்யூஎன்என்

source: A new `Sampler Quantum Neural Network <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__ leverages the sampler primitive, sampler gradients and is a **direct replacement** of `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__.
de: Ein neues `Sampler Quantum Neural Network <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__ nutzt Sampler-Primitive, Sampler-Gradienten und ist ein **direkter Ersatz** von `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__.
es_un: Una nueva `Red Neuronal Cuántica de Sampler <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__ aprovecha la primitiva sampler, los gradientes de sampler y es un **reemplazo directo** de `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__.
ja: 新しい `Sampler Quantum Neural Network <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__ は、sampler primitive、sampler Gradientsを活用し、 `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ を **直接置き換える** ものです。
ta: ஒரு புதிய `சாம்ப்ளர் குவாண்டம் நியூரல் நெட்வொர்க் <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__ மாதிரிப் பழமையான, மாதிரி* *நேரடியான மாற்றீடுகளை மேம்படுத்துகிறது. இன் `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__.
te: కొత్త `శాంప్లర్ క్వాంటం న్యూరల్ నెట్‌వర్క్ <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__ సాంప్లర్ ప్రిమిటివ్, సాంప్లర్ గ్రేడియంట్ ని ప్రభావితం చేస్తుంది మరియు `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ ని **డైరెక్ట్ రీప్లేస్‌మెంట్** చేస్తుంది.

source: The new `SamplerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__ exposes a similar interface to the existing `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__, with a few differences. One is the ``quantum_instance`` parameter. This parameter does not have a direct replacement, and instead the ``sampler`` parameter must be used. The ``gradient`` parameter keeps the same name as in the `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ implementation, but it no longer accepts Opflow gradient classes as inputs; instead, this parameter expects an (optionally custom) primitive gradient. The ``sampling`` option has been removed for the time being, as this information is not currently exposed by the sampler, and might correspond to future lower-level primitives.
de: Der neue `SamplerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__ zeigt ein ähnliches Interface wie der vorhandenen `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__, mit ein paar Unterschieden. Einer ist der ``quantum_instance`` Parameter. Dieser Parameter hat keinen direkten Ersatz und stattdessen muss der ``sampler`` Parameter verwendet werden. Der ``gradient`` Parameter hält den gleichen Namen wie in der `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ implementierung, aber er akzeptiert keine Opflow Gradient Klassen mehr als Eingabe; stattdessen erwartet dieser Parameter einen (optional benutzerdefinierten) Primitiv-Gradienten. Die ``sampling`` Option wurde vorläufig entfernt da diese Informationen derzeit nicht vom Sampler angezeigt werden und zukünftigen Primitiven auf niedrigerer Ebene entsprechen können.
es_un: La nueva `SamplerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__ expone una interfaz similar a la existente `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__, con algunas diferencias. Una es el parámetro ``quantum_instance``. Este parámetro no tiene un reemplazo directo, y en su lugar se debe usar el parámetro ``sampler``. El parámetro ``gradient`` mantiene el mismo nombre que en la implementación `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__, pero ya no acepta clases de gradiente Opflow como entradas; en cambio, este parámetro espera un gradiente primitivo (opcionalmente personalizado). La opción ``sampling`` se ha eliminado por el momento, ya que esta información no está expuesta actualmente por el sampler y podría corresponder a futuras primitivas de nivel inferior.
ja: 新しい `SamplerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__ は既存の `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ と同様のインターフェイスを公開しますが、いくつかの違いがあります。1つは ``quantum_instance`` パラメーターです。このパラメーターは直接の置き換えがなく、代わりに ``sampler`` パラメーターを使用する必要があります。 ``gradient`` パラメーターは `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ の実装と同じ名前を保っていますが、入力としてOpflow gradientクラスを受け付けなくなりました。代わりに、このパラメーターは（オプションでカスタム）primitive gradientを期待します。 ``sampling`` option は、現在samplerが公開していない情報であり、将来の低レベルprimitiveに対応する可能性があるため、当面の間、削除されました。
ta: புதிய `SamplerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__ ஏற்கனவே உள்ள `CircuitQNN <https://qiscument க்கு ஒத்த இடைமுகத்தை வெளிப்படுத்துகிறது. /machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__, சில வேறுபாடுகளுடன். ஒன்று ``quantum_instance`` அளவுரு. இந்த அளவுருவுக்கு நேரடி மாற்றீடு இல்லை, அதற்கு பதிலாக ``sampler`` அளவுரு பயன்படுத்தப்பட வேண்டும். ``gradient`` அளவுரு, `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ இல் உள்ள அதே பெயரை வைத்திருக்கிறது. உள்ளீடுகளாக Opflow சாய்வு வகுப்புகள்; அதற்கு பதிலாக, இந்த அளவுரு ஒரு (விரும்பினால் தனிப்பயன்) பழமையான சாய்வு எதிர்பார்க்கிறது. ``sampler`` விருப்பம் தற்போதைக்கு அகற்றப்பட்டது, ஏனெனில் இந்தத் தகவல் தற்போது மாதிரியால் வெளிப்படுத்தப்படவில்லை, மேலும் இது எதிர்கால கீழ்-நிலை ஆதிநிலைகளுக்கு ஒத்ததாக இருக்கலாம்.
te: కొత్త `SamplerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.SamplerQNN.html>`__ ఇప్పటికే ఉన్న ఇంటర్ఫేస్ `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__, కొన్ని తేడాలతో ఎక్సపోస్ చేస్తుంది.``quantum_instance`` పరామితి అందులో ఒకటి. ఈ పరామితికి ప్రత్యక్ష ప్రత్యామ్నాయం లేదు మరియు బదులుగా ``sampler`` పరామితిని తప్పనిసరిగా ఉపయోగించాలి. ``gradient`` పరామితి `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ అమలులో ఉన్న పేరునే ఉంచుతుంది, అయితే ఇది ఇకపై Opflow గ్రేడియంట్ క్లాస్లు ఇన్‌పుట్‌లుగా ఆమోదించబడదు; బదులుగా, ఈ పరామితి (ఐచ్ఛికంగా అనుకూలమైన) ఆదిమ ప్రవణతను ఆశిస్తుంది. ఈ సమాచారం ప్రస్తుతం నమూనా ద్వారా బహిర్గతం చేయబడలేదు మరియు భవిష్యత్తులో దిగువ-స్థాయి ఆదిమాంశాలకు అనుగుణంగా ఉండవచ్చు కాబట్టి ప్రస్తుతానికి ``sampling`` ఎంపిక తీసివేయబడింది.

source: The existing training algorithms such as `VQC <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.VQC.html>`__ that were based on `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__, are updated to accept both implementations. The implementation of `NeuralNetworkClassifier <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.NeuralNetworkClassifier.html>`__ has not changed.
de: Die vorhandenen Trainingsalgorithmen wie `VQC <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.VQC.html>`__ die auf `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ basieren, wurden aktualisiert, um beide Implementierungen zu akzeptieren. Die Implementierung von `NeuralNetworkClassifier <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.NeuralNetworkClassifier.html>`__ hat sich nicht geändert.
es_un: Los algoritmos de entrenamiento existentes como `VQC <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.VQC.html>`__ que se basaron en `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__, son actualizados para aceptar ambas implementaciones. La implementación de `NeuralNetworkClassifier <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.NeuralNetworkClassifier.html>`__ no ha cambiado.
ja: `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ をベースとした `VQC <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.VQC.html>`__ のような既存の学習アルゴリズムは、両方の実装を受け入れるように更新されました。 `NeuralNetworkClassifier <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.NeuralNetworkClassifier.html>`__ の実装は変更されていません。
ta: விசை: `CircuitQNN <https://qiskit ஐ அடிப்படையாகக் கொண்ட `VQC <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.VQC.html>`__ போன்ற தற்போதைய பயிற்சி அல்காரிதம்கள். org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__, இரண்டு செயலாக்கங்களையும் ஏற்க புதுப்பிக்கப்பட்டது. `NeuralNetworkClassifier <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.NeuralNetworkClassifier.html> செயல்படுத்துதல்
te: `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ పై ఆధారపడిన `VQC <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.VQC.html>`__ వంటి ప్రస్తుత శిక్షణా అల్గారిథమ్‌లు, రెండు ఇంప్లిమెంటేషన్లను ఆమోదించడానికి నవీకరించబడింది. `NeuralNetworkClassifier <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.NeuralNetworkClassifier.html>`__ యొక్క ఇంప్లిమెంటేషన్ మారలేదు.

source: The existing `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ is now **pending deprecation**, will be deprecated in a future release and subsequently removed after that.
de: Das vorhandene `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ ist jetzt **zur Verwerfung vorgesehen**, wird in einer zukünftigen Version veraltet sein und anschließend entfernt werden.
es_un: El `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ existente ahora está **pendiente de obsolescencia**, quedará obsoleto en una versión futura y subsecuentemente eliminado después de eso.
ja: 既存の `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ は、現在 **保留中の非推奨** となっており、将来のリリースで非推奨となり、その後削除される予定です。
ta: தற்போதுள்ள `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ இப்போது ** நிலுவையில் உள்ள தேய்மானம்**, எதிர்கால வெளியீட்டில் நீக்கப்படும். அதற்கு பிறகு.
te: ఇప్పటికే ఉన్న `CircuitQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.CircuitQNN.html>`__ ఇప్పుడు ** డెప్రికేషన్ పెండింగ్‌**లో ఉంది, తదుపరి విడుదలలో నిరాకరించబడుతుంది మరియు తదుపరి విడుదలలో తీసివేయబడుతుంది.

source: We'll show how to train a variational quantum classifier using both networks. For this purposes we re-use the dataset generated for the quantum kernel. For both quantum neural networks we still have to construct a feature map, an ansatz and combine them into a single quantum circuit.
ja: ここでは、両ネットワークを用いた変分量子分類器の学習方法を紹介します。この目的のために、量子カーネルのために生成されたデータセットを再利用します。両者の量子ニューラルネットワークでは、特徴量マップ、ansatzを構築し、それらを1つの量子回路に結合する必要があります。
ta: இரண்டு நெட்வொர்க்குகளையும் பயன்படுத்தி ஒரு மாறுபட்ட குவாண்டம் வகைப்படுத்தியை எவ்வாறு பயிற்றுவிப்பது என்பதைக் காண்பிப்போம். இந்த நோக்கத்திற்காக குவாண்டம் கர்னலுக்காக உருவாக்கப்பட்ட தரவுத்தொகுப்பை மீண்டும் பயன்படுத்துகிறோம். இரண்டு குவாண்டம் நியூரல் நெட்வொர்க்குகளுக்கும் நாம் இன்னும் ஒரு அம்ச வரைபடம், ஒரு அன்சாட்ஸை உருவாக்கி அவற்றை ஒரு குவாண்டம் சர்க்யூட்டில் இணைக்க வேண்டும்.
