Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/migration/01_migration_guide_0.5.po
Languages: de, es_un, ja, ta, te

source: We need an interpret function as well. We define our usual parity function that maps bitstrings either to :math:`0` or :math:`1`.
de: Wir brauchen auch eine Interpretationsfunktion. Wir definieren unsere übliche Paritätsfunktion, die Bitstrings entweder auf :math:`0` oder :math:`1` abbildet.
es_un: Necesitamos una función de interpretación también. Definimos nuestra función de paridad habitual que asigna cadenas de bits a :math:`0` o :math:`1`.
ja: 同様に、解釈関数も必要です。ここでは、ビット列を:math:`0` または :math:`1` にマップする、通常のパリティ関数を定義します。
ta: நமக்கு ஒரு விளக்கச் செயல்பாடும் தேவை. பிட்ஸ்ட்ரிங்ஸை :math:`0` அல்லது :math:`1` என வரைபடமாக்கும் எங்கள் வழக்கமான சமநிலை செயல்பாட்டை நாங்கள் வரையறுக்கிறோம்.:math:
te: మనకు ఇంటర్‌ప్రెట్ ఫంక్షన్ కూడా అవసరం. బిట్‌స్ట్రింగ్‌లను :math:`0` లేదా :math:`1`కి మ్యాప్ చేసే మా సాధారణ పారిటీ ఫంక్షన్‌ని మేము నిర్వచించాము.

source: We fix the initial point to get the same results from both networks.
de: Wir fixieren den Ausgangspunkt, um die gleichen Ergebnisse von beiden Netzwerken zu erhalten.
es_un: Fijamos el punto inicial para obtener los mismos resultados de ambas redes.
ja: 両方のネットワークから同じ結果が得られるように、初期点を固定します。
ta: இரண்டு நெட்வொர்க்குகளிலிருந்தும் ஒரே மாதிரியான முடிவுகளைப் பெற ஆரம்பப் புள்ளியைச் சரிசெய்கிறோம்.
te: రెండు నెట్‌వర్క్‌ల నుండి ఒకే ఫలితాలను పొందడానికి మనము ప్రారంభ పాయింట్‌ను ఫిక్స్ చేస్తున్నాం.

source: Building a classifier using ``CircuitQNN``
de: Einen Klassifizierer mit ``CircuitQNN`` erstellen
es_un: Construcción de un clasificador usando ``CircuitQNN``
ja: ``CircuitQNN`` を用いた分類器の構築
ta: ``CircuitQNN`` ஐப் பயன்படுத்தி வகைப்படுத்தியை உருவாக்குதல்
te: ``CircuitQNN``ని ఉపయోగించి వర్గీకరణను రూపొందించడం

source: We create a ``CircuitQNN`` instance and re-use the quantum instance created for the quantum kernel.
de: Wir erstellen eine ``CircuitQNN`` Instanz und verwenden die Quanteninstanz, die für den Quantum-Kernel erstellt wurde.
es_un: Creamos una instancia de ``CircuitQNN`` y reutilizamos la quantum instance creada para el kernel cuántico.
ja: ``CircuitQNN`` のインスタンスを作成し、量子カーネル用に作成した量子インスタンスを再利用します。
ta: ``CircuitQNN` நிகழ்வை உருவாக்கி, குவாண்டம் கர்னலுக்காக உருவாக்கப்பட்ட குவாண்டம் நிகழ்வை மீண்டும் பயன்படுத்துகிறோம்.
te: మనము ``CircuitQNN`` ఇన్స్టన్స్ని సృష్టిస్తాము మరియు క్వాంటం కెర్నల్ కోసం సృష్టించబడిన క్వాంటం ఉదాహరణను మళ్లీ ఉపయోగిస్తాము.

source: Construct a classifier out of the network, train it and score it. We are not aiming for good results, so the number of iterations is set to a small number to reduce overall execution time.
de: Baue einen Klassifikator aus dem Netzwerk heraus, trainiere und bewerten ihn. Wir streben noch keine guten Ergebnisse an, daher ist die Anzahl der Iterationen auf eine geringe Anzahl begrenzt, um die Ausführungszeit insgesamt zu verkürzen.
es_un: Construye un clasificador a partir de la red, entrénalo y puntúalo. No buscamos buenos resultados, por lo que el número de iteraciones se establece en un número pequeño para reducir el tiempo de ejecución total.
ja: ネットワークから分類器を構築し、それを訓練し、スコアをつけます。良い結果を目指しているわけではないので、全体の実行時間を短縮するために、反復回数は少なめに設定されています。
ta: நெட்வொர்க்கிற்கு வெளியே ஒரு வகைப்படுத்தியை உருவாக்கி, அதைப் பயிற்றுவித்து மதிப்பெண் பெறவும். நாங்கள் நல்ல முடிவுகளை இலக்காகக் கொண்டிருக்கவில்லை, எனவே ஒட்டுமொத்த செயலாக்க நேரத்தைக் குறைக்க மறு செய்கைகளின் எண்ணிக்கை சிறிய எண்ணிக்கையில் அமைக்கப்பட்டுள்ளது.
te: నెట్‌వర్క్ నుండి వర్గీకరణను(క్లాసిఫైర్) రూపొందించండి, దానిని ట్రైన్ చేయండి మరియు స్కోర్ చేయండి. మనము మంచి ఫలితాల కోసం లక్ష్యంగా పెట్టుకోవడం లేదు, కాబట్టి పూర్తి ఎగ్జిక్యూషన్ సమయాన్ని తగ్గించడానికి పునరావృతాల సంఖ్య చిన్న సంఖ్యకు సెట్ చేయబడింది.

source: Building a classifier using ``SamplerQNN``
de: Einen Klassifikator mit ``SamplerQNN`` erstellen
es_un: Construcción de un clasificador usando ``SamplerQNN``
ja: ``SamplerQNN`` を用いた分類器の構築
ta: ``SamplerQNN`` ஐப் பயன்படுத்தி வகைப்படுத்தியை உருவாக்குதல்
te: ``SamplerQNN``ని ఉపయోగించి వర్గీకరణను రూపొందించడం

source: Instead of ``QuantumInstance`` create an instance of the reference ``Sampler``.
de: Anstelle von ``QuantumInstance`` eine Instanz der Referenz ``Sampler`` erstellen.
es_un: En lugar de ``QuantumInstance``, crea una instancia de la referencia ``Sampler``.
ja: ``QuantumInstance`` の代わりに参照元 ``Sampler`` のインスタンスを作成します。
ta: ``QuantumInstance`` என்பதற்குப் பதிலாக ``Sampler`` குறிப்பின் நிகழ்வை உருவாக்கவும்.
te: ``QuantumInstance``కి బదులుగా ``సామ్ప్లెర్`` సూచన యొక్క ఇన్ స్టాన్స్ను సృష్టించండి.

source: Now, we create a instance of ``SamplerQNN``. The difference with ``CircuitQNN`` is that we pass a sampler instead of a quantum instance.
de: Jetzt erstellen wir eine Instanz von ``SamplerQNN``. Der Unterschied mit ``CircuitQNN`` ist, dass wir statt einer Quanteninstanz einen Sampler übergeben.
es_un: Ahora, creamos una instancia de ``SamplerQNN``. La diferencia con ``CircuitQNN`` es que pasamos un sampler en lugar de una quantum instance.
ja: ここで、 ``SamplerQNN`` のインスタンスを作成します。 ``CircuitQNN`` との違いは、量子インスタンスではなく、samplerを渡すことです。
ta: இப்போது, ​​``SamplerQNN`` இன் நிகழ்வை உருவாக்குகிறோம். ``CircuitQNN` உடன் உள்ள வித்தியாசம் என்னவென்றால், குவாண்டம் நிகழ்விற்குப் பதிலாக ஒரு மாதிரியை அனுப்புகிறோம்.
te: ఇప్పుడు, మేము ``SamplerQNN`` యొక్క ఇన్ స్టాన్స్ను సృష్టిస్తాము. ``CircuitQNN`తో ఉన్న తేడా ఏమిటంటే, మనం క్వాంటం ఇన్‌స్టాన్స్‌కు బదులుగా సామ్ప్లెర్ను పాస్ చేస్తాము.

source: Construct a classifier and fit it as usual. As ``neural_network`` we pass a created ``SamplerQNN`` and this is the only difference.
de: Als Erstes einen Klassifikator konstruieren und ihn wie gewohnt anpassen. Nun übergeben wir als ``neural_network`` einen erstellten ``SamplerQNN`` und das ist der einzige Unterschied.
es_un: Construye un clasificador y ajústalo como de costumbre. Como es una ``neural_network`` pasamos un ``SamplerQNN`` creado y esta es la única diferencia.
ja: 通常通り分類器を構築し、フィットさせます。 ``neural_network`` として、作成した ``SamplerQNN`` を渡していますが、これだけの違いです。
ta: ஒரு வகைப்படுத்தியை உருவாக்கி வழக்கம்போல் பொருத்தவும். ``neural_network`` என நாம் உருவாக்கிய ``SamplerQNN`` ஐ அனுப்புகிறோம், இதுவே வித்தியாசம்.
te: క్లాసిఫైర్ ను నిర్మించి, దానిని యధావిధిగా ఫిట్ చేయండి. ``neural_network``గా మనం సృష్టించిన ``SamplerQNN``ని పాస్ చేస్తాము మరియు ఇది ఒక్కటే తేడా.

source: Instead of constructing a quantum neural network manually, you may train ``VQC``. It takes either a quantum instance or a sampler, depending on what is passed it automatically constructs either ``CircuitQNN`` or ``SamplerQNN`` respectively.
de: Anstatt ein neuronales Quantennetzwerk manuell zu konstruieren, kann man``VQC`` trainieren. Es benötigt entweder eine Quanteninstanz oder einen Sampler, je nachdem, was übergeben wird, wird automatisch ``CircuitQNN`` bzw. ``SamplerQNN`` konstruiert.
es_un: En lugar de construir una red neuronal cuántica manualmente, puedes entrenar un ``VQC``. Toma una quantum instance o un sampler, dependiendo de lo que se pase, construye automáticamente ``CircuitQNN`` o ``SamplerQNN`` respectivamente.
ja: 量子ニューラルネットワークを手動で構築する代わりに、 ``VQC`` をトレーニングすることができます。 ``VQC`` は、量子インスタンスとsamplerを受け取り、渡された内容に応じて、``CircuitQNN`` と ``SamplerQNN`` をそれぞれ自動的に構築します。
ta: குவாண்டம் நியூரல் நெட்வொர்க்கை கைமுறையாக உருவாக்குவதற்குப் பதிலாக, நீங்கள் ``VQC``க்கு பயிற்சி அளிக்கலாம். இது ஒரு குவாண்டம் நிகழ்வு அல்லது மாதிரியை எடுக்கும், அனுப்பப்பட்டதைப் பொறுத்து அது தானாகவே முறையே ``CircuitQNN` அல்லது ``SamplerQNN`` ஐ உருவாக்குகிறது.
te: క్వాంటం న్యూరల్ నెట్‌వర్క్‌ను మాన్యువల్‌గా నిర్మించడానికి బదులుగా, మీరు ``VQC``కి శిక్షణ ఇవ్వవచ్చు. ఇది క్వాంటం ఇన్‌స్టాన్స్ లేదా శాంప్లర్‌ను తీసుకుంటుంది, పాస్ అయినదానిపై ఆధారపడి ఇది స్వయంచాలకంగా వరుసగా ``CircuitQNN`` లేదా ``SamplingQNN``ని నిర్మిస్తుంది.

source: EstimatorQNN
ta: விசை: EstimatorQNN

source: A new `Estimator quantum neural network <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ leverages the estimator primitive, estimator gradients and is a **direct replacement** of `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__.
de: Ein neues `Estimator quantum neural network <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ nutzt den Estimator-Primitiv, Estimator-Gradienten und ist ein **direkter Ersatz** von `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__.
es_un: Una nueva `red neuronal cuántica de Estimator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ aprovecha la primitiva estimator, los gradientes del estimator y es un **reemplazo directo** de `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__.
ja: 新しい `Estimator quantum neural network <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ は、Estimator primitive、Estimator gradientsを活用し、 `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ を **直接置き換える ** ものです。
ta: ஒரு புதிய `எஸ்டிமேட்டர் குவாண்டம் நரம்பியல் நெட்வொர்க் <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ மதிப்பீட்டாளர் ஆதிகாலம், மதிப்பீட்டாளர்* கிரிமிட்டிவ் * டைரக்ட் ஆடி* ரிப்லேஸ்டு இன் `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__.
te: కొత్త `ఎస్టిమేటర్ క్వాంటం న్యూరల్ నెట్‌వర్క్ <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ ఎస్టిమేటర్ ప్రిమిటివ్, ఎస్టిమేటర్ గ్రేడియంట్లని ప్రభావితం చేస్తుంది మరియు `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ యొక్క **డైరెక్ట్ రిప్లేస్‌మెంట్‌**(భర్తీ చేస్తుంది).

source: The new `EstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ exposes a similar interface to the existing `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__, with a few differences. One is the ``quantum_instance`` parameter. This parameter does not have a direct replacement, and instead the ``estimator`` parameter must be used. The ``gradient`` parameter keeps the same name as in the `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ implementation, but it no longer accepts Opflow gradient classes as inputs; instead, this parameter expects an (optionally custom) primitive gradient.
de: Der neue `EstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ legt ein ähnliches Interface mit dem vorhandenen `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__, mit ein paar Unterschieden. Einer ist der ``quantum_instance`` Parameter. Dieser Parameter hat keinen direkten Ersatz und stattdessen muss der ``estimator`` Parameter verwendet werden. Der ``gradient`` Parameter hält den gleichen Namen wie in der `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ Implementierung, aber er akzeptiert keine Opflow Gradient Klassen mehr als Eingabe; stattdessen erwartet dieser Parameter einen (optional benutzerdefinierten) Primitiv-Gradienten.
es_un: La nueva `EstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ expone una interfaz similar a la existente `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__, con algunas diferencias. Una es el parámetro ``quantum_instance``. Este parámetro no tiene un reemplazo directo, y en su lugar se debe usar el parámetro ``estimator``. El parámetro ``gradient`` mantiene el mismo nombre que en la implementación `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__, pero ya no acepta clases de gradiente Opflow como entradas; en cambio, este parámetro espera un gradiente primitivo (opcionalmente personalizado).
ja: 新しい `EstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ は、既存の `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ と同様のインターフェースを公開しますが、いくつかの相違点があります。1つは ``quantum_instance`` パラメーターです。このパラメーターには直接的な代替がなく、代わりに ``estimator`` パラメーターを使用する必要があります。 ``gradient`` パラメーターは `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ の実装と同じ名前を持ちますが、入力としてOpflow gradientクラスを受け付けなくなりました。代わりに、このパラメーターは（オプションでカスタム）primitive gradientを期待するものです。
ta: புதிய `EstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ ஏற்கனவே உள்ள `OpflowQNN <thttps://qiskit.org/doiskiment க்கு ஒத்த இடைமுகத்தை வெளிப்படுத்துகிறது. /machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__, சில வேறுபாடுகளுடன். ஒன்று ``குவாண்டம்_இன்ஸ்டன்ஸ்`` அளவுரு. இந்த அளவுருவுக்கு நேரடி மாற்றீடு இல்லை, அதற்குப் பதிலாக ``மதிப்பீட்டாளர்`` அளவுரு பயன்படுத்தப்பட வேண்டும். ``gradient`` அளவுரு, `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ செயல்படுத்தலில் உள்ள அதே பெயரை வைத்திருக்கிறது, ஆனால் அது இனி ஏற்கப்படாது. உள்ளீடுகளாக Opflow சாய்வு வகுப்புகள்; அதற்கு பதிலாக, இந்த அளவுரு ஒரு (விரும்பினால் தனிப்பயன்) பழமையான சாய்வு எதிர்பார்க்கிறது.
te: కొత్త `EstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ కొన్ని తేడాలతో, ఇప్పటికే ఉన్న `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__,కి సారూప్య ఇంటర్‌ఫేస్‌ను బహిర్గతం చేస్తుంది.``quantum_instance`` పరామితి అందులో ఒకటి. ఈ పరామితికి ప్రత్యక్ష ప్రత్యామ్నాయం లేదు మరియు బదులుగా ``estimator`` పరామితిని తప్పనిసరిగా ఉపయోగించాలి. ``gradient`` పరామితి `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ ఇంప్లిమెంటేషన్లో ఉన్న పేరునే ఉంచుతుంది, కానీ ఇన్‌పుట్‌లుగా Opflow గ్రేడియంట్ క్లాస్లు ఇది ఇకపై ఆమోదించబడదు. ఈ పరామితి (ఐచ్ఛికంగా అనుకూలమైన) ప్రిమిటివ్ గ్రేడియంట్ను ఆశిస్తుంది.

source: The existing training algorithms such as `VQR <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.VQR.html>`__ that were based on the `TwoLayerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.TwoLayerQNN.html>`__, are updated to accept both implementations. The implementation of `NeuralNetworkRegressor <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.NeuralNetworkRegressor.html>`__ has not changed.
de: Die vorhandenen Trainingsalgorithmen wie `VQC <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.VQC.html>`__ die auf `TwoLayerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.TwoLayerQNN.html>`__ basieren, wurden aktualisiert, um beide Implementierungen zu akzeptieren. Die Implementierung von `NeuralNetworkRegressor <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.NeuralNetworkRegressor.html>`__ hat sich nicht geändert.
es_un: Los algoritmos de entrenamiento existentes como `VQR <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.VQR.html>`__ que están basados en `TwoLayerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.TwoLayerQNN.html>`__, son actualizados para aceptar ambas implementaciones. La implementación de `NeuralNetworkRegressor <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.NeuralNetworkRegressor.html>`__ no ha cambiado.
ja: `VQR <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.VQR.html>`__ のような `TwoLayerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.TwoLayerQNN.html>`__ に基づく既存の学習アルゴリズムは、両方の実装を受け入れるように更新されます。 `NeuralNetworkRegressor <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.NeuralNetworkRegressor.html>`__ の実装は変更されていません。
ta: விசை: `TwoLayerQNN <https://qiskit ஐ அடிப்படையாகக் கொண்ட `VQR <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.VQR.html>`__ போன்ற தற்போதைய பயிற்சி அல்காரிதம்கள் .org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.TwoLayerQNN.html>`__, இரண்டு செயலாக்கங்களையும் ஏற்க புதுப்பிக்கப்பட்டது. `NeuralNetworkRegressor.h ஐச் செயல்படுத்துதல்
te: `TwoLayerQNN <https://qiskit/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.TwoLayerQNN.html>`__ ఆధారంగా రూపొందించబడిన `VQR <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.VQR.html>`__ వంటి ప్రస్తుత శిక్షణా అల్గారిథమ్‌లు, రెండు ఇంప్లిమెంటేషన్లను ఆమోదించడానికి నవీకరించబడ్డాయి. `NeuralNetworkRegressor <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.NeuralNetworkRegressor.html>`__ యొక్క ఇంప్లిమెంటేషన్ మారలేదు.

source: The existing `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ is now **pending deprecation**, will be deprecated in a future release and subsequently removed after that.
de: Das vorhandene `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>` ist jetzt **zur Verwerfung vorgesehen**, wird in einer zukünftigen Version veraltet sein und anschließend entfernt werden.
es_un: El `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ existente ahora está **pendiente de obsolescencia**, quedará obsoleto en una versión futura y subsecuentemente eliminado después de eso.
ja: 既存の `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ は、現在 **保留中の非推奨** となっており、将来のリリースで非推奨となり、その後削除される予定です。
ta: தற்போதுள்ள `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ இப்போது ** நிலுவையில் உள்ள தேய்மானம்**, எதிர்கால வெளியீட்டில் நீக்கப்படும். அதற்கு பிறகு.
te: ఇప్పటికే ఉన్న `OpflowQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.OpflowQNN.html>`__ ఇప్పుడు **పెండింగ్‌లో ఉన్న తరుగుదల**, భవిష్యత్తులో విడుదలలో నిరాకరించబడుతుంది మరియు తర్వాత తీసివేయబడుతుంది.

source: We'll show how to train a variational quantum regressor using both networks. We start from generating a simple regression dataset.
ja: 両方のネットワークを用いた変分量子回帰の学習方法を紹介します。まず、単純な回帰データセットを生成するところから始めます。
ta: இரு வலைப்பதிவுகளைப் பயன்படுத்தி ஒரு வேற்றுமை கோட்பாடு எப்படி பயணிக்கும் எப்படி நாம் காட்டும். நாம் ஒரு எளிய ரெக்சன் dataset உருவாக்க இருந்து ஆரம்பித்தோம்.

source: We still have to construct a feature map, an ansatz and combine them into a single quantum circuit for both quantum neural networks.
de: Wir müssen noch eine Feature-Map und einen Ansatz konstruieren und sie zu einer einzigen Quantenschaltung für beide neuronale Quantennetze kombinieren.
es_un: Todavía tenemos que construir un mapa de características, un ansatz y combinarlos en un solo circuito cuántico para ambas redes neuronales cuánticas.
ja: まだ、量子ニューラルネットワークともに、特徴量マップ、ansatzを構築し、それらを組み合わせて一つの量子回路にする必要があります。
ta: நாம் இன்னும் ஒரு அம்ச வரைபடத்தை உருவாக்க வேண்டும், ஒரு ansatz மற்றும் இரண்டு குவாண்டம் நரம்பியல் நெட்வொர்க்குகளுக்கும் அவற்றை ஒரு குவாண்டம் சர்க்யூட்டில் இணைக்க வேண்டும்.
te: మనము ఇప్పటికీ ఒక ఫీచర్ మ్యాప్, ఒక అన్సాట్జ్‌ని నిర్మించాలి మరియు క్వాంటం న్యూరల్ నెట్‌వర్క్‌ల కోసం వాటిని ఒకే క్వాంటం సర్క్యూట్‌గా కలపాలి.

source: Building a regressor using ``OpflowQNN``
de: Einen Regressor mit ``OpflowQNN`` erstellen
es_un: Construcción de un regresor usando ``OpflowQNN``
ja: ``OpflowQNN`` を用いた回帰器の構築
ta: ``OpflowQNN`` ஐப் பயன்படுத்தி ஒரு பின்னடைவை உருவாக்குதல்
te: ``Opflow ANN``ని ఉపయోగించి రిగ్రెషన్‌ను రూపొందించడం

source: We create an ``OpflowQNN`` instance and re-use the quantum instance created for the quantum kernel.
de: Wir erstellen eine ``OpflowQNN`` Instanz und verwenden die Quanteninstanz, die für den Quantum-Kernel erstellt wurde.
es_un: Creamos una instancia de ``OpflowQNN`` y reutilizamos la quantum instance creada para el kernel cuántico.
ja: ``OpflowQNN`` のインスタンスを作成し、量子カーネル用に作成した量子インスタンスを再利用します。
ta: நாங்கள் ``OpflowQNN` நிகழ்வை உருவாக்கி, குவாண்டம் கர்னலுக்காக உருவாக்கப்பட்ட குவாண்டம் நிகழ்வை மீண்டும் பயன்படுத்துகிறோம்.
te: మనము ``OpflowQNN`` ఇన్స్టెన్స్ను సృష్టిస్తాము మరియు క్వాంటం కెర్నల్ కోసం సృష్టించబడిన క్వాంటం ఇన్స్టెన్స్ను మళ్లీ ఉపయోగిస్తాము.

source: Construct a regressor out of the network, train it and score it. In this case we use a gradient based optimizer, thus the network makes use of the gradient framework and due to nature of the dataset converges very quickly.
de: Konstruiere einen Regressor aus dem Netzwerk, dann trainieren und anschließend bewerte ihn. Nun übergeben wir als ``neural_network`` einen erstellten ``SamplerQNN`` und das ist der einzige Unterschied. In diesem Fall verwenden wir ein gradientenbasiertes Optimierungsprogramm, so dass das Netzwerk den Gradienten-Framework nutzt und sich aufgrund der Art des Datasets sehr schnell konvergiert.
es_un: Construye un regresor a partir de la red, entrénalo y puntúalo. En este caso, utilizamos un optimizador basado en gradientes, por lo que la red utiliza el framework de gradiente y, debido a la naturaleza del conjunto de datos, converge muy rápidamente.
ja: ネットワークから回帰器を構築し、それを訓練し、スコアをつけます。この場合、勾配ベースのオプティマイザーを使用するため、ネットワークは勾配の枠組みを利用し、データセットの性質上、非常に早く収束します。
ta: நெட்வொர்க்கிற்கு வெளியே ஒரு பின்னடைவை உருவாக்கி, அதற்குப் பயிற்சி அளித்து மதிப்பெண் பெறவும். இந்த விஷயத்தில் நாம் சாய்வு அடிப்படையிலான உகப்பாக்கியைப் பயன்படுத்துகிறோம், இதனால் நெட்வொர்க் சாய்வு கட்டமைப்பைப் பயன்படுத்துகிறது மற்றும் தரவுத்தொகுப்பின் தன்மை காரணமாக மிக விரைவாக ஒன்றிணைகிறது.
te: నెట్‌వర్క్ నుండి రిగ్రెసర్‌ను రూపొందించండి, దానికి శిక్షణ ఇవ్వండి మరియు స్కోర్ చేయండి. ఈ సందర్భంలో మనము గ్రేడియంట్ ఆధారిత ఆప్టిమైజర్‌ని ఉపయోగిస్తాము, అందువలన నెట్‌వర్క్ గ్రేడియంట్ ఫ్రేమ్‌వర్క్‌ను ఉపయోగించుకుంటుంది మరియు డేటాసెట్ యొక్క స్వభావం కారణంగా చాలా త్వరగా కాన్వర్జ్ అవుతుంది.

source: Building a regressor using ``EstimatorQNN``
de: Einen Regressor mit ``EstimatorQNN`` erstellen
es_un: Construcción de un regresor usando ``EstimatorQNN``
ja: ``EstimatorQNN`` を用いた回帰器の構築
ta: ``EstimatorQNN`` ஐப் பயன்படுத்தி ஒரு பின்னடைவை உருவாக்குதல்
te: ``EstimatorQNN``ని ఉపయోగించి రిగ్రెసర్‌ను రూపొందించడం
