Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/migration/01_migration_guide_0.5.po
Languages: de, es_un, ja, ta, te

source: The implementation became sophisticated and inflexible and adding support of the new primitives could be tricky. To address the issues, a new flexible and extendable design of quantum kernels was introduced. The goals of the new design are:
de: Die Implementierung wurde anspruchsvoll und unflexibel und die Unterstützung der neuen Primitiven könnte sich als schwierig herausstellen. Um diese Probleme zu beheben, wurde ein neues flexibles und erweiterbares Design von Quantum Kernel eingeführt. Die Ziele des neuen Designs sind:
es_un: La implementación se volvió sofisticada e inflexible y agregar soporte para las nuevas primitivas podría ser complicado. Para abordar los problemas, se introdujo un nuevo diseño flexible y extensible de kernels cuánticos. Los objetivos del nuevo diseño son:
ja: この実装は高度で柔軟性に欠け、新しいprimitiveのサポートを追加するのは困難でした。そこで、柔軟かつ拡張可能な新しい量子カーネルを開発しました。新しい設計の目標は以下の通りです。
ta: செயல்படுத்தல் அதிநவீன மற்றும் வளைந்துகொடுக்க முடியாததாக மாறியது மற்றும் புதிய பழமையானவர்களின் ஆதரவைச் சேர்ப்பது தந்திரமானதாக இருக்கலாம். சிக்கல்களைத் தீர்க்க, குவாண்டம் கர்னல்களின் புதிய நெகிழ்வான மற்றும் நீட்டிக்கக்கூடிய வடிவமைப்பு அறிமுகப்படுத்தப்பட்டது. புதிய வடிவமைப்பின் குறிக்கோள்கள்:
te: అమలు అధునాతనమైనది మరియు ఇన్ఫ్లెక్సిబుల్గా మారింది మరియు కొత్త ఆదిమానవుల మద్దతును జోడించడం క్లిష్టమైనది. సమస్యలను పరిష్కరించడానికి, క్వాంటం కెర్నల్స్ యొక్క కొత్త సౌకర్యవంతమైన మరియు పొడిగించదగిన డిజైన్ ప్రవేశపెట్టబడింది. కొత్త డిజైన్ యొక్క లక్ష్యాలు:

source: Migrate to the primitives and leverage the fidelity algorithm. Now users may plug in their own implementations of fidelity calculations.
de: Zu den Primitiven umstellen und den Fidalitäts-Algorithmus nutzen. Nun können Benutzer ihre eigene Implementierung von Fidalitätsberechnungen einbinden.
es_un: Migrar a las primitivas y aprovechar el algoritmo de fidelidad. Ahora los usuarios pueden conectar sus propias implementaciones de cálculos de fidelidad.
ja: Primitiveに移行し、Fidelity アルゴリズムを活用します。これにより、ユーザーは独自のFidelity 計算の実装をプラグインすることができます。
ta: ஆதிநிலைகளுக்கு இடம்பெயர்ந்து, நம்பக வழிமுறையைப் பயன்படுத்தவும். இப்போது பயனர்கள் நம்பகத்தன்மைக் கணக்கீடுகளின் சொந்த செயலாக்கங்களைச் செருகலாம். ஆதிநிலைகளுக்கு இடம்பெயர்ந்து, நம்பக அல்காரிதத்தைப் பயன்படுத்தவும். இப்போது பயனர்கள் நம்பகத்தன்மை கணக்கீடுகளின் சொந்த செயலாக்கங்களைச் செருகலாம்.
te: ప్రిమిటివ్స్లకు మైగ్రేట్ చేయండి మరియు ఫిడిలిటీ అల్గారిథమ్‌ను ప్రభావితం చేయండి. ఇప్పుడు వినియోగదారులు ఫిడిలిటీ క్యాలీసులషన్స్ యొక్క సొంత ఇంప్లిమెంటేషన్స్ ను ప్లగ్ ఇన్ చేయవచ్చు.

source: Extract trainability feature to a dedicated class.
de: Die Trainierbarkeit-Eigenschaft (trainability feature) in eine eigene Klasse extrahieren.
es_un: Extraer la característica de entrenabilidad a una clase dedicada.
ja: 訓練可能な機能を専用のクラスに抽出する。
ta: ஒரு பிரத்யேக வகுப்பிற்கு பயிற்சி அம்சத்தைப் பிரித்தெடுக்கவும்.
te: ప్రత్యేక క్లాస్కి శిక్షణ లక్షణాన్ని సంగ్రహించండి.

source: Introduce a base class that can be extended by other kernel implementations.
de: Eine Basisklasse einführen, die durch andere Kernel-Implementierungen ertweiteret werden kann.
es_un: Introducir una clase base que puede ser extendida por otras implementaciones de kernel.
ja: 他のカーネルが拡張可能な基本クラスを導入する。
ta: பிற கர்னல் செயலாக்கங்களால் நீட்டிக்கக்கூடிய அடிப்படை வகுப்பை அறிமுகப்படுத்தவும்.
te: ఇతర కెర్నల్ ఇంప్లిమెంటేషన్ల ద్వారా ఎక్స్టెండెడ్బ చేయబడే బేస్ క్లాస్‌ని పరిచయం చేయండి.

source: The new design of quantum kernel is shown on the next diagram.
de: Das neue Design vom Quantum Kernel wird im nächsten Diagramm dargestellt.
es_un: El nuevo diseño del kernel cuántico se muestra en el siguiente diagrama.
ja: 量子カーネルの新しい設計を次の図に示します。
ta: குவாண்டம் கர்னலின் புதிய வடிவமைப்பு அடுத்த வரைபடத்தில் காட்டப்பட்டுள்ளது.
te: క్వాంటం కెర్నల్ యొక్క కొత్త డిజైన్ తదుపరి రేఖాచిత్రంలో చూపబడింది.

source: The new kernels expose the same interface and the same parameters except the ``quantum_instance`` parameter. This parameter does not have a direct replacement and instead the ``fidelity`` parameter must be used. The backend handling/selection, which was previously done using the ``quantum_instance``, is now taken care of via the Sampler primitive given to the ``fidelity``.
de: Die neuen Kernel enthalten die gleiche Schnittstelle und die gleichen Parameter außer dem ``quantum_instance`` Parameter. Dieser Parameter hat keinen direkten Ersatz und stattdessen muss der ``fidelity`` Parameter verwendet werden. Die vorher mit der ``quantum_instance`` durchgeführte Backend-Handling bzw. Backend-Auswahl wird nun über das Sampler-Primitiv, das der ``fidality`` gegeben wurde, übernommen.
es_un: Los nuevos kernels exponen la misma interfaz y los mismos parámetros, excepto el parámetro ``quantum_instance``. Este parámetro no tiene un reemplazo directo y en su lugar se debe usar el parámetro ``fidelity``. El manejo/selección del backend, que anteriormente se realizaba con ``quantum_instance``, ahora se realiza a través de la primitiva Sampler asignada a la ``fidelity``.
ja: 新しいカーネルは、 ``quantum_instance`` パラメーターを除いて、同じインターフェースと同じパラメーターを公開しています。このパラメーターは直接的に置き換えることができず、代わりにfidelityパラメーターを使用しなければなりません。バックエンドの処理・選択は、以前は``quantum_instance``を使用していましたが、現在は ``fidelity`` に与えられたSampler primitiveを介して処理されます。
ta: புதிய கர்னல்கள் ``quantum_instance`` அளவுருவைத் தவிர அதே இடைமுகத்தையும் அதே அளவுருக்களையும் வெளிப்படுத்துகின்றன. இந்த அளவுருவுக்கு நேரடி மாற்றீடு இல்லை, அதற்கு பதிலாக ``fidelity`` அளவுரு பயன்படுத்தப்பட வேண்டும். முன்பு ``quantum_instance`` ஐப் பயன்படுத்தி செய்யப்பட்ட பின்தள கையாளுதல்/தேர்வு, இப்போது ``fidelity`` க்கு கொடுக்கப்பட்ட Sampler primitive மூலம் கவனிக்கப்படுகிறது.
te: కొత్త కెర్నలు ``quantum_instance`` పరామితిని మినహాయించి అదే ఇంటర్‌ఫేస్ మరియు అదే పారామితులను బహిర్గతం చేస్తాయి. ఈ పరామితికి ప్రత్యక్ష ప్రత్యామ్నాయం లేదు మరియు బదులుగా ``ఫిడెలిటీ`` పరామితిని తప్పనిసరిగా ఉపయోగించాలి. గతంలో ``quantum_instance`` ని ఉపయోగించి చేసిన బ్యాకెండ్ హ్యాండ్లింగ్/ఎంపిక ఇప్పుడు ``ఫిడెలిటీ``కి ఇవ్వబడిన శాంప్లర్ ప్రిమిటివ్ ద్వారా జాగ్రత్త తీసుకోబడుతుంది.

source: A new hierarchy shown on the diagram introduces:
de: Eine neue Hierarchie, die im Diagramm dargestellt wird, führt Folgendes ein:
es_un: Una nueva jerarquía que se muestra en el diagrama introduce:
ja: 図に示すような新しい階層が導入されます。
ta: வரைபடத்தில் காட்டப்பட்டுள்ள புதிய படிநிலை அறிமுகப்படுத்துகிறது:
te: రేఖాచిత్రంలో చూపబడిన కొత్త సోపానక్రమం వీటిని పరిచయం చేస్తుంది:

source: A base and abstract class `BaseKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.BaseKernel.html>`__ is introduced. All concrete implementation must inherit this class.
de: Eine Basis und abstrakte Klasse `BaseKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.BaseKernel.html>`__ wird eingeführt. Alle konkreten Implementierungen müssen diese Klasse übernehmen.
es_un: Se introduce una clase base y abstracta `BaseKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.BaseKernel.html>`__. Toda implementación concreta debe heredar de esta clase.
ja: ベースとなる抽象クラス `BaseKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.BaseKernel.html>`__ が導入されました。すべての具体的な実装は、このクラスを継承する必要があります。
ta: அடிப்படை மற்றும் சுருக்க வகுப்பு `BaseKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.BaseKernel.html>`__ அறிமுகப்படுத்தப்பட்டது. அனைத்து உறுதியான செயலாக்கங்களும் இந்த வகுப்பைப் பெற வேண்டும்.
te: బేస్ మరియు ఆబ్స్ట్రాక్ట్ క్లాస్ `BaseKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.BaseKernel.html>`__ పరిచయం చేయబడింది. అన్ని కాంక్రీట్ ఇంప్లిమెంటేషన్ తప్పనిసరిగా ఈ క్లాస్ ని వారసత్వంగా పొందాలి.

source: A fidelity based quantum kernel `FidelityQuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.FidelityQuantumKernel.html>`__ is added. This is a direct **replacement** of the previous quantum kernel implementation. The difference is that the new class takes a fidelity instance to estimate overlaps and construct kernel matrix.
de: Ein Fidelität-basierter Quantum-Kernel `FidelityQuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.FidelityQuantumKernel.html>`__ wurde hinzugefügt. Dies ist ein direkter **Ersatz** der vorherigen Quantum-Kernel-Implementierung. Der Unterschied ist, dass die neue Klasse eine Fidelität-Instanz benutzt, um Überlappungen zu bewerten und Kernel-Matrix zu konstruieren.
es_un: Se agrega un kernel cuántico basado en la fidelidad `FidelityQuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.FidelityQuantumKernel.html>`__. Este es un **reemplazo** directo de la implementación anterior del kernel cuántico. La diferencia es que la nueva clase toma una instancia de fidelidad para estimar las superposiciones y construir la matriz del kernel.
ja: Fidelity ベースの量子カーネル `FidelityQuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.FidelityQuantumKernel.html>`__ が追加されました。これは、以前の量子カーネル実装をそのまま置き換えたものです。新しいクラスは、オーバーラップを推定し、カーネル行列を構築するために、Fidelity(忠実度)のインスタンスを取るという違いがあります。
ta: நம்பகத்தன்மை அடிப்படையிலான குவாண்டம் கர்னல் `FidelityQuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.FidelityQuantumKernel.html>`__ சேர்க்கப்பட்டது. இது முந்தைய குவாண்டம் கர்னல் செயலாக்கத்தின் நேரடி **replacement** ஆகும். வித்தியாசம் என்னவென்றால், புதிய வகுப்பு ஒன்றுடன் ஒன்று மதிப்பிடுவதற்கும் கர்னல் மேட்ரிக்ஸை உருவாக்குவதற்கும் நம்பகத்தன்மையை எடுத்துக்கொள்கிறது.
te: ఫిడెలిటీ ఆధారిత క్వాంటం కెర్నల్ `FidelityQuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.FidelityQuantumKernel.html>`__ జోడించబడింది. ఇది మునుపటి క్వాంటం కెర్నల్ ఇంప్లిమెంటేషన్ యొక్క ప్రత్యక్ష **భర్తీ**. వ్యత్యాసం ఏమిటంటే, కొత్త క్లాస్ అతివ్యాప్తులను అంచనా వేయడానికి మరియు కెర్నల్ మాతృకను నిర్మించడానికి ఫిడిలిటీ ఇన్స్టన్స్ ను తీసుకుంటుంది.

source: A new abstract class `TrainableKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.TrainableKernel.html>`__ is introduced to generalize ability to train quantum kernels.
de: Eine neue abstrakte Klasse `TrainableKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.TrainableKernel.html>`__ ist eingeführt, um Quantum-Kernels zu trainieren.
es_un: Se introduce una nueva clase abstracta `TrainableKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.TrainableKernel.html>`__ para generalizar la capacidad de entrenar kernels cuánticos.
ja: また、量子カーネルを学習するための抽象クラス `TrainableKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.TrainableKernel.html>`__ が追加されました．
ta: குவாண்டம் கர்னல்களைப் பயிற்றுவிக்கும் திறனைப் பொதுமைப்படுத்த ஒரு புதிய சுருக்க வகுப்பு `TrainableKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.TrainableKernel.html>`__ அறிமுகப்படுத்தப்பட்டது.
te: క్వాంటం కెర్నల్‌లకు శిక్షణ ఇచ్చే సామర్థ్యాన్ని సాధారణీకరించడానికి కొత్త ఆబ్స్ట్రాక్ట్ క్లాసు `TrainableKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.TrainableKernel.html>`__ పరిచయం చేయబడింది.

source: A fidelity-based trainable quantum kernel `TrainableFidelityQuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.TrainableFidelityQuantumKernel.html>`__ is introduced. This is a **replacement** of the previous quantum kernel if a trainable kernel is required. The trainer `QuantumKernelTrainer <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.alogrithms.QuantumKernelTrainer.html>`__ now accepts both quantum kernel implementations, the new one and the previous one.
de: Ein Fidelität-basierter Quantum-Kernel `TrainableFidelityQuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.TrainableFidelityQuantumKernel.html>`__ wurde wurde hinzugefügt. Dies ist ein direkter **Ersatz** des vorherigen Quantum-Kernels, falls ein trainierbarer Kernel erforderlich ist. Der Trainier `QuantumKernelTrainer <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.alogrithms.QuantumKernelTrainer.html>`__ akzeptiert nun auch beide Quantum-Kernel-Implementierungen, sowohl die neue als auch die vorherige.
es_un: Se presenta un kernel cuántico entrenable basado en la fidelidad `TrainableFidelityQuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.TrainableFidelityQuantumKernel.html>`__. Este es un **reemplazo** del kernel cuántico anterior si se requiere un kernel entrenable. El entrenador `QuantumKernelTrainer <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.alogrithms.QuantumKernelTrainer.html>`__ ahora acepta implementaciones de kernel cuántico, la nueva y la anterior.
ja: Fidelity ベースの量子カーネル `TrainableFidelityQuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.TrainableFidelityQuantumKernel.html>`__ が導入されました．これは、従来の量子カーネルを **置き換える** もので、訓練可能なカーネルが必要な場合に使用します。トレーナである `QuantumKernelTrainer <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.alogrithms.QuantumKernelTrainer.html>`__ は，新型と旧型の両方の量子カーネルを受け入れることができるようになりました。
ta: நம்பகத்தன்மை அடிப்படையிலான பயிற்சியளிக்கக்கூடிய குவாண்டம் கர்னல் `TrainableFidelityQuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.TrainableFidelityQuantumKernel>`__ is அறிமுகப்படுத்தப்பட்டது. பயிற்சியளிக்கக்கூடிய கர்னல் தேவைப்பட்டால், இது முந்தைய குவாண்டம் கர்னலின் **replacement** ஆகும். பயிற்சியாளர் `QuantumKernelTrainer <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.alogrithms.QuantumKernelTrainer.html>`__ இப்போது புதிய குவாண்டம் மற்றும் ஒரு கெர்னலைச் செயல்படுத்துகிறது.
te: ఫిడిలిటీ-ఆధారితంగా శిక్షణ పొందగలిగే క్వాంటం కెర్నల్ `TrainableFidelityQuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.TrainableFidelityQuantumKernel.html>`__ పరిచయం చేయబడింది. శిక్షణ పొందగల కెర్నల్ అవసరమైతే ఇది మునుపటి క్వాంటం కెర్నల్ని **భర్తీ** చేస్తుంది. ట్రైనర్ `QuantumKernelTrainer <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.alogrithms.QuantumKernelTrainer.html>`__ ఇప్పుడు కొత్త మరియు పాత క్వాంటం కెర్నల్ ఇంప్లిమెంటేషన్లు రెండింటినీ అంగీకరిస్తుంది.

source: For convenience, the previous quantum kernel implementation, `QuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.QuantumKernel.html>`__, now extends both new abstract classes and thus it is compatible with the new introduced interfaces. This implementation is now **pending deprecation**, will be deprecated in a future release and subsequently removed after that. New, primitive-based quantum kernels should be used instead.
de: Zur Bequemlichkeit, die vorherige Quantum-Kernel-Implementierung, `QuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.QuantumKernel.html>`__, erweitert nun die beiden neuen abstrakten Klassen und ist somit Kompatibel mit den neu eingeführten Schnittstellen. Diese Implementierung ist nun **zur Abkündigung vorgesehen**, wird in einer zukünftigen Version veraltet sein und anschließend entfernt werden. Stattdessen sollten neue, Primitiv-basierte Quantum-Kernels verwendet werden.
es_un: Por conveniencia, la implementación anterior del kernel cuántico, `QuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.QuantumKernel.html>`__, ahora extiende ambas clases abstractas nuevas y, por lo tanto, es compatible con las nuevas interfaces introducidas. Esta implementación ahora está **pendiente de obsolescencia**, quedará obsoleta en una versión futura y posteriormente se eliminará después de eso. En su lugar, se deben usar los nuevos kernels cuánticos basados en primitivas.
ja: 以前の量子カーネル実装である`QuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.QuantumKernel.html>`__ は，新しい抽象クラスを継承しており，新しく導入されたインターフェースと互換性を持っています．この実装は 現在 **非推奨** であり，将来のリリースで非推奨となり，その後削除される予定です。新しいプリミティブベースの量子カーネルを使用する必要があります。
ta: வசதிக்காக, முந்தைய குவாண்டம் கர்னல் செயல்படுத்தல், `QuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.QuantumKernel.html>`__, இப்போது இரண்டும் புதிய ஆப்ஸ்காம் வகுப்புகளை விரிவுபடுத்துகிறது. அறிமுகப்படுத்தப்பட்ட புதிய இடைமுகங்களுடன். இந்தச் செயல்படுத்தல் இப்போது ** pending deprecation**, எதிர்கால வெளியீட்டில் நிறுத்தப்பட்டு, அதன் பிறகு அகற்றப்படும். அதற்கு பதிலாக புதிய, பழமையான அடிப்படையிலான குவாண்டம் கர்னல்கள் பயன்படுத்தப்பட வேண்டும்.
te: సౌలభ్యం కోసం, మునుపటి క్వాంటం కెర్నల్ ఇంప్లిమెంటేషన్, `QuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.QuantumKernel.html>`__, ఇప్పుడు కొత్త అబ్స్ట్రాక్ట్ క్లాస్లను ఎక్స్టెండ్ చేస్తుంది మరియు కొత్తగా ప్రవేశపెట్టిన ఇంటర్‌ఫేస్‌లతో అనుకూలిస్తుంది. ఈ అమలు ఇప్పుడు **పెండింగ్ డిప్రెకషన్లో**, భవిష్యత్ విడుదలలో నిలిపివేయబడుతుంది మరియు ఆ తర్వాత తీసివేయబడుతుంది. బదులుగా కొత్త, ప్రిమిటివ్-ఆధారిత క్వాంటం కెర్నల్‌లను ఉపయోగించాలి.

source: The existing algorithms such as `QSVC <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QSVC.html>`__, `QSVR <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QSVR.html>`__ and other kernel-based algorithms are updated and work with both implementations.
de: Die vorhandenen Algorithmen wie `QSVC <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QSVC.html>`__, `QSVR <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QSVR.html>`__ und andere kernel-basierte Algorithmen werden aktualisiert und funktionieren mit beiden Implementierungen.
es_un: Los algoritmos existentes como `QSVC <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QSVC.html>`__, `QSVR <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QSVR.html>`__ y otros algoritmos basados en kernel están actualizados y funcionan con ambas implementaciones.
ja: `QSVC <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QSVC.html>`__、`QSVR <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QSVR.html>`__、その他のカーネルベースのアルゴリズムは更新され、両方の実装で動作するようになります。
ta: தற்போதுள்ள அல்காரிதம்களான `QSVC <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QSVC.html>`__, `QSVR <https://qiskit.org/documentation/machine- learning/stubs/qiskit_machine_learning.algorithms.QSVR.html>`__ மற்றும் பிற கர்னல் அடிப்படையிலான அல்காரிதம்கள் புதுப்பிக்கப்பட்டு இரண்டு செயலாக்கங்களுடனும் வேலை செய்கின்றன.
te: ప్రస్తుతం ఉన్న అల్గారిథమ్‌లైన `QSVC <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QSVC.html>`__, `QSVR <https://qiskit.org/documentation/machine- learning/stubs/qiskit_machine_learning.algorithms.QSVR.html>`__ మరియు ఇతర కెర్నల్-ఆధారిత అల్గోరిథంలు నవీకరించబడ్డాయి మరియు ఇంప్లిమెంటేషన్ల తో పని చేయబడుతుంది.

source: For example a QSVM classifier can be trained as follows.
de: Zum Beispiel kann ein QSVM-Klassifizierer wie folgt trainiert werden.
es_un: Por ejemplo, un clasificador QSVM se puede entrenar de la siguiente manera.
ja: 例えば，QSVM分類器は以下のように学習させることができます。
ta: உதாரணமாக ஒரு QSVM வகைப்படுத்தியை பின்வருமாறு பயிற்சி செய்யலாம்.
te: ఉదాహరణకు QSVM వర్గీకరణకు ఈ క్రింది విధంగా శిక్షణ ఇవ్వవచ్చు.

source: Create a dataset
de: Datensatz erstellen
es_un: Crear un conjunto de datos
ja: データセットの準備
ta: தரவுத்தொகுப்பை உருவாக்கவும்
te: డేటాసెట్‌ను సృష్టించండి

source: Fixing randomization.
de: Zufallsregelung fixieren.
es_un: Fija la aleatorización.
ja: ランダム性を固定します。
ta: சீரற்றமயமாக்கலை சரிசெய்தல்.
te: ఫిక్సింగ్ రాండమైజేషన్.

source: Generate a simple dataset using scikit-learn.
de: Einen einfachen Datensatz mit scikit-learn erstellen.
es_un: Genera un conjunto de datos simple usando scikit-learn.
ja: Scikit-learn を使用して簡単なデータセットを生成します。
ta: Scikit-learn ஐப் பயன்படுத்தி எளிய தரவுத்தொகுப்பை உருவாக்கவும்.
te: Scikit-learn ఉపయోగించి సాధారణ డేటాసెట్‌ను తయారుచేయండి.

source: Previous implementation of quantum kernel
de: Vorherige Implementierung von Quantum Kernel
es_un: Implementación previa del kernel cuántico
ja: 量子カーネルの以前の実装
ta: குவாண்டம் கர்னலின் முந்தைய செயலாக்கம்
te: క్వాంటం కెర్నల్ యొక్క మునుపటి ఇంప్లిమెంటేషన్

source: In the previous implementation we start from creating an instance of ``QuantumInstance``. This class defines where our quantum circuits are executed. In this case we wrap a statevector simulator in the quantum instance.
de: In der vorherigen Implementierung beginnen wir damit, eine Instanz von ``QuantumInstance`` zu erstellen. Diese Klasse legt fest, wo unsere Quantenschaltungen ausgeführt werden. In diesem Fall wickeln wir einen Zustandsvektor-Simulator in der Quanteninstanz ab.
es_un: En la implementación anterior comenzamos creando una instancia de ``QuantumInstance``. Esta clase define dónde se ejecutan nuestros circuitos cuánticos. En este caso encapsulamos un simulador de vector de estado en la instancia cuántica.
ja: 前回の実装では、 ``QuantumInstance`` のインスタンスを作成するところから始めました。このクラスは、量子回路が実行される場所を定義します。今回は、量子インスタンスに状態ベクトルシミュレーターをラップしています。
ta: முந்தைய செயலாக்கத்தில், ``QuantumInstance`` நிகழ்வை உருவாக்குவதிலிருந்து தொடங்குகிறோம். இந்த வகுப்பு நமது குவாண்டம் சுற்றுகள் எங்குச் செயல்படுத்தப்படுகிறது என்பதை வரையறுக்கிறது. இந்த வழக்கில் நாம் குவாண்டம் நிகழ்வில் ஒரு ஸ்டேட்வெக்டர் சிமுலேட்டரை மூடுகிறோம்.
te: మునుపటి ఇంప్లిమెంటేషన్లో మనం ``QuantumInstance`` యొక్క ఇనిస్టాన్స్ను సృష్టించడం నుండి ప్రారంభిస్తాము. ఈ క్లాస్ మన క్వాంటం సర్క్యూట్‌లు ఎక్కడ అమలు చేయబడతాయో నిర్వచిస్తుంది. ఈ సందర్భంలో మనము క్వాంటం ఇనిస్టాన్స్లో స్టేట్‌వెక్టర్ సిమ్యులేటర్‌ను వ్రాప్ చేస్తాము.

source: Then create a quantum kernel.
de: Dann einen Quantum Kernel erstellen.
es_un: Luego crea un núcleo cuántico.
ja: その後、量子カーネルを作ります。
ta: பின்னர் ஒரு குவாண்டம் கர்னலை உருவாக்கவும்.
te: తరువాత క్వాంటం కెర్నల్‌ను సృష్టించండి.

source: And finally we fit an SVM classifier.
de: Und schließlich fitten wir einen SVM Klassifizierer.
es_un: Y finalmente ajustamos un clasificador SVM.
ja: そして最終的にはSVM分類器に適合します。
ta: இறுதியாக நாம் ஒரு SVM வகைப்படுத்தியைப் பொருத்துகிறோம்.
te: చివరగా మనము SVM వర్గీకరణను ఫిట్ చేస్తాము.

source: New implementation of quantum kernel
de: Neue Implementierung von Quantum Kernel
es_un: Nueva implementación del kernel cuántico
ja: 新しい量子カーネル実装
ta: விசை: குவாண்டம் கர்னலின் புதிய செயலாக்கம்
te: క్వాంటం కెర్నెల్ యొక్క కొత్త అమలు
