Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/migration/01_migration_guide_0.5.po
Languages: de, es_un, ja, ta, te

source: Create an instance of the reference Estimator. You may create an estimator instance from `QiskitRuntimeService <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html>`__ to leverage Qiskit runtime services.
de: Zunächst eine Instanz des Referenz Estimators erstellen. Man kann eine Estimator-Instanz von `QiskitRuntimeService <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html>`__ erstellen, um Qiskit-Runtime-Dienste zu nutzen.
es_un: Crea una instancia de Estimator de referencia. Puedes crear una instancia de estimator desde `QiskitRuntimeService <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html>`__ para aprovechar los servicios de Qiskit runtime.
ja: リファレンスであるEstimatorのインスタンスを作成します。Qiskitのruntimeサービスを活用するため、`QiskitRuntimeService <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html>`__からEstimatorのインスタンスを作成することもできます。
ta: குறிப்பு மதிப்பீட்டாளரின் உதாரணத்தை உருவாக்கவும். Qiskit இயக்க நேரத்தை மேம்படுத்த, `QiskitRuntimeService <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html>`__ இலிருந்து ஒரு மதிப்பீட்டாளர் நிகழ்வை நீங்கள் உருவாக்கலாம்.
te: రిఫరెన్స్ ఎస్టిమేటర్ యొక్క ఇన్స్టెన్స్ను సృష్టించండి. Qiskit రన్‌టైమ్ సేవలను వినియోగించుకోవడానికి మీరు `QiskitRuntimeService <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html>`__ నుండి ఎస్టిమేట్ర్ ఇన్స్టెన్స్ను సృష్టించవచ్చు.

source: Now, we create a instance of ``EstimatorQNN``. The network creates an observable as :math:`Z^{\otimes n}`, where :math:`n` is the number of qubit, if it is not specified.
de: Jetzt erstellen wir eine Instanz von ``EstimatorQNN``. Das Netzwerk erstellt eine Observable als :math:`Z^{\otimes n}`, wobei :math:`n` die Anzahl des Qubits ist, wenn es nicht angegeben ist.
es_un: Ahora, creamos una instancia de ``EstimatorQNN``. La red crea un observable como :math:`Z^{\otimes n}`, donde :math:`n` es el número de qubits, si no se especifica.
ja: ここで、``EstimatorQNN`` のインスタンスを作成する。このネットワークは :math:`Z^{\otimes n}` という観測量をします。ここで :math:`n` は量子ビットの数です。
ta: இப்போது, ​​``EstimatorQNN`` இன் நிகழ்வை உருவாக்குகிறோம். பிணையம் :math:`Z^{\otimes n}` எனக் கவனிக்கக்கூடிய ஒன்றை உருவாக்குகிறது, இதில் :math:`n` என்பது qubit இன் எண்ணிக்கை, அது குறிப்பிடப்படவில்லை என்றால்.
te: ఇప్పుడు, మనము ``EstimatorQNN`` యొక్క ఇన్స్టన్స్ని సృష్టిస్తాము. నెట్‌వర్క్ :math:`Z^{\otimes n}` వలె అబ్సర్వేబుల్ని సృష్టిస్తుంది, ఇక్కడ :math:`n` అనేది క్కుబిట్ సంఖ్య, అది పేర్కొనబడకపోతే.

source: Construct a variational quantum regressor and fit it. In this case we use a gradient based optimizer, thus the network makes use of the `default estimator gradient <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.ParamShiftEstimatorGradient.html>`__ that is created automatically.
de: Zunächst einen Variationalen Quantum Regressor erstellen und ihn anpassen. In diesem Fall verwenden wir einen Gradient-basierenden Optimierer, somit verwendet das Netzwerk den `default estimator gradient <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.ParamShiftEstimatorGradient.html>`__ der automatisch erstellt wird.
es_un: Construye un regresor cuántico variacional y ajústalo. En este caso, usamos un optimizador basado en gradientes, por lo que la red utiliza el `gradiente de estimator predeterminado <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.ParamShiftEstimatorGradient.html>`__ que es creado automáticamente.
ja: 変量量子回帰器を構築し、それをフィッティングします。この場合、勾配ベースのオプティマイザーを使用するため、ネットワークは自動的に作成される `default estimator gradient <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.ParamShiftEstimatorGradient.html>`__ を使用します。
ta: ஒரு மாறுபாடு குவாண்டம் ரிக்ரஸரை உருவாக்கி அதை பொருத்தவும். இந்தச் சந்தர்ப்பத்தில், கிரேடியன்ட் அடிப்படையிலான உகப்பாக்கியைப் பயன்படுத்துகிறோம், இதனால் நெட்வொர்க் தானாகவே உருவாக்கப்படும் `இயல்புநிலை மதிப்பீட்டாளர் சாய்வு <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.ParamShiftEstimatorGradient.html>`__ ஐப் பயன்படுத்துகிறது.
te: వైవిధ్యమైన క్వాంటం రిగ్రెసర్‌ను నిర్మించి, దానిని ఫిట్ చేయండి. ఈ సందర్భంలో మనము గ్రేడియంట్ ఆధారిత ఆప్టిమైజర్‌ని ఉపయోగిస్తాము, ఆ విధంగా నెట్‌వర్క్ స్వయంచాలకంగా సృష్టించబడిన `డిఫాల్ట్ ఎస్టిమేటర్ గ్రేడియంట్ <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.ParamShiftEstimatorGradient.html>`__ని ఉపయోగిస్తుంది.

source: Instead of constructing a quantum neural network manually, you may train ``VQR``. It takes either a quantum instance or an estimator, depending on what is passed it automatically constructs either ``TwoLayerQNN`` or ``EstimatorQNN`` respectively.
de: Anstatt ein neuronales Quantennetzwerk manuell zu konstruieren, kann man``VQR`` trainieren. Es benötigt entweder eine Quanteninstanz oder einen Estimator, je nachdem, was übergeben wird, wird automatisch jeweils entweder``TwoLayerQNN`` oder ``EstimatorQNN`` konstruiert.
es_un: En lugar de construir una red neuronal cuántica manualmente, puedes entrenar un ``VQR``. Toma una quantum instance o un estimator, dependiendo de lo que se pase, automáticamente construye ``TwoLayerQNN`` o ``EstimatorQNN`` respectivamente.
ja: 量子ニューラルネットワークを手動で構築する代わりに、 ``VQR`` をトレーニングすることができます。 ``VQR`` は、量子インスタンスとestimatorを受け取り、渡された内容に応じて、 ``TwoLayerQNN`` と ``EstimatorQNN`` をそれぞれ自動的に構築します。
ta: குவாண்டம் நியூரல் நெட்வொர்க்கை கைமுறையாக உருவாக்குவதற்குப் பதிலாக, நீங்கள் ``VQR``க்கு பயிற்சி அளிக்கலாம். இது ஒரு குவாண்டம் நிகழ்வு அல்லது மதிப்பீட்டை எடுக்கும், அனுப்பப்பட்டதைப் பொறுத்து அது தானாகவே முறையே ``TwoLayerQNN` அல்லது ``EstimatorQNN`` ஐ உருவாக்குகிறது.
te: క్వాంటం న్యూరల్ నెట్‌వర్క్‌ను మాన్యువల్‌గా నిర్మించడానికి బదులుగా, మీరు ``VQR``ని ట్రైన్ చేయవచ్చు. ఇది ఒక క్వాంటం ఇన్‌స్టాన్స్ లేదా ఎస్టిమేటర్‌ను తీసుకుంటుంది, ఆమోదించబడినదానిపై ఆధారపడి అది స్వయంచాలకంగా వరుసగా ``TwoLayerQNN` లేదా ``EstimatorQNN``ని నిర్మిస్తుంది.

source: A few other components, not mentioned explicitly above, are also deprecated or pending deprecation:
de: Einige andere Komponenten, die oben nicht explizit erwähnt wurden, sind ebenfalls veraltet oder stehen zur Verwerfung an:
es_un: Algunos otros componentes, no mencionados explícitamente anteriormente, también están obsoletos o están pendientes de obsolescencia:
ja: 上記で明確に言及されていない他のいくつかのコンポーネントも、非推奨または非推奨保留となっています：
ta: மேலே வெளிப்படையாகக் குறிப்பிடப்படாத வேறுசில கூறுகளும் நிராகரிக்கப்பட்டுள்ளன அல்லது தேய்மானம் நிலுவையில் உள்ளன:
te: పైన స్పష్టంగా పేర్కొనబడని కొన్ని ఇతర భాగాలు కూడా డిప్రికాట్ చేయబడ్డాయి లేదా డిప్రికాషన్ పెండింగ్ లో ఉన్నాయి:

source: `TwoLayerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.TwoLayerQNN.html>`__ is pending deprecation. Users should use `EstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ instead.
de: `TwoLayerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.TwoLayerQNN.html>`__ wird bald veraltet sein. Benutzer sollten stattdessen `EstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ verwenden.
es_un: `TwoLayerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.TwoLayerQNN.html>`__ está pendiente de ser obsoleto. Los usuarios deben usar `EstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ en su lugar.
ja: `TwoLayerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.TwoLayerQNN.html>`__ は非推奨です。ユーザーは代わりにEstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ を使うべきです。
ta: `TwoLayerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.TwoLayerQNN.html>`__ தேக்கம் நிலுவையில் உள்ளது. பயனர்கள் அதற்குப் பதிலாக `EstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ ஐப் பயன்படுத்த வேண்டும்.
te: `TwoLayerQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.TwoLayerQNN.html>`__ పెండింగ్ డిప్రెకషన్లో ఉంది. బదులుగా వినియోగదారులు `EstimatorQNN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.neural_networks.EstimatorQNN.html>`__ని ఉపయోగించాలి.

source: The Distribution Learners package is deprecated fully. This package contains such classes as `DiscriminativeNetwork <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.DiscriminativeNetwork.html>`__, `GenerativeNetwork <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.GenerativeNetwork.html>`__, `NumPyDiscriminator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.NumPyDiscriminator.html>`__, `PyTorchDiscriminator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.PyTorchDiscriminator.html>`__, `QuantumGenerator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QuantumGenerator.html>`__, `QGAN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QGAN.html>`__. Instead, please refer to the `new QGAN tutorial <../tutorials/04_torch_qgan.ipynb>`__. This tutorial introduces step-by-step how to build a PyTorch-based QGAN using quantum neural networks.
de: Das Distribution-Learners-Paket ist vollständig veraltet. Dieses Paket enthält Klassen wie `DiscriminativeNetwork <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.DiscriminativeNetwork.html>`__, `GenerativeNetwork <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.GenerativeNetwork.html>`__, `NumPyDiscriminator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.NumPyDiscriminator.html>`__, `PyTorchDiscriminator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.PyTorchDiscriminator.html>`__, `QuantumGenerator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QuantumGenerator.html>`__, `QGAN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QGAN.html>`__. Stattdessen bitte das neue `new QGAN Tutorial <../tutorials/04_torch_qgan.ipynb>`__ lesen. Dieses Tutorial führt Schritt für Schritt ein, wie man ein PyTorch basiertes QGAN mit neuronal Quantennetze baut.
es_un: El paquete Distribution Learners está totalmente obsoleto. Este paquete contiene clases como `DiscriminativeNetwork <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.DiscriminativeNetwork.html>`__, `GenerativeNetwork <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.GenerativeNetwork.html>`__, `NumPyDiscriminator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.NumPyDiscriminator.html>`__, `PyTorchDiscriminator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.PyTorchDiscriminator.html>`__, `QuantumGenerator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QuantumGenerator.html>`__, `QGAN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QGAN.html>`__. En su lugar, consulta el `nuevo tutorial de QGAN <../tutorials/04_torch_qgan.ipynb>`__. Este tutorial presenta paso a paso cómo construir una QGAN basada en PyTorch utilizando redes neuronales cuánticas.
ja: Distribution Learners パッケージは完全に非推奨です．このパッケージは `DiscriminativeNetwork <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.DiscriminativeNetwork.html>`__, `GenerativeNetwork <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.GenerativeNetwork.html>`__, `NumPyDiscriminator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.NumPyDiscriminator.html>`__, `PyTorchDiscriminator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.PyTorchDiscriminator.html>`__, `QuantumGenerator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QuantumGenerator.html>`__, `QGAN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QGAN.html>`__ などのクラスが含まれています。代わりに、`新しいQGANチュートリアル <../tutorials/04_torch_qgan.ipynb>`__を参照してください。このチュートリアルでは、量子ニューラルネットワークを用いたPyTorchベースのQGANの構築方法をステップバイステップで紹介しています。
ta: Distribution Learners தொகுப்பு முழுமையாக நிராகரிக்கப்பட்டது. இந்தப் பேக்கேஜில் `DiscriminativeNetwork <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.DiscriminativeNetwork.html>`__, `GenerativeNetwork <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.GenerativeNetwork.html>`__, `NumPyDiscriminator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.NumPyDiscriminator.html>`__, `PyTorchDiscriminator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.PyTorchDiscriminator.html>`__, `QuantumGenerator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QuantumGenerator.html>`__, `QGAN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QGAN.html>`__. அதற்கு பதிலாக, தயவுசெய்து `புதிய QGAN டுடோரியலைப் பார்க்கவும் <../tutorials/04_torch_qgan.ipynb>`__. குவாண்டம் நியூரல் நெட்வொர்க்குகளைப் பயன்படுத்தி பைடார்ச் அடிப்படையிலான QGAN ஐ எவ்வாறு உருவாக்குவது என்பதை இந்தப் பயிற்சி படிப்படியாக அறிமுகப்படுத்துகிறது.
te: డిస్ట్రిబ్యూషన్ లెర్నర్స్ ప్యాకేజీ పూర్తిగా నిలిపివేయబడింది. ఈ ప్యాకేజీ `DiscriminativeNetwork <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.DiscriminativeNetwork.html>`__, `GenerativeNetwork <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.GenerativeNetwork.html>`__, `NumPyDiscriminator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.NumPyDiscriminator.html>`__, `PyTorchDiscriminator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.PyTorchDiscriminator.html>`__, `QuantumGenerator <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QuantumGenerator.html>`__, `QGAN <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.algorithms.QGAN.html>`__ మొదలగు క్లాస్లని కలిగి ఉంటుంది. బదులుగా, దయచేసి `కొత్త QGAN ట్యుటోరియల్ <../tutorials/04_torch_qgan.ipynb>`__ని చూడండి. క్వాంటం న్యూరల్ నెట్‌వర్క్‌లను ఉపయోగించి PyTorch-ఆధారిత QGANని ఎలా నిర్మించాలో ఈ ట్యుటోరియల్ దశల వారీగా పరిచయం చేస్తుంది.

source: The Runtime package is deprecated. This package contains a client to Qiskit Programs that embed Qiskit Runtime in the algorithmic interfaces and facilitate usage of algorithms and scripts in the cloud. You should use `QiskitRuntimeService <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html>`__ to leverage primitives and runtimes.
de: Das Runtime-Paket ist veraltet. Dieses Paket enthält einen Client für Qiskit Programme, die Qiskit Runtime in die algorithmischen Schnittstellen einbinden und die Verwendung von Algorithmen und Skripten in der Cloud erleichtern. Man sollte `QiskitRuntimeService <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html>`__ verwenden, um Primitiven und Runtimes zu nutzen.
es_un: El paquete Runtime está obsoleto. Este paquete contiene un cliente para los programas de Qiskit que integran Qiskit Runtime en las interfaces algorítmicas y facilitan el uso de algoritmos y scripts en la nube. Debes usar `QiskitRuntimeService <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html>`__ para aprovechar las primitivas y los runtimes.
ja: Runtimeパッケージは非推奨です。このパッケージには、アルゴリズムインターフェイスにQiskit Runtimeを組み込み、クラウドでのアルゴリズムやスクリプトの使用を容易にするQiskit Programsへのクライアントが含まれています。Primitiveやruntimeを活用するには、`QiskitRuntimeService <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html>`__ を使用する必要があります。
ta: இயக்க நேர தொகுப்பு நிறுத்தப்பட்டது. அல்காரிதம் இடைமுகங்களில் Qiskit இயக்க நேரத்தை உட்பொதித்து, கிளவுட்டில் அல்காரிதம்கள் மற்றும் ஸ்கிரிப்ட்களைப் பயன்படுத்துவதற்கு வசதியாக இருக்கும் Qiskit நிரல்களுக்கான கிளையண்ட் இந்த தொகுப்பில் உள்ளது. ஆரம்பநிலைகள் மற்றும் இயக்க நேரங்களைப் பயன்படுத்த, நீங்கள் `QiskitRuntimeService <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html>`__ ஐப் பயன்படுத்த வேண்டும்.
te: రన్‌టైమ్ ప్యాకేజీ విస్మరించబడింది. ఈ ప్యాకేజీ Qiskit ప్రోగ్రామ్‌లకు క్లయింట్‌ను కలిగి ఉంది, ఇది Qiskit రన్‌టైమ్‌ను అల్గారిథమిక్ ఇంటర్‌ఫేస్‌లలో పొందుపరిచింది మరియు క్లౌడ్‌లో అల్గారిథమ్‌లు మరియు స్క్రిప్ట్‌ల వినియోగాన్ని సులభతరం చేస్తుంది. మీరు ప్రిమిటివులని మరియు రన్‌టైమ్‌లను ప్రభావితం చేయడానికి `QiskitRuntimeService <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html>`__ని ఉపయోగించాలి.

source: Algorithms to calculate the gradient of a quantum circuit. For each core primitive there’s a corresponding base interface that defines quantum circuit gradient. The documentation on gradients is `here <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.html>`__.
de: Algorithmen zur Berechnung des Gradienten einer Quantenschaltung. Für jedes Kernelement von Primitven gibt es eine entsprechende Basis-Schnittstelle, die Quantenschaltverläufe definiert. Die Dokumentation über Verläufe ist `hier <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.html>`__.
es_un: Algoritmos para calcular el gradiente de un circuito cuántico. Para cada núcleo primitivo hay una interfaz base correspondiente que define el gradiente del circuito cuántico. La documentación sobre gradientes está `aquí <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.html>`__.

source: Algorithms that compute the fidelity or “closeness” of pairs of quantum states. Currently, only one implementation is available that requires a sampler primitive and is based on the compute-uncompute method. The documentation is `here <https://qiskit.org/documentation/stubs/qiskit.algorithms.state_fidelities.html>`__.
de: Algorithmen, die die Fidalität oder die "Nähe" von Paaren von Quantenzuständen berechnen. Derzeit ist nur eine Implementierung verfügbar, die ein Sampler-Primitive erfordert und auf der Methode "Compute-Uncompute" basiert. Die Dokumentation ist ` hier <https://qiskit.org/documentation/stubs/qiskit.algorithms.state_fidelities.html>` __.
es_un: Algoritmos que calculan la fidelidad o “cercanía” de pares de estados cuánticos. Actualmente, solo hay disponible una implementación que requiere una primitiva sampler y se basa en el método de computación-descomputación. La documentación está `aquí <https://qiskit.org/documentation/stubs/qiskit.algorithms.state_fidelities.html>`__.

source: We’ll show how to train a variational quantum classifier using both networks. For this purposes we re-use the dataset generated for the quantum kernel. For both quantum neural networks we still have to construct a feature map, an ansatz and combine them into a single quantum circuit.
de: Wir zeigen, wie man einen Variations-Quantum-Klassifizierer mit beiden Netzwerken trainiert. Zu diesem Zweck verwenden wir der für den Quantum-Kernel generierten Datensatz erneut. Für beide neuronale Quantennetze müssen wir noch eine Feature-Map, einen Ansatz, konstruieren und zu einer einzigen Quantenschaltung kombinieren.
es_un: Mostraremos cómo entrenar un clasificador cuántico variacional utilizando ambas redes. Para estos fines, reutilizamos el conjunto de datos generado para el kernel cuántico. Para ambas redes neuronales cuánticas todavía tenemos que construir un mapa de características, un ansatz y combinarlos en un solo circuito cuántico.

source: We’ll show how to train a variational quantum regressor using both networks. We start from generating a simple regression dataset.
de: Wir zeigen, wie ein variationaler Quantum-Regressor mit beiden Netzwerken trainiert werden kann. Wir beginnen damit, ein einfaches Regressions-Dataset zu generieren.
es_un: Mostraremos cómo entrenar un regresor cuántico variacional usando ambas redes. Comenzamos generando un conjunto de datos de regresión simple.

source: Quantum Kernel Diagram
es_un: Diagrama de Kernel Cuántico
