Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/migration/01_migration_guide_0.5.po
Languages: de, es_un, ja, ta, te

source: This page was generated from `docs/migration/01_migration_guide_0.5.ipynb`__.
de: Diese Seite wurde aus ` docs/migration/01_migration_guide_to_v0.5.ipynb ` __ generiert.
ja: このページは `docs/migration/01_migration_guide_0.5.ipynb`__ から生成されました。
ta: இந்தப் பக்கம் `docs/migration/01_migration_guide_0.5.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Qiskit Machine Learning v0.5 Migration Guide
de: Qiskit Machine Learning v0.5 Migrationshandbuch
es_un: Guía de Migración de Qiskit Machine Learning v0.5
ja: Qiskit Machine Learning v0.5 移行ガイド
ta: கிஸ்கிட் இயந்திர கற்றல் v0.5 இடம்பெயர்வு வழிகாட்டி
te: Qiskit మెషిన్ లెర్నింగ్ v0.5 మైగ్రేషన్ గైడ్

source: This tutorial will guide you through the process of migrating your code from Qiskit Machine Learning v0.4 to v0.5.
de: Dieses Tutorial führt Sie durch den Prozess der Migration Ihres Codes von Qiskit Machine Learning v0.4 auf v0.5.
es_un: Este tutorial te guiará a través del proceso de migración de tu código de Qiskit Machine Learning v0.4 a v0.5.
ja: このチュートリアルでは、コードを Qiskit Machine Learning v0.4 から v0.5 へマイグレーションするプロセスをガイドします。
ta: இந்த டுடோரியல் உங்கள் குறியீட்டை Qiskit Machine Learning v0.4 இலிருந்து v0.5 க்கு மாற்றும் செயல்முறையின் மூலம் உங்களுக்கு வழிகாட்டும்.
te: ఈ ట్యుటోరియల్ మీ కోడ్‌ని Qiskit మెషిన్ లెర్నింగ్ v0.4 నుండి v0.5కి మార్చే ప్రక్రియ ద్వారా మీకు మార్గనిర్దేశం చేస్తుంది.

source: Introduction
de: Einführung
es_un: Introducción
ja: はじめに
ta: அறிமுகம்
te: పరిచయం

source: The main focus of the 0.5 release of Qiskit Machine Learning is the migration of the base computational blocks like quantum kernels and quantum neural networks to the primitives introduced in Qiskit as well as extended support of the primitives in the algorithms.
de: Der Hauptfokus des 0.5 Release von Qiskit Machine Learning ist die Migration der Basisrechnerblöcke wie Quantenkernels und Neuronale Quantennetzwerke zu den in Qiskit eingeführten Primitiven sowie die erweiterte Unterstützung der Primitiven in den Algorithmen.
es_un: El objetivo principal de la versión 0.5 de Qiskit Machine Learning es la migración de los bloques computacionales básicos, como los kernels cuánticos y las redes neuronales cuánticas, a las primitivas introducidas en Qiskit, así como la compatibilidad ampliada con las primitivas en los algoritmos.
ja: Qiskit Machine Learning のリリース0.5における主な焦点は、Qiskitで導入されたPrimitiveへの量子カーネルや量子ニューラルネットワークなどのベースの計算ブロックの移行と、アルゴリズムにおけるprimitiveの拡張サポートです。
ta: Qiskit மெஷின் லேர்னிங்கின் 0.5 வெளியீட்டின் முக்கிய கவனம் குவாண்டம் கர்னல்கள் மற்றும் குவாண்டம் நியூரல் நெட்வொர்க்குகள் போன்ற அடிப்படை கணக்கீட்டு தொகுதிகளை Qiskit இல் அறிமுகப்படுத்தப்பட்ட பழமையானவற்றிற்கு நகர்த்துவது மற்றும் அல்காரிதங்களில் உள்ள ஆதிநிலைகளின் நீட்டிக்கப்பட்ட ஆதரவு ஆகும்.
te: Qiskit మెషిన్ లెర్నింగ్ యొక్క 0.5 విడుదల యొక్క ప్రధాన దృష్టి క్వాంటం కెర్నలు మరియు క్వాంటం న్యూరల్ నెట్‌వర్క్‌ల వంటి బేస్ కంప్యూటేషనల్ బ్లాక్‌లను Qiskitలో ప్రవేశపెట్టిన ప్రిమ్మిటివ్స్లకు అలాగే అల్గారిథమ్‌లలోని ప్రిమ్మిటివ్స్ల యొక్క విస్తృతమైన మద్దతుగా మార్చడం.

source: Contents:
de: Inhalte:
es_un: Contenido:
ja: 目次:
ta: உள்ளடக்கம்:
te: విషయములు:

source: Overview of the primitives
de: Übersicht von "primitives"
es_un: Descripción general de las primitivas
ja: Primitiveの概要
ta: தொடக்கநிலைகளின் கண்ணோட்டம்
te: ప్రిమ్మిటివ్స్ యొక్క ఓవర్వ్యూ

source: New quantum kernel
de: Neuer Quantenkernel
es_un: Nuevo kernel cuántico
ja: 新量子カーネル
ta: புதிய குவாண்டம் கர்னல்
te: కొత్త క్వాంటం కెర్నెల్

source: New quantum neural networks
de: Neue neuronale Quantennetze
es_un: Nuevas redes neuronales cuánticas
ja: 新量子ニューラル・ネットワーク
ta: புதிய குவாண்டம் நியூரல் நெட்வொர்க்குகள்
te: కొత్త క్వాంటం న్యూరల్ నెట్వర్క్లు

source: Other notable deprecation
de: Sonstige nennenswerte Veralterungen
es_un: Otros casos de obsolescencia notables
ja: その他の注意すべき非推奨事項
ta: மற்ற குறிப்பிடத் தக்க நிராகரிப்பு
te: ఇతర ముఖ్యమైన నిరాకరణ

source: The core capability of quantum computers that sets them apart from from classical computers is their ability to generate non-classical probability distributions at their outputs. The native operations that one can do with a probability distribution is to sample from it or to estimate quantities on it. Consequently, these operations of sampling and estimating form the fundamental building blocks of quantum algorithm development. Thus, as it was `announced <https://research.ibm.com/blog/qiskit-runtime-for-useful-quantum-computing>`__, two basic primitives were introduced, Sampler and Estimator, respectively, that implement these two operations:
de: Die Kernfähigkeit von Quantencomputern, die sie von klassischen Computern unterscheiden, ist ihre Fähigkeit, nicht-klassische Wahrscheinlichkeitsverteilungen an ihren Ausgängen zu generieren. Die gängigen Operationen, die man mit einer Wahrscheinlichkeitsverteilung durchführen kann, sind entweder Proben von ihr zu nehemen oder Mengen zu schätzen. Folglich bilden diese Operationen der Probennahme und Schätzung, die grundlegenden Bausteine der Entwicklung von Quantenalgorithmen. So, wie ` <https://research.ibm.com/blog/qiskit-runtime-for-useful-quantum-computing>`__' angekündigt wurde, wurden zwei grundlegende Primitive eingeführt, entweder Sampler und Estimator, die diese beiden Operationen implementieren:
es_un: La capacidad central de las computadoras cuánticas que las distingue de las computadoras clásicas es su capacidad para generar distribuciones de probabilidad no clásicas en sus salidas. Las operaciones nativas que uno puede hacer con una distribución de probabilidad es tomar muestras de ella o estimar cantidades en ella. En consecuencia, estas operaciones de muestreo y estimación forman los bloques de construcción fundamentales del desarrollo de algoritmos cuánticos. Así, como fue `anunciado <https://research.ibm.com/blog/qiskit-runtime-for-useful-quantum-computing>`__, se introdujeron dos primitivas básicas, Sampler y Estimator, respectivamente, que implementan estas dos operaciones:
ja: 量子コンピューターが古典コンピューターと異なる点は、出力に非古典的な確率分布を生成することができる点です。確率分布の基本的な操作は、確率分布からのサンプリングと確率分布に基づく量の推定です。このサンプリングと推定という操作が、量子アルゴリズム開発の基本的な構成要素となっています。そのため、 `こちら <https://research.ibm.com/blog/qiskit-runtime-for-useful-quantum-computing>`_で発表したように，この2つの操作を実装したSamplerとEstimatorという基本プリミティブが導入されました。
ta: கிளாசிக்கல் கம்ப்யூட்டர்களில் இருந்து தனித்து நிற்கும் குவாண்டம் கணினிகளின் முக்கிய திறன், அவற்றின் வெளியீடுகளில் கிளாசிக்கல் அல்லாத நிகழ்தகவு விநியோகங்களை உருவாக்கும் திறன் ஆகும். ஒரு நிகழ்தகவு விநியோகத்துடன் ஒருவர் செய்யக்கூடிய சொந்த செயல்பாடுகள் அதிலிருந்து மாதிரி அல்லது அதன் அளவை மதிப்பிடுவது. இதன் விளைவாக, இந்த மாதிரி மற்றும் மதிப்பிடும் செயல்பாடுகள் குவாண்டம் அல்காரிதம் வளர்ச்சியின் அடிப்படை கட்டுமான தொகுதிகளாக அமைகின்றன. எனவே, <https://research.ibm.com/blog/qiskit-runtime-for-useful-quantum-computing>`__ என அறிவிக்கப்பட்டபடி, இரண்டு அடிப்படை ஆதிநிலைகள் அறிமுகப்படுத்தப்பட்டன, முறையே, சாம்ப்லர் மற்றும் எஸ்டிமேட்டர், இவைகளைச் செயல்படுத்துகின்றன. இரண்டு செயல்பாடுகள்:
te: క్లాసికల్ కంప్యూటర్‌ల నుండి క్వాంటం కంప్యూటర్‌లని వేరు చేసే ప్రధాన సామర్థ్యం వాటి అవుట్‌పుట్‌లలో నాన్-క్లాసికల్ ప్రాబబిలిటీ డిస్ట్రిబ్యూషన్‌లను రూపొందించగల సామర్థ్యం. ప్రాబబిలిటీ డిస్ట్రిబ్యూషన్‌తో ఒకరు చేయగల స్థానిక కార్యకలాపాలు దాని నుండి సాంప్లింగ్ చేయడం లేదా దానిపై పరిమాణాలను ఎస్టిమేట్ వేయడం. పర్యవసానంగా, సాంప్లింగ్ మరియు ఎస్టిమేట్ వేయడం ఈ కార్యకలాపాలు క్వాంటం అల్గారిథమ్ అభివృద్ధి యొక్క ప్రాథమిక బిల్డింగ్ బ్లాక్‌లను ఏర్పరుస్తాయి. ఆ విధంగా, <https://research.ibm.com/blog/qiskit-runtime-for-useful-quantum-computing>`__ అని ప్రకటించబడినందున, వీటిని ఇంప్లిమెంట్ చేసే రెండు ప్రాథమిక ప్రిమిటివ్స్ రెండు ఆపరేషన్లు అయిన సాంప్లర్ మరియు ఎస్టిమేటర్ ప్రవేశపెట్టబడ్డాయి:

source: Sampler class calculates probabilities or quasi-probabilities of bitstrings from quantum circuits. The base class is `qiskit.primitives.BaseSampler <https://qiskit.org/documentation/stubs/qiskit.primitives.BaseSampler.html>`__.
de: Die Sampler-Klasse berechnet Wahrscheinlichkeiten oder Quasi-Wahrscheinlichkeiten von Bitfolgen aus Quantenschaltungen. Die Basisklasse ist ` qiskit.primitives.BaseSampler <https://qiskit.org/documentation/stubs/qiskit.primitives.BaseSampler.html>` __.
es_un: La clase Sampler calcula probabilidades o cuasi-probabilidades de cadenas de bits de circuitos cuánticos. La clase base es `qiskit.primitives.BaseSampler <https://qiskit.org/documentation/stubs/qiskit.primitives.BaseSampler.html>`__.
ja: Samplerクラスは、量子回路のビット列の確率または準確率を計算します。基本クラスは `qiskit.primitives.BaseSampler <https://qiskit.org/documentation/stubs/qiskit.primitives.BaseSampler.html>`__ です。
ta: குவாண்டம் சர்க்யூட்களிலிருந்து பிட்ஸ்ட்ரிங்ஸின் நிகழ்தகவுகள் அல்லது அரை-நிகழ்தகவுகளை மாதிரி வகுப்பு கணக்கிடுகிறது. அடிப்படை வகுப்பு `qiskit.primitives.BaseSampler <https://qiskit.org/documentation/stubs/qiskit.primitives.BaseSampler.html>`__.
te: శాంప్లర్ క్లాస్ క్వాంటం సర్క్యూట్‌ల నుండి బిట్‌స్ట్రింగ్‌ల సంభావ్యత లేదా క్వాసి-సంభావ్యతలను గణిస్తుంది. `qiskit.primitives.BaseSampler <https://qiskit.org/documentation/stubs/qiskit.primitives.BaseSampler.html>`__ అనేది బేస్ క్లాస్.

source: Estimator class estimates expectation values of quantum circuits and observables. The base class is `qiskit.primitives.BaseEstimator <https://qiskit.org/documentation/stubs/qiskit.primitives.BaseEstimator.html>`__.
de: Die Estimator-Klasse schätzt Erwartungswerte von Quantenschaltungen und Observablen. Die Basisklasse ist `qiskit.primitives.BaseEstimator <https://qiskit.org/documentation/stubs/qiskit.primitives.BaseEstimator.html>`__.
es_un: La clase Estimator estima los valores esperados de circuitos cuánticos y observables. La clase base es `qiskit.primitives.BaseEstimator <https://qiskit.org/documentation/stubs/qiskit.primitives.BaseEstimator.html>`__.
ja: Estimatorクラスは、量子回路や観測値の期待値を推定するクラスです。基本クラスは `qiskit.primitives.BaseEstimator <https://qiskit.org/documentation/stubs/qiskit.primitives.BaseEstimator.html>`__ です。
ta: மதிப்பீட்டாளர் வகுப்பு குவாண்டம் சுற்றுகள் மற்றும் கவனிக்கக்கூடியவற்றின் எதிர்பார்ப்பு மதிப்புகளை மதிப்பிடுகிறது. அடிப்படை வகுப்பு `qiskit.primitives.BaseEstimator <https://qiskit.org/documentation/stubs/qiskit.primitives.BaseEstimator.html>`__.
te: ఎస్టిమేటర్ క్లాస్ క్వాంటం సర్క్యూట్‌లు మరియు అబ్సెర్వబల్స్ వాటి అంచనా విలువలను అంచనా వేస్తుంది. దీని బేస్ క్లాస్ `qiskit.primitives.BaseEstimator <https://qiskit.org/documentation/stubs/qiskit.primitives.BaseEstimator.html>`__.

source: Qiskit Terra provides core interfaces and two implementations:
de: Qiskit Terra bietet Kernschnittstellen und zwei Implementierungen:
es_un: Qiskit Terra proporciona interfaces centrales y dos implementaciones:
ja: Qiskit Terraはコアインターフェースと2つの実装を提供します：
ta: கிஸ்கிட் டெர்ரா முக்கிய இடைமுகங்கள் மற்றும் இரண்டு செயலாக்கங்களை வழங்குகிறது:
te: Qiskit Terra కోర్ ఇంటర్‌ఫేస్‌లు మరియు రెండు ఇంప్లిమెంటేషన్ను అందిస్తుంది:

source: The reference implementation that is statevector based. This implementation does require a backend or a simulator, it relies on the classes from the `quantum_info <https://qiskit.org/documentation/apidoc/quantum_info.html>`__ package.
de: Die Referenzimplementierung, die auf Zustandsvektoren basiert. Diese Implementierung erfordert ein Backend oder einen Simulator, sie stützt sich auf die Klassen aus dem `quantum_info <https://qiskit.org/documentation/apidoc/quantum_info.html>`__ Paket.
es_un: La implementación de referencia que está basada en el vector de estado. Esta implementación requiere un backend o un simulador, depende de las clases del paquete `quantum_info <https://qiskit.org/documentation/apidoc/quantum_info.html>`__.
ja: 状態ベクトルベースのリファレンス実装です。この実装はバックエンドやシミュレーターを必要とせず、 `quantum_info <https://qiskit.org/documentation/apidoc/quantum_info.html>`__ パッケージのクラスに依存しています。
ta: ஸ்டேட்வெக்டர் அடிப்படையிலான குறிப்புச் செயலாக்கம். இந்தச் செயலாக்கத்திற்கு பின்தளம் அல்லது சிமுலேட்டர் தேவைப்படுகிறது, இது `குவாண்டம்_இன்ஃபோ <https://qiskit.org/documentation/apidoc/quantum_info.html>`__ தொகுப்பிலிருந்து வரும் வகுப்புகளைச் சார்ந்துள்ளது.
te: రిఫరెన్స్ ఇంప్లిమెంటేషన్ స్టేట్ విక్టర్ పై ఆధారపడినది. ఈ ఇంప్లిమెంటేషన్కు బ్యాకెండ్ లేదా సిమ్యులేటర్ అవసరం, ఇది `quantum_info <https://qiskit.org/documentation/apidoc/quantum_info.html>`__ ప్యాకేజీలోని క్లాస్లపై ఆధారపడుతుంది.

source: The backend based primitives are to support provider/backends that do not support primitives directly. This implementation requires an instance of a backend to be passed to a primitive.
de: Die Backend-basierten Primitive unterstützen Provider/Backends, die nicht Primitive direkt unterstützen. Diese Implementierung setzt voraus, dass eine Instanz eines Backends an eine Primitive übergeben wird.
es_un: Las primitivas basadas en backend son para soportar proveedores/backends que no admiten primitivas directamente. Esta implementación requiere que se pase una instancia de un backend a una primitiva.
ja: バックエンドベースのprimitiveは、primitiveを直接サポートしないプロバイダー/バックエンドをサポートするためのものです。この実装では、primitiveに渡すバックエンドのインスタンスが必要です。
ta: பேக்கெண்ட் அடிப்படையிலான ப்ரிமிடிவ்கள், ப்ரைமிடிவ்களை நேரடியாக ஆதரிக்காத வழங்குநர்/பின்னணிகளை ஆதரிப்பதாகும். இந்தச் செயலாக்கத்திற்கு, ஒரு முதற்பொருளுக்கு அனுப்பப்பட்ட பின்தளத்தின் உதாரணம் தேவைப்படுகிறது.
te: బ్యాకెండ్ ఆధారిత ప్రిమిటివ్‌లు నేరుగా ప్రిమిటివ్‌లకు మద్దతు ఇవ్వని ప్రొవైడర్/బ్యాకెండ్‌లకు మద్దతు ఇవ్వడం కొరకు. ఈ ఇంప్లిమెంటేషన్కు బ్యాకెండ్‌ని ప్రిమిటివ్కు పంపడానికి ఒక ఇన్స్టాన్స్ అవసరం.

source: More information on the Qiskit Terra primitives can be found in the `documentation <https://qiskit.org/documentation/apidoc/primitives.html>`__.
de: Weitere Informationen zu den Qiskit Terra Primitiven kann man in der `Dokumentation <https://qiskit.org/documentation/apidoc/primitives.html>`__ finden.
es_un: Se puede encontrar más información sobre las primitivas de Qiskit Terra en la `documentación <https://qiskit.org/documentation/apidoc/primitives.html>`__.
ja: Qiskit Terra primitiveに関するより詳しい情報は `documentation <https://qiskit.org/documentation/apidoc/primitives.html>`__ に記載されています。
ta: Qiskit Terra primitives பற்றிய கூடுதல் தகவல்களை `ஆவணம் <https://qiskit.org/documentation/apidoc/primitives.html>`__ இல் காணலாம்.
te: Qiskit Terra ప్రిమిటివ్లపై మరింత సమాచారం `డాక్యుమెంటేషన్ <https://qiskit.org/documentation/apidoc/primitives.html>`__లో చూడవచ్చు.

source: It is worth mentioning other implementations as well:
de: Es lohnt sich, auch andere Implementierungen zu erwähnen:
es_un: Vale la pena mencionar otras implementaciones también:
ja: 他の実装についても触れておくとよいでしょう:
ta: மற்ற செயலாக்கங்களையும் குறிப்பிடுவது மதிப்பு:
te: ఇతర అమలులను కూడా పేర్కొనుచున్నాము:

source: Aer primitives should be used for Aer simulator. They extend corresponding interfaces from Terra and can be used in the same way as primitives from Terra. See `documentation <https://qiskit.org/documentation/apidoc/aer_primitives.html>`__ for more information.
de: Aer Primitive sollten für den Aer Simulator verwendet werden. Sie erweitern die entsprechenden Schnittstellen von Terra und können genauso wie Primitive von Terra verwendet werden. Siehe `documentation <https://qiskit.org/documentation/apidoc/aer_primitives.html>`__ für weitere Informationen.
es_un: Las primitivas Aer deben usarse para el simulador Aer. Extienden las interfaces correspondientes de Terra y se pueden usar de la misma manera que las primitivas de Terra. Consulta la `documentación <https://qiskit.org/documentation/apidoc/aer_primitives.html>`__ para obtener más información.
ja: Aer primitiveは、Aerシミュレーターで使用されるものです。これらはTerraの対応するインターフェースを拡張したもので、Terraのprimitiveと同じように使用することができます。詳しくは `documentation <https://qiskit.org/documentation/apidoc/aer_primitives.html>`__ を参照してください。
ta: ஏர் சிமுலேட்டருக்கு ஏர் ப்ரிமிடிவ்ஸ் பயன்படுத்தப்பட வேண்டும். அவை டெர்ராவிலிருந்து தொடர்புடைய இடைமுகங்களை விரிவுபடுத்துகின்றன, மேலும் டெர்ராவிலிருந்து பழமையானவற்றைப் போலவே பயன்படுத்தலாம். மேலும் தகவலுக்கு `ஆவணம் <https://qiskit.org/documentation/apidoc/aer_primitives.html>`__ ஐப் பார்க்கவும்.
te: ఏర్ సిమ్యులేటర్ కోసం ఏర్ ప్రిమిటివ్‌లను ఉపయోగించాలి. అవి Terra నుండి సంబంధిత ఇంటర్‌ఫేస్‌లను విస్తరింపజేస్తాయి మరియు Terra నుండి ప్రిమిటివ్‌ల మాదిరిగానే ఉపయోగించబడతాయి. మరింత సమాచారం కోసం `డాక్యుమెంటేషన్ <https://qiskit.org/documentation/apidoc/aer_primitives.html>`__ చూడండి.

source: The runtime primitives to be used with IBM devices. This is an implementation that is focused on cloud computing on actual hardware. See `here <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/apidocs/runtime_service.html>`__.
de: Die Laufzeitprimitive für IBM-Geräte. Dies ist eine Implementierung, die sich auf Cloud Computing auf die aktuelle Hardware konzentriert. Siehe `hier <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/apidocs/runtime_service.html>`__.
es_un: Las primitivas de runtime a usar con los dispositivos de IBM. Esta es una implementación que se centra en la computación en la nube en hardware real. Consulta `aquí <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/apidocs/runtime_service.html>`__.
ja: IBMのデバイスで使用するためのRumtive primitiveです。実際のハードウェアでのクラウドコンピューティングに特化した実装です。`こちら __<https://qiskit.org/documentation/partners/qiskit_ibm_runtime/apidocs/runtime_service.html>``__を参照してください。
ta: IBM சாதனங்களுடன் பயன்படுத்தப்பட வேண்டிய இயக்க நேர முதன்மைகள். இது உண்மையான வன்பொருளில் கிளவுட் கம்ப்யூட்டிங்கில் கவனம் செலுத்தும் செயலாக்கமாகும். `இங்கே <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/apidocs/runtime_service.html>`__ஐப் பார்க்கவும்.
te: IBM పరికరాలతో ఉపయోగించాల్సిన రన్‌టైమ్ ప్రిమిటివ్‌లు. ఇది వాస్తవ హార్డ్‌వేర్‌పై క్లౌడ్ కంప్యూటింగ్‌పై దృష్టి సారించిన ఇంప్లిమెంటేషన్. `ఇక్కడ <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/apidocs/runtime_service.html>`__ చూడండి.

source: Along with the primitives Terra has some primitive-like algorithms that are highly useful in QML and used by the new 0.5 functions:
de: Zusammen mit den Primitiven hat Terra einige primitiv-ähnliche Algorithmen, die in QML sehr nützlich sind und von den neuen 0.5 Funktionen benutzt werden:
es_un: Junto con las primitivas, Terra tiene algunos algoritmos de tipo primitivo que son muy útiles en QML y utilizados por las nuevas funciones en 0.5:
ja: Terraはprimitiveとともに、QMLで非常に有用なprimitive的アルゴリズムを持っており、0.5の新機能で使用されています。
ta: ப்ரிமிடிவ்களுடன் டெர்ரா சில பழமையான அல்காரிதங்களைக் கொண்டுள்ளது, அவை QML இல் மிகவும் பயனுள்ளதாக இருக்கும் மற்றும் புதிய 0.5 செயல்பாடுகளால் பயன்படுத்தப்படுகின்றன:
te: ప్రిమిటివ్లతో పాటుగా Terra కొన్ని ప్రిమిటివ్-వంటి అల్గారిథమ్‌లను కలిగి ఉంది, ఇవి QMLలో అత్యంత ఉపయోగకరంగా ఉంటాయి మరియు కొత్త 0.5 ఫంక్షన్‌ల ద్వారా ఉపయోగించబడతాయి:

source: Algorithms to calculate the gradient of a quantum circuit. For each core primitive there's a corresponding base interface that defines quantum circuit gradient. The documentation on gradients is `here <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.html>`__.
ja: 量子回路の勾配を計算するためのアルゴリズム。各コアprimitiveに対応する基本インターフェースがあり、量子回路の勾配を定義しています。勾配に関するドキュメントは `こちら <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.html>`__です。
ta: குவாண்டம் சர்க்யூட்டின் சாய்வைக் கணக்கிடுவதற்கான வழிமுறைகள். குவாண்டம் சர்க்யூட் சாய்வை வரையறுக்கும் ஒவ்வொரு மையத்திற்கும் தொடர்புடைய அடிப்படை இடைமுகம் உள்ளது. சாய்வுகள் குறித்த ஆவணப்படுத்தல் 'இங்கே <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.html>'__ ஆகும்.

source: Algorithms that compute the fidelity or "closeness" of pairs of quantum states. Currently, only one implementation is available that requires a sampler primitive and is based on the compute-uncompute method. The documentation is `here <https://qiskit.org/documentation/stubs/qiskit.algorithms.state_fidelities.html>`__.
ja: 量子状態のペアの忠実度（近さ）を計算するアルゴリズム。現在、1つの実装のみが利用可能で、sampler primitiveを必要とし、compute-uncomputeメソッドに基づくものです。ドキュメントは `こちら <https://qiskit.org/documentation/stubs/qiskit.algorithms.state_fidelities.html>`__です。
ta: குவாண்டம் நிலைகளின் ஜோடிகளின் நம்பகத்தன்மை அல்லது "நெருக்கத்தை" கணக்கிடும் வழிமுறைகள். தற்போது, ஒரு செயலாக்கம் மட்டுமே கிடைக்கிறது, இது ஒரு மாதிரி தேவைப்படுகிறது மற்றும் கணினி-கணக்கிடப்படாத முறையை அடிப்படையாகக் கொண்டது. ஆவணம் 'இங்கே <https://qiskit.org/documentation/stubs/qiskit.algorithms.state_fidelities.html>'__ ஆகும்.

source: Both two new algorithms are very similar to the core primitives, they share the same method signatures, so they may be called as high level primitives despite they are not in the primitives package.
de: Beide neuen Algorithmen sind den Basis-Primitiven sehr ähnlich, sie teilen dieselben Methodensignaturen, so dass sie auch High-Level-Primitiven genannt werden, obwohl sie nicht im Primitiven-Paket enthalten sind.
es_un: Los dos nuevos algoritmos son muy similares a las primitivas centrales, comparten las mismas firmas de método, por lo que pueden llamarse primitivas de alto nivel a pesar de que no están en el paquete de primitivas.
ja: この2つのアルゴリズムは、コアprimitiveと非常によく似ており、同じメソッドシグネチャーを共有しているため、primitiveパッケージに含まれていないにもかかわらず、高レベルのprimitiveとして呼び出すことができます。
ta: இரண்டு புதிய அல்காரிதம்களும் முதன்மையான முதன்மைகளுடன் மிகவும் ஒத்ததாக உள்ளன, அவை ஒரே முறை கையொப்பங்களைப் பகிர்ந்து கொள்கின்றன, எனவே அவை முதன்மையான தொகுப்பில் இல்லாவிட்டாலும் அவை உயர் நிலை ப்ரிமிட்டிவ் என அழைக்கப்படலாம்.
te: రెండు కొత్త అల్గారిథమ్‌లు కోర్ ప్రిమిటివ్‌లకు చాలా పోలి ఉంటాయి, అవి ఒకే పద్ధతి సిగ్నేచర్లను పంచుకుంటాయి, కాబట్టి అవి ప్రిమిటివ్ ప్యాకేజీలో లేనప్పటికీ వాటిని హై లెవల్ ప్రిమిటివ్‌లుగా పిలవవచ్చు.

source: The previous implementation consisted of a single class `QuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.QuantumKernel.html>`__ that did everything:
de: Die vorherige Implementierung bestand aus einer einzigen Klasse ` QuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.QuantumKernel.html>` __, die alles getan hat:
es_un: La implementación anterior consistía en una sola clase `QuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.QuantumKernel.html>`__ que hacía todo:
ja: 以前の実装では、1つのクラス `QuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.QuantumKernel.html>`__ がすべてを担っていました。
ta: முந்தைய செயலாக்கமானது `QuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.QuantumKernel.html>`__ என்ற ஒற்றை வகுப்பைக் கொண்டிருந்தது:
te: మునుపటి ఇంప్లిమెంటేషన్లో, `QuantumKernel <https://qiskit.org/documentation/machine-learning/stubs/qiskit_machine_learning.kernels.QuantumKernel.html>`__ క్లాస్ ప్రతిదీ చేసింది:

source: Constructed circuits
de: Konstruierte Schaltkreise
es_un: Circuitos construidos
ja: 回路の構築
ta: கட்டப்பட்ட சுற்றுகள்
te: నిర్మించిన సర్క్యూట్లు

source: Executed circuits and evaluated overlap between circuits
de: Ausgeführte Schaltkreise und ausgewertete Überlappungen zwischen Schaltkreisen
es_un: Circuitos ejecutados y traslape evaluado entre circuitos
ja: 回路の実行と回路間の重なりの評価
ta: செயல்படுத்தப்பட்ட சுற்றுகள் மற்றும் சுற்றுகளுக்கு இடையே மதிப்பிடப்பட்ட ஒன்றுடன் ஒன்று
te: ఎగ్జిక్యూటెడ్ సర్క్యూట్‌లు మరియు సర్క్యూట్‌ల మధ్య మూల్యాంకనం చేయబడిన అతివ్యాప్తి

source: Provided training parameters
de: Angegebene Trainingsparameter
es_un: Parámetros de entrenamiento proporcionados
ja: 学習用パラメーターを提供
ta: பயிற்சி அளவுருக்கள் வழங்கப்பட்டன
te: అందించబడ్డ శిక్షణ పారామితులు

source: Kept track of the values assigned to the parameters.
de: Verfolgte die Werte, die den Parametern zugeordnet sind.
es_un: Seguimiento de los valores asignados a los parámetros.
ja: パラメーターに割り当てられた値の追跡
ta: அளவுருக்களுக்கு ஒதுக்கப்பட்ட மதிப்புகளைக் கண்காணிக்கவும்.
te: పారామితులకు కేటాయించిన విలువలను ట్రాక్ చేయండి.
