Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/getting_started.po
Languages: bn_bn, es_un, ja_jp, ko_kr, pt_un, ru_ru, ta_in, te_in, th_th, tr_tr, vi_vn, zh_tw

source: **CVXPY** may be installed using the command ``pip install 'qiskit-optimization[cvx]'``. CVXPY being installed will enable the usage of the Goemans-Williamson algorithm as an optimizer `GoemansWilliamsonOptimizer`.
es_un: **CVXPY** puede instalarse usando el comando ``pip install 'qiskit-optimization[cvx]'``. La instalación de CVXPY permitirá el uso del algoritmo Goemans-Williamson como un optimizador `GoemansWilliamsonOptimizer`.
ja_jp: **CVXPY** は、`pip install 'qiskit-optimization[cvx]'` コマンドを使用してインストールできます。インストールされる CVXPY は、 `GoemansWilliamsonOptimizer` オプティマイザーとして、Goemans-Williamsonアルゴリズムを使用可能にします。
pt_un: **CVXPY** pode ser instalado usando o comando``pip install 'qiskit-optimization[cvx]'``. CVXPY sendo instalado permitirá o uso do algoritmo Goemans-Williamson como um otimizador `GoemansWilliamsonOptimizer`.
ru_ru: **CVXPY** можно установить с помощью команды ``pip install 'qiskit-optimization[cvx]'``. Установка CVXPY позволит использовать алгоритм Goemans-Williamson в качестве оптимизатора `GoemansWilliamsonOptimizer`.
ta_in: **CVXPY**, ``pip install 'qiskit-optimization[cvx]'`` கட்டளையைப் பயன்படுத்தி நிறுவப்படலாம். CVXPY நிறுவப்பட்டிருப்பது Goemans-Williamson அல்காரிதத்தை மேம்படுத்தி `GoemansWilliamsonOptimizer` ஆகப் பயன்படுத்துவதை செயல்படுத்தும்.
te_in: **CVXPY** ``pip install 'qiskit-optimization[cvx]'`` ఆదేశాన్ని ఉపయోగించి ఇన్‌స్టాల్ చేయబడవచ్చు. CVXPY ఇన్‌స్టాల్ చేయబడటం వలన గోమాన్స్-విలియమ్సన్ అల్గారిథమ్‌ని `GoemansWilliamsonOptimizer` ఆప్టిమైజర్గా ఉపయోగించుకోవచ్చు.
th_th: * * CVXPY ** สามารถติดตั้งโดยใช้คำสั่ง ``pip install 'qiskit-optimization[cvx]'``. CVXPY เมื่อติดตั้งแล้วจะทำให้เราสามารถใช้งานอัลกอริธึม Goemans-Williamson เป็น Optimizer ได้ `GoemansWilliamsonOptimizer`
zh_tw: **CVXPY** 可以使用指令 ``pip install 'qiskit-optimization[cvx]'`` ` 。安裝的 CVXPY 將啟用 Goemans-Williamson 演算法，作為最佳化因子 `GoemansWilliamsonOptimizer `。

source: **Matplotlib** may be installed using the command ``pip install 'qiskit-optimization[matplotlib]'``. Matplotlib being installed will enable the usage of the `draw` method in the graph optimization application classes.
es_un: **Matplotlib** puede instalarse usando el comando ``pip install 'qiskit-optimization[matplotlib]'``. La instalación de Matplotlib permitirá el uso del método `draw` en las clases de aplicaciones de optimización de grafos.
ja_jp: **Matplotlib** は、`pip install 'qiskit-optimization[matplotlib]'` コマンドを使用してインストールできます。インストールされる Matplotlib は、グラフ最適化アプリケーション・クラスの `draw` メソッドを使用可能にします。
pt_un: ** Matplotlib** pode ser instalado usando o comando ``pip install 'qiskit-optimization[matplotlib]'``. Instalar o Matplotlib possibilitará o uso do método `draw` nas classes de aplicativos de otimização de gráfico.
ru_ru: **Matplotlib** можно установить с помощью команды ``pip install 'qiskit-optimization[matplotlib]'``. Установка Matplotlib позволит использовать метод `draw` в приложениях по оптимизации графов.
ta_in: **Matplotlib**, ``pip install 'qiskit-optimization[matplotlib]'`` கட்டளையைப் பயன்படுத்தி நிறுவப்படலாம். Matplotlib நிறுவப்படுவதால், வரைபட மேம்படுத்தல் பயன்பாட்டு வகுப்புகளில் `draw` முறையைப் பயன்படுத்த முடியும்.
te_in: ** Matplotlib** ఆదేశం ఉపయోగించి వ్యవస్థాపించబడవచ్చు ` ` pip install 'qiskit-optimization[matplotlib]' ` ` `. Matplotlib ఇన్‌స్టాల్ చేయడం వలన `draw` వినియోగాన్ని అనుమతిస్తుంది.
th_th: **Matplotlib** ติดตั้งโดยใช้คำสั่ง ``pip install 'q is kit-optimization[matplotlib]'`` การติดตั้ง Matplotlib จะทำให้เราสามารถใช้งาน Method `draw` ในคลาส Graph Optimization Application ได้
zh_tw: **Matplotlib** 可以使用指令 ``pip install 'qiskit-optimization[matplotlib]'`` `。 Matplotlib 的安裝將在圖形最佳化應用程式類別中啟用 `rain` 的用法。

source: **Gurobipy** may be installed using the command ``pip install 'qiskit-optimization[gurobi]'``. Gurobipy being installed will enable the usage of the `GurobiOptimizer`.
es_un: **Gurobipy** puede instalarse usando el comando ``pip install 'qiskit-optimization[gurobi]'``. La instalación de Gurobipy permitirá el uso del `GurobiOptimizer`.
ja_jp: **Gurobipy** は、コマンド `pip install 'qiskit-optimization[gurobi]'` を使用してインストールできます。 インストールされた Gurobipyは、GurobiOptimizerを使用可能とします。
pt_un: **Gurobipy** pode ser instalado usando o comando ``pip install 'qiskit-optimization[gurobi]'``. Gurobipy sendo instalado permitirá o uso do `GurobiOptimizer`.
ru_ru: **Gurobipy** может быть установлен с помощью команды ``pip install 'qiskit-optimization[gurobi]'``. Gurobipy позволяет использовать `GurobiOptimizer`.
ta_in: **Gurobipy** ஆனது ``pip install 'qiskit-optimization[gurobi]'`` கட்டளையைப் பயன்படுத்தி நிறுவப்படலாம். Gurobipy நிறுவப்பட்டிருப்பது `GurobiOptimizer` -ன் பயன்பாட்டை இயக்கும்.
te_in: ** Gurobipy** ఆదేశం ఉపయోగించి వ్యవస్థాపించబడవచ్చు ` ` pip install 'qiskit-optimization[gurobi]' ` `. Gurobipy ఇన్‌స్టాల్ చేయడం వలన ` 'Gurobioptimizer ` వినియోగాన్ని అనుమతిస్తుంది.
th_th: **Gurobipy** สามารถติดตั้งได้โดยใช้คำสั่ง ``pip install 'q is kit-optimization[gurobi]'`` เมื่อติดตั้ง Gurobipy แล้วจะสามารถใช้งาน `GurobiOptimizer` ได้
zh_tw: **Gurobipy** 可使用指令 ``pip install 'qiskit-optimization[gurobi]'`` `. Gurobipy 安裝後將啟用 `GurobiOptimizer' 的使用。

source: Ready to get going?...
bn_bn: আরো এগোতে প্রস্তুত?...
es_un: ¿Listo para empezar?...
ja_jp: 準備はいいですか？...
ko_kr: 시작할 준비가 다 되었다면...
pt_un: Pronto para começar?...
ru_ru: Готовы идти дальше?
ta_in: செல்ல தயாரா?...
te_in: ప్రారంభించడానికి సిద్ధంగా ఉన్నారా?...
th_th: คุณพร้อมจะเริ่มใช้งานหรือยัง?...
tr_tr: Başlamaya hazır mısınız?...
vi_vn: Bạn đã sẵn sàng khởi hành?...
zh_tw: 準備好出發了嗎

source: Qiskit Optimization depends on the main Qiskit package which has its own `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ detailing the installation options for Qiskit and its supported environments/platforms. You should refer to that first. Then the information here can be followed which focuses on the additional installation specific to Qiskit Optimization.
bn_bn: Qiskit Optimization মূল Qiskit প্যাকেজের উপর নির্ভর করে যার নিজস্ব `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ Qiskit এবং এর সমর্থিত পরিবেশ/প্ল্যাটফর্মগুলির জন্য ইনস্টলেশন বিকল্পগুলি বিশদ বর্ণনা করে। আপনার প্রথমে উল্লেখ করা উচিত। তারপরে এখানকার তথ্য অনুসরণ করা যেতে পারে যা কিসকিট অপটিমাইজার এর সাথে সম্পর্কিত অতিরিক্ত ইনস্টলেশনকে কেন্দ্র করে।
ja_jp: Qiskit Optimizationは、 Qiskit のインストール・オプションとそのサポート環境/プラットフォームを詳述した「`Qiskit はじめに <https://qiskit.org/documentation/getting_started.html>`__ 」にて説明された主要 Qiskit パッケージに依存しています。 まずそれを参照してください。次に、ここで説明する情報に従って、Qiskit Optimizationに固有の追加インストールをしましょう。
ko_kr: Qiskit Optimization은 Qiskit및 지원되는 환경/플랫폼의 설치 옵션을 자세히 설명하는 `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ 를 가지고 있는 기본 Qiskit 패키지에 의존한다. 먼저 그것을 참고해야 한다. 그 후 Qiskit Optimization의 추가 설치에 초점을 맞추는 이 내용을 따라라.
pt_un: O Qiskit Optimization depende do pacote Qiskit principal que tem seu próprio `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ detalhando as opções de instalação para Qiskit e seus ambientes/plataformas suportados. Você deve se referir a isso primeiro. Em seguida, as informações aqui podem ser seguidas, as quais se concentram na instalação adicional específica para Qiskit Optimization.
ru_ru: Пакет Qiskit Optimization зависит от основного пакета Qiskit, который имеет свою собственную страницу `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>` __ с подробным описанием опций установки Qiskit и поддерживаемых сред/платформ. Обратите на это внимание в первую очередь. Далее здесь можно найти информацию, которая сфокусируется на дополнительной установке, специфичной для Qiskit Optimization.
ta_in: Qiskit உகப்பாக்கம் அதன் சொந்த `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ Qiskit மற்றும் அதன் ஆதரவு சூழல்கள் / தளங்களுக்கான நிறுவல் விருப்பங்களை விவரிக்கும் முக்கிய கிஸ்கிட் தொகுப்பைப் பொறுத்தது. நீங்கள் அதை முதலில் குறிப்பிட வேண்டும். Qiskit உகப்பாக்கத்திற்கு குறிப்பிட்ட கூடுதல் நிறுவலில் கவனம் செலுத்தும் தகவல்களை இங்கே பின்பற்றலாம்.
te_in: Qiskit Optimization దాని స్వంత `Qiskit ను ప్రారంభించండి <https://qiskit.org/documentation/getting_started.html>`__ కలిగి ఉన్న ప్రధాన Qiskit ప్యాకేజీపై ఆధారపడి ఉంటుంది, Qiskit మరియు దాని మద్దతు ఉన్న పర్యావరణాలు/ప్లాట్‌ఫారమ్‌ల కోసం ఇన్‌స్టాలేషన్ ఎంపికలను వివరిస్తుంది. మీరు దానిని ముందుగా సూచించాలి. Qiskit Optimizationకు సంబంధించిన అదనపు ఇన్‌స్టాలేషన్‌పై దృష్టి సారించే సమాచారాన్ని ఇక్కడ అనుసరించవచ్చు.
th_th: Qiskit Optimization ทำงานโดยอาศัยแพ็กเกจหลักของ Qiskit ซึ่งรายละเอียดตัวเลือกการติดตั้ง Qiskit และ environment/platform สนับสนุนนั้นอยู่ในหัวข้อ `เริ่มต้นใช้งาน Qiskit` <https://qiskit.org/documentation/getting_started.html> คุณจึงควรเริ่มศึกษาวิธีการติดตั้งเบื้องต้นจากส่วนดังกล่าวก่อน แล้วจึงค่อยดูรายละเอียดเพิ่มเติมสำหรับการติดตั้ง Qiskit Optimization ในเนื้อหาถัดไปจากนี้
tr_tr: Qiskit Optimizasyon; Qiskit için kurulum seçeneklerini ve onun desteklenen ortam/platformlarını detaylandıran `Qiskit Başlarken <https://qiskit.org/documentation/getting_started.html>`__ adındaki kendi ana Qiskit paketine bağlıdır. Öncelikle buna bakmalısınız. Sonrasında, burada yer alan Qiskit Optimizasyon'a özgü ek kuruluma ilişkin bilgiler takip edilebilir.
vi_vn: Qiskit Optimization phụ thuộc vào gói Qiskit chính sở hữu ' Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>` __ riêng, trình bày các lựa chọn cài đặt cho Qiskit và các môi trường/nền tảng được hỗ trợ của nó. Bạn nên tham khảo mục đó trước. Tiếp đó, các thông tin tập trung vào những cài đặt bổ sung cụ thể cho Qiskit Optimization có thể được xem thêm tại đây.
zh_tw: Qiskit Optimization 是基於 Qiskit 主套件的，主套件有自己的 `Qiskit 入門指南 <https://qiskit.org/documentation/getting_started.html>`__ ，其中詳細說明了 Qiskit 的安裝選項及其支援的環境/平臺。您應該首先參考 Qiskit 主套件入門指南。之後，按照這裡的訊息，額外完成 Qiskit Optimization 套件的安裝。

source: The simplest way to get started is to follow the getting started 'Start locally' for Qiskit here `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
bn_bn: সহজ করে শুরু করার উপায় হ'ল 'Start locally' থেকে শুরু করুন , `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
ja_jp: 最も簡単な方法は「 `Qiskit はじめに <https://qiskit.org/documentation/getting_started.html>`__ 」の「ローカルで始める」を参照して開始することです。
ko_kr: 시작할 수 있는 가장 간단한 방법은 Qiskit 에서 '로컬로 시작하기' `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__를 따르는 것이다.
pt_un: A maneira mais simples de começar é seguir o guia 'Iniciar localmente' para o Qiskit aqui `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
ru_ru: Самый простой способ - начать с раздела 'Запуск локально' для Qiskit здесь `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
ta_in: தொடங்குவதற்கான எளிய வழி இங்கே கிஸ்கிட்டிற்கான 'Start locally' என்பதைப் பின்பற்றுவது `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
th_th: วิธีที่ง่ายที่สุดสำหรับเริ่มต้นใช้งานคือการทำตามขั้นตอนการใช้งาน Qiskit ที่แสดงไว้ในหัวข้อ `เริ่มต้นที่เครื่องของคุณ` ตามลิงค์นี้ `เริ่มต้นใช้งาน Qiskit <https://qiskit.org/documentation/getting_started.html>`__
tr_tr: Başlamanın en kolay yolu, Qiskit için 'Yerel Olarak Başlatma' bölümünü buradan takip ederek başlamaktır: `Qiskit Başlarken <https://qiskit.org/documentation/getting_started.html>`__
vi_vn: Cách dễ nhất để bắt đầu là làm theo hướng dẫn mở đầu của "Bắt đầu cục bộ" dành cho Qiskit tại `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__

source: In your virtual environment where you installed Qiskit simply add ``optimization`` to the extra list in a similar manner to how the extra ``visualization`` support is installed for Qiskit, i.e:
bn_bn: আপনার ভার্চুয়াল পরিবেশে যেখানে আপনি কিস্কিট (Qiskit) ইনস্টল করেছেন, কিস্কিটের জন্য কীভাবে অতিরিক্ত ``visualization`` সাহায্যকারীটি ইনস্টল করা হয়েছে তার সাথে একইভাবে অতিরিক্ত তালিকায় ``optimization`` যুক্ত করুন:
ja_jp: Qiskit をインストールした仮想環境で、 Qiskit に追加の ``visualization`` サポートをインストールした方法と同様の方法で、以下のようにして追加リストに ``optimization`` を追加してください:
ko_kr: Qiskit을 설치한 가상 환경에서 추가적인 ``visualization`` 지원을 설치한 방법과 마찬가지로 ``optimization`` 를 단순히 추가 리스트에 추가한다.
pt_un: Em seu ambiente virtual onde você instalou o Qiskit, simplesmente adicione ``optimization`` à lista extra de maneira semelhante a como o suporte extra ``visualization`` é instalado para o Qiskit, ou seja:
ru_ru: В Вашей виртуальной среде, где Вы установили Qiskit, просто добавьте ``optimization`` в дополнительный список пакетов подобно тому как устанавливается дополнительная поддержка ``visualization`` в Qiskit, например:
ta_in: நீங்கள் Qiskitடை நிறுவிய உங்கள் மெய்நிகர் சூழலில், Qiskitற்கு கூடுதல் ``visualization`` ஆதரவு எவ்வாறு நிறுவப்பட்டுள்ளது என்பதைப் போலவே கூடுதல் பட்டியலில் ``optimization`` ஐச் சேர்க்கவும், அதாவது:
te_in: మీరు Qiskitని ఇన్‌స్టాల్ చేసిన మీ వర్చువల్ వాతావరణంలో Qiskit కోసం అదనపు ``విజువలైజేషన్`` మద్దతు ఎలా ఇన్‌స్టాల్ చేయబడిందో అదే పద్ధతిలో అదనపు జాబితాకు ``optimization``ని జోడించండి, అనగా:
th_th: ใน Virtual Environment ของคุณที่ได้ทำการติดตั้ง Qiskit ไว้แล้ว ให้คุณเพิ่ม ``optimization`` เข้าไปใน extra list ในลักษณะเดียวกันกับการติดตั้งส่วนสนับสนุน ``visualization`` ใน Qiskit โดยใช้คำสั่ง:
tr_tr: Qiskit'i kurduğunuz sanal ortamınızda, Qiskit için ekstra "görselleştirme" desteğinin nasıl kurulduğuna benzer şekilde, "optimizasyon"ı ekstra listeye eklemeniz yeterlidir, yani:
vi_vn: Trong môi trường ảo mà bạn đã cài đặt Qiskit, chỉ cần thêm ``optimization`` vào danh sách bổ sung tương tự như cách cài đặt hỗ trợ bổ sung ``visualization`` cho Qiskit, nghĩa là:
zh_tw: 在您安裝有 Qiskit 的虛擬環境中，類似於安裝 Qiskit ``visualization`` 支援的方式，您可以將 ``optimization`` 新增至額外列表中，例如：

source: It is worth pointing out that if you're a zsh user (which is the default shell on newer versions of macOS), you'll need to put ``qiskit[optimization]`` in quotes:
bn_bn: মনে করিয়ে দেয়া প্রয়োজন, আপনি যদি zsh (ম্যাকওএস এর নতুনতর সংস্করণগুলোতে এটি পূর্বনির্ধারিত (ডিফল্ট) শেল) ব্যবহারকারী হয়ে থাকেন তাহলে আপনাকে উদ্ধৃতির মধ্যে ``qiskit[optimization]`` লিখতে হবে:
ja_jp: Zshユーザー（新しいバージョンのmacOSのデフォルトシェル）の場合は、 ``qiskit[optimization]`` を引用符で囲む必要があります。
ko_kr: Zsh 사용자 (최신 버전의 macOS 기본 셸) 인 경우 ``qiskit[optimization]`` 을 따옴표로 묶어야 한다:
pt_un: Vale a pena ressaltar que se você é um usuário zsh (que é o shell padrão em versões mais recentes do macOS), você vai precisar colocar ``qiskit[optimization]`` entre aspas:
ru_ru: Стоит отметить, что если Вы используете zsh (оболочка по умолчанию для более новых версий macOS), Вам нужно указать ``qiskit[optimization]`` в кавычках:
ta_in: நீங்கள் ஒரு zsh பயனராக இருந்தால் (இது macOS-ன் புதிய பதிப்புகளில் இயல்புநிலை ஷெல்), நீங்கள் மேற்கோள்களில் ``qiskit[optimization]`` வைக்க வேண்டும் என்பதை சுட்டிக்காட்ட வேண்டியது அவசியம்:
te_in: మీరు zsh వినియోగదారు అయితే (ఇది MacOS యొక్క కొత్త వెర్షన్‌లలో డిఫాల్ట్ షెల్), మీరు కోట్స్‌లో ``qiskit[optimization]`` ని ఉంచాలి:
th_th: ถ้าคุณเป็นผู้ใช้งาน zsh (ซึ่งเป็นค่าเริ่มต้นของ Shell บน macOS เวอร์ชันใหม่) คุณจำเป็นต้องใส่ ``qiskit[optimization]`` ไว้ในเครื่องหมายฟันหนู:
zh_tw: 需要注意的是，如果您是 zsh 使用者（在新版本的 macOS 中是預設 Shell），則需要將 ``qiskit[optimization]`` 放置在引號中：

source: **IBM CPLEX** may be installed using `pip install 'qiskit-optimization[cplex]'` to enable the reading of `LP` files and the usage of the `CplexOptimizer`, wrapper for ``cplex.Cplex``. Currently there is no python 3.9 version of CPLEX. In this case, the CPLEX install command will have no effect.
ko_kr: IBM CPLEX 는 LP 파일을 읽고 cplex.Cplex 의 래퍼인 CplexOptimizer 을 사용하기 위해 pip install 'qiskit-optimization[cplex]' 명령어로 패키지를 설치할 수 있다. 현재 python 3.9 버전용 CPLEX는 아직 없기 때문에 해당 버전의 경우 CPLEX 설치 명령은 동작하지 않는다.

source: **CVXPY**, may be installed using command `pip install 'qiskit-optimization[cvx]'` to install the package. CVXPY being installed will enable the usage of the Goemans-Williamson algorithm as an optimizer `GoemansWilliamsonOptimizer`.
ko_kr: **CVXPY** 는 `pip install 'qiskit-optimization[cvx]'` 커맨드로 패키지를 설치할 수 있다. CVXPY는 Goemans-Williamson 알고리즘을 `GoemansWilliamsonOptimizer` 옵티마이저로 사용할 수 있게 한다.
tr_tr: **CVXPY* *, paketi ` pip install 'qiskit-optimization[cvx]' ` komutunu kullanarak kurulabilir. Kurulmakta olan CVXpy, Goemans-Williamson algoritmasının optimize edici ` GoemansWilliamsonOptimizer ` olarak kullanımını etkinleştirir.
vi_vn: *** CVXPY**, có thể được cài đặt bằng lệnh `pip install 'qiskit-optimization[cvx]'` để cài đặt gói. CVXPY được cài đặt sẽ cho phép sử dụng thuật toán Goemans-Williamson như một trình tối ưu hóa `GoemansWilliamsonOptimizer`.

source: **Matplotlib**, may be installed using command `pip install 'qiskit-optimization[matplotlib]'` to install the package. Matplotlib being installed will enable the usage of the `draw` method in the graph optimization application classes.
ko_kr: **Matplotlib** 는 `pip install 'qiskit-optimization[matplotlib]'` 커맨드로 패키지를 설치할 수 있다. Matplotlib은 그래프 최적화 응용 (graph optimization application) 클래스에 있는 `draw` 메서드를 사용할 수 있게 한다.
tr_tr: ** Matplotlib**, paketi kurmak için ` pip install 'qiskit-optimization[matplotlib]' ` komutu kullanılarak kurulabilir. Kurulmakta olan Matplotlib, grafik optimize edici uygulama sınıflarında ` draw ` yöntemini kullanımını etkinleştirir.
vi_vn: ** Matplotlib**, có thể được cài đặt bằng lệnh `pip install 'qiskit-optimization[matplotlib]'` để cài đặt gói. Matplotlib được cài đặt sẽ cho phép sử dụng phương pháp vẽ `draw` trong các lớp ứng dụng tối ưu đồ thị.

source: **Gurobipy** may be installed using command `pip install 'qiskit-optimization[gurobi]'` to install the package. Gurobipy being installed will enable the usage of the GurobiOptimizer.
ko_kr: **Gurobipy** 는 `pip install 'qiskit-optimization[gurobi]'` 명령어를 사용하여 설치할 수 있다. Gurobipy를 설치하면 GurobiOptimizer를 사용할 수 있다.

source: The simplest way to get started is to follow the `getting started 'Start locally' guide for Qiskit <https://qiskit.org/documentation/getting_started.html>`__
te_in: ప్రారంభించడానికి సులభమైన మార్గం Qiskit కోసం 'స్థానికంగా ప్రారంభించండి' <https://qiskit.org/documentation/getting_started.html>` __ గైడ్ ను అనుసరించడం

source: It is worth pointing out that if you're a zsh user (which is the default shell on newer versions of macOS), you'll need to put ``qiskit[optimizationg]`` in quotes:
tr_tr: Bir zsh kullanıcısıysanız (bu, macOS'un daha yeni sürümlerinde varsayılan kabuktur), ``qiskit[optimizationg]``ı tırnak içine eklemeniz gerekeceğini belirtmekte fayda var:
vi_vn: Một điều đáng lưu ý là nếu bạn là một người sử dụng zsh (shell mặc định trên các phiên bản mới hơn của macOS), bạn sẽ cần phải đặt ``qiskit[optimization]`` vào trong dấu nháy đơn:

source: **IBM CPLEX** may be installed using `pip install 'qiskit-optimization[cplex]'` to enable the reading of `LP` files and the usage of the `CplexOptimizer`, wrapper for ``cplex.Cplex``.
tr_tr: ** IBM CPLEX* *, ` LP ` dosyaların okunmasını ve ` CplexOptimizer ` için sarıcı kullanımını etkinleştirmek için ` pplex install 'qiskit-optimization[cplex]' ` kullanılarak kurulabilir.
vi_vn: ** IBM CPLEX** có thể được cài đặt bằng cách sử dụng `pip install 'qiskit-optimization[cplex]'` để kích hoạt việc đọc các tập tin `LP` và việc sử dụng `CplexOptimizer`, wrapper dành cho ``cplex.Cplex``.
