Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/getting_started.po
Languages: bn_bn, es_un, ja_jp, ko_kr, pt_un, ru_ru, ta_in, te_in, th_th, tr_tr, vi_vn, zh_tw

source: Getting started
bn_bn: শুরুর নির্দেশনা
es_un: Primeros pasos
ja_jp: はじめに
ko_kr: 시작하기
pt_un: Primeiros passos
ru_ru: Начало работы
ta_in: தொடங்குதல்
te_in: మొదలుపెడుతున్నా
th_th: เริ่มต้นการใช้งาน
tr_tr: Başlarken
vi_vn: Bắt đầu

source: Installation
bn_bn: স্থাপন (ইনস্টলেশন)
es_un: Instalación
ja_jp: インストール
ko_kr: 설치
pt_un: Instalação
ru_ru: Инструкция по установке
ta_in: நிறுவல்
te_in: ఇన్స్టాలేషన్
th_th: การติดตั้ง
tr_tr: Kurulum
vi_vn: Cài đặt

source: Qiskit Optimization depends Qiskit. which has its own `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ detailing the installation options and its supported environments/platforms. You should refer to that first. Then the information here can be followed which focuses on the additional installation specific to Qiskit Optimization.
es_un: Qiskit Optimization depende de Qiskit, que tiene su propio `Qiskit Primeros Pasos <https://qiskit.org/documentation/getting_started.html>`__ que detalla las opciones de instalación y sus entornos/plataformas compatibles. Deberías referirte a eso primero. Luego, se puede seguir la información que está aquí, la cual se centra en la instalación adicional específica de Qiskit Optimization.

source: Qiskit Optimization has some functions that have been made optional where the dependent code and/or support program(s) are not (or cannot be) installed by default. Those are IBM CPLEX, CVXPY and Matplotlib. See :ref:`optional_installs` for more information.
bn_bn: কিস্কিট অপ্টিমাইজেশনের কিছু ফাংশন রয়েছে যা ঐচ্ছিক করা হয়েছে যেখানে নির্ভরশীল কোড এবং/অথবা সাপোর্ট প্রোগ্রাম (গুলি) ডিফল্টভাবে ইনস্টল করা হয় না (বা করা যায় না)। সেগুলো হল IBM CPLEX, CVXPY এবং Matplotlib। আরও তথ্যের জন্য :ref:`optional_installs` দেখুন।
es_un: Qiskit Optimization tiene algunas funciones que se han hecho opcionales cuando el código dependiente y/o los programa(s) de soporte no están (o no pueden ser) instalados de forma predeterminada. Esos son IBM CPLEX, CVXPY y Matplotlib. Consulta :ref:`optional_installs` para más información.
ja_jp: Qiskit Optimizationには、デフォルトで依存コードまたはサポート・プログラム ( あるいはその両方 ) がインストールされていない (または、それらを使用できない ) ような、オプション機能がいくつかあります。IBM CPLEXやCVXPY、Matplotlibが該当します。詳細については、 :ref:`optional_installs` を参照してください。
ko_kr: Qiskit Optimization에는 종속 코드 및/또는 지원 프로그램이 기본적으로 설치되어 있지 않은 (또는 설치될 수 없는) 일부 선택적인 기능들이 있다. 이에는 IBM CPLEX, CVXPY 및 Matplotlib가 있다. 자세한 내용은 :ref:`optional_installs` 를 참조하여라.
pt_un: O Qiskit Optimization tem algumas funções que se tornaram opcionais onde o código dependente e/ou programa(s) de suporte não são (ou não podem ser) instalados por padrão. Esses são IBM CPLEX, CVXPY e Matplotlib. Veja :ref:`optional_installs` para mais informações.
ru_ru: В Qiskit Optimization есть некоторые функции, которые были сделаны необязательными, если зависимые программы и/или программы поддержки не установлены (или не могут быть установлены) по умолчанию. Это IBM CPLEX, CVXPY и Matplotlib. Дополнительная информация приведена в разделе :ref:`optional_installs`.
ta_in: Qiskit ஆப்டிமைசேஷனில் சில செயல்பாடுகள் விருப்பத்தேர்வு செய்யப்பட்டுள்ளன, அங்கு சார்ந்த குறியீடு மற்றும்/அல்லது ஆதரவு நிரல் (கள்) இயல்பாக நிறுவப்படவில்லை (அல்லது இருக்க முடியாது). அவை IBM CPLEX, CVXPY மற்றும் Matplotlib. மேலும் தகவலுக்கு :ref: `optional_installs` ஐப் பார்க்கவும்.
te_in: డిఫాల్ట్‌గా డిపెండెంట్ కోడ్ మరియు/లేదా సపోర్ట్ ప్రోగ్రామ్(లు) ఇన్‌స్టాల్ చేయని (లేదా చేయలేని) చోట Qiskit Optimization ఐచ్ఛికం చేయబడిన కొన్ని ఫంక్షన్‌లను కలిగి ఉంది. అవి IBM CPLEX, CVXPY మరియు Matplotlib. మరింత సమాచారం కోసం :ref:`optional_installs` చూడండి.
th_th: Qiskit Optimization มีฟังก์ชันบางส่วนที่ถูกสร้างขึ้นในลักษณะที่เป็นตัวเลือกเพิ่มเติม ซึ่งโค้ด และ/หรือ โปรแกรมสนับสนุนที่เกี่ยวข้องจะไม่ได้มีการติดตั้ง (หรือไม่สามารถติดตั้งได้) มาตั้งแต่ต้น ได้แก่ IBM CPLEX, CVXPY และ Matplotlib ดู:ref:`ตัวเลือกการติดตั้งเพิ่มเติม` สำหรับข้อมูลเพิ่มเติม
tr_tr: Qiskit Optimizasyon, bağımlı kod ve/veya destek program(lar)ın "varsayılan" olarak kurulmadığı (ya da kurulamadığı) opsiyonel birtakım fonksiyonlara sahiptir. Bunlar IBM,CPLEX,CVXPY ve Matplotlib'dir. Daha fazla bilgi için :ref:`optional_installs` 'a bakabilirsiniz.
vi_vn: Qiskit Optimization có một số chức năng đã được điều chỉnh thành tùy chọn để các code phụ thuộc và/hoặc (các) chương trình hỗ trợ không (hoặc không thể) được cài đặt theo mặc định. Các chức năng đó là IBM CPLEX, CVXPY và Matplotlib. Xem :ref:`optional_installs` để biết thêm thông tin.
zh_tw: 由於某些原始碼或程式尚未（或無法）在當前的預設情況下被安裝，Qiskit Optimization 裡有些功能被設定為選用安裝。這包括一些處理分子問題的古典程式庫與程式。請參閱：:ref:`optional_installs` 了解更多資訊。

source: Start locally
bn_bn: স্থানীয়ভাবে শুরু করা
es_un: Comenzar localmente
ja_jp: ローカルからの開始
ko_kr: 로컬에서 시작
pt_un: Iniciar localmente
ru_ru: Запустить локально
ta_in: உள்ளூரில் தொடங்கவும்
te_in: స్థానికంగా ప్రారంభించండి
th_th: เริ่มต้นที่เครื่องของคุณ
tr_tr: Yerel Olarak Başlatma
vi_vn: Bắt đầu cục bộ

source: The simplest way to get started is to first follow the `getting started 'Start locally' guide for Qiskit <https://qiskit.org/documentation/getting_started.html>`__
es_un: La forma más sencilla de comenzar es seguir primero la `guía de primeros pasos 'Comenzar localmente' para Qiskit <https://qiskit.org/documentation/getting_started.html>`__

source: In your virtual environment where you installed Qiskit simply add ``optimization`` to the extra list in a similar manner to how the extra ``visualization`` support is installed for Qiskit, i.e: In your virtual environment, where you installed Qiskit, install Qiskit Optimization as follows:
es_un: En tu entorno virtual donde instalaste Qiskit, simplemente agrega ``optimization`` a la lista adicional de manera similar a cómo se instala el soporte de ``visualization`` adicional para Qiskit, es decir: en tu entorno virtual, donde instalaste Qiskit, Instala la Qiskit Optimization de la siguiente manera:

source: As Qiskit Optimization depends on Qiskit, you can though simply install it into your environment, as above, and pip will automatically install a compatible version of Qiskit if one is not already installed.
es_un: Como Qiskit Optimization depende de Qiskit, simplemente puedes instalarlo en tu entorno, como se indicó anteriormente, y pip instalará automáticamente una versión compatible de Qiskit si aún no hay una instalada.

source: Install from source
bn_bn: উৎস থেকে স্থাপন
es_un: Instalar desde el código fuente
ja_jp: ソースからのインストール
ko_kr: 소스로부터 설치하기
pt_un: Instalando da Fonte
ru_ru: Установить из исходного кода
ta_in: மூலத்திலிருந்து நிறுவவும்
te_in: మూలం నుండి ఇన్స్టాల్ చేయండి
th_th: ติดตั้งจากแหล่งข้อมูลโดยตรง
tr_tr: Kaynaktan Kurulum
vi_vn: Cài đặt từ nguồn

source: Installing Qiskit Optimization from source allows you to access the most recently updated version under development instead of using the version in the Python Package Index (PyPI) repository. This will give you the ability to inspect and extend the latest version of the Qiskit Optimization code more efficiently.
bn_bn: উৎস থেকে উপাদানগুলি ইনস্টল করলে আপনি Qiskit এর উন্নয়নের অধীনে অতি সম্প্রতি আপডেট হওয়া সংস্করণটি ব্যবহার করতে পারবেন Python Package Index (PyPI) রিপোজিটরি থেকে ইনস্টল করার পরিবর্তে। এটি আপনাকে Qiskit Optimization কোডের সর্বশেষ সংস্করণটি আরও নিখুঁত ভাবে পরিদর্শন করার এবং প্রসারিত করার দক্ষতা দেবে।.
es_un: La instalación de Qiskit Optimization desde el código fuente te permite acceder a la versión actualizada más recientemente en desarrollo en lugar de usar la versión en el repositorio Python Package Index (PyPI). Esto te dará la capacidad de inspeccionar y extender la última versión del código de Qiskit Optimization de manera más eficiente.
ja_jp: ソースから Qiskit Optimizationをインストールすることにより、Python Package Index (PyPI) リポジトリのバージョンを使う代わりに、最新の Qiskit バージョンにアクセスすることができます。これにより、Qiskit Optimizationコードの最新版を調査したり、拡張することがより効果的にできるようになります。
ko_kr: 소스 코드로부터 Qiskit Optimization을 설치하는 것은 Python Package Index (PyPI) repository로 부터 설치하는 것 대신에 가장 최신에 업데이트된 버전을 사용하도록 해준다. 이를 통해 손쉽게 Qiskit Optimization의 최신 코드를 들여다 보고 확장할 수 있다.
pt_un: A instalação do Qiskit Optimization da fonte permite que você acesse a versão atualizada mais recentemente em desenvolvimento, em vez de usar a versão no repositório Python Package Index (PyPI). Isso lhe dará a capacidade de inspecionar e estender a versão mais recente do código Qiskit Optimization com mais eficiência.
ru_ru: Установка элементов из исходного кода позволит Вам получить доступ к последней обновленной версии Qiskit Optimization вместо использования версии из репозитория Python Package Index (PyPI). Это даст Вам возможность более эффективно изучить и внести свой вклад в улучшение кода последней версии Qiskit Optimization.
ta_in: மூலத்திலிருந்து Qiskit உகப்பாக்கத்தை நிறுவுவது பைதான் தொகுப்பு அட்டவணை (PyPI) களஞ்சியத்தில் பதிப்பைப் பயன்படுத்துவதற்குப் பதிலாக, சமீபத்தில் புதுப்பிக்கப்பட்ட பதிப்பை வளர்ச்சியின் கீழ் அணுக அனுமதிக்கிறது. இது qiskit உகப்பாக்கம் குறியீட்டின் சமீபத்திய பதிப்பை மிகவும் திறமையாக ஆய்வு செய்து நீட்டிக்கும் திறனை உங்களுக்கு வழங்கும்.
te_in: మూలాధారం నుండి Qiskit Optimizationను ఇన్‌స్టాల్ చేయడం వలన పైథాన్ ప్యాకేజీ ఇండెక్స్ (PyPI) రిపోజిటరీలో వెర్షన్ను ఉపయోగించకుండా అభివృద్ధిలో ఉన్న ఇటీవలి నవీకరించబడిన వెర్షన్ను యాక్సెస్ చేయడానికి మిమ్మల్ని అనుమతిస్తుంది. ఇది Qiskit ఆప్టిమైజేషన్ కోడ్ యొక్క తాజా వెర్షన్‌ను మరింత సమర్థవంతంగా తనిఖీ చేసే మరియు పొడిగించే సామర్థ్యాన్ని మీకు అందిస్తుంది.
th_th: การติดตั้ง Qiskit Optimization จากแหล่งข้อมูลโดยตรงจะทำให้คุณสามารถเข้าถึงเวอร์ชั่นที่อัปเดตล่าสุดภายใต้การพัฒนา แทนที่จะใช้เวอร์ชันที่อยู่ในที่เก็บข้อมูลของ Python Package Index (PyPl) การติดตั้งในลักษณะนี้จะทำให้คุณสามารถศึกษาการทำงานของโค้ด Qiskit Optimization ในเวอร์ชันล่าสุดได้อย่างมีประสิทธิภาพ
tr_tr: Qiskit Optimizasyon'u kaynaktan kurmak, Python Paket Dizini (PyPI) deposundaki versiyonları kullanmak yerine, geliştirilmekte olan en son güncellenmiş versiyonuna ulaşmanıza izin verecektir. Bu size Qiskit Optimizasyon kodunun en son sürümünü daha verimli bir şekilde inceleme ve genişletme olanağı verecektir.
vi_vn: Cài đặt Qiskit Optimization từ nguồn cho phép bạn truy cập phiên bản đang phát triển được cập nhật gần nhất thay vì sử dụng phiên bản trong kho lưu trữ Python Package Index (PyPI). Điều này sẽ giúp bạn kiểm tra và mở rộng code của phiên bản Qiskit Optimization mới nhất một cách hiệu quả hơn.
zh_tw: 從來源安裝 Qiskit Optimization 可讓您存取開發中的最新版本，而不是使用 Python Package Index (PyPI) 儲存庫中的版本。這能讓您更有效率地檢查及擴展最新版 Qiskit Optimization 程式碼。

source: Since Qiskit Optimization depends on Qiskit, and its latest changes may require new or changed features of Qiskit, you should first follow Qiskit's `"Install from source"` instructions here `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
bn_bn: যেহেতু কিস্কিট অপ্টিমাইজেশন কিস্কিটের উপর নির্ভর করে, এবং এর সর্বশেষ পরিবর্তনগুলির জন্য কিস্কিটের নতুন বা পরিবর্তিত বৈশিষ্ট্যগুলির প্রয়োজন হতে পারে, তাই আপনাকে প্রথমে কিস্কিটের `"Install from source"` নির্দেশাবলী `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ এ অনুসরণ করতে হবে
es_un: Dado que Qiskit Optimization depende de Qiskit, y sus últimos cambios pueden requerir características nuevas o modificadas de Qiskit, primero debes seguir las instrucciones de `"Instalar desde el código fuente"` de Qiskit aquí `Qiskit Primeros Pasos <https://qiskit.org/documentation/getting_started.html>`__
ja_jp: Qiskit Optimizationは Qiskit に依存しており、最新の変更が Qiskit の新規機能または変更された機能を必要とする場合があるので、まず「 `Qiskit はじめに <https://qiskit.org/documentation/getting_started.html>`__ 」の `「ソースからのインストール」` の指示に従ってください。
ko_kr: Qiskit Optimization은 Qiskit에 의존하므로 최신 변경 사항에는 Qiskit의 새로운 기능이나 변경된 기능이 필요할 수 있다. 따라서 다음 문서에 있는 Qiskit의 `"Install from source"` 의 지시사항을 먼저 수행해야 한다: `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
pt_un: Uma vez que o Qiskit Optimization depende do Qiskit, e suas últimas mudanças podem exigir recursos novos ou modificados do Qiskit, você deve primeiro seguir as instruções `"Install from source"` do Qiskit aqui `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
ru_ru: Так как Qiskit Optimization зависит от Qiskit, и его последние изменения могут потребовать новых или измененных функций Qiskit, сначала следуйте инструкциям `"Установить из исходного кода"` здесь `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
ta_in: Qiskit உகப்பாக்கம் qiskitடைப் பொறுத்தது என்பதால், அதன் சமீபத்திய மாற்றங்களுக்கு qiskitடின் புதிய அல்லது மாற்றப்பட்ட அம்சங்கள் தேவைப்படலாம் என்பதால், நீங்கள் முதலில் கிஸ்கிட்டின் `"Install from source"` இங்கே வழிமுறைகளைப் பின்பற்ற வேண்டும் `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
te_in: Qiskit Optimization Qiskitపై ఆధారపడి ఉంటుంది మరియు దాని తాజా మార్పులకు Qiskit యొక్క కొత్త లేదా మార్చబడిన లక్షణాలు అవసరం కావచ్చు, మీరు ముందుగా Qiskit యొక్క `"మూలం నుండి ఇన్‌స్టాల్ చేయి"` సూచనలను ఇక్కడ అనుసరించాలి `Qiskit ను మొదలుపెడుతున్నా <https://qiskit.org/documentation/getting_started.html>`__
th_th: เนื่องจาก Qiskit Optimization อยู่ภายใน Qiskit และ การอัปเดตล่าสุดที่เกิดขึ้นอาจจะทำให้เกิดการเพิ่มหรือแก้ไขบางอย่างใน Qiskit ดังนั้นคุณควรทำการติดตั้งตาม `"ติดตั้งจากแหล่งข้อมูลโดยตรง"` มีขั้นตอนการใช้งานอยู่ใน `เริ่มต้นใช้งาน Qiskit <https://qiskit.org/documentation/getting_started.html>`__
tr_tr: Qiskit Optimizasyon, Qiskit'e bağlı olduğundan ve onun son değişiklikleri Qiakit'in yeni ya da değiştirilmiş özelliklerini gerektirebileceğinden, ilk olarak burayı takip etmeniz gerekmektedir: `"Install from source"` instructions here `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
vi_vn: Do Qiskit Optimization phụ thuộc vào Qiskit, và những thay đổi mới nhất của nó có thể sẽ yêu cầu các tính năng mới hoặc chỉnh sửa các tính năng của Qiskit, nên trước tiên bạn cần làm theo hướng dẫn `"Install from source"` của Qiskit tại `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
zh_tw: 由於 Qiskit Optimization 依賴於 Qiskit，Qiskit Optimization 中最新的變動可能需要使用 Qiskit 中新增或更改的功能，所以您需要先遵循 `Qiskit 入門指南<https://qiskit.org/documentation/getting_started.html>`__ 中 `"從來源安裝"` 的指令。

source: Using the same development environment that you installed Qiskit in you are ready to install Qiskit Optimization.
bn_bn: আপনি যেই কিস্কিট ইনস্টল করেছেন সেই একই কর্মপরিবেশ ব্যবহার করে আপনি কিস্কিট অপটিমাইজার ইনস্টল করতে প্রস্তুত।
es_un: Usando el mismo entorno de desarrollo en el que instalaste Qiskit, estás listo para instalar Qiskit Optimization.
ja_jp: Qiskit をインストールしたものと同じ開発環境を使用して、 Qiskit Optimizationをインストールすることができます。
ko_kr: Qiskit을 설치한 동일한 개발 환경을 사용하여 Qiskit Optimization을 설치할 준비가 되었다.
pt_un: Usando o mesmo ambiente de desenvolvimento em que instalou o Qiskit, você está pronto para instalar o Qiskit Optimization.
ru_ru: Используя ту же среду разработки, в которой Вы установили Qiskit, Вы можете установить пакет Qiskit Optimization.
ta_in: நீங்கள் Qiskitடை நிறுவிய அதே வளர்ச்சி சூழலைப் பயன்படுத்தி கிஸ்கிட் உகப்பாக்கலை நிறுவ தயாராக உள்ளீர்கள்.
te_in: మీరు Qiskitని ఇన్‌స్టాల్ చేసిన అదే డెవలప్‌మెంట్ ఎన్విరాన్‌మెంట్‌ని ఉపయోగించి మీరు Qiskit Optimization ని ఇన్‌స్టాల్ చేయడానికి సిద్ధంగా ఉన్నారు.
th_th: การใช้งาน Environment ในการทำงานเดียวกันกับที่คุณติดตั้ง Qiskit ไว้ จะทำให้คุณสามารถติดตั้ง Qiskit Optimization ได้เลย
tr_tr: Qiskit'i kurduğunuz aynı geliştirme ortamını kullanarak Qiskit Optimizasyon'u kurmaya hazırsınız.
vi_vn: Bây giờ bạn đã sẵn sàng để cài đặt Qiskit Optimization trên cùng môi trường phát triển mà bạn đã cài đặt Qiskit trước đó.
zh_tw: 使用已安裝有 Qiskit 的開發環境，即可安裝 Qiskit Optimization。

source: Clone the Qiskit Optimization repository.
bn_bn: Qiskit অপটিমাইজার রিপোজিটরি প্রতিলিপি করুন।
es_un: Clonar el repositorio de Qiskit Optimization.
ja_jp: Qiskit Optimizationリポジトリをクローンします。
ko_kr: Qiskit Optimization repository를 복제하라.
pt_un: Clone o repositório de Otimização Qiskit.
ru_ru: Клонируйте репозиторий Qiskit Optimization.
ta_in: Qiskit உகப்பாக்கம் களஞ்சியத்தை குளோன் செய்யுங்கள்.
te_in: Qiskit Optimization రిపోజిటరీని క్లోన్ చేయండి.
th_th: โคลนที่เก็บข้อมูลของ Qiskit Optimization
tr_tr: Qiskit Optimizasyon deposunu klonlayın.
vi_vn: Nhân bản kho lưu trữ của Qiskit Optimization.
zh_tw: 複製 Qiskit Optimization 儲存庫。

source: Cloning the repository creates a local folder called ``qiskit-optimization``.
bn_bn: রিপোসিটোরিটিকে ক্লোন করলে ``qiskit-optimization`` নামক একটি স্থানীয় ফোল্ডার তৈরী হবে।
es_un: La clonación del repositorio crea una carpeta local llamada ``qiskit-optimization``.
ja_jp: レポジトリをクローンすると、``qiskit-optimization``という名前のローカル・フォルダが作成されます。
ko_kr: Repository 복제는 ``qiskit-optimization`` 라는 이름의 로컬 폴더를 생성한다.
pt_un: A clonagem do repositório cria uma pasta local chamada ``qiskit-optimization``.
ru_ru: Клонирование репозитория создает локальную папку с названием ``qiskit-optimization``.
ta_in: களஞ்சியத்தை குளோன் செய்வது ``qiskit-optimization`` எனப்படும் உள்ளூர் கோப்புறையை உருவாக்குகிறது.
te_in: రిపోజిటరీని క్లోనింగ్ చేయడం వలన ``qiskit-optimization`` అనే స్థానిక ఫోల్డర్‌ను సృష్టిస్తుంది.
th_th: การโคลนที่เก็บข้อมูลจะสร้างโฟลเดอร์บนเครื่องของคุณชื่อ ``qiskit-optimization``
tr_tr: Depoyu klonlamak ``qiskit-optimizasyon`` adında yerel bir dosya oluşturur.
vi_vn: Nhân bản kho lưu trữ sẽ tạo ra một thư mục cục bộ có tên ``qiskit-optimization``.
zh_tw: 複製儲存庫時，會建立名為 ``qiskit-optimization`` 的本地端資料夾。

source: If you want to run tests or linting checks, install the developer requirements.
bn_bn: টেস্ট রান করানোর জন্য বা মোলায়েম করা (লিনটিং) চেক করার জন্য, ডেভেলপারের প্রয়োজন ইনস্টল করুন।
es_un: Si quieres ejecutar pruebas o verificaciones de linting, instala los requerimientos de desarrollador.
ja_jp: もし、テストを実行したり文法をチェックしたい場合は、開発者向けライブラリーをインストールします。
ko_kr: 만약 테스트 코드를 실행하거나 철자법 검사를 하고자 한다면, 개발자 요구사항 라이브러리를 설치하라.
pt_un: Se você quiser executar testes ou análise de código, instale os requisitos de desenvolvedor.
ru_ru: Если Вы хотите запустить тесты, установите необходимые инструменты для разработчика.
ta_in: நீங்கள் சோதனைகள் அல்லது லிண்டிங் காசோலைகளை இயக்க விரும்பினால், டெவலப்பர் தேவைகளை நிறுவவும்.
te_in: మీరు పరీక్షలు లేదా లిన్టింగ్ తనిఖీలను అమలు చేయాలనుకుంటే, డెవలపర్ అవసరాలను ఇన్‌స్టాల్ చేయండి.
th_th: ถ้าคุณต้องการรันการทดสอบ หรือ ตรวจสอบโค้ด ให้ทำการติดตั้งตามข้อกำหนดของนักพัฒนา
tr_tr: Eğer testler veya tiftikleme kontrolleri yapmak istiyorsanız geliştirici gereksinimlerini yükleyin.
vi_vn: Nếu bạn muốn chạy test hoặc linting, hãy cài đặt các yêu cầu dành cho nhà phát triển.

source: Install ``qiskit-optimization``.
bn_bn: ``qiskit-optimization`` ইনস্টল করুন।
es_un: Instalar ``qiskit-optimization``.
ja_jp: ``qiskit-optimization`` をインストールします。
ko_kr: ``qiskit-optimization`` 를 설치하라.
pt_un: Instalar o ``qiskit-optimization``.
ru_ru: Установите ``qiskit-optimization``.
ta_in: ``qiskit-optimization`` ஐ நிறுவவும்.
te_in: ` ` qiskit-optimization ` `స్థాపించు.
th_th: ติดตั้ง ``qiskit-optimization``
tr_tr: ` ` qiskit-optimization ` ` yükleyin.
vi_vn: Cài đặt ``qiskit-optimization``.
zh_tw: 安裝 ``qiskit-optimization``。

source: If you want to install it in editable mode, meaning that code changes to the project don't require a reinstall to be applied, you can do this with:
bn_bn: আপনি যদি এটিকে সম্পাদনযোগ্য মোডে ইনস্টল করতে চান, মানে এই প্রকল্পের কোড পরিবর্তনের জন্য প্রয়োগ করার জন্য পুনরায় ইনস্টল করা প্রয়োজন নেই, আপনি এটি করতে পারেন:
es_un: Si deseas instalarlo en modo editable, lo que significa que los cambios de código en el proyecto no requieren una reinstalación para ser aplicados, puedes hacerlo con:
ja_jp: 編集可能モード (プロジェクトのコードを変更しても再インストールする必要なし) でインストールする場合は、次の手順を実行します:
ko_kr: 만약, 프로젝트에 코드가 변화하였을 때 재설치가 필요하지 않는, 수정 가능한 모드로 설치하고자 한다면, 다음의 명령어를 사용하라.
pt_un: Se você quiser instalá-lo em modo editável, o que significa que as alterações de código no projeto não requerem que uma reinstalação seja aplicada, você pode fazer isso com:
ru_ru: Если Вы хотите установить пакет в редактируемом режиме, который позволяет не переустанавливать пакет в случае изменения кода в проекте, Вы можете сделать это с помощью:
ta_in: நீங்கள் அதை திருத்தக்கூடிய முறையில் நிறுவ விரும்பினால், அதாவது திட்டத்தில் குறியீடு மாற்றங்களை மீண்டும் நிறுவுதல் தேவையில்லை, நீங்கள் இதைச் செய்யலாம்:
te_in: మీరు దీన్ని సవరించగలిగే మోడ్‌లో ఇన్‌స్టాల్ చేయాలనుకుంటే, ప్రాజెక్ట్‌కి కోడ్ మార్పులకు మళ్లీ ఇన్‌స్టాల్ చేయాల్సిన అవసరం లేదు, మీరు దీన్ని దీనితో చేయవచ్చు:
th_th: ถ้าคุณต้องการติดตั้งในรูปแบบการทำงานที่แก้ไขได้ ซึ่งหมายความว่าไม่จำเป็นต้องทำการติดตั้งใหม่เมื่อมีการเปลี่ยนแปลงโค้ดในโปรเจกต์ คุณสามารถทำสิ่งนี้ได้ด้วย:
tr_tr: Eğer düzenlenebilir modda kurmak istiyorsanız, yani projede yapılan kod değişikliklerinin uygulanması için yeniden yükleme gerekmiyorsa, bu işlemi şununla yapabilirsiniz:
vi_vn: Nếu bạn muốn cài đặt ở chế độ có thể chỉnh sửa được, nghĩa là khi bạn thay đổi code trong project thì bạn không cần phải cài đặt lại, làm điều này bằng cách:

source: Optional installs
bn_bn: ঐচ্ছিক ইনস্টল
es_un: Instalaciones opcionales
ja_jp: オプションのインストール
ko_kr: 선택적 설치
pt_un: Instalações opcionais
ru_ru: Необязательные для установки компоненты
ta_in: விருப்ப நிறுவல்கள்
te_in: ఐచ్చిక ఇన్స్టాల్
th_th: ตัวเลือกการติดตั้งเพิ่มเติม
tr_tr: Opsiyonel yüklemeler
vi_vn: Các cài đặt tùy chọn
zh_tw: 選用安裝

source: **IBM CPLEX** may be installed using ``pip install 'qiskit-optimization[cplex]'`` to enable the reading of `LP` files and the usage of the `CplexOptimizer`, wrapper for ``cplex.Cplex``. Currently there is no python 3.9 version of CPLEX. In this case, the CPLEX install command will have no effect.
es_un: **IBM CPLEX** puede instalarse usando ``pip install 'qiskit-optimization[cplex]'`` para permitir la lectura de archivos `LP` y el uso del `CplexOptimizer`, contenedor para ``cplex.Cplex``. Actualmente, no hay una versión Python 3.9 de CPLEX. En este caso, el comando de instalación de CPLEX no tendrá ningún efecto.
ja_jp: **IBM CPLEX** は `pip install 'qiskit-optimization[cplex]'` でインストールできます。`LP` ファイルの読み取りと、``cplex.Cplex`` のラッパーの `CplexOptimizer` の使用を有効にすることができます。現在 Python 3.9 バージョンの CPLEX はありません。この場合、CPLEX インストールコマンドは効果がありません。
pt_un: **IBM CPLEX** pode ser instalado usando ``pip install 'qiskit-optimization[cplex]'`` para permitir a leitura de arquivos `LP` e o uso do `CplexOptimizer`, wrapper para ``cplex.Cplex``. Atualmente não há versão python 3.9 do CPLEX. Neste caso, o comando de instalação do CPLEX não terá efeito.
ru_ru: ** IBM CPLEX* * может быть установлен с помощью команды ``pip install 'qiskit-optimization[cplex]'`` для включения чтения `LP` файлов и использования `CplexOptimizer`, оболочки для ``cplex.Cplex ``. В настоящее время нет версии CPLEX под Python 3.9. В этом случае команда установки CPLEX не сработает.
ta_in: **IBM CPLEX**, ``pip install 'qiskit-optimization[cplex]'`` ஐப் பயன்படுத்தி, `LP` கோப்புகளைப் படிக்கவும், ``cplex.Cplex`` க்கான போர்வையான `CplexOptimizer` -ன் பயன்பாட்டையும் செயல்படுத்தலாம். தற்போது CPLEX -ற்கு Python 3.9 பதிப்பு இல்லை. இந்த வழக்கில், CPLEX install கட்டளை எந்த விளைவையும் ஏற்படுத்தாது.
te_in: **IBM CPLEX** `LP` ఫైల్‌ల రీడింగ్ మరియు ``cplex.Cplex` కోసం ర్యాపర్ `CplexOptimizer` వినియోగాన్ని ప్రారంభించడానికి ``pip install 'qiskit-optimization[cplex]'``ని ఉపయోగించి ఇన్‌స్టాల్ చేయబడవచ్చు. `. ప్రస్తుతం CPLEX యొక్క పైథాన్ 3.9 వెర్షన్ లేదు. ఈ సందర్భంలో, CPLEX ఇన్‌స్టాల్ కమాండ్ ఎటువంటి ప్రభావం చూపదు.
th_th: **IBM CPLEX** สามารถติดตั้งได้ด้วยคำสั่ง ``pip install 'qiskit-optimization[cplex]'`` เพื่อเปิดให้สามารถอ่านไฟล์ `LP` และสามารถใช้งาน `CplexOptimizer` ซึ่งเป็น Wrapper ของ ``cplex.Cplex`` ในปัจจุบันยังไม่มี CPLEX เวอร์ชันสำหรับ Python 3.9 ในกรณีนี้เราจะไม่สามารถใช้คำสั่งติดตั้งได้
zh_tw: **IBM CPLEX** 可使用 ``pip install 'qiskit-optimization[cplex]'` ` 來安裝，以啟用 ` LP` 檔案的讀取，以及 ` `cclexOptimizer ` 的用法， ` `cclex.Cplex` `. 目前沒有 python 3.9 版本的 CPLEX。 在此情況下， CPLEX 安裝指令將沒有作用。
