Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/index.po
Languages: pt_un

source: Overview
pt_un: Visão geral

source: Getting Started
pt_un: Primeiros Passos

source: Tutorials
pt_un: Tutoriais

source: API Reference
pt_un: Referências de API

source: Release Notes
pt_un: Notas da Versão

source: Qiskit Optimization overview
pt_un: Visão geral de Otimização com o Qiskit

source: **Qiskit Optimization** is an open-source framework that covers the whole range from high-level modeling of optimization problems, with automatic conversion of problems to different required representations, to a suite of easy-to-use quantum optimization algorithms that are ready to run on classical simulators, as well as on real quantum devices via Qiskit.
pt_un: **Qiskit Optimization** é um framework open-source que cobre toda a gama desde modelagem de alto nível de problemas de otimização com conversão automática de problemas para diferentes representações, até uma suite de algoritmos de optimização quânticos de fácil utilização que estão prontos para serem executados em simuladores clásicos, e em computadores quânticos reais com o Qiskit.

source: The Optimization module enables easy, efficient modeling of optimization problems using `docplex <https://ibmdecisionoptimization.github.io/docplex-doc/>`__. A uniform interface as well as automatic conversion between different problem representations allows users to solve problems using a large set of algorithms, from variational quantum algorithms, such as the Quantum Approximate Optimization Algorithm QAOA, to Grover Adaptive Search using the GroverOptimizer leveraging fundamental algorithms provided by Terra. Furthermore, the modular design of the optimization module allows it to be easily extended and facilitates rapid development and testing of new algorithms. Compatible classical optimizers are also provided for testing, validation, and benchmarking.
pt_un: O módulo Optimization permite a fácil e eficiente modelagem de problemas de optimização utilizando `docplex <https://ibmdecisionoptimization.github.io/docplex-doc/>`__. Uma interface uniforme, assim como a conversão automática entre diferentes representações de problemas, permite aos usuários resolver problemas usando um grande grupo de algoritmos, desde algoritmos quânticos variacionais, como o Quantum Approximate Optimization Algorithm QAOA (Algoritmo Quântico de Optimização Aproximadada), até a Grover Adaptive Search (Busca Adaptativa de Grover) utilizando o GroverOptimizer e aproveitando os algoritmos fundamentais fornecidos pelo Terra. Além disso, o design modular do módulo de optimização permite ampliá-lo fácilmente, e facilita o rápido desenvolvimento e teste de novos algoritmos. Optimizadores clássicos compatíveis também são fornecidos para testagem, validação e benchmarking.

source: Next Steps
pt_un: Próximos Passos

source: `Getting started <getting_started.html>`_
pt_un: `Começando <getting_started.html>`_

source: `Tutorials <tutorials/index.html>`_
pt_un: `Tutoriais <tutorials/index.html>`_
