Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/01_quadratic_program.po
Languages: bn_bn, es_un, ja, ko, pt_un, ta_in, th, tr_tr, vi

source: For quadratic programs, there are 3 pieces that have to be specified: a constant (offset), a linear term (:math:`c^{T}x`), and a quadratic term (:math:`x^{T}Qx`).
bn_bn: দ্বিঘাত (কোয়াড্রাটিক) প্রোগ্রামগুলির জন্য, এখানে 3 টি অংশ নির্দিষ্ট করতে হবে: একটি ধ্রুবক (অফসেট), একটি রৈখিক পদ (:math:`c^{T}x`), এবং একটি দ্বিঘাত (কোয়াড্রাটিক) পদ (:math:`x^{T}Qx`)।
es_un: Para los programas cuadráticos, hay 3 piezas que se deben de especificar: una constante (compensación u offset), un término lineal (:math:`c^{T}x`), y un término cuadrático (:math:`x^{T}Qx`).
ja: 二次計画法の場合、指定する必要があるのは、定数（オフセット）、線形項（ :math:`c^{T}x` ）、および二次項（ :math:`x^{T}Qx` ）の3つです。
ko: 이차 계획법 문제에서는 다음의 3가지 요소가 명시되어야 한다: 상수 항 (offset), 선형 항(:math:`c^{T}x`), 이차 항(:math:`x^{T}Qx`).
pt_un: Para os programas quadráticos, existem 3 peças que devem ser especificadas: uma constante (offset), um termo linear (:math:`c^{T}x`), e um termo quadrático (:math:`x^{T}Qx`).
ta_in: Quadratic நிரல்களுக்கு, 3 துண்டுகள் குறிப்பிடப்பட்டிருக்க வேண்டும்: ஒரு நிலையான (ஆஃப்செய்ட்), ஒரு நேர்நிரல் (:math:`c^{T}x`), மற்றும் ஒரு quadratic term (:math:`x^{T}Qx`).
th: ในกำหนดการกำลังสองมีอยู่ 3 ส่วนที่เราต้องทำการกำหนด คือ: ค่าคงที่, พจน์เส้นตรง (:math:`c^{T}x`) และ พจน์กำลังสอง (:math:`x^{T}Qx`)
tr_tr: Karesel programlar için, belirtilmesi gereken 3 parça vardır: sabit (göreli konum), doğrusal bir terim (:math:` c ^{T}x `) ve karesel bir terim (:math:` x ^{T}Qx `).
vi: Trong các chương trình bậc hai, có ba thành phần cần phải xác định: một hằng số (bù lại), một số hạng tuyến tính (:math:`c^{T}x`), và một số hạng bậc hai (:math:`x^{T}Qx`).

source: The cell below shows how to declare an objective function using a dictionary. For the linear term, keys in the dictionary correspond to variable names, and the corresponding values are the coefficients. For the quadratic term, keys in the dictionary correspond to the two variables being multiplied, and the values are again the coefficients.
bn_bn: নীচের সেলটি দেখায় যে কীভাবে একটি অভিধান ব্যবহার করে কোনও নৈর্ব্যক্তিক অন্বয় (অব্জেক্টিভ ফাংশন) ঘোষণা করতে হয়। রৈখিক পদটির জন্য, অভিধানের কী-গুলি ভেরিয়েবল নামের সাথে মিলে যায় এবং সংশ্লিষ্ট মানগুলি সহগ হয়। দ্বিঘাত (কোয়াড্রাটিক) পদটির জন্য অভিধানের কী-গুলি দুটি চল রাশির (ভেরিয়েবল) সাথে গুণিত হওয়ার সাথে মিলে যায় এবং মানগুলি আবার সহগ হয়।
es_un: La siguiente celda muestra cómo declarar una función objetivo utilizando un diccionario. Para el término lineal, las claves en el diccionario corresponden a nombres de variables, y los valores correspondientes son los coeficientes. Para el término cuadrático, las claves en el diccionario corresponden a las dos variables que se están multiplicando, y los valores son de nuevo los coeficientes.
ja: 以下のセルは、辞書を使用して目的関数を宣言する方法を示しています。線形項の場合、辞書のキーは変数名に対応し、対応する値は係数です。二次項の場合、辞書のキーは乗算される2つの変数に対応し、値は再び係数になります。
ko: 아래의 셀 (cell) 은 딕셔너리 자료형을 사용하여 목적함수를 선언하는 방법을 보여준다. 선형 항의 경우, 자료형의 키 (key) 는 변수 이름에 대응되며 자료형의 값 (value) 은 계수에 대응된다. 이차 항의 경우, 키는 곱한 두 변수를 나타내며, 마찬가지로 값은 계수에 대응된다.
pt_un: A célula abaixo mostra como declarar uma função objetiva usando um dicionário. Para o termo linear, as chaves do dicionário correspondem a nomes de variáveis, sendo que os valores correspondentes são os coeficientes. Para o termo quadrático, as chaves do dicionário correspondem às duas variáveis que estão sendo multiplicadas, sendo que os valores são novamente os coeficientes.
ta_in: ஒரு அகராதியைப் பயன்படுத்தி ஒரு புறநிலை செயல்பாட்டை எவ்வாறு அறிவிப்பது என்பதை கீழே உள்ள செல் காட்டுகிறது. நேரியல் காலத்திற்கு, அகராதியில் உள்ள விசைகள் மாறக்கூடிய பெயர்களுடன் ஒத்திருக்கும், மேலும் தொடர்புடைய மதிப்புகள் குணகங்களாக இருக்கும். இருபடி காலத்திற்கு, அகராதியில் உள்ள விசைகள் பெருக்கப்படும் இரண்டு மாறிகளுக்கு ஒத்திருக்கும், மேலும் மதிப்புகள் மீண்டும் குணகங்களாக இருக்கும்.
th: ในกล่องด้านล่างแสดงให้เห็นวิธีการกำหนดฟังก์ชันวัตถุประสงค์ด้วย Dictionary สำหรับพจน์เส้นตรง Key ใน Dictionary คือชื่อของตัวแปร และ ค่าที่ Key นั้น ๆ ชี้ไป คือค่าสัมประสิทธิ์ สำหรับพจน์กำลังสอง Key ใน Dictionary คือตัวแปรที่คูณกัน 2 ตัว และ มีค่าที่ Key นั้น ๆ ชี้ไปเป็นค่าสัมประสิทธิ์
tr_tr: Aşağıdaki hücre, bir sözlüğü kullanarak nesnel bir işlevin nasıl bildirileceğini gösterir. Doğrusal terim için, sözlükteki anahtarlar değişken adlara karşılık gelir ve karşılık gelen değerler katsayılardır. Karesel terim için, sözlükteki anahtarlar, çarpılan iki değişkene karşılık gelir ve değerler yine katsayılardır.
vi: Ô dưới đây cho thấy cách khai báo một hàm mục tiêu bằng cách sử dụng một từ điển. Đối với số hạng tuyến tính, các phím trong từ điển tương ứng với các tên biến, và các giá trị tương ứng là các hệ số. Đối với số hạng bậc hai, các phím trong từ điển tương ứng với hai biến được nhân với nhau, và các giá trị là các hệ số.

source: Another way to specify the quadratic program is using arrays. For the linear term, the array corresponds to the vector :math:`c` in the mathematical formulation. For the quadratic term, the array corresponds to the matrix :math:`Q`. Note that the ordering of the variables (:math:`x` in the mathematical formulation) is the order in which the variables were originally declared in the ``QuadraticProgram`` object.
es_un: Otra forma de especificar el programa cuadrático es usando arreglos. Para el término lineal, el arreglo corresponde al vector :math:`c` en la formulación matemática. Para el término cuadrático, el arreglo corresponde a la matriz :math:`Q`. Ten en cuenta que el orden de las variables (:math:`x` en la formulación matemática) es el orden en el que las variables fueron declaradas originalmente en el objeto ``QuadraticProgram``.
ja: 二次計画法を指定する別の方法は、配列を使用することです。一次項の場合、配列は数学的定式化のベクトル :math:`c` に対応します。 二次項の場合、配列は行列 :math:`Q` に対応します。変数の順序（数学的な定式化では :math:`x` ）は、変数が ``QuadraticProgram`` オブジェクトで最初に宣言された順序であることに注意してください。
ko: 이차계획법 문제를 정의하는 또 다른 방법은 배열을 사용하는 것이다. 선형 항에 대해, 배열은 수학적 문제정의에서 :math:`c`에 해당된다. 이차 항에 대해서는, 배열이 행렬 :math:`Q`에 대응된다. 변수들의 순서 (수학적 문제정의에서 :math:`x`) 는 ``QuadraticProgram`` 객체에서 변수들이 처음에 정의된 순서임을 유의하자.
pt_un: Outra maneira de especificar o programa quadrático é usando matrizes. Para o termo linear, a matriz corresponde ao vetor :math:`c` na formulação matemática. Para o termo quadrático, a matriz corresponde à matriz :math:`Q`. Observe que a ordenação das variáveis (:math:`x` na formulação matemática) é a ordem na qual as variáveis foram originalmente declaradas no objeto ``QuadraticProgram``.
ta_in: இருபடி நிரலைக் குறிப்பிட மற்றொரு வழி வரிசைகளைப் பயன்படுத்துவதாகும். நேரியல் சொல்லுக்கு, வரிசையானது கணித உருவாக்கத்தில் திசையன் :math:`c` உடன் ஒத்துள்ளது. இருபடிச் சொல்லுக்கு, வரிசையானது மேட்ரிக்ஸ் :math:`Q` க்கு ஒத்திருக்கும். மாறிகளின் வரிசைமுறை (:math:`x` கணித உருவாக்கத்தில்) என்பது ``QuadraticProgram`` ஆப்ஜெக்டில் மாறிகள் முதலில் அறிவிக்கப்பட்ட வரிசையாகும்.
th: อีกหนึ่งวิธีในการกำหนดกำหนดการกำลังสองคือการใช้ Array สำหรับพจน์เส้นตรง Array จะมีค่าตามเวกเตอร์ :math:`c` ในสมการคณิตศาสตร์ สำหรับพจน์กำลังสองค่าใน Array จะมีค่าตามเมทริกซ์ :math:`Q` หมายเหตุ ลำดับของตัวแปร (:math:`x` ในสมการคณิตศาสตร์) ขึ้นอยู่กับว่าตัวแปรไหนถูกประกาศก่อนกันใน Object ``QuadraticProgram``
vi: Một cách khác để xác định chương trình bậc hai là sử dụng mảng. Đối với thuật ngữ tuyến tính, mảng tương ứng với vector :math:`c` trong công thức toán học. Đối với số hạng bậc hai, mảng tương ứng với ma trận :math:`Q`. Lưu ý rằng thứ tự của các biến (:math:`x` trong công thức toán học) là thứ tự mà các biến được khai báo ban đầu trong đối tượng ``QuadraticProgram``.

source: You can access the constant, the linear term, and the quadratic term by looking at ``Quadratic.objective.{constant, linear, quadratic}``, respectively. As for linear and quadratic terms, you can get a dense matrix (``to_array``), a sparse matrix (``coefficients``), and a dictionary (``to_dict``). For dictionaries, you can specify whether to use variable indices or names as keys. Note that the quadratic terms are stored in a compressed way, e.g., ``{('x', 'y'): 1, ('y', 'x'): 2}`` is stored as ``{('x', 'y'): 3}``. You can get the quadratic term as a symmetric matrix by calling ``to_array(symmetric=True)`` or ``to_dict(symmetric=True)``. If you call ``to_dict(name=True)``, you can get a dictionary whose keys are pairs of variable names.
bn_bn: আপনি যথাক্রমে``Quadratic.objective.{constant, linear, quadratic}``, দেখে ধ্রুবক, রৈখিক পদ এবং দ্বিঘাত (কোয়াড্রাটিক) পদ ব্যবহার করতে পারেন। রৈখিক এবং দ্বিঘাত শর্তাবলী হিসাবে, আপনি একটি ডেন্স ম্যাট্রিক্স (``to_array``), একটি স্পার্স ম্যাট্রিক্স (``coefficients`), এবং একটি অভিধান (``to_dict``) পেতে পারেন। অভিধানগুলির জন্য, আপনি "কী" হিসাবে পরিবর্তনশীল সূচক বা নাম ব্যবহার করতে হবে তা নির্দিষ্ট করতে পারেন। টীকা: দ্বিঘাত (কোয়াড্রাটিক) পদগুলি সংকুচিতভাবে সংরক্ষণ করা হয়, উদাহরণস্বরূপ, ``{('x', 'y'): 1, ('y', 'x'): 2}`` , ``{('x', 'y'): 3}``. হিসাবে সঞ্চিত হয়। আপনি ``to_array(symmetric=True)`` বা ``to_dict(symmetric=True)`` কল করে দ্বিঘাত (কোয়াড্রাটিক) পদকে প্রতিসম ম্যাট্রিক্স হিসাবে পেতে পারেন। আপনি যদি ``to_dict(name=True)`` কল করেন তবে আপনি একটি অভিধান পেতে পারেন যার কী-গুলি চলক নামের জোড়া।
es_un: Puedes acceder a la constante, el término lineal y el término cuadrático mediante ``Quadratic.objective.{constant, linear, quadratic}``, respectivamente. En cuanto a los términos lineales y cuadráticos, puedes obtener una matriz densa (``to_array``), una matriz dispersa (``coefficients``), y un diccionario (``to_dict``). Para los diccionarios, puedes especificar si usar los índices de variables o los nombres como claves. Ten en cuenta que los términos cuadráticos se almacenan de una manera comprimida, por ejemplo, ``{('x', 'y'): 1, ('y', 'x'): 2}`` se almacena como ``{('x', 'y'): 3}``. Puedes obtener el término cuadrático como una matriz simétrica llamando a ``to_array(symmetric=True)`` o ``to_dict(symmetric=True)``. Si llamas a ``to_dict(name=True)``, puedes obtener un diccionario cuyas claves son pares de nombres de variables.
ja: ``Quadratic.objective.{constant, linear, quadratic}`` をそれぞれ調べることで、定数、線形項、および二次項にアクセスできます。線形および二次項については、密行列（ ``to_array`` ）、疎行列（ ``coefficients`` ）、および辞書（ ``to_dict`` ）を取得できます。辞書の場合、変数インデックスまたは名前をキーとして使用するかどうかを指定できます。二次項は圧縮された方法で格納されることに注意してください。たとえば、 ``{('x', 'y'): 1, ('y', 'x'): 2}`` は ``{('x', 'y'): 3}`` として格納されます。 ``to_array(symmetric=True)`` または ``to_dict(symmetric=True)`` を呼び出すことにより、二次項を対称行列として取得できます。 ``to_dict(name=True)`` を呼び出すと、キーが変数名のペアである辞書を取得できます。
ko: ``Quadratic.objective.{constant, linear, quadratic}`` 를 출력함으로써 상수 항, 선형 항, 이차 항에 각각 액세스 (access) 할 수 있다. 선형 항과 이차 항을 출력하고자 할 때는 밀집 행렬(``to_array``), 희소 행렬(``coefficients``), 딕셔너리(``to_dict``) 중에서 선택하여 출력할 수 있다. 딕셔너리의 경우, 자료형의 키를 명시할 때 변수들의 인덱스를 사용하거나 변수들의 이름을 사용하여 명시할 수 있다. 출력된 이차 항은 압축된 형태 (즉, ``{('x', 'y'): 1, ('y', 'x'): 2}`` 는 ``{('x', 'y'): 3}`` 의 형태로 압축) 임에 유의해야한다. ``to_array(symmetric=True)`` 또는 ``to_dict(symmetric=True)`` 를 호출하여 이차 항을 대칭 행렬 형태로 출력할 수 있다. 만약 ``to_dict(name=True)`` 를 호출했다면 키가 변수 이름의 쌍인 딕셔너리 형태로 출력할 수 있다.
pt_un: Você pode acessar a constante, o termo linear, e o termo quadrático olhando para ``Quadratic.objective.{constant, linear, quadratic}``, respectivamente. Quanto aos termos lineares e quadráticos, pode-se obter uma matriz densa (``to_array``), uma matriz esparsa (``coefficients``), e um dicionário (``to_dict``). Para os dicionários, é possível especificar se deve usar os índices ou nomes das variáveis como chaves. Observe que os termos quadráticos são armazenados de forma compactada, por exemplo, ``{('x', 'y'): 1, ('y', 'x'): 2}`` é armazenado como ``{('x', 'y'): 3}``. Você pode obter o termo quadrático como uma matriz simétrica chamando ``to_array(symmetric=True)`` ou ``to_dict(symmetric=True)``. Se você chamar ``to_dict(name=True)``, você pode obter um dicionário cujas chaves são pares de nomes de variáveis.
ta_in: முறையே ``Quadratic.objective.{constant, linear, quadratic}`` ஐப் பார்த்து நிலையான, நேரியல் சொல் மற்றும் இருபடி காலத்தை அணுகலாம். நேரியல் மற்றும் இருபடி சொற்களைப் பொறுத்தவரை, நீங்கள் அடர்த்தியான அணி (``to_array``), ஒரு சிதறாத அணி (``coefficients``) மற்றும் ஒரு அகராதி (``to_dict``) ஆகியவற்றைப் பெறலாம். அகராதிகளுக்கு, மாறி குறியீடுகள் அல்லது பெயர்களை விசைகளாகப் பயன்படுத்தலாமா என்பதை நீங்கள் குறிப்பிடலாம். இருபடி சொற்கள் சுருக்கப்பட்ட வழியில் சேமிக்கப்படுகின்றன என்பதை நினைவில் கொள்க, எ.கா., ``{('x', 'y'): 1, ('y', 'x'): 2}`` ``{('x', 'y'): 3}``என சேமிக்கப்படுகிறது. ``to_array(symmetric=True)`` அல்லது ``to_dict(symmetric=True)`` என்று அழைப்பதன் மூலம் நீங்கள் இருபடிச் சொல்லை சமச்சீர் மேட்ரிக்ஸாகப் பெறலாம். நீங்கள் ``to_dict (name=True)`` என்று அழைத்தால், நீங்கள் ஒரு அகராதியைப் பெறலாம், அதன் விசைகள் மாறி பெயர்களின் ஜோடிகளாகும்.
th: คุณสามารถเข้าถึงค่าคงที่, พจน์เส้นตรง และ พจน์กำลังสองได้ โดยการดูที่ ``Quadratic.objective.{constant, linear, quadratic}`` ตามลำดับ สำหรับพจน์เส้นตรงและพจน์กำลังสอง คุณสามารถดูค่า Dense Matrix (``to_array``), Sparse Matrix (``coefficients``) และ Dictionary (``to_dict``) สำหรับ Dictionary คุณสามารถเข้าถึงตัวแปรต่าง ๆ ได้ผ่านทาง Key หมายเหตุ พจน์กำลังสองจะถูกรวบในกรณีที่มีค่าเหมือนกัน เช่น ``{('x', 'y'): 1, ('y', 'x'): 2}`` ถูกเก็บในลักษณะ ``{('x', 'y'): 3}`` คุณสามารถรับค่าพจน์กำลังสองในลักษณะ Symmetric โดยการเรียกใช้ ``to_array(symmetric=True)`` หรือ ``to_dict(symmetric=True)`` ถ้าคุณเรียกใช้ ``to_dict(name=True)`` คุณจะได้ Dictionary ที่มี Key เป็นคู่ของขื่อตัวแปร
tr_tr: ``Quadratic.objective.{constant, linear, quadratic}``e bakarak sırasıyla sabite, doğrusal terime ve karasel terime ulaşabilirsiniz. Doğrusal ve karesel terimlere gelince, yoğun bir matris (``to_array``), seyrek bir matris (``coefficients``) ve bir sözlük (``to_dict``) elde edebilirsiniz. Sözlükler için, anahtar olarak değişken dizinlerin mi yoksa adların mı kullanılacağını belirtebilirsiniz. İkinci dereceden terimlerin sıkıştırılmış bir şekilde saklandığına dikkat edin, örneğin, ``{('x', 'y'): 1, ('y', 'x'): 2}``, ``{('x', 'y'): 3}`` olarak saklanır. İkinci dereceden terimi, ``to_array(symmetric=True)`` veya ``to_dict(symmetric=True)`` öğesini çağırarak simetrik bir matris olarak alabilirsiniz. ``to_dict(name=True)`` öğesini çağırırsanız, anahtarları değişken adlarının çiftleri olan bir sözlük alabilirsiniz.
vi: Bạn có thể truy cập hằng số, số hạng tuyến tính và số hạng bậc hai bằng cách xem ``Quadratic.objective.{constant, linear, quadratic}``, tương ứng. Như các số hạng tuyến tính và bậc hai, bạn có thể có một ma trận dày đặc (``to_array``), một ma trận thưa (``coefficients``), và một từ điển (``to_dict``). Đối với các từ điển, bạn có thể xác định xem nên sử dụng chỉ số biến hay tên như các phím. Lưu ý rằng các số hạng bậc hai được lưu vắn tắt, ví dụ, ``{('x', 'y'): 1, ('y', 'x'): 2}`` được lưu trữ như ``{('x', 'y'): 3}``. Bạn có thể tạo số hạng bậc hai như một ma trận đối xứng bằng cách gọi ``to_array(symmetric=True)`` hoặc ``to_dict(symmetric=True)``. Nếu bạn gọi ``to_dict(name=True)``, bạn có thể có được một từ điển có các phím là các cặp tên biến.

source: Adding/removing linear and quadratic constraints
bn_bn: রৈখিক এবং দ্বিঘাত (কোয়াড্রাটিক) সীমাবদ্ধতা যুক্ত করা / সরানো
es_un: Agregar/eliminar restricciones lineales y cuadráticas
ja: 線形および二次制約の追加/削除
ko: 선형 제약조건과 이차 제약조건을 추가/제거하기
pt_un: Adicionando/removendo restrições lineares e quadráticas
ta_in: நேரியல் மற்றும் இருபடி தடைகளைச் சேர்த்தல் / நீக்குதல்
th: การเพิ่ม/ลด ข้อจำกัดแบบเส้นตรงและกำลังสอง
tr_tr: Doğrusal ve karesel kısıtlamaları ekleme/kaldırma
vi: Thêm/xóa các ràng buộc bậc một và bậc hai

source: You can add linear constraints by setting name, linear expression, sense and right-hand-side value (rhs). You can use senses ‘EQ’, ‘LE’, and ‘GE’ as Docplex supports.
bn_bn: নাম, রৈখিক (লিনিয়ার) এক্সপ্রেশন, সেন্স এবং ডান দিকের মান (আরএইচএস) সেট করে আপনি রৈখিক সীমাবদ্ধতা যুক্ত করতে পারেন। ডকপ্লেক্স সমর্থন হিসাবে আপনি সেন্স-গুলিতে ‘ইসিউ’, ‘এলই’ এবং ‘জিই’ ব্যবহার করতে পারেন।.
es_un: Puedes agregar restricciones lineales estableciendo un nombre, expresión lineal, sentido y el valor del lado derecho (right-hand-side, rhs). Puedes utilizar los sentidos ‘EQ’, ‘LE’, y ‘GE’ como lo soporta Docplex.
ja: 名前(name)、線形式(linear)、検出(sense)、および右側の値 (rhs) を設定することで、線形制約を追加できます。Docplexのサポートとして、 ‘EQ’, ‘LE’, ‘GE’ の検出が使用できます。
ko: 이름, 선형 표현식, 민감도 (sense), 우변 (right-hand-side valuel; rhs) 을 설정함으로써 선형 항의 제약조건을 추가할 수 있다. 민감도의 경우 Docples는 ‘EQ’, ‘LE’, 및 ‘GE’ 를 지원한다.
pt_un: Você pode adicionar restrições lineares configurando um nome, uma expressão linear, um sentido e um valor à direita (rhs). Você pode usar os sentidos ‘EQ’, ‘LE’, e ‘GE’ como o Docplex suporta.
ta_in: பெயர், நேரியல் வெளிப்பாடு, உணர்வு மற்றும் வலது கை மதிப்பு (rhs) ஆகியவற்றை அமைப்பதன் மூலம் நீங்கள் நேரியல் கட்டுப்பாடுகளைச் சேர்க்கலாம். டாக்ளெக்ஸ் ஆதரவாக நீங்கள் ‘EQ’, ‘LE’ மற்றும் ‘GE’ போன்ற புலன்களைப் பயன்படுத்தலாம்.
th: คุณสามารถเพิ่มข้อจำกัดแบบเส้นตรงได้ด้วยตัวแปร linear expression, sense และ right-hand-side (rhs) ในตัวแปร sense สามารถใช้ ‘EQ’, ‘LE’ และ ‘GE’ ตามที่มีใน Docplex
tr_tr: Ad, doğrusal ifade, anlam ve sağ taraf değeri (rhs) ayarlayarak doğrusal kısıtlamalar ekleyebilirsiniz. Docplex'in desteklediği gibi ‘EQ’, ‘LE’ ve ‘GE’ uslarını kullanabilirsiniz.
vi: Bạn có thể thêm các ràng buộc tuyến tính bằng cách cài đặt tên, phương trình tuyến tính, thuộc tính và các giá trị bên phải (rhs). Bạn cũng có thể dùng thuộc tính ‘EQ’, ‘LE’, và ‘GE’ như các hỗ trợ cho Docplex.

source: You can add quadratic constraints as well as objective function and linear constraints.
bn_bn: আপনি দ্বিঘাত (কোয়াড্রাটিক) সীমাবদ্ধতার পাশাপাশি নৈর্ব্যক্তিক অন্বয় (অব্জেক্টিভ ফাংশন) এবং রৈখিক (লিনিয়ার) সীমাবদ্ধতা যুক্ত করতে পারেন।.
es_un: Puedes añadir restricciones cuadráticas, así como funciones objetivo y restricciones lineales.
ja: 二次制約だけでなく、目的関数や線形制約も追加できます。
ko: 목적함수와 선형 항의 제약조건 뿐만 아니라 이차 항의 제약조건도 추가할 수 있다.
pt_un: Você pode adicionar restrições quadráticas, bem como funções objetivas e restrições lineares.
ta_in: நீங்கள் இருபடி கட்டுப்பாடுகள் மற்றும் புறநிலை செயல்பாடு மற்றும் நேரியல் தடைகளை சேர்க்கலாம்.
th: คุณสามารถเพิ่มข้อจำกัดกำลังสองได้ เช่นเดียวกับฟังก์ชันวัตถุประสงค์ และ ข้อจำกัดแบบเส้นตรง
tr_tr: Karesel kısıtlamaların yanı sıra amaç fonksiyonu ve doğrusal kısıtlamalar ekleyebilirsiniz.
vi: Bạn có thể thêm các ràng buộc bậc hai cũng như các hàm mục tiêu và các ràng buộc tuyến tính.

source: You can access linear and quadratic terms of linear and quadratic constraints as in the same way as the objective function.
bn_bn: আপনি নৈর্ব্যক্তিক অন্বয় (অব্জেক্টিভ ফাংশন) এর মতন করেই রৈখিক এবং দ্বিঘাত (কোয়াড্রাটিক) শর্তাদির প্রবেশাধিকার পেতে পারেন ।
es_un: Puedes acceder a términos lineales y cuadráticos de restricciones cuadráticas y lineales como del mismo modo que la función objetivo.
ja: 目的関数と同じ方法で、線形および二次制約の線形および二次項にアクセスできます。
ko: 목적함수에 액세스(access) 했던 방법을 그대로 사용하여 선형 제약조건의 선형 항과 이차 제약조건의 이차 항에 각각 액세스할 수 있다.
pt_un: Você pode acessar termos lineares e quadráticos de restrições lineares e quadráticas da mesma forma que com a função objetiva.
ta_in: புறநிலை செயல்பாட்டைப் போலவே நேரியல் மற்றும் இருபடி கட்டுப்பாடுகளின் நேரியல் மற்றும் இருபடி சொற்களை நீங்கள் அணுகலாம்.
th: คุณสามารถเข้าถึงพจน์เส้นตรงและกำลังสองของข้อจำกัดเส้นตรงและกำลังสองได้เช่นเดียวกับการเข้าถึงฟังก์ชันวัตถุประสงค์
tr_tr: Doğrusal ve karesel kısıtların doğrusal ve karesel terimlerine, amaç fonksiyonu ile aynı şekilde erişebilirsiniz.
vi: Bạn có thể truy cập các số hạng tuyến tính và bậc hai của các ràng buộc tuyến tính và bậc hai tương tự như với hàm mục tiêu.

source: You can also remove linear/quadratic constraints by ``remove_linear_constraint`` and ``remove_quadratic_constraint``.
bn_bn: আপনি রৈখিক / দ্বিঘাত (কোয়াড্রাটিক) সীমাবদ্ধতাগুলি ``remove_linear_constraint`` এবং ``remove_quadratic_constraint``` দ্বারাও মুছে ফেলতে পারেন ।
es_un: También puedes eliminar restricciones lineales/cuadráticas con ``remove_linear_constraint`` y ``remove_quadratic_constraint``.
ja: また、 ``remove_linear_constraint`` と ``remove_quadratic_constraint`` によって線形/二次制約を削除することもできます。
ko: 또한 ``remove_linear_constraint`` 과 ``remove_quadratic_constraint`` 을 사용하여 선형/이차 제약조건을 제거할 수 있다.
pt_un: Você também pode remover restrições lineares/quadráticas usando ``remove_linear_constraint`` e ``remove_quadratic_constraint``.
ta_in: `` Remove_linear_constraint`` மற்றும் `` remove_quadratic_constraint`` மூலம் நேரியல் / இருபடி கட்டுப்பாடுகளையும் நீக்கலாம்.
th: คุณสามารถนำข้อจำกัดเส้นตรง/กำลังสองออกได้ด้วย ``remove_linear_constraint`` and ``remove_quadratic_constraint``
tr_tr: Ayrıca ``remove_linear_constraint`` ve ``remove_quadratic_constraint`` ile doğrusal/karesel kısıtları ortadan kaldırabilirsiniz.
vi: Bạn cũng có thể loại bỏ các ràng buộc tuyến tính/bậc hai với ``remove_linear_constraint`` và ``remove_quadatic_constraint``.

source: You can substitute some of variables with constants or other variables. More precisely, ``QuadraticProgram`` has a method ``substitute_variables(constants=..., variables=...)`` to deal with the following two cases.
es_un: Puedes sustituir algunas de las variables con constantes u otras variables. Más precisamente, ``QuadraticProgram`` tiene un método ``substitute_variables(constants=..., variables=...)`` para tratar los dos casos siguientes.
ja: 一部の変数を定数または他の変数に置き換えることができます。より正確には、 ``QuadraticProgram`` には、次の2つのケースを処理するためのメソッド ``substitute_variables(constants=..., variables=...)`` があります。
ko: 여기서 일부 변수들을 상수들 혹은 다른 변수들로 대체할 수 있다. 더 정확히 말하면, ``QuadraticProgram`` 은 다음의 두 가지 경우를 다룰 수 있는 ``substitute_variables(constants=..., variables=...)`` 메소드를 가지고 있다.
pt_un: Você pode substituir algumas variáveis com constantes ou outras variáveis. Mais precisamente, o ``QuadraticProgram`` tem um método ``substitute_variables(constants=..., variables=...)`` para lidar com os dois casos seguintes.
ta_in: நீங்கள் சில மாறிகளை மாறிலிகள் அல்லது பிற மாறிகள் மூலம் மாற்றலாம். இன்னும் துல்லியமாக, ``QuadraticProgram`` ஆனது பின்வரும் இரண்டு நிகழ்வுகளைச் சமாளிக்க, ``substitute_variables(constants=..., variables=...)`` முறையைக் கொண்டுள்ளது.
th: คุณสามารถแทนที่บางตัวแปรด้วยค่าคงที่หรือตัวแปรอื่นได้ จากการใช้ Method ``substitute_variables(constants=..., variables=...)`` ใน ``QuadraticProgram`` เพื่อจัดการในสองกรณี
vi: Bạn có thể thay thế một số biến bằng hằng số hoặc các biến khác. Chính xác hơn, ``QuadraticProgram`` có một phương thức ``substitute_variables(constants=..., variables=...)`` để giải quyết hai trường hợp sau.

source: :math:`x \leftarrow c`: when ``constants`` have a dictionary ``{x: c}``.
es_un: :math:`x \leftarrow c`: cuando ``constants`` tenga un diccionario ``{x: c}``.
ja: :math:`x \leftarrow c` : ``constants`` が辞書 ``{x: c}`` の場合。
ko: :math:`x \leftarrow c`: ``constants`` 가 딕셔너리의 원소로 ``{x: c}`` 를 가질 때
pt_un: :math:`x \leftarrow c`: quando ``constants`` tem um dicionário ``{x: c}``.
ta_in: :math:`x \leftarrow c`: ``constants`` -க்கு ஒரு அகராதி ``{x: c}`` இருக்கும்போது.
th: :math:`x \leftarrow c`: เมื่อ ``constants`` มี Dictionary ``{x: c}``.
vi: :math:`x \leftarrow c`: khi ``constants`` có từ điển ``{x: c}``.

source: :math:`x \leftarrow c y`: when ``variables`` have a dictionary ``{x: (y, c)}``.
es_un: :math:`x \leftarrow c y`: cuando ``variables`` tenga un diccionario ``{x: (y, c)}``.
ja: :math:`x \leftarrow c y` : ``variables`` が辞書 ``{x: (y, c)}`` の場合。
ko: :math:`x \leftarrow c y`: ``variables`` 이 딕셔너리의 원소로 ``{x: (y, c)}`` 를 가질 때
pt_un: :math:`x \leftarrow c y`: quando ``variables`` tem um dicionário ``{x: (y, c)}``.
ta_in: :math:`x \leftarrow c y`: ``variables`` க்கு ஒரு அகராதி ``{x: (y, c)}`` இருக்கும்போது.
th: :math:`x \leftarrow c y`: เมื่อ ``variables`` มี Dictionary ``{x: (y, c)}``.
vi: :math:`x \leftarrow c y`: khi ``variables`` có từ điển ``{x: (y, c)}``.

source: Substituting Variables
bn_bn: চল রাশি প্রতিস্থাপন করা
es_un: Sustituir Variables
ja: 変数を置き換えます
ko: 변수 치환
pt_un: Substituindo Variáveis
ta_in: மாற்று மாறிகள்
th: การแทนที่ตัวแปร
tr_tr: Değişkenleri Değiştirme
vi: Thay thế các biến
