Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/01_quadratic_program.po
Languages: bn_bn, es_un, ja, ko, pt_un, ta_in, th, tr_tr, vi

source: This page was generated from `docs/tutorials/01_quadratic_program.ipynb`__.
bn_bn: এই পেজটি `docs/tutorials/01_quadratic_program.ipynb`__ থেকে তৈরি হয়েছে।
es_un: Esta página fue generada a partir de `docs/tutorials/01_quadratic_program.ipynb`__.
ja: このページは `docs/tutorials/01_quadratic_program.ipynb`__ から生成されました。
ko: 이 페이지는 `docs/tutorials/01_quadratic_program.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/01_quadratic_program.ipynb`__.
ta_in: இந்தப் பக்கம் `docs/tutorials/03_quantum_kernel.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
th: หน้านี้ถูกสร้างขึ้นจาก `docs/tutorial s/01 _ neural _ network. Ipynb`__
tr_tr: Bu sayfa, `docs/tutorials/01_quadratic_program.ipynb`__ sayfasından oluşturulmuştur.
vi: Trang này được tạo từ `docs/tutorials/01_quadratic_program.ipynb`__.

source: Quadratic Programs
bn_bn: দ্বিঘাত (কোয়াড্র্যাটিক) প্রোগ্রামস
es_un: Programas Cuadráticos
ja: 二次計画法
ko: 이차계획법 문제
pt_un: Programas Quadráticos
ta_in: இருபடி திட்டங்கள்
th: Quadratic Program
vi: Bài toán lập trình bậc hai

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
ja: はじめに
ko: 소개
pt_un: Introdução
ta_in: முன்னுரை
th: บทนำ
vi: Giới thiệu

source: In this tutorial, we briefly introduce how to build optimization problems using Qiskit’s optimization module. Qiskit introduces the ``QuadraticProgram`` class to make a model of an optimization problem. More precisely, it deals with quadratically constrained quadratic programs given as follows:
bn_bn: এই পাঠসমূহে (টিউটোরিয়াল), আমরা Qiskit অপ্টিমাইজেশন মডিউলটি ব্যবহার করে কীভাবে অনুকূলায়ন (অপ্টিমাইজেশন) সমস্যাসমূহ তৈরি করতে পারি তার জন্য সংক্ষেপে পরিচয় করিয়ে দেব। কিসকিট একটি অপ্টিমাইজেশান সমস্যার মডেল তৈরি করতে ``QuadraticProgram`` শ্রেণীর সাথে পরিচয় করিয়ে দিয়েছে। আরও স্পষ্টভাবে, এটি দ্বিঘাত ভাবে সীমাবদ্ধ দ্বিঘাত প্রোগ্রামগুলির (Quadratic Program) সাথে সম্পর্কিত যা নীচে দেওয়া হয়েছে:
es_un: En este tutorial presentamos brevemente cómo construir problemas de optimización usando el módulo de optimización de Qiskit. Qiskit introduce la clase ``QuadraticProgram`` para hacer un modelo de un problema de optimización. Más precisamente, se ocupa de programas cuadráticamente restringidos que se dan de la siguiente manera:
ja: このチュートリアルでは、Qiskit の最適化モジュールを利用して最適化問題をビルドする方法について簡単に紹介します。最適化問題のモデルを構築するために、Qiskit には ``QuadraticProgram`` クラスが導入されています。より正確には、次のような二次制約二次計画問題を扱います。
ko: 본 튜토리얼에서는 Qiskit의 최적화 모듈을 사용하여 최적화 문제를 생성하는 방법을 간략하게 소개한다. Qiskit은 최적화 문제의 모델을 생성하기 위하여 ``QuadraticProgram`` 클래스를 소개한다. 더 정확하게 말하자면, ``QuadraticProgram`` 은 목적함수와 제약조건이 모두 이차식으로 주어진 문제들 (quadratically constrained quadratic programs) 을 다룬다. 예를 들어, 다음과 같이 주어진 문제에서:
pt_un: Neste tutorial, introduzimos brevemente como construir problemas de otimização usando o módulo de otimização do Qiskit. O Qiskit introduz a classe ``QuadraticProgram`` para fazer um modelo de um problema de otimização. Mais precisamente, ela lida com programas quadráticos restritos quadraticamente, dados da seguinte forma:
ta_in: இந்த டுடோரியலில், qiskit தேர்வுமுறை தொகுதியைப் பயன்படுத்தி தேர்வுமுறை சிக்கல்களை எவ்வாறு உருவாக்குவது என்பதை சுருக்கமாக அறிமுகப்படுத்துகிறோம். தேர்வுமுறை சிக்கலின் மாதிரியை உருவாக்க qiskit ``இருபடி திட்டங்கள்`` வகுப்பை அறிமுகப்படுத்துகிறது. இன்னும் துல்லியமாக, இது பின்வருமாறு கொடுக்கப்பட்டுள்ள இருபடி கட்டுப்படுத்தப்பட்ட இருபடி திட்டங்களுடன் தொடர்புடையது:
th: ในบทแนะนำนี้เป็นการแนะนำวิธีการสร้างโจทย์ปัญหา Optimization ด้วยโมดูล Qiskit Optimization ในการใช้งานคลาส``QuadraticProgram`` เพื่อสร้างโมเดลของโจทย์ปัญหา Optimization โดยเจาะจงไปที่กำหนดการกำลังสองแบบมีข้อจำกัดดังนี้:
tr_tr: Bu eğitici dokümanda, kısaca Qiskit'in optimizasyon modülünü kullanarak optimizasyon problemlerinin nasıl oluşturulacabileceğinden bahsedilmektedir. Qiskit, bir optimizasyon problemi modeli oluşturmak için ``QuadraticProgram`` sınıfını sunar. Daha iyi ifade etmek gerekirse, aşağıdaki gibi verilen ikinci dereceden kısıtlanmış ikinci dereceden programlarla ilgilenir:
vi: Trong hướng dẫn này, chúng tôi giới thiệu ngắn gọn cách xây dựng các vấn đề tối ưu hóa sử dụng module tối ưu hóa của Qiskit. Qiskit giới thiệu lớp ``QuadraticProgram`` để làm một mô hình của một vấn đề tối ưu hóa. Chính xác hơn, nó giải quyết các bài toán lập trình bậc hai bị ràng buộc bậc hai như dưới đây:

source: \begin{align} \text{minimize}\quad& x^\top Q_0 x + c^\top x\\ \text{subject to}\quad& A x \leq b\\ & x^\top Q_i x + a_i^\top x \leq r_i, \quad 1,\dots,i,\dots,q\\ & l_i \leq x_i \leq u_i, \quad 1,\dots,i,\dots,n, \end{align}
es_un: \begin{align} \text{minimizar}\quad& x^\top Q_0 x + c^\top x\\ \text{sujeto a}\quad& A x \leq b\\ & x^\top Q_i x + a_i^\top x \leq r_i, \quad 1,\dots,i,\dots,q\\ & l_i \leq x_i \leq u_i, \quad 1,\dots,i,\dots,n, \end{align}

source: where the :math:`Q_i` are :math:`n \times n` matrices, :math:`A` is a :math:`m \times n` matrix , :math:`x`, and :math:`c` are :math:`n`-dimensional vectors, :math:`b` is an :math:`m`-dimensional vector, and where :math:`x` can be defined as binary, integer, or continuous variables. In addition to “:math:`\leq`” constraints ``QuadraticProgram`` also supports “:math:`\geq`” and “:math:`=`”.
es_un: donde los :math:`Q_i` son matrices :math:`n \times n`, :math:`A` es una matriz :math:`m \times n`, :math:`x` y :math:`c` son vectores :math:`n`-dimensionales, :math:`b` es un vector :math:`m`-dimensional, y donde las :math:`x` se pueden definir como variables binarias, enteras o continuas. Además de las restricciones “:math:`\leq`”, ``QuadraticProgram`` también admite “:math:`\geq`” e “:math:`=`”.
ja: ここで、 :math:`Q_i` は :math:`n \times n` 行列、 :math:`A` は :math:`m \times n` 行列、 :math:`x` と :math:`c` は :math:`n` 次元ベクトル、 :math:`b` は :math:`m` 次元ベクトル、 :math:`x` はバイナリー、整数、または連続変数として定義できます。 「 :math:`\leq` 」制約に加えて、 ``QuadraticProgram`` は「 :math:`\geq` 」と「 :math:`=` 」もサポートします。
ko: 여기서 :math:`Q_i` 들은 :math:`n \times n` 행렬들, :math:`A` 는 :math:`m \times n` 행렬, :math:`x` 와 :math:`c` 는 :math:`n` 차원 벡터들, :math:`b` 는 :math:`m` 차원 벡터이며, :math:`x` 는 이진, 정수, 또는 연속변수로 정의될 수 있다. “:math:`\leq`” 제약조건들뿐 아니라, ``QuadraticProgram`` 은 “:math:`\geq`” 와 “:math:`=`” 도 지원한다.
pt_un: onde :math:`Q_i` são matrizes :math:`n \times n`, :math:`A` é uma matriz :math:`m \times n`, :math:`x` e :math:`c` são vetores :math:`n`-dimensionais, :math:`b` é um vetor :math:`m`-dimensional, e onde :math:`x` pode ser definido com variáveis binárias, inteiras ou contínuas. Além das restrições “:math:`\leq`”, ``QuadraticProgram`` também suporta “:math:`\geq`” and “:math:`=`”.
ta_in: இதில் :math:`Q_i` ஆனது :math:`n \times n` மேட்ரிக்ஸ்கள், :math:`A` என்பது ஒரு :math:`m \times n` மேட்ரிக்ஸ், :math:`x`, மற்றும் :math:`c` ஆனது :math:`n`-dimensional திசையன்கள், :math:`b` என்பது ஒரு :math:`m`-dimensional திசையன், மற்றும் அதில் :math:`x` ஐ பைனரி, முழு எண் அல்லது தொடர்ச்சியான மாறிகள் என வரையறுக்கலாம். “:math:`\leq`” கட்டுப்பாடுகளுடன் கூடுதலாக ``QuadraticProgram`` ஆனது “:math:`\geq`” மற்றும் “:math:`=`” -ஐ ஆதரிக்கிறது.
th: โดยที่ :math:`Q_i` คือเมทริกซ์ขนาด :math:`n \times n`, :math:`A` คือเมทริกซ์ขนาด :math:`m \times n`, :math:`x` และ :math:`c` คือเวกเตอร์ขนาด :math:`n`, :math:`b` คือเวกเตอร์ขนาด :math:`m` และ :math:`x` สามารถเป็นตัวแปรได้ทั้งแบบ ไบนารี่, จำนวนเต็ม หรือแบบ ตัวแปรต่อเนื่อง นอกจากนี้ ``QuadraticProgram`` ยังสามารถใช้ได้กับข้อจำกัดที่เป็น “:math:`\leq`”, “:math:`\geq`” และ “:math:`=`” อีกด้วย
vi: trong đó :math:`Q_i` là các ma trận :math:`n \times n`, :math:`A` là một ma trận :math:`m \times n`, :math:`x`, và :math:`c` là các vector :math:`n`-chiều, :math:`b` là một vector :math:`m`-chiều và trong đó :math:`x` có thể được định nghĩa là các biến nhị phân, số nguyên hoặc liên tục. Ngoài các ràng buộc “:math:`\leq`”,``QuadraticProgram`` cũng hỗ trợ “:math:`\geq`” và “:math:`=`”.

source: Loading a ``QuadraticProgram`` from an LP file
es_un: Cargar un ``QuadraticProgram`` desde un archivo LP
ja: LPファイルから ``QuadraticProgram`` をロードする
ko: LP(Linear Program) 파일에서 ``QuadraticProgram`` 불러오기
pt_un: Carregando um ``Quadratic Program`` a partir de um arquivo LP
th: การนำเข้า ``QuadraticProgram`` จากไฟล์ LP
vi: Tải ``QuadraticProgram`` từ một tệp LP

source: As setup, you need to import the following module.
bn_bn: সেটআপ হিসাবে, আপনাকে নিম্নলিখিত মডিউলটি আমদানি (ইম্পোর্ট) করতে হবে।
es_un: Como configuración, necesitas importar el siguiente módulo.
ja: セットアップとして、以下のモジュールをインポートする必要があります。
ko: 초기 설정을 위해, 다음과 같이 ``QuadraticProgram`` 모듈을 불러와야 한다.
pt_un: Como configuração, é necessário importar o seguinte módulo.
ta_in: அமைப்பாக, நீங்கள் பின்வரும் தொகுதியை இறக்குமதி செய்ய வேண்டும்.
th: ในการเริ่มใช้งานคุณจำเป็นต้องนำเข้าโมดูลดังต่อไปนี้
tr_tr: Kurulum olarak, aşağıdaki modülü içe aktarmanız gerekir.
vi: Khi thiết lập, bạn cần nhập các mô-đun sau.

source: You start with an empty model. How to add variables and constraints to a model is explained in the section `Directly constructing a QuadraticProgram <#Directly-constructing-a-QuadraticProgram>`__.
es_un: Comienzas con un modelo vacío. La forma de agregar variables y restricciones a un modelo se explica en la sección `Construir directamente un QuadraticProgram <#Directly-constructing-a-QuadraticProgram>`__.
ja: 空のモデルから始めます。モデルに変数と制約を追加する方法については、 `QuadraticProgram を直接構築する <#Directly-constructing-a-QuadraticProgram>`__ セクションで説明します。
ko: 빈 모델로 시작한다. 모델에 변수와 제약 조건을 추가하는 방법은 `QuadraticProgram 을 사용하여 직접 모델 구성하기 <#Directly-constructing-a-QuadraticProgram>`__ 섹션에 설명되어 있다.
pt_un: Você começa com um modelo vazio. Como adicionar variáveis e restrições a um modelo é explicado na seção “Construindo diretamente um ``QuadraticProgram``<#Directly-constructing-a-QuadraticProgram>"__.
th: ในตอนเริ่มต้นโมเดลของเราจะเป็นโมเดลเปล่า ในการเพิ่มตัวแปรและข้อจำกัดให้กับโมเดล สามารถทำได้ตามคำอธิบายในส่วน `การสร้าง QuadraticProgram โดยตรง <#Directly-constructing-a-QuadraticProgram>`__.
vi: Bạn sẽ bắt đầu với một mô hình rỗng. Phần tiếp theo, “Xây dựng một bài toán QuadraticProgram” <#Directly-constructing-a-QuadraticProgram>`__., sẽ giải thích cách thêm các biến và ràng buộc vào mô hình đó.

source: Qiskit’s optimization module supports the conversion from Docplex model. You can easily make a model of an optimization problem with Docplex. You can find the documentation of Docplex at https://ibmdecisionoptimization.github.io/docplex-doc/mp/index.html
bn_bn: Qiskit এর অনুকূলায়ক (অপ্টিমাইজেশন) মডিউল ডকপ্লেক্স নকশা ( মডেল) থেকে রূপান্তরকে সমর্থন করে। ডকপ্লেক্সের সাহায্যে আপনি খুব সহজেই একটি অনুকূলায়ক (অপ্টিমাইজেশান ) সমস্যার নকশা (মডেল) তৈরি করতে পারেন। আপনি ডকপ্লেক্সের ডকুমেন্টেশন https://ibmdecisionoptimization.github.io/docplex-doc/mp/index.html এ খুঁজে পেতে পারেন
es_un: El módulo de optimización de Qiskit soporta la conversión del modelo Docplex. Puedes crear fácilmente un modelo de un problema de optimización con Docplex. Puedes encontrar la documentación de Docplex en https://ibmdecisionoptimization.github.io/docplex-doc/mp/index.html
ja: Qiskitの最適化モジュールはDocplexモデルからの変換をサポートしています。Docplexで簡単に最適化問題のモデルを作成できます。 Docplex のドキュメントは https://ibmdecisonoptimization.github.io/docplex-doc/mp/index.html にあります。
ko: 키스킷의 최적화 모듈은 Docplex 모델과의 변환을 지원한다. Docplex를 활용하면 쉽게 최적화 문제의 모델을 생성할 수 있다. Docplex 문서는 여기 https://ibmdecisionoptimization.github.io/docplex-doc/mp/index.html 에서 찾을 수 있다.
pt_un: O módulo de otimização do Qiskit suporta a conversão de um modelo Docplex. Você pode facilmente fazer um modelo de um problema de otimização com o Docplex. Você pode encontrar a documentação do Docplex em https://ibmdecisionoptimization.github.io/docplex-doc/mp/index.html
ta_in: Qiskit's optimization தொகுதி Docplex மாதிரியிலிருந்து மாற்றுவதை ஆதரிக்கிறது. Docplex உடன் optimization சிக்கலின் மாதிரியை நீங்கள் எளிதாக உருவாக்கலாம். Docplex இன் ஆவணங்களை நீங்கள் https://ibmdecisionoptimization.github.io/docplex-doc/mp/index.html இல் காணலாம்
th: คุณสามารถสร้างโมเดลของโจทย์ปัญหา Optimization ได้ง่าย ๆ ด้วย Docplex และแปลงมาใข้งานใน Qiskit ได้ด้วยโมดูล Qiskit Optimization โดยคุณสามารถอ่านวิธีการใช้งาน Docplex ได้ที่ https://ibmdecisionoptimization.github.io/docplex-doc/mp/index.html
vi: Mô-đun tối ưu hóa của Qiskit hỗ trợ việc chuyển đổi từ mô hình của Docplex. Bạn có thể dễ dàng tạo ra một mô hình tối ưu hóa vấn đề với Docplex. Bạn có thể tìm tài liệu về Docplex tại https://ibmdecisionoptimization.github.io/docplex-doc/mp/index.html

source: You can load a Docplex model to ``QuadraticProgram`` by using ``from_docplex_mp`` function.
bn_bn: ``from_docplex`` ফাংশন ব্যবহার করে ``QuadraticProgram`` -এ একটা ডকপ্লেক্স মডেল লোড করা হয়।
es_un: Puedes cargar un modelo Docplex en ``QuadraticProgram`` utilizando la función ``from_docplex_mp``.
ja: ``from_docplex_mp`` 関数を呼び出すことで、Docplex モデルを ``QuadraticProgram`` に読み込むことができます。
ko: ``from_docplex_mp`` 함수를 이용하여 Docplex 모델을 ``QuadraticProgram`` 에 불러올 수 있다.
pt_un: Você pode carregar um modelo Docplex para ``QuadraticProgram`` invocando a função ``from_docplex``.
ta_in: நீங்கள் Docplex மாதிரியை ``QuadraticProgram`` க்கு ``from_docplex`` ஐ அழைப்பதன் மூலம் ஏற்றலாம்.
th: สามารถโหลดโมเดล Docplex มาเป็น ``QuadraticProgram`` ได้ด้วยฟังก์ชัน ``from_docplex_mp``
vi: Bạn có thể tải một mô hình Docplex vào ``QuadraticProgram`` bằng cách dùng hàm ``from_docplex_mp``.

source: Loading a ``QuadraticProgram`` from a docplex model
bn_bn: একটি ডকপ্লেক্স নকশা (মডেল) থেকে একটি ``Quadratic Program`` লোড করা
es_un: Carga de un ``QuadraticProgram`` desde un modelo docplex
ja: docplex モデルから ``QuadraticProgram`` をロードする
ko: Docplex 모델에서 ``QuadraticProgram`` 을 불러오기
pt_un: Carregando um ``QuadraticProgram`` a partir de um modelo docplex
ta_in: Docplex மாதிரியிலிருந்து ``QuadraticProgram`` ஐ ஏற்றுகிறது
th: การนำเข้า ``QuadraticProgram`` จากโมเดล docplex
vi: Tải một ``Lập trình bậc hai`` từ một mô hình docplex

source: ``QuadraticProgram`` has a method ``prettyprint`` to generate a comprehensive string representation.
es_un: ``QuadraticProgram`` tiene un método ``prettyprint`` para generar una representación completa de cadenas.
ja: ``QuadraticProgram`` には包括的な文字列表現を生成するための ``prettyprint`` メソッドがあります。
ko: ``QuadraticProgram`` 는 포괄적인 문자열 표현을 생성하는 ``prettyprint`` 메서드를 가지고 있다.
pt_un: ``QuadraticProgram`` tem um método ``prettyprint`` oara gerar um representação em forma de string compreensiva.
th: ``QuadraticProgram`` มี Method ``prettyprint`` ใช้ในการสร้างการแสดงผล String ด้วยรูปแบบที่เหมาะสม
vi: ``QuadraticProgram`` có phương pháp ``prettyprint`` để tạo chuỗi toàn diện.

source: Directly constructing a ``QuadraticProgram``
bn_bn: সরাসরি একটি ``QuadraticProgram`` তৈরি করা
es_un: Construir directamente un ``QuadraticProgram``
ja: ``QuadraticProgram`` の直接的な構築
ko: ``QuadraticProgram`` 을 사용하여 직접 모델 구성하기
pt_un: Construindo diretamente um ``QuadraticProgram``
ta_in: நேரடியாக ``குவாட்ராடிக் புரோகிராம்`` ஐ உருவாக்குகிறது
th: การสร้าง ``QuadraticProgram`` โดยตรง
tr_tr: Doğrudan ``QuadraticProgram`` oluşturulması
vi: Xây dựng trực tiếp một ``QuadraticProgram``

source: We then explain how to make model of an optimization problem directly using ``QuadraticProgram``. Let’s start from an empty model.
bn_bn: তারপরে আমরা কীভাবে সরাসরি ``QuadraticProgram`` ব্যবহার করে একটি অনুকূলায়ন (অপ্টিমাইজেশন) সমস্যাসমূহর নকশা (মডেল) তৈরি করব তা ব্যাখ্যা করবো। একটি খালি মডেল থেকে শুরু করা যাক।
es_un: A continuación, explicamos cómo hacer el modelo de un problema de optimización directamente utilizando ``QuadraticProgram``. Empecemos con un modelo vacío.
ja: 次に、``QuadraticProgram`` を使用して最適化問題のモデルを直接作成する方法を説明します。空のモデルから始めましょう。
ko: ``QuadraticProgram`` 을 사용하여 어떻게 최적화 문제의 모델을 직접 생성하는지 설명한다. 앞서 언급했듯이 비어 있는 모델에서 시작한다.
pt_un: Explicamos então como modelar um problema de otimização diretamente utilizando a ``QuadraticProgram``. Vamos começar a partir de um modelo vazio.
ta_in: ``QuadraticProgram`` ஐப் பயன்படுத்தி நேரடியாக ஒரு தேர்வுமுறை சிக்கலின் மாதிரியை எப்படி உருவாக்குவது என்பதை நாங்கள் விளக்குகிறோம். வெற்று மாதிரியில் இருந்து ஆரம்பிக்கலாம்.
th: ในส่วนนี้เป็นการอธิบายถึงวิธีการสร้างโมเดลของโจทย์ปัญหา Optimization โดยตรงด้วย ``QuadraticProgram`` เริ่มต้นด้วยการสร้างโมเดลเปล่า
tr_tr: Daha sonra doğrudan ``QuadraticProgram`` kullanarak bir optimizasyon probleminin modelinin nasıl yapıldığını açıklıyoruz. Boş bir modelden başlayalım.
vi: Tiếp theo chúng tôi sẽ giải thích cách tạo một mô hình của một vấn đề tối ưu hóa trực tiếp bằng cách dùng ``QuadraticProgram``. Hãy bắt đầu với một mô hình rỗng.

source: The ``QuadraticProgram`` supports three types of variables:
es_un: El ``QuadraticProgram`` admite tres tipos de variables:
ja: ``QuadraticProgram`` は、次の3種類の変数をサポートします。
ko: ``QuadraticProgram`` 은 세 가지 종류의 변수를 지원한다.
pt_un: O ``QuadraticProgram`` admite três tipos de variáveis:
ta_in: ``QuadraticProgram`` மூன்று வகையான மாறிகளை ஆதரிக்கிறது:
th: ``QuadraticProgram`` สามารถใช้งานได้กับตัวแปร 3 ประเภท
vi: ``QuadraticProgram`` hỗ trợ ba kiểu biến:

source: Binary variable
es_un: Variable binaria
ja: バイナリー変数
ko: 이진 변수
pt_un: Variável binária
ta_in: பைனரி மாறி
th: ตัวแปรไบนารี่
vi: Biến nhị phân

source: Integer variable
es_un: Variable entera
ja: 整数変数
ko: 정수 변수
pt_un: Variável inteira
ta_in: முழு எண் மாறி
th: ตัวแปรจำนวนเต็ม
vi: Biến số nguyên

source: Continuous variable
es_un: Variable continua
ja: 連続変数
ko: 연속형 변수
pt_un: Variável contínua
ta_in: தொடர்ச்சியான மாறி
th: ตัวแปรต่อเนื่อง
vi: Biến liên tục

source: When you add variables, you can specify names, types, lower bounds and upper bounds.
bn_bn: আপনি যখন চল রাশি (ভেরিয়েবল) যুক্ত করবেন, আপনি নাম, প্রকার, নিম্ন সীমা(আবদ্ধ ) এবং উপরের সীমা ((আবদ্ধ ) নির্দিষ্ট করতে পারেন।
es_un: Cuando agregas variables, puedes especificar nombres, tipos, límites inferiores y límites superiores.
ja: 変数を追加する際には、名前、タイプ、下限、上限を指定できます。
ko: 변수를 추가할 때, 변수의 이름, 변수의 종류, 하한(lower bound), 상한(upper bound)을 지정할 수 있다.
pt_un: Quando você adiciona variáveis, você pode especificar nomes, tipos, limites inferiores e limites superiores.
ta_in: நீங்கள் மாறிகள் சேர்க்கும் போது, ​​நீங்கள் பெயர்கள், வகைகள், குறைந்த எல்லைகள் மற்றும் மேல் எல்லைகளை குறிப்பிடலாம்.
th: เมื่อคุณเพิ่มตัวแปรเข้าไปในโมเดล คุณสามารถระบุชื่อ, ประเภท, ขอบเขตบน และ ขอบเขตล่างของตัวแปรได้
tr_tr: Değişkenler eklediğinizde adları, çeşitleri, alt sınırları ve üst sınırları belirtebilirsiniz.
vi: Khi thêm các biến, bạn có thể xác định tên, loại biến, giới hạn dưới và trên.

source: You can set the objective function by invoking ``QuadraticProgram.minimize`` or ``QuadraticProgram.maximize``. You can add a constant term as well as linear and quadratic objective function by specifying linear and quadratic terms with either list, matrix or dictionary.
bn_bn: আপনি ``QuadraticProgram.minimize`` বা ``QuadraticProgram.maximize``- দ্বারা নৈর্ব্যক্তিক অন্বয় (অব্জেক্টিভ ফাংশন) টি সেট করতে পারেন। আপনি তালিকা, ম্যাট্রিক্স বা অভিধানের সাথে লিনিয়ার এবং দ্বিঘাত (কোয়াড্রাটিক) পদগুলি নির্দিষ্ট করে একটি ধ্রুবক পদ পাশাপাশি লিনিয়ার এবং দ্বিঘাত (কোয়াড্রাটিক) নৈর্ব্যক্তিক অন্বয় (অব্জেক্টিভ ফাংশন) যুক্ত করতে পারেন।
es_un: Puedes establecer la función objetivo invocando ``QuadraticProgram.minimize`` o ``QuadraticProgram.maximize``. Puedes añadir un término constante, así como una función objetivo lineal y cuadrática, especificando términos lineales y cuadráticos con una lista, una matriz o un diccionario.
ja: ``QuadraticProgram.minimize`` または ``QuadraticProgram.maximize`` を呼び出すことにより、目的関数を設定できます。リスト、行列、または辞書のいずれかで線形項と2次項を指定することにより、定数項と線形および2次の目的関数を追加できます。
ko: ``QuadraticProgram.minimize`` 또는 ``QuadraticProgram.maximize`` 를 호출하여 목적함수를 설정할 수 있다. 리스트, 행렬, 혹은 딕셔너리 자료형을 사용해 선형 항과 이차 항을 지정함으로써 상수 항을 추가할 수 있을 뿐만 아니라 선형 목적함수와 이차 목적함수를 추가할 수 있다.
pt_un: Você pode configurar a função objetiva invocando ``QuadraticProgram.minimize`` ou ``QuadraticProgram.maximize``. Você pode adicionar um termo constante assim como uma função objetiva linear e quadrática especificando termos lineares e quadráticos usando uma lista, matriz ou dicionário.
ta_in: நீங்கள் ``QuadraticProgram.minimize`` அல்லது ``QuadraticProgram.maximize`` ஐ அழைப்பதன் மூலம் புறநிலை செயல்பாட்டை அமைக்கலாம். பட்டியல், அணி அல்லது அகராதி ஆகியவற்றுடன் நேரியல் மற்றும் இருபடி சொற்களைக் குறிப்பிடுவதன் மூலம் நீங்கள் ஒரு நிலையான காலத்தையும், நேரியல் மற்றும் இருபடி நோக்க செயல்பாட்டையும் சேர்க்கலாம்.
th: คุณสามารถกำหนดฟังก์ชันวัตถุประสงค์ได้โดยการเรียกใช้ ``QuadraticProgram.minimize`` หรือ ``QuadraticProgram.maximize`` และสามารถเพิ่มพจน์ที่เป็นฟังก์ชันวัตถุประสงค์แบบค่าคงที่, เส้นตรง และ กำลังสอง เข้าไปได้โดยการระบุ พจน์เส้นตรง และ กำลังสองในลักษณะของตัวแปรประเภท List, Matrix หรือ Dictionary
tr_tr: ``QuadraticProgram.minimize`` veya ``QuadraticProgram.maximize`` komutlarını çağırarak amaç fonksiyonunu ayarlayabilirsiniz. Liste, matris veya sözlük ile doğrusal ve ikinci dereceden terimler belirterek bir sabit terimin yanı sıra doğrusal ve ikinci dereceden amaç fonksiyonu ekleyebilirsiniz.
vi: Bạn có thể thiết lập hàm mục tiêu bằng cách gọi ``QuadraticProgram.minimize`` hoặc``QuadraticProgram.maximize``. Bạn có thể thêm một hằng số cũng như một số hạng tuyến tính và bậc hai bằng cách chỉ định các thuật ngữ tuyến tính và bậc hai với danh sách, ma trận hoặc từ điển.

source: Note that in the LP format the quadratic part has to be scaled by a factor :math:`1/2`. Thus, when printing as LP format, the quadratic part is first multiplied by 2 and then divided by 2 again.
bn_bn: টীকা: এল.পি বিন্যাসে দ্বিঘাত (কোয়াড্রাটিক) অংশটি একটি গুণক :math:`1/2` দ্বারা মাপতে হবে সুতরাং, এল.পি ফর্ম্যাট হিসাবে মুদ্রণের সময়, দ্বিঘাত (কোয়াড্রাটিক) অংশটি প্রথমে ২ দ্বারা গুণিত হয় এবং তারপরে আবার ২ দিয়ে বিভক্ত হয়।
es_un: Ten en cuenta que en el formato LP la parte cuadrática tiene que ser escalada por un factor de :math:`1/2`. Por lo tanto, cuando se imprime como formato LP, la parte cuadrática se multiplica primero por 2 y luego se divide entre 2 de nuevo.
ja: LP形式では、二次部分を :math:`1/2` 倍にスケーリングする必要があることに注意してください。したがって、LP形式で印刷する場合、二次部分は最初に2で乗算され、次に2で除算されます。
ko: LP 형식에 따라 이차 항은 스케일 팩터 :math:`1/2` 로 스케일링 되어야 한다는 점을 주의해야한다. 따라서 LP 형식에 따라 출력할 때, 이차 항에 먼저 2를 곱한 후 2로 나누게 된다.
pt_un: Observe que no formato LP a parte quadrática tem que ser escalonada por um fator :math:`1/2`. Assim, quando imprimindo no formato LP, a parte quadrática é primeiramente multiplicada por 2 e então dividida por 2 novamente.
ta_in: குறிப்பு LP வடிவத்தில் ஒரு காரணி :math:`1/2`. இவ்வாறு LP வடிவமாக அச்சிடும்போது, க்வாட்ரேட்டிக் பகுதி முதன் முதலில் 2 ஆக பிரிக்கப்பட்டு பின்னர் மீண்டும் 2 பிரிக்கப்பட்டுள்ளது.
th: หมายเหตุ รูปแบบของ LP ในส่วนกำลังสองจะต้องหารด้วยค่าเศษส่วน :math:`1/2` เพื่อให้ได้มีตัวคูณของเป็นของพจน์กำลังสองเป็น 1 เนื่องจากส่วนกำลังสองในสมการวัตถุประสงค์จะมีการหารด้วย 2
tr_tr: LP biçimde ikinci dereceden bir bölümün :math:`1/2` faktör olarak ölçeklendirilmesi gerektiğini unutmayın. Bu yüzden, LP biçiminde yazdırırken ikinci dereceden olan kısım ilk olarak 2 ile çarpılır ve sonra 2'ye bölünmelidir.
vi: Lưu ý rằng trong định dạng LP, phần bậc hai phải được tỉ lệ với một hệ số :math:`1/2`. Do đó, khi in trong định dạng LP, đầu tiên phần bậc hai được nhân với 2 và sau đó chia cho 2 lần nữa.
