Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/01_quadratic_program.po
Languages: bn_bn, es_un, ja, ko, pt_un, ta_in, th, tr_tr, vi

source: If the resulting problem is infeasible due to lower bounds or upper bounds, the methods returns the status ``Status.INFEASIBLE``. We try to replace variable ``x`` with -1, but -1 is out of range of ``x`` (0 <= ``x`` <= 1). So, it returns ``Status.INFEASIBLE``.
bn_bn: নিম্ন সীমা বা উপরের সীমাগুলির কারণে যদি ফলস্বরূপ সমস্যাটি অক্ষম হয় তবে পদ্ধতিগুলি স্ট্যাটাস ``Status.INFEASIBLE`` কে ফিরিয়ে দেয়। আমরা চল রাশি `` x`` কে -1 এর সাথে প্রতিস্থাপন করার চেষ্টা করি, তবে -1 `` x`` (0 <= `` x`` <= 1) এর সীমার বাইরে। সুতরাং, এটি ``Status.INFEASIBLE`` ফিরিয়ে দেয়।
es_un: Si el problema resultante es inviable debido a los límites inferiores o superiores, los métodos devuelven el estado ``Status.INFEASIBLE``. Intentamos reemplazar la variable ``x`` por -1, pero -1 está fuera del rango de ``x`` (0 <= ``x`` <= 1). Por lo tanto, se devuelve ``Status.INFEASIBLE``.
ja: 結果として生じる問題が下限または上限のために実行不可能である場合、メソッドはステータス ``Status.INFEASIBLE`` を返します。変数 ``x`` を -1 に置き換えようとしましたが、-1 は ``x`` (0 <= ``x`` <= 1)の範囲外です。したがって、 ``Status.INFEASIBLE`` を返します。
ko: 상한 혹은 하한값을 벗어난 경우 ``Status.INFEASIBLE`` 메시지가 생성된다. 아래 예제에서 변수 ``x`` 에 -1을 대입하고 있지만, -1 은 ``x`` 의 범위 (0 <= ``x`` <= 1) 를 벗어나기 때문에 ``Status.INFEASIBLE`` 메시지가 출력된다.
pt_un: Se o problema resultante for inviável devido a limites inferiores ou limites superiores, os métodos retornam o status ``Status.INFEASIBLE``. Nós tentamos substituir a variável ``x``, por -1, mas -1 está fora do intervalo de ``x`` (0 <= ``x`` <= 1). Assim, ele retorna ``Status.INFEASIBLE``.
ta_in: குறைந்த வரம்புகள் அல்லது மேல் வரம்புகள் காரணமாக விளைந்த சிக்கல் அணுக முடியாததாக இருந்தால், முறைகள் `` Status. INFEASIBLE`` என்ற நிலையை அளிக்கிறது. மாறி `` x`` ஐ -1 உடன் மாற்ற முயற்சிக்கிறோம், ஆனால் -1 என்பது `` x`` (0 <= `` x`` <= 1) வரம்பிற்கு வெளியே உள்ளது. எனவே, இது `` Status.INFEASIBLE`` ஐ வழங்குகிறது.
th: ถ้าคำตอบของโจทย์ปัญหานั้นเป็นคำตอบที่เป็นไปไม่ได้เนื่องจากขอบเขตล่าง หรือขอบเขตบน ผลลัพธ์จะส่งค่า Status ``Status.INFEASIBLE`` เช่นการที่เราพยายามกำหนดค่า ``x`` เป็น -1 แต่ค่า -1 นั้นมีค่าที่อยู่นอกขอบเขตของ ``x`` (0 <= ``x`` <= 1) จะได้ผลลลัพธ์ออกมาเป็น ``Status.INFEASIBLE``
tr_tr: Ortaya çıkan sorun, alt veya üst sınırlar nedeniyle mümkün değilse, yöntemler ``Status.INFEASIBLE`` durumunu döndürür. ``x`` değişkenini -1 ile değiştirmeye çalışıyoruz fakat -1, ``x`` in aralığının dışında (0 <= ``x`` <= 1). Bu yüzden, ``Status.INFEASIBLE`` durumunu döndürür.
vi: Nếu kết quả không khả thi do các giới hạn dưới hoặc giới hạn trên, các phương thức trả về trạng thái ``Status.INFEASIBLE``. Chúng ta cố gắng thay thế biến ``x`` bằng -1, nhưng -1 nằm ngoài giới hạn của ``x`` (0 <= ``x`` <= 1). Vì vậy, kết quả trả về là ``Status.INFEASIBLE``.

source: You cannot substitute variables multiple times. The method raises an error in such a case.
bn_bn: আপনি একাধিক বার চল রাশি প্রতিস্থাপন করতে পারবেন না। এই ক্ষেত্রে এটি ত্রুটি উত্থাপন করে।
es_un: No puedes sustituir variables varias veces. El método devuelve un error en tal caso.
ja: 変数を複数回置換することはできません。メソッドはそのような場合にエラーを発生させます。
ko: 한 번 대체한 변수는 중복하여 대체할 수 없다. 이와 같은 경우 아래와 같이 오류메시지를 생성한다.
pt_un: Não é possível substituir variáveis várias vezes. O método retorna um erro nesse caso.
ta_in: நீங்கள் மாறிகளை பல முறை மாற்றீடு செய்ய முடியாது. அத்தகைய வகையில் முறைமையில் ஒரு பிழையை எழுப்புகிறது.
th: Method จะทำการแจ้งเตือนข้อผิดพลาดในกรณีที่คุณระบุการแทนที่ตัวแปรซ้ำหลายครั้งในการเรียกครั้งเดียว
tr_tr: Değişkenleri birden çok kez değiştiremezsiniz. Bu yöntem böyle bir durumda hata verir.
vi: Bạn không thể thế thế các biến nhiều lần. Hàm sẽ báo lỗi trong trường hợp đó.

source: Note: When you display your problem as LP format using ``export_as_lp_string``, ``Binaries`` denotes binary variables and ``Generals`` denotes integer variables. If variables are not included in either ``Binaries`` or ``Generals``, such variables are continuous ones with default lower bound = 0 and upper bound = infinity. Note that you cannot use ‘e’ or ‘E’ as the first character of names due to the `specification of LP format <https://www.ibm.com/docs/en/icos/22.1.0?topic=representation-variable-names-in-lp-file-format>`__.
es_un: Nota: Cuando muestras tu problema en formato LP usando ``export_as_lp_string``, ``Binaries`` denota variables binarias y ``Generals`` denota variables enteras. Si las variables no están incluidas en ``Binaries`` o ``Generals``, dichas variables son continuas con el límite inferior predeterminado = 0 y el límite superior = infinito. Ten en cuenta que no puedes utilizar ‘e’ o ‘E’ como el primer carácter de los nombres debido a la `especificación del formato LP <https://www.ibm.com/docs/en/icos/22.1.0?topic=representation-variable-names-in-lp-file-format>`__.
ja: ``export_as_lp_string`` を使って問題をLP形式で表示する場合、``Binaries`` はバイナリー変数を、``Generals`` は整数変数を表します。 変数が ``Binaries`` または ``Generals`` に含まれていない場合、 このような変数は、デフォルトの lower bound = 0、upper bound = infinity を持つ連続変数です。 `LPフォーマットの規定 <https://www.ibm.com/docs/en/icos/22.1.0?topic=representation-variable-names-in-lp-file-format>`__ により、名前の最初の文字として ‘e’ または ‘E’ を使用することはできませんのでご注意ください。
ko: 참고: ``export_as_lp_string`` 를 이용하여 문제를 LP 형식으로 나타낼 때, ``Binaries`` 는 이진 변수를 의미히고, ``Generals`` 은 정수 변수를 의미한다. 변수가 ``Binaries`` 또는 ``Generals`` 에 모두 포함되지 않는다면, 그러한 변수는 기본값으로 하한 = 0 및 상한 = 무한대를 갖는 연속 변수다. `LP 형식의 명세서 <https://www.ibm.com/docs/en/icos/22.1.0?topic=representation-variable-names-in-lp-file-format>`__ 에 따르면 ‘e’ 또는 ‘E’는 이름의 첫 글자로 사용할 수 없음을 유의하라.
pt_un: Nota: Ao visualizar o seu problema como formato LP usando ``export_as_lp_string``, ``Binaries`` denota variáveis binárias e ``Generals`` denota variáveis inteiras. Se as variáveis não estiverem incluídas em ``Binaries`` nem ``Generals``, tais variáveis são contínuas com limite inferior = 0 e limite superior = infinity por padrão. Observe que não podemos usar ‘e’ ou ‘E’ como o primeiro caractere de nomes devido à `especificação do formato LP <https://www.ibm.com/support/knowledgecenter/SSSA5P_12.7.1/ilog.odms.cplex.help/CPLEX/FileFormats/topics/LP_VariableNames.html>`__.
th: เมื่อคุณแสดงโจทย์ปัญหาของคุณในรูปแบบ LP ด้วย ``export_as_lp_string`` ในผลลัพธ์ ``Binaries`` คือตัวแปรไบนารี่ และ ``Generals`` คือตัวแปรจำนวนเต็ม ถ้าตัวแปรไม่ใช่ทั้ง ``Binaries`` หรือ ``Generals`` หมายความว่าเป็นตัวแปรต่อเนื่องที่มีขอบเขตล่างเป็น 0 และ ขอบเขตบนเป็นอนันต์ หมายเหตุ คุณไม่สามารถใช้ ‘e’ หรือ ‘E’ เป็นตัวอักษรแรกในชื่อได้ เนื่องจาก `ข้อกำหนดรูปแบบไฟล์ LP <https://www.ibm.com/support/knowledgecenter/SSSA5P_12.7.1/ilog.odms.cplex.help/CPLEX/FileFormats/topics/LP_VariableNames.html>`__
vi: Lưu ý: Khi hiển thị vấn đề của bạn dưới định dạng LP qua ``export_as_lp_string``, ``Binaries`` biểu thị biến nhị phân và ``Generals`` biểu thị biến số nguyên. Nếu các biến không được bao gồm trong``Binaries`` or ``Generals``, các biến đó sẽ là các biến liên tục có mặc định chặn dưới = 0 và chặn trên = vô hạn. Lưu ý rằng bạn không thể sử dụng 'e' hoặc' E' là ký tự đầu tiên của tên do định dạng LP <https://www.ibm.com/docs/en/icos/22.1.0?topic=representation-variable-names-in-lp-file-format>`__.

source: where the :math:`Q_i` are :math:`n \times n` matrices, :math:`A` is a :math:`m \times n` matrix , :math:`x`, and :math:`c` are :math:`n`-dimensional vectors, :math:`b` is an :math:`m`-dimensional vector, and where :math:`x` can defined as binary, integer, or continuous variables. In addition to “:math:`\leq`” constraints ‘QuadraticProgram’ also supports “:math:`\geq`” and “:math:`=`”.
bn_bn: যেখানে :math:`Q_i` হ'ল: :math:`n \times n` ম্যাট্রিক্স, :math:`A` একটি :math:`m \times n` ম্যাট্রিক্স,: :math:`x`, , এবং: :math:`c` হ'ল: :math:`n`-মাত্রিক ভেক্টর,: :math:`b` একটি :math:`m`-ডাইমেনশনাল ভেক্টর এবং যেখানে :math:`x` বাইনারি, পূর্ণসংখ্যা বা অবিচ্ছিন্ন ভেরিয়েবল হিসাবে সংজ্ঞায়িত করতে পারে । “:math:`\leq`” ছাড়াও ‘QuadraticProgram’ “:math:`\geq`” এবং “:math:`=`” সমর্থন করে।
tr_tr: :math:`Q_i` nın :math:`n \times n` matrisleri olduğu yerde, :math:`A` , :math:`m \times n` matrisidir ve :math:`x` nin ikili (binary), tam sayı (integer) ya da sürekli değişken olarak tanımlanabildiği yerde :math:`x`, ve :math:`c` , :math:`n` boyutlu vektörlerdir, :math:`b` , :math:`m` boyutlu vektördür. 'QuadraticProgram' ı kısıtayan ":math:`\leq`" ne ek olarak ":math:`\geq`" ve ":math:`=`" de desteklenir.

source: Loading a ``Quadratic Program`` from an LP file
bn_bn: একটি এল.পি (LP) ফাইল থেকে একটি ``Quadratic Program`` লোড করা
tr_tr: LP dosyasından ``Quadratic Program`` yüklenmesi

source: You start with an empty model. How to add variables and constraints to a model is explained in the section “Directly constructing a ``QuadraticProgram``”.
bn_bn: আপনি একটি খালি নকশা ( মডেল ) দিয়ে শুরু করুন। কোনও নকশায় চলরাশি (ভেরিয়েবল) এবং সীমাবদ্ধতা (কন্সট্রেইন্টস ) কীভাবে যুক্ত করবেন সে সম্পর্কে "সরাসরি একটি ``QuadraticProgram` তৈরি " বিভাগে ব্যাখ্যা করা হয়েছে।

source: The ``QuadraticProgram`` supports three types of variables: - Binary variable - Integer variable - Continuous variable
bn_bn: ``QuadraticProgram`` তিন ধরণের চল রাশি ( ভেরিয়েবল) সমর্থন করে: - বাইনারি ভেরিয়েবল - পূর্ণসংখ্যার ভেরিয়েবল - অবিচ্ছিন্ন ভেরিয়েবল
tr_tr: ``QuadraticProgram`` üç değişken tipini destekler: - İkili değişken - Tamsayı değişkeni - Sürekli değişken

source: When you display your problem as LP format, ``Binaries`` denotes binary variables and ``Generals`` denotes integer variables. If variables are not included in either ``Binaries`` or ``Generals``, such variables are continuous ones with default lower bound = 0 and upper bound = infinity. Note that you cannot use ‘e’ or ‘E’ as the first character of names due to the `specification of LP format <https://www.ibm.com/support/knowledgecenter/SSSA5P_12.7.1/ilog.odms.cplex.help/CPLEX/FileFormats/topics/LP_VariableNames.html>`__.
bn_bn: আপনি যখন এল.পি ফর্ম্যাট হিসাবে আপনার সমস্যাটি প্রদর্শন করেন, তখন ``Binaries`` বাইনারি চল রাশি (ভেরিয়েবল) গুলি এবং` ``Generals`` পূর্ণ সংখ্যা (ইন্টিজার) চল রাশি(ভেরিয়েবল) কে চিহ্নিত করে। যদি চল রাশিগুলি ``Binaries`` বা ``Generals`` - এর মধ্যে অন্তর্ভুক্ত না করা হয়, তবে এই ধরণের পরিবর্তনগুলি অবিচ্ছিন্নভাবে ডিফল্ট লোয়ার সীমানা (বাউন্ড) = 0 এবং উপরের সীমানা (বাউন্ড)= অসীম থাকে। মনে রাখবেন যে এল.পি ফর্ম্যাটের নির্দিষ্টকরণের কারণে আপনি নামের প্রথম অক্ষর হিসাবে ‘e’ বা ‘E’ ব্যবহার করতে পারবেন না।
tr_tr: Probleminizi LP formatında görüntülediğinizde, ``Binaries`` ikili değişkenleri, ``Generals`` ise tamsayı değişkenlerini belirtir. Değişkenler ``Binaries`` veya ``Generals`` içinde yer almıyorsa, bu tür değişkenler, varsayılan alt sınır = 0 ve üst sınır = sonsuz olan sürekli değişkenlerdir. `specification of LP format <https://www.ibm.com/support/knowledgecenter/SSSA5P_12.7.1/ilog.odms.cplex.help/CPLEX/FileFormats/topics/LP_VariableNames.html>`__ nedeniyle adların ilk karakteri olarak ‘e’ veya ‘E’ kullanamayacağınızı unutmayın.

source: Another way to specify the quadratic program is using arrays. For the linear term, the array corresponds to the vector :math:`c` in the mathematical formulation. For the quadratic term, the array corresponds to the matrix :math:`Q`. Note that the ordering of the variables (:math:`x` in the mathematical formulation) is the order in which the variables were originally declared in the QuadraticProgram object.
bn_bn: দ্বিঘাত (কোয়াড্রাটিক) প্রোগ্রাম নির্দিষ্ট করার আরেকটি উপায় হ'ল অ্যারে (array) ব্যবহার করা। রৈখিক (লিনিয়ার) পদের জন্য অ্যারে - টি ` :math:`c` এর সাথে গাণিতিক গঠনের সাথে মিলে যায়। দ্বিঘাত (কোয়াড্রাটিক) পদটির জন্য অ্যারে-টি ম্যাট্রিক্স :math:`Q` এর সাথে মিলে যায়। টীকা: যে চল রাশি (ভেরিয়েবল)-র ক্রম (:math:`x` গাণিতিক গঠনের ক্ষেত্রে) হ'ল ক্রমটি যেখানে চল রাশি (ভেরিয়েবল) গুলি মূলত QuadraticProgram অবজেক্টে ঘোষিত হয়েছিল।
tr_tr: Karesel programı belirlemenin başka bir yolu dizileri kullanmaktadır. Doğrusal terim için dizi, matematiksel formülasyonda vektör :math:`c` ye karşılık gelir. Karesel terim için dizi, :math:`Q` matrisine karşılık gelir. Değişkenlerin sırasının (matematiksel formülasyondaki :math:`x`), değişkenlerin QuadraticProgram nesnesinde ilk olarak bildirilmiş olduğu sıralama olduğunu unutmayın.

source: You can substitute some of variables with constants or other variables. More precisely, ``QuadraticProgram`` has a method ``substitute_variables(constants=..., variables=...)`` to deal with the following two cases. - :math:`x \leftarrow c`: when ``constants`` have a dictionary ``{x: c}``. - :math:`x \leftarrow c y`: when ``variables`` have a dictionary ``{x: (y, c)}``.
bn_bn: ধ্রুবক বা অন্যান্য চল রাশিগুলির সাথে আপনি কয়েকটি চল রাশির বিকল্প করতে পারেন। আরও স্পষ্টভাবে, নিম্নোক্ত দুটি ক্ষেত্রে মোকাবেলা করার জন্য ``QuadraticProgram`` এর ``substitute_variables(constants=..., variables=...)`` নামে একটি পদ্ধতি রয়েছে : :math:`x \leftarrow c`: যখন ``constants`` এর একটি ``{x: c}`` ডিকশনারি থাকে এবং - :math:`x \leftarrow c y`: যখন ``variables`` এর একটি ``{x: (y, c)}`` ডিকশনারি থাকে ডিকশনারি থাকে।
tr_tr: Bazı değişkenleri sabitler veya diğer değişkenlerle değiştirebilirsiniz. Daha doğrusu, ``QuadraticProgram``, aşağıdaki iki durumla başa çıkmak için ``substitute_variables(constants=..., variables=...)`` yöntemine sahiptir. - :math:`x \leftarrow c`: ``constants`` bir ``{x: c}`` sözlüğü olduğunda. - :math:`x \leftarrow c y`: ``variables`` ``{x: (y, c)}`` sözlüğüne sahip olduğunda.
