Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/02_converters_for_quadratic_programs.po
Languages: bn_bn, es_un, it_it, ja, ko, ta_in, te, th, tr_tr, vi_vn

source: ``LinearEqualityToPenalty`` converts linear equality constraints into additional quadratic penalty terms of the objective function to map ``QuadraticProgram`` to an unconstrained form. An input to the converter has to be a ``QuadraticProgram`` with only linear equality constraints. Those equality constraints, e.g. \ :math:`\sum_i a_i x_i = b` where :math:`a_i` and :math:`b` are numbers and :math:`x_i` is a variable, will be added to the objective function in the form of :math:`M(b - \sum_i a_i x_i)^2` where :math:`M` is a large number as penalty factor. By default :math:`M= 1e5`. The sign of the term depends on whether the problem type is a maximization or minimization.
bn_bn: ``LinearEqualityToPenalty``, ``QuadraticProgram`` কে একটি অনিয়ন্ত্রিত আকারে ম্যাপ করার উদ্দেশ্যে রৈখিক সমতার সীমাবদ্ধতাকে নৈর্ব্যক্তিক অন্বয় (অব্জেক্টিভ ফাংশন) এর অতিরিক্ত দ্বিঘাত (কোয়াড্রাটিক) শর্তে রূপান্তরিত করে। পরিবর্তক (কনভার্টার) একটি ইনপুট কেবল রৈখিক সমতার সীমাবদ্ধতার সাথে একটি ``QuadraticProgram`` হতে হবে। এই সাম্যতার সীমাবদ্ধতা, যেমন: \ :math:`\sum_i a_i x_i = b` যেখানে e :math:`a_i` এবং :math:`b` সংখ্যা এবং :math:`x_i` , একটি ভেরিয়েবল, :math:`M(b - \sum_i a_i x_i)^2` এর আকারে নৈর্ব্যক্তিক অন্বয় (অব্জেক্টিভ ফাংশন) এর সাথে যুক্ত হবে , যেখানে :math:`M` পেনাল্টি ফ্যাক্টর হিসাবে একটি বিশাল সংখ্যা। ডিফল্টরূপে :math:`M= 1e5` শব্দটির চিহ্নটি সমস্যার ধরণটি সর্বাধিককরণ বা হ্রাসকরণের উপর নির্ভর করে।
it_it: ``LinearEqualityToPenalty`` converte vincoli di uguaglianza lineare in ulteriori termini di penalità quadratica della funzione obiettivo per mappare ``QuadraticProgram`` in una forma non vincolata. Un input al convertitore deve essere un ``QuadraticProgram`` con soli vincoli di uguaglianza lineari. Questi vincoli di uguaglianza, ad esempio \ :math:`\sum_i a_i x_i = b` dove :math:`a_i` e :math:`b` sono numeri e :math:`x_i` è una variabile, saranno aggiunti alla funzione obiettivo nella forma di :math:`M(b - \sum_i a_i x_i)^2` dove :math:`M` è un numero elevato come fattore di penalità. Per default :math:`M= 1e5`. Il segno del termine dipende da se il tipo di problema è una massimizzazione o una minimizzazione.
tr_tr: ``LinearEqualityToPenalty`` ``QuadraticProgram`` ı kısıtsız bir form ile eşlemek için doğrusal eşitlik kısıtlamalarını, amaç fonksiyonunun ek ikinci dereceden ceza terimlerine dönüştürür. Dönüştürücü girdisi sadece doğrusal eşitlik kısıtlamaları ile bir ``QuadraticProgram`` olmalıdır. Şu eşitlik kısıtlamaları, örneğin :math:`a_i` ve :math:`b` nin sayı ve :math:`x_i` nin değişken olduğu durumdaki :math:`\sum_i a_i x_i = b` , :math:`M` nin ceza faktörü olarak büyük bir sayı olduğu yerde amaç fonksiyonuna :math:`M(b - \sum_i a_i x_i)^2` biçiminde eklenecektir. Varsayılan olarak :math:`M= 1e5`. Terimin işareti, problem türünün çoklama ya da azlama olmasına bağlıdır.
vi_vn: ``LinearEqualityToPenalty`` chuyển đổi các ràng buộc đẳng thức tuyến tính thành các số hạng phạt bậc hai bổ sung của hàm mục tiêu để ánh xạ ``QuadraticProgram`` thành một dạng không bị ràng buộc. Đầu vào cho bộ chuyển đổi phải là ``QuadraticProgram`` chỉ với các ràng buộc đẳng thức tuyến tính. Những ràng buộc đẳng thức đó, ví dụ: \ :math:`\sum_i a_i x_i = b` trong đó :math:`a_i` và :math:`b` là các số và :math:`x_i` là một biến, sẽ được thêm vào hàm mục tiêu dưới dạng :math:`M (b - \ sum_i a_i x_i)^2` trong đó :math:`M` là một số lớn như hệ số hình phạt. Theo mặc định :math:`M = 1e5`. Dấu của số hạng phụ thuộc vào dạng vấn đề là tối đa hoá hay tối thiểu hoá.

source: We use the output of ``IntegerToBinary`` as starting point, where all variables are binary variables and all inequality constraints have been mapped to equality constraints. We print the problem again for reference.
bn_bn: আমরা ``IntegerToBinary`` এর আউটপুটটিকে প্রারম্ভিক পয়েন্ট হিসাবে ব্যবহার করি, যেখানে সমস্ত চলরাশিগুলি বাইনারি চল রাশি এবং সমস্ত অসমতার সীমাবদ্ধতাগুলিকে সাম্যতার সীমাবদ্ধতায় ম্যাপ করা হয়েছে। আমরা আবার সমস্যাটি print করব এর রেফারেন্স এর জন্য।
it_it: Utilizziamo l'output di ``IntegerToBinary`` come punto di partenza, dove tutte le variabili sono binarie e con vincoli di disuguaglianza mappati ai vincoli di uguaglianza. Stampiamo di nuovo il problema per riferimento.
tr_tr: Bütün değişkenlerin ikili sistem değişkenleri olduğu ve bütün eşitsizlik kısıtlamalarının eşitlik kısıtlamalarına eşlendiği yerde başlangıç noktası olarak ``IntegerToBinary`` dönüştürücüsünün çıktısını kullanıyoruz. Kaynak olması için problemi tekrar yazdırıyoruz.
vi_vn: Chúng ta sử dụng đầu ra của ``IntegerToBinary`` làm điểm bắt đầu, trong đó tất cả các biến đều là biến nhị phân và tất cả các ràng buộc bất đẳng thức đã được ánh xạ thành các ràng buộc đẳng thức. Chúng ta in lại bài toán để tham khảo.

source: Run interactively in jupyter notebook.
it_it: Esegui in maniera interattiva su un jupyter notebook.
