Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/02_converters_for_quadratic_programs.po
Languages: bn_bn, es_un, it_it, ja, ko, ta_in, te, th, tr_tr, vi_vn

source: Let us explain how the conversion works. For example, the lower bound of the left side of the first constraint is :math:`0` which is the case of :math:`x=0`, :math:`y=0`, and :math:`z=0`. Thus, the upper bound of the additional integer variable must be :math:`5` to be able to satisfy even the case of :math:`x=0`, :math:`y=0`, and :math:`z=0`. Note that we cut off the part after the decimal point in the converted formulation since the left side of the first constraint in the original formulation can be only integer values. For the second constraint, basically we apply the same approach. However, the symbol in the second constraint is :math:`\geq`, so we add minus before :math:`xyz\_geq\text{@}int\_slack` to be able to satisfy even the case of :math:`x=1, y=1`, and :math:`z=7`.
es_un: Expliquemos cómo funciona la conversión. Por ejemplo, el límite inferior del lado izquierdo de la primera restricción es :math:`0` que es el caso de :math:`x=0`, :math:`y=0`, y :math:`z=0`. Por lo tanto, el límite superior de la variable entera adicional debe ser :math:`5` para poder satisfacer incluso el caso de :math:`x=0`, :math:`y=0`, y :math:`z=0`. Ten en cuenta que cortamos la parte después del punto decimal en la formulación convertida, ya que el lado izquierdo de la primera restricción en la formulación original puede ser solo valores enteros. Para la segunda restricción, básicamente aplicamos el mismo enfoque. Sin embargo, el símbolo en la segunda restricción es :math:`\geq`, por lo que agregamos un signo menos antes de :math:`xyz\_geq\text{@}int\_slack` para poder satisfacer incluso el caso de :math:`x=1, y=1`, y :math:`z=7`.
ja: 変換がどのように機能するかを説明しましょう。 たとえば、最初の制約の左側の下限は :math:`0` です。これは、 :math:`x=0` 、 :math:`y=0` 、および :math:`z=0` の場合です。 したがって、追加の整数変数の上限は、 :math:`x=0` 、 :math:`y=0` 、および :math:`z=0` の場合でも満たすことができるように :math:`5` でなければなりません。 元の定式化の最初の制約の左側は整数値のみである可能性があるため、変換された定式化では小数点以下の部分を切り取ることに注意してください。 2番目の制約については、基本的に同じアプローチを適用します。 ただし、2番目の制約の記号は :math:`\geq` であるため、:math:`x=1, y=1` 、 :math:`z=7` の場合でも満たすことができるように、 :math:`xyz\_geq\text{@}int\_slack` の前にマイナスを追加します。
ko: 변환이 어떻게 작동하는지에 대한 설명이다. 예를 들어, 좌변 첫 번째 제약 조건의 하한은 :math:`0`이며, 이는 :math:`x=0`, :math:`y=0`, :math:`z=0` 의 경우이다. 따라서 추가된 변수의 상한이 :math:`5` 가 되어야 :math:`x=0`, :math:`y=0`, :math:`z=0` 의 경우도 만족할 수 있다. 원래 공식에서 좌변 첫 번째 제약 조건은 정수 값만 될 수 있기 때문에, 변환된 공식에서 소수점 이후 부분은 잘라낸다. 두 번째 제약 조건에 대해서도 기본적으로 동일한 접근 방식을 적용한다. 그러나 두 번째 제약 조건의 기호는 :math:`\geq` 이므로 :math:`xyz\_geq\text{@}int\_slack` 앞에 마이너스 부호를 추가하여 :math:`x=1, y=1`, :math:`z=7` 의 경우에도 만족시킬 수 있다.
ta_in: மாற்றம் எவ்வாறு செயல்படுகிறது என்பதை விளக்குகிறோம். எடுத்துக்காட்டாக, முதல் கட்டுப்பாட்டின் இடது பக்கத்தின் கீழ் எல்லை ஆனது :math:`0` ஆகும், அதாவது :math:`x=0`, :math:`y=0`, மற்றும் :math:`z =0` என்பதாகும். எனவே, கூடுதல் முழு எண் மாறியின் மேல் வரம்பு :math:`5` ஆக இருக்க வேண்டும், அது மட்டுமல்லாமல் :math:`x=0`, :math:`y=0`, மற்றும் :math:`z=0` திருப்திப் படுத்தவேண்டும். மாற்றப்பட்ட ஃபார்முலேஷனில் உள்ள தசமப் புள்ளிக்குப் பிறகு, அசல் ஃபார்முலேஷனில் முதல் கட்டுப்பாட்டின் இடது பக்கம் முழு எண் மதிப்புகளாக மட்டுமே இருக்க முடியும் என்பதை நினைவில் கொள்க. இரண்டாவது கட்டுப்பாட்டுக்கு, அடிப்படையில் நாம் அதே அணுகுமுறையைப் பயன்படுத்துகிறோம். இருப்பினும், இரண்டாவது தடையில் உள்ள சின்னம் :math:`\geq` ஆகும், எனவே :math:`x=1, y=1`, and :math:`z=7` ஐக் கூட திருப்திபடுத்தும் வகையில் :math:`xyz\_geq\text{@}int\_slack` க்கு முன் மைனஸைச் சேர்க்கிறோம்.
th: หลักการทำงานในการแปลงคือ ตัวอย่างเช่นเมื่อขอบเขตล่างของพจน์ซ้ายของสมการข้อจำกัดแรกเป็น :math:`0` ซึ่งคือกรณีที่ :math:`x=0`, :math:`y=0` และ :math:`z=0` ขอบเขตบนของตัวแปรจำนวนเต็มเพิ่มเติมจะต้องมีค่าเป็น :math:`5` เพื่อให้กรณี :math:`x=0`, :math:`y=0` และ :math:`z=0` เป็นจริง หมายเหตุ เราสามารถตัดส่วนทศนิยมออกได้ในสมการที่แปลงมาแล้ว เนื่องจากพจน์ซ้ายของสมการข้อจำกัดแรกของสมการเดิมสามารถเป็นจำนวนเต็มได้เท่านั้น สำหรับสมการข้อจำกัดที่สองโดยปกติเราสามารถใช้วิธีการเดียวกันได้ อย่างไรก็ตามสัญลักษณ์ในสมการข้อจำกัดที่สองคือ :math:`\geq` ดังนั้นเราจะต้องเพิ่มเครื่องหมายลบไว้ก่อน :math:`xyz\_geq\text{@}int\_slack` เพื่อให้สมการเป็นจริงในกรณี :math:`x=1, y=1` และ :math:`z=7`

source: ``IntegerToBinary`` converts integer variables into binary variables and coefficients to remove integer variables from ``QuadraticProgram``. For converting, bounded-coefficient encoding proposed in `arxiv:1706.01945 <https://arxiv.org/abs/1706.01945>`__ (Eq. (5)) is used. For more detail of the encoding method, please see the paper.
bn_bn: ``IntegerToBinary`` পূর্ণসংখ্যার চল রাশিগুলিকে বাইনারি চল রাশি এবং সহগগুলিকে ``QuadraticProgram`` থেকে পূর্ণসংখ্য ভেরিয়েবলগুলি সরাতে রূপান্তর করে। রূপান্তর করার জন্য, প্রস্তাবিত সীমাবদ্ধ-গুণফলের এনকোডিং `arxiv:1706.01945 <https://arxiv.org/abs/1706.01945>`__ (Eq. (5)) ব্যবহৃত হয়। এনকোডিং পদ্ধতির আরও বিশদের জন্য দয়া করে গবেষণাটি দেখুন।
es_un: ``IntegerToBinary`` convierte variables enteras en variables binarias y coeficientes para eliminar las variables enteras del ``QuadraticProgram``. Para convertir, se usa la codificación de coeficiente acotado propuesta en `arxiv:1706.01945 <https://arxiv.org/abs/1706.01945>`__ (Eq. (5)). Para obtener más detalles sobre el método de codificación, consulta el documento dado.
it_it: ``IntegerToBinary`` converte le variabili intere in variabili binarie ed in coefficienti per eliminare le variabili intere da ``QuadraticProgram``. Per la conversione, codifica a coefficiente delimitato proposto in `arxiv:1706.01945 <https://arxiv.org/abs/1706.01945>`__ (Eq. (5)) è utilizzato. Per maggiori dettagli del metodo di codifica, si prega di vedere il paper.
ja: ``IntegerToBinary`` は、整数変数をバイナリー変数と係数に変換して、 ``QuadraticProgram`` から整数変数を削除します。 変換には、 `arxiv:1706.01945 <https://arxiv.org/abs/1706.01945>`__ （式（5））で提案されている有界係数エンコーディングが使用されます。エンコード方法の詳細については、論文を参照してください。
ko: ``QuadraticProgram`` 에서 정수형 변수를 제거하기 위하여 ``IntegerToBinary`` 는 정수형 변수를 이진 변수와 계수로 변환한다. 이러한 변환은, 논문 `arxiv:1706.01945 <https://arxiv.org/abs/1706.01945>`__ (Eq. (5)) 에서 제안한 구속-계수 인코딩 (bounded-coefficient encoding) 기법을 이용하여 변환되었다. 인코딩 기법과 관련한 자세한 내용은 논문을 통해 확인할 수 있다.
ta_in: ``QuadraticProgram`` லிருந்து ``IntegerToBinary`` ஆனது முழு எண் மாறிகளை பைனரி மாறிகள் மற்றும் குணகங்களாக மாற்றுகிறது. மாற்றுவதற்கு, வரம்புக்குட்பட்ட-குணக குறியாக்கம் `arxiv:1706.01945 <https://arxiv.org/abs/1706.01945>`__ல் முன்மொழியப்பட்டது (Eq. (5)) பயன்படுத்தப்பட்டுள்ளது. குறியீட்டு முறையின் கூடுதல் விவரங்களுக்கு, தயவுசெய்து காகிதத்தைப் பார்க்கவும்.
te: ``QuadraticProgram`` నుండి integer వేరియబుల్‌లను తీసివేయడానికి ``IntegerToBinary`` integer వేరియబుల్‌లను బైనరీ వేరియబుల్స్‌గా మరియు గుణకాలుగా మారుస్తుంది. మార్చడం కోసం, `arxiv:1706.01945 <https://arxiv.org/abs/1706.01945>`__ (Eq. (5))లో ప్రతిపాదించబడిన బౌండెడ్-కోఎఫీషియంట్ ఎన్‌కోడింగ్ ఉపయోగించబడుతుంది. ఎన్‌కోడింగ్ పద్ధతి యొక్క మరింత వివరాల కోసం, దయచేసి పేపర్‌ను చూడండి.
th: ``IntegerToBinary`` แปลงตัวแปรจำนวนเต็มเป็นตัวแปรไบนารี่และสัมประสิทธิ์ เพื่อลบตัวแปรจำนวนเต็มออกจาก ``QuadraticProgram`` ในการแปลงเราจำเป็นต้องใช้ Bounded-Coefficient Encoding `arxiv:1706.01945 <https://arxiv.org/abs/1706.01945>`__ (Eq. (5)) สำหรับข้อมูลเพิ่มเติมศึกษาได้ตามเอกสารที่แนบไว้
tr_tr: ``IntegerToBinary`` dönüştürücüsü, ``QuadraticProgram`` dan tam sayı değişkenlerini kaldırmak için tam sayı değişkenlerini ikili sistem değişkenlerine ve katsayılara dönüştürürmektedir. Dönüşüm için, önerilen sınırlı-katsayı kodlaması (encoding) `arxiv:1706.01945 <https://arxiv.org/abs/1706.01945>`__ (Eq. (5)) kullanılır. Kodlama yöntemi hakkında detaylı bilgi için lütfen makaleyi inceleyiniz.
vi_vn: ``IntegerToBinary`` chuyển một biến thập phân sang một biến nhị phân và hệ số để loại bỏ biến thập phân trong từ ``QuadraticProgram``. Để chuyển đổi, hệ số bị chặn được mã hoá tại `arxiv:1706.01945 <https://arxiv.org/abs/1706.01945>`__ (Eq. (5)). Để có thể hiểu rõ hơn, hãy đọc link trên.

source: We use the output of ``InequalityToEquality`` as a starting point. Variables :math:`x` and :math:`y` are binary variables, while the variable :math:`z` and the slack variables :math:`xyz\_leq\text{@}int\_slack` and :math:`xyz\_geq\text{@}int\_slack` are integer variables. We print the problem again for reference.
es_un: Usamos el resultado de ``InequalityToEquality`` como punto de partida. Las variables :math:`x` e :math:`y` son variables binarias, mientras que la variable :math:`z` y las variables de holgura :math:`xyz\_leq\text{@}int\_slack` y :math:`xyz\_geq\text{@}int\_slack` son variables enteras. Imprimimos el problema nuevamente como referencia.
ja: ``InequalityToEquality`` の出力を開始点として使用します。 変数 :math:`x` と :math:`y` はバイナリー変数であり、変数 :math:`z` とスラック変数 :math:`xyz\_leq\text{@}int\_slack` と :math:`xyz\_geq\text{@}int\_slack` は整数変数です。 参照用に問題を再度表示します。
ko: 우리는 ``InequalityToEquality`` 의 출력값을 출발점으로 삼는다. 변수 :math:`x` 와 :math:`y` 는 이진 변수이고 변수 :math:`z` 와 여유변수인 :math:`xyz\_leq\text{@}int\_slack` 및 :math:`xyz\_geq\text{@}int\_slack` 는 정수형 변수이다. 참조를 위해 문제를 다시 출력한다.
ta_in: ``InequalityToEquality`` வெளியீட்டை ஒரு தொடக்கப் புள்ளியாகப் பயன்படுத்துகிறோம். மாறிகள் :math:`x` மற்றும் :math:`y` ஆகியவை பைனரி மாறிகள், அதே சமயம் மாறி :math:`z` மற்றும் ஸ்லாக் மாறிகள் :math:`xyz\_leq\text{@}int\_slack` மற்றும் :math:`xyz\_geq\text{@}int\_slack` என்பது முழு எண் மாறிகள். குறிப்புக்காக சிக்கலை மீண்டும் அச்சிடுகிறோம்.
te: మేము ప్రారంభ బిందువుగా ``InequalityToEquality`` అవుట్‌పుట్‌ని ఉపయోగిస్తాము. వేరియబుల్స్ :math:`x` మరియు :math:`y` బైనరీ వేరియబుల్స్, అయితే వేరియబుల్ :math:`z` మరియు స్లాక్ వేరియబుల్స్ :math:`xyz\_leq\text{@}int\_slack` మరియు :math:`xyz\_geq\text{@}int\_slack` integer వేరియబుల్స్. మేము సూచన కోసం సమస్యను మళ్లీ ముద్రిస్తాము.
th: เราเริ่มต้นจากผลลัพธ์ของ ``InequalityToEquality`` ตัวแปร :math:`x` และ :math:`y` เป็นตัวแปรไบนารี่ ในขณะที่ตัวแปร :math:`z` และตัวแปรส่วนขาด :math:`xyz\_leq\text{@}int\_slack` และ :math:`xyz\_geq\text{@}int\_slack` เป็นตัวแปรจำนวนเต็ม แสดงผลลัพธ์ที่ได้เพื่อเป็นตัวอ้างอิง

source: Call ``convert`` method of ``IntegerToBinary`` to convert.
bn_bn: রূপান্তর করতে ``IntegerToBinary` এর ``convert`` পদ্ধতিটি কল করুন।.
es_un: Llama al método ``convert`` de ``IntegerToBinary`` para convertirlo.
it_it: Chiama il metodo ``convert`` di ``IntegerToBinary`` per effettuare la conversione.
ja: 変換するには ``IntegerToBinary`` の ``convert`` メソッドを呼び出します。
ko: 모델을 변환하기 위하여 ``IntegerToBinary`` 의 ``convert`` 메서드를 호출하면 아래와 같다.
ta_in: மாற்றத்திற்கு ``IntegerToBinary`` ன் உடைய ``convert`` என்ற முறையை அழைக்கவும்.
te: మార్చడానికి ``IntegerToBinary`` యొక్క ``convert`` పద్ధతి ని కాల్ చేయండి.
th: เรียกใช้ Method ``convert`` จาก ``IntegerToBinary`` เพื่อแปลง
tr_tr: Dönüştürmek için ``InequalityToEquality`` dönüştürücüsünün ``convert`` yöntemini çağırın.
vi_vn: Gọi hàm ``convert`` trong ``IntegerToBinary`` để chuyển đổi.

source: After converting, the integer variable :math:`z` is replaced with three binary variables :math:`z\text{@}0`, :math:`z\text{@}1` and :math:`z\text{@}2` with coefficients 1, 2 and 4, respectively as the above. The slack variables :math:`xyz\_leq\text{@}int\_slack` and :math:`xyz\_geq\text{@}int\_slack` that were introduced by ``InequalityToEquality`` are also both replaced with three binary variables with coefficients 1, 2, 2, and 1, 2, 3, respectively.
es_un: Después de la conversión, la variable entera :math:`z` se reemplaza con tres variables binarias :math:`z\text{@}0`, :math:`z\text{@}1` y :math:`z\text{@}2` con los coeficientes 1, 2 y 4, respectivamente, como los anteriores. Las variables de holgura :math:`xyz\_leq\text{@}int\_slack` y :math:`xyz\_geq\text{@}int\_slack` que fueron introducidas por ``InequalityToEquality`` también se reemplazan por tres variables binarias con los coeficientes 1, 2, 2 y 1, 2, 3, respectivamente.
ja: 変換後、整数変数 :math:`z` は、上記のように、それぞれ係数1、2、および4の3つのバイナリー変数 :math:`z\text{@}0` 、 :math:`z\text{@}1` 、および :math:`z\text{@}2` に置き換えられます。 ``InequalityToEquality`` によって導入されたスラック変数 :math:`xyz\_leq\text{@}int\_slack` と :math:`xyz\_geq\text{@}int\_slack` も、それぞれ係数1、2、2、および1、2、3の3つのバイナリー変数に置き換えられます。
ko: 변환 후, 변수 :math:`z` 는 위와 같이 각각의 계수 1, 2, 4인 3개의 이진 변수들 :math:`z\text{@}0` , :math:`z\text{@}1`, 그리고 :math:`z\text{@}2` 로 대체된다. ``InequalityToEquality`` 에서 소개되었던 여유변수인 :math:`xyz\_leq\text{@}int\_slack` 와 :math:`xyz\_geq\text{@}int\_slack` 도 모두 각각의 계수가 1, 2, 2 와 1, 2, 3인 3개의 이진 변수들로 대체된다.
ta_in: மாற்றிய பின், முழு எண் மாறி :math:`z` மூன்று பைனரி மாறிகள் :math:`z\text{@}0`, :math:`z\text{@}1` மற்றும் :math:`z\text{@}2` முறையே 1, 2 மற்றும் 4 குணகங்களுடன், மேலே கூறப்பட்டுள்ளவாறு மாற்றப்படுகிறது. ``InequalityToEquality`` மூலம் அறிமுகப்படுத்தப்பட்ட ஸ்லாக் மாறிகள் :math:`xyz\_leq\text{@}int\_slack` மற்றும் :math:`xyz\_geq\text{@}int\_slack`, இரண்டும் முறையே 1, 2, 2, மற்றும் 1, 2, 3 ஆகிய குணகங்களைக் கொண்ட மூன்று பைனரி மாறிகளாக மாற்றப்படுகின்றன.
te: మార్చిన తర్వాత, integer వేరియబుల్ :math:`z` మూడు బైనరీ వేరియబుల్స్‌తో భర్తీ చేయబడుతుంది :math:`z\text{@}0`, :math:`z\text{@}1` మరియు :math:`z\text{@}2` పైన పేర్కొన్న విధంగా వరుసగా గుణకాలు 1, 2 మరియు 4తో వచనం. స్లాక్ వేరియబుల్స్ :math:`xyz\_leq\text{@}int\_slack` మరియు :math:`xyz\_geq\text{@}int\_slack`ని ``InequalityToEquality`` ద్వారా ప్రవేశపెట్టారు. వరుసగా 1, 2, 2, మరియు 1, 2, 3 గుణకాలతో మూడు బైనరీ వేరియబుల్స్.
th: หลังจากการแปลง ตัวแปรจำนวนเต็ม :math:`z` จะถูกแทนที่ด้วยตัวแปรไบนารี่สามตัว :math:`z\text{@}0`, :math:`z\text{@}1` และ :math:`z\text{@}2` และค่าสัมประสิทธิ์ 1, 2 และ 4 ตามลำดับ ตัวแปรส่วนขาด :math:`xyz\_leq\text{@}int\_slack` และ :math:`xyz\_geq\text{@}int\_slack` ที่ได้จาก ``InequalityToEquality`` จะถูกแทนที่ด้วยตัวแปรไบนารี่สามตัวที่มีสัมประสิทธิ์เป็น 1, 2, 2, และ 1, 2, 3, ตามลำดับ

source: Note: Essentially the coefficients mean that the sum of these binary variables with coefficients can be the sum of a subset of :math:`\{1, 2, 4\}`, :math:`\{1, 2, 2\}`, and :math:`\{1, 2, 3\}` to represent that acceptable values :math:`\{0, \ldots, 7\}`, :math:`\{0, \ldots, 5\}`, and :math:`\{0, \ldots, 6\}`, which respects the lower bound and the upper bound of original integer variables correctly.
bn_bn: টীকা: মূলত সহগের অর্থ হল সহগের সাথে এই বাইনারি চল রাশি গুলির যোগফল :math:`\{1, 2, 4\}`, :math:`\{1, 2, 2\}`,এবং :math:`\{1, 2, 3\}` এর একটি সাবসেটের যোগফল হতে পারে এবং সেই গ্রহণযোগ্য মানগুলি উপস্থাপন করে :math:`\{0, \ldots, 7\}`, :math:`\{0, \ldots, 5\}`, এবং :math:`\{0, \ldots, 6\}`, যা নীচের বাউন্ড এবং মূল সংখ্যার ভেরিয়েবলের উপরের সীমানাকে সঠিকভাবে মেনে চলে ।
es_un: Nota: En esencia, los coeficientes significan que la suma de estas variables binarias con coeficientes puede ser la suma de un subconjunto de :math:`\{1, 2, 4\}`, :math:`\{1, 2, 2\}`, y :math:`\{1, 2, 3\}` para representar los valores aceptables :math:`\{0, \ldots, 7\}`, :math:`\{0, \ldots, 5\}`, y :math:`\{0, \ldots, 6\}`, que respeta correctamente el límite inferior y el límite superior de las variables enteras originales.
it_it: Nota: Essenzialmente i coefficienti significano che la somma di queste variabili binarie con coefficienti può essere la somma di un sottoinsieme di :math:`\{1, 2, 4\}`, :math:`\{1, 2, 2\}`, e :math:`\{1, 2, 3\}` per rappresentare i valori accettabili :math:`\{0, \ldots, 7\}`, :math:`\{0, \ldots, 5\}`, e :math:`\{0, \ldots, 6\}`, che rispetta correttamente il limite inferiore e il limite superiore delle variabili intere originali.
ja: 注記：ここでの係数は、取り得る値 :math:`\{0, \ldots, 7\}` 、 :math:`\{0, \ldots, 5\}` 、 :math:`\{0, \ldots, 6\}` を表現するために、係数をもつ各バイナリー変数の和は、元の整数変数の下界と上界に従うようサブセット :math:`\{1, 2, 4\}` 、 :math:`\{1, 2, 2\}` 、 :math:`\{1, 2, 3\}` の和をとっています。
ko: 참고 : 기본적으로 계수가 의미하는 바는, 이러한 계수를 갖는 이진 변수들의 합이 원래의 정수형 변수의 하한과 상한인 :math:`\{0, \ldots, 7\}`, :math:`\{0, \ldots, 5\}`, :math:`\{0, \ldots, 6\}` 를 나타내기 위하여 :math:`\{1, 2, 4\}`, :math:`\{1, 2, 2\}`, :math:`\{1, 2, 3\}` 의 하위 집합의 합이 될 수 있음을 의미한다.
ta_in: குறிப்பு: அடிப்படையில் குணகங்கள் என்பது குணகங்களுடனான இந்த பைனரி மாறிகளின் தொகை ஒரு துணைக்குழுவின் கூட்டுத்தொகையாக இருக்கலாம் :math:`\{1, 2, 4\}`, :math:`\{1, 2, 2\}`, மற்றும் :math:`\{1, 2, 3\}`ஏற்றுக்கொள்ளக்கூடிய மதிப்புகளைக் குறிக்க:math:`\{0, \ldots, 7\}`, :math:`\{0, \ldots, 5\}`, மற்றும் :math:`\{0, \ldots, 6\}`, இது அசல் முழு எண் மாறிகளின் கீழ் வரம்பையும் மேல் வரம்பையும் சரியாக மதிக்கிறது.
te: గమనిక: ముఖ్యంగా గుణకాలు అంటే గుణకాలతో కూడిన ఈ బైనరీ వేరియబుల్స్ మొత్తం :math:`\{1, 2, 4\}`, :math:`\{1, 2, 2\ ఉపసమితి మొత్తం కావచ్చు. }`, మరియు :math:`\{1, 2, 3\}` ఆమోదయోగ్యమైన విలువలను సూచించడానికి :math:`\{0, \ldots, 7\}`, :math:`\{0, \ldots, 5\}`, మరియు :math:`\{0, \ldots, 6\}`, ఇది అసలైన integer వేరియబుల్స్ యొక్క దిగువ సరిహద్దు మరియు ఎగువ సరిహద్దును సరిగ్గా సూచిస్తుంది.
th: หมายเหตุ: โดยพื้นฐานแล้วจากค่าสัมประสิทธิ์เราสามารถบอกขอบเขตบนและขอบเขตล่างของตัวแปรจำนวนเต็มได้โดยนำเซตย่อยของ :math:`\{1, 2, 4\}`, :math:`\{1, 2, 2\}` และ :math:`\{1, 2, 3\}` มารวมกันเพื่อแสดงถึงค่าที่ยอมรับได้ทั้งหมด :math:`\{0, \ldots, 7\}`, :math:`\{0, \ldots, 5\}` และ :math:`\{0, \ldots, 6\}`
tr_tr: Not: Aslında katsayılar, asıl tam sayı değişkenlerinin üst ve alt sınırlarına doğru bir şekilde karşılık gelen kabul edilebilir :math:`\{0, \ldots, 7\}`, :math:`\{0, \ldots, 5\}` ve :math:`\{0, \ldots, 6\}` değerlerini temsil etmek için :math:`\{1, 2, 4\}`, :math:`\{1, 2, 2\}` ve :math:`\{1, 2, 3\}` durumunun bir alt kümesinin toplamı olabilen katsayılarla birlikte ikili sistem değişkenlerinin toplamı anlamına gelir.
vi_vn: Lưu ý: bản chất của các hệ số là tổng của các biến nhị phân với các hệ số có thể là tổng của các tập con của :math:`\{1, 2, 4\}`, :math:`\{1, 2, 2\}`, và :math:`\{1, 2, 3\}` để miêu tả các giá trị được chấp nhận :math:`\{0, \ldots, 7\}`, :math:`\{0, \ldots, 5\}`, and :math:`\{0, \ldots, 6\}`, tương ứng với giới hạn dưới và giới hạn trên trên của các biến nguyên gốc một cách chính xác.

source: ``IntegerToBinary`` also provides ``interpret`` method that is the functionality to translate a given binary result back to the original integer representation.
bn_bn: ``IntegerToBinary`` একটি ``interpret`` পদ্ধতিও সরবরাহ করে যা প্রদত্ত বাইনারি ফলাফলটিকে মূল পূর্ণসংখ্যার উপস্থাপনায় ফিরে অনুবাদ করার কার্যকারিতা।
it_it: ``IntegerToBinary`` fornisce anche il metodo ``interpret`` che è la funzionalità per tradurre un determinato risultato binario alla rappresentazione intera originale.
ja: ``IntegerToBinary`` は、与えられたバイナリ結果を元の整数表現に変換する機能である ``interpret`` メソッドも提供します。
ta_in: ``IntegerToBinary`` வழங்குகிறது ``interpret`` கொடுக்கப்பட்ட பைனரி முடிவை அசல் முழு எண் பிரதிநிதித்துவத்திற்கு மொழிபெயர்க்கும் செயல்பாடு இது.
te: ``IntegerToBinary`` అందించిన బైనరీ ఫలితాన్ని అసలు integer ప్రాతినిధ్యంకి అనువదించడానికి కార్యాచరణను అందించే ``interpret`` పద్ధతిని కూడా అందిస్తుంది.
th: ``IntegerToBinary`` ยังมี Method ``interpret`` ที่เป็นฟังก์ชันสำหรับการแปลผลลัพธ์จากไบนารี่ กลับมาเป็นรูปแบบจำนวนเต็ม
tr_tr: ``IntegerToBinary`` ayrıca, verilen ikili sistem sonucunu asıl tam sayı gösterimine geri çevirmek için bir işlevsellik olan ``interpret`` yöntemini de sağlar.
vi_vn: ``IntegerToBinary`` cũng cung cấp phương thức ``interpret`` với vai trò chuyển đổi một kết quả nhị phân về dạng thập phân ban đầu.

source: ``LinearEqualityToPenalty`` converts linear equality constraints into additional quadratic penalty terms of the objective function to map ``QuadraticProgram`` to an unconstrained form. An input to the converter has to be a ``QuadraticProgram`` with only linear equality constraints. Those equality constraints, e.g. :math:`\sum_i a_i x_i = b` where :math:`a_i` and :math:`b` are numbers and :math:`x_i` is a variable, will be added to the objective function in the form of :math:`M(b - \sum_i a_i x_i)^2` where :math:`M` is a large number as penalty factor. By default :math:`M= 1e5`. The sign of the term depends on whether the problem type is a maximization or minimization.
ja: ``LinearEqualityToPenalty`` は、 ``QuadraticProgram`` を制約なしの形式にマップするために、線形等式制約を目的関数の追加の2次ペナルティ項に変換します。コンバーターへの入力は，線形等価制約のみを持つ ``QuadraticProgram`` でなければなりません。これらの等価性制約、例えば :math:`a_i` と :math:`b` は数値、 :math:`x_i` は変数であり、 :math:`M` はペナルティファクターとしては大きな数である時、 :math:`x_i` は :math:`M(b - \sum_i a_i x_i)^2` の形式で目的関数に追加されます。デフォルトでは :math:`M= 1e5` です。 項の符号は、問題の種類が最大化か最小化かに依存します。

source: We use the output of ``IntegerToBinary`` as a starting point, where all variables are binary variables and all inequality constraints have been mapped to equality constraints. We print the problem again for reference.
es_un: Utilizamos la salida de ``IntegerToBinary`` como punto de partida, donde todas las variables son variables binarias y todas las restricciones de desigualdad se han mapeado con restricciones de igualdad. Volvemos a imprimir el problema como referencia.
ja: ``IntegerToBinary`` の出力を開始点として使用します。ここで、すべての変数はバイナリー変数であり、すべての不等式制約は等式制約にマップされています。 参照用に問題を再度表示します。
ko: 모든 변수가 이진 변수이고 모든 부등식 제약 조건이 등식 제약 조건에 매핑된 ``IntegerToBinary`` 의 출력값을 시작 지점으로 사용한다. 참조를 위해 문제를 다시 출력한다.
ta_in: ``IntegerToBinary`` வெளியீட்டை ஒரு தொடக்கப் புள்ளியாகப் பயன்படுத்துகிறோம், அங்கு அனைத்து மாறிகளும் பைனரி மாறிகள், மற்றும் அனைத்து சமத்துவமில்லாக் கட்டுப்பாடுகளும் சமத்துவக் கட்டுப்பாடுகளுக்கு வரைபடமாக்கப்பட்டுள்ளன. குறிப்புக்காக சிக்கலை மீண்டும் அச்சிடுகிறோம்.
te: మేము ``IntegerToBinary`` అవుట్‌పుట్‌ను ప్రారంభ బిందువుగా ఉపయోగిస్తాము, ఇక్కడ అన్ని వేరియబుల్స్ బైనరీ వేరియబుల్స్ మరియు అన్ని అసమానత పరిమితులు సమానత్వ పరిమితులకు మ్యాప్ చేయబడ్డాయి. మేము సూచన కోసం సమస్యను మళ్లీ ముద్రిస్తాము.
th: เราสามารถใช้ผลลัพธ์ของ ``IntegerToBinary`` ในการเริ่มต้นได้ โดยทุก ๆ ตัวแปรเป็นตัวแปรไบนารี่และทุก ๆ อสมการข้อจำกัดจะถูกแปลงไปเป็นสมการข้อจำกัด แสดงผลลัพธ์ที่ได้เพื่อเป็นตัวอ้างอิง

source: Call ``convert`` method of ``LinearEqualityToPenalty`` to convert.
bn_bn: রূপান্তর করতে ``LinearEqualityToPenalty` এর ``convert`` পদ্ধতিটি কল করুন।.
es_un: Llama al método ``convert`` de ``LinearEqualityToPenalty`` para convertirlo.
it_it: Chiama il metodo ``convert`` di ``LinearEqualityToPenalty`` per effettuare la conversione.
ja: ``LinearEqualityToPenalty`` の ``convert`` メソッドを呼び出して変換します。
ko: 모델을 변환하기 위하여 ``LinearEqualityToPenalty``의 ``convert`` 메서드를 호출하면 아래와 같다.
ta_in: மாற்றத்திற்கு ``LinearEqualityToPenalty`` ன் உடைய ``convert`` என்ற முறையை அழைக்கவும்.
te: మార్చడానికి ``LinearEqualityToPenalty`` యొక్క ``convert`` పద్ధతి ని కాల్ చేయండి.
th: เรียกใช้ Method ``convert`` ของ ``LinearEqualityToPenalty`` เพื่อแปลง
tr_tr: Dönüştürmek için ``LinearEqualityToPenalty`` nin ``convert`` yöntemini çağırın.
vi_vn: Gọi phương pháp ``convert`` trong ``LinearEqualityToPenalty`` để chuyển đổi.
