Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/02_converters_for_quadratic_programs.po
Languages: bn_bn, es_un, it_it, ja, ko, ta_in, te, th, tr_tr, vi_vn

source: After converting, the equality constraints are added to the objective function as additional terms with the default penalty factor :math:`M=1e5`. The resulting problem is now a QUBO and compatible with many quantum optimization algorithms such as VQE, QAOA and so on.
bn_bn: রূপান্তর করার পরে, সাম্যতার সীমাবদ্ধতাগুলি ডিফল্ট জরিমানার ফ্যাক্টর :math:`M=1e5` এর সাথে অতিরিক্ত পদ হিসাবে নৈর্ব্যক্তিক অন্বয় (অব্জেক্টিভ ফাংশন) যুক্ত হয়। ফলস্বরূপ সমস্যাটি এখন একটি কিউইউবিও (QUBO) এবং অনেকগুলি কোয়ান্টাম অপ্টিমাইজেশন অ্যালগরিদম যেমন ভি কিউ ই (VQE), কিউএওএ (QAOA) ইত্যাদির সাথে সুসংগত।
it_it: Dopo la conversione, i vincoli di uguaglianza vengono aggiunti alla funzione oggettiva come termini aggiuntivi con il penaltu factor di default :math:` M=1e5 `. Il problema risultante è ora QUBO e compatibile con molti algoritmi di ottimizzazione quantistica come VQE, QAOA e così via.
ja: 変換後、等式制約はデフォルトのペナルティ係数 :math:`M=1e5` を持つ追加項として目的関数に追加されます。 変換後の問題はQUBOとなり、VQE、QAOAなどの多くの量子最適化アルゴリズムと互換性があります。
ta_in: மாற்றிய பின், இயல்புநிலை அபராதம் காரணியுடன் கூடுதல் சொற்களாக புறநிலை செயல்பாட்டில் சமத்துவ கட்டுப்பாடுகள் சேர்க்கப்படுகின்றன :math:`M=1e5` .இதன் விளைவாக சிக்கல் இப்போது ஒரு QUBO மற்றும் VQE, QAOA மற்றும் பல குவாண்டம் தேர்வுமுறை வழிமுறைகளுடன் இணக்கமானது.
te: మార్చిన తర్వాత, డిఫాల్ట్ పెనాల్టీ ఫ్యాక్టర్ :math:`M=1e5` తో అదనపు పదాల వలె సమానత్వ పరిమితులు ఆబ్జెక్టివ్ ఫంక్షన్‌కి జోడించబడతాయి. ఫలితంగా ఏర్పడిన సమస్య ఇప్పుడు QUBO మరియు VQE, QAOA మొదలైన అనేక క్వాంటం ఆప్టిమైజేషన్ అల్గారిథమ్‌లకు అనుకూలంగా ఉంది.
th: หลังจากการแปลง สมการข้อจำกัดจะถูกเพิ่มเข้าไปในฟังก์ชันวัตถุประสงค์เป็นพจน์เพิ่มเติมด้วยค่า Penalty Factor เริ่มต้น :math:`M=1e5` โจทย์สุดท้ายที่ได้จะอยู่ในลักษณะ QUBO และ สามารถนำไปใช้งานกับควอนตัมอัลกอริทึมได้หลายตัวเช่น VQE, QAOA และ อื่น ๆ
tr_tr: Dönüştürdükten sonra, eşitlik kısıtlaması varsayılan ceza faktörü :math:`M=1e5` ile birlikte ek terimler olarak amaç fonksiyonuna eklenir. Ortaya çıkan problem şimdi bir QUBO (Quadratic Unconstrained Binary Optimization)'dur ve VQE, QAOA ve benzeri birçok kuantum optimizasyon algoritması ile uyumludur.
vi_vn: Sau khi chuyển đổi, hạn chế đẳng thức được thêm vào hàm mục tiêu như các số hạng bổ sung với yếu tố phạt mặc định :math:`M=1e5 `. Vấn đề cho ra bây giờ là một QUBO và tương thích với nhiều thuật toán tối ưu hóa lượng tử như VQE, QAOA và vân vân.

source: This gives the same result as before.
bn_bn: এটি আগের মতো একই ফলাফল দেয়।.
es_un: Esto da el mismo resultado que antes.
it_it: Questo dà lo stesso risultato di prima.
ja: これは以前と同じ結果を与えます。
ko: 다음은 이전과 동일한 결과를 보여준다.
ta_in: இது முந்தையதைப் போன்ற முடிவைக் கொடுக்கும்.
te: ఇది మునుపటి ఫలితాన్ని ఇస్తుంది.
th: ซึ่งให้ผลลัพธ์เหมือนกับที่แสดงก่อนหน้านี้
tr_tr: Bu daha öncekiyle aynı sonucu verir.
vi_vn: Điều này cho kết quả tương tự như trước đây.

source: Optimization problems in Qiskit's optimization module are represented with the ``QuadraticProgram`` class, which is a generic and powerful representation for optimization problems. In general, optimization algorithms are defined for a certain formulation of a quadratic program, and we need to convert our problem to the right type.
te: Qiskit యొక్క ఆప్టిమైజేషన్ మాడ్యూల్‌లోని ఆప్టిమైజేషన్ సమస్యలు ``QuadraticProgram`` క్లాస్‌తో సూచించబడతాయి, ఇది ఆప్టిమైజేషన్ సమస్యలకు సాధారణ మరియు శక్తివంతమైన ప్రాతినిధ్యం. సాధారణంగా, క్వాడ్రాటిక్ ప్రోగ్రామ్ యొక్క నిర్దిష్ట సూత్రీకరణ కోసం ఆప్టిమైజేషన్ అల్గారిథమ్‌లు నిర్వచించబడతాయి మరియు మనం మన సమస్యను సరైన రకానికి మార్చాలి.

source: To map a problem to the correct input format, the optimization module of Qiskit offers a variety of converters. In this tutorial we're providing an overview on this functionality. Currently, Qiskit contains the following converters.
te: సమస్యను సరైన ఇన్‌పుట్ ఫార్మాట్కు మ్యాప్ చేయడానికి, Qiskit యొక్క ఆప్టిమైజేషన్ మాడ్యూల్ వివిధ రకాల కన్వర్టర్‌లను అందిస్తుంది. ఈ ట్యుటోరియల్‌లో మేము ఈ కార్యాచరణపై ఓవర్వ్యూన్ని అందిస్తున్నాము. ప్రస్తుతం, Qiskit కింది కన్వర్టర్‌లను కలిగి ఉంది.

source: LinearEqualityToPenalty
es_un: LineEqualityToPenalty
ta_in: லீனியர் எக்வாலிட்டி டோபெனால்டி

source: ``LinearEqualityToPenalty`` converts linear equality constraints into additional quadratic penalty terms of the objective function to map ``QuadraticProgram`` to an unconstrained form. An input to the converter has to be a ``QuadraticProgram`` with only linear equality constraints. Those equality constraints, e.g. :math:`\sum_i a_i x_i = b` where :math:`a_i` and :math:`b` are numbers and :math:`x_i` is a variable, will be added to the objective function in the form of :math:`M(b - \sum_i a_i x_i)^2` where :math:`M` is a large number as penalty factor. By default :math:`M= 1e5`. The sign of the term depends on whether the problem type is a maximization or minimization.
es_un: ``LineeEqualityToPenalty`` convierte las restricciones de igualdad lineal en términos de penalización cuadráticos adicionales de la función objetivo para mapear el ``QuadraticProgram`` a una forma sin restricciones. Una entrada al convertidor tiene que ser un ``QuadraticProgram`` con sólo restricciones lineales de igualdad. Estas restricciones de igualdad, por ejemplo, :math:`\sum_i a_i x_i = b` donde :math:`a_i` y :math:`b` son números y :math:`x_i` es una variable, se agregará a la función objetivo en la forma de :math:`M(b - \sum_i a_i x_i)^2` donde :math:`M` es un número grande como factor de penalización. Por defecto, :math:`M= 1e5`. El signo del término depende de si el tipo de problema es de maximización o minimización.

source: InequalityToEquality
ko: 부등식의 등식화
ta_in: இன்இகுவாலிட்டிடுஇகுவாலிட்டி

source: IntegerToBinary
ko: 정수변수의 이진변수화

source: Optimization problems in Qiskit’s optimization module are represented with the ``QuadraticProgram`` class, which is generic and powerful representation for optimization problems. In general, optimization algorithms are defined for a certain formulation of a quadratic program and we need to convert our problem to the right type.
bn_bn: Qiskit এর অপ্টিমাইজেশন মডিউলে অপ্টিমাইজেশন সমস্যাগুলি ``QuadraticProgram`` ক্লাসের সাথে প্রতিনিধিত্ব করে, যা অনুকূলায়ন (অপ্টিমাইজেশন) সমস্যাসমূহ জন্য জেনেরিক এবং শক্তিশালী উপস্থাপন। সাধারণভাবে, অনুকূলায়ন (অপ্টিমাইজেশন) অ্যালগরিদমগুলি একটি দ্বিঘাত প্রোগ্রামের নির্দিষ্ট গঠনের জন্য সংজ্ঞায়িত হয় এবং আমাদের সমস্যাটিকে সঠিক ধরণের রূপান্তর করতে হবে।
it_it: I problemi di ottimizzazione nel modulo di ottimizzazione di Qiskit sono rappresentati con la classe ``QuadraticProgram``, la quale è una rappresentazione generica ed efficace per i problemi di ottimizzazione. In generale, gli algoritmi di ottimizzazione sono definiti per formulazione di programmi quadratrici ed occorre convertire il nostro problema nella giusta tipologia.
tr_tr: Qiskit'in optimizasyon modülündeki optimizasyon problemleri, optimizasyon problemleri için genel ve güçlü bir temsil olan ``QuadraticProgram`` sınıfı ile temsil edilir. Genel olarak, karesel bir programın belirli bir formülasyonu için optimizasyon algoritmaları tanımlanır ve problemimizi doğru türe dönüştürmemiz gerekir.
vi_vn: Bài toán tối ưu hóa trong mô đun Qiskit’s optimization được diễn tả bằng lớp ``QuadraticProgram``, một phương pháp diễn tả khá phổ biến và mạnh cho các vấn đề tối ưu hóa. Nói chung, các thuật toán tối ưu hóa được dùng cho một vài công thức trong bài toán lập trình bậc hai và chúng ta cần chuyển vấn đề về đúng dạng.

source: For instance, Qiskit provides several optimization algorithms that can handle Quadratic Unconstrained Binary Optimization (QUBO) problems. These are mapped to Ising Hamiltonians, for which Qiskit uses the ``qiskit.aqua.operators`` module, and then their ground state is approximated. For this optimization commonly known algorithms such as VQE or QAOA can be used as underlying routine. See the following tutorial about the `Minimum Eigen Optimizer <./03_minimum_eigen_optimizer.ipynb>`__ for more detail. Note that also other algorithms exist that work differently, such as the ``GroverOptimizer``.
bn_bn: উদাহরণস্বরূপ, Qiskit একাধিক অপ্টিমাইজেশান অ্যালগরিদম সরবরাহ করে যা শর্তহীন দ্বিঘাত দ্বিমিক অনুকূলায়ন (Quadratic Unconstrained Binary Optimization - QUBO) সমস্যাগুলি পরিচালনা করতে পারে। এগুলি আইসিং হ্যামিল্টনীয় তে চিত্রায়ন করা হয়েছে, যার জন্য Qiskit ``qiskit.aqua.operators`` মডিউল ব্যবহার করে এবং তারপরে তাদের গ্রাউন্ড অবস্থাটি হিসাব করা হয়। এই অপ্টিমাইজেশনের জন্য সাধারণত VQE বা QAOA এর মতো পরিচিত অ্যালগরিদম অন্তর্নিহিত রুটিন হিসাবে ব্যবহার করা যেতে পারে। আরও বিস্তারিত জানার জন্য `Minimum Eigen Optimizer <./3_minimum_eigen_optimizer.ipynb>`__ সম্পর্কে নিম্নলিখিত টিউটোরিয়ালটি দেখুন। খেয়াল করুন যে অন্যান্য অ্যালগরিদমগুলিও রয়েছে যেগুলি ``GroverOptimizer`` এর মতো আলাদাভাবে কাজ করে।
it_it: Ad esempio, Qiskit fornisce diversi algoritmi di ottimizzazione in grado di gestire i problemi di Quadratic Unvincolained Binary Optimization (QUBO). Questi sono mappati su Hamiltoniane di Ising, per i quali Qiskit utilizza il modulo ``qiskit.aqua.operators`` e poi il loro stato iniziale è approssimato. Per questa ottimizzazione gli algoritmi comunemente noti come VQE o QAOA possono essere utilizzati come routine sottostante. Vedi il seguente tutorial su `Minimum Eigen Optimizer <./03_minimum_eigen_optimizer.ipynb>`__ per maggiori dettagli. Da notare che esistono anche altri algoritmi che funzionano in modo diverso, come il ``GroverOptimizer``.
tr_tr: Örneğin, Qiskit, Karesel Kısıtsız İkili Optimizasyon (QUBO) problemlerini işleyebilen birkaç optimizasyon algoritması sağlar. Bunlar, Qiskit'in ``qiskit.aqua.operators`` modülünü kullandığı Ising Hamiltonyenleri ile eşleştirilir ve ardından temel durumlarına yaklaşılır. Bu optimizasyon için, temel rutin olarak VQE veya QAOA gibi yaygın olarak bilinen algoritmalar kullanılabilir. Daha fazla ayrıntı için `Minimum Eigen Optimizer <./03_minimum_eigen_optimizer.ipynb>`__ hakkında aşağıdaki eğiticiye bakın. ``GroverOptimizer`` gibi farklı çalışan başka algoritmaların da bulunduğunu unutmayın.
vi_vn: Ví dụ, Qiskit cung cấp một số thuật toán tối ưu hóa có thể xử lý các bài toán tối ưu hoá nhị phân bậc hai không ràng buộc (QUBO). Chúng được kết nối tới Ising Hamiltonian, trong đó Qiskit sử dụng mô-đun ``qiskit.aqua.operator``, và sau đó trạng thái cơ bản của chúng được xấp xỉ. Đối với các thuật toán tối ưu hóa này thường được biết đến như VQE hoặc QAOA có thể được sử dụng như thuật toán cơ bản. Xem hướng dẫn sau về `Minimum Eigen Optimizer <./3_minimum_eigen_optimizer.ipynb>`__ để biết thêm chi tiết. Lưu ý rằng cũng có các thuật toán khác tồn tại mà hoạt động kiểu khác, chẳng hạn như ``GroverOptimizer``.

source: To map a problem to the correct input format, the optimization module of Qiskit offers a variety of converters. In this tutorial we’re providing an overview on this functionality. Currently, Qiskit contains the following converters. - ``InequalityToEquality``: converts inequality constraints into equality constraints with additional slack variables. - ``IntegerToBinary``: converts integer variables into binary variables and corresponding coefficients. - ``LinearEqualityToPenalty``: convert equality constraints into additional terms of the object function. - ``QuadraticProgramToQubo``: a wrapper for ``InequalityToEquality``, ``IntegerToBinary``, and ``LinearEqualityToPenalty`` for convenience.
bn_bn: সঠিক ইনপুট ফর্ম্যাটে কোনও সমস্যা ম্যাপ করতে, কিস্কিটের (Qiskit) অপ্টিমাইজেশন মডিউলটি বিভিন্ন ধরণের রূপান্তর সরবরাহ করে। এই টিউটোরিয়ালে আমরা এই কার্যকারিতা সম্পর্কে একটি ওভারভিউ সরবরাহ করছি। বর্তমানে, Qiskit এ নিম্নলিখিত পরিবর্তক (কনভার্টার) রয়েছে ``InequalityToEquality``: অসম্পূর্ণতার সীমাবদ্ধতাগুলিকে অতিরিক্ত স্ল্যাক চল রাশি গুলির সাথে সমতা সীমাবদ্ধতায় রূপান্তর করে। - ``IntegerToBinary``: পূর্ণসংখ্যার চল রাশি গুলিকে বাইনারি চল রাশি এবং সংশ্লিষ্ট সহগগুলিতে রূপান্তর করে। - ``LinearEqualityToPenalty``: সাম্যের সীমাবদ্ধতাকে অবজেক্ট ফাংশনের অতিরিক্ত পদগুলিতে রূপান্তর করে। সুবিধার জন্য - ``QuadraticProgramToQubo`` টি: ``InequalityToEquality``, ``IntegerToBinary`` এবং ``LinearEqualityToPenalty``-র একটি মোড়ক।
it_it: Per mappare un problema nel formato di input corretto, il modulo di ottimizzazione di Qiskit offre una varietà di convertitori. In questo tutorial verrà fornita una panorami su tale funzionalità. Attualmente, Qiskit contiene i seguenti convertitori. - ``InequalityToEquality``: converte i vincoli di disuguaglianza in vincoli di uguaglianza con variabli di slack aggiuntive. - ``IntegerToBinary``: converte variabili intere in variabili binare e corrispettivi coefficienti. - ``LinearEqualityToPenalty``: converte vincoli di uguaglianza in ulteriori termini della funzione oggetto. ``QuadraticProgramToQubo``: un wrapper per ``InequalityToEquality``, ``IntegerToBinary``, e ``LinearEqualityToPenalty`` per comodità.
tr_tr: Bir sorunu doğru giriş biçimiyle eşleştirmek için Qiskit'in optimizasyon modülü çeşitli dönüştürücüler sunmaktadır. Bu eğitselde bu işlevselliğe genel bir bakış sağlıyoruz. Şu ana dek, Qiskit aşağıdaki dönüştürücüleri içermektedir. - ``InequalityToEquality``: eşitsizlik kısıtlamalarını ek gevşek değişkenlerle eşitlik kısıtlamalarına dönüştürür - ``IntegerToBinary``: tam sayı (integer) değişkenlerini, ikili sistem (binary) değişkenlerine ve karşılık gelen kat sayılara dönüştürür. - ``LinearEqualityToPenalty``: eşitlik kısıtlamalarını amaç fonksiyonunun ek terimlerine dönüştürür. - ``QuadraticProgramToQubo``: kolaylık sağlamak için ``InequalityToEquality``, ``IntegerToBinary`` ve ``LinearEqualityToPenalty`` dönüştürücülerine uygun bir sarıcıdır.
vi_vn: Để có thể ánh xạ một vấn đề đến định dạng đầu vào đúng, môđun tối ưu hóa của Qiskit cung cấp nhiều bộ chuyển đổi. Trong hướng dẫn này, chúng tôi đang cung cấp tổng quan về chức năng này. Hiện tại, Qiskit chứa các bộ chuyển đổi sau. -``InequalityToEquality``: chuyển đổi các ràng buộc bất đẳng thức thành các ràng buộc đẳng thức với các biến hạn bổ sung. - ``IntegerToBinary``: chuyển đổi các biến số nguyên thành các biến nhị phân và các hệ số tương ứng. -``LinearEqualityToPenalty``: chuyển đổi các ràng buộc đẳng thức thành các thuật ngữ bổ sung của hàm đối tượng. -``QuadraticProgramToQubo``: một bộ bọc cho ``InequalityToEquality``, ``IntegerToBinary``, và ``LinearEqualityToPenalty` để tiện lợi hơn.

source: After converting, the formulation of the problem looks like as the follows. As we can see, the inequality constraints are replaced with equality constraints with additional integer slack variables, :math:`xyz\_leg\text{@}int\_slack` and :math:`xyz\_geq\text{@}int\_slack`.
bn_bn: রূপান্তর করার পরে, সমস্যার সূত্রটি নীচের মত দেখাচ্ছে। আমরা দেখতে পাচ্ছি যে অসমতার সীমাবদ্ধতাগুলি অতিরিক্ত সংখ্যার স্ল্যাক চল রাশিগুলি, :math:`xyz\_leg\text{@}int\_slack` এবং :math:`xyz\_geq\text{@}int\_slack`-র সাথে সমতা সীমাবদ্ধতার সাথে প্রতিস্থাপিত হয়।
it_it: Dopo la conversione, la formulazione del problema sembra la seguente. Come possiamo vedere, costanti di disuguaglianza sono sostituite con vincoli di uguaglianza con ulteriori variabili slack intere, :math:`xyz\_leg\text{@}int\_slack` and :math:`xyz\_geq\text{@}int\_slack`.
tr_tr: Dönüştürdükten sonra, problemin formülasyonu aşağıdaki gibi görünür. Görebildiğimiz gibi eşitsizlik kısıtlamalarının yeri, ek tam sayı gevşek değişkenleri :math:`xyz\_leg\text{@}int\_slack` ve :math:`xyz\_geq\text{@}int\_slack` sayesinde eşitlik kısıtlamalarının yeri ile değiştirildi.
vi_vn: Sau khi chuyển đổi, các biểu thức có dạng như dưới đây. Như chúng ta có thể thấy, các ràng buộc bất bình đẳng đã được thay thế bằng các ràng buộc bình đẳng với các biến nguyên bù, :math:`xyz\_leg\text{@}int\_slack` và :math:`xyz\_geq\text{@}int\_slack`.

source: Let us explain how the conversion works. For example, the lower bound of the left side of the first constraint is :math:`0` which is the case of :math:`x=0`, :math:`y=0`, and :math:`z=0`. Thus, the upperbound of the additional integer variable must be :math:`5` to be able to satisfy even the case of :math:`x=0`, :math:`y=0`, and :math:`z=0`. Note that we cut off the part after the decimal point in the converted formulation since the left side of the first constraint in the original formulation can be only integer values. For the second constraint, basically we apply the same approach. However, the symbol in the second constraint is :math:`\geq`, so we add minus before :math:`xyz\_geq\text{@}int\_slack` to be able to satisfy even the case of :math:`x=1, y=1`, and :math:`z=7`.
bn_bn: আসুন কীভাবে রূপান্তরটি কাজ করে তা ব্যাখ্যা করি। উদাহরণস্বরূপ, প্রথম সীমাবদ্ধতার বাম পাশের নীচের অংশটি :math:`0` যা :math:`x=0`, :math:`y=0` এবং :math:`z=0` এর ক্ষেত্রে। সুতরাং, :math:`x=0`, :math:`y=0` এবং :math:`z=0` এর ক্ষেত্রেও সফল করতে অতিরিক্ত পূর্ণসংখ্যার চল রাশির উপরের দিকে :math:`5` হওয়া আবশ্যক। খেয়াল করুন যে আমরা রূপান্তরিত সূচনার দশমিক পয়েন্টের পরে অংশটি কেটে দিয়েছি যেহেতু মূল গঠনের প্রথম সীমাবদ্ধতার বাম দিকটি কেবল পূর্ণসংখ্যার মান হতে পারে। দ্বিতীয় শর্তের জন্য, মূলত আমরা একই পদ্ধতির প্রয়োগ করি। যাইহোক, দ্বিতীয় শর্তের প্রতীকটি হল :math:`\geq`, তাই আমরা :math:`x=1, y=1`, এবং :math:`z=7` এমনকি কেস সন্তুষ্ট করতে সক্ষম হতে :math:`xyz\_geq\text{@}int\_slack` এর আগে বিয়োগ যোগ করি।
it_it: Vediamo come funziona la conversione. Ad esempio, il limite inferiore del lato sinistro del primo vincolo è :math:`0` che è il caso di :math:`x=0`, :math:`y=0` e :math:`z=0`. Così, l'upperbound della variabile integrativa intera deve essere pari a :math:`5` per poter soddisfare anche il caso di :math:`x=0`, :math:`y=0`, e :math:`z=0`. Da notare il fatto che tagliamo la parte dopo il punto decimale nella formulazione convertita in quanto il lato sinistro del primo vincolo nella formulazione originale può essere solo valori interi. Per il secondo vincolo, sostanzialmente applichiamo lo stesso approccio. Tuttavia, il symol nel secondo vincolo è :math:`\geq`, quindi aggiungiamo meno :math:`xyz\_geq\text{@}int\_slack` per poter soddisfare anche il caso di :math:`x= 1, y=1` e :math:`z=7`.
tr_tr: Haydi bu dönüşümün nasıl çalıştığını açıklayalım. Örneğin, ilk kısıtlamanın sol tarafının alt sınırı, :math:`x=0`, :math:`y=0` ve :math:`z=0` durumu olan :math:`0` dir. Bu yüzden, ek tam sayı değişkeninin üst sınırı, :math:`x=0`, :math:`y=0` ve :math:`z=0` durumunu bile karşılayabilmek için :math:`5` olmalıdır. Asıl formülasyondaki ilk kısıtlamanın sol tarafı sadece tam sayı değeri olabileceği için dönüştürülen formülasyonda ondalık noktadan sonraki kısmı kestiğimizi unutmayın. Temelde ikinci kısıtlama için aynı yaklaşımı uyguluyoruz. Ancak, ikinci kısıtlamadaki simge :math:`\geq`, bu yüzden :math:`x=1, y=1` ve :math:`z=7` durumunu bile karşılayabilmek için :math:`xyz\_geq\text{@}int\_slack` den önce eksi (-) ekliyoruz.
vi_vn: Hãy giải thích cách mà chuyển đổi được thực hiện. Ví dụ, giới hạn dưới của vế trái của ràng buộc đầu tiên là :math:`0`, trong trường hợp :math:`x=0`, :math:`y=0`, và :math:`z=0`. Vì vậy, giới hạn trên của biến số nguyên phải là :math:`5` để có thể thỏa mãn trong trường hợp :math:`x=0`, :math:`y=0`, và :math:`z=0`. Để ý rằng chúng ta bỏ đi phần thập phân trong công thức vì vế trái của ràng buộc đầu tiên trong công thức ban đầu chỉ có thể là một số nguyên. Với ràng buộc thứ hai, chúng ta cũng áp dụng phương pháp đó. Tuy nhiên, dấu của ràng buộc thứ hai là :math:`\geq`, nên chúng ta thêm dấu trừ trước :math:`xyz\_geq\text{@}int\_slack` để có thể thỏa mãn điều kiện kể cả khi :math:`x=1, y=1`, và :math:`z=7`.

source: We use the output of ``InequalityToEquality`` as starting point. Variable :math:`x` and :math:`y` are binary variables, while the variable :math:`z` and the slack variables :math:`xyz\_leq\text{@}int\_slack` and :math:`xyz\_geq\text{@}int\_slack` are integer variables. We print the problem again for reference.
bn_bn: আমরা ``InequalityToEquality`` এর ফলাফলটি প্রারম্ভিক পয়েন্ট হিসাবে ব্যবহার করি। চলরাশি :math:`x` এবং :math:`y` হ'ল বাইনারি চলরাশি, অন্যদিকে চলরাশি :math:`z` এবং স্ল্যাক চল রাশি :math:`xyz\_leq\text{@}int\_slack` এবং :math:`xyz\_geq\text{@}int\_slack` পূর্ণসংখ্যা চলরাশি। আমরা আবার সমস্যাটি মুদ্রণের জন্য তথ্যসূত্র (রেফারেন্স) করব।
it_it: Utilizziamo l'output di ``InequalityToEquality`` come punto di partenza. Le variabili :math:`x` and :math:`y` sono variabili binarie, mentre la variabile :math:`z` e le variabili slack :math:`xyz\_leq\text{@}int\_slack` e :math:`xyz\_geq\text{@}int\_slack` sono variabili intere. Visualizziamo di nuovo il problema come riferimento.
tr_tr: Başlangıç noktası olarak ``InequalityToEquality`` dönüştürücüsünün çıktısını kullanıyoruz. :math:`z` değişkeni, :math:`xyz\_leq\text{@}int\_slack` ve :math:`xyz\_geq\text{@}int\_slack` gevşek değişkenleri, tam sayı değişkenleri iken :math:`x` ve :math:`y` ikili sistem değişkenleridir. Kaynak göstermek için problemi tekrar yazdırıyoruz.
vi_vn: Chúng ta dùng đầu ra của ``InequalityToEquality`` như một điểm bắt đầu. Biến :math:`x` và :math:`y` là các biến nhị phân, trong khi đó biến :math:`z` và biến bù :math:`xyz\_leq\text{@}int\_slack` và :math:`xyz\_geq\text{@}int\_slack` là các biến nguyên. Chúng ta in ra vấn đề một lần nữa để có thể tham khảo.

source: After converting, integer variables :math:`z` is replaced with three binary variables :math:`z\text{@}0`, :math:`z\text{@}1` and :math:`z\text{@}2` with coefficients 1, 2 and 4, respectively as the above. The slack variables :math:`xyz\_leq\text{@}int\_slack` and :math:`xyz\_geq\text{@}int\_slack` that were introduced by ``InequalityToEquality`` are also both replaced with three binary variables with coefficients 1, 2, 2, and 1, 2, 3, respectively.
bn_bn: রূপান্তর করার পরে, পূর্ণসংখ্যার চল রাশি গুলি :math:`z` তিনটি বাইনারি চল রাশি উপরের আলোচনা অনুযায়ী যথাক্রমে ১, ২ এবং ৪ সহগের সাথে প্রতিস্থাপন করা হয় :math:`z\text{@}0`, :math:`z\text{@}1` এবং :math:`z\text{@}2` দ্বারা। স্ল্যাক চল রাশি গুলি :math:`xyz\_leq\text{@}int\_slack` এবং :math:`xyz\_geq\text{@}int\_slack` যেগুলি ``InequalityToEquality`` দ্বারা প্রবর্তিত, এবং উভয়কে প্রতিস্থাপন করা হয়েছে সহগের ১,২,২ এবং ১,২,৩ তিনটি বাইনারি ভেরিয়েবল দ্বারা।
it_it: Dopo la conversione, le variabili intere :math:` z ` sono sostituite con tre variabili binarie :math:` z\text {@} 0 `, :math:` z\text {@} 1 ` e :math:` z\text {@} 2 ` con coefficienti 1, 2 e 4, rispettivamente come sopra. Le variabili slack :math:` xyz\_leq\text {@} int\_slack ` e :math:` xyz\_geq\text {@} int\_slack ` che sono state introdotte da ``InequalityToEquality`` sono anche sostituite con tre variabili binarie con coefficienti 1, 2, 2 e 1, 2, 3, rispettivamente.
tr_tr: Dönüştürdükten sonra, tam sayı değişkeni :math:`z` nin yeri, aşağıdaki şekilde sırasıyla 1, 2 ve 4 katsayılarıyla birlikte üç ikili sistem değişkeni :math:`z\text{@}0`, :math:`z\text{@}1` ve :math:`z\text{@}2` nin yeri ile değiştirilir. ``InequalityToEquality`` ile tanıtılan gevşek değişkenler :math:`xyz\_leq\text{@}int\_slack` ve :math:`xyz\_geq\text{@}int\_slack` nin yerleri de sırasıyla 1, 2, 2 ve 1, 2, 3 katsayılarıyla birlikte üç ikili sistem değişkeninin yeri ile değiştirilir.
vi_vn: Sau khi chuyển đổi, biến thập phân :math:`z` được thay thế với ba biến nhị phân :math:`z\text{@}0`, :math:`z\text{@}1` và :math:`z\text{@}2` với hệ số lần lượt là 1, 2 và 4. Biến bù :math:`xyz\_leq\text{@}int\_slack` và :math:`xyz\_geq\text{@}int\_slack` được đưa vào bởi ``InequalityToEquality`` được thế bởi ba biến nhị phân với hệ số lần lượt là 1, 2, 2, và 1, 2, 3.
