Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/02_converters_for_quadratic_programs.po
Languages: bn_bn, es_un, it_it, ja, ko, ta_in, te, th, tr_tr, vi_vn

source: This page was generated from `docs/tutorials/02_converters_for_quadratic_programs.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/02_converters_for_quadratic_programs.ipynb`__ থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `docs/tutorials/02_converters_for_quadratic_programs.ipynb`__.
ja: このページは `docs/tutorials/02_converters_for_quadratic_programs.ipynb`__ から生成されました。
ko: 이 페이지는 `docs/tutorials/02_converters_for_quadratic_programs.ipynb`__ 에서 생성되었다.
ta_in: இந்தப் பக்கம் `docs/tutorials/02_converters_for_quadratic_programs.ipynb` இதிலிருந்து உருவாக்கப்பட்டது __.
te: ఈ పేజీ `docs/tutorials/02_converters_for_quadratic_programs.ipynb`__ నుండి రూపొందించబడింది.
th: หน้านี้สร้างขึ้นมาจาก `docs/tutorials/02_converters_for_quadratic_programs.ipynb`__
tr_tr: Bu sayfa, `docs/tutorials/02_converters_for_quadratic_programs.ipynb`__ sayfasından oluşturulmuştur.

source: Converters for Quadratic Programs
bn_bn: দ্বিঘাত (কোয়াড্রাটিক) প্রোগ্রামগুলির জন্য পরিবর্তক (কনভার্টার)
es_un: Conversores para Programas Cuadráticos
it_it: Convertitori per Programmi Quadratici
ja: 二次計画法のコンバーター
ko: 이차계획법을 위한 변환기
ta_in: Quadratic நிரல்களுக்கான மாற்றிகள்
te: Quadratic ప్రోగ్రాముల కొరకు కన్వర్టర్లు
th: ตัวแปลงสำหรับ Quadratic Program
tr_tr: İkinci Dereceden Programlar için Dönüştürücüler
vi_vn: Bộ chuyển đổi cho các chương trình bậc hai

source: Optimization problems in Qiskit’s optimization module are represented with the ``QuadraticProgram`` class, which is a generic and powerful representation for optimization problems. In general, optimization algorithms are defined for a certain formulation of a quadratic program, and we need to convert our problem to the right type.
ja: Qiskitの最適化モジュールの最適化問題は、 ``QuadraticProgram`` クラスで表されます。これは、最適化問題の一般的で強力な表現です。一般に、最適化アルゴリズムは二次計画法の特定の定式化に対して定義されており、問題を適切なタイプに変換する必要があります。
ta_in: Qiskit -இன் மேம்படுத்தல் தொகுதியில் உள்ள மேம்படுத்தல் சிக்கல்கள் ``QuadraticProgram`` வகுப்பில் குறிப்பிடப்படுகின்றன, இது தேர்வுமுறை சிக்கல்களுக்கான பொதுவான மற்றும் சக்திவாய்ந்த பிரதிநிதித்துவமாகும். பொதுவாக, தேர்வுமுறை அல்காரிதம்கள் ஒரு இருபடி நிரலின் ஒரு குறிப்பிட்ட உருவாக்கத்திற்காக வரையறுக்கப்படுகின்றன, மேலும் நமது சிக்கலை சரியான வகைக்கு மாற்ற வேண்டும்.
th: โจทย์ปัญหา Optimization ในโมดูล Qiskit Optimization ถูกแสดงด้วยคลาส ``QuadraticProgram`` ซึ่งเป็นตัวแทนของโจทย์ปัญหาที่มีประสิทธิภาพอย่างมาก โดยทั่วไปแล้วอัลกอริทึมสำหรับการทำ Optimization หนึ่ง ถูกกำหนดให้ใช้งานกับกำหนดการกำลังสองรูปแบบหนึ่งเท่านั้น ดังนั้นเราต้องแปลงโจทย์ปัญหาของเราให้อยู่ในรูปแบบที่ถูกต้องสำหรับอัลกอริทึมนั้น ๆ ให้ได้

source: For instance, Qiskit provides several optimization algorithms that can handle `Quadratic Unconstrained Binary Optimization <https://en.wikipedia.org/wiki/Quadratic_unconstrained_binary_optimization>`__ (QUBO) problems. These are mapped to Ising Hamiltonians, for which Qiskit uses the ``qiskit.opflow`` module, and then their ground state is approximated. For this optimization, commonly known algorithms such as VQE or QAOA can be used as underlying routine. See the following tutorial about the `Minimum Eigen Optimizer <./03_minimum_eigen_optimizer.ipynb>`__ for more detail. Note that also other algorithms exist that work differently, such as the ``GroverOptimizer``.
ja: たとえば、Qiskit は、 `Quadratic Unconstrained Binary Optimization <https://en.wikipedia.org/wiki/Quadratic_unconstrained_binary_optimization>`__ （QUBO）問題を処理できるいくつかの最適化アルゴリズムを提供します。これらは、Qiskit が ``qiskit.opflow`` モジュールを使用するイジングハミルトニアンにマッピングされ、基底状態が近似されます。この最適化では、VQE や QAOA などの一般的に知られているアルゴリズムを基礎となるルーチンとして使用できます。詳細については、 `Minimum Eigen Optimizer <./03_minimum_eigen_optimizer.ipynb>`__ に関するチュートリアルを参照してください。 ``GroverOptimizer`` など、動作が異なる他のアルゴリズムも存在することに注意してください。
ta_in: உதாரணமாக, Qiskit பல தேர்வுமுறை அல்காரிதம்களை வழங்குகிறது, அவை `Quadratic Unconstrained Binary Optimization <https://en.wikipedia.org/wiki/Quadratic_unconstrained_binary_optimization>`__ (QUBO) சிக்கல்களைக் கையாள முடியும். இவை ஐசிங் ஹாமில்டோனியன்களுக்கு வரைபடமாக்கப்பட்டுள்ளன, இதற்காக Qiskit, ``qiskit.opflow`` தொகுதியைப் பயன்படுத்துகிறது, பின்னர் அவற்றின் அடி நிலை தோராயமாக இருக்கும். இந்த தேர்வுமுறைக்கு, VQE அல்லது QAOA போன்ற பொதுவாக அறியப்பட்ட வழிமுறைகளை அடிப்படை வழக்கமாகப் பயன்படுத்தலாம். மேலும் விவரங்களுக்கு `Minimum Eigen Optimizer <./03_minimum_eigen_optimizer.ipynb>`__ பற்றிய பின்வரும் டுடோரியலைப் பார்க்கவும். ``GroverOptimizer`` போன்ற வேறுவிதமாக வேலை செய்யும் பிற வழிமுறைகளும் உள்ளன என்பதை நினைவில் கொள்ளவும்.
te: ఉదాహరణకు, Qiskit అనేక ఆప్టిమైజేషన్ అల్గారిథమ్‌లను అందిస్తుంది, అది `క్వాడ్రాటిక్ అన్‌కన్‌స్ట్రెయిన్డ్ బైనరీ ఆప్టిమైజేషన్ <https://en.wikipedia.org/wiki/Quadratic_unconstrained_binary_optimization>`__ (QUBO) సమస్యలను నిర్వహించగలదు. ఇవి ఐసింగ్ హామిల్టోనియన్‌లకు మ్యాప్ చేయబడ్డాయి, దీని కోసం Qiskit ``qiskit.opflow`` మాడ్యూల్‌ను ఉపయోగిస్తుంది, ఆపై వాటి గ్రౌండ్ స్టేట్ సుమారుగా ఉంటుంది. ఈ ఆప్టిమైజేషన్ కోసం, VQE లేదా QAOA వంటి సాధారణంగా తెలిసిన అల్గారిథమ్‌లను అంతర్లీన దినచర్యగా ఉపయోగించవచ్చు. మరిన్ని వివరాల కోసం `కనీస ఐగేన్ ఆప్టిమైజర్ <./03_minimum_eigen_optimizer.ipynb>`__ గురించిన క్రింది ట్యుటోరియల్‌ని చూడండి. విభిన్నంగా పని చేసే ``GroverOptimizer`` వంటి ఇతర అల్గారిథమ్‌లు కూడా ఉన్నాయని గమనించండి.
th: ตัวอย่างเช่น ใน Qiskit มีอัลกอริทึม Optimization อยู่หลายตัวที่สามารถแก้โจทย์ปัญหา `Quadratic Unconstrained Binary Optimization <https://en.wikipedia.org/wiki/Quadratic_unconstrained_binary_optimization>`__ (QUBO) ซึ่งจะถูกแปลงเป็น Ising Hamiltonian ก่อนด้วยโมดูล ``qiskit.opflow`` และนำมาประมาณค่าสถานะพื้น อัลกอริทึม Optimization พื้นฐานที่สามารถใช้งานได้เช่น VQE หรือ QAOA สามารถศึกษาเพิ่มเติมได้จากบทแนะนำ `Minimum Eigen Optimizer <./03_minimum_eigen_optimizer.ipynb>`__ หมายเหตุ ยังมีอัลกอริทึมอื่น ๆ ที่สามารถใช้งานได้อีกเช่น ``GroverOptimizer``

source: To map a problem to the correct input format, the optimization module of Qiskit offers a variety of converters. In this tutorial we’re providing an overview on this functionality. Currently, Qiskit contains the following converters.
ja: 問題を正しい入力形式にマッピングするために、Qiskit の最適化モジュールはさまざまなコンバーターを提供します。当チュートリアルでは、この機能の概要を説明します。現在、Qiskit には次のコンバーターが含まれています。
ta_in: ஒரு சிக்கலை சரியான உள்ளீட்டு வடிவமைப்பிற்கு வரைபடமாக்க, Qiskit இன் தேர்வுமுறைத் தொகுதி பல்வேறு மாற்றிகளை வழங்குகிறது. இந்த டுடோரியலில் இந்த செயல்பாடு குறித்த மேலோட்டத்தை வழங்குகிறோம். தற்போது, ​​Qiskit பின்வரும் மாற்றிகளைக் கொண்டுள்ளது.
th: ในการแปลงโจทย์ปัญหาให้อยู่ในรูปแบบที่ถูกต้อง โมดูลสำหรับการทำ Optimization ของ Qiskit มีตัวแปลงให้อยู่หลายตัวด้วยกัน ในบทแนะนำนี้เราพูดถึงภาพรวมของฟังก์ชันตัวแปลงที่มีให้ใช้งานใน Qiskit ดังนี้

source: ``InequalityToEquality``: convert inequality constraints into equality constraints with additional slack variables.
es_un: ``InequalityToEquality``: convertir restricciones de desigualdad en restricciones de igualdad con variables de holgura (slack) adicionales.
ja: ``InequalityToEquality`` ：不等式制約を追加のスラック変数を使用した等式制約に変換します。
ko: ``InequalityToEquality``: 추가적인 여유변수들을 사용하여 부등식 제약 조건을 등식 제약 조건으로 변환한다.
te: ``InequalityToEquality ``: అదనపు స్లాక్ వేరియబుల్స్‌తో అసమానత పరిమితులను సమానత్వ పరిమితులుగా మార్చండి.
th: ``InequalityToEquality``: แปลงสมการข้อจำกัดที่อยู่ในรูปแบบอสมการ ให้เป็นสมการโดยเพิ่มเติมตัวแปรส่วนขาด

source: ``IntegerToBinary``: convert integer variables into binary variables and corresponding coefficients.
es_un: ``IntegerToBinary``: convertir variables enteras en variables binarias y los coeficientes correspondientes.
ja: ``IntegerToBinary`` ：整数変数をバイナリ変数と対応する係数に変換します。
ko: ``IntegerToBinary``: 정수형 변수들을 이진 변수들과 대응되는 계수들로 변환한다.
te: ``IntegerToBinary ``: integer వేరియబుల్స్‌ను బైనరీ వేరియబుల్స్‌గా మరియు సంబంధిత కోఎఫీషియంట్స్‌గా మార్చండి.
th: ``IntegerToBinary``: แปลงตัวแปรจำนวนเต็มเป็นตัวแปรไบนารี่และค่าสัมประสิทธิ์

source: ``LinearEqualityToPenalty``: convert equality constraints into additional terms of the objective function.
es_un: ``LinearEqualityToPenalty``: convertir las restricciones de igualdad en términos adicionales de la función objetivo.
ja: ``LinearEqualityToPenalty`` ：等式制約をオブジェクト関数の追加の項に変換します。
ko: ``LinearEqualityToPenalty``: 등식 제약 조건을 목적 함수의 추가 조건으로 변환한다.
te: ` LinearEqualityToPenalty ` `: సమానత్వ పరిమితులను ఆబ్జెక్టివ్ ఫంక్షన్ యొక్క అదనపు పదాలుగా మార్చండి.
th: ``LinearEqualityToPenalty``: แปลงสมการข้อจำกัดเพิ่มลงในส่วนฟังก์ชันวัตถุประสงค์

source: ``LinearInequalityToPenalty``: convert inequality constraints into additional terms of the objective function.
es_un: ``LinearInequalityToPenalty``: convertir las restricciones de desigualdad en términos adicionales de la función objetivo.
ja: ``LinearEqualityToPenalty`` ：等式制約をオブジェクト関数の追加の項に変換します。
ko: ``LinearInequalityToPenalty``: 부등식 제약 조건을 목적 함수의 추가적인 항들로 변환한다.
te: ` ` LinearInequalityToPenalty ` `: అసమానత పరిమితులను ఆబ్జెక్టివ్ ఫంక్షన్ యొక్క అదనపు పదాలుగా మార్చండి.
th: ``LinearInequalityToPenalty``: แปลงอสมการข้อจำกัดเพิ่มลงในส่วนฟังก์ชันวัตถุประสงค์

source: ``MaximizeToMinimize``: convert to the equivalent minimization problem.
es_un: ``MaximizeToMinimize``: convertir al problema de minimización equivalente.
ja: ``MaximizeToMinimize``: 等価最小化問題に変換します。
ko: ``MaximizeToMinimize``: 동등한 최소화 문제로 변환한다.
te: ` ` MaximizeToMinimize ` `: సమానమైన కనిష్టీకరణ సమస్యకు మార్చండి.
th: ``MaximizeToMinimize``: แปลงโจทย์ปัญหาจากหาค่าสูงสุดเป็นหาค่าต่ำสุด

source: ``MinimizeToMaximize``: convert to the equivalent maximization problem.
es_un: ``MinimizeToMaximize``: convertir al problema de maximización equivalente.
ja: ``MinimizeToMaximize``: 等価最大化問題に変換します。
ko: ``MinimizeToMaximize``: 동등한 최대화 문제로 변환한다.
te: ` ` 'MinimizeToMaximize `: సమానమైన గరిష్టీకరణ సమస్యకు మార్చండి.
th: ``MinimizeToMaximize``: แปลงโจทย์ปัญหาจากหาค่าต่ำสุดเป็นหาค่าสูงสุด

source: ``QuadraticProgramToQubo``: a wrapper that includes ``InequalityToEquality``, ``IntegerToBinary``, ``LinearEqualityToPenalty``, ``LinearInequalityToPenalty``, and ``MaximizeToMinimize`` for convenience.
es_un: ``QuadraticProgramToQubo``: un contenedor que incluye ``InequalityToEquality``, ``IntegerToBinary``, ``LinearEqualityToPenalty``, ``LinearInequalityToPenalty`` y ``MaximizeToMinimize`` por conveniencia.
ja: ``QuadraticProgramToQubo`` : ``InequalityToEquality`` 、 ``IntegerToBinary`` 、 ``LinearEqualityToPenalty`` 、 ``LinearInequalityToPenalty`` 、``MaximizeToMinimize`` などが含まれている。
ko: ``QuadraticProgramToQubo``: 편의상 ``InequalityToEquality``, ``IntegerToBinary``, ``LinearEqualityToPenalty``, ``LinearInequalityToPenalty``, ``MaximizeToMinimize`` 를 포함하고 있는 것이다.
te: ``QuadraticProgramToQubo``: ``InequalityToEquality``, ``IntegerToBinary``, ``LinearEqualityToPenalty``, ``LinearInequalityToPenalty``, మరియు ``MaximizeToMinimize`` వంటి వాటిని కలిగి ఉండే రేపర్.
th: ``QuadraticProgramToQubo``: เป็น Wrapper ที่คลอบคลุมทั้ง ``InequalityToEquality``, ``IntegerToBinary``, ``LinearEqualityToPenalty``, ``LinearInequalityToPenalty`` และ ``MaximizeToMinimize`` เพื่อความสะดวกในการใช้งาน

source: ``InequalityToEqualityConverter`` converts inequality constraints into equality constraints with additional slack variables to remove inequality constraints from ``QuadraticProgram``. The upper bounds and the lower bounds of slack variables will be calculated from the difference between the left sides and the right sides of constraints. Signs of slack variables depend on symbols in constraints such as :math:`\leq` and :math:`\geq`.
bn_bn: ``InequalityToEqualityConverter`` টি ``QuadraticProgram`` থেকে অসমতার সীমাবদ্ধতা অপসারণ করতে অতিরিক্ত স্ল্যাক চল রাশির সাথে অসমতার সীমাবদ্ধতায় রূপান্তর করে। উপরের সীমা (আবদ্ধ) এবং স্ল্যাক ভেরিয়েবলের নিম্নসীমা বাম দিক এবং সীমাবদ্ধতার ডান দিকের পার্থক্য থেকে গণনা করা হবে। স্ল্যাক চল রাশির চিহ্নগুলি :math:`\leq` এবং :math:`\geq` এর মতো সীমাবদ্ধতার মধ্যে চিহ্নগুলির উপর নির্ভর করে।
es_un: ``InequalityToEqualityConverter`` convierte las restricciones de desigualdad en restricciones de igualdad con variables de holgura adicionales para eliminar las restricciones de desigualdad del ``QuadraticProgram``. Los límites superiores y los límites inferiores de las variables de holgura se calcularán a partir de la diferencia entre el lado izquierdo y el lado derecho de las restricciones. Los signos de las variables de holgura dependen de los símbolos en restricciones como :math:`\leq` y :math:`\geq`.
it_it: ``InequalityToEqualityConverter`` converte i vincoli di disuguaglianza in vincoli di uguaglianza con variabli di slack aggiuntive per eliminare i vincoli di disuguaglianza da ``QuadraticProgram``. I limiti superiore ed inferiore delle variabili di slack saranno calcolati a partire dalla differenza tra i vincoli destro e sinistro. I segni delle variabili di slack dipendono da simboli in vincoli quali :math:`\leq` and :math:`\geq`.
ja: ``InequalityToEqualityConverter`` は、不等式制約を追加のスラック変数を使用して等式制約に変換し、 ``QuadraticProgram`` から不等式制約を削除します。スラック変数の上限と下限は、制約の左側と右側の差から計算されます。スラック変数の符号は、 :math:`\leq` や :math:`\geq` などの制約内の記号に依存します。
ko: ``QuadraticProgram`` 에서 부등식의 제약조건을 제거하기 위하여 ``InequalityToEqualityConverter`` 는 여유변수(slack variable)를 추가함으로써 부등식을 등식으로 변환시킨다. 여유변수의 상한과 하한은 식의 좌변과 우변의 차이로 계산된다. 여유변수의 부호는 :math:`\leq` 와 :math:`\geq` 같이 부등호에 의하여 결정된다.
ta_in: ``QuadraticProgram`` இதிலிருந்து ``InequalityToEqualityConverter`` சமத்துவமின்மை தடைகளை கூடுதல் மந்தமான மாறிகள் கொண்ட சமத்துவ தடைகளாக மாற்றுகிறது.இடது பக்கங்களுக்கும் கட்டுப்பாடுகளின் வலது பக்கங்களுக்கும் இடையிலான வேறுபாட்டிலிருந்து மேல் எல்லைகள் மற்றும் மந்தமான மாறிகளின் கீழ் எல்லைகள் கணக்கிடப்படும். மந்தமான மாறிகளின் அறிகுறிகள் :math:`\leq`மற்றும்:math:`\geq` போன்ற கட்டுப்பாடுகளில் உள்ள குறியீடுகளைப் பொறுத்தது.
te: ``QuadraticProgram`` నుండి అసమానత పరిమితులను తొలగించడానికి అదనపు స్లాక్ వేరియబుల్స్‌తో అసమానత పరిమితులను సమానత్వ పరిమితులుగా మారుస్తుంది. స్లాక్ వేరియబుల్స్ యొక్క ఎగువ సరిహద్దులు మరియు దిగువ సరిహద్దులు పరిమితుల యొక్క ఎడమ వైపుల మరియు కుడి వైపుల మధ్య వ్యత్యాసం నుండి లెక్కించబడతాయి. స్లాక్ వేరియబుల్స్ సంకేతాలు :math:`\leq` మరియు :math:`\geq` వంటి పరిమితుల్లోని చిహ్నాలపై ఆధారపడి ఉంటాయి.
th: ``InequalityToEqualityConverter`` เป็นตัวแปลงจากอสมการข้อจำกัดไปเป็นสมการข้อจำกัดด้วยตัวแปรส่วนขาดเพิ่มเติมเพื่อนำอสมการข้อจำกัดออกจาก ``QuadraticProgram`` ขอบเขตบนและขอบเขตล่างของตัวแปรเพิ่มเติมจะคำนวณมาจากความแตกต่างระหว่างพจน์ด้านซ้ายและด้านขวาของสมการข้อจำกัด เครื่องหมายของตัวแปรจะขึ้นอยู่กับสัญลักษณะในอสมการว่าเป็น :math:`\leq` หรือ :math:`\geq`
tr_tr: ``InequalityToEqualityConverter``, eşitsizlik kısıtlamalarını ``QuadraticProgram``dan eşitsizlik kısıtlamalarını kaldırmak için ek durağan değişkenlerle eşitlik kısıtlamalarına dönüştürür. Durağan değişkenlerin üst sınırları ve alt sınırları, kısıtlamaların sol tarafları ile sağ tarafları arasındaki farktan hesaplanacaktır. Durağan değişkenlerin işaretleri, :math:`\leq` ve :math:`\geq` gibi kısıtlamalardaki sembollere bağlıdır.
vi_vn: ``InequalityToEqualityConverter`` chuyển một ràng buộc bất bình đẳng sang ràng buộc bình đẳng với các biến bù để có thể loại bỏ các ràng buộc bất bình đẳng trong ``QuadraticProgram``. Giới hạn trên và giới hạn dưới của biến bù sẽ được tính toán từ hiệu hai vế trái và phải của ràng buộc. Dấu của biến bù tùy thuộc vào ràng buộc, ví dụ :math:`\leq` và :math:`\geq`.

source: The following is an example of a maximization problem with two inequality constraints. Variable :math:`x` and :math:`y` are binary variables and variable :math:`z` is an integer variable.
bn_bn: নীচে দুটি অসমতার সীমাবদ্ধতার সাথে সর্বাধিক সমস্যার একটি উদাহরণ রয়েছে। চল রাশি :math:`x` এবং :math:`y` বাইনারি চল রাশি এবং চল রাশি : :math:`z` একটি পূর্ণসংখ্যার চল রাশি ।
es_un: A continuación se muestra un ejemplo de un problema de maximización con dos restricciones de desigualdad. Las variables :math:`x` y :math:`y` son variables binarias y la variable :math:`z` es una variable entera.
it_it: Il seguente è un esempio di un problema di massimizzazione con due vincoli di disuguaglianza. La variabile :math:`x` e :math:`y` sono variabili binarie e la variabile :math:`z` è una variabile intera.
ja: 以下は、2つの不等式制約がある最大化問題の例です。 変数 :math:`x` と :math:`y` はバイナリ変数であり、変数 :math:`z` は整数変数です。
ko: 다음은 부등식 제약조건이 2 개인 최대화 문제의 예이다. 변수 :math:`x` 와 :math:`y` 는 이진 변수이고 변수 :math:`z` 는 정수 변수이다.
ta_in: இரண்டு சமத்துவமின்மை தடைகளுடன் கூடிய அதிகபட்ச சிக்கலுக்கு பின்வருவது ஒரு எடுத்துக்காட்டு. மாறி:math:`x`மற்றும்:math:`y`பைனரி மாறிகள் மற்றும் மாறி :math:`z`ஒரு முழு எண் மாறி.
te: కిందిది రెండు అసమానత పరిమితులతో గరిష్టీకరణ సమస్యకు ఉదాహరణ. వేరియబుల్ :math:`x` మరియు :math:`y` అనేది బైనరీ వేరియబుల్స్ మరియు వేరియబుల్ :math:`z` అనేది integer వేరియబుల్.
th: ตัวอย่างของโจทย์ปัญหาหาค่าสูงที่สุดโดยที่มีอสมการข้อจำกัด 2 สมการ ตัวแปรตัวแปร :math:`x` และ :math:`y` เป็นตัวแปรไบนารี่ และ ตัวแปร :math:`z`เป็นตัวแปรจำนวนเต็ม
tr_tr: Aşağıdaki, iki eşitsizlik kısıtlaması olan bir maksimizasyon probleminin bir örneğidir. Değişken :math:`x` ve :math:`y` ikili değişkenlerdir ve değişken :math:`z` bir tamsayı değişkendir.
vi_vn: Ví dụ tiếp theo là bài toán tối đa hóa với 2 ràng buộc. Biến :math:`x` và :math:`y` là hai biến nhị phân và biến :math:`z` là một biến số nguyên.

source: With ``QuadraticProgram``, an optimization model of the problem is written as follows.
bn_bn: ``QuadraticProgram`` এর সাহায্যে সমস্যার একটি অপ্টিমাইজেশন মডেল নীচে লেখা আছে।
es_un: Con ``QuadraticProgram``, un modelo de optimización del problema se escribe de la siguiente manera.
it_it: Con ``QuadraticProgram``, un modello di ottimizzazione del problema è scritto come segue.
ja: ``QuadraticProgram`` では、問題の最適化モデルを次のように記述します。
ko: ``QuadraticProgram`` 을 이용하여 작성한 최적화 문제의 모델은 다음과 같다.
ta_in: ``QuadraticProgram`` உடன், சிக்கலின் தேர்வுமுறை மாதிரி பின்வருமாறு எழுதப்பட்டுள்ளது.
te: ``QuadraticProgram`` తో, సమస్య యొక్క ఆప్టిమైజేషన్ మోడల్ క్రింది విధంగా వ్రాయబడుతుంది.
th: ด้วย ``QuadraticProgram`` โมเดล Optimization สำหรับโจทย์ปัญหาสามารถเขียนออกมาได้ดังนี้
tr_tr: ``QuadraticProgram`` ile bu problemin optimizasyon modeli aşağıdaki gibi yazılır.
vi_vn: Với ``QuadraticProgram``, một mô hình tối ưu hóa được viết như sau.

source: Call ``convert`` method of ``InequalityToEquality`` to convert.
bn_bn: রূপান্তর করতে ``InequalityToEquality` এর ``convert`` পদ্ধতিটি কল করুন।
es_un: Llama al método ``convert`` de ``InequalityToEquality`` para convertirlo.
it_it: Chiama il metodo ``convert`` di ``InequalityToEquality`` per effettuare la conversione.
ja: 変換するには ``IntegerToBinary`` の ``convert`` メソッドを呼び出します。
ko: 모델을 변환하기 위하여 ``InequalityToEquality`` 의 ``convert`` 메서드를 아래와 같이 호출한다.
ta_in: அழைப்பு``convert``முறை ``InequalityToEquality``மாற்று.
te: మార్చడానికి ``InequalityToEquality`` యొక్క ``convert`` పద్ధతిని కాల్ చేయండి.
th: เรียกใช้ Method ``convert`` จาก ``InequalityToEquality`` เพื่อแปลง
tr_tr: Dönüştürmek için ``InequalityToEquality`` nin ``convert`` yöntemini çağırın.
vi_vn: Gọi phương thức ``convert`` của ``InequalityToEquality`` để chuyển đổi.

source: After converting, the formulation of the problem looks like the above output. As we can see, the inequality constraints are replaced with equality constraints with additional integer slack variables, :math:`xyz\_leg\text{@}int\_slack` and :math:`xyz\_geq\text{@}int\_slack`.
es_un: Después de la conversión, la formulación del problema se parece al resultado anterior. Como podemos ver, las restricciones de desigualdad se reemplazan con restricciones de igualdad con variables de holgura (variables slack) enteras adicionales, :math:`xyz\_leg\text{@}int\_slack` y :math:`xyz\_geq\text{@}int\_slack`.
ja: 変換後、問題の定式化は上記の出力のようになります。ご覧のとおり、不等式制約は、整数のスラック変数 :math:`xyz\_leg\text{@}int\_slack` と :math:`xyz\_geq\text{@}int\_slack` が追加された等式制約に置き換えられています。
ko: 변환 후, 문제의 정의식은 위의 출력과 같다. 위에서 확인할 수 있듯이, 부등식 제약 조건들은 :math:`xyz\_leg\text{@}int\_slack` and :math:`xyz\_geq\text{@}int\_slack` 를 추가적인 정수형 여유변수들로 갖는 등식 제약 조건들로 대체된다.
ta_in: மாற்றிய பிறகு, சிக்கலின் உருவாக்கம் மேலே உள்ள வெளியீடு போல் தெரிகிறது. நாம் பார்க்கிறபடி, சமத்துவமில்லாக் கட்டுப்பாடுகளுக்குப் பதிலாக சமத்துவக் கட்டுப்பாடுகள் கூடுதல் முழு எண் ஸ்லாக் மாறிகள் :math:`xyz\_leg\text{@}int\_slack` மற்றும் :math:`xyz\_geq\text{@}int\_slack` மாற்றப்பட்டது.
te: మార్చిన తర్వాత, సమస్య యొక్క సూత్రీకరణ పై అవుట్‌పుట్ వలె కనిపిస్తుంది. మనం చూడగలిగినట్లుగా, అసమానత పరిమితులు అదనపు integer స్లాక్ వేరియబుల్స్‌తో సమానత్వ పరిమితులతో భర్తీ చేయబడ్డాయి, :math:`xyz\_leg\text{@}int\_slack` మరియు :math:`xyz\_geq\text{@}int\_slack`.
th: สมการของโจทย์ปัญหาที่ได้จะมีลักษณะตามผลลัพธ์ด้านบน จากที่เห็นอสมการข้อจำกัดจะถูกแทนที่ด้วยสมการข้อจำกัดและตัวแปรส่วนขาดเพิ่มเติม :math:`xyz\_leg\text{@}int\_slack` and :math:`xyz\_geq\text{@}int\_slack`
