Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/03_minimum_eigen_optimizer.po
Languages: bn_bn, es_un, ja, ko, pt_un, ta_in, te, th

source: Then, we use the ``MinimumEigensolver`` to create ``MinimumEigenOptimizer``.
bn_bn: তারপরে, আমরা "MinimumEigenOptimizer" তৈরি করতে "MinimumEigensolver" ব্যবহার করি।
es_un: Luego, usamos el ``MinimumEigensolver`` para crear un ``MinimumEigenOptimizer``.
ja: 次に、``MinimumEigensolver`` を使用して ``MinimumEigenOptimizer`` を作成します。
ko: 이후 ``MinimumEigenOptimizer`` 를 생성하기 위하여 ``MinimumEigensolver`` 를 사용한다.
pt_un: Em seguida, utilizamos o ``MinimumEigensolver`` para criar o ``MinimumEigenOptimizer``.
ta_in: பின்னர், நாங்கள் ``MinumEigenOptimizer`` ஐ உருவாக்க ``MinimumEigensolver`` ஐ பயன்படுத்துகிறோம்.
te: అప్పుడు, మేము ``MinimumEigenOptimizer``ని సృష్టించడానికి ``MinimumEigensolver``ని ఉపయోగిస్తాము.
th: จากนั้นเราใช้ ``MinimumEigensolver`` ในการสร้าง ``MinimumEigenOptimizer``

source: We first use the ``MinimumEigenOptimizer`` based on the classical exact ``NumPyMinimumEigensolver`` to get the optimal benchmark solution for this small example.
bn_bn: এই ছোট উদাহরণের জন্য সর্বোত্তম মানদণ্ড সমাধান পেতে আমরা প্রথমে শাস্ত্রীয় সঠিক ``NumPyMinimumEigensolver`` এর উপর ভিত্তি করে ``MinimumEigenOptimizer`` ব্যবহার করি।
es_un: Primero usamos el ``MinimumEigenOptimizer`` basado en el ``NumPyMinimumEigensolver`` exacto clásico para obtener la solución de referencia óptima para este pequeño ejemplo.
ja: 最初に、古典的で厳密な ``NumPyMinimumEigensolver`` に基づいた ``MinimumEigenOptimizer`` を使用して、この小さな例に対してベンチマークとなる最適解を求めます。
ko: 우리는 이 작은 사례를 위한 최적의 벤치마크 솔루션을 얻기 위해 클래식의 정확한 ``NumPyMinimumEigensolver`` 를 기반으로 하는 ``MinimumEigenOptimizer`` 을 처음 사용한다.
pt_un: Utilizamos primeiramente o ``MinimumEigenOptimizer`` baseado no ``NumPyMinimumEigensolver`` clássico exato para obter a solução de referência ideal para este pequeno exemplo.
ta_in: இந்த சிறிய எடுத்துக்காட்டுக்கு உகந்த பெஞ்ச்மார்க் தீர்வைப் பெற கிளாசிக்கல் துல்லியமான ``NumPyMinimumEigensolver`` அடிப்படையிலான ``MinimumEigenOptimizer`` ஐ முதலில் பயன்படுத்துகிறோம்.
te: ఈ చిన్న ఉదాహరణ కోసం సరైన బెంచ్‌మార్క్ సొల్యూషన్‌ను పొందడానికి మేము ముందుగా క్లాసికల్ ఖచ్చితమైన ``NumPyMinimumEigensolver`` ఆధారంగా ``MinimumEigenOptimizer`ని ఉపయోగిస్తాము.
th: อันดับแรกเราใช้ ``MinimumEigenOptimizer`` จากอัลกอริทึมแบบดั้งเดิม ``NumPyMinimumEigensolver`` เพื่อให้ได้คำตอบที่ถูกต้องที่สุดสำหรับตัวอย่างขนาดเล็กนี้

source: Next we apply the ``MinimumEigenOptimizer`` based on ``QAOA`` to the same problem.
bn_bn: পরবর্তীতে আমরা একই সমস্যার জন্য ``QAOA`` এর উপর ভিত্তি করে ``MinimumEigenOptimizer`` প্রয়োগ করি।.
es_un: A continuación aplicamos el ``MinimumEigenOptimizer`` basado en ``QAOA`` al mismo problema.
ja: 次に、同じ問題に対して、``QAOA`` に基づいた ``MinimumEigenOptimizer`` を適用します。
ko: 다음으로 동일한 문제에 대하여 ``QAOA`` 를 기반으로한 ``MinimumEigenOptimizer`` 를 적용한다.
pt_un: A seguir, aplicamos o ``MinimumEigenOptimizer`` baseado no ``QAOA`` para o mesmo problema.
ta_in: அடுத்து, அதே சிக்கலுக்கு 'QAOA' அடிப்படையில் ``MinimumEigenOptimizer`` ஐப் பயன்படுத்துகிறோம்.
te: తర్వాత మనం అదే సమస్యకు ``QAOA`` ఆధారంగా ``MinimumEigenOptimizer``ని వర్తింపజేస్తాము.
th: ต่อไปเราใช้ ``MinimumEigenOptimizer`` ซึ่งเป็นอัลกอริทึม ``QAOA`` ในการแก้ปัญหาเดียวกันนี้

source: Analysis of Samples
bn_bn: নমুনা (স্যাম্পল) এর বিশ্লেষণ
es_un: Análisis de Muestras
ja: サンプルの分析
ko: 샘플 분석하기
pt_un: Análise dos resultados
ta_in: மாதிரிகளின் பகுப்பாய்வு
te: నమూనాలు విశ్లేషణ
th: วิเคราะห์ผลลัพธ์ตัวอย่าง

source: ``OptimizationResult`` provides useful information in the form of ``SolutionSample``\ s (here denoted as *samples*). Each ``SolutionSample`` contains information about the input values (``x``), the corresponding objective function value (``fval``), the fraction of samples corresponding to that input (``probability``), and the solution ``status`` (``SUCCESS``, ``FAILURE``, ``INFEASIBLE``). Multiple samples corresponding to the same input are consolidated into a single ``SolutionSample`` (with its ``probability`` attribute being the aggregate fraction of samples represented by that ``SolutionSample``).
es_un: ``OptimizationResult`` proporciona información útil en forma de ``SolutionSample``\ s (aquí indicado como *muestras*). Cada ``SolutionSample`` contiene información sobre los valores de entrada (``x``), el valor de la función objetivo correspondiente (``fval``), la fracción de muestras correspondiente a esa entrada (``probability``) y la solución ``status`` (``SUCCESS``, ``FAILURE``, ``INFEASIBLE``). Múltiples muestras correspondientes a la misma entrada se consolidan en una sola ``SolutionSample`` (siendo su atributo ``probability`` la fracción agregada de muestras representada por esa ``SolutionSample``).
ja: ``OptimizationResult`` は、 ``SolutionSample`` （ここでは *samples* と表記）の形式で有用な情報を提供します。 各 ``SolutionSample`` には、入力値（ ``x`` ）、対応する目的関数値（ ``fval`` ）、その入力に対応するサンプルの割合（ ``probability`` ）、およびソリューションのステータス（ ``SUCCESS`` 、 ``FAILURE`` 、 ``INFEASIBLE`` ）に関する情報が含まれています。 同じ入力に対応する複数のサンプルが単一の ``SolutionSample`` に統合されます（その ``probability`` 属性は、その ``SolutionSample`` によって表されるサンプルの総計です）。
ko: ``OptimizationResult`` 는 ``SolutionSample`` 의 형태로 유용한 정보를 제공한다. 각각의 ``SolutionSample`` 에는 입력값 (``x``), 해당하는 목적 함수 값 (``fval``), 해당 입력에 해당하는 샘플의 분율 (``probability``), 그리고 해답의 ``status`` (``SUCCESS``, ``FAILURE``, ``INFEASIBLE``) 에 대한 정보가 포함되어 있다. 동일한 입력에 상응하는 다수의 샘플은 하나의 ``SolutionSample`` 로 통합된다. (``probability`` 속성은 ``SolutionSample`` 이 나타내는 샘플의 총 분율이다.)
pt_un: ``OptimizationResult`` provê informações úteis na forma de ``SolutionSample``\ s (aqui denotado como *samples*). Cada ``SolutionSample`` contém informações sobre os valores de entrada (``x``), a função objetiva correspondente (``fval``), a fração de amostras correspondentes na entrada (``probability``), e a solução ``status`` (``SUCCESS``, ``FAILURE``, ``INFEASIBLE``). Multiplas amostras correspondentes às mesmas entradas são consolidadas numa simples ``SolutionSample`` (com o atributo ``probability`` sendo a agregação da fração das amostras representados por ``SolutionSample``).
te: ``OptimizationResult`` ``SolutionSample``\ s రూపంలో ఉపయోగకరమైన సమాచారాన్ని అందిస్తుంది (ఇక్కడ *సాంపిల్స్*గా సూచించబడుతుంది). ప్రతి ``SolutionSample`` ఇన్‌పుట్ విలువలు (``x``), సంబంధిత ఆబ్జెక్టివ్ ఫంక్షన్ విలువ (``fval``), ఆ ఇన్‌పుట్‌కు సంబంధించిన సాంపిల్స్ భిన్నం (``సంభావ్యత``) మరియు పరిష్కారం ``status`` (``విజయం``, ``ఫెయిల్యూర్``, ``అసాధ్యం``). ఒకే ఇన్‌పుట్‌కు సంబంధించిన బహుళ నమూనాలు ఒకే ``SolutionSample`` గా ఏకీకృతం చేయబడతాయి (దాని ``సంభావ్యత`` లక్షణంతో ఆ ``SolutionSample`` ద్వారా ప్రాతినిధ్యం వహించే నమూనాల మొత్తం భిన్నం).
th: ``OptimizationResult`` ให้ข้อมูลที่มีประโยชน์ในรูปแบบของ ``SolutionSample`` (ในที่นี้หมายถึงตัวแปร *samples*) แต่ละ ``SolutionSample`` ประกอบไปด้วยข้อมูลเกี่ยวตัวแปรที่รับข้อมูล (``x``), ค่าที่ได้จากฟังก์ชันวัตถุประสงค์ (``fval``), อัตราส่วนของแต่ละผลลัพธ์ตามข้อมูลที่รับเข้ามา (``probability``) และคำตอบว่าสำเร็จหรือไม่ ``status`` (``SUCCESS``, ``FAILURE``, ``INFEASIBLE``) การรวมข้อมูลรับเข้าหลายตัวเป็นข้อมูลเดียวจะทำให้ได้ ``SolutionSample`` เดียว (โดยที่ ``probability`` ที่ได้จะเป็นการรวมกันของอัตราส่วนในแต่ละผลลัพธ์ของ ``SolutionSample`` เดิม).

source: We may also want to filter samples according to their status or probabilities.
bn_bn: আমরা তাদের অবস্থা বা সম্ভাব্যতা অনুযায়ী নমুনাগুলি ফিল্টার করতে চাই।
es_un: También es posible que deseemos filtrar muestras de acuerdo con su estado o probabilidades.
ja: また、ステータスや確率によって、サンプルをフィルターすることもできます。
ko: 또한, 그들의 상태 또는 확률에 따라 샘플들을 필터링할 수 있다.
pt_un: Podemos também filtrar as amostras de acordo com com seus status ou probabilidades.
ta_in: மாதிரிகள் அவற்றின் நிலை அல்லது நிகழ்தகவுகளுக்கு ஏற்ப வடிகட்டவும் நாங்கள் விரும்பலாம்.
te: మేము వాటి స్థితి లేదా సంభావ్యత ప్రకారం సాంపిల్స్లను ఫిల్టర్ చేయాలనుకోవచ్చు.
th: เราสามารถกรองผลลัพธ์จากสถานะหรือความน่าจะเป็นได้

source: If we want to obtain a better perspective of the results, statistics is very helpful, both with respect to the objective function values and their respective probabilities. Thus, mean and standard deviation are the very basics for understanding the results.
bn_bn: যদি আমরা ফলাফলের একটি ভাল ধারণা পেতে চাই, পরিসংখ্যান খুব সহায়ক, উভয় নৈর্ব্যক্তিক অন্বয় (অব্জেক্টিভ ফাংশন) মান এবং তাদের নিজ নিজ সম্ভাবনার ক্ষেত্রে। সুতরাং, ফলাফল বোঝার জন্য গড় এবং মান বিচ্যুতি খুবই মৌলিক।
es_un: Si queremos obtener una mejor perspectiva de los resultados, la estadística es de gran ayuda, tanto con respecto a los valores de la función objetivo como a sus respectivas probabilidades. Por lo tanto, la media y la desviación estándar son los elementos básicos para comprender los resultados.
ja: もし結果のより良い全体像をみたければ、目的関数の値とそれぞれの確率に関して、統計が役立ちます。したがって、平均と標準偏差は結果を理解するための基本になります。
ko: 결과의 더 나은 관점을 얻고자 한다면, 통계는 객관적인 함수 값과 그들의 각각의 확률에 대해서 매우 도움이 된다. 따라서, 평균 및 표준 편차는 결과를 이해하기 위한 매우 기초적인 것이다.
pt_un: Se desejarmos obter uma melhor perspectiva dos resultados, a estatística é muito útil, tanto com relação aos valores da função objetivo quando às suas respectivas probabilidades. Portanto, média e desvio padrão são os fundamentos básicos para compreensão dos resultados.
ta_in: முடிவுகளின் சிறந்த முன்னோக்கை நாம் பெற விரும்பினால், புள்ளிவிவரங்கள் மிகவும் உதவியாக இருக்கும், இரண்டுமே புறநிலை செயல்பாட்டு மதிப்புகள் மற்றும் அவற்றுடன் தொடர்புடைய சாத்தியக்கூறுகள். எனவே, சராசரி மற்றும் நிலையான விலகல் முடிவுகளைப் புரிந்துகொள்வதற்கான அடிப்படைகள்.
te: మేము ఫలితాల యొక్క మెరుగైన దృక్పథాన్ని పొందాలనుకుంటే, ఆబ్జెక్టివ్ ఫంక్షన్ విలువలు మరియు వాటి సంబంధిత సంభావ్యతలకు సంబంధించి గణాంకాలు చాలా సహాయకారిగా ఉంటాయి. అందువల్ల, ఫలితాలను అర్థం చేసుకోవడానికి సగటు మరియు ప్రామాణిక భేదము చాలా ప్రాథమిక అంశాలు.
th: ถ้าเราต้องการมุมมองของผลลัพธ์ที่กว้างขึ้น เราสามารถใช้สถิติเข้ามาช่วยได้ในส่วนของฟังก์ชันวัตถุประสงค์และผลลัพธ์ความน่าจะเป็นที่ได้ เช่นการดูค่าเฉลี่ยและค่าเบี่ยงเบนมาตรฐาน ซึ่งเป็นค่าพื้นฐานในการทำความเข้าใจผลลัพธ์

source: Finally, despite all the number-crunching, visualization is usually the best early-analysis approach.
es_un: Finalmente, a pesar de todo el procesamiento numérico, la visualización suele ser el mejor enfoque de análisis temprano.
ja: 最後に、あらゆる数値処理を差し置いて、可視化は通常最適な早期分析アプローチです。
ko: 마지막으로, 모든 수치 계산에도 불구하고, 시각화는 일반적으로 가장 좋은 초기 분석 방법이다.
pt_un: Finalmente, apesar de todo o processamento numérico, a visualização geralmente é a melhor abordagem de análise inicial.
te: చివరగా, అన్ని సంఖ్య-క్రంచింగ్ ఉన్నప్పటికీ, విజువలైజేషన్ సాధారణంగా ఉత్తమ ప్రారంభ-విశ్లేషణ విధానం.
th: สุดท้าย นอกเหนือจากตัวเลขแล้ว เราสามารถใช้ภาพเข้ามาช่วยในการวิเคราะห์ได้

source: The ``RecursiveMinimumEigenOptimizer`` takes a ``MinimumEigenOptimizer`` as input and applies the recursive optimization scheme to reduce the size of the problem one variable at a time. Once the size of the generated intermediate problem is below a given threshold (``min_num_vars``), the ``RecursiveMinimumEigenOptimizer`` uses another solver (``min_num_vars_optimizer``), e.g., an exact classical solver such as CPLEX or the ``MinimumEigenOptimizer`` based on the ``NumPyMinimumEigensolver``.
bn_bn: ``RecursiveMinimumEigenOptimizer`` একটি ``MinimumEigenOptimizer`` কে ইনপুট হিসেবে নেয় এবং সমস্যাটির আকার কমিয়ে আনার জন্য পুনরাবৃত্তিমূলক অপ্টিমাইজেশন স্কিম প্রয়োগ করে। একবার উৎপন্ন মধ্যবর্তী সমস্যার আকার একটি নির্দিষ্ট ক্রান্তিমান (``min_num_vars``) এর নিচে হয়ে গেলে, ``RecursiveMinimumEigenOptimizer`` অন্য সমাধানকারী (``min_num_vars_optimizer``) ব্যবহার করে, যেমন, একটি সঠিক শাস্ত্রীয় সমাধানকারী যেমন ``NumPyMinimumEigensolver`` এর উপর ভিত্তি করে CPLEX বা ``MinimumEigenOptimizer``।
es_un: El ``RecursiveMinimumEigenOptimizer`` toma un ``MinimumEigenOptimizer`` como entrada y aplica el esquema de optimización recursiva para reducir el tamaño del problema una variable a la vez. Una vez que el tamaño del problema intermedio generado está por debajo de un umbral dado (``min_num_vars``), el ``RecursiveMinimumEigenOptimizer`` usa otro solucionador (``min_num_vars_optimizer``), por ejemplo, un solucionador clásico exacto como CPLEX o el ``MinimumEigenOptimizer`` basado en el ``NumPyMinimumEigensolver``.
ja: ``RecursiveMinimumEigenOptimizer`` は入力として ``MinimumEigenOptimizer`` を取り、再帰的な最適化スキームを適用して、問題のサイズを一度に1変数ずつ小さくします。 生成された中間問題のサイズが与えられたしきい値 (``min_num_vars``) を下回ると、``RecursiveMinimumEigenOptimizer`` は別のソルバー(``min_num_vars_optimizer``)を使用します。（例えば ``NumPyMinimumEigensolver`` に基づく、CPLEXや ``MinimumEigenOptimizer`` などの厳密な古典ソルバーなど）
ko: ``RecursiveMinimumEigenOptimizer`` 는 ``MinimumEigenOptimizer`` 를 입력으로 받아들이고 한 번에 한 변수의 문제 크기를 줄이기 위해 재귀적 최적화 체계를 적용한다. 생성된 중간 문제의 크기가 주어진 임계값 미만이면 (``min_num_vars``), ``RecursiveMinimumEigenOptimizer`` 는 다른 해결자 (``min_num_vars_optimizer``) 를 사용하는데, 예를 들면 CPLEX와 같은 정확한 고전적 솔버 혹은 ``NumPyMinimumEigensolver`` 에 기반한 ``MinimumEigenOptimizer`` 를 사용한다.
pt_un: O ``RecursiveMinimumEigenOptimizer`` recebe um ``MinimumEigenOptimizer`` como entrada e aplica o esquema de otimização recursiva para reduzir o tamanho do problema uma variável de cada vez. Uma vez que o tamanho do problema intermediário gerado esteja abaixo de um determinado limite (``min_num_vars``), o ``RecursiveMinimumEigenOptimizer`` utiliza outro solucionador (``min_num_vars_optimizer``), por exemplo, um solucionador clássico exato como o CPLEX ou o ``MinimumEigenOptimizer`` baseado no ``NumPyMinimumEigensolver``.
ta_in: ``RecursiveMinimumEigenOptimizer`` ஆனது ஒரு ``MinimumEigenOptimizer`` ஐ உள்ளீட்டாக எடுத்துக்கொள்கிறது மற்றும் ஒரு நேரத்தில் ஒரு மாறியின் அளவை குறைக்க மீண்டும் வரும் தேர்வுமுறை திட்டத்தைப் பயன்படுத்துகிறது. உருவாக்கப்பட்ட இடைப்பட்ட சிக்கலின் அளவு ஒரு குறிப்பிட்ட நுழைவாயிலுக்கு கீழே இருந்தால் (``min_num_vars``), ``RecursiveMinimumEigenOptimizer`` மற்றொரு தீர்வைப் (``min_num_vars_optimizer``), உதாரணமாக, CPLEX அல்லது ``NumPyMinimumEigensolver``அடிப்படையில் ``MinimumEigenOptimizer`` போன்ற சரியான கிளாசிக்கல் தீர்வுகளைப் பயன்படுத்துகிறது.
te: ``RecursiveMinimumEigenOptimizer`` ఇన్‌పుట్‌గా ``MinimumEigenOptimizer`ని తీసుకుంటుంది మరియు ఒక సమయంలో ఒక వేరియబుల్‌లో సమస్య యొక్క పరిమాణాన్ని తగ్గించడానికి రికర్సివ్ ఆప్టిమైజేషన్ స్కీమ్‌ను వర్తింపజేస్తుంది. ఉత్పత్తి చేయబడిన ఇంటర్మీడియట్ సమస్య యొక్క పరిమాణం ఇవ్వబడిన థ్రెషోల్డ్ (``min_num_vars``) కంటే తక్కువగా ఉంటే, ``RecursiveMinimumEigenOptimizer`` మరొక పరిష్కరిణిని (``min_num_vars_optimizer``) ఉపయోగిస్తుంది, ఉదా., CPLEX వంటి ఖచ్చితమైన క్లాసికల్ సాల్వర్ ``NumPyMinimumEigensolver`` ఆధారంగా `MinimumEigenOptimizer``.
th: ``RecursiveMinimumEigenOptimizer`` เป็นการใช้ ``MinimumEigenOptimizer`` มาเป็นส่วนรับเข้าข้อมูลและใช้การทำวิธีการ Recursive Optimization เพื่อลดขนาดของปัญหาลงทีละ 1 ตัวแปร เมื่อเราสามารถลดขนาดของปัญหาลงมาต่ำกว่าเกณฑ์ที่กำหนดแล้ว (``min_num_vars``) ``RecursiveMinimumEigenOptimizer`` จะใช้เครื่องมืออีกตัวหนึ่ง (``min_num_vars_optimizer``) เช่นอัลกอริทึมดั้งเดิมที่ให้ผลลัพธ์แบบแน่นอนเช่น CPLEX หรือ ``MinimumEigenOptimizer`` จาก ``NumPyMinimumEigensolver``

source: In the following, we show how to use the ``RecursiveMinimumEigenOptimizer`` using the two ``MinimumEigenOptimizer``\ s introduced before.
es_un: A continuación, mostramos cómo usar el ``RecursiveMinimumEigenOptimizer`` usando los dos ``MinimumEigenOptimizer``\ s presentados anteriormente.
ja: 以下では、以前に導入した 2 つの ``MinimumEigenOptimizer`` を使用して ``RecursiveMinimumEigenOptimizer`` を使用する方法を示します。
ko: 다음에서는, 앞에서 소개된 두 개의 ``MinimumEigenOptimizer`` 을 이용하여 ``RecursiveMinimumEigenOptimizer`` 를 이용하는 방법을 설명한다.
pt_un: A seguir, mostramos como usar o ``RecursiveMinimumEigenOptimizer`` usando os dois ``MinimumEigenOptimizer`` vistos anteriormente.
te: కింది వాటిలో, ముందు ప్రవేశపెట్టిన రెండు ``MinimumEigenOptimizer``లని ఉపయోగించి `RecursiveMinimumEigenOptimizer``ని ఎలా ఉపయోగించాలో మేము చూపుతాము.
th: ในส่วนนี้เราได้แสดงวิธีการใช้ ``RecursiveMinimumEigenOptimizer`` ด้วยการใช้ ``MinimumEigenOptimizer`` 2 ตัว เหมือนกับที่ได้แนะนำไปก่อนหน้านี้

source: First, we construct the ``RecursiveMinimumEigenOptimizer`` such that it reduces the problem size from 3 variables to 1 variable and then uses the exact solver for the last variable. Then we call ``solve`` to optimize the considered problem.
bn_bn: প্রথমে আমরা ``RecursiveMinimumEigenOptimizer`` তৈরি করবো এমন ভাবে যাতে সমস্যাটা ৩ টি চল রাশি থেকে ১ টা চল রাশি এ নেমে আসে তারপর আমরা ঐ সলভারটাই ব্যবহার করি অন্তিম চল রাশি টার জন্যে। তারপর আমরা ``solve`` কে ডাকি এই সমস্যাটাকে অনুকূলিতকরণ করার জন্যে।
es_un: En primer lugar, construimos el ``RecursiveMinimumEigenOptimizer`` tal que reduce el tamaño del problema de 3 variables a 1 variable y luego utiliza el solucionador exacto para la última variable. Entonces llamamos a ``solve`` para optimizar el problema considerado.
ja: 最初に ``RecursiveMinimumEigenOptimizer`` を構築し、問題サイズを3つの変数から1つの変数に縮小し、最後の変数に正確なソルバーを使用します。 次に、検討された問題を最適化するために ``solve`` を呼び出します。
ko: 우선 우리는 3개 변수에서 1변수까지의 문제 크기를 줄이고 마지막 변수에 정확한 해결자를 사용하는 ``RecursiveMinimumEigenOptimizer`` 를 구성한다. 그런 다음 우리는 문제를 해결하기 위해 ``solve`` 이라고 부릅니다.
pt_un: Primeiramente, nós construímos o ``RecursiveMinimumEigenOptimizer`` que reduz o tamanho do problema de 3 variáveis para 1 variável e depois usa o solucionador exato para a última variável. Então chamamos ``solve`` para otimizar o problema considerado.
ta_in: முதலில், நாம் ``RecursiveMinimumEigenOptimizer`` கட்டமைக்கவேண்டும், இது சிக்கல் அளவை 3 மாறிகளிலிருந்து 1 மாறிக்கு குறைக்கிறது, பின்னர் கடைசி மாறிக்கான சரியான தீர்வை பயன்படுத்துகிறது. பின்னர் நாம் கருத்தரிக்கப்பட்ட சிக்கலை மேம்படுத்த ``solve``ஐ அழைக்கிறோம்.
te: ముందుగా, మేము ``RecursiveMinimumEigenOptimizer`ని నిర్మిస్తాము, అది సమస్య పరిమాణాన్ని 3 వేరియబుల్స్ నుండి 1 వేరియబుల్‌కు తగ్గించి, చివరి వేరియబుల్ కోసం ఖచ్చితమైన పరిష్కారాన్ని ఉపయోగిస్తుంది. పరిగణించబడిన సమస్యను ఆప్టిమైజ్ చేయడానికి మేము ``సాల్వ్`` అని పిలుస్తాము.
th: อันดับแรกเราสร้าง ``RecursiveMinimumEigenOptimizer`` ทำให้ลดขนาดปัญหาจากตัวแปร 3 ตัวไปเป็นตัวแปร 1 ตัวแล้วอัลกอริทึมแก้ปัญหาแบบแน่นอนสำหรับหาค่าตัวแปรตัวสุดท้าย จากนั้นเราเรียกใช้คำสั่ง ``solve`` เพื่อหาค่าที่ดีที่สุดในโจทย์ปัญหานี้

source: An interesting class of optimization problems to be addressed by quantum computing are Quadratic Unconstrained Binary Optimization (QUBO) problems. Finding the solution to a QUBO is equivalent to finding the ground state of a corresponding Ising Hamiltonian, which is an important problem not only in optimization, but also in quantum chemistry and physics. For this translation, the binary variables taking values in :math:`\{0, 1\}` are replaced by spin variables taking values in :math:`\{-1, +1\}`, which allows to replace the resulting spin variables by Pauli Z matrices, and thus, an Ising Hamiltonian. For more details on this mapping we refer to [1].
bn_bn: একটি কৌতূহলোদ্দীপক শ্রেণীর অনুকূলায়ন (অপ্টিমাইজেশন) সমস্যাসমূহ যেটি কোয়ান্টাম কম্পিউটিংয়ের দ্বারা সমাধান করার চেষ্টা করতে হবে সেটা হলো Quadratic Unconstrained Binary Optimization (QUBO)। QUBO সমস্যার উপযুক্ত সমাধান পাওয়া একটি আইসিং হ্যামিল্টোনিয়ানের গ্রাউন্ড স্টেট খুঁজে পাওয়ার সমান, যেটি একটি গুরুত্বপূর্ণ সমস্যা শুধুমাত্র অনুকূলায়ন (অপ্টিমাইজেশন) সমস্যাসমূহের্ জন্যেই নয়, কোয়ান্টাম রসায়ন (কেমিস্ট্রি) এবং কোয়ান্টাম পদার্থবিদ্যার জন্যেও। এইজন্যে যেই বাইনারি ভারিয়াবলীগুলি :math:`\{0, 1\}` মান ব্যবহার করে সেইগুলি স্পিন ভ্যারিয়েবলের মান :math:`\{-1, +1\}` বদল করা হয়, যেটি সাহায্য করে ফলের স্পিন চল রাশিকে পাউলি Z ম্যাট্রিক্সসমূহ পরিবর্তন করতে, যেটি একটি আইসিং হ্যামিল্টোনিয়ান। আরও ম্যাপিং সম্পর্কিত তথ্যের জন্যে দেখুন [১].
ta_in: குவாண்டம் கம்ப்யூட்டிங் மூலம் தீர்க்கப்பட வேண்டிய தேர்வுமுறை சிக்கல்களின் ஒரு சுவாரஸ்யமான வர்க்கம் குவாட்ராடிக் கட்டுப்பாடற்ற பைனரி ஆப்டிமைசேஷன் (QUBO) சிக்கல்கள். ஒரு QUBO க்கான தீர்வைக் கண்டறிவது தொடர்புடைய ஐசிங் ஹாமில்டோனியனின் நில நிலையைக் கண்டுபிடிப்பதற்கு சமம், இது தேர்வுமுறைக்கு மட்டுமல்ல, குவாண்டம் வேதியியல் மற்றும் இயற்பியலிலும் ஒரு முக்கியமான பிரச்சினையாகும். இந்த மொழிபெயர்ப்பிற்கு, பைனரி மாறிகள் :math: `\ {0, 1 \}` இதில் மதிப்புகளை எடுக்கும் இவை :math: `\ {- 1, +1 \}` மதிப்புகளை எடுக்கும் சுழல் மாறிகளால் மாற்றப்படுகின்றன , இது பவுலி இசட் மெட்ரிக்ஸின் விளைவாக சுழல் மாறிகளால் மாற்ற அனுமதிக்கிறது, இதனால், ஒரு ஐசிங் ஹாமில்டோனியன். இந்த மேப்பிங் குறித்த கூடுதல் விவரங்களுக்கு [1] ஐக் குறிப்பிடுகிறோம்.

source: Qiskit wraps the translation to an Ising Hamiltonian (in Qiskit Aqua also called ``Operator``), the call to an ``MinimumEigensolver`` as well as the translation of the results back to ``OptimizationResult`` in the ``MinimumEigenOptimizer``.
bn_bn: Qiskit একটি আইসিং হ্যামিল্টোনীয় (Qiskit অ্যাকোয়াতেও ``Operator`` নামে পরিচিত) এর কাছে অনুবাদ করে, একটি ``MinimumEigensolver`` কল করার পাশাপাশি``MinimumEigensolver`` এ ``OptimizationResult` ফলাফলকে অনুবাদ করে।
ta_in: க்விஸ்கிட் மொழிபெயர்ப்பை ஒரு ஐசிங் ஹாமில்டோனியன் (க்விஸ்கிட் அக்வாவில் ``Operator`` என்றும் அழைக்கப்படுகிறது), ``MinimumEigensolver``க்கான அழைப்பு மற்றும் ``MinimumEigenOptimizer`` இல் ``OptimizationResult`` என்ற முடிவுகளின் மொழிபெயர்ப்பு.

source: In the following we first illustrate the conversion from a ``QuadraticProgram`` to an ``Operator`` and then show how to use the ``MinimumEigenOptimizer`` with different ``MinimumEigensolver`` to solve a given ``QuadraticProgram``. The algorithms in Qiskit automatically try to convert a given problem to the supported problem class if possible, for instance, the ``MinimumEigenOptimizer`` will automatically translate integer variables to binary variables or add a linear equality constraints as a quadratic penalty term to the objective. It should be mentioned that Aqua will through a ``QiskitOptimizationError`` if conversion of a quadratic program with integer variable is attempted.
bn_bn: নিম্নলিখিতটিতে আমরা প্রথমে একটি ``QuadraticProgram`` থেকে একটি ``অপারেটর`` এ রূপান্তরকে ব্যাখ্যা করি এবং তারপর দেখাই কিভাবে ``MinimumEigenOptimizer`` ব্যবহার করে বিভিন্ন ``MinimumEigensolver`` দিয়ে একটি ``QuadraticProgram`` সমাধান করতে হয়। Qiskit এ অ্যালগরিদম স্বয়ংক্রিয়ভাবে একটি প্রদত্ত সমস্যাকে সমর্থিত সমস্যা শ্রেণীতে রূপান্তর করার চেষ্টা করে যদি সম্ভব হয়, উদাহরণস্বরূপ, ``MinimumEigenOptimizer`` স্বয়ংক্রিয়ভাবে পূর্ণসংখ্যা ভেরিয়েবলগুলিকে বাইনারি ভেরিয়েবলে অনুবাদ করবে অথবা একটি দ্বিঘাত (কোয়াড্রাটিক) পেনাল্টি পদ হিসাবে একটি রৈখিক সমতা সীমাবদ্ধতা যোগ করবে। এটা উল্লেখ করা উচিত যে Aqua একটি ``QiskitOptimizationError`` দিবে যদি একটি দ্বিঘাত (কোয়াড্রাটিক) প্রোগ্রাম কে পূর্ণসংখ্যা ভেরিয়েবল এ রূপান্তর করার চেষ্টা করা হয়।
ta_in: பின்வருபவற்றில் நாம் முதலில் ஒரு ``QuadraticProgram`` இலிருந்து ஒரு ``Operator`` க்கு மாற்றத்தை விளக்குகிறோம், பின்னர் கொடுக்கப்பட்ட ``QuadraticProgram`` ஐ தீர்க்க வெவ்வேறு ``MinimumEigensolver`` உடன் ``MinimumEigenOptimizer`` ஐ எவ்வாறு பயன்படுத்துவது என்பதை விளக்குகிறோம். Qiskit உள்ள வழிமுறைகள் தானாகவே ஒரு கொடுக்கப்பட்ட பிரச்சனையை ஆதரிக்கப்படும் சிக்கல் வர்க்கத்திற்கு மாற்ற முயற்சிக்கிறது, உதாரணமாக, ``MinimumEigenOptimizer`` தானாகவே முழு எண் மாறிகளை பைனரி மாறிகளுக்கு மொழிபெயர்க்கும் அல்லது ஒரு நேரியல் சமத்துவ கட்டுப்பாடுகளை இலக்கிற்கு ஒரு இருபடி தண்டனையாக சேர்க்கும். முழு எண் மாறிகொண்ட ஒரு இருபடி நிரலை மாற்ற முயற்சித்தால், ``QiskitOptimizationError`` மூலம் அக்வா ஒரு ``QiskitOptimizationError`` மூலம் வரும் என்பதை குறிப்பிட வேண்டும்.

source: Next we translate this QUBO into an Ising operator. This results not only in an ``Operator`` but also in a constant offset to be taking into account to shift the resulting value.
bn_bn: পরবর্তী আমরা এই QUBO কে একটি Ising অপারেটরে অনুবাদ করি। এটি শুধুমাত্র একটি ``অপারেটর `` এর মধ্যেই নয় বরং একটি ধ্রুবক অফসেটেও ফলাফলটি পরিবর্তন করার জন্য বিবেচনায় নেওয়া হচ্ছে।
ta_in: அடுத்து இந்த QUBO ஐ ஒரு ஐசிங் ஆபரேட்டராக மொழிபெயர்க்கிறோம். இதன் விளைவாக ஒரு ``Operator`` மட்டுமல்ல, ஒரு நிலையான ஆஃப்செட்டிலும் விளைந்த மதிப்பை மாற்றுவதற்கு கணக்கில் எடுத்துக்கொள்ளப்படுகிறது.
