Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/03_minimum_eigen_optimizer.po
Languages: bn_bn, es_un, ja, ko, pt_un, ta_in, te, th

source: This page was generated from `docs/tutorials/03_minimum_eigen_optimizer.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/03_minimum_eigen_optimizer.ipynb`__ -থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `docs/tutorials/03_minimum_eigen_optimizer.ipynb`__.
ja: このページは `docs/tutorials/03_minimum_eigen_optimizer.ipynb`__ から生成されました。
ko: 이 페이지는 `docs/tutorials/03_minimum_eigen_optimizer.ipynb`_ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/03_minimum_eigen_optimizer.ipynb`__.
ta_in: இந்தப் பக்கம் `docs/tutorials/03_quantum_kernel.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
te: ఈ పేజీ ` docs/tutorials/03_minimum_eigen_optimizer.ipynb ` __ నుండి రూపొందించబడింది.
th: หน้านี้ถูกสร้างขึ้นจาก `docs/tutorials/03_minimum_eigen_optimizer.ipynb`__

source: Minimum Eigen Optimizer
bn_bn: ন্যূনতম আইজেন অপটিমাইজার
es_un: Optimizador Propio Mínimo
ja: 最小固有値オプティマイザー (Minimum Eigen Optimizer)
pt_un: Otimizador Eigen mínimo
ta_in: குறைந்தபட்ச ஈகன் ஆப்டிமைசர்
te: మినిమమ్ ఐగన్ ఆప్టిమైజర్

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
ja: はじめに
ko: 소개
pt_un: Introdução
ta_in: முன்னுரை
te: ఇంట్రొడక్షన్
th: บทนำ

source: An interesting class of optimization problems to be addressed by quantum computing are Quadratic Unconstrained Binary Optimization (QUBO) problems. Finding the solution to a QUBO is equivalent to finding the ground state of a corresponding Ising Hamiltonian, which is an important problem not only in optimization, but also in quantum chemistry and physics. For this translation, the binary variables taking values in :math:`\{0, 1\}` are replaced by spin variables taking values in :math:`\{-1, +1\}`, which allows one to replace the resulting spin variables by Pauli Z matrices, and thus, an Ising Hamiltonian. For more details on this mapping we refer to [1].
es_un: Una clase interesante de problemas de optimización que debe abordar la computación cuántica son los problemas de Optimización Binaria Cuadrática sin Restricciones (Quadratic Unconstrained Binary Optimization, QUBO). Encontrar la solución a un QUBO es equivalente a encontrar el estado fundamental de un Hamiltoniano de Ising correspondiente, que es un problema importante no solo en la optimización, sino también en química cuántica y física. Para esta traducción, las variables binarias que toman valores en :math:`\{0, 1\}` se reemplazan por variables de espín que toman valores en :math:`\{-1, +1\}`, lo que permite reemplazar las variables de espín resultantes por matrices Pauli Z y, por lo tanto, un Hamiltoniano de Ising. Para más detalles sobre este mapeo nos referimos a [1].
ja: 量子コンピューティングを適用する最適化問題の興味深いクラスには、制約なし二次形式二値変換最適化 (Quadratic Unconstrained Binary Optimization、QUBO) 問題があります。QUBO の解を求めることは、対応するイジング・ハミルトニアンの基底状態を見つけることに相当します。これは最適化だけでなく、量子化学や量子物理学にも重要な問題です。この変換の場合、 :math:`\{0, 1\}` の値を取るバイナリ変数は、 :math:`\{-1, +1\}` の値を取るスピン変数に置き換えられます。これにより、パウリ Z 行列によって得られるスピン変数をイジング・ハミルトニアンに置換することができます。このマッピングの詳細については、[1]を参照してください。
ko: 양자 컴퓨팅으로 해결 할 수 있는 흥미로운 최적화 문제는 Quadratic Unconstrained Binary Optimization (QUBO) 문제이다. QUBO의 해답을 찾는 것은 최적화에서 뿐만 아니라 양자 화학과 물리학에서도 중요한 문제인 이징 해밀토니안의 기저 상태를 찾는 것과 같다. 이 변환의 경우, :math:`\{0, 1\}` 의 값을 갖는 이진형 변수들이 :math:`\{-1, +1\}` 값을 갖는 스핀 변수들로 대체되는데, 이는 스핀 변수들을 Pauli Z 행렬로, 따라서 이징 해밀토니안으로 대체하는 것을 가능하게 한다. 매핑에 대한 자세한 사항은 [1]을 참조한다.
pt_un: Uma classe interessante de problemas de otimização a serem abordados pela computação quântica são problemas de Otimização Quadrática Binária Irrestrita (QUBO). Encontrar a solução para um QUBO é equivalente a encontrar o estado fundamental de um Hamiltoniano de Ising correspondente, que é um problema importante não só na otimização, mas também na química quântica e na física. Para abordar esse tipo de problema, considera-se que as variáveis binárias com valores de :math:`\{0, 1\}` são substituídas por variáveis spin tomando valores em :math:`\{-1, +1\}`, o que permite substituir as variáveis spin resultantes por matrizes de Pauli Z, e assim, um Hamiltoniano de Ising. Para obter mais detalhes sobre este mapeamento nós nos embasamos em [1].
te: క్వాంటం కంప్యూటింగ్ ద్వారా పరిష్కరించబడే ఆప్టిమైజేషన్ సమస్యల యొక్క ఆసక్తికరమైన తరగతి క్వాడ్రాటిక్ అన్‌కన్‌స్ట్రైన్డ్ బైనరీ ఆప్టిమైజేషన్ (QUBO) సమస్యలు. QUBOకి పరిష్కారాన్ని కనుగొనడం అనేది సంబంధిత ఐసింగ్ హామిల్టోనియన్ యొక్క గ్రౌండ్ స్టేట్‌ను కనుగొనడానికి సమానం, ఇది ఆప్టిమైజేషన్‌లోనే కాకుండా క్వాంటం కెమిస్ట్రీ మరియు ఫిజిక్స్‌లో కూడా ముఖ్యమైన సమస్య. ఈ అనువాదం కోసం, :math:`\{0, 1\}`లో విలువలను తీసుకునే బైనరీ వేరియబుల్స్:math:`\{-1, +1\}`లో విలువలను తీసుకునే స్పిన్ వేరియబుల్స్ ద్వారా భర్తీ చేయబడతాయి, ఇది ఒకరిని భర్తీ చేయడానికి అనుమతిస్తుంది. పౌలి Z మాత్రికల ద్వారా వచ్చే స్పిన్ వేరియబుల్స్, అందువలన, ఒక ఐసింగ్ హామిల్టోనియన్. ఈ మ్యాపింగ్‌పై మరిన్ని వివరాల కోసం మేము [1]ని చూడండి.
th: ลักษณะของโจทย์ปัญหาที่น่าจะใจในเรื่อง Optimization ที่การคำนวณเชิงควอนตัมสามารถเข้ามาช่วยได้คือ โจทย์ปัญหา Quadratic Unconstrained Binary Optimization (QUBO) การค้นหาคำตอบของ QUBO นั้นเทียบได้กับการค้นหาสถานะพื้นของ Ising Hamiltonian ของ QUBO นั้น ๆ ซึ่งเป็นปัญหาที่สำคัญมาก ไม่ใช่เพียงเรื่องของ Optimization แต่ยังรวมไปถึงเรื่อง เคมีควอนตัม และ ฟิสิกส์ สำหรับการแปลงนี้เราจะแปลงตัวแปรจากตัวแปรไบนารี่ :math:`\{0, 1\}` แทนที่ด้วยตัวแปรสปินที่มีค่าเป็น :math:`\{-1, +1\}` ซึ่งทำให้เราสามารถแทนที่ตัวแปรสปินด้วยเมทริกซ์ Pauli Z และใช้งานเป็น Ising Hamiltonian สำหรับรายละเอียดเพิ่มเติมสามารถศึกษาได้ที่ [1]

source: Qiskit provides automatic conversion from a suitable ``QuadraticProgram`` to an Ising Hamiltonian, which then allows leveraging all the ``SamplingMinimumEigensolver`` implementations, such as
es_un: Qiskit proporciona conversión automática de un ``QuadraticProgram`` adecuado a un Hamiltoniano de Ising, que luego permite aprovechar todas las implementaciones de ``SamplingMinimumEigensolver``, como
ja: Qiskitは、適切な ``QuadraticProgram`` からイジング・ハミルトニアンへの自動変換を提供します。これにより、次のようなすべての ``SamplingMinimumEigensolver`` を活用できます。
te: Qiskit తగిన ``క్వాడ్రాటిక్ ప్రోగ్రామ్`` నుండి ఐసింగ్ హామిల్టోనియన్‌గా స్వయంచాలకంగా మార్పిడిని అందిస్తుంది, ఇది అన్ని ``SamplingMinimumEigensolver`` అమలులను ప్రభావితం చేయడానికి అనుమతిస్తుంది, ఇటువంటివి

source: ``QAOA``, or
es_un: ``QAOA``, o
ja: ``QAOA`` 、または
ko: ``QAOA``, 또는
pt_un: ``QAOA``, ou
ta_in: ``QAOA``, அல்லது
te: ``QAOA``, లేదా
th: ``QAOA`` หรือ

source: ``NumpyMinimumEigensolver`` (classical exact method).
es_un: ``NumpyMinimumEigensolver`` (método clásico exacto).
ja: ``NumpyMinimumEigensolver`` （古典的厳密法）。
ko: ``NumpyMinimumEigensolver`` (고전적인 정확한 방법)
pt_un: ``NumpyMinimumEigensolver`` (método clássico exato).
ta_in: ``NumpyMinimumEigensolver`` (கிளாசிக்கல் சரியான முறை).
te: ``NumpyMinimumEigensolver`` (క్లాసికల్ ఖచ్చితమైన పద్ధతి).
th: ``NumpyMinimumEigensolver`` (เทคนิคดั้งเดิมในการหาผลลัพธ์แบบแน่นอน)

source: Note 1: ``MinimumEigenOptimizer`` does not support ``qiskit.algorithms.minimum_eigensolver.VQE``. But ``qiskit.algorithms.minimum_eigensolver.SamplingVQE`` can be used instead.
es_un: Nota 1: ``MinimumEigenOptimizer`` no es compatible con ``qiskit.algorithms.minimum_eigensolver.VQE``. Pero en su lugar se puede usar ``qiskit.algorithms.minimum_eigensolver.SamplingVQE``.
ja: 注 1: ``MinimumEigenOptimizer`` は ``qiskit.algorithms.minimum_eigensolver.VQE`` をサポートしていません。しかし、代わりに ``qiskit.algorithms.minimum_eigensolver.SamplingVQE`` を使用できます。
te: గమనిక 1: ``MinimumEigenOptimizer`` ``qiskit.algorithms.minimum_eigensolver.VQE``కి మద్దతు ఇవ్వదు. కానీ బదులుగా ``qiskit.algorithms.minimum_eigensolver.SamplingVQE``ని ఉపయోగించవచ్చు.

source: Note 2: ``MinimumEigenOptimizer`` can use ``NumpyMinimumEigensolver`` as an exception case though it inherits ``MinimumEigensolver`` (not ``SamplingMinimumEigensolver``).
es_un: Nota 2: ``MinimumEigenOptimizer`` puede usar ``NumpyMinimumEigensolver`` como un caso de excepción, aunque hereda de ``MinimumEigensolver`` (no de ``SamplingMinimumEigensolver``).
ja: 注 2: ``NumpyMinimumEigensolver`` は、( ``SamplingMinimumEigensolver`` ではなく) ``MinimumEigensolver`` を継承していますが、``MinimumEigenOptimizer`` はそれを例外ケースとして使用できます。
te: గమనిక 2: ``MinimumEigenOptimizer`` ``MinimumEigensolver`` (`SamplingMinimumEigensolver`` కాదు) ని వారసత్వంగా పొందినప్పటికీ, ``NumpyMinimumEigensolver``ని మినహాయింపు కేసుగా ఉపయోగించవచ్చు.

source: Qiskit Optimization provides a the ``MinimumEigenOptimizer`` class, which wraps the translation to an Ising Hamiltonian (in Qiskit Terra also called ``Operator``), the call to a ``MinimumEigensolver``, and the translation of the results back to an ``OptimizationResult``.
es_un: Qiskit Optimization proporciona una clase ``MinimumEigenOptimizer``, que envuelve la traducción a un Hamiltoniano de Ising (en Qiskit Terra también llamado ``Operator``), la llamada a un ``MinimumEigensolver`` y la traducción de los resultados de vuelta a un ``OptimizationResult``.
ja: Qiskit Optimization は、 ``MinimumEigenOptimizer`` クラスを提供します。これは、変換をイジングハミルトニアン（Qiskit Terra では ``Operator`` とも呼ばれます）にラップし、 ``MinimumEigensolver`` を呼び出し、結果を ``OptimizationResult`` に変換します。
ko: Qiskit 최적화는 ``MinimumEigenOptimizer`` 클래스를 제공하는데, 이 클래스는 이징 해밀토니안 (Qiskit Terra에서는 ``Operator`` 라고도 함) 으로 변환하고, ``MinimumEigensolver`` 로 호출하고, 결과를 다시 ``OptimizationResult`` 로 반환한다.
pt_un: Qiskit Optimization fornece a tradução para um Hamiltoniano de Ising (no Qiskit Aqua também chamado de ``Operator``), a chamada a um ``MinimumEigensolver``, bem como a tradução dos resultados de volta para ``OptimizationResult`` no ``MinimumEigenOptimizer``.
te: Qiskit ఆప్టిమైజేషన్ ఒక ``MinimumEigenOptimizer`` క్లాస్‌ని అందిస్తుంది, ఇది అనువాదాన్ని ఐసింగ్ హామిల్టోనియన్ (Qiskit టెర్రాలో ``ఆపరేటర్`` అని కూడా పిలుస్తారు), ``MinimumEigensolver``కి కాల్ చేయడం మరియు ఫలితాల అనువాదాన్ని తిరిగి ``ఆప్టిమైజేషన్ ఫలితం``కి అందిస్తుంది.
th: Qiskit Optimization มีคลาส ``MinimumEigenOptimizer`` ซึ่งได้เราสามารถใช้งานเพื่อแปลโจทย์ไปเป็น Ising Hamiltonian (ใน Qiskit Terra เรียกว่า ``Operator``) การเรียก ``MinimumEigensolver`` และ ใช้แปลงโจทย์จะทำให้เราได้ผลลัพธ์กลับมาเป็น ``OptimizationResult``

source: In the following we first illustrate the conversion from a ``QuadraticProgram`` to an ``Operator`` and then show how to use the ``MinimumEigenOptimizer`` with different ``MinimumEigensolver``\ s to solve a given ``QuadraticProgram``. The algorithms in Qiskit automatically try to convert a given problem to the supported problem class if possible, for instance, the ``MinimumEigenOptimizer`` will automatically translate integer variables to binary variables or add linear equality constraints as a quadratic penalty term to the objective. It should be mentioned that a ``QiskitOptimizationError`` will be thrown if conversion of a quadratic program with integer variables is attempted.
es_un: A continuación, primero ilustramos la conversión de un ``QuadraticProgram`` a un ``Operator`` y luego mostramos cómo usar el ``MinimumEigenOptimizer`` con diferentes ``MinimumEigensolver``\ s para resolver un ``QuadraticProgram`` dado. Los algoritmos en Qiskit intentan convertir automáticamente un problema determinado a la clase de problema soportada si es posible, por ejemplo, el ``MinimumEigenOptimizer`` traducirá automáticamente las variables enteras a variables binarias o agregará restricciones de igualdad lineal como un término de penalización cuadrática al objetivo. Se debe mencionar que se generará un ``QiskitOptimizationError`` si se intenta la conversión de un programa cuadrático con variables enteras.
ja: 以下では、まず、``QuadraticProgram`` から ``Operator`` への変換を示します。次に、与えられた ``QuadraticProgram`` を解くのに、``MinimumEigenOptimizer`` を異なる ``MinimumEigensolver`` にどう使うのかを示します。Qiskitのアルゴリズムは、与えられた問題を、可能であればサポートされている問題クラスに自動的に変換しようとします。例えば、``MinimumEigenOptimizer`` は整数変数をバイナリー変数に自動的に変換したり、線形等価制約を2次ペナルティ項として目的関数に追加したりします。整数変数を持つ二次計画問題を変換しようとすると、 ``QiskitOptimizationError`` が投げられることに注意してください。
ko: 다음에서는 ``QuadraticProgram`` 에서 ``Operator`` 로의 변환을 설명한 후, 주어진 ``QuadraticProgram`` 을 해결하기 위해 서로 다른 ``MinimumEigensolver`` 들로 구성된 ``MinimumEigenOptimizer`` 들을 사용하는 방법을 보인다. Qiskit의 알고리즘은 가능하다면 자동적으로 주어진 문제를 지원되는 문제 클래스로 변환하려고 시도한다. 예를 들어, ``MinimumEigenOptimizer`` 는 정수형 변수를 이진형 변수로 자동 변환하거나 2차식 페널티 항으로 선형 등식 제약 조건을 목적함수에 추가한다. 정수형 변수를 갖는 ``QuadraticProgram`` 의 변환이 시도될 경우 ``QiskitOptimizationError`` 가 발생한다는 점을 유의한다.
pt_un: A seguir ilustramos primeiro a conversão de um ``QuadraticProgram`` para um ``Operator`` e, em seguida, mostramos como utilizar o ``MinimumEigenOptimizer`` com diferentes ``MinimumEigensolver`` para resolver um dado ``QuadraticProgram``. Os algoritmos em Qiskit automaticamente tentam converter um determinado problema para a classe de problema suportado se possível, por exemplo, o ``MinimumEigenOptimizer`` irá traduzir automaticamente variáveis inteiras para variáveis binárias ou adicionar restrições lineares de igualdade como um termo de penalidade quadrática para o objetivo. Deve-se mencionar que Aqua lançará um ``QiskitOptimizationError`` se for tentada a conversão de um programa quadrático com variável inteira.
te: కింది వాటిలో మేము ముందుగా ``QuadraticProgram`` నుండి ``Operator``కి మార్చడాన్ని వివరిస్తాము మరియు ఇచ్చిన ``QuadraticProgramని పరిష్కరించడానికి విభిన్నమైన ``MinimumEigensolver`\ లతో ``MinimumEigenOptimizer``ని ఎలా ఉపయోగించాలో చూపుతాము. ``. Qiskitలోని అల్గారిథమ్‌లు సాధ్యమైతే ఇచ్చిన సమస్యను మద్దతు ఉన్న సమస్య తరగతికి స్వయంచాలకంగా మార్చడానికి ప్రయత్నిస్తాయి, ఉదాహరణకు, ``MinimumEigenOptimizer`` integer వేరియబుల్‌లను బైనరీ వేరియబుల్స్‌కు స్వయంచాలకంగా అనువదిస్తుంది లేదా ఆబ్జెక్టివ్‌కు క్వాడ్రాటిక్ పెనాల్టీ గా సరళ సమానత్వ పరిమితులను జోడిస్తుంది. integer వేరియబుల్స్‌తో క్వాడ్రాటిక్ ప్రోగ్రామ్‌ను మార్చడానికి ప్రయత్నించినట్లయితే, ``QiskitOptimizationError`` విసిరివేయబడుతుందని పేర్కొనాలి.
th: ในส่วนถัดไป มีการแสดงให้เห็นวิธีการแปลงจาก ``QuadraticProgram`` ไปเป็น ``Operator`` และแสดงวิธีการใช้ ``MinimumEigenOptimizer`` ด้วย ``MinimumEigensolver`` ที่แตกต่างกัน การการหาคำตอบของ ``QuadraticProgram`` ที่กำหนด อัลกอริทึมของ Qiskit พยายามที่จะแปลงโจทย์ปัญหาไปอยู่ในรูปแบบคลาสที่เหมาะสมที่สุดในการหาคำตอบ ตัวอย่างเช่น ``MinimumEigenOptimizer`` จะแปลงตัวแปรจำนวนเต็มไปเป็นตัวแปรไบนารี่ หรือ แปลงสมการข้อจำกัดแบบเส้นตรงไปเป็นพจน์กำลังสองในฟังก์ชันวัตถุประสงค์ ในกรณีที่ ``QiskitOptimizationError`` แจ้งเตือน หมายความว่ามีการพยายามจะแปลงกำหนดการกำลังสองที่มีตัวแปรเป็นจำนวนเต็ม

source: The circuit depth of ``QAOA`` potentially has to be increased with the problem size, which might be prohibitive for near-term quantum devices. A possible workaround is Recursive QAOA, as introduced in [2]. Qiskit generalizes this concept to the ``RecursiveMinimumEigenOptimizer``, which is introduced at the end of this tutorial.
bn_bn: ``QAOA`` এর সার্কিট গভীরতা সম্ভাব্যভাবে সমস্যার আকারের সাথে বৃদ্ধি করতে হবে, যা নিকট-মেয়াদী কোয়ান্টাম ডিভাইসের জন্য নিষিদ্ধ হতে পারে। একটি সম্ভাব্য সমাধান হল পুনরাবৃত্তিমূলক QAOA, যা [২] -এ চালু করা হয়েছে। কিস্কিট এই ধারণাকে ``RecursiveMinimumEigenOptimizer`` এ সাধারণ করে, যা এই টিউটোরিয়ালের শেষে চালু করা হয়েছে।
es_un: La profundidad del circuito de ``QAOA`` podría ser incrementada con el tamaño del problema, lo que podría ser prohibitivo para los dispositivos cuánticos a corto plazo. Un posible método alternativo es el QAOA recursivo, como se introduce en la referencia [2]. Qiskit generaliza este concepto a ``RecursiveMinimumEigenOptimizer``, el cual se introduce al final de este tutorial.
ja: ``QAOA`` の回路の深さは、問題の大きさに応じて必然的に増加する可能性があり、これは近未来の量子デバイスにとっては障害となる可能性があります。考えられる回避策として、 [2] で紹介されている再帰QAOAがあります。このチュートリアルの最後で紹介しますが、Qiskit はこの概念を ``RecursiveMinimumEigenOptimizer`` に一般化しています。
ko: ``QAOA`` 의 회로 깊이(depth) 는 잠재적으로 문제의 크기와 함께 증가해야 하는데, 이는 현재의 양자 디바이스(near-term quantum devices) 에서는 (회로 비용을) 감당할 수 없을지도 모른다. 가능한 해결 방법은 [2] 에 소개된 Recursive QAOA이다. Qiskit은 본 튜토리얼의 마지막 부분에 소개된 ``RecursiveMinimumEigenOptimizer`` 에서 이 개념을 다루었다.
pt_un: A profundidade do circuito de ``QAOA`` potencialmente tem de ser aumentada com o tamanho do problema, o que pode ser proibitivo para dispositivos quânticos de curto prazo. Uma possível solução alternativa é a QAOA Recursiva, como introduzido em [2]. O Qiskit generaliza este conceito para o ``RecursiveMinimumEigenOptimizer``, que é introduzido no final deste tutorial.
ta_in: ``QAOA`` இன் சுற்று ஆழம் சாத்தியமான சிக்கல் அளவுடன் அதிகரிக்கப்பட வேண்டும், இது கிட்டத்தட்ட கால குவாண்டம் சாதனங்களுக்கு தடை செய்யப்படலாம். ஒரு சாத்தியமான பணிச்சுற்று ரிகர்சிவ் QAOA ஆகும், இது [2] இல் அறிமுகப்படுத்தப்பட்டது. இந்த கருத்தை Qiskit பொதுமைப்படுத்துகிறது ``RecursiveMinimumEigenOptimizer``, இது இந்த பயிற்சிகள் முடிவில் அறிமுகப்படுத்தப்படுகிறது.
te: సమస్య పరిమాణంతో ``QAOA` యొక్క సర్క్యూట్ డెప్త్ సంభావ్యంగా పెంచవలసి ఉంటుంది, ఇది సమీప-కాల క్వాంటం పరికరాలకు నిషేధించబడవచ్చు. [2] లో ప్రవేశపెట్టినట్లుగా, రికర్సివ్ QAOA సాధ్యమయ్యే ప్రత్యామ్నాయం. Qiskit ఈ ట్యుటోరియల్ చివరిలో పరిచయం చేయబడిన ``RecursiveMinimumEigenOptimizer``కి ఈ భావనను సాధారణీకరిస్తుంది.
th: ความลึกของวงจร ``QAOA`` มีโอกาสที่จะเพิ่มขึ้นตามขนาดของโจทย์ปัญหา ซึ่งอาจจะทำให้ไม่สามารถทำงานได้ในอุปกรณ์ควอนตัมในปัจจุบัน แนวทางที่เป็นไปได้คือการใช้ Recursive QAOA ตามที่ได้มีการกล่าวใน [2] Qiskit มีการใช้งานแนวคิดนี้ใน ``RecursiveMinimumEigenOptimizer`` ซึ่งจะมีการกล่าวถึงในส่วนท้ายของบทเรียนนี้

source: References
bn_bn: তথ্যসূত্র (রেফারেন্স)
es_un: Referencias
ja: 参考文献
ko: 참조
pt_un: Referências
ta_in: குறிப்புகள்
te: రిఫరెన్సులు
th: แหล่งอ้างอิง

source: [1] `A. Lucas, Ising formulations of many NP problems, Front. Phys., 12 (2014). <https://arxiv.org/abs/1302.5843>`__
bn_bn: [১] `A. Lucas, Ising formulations of many NP problems, Front. Phys., 12 (2014). <https://arxiv.org/abs/1302.5843>`__
te: [1] `ఎ. లూకాస్, అనేక NP సమస్యల యొక్క ఐసింగ్ సూత్రీకరణలు, ఫ్రంట్. ఫిజి., 12 (2014). <https://arxiv.org/abs/1302.5843>`__

source: [2] `S. Bravyi, A. Kliesch, R. Koenig, E. Tang, Obstacles to State Preparation and Variational Optimization from Symmetry Protection, arXiv preprint arXiv:1910.08980 (2019). <https://arxiv.org/abs/1910.08980>`__
bn_bn: [২] `S. Bravyi, A. Kliesch, R. Koenig, E. Tang, Obstacles to State Preparation and Variational Optimization from Symmetry Protection, arXiv preprint arXiv:1910.08980 (2019). <https://arxiv.org/abs/1910.08980>`__
te: [2] ` S. Bravyi, A. Kliesch, R. Koenig, E. Tang, Obstacles to State Tayari and Variational Optimization from Symmetry Protection, arXiv ప్రిప్రింట్ arXiv:1910.08980 (2019). <https://arxiv.org/abs/1910.08980>` __

source: Converting a QUBO to an Operator
bn_bn: একটি QUBO কে অপারেটরে রূপান্তর করা
es_un: Convertir un QUBO a un Operator
ja: QUBOをオペレーターに変換する
ko: QUBO를 Operator로 변환하기
pt_un: Convertendo um QUBO para um Operador
ta_in: ஒரு QUBO ஐ ஒரு ஆபரேட்டராக மாற்றுதல்
te: QUBOని ఆపరేటర్‌గా మారుస్తోంది
th: การแปลง QUBO เป็น Operator

source: Next we translate this QUBO into an Ising operator. This results not only in an ``Operator`` but also in a constant offset to be taken into account to shift the resulting value.
es_un: A continuación traducimos este QUBO en un operador de Ising. Esto no solo resulta en un ``Operator``, sino también en un desplazamiento constante que se debe tener en cuenta para cambiar el valor resultante.
ja: 次に、このQUBOをIsingオペレータに変換します。 変換の結果は、``Operator`` だけではなく、結果の値をシフトするのに考慮すべき定数オフセットにもなります。
ko: 다음으로 이 QUBO를 이징 연산자로 변환한다. 이는 ``Operator`` 뿐만 아니라 결과값을 이동하기 위해 고려해야 할 상수 오프셋이 생긴다.
pt_un: A seguir traduzimos este QUBO em um operador de Ising. Isso resulta não apenas em um ``Operator`` mas também em um deslocamento constante a ser levado em conta para deslocar o valor resultante.
te: తర్వాత మేము ఈ QUBOని ఐసింగ్ ఆపరేటర్‌గా అనువదిస్తాము. ఇది కేవలం ``ఆపరేటర్``లో మాత్రమే కాకుండా, ఫలిత విలువను మార్చడానికి పరిగణనలోకి తీసుకోవలసిన స్థిరమైన ఆఫ్‌సెట్‌ను కూడా అందిస్తుంది.
th: ถัดไปเราทำการแปลง QUBO ไปเป็น Ising Operator โดยผลลัพธ์ที่ได้จะมีทั้ง ``Operator`` และ ค่าควที่ Offset ที่ใช้บวกเพิ่มเข้าไปในผลลัพธ์

source: Sometimes a ``QuadraticProgram`` might also directly be given in the form of an ``Operator``. For such cases, Qiskit also provides a translator from an ``Operator`` back to a ``QuadraticProgram``, which we illustrate in the following.
es_un: A veces, un ``QuadraticProgram`` también podría ser dado directamente en forma de ``Operator``. Para tales casos, Qiskit también proporciona un traductor de un ``Operator`` de vuelta a un ``QuadraticProgram``, que ilustramos a continuación.
ja: ときには、``QuadraticProgram`` が ``Operator`` の形でも直接与えられる場合があります。 このような場合、Qiskit は ``Operator`` から ``QuadraticProgram`` に戻す変換機能を備えています。これについては以下で説明します。
ko: 때때로 ``QuadraticProgram`` 은 ``Operator`` 의 형태로 직접 주어질 수도 있다. 이러한 경우 Qiskit은 ``Operator`` 에서 ``QuadraticProgram`` 으로의 변환기를 제공하는데, 이에 대해서는 다음 코드를 참조하자.
pt_un: Às vezes, um ``QuadraticProgram`` também pode ser dado diretamente na forma de um ``Operator``. Para tais casos, o Qiskit também fornece um conversor de um ``Operator`` de volta a um ``QuadraticProgram``, que ilustramos a seguir.
te: కొన్నిసార్లు ``క్వాడ్రాటిక్ ప్రోగ్రామ్`` నేరుగా ``ఆపరేటర్`` రూపంలో ఇవ్వబడవచ్చు. అటువంటి సందర్భాలలో, Qiskit కూడా ఒక ``ఆపరేటర్`` నుండి ``QuadraticProgram``కి అనువాదకుడిని అందిస్తుంది, దానిని మేము ఈ క్రింది వాటిలో వివరిస్తాము.
th: ในบางครั้งเราสามารถสร้าง ``QuadraticProgram`` โดยการเพิ่ม ``Operator`` เข้าไปโดยตรง ในกรณีนี้ Qiskit มีตัวช่วยแปลงจาก ``Operator`` กลับมาเป็น ``QuadraticProgram`` สามารถทำได้ดังนี้

source: This translator allows, for instance, one to translate an ``Operator`` to a ``QuadraticProgram`` and then solve the problem with other algorithms that are not based on the Ising Hamiltonian representation, such as the ``GroverOptimizer``.
es_un: Este traductor permite, por ejemplo, traducir un ``Operator`` a un ``QuadraticProgram`` y luego resolver el problema con otros algoritmos que no se basan en la representación del Hamiltoniano de Ising, como el ``GroverOptimizer``.
ja: このコンバーターにより、例えば、``Operator`` を ``QuadraticProgram`` に変換して、イジング・ハミルトニアン表現に基づいていない他のアルゴリズム（例えば ``GroverOptimizer`` ）で問題を解くことができます。
ko: 예를 들어, 이 변환기를 사용하면 ``Operator`` 를 ``QuadraticProgram`` 으로 변환한 다음, ``GroverOptimizer`` 와 같이 이징 해밀토니안 표현식을 기반으로 하지 않는 다른 알고리즘으로 문제를 해결할 수 있다.
pt_un: Este conversor permite, por exemplo, traduzir um ``Operator`` para um ``QuadraticProgram`` e, em seguida, resolver o problema com outros algoritmos que não se baseiam na representação do Hamiltoniano de Ising, como o ``GroverOptimizer``.
te: ఈ అనువాదకుడు, ఉదాహరణకు, ఒక ``ఆపరేటర్``ని ``క్వాడ్రాటిక్ ప్రోగ్రామ్``కి అనువదించడానికి అనుమతిస్తుంది, ఆపై ``గ్రోవర్ ఆప్టిమైజర్`` వంటి ఐసింగ్ హామిల్టోనియన్ ప్రాతినిధ్యంపై ఆధారపడని ఇతర అల్గారిథమ్‌లతో సమస్యను పరిష్కరించడానికి అనుమతిస్తుంది.
th: ตัวแปลงนี้ทำให้เราสามารถแปลงจาก ``Operator`` ไปเป็น ``QuadraticProgram`` และใช้อัลกอริทึมอื่น ๆ ที่ไม่ต้องใช้ Ising Hamiltonian ในการแก้โจทย์ปัญหานี้ได้ เช่น ``GroverOptimizer``

source: Solving a QUBO with the MinimumEigenOptimizer
bn_bn: MinimumEigenOptimizer দিয়ে একটি QUBO সমাধান করা
es_un: Resolver un QUBO con el MinimumEigenOptimizer
ja: MinimumEigenOptimizer で QUBO を解く
ko: MinimumEigenOptimizer를 사용하여 QUBO를 해결하기
pt_un: Resolvendo um QUBO com o MinimumEigenOptimizer
ta_in: மினிமம்ஐகன்ஆப்டிமைசர் உடன் ஒரு QUBO ஐ த் தீர்த்தல்
te: MinimumEigenOptimizerతో QUBOను పరిష్కరించడం
th: การหาคำคอบของ QUBO ด้วย MinimumEigenOptimizer

source: We start by initializing the ``MinimumEigensolver`` we want to use.
bn_bn: আমরা "MinimumEigensolver" দিয়ে শুরু করি যা আমরা ব্যবহার করতে চাই।
es_un: Empezamos inicializando el ``MinimumEigensolver`` que queremos usar.
ja: まず、使用する ``MinimumEigensolver`` を初期化します。
ko: ``MinimumEigensolver`` 를 초기화하는 것에서부터 시작한다.
pt_un: Iniciamos inicializando o ``MinimumEigensolver`` que queremos utilizar.
ta_in: நாம் ``MinimumEigensolver`` ஐ துவக்குவதன் மூலம் தொடங்குகிறோம். அதை பயன்படுத்த விரும்புகிறோம்.
te: మేము ఉపయోగించాలనుకుంటున్న ``MinimumEigensolver``ని ప్రారంభించడం ద్వారా ప్రారంభిస్తాము.
th: เริ่มต้นโดยการประกาศ ``MinimumEigensolver`` ที่เราต้องการใช้
