Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/03_minimum_eigen_optimizer.po
Languages: bn_bn, es_un, ja, ko, pt_un, ta_in, te, th

source: Sometimes an ``QuadraticProgram`` might also directly be given in the form of an ``Operator``. For such cases, Qiskit also provides a converter from an ``Operator`` back to a ``QuadraticProgram``, which we illustrate in the following.
bn_bn: কখনও কখনও একটি ``QuadraticProgram`` সরাসরি একটি "অপারেটর" আকারে দেওয়া যেতে পারে। এই ধরনের ক্ষেত্রে, Qiskit একটি ``অপারেটর`` থেকে একটি ``QuadraticProgram`` তে একটি পরিবর্তক (কনভার্টার) প্রদান করে, যা আমরা নিচে ব্যাখ্যা করছি।
ta_in: சில நேரங்களில் ``QuadraticProgram``என்பது நேரடியாக ``Operator`` வடிவத்தில் வழங்கப்படலாம். அத்தகைய சந்தர்ப்பங்களில், Qiskit ஒரு ``Operator`` இருந்து ஒரு மாற்றி வழங்குகிறது ``QuadraticProgram``, இது நாம் பின்வரும் விளக்க.

source: This converter allows, for instance, to translate an ``Operator`` to a ``QuadraticProgram`` and then solve the problem with other algorithms that are not based on the Ising Hamiltonian representation, such as the ``GroverOptimizer``.
bn_bn: এই পরিবর্তক (কনভার্টার), উদাহরণস্বরূপ, একটি ``অপারেটর`` কে ``QuadraticProgram`` এ অনুবাদ করার অনুমতি দেয় এবং তারপর অন্যান্য অ্যালগরিদমগুলির সাথে সমস্যার সমাধান করে যা আইসিং হ্যামিল্টোনিয়ান উপস্থাপনার উপর ভিত্তি করে নয়, যেমন "GroverOptimizer"।
ta_in: இந்த மாற்றி உதாரணமாக, ஒரு ``QuadraticProgram`` க்கு ஒரு ``Operator`` ஐ மொழிபெயர்க்க அனுமதிக்கிறது, பின்னர் ``GroverOptimizer`` போன்ற ஐசிங் ஹாமில்டன் பிரதிநிதித்துவத்தின் அடிப்படையில் இல்லாத மற்ற வழிமுறைகளுடன் சிக்கலைத் தீர்க்க அனுமதிக்கிறது.

source: ``OptimizationResult`` provides a useful information source ``SolutionSample`` (here denoted as *samples*). They contain information about input values ``x``, objective function values ``fval``, probability of obtaining that result ``probability`` and the solution status ``status`` (``SUCCESS``, ``FAILURE``, ``INFEASIBLE``).
bn_bn: ``OptimizationResult`` একটি দরকারি তথ্য উৎস প্রদান করে ``SolutionSample`` (এখানে *নমুনা *হিসাবে চিহ্নিত করা হয়েছে)। তারা ইনপুট মান "x", নৈর্ব্যক্তিক অন্বয় (অব্জেক্টিভ ফাংশন) মান "fval", ঐ ফলাফল প্রাপ্তির সম্ভাবনা ``probability`` এবং সমাধান অবস্থা ``status`` (``SUCCESS``, ``FAILURE``, ``INFEASIBLE``)।
ta_in: ``OptimizationResult`` பயனுள்ள தகவல் ஆதாரத்தை வழங்குகிறது ``SolutionSample`` (இங்கே *மாதிரிகள்* என குறிப்பிடப்படுகிறது). உள்ளீட்டு மதிப்புகள் பற்றிய தகவல்கள் அவற்றில் உள்ளன ``x``, நோக்க செயற்பாடு ``fval``, அந்த முடிவைப் பெறுவதற்கான நிகழ்தகவு ``probability`` மற்றும் தீர்வு நிலை ``status`` (``SUCCESS``, ``FAILURE``, ``INFEASIBLE``).

source: Finally, despite all number-crunching, visualization is usually the best early-analysis approach.
bn_bn: সবশেষে, সংখ্যা-ক্রাঙ্কিং সত্ত্বেও, ভিজ্যুয়ালাইজেশন সাধারণত প্রাথমিক-বিশ্লেষণ পদ্ধতি।
ta_in: இறுதியாக, எண்-நொறுக்குதல் இருந்தபோதிலும், காட்சிப்படுத்தல் பொதுவாக சிறந்த ஆரம்ப-பகுப்பாய்வு அணுகுமுறையாகும்.

source: RecursiveMinimumEigenOptimizer
ta_in: ரிகர்சிவ் மினிமம்ஈஜென் ஆப்டிமைசர்

source: In the following, we show how to use the ``RecursiveMinimumEigenOptimizer`` using the two ``MinimumEigenOptimizer`` introduced before.
bn_bn: নিচে, আমরা দেখিয়েছি আগে আলোচ্য দুটি ``MinimumEigenOptimizer`` ব্যবহার করে কিভাবে ``RecursiveMinimumEigenOptimier`` ব্যবহার করা যায় ।
ta_in: பின்வருவனவற்றில், முன்னர் அறிமுகப்படுத்தப்பட்ட இரண்டு `` MinimumEigenOptimizer`` ஐப் பயன்படுத்தி ``RecursiveMinimumEigenOptimizer`` ஐ எவ்வாறு பயன்படுத்துவது என்பதை நாங்கள் காட்டுகிறோம்.
