Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/04_grover_optimizer.po
Languages: bn_bn, es_un, ja, ko_kr, pt_un, ta, th

source: This page was generated from `docs/tutorials/04_grover_optimizer.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/04_grover_optimizer.ipynb`__ থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `docs/tutorials/04_grover_optimizer.ipynb`__.
ja: このページは `docs/tutorials/04_grover_optimizer.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/04_grover_optimizer.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/04_grover_optimizer.ipynb`__.
ta: இந்தப் பக்கம் `docs/tutorials/04_grover_optimizer.ipynb`__ இதிலிருந்து உருவாக்கப்பட்டது.
th: หน้านี้ถูกสร้างขึ้นจาก `docs/tutorials/04_grover_optimizer.ipynb`__

source: Grover Optimizer
bn_bn: গ্রোভার অপ্টিমাইজার
es_un: Optimizador de Grover
ja: グローバーオプティマイザー
ko_kr: Grover 최적화기
pt_un: Otimizador de Grover
ta: க்ரோவர் ஆப்டிமைசர்

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
ja: はじめに
ko_kr: 소개
pt_un: Introdução
ta: முன்னுரை
th: บทนำ

source: Grover Adaptive Search (GAS) has been explored as a possible solution for combinatorial optimization problems, alongside variational algorithms such as Variational Quantum Eigensolver (VQE) and Quantum Approximate Optimization Algorithm (QAOA). The algorithm iteratively applies Grover Search to find the optimum value of an objective function, by using the best-known value from the previous run as a threshold. The adaptive oracle used in GAS recognizes all values above or below the current threshold (for max and min respectively), decreasing the size of the search space every iteration the threshold is updated, until an optimum is found.
bn_bn: গ্রোভার এডাপটিভ সার্চ (GAS) কে সংমিশ্রণমূলক অপ্টিমাইজেশন সমস্যার পাশাপাশি পরিবর্তনশীল (ভ্যারিয়েশনাল) অ্যালগরিদম, যেমন Variational Quantum Eigensolver (VQE) এবং Quantum Approximate Optimization Algorithm (QAOA) এর সম্ভাব্য সমাধান হিসাবে অন্বেষণ করা হয়েছে। এই অ্যালগরিদমটি একটি অব্জেক্টিভ ফাংশন এর সর্বোত্তম মানটি সন্ধান করার জন্য পুনরুক্তি ভাবে গ্রোভার অনুসন্ধান প্রয়োগ করে, যেটা প্রান্তিক হিসাবে আগের রান থেকে সর্বাধিক পরিচিত মান ব্যবহার করে। GAS-এ ব্যবহৃত অভিযোজিত ওরাকল বর্তমান প্রান্তিকের উপরে বা নীচে (যথাক্রমে সর্বাধিক এবং সর্বনিম্ন জন্য) সমস্ত মানকে স্বীকৃতি দেয়, যতক্ষণ না কোনও সর্বোত্তম সন্ধান পাওয়া যায় ততক্ষণ প্রতিটি পুনরাবৃত্তির প্রান্তিক আপডেট হয় সন্ধানের জায়গার আকার হ্রাস করে।
es_un: La Búsqueda Adaptativa de Grover (Grover Adaptive Search, GAS) ha sido explorada como una posible solución para problemas de optimización combinatoria, junto con los algoritmos variacionales tal como el Solucionador Propio Cuántico Variacional (Variational Quantum Eigensolver, VQE) y el Algoritmo Cuántico de Optimización Aproximada (Quantum Approximate Optimization Algorithm, QAOA). El algoritmo aplica la Búsqueda de Grover iterativamente para encontrar el valor óptimo de una función objetivo, al usar el mejor valor conocido de la ejecución anterior como umbral. El oráculo adaptativo utilizado en GAS reconoce todos los valores arriba o debajo del umbral actual (para máximos y mínimos, respectivamente), disminuyendo el tamaño del espacio de búsqueda, en cada iteración se actualiza el umbral, hasta que se encuentra un óptimo.
ja: グローバー適応探索（Grover Adaptive Search、GAS）は、変分量子固有ソルバー（Variational Quantum Eigensolver、VQE）や量子近似最適化アルゴリズム（Quantum Approximate Optimization Algorithm、QAOA）などの変分アルゴリズムとともに、組み合わせ最適化問題における可能な解決策として検討されてきました。アルゴリズムは、グローバー検索を繰り返し適用し、直前の実行までで最もよいと思われる値をしきい値として使用して、目的関数の最適値を見つけます。GASで使用されるアダプティブオラクルは、現在のしきい値より上または下のすべての値（それぞれ最大および最小）を認識し、最適値が見つかるまで、しきい値が更新されるたびに検索スペースのサイズを縮小します。
ko_kr: Grover 적응 검색 (그로버 적응성 검색 (GAS)) 은 조합 최적화 문제들을 위한 가능한 솔루션으로써, 다양한 알고리즘, 예를 들어, 변동성 양자 고윳값해석기 (VQE) 및 양자 근사 최적화 알고리즘 (QAOA)과 함께 탐구되었다. 알고리즘은 이전 실행에서 가장 잘 알려진 값을 임계값으로 사용하여 목표 함수의 최적 값을 찾기 위해 Grover 검색을 반복적으로 적용합니다. GAS 에서 사용된 적응형 오라클은 현재 임계값 이상의 모든 값을 인식하고 (최대 및 최소), 최적해가 발견될 때까지, 임계값이 갱신될 때마다 검색 공간의 크기를 감소시킨다.
pt_un: O GAS (Grover Adaptive Search) tem sido explorado como uma possível solução para problemas de otimização combinatória, ao lado de algoritmos variacionais como o VQE (Variational Quantum Eigensolver) e o QAOA (Quantum Aproximaximate Optimization Algorithm). O algoritmo aplica iterativamente Grover Search para encontrar o valor ótimo de uma função objetivo, ao utilizar o melhor valor conhecido da execução anterior como um limitante. O oráculo adaptado usado no GAS reconhece todos os valores acima ou abaixo do limitante atual (para máximo e mínimo respectivamente), diminuindo o tamanho do espaço de busca a cada iteração o limitante é atualizado, até que seja encontrado um valor ótimo.
ta: குரோவர் தகவமைப்பு தேடல் (GAS) காம்பினடோரில் தேர்வுமுறை பிரச்சினைகள் சிக்கல்களுக்கான சாத்தியமான தீர்வாக ஆராயப்பட்டுள்ளது, மாறுபட்ட குவாண்டம் ஐஜென்சால்வர் (VQE) மற்றும் குவாண்டம் தோராயமான உகப்பாக்கம் அல்காரிதம் (QAOA) போன்ற மாறுபட்ட வழிமுறைகளுடன். முந்தைய ஓட்டத்திலிருந்து சிறந்த அறியப்பட்ட மதிப்பை ஒரு நுழைவாயிலாகப் பயன்படுத்துவதன் மூலம், ஒரு புறநிலை செயல்பாட்டின் உகந்த மதிப்பைக் கண்டறிய இந்த வழிமுறை குரோவர் தேடலைப் பயன்படுத்துகிறது. GAS இல் பயன்படுத்தப்படும் தகவமைப்பு ஆரக்கிள் தற்போதைய வாசலுக்கு மேலே அல்லது அதற்குக் கீழே உள்ள அனைத்து மதிப்புகளையும் அங்கீகரிக்கிறது (முறையே அதிகபட்சம் மற்றும் நிமிடம்), உகந்ததைக் கண்டுபிடிக்கும் வரை, வாசல் புதுப்பிக்கப்படும் ஒவ்வொரு மறு செய்கையும் தேடல் இடத்தின் அளவைக் குறைக்கிறது.
th: Grover Adaptive Search (GAS) ได้ถูกศึกษาเพื่อนำมาใช้ในการแก้ไขปัญหา Combinatorial Optimization พร้อม ๆ กันกับ Variational Algorithm เช่น Variational Quantum Eigensolver (VQE) และ Quantum Approximate Optimization อัลกอริทึมนี้เป็นการใช้ Grover Search ซ้ำ ๆ เพื่อหาค่าที่ดีที่สุดของฟังก์ชันวัตถุประสงค์โดยใช้ค่าที่ดีที่สุดของการทำ งานครั้งก่อนหน้าเป็นเกณฑ์ Adaptive Oracle ใน GAS ครอบคลุมทุก ๆ ค่าที่อยู่เหนือหรือต่ำกว่าเกณฑ์ในปัจจุบันทั้งหมดเป็นขอบเขตการค้นหา ซึ่งในแต่ละการทำงานซ้ำเมื่ออัปเดตเกณฑ์แล้วจะทำให้มีขอบเขตการค้นหาที่เล็กลงเรื่อย ๆ จนสามารถหาค่าที่ดีที่สุดได้

source: In this notebook we will explore each component of the ``GroverOptimizer``, which utilizes the techniques described in GAS, by minimizing a Quadratic Unconstrained Binary Optimization (QUBO) problem, as described in [1]
bn_bn: [1] এ বর্ণিত শর্তহীন দ্বিঘাত দ্বিমিক অনুকূলায়ন (অপ্টিমাইজেশন) সমস্যাটিকে হ্রাস করার মাধ্যমে এই নোটবুকে আমরা ``GroverOptimizer`` এর প্রত্যেকটি উপাদান সম্পর্কে জানব যেগুলো জি এ এস-এ বর্ণিত উপায়গুলোকে ব্যবহার করে।
es_un: En este cuaderno exploraremos cada componente del ``GroverOptimizer``, el cual utiliza las técnicas descritas en GAS, minimizando un problema de Optimización Binaria Cuadrática sin Restricciones (Quadratic Unconstrained Binary Optimization, QUBO), como se describe en [1]
ja: このノートブックでは、 [1] に記載されているように、制約なし二値変数二次計画問題(QUBO)を最小化することで、GASで記述されている手法を活用した ``GroverOptimizer`` の各コンポーネントを探索します。
ko_kr: 이 노트북에서는 [1] 에 기술된 바와 같이, 이차 제약 없는 이진 최적화(QUBO) 문제를 최소화하여 GAS에서 설명하는 기술을 활용하는 ``GroverOptimizer`` 의 각 구성 요소를 알아볼 것이다.
pt_un: Neste notebook exploraremos cada componente do ` ` GroverOptimizer ` `, que utiliza as técnicas descritas no GAS, minimizando um problema do QUBO (Quadratic Unconstrained Binary Optimization), conforme descrito em [1]
ta: இந்த நோட்புக்கில், GAS இல் விவரிக்கப்பட்டுள்ள நுட்பங்களைப் பயன்படுத்தும் ``GroverOptimizer`` இன் ஒவ்வொரு கூறுகளையும் இருபடி கட்டுப்பாடற்ற பைனரி உகப்பாக்கம் (QUBO) சிக்கலைக் குறைப்பதன் மூலம், [1] ல் விவரிக்கப்பட்டுள்ளபடி, ஆராய்வோம்
th: ใน Notebook นี้เราจะมาดูเกี่ยวกับองค์ประกอบแต่ละส่วนใน ``GroverOptimizer`` ซึ่งใช้เทคนิคที่มีการอธิบายไว้ใน GAS เป็นการหาค่าต่ำที่สุดของโจทย์ปัญหา Quadratic Unconstrained Binary Optimization (QUBO) ตามที่มีการอธิบายไว้ใน [1]

source: References
bn_bn: তথ্যসূত্র
es_un: Referencias
ja: 参考文献
ko_kr: 참조
pt_un: Referências
ta: குறிப்புகள்
th: แหล่งอ้างอิง

source: Grover Adaptive Search
bn_bn: গ্রোভার অ্যাডাপটিভ সার্চ
es_un: Búsqueda Adaptativa de Grover
ja: グローバー適応探索
ko_kr: Grover 적응 검색 (Grover Adaptive Search)
pt_un: Busca Adaptativa de Grover
ta: குரோவர் தகவமைப்பு தேடல்

source: Grover Search, the core element of GAS, needs three ingredients:
bn_bn: GAS এর মূল উপাদান গ্রোভার সার্চের জন্য তিনটি উপাদান প্রয়োজন:
es_un: La Búsqueda de Grover, el elemento central de GAS, necesita de tres ingredientes:
ja: GASのコア要素であるグローバー探索には、3つの材料が必要です:
ko_kr: GAS의 핵심 요소인 Grover Search에는 세 가지 성분이 필요하다.
pt_un: A busca de Grover, elemento principal do GAS, precisa de três ingredientes:
ta: GAS இன் முக்கிய உறுப்பு க்ரோவர் தேடல், அதற்கு மூன்று பகுதிகள் தேவை:
th: Grover Search เป็นองค์ประกอบหลักใน GAS ซึ่งมีการทำงาน 3 ส่วนด้วยกัน:

source: A state preparation operator :math:`A` to construct a superposition of all states in the search space.
bn_bn: একটি মান প্রস্তুতি অপারেটর :math:`A` সার্চ স্পেসে সমস্ত মানের জন্য একটি উপরিপাতন তৈরি করে।
es_un: Un operador de preparación de estado :math:`A` para construir una superposición de todos los estados en el espacio de búsqueda.
ja: 探索スペース内の全ての状態を重ね合わせるための状態準備演算子 :math:`A` 。
ko_kr: 검색 공간 내의 모든 상태들의 중첩을 구성하기 위한 상태 준비 연산자 :math:`A` 가 제공된다.
pt_un: Um operador de preparação de estado :math:`A` para construir uma superposição de todos os estados no espaço de busca.
ta: ஒரு நிலை தயாரிப்பு ஆபரேட்டர்:math:`A` அனைத்து சூப்பர் போசிஷனை நிலைகளை ஒரு தேடல் இடத்தில் உருவாக்கும்.
th: ตัวดำเนินการเตรียมสถานะเชิงควอนตัม :math:`A` เพื่อใช้สร้างสถานะ Superposition ของสถานะที่เป็นไปได้ทั้งหมดในขอบเขตการค้นหา

source: An oracle operator :math:`O`, that recognizes the states of interest and multiplies their amplitudes by -1.
bn_bn: একটি ওরাকল অপারেটর :math:`O` যা আগ্রহের মানগুলি স্বীকৃতি দেয় এবং তাদের বিস্তার -1 দ্বারা বহুগুণ করে।
es_un: Un operador oráculo :math:`O`, que reconoce a los estados de interés y multiplica sus amplitudes por -1.
ja: 関心のある状態を認識し、その振幅を-1で乗算するオラクル演算子 :math:`O` 。
ko_kr: 관심 상태를 인식하고 진폭을 -1 로 곱하는 오라클 연산자 :math:`O` 이다.
pt_un: Operador do oráculo :math:`O`, que reconhece os estados de interesse e multiplica suas amplitudes por -1.
ta: ஒரு ஆரக்கிள் ஆபரேட்டர்:math:`O`, இது பற்று நிலைகளை அங்கீகரிக்கிறது மற்றும் அவற்றின் பெருக்கங்களை -1 ஆல் பெருக்கும்.
th: ตัวดำเนินการ Oracle :math:`O` เป็นตัวที่ทำการคูณแอมพลิจูดของสถานะที่เราสนใจด้วย -1

source: The Grover diffusion operator :math:`D`, that multiplies the amplitude of the :math:`|0\rangle_n` state by -1.
bn_bn: Grover ব্যাপ্তি অপারেটর :math:`D`, যা :math:`|0\rangle_n` বিস্তার এর মান কে -১ দ্বারা গুন করে।
es_un: El operador de difusión de Grover :math:`D`, que multiplica la amplitud del estado :math:`|0\rangle_n` por -1.
ja: :math:`|0\rangle_n` 状態の振幅に -1 を掛けるグローバー拡散演算子 :math:`D` 。
ko_kr: 그로버 확산 연산자 :math:`D` 는 :math:`|0\rangle_n` 상태의 진폭을 -1 로 곱한다.
pt_un: O operador de difusão de Grover :math:`D`, que multiplica a amplitude do estado de :math:`|0\rangle_n`, por -1.
ta: க்ரோவர் பரவல் ஆபரேட்டர்:math:`D`, இது :math:`|0\rangle_n` ன் பெருக்க நிலையை -1 ஆல் பெருக்கும்.
th: ตัวดำเนินการ Grover Diffusion :math:`D` เป็นตัวที่ทำการคูณแอมพลิจูดของสถานะ :math:`|0\rangle_n` ด้วย -1

source: While implementations of GAS vary around the specific use case, the general framework still loosely follows the steps described below.
bn_bn: GAS বাস্তবায়ন নির্দিষ্ট ব্যবহারের ক্ষেত্রে প্রায় পৃথক হলেও সাধারণ কাঠামো এখনও নীচে বর্ণিত পদক্ষেপগুলি আলগাভাবে অনুসরণ করে।
es_un: Si bien las implementaciones de GAS varían según el caso de uso específico, el framework general aún sigue vagamente los pasos que se describen a continuación.
ja: GASの実装は特定のユースケースによって異なりますが、一般的なフレームワークは、以下で説明する手順に大まかに従います。
ko_kr: GAS의 구현은 특정 사용사례에 따라 다르지만, 일반적인 틀은 여전히 아래에 설명된 단계를 대략적으로 따른다.
pt_un: Enquanto as implementações de GAS variam em torno de um caso de uso específico, o framework geral ainda segue livremente os passos descritos abaixo.
ta: குறிப்பிட்ட பயன்பாட்டு வழக்கில் GAS இன் செயல்பாடுகள் வேறுபடுகையில், பொதுவான கட்டமைப்பு இன்னும் கீழே விவரிக்கப்பட்டுள்ள படிகளைப் பின்பற்றுகிறது.
th: วิธีการใช้งาน GAS จะแตกต่างกันไปแล้วแต่โจทย์ปัญหาของเรา โดยเฟรมเวิร์กของขั้นตอนการนำไปใช้งานอธิบายไว้อย่างคร่าว ๆ ดังนี้

source: ``GroverOptimizer`` uses ``QuadraticProgramToNegativeValueOracle`` to construct :math:`A_y` such that it prepares a :math:`n`-qubit register to represent the equal superposition of all :math:`|x\rangle_n` and a :math:`m`-qubit register to (approximately) represent the corresponding :math:`|Q(x)-y\rangle_m`. Then, all states with :math:`(Q(x) - y)` negative should be flagged by :math:`O_y`. Note that in the implementation discussed, the oracle operator is actually independent of :math:`y`, but this is not a requirement. For clarity, we will refer to the oracle as :math:`O` when the oracle is independent of :math:`y`.
bn_bn: ``GroverOptimizer`` :math:`A_y`নির্মাণ করতে ``QuadraticProgramToNegativeValueOracle`` ব্যবহার করে যাতে এটা :math::`n`-qubit রেজিস্টার প্রস্তুত করে যাতে উপরিপাতন প্রতিনিধিত্ব করতে সব :math:`|x\rangle_n` এবং একটি :math:`m`-qubit রেজিস্টার (আনুমানিক) :math:`|Q(x)-y\rangle_m` উপস্থাপন করুন।তারপরে, :math:`(Q(x) - y)` নেতিবাচক সমস্ত মানগুলি :math:`O_y` পতাকা দ্বারা চিহ্নিত করা উচিত। নোট করুন, যে আলোচিত বাস্তবায়নে, ওরাকল অপারেটরটি আসলে :math:`y` এর থেকে স্বতন্ত্র, তবে এটি কোনো প্রয়োজন নয়। স্পষ্টতার জন্য, যখন ওরাকলটি :math:`y` থেকে স্বতন্ত্র থাকে, তখন আমরা ওরাকলকে :math:`O` হিসাবে উল্লেখ করব।
es_un: ``GroverOptimizer`` utiliza ``QuadraticProgramToNegativeValueOracle`` para construir :math:`A_y` de manera que prepara un registro de :math:`n` qubits para representar la superposición igual de todos los :math:`|x\rangle_n` y un registro de :math:`m` qubits para representar (aproximadamente) el correspondiente :math:`|Q(x)-y\rangle_m`. Entonces, todos los estados con una :math:`(Q(x) - y)` negativa deben ser marcados con :math:`O_y`. Ten en cuenta que en la implementación discutida, el operador oráculo es en realidad independiente de :math:`y`, pero esto no es un requisito. Para mayor claridad, nos referiremos al oráculo como :math:`O` cuando el oráculo es independiente de :math:`y`.
ja: ``GroverOptimizer`` は ``QuadraticProgramToNegativeValueOracle`` を使用して :math:`A_y` を構築し、 :math:`n`-qubitレジスタを準備し、 :math:`|x\rangle_n` と :math:`m`-qubitレジスタは対応する :math:`|Q(x)-y\rangle_m` を表します。 次に、 :math:`(Q(x) - y)` の負のすべての状態に :math:`O_y` のフラグが付けられます。 実装では、オラクル演算子は :math:`y` から独立していますが、これは必須ではありません。 明確にするために、オラクルが :math:`y` から独立している場合は、オラクルを :math:`O` として参照します。
ko_kr: ``GroverOptimizer`` 는 모든 :math:`|x\rangle_n` 의 균일한 중첩을 나타내는 :math:`n` 큐비트 레지스터 :math:`A_y` 와 대응되는 :math:`|Q(x)-y\rangle_m` 를 나타내는(근사적으로) :math:`m` 큐비트 레지스터를 구성하기 위해 ``QuadraticProgramToNegativeValueOracle`` 를 사용한다. 그러면, :math:`(Q(x) - y)` 가 음수인 모든 상태들은 :math:`O_y` 에 의해 뒤집혀야 한다. 논의된 구현에서, 오라클 연산자는 실제로 :math:`y` 에 독립적임을 주목하라. 하지만 이것은 요구조건은 아니다. 명확히하기 위해, 오라클이 :math:`y` 에 독립일 때, 오라클을 :math:`O` 라고 표기할 것이다.
pt_un: ``GroverOptimizer`` usa ``QuadraticProgramToNegativeValueOracle`` para construir :math:`A_y` tal que ele prepara um registo de :math:`n`-qubit para representar a superposição igual de todos os :math:`|x\rangle_n` e um registo de :math:`m`-qubit (aproximadamente) que representa o correspondente :math:`|Q(x)-y\rangle_m`. Em seguida, todos os estados com :math:`(Q (x)-y)` negativos devem ser sinalizados por :math:`O_y`. Observe que na implementação discutida, o oráculo operador é efetivamente independente de :math:`y`, mas este não é um requisito. Para a clareza, nos referiremos ao oráculo como :math:`O` quando o oráculo for independente de :math:`y`.
ta: ``GroverOptimizer`` கட்டமைக்க ``QuadraticProgramToNegativeValueOracle`` ஐப் பயன்படுத்துகிறது :math:`A_y` இது ஒரே நேரத்தில் :math:`n`-க்யூபிட் அனைத்து சம மேற்பொருந்துதல் பிரதிநிதித்துவம் பதிவு தயாரிக்கிறது :math:`|x\rangle_n` மற்றும் ஒரு :math:`m`-(தோராயமாக) க்கு க்யூபிட் பதிவு தொடர்புடையதைக் குறிக்கிறது :math:`|Q(x)-y\rangle_m`.பின்னர், அனைத்து மாநிலங்களும் :math:`(Q(x) - y)` எதிர்மறையால் கொடியிடப்பட வேண்டும் :math:`O_y`. விவாதிக்கப்பட்ட செயல்பாட்டில், ஆரக்கிள் ஆபரேட்டர் உண்மையில் சுயாதீனமாக இருப்பதை நினைவில் கொள்க :math:`y`,ஆனால் இது தேவையில்லை. தெளிவுக்காக, ஆரக்கிள் என குறிப்பிடுவோம் :math:`O` ஆரக்கிள் சுயாதீனமாக இருக்கும்போது :math:`y`.
th: ``GroverOptimizer`` ใช้ ``QuadraticProgramToNegativeValueOracle`` เพื่อสร้าง :math:`A_y` เพื่อเป็นการเตรียม :math:`n`-qubit Register ซึ่งเป็น Superposition ของทุก ๆ :math:`|x\rangle_n` และ :math:`m`-qubit Register เพื่อใช้แทนค่า :math:`|Q(x)-y\rangle_m` (โดยประมาณ) จากนั้นทุก ๆ สถานะที่มีค่า :math:`(Q(x) - y)` เป็นลบจะถูกทำเครื่องหมายด้วย :math:`O_y` หมายเหตุ ในแง่ของการใช้งานจริง ตัวดำเนินการ Oracle นั้นทำงานเป็นอิสระจาก :math:`y` แต่ไม่จำเป็นต้องเป็นอิสระเสมอไป เพื่อให้เกิดความชัดเจนเราจะระบุ Oracle เป็น :math:`O` เมื่อ Oracle นั้นเป็นอิสระจาก :math:`y`

source: Put formally, ``QuadraticProgramToNegativeValueOracle`` constructs an :math:`A_y` and :math:`O` such that:
bn_bn: রীত্যনুসারে ``QuadraticProgramToNegativeValueOracle`` :math:`A_y` এবং :math:`O` গঠন করে যাতে:
es_un: Dicho formalmente, ``QuadraticProgramToNegativeValueOracle`` construye un :math:`A_y` y un :math:`O` tal que:
ja: 正式に言えば、 ``QuadraticProgramToNegativeValueOracle`` は、次のような :math:`A_y` と :math:`O` を構成します。
ko_kr: 공식적으로 말하면 ``QuadraticProgramToNegativeValueOracle`` 은 :math:`A_y` 및 :math:`O` 같은것을 구성한다.
pt_un: Formalmente, ``QuadraticProgramToNegativeValueOracle`` constrói um :math:`A_y` e :math:`O` tal que:
ta: முறையாகச் சொன்னால், `` QuadraticProgramToNegativeValueOracle`` ஆனது :math:`A_y`மற்றும் :math:`O` ஐ உருவாக்குகிறது அதுபோல்:
th: นำ ``QuadraticProgramToNegativeValueOracle`` มาเขียนเป็น :math:`A_y` และ :math:`O` ได้:

source: where :math:`|x\rangle` is the binary encoding of the integer :math:`x`.
bn_bn: যেখানে :math:`|x\rangle` হল :math:`x` অখণ্ড সংখ্যার দ্বিমিক (বাইনারি) এনকোডিং।
es_un: donde :math:`|x\rangle` es la codificación binaria del entero :math:`x`.
ja: ここで、 :math:`|x\rangle` は整数 :math:`x` のバイナリーエンコーディングです。
ko_kr: 여기서 :math:`|x\rangle` 은 정수 :math:`x` 의 이진 인코딩이다.
pt_un: onde :math:` |x\rangle` é a codificação binária do número inteiro :math:` x `.
ta: இங்கே :math: `| x\rangle` என்பது :math:` x` என்ற முழு எண்ணின் பைனரி குறியாக்கமாகும்.
th: โดยที่ :math:`|x\rangle` เป็นผลลัพธ์จาก Binary Encoding ของจำนวนเต็ม :math:`x`

source: At each iteration in which the threshold :math:`y` is updated, we adapt :math:`A_y` such that the function values are shifted up or down (for minimum and maximum respectively) by :math:`y`. For example, in the context of finding the minimum, as the value of :math:`y` decreases, the search space (negative values) also decreases, until only the minimum value remains. A concrete example will be explored in the next section.
bn_bn: প্রতিটি পুনরাবৃত্তিতে যেখানে প্রান্তিক :math:`y` আপডেট করা হয়, আমরা অভিযোজিত :math:` A_y` যেমন ফাংশন মানগুলি উপরে বা নিচে স্থানান্তরিত হয় (যথাক্রমে সর্বনিম্ন এবং সর্বাধিকের জন্য) দ্বারা :math:`y`। উদাহরণস্বরূপ, সর্বনিম্ন সন্ধানের প্রসঙ্গে, যেমন :math:`y` এর মান হ্রাস হয়, অনুসন্ধানের স্থানো (নেতিবাচক মান) হ্রাস পায়, যতক্ষণ না কেবল সর্বনিম্ন মান থাকে। এর একটি অবয়ববিশিষ্ট উদাহরণ পরবর্তী বিভাগে খুঁজা হবে।
es_un: En cada iteración en la que se actualiza el umbral :math:`y`, adaptamos :math:`A_y` de manera que los valores de la función se desplazan hacia arriba o hacia abajo (para el mínimo y el máximo respectivamente) por :math:`y`. Por ejemplo, en el contexto de encontrar el mínimo, a medida que el valor de :math:`y` disminuye, el espacio de búsqueda (valores negativos) también disminuye, hasta que solo queda el valor mínimo. Se explorará un ejemplo concreto en la siguiente sección.
ja: 閾値 :math:`y` が更新される毎に、関数値が（それぞれ最小値と最大値に対して）上または下に :math:`y` だけシフトするように :math:`A_y` を適応させます。 たとえば、最小値を見つけるコンテキストでは、:math:`y` の値が減少すると、最小値のみが残るまで、探索空間（負の値）も減少します。 具体的な例については、次のセクションで説明します。
ko_kr: 임계값 :math:`y` 가 업데이트되는 각 반복에서, 우리는 함수 값이 :math:`y` 에 의해 (각각 최소값과 최대값) 위 또는 아래로 이동되도록 :math:`A_y` 를 조정한다. 예를 들어, 최소값을 찾는 맥락에서 :math:`y` 값이 감소하면 최소값만 남을때 까지 검색 공간(음수 값)도 감소한다. 구체적인 예는 다음 섹션에서 살펴볼 것이다.
pt_un: A cada iteração em que o limitante :math:`y` é atualizado, adaptamos :math:`A_y` tal que os valores da função são deslocados para cima ou para baixo (para mínimos e máximos, respectivamente) por :math:`y`. Por exemplo, no problema de encontrar o mínimo, como o valor de :math:`y` diminui, o espaço de busca (valores negativos) também diminui, até que apenas o valor mínimo permaneça. Um exemplo concreto será explorado na próxima seção.
ta: நுழைவு :math:`y` புதுப்பிக்கப்பட்ட ஒவ்வொரு மறு செய்கையிலும், நாங்கள் மாற்றியமைக்கிறோம் :math:`A_y` அதாவது செயல்பாட்டு மதிப்புகள் மேலே அல்லது கீழ் நோக்கி மாற்றப்படுகின்றன (முறையே குறைந்தபட்ச மற்றும் அதிகபட்சம்) :math:`y`. எடுத்துக்காட்டாக, குறைந்தபட்சத்தைக் கண்டுபிடிக்கும் சூழலில், இதன் மதிப்பு :math:`y` குறைகிறது, குறைந்தபட்ச மதிப்பு மட்டுமே இருக்கும் வரை, தேடல் இடமும் (எதிர்மறை மதிப்புகள்) குறைகிறது. ஒரு உறுதியான உதாரணம் அடுத்த பகுதியில் ஆராயப்படும்.
th: ในแต่ละรอบการทำงานที่มีการอัปเดตค่าเกณฑ์ :math:`y` เราจะปรับ :math:`A_y` ซึ่งทำให้ค่าผลลัพธ์ของฟังก์ชันเพิ่มขึ้นหรือลดลง (สำหรับกรณีต่ำสุด และ สูงสุด ตามลำดับ) ด้วย :math:`y` ตัวอย่างเช่นในกรณีที่เราต้องการหาค่าต่ำสุดคือกรณีที่ค่าของ :math:`y` ลดลง ขนาดของขอบเขตการค้นหา (ค่าติดลบ) จะลดลงด้วย จนกว่าจะเหลือเพียงค่าต่ำสุดเพียงค่าเดียว ตัวอย่างเพิ่มเติมจะมีพูดถึงในส่วนถัดไป

source: Find the Minimum of a QUBO Problem using GroverOptimizer
bn_bn: GroverOptimizer ব্যবহার করে কোনো ন্যূনতম QUBO সমস্যার সন্ধান করুন
es_un: Encontrar el Mínimo de un Problema QUBO utilizando GroverOptimizer
ja: GroverOptimizerを使用してQUBO問題の最小値を見つける
ko_kr: GroverOptimizer 를 사용하여 QUBO 문제의 최소값 찾기
pt_un: Encontre o Mínimo de um Problema QUBO usando o otimizador de Grover
ta: GroverOptimizer ஐப் பயன்படுத்தி QUBO சிக்கலின் குறைந்தபட்சத்தைக் கண்டறியவும்
th: หาค่าต่ำที่สุดของโจทย์ปัญหา QUBO ด้วย GroverOptimizer

source: The following is a toy example of a minimization problem.
bn_bn: নিম্নলিখিত একটি লঘুকরণ সমস্যার একটি ছোট্ট উদাহরণ আছে।
es_un: El siguiente es un ejemplo de juguete de un problema de minimización.
ja: 以下は最小化問題のおもちゃの例です。
pt_un: A seguir, um exemplo simples de um problema de minimização.
ta: பின்வருவது சிறுமமாக்கம் சிக்கலின் ஒரு சிறிய எடுத்துக்காட்டு.
th: ต่อไปนี้เป็นตัวอย่างง่าย ๆ สำหรับโจทย์ปัญหาหาค่าต่ำที่สุด

source: For our initial steps, we create a docplex model that defines the problem above, and then use the ``from_docplex_mp()`` function to convert the model to a ``QuadraticProgram``, which can be used to represent a QUBO in Qiskit Optimization.
bn_bn: প্রাথমিক পদক্ষেপরূপে আমরা একটি ডকপ্লেক্স মডেল তৈরি করব যেটা উপরের সমস্যাটিকে সংজ্ঞায়িত করবে, তারপর মডেলটিকে একটি ``QuadraticProgram`` এ রূপান্তর করতে ``from_docplex()`` ফাংশনটি ব্যবহার করব, যা Qiskit অনুকূলকরণে (অপ্টিমাইজেশন) একটা QUBO এর প্রতিনিধিত্ব করতে পারে।
es_un: Para nuestros pasos iniciales, creamos un modelo docplex que define el problema anterior, y luego usamos la función ``from_docplex_mp()`` para convertir el modelo en un ``QuadraticProgram``, que se puede usar para representar un QUBO en Qiskit Optimization.
ja: 最初のステップでは、上記の問題を定義するdocplexモデルを作成します。 そして、``from_docplex_mp()`` 関数を使用してモデルを ``QuadraticProgram`` に変換し、Qiskit Optimization で QUBO を表すために使用できます。
ko_kr: 초기 단계에서는 위의 문제점을 정의하는 docplex 모델을 만들고 ``from_docplex_mp()`` 함수를 사용하여 모델을 Qiskit 최적화에서 QUBO를 나타내기 위해 사용할 수 있는 ``QuadraticProgram`` 으로 변환한다.
pt_un: Para nosso passos iniciais, criamos um modelo docplex que define o problema acima, e então usamos a função ``from_docplex_mp()`` para converter o modelo em um ``QuadraticProgram``, que pode ser usado para representar um QUBO no Qiskit Optimization.
ta: எங்கள் ஆரம்ப படிகளுக்கு, மேலே உள்ள சிக்கலை வரையறுக்கும் டாக்ளெக்ஸ் மாதிரியை நாங்கள் உருவாக்குகிறோம், பின்னர் மாதிரியை ``QuadraticProgram`` ஆக மாற்ற ``from_docplex()`` செயல்பாட்டைப் பயன்படுத்துகிறோம், இது Qiskit மேம்படுத்தலில் ஒரு QUBO ஐக் குறிக்கப் பயன்படுகிறது.
th: สำหรับขั้นตอนแรกเราสร้างโมเดล Docplex ขึ้นมาก่อนซึ่งเป็นโมเดลที่ใช้แทนโจทย์ปัญหาของเรา และใช้ฟังก์ชัน `from_docplex_mp()`` ในการแปลงโมเดลไปเป็น ``QuadraticProgram`` ซึ่งสามารถใช้แทน QUBO ใน Qiskit Optimization ได้
