Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/04_grover_optimizer.po
Languages: bn_bn, es_un, ja, ko_kr, pt_un, ta, th

source: Next, we create a ``GroverOptimizer`` that uses 6 qubits to encode the value, and will terminate after there have been 10 iterations of GAS without progress (i.e. the value of :math:`y` does not change). The ``solve()`` function takes the ``QuadraticProgram`` we created earlier, and returns a results object that contains information about the run.
bn_bn: এরপরে, আমরা একটি ``GroverOptimizer`` তৈরি করব যা মানটি এনকোড করতে ৬ কিউবিট ব্যবহার করে এবং প্রগতি ছাড়াই GAS ১০ টি পুনরাবৃত্তি হওয়ার পরে শেষ হবে (অর্থাৎ :math:`y` এর মান পরিবর্তন হয় না)। ``solve()`` ফাংশনটি আমরা আগে তৈরি ``QuadraticProgram`` নেয় এবং একটি ফলাফল অবজেক্ট দেয় যা রান সম্পর্কে তথ্য ধারণ করে।.
es_un: A continuación, creamos un ``GroverOptimizer`` que usa 6 qubits para codificar el valor y terminará después de que haya habido 10 iteraciones de GAS sin progreso (es decir, el valor de :math:`y` no cambia). La función ``solve()`` toma el ``QuadraticProgram`` que creamos anteriormente y devuelve un objeto de resultados que contiene información sobre la ejecución.
ja: 次に、6 qubit で値をエンコードする ``GroverOptimizer`` を作成します。 そして、進行なしでGASが10回繰り返された後に終了します (つまり :math:`y` の値は変化しません) 。 ``solve()`` 関数は先ほど作成した ``QuadraticProgram`` を受け取り、実行に関する情報を含む結果オブジェクトを返します。
ko_kr: 그 다음에는 6개의 큐비트를 사용하여 값을 인코딩하는 ``GroverOptimizer`` 를 작성하고, 진행되지 않는 GAS의 10번 반복 (즉 :math:`y`의 값이 변경되지 않음) 후 종료됩니다. ``solve()`` 기능은 우리가 초기에 만들었던 ``QuadraticProgram`` 을 취하고, 실행에 대한 정보를 포함하고 있는 결과 객체를 반환한다.
pt_un: Em seguida, criamos um ``GroverOptimizer`` que usa 6 qubits para codificar o valor, e terminará depois que houver 10 iterações de GAS sem progresso (ou seja, o valor de :math:`y` não muda). A função ``solve()`` recebe o ``QuadraticProgram`` que criamos anteriormente, e retorna um objeto resultante que contém informações sobre a execução.
ta: அடுத்து, மதிப்பைக் குறியிட 6 க்யூபிட்களைப் பயன்படுத்தும் ``GroverOptimizer`` ஐ உருவாக்குகிறோம், மேலும் GAS இன் 10 மறு செய்கைகள் முன்னேற்றமின்றி முடிந்தபின் நிறுத்தப்படும் (அதாவது கணிதத்தின் மதிப்பு :math:`y` மாறாது). ``solve()`` செயல்பாடு நாம் முன்னர் உருவாக்கிய ``QuadraticProgram`` ஐ எடுத்து, ரன் பற்றிய தகவல்களைக் கொண்ட ஒரு முடிவு பொருளை வழங்குகிறது.
th: ถัดไปเราสร้าง ``GroverOptimizer`` ซึ่งใช้ 6 คิวบิตในการเก็บข้อมูล และจะจบการทำงานเมื่อ GAS ทำงานผ่านไป 10 รอบโดยที่ไม่เห็นความคืบหน้า (ได้แก่ ในกรณีที่ค่าของ :math:`y` ไม่เปลี่ยนแปลง) ฟังก์ชัน ``solve()`` ใช้ ``QuadraticProgram`` ที่เราสร้างไว้ก่อนหน้านี้ และส่งออบเจ็กต์ของผลลัพธ์กลับมา โดยที่ภายในมีข้อมูลต่าง ๆ เกี่ยวกับการทำงาน

source: This results in the optimal solution :math:`x_0=1`, :math:`x_1=0`, :math:`x_2=1` and the optimal objective value of :math:`-6` (most of the time, since it is a randomized algorithm). In the following, a custom visualization of the quantum state shows a possible run of ``GroverOptimizer`` applied to this QUBO.
bn_bn: এটি সর্বোত্তম সমাধানে ফলাফল :math:`x_0 = 1`, :math:` x_1 = 0`, :math: `x_2 = 1` এবং সর্বোত্তম উদ্দেশ্য মান :math:` -6` (বেশিরভাগ সময়, যেহেতু এটি রন্ডমাইজড অ্যালগরিদম)। নিম্নলিখিতটিতে, কোয়ান্টাম মানের একটি বিশেষায়িত চিত্রায়ন (কাস্টম ভিজ্যুয়ালাইজেশন) এই QUBO তে প্রয়োগ হওয়া ``GroverOptimizer`` এর একটি সম্ভাব্য রান দেখায়।
es_un: Esto resulta en la solución óptima :math:`x_0=1`, :math:`x_1=0`, :math:`x_2=1` y el valor objetivo óptimo de :math:`-6` (la mayoría del tiempo, ya que es un algoritmo randomizado). A continuación, una visualización personalisada del estado cuántico muestra una posible ejecución de ``GroverOptimizer`` aplicada a este QUBO.
ja: この結果、最適解 :math:`x_0=1` 、 :math:`x_1=0` 、:math:`x_2=1` が得られ、最適目的値は :math:`-6` となります（ほとんどの時間は、ランダム化されたアルゴリズムによる）。 以下の例では、量子状態のカスタム可視化は、このQUBOに適用される ``GroverOptimizer`` の実行可能性が示されています。
ko_kr: 이는 최적의 용액 :math:`x_0=1`, :math:`x_1=0`, :math:`x_2=1` 및 :math:`-6` 의 최적 목표 값을 초래한다 (대부분의 경우, 이는 랜덤화 알고리즘이기 때문이다). 다음은 이 QUBO에 적용된 ``GroverOptimizer`` 의 가능한 실행이 다음과 같다.
pt_un: Este resultado é a solução ótima :math:` x_0 = 1 `, :math:` x_1 = 0 `, :math:` x_2 = 1 ` e o valor objetivo de :math:` -6 ` (na maioria das vezes, considerando que é um algoritmo randomizado). Posteriormente, uma visualização customizada do estado quântico mostra uma possível execução de `` GroverOptimizer `` aplicada a este QUBO.
ta: இது உகந்த தீர்வில் விளைகிறது:math: `x_0 = 1` ,:math:` x_1 = 0` ,:math: `x_2 = 1` மற்றும் உகந்த புறநிலை மதிப்பு :math:` -6` (பெரும்பாலான நேரம் , இது ஒரு சீரற்ற வழிமுறை என்பதால்). பின்வருவனவற்றில், குவாண்டம் நிலையின் தனிப்பயன் காட்சிப்படுத்தல் இந்த QUBO க்குப் பயன்படுத்தப்படும் ``GroverOptimizer`` இன் சாத்தியமான ஓட்டத்தைக் காட்டுகிறது.
th: ผลลัพธ์ที่ดีที่สุดที่ได้เป็น :math:`x_0=1`, :math:`x_1=0`, :math:`x_2=1` และ ค่าที่ดีที่สุดของฟังก์ชันวัตถุประสงค์คือ :math:`-6` (ดีที่สุดในการทำงานครั้งนี้ เนื่องจากเป็นการทำงานแบบสุ่ม) ในส่วนถัดไปภาพแสดงของสถานะทางควอนตัมแสดงให้เห็นถึงผลลัพธ์ที่เป็นไปได้จากการทำงานของ ``GroverOptimizer`` เมื่อใช้งานกับ QUBO นี้

source: Each graph shows a single iteration of GAS, with the current values of :math:`r` (= iteration counter) and :math:`y` (= threshold/offset) shown in the title. The X-axis displays the integer equivalent of the input (e.g. ‘101’ :math:`\rightarrow` 5), and the Y-axis shows the possible function values. As there are 3 binary variables, there are :math:`2^3=8` possible solutions, which are shown in each graph. The color intensity indicates the probability of measuring a certain result (with bright intensity being the highest), while the actual color indicates the corresponding phase (see phase color-wheel below). Note that as :math:`y` decreases, we shift all of the values up by that amount, meaning there are fewer and fewer negative values in the distribution, until only one remains (the minimum).
bn_bn: প্রতিটি গ্রাফ শিরোনামে প্রদর্শিত :math:`r` (= পুনরুক্তি কাউন্টার) এবং :math:`y` (= প্রান্তিক/অফসেট) এর বর্তমান মানগুলির সাথে GAS এর একক পুনরাবৃত্তি দেখায়। X-অক্ষটি নিবেশের (ইনপুটের) সমতুল্য পূর্ণসংখ্যা প্রদর্শন করে (উদাঃ ‘101’ :math:`\rightarrow` 5), এবং Y-অক্ষটি সম্ভাব্য ফাংশন মানগুলি দেখায়। যেমন এখনে ৩ টি দ্বিমিক (বাইনারি) চল রাশি রয়েছে, তেমন :math:`2^3=8` সম্ভাব্য সমাধান রয়েছে, যেটা প্রতিটি গ্রাফে প্রদর্শিত করা হয়েছে। রঙের তীব্রতা একটি নির্দিষ্ট ফলাফলের পরিমাপের সম্ভাবনা নির্দেশ করে (উজ্জ্বল তীব্রতা সর্বাধিক থাকে), তবে প্রকৃত রঙটি সংশ্লিষ্ট দশাটি নির্দেশ করে (নিচে দশার রঙ-চাকাটি দেখুন)। নোট করুন, যে হিসাবে :math:`y` হ্রাস হয়, আমরা সমস্ত মানকে সেই পরিমাণে উপরে স্থানান্তরিত করি, অর্থাত বিতরণে কম এবং কম নেতিবাচক মান রয়েছে, যতক্ষণ না কেবল একটি অবশেষ থাকে (সর্বনিম্ন)।
es_un: Cada gráfica muestra una sola iteración de GAS, con los valores actuales de :math:`r` (= contador de iteraciones) y :math:`y` (= umbral/compensación) mostrados en el título. El eje X muestra el entero equivalente de la entrada (ppor ejemplo, ‘101’ :math:`\rightarrow` 5), y el eje Y muestra los posibles valores de la función. Como hay 3 variables binarias, hay :math:`2^3=8` posibles soluciones, que se muestran en cada gráfica. La intensidad del color indica la probabilidad de medir un resultado determinado (siendo la intensidad del brillo la más alta), mientras que el color en sí indica la fase correspondiente (consulta la rueda de color de fase a continuación). Ten en cuenta que a medida que :math:`y` disminuye, desplazamos todos los valores hacia arriba por esa cantidad, lo que significa que hay cada vez menos valores negativos en la distribución, hasta que solo queda uno (el mínimo).
ja: 各グラフはGASの単一の反復を示しており、 :math:`r` (= 反復カウンター) と :math:`y` (= 閾値 / オフセット) の現在の値がタイトルに示されています。X軸は入力に相当する整数 (例: '101' :math:`\rightarrow` 5) を表示し、Y軸は可能な関数値を表示します。3つのバイナリ変数があるため、 :math:`2^3=8` の可能な解決策があり、各グラフに示されています。色の強度は特定の結果を測定する確率を示し (明るい強度が最も高い) 、実際の色は対応するフェーズを示します (以下のフェーズのカラーホイールを参照) 。 :math:`y` が減少すると、すべての値がその量だけ上にシフトすることに注意してください。つまり、1つだけが残る (最小) まで、分布内の負の値はますます少なくなります。
ko_kr: 각 그래프는 제목에 표시된 :math:`r` (= 반복 카운터) 및 :math:`y` (= threshold/offset) 의 현재 값을 사용하여 GAS의 단일 반복을 보여 준다. X축은 입력의 정수 등가 (예 '101' :math:`\rightarrow` 5) 를 표시하고 Y축은 가능한 함수 값을 표시합니다. 3개의 바이너리 변수가 있기 때문에, :math:`2^3=8` 의 가능한 솔루션들이 있으며, 이들은 각각의 그래프에 도시되어 있다. 색 강도는 (밝은 강도가 가장 높은) 특정 결과를 측정하는 확률을 나타내는 반면, 실제 색은 대응하는 상을 나타낸다 (아래의 위상 칼라-휠 참조). :math:`y` 가 감소하면 모든 값을 그 양만큼 위로 이동시킵니다. 즉, 단 하나만 남을 때까지 (최소) 분포에 음수 값이 더 적은 것을 의미합니다.
pt_un: Cada gráfico mostra uma única iteração do GAS, com os valores atuais de :math:`r` (= contador de iteração) e :math:`y` (= limite/deslocamento) mostrado no título. O eixo X exibe o equivalente inteiro da entrada (por exemplo, ‘101’ :math:`\rightarrow` 5), e o eixo Y mostra os possíveis valores da função. Como existem 3 variáveis binárias, há :math:`2^3=8` possíveis soluções, que são mostradas em cada gráfico. A intensidade da cor indica a probabilidade de medir um determinado resultado (com a maior intensidade de brilho sendo a mais alta), enquanto que a própria cor indica a fase correspondente (veja a roda de cores da fase abaixo). Observe que conforme :math:`y` diminui, nós deslocamos todos os valores para cima por essa quantidade, significando que há cada vez menos valores negativos na distribuição, até que apenas um permaneça (o mínimo).
ta: ஒவ்வொரு வரைபடமும் GAS இன் ஒற்றை மறு செய்கையை காட்டுகிறது, தற்போதைய மதிப்புகள் :math:`r` (= மறு செய்கை கவுண்டர்) மற்றும் :math:`y` (= வாசல் / ஆஃப்செட்) தலைப்பில் காட்டப்பட்டுள்ளது. X-அச்சு உள்ளீட்டுக்கு சமமான முழு எண்ணைக் காட்டுகிறது (எ.கா. ‘101’ :math:`\rightarrow` 5), மற்றும் Y-அச்சு சாத்தியமான செயல்பாட்டு மதிப்புகளைக் காட்டுகிறது. 3 பைனரி மாறிகள் இருப்பதால், :math:`2 ^ 3 = 8` சாத்தியமான தீர்வுகள், அவை ஒவ்வொரு வரைபடத்திலும் காட்டப்படுகின்றன. வண்ண தீவிரம் ஒரு குறிப்பிட்ட முடிவை அளவிடுவதற்கான நிகழ்தகவைக் குறிக்கிறது (பிரகாசமான தீவிரம் மிக உயர்ந்ததாக இருக்கும்), உண்மையான நிறம் தொடர்புடைய கட்டத்தைக் குறிக்கிறது (கீழே கட்ட வண்ண-சக்கரத்தைக் காண்க). :math:`y` குறைகிறது எனில், எல்லா மதிப்புகளையும் அந்த அளவு மூலம் மாற்றுவோம், அதாவது விநியோகத்தில் குறைவான மற்றும் குறைவான எதிர்மறை மதிப்புகள் உள்ளன, ஒன்று மட்டுமே இருக்கும் வரை (குறைந்தபட்சம்).
th: แต่ละกราฟแสดงผลของการทำงาน 1 รอบของ GAS ด้วยค่า :math:`r` (= iteration counter) และ :math:`y` (= threshold/offset) ในปัจจุบันตามที่เห็นในหัวข้อ แกน X คือค่าข้อมูลรับเข้าที่เป็นจำนวนเต็ม (เช่น ‘101’ :math:`\rightarrow` 5) และ แกน Y คือผลลัพธ์ของฟังก์ชันที่เป็นไปได้ จากการที่มีตัวแปรไบนารี่ขนาด 3 ทำให้มีคำตอบที่เป็นไปได้ทั้งหมด :math:`2^3=8` แบบ ซึ่งแสดงอยู่ในแต่ละกราฟ ความเข้มของสีหมายถึงความน่าจะเป็นของการเจอผลลัพธ์นั้น ๆ (ยิ่งสว่างยิ่งมีความน่าจะเป็นสูง) ในส่วนของสีจริง ๆ นั้นเป็นตัวบอกเฟส (ดูวงจรสีกับค่าที่สัมพันธ์ได้ด้านล่าง) หมายเหตุ เมื่อ :math:`y` ลดลง เราจะเพิ่มค่าทุกค่าขึ้นไปเท่ากับค่าที่ลดลงนั้น หมายความว่าเมื่อผ่านไปหลาย ๆ รอบการทำงาน จะทำให้มีค่าติดลบในการกระจายตัวของคำตอบน้อยลงเรื่อย ๆ จนเหลือเพียงค่าเดียวที่เป็นค่าต่ำสุด

source: Check that GroverOptimizer finds the correct value
bn_bn: পরীক্ষা করে দেখুন যে GroverOptimizer সঠিক মানটি পাচ্ছে
es_un: Comprobar que GroverOptimizer encuentra el valor correcto
ja: GroverOptimizerが正しい値を見つけることの確認
pt_un: Verifique se o otimizador de Grover encontra o valor correto
ta: GroverOptimizer சரியான மதிப்பைக் காண்கிறதா என்று சரிபார்க்கவும்
th: ตรวจสอบว่า GroverOptimizer สามารถหาคำตอบได้ถูกต้องหรือไม่

source: We can verify that the algorithm is working correctly using the ``MinimumEigenOptimizer`` in Qiskit.
bn_bn: আমরা যাচাই করতে পারি যে সমাধানপদ্ধতিটি Qiskit এ ``MinimumEigenOptimizer`` ব্যবহার করে সঠিকভাবে কাজ করছে।
es_un: Podemos verificar que el algoritmo está funcionando correctamente usando el ``MinimumEigenOptimizer`` en Qiskit.
ja: Qiskitの ``MinimumEigenOptimizer`` を使用してアルゴリズムが正しく動作していることを確認できます。
ko_kr: 이 알고리즘이 Qiskit 에서 ``MinimumEigenOptimizer`` 을 사용하여 올바르게 작동 중인지 확인할 수 있다.
pt_un: Podemos verificar se o algoritmo está funcionando corretamente usando o ``MinimumEigenOptimizer`` no Qiskit.
ta: கிஸ்கிட்டில் உள்ள ``MinimumEigenOptimizer`` ஐப் பயன்படுத்தி வழிமுறை சரியாக வேலை செய்கிறது என்பதை நாங்கள் சரிபார்க்க முடியும்.
th: เราสามารถตรวจคำตอบได้ด้วยกสนใช้ ``MinimumEigenOptimizer`` ใน Qiskit
