Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/05_admm_optimizer.po
Languages: bn_bn, de, es_un, it, ja, ko, pt_un, ta_in, th

source: To invoke the 3-ADMM-H algorithm, an instance of the ``ADMMOptimizer`` class needs to be created. This takes ADMM-specific parameters and the subproblem optimizers separately into the constructor. The solution returned is an instance of ``OptimizationResult`` class.
bn_bn: 3-ADMM-H অ্যালগরিদম আহবান করার জন্য, ``ADMMOptimizer`` শ্রেণীর একটি উদাহরণ তৈরি করা প্রয়োজন। এটি ADMM- specific পরামিতি এবং উপ-সমস্যা অপ্টিমাইজারগুলিকে আলাদাভাবে কনস্ট্রাক্টরের মধ্যে নিয়ে যায়। সমাধানটি ``OptimizationResult`` শ্রেণীর একটি উদাহরণ।
de: Um den 3-ADMM-H-Algorithmus aufzurufen, muss eine Instanz der ``ADMMOptimizer`` -Klasse erstellt werden. Dabei werden ADMM-spezifische Parameter und die Subproblemoptimierer separat im Konstruktor verwendet. Bei der zurückgegebenen Lösung handelt es sich um eine Instanz der Klasse ``OptimizationResult``.
es_un: Para invocar el algoritmo 3-ADMM-H, es necesario crear una instancia de la clase ``ADMMOptimizer``. Esto toma los parámetros específicos de ADMM y los optimizadores de los subproblemas por separado en el constructor. La solución devuelta es una instancia de la clase ``OptimizationResult``.
it: Per invocare l'algoritmo 3-ADMM-H, è necessario creare un'istanza della classe ``ADMMOptimizer``. Questo richiede parametri specifici per l'ADMM e gli ottimizzatori del sottoproblema separatamente nel costruttore. La soluzione restituita è un'istanza della classe ``OptimizationResult``.
ja: 3-ADMM-H アルゴリズムを呼び出すには、``ADMMOptimizer`` クラスのインスタンスを作成する必要があります。 これにより、ADMM固有のパラメータとサブ問題のオプティマイザがコンストラクターに分離されます。返されるソリューションは、``OptimizationResult`` クラスのインスタンスです。
ko: 3-ADMM-H 알고리즘을 호출하기 위해 ``ADMMOptimizer`` 클래스의 인스턴스를 만들어야 한다. 이는 ADMM-특정 파라미터 및 하위 문제점 최적화 프로그램을 컨스트럭터에 개별적으로 취한다. 반환된 솔루션은 ``OptimizationResult`` 클래스의 인스턴스이다.
pt_un: Para invocar o algoritmo 3-ADMM-H, uma instância da classe ``ADMMOptimizer`` precisa ser criada. Isto gera parâmetros específicos de ADMM e otimizadores de subproblemas separadamente para o construtor. A solução retornada é uma instância da classe ``OptimizationResult``.
ta_in: 3-ADMM-H வழிமுறையைப் பயன்படுத்த, ``ADMMOptimizer`` வகுப்பின் ஒரு உதாரணத்தை உருவாக்க வேண்டும். இது ADMM- குறிப்பிட்ட அளவுருக்கள் மற்றும் சப்ரோப்ளம் ஆப்டிமைசர்களை தனித்தனியாக கட்டமைப்பாளருக்குள் எடுக்கும். வழங்கப்பட்ட தீர்வு ``OptimizationResult`` வகுப்பின் ஒரு எடுத்துக்காட்டு.
th: ในการเรียกใช้งานอัลกอริทึม 3-ADMM-H เราจำเป็นต้องประกาศคลาส ``ADMMOptimizer`` ขึ้นมาก่อน โดยการประกาศเราจะต้องกำหนดพารามิเตอร์และออบเจกต์ของโจทย์ปัญหาเข้าไปใน ADMM Constructor ในส่วนของผลลัพธ์จะถูกส่งกับออกมาในรูปแบบคลาส ``OptimizationResult``

source: Classical Solver Result
bn_bn: ক্লাসিকাল সমাধান এর উত্তর
de: Ergebnis des klassischen Solvers
es_un: Resultado del Solucionador Clásico
it: Risultato del Risolutore Classico
ja: 古典ソルバーの結果
ko: 고전적인 해석기(Solver) 결과
pt_un: Resultado do Solver Clássico
ta_in: கிளாசிக்கல் சால்வர் முடிவு
th: คำตอบจากอัลกอริทึมแบบดั้งเดิม

source: The 3-ADMM-H solution can be then printed and visualized. The ``x`` attribute of the solution contains respectively, the values of the binary decision variables and the values of the continuous decision variables. The ``fval`` is the objective value of the solution.
bn_bn: 3-ADMM-H সমাধান তারপর মুদ্রিত এবং কল্পনা করা যেতে পারে। সমাধানের ``x`` অ্যাট্রিবিউট যথাক্রমে, বাইনারি সিদ্ধান্ত ভেরিয়েবলের মান এবং ক্রমাগত সিদ্ধান্ত ভেরিয়েবলের মান রয়েছে। ``Fval`` হল সমাধানের উদ্দেশ্য মান।
de: Die 3-ADMM-H Lösung kann dann ausgedruckt und visualisiert werden. Das ``x`` -Attribut der Lösung enthält jeweils die Werte der binären Entscheidungsvariablen und die Werte der kontinuierlichen Entscheidungsvariablen. Der ``fval`` ist der Zielwert der Lösung.
es_un: A continuación, se puede imprimir y visualizar la solución del 3-ADMM-H. El atributo ``x`` de la solución contiene, respectivamente, los valores de las variables de decisión binarias y los valores de las variables de decisión continuas. El ``fval`` es el valor objetivo de la solución.
it: La soluzione 3-ADMM-H può essere stampata e visualizzata. L'attributo ``x`` della soluzione contiene, rispettivamente, i valori delle variabili di decisione binaria e i valori delle variabili continue di decisione. ``fval`` è il valore obiettivo della soluzione.
ja: 3-ADMM-Hソリューションをプリントして可視化することができます。 解の ``x`` 属性には、バイナリー決定変数の値と連続決定変数の値がそれぞれ含まれています。 ``fval`` はその解の目的値です。
ko: 이어서, 3-ADMM-H 용액을 인쇄하고 가시화할 수 있다. 솔루션의 ``x`` 속성은 각각, 2진 결정 변수들의 값들 및 연속적인 결정 변수들의 값들을 포함한다. ``fval`` 은 해법의 객관적 가치이다.
pt_un: A solução 3-ADMM-H pode ser impressa e visualizada. O atributo ``x`` da solução contém respectivamente, os valores das variáveis de decisão binária e os valores das variáveis de decisão contínua. O ``fval`` é o valor objetivo da solução.
ta_in: 3-ADMM-H தீர்வு பின்னர் அச்சிடப்பட்டு காட்சிப்படுத்தப்படலாம். தீர்வின் ``x`` பண்பு முறையே, பைனரி முடிவு மாறிகள் மற்றும் தொடர்ச்சியான முடிவு மாறிகளின் மதிப்புகள் ஆகியவற்றைக் கொண்டுள்ளது. ``fval`` என்பது தீர்வின் புறநிலை மதிப்பு.
th: เราสามารถแสดงคำตอบของ 3-ADMM-H ได้ โดย Attribute ``x`` ของคำตอบจะมีข้อมูล ค่าคำตอบของตัวแปรไบนารี่และค่าคำตอบของตัวแปรต่อเนื่อง ค่า ``fval`` คือค่าฟังก์ชันวัตถุประสงค์ของคำตอบ

source: Solution statistics can be accessed in the ``state`` field and visualized. We here display the convergence of 3-ADMM-H, in terms of primal residuals.
bn_bn: সমাধান পরিসংখ্যান ``state`` ক্ষেত্রে অ্যাক্সেস করা যেতে পারে এবং দৃশ্যায়িত করা যায়। আমরা এখানে প্রাথমিক অবশিষ্টাংশের পরিপ্রেক্ষিতে 3-ADMM-H এর সংমিশ্রণ প্রদর্শন করি।
de: Die Lösungsstatistik kann im ``state`` -Feld aufgerufen und visualisiert werden. Wir zeigen hier die Konvergenz von 3-ADMM-H, in Bezug auf primäre Residuen.
es_un: Se puede acceder a las estadísticas de la solución en el campo ``state`` y visualizarlas. Aquí mostramos la convergencia de 3-ADMM-H, en términos de residuos primarios.
it: Le statistiche della soluzione possono essere consultate nel campo ``state`` e visualizzate. Qui mostriamo la convergenza di 3-ADMM-H, in termini di residui primari.
ja: ``state`` フィールドで解の解析統計にアクセスし可視化することができます。ここでは、原始残差の観点から、3-ADMM-Hの収束を示します。
ko: 솔루션 통계는 ``state`` 필드에서 액세스할 수 있으며 시각화할 수 있다. 여기서는 3-ADMM-H의 수렴을 원시 잔차(primal residual) 로 표시한다.
pt_un: As estatísticas de solução podem ser acessadas e visualizadas no campo ``state``. Aqui mostramos a convergência de 3-ADMM-H, em termos de resíduos primitivos.
ta_in: தீர்வு புள்ளிவிவரங்களை ``state`` புலத்தில் அணுகலாம் மற்றும் காட்சிப்படுத்தலாம். முதன்மை எச்சங்களின் அடிப்படையில், 3-ADMM-H இன் ஒருங்கிணைப்பை இங்கு காண்பிக்கிறோம்.
th: ค่าทางสถิติของคำตอบสามารถเข้าดูได้ผ่าน ``state`` โดยสามารถนำมาแสดงการลู่เข้าในแง่ของ Primal Residual ได้

source: Quantum Solution
bn_bn: কোয়ান্টাম সমাধান
de: Quantenlösung
es_un: Solución Cuántica
it: Soluzione Quantistica
ja: 量子ソリューション
ko: 양자 솔루션
pt_un: Solução Quântica
ta_in: குவாண்டம் தீர்வு
th: วิธีการแบบควอนตัม

source: We now solve the same optimization problem with QAOA as QUBO optimizer, running on simulated quantum device. First, one need to select the classical optimizer of the eigensolver QAOA. Then, the simulation backend is set. Finally, the eigensolver is wrapped into the ``MinimumEigenOptimizer`` class. A new instance of ``ADMMOptimizer`` is populated with QAOA as QUBO optimizer.
bn_bn: সিমুলেটেড কোয়ান্টাম ডিভাইসে চলমান আমরা এখন QUBO অপটিমাইজার হিসাবে QAOA এর সাথে একই অপটিমাইজেশন সমস্যাটি সমাধান করি। প্রথমে, eigensolver দিয়ে QAOA ক্লাসিকাল অপ্টিমাইজার নির্বাচন করা দরকার। তারপরে, সিমুলেশন ব্যাকএন্ড সেট করা আছে। শেষ অবধি, eigensolver টি `` ন্যূনতমএইগেন অপটিমাইজার `` শ্রেণিতে আবৃত হয়। ``ADMMOptimizer`` এর নতুন instance টি QAOA আর QUBO অপ্টিমাইজার দিয়ে সমৃদ্ধ।
de: Wir lösen jetzt das gleiche Optimierungsproblem mit QAOA als QUBO Optimierungsprogramm, das auf simulierten Quantcomputern läuft. Zuerst muss man den klassischen Optimierer des Eigensolvers QAOA auswählen. Anschließend wird das Simulations-Backend gesetzt. Schließlich wird der Eigensolver in die ``MinimumEigenOptimizer`` -Klasse eingebettet. Eine neue Instanz von ``ADMMOptimizer`` wird mit QAOA als QUBO-Optimierungsprogramm gefüllt.
es_un: Ahora resolvemos el mismo problema de optimización con QAOA como optimizador QUBO, ejecutándolo en un dispositivo cuántico simulado. Primero, es necesario seleccionar el optimizador clásico del solucionador propio QAOA. Luego, se configura el backend de simulación. Finalmente, el solucionador propio se incluye en la clase ``MinimumEigenOptimizer``. Una nueva instancia de ``ADMMOptimizer`` se completa con QAOA como optimizador QUBO.
it: Ora risolviamo lo stesso problema di ottimizzazione con il QAOA come ottimizzatore QUBO, in esecuzione su dispositivo quantistico simulato. In primo luogo, è necessario selezionare l'ottimizzatore classico dell'eigensolver QAOA. Poi, viene impostato il backend di simulazione. Infine, l'eigensolver è avvolto nella classe ``MinimumEigenOptimizer``. Una nuova istanza di ``ADMMOptimizer`` è popolata con il QAOA come ottimizzatore QUBO.
ja: シミュレートされた量子デバイス上で実行されるQUBOオプティマイザーと同じQAOAの最適化問題を解決します。まず、固有値ソルバーQAOAの古典的なオプティマイザーを選択する必要があります。次に、シミュレーションバックエンドが設定されます。最後に、固有ソルバーは ``MinimumEigenOptimizer`` クラスにラップされます。 ``ADMMOptimizer`` の新しいインスタンスには、QUBOオプティマイザーとしてQAOAが入力されます。
ko: 이제 QAOA와 같은 최적화 문제점을 QAOA 최적화 프로그램으로 해결하여 시뮬레이트된 양자 디바이스에서 실행한다. 첫 번째로, 고유 해결사 QAOA의 전형적인 최적화 프로그램을 선택해야 한다. 그런 다음, 시뮬레이션 백엔드가 설정된다. 마지막으로 고유해결자(eigensolver) 는 ``MinimumEigenOptimizer`` 클래스로 포장된다. ``ADMMOptimizer`` 의 새로운 인스턴스는 QUBO 최적기로서 QAOA로 채워져있다.
pt_un: Agora resolvemos o mesmo problema de otimização com QAOA que o otimizador de QUBO, rodando em dispositivos quânticos simulados. Primeiro, é necessário selecionar o otimizador clássico do eigensolver QAOA. Em seguida, o backend da simulação é definido. Finalmente, o eigensolver é envolvido na classe ``MinimumEigenOptimizer``. Uma nova instância de ``ADMMOptimizer`` é preenchida com QAOA como otimizador de QUBO.
ta_in: QUBO ஆப்டிமைசரின் QAOA உடன் அதே தேர்வுமுறை சிக்கலை நாங்கள் இப்போது தீர்க்கிறோம், உருவகப்படுத்தப்பட்ட குவாண்டம் சாதனத்தில் இயங்குகிறது. முதலில், ஈஜென்சால்வர் QAOA இன் கிளாசிக்கல் ஆப்டிமைசரைத் தேர்ந்தெடுக்க வேண்டும். பின்னர், உருவகப்படுத்துதல் பின்தளமானது அமைக்கப்பட்டது. இறுதியாக, ஈஜென்சால்வர் "மினிமம் ஐஜென் ஆப்டிமைசர்" வகுப்பில் மூடப்பட்டுள்ளது. "ADMMஆப்டிமைசர்" இன் ஒரு புதிய உதாரணம் QAOA உடன் QUBO ஆப்டிமைசராக நிரம்பியுள்ளது.
th: เราสามารถนำโจทย์ปัญหา Optimization นี้มาใช้งานกับอัลกอริทึม QAOA บนเครื่องควอนตัมคอมพิวเตอร์ได้ด้วย QUBO Optimizer ในขั้นตอนแรกให้เราเลือกอัลกอริทึมแบบดั้งเดิมสำหรับการใช้ใน Eigensolver QAOA ถัดไปทำการตั้งค่าตัวจำลอง Backend สุดท้าย Eigensolver จะถูก Wrap รวมไว้ในคลาส ``MinimumEigenOptimizer`` ออบเจกต์ ``ADMMOptimizer`` ใหม่ที่ได้จะมีการเพิ่ม QAOA เข้ามาในลักษณะของ QUBO Optimizer

source: Quantum Solver Results
bn_bn: কোয়ান্টাম সমাধানকারক এর ফলাফল
de: Ergebnisse des Quantum Solvers
es_un: Resultados de Solucionador Cuántico
it: Risultati ottenuti dal Quantum Solver
ja: 量子ソルバーの結果
ko: 양자 해석기(Solver) 결과
pt_un: Resultados de Solver Quânticos
ta_in: குவாண்டம் சால்வர் முடிவுகள்
th: คำตอบจากควอนตัมอัลกอริทึม

source: Here we present the results obtained from the quantum solver. As in the example above ``x`` stands for the solution, the ``fval`` is for objective value.
bn_bn: এখানে আমরা কোয়ান্টাম সমাধানকারক এর ফলাফল গুলি উপস্থাপন করলাম. উপরের উদাহরণ এ ``x`` হলো সমাধান এবং ``fval`` উদ্দেশ্য মান হিসাবে চিহ্নিত।
de: Hier präsentieren wir die Ergebnisse, die aus dem Quantensolver gewonnen wurden. Wie in dem obigen Beispiel ``x`` steht für die Lösung und ``fval`` steht für den Zielwert.
es_un: Aquí presentamos los resultados obtenidos del solucionador cuántico. Como en el ejemplo anterior, ``x`` representa la solución, el ``fval`` es el valor objetivo.
it: Qui presentiamo i risultati ottenuti dal quantum solver. Come nell'esempio sopra ``x`` sta per soluzione, ``fval`` per valore oggettivo.
ja: ここでは、量子ソルバーから得られた結果を紹介します。 上の例のように、``x`` はソリューションの略で、``fval`` は目的値を表します。
ko: 여기서 우리는 양자 해결기로부터 얻어진 결과를 제공한다. 위의 예에서 보듯이 ``x`` 는 해법을 뜻하기 때문에 ``fval`` 은 객관적인 가치를 위한 것이다.
pt_un: Apresentamos aqui os resultados obtidos a partir da solução quântica. Como no exemplo acima de ``x`` significa a solução, o ``fval`` é o valor objetivo.
ta_in: குவாண்டம் தீர்விலிருந்து பெறப்பட்ட முடிவுகளை இங்கே முன்வைக்கிறோம். மேலே உள்ள எடுத்துக்காட்டில் `` x`` என்பது தீர்வைக் குறிக்கிறது, `` fval`` என்பது புறநிலை மதிப்புக்கு.
th: ในส่วนนี้เราได้มีการแสดงผลลัพธ์จากควอนตัมอัลกอริทึม โดย ``x`` ที่ได้คือคำตอบของโจทย์ปัญหา และ ``fval`` คือค่าฟังก์ชันวัตถุประสงค์ของคำตอบ

source: ``MinimumEigenOptimizer`` using different ``MinimumEigensolver``, such as ``VQE``, ``QAOA`` or ``NumpyMinimumEigensolver`` (classical)
ta_in: ``MinimumEigenOptimizer``, ஆனது ``VQE``, ``QAOA`` அல்லது ``NumpyMinimumEigensolver`` (கிளாசிக்கல்) போன்ற வெவ்வேறு ``MinimumEigensolver`` -ஐப் பயன்படுத்தி

source: ``CobylaOptimizer``
ta_in: ``கோபிலா ஆப்டிமைசர்``

source: 3-ADMM-H needs a QUBO optimizer to solve the QUBO subproblem, and a continuous optimizer to solve the continuous convex constrained subproblem. We first solve the problem classically: we use the ``MinimumEigenOptimizer`` with the ``NumPyMinimumEigenSolver`` as a classical and exact QUBO solver and we use the ``CobylaOptimizer`` as a continuous convex solver. 3-ADMM-H supports any other suitable solver available in Qiskit. For instance, VQE, QAOA, and GroverOptimizer can be invoked as quantum solvers, as demonstrated later. If CPLEX is installed, the ``CplexOptimizer`` can also be used as both, a QUBO and convex solver.
bn_bn: 3-ADMM-H- এর QUBO উপ-সমস্যার সমাধানের জন্য একটি QUBO অপটিমাইজার প্রয়োজন, এবং ক্রমাগত উত্তল সীমাবদ্ধ সাব-সমস্যা সমাধানের জন্য একটি অবিচ্ছিন্ন অপটিমাইজার প্রয়োজন। আমরা প্রথমে ক্লাসিক্যালি সমস্যার সমাধান করি: আমরা ``NumPyMinimumEigenSolver`` এর সাথে ``MinimumEigenOptimizer`` ব্যবহার করি একটি ক্লাসিক্যাল এবং সঠিক QUBO সমাধানকারী হিসাবে এবং আমরা ``CobylaOptimizer`` ব্যবহার করি একটি ক্রমাগত উত্তল সমাধানকারী হিসাবে। 3-ADMM-H কিস্কিটে উপলব্ধ অন্য কোন উপযুক্ত সমাধানকারীকে সমর্থন করে। উদাহরণস্বরূপ, VQE, QAOA, এবং GroverOptimizer কোয়ান্টাম সমাধানকারী হিসাবে আহ্বান করা যেতে পারে, যেমন পরে প্রদর্শিত হয়েছে। যদি CPLEX ইনস্টল করা থাকে, ``CplexOptimizer`` একটি QUBO এবং উত্তল সমাধানকারী উভয় হিসাবে ব্যবহার করা যেতে পারে।
ta_in: 3-ADMM-H க்கு QUBO துணைப்பிரச்சினைத் தீர்க்க ஒரு QUBO உகப்பாக்கி தேவை, மற்றும் தொடர்ச்சியான குவிந்த கட்டுப்படுத்தப்பட்ட துணைப் பிரச்சினையைத் தீர்க்க தொடர்ச்சியான தேர்வுமுறை தேவை. நாங்கள் முதலில் சிக்கலை கிளாசிக்கலாக தீர்க்கிறோம்: கிளாசிக்கல் மற்றும் துல்லியமான QUBO தீர்வாக ``NumPyMinimumEigenSolver`` உடன் ``MinimumEigenOptimizer`` ஐப் பயன்படுத்துகிறோம், மேலும் ``CobylaOptimizer`` ஐ தொடர்ச்சியான குவிந்த தீர்வாகப் பயன்படுத்துகிறோம். 3-ADMM-H கிஸ்கிட்டில் கிடைக்கக்கூடிய வேறு பொருத்தமான தீர்வை ஆதரிக்கிறது. உதாரணமாக, VQE, QAOA மற்றும் க்ரோவர் ஆப்டிமைசரை குவாண்டம் தீர்வுகளாகப் பயன்படுத்தலாம், பின்னர் நிரூபிக்கப்பட்டுள்ளது. CPLEX நிறுவப்பட்டிருந்தால், ``CplexOptimizer`` இரண்டையும் பயன்படுத்தலாம், QUBO மற்றும் குவிந்த தீர்வி.
