Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/05_admm_optimizer.po
Languages: bn_bn, de, es_un, it, ja, ko, pt_un, ta_in, th

source: A comprehensive discussion on the conditions for convergence, feasibility and optimality of the algorithm can be found in [1]. A variant with 2 ADMM blocks, namely a QUBO subproblem, and a continuous convex constrained subproblem, is also introduced in [1].
bn_bn: অ্যালগরিদমের অভিন্নতা, সম্ভাব্যতা এবং অনুকূলতার শর্তাবলী সম্পর্কে একটি বিস্তৃত আলোচনা পাওয়া যাবে [1]। 2 এডিএমএম ব্লকের একটি বৈকল্পিক, যেমন একটি কিউইউবিও (QUBO) উপ -সমস্যা, এবং একটি ক্রমাগত উত্তল সীমাবদ্ধ সাব -সমস্যা, [1] তেও চালু করা হয়েছে।
de: Eine umfassende Diskussion der Bedingungen für Konvergenz, Machbarkeit und Optimalität des Algorithmus findet sich in [1]. Eine Variante mit 2 ADMM-Blöcken, nämlich ein QUBO-Unterproblem, und ein Unterproblem mit kontinuierliche konvexen Nebenbedingungen wird auch in [1] eingeführt.
es_un: En [1] se puede encontrar una discusión exhaustiva sobre las condiciones para la convergencia, viabilidad y optimización del algoritmo. Una variante con 2 bloques ADMM, es decir, un subproblema QUBO, y un subproblema restringido convexo continuo, también es introducido en [1].
it: Una discussione esauriente sulle condizioni di convergenza, fattibilità e ottimizzazione dell'algoritmo si può trovare nella ref. [1]. Nella [1] viene anche introdotta una variante con 2 blocchi ADMM, ovvero un sottoproblema QUBO, e un sottoproblema vincolato, convesso e continuo.
ja: アルゴリズムの収束、実現可能性、および最適化の条件に関する包括的な議論は、[1]にあります。 2つのADMMブロックを持つバリアント、つまりQUBOサブ問題と連続凸制約付きサブ問題も[1]で紹介されています。
ko: 알고리즘의 수렴, 실현 가능성 및 최적성에 대한 포괄적인 논의는 [1] 에서 확인할 수 있다. 2개의 ADMM 블록, 즉, QUBO 하위 문제와 연속 convex 제약 하위 문제를 가진 변형 모델도 [1] 에 도입된다.
pt_un: Uma discussão abrangente sobre as condições para a convergência, viabilidade e otimização do algoritmo podem ser encontrados em [1]. Uma variante com 2 blocos ADMM, isto é, um subproblema da QUBO e um subproblema contínuo convexo restrito, também são introduzidos em [1].
ta_in: வழிமுறையின் ஒருங்கிணைப்பு, சாத்தியக்கூறு மற்றும் உகந்த தன்மைக்கான நிபந்தனைகள் பற்றிய விரிவான கலந்துரையாடலைக் காணலாம் [1]. 2 ADMM தொகுதிகள் கொண்ட ஒரு மாறுபாடு, அதாவது QUBO subproblem, மற்றும் தொடர்ச்சியான குவிந்த கட்டுப்படுத்தப்பட்ட துணைப்பொருள் ஆகியவை [1] இல் அறிமுகப்படுத்தப்பட்டுள்ளன.
th: การอภิปรายเกี่ยวกับเงื่อนไขของ Convergence, Feasibility และ Optimality ของอัลกอริทึม สามารถดูได้ใน [1] ในการใช้งานกับโจทย์ลักษณะอื่น ๆ ได้แก่ในส่วนของโจทย์ปัญหาย่อย QUBO และ โจทย์ปัญหาย่อย Continuous Convex Constrained ได้มีการพูดถึงใน [1] เช่นกัน

source: References
bn_bn: তথ্যসূত্র
de: Referenzen
es_un: Referencias
it: Riferimenti
ja: 参考文献
ko: 참조
pt_un: Referências
ta_in: குறிப்புகள்
th: แหล่งอ้างอิง

source: Initialization
bn_bn: আরম্ভ
de: Initialisierung
es_un: Inicialización
it: Inizializzazione
ja: 初期化
ko: 초기화
pt_un: Inicialização
ta_in: துவக்கம்
th: เริ่มต้นการทำงาน

source: First of all we load all the packages that we need.
bn_bn: প্রথমত আমরা আমাদের প্রয়োজনীয় সমস্ত প্যাকেজ লোড করি।
de: Zuerst werden alle benötigten Pakete geladen.
es_un: En primer lugar cargamos todos los paquetes que necesitamos.
it: Prima di tutto carichiamo tutti i pacchetti di cui abbiamo bisogno.
ja: まず、必要なパッケージをすべてロードします。
ko: 가장 우선적으로 필요한 패키지를 모두 로드한다.
pt_un: Em primeiro lugar, carregamos todos os pacotes de que precisamos.
ta_in: முதலில் நமக்கு தேவையான அனைத்து தொகுப்புகளையும் ஏற்றுவோம்.
th: ขั้นตอนแรกทำการโหลดแพ็กเกจที่จำเป็น

source: We first initialize all the algorithms we plan to use later in this tutorial.
bn_bn: এই টিউটোরিয়ালে আমরা প্রথমে যে অ্যালগরিদমগুলি ব্যবহার করার পরিকল্পনা করি তা আমরা প্রথমে শুরু করি।
de: Zuerst werden alle Algorithmen, die später in diesem Tutorial verwendet werden sollen, initialisiert.
es_un: Primero inicializamos todos los algoritmos que planeamos usar más adelante en este tutorial.
it: Innanzitutto inizializziamo tutti gli algoritmi che prevediamo di utilizzare in questo tutorial.
ja: 最初に、このチュートリアルで後で使用する予定のすべてのアルゴリズムを初期化します。
ko: 이 튜토리얼의 후반부에서 사용하려는 모든 알고리즘을 먼저 초기화한다.
pt_un: Primeiramente, inicializamos todos os algoritmos que planejamos usar durante este tutorial.
ta_in: இந்த டுடோரியலில் பின்னர் பயன்படுத்த திட்டமிட்ட அனைத்து வழிமுறைகளையும் முதலில் துவக்குகிறோம்.
th: ประกาศใช้งานอัลกอริทึมที่จะใช้ในบทเรียนนี้ทั้งหมด

source: To solve the QUBO problems we can choose between
de: Um die QUBO-Probleme zu lösen, kann gewählt werden zwischen
es_un: Para resolver los problemas QUBO podemos elegir entre
ja: QUBOの問題を解決するために、次のいずれかを選択できます。
ko: QUBO 문제를 해결하기 위해 다음 중 하나를 선택할 수 있다.
pt_un: Para solucionar os problemas QUBO, podemos escolher entre
ta_in: QUBO சிக்கல்களைத் தீர்க்க, நாம் இவற்றுள் எதையேனும் தேர்ந்தெடுக்கலாம்
th: เพื่อหาคำตอบของโจทย์ปัญหา QUBO เราสามารถเลือกใช้ระหว่าง

source: ``MinimumEigenOptimizer`` using different ``MinimumEigensolver``, such as ``SamplingVQE``, ``QAOA`` or ``NumpyMinimumEigensolver`` (classical)
de: ``MinimumEigenOptimizer`` unter Nutzung von verschiedenen ``MinimumEigensolver``, wie ``SamplingVQE``, ``QAOA`` oder ``NumpyMinimumEigensolver`` (klassisch)
es_un: ``MinimumEigenOptimizer`` usando diferentes ``MinimumEigensolver``, como ``SamplingVQE``, ``QAOA`` o ``NumpyMinimumEigensolver`` (clásico)
ja: ``SamplingVQE`` 、 ``QAOA`` 、 ``NumpyMinimumEigensolver`` (古典) などのさまざまな ``MinimumEigensolver`` を使用する ``MinimumEigenOptimizer``

source: ``CplexOptimizer`` (classical, if CPLEX is installed)
de: ``CplexOptimizer`` (klassisch, wenn CPLEX installiert ist)
es_un: ``CplexOptimizer`` (clásico, si CPLEX está instalado)
ja: ``CplexOptimizer`` （CPLEXがインストールされている場合は古典）
ko: ``CplexOptimizer`` (고전적, CPLEX가 설치된 경우)
pt_un: ``CplexOptimizer`` (clássico, se o CPLEX estiver instalado)
ta_in: ``CplexOptimizer`` (கிளாசிக்கல், CPLEX நிறுவப்பட்டிருந்தால்)
th: ``CplexOptimizer`` (อัลกอริทึมแบบดั้งเดิม สามารถใช้งานได้เมื่อมีการติดตั้ง CPLEX)

source: and to solve the convex continuous problems we can choose between the following classical solvers:
de: und zur Lösung konvexer kontinuierlicher Probleme können wir zwischen den folgenden klassischen Solvern wählen:
es_un: y para resolver los problemas continuos convexos podemos elegir entre los siguientes solucionadores clásicos:
ja: そして、凸の連続的な問題を解決するために、次の古典ソルバーのどちらかを選択できます。
ko: 그리고 볼록한(convex) 연속 함수 문제를 풀기 위해 다음의 해석기(solver)중에서 선택할 수 있다:
pt_un: e para resolver os problemas convexos continuamente nós podemos escolher entre os seguintes resolvedores clássicos:
th: ในการแก้ปัญหาคอนเวกซ์แบบต่อเนื่อง เราสามารถเลือกใช้อัลกอริทึมแบบดั้งเดิมเหล่านี้ในการแก้ปัญหาได้:

source: ``CplexOptimizer`` (if CPLEX is installed)
de: ``CplexOptimizer`` (wenn CPLEX installiert ist)
es_un: ``CplexOptimizer`` (si CPLEX está instalado)
ja: ``CplexOptimizer`` （CPLEXがインストールされている場合）
ko: ``CplexOptimizer`` (CPLEX가 설치된 경우)
pt_un: ``CplexOptimizer`` (se o CPLEX estiver instalado)
ta_in: ``CplexOptimizer`` (CPLEX நிறுவப்பட்டிருந்தால்)
th: ``CplexOptimizer`` (สามารถใช้งานได้เมื่อมีการติดตั้ง CPLEX)

source: In case CPLEX is not available, the ``CobylaOptimizer`` (for convex continuous problems) and the ``MinimumEigenOptimizer`` using the ``NumpyMinimumEigensolver`` (for QUBOs) can be used as classical alternatives to CPLEX for testing, validation, and benchmarking.
bn_bn: যদি CPLEX পাওয়া না যায়, "CobylaOptimizer" (উত্তল ক্রমাগত সমস্যার জন্য) এবং ``NumpyMinimumEigensolver`` (QUBOs এর জন্য) ব্যবহার করে ``MinimumEigenOptimizer`` পরীক্ষা, বৈধতা এবং বেঞ্চমার্কিংয়ের জন্য CPLEX এর শাস্ত্রীয় বিকল্প হিসাবে ব্যবহার করা যেতে পারে।
de: Falls CPLEX nicht verfügbar ist, können der ``CobylaOptimizer`` (für konvex-kontinuierliche Probleme) und der ``MinimumEigenOptimizer`` mit dem ``NumpyMinimumEigensolver`` (für QUBOs) als klassische Alternativen zu CPLEX zum Testen, zur Validierung und zum Benchmarking verwendet werden.
es_un: En caso de que CPLEX no esté disponible, el ``CobylaOptimizer`` (para problemas continuos convexos) y el ``MinimumEigenOptimizer`` usando el ``NumpyMinimumEigensolver`` (para QUBOs) se pueden utilizar como alternativas clásicas a CPLEX para pruebas, validación, y evaluación comparativa.
it: Nel caso in cui CPLEX non sia disponibile, il ``CobylaOptimizer`` (per i problemi continui convessi) e ``MinimumEigenOptimizer`` utilizzando il ``NumpyMinimumEigensolver`` (per QUBO) possono essere utilizzati come alternativa classica a CPLEX per test, validazione e benchmarking.
ja: CPLEXが利用できない場合、CPLEXの古典的な代替として、凸連続問題であれば ``CobylaOptimizer`` を、QUBOであれば ``NumpyMinimumEigensolver`` を用いた ``MinimEigenOptimizer`` を使用して、テスト、検証、ベンチマークを行うことができます。
ko: CPLEX를 사용할 수 없는 경우, ``CobylaOptimizer`` (볼록 연속 문제의 경우) 와 ``NumpyMinimumEigensolver`` (QUBO의 경우) 를 사용하는 ``MinimumEigenOptimizer`` 를 테스트, 검증 및 벤치마킹을 위해 CPLEX의 고전적인 대안으로 사용할 수 있다.
pt_un: Caso o CPLEX não esteja disponível, o ``CobylaOptimizer`` (para problemas contínuos convexos) e o ``MinimumEigenOptimizer`` usando o ``NumpyMinimumEigensolver`` (para QUBOs) podem ser usados como alternativas clássicas ao CPLEX para teste, validação e benchmarking.
ta_in: CPLEX கிடைக்கவில்லை எனில், ``CobylaOptimizer`` (குவிந்த தொடர்ச்சியான சிக்கல்களுக்கு) மற்றும் ``NumpyMinimumEigensolver`` (QUBO க்காக) ஐப் பயன்படுத்தி ``MinimumEigenOptimizer`` ஆகியவை சோதனை, சரிபார்ப்பு, மற்றும் இலக்குக் குறி.
th: ในกรณีที่ไม่สามารถใช้งาน CPLEX ได้ ``CobylaOptimizer`` (สำหรับโจทย์ปัญหาคอนเวกซ์แบบต่อเนื่อง) และ ``MinimumEigenOptimizer`` ที่ใช้งาน ``NumpyMinimumEigensolver`` (สำหรับโจทย์ปัญหา QUBOs) เป็นอัลกอริทึมแบบดั้งเดิมที่สามารถนำมาใช้งานแทน CPLEX ได้ทั้งในการทดสอบ, ตรวจสอบ และ วัดประสิทธิภาพ

source: Example
bn_bn: উদাহরণ
de: Beispiel
es_un: Ejemplo
it: Esempio
ja: 例
ko: 예제
pt_un: Exemplo
ta_in: எடுத்துக்காட்டு
th: ตัวอย่าง

source: We test 3-ADMM-H algorithm on a simple Mixed-Binary Quadratic Problem with equality and inequality constraints (Example 6 reported in [1]). We first construct a docplex problem and then load it into a ``QuadraticProgram``.
bn_bn: আমরা 3-ADMM-H অ্যালগরিদম একটি সাধারণ মিশ্র-বাইনারি দ্বিঘাত (কোয়াড্রাটিক) সমস্যা সমতা এবং অসমতার সীমাবদ্ধতার সাথে পরীক্ষা করি (উদাহরণ 6 [1] এ রিপোর্ট করা হয়েছে)। আমরা প্রথমে একটি ডকপ্লেক্স সমস্যা তৈরি করি এবং তারপর এটি একটি ``QuadraticProgram`` লোড করি।
de: Wir testen den 3-ADMM-H-Algorithmus mit einem einfachen Mixed-Binary Quadratischen Problem mit Gleichheitsnebenbedingungen und Ungleichheitsnebenbedingungen (Beispiel 6 in [1]). Zunächst erstellen wir ein docplex-Problem und laden es dann in ein ``QuadraticProgram``.
es_un: Probamos el algoritmo 3-ADMM-H en un Problema Cuadrático Binario Mixto simple con restricciones de igualdad y desigualdad (ejemplo 6 reportado en [1]). Primero construimos un problema docplex y luego lo cargamos en un ``QuadraticProgram``.
it: Testiamo l'algoritmo 3-ADMM-H su un semplice problema Mixed-Binary Quadratic con vincoli di uguaglianza e disuguaglianza (Esempio 6 riportato nel [1]). Prima costruiamo un problema docplex e poi lo carichiamo in un ``QuadraticProgram``.
ja: 3-ADMM-Hアルゴリズムを、等式や不等式制約をもつ簡単な混合バイナリー二次計画問題でテストします([1] の例6)。 最初にdocplex問題を構築し、次にそれを ``QuadraticProgram`` にロードします。
ko: 우리는 평등과 불평등 제약 조건을 가진 단순한 혼합 이항 2차 문제에 대해 3-ADMM-H 알고리즘을 테스트 한다 (예 6은 [1] 에 보고되었다). 우리는 먼저 복잡한 문제를 구성한 다음 그것을 ``QuadraticProgram`` 에 로드한다.
pt_un: Testamos o algoritmo 3-ADMM-H em um problema Quadrático Mixed-Binary simples com restrições de igualdade e desigualdade (Exemplo 6 relatado em [1]). Primeiramente, construímos um problema docplex e, em seguida, carregamos em um ``QuadraticProgram``.
ta_in: சமத்துவம் மற்றும் சமத்துவமின்மை கட்டுப்பாடுகள் கொண்ட எளிய கலப்பு-பைனரி இருபடி சிக்கலில் 3-ADMM-H வழிமுறையை சோதிக்கிறோம் (எடுத்துக்காட்டு 6 [1] இல் தெரிவிக்கப்பட்டுள்ளது). நாங்கள் முதலில் டாக்ளெக்ஸ் சிக்கலை உருவாக்கி, அதை `` குவாட்ராடிக் புரோகிராம்`` இல் ஏற்றுவோம்.
th: เราทำการทดสอบอัลกอริทึม 3-ADMM-H ด้วยโจทย์on Mixed-Binary Quadratic Problem อย่างง่าย โดยมีข้อจำกัดทั้งแบบสมการและอสมการ (ตัวอย่างที่ 6 ใน [1]) เราเริ่มต้นที่การสร้างโจทย์ในรูปแบบ Docplex และแปลงไปเป็น ``QuadraticProgram``

source: Classical Solution
bn_bn: ক্লাসিকাল সমাধান
de: Klassische Lösung
es_un: Solución Clásica
it: Soluzione Classica
ja: 古典的解法
ko: 고전적인 솔루션
pt_un: Solução clássica
ta_in: பாரம்பரிய தீர்வு
th: วิธีการแบบดั้งเดิม

source: 3-ADMM-H needs a QUBO optimizer to solve the QUBO subproblem, and a continuous optimizer to solve the continuous convex constrained subproblem. We first solve the problem classically: we use the ``MinimumEigenOptimizer`` with the ``NumPyMinimumEigenSolver`` as a classical and exact QUBO solver and we use the ``CobylaOptimizer`` as a continuous convex solver. 3-ADMM-H supports any other suitable solver available in Qiskit. For instance, ``SamplingVQE``, ``QAOA``, and ``GroverOptimizer`` can be invoked as quantum solvers, as demonstrated later. If CPLEX is installed, the ``CplexOptimizer`` can also be used as both, a QUBO and convex solver.
de: 3-ADMM-H benötigt ein QUBO-Optimierungsprogramm, um das QUBO-Unterproblem zu lösen, und ein kontinuierliches Optimierungsprogramm, um das durchgängige konvexe Unterproblem zu lösen. Wir lösen das Problem zunächst klassisch: Wir verwenden den ``MinimumEigenOptimizer`` mit dem ``NumPyMinimumEigenSolver`` als klassischer und exakter QUBO Solver und wir verwenden den ``CobylaOptimizer`` als kontinuierlichen, konvexen Solver. 3-ADMM-H unterstützt jeden anderen geeigneten Solver, der in Qiskit erhältlich ist. So können z. B. ``SamplingVQE``, ``QAOA``, und ``GroverOptimizer`` als Quantensolver aufgerufen werden, wie später gezeigt wird. Wenn CPLEX installiert ist, kann der ``CplexOptimizer`` auch als ein QUBO-und konvexer Solver verwendet werden.
es_un: 3-ADMM-H necesita un optimizador QUBO para resolver el subproblema QUBO y un optimizador continuo para resolver el subproblema restringido convexo continuo. Primero resolvemos el problema de manera clásica: usamos el ``MinimumEigenOptimizer`` con el ``NumPyMinimumEigenSolver`` como solucionador QUBO clásico y exacto y usamos el ``CobylaOptimizer`` como solucionador convexo continuo. 3-ADMM-H admite cualquier otro solucionador adecuado disponible en Qiskit. Por ejemplo, ``SamplingVQE``, ``QAOA``, y ``GroverOptimizer`` pueden ser usados como solucionadores cuánticos, como se demuestra más adelante. Si CPLEX está instalado, el ``CplexOptimizer`` también se puede utilizar tanto como solucionador QUBO, como solucionador convexo.
ja: 3-ADMM-Hは、QUBOサブ問題を解くのにはQUBOオプティマイザーを、連続凸制約問題を解くのには連続オプティマイザーを必要とします。まず最初に、問題を古典的な方法で解きます: ``NumPyMinimumEigenSolver`` による ``MinimumEigenOptimizer`` を古典的かつ正確な QUBO ソルバーとして使用し、連続凸問題ソルバーとして ``CobylaOptimizer`` を使用します。 3-ADMM-Hは、他にもQiskitで利用可能な適切なソルバーをすべてサポートしています。例えば、``SamplingVQE`` 、 ``QAOA`` 、 ``GroverOptimizer`` は、後述するように、量子ソルバーとして呼び出すことができます。 CPLEXがインストールされていれば、``CplexOptimizer`` をQUBOと凸ソルバーのいずれにも使用することができます。

source: Parameters
bn_bn: পরামিতি
de: Parameter
es_un: Parámetros
it: Parametri
ja: パラメーター
ko: 매개변수
pt_un: Parâmetros
ta_in: அளவுருக்கள்
th: พารามิเตอร์

source: The 3-ADMM-H are wrapped in class ``ADMMParameters``. Customized parameter values can be set as arguments of the class. In this example, parameters :math:`\rho, \beta` are initialized to :math:`1001` and :math:`1000`, respectively. The penalization ``factor_c`` of equality constraints :math:`Gx = b` is set to :math:`900`. The tolerance ``tol`` for primal residual convergence is set to ``1.e-6``. In this case, the 3-block implementation is guaranteed to converge for Theorem 4 of [1], because the inequality constraint with the continuous variable is always active. The 2-block implementation can be run by setting ``three_block=False``, and practically converges to a feasible not optimal solution.
bn_bn: 3-ADMM-H শ্রেণী ``ADMMParameters`` এ আবৃত। কাস্টমাইজড প্যারামিটার মান ক্লাসের আর্গুমেন্ট হিসাবে সেট করা যেতে পারে। এই উদাহরণে, প্যারামিটার :math:`\rho, \beta` কে যথাক্রমে :math:`1001` এবং :math:`1000` এ শুরু করা হয়েছে। সমতা সীমাবদ্ধতার ``factor_c`` শাস্তি :math:`Gx = b` সেট করা হয়েছে :math:`900`। মৌলিক অবশিষ্ট কনভারজেন্সের জন্য সহনশীলতা ``tol`` কে ``1.e-6`` তে সেট করা আছে। এই ক্ষেত্রে, 3-ব্লক বাস্তবায়ন [1] এর 4 তত্ত্বের জন্য একত্রিত হওয়ার গ্যারান্টিযুক্ত, কারণ অবিচ্ছিন্ন পরিবর্তনশীলতার সাথে অসমতার সীমাবদ্ধতা সর্বদা সক্রিয় থাকে। 2-ব্লক বাস্তবায়ন ``three_block=False`` সেট করে চালানো যেতে পারে, এবং কার্যত একটি সম্ভাব্য নয় অনুকূল সমাধানের জন্য রূপান্তরিত হয়।
de: Die 3-ADMM-H Parameter befinden sich in der Klasse ``ADMMParameters`` . Individuelle Parameterwerte können als Argumente der Klasse gesetzt werden. In diesem Beispiel werden die Parameter :math:`\rho, \beta` mit den Parametern :math:`1001` bzw. :math:`1000` initialisiert. Der Straffaktor ``factor_c`` der Gleichheitsnebenbedingungen :math:`Gx = b` ist auf :math:`900` gesetzt. Die Toleranz ``tol`` für die ursprüngliche Restkonvergenz wird auf ``1.e-6`` gesetzt. In diesem Fall ist die 3-Block-Implementierung für Theorem 4 aus [1] garantiert, da die Ungleichheitsnebenbedingung mit der kontinuierlichen Variable immer aktiv ist. Die 2-Block-Implementierung kann ausgeführt werden, indem ``three_block=False`` gesetzt wird und praktisch zu einer machbaren, nicht optimalen Lösung konvergiert.
es_un: Los 3-ADMM-H son parte de la clase ``ADMMParameters``. Los valores de los parámetros personalizados se pueden establecer como argumentos de la clase. En este ejemplo, los parámetros :math:`\rho, \beta` se inicializan a :math:`1001` y :math:`1000`, respectivamente. La penalización ``factor_c`` de las restricciones de igualdad :math:`Gx = b` se establece a :math:`900`. La tolerancia ``tol`` para la convergencia residual primaria se establece a ``1.e-6``. En este caso, se garantiza que la implementación de 3 bloques convergerá para el Teorema 4 de [1], porque la restricción de desigualdad con la variable continua siempre está activa. La implementación de 2 bloques se puede ejecutar configurando ``three_block=False`` y prácticamente converge a una solución factible no óptima.
it: I 3-ADMM-H sono avvolti nella classe ``ADMMParameters``. I valori dei parametri personalizzati possono essere impostati come argomenti della classe. In questo esempio, i parametri :math:`\rho, \beta` sono inizializzati rispettivamente a :math:`1001` e :math:`1000`. La penalizzazione ``factor_c`` dei vincoli di uguaglianza :math:`Gx = b` è impostata a :math:`900`. La tolleranza ``tol`` per la convergenza residua primaria è impostata a ``1.e-6``. In questo caso, l'implementazione a 3 blocchi è garantita per convergere per il Teorema 4 di [1], perché il vincolo di disuguaglianza con la variabile continua è sempre attivo. L'implementazione a 2 blocchi può essere eseguita impostando ``three_block=False``, che fa convergere in una soluzione non ottimale.
ja: 3-ADMM-Hは、 ``ADMMParameters`` クラスにラップされています。カスタマイズされたパラメーター値は、クラスの引数として設定できます。この例では、パラメーター :math:`\rho, \beta` がそれぞれ :math:`1001` と :math:`1000` に初期化されています。等式制約 :math:`Gx = b` のペナルティ ``factor_c`` は :math:`900` に設定されています。一次残差収束の許容誤差 ``tol`` は ``1.e-6`` に設定されています。この場合、3変数の実装は、[1]の定理4に対して収束することが保証されています。これは、連続変数による不等式制約が常にアクティブであるためです。2ブロックの実装は ``three_block=False`` を設定することで実行でき、最適ではない実行可能解に実質的に収束します。
ko: 3-ADMM-H는 클래스 ``ADMMParameters`` 로 포장되어 있다. 사용자 정의된 매개 변수 값은 클래스의 인수로 설정할 수 있다. 이 예에서 매개 변수 :math:`\rho, \beta` 는 각각 :math:`1001` 과 :math:`1000` 으로 초기화된다. 평등 제약 조건 :math:`Gx = b` 의 벌칙 ``factor_c`` 는 :math:`900` 로 설정되었다. 기본 잔차 수렴에 대한 공차 ``tol`` 는 ``1.e-6`` 로 설정된다. 이 경우, 연속 변수와 불평등 제약 조건이 항상 활성 상태이기 때문에, 3-블록 구현은 [1]의 정리 4에 대해 수렴할 것을 보장한다. 2-블록 구현은 ``three_block=False`` 을 설정하여 실행할 수 있으며, 실현 가능 하지 않은 최적의 솔루션을 실질적으로 수렴된다.
pt_un: Os 3-ADMM-H são envolvidos na classe ``ADMMParameters``. Valores de parâmetros customizados podem ser definidos como argumentos da classe. Neste exemplo, os parâmetros :math:`\rho, \beta` são inicializados para :math:`1001` e :math:`1000`, respectivamente. A penalização ``factor_c`` das restrições de igualdade :math:`Gx = b` são definidos para :math:`900`. A tolerância ``tol`` para convergência residual primitiva está ajustada para ``1.e-6``. Neste caso, a implementação de 3 blocos está garantida para convergir para o Theorem 4 de [1], porque a restrição de desigualdade com a variável contínua é sempre ativa. A implementação de dois blocos pode ser executada definindo ``three_block=False``, e praticamente converge para uma solução viável e não otimizada.
ta_in: 3-ADMM-H ``ADMMParameters`` வகுப்பில் மூடப்பட்டிருக்கும். தனிப்பயனாக்கப்பட்ட அளவுரு மதிப்புகள் வகுப்பின் வாதங்களாக அமைக்கப்படலாம். இந்த எடுத்துக்காட்டில், அளவுருக்கள் :math:`\rho, \beta` முறையே :math:`1001` மற்றும் :math:`1000`. சமத்துவக் கட்டுப்பாடுகளின் ``factor_c`` அபராதம் :math:`Gx = b` என அமைக்கப்பட்டுள்ளது :math:`900`. முதன்மை மீதமுள்ள ஒருங்கிணைப்புக்கான ``tol`` சகிப்புத்தன்மை ``1.e-6`` என அமைக்கப்பட்டுள்ளது. இந்த வழக்கில், 3-தொகுதி செயல்படுத்தல் [1] இன் தேற்றம் 4 க்கு ஒன்றிணைவதற்கு உத்தரவாதம் அளிக்கப்படுகிறது, ஏனெனில் தொடர்ச்சியான மாறியுடன் சமத்துவமின்மை கட்டுப்பாடு எப்போதும் செயலில் இருக்கும். 2-தொகுதி செயலாக்கத்தை ``three_block=False`` அமைப்பதன் மூலம் இயக்க முடியும், மேலும் நடைமுறையில் இது ஒரு உகந்த தீர்வாக மாறாது.
th: 3-ADMM-H จะถูก Wrap อยู่ในคลาส ``ADMMParameters`` สามารถเลือกพารามิเตอร์ที่ต้องการได้ในตอนสร้างคลาส ในตัวอย่างนี้พารามิเตอร์ :math:`\rho, \beta` ถูกสร้างขึ้นเริ่มต้นที่ :math:`1001` และ :math:`1000` ตามลำดับ ค่าอัตราส่วน ``factor_c`` ของสมการข้อจำกัด :math:`Gx = b` ถูกตั้งไว้ที่ :math:`900` ค่า Tolerance ``tol`` สำหรับ Primal Residual Convergence ถูกตั้งไว้ที่ ``1.e-6`` ในกรณีนี้ จากทฤษฎีที่ 4 ใน [1] การทำงานแบบ 3-block นี้สามารถทำให้เกิดการลู่เข้าได้อย่างแน่นอน เนื่องจากอสมการข้อจำกัดขแงตัวแปรต่อเนื่องนั้นเป็นจริงเสมอ ในการทำงานแบบ 2-block สามารถเรียกใช้ได้ด้วยการระบุตัวแปรว่า ``three_block=False``และในการทำงานแบบนี้อาจจะทำให้ไม่สามารถลู่เข้าสู่ค่าที่ดีที่สุดได้ แต่ได้ค่าที่ใกล้เคียงกับค่าที่ดีที่สุดเท่านั้น

source: Calling 3-ADMM-H algorithm
bn_bn: 3-ADMM-H অ্যালগরিদম কল করা
de: Aufruf des 3-ADMM-H Algorithmus
es_un: Llamar al algoritmo 3-ADMM-H
it: Invocare l'algoritmo 3-ADMM-H
ja: 3-ADMM-Hアルゴリズムを呼び出す
ko: 3-ADMM-H 알고리즘 호출
pt_un: Chamando algoritmo 3-ADMM-H
ta_in: 3-ADMM-H வழிமுறையை அழைக்கிறது
th: การเรียกใช้อัลกอริทึม 3-ADMM-H
