Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/05_admm_optimizer.po
Languages: bn_bn, de, es_un, it, ja, ko, pt_un, ta_in, th

source: This page was generated from `docs/tutorials/05_admm_optimizer.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/05_admm_optimizer.ipynb`__ থেকে বানানো হয়েছে।
de: Diese Seite wurde aus ` docs/tutorials/05_admm_optimizer.ipynb ` __ generiert.
es_un: Esta página fue generada a partir de `docs/tutorials/05_admm_optimizer.ipynb`__.
ja: このページは `docs/tutorials/05_admm_optimizer.ipynb`__ から生成されました。
ko: 이 페이지는 `docs/tutorials/05_admm_optimizer.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/05_admm_optimizer.ipynb`__.
ta_in: இந்தப் பக்கம் `docs/tutorials/05_admm_optimizer.ipynb` இதிலிருந்து உருவாக்கப்பட்டது.
th: หน้านี้ถูกสร้างขึ้นจาก `docs/tutorials/05_admm_optimizer.ipynb`__

source: ADMM Optimizer
bn_bn: এ ডি এম এম অনুকূলায়ক (অপ্টিমাইজার)
de: ADMM-Optimierer
es_un: Optimizador ADMM
ja: ADMM オプティマイザー
ko: ADMM 옵티마이저
pt_un: Otimizador ADMM
ta_in: ADMM ஆப்டிமைசர்

source: Introduction
bn_bn: ভূমিকা
de: Einführung
es_un: Introducción
it: Introduzione
ja: はじめに
ko: 소개
pt_un: Introdução
ta_in: முன்னுரை
th: บทนำ

source: The ADMM Optimizer can solve classes of mixed-binary constrained optimization problems, hereafter (MBCO), which often appear in logistic, finance, and operation research. In particular, the ADMM Optimizer here designed can tackle the following optimization problem :math:`(P)`:
bn_bn: এডিএমএম অপ্টিমাইজার মিশ্র-বাইনারি সীমাবদ্ধ অপ্টিমাইজেশন সমস্যার ক্লাস সমাধান করতে পারে, এরপরে (এমবিসিও), যা প্রায়শই লজিস্টিক, ফাইন্যান্স এবং অপারেশন গবেষণায় উপস্থিত হয়। বিশেষত, এখানে নির্মিত এডিএমএম অপ্টিমাইজার নিম্নলিখিত অপ্টিমাইজেশান সমস্যাটি মোকাবেলা করতে পারে :math:`(P)`:
de: Der ADMM Optimizer kann Klassen von Optimierungsproblemen mit gemischt-binären Nebenbedingungen lösen, die häufig in der Logistik, im Finanzwesen und in der Optimierung auftreten. Insbesondere kann der hier entworfene ADMM-Optimierer das folgende Optimierungsproblem :math:`(P)` angehen:
es_un: El optimizador ADMM puede resolver clases de problemas de optimización con restricciones binarias mixtas, en adelante (MBCO, mixed-binary constrained optimization problems), que a menudo aparecen en la investigación de operaciones, finanzas y logística. En particular, el optimizador ADMM diseñado aquí puede abordar el siguiente problema de optimización :math:`(P)`:
it: L'ADMM Optimizer è in grado di risolvere le classi di problemi di ottimizzazione binaria-mista vincolata, (mixed-binary constrained optimization, di seguito riferita come MBCO), che spesso compaiono nella ricerca logistica, finanziaria e operativa. In particolare, l'ADMM Optimizer qui progettato può affrontare il seguente problema di ottimizzazione :math:`(P)`:
ja: ADMMオプティマイザーは、ロジスティック、金融、オペレーションズ・リサーチに多く見られる、混合バイナリー制約の最適化問題(以下MBCO)のクラスを解くことができます。 特に、ここで設計された ADMMオプティマイザーは、次の最適化問題 :math:`(P)` に取り組むことができます。
ko: ADMM 옵티마이저는 물류, 재무 및 운영 과학에서 종종 발생하는 혼합-이진 제약 최적화 문제 (이하 MBCO) 의 클래스를 해결할 수 있다. 특히 ADMM 옵티마이저는 다음과 같은 최적화 문제 :math:`(P)` 를 해결할 수 있다.
pt_un: O Otimizador ADMM pode resolver classes de problemas de otimização mistos-binários restritos, daqui em diante (MBCO), que geralmente aparecem em pesquisas logísticas, financeiras e de operações. Em particular, o Otimizador ADMM aqui projetado pode resolver o seguinte problema de otimização :math:`(P)`:
ta_in: ADMM ஆப்டிமைசர் கலப்பு-பைனரி கட்டுப்படுத்தப்பட்ட தேர்வுமுறை சிக்கல்களின் வகுப்புகளை தீர்க்க முடியும், இனி (MBCO), இது பெரும்பாலும் தளவாட, நிதி மற்றும் செயல்பாட்டு ஆராய்ச்சிகளில் தோன்றும். குறிப்பாக, இங்கு வடிவமைக்கப்பட்ட ADMM ஆப்டிமைசர் பின்வரும் தேர்வுமுறை சிக்கலைச் சமாளிக்கும்:math: `(P)`:
th: ADMM Optimizer สามารถแก้ไขปัญหาในหมวด Mixed-Binary Constrained Optimization (MBCO) ได้ ซึ่งพบบ่อยในงานด้าน โลจิสติกส์, การเงิน และ Operation Research โดย ADMM Optimizer ออกแบบมาเจาะจงไปที่การใช้แก้ปัญหา Optimization :math:`(P)` ในลักษณะดังนี้:

source: subject to the constraints:
bn_bn: সীমাবদ্ধতার সাপেক্ষে:
de: unterliegt den Nebenbedingungen:
es_un: sujeto a las restricciones:
it: soggetto ai vincoli:
ja: 制約の対象:
ko: 다음과 같은 제약 조건이 따른다:
pt_un: sujeito às restrições:
ta_in: தடைகளுக்கு உட்பட்டு:
th: โดยมีข้อจำกัด:

source: \mathrm{s.t.:~} \quad G x = b, \quad g(x) \leq 0, \quad \ell(x, u) \leq 0,
es_un: \mathrm{sujeto a.:~} \quad G x = b, \quad g(x) \leq 0, \quad \ell(x, u) \leq 0,

source: with the corresponding functional assumptions.
bn_bn: সংশ্লিষ্ট কার্যকরী অনুমানের সাথে।
de: mit den entsprechenden funktionalen Annahmen.
es_un: con los supuestos funcionales correspondientes.
it: con i corrispondenti postulati funzionali.
ja: 対応する機能的な仮定に基づいています
ko: 해당 기능적 가정과 함께
pt_un: com as premissas funcionais correspondentes.
ta_in: தொடர்புடைய செயல்பாட்டு அனுமானங்களுடன்.
th: โดยฟังก์ชันมีคุณสมบัติดังนี้

source: Function :math:`q: \mathbb{R}^n \to \mathbb{R}` is quadratic, i.e., :math:`q(x) = x^{\intercal} Q x + a^{\intercal} x` for a given symmetric squared matrix :math:`Q \in \mathbb{R}^n \times \mathbb{R}^n, Q = Q^{\intercal}`, and vector :math:`a \in \mathbb{R}^n`;
bn_bn: ফাংশন :math:`q: \mathbb{R}^n \to \mathbb{R}` হল দ্বিঘাত (কোয়াড্রাটিক), অর্থাৎ, :math:`q(x) = x^{\intercal} Q x + a^{\intercal} x` একটি প্রদত্ত সমান্ত্রিক বর্গাকার ম্যাট্রিক্সের জন্য :math:`Q \in \mathbb{R}^n \times \mathbb{R}^n, Q = Q^{\intercal}`, এবং ভেক্টর :math:`a \in \mathbb{R}^n`;
de: Die Funktion :math:` q: \mathbb{R}^ n \to \mathbb{R}` ist quadratisch, d.h. :math:` q (x) = x ^ {\intercal} Q x + a ^ {\intercal} x ` für eine gegebene symmetrische quadrierte Matrix :math:` Q \in \mathbb{R}^ n \times \mathbb{R}^ n, Q = Q ^ {\intercal} `, und gegebenen Vektor :math:` a \in \mathbb{R}^ n `;
es_un: La función :math:`q: \mathbb{R}^n \to \mathbb{R}` es cuadrática, es decir, :math:`q(x) = x^{\intercal} Q x + a^{\intercal} x` para una matriz cuadrada simétrica dada :math:`Q \in \mathbb{R}^n \times \mathbb{R}^n, Q = Q^{\intercal}`, y el vector :math:`a \in \mathbb{R}^n`;
it: Funzione :math:`q: \mathbb{R}^n \to \mathbb{R}` è quadratica, cioè :math:`q(x) = x^{\intercal} Q x + a^{\intercal} x` per una data matrice quadrata simmetrica :math:`Q \in \mathbb{R}^n \times \mathbb{R}^n, Q = Q^{\intercal}`, and vector :math:`a \in \mathbb{R}^n`;
ja: 関数 :math:`q: \mathbb{R}^n \to \mathbb{R}` は二次です。つまり、対称正方行列 :math:`Q \in \mathbb{R}^n \times \mathbb{R}^n, Q = Q^{\intercal}` と ベクトル :math:`a \in \mathbb{R}^n` について、 :math:`q(x) = x^{\intercal} Q x + a^{\intercal} x` です。
ko: 함수 :math:`q: \mathbb{R}^n \to \mathbb{R}` 은 2차, 즉 주어진 대칭 제곱 행렬 :math:`Q \in \mathbb{R}^n \times \mathbb{R}^n, Q = Q^{\intercal}` 에 대한 :math:`q(x) = x^{\intercal} Q x + a^{\intercal} x` 와 :math:`a \in \mathbb{R}^n` 이다.
pt_un: A função :math:`q: \mathbb{R}^n \to \mathbb{R}` é quadrática, p.ex., :math:`q(x) = x^{\intercal} Q x + a^{\intercal} x` para uma determinada matriz quadrada simétrica :math:`Q \in \mathbb{R}^n \times \mathbb{R}^n, Q = Q^{\intercal}`, e vetor :math:`a \in \mathbb{R}^n`;
ta_in: செயல்பாடு :math:`q: \mathbb{R}^n\to \mathbb{R}` என்பது இருபடி, அதாவது, :math:`q(x) = x^{\ intercal} Q x + a^{\ intercal } x` கொடுக்கப்பட்ட சமச்சீர் ஸ்கொயர் மேட்ரிக்ஸுக்கு:math:`Q \ in\ mathbb {R} ^ n \times \mathbb {R} ^ n, Q = Q ^ {\intercal} `, மற்றும் திசையன்:math:` a \in\mathbb{R} ^ n`;
th: ฟังก์ชัน :math:`q: \mathbb{R}^n \to \mathbb{R}` เป็นฟังก์ชันกำลังสองคือ :math:`q(x) = x^{\intercal} Q x + a^{\intercal} x` สำหรับเมทริกซ์จัตุรัสแบบสมมาตร :math:`Q \in \mathbb{R}^n \times \mathbb{R}^n, Q = Q^{\intercal}` และเวกเตอร์ :math:`a \in \mathbb{R}^n`;

source: The set :math:`\mathcal{X} = \{0,1\}^n = \{x_{(i)} (1-x_{(i)}) = 0, \forall i\}` enforces the binary constraints;
bn_bn: সেট :math:`\mathcal{X} = \{0,1\}^n = \{x_{(i)} (1-x_{(i)}) = 0, \forall i\}` দ্বিমিক (বাইনারি) সীমাবদ্ধতা প্রবর্তন করে;
de: Die Menge :math:`\mathcal{X} = \{0,1\}^n = \{x_{(i)} (1-x_{(i)}) = 0, \forall i\}` erzwingen die binären Nebenbedingungen;
es_un: El conjunto :math:`\mathcal{X} = \{0,1\}^n = \{x_{(i)} (1-x_{(i)}) = 0, \forall i\}` impone las restricciones binarias;
it: Il set :math:`\mathcal{X} = \{0,1\}^n = \{x_{(i)} (1-x_{(i)}) = 0, \forall i\}` forza i vincoli binari;
ja: :math:`\mathcal{X} = \{0,1\}^n = \{x_{(i)} (1-x_{(i)}) = 0, \forall i\}` により、バイナリー制約が強制されます。
ko: 세트 :math:`\mathcal{X} = \{0,1\}^n = \{x_{(i)} (1-x_{(i)}) = 0, \forall i\}` 는 2진 제약 조건을 강제한다.
pt_un: O conjunto :math:`\mathcal{X} = \{0,1\}^n = \{x_{(i)} (1-x_{(i)}) = 0, \forall i\}` impõe as restrições binárias;
ta_in: தொகுப்பு :math:`\mathcal{X} = \{0,1\}^n = \{x_{(i)} (1-x_{(i)}) = 0, \forall i\}` பைனரி தடைகளை செயல்படுத்துகிறது;
th: เซต :math:`\mathcal{X} = \{0,1\}^n = \{x_{(i)} (1-x_{(i)}) = 0, \forall i\}` คือเซตที่ใช้บังคับให้ตัวแปรเป็นตัวแปรไบนารี่;

source: Matrix :math:`G\in\mathbb{R}^n \times \mathbb{R}^{n'}`, vector :math:`b \in \mathbb{R}^{n'}`, and function :math:`g: \mathbb{R}^n \to \mathbb{R}` is convex;
bn_bn: ম্যাট্রিক্স :math:`G\in\mathbb{R}^n \times \mathbb{R}^{n'}`, ভেক্টর :math:`b \in \mathbb{R}^{n'}`, এবং ফাংশন :math:`g: \mathbb{R}^n \to \mathbb{R}` হল উত্তল;
de: Die Matrix :math:`G\in\mathbb{R}^n \times \mathbb{R}^{n'}`, vector :math:`b \in \mathbb{R}^{n'}`, und Funktion :math:`g: \mathbb{R}^n \to \mathbb{R}` ist konvex;
es_un: La matriz :math:`G\in\mathbb{R}^n \times \mathbb{R}^{n'}`, el vector :math:`b \in \mathbb{R}^{n'}`, y la función :math:`g: \mathbb{R}^n \to \mathbb{R}` es convexa;
it: Matrice :math:`G\in\mathbb{R}^n \times \mathbb{R}^{n'}`, vettore :math:`b \in \mathbb{R}^{n'}`, e la funzione :math:`g: \mathbb{R}^n \to \mathbb{R}` è convessa;
ja: 行列 :math:`G\in\mathbb{R}^n \times \mathbb{R}^{n'}`, ベクトル :math:`b \in \mathbb{R}^{n'}`, および関数 :math:`g: \mathbb{R}^n \to \mathbb{R}` は、凸です。
ko: 행렬 :math:`G\in\mathbb{R}^n \times \mathbb{R}^{n'}`, 벡터 :math:`b \in \mathbb{R}^{n'}`, :math:`g: \mathbb{R}^n \to \mathbb{R}` 함수는 볼록(convex) 하고;
pt_un: Matriz :math:`G\in\mathbb{R}^n \times \mathbb{R}^{n'}`, vector :math:`b \in \mathbb{R}^{n'}`, e função :math:`g: \mathbb{R}^n \to \mathbb{R}` são convexos;
ta_in: மேட்ரிக்ஸ்:math:`G\in\mathbb{R}^n \times \mathbb{R}^{n'}`, திசையன் :math:`b \in \mathbb{R}^{n'}`,மற்றும் செயல்பாடு:math:`g: \mathbb{R}^n \to \mathbb{R} குவிந்ததாகும்;
th: เมทริกซ์ :math:`G\in\mathbb{R}^n \times \mathbb{R}^{n'}` เวกเตอร์ :math:`b \in \mathbb{R}^{n'}` และฟังก์ชัน :math:`g: \mathbb{R}^n \to \mathbb{R}` เป็นคอนเวกซ์ฟังก์ชัน;

source: Function :math:`\varphi: \mathbb{R}^l \to \mathbb{R}` is convex and :math:`\mathcal{U}` is a convex set;
bn_bn: ফাংশন :math:`\varphi: \mathbb{R}^l \to \mathbb{R}` উত্তল এবং :math:`\mathcal{U}` একটি উত্তল সেট;
de: Die Funktion :math:`\varphi: \mathbb{R}^l \to \mathbb{R}` ist konvex und :math:`\mathcal{U}` ist eine konvexe Menge;
es_un: La función :math:`\varphi: \mathbb{R}^l \to \mathbb{R}` es convexa y :math:`\mathcal{U}` es un conjunto convexo;
it: Funzione :math:`\varphi: \mathbb{R}^l \to \mathbb{R}` è convessa e :math:`\mathcal{U}` è un set convesso;
ja: 関数 :math:`\varphi: \mathbb{R}^l \to \mathbb{R}` は凸で、 :math:`\mathcal{U}` は凸集合です。
ko: 함수 :math:`\varphi: \mathbb{R}^l \to \mathbb{R}` 는 볼록(convex) 이고 :math:`\mathcal{U}` 는 볼록 세트이며;
pt_un: Função :math:`\varphi: \mathbb{R}^l \to \mathbb{R}` é convexa e :math:`\mathcal{U}` é um conjunto convexo;
ta_in: செயல்பாடு :math:`\varphi: \mathbb{R}^l \to \mathbb{R}` குவிந்த மற்றும் :math:`\mathcal{U}`ஒரு குவிந்த தொகுப்பு;
th: ฟังก์ชัน :math:`\varphi: \mathbb{R}^l \to \mathbb{R}` เป็นคอนเวกซ์ฟังก์ชันและ :math:`\mathcal{U}` เป็นเซตคอนเวกซ์;

source: Function :math:`\ell: \mathbb{R}^n\times \mathbb{R}^l \to \mathbb{R}` is *jointly* convex in :math:`x, u`.
bn_bn: ফাংশন :math:`\ell: \mathbb{R}^n\times \mathbb{R}^l \to \mathbb{R}` হল *যৌথভাবে* :math:`x, u` এ উত্তল।
de: Die Funktion :math:` \ell: \mathbb{R}^ n\times \mathbb{R}^ l \to \mathbb{R}` ist * gemeinsam * konvex in :math:` x, u`.
es_un: La función :math:`\ell: \mathbb{R}^n\times \mathbb{R}^l \to \mathbb{R}` es *conjuntamente* convexa en :math:`x, u`.
it: Funzione :math:`\ell: \mathbb{R}^n\times \mathbb{R}^l \to \mathbb{R}` è *congiuntamente* convessa in :math:`x, u`.
ja: 関数 :math:`\ell: \mathbb{R}^n\times \mathbb{R}^l \to \mathbb{R}` は :math:`x, u` について *一体で* 凸です。
ko: 기능 :math:`\ell: \mathbb{R}^n\times \mathbb{R}^l \to \mathbb{R}` 는 :math:`x, u` 에서 *공동* 볼록(convex) 합니다.
pt_un: Função :math:`\ell: \mathbb{R}^n\times \mathbb{R}^l \to \mathbb{R}` é *conjuntamente* convexa em :math:`x, u`.
ta_in: செயல்பாடு :math:`\ell: \mathbb{R}^n\times \mathbb{R}^l \to \mathbb{R}` * கூட்டாக * குவிந்த நிலையில் உள்ளது :math:`x, u`.
th: ฟังก์ชัน :math:`\ell: \mathbb{R}^n\times \mathbb{R}^l \to \mathbb{R}` เป็นฟังก์ชันคอนเวกซ์ *ร่วม* ใน :math:`x, u`.

source: In order to solve MBO problems, [1] proposed heuristics for :math:`(P)` based on the Alternating Direction Method of Multipliers (ADMM) [2]. ADMM is an operator splitting algorithm with a long history in convex optimization, and it is known to have residual, objective and dual variable convergence properties, provided that convexity assumptions are holding.
bn_bn: এমবিও সমস্যাগুলি সমাধান করার জন্য, [1] প্রস্তাবিত হিউরিস্টিক্স :math:`(P)` মাল্টিপ্লায়ার্সের বিকল্প দিকনির্দেশ পদ্ধতির উপর ভিত্তি করে (এডিএমএম) [2]। এডিএমএম হ'ল উত্তল অপ্টিমাইজেশনের দীর্ঘ ইতিহাস সহ একটি অপারেটর বিভক্ত অ্যালগরিদম, এবং এটি অবশিষ্ট, উদ্দেশ্য এবং দ্বৈত ভেরিয়েবল কনভার্জেন্স বৈশিষ্ট্য হিসাবে পরিচিত, যদি উত্তল অনুমানের ধারণা থাকে।
de: Um MBO-Probleme zu lösen, schlug [1] Heuristiken für :math:` (P)` auf Basis der Alternating Direction Method of Multipliers (ADMM) [2]vor. ADMM ist ein Operator-Splitting-Algorithmus mit einer langen Geschichte in der konvexen Optimierung, und es ist bekannt für seine Residuen-, Ziel-und Dual-Variable Konvergenzeigenschaften unter Voraussetzung der Konvexitäts-Annahmen.
es_un: Para resolver problemas MBO, [1] propone heurísticas para :math:`(P)` basadas en el Método de Multiplicadores de Dirección Alterna (Alternating Direction Method of Multipliers, ADMM) [2]. ADMM es un algoritmo de división de operadores con una larga historia en la optimización convexa, y se sabe que tiene propiedades de convergencia de variables residuales, objetivas y duales, siempre que se cumplan los supuestos de convexidad.
it: Per risolvere i problemi di MBO, [1] sono state fatte proposte euristiche per :math:`(P)` sulla base del Metodo di Direzione Alternata dei Moltiplicatori (ADMM) [2]. ADMM è un algoritmo di suddivisione dell'operatore con una lunga storia nel campo dell'ottimizzazione convessa, ed è noto per avere proprietà di convergenza di variabili residue, oggettive e doppie, a condizione che siano soddisfatte le ipotesi di convessità.
ja: MBO問題を解くために、[1]は Alternating Direction Method of Multipliers(交互方向乗数法, ADMM)[2]に基づいて :math:`(P)` についてのヒューリスティックスを提案しました。ADMMは、凸最適化の長い歴史を持つ演算子分割アルゴリズムであり、凸性の仮定が成り立つ場合、残差、目的関数、および双対変数収束の特性を持つことが知られています。
ko: MBO 문제를 해결하기 위해 [1]은 Alternating Direction Method of Multipliers (ADMM) [2]에 기초한 :math:`(P)` 에 대한 발견적 교수법을 제안했다. ADMM은 convex optimzation의 오랜 이력을 지닌 연산자 분할 알고리즘이며, 볼록부 가정이 유지된다는 전제 하에 잔류, 객관 및 이중 변수 수렴 특성을 갖는 것으로 알려져 있다.
pt_un: Para resolver problemas com MBO, [1] Heurística proposta para :math:`(P)` baseado no Método Alternativo de Direção dos Multiplicadores (ADMM) [2]. ADMM é um operador que divide algoritmos com um longo histórico na otimização convexa, e é sabido que tem propriedades de convergência residual, objetiva e dual de variáveis, desde que os pressupostos de convexidade sejam válidos.
ta_in: MBO சிக்கல்களைத் தீர்க்க, [1] முன்மொழியப்பட்ட ஹூரிஸ்டிக்ஸ்:math: `(P)` பெருக்கிகளின் மாற்று திசை முறையின் அடிப்படையில் (ADMM) [2]. ADMM என்பது குவிந்த தேர்வுமுறையில் நீண்ட வரலாற்றைக் கொண்ட ஒரு ஆபரேட்டர் பிரிக்கும் வழிமுறையாகும், மேலும் இது மீதமுள்ள, புறநிலை மற்றும் இரட்டை மாறி குவிப்பு பண்புகளைக் கொண்டிருப்பதாக அறியப்படுகிறது, இது குவிவு அனுமானங்களைக் கொண்டுள்ளது.
th: ในการแก้ไขโจทย์ MBO [1] ได้ใช้วิธี Heuristic เพื่อหา :math:`(P)` ด้วย Alternating Direction Method of Multipliers (ADMM) [2] ADMM เป็นอัลกอริทึมที่ใช้ในการแยกตัวดำเนินการออกจากกันซึ่ง มีการใช้มาอย่างยาวนานในวงการ Convex Optimization ซึ่งเป็นที่รู้กันว่าเป็นอัลกอริทึมที่มีคุณสมบัติ Residual, Objective และ Variable Convergence ซึ่งเป็นสิ่งที่มีอยู่ใน Convexity Assumption

source: The method of [1] (referred to as 3-ADMM-H) leverages the ADMM operator-splitting procedure to devise a decomposition for certain classes of MBOs into:
de: Die Methode von [1] (bezeichnet als 3-ADMM-H) nutzt das ADMM-Operator-Splitting-Verfahren, um eine Dekomposition für bestimmte Klassen von MBOs zu entwickeln in:
es_un: El método de [1] (denominado 3-ADMM-H) aprovecha el procedimiento de división del operador ADMM para diseñar una descomposición de ciertas clases de MBOs en:
ja: [1] の方法（3-ADMM-H と呼ばれる）は、ADMM演算子分割手順を利用して、特定のクラスの MBO を次のように分解します。
ko: [1] 의 방법(3-ADMM-H라고 함) 은 ADMM 연산자 분할 절차를 활용하여 특정 클래스의 MBO를 다음과 같이 분해한다:
pt_un: O método de [1] (denominado 3-ADMM-H) aproveita o procedimento de divisão do operador ADMM para conceber uma decomposição para certas classes de MBOs em:
ta_in: [1] என்ற முறையானது (3-ADMM-H எனக் குறிப்பிடப்படுகிறது) ADMM ஆபரேட்டர்-பிரிவு செயல்முறையைப் பயன்படுத்தி MBO களின் சில வகைகளுக்கு ஒரு சிதைவை உருவாக்குகிறது, அது:
th: วิธีการของ [1] (ระบุว่าเป็น 3-ADMM-H) ใช้ประโยชน์จาก ADMM ในการแยกตัวดำเนินการออกเพื่อแยกองค์ประกอบของโจทย์ปัญหา MBOs ออกมาเป็นหลายหมวดหมู่คือ:

source: a QUBO subproblem to be solved by on the quantum device via variational algorithms, such as VQE or QAOA;
de: ein QUBO-Unterproblem, das mit Hilfe von Variationsalgorithmen, wie VQE oder QAOA, auf Quantencomputern gelöst werden kann;
es_un: un subproblema QUBO que se resolverá en el dispositivo cuántico mediante algoritmos variacionales, como VQE o QAOA;
ja: VQE や QAOA などの変分アルゴリズムを介して量子デバイス上で解決されるQUBOサブ問題。
ko: VQE 또는 QAOA와 같은 다양한 알고리즘들을 통해 양자 장치에서 해결해야 할 QUBO 하위 문제;
pt_un: um subproblema QUBO a ser resolvido no dispositivo quântico por meio de algoritmos variacionais, tais como VQE ou QAOA;
ta_in: vQE அல்லது QAOA போன்ற மாறுபாடு அல்காரிதம்கள் மூலம் குவாண்டம் சாதனத்தில் தீர்க்கப்பட வேண்டிய QUBO துணைப் பிரச்சனை;
th: ปัญหาย่อย QUBO สามารถใช้ควอนตัมคอมพิวเตอร์แก้โจทย์ปัญหาได้ด้วย Variational Algorithm เช่น VQE หรือ QAOA;

source: continuous convex constrained subproblem, which can be efficiently solved with classical optimization solvers.
de: Unterproblem mit kontinuierlichen konvexen Nebenbedingungen, das mit klassischen Optimierungssolvern effizient gelöst werden kann.
es_un: subproblema restringido convexo continuo, que se puede resolver de manera eficiente con solucionadores clásicos de optimización.
ja: 古典的最適化ソルバーで効率的に解くことができる連続凸制約付きサブ問題。
ko: 고전적인 최적화 해석기(Solver)로 효율적으로 해결될 수 있는 연속적인 볼록 제약(convex constrained) 부분문제(subproblem)
pt_un: subproblema de restrição convexa contínua, que pode ser resolvido eficientemente com solucionadores de otimização clássicos.
ta_in: தொடர்ச்சியான குவிவு கட்டுப்படுத்தப்பட்ட துணைப்பிரச்சினை, இது கிளாசிக்கல் தேர்வுமுறை தீர்வுகள் மூலம் திறமையாகத் தீர்க்கப்படும்.
th: โจทย์ปัญหาย่อย Continuous Convex Constrained ซึ่งสามารถใช้อัลกอริทึม Optimization แบบดั้งเดิมในการแก้โจทย์ได้ดี

source: The algorithm 3-ADMM-H works as follows:
bn_bn: অ্যালগরিদম 3-ADMM-H নিম্নলিখিত উপায়ে কাজ করে:
de: Der Algorithmus 3-ADMM-H arbeitet wie folgt:
es_un: El algoritmo 3-ADMM-H funciona de la siguiente manera:
it: L'algoritmo 3-ADMM-H funziona come segue:
ja: アルゴリズム 3-ADMM-H は以下のように動作します。
ko: 알고리즘 3-ADMM-H는 다음과 같이 작동한다:
pt_un: O algoritmo 3-ADMM-H funciona da seguinte forma:
ta_in: 3-ADMM-H வழிமுறை பின்வருமாறு செயல்படுகிறது:
th: อัลกอริทึม 3-ADMM-H มีการทำงานดังนี้:

source: Initialization phase (set the parameters and the QUBO and convex solvers);
bn_bn: প্রারম্ভিক পর্যায় (স্থিতিমাপ, QUBO আর কনভেক্স সমাধানকারক গুলি নির্ণয় করা);
de: Initialisierungsphase (initialisiert die Parameter und die QUBO und Konvex-Solver);
es_un: Fase de inicialización (configurar los parámetros y los solucionadores QUBO y convexos);
it: Fase di inizializzazione (impostare i parametri e le soluzioni QUBO e convex);
ja: 初期化フェーズ (パラメーターとQUBOと凸ソルバーを設定);
ko: 초기화 단계(매개변수, QUBO 및 convex solver 설정)
pt_un: Fase de inicialização (defina os parâmetros, o QUBO e os solucionadores convexos);
ta_in: துவக்க கட்டம் (அளவுருக்கள் மற்றும் QUBO மற்றும் குவிந்த தீர்வுகளை அமைக்கும்);
th: สร้างเฟสตั้งต้น (ตั้งค่าพารามิเตอร์และ QUBO และอัลกอริทึมสำหรับแก้โจทย์คอนเวกซ์)

source: For each ADMM iterations ($k = 1, 2, :nbsphinx-math:`\ldots`, $) until termination:
bn_bn: সমাপ্তি না হওয়ার পূর্বে প্রতিটি এডিএমএম পুনরাবৃত্তির জন্য ($k = 1, 2, :nbsphinx-math:`\ldots`, $) ব্যবহার করা হয়
de: Für jede ADMM-Iteration ($k = 1, 2, :nbsphinx-math:` \ldots `, $) bis zur Beendigung:
es_un: Para cada iteración de ADMM (:math:`k = 1,2,\ldots`) hasta terminar:
it: Per ogni iterazione ADMM ($k = 1, 2, :nbsphinx-math:`\ldots`, $) fino alla fine:
ja: ADMM の各反復($k = 1, 2, :nbsphinx-math:`\ldots`, $) を、終了するまで行います:
ko: 계산이 종료될때까지 각 ADMM 반복에 대해 ($k = 1, 2, :nbsphinx-math:`\ldots`, $):
pt_un: Para cada iteração ADMM ($k = 1, 2, :nbsphinx-math:`\ldots`, $) até finalizar:
ta_in: ஒவ்வொரு ADMM மறு செய்கைகளுக்கும் ($k = 1, 2, :nbsphinx-math:`\ldots`, $) நிறுத்தப்படும் வரை:
th: สำหรับแต่ละรอบการทำงานของ ADMM ($k = 1, 2, :nbsphinx-math:`\ldots`, $) จนกว่าจะจบการทำงาน:

source: Solve a properly defined QUBO subproblem (with a classical or quantum solver);
bn_bn: একটি সঠিকভাবে সংজ্ঞায়িত QUBO উপ -সমস্যার সমাধান করুন (একটি শাস্ত্রীয় বা কোয়ান্টাম সমাধানকারী সহ);
de: Lösung eines korrekt definiertes QUBO Subproblems (mit einem klassischen oder Quantensolver);
es_un: Resolver un subproblema QUBO correctamente definido (con un solucionador clásico o cuántico);
it: Risolvere un sottoproblema QUBO correttamente definito (con un risolutore classico o quantistico);
ja: 適切に定義された QUBO サブ問題を (古典または量子ソルバーで) 解く;
ko: 적절히 정의된 QUBO 하위 문제를 (고전적 또는 양자 solver) 로 해결;
pt_un: Resolva um subproblema QUBO devidamente definido (com um solucionador clássico ou quântico);
ta_in: சரியாக வரையறுக்கப்பட்ட QUBO துணைப் பிரச்சினையைத் தீர்க்கவும் (கிளாசிக்கல் அல்லது குவாண்டம் தீர்வி கொண்டு);
th: หาคำตอบของโจทย์ปัญหาย่อย QUBO (ด้วยอัลกอริทึมแบบดังเดิมหรือแบบควอนตัม)

source: Solve properly defined convex problems (with a classical solver);
bn_bn: সঠিকভাবে সংজ্ঞায়িত উত্তল সমস্যার সমাধান করুন (একটি শাস্ত্রীয় সমাধানকারী সহ);
de: Lösung eines korrekt definierten konvexen Problemes (mit einem klassischen Solver);
es_un: Resolver problemas convexos correctamente definidos (con un solucionador clásico);
it: Risolvere problemi convessi ben definiti (con un risolutore classico);
ja: 適切に定義された凸問題を(古典ソルバーで) 解く;
ko: 적절히 정의된 convex 문제 (고전적 solver) 로 해결;
pt_un: Resolva problemas convexos devidamente definidos (com um solucionador clássico);
ta_in: சரியாக வரையறுக்கப்பட்ட குவிந்த சிக்கல்களைத் தீர்க்கவும் (கிளாசிக்கல் தீர்வி கொண்டு);
th: หาคำตอบของโจทย์ปัญหาคอนเวกซ์ที่กำหนดไว้ (ด้วยอัลกอริทึมแบบดั้งเดิม)

source: Update the dual variables.
bn_bn: দ্বৈত ভেরিয়েবল আপডেট করুন।
de: Aktualisierung der dualen Variablen.
es_un: Actualizar las variables duales.
it: Aggiorna le variabili duali.
ja: 双対変数を更新する
ko: 이중 변수를 업데이트한다.
pt_un: Atualize as variáveis duais.
ta_in: இரட்டை மாறிகள் புதுப்பிக்கவும்.
th: อัปเดตค่าตัวแปรทั้งสองตัวแปร

source: Return optimizers and cost.
bn_bn: অপ্টিমাইজার এবং খরচ ফেরত (রিটার্ন) নেওয়া
de: Rückgabe des Optimierers und der Kosten.
es_un: Regresar optimizadores y costo.
it: Ritornare gli ottimizzatori e i costi.
ja: オプティマイザーとコストを返す
ko: 옵티마이저 및 비용을 반환한다.
pt_un: Retornar otimizadores e custo.
ta_in: ஆப்டிமைசர்கள் மற்றும் செலவை வழங்குகிறது.
th: ส่งคืน Optimizer และค่า Cost
