Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/06_examples_max_cut_and_tsp.po
Languages: bn_bn, es_un, fr, ko, pt_un, ta_in, th_th

source: Running it on quantum computer
bn_bn: কোয়ান্টাম কম্পিউটারে চালানো
es_un: Ejecutar en una computadora cuántica
fr: L'exécuter sur un ordinateur quantique
ko: 양자 컴퓨터에서 실행하기
pt_un: Executando-o em um computador quântico
ta_in: குவாண்டம் கணினியில் இயங்குகிறது
th_th: นำไปทำงานบนเครื่องควอนตัมคอมพิวเตอร์

source: We run the optimization routine using a feedback loop with a quantum computer that uses trial functions built with Y single-qubit rotations, :math:`U_\mathrm{single}(\theta) = \prod_{i=1}^n Y(\theta_{i})`, and entangler steps :math:`U_\mathrm{entangler}`.
bn_bn: আমরা কোয়ান্টাম কম্পিউটারের সাথে ফিডব্যাক লুপ ব্যবহার করে অপ্টিমাইজেশন রুটিন চালাই যা Y একক-কিউবিট ঘূর্ণন, :math:`U_\mathrm{single}(\theta) = \prod_{i=1}^n Y(\theta_{i})`, এবং এন্ট্যাঙ্গলারের ধাপগুলি :math:`U_\mathrm{entangler}` এর সাহায্যে নির্মিত ট্রায়াল ফাংশন ব্যবহার করে।
es_un: Ejecutamos la rutina de optimización usando un ciclo de retroalimentación con una computadora cuántica que usa funciones de prueba construidas con rotaciones Y de un solo qubit, :math:`U_\mathrm{simple}(\theta) = \prod_{i=1}^n Y(\theta_{i})`, y los pasos de entrelazamiento :math:`U_\mathrm{entrelazador}`.
fr: Nous exécutons la routine d'optimisation à l'aide d'une boucle de rétroaction avec un ordinateur quantique qui utilise des fonctions d'essai construites avec des rotations de Y sur un qubit, :math:` U_ \mathrm{single}(\theta) = \prod_ { i= 1 } ^ n Y (\theta_{i}) `, et avec des étapes d'intrication :math:` U_ \mathrm{entangler}`.
ko: 우리는 Y 단일 큐비트 회전, :math:`U_\mathrm{single}(\theta) = \prod_{i=1}^n Y(\theta_{i})` 및 얽힌 단계 :math:`U_\mathrm{entangler}`.로 구축 된 시험 기능을 사용하는 양자 컴퓨터와 함께 피드백 루프를 사용하여 최적화 루틴을 실행한다.
pt_un: Executamos a rotina de otimização usando um loop de feedback com um computador quântico que usa funções teste construídas com rotações Y de um único qubit, :math:`U_\mathrm{single}(\theta) = \prod_{i=1}^n Y(\theta_{i})`, e etapas de emaranhamento :math:`U_\mathrm{entangler}`.
ta_in: Y ஒற்றை-க்யூபிட் சுழற்சிகளுடன் கட்டப்பட்ட சோதனை செயல்பாடுகளைப் பயன்படுத்தும் குவாண்டம் கணினியுடன் பின்னூட்ட வளையத்தைப் பயன்படுத்தி தேர்வுமுறை வழக்கத்தை நாங்கள் இயக்குகிறோம் :math:`U_\mathrm {single}(\ttheta) = \ prod_ {i = 1}^n Y(\theta_ {i}) `, மற்றும் சிக்கலான படிகள் :math:` U_\mathrm {entangler}`.
th_th: ทำงานแต่ละรอบ Optimization โดยใช้วงจรป้อนกลับบนเครื่องควอนตัมคอมพิวเตอร์โดยมีฟังก์ชันทดสอบที่สร้างด้วย Y Single-Qubit Rotation :math:`U_\mathrm{single}(\theta) = \prod_{i=1}^n Y(\theta_{i})` และส่วน Entanglement :math:`U_\mathrm{entangler}`

source: Traveling Salesman Problem
bn_bn: ট্রাভেলিং সেলসম্যান সমস্যা
es_un: Problema del Vendedor Viajero
fr: Problème du Voyageur de Commerce
ko: 외판원(traveling salesman) 문제
pt_un: Problema do Caixeiro Viajante
ta_in: ட்ராவலிங் சாலேஸ்மேன் ப்ரோப்ளேம்
th_th: โจทย์ปัญหา Traveling Salesman

source: In addition to being a notorious NP-complete problem that has drawn the attention of computer scientists and mathematicians for over two centuries, the Traveling Salesman Problem (TSP) has important bearings on finance and marketing, as its name suggests. Colloquially speaking, the traveling salesman is a person that goes from city to city to sell merchandise. The objective in this case is to find the shortest path that would enable the salesman to visit all the cities and return to its hometown, i.e. the city where he started traveling. By doing this, the salesman gets to maximize potential sales in the least amount of time.
bn_bn: দুই শতাব্দীরও বেশি সময় ধরে কম্পিউটার বিজ্ঞানী এবং গণিতবিদদের দৃষ্টি আকর্ষণ করে এমন একটি কুখ্যাত এনপি-সম্পূর্ণ সমস্যা হওয়ার পাশাপাশি, ট্র্যাভেলিং সেলসম্যান প্রব্লেম (টি.এস.পি) এর অর্থ এবং বিপণনের ক্ষেত্রে গুরুত্বপূর্ণ ভারবহন রয়েছে। কথোপকথনের ভাষায়, ট্র্যাভেলিং সেলসম্যান এমন ব্যক্তি যিনি শহর থেকে শহরে পণ্যদ্রব্য বিক্রয় করতে যান। এক্ষেত্রে উদ্দেশ্যটি হ'ল সংক্ষিপ্ততম পথটি সন্ধান করা যা বিক্রয়কেন্দ্রকে সমস্ত শহর ঘুরে দেখার এবং তার শহরে ফিরে যেতে সক্ষম করবে, অর্থাৎ যে শহরে সে যাত্রা শুরু করেছিল। এটি করার মাধ্যমে বিক্রয়কটি সর্বনিম্ন সময়ে সম্ভাব্য বিক্রয় সর্বাধিক অর্জন করতে পারে।
es_un: Además de ser notoriamente un problema NP completo que ha llamado la atención de científicos computacionales y matemáticos durante más de dos siglos, el Problema del Vendedor Viajero (Traveling Salesman Problem, TSP) tiene importantes repercusiones en las finanzas y la mercadotecnia, como su nombre lo indica. Coloquialmente hablando, el vendedor viajero es una persona que va de ciudad en ciudad para vender mercancía. El objetivo en este caso es encontrar el camino más corto que le permita al vendedor visitar todas las ciudades y regresar a su ciudad natal, es decir, la ciudad donde comenzó a viajar. Al hacer esto, el vendedor puede maximizar las ventas potenciales en la menor cantidad de tiempo.
fr: En plus d'être un problème d'NP-complet notoire, qui a attiré l'attention des informaticiens et des mathématiciens depuis plus de deux siècles, le "Problème du Voyageur de Commerce (ou "Traveling Salesman Problem" - TSP) a des relations importantes en matière de finance et de marketing. Pour le dire simplement, le voyageur de commerce est une personne qui va de ville en ville pour vendre des marchandises. L'objectif dans ce cas est de trouver le chemin le plus court permettant au vendeur de visiter toutes les villes et de retourner dans sa ville de départ. Ce faisant, le vendeur peut maximiser les ventes potentielles pendant la plus petite durée.
ko: 외판원 문제(TSP)는 2 세기 이상 컴퓨터 과학자와 수학자의 관심을 끈 악명 높은 NP- 완전한 문제 일뿐만 아니라 재무 및 마케팅과도 관련이 있다. 한마디로 말하면, 외판원은 도시를 방문하여 상품을 판매한다. 이 문제의 목표는 외판원이 모든 도시를 방문하고 고향 즉 여행을 시작한 도시로 돌아갈 수있는 가장 짧은 경로를 찾는 것이다. 이를 통해 외판원은 최소한의 시간 안에 잠재적인 매출을 극대화 할 수 있다.
pt_un: Além de ser um notório problema NP-completo que chamou a atenção de cientistas de computação e matemáticos por mais de dois séculos, o Problema do Caixeiro Viajante (TSP) tem implicações importantes sobre finanças e marketing, como sugere seu nome. Coloquialmente falando, o caixeiro viajante é uma pessoa que vai de cidade em cidade para vender mercadorias. O objetivo neste caso é encontrar o caminho mais curto que possibilitaria ao vendedor visitar todas as cidades e retornar à sua cidade natal, ou seja, a cidade onde ele começou a viajar. Ao fazer isso, o vendedor consegue maximizar as vendas em potencial na menor quantidade de tempo.
ta_in: இரண்டு நூற்றாண்டுகளுக்கும் மேலாக கணினி விஞ்ஞானிகள் மற்றும் கணிதவியலாளர்களின் கவனத்தை ஈர்த்த ஒரு மோசமான NP-முழுமையான பிரச்சனையாக இருப்பதைத் தவிர, டிராவலிங் சேல்ஸ்மேன் பிரச்சனை (TSP) நிதி மற்றும் சந்தைப்படுத்துதலில், முக்கிய தாங்குதல்களைக் கொண்டுள்ளது. பேச்சு வார்த்தையில், பயண விற்பனையாளர் நகரத்திலிருந்து நகரத்திற்கு பொருட்களை விற்கச் செல்லும் ஒரு நபர். இந்த வழக்கில் குறிக்கோள் என்னவென்றால், விற்பனையாளர் அனைத்து நகரங்களுக்கும் சென்று அதன் சொந்த ஊருக்கு, அதாவது அவர் பயணிக்கத் தொடங்கிய நகரத்திற்குத் திரும்புவதற்கு உதவும் குறுகிய பாதையைக் கண்டுபிடிப்பதாகும். இதைச் செய்வதன் மூலம், விற்பனையாளர் குறைந்த நேரத்தில் சாத்தியமான விற்பனையை அதிகரிக்க முடியும்.
th_th: โจทย์ปัญหานี้เป็นโจทย์ปัญหา NP-complete ที่เป็นที่รู้จักกันในกลุ่มของนักวิทยาศาสตร์คอมพิวเตอร์และนักคณิตศาสตร์มากว่าสองศตวรรษ โจทย์ปัญหา Traveling Salesman (TSP) มีบทบาทสำคัญทั้งในด้านการเงินและการตลาด ซึ่งโจทย์ปัญหานี้จากชื่อจะเห็นได้ว่ามันมาจากการที่มีพนักงานขายต้องการเดินทางไปขายของที่เมืองต่าง ๆ โดยวัตถุประสงค์คือ ทำอย่างไรให้การเดินทางนั้นใช้ระยะทางได้สั้นที่สุดในการที่พนักงานขายเดินทางไปทุก ๆ เมืองและเดินทางกลับมายังเมืองเริ่มต้น โดยในการทำแบบนี้จะทำให้พนักงานขายได้ยอดขายที่มากที่สุดด้วยเวลาที่ใช้น้อยที่สุด

source: The problem derives its importance from its “hardness” and ubiquitous equivalence to other relevant combinatorial optimization problems that arise in practice.
bn_bn: অনুশীলনে উত্থাপিত অন্যান্য প্রাসঙ্গিক সমন্বয়মূলক সমস্যাগুলির সাথে এর "কঠোরতা" ("hardness") এবং সর্বব্যাপী সমতা থেকে সমস্যাটি তার গুরুত্ব অর্জন করে।
es_un: El problema deriva su importancia de su “dureza” y equivalencia ubicua con otros problemas de optimización combinatoria relevantes que surgen en la práctica.
fr: L'importance de ce problème tient d'une part à sa "difficulté" et d'autre part à son équivalence avec d'autres problèmes d'optimisation qui se posent dans la pratique.
ko: 이 문제는 문제의 "난이도"와 실제로 발생하는 다른 조합적 최적화 문제들과 유사성을 갖기 때문에 중요하다.
pt_un: O problema deriva sua importância de sua “dificuldade” e da equivalência onipresente a outros problemas de otimização combinatória relevantes que surgem na prática.
ta_in: சிக்கல் அதன் "hardness" மற்றும் நடைமுறையில் எழும் பிற தொடர்புடைய ஒருங்கிணைப்பு தேர்வுமுறை சிக்கல்களுக்கு எங்கும் நிறைந்த சமநிலையிலிருந்து அதன் முக்கியத்துவத்தைப் பெறுகிறது.
th_th: ปัญหานี้มี “ความยาก” และความแพร่หลายในการใช้งานที่เทียบได้กับโจทย์ปัญหา Combinatorial Optimization อื่น ๆ ที่มีการนำมาใช้งานจริง

source: The mathematical formulation with some early analysis was proposed by W.R. Hamilton in the early 19th century. Mathematically the problem is, as in the case of Max-Cut, best abstracted in terms of graphs. The TSP on the nodes of a graph asks for the shortest *Hamiltonian cycle* that can be taken through each of the nodes. A Hamilton cycle is a closed path that uses every vertex of a graph once. The general solution is unknown and an algorithm that finds it efficiently (e.g., in polynomial time) is not expected to exist.
bn_bn: কিছু প্রাথমিক বিশ্লেষণের সাথে গাণিতিক সূত্রটি ডাব্লু.আর. হ্যামিল্টন ১৯ শতকের গোড়ার দিকে প্রস্তাব করেছিলেন। গাণিতিকভাবে সমস্যাটি হ'ল ম্যাক্স-কাটের গ্রাফের ক্ষেত্রে সবচেয়ে ভাল বিমূর্ত। কোনও গ্রাফের নোডের টিএসপি সর্বনিম্ন * হ্যামিলটোনিয়ান চক্র * যা প্রতিটি নোডের মধ্য দিয়ে নেওয়া যায় তা জিজ্ঞাসা করে। একটি হ্যামিল্টোনিয়ান চক্র এমন একটি বদ্ধ পথ যা একবারে গ্রাফের প্রতিটি প্রান্তকে একবার ব্যবহার করে। সাধারণ সমাধানটি অজানা এবং একটি অ্যালগরিদম (উদাঃ, বহু-কালীন সময়ে) এর উপস্থিতি প্রত্যাশিত নয় যা কার্যকরভাবে এটি খুঁজে পায় ।
es_un: La formulación matemática con algunos análisis tempranos fue propuesta por W.R. Hamilton a principios del siglo XIX. Matemáticamente, el problema es, como en el caso de Max-Cut, mejor resumido en términos de grafos. El TSP en los nodos de un grafo busca el *ciclo Hamiltoniano* más corto que se puede tomar a través de cada uno de los nodos. Un ciclo de Hamilton es un camino cerrado que usa cada vértice de un grafo una vez. Se desconoce la solución general y no se espera que exista un algoritmo que la encuentre de manera eficiente (por ejemplo, en tiempo polinomial).
fr: La formulation mathématique ainsi que des premières analyse sont été proposées par W.R. Hamilton au début du XIXe siècle. Mathématiquement ce problème (comme dans le cas de Max-Cut) est représenté de manière satisfaisante en terme de graphes. Le TSP sur les noeuds d'un graphe correspond à la recherche du plus court *cycle hamiltonien*. Un cycle hamiltonien est un circuit fermé qui utilise tous les sommets d'un graphe une fois. La solution générale est inconnue et l'existence d'un algorithme qui résout ce problème efficacement (par exemple, en temps polynomial) n'est pas démontrée.
ko: W.R. Hamilton은 19 세기 초에 초기 분석을 통한 수학적 공식을 제안했다. 수학적으로 이 문제는 최대 컷의 경우와 마찬가지로 그래프 네트워크를 사용해 가장 잘 요약된다. 그래프 네트워크의 외판원 문제는 각 노드를 통해 취할 수있는 가장 짧은 *해밀턴 사이클* 을 계산한다. 해밀턴 사이클은 그래프의 모든 정점을 한 번 사용하는 닫힌 경로이다. 일반적인 해결책은 알려져 있지 않으며 효율적으로 찾는 알고리즘 (예: 다항식 시간)은 존재하지 않는 것으로 예상된다.
pt_un: A formulação matemática com alguma análise inicial foi proposta por W.R. Hamilton no início do século XIX. Matematicamente o problema é, como no caso do Max-Cut, melhor abstraído em termos de grafos. O TSP nos nós de um grafo pede o *ciclo Hamiltoniano* mais curto que pode ser tomado através de cada um dos nós. Um ciclo Hamiltoniano é um caminho fechado que usa cada vértice do grafo uma vez. A solução geral é desconhecida e não é esperado que exista um algoritmo que o encontre de forma eficiente (por exemplo, em tempo polinomial).
ta_in: சில ஆரம்ப பகுப்பாய்வுகளுடன் கணித உருவாக்கம் 19 ஆம் நூற்றாண்டின் ஆரம்பத்தில் டபிள்யூ.ஆர். ஹாமில்டனால் முன்மொழியப்பட்டது. கணித ரீதியாக சிக்கல் என்னவென்றால், மேக்ஸ்-கட் விஷயத்தைப் போலவே, வரைபடங்களின் அடிப்படையில் மிகச் சுருக்கமாக உள்ளது. ஒரு வரைபடத்தின் முனைகளில் உள்ள TSP ஒவ்வொரு முனைகளிலும் எடுக்கக்கூடிய மிகக் குறுகிய *ஹாமில்டோனிய சுழற்சி* ஐ கேட்கிறது. ஒரு ஹாமில்டன் சுழற்சி என்பது ஒரு மூடிய பாதையாகும், இது ஒரு வரைபடத்தின் ஒவ்வொரு உச்சியையும் ஒரு முறை பயன்படுத்துகிறது. பொதுவான தீர்வு தெரியவில்லை மற்றும் அதை திறமையாகக் கண்டுபிடிக்கும் ஒரு வழிமுறை (எ.கா., பல்லுறுப்புறுப்பு நேரத்தில்) இருப்பதாக எதிர்பார்க்கப்படவில்லை.
th_th: สมการคณิตศาสตร์ของโจทย์ปัญหานี้ได้ถูกวิเคราะห์ไว้โดย W.R. Hamilton ในช่วงศตวรรษที่ 19 ในเชิงคณิตศาสตร์โจทย์ปัญหานี้คือกรณีหนึ่งของโจทย์ปัญหา Max-Cut ดังนั้นรูปแบบที่ดีที่สุดในการแสดงโจทย์ปัญหานี้คือรูปแบบกราฟ ในโจทย์ปัญหานี้ TSP จะยืนอยู่บน Node ของกราฟ และต้องการจะหาว่า *Hamiltonian Cycle* ที่สั้นที่สุดที่ผ่านทุก Node คืออันไหน Hamilton Cycle คือเส้นทางปิดที่ใช้ทุก ๆ Node ของกราฟอย่างละ 1 ครั้ง ในปัจจุบันเรายังไม่พบผลเฉลยทั่วไปของโจทย์ปัญหานี้ และเราไม่คาดหวังว่าจะมีอัลกอริทึมที่สามารถหาคำตอบได้อย่างมีประสิทธิภาพอยู่ (เช่น สามารถหาคำตอบได้ใน Polynomial Time)

source: Find the shortest Hamiltonian cycle in a graph :math:`G=(V,E)` with :math:`n=|V|` nodes and distances, :math:`w_{ij}` (distance from vertex :math:`i` to vertex :math:`j`). A Hamiltonian cycle is described by :math:`N^2` variables :math:`x_{i,p}`, where :math:`i` represents the node and :math:`p` represents its order in a prospective cycle. The decision variable takes the value 1 if the solution occurs at node :math:`i` at time order :math:`p`. We require that every node can only appear once in the cycle, and for each time a node has to occur. This amounts to the two constraints (here and in the following, whenever not specified, the summands run over 0,1,…N-1)
bn_bn: :math:`n=|V|` নোড এবং দূরত্ব :math:`w_{ij}` (ভার্টেক্স :math:`i` থেকে ভার্টেক্স :math:`j` দূরত্ব) সহ একটি গ্রাফ :math:`G=(V,E)`তে সংক্ষিপ্ততম হ্যামিলটোনিয়ান চক্রটি সন্ধান করুন। একটি হ্যামিলটোনিয়ান চক্র math:`N^2` চল রাশি (ভেরিয়েবল) math:`N^2` দ্বারা বর্ণিত হয়, যেখানে :math:`i` নোডকে উপস্থাপন করে এবং :math:`p সম্ভাব্য চক্রের মধ্যে তার ক্রমটি উপস্থাপন করে। সময় ক্রম :math:`p তে নোড :math:`i` এ সমাধান ঘটে তবে সিদ্ধান্ত ভেরিয়েবলের মান ১ হয়। আমাদের প্রয়োজন যে প্রতিটি নোড কেবল চক্রের মধ্যে একবার উপস্থিত হতে পারে এবং প্রতিটি বারের জন্য একটি নোড ঘটতে হয়। এটি দুটি সীমাবদ্ধতার পরিমান (এখানে এবং নীচে, যখনই নির্দিষ্ট করা হয়নি, যোগফলগুলি ০,১ থেকে,… এন -1)
es_un: Encuentra el ciclo Hamiltoniano más corto en un grafo :math:`G=(V,E)` con :math:`n=|V|` nodos y distancias, :math:`w_{ij}` (distancia desde el vértice :math:`i` al vértice :math:`j`). Un ciclo Hamiltoniano se describe mediante :math:`N^2` variables :math:`x_{i,p}`, donde :math:`i` representa el nodo y :math:`p` representa su orden en una perspectiva de ciclo. La variable de decisión toma el valor 1 si la solución ocurre en el nodo :math:`i` en el orden de tiempo :math:`p`. Requerimos que cada nodo solo pueda aparecer una vez en el ciclo, y por cada vez un nodo tiene que ocurrir. Esto equivale a las dos restricciones (aquí y a continuación, siempre que no se especifique, los sumandos se ejecutan sobre 0,1,…N-1)
fr: Il s'agit de trouver le cycle hamiltonien le plus court dans un graphe :math:`G = (V, E)` avec :math:`n=|V|` noeuds et les distances :math:` w_{ij}` (distance du sommet :math:`i` au sommet :math:`j`). Un cycle hamiltonien est décrit par :math:`N^2` variables :math:`x_{i,p}`, où :math:`i` représente le sommet et :math:`p` représente son ordre dans un cycle prospectif. La variable de décision prend la valeur 1 si la solution se produit sur le noeud :math:`i` au rang :math:`p`. Il faut que chaque somment apparaisse une fois et une seule dans le cycle et à chaque rang, il doit y avoir un sommet. Cela équivaut aux deux contraintes (ici et dans la suite, chaque fois que ce n'est pas spécifié, les sommations se font sur 0,1, ...N-1)
ko: 그래프 :math:`G=(V,E)` 에서 :math:`n=|V|` 노드와 거리, :math:`w_{ij}` (꼭지점 :math:`i` 에서 꼭지점 :math:`j` 까지의 거리) 에서 가장 짧은 해밀토니안 사이클을 찾는다. 해밀토니안 사이클은 :math:`N^2` 개의 변수 :math:`x_{i,p}` 에 의해 기술되고, 여기서 :math:`i` 는 노드를 나타내고, :math:`p` 는 잠재적 사이클에서 그 순서를 나타낸다. 결정 변수는 솔루션이 노드 :math:`i` 에서 시간 순서 :math:`p` 순서로 발생하는 경우 값 1을 사용한다. 모든 노드는 주기에서 한 번만 표시되어야 하고 매번 노드가 나타나야 한다. 이러한 양은 두 개의 제한조건 (여기에서 그리고 앞으로도, 특별히 언급하지 않아도, 합계는 0,1, ...N-1까지 진행된다)
pt_un: Encontre o ciclo Hamiltoniano mais curto em um grafo :math:`G=(V,E)` com :math:`n=|V|` nós e distâncias, :math:`w_{ij}` (distância do vértice :math:`i` ao vértice :math:`j`). Um ciclo Hamiltoniano é descrito por :math:`N^2` variáveis :math:`x_{i,p}`, sendo que :math:`i` representa o nó e :math:`p` representa a sua ordem em um ciclo prospectivo. A variável de decisão leva o valor 1 se a solução ocorrer no nó :math:`i` na posição no tempo :math:`p`. Nós exigimos que cada nó possa aparecer apenas uma vez no ciclo, e para cada tempo um nó precisa ocorrer. Isto equivale às duas restrições (aqui e nos seguintes, sempre que não especificado, os somatórios vão de 0,1,…N-1)
ta_in: ஒரு வரைபடத்தில் குறுகிய ஹாமில்டோனிய சுழற்சியைக் கண்டறியவும்:math:`G=(V,E)` உடன் :math:`n = |V|` முனைகள் மற்றும் தூரங்கள், :math:`w_{ij}` (தூரம்:math:`i` வெர்டெக்ஸிலிருந்து vertex :math:`j` வெர்டெக்ஸிக்கு). ஒரு ஹாமில்டோனிய சுழற்சி விவரிக்கிறது:math:`N^2` மாறிகள்:math:`x_{i,p} `, எங்கே:math:`i` கணுவைக் குறிக்கிறது மற்றும்:math:`p` அதன் வரிசையை வருங்கால சுழற்சி குறிக்கிறது. தீர்வு முனை:math:`i` நேர வரிசையில்:math:`p` இல் தீர்வு ஏற்பட்டால் முடிவு மாறி மதிப்பு 1 ஐ எடுக்கும். ஒவ்வொரு முனையும் சுழற்சியில் ஒரு முறை மட்டுமே தோன்ற வேண்டும், ஒவ்வொரு முறையும் ஒரு முனை ஏற்பட வேண்டும். இது இரண்டு தடைகளுக்கு சமம் (இங்கே மற்றும் பின்வருவனவற்றில், குறிப்பிடப்படாத போதெல்லாம், சம்மன்கள் 0,1,…N-1 க்கு மேல் இயங்கும்)
th_th: ค้นหา Hamiltonian Cycle ที่สั้นที่สุดภายในกราฟ :math:`G=(V,E)` โดยที่มี Node :math:`n=|V|` และระยะทาง :math:`w_{ij}` (ระยะทางระหว่าง Node :math:`i` ถึง Node :math:`j`) Hamiltonian Cycle สามารถอธิบายได้ด้วยตัวแปร :math:`x_{i,p}` จำนวน :math:`N^2` ตัวแปร โดยที่ :math:`i` คือเลขที่ของ Node และ :math:`p` คือลำดับของ Node ใน Cycle ตัวแปรตัดสินใจจะมีค่าเป็น 1 ถ้ามี Node :math:`i` ที่ลำดับ :math:`p` อยู่ในคำตอบ ข้อจำกัดที่สำคัญคือ 1 Node สามารถมีได้ 1 จุดเท่านั้นใน 1 Cycle และจะต้องมีอย่างน้อย 1 จุดใน 1 Cycle ซึ่งจาก 2 ข้อจำกัดนี้จะได้เป็น (ในส่วนถัดไปถ้าไม่ได้มีการระบุไว้ผลรวมคือการรวมกันตั้งแต่ 0,1,…N-1)

source: For nodes in our prospective ordering, if :math:`x_{i,p}` and :math:`x_{j,p+1}` are both 1, then there should be an energy penalty if :math:`(i,j) \notin E` (not connected in the graph). The form of this penalty is
bn_bn: আমাদের সম্ভাব্য ক্রমান্বয়ে নোডের জন্য, :math:`x_{i,p}` এবং :math:`x_{j,p+1}` উভয়ই যদি ১ হয় তবে সেখানে শক্তির জরিমানা থাকতে হবে যদি: :math:`(i,j) \notin E` (গ্রাফের সাথে সংযুক্ত নয়)। এই জরিমানার ফর্মটি হ'ল
es_un: Para los nodos en nuestro ordenamiento prospectivo, si :math:`x_{i,p}` y :math:`x_{j,p+1}` son ambos 1, entonces debería haber una penalización de energía si :math:`(i,j) \notin E` (no conectado en el grafo). La forma de esta penalización es
fr: Pour les noeuds de notre cycle prospectif, si :math:`x_{i,p}` et :math:`x_{j, p + 1 }` sont tous deux à 1 et que :math:`(i, j) \notin E` (i et j ne sont pas connectés dans le graphe), cela devrait se traduire par un coût énergétique . La forme de cette pénalité est
ko: 노드의 예상 순서에서, :math:`x_{i,p}` 와 :math:`x_{j,p+1}` 가 모두 1이면, :math:`(i,j) \notin E` 인(그래프에 연결되지 않음) 경우에는 에너지 패널티가 있어야 한다. 이 패널티의 형태는
pt_un: Para nós em nossa ordenação prospectiva, se :math:`x_{i,p}` e :math:`x_{j,p+1}` são ambos 1, então deve haver uma penalidade de energia se :math:`(i,j) \notin E` (não conectados no grafo). A forma desta penalidade é
ta_in: எங்கள் வருங்கால வரிசையில் உள்ள முனைகளுக்கு :math: `x_ {i,p}` மற்றும்:math: `x_{j, p+1}` இரண்டும் 1 என்றால், ஆற்றல் அபராதம் இருக்க வேண்டும்:math: `(i,j) \notin E` (வரைபடத்தில் இணைக்கப்படவில்லை). இந்த தண்டனையின் வடிவம்
th_th: ในส่วนลำดับของ Node ถ้า :math:`x_{i,p}` และ :math:`x_{j,p+1}` มีค่าเป็น 1 ทั้งคู่ เราจะต้องมีพจน์สำหรับลงโทษค่าพลังงาน ในกรณีที่ :math:`(i,j) \notin E` (ไม่ได้เชื่อมต่อกันในกราฟ) พจน์ของบทลงโทษสามารถเขียนได้เป็น

source: where it is assumed the boundary condition of the Hamiltonian cycles :math:`(p=N)\equiv (p=0)`. However, here it will be assumed a fully connected graph and not include this term. The distance that needs to be minimized is
bn_bn: যেখানে এটি হ্যামিল্টোনিয়ান চক্র :math:`(p=N)\equiv (p=0)` সীমানা শর্ত হিসাবে ধরে নেওয়া হয়। তবে, এখানে এটি সম্পূর্ণ সংযুক্ত গ্রাফ হিসাবে ধরে নেওয়া হবে এবং এই পদটি অন্তর্ভুক্ত করা হবে না। যে দূরত্বটি হ্রাস করা দরকার তা হ'ল
es_un: donde se asume la condición de frontera de los ciclos Hamiltonianos :math:`(p=N)\equiv (p=0)`. Sin embargo, aquí se supondrá un grafo completamente conectado y no incluirá este término. La distancia que se debe minimizar es
fr: nous supposons que la condition de limite des cycles hamiltoniens :math:` (p=N) \equiv (p= 0) ` est vérifiée. Nous supposons également que le graphe est entièrement connecté et n'inclut pas ce terme. La distance qui à réduire est alors
ko: 이며 해밀토니안 사이클의 경계 조건을 :math:`(p=N)\equiv (p=0)`로 가정한다: 그러나 여기서는 완전히 연결된 그래프로 간주하여 패널티는 포함하지 않는다. 최소화해야 할 거리는
pt_un: onde se assume que a condição de limite dos ciclos Hamiltonianos :math:`(p=N)\equiv (p=0)`. No entanto, aqui será assumido um grafo completo e não incluirá esse termo. A distância que precisa ser minimizada é
ta_in: இது ஹாமில்டோனிய சுழற்சிகளின் எல்லை நிலை என்று கருதப்படுகிறது:math: `(p=N) \equiv (p=0)`. இருப்பினும், இங்கே இது முழுமையாக இணைக்கப்பட்ட வரைபடமாக கருதப்படும் மற்றும் இந்த வார்த்தையை சேர்க்காது. குறைக்க வேண்டிய தூரம்
th_th: โดยเราสมมุติว่าเงื่อนไขของ Hamiltonian Cycle คือ :math:`(p=N)\equiv (p=0)` อย่างไรก็ตามในส่วนนี้เราไม่รวมพจน์ดังกล่าวเข้ามาด้วยเนื่องจากเราสมมุติว่ากราฟมีลักษณะเชื่อมต่อกันทั้งหมด ระยะทางที่จะต้องทำการหาค่าต่ำสุดคือ

source: Putting this all together in a single objective function to be minimized, we get the following:
bn_bn: এগুলি হ্রাস করতে একটি একক নৈর্ব্যক্তিক অন্বয় (অব্জেক্টিভ ফাংশন) একসাথে রাখলে আমরা নিম্নলিখিতটি পাই:
es_un: Poniendo todo esto junto en una única función objetivo para minimizar, obtenemos lo siguiente:
fr: En mettant tout cela ensemble dans une seule fonction objectif à minimiser, nous obtenons les éléments suivants :
ko: 이 모든 것을 최소화하기 위해 하나의 목적 함수에 모으면 다음과 같은 결과를 얻을 수 있다:
pt_un: Juntando tudo isso numa única função objetiva a ser minimizada, obtemos o seguinte:
ta_in: குறைக்கப்பட வேண்டிய ஒற்றை புறநிலை செயல்பாட்டில் இவை அனைத்தையும் ஒன்றாக இணைத்து, பின்வருவனவற்றைப் பெறுகிறோம்:
th_th: รวมทุก ๆ ส่วนเข้าด้วยกันเป็นฟังก์ชันวัตถุประสงค์เดียวเพื่อหาค่าต่ำสุด เราจะได้:
