Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/06_examples_max_cut_and_tsp.po
Languages: bn_bn, es_un, fr, ko, pt_un, ta_in, th_th

source: This page was generated from `docs/tutorials/06_examples_max_cut_and_tsp.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/06_examples_max_cut_and_tsp.ipynb`__ থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `docs/tutorials/06_examples_max_cut_and_tsp.ipynb`__.
fr: Cette page a été générée à partir de `docs/tutorials/06_examples_max_cut_and_tsp.ipynb`__.
ko: 이 페이지는 `docs/tutorials/06_examples_max_cut_and_tsp.ipynb`__에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/06_examples_max_cut_and_tsp.ipynb`__.
ta_in: இந்தப் பக்கம் இதிலிருந்து உருவாக்கப்பட்டது `docs/tutorials/06_examples_max_cut_and_tsp.ipynb`__.
th_th: หน้านี้ถูกสร้างขึ้นจาก `docs/tutorials/06_examples_max_cut_and_tsp.ipynb`__

source: Max-Cut and Traveling Salesman Problem
bn_bn: সর্বোচ্চ লাভ এবং ট্রাভেলিং সেলসম্যান সমস্যা
es_un: Max-Cut y Problema del Vendedor Viajero
fr: *Max-Cut et Problème du Voyageur de Commerce (Tsp pour Traveling Salesman Problem)*
ko: 최대 컷 및 외판원 문제
pt_un: Max-Cut e Problema do Caixeiro Viajante
ta_in: மேக்ஸ்-கட் மற்றும் பயண விற்பனையாளர் பிரச்சனை
th_th: โจทย์ปัญหา Max-Cut และ Traveling Salesman

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
ko: 소개
pt_un: Introdução
ta_in: முன்னுரை
th_th: บทนำ

source: Many problems in quantitative fields such as finance and engineering are optimization problems. Optimization problems lie at the core of complex decision-making and definition of strategies.
bn_bn: পরিমাণ ক্ষেত্রের অনেকগুলি সমস্যা যেমন ব্যবস্থাপনাবিদ্যা এবং ইঞ্জিনিয়ারিং হল অনুকূলায়ন (অপ্টিমাইজেশন) সমস্যাসমূহ। অনুকূলায়ন (অপ্টিমাইজেশন) সমস্যাগুলি জটিল সিদ্ধান্ত গ্রহণ এবং কৌশলগুলির সংজ্ঞার মূল ভিত্তিতে থাকে।
es_un: Muchos problemas en campos cuantitativos como las finanzas y la ingeniería son problemas de optimización. Los problemas de optimización se encuentran en el centro de la compleja toma de decisiones y la definición de estrategias.
fr: De nombreux problèmes dans des domaines quantitatifs tels que le financement et l'ingénierie sont des problèmes d'optimisation. Ces types de problèmes sont au cœur de la complexité de la prise de décision et de la définition des stratégies.
ko: 금융과 공학과 같은 정량적 분야에서의 많은 문제들은 최적화 문제이다. 최적화 문제는 복잡한 의사결정과 전략의 정의의 핵심이다.
pt_un: Muitos problemas em domínios quantitativos como o financiamento e a engenharia são problemas de otimização. Os problemas de optimização estão no cerne da complexa tomada de decisões e da definição de estratégias.
ta_in: பொருளாதார மற்றும் பொறியியல் போன்றவற்றில் பல பிரச்சினைகள் பெரும்பாலான பிரச்சினைகளாகும். ஒப்பீட்டளவு சிக்கல்கள் சிக்கலான முடிவெடுப்பது மற்றும் உத்திகளின் வரையறையின் மையத்தில் உள்ளன.
th_th: ปัญหาหลายอย่างที่พบในการทำงานด้านการวิเคราะห์เชิงปริมาณเช่น ด้านการเงินและวิศวกรรม คือปัญหา Optimization ปัญหา Optimization เป็นแกนหลักที่ใช้ในการตัดสินใจที่ซับซ้อนและการกำหนดกลยุทธ์

source: Optimization (or combinatorial optimization) means searching for an optimal solution in a finite or countably infinite set of potential solutions. Optimality is defined with respect to some criterion function, which is to be minimized or maximized. This is typically called cost function or objective function.
bn_bn: অপ্টিমাইজেশন (বা সমাবেশীয় অনুকূলায়ন (অপ্টিমাইজেশন)) এর অর্থ সীমাবদ্ধ বা সম্ভাব্য সমাধানের অসীম সেটগুলিতে একটি অনুকূল সমাধান অনুসন্ধান করা। অনুকূলতাটি কিছু মানদণ্ডের ফাংশনের প্রতি সম্মানের সাথে সংজ্ঞায়িত করা হয়, যা ছোট বা সর্বাধিক করতে হবে। একে সাধারণত কস্ট ফাংশন বা নৈর্ব্যক্তিক অন্বয় (অব্জেক্টিভ ফাংশন) বলা হয়।
es_un: Optimización (u optimización combinatoria) significa buscar una solución óptima en un conjunto finito o contablemente infinito de soluciones potenciales. La optimalidad se define con respecto a alguna función de criterio, que debe minimizarse o maximizarse. Esto normalmente se llama función de costo o función objetivo.
fr: Optimisation (ou optimisation combinatoire) signifie rechercher une solution optimale dans un ensemble fini ou infini dénombrable de solutions potentielles. L'optimalité est définie par rapport à une fonction de critère, qui doit être minimisée ou maximisée. Cette fonction est généralement appelée fonction de coût ou fonction objectif.
ko: 최적화 (또는 조합 최적화) 는 유한한 또는 수적으로 무한한 세트의 잠재적 솔루션에서 최적의 솔루션을 검색하는 것을 의미한다. 최적은 일부 기준 함수와 관련하여 정의되며 최소화되거나 최대화되어야 한다. 이는 일반적으로 비용 함수 또는 목적 함수라고 합니다.
pt_un: Otimização (ou otimização combinatória) significa procurar uma solução ideal em um conjunto finito ou contavelmente infinito de possíveis soluções. A solução ótima é definida no que se refere a alguma função de critério, que deve ser minimizada ou maximizada. Isso é normalmente chamado função de custo ou função objetiva.
ta_in: மிகையாக்கல் (அல்லது ஒருங்கிணைந்த தேர்வுமுறை) என்பது ஒரு வரையறுக்கப்பட்ட அல்லது எண்ணற்ற அளவிலான சாத்தியமான தீர்வுகளில் உகந்த தீர்வைத் தேடுவது. உகந்த தன்மை சில அளவுகோல் செயல்பாட்டைப் பொறுத்து வரையறுக்கப்படுகிறது, இது குறைக்கப்பட வேண்டும் அல்லது அதிகரிக்கப்பட வேண்டும். இது பொதுவாக செலவு செயல்பாடு அல்லது புறநிலை செயல்பாடு என்று அழைக்கப்படுகிறது.
th_th: Optimization (หรือ Combinatorial Optimization) คือการค้นหาค่าคำตอบที่ดีที่สุดในเชตของคำตอบที่เป็นไปได้อย่างจำกัด ค่าที่ดีที่สุดนั้นจะถูกนิยามด้วยฟังก์ชันบางอย่าง ซึ่งเราต้องการที่จะทำให้ค่าของฟังก์ชันนั้นมีค่ามากที่สุดหรือน้อยที่สุด โดยทั่วไปแล้วเราเรียกฟังก์ชันนี้ว่า Cost Function หรือ Objective Function (ฟังก์ชันวัตถุประสงค์)

source: **Typical optimization problems**
bn_bn: **সাধারণ অনুকূলায়ন (অপ্টিমাইজেশন) সমস্যাসমূহ**
es_un: **Problemas típicos de optimización**
fr: ** Problèmes d'optimisation typiques **
ko: **전형적인 최적화 문제들**
pt_un: **Problemas típicos de otimização**
th_th: **โจทย์ปัญหา Optimization โดยทั่วไป**

source: Minimization: cost, distance, length of a traversal, weight, processing time, material, energy consumption, number of objects
bn_bn: হ্রাসকরণ: ব্যয়, দূরত্ব, একটি ট্র্যাভারসাল দৈর্ঘ্য, ওজন, প্রক্রিয়াকরণের সময়, উপাদান, শক্তি খরচ, বস্তুর (অবজেক্ট) সংখ্যা
es_un: Minimización: costo, distancia, longitud de un recorrido, peso, tiempo de procesamiento, material, consumo de energía, número de objetos
fr: Recherche de minimum : coût, distance, longueur d'une traversée, poids, temps de traitement, matériau, consommation d'énergie, nombre d'objets
ko: 최소화: 비용, 거리, 횡단의 길이, 가중치, 처리 시간, 재료, 에너지 소비, 객체들의 수
pt_un: Minimização: custo, distância, comprimento de um transversal, peso, tempo de processamento, material, consumo de energia, número de objetos
ta_in: குறைத்தல்: செலவு, தூரம், ஒரு பயணத்தின் நீளம், எடை, செயலாக்க நேரம், பொருள், ஆற்றல் நுகர்வு, பொருட்களின் எண்ணிக்கை
th_th: การหาค่าต่ำสุด: ต้นทุน, ระยะทาง, ระยะของการเดินทาง, น้ำหนัก, ระยะเวลาในการประมวลผล, วัสดุ, พลังงานที่ใช้, จำนวนของสิ่งของ

source: Maximization: profit, value, output, return, yield, utility, efficiency, capacity, number of objects
bn_bn: সর্বাধিকীকরণ: লাভ, মান, আউটপুট, রিটার্ন, ফলন, উপযোগ, দক্ষতা, ক্ষমতা, বস্তুর (অবজেক্ট) সংখ্যা
es_un: Maximización: beneficio, valor, producción, retorno, rendimiento, utilidad, eficiencia, capacidad, número de objetos
fr: Recherche de maximum : profit, valeur, rendement, utilité, efficacité, capacité, nombre d'objets
ko: 최대화율: 이익, 가치, 출력, 반환, 수율, 도구, 효율성, 용량, 오브젝트 수
pt_un: Maximização: lucro, valor, saída, retorno, renda, utilidade, eficiência, capacidade, número de objetos
ta_in: அதிகரிப்பு: லாபம், மதிப்பு, வெளியீடு, வருமானம், மகசூல், பயன்பாடு, செயல்திறன், திறன், பொருட்களின் எண்ணிக்கை
th_th: การหาค่ามากสุด: กำไร, คุณค่า, ผลลัพธ์, สิ่งตอบแทน, ผลผลิต, ความคุ้มค่า, ประสิทธิภาพ, ความจุ, จำนวนสิ่งของ

source: We consider here max-cut problems of practical interest in many fields, and show how they can be mapped on quantum computers manually and how Qiskit’s optimization module supports this.
bn_bn: আমরা এখানে অনেক ক্ষেত্রে ব্যবহারিক আগ্রহের সর্বোচ্চ লাভ সমস্যাগুলি বিবেচনা করি এবং দেখি কীভাবে সেগুলি ম্যানুয়ালি কোয়ান্টাম কম্পিউটারগুলিতে ম্যাপ করা যায় এবং কিস্কিটের অপ্টিমাইজেশন মডিউলটি এটি সমর্থন করে।
es_un: Consideramos aquí problemas de máximo corte (max-cut) de interés práctico en muchos campos, y mostramos cómo se pueden mapear manualmente en computadoras cuánticas y cómo el módulo de optimización de Qiskit lo soporta.
fr: Nous considérons ici les problèmes de type max-cut qui ont un intérêt pratique dans de nombreux domaines, et nous montrons comment ils peuvent être implémentés manuellement sur les ordinateurs quantiques et comment le module d'optimisation de Qiskit supporte cela.
ko: 여기에서는 다양한 분야의 실질적으로 사람들이 관심을 갖는 최대컷 문제를 다룬다. 그리고 양자 컴퓨터에서 수동으로 매핑할 수 있는 방법과 Qiskit의 최적화 모듈이 이를 지원하는 방법을 설명한다.
pt_un: Consideramos aqui problemas de "max-cut" de interesse prático em muitos domínios, e mostraremos como eles podem ser mapeados em computadores quânticos manualmente e como o módulo de otimização do Qiskit suporta isso.
ta_in: பல துறைகளில் நடைமுறை ஆர்வத்தின் அதிகபட்ச சிக்கல்களை நாங்கள் இங்கு கருதுகிறோம், மேலும் அவை குவாண்டம் கணினிகளில் கைமுறையாக எவ்வாறு வரைபடமாக்கப்படலாம் என்பதையும், Qiskit’டின் தேர்வுமுறை தொகுதி இதை எவ்வாறு ஆதரிக்கிறது என்பதையும் காண்பிப்போம்.
th_th: เราจะมาพิจารณาโจทย์ปัญหา Max-Cut ในหลาย ๆ แง่มุม และแสดงให้เห็นว่าเราจะสามารถแปลงโจทย์ไปทำงานบนเครื่องควอนตัมคอมพิวเตอร์ได้อย่างไรทีละขั้นตอน และแสดงให้เห็นว่าโมดูล Qiskit Optimization สามารถช่วยทำงานในส่วนนี้ได้อย่างไร

source: Weighted Max-Cut
es_un: Max-Cut Ponderado
fr: Max-Cut pondéré
ko: 가중치를 지닌 최대 컷
pt_un: Max-Cut ponderado
ta_in: வெயிட்டட் மேக்ஸ்-கட்

source: Max-Cut is an NP-complete problem, with applications in clustering, network science, and statistical physics. To grasp how practical applications are mapped into given Max-Cut instances, consider a system of many people that can interact and influence each other. Individuals can be represented by vertices of a graph, and their interactions seen as pairwise connections between vertices of the graph, or edges. With this representation in mind, it is easy to model typical marketing problems. For example, suppose that it is assumed that individuals will influence each other’s buying decisions, and knowledge is given about how strong they will influence each other. The influence can be modeled by weights assigned on each edge of the graph. It is possible then to predict the outcome of a marketing strategy in which products are offered for free to some individuals, and then ask which is the optimal subset of individuals that should get the free products, in order to maximize revenues.
bn_bn: ক্লাস্টারিং, নেটওয়ার্ক সায়েন্স এবং স্ট্যাটিস্টিকাল ফিজিক্সে অ্যাপ্লিকেশন সহ ম্যাক্স-কাট একটি এনপি-কমপ্লিট সমস্যা। প্রদত্ত ম্যাক্স-কাট দৃষ্টান্তগুলিতে কীভাবে ব্যবহারিক অ্যাপ্লিকেশনগুলি ম্যাপ করা হয় তা বুঝতে, অনেক মানুষ যুক্ত এমন একটি ব্যবস্থা বিবেচনা করুন যারা একে অপরকে যোগাযোগ করতে এবং প্রভাবিত করতে পারে। কোনও গ্রাফের শীর্ষে (vertex) এবং তাদের ইন্টারঅ্যাকশনগুলি গ্রাফের শীর্ষে (vertex) বা প্রান্তগুলির (edge) মধ্যে জোড়াযুক্ত সংযোগ হিসাবে দেখা যায়। এই উপস্থাপনাটিকে মনে রেখে, সাধারণত বিপণনের সমস্যার মডেল করা সহজ। উদাহরণস্বরূপ, ধরুন, যে ব্যক্তিরা একে অপরের ক্রয়ের সিদ্ধান্তকে প্রভাবিত করবে এবং তারা একে অপরকে কতটা শক্তিশালী করবে সে সম্পর্কে জ্ঞান দেওয়া হয়। প্রতিটি প্রান্তে নির্ধারিত ওজন দ্বারা এই প্রভাব টি মডেল করা যেতে পারে। তারপরে এমন বিপণন কৌশলটির ফলাফল সম্পর্কে ভবিষ্যদ্বাণী করা সম্ভব হয় যেখানে কিছু ব্যক্তিকে বিনামূল্যে পণ্য সরবরাহ করা হয়, এবং তারপরে জিজ্ঞাসা করা হয় যে আয়গুলি সর্বাধিকতর করার জন্য নিখরচায় পণ্যগুলি পাওয়া উচিত এমন ব্যক্তিদের সর্বোত্তম সাবসেট টি কোনটি।
es_un: Max-Cut (máximo corte) es un problema NP completo, con aplicaciones en agrupamiento (clustering), ciencia de redes y física estadística. Para comprender cómo se asignan las aplicaciones prácticas a instancias determinadas de Max-Cut, considera un sistema de muchas personas que pueden interactuar e influir entre sí. Los individuos se pueden representar mediante vértices de un grafo y sus interacciones se pueden ver como conexiones por pares entre vértices del grafo, o aristas. Con esta representación en mente, es fácil modelar los problemas típicos de mercadotecnia. Por ejemplo, supón que se asume que los individuos influirán en las decisiones de compra de los demás, y se da conocimiento sobre que tan fuerte se influirán entre sí. La influencia se puede modelar mediante los pesos asignados en cada arista del grafo. Entonces, es posible predecir el resultado de una estrategia de mercadotecnia en la que los productos se ofrecen de forma gratuita a algunos individuos, y luego preguntar cuál es el subconjunto óptimo de individuos que deberían obtener los productos gratuitos, para maximizar los ingresos.
fr: Le problème Max-Cut est de classe NP-complet, avec des applications en recherche de clusters, en sciences des réseaux et en physique statistique. Pour comprendre comment les applications pratiques correspondent à des instances de Max-Cut, pensez à un système de nombreuses personnes qui peuvent interagir et s'influencer mutuellement. Les individus peuvent être représentés par des sommets d'un graphe, et leurs interactions vues comme les connexions entre des sommets du graphe, ou des arêtes. Avec cette représentation à l'esprit, il est facile de modéliser des problèmes de marketing typiques. Par exemple, supposons que les personnes influeront sur les décisions d'achat de l'autre et que les connaissances sont données sur la force de leur influence. L'influence peut être modélisée par des pondérations affectées à chaque arête du graphique. Il est alors possible de prédire le résultat d'une stratégie de commercialisation dans laquelle les produits sont offerts gratuitement à certains individus, puis de demander quel est le sous-ensemble optimal d'individus qui devraient obtenir les produits gratuits, afin de maximiser les revenus.
ko: 최대 컷 (Max-Cut) 은 NP-완전 문제이며, 클러스터링, 네트워크 과학, 그리고 통계적 물리학에 응용된다. 실제 애플리케이션이 지정된 최대 컷 인스턴스로 맵핑되는 방법을 파악하려면 서로 상호작용 및 영향을 줄 수 있는 많은 사용자의 시스템을 고려해야한다. 개인들은 그래프의 꼭짓점으로 표현될 수 있고, 그들의 상호작용들은 그래프의 꼭지점 또는 모서리들 간의 쌍으로 연결된다. 이러한 표현을 사용하면 일반적인 마케팅 문제를 쉽게 모델링할 수 있다. 예를 들어, 개인이 서로의 구매 결정에 영향을 미칠 것이라고 가정하고, 서로 영향을 미칠 수 있는 지식에 대해 알고 있다고 가정한다. 그래프의 각 모서리에 지정된 가중치에 따라 영향을 모델링할 수 있다. 그런 다음 일부 개인에게 제품을 무료로 제공하는 마케팅 전략의 결과를 예측하고, 수익을 극대화하기 위해 어떤 개인들이 무료 제품을 받아야 하는 최적의 부분 집합인지 물어볼 수 있다.
pt_un: Max-Cut é um problema NP-completo, com aplicações em clusterização, ciência de redes e física estatística. Para compreender como as aplicações práticas são mapeadas para instâncias do Max-Cut, considere um sistema de muitas pessoas que podem interagir e influenciar umas às outras. Indivíduos podem ser representados por vértices de um grafo e suas interações podem ser vistas como conexões em pares entre vértices do grafo, ou arestas. Com esta representação em mente, é fácil modelar problemas típicos de Marketing. Por exemplo, suponhamos que se parte do princípio de que os indivíduos influenciarão as decisões de compra uns dos outros, e é dado conhecimento do grau de influência recíproca. A influência pode ser modelada por pesos atribuídos em cada aresta do grafo. É então possível prever o resultado de uma estratégia de comercialização em que os produtos são oferecidos gratuitamente a alguns indivíduos, e depois perguntar qual é o subconjunto ideal de indivíduos que devem obter os produtos grátis a fim de maximizar as receitas.
ta_in: மேக்ஸ்-கட் என்பது NP- முழுமையான சிக்கலாகும், இதில் க்ளஸ்டரிங், நெட்வொர்க் சயின்ஸ் மற்றும் புள்ளிவிவர இயற்பியல் ஆகியவற்றில் பயன்பாடுகள் உள்ளன. கொடுக்கப்பட்ட மேக்ஸ்-கட் நிகழ்வுகளில் நடைமுறை பயன்பாடுகள் எவ்வாறு மாற்றப்படுகின்றன என்பதைப் புரிந்துகொள்ள, ஒருவருக்கொருவர் தொடர்புகொண்டு செல்வாக்கு செலுத்தக்கூடிய பல நபர்களின் அமைப்பைக் கவனியுங்கள். தனிநபர்களை ஒரு வரைபடத்தின் செங்குத்துகளால் குறிக்க முடியும், மேலும் அவற்றின் தொடர்புகள் வரைபடத்தின் செங்குத்துகள் அல்லது விளிம்புகளுக்கு இடையில் ஜோடிவரிசை இணைப்புகளாகக் காணப்படுகின்றன. இந்த பிரதிநிதித்துவத்தை மனதில் கொண்டு, வழக்கமான சந்தைப்படுத்தல் சிக்கல்களை மாதிரியாக்குவது எளிது. எடுத்துக்காட்டாக, தனிநபர்கள் ஒருவருக்கொருவர் வாங்கும் முடிவுகளை பாதிக்கும் என்று கருதப்படுகிறது என்று வைத்துக்கொள்வோம், மேலும் அவர்கள் ஒருவருக்கொருவர் எவ்வளவு வலுவாக செல்வாக்கு செலுத்துவார்கள் என்பது பற்றிய அறிவு வழங்கப்படுகிறது. வரைபடத்தின் ஒவ்வொரு விளிம்பிலும் ஒதுக்கப்பட்டுள்ள எடைகளால் செல்வாக்கை வடிவமைக்க முடியும். சில தனிநபர்களுக்கு இலவசமாக தயாரிப்புகள் வழங்கப்படும் சந்தைப்படுத்தல் மூலோபாயத்தின் விளைவுகளை கணிக்க முடியும், பின்னர் வருவாயை அதிகரிக்க, இலவச தயாரிப்புகளைப் பெற வேண்டிய தனிநபர்களின் உகந்த துணைக்குழு எது என்று கேளுங்கள்.
th_th: Max-Cut เป็นโจทย์ปัญหา NP-Complete ซึ่งสามารถนำไปใช้ในงานจริง ๆ ได้เช่นการแบ่งกลุ่มข้อมูล, วิทนาศาสตร์โครงข่ายข้อมูล และ ฟิสิกส์สถิติ เพื่อทำความเข้าใจว่าเราจะสามารถนำงานในโลกจริงแปลงเข้ามาเป็นโจทย์ Max-Cut ได้อย่างไร ให้เรามองผู้คนเป็นระบบหนึ่ง โดยระบบนี้คนแต่ละคนสามารถมีปฏิสัมพันธ์กับคนอื่น ๆ ได้ เราสามารถนำระบบนี้มาแสดงเป็นกราฟได้ โดยคนแต่ละคนจะถูกแทนที่ด้วย Node ของกราฟ และปฏิสัมพันธ์ระหว่างแต่ละคนจะถูกแทนที่ด้วยเส้นเชื่อมระหว่าง Node หรือเรียกว่า Edge ซึ่งการนำข้อมูลมาแสดงผลในลักษณะแบบนี้เป็นการแทนที่แบบง่าย ๆ ที่สามารถนำมาตอบโจทย์ปัญหาทางการตลาดทั่วไปได้ เช่น สมมุติว่าการเลือกซื้อสินค้าของบุคคลแต่ละคนนั้นส่งผลต่อการเลือกซื้อสินค้าของคนอื่น และเรามีข้อมูลว่าคน ๆ นั้นมีอิทธิพลต่อการเลือกซื้อของคนอื่นมากแค่ไหน เราสามารถนำข้อมูลนี้มาสร้างเป็น Weighted Graph ได้โดยให้แต่ละคนเป็น Node ความสัมพันธ์ของแต่ละคนเป็น Edge และอิทธิพลที่คน ๆ หนึ่งมีต่อคนอีกคนให้ค่านี้เป็นน้ำหนักของ Edge นั้น ๆ ทำให้เราสามารถทำนายผลลัพธ์ทางการตลาดได้จากกราฟนี้ และนำไปสร้างเป็นกลยุทธ์เช่น การค้นหาว่าจะทำอย่างไรให้สามารถโฆษณาสินค้าไปที่จำนวนคนน้อยที่สุด แต่ทำให้เกิดกำไรมากที่สุด

source: The formal definition of this problem is the following:
bn_bn: এই সমস্যার আনুষ্ঠানিক সংজ্ঞাটি হল:
es_un: La definición formal de este problema es la siguiente:
fr: La définition formelle de ce problème est la suivante :
ko: 이 문제의 공식적인 정의는 다음과 같다.
pt_un: A definição formal deste problema é a seguinte:
ta_in: இந்த சிக்கலின் முறையான வரையறை பின்வருமாறு:
th_th: นิยามอย่างเป็นทางการของโจทย์ปัญหานี้มีลักษณะดังนี้:

source: Consider an :math:`n`-node undirected graph *G = (V, E)* where *\|V\| = n* with edge weights :math:`w_{ij}>0`, :math:`w_{ij}=w_{ji}`, for :math:`(i, j)\in E`. A cut is defined as a partition of the original set V into two subsets. The cost function to be optimized is in this case the sum of weights of edges connecting points in the two different subsets, *crossing* the cut. By assigning :math:`x_i=0` or :math:`x_i=1` to each node :math:`i`, one tries to maximize the global profit function (here and in the following summations run over indices 0,1,…n-1)
bn_bn: একটি :math:`n` নোড পুনর্নির্দেশিত গ্রাফ *G = (V, E)* বিবেচনা করুন যেখানে *\|V\| = n* জন্য প্রান্তের ওজন :math:`w_{ij}>0`, :math:`w_{ij}=w_{ji}` , সহ :math:`(i, j)\in E`। একটি কাট দুটি সাব সেট এর মূল সেট V এর পার্টিশন হিসাবে সংজ্ঞায়িত করা হয়। অনুকূলিতকরণের জন্য কাট টি ক্রস করে ব্যয় ফাংশনটি এই ক্ষেত্রে দুটি পৃথক উপধারায় সংযোগকারী পয়েন্টের ওজনগুলির যোগফল। প্রতিটি নোডে :math:`x_i=0` বা :math:`x_i=1` নির্ধারণের মাধ্যমে :math:`i`, একজন সামগ্রিক লাভের ফাংশন সর্বাধিক করার চেষ্টা করে (এখানে এবং নিচের সংক্ষেপে সূচকগুলির উপরে 0,1,… n -1 চালানো হয়)
es_un: Considera un grafo *G = (V, E)* no dirigido de :math:`n` nodos, donde *\|V\| = n*, con pesos de arista :math:`w_{ij}>0`, :math:`w_{ij}=w_{ji}`, para :math:`(i, j)\in E`. Un corte se define como una partición del conjunto V original en dos subconjuntos. La función de costo a optimizar es en este caso la suma de los pesos de las aristas que conectan los puntos en los dos subconjuntos diferentes, *cruzando* el corte. Al asignar :math:`x_i=0` o :math:`x_i=1` a cada nodo :math:`i`, se intenta maximizar la función de beneficio global (aquí y en las siguientes sumas los índices corren sobre 0,1,…n-1)
fr: Considérons un graphe non orienté à :math:`n` noeuds *G = (V, E)* où * \|V\ | = n* avec des poids d'arête :math:`w_{ij}>0`, :math:` w_{ij}= w_{ji}`, pour :math:`(i,j) \in E`. Une coupe est définie comme une partition de l'ensemble V d'origine en deux sous-ensembles. La fonction de coût à optimiser est dans ce cas la somme des poids des arêtes qui *croisent* la coupe dans les deux sous-ensembles définis par la coupe. En assignant :math:`x_i=0` ou :math:`x_i=1` à chaque noeud :math:`i`, on essaie de maximiser la fonction de profit global (ici et dans la suite, les sommations s'effectuent sur les indices 0,1, ... n-1)
ko: :math:`n`-노드의 무방향 그래프가 *G = (V, E)* 이때 *\|V\| = n* 모서리의 가중치 :math:`w_{ij}>0`, :math:`w_{ij}=w_{ji}`, for :math:`(i, j)\in E`. 컷은 원래 세트 V를 두 하위 집합으로 분할하는 것으로 정의된다. 이 경우 최적화할 비용 함수는 서로 다른 두 하위 집합의 가장자리 연결 지점의 가중치 합계이며 *crossing* 컷이다. :math:`x_i=0` 혹은 :math:`x_i=1` 을 모든 노드 :math:`i` 에 대해 가정하면, 사용자는 글로벌 이익 함수를 최대화하려고 한다 (여기서 및 다음 덧샘연산에서 지수 0,1,...n-1에 대해 진행된다)
pt_un: Considere um grafo não dirigido com :math:`n` nós *G = (V, E)* onde *\|V\| = n* com pesos :math:`w_{ij}>0`, :math:`w_{ij}=w_{ji}`, for :math:`(i, j)\in E` nas arestas. Um corte é definido como uma partição do conjunto original V em dois subconjuntos. A função de custo a ser otimizada é neste caso a soma dos pesos das arestas conectando pontos nos dois subconjuntos diferentes, *cruzando* o corte. Atribuindo :math:`x_i=0` ou :math:`x_i=1` a cada nó :math:`i`, tentamos maximizar a função global de lucro (aqui e nas somatórias seguintes são executadas sobre índices 0,1,…n-1)
ta_in: இதைக் கவனியுங்கள் :math:`n`- முனை திருப்பிவிடப்படாத வரைபடம் *G = (V, E)* எங்கே *\|V\| = n* விளிம்பு எடையுடன் :math:`w_{ij}>0`, :math:`w_{ij}=w_{ji}`, இதற்கு :math:`(i, j)\in E` இல். ஒரு வெட்டு அசல் தொகுப்பு V இன் பகிர்வாக இரண்டு துணைக்குழுக்களாக வரையறுக்கப்படுகிறது.உகந்ததாக்கப்பட வேண்டிய செலவுச் செயல்பாடு, இந்த வழக்கில் இரண்டு வெவ்வேறு துணைக்குழுக்களில் உள்ள புள்ளிகளை இணைக்கும் விளிம்புகளின் எடைகளின் கூட்டுத்தொகையாகும், *குறுக்கு* வெட்டு. ஒதுக்குவதன் மூலம் :math:`x_i=0` அல்லது :math:`x_i=1` ஒவ்வொரு முனைக்கும் :math:`i`, ஒருவர் உலகளாவிய இலாப செயல்பாட்டை அதிகரிக்க முயற்சிக்கிறார் (இங்கே மற்றும் பின்வரும் சுருக்கங்களில் குறியீடுகள் 0,1 ,… N-1)
th_th: กำหนด Undirected Graph ขนาด :math:`n` *G = (V, E)* โดยที่ *\|V\| = n* และมีน้ำหนักของ Edge เป็น :math:`w_{ij}>0`, :math:`w_{ij}=w_{ji}` สำหรับ :math:`(i, j)\in E` Cut คือการแบ่งเซต V ออกเป็น 2 เซตย่อย ค่าฟังก์ชันวัตถุประสงค์คือผลรวมของน้ำหนักของ Edge ที่เชื่อมต่อกัน *ข้าม* ระหว่าง 2 เซตย่อย โดยกำหนดให้ :math:`x_i=0` หรือ :math:`x_i=1` สำหรับแต่ละ Node :math:`i` โดยในการ Optimize เราจะพยายามทำให้ค่าของฟังก์ชันวัตถุประสงค์มีค่ามากที่สุด (ผลรวมเป็นการรวมกันของข้อมูลตั้งแต่ 0 ถึง n-1)
