Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/06_examples_max_cut_and_tsp.po
Languages: bn_bn, es_un, fr, ko, pt_un, ta_in, th_th

source: In our simple marketing model, :math:`w_{ij}` represents the probability that the person :math:`j` will buy a product after :math:`i` gets a free one. Note that the weights :math:`w_{ij}` can in principle be greater than :math:`1` (or even negative), corresponding to the case where the individual :math:`j` will buy more than one product. Maximizing the total buying probability corresponds to maximizing the total future revenues. In the case where the profit probability will be greater than the cost of the initial free samples, the strategy is a convenient one. An extension to this model has the nodes themselves carry weights, which can be regarded, in our marketing model, as the likelihood that a person granted with a free sample of the product will buy it again in the future. With this additional information in our model, the objective function to maximize becomes
bn_bn: আমাদের সাধারণ বিপণন মডেলটিতে, :math:`w_{ij}` এই সম্ভাব্যতা উপস্থাপন করে যে :math:`j` ব্যক্তি :math:`i` ফ্রি পাওয়ার পরে কোনও পণ্য কিনবে। নোট করুন যে ওজন :math:`w_{ij}` নীতিগতভাবে :math:`1` (বা এমনকি নেতিবাচক) এর চেয়েও বেশি হতে পারে, সেই ক্ষেত্রে যেখানে পৃথক :math:`j` একাধিক পণ্য কেনে। মোট কেনার সম্ভাব্যতা সর্বাধিকীকরণ মোট ভবিষ্যতের আয়কে সর্বাধিক করার সাথে মিলে যায়। এই মডেলটির একটি বর্ধনের সাথে নোডগুলি ওজন বহন করে, যা আমাদের বিপণনের মডেল হিসাবে বিবেচনা করা যেতে পারে, সম্ভাবনা হিসাবে পণ্যটির একটি নিখরচায় নমুনা দেওয়া কোনও ব্যক্তি ভবিষ্যতে আবার কিনবে। আমাদের মডেলটিতে এই অতিরিক্ত তথ্য সহ, সর্বাধিকীকরণের অব্জেক্টিভ ফাংশনটি হয়ে ওঠে।
es_un: En nuestro modelo de mercadotecnia simple, :math:`w_{ij}` representa la probabilidad de que la persona :math:`j` compre un producto después de que la persona :math:`i` obtenga uno gratis. Ten en cuenta que los pesos :math:`w_{ij}` pueden, en principio, ser mayores que :math:`1` (o incluso negativos), correspondiente al caso en el que el individuo :math:`j` comprará más de un producto. Maximizar la probabilidad de compra total corresponde a maximizar los ingresos futuros totales. En el caso de que la probabilidad de ganancia sea mayor que el costo de las muestras gratuitas iniciales, la estrategia es conveniente. Una extensión de este modelo hace que los propios nodos tengan pesos, lo que puede considerarse, en nuestro modelo de mercadotecnia, como la probabilidad de que una persona a la que se le haya otorgado una muestra gratuita del producto lo vuelva a comprar en el futuro. Con esta información adicional en nuestro modelo, la función objetivo para maximizar se convierte en
fr: Dans notre modèle de marketing simplifié :math:`w_{ij}` représente la probabilité que la personne :math:`j` achète un produit après que la personne :math:`i` en ait obtenu un gratuitement. Notez que les poids :math:`w_{ij}` peuvent en principe être supérieurs à :math:`1` (ou même négatifs), ce qui correspond au cas où la personne :math:`j` achètera plus d'un produit. Maximiser le total des probabilités d'achat correspond à la maximisation du total des recettes futures. Dans le cas où la probabilité de profit sera supérieure au coût des échantillons gratuits initiaux, la stratégie est convenable. Une extension de ce modèle consiste à ce que des poids soient aussi attribués aux noeuds eux-même. Dans notre modèle de marketing, ces poids peuvent être considérés comme la probabilité qu'une personne qui a reçu un échantillon gratuit du produit l'achètera à nouveau à l'avenir. Avec cette information supplémentaire dans notre modèle, la fonction objectif à maximiser devient maintenant
ko: 우리는 간단한 마케팅 모델이서 :math:`w_{ij}` 는 :math:`i` 가 무료 제품을 받은 후에 :math:`j` 가 제품을 구입할 확률을 나타낸다. 가중치 :math:`w_{ij}` 는 원칙적으로 개별 :math:`j` 가 하나 이상의 제품을 구매하는 경우에 대응하는 :math:`1` (또는 심지어 음의 수) 보다 클 수 있다. 총 구매 확률을 극대화하는 것은 총 미래 수익을 극대화하는 것과 일치한다. 초기 무료 샘플의 비용보다 이익 확률이 더 클 경우, 전략은 다음과 같은 경우에 편리하게 이용할 수 있다. 이 모델을 확장하여 마케팅 모델에서는 제품의 무료 샘플을 부여받은 사람이 향후 다시 제품을 구입할 가능성을 노드 자체에 가중치로 부여할 수 있다. 이 모델에 추가 정보가 추가되어 있으므로, 최대화할 수 있는 대상은 다음과 같다.
pt_un: Em nosso modelo de marketing simples, :math:`w_{ij}` representa a probabilidade de que a pessoa :math:`j` compre um produto após :math:`i` receber de graça. Note que os pesos :math:`w_{ij}` podem ser em princípio maiores que :math:`1` (ou mesmo negativos), correspondente ao caso em que o indivíduo :math:`j` comprará mais de um produto. Maximizar a probabilidade de compra total corresponde a maximizar o total das receitas futuras. No caso em que a probabilidade de lucro será maior do que o custo das primeiras amostras gratuitas, a estratégia é conveniente. Uma extensão deste modelo tem os próprios nós com pesos, que podem ser considerados, no nosso modelo de marketing, como a probabilidade de uma pessoa concedida com uma amostra gratuita do produto a comprar de novo no futuro. Com essas informações adicionais em nosso modelo, a função objetiva para maximizar se torna
ta_in: எங்கள் எளிய சந்தைப்படுத்தல் மாதிரியில்,:math: `w_ {ij}` நபர் :math: `j` இதற்குப் பிறகு ஒரு பொருளை வாங்குவதற்கான நிகழ்தகவைக் குறிக்கிறது :math:`i` இலவசம் கிடைக்கும். எடைகள்:math: `w_ {ij}` கொள்கையளவில் :math:`1` (அல்லது எதிர்மறை கூட) இதைவிட அதிகமாக இருக்கலாம், இது தனிநபர்:math:` j` ஒன்றுக்கு மேற்பட்ட தயாரிப்புகளை வாங்கும் வழக்கோடு தொடர்புடையது. மொத்த கொள்முதல் நிகழ்தகவை அதிகரிப்பது மொத்த எதிர்கால வருவாயை அதிகரிப்பதை ஒத்துள்ளது. ஆரம்ப இலவச மாதிரிகளின் விலையை விட இலாப நிகழ்தகவு அதிகமாக இருக்கும் விஷயத்தில், மூலோபாயம் ஒரு வசதியானது. இந்த மாதிரியின் நீட்டிப்பானது, எங்களது மார்க்கெட்டிங் மாதிரியில், எடைகளை சுமந்து செல்லும் முனைகளைக் கொண்டுள்ளது, இது ஒரு இலவச மாதிரியுடன் வழங்கப்பட்ட ஒரு நபர் எதிர்காலத்தில் அதை மீண்டும் வாங்குவதற்கான வாய்ப்பாகும். எங்கள் மாதிரியில் இந்த கூடுதல் தகவலுடன், அதிகரிப்பதற்கான புறநிலை செயல்பாடு ஆகிறது
th_th: ในโมเดลการตลาดอย่างง่ายนี้ :math:`w_{ij}` แสดงถึงความน่าจะเป็นที่คนที่ :math:`j` จะซื้อสินค้าเมื่อคนที่ :math:`i` ได้รับของแจกฟรี หมายเหตุ ค่าน้ำหนัก :math:`w_{ij}` สามารถมีค่ามากกว่า :math:`1` ได้ (หรือติดลบก็ได้) ในกรณีที่คนที่ :math:`j` ซื้อสินค้ามากกว่า 1 ชิ้น การทำให้ความน่าจะเป็นในการซื้อสินค้ามากที่สุด ก็จะทำให้ได้กำไรมากที่สุดเช่นกัน ในกรณีที่ความน่าจะเป็นในการได้กำไรนั้นมีมากกว่าค่าใช้จ่ายในการแจกของฟรี กลยุทธ์นี้เป็นกลยุทธ์ที่ง่ายและใช้งานได้ดี โมเดลนี้สามารถเพิ่มเติมอีกส่วนเข้าไปว่า แต่ละ Node นั้นมีน้ำหนักของตัวเองซึ่งมีความหมายว่า คน ๆ นั้นเมื่อได้รับของแจกจากเราไปแล้ว จะมีโอกาศในการกลับมาซื้อของเราใหม่มากแค่ไหน ด้วยข้อมูลเพิ่มเติมนี้เราจะได้ฟังก์ชันวัตถุประสงค์หาค่ามากที่สุดใหม่เป็น

source: In order to find a solution to this problem on a quantum computer, one needs first to map it to an Ising Hamiltonian. This can be done with the assignment :math:`x_i\rightarrow (1-Z_i)/2`, where :math:`Z_i` is the Pauli Z operator that has eigenvalues :math:`\pm 1`. Doing this we find that
bn_bn: কোয়ান্টাম কম্পিউটারে এই সমস্যার সমাধানের জন্য, প্রথমে একটি আইসিং হ্যামিলটনিয়ানকে এটির ম্যাপিং করা উচিত। এটি অ্যাসাইনমেন্ট :math:`x_i\rightarrow (1-Z_i)/2` সহ করা যেতে পারে, যেখানে :math:`Z_i` i হ'ল পাওলি Z অপারেটর যার আইগেনভ্যালু :math:`\pm 1`। এটি করে আমরা এটি খুঁজে পাই
es_un: Para encontrar una solución a este problema en una computadora cuántica, primero es necesario mapearlo a un Hamiltoniano de Ising. Esto se puede hacer con la asignación :math:`x_i\rightarrow (1-Z_i)/2`, donde :math:`Z_i` es el operador Z de Pauli que tiene valores propios :math:`\pm 1`. Haciendo esto encontramos que
fr: Pour trouver une solution à ce problème sur un ordinateur quantique, il faut d'abord l'associer à un hamiltonien de Ising. Ceci peut être fait avec l'affectation :math:`x_i\rightarrow (1-Z_i) /2`, où :math:`Z_i` est l'opérateur de Pauli Z qui a des valeurs propres :math:`\pm 1`. Cela nous permet de constater que
ko: 양자 컴퓨터에서 이 문제에 대한 해결책을 찾기 위해 먼저 이것을 이징 해밀토니안 문제에 매핑한다. 이는 :math:`x_1\rightarrow (1-Z_i) /2` 를 문제에 적용해서 사용하며, 여기서 :math:`Z_i` 는 고유값 :math:`\pm 1` 을 갖는 파울리(Pauli) Z 연산자이다. 이 작업을 수행하면
pt_un: Para encontrar uma solução para este problema num computador quântico, é necessário primeiro mapeá-lo para um Hamiltoniano Ising. Isso pode ser feito com a atribuição :math:`x_i\rightarrow (1-Z_i)/2`, onde :math:`Z_i` é o operador Pauli Z que possui eigenvalues :math:`\pm 1`. Fazendo isso, descobrimos que
ta_in: ஒரு குவாண்டம் கணினியில் இந்த சிக்கலுக்கு தீர்வு காண, முதலில் அதை ஒரு ஐசிங் ஹாமில்டோனியனுடன் வரைபடமாக்க வேண்டும்.:math: `x_i \rightarrow (1-Z_i)/2`, இது:math:` Z_i` என்பது பவுலி இசட் ஆபரேட்டராகும், இது சமமான மதிப்புகளைக் கொண்டுள்ளது :math:`\pm 1`. இதைச் செய்வதன் மூலம் அதைக் காணலாம்
th_th: ในการหาคำตอบของปัญหานี้ด้วยเครื่องควอนตัมคอมพิวเตอร์ เราจำเป็นต้องแปลงปัญหานี้ให้อยู่ในรูป Ising Hamiltonian ซึ่งสามารถทำได้โดยการแทนที่ :math:`x_i\rightarrow (1-Z_i)/2` โดยที่ :math:`Z_i` คือตัวดำเนินการ Pauli Z ที่มีค่า Eigenvalue เป็น :math:`\pm 1` เมื่อแทนที่จะได้ผลลัพธ์เป็น

source: where :math:`\mathrm{const} = \sum_{i<j}w_{ij}/2+\sum_i w_i/2`. In other terms, the weighted Max-Cut problem is equivalent to minimizing the Ising Hamiltonian
bn_bn: যেখানে :math:`\mathrm{const} = \sum_{i<j}w_{ij}/2+\sum_i w_i/2। অন্য কথায়, ওয়েটেড সর্বোচ্চ লাভ সমস্যাটি আইসিং হ্যামিলটনিয়ানকে হ্রাস করার সমতুল্য
es_un: donde :math:`\mathrm{const} = \sum_{i<j}w_{ij}/2+\sum_i w_i/2`. En otros términos, el problema de Max-Cut ponderado es equivalente a minimizar el Hamiltoniano de Ising
fr: où :math:`\mathrm{const} = \sum_{i<j} w_{ij}/2 + \sum_i w_i/2`. En d'autres termes, le problème Max-Cut pondéré est équivalent à la minimisation de l'Hamiltonien Ising
ko: :math:`\mathrm{const} = \sum_{i<j}w_{ij}/2+\sum_i w_i/2` 이다. 다른 말로 하면 가중치 있는 최대 컷 문제는 Ising Hamiltonian을 최소화하는 것과 같다.
pt_un: onde, :math:`\mathrm{const} = \sum_{i<j}w_{ij}/2+\sum_i w_i/2`. Em outras palavras, o problema ponderado de Max-Cut equivale a minimizar o Hamiltoniano de Ising
ta_in: எங்கே:math:`\mathrm{const} = \ sum_{i <j}w_ {ij}/2+\sum_i w_i/2`. வேறு வார்த்தைகளில் கூறுவதானால், எடையுள்ள மேக்ஸ்-கட் சிக்கல் ஐசிங் ஹாமில்டோனியனைக் குறைப்பதற்கு சமம்
th_th: โดยที่ :math:`\mathrm{const} = \sum_{i<j}w_{ij}/2+\sum_i w_i/2` ในอีกแง่หนึ่งโจทย์ปัญหา Weighted Max-Cut คือการหาค่าต่ำสุดของ Ising Hamiltonian นี้

source: Qiskit’s optimization module can generate the Ising Hamiltonian for the first profit function :math:`\tilde{C}`. To this extent, function :math:`\tilde{C}` can be modeled as a ``QuadraticProgram``, which provides the ``to_ising()`` method.
bn_bn: Qiskit অপ্টিমাইজেশন মডিউলটি প্রথম লাভ ফাংশন :math:`\tilde{C}`-র জন্য আইসিং হ্যামিলটোনিয়ান তৈরি করতে পারে। এই পরিমাণে, ফাংশন :math:`\tilde{C}` একটি ``QuadraticProgram`` হিসাবে মডেল করা হবে, যা ``to_ising ()`` পদ্ধতি সরবরাহ করে।
es_un: El módulo de optimización de Qiskit puede generar el Hamiltoniano de Ising para la primera función de ganancias :math:`\tilde{C}`. En este sentido, la función :math:`\tilde{C}` se puede modelar como un ``QuadraticProgram``, que proporciona el método ``to_ising()``.
fr: Le module d'optimisation de Qiskit peut générer l'hamiltonien Ising pour la première fonction de résultat :math:`\tilde{C}`. Pour cela, la fonction :math:`\tilde{C}` peut être modélisée comme un ``QuadraticProgram``, qui fournit la méthode ``to_ising ()``.
ko: Qiskit의 최적화 모듈은 첫 번째 수익 함수인 :math:`\tilde{C}` 에 대해 이징모델의 Hamiltonian을 생성할 수 있다. 이것을 위해서 :math:`\tilde{C}` 는 ``QuadraticProgram`` 의 ``to_ising()`` 라이브러리를 사용해서 모델링 할 수 있습니다.
pt_un: O módulo de otimização do Qiskit pode gerar o Hamiltoniano de Ising para a primeira função de lucro :math:`\tilde{C}`. Neste sentido, a função :math:`\tilde{C}` pode ser modelada como um ``QuadraticProgram``, que fornece o método ``to_ising()``.
ta_in: Qiskit டின் தேர்வுமுறை தொகுதி முதல் இலாபச் செயல்பாட்டிற்காக ஐசிங் ஹாமில்டோனியனை உருவாக்க முடியும்:math:`\tilde{C}`. இந்த அளவிற்கு, செயல்பாடு:math:`\tilde{C}` ஐ ``QuadraticProgram`` என வடிவமைக்க முடியும், இது ``to_ising ()``முறையை வழங்குகிறது.
th_th: โมดูล Qiskit Optimization สามารถช่วยสร้าง Ising Hamiltonian สำหรับสมการแรก :math:`\tilde{C}` ได้ โดยถ้าเราต้องการเพิ่มเติมฟังก์ชัน :math:`\tilde{C}` เราสามารถทำได้โดยการโมเดลลักษณะ ``QuadraticProgram`` ก่อน และใช้ Method ``to_ising()`` เพื่อแปลงเป็น Ising Hamiltonian

source: Approximate Universal Quantum Computing for Optimization Problems
bn_bn: অপ্টিমাইজেশন সমস্যার জন্য আনুমানিক ইউনিভার্সাল কোয়ান্টাম কম্পিউটিং
es_un: Computación Cuántica Universal Aproximada para Problemas de Optimización
fr: Calcul Quantique Universel Approximatif pour les Problèmes d'Optimization
ko: 최적화 문제를 위한 근사적인 범용 양자 컴퓨팅
pt_un: Computação Quântica Universal Aproximada para Problemas de Otimização
ta_in: மிகையாக்கல் சிக்கல்களுக்கான தோராயமான யுனிவர்சல் குவாண்டம் கம்ப்யூட்டிங்
th_th: Approximate Universal Quantum Computing สำหรับโจทย์ปัญหา Optimization

source: There has been a considerable amount of interest in recent times about the use of quantum computers to find a solution to combinatorial optimization problems. It is important to say that, given the classical nature of combinatorial problems, exponential speedup in using quantum computers compared to the best classical algorithms is not guaranteed. However, due to the nature and importance of the target problems, it is worth investigating heuristic approaches on a quantum computer that could indeed speed up some problem instances. Here we demonstrate an approach that is based on the *Quantum Approximate Optimization Algorithm* (QAOA) by Farhi, Goldstone, and Gutmann (2014). We frame the algorithm in the context of *approximate quantum computing*, given its heuristic nature.
bn_bn: সমাবেশীয় অনুকূলায়ন (অপ্টিমাইজেশন) সমস্যাসমূহর সমাধানের জন্য কোয়ান্টাম কম্পিউটার ব্যবহার সম্পর্কে সাম্প্রতিক সময়ে যথেষ্ট পরিমাণে আগ্রহ তৈরি হয়েছে। বলা বাহুল্য যে, সমাবেশ সমস্যাগুলির প্রথাগত (ক্লাসিক্যাল) প্রকৃতির পরিপ্রেক্ষিতে, সর্বোত্তম প্রথাগত (ক্লাসিক্যাল) অ্যালগরিদমের তুলনায় কোয়ান্টাম কম্পিউটার ব্যবহারে সূচকীয় গতির গ্যারান্টি নেই। যাইহোক, লক্ষ্য (টার্গেট) সমস্যার প্রকৃতি এবং গুরুত্বের কারণে, এটি কোয়ান্টাম কম্পিউটারে হিউরিস্টিক পন্থাগুলি তদন্তের জন্য মূল্যবান যা প্রকৃতপক্ষে কিছু সমস্যাগুলির উদাহরণগুলিকে গতিতে পারে। এখানে আমরা এমন একটি পদ্ধতির প্রদর্শন করি যা ফারহি, গোল্ডস্টোন এবং গুটম্যান (২০১৪) দ্বারা *কোয়ান্টাম আনুমানিক অপ্টিমাইজেশন অ্যালগরিদম* (কিউ.এ.ও.এ.) এর উপর ভিত্তি করে। আমরা আলগরিদমকে *আনুমানিক কোয়ান্টাম কম্পিউটিং* এর প্রাসঙ্গিক আকারে এর ফ্রেমযুক্ত প্রকৃতির উপর ভিত্তি করে ফ্রেম করি।
es_un: Ha habido un interés considerable en los últimos tiempos sobre el uso de computadoras cuánticas para encontrar una solución a los problemas de optimización combinatoria. Es importante decir que, dada la naturaleza clásica de los problemas combinatorios, no se garantiza una aceleración exponencial en el uso de computadoras cuánticas en comparación con los mejores algoritmos clásicos. Sin embargo, debido a la naturaleza y la importancia de los problemas objetivo, vale la pena investigar enfoques heurísticos en una computadora cuántica que de hecho podrían acelerar algunos ejemplos de problemas. Aquí demostramos un enfoque que se basa en el *Algoritmo Cuántico de Optimización Aproximada* (Quantum Approximate Optimization Algorithm, QAOA) de Farhi, Goldstone, y Gutmann (2014). Enmarcamos el algoritmo en el contexto de *computación cuántica aproximada*, dada su naturaleza heurística.
fr: Ces derniers temps, on s'est beaucoup intéressé à l'utilisation des ordinateurs quantiques pour trouver une solution aux problèmes d'optimisation combinatoire. Il est important de dire que, compte tenu de la nature classique des problèmes combinatoires, l'accélération exponentielle de l'utilisation des ordinateurs quantiques par rapport aux meilleurs algorithmes classiques n'est pas garantie. Cependant, en raison de la nature et de l'importance des problèmes ciblés, il est utile d'étudier des approches heuristiques sur un ordinateur quantique qui pourraient effectivement accélérer certaines instances de problèmes. Nous démontrons ici une approche basée sur l'algorithme QAOA (*Quantum Approximate Optimization Algorithm *) de Farhi, Goldstone et Gutman (2014). Nous utilisons l'algorithme dans le contexte de *l'informatique quantique approximative*, étant donné sa nature heuristique.
ko: 근래에는 조합 최적화 문제에 대한 해결책을 찾기 위해 양자 컴퓨터를 사용하는 것에 대해 상당한 관심이 있었다. 조합문제의 고전적 성격을 감안할 때, 최고의 고전 알고리즘에 비해 양자 컴퓨터를 사용하는 데 있어서 기하급수적인 속도 향상은 보장되지 않는다고 말할 필요가 있다. 그러나, 목표 문제의 본질과 중요성 때문에, 실제로 일부 문제 발생을 가속화할 수 있는 양자 컴퓨터에서의 경험적 접근법을 조사할 필요가 있다. 여기서는 Farhi, Goldstone 및 Gutman(2014년) 의 *Quantum Approximate Optimization Algorithm* (QAOA) 에 기반한 접근방식을 설명한다. 알고리즘의 경험적 특성을 감안할 때 *근사 양자 컴퓨팅* 의 맥락에서 알고리즘을 구성한다.
pt_un: Nos últimos tempos, tem ocorrido um interesse considerável pela utilização de computadores quânticos, com a finalidade de encontrar uma solução para problemas de otimização combinatória. É importante dizer que, dada a natureza clássica dos problemas de combinação, a aceleração exponencial no uso de computadores quânticos em comparação com os melhores algoritmos clássicos não é garantida. No entanto, devido à natureza e à importância dos problemas, vale a pena investigar abordagens heurísticas num computador quântico que podem, de fato, acelerar algumas instâncias do problema. Aqui, demonstramos uma abordagem que é baseada no *Algoritmo de Otimização de Aproximação Quântica* (QAOA) por Farhi, Goldstone, and Gutman (2014). Nós adaptamos o algoritmo no contexto de *cálculo quântico aproximado*, dado sua natureza heurística.
ta_in: ஒருங்கிணைந்த தேர்வுமுறை சிக்கல்களுக்கு ஒரு தீர்வைக் காண குவாண்டம் கணினிகளைப் பயன்படுத்துவது குறித்து சமீபத்திய காலங்களில் கணிசமான அளவு ஆர்வம் உள்ளது. ஒருங்கிணைந்த சிக்கல்களின் கிளாசிக்கல் தன்மையைக் கருத்தில் கொண்டு, சிறந்த கிளாசிக்கல் வழிமுறைகளுடன் ஒப்பிடும்போது குவாண்டம் கணினிகளைப் பயன்படுத்துவதில் அதிவேக வேகம் உறுதி செய்யப்படவில்லை என்று சொல்வது முக்கியம். இருப்பினும், இலக்கு சிக்கல்களின் தன்மை மற்றும் முக்கியத்துவம் காரணமாக, ஒரு குவாண்டம் கணினியில் ஹூரிஸ்டிக் அணுகுமுறைகளை ஆராய்வது மதிப்புக்குரியது, இது உண்மையில் சில சிக்கல் நிகழ்வுகளை துரிதப்படுத்தக்கூடும். ஃபர்ஹி, கோல்ட்ஸ்டோன் மற்றும் குட்மேன் (2014) எழுதிய *Quantum Approximate Optimization Algorithm* (QAOA) அடிப்படையிலான ஒரு அணுகுமுறையை இங்கே நாங்கள் நிரூபிக்கிறோம். அல்காரிதத்தை அதன் தோராயமான தன்மையைக் கருத்தில் கொண்டு,*approximate quantum computing* பின்னணியில் வடிவமைக்கிறோம்.
th_th: ในช่วงที่ผ่านมามีความสนใจอย่างมากเกี่ยวกับการนำควอนตัมคอมพิวเตอร์มาใช้ในการแก้ปัญหา Combinatorial Optimization ซึ่งมันจำเป็นที่จะต้องบอกไว้ก่อนว่า ด้วยธรรมชาติลักษณะของโจทย์ Combinatorial Optimization เราไม่สามารถบอกได้อย่างชัดเจนว่าควอนตัมคอมพิวเตอร์จะสามารถช่วยให้มีความเร็วในการหาคำตอบได้มากขึ้น อย่างไรก็ตามเนื่องจากปัญหานี้เป็นปัญหาที่สำคัญดังนั้นมันจึงคุ้มค่าในการทดลองว่าวิธีการแบบ Heuristic ด้วยเครื่องควอนตัมคอมพิวเตอร์นั้นจะสามารถช่วยเร่งความเร็วในการหาคำตอบได้หรือไม่ ในส่วนนี้เราได้มีการสาธิตวิธีการหาคำตอบด้วย *Quantum Approximate Optimization Algorithm* (QAOA) โดย Farhi, Goldstone และ Gutmann (2014) เราตีกรอบอัลกอริทึมนี้ในแง่ของ *Approximate Quantum Computing* ซึ่งเป็นลักษณะอัลกอริทึมแบบ Heuristic

source: The algorithm works as follows:
bn_bn: অ্যালগরিদম টি নিম্নলিখিত উপায়ে কাজ করে :
es_un: El algoritmo funciona de la siguiente manera:
fr: L'algorithme fonctionne comme suit:
ko: 알고리즘은 다음과 같이 작동한다:
pt_un: O algoritmo funciona da seguinte maneira:
ta_in: வழிமுறை பின்வருமாறு செயல்படுகிறது:
th_th: อัลกอริทึมมีการทำงานดังนี้:

source: Choose the :math:`w_i` and :math:`w_{ij}` in the target Ising problem. In principle, even higher powers of Z are allowed.
bn_bn: টার্গেট আইসিং সমস্যা: :math:`w_i` এবং :math:`w_{ij}` চয়ন করুন। নীতিগতভাবে, Z-র উচ্চতর ক্ষমতাগুলিও অনুমোদিত।
es_un: Elegir :math:`w_i` y :math:`w_{ij}` en el problema de Ising objetivo. En principio, se permiten potencias de Z aún mayores.
fr: Choisissez les :math:` w_i ` et :math:` w_{ij}` dans le problème Ising cible. En principe, même des puissances plus élevées de Z sont autorisées.
ko: 대상 Ising 문제에서 :math:`w_i` 와 :math:`w_{ij}` 를 선택한다. 원칙적으로, Z의 더 높은 거듭제곱이 허용된다.
pt_un: Escolha o :math:`w_i` e :math:`w_{ij}` no problema de Ising alvo. Em princípio, potências ainda maiores de Z são permitidas.
ta_in: இலக்கு ஐசிங் சிக்கலில்:math: `w_i` மற்றும்:math:` w_ {ij} `ஐத் தேர்வுசெய்க. கொள்கையளவில், Z இன் உயர் சக்திகள் கூட அனுமதிக்கப்படுகின்றன.
th_th: เลือก :math:`w_i` และ :math:`w_{ij}` ของโจทย์ปัญหา Ising ที่ต้องการ ตามหลักการแล้ว เราสามารถเลือกได้ แม้แต่ Z ยกกำลังอันดับสูง

source: Choose the depth of the quantum circuit :math:`m`. Note that the depth can be modified adaptively.
bn_bn: কোয়ান্টাম সার্কিট :math:`m -র গভীরতা চয়ন করুন। টীকা: গভীরতাটি অভিযোজিতভাবে সংশোধন করা যেতে পারে।.
es_un: Elegir la profundidad del circuito cuántico :math:`m`. Se debe tener en cuenta que la profundidad se puede modificar de forma adaptativa.
fr: Choisissez la profondeur du circuit quantique :math:` m `. Notez que la profondeur peut être modifiée de façon adaptative.
ko: 양자회로 :math:`m` 의 깊이(depth)를 선택하라. 깊이는 조정될 수 있다.
pt_un: Escolha a profundidade do circuito quântico :math:`m`. Observe que a profundidade pode ser modificada adaptativamente.
ta_in: குவாண்டம் சுற்றுகளின் ஆழத்தைத் தேர்வுசெய்க:math: `m`. ஆழத்தை தகவமைப்புக்கு மாற்றியமைக்க முடியும் என்பதை நினைவில் கொள்க.
th_th: เลือกความลึกของวงจรควอนตัม :math:`m` หมายเหตุ ความลึกสามารถปรับได้ในภายหลัง

source: Choose a set of controls :math:`\theta` and make a trial function :math:`|\psi(\boldsymbol\theta)\rangle`, built using a quantum circuit made of C-Phase gates and single-qubit Y rotations, parameterized by the components of :math:`\boldsymbol\theta`.
bn_bn: কনট্রোল :math:`\theta` এর একটি সেট চয়ন করুন এবং সি-ফেজ ( C-Phase ) গেটস এবং একক কিউবিট ওয়াই (Y) রোটেশনগুলির তৈরি কোয়ান্টাম সার্কিট ব্যবহার করে তৈরি করে ট্রায়াল ফাংশন :math:`|\psi(\boldsymbol\theta)\rangle` করুন, যা :math:`\boldsymbol\theta` এর উপাদানগুলি দ্বারা প্যারামিটারাইজড |
es_un: Elegir un conjunto de controles :math:`\theta` y hacer una función de prueba :math:`|\psi(\boldsymbol\theta)\rangle`, construida utilizando un circuito cuántico hecho de compuertas C-Phase y rotaciones Y de un solo qubit, parametrizada por los componentes de :math:`\boldsymbol\theta`.
fr: Choisissez un ensemble de contrôles :math:`\theta` et créez une fonction d'essai :math:`|\psi(\boldsymbol\theta)\rangle`, construite à l'aide d'un circuit quantique fait de portes C-Phase et de rotations en Y mono-qubits qui sont paramétrées par les composantes de :math:`\boldsymbol\theta`.
ko: 컨트롤 :math:`\theta` 를 선택하고, :math:`\boldsymbol\theta` 의 성분들에 의해 파라미터화된, C-위상 게이트로 만들어진 양자 회로와 단일 큐비트 Y 회전으로 만들어진 양자 회로를 사용하여 시험 기능 :math:`|\psi(\boldsymbol\theta)\rangle` 을 작성한다.
pt_un: Escolha um conjunto de controles :math:`\theta` e faça uma função de teste :math:`|\psi(\boldsymbol\theta)\rangle`, construída usando um circuito quântico feito de portas C-Fase e rotações Y de um único qubit, parametrizadas pelos componentes de :math:`\boldsymbol\theta`.
ta_in: கட்டுப்பாடுகளின் தொகுப்பைத் தேர்வுசெய்க:math:`\theta` மற்றும் ஒரு சோதனைச் செயல்பாட்டைச் செய்யுங்கள்:math:`|\psi(\boldsymbol\theta)\rangle`, இது சி-கட்ட கேட்கள் மற்றும் ஒற்றை-க்யூபிட் Y ஆகியவற்றால் செய்யப்பட்டகுவாண்டம் சுற்று பயன்படுத்தி கட்டப்பட்டது சுழற்சிகள், இதன் :math:`\boldsymbol\theta` கூறுகளால் அளவுருவாக்கப்படுகின்றன.
th_th: เลือกตัวควบคุม :math:`\theta` ขึ้นมาเซตหนึ่งและสร้างฟังก์ชันทดสอบ :math:`|\psi(\boldsymbol\theta)\rangle` โดยสร้างขึ้นด้วยวงจรควอนตัมที่ภายในประกอบไปด้วยควอนตัมเกต C-Phase และ Single-Qubit Y Rotations โดยมีส่วนที่เป็นพารามิเตอร์คือส่วน :math:`\boldsymbol\theta`

source: Evaluate
bn_bn: মূল্যায়ন
es_un: Evaluar
fr: Evaluer
ko: 평가
pt_un: Avalie
ta_in: மதிப்பீடு செய்யுங்கள்
th_th: ประเมินผล
