Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/06_examples_max_cut_and_tsp.po
Languages: bn_bn, es_un, fr, ko, pt_un, ta_in, th_th

source: where :math:`A` is a free parameter. One needs to ensure that :math:`A` is large enough so that these constraints are respected. One way to do this is to choose :math:`A` such that :math:`A > \mathrm{max}(w_{ij})`.
bn_bn: যেখানে :math:`A` একটি নিখরচায় প্যারামিটার। একজনকে নিশ্চিত করতে হবে যে :math:`A` যথেষ্ট বড় যাতে এই প্রতিবন্ধকতাগুলি সম্মানিত হয়। এটি করার একটি উপায় হ'ল :math:`A`কে এমন চয়ন করা যাতে :math:`A > \mathrm{max}(w_{ij})` ।
es_un: donde :math:`A` es un parámetro libre. Es necesario asegurarse de que :math:`A` sea lo suficientemente grande como para que se respeten estas restricciones. Una forma de hacer esto es elegir :math:`A` tal que :math:`A > \mathrm{max}(w_{ij})`.
fr: où :math:`A` est un paramètre libre. Il faut s'assurer que le :math:`A` est suffisamment grand pour que ces contraintes soient respectées. Une façon de le faire est de choisir :math:`A` tel que :math:`A > \mathrm{max}(w_{ij})`.
ko: 여기서 :math:`A` 는 자유 변수이다. 이러한 구속 조건이 만족 될 수 있도록 :math:`A` 가 충분히 커야한다.조건을 만족하는 한 가지 방법은 :math:`A > \mathrm{max}(w_{ij})` 와 같은 :math:`A` 를 선택하는 것이다.
pt_un: onde :math:`A` é um parâmetro livre. Um precisa garantir que :math:`A` seja grande o suficiente para que essas restrições sejam respeitadas. Uma maneira de fazer isso é escolher :math:`A` tal que :math:`A > \mathrm{max}(w_{ij})`.
ta_in: எங்கே:math: `A` ஒரு இலவச அளவுரு. ஒருவர் இதை உறுதிப்படுத்த வேண்டும்:math: `A` போதுமானதாக இருப்பதால் இந்த தடைகள் மதிக்கப்படுகின்றன. இதைச் செய்வதற்கான ஒரு வழி:math: `A` அதாவது:math:` A> \ mathrm {max} (w_ {ij}) `.
th_th: โดยที่ :math:`A` เป็นตัวแปรที่ปรับค่าได้ แต่เราจะต้องทำให้มั่นใจว่า :math:`A` มีค่ามากเพียงพอจะทำให้ข้อจำกัดมีผล อีกทางเลือกหนึ่งคือทำการเลือก :math:`A` ที่ทำให้ :math:`A > \mathrm{max}(w_{ij})`

source: Once again, it is easy to map the problem in this form to a quantum computer, and the solution will be found by minimizing a Ising Hamiltonian.
bn_bn: আবারও, এই আকারে সমস্যাটি একটি কোয়ান্টাম কম্পিউটারে ম্যাপ করা সহজ, এবং একটি আইসিং হ্যামিলটনিয়ানকে হ্রাস করে সমাধানটি পাওয়া যাবে।
es_un: Una vez más, es fácil mapear el problema de esta forma a una computadora cuántica, y la solución se encontrará minimizando un Hamiltoniano de Ising.
fr: Encore une fois, il est facile de relier le problème sous cette forme à un ordinateur quantique, et la solution sera trouvée en minimisant un hamiltonien d'Ising.
ko: 다시 한 번 이 형태의 문제를 양자 컴퓨터에 매핑하는 것은 쉬우며, 해밀톤안을 최소화하여 솔루션을 찾을 수 있다.
pt_un: Mais uma vez, é fácil mapear o problema desta forma para um computador quântico, e a solução será encontrada minimizando um Hamiltoniano Ising.
ta_in: மீண்டும், இந்த வடிவத்தில் சிக்கலை ஒரு குவாண்டம் கணினியில் வரைபடமாக்குவது எளிதானது, மேலும் ஒரு ஐசிங் ஹாமில்டோனியனைக் குறைப்பதன் மூலம் தீர்வு காணப்படும்.
th_th: ย้ำอีกครั้งหนึ่งว่า มันเป็นการง่ายที่จะแปลงโจทย์ปัญหาในรูปแบบนี้ไปทำงานบนเครื่องควอนตัมคอมพิวเตอร์ และคำตอบสามารถหาได้โดยการหาค่าต่ำสุดของ Ising Hamiltonian
