Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/06_examples_max_cut_and_tsp.po
Languages: bn_bn, es_un, fr, ko, pt_un, ta_in, th_th

source: by sampling the outcome of the circuit in the Z-basis and adding the expectation values of the individual Ising terms together. In general, different control points around :math:`\boldsymbol\theta` have to be estimated, depending on the classical optimizer chosen.
bn_bn: জেড-বেসিস সার্কিটের ফলাফল নমুনা করে এবং পৃথক আইসিং পদগুলির প্রত্যাশা মানগুলি একসাথে যুক্ত করে। সাধারণভাবে, নির্বাচিত প্রথাগত (ক্লাসিক্যাল) অনুকূলায়ক এর উপর নির্ভর করে, :math:`\boldsymbol\theta এর চারপাশের বিভিন্ন নিয়ন্ত্রণ পয়েন্টগুলি অনুমান করতে হবে।
es_un: muestreando el resultado del circuito en la base Z y sumando los valores esperados de los términos Ising individuales. En general, se deben estimar diferentes puntos de control alrededor de :math:`\boldsymbol\theta`, dependiendo del optimizador clásico elegido.
fr: en échantillonnant le résultat du circuit dans la base de calcul Z et en sommant les valeurs d'espérance des termes Ising individuels. En général, différents points de contrôle autour de :math:`\boldsymbol\theta` doivent être estimés, en fonction de l'optimiseur classique choisi.
ko: 및 상기 Z 기반으로 상기 회로의 결과를 샘플링하고 상기 개별적인 이징 용어들의 상기 예상 값들을 함께 합산함으로써, 상기 개별적인 Ising 용어들의 상기 기대 값들을 합산하는 단계 일반적으로, 선택된 고전적 옵티마이저에 따라 :math:`\boldsymbol\theta` 의 다른 제어 지점을 추정해야 한다.
pt_un: amostrando o resultado do circuito na base Z e adicionando os valores esperados dos termos de Ising individuais. Em geral, diferentes pontos de controle em torno de :math:`\boldsymbol\theta` têm que ser estimados, dependendo do otimizador clássico escolhido.
ta_in: z- அடிப்படையில் சுற்றுகளின் முடிவை மாதிரிப்படுத்துவதன் மூலமும், தனிப்பட்ட ஐசிங் சொற்களின் எதிர்பார்ப்பு மதிப்புகளை ஒன்றாகச் சேர்ப்பதன் மூலமும். பொதுவாக, வெவ்வேறு கட்டுப்பாட்டு புள்ளிகள்:math: `\boldsymbol\theta` மதிப்பிடப்பட வேண்டும், இது தேர்ந்தெடுக்கப்பட்ட கிளாசிக்கல் ஆப்டிமைசரைப் பொறுத்து.
th_th: ด้วยการสุ่มตัวอย่างจากผลลัพธ์ขของวงจรด้วย Z-basis และนำค่าความคาดหวังของแต่ละพจน์ของโมเดล Ising มารวมกัน โดยทั่วไปแล้วเราจะต้องประมาณค่าผลลัพธ์ของจุดควบคุมรอบ ๆ :math:`\boldsymbol\theta` ด้วย ขึ้นอยู่กับ Optimizer แบบดั้งเดิมที่ใช้

source: Use a classical optimizer to choose a new set of controls.
bn_bn: নতুন সেট নিয়ন্ত্রণ চয়ন করতে একটি প্রথাগত (ক্লাসিক্যাল) অনুকূলায়ক বা অপ্টিমাইজার ব্যবহার করুন।.
es_un: Utilizar un optimizador clásico para elegir un nuevo conjunto de controles.
fr: Utiliser un optimiseur classique pour choisir un nouvel ensemble de contrôles.
ko: 고전적 optimizer를 사용하여 새 제어 세트를 선택한다.
pt_un: Use um otimizador clássico para escolher um novo conjunto de controles.
ta_in: புதிய கட்டுப்பாடுகளின் தொகுப்பைத் தேர்வுசெய்ய கிளாசிக்கல் ஆப்டிமைசரைப் பயன்படுத்தவும்.
th_th: ใช้ Optimizer แบบดั้งเดิมเพื่อเลือกเซตของตัวควบคุมใหม่

source: Continue until :math:`C(\boldsymbol\theta)` reaches a minimum, close enough to the solution :math:`\boldsymbol\theta^*`.
bn_bn: যতক্ষণ না :math:`C(\boldsymbol\theta)` ন্যূনতমে পৌঁছে যায়, যা কিনা :math:`\boldsymbol\theta^*` সমাধানের জন্য খুব কাছাকাছি, ততক্ষন চালিয়ে যান।
es_un: Continuar hasta que :math:`C(\boldsymbol\theta)` alcance un mínimo, lo suficientemente cercano a la solución :math:`\boldsymbol\theta^*`.
fr: Continuer jusqu'à ce que :math:`C(\boldsymbol\theta)` atteigne un minimum, assez proche de la solution :math:`\boldsymbol\theta^*`.
ko: :math:`C(\boldsymbol\theta)` 가 솔루션 :math:`\boldsymbol\theta^*` 에 충분히 가까워질때까지 계속한다.
pt_un: Continue até :math:`C(\boldsymbol\theta)` atingir um mínimo, próximo o suficiente da solução :math:`\boldsymbol\theta^*`.
ta_in: :math: `C(\boldsymbol\theta)` குறைந்தபட்சத்தை அடையும் வரை தொடரவும், :math:`\boldsymbol\theta^ *` தீர்வுக்கு போதுமானதாக இருக்கிறது.
th_th: ทำงานซ้ำไปเรื่อย ๆ จนกว่า :math:`C(\boldsymbol\theta)` จะมีค่าเข้าสู่ค่าน้อยที่สุดใกล้เคียงกับคำตอบ :math:`\boldsymbol\theta^*`

source: Use the last :math:`\boldsymbol\theta` to generate a final set of samples from the distribution :math:`|\langle z_i~|\psi(\boldsymbol\theta)\rangle|^2\;\forall i` to obtain the answer.
bn_bn: শেষ :math:`\boldsymbol\theta` ব্যবহার করুন :math:`\Big|\langle z_i\big|\psi(\boldsymbol\theta)\rangle\Big|^2\;\forall i` বণ্টন থেকে অন্তিম নমুনা (স্যাম্পল) সমূহ উৎপন্ন করে উত্তর পাওয়ার জন্যে।
es_un: Utilizar la última :math:`\boldsymbol\theta` para generar un conjunto final de muestras de la distribución :math:`|\langle z_i~|\psi(\boldsymbol\theta)\rangle|^2\;\forall i` para obtener la respuesta.
fr: Utilisez le dernier :math:`\boldsymbol\theta` pour générer un ensemble final d'échantillons de la distribution :math:`|\langle z_i ~ | \psi (\boldsymbol\theta)\rangle | ^ 2 \ ; \forall i` pour obtenir la réponse.
ko: 마지막 :math:`\boldsymbol\theta` 를 사용하여 분포 :math:`|\langle z_i~|\psi(\boldsymbol\theta)\rangle|^2\;\forall i` 에서 샘플의 최종 세트를 생성하여 응답을 얻을 수 있다.
pt_un: Use o último :math:`\boldsymbol\theta` para gerar um conjunto final de amostras da distribuição :math:`|\langle z_i~|\psi(\boldsymbol\theta)\rangle|^2\;\forall i` para obter a resposta.
ta_in: :math:`| \langle z_i ~ | \ psi (\boldsymbol\theta)\rangle|^2 \;\ forall i`பதிலைப் பெற விநியோகத்திலிருந்து இறுதி மாதிரிகளை உருவாக்க கடைசி:math: `\boldsymbol \theta` ஐப் பயன்படுத்தவும்.
th_th: ใช้ :math:`\boldsymbol\theta` สุดท้ายที่ได้ เพื่อสร้างเซตของผลลัพธ์สุ่มสุดท้ายจากการกระจายตัวของความน่าจะเป็น :math:`|\langle z_i~|\psi(\boldsymbol\theta)\rangle|^2\;\forall i` เพื่อให้ได้คำตอบออกมา

source: It is our belief the difficulty of finding good heuristic algorithms will come down to the choice of an appropriate trial wavefunction. For example, one could consider a trial function whose entanglement best aligns with the target problem, or simply make the amount of entanglement a variable. In this tutorial, we will consider a simple trial function of the form
bn_bn: এটি আমাদের বিশ্বাস যে ভাল হিউরিস্টিক অ্যালগরিদমগুলি খুঁজে পেতে অসুবিধাটি একটি উপযুক্ত ট্রায়াল ওয়েভ ফাংশন পছন্দে একীভূত হবে। উদাহরণস্বরূপ, কেউ একটি ট্রায়াল ফাংশন বিবেচনা করতে পারে যার এনট্যাঙ্গেলমেন্ট, লক্ষ্য সমস্যাটির সাথে সর্বোত্তমভাবে প্রান্তিক হয় বা কেবল এনট্যাঙ্গেলমেন্ট হওয়ার পরিমাণকে পরিবর্তনশীল করে তোলে। এই টিউটোরিয়ালে, আমরা ফর্মটির একটি সাধারণ ট্রায়াল ফাংশন বিবেচনা করব
es_un: Creemos que la dificultad de encontrar buenos algoritmos heurísticos se reducirá a la elección de una función de onda de prueba adecuada. Por ejemplo, se podría considerar una función de prueba cuyo entrelazamiento se alinee mejor con el problema objetivo, o simplemente hacer que la cantidad de entrelazamiento sea una variable. En este tutorial, consideraremos una función de prueba simple de la forma
fr: Nous croyons que la difficulté de trouver de bons algorithmes heuristiques se résumera au choix d'une fonction d'onde d'essai appropriée. Par exemple, on pourrait envisager une fonction d'essai dont le caractère d'intrication s'aligne le mieux sur le problème cible, ou simplement faire le montant de l'intrication d'une variable. Dans ce tutoriel, nous considérerons une fonction d'essai simple du formulaire
ko: 좋은 경험적 알고리즘을 발견하는 것이 적절한 시험 파장기능의 선택에 이르게 될 것이라는 것은 우리의 생각이다. 예를 들어, 얽힘이 해결하려는 문제와 가장 일치하는 시험 파동함수을 고려할 수 있거나, 또는 간단하게 얽힘의 양을 변수로 삼을수도 있다. 본 자습서에서는 다음과 같은 형식의 간단한 시험 함수
pt_un: Acreditamos que a dificuldade de encontrar bons algoritmos heurísticos reduzirá à escolha de uma função experimental apropriada. Por exemplo, poderia considerar-se uma função de tentativa cujo enredo melhor se alinhasse com o problema alvo, ou simplesmente tornar a quantidade de entrelaçamento uma variável. Neste tutorial, vamos considerar uma função experimental simples da forma
ta_in: நல்ல ஹியூரிஸ்டிக் வழிமுறைகளைக் கண்டுபிடிப்பதில் உள்ள சிரமம் பொருத்தமான சோதனை அலைவடிவத்தைத் தேர்ந்தெடுப்பதற்கு வரும் என்பது எங்கள் நம்பிக்கை. எடுத்துக்காட்டாக, ஒரு சோதனைச் செயல்பாட்டை ஒருவர் கருத்தில் கொள்ளலாம், அதன் சிக்கலானது இலக்கு சிக்கலுடன் சிறப்பாக ஒத்துப்போகிறது, அல்லது சிக்கலின் அளவை ஒரு மாறியாக மாற்றலாம். இந்த டுடோரியலில், படிவத்தின் எளிய சோதனை செயல்பாட்டை நாங்கள் கருத்தில் கொள்வோம்
th_th: เรามีความเชื่อที่ว่าความยากในการหาคำตอบที่ดีของอัลกอริทึมแบบ Heuristic นั้นขึ้นอยู่กับจากการเลือกฟังก์ชันคลื่นทดสอบที่เหมาะสม ตัวอย่างเช่น ในกรณี่ที่เราเลือกฟังก์ชันทดสอบที่มี Entanglement ที่อยู่ในแนวเดียวกับปัญหาของเรา หรือสามารถทำให้เกิด Entanglement ในปริมาณที่เหมาะสมได้ ในบทเรียนนี้เราใช้ฟังก์ชันทดสอบอย่างง่ายที่อยู่ในรูปแบบดังนี้

source: |\psi(\theta)\rangle = [U_\mathrm{single}(\boldsymbol\theta) U_\mathrm{entangler}]^m |+\rangle
es_un: |\psi(\theta)\rangle = [U_\mathrm{simple}(\boldsymbol\theta) U_\mathrm{entrelazador}]^m |+\rangle

source: where :math:`U_\mathrm{entangler}` is a collection of C-Phase gates (fully entangling gates), and :math:`U_\mathrm{single}(\theta) = \prod_{i=1}^n Y(\theta_{i})`, where :math:`n` is the number of qubits and :math:`m` is the depth of the quantum circuit. The motivation for this choice is that for these classical problems this choice allows us to search over the space of quantum states that have only real coefficients, still exploiting the entanglement to potentially converge faster to the solution.
bn_bn: যেখানে :math:`U_\mathrm{entangler}` হল সি-ফেজ গেটস (সম্পূর্ণরূপে এনট্যাঙ্গেল বা পরিসাংখ্যিক যোগাযোগ বা বিজড়িত দরজা) এবং :math:`U_\mathrm{single}(\theta) = \prod_{i=1}^n Y(\theta_{i})`, যেখানে :math:`n` কিউবিট সংখ্যা এবং :math:`m` কোয়ান্টাম সার্কিটের গভীরতা। এই পছন্দটির অনুপ্রেরণা হ'ল, এই প্রথাগত (ক্লাসিক্যাল) সমস্যার জন্য এটি কোয়ান্টাম স্টেটের যে স্থানগুলিতে কেবল প্রকৃত সহগ রয়েছে তার সন্ধানের অনুমতি দেয়, তবুও সম্ভাব্যভাবে সমাধানে আরও দ্রুত রূপান্তরিত করতে এনট্যাঙ্গেলমেন্ট প্রবণতাটিকে কাজে লাগিয়ে।
es_un: donde :math:`U_\mathrm{entrelazador}` es una colección de compuertas C-Phase (compuertas completamente entrelazadas), y :math:`U_\mathrm{simple}(\theta) = \prod_{i=1}^n Y(\theta_{i})`, donde :math:`n` es el número de qubits y :math:`m` es la profundidad del circuito cuántico. La motivación para esta elección es que para estos problemas clásicos, esta elección nos permite buscar en el espacio de estados cuánticos que solo tienen coeficientes reales, aprovechando el entrelazamiento para converger potencialmente más rápido a la solución.
fr: où :math:`U_ \mathrm{entangler}` est une collection de portes C-Phase (portes entièrement intricantes), et :math:` U_ \mathrm{single}(\theta) = \prod_ { i= 1 } ^ n Y (\theta_{i}) `, où :math:` n ` est le nombre de qubits et :math:` m ` est la profondeur du circuit quantique. La raison de ce choix est que pour ces problèmes classiques ce choix nous permet de chercher dans l'espace des états quantiques qui n'ont que des coefficients réels, en exploitant encore l'intrication pour potentiellement converger plus vite vers la solution.
ko: 여기서 :math:`U_\mathrm{entangler}` 는 C 페이즈 게이트(완전히 얽히는 관문)의 집합이며, :math:`U_\mathrm{single}(\theta) = \prod_{i=1}^n Y(\theta_{i})`, 그리고 :math:`n` 은 큐비트의 수, :math:`m` 은 양자회로의 깊이라고 생각할 것이다. 이러한 선택의 동기는 이와같은 고전적인 문제들에서 우리가 실수 계수만을 가지고 있는 양자 상태의 공간을 탐색할 수 있다는 것이며, 여전히 그 얽힘을 이용하여 잠재적으로 해답에 더 빨리 수렴할 수 있다는 것이다.
pt_un: onde :math:`U_\mathrm{entangler}` é uma coleção de C-Phase gates (portões totalmente entrelaçados), e :math:`U_\mathrm{single}(\theta) = \prod_{i=1}^n Y(\theta_{i})`, onde :math:`n` é o número de qubits e :math:`m` é a profundidade do circuito quântico. A motivação para esta escolha é que, para estes problemas clássicos, esta escolha nos permite procurar o espaço de Estados quânticos que só têm verdadeiros coeficientes, ainda explorando o entalhe para potencialmente convergir mais rapidamente para a solução.
ta_in: எங்கே :math:`U_\ mathrm {entangler}` என்பது சி-கட்ட கேட்களின் தொகுப்பாகும் (முழுமையாக எண்டங்கள்டு கேட்கள்), மற்றும் :math:`U_\mathrm {single} (\theta) = \ prod_ {i = 1} ^ n Y (\theta_ {i})`, எங்கே :math:`n` என்பது க்யூபிட்களின் எண்ணிக்கை மற்றும்:math:`m` என்பது குவாண்டம் சுற்றுகளின் ஆழம். இந்த தேர்விற்கான உந்துதல் என்னவென்றால், இந்த கிளாசிக்கல் சிக்கல்களுக்கு இந்த தேர்வு உண்மையான குணகங்களை மட்டுமே கொண்ட குவாண்டம் நிலைகளின் இடத்தைத் தேட அனுமதிக்கிறது, மேலும் தீர்வுக்கு விரைவாக ஒன்றிணைவதற்கான சிக்கலை இன்னும் பயன்படுத்துகிறது.
th_th: โดย :math:`U_\mathrm{entangler}` เป็นชุดของเกต C-Phase (Fully Entangling Gate) และ :math:`U_\mathrm{single}(\theta) = \prod_{i=1}^n Y(\theta_{i})` โดยที่ :math:`n` เป็นจำนวนคิวบิตและ :math:`m` เป็นความลึกของวงจรควอนตัม เหตุผลของการเลือกใช้นี้คือ เพื่อให้เรามีขอบเขตของสถานะเชิงควอนตัมในส่วนสัมประสิทธิ์จำนวนจริงที่ครอบคลุม และมีโอกาสที่จะหาคำตอบได้เร็วกว่าอัลกอริทึมแบบดั้งเดิม

source: One advantage of using this sampling method compared to adiabatic approaches is that the target Ising Hamiltonian does not have to be implemented directly on hardware, allowing this algorithm not to be limited to the connectivity of the device. Furthermore, higher-order terms in the cost function, such as :math:`Z_iZ_jZ_k`, can also be sampled efficiently, whereas in adiabatic or annealing approaches they are generally impractical to deal with.
bn_bn: অ্যাডিয়াব্যাটিক পদ্ধতির তুলনায় এই স্যাম্পলিং পদ্ধতিটি ব্যবহার করার একটি সুবিধা হল টার্গেট আইসিং হ্যামিল্টনিয়ানকে সরাসরি হার্ডওয়্যারে প্রয়োগ করা উচিত নয়, এই অ্যালগরিদমটিকে ডিভাইসের সংযোগের মধ্যে সীমাবদ্ধ না। তদুপরি, ব্যয় কার্যক্রমে উচ্চতর অর্ডার শর্তাদি, যেমন :math:`Z_iZ_jZ_k , এগুলিও দক্ষতার সাথে নমুনাযুক্ত করা যেতে পারে, যেখানে অ্যাডিয়াব্যাটিক বা অ্যানিলিং পদ্ধতির ক্ষেত্রে তারা সাধারণত মোকাবেলা করতে অযৌক্তিক হয়।
es_un: Una ventaja de utilizar este método de muestreo en comparación con los enfoques adiabáticos es que el Hamiltoniano de Ising objetivo no tiene que implementarse directamente en el hardware, lo que permite que este algoritmo no se limite a la conectividad del dispositivo. Además, los términos de orden superior en la función de costo, como :math:`Z_iZ_jZ_k`, también se pueden muestrear de manera eficiente, mientras que en los enfoques adiabáticos o de annealing (recocido), generalmente no es práctico tratarlos.
fr: L'un des avantages de l'utilisation de cette méthode d'échantillonnage par rapport aux approches adiabatiques est que l'hamiltonien d'Ising cible n'a pas à être mis en oeuvre directement sur le matériel, ce qui permet à cet algorithme de être limité par la connectivité de l'appareil. En outre, les termes plus élevés dans la fonction de coût, tels que :math:` Z_iZ_jZ_k `, peuvent également être échantillonnés efficacement, alors que dans les approches adiabatiques ou recuits, ils sont généralement peu pratiques à traiter.
ko: 이 샘플링 방법을 단열과정 접근법과 비교하여 사용하는 한 가지 장점은 대상인 이징 해밀토니안이 하드웨어에서 직접 구현될 필요가 없으므로 이 알고리즘이 장치의 연결에 제한되지 않는다는 것이다. 더욱이 :math:`Z_iZ_jZ_k` 와 같은 비용함수의 고차항 조건도 효율적으로 샘플링할 수 있지만, 단열접근법이나 어닐링접근법에서는 일반적으로 다루기 어렵다.
pt_un: Uma vantagem de utilizar este método de amostragem em comparação com abordagens adiabáticas é que o alvo Ising Hamiltonian não tem de ser implementado diretamente em hardware, permitindo que este algoritmo não seja limitado à conectividade do dispositivo. Além disso, termos de ordem superior na função de custo, como :math:`Z_iZ_jZ_k`, também pode ser amostrado eficientemente, enquanto em abordagens adiabáticas ou de anelamento são geralmente impraticáveis para se tratar.
ta_in: அடிபயாடிக் அணுகுமுறைகளுடன் ஒப்பிடும்போது இந்த மாதிரி முறையைப் பயன்படுத்துவதன் ஒரு நன்மை என்னவென்றால், இலக்கு ஐசிங் ஹாமில்டோனியன் நேரடியாக வன்பொருளில் செயல்படுத்தப்பட வேண்டியதில்லை, இது இந்த வழிமுறையை சாதனத்தின் இணைப்பிற்கு மட்டுப்படுத்தக்கூடாது. மேலும், செலவுச் செயல்பாட்டில் உயர்-வரிசை சொற்கள்,:math:`Z_iZ_jZ_k`, திறம்பட மாதிரியாகவும் எடுக்கப்படலாம், அதேசமயம் அடிபயாடிக் அல்லது வருடாந்திர அணுகுமுறைகளில் அவை சமாளிக்க நடைமுறைக்கு சாத்தியமற்றவை.
th_th: หนึ่งในประโยชน์ของการทำงานรูปแบบนี้เมื่อเทียบกับวิธีการแบบ Adiabatic คือ Ising Hamiltonian ที่เราต้องการนั้น ไม่จำเป็นต้องสร้างลงบนฮาร์ดแวร์โดยตรง ทำให้อัลกอริทึมนี้จะไม่ถูกจำกัดด้วยการเชื่อมต่อภายในอุปกรณ์ นอกจากนี้พจน์ลำดับสูงในฟังก์ชันวัตถุประสงค์เช่น :math:`Z_iZ_jZ_k` ก็ยังสามารถสุ่มตัวอย่างออกมาได้อย่างมีประสิทธิภาพ ในขณะที่ในวิธีการแบบ Adiabatic และ Annealing อาจจะมีผลกระทบที่ต้องจัดการเพิ่มเติม

source: References:
es_un: Referencias:
ko: 참고문헌:
pt_un: Referências:
ta_in: குறிப்புகள்:
th_th: แหล่งอ้างอิง:

source: Application classes
bn_bn: অ্যাপ্লিকেশন ক্লাস
es_un: Clases de aplicación
fr: Classes d'application
ko: 응용 클래스
pt_un: Classes de aplicação
ta_in: பயன்பாட்டு வகுப்புகள்
th_th: คลาสแอปพลิเคชัน

source: We use the application classes for the max-cut problem and the traveling salesman problem in this page. There are application classes for other optimization problems available as well. See `Application Classes for Optimization Problems <09_application_classes.ipynb>`__ for details.
bn_bn: আমরা সর্বোচ্চ লাভ সমস্যা ও ভ্রাম্যমান বিক্রেতার সমস্যার জন্য অ্যাপ্লিকেশন ক্লাস ব্যবহার করতে পারি। অন্যান্য অনুকূলায়ন (অপ্টিমাইজেশন) সমস্যাসমূহর জন্য আরো অ্যাপ্লিকেশন ক্লাস আছে। বিস্তারিত জানতে `Application Classes for Optimization Problems <09_application_classes.ipynb>`__ দেখ।
es_un: Usamos las clases de aplicación para el problema de máximo corte y el problema del vendedor viajero en esta página. También hay disponibles clases de aplicación para otros problemas de optimización. Consulta `Clases de Aplicación para Problemas de Optimización <09_application_classes.ipynb>`__ para más detalles.
fr: Nous utilisons les classes d'application pour le problème de la coupure maximale et le problème du vendeur ambulant dans cette page. Il existe également des classes d'application pour d'autres problèmes d'optimisation. Pour plus d'informations, voir ` Classes d'application pour les problèmes d'optimisation <09_application_classes.ipynb> ` __.
ko: 이 페이지에서 응용 클래스를 사용해 최대 절단 문제와 여행하는 외판원 문제를 다룬다. 다음은 사용 가능한 다른 최적화 문제에 대한 응용 클래스이다. 자세한 내용은 `Application Classes for Optimization Problems <09_application_classes.ipynb>`__ 에서 볼 수 있다.
pt_un: Utilizamos as classes de aplicação para o problema de max-cut e o problema do caixeiro viajante nesta página. Também existem classes de aplicação disponíveis para outros problemas de otimização. Consulte `Classes de Aplicação para Problemas de Otimização <09_application_classes.ipynb>`__ para obter detalhes.
ta_in: இந்த பக்கத்தில் அதிகபட்ச வெட்டு பிரச்சனை மற்றும் பயண விற்பனையாளர் பிரச்சனைக்கான விண்ணப்ப வகுப்புகளை நாங்கள் பயன்படுத்துகிறோம். பிற தேர்வுமுறை சிக்கல்களுக்கு விண்ணப்ப வகுப்புகள் உள்ளன. `தேர்வுமுறை சிக்கல்களுக்கான பயன்பாடு வகுப்புகள் விவரங்களுக்கு <09_application_classes.ipynb>`__ பார்க்கவும்.
th_th: เราใช้งานคลาส Application สำหรับโจทย์ปัญหา Max-Cut และ Traveling Salesman ในหน้านี้ ในโมดูลนี้ยังมีคลส Application สำหรับโจทย์ Optimization อื่น ๆ ให้ใช้งาน สามารถดูข้อมูลเพิ่มเติมได้ที่ `Application Classes for Optimization Problems <09_application_classes.ipynb>`__

source: Max-Cut problem
bn_bn: সর্বোচ্চ লাভ সমস্যা (Max-Cut problem)
es_un: Problema de Máximo Corte (Max-Cut)
fr: Problème Max-Cut
ko: 최대 컷 문제
pt_un: Problema de Max-Cut
ta_in: மேக்ஸ்-கட் சிக்கல்
th_th: โจทย์ปัญหา Max-Cut

source: Brute force approach
bn_bn: ব্রুট ফোর্স পদ্ধতি
es_un: Enfoque de fuerza bruta
fr: Approche de force brute
ko: Brute force 접근법
pt_un: Abordagem de força bruta
ta_in: ப்ருட்-போர்ஸ் அணுகுமுறை
th_th: วิธีการ Brute Force

source: Try all possible :math:`2^n` combinations. For :math:`n = 4`, as in this example, one deals with only 16 combinations, but for n = 1000, one has 1.071509e+30 combinations, which is impractical to deal with by using a brute force approach.
bn_bn: সমস্ত সম্ভাব্য :math:`2^n সমন্বয় চেষ্টা করুন। যেমন :math:`n = 4`, উদাহরণস্বরূপ, একজন কেবলমাত্র 16 টি সংমিশ্রণের সাথে ডিল করে তবে n = 1000 এর জন্য একটিতে 1.071509e + 30 সংমিশ্রণ রয়েছে, যা ব্রুট ফোর্স পদ্ধতির ব্যবহার করে মোকাবেলা করা অযৌক্তিক।
es_un: Prueba todas las :math:`2^n` combinaciones posibles. Para :math:`n = 4`, como en este ejemplo, uno trata solo con 16 combinaciones, pero para n = 1000, uno tiene 1.071509e+30 combinaciones, lo cual no es práctico de manejar usando un enfoque de fuerza bruta.
fr: Essayez toutes les combinaisons possibles :math:`2^n`. Pour :math:`n = 4`, comme dans cet exemple, on ne traite que de 16 combinaisons, mais pour n = 1000, on a 1,071509e+30 combinaisons, ce qui n'est pas pratique à traiter avec une approche de force brute.
ko: 모든 가능한 :math:`2^n` 조합을 시도합니다. 이 예에서와 같이, :math:`n = 4` 인 경우, 16개의 조합만을 다루지만, n = 1000은 1.071509e+30의 조합을 가지며, 무차별 대입법(브루트 포스)을 사용해서는 다루기 어렵다.
pt_un: Tente todas as :math:`2^n` combinações possíveis. Para :math:`n = 4`, como neste exemplo, lidamos com apenas 16 combinações, mas para n = 1000, temos 1.071509e+30 combinações, o que é impraticável de se lidar usando uma abordagem de força bruta.
ta_in: முடிந்த அனைத்தையும் முயற்சிக்கவும்:math: `2 ^ n` சேர்க்கைகள். இதற்கு:math: `n = 4`, இந்த எடுத்துக்காட்டில், ஒருவர் 16 சேர்க்கைகளை மட்டுமே கையாள்கிறார், ஆனால் n = 1000 க்கு, ஒருவர் 1.071509e + 30 சேர்க்கைகளைக் கொண்டிருக்கிறார், இது ஒரு முரட்டுத்தனமான அணுகுமுறையைப் பயன்படுத்துவதன் மூலம் சமாளிப்பது சாத்தியமற்றது.
th_th: ลองทุก ๆ รูปแบบ :math:`2^n` ที่เป็นไปได้ สำหรับ :math:`n = 4` ดังตัวอย่าง เป็นการจัดการกับ 16 รูปแบบ สำหรับ n = 100 เป็นตัวที่มีความเป็นไปได้ทั้งหมด 1.071509e+30 รูปแบบ ซึ่งไม่สามารถใช้วิธีการ Brute Force แก้ไขได้อย่างมีประสิทธิภาพ

source: Mapping to the Ising problem
bn_bn: আইসিং সমস্যার ম্যাপিং (চিত্রায়ন)
es_un: Mapear del problema de Ising
fr: Transposition vers le problème d'Ising
ko: Ising 문제로 매핑
pt_un: Mapeamento para o problema Ising
ta_in: ஐசிங் சிக்கலுக்கு மேப்பிங்
th_th: แปลงเป็นโจทย์ปัญหา Ising

source: Qiskit provides functionality to generate ``QuadraticProgram`` from the problem specification as well as create the corresponding Ising Hamiltonian.
bn_bn: Qiskit সমস্যা বিবরণ থেকে ``QuadraticProgram`` তৈরি করতে এবং সম্পর্কিত আইসিং হ্যামিল্টোনিয়ান বানাতে প্রয়োজনীয় কার্যকারিতা সরবরাহ করে।
es_un: Qiskit proporciona funcionalidad para generar el ``QuadraticProgram`` a partir de la especificación del problema, así como para crear el correspondiente Hamiltoniano de Ising.
fr: Qiskit fournit des fonctionnalités pour générer le ``QuadraticProgram`` à partir de la spécification de problème et pour créer le Ising Hamiltonien correspondant.
ko: Qiskit은 문제 정의에서 ``QuadraticProgram`` 를 생성할 뿐만 아니라 해당하는 Ising Hamiltonian을 생성할 수 있는 기능도 제공한다.
pt_un: O Qiskit fornece funcionalidade para gerar o ``QuadraticProgram`` a partir da especificação do problema, bem como criar o Hamiltoniano de Ising correspondente.
ta_in: ``QuadraticProgram`` சிக்கல் விவரக்குறிப்புடன் தொடர்புடைய ஐசிங் ஹாமில்டோனியனை உருவாக்க கிஸ்கிட் உருவாக்க செயல்பாட்டை வழங்குகிறது.
th_th: Qiskit มีฟังก์ชันสำหรับการสร้าง ``QuadraticProgram`` จากโจทย์ปัญหารวมไปถึงการแปลงเป็น Ising Hamiltonian

source: Since the problem was cast to a minimization problem, the solution of :math:`-4` corresponds to the optimum.
bn_bn: যেহেতু সমস্যাটি একটি মিনিমাইজেশন সমস্যার জন্য ফেলে দেওয়া হয়েছিল, তাই :math:`-4` সমাধানটি সর্বোত্তমের সাথে মিলে যায়।.
es_un: Dado que el problema se convirtió en un problema de minimización, la solución de :math:`-4` corresponde al óptimo.
fr: Comme le problème a été converti en un problème de minimisation, la solution :math:`-4` correspond à l'optimum.
ko: 문제가 최소화 문제로 변환되었기때문에 :math:`-4` 의 솔루션은 최적에 해당된다.
pt_un: Uma vez que o problema foi convertido para um problema de minimização, a solução de :math:`-4` corresponde ao ótimo.
ta_in: சிக்கல் ஒரு சிறுமமாக்கம் பிரச்சனைக்கு அனுப்பப்பட்டதால், இதன் தீர்வு:math:`-4` என்பது உகந்ததாக ஒத்துள்ளது.
th_th: เนื่องจากโจทย์ปัญหานี้เราแปลงมาเป็นโจทย์ปัญหาหาค่าต่ำสุด ดังนั้นคำตอบ :math:`-4` คือค่าที่ดีที่สุด

source: Checking that the full Hamiltonian gives the right cost
bn_bn: সম্পূর্ণ হ্যামিল্টোনিয়ান সঠিক ব্যয় দেয় তা পরীক্ষা করা হচ্ছে
es_un: Verificar que el Hamiltoniano completo proporcione el costo correcto
fr: Vérification que l'hamiltonien complet produit le bon coût
ko: 전체 해밀토니안이 정확한 코스트를 제공하고 있는지 확인한다
pt_un: Verificando se o Hamiltoniano completo oferece o custo certo
ta_in: முழு ஹாமில்டோனியன் சரியான செலவை அளிக்கிறது என்பதை சரிபார்க்கிறது
th_th: ตรวจสอบว่า Hamiltonian เต็มนี้ให้ค่าวัตถุประสงค์ที่ถูกต้องหรือไม่
