Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/07_examples_vehicle_routing.po
Languages: bn_bn, es_un, pt_un, ta_in, th

source: This page was generated from `docs/tutorials/07_examples_vehicle_routing.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/07_examples_vehicle_routing.ipynb`__ থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `docs/tutorials/07_examples_vehicle_routing.ipynb`__.
pt_un: Esta página foi gerada a partir de `docs/tutorials/07_examples_vehicle_routing.ipynb`__.
ta_in: இந்தப் பக்கம் `docs/tutorials/00_amplitude_estimation.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
th: หน้านี้ถูกสร้างขึ้นจาก `docs/tutorials/07_examples_vehicle_routing.ipynb`__

source: Vehicle Routing
bn_bn: বাহন(ভেহিকেল) রাউটিং
es_un: Rutas de Vehículos
pt_un: Roteamento de Veículos
ta_in: வாகன வழித்தடம்

source: The Introduction
bn_bn: ভূমিকা
es_un: Introducción
pt_un: Introdução
ta_in: முன்னுரை
th: บทนำ

source: Logistics is a major industry, with some estimates valuing it at USD 8183 billion globally in 2015. Most service providers operate a number of vehicles (e.g., trucks and container ships), a number of depots, where the vehicles are based overnight, and serve a number of client locations with each vehicle during each day. There are many optimization and control problems that consider these parameters. Computationally, the key challenge is how to design routes from depots to a number of client locations and back to the depot, so as to minimize vehicle-miles traveled, time spent, or similar objective functions. In this notebook we formalize an idealized version of the problem and showcase its solution using the quantum approximate optimization approach of Farhi, Goldstone, and Gutmann (2014).
bn_bn: সরবরাহ শিল্প একটি বড় শিল্প,২০১৫ সালে যার অনুমাকি বাজার মূল্য ছিল ৮১৮৩ মার্কিন ডলার।প্রায় সমস্ত সেবা প্রদানকারী অনেক গুলি বাহন(যেমন মাল বোঝাই গাড়ি ও জাহাজ),অনেক গুলি ডিপো ব্যাবহার করেন যেখানে বাহন গুলি এক রাতের জন্যে এবং অনেকগুলি খরিদ্দারকে বিভিন্ন জায়গায় সামগ্রী সরবরাহ করে থাকে প্রতিটি বাহন দ্বারা প্রতিদিন। এই স্থিতিমাপ গুলিকে অনেক অপটিমাইজেশন এবং নিয়ন্ত্রণ সমস্যা(কন্ট্রোল প্রবলেম) দ্বারা গণ্য করা হয়। গাণিতিক ভাবে মূল সমস্যা হলো এই রুট বা যাত্রাপথ গুলিকে এমন ভাবে নকশা বা ডিজাইন করা যাতে কম যাত্রা পথ অতিক্রান্ত করে ,কম সময়ে বা অনুরূপ নৈর্ব্যক্তিক অন্বয় (অব্জেক্টিভ ফাংশন) কাজটি করা যায়।এই নোটবুকের মধ্যে আমরা এই সমস্যার একটি আদর্শ সংস্করণ বিধিবদ্ধ করব এবং তার সমাধান দেখাব ফারহি ,গোল্ডস্টেইন এবং গুটম্যানের (২০১৪) কোয়ান্টাম আনুমানিক অপটিমাইজেশন প্রন্থা দ্বারা।
es_un: La logística es una industria importante, y algunas estimaciones la valoran en USD 8.183 billones a nivel mundial en 2015. La mayoría de los proveedores de servicios operan varios vehículos (por ejemplo, camiones y portacontenedores), varios depósitos, donde los vehículos pasan la noche y sirven una serie de ubicaciones de clientes con cada vehículo durante cada día. Hay muchos problemas de optimización y control que consideran estos parámetros. Computacionalmente, el desafío clave es cómo diseñar rutas desde los depósitos a una serie de ubicaciones de clientes y de regreso al depósito, a fin de minimizar las millas recorridas por los vehículos, el tiempo empleado o funciones objetivo similares. En este cuaderno formalizamos una versión idealizada del problema y mostramos su solución utilizando el enfoque de optimización aproximada cuántica de Farhi, Goldstone, y Gutmann (2014).
pt_un: A Logística é uma importante área industrial, pois - com base em algumas estimativas - foi avaliada globalmente em 8183 bilhões de dólares, no ano de 2015. E, a maioria dos prestadores de serviços opera vários veículos (por exemplo, caminhões e navios de contêineres), efetuam vários depósitos, onde os veículos passam a noite e servem vários locais de clientes, com cada veículo, durante cada dia. Existem muitos problemas de otimização e controle, que consideram tais parâmetros. Computacionalmente, o desafio chave é como projetar rotas, a partir de depósitos para vários locais de clientes e retornar aos mesmos, de modo a minimizar os quilômetros viajados pelos veículos, tempo gasto ou funções objetivas semelhantes. Neste artigo, formalizaremos uma versão idealizada do problema e mostraremos sua solução utilizando a abordagem de otimização aproximada quântica de Farhi, Goldstone e Gutman (2014).
ta_in: தளவாடங்கள் ஒரு முக்கிய தொழிலாகும், சில மதிப்பீடுகள் 2015 ஆம் ஆண்டில் உலகளவில் 8183 பில்லியன் அமெரிக்க டாலராக மதிப்பிடப்பட்டுள்ளன. பெரும்பாலான சேவை வழங்குநர்கள் பல வாகனங்களை (எ.கா., லாரிகள் மற்றும் கொள்கலன் கப்பல்கள்), பல டிப்போக்களை இயக்குகின்றனர், அங்கு வாகனங்கள் ஒரே இரவில் அமைந்திருக்கின்றன, மேலும் சேவை செய்கின்றன ஒவ்வொரு நாளும் ஒவ்வொரு வாகனத்துடனும் பல வாடிக்கையாளர் இருப்பிடங்கள். இந்த அளவுருக்களைக் கருத்தில் கொள்ளும் பல தேர்வுமுறை மற்றும் கட்டுப்பாட்டு சிக்கல்கள் உள்ளன. கணக்கீட்டு ரீதியாக, முக்கிய சவால் என்னவென்றால், டிப்போக்களிலிருந்து பல கிளையன்ட் இருப்பிடங்களுக்கான பாதைகளை எவ்வாறு வடிவமைப்பது மற்றும் மீண்டும் டிப்போவுக்குச் செல்வது, இதனால் வாகன மைல்கள் பயணிப்பது, செலவழித்த நேரம் அல்லது இதே போன்ற புறநிலை செயல்பாடுகளை குறைத்தல். இந்த நோட்புக்கில், சிக்கலின் இலட்சியப்படுத்தப்பட்ட பதிப்பை நாங்கள் முறைப்படுத்துகிறோம் மற்றும் ஃபர்ஹி, கோல்ட்ஸ்டோன் மற்றும் குட்மேன் (2014) ஆகியவற்றின் குவாண்டம் தோராயமான தேர்வுமுறை அணுகுமுறையைப் பயன்படுத்தி அதன் தீர்வை வெளிப்படுத்துகிறோம்.
th: โลจิสติกส์เป็นหนึ่งในอุตสาหกรรมหลักของโลกซึ่งมูลค่าประมาณการทั่วโลกอยู่ที่ 8183 พันล้าน USD ในปี 2015 ผู้ให้บริการส่วนใหญ่นั้นมีการใช้งานยานพาหนะจำนวนมาก (เช่น รถบรรทุกและเรือขนส่ง) มีจำนวนคลังสินค้ามาก และมีลูกค้าที่ต้องไปส่งสินค้าจำนวนมากทำให้ยานพาหนะต้องส่งสินค้าทั้งวัน มีเทคนิคในการทำ Optimization หลากหลายที่สามารถใช้ในงานนี้ได้ ความท้าทายหลักในการคำนวนนี้คือการออกแบบเส้นทางการเดินทางจากคลังสินค้าไปยังสถานที่ของลูกค้าจำนวนมาก และเดินทางกลับมายังคลังสินค้า โดยที่ทำให้มีระยะทางการเดินทางของยานพาหนะสั้นที่สุด, เวลาที่ใช้น้อยที่สุด หรือ วัตถุประสงค์อื่น ๆ ที่ใกล้เคียงกัน ใน Notebook นี้เราได้ออกแบบโจทย์นี้ในเวอร์ชันแบบอุดมคติและแสดงวิธีการหาคำตอบด้วยเทคนิค Quantum Approximate Optimization ของ Farhi, Goldstone และ Gutmann (2014)

source: The overall workflow we demonstrate comprises:
bn_bn: সামগ্রিকভাবে আমাদের প্রদর্শিত কর্মধারা গঠিত হয়:
es_un: El flujo de trabajo en general que demostramos comprende:
pt_un: O fluxo de trabalho global que demonstramos inclui:
ta_in: நாங்கள் நிரூபிக்கும் ஒட்டுமொத்த பணிப்பாய்வு பின்வருமாறு:
th: ลำดับการทำงานโดยรวมมีดังนี้

source: establish the client locations. Normally, these would be available ahead of the day of deliveries from a database. In our use case, we generate these randomly.
bn_bn: খরিদ্দারের স্থান প্রতিষ্টিত করা। সাধারণত,এগুলি পাওয়া যাবে একটি ডাটাবেজ (দস্তাবেজ) থেকে বিতরণের দিনের আগে।আমাদের ব্যবহারিক ক্ষেত্র আমরা এটি সৃষ্টি করি এলোমেলো ভাবে বা যদৃচ্ছভাবে।
es_un: establecer las ubicaciones de los clientes. Normalmente, estos estarían disponibles antes del día de las entregas desde una base de datos. En nuestro caso de uso, los generamos aleatoriamente.
pt_un: estabelecer os locais dos clientes. Normalmente, eles estariam disponíveis, antes do dia das entregas, a partir de um banco de dados. No nosso caso de uso, geramos so casos, aleatoriamente.
ta_in: வாடிக்கையாளர் இடங்களை நிறுவவும். பொதுவாக, இவை தரவுத்தளத்தில் இருந்து டெலிவரி செய்யப்படும் நாளுக்கு முன்னதாகவே கிடைக்கும். எங்கள் பயன்பாட்டு வழக்கில், நாங்கள் இதை தோராயமாக உருவாக்குகிறோம்.
th: กำหนดสถานที่ของลูกค้า โดยทั่วไปแล้วเราจะมีข้อมูลส่วนนี้อยู่ในฐานข้อมูลอยู่แล้ว ก่อนเวลาที่ต้องจัดส่ง ในกรณีของเราเราจะสร้างขึ้นมาแบบสุ่ม

source: compute the pair-wise distances, travel times, or similar. In our case, we consider the Euclidean distance, “as the crow flies”, which is perhaps the simplest possible.
bn_bn: জোড় দূরত্ব গুলি, যাত্রার সময়গুলি বা অনুপুর গননা করো।আমাদের ক্ষেত্রে আমরা বিবেচনা করবো ইউক্লিডিয়ান দূরত্ব,"ঠিক সোজা পথ দিয়ে",সম্ভবত যেটা সবচেয়ে সহজতম।
es_un: calcular las distancias por pares, tiempos de viaje o similares. En nuestro caso, consideramos la distancia euclidiana, “a vuelo de pájaro”, que es quizás la más simple posible.
pt_un: computar as distâncias dois a dois, tempos de viagem ou similares. No nosso caso, consideramos a distância euclidiana, em linha reta, que é, talvez, o mais simples possível.
ta_in: ஜோடி வாரியாக தூரங்கள், பயண நேரங்கள் அல்லது ஒத்த கணக்கிட. எங்கள் விஷயத்தில், நாம் யூக்ளிடியன் தூரத்தை, "காகம் பறப்பது போல்" கருதுகிறோம், இது ஒருவேளை மிகவும் எளிதானது.
th: คำนวนระยะห่าง, เวลาในการเดินทาง หรือ อื่น ๆ ที่ใกล้เคียงกัน ของจากจุดหนึ่งไปยังจุดอื่น ๆ ในกรณีของเราเราจะใช้ Euclidean Distance "ระยะทางเส้นตรง" ซึ่งเป็นกรณีที่ง่ายที่สุด

source: compute the actual routes. This step is run twice, actually. First, we obtain a reference value by a run of a classical solver (IBM CPLEX) on the classical computer. Second, we run an alternative, hybrid algorithm partly on the quantum computer.
bn_bn: আসল রুট গুলি গননা করো।আসলে এই ধাপটি দুবার চালানো হয়।প্রথমে আমরা একটি তথ্যসূত্র (রেফারেন্স) মান প্রাপ্ত করি একটি প্রথাগত (ক্লাসিক্যাল) সমাধানকারী (সলভার)(IBM CPLEX) একটি প্রথাগত প্রথাগত (ক্লাসিক্যাল) কম্পিউটারে চালিয়ে।দ্বিতীয়তে আংশিক ভাবে একটি কোয়ান্টাম কম্পিউটারে আমরা একটি বিকল্প, হাইব্রিড অ্যালগরিদম / ধরাক্রম চালায়।
es_un: calcular las rutas en sí. Este paso se ejecuta dos veces, de hecho. Primero, obtenemos un valor de referencia por una ejecución de un solucionador clásico (IBM CPLEX) en la computadora clásica. Segundo, ejecutamos un algoritmo híbrido alternativo parcialmente en la computadora cuántica.
pt_un: computar as rotas reais. Esta etapa é executada duas vezes, na verdade. Primeiro, obtemos um valor de referência por uma execução de um solver clássico (IBM CPLEX) no computador clássico. Depois, executamos um algoritmo híbrido alternativo parcialmente no computador quântico.
ta_in: உண்மையான வழிகளைக் கணக்கிடுங்கள். இந்த படி உண்மையில் இரண்டு முறை இயக்கப்படுகிறது. முதலில், கிளாசிக்கல் கணினியில் கிளாசிக்கல் சொல்வர் (IBM CPLEX) மூலம் ஒரு குறிப்பு மதிப்பைப் பெறுகிறோம். இரண்டாவதாக, குவாண்டம் கணினியில் ஒரு மாற்று, கலப்பின வழிமுறையை இயக்குகிறோம்.
th: คำนวนเส้นทางจริง ในขั้นตอนนี้เป็นการทำงาน 2 ครั้ง โดยครั้งแรกเรารับค่าจุดอ้างอิงจากการทำงานของอัลกอริทึมแบบดั้งเดิม (IBM CPLEX) บนเครื่องคอมพิวเตอร์แบบดั้งเดิม ในครั้งที่สองเราทำงานแบบ Hybrid โดยมีทั้งส่วนที่ทำงานบนเครื่องคอมพิวเตอร์แบบดั้งเดิมและส่วนที่ทำงานบนเครื่องควอนตัมคอมพิวเตอร์

source: visualization of the results. In our case, this is again a simplistic plot.
bn_bn: ফলাফল দৃশ্যায়ন বা চিত্রায়ন।আমাদের ক্ষেত্রে,এটি আবার একটি সহজ সরললে খচিত্র বা আঁকা(প্লট)।
es_un: visualización de los resultados. En nuestro caso esto, de nuevo, es una simple gráfica.
pt_un: visualização dos resultados. No nosso caso, este é novamente um plot simplista.
ta_in: முடிவுகளின் காட்சிப்படுத்தல். எங்கள் விஷயத்தில், இது மீண்டும் ஒரு எளிய வரைதல்.
th: แสดงผลผลลัพธ์ ในกรณีนี้เราจะใช้การแสดงผลแบบง่าย ๆ

source: In the following, we first explain the model, before we proceed with the installation of the pre-requisites and the data loading.
bn_bn: এটিতে আমরা প্রথমে নকশাটিকে বর্ণনা করবো, পূর্ব প্রয়োজনীয় (প্রী রিকুইসিট) অধিষ্ঠানকরণ(ইনস্টলেশন) এবং তথ্য বোঝাই বা লোডিং করার আগে।
es_un: A continuación, explicamos primero el modelo, antes de proceder con la instalación de los requerimientos previos y la carga de datos.
pt_un: A seguir, explicamos primeiro o modelo, antes de prosseguir com a instalação dos pré-requisitos e o carregamento dos dados.
ta_in: பின்வருவனவற்றில், முன்-தேவைகளை நிறுவுதல் மற்றும் தரவை ஏற்றுவதற்கு முன் மாதிரியை முதலில் விளக்குகிறோம்.
th: ในส่วนถัดไป เราเริ่มด้วยการอธิบายโมเดลก่อนขั้นตอนการติดตั้งโมดูลที่จำเป็นและขั้นตอนการโหลดข้อมูล

source: The Model
bn_bn: নকশা
es_un: El Modelo
pt_un: O Modelo
ta_in: மாதிரி
th: โมเดล

source: Mathematically speaking, the vehicle routing problem (VRP) is a combinatorial problem, wherein the best routes from a depot to a number of clients and back to the depot are sought, given a number of available vehicles. There are a number of formulations possible, extending a number of formulations of the traveling salesman problem [Applegate et al, 2006]. Here, we present a formulation known as MTZ [Miller, Tucker, Zemlin, 1960].
bn_bn: গাণিতিক ভাবে বললে,ভেহিকেল বা বাহন রাউটিং সমস্যা (ভি.পি.আর.)হলো একটি সমাবেশ সমস্যা,দিয়ে রাখা কিছু সংখ্যক বাহনের জন্যে সবচেয়ে ভালো রাস্তা বা রুট জানতে চাওয়া হয় ডিপো বা গুদামঘর থেকে খরিদ্দার পর্যন্ত।এখানে অনেক গুলি সূত্র সম্ভব,ট্র্যাভেলিইং সেলসম্যান সমস্যার[Applegate et al, 2006] বেশ কয়েকটি সূত্র প্রসারিত করে।আমরা এখানে একটি সূত্র পেশ করছি যাকে বলা হয় এম.টি.জেড [Miller, Tucker, Zemlin, 1960]।
es_un: Matemáticamente hablando, el problema de enrutamiento de vehículos (vehicle routing problem, VRP) es un problema combinatorio, en el que se buscan las mejores rutas desde un depósito a varios clientes y de regreso al depósito, dado un número de vehículos disponibles. Hay varias formulaciones posibles, que extienden una serie de formulaciones del problema del vendedor viajero [Applegate et al, 2006]. Aquí, presentamos una formulación conocida como MTZ [Miller, Tucker, Zemlin, 1960].
pt_un: Matematicamente falando, o problema de roteamento de veículos (VRP) é um problema combinatório, no qual as melhores rotas de um depósito para vários clientes e voltado para o depósito são procuradas, dado um certo número de veículos disponíveis. Há uma série de formulações possíveis, estendendo-se várias formulações do problema do caixeiro viajante [Applegate et al, 2006]. Aqui, apresentamos uma formulação conhecida como MTZ [Miller, Tucker, Zemlin, 1960].
ta_in: கணித ரீதியாகப் பார்த்தால், வாகன ரூட்டிங் சிக்கல் (VRP) ஒரு கூட்டுப் பிரச்சினையாகும், இதில் ஒரு டெப்போவிலிருந்து பல வாடிக்கையாளர்களுக்கும், மீண்டும் டிப்போவிற்கும் சிறந்த வழிகள் தேடப்படுகின்றன, கிடைக்கக்கூடிய பல வாகனங்கள் கொடுக்கப்பட்டுள்ளன. பயண விற்பனையாளர் பிரச்சினையின் பல சூத்திரங்களை விரிவுபடுத்தும் பல சூத்திரங்கள் உள்ளன [ஆப்பிள்கேட் மற்றும் பலர், 2006]. இங்கே, MTZ [மில்லர், டக்கர், ஜெம்லின், 1960]. எனப்படும் ஒரு சூத்திரத்தை நாங்கள் முன்வைக்கிறோம்.
th: ในเชิงคณิตศาสตร์ Vehicle Routing Problem (VRP) เป็นโจทย์ปัญหา Combinatorial ซึ่งเราต้องการหาเส้นทางที่ดีที่สุด โดยเป็นเส้นทางที่เริ่มต้นจากคลังสินค้า เดินทางไปสถานที่ของลูกค้าจำนวนมาก และย้อนกลับมาที่คลังสินค้า ที่มีระยะทางสั้นที่สุดโดยมีจำนวนยานพาหนะที่ใช้จำกัด ในโจทย์ปัญหานี้มีสมการที่สามารถใช้ได้หลากหลายจากการนำสมการของ Traveling Salesman Problem มาขยายความ [Applegate et al, 2006] ในที่นี้เราใช้งานสมการที่ชื่อว่า MTZ [Miller, Tucker, Zemlin, 1960]

source: Let :math:`n` be the number of clients (indexed as :math:`1,\dots,n`), and :math:`K` be the number of available vehicles. Let :math:`x_{ij} = \{0,1\}` be the binary decision variable which, if it is :math:`1`, activates the segment from node :math:`i` to node :math:`j`. The node index runs from :math:`0` to :math:`n`, where :math:`0` is (by convention) the depot. There are twice as many distinct decision variables as edges. For example, in a fully connected graph, there are :math:`n(n+1)` binary decision variables.
bn_bn: ধরা জাক :math:`n` খরিদ্দারের সংখ্যা(সূচিত হয় :math:`1,\dots,n` দ্বারা),এবং :math:`K` হলো বাহন বা গাড়ির সংখ্যা। ধরা জাক :math:`x_{ij} = \{0,1\}` হলোদ্বিমিক (বাইনারি) সিদ্ধান্ত বা ডিসিসন চল রাশি যেটি যদি :math:`1` থাকে তবে সেটি বিভাগটিকে সক্রিয় করে :math:`i` নোড থেকে :math:`j` নোডে। নোড সূচক চলে :math:`0` থেকে :math:`n` পর্যন্ত,যেখানে :math:`0` হলো ডিপোটি বা গুদামঘরটি (প্রচলিত ভাবে)।প্রান্ত হিসাবে দ্বিগুণ স্বতন্ত্র সিদ্ধান্তের চলরশি রয়েছে। উদাহরণ স্বরূপ একটি পূর্ণ সংযুক্ত গ্রাফে :math:`n(n+1)` গুলি দ্বিমিক (বাইনারি) সিদ্ধান্ত চলরাশি রয়েছে।
es_un: Sea :math:`n` el número de clientes (indexado como :math:`1,\dots,n`) y :math:`K` el número de vehículos disponibles. Sea :math:`x_{ij} = \{0,1\}` la variable de decisión binaria que, si es :math:`1`, activa el segmento desde el nodo :math:`i` al nodo :math:`j`. El índice de nodo va desde :math:`0` a :math:`n`, donde :math:`0` es (por convención) el depósito. Hay el doble de variables de decisión distintas que de aristas. Por ejemplo, en un grafo completamente conectado, hay :math:`n(n+1)` variables de decisión binarias.
pt_un: Seja :math:`n` o número de clientes (indexados como :math:`1,\dots,n`) e :math:`K` o número de veículos disponíveis. Seja :math:`x_{ij} = \{0,1\}` a variável de decisão binária que, se for :math:`1`, ativa o segmento, a partir do nó :math:`i` até o nó :math:`j`. O índice do nó vai de :math:`0` até :math:`n`, sendo que :math:`0` é (por convenção) o depósito. Há duas vezes mais variáveis de decisão distintas do que arestas. Por exemplo, em um gráfico completo, há :math:`n(n+1)` variáveis de decisão binárias.
ta_in: :math:`n` வாடிக்கையாளர்களின் எண்ணிக்கையாக இருக்க வேண்டும் (indexed as :math:`1,\dots,n`), மற்றும் :math:`K` கிடைக்கக்கூடிய வாகனங்களின் எண்ணிக்கை. :math:`x_{ij} = \{0,1\}` பைனரி முடிவு மாறியாக இருக்க வேண்டும், அது இருந்தால்: :math:`1` , பிரிவை முனை: கணிதத்திலிருந்து செயல்படுத்துகிறது :math:`i`முனை :math:`j`. முனை குறியீடு :math:`0` முதல் :math:`n`, எங்கே :math:`0` என்பது (மாநாட்டின் படி) டிப்போ ஆகும். விளிம்புகளை விட இரண்டு மடங்கு தனித்துவமான முடிவு மாறிகள் உள்ளன. எடுத்துக்காட்டாக, முழுமையாக இணைக்கப்பட்ட வரைபடத்தில், :math:`n(n+1)` பைனரி முடிவு மாறிகள்.
th: กำหนดให้ :math:`n` เป็นจำนวนของลูกค้า (มีลำดับเป็น :math:`1,\dots,n`) และ :math:`K` คือจำนวนของยานพาหนะที่สามารถใช้งานได้ กำหนดให้ :math:`x_{ij} = \{0,1\}` เป็นตัวแปรทางเลือกแบบไบนารี่ โดยที่ถ้ามีค่าเป็น :math:`1` แปลว่ามีการเดินทางจาก Node :math:`i` ไปที่ Node :math:`j` ลำดับของ Node จะมีค่าตั้งแต่ :math:`0` จนถึง :math:`n` โดยที่ :math:`0` เป็น (ตามกฎแล้ว) เป็นคลังสินค้า Edge มีจำนวนตัวแปรสองเท่าหรือมากกว่าตัวแปรของ Node ตัวอย่างเช่น ในกราฟแบบเชื่อมต่อกันหมดจะมีตัวแปรทางเลือกแบบไบนารี่ของ Edge ทั้งหมด :math:`n(n+1)` ตัวแปร

source: If two nodes :math:`i` and :math:`j` have a link from :math:`i` to :math:`j`, we write :math:`i \sim j`. We also denote with :math:`\delta(i)^+` the set of nodes to which :math:`i` has a link, i.e., :math:`j \in \delta(i)^+` if and only if :math:`i \sim j`. Similarly, we denote with :math:`\delta(i)^-` the set of nodes which are connected to :math:`i`, in the sense that :math:`j \in \delta(i)^-` if and only if :math:`j \sim i`.
bn_bn: যদি দুটি নোড :math:`i` এবং math:`j` মধ্যে যোগ থাকে :math:`i` থেকে :math:`j` তে,তখন আমরা লিখবো :math:`i \sim j`। এছাড়াও আমরা সেই নোডের সেট টিকে চিহ্নিত করি :math:`\delta(i)^+` দ্বারা যার সাথে :math:`i` একটি যোগাযোগ আছে,যেমন :math:`j \in \delta(i)^+` শুধুমাত্র তখন যখন :math:`i \sim j` । একইরকম ভাবে সেই নোডের সেটকে করি :math:`\delta(i)^-` দ্বারা যেগুলি :math:`i` sathe সংযুক্ত,এই ভাবে যে :math:`j \in \delta(i)^-` শুধুমাত্র তখন যখন :math:`j \sim i`।
es_un: Si dos nodos :math:`i` y :math:`j` tienen un enlace desde :math:`i` a :math:`j`, escribimos :math:`i \sim j`. También denotamos con :math:`\delta(i)^+` el conjunto de nodos a los que :math:`i` tiene un enlace, es decir, :math:`j \in \delta(i)^+` si y solo si :math:`i \sim j`. De manera similar, denotamos con :math:`\delta(i)^-` el conjunto de nodos que están conectados a :math:`i`, en el sentido de que :math:`j \in \delta(i)^-` si y solo si :math:`j \sim i`.
pt_un: Se dois nós :math:`i` e :math:`j` possuem uma ligação de :math:`i` para :math:`j`, escrevemos :math:`i \sim j`. Também denotamos por :math:`\delta(i)^+` o conjunto de nós para os quais :math:`i` possui uma ligação, ou seja, :math:`j \in \delta(i)^+` se, e somente se, :math:`i \sim j`. Semelhantemente, denotamos por :math:`\delta(i)^-` o conjunto de nós, que estão conectados a :math:`i`, no sentido que :math:`j \in \delta(i)^-` se e somente se :math:`j \sim i`.
ta_in: இரண்டு முனைகள் இருந்தால் :math:`i` மற்றும் :math:`j`என்பதிலிருந்து ஒரு இணைப்பு உள்ளது :math:`i` முதல் :math:`j`, நாங்கள் எழுதுகிறோம் :math:`i \sim j`. :math:`\delta(i)^+` எந்த முனைகளின் தொகுப்பு :math:`i` ஒரு இணைப்பு உள்ளது, அதாவது, :math:`j \in \delta(i)^+` என்றால் மற்றும் இருந்தால் மட்டுமே :math:`i \sim j`. இதேபோல், :math:`\delta(i)^-` உடன் இணைக்கப்பட்டுள்ள முனைகளின் தொகுப்பு :math:`i`, அதாவது :math:`j \in \delta(i)^-` என்றால் மற்றும் மட்டும் என்றால் :math:`j \sim i`.
th: ถ้า Node :math:`i` และ Node :math:`j` มีลิงก์เชื่อมจาก :math:`i` ไป :math:`j` เราสามารถเขียนว่า :math:`i \sim j` ได้ และเรากำหนดให้ :math:`\delta(i)^+` เป็นเซตของ Node ที่ :math:`i` เชื่อมต่อด้วย กล่าวคือ :math:`j \in \delta(i)^+` ก็ต่อเมื่อ :math:`i \sim j` ในทำนองเดียวกัน เรากำหนดให้ :math:`\delta(i)^-` เป็นเซตของ Node ที่เชื่อมต่อกับ :math:`i` ในแง่ของ :math:`j \in \delta(i)^-` ก็ต่อเมื่อ :math:`j \sim i`

source: In addition, we consider continuous variables, for all nodes :math:`i = 1,\dots, n`, denoted :math:`u_i`. These variables are needed in the MTZ formulation of the problem to eliminate sub-tours between clients.
bn_bn: উপরন্তু,আমরা বিবেচনা করবো ক্রমাগত চল রাশি ,সমস্ত :math:`i = 1,\dots, n` জন্যে , চিহ্নিত হয় :math:`u_i`। এই চল রাশি গুলি প্রয়োজন সমস্যার এম.টি.জেড. সূত্রে খরিদ্দারের মধ্যে উপ - ভ্রমণ পরিহার করার জন্যে।
es_un: Además, consideramos variables continuas, para todos los nodos :math:`i = 1,\dots, n`, denotadas :math:`u_i`. Estas variables son necesarias en la formulación MTZ del problema para eliminar sub-recorridos entre clientes.
pt_un: Além disto, consideramos variáveis contínuas para todos os nós :math:`i = 1,\dots, n`, denotadas :math:`u_i`. Estas variáveis são necessárias na formulação do MTZ do problema para eliminar subtours entre clientes.
ta_in: கூடுதலாக, எல்லா முனைகளுக்கும் தொடர்ச்சியான மாறிகளைக் கருதுகிறோம் :math:`i = 1,\dots, n`, குறிக்கப்படுகிறது :math:`u_i` வாடிக்கையாளர்களிடையே துணை சுற்றுப்பயணங்களை அகற்ற சிக்கலின் MTZ வடிவமைப்பில் இந்த மாறிகள் தேவைப்படுகின்றன.
th: เพิ่มเติม เราสนใจตัวแปรต่อเนื่องสำหรับทุก ๆ Node :math:`i = 1,\dots, n` ของ :math:`u_i` ตัวแปรเหล่านี้จำเป็นสำหรับการจัดรูปสมการ MTZ ของโจทย์ปัญหา เพื่อจัดการกับเส้นการเดินทางย่อยระหว่างสถานที่ของลูกค้า

source: The VRP can be formulated as:
bn_bn: ভি.পি.আর. টিকে সুত্রাইত করা যাবে এই ভাবে:
es_un: El VRP puede formularse como:
pt_un: O VRP pode ser formulado como:
ta_in: VRP இவ்வாறு வடிவமைக்கப்படலாம்:
th: เราสามารถจัดรูปสมการ VRP ได้เป็น:

source: subject to the node-visiting constraint:
bn_bn: নোড-পরিদর্শন সীমাবদ্ধতা সাপেক্ষে:
es_un: sujeto a la restricción de visita de nodos:
pt_un: sujeito à restrição de visita dos nós:
ta_in: முனை-வருகை தடைக்கு உட்பட்டது:
th: จากข้อจำกัดด้านการผ่านแต่ละ Node ได้ว่า:

source: the depot-visiting constraints:
bn_bn: ডিপো বা গুদামঘর সীমাবদ্ধতা:
es_un: las restricciones de las visitas al depósito:
pt_un: as restrições de visita dos depósitos:
ta_in: டிப்போ-வருகை கட்டுப்பாடுகள்:
th: จากข้อจำกัดด้านการผ่านคลังสินค้าได้ว่า:

source: and the sub-tour elimination constraints:
bn_bn: এবং উপ - ভ্রমণ পরিহার করার সীমাবদ্ধতা:
es_un: y las restricciones de eliminación del sub-recorrido:
pt_un: e as restrições de eliminação de subtour:
ta_in: மற்றும் சுற்றுப்பயணம் நீக்குவதற்கான தடைகள்:
th: และจากข้อจำกัดในการจัดการเส้นการเดินทางย่อยได้ว่า:

source: In particular,
es_un: En particular,
pt_un: Em particular,
ta_in: குறிப்பாக,
th: โดยเฉพาะ

source: The cost function is linear in the cost functions and weighs the different arches based on a positive weight :math:`w_{ij}>0` (typically the distance between node :math:`i` and node :math:`j`);
es_un: La función de costo es lineal en las funciones de costo y pondera los diferentes arcos basados en un peso positivo :math:`w_{ij}>0` (típicamente la distancia entre el nodo :math:`i` y el nodo :math:`j`);
pt_un: A função de custo é linear nas funções de custo e pondera os diferentes arcos baseados em um peso positivo :math:`w_{ij}>0` (normalmente a distância entre o nó :math:`i` e o nó :math:`j`);
ta_in: காஸ்ட் செயல்பாடு, காஸ்ட் செயல்பாடுகளில் நேரியல் மற்றும் நேர்மறை எடையான :math:`w_{ij}>0` (பொதுவாக node :math:`i` மற்றும் node :math:`j`) ஆகியவற்றின் அடிப்படையில் வெவ்வேறு வளைவுகளை எடைபோடும்;
th: ฟังก์ชันวัตถุประสงค์เป็นฟังก์ชันเส้นตรงและถ่วงน้ำหนักในส่วนของสมการที่แตกต่างกันขึ้นอยู่กับค่าถ่วงน้ำหนักเชิงบวก :math:`w_{ij}>0` (โดยทั่วไปคือระยะห่างระหว่าง Node :math:`i` และ Node :math:`j`)
