Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/07_examples_vehicle_routing.po
Languages: bn_bn, es_un, pt_un, ta_in, th

source: From :math:`VRP` one can construct a binary polynomial optimization with equality constraints only by considering cases in which :math:`K=n-1`. In these cases the sub-tour elimination constraints are not necessary and the problem is only on the variable :math:`{\bf z}`. In particular, we can write an augmented Lagrangian as
bn_bn: :math:`VRP` দ্বিমিক (বাইনারি) পলিনমিয়াল বা বহুপদী অপটিমাইজেশন তৈরি করা যেতে পারে সাম্যতার সীমাবদ্ধতার সাথে শুধুমাত্র :math:`K=n-1` অবস্থাগুলি বিবেচনা করে।এই ক্ষেত্রে উপ - ভ্রমণ অপসারণের সীমাবদ্ধতাগুলি প্রয়োজনীয় নয় এবং সমস্যাটি কেবল চল রাশি :math:`{\bf z}` উপর।বিশেষত, আমরা হিসাবে একটি বর্ধিত লাগরঙ্গিয়ান লিখতে পারি
es_un: Del :math:`VRP` se puede construir una optimización polinomial binaria con restricciones de igualdad solo considerando los casos en los que :math:`K=n-1`. En estos casos, las restricciones de eliminación del sub-recorrido no son necesarias y el problema está solamente en la variable :math:`{\bf z}`. En particular, podemos escribir un Lagrangiano aumentado como
pt_un: A partir do :math:`VRP`, pode-se construir uma otimização polinomial binária com restrições de igualdade, apenas considerando casos em que :math:`K=n-1`. Nestes casos, as restrições de eliminação de subtour não são necessárias e o problema é, apenas, na variável :math:`{\bf z}`. Em particular, podemos escrever uma Lagrangiana aumentada como
ta_in: இருந்து :math:`VRP` ஒருவர் பைனரி பல்லுறுப்புறுப்பு தேர்வுமுறையை சமத்துவக் கட்டுப்பாடுகளுடன் உருவாக்க முடியும்: இதில் கணிதத்தை கருத்தில் கொண்டு மட்டுமே :math:`K=n-1`. இந்த சந்தர்ப்பங்களில் துணை-சுற்று நீக்குதல் கட்டுப்பாடுகள் தேவையில்லை மற்றும் சிக்கல் மாறியில் மட்டுமே உள்ளது :math:`{\bf z}`. குறிப்பாக, நாம் ஒரு வளர்ந்த லக்ராங்கியன் என எழுதலாம்
th: จาก :math:`VRP` เราสามารถสร้างเป็นโจทย์ปัญหา Binary Polynomial Optimization โดยที่มีสมการช้อจำกัดได้ โดยสนใจที่กรณีที่ :math:`K=n-1` เพียงอย่างเดียว ในกรณีนี้เราไม่จำเป็นต้องมีสมการข้อจำกัดที่ใช้จัดการกับเส้นทางย่อย และโจทย์ปัญหานี้จะมีเพียงตัวแปร :math:`{\bf z}` เราสามารถเขียนสมการ Lagrangian เสริมได้ว่า

source: where :math:`A` is a big enough parameter.
bn_bn: যেখানে :math:`A` একটি যথেষ্ট বড় পরামিতি।
es_un: donde :math:`A` es un parámetro suficientemente grande.
pt_un: onde :math:`A` é um parâmetro grande o suficiente.
ta_in: எங்கே :math:`A` என்பது ஒரு பெரிய அளவுரு.
th: โดยที่ :math:`A` เป็นพารามิเตอร์ที่มีค่ามากพอสมควร

source: From Hamiltonian to QP formulation
bn_bn: হ্যামিল্টোনিয়ান থেকে কিউ.পি সূত্র
es_un: Del Hamiltoniano a la formulación QP
pt_un: Do Hamiltoniano à formulação da QP
ta_in: ஹாமில்டோனியன் இருந்து QP வடிவமைப்பில் இருந்து
th: การแปลจาก Hamiltonian ไปเป็นสมการ QP

source: In the vector :math:`{\bf z}`, and for a complete graph (:math:`\delta(i)^+ = \delta(i)^- = \{0,1,\dots,i-1,i+1,\dots,n\}`), :math:`H` can be written as follows.
bn_bn: ভেক্টরে :math:`{\bf z}` ক্ষেত্রে এবং একটি সম্পূর্ণ গ্রাফের জন্য (:math:`\delta(i)^+ = \delta(i)^- = \{0,1,\dots,i-1,i+1,\dots,n\}`), :math:`H` এই ভাবে লেখা যেতে পারে লেখা যেতে পারে।
es_un: En el vector :math:`{\bf z}`, y para un grafo completo (:math:`\delta(i)^+ = \delta(i)^- = \{0,1,\dots,i-1,i+1,\dots,n\}`), :math:`H` se puede escribir de la siguiente manera.
pt_un: No vetor :math:`{\bf z}`, e para um grafo completo (:math:`\delta(i)^+ = \delta(i)^- = \{0,1,\dots,i-1,i+1,\dots,n\}`), :math:`H` pode ser escrito da seguinte forma.
ta_in: திசையனில் :math:`{\bf z}`, மற்றும் ஒரு முழுமையான வரைபடத்திற்காக (:math:`\delta(i)^+ = \delta(i)^- = \{0,1,\dots,i-1,i+1,\dots,n\}`) , :math:`H` ஐ பின்வருமாறு எழுதலாம்.
th: ในเวกเตอร์ :math:`{\bf z}` และสำหรับ Complete Graph (:math:`\delta(i)^+ = \delta(i)^- = \{0,1,\dots,i-1,i+1,\dots,n\}`), :math:`H` สามารภเขียนได้ดังนี้

source: That is:
bn_bn: সেটা হলো:
es_un: Esto es:
pt_un: Isto é:
ta_in: அதாவது:
th: นั่นคือ:

source: Where: first term:
bn_bn: যেখানে: প্রথম পদ:
es_un: Donde: el primer término:
pt_un: Onde: primeiro termo:
ta_in: எங்கே: முதல் கால எல்லை:
th: โดย: พจน์แรก:

source: Second term:
bn_bn: দ্বিতীয় পদ:
es_un: El segundo término:
pt_un: Segundo termo:
ta_in: இரண்டாவது கால எல்லை:
th: พจน์สอง:

source: Third term:
bn_bn: তৃতীয় পদ:
es_un: El tercer término:
pt_un: Terceiro termo:
ta_in: மூன்றாம் கால எல்லை:
th: พจน์สาม:

source: The QP formulation of the Ising Hamiltonian is ready for the use of VQE. We will solve the QP using optimization stack available in Qiskit.
bn_bn: আইসিং হ্যামিল্টোনিয়ানের কিউ.পি সূত্রটি ভি.কি.উই ব্যবহারের জন্য প্রস্তুত।আমরা Qiskit উপলব্ধ অপ্টিমাইজেশন স্ট্যাক ব্যবহার করে কিউ.পি সমাধান করব।
es_un: La formulación QP del Hamiltoniano de Ising está lista para el uso de VQE. Resolveremos el QP usando la pila de optimización disponible en Qiskit.
pt_un: A formulação QP do Hamiltoniano de Ising está pronta para uso do VQE. Vamos resolver o QP usando recursos de otimização disponíveis no Qiskit.
ta_in: ஐஸிங் ஹாமில்டோனியனின் QP உருவாக்கம் VQE ஐப் பயன்படுத்த தயாராக உள்ளது. Qiskit-டில் கிடைக்கும் தேர்வுமுறை அடுக்கைப் பயன்படுத்தி QP ஐ தீர்ப்போம்.
th: เมื่อเราจัดรูปของ Ising Hamiltonian แล้วเราสามารถนำมาใช้งานกับ VQE ได้เลย เราจะสามารถใช้ Optimization Stack ของ Qiskit เพื่อแก้โจทย์ QP ได้

source: References
bn_bn: তথ্যসূত্র
es_un: Referencias
pt_un: Referências
ta_in: குறிப்புகள்
th: แหล่งอ้างอิง

source: [2] `Max-Cut and Traveling Salesman Problem <./06_examples_max_cut_and_tsp.ipynb>`__
bn_bn: [২] `সর্বোচ্চ লাভ এবং ভ্রাম্যমান বিক্রেতার সমস্যা <./06_examples_max_cut_and_tsp.ipynb>`__
es_un: [2] `Max-Cut y Problema del Vendedor Viajero <./06_examples_max_cut_and_tsp.ipynb>`__
pt_un: [2] `Max-Cut e Problema do Caixeiro Viajante <./06_examples_max_cut_and_tsp.ipynb>`__

source: Initialization
bn_bn: আরম্ভ
es_un: Inicialización
pt_un: Inicialização
ta_in: துவக்கம்
th: การเตรียมข้อมูลเบื้องต้น

source: First of all we load all the packages that we need. CPLEX is required for the classical computations. You can install it by ``pip install 'qiskit-optimization[cplex]'``.
es_un: En primer lugar, cargamos todos los paquetes que necesitamos. Se requiere CPLEX para los cálculos clásicos. Puedes instalarlo mediante ``pip install 'qiskit-optimization[cplex]'``.

source: We then initialize the variables
bn_bn: তারপরে আমরা চল রাশি গুলি আরম্ভ করব
es_un: Luego inicializamos las variables
pt_un: Inicializamos, então, as variáveis
ta_in: நாம் பின்னர் மாறிகளை துவக்க
th: ถัดไปเราประกาศตัวแปร

source: We define an initializer class that randomly places the nodes in a 2-D plane and computes the distance between them.
bn_bn: আমরা একটি প্রারম্ভক শ্রেণীর সংজ্ঞা প্রদান করি যা এলোমেলোভাবে দ্বিমাত্রিক তালের উপর নোডগুলি রাখে এবং তাদের মধ্যে দূরত্ব গণনা করে।
es_un: Definimos una clase de inicialización que coloca aleatoriamente los nodos en un plano 2-D y calcula la distancia entre ellos.
pt_un: Definimos uma classe inicializadora, que coloca os nós, aleatoriamente, em um plano 2-D e calcula a distância entre eles.
ta_in: 2-D பரப்பை தோராயமாக முனைகளை வைத்து அவற்றுக்கிடையேயான தூரத்தை கணக்கிடும் ஒரு துவக்க வகுப்பை நாங்கள் வரையறுக்கிறோம்.
th: เรากำหนดคลาสชื่อ Initializer เพื่อทำการสุ่มจุดของ Node บนระนาบ 2 มิติ และทำการคำนวนหาระยะห่างระหว่างกัน

source: Classical solution using IBM ILOG CPLEX
bn_bn: প্রথাগত (ক্লাসিক্যাল) সমাধান IBM ILOG CPLEX ব্যাবহার করে।
es_un: Solución clásica utilizando IBM ILOG CPLEX
pt_un: Solução clássica usando o IBM ILOG CPLEX
ta_in: IBM ILOG CPLEX ஐப் பயன்படுத்தி கிளாசிக்கல் தீர்வு
th: ผลเฉลยแบบดั้งเดิมจาก IBM ILOG CPLEX

source: For a classical solution, we use IBM ILOG CPLEX. CPLEX is able to find the exact solution of this problem. We first define a ClassicalOptimizer class that encodes the problem in a way that CPLEX can solve, and then instantiate the class and solve it.
bn_bn: একটি প্রথাগত (ক্লাসিক্যাল) সমাধানের জন্য, আমরা আই.বি.এম আই.এল.ও.জি সি.পি.এল. ই.এক্স IBM ILOG CPLEX ব্যবহার করি। সি.পি.এল.ই.এক্স এই সমস্যার সঠিক সমাধান খুঁজে পেতে সক্ষম। আমরা প্রথমে একটি প্রথাগত (ক্লাসিক্যাল) অপ্টিমাইজার শ্রেণি সংজ্ঞায়িত করি যা এমনভাবে সমস্যাটিকে এনকোড করে যাতে সিপিএলএক্স সমাধান করতে পারে এবং তারপরে ক্লাসটি তাত্ক্ষণিক এবং সেটি সমাধান করে।
es_un: Para una solución clásica, utilizamos IBM ILOG CPLEX. CPLEX puede encontrar la solución exacta de este problema. Primero definimos una clase ClassicalOptimizer que codifica el problema de una manera que CPLEX pueda resolver, y luego instanciamos la clase y la resolvemos.
pt_un: Para uma solução clássica, usamos o IBM ILOG CPLEX. O CPLEX é capaz de encontrar a solução exata deste problema. Definimos uma classe ClassicalOptimizer, que codifica o problema de uma forma que o CPLEX possa resolver e, em seguida, instanciamos a classe e a resolvemos.
ta_in: ஒரு கிளாசிக்கல் தீர்வுக்கு, நாங்கள் IBM ILOG CPLEX ஐப் பயன்படுத்துகிறோம். CPLEX இந்த சிக்கலின் சரியான தீர்வைக் கண்டுபிடிக்க முடியும். CPLEX தீர்க்கக்கூடிய வகையில் சிக்கலைக் குறியீடாக்கும் கிளாசிக்கல் ஆப்டிமைசர் வகுப்பை நாங்கள் முதலில் வரையறுக்கிறோம், பின்னர் வகுப்பை நிறுவி அதைத் தீர்க்கலாம்.
th: สำหรับคำตอบแบบดั้งเดิม เราจะใช้ IBM ILOG CPLEX โดย CPLEX ทำให้เราสามารถหาคำตอบแบบแน่นอนของโจทย์ปัญหานี้ได้ ในขั้นแรก เราสร้างคลาส ClassicalOptimizer ซึ่งเป็นตัวแปลงโจทย์ปัญหาของเราไปอยู่ในรูปที่ CPLEX สามารถแก้ไขได้ และจากนั้นทำการประกาศคลาสและทำงานเพื่อแก้ไขปัญหา

source: If you have CPLEX, the solution shows the depot with a star and the selected routes for the vehicles with arrows.
bn_bn: আপনার যদি সি.পি.এল.ই.এক্স থাকে তবে সমাধানটি তারাচিন্হ দিয়ে ডিপো এবং তীরচিন্হ সহ যানবাহনের জন্য নির্বাচিত রুটগুলি বা পথগুলি দেখায়।
es_un: Si tienes CPLEX, la solución muestra el depósito con una estrella y las rutas seleccionadas para los vehículos con flechas.
pt_un: Se você tem CPLEX, a solução mostra o depósito com uma estrela e as rotas selecionadas para os veículos com flechas.
ta_in: உங்களிடம் CPLEX இருந்தால், தீர்வு நட்சத்திரத்துடன் கூடிய depot யும் அம்புகளுடன் வாகனங்களுக்கான தேர்ந்தெடுக்கப்பட்ட வழிகளையும் காட்டுகிறது.
th: ถ้าคุณมี CPLEX คำตอบที่ได้จะแสดงคลังสินค้าอยู่ในลักษณะดาว และแสดงเส้นทางการเดินทางของยานพาหนะด้วยลูกศร

source: Quantum solution from the ground up
bn_bn: স্থল থেকে কোয়ান্টাম সমাধান
es_un: Solución cuántica desde cero
pt_un: Solução quântica do zero
ta_in: தரையில் இருந்து குவாண்டம் தீர்வு
th: ผลเฉลยแบบควอนตัมตั้งแต่ต้นจนจบ

source: For the quantum solution, we use Qiskit.
bn_bn: কোয়ান্টাম সমাধানের জন্য, আমরা ব্যবহার করি Qiskit
es_un: Para la solución cuántica, utilizamos Qiskit.
pt_un: Para a solução quântica, usamos o Qiskit.
ta_in: குவாண்டம் தீர்வுக்கு, நாங்கள் Qiskit பயன்படுத்துகிறோம்.
th: สำหรับคำตอบแบบควอนตัมนั้น เราใช้ Qiskit

source: First, we derive the solution from the ground up, using a class QuantumOptimizer that encodes the quantum approach to solve the problem and then we instantiate it and solve it. We define the following methods inside the class:
es_un: Primero, derivamos la solución desde cero, usando una clase QuantumOptimizer que codifica el enfoque cuántico para resolver el problema y luego lo instanciamos y lo resolvemos. Definimos los siguientes métodos dentro de la clase:
pt_un: Primeiro, derivamos a solução do zero, usando uma classe QuantumOptimizer que codifica a abordagem quântica para resolver o problema e, em seguida, vamos instanciá-la e resolvê-la. Definimos os seguintes métodos dentro da classe:
ta_in: முதலில், QuantumOptimizer வகுப்பைப் பயன்படுத்தி, சிக்கலைத் தீர்க்கக் குவாண்டம் அணுகுமுறையைக் குறியீடாகப் பயன்படுத்தி, அடிப்படையிலிருந்து தீர்வைப் பெறுகிறோம். வகுப்பில் பின்வரும் முறைகளை நாம் வரையறுக்கிறோம்:
th: ในขั้นตอนแรกเราทำการแปลงโจทย์ปัญหาของเราตั้งแต่ต้นด้วยคลาส QuantumOptimizer ซึ่งเป็นการแปลงให้อยู่ในรูปแบบที่สามารถแก้โจทย์ด้วยวิธีการแบบควินตัมได้ จากนั้นเราทำการแก้โจทย์ เราได้กำหนดกระบวนการเหล่านี้ไว้ใน Method ของคลาส:

source: ``binary_representation`` : encodes the problem :math:`(M)` into a QP terms (that’s basically linear algebra);
es_un: ``binary_representation`` : codifica el problema :math:`(M)` en términos QP (que es básicamente álgebra lineal);
pt_un: ``binary_representation`` : codifica o problema :math:`(M)` em termos de QP (que é basicamente álgebra linear);
ta_in: ``binary_representation`` : ப்ராப்லம் :math:`(M)` ஐ QP விதிமுறைகளாகக் குறியாக்குகிறது (அது அடிப்படையில் நேரியல் இயற்கணிதம்);
th: ``binary_representation`` : แปลงโจทย์ปัญหา :math:`(M)` ไปเป็นะจน์ของ QP (เป็นกระบวนการใน Linear Algebra);

source: ``construct_problem`` : constructs a QUBO optimization problem as an instance of ``QuadraticProgram``;
es_un: ``construct_problem`` : construye un problema de optimización QUBO como una instancia de ``QuadraticProgram``;
pt_un: ``construct_problem`` : constrói um problema de otimização QUBO como uma instância de ``QuadraticProgram``;
ta_in: ``construct_problem`` : QUBO தேர்வுமுறை சிக்கலை ``QuadraticProgram`` இன் உதாரணமாக உருவாக்குகிறது;
th: ``construct_problem`` : สร้างโจทย์ QUBO Optimization problem ในลักษณะของ ``QuadraticProgram``;

source: ``solve_problem``: solves the problem :math:`(M)` constructed at the previous step via ``MinimunEigenOptimizer`` by using ``SamplingVQE`` with default parameters;
es_un: ``solve_problem``: resuelve el problema :math:`(M)` construido en el paso anterior a través del ``MinimunEigenOptimizer`` usando ``SamplingVQE`` con parámetros predeterminados;

source: Step 1
bn_bn: ধাপ 1
es_un: Paso 1
pt_un: Passo 1
ta_in: செயல் 1
th: ขั้นที่ 1

source: Instantiate the quantum optimizer class with parameters:
es_un: Crear una instancia de la clase del optimizador cuántico con parámetros:
pt_un: Instancia a classe de otimizador quântico com os parâmetros:
ta_in: அளவுருக்கள் மூலம் குவாண்டம் ஆப்டிமைசர் வகுப்பை உடனடியாக மாற்றவும்:
th: ประกาศตัวแปรของคลาส Quantum Optimizer ด้วยพารามิเตอร์:

source: the instance;
es_un: la instancia;
pt_un: a instância;
ta_in: உதாரணம்;
th: ตัวแปร;

source: the number of nodes and vehicles ``n`` and ``K``;
es_un: el número de nodos y vehículos ``n`` y ``K``;
pt_un: o número de nós e veículos ``n`` e ``K``;
ta_in: node மற்றும் வாகனங்களின் எண்ணிக்கை ``n`` மற்றும் ``K``;
th: จำนวนของ Node และยานพาหนะคือ ``n`` และ ``K``;

source: Step 2
bn_bn: ধাপ 2
es_un: Paso 2
pt_un: Passo 2
ta_in: செயல் 2
th: ขั้นที่ 2

source: Encode the problem as a binary formulation (IH-QP).
bn_bn: দ্বিমিক (বাইনারি) সুত্র বা গঠনের (আইএইচ-কিউপি) হিসাবে সমস্যাটি এনকোড করুন।
es_un: Codificar el problema como una formulación binaria (IH-QP).
pt_un: Codifique o problema como uma formulação binária (IH-QP).
ta_in: பிரச்சனையை பைனரி வடிவம் (IH-QP) என குறியீடு.
th: แปลงโจทย์ปัญหาให้อยู่ในรูปสมการไบนารี่ (IH-QP)

source: Sanity check: make sure that the binary formulation in the quantum optimizer is correct (i.e., yields the same cost given the same solution).
bn_bn: স্যানিটি বা সদ্বিবেচনা পরীক্ষা: নিশ্চিত করুন যে কোয়ান্টাম অপ্টিমাইজারে দ্বিমিক (বাইনারি) সূত্র বা গঠন সঠিক কিনা (যেমন, একই সমাধানের জন্যে একই ব্যয় হয়)।
es_un: Comprobación: asegurarse que la formulación binaria del optimizador cuántico es correcta (es decir, que da el mismo costo dada la misma solución).
pt_un: Verificação de sanidade: certifique-se de que a formulação binária no otimizador quântico esteja correta (ou seja, produz o mesmo custo dada a mesma solução).
ta_in: நல்லறிவு சோதனை: குவாண்டம் ஆப்டிமைசெர் ஒப்பிடுகையில் பைனரி வடிவம் சரியான (அதாவது, அதே தீர்வு கொடுக்கப்பட்ட ஒரே செலவு) என்று உறுதி செய்கிறது.
th: เตือกสติ: ตรวจสอบให้แน่ใจว่าสมการไบนารี่ใน Quantum Optimizer นั้นถูกต้อง (ผลลัพธ์จากฟังก์ชันวัตถุประสงค์เดียวกันให้คำตอบเหมือนกัน)

source: Step 3
bn_bn: ধাপ 3
es_un: Paso 3
pt_un: Passo 3
ta_in: செயல் 3
th: ขั้นที่ 3

source: Encode the problem as an instance of ``QuadraticProgram``.
bn_bn: সমস্যাটি ``Quadratic Program`` দৃষ্টান্ত (ইনস্ট্যান্স) হিসাবে এনকোড করুন
es_un: Codificar el problema como una instancia de ``QuadraticProgram``.
pt_un: Codifique o problema como uma instância de ``QuadraticProgram``.
ta_in: ``QuadraticProgram`` இன் உதாரணமாக சிக்கலை குறியாக்குக.
th: แปลงโจทย์ปัญหาให้อยู่ในรูปของ ``QuadraticProgram``

source: Step 4
bn_bn: ধাপ 4
es_un: Paso 4
pt_un: Passo 4
ta_in: செயல் 4
th: ขั้นที่ 4

source: Solve the problem via ``MinimumEigenOptimizer`` from the optimization stack. N.B. Depending on the number of qubits, the state-vector simulation can take a while; for example with 12 qubits, it takes more than 12 hours. Logging is useful to see what the program is doing.
bn_bn: অপ্টিমাইজেশন স্ট্যাক থেকে ``MinimumEigenOptimizer``এর মাধ্যমে সমস্যার সমাধান করুন।কুইবিটের সংখ্যার উপর নির্ভর করে, অবস্থা-ভেক্টর সিমুলেশনটি কিছুটা সময় নিতে পারে; উদাহরণস্বরূপ, 12 কুইটসের সাথে এটি 12 ঘন্টােরও বেশি সময় নেয়। প্রোগ্রামটি কী করছে তা দেখতে লগিং দরকারী।
es_un: Resolver el problema a través de ``MinimumEigenOptimizer`` de la pila de optimización. Nótese bien que dependiendo del número de qubits, la simulación de vector de estado puede tardar un poco; por ejemplo, con 12 qubits, se necesitan más de 12 horas. El registro (log) es útil para ver qué está haciendo el programa.
pt_un: Resolva o problema, via ``MinimumEigenOptimizer`` do módulo de otimização. Nota: Dependendo do número de qubits, a simulação statevector pode demorar um pouco; por exemplo, com 12 qubits, leva mais de 12 horas. A criação de logs é útil para ver o que o programa está fazendo.
ta_in: தேர்வுமுறை அடுக்கிலிருந்து ``MinimumEigenOptimizer`` வழியாக சிக்கலைத் தீர்க்கவும். N.B. க்யூபிட்ஸ் எண்ணிக்கையைப் பொறுத்து, நிலை-திசையன் உருவகப்படுத்துதலுக்கு சிறிது நேரம் ஆகலாம்; எடுத்துக்காட்டாக 12 க்யூபிட்ஸ் உடன், இது 12 மணி நேரத்திற்கும் மேலாகும். நிரல் என்ன செய்கிறது என்பதைக் காண பதிவுசெய்தல் பயனுள்ளதாக இருக்கும்.
th: แก้โจทย์ปัญหานี้ด้วย ``MinimumEigenOptimizer`` ใน Optimization Stack หมายเหตุ การทำงานบนเครื่องจำลอง State-Vector จะใช้เวลามากขึ้นตาม จำนวนคิวบิต เช่น 12 คิวบิตใช้เวลามากกว่า 12 ชั่วโมง สามารถตรวจสอบการทำงานของโปรแกรมได้ผ่านทาง Logging

source: Step 5
bn_bn: ধাপ 5
es_un: Paso 5
pt_un: Passo 5
ta_in: செயல் 5
th: ขั้นที่ 5

source: Visualize the solution
bn_bn: সমাধানটি দৃশ্যায়িত করা
es_un: Visualizar la solución
pt_un: Visualize a solução
ta_in: தீர்வு காண்பிக்கவும்
th: แสดงภาพผลลัพธ์

source: The plots present the depot with a star and the selected routes for the vehicles with arrows. Note that in this particular case, we can find the optimal solution of the QP formulation, which happens to coincide with the optimal solution of the ILP.
bn_bn: প্লটগুলি একটি তারা চিন্হ দিয়ে ডিপো এবং তীরচিন্হ গুলি সহকরে যানবাহনের জন্য নির্বাচিত রুটের উপস্থাপন করে। মনে রাখা দরকার যে এই বিশেষ ক্ষেত্রে, আমরা কিউ.পি গঠনের সর্বোত্তম সমাধানটি খুঁজে পেতে পারি, যা আই.এল.পি. র অনুকূল সমাধানের সাথে মিলে যায়।
es_un: Las gráficas presentan el depósito con una estrella y las rutas seleccionadas para los vehículos con flechas. Ten en cuenta que en este caso particular, podemos encontrar la solución óptima de la formulación QP, que coincide con la solución óptima del ILP.
pt_un: Os gráficos apresentam o depósito com uma estrela e as rotas selecionadas para os veículos com flechas. Observe que, neste caso específico, podemos encontrar a solução ideal da formulação do QP, que por acaso coincide com a solução ideal do ILP.
ta_in: அம்புகள் கொண்ட வாகனங்களுக்கான depot ஒரு நட்சத்திரத்தையும், தேர்ந்தெடுக்கப்பட்ட பாதைகளையும் இந்த இடங்கள் வழங்குகின்றன. இந்த குறிப்பிட்ட விஷயத்தில், QP உருவாக்கத்தின் உகந்த தீர்வை நாம் காணலாம், இது ILP இன் உகந்த தீர்வோடு ஒத்துப்போகிறது.
th: ในภาพที่แสดง คลังสินค้าคือดาว และเส้นทางของยานพาหนะแทนด้วยลูกศร หมายเหตุ ในบางกรณีเราสามารถหาคำตอบที่ดีที่สุดของสมการ QP ได้ ซึ่งมีค่าตรงกับคำตแบที่ดีที่สุดของ ILP

source: Keep in mind that VQE is an heuristic working on the QP formulation of the Ising Hamiltonian, though. For suitable choices of A, local optima of the QP formulation will be feasible solutions to the ILP. While for some small instances, as above, we can find optimal solutions of the QP formulation which coincide with optima of the ILP, finding optimal solutions of the ILP is harder than finding local optima of the QP formulation, in general, which in turn is harder than finding feasible solutions of the ILP. Even within the VQE, one may provide stronger guarantees, for specific variational forms (trial wave functions).
bn_bn: মনে রাখতে হবে যে ভি.কিউ.ই হ'ল আইসিং হ্যামিল্টোনিয়ানএর কিউ.পি গঠনের বিষয়ে একটি হিউরিস্টিক তাত্ত্বিক কাজ।এ( A)- এর পছন্দের চয়নের জন্যে,কিউপি সূত্রের বা গঠনের স্থানীয় অনুকূলতা আইএলপির সম্ভাব্য সমাধান হবে। কিছু ছোট দৃষ্টান্ত (ইনস্ট্যান্স) জন্য, যেমন উপরে, আমরা কিউ.পি. গঠনের সর্বোত্তম সমাধানগুলি খুঁজে পেতে পারি যা আই.এল.পি. এর অনুকূলতার সাথে মিলে যায়, আই.এল.পি.র সর্বোত্তম সমাধানগুলি সন্ধান করা কিউপি গঠনের স্থানীয় অনুকূল সন্ধানের চেয়ে শক্ত, সাধারণভাবে, যা আবার আই.এল.পি.র সম্ভাব্য সমাধানগুলি খুঁজে পাওয়ার চেয়ে শক্ত। এমনকি ভি.কিউ.ই-র মধ্যে, কেউ নির্দিষ্ট পরিবর্তনশীল (ভ্যারিয়েশনাল)ফর্মের জন্য (ট্রায়াল ওয়েভ ফাংশন) আরও দৃঢ় প্রতিশ্রুত হতে পারে।
es_un: Ten en cuenta que VQE es una heurística que trabaja en la formulación QP del Hamiltoniano de Ising. Para elecciones adecuadas de A, los óptimos locales de la formulación de QP serán soluciones factibles para el ILP. Mientras que para algunos casos pequeños, como el anterior, podemos encontrar soluciones óptimas de la formulación QP que coincidan con los óptimos del ILP, encontrar soluciones óptimas del ILP es más difícil que encontrar los óptimos locales de la formulación QP, en general, que a su vez es más difícil que encontrar soluciones viables del ILP. Incluso dentro del VQE, se pueden proporcionar garantías más sólidas, para formas variacionales específicas (funciones de onda de prueba).
pt_un: Tenha em mente, no entanto, que o VQE é uma heurística trabalhando na formulação do QP do Hamiltoniano de Ising. Para escolhas adequadas de A, ótimos locais da formulação de QP serão soluções viáveis para o ILP. Enquanto que, para algumas pequenas instâncias, como acima, podemos encontrar soluções ideais da formulação do QP, que coincidem com a ótima do ILP, encontrar soluções ideais do ILP é mais difícil, do que encontrar ótimos locais da formulação do QP, em geral, o que por sua vez é mais difícil do que encontrar soluções factíveis do ILP. Mesmo dentro do VQE, pode-se fornecer garantias mais fortes, para formas variacionais específicas (funções de onda tentativa).
ta_in: VQE என்பது Ising Hamiltonianனின் QP உருவாக்கத்தில் ஒரு heuristic வேலை என்பதை நினைவில் கொள்ளுங்கள். A இன் பொருத்தமான தேர்வுகளுக்கு, QP உருவாக்கத்தின் உள்ளூர் உகந்த தன்மை ILP க்கு சாத்தியமான தீர்வுகளாக இருக்கும். சில சிறிய நிகழ்வுகளுக்கு, மேலே குறிப்பிட்டபடி, QP சூத்திரத்தின் உகந்த தீர்வுகளை நாம் காணலாம், இது ILP யின் உகந்த தன்மையுடன் ஒத்துப்போகிறது, ஐஎல்பியின் உகந்த தீர்வுகளைக் கண்டறிவது QP சூத்திரத்தின் உள்ளூர் உகந்ததைக் கண்டுபிடிப்பதை விட கடினமானது, பொதுவாக, இது ILP இன் சாத்தியமான தீர்வுகளைக் கண்டுபிடிப்பதை விட கடினம். VQE க்குள் கூட, குறிப்பிட்ட மாறுபட்ட வடிவங்களுக்கு (சோதனை அலை செயல்பாடுகள்) ஒருவர் வலுவான உத்தரவாதங்களை வழங்கலாம்.
th: ให้คิดไว้เสมอว่า VQE นั้นเป็นการทำงานแบบ Heuristic จากสมการ QP ของ Ising Hamiltonian สำหรับตัวเลือกที่เหมาะสมของ A คำตอบของสมการ QP จะเป็นค่าที่ดีที่สุดแบบ Local ซึ่งสามารถเป็นคำตอบของ ILP ได้ ในขณะที่ในบางกรณีส่วนน้อยที่เราอาจจะสามารถหาค่าที่ดีที่สุดของสมการ QP ได้ ซึ่งเป็นคำตอบที่ดีที่สุดของ ILP เช่นกัน ในการหาคำตอบที่ดีที่สุดของ ILP นั้นเป็นเรื่องยากกกว่าการหาคำตอบแบบ Local แม้แต่ด้วยการใช้ VQE ก็ไม่สามารถหาคำตอบที่ดีที่สุดได้เสมอ แต่อาจจะสามารถหาคำตอบที่ดีที่สุดได้ง่ายกว่าในบางโจทย์กับฟังก์ชันคลื่นทดสอบบางตัว

source: Following [5], the algorithm can be summarized as follows:
bn_bn: [৫] অনুসরণ করে প্রাপ্ত ধারাক্রমটি (অ্যালোগরিদম) নিম্নরূপ:
ta_in: [5] ஐத் தொடர்ந்து, வழிமுறையை பின்வருமாறு சுருக்கலாம்:
