Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/07_examples_vehicle_routing.po
Languages: bn_bn, es_un, pt_un, ta_in, th

source: First of all we load all the packages that we need: - Python 3.6 or greater is required; - CPLEX 12.8 or greater is required for the classical computations; - Latest Qiskit is required for the quantum computations.
bn_bn: সবার আগে আমরা আমাদের প্রয়োজনীয় সমস্ত প্যাকেজ লোড করি: - পাইথন3.6 বা ততোধিক প্রয়োজন; - CPLEX 12.8 বা তারও উন্নত প্রয়োজন প্রথাগত (ক্লাসিক্যাল) গননা বা কম্পিউটেশেনর জন্য প্রয়োজনীয়; - কোয়ান্টাম গণনার জন্য সর্বশেষতম Qiskit প্রয়োজন।
ta_in: முதலில் நமக்குத் தேவையான அனைத்து தொகுப்புகளையும் ஏற்றுவோம்: - பைதான் 3.6 அல்லது அதற்கு மேற்பட்டது தேவை; - கிளாசிக்கல் கணக்கீடுகளுக்கு CPLEX 12.8 அல்லது அதற்கு மேற்பட்டது தேவைப்படுகிறது; - குவாண்டம் கணக்கீடுகளுக்கு சமீபத்திய Qiskit தேவை.

source: ``solve_problem``: solves the problem :math:`(M)` constructed at the previous step via ``MinimunEigenOptimizer`` by using VQE with default parameters;
ta_in: ``solve_problem``: இயல்புநிலை அளவுருக்களுடன் VQE ஐப் பயன்படுத்தி ``MinimunEigenOptimizer`` வழியாக முந்தைய கட்டத்தில் கட்டப்பட்ட சிக்கல் :math:`(M)` -ஐத் தீர்க்கிறது;
