Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/07_examples_vehicle_routing.po
Languages: bn_bn, es_un, pt_un, ta_in, th

source: The first set of constraints enforce that from and to every client, only one link is allowed;
es_un: El primer conjunto de restricciones impone que desde y hacia cada cliente, solo se permite un enlace;
pt_un: O primeiro conjunto de restrições impõe que de e para cada cliente, somente uma ligação é permitida;
ta_in: ஒவ்வொரு வாடிக்கையாளரிடமிருந்தும், ஒரே ஒரு இணைப்பு மட்டுமே அனுமதிக்கப்படும் என்பதை முதலில் அமைக்கப்பட்ட கட்டுப்பாடுகள் செயல்படுத்துகின்றன;
th: สมการข้อจำกัดเซตแรกเป็นตัวทำให้จากสถานที่ของลูกค้าคนหนึ่ง คนไปคนถึงสถานที่ของลูกค้าอีกคนหนึ่งนั้นสามารถมีลิงก์เชื่อมได้แค่ 1 ครั้ง;

source: The second set of constraints enforce that from and to the depot, exactly :math:`K` links are allowed;
es_un: El segundo conjunto de restricciones impone que desde y hacia el depósito, se permiten exactamente :math:`K` enlaces;
pt_un: O segundo conjunto de restrições impõe que de e para o depósito, são permitidas exatamente :math:`K` ligações;
ta_in: இரண்டாவது செட் கட்டுப்பாடுகள் டிப்போவிலிருந்து மற்றும் டிப்போவிற்குச் சரியாக :math:`K` இணைப்புகள் மட்டுமே அனுமதிக்கப்படுகின்றன;
th: สมการข้อจำกัดเซตที่สองเป็นตัวควบคุมให้การเดินทางจากคลังสินค้า และกลับมาที่คลังสินค้านั้นมีลิงก์เกิดึ้นได้เพียง :math:`K` ลิงก์เท่านั้น;

source: The third set of constraints enforce the sub-tour elimination constraints and are bounds on :math:`u_i`, with :math:`Q>q_j>0`, and :math:`Q,q_i \in \mathbb{R}`.
es_un: El tercer conjunto de restricciones impone las restricciones de eliminación del sub-recorrido y son cotas en :math:`u_i`, con :math:`Q>q_j>0`, y :math:`Q,q_i \in \mathbb{R}`.
pt_un: O terceiro conjunto de restrições impõe as restrições de eliminação do sub-tour e são limitadas em :math:`u_i`, com :math:`Q>q_j>0`, e :math:`Q,q_i \in \mathbb{R}`.
ta_in: மூன்றாவது செட் கட்டுப்பாடுகள் துணை சுற்றுப்பயணக் கட்டுப்பாடுகளைச் செயல்படுத்துகின்றன, மேலும் அவை :math:`u_i` இல் வரம்புகள், :math:`Q>q_j>0` மற்றும் :math:`Q,q_i \in \mathbb{R}` உடன்.
th: ในสมการข้อจำกัดเซตที่สามเป็นตัวควบคุมให้กำจัดเส้นทางย่อยออก และเป็นขอบเขตของ :math:`u_i` โดยที่ :math:`Q>q_j>0` และ :math:`Q,q_i \in \mathbb{R}`

source: Classical solution
bn_bn: প্রথাগত (ক্লাসিক্যাল) সমাধান
es_un: Solución clásica
pt_un: Solução clássica
ta_in: கிளாசிக்கல் தீர்வு
th: วิธีการแบบดั้งเดิม

source: We can solve the VRP classically, e.g., by using CPLEX. CPLEX uses a branch-and-bound-and-cut method to find an approximate solution of the VRP, which, in this formulation, is a mixed-integer linear program (MILP). For the sake of notation, we pack the decision variables in one vector as
bn_bn: আমরা সি.পি.এল.এক্স ব্যবহার করে ক্লাসিকালি বা প্রথাগত ভি.আর.পি সমাধান করতে পারি। ভি.আর.পি-র একটি আনুমানিক সমাধান খুঁজে পেতে সি.পি.এল.এক্স একটি শাখা-এবং-সীমাবদ্ধ এবং কাটা( ব্রাঞ্চ অ্যান্ড বউন্ড অ্যান্ড কাট) পদ্ধতি ব্যবহার করে, যা এই সূচনায়, একটি মিশ্র-পূর্ণসংখ্যার লিনিয়ার প্রোগ্রাম (এম.আই.এল.পি)।স্বরলিপিটির খাতিরে, আমরা সিদ্ধান্ত চল রশিগুলিকে গুচ্ছ করি একটিি ভেক্টরে যেমন
es_un: Podemos resolver el VRP de forma clásica, por ejemplo, utilizando CPLEX. CPLEX usa un método de bifurcación, unión y corte para encontrar una solución aproximada del VRP, que, en esta formulación, es un programa lineal de enteros mixtos (MILP). En aras de la notación, empaquetamos las variables de decisión en un vector como
pt_un: Podemos resolver o VRP, classicamente, por exemplo, usando CPLEX. CPLEX usa um método branch-and-bound-and-cut para encontrar uma solução aproximada para o VRP, que nesta formulação é um programa linear inteiro misto (MILP). Para fins de notação, empacotamos as variáveis de decisão em um vetor como
ta_in: CPLEX பயன்படுத்துவதன் மூலம் VRP யை கிளாசிக்கலாக தீர்க்க முடியும், எ.கா. CPLEX VRP யின் தோராயமான தீர்வைக் கண்டுபிடிக்க ஒரு கிளை மற்றும் பிணைப்பு மற்றும் வெட்டு முறையைப் பயன்படுத்துகிறது, இது இந்த சூத்திரத்தில், ஒரு கலப்பு-முழு எண் நேரியல் நிரல் (MILP) ஆகும். குறியீட்டின் பொருட்டு, ஒரு திசையனில் முடிவு மாறிகள் பேக் செய்கிறோம்
th: เราสามารถหาคำตอบของโจทย์ปัญหา VRP ด้วยอัลกอริทึมแบบดั้งเดิมได้ เช่นการใช้ CPLEX โดย CPLEX เป็นการใช้เทคนิค Branch-and-Bound-and-Cut เพื่อหาผลลัพธ์แบบประมาณค่าของ VRP ซึ่งเป็นลักษณะของ Mixed-Integer Linear Program (MILP) โดยเพื่อประโยชน์ของการใช้งานสัญกรณ์นี้ เราจะรวมตัวแปรตัดสินใจไว้เป็นเวกเตอร์

source: wherein :math:`{\bf z} \in \{0,1\}^N`, with :math:`N = n (n+1)`. So the dimension of the problem scales quadratically with the number of nodes. Let us denote the optimal solution by :math:`{\bf z}^*`, and the associated optimal cost :math:`f^*`.
bn_bn: যার মধ্যে: :math:`{\bf z} \in \{0,1\}^N`, সাথে :math:`N = n (n+1)`।সুতরাং সমস্যাটির মাত্রা নোডের সংখ্যার সাথে চতুর্ভুজ ভাবে স্কেল করে।আসুন আমরা সর্বোত্তম সমাধানটি :math:`{\bf z}^*` এর দ্বারা চিহ্নিত করি, এবং সম্পর্কিত সর্বাপেক্ষা কাম্য ব্যয় :math:`f^*`।
es_un: donde :math:`{\bf z} \in \{0,1\}^N`, con :math:`N = n (n+1)`. Entonces, la dimensión del problema se escala cuadráticamente con el número de nodos. Denotemos la solución óptima con :math:`{\bf z}^*`, y el costo óptimo asociado :math:`f^*`.
pt_un: onde :math:`{\bf z} \in \{0,1\}^N`, com :math:`N = n (n+1)`. Portanto, a dimensão do problema escala, quadraticamente, com o número de nós. Vamos denotar a solução ideal por :math:`{\bf z}^*`, e o custo ideal associado :math:`f^*`.
ta_in: இதில் :math:`{\bf z} \in \{0,1\}^N` , உடன் :math:`N = n (n+1)`. எனவே சிக்கலின் பரிமாணம் முனைகளின் எண்ணிக்கையுடன் இருபடி அளவிடுகிறது. இதன் மூலம் உகந்த தீர்வைக் குறிப்பிடுவோம் :math:`{\bf z}^*`, மற்றும் அதனுடன் தொடர்புடைய உகந்த செலவு: :math:`f^*`.
th: ในส่วน :math:`{\bf z} \in \{0,1\}^N` โดยที่ :math:`N = n (n+1)` ดังนั้นมิติของโจทย์ปัญหานี้จะเติบโตขึ้นในลักษณะกำลังสองของจำนวน Node ทำให้เราสามารถระบุคำตอบที่ดีที่สุดของโจทย์ปัญหานี้ได้ด้วย :math:`{\bf z}^*` และค่าฟังก์ชันวัตถุประสงค์ที่ดีที่สุดคือ :math:`f^*`.

source: Quantum solution
bn_bn: কোয়ান্টাম সমাধান
es_un: Solución cuántica
pt_un: Solução quântica
ta_in: குவாண்டம் தீர்வு
th: วิธีการแบบควอนตัม

source: Here, we demonstrate an approach that combines classical and quantum computing steps, following the quantum approximate optimization approach of Farhi, Goldstone, and Gutmann (2014). In particular, we use the variational quantum eigensolver (VQE). We stress that given the use of limited depth of the quantum circuits employed (variational forms), it is hard to discuss the speed-up of the algorithm, as the solution obtained is heuristic in nature. At the same time, due to the nature and importance of the target problems, it is worth investigating heuristic approaches, which may be worthwhile for some problem classes.
bn_bn: এখানে, আমরা একটি পদ্ধতির প্রদর্শন করি যা ক্লাসিক্যাল এবং কোয়ান্টাম কম্পিউটিং পদক্ষেপের সংমিশ্রণ করে, ফারহী, গোল্ডস্টোন এবং গুটম্যান (২০১৪) এর কোয়ান্টাম আনুমানিক অপ্টিমাইজেশন পদ্ধতির অনুসরণ করে।বিশেষত, আমরা ভেরিয়েশনাল কোয়ান্টাম আইজেনসলভার (ভিকিউই) ব্যবহার করি।আমরা জোর দিয়েছি যে নিযুক্ত কোয়ান্টাম বর্তনী বা সার্কিটগুলির (ভেরিয়েশনাল ফর্ম)সীমিত গভীরতার ব্যবহারের কারণে,অ্যালগরিদমের গতি বাড়ানো নিয়ে আলোচনা করা শক্ত, কারণ প্রাপ্ত সমাধানটি প্রকৃতিতে হিউরিস্টিক বা তাত্ত্বিক । একই সময়ে, লক্ষ্য বা টার্গেট সমস্যার প্রকৃতি এবং গুরুত্বের কারণে, বৈজ্ঞানিক বা তাত্ত্বিক পদ্ধতির তদন্ত মূল্যবান, যা কিছু সমস্যা শ্রেণীর জন্য উপযুক্ত হতে পারে।
es_un: Aquí, demostramos un enfoque que combina los pasos de la computación clásica y cuántica, siguiendo el enfoque de optimización cuántica aproximada de Farhi, Goldstone y Gutmann (2014). En particular, utilizamos el solucionador propio cuántico variacional (variational quantum eigensolver, VQE). Destacamos que dado el uso de profundidad limitada de los circuitos cuánticos empleados (formas variacionales), es difícil discutir la aceleración del algoritmo, ya que la solución obtenida es de naturaleza heurística. Al mismo tiempo, debido a la naturaleza e importancia de los problemas de destino, vale la pena investigar enfoques heurísticos, que pueden ser útiles para algunas clases de problemas.
pt_un: Aqui, demonstraremos uma abordagem que combina etapas da computação clássica e quântica, seguindo a abordagem de otimização aproximada quântica de Farhi, Goldstone e Gutman (2014). Em particular, utilizaremos o algoritmo **Variational Quantum Eigensolver (VQE)**. Salientamos que, dada a profundidade limitada dos circuitos quânticos empregados (formas variacionais), é difícil discutir o *speedup* do algoritmo, já que a solução obtida é heurística por natureza. Ao mesmo tempo, devido à natureza e à importância dos problemas alvo, vale a pena investigar abordagens heurísticas, que podem valer a pena para algumas classes de problemas.
ta_in: இங்கே, ஃபார்ஹி, கோல்ட்ஸ்டோன் மற்றும் குட்மேன் (2014) ஆகியவற்றின் குவாண்டம் தோராயமான தேர்வுமுறை அணுகுமுறையைப் பின்பற்றி, கிளாசிக்கல் மற்றும் குவாண்டம் கம்ப்யூட்டிங் படிகளை ஒருங்கிணைக்கும் ஒரு அணுகுமுறையை நாங்கள் நிரூபிக்கிறோம். குறிப்பாக, நாம் மாறுபாடு குவாண்டம் ஐஜென்சால்வர் (VQE). பயன்படுத்தப்படும் குவாண்டம் சுற்றுகளின் வரையறுக்கப்பட்ட ஆழத்தைப் பயன்படுத்துவதால் (மாறுபாடு வடிவங்கள்), அல்காரிதத்தின் வேகத்தைப் பற்றி விவாதிப்பது கடினம், ஏனெனில் பெறப்பட்ட தீர்வு இயற்கையில் ஹியூரிஸ்டிக் ஆகும். அதே நேரத்தில், இலக்கு பிரச்சினைகளின் தன்மை மற்றும் முக்கியத்துவம் காரணமாக, சில சிக்கல் வகுப்புகளுக்கு பயனுள்ள துரபூர்வ அணுகுமுறைகளை ஆராய்வது மதிப்புக்குரியது.
th: ในส่วนนี้เราสาธิตวิธีการที่รวมวิธีการแบบดั้งเดิมและวิธีการแบบควอนตัมเข้าด้วยกัน ในลักษณะวิธีการแบบ Quantum Approximate Optimization ของ Farhi, Goldstonem และ Gutmann (2014) โดยรายละเอียดแล้วเราใช้ Variational Quantum Eigensolver (VQE) เราเน้นว่าด้วยข้อจำกัดในด้านความลึกของวงจรควอนตัมที่ใช้ (ในรูปแบบตัวแปร) ทำให้เป็นเรื่องยากในการบอกว่าอัลกอริทึมนี้จะมีความเร็วมากกว่าอัลกอริทึมแบบดั้งเดิมหรือไม่จากการที่คำตอบนั้นได้มาในลักษณะของ Heuristic แต่ในขณะเดียวกันเนื่องด้วยความสำคัญของปัญหานี้ มันจึงเป็นการคุ้มค่าที่จะลองทดสอบวิธีการแบบ Heuristic ซึ่งอาจจะคุ้มค่าสำหรับบางโจทย์ปัญหา

source: The algorithm can be summarized as follows:
es_un: El algoritmo puede resumirse de la siguiente manera:

source: Preparation steps:
bn_bn: প্রস্তুতির ধাপ:
es_un: Pasos de preparación:
pt_un: Etapas de preparação:
ta_in: தயாரிப்பு படிகள்:
th: ขั้นตอนเตรียม:

source: Transform the combinatorial problem into a binary polynomial optimization problem with equality constraints only;
bn_bn: সমাবেশ সমস্যাটিকে একটা সমতা শর্তসাপেক্ষ দ্বিমিক (বাইনারি) বহুরাশিক অনুকূলায়ন (অপ্টিমাইজেশন) সমস্যায় রূপান্তর;
es_un: Transformar el problema combinatorio en un problema de optimización de polinomios binarios con restricciones de igualdad solamente;
pt_un: Transforme o problema combinatório em um problema de otimização polinomial binário apenas com restrições de igualdade;
ta_in: ஒருங்கிணைந்த பிரச்சனையை சமநிலை கட்டுப்பாடுகளுடன் மட்டுமே பைனரி பல்லுறுப்பு தேர்வுமுறை பிரச்சனையாக மாற்றவும்;
th: ทำการแปลงโจทย์ปัญหา Combinatorial ไปเป็นโจทย์ปัญหา Binary Polynomial Optimization โดยให้มีเพียงสมการข้อจำกัดเท่านั้น;

source: Map the resulting problem into an Ising Hamiltonian (:math:`H`) for variables :math:`{\bf z}` and basis :math:`Z`, via penalty methods if necessary;
bn_bn: :math:`{\bf z}` এবং বেসিস(ভিত্তি) :math:`Z` চলরাশির জন্য প্রাপ্ত সমস্যা একটা আইসিং হ্যামিল্টোনিয়ান (:math:`H`) -এ চিত্রায়িত করা, প্রয়োজনে শাস্তিমূলক (পেনাল্টি) পদ্ধতি ব্যবহার করে।
es_un: Mapear el problema resultante en un Hamiltoniano Ising (:math:`H`) para las variables :math:`{\bf z}` y la base :math:`Z`, mediante métodos de penalización si es necesario;
pt_un: Mapeie o problema resultante em um Hamiltoniano de Ising (:math:`H`) para as variáveis :math:`{\bf z}` e a base :math:`Z`, via métodos de penalidade se necessário;
ta_in: இதன் விளைவாக வரும் சிக்கலை ஐசிங் ஹாமில்டோனியனாக வரைபடமாக்குங்கள் (:math:`H`) மாறிகளுக்கு :math:`{\bf z}` மற்றும் அடிப்படை :math:`Z`, தேவைப்பட்டால் அபராதம் முறைகள் மூலம்;
th: แปลงสมการปัญหาที่ได้ไปเป็น Ising Hamiltonian (:math:`H`) สำหรับตัวแปร :math:`{\bf z}` และ Basis :math:`Z` ด้วยการทำเป็นบทลงโทษ ถ้าจำเป็นต้องใช้;

source: Choose the depth of the quantum circuit :math:`m`. Note that the depth can be modified adaptively.
bn_bn: কোয়ান্টাম সার্কিট :math:`m -র গভীরতা চয়ন করুন: । টীকা: গভীরতাটি অভিযোজিতভাবে সংশোধন করা যেতে পারে।
es_un: Elegir la profundidad del circuito cuántico :math:`m`. Se debe tener en cuenta que la profundidad se puede modificar de forma adaptativa.
pt_un: Escolha a profundidade do circuito quântico :math:`m`. Observe que a profundidade pode ser modificada adaptativamente.
ta_in: குவாண்டம் சுற்றுகளின் ஆழத்தைத் தேர்வுசெய்க :math:`m`. ஆழத்தை தகவமைப்புக்கு மாற்றியமைக்க முடியும் என்பதை நினைவில் கொள்க.
th: เลือกความลึกของวงจรควอนตัม :math:`m` หมายเหตุ ความลึกสามารถปรับได้ในภายหลัง

source: Choose a set of controls :math:`\theta` and make a trial function :math:`\big|\psi(\boldsymbol\theta)\rangle`, built using a quantum circuit made of C-Phase gates and single-qubit Y rotations, parameterized by the components of :math:`\boldsymbol\theta`.
bn_bn: একটা নিয়ন্ত্রণকারীর সেট :math:`\theta` নির্বাচিত করে একটা পরীক্ষা ফাংশন :math:`\big|\psi(\boldsymbol\theta)\rangle` বানানো হলো, যেটা একটা কোয়ান্টাম বর্তনী (সার্কিট) যেটা আবার C-Phase গেট এবং একক কিউবিট Y ঘূর্ণন যাতে প্যারামিটাররূপে :math:`\boldsymbol\theta` -এর বিভিন্ন অংশ আছে।
es_un: Elegir un conjunto de controles :math:`\theta` y crear una función de prueba :math:`\big|\psi(\boldsymbol\theta)\rangle`, construida usando un circuito cuántico hecho de compuertas C-Phase y rotaciones Y de un solo qubit, parametrizada por los componentes de :math:`\boldsymbol\theta`.
pt_un: Escolha um conjunto de controles :math:`\theta` e faça uma função de teste :math:`\big|\psi(\boldsymbol\theta)\rangle`, construída usando um circuito quântico feito de portas C-Fase e rotações Y de um único qubit, parametrizadas pelos componentes de :math:`\boldsymbol\theta`.
ta_in: கட்டுப்பாடுகளின் தொகுப்பைத் தேர்ந்தெடுக்கவும் :math:`\theta` மற்றும் ஒரு சோதனை செயல்பாடு :math:`\big|\psi(\boldsymbol\theta)\rangle`,சி-கட்ட கேட்ஸ் மற்றும் ஒற்றை-க்யூபிட் Y சுழற்சிகளால் செய்யப்பட்ட குவாண்டம் சர்க்யூட்டைப் பயன்படுத்தி கட்டப்பட்டது :math:`\boldsymbol\theta`.
th: เลือกตัวควบคุม :math:`\theta` ขึ้นมาเซตหนึ่งและสร้างฟังก์ชันทดสอบ :math:`\big|\psi(\boldsymbol\theta)\rangle` โดยสร้างขึ้นด้วยวงจรควอนตัมที่ภายในประกอบไปด้วยควอนตัมเกต C-Phase และ Single-Qubit Y Rotations โดยมีส่วนที่เป็นพารามิเตอร์คือส่วน :math:`\boldsymbol\theta`

source: Algorithm steps:
bn_bn: অ্যালগরিদম / ধরাক্রম পদক্ষেপ:
es_un: Pasos del algoritmo:
pt_un: Etapas do algoritmo:
ta_in: வழிமுறை படிகள்:
th: ขั้นตอนของอัลกอริทึม:

source: Evaluate :math:`C(\boldsymbol\theta) = \langle\psi(\boldsymbol\theta)\big|H\big|\psi(\boldsymbol\theta)\rangle` by sampling the outcome of the circuit in the Z-basis and adding the expectation values of the individual Ising terms together. In general, different control points around :math:`\boldsymbol\theta` have to be estimated, depending on the classical optimizer chosen.
bn_bn: মূল্যায়ন কর :math:`C(\boldsymbol\theta) = \langle\psi(\boldsymbol\theta)\big|H\big|\psi(\boldsymbol\theta)\rangle` জেড(Z) বেসিস বা ভিত্তিতে বর্তনীর (সার্কিট) ফলাফল গুলি নমুনা (স্যাম্পল) করে এবং একসাথে পৃথক আইসিং পদগুলির প্রত্যাশিত মান যুক্ত করে। সাধারণভাবে,:math:`\boldsymbol\theta` চারপাশে বিভিন্ন নিয়ন্ত্রণ বিন্দুগুলি বেছে নেওয়া প্রথাগত (ক্লাসিক্যাল) অনুকূলায়ক বা অপ্টিমাইজারের উপর নির্ভর করে অনুমান করতে হবে।
es_un: Evaluar :math:`C(\boldsymbol\theta) = \langle\psi(\boldsymbol\theta)\big|H\big|\psi(\boldsymbol\theta)\rangle` muestreando el resultado del circuito en la base Z y sumando los valores esperados de los términos Ising individuales. En general, se deben estimar diferentes puntos de control alrededor de :math:`\boldsymbol\theta`, dependiendo del optimizador clásico elegido.
pt_un: Avalie :math:`C(\boldsymbol\theta) = \langle\psi(\boldsymbol\theta)\big|H\big|\psi(\boldsymbol\theta)\rangle` amostrando o resultado do circuito na base Z e adicionando os valores esperados dos termos de Ising individuais. Em geral, diferentes pontos de controle em torno de :math:`\boldsymbol\theta` têm que ser estimados, dependendo do otimizador clássico escolhido.
ta_in: மதிப்பீடு :math:`C(\boldsymbol\theta) = \langle\psi(\boldsymbol\theta)\big|H\big|\psi(\boldsymbol\theta)\rangle` சுற்றுவட்டத்தின் மாதிரியை மாதிரியாகக் கொண்டு Z- அடிப்படை மற்றும் தனிப்பட்ட ஐசிங் சொற்களின் எதிர்பார்ப்பு மதிப்புகளை ஒன்றாகச் சேர்ப்பது. பொதுவாக, வெவ்வேறு கட்டுப்பாட்டு புள்ளிகள் :math:`\boldsymbol\theta` மதிப்பிடப்பட வேண்டும், இது தேர்ந்தெடுக்கப்பட்ட கிளாசிக்கல் ஆப்டிமைசரைப் பொறுத்து.
th: จัดการกับ :math:`C(\boldsymbol\theta) = \langle\psi(\boldsymbol\theta)\big|H\big|\psi(\boldsymbol\theta)\rangle` ด้วยการสุ่มตัวอย่างจากผลลัพธ์ขของวงจรด้วย Z-basis และนำค่าความคาดหวังของแต่ละพจน์ของโมเดล Ising มารวมกัน โดยทั่วไปแล้วเราจะต้องประมาณค่าผลลัพธ์ของจุดควบคุมรอบ ๆ :math:`\boldsymbol\theta` ด้วย ขึ้นอยู่กับ Optimizer แบบดั้งเดิมที่ใช้

source: Use a classical optimizer to choose a new set of controls.
bn_bn: নতুন সেট নিয়ন্ত্রণ চয়ন করতে একটি প্রথাগত (ক্লাসিক্যাল) অনুকূলায়ক বা অপ্টিমাইজার ব্যবহার করুন।.
es_un: Utilizar un optimizador clásico para elegir un nuevo conjunto de controles.
pt_un: Use um otimizador clássico para escolher um novo conjunto de controles.
ta_in: புதிய கட்டுப்பாடுகளின் தொகுப்பைத் தேர்வுசெய்ய கிளாசிக்கல் ஆப்டிமைசரைப் பயன்படுத்தவும்.
th: ใช้ Optimizer แบบดั้งเดิมเพื่อเลือกเซตของตัวควบคุมใหม่

source: Continue until :math:`C(\boldsymbol\theta)` reaches a minimum, close enough to the solution :math:`\boldsymbol\theta^*`.
bn_bn: যতক্ষণনা :math:`C(\boldsymbol\theta)` ন্যূনতমে পৌঁছে যায়, যা কিনা :math:`\boldsymbol\theta^*` সমাধানের জন্য খুব কাছাকাছি, ততক্ষন চালিয়ে যান।
es_un: Continuar hasta que :math:`C(\boldsymbol\theta)` alcance un mínimo, lo suficientemente cercano a la solución :math:`\boldsymbol\theta^*`.
pt_un: Continue até :math:`C(\boldsymbol\theta)` atingir um mínimo, próximo o suficiente da solução :math:`\boldsymbol\theta^*`.
ta_in: :math:`C(\boldsymbol\theta)` குறைந்தபட்சத்தை அடையும் வரை தொடரவும், தீர்வுக்கு போதுமானதாக இருக்கிறது :math:`\boldsymbol\theta^*`.
th: ทำงานซ้ำไปเรื่อย ๆ จนกว่า :math:`C(\boldsymbol\theta)` จะมีค่าเข้าสู่ค่าน้อยที่สุดใกล้เคียงกับคำตอบ :math:`\boldsymbol\theta^*`

source: Use the last :math:`\boldsymbol\theta` to generate a final set of samples from the distribution :math:`\Big|\langle z_i\big|\psi(\boldsymbol\theta)\rangle\Big|^2\;\forall i` to obtain the answer.
bn_bn: শেষ :math:`\boldsymbol\theta` ব্যাবহার করুন :math:`\Big|\langle z_i\big|\psi(\boldsymbol\theta)\rangle\Big|^2\;\forall i` বিতরণ থেকে অন্তিম নমুনা (স্যাম্পল) সমূহ উৎপন্ন করে,উত্তর পাওয়ার জন্যে।
es_un: Utilizar la última :math:`\boldsymbol\theta` para generar un conjunto final de muestras de la distribución :math:`\Big|\langle z_i\big|\psi(\boldsymbol\theta)\rangle\Big|^2\;\forall i` para obtener la respuesta.
pt_un: Use o último :math:`\boldsymbol\theta` para gerar um conjunto final de amostras da distribuição :math:`\Big|\langle z_i\big|\psi(\boldsymbol\theta)\rangle\Big|^2\;\forall i` para obter a resposta.
ta_in: விநியோகத்திலிருந்து இறுதி மாதிரிகளை உருவாக்க கடைசி :math:`\boldsymbol \theta` ஐப் பயன்படுத்தவும் :math:`\Big|\langle z_i\big|\psi(\boldsymbol\theta)\rangle\Big|^2\;\forall i` பதிலைப் பெற.
th: ใช้ :math:`\boldsymbol\theta` สุดท้ายที่ได้ เพื่อสร้างเซตของผลลัพธ์สุ่มสุดท้ายจากการกระจายตัวของความน่าจะเป็น :math:`\Big|\langle z_i\big|\psi(\boldsymbol\theta)\rangle\Big|^2\;\forall i` เพื่อให้ได้คำตอบออกมา

source: There are many parameters throughout, notably the choice of the trial wavefunction. Below, we consider:
bn_bn: অনেকগুলি পরামিতি রয়েছে সর্বত্র , উল্লেখযোগ্যভাবে ট্রায়াল ওয়েভফাংশন নির্বাচন। নীচে, আমরা বিবেচনা করি:
es_un: Hay muchos parámetros en todo momento, en particular la elección de la función de onda de prueba. A continuación, consideramos:
pt_un: Existem muitos parâmetros, notadamente a escolha da função da onda de teste. Abaixo, consideramos:
ta_in: முழுவதும் பல அளவுருக்கள் உள்ளன, குறிப்பாக சோதனை அலை செயல்பாட்டின் தேர்வு. கீழே, நாங்கள் கருதுகிறோம்:
th: มีพารามิเตอร์จำนวนมากที่สามารถปรับได้ โดยเราได้เลือกเลือกฟังก์ชันคลื่นทดสอบมากดังนี้:

source: \big|\psi(\theta)\rangle = [U_\mathrm{single}(\boldsymbol\theta) U_\mathrm{entangler}]^m \big|+\rangle
es_un: \big|\psi(\theta)\rangle = [U_\mathrm{simple}(\boldsymbol\theta) U_\mathrm{entrelazador}]^m \big|+\rangle

source: where :math:`U_\mathrm{entangler}` is a collection of C-Phase gates (fully-entangling gates), and :math:`U_\mathrm{single}(\theta) = \prod_{i=1}^N Y(\theta_{i})`, where :math:`N` is the number of qubits and :math:`m` is the depth of the quantum circuit.
bn_bn: যেখানে:math:`U_\mathrm{entangler}`হ'ল সি-ফেজ(C-Phase) গেটস (সম্পূর্ণভাবে জড়িয়ে পড়ার গেটস) এবং:math:`U_\mathrm{single}(\theta) = \prod_{i=1}^N Y(\theta_{i})`, যেখানে :math:`N`হল কুউবিট সংখ্যাা এবং: :math:`m` হল কোয়ান্টাম বর্তনী (সার্কিট) গভীরতা।
es_un: donde :math:`U_\mathrm{entrelazador}` es una colección de compuertas C-Phase (compuertas totalmente entrelazadas), y :math:`U_\mathrm{simple}(\theta) = \prod_{i=1}^N Y(\theta_{i})`, donde :math:`N` es el número de qubits y :math:`m` es la profundidad del circuito cuántico.
pt_un: onde :math:`U_\mathrm{entangler} é uma coleção de portas C-Fase (portas totalmente entrelaçadas), e ::math:`U_\mathrm{single}(\theta) = \prod_{i=1}^N Y(\theta_{i})`, onde :math:`N` é o número de qubits e :math:`m` é a profundidade do circuito quântico.
ta_in: எங்கே :math:`U_\mathrm{entangler}` என்பது C-கட்ட கேட்ஸ்களின் தொகுப்பு (முழுமையாக சிக்க வைக்கும் வாயில்கள்), மற்றும் :math:`U_\mathrm{single}(\theta) = \prod_{i=1}^N Y(\theta_{i})`, எங்கே :math:`N` என்பது க்யூபிட்களின் எண்ணிக்கை மற்றும் :math:`m` என்பது குவாண்டம் சுற்றுகளின் ஆழம்.
th: โดยที่ :math:`U_\mathrm{entangler}` เป็นชุดของเกต C-Phase (Fully-Entangling Gate) และ :math:`U_\mathrm{single}(\theta) = \prod_{i=1}^N Y(\theta_{i})` โดยที่ :math:`N` เป็นจำนวนของคิวบิตและ :math:`m` คือความลึกของวงจรควอนตัม

source: Construct the Ising Hamiltonian
bn_bn: আইসিং হ্যামিল্টোনীয়ান নির্মাণ করুন
es_un: Construir el Hamiltoniano de Ising
pt_un: Construa o Ising Hamiltonian
ta_in: ஐசிங் ஹாமில்டோனியன் உருவாக்கு
th: สร้าง Ising Hamiltonian
