Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/09_application_classes.po
Languages: bn_bn, es_un, ja_jp, ko, pt_un, ta_in, tr_tr

source: We import the application class ``VertexCover`` for the vertex cover problem and ``networkx`` to generate a random graph.
bn_bn: আমরা ভারটেক্স কভার সমস্যা এবং ``networkx`` দৈব গ্রাফ তৈরির জন্য অ্যাপ্লিকেশন শ্রেণী ``VertexCover`` আমদানি করি।
es_un: Importamos la clase de aplicación ``VertexCover`` para el problema de cobertura de vértices y ``networkx`` para generar un grafo aleatorio.
ja_jp: 頂点被覆問題のための ``VertexCover`` アプリケーションクラスと、ランダムグラフを生成するための ``networkx`` をインポートします。
ko: 정점 커버 문제에 대한 응용 클래스 ``VertexCover`` 를 가져오고 무작위 그래프를 생성하기 위해 ``networkx`` 를 가져온다.
pt_un: Importamos a classe de aplicação ``VertexCover`` para o problema da cobertura de vértices e ``networkx`` para gerar um grafo aleatório.
ta_in: வெர்டெக்ஸ் கவர் பிரச்சனைக்காக ``VertexCover`` மற்றும் சீரற்ற வரைபடத்தை உருவாக்க ``networkx`` என்ற விண்ணப்ப வகுப்பை நாங்கள் இறக்குமதி செய்கிறோம்.
tr_tr: Köşe örtme problemi için ``VertexCover`` uygulama sınıfını ve rastgele bir grafik oluşturmak için ``networkx`` uygulama sınıfını içe aktarıyoruz.

source: ``VertexCover`` takes a graph as an instance and ``to_quadratic_program`` generates a corresponding ``QuadraticProgram`` of the instance of the vertex cover problem.
bn_bn: ``VertexCover`` একটি গ্রাফ গ্রহন করে একটি উদাহরণ হিসেবে এবং ``to_quadratic_program`` তৈরি করে একটি অনুরূপ ``QuadraticProgram`` যা ভারটেক্স কভার সমস্যার উদাহরণ তৈরি করে।
es_un: ``VertexCover`` toma un grafo como instancia y ``to_quadratic_program`` genera un correspondiente ``QuadraticProgram`` de la instancia del problema de cobertura de vértices.
ja_jp: ``VertexCover`` はインスタンスとしてグラフを取り、``to_quadratic_program`` は頂点被覆問題のインスタンスに対応する ``QuadraticProgram`` を生成します。
ko: ``VertexCover`` 는 그래프를 인스턴스로 사용하고 ``to_quadratic_program`` 는 정점 커버 문제의 인스턴스에 해당하는 ``QuadraticProgram`` 를 생성한다.
pt_un: ``VertexCover`` recebe um grafo como uma instância e ``to_quadratic_program`` gera um ``QuadraticProgram`` correspondente da instância do problema da cobertura de vértices.
ta_in: ``VertexCover`` ஒரு வரைபடத்தை ஒரு உதாரணமாக எடுத்துக்கொள்கிறது மற்றும் ``to_quadratic_program`` வெர்டெக்ஸ் கவர் பிரச்சனையின் தொடர்புடைய ``QuadraticProgram`` ஐ உருவாக்குகிறது.
tr_tr: ``VertexCover``, bir örnek olarak bir grafik alır ve ``to_quadratic_program``, köşe örtüsü sorununun örneğine karşılık gelen bir ``QuadraticProgram`` oluşturur.

source: You can solve the problem as follows. ``NumPyMinimumEigensolver`` finds the minimum eigen vector. You can also apply QAOA. Note that the solution by QAOA is not always optimal.
bn_bn: আপনি নিম্নরূপ সমস্যা সমাধান করতে পারেন। ``NumPyMinimumEigensolver`` সর্বনিম্ন eigen ভেক্টর খুঁজে পায়। আপনি QAOA প্রয়োগ করতে পারেন। মনে রাখবেন QAOA দ্বারা সমাধান সবসময় অনুকূল নয়।
es_un: Puedes resolver el problema de la siguiente manera. ``NumPyMinimumEigensolver`` encuentra el vector propio mínimo. También puedes aplicar QAOA. Ten en cuenta que la solución de QAOA no siempre es óptima.
ja_jp: この問題は以下のように解けます。``NumPyMinimumEigensolver`` で最小固有ベクトルを見つけます。QAOA を適用しても良いです。ただし QAOA によるソリューションは常に最適ではないことに注意してください。
ko: 다음과 같이 문제를 해결할 수 있다. ``NumPyMinimumEigensolver`` 는 최소 고유 벡터를 찾는다. QAOA또한 적용될 수 있다. QAOA의 솔루션이 항상 최적인 것은 아니니 주의하자.
pt_un: Você pode resolver o problema da seguinte forma. ``NumPyMinimumEigensolver`` encontra o autovetor mínimo. Você também pode aplicar QAOA. Observe que a solução por QAOA nem sempre é ótima.
ta_in: நீங்கள் பின்வருமாறு சிக்கலை தீர்க்க முடியும். ``NumPyMinimumEigensolver`` குறைந்தபட்ச ஈஜென் திசையனை கண்டுபிடிக்கும். நீங்கள் QAOA ஐ விண்ணப்பிக்கலாம். QAOA இன் தீர்வு எப்போதும் உகந்ததல்ல என்பதை நினைவில் கொள்க.
tr_tr: Sorunu aşağıdaki gibi çözebilirsiniz. ``NumPyMinimumEigensolver`` minimum öz vektörü bulur. QAOA'yı da uygulayabilirsiniz. QAOA'nın çözümünün her zaman optimal olmadığını unutmayın.

source: The knapsack problem asks us to find a combination of items such that the total weight is within the capacity of the knapsack and maximize the total value of the items. The following examples solve an instance of the knapsack problem with 5 items by Numpy eigensolver and QAOA.
bn_bn: ন্যাপস্যাক সমস্যাটি আমাদের আইটেমের সংমিশ্রণ খুঁজে পেতে বলে, যাতে মোট ওজন ন্যাপস্যাকের ধারণক্ষমতার মধ্যে থাকে এবং আইটেমের মোট মূল্য সর্বাধিক হয়। নিচের উদাহরণগুলি NumPy eigensolver এবং কিউএওএ দ্বারা 5 টি আইটেমের সাথে ন্যাপস্যাক সমস্যার একটি উদাহরণ সমাধান করে।
es_un: El problema de la mochila (knapsack) nos pide que encontremos una combinación de artículos de manera que el peso total esté dentro de la capacidad de la mochila y maximicemos el valor total de los artículos. Los siguientes ejemplos resuelven una instancia del problema de la mochila con 5 artículos usando el solucionador propio de Numpy y QAOA.
ja_jp: ナップサック問題は、総重量がナップサックの容量以下で、アイテムの総価値が最大になるアイテムの組合せを見つける問題です。 以下の例では、Numpy eigensolver と QAOA によって、5 アイテムのナップサック問題の例を解きます。
ko: 배낭문제는 총중량이 배낭의 용량 이내가 되도록 조합된 항목을 찾아서 항목의 총가치를 최대화하도록 요구한다. 다음 예제는 Numpyeigensolver와 QAOA로 5개 항목으로 구성된 배낭 문제를 해결한다.
pt_un: O problema da mochila nos pede para encontrar uma combinação de itens de modo que o peso total está dentro da capacidade da mochila e maximize o valor total dos itens. Os exemplos a seguir resolvem uma instância do problema da mochila com 5 itens com o eigensolver do Numpy e QAOA.
ta_in: நாப்சாக் பிரச்சனை, மொத்த எடை நாப்சாக்கின் திறனுக்குள் இருக்கும் பொருட்களின் கலவையை கண்டுபிடித்து, பொருட்களின் மொத்த மதிப்பை அதிகரிக்கும்படி கேட்கிறது. பின்வரும் எடுத்துக்காட்டுகள் Numpy eigensolver மற்றும் QAOA மூலம் 5 உருப்படிகளுடன் நாப்சாக் பிரச்சனையின் ஒரு உதாரணத்தை தீர்க்கின்றன.
tr_tr: Sırt çantası problemi, toplam ağırlığı sırt çantasının kapasitesi dahilinde olacak şekilde bir eşya kombinasyonu bulmamızı ve eşyaların toplam değerini maksimize etmemizi ister. Aşağıdaki örnekler, Numpy özçözücü ve QAOA tarafından 5 öğeli sırt çantası sorununun bir örneğini çözmektedir.

source: How to check the Hamiltonian
bn_bn: কিভাবে হ্যামিল্টোনিয়ান চেক করবেন
es_un: Cómo revisar el Hamiltoniano
ja_jp: ハミルトニアンの確認方法
ko: Hamiltonian 점검 방법
pt_un: Como verificar o Hamiltoniano
ta_in: ஹாமில்டோனியனை எவ்வாறு சரிபார்க்கலாம்
tr_tr: Hamiltonyen nasıl kontrol edilir

source: If you want to check the actual Hamiltonian generated from your problem instance, you need to apply a converter as follows.
bn_bn: আপনি যদি আপনার সমস্যার উদাহরণ থেকে উৎপন্ন প্রকৃত হ্যামিল্টোনিয়ান পরীক্ষা করতে চান, তাহলে আপনাকে নিম্নরূপ একটি রূপান্তরকারী প্রয়োগ করতে হবে।
es_un: Si desea verificar el Hamiltoniano real generado a partir de tu instancia del problema, debes aplicar un convertidor de la siguiente manera.
ja_jp: 問題インスタンスから生成された実際のハミルトニアンを確認するには、次のようにコンバーターを適用する必要があります。
ko: 문제 인스턴스에서 생성된 실제 Hamiltonian을 확인하려면 다음과 같이 변환기를 적용해야 한다.
pt_un: Se deseja verificar o Hamiltoniano real gerado a partir da instância do seu problema, você precisa aplicar um conversor da seguinte forma.
ta_in: உங்கள் பிரச்சனை நிகழ்விலிருந்து உருவாக்கப்பட்ட உண்மையான ஹாமில்டோனியனை நீங்கள் சரிபார்க்க விரும்பினால், நீங்கள் பின்வருமாறு ஒரு மாற்றி பயன்படுத்த வேண்டும்.
tr_tr: Problem örneğinizden üretilen gerçek Hamilton'u kontrol etmek istiyorsanız, aşağıdaki gibi bir dönüştürücü uygulamanız gerekir.
