Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/09_application_classes.po
Languages: bn_bn, es_un, ja_jp, ko, pt_un, ta_in, tr_tr

source: This page was generated from `docs/tutorials/09_application_classes.ipynb`__.
bn_bn: এই পেজটি `docs/tutorials/09_application_classes.ipynb`__ থেকে তৈরি হয়েছে।
es_un: Esta página fue generada a partir de `docs/tutorials/09_application_classes.ipynb`__.
ja_jp: このページは `docs/tutorials/09_application_classes.ipynb`__ から生成されました。
ko: 이 페이지는 `docs/tutorials/09_application_classes.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/09_application_classes.ipynb`__.
ta_in: இந்தப் பக்கம் இதிலிருந்து உருவாக்கப்பட்டது `docs/tutorials/09_application_classes.ipynb`__.
tr_tr: Bu sayfa, `docs/tutorials/09_application_classes.ipynb`__ sayfasından oluşturulmuştur.

source: Application Classes for Optimization Problems
bn_bn: অপ্টিমাইজেশন সমস্যার জন্য অ্যাপ্লিকেশন ক্লাস
es_un: Clases de Aplicaciones para Problemas de Optimización
ja_jp: 最適化問題のアプリケーション・クラス
ko: 최적화 문제를 위한 응용 클래스
pt_un: Classes de Aplicação para Problemas de Otimização
ta_in: தேர்வுமுறை பிரச்சனைகளுக்கான பயன்பாட்டு வகுப்புகள்
tr_tr: Optimizasyon Problemleri için Uygulama Sınıfları

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
ja_jp: はじめに
ko: 소개
pt_un: Introdução
ta_in: முன்னுரை

source: We introduce application classes for the following optimization problems so that users can easily try various optimization problems on quantum computers.
bn_bn: আমরা নিম্নলিখিত অপ্টিমাইজেশান সমস্যার জন্য অ্যাপ্লিকেশন ক্লাস চালু করি যাতে ব্যবহারকারীরা সহজেই কোয়ান্টাম কম্পিউটারে বিভিন্ন অপ্টিমাইজেশান সমস্যার চেষ্টা করতে পারে।
es_un: Introducimos clases de aplicaciones para los siguientes problemas de optimización para que los usuarios puedan probar fácilmente varios problemas de optimización en computadoras cuánticas.
ja_jp: ユーザーが量子コンピューターで様々な最適化問題を簡単に試みることができるように、以下の最適化問題のアプリケーションクラスを導入します。
ko: 양자 컴퓨터에서 다양한 최적화 문제를 쉽게 시도할 수 있도록 다음과 같은 최적화 문제에 대한 응용 클래스를 소개한다.
pt_un: Apresentamos classes de aplicação para os problemas de otimização a seguir, para que os usuários possam facilmente experimentar diversos problemas de otimização em computadores quânticos.
ta_in: பின்வரும் தேர்வுமுறை சிக்கல்களுக்கான பயன்பாட்டு வகுப்புகளை நாங்கள் அறிமுகப்படுத்துகிறோம், இதனால் பயனர்கள் எளிதாக குவாண்டம் கணினிகளில் பல்வேறு தேர்வுமுறை சிக்கல்களை முயற்சி செய்யலாம்.
tr_tr: Kullanıcıların kuantum bilgisayarlarda çeşitli optimizasyon problemlerini kolayca deneyebilmeleri için aşağıdaki optimizasyon problemleri için uygulama sınıfları sunuyoruz.

source: Exact cover problem
bn_bn: Exact কভার সমস্যা
es_un: Problema de cobertura exacta
ja_jp: 厳密被覆問題
ko: 정확한 커버 문제
pt_un: Problema da cobertura exata
ta_in: சரியான கவர் சிக்கல்
tr_tr: Tam kapak sorunu

source: Given a collection of subsets of items, find a subcollection such that each item is covered exactly once.
bn_bn: আইটেমের উপসেটগুলির একটি সংগ্রহ দেওয়া, একটি উপ -সংগ্রহ খুঁজুন যাতে প্রতিটি আইটেম ঠিক একবার আচ্ছাদিত হয়।
es_un: Dada una colección de subconjuntos de elementos, encuentra una subcolección tal que cada elemento se cubra exactamente una vez.
ja_jp: アイテムのサブセットのコレクションが与えられた場合、それぞれのアイテムが正確に１回カバーされるような、サブコレクションを探します。
ko: 항목의 부분 집합 collection이 지정된 경우 각 항목이 정확히 한 번만 포함되도록 subcollection을 찾아라.
pt_un: Dada uma coleção de subconjuntos de itens, encontre uma subcoleção de modo que cada item seja coberta exatamente uma vez.
ta_in: உருப்படிகளின் துணைக்குழுக்களின் தொகுப்பைக் கொண்டு, ஒவ்வொரு பொருளும் சரியாக ஒரு முறை மூடப்பட்டிருக்கும் ஒரு துணைத் தொகுப்பைக் கண்டறியவும்.
tr_tr: Öğelerin alt kümelerinden oluşan bir koleksiyon verildiğinde, her öğenin tam olarak bir kez kapsanacağı bir alt koleksiyon bulun.

source: Knapsack problem
bn_bn: ন্যাপস্যাক সমস্যা
es_un: Problema de la mochila (knapsack)
ja_jp: ナップサック問題
ko: 배낭 문제
pt_un: Problema da mochila
ta_in: நாப்சாக் சிக்கல்
tr_tr: Sırt çantası problemi

source: Given a set of items, find a subset of items such that the total weight is within the capacity and the total value is maximized.
bn_bn: আইটেমের একটি সেট দেওয়া, আইটেমগুলির একটি উপসেট খুঁজুন যাতে মোট ওজন ধারণক্ষমতার মধ্যে থাকে এবং মোট মান সর্বাধিক হয়।
es_un: Dado un conjunto de elementos, encuentra un subconjunto de elementos de modo que el peso total esté dentro de la capacidad y el valor total sea maximizado.
ja_jp: 一連のアイテムを与えられた場合、合計重量が容量内にあり、合計値が最大化されるようなアイテムのサブセットを見つけます。
ko: 항목 집합에서 총 중량이 용량 내에 있고 총 값이 최대화되도록 항목의 부분 집합을 찾아라.
pt_un: Dado um conjunto de itens, encontre um subconjunto de itens de modo que o peso total esteja dentro da capacidade e o valor total seja maximizado.
ta_in: பொருட்களின் தொகுப்பைக் கொண்டு, மொத்த எடை கொள்ளளவுக்குள் இருக்கும் மற்றும் மொத்த மதிப்பு அதிகபட்சமாக இருக்கும் உருப்படிகளின் உட்பிரிவைக் கண்டறியவும்.
tr_tr: Bir öğe kümesi verildiğinde, toplam yükü kapasite dahilinde olacak ve toplam değeri maksimize edecek şekilde bir öğe alt kümesi bulun.

source: Number partition problem
bn_bn: সংখ্যা বিভাজন সমস্যা
es_un: Problema de partición de números
ja_jp: 整数分割問題
ko: 수 분할 문제
pt_un: Problema da partição de números
ta_in: எண் பகிர்வு பிரச்சனை
tr_tr: Sayı bölme sorunu

source: Given a multiset of positive integers, find a partition of the multiset into two subsets such that the sums of the subsets are equal.
bn_bn: ধনাত্মক পূর্ণসংখ্যার একটি মাল্টিসেট দেওয়া হলে, মাল্টিসেটের একটি বিভাজন দুটি উপসেটগুলিতে খুঁজুন যাতে উপসেটগুলির যোগফল সমান হয়।
es_un: Dado un conjunto múltiple de enteros positivos, encuentra una partición del conjunto múltiple en dos subconjuntos de modo que las sumas de los subconjuntos sean iguales.
ja_jp: 正の整数のマルチセットが所与の時、合計が等しい 2 つのサブセットにする分割を探します。
ko: 양의 정수 집합이 여러 개인 경우, 부분 집합의 합이 같도록 다중 집합의 분할을 두 부분 집합으로 찾아라.
pt_un: Dado um multiconjunto de inteiros positivos, encontre uma partição do multiconjunto em dois subconjuntos de modo que as somas dos subconjuntos sejam iguais.
ta_in: நேர்மறை முழு எண்களின் பன்முகத் தொகுப்பைக் கொண்டு, மல்டிசெட்டின் இரண்டு துணைக்குழுக்களாகப் பிரிப்பதைக் கண்டறியவும், அதாவது துணைக்குழுக்களின் தொகை சமமாக இருக்கும்.
tr_tr: Bir pozitif tamsayı çoklu kümesi verildiğinde, çoklu kümenin, alt kümelerin toplamları eşit olacak şekilde iki alt kümeye bölündüğünü bulun.

source: Set packing problem
bn_bn: সেট প্যাকিং সমস্যা
es_un: Problema del empaquetamiento de conjuntos
ja_jp: 集合パッキング問題
ko: 집합 패킹 문제
pt_un: Problema do empacotamento de conjuntos
ta_in: பக்க பிரச்சனை அமை
tr_tr: Paketleme sorununu ayarlama

source: Given a collection of subsets of items, find a subcollection such that all subsets of the subcollection are pairwise disjoint and the number of items in the subcollection is maximized.
bn_bn: আইটেমের উপসেটগুলির একটি সংগ্রহ দেওয়া হলে, এমন একটি উপ -সংগ্রহ খুঁজুন যাতে উপ -সংগ্রহের সমস্ত উপগোষ্ঠী জোড়া যুক্ত হয় এবং উপ -সংগ্রহে আইটেমের সংখ্যা সর্বাধিক হয়।
es_un: Dada una colección de subconjuntos de elementos, encuentra una subcolección tal que todos los subconjuntos de la subcolección estén separados por pares y se maximice el número de elementos de la subcolección.
ja_jp: アイテムのサブセットのコレクションが所与の時、全てのサブセットが互いに素で、アイテム数が最大になるサブコレクションを探します。
ko: 항목의 부분 집합 collection이 주어지면 부분 subcollection의 모든 부분 집합이 쌍으로 분리되고 subcollection의 항목 수가 최대화되도록 부분 집합을 찾아라.
pt_un: Dada uma coleção de subconjuntos de itens, encontre uma subcoleção de modo que todos os subjconjuntos da subcoleção são dois a dois disjuntos e o número de itens na subcoleção seja maximizado.
ta_in: உருப்படிகளின் துணைக்குழுக்களின் தொகுப்பைக் கொண்டு, துணைத் தொகுப்பின் அனைத்து துணைப் பிரிவுகளும் ஜோடிப் பிரிந்திருக்கும் மற்றும் துணைத் தொகுப்பில் உள்ள பொருட்களின் எண்ணிக்கை அதிகபட்சமாக இருக்கும் ஒரு துணைத் தொகுப்பைக் கண்டறியவும்.
tr_tr: Öğelerin alt kümelerinden oluşan bir koleksiyon verildiğinde, alt koleksiyonun tüm alt kümelerinin ikili olarak ayrık olacağı ve alt koleksiyondaki öğelerin sayısı maksimize edilecek şekilde bir alt koleksiyon bulun.

source: Graph problems
bn_bn: গ্রাফ সমস্যা
es_un: Problemas con grafos
ja_jp: グラフ問題
ko: 그래프 문제
pt_un: Problemas com grafos
ta_in: வரைபட சிக்கல்கள்
tr_tr: Grafik problemleri

source: Clique problem
bn_bn: ক্লিকে সমস্যা
es_un: Problema del clan (clique)
ja_jp: クリーク問題
ko: Clique 문제
pt_un: Problema do clique
ta_in: கிளிக் சிக்கல்
tr_tr: Tıklama sorunu

source: Given an undirected graph, find a subset of nodes with a specified number or the maximum number such that the induced subgraph is complete.
bn_bn: একটি অনির্দেশিত গ্রাফ দেওয়া, একটি নির্দিষ্ট সংখ্যা বা সর্বাধিক সংখ্যক নোডগুলির একটি উপসেট খুঁজুন যাতে প্ররোচিত সাবগ্রাফটি সম্পূর্ণ হয়।
es_un: Dado un grafo no dirigido, encuentra un subconjunto de nodos con un número especificado o el número máximo de modo que el subgrafo inducido esté completo.
ja_jp: 無向グラフが与えられた場合、誘導部分グラフが完全になるような、特定の数または最大数のノードの部分集合を探します。
ko: 무방향 그래프가 제공된 경우, 유도된 하위 그래프가 완성되도록 지정된 숫자 또는 최대 수의 노드 부분 집합을 찾아라.
pt_un: Dado um grafo não direcionado, encontre um subconjunto de nós com um número especificado ou o número máximo de modo que o sub-grafo induzido seja completo.
ta_in: திசைதிருப்பப்படாத வரைபடத்தைக் கொண்டு, குறிப்பிடப்பட்ட எண் அல்லது அதிகபட்ச எண்ணைக் கொண்ட முனைகளின் துணைக்குழுவைக் கண்டறியவும்.
tr_tr: Yönlendirilmemiş bir grafik verildiğinde, indüklenen alt grafiğin tamamlanması için belirli bir sayıya veya maksimum sayıya sahip bir düğümün alt kümesini bulun.

source: Graph partition problem
bn_bn: গ্রাফ পার্টিশন সমস্যা
es_un: Problema de partición de grafos
ja_jp: グラフ分割問題
ko: 그래프 분할 문제
pt_un: Problema de partição de grafos
ta_in: வரைபட பகிர்வு பிரச்சனை
tr_tr: Grafik bölümü sorunu

source: Given an undirected graph, find a partition into two components whose sizes are equal such that the total capacity of the edges between the two components is minimized.
bn_bn: একটি অনির্দেশিত গ্রাফ দেওয়া, দুটি অংশে একটি পার্টিশন খুঁজুন যার আকার সমান যে দুটি উপাদানগুলির মধ্যে প্রান্তের মোট ক্ষমতা কমিয়ে আনা হয়।
es_un: Dado un grafo no dirigido, encuentra una partición en dos componentes cuyos tamaños sean iguales de tal manera que la capacidad total de las aristas entre los dos componentes sea mínima.
ja_jp: 無向グラフが与えられた場合、サイズが同じ２つのコンポーネントへの分割を探します。２つのコンポーネント間のエッジの合計容量は最小にします。
ko: 무방향 그래프가 주어진 경우 두 구성 요소 사이의 가장자리 총 용량이 최소화되도록 크기가 동일한 두 구성 요소로 분할을 찾아라.
pt_un: Dado um grafo não direcionado, encontre uma partição em dois componentes cujos tamanhos sejam iguais de modo que a capacidade total das arestas entre os dois componentes seja minimizada.
ta_in: திசைதிருப்பப்படாத வரைபடத்தைக் கொண்டு, இரண்டு கூறுகளுக்கு இடையில் உள்ள விளிம்புகளின் மொத்த திறன் குறைக்கப்படும் அளவுக்கு சமமாக இருக்கும் இரண்டு பாகங்களாக ஒரு பகிர்வைக் கண்டறியவும்.
tr_tr: Yönlendirilmemiş bir grafik verildiğinde, iki bileşen arasındaki kenarların toplam kapasitesi en aza indirilecek şekilde boyutları eşit olan iki bileşene bölünen bir bölüm bulun.

source: Max-cut problem
bn_bn: সর্বোচ্চ-কাট সমস্যা (Max-Cut problem)
es_un: Problema de máximo corte (max-cut)
ja_jp: 最大カット問題
ko: 최대 절단 문제
pt_un: Problema do Corte-Máximo
ta_in: அதிகபட்ச வெட்டு பிரச்சனை
tr_tr: Maksimum Kesim problemi

source: Given an undirected graph, find a partition of nodes into two subsets such that the total weight of the edges between the two subsets is maximized.
bn_bn: একটি অনির্দেশিত গ্রাফ দেওয়া, দুটি উপসেটগুলিতে নোডের একটি পার্টিশন খুঁজুন যাতে দুটি উপসেটগুলির মধ্যে প্রান্তের মোট ওজন সর্বাধিক হয়।
es_un: Dado un grafo no dirigido, encuentra una partición de nodos en dos subconjuntos de modo que se maximice el peso total de las aristas entre los dos subconjuntos.
ja_jp: 無向グラフが所与の時、ノードの二つの部分集合への分割を探します。二つの部分集合のエッジの重みの合計は最大になるようにします。
ko: 무방향 그래프가 주어진 경우 두 부분 집합 사이의 가장자리의 총 가중치가 최대화될 수 있도록 노드의 두 부분 집합 분할을 찾아라.
pt_un: Dado um grafo não-direcionado, encontre uma partição de nós em dois subconjuntos de modo que o peso total das arestas entre os dois subconjuntos seja maximizado.
ta_in: திசைதிருப்பப்படாத வரைபடத்தைக் கொண்டு, இரண்டு துணைக்குழுக்களுக்கிடையேயான விளிம்புகளின் மொத்த எடை அதிகபட்சமாக இருக்கும் வகையில் இரண்டு துணைக்குழுக்களாக முனைகளின் பகிர்வைக் கண்டறியவும்.
tr_tr: Yönlendirilmemiş bir grafik verildiğinde, iki alt küme arasındaki kenarların toplam ağırlığı maksimize edilecek şekilde düğümlerin iki alt kümeye bölünmesini bulun.

source: Stable set problem
bn_bn: স্থিত সেট সমস্যা
es_un: Problema del conjunto estable
ja_jp: 安定集合問題
ko: 안정장치 문제
pt_un: Problema do conjunto estável
ta_in: நிலையான தொகுப்பு பிரச்சனை
tr_tr: Kararlı küme sorunu

source: Given an undirected graph, find a subset of nodes such that no edge connects the nodes in the subset and the number of nodes is maximized.
bn_bn: একটি অনির্দেশিত গ্রাফ দেওয়া, নোডের একটি উপসেট খুঁজুন যাতে কোন প্রান্ত উপসেটগুলির নোডগুলিকে সংযুক্ত না করে এবং নোডের সংখ্যা সর্বাধিক হয়।
es_un: Dado un grafo no dirigido, encuentra un subconjunto de nodos de modo que ninguna arista conecte los nodos en el subconjunto y se maximice el número de nodos.
ja_jp: 無向グラフが所与の時、以下のノードのサブセットを探します。サブセット中でエッジがノードに接続せず、ノード数が最大のサブセットです。
ko: 무방향 그래프가 주어진 경우, 가장자리가 부분 집합의 노드를 연결하지 않고 노드 수가 최대화되도록 노드의 부분 집합을 찾아라.
pt_un: Dado um grafo não direcionado, encontre um subconjunto de nós de modo que nenhuma aresta conecte os nós no subconjunto e o número máximo de nós seja maximizado.
ta_in: திசைதிருப்பப்படாத வரைபடத்தைக் கொண்டு, முனைகளின் துணைக்குழுவைக் கண்டுபிடி, அதாவது எந்த விளிம்பும் துணைக்குழுவில் உள்ள முனைகளை இணைக்காது மற்றும் முனைகளின் எண்ணிக்கை அதிகரிக்கிறது.
tr_tr: Yönlendirilmemiş bir grafik verildiğinde, alt kümedeki düğümleri hiçbir kenarın bağlamadığı ve düğümlerin sayısı maksimum olmayacak şekilde bir düğüm alt kümesi bulun.

source: Traveling salesman problem
bn_bn: ট্রাভেলিং সেলসম্যান সমস্যা
es_un: Problema del vendedor viajero
ja_jp: 巡回セールスマン問題
ko: 여행하는 외판원 문제
pt_un: Problema do caixeiro viajante
ta_in: பயண விற்பனையாளர் பிரச்சனை
tr_tr: Gezgin Satıcı Problemi

source: Given a graph, find a route with the minimum distance such that the route visits each city exactly once.
bn_bn: একটি গ্রাফ দেওয়া, ন্যূনতম দূরত্ব সহ একটি রুট খুঁজুন যাতে রুটটি প্রতিটি শহরে একবার ঠিক ভিজিট করে।
es_un: Dado un grafo, encuentra una ruta con la distancia mínima tal que la ruta visite cada ciudad exactamente una vez.
ja_jp: グラフが所与の時、最小の距離のルートを探します。ルートは街を正確に一度訪れます。
ko: 그래프가 주어진 경우 경로가 각 도시를 정확히 한 번 방문할 수 있도록 최소 거리를 가진 경로를 찾아라.
pt_un: Dado um grafo, encontre a rota com a distância mínima de modo que a rota visite cada cidade exatamente uma vez.
ta_in: ஒரு வரைபடத்தைக் கொண்டு, குறைந்தபட்ச தூரத்தைக் கொண்ட ஒரு வழியைக் கண்டறியவும், அந்த பாதை ஒவ்வொரு நகரத்திற்கும் சரியாக ஒரு முறை வருகை தரும்.
tr_tr: Verilen bir grafikle, rota her şehri tam olarak bir kez ziyaret edecek şekilde minimum mesafeye sahip bir rota bulun.

source: Vehicle routing problem
bn_bn: যানবাহন চলাচলের সমস্যা
es_un: Problema de las rutas de vehículos
ja_jp: 車両ルーティング問題
ko: 차량 경로 결정 문제
pt_un: Problema de roteamento de veículos
ta_in: வாகன வழித்தடம் பிரச்சனை
tr_tr: Araç yönlendirme sorunu

source: Given a graph, a depot node, and the number of vehicles (routes), find a set of routes such that each node is covered exactly once except the depot and the total distance of the routes is minimized.
bn_bn: একটি গ্রাফ, একটি ডিপো নোড এবং যানবাহনের সংখ্যা (রুট) দেওয়া হলে, রুটগুলির একটি সেট খুঁজুন যাতে প্রতিটি নোড ডিপো ছাড়া ঠিক একবার আচ্ছাদিত হয় এবং রুটগুলির মোট দূরত্ব কম হয়।
es_un: Dado un grafo, un nodo de depósito y el número de vehículos (rutas), encuentra un conjunto de rutas de modo que cada nodo se cubra exactamente una vez, excepto el depósito, y la distancia total de las rutas sea minimizada.
ja_jp: グラフと倉庫ノードと車輌 (ルート) 数が所与の時、ルートのセットを探します。倉庫ノードを除くノードは厳密に一度カバーされ、ルートの合計距離は最小になるようにします。
ko: 그래프, depot 노드 및 차량 (경로) 수가 주어진 경우, 각 노드가 depot을 제외하고 정확히 한 번 커버되고 경로의 총 거리가 최소화되도록 경로 집합을 찾아라.
pt_un: Dado um grafo, um nó depósito, e um número de veículos (rotas), encontre um conjunto de rotas de modo que cada nó seja coberto exatamente uma vez, exceto o depósito, e a distância total das rotas seja minimizada.
ta_in: ஒரு வரைபடம் கொண்டு, ஒரு டிப்போ முனை மற்றும் வாகனங்களின் எண்ணிக்கை (வழித்தடங்கள்) ஆகியவற்றைக் கருத்தில் கொண்டு, டிப்போவைத் தவிர ஒவ்வொரு முனையும் சரியாக ஒரு முறை மூடப்பட்டிருக்கும் வழிகளின் தொகுப்பைக் கண்டுபிடித்து, பாதைகளின் மொத்த தூரம் குறைக்கப்படும் வழிகளின் தொகுப்பைக் கண்டறியவும்.
tr_tr: Bir grafik, bir birikim düğümü ve araç sayısı (rotalar) verildiğinde, her düğümün depo dışında tam olarak bir kez kapsanacağı ve rotaların toplam mesafesinin en aza indirileceği bir dizi rota bulun.

source: Vertex cover problem
bn_bn: ভারটেক্স কভার সমস্যা
es_un: Problema da la cobertura de vértices
ja_jp: 頂点被覆問題
ko: 정점 커버 문제
pt_un: Problema da cobertura de vértices
ta_in: வெர்டெக்ஸ் கவர் பிரச்சனை
tr_tr: Köşe örtme problemi

source: Given an undirected graph, find a subset of nodes with the minimum size such that each edge has at least one endpoint in the subsets.
bn_bn: একটি অনির্দেশিত গ্রাফ দেওয়া, ন্যূনতম আকারের নোডগুলির একটি উপসেট খুঁজুন যাতে প্রতিটি প্রান্তের উপসেটগুলিতে কমপক্ষে একটি শেষ বিন্দু থাকে।
es_un: Dado un grafo no dirigido, encuentra un subconjunto de nodos con el tamaño mínimo tal que cada arista tenga al menos un punto final en los subconjuntos.
ja_jp: 無向グラフが所与の時、それぞれのエッジが最低一つのエンドポイントを持つような、最小サイズのノードサブセットを探します。
ko: 무방향 그래프가 주어진 경우 각 가장자리에 부분 집합에 끝점이 하나 이상 있도록 최소 크기의 노드 부분 집합을 찾아라.
pt_un: Dado um grafo não direcionado, encontre um subconjunto de nós com o tamanho mínimo de modo que cada aresta tenha pelo menos uma ponta nos subconjuntos.
ta_in: திசைதிருப்பப்படாத வரைபடத்தைக் கொண்டு, ஒவ்வொரு விளிம்பும் துணைக்குழுக்களில் குறைந்தபட்சம் ஒரு முனையைக் கொண்டிருக்கும் வகையில் குறைந்தபட்ச அளவு கொண்ட முனைகளின் துணைக்குழுவைத் கண்டறியவும்.
tr_tr: Yönlendirilmemiş bir grafik verildiğinde, her bir kenarın alt kümelerde en az bir uç noktası olacak şekilde minimum boyutta bir düğüm alt kümesi bulun.

source: The application classes for graph problems (``GraphOptimizationApplication``) provide a functionality to draw graphs of an instance and a result. Note that you need to install ``matplotlib`` beforehand to utilize the functionality.
bn_bn: গ্রাফ সমস্যার জন্য অ্যাপ্লিকেশন ক্লাস (``GraphOptimizationApplication``) একটি দৃষ্টান্ত এবং ফলাফলের গ্রাফ আঁকার জন্য একটি কার্যকারিতা প্রদান করে। নোট করুন যে কার্যকারিতাটি ব্যবহার করার জন্য আপনাকে আগে থেকেই ``matplotlib`` ইনস্টল করতে হবে।
es_un: Las clases de aplicaciones para problemas de grafos (``GraphOptimizationApplication``) proporcionan una funcionalidad para dibujar los grafos de una instancia y un resultado. Ten en cuenta que debes instalar ``matplotlib`` de antemano para utilizar la funcionalidad.
ja_jp: グラフの問題のアプリケーション・クラス (``GraphOptimizationApplication``) は、インスタンスと結果のグラフを描画する機能を提供します。 この機能を利用するには、あらかじめ ``matplotlib`` をインストールする必要があることに注意してください。
ko: 그래프 문제에 대한 응용 클래스 (``GraphOptimizationApplication``) 는 인스턴스 및 결과의 그래프를 그리는 기능을 제공한다. 이 기능을 사용하려면 ``matplotlib`` 를 미리 설치해야 한다.
pt_un: As classes de aplicações para problemas de grafos (``GraphOptimizationApplication``) fornecem uma funcionalidade para desenhar grafos de uma instância e um resultado. Observe que você precisa instalar o ``matplotlib`` previamente para utilizar essa funcionalidade.
ta_in: வரைபடப் பிரச்சனைகளுக்கான விண்ணப்ப வகுப்புகள் (``GraphOptimizationApplication``) ஒரு நிகழ்வு மற்றும் முடிவின் வரைபடங்களை வரைய ஒரு செயல்பாட்டை வழங்குகிறது. செயல்பாட்டைப் பயன்படுத்த நீங்கள் ``matplotlib`` ஐ முன்பே நிறுவ வேண்டும் என்பதை நினைவில் கொள்க.
tr_tr: Grafik problemleri için uygulama sınıfları (``GraphOptimizationApplication``), bir örneğin ve bir sonucun grafiklerini çizmek için bir işlevsellik sağlar. İşlevi kullanmak için önceden ``matplotlib`` yüklemeniz gerektiğini unutmayın.

source: We introduce examples of the vertex cover problem and the knapsack problem in this page.
bn_bn: আমরা এই পৃষ্ঠায় ভারটেক্স কভার সমস্যা এবং ন্যাপস্যাক সমস্যার উদাহরণ উপস্থাপন করি।
es_un: Introducimos ejemplos del problema de la cobertura de vértices y el problema de la mochila (knapsack) en esta página.
ja_jp: このページでは、頂点被覆問題とナップサック問題の例を紹介します。
ko: 이 페이지에서 정점 커버 문제와 배낭 문제의 예를 소개한다.
pt_un: Apresentamos exemplos do problema da cobertura de vértices e do problema da mochila nesta página.
ta_in: இந்த பக்கத்தில் வெர்டெக்ஸ் கவர் பிரச்சனை மற்றும் நாப்சாக் பிரச்சனைக்கான உதாரணங்களை அறிமுகப்படுத்துகிறோம்.
tr_tr: Bu sayfada köşe örtme problemi ve sırt çantası problemi örneklerini tanıtıyoruz.

source: Examples of the max-cut problem and the traveling salesman problem are available in `Max-Cut and Traveling Salesman Problem <06_examples_max_cut_and_tsp.ipynb>`__.
bn_bn: ম্যাক্স-কাট সমস্যা এবং ট্রাভেলিং সেলসম্যান সমস্যার উদাহরণ `Max-Cut and Traveling Salesman Problem <06_examples_max_cut_and_tsp.ipynb>`__ তে পাওয়া যায়।
es_un: Ejemplos del problema max-cut y el problema del vendedor viajero están disponibles en `Max-Cut y Problema del Vendedor Viajero <06_examples_max_cut_and_tsp.ipynb>`__.
ja_jp: 最大カット問題と巡回セールスマン問題の例は `Max-Cut and Traveling Salesman Problem <06_examples_max_cut_and_tsp.ipynb>`__ にあります。
ko: 최대 절단 문제와 여행하는 외판원 문제의 예는 `Max-Cut and Traveling Salesman Problem <06_examples_max_cut_and_tsp.ipynb>`__ 에서 확인할 수 있다.
pt_un: Exemplos do problema de corte-máximo e do problema do caixeiro viajante estão disponíveis em `Max-Cut e Problema do Caixeiro Viajante <06_examples_max_cut_and_tsp.ipynb>`__.
ta_in: அதிகபட்ச வெட்டு பிரச்சனை மற்றும் பயண விற்பனையாளர் பிரச்சனையின் எடுத்துக்காட்டுகள் `Max-Cut and Traveling Salesman Problem <06_examples_max_cut_and_tsp.ipynb>`__. இல் கிடைக்கின்றன.
tr_tr: Maksimum Kesim problemi ve gezgin satıcı probleminin örnekleri `Max-Cut and Traveling Salesman Problem <06_examples_max_cut_and_tsp.ipynb>`__.

source: We first import packages necessary for application classes.
bn_bn: আমরা প্রথমে অ্যাপ্লিকেশন ক্লাসের জন্য প্রয়োজনীয় প্যাকেজ আমদানি করি।
es_un: Primero importamos los paquetes necesarios para las clases de aplicaciones.
ja_jp: 最初にアプリケーションクラスに必要なパッケージをインポートします。
ko: 응용 클래스에 필요한 패키지를 먼저 가져온담.
pt_un: Primeiro importamos os pacotes necessários para as classes de aplicações.
ta_in: பயன்பாட்டு வகுப்புகளுக்குத் தேவையான தொகுப்புகளை நாங்கள் முதலில் இறக்குமதி செய்கிறோம்.
tr_tr: İlk önce uygulama sınıfları için gerekli paketleri içe aktarıyoruz.

source: We introduce the application class for the vertex cover problem as an example of graph problems. Given an undirected graph, the vertex cover problem asks us to find a subset of nodes with the minimum size such that all edges are covered by any node selected.
bn_bn: আমরা গ্রাফ সমস্যার উদাহরণ হিসাবে শিরোনাম কভার সমস্যার জন্য অ্যাপ্লিকেশন ক্লাস চালু করি। একটি অনির্দেশিত গ্রাফ দেওয়া, শিরোনাম কভার সমস্যাটি আমাদেরকে ন্যূনতম আকারের নোডগুলির একটি উপসেট খুঁজে পেতে বলে, যাতে সমস্ত প্রান্তগুলি নির্বাচিত কোনও নোড দ্বারা আবৃত থাকে।
es_un: Introducimos la clase de aplicación para el problema de cobertura de vértices como un ejemplo de problemas de grafos. Dado un grafo no dirigido, el problema de la cobertura de vértices nos pide que busquemos un subconjunto de nodos con el tamaño mínimo tal que todas las aristas estén cubiertas por cualquier nodo seleccionado.
ja_jp: グラフの問題の例として、頂点被覆問題のアプリケーションクラスを紹介します。頂点被覆問題では、無向グラフを所与として、選択されたノードによって全てのエッジがカバーされるような、最小サイズのノードサブセットを検索することを求められます。
ko: 그래프 문제의 예로 정점 커버 문제에 대한 응용 클래스를 소개한다. 정점 커버 문제는 선택된 모든 노드에서 모든 가장자리를 커버 할 수 있는 최소 크기의 노드의 부분 집합을 찾도록 요구한다.
pt_un: Apresentamos a classe de aplicação para o problema da cobertura de vértices como um exemplo de problemas com grafos. Dado um grafo não direcionado, o problema da cobertura de vértices nos pede que encontremos um subconjunto de nós com o tamanho mínimo de modo que todas as arestas sejam cobertas por qualquer nó selecionado.
ta_in: வரைபடச் சிக்கல்களுக்கு உதாரணமாக, உச்சநிலைப் பிரச்சனைக்கான விண்ணப்ப வகுப்பை அறிமுகப்படுத்துகிறோம். திசைதிருப்பப்படாத வரைபடத்தைக் கொடுத்தால், வெர்டெக்ஸ் கவர் சிக்கல், தேர்ந்தெடுக்கப்பட்ட எந்த முனையிலும் அனைத்து விளிம்புகளும் மூடப்பட்டிருக்கும் வகையில் குறைந்தபட்ச அளவு கொண்ட முனைகளின் துணைக்குழுவை கண்டுபிடிக்கும்படி கேட்கிறது.
tr_tr: Graf problemlerine bir örnek olarak köşe örtüsü problemi için uygulama sınıfını tanıtıyoruz. Yönsüz bir grafik verildiğinde, köşe örtüsü problemi, tüm kenarları seçilen herhangi bir düğümle kaplanacak şekilde minimum boyutta bir düğüm alt kümesi bulmamızı ister.
