Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/10_warm_start_qaoa.po
Languages: bn_bn, es_un, ja_jp, ko, pt_un, ta_in

source: This page was generated from `docs/tutorials/10_warm_start_qaoa.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/10_warm_start_qaoa.ipynb`__ -থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `docs/tutorials/10_warm_start_qaoa.ipynb`__.
ja_jp: このページは `docs/tutorials/10_warm_start_qaoa.ipynb`__ から生成されました。
ko: 이 페이지는 `docs/tutorials/10_warm_start_qaoa.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/10_warm_start_qaoa.ipynb`__.
ta_in: இந்தப் பக்கம் `docs/tutorials/10_warm_start_qaoa.ipynb`__ இதிலிருந்து உருவாக்கப்பட்டது.

source: Warm-starting quantum optimization
bn_bn: কোয়ান্টাম অনুকূলকরণের (অপটিমাইজেশন) প্রস্তুতিপর্ব
es_un: Optimización cuántica de arranque en caliente (warm-starting)
ja_jp: ウォーム・スタート・量子最適化
ko: Warm-starting 양자 최적화
pt_un: Otimização quântica de warm-start
ta_in: குவாண்டம் மேம்படுத்தலுக்கான இதமான துவக்கம்

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
ja_jp: はじめに
ko: 소개
pt_un: Introdução
ta_in: முன்னுரை

source: Optimization problems with integer variables or constraints are often hard to solve. For example, the Quadratic Unconstrained Binary Optimization (QUBO) problem, i.e.
bn_bn: পূর্ণসংখ্যা জাতীয় চলরাশি বা শর্তবিশিষ্ট অনুকূলায়ন (অপ্টিমাইজেশন) সমস্যাসমূহর সমাধান করা সাধারণত জটিল হয়। উদাহরণস্বরূপ, শর্তহীন দ্বিঘাত দ্বিমিক অনুকূলায়ন (অপ্টিমাইজেশন) (কিউইউবিও (QUBO)) সমস্যা, অর্থাৎ
es_un: Los problemas de optimización con variables enteras o restricciones a menudo son difíciles de resolver. Por ejemplo, el problema de Optimización Binaria Cuadrática Sin Restricciones (Quadratic Unconstrained Binary Optimization, QUBO), es decir,
ja_jp: 整数変数や制約による最適化問題は、しばしば解くのが困難です。例えば、制約なし二次形式二値変数最適化(QUBO)問題 、すなわち
ko: 정수 변수나 제약 조건의 최적화 문제는 해결하기 어려운 경우가 많다. 예를 들어, Quadratic Unconstrained Binary Optimization (QUBO) 문제가 있다.
pt_un: Problemas de otimização com variáveis ou restrições inteiras costumam ser difíceis de solucionar. Por exemplo, o problema da Otimização Binária Irrestrita Quadrática (QUBO), ou seja.
ta_in: முழு மாறிகள் அல்லது கட்டுப்பாடுகளுடன் கூடிய தேர்வுமுறை சிக்கல்களைத் தீர்ப்பது பெரும்பாலும் கடினம். உதாரணமாக, குவாட்ராடிக் கட்டுப்பாடற்ற பைனரி ஆப்டிமைசேஷன் (QUBO) பிரச்சனை, அதாவது.

source: is NP-Hard. Here, :math:`\Sigma` is an :math:`n\times n` matrix and :math:`x` is a vector of :math:`n` binary variables. Note that we could have added the linear term :math:`\mu` to the diagonal as :math:`x_i^2=x_i` for :math:`x_i\in\{0, 1\}`. While QUBOs are hard to solve there exists many ways to relax them to problems that are easier to solve. For example, if :math:`\Sigma` is semi-definite positive the QUBO can be relaxed and results in a convex Quadratic Program
bn_bn: হলো এনপি-হার্ড। এখানে :math:`\Sigma` হলো একটি :math:`n\ গুণ n` ম্যাট্রিক্স এবং :math:`x` হলো :math:`n` দ্বিমিক (বাইনারি) চলরাশির দিকরাশি। মনে রেখো আমরা কর্ণে রৈখিক পদ :math:`\mu` যোগ করতে পারতাম, কারণ :math:`x_i^2=x_i` যখন :math:`x_i\in\{0, 1\}`। কিউইউবিও (QUBO) সমাধান করা কঠিন হলেও আমরা বিভিন্ন পদ্ধতিতে এগুলোকে শিথিল করে সমাধানযোগ্য করতে পারি। উদাহরণস্বরূপ, যদি :math:`\Sigma` একটা অর্ধ-নিশ্চিত ধনাত্মক তাহলে কিউইউবিও (QUBO) -কে শিথিল করে একটা উত্তল দ্বিঘাত (কোয়াড্রাটিক) নির্দেশমালাতে পরিবর্তন করা যায়
es_un: es NP difícil. Aquí, :math:`\Sigma` es una matriz :math:`n\times n` y :math:`x` es un vector de :math:`n` variables binarias. Ten en cuenta que podríamos haber agregado el término lineal :math:`\mu` a la diagonal como :math:`x_i^2=x_i` para :math:`x_i\in\{0, 1\}`. Si bien los QUBO son difíciles de resolver, existen muchas formas de relajarlos a problemas que son más fáciles de resolver. Por ejemplo, si :math:`\Sigma` es semi-definido positivo, el QUBO se puede relajar y da como resultado un Programa Cuadrático convexo
ja_jp: は NP-Hard です。ここで、:math:`\Sigma` は :math:`n\times n` 行列で :math:`x` は :math:`n` 次のバイナリー値のベクトルです。ここで :math:`x_i^2=x_i` for :math:`x_i\in\{0, 1\}` なので対角成分に線形項 :math:`\mu` を加えても良いことに注意してください。QUBO は解くのが難しいですが、解きやすい問題に緩和するたくさんの方法があります。例えば、もし :math:`\Sigma` が半正定値ならば QUBO は凸二次最適化問題に帰着します。
ko: 이는 NP-Hard이다.여기서 :math:`\Sigma` 는 :math:`n\times n` 매트릭스이고 :math:`x` 는 :math:`n` 이진 변수의 벡터이다. 참고로 일차항 :math:`\mu` 를 대각선에 :math:`x_i\in\{0, 1\}` 의 :math:`x_i^2=x_i` 로 추가할 수 있었다. QUBO는 해결하기 어렵지만 해결하기 쉬운 문제로 완화시킬 수 있는 많은 방법이 있다. 예를 들어, :math:`\Sigma` 가 반확정 양극이면 QUBO가 완화될 수 있고 convex Quadratic Program이 된다.
pt_un: é NP-difícil. Aqui, :math:`\Sigma` é uma matriz :math:`n\times n` e :math:`x` é um vetor com :math:`n` variáveis binárias. Observe que nós poderíamos ter adicionado o termo linear :math:`\mu` à diagonal como :math:`x_i^2=x_i` para :math:`x_i\in\{0, 1\}`. Enquanto QUBOs são difíceis de resolver, existem diversas maneiras de relaxá-los em problemas que são mais fáceis de solucionar. Por exemplo, se :math:`\Sigma` for semidefinida positiva, a QUBO pode ser relaxada e resulta em um Programa Quadrático convexo
ta_in: nP- கடினமானது.இங்கே, :math:`\Sigma` என்பது ஒரு ::math:`n\times n` மேட்ரிக்ஸ் மற்றும் :math:`x` என்பது :math:`n` பைனரி மாறிகளின் ஒரு திசையன்.நேரியல் சொல்லை :math:`\mu` என மூலைவிட்டத்தில் சேர்த்திருக்கலாம் என்பதை நினைவில் கொள்க :math:`x_i^2=x_i` என்பதற்கு :math:`x_i\in\{0, 1\}`.தீர்க்க கடினமாக இருக்கும் போது தீர்க்க எளிதான துகள்களுக்கு அவற்றை தளர்த்த பல வழிகள் உள்ளன.உதாரணமாக, என்றால் :math:`\Sigma` அரை-உறுதியான நேர்மறையானது QUBO தளர்த்தப்பட்டு ஒரு குவிந்த இருபடி திட்டத்தில் விளைகிறது

source: which becomes easy to solve as :math:`x` now represents :math:`n` continuous variables bound to the range :math:`[0, 1]`. Such relaxations can be leveraged to warm-start quantum optimization algorithms as shown in [1].
bn_bn: যেটার সমাধান তুলনামূলকভাবে সহজ কারণ :math:`x` এখন :math:`n` গুলো :math:`[0, 1]` সীমার মধ্যে সীমিত অবিচ্ছিন্ন চলরাশির প্রতিনিধিত্ব করে। এরকম শিথিলকরণ (রিলাক্সেশন) এর উপর নির্ভর করে কোয়ান্টাম অনুকূলকরণ (অপটিমাইজেশন) অ্যালোগরিদমের প্রস্তুতি নেওয়া যেতে পারে (চিত্র [১])।
es_un: que se vuelve fácil de resolver como :math:`x` ahora representa :math:`n` variables continuas restringidas al rango :math:`[0, 1]`. Estas relajaciones pueden aprovecharse para arrancar en caliente (warm-start) algoritmos de optimización cuántica como se muestra en [1].
ja_jp: これは :math:`x` で簡単に解けるようになりました。ここで :math:`n` は :math:`[0, 1]` の範囲の連続変数です。このような緩和は [1] にあるように、ウォーム・スタート量子最適化問題に活用できます。
ko: 이는 :math:`x` 가 :math:`[0, 1]` 범위에 바인딩된 :math:`n` 연속 변수를 나타내므로 쉽게 해결할 수 있다. 이러한 완화는 [1]에 나온 것처럼 양자 최적화 알고리즘을 warm-start하는 데 활용할 수 있다.
pt_un: que se torna fácil de resolver, já que :math:`x` agora representa :math:`n` variáveis contínuas restritas ao intervalo :math:`[0, 1]`. Tais relaxações podem ser usadas para algoritmos de otimização quântica de warm-start, como mostrado em [1].
ta_in: இது தீர்க்க எளிதானது:math: `x` இப்போது குறிக்கிறது:math:` n` வரம்பிற்கு கட்டுப்பட்ட தொடர்ச்சியான மாறிகள்:math: `[0, 1]`. இத்தகைய தளர்வுகள் [1] இல் காட்டப்பட்டுள்ளபடி இதமான-துவக்க குவாண்டம் மேம்படுத்தல் வழிமுறைகளுக்கு உதவலாம்.

source: References
bn_bn: তথ্যসূত্র
es_un: Referencias
ja_jp: 参考文献
ko: 참조
pt_un: Referências
ta_in: குறிப்புகள்

source: [1] `D. J. Egger, J Marecek, S. Woerner, Warm-starting quantum optimization, arXiv:2009.10095 <http://arxiv.org/abs/2009.10095>`__
bn_bn: [১] `D. J. Egger, J Marecek, S. Woerner, Warm-starting quantum optimization, arXiv:2009.10095 <http://arxiv.org/abs/2009.10095>`__

source: Preliminaries: relaxing QUBOs
bn_bn: প্রাথমিক: কিউইউবিও (QUBO) এর শিথিলকরণ
es_un: Preliminares: relajando QUBOs
ja_jp: 準備：QUBO の緩和
ko: 사전 준비: QUBO 완화(relaxing)
pt_un: Preliminares: relaxando QUBOs
ta_in: முதல் கட்டம்: QUBOகளின் ஆசுவாசப்படுத்தல்

source: First, we show how to relax a QUBO built with a semi-definite positive matrix to obtain an easy-to-solve QP.
bn_bn: প্রথমে আমরা দেখবো কিভাবে একটা অর্ধ-নিশ্চিত ধনাত্মক ম্যাট্রিক্স দ্বারা বানানো কিউইউবিও (QUBO) এর শিথিলকরন করে একটা সহজ কিউপি বানানো যায়।
es_un: Primero, mostramos cómo relajar un QUBO construido con una matriz semi-definida positiva para obtener un QP fácil de resolver.
ja_jp: まず、半確定正の行列で構築された QUBO をリラックスして、解決しやすい QP を実現する方法を説明します。
ko: 먼저, 반확정 양극 매트릭스로 구축된 QUBO를 완화해 쉽게 해결하여 QP를 얻는 방법을 보여 준다.
pt_un: Primeiramente, mostramos como relaxar QUBOs criadas com uma matriz semidefinida positiva para obter um QP fácil de ser resolvido.
ta_in: முதலில், ஒரு சுலபமாக தீர்க்கக்கூடிய QP ஐப் பெற அரை-வரையறுக்கப்பட்ட நேர்மறை மேட்ரிக்ஸுடன் கட்டப்பட்ட ஒரு QUBO ஐ எவ்வாறு தளர்த்துவது என்பதை நாங்கள் காண்பிக்கிறோம்.

source: For this example, we use a positive semi-definite matrix :math:`\Sigma` and a linear term :math:`\mu` as defined below.
bn_bn: এই উদাহরণে আমরা নিম্নলিখিত একটা ধনাত্মক অর্ধনিশ্চিত ম্যাট্রিক্স :math:`\Sigma` এবং একটা রৈখিক পদ :math:`\mu` ব্যবহার করব।
es_un: Para este ejemplo, usamos una matriz semi-definida positiva :math:`\Sigma` y un término lineal :math:`\mu` como se define a continuación.
ja_jp: この例では、以下に定義する半正定値行列 :math:`\Sigma` と線形項 :math:`\mu` を使用します。
ko: 이 예에서는 아래에 정의된 양극의 반확정 행렬 :math:`\Sigma` 와 일차항 :math:`\mu` 를 사용한다.
pt_un: Para esse exemplo, usamos uma matriz semidefinida positiva :math:`\Sigma` e um termo linear :math:`\mu` como definido abaixo.
ta_in: இந்த எடுத்துக்காட்டுக்கு, நாங்கள் ஒரு நேர்மறையான அரை வரையறுக்கப்பட்ட மேட்ரிக்ஸைப் பயன்படுத்துகிறோம் :math:`\Sigma` மற்றும் ஒரு நேரியல் சொல் :math:`\mu` கீழே வரையறுக்கப்பட்டபடி.

source: Using DOCPLEX we build a model with binary variables.
bn_bn: ডকপ্লেক্স ব্যবহার করে আমরা দ্বিমিক (বাইনারি) চলরাশিবিশিষ্ট একটা মডেল বানাবো।
es_un: Utilizando DOCPLEX construimos un modelo con variables binarias.
ja_jp: DOCPLEXを使用して、バイナリ変数のモデルを構築します。
ko: DOCPLEX를 사용하여 이진 변수를 사용한 모델을 구축한다.
pt_un: Usando DOCPLEX, nós construímos um modelo com variáveis binárias.
ta_in: DOCPLEX ஐப் பயன்படுத்தி பைனரி மாறிகள் கொண்ட ஒரு மாதிரியை உருவாக்குகிறோம்.

source: Such binary problems are hard to deal with but can be solved if the problem instance is small enough. Our example above has as solution
bn_bn: এমন দ্বিমিক (বাইনারি) সমস্যা সমাধান করা কঠিন, কিন্তু সমস্যার দৃষ্টান্ত (ইনস্ট্যান্স) ছোট হলে সমাধান সম্ভব। উপরের উদাহরণের সমাধান আছে
es_un: Tales problemas binarios son difíciles de tratar, pero se pueden resolver si la instancia del problema es lo suficientemente pequeña. Nuestro ejemplo anterior tiene como solución
ja_jp: このようなバイナリー問題は扱いにくいですが、問題のインスタンスが十分に小さい場合は解くことができます。上記の例では次の解を持ちます。
ko: 이러한 이진 문제는 해결하기 어렵지만 문제 인스턴스가 충분히 작다면 해결할 수 있다. 위의 예는 해결책이다.
pt_un: Problemas binários desse tipo são difíceis de se trabalhar com, mas podem ser solucionados se a instância do problema for pequena o suficiente. Nosso exemplo acima possui uma solução
ta_in: இத்தகைய பைனரி பிரச்சனைகளை சமாளிக்க கடினமாக உள்ளது ஆனால் பிரச்சனை நிகழ்வு சிறியதாக இருந்தால் தீர்க்க முடியும். மேலே உள்ள எங்கள் உதாரணம் தீர்வாக உள்ளது

source: We can create a relaxation of this problem in which the variables are no longer binary. Note that we use the ``QuadraticProgramToQubo`` converter to convert the constraint into a quadratic penalty term. We do this to remain consistent with the steps that the Qiskit optimization module applies internally.
bn_bn: আমরা এই সমস্যার একটি শিথিলতা তৈরি করতে পারি যেখানে ভেরিয়েবল আর বাইনারি নয়। মনে রাখবেন যে আমরা ``QuadraticProgramToQubo`` কনভার্টার ব্যবহার করে সীমাবদ্ধতাকে দ্বিঘাত পেনাল্টি টার্মে রূপান্তর করি। Qiskit অপ্টিমাইজেশন মডিউলটি অভ্যন্তরীণভাবে প্রযোজ্য ধাপগুলির সাথে সামঞ্জস্যপূর্ণ থাকার জন্য আমরা এটি করি।
es_un: Podemos crear una relajación de este problema en el que las variables ya no son binarias. Ten en cuenta que usamos el convertidor ``QuadraticProgramToQubo`` para transformar la restricción en un término de penalización cuadrático. Hacemos esto para mantener la coherencia con los pasos que aplica internamente el módulo de optimización de Qiskit.
ja_jp: この問題は変数がもはやバイナリーではない問題に緩和することができます。制約を2次ペナルティ項に変換するために、``QuadraticProgramToQubo`` コンバーターを使用することに注意してください。Qiskit 最適化モジュールが内部的に適用するステップと整合性を保つためにこれを行います。
ko: 변수가 더 이상 이진수가 아닌 이 문제의 완화를 생성할 수 있다. ``QuadraticProgramToQubo`` 변환기를 사용하여 제약 조건을 quadratic penalty term으로 변환한다. Qiskit 최적화 모듈이 내부적으로 적용하는 단계와 일관성을 유지하기 위해 이 작업을 수행한다.
pt_un: Podemos criar uma relaxação desse problema na qual as variáveis não são mais binárias. Note que nós usamos o conversor ``QuadraticProgramToQubo`` para converter a restrição em um termo de penalidade quadrático. Nós fazemos isso para seguirmos consistentes com os passos que o módulo de otimização do Qiskit realiza internamente.
ta_in: மாறிகள் இனி பைனரி இல்லாத இந்தப் பிரச்சினையின் தளர்வை நாம் உருவாக்கலாம். நாங்கள் பயன்படுத்துகிறோம் என்பதை நினைவில் கொள்க ``QuadraticProgramToQubo`` தடையை இருபடி தண்டனையாக மாற்ற மாற்றி. கிஸ்கிட் ஆப்டிமைசேஷன் தொகுதி உள்நாட்டில் பொருந்தும் படிகளுடன் தொடர்ந்து இருக்க நாங்கள் இதைச் செய்கிறோம்.

source: The solution of this continuous relaxation is different from the solution to the binary problem but can be used to warm-start a solver when dealing with the binary problem.
bn_bn: এই ক্রমাগত শিথিলকরণ (রিলাক্সেশন) সমাধান বাইনারি সমস্যার সমাধান থেকে আলাদা কিন্তু বাইনারি সমস্যা মোকাবেলার সময় সমাধানকারীকে উষ্ণ-শুরু করতে ব্যবহার করা যেতে পারে।
es_un: La solución de esta relajación continua es diferente de la solución del problema binario, pero se puede utilizar para iniciar en caliente (warm-start) un solucionador cuando se trata de un problema binario.
ja_jp: この連続的な緩和の解はバイナリー問題の解と異なりますが、バイナリー問題を扱う限りソルバーをウォーム・スタートするために使用することができます。
ko: 이 지속적인 완화의 해결책은 이진 문제에 대한 해결책과는 다르지만 이진 문제를 처리할 때 해결사를 warm-start 하는 데 사용할 수 있다.
pt_un: A solução dessa relaxação contínua é diferente da solução do problema binário, mas pode ser usada como warm-start (suposição inicial) para um solucionador quando lidando com o problema binário.
ta_in: இந்த தொடர்ச்சியான தளர்வுக்கான தீர்வு பைனரி பிரச்சனைக்கான தீர்விலிருந்து வேறுபட்டது, ஆனால் பைனரி பிரச்சனையை கையாளும் போது ஒரு தீர்வை சூடாக தொடங்க பயன்படுத்தலாம்.

source: QAOA
bn_bn: কিউএওএ (QAOA)

source: Here, we illustrate how to warm-start the quantum approximate optimization algorithm (QAOA) by leveraging the relaxed problem shown above.
bn_bn: এখানে, আমরা দেখিয়েছি কিভাবে উপরে দেখানো শিথিলকরণ সমস্যাটি ব্যবহার করে কোয়ান্টাম অ্যাপ্রক্সিমেইট অপ্টিমাইজেশন অ্যালগরিদম (QAOA) উষ্ণ-শুরু করতে হয়।
es_un: Aquí, ilustramos cómo arrancar en caliente (warm-start) el algoritmo cuántico de optimización aproximada (quantum approximate optimization algorithm, QAOA) aprovechando el problema relajado que se muestra arriba.
ja_jp: ここでは、上記の緩和された問題を活用することにより、量子近似最適化アルゴリズム ( QAOA) をウォーム・スタートする方法を説明します。
ko: 여기서는 위에 표시된 완화된 문제를 활용하여 quantum approximate optimization algorithm (QAOA) 을 warm-start하는 방법을 설명한다.
pt_un: Aqui, ilustramos como fazer o warm-start do algoritmo de otimização aproximada quântica (QAOA) aproveitando o problema relaxado mostrado acima.
ta_in: மேலே காட்டப்பட்டுள்ள தளர்வான சிக்கலை மேம்படுத்துவதன் மூலம் குவாண்டம் தோராயமான ஆப்டிமைசேஷன் வழிமுறை (QAOA) எப்படி சூடாகத் தொடங்குவது என்பதை இங்கு விளக்குகிறோம்.

source: Standard QAOA
bn_bn: সাধারণ কিউএওএ (QAOA)
es_un: QAOA estándar
ja_jp: 標準的な QAOA
ko: 표준 QAOA
pt_un: QAOA padrão
ta_in: நிலையான QAOA

source: First, we use standard QAOA to solve the QUBO. To do this, we convert the QUBO to Qiskit’s QuadraticProgram class (note that the resulting problem is still a binary problem).
bn_bn: প্রথমে, আমরা QUBO সমাধান করার জন্য স্ট্যান্ডার্ড QAOA ব্যবহার করি। এটি করার জন্য, আমরা কিউইউবিও (QUBO) কে কিস্কিটের QuadraticProgram ক্লাসে রূপান্তর করি (লক্ষ্য করুন যে ফলাফলটি এখনও একটি বাইনারি সমস্যা)।
es_un: Primero, usamos QAOA estándar para resolver el QUBO. Para hacer esto, convertimos QUBO a la clase QuadraticProgram de Qiskit (ten en cuenta que el problema resultante sigue siendo un problema binario).
ja_jp: まず標準の QAOA を使用して、QUBOを解きます。これを行うために、QUBO を Qiskit の QuadraticProgram クラスに変換します (結果として生じる問題は依然としてバイナリー問題であることに注意してください) 。
ko: 먼저 표준 QAOA를 사용하여 QUBO를 해결한다. 이를 위해 QUBO를 Qiskit의 QuadraticProgram 클래스로 변환한다 (결과적인 문제는 여전히 이진 문제인것을 주의하자).
pt_un: Primeiro, nós usamos o QAOA padrão para resolver a QUBO. Para isso, convertemos a QUBO para a classe QuadraticProgram do Qiskit (note que o problema resultante ainda é um problema binário).
ta_in: முதலில், QUBO ஐத் தீர்க்க நாங்கள் நிலையான QAOA ஐப் பயன்படுத்துகிறோம். இதைச் செய்ய, நாங்கள் QUBO ஐ Qiskit டின் இருபடி நிரல் வகுப்பிற்கு மாற்றுகிறோம் (இதன் விளைவாக வரும் பிரச்சினை இன்னும் பைனரி பிரச்சனை என்பதை நினைவில் கொள்க).

source: Warm-start QAOA
bn_bn: কিউএওএ (QAOA) এর প্রস্তুতি
es_un: QAOA de arranque en caliente (warm-start)
ja_jp: ウォーム・スタート QAOA
pt_un: Warm-start do QAOA
ta_in: QAOA உடன் இதமான தொடக்கம்

source: Next, we compare this result to a warm-start QAOA in which we use the solution to the continuous relaxation of the problem. First, we create the initial state
bn_bn: পরবর্তী, আমরা এই ফলাফলটিকে একটি উষ্ণ-শুরু QAOA এর সাথে তুলনা করি যেখানে আমরা সমস্যার অবিরাম শিথিলতার সমাধান ব্যবহার করি। প্রথমত, আমরা প্রাথমিক মান বা অবস্থা তৈরি করি
es_un: A continuación, comparamos este resultado con un QAOA de arranque en caliente (warm-start) en el que usamos la solución para la relajación continua del problema. Primero, creamos el estado inicial
ja_jp: 次に、この結果をウォーム・スタート QAOA と比較します。この QAOA には連続的な緩和を行った問題の解を使います。最初に、初期状態を作成します。
ko: 다음으로, 이 결과를 문제의 지속적인 완화에 대한 솔루션을 사용하는 warm-start QAOA와 비교한다. 먼저 초기 상태를 아래와 같이 생성한다.
pt_un: Em seguida, comparamos este resultado com um QAOA de warm-start em que utilizamos a solução para o relaxamento contínuo do problema. Primeiro, criamos o estado inicial
ta_in: அடுத்து, இந்த முடிவை ஒரு சூடான தொடக்க QAOA உடன் ஒப்பிடுகிறோம், அதில் சிக்கலின் தொடர்ச்சியான தளர்வுக்கான தீர்வைப் பயன்படுத்துகிறோம். முதலில், நாம் ஆரம்ப நிலையை உருவாக்குகிறோம்

source: which is given by applying :math:`R_y` rotations with an angle :math:`\theta=2\arcsin(\sqrt{c^*_i})` that depends on the solution to the relaxed problem. Here, :math:`c^*_i` the value of variable :math:`i` of the relaxed problem.
bn_bn: যা :math:`\theta=2\arcsin(\sqrt{c^*_i})` কোণ দিয়ে :math:`R_y` ঘূর্ণন প্রয়োগ করে দেওয়া হয় যা আরামদায়ক সমস্যার সমাধানের উপর নির্ভর করে। এখানে, :math:`c^*_i` হল আরামদায়ক সমস্যার পরিবর্তনশীল y এর মান।
es_un: que se obtiene aplicando rotaciones :math:`R_y` con un ángulo :math:`\theta=2\arcsin(\sqrt{c^*_i})` que depende de la solución al problema relajado. Aquí, :math:`c^*_i` es el valor de la variable :math:`i` del problema relajado.
ja_jp: これは :math:`R_y` 回転を角 :math:`\theta=2\arcsin(\sqrt{c^*_i})` で適用することで与えられます。この角は緩和した問題の解に依存します。ここで :math:`c^*_i` は緩和した問題の変数 :math:`i` の値です。
ko: 이것은 완화된 문제에 대한 해결책에 의존하는 각도 :math:`\theta=2\arcsin(\sqrt{c^*_i})` 로 :math:`R_y` 회전을 적용하여 주어진다. 여기서 :math:`c^*_i` 는 완화된 문제의 가변 :math:`i` 값을 나타낸다.
pt_un: que se obtém aplicando rotações :math:`R_y` com um ângulo :math:`\theta=2\arcsin(\sqrt{c^*_i})` que depende da solução do problema relaxado. Aqui, :math:`c^*_i` é o valor da variável :math:`i` do problema relaxado.
ta_in: இது விண்ணப்பிப்பதன் மூலம் வழங்கப்படுகிறது :math:`R_y` ஒரு கோணத்துடன் சுழற்சி:math:`\theta=2\arcsin(\sqrt{c^*_i})` அது தளர்வான பிரச்சனைக்கான தீர்வைப் பொறுத்தது. இங்கே, :math:`c^*_i` the value of variable :math:`i` தளர்வான பிரச்சனை.

source: Next, we create the mixer operator for QAOA. When warm-starting QAOA we must ensure that the mixer operator has the initial state as ground state. We therefore chose the Hamiltonian
bn_bn: পরবর্তী, আমরা QAOA এর জন্য মিক্সার অপারেটর তৈরি করি। QAOA শুরু করার সময় আমাদের অবশ্যই নিশ্চিত করতে হবে যে মিক্সার অপারেটরের প্রাথমিক অবস্থা গ্রাউন্ড স্টেট হিসাবে আছে। তাই আমরা হ্যামিল্টোনিয়ানকে বেছে নিয়েছি
es_un: Después, creamos el operador mezclador para QAOA. Al arrancar QAOA en caliente (warm-starting), debemos asegurarnos de que el operador del mezclador tenga el estado inicial como estado fundamental. Por lo tanto, elegimos el Hamiltoniano
ja_jp: 次に QAOA のミキサー演算子を作成します。ウォーム・スタート QAOA では、ミキサー演算子の初期状態が基底状態になっていることを確認する必要があります。そのため次のハミルトニアンを選びます
ko: 다음으로, QAOA의 mixer 연산자를 생성한다. QAOA를 warm-start할 때 mixer 연산자가 초기 상태를 기저 상태로 유지해야 한다. 따라서 아래와 같이 Hamiltonian을
pt_un: Em seguida, criamos o operador misturador para o QAOA. Quando fazemos o warm-start do QAOA, devemos garantir que o operador misturador tem o estado inicial como estado fundamental. Portanto, escolhemos o Hamiltoniano
ta_in: அடுத்து, நாங்கள் QAOA க்கான கலவை ஆபரேட்டரை உருவாக்குகிறோம். QAOA- வை சூடு-தொடங்கும் போது, ​​மிக்சர் ஆபரேட்டருக்கு ஆரம்ப நிலை நில நிலமாக இருப்பதை உறுதி செய்ய வேண்டும். எனவே நாங்கள் ஹாமில்டோனியனைத் தேர்ந்தெடுத்தோம்

source: as mixer operator for qubit :math:`i`. Once multiplied by :math:`-i\beta` and exponentiated this mixer produces the following mixer circuit.
bn_bn: কিউবিট :math:`i` এর জন্য মিক্সার অপারেটর হিসাবে। একবার :math:`-i\beta` দ্বারা গুণিত এবং এক্সপোনেন্টিয়েটেড এই মিক্সার নিম্নলিখিত মিক্সার সার্কিট তৈরি করে।
es_un: como operador mezclador para el qubit :math:`i`. Una vez multiplicado por :math:`-i\beta` y exponenciado, este mezclador produce el siguiente circuito mezclador.
ja_jp: これは量子ビット :math:`i` のミキサー演算子のハミルトニアンです。 :math:`-i\beta` を乗じ指数をとると、このミキサーは次のミキサー回路を生成します。
ko: 큐비트 :math:`i` 에 대한 혼합 연산자로 사용된다. :math:`-i\beta` 를 곱하고 지수화하면 혼합기는 다음과 같은 혼합 회로를 생성한다.
pt_un: como operador misturador para o qubit :math:`i`. Uma vez multiplicado por :math:`-i\beta` e exponenciado, este misturador produz o seguinte circuito misturador.
ta_in: க்யூபிட்டுக்கான மிக்சர் ஆபரேட்டராக :math:`i`. :math:`-i\beta` ஆல் ஒருமுறை பெருக்கப்படுகிறது மேலும் இந்த மிக்சர் பின்வரும் மிக்சர் சர்க்யூட்டை உருவாக்குகிறது.

source: The initial state and mixer operator can then be passed to QAOA.
bn_bn: প্রাথমিক অবস্থা এবং মিক্সার অপারেটর তারপর QAOA এর কাছে প্রেরণ করা যেতে পারে।
es_un: El estado inicial y el operador mezclador se pueden pasar a QAOA.
ja_jp: こうして初期状態とミキサー演算子は QAOA に渡すことができます。
ko: 초기 상태 및 혼합 연산자는 이제 QAOA로 전달될 수 있다.
pt_un: O estado inicial e o operador do misturador podem então ser passados para o QAOA.
ta_in: ஆரம்ப நிலை மற்றும் கலவை ஆபரேட்டர் பின்னர் QAOA க்கு அனுப்பப்படலாம்.

source: Analysis
bn_bn: বিশ্লেষণ
es_un: Análisis
ja_jp: 分析
ko: 분석
pt_un: Análise
ta_in: பகுப்பாய்வு

source: Both results appear to give the same result. However, when we look at the underlying probability distribution we observe that the warm-start QAOA has a much higher probability of sampling the optimal solution.
bn_bn: উভয় ফলাফল একই ফলাফল দিতে প্রদর্শিত হবে। যাইহোক, যখন আমরা অন্তর্নিহিত সম্ভাব্যতা বিতরণের দিকে তাকাই তখন আমরা লক্ষ্য করি যে উষ্ণ-শুরু QAOA এর সর্বোত্তম সমাধানের নমুনা দেওয়ার সম্ভাবনা অনেক বেশি।
es_un: Ambos resultados parecen dar el mismo resultado. Sin embargo, cuando observamos la distribución subyacente de probabilidades observamos que el arranque en caliente (warm-start) de QAOA tiene una probabilidad mucho mayor de muestrear la solución óptima.
ja_jp: どちらの結果も同じ結果を与えます。しかし、基礎となる確率分布を観察すると、ウォーム・スタート QAOA は最適なソリューションをサンプリングする確率が高くなることが観察されます。
ko: 두 결과는 동일한 결과를 제공하는 것으로 보인다. 그러나 기본 확률 분포를 살펴보면 warm-start QAOA가 최적 솔루션을 sampling할 확률이 훨씬 더 높다는 것을 알 수 있다.
pt_un: Ambas soluções parecem dar o mesmo resultado. No entanto, quando olhamos a distribuição de probabilidade subjacente, observamos que o QAOA de warm-start tem uma probabilidade muito maior de amostrar a solução ótima.
ta_in: இரண்டு முடிவுகளும் ஒரே முடிவைக் கொடுக்கும். இருப்பினும், அடிப்படை நிகழ்தகவு விநியோகத்தைப் பார்க்கும்போது, ​​சூடான-தொடக்க QAOA உகந்த தீர்வை மாதிரியாக்குவதற்கான அதிக நிகழ்தகவு இருப்பதை நாங்கள் கவனிக்கிறோம்.
