Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/10_warm_start_qaoa.po
Languages: bn_bn, es_un, ja_jp, ko, pt_un, ta_in

source: The warm-start features above are available in the Qiskit optimization module as a single optimizer named ``WarmStartQAOAOptimizer`` which is illustrated below. This solver will solve a QUBO with a warm-start QAOA. It computes :math:`c^*` by relaxing the problem. This behavior is controlled by setting ``relax_for_pre_solver`` to ``True``.
bn_bn: উপরের উষ্ণ-শুরু বৈশিষ্ট্যগুলি কিস্কিট অপ্টিমাইজেশান মডিউলে ``WarmStartQAOAOptimizer`` নামে একটি একক অপ্টিমাইজার হিসাবে উপলব্ধ যা নীচে চিত্রিত করা হয়েছে। এই সমাধানকারী একটি উষ্ণ-শুরু QAOA দিয়ে একটি QUBO সমাধান করবে। এটি সমস্যাকে শিথিল করে :math:`c^*` গণনা করে। এই আচরণ ``relax_for_pre_solver`` থেকে ``True`` সেট করে নিয়ন্ত্রিত হয়।
es_un: Las características del inicio en caliente (warm-start) anteriores están disponibles en el módulo de optimización de Qiskit como un optimizador único llamado ``WarmStartQAOAOptimizer`` que se ilustra a continuación. Este solucionador resolverá un QUBO con un QAOA de arranque en caliente (warm-start). Calcula :math:`c^*` relajando el problema. Este comportamiento se controla configurando ``relax_for_pre_solver`` en ``True``.
ja_jp: 上記の warm-start 機能は、下にある ``WarmStartQAOAOptimizer`` という名前の単一のオプティマイザーとして、Qiskit 最適化モジュールで利用可能です。このソルバーはウォーム・スタート QAOA で QUBO を解きます。それは問題を緩和することによって :math:`c^*` を計算します。この動作は ``relax_for_pre_solver`` を ``True`` に設定することで制御できます。
ko: 위의 warm-start 기능은 아래 나온 것처럼 Qiskit 최적화 모듈에서 ``WarmStartQAOAOptimizer`` 라는 단일 optimizer로 사용할 수 있다. 이 해석기는 warm-start QAOA로 QUBO를 해결할 것이다. 문제를 완화하여 :math:`c^*` 를 계산한다. 이 동작은 ``relax_for_pre_solver`` 를 ``True`` 로 설정하여 제어한다.
pt_un: As funcionalidades de warm-start acima estão disponíveis no módulo de otimização do Qiskit como um único otimizador denominado ``WarmStartQAOAOptimizer``, que é ilustrado abaixo. Este solucionador resolverá um QUBO com um QAOA de warm-start. Ele calcula :math:`c^*` relaxando o problema. Este comportamento é controlado ao configurar ``relax_for_pre_solver`` como ``True``.
ta_in: மேலே உள்ள இதமான-தொடக்க அம்சங்கள் க்விஸ்கிட் ஆப்டிமைசேஷன் தொகுதியில் ``WarmStartQAOAOptimizer`` என பெயரிடப்பட்ட ஒற்றை ஆப்டிமைசராகக் கிடைக்கின்றன இது கீழே விளக்கப்பட்டுள்ளது. இந்த தீர்வு ஒரு QUBO ஐ ஒரு இதமான-தொடக்க QAOA உடன் தீர்க்கும். இது :math:`c^*` ஐ பிரச்சனையை தளர்த்துவதன் மூலம் கணக்கிடுகிறது. இந்த நடத்தை ``relax_for_pre_solver`` க்கு ``True``அமைப்பால் கட்டுப்படுத்தப்படுகிறது.
