Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/11_using_classical_optimization_solvers_and_models.po
Languages: bn_bn, es_un, ja, ko_kr, pt_un, ta_in, zh_tw

source: This page was generated from `docs/tutorials/11_using_classical_optimization_solvers_and_models.ipynb`__.
bn_bn: এই পৃষ্ঠাটি তৈরি হয়েছে `docs/tutorials/11_using_classical_optimization_solvers_and_models.ipynb`__ থেকে।
es_un: Esta página fue generada a partir de `docs/tutorials/11_using_classical_optimization_solvers_and_models.ipynb`__.
ja: このページは、 `docs/tutorials/11_using_classical_optimization_solvers_and_models.ipynb`__ によって生成されました。
ko_kr: 이 페이지는 `docs/tutorials/11_using_classical_optimization_solvers_and_models.ipynb` 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/11_using_classical_optimization_solvers_and_models.ipynb`__.
ta_in: இந்தப் பக்கம் `docs/tutorials/11_using_classical_optimization_solvers_and_models.ipynb`__ இதிலிருந்து உருவாக்கப்பட்டது.
zh_tw: 此頁面是從 `docs/tutorials/11_using_classical_optimization_solvers_and_models.ipynb`__ 產生的。

source: Using Classical Optimization Solvers and Models with Qiskit Optimization
bn_bn: Qiskit অপ্টিমাইজেশনের সাথে ক্লাসিক্যাল অপ্টিমাইজেশন সলভার এবং মডেল ব্যবহার করা
es_un: Uso de Modelos y Solucionadores de Optimización Clásicos con Qiskit Optimization
ja: Qiskit Optimization での古典的最適化ソルバーとモデルの使用
ko_kr: 고전 최적화 해석기와 모델을 Qiskit 최적화와 함께 사용하기
pt_un: Utilizando Modelos e Solucionadores de Otimização Clássicos com o Qiskit Optimization
ta_in: Qiskit ஆப்டிமைசேஷனுடன் கிளாசிக்கல் ஆப்டிமைசேஷன் தீர்வுகள் மற்றும் மாடல்களைப் பயன்படுத்துதல்
zh_tw: 以Qiskit Optimization使用古典最佳化解算器和模型

source: We can use classical optimization solvers (CPLEX and Gurobi) with Qiskit Optimization. Docplex and Gurobipy are the Python APIs for CPLEX and Gurobi, respectively. We can load and save an optimization model by Docplex and Gurobipy and can apply CPLEX and Gurobi to ``QuadraticProgram``.
bn_bn: আমরা Qiskit অপ্টিমাইজেশনের সাথে ক্লাসিক্যাল অপটিমাইজেশন সলভার (CPLEX এবং Gurobi) ব্যবহার করতে পারি। ডকপ্লেক্স এবং গুরোবিপি যথাক্রমে সিপিএলইএক্স এবং গুরোবির জন্য পাইথন এপিআই। আমরা ডকপ্লেক্স এবং গুরোবিপি দ্বারা একটি অপটিমাইজেশন মডেল লোড এবং সংরক্ষণ করতে পারি এবং CPLEX এবং Gurobi কে ``QuadraticProgram`` এ প্রয়োগ করতে পারি।
es_un: Podemos utilizar solucionadores de optimización clásicos (CPLEX y Gurobi) con Qiskit Optimization. Docplex y Gurobipy son las API de Python para CPLEX y Gurobi, respectivamente. Podemos cargar y guardar un modelo de optimización de Docplex y Gurobipy y podemos aplicar CPLEX y Gurobi a un ``QuadraticProgram``.
ja: Qiskit Optimization では、古典的な最適化ソルバー (CPLEXとGroubi) を使用できます。Docplexと Groubipy は、それぞれ CPLEX と Gurobi の Python API です。 Docplex と Gurobipy で最適化モデルをロードして保存し、``QuadraticProgram`` に CPLEX と Gurobi を適用することができます。
ko_kr: 우리는 고전 최적화 해석기(CPLEX와 Gurobi) 를 Qiskit 최적화와 함께 사용할 수 있다. Docplex와 Gurobipy는 각각 CPLEX와 Gurobi의 Python API이다. 우리는 Docplex와Gurobipy의 최적화 모델을 로딩하고 저장할 수 있으며 CPLEX와 Gurobi를 ``QuadraticProgram`` 에 적용할 수 있다.
pt_un: Podemos utilizar solucionadores de otimização clássicos (CPLEX e Gurobi) com o Qiskit Optimization. Docplex e Gurobipy são as APIs Python para o CPLEX e Gurobi, respectivamente. Podemos carregar e salvar um modelo de otimização com Docplex e Gurobipy e podemos aplicar CPLEX e Gurobi ao ``QuadraticProgram``.
ta_in: Qiskit ஆப்டிமைசேஷனுடன் கிளாசிக்கல் ஆப்டிமைசேஷன் கரைப்பான்களை (CPLEX மற்றும் குரோபி) நாம் பயன்படுத்தலாம். டாக்பலெக்ஸ் மற்றும் குரோபிபை ஆகியவை முறையே CPLEX மற்றும் குரோபிக்கான பைதான் API கள். டாக்லெக்ஸ் மற்றும் குரோபிபி மூலம் ஒரு தேர்வுமுறை மாதிரியை நாம் ஏற்றலாம் மற்றும் சேமிக்கலாம் மற்றும் CPLEX மற்றும் குரோபி ஆகியவற்றைப் பயன்படுத்தலாம் ``QuadraticProgram``.
zh_tw: 我們可以以Qiskit Optimization使用古典最佳化解算器 (CPLEX and Gurobi) 。 Docplex 和 Gurobipy 分別是 CPLEX 和 Gurobi的 Python API 。 我們可以使用 Docplex 和 Gurobipy 來載入和儲存最佳化模型，並且可以將 CPLEX 和 Gurobi 套用至 ``QuadraticProgram``。

source: If you want to use the CPLEX solver, you need to install ``pip install 'qiskit-optimization[cplex]'``. Docplex is automatically installed, as a dependent, when you install Qiskit Optimization.
bn_bn: যদি আপনি CPLEX solver ব্যবহার করতে চান, তাহলে আপনাকে ``pip install 'qiskit-optimization [cplex]`` ইনস্টল করতে হবে। যখন আপনি Qiskit অপ্টিমাইজেশন ইনস্টল করেন তখন ডকপ্লেক্স স্বয়ংক্রিয়ভাবে একটি নির্ভরশীল হিসাবে ইনস্টল করা হয়।
es_un: Si deseas utilizar el solucionador de CPLEX, debes instalar ``pip install 'qiskit-optimization[cplex]'``. Docplex se instala automáticamente, como dependencia, cuando instalas Qiskit Optimization.
ja: CPLEX ソルバーを使用したい場合は、``pip install 'qiskit-optimization[cplex]'`` でインストールする必要があります。Qiskit Optimization をインストールすると、Docplex は依存関係として自動的にインストールされます。
ko_kr: CPLEX 해석기를 사용하려면 ``pip install 'qiskit-optimization[cplex]'``를 설치해야 한다. Docplex는 Qiskit 최적화를 설치할 때, 종속적으로 자동 설치된다.
pt_un: Se quiser usar o solucionador de CPLEX, você precisa instalar ``pip install 'qiskit-optimization[cplex]'``. O Docplex é automaticamente instalado, como uma dependência, quando você instala o Qiskit Optimization.
ta_in: நீங்கள் CPLEX தீர்வைப் பயன்படுத்த விரும்பினால், நீங்கள் ``pip install 'qiskit-optimization[cplex]'`` நிறுவ வேண்டும். நீங்கள் Qiskit தேர்வுமுறை நிறுவும் போது, ​​டாக்ப்ளெக்ஸ் தானாகவே, ஒரு சார்பாக நிறுவப்படும்.
zh_tw: 如果您要使用 CPLEX 解算器，您需要安裝``pip install 'qiskit-optimization[cplex]'``。當您安裝 Qiskit Optimization時，會自動安裝 Dockplex 作為相依性套件。

source: If you want to use Gurobi and Gurobipy, you need to install ``pip install 'qiskit-optimization[gurobi]'``.
bn_bn: আপনি যদি Gurobi এবং Gurobipy ব্যবহার করতে চান, তাহলে আপনাকে ``pip install 'qiskit-optimization [gurobi]`` ইনস্টল করতে হবে।
es_un: Si deseas utilizar Gurobi y Gurobipy, debes instalar ``pip install 'qiskit-optimization[gurobi]'``.
ja: Gurobi と Gurobipy を使いたい場合は、``pip install 'qiskit-optimization[gurobi]'`` でインストールする必要があります。
ko_kr: Gurobi와 Gurobipy를 이용하려면 ``pip install 'qiskit-optimization[gurobi]'`` 를 설치해야 한다.
pt_un: Se quiser usar o Gurobi e Gurobipy, você precisa instalar ``pip install 'qiskit-optimization[gurobi]'``.
ta_in: நீங்கள் குரோபி மற்றும் குரோபிபையைப் பயன்படுத்த விரும்பினால், நீங்கள் ``pip install 'qiskit-optimization[gurobi]'`` நிறுவ வேண்டும்.
zh_tw: 如果您要使用 Gurobi 和 Gurobipy，您需要安裝 ``pip install 'qiskit-optimization[gurobi]'``。

source: Note that these solvers installed via pip are free versions, which have some limitations such as number of variables. Also note that the latest version 20.1 of CPLEX is available only for Python 3.7 and 3.8 as of July 2021. See the following pages for details.
bn_bn: লক্ষ্য করুন যে pip এর মাধ্যমে ইনস্টল করা এই সমাধানগুলি বিনামূল্যে সংস্করণ, যার কিছু সীমাবদ্ধতা রয়েছে যেমন ভেরিয়েবলের সংখ্যা। এছাড়াও মনে রাখবেন যে CPLEX এর সর্বশেষ সংস্করণ 20.1 জুলাই 2021 অনুযায়ী পাইথন 3.7 এবং 3.8 এর জন্য উপলব্ধ। বিস্তারিত জানার জন্য নিম্নলিখিত পৃষ্ঠাগুলি দেখুন।
es_un: Ten en cuenta que estos solucionadores instalados a través de pip son versiones gratuitas, que tienen algunas limitaciones, como el número de variables. También ten en cuenta que la última versión 20.1 de CPLEX está disponible solo para Python 3.7 y 3.8 a partir de julio de 2021. Consulta las páginas siguientes para obtener más detalles.
ja: Pip でインストールされるこれらのソルバーは、変数の数などいくつかの制限がある無料バージョンです。また 2021年7月現在、最新のバージョン 20.1 の CPLEX は Python 3.7 と 3.8 でのみ利用可能です。詳細は次のページを参照してください。
ko_kr: 참고로 pip를 통해 설치된 이러한 해석기들은 무료 버전이며, 이는 변수의 수와 같이 일부 제한 사항이 있다. 또한 CPLEX의 최신 버전 20.1은 2021년 7월 현재 Python 3.7 및 3.8에만 사용할 수 있다. 자세한 내용은 다음 페이지를 참조.
pt_un: Observe que esses solucionadores instalados via pip são versões gratuitas, que têm algumas limitações, como número de variáveis. Note também que a versão 20.1 mais recente do CPLEX está disponível apenas para Python 3.7 e 3.8 a partir de julho de 2021. Veja as páginas a seguir para obter detalhes.
ta_in: பிப் வழியாக நிறுவப்பட்ட இந்த தீர்வுகள் இலவச பதிப்புகள் என்பதை நினைவில் கொள்க, இது மாறிகளின் எண்ணிக்கை போன்ற சில வரம்புகளைக் கொண்டுள்ளது. CPLEX இன் சமீபத்திய பதிப்பு 20.1 ஜூலை 2021 வரை பைதான் 3.7 மற்றும் 3.8 க்கு மட்டுமே கிடைக்கும் என்பதையும் கவனத்தில் கொள்ளவும். விவரங்களுக்கு பின்வரும் பக்கங்களைப் பார்க்கவும்.
zh_tw: 請注意，這些透過 pip 安裝的求解器是免費的版本，這些版本有一些限制，例如變數的數目。 另請注意， CPLEX 的最新版本 20.1 僅適用於 Python 3.7 和 3.8 ，截至 2021年 7 月。 如需詳細資料，請參閱下列頁面。

source: CplexSolver and GurobiSolver
bn_bn: CplexSolver এবং GurobiSolver
es_un: CplexSolver y GurobiSolver
ja: CplexSolver と GurobiSolver
ko_kr: CplexSolver와 GurobiSolver
pt_un: CplexSolver e GurobiSolver
ta_in: Cplexசால்வர் மற்றும் குரோபிசால்வர்
zh_tw: CplexSolver 與 GurobiSolver

source: Qiskit Optimization supports the classical solvers of CPLEX and Gurobi as ``CplexSolver`` and ``GurobiSolver``, respectively. We can solve ``QuadraticProgram`` with ``CplexSolver`` and ``GurobiSolver`` as follows.
bn_bn: Qiskit অপ্টিমাইজেশান যথাক্রমে ``CplexSolver`` এবং ``GurobiSolver`` হিসাবে CPLEX এবং Gurobi এর ক্লাসিক্যাল সমাধানকারীগুলিকে সমর্থন করে। আমরা নিম্নরূপ ``CplexSolver`` এবং ``GurobiSolver`` দিয়ে ``QuadraticProgram`` সমাধান করতে পারি।
es_un: Qiskit Optimization admite los solucionadores clásicos de CPLEX y Gurobi como ``CplexSolver`` y ``GurobiSolver``, respectivamente. Podemos resolver un ``QuadraticProgram`` con ``CplexSolver`` y ``GurobiSolver`` de la siguiente manera.
ja: Qiskit Optimization は、それぞれ ``CplexSolver`` と ``GurobiSolver`` として CPLEX とGurobi の古典的ソルバーをサポートしています。``CplexSolver`` と ``GurobiSolver`` で ``QuadraticProgram`` を解くことができます。
ko_kr: Qiskit 최적화는 CPLEX와 Gurobi의 고전적인 해석기들을 각각 ``CplexSolver`` 와 ``GurobiSolver`` 로 지원한다. 우리는 다음과 같이 ``CplexSolver`` 와 ``GurobiSolver`` 로 ``QuadraticProgram`` 을 해결할 수 있다.
pt_un: O Qiskit Optimization suporta os solucionadores clássicos de CPLEX e Gurobi como ``CplexSolver`` e ``GurobiSolver``, respectivamente. Podemos resolver o ``QuadraticProgram`` com ``CplexSolver`` e ``GurobiSolver`` da seguinte forma.
ta_in: Qiskit ஆப்டிமைசேஷன் CPLEX மற்றும் குரோபியின் கிளாசிக்கல் சால்வர்களை முறையே ``CplexSolver`` மற்றும் ``GurobiSolver`` என ஆதரிக்கிறது. ``CplexSolver`` மற்றும் ``GurobiSolver`` உடன் ``QuadraticProgram`` ஐ நாம் பின்வருமாறு தீர்க்கலாம்.
zh_tw: Qiskit Optimization 支援 CPLEX 和 Gurobi 的古典解算器，分別為 ``ClexSolver` ` 和 ``GurobiSolver`` 。 我們可以在 " ` CplexSolver` ` 和 ` ` GurobiSolver` ` 中求解 ` `QuadricProgram`` 和 ``，如下所示。

source: We can set the solver parameter of CPLEX as follows. We can display the solver message of CPLEX by setting ``disp=True``. See `Parameters of CPLEX <https://www.ibm.com/docs/en/icos/20.1.0?topic=cplex-parameters>`__ for details of CPLEX parameters.
bn_bn: আমরা নিম্নরূপ CPLEX এর সমাধানকারী প্যারামিটার সেট করতে পারি। আমরা CPLEX এর সমাধানকারী বার্তাটি ``disp = True`` সেট করে প্রদর্শন করতে পারি। CPLEX প্যারামিটারের বিস্তারিত জানার জন্য `Parameters of CPLEX <https://www.ibm.com/docs/en/icos/20.1.0?topic=cplex-parameters>`__ দেখুন।
es_un: Podemos establecer el parámetro de resolución de CPLEX de la siguiente manera. Podemos mostrar el mensaje del solucionador de CPLEX configurando ``disp=True``. Consulta `Parameters of CPLEX <https://www.ibm.com/docs/en/icos/20.1.0?topic=cplex-parameters>`__ para obtener detalles sobre los parámetros de CPLEX.
ja: CPLEX のソルバー・パラメーターは、次のように設定できます。 CPLEX のソルバー・メッセージを表示するには ``disp=True`` を設定します。 CPLEX パラメーターの詳細については、 `Parameters of CPLEX <https://www.ibm.com/docs/en/icos/20.1.0?topic=cplex-parameters>`__ を参照してください。
ko_kr: 우리는 CPLEX 해석기의 매개 변수를 다음과 같이 정할 수 있다. ``disp=True`` 로 정하면 CPLEX 해석기의 메세지를 표시할 수 있다. 참고: `Parameters of CPLEX <https://www.ibm.com/docs/en/icos/20.1.0?topic=cplex-parameters>`__ CPLEX 매개 변수에 관한 자세한 사항.
pt_un: Podemos definir o parâmetro do solucionador de CPLEX do seguinte modo. Podemos exibir a mensagem do solucionador de CPLEX configurando ``disp=True``. Consulte `Parameters of CPLEX <https://www.ibm.com/docs/en/icos/20.1.0?topic=cplex-parameters>`__ para detalhes dos parâmetros do CPLEX.
ta_in: CPLEX இன் கரைப்பான் அளவுருவை நாம் பின்வருமாறு அமைக்கலாம். அமைப்பதன் மூலம் CPLEX இன் தீர்க்கும் செய்தியை நாம் காட்ட முடியும் ``disp=True``.பார்க்கவும் `CPLEX இன் அளவுருக்கள் <https://www.ibm.com/docs/en/icos/20.1.0?topic=cplex-parameters>`__ CPLEX அளவுருக்களின் விவரங்களுக்கு.
zh_tw: 我們可以設定 CPLEX 的解算器參數，如下所示。 我們可以透過設定 ``disp=True``來顯示 CPLEX 的 解算器訊息。如需 CPLEX 參數的詳細資料，請參閱 `Parameters of CPLEX <https://www.ibm.com/docs/en/icos/20.1.0?topic=cplex-parameters>`__ 。

source: We get the same optimal solution by QAOA as follows.
bn_bn: আমরা QAOA দ্বারা একই নিম্নরূপ অনুকূল সমাধান পাই।
es_un: Obtenemos la misma solución óptima con QAOA de la siguiente manera.
ja: QAOA でも同様に最適解を得ることができます。
ko_kr: 다음과 같이 QAOA를 이용하여 동일한 최적의 해결책을 얻는다.
pt_un: Obtemos a mesma solução ótima com QAOA do seguinte modo.
ta_in: QAOA இன் அதே உகந்த தீர்வை நாங்கள் பின்வருமாறு பெறுகிறோம்.
zh_tw: 我們以 QAOA 可以取得相同的最佳解如下。

source: Translators between ``QuadraticProgram`` and Docplex/Gurobipy
bn_bn: ``QuadraticProgram`` এবং Docplex/Gurobipy এর মধ্যে অনুবাদক
es_un: Traductores entre ``QuadraticProgram`` y Docplex/Gurobipy
ja: ``QuadraticProgram`` と Docplex/Gurobipy のトランスレーター
ko_kr: ``QuadraticProgram`` 와 Docplex/Gurobipy 간 번역기
pt_un: Tradutores entre ``QuadraticProgram`` e Docplex/Gurobipy
ta_in: ``QuadraticProgram`` மற்றும் டாக்பலெக்ஸ்/குரோபிபை இடையே மொழிபெயர்ப்பாளர்கள்
zh_tw: ``QuadraticProgram`` 和 Docplex/Gurobipy 之間的轉換

source: Qiskit Optimization can load ``QuadraticProgram`` from a Docplex model and a Gurobipy model.
bn_bn: কিস্কিট অপ্টিমাইজেশন একটি ডকপ্লেক্স মডেল এবং একটি গুরোবিপি মডেল থেকে ``QuadraticProgram`` লোড করতে পারে।
es_un: Qiskit Optimization puede cargar un ``QuadraticProgram`` desde un modelo Docplex y un modelo Gurobipy.
ja: Qiskit Optimization は、Docplex モデルと Gurobipy モデルから ``QuadraticProgram`` をロードできます。
ko_kr: Qiskit 최적화는 Docplex 모델과 Gurobipy 모델을 통해 ``QuadraticProgram`` 을 로드할 수 있다.
pt_un: O Qiskit Optimization pode carregar ``QuadraticProgram`` a partir de um modelo Docplex e de um modelo Gurobipy.
ta_in: Qiskit உகப்பாக்கம் ``QuadraticProgram`` ஒரு டாக்பலெக்ஸ் மாதிரி மற்றும் ஒரு குரோபிபை மாதிரியில் இருந்து ஏற்ற முடியும்.
zh_tw: Qiskit Optimization可以從 Daplex 模型和 Gurobiby 模型載入 ``QuadragicProgram`` 。

source: First, we define an optimization problem by Docplex and Gurobipy.
bn_bn: প্রথমত, আমরা ডকপ্লেক্স এবং গুরোবিপি দ্বারা একটি অপ্টিমাইজেশান সমস্যা সংজ্ঞায়িত করি।
es_un: Primero, definimos un problema de optimización por Docplex y Gurobipy.
ja: まず、Docplex および Gurobipy によって最適化問題を定義します。
ko_kr: 먼저, Docplex 및 Gurobipy에 의한 최적화 문제를 정의한다.
pt_un: Primeiro, definimos um problema de otimização com Docplex e Gurobipy.
ta_in: முதலில், டாக்பலெக்ஸ் மற்றும் குரோபிபை மூலம் ஒரு தேர்வுமுறை சிக்கலை நாங்கள் வரையறுக்கிறோம்.
zh_tw: 首先，我們定義了 Dockplex 和 Gurobipy的最佳化問題。

source: We can generate ``QuadraticProgram`` object from both Docplex and Gurobipy models. We see that the two ``QuadraticProgram`` objects generated from Docplex and Gurobipy are identical.
bn_bn: আমরা ডকপ্লেক্স এবং গুরোবিপি মডেল দুটো থেকে ``QuadraticProgram`` অবজেক্ট তৈরি করতে পারি। আমরা দেখি যে ডকপ্লেক্স এবং গুরোবিপি থেকে উৎপন্ন দুটি ``QuadraticProgram`` বস্তু অভিন্ন।
es_un: Podemos generar un objeto ``QuadraticProgram`` a partir de los modelos Docplex y Gurobipy. Vemos que los dos objetos ``QuadraticProgram`` generados a partir de Docplex y Gurobipy son idénticos.
ja: Docplex と Groubipy の両方のモデルから ``QuadraticProgram`` オブジェクトを生成することができます。Docplex と Gurobipy から生成された2つの ``QuadraticProgram`` オブジェクトが同じであることを見てみましょう。
ko_kr: 우리는 Docplex 및 Gurobipy 모델 모두에서 ``QuadraticProgram`` 객체를 생성할 수 있다. 우리는 Docplex 및 Gurobipy에서 생성된 두 개의 ``QuadraticProgram`` 객체가 동일하다는 것을 알 수 있다.
pt_un: Podemos gerar um objeto ``QuadraticProgram`` a partir de ambos os modelos Docplex e Gurobipy. Vemos que os dois objetos ``QuadraticProgram`` gerados a partir de Docplex e Gurobipy são idênticos.
ta_in: டாக்பலெக்ஸ் மற்றும் குரோபிபை மாதிரிகள் இரண்டிலிருந்தும் நாம் ``QuadraticProgram`` பொருளை உருவாக்கலாம். டாக்பலெக்ஸ் மற்றும் குரோபிபை இலிருந்து உருவாக்கப்பட்ட இரண்டு ``QuadraticProgram`` பொருள்கள் ஒரே மாதிரியாக இருப்பதைக் காண்கிறோம்.
zh_tw: 我們可以從 Docplex 和 Gurobipy 模型產生 ``QuadricProgram`` 物件。 我們可以觀察到從 Dockplex 和 Gurobipy 產生的兩個 ``QuadricProgram`` 物件是相同的。

source: We can generate a Docplex model and a Gurobipy model from ``QuadraticProgram`` too.
bn_bn: আমরা ``QuadraticProgram`` থেকে একটি ডকপ্লেক্স মডেল এবং একটি গুরোবিপি মডেল তৈরি করতে পারি।
es_un: También podemos generar un modelo Docplex y un modelo Gurobipy de un ``QuadraticProgram``.
ja: ``QuadraticProgram`` から Docplex モデルと Gurobipy モデルを生成することもできます。
ko_kr: 우리는 ``QuadraticProgram`` 에서 Docplex 모델과 Gurobipy 모델을 생성할 수 있다.
pt_un: Podemos gerar um modelo Docplex e um modelo Gurobipy a partir de um ``QuadraticProgram`` também.
ta_in: நாம் ஒரு டாக்பலெக்ஸ் மாதிரி மற்றும் ஒரு குரோபிபை மாதிரியை உருவாக்கலாம் ``QuadraticProgram`` too.
zh_tw: 我們可以從 ``QuadraticProgram`` 中產生 Doclex 模型和Gurobiby 模型。

source: Indicator constraints of Docplex
bn_bn: ডকপ্লেক্সের নির্দেশক সীমাবদ্ধতা
es_un: Restricciones de los indicadores de Docplex
ja: Docplex のインディケーター制約
ko_kr: Docplex의 표시기 제한조건
pt_un: Restrições de indicador do Docplex
ta_in: டாக்பலெக்ஸ் இன் காட்டி கட்டுப்பாடுகள்
zh_tw: Docplex 的指示變量約束

source: ``from_docplex_mp`` supports indicator constraints, e.g., ``u = 0 => x + y <= z`` (u: binary variable) when we convert a Docplex model into ``QuadraticProgram``. It converts indicator constraints into linear constraints using the big-M formulation.
bn_bn: ``from_docplex_mp`` সূচক সীমাবদ্ধতাগুলিকে সমর্থন করে, যেমন, ``u = 0 => x + y <= z`` (u: বাইনারি ভেরিয়েবল) যখন আমরা একটি ডকপ্লেক্স মডেলকে ``QuadraticProgram`` এ রূপান্তর করি। এটি বড়-এম সূত্র ব্যবহার করে সূচক সীমাবদ্ধতাগুলিকে রৈখিক সীমাবদ্ধতায় রূপান্তরিত করে।
es_un: ``from_docplex_mp`` admite restricciones de indicador, por ejemplo, ``u = 0 => x + y <= z`` (u: variable binaria) cuando convertimos un modelo Docplex en un ``QuadraticProgram``. Convierte las restricciones de los indicadores en restricciones lineales utilizando la formulación big-M.
ja: ``from_docplex_mp`` は Docplex モデルを ``QuadraticProgram`` に変換する時、インディケーター制約、すなわち ``u = 0 => x + y <= z`` (u: バイナリー変数) をサポートします。それはインディケーター制約を big-M 定式化で線形制約に変換します。
ko_kr: ``from_docplex_mp`` 는 ``u = 0 => x + y <= z`` (u: 바이너리 변수) 와 같은 표시기 제한조건을 지원하는데, 이는 Docplex 모델을 ``QuadraticProgram`` 로 변환할 때이다. 이는 표시기 제한조건을 big-M 공식을 사용하여 선형 제한조건으로 변환한다.
pt_un: ``from_docplex_mp`` suporta restrições de indicador, por exemplo, ``u = 0 => x + y <= z`` (u: variável binária) quando convertemos um modelos Docplex em um ``QuadraticProgram``. Ele converte restrições de indicador em restrições lineares utilizando a formulação big-M.
ta_in: ``from_docplex_mp`` காட்டி கட்டுப்பாடுகளை ஆதரிக்கிறது, e.g., ``u = 0 => x + y <= z`` (u: பைனரி மாறி) நாம் ஒரு டாக்பலெக்ஸ் மாதிரியாக மாற்றும் போது ``QuadraticProgram``.இது big-M சூத்திரத்தைப் பயன்படுத்தி காட்டி தடைகளை நேரியல் தடைகளாக மாற்றுகிறது.
zh_tw: 當我們將 Dockplex 模型轉換為``QuadricProgram`` 時，``from_docplex_mp`` 支援指示變量約束，例如 ``u = 0 => x + y <= z``(u： 二進制的變數)。此會使用大M法將指示變量約束轉換成線性約束。

source: Let’s compare the solutions of the model with an indicator constraint by
bn_bn: আসুন মডেলের সমাধানগুলি একটি সূচক সীমাবদ্ধতার সাথে তুলনা করি
es_un: Comparemos las soluciones del modelo con una restricción de indicador por
ja: インディケーター制約のあるモデルの解を比較してみましょう
ko_kr: 모델의 해결책을 표시기 제한조건과 비교해보자.
pt_un: Vamos comparar as soluções do modelos com uma restrição de indicador ao
ta_in: ஒரு காட்டி கட்டுப்பாட்டுடன் மாதிரியின் தீர்வுகளை ஒப்பிடுவோம்
zh_tw: 讓我們以下列方式，比較有指示變量約束的模型的解

source: applying CPLEX directly to the Docplex model (without translating it to ``QuadraticProgram``. CPLEX solver natively supports the indicator constraints),
bn_bn: CPLEX সরাসরি ডকপ্লেক্স মডেলে প্রয়োগ করা (এটি ``QuadraticProgram`` এ অনুবাদ না করে। CPLEX solver স্থানীয়ভাবে নির্দেশক সীমাবদ্ধতা সমর্থন করে),
es_un: aplicando CPLEX directamente al modelo Docplex (sin traducirlo a un ``QuadraticProgram``. El solucionador CPLEX admite de forma nativa las restricciones del indicador),
ja: CPLEX を直接 Docplex モデルに適用する ( ``QuadraticProgram`` に変換せずに。CPLEX ソルバーはインディケーター制約をネイティブにサポートします)
ko_kr: CPLEX를 Docplex 모델 ( ``QuadraticProgram`` 로 번역하지 않음. CPLEX 해석기는 기본적으로 표시기 제한조건을 지원함) 에 직접 적용,
pt_un: aplicar o CPLEX diretamente ao modelo Docplex (sem traduzi-lo para ``QuadraticProgram``. O solucionador CPLEX suporta nativamente as restrições de indicador),
ta_in: cPLEX ஐ நேரடியாக Docplex மாடலுக்குப் பயன்படுத்துதல் (இதை மொழிபெயர்க்காமல் ``QuadraticProgram``. CPLEX கரைப்பான் சொந்தமாக காட்டி கட்டுப்பாடுகளை ஆதரிக்கிறது),
zh_tw: 將 CPLEX 直接套用至Docplex模型 (不將它轉換為 ``QuadraticProgram``。 CPLEX 解算器自然地支援指示變量約束)，

source: applying QAOA to ``QuadraticProgram`` obtained by ``from_docplex_mp``.
bn_bn: ``from_docplex_mp`` দ্বারা প্রাপ্ত ``QuadraticProgram`` এ QAOA প্রয়োগ করা।
es_un: aplicando QAOA a un ``QuadraticProgram`` obtenido por ``from_docplex_mp``.
ja: QAOA を ``from_docplex_mp`` から得た ``QuadraticProgram`` に適用する
ko_kr: QAOA를 ``from_docplex_mp`` 로 얻은 ``QuadraticProgram`` 에 적용하는 것.
pt_un: aplicar QAOA ao ``QuadraticProgram`` obtido por ``from_docplex_mp``.
ta_in: qAOA ஐப் பயன்படுத்துதல் ``QuadraticProgram`` மூலம் பெறப்பட்டது ``from_docplex_mp``.
zh_tw: 將 QAOA 套用至 ``from_docplex_mp`` 所取得的 ` ` QuadraticProgram`` 。

source: We see the solutions are same.
bn_bn: আমরা দেখি সমাধান একই।
es_un: Vemos que las soluciones son las mismas.
ja: 解は同じになります。
ko_kr: 해결책이 같다는 것을 알 수 있다.
pt_un: Vemos que as soluções são as mesmas.
ta_in: நாங்கள் தீர்வுகள் ஒரே மாதிரியாக இருப்பதை காண்கிறோம்.
zh_tw: 我們可以觀察到的解都是一樣的。
