Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/12_quantum_random_access_optimizer.po
Languages: es_un

source: This page was generated from `docs/tutorials/12_quantum_random_access_optimizer.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/12_quantum_random_access_optimizer.ipynb`__.

source: Quantum Random Access Optimization
es_un: Optimización Cuántica de Acceso Aleatorio

source: The Quantum Random Access Optimization (QRAO) module is designed to enable users to leverage a new quantum method for combinatorial optimization problems [1]. This approach incorporates Quantum Random Access Codes (QRACs) as a tool to encode multiple classical binary variables into a single qubit, thereby saving quantum resources and enabling exploration of larger problem instances on a quantum computer. The encodings produce a local quantum Hamiltonian whose ground state can be approximated with standard algorithms such as VQE, and then rounded to yield approximation solutions of the original problem.
es_un: El módulo Quantum Random Access Optimization (QRAO) está diseñado para permitir a los usuarios aprovechar un nuevo método cuántico para problemas de optimización combinatoria [1]. Este enfoque incorpora Códigos Cuánticos de Acceso Aleatorio (Quantum Random Access Codes, QRAC) como herramienta para codificar múltiples variables binarias clásicas en un solo qubit, ahorrando así recursos cuánticos y permitiendo la exploración de instancias de problemas más grandes en una computadora cuántica. Las codificaciones producen un Hamiltoniano cuántico local cuyo estado fundamental puede aproximarse con algoritmos estándar como VQE y luego redondearse para producir soluciones aproximadas del problema original.

source: QRAO through a series of 3 classes: 1. The encoding class (``QuantumRandomAccessEncoding``): This class encodes the original problem into a relaxed problem that requires fewer resources to solve. 2. The rounding schemes (``SemideterministicRounding`` and ``MagicRounding``): This scheme is used to round the solution obtained from the relaxed problem back to a solution of the original problem. 3. The optimizer class (``QuantumRandomAccessOptimizer``): This class performs the high-level optimization algorithm, utilizing the capabilities of the encoding class and the rounding scheme.
es_un: QRAO a través de una serie de 3 clases: 1. La clase de codificación (``QuantumRandomAccessEncoding``): esta clase codifica el problema original en un problema relajado que requiere menos recursos para resolver. 2. Los esquemas de redondeo (``SemidterministicRounding`` y ``MagicRounding``): Este esquema se utiliza para redondear la solución obtenida del problema relajado a una solución del problema original. 3. La clase optimizadora (``QuantumRandomAccessOptimizer``): esta clase realiza el algoritmo de optimización de alto nivel, utilizando las capacidades de la clase de codificación y el esquema de redondeo.

source: *References*
es_un: *Referencias*

source: Set up a combinatorial optimization problem
es_un: Configurar un problema de optimización combinatoria

source: In this tutorial, we will consider a random max-cut problem instance and use QRAO to try to find a maximum cut; in other words, a partition of the graph's vertices (nodes) into two sets that maximizes the number of edges between the sets.
es_un: En este tutorial, consideraremos una instancia de problema max-cut aleatorio y usaremos QRAO para intentar encontrar un corte máximo; en otras palabras, una partición de los vértices (nodos) del grafo en dos conjuntos que maximiza el número de aristas entre los conjuntos.

source: To begin, we utilize the ``Maxcut`` class from Qiskit Optimization's application module. It allows us to generate a ``QuadraticProgram`` representation of the given graph.
es_un: Para comenzar, utilizamos la clase ``Maxcut`` del módulo de aplicación de Qiskit Optimization. Nos permite generar una representación ``QuadraticProgram`` del grafo dado.

source: Note that once our problem has been represented as a ``QuadraticProgram``, it will need to be converted to the correct type, a `quadratic unconstrained binary optimization (QUBO) <https://en.wikipedia.org/wiki/Quadratic_unconstrained_binary_optimization>`__ problem, so that it is compatible with QRAO. A ``QuadraticProgram`` generated by ``Maxcut`` is already a QUBO, but if you define your own problem be sure you convert it to a QUBO before proceeding. Here is `a tutorial <https://qiskit.org/documentation/optimization/tutorials/02_converters_for_quadratic_programs.html>`__ on converting ``QuadraticPrograms``.
es_un: Ten en cuenta que una vez que nuestro problema se haya representado como un ``QuadraticProgram``, será necesario convertirlo al tipo correcto, un problema de `optimización binaria cuadrática sin restricciones (QUBO) <https://en.wikipedia.org/wiki/Quadratic_unconstrained_binary_optimization>`__, para que sea compatible con QRAO. Un ``QuadraticProgram`` generado por ``Maxcut`` ya es un QUBO, pero si defines tu propio problema, asegúrate de convertirlo en un QUBO antes de continuar. Aquí hay `un tutorial <https://qiskit.org/documentation/optimization/tutorials/02_converters_for_quadratic_programs.html>`__ sobre la conversión de ``QuadraticPrograms``.

source: Encode the problem into a quantum Hamiltonian
es_un: Codificar el problema en un Hamiltoniano cuántico

source: Once we have appropriately configured our problem, we proceed to encode it using the ``QuantumRandomAccessEncoding`` class from the ``qrao`` module. This encoding step allows us to generate a quantum Hamiltonian operator that represents our problem. In particular, we employ a Quantum Random Access Code (QRAC) to encode multiple classical binary variables (corresponding to the nodes of our max-cut graph) into each qubit.
es_un: Una vez que hemos configurado adecuadamente nuestro problema, procedemos a codificarlo usando la clase ``QuantumRandomAccessEncoding`` del módulo ``qrao``. Este paso de codificación nos permite generar un operador Hamiltoniano cuántico que representa nuestro problema. En particular, empleamos un código cuántico de acceso aleatorio (QRAC) para codificar múltiples variables binarias clásicas (correspondientes a los nodos de nuestro grafo max-cut) en cada qubit.

source: It's important to note that the resulting "relaxed" Hamiltonian, produced by this encoding, will not be diagonal. This differs from the standard workflow in ``qiskit-optimization``, which typically generates a diagonal (Ising) Hamiltonian suitable for optimization using a ``MinimumEigenOptimizer``. You can find a tutorial on the ``MinimumEigenOptimizer`` `here <https://qiskit.org/documentation/optimization/tutorials/03_minimum_eigen_optimizer.html>`__.
es_un: Es importante señalar que el Hamiltoniano "relajado" resultante, producido por esta codificación, no será diagonal. Esto difiere del flujo de trabajo estándar en ``qiskit-optimization``, que normalmente genera un Hamiltoniano diagonal (Ising) adecuado para la optimización utilizando un ``MinimumEigenOptimizer``. Puedes encontrar un tutorial sobre ``MinimumEigenOptimizer`` `aquí <https://qiskit.org/documentation/optimization/tutorials/03_minimum_eigen_optimizer.html>`__.

source: In our encoding process, we employ a :math:`(3,1,p)-`\ QRAC, where each qubit can accommodate a maximum of 3 classical binary variables. The parameter :math:`p` represents the bit recovery probability achieved through measurement. Depending on the nature of the problem, some qubits may have fewer than 3 classical variables assigned to them. To evaluate the compression achieved, we can examine the ``compression_ratio`` attribute of the encoding, which provides the ratio between the number of original binary variables and the number of qubits used (at best, a factor of 3).
es_un: En nuestro proceso de codificación, empleamos un :math:`(3,1,p)-`\ QRAC, donde cada qubit puede acomodar un máximo de 3 variables binarias clásicas. El parámetro :math:`p` representa la probabilidad de recuperación de bits lograda mediante la medición. Dependiendo de la naturaleza del problema, algunos qubits pueden tener asignadas menos de 3 variables clásicas. Para evaluar la compresión lograda, podemos examinar el atributo ``compression_ratio`` de la codificación, que proporciona la relación entre el número de variables binarias originales y el número de qubits utilizados (en el mejor de los casos, un factor de 3).

source: Solve the problem using the ``QuantumRandomAccessOptimizer``
es_un: Resolver el problema usando el ``QuantumRandomAccessOptimizer``

source: Having successfully encoded our input problem as a relaxed Hamiltonian, we proceed to solve it using the ``QuantumRandomAccessOptimizer``. This optimizer allows us to find an approximate solution to the relaxed problem by leveraging quantum computing techniques.
es_un: Habiendo codificado con éxito nuestro problema de entrada como un Hamiltoniano relajado, procedemos a resolverlo usando el ``QuantumRandomAccessOptimizer``. Este optimizador nos permite encontrar una solución aproximada al problema relajado aprovechando técnicas de computación cuántica.

source: To set up the optimizer, we need to specify two crucial components:
es_un: Para configurar el optimizador, necesitamos especificar dos componentes cruciales:

source: **Minimum Eigensolver**: We specify a minimum eigensolver to heuristically search for the ground state of the relaxed problem Hamiltonian. As an example, we can use the Variational Quantum Eigensolver (VQE). For simulation purposes, we'll employ an simulator, but you can choose a quantum device as the backend if desired.
es_un: **Solucionador Propio Mínimo**: Especificamos un solucionador propio mínimo para buscar heurísticamente el estado fundamental del problema de Hamiltoniano relajado. Como ejemplo, podemos utilizar el Solucionador Propio Variacional Cuántico (Variational Quantum Eigensolver, VQE). Para fines de simulación, emplearemos un simulador, pero puedes elegir un dispositivo cuántico como backend si lo deseas.

source: **Rounding Scheme**: To map the ground state results back to a solution for the original problem, we specify a rounding scheme. By default, the ``SemideterministicRounding`` is used, but alternative scheme, ``MagicRounding``, is also available.
es_un: **Esquema de Redondeo**: Para asignar los resultados del estado fundamental a una solución para el problema original, especificamos un esquema de redondeo. De forma predeterminada, se utiliza el ``SemideterministicRounding``, pero también está disponible el esquema alternativo, ``MagicRounding``.

source: Finally, we move forward with solving the problem by invoking the ``solve()`` method. It's important to note that when calling ``solve()``, we pass the ``problem`` itself as an argument. Although we previously used ``encode()`` in ``QuantumRandomAccessEncoding`` to provide a clear understanding of the flow, ``solve(problem)`` automatically encodes the problem internally using ``QuantumRandomAccessEncoding``. This provides a streamlined and simplified workflow that eliminates the need for explicit encoding steps.
es_un: Finalmente, avanzamos en la resolución del problema invocando el método ``solve()``. Es importante tener en cuenta que cuando llamamos a ``solve()``, pasamos el ``problem`` mismo como argumento. Aunque anteriormente usamos ``encode()`` en ``QuantumRandomAccessEncoding`` para proporcionar una comprensión clara del flujo, ``solve(problem)`` codifica automáticamente el problema internamente usando ``QuantumRandomAccessEncoding``. Esto proporciona un flujo de trabajo optimizado y simplificado que elimina la necesidad de pasos de codificación explícitos.

source: The result is provides us as a ``QuantumRandomAccessOptimizationResult``. The ``x`` contains the binary values representing the best solution found, while the ``fval`` contains the corresponding objective value.
es_un: El resultado se nos proporciona como ``QuantumRandomAccessOptimizationResult``. La ``x`` contiene los valores binarios que representan la mejor solución encontrada, mientras que el ``fval`` contiene el valor objetivo correspondiente.

source: The ``relaxed_fval`` provides the expectation value of the relaxed Hamiltonian, adjusted to be in the units of the original optimization problem. For maximization problems, the best possible relaxed function value will always be greater than or equal to the best possible objective function value of the original problem. In practice, this often holds true for the best found value and best found objective function value as well.
es_un: El ``relaxed_fval`` proporciona el valor esperado del Hamiltoniano relajado, ajustado para estar en las unidades del problema de optimización original. Para problemas de maximización, el mejor valor posible de la función relajada siempre será mayor o igual al mejor valor posible de la función objetivo del problema original. En la práctica, esto suele ser válido también para el mejor valor encontrado y el mejor valor de la función objetivo encontrado.

source: Interpret the solution
es_un: Interpretar la solución

source: In the context of `max-cut <https://en.wikipedia.org/wiki/Maximum_cut>`__, the result's "optimal value" tells us which subset each node belongs to given the partition found by the optimizer.
es_un: En el contexto de `max-cut <https://en.wikipedia.org/wiki/Maximum_cut>`__, el "valor óptimo" del resultado nos dice a qué subconjunto pertenece cada nodo dada la partición encontrada por el optimizador.

source: Inspect the results of subroutines
es_un: Inspeccionar los resultados de las subrutinas

source: The `MinimumEigensolverResult <https://qiskit.org/ecosystem/algorithms/stubs/qiskit_algorithms.MinimumEigensolverResult.html>`__ that results from performing VQE on the relaxed Hamiltonian is available:
es_un: El `MinimumEigensolverResult <https://qiskit.org/ecosystem/algorithms/stubs/qiskit_algorithms.MinimumEigensolverResult.html>`__ que resulta de aplicar VQE en el Hamiltoniano relajado está disponible:

source: The result of the rounding scheme is also worth considering. In this example, we used the ``SemideterministricRounding``. It's important to note that with semi-deterministic rounding, a single sample is generated as the result, making it the optimal solution candidate.
es_un: También vale la pena considerar el resultado del esquema de redondeo. En este ejemplo, utilizamos el ``SemideterministricRounding``. Es importante tener en cuenta que con el redondeo semideterminista, se genera una única muestra como resultado, lo que la convierte en la solución candidata óptima.

source: However, if we use the ``MagicRounding`` instead, multiple samples would be generated, each with a probability associated with it. These probabilities sum up to one, providing a distribution of potential optimal solutions.
es_un: Sin embargo, si utilizamos ``MagicRounding`` en su lugar, se generarían múltiples muestras, cada una con una probabilidad asociada. Estas probabilidades suman uno, lo que proporciona una distribución de posibles soluciones óptimas.

source: Exact Problem Solution with the ``NumpyMinimumEigensolver``
es_un: Solución Exacta del Problema con ``NumpyMinimumEigensolver``

source: To assess the performance of QRAO in approximating the optimal solution, we can utilize the ``NumpyMinimumEigensolver``, an exact classical optimizer. We can obtain the exact optimal solution to the problem as follows:
es_un: Para evaluar el rendimiento de QRAO en la aproximación de la solución óptima, podemos utilizar ``NumpyMinimumEigensolver``, un optimizador clásico exacto. Podemos obtener la solución óptima exacta del problema de la siguiente manera:

source: The approximation ratio (QRAO's objective function value divided by the optimal objective function value) tells us how closely QRAO approximated the optimal solution to the problem.
es_un: La relación de aproximación (el valor de la función objetivo de QRAO dividido por el valor de la función objetivo óptima) nos dice qué tan cerca se aproximó QRAO a la solución óptima del problema.

source: Solve the problem using the ``QuantumRandomAccessOptimizer`` with ``MagicRounding``
es_un: Resolver el problema usando el ``QuantumRandomAccessOptimizer`` con ``MagicRounding``

source: Magic rounding is a quantum technique employed to map the ground state results of our encoded Hamiltonian back to a solution of the original problem. Unlike semi-deterministic rounding, magic rounding requires a quantum backend, which can be either hardware or a simulator. The backend is passed to the ``MagicRounding`` class through a ``Sampler``, which also determines the total number of shots (samples) that magic rounding will utilize. Note that to specify the backend, you need to choose a ``Sampler`` from providers such as Aer or IBM Runtime. Consequently, we need to specify ``Estimator`` and ``Sampler`` for the optimizer and the rounding scheme, respectively.
es_un: El redondeo mágico es una técnica cuántica empleada para mapear los resultados del estado fundamental de nuestro Hamiltoniano codificado hasta una solución del problema original. A diferencia del redondeo semideterminista, el redondeo mágico requiere un backend cuántico, que puede ser hardware o un simulador. El backend se pasa a la clase ``MagicRounding`` a través de un ``Sampler``, que también determina el número total de iteraciones (muestras) que utilizará el redondeo mágico. Ten en cuenta que para especificar el backend, debes elegir un ``Sampler`` de proveedores como Aer o IBM Runtime. En consecuencia, necesitamos especificar ``Estimador`` y ``Sampler`` para el optimizador y el esquema de redondeo, respectivamente.

source: In practice, users may choose to set a significantly higher number of magic rounding shots compared to the shots used by the minimum eigensolver for the relaxed problem. This difference arises because the minimum eigensolver estimates expectation values, while the magic rounding scheme returns the sample corresponding to the maximum function value found. The number of magic rounding shots directly impacts the diversity of the computational basis we can generate. When estimating an expectation value, increasing the number of shots enhances the convergence to the true value. However, when aiming to identify the largest possible function value, we often sample from the tail of a distribution of outcomes. As a result, until we observe the highest value outcome in our distribution, each additional shot increases the expected return value.
es_un: En la práctica, los usuarios pueden optar por establecer un número significativamente mayor de iteraciones de redondeo mágico en comparación con los disparos utilizados por el solucionador propio mínimo para el problema relajado. Esta diferencia surge porque el solucionador propio mínimo estima los valores esperados, mientras que el esquema de redondeo mágico devuelve la muestra correspondiente al valor máximo de función encontrado. La cantidad de iteraciones de redondeo mágico impacta directamente en la diversidad de la base computacional que podemos generar. Al estimar un valor esperado, aumentar el número de iteraciones mejora la convergencia al valor real. Sin embargo, cuando pretendemos identificar el valor de función más grande posible, a menudo tomamos muestras de la cola de una distribución de resultados. Como resultado, hasta que observemos la salida de mayor valor en nuestra distribución, cada iteración adicional aumenta el valor de retorno esperado.

source: In this tutorial, we use the ``Estimator`` for solving the relaxed Hamiltonian and the ``Sampler`` for performing magic rounding. Here, 10 times as many shots are used in the ``Sampler``. As the number of qubits increases, you may need more shots or ``weighted`` basis sampling, as explained above."
es_un: En este tutorial, utilizamos el ``Estimator`` para resolver el Hamiltoniano relajado y el ``Sampler`` para realizar el redondeo mágico. Aquí se utilizan 10 veces más iteraciones en el ``Sampler``. A medida que aumenta el número de qubits, es posible que necesites más iteraciones o muestreos de base``weighted``, como se explicó anteriormente.

source: Since magic rounding relies on nondeterministic measurements, the method collects a number of samples based on the shots count provided to the ``Sampler`` mentioned earlier. These samples are then consolidated, taking into account duplicates and calculating the empirical probability for each ``SolutionSample``. Each sample in the consolidation process includes a corresponding function value (``fval``).
es_un: Dado que el redondeo mágico se basa en mediciones no deterministas, el método recopila una cantidad de muestras en función del recuento de iteraciones proporcionado al ``Sampler`` mencionado anteriormente. Luego, estas muestras se consolidan, teniendo en cuenta los duplicados y calculando la probabilidad empírica para cada ``SolutionSample``. Cada muestra en el proceso de consolidación incluye un valor de función correspondiente (``fval``).

source: From the consolidated samples, we select the sample with the "optimal" function value. In the case of a max-cut problem, this means choosing the sample with the largest function value as our solution.
es_un: De las muestras consolidadas, seleccionamos la muestra con el valor de función "óptimo". En el caso de un problema de máximo corte, esto significa elegir la muestra con el valor de función más grande como nuestra solución.

source: Alternative: Solve the Problem in Two Explicit Steps
es_un: Alternativa: Resolver el Problema en dos Pasos Explícitos

source: In the previous part of this tutorial, we utilized the ``qrao.solve()`` method, which solved the encoded problem (the ground state of the relaxed Hamiltonian) and performed rounding to map the ground state results back to a solution of the original problem. However, it is also possible to explicitly break down the calculation into these two distinct steps. This can be beneficial, especially when comparing solutions obtained across multiple rounding schemes applied to a candidate ground state.
es_un: En la parte anterior de este tutorial, utilizamos el método ``qrao.solve()``, que resolvió el problema codificado (el estado fundamental del Hamiltoniano relajado) y realizamos un redondeo para mapear los resultados del estado fundamental a una solución del problema original. Sin embargo, también es posible dividir explícitamente el cálculo en estos dos pasos distintos. Esto puede resultar beneficioso, especialmente al comparar soluciones obtenidas a través de múltiples esquemas de redondeo aplicados a un estado fundamental candidato.

source: In this section, we will explore how to perform each of these steps explicitly.
es_un: En esta sección, exploraremos cómo realizar cada uno de estos pasos de forma explícita.

source: Manually solve the relaxed problem.
es_un: Resuelve manualmente el problema relajado.

source: Let's start by invoking the ``qrao.solve_relaxed()`` method to directly solve the relaxed problem encoded by ``QuantumRandomAccessEncoding``. This method allows us to focus solely on solving the relaxed problem without performing rounding.
es_un: Comencemos invocando al método ``qrao.solve_relaxed()`` para resolver directamente el problema relajado codificado por ``QuantumRandomAccessEncoding``. Este método nos permite centrarnos únicamente en resolver el problema relajado sin realizar redondeo.

source: By invoking ``qrao.solve_relaxed()``, we obtain two essential outputs:
es_un: Al invocar ``qrao.solve_relaxed()``, obtenemos dos salidas esenciales:
