Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/12_qaoa_runtime.po
Languages: es_un, ja_jp, ko_kr, pt_un, ta_in

source: Once the job has successfully executed we can retrieve the result from the job. The result object contains information on the optimization. For self consistency it also contains the inputs to the QAOA program that are accessible through ``result["inputs"]``. The value under ``"inputs"`` is a dictionary with the keys described above.
es_un: Una vez que el trabajo (job) se ha ejecutado con éxito, podemos recuperar el resultado del trabajo. El objeto de resultado contiene información sobre la optimización. Para mantener la coherencia, también contiene las entradas al programa QAOA a las que se puede acceder a través de ``result["inputs"]``. El valor debajo de ``"inputs"`` es un diccionario con las claves descritas anteriormente.
ja_jp: ジョブが正常に実行されると、ジョブから結果を取得できます。結果オブジェクトには、最適化に関する情報が含まれています。自己整合性のために、 ``result["inputs"]`` からアクセスできるQAOAプログラムへの入力も含まれています。 ``"inputs"`` の下の値は、上記のキーを持つ辞書です。
ko_kr: 작업이 성공적으로 실행되면 결과를 얻을 수 있다. 결과에는 최적화에 대한 정보가 포함되어 있다. 또한 자체 일관성을 위해 ``result["inputs"]`` 를 통해 접근할 수 있는 QAOA 프로그램에 대한 입력값도 포함하고 있다. ``"inputs"`` 아래의 값은 위에서 설명한 키가 있는 사전이다.
pt_un: Uma vez que o trabalho tenha sido executado com sucesso, podemos recuperar o resultado do trabalho. O objeto de resultado contém informações sobre a otimização. Para auto consistência, ele também contém as entradas para o programa QAOA que são acessíveis através de ``result["inputs"]``. O valor em ``"inputs"`` é um dicionário com as chaves descritas acima.
ta_in: வேலை, வெற்றிகரமாகச் செயல்படுத்தப்பட்டவுடன், வேலையின் முடிவைப் பெறலாம். ஆப்டிமைசேஷன் பற்றிய தகவல்கள் ரிசல்ட் ஆப்ஜெக்டில் உள்ளன. சுய நிலைத்தன்மைக்காக, இது QAOA நிரலுக்கான உள்ளீடுகளைக் கொண்டுள்ளது, அவை ``result["inputs"]`` மூலம் அணுகலாம். ``"inputs"`` என்பதன் கீழ் உள்ள மதிப்பு மேலே விவரிக்கப்பட்ட விசைகளைக் கொண்ட அகராதியாகும்.

source: Of particular interest is the energy that was measured on the hardware at each iteration as well as the returned eigenstate. For this example we assume that the energy of the cost operator that we minimized corresponds to an instance of a MaxCut problem.
es_un: De particular interés es la energía que se midió en el hardware en cada iteración, así como el estado propio devuelto. Para este ejemplo, asumimos que la energía del operador de costo que minimizamos corresponde a una instancia de un problema de MaxCut.
ja_jp: 特に興味深いのは、各反復でハードウェアで測定されたエネルギーと、返された固有状態です。この例では、最小化したコスト演算子のエネルギーが最大カット問題のインスタンスに対応すると想定しています。
ko_kr: 특히 각 반복에서의 하드웨어 상에서 측정된 에너지와 반환된 고유상태가 중요하다. 이 예제에서 최소화환 비용 연산자의 에너지가 MaxCut 문제의 인스턴스에 해당한다고 가정한다.
pt_un: De particular interesse é a energia que foi medida no hardware em cada iteração, bem como o autoestado retornado. Para este exemplo, assumimos que a energia do operador de custo que minimizamos corresponde a uma instância de um problema MaxCut.
ta_in: ஒவ்வொரு மறு செய்கையிலும் வன்பொருளில் அளவிடப்பட்ட ஆற்றல் மற்றும் திரும்பிய ஐகென்ஸ்டேட் ஆகியவை குறிப்பான ஆர்வமாக உள்ளன. இந்த எடுத்துக்காட்டில், நாங்கள் குறைத்த காஸ்ட் ஆபரேட்டரின் ஆற்றல், MaxCut சிக்கலின் நிகழ்வுக்கு ஒத்திருக்கிறது என்று கருதுகிறோம்.

source: Qiskit optimization
es_un: Optimización de Qiskit
ko_kr: Qiskit 최적화
pt_un: Otimização Qiskit
ta_in: Qiskit ஆப்டிமைசேஷன்

source: The functionality discussed above is implemented in Qiskit-optimization where the QAOA-runtime is accessible through the ``runtime`` module. We now show how to use this module with the ``QAOAClient``.
es_un: La funcionalidad discutida anteriormente se implementa en Qiskit-optimization donde se puede acceder al QAOA-runtime a través del módulo ``runtime``. Ahora mostramos cómo usar este módulo con el ``QAOAClient``.
ja_jp: 上記の機能は Qiskit-optimization に実装されており、 ``runtime`` モジュールを介してQAOAランタイムにアクセスできます。ここで、このモジュールを ``QAOAClient`` で使用する方法を示します。
ko_kr: 위에서 설명한 기능은 QAOA 런타임이 ``runtime`` 모듈을 통해 접근할 수 있는 Qiskit 최적화에서 구현된다. 이제 이 모듈을 ``QAOAClient`` 와 함께 사용하는 방법을 보여준다.
pt_un: A funcionalidade discutida acima é implementada na otimização Qiskit onde o QAOA-runtime é acessível através do módulo ``runtime``. Agora mostramos como usar este módulo com o ``QAOAClient``.
ta_in: QAOA-இயக்க நேரத்தை ``runtime`` தொகுதி மூலம் அணுகக்கூடிய Qiskit-optimization இல் மேலே விவாதிக்கப்பட்ட செயல்பாடு செயல்படுத்தப்படுகிறது. ``QAOAClient`` உடன் இந்தத் தொகுதியை எவ்வாறு பயன்படுத்துவது என்பதை இப்போது காட்டுகிறோம்.

source: Appendix A: Pulse-efficient transpilation
es_un: Apéndice A: Transpilación con pulso eficiente
ja_jp: 付録A：パルス効率の高いトランスパイル
ko_kr: 부록 A: 펄스에 효율적인(pulse-effective) 트랜스파일
pt_un: Apêndice A: Transpilação com eficiência de pulso
ta_in: பின்னிணைப்பு A: பல்ஸ்-எஃபிஷியன்ட் இடமாற்றம்

source: The QAOA runtime program can leverage a pulse-efficient transpilation which minimizes the number of single-qubit pulses and makes use of the cross-resonance scaling methodology applicable to the echoed-cross-resonance gates of IBM Quantum Systems. For completeness we here show the pass manager that is implemented.
es_un: El programa de QAOA runtime puede aprovechar una transpilación con pulso eficiente la cual minimiza el número de pulsos de un solo qubit y hace uso de la metodología de escalado de resonancia cruzada aplicable a las compuertas de resonancia cruzada con eco de IBM Quantum Systems. Para completar, aquí mostramos el administrador de pases que está implementado.
ja_jp: QAOAランタイム・プログラムは、単一量子ビット・パルスの数を最小限に抑え、IBM Quantum Systemsのエコー・クロス・レゾナンス・ゲートに適用可能なクロス・レゾナンス・スケーリング手法を利用する、パルス効率の高いトランスパイルを活用できます。完全を期すために、ここでは実装されているパスマネージャーを示します。
ko_kr: QAOA 런타임 프로그램은 단일 큐비트 펄스 수를 최소화하고 IBM Quantum Systems의 에코-교차-공진 게이트에 적용 가능한 교차-공진 스케일링 방법론을 사용하는 펄스 효율적인 트랜스파일 기능을 활용할 수 있다. 완성도를 위해 구현된 패스 관리자를 보여준다.
pt_un: O programa QAOA runtime pode alavancar uma transpilação com eficiência de pulso que minimiza o número de pulsos de qubit único e faz uso da metodologia de escala de ressonância cruzada aplicável às portas de ressonância cruzada ecoada do IBM Quantum Systems. Para completar, mostramos aqui o gerenciador de passes implementado.
ta_in: QAOA இயக்க நேர நிரல் ஒரு பல்ஸ்-எஃபிஷியன்ட் டிரான்ஸ்பிலேஷனைப் பயன்படுத்துகிறது, இது ஒற்றை-கியூபிட் பல்ஸ்களின் எண்ணிக்கையைக் குறைக்கிறது மற்றும் IBM Quantum Systems -ன் எதிரொலி-குறுக்கு-அதிர்வு கேட்களுக்குப் பொருந்தக்கூடிய குறுக்கு-அதிர்வு அளவிடுதல் முறையைப் பயன்படுத்துகிறது. முழுமைக்காக, செயல்படுத்தப்பட்ட பாஸ் மேனேஜரைக் காட்டுகிறோம்.

source: The pulse efficient pass is implemented using transpiler passes from qiskit. It requires knowledge of the pulse-enabled backend to attached scaled cross-resonance gates to the ``RZXGate``\ s obtained from the KAK decomposition. These scaled gates are based on the schedules of the calibrated CNOT gates.
es_un: El pase de pulso eficiente se implementa utilizando pases de transpilador de Qiskit. Requiere conocimiento del backend habilitado por pulsos para las compuertas de resonancia cruzada escaladas adjuntas a las ``RZXGate``\ s obtenidas de la descomposición KAK. Estas compuertas escaladas se basan en las planeaciones (schedules) de las compuertas CNOT calibradas.
ja_jp: パルス効率の高いパスは、qiskitのトランスパイラーパスを使用して実装されます。これには、KAK分解から取得した ``RZXGate`` に接続されたスケーリングされた相互共鳴ゲートへのパルス対応バックエンドの知識が必要です。 これらのスケーリングされたゲートは、キャリブレーションされたCNOTゲートのスケジュールに基づいています。
ko_kr: 펄스 효율 패스는 qiskit의 트랜스파일러 패스를 사용하여 구현된다. 이는 KAK 분해에서 얻은 ``RZXGate`` 에 스케일링된 교차-공진 게이트를 부착하는 펄스 가능 백엔드에 대한 지식을 필요로 한다. 이러한 스케일된 게이트들은 교정된 CNOT 게이트들의 스케줄에 기초한다.
pt_un: O passe eficiente de pulso é implementado usando passos transpiladores do qiskit. Requer conhecimento do backend ativado por pulso para portas de ressonância cruzada escaladas anexadas aos ``RZXGate``\ s obtidos da decomposição KAK. Essas portas escalonadas são baseadas nos cronogramas das portas CNOT calibradas.
ta_in: Qiskit -ல் இருந்து டிரான்ஸ்பைலர் பாஸ்களைப் பயன்படுத்தி பல்ஸ் எஃபிஷியன்ட் கொண்ட பாஸ் செயல்படுத்தப்படுகிறது. KAK சிதைவிலிருந்து பெறப்பட்ட ``RZXGate``\ s -க்கு இணைக்கப்பட்ட அளவிடப்பட்ட குறுக்கு-அதிர்வு கேட்களுக்கு பல்ஸ்-செயல்படுத்தப்பட்ட பின்தளத்தின் புரிதல் தேவை. இந்த அளவிடப்பட்ட கேட்கள் அளவீடு செய்யப்பட்ட CNOT கேட்களின் அட்டவணையை அடிப்படையாகக் கொண்டவை.

source: To demonstrate the pass we construct an arbitrary circuit with blocks of two-qubit gates.
es_un: Para demostrar el pase, construimos un circuito arbitrario con bloques de compuertas de dos qubits.
ja_jp: パスを示すために、2量子ビットゲートのブロックを使用して任意の回路を構築します。
ko_kr: 패스를 보여주기 위해 2개의 큐비트 게이트 블록들로 임의의 회로를 구성한다.
pt_un: Para demonstrar o passe, construímos um circuito arbitrário com blocos de portas de dois qubits.
ta_in: பாஸை நிரூபிக்க, இரண்டு-கியூபிட் கேட்களின் தொகுதிகளுடன் தன்னிச்சையான சர்க்யூட் ஒன்றை உருவாக்குகிறோம்.
