Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/12_quantum_random_access_optimizer.po
Languages: es_un

source: ``MinimumEigensolverResult``: This object contains the results of running the minimum eigen optimizer such as the VQE on the relaxed problem. It provides information about the eigenvalue, and other relevant details. You can refer to the Qiskit Algorithms `documentation <https://qiskit.org/documentation/stubs/qiskit.algorithms.MinimumEigensolverResult.html>`__ for a comprehensive explanation of the entries within this object.
es_un: ``MinimumEigensolverResult``: este objeto contiene los resultados de ejecutar el optimizador propio mínimo, como el VQE, en el problema relajado. Proporciona información sobre el valor propio y otros detalles relevantes. Puedes consultar la `documentación <https://qiskit.org/documentation/stubs/qiskit.algorithms.MinimumEigensolverResult.html>`__ de Qiskit Algorithms para obtener una explicación completa de las entradas dentro de este objeto.

source: ``RoundingContext``: This object encapsulates essential information about the encoding and the solution of the relaxed problem in a form that is ready for consumption by the rounding schemes.
es_un: ``RoundingContext``: este objeto encapsula información esencial sobre la codificación y la solución del problema relajado en una forma que esté lista para ser consumida por los esquemas de redondeo.

source: Manually perform rounding on the relaxed problem results
es_un: Realiza manualmente el redondeo de los resultados del problema relajado

source: Next, we proceed with rounding the results obtained from solving the relaxed problem. To achieve this, we call the ``round()`` method on an instance of the desired rounding scheme and pass it the ``RoundingContext`` object. Below, we provide an example for both rounding schemes, utilizing the relaxed solution obtained in the previous step.
es_un: Luego, se procede a redondear los resultados obtenidos al resolver el problema relajado. Para lograr esto, llamamos al método ``round()`` en una instancia del esquema de redondeo deseado y le pasamos el objeto ``RoundingContext``. A continuación, proporcionamos un ejemplo para ambos esquemas de redondeo, utilizando la solución relajada obtenida en el paso anterior.

source: By manually performing the rounding step, we have more flexibility and control over the rounding scheme applied to the relaxed problem results. This allows for greater exploration and comparison of different rounding strategies.
es_un: Al realizar manualmente el paso de redondeo, tenemos más flexibilidad y control sobre el esquema de redondeo aplicado a los resultados relajados del problema. Esto permite una mayor exploración y comparación de diferentes estrategias de redondeo.

source: Appendix
es_un: Apéndice

source: How to verify correctness of your encoding
es_un: Cómo verificar la exactitud de tu codificación

source: We assume for sake of the QRAO method that **the relaxation commutes with the objective function.** This notebook demonstrates how one can verify this for any problem (a ``QuadraticProgram`` in the language of Qiskit Optimization). One might want to verify this for pedagogical purposes, or as a sanity check when investigating unexpected behavior with the QRAO. Any problem that does not commute should be considered a bug, and if such a problem is discovered, we encourage that you submit it as `an issue on GitHub <https://github.com/qiskit-community/qiskit-optimization/issues>`__.
es_un: Por el método QRAO, asumimos que **la relajación conmuta con la función objetivo.** Este cuaderno demuestra cómo se puede verificar esto para cualquier problema (un ``QuadraticProgram`` en el lenguaje de Qiskit Optimization). Es posible que desees verificar esto con fines pedagógicos o como punto de control al investigar un comportamiento inesperado con el QRAO. Cualquier problema que no conmute debe considerarse un error y, si se descubre dicho problema, te recomendamos que lo envíes como `un problema en GitHub <https://github.com/qiskit-community/qiskit-optimization/issues>`__.

source: The ``EncodingCommutationVerifier`` class allows one to conveniently iterate over all decision variable states and compare each objective value with the corresponding encoded objective value, in order to identify any discrepancy.
es_un: La clase ``EncodingCommutationVerifier`` permite iterar convenientemente sobre todos los estados de las variables de decisión y comparar cada valor objetivo con el valor objetivo codificado correspondiente, para identificar cualquier discrepancia.

source: As before, we ``encode()`` the problem using the QuantumRandomAccessEncoding class:
es_un: Como antes, ``encode()`` el problema usando la clase QuantumRandomAccessEncoding:

source: Finally, we iterate over every decision variable state using ``EncodingCommutationVerifier`` and verify that, in each case, the problem objective value matches the encoded objective value:
es_un: Finalmente, iteramos sobre cada estado de variable de decisión usando ``EncodingCommutationVerifier`` y verificamos que, en cada caso, el valor objetivo del problema coincida con el valor objetivo codificado:

source: If you are able to construct a problem that causes a violation, it is quite possible that you have discovered a bug in the ``QuantumRandomAccessEncoding`` logic. We would greatly appreciate it if you could share the problem with us by `submitting it as an issue <https://github.com/Qiskit/qiskit-optimization/issues>`__ on GitHub.
es_un: Si puedes crear un problema que cause una infracción, es muy posible que hayas descubierto un error en la lógica de ``QuantumRandomAccessEncoding``. Te agradeceríamos mucho si pudieras compartir el problema con nosotros `enviándolo como un problema <https://github.com/Qiskit/qiskit-optimization/issues>`__ en GitHub.
