Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/tutorials/12_qaoa_runtime.po
Languages: es_un, ja_jp, ko_kr, pt_un, ta_in

source: This page was generated from `docs/tutorials/12_qaoa_runtime.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/12_qaoa_runtime.ipynb`__.
ja_jp: このページは `docs/tutorials/12_qaoa_runtime.ipynb`__ から生成されました。
ko_kr: 이 페이지는 "docs/tutorials/12_qaoa_runtime.ipynb" 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/12_qaoa_runtime.ipynb`__.
ta_in: இந்தப் பக்கம் `docs/tutorials/12_qaoa_runtime.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: QAOA Runtime
ja_jp: QAOA ランタイム
ko_kr: QAOA 런타임
pt_un: Runtime QAOA

source: The Qiskit runtime is an execution model that permits us to run an entire program on the backend side. Here, we discuss how to run the QAOA algorithm in the Qiskit runtime. We will discuss several of the features that this first version of the QAOA Runtime makes available.
es_un: El runtime de Qiskit es un modelo de ejecución que nos permite ejecutar un programa completo en el backend. Aquí, discutimos cómo ejecutar el algoritmo QAOA en el runtime de Qiskit. Discutiremos varias de las características que esta primera versión de QAOA Runtime pone a disposición.
ja_jp: Qiskitランタイムは、プログラム全体をバックエンド側で実行できるようにする実行モデルです。ここでは、QiskitランタイムでQAOAアルゴリズムを実行する方法について説明します。この最初のバージョンのQAOAランタイムが利用できるようにする機能のいくつかについて説明します。
ko_kr: Qiskit 런타임은 백엔드측에서 전체 프로그램을 실행할 수 있는 실행 모델이다. 여기서는 Qiskit 런타임에서 QAOA 알고리즘을 실행하는 방법에 대해 설명한다. QAOA Runtime의 첫 번째 버전이 제공하는 몇 가지 기능에 대해 설명할 것이다.
pt_un: O Qiskit runtime é um modelo de execução que nos permite executar um programa inteiro no backend. Aqui, discutimos como executar o algoritmo QAOA do Qiskit runtime. Discutiremos vários dos recursos que esta primeira versão do QAOA Runtime disponibiliza.
ta_in: Qiskit runtime என்பது ஒரு எக்ஸிகியூஷன் மாடலாகும், இது ஒரு முழு நிரலையும் பின்தளத்தில் இயக்க அனுமதிக்கிறது. QAOA அல்காரிதத்தை Qiskit runtime எவ்வாறு இயக்குவது என்பதை இங்கே விவாதிக்கிறோம். QAOA runtime -ன் இந்த முதல் பதிப்பில் கிடைக்கும் பல அம்சங்களைப் பற்றி நாம் விவாதிப்போம்.

source: Preliminaries
es_un: Preliminares
ja_jp: 事前ステップ
ko_kr: 사전 준비
pt_un: Preliminares
ta_in: பூர்வாங்கங்கள்

source: First, we load the program and inspect its arguments to know what inputs it is expecting. We also investigate the return types to understand what will be returned to us. We obtain the QAOA program from the provider as follows.
es_un: Primero, cargamos el programa e inspeccionamos sus argumentos para saber qué entradas espera. También investigamos los tipos de retorno para entender qué se nos devolverá. Obtenemos el programa QAOA del proveedor de la siguiente manera.
ja_jp: まず、プログラムをロードし、その引数を調べて、どの入力が期待されているかを確認します。また、戻り値型を調査して、何が返されるかを理解します。QAOAプログラムは、プロバイダーから次のように入手します。
ko_kr: 먼저 프로그램을 불러오고 전달인자를 검사하여 예상되는 입력값을 확인한다. 또한 어떤 값이 반환되는지 이해하기 위해 리턴값 유형을 조사한다. 다음과 같이 제공자로부터 QAOA 프로그램을 받는다.
pt_un: Primeiro, carregamos o programa e inspecionamos seus argumentos para saber quais entradas ele está esperando. Também investigamos os tipos de devolução para entender o que nos será devolvido. Obtemos o programa QAOA do fornecedor da seguinte forma.
ta_in: முதலில், நிரலை ஏற்றி, அது என்ன உள்ளீடுகளை எதிர்பார்க்கிறது என்பதை அறிய அதன் ஆர்கியுமென்ட்களை ஆய்வு செய்கிறோம். நாம் என்ன திரும்பப் பெறப்போகிறோம் என்பதைப் புரிந்துகொள்வதற்காக ரிட்டர்ன் வகைகளையும் நாம் ஆராய்வோம். QAOA திட்டத்தை நாம் ப்ரொவைடரிடமிருந்து பின்வருமாறு பெறுகிறோம்.

source: The arguments to the runtime are obtained as follows.
es_un: Los argumentos para el runtime se obtienen de la siguiente manera.
ja_jp: ランタイムへの引数は次のように取得されます。
ko_kr: 런타임에 대한 전달인자는 다음과 같이 얻는다.
pt_un: Os argumentos para o runtime são obtidos da seguinte maneira.
ta_in: ரன்டைமிற்கான ஆர்கியுமென்ட்கள் பின்வருமாறு பெறப்படுகின்றன.

source: Here, we see the different input arguments which we now elaborate on.
es_un: Aquí, vemos los diferentes argumentos de entrada en los que ahora elaboramos.
ja_jp: ここでは、以下で詳しく説明するさまざまな入力引数を確認します。
ko_kr: 여기서 지금 설명하고 있는 다양한 전달인자 입력값을 볼 수 있다.
pt_un: Aqui, vemos os diferentes argumentos de entrada que acabamos de elaborar.
ta_in: இங்கே, நாம் இப்போது விரிவுபடுத்தும் வெவ்வேறு உள்ளீட்டு வாதங்களைக் காண்கிறோம்.

source: **operator** is by far the most important argument since it represent the cost operator that we want to minimize. For QAOA this corresponds to a ``PauliSumOp``. Each time there is a quadratic term between two decision variables in the problem we wish to minimize there will be a corresponding ``ZZ`` term in the ``PauliSumOp``. For example, the operator ``PauliSumOp.from_list([("ZIZ", 1), ("IZZ", -1), ("ZZI", 1)])`` may correspond to a Maxcut problem on a triangle where one edge has a negative weight.
es_un: **operator** es, con mucho, el argumento más importante, ya que representa el operador de costo que queremos minimizar. Para QAOA, esto corresponde a un ``PauliSumOp``. Cada vez que haya un término cuadrático entre dos variables de decisión en el problema que deseamos minimizar, habrá un término ``ZZ`` correspondiente en el ``PauliSumOp``. Por ejemplo, el operador ``PauliSumOp.from_list([("ZIZ", 1), ("IZZ", -1), ("ZZI", 1)])`` puede corresponder a un problema de Maxcut sobre un triángulo donde un borde tiene un peso negativo.
ja_jp: **operator** は、最小化したいコスト演算子を表すため、これまでで最も重要な引数です。QAOAの場合、これは ``PauliSumOp`` に対応します。問題の2つの決定変数の間に二次項があるたびに、最小化したい ``PauliSumOp`` に対応する ``ZZ`` 項があります。たとえば、演算子 ``PauliSumOp.from_list([("ZIZ", 1), ("IZZ", -1), ("ZZI", 1)])`` は、ひとつのエッジの重みが負である三角形の最大カット問題に対応する場合があります。
ko_kr: **operator** 는 최소화하고자 하는 비용 연산자를 나타내므로 가장 중요한 전달인자다. QAOA의 경우 ``PauliSumOp`` 에 해당한다. 문제의 두 결정변수 사이에 이차항이 있을때마다 ``PauliSumOp`` 에 상응하는 ``ZZ`` 가 최소화하기를 바란다. 예를들어, ``PauliSumOp.from_list([("ZIZ", 1), ("IZZ", -1), ("ZZI", 1)])`` 는 한 모서리의 가중치가 음수인 삼각형 상에서의 Maxcut 문제에 해당될 수 있다.
pt_un: **operador** é de longe o argumento mais importante, pois representa o operador custo que queremos minimizar. Para QAOA isso corresponde a um ``PauliSumOp``. Cada vez que houver um termo quadrático entre duas variáveis de decisão no problema que desejamos minimizar, haverá um termo ``ZZ`` correspondente no ``PauliSumOp``. Por exemplo, o operador ``PauliSumOp.from_list([("ZIZ", 1), ("IZZ", -1), ("ZZI", 1)])`` pode corresponder a um problema de Maxcut em um triângulo onde uma aresta tem um peso negativo.
ta_in: **operator** என்பது மிக முக்கியமான ஆர்கியுமென்ட் ஆகும், ஏனெனில் இது நாம் குறைக்க விரும்பும் காஸ்ட் ஆபரேட்டரைக் குறிக்கிறது. QAOA க்கு இது ``PauliSumOp`` -க்கு ஒத்திருக்கிறது. ஒவ்வொரு முறையும் நாம் குறைக்க விரும்பும் சிக்கலில் இரண்டு முடிவு மாறிகளுக்கு இடையே இருபடிச் சொற்கூறு இருக்கும் போது, ​​``PauliSumOp`` இல் தொடர்புடைய ``ZZ` சொற்கூறு இருக்கும். எடுத்துக்காட்டாக, ஆபரேட்டர் ``PauliSumOp.from_list([("ZIZ", 1), ("IZZ", -1), ("ZZI", 1)])`` ஒரு முக்கோணத்தில் ஒரு Maxcut சிக்கலுடன் ஒத்திருக்கலாம், அங்கு ஒரு விளிம்பில் எதிர்மறை எடை இருக்கும்.

source: **optimizer** represents the optimizer used in the closed-loop classical optimization. This will default to SPSA to deal with the noise of the hardware.
es_un: **optimizer** representa el optimizador utilizado en la optimización clásica de ciclo cerrado. Esto se establecerá de forma predeterminada en SPSA para hacer frente al ruido del hardware.
ja_jp: **optimizer** は、閉ループの古典的な最適化で使用されるオプティマイザーを表します。これは、ハードウェアのノイズを処理するためにデフォルトで SPSA になります。
ko_kr: **optimizer** 는 닫힌 고리(closed-loop) 의 고전적인 최적화에 사용되는 최적화 도구를 나타낸다. 이는 하드웨어의 노이즈를 처리하기 위해 기본적으로 SPSA가 사용된다.
pt_un: **optimizer** representa o otimizador usado na otimização clássica de malha fechada. Este padrão será o SPSA para lidar com o ruído do hardware.
ta_in: **optimizer** என்பது க்ளோஸ்ட்-லூப் கிளாசிக்கல் ஆப்டிமைசேஷனில் பயன்படுத்தப்படும் ஆப்டிமைசரைக் குறிக்கிறது. வன்பொருளின் இரைச்சலைச் சமாளிக்க இது SPSAக்கு இயல்புநிலையாக இருக்கும்.

source: **reps** this integer is the number of QAOA layers.
es_un: **reps** este número entero es el número de capas del QAOA.
ja_jp: **reps** この整数は、QAOAレイヤーの数です。
ko_kr: ** reps** 이 정수는 QAOA 레이어 수이다.
pt_un: **reps** esse número inteiro é o número de camadas QAOA.
ta_in: **reps** இந்த முழு எண் QAOA அடுக்குகளின் எண்ணிக்கை.

source: **initial_point** is the initial values for :math:`\gamma` and :math:`\beta`. This is a list given in the following order :math:`[\gamma_1, \beta_1, \gamma_2, \beta_2, ...]`. The length of this list should therefore be twice the QAOA depth (i.e. the ``reps`` parameter).
es_un: **initial_point** son los valores iniciales para :math:`\gamma` y :math:`\beta`. Esta es una lista en el siguiente orden :math:`[\gamma_1, \beta_1, \gamma_2, \beta_2, ...]`. Por lo tanto, la longitud de esta lista debe ser el doble de la profundidad de QAOA (es decir, el parámetro ``reps``).
ja_jp: **initial_point** は、 :math:`\gamma` と :math:`\beta` の初期値です。これは、 :math:`[\gamma_1, \beta_1, \gamma_2, \beta_2, ...]` の順序で指定されたリストです。したがって、このリストの長さは、QAOAの深さの2倍にする必要があります（つまり、 ``reps`` パラメーター）。
ko_kr: **initial_point** 는 `\gamma` 및 :math: `\beta` 의 초기 값이다. 이 목록은 `[\gamma_1, \beta_1, \gamma_2, \beta_2, ...]` 에 주어진 목록이다. 따라서 이 목록의 길이는 QAOA 깊이 (즉 ``reps`` 매개변수) 의 두 배가 되어야 한다.
pt_un: **initial_point** são os valores iniciais para :math:`\gamma` e :math:`\beta`. Esta é uma lista dada na seguinte ordem :math:`[\gamma_1, \beta_1, \gamma_2, \beta_2, ...]`. O comprimento desta lista deve, portanto, ser duas vezes a profundidade QAOA (i.e. o parâmetro ``reps``).
ta_in: **initial_point** என்பது :math:`\gamma` மற்றும் :math:`\beta` க்கான ஆரம்ப மதிப்புகள். இது பின்வரும் வரிசையில் கொடுக்கப்பட்ட பட்டியல் :math:`[\gamma_1, \beta_1, \gamma_2, \beta_2, ...]`. எனவே இந்தப் பட்டியலின் நீளம் QAOA ஆழத்தை விட இரு மடங்கு இருக்க வேண்டும் (அதாவது ``reps`` அளவுரு).

source: **shots** is the number of shots to gather for each circuit.
es_un: **shots** es el número de iteraciones a ejecutar para cada circuito.
ja_jp: **shots** は、各回路で収集するショット数です。
ko_kr: **shots** 은 각 회로를 돌리는 총 횟수이다.
pt_un: **tiros** é o número de shots a serem coletados para cada circuito.
ta_in: **shots** என்பது ஒவ்வொரு சர்க்யூட்டுக்கும் சேகரிக்க வேண்டிய ஷாட்களின் எண்ணிக்கை.

source: **alpha** is the :math:`\alpha` of the CVaR optimization [1]. If :math:`\alpha` is smaller than one then only the best :math:`\alpha` fraction of shots will be retained in the optimization, i.e. this corresponds to using ``CVaRExpectation(alpha, PauliExpectation())`` which can be found in ``qiskit.opflow``.
es_un: **alpha** es el :math:`\alpha` de la optimización CVaR [1]. Si :math:`\alpha` es menor que uno, entonces solo la mejor fracción de :math:`\alpha` de iteraciones se retendrá en la optimización, es decir, esto corresponde al uso de ``CVaRExpectation(alpha, PauliExpectation())`` que se puede encontrar en ``qiskit.opflow``.
ja_jp: **alpha** はCVaR最適化の :math:`\alpha` です [1] 。 :math:`\alpha` が1より小さい場合、最適化ではショットの最良の :math:`\alpha` 部分のみが保持されます。つまり、これは ``qiskit.opflow`` にある ``CVaRExpectation(alpha, PauliExpectation())`` の使用に対応します。
ko_kr: **alpha** 는 CVaR 최적화의 `\alpha` 이다. 만약 `\alpha` 가 1보다 작으면 최고의 `\alpha` 샷들만이 최적화에 유지된다. 즉, 이는 ``qiskit.opflow`` 에서 찾을 수 있는 ``CVaRExpectation(alpha, PauliExpectation())`` 를 사용하는 것에 해당한다.
pt_un: **alpha** é o :math:`\alpha` da otimização CVaR [1]. Se :math:`\alpha` for menor que um, então apenas a melhor fração :math:`\alpha` de shots será retida na otimização, i.e. isso corresponde ao uso de ``CVaRExpectation(alpha, PauliExpectation())`` que pode ser encontrado em ``qiskit.opflow``.
ta_in: **alpha** என்பது CVaR optimization [1] இன் :math:`\alpha` ஆகும். :math:`\alpha` என்பது ஒன்றை விடச் சிறியதாக இருந்தால், சிறந்த :math:`\alpha` ஷாட்களின் பின்னம் மட்டுமே தேர்வுமுறையில் தக்கவைக்கப்படும், அதாவது இது ``CVaRExpectation(alpha, PauliExpectation())`` ஐப் பயன்படுத்துவதற்கு ஒத்திருக்கிறது, ``qiskit.opflow`` இல் காணலாம்.

source: **measurement_error_mitigation** determines or not to use readout error mitigation. If ``True``, the algorithm used this will employ the ``TensoredMeasFitter``.
es_un: **measurement_error_mitigation** determina si se debe utilizar la mitigación de errores de lectura. Si es ``True``, el algoritmo empleado usará el ``TensoredMeasFitter``.
ja_jp: **measurement_error_mitigation** は、読み出しエラー軽減を使用するかどうかを決定します。 ``True`` の場合、これを使用するアルゴリズムは ``TensoredMeasFitter`` を使用します。
ko_kr: **measurement_error_mitigation** 는 해독 오류 완화를 사용할지 여부를 결정한다. 만약 이 값이 ``True`` 라면 이를 사용하는 알고리즘은 ``TensoredMeasFitter`` 을 사용할 것이다.
pt_un: **measurement_error_mitigation** determina ou não o uso da mitigação de erros de leitura. Se for ``True``, o algoritmo usado empregará o ``TensoredMeasFitter``.
ta_in: **measurement_error_mitigation** வாசிப்புப் பிழைத் தணிப்பைப் பயன்படுத்தலாமா வேண்டாமா என்பதைத் தீர்மானிக்கிறது. ``True`` எனில், இதைப் பயன்படுத்திய அல்காரிதம் ``TensoredMeasFitter`` ஐப் பயன்படுத்தும்.

source: If **use_swap_strategies** is ``True`` the QAOA program will transpile the QAOA circuit with dedicated swap strategies that take into account the commutative nature of the ``ZZ`` operators in QAOA and the coupling map of the backend on which the program will run. If this option is False then the QAOA program will default to the standard transpiler with optimization level 1. This optimization level can be chosen using the **optimization_level** input option.
es_un: Si **use_swap_strategies** es ``True``, el programa QAOA transpilará el circuito QAOA con estrategias de intercambio dedicadas que tienen en cuenta la naturaleza conmutativa de los operadores ``ZZ`` en QAOA y el mapa de acoplamiento del backend en el que el programa se ejecutará. Si esta opción es False, entonces el programa QAOA usará por defecto el transpilador estándar con nivel de optimización 1. Este nivel de optimización se puede elegir utilizando la opción de entrada **optimization_level**.
ja_jp: **use_swap_strategies** が ``True`` の場合、QAOAプログラムは、QAOAの ``ZZ`` 演算子の可換性と、プログラムが実行されるバックエンドの結合マップを考慮した専用のスワップ戦略を使用して、QAOA回路をトランスパイルします。 このオプションがFalseの場合、QAOAプログラムはデフォルトで最適化レベル1の標準トランスパイラーになります。この最適化レベルは、 **optimization_level** 入力オプションを使用して選択できます。
ko_kr: 만약 **use_swap_strategies** 이 ``True`` 라면, QAOA 프로그램은 QAOA에 있는 ``ZZ`` 연산자의 상호 작용 특성과 프로그램이 실행될 백엔드의 결합 맵을 고려하는 교환 전략으로 QAOA 회로를 트랜스파일링 시킬 것이다. 만약 이 옵션이 False라면 QAOA 프로그램은 최적화 레벨 1을 갖는 표준 트랜스파일러로 설정될 것이다. 이 최적화 레벨은 **optimization_level** 입력값 옵션을 사용하여 선택할 수 있다.
pt_un: Se **use_swap_strategies** for ``True`` o programa QAOA irá transpilar o circuito QAOA com estratégias de swap dedicadas que levam em conta a natureza comutativa dos operadores ``ZZ`` em QAOA e o mapa de acoplamento do backend no qual o programa será executado. Se esta opção for False, o programa QAOA assumirá como padrão o transpilador padrão com nível de otimização 1. Esse nível de otimização pode ser escolhido usando a opção de entrada **optimization_level**.
ta_in: **use_swap_strategies** என்பது ``True`` எனில், QAOA நிரல், QAOA சர்கியூட்டை அர்ப்பணிப்பு ஸ்வாப் உத்திகளுடன்மாற்றி அமைக்க QAOA இல் உள்ள ``ZZ`` ஆபரேட்டர்களின் பரிமாற்றத் தன்மையையும், நிரல் இயங்கும் பின்தளத்தின் இணைப்பு வரைபடத்தையும் கணக்கில் எடுத்துக் கொள்ளும். இந்த விருப்பம் தவறு எனில், QAOA நிரல் மேம்படுத்தல் நிலை 1 உடன் நிலையான டிரான்ஸ்பைலருக்கு இயல்புநிலையாக இருக்கும். இந்த தேர்வுமுறை நிலையை **optimization_level** உள்ளீட்டு விருப்பத்தைப் பயன்படுத்தி தேர்வு செய்யலாம்.

source: If **use_pulse_efficient** is set to ``True`` then a pulse efficient transpilation will be run at each QAOA iteration [2]. This collects two-qubit blocks and applies Cartan’s KAK decomposition to obtain a ``RZXGate`` representation of the circuit. Scaled cross-resonance pulses are then used. Further details are given in Appendix A below.
es_un: Si **use_pulse_efficient** se establece en ``True``, se ejecutará una transpilación eficiente en pulsos en cada iteración de QAOA [2]. Esto recopila bloques de dos qubits y aplica la descomposición KAK de Cartan para obtener una representación ``RZXGate`` del circuito. A continuación, se utilizan pulsos de resonancia cruzada escalados. Se proporcionan más detalles en el Apéndice A más abajo.
ja_jp: **use_pulse_efficient** が ``True`` に設定されている場合、パルス効率の高いトランスパイルが各QAOA反復で実行されます [2] 。これにより、2量子ビットのブロックが収集され、CartanのKAK分解が適用されて、回路の ``RZXGate`` 表現が取得されます。次に、スケーリングされた相互共振パルスが使用されます。 詳細については、以下の付録Aを参照してください。
ko_kr: 만약 **use_pulse_efficient** 이 ``True`` 로 설정되면, 각 QAOA 반복에서 펄스의 효율적인 트랜스파일이 실행될 것이다. 이것은 2개의 큐비트 블록을 수집하고 Cartan의 KAK 분해를 적용하여 회로의 ``RZXGate``를 얻는다. 그런 다음 스케일링된 교차-공진 펄스가 사용된다. 자세한 내용은 아래 부록 A에 나와있다.
pt_un: Se **use_pulse_efficient** for definido como ``True``, uma transpilação com eficiência de pulso será executada em cada iteração QAOA [2]. Isso coleta blocos de dois qubits e aplica a decomposição KAK de Cartan para obter uma representação ``RZXGate`` do circuito. Pulsos de ressonância cruzada escalonados são então usados. Mais detalhes são fornecidos no Apêndice A abaixo.
ta_in: **use_pulse_efficiency** என்பது ``True`` என அமைக்கப்பட்டால், ஒவ்வொரு QAOA மறு செய்கையிலும் ஒரு பல்ஸ் எஃபிஷியன்ட் டிரான்ஸ்பிலேஷன் இயக்கப்படும் [2]. இது இரண்டு-கியூபிட் தொகுதிகளைச் சேகரித்து, சர்கியூட்டின் ``RZXGate`` பிரதிநிதித்துவத்தைப் பெற Cartan’s KAK சிதைவைப் பயன்படுத்துகிறது. அளவிடப்பட்ட குறுக்கு-அதிர்வு பல்ஸ்கள் பின்னர் பயன்படுத்தப்படுகின்றன. மேலும் விவரங்கள் பின்னிணைப்பு A இல் கொடுக்கப்பட்டுள்ளன.

source: If **use_initial_mapping** is ``True`` then a heuristic algorithm will be run to permute the Pauli operators in the cost operator to better fit the coupling map of the device. This permutation is only applied if the ``use_swap_strategies`` option is set to ``True`` and only makes sense for non-fully-connected problems.
es_un: Si **use_initial_mapping** es ``True``, se ejecutará un algoritmo heurístico para permutar los operadores de Pauli en el operador de costos para que se ajuste mejor el mapa de acoplamiento del dispositivo. Esta permutación solo se aplica si la opción ``use_swap_strategies`` está configurada en ``True`` y solo tiene sentido para problemas que no están completamente conectados.
ja_jp: **use_initial_mapping** が ``True`` の場合、ヒューリスティックアルゴリズムが実行され、コスト演算子のパウリ演算子がデバイスの結合マップによりよく適合するように並べ替えられます。この順列は、 ``use_swap_strategies`` オプションが ``True`` に設定されている場合にのみ適用され、完全に接続されていない問題に対してのみ意味があります。
ko_kr: 만약 **use_initial_mapping** 이 ``True`` 라면, 비용 연산자의 파울리 연산자를 장치의 결합 맵에 더 잘 맞도록 휴리스틱 알고리즘이 실행된다. 이는 ``use_swap_strategies`` 옵션이 ``True`` 로 설정된 경우에만 적용되어 있고 완전히 연결되지 않은 문제점에 대해서만 감지된다.
pt_un: Se **use_initial_mapping** for ``True`` então um algoritmo heurístico será executado para permutar os operadores Pauli no operador de custo para melhor ajustar o mapa de acoplamento do dispositivo. Esta permutação só é aplicada se a opção ``use_swap_strategies`` estiver configurada para ``True`` e só faz sentido para problemas não totalmente conectados.
ta_in: **use_initial_mapping** என்பது ``True`` எனில், சாதனத்தின் இணைப்பு வரைபடத்தைச் சிறப்பாகப் பொருத்துவதற்கு, காஸ்ட் ஆபரேட்டரில் உள்ள Pauli ஆபரேட்டர்களை வரிசைப்படுத்த ஒரு ஹூரிஸ்டிக் அல்காரிதம் இயக்கப்படும். ``use_swap_strategies`` விருப்பம் ``True`` என அமைக்கப்பட்டால் மட்டுமே இந்த வரிசைமாற்றம் பயன்படுத்தப்படும், மேலும் முழுமையாக இணைக்கப்படாத சிக்கல்களுக்கு மட்டுமே இது பொருந்தும்.

source: **optimization_level** This is the optimization level of the Qiskit transpiler if swap strategies are not used. The default value is 1.
es_un: **optimization_level** Este es el nivel de optimización del transpilador Qiskit si no se utilizan estrategias de intercambio. El valor predeterminado es 1.
ja_jp: **optimization_level** これは、スワップ戦略が使用されていない場合のQiskitトランスパイラーの最適化レベルです。 デフォルト値は1です。
ko_kr: **optimization_level** 은 swap 전략이 사용되지 않은 경우의 Qiskit 트랜스파일러의 최적화 레벨이다. 기본값은 1이다.
pt_un: **optimization_level** Este é o nível de otimização do transpilador Qiskit se as estratégias de troca não forem usadas. O valor padrão é 1.
ta_in: **optimization_level** இது ஸ்வாப் உத்திகள் பயன்படுத்தப்படாவிட்டால் வரும் Qiskit டிரான்ஸ்பைலரின் மேம்படுத்தல் நிலை. இதன் இயல்புநிலை மதிப்பு 1.

source: References
es_un: Referencias
ja_jp: 参考文献
ko_kr: 참조
pt_un: Referências
ta_in: குறிப்புகள்

source: Running the QAOA runtime program
es_un: Ejecución del programa QAOA runtime
ja_jp: QAOAランタイムプログラムの実行
ko_kr: QAOA 런타임 프로그램 실행
pt_un: Executando o programa QAOA runtime
ta_in: QAOA இயக்க நேர நிரலை இயக்குகையில்

source: We now show how to use the QAOA runtime program with a five qubit example.
es_un: Ahora mostramos cómo usar el programa QAOA runtime con un ejemplo de cinco qubits.
ja_jp: ここで、5量子ビットの例を使用してQAOAランタイムプログラムを使用する方法を示します。
ko_kr: 예제로 QAOA 프로그램을 5개의 큐비트로 사용하는 방법을 보여준다.
pt_un: Agora mostramos como usar o programa QAOA runtime com um exemplo de cinco qubits.
ta_in: QAOA இயக்க நேர நிரலை எவ்வாறு பயன்படுத்துவது என்பதை இப்போது ஐந்து கியூபிட் உதாரணத்துடன் காட்டுகிறோம்.

source: Here, we show how to directly call the program on the cloud. However, Qiskit Optimization provides the ``QAOAClient`` which seamlessly fits in the Qiskit Optimization workflow and can be used as a direct replacement of your local ``QAOA`` algorithm. This ``QAOAClient`` is discussed below in this tutorial.
es_un: Aquí, mostramos cómo llamar directamente al programa en la nube. Sin embargo, Qiskit Optimization proporciona el ``QAOAClient`` que se adapta perfectamente al flujo de trabajo de Qiskit Optimization y se puede utilizar como un reemplazo directo de su algoritmo local de ``QAOA``. Este ``QAOAClient`` se analiza a continuación en este tutorial.
ja_jp: ここでは、クラウド上でプログラムを直接呼び出す方法を示します。 ただし、Qiskit Optimization は、Qiskit Optimization ワークフローにシームレスに適合する ``QAOAClient`` を提供し、ローカル ``QAOA`` アルゴリズムの直接の代替として使用できます。 この ``QAOAClient`` については、このチュートリアルで以下で説明します。
ko_kr: 여기서는 클라우드에서 프로그램을 직접 불러오는 방법을 보여준다. 그러나 Qiskit 최적화는 Qiskit 최적화 워크플로우에 완벽하게 맞는 ``QAOAClient`` 를 제공하며 로컬 ``QAOA`` 알고리즘을 직접 대체할 수 있다. 이 튜토리얼에서는 ``QAOAClient`` 에 대해 설명한다.
pt_un: Aqui, mostramos como chamar diretamente o programa na nuvem. No entanto, o Qiskit Optimization fornece o ``QAOAClient`` que se encaixa perfeitamente no fluxo de trabalho do Qiskit Optimization e pode ser usado como um substituto direto do seu algoritmo local ``QAOA``. Este ``QAOAClient`` é discutido abaixo neste tutorial.
ta_in: கிளவுடில் நிரலை எவ்வாறு நேரடியாக அழைப்பது என்பதை இங்கே காண்பிக்கிறோம். இருப்பினும், Qiskit ஆப்டிமைசேஷன் ``QAOAClient`` ஐ வழங்குகிறது, இது Qiskit ஆப்டிமைசேஷன் பணிப்பாய்வுக்கு தடையின்றி பொருந்துகிறது மற்றும் உங்கள் லோக்கல் ``QAOA`` அல்காரிதத்தின் நேரடி மாற்றாகப் பயன்படுத்தப்படலாம். இந்த ``QAOAClient`` இந்த டுடோரியலில் கீழே விவாதிக்கப்பட்டுள்ளது.

source: Now, we run the program using the provider.
es_un: Ahora, ejecutamos el programa usando el proveedor.
ja_jp: ここで、プロバイダーを使用してプログラムを実行します。
ko_kr: 이제 공급자를 이용하여 프로그램을 실행한다.
pt_un: Agora, executamos o programa usando o provedor.
ta_in: இப்போது, ​​ப்ரோவைடரைப் பயன்படுத்தி நிரலை இயக்குகிறோம்.
