Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/sample_expval_program/qiskit_runtime_expval_program.po
Languages: es_un, ja_jp, ko_kr, pt_un, ta_in

source: We are now in a position to upload the program. To do so we first uncomment and execute the line ``%%writefile sample_expval.py`` giving use the ``sample_expval.py`` file we need to upload.
es_un: Ahora estamos en condiciones de cargar el programa. Para hacerlo, primero descomentamos y ejecutamos la línea ``%%writefile sample_expval.py`` dando uso al archivo ``sample_expval.py`` que necesitamos cargar.
ja_jp: 私たちは今、プログラムをアップロードする立場にあります。 これを行うには、まず ``%%writefile sample_expval.py`` という行のコメントを外して、アップロードする必要がある ``sample_expval.py`` ファイルを使用してください。
ko_kr: 이제 프로그램을 업로드 할 수 있는 단계에 왔다. 첫번째로 ``%%writefile sample_expval.py`` 라인의 주석을 해제하고 실행한다. 이를 통해 업로드 하려는 ``sample_expval.py`` 파일을 사용할 수 있다.
ta_in: நாங்கள் இப்போது நிரலைப் பதிவேற்றும் நிலையில் இருக்கிறோம். அவ்வாறு செய்ய, முதலில் நாம் பதிவேற்ற வேண்டிய ``sample_expval.py`` கோப்பைப் பயன்படுத்தி ``%%writefile sample_expval.py`` என்ற வரியை நீக்கி, செயல்படுத்துவோம்.

source: Delete program if needed
es_un: Eliminar el programa si es necesario
ja_jp: 必要な場合はプログラムを削除
ko_kr: 필요시 프로그램 삭제
pt_un: Delete o programa se necessario
ta_in: தேவைப்பட்டால் நிரலை நீக்கவும்

source: Wrapping the runtime program
es_un: Encapsular el programa runtime
ja_jp: ランタイム・プログラムのラッピング
ko_kr: 런타임 프로그램 감싸기
pt_un: Encapsulando o programa de runtime
ta_in: இயக்க நேர நிரலை மூடுதல்

source: As always, it is best to wrap the call to the runtime program with a function (or possibly a class) that makes input easier and does some validation.
es_un: Como siempre, es mejor encapsular la llamada al programa runtime con una función (o posiblemente una clase) que facilite la entrada y realice alguna validación.
ja_jp: 常に、入力を容易にし、検証を行う関数 (またはクラス ) を使用して、ランタイム・プログラムにコールをラップするのが最善です。
ko_kr: 항상 그렇듯, 런타임 프로그램에 대한 호출을 감싸는 함수를 만들면 인수 입력을 보다 간편하게 하고 일부 유효성 검사를 수행할 수 있다.
pt_un: Como sempre, é melhor encapsular a chamada ao programa de runtime com uma função (ou possivelmente uma classe) que facilite a entrada e faça alguma validação.
ta_in: எப்பொழுதும் போல், உள்ளீட்டை எளிதாக்கும் மற்றும் சில சரிபார்ப்புகளைச் செய்யும் ஒரு செயல்பாடு (அல்லது ஒரு வகுப்பு) மூலம் இயக்க நேர நிரலுக்கான அழைப்பை மூடுவது சிறந்தது.

source: Trying it out
es_un: Intentándolo
ja_jp: お試しください
ko_kr: 따라하기
pt_un: Testando
ta_in: முயற்சி செய்கிறேன்

source: Let’s try running the program here with our previously made GHZ state and running on the simulator.
es_un: Intentemos ejecutar el programa aquí con nuestro estado GHZ creado anteriormente y ejecutándolo en el simulador.
ja_jp: 以前に GHZ の状態で実行され、シミュレーター上で実行されているプログラムを実行することができます。
ko_kr: 전에 만든 GHZ 상태 프로그램을 시뮬레이터로 실행한다.
ta_in: எங்கள் முன்பு உருவாக்கப்பட்ட GHZ நிலை மற்றும் சிமுலேட்டரில் இயங்கும் நிரலை இங்கே இயக்க முயற்சிப்போம்.

source: The first two projectors should be nearly :math:`0.50` as they tell us the probability of being in the all zeros and ones states, respectively, which should be 50/50 for our GHZ state. The final expectation value of ``ZZZZ`` should be one since this is a GHZ over an even number of qubits. It should go close to zero for an odd number.
es_un: Los primeros dos proyectores deberían ser casi :math:`0.50`, ya que nos indican la probabilidad de estar en los estados todos ceros y todos unos, respectivamente, que debería ser 50/50 para nuestro estado GHZ. El valor esperado final de ``ZZZZ`` debe ser uno, ya que se trata de un GHZ sobre un número par de qubits. Debe ir cerca de cero para un número impar.
ja_jp: 最初の 2 つの射影は、すべて 0 と 1 の状態にある確率を示すために、それぞれ :math:`0.50` であるべきで、 GHZ の状態では 50/50 であるべきだからです。 ``ZZZZ`` の最後の期待値は、偶数個の量子ビット数の GHZ であるために1になるはずです。 奇数の場合はゼロに近い値になるはずです。
ko_kr: 앞선 두개의 값은 각각 모두 1과 0상태가 되는 확률을 의미하기 때문에 :math:`0.50` 에 가까워야 한다. 이는 GHZ 상태에 대해 50/50 이어야 한다. 마지막 값은 ``ZZZZ`` 의 기대값으로 짝수 큐비트에 대한 GHZ 상태이기 때문에 1이 되어야 한다. 홀수 큐비트에 대해서는 0이 되어야 한다.
ta_in: முதல் இரண்டு ப்ரொஜெக்டர்களும் கிட்டத்தட்ட :math:`0.50` ஆக இருக்க வேண்டும், ஏனெனில் அவை முறையே அனைத்து பூஜ்ஜியங்களிலும் ஒரு நிலையிலும் இருப்பதற்கான நிகழ்தகவைக் கூறுகின்றன, இது நமது GHZ நிலைக்கு 50/50 ஆக இருக்க வேண்டும். ``ZZZZ`` இன் இறுதி எதிர்பார்ப்பு மதிப்பு ஒன்றாக இருக்க வேண்டும், ஏனெனில் இது இரட்டை எண்ணிக்கையிலான குவிட்களுக்கு மேல் GHZ ஆகும். ஒற்றைப்படை எண்ணுக்கு இது பூஜ்ஜியத்திற்கு அருகில் செல்ல வேண்டும்.

source: Quantum Volume as an expectation value
es_un: Volumen Cuántico como un valor esperado
ja_jp: 期待値としての量子ボリューム
ko_kr: 양자 볼륨을 기대값으로 나타내기
pt_un: Volume Quântico (QV) como um valor esperado
ta_in: ஒரு எதிர்பார்ப்பு மதிப்பாகக் குவாண்டம் தொகுதி

source: Here we formulate QV as an expectation value of a projector onto the heavy-output elements on a distribution. We can then use our expectation value routine to compute whether a given circuit has passed the QV metric.
es_un: Aquí formulamos QV como un valor esperado de un proyector en los elementos de alto rendimiento en una distribución. Luego podemos usar nuestra rutina de valor esperado para calcular si un circuito dado ha pasado la métrica QV.
ja_jp: ここでは、QVを分布上のヘビー・アウトプット要素への射影の期待値として定式化します。 次に、期待値ルーチンを使用して、特定の回路がQVメトリックに通過したかどうかを計算できます。
ko_kr: 다음으로는 QV를 확률분포의 헤비-아웃풋(heavy-ouput) 요소에 대한 투영자(projector) 의 기댓값으로 수식화한다. 다음으로 기댓값 루틴을 사용하여 회로의 QV 기준(metric) 통과 여부를 알 수 있다.
pt_un: Aqui formulamos QV como um valor esperado de um projetor para os elementos de heavy-output em uma distribuição. Podemos então usar nossa rotina de valor esperado para calcular se um determinado circuito passou na métrica QV.
ta_in: இங்கே நாம் QV ஐ ஒரு ப்ரொஜெக்டரின் எதிர்பார்ப்பு மதிப்பாக ஒரு விநியோகத்தில் உள்ள ஹெவி-அவுட்புட் கூறுகளை உருவாக்குகிறோம். கொடுக்கப்பட்ட சர்க்யூட் QV மெட்ரிக்கைக் கடந்துவிட்டதா என்பதைக் கணக்கிடுவதற்கு நமது எதிர்பார்ப்பு மதிப்பு வழக்கத்தைப் பயன்படுத்தலாம்.

source: QV is defined in terms of heavy-outputs of a distribution. Heavy-outputs are those bit-strings that are those that have probabilities above the median value of the distribution. Below we define the projection operator onto the set of bit-strings that are heavy-outputs for a given distribution.
es_un: QV se define en términos de salidas pesadas de una distribución. Las salidas pesadas son aquellas cadenas de bits que tienen probabilidades por encima del valor medio de la distribución. A continuación, definimos el operador de proyección en el conjunto de cadenas de bits que son salidas pesadas para una distribución dada.
ja_jp: QVは、分布のヘビー・アウトプットの観点から定義されます。 ヘビー・アウトプットとは、分布の中央値を超える確率を持つビット列のことです。 以下では、特定の分布のヘビー・アウトプットであるビット列のセットへの射影演算子を定義します。
ko_kr: QV는 확률분포의 헤비-아웃풋으로 정의할 수 있다. 헤비-아웃풋은 분포의 중간값 이상의 확률을 갖는 것들에 대한 비트열이다. 아래에서는 확률 분포에 대한 헤비-아웃풋인 비트열 셋으로 투영 연산자를 정의한다.
ta_in: QV என்பது ஒரு விநியோகத்தின் கனமான வெளியீடுகளின் அடிப்படையில் வரையறுக்கப்படுகிறது. ஹெவி-அவுட்புட்கள் என்பது பிட்-ஸ்ட்ரிங்ஸ் ஆகும், அவை விநியோகத்தின் சராசரி மதிப்பிற்கு மேல் நிகழ்தகவுகளைக் கொண்டவை. கொடுக்கப்பட்ட விநியோகத்திற்கான கனமான வெளியீடுகளான பிட்-சரங்களின் தொகுப்பில் ப்ரொஜெக்ஷன் ஆபரேட்டரை கீழே வரையறுக்கிறோம்.

source: Now we generate 10 QV circuits as our dataset.
es_un: Ahora generamos 10 circuitos QV como nuestro conjunto de datos.
ja_jp: 現在は 10 個の QV 回路をデータセットとして生成します。
ko_kr: 데이터셋으로 10 QV 회로를 만든다.
pt_un: Agora geramos 10 circuitos QV como nosso conjunto de dados.
ta_in: இப்போது நாம் 10 QV சர்க்யூட்களை எங்கள் தரவுத்தொகுப்பாக உருவாக்குகிறோம்.

source: Next, we have to determine the heavy-set of each circuit from the ideal answer, and then pass this along to our heavy-set projector function that we defined above.
es_un: A continuación, tenemos que determinar el conjunto pesado de cada circuito a partir de la respuesta ideal, y luego pasar esto a nuestra función de proyector de conjunto pesado que definimos anteriormente.
ja_jp: 次に、理想的な答えから各回路のヘビー・セットを決定し、これを上記で定義したヘビー・セットの射影関数に渡す必要があります。
ko_kr: 다음으로 이상적인 정답에서 각 회로의 헤비-셋(heavy-set) 을 결정 하고, 이를 위에 정의한 헤비-셋(heavy-set) 투영자 함수에 전달한다.
pt_un: Em seguida, temos que determinar o heavy-set de cada circuito a partir da resposta ideal e, em seguida, passar isso para nossa função de projetor heavy-set que definimos acima.
ta_in: அடுத்து, ஒவ்வொரு சர்க்யூட்டின் ஹெவி-செட்டையும் சிறந்த பதிலிலிருந்து தீர்மானிக்க வேண்டும், பின்னர் இதை நாம் மேலே வரையறுத்த ஹெவி-செட் புரொஜெக்டர் செயல்பாட்டிற்கு அனுப்ப வேண்டும்.

source: QV circuits have no measurements on them so need to add them:
es_un: Los circuitos QV no tienen mediciones, por lo que es necesario agregarlas:
ja_jp: QV 回路には、それらを追加する必要があるため、それらについての測定が必要ありません。
ko_kr: QV 회로에 측정을 추가한다.
ta_in: QV சுற்றுகளில் அளவீடுகள் இல்லை, எனவே அவற்றைச் சேர்க்க வேண்டும்:

source: With a list of circuits and projection operators we now need only to pass both sets to our above expectation value runner targeting the desired backend. We will also set the best transpiler arguments to give us a sporting chance of getting some passing scores.
es_un: Con una lista de circuitos y operadores de proyección, ahora solo necesitamos pasar ambos conjuntos a nuestro ejecutador anterior de valor esperado que apunta al backend deseado. También estableceremos los mejores argumentos del transpilador para darnos una gran oportunidad de obtener algunos puntajes de aprobación.
ja_jp: 回路と射影演算子のリストを使用して、目的のバックエンドをターゲットとする上記の期待値ランナーに両方のセットを渡すだけで済みます。 また、いくつかの合格点を獲得するスポーツのチャンスを与えるために、最高のトランスパイラーの議論を設定します。
ko_kr: 백엔드를 대상으로 하는 기댓값 실행자에 리스트 자료형 회로와 투영 연산자를 전달해야 한다. 또한 통과 점수를 얻을 가능성이 높은 최적의 트랜스파일러 입력인수를 설정한다.
ta_in: சர்க்யூட்கள் மற்றும் ப்ரொஜெக்ஷன் ஆபரேட்டர்களின் பட்டியலுடன், இரண்டு செட்களையும் நாம் விரும்பிய பின்தளத்தை இலக்காகக் கொண்டு மேலே உள்ள எதிர்பார்ப்பு மதிப்பு ரன்னருக்கு அனுப்ப வேண்டும். சில தேர்ச்சி மதிப்பெண்களைப் பெறுவதற்கான விளையாட்டு வாய்ப்பை வழங்க சிறந்த டிரான்ஸ்பைலர் வாதங்களையும் அமைப்போம்.

source: A passing QV score is one where the value of the heavy-set projector is above :math:`2/3`. So let us see who passed:
es_un: Una puntuación QV aprobatoria es aquella en la que el valor del proyector pesado está por encima de :math:`2/3`. Así que veamos quién pasó:
ja_jp: 合格QVスコアは、ヘビーセットプロジェクターの値が :math:`2/3` を上回っているスコアです。 では、どれが合格したか見てみましょう。
ko_kr: 통과할 수 있는 QV 점수는 heavy-set 투영자 값이 :math:`2/3` 이상인 경우이다. 어떤 것이 통과했는지 살펴보자.
pt_un: Uma pontuação QV de aprovação é aquela em que o valor do projetor heavy-set está acima de :math:`2/3`. Então vamos ver quem passou:
ta_in: தேர்ச்சி QV ஸ்கோர் என்பது ஹெவி-செட் ப்ரொஜெக்டரின் மதிப்பு மேலே இருந்தால் :math:`2/3`. எனவே யார் தேர்ச்சி பெற்றனர் என்று பார்ப்போம்:
