Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/sample_expval_program/qiskit_runtime_expval_program.po
Languages: es_un, ja_jp, ko_kr, pt_un, ta_in

source: This page was generated from `docs/tutorials/sample_expval_program/qiskit_runtime_expval_program.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/sample_expval_program/qiskit_runtime_expval_program.ipynb`__.
ja_jp: このページは、 `docs/tutorials/sample_expval_program/qiskit_runtime_expval_program.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/sample_vqe_program/qiskit_runtime_vqe_program.ipynb`__에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/sample_expval_program/qiskit_runtime_expval_program.ipynb`__.
ta_in: இந்தப் பக்கம் இதிலிருந்து உருவாக்கப்பட்டது `docs/tutorials/sample_expval_program/qiskit_runtime_expval_program.ipynb`__.

source: Custom Expectation Value Program for the Qiskit Runtime
es_un: Programa de Valor Esperado Personalizado para Qiskit Runtime
ja_jp: Qiskit Runtime のカスタム期待値プログラム
ko_kr: Qiskit Runtime용 사용자 정의 기댓값 프로그래밍
pt_un: Programa de valor esperado personalizado para o Qiskit Runtime
ta_in: Qiskit இயக்க நேரத்திற்கான விருப்ப எதிர்பார்ப்பு மதிப்பு திட்டம்

source: Paul Nation
ja_jp: ポール・ネーション(Paul Nation)
ta_in: பால் நேஷன்

source: IBM Quantum Partners Technical Enablement Team
es_un: Equipo de Habilitación Técnica de IBM Quantum Partners
ja_jp: IBM Quantum Partners テクニカル・イネーブルメント・チーム
ko_kr: IBM Quantum 파트너 기술 지원 팀
pt_un: IBM Quantum Partners Technical Enablement Team (Equipe de capacitação técnica do IBM Quantum Partners)
ta_in: IBM குவாண்டம் கூட்டாளர்களின் தொழில்நுட்ப செயலாக்கக் குழு

source: Here we will show how to make a program that takes a circuit, or list of circuits, and computes the expectation values of one or more diagonal operators.
es_un: Aquí vamos a mostrar cómo hacer un programa que toma un circuito, o lista de circuitos, y calcula los valores esperados de uno o más operadores diagonales.
ja_jp: ここでは、回路または回路のリストを取得し、1つ以上の対角演算子の期待値を計算するプログラムを作成する方法を示します。
ko_kr: 이 문서에서는 하나 이상의 회로를 구성하고 대각 연산자의 기댓값을 계산하는 방법을 설명한다.
pt_un: Aqui vamos mostrar como fazer um programa que pega um circuito, ou lista de circuitos, e calcula os valores esperados de um ou mais operadores diagonais.
ta_in: ஒரு சர்க்யூட் அல்லது சர்க்யூட்களின் பட்டியலை எடுத்து, ஒன்று அல்லது அதற்கு மேற்பட்ட மூலைவிட்ட ஆபரேட்டர்களின் எதிர்பார்ப்பு மதிப்புகளைக் கணக்கிடும் நிரலை எவ்வாறு உருவாக்குவது என்பதை இங்கே காண்போம்.

source: Prerequisites
es_un: Requisitos previos
ja_jp: 前提条件
ko_kr: 준비사항
pt_un: Pré-requisitos
ta_in: முன்நிபந்தனைகள்

source: You must have the latest Qiskit installed.
es_un: Debes tener instalado el último Qiskit.
ja_jp: 最新の Qiskit がインストールされている必要があります。
ko_kr: 최신 Qiskit이 설치되어 있어야 한다.
pt_un: O Qiskit mais recente instalado.
ta_in: நீங்கள் சமீபத்திய Qiskit நிறுவியிருக்க வேண்டும்.

source: You must have either an IBM Cloud or an IBM Quantum account that can access Qiskit Runtime.
es_un: Debes tener una cuenta de IBM Cloud o IBM Quantum que pueda acceder a Qiskit Runtime.
ja_jp: Qiskit Runtime にアクセスできる IBM クラウドまたは IBM Quantum アカウントのいずれかを持っている必要があります。
ko_kr: Qiskit Runtime을 사용할 수 있는 IBM Cloud 또는 IBM Quantum 계정
pt_un: Uma conta do IBM Cloud ou do IBM Quantum que possa acessar o Qiskit Runtime.
ta_in: Qiskit இயக்க நேரத்தை அணுகக்கூடிய IBM கிளவுட் அல்லது IBM குவாண்டம் கணக்கு உங்களிடம் இருக்க வேண்டும்.

source: Background
es_un: Antecedentes
ja_jp: 背景
ko_kr: 배경
pt_un: Experiência
ta_in: பின்னணி

source: The primary method by which information is obtained from quantum computers is via expectation values. Indeed, the samples that come from executing a quantum circuit multiple times, once converted to probabilities, can be viewed as just a finite sample approximation to the expectation value for the projection operators corresponding to each bitstring. More practically, many quantum algorithms require computing expectation values over Pauli operators, e.g. Variational Quantum Eigensolvers, and thus having a runtime program that computes these quantities is of fundamental importance. Here we look at one such example, where a user passes one or more circuits and expectation operators and gets back the computed expectation values, and possibly error bounds.
es_un: El método principal por el cual se obtiene información de las computadoras cuánticas es a través de valores esperados. De hecho, las muestras que provienen de ejecutar un circuito cuántico varias veces, una vez convertidas en probabilidades, pueden verse como una aproximación de muestra finita al valor esperado para los operadores de proyección correspondientes a cada cadena de bits. De manera más práctica, muchos algoritmos cuánticos requieren calcular los valores esperados sobre los operadores de Pauli, por ejemplo, Solucionadores Propios Cuánticos Variacionales y, por lo tanto, tener un programa runtime que calcule estas cantidades es de fundamental importancia. Aquí vemos uno de esos ejemplos, donde un usuario pasa uno o más circuitos y operadores esperanza y obtiene los valores esperados calculados y posiblemente los límites de error.
ja_jp: 量子コンピューターから情報を取得する主な方法は、期待値を使用することです。 実際、量子回路を複数回実行して得られたサンプルは、確率に変換されると、各ビットストリングに対応する射影演算子の期待値に対する有限のサンプル近似と見なすことができます。 より実際的には、多くの量子アルゴリズムは、パウリ演算子（変分量子固有ソルバー（Variational Quantum Eigensolvers）など）よりも期待値を計算する必要があるため、これらの量を計算するランタイム・プログラムを持つことが基本的に重要です。 ここでは、ユーザーが1つ以上の回路と期待値演算子を渡し、計算された期待値と、場合によってはエラー範囲を取得する、そのような例の1つを見ていきます。
ko_kr: 양자 컴퓨터에서 정보를 얻을 수 있는 주요 방법은 기댓값을 구하는 것이다. 양자 회로를 여러번 실행해서 얻은 결과를 확률로 변환하면, 각 비트열에 해당되는 사영 연산자의 기댓값에 대한 유한 근사치(finite sample approximation)로 고려할 수 있다. 실제로 변분화된 양자 고윳값 해석기(Variational Qunatum Eigensolvers)을 비롯한 많은 양자 알고리즘은 파울리 연산자에 대한 기댓값을 계산한다. 따라서 기댓값을 계산하는 런타임 프로그램을 만드는 것은 매우 중요하다.이 글에서는 회로와 기댓값 연산자를 전달하고, 가능한 오류 범위와 기대값 결과를 얻는 예를 살펴본다.
ta_in: குவாண்டம் கணினிகளில் இருந்து தகவல் பெறுவதற்கான முதன்மை முறை எதிர்பார்ப்பு மதிப்புகள் வழியாகும். உண்மையில், ஒரு குவாண்டம் சர்க்யூட்டை பலமுறை இயக்குவதன் மூலம் வரும் மாதிரிகள், ஒருமுறை நிகழ்தகவுகளாக மாற்றப்பட்டால், ஒவ்வொரு பிட்ஸ்ட்ரிங்கிற்கும் தொடர்புடைய ப்ரொஜெக்ஷன் ஆபரேட்டர்களுக்கான எதிர்பார்ப்பு மதிப்பின் வரையறுக்கப்பட்ட மாதிரி தோராயமாக மட்டுமே பார்க்க முடியும். மிகவும் நடைமுறையில், பல குவாண்டம் அல்காரிதம்களுக்கு பாலி ஆபரேட்டர்கள் மீது எதிர்பார்ப்பு மதிப்புகள் தேவை, எ.கா. மாறுபாடு குவாண்டம் ஈஜென்சோல்வர்ஸ், இதனால் இந்த அளவுகளைக் கணக்கிடும் இயக்க நேர நிரலைக் கொண்டிருப்பது அடிப்படை முக்கியத்துவம் வாய்ந்தது. ஒரு பயனர் ஒன்று அல்லது அதற்கு மேற்பட்ட சுற்றுகள் மற்றும் எதிர்பார்ப்பு ஆபரேட்டர்களைக் கடந்து, கணக்கிடப்பட்ட எதிர்பார்ப்பு மதிப்புகள் மற்றும் பிழை வரம்புகளை திரும்பப் பெறும்போது, அத்தகைய உதாரணத்தை இங்கே பார்க்கலாம்.

source: Expectation value of a diagonal operator
es_un: Valor esperado de un operador diagonal
ja_jp: 対角演算子の期待値
ko_kr: 대각 연산자의 기댓값
pt_un: Valor esperado de um operador diagonal
ta_in: மூலைவிட்ட ஆபரேட்டரின் எதிர்பார்ப்பு மதிப்பு

source: Consider a generic observable given by the tensor product of diagonal operators over :math:`N` qubits :math:`O = O_{N-1}\dots O_{0}` where the subscript indicates the qubit on which the operator acts. Then for a set of observed :math:`M` bitstrings :math:`\{b_{0}, \dots b_{M-1}\}`, where $M :nbsphinx-math:`\leq `2^N $, with corresponding approximate probabilities :math:`p_{m}` the expectation value is given by
es_un: Considera un observable genérico dado por el producto tensorial de operadores diagonales sobre :math:`N` qubits :math:`O = O_{N-1}\dots O_{0}` donde el subíndice indica el qubit sobre el que actúa el operador. Luego, para un conjunto de :math:`M` cadenas de bits observadas :math:`\{b_{0}, \dots b_{M-1}\}`, donde :math:`M \leq 2^N`, con las probabilidades aproximadas correspondientes :math:`p_{m}`, el valor esperado viene dado por
ja_jp: :math:`N` 個の量子ビット :math:`O = O_{N-1}\dots O_{0}` に対する対角演算子のテンソル積によって与えられる一般的な観測量について考えてみます。ここで $M :nbsphinx-math:`\leq `2^N $、下付き文字は、演算子が作用する量子ビットを示します。 次に、観測された :math:`M` ビット文字列 :math:`\{b_{0}, \dots b_{M-1}\}` のセットの場合、ここで、対応する近似確率 :math:`p_{m}` を持つ、期待値は次の式で与えられます。
ko_kr: :math:`N` 개의 큐비트 :math:`O = O_{N-1}\dots O_{0}` 로 이루어진 대각 연산자의 텐서곱에 대한 일반적인 관측 가능량(generic observable)을 다루고자 한다. 여기서 큐비트의 아래 첨자는 연산자가 적용되는 큐비트를 의미한다. $M :nbsphinx-math:`\leq `2^N $ 이고 근사 확률이 :math:`p_{m}`인 관측된 :math:`M` 비트열 :math:`\{b_{0}, \dots b_{M-1}\}`의 기대값은 다음과 같다.
pt_un: Considere um observável genérico dado pelo produto tensorial de operadores diagonais sobre :math:`N` qubits :math:`O = O_{N-1}\dots O_{0}` onde o subscrito indica o qubit no qual o operador atua . Então, para um conjunto de strings de bits :math:`M` observadas :math:`\{b_{0}, \dots b_{M-1}\}`, onde $M :nbsphinx-math:`\leq `2^ N $, com probabilidades aproximadas correspondentes :math:`p_{m}` o valor esperado é dado por
ta_in: மூலைவிட்ட ஆபரேட்டர்களின் டென்சர் ப்ராடக்டால் கொடுக்கப்பட்ட பொதுவான அவதானிப்பைக் கவனியுங்கள் :math:`N` க்யூபிட்கள் :math:`O = O_{N-1}\dots O_{0}` இதில் சப்ஸ்கிரிப்ட் ஆபரேட்டர் செயல்படும் க்யூபிட்டைக் குறிக்கிறது.பின்னர் கவனிக்கப்பட்ட :math:`M` பிட்ஸ்ட்ரிங்க்களுக்கு :math:`\{b_{0}, \dots b_{M-1}\}`, இங்கு $M :nbsphinx-math:`\leq `2^ N $, தொடர்புடைய தோராயமான நிகழ்தகவுகள் :math:`p_{m}` எதிர்பார்ப்பு மதிப்பு வழங்கப்பட்டுள்ளது

source: where :math:`O_{n}[b_{m}[N-n-1], b_{m}[N-n-1]]` is the diagonal element of :math:`O_{n}` specified by the :math:`N-n-1`\ th bit in bitstring :math:`b_{m}`. The reason for the complicated indexing in ``b_{m}`` is because Qiskit uses least-significant bit indexing where the zeroth element of the bit-strings is given by the right-most bit.
es_un: donde :math:`O_{n}[b_{m}[N-n-1], b_{m}[N-n-1]]` es el elemento diagonal de :math:`O_{n}` especificado por el bit :math:`N-n-1` en la cadena de bits :math:`b_{m}`. La razón de la indexación complicada en ``b_{m}`` se debe a que Qiskit usa la indexación de bits menos significativa donde el elemento cero de las cadenas de bits viene dado por el bit más a la derecha.
ja_jp: ここで、 :math:`O_{n}[b_{m}[N-n-1], b_{m}[N-n-1]]` はビット文字列 :math:`b_{m}` の :math:`N-n-1` 番目のビットで指定された :math:`O_{n}` の対角要素です。 ``b_{m}`` の複雑なインデックス付けの理由は、Qiskitが最下位ビットのインデックス付けを使用し、ビット文字列の0番目の要素が右端で指定されるためです。
ko_kr: 여기서 :math:`O_{n}[b_{m}[N-n-1], b_{m}[N-n-1]]` 은 비트열 :math:`b_{m}` 의 :math:`N-n-1`\ 번째 원소를 인덱스로 갖는 대각행렬 :math:`O_{n}` 의 원소이다. Qiskit에서는 0번째 비트를 비트열의 가장 오른쪽에 놓기 때문에 비트열 ``b_{m}`` 의 인덱싱이 복잡해졌다.
pt_un: onde :math:`O_{n}[b_{m}[N-n-1], b_{m}[N-n-1]]` é o elemento diagonal de :math:`O_{n}` especificado pelo :math:`N-n-1`\ º bit na cadeia de bits :math:`b_{m}`. A razão para a indexação complicada em ``b_{m}`` é porque o Qiskit usa indexação de bit menos significativo onde o elemento zero das cadeias de bits é dado pelo bit mais à direita.
ta_in: இங்கு :math:`O_{n}[b_{m}[N-n-1], b_{m}[N-n-1]]` என்பதால் குறிப்பிடப்பட்ட :math:`O_{n}` என்பதன் மூலைவிட்ட உறுப்பு ஆகும். :math:`N-n-1`\ பிட்ஸ்ட்ரிங்கில் வது பிட் :math:`b_{m}`. ``b_{m}`` இல் சிக்கலான அட்டவணைப்படுத்தலுக்கான காரணம், Qiskit பிட்-ஸ்ட்ரிங்ஸின் பூஜ்ஜிய உறுப்பு வலது-அதிக பிட்டால் கொடுக்கப்பட்ட குறைந்த-குறிப்பிடத்தக்க பிட் அட்டவணையைப் பயன்படுத்துவதால் ஆகும்.

source: Here we will use built-in routines to compute these expectation values. However, it is not hard to do yourself, with plenty of examples to be found.
es_un: Aquí usaremos rutinas integradas para calcular estos valores esperados. Sin embargo, no es difícil hacerlo por ti mismo, con muchos ejemplos por encontrar.
ja_jp: ここでは、これらの期待値を計算するために組み込みルーチンを使用します。 しかし、あなた自身をで計算を行うことは難しいことではありませんし、例題もたくさんあります。
ko_kr: 이 글에서는 내장 루틴을 사용해서 기댓값을 계산한다. 다양한 예제를 스스로 해보는 것은 어렵지 않을것이다.
pt_un: Aqui usaremos rotinas internas para calcular esses valores esperados. No entanto, não é difícil fazer você mesmo, com muitos exemplos a serem encontrados.
ta_in: இந்த எதிர்பார்ப்பு மதிப்புகளைக் கணக்கிட, உள்ளமைக்கப்பட்ட நடைமுறைகளைப் பயன்படுத்துவோம். இருப்பினும், அதை நீங்களே செய்வது கடினம் அல்ல, நிறைய எடுத்துக்காட்டுகள் உள்ளன.

source: Main program
es_un: Programa principal
ja_jp: メイン・プログラム
ko_kr: 메인 프로그램
pt_un: Programa principal
ta_in: முக்கிய நிரல்

source: Here we define our main function for the expectation value runtime program. As always, our program must start with the ``backend``, and ``user_messenger`` arguements, followed by the actual inputs we pass to the program. Here our options are quite simple:
es_un: Aquí definimos nuestra función principal para el programa runtime del valor esperado. Como siempre, nuestro programa debe comenzar con los argumentos ``backend`` y ``user_messenger``, seguidos de las entradas reales que le pasamos al programa. Aquí nuestras opciones son bastante simples:
ja_jp: ここでは、期待値ランタイムプログラムのメイン関数を定義します。 私たちのプログラムはいつものように、 ``backend`` と ``user_messenger`` 引数から始め、プログラムに渡す実際の入力が続きます。 ここで私たちのオプションは非常に簡単です:
ko_kr: 기댓값 런타임 프로그램의 메인 함수를 정의한다. 항상 그렇듯 프로그램은 입력인수(arguments) backend 와 user_messenger 로 시작해야 하고, 그 다음에는 프로그램에 전달하는 실제 입력인수가 있어야 한다. 그러한 입력인수들은 다음과 같이 매우 간단하다.
pt_un: Aqui definimos nossa função principal para o programa de tempo de execução do valor esperado. Como sempre, nosso programa deve começar com os argumentos ``backend`` e ``user_messenger``, seguidos pelas entradas reais que passamos para o programa. Aqui nossas opções são bem simples:
ta_in: எதிர்பார்ப்பு மதிப்பு இயக்க நேர நிரலுக்கான எங்கள் முக்கிய செயல்பாட்டை இங்கே வரையறுக்கிறோம். எப்பொழுதும் போல, எங்கள் நிரல் ``பேக்கெண்ட்`` மற்றும் ``பயனர்_மெசஞ்சர்`` வாதங்களுடன் தொடங்க வேண்டும், அதைத் தொடர்ந்து நிரலுக்கு நாம் அனுப்பும் உண்மையான உள்ளீடுகள். இங்கே எங்கள் விருப்பங்கள் மிகவும் எளிமையானவை:

source: ``circuits``: A single QuantumCircuit or list of QuantumCircuits to be executed on the target backend.
es_un: ``circuits``: Un solo QuantumCircuit o una lista de QuantumCircuits que se ejecutarán en el backend de destino.
ja_jp: ``circuit``: ターゲットバックエンドで実行される QuantumCircuit または QuantumCircuit のリスト。
ko_kr: ``circuits``: 대상 백엔드에서 실행되는 QuantumCircuit 또는 리스트 자료형 QuantumCircuit.
pt_un: ``circuits``: Um único QuantumCircuit ou lista de QuantumCircuits a serem executados no backend de destino.
ta_in: ``சுற்றுகள்``: இலக்கு பின்தளத்தில் செயல்படுத்தப்பட வேண்டிய ஒற்றை குவாண்டம் சர்க்யூட் அல்லது குவாண்டம் சர்க்யூட்களின் பட்டியல்.

source: ``expectation_operators``: The operators we want to evaluate. These can be strings of diagonal Pauli’s, eg, ``ZIZZ``, or custom operators defined by dictionaries. For example, the projection operator on the all ones state of 4 qubits is ``{'1111': 1}``.
es_un: ``expectation_operators``: Los operadores que queremos evaluar. Estos pueden ser cadenas de Pauli diagonales, por ejemplo, ``ZIZZ``, u operadores personalizados definidos con diccionarios. Por ejemplo, el operador de proyección en el estado de todos unos de 4 qubits es ``{'1111': 1}``.
ja_jp: ``expectation_operators``: 評価したい演算子。これらは対角線のパウリの文字列、例えば ``ZIZZ`` や辞書で定義されたカスタム演算子になります。 例えば、4量子ビットの全ての1の状態に対する射影演算子は ``{'1111': 1} `` です。
ko_kr: ``expectation_operators``: 계산용 연산자. 이는 대각 파울리 문자열이며, ``ZIZZ`` 또는 딕셔너리 자료형으로 설정한 사용자 정의 연산자 등이 포함된다. 예를 들어, 큐비트 4개가 모두 1인 상태의 투영(projection) 연산자는 ``{'1111': 1}`` 이다.
pt_un: ``expectation_operators``: Os operadores que queremos avaliar. Estes podem ser strings de Pauli diagonais, por exemplo, ``ZIZZ``, ou operadores personalizados definidos por dicionários. Por exemplo, o operador de projeção no estado de todos os 4 qubits é ``{'1111': 1}``.
ta_in: ``எதிர்பார்ப்பு_ஆப்பரேட்டர்கள்``: நாங்கள் மதிப்பிட விரும்பும் ஆபரேட்டர்கள். இவை மூலைவிட்ட பாலியின் சரங்களாக இருக்கலாம், எ. கா. ``ZIZZ`` அல்லது அகராதிகளால் வரையறுக்கப்பட்ட தனிப்பயன் ஆபரேட்டர்கள். எடுத்துக்காட்டாக, 4 க்யூபிட்களின் அனைத்து நிலைகளிலும் ப்ரொஜெக்ஷன் ஆபரேட்டர் ``{'1111': 1}`` ஆகும்.

source: ``shots``: How many times to sample each circuit.
es_un: ``shots``: Cuántas veces muestrear cada circuito.
ja_jp: ``shots``: 各回路をサンプリングする回数。
ko_kr: ``shots``: 양자회로를 몇 번 실행할 것인지 설정.
pt_un: ``shots``: Quantas vezes amostrar cada circuito.
ta_in: ``ஷாட்ஸ்``: ஒவ்வொரு சுற்றுக்கும் எத்தனை முறை மாதிரி செய்ய வேண்டும்.

source: ``transpiler_config``: A dictionary that passes additional arguments on to the transpile function, eg. ``optimization_level``.
es_un: ``transpiler_config``: Un diccionario que pasa argumentos adicionales a la función de transpilación, por ejemplo ``optimization_level``.
ja_jp: ``transpiler_config``: トランスパイル関数に追加の引数を渡す辞書。例: ``optimization_level`` 。
ko_kr: ``transpiler_config``: 트랜스파일(transpile) 함수로 추가 인수를 전달하는 딕셔너리 자료형. 예) optimization_level.
pt_un: ``transpiler_config``: Um dicionário que passa argumentos adicionais para a função transpile, por exemplo. ``optimization_level``.
ta_in: ``டிரான்ஸ்பைலர்_கட்டமைப்பு``: டிரான்ஸ்பைல் செயல்பாட்டிற்கு கூடுதல் வாதங்களை அனுப்பும் அகராதி, எ. கா. ``உகப்பாக்க_நிலை``.

source: ``run_config``: A dictionary that passes additional arguments on to ``backend.run()``.
es_un: ``run_config``: Un diccionario que pasa argumentos adicionales a ``backend.run()``.
ja_jp: ``run_config``: ``backend.run()`` に追加の引数を渡す辞書。
ko_kr: ``run_config``: ``backend.run()`` 로 추가 인수를 전달하는 딕셔너리 자료형.
pt_un: ``run_config``: Um dicionário que passa argumentos adicionais para ``backend.run()``.
ta_in: ``ரன்_கட்டமைப்பு``: ``பின்தளம்.ரன்()`` இல் கூடுதல் வாதங்களை அனுப்பும் அகராதி.

source: ``skip_transpilation``: A flag to skip transpilation altogether and just run the circuits. This is useful for situations where you need to transpile parameterized circuits once, but must bind parameters multiple times and evaluate.
es_un: ``skip_transpilation``: Una bandera para omitir la transpilación por completo y simplemente ejecutar los circuitos. Esto es útil para situaciones en las que necesitas transpilar circuitos parametrizados una vez, pero se deben vincular parámetros varias veces y evaluar.
ja_jp: ``skip_transpilation``: トランスパイルを完全にスキップし、回路を実行するフラグ。 これは、パラメータ回路を一度トランスパイルする必要がある場合に便利ですが、パラメータを複数回バインドして評価する必要があります。
ko_kr: ``skip_transpilation``: 트랜스파일레이션(transpilation) 을 하지 않고 회로만 실행하는 이진 변수이다. 매개변수를 갖는 회로를 한번 트랜스파일 해야 하지만, 매개변수를 변경 하면서 회로를 여러번 실행하는 경우에 유용하다.
pt_un: ``skip_transpilation``: Um sinalizador para pular a transpilação completamente e apenas executar os circuitos. Isso é útil para situações em que você precisa transpilar circuitos parametrizados uma vez, mas deve vincular parâmetros várias vezes e avaliar.
ta_in: ``டிரான்ஸ்பிலேஷன்_தவிர்``: டிரான்ஸ்பிலேஷனை முழுவதுமாகத் தவிர்த்துவிட்டு சுற்றுகளை இயக்குவதற்கான கொடி. நீங்கள் ஒரு முறை அளவுருக் கொண்ட சுற்றுகளை டிரான்ஸ்பைல் செய்ய வேண்டிய சூழ்நிலைகளுக்கு இது பயனுள்ளதாக இருக்கும், ஆனால் அளவுருக்களை பல முறை பிணைத்து மதிப்பீடு செய்ய வேண்டும்.

source: ``return_stddev``: Flag to return bound on standard deviation. If using measurement mitigation this adds some overhead to the computation.
es_un: ``return_stddev``: Bandera para devolver el límite de la desviación estándar. Si usas la mitigación de medición, esto agrega algo de sobrecarga al cálculo.
ja_jp: ``return_stddev``: 標準偏差でバインドされるフラグ。測定軽減を使用すると、計算にオーバーヘッドが加わります。
ko_kr: ``return_stddev``: 표준편차의 경계(bound) 를 반환하는 이진변수이다. 측정 완화(measurement mitigation) 를 사용하면 계산이 조금 더 복잡해진다.
pt_un: ``return_stddev``: Sinalizador para retornar o limite no desvio padrão. Se estiver usando mitigação de medida, isso adiciona um overhead ao cálculo.
ta_in: ``return_stddev``: நிலையான விலகலில் திரும்புவதற்குக் கொடி. அளவீட்டுத் தணிப்பைப் பயன்படுத்தினால், இது கணக்கீட்டில் சில மேல்நிலைகளைச் சேர்க்கிறது.

source: ``use_measurement_mitigation``: Use M3 measurement mitigation and compute expectation value and standard deviation bound from quasi-probabilities.
es_un: ``use_measurement_mitigation``: Usar la mitigación de medición M3 y calcular el valor esperado y el límite de desviación estándar de las cuasi probabilidades.
ja_jp: ``use_measurement_mitigation``: M3 測定の軽減と期待値の計算、および準確率からの標準偏差を使用します。
ko_kr: ``use_measurement_mitigation``: M3 측정 완화를 사용하고 기댓값과 준-확률(quasi-probabilities) 로 부터 표준편차의 경계를 계산한다.
ta_in: ``use_measurement_mitigation``: M3 அளவீட்டுத் தணிப்பைப் பயன்படுத்தவும் மற்றும் எதிர்பார்ப்பு மதிப்பு மற்றும் அரை-நிகழ்தகவுகளிலிருந்து பிணைக்கப்பட்ட நிலையான விலகலைக் கணக்கிடவும்.

source: At the top of the cell below you will see a commented out ``%%writefile sample_expval.py``. We will use this to convert the cell to a Python module named ``sample_expval.py`` to upload.
es_un: En la parte superior de la celda a continuación, verás un ``%%writefile sample_expval.py`` comentado. Usaremos esto para convertir la celda en un módulo de Python llamado ``sample_expval.py`` para cargar.
ja_jp: 下のセルの上部には、 ``%%writefile sample_expval.py`` というコメントが表示されています。 これを使用して、セルを ``sample_expval.py`` という名前の Python モジュールに変換し、アップロードします。
ko_kr: 아래 셀의 상단에 주석처리된 ``%%writefile sample_expval.py`` 가 있다.이것을 사용해서 해당 셀을 이름이 ``sample_expval.py`` 인 파이썬 모듈로 변환하여 업로드에 활용할 수 있다.
pt_un: No topo da célula abaixo você verá um ``%%writefile sample_expval.py`` comentado. Usaremos isso para converter a célula em um módulo Python chamado ``sample_expval.py`` para fazer o upload.
ta_in: கீழே உள்ள கலத்தின் மேற்பகுதியில் நீங்கள் கருத்து வெளியிடப்பட்ட ``%%writefile sample_expval.py`` ஐக் காண்பீர்கள். பதிவேற்ற, ``sample_expval.py`` என்ற பைதான் தொகுதிக்குக் கலத்தை மாற்ற இதைப் பயன்படுத்துவோம்.

source: Local testing
es_un: Pruebas locales
ja_jp: ローカル・テスト
ko_kr: 개인 컴퓨터(local) 실험
pt_un: Testando localmente
ta_in: உள்ளூர் சோதனை

source: Here we test with a local “Fake” backend that mimics the noise properties of a real system and a 4-qubit GHZ state.
es_un: Aquí probamos con un backend local “Falso” que imita las propiedades de ruido de un sistema real y un estado GHZ de 4 qubits.
ja_jp: ここでは、実際のシステムのノイズ特性を模倣したローカル「Fake」のバックエンドと 4 量子ビット GHZ の状態を用いてテストします。
ko_kr: 개인 컴퓨터에서 실제 시스템의 잡음 특성과 4 큐비트 GHZ 상태를 모방하는 모의 백엔드를 테스트할 것이다.
pt_un: Aqui testamos com um backend local “Fake” que imita as propriedades de ruído de um sistema real e um estado GHZ de 4 qubits.
ta_in: உண்மையான முறை மற்றும் 4-க்யூபிட் GHZ நிலையின் இரைச்சல் பண்புகளைப் பிரதிபலிக்கும் உள்ளூர் "போலி" பின்தளத்தில் இங்கே சோதனை செய்கிறோம்.

source: If we have done our job correctly, the above should print out two expectation values close to one and a final expectation value close to zero.
es_un: Si hemos hecho nuestro trabajo correctamente, lo anterior debería imprimir dos valores esperados cercanos a uno y un valor esperado final cercano a cero.
ja_jp: 私たちが正しく仕事をしていれば、上記は 1に近い2つの期待値と 0に近い最終期待値を出力するはずです。
ko_kr: 작업이 제대로 끝났다면, 1에 가까운 두 개의 기댓값과 0에 가까운 최종 기대값을 출력한다.
pt_un: Se tivermos feito nosso trabalho corretamente, o acima deve imprimir dois valores esperados próximos a um e um valor esperado final próximo a zero.
ta_in: நாம் நமது வேலையைச் சரியாகச் செய்திருந்தால், மேலே உள்ளவை இரண்டு எதிர்பார்ப்பு மதிப்புகளை ஒன்றுக்கு அருகில் அச்சிட வேண்டும் மற்றும் இறுதி எதிர்பார்ப்பு மதிப்பு பூஜ்ஜியத்திற்கு அருகில் இருக்கும்.

source: Program metadata
es_un: Metadatos del programa
ja_jp: プログラム・メタデータ
ko_kr: 프로그램 메타데이터
pt_un: Metadados do programa
ta_in: நிரல் மெட்டாடேட்டா

source: Next we add the needed program data to a dictionary for uploading with our program.
es_un: A continuación, agregamos los datos de programa necesarios a un diccionario para cargarlos con nuestro programa.
ja_jp: 次に、プログラムでアップロードするために必要なプログラム・データを辞書に追加します。
ko_kr: 다음으로, 프로그램을 업로드하기 위해 필요한 프로그램 데이터를 dictionary 자료형에 추가한다.
pt_un: Em seguida, adicionamos os dados do programa necessários a um dicionário para upload com nosso programa.
ta_in: அடுத்து நமது நிரலுடன் பதிவேற்றுவதற்கு தேவையான நிரல் தரவை அகராதியில் சேர்க்கிறோம்.

source: Upload the program
es_un: Cagar el programa
ja_jp: プログラムのアップロード
ko_kr: 프로그램 업로드
pt_un: Fazendo o upload do programa
ta_in: நிரலைப் பதிவேற்றவும்
