Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/finance/02_portfolio_diversification.po
Languages: es_un, id_id, ja_jp, ko_kr, pt_br, ta_in

source: This page was generated from `tutorials/finance/02_portfolio_diversification.ipynb`__.
es_un: Esta página fue generada a partir de `tutorials/finance/02_portfolio_diversification.ipynb`__.
id_id: Halaman ini dibuat dari `tutorials/finance/02_portfolio_diversification.ipynb`__.
ja_jp: 当ページは、 `tutorials/finance/02_portfolio_diversification.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/finance/02_portfolio_diversification.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada a partir de `tutorials/finance/02_portfolio_diversification.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/finance/01_portfolio_optimization.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/02_portfolio_diversification.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/02_portfolio_diversification.ipynb>`_.
id_id: Jalankan secara interaktif di `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/02_portfolio_diversification.ipynb>`_.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/02_portfolio_diversification.ipynb>`_ でインタラクティブに実行します。
ko_kr: `IBM 퀀텀 랩 <https://quantum-computing.ibm.com/jupyter/tutorial/finance/02_portfolio_diversification.ipynb>`_ 에서 대화식으로 실행하십시오.
ta_in: `IBM Quantum` ஆய்வகத்தில் ஊடாடும் வகையில் இயக்கவும். `<https://quantum-computing.ibm.com/jupyter/tutorial/finance/01_portfolio_optimization.ipynb>`_.

source: *Portfolio Diversification*
es_un: *Diversificación de Cartera*
id_id: *Diversifikasi Portofolio*
ja_jp: *ポートフォリオによる分散投資*
ko_kr: *포트폴리오 다양화*
ta_in: போர்ட்ஃபோலியோ உகப்பாக்கம்

source: Introduction
es_un: Introducción
id_id: Pendahuluan
ja_jp: はじめに
ko_kr: 소개
pt_br: Introdução
ta_in: அறிமுகம்

source: In asset management, there are broadly two approaches: active and passive investment management. Within passive investment management, there are index-tracking funds and there are approaches based on portfolio diversification, which aim at representing a portfolio with a large number of assets by a smaller number of representative stocks. This notebook illustrates a portfolio diversification problem, which has recently become popular for two reasons: 1. it makes it possible to mimic the performance of an index (or a similarly large set of assets) with a limited budget, at limited transaction costs. That is: traditional index-tracking may purchase all assets in the index, ideally with the same weights as in the index. This may be impractical for a number of reasons: the total of even a single round lot per asset may amount to more than the assets under management, the large scale of the index-tracking problem with integrality constraints may render the optimization problem difficult, and the transaction costs of the frequent rebalancing to adjust the positions to the weights in the index may render the approach expensive. Thus, a popular approach is to select a portfolio of :math:`q` assets that represent the market with :math:`n` assets, where :math:`q` is significantly smaller than :math:`n`, but where the portfolio replicates the behavior of the underlying market. To determine how to group assets into :math:`q` clusters and how to determine which :math:`q` assets should represent the :math:`q` clusters amounts to solving a large-scale optimization problem. In the following we describe the mathematical model for the portfolio diversification problem as introduced in [Cornuejols & Tutuncu, 2006] 2. it allows for similarity measures between time-series beyond the covariance matrix. Notice that traditionally, modern portfolio theory considers the covariance matrix as a measure of similarity between the assets. As such, however, the covariance matrix is imperfect. Consider, for instance, a company listed both in London and New York. Although both listings should be very similar, only parts of the time series of the prices of the two listings will overlap, because of the partial overlap of the times the markets open. Instead of covariance, one can consider, for example, dynamic time warping of [Berndt and Clifford, 1994] as a measure of similarity between two time series, which allows for the fact that for some time periods, the data are captured by only one of the time series, while for others, both time series exhibit the similarity due to the parallel evolution of the stock price.
es_un: En la gestión de activos, en general existen dos tipos de enfoque: gestión de inversiones activa y pasiva. Dentro de la gestión de inversión pasiva, existen fondos indexados y existen enfoques basados ​​en la diversificación de la cartera, que tienen como objetivo representar una cartera con un alto número de activos mediante un menor número de acciones representativas. Este cuaderno ilustra un problema de diversificación de la cartera, que recientemente se ha popularizado por dos razones: 1. hace posible imitar el rendimiento de un índice (o un conjunto de activos igualmente grande) con un presupuesto limitado, con costos de transacción limitados. Es decir: el seguimiento de índices tradicional puede comprar todos los activos del índice, idealmente con las mismas ponderaciones que en el índice. Esto puede resultar impráctico por varias razones: el total de incluso un solo lote de ronda por activo puede ascender a más que los activos bajo gestión, la gran escala del problema de seguimiento de índices con restricciones de integralidad puede dificultar el problema de optimización, y Los costos de transacción del reequilibrio frecuente para ajustar las posiciones a las ponderaciones del índice pueden hacer que el enfoque sea costoso. Por lo tanto, un enfoque popular es seleccionar una cartera de :math:`q` activos que representen el mercado con :math:`n` activos, donde :math:`q` es significativamente menor que :math:`n`, pero donde la cartera replica el comportamiento del mercado subyacente. Determinar cómo agrupar los activos en grupos :math:`q` y cómo determinar cuáles activos :math:`q` deben representar los grupos :math:`q` es equivale a resolver un problema de optimización a gran escala. A continuación, describimos el modelo matemático para el problema de la diversificación de la cartera tal como se introdujo en [Cornuejols & Tutuncu, 2006] 2. permite medidas de similitud entre series de tiempo más allá de la matriz de covarianza. Nota que, tradicionalmente, la teoría moderna de carteras considera la matriz de covarianza como una medida de similitud entre los activos. Sin embargo, como tal, la matriz de covarianza es imperfecta. Considere, por ejemplo, una empresa que cotiza tanto en Londres como en Nueva York. Aunque ambos listados deberían ser muy similares, solo se superpondrán partes de la serie de tiempo de los precios de ambos listados, por la parcial coincidencia de tiempos en los que ambos mercados están abiertos. En lugar de la covarianza, se puede considerar, por ejemplo, la deformación dinámica del tiempo de [Berndt & Clifford, 1994] como una medida de similitud entre las dos series de tiempo, lo que permite tomar en cuenta el hecho de que durante algunos períodos de tiempo, los datos son capturados por solo una de las series de tiempo, mientras que para otras, ambas series de tiempo exhiben similitud debido a la evolución paralela del precio de la acción.
id_id: Pada manajemen aset, secara garis besar ada dua pendekatan: manajemen investasi aktif dan pasif. Di dalam manajemen investasi pasif, ada proses mengikuti (tracking) indeks dan terdapat beberapa pendekatan berdasarkan diversifikasi portofolio, yang bertujuan untuk merepresentasikan suatu portofolio dengan jumlah aset yang besar lewat beberapa saham dalam jumlah yang lebih kecil. Notebook ini menggambarkan sebuah permasalahan diversifikasi portofolio, yang dewasa ini menjadi populer akibat dua alasan: 1. dengan hal ini, kita dapat membuat tiruan performa sebuah indeks (atau sebuah kumpulan aset besar yang serupa) dengan budget terbatas, dan dengan biaya transaksi yang terbatas. Yaitu: mengikuti (tracking) indeks secara tradisional dapat membeli seluruh aset pada indeks, yang idealnya dengan berat yang sama seperti yang terdapat pada indeks. Hal ini dapat menjadi tidak praktis karena beberapa alasan: total dari hanya satu lot bulat per aset bisa saja bernilai lebih dari nilai aset yang dikelola, permasalahan yang besar dalam mengikuti indeks dengan batasan integrality dapat menyebabkan kesulitan dalam kasus optimisasi, dan biaya transaksi berulang dari seringnya melakukan penyeimbangan ulang untuk mengatur posisi berat pada indeks dapat menyebabkan mahalnya pendekatan ini. Maka dari itu, pendekatan yang populer adalah dengan memilih sebuah portofolio dengan aset :math:`q` yang merepresentasikan market dengan aset :math:`n`, dengan nilai :math:`q` jauh lebih kecil dibandingkan nilai :math:`n`, namun kondisinya adalah portofolio meniru perilaku dari market yang mendasarinya. Untuk menentukan bagaimana cara mengelompokkan aset menjadi sejumlah kluster :math:`q` dan bagaimana menentukan aset :math:`q` yang mana yang dapat merepresentasikan kluster :math:`q`, berujung pada sebuah permasalahan optimisasi skala besar. Pada bagian selanjutnya, kami akan menjelaskan model matematis untuk kasus diversifikasi portofolio seperti yang diperkenalkan di [Cornuejols & Tutuncu, 2006] 2. hal ini dapat menunjukkan ukuran kemiripan antara seri-waktu di luar matriks covariance. Perlu diperhatikan bahwa secara tradisional, teori portofolio modern menganggap matriks covariance sebagai ukuran kemiripan antaraset. Walaupun demikian, matriks covariance tidaklah sempurna. Sebagai contoh, bayangkan sebuah perusahaan yang terdaftar di London dan New York. Meskipun keduanya seharusnya sangat mirip, hanya beberapa bagian dari seri waktu dari harga kedua kondisi tersebut yang sama antara satu sama lain, karena hanya di sebagian waktu marketnya buka secara bersamaan. Alih-alih menggunakan covariance, kita dapat menggunakan, misalnya, dynamic time warping yang diusulkan oleh [Berndt dan Clifford, 1994] sebagai ukuran kemiripan antara dua seri waktu, yang membuka kemungkinan bahwa untuk suatu periode waktu tertentu, data yang terekam oleh satu seri waktu saja, sedangkan untuk periode lainnya, kedua seri waktu menunjukkan kemiripan akibat perubahan paralel dari harga saham.
ja_jp: アセットマネージメントには、大きく分けてアクティブ運用とパッシブ運用の２つのアプローチがあります。 パッシブ運用には、分散投資に基づくインデックスファンドがあり、アセット数の多いポートフォリオを、より少ない銘柄で代表することを目的としています。このノートブックでは、ポートフォリオの分散問題を解説しています。これは２つの理由から最近人気が出てきています。 1. 限られた予算と取引コストで、インデックス(または同様に大規模な資産集合)のパフォーマンスを再現することが可能。 従来のインデックストラッキングではインデックス内のすべての資産を、理想的にはインデックスと同じ重みで購入することになるかもしれませんが、これはいくつかの理由により実用的ではありません。資産ごとに１取引単位でも合計が管理下の資産よりも多額になる可能性があり、完全制約下の大規模インデックストラッキングは最適化問題が難しく、インデックスのボジション調整で頻繁にリバランスする取引コストがアプローチを高額にする、などということがあります。このため市場の :math:`n` 資産を代表する :math:`q` 資産のポートフォリオを選ぶには、ポートフォリオは市場の動きを再現していながら、:math:`q` が :math:`n` よりも大幅に小さいものを選ぶ、というアプローチが一般的です。資産を :math:`q` クラスターにグループ化する方法を決定することと、どの :math:`q` 資産を :math:`q` クラスターの代表に選ぶかを決定するには、最終的に大規模最適化問題を解くことになります。ここでは [Cornuejols & Tutuncu, 2006] で紹介されているポートフォリオの分散化問題について、数学的なモデルを説明します。 2. 共分散行列を超えた、時系列間の類似度の測定が可能。 伝統的に、現代ポートフォリオ理論では資産間の類似度としての共分散行列が考慮されていることに注意してください。しかしながら、そのような場合には共分散行列は不完全です。例えば、ロンドンとニューヨークの両方に上場している会社を考えてみましょう。両方の上場企業は非常に似ているはずですが、市場が開く時間が部分的に重なっているため、2つの上場企業の価格の時系列の一部だけが重なります。共分散の代わりに、2つの時系列間の類似性の尺度として、例えば [Berndt and Clifford, 1994] の動的時間伸縮法を考慮することができます。これによりある期間において、データは１つの時系列のみによって捕捉されるか、あるいは両方の時系列が株価の同時進行による類似性を示す、と考えることができます。
ko_kr: 자산 관리에서는 능동적이고 수동적인 투자 관리에 대한 두 가지 접근 방식이 있다. 소극적인 투자관리 분야에서는 인덱스추적 펀드가 있고 포트폴리오 다각화에 기반을 둔 접근방법이 있는데, 이는 많은 자산을 소수의 주식으로 포토폴리오를 만드는 것이 목적이다. 이 글에서는 최근 두 가지 이유로 유명해진 포트폴리오 다변화 문제를 설명한다: 1. 제한된 수수료와 제한된 예산으로 인덱스 (또는 유사한 대규모 자산 세트) 의 성능을 모방할 수 있다. 즉, 전통적인 인덱스 추적은 인덱스에 있는 모든 자산을 구매하며 이상적으로 인덱스에서와 동일한 가중치를 사용한다. 이것은 많은 이유로 불가능 하다: 자산 당 단일 라운드 로트의 총 수는 관리 하에 있는 자산보다 많은 양일 수 있고, 적분기 제약조건을 갖는 인덱스 추적 문제의 큰 스케일은 최적화 문제를 어렵게 할 수 있고, 인덱스 내의 가중치에 대한 위치를 조정하기 위해 빈번한 리밸런싱의 수수료는 비싸다. 따라서 :math:`n` 자산을 나타내는 :math:`q` 자산 포트폴리오를 선택하는 것이 일반적인 접근법이지만, :math:`q` 가 :math:`n` 보다 현저히 작지만, 포트폴리오가 기본 시장의 흐름을 따른다. :math:`q` 클러스터에 자산을 그룹화하는 방법 및 :math:`q` 자산이 :math:`q` 클러스터를 표시하는 방법을 판별하는 방법은 대규모 최적화 문제점을 해결하는 방법이다. 여기서 도입된 포트폴리오 다변화 문제에 대한 수학적 모델을 설명한다 [Cornuejols & Tutuncu, 2006]. 이것은 공분산 매트릭스를 넘어서 시계열 (time-series) 사이의 유사성 측정을 가능하게 한다. 전통적으로, 현대적인 포트폴리오 이론은 공분산 행렬을 자산 사이의 유사성 측정으로 간주한다. 그러나, 공분산 매트릭스는 불완전하다. 예를 들어 런던과 뉴욕에 모두 상장된 회사를 생각해 보라. 두 목록 모두 매우 유사해야 하지만, 시장이 열리는 시간의 부분적인 겹침 때문에 두 목록 가격의 시계열 부분만 겹칠 수 있습니다. 공분산 대신에, 예를 들어, 2개의 시계열 사이의 유사성 측정으로서, [Berndt and Clifford, 1994] 의 동적 시간 왜곡을 고려할 수 있는데, 이는 일정 기간 동안 데이터가 시계열 중 단지 하나에 의해 포착되는 반면, 다른 경우에는, 두 시계열이 모두 주가의 평행한 전개로 인해 유사성을 나타낸다.
pt_br: Na gestão de ativos, existem basicamente duas abordagens: gestão de investimentos ativa e passiva. Na gestão passiva de investimentos, existem fundos index-tracking e abordagens baseadas na diversificação de carteiras, que visam representar uma carteira com um grande número de ativos por um menor número de ações representativas. Este caderno ilustra um problema de diversificação de portfólio, que recentemente se tornou popular por dois motivos: 1. torna possível imitar o desempenho de um índice (ou um conjunto igualmente grande de ativos) com um orçamento limitado, com custos de transação limitados. Ou seja: o rastreamento de índice tradicional pode comprar todos os ativos do índice, de preferência com os mesmos pesos do índice. Isso pode ser impraticável por uma série de razões: o total de até mesmo um único lote por ativo pode equivaler a mais do que os ativos sob gestão, a grande escala do problema de rastreamento de índice com restrições de integralidade pode tornar o problema de otimização difícil e os custos de transação do rebalanceamento frequente para ajustar o posições para os pesos no índice podem tornar a abordagem cara. Assim, uma abordagem popular é selecionar um portfólio de :math:`q` ativos que representam o mercado com :math:`n` ativos, onde :math: `q` é significativamente menor que :math:`n`, mas onde a carteira replica o comportamento do mercado subjacente. Para determinar como agrupar ativos em clusters :math: `q` e como determinar quais ativos :math:`q` devem representar os clusters :math: `q` equivalem a resolver um problema de otimização em grande escala. A seguir, descrevemos o modelo matemático para o problema de diversificação de portfólio, conforme apresentado em [Cornuejols & Tutuncu, 2006] 2. ele permite medidas de similaridade entre séries temporais além da matriz de covariância. Observe que, tradicionalmente, a teoria de portfólio moderna considera a matriz de covariância como uma medida de similaridade entre os ativos. Como tal, no entanto, a matriz de covariância é imperfeita. Considere, por exemplo, uma empresa listada em Londres e Nova York. Embora ambas as listagens devam ser muito semelhantes, apenas partes da série temporal dos preços das duas listagens se sobreporão, devido à sobreposição parcial dos horários de abertura dos mercados. Em vez de covariância, pode-se considerar, por exemplo, a sincronização temporal dinâmica de [Berndt e Clifford, 1994] como uma medida de similaridade entre duas séries temporais, o que permite o fato de que, em alguns períodos de tempo, os dados são capturados por apenas um das séries temporais, enquanto para as demais, ambas as séries temporais apresentam a similaridade devido à evolução paralela do preço das ações.
ta_in: தரவுகள் நிர்வாகத்தில், பரவலாக இரண்டு அணுகுமுறைகள் உள்ளன: செயலில் மற்றும் செயலற்ற முதலீட்டு மேலாண்மை. செயலற்ற முதலீட்டு நிர்வாகத்திற்குள், indexed-கண்காணிப்பு நிதிகள் உள்ளன மற்றும் போர்ட்ஃபோலியோ பல்வகைப்படுத்தலின் அடிப்படையில் அணுகுமுறைகள் உள்ளன, அவை குறைந்த எண்ணிக்கையிலான பிரதிநிதித்துவ பங்குகளால் அதிக எண்ணிக்கையிலான சொத்துக்களைக் கொண்ட ஒரு போர்ட்ஃபோலியோவை பிரதிநிதித்துவப்படுத்துவதை நோக்கமாகக் கொண்டுள்ளன. இந்த நோட்புக் ஒரு போர்ட்ஃபோலியோ classification சிக்கலை விளக்குகிறது, இது சமீபத்தில் இரண்டு காரணங்களுக்காக பிரபலமாகிவிட்டது: 1. இது ஒரு வரையறுக்கப்பட்ட பட்ஜெட்டுடன், வரையறுக்கப்பட்ட பரிவர்த்தனை செலவில் ஒரு குறியீட்டின் (அல்லது இதேபோன்ற பெரிய சொத்துக்களின்) செயல்திறனைப் பிரதிபலிக்க உதவுகிறது. அதாவது: பாரம்பரிய குறியீட்டு-கண்காணிப்பு குறியீட்டில் உள்ள அனைத்து சொத்துக்களையும் வாங்கக்கூடும், குறியீட்டில் உள்ள அதே எடையுடன். இது பல காரணங்களுக்காக நடைமுறைக்கு மாறானதாக இருக்கலாம்: ஒரு சொத்துக்கு ஒரு சுற்று நிறைய கூட நிர்வாகத்தின் கீழ் உள்ள சொத்துக்களை விட அதிகமாக இருக்கலாம், ஒருங்கிணைந்த கட்டுப்பாடுகளுடன் கூடிய குறியீட்டு-கண்காணிப்பு சிக்கலின் பெரிய அளவு தேர்வுமுறை சிக்கலை கடினமாக்குகிறது, மற்றும் குறியீட்டில் உள்ள எடைகளுக்கு நிலைகளை சரிசெய்ய அடிக்கடி மறுசீரமைப்பின் பரிவர்த்தனை செலவுகள் அணுகுமுறையை விலை உயர்ந்ததாக மாற்றக்கூடும். எனவே, ஒரு பிரபலமான அணுகுமுறை :math: `q` சொத்துகள் சந்தையை பிரதிநிதித்துவப்படுத்தும் :math:` n` சொத்துக்கள், எங்கே:math: `q` ஐ விட கணிசமாக சிறியது :math:` n`, ஆனால் போர்ட்ஃபோலியோ அடிப்படை சந்தையின் நடத்தையை பிரதிபலிக்கிறது. சொத்துக்களை எவ்வாறு குழுவாக்குவது என்பதை தீர்மானிக்க :math: `q` கொத்துகள் மற்றும் எது தீர்மானிக்க வேண்டும் :math:` q` சொத்துக்கள் பின்வருவனவற்றைக் குறிக்க வேண்டும் :math: `q` கொத்துகள் ஒரு பெரிய அளவிலான தேர்வுமுறை சிக்கலைத் தீர்ப்பதற்கு சமம். [கார்னூஜோல்ஸ் & டுட்டுங்கு, 2006] இல் அறிமுகப்படுத்தப்பட்ட போர்ட்ஃபோலியோ பல்வகைப்படுத்தல் சிக்கலுக்கான கணித மாதிரியை பின்வருவனவற்றில் விவரிக்கிறோம். பாரம்பரியமாக, நவீன போர்ட்ஃபோலியோ கோட்பாடு கோவாரன்ஸ் மேட்ரிக்ஸை சொத்துக்களுக்கு இடையிலான ஒற்றுமையின் ஒரு நடவடிக்கையாக கருதுகிறது என்பதைக் கவனியுங்கள். இருப்பினும், கோவாரன்ஸ் மேட்ரிக்ஸ் அபூரணமானது. உதாரணமாக, லண்டன் மற்றும் நியூயார்க்கில் பட்டியலிடப்பட்ட ஒரு நிறுவனத்தைக் கவனியுங்கள். இரண்டு பட்டியல்களும் மிகவும் ஒத்ததாக இருக்க வேண்டும் என்றாலும், இரண்டு பட்டியல்களின் விலைகளின் நேரத் தொடரின் பகுதிகள் மட்டுமே ஒன்றுடன் ஒன்று சேரும், ஏனெனில் சந்தைகள் திறக்கும் நேரங்களின் ஓரளவு ஒன்றுடன் ஒன்று. ஒத்திசைவுக்குப் பதிலாக, [பெர்ன்ட் மற்றும் கிளிஃபோர்ட், 1994] இன் டைனமிக் டைம் வார்பிங்கை இரண்டு நேரத் தொடர்களுக்கிடையிலான ஒற்றுமையின் ஒரு நடவடிக்கையாகக் கருதலாம், இது சில காலங்களுக்கு, தரவு ஒரே ஒருவரால் மட்டுமே கைப்பற்றப்படுகிறது என்பதை அனுமதிக்கிறது நேரத் தொடரின், மற்றவர்களுக்கு, இரு நேரத் தொடர்களும் பங்கு விலையின் இணையான பரிணாமத்தின் காரணமாக ஒற்றுமையை வெளிப்படுத்துகின்றன.

source: The overall workflow we demonstrate comprises:
es_un: El flujo de trabajo en general que demostramos comprende:
id_id: Alur kerja secara keseluruhan yang kami tunjukkan terdiri dari:
ja_jp: 全体的なワークフローは以下のとおりです。
ko_kr: 본 전체 워크플로우(workflow) 는 다음과 같다.
pt_br: O fluxo de trabalho global que demonstramos inclui:
ta_in: நாங்கள் நிரூபிக்கும் ஒட்டுமொத்த workflow அடங்கும்:

source: pick the ground set of assets. In our case, this is a small number of US stocks.
es_un: eligir el conjunto base de los activos. En nuestro caso es un pequeño número de acciones estadounidenses.
id_id: Pilih sejumlah aset dasar. Dalam kasus kami, ini adalah sejumlah kecil saham US.
ja_jp: 資産の基本セットを選択します。ここでは、少数の米国株です。
ko_kr: 기초 세트 자산을 선택합니다. 우리의 경우, 이것은 적은 수의 미국 주식이다.
pt_br: escolha o conjunto de ativos. No nosso caso, este é um pequeno número de ações dos EUA.
ta_in: நிலநடுத் தரவுகளை எடுக்கவும். நமது case ல் இது ஒரு சிறிய எண்ணிக்கை அமெரிக்க ஸ்டாக் ஆகும்.

source: load the time series capturing the evolution of the prices of assets. In our case, this is a simplistic load of adjusted daily closing price data from Wikipedia or Nasdaq or LSE or EuroNext, whereas in a real asset management, a much higher frequency may be considered.
es_un: cargar la serie de tiempo que captura la evolución de los precios de los activos. En nuestro caso es una carga simplista de datos de precios de cierre diarios ajustados de Wikipedia, Nasdaq, LSE o EuroNext, mientras que en un manejo de activos real se necesita una frecuencia mucho más alta.
id_id: Memuat jangka waktu yang menunjukkan perubahan harga aset. Dalam hal ini, memuat secara sederhana penutupan harga harian yang telah disesuaikan dari Wikipedia atau Nasdaq, LSE atau EuroNext, sedangkan dalam manajemen aset riil, frekuensi yang jauh lebih tinggi dapat dipertimbangkan.
ja_jp: 資産の価格変動を把握する時系列データをロードします。 ここでは、Wikipedia 、Nasdaq、 LSE 、または EuroNextからの調整された毎日の終値を単純にロードしています。実際の資産管理においては、より高い頻度を考慮することができます。
ko_kr: 자산 가격의 진화를 포착하는 시계열을 로드합니다. 우리의 경우, 이는 Wikipedia 또는 나스닥 또는 LSE 또는 유로넥스트로부터의 조정된 일별 종가 데이터를 단순히 조정하는 것이지만, 실제 자산 관리에서는 훨씬 더높은 수로 고려될 수 있다.
pt_br: carregue uma série temporal capturando a evolução dos preços dos ativos. No nosso caso, esta é uma carga simplista de dados de preços de fechamento diário ajustados da Wikipedia ou Nasdaq ou LSE ou EuroNext, Enquanto numa verdadeira gestão de ativos, pode considerar-se uma frequência muito mais elevada.
ta_in: வலைப்பதிவுகளின் விகிதங்களின் பரிணாம வளர்ச்சி அளிக்கிறது. நமது வழக்கில், இது விக்கிபீடியா அல்லது நாச்டாக் அல்லது LSE அல்லது யூரோடெனில் இருந்து ஒழுங்குபடுத்தப்பட்ட தினசரி விலை தரவுகளின் ஒரு எளிதான ஏற்றுமதி உள்ளது, ஒவ்வொன்றும் ஒரு உண்மையான வர்த்தக நிர்வாகத்தில், ஒரு அதிக அதிக விகிதமாக கருதலாம்.

source: compute the pair-wise similarity among the time series. In our case, we run a linear-time approximation of the dynamic time warping, still on the classical computer.
es_un: calcular la similitud por pares entre las series de tiempo. En nuestro caso, ejecutamos una aproximación de tiempo lineal de la deformación dinámica del tiempo, todavía en la computadora clásica.
id_id: Menghitung kemiripan yang berpasangan dari waktu ke waktu. Dalam kasus kami, kami menjalankan pendekatan waktu secara linear dari kurva waktu yang dinamis, masih pada komputer klasik.
ja_jp: 時系列間のペアごとの類似性を計算します。 ここでは、まだ古典コンピュータ上での動的時間伸縮法（DTW）の線形近似を実行しています。
ko_kr: 시계열 사이에 쌍별 유사성을 계산합니다. 우리의 경우, 우리는 여전히 고전적인 컴퓨터에 있는 동적인 시간 관리인의 선형 시간 근사를 실행한다.
pt_br: calcule a semelhança entre pares ao longo do tempo. No nosso caso, rodamos uma aproximação linear da sincronização temporal dinâmica, ainda no computador clássico.
ta_in: நேர வரிசையில் ஜோடி-விதமான ஒத்திசைவு ஒழுங்குபடுத்துகிறது. நமது வழக்கில், நாம் ஒரு linear-time approximation of the dynamic time warping ஐ உபயோக்க்கிறோம், இன்னும் classical கணினியில்.
