Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/finance/02_portfolio_diversification.po
Languages: es_un, id_id, ja_jp, ko_kr, pt_br, ta_in

source: First, we import the requisite modules.
es_un: Primero, importamos los módulos necesarios.
id_id: Pertama, kami mengimpor modul yang diperlukan.
ja_jp: まず、必要なモジュールをインポートします。
ko_kr: 먼저 필요한 모듈을 가져온다.
pt_br: Em primeiro lugar, importamos os módulos necessários.
ta_in: முதலில், நாம் தேவையான மாதிரிகளை import செய்யும்.

source: Next, we download price data for two stocks and compute their pair-wise similarity matrix (dynamic time warping distance normalized to (0,1] by taking the reciprocal). If this fails, e.g., due to you being offline or exceeding the daily limit for accesses to the stock-market data, we consider a constant matrix instead.
es_un: A continuación, descargamos los datos de precios para dos acciones y calculamos la matriz de similitud de pares (distancia de la deformación dinámica del tiempo normalizada a (0,1] tomando el recíproco). Si esto falla, por ejemplo, causado por una desconexión de la red o por exceder el límite diario de acceso a los datos del mercado de valores, podemos considerar una matriz constante en su lugar.
id_id: Selanjutnya, kita mengunduh data harga untuk dua buah saham dan menghitung matriks kemiripan pasangan mereka (jarak kelengkungan waktu dinamis dinormalisasi ke (0,1] dengan mengambil kebalikannya). Jika ini gagal, misalnya, karena Anda sedang offline atau melebihi batas harian untuk mengakses data pasar modal, kita mempertimbangkan sebuah matriks konstanta sebagai gantinya.
ja_jp: 次に、2つの銘柄の価格データをダウンロードし、そのペアワイズ類似度行列(逆数を取ることで ([0,1] に正規化された動的時間伸縮法の距離)を計算します。もし、オフラインになっていたり、一日のアクセス制限を超えていたりして、計算に失敗した場合は、代わりに定数行列を考慮します。
pt_br: Em seguida, baixamos os dados de preço de duas ações e calculamos sua matriz de similaridade por pares (distância de deslocamento dinâmico normalizada para (0,1] tomando a reciprocidade). Se isso falhar, por exemplo, devido a você estar offline ou exceder o limite diário para acessos aos dados do mercado de ações, nós consideramos uma matriz constante em vez disso.
ta_in: அப்படி, நாங்கள் இரு நிலையில் விலை தரவுகள் உள்ளது (dynamic time warping distance normalized to (0,1] by taking the reciprocal). அவர்களின் இரண்டு புத்தகங்களில் ஒன்றுக்கொண்டிருக்க வேண்டும். இது பழுதடைந்தால், எ. கா, உங்களால் ஏற்றுக்கொள்ளப்படாத காரணமாக அல்லது தினசரி அளவிற்கு மேலாக இருப்பதால், ஸ்டாக்-சந்தை தகவல்களை அணுகுவதற்கு பதிலாக, அதற்குப் பதிலாக நாம் ஒரு நிலையான மாட்ரிக்ஸ் கருதப்படுகிறது.

source: Now we decide on the number of clusters. This has to be smaller than the number of stocks we have loaded.
es_un: Ahora escogemos el número de agrupamientos. Esto tiene que ser más pequeño que el número de acciones que hemos cargado.
id_id: Sekarang kami memutuskan jumlah kelompok. Jumlah ini harus lebih kecil dari jumlah saham yang telah kami muat.
ja_jp: 今度はクラスターの数を決めます。これはロードした株式数よりも小さくする必要があります。
ko_kr: 이제 군집 수를 결정합니다. 이는 우리가 보유한 주식 수보다 적어야 한다.
pt_br: Agora tomamos decisões sobre o número de agrupamentos, o que tem de ser menor do que o número de unidades de ação que temos carregado.
ta_in: இப்போது நாங்கள் clusters எண் முடிவு. இது நாம் ஏற்றப்பட்ட எண்ணிக்கை விட சிறிய இருக்க வேண்டும்.

source: Classical solution using IBM ILOG CPLEX
es_un: Solución clásica utilizando IBM ILOG CPLEX
id_id: Solusi klasik menggunakan IBM ILOG CPLEX
ja_jp: IBM ILOG CPLEXを使用した古典的なソリューション
ko_kr: IBM ILOG CPLEX를 사용한 고전적 솔루션
pt_br: Solução clássica usando o IBM ILOG CPLEX

source: For a classical solution, we use IBM CPLEX. CPLEX is able to find the exact solution of this problem. We first define a ClassicalOptimizer class that encodes the problem in a way that CPLEX can solve, and then instantiate the class and solve it.
es_un: Para una solución clásica, utilizamos IBM CPLEX. CPLEX es capaz de encontrar la solución exacta de este problema. Primero, definimos una clase ClassicalOptimizer que codifica el problema de una manera que CPLEX puede resolver y a después crea una instancia de la clase y la resuelve.
id_id: Untuk solusi klasik, kita menggunakan IBM CPLEX. CPLEX mampu menemukan solusi yang tepat atas permasalahan ini. Pertama kita mendefinisikan sebuah kelas ClassicalOptimizer yang menerjemahkan permasalahan tersebut ke dalam bentuk yang dapat dipecahkan oleh CPLEX, dan kemudian mewujudkan kelas tersebut dan menyelesaikannya.
ja_jp: 古典的な解法（従来のソリューション）では、IBM CPLEXを使用しています。CPLEXはこの問題の正確な解決策を見つけることができます。 まず、問題をCPLEXが解決できる方法でエンコードし、クラスをインスタンス化して解決するClassicalOptimizerクラスを定義します。
pt_br: Para uma solução clássica, nós usamos o IBM CPLEX. O CPLEX é capaz de encontrar a solução exata deste problema. Nós definimos uma classe ClassicalOptimizer que codifica o problema de uma forma que o CPLEX possa resolver e, em seguida, instanciamos a classe e a resolvemos.
ta_in: ஒரு சாதாரண தீர்வு, நாம் IBM CPLEX பயன்படுத்த. CPLEX இந்த பிரச்சனையை சரியான தீர்வு கண்டுபிடைக்க முடியும். நாம் முதலில் ஒரு ClassicalOptimizer வகுப்பை வரையறுக்கிறோம், CPLEX தீர்மானிக்கும் ஒரு வழியில் பிரச்சனையை குறியீடு என்று, பின்னர் வகுப்பு மற்றும் அதை தீர்க்கலாம்.

source: Solution shows the selected stocks via the stars and in green the links (via similarities) with other stocks that are represented in the fund by the linked stock.
es_un: La solución muestra las acciones seleccionadas usando estrellas y en verde los enlaces (a través de similitudes) con otras acciones que están representadas en el fondo por la acción vinculada.
id_id: Solusi menunjukkan saham yang dipilih dengan bintang dan hubungan (melalui kemiripan) dengan saham lain yang direpresentasikan dalam dana melalui saham terhubung dalam warna hijau.
ja_jp: ソリューションは、星印で選択された銘柄が示され、（類似性を介して）緑色のラインで他の銘柄とのリンクを表示します。
pt_br: Solução mostra os estoques selecionados através das estrelas e em verde os links (via semelhanças) com outros estoques que são representados no fundo pelo estoque vinculado.
ta_in: Solution விண்மீன்களின் மூலம் தேர்ந்தெடுக்கப்பட்ட stocks நட்சத்திரங்களின் மூலம் மற்றும் green links (ஒத்திசைவு வழியாக) பிற ஸ்டாக்குகளுடன் இணைக்கப்பட்ட கிரகங்களைக் கொண்டு ஒழுங்குபடுத்துகிறது.

source: Quantum Computing with IBM Q
es_un: Computación Cuántica con IBM Q
id_id: Komputasi Kuantum dengan IBM Q
ja_jp: IBM Q による量子コンピューティング
ko_kr: IBM Q를 이용한 양자 컴퓨팅
pt_br: Computação quântica com IBM Q

source: For the quantum solution, we use Qiskit. We first define a class QuantumOptimizer that encodes the quantum approach to solve the problem and then we instantiate it and solve it. We define the following methods inside the class:
es_un: Para la solución cuántica, usamos Qiskit. Primero definimos una clase QuantumOptimizer que codifica el enfoque cuántico para resolver el problema y luego lo instanciamos y lo resolvemos. Definimos los siguientes métodos dentro de la clase:
id_id: Untuk solusi quantum, kami menggunakkan qiskit. Pertama, kami mendefinisikan kelas QuantumOptimizer yang mengkodekan pendekatan kuantum untuk memecahkan masalah dan kemudian kami membuat contoh dan menyelesaikannya. Kami mendefinisikan metode berikut di dalam kelas:
ja_jp: 量子的な解法には、Qiskitを使用します。 まず、問題を解決するための量子アプローチをエンコードするクラスQuantumOptimizerを定義し、それをインスタンス化して解決します。 クラス内で次のメソッドを定義します。
pt_br: Para a solução quântica, nós usamos o Qiskit. Definimos primeiro uma classe com QuantumOptimizer que codifica a abordagem quântica para resolver o problema e, em seguida, vamos instanciá-la e resolvê-la. Definimos os seguintes métodos dentro da classe:
ta_in: குவாண்டம் தீர்வு, நாம் Qiskit பயன்படுத்துவோம். நாம் முதலில் ஒரு வகுப்பு QuantumOptimizer வரையறுக்கிறோம், அந்த பிரச்சனையை தீர்க்க குவாண்டம் அணுகல் குறியீடு மற்றும் பிறகு அதை நாம் அதை தீர்க்க மற்றும் அதை தீர்க்க. நாம் வகுப்புக்குள் பின்வரும் முறைகளை வரையறுக்கிறோம்:

source: ``exact_solution`` : to make sure that the Ising Hamiltonian is correctly encoded in the :math:`Z` basis, we can compute its eigendecomposition classically, i.e., considering a symmetric matrix of dimension :math:`2^N \times 2^N`. For the problem at hand :math:`n=3`, that is :math:`N = 12`, seems to be the limit for many laptops;
es_un: ``exact_solution`` : para asegurarnos de que el hamiltoniano de Ising está codificado correctamente en la base :math:`Z`, podemos calcular su descomposición propia de forma clásica, es decir, considerando una matriz simétrica de dimensión :math:`2^N \times 2^N`. En este problema :math:`n=3`, es decir :math:`N = 12`, parece ser el límite para muchas computadoras portátiles;
id_id: ``exact_solution``: untuk memastikan bahwa Hamiltonian Ising dikodekan secara tepat dalam basis :math:`Z`, kita dapat menghitung dekomposisieigennya secara klasik, yaitu, mempertimbangkan sebuah matriks simetris dengan dimensi :math:`2^N \times 2^N`. Untuk masalah :math:`n=3`, yaitu :math:`N = 12`, tampaknya merupakan batasan untuk banyak laptop;
ja_jp: ``exact_solution`` : イジング・ハミルトニアンが :math:`Z` 基底に正しく エンコードされていることを確認するために、次元 :math:`2^N \times 2^N` の対称行列を考慮して、古典的に固有値分解を計算することができます。今回の問題では :math:`n=3`、つまり :math:`N = 12`が多くのノートパソコンの限界のようです。
ko_kr: ``exact_solution``: Ising Hamiltonian이 :math:`Z` 기반으로 올바르게 인코딩되었는지 확인하기 위해 고유 분해를 고전적으로 계산할 수 있다. 즉, 차원의 대칭 행렬을 고려한다. :math:`2^N \times 2^N`. 당면한 문제의 경우 :math:`n=3`, 즉 :math:`N = 12` 는 많은 랩톱의 한계이다.
pt_br: ``exact_solution`` : para se certificar de que a Ising Hamiltonian esteja corretamente codificada na base de :math:`Z`, podemos calcular sua eigendecomposition clássica, ou seja, considerando uma matriz simétrica de dimensão :math:`2^N \times 2^N`. Para o problema que temos :math:`n=3`, ou seja, :math:`N = 12`, parece ser o limite para muitos laptops;
ta_in: ``exact_solution`` : அதை உறுதிப்படுத்த Ising Hamiltonian :math:`Z` basis சரியாக குறியாக்கம் செய்யப்பட்டுள்ளதா என்றும், அதன் eigendecomposition ஐ நாம் கிளாசிக்கலாக கணக்கிடலாம், அதாவது, பரிமாணத்தின் சமச்சீர் அணியைக் கருத்தில் கொள்ளுங்கள் :math:`2^N \times 2^N`. கையில் உள்ள பிரச்சினைக்கு :math:`n=3`, அதாவது :math:`N = 12`, பல மடிக்கணினிகளுக்கான வரம்பாகத் தெரிகிறது;

source: ``vqe_solution`` : solves the problem :math:`(M)` via the variational quantum eigensolver (VQE);
es_un: ``vqe_solution`` : soluciona el problema :math:`(M)` mediante el solucionador propio variacional cuántico (variational quantum eigensolver, VQE);
id_id: ``vqe_solution`` : memecahkan masalah :math:`(M)` melalui eigensolver kuantum variasional (variational quantum eigensolver/VQE);
ja_jp: ``vqe_solution`` : 変数量子固有ソルバー(VQE)を介して問題 :math:`(M)` を解決します。
pt_br: ``vqe_solution`` : resolve o problema :math:`(M)` através da variational quantum eigensolver (VQE);
ta_in: ` vqe_ தீர்வு ` `: தீர்வு :math:` (M) ` வழியாக variational quantum eigensolver (VQE) `;

source: ``qaoa_solution`` : solves the problem :math:`(M)` via a Quantum Approximate Optimization Algorithm (QAOA).
es_un: ``qaoa_solution`` : soluciona el problema :math:`(M)` mediante el Algoritmo Cuántico de Optimización Aproximada (Quantum Approximate Optimization Algorithm, QAOA).
id_id: ``qaoa_solution`` : menyelesaikan permasalahan :math:`(M)` melalui sebuah Algoritme Optimasi Perkiraan Kuantum (Quantum Approximate Optimization Algorithm/QAOA).
ja_jp: ``qaoa_solution`` : 量子近似最適化アルゴリズム(QAOA)を介して問題 :math:`(M)` を解決します。
pt_br: ``qaoa_solution`` : resolve o problema :math:`(M)` através de um Quantum Approximate Optimization Algorithm (QAOA).
ta_in: ` qaoa_தீர்வு ` `: பிரச்சனை :math:` (M) ` ஒரு Quantum Approximate Optimization Algorithm (QAOA) மூலம் தீர்மானிக்கிறது.

source: Step 1
es_un: Paso 1
id_id: Langkah 1
ja_jp: ステップ 1
ko_kr: 단계 1
pt_br: Passo 1
ta_in: செயல் 1

source: Instantiate the quantum optimizer class with parameters: - the similarity matrix ``rho``; - the number of assets and clusters ``n`` and ``q``;
es_un: Crear una instancia de la clase del optimizador cuántico con los parámetros: - la matriz de similitud ``rho``; - el número de acciones y agrupaciones ``n`` y ``q``;
id_id: Mewujudkan kelas pengoptimal kuantum dengan parameter: - matriks kemiripan ``rho``; - jumlah aset dan klaster ``n`` and ``q``;
ja_jp: quantum optimizer classをパラメータでインスタンス化します: ここでは類似行列が ``rho``; アセットとクラスタの数がそれぞれ ``n`` と ``q`` です。
pt_br: Instancie a classe otimizadora quântica com parâmetros: - a matriz de similaridade ``rho``; - o número de ativos e agrupamentos ``n`` e ``q``;
ta_in: Parameters மூலம் Quantum optimizer வகுப்பை நிறுவுங்கள்: - the similarity matrix ``rho``; - தரவுகல் மற்றும் Cluster களின் எண்ணிக்கை ``n`` and ``q``;

source: Step 2
es_un: Paso 2
id_id: Langkah 2
ja_jp: ステップ２
ko_kr: 단계 2
pt_br: Passo 2
ta_in: செயல் 2

source: Encode the problem as a binary formulation (IH-QP).
es_un: Codificar el problema como una formulación binaria (IH-QP).
id_id: Mengodekan masalah sebagai formulasi biner (IH-QP).
ja_jp: 問題をバイナリ形式（IH-QP）としてエンコードします。
ko_kr: 문제를 이원 제형 (IH-QP) 으로 코딩한다.
pt_br: Codifique o problema como uma formulação binária (IH-QP).
ta_in: பிரச்சனையை binary வடிவம் (IH-QP) என குறியீடு.

source: Sanity check: make sure that the binary formulation in the quantum optimizer is correct (i.e., yields the same cost given the same solution).
es_un: Comprobación: asegurarse que la formulación binaria del optimizador cuántico es correcta (es decir, que da el mismo costo dada la misma solución).
id_id: Pemeriksaan kewajaran: pastikan bahwa formulasi biner dalam pengoptimal kuantum sudah benar (yaitu menghasilkan biaya yang sama untuk solusi yang sama).
ja_jp: 整合性チェック: quantum optimizer 内のバイナリ定式化が正しいことを確認してください (i.e., 同じ解で同じコストが得られることを確認)。
ko_kr: 정상 검사: 양자 최적화 프로그램의 2진 공식화가 정확한지 확인한다 (즉, 동일한 솔루션에서 동일한 비용을 산출함).
pt_br: Verificação de sanidade: certifique-se de que a formulação binária no otimizador quântico esteja correta (ou seja, produz o mesmo custo dada a mesma solução).
ta_in: சனி சரிபார்த்தல்: quantum optimizer ஒப்பிடுகையில் binary வடிவம் சரியான (அதாவது, அதே தீர்வு கொடுக்கப்பட்ட ஒரே செலவு) என்று உறுதி செய்கிறது.

source: Step 3
es_un: Paso 3
id_id: Langkah 3
ja_jp: ステップ３
ko_kr: 단계 3
pt_br: Passo 3
ta_in: செயல் 3

source: Encode the problem as an Ising Hamiltonian in the Z basis.
es_un: Codificar el problema como un Hamiltoniano de Ising en la base Z.
id_id: Kodekan masalah sebagai sebuah Hamiltonian Ising dalam basis Z.
ja_jp: 問題をZ基底のイジング・ハミルトニアンとしてエンコードしてください。
pt_br: Codifique o problema como um Ising Hamiltonian na base Z.
ta_in: Z அடிப்படையில் ஒரு Ising Hamiltonian as an Ising Hamiltonian என்று குறியீடு.

source: Sanity check: make sure that the formulation is correct (i.e., yields the same cost given the same solution)
es_un: Comprobación: asegurarse que la formulación sea correcta (es decir, que produce el mismo costo dada la misma solución)
id_id: Pemeriksaan kewajaran: pastikan bahwa formulasi sudah benar (yaitu menghasilkan biaya yang sama dengan solusi yang sama)
ja_jp: 整合性チェック: 定式化が正しいことを確認してください (i.e., 同じ解で同じコストが得られることを確認)。
pt_br: Verificação de sanidade: certifique-se de que a formulação esteja correta (ou seja, produz o mesmo custo dada a mesma solução)
ta_in: சனி சரிபார்த்தல்: formula சரியாக செய்வதை உறுதி செய்து கொள்ளுங்கள் (அதாவது, அதே தீர்வு கொடுக்கப்பட்ட ஒரே செலவு)

source: Step 4
es_un: Paso 4
id_id: Langkah 4
ja_jp: ステップ 4
ko_kr: 단계 4
pt_br: Passo 4
ta_in: செயல் 4

source: Solve the problem via VQE. Notice that depending on the number of qubits, this can take a while: for 6 qubits it takes 15 minutes on a 2015 Macbook Pro, for 12 qubits it takes more than 12 hours. For longer runs, logging may be useful to observe the workings; otherwise, you just have to wait until the solution is printed.
es_un: Solucionar el problema vía el VQE. Nota que dependiendo en el número de qubits, esto puede llevar un tiempo: para 6 qubits se necesitan 15 minutos en una Macbook Pro 2015, para 12 qubits se necesitan más de 12 horas. Para corridas más largas, los registros pueden ser útiles para observar el funcionamiento; de otra manera, tendrás que esperar a que se imprima la solución.
id_id: Selesaikan permasalahan melalui VQE. Perhatikan bahwa tergantung pada jumlah qubit, hal ini memerlukan waktu: untuk 6 qubit diperlukan 15 menit pada sebuah Macbook Pro 2015, untuk 12 qubit diperlukan lebih dari 12 jam. Untuk proses yang lebih panjang, mencatat (logging) mungkin bermanfaat untuk mengamati pengerjaannya; jika tidak, Anda hanya perlu menunggu hingga solusi ditampilkan.
ja_jp: VQEで問題を解決します。 量子ビットの数によっては時間がかかることがあることに注意してください。6量子ビットの場合は、2015 Macbook Proで15分かかります。 12量子ビットの場合12時間以上かかります より長い実行の場合、ログをとって作業を監視するのが有益かもしれません。それ以外の場合は、ソリューションが表示されるまで待つだけです。
pt_br: Resolva o problema via VQE. Observe que dependendo do número de qubits, isso pode demorar um pouco: para 6 qubits pode demorar 15 minutos em um Macbook Pro 2015, para 12 qubits demora mais de 12 horas. Para execuções mais longas, ligar logs pode ser útil para observar os trabalhos; caso contrário, você só tem que esperar até que a solução seja impressa.
ta_in: VQE மூலம் பிரச்சனையை சோதிக்கவும். விகிதங்களின் எண்ணிக்கை பொறுப்பேற்றது, இது ஒரு நேரத்தில் எடுக்க முடியும்: 6 qubit களுக்காக இது ஒரு 2015 Macbook Pro இல் 15 நிமிடங்கள் எடுக்க, 12 qubit 12 மணி நேரம் எடுக்க முடியும். நீண்ட ஓட்டங்கள், உள்ளடக்கத்தை கண்காணிப்பதற்கு உதவியாக இருக்கலாம், இல்லையென்றால், நீங்கள் தீர்வு அச்சிடும் வரை காத்திருக்க வேண்டும்.

source: Step 5
es_un: Paso 5
id_id: Langkah 5
ja_jp: ステップ5
ko_kr: 단계 5
pt_br: Passo 5
ta_in: செயல் 5

source: Visualize the solution
es_un: Visualización de la solución
id_id: Visualisasikan solusi
ja_jp: ソリューションの視覚化
ko_kr: 솔루션 시각화
pt_br: Visualize a solução
ta_in: தீர்வு காண்பிக்கவும்

source: Solution shows the selected stocks via the stars and in green the links (via similarities) with other stocks that are represented in the fund by the linked stock. Keep in mind that VQE is a heuristic working on the QP formulation of the Ising Hamiltonian, though. For suitable choices of A, local optima of the QP formulation will be feasible solutions to the ILP. While for some small instances, as above, we can find optimal solutions of the QP formulation which coincide with optima of the ILP, finding optimal solutions of the ILP is harder than finding local optima of the QP formulation, in general. Even within the VQE, one may provide stronger guarantees, for specific variational forms (trial wave functions).
es_un: La solución muestra las acciones seleccionadas usando estrellas y en verde los enlaces (a través de similitudes) con otras acciones que están representadas en el fondo por la acción vinculada. Sin embargo, toma en cuenta que el VQE es un trabajo heurístico sobre la formulación QP del Hamiltoniano de Ising. Para las elecciones viables de A, los óptimos locales de la formulación de QP van a ser soluciones factibles para el ILP. Mientras que para algunas pequeñas instancias, como se muestra arriba, podemos encontrar soluciones optimas para la formulación QP que coinciden con los óptimos del ILP; en general, encontrar soluciones del ILP es más difícil que encontrar óptimos locales de la solución QP. Aún dentro del VQE, uno puede proporcionar garantías más fuertes para formas variacionales especificas (funciones de onda de prueba).
id_id: Solusi menunjukkan saham yang dipilih dengan bintang dan hubungan (melalui kemiripan) dengan saham lain yang direpresentasikan dalam dana melalui saham terhubung dalam warna hijau. Ingat bahwa VQE adalah pengerjaan heuristik pada formulasi QP dari Hamiltonian Ising. Untuk pilihan A yang sesuai, optima lokal dari formulasi QP akan menjadi solusi ILP yang mungkin. Sementara untuk beberapa kejadian kecil, seperti di atas, kita dapat menemukan solusi optimal untuk formulasi QP yang bertepatan dengan optima ILP, secara umum menemukan solusi optimal untuk ILP lebih sulit daripada menemukan optima lokal dari formulasi QP. Bahkan dalam VQE, kita dapat menyediakan jaminan yang lebih kuat untuk bentuk variasional spesifik (fungsi gelombang percobaan).
ja_jp: ソリューションは、選択された銘柄を星印で示し、緑色の線は、（類似性を介して）ファンド内の他の銘柄との関連性を示しています。ただし、VQEはイジング・ハミルトニアンのQP定式化に取り組むヒューリスティックであることに留意してください。Aを適切に選択すると、QP定式化の局所最適解はILPの実現可能な解となります。上記のように、いくつかの小さな例では、ILPの最適解と一致するQP定式化の最適解を見つけることができますが、ILPの最適解を見つけることは、一般的には、QP定式化の局所的な最適解を見つけるよりも困難です。VQEの中でも，特定の変分型（試行波動関数）に対して，より強力な保証を提供することができます。
ko_kr: 솔루션은 링크된 주식에 의해 펀드에 표시되는 다른 주식과 함께 별표를 통해 선택된 주식을 표시하고 링크 (유사성을 통해) 를 녹색으로 표시합니다. VQE는 Ising Hamiltonian (Ising Hamiltonian) 의 QP 제제에 대한 휴리스틱스 (heuristic) 이다는 점에 유의하라. A의 적합한 선택을 위해, QP 제형의 국소 최적화는 ILP에 대한 가능한 용액일 것이다. 일부 작은 경우들에 대하여, 상술한 바와 같이, ILP의 최적화와 일치하는 QP 제제의 최적의 용액을 찾을 수 있고, ILP의 최적의 용액을 찾는 것은 일반적으로 QP 제제의 국소 최적화를 발견하는 것보다 어렵다. VQE내에서도, 특정 다양한 형태 (시험 파형 기능) 에 대해 보다 강력한 보증을 제공할 수 있다.
pt_br: A solução mostra as ações selecionadas através das estrelas e de verde os links (via similaridades) com outras ações que são representadas no fundo pelas ações vinculadas. Tenha em mente que o VQE é uma heurística que trabalha na formulação do PQ do Ising Hamiltonian. Para escolhas adequadas de A, ótimos locais da formulação da CPQ serão soluções viáveis para o ILP. Enquanto em algumas pequenas instâncias, como acima, podemos encontrar soluções ideais para a formulação da QP que coincidem com a opacidade do ILP, encontrar soluções ideais do ILP é mais difícil do que encontrar a opacidade local na formulação da PQ, em geral. Mesmo dentro do VQE, pode-se oferecer garantias mais fortes, para formulários variacionais específicos (funções de ondas de teste).
ta_in: சோதனை (Solution) விண்மீன்களின் மூலம் தேர்ந்தெடுக்கப்பட்ட ஸ்டாக்ஸ் (stocks) நட்சத்திரங்களின் மூலம் மற்றும் பச்சை இணைப்புகளுடன் (ஒத்திசைவு வழியாக) பிற ஸ்டாக்குகளுடன் இணைக்கப்பட்ட கிரகங்களைக் கொண்டு ஒழுங்குபடுத்துகிறது. வைக ் க ் கையில ் வைத ் துக ் கொண ் டிருக ் க வேண ் டும ். அவர ் கள ் அல ் லது ஹாமிலோனியன ் கப ் பிக ் கப ் பட ் ட வேண ் டும ். A இன் பொருத்தமான தேர்வுகளுக்காக, QP வடிவமைப்பின் உள்ளூர் ஒப்பீட்டை ILP-க்கு தெளிவுபடுத்தும். சில சிறிய நிகழ்வுகளுக்காக, மேலே, நாம் ILP இன் ஒப்பிடுகை கொண்டு, ILP யின் ஒளி தீர்வு கண்டுபிடித்தல், QP வடிவமைப்பின் உள்ளூர் ஒப்பீட்டை கண்டுபிடிக்கும், பொதுவாக ILP யின் உள்ளூர் தீர்வு கண்டுபிடிக்கிறது. VQE உள்ளிட்ட கூட, ஒரு குறிப்பிட்ட வேறுபட்ட வடிவங்களுக்காக (வழக்கமான அலை செயல்பாடுகள்) கூடுதலாக வலுவான சராசரியை வழங்கலாம்.

source: [1] G. Cornuejols, M. L. Fisher, and G. L. Nemhauser, *Location of bank accounts to optimize float: an analytical study of exact and approximate algorithms*, Management Science, vol. 23(8), 1997
id_id: [1] G. Cornuejols, M. L. Fisher, dan G. L. Nemhauser, *Lokasi dari akun bank untuk mengoptimalkan float: sebuah studi analitis yang tepat dan perkiraan algoritma *, Manajemen Sains, vol. 23 (8), 1997

source: **Portfolio Diversification**
pt_br: **Diversificação do Portfólio**

source: Here, we demonstrate an approach that combines classical and quantum computing steps, following the quantum approximate optimization approach of Farhi, Goldstone, and Gutman (2014).
pt_br: Aqui, demonstramos uma abordagem que combina passos de computação clássica e quântica, seguindo a abordagem de otimização aproximada quântica de Farhi, Goldstone e Gutman (2014).

source: [5] `6_examples_max_cut_and_tsp.ipynb <https://github.com/Qiskit/qiskit-tutorials/blob/master/tutorials/optimization/6_examples_max_cut_and_tsp.ipynb>`__
ta_in: [5] ` 6_ examples_max_cut_tsp.ipynb <https://github.com/Qiskit/qiskit-tutorials/blob/master/tutorials/optimization/6_examples_max_cut_and_tsp.ipynb>` ___
