Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/finance/02_portfolio_diversification.po
Languages: es_un, id_id, ja_jp, ko_kr, pt_br, ta_in

source: compute the actual portfolio of :math:`q` representative assets, based on the similarity measure. This step is run twice, actually. First, we obtain a reference value by a run of an IBM solver (IBM ILOG CPLEX or the Exact Eigensolver) on the classical computer. Second, we run an alternative, hybrid algorithm partly on the quantum computer.
es_un: calcular la cartera real de :math:`q` activos representativos, basándose en la medida de similitud. En realidad, este paso se ejecuta dos veces. Primero, obtenemos un valor de referencia mediante la ejecución de un solucionador de IBM (IBM ILOG CPLEX o Exact Eigensolver) en la computadora clásica. En segundo lugar, ejecutamos un algoritmo híbrido alternativo parcialmente en la computadora cuántica.
id_id: menghitung portofolio aktual dari aset :math:` q ` perwakilan, berdasarkan ukuran kesamaan. Langkah ini dijalankan dua kali, sebenarnya. Pertama, kita mendapatkan nilai referensi dengan menjalankan sebuah solver IBM (IBM ILOG CPLEX atau Exact Eigensolver) pada komputer klasik. Kedua, kita jalankan alternatif, algoritma hybrid sebagian pada komputer kuantum.
ja_jp: 類似度の測定方法に基づいて、 :math:`q` の代表資産の実際のポートフォリオを計算します。 このステップは2 回実行されます。 まず、 IBMの最適化ソルバー (IBM ILOG CPLEX または Exact Eigensolver) の古典コンピューターでの実行による参照値を取得します。 次に、量子コンピュータ上で部分的に代替のハイブリッドアルゴリズムを実行します。
ko_kr: 이러한 유사성 측정에 기초하여 :math:`q` 의 실제 자산의 실제 포트폴리오를 계산한다. 이 단계는 실제로 두 번 실행됩니다. 먼저, 고전적인 컴퓨터에서 IBM solver (IBM ILOG CPLEX 또는 Exact Eigensolver) 를 실행하여 참조 값을 얻는다. 두 번째로, 우리는 양자컴퓨터에 부분적으로 하이브리드 알고리즘을 실행한다.
pt_br: execute o portfólio atual de ativos representativos do :math:`q`, com base na medida de similaridade. Esta etapa é executada duas vezes, na verdade. Primeiro, obtemos um valor de referência pelo método de execução de um solver IBM (IBM ILOG CPLEX ou o Exact Eigensolver) no computador clássico. Depois, executamos um algoritmo alternativo, híbrido, em parte no computador quântico.
ta_in: :math:` q ` பிரதிநிதித்துப் சொத்துக்களின் உண்மையான துடுப்பாட்டப் போட்டிகளை ஒழுங்குபடுத்தி, ஒத்திசைவு அளவில் அடிப்படையாகக் கொண்டது. இந்த படி இரண்டு முறை இயங்குகிறது, உண்மையில். முதலில், நாம் ஒரு IBM solver (IBM ILOG CPLEX அல்லது Exact Eigensolver) ஒரு இயக்கி மதிப்பை பரிந்துரைக்கிறோம். இரண்டாவது, நாம் ஒரு மாற்று, hybrid கணினியில் சேர்த்து செயல்படுத்த வேன்டும்.

source: visualization of the results. In our case, this is again a simplistic plot.
es_un: visualización de los resultados. En nuestro caso esto, de nuevo, es una simple grafica.
id_id: visualisasi hasil. Dalam kasus ini, ini adalah plot yang sederhana.
ja_jp: 結果を視覚化します。 ここでは単純なプロットをします。
ko_kr: 결과를 시각화합니다. 우리의 경우, 이것은 단순한 도표이다.
pt_br: visualização dos resultados. No nosso caso, este é novamente um plot simplista.
ta_in: முடிவுகளின் விவரம். நமது வழக்கில், இது மீண்டும் ஒரு எளிமையான plot உள்ளது.

source: In the following, we first explain the model used in (4) above, before we proceed with the installation of the pre-requisites and the data loading.
es_un: A continuación, primero explicaremos el modelo utilizado arriba (4) antes de proceder con la instalación de los prerrequisitos y la carga de datos.
id_id: Berikut ini, pertamatama kami menjelaskan model yang digunakan dalam (4) di atas, sebelum kita melanjutkan dengan pemasangan pra sayarat (pre-requisites) dan pemuatan data (load data).
ja_jp: 以下では、前提条件とデータロードのインストールを進める前に、上記(4) で使用されているモデルについて、説明します。
ko_kr: 다음에는 전제조건 및 데이터 로드 설치를 진행하기 전에 위의 (4) 에서 사용된 모델을 먼저 설명한다.
pt_br: A seguir, primeiro explicamos o modelo usado em (4) acima, antes de prosseguirmos com a instalação dos pré-requisitos e o carregamento de dados.
ta_in: பின்வருமாறு, நாம் முதலில் (4) மேலே பயன்படுத்தப்பட்ட model களை விளக்குகிறது, முன் தேவையான மற்றும் தரவு ஏற்றுக் கொள்ளும் நிறுவனத்துடன் தொடர்ந்து முன்னர்.

source: The Model
es_un: El Modelo
id_id: Model
ja_jp: モデル
ko_kr: 모델
pt_br: O Modelo
ta_in: மாதிரி

source: As discussed in [Cornuejols & Tutuncu, 2006], we describe a mathematical model that clusters assets into groups of similar ones and selects one representative asset from each group to be included in the index fund portfolio. The model is based on the following data, which we will discuss in more detail later:
es_un: Como se discute en [Cornuejols & Tutuncu, 2006], describimos un modelo matemático que agrupa activos en grupos similares y elige un activo representativo de cada grupo que va a ser incluido en la cartera de fondos indexados. El modelo está basado en los siguientes datos, que discutiremos a más detalle más adelante:
id_id: Seperti yang dibahas dalam [Cornuejols & Tutuncu, 2006]], kami menggambarkan model matematika yang mengelompokkan aset ke dalam kelompok yang serupa dan memilih satu aset perwakilan dari masing-masing kelompok untuk dimasukkan dalam portofolio dana indeks. Model ini didasarkan pada data berikut, yang akan kita bahas secara lebih rinci kemudian:
ja_jp: [Cornuejols & Tutuncu, 2006] で議論されているように、資産を類似した資産グループにクラスター化し、各グループから代表的な１資産を選択してインデックス・ファンドのポートフォリオに組み入れる数理モデルを記述します。このモデルは以下のデータに基づいており、後に詳述します。
ko_kr: [Cornuejols & Tutuncu, 2006] 에서 논의된 바와 같이, 우리는 애셋들을 유사한 그룹들의 그룹들로 분류하고, 인덱스 펀드 포트폴리오에 포함될 각 그룹으로부터 하나의 대표적인 애셋을 선택하는 수학적 모델을 기술한다. 모델은 다음 데이터를 기반으로 합니다. 나중에 자세히 설명하겠다.
pt_br: Conforme discutido em [Cornuejols e Tutuncu, 2006], descrevemos um modelo matemático que agrupa ativos em grupos similares e seleciona um ativo representativo de cada grupo a ser incluído no portfólio de fundos de índice. O modelo é baseado nos seguintes dados, que discutiremos em mais detalhes depois:
ta_in: [Cornuejols & Tutuncu, 2006] இல் பேசப்படுகையில், நாம் ஒரு கணித மாதிரியான ஒரு கணித மாதிரி என்று விவரித்துள்ளோம் ஒவ்வொரு குழுவிலிருந்து ஒவ்வொரு குழுவிலிருந்து ஒவ்வொரு குழுவிலிருந்து ஒரு பிரதிநிதி நிர்வாகத்தை தேர்ந்தெடுக்கிறது. மாதிரி பின்வரும் தகவல்களை அடிப்படையாகக் கொண்டு வருகின்றது, அதாவது நாம் பின் மேலும் விரிவாக்கத்தில் பரிந்துரைக்கப்படும்:

source: For example, :math:`\rho_{ii} = 1`, :math:`\rho_{ij} \leq 1` for :math:`i \neq j` and :math:`\rho_{ij}` is larger for more similar stocks. An example of this is the correlation between the returns of stocks :math:`i` and :math:`j`. But one could choose other similarity indices :math:`\rho_{ij}`.
es_un: Por ejemplo, :math:`\rho_{ii} = 1`, :math:`\rho_{ij} \leq 1` para :math:`i \neq j` y :math:`\rho_{ij}` es mayor para acciones más similares. Un ejemplo de esto es la correlación entre los rendimientos de las acciones :math:`i` y :math:`j`. Pero uno podría escoger otros índices de similitud :math:`\rho_{ij}`.
id_id: Sebagai contoh, :math:`\rho_{ii} = 1`, :math:`\rho_{ij} \leq 1` untuk :math:`i \neq j` dan :math:`\rho_{ij}` lebih besar daripada saham serupa. Contoh ini merupakan korelasi antara pengembalian saham :math:`i` and :math:`j`. Tetapi seseorang dapat memilih indeks kesamaan lainnya :math:`\rho_{ij}`.
ja_jp: 例えば、 :math:`i \neq j` とした場合、 :math:`\rho_{ii} = 1`, :math:`\rho_{ij} \leq 1` であるならば、 :math:`\rho_{ij}` は類似する銘柄ほど大きな値になります。 これは銘柄のリターン :math:`i` と :math:`j` の相関を表す場合に使うことができます。この時、別の類似性指数 :math:`\rho_{ij}` を選ぶこともできます。
pt_br: Por exemplo, :math:`\rho_{ii} = 1`, :math:`\rho_{ij} \leq 1` para :math:`i \neq j` e :math:`\rho_{ij}` é maior para ações mais similares. Um exemplo disso é a correlação entre os retornos das ações :math:`i` e :math:`j`. Mas poderíamos escolher outros índices de similaridade :math:`\rho_{ij}`.
ta_in: உதாரனத்திற்க்கு, :math:`\rho_{ii} = 1`, :math:`\rho_{ij} \leq 1` for :math:`i \neq j` and :math:`\rho_{ij}` போன்ற பங்குகளுக்கு இவை பெரியது. இதற்கு ஒரு எடுத்துக்காட்டு, பங்குகளின் வருமானத்திற்கும் இடையேயான தொடர்பு :math:`i` and :math:`j`. ஆனால் ஒருவர் மற்ற ஒற்றுமை குறியீடுகளை தேர்வு செய்யலாம் :math:`\rho_{ij}`.

source: The problem that we are interested in solving is:
es_un: El problema que nos interesa resolver es:
id_id: Masalah yang ingin kami pecahkan adalah:
ja_jp: 私たちが解決したい問題は次のとおりです。
ko_kr: 우리가 해결에 관심이 있는 문제는 다음과 같습니다.
pt_br: O problema que estamos interessados em resolver é:
ta_in: நான் தீர்க்க ஆர்வமாக உள்ள சிக்கல்:

source: subject to the clustering constraint:
es_un: sujeto a la restricción de agrupación:
id_id: Tunduk pada kendala pengelompokkan:
ja_jp: subject to the clustering constraint （クラスタリングの制約条件）:
ko_kr: 다음과 같이 클러스터링 제한조건에 적용됩니다.
pt_br: sujeito à seguinte restrição de clustering:
ta_in: clustering கட்டுப்பாட்டில் பொருள்:

source: to consistency constraints:
es_un: a las restricciones de consistencia:
id_id: untuk batasan konsistensi:
ja_jp: to consistency constraints（整合性の制約）:
ko_kr: 일관성 제한 조건:
pt_br: às restrições de consistência:
ta_in: ஒழுங்கற்ற கட்டுப்பாடுகள்:

source: and integral constraints:
es_un: y a las restricciones integrales:
id_id: dan batasan integral:
ja_jp: and integral constraints（および積分制約）:
ko_kr: 및 필수 제약 사항:
pt_br: e restrições integrais:
ta_in: மற்றும் ஆங்கில கட்டுப்பாடுகள்:

source: The variables :math:`y_j` describe which stocks :math:`j` are in the index fund (:math:`y_j = 1` if :math:`j` is selected in the fund, :math:`0` otherwise). For each stock :math:`i = 1,\dots,n`, the variable :math:`x_{ij}` indicates which stock :math:`j` in the index fund is most similar to :math:`i` (:math:`x_{ij} = 1` if :math:`j` is the most similar stock in the index fund, :math:`0` otherwise).
es_un: Las variables :math:`y_j` describen qué acciones :math:`j` están en el fondo indexado (:math:`y_j = 1` si :math:`j` está seleccionado en el fondo, :math:`0` de lo contrario). Para cada acción :math:`i = 1,\dots,n`, la variable :math:`x_{ij}` indica qué acción :math:`j` en el fondo indexado es más similar a :math:`i` (:math:`x_{ij} = 1` si :math:`j` es la acción más similar en el fondo indexado, :math:`0` en caso contrario).
id_id: Variabel :math:`y_j` menjelaskan saham yang mana :math:`j` termasuk dalam reksa dana indeks (:math:`y_j = 1` jika :math:`j` dipilih dalam reksa dana tersebut, :math:`0` sebaliknya). Untuk setiap saham :math:`i = 1,\dots,n`, variabel :math:`x_{ij}` mengindikasikan saham yang mana :math:`j` dalam dana indeks paling mirip dengan :math:`i` (:math:`x_{ij} = 1` jika :math:`j` adalah saham paling mirip di reksa dana indeks, :math:`0` sebaliknya).
ja_jp: 変数 :math:`y_j` は、どの銘柄 :math:`j` がインデックスファンドの中にあるかを表します (ファンドの中で :math:`j` が選択されている場合は :math:`y_j = 1` 、そうでない場合は :math:`0` )。各銘柄 :math:`i = 1,\dots,n`, について、変数 :math:`x_{ij}` は、どの銘柄 :math:`j` が :math:`i` とよく似ているのかを表します(インデックスファンド内で :math:`j` が最も似ている銘柄の場合は :math:`x_{ij} = 1` 、そうでない場合は :math:`0` )。
ko_kr: 변수 :math:`y_j` 는 인덱스 펀드에있는 주식 :math:`j` 를 설명한다 (펀드에서 :math:`y_j = 1` 가 선택된 경우 :math:`y_j = 1` , 아닐경우 :math:`0` ). 각 주식 :math:`i = 1, \dots,n`에 대해 변수 :math:`x_{ij}` 는 인덱스 펀드의 :math:`j`가 :math:`i`와 가장 유사한 주식을 나타냅니다. ( :math:`j` 가 인덱스 펀드에서 가장 유사한 주식이면 :math:`x_{ij} = 1` , 아닐경우 :math:`0` ).
pt_br: As variáveis :math:`y_j` descrevem quais ações :math:`j` estão no índice de fundos (:math:`y_j = 1` se :math:`j` estiver selecionado no fundo, :math:`0` caso contrário). Para cada ação :math:`i = 1,\dots,n`, a variável :math:`x_{ij}` indica qual ação :math:`j` no fundo do índice é mais semelhante a :math:`i` (:math:`x_{ij} = 1` se :math:`j` é a ação mais semelhante do índice de fundos, :math:`0` caso contrário).
ta_in: Variables :math: `y_j` எந்த பங்குகள் (:math:` j` index நிதியில் உள்ளன என்பதை விவரிக்கிறது). ஒவ்வொரு பங்குக்கும்:math: `i = 1 ,\dots,n`, variables :math:` x_ {ij} `எந்தப் பங்கைக் குறிக்கிறது:math: index நிதியில்` j` மிகவும் ஒத்துப் போகிறது:math: `i `(:math:` x_ {ij} = 1` if :math: `j` என்பது index நிதியில் மிகவும் ஒத்துப் போகும் பங்கு ,:math:` 0` இல்லையெனில்).

source: The first constraint selects :math:`q` stocks in the fund. The second constraint imposes that each stock :math:`i` has exactly one representative stock :math:`j` in the fund. The third and fourth constraints guarantee that stock :math:`i` can be represented by stock :math:`j` only if :math:`j` is in the fund. The objective of the model maximizes the similarity between the :math:`n` stocks and their representatives in the fund. Different cost functions can also be considered.
es_un: La primera restricción selecciona :math:`q` acciones del fondo. La segunda restricción impone que cada acción :math:`i` tiene exactamente una acción :math:`j` representativa en el fondo. La tercera y cuarta restricción garantizan que la acción :math:`i` puede ser representada por la acción :math:`j` solo si :math:`j` es parte del fondo. El objetivo del modelo maximiza la similitud entre las :math:`n` acciones y sus representativos del fondo. Distintas funciones de costo también pueden ser consideradas.
id_id: Batasan pertama memilih saham-saham :math:`q` dalam dana tersebut. Batasan kedua menetapkan bahwa setiap saham :math:`i` memiliki tepat satu saham representatif :math:`j` dalam dana tersebut. Batasan ketiga dan keempat memastikan bahwa saham :math:`i` dapat direpresentasikan oleh saham :math:`j` hanya jika :math:`j` berada dalam dana tersebut. Tujuan dari model memaksimalkan kemiripan antara saham-saham :math:`n` dan representasinya di dalam dana tersebut. Perbedaan fungsi biaya juga dapat dipertimbangkan.
ja_jp: 第一の制約は、ファンドの中で :math:`q` 株を選択します。第二の制約は、各株式 :math:`i` がファンド内に正確に 1 つの代表的な株式 :math:`j` を持つことを課します。第三の制約と第四の制約は、株式 :math:`j` がファンド内に存在する場合に限り、株式 :math:`j` が :math:`i` を代表することができることを保証します。モデルの目的は、ファンド内の :math:`n` 株とその代表株との類似性を最大化することで、異なるコスト関数も考慮することができます。
ko_kr: 첫 번째 제약은 펀드에서 :math:`q` 주식을 선택합니다. 두 번째 제약은 각 주식 :math:`i`가 펀드에 정확히 하나의 대표 주식 :math:`j`를 갖도록한다. 세 번째 및 네 번째 제약 조건은 펀드에 :math:`j`가있는 경우에만 주식 :math:`i`를 주식:math:`j`로 나타낼 수 있음을 보장한다. 모델의 목적은 :math:`n` 주식과 펀드의 대표자 간의 유사성을 극대화한다. 다른 비용 함수도 고려할 수 있다.
pt_br: A primeira restrição seleciona :math:`q` ações no fundo. A segunda restrição impõe que cada ação :math:`i` tenha exatamente uma ação representativa :math:`j` no fundo. A terceira e quarta restrições garantem que o estoque :math:`i` pode ser representado pelo estoque :math:`j` somente se :math:`j` estiver no fundo. O objetivo do modelo maximiza a semelhança entre os :math:`n` ações e seus representantes no fundo. As diferentes funções de custo também podem ser consideradas.
ta_in: முதலாவது கட்டுப்பாட்டை :math:` q ` ஸ்டாக் நிர்வாகத்தில் தேர்ந்தெடுக்கிறது. இரண்டாவது கட்டுப்பாடுகள் :math:` i ` க்கு சரியாக ஒரு பிரதிநிதி ஸ்டாக் :math:` j `. மூன்றாவது மற்றும் நான்காவது கட்டுப்பாடுகள் என்று உறுதிசெய்கிறது என்று ஸ்டாக் :math:` i ` க்குள் :math:` j ` க்கு மட்டுமே :math:` j `. மாதிரிகளின் உரிமைகள் :math:` n ` ஸ்டாக்ஸ் மற்றும் அவர்களின் பிரதிநிதிகளுக்கும் இடையிலான ஒத்திசைவு பெரிதாக்குகிறது. வெவ்வேறு செலவு செயல்பாடுகள் கூட கருதப்பட முடியும்.

source: Let us concatenate the decision variables in one vector
es_un: Concatenemos las variables de decisión en un vector
id_id: Mari kita gabungkan variabel keputusan dalam satu vektor
ja_jp: 決定変数を1つのベクトルに連結してみましょう。
ko_kr: 한 벡터에서 결정 변수를 연결하도록 합니다.
pt_br: Vamos concatenar as variáveis da decisão em um vetor
ta_in: ஒரு திசையனில் முடிவு variables ஐ ஒன்றிணைப்போம்

source: whose dimension is :math:`{\bf z} \in \{0,1\}^N`, with :math:`N = n (n+1)` and denote the optimal solution with :math:`{\bf z}^*`, and the optimal cost :math:`f^*`.
es_un: cuya dimensión es :math:`{\bf z} \in \{0,1\}^N`, with :math:`N = n (n+1)` y denota la solución óptima con :math:`{\bf z}^*`, y el costo óptimo :math:`f^*`.
id_id: yang dimensinya adalah :math:`{\bf z} \in \{0,1\}^N`, dengan :math:`N = n (n+1)` dan menyatakan solusi optimal dengan :math:`{\bf z}^*`, dan biaya optimal :math:`f^*`.
ja_jp: 次元が :math:`z\in\{0,1\}^N`, with :math:`N = n (n+1)` とし、最適解を :math:`z^*` 、 最適コスト :math:`f^*` とする。
ko_kr: 그의 치수는 :math:`{\bf z} \in \{0,1\}^N` , :math:`N = n (n+1)` 이고, 최적의 솔루션을 :math:`{\bf z}^*` 로 표시하고 최적의 비용은 :math:`f^*` 이다.
pt_br: cuja dimensão é :math:`{\bf z} \in \{0,1\}^N`, com :math:`N = n (n+1)` e denotar a solução ideal com :math:`{\bf z}^*`, e o custo ideal :math:`f^*`.
ta_in: ஒருவரின் பரிமாணம் :math:` {\bf z} \in\{0, 1\} ^ N `, with :math:` N = n (n + 1) ` மற்றும் உகந்த தீர்வைக் குறிக்கவும் :math:` {\bf z} ^ * `, மற்றும் உகந்த செலவு :math:` f ^ * `.

source: A Hybrid Approach
es_un: Un Enfoque Híbrido
id_id: Pendekatan hybrid
ja_jp: ハイブリッドアプローチ
ko_kr: 하이브리드 접근법
pt_br: Uma Abordagem Híbrida
ta_in: ஒரு hybrid அணுகுமுறை

source: Here, we demonstrate an approach that combines classical and quantum computing steps, following the quantum approximate optimization approach of Farhi, Goldstone, and Gutmann (2014).
es_un: Aquí, demostramos un enfoque que combina los pasos de la computación clásica y cuántica, siguiendo el enfoque de optimización cuántica aproximada de Farhi, Goldstone y Gutmann (2014).
ta_in: ஃபார்ஹி, கோல்ட்ஸ்டோன் மற்றும் குட்மேன் (2014) ஆகியவற்றின் குவாண்டம் தோராயமான தேர்வுமுறை அணுகுமுறையைப் பின்பற்றி, கிளாசிக்கல் மற்றும் குவாண்டம் கம்ப்யூட்டிங் படிகளை இணைக்கும் அணுகுமுறையை இங்கே நாங்கள் நிரூபிக்கிறோம்.

source: Construct a binary polynomial optimization
es_un: Construir una optimización polinomial binaria
id_id: Membangun optimisasi polinomial biner
ja_jp: バイナリ多項式最適化の構築
ko_kr: 2진 다항식 최적화를 구성하기
pt_br: Construir uma otimização binária de polinômios
ta_in: Binary polynomial தேர்வுமுறையை உருவாக்குங்கள்

source: From :math:`(M)` one can construct a binary polynomial optimization with equality constraints only, by substituting the :math:`x_{ij} \leq y_j` inequality constraints with the equivalent equality constraints :math:`x_{ij} (1- y_j) = 0`. Then the problem becomes:
es_un: De :math:`(M)` uno puede construir una optimización polinomial binaria con restricciones de igualdad solamente, sustituyendo las restricciones de desigualdad :math:`x_{ij} \leq y_j` con las restricciones de igualdad equivalentes :math:`x_{ij} (1- y_j) = 0`. Entonces el problema se convierte en:
id_id: Dari :math:`(M)` seseorang dapat membangun sebuah optimasi polinomial biner dengan batasan persamaan saja, dengan mensubstitusikan batasan pertidaksamaan :math:`x_{ij}\leq y_j` dengan batasan persamaan :math:`x_{ij} (1- y_j) = 0` yang ekivalen. Maka permasalahannya menjadi:
ja_jp: :math:`(M)` から、 :math:`x_{ij} \leq y_j` 不等式制約を、等価な等式制約 :math:`x_{ij} (1- y_j) = 0` に置き換えることで、等式制約のみを持つ二項式最適化を構築することができます。 すると、問題は次のようになります。
ko_kr: :math:`(M)` 로부터, 동등한 동등한 동등 제약 조건 :math:`x_{ij} (1- y_j) = 0`을 이용하여 :math:`x_{ij} \leq y_j` 부등식을 치환함으로써, 등식 제약만으로 2진 다항식 최적화를 구성할 수 있다.
pt_br: A partir de :math:`(M)` pode-se construir uma otimização polinomial binária com restrições de igualdade apenas, por substituir as restrições de desigualdade :math:`x_{ij} \leq y_j` com as restrições de igualdade equivalentes :math:`x_{ij} (1- y_j) = 0`. Então, o problema torna-se:
ta_in: :math:` (M) ` இல் இருந்து :math: `x_ {ij} \ q leq y_j` சமத்துவமின்மை கட்டுப்பாடுகள் சமமான சமத்துவக் கட்டுப்பாடுகளுடன் மாற்றுவதன் மூலம் மட்டுமே சமத்துவக் கட்டுப்பாடுகளுடன் ஒரு binary constraints தேர்வுமுறையை உருவாக்க முடியும். :math:`x_{ij} (1-y_j) = 0. பிறகு இந்த பிரச்சனை இவ்வாறு போகும்:

source: subject to the clustering constraint, the integral constraints, and the following modified consistency constraints:
es_un: sujetos a la restricción de agrupación, las restricciones integrales y las siguientes restricciones de consistencia modificadas:
id_id: tunduk pada batasan clustering, batasan integral, dan batasan konsistensi yang dimodifikasi berikut:
ja_jp: クラスタリング制約、積分制約、および次の修正された整合性制約に従います。
ko_kr: 클러스터링(clustering) 제한조건, 통합(integral) 제한조건 및 다음 수정된 일관성 제한조건에 종속된다.
pt_br: sujeito às restrições de agrupamento, às restrições integrais, e às seguintes restrições de consistência modificadas:
ta_in: clustering கட்டுப்பாடுகள், ஒருங்கிணைந்த கட்டுப்பாடுகள், மற்றும் பின்வரும் திருத்தப்பட்ட தொடக்க கட்டுப்பாடுகள்:

source: Construct the Ising Hamiltonian
es_un: Construir el Hamiltoniano de Ising
id_id: Membangun Hamiltonian Ising
ja_jp: イジング・ハミルトニアンの構築
ko_kr: 이징 해밀턴 (Ising Hamiltonian)을 구성하다.
pt_br: Construa o Ising Hamiltonian
ta_in: Ising Hamiltonian உருவாக்கு

source: We can now construct the Ising Hamiltonian (QUBO) by penalty methods (introducing a penalty coefficient :math:`A` for each equality constraint) as
es_un: Ahora podemos construir el Hamiltoniano de Ising (QUBO) por métodos de penalización (introduciendo un coeficiente de penalización :math:`A` por cada restricción de igualdad) como
id_id: Kita sekarang dapat membangun Hamiltonian Ising (QUBO) dengan metode hukuman (memperkenalkan koefisien penalti :math:` A ` untuk setiap batasan kesetaraan) sebagai
ja_jp: これで、イジング・ハミルトニアン(QUBO)をペナルティメソッド(各等価性制約に対してペナルティ係数 :math:`A` を導入)で次のように構成することができるようになりました。
ko_kr: 이제 다음과 같이 페널티 방법 (각각의 평등 제약에 대한 페널티 계수 :math:`A` 를 도입함) 에 의해 이징 해밀토니언 (QUBO) 을 구성할 수 있다.
pt_br: Agora podemos construir um Ising Hamiltonian (QUBO) por métodos de penalização (introduzindo um coeficiente de penalidade :math:`A` para cada restrição de igualdade) como
ta_in: நாம் இப்போது இசைங் ஹாமில்டோனியன் (QUBO) தண்டனி முறைகளால் உருவாக்க முடியும் (ஒவ்வொரு சமத்துவம் கட்டுப்பாட்டுக்களுக்கு ஒரு தண்டனையை அறிமுகம் செய்யவும் :math:` A `)

source: From Hamiltonian to Quadratic Programming (QP) formulation
es_un: Del Hamiltoniano a la formulación de Programación Cuadrática (Quadratic Programming, QP)
id_id: Dari Hamiltonian ke formulasi Quadratic Programming (QP)
ja_jp: ハミルトニアンから二次計画法（QP）定式化へ
ko_kr: 해밀토니언에서 이차의 프로그래밍 (QP) 형성
pt_br: Da formulação de Hamiltonian para Quadratic Programming (QP)
ta_in: Hamiltonian இருந்து Quadratic Programming (QP) வடிவம்

source: In the vector :math:`{\bf z}`, the Ising Hamiltonian elements can be rewritten as follows,
es_un: En el vector :math:`{\bf z}`, los elementos del Hamiltoniano de Ising pueden ser reescritos de la siguiente manera,
id_id: Dalam vektor :math:`{\bf z}`, elemen Hamiltonian Ising dapat ditulis ulang sebagai berikut,
ja_jp: ベクトル :math:`z` では、イジング・ハミルトニアンの要素を次のように書き換えることができます。
ko_kr: 벡터 :math:`{\bf z}` 에서, 이징 해밀토니언 요소는 다음과 같이 재기록될 수 있다.
pt_br: No vetor :math:`{\bf z}`, os elementos Ising Hamiltonian podem ser reescritos da seguinte forma,
ta_in: வெக்டர் :math:` {\bf z} `, Ising Hamiltonian elements பின்வருமாறு எழுதப்பட முடியும்,

source: First term:
es_un: Primer término:
id_id: Term pertama:
ja_jp: 最初の項：
ko_kr: 첫 번째 용어:
pt_br: Primeiro termo:
ta_in: முதல் term:

source: Second term:
es_un: Segundo término:
id_id: Term kedua:
ja_jp: 第二の項：
ko_kr: 두 번째 용어:
pt_br: Segundo termo:
ta_in: இரண்டாம் term:

source: Third term:
es_un: Tercer término:
id_id: Term ketiga:
ja_jp: 第三の項：
ko_kr: 세번째 용어:
pt_br: Terceiro termo:
ta_in: மூன்றாம் term:

source: which is equivalent to:
es_un: que es equivalente a:
id_id: yang setara dengan:
ja_jp: これは、以下と同等です：
ko_kr: 이는 다음과 같습니다:
pt_br: que é equivalente a:
ta_in: இது சமமானது:

source: Fourth term:
es_un: Cuarto término:
id_id: Term keempat:
ja_jp: 第四の項：
ko_kr: 네번째 용어:
pt_br: Quarto termo:
ta_in: நான்காவது term:

source: Fifth term:
es_un: Quinto término:
id_id: Term kelima:
ja_jp: 第五の項：
ko_kr: 다섯번째 용어::
pt_br: Quinto termo:
ta_in: ஐந்தாம் term:

source: Therefore, the formulation becomes,
es_un: Por lo tanto, la formulación se convierte en,
id_id: Oleh karena itu, formulasinya menjadi,
ja_jp: これにより、定式化は以下のようになります。
ko_kr: 따라서, 형태는 다음과 같이 된다:
pt_br: Portanto, a formulação torna-se,
ta_in: எனவே, formulation இவ்வாறு,

source: which can be passed to the variational quantum eigensolver.
es_un: que se puede pasar al solucionador propio variacional cuántico.
id_id: yang dapat diteruskan ke eigensolver kuantum variasional.
ja_jp: これは変分量子固有ソルバーに渡すことができます。
ko_kr: 이는 variational quantum eigensolver에 전달될 수 있다.
pt_br: que pode ser passado para o variational quantum eigensolver.
ta_in: இது வேற்றுமை கோட்பாடு variational quantum eigensolver க்கு pass செய்ய முடியும்.

source: References
es_un: Referencias
id_id: Daftar pustaka
ja_jp: 参考文献
ko_kr: 참조
pt_br: Referências

source: The Implementation
es_un: La Implementación
id_id: Implementasi
ja_jp: 実装
ko_kr: 구현
pt_br: A Implementação
ta_in: செயல்படுத்துதல்
