Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/finance/03_european_call_option_pricing.po
Languages: es_un, fr_fr, id_id, pt_br, ta_in

source: This page was generated from `tutorials/finance/03_european_call_option_pricing.ipynb`__.
es_un: Esta página fue generada a partir de `tutorials/finance/03_european_call_option_pricing.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/finance/3_european_call_option_pricing.ipynb`__.
id_id: Halaman ini dihasilkan dari `tutorials/finance/01_portfolio_optimization.ipynb`__.
pt_br: Esta página foi gerada a partir de `tutorials/finance/03_european_call_option_pricing.ipynb`__.
ta_in: இந்த பக்கம் ` tutorials/finance/01_portfolio_optimization.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/03_european_call_option_pricing.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/03_european_call_option_pricing.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/03_european_call_option_pricing.ipynb>`_.
id_id: Jalankan secara interaktif di 'IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/01_portfolio_optimization.ipynb>`_.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/03_european_call_option_pricing.ipynb>`_.
ta_in: `IBM குவாண்டம் ஆய்வகத்தில் ஊடாடும் வகையில் இயக்கவும் <https://quantum-computing.ibm.com/jupyter/tutorial/finance/04_european_put_option_pricing.ipynb>`_.

source: *Pricing European Call Options*
es_un: *Fijación de Precios de Opciones de Compra Europeas*
fr_fr: **Prix des options d'achat européennes**
pt_br: *Precificando Opções de Compra Europeias*

source: Introduction
es_un: Introducción
id_id: Pendahuluan
pt_br: Introdução
ta_in: முன்னுரை

source: Suppose a European call option with strike price :math:`K` and an underlying asset whose spot price at maturity :math:`S_T` follows a given random distribution. The corresponding payoff function is defined as:
es_un: Suponga una opción de compra europea con precio de ejercicio :math:`K` y un activo subyacente cuyo precio al contado al vencimiento :math:`S_T` sigue una distribución aleatoria dada. La función de rendimiento correspondiente se define como:
fr_fr: Supposons une option d'achat européenne avec un prix d'exercice :math:`K` et un actif sous-jacent dont le prix au comptant à l'échéance :math:`S_T` suit une distribution aléatoire donnée. La fonction de gain correspondante est définie comme suit:
id_id: Misalkan sebuah opsi panggilan Eropa dengan harga strike :math:` K ` dan aset pokok yang harga tunai pada saat puncak :math:` S_T ` mengikuti distribusi acak yang telah diberikan. Fungsi payoff yang sesuai didefinisikan sebagai:
pt_br: Suponha uma opção de compra Europeia com preço contratado :math:`K` e um ativo subjacente cujo preço à vista na maturidade :math:`S_T` segue uma determinada distribuição aleatória. A função de pagamento correspondente é definida como:
ta_in: வேலைநிறுத்த விலையுடன் ஒரு ஐரோப்பிய அழைப்பு விருப்பத்தை வைத்துக்கொள்வோம் :math:`K` மற்றும் முதிர்ச்சியடைந்த இடத்தின் விலை :math:`S_T` கொடுக்கப்பட்ட சீரற்ற பகிர்ந்தளித்தல் ஐப் பின்பற்றுகிறது. தொடர்புடைய செலுத்துதல் செயல்பாடு பின்வருமாறு வரையறுக்கப்படுகிறது:

source: In the following, a quantum algorithm based on amplitude estimation is used to estimate the expected payoff, i.e., the fair price before discounting, for the option:
es_un: En lo siguiente, se utiliza un algoritmo cuántico basado en la estimación de amplitud para estimar el rendimiento esperado, es decir, el precio justo antes del descuento, para la opción:
fr_fr: Dans ce qui suit, un algorithme quantique basé sur l'estimation d'amplitude est utilisé pour évaluer le gain attendu, c'est-à-dire le juste prix avant remise, pour l'option :
id_id: Pada bagian berikut, sebuah algoritma kuantum yang berdasarkan estimasi amplitudo digunakan untuk memperkirakan payoff yang diharapkan, yaitu harga promosi sebelum mendapat diskon, untuk pilihan:
pt_br: A seguir, um algoritmo quântico baseado na estimativa de amplitude é usado para estimar o pagamento esperado, por exemplo, o preço justo antes de desconto, para a opção:
ta_in: பின்வருவனவற்றில்,எதிர்பார்த்த ஊதியத்தை மதிப்பிடுவதற்கு வீச்சு மதிப்பீட்டின் அடிப்படையில் ஒரு குவாண்டம் வழிமுறை பயன்படுத்தப்படுகிறது,அதாவது, தள்ளுபடிக்கு முன் நியாயமான விலை, விருப்பத்திற்கு:

source: as well as the corresponding :math:`\Delta`, i.e., the derivative of the option price with respect to the spot price, defined as:
es_un: así como la correspondiente :math:`\Delta`, es decir, el derivado del precio de la opción con respecto al precio al contado, definido como:
fr_fr: ainsi que le :math:`\Delta` résultant, c'est-à-dire la différence entre le prix de l'option et le prix au comptant, défini comme :
id_id: serta yang sesuai dengan :math:` \Delta `, yaitu, turunan dari harga opsi sehubungan dengan harga tunai, yang didefinisikan sebagai:
pt_br: bem como o correspondente :math:`\Delta`, ou seja, a derivada do preço de opção no que diz respeito ao preço à vista, definida como:
ta_in: அத்துடன் தொடர்புடையது:math:'\Delta`,அதாவது, விலையைப் பொறுத்து விருப்ப விலையின் வழித்தோன்றல்,என வரையறுக்கப்படுகிறது:

source: The approximation of the objective function and a general introduction to option pricing and risk analysis on quantum computers are given in the following papers:
es_un: La aproximación de la función objetivo y una introducción general a la fijación de precios de opciones y el análisis de riesgos en computadoras cuánticas se dan en los siguientes artículos:
fr_fr: L'approximation de la fonction objectif et une introduction générale à la tarification des options et à l'analyse des risques sur les ordinateurs quantiques sont données dans les articles suivants :
id_id: Pendekatan fungsi objektif dan pengenalan umum untuk opsi penentuan harga dan analisis risiko pada komputer kuantum diberikan dalam jurnal berikut:
pt_br: A aproximação da função objetivo e uma introdução geral aos preços de opção e à análise de risco nos computadores quânticos são indicadas nos seguintes documentos:
ta_in: புறநிலை செயல்பாட்டின் தோராயமும் குவாண்டம் கணினிகளில் விருப்பத்தேர்வு விலை மற்றும் இடர் பகுப்பாய்விற்கான பொதுவான அறிமுகமும் பின்வரும் ஆவணங்களில் கொடுக்கப்பட்டுள்ளன:

source: Option Pricing using Quantum Computers. Stamatopoulos et al. 2019.
pt_br: Precificação de Opções utilizando Computadores Quânticos. Stamatopoulos et al. 2019.
ta_in: விருப்பத்தேர்வு குவாண்டம் கணினி பயன்படுத்தப்படுகிறது. Stamatopoulos et al. 2019.

source: Uncertainty Model
es_un: Modelo de Incertidumbre
fr_fr: Modèle d'incertitude
id_id: Model Ketidakpastian
pt_br: Modelo de Incerteza
ta_in: நிச்சயமற்ற மாதிரி

source: We construct a circuit factory to load a log-normal random distribution into a quantum state. The distribution is truncated to a given interval :math:`[\text{low}, \text{high}]` and discretized using :math:`2^n` grid points, where :math:`n` denotes the number of qubits used. The unitary operator corresponding to the circuit factory implements the following:
es_un: Construimos una fábrica de circuitos para cargar una distribución aleatoria logarítmica normal en un estado cuántico. La distribución se trunca a un intervalo dado :math:`[\text{low}, \text{high}]` y discretiza usando una cuadrícula con :math:`2^n` puntos, donde :math:`n` denota el número de qubits utilizados. El operador unitario correspondiente a la fábrica de circuitos implementa lo siguiente:
fr_fr: Nous construisons un circuit afin de représenter une distribution aléatoire en log-normale dans un état quantique. La distribution est limitée à l'intervalle :math:`[\text{low}, \text{high}]` et rendue discrète en utilisant :math:`2^n` points, où :math:`n` correspond au nombre de qubits utilisés. L'opérateur unitaire correspondant à ce circuit respecte la relation suivante :
id_id: Kami membangun sebuah pabrik sirkuit untuk memuat log-normal distribusi acak menjadi sebuah state kuantum. Distribusi ini dipotong ke interval yang diberikan :math:` [\text{low}, \text{high}] ` dan tdidiskritkan menggunakan :math:` 2 ^ n ` grid poin, di mana :math:` n ` menandakan jumlah qubits yang digunakan. Operator uniter yang sesuai dengan pabrik sirkuit mengimplementasikan hal-hal berikut:
pt_br: Construímos uma fábrica de circuitos para carregar uma distribuição aleatória log-normal em um estado quântico. A distribuição é truncada para um determinado intervalo :math:`[\text{low}, \text{high}]` e discretizada utilizando uma grade de :math:`2^n` pontos, onde :math:`n` denota o número de qubits usados. O operador unitário correspondente à fábrica de circuitos implementa o seguinte:
ta_in: ஒரு பதிவு-சாதாரண சீரற்ற விநியோகத்தை ஒரு குவாண்டம் நிலையில் ஏற்றுவதற்கு ஒரு சுற்று தொழிற்சாலையை உருவாக்குகிறோம்.ஒரு குறிப்பிட்ட இடைவெளியில் விநியோகம் துண்டிக்கப்படுகிறது:math:`[\text{low}, \text{high}]` மற்றும் தனிப்பயனாக்கப்பட்டது:math:`2^n`கட்டம் புள்ளிகள், அங்கு:math:`n` பயன்படுத்தப்படும் குவிட்களின் எண்ணிக்கையைக் குறிக்கிறது.சுற்று தொழிற்சாலைக்கு ஒத்த ஒற்றுமை ஆபரேட்டர் பின்வருவனவற்றை செயல்படுத்துகிறது:

source: where :math:`p_i` denote the probabilities corresponding to the truncated and discretized distribution and where :math:`i` is mapped to the right interval using the affine map:
es_un: donde :math:`p_i` denota las probabilidades correspondientes a la distribución truncada y discretizada y donde :math:`i` está asignado al intervalo correcto utilizando la asignación afín:
fr_fr: où les :math:`p_i` représentent les probabilités de la distribution tronquée et discrétisée et où les :math:`i` sont mappés sur l'intervalle approprié en utilisant la carte affine suivante :
id_id: di mana :math:` p_i ` menunjukkan probabilitas yang sesuai dengan distribusi yang dipotong dan didiskritkan dan di mana :math:` i ` dipetakan ke interval yang tepat menggunakan peta affine:
pt_br: onde :math:`p_i` denota as probabilidades correspondentes à distribuição truncada e discretizada e onde :math:`i` é mapeado para o intervalo correto utilizando o mapeamento afim:
ta_in: எங்கே:math:`p_i` துண்டிக்கப்பட்டவற்றுடன் தொடர்புடைய நிகழ்தகவுகளைக் குறிக்கவும் மற்றும் தனிப்பயனாக்கப்பட்ட விநியோகம் மற்றும் எங்கே:math:`i` அஃபைன் வரைபடத்தைப் பயன்படுத்தி சரியான இடைவெளியில் மேப் செய்யப்படுகிறது:

source: Payoff Function
es_un: Función de Rendimiento
fr_fr: Fonction de gain
id_id: Fungsi Payoff
pt_br: Função de Payoff
ta_in: செலுத்துதல் செயல்பாடு

source: The payoff function equals zero as long as the spot price at maturity :math:`S_T` is less than the strike price :math:`K` and then increases linearly. The implementation uses a comparator, that flips an ancilla qubit from :math:`\big|0\rangle` to :math:`\big|1\rangle` if :math:`S_T \geq K`, and this ancilla is used to control the linear part of the payoff function.
es_un: La función de rendimiento es igual a cero mientras el precio de contado al vencimiento :math:`S_T` es menor al precio de ejercicio :math:`K` y luego se incrementa linealmente. La implementación utiliza un comparador, que cambia un qubit ancilla de :math:`\big|0\rangle` a :math:`\big|1\rangle` si :math:`S_T \geq K`, y esta ancilla se utiliza para controlar la parte lineal de la función de recompensa.
fr_fr: La fonction de gain est nulle tant que la somme des prix au comptant à l'échéance :math:`S_T` est inférieure au prix d'exercice :math:`K` puis cette fonction augmente linéairement. Cette implémentation repose sur un comparateur qui modifie un qubit ancillaire de :math:`\big|0\rangle` à :math:`\big|1\rangle` si :math:`S_T \geq K` , puis cet ancillaire est utilisé pour contrôler la partie linéaire de la fonction de gain.
id_id: Fungsi payoff sama dengan nol asalkan harga tunai pada puncak :math:` S_T ` kurang dari harga strike :math:` K ` dan kemudian meningkat linearly. Implementasi ini menggunakan komparator, yang membalik qubit ancilla dari :math:` \big | 0\rangle ` ke :math:` \big | 1\rangle ` jika :math:` S_T \geq K `, dan ancilla ini digunakan untuk mengontrol bagian linear dari fungsi payoff.
pt_br: A função de Payoff é igual a zero enquanto o preço à vista na maturidade :math:`S_T` for menor do que o preço acordado :math:`K` e então aumentar o valor de forma linear. A implementação usa um comparador, que vira um qubit de ancila de :math:`\big|0\rangle` to :math:`\big|1\rangle` if :math:`S_T \geq K`, e este ancila é usado para controlar a parte linear da função de payoff.
ta_in: முதிர்ச்சியில் ஸ்பாட் விலை இருக்கும் வரை செலுத்துதல் செயல்பாடு பூஜ்ஜியத்திற்கு சமம்:math:`S_T`வேலைநிறுத்த விலையை விட குறைவாக உள்ளது:math:`K_1`,பின்னர் நேர்கோட்டுடன் அதிகரிக்கிறது, மேலும் அவை கட்டுப்படுத்தப்படுகின்றன.செயல்படுத்தல் இரண்டு ஒப்பீட்டாளர்களைப் பயன்படுத்துகிறது,ஒவ்வொன்றிலிருந்தும் ஒரு ஆங்கில்லா குவிட் ஐ புரட்டுகிறது:math:`\big|0\rangle` to :math:`\big|1\rangle` if :math:`S_T \geq K_1` மற்றும் ஆங்கில்லா குவிட் செலுத்துதல் செயல்பாட்டின் linear பகுதியைக் கட்டுப்படுத்த இந்த துணைக்கள் பயன்படுத்தப்படுகின்றன.

source: The linear part itself is then approximated as follows. We exploit the fact that :math:`\sin^2(y + \pi/4) \approx y + 1/2` for small :math:`|y|`. Thus, for a given approximation rescaling factor :math:`c_\text{approx} \in [0, 1]` and :math:`x \in [0, 1]` we consider
es_un: La parte lineal en sí es entonces aproximada de la siguiente manera. Explotamos el hecho de que :math:`\sin^2(y + \pi/4) \approx y + 1/2` para pequeños :math:`|y|`. Por lo tanto, para un factor de reescalado de aproximación dado :math:`c_\text{approx} \in [0, 1]` y :math:`x \in [0, 1]` consideramos
fr_fr: La partie linéaire proprement dite suit l'approximation ci-dessous. On exploite le fait que :math:`\sin^2(y + \pi/4) \approx y + 1/2` lorsque :math:`|y|` est petit. Ainsi, pour un facteur d'échelle d'approximation :math:`c_\text{approx} \in [0, 1]` et :math:`x \in [0, 1]` on considère
id_id: Bagian linear itu sendiri kemudian diperkirakan sebagai berikut. Kita memanfaatkan fakta bahwa :math:` \sin ^ 2 (y + \pi/4) \approx y + 1/2 ` for small :math:` |y | `. Dengan demikian, untuk faktor skala perkiraan yang diberikan :math:` c_\text{approx} \in [0, 1] ` dan :math:` x \in [0, 1] ` kita mempertimbangkan
pt_br: A própria parte linear é então aproximada da seguinte maneira. Exploramos o fato de que :math:`\sin^2(y + \pi/4) \approx y + 1/2` para :math:`|y|` pequeno. Assim, para um dado fator de reescalonamento de aproximação :math:`c_\text{approx} \in [0, 1]` e :math:`x \in [0, 1]` consideramos
ta_in: அவர் நேரியல் பகுதி பின்வருமாறு தோராயமாக மதிப்பிடப்படுகிறது. உண்மையை நாங்கள் சுரண்டிக்கொள்கிறோம்:math:`\sin^2(y + \pi/4) \approx y + 1/2` for small :math:`|y|`.எனவே, கொடுக்கப்பட்ட தோராயத்தை மீட்டெடுக்கும் அளவிடுதல் காரணிக்கு:math:`c_\text{approx} \in [0, 1]` and :math:`x \in [0, 1]`நாங்கள் கருதுகிறோம்

source: We can easily construct an operator that acts as
es_un: Podemos construir fácilmente un operador que actúe como
fr_fr: Nous pouvons facilement construire un opérateur qui agit ainsi :
id_id: Kita dapat dengan mudah membangun sebuah operator yang bertindak sebagai
pt_br: Podemos facilmente construir um operador que atua como
ta_in: ஒரு ஆபரேட்டரை நாம் எளிதாக உருவாக்க முடியும் ஆக செயல்படும்

source: using controlled Y-rotations.
es_un: utilizando rotaciones Y controladas.
fr_fr: en utilisant des rotation Y-contrôlées.
id_id: menggunakan kontrol Y-rotasi.
pt_br: usando rotações Y controladas.
ta_in: கட்டுப்படுத்தப்பட்ட Y- சுழற்சிகளைப் பயன்படுத்துதல்.

source: Eventually, we are interested in the probability of measuring :math:`\big|1\rangle` in the last qubit, which corresponds to :math:`\sin^2(a*x+b)`. Together with the approximation above, this allows to approximate the values of interest. The smaller we choose :math:`c_\text{approx}`, the better the approximation. However, since we are then estimating a property scaled by :math:`c_\text{approx}`, the number of evaluation qubits :math:`m` needs to be adjusted accordingly.
es_un: Eventualmente, estamos interesados en la probabilidad de medir :math:`\big|1\rangle` en el último qubit, que corresponde a :math:`\sin^2(a*x+b)`. Junto con la aproximación anterior, esto permite aproximar los valores de interés. Cuanto más pequeño :math:`c_\text{approx}` elijamos, mejor será la aproximación. Sin embargo, dado que luego estamos estimando una propiedad escalada por :math:`c_\text{approx}`, el número de qubits de evaluación :math:`m` necesita ser ajustado como corresponde.
fr_fr: Il est aussi intéressant de connaitre la probabilité de mesurer :math:`\big|1\rangle` sur le dernier qubit, correspondant à :math:`\sin^2(a*x+b)`. En complément de l'approximation précédente, nous pouvons alors estimer la valeurs des intérêts. Plus :math:`c_\text{approx}` est choisi petit, meilleure est l'approximation. Cependant, puisque nous estimons une propriété dépendant de :math:`c_\text{approx}`, le nombre de qubits d'évaluation :math:`m` doit être choisi en conséquence.
id_id: Akhirnya, kita tertarik pada probabilitas untuk mengukur :math:` \big | 1\rangle ` di qubit terakhir, yang sesuai dengan :math:` \sin ^ 2 (a*x + b) `. Bersama dengan perkiraan di atas, hal ini memungkinkan untuk perkiraan nilai bunga. Semakin kecil kita memilih :math:` c_\text{approx}`, semakin baik perkiraan. Namun, karena kita kemudian memperkirakan sebuah properti yang discalakan oleh :math:` c_\text{approx}`, jumlah evaluasi qubit :math:` m ` ` perlu disesuaikan.
pt_br: Eventualmente, estamos interessados na probabilidade de medir :math:`\big|1\rangle` no último qubit, o que corresponde a :math:`\sin^2(a*x+b)`. Juntamente com a aproximação, acima, isto permite aproximar os valores de interesse. Quanto menor o :math:`c_\text{approx}` escolhido, melhor a aproximação. No entanto, uma vez que estamos estimando uma propriedade escalonada por :math:`c_\text{approx}` em seguida, o número de qubits de avaliação :math:`m` precisa ser ajustado de acordo.
ta_in: இறுதியில், அளவிடும் நிகழ்தகவில் நாங்கள் ஆர்வமாக உள்ளோம்:math:`\big|1\rangle`கடைசி குவிட்டில்,இது ஒத்துள்ளது:math:`\sin^2(a*x+b)`.மேலே உள்ள தோராயத்துடன், இது ஆர்வத்தின் மதிப்புகளை தோராயமாக மதிப்பிட அனுமதிக்கிறது.சிறியது நாம் தேர்வு செய்கிறோம்:math:`c_\text{approx}`,சிறந்த தோராயமான.எவ்வாறாயினும், அளவிடப்பட்ட ஒரு சொத்தை நாங்கள் மதிப்பிடுகிறோம் என்பதால்:math:`c_\text{approx}`, மதிப்பீட்டு வினாடிகளின் எண்ணிக்கை:math:`m` அதற்கேற்ப சரிசெய்யப்பட வேண்டும்.

source: For more details on the approximation, we refer to: Quantum Risk Analysis. Woerner, Egger. 2018.
es_un: Para más detalles sobre la aproximación, nos referimos a: Quantum Risk Analysis. Woerner, Egger. 2018.
fr_fr: Pour plus de détails sur l'approximation, nous nous référons à: Quantum Risk Analysis. Woerner, Egger. 2018.
id_id: Untuk pendekatan lebih jelasnya, kita mengacu pada: Quantum Risk Analysis. Woerner, Egger. 2018.
pt_br: Para mais detalhes sobre a aproximação podemos consultar: Quantum Risk Analysis. Woerner, Egger. 2018.
ta_in: தோராயமான விவரங்களுக்கு, நாங்கள் குறிப்பிடுவது: குவாண்டம் இடர் பகுப்பாய்வு. Woerner, Egger. 2018.

source: Evaluate Expected Payoff
es_un: Evaluar el Rendimiento Esperado
fr_fr: Evaluation du gain attendu
id_id: Evaluasi Hasil yang Diharapkan
pt_br: Avaliando o Payoff Esperado
ta_in: எதிர்பார்க்கப்படும் ஊதியத்தை மதிப்பிடுங்கள்

source: Instead of constructing these circuits manually, Qiskit’s finance module offers the ``EuropeanCallExpectedValue`` circuit, which already implements this functionality as building block.
es_un: En lugar de construir estos circuitos manualmente, el módulo de finanzas de Qiskit ofrece el circuito ``EuropeanCallExpectedValue``, que ya implementa esta funcionalidad como bloque de construcción.
fr_fr: Au lieu de construire ces circuits manuellement, le module finance de Qiskit propose le circuit ``EuropeanCallExpectedValue``, qui implémente déjà cette fonctionnalité en tant que bloc de construction.
id_id: Alih-alih membangun sirkuit ini secara manual, modul keuangan Qiskit menawarkan rangkaian ` ` EuropeanCallExpectedValue ` `, yang sudah menerapkan fungsi ini sebagai blok bangunan.
pt_br: Em vez de construir esses circuitos manualmente, o módulo Qiskit finance oferece o circuito ``EuropeanCallExpectedValue``, que já implementa esta funcionalidade como bloco de construção.
ta_in: இந்த சுற்றுகளை கைமுறையாக நிர்மாணிப்பதற்கு பதிலாக, Qiskit'டின் நிதி தொகுதி ``EuropeanCallExpectedValue `` சுற்றுவட்டத்தை வழங்குகிறது, இது ஏற்கனவே இந்த செயல்பாட்டை கட்டடத் தொகுதியாக செயல்படுத்துகிறது.

source: Evaluate Delta
es_un: Evaluar Delta
fr_fr: Evaluation du Delta
id_id: Mengevaluasi Delta
pt_br: Avaliar o Delta
ta_in: டெல்டாவை மதிப்பிடுங்கள்

source: The Delta is a bit simpler to evaluate than the expected payoff. Similarly to the expected payoff, we use a comparator circuit and an ancilla qubit to identify the cases where :math:`S_T > K`. However, since we are only interested in the probability of this condition being true, we can directly use this ancilla qubit as the objective qubit in amplitude estimation without any further approximation.
es_un: La Delta es un poco más simple de evaluar que el rendimiento esperado. De manera similar al rendimiento esperado, usamos un circuito comparador y un qubit ancilla para identificar los casos donde :math:`S_T > K`. Sin embargo, dado que solo nos interesa la probabilidad de que esta condición sea cierta, podemos usar directamente este qubit ancilla como el qubit objetivo en la estimación de amplitud sin ninguna aproximación adicional.
fr_fr: Le Delta est un peu plus simple à évaluer que la fonction de gain. Tout comme pour la fonction de gain, nous utilisons un circuit comparateur et un qubit ancillaire pour identifier les cas où :math:`S_T>K`. Cependant, puisque nous ne sommes intéressés que par la probabilité que cette condition soit vraie, nous pouvons utiliser le qubit ancillaire directement comme qubit objectif pour obtenir l'estimation d'amplitude sans approximations supplémentaires.
id_id: Delta sedikit lebih sederhana untuk dievaluasi daripada hasil yang diharapkan. Sama dengan hasil yang diharapkan, kami menggunakan sirkuit komparator dan sebuah ancilla qubit untuk mengidentifikasi kasus di mana :math:` S_T > K `. Namun, karena kita hanya tertarik pada kemungkinan kondisi ini benar, kita dapat langsung menggunakan ancilla qubit ini sebagai qubit objektif dalam estimasi amplitudo tanpa perkiraan lebih lanjut.
pt_br: O Delta é um pouco mais simples de avaliar do que o pagamento esperado. Da mesma forma que o pagamento esperado, usamos um circuito de comparador e um qubit ancila para identificar os casos onde :math:`S_T > K`. No entanto, uma vez que só estamos interessados em que seja verdade a probabilidade dessa condição ser verdadeira, podemos usar diretamente este ancila qubit como o qubit objetivo em estimativa de amplitude sem qualquer aproximação adicional.
ta_in: டெல்டா எதிர்பார்த்த ஊதியத்தை விட மதிப்பீடு செய்வது சற்று எளிது.இதேபோல் எதிர்பார்க்கப்படும் ஊதியம், வழக்குகளை அடையாளம் காண ஒரு ஒப்பீட்டாளர் சுற்று மற்றும் ஒரு துணை குவிட் ஆகியவற்றைப் பயன்படுத்துகிறோம்:math:`S_T \leq K`. இருப்பினும், இந்த நிலை உண்மையாக இருப்பதற்கான எதிர்மறை நிகழ்தகவில் மட்டுமே நாங்கள் ஆர்வமாக உள்ளதால், மேலதிக தோராயமின்றி வீச்சு மதிப்பீட்டில் புறநிலை குவிட்டாக இந்த துணை குவிட்டை நாம் நேரடியாகப் பயன்படுத்தலாம்.

source: Quantum Risk Analysis. Woerner, Egger. 2018.
ta_in: குவாண்டம் இடர் பகுப்பாய்வு. Woerner, Egger. 2018.

source: \mathbb{E}\left[ \max\{S_T - K, 0\} \right]
fr_fr: \mathbb{E}\left[ \max\{K - S_T, 0\} \right]
