Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/finance/04_european_put_option_pricing.po
Languages: fr_fr, id_id

source: This page was generated from `tutorials/finance/04_european_put_option_pricing.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/finance/04_european_put_option_pricing.ipynb`__.
id_id: Halaman ini dibuat dari ` tutorials/finance/04_european_put_option_pricing.ipynb ` __.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/04_european_put_option_pricing.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/04_european_put_option_pricing.ipynb>`_.
id_id: Jalankan secara interaktif dalam ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/04_european_put_option_pricing.ipynb>` _.

source: *Pricing European Put Options*
fr_fr: ** Tarification Options d'Achat Européenne * *
id_id: *Menilai Harga Opsi Jual Eropa*

source: Introduction
id_id: Pendahuluan

source: Suppose a European put option with strike price :math:`K` and an underlying asset whose spot price at maturity :math:`S_T` follows a given random distribution. The corresponding payoff function is defined as:
fr_fr: Supposons une option de vente européenne avec le prix d'exercice (strike) :math:`K` et un actif sous-jacent dont le prix spot à l'échéance :math:`S_T` suit une distribution aléatoire donnée. La fonction de paiement correspondante est définie comme :
id_id: Misalkan sebuah opsi jual Eropa dengan harga kesepakatan (strike price) :math:`K` dan sebuah aset pokok di mana harga tunai saat tanggal jatuh tempo (maturity) :math:`S_T` mengikuti sebuah distribusi acak. Fungsi hasil (payoff) yang terkait didefinisikan sebagai:

source: In the following, a quantum algorithm based on amplitude estimation is used to estimate the expected payoff, i.e., the fair price before discounting, for the option:
fr_fr: Dans ce qui suit, un algorithme quantique basé sur l'estimation d'amplitude est utilisé pour estimer le gain attendu, c'est-à-dire le juste prix avant remise, pour l'option :
id_id: Pada bagian berikut, sebuah algoritma kuantum yang berdasarkan estimasi amplitudo digunakan untuk memperkirakan payoff yang diharapkan, yaitu harga promosi sebelum mendapat diskon, untuk pilihan:

source: as well as the corresponding :math:`\Delta`, i.e., the derivative of the option price with respect to the spot price, defined as:
fr_fr: ainsi que le :math:"\Delta" correspondant, c'est-à-dire le dérivé du prix de l'option par rapport au prix au comptant, défini comme suit:
id_id: seperti :math:`\Delta` yang sesuai, yaitu turunan dari harga opsi sehubungan dengan harga tunai (spot price), yang didefinisikan sebagai:

source: The approximation of the objective function and a general introduction to option pricing and risk analysis on quantum computers are given in the following papers:
fr_fr: L'approximation de la fonction objectif et une introduction générale à la tarification des options et à l'analyse des risques sur les ordinateurs quantiques sont données dans les articles suivants :
id_id: Pendekatan fungsi obyektif dan pengenalan umum untuk penentuan harga opsi dan analisis risiko pada komputer kuantum diberikan dalam makalah-makalah berikut:

source: Option Pricing using Quantum Computers. Stamatopoulos et al.Â 2019.
id_id: Option Pricing using Quantum Computers. Stamatopoulos et al. 2019.

source: Uncertainty Model
fr_fr: Modèle d'Incertitude
id_id: Model Ketidakpastian

source: We construct a circuit factory to load a log-normal random distribution into a quantum state. The distribution is truncated to a given interval :math:`[\text{low}, \text{high}]` and discretized using :math:`2^n` grid points, where :math:`n` denotes the number of qubits used. The unitary operator corresponding to the circuit factory implements the following:
fr_fr: Nous construisons un circuit afin de représenter une distribution aléatoire en log-normale dans un état quantique. La distribution est limitée à l'intervalle :math:`[\text{low}, \text{high}]` et rendue discrète en utilisant :math:`2^n` points, où :math:`n` correspond au nombre de qubits utilisés. L'opérateur unitaire correspondant à ce circuit respecte la relation suivante :
id_id: Kita membangun sebuah pabrik rangkaian untuk memuat sebuah distribusi acak log-normal ke dalam sebuah keadaan kuantum. Distribusi ini dipotong ke dalam sebuah interval :math:`[\text{low}, \text{high}]` dan didiskritkan menggunakan :math:`2^n` titik jaringan, di mana :math:`n` menandakan jumlah kubit yang digunakan. Operator uniter yang sesuai dengan pabrik rangkaian tersebut mengimplementasikan hal-hal berikut:

source: where :math:`p_i` denote the probabilities corresponding to the truncated and discretized distribution and where :math:`i` is mapped to the right interval using the affine map:
fr_fr: où les :math:`p_i` représentent les probabilités de la distribution tronquée et discrétisée et où les :math:`i` sont mappés sur l'intervalle approprié en utilisant la carte affine suivante :
id_id: di mana :math:`p_i` menandakan probabilitas yang sesuai dengan distribusi yang telah dipotong dan didiskritkan dan di mana :math:`i` dipetakan ke interval yang sesuai menggunakan peta afin:

source: Payoff Function
fr_fr: Fonction de Paiement
id_id: Fungsi Hasil (Payoff)

source: The payoff function decreases linearly with an increasing spot price at maturity :math:`S_T` until it reaches zero for a spot price equal to the strike price :math:`K`, it stays constant to zero for larger spot prices. The implementation uses a comparator, that flips an ancilla qubit from :math:`\big|0\rangle` to :math:`\big|1\rangle` if :math:`S_T \leq K`, and this ancilla is used to control the linear part of the payoff function.
fr_fr: La fonction de paiement diminue linéairement avec une augmentation du prix spot à l'échéance de :math:`S_T` jusqu'à ce qu'elle atteigne zéro pour un prix spot égal au prix strike :math:`K`, Il reste constant à zéro pour des prix spot plus élevés. L'implémentation utilise un comparateur, qui retourne un qubit auxiliaire de :math:`\big|0\rangle` à :math:`\big|1\rangle` si :math:`S_T \leq K`, et cet auxiliaire est utilisé pour contrôler la partie linéaire de la fonction de paiement.
id_id: Fungsi payoff berkurang secara linear seiring meningkatnya harga tunai pada saat jatuh tempo :math:`S_T` hingga mencapai nol untuk sebuah harga tunai yang setara dengan harga kesepakatan :math:`K`, fungsi tersebut tetap konstan hingga nol untuk harga tunai yang lebih besar. Implementasinya menggunakan sebuah komparator, yang membalikkan sebuah kubit ancilla dari :math:`\big|0\rangle` menjadi :math:`\big|1\rangle` jika :math:`S_T \leq K`, dan ancilla ini digunakan untuk mengontrol bagian linear dari fungsi payoff tersebut.

source: The linear part itself is then approximated as follows. We exploit the fact that :math:`\sin^2(y + \pi/4) \approx y + 1/2` for small :math:`|y|`. Thus, for a given approximation rescaling scaling factor :math:`c_\text{approx} \in [0, 1]` and :math:`x \in [0, 1]` we consider
fr_fr: La partie linéaire proprement dite suit l'approximation ci-dessous. On exploite le fait que :math:`\sin^2(y + \pi/4) \approx y + 1/2` lorsque :math:`|y|` est petit. Ainsi, pour un facteur d'échelle d'approximation :math:`c_\text{approx} \in [0, 1]` et :math:`x \in [0, 1]` on considère
id_id: Bagian linear itu sendiri kemudian didekati sebagai berikut. Kita memanfaatkan fakta bahwa :math:`\sin^2(y + \pi/4) \approx y + 1/2` untuk :math:`|y|` yang kecil. Maka, untuk sebuah faktor penskalaan penyesuaian perkiraan :math:`c_\text{approx} \in [0, 1]` dan :math:`x \in [0, 1]` kita mempertimbangkan

source: \ for small :math:`c_\text{approx}`.
fr_fr: pour de petites valeurs de :math:`c_\text{approx}`.
id_id: untuk :math:` c_\text{approx}` yang kecil.

source: We can easily construct an operator that acts as
fr_fr: Nous pouvons facilement construire un opérateur qui agit ainsi
id_id: Kita dapat dengan mudah membangun sebuah operator yang bertindak sebagai

source: using controlled Y-rotations.
fr_fr: en utilisant des rotation Y-contrôlées.
id_id: menggunakan rotasi-Y yang terkontrol.

source: Eventually, we are interested in the probability of measuring :math:`\big|1\rangle` in the last qubit, which corresponds to :math:`\sin^2(a*x+b)`. Together with the approximation above, this allows to approximate the values of interest. The smaller we choose :math:`c_\text{approx}`, the better the approximation. However, since we are then estimating a property scaled by :math:`c_\text{approx}`, the number of evaluation qubits :math:`m` needs to be adjusted accordingly.
fr_fr: Il est aussi intéressant de connaitre la probabilité de mesurer :math:`\big|1\rangle` sur le dernier qubit, correspondant à :math:`\sin^2(a*x+b)`. En complément de l'approximation précédente, nous pouvons alors estimer la valeurs des intérêts. Plus :math:`c_\text{approx}` est choisi petit, meilleure est l'approximation. Cependant, puisque nous estimons une propriété dépendant de :math:`c_\text{approx}`, le nombre de qubits d'évaluation :math:`m` doit être choisi en conséquence.
id_id: Akhirnya, kita tertarik pada probabilitas untuk mengukur :math:` \big | 1\rangle ` di qubit terakhir, yang sesuai dengan :math:` \sin ^ 2 (a*x + b) `. Bersama dengan perkiraan di atas, hal ini memungkinkan untuk memperkirakan nilai bunga. Semakin kecil kita memilih :math:` c_\text{approx}`, semakin baik perkiraan. Namun, karena kita kemudian memperkirakan sebuah properti yang dickalakan oleh :math:` c_\text{approx}`, jumlah evaluasi evaluasi :math:` m ` ` perlu disesuaikan.

source: For more details on the approximation, we refer to: Quantum Risk Analysis. Woerner, Egger. 2018.
fr_fr: Pour plus de détails sur l'approximation, nous nous référons à: Quantum Risk Analysis. Woerner, Egger. 2018.
id_id: Untuk pendekatan lebih jelasnya, kita mengacu pada: Analisis Risiko Kuantum. Woerner, Egger. 2018.

source: Evaluate Expected Payoff
fr_fr: Evaluer le paiement attendu
id_id: Evaluasi Hasil yang Diharapkan

source: Evaluate Delta
fr_fr: Évaluer le Delta
id_id: Evaluasi Delta

source: The Delta is a bit simpler to evaluate than the expected payoff. Similarly to the expected payoff, we use a comparator circuit and an ancilla qubit to identify the cases where :math:`S_T \leq K`. However, since we are only interested in the (negative) probability of this condition being true, we can directly use this ancilla qubit as the objective qubit in amplitude estimation without any further approximation.
fr_fr: Le Delta est un peu plus simple à évaluer que la fonction de payement escomptée. De la même manière que les gains attendus, nous utilisons un circuit de comparateur et un qubit ancillaire pour identifier les cas où :math:`S_T \leq K`. Cependant, comme nous ne sommes intéressés que par la probabilité (négative) que cette condition soit vraie, nous pouvons directement utiliser ce qubit auxiliaire comme le qubit objectif dans l'estimation d'amplitude sans approximation supplémentaire.
id_id: Delta sedikit lebih sederhana untuk dinilai daripada hasil (payoff) yang diharapkan. Mirip seperti hasil yang diharapkan, kita menggunakan sebuah rangkaian pembanding dan sebuah kubit ancilla untuk mengidentifikasi kasus-kasus di mana :math:`S_T \leq K`. Namun, karena kita hanya tertarik pada probabilitas (negatif) di mana kondisi ini benar, kita dapat langsung menggunakan kubit ancilla ini sebagai kubit objektif dalam perkiraan amplituda tanpa pendekatan lebih lanjut.

source: Option Pricing using Quantum Computers. Stamatopoulos et al. 2019.
fr_fr: La tarification des options à l'aide des ordinateurs quantiques. Stamatopoulos et al. 2019.
