Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/finance/06_basket_option_pricing.po
Languages: id_id, ja_jp

source: This page was generated from `tutorials/finance/06_basket_option_pricing.ipynb`__.
id_id: Halaman ini dibuat dari `tutorials/finance/06_basket_option_pricing.ipynb`__.
ja_jp: 当ページは `tutorials/finance/06_basket_option_pricing.ipynb`__. から生成されました。

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/06_basket_option_pricing.ipynb>`_.
id_id: Jalankan secara interaktif dalam ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/06_basket_option_pricing.ipynb>` _.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/06_basket_option_pricing.ipynb>`_ でインタラクティブに実行します。

source: *Pricing Basket Options*
id_id: *opsi kalkulasi harga Basket*
ja_jp: *バスケット・オプションの価格推定*

source: Introduction
id_id: Pendahuluan
ja_jp: はじめに

source: Suppose a basket option with strike price :math:`K` and two underlying assets whose spot price at maturity :math:`S_T^1`, :math:`S_T^2` follow given random distributions. The corresponding payoff function is defined as:
id_id: Misalkan sebuah pilihan keranjang dengan harga strike :math:` K ` dan dua aset yang mendasari harga puncak :math:` S_T ^ 1 `, :math:` S_T ^ 2 ` mengikuti distribusi acak yang diberikan. Fungsi payoff yang sesuai didefinisikan sebagai:
ja_jp: 権利行使価格 :math:`K` で、２つの原資産の満期時のスポット価格 :math:`S_T^1`, :math:`S_T^2` がある確率分布に従うバスケット・オプションを考えます。その時のペイオフ関数は次のように定義されます：

source: In the following, a quantum algorithm based on amplitude estimation is used to estimate the expected payoff, i.e., the fair price before discounting, for the option:
id_id: Pada bagian berikut, sebuah algoritma kuantum yang berdasarkan estimasi amplitudo digunakan untuk memperkirakan payoff yang diharapkan, yaitu harga promosi sebelum mendapat diskon, untuk pilihan:
ja_jp: 以下では、振幅推定に基づく量子アルゴリズムを使用して、期待されるペイオフ、すなわちオプションの割引前の適正価格を見積もります。

source: The approximation of the objective function and a general introduction to option pricing and risk analysis on quantum computers are given in the following papers:
id_id: Pendekatan fungsi objektif dan pengenalan umum untuk opsi penentuan harga dan analisis risiko pada komputer kuantum diberikan dalam jurnal berikut:
ja_jp: 目的関数の近似と量子コンピューターによる一般的なオプション価格設定とリスク分析は、以下の論文で紹介されています。

source: Option Pricing using Quantum Computers. Stamatopoulos et al.Â 2019.
id_id: Option Pricing using Quantum Computers. Stamatopoulos et al. 2019.

source: Uncertainty Model
id_id: Model Ketidakpastian
ja_jp: 不確実性モデル

source: We construct a circuit factory to load a multivariate log-normal random distribution into a quantum state on :math:`n` qubits. For every dimension :math:`j = 1,\ldots,d`, the distribution is truncated to a given interval :math:`[\text{low}_j, \text{high}_j]` and discretized using :math:`2^{n_j}` grid points, where :math:`n_j` denotes the number of qubits used to represent dimension :math:`j`, i.e., :math:`n_1+\ldots+n_d = n`. The unitary operator corresponding to the circuit factory implements the following:
id_id: Kami membangun sebuah pabrik sirkuit untuk memuat log-normal multivariat distribusi acak ke dalam keadaan kuantum pada :math:` n ` qubits. Untuk setiap dimensi :math:` j = 1, \ldots, d `, distribusi ini dipotong ke interval tertentu :math:` [\text{low}_j, \text{high}_j] ` dan disosiasi menggunakan :math:` 2 ^{n_j}` titik kisi, di mana :math:` n_j ` menandakan jumlah qubits yang digunakan untuk mewakili dimensi :math:` j `, yaitu, :math:` n_1 + \ldots + n_d = n `. Operator uniter yang sesuai dengan pabrik sirkuit mengimplementasikan hal-hal berikut:
ja_jp: 多変量対数正規ランダム分布を :math:`n` 量子ビットの量子状態にロードする回路ファクトリを構築します。 すべての次元 :math:`j = 1,\ldots,d` について、分布は指定された区間 :math:`[\text{low}_j, \text{high}_j]` に切り捨てられ、 :math:`2^{n_j}` グリッドポイントを使用して離散化されます。ここで、 :math:`n_j` は次元 :math:`j` を表すために使用される量子ビットの数を示します。つまり :math:`n_1+\ldots+n_d = n` です。 回路ファクトリに対応するユニタリー演算子は、以下のように実装されます:

source: where :math:`p_{i_1\ldots i_d}` denote the probabilities corresponding to the truncated and discretized distribution and where :math:`i_j` is mapped to the right interval using the affine map:
id_id: di mana :math:`p_{i_1\ldots i_d}` ` menunjukkan probabilitas yang sesuai dengan distribusi yang dipotong dan didiskritkan dan di mana :math:`i_j` dipetakan ke interval yang tepat menggunakan peta affine:
ja_jp: ここで :math:`p_{i_1\ldots i_d}` は、切り捨てられ離散化された分布を与える確率を表し、 :math:`i_j` はアフィン写像で得られた正しい区間です。

source: For simplicity, we assume both stock prices are independent and identically distributed. This assumption just simplifies the parametrization below and can be easily relaxed to more complex and also correlated multivariate distributions. The only important assumption for the current implementation is that the discretization grid of the different dimensions has the same step size.
id_id: Untuk kesederhanaan, kita menganggap kedua harga saham tersebut independen dan identik didistribusikan. Asumsi ini hanya menyederhanakan parameter di bawah dan dapat dengan mudah dilonggarkan ke lebih kompleks dan juga terkorelasi distribusi multivariat. Satu-satunya asumsi yang penting untuk implementasi saat ini adalah bahwa grid discretization dari dimensi yang berbeda memiliki ukuran langkah yang sama.
ja_jp: 簡単のため、株価はどちらも独立同分布とします。この仮定は以下のパラメータ化を単純にするだけのものであり、簡単に緩和することができ、多変量分布でも関連します。現在の実装で唯一の重要な仮定は、異なる次元の離散化グリッドが同じステップサイズであるということです。

source: Payoff Function
id_id: Fungsi Payoff
ja_jp: ペイオフ関数

source: The payoff function equals zero as long as the sum of the spot prices at maturity :math:`(S_T^1 + S_T^2)` is less than the strike price :math:`K` and then increases linearly. The implementation first uses a weighted sum operator to compute the sum of the spot prices into an ancilla register, and then uses a comparator, that flips an ancilla qubit from :math:`\big|0\rangle` to :math:`\big|1\rangle` if :math:`(S_T^1 + S_T^2) \geq K`. This ancilla is used to control the linear part of the payoff function.
id_id: Fungsi payoff sama dengan nol selama jumlah spot price pada puncak :math:` (S_T ^ 1 + S_T ^ 2) ` kurang dari strike price :math:` K ` dan kemudian meningkat secara linear. Implementasi ini pertama kali menggunakan operator jumlah berbobot untuk menghitung jumlah spot price menjadi register ancilla, dan kemudian menggunakan pembanding, yang membalik sebuah ancilla qubit dari:math:`\big|0\rangle` ke :math:`\big|1\rangle` to :math:`\big|1\rangle` if :math:`(S_T^1 + S_T^2) \geq K`.`. Ancilla ini digunakan untuk mengendalikan linear dari fungsi payoff.
ja_jp: ペイオフ関数は、満期時のスポット価格合計 :math:`(S_T^1 + S_T^2)` が権利行使価格 :math:`K` よりも小さい間ゼロであり、その後線形に増加します。実装は、初め加重合計演算子で補助量子ビットにスポット価格の合計を計算し、その後コンパレーターを使用して、もし :math:`(S_T^1 + S_T^2) \geq K` ならば補助量子ビットを :math:`\big|0\rangle` から :math:`\big|1\rangle` にフリップします。この補助量子ビットはペイオフ関数の線形部分を制御するのに使われます。

source: The linear part itself is approximated as follows. We exploit the fact that :math:`\sin^2(y + \pi/4) \approx y + 1/2` for small :math:`|y|`. Thus, for a given approximation rescaling factor :math:`c_\text{approx} \in [0, 1]` and :math:`x \in [0, 1]` we consider
id_id: Bagian linear itu sendiri kemudian diperkirakan sebagai berikut. Kita memanfaatkan fakta bahwa :math:` \sin ^ 2 (y + \pi/4) \approx y + 1/2 ` for :math:` |y | ` yang kecil. Dengan demikian, untuk faktor skala perkiraan yang diberikan :math:` c_\text{approx} \in [0, 1] ` dan :math:` x \in [0, 1] ` kita mempertimbangkan
ja_jp: 線形部分自体は次のように近似されます。 小さい :math:`|y|` に対して :math:`\sin^2(y + \pi/4) \approx y + 1/2` という事実を利用します。 したがって、与えられた近似再スケーリング係数 :math:`c_\text{approx} \in [0, 1]` および :math:`x \in [0, 1]` に対して、次を考えます。

source: \ for small :math:`c_\text{approx}`.
id_id: untuk :math:` c_\text{approx}` yang kecil.
ja_jp: :math:`c_\text{approx}` は十分小さいものとします。

source: We can easily construct an operator that acts as
id_id: Kita dapat dengan mudah membangun operator yang bertindak sebagai
ja_jp: 次のように機能する演算子を簡単に構築できます

source: using controlled Y-rotations.
id_id: menggunakan kontrol Y-rotasi.
ja_jp: 制御 Y 回転を用いています。

source: Eventually, we are interested in the probability of measuring :math:`\big|1\rangle` in the last qubit, which corresponds to :math:`\sin^2(a*x+b)`. Together with the approximation above, this allows to approximate the values of interest. The smaller we choose :math:`c_\text{approx}`, the better the approximation. However, since we are then estimating a property scaled by :math:`c_\text{approx}`, the number of evaluation qubits :math:`m` needs to be adjusted accordingly.
id_id: Akhirnya, kita tertarik pada probabilitas untuk mengukur :math:` \big | 1\rangle ` di qubit terakhir, yang sesuai dengan :math:` \sin ^ 2 (a*x + b) `. Bersama dengan perkiraan di atas, hal ini memungkinkan untuk perkiraan nilai bunga. Semakin kecil kita memilih :math:` c_\text{approx}`, semakin baik perkiraan. Namun, karena kita kemudian memperkirakan sebuah properti yang diskalakan oleh :math:` c_\text{approx}`, jumlah evaluasi qubit :math:` m ` ` perlu disesuaikan.
ja_jp: 最終的には、 :math:`\sin^2(a*x+b)` に対応する最後の量子ビットで :math:`\big|1\rangle` を測定する確率に関心があります。 上記の近似と合わせて、対象の値を近似できます。小さい :math:`c_\text{approx}` を選択するほど、近似は良くなります。 ただし、 :math:`c_\text{approx}` でスケーリングされたプロパティを推定しているため、それに応じて評価量子ビットの数 :math:`m` を調整する必要があります。

source: For more details on the approximation, we refer to: Quantum Risk Analysis. Woerner, Egger. 2018.
id_id: Untuk pendekatan lebih jelasnya, kita mengacu pada: Analisis Risiko Kuantum. Woerner, Egger. 2018.
ja_jp: 近似の詳細については、以下を参照してください: Quantum Risk Analysis, Woerner, Egger. 2018.

source: Since the weighted sum operator (in its current implementation) can only sum up integers, we need to map from the original ranges to the representable range to estimate the result, and reverse this mapping before interpreting the result. The mapping essentially corresponds to the affine mapping described in the context of the uncertainty model above.
id_id: Karena operator tertimbang (dalam implementasinya saat ini) hanya dapat menghitung bilangan bulat, kita perlu memetakan dari rentang awal ke rentang yang dapat merepresentasikan untuk memperkirakan hasil, dan membalikkan pemetaan ini sebelum menginterpretasikan hasilnya. Pemetaan pada dasarnya sesuai dengan pemetaan affine yang dijelaskan dalam konteks model ketidakpastian di atas.
ja_jp: (現在実装中の) 加重合計演算子は整数のみを合計することができるため、結果を推定するために元の範囲から表現可能な範囲に写像し、結果を解釈する前に逆写像する必要があります。このマッピングは不確定性モデルのコンテキストに出てきたアフィン写像に一致します。

source: Evaluate Expected Payoff
id_id: Evaluasi Hasil yang Diharapkan
ja_jp: 期待ペイオフの評価

source: We first verify the quantum circuit by simulating it and analyzing the resulting probability to measure the :math:`|1\rangle` state in the objective qubit.
id_id: Kami pertama kali memverifikasi sirkuit kuantum dengan mensimulasikan itu dan menganalisis probabilitas yang dihasilkan untuk mengukur :math:`|1\rangle` state di qubit objektif.
ja_jp: 我々は、まず量子回路を検証します。シミュレーションで目的量子ビットの :math:`|1\rangle` 状態の観測確率を分析します。

source: Next we use amplitude estimation to estimate the expected payoff.
id_id: Selanjutnya kita menggunakan perkiraan amplitudo untuk memperkirakan payoff yang diharapkan.
ja_jp: 次に、振幅推定を使用して期待ペイオフを推定します。
