Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/finance/07_asian_barrier_spread_pricing.po
Languages: fr_fr, id_id, ja_jp, ta_in

source: This page was generated from `tutorials/finance/07_asian_barrier_spread_pricing.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/finance/07_asian_barrier_spread_pricing.ipynb`__.
id_id: Halaman ini dibuat dari ` tutorials/finance/07_asian_barrier_spread_pricing.ipynb ` __.
ja_jp: 当ページは `tutorials/finance/07_asian_barrier_spread_pricing.ipynb`__ から生成されました。
ta_in: இந்த பக்கம் `tutorials/finance/07_asian_barrier_spread_pricing.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/07_asian_barrier_spread_pricing.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/07_asian_barrier_spread_pricing.ipynb>` _.
id_id: Jalankan secara interaktif dalam ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/07_asian_barrier_spread_pricing.ipynb>` _.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/07_asian_barrier_spread_pricing.ipynb>`_ でインタラクティブに実行します。
ta_in: `IBM குவாண்டம் ஆய்வகத்தில் <https://quantum-computing.ibm.com/jupyter/tutorial/finance/07_asian_barrier_spread_pricing.ipynb>` _.

source: *Pricing Asian Barrier Spreads*
fr_fr: **Evaluation des options asiatiques sur spread**
id_id: *Penetapan Harga Sebaran Barrier Asia *
ja_jp: *アジアン・バリア・スプレッド・オプションの価格推定*
ta_in: * ஆசிய தடை பரவல்களை விலை நிர்ணயம் செய்தல் *

source: Introduction
id_id: Pendahuluan
ja_jp: はじめに
ta_in: அறிமுகம்

source: An Asian barrier spread is a combination of 3 different option types, and as such, combines multiple possible features that the Qiskit Finance option pricing framework supports:
fr_fr: Une option asiatique sur spread est une combinaison de 3 types d'options différents, et en tant que tel, combine plusieurs fonctionnalités que le framework d'évaluation des prix des options Qiskit Finance supporte :
id_id: Penyebaran penghalang Asia (Asian Barrier Spread) adalah kombinasi dari 3 jenis pilihan yang berbeda, dan dengan demikian, menggabungkan beberapa fitur yang mungkin adalah kerangka kerja penetapan harga opsi Qiskit Finance yang mendukung:
ja_jp: アジアン・バリア・スプレッドオプションは３つのオプション・タイプを組み合わせたもので、それゆえにQiskit Finance オプションの価格設定フレームワークがサポートする複数の機能を組み合わせています。
ta_in: ஒரு ஆசிய தடை பரவல் என்பது 3 வெவ்வேறு விருப்ப வகைகளின் கலவையாகும், மேலும், qiskit நிதி விருப்ப விலை நிர்ணய கட்டமைப்பை ஆதரிக்கும் பல சாத்தியமான அம்சங்களை ஒருங்கிணைக்கிறது:

source: Asian option: The payoff depends on the average price over the considered time horizon.
fr_fr: Option asiatique: Le paiement dépend du prix moyen durant une période déterminée.
id_id: Pilihan Asia: Payoff bergantung pada harga rata-rata atas horizon waktu yang dipertimbangkan.
ja_jp: アジアン・オプション: ペイオフは、定められた期間内の原資産の平均価格によって決まります。
ta_in: ஆசிய விருப்பம்: செலுத்துதல் கருதப்படும் நேர எல்லைக்கு மேல் சராசரி விலையைப் பொறுத்தது.

source: Barrier Option: The payoff is zero if a certain threshold is exceeded at any time within the considered time horizon.
fr_fr: Option à barrière: le paiement est égal à zéro si un certain seuil est dépassé à n' importe quel moment de la période de temps considérée.
id_id: Opsi barrier: Payoff bernilai nol jika ambang batas tertentu terlewati pada suatu waktu dalam horizon waktu yang ditentukan.
ja_jp: バリア・オプション: 定められた期間内で原資産価格があるしきい値（バリア）を超過すると、ペイオフはゼロになります。
ta_in: தடை விருப்பம்: கருதப்படும் நேர எல்லைக்குள் எந்த நேரத்திலும் ஒரு குறிப்பிட்ட வரம்பு மீறப்பட்டால் செலுத்துதல் பூஜ்ஜியமாகும்.

source: (Bull) Spread: The payoff follows a piecewise linear function (depending on the average price) starting at zero, increasing linear, staying constant.
fr_fr: Option ( haussières ) sur spread: Le paiement suit une fonction linéaire par morceaux (selon le prix moyen) partant de zéro, augmentant linéairement, demeurant constants.
id_id: Sebaran (Bull): Payoff mengikuti fungsi linear sepenggal atau piecewise (tergantung harga rata-rata) mulai dari nol, meningkat secara linear, tetap konstan.
ja_jp: ブル・スプレッド: ペイオフは（平均価格に応じて）ゼロから始まり、線形に増加し、一定に維持される部分線形関数に従います。
ta_in: (காளை) பரவல்: பூஜ்ஜியத்திலிருந்து தொடங்கி, நேரியல் அதிகரிக்கும், மாறாமல் இருக்கும் ஒரு piecewise நேரியல் செயல்பாட்டை (சராசரி விலையைப் பொறுத்து) செலுத்துகிறது.

source: Suppose strike prices :math:`K_1 < K_2` and time periods :math:`t=1,2`, with corresponding spot prices :math:`(S_1, S_2)` following a given multivariate distribution (e.g. generated by some stochastic process), and a barrier threshold :math:`B>0`. The corresponding payoff function is defined as
fr_fr: Supposons les prix d'exercice :math:`K_1 < K_2` et les périodes :math:`t=1,2`, avec les cours de sous-jacents correspondants :math:`(S_1, S_ 2)` suivant une distribution multivariée donnée (générée par exemple par un processus stochastique), et un seuil de barrière :math:`B> 0`. La fonction de paiement correspondante est définie comme
id_id: Misalkan harga strike :math:` K_1 < K_2 ` dan periode waktu :math:` t=1,2 `, dengan spot price yang sesuai :math:` (S_1, S_ 2) ` mengikuti distribusi multivariat yang diberikan (misalnya dihasilkan oleh beberapa proses stochastic), dan ambang penghalang :math:` B> 0 `. Fungsi payoff yang sesuai didefinisikan sebagai
ja_jp: 権利行使価格 :math:`K_1 < K_2` と期間 :math:`t=1,2` が，与えられた多変量分布 (確率過程によって生成されたものなど) に従うスポット価格 :math:`(S_1, S_2)` とバリア閾値 :math:`B>0` に対応するとします。対応するペイオフ関数は次のように定義されます。
ta_in: வேலைநிறுத்த விலைகள் என்று வைத்துக்கொள்வோம் :math:`K_1 < K_2` மற்றும் கால அவகாசம் :math:`t=1,2`, தொடர்புடைய ஸ்பாட் விலைகளுடன் :math:`(S_1, S_2)`கொடுக்கப்பட்ட பன்முக விநியோகம் (எ.கா. சில சீரற்ற செயல்முறையால் உருவாக்கப்பட்டது) மற்றும் ஒரு தடை வாசலைத் தொடர்ந்து :math:`B>0`.தொடர்புடைய செலுத்துதல் செயல்பாடு என வரையறுக்கப்படுகிறது

source: In the following, a quantum algorithm based on amplitude estimation is used to estimate the expected payoff, i.e., the fair price before discounting, for the option
fr_fr: Dans ce qui suit, un algorithme quantique basé sur l'estimation d'amplitude est utilisé pour évaluer le paiement, c'est-à-dire le juste prix avant décote, pour l'option
id_id: Pada bagian berikut, sebuah algoritma kuantum yang berdasarkan estimasi amplitudo digunakan untuk memperkirakan payoff yang diharapkan, yaitu harga wajar sebelum mendapat diskon, sebagai pilihan
ja_jp: 以下では、振幅推定に基づく量子アルゴリズムを使用して、期待されるペイオフ、すなわちオプションの割引前の公正価格を見積もります。
ta_in: பின்வருவனவற்றில், எதிர்பார்க்கப்பட்ட ஊதியத்தை மதிப்பிடுவதற்கு வீச்சு மதிப்பீட்டை அடிப்படையாகக் கொண்ட ஒரு குவாண்டம் வழிமுறை பயன்படுத்தப்படுகிறது, அதாவது, தள்ளுபடிக்கு முன் நியாயமான விலை, விருப்பத்திற்காக

source: The approximation of the objective function and a general introduction to option pricing and risk analysis on quantum computers are given in the following papers:
fr_fr: L'approximation de la fonction objectif et une introduction générale à l'évaluation des prix d'options et à l'analyse des risques sur les ordinateurs quantiques sont donnés dans les articles suivants :
id_id: Pendekatan fungsi objektif dan pengenalan umum untuk opsi penentuan harga dan analisis risiko pada komputer kuantum diberikan dalam jurnal berikut:
ja_jp: 目的関数の近似と量子コンピューターによる一般的なオプション価格設定とリスク分析は、以下の論文で紹介されています。
ta_in: புறநிலை செயல்பாட்டின் தோராயமும் குவாண்டம் கணினிகளில் விருப்பத்தேர்வு விலை மற்றும் இடர் பகுப்பாய்விற்கான பொதுவான அறிமுகமும் பின்வரும் ஆவணங்களில் கொடுக்கப்பட்டுள்ளன:

source: Quantum Risk Analysis. Woerner, Egger. 2018.
id_id: Analisis Risiko Kuantum. Woerner, Egger. 2018.
ta_in: குவாண்டம் இடர் பகுப்பாய்வு. Woerner, Egger. 2018.

source: Uncertainty Model
fr_fr: Modèle d'Incertitude
id_id: Model Ketidakpastian
ja_jp: 不確実性モデル
ta_in: நிச்சயமற்ற மாதிரி

source: We construct a circuit factory to load a multivariate log-normal random distribution into a quantum state on :math:`n` qubits. For every dimension :math:`j = 1,\ldots,d`, the distribution is truncated to a given interval :math:`[\text{low}_j, \text{high}_j]` and discretized using :math:`2^{n_j}` grid points, where :math:`n_j` denotes the number of qubits used to represent dimension :math:`j`, i.e., :math:`n_1+\ldots+n_d = n`. The unitary operator corresponding to the circuit factory implements the following:
fr_fr: Nous construisons un circuit afin de représenter une distribution aléatoire en log-normale multidimensionnelle dans un état quantique sur :math:`n` qubits. Pour chaque dimension :math:`j = 1,\ldots,d`, la distribution est limitée à l'intervalle :math:`[\text{low}_j, \text{high}_j]` et discrétisée en utilisants :math:`2^{n_j}` points, où :math:`n_j` correspond au nombre de qubits utilisés pour représenter la dimension :math:`j`, c'est à dire : :math:`n_1+\ldots+n_d = n`. L'opérateur unitaire correspondant à ce circuit est le relation suivant :
id_id: Kita membuat sebuah pabrik rangkaian untuk membuat sebuah distribusi acak log-normal multivariat ke dalam sebuah keadaan kuantum pada :math:`n` kubit. Untuk setiap dimensi :math:`j = 1,\ldots,d`, distribusinya dipotong menjadi sebuah interval :math:`[\text{low}_j, \text{high}_j]` dan didiskritkan menggunakan :math:`2^{n_j}` titik jaringan, di mana :math:`n_j` menandakan jumlah kubit yang digunakan untuk merepresentasikan dimensi :math:`j`, yaitu :math:`n_1+\ldots+n_d = n`. Operator uniter yang terkait dengan pabrik rangkaian mengimplementasikan hal berikut:
ja_jp: 多変量対数正規ランダム分布を :math:`n` 量子ビットの量子状態にロードする回路ファクトリを構築します。 すべての次元 :math:`j = 1,\ldots,d` について、分布は指定された区間 :math:`[\text{low}_j, \text{high}_j]` に切り捨てられ、 :math:`2^{n_j}` グリッドポイントを使用して離散化されます。ここで、 :math:`n_j` は次元 :math:`j` を表すために使用される量子ビットの数を示します。つまり :math:`n_1+\ldots+n_d = n` です。 回路ファクトリに対応するユニタリー演算子は、以下のように実装されます:
ta_in: ஒரு பன்முக பதிவு-இயல்பான சீரற்ற விநியோகத்தை ஒரு குவாண்டம் நிலையில் ஏற்றுவதற்கு ஒரு சுற்று தொழிற்சாலையை உருவாக்குகிறோம் :math:`n` qubits.ஒவ்வொரு பரிமாணத்திற்கும்:math:`j = 1,\ldots,d`,ஒரு குறிப்பிட்ட இடைவெளியில் விநியோகம் துண்டிக்கப்படுகிறது:math:`[\text{low}_j, \text{high}_j]`மற்றும் தனிப்பயனாக்கப்பட்டது:math:`2^{n_j}`கட்டம் புள்ளிகள், எங்கே:math:`n_j`பரிமாணத்தைக் குறிக்கப் பயன்படுத்தப்படும் குவிட்களின் எண்ணிக்கையைக் குறிக்கிறது:math:`j`, i.e., :math:`n_1+\ldots+n_d = n`.சுற்று தொழிற்சாலைக்கு ஒத்த ஒற்றுமை ஆபரேட்டர் பின்வருவனவற்றை செயல்படுத்துகிறது:

source: where :math:`p_{i_1\ldots i_d}` denote the probabilities corresponding to the truncated and discretized distribution and where :math:`i_j` is mapped to the right interval using the affine map:
fr_fr: où :math:`p_{i_1\ldots i_d}` représentent les probabilités de chaque distribution tronquée et discrétisée et où :math:`i_j` est mappé sur l'intervalle approprié en utilisant la relation affine suivante :
id_id: di mana :math:`p_{i_1\ldots i_d}` ` menunjukkan probabilitas yang sesuai dengan distribusi yang dipotong dan didiskritkan dan dimana :math:`i_j` dipetakan ke interval yang tepat menggunakan peta affine:
ja_jp: ここで :math:`p_{i_1\ldots i_d}` は、切り捨て分布と離散化分布に対応する確率を表し、 :math:`i_j` はアフィンマップを用いて右区間にマップされています。
ta_in: எங்கே:math: `p_ {i_1 \ ldots i_d}` துண்டிக்கப்பட்ட மற்றும் தனிப்பயனாக்கப்பட்ட விநியோகத்துடன் தொடர்புடைய நிகழ்தகவுகளைக் குறிக்கிறது மற்றும் எங்கே :math: `i_j` சரியான இடைவெளியில் வரைபட வரைபடத்தைப் பயன்படுத்தி மேப் செய்யப்படுகிறது:

source: For simplicity, we assume both stock prices are independent and identically distributed. This assumption just simplifies the parametrization below and can be easily relaxed to more complex and also correlated multivariate distributions. The only important assumption for the current implementation is that the discretization grid of the different dimensions has the same step size.
fr_fr: Pour simplifier, nous supposons que les cours des deux titres sont indépendants et distribués de manière identique. Cette hypothèse simplifie la paramétrisation ci-dessous et peut être facilement étendue à des distributions plus complexes multivariées et également corrélées. La seule hypothèse importante pour l'implémentation suivante est que la grille de discrétisation des différentes dimensions ait la même taille de pas.
id_id: Untuk menyederhanakannya, kita menganggap kedua harga saham tersebut independen dan terdistribusi secara identik. Asumsi ini hanya untuk menyederhanakan parameterisasi di bawah dan dapat dengan mudah dilonggarkan ke distribusi multivariat yang lebih kompleks dan sesuai. Satu-satunya asumsi yang penting untuk implementasi saat ini adalah bahwa jaringan diskritisasi dengan dimensi-dimensi yang berbeda memiliki ukuran langkah yang sama.
ja_jp: 簡単のため、ここでは両方の株価が独立しており、同一の分布を取るものと仮定します。この仮定は、以下のパラメトライゼーション簡略化し、より複雑なそして相関のある多変量分布に緩和することが容易に出来ます。現在の実装のための唯一の重要な仮定は、異なる次元の離散化グリッドが同じステップサイズを持つということです。
ta_in: எளிமைக்காக, இரு பங்கு விலைகளும் சுயாதீனமானவை மற்றும் ஒரே மாதிரியாக விநியோகிக்கப்படுகின்றன என்று நாங்கள் கருதுகிறோம். இந்த அனுமானம் கீழேயுள்ள அளவுருவை எளிதாக்குகிறது, மேலும் மிகவும் சிக்கலான மற்றும் ஒன்றோடு ஒன்று தொடர்புடைய பன்முக விநியோகங்களுக்கு எளிதில் தளர்த்த முடியும். தற்போதைய செயலாக்கத்திற்கான ஒரே முக்கியமான அனுமானம் என்னவென்றால், வெவ்வேறு பரிமாணங்களின் தனிப்பயனாக்குதல் கட்டம் ஒரே படி அளவைக் கொண்டுள்ளது.

source: Payoff Function
fr_fr: Fonction de Paiement
id_id: Fungsi Payoff
ja_jp: ペイオフ関数
ta_in: செலுத்துதல் செயல்பாடு

source: For simplicity, we consider the sum of the spot prices instead of their average. The result can be transformed to the average by just dividing it by 2.
fr_fr: Pour simplifier, nous considérons la somme des cours des sous-jacents au lieu de leur moyenne. Le résultat peut être transformé en moyenne en le divisant par 2.
id_id: Untuk menyederhanakannya, kita menganggap jumlah dari spot price bukan rata-rata mereka. Hasilnya dapat ditransformasikan ke rata-rata dengan hanya membagi dengan 2.
ja_jp: 簡単のため、平均の代わりにスポット価格の合計を考えます。結果を２で割るだけで平均にできます。
ta_in: எளிமைக்காக, ஸ்பாட் விலைகளின் தொகையை அவற்றின் சராசரிக்கு பதிலாக நாங்கள் கருதுகிறோம். முடிவை 2 ஆல் வகுப்பதன் மூலம் சராசரியாக மாற்ற முடியும்.

source: The payoff function equals zero as long as the sum of the spot prices :math:`(S_1 + S_2)` is less than the strike price :math:`K_1` and then increases linearly until the sum of the spot prices reaches :math:`K_2`. Then payoff stays constant to :math:`K_2 - K_1` unless any of the two spot prices exceeds the barrier threshold :math:`B`, then the payoff goes immediately down to zero. The implementation first uses a weighted sum operator to compute the sum of the spot prices into an ancilla register, and then uses a comparator, that flips an ancilla qubit from :math:`\big|0\rangle` to :math:`\big|1\rangle` if :math:`(S_1 + S_2) \geq K_1` and another comparator/ancilla to capture the case that :math:`(S_1 + S_2) \geq K_2`. These ancillas are used to control the linear part of the payoff function.
fr_fr: La fonction de paiement est égale à zéro tant que la somme des cours des sous-jacents :math:` (S_1 + S_ 2) ` est inférieure au prix d'exercice :math:` K_1 `, puis augmente de façon linéaire jusqu'à ce que cette somme atteigne :math:` K_2 `. Alors, le paiement reste constant à :math:` K_2-K_1 ` à moins que l'un des deux cours dépasse le seuil barrière :math:` B `, et le paiement va immédiatement à zéro. L'implémentation utilise d'abord un opérateur de somme pondérée pour calculer la somme des prix spot dans un registre ancilla, puis utilise un comparateur, qui flip un qubit ancilla de :math:` \big | 0\rangle ` à :math:` \big | 1\rangle ` si :math:` (S_1 + S_ 2) \geq K_1 ` et un autre comparateur / ancilla pour capturer le cas ou :math:` (S_1 + S_ 2) \geq K_2 `. Ces ancillas sont utilisées pour contrôler la partie linéaire de la fonction de paiement.
id_id: Fungsi payoff sama dengan nol selama jumlah harga-harga tunai :math:`(S_1 + S_2)` bernilai kurang dari harga kesepakatan :math:`K_1` dan kemudian meningkat secara linear hingga jumlah harga tunai mencapai :math:`K_2`. Selanjutnya payoff tetap konstan terhadap :math:`K_2 - K_1` kecuali jika salah satu dari antara kedua harga tunai melebihi ambang batas barrier :math:`B`, maka payoff langsung turun ke nol. Implementasi tersebut pertama menggunakan sebuah operator penjumlahan terbobot untuk menghitung jumlah harga-harga tunai ke dalam sebuah daftar ancilla, lalu menggunakan sebuah komparator, yang membalikkan sebuah kubit ancilla dari :math:`\big|0\rangle` menjadi :math:`\big|1\rangle` jika :math:`(S_1 + S_2) \geq K_1` dan sebuah komparator/ancilla lain untuk menyimpan kasus di mana :math:`(S_1 + S_2) \geq K_2`. Ancilla-ancilla ini digunakan untuk mengontrol bagian linear dari fungsi payoff tersebut.
ja_jp: ペイオフ関数は、スポット価格合計 :math:`(S_1 + S_2)` が権利行使価格 :math:`K_1` よりも小さい間ゼロであり、その後スポット価格合計が :math:`K_2` になるまで線形に増加します。そしてペイオフはどちらかのスポット価格がバリアしきい値 :math:`B` を超えるまで、一定 :math:`K_2 - K_1` ですが、その後ペイオフは直ちにゼロに落ちます。実装は初め加重合計演算子を使って補助量子ビットにスポット価格合計を計算しますが、それからコンパレーターを使って、もし :math:`(S_1 + S_2) \geq K_1` ならば補助量子ビットを :math:`\big|0\rangle` to :math:`\big|1\rangle` にフリップします。そしてもう一つのコンパレーターと補助量子ビットを :math:`(S_1 + S_2) \geq K_2` のケースを記録するためにフリップします。これらの補助量子ビットはペイオフ関数の線形部分をコントロールするために使われます。
ta_in: ஸ்பாட் விலைகளின் கூட்டுத்தொகை இருக்கும் வரை செலுத்துதல் செயல்பாடு பூஜ்ஜியத்திற்கு சமம்:math:`(S_1 + S_2)` வேலைநிறுத்தத்தை விட குறைவாக உள்ளது price :math:`K_1`ஸ்பாட் விலைகளின் தொகை அடையும் வரை நேர்கோட்டில் அதிகரிக்கிறது :math:`K_2`பின்னர் செலுத்துதல் மாறாமல் இருக்கும்:math:`K_2 - K_1`இரண்டு ஸ்பாட் விலைகளில் ஏதேனும் தடை வரம்பை மீறாவிட்டால்:math:`B`,செலுத்துதல் உடனடியாக பூஜ்ஜியத்திற்கு செல்லும். ஸ்பாட் விலைகளின் தொகையை ஒரு துணை பதிவேட்டில் கணக்கிடுவதற்கு செயல்படுத்தல் முதலில் ஒரு எடையுள்ள தொகை ஆபரேட்டரைப் பயன்படுத்துகிறது, பின்னர் ஒரு ஒப்பீட்டாளரைப் பயன்படுத்துகிறது, இது ஒரு துணை குவிட்டை புரட்டுகிறது:math:`\big|0\rangle` to :math:`\big|1\rangle` if :math:`(S_1 + S_2) \geq K_1`வழக்கைப் பிடிக்க மற்றொரு ஒப்பீட்டாளர் / துணை:math:`(S_1 + S_2) \geq K_2`. செலுத்துதல் செயல்பாட்டின் நேரியல் பகுதியைக் கட்டுப்படுத்த இந்த துணைக்கள் பயன்படுத்தப்படுகின்றன.

source: In addition, we add another ancilla variable for each time step and use additional comparators to check whether :math:`S_1`, respectively :math:`S_2`, exceed the barrier threshold :math:`B`. The payoff function is only applied if :math:`S_1, S_2 \leq B`.
fr_fr: En outre, nous ajoutons une autre variable ancilla pour chaque pas de temps et utilisons des comparateurs supplémentaires pour vérifier si :math:` S_1 `, respectivement :math:` S_2 `, dépasse le seuil barrière :math:` B `. La fonction de paiement n'est appliquée que si :math:` S_1, S_2 \leq B `.
id_id: Selain itu, kita menambahkan variabel ancilla lain untuk setiap langkah waktu dan menggunakan komparator tambahan untuk memeriksa apakah :math:`S_1`, masing-masing :math:`S_2`, melebihi ambang batas barrier :math:`B`. Fungsi payoff hanya diterapkan jika :math:`S_1, S_2 \leq B`.
ja_jp: それに加え、別の補助量子ビットを時間ステップごとに追加します。そして追加のコンパレーターで :math:`S_1` とそれぞれの :math:`S_2` がバリアしきい値 :math:`B` を超えていないかチェックします。ペイオフ関数は :math:`S_1, S_2 \leq B` の場合のみ適用されます。
ta_in: கூடுதலாக, ஒவ்வொரு கால கட்டத்திற்கும் மற்றொரு துணை மாறியைச் சேர்த்து, கூடுதல் ஒப்பீட்டாளர்களைப் பயன்படுத்துகிறோம்:math: `S_1`, முறையே :math:` S_2`, தடையை மீறுகிறது:math: `B`. :math: `S_1, S_2 \leq B` என்றால் மட்டுமே செலுத்துதல் செயல்பாடு பயன்படுத்தப்படும்.

source: The linear part itself is approximated as follows. We exploit the fact that :math:`\sin^2(y + \pi/4) \approx y + 1/2` for small :math:`|y|`. Thus, for a given approximation scaling factor :math:`c_\text{approx} \in [0, 1]` and :math:`x \in [0, 1]` we consider
fr_fr: Une approximation de la partie linéaire proprement dite est faite de la façon suivante. On exploite le fait que :math:`\sin^2(y + \pi/4) \approx y + 1/2` pour :math:`|y|` petit. Ainsi, pour un facteur d'échelle d'approximation :math:`c_\text{approx} \in [0, 1]` et :math:`x \in [0, 1]` on considère
id_id: Bagian linear itu sendiri diaproksimasi sebagai berikut: Kita memanfaatkan fakta bahwa :math:`\sin^2(y + \pi/4) \approx y + 1/2` untuk nilai :math:`|y|` yang kecil. Dengan demikian, untuk sebuah faktor penskalaan perkiraan :math:`c_\text{approx} \in [0, 1]` dan :math:`x \in [0, 1]` kita mempertimbangkan
ja_jp: 線形部分自体は次のように近似されます。 小さい :math:`|y|` に対して :math:`\sin^2(y + \pi/4) \approx y + 1/2` という事実を利用します。 したがって、与えられた近似スケーリング係数 :math:`c_\text{approx} \in [0, 1]` および :math:`x \in [0, 1]` に対して、次を考えます。
ta_in: நேரியல் பகுதி பின்வருமாறு தோராயமாக மதிப்பிடப்படுகிறது. என்ற உண்மையை நாங்கள் சுரண்டிக்கொள்கிறோம்:math:`\sin^2(y + \pi/4) \approx y + 1/2` for small :math:`|y|`.எனவே, கொடுக்கப்பட்ட தோராய அளவிடுதல் காரணிக்கு :math:`c_\text{approx} \in [0, 1]' மற்றும் :math:`x \in [0, 1]`நாங்கள் கருதுகிறோம்

source: \ for small :math:`c_\text{approx}`.
fr_fr: \ pour de petites valeurs de :math:`c_\text{approx}`.
id_id: \ untuk :math:` c_\text{approx}` yang kecil.
ja_jp: :math:`c_\text{approx}` は十分小さいものとします。

source: We can easily construct an operator that acts as
fr_fr: Nous pouvons facilement construire un opérateur qui agit ainsi
id_id: Kita dapat dengan mudah membangun operator yang bertindak sebagai
ja_jp: 次のように機能する演算子を簡単に構築できます
ta_in: ஒரு ஆபரேட்டரை நாம் எளிதாக உருவாக்க முடியும் ஆக செயல்படும்

source: using controlled Y-rotations.
fr_fr: en utilisant des Y-rotations contrôlées.
id_id: menggunakan kontrol Y-rotasi.
ja_jp: 制御Y-回転を使って。
ta_in: கட்டுப்படுத்தப்பட்ட Y- சுழற்சிகளைப் பயன்படுத்துதல்.

source: Eventually, we are interested in the probability of measuring :math:`\big|1\rangle` in the last qubit, which corresponds to :math:`\sin^2(a*x+b)`. Together with the approximation above, this allows to approximate the values of interest. The smaller we choose :math:`c_\text{approx}`, the better the approximation. However, since we are then estimating a property scaled by :math:`c_\text{approx}`, the number of evaluation qubits :math:`m` needs to be adjusted accordingly.
fr_fr: Il est aussi intéressant de connaitre la probabilité de mesurer :math:`\big|1\rangle` sur le dernier qubit, qui correspond à :math:`\sin^2(a*x+b)`. En complément de l'approximation précédente, nous pouvons alors estimer la valeurs des intérêts. Plus :math:`c_\text{approx}` est choisi petit, meilleure est l'approximation. Cependant, puisque nous estimons une propriété dépendant de :math:`c_\text{approx}`, le nombre de qubits d'évaluation :math:`m` doit être choisi en conséquence.
id_id: Pada akhirnya, kita tertarik pada kemungkinan mengukur :math:`big|1\rangle` dalam kubit terakhir, yang sesuai dengan :math:`\sin^2(a*x+b)`. Bersama dengan perkiraan di atas, hal ini memungkinkan perkiraan nilai bunga (interest). Semakin kecil :math:`c_\text{approx}` yang dipilih, semakin baik perkiraannya. Namun, karena kita kemudian memperkirakan sebuah nilai yang diskalakan dengan :math:`c_\text{approx}`, jumlah kubit evaluasi :math:`m` perlu disesuaikan.
ja_jp: 最終的には、 :math:`\sin^2(a*x+b)` に対応する最後の量子ビットで :math:`\big|1\rangle` を測定する確率に関心があります。 上記の近似と合わせて、対象の値を近似できます。小さい :math:`c_\text{approx}` を選択するほど、近似は良くなります。 ただし、 :math:`c_\text{approx}` でスケーリングされたプロパティを推定しているため、それに応じて評価量子ビットの数 :math:`m` を調整する必要があります。
ta_in: இறுதியில், அளவிடும் நிகழ்தகவில் நாங்கள் ஆர்வமாக உள்ளோம்:math:`\big|1\rangle`கடைசி குவிட்டில், இது ஒத்திருக்கிறது:math:`\sin^2(a*x+b)`.மேலே உள்ள தோராயத்துடன், இது ஆர்வத்தின் மதிப்புகளை தோராயமாக மதிப்பிட அனுமதிக்கிறது. சிறியது நாம் தேர்வு செய்கிறோம்:math:`c_\text{approx}`,சிறந்த தோராயமான. இருப்பினும், அளவிடப்பட்ட ஒரு சொத்தை நாங்கள் மதிப்பிடுகிறோம் என்பதால்:math:`c_\text{approx}`,மதிப்பீட்டு வினாடிகளின் எண்ணிக்கை :math:`m` அதற்கேற்ப சரிசெய்யப்பட வேண்டும்.

source: For more details on the approximation, we refer to: Quantum Risk Analysis. Woerner, Egger. 2018.
fr_fr: Pour plus de détails sur l'approximation, nous nous référons à: Quantum Risk Analysis. Woerner, Egger. 2018.
id_id: Untuk pendekatan lebih jelasnya, kita mengacu pada: Analisis Risiko Kuantum. Woerner, Egger. 2018.
ja_jp: 近似の詳細については、以下を参照してください: Quantum Risk Analysis, Woerner, Egger. 2018.
ta_in: தோராயமான விவரங்களுக்கு, நாங்கள் குறிப்பிடுகிறோம்: Quantum Risk Analysis. Woerner, Egger. 2018.
