Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/finance/07_asian_barrier_spread_pricing.po
Languages: fr_fr, id_id, ja_jp, ta_in

source: Since the weighted sum operator (in its current implementation) can only sum up integers, we need to map from the original ranges to the representable range to estimate the result, and reverse this mapping before interpreting the result. The mapping essentially corresponds to the affine mapping described in the context of the uncertainty model above.
fr_fr: Étant donné que l'opérateur de somme pondérée (dans son implémentation actuelle) ne peut additionner que des entiers, nous devons faire correspondre les intervalles d'origine avec les intervalles représentables pour estimer le résultat, puis inverser cette correspondance avant d'interpréter le résultat. Cela correspond essentiellement à la relation affine décrite dans le cadre du modèle d'incertitude ci-dessus.
id_id: Karena operator penjumlahan terbobot (dalam implementasinya saat ini) hanya dapat menjumlahkan bilangan bulat, kita perlu memetakan dari rentang awal ke rentang yang dapat direpresentasikan untuk memperkirakan hasilnya, dan membalikkan pemetaan ini sebelum menginterpretasikan hasilnya. Pemetaan ini pada dasarnya berhubungan dengan pemetaan afin yang dideskripsikan dalam konteks model ketidakpastian di atas.
ja_jp: (現在実装中の) 加重合計演算子は整数のみを合計することができるため、結果を推定するために元の範囲から表現可能な範囲に写像し、結果を解釈する前に逆写像する必要があります。このマッピングは不確定性モデルのコンテキストに出てきたアフィン写像に一致します。
ta_in: விவரணையாக்கம் எடையுள்ள தொகை ஆபரேட்டர் (அதன் தற்போதைய செயல்பாட்டில்) முழு எண்களை மட்டுமே தொகுக்க முடியும் என்பதால், முடிவை மதிப்பிடுவதற்கு அசல் வரம்புகளிலிருந்து பிரதிநிதித்துவ வரம்பிற்கு வரைபடம் செய்ய வேண்டும், மேலும் முடிவை விளக்கும் முன் இந்த மேப்பிங்கை மாற்றியமைக்க வேண்டும். மேப்பிங் அடிப்படையில் மேலே உள்ள நிச்சயமற்ற மாதிரியின் சூழலில் விவரிக்கப்பட்டுள்ள அஃபைன் மேப்பிங்கிற்கு ஒத்திருக்கிறது.

source: Evaluate Expected Payoff
fr_fr: Evaluation du Paiement Attendu
id_id: Evaluasi Hasil yang Diharapkan
ja_jp: 期待ペイオフの評価
ta_in: எதிர்பார்க்கப்படும் ஊதியத்தை மதிப்பிடுங்கள்

source: We first verify the quantum circuit by simulating it and analyzing the resulting probability to measure the :math:`|1\rangle` state in the objective qubit.
fr_fr: Nous commençons par vérifier le circuit quantique en le simulant et en analysant la probabilité de mesurer l'état :math:`|1\rangle` sur le qubit objectif.
id_id: Pertama kita memverifikasi rangkaian kuantum dengan mensimulasikannya dan menganalisa probabilitas yang dihasilkan untuk mengukur keadaan :math:`|1\rangle` dalam kubit objektif tersebut.
ja_jp: 我々は、まず量子回路を検証します。シミュレートで目的量子ビットの :math:`|1\rangle` 状態の観測確率を分析します。
ta_in: குவாண்டம் சுற்றுவட்டத்தை உருவகப்படுத்துவதன் மூலமும், அதன் அளவை அளவிடுவதற்கான நிகழ்தகவை பகுப்பாய்வு செய்வதன் மூலமும் முதலில் சரிபார்க்கிறோம்:math:`|1\rangle`புறநிலை குவிட்டில் நிலை.

source: Next we use amplitude estimation to estimate the expected payoff. Note that this can take a while since we are simulating a large number of qubits. The way we designed the operator (asian_barrier_spread) implies that the number of actual state qubits is significantly smaller, thus, helping to reduce the overall simulation time a bit.
fr_fr: Nous utilisons ensuite l'estimation de l'amplitude pour obtenir une estimation du gain attendu. Notez que cela peut prendre un certain temps car nous simulons un grand nombre de qubits. La façon dont nous avons conçu l'opérateur (asian_barrier_spread) implique que le nombre de qubits utilisé est significativement plus petit, contribuant ainsi à réduire un peu le temps de simulation global.
id_id: Selanjutnya kita menggunakan estimasi amplitudo untuk memperkirakan harga yang diharapkan. Perhatikan bahwa hal ini dapat memerlukan waktu karena kita sedang mensimulasikan banyak kubit. Cara kita mendesain operator (asian_barrier_spread) mengimplikasikan bahwa jumlah kubit keadaan yang sebenarnya jauh lebih kecil, sehingga mampu sedikit mengurangi waktu simulasi keseluruhan.
ja_jp: 次に振幅推定で期待ペイオフを推定します。多数の量子ビットをシミュレートするため、推定には時間がかかることに注意してください。我々が設計した演算子 (asian_barrier_spread) は実際の状態量子ビット数よりもかなり少なくなっていますが、これはシミュレーション時間を短縮するためです。
ta_in: அடுத்து எதிர்பார்க்கப்படும் ஊதியத்தை மதிப்பிடுவதற்கு வீச்சு மதிப்பீட்டைப் பயன்படுத்துகிறோம். நாங்கள் அதிக எண்ணிக்கையிலான குவிட்களை உருவகப்படுத்துவதால் இதற்கு சிறிது நேரம் ஆகலாம் என்பதை நினைவில் கொள்க. ஆபரேட்டரை நாங்கள் வடிவமைத்த விதம் (asian_barrier_spread) உண்மையான மாநில குவிட்டுகளின் எண்ணிக்கை கணிசமாக சிறியதாக இருப்பதைக் குறிக்கிறது, இதனால் ஒட்டுமொத்த உருவகப்படுத்துதல் நேரத்தை சிறிது குறைக்க உதவுகிறது.

source: Option Pricing using Quantum Computers. Stamatopoulos et al. 2019.
ta_in: குவாண்டம் கம்ப்யூட்டர்களைப் பயன்படுத்தி விருப்பத்தேர்வு விலை. Stamatopoulos et al. 2019.

source: P(S_1, S_2) = \begin{cases} \min\left\{\max\left\{\frac{1}{2}(S_1 + S_2) - K_1, 0\right\}, K_2 - K_1\right\}, & \text{ if } S_1, S_2 \leq B \\ 0, & \text{otherwise.} \end{cases}
fr_fr: P(S_1, S_2) = \begin{cases} \min\left\{\max\left\{\frac{1}{2}(S_1 + S_2) - K_1, 0\right\}, K_2 - K_1\right\}, & \text{ si } S_1, S_2 \leq B \\ 0, & \text{sinon.} \end{cases}
