Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/finance/08_fixed_income_pricing.po
Languages: es_un, pt_br, ta_in

source: This page was generated from `tutorials/finance/08_fixed_income_pricing.ipynb`__.
es_un: Esta página fue generada a partir de `tutorials/finance/08_fixed_income_pricing.ipynb`__.
pt_br: Esta página foi gerada, a partir de `tutorials/finance/08_fixed_income_pricing.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/finance/08_fixed_income_pricing.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/08_fixed_income_pricing.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/08_fixed_income_pricing.ipynb>`_.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/08_fixed_income_pricing.ipynb>`_.
ta_in: IBM குவாண்டம் ஆய்வகத்தில் ஊடாடும் வகையில் இயக்கவும்<https://quantum-computing.ibm.com/jupyter/tutorial/finance/08_fixed_income_pricing.ipynb> _.

source: *Pricing Fixed-Income Assets*
es_un: *Fijación de Precios de Activos de Renta Fija*
pt_br: *Precificando ativos de renda fixa*

source: Introduction
es_un: Introducción
pt_br: Introdução
ta_in: அறிமுகம்

source: We seek to price a fixed-income asset knowing the distributions describing the relevant interest rates. The cash flows :math:`c_t` of the asset and the dates at which they occur are known. The total value :math:`V` of the asset is thus the expectation value of:
es_un: Buscamos valorar un activo de renta fija conociendo las distribuciones que describen las tasas de interés relevantes. Se conocen los flujos de caja :math:`c_t` del activo y las fechas en las que ocurren. El valor total :math:`V` del activo es, por lo tanto, el valor esperado de:
pt_br: Buscamos precificar um ativo de renda fixa sabendo as distribuições, que descrevem as taxas de juros relevantes. Os fluxos de caixa :math:`c_t` do ativo e as datas em que ocorrem são conhecidos. O valor total :math:`V` do ativo é, assim, o valor esperado de:
ta_in: தொடர்புடைய வட்டி விகிதங்களை விவரிக்கும் விநியோகங்களை அறிந்து ஒரு நிலையான வருமான சொத்துக்கு விலை கொடுக்க நாங்கள் முயல்கிறோம். பணம் பாய்கிறது:math:`c_t`சொத்து மற்றும் அவை நிகழும் தேதிகள் அறியப்படுகின்றன. மொத்த மதிப்பு:math:`V`சொத்தின் எதிர்பார்ப்பு மதிப்பு:

source: Each cash flow is treated as a zero coupon bond with a corresponding interest rate :math:`r_t` that depends on its maturity. The user must specify the distribution modeling the uncertainty in each :math:`r_t` (possibly correlated) as well as the number of qubits he wishes to use to sample each distribution. In this example we expand the value of the asset to first order in the interest rates :math:`r_t`. This corresponds to studying the asset in terms of its duration. The approximation of the objective function follows the following paper: Quantum Risk Analysis. Woerner, Egger. 2018.
es_un: Cada flujo de caja se trata como un bono cupón cero con una tasa de interés correspondiente :math:`r_t` que depende de su vencimiento. El usuario debe especificar la distribución modelando la incertidumbre en cada :math:`r_t` (posiblemente correlacionado) así como el número de qubits que desea usar para muestrear cada distribución. En este ejemplo, expandimos el valor del activo al primer orden en las tasas de interés :math:`r_t`. Esto corresponde a estudiar el activo en términos de su duración. La aproximación de la función objetivo sigue el siguiente artículo: Quantum Risk Analysis. Woerner, Egger. 2018.
pt_br: Cada fluxo de caixa é tratado como um título de cupom zero, com uma taxa de juros correspondente :math:`r_t` que depende de seu vencimento. O usuário deve especificar a distribuição, que modela a incerteza em cada :math:`r_t` (possivelmente correlacionadas), assim como o número de qubits, que deseja utilizar para amostrar cada distribuição. Neste exemplo, expandimos o valor do ativo para primeira ordem nas taxas de juros :math:`r_t`. Isto corresponde a estudar o ativo, em termos de sua duração. A aproximação da função objetivo segue o seguinte artigo: Quantum Risk Analysis. Woerner, Egger. 2018.
ta_in: ஒவ்வொரு பணப்புழக்கமும் தொடர்புடைய வட்டி விகிதத்துடன் பூஜ்ஜிய கூப்பன் பத்திரமாக கருதப்படுகிறது:math: `r_t` அதன் முதிர்ச்சியைப் பொறுத்தது. ஒவ்வொன்றிலும் உள்ள நிச்சயமற்ற தன்மையை பயனர் குறிப்பிட வேண்டும்:math: `r_t` (ஒன்றுடன் ஒன்று தொடர்புடையது) அத்துடன் ஒவ்வொரு விநியோகத்தையும் மாதிரியாகப் பயன்படுத்த அவர் விரும்பும் வினாடிகளின் எண்ணிக்கை. இந்த எடுத்துக்காட்டில், சொத்தின் மதிப்பை வட்டி விகிதங்களில் முதல் வரிசையில் விரிவுபடுத்துகிறோம்:math: `r_t`. இது சொத்தின் கால அளவின் அடிப்படையில் படிப்பதை ஒத்துள்ளது. புறநிலை செயல்பாட்டின் தோராயமானது பின்வரும் தாளைப் பின்பற்றுகிறது:Quantum Risk Analysis. Woerner, Egger. 2018.

source: Uncertainty Model
es_un: Modelo de Incertidumbre
pt_br: Modelo de incerteza
ta_in: நிச்சயமற்ற மாதிரி

source: We construct a circuit factory to load a multivariate normal random distribution in :math:`d` dimensions into a quantum state. The distribution is truncated to a given box :math:`\otimes_{i=1}^d [low_i, high_i]` and discretized using :math:`2^{n_i}` grid points, where :math:`n_i` denotes the number of qubits used for dimension :math:`i = 1,\ldots, d`. The unitary operator corresponding to the circuit factory implements the following:
es_un: Construimos una fábrica de circuitos para cargar una distribución aleatoria normal multivariante en :math:`d` dimensiones en un estado cuántico. La distribución se trunca en una caja dada :math:`\otimes_{i=1}^d [low_i, high_i]` y se discretiza usando una cuadrícula de :math:`2^{n_i}` puntos, donde :math:`n_i` denota el número de qubits utilizados para la dimensión :math:`i = 1,\ldots, d`. El operador unitario correspondiente a la fábrica de circuitos implementa lo siguiente:
pt_br: Construímos uma fábrica de circuitos para carregar uma distribuição aleatória normal multivariada em :math:`d` dimensões em um estado quântico. A distribuição é truncada para uma determinada caixa :math:`\otimes_{i=1}^d [low_i, high_i]` e discretizada usando :math:`2^{n_i}` pontos de grade, onde :math:`n_i` denota o número de qubits utilizados para a dimensão :math:`i = 1,\ldots, d`. O operador unitário correspondente à fábrica de circuitos implementa o seguinte:
ta_in: ஒரு பன்முக இயல்பான சீரற்ற விநியோகத்தை ஏற்ற ஒரு சுற்று தொழிற்சாலையை உருவாக்குகிறோம்:math:`d`பரிமாணங்கள் ஒரு குவாண்டம் நிலையில். கொடுக்கப்பட்ட பெட்டியில் விநியோகம் துண்டிக்கப்படுகிறது:math:`\otimes_{i=1}^d [low_i, high_i]`மற்றும் தனிப்பயனாக்கப்பட்டது :math:`2^{n_i}` கட்டம் புள்ளிகள், எங்கே :math:`n_i பரிமாணத்திற்கு பயன்படுத்தப்படும் குவிட்களின் எண்ணிக்கையைக் குறிக்கிறது:math:`i = 1,\ldots, d`.சுற்று தொழிற்சாலைக்கு ஒத்த ஒற்றுமை ஆபரேட்டர் பின்வருவனவற்றை செயல்படுத்துகிறது:

source: where :math:`p_{i_1, ..., i_d}` denote the probabilities corresponding to the truncated and discretized distribution and where :math:`i_j` is mapped to the right interval :math:`[low_j, high_j]` using the affine map:
es_un: donde :math:`p_{i_1, ..., i_d}` denota las probabilidades correspondientes a la distribución truncada y discretizada y donde :math:`i_j` se asigna al intervalo correcto :math:`[low_j, high_j]` usando el mapa afín:
pt_br: onde :math:`p_{i_1, ..., i_d}` denotam as probabilidades correspondentes à distribuição truncada e discretizada e onde :math:`i_j` é mapeado para o intervalo correto :math:`[low_j, high_j]` utilizando o mapeamento afim:
ta_in: எங்கே :math:`p_{i_1, ..., i_d}`துண்டிக்கப்பட்ட மற்றும் தனித்தனி விநியோகம் மற்றும் எங்கு தொடர்புடைய நிகழ்தகவுகளைக் குறிக்கவும் :math:`i_j` சரியான இடைவெளியில் பொருத்தப்பட்டுள்ளது :math:`[low_j, high_j]`இணைப்பு வரைபடத்தைப் பயன்படுத்தி:

source: In addition to the uncertainty model, we can also apply an affine map, e.g. resulting from a principal component analysis. The interest rates used are then given by:
es_un: Además del modelo de incertidumbre, también podemos aplicar un mapa afín, por ejemplo, el mapa resultante de un análisis de componentes principales. Las tasas de interés utilizadas vienen dadas por:
pt_br: Além do modelo de incerteza, podemos também aplicar um mapeamento afim, por exemplo, resultante de uma análise de componentes principais. As taxas de juros utilizadas são então dadas por:
ta_in: நிச்சயமற்ற மாதிரியுடன் கூடுதலாக, நாங்கள் ஒரு அஃபைன் வரைபடத்தையும் பயன்படுத்தலாம், எ.கா. ஒரு முக்கிய கூறு பகுப்பாய்வின் விளைவாக. பயன்படுத்தப்படும் வட்டி விகிதங்கள் பின்வருமாறு கொடுக்கப்பட்டது:

source: where :math:`\vec{x} \in \otimes_{i=1}^d [low_i, high_i]` follows the given random distribution.
es_un: donde :math:`\vec{x} \in \otimes_{i=1}^d [low_i, high_i]` sigue la distribución aleatoria dada.
pt_br: onde :math:`\vec{x} \in \otimes_{i=1}^d [low_i, high_i]` segue a distribuição aleatória dada.
ta_in: பகிர்ந்தளித்தல்எங்கே :math:\otimes_{i = 1} ^ d [low_i, high_i] இல் `\vec {x}\ கொடுக்கப்பட்ட சீரற்ற விநியோகத்தைப் பின்பற்றுகிறது.

source: Cash flow, payoff function, and exact expected value
es_un: Flujo de caja, función de rendimiento, y valor esperado exacto
pt_br: Fluxo de caixa, função payoff e valor esperado exato
ta_in: பணப்புழக்கம், செலுத்துதல் செயல்பாடு மற்றும் சரியான எதிர்பார்க்கப்பட்ட மதிப்பு

source: In the following we define the cash flow per period, the resulting payoff function and evaluate the exact expected value.
es_un: A continuación, definimos el flujo de caja por periodo, la función de rendimiento resultante y evaluamos el valor esperado exacto.
pt_br: A seguir, definimos o fluxo de caixa por período, a função payoff resultante e avaliamos o valor esperado exato.
ta_in: பின்வருவனவற்றில், ஒரு காலகட்டத்திற்கான பணப்புழக்கத்தை நாங்கள் வரையறுக்கிறோம், இதன் விளைவாக செலுத்தும் செயல்பாடு மற்றும் சரியான எதிர்பார்க்கப்படும் மதிப்பை மதிப்பீடு செய்கிறது.

source: For the payoff function we first use a first order approximation and then apply the same approximation technique as for the linear part of the payoff function of the `European Call Option <03_european_call_option_pricing.ipynb>`__.
es_un: Para la función de rendimiento primero utilizamos una aproximación de primer orden y luego aplicamos la misma técnica de aproximación que para la parte lineal de la función de rendimiento de la `Fijación de Precios de Opciones de Compra Europeas <03_european_call_option_pricing.ipynb>`__.
pt_br: Para a função de payoff, usamos primeiro a aproximação de primeira ordem e em seguida, aplicamos a mesma técnica de aproximação para a parte linear da função de pagamento da `Opção de Chamada Europeia <03_european_call_option_pricing.ipynb>`__.
ta_in: செலுத்துதல் செயல்பாட்டிற்கு, நாங்கள் முதலில் முதல் வரிசை தோராயத்தைப் பயன்படுத்துகிறோம், பின்னர் `ஐரோப்பிய அழைப்பு விருப்பத்தின் செலுத்துதல் செயல்பாட்டின் நேரியல் பகுதியைப் போலவே அதே தோராய நுட்பத்தைப் பயன்படுத்துகிறோம்.<03_european_call_option_pricing.ipynb>`__.
