Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/finance/09_credit_risk_analysis.po
Languages: es_mx, fr_fr, id_id, pt_br, ta_in

source: We now use the simulator to validate the circuit that constructs :math:`|\Psi\rangle` and compute the corresponding exact values for - expected loss :math:`\mathbb{E}[L]` - PDF and CDF of :math:`L` - value at risk :math:`VaR(L)` and corresponding probability - conditional value at risk :math:`CVaR(L)`
es_mx: Ahora usamos el simulador para validar el circuito que construye :math:`|\Psi\rangle` y calculamos los valores exactos correspondientes para - la pérdida esperada :math:`\mathbb{E}[L]` - PDF y CDF de :math:`L` - valor en riesgo :math:`VaR(L)` y probabilidad correspondiente - valor en riesgo condicional :math:`CVaR(L)`
fr_fr: Nous utilisons maintenant le simulateur pour valider le circuit qui construit l'état :math:`|\Psi\rangle` et calculer les valeurs exactes correspondantes pour - la perte attendue :math:`\mathbb{E}[L]` - PDF et CDF de :math:`L` - la valeur à risque :math:`VaR(L)` et la probabilité correspondante - la valeur conditionnelle à risque :math:`CVaR(L)`
id_id: Sekarang kita gunakan simulator ini untuk memvalidasikan rangkaian yang menyusun :math:`|\Psi\rangle` dan menghitung nilai eksak terkair untuk - perkiraan kerugian :math:`\mathbb{E}[L]` - PDF dan CDF dari :math:`L` - nilai terisiko :math:`VaR(L)`dan probabilitas terkait - nilai terisiko bersyarat :math:`CVaR(L)`
pt_br: Utilizamos agora o simulador para validar o circuito que constrói :math:`|\Psi\rangle` e computar os valores exatos correspondentes para - perda esperada :math:`\mathbb{E}[L]` - PDF e CDF de :math:`L`- valor em risco :math:`VaR (L)` e probabilidade correspondente - valor condicional em risco :math:`CVaR (L)`
ta_in: கட்டமைக்கும் சுற்று சரிபார்க்க இப்போது சிமுலேட்டரைப் பயன்படுத்துகிறோம்:math:`|\Psi\rangle`மற்றும் எதிர்பார்க்கப்படும் இழப்புக்கான சரியான மதிப்புகளைக் கணக்கிடுங்கள் :math:`\mathbb{E}[L]` - PDF and CDF of :math:`L` - ஆபத்தில் மதிப்பு :math:`VaR(L)`மற்றும் தொடர்புடைய நிகழ்தகவு - ஆபத்தில் நிபந்தனை மதிப்பு :math:`CVaR(L)`

source: Expected Loss
es_mx: Pérdida Esperada
fr_fr: Perte attendue
id_id: Perkiraan Kerugian
pt_br: Perda Esperada
ta_in: எதிர்பார்க்கப்படும் இழப்பு

source: To estimate the expected loss, we first apply a weighted sum operator to sum up individual losses to total loss:
es_mx: Para estimar la pérdida esperada, primero aplicamos un operador de suma ponderada para sumar las pérdidas individuales a la pérdida total:
fr_fr: Pour estimer la perte attendue, nous appliquons d'abord un opérateur de somme pondérée pour obtenir la perte totale à partir des pertes individuelles :
id_id: Untuk menaksir perkiraan kerugian, pertama-tama kita menerapkan operator penjumlahan terbobot untuk menjumlahkan kerugian individu ke dalam kerugian total:
pt_br: Para estimar a perda esperada, primeiramente aplicamos um operador de soma ponderada para somar as perdas individuais à perda total:
ta_in: எதிர்பார்க்கப்படும் இழப்பை மதிப்பிடுவதற்கு, தனிப்பட்ட இழப்புகளை மொத்த இழப்புக்குச் சேர்க்க முதலில் எடையுள்ள தொகை ஆபரேட்டரைப் பயன்படுத்துகிறோம்:

source: The required number of qubits to represent the result is given by
es_mx: El número requerido de qubits para representar el resultado está dado por
fr_fr: Le nombre qubits requis pour représenter le résultat est donné par
id_id: Jumlah qubit yang dibutuhkan untuk merepresentasikan hasilnya ditunjukkan oleh
pt_br: O número necessário de qubits para representar o resultado é dado por
ta_in: முடிவைக் குறிக்க தேவையான எண்ணிக்கையிலான குவிட்கள் வழங்கப்படுகின்றன

source: Once we have the total loss distribution in a quantum register, we can use the techniques described in [Woerner2019] to map a total loss :math:`L \in \{0, ..., 2^{n_s}-1\}` to the amplitude of an objective qubit by an operator
es_mx: Una vez que tenemos la distribución de pérdida total en un registro cuántico, podemos utilizar las técnicas descritas en [Woerner2019] para asignar una pérdida total :math:`L \in \{0, ..., 2^{n_s}-1\}` a la amplitud de un qubit objetivo por un operador
fr_fr: Une fois que nous avons la distribution des pertes totales dans un registre quantique, nous pouvons utiliser les techniques décrites dans [Woerner2019] pour faire correspondre une perte totale :math:`L \in \ { 0, ..., 2 ^{n_s}-1 \ } ` à l'amplitude d'un qubit cible par un opérateur
id_id: Setelah kita mendapatkan distribusi kerugian total dalam sebuah daftar kuantum, kita dapat menggunakan teknik yang dijelaskan dalam [Woerner2019] untuk memetakan kerugian total :math:`L \in \{0, ..., 2^{n_s}-1\}` pada amplitudo sebuah qubit obyektif dengan sebuah operator
pt_br: Uma vez que temos a distribuição total de perda em um registro quântico, podemos utilizar as técnicas descritas em [Woerner2019] para mapear uma perda total :math:`L \in \ {0, ..., 2^{n_s}-1 \}` à amplitude de um qubit objetivo por um operador
ta_in: ஒரு குவாண்டம் பதிவேட்டில் மொத்த இழப்பு விநியோகத்தை நாங்கள் பெற்றவுடன், விவரிக்கப்பட்ட நுட்பங்களைப் பயன்படுத்தலாம்[Woerner2019]மொத்த இழப்பை வரைபடமாக்க:math:`L \in \{0, ..., 2^{n_s}-1\}`ஒரு ஆபரேட்டரால் ஒரு புறநிலை குவிட்டின் வீச்சுக்கு

source: which allows to run amplitude estimation to evaluate the expected loss.
es_mx: que permite ejecutar la estimación de amplitud para evaluar la pérdida esperada.
fr_fr: ce qui permet d'exécuter l'estimation de l'amplitude pour évaluer l'espérance de la perte.
id_id: yang memungkinkan untuk menjalankan estimasi amplitudo untuk mengevaluasi perkiraan kerugian.
pt_br: que permite executar uma amplitude estimada, do valor da perda esperada.
ta_in: இது எதிர்பார்த்த இழப்பை மதிப்பிடுவதற்கு வீச்சு மதிப்பீட்டை இயக்க அனுமதிக்கிறது.

source: Create the state preparation circuit:
es_mx: Crear el circuito de preparación de estado:
fr_fr: Création du circuit de préparation d'état :
id_id: Buat rangkaian persiapan keadaan:
pt_br: Crie o circuito de preparação de estado:
ta_in: மாநில தயாரிப்பு சுற்று உருவாக்க:

source: Before we use QAE to estimate the expected loss, we validate the quantum circuit representing the objective function by just simulating it directly and analyzing the probability of the objective qubit being in the :math:`|1\rangle` state, i.e., the value QAE will eventually approximate.
es_mx: Antes de usar QAE para estimar la pérdida esperada, validamos el circuito cuántico que representa la función objetivo simplemente simulándolo directamente y analizando la probabilidad de que el qubit objetivo esté en el estado :math:`|1\rangle`, es decir, el valor que QAE eventualmente aproximará.
fr_fr: Avant d'utiliser QAE pour estimer la perte attendue, nous validons le circuit quantique représentant la fonction objectif en le simulant directement et en analysant la probabilité que le qubit objectif soit dans l'état :math:`|1\rangle` c'est-à-dire que la valeur QAE sera approchée.
id_id: Sebelum kita menggunakan QAE untuk menaksir perkiraan kerugian, kita memvalidasi rangkaian kuantum yang mewakili fungsi obyektif tersebut dengan mensimulasikannya secara langsung dan menganalisis probabilitas qubit obyektif tersebut berada dalam keadaan :math:`|1\rangle`, yaitu nilai yang akhirnya akan diperkirakan QAE.
pt_br: Antes de utilizarmos o QAE para estimar a perda esperada, validamos o circuito quântico representando a função objetiva apenas simulando-a diretamente e analisando a probabilidade de o qubit objetivo estar no estado :math:`|1\rangle`, ou seja, o valor QAE eventualmente se aproximará.
ta_in: எதிர்பார்த்த இழப்பை மதிப்பிடுவதற்கு QAE ஐப் பயன்படுத்துவதற்கு முன்பு, புறநிலை செயல்பாட்டைக் குறிக்கும் குவாண்டம் சுற்றுவட்டத்தை நேரடியாக உருவகப்படுத்துவதன் மூலமும், புறநிலை குவிட்டின் நிகழ்தகவை பகுப்பாய்வு செய்வதன் மூலமும் சரிபார்க்கிறோம்.:math:`|1\rangle` state,அதாவது, QAE மதிப்பு இறுதியில் தோராயமாக இருக்கும்.

source: Next we run QAE to estimate the expected loss with a quadratic speed-up over classical Monte Carlo simulation.
es_mx: A continuación ejecutamos QAE para estimar la pérdida esperada con una aceleración cuadrática sobre la simulación clásica de Monte Carlo.
fr_fr: Ensuite, nous exécutons QAE pour estimer la perte attendue avec une accélération quadratique par rapport à la simulation classique de Monte Carlo.
id_id: Selanjutnya kita jalankan QAE untuk menaksir perkiraan kerugian dengan percepatan kuadratik di atas simulasi klasik Monte Carlo.
pt_br: A seguir, executaremos QAE para estimar a perda esperada, com uma aceleração quadrática sobre a simulador de Monte Carlo clássico.
ta_in: அடுத்து கிளாசிக்கல் மான்டே கார்லோ உருவகப்படுத்துதலுடன் இருபடி வேகத்துடன் எதிர்பார்க்கப்படும் இழப்பை மதிப்பிடுவதற்கு QAE ஐ இயக்குகிறோம்.

source: Cumulative Distribution Function
es_mx: Función de Distribución Acumulativa
fr_fr: Fonction de distribution cumulée
id_id: Fungsi Distribusi Kumulatif
pt_br: Função De Distribuição Cumulativa
ta_in: ஒட்டுமொத்த விநியோக செயல்பாடு

source: Instead of the expected loss (which could also be estimated efficiently using classical techniques) we now estimate the cumulative distribution function (CDF) of the loss. Classically, this either involves evaluating all the possible combinations of defaulting assets, or many classical samples in a Monte Carlo simulation. Algorithms based on QAE have the potential to significantly speed up this analysis in the future.
es_mx: En lugar de la pérdida esperada (que también podría estimarse de manera eficiente utilizando técnicas clásicas), ahora estimamos la función de distribución acumulada (CDF) de la pérdida. Clásicamente, esto implica evaluar todas las posibles combinaciones de activos en incumplimiento o muchas muestras clásicas en una simulación Monte Carlo. Los algoritmos basados en QAE tienen el potencial de acelerar significativamente este análisis en el futuro.
fr_fr: Au lieu de l'espérance de la perte (qui pourrait aussi être estimée efficacement à l'aide de techniques classiques), nous estimons à présent la fonction de distribution cumulative (CDF) de la perte. En termes classiques, il s'agit soit d'évaluer toutes les combinaisons possibles d'actifs défaillants, soit de nombreux échantillons classiques dans une simulation de Monte Carlo. Les algorithmes basés sur la QAE ont le potentiel d'accélérer considérablement cette analyse à l'avenir.
id_id: Alih-alih perkiraan kerugian (yang juga dapat diperkirakan secara efisien menggunakan metode klasik) kita kini memperkirakan fungsi distribusi kumulatif (cumulative distribution function/CDF) dari kerugian tersebut. Biasanya, ini melibatkan semua kombinasi aset gagal bayar yang mungkin, atau banyak sampel klasik dalam sebuah simulasi Monte Carlo. Algoritme yang didasarkan pada QAE memiliki potensi untuk mempercepat analisis ini secara signifikan di masa depan.
pt_br: Em vez da perda esperada (que também poderia ser estimada eficientemente utilizando técnicas clássicas) estimamos agora a função de distribuição cumulativa (CDF) da perda. Classicamente, isso ou envolve a avaliação de todas as combinações possíveis de ativos padrões, ou muitas amostras clássicas em uma simulação de Monte Carlo. Os algoritmos baseados em QAE têm o potencial de acelerar significativamente essa análise no futuro.
ta_in: எதிர்பார்த்த இழப்புக்கு பதிலாக (இது கிளாசிக்கல் நுட்பங்களைப் பயன்படுத்தி திறமையாக மதிப்பிடப்படலாம்) இழப்பின் ஒட்டுமொத்த விநியோக செயல்பாட்டை (CDF) இப்போது மதிப்பிடுகிறோம். பாரம்பரியமாக, இயல்புநிலை சொத்துக்களின் சாத்தியமான அனைத்து சேர்க்கைகளையும் மதிப்பீடு செய்வது அல்லது மான்டே கார்லோ உருவகப்படுத்துதலில் பல கிளாசிக்கல் மாதிரிகள் ஆகியவற்றை மதிப்பீடு செய்வது இதில் அடங்கும். QAE ஐ அடிப்படையாகக் கொண்ட வழிமுறைகள் எதிர்காலத்தில் இந்த பகுப்பாய்வை கணிசமாக விரைவுபடுத்தும் திறனைக் கொண்டுள்ளன.

source: To estimate the CDF, i.e., the probability :math:`\mathbb{P}[L \leq x]`, we again apply :math:`\mathcal{S}` to compute the total loss, and then apply a comparator that for a given value :math:`x` acts as
fr_fr: Pour estimer le CDF, c'est-à-dire la probabilité :math:`\mathbb{P}[L \leqx]`, nous appliquons à nouveau :math:`\mathcal{S}` pour calculer la perte totale, puis un comparateur qui pour une valeur donnée :math:`x` agit comme
pt_br: Para estimar o CDF, ou seja, a probabilidade :math:`\mathbb{P}[L \leq x]`, aplicamos novamente :math:` \mathcal{S}` para computar a perda total, e então aplicar um comparativo que para um determinado valor :math:` x ` atua como
ta_in: சி.டி.எஃப் ஐ மதிப்பிடுவதற்கு, அதாவது நிகழ்தகவு:math:`\ mathbb {P} [L \ leq x]`, நாங்கள் மீண்டும் விண்ணப்பிக்கிறோம்:math:`\ mathcal {S}` மொத்த இழப்பைக் கணக்கிட, பின்னர் ஒரு ஒப்பீட்டாளரைப் பயன்படுத்துங்கள் கொடுக்கப்பட்ட மதிப்புக்கு:math: `x` ஆக செயல்படுகிறது

source: The resulting quantum state can be written as
es_mx: El estado cuántico resultante se puede escribir como
fr_fr: L'état quantique obtenu peut être écrit comme ceci
id_id: Keadaan kuantum yang dihasilkan dapat ditulis sebagai
pt_br: O estado quântico resultante pode ser escrito como
ta_in: இதன் விளைவாக குவாண்டம் நிலையை இவ்வாறு எழுதலாம்

source: where we directly assume the summed up loss values and corresponding probabilities instead of presenting the details of the uncertainty model.
es_mx: donde asumimos directamente los valores de pérdida sumados y las probabilidades correspondientes en lugar de presentar los detalles del modelo de incertidumbre.
fr_fr: où nous adoptons directement la somme des valeurs de perte et des probabilités correspondantes au lieu de présenter les détails du modèle d'incertitude.
id_id: dimana kita secara langsung mengasumsikan nilai kerugian yang terangkum dan probabilitas yang sesuai daripada menyajikan rincian dari model ketidakpastian.
pt_br: onde assumimos diretamente os valores somados de perda e as probabilidades correspondentes em vez de apresentar os detalhes do modelo de incerteza.
ta_in: நிச்சயமற்ற மாதிரியின் விவரங்களை முன்வைப்பதற்கு பதிலாக சுருக்கமான இழப்பு மதிப்புகள் மற்றும் அதனுடன் தொடர்புடைய நிகழ்தகவுகளை நாங்கள் நேரடியாக கருதுகிறோம்.

source: The CDF(\ :math:`x`) equals the probability of measuring :math:`|1\rangle` in the objective qubit and QAE can be directly used to estimate it.
es_mx: La CDF(\ :math:`x`) es igual a la probabilidad de medir :math:`|1\rangle` en el qubit objetivo y se puede utilizar directamente QAE para estimarlo.
fr_fr: Le CDF (\ :math:`x`) est égal à la probabilité de mesurer :math:`|1\rangle` dans le qubit objectif et QAE peut être utilisé directement pour l'estimer.
id_id: Sedangkan CDF (\ :math:` x `) sama dengan probabilitas pengukuran :math:` | 1\rangle ` di qubit objektif dan QAE dapat langsung digunakan untuk memperkirakan hal itu.
pt_br: O CDF (\ :math:`x`) é igual a probabilidade de medir :math:`|1\rangle` no qubit objetivo e QAE pode ser diretamente usado para estimá-lo.
ta_in: சி.டி.எஃப்(\ :math:`x`) அளவிடும் நிகழ்தகவுக்கு சமம்:math:`|1\rangle`புறநிலை குவிட் மற்றும் QAE இல் அதை மதிப்பிடுவதற்கு நேரடியாக பயன்படுத்தலாம்.

source: Again, we first use quantum simulation to validate the quantum circuit.
es_mx: Nuevamente, primero utilizamos la simulación cuántica para validar el circuito cuántico.
fr_fr: Encore une fois, nous utilisons d'abord la simulation quantique pour valider le circuit quantique.
id_id: Sekali lagi, pertama-tama kita gunakan simulasi kuantum untuk memvalidasi sirkuit kuantum.
pt_br: Novamente, primeiro usaremos o simulador quântico para validar o circuito quântico.
ta_in: மீண்டும், குவாண்டம் சுற்றுவட்டத்தை சரிபார்க்க முதலில் குவாண்டம் உருவகப்படுத்துதலைப் பயன்படுத்துகிறோம்.

source: Next we run QAE to estimate the CDF for a given :math:`x`.
es_mx: A continuación ejecutamos QAE para estimar la CDF para un :math:`x` dado.
fr_fr: Ensuite, nous exécutons QAE pour estimer le CDF pour un :math:`x` donné.
id_id: Selanjutnya kita jalankan QAE untuk memperkirakan CDF untuk diberikan :math:` x `.
pt_br: A seguir, executaremos QAE para estimar o CDF para um dado :math:`x`.
ta_in: கொடுக்கப்பட்டவற்றிற்கான சி.டி.எஃப் மதிப்பிட அடுத்ததாக QAE ஐ இயக்குகிறோம்:math:`x`.

source: Value at Risk
es_mx: Valor en Riesgo
fr_fr: Valeur à Risque
id_id: Nilai Terisiko
pt_br: Valor em Risco
ta_in: ஆபத்தில் மதிப்பு

source: In the following we use a bisection search and QAE to efficiently evaluate the CDF to estimate the value at risk.
es_mx: A continuación utilizamos una búsqueda de bisección y QAE para evaluar eficientemente la CDF para estimar el valor en riesgo.
fr_fr: Dans ce qui suit, nous utilisons une recherche de bisection et QAE pour évaluer efficacement le CDF pour estimer la valeur à risque.
id_id: Dalam hal berikut kita menggunakan pencarian bisection dan QAE untuk secara efisien mengevaluasi CDF untuk memperkirakan nilai pada risiko.
pt_br: A seguir usaremos um busca bipartida e QAE para avaliar eficientemente o CDF e estimar o valor de risco.
ta_in: பின்வருவனவற்றில், ஆபத்தில் உள்ள மதிப்பை மதிப்பிடுவதற்கு சி.டி.எஃப் ஐ திறம்பட மதிப்பீடு செய்ய ஒரு பைசெக்ஷன் தேடல் மற்றும் QAE ஐப் பயன்படுத்துகிறோம்.

source: Conditional Value at Risk
es_mx: Valor en Riesgo Condicional
fr_fr: Valeur à Risque Conditionnelle
id_id: Nilai Terisiko Bersyarat
pt_br: Valor condicional em Risco
ta_in: ஆபத்தில் நிபந்தனை மதிப்பு

source: Last, we compute the CVaR, i.e. the expected value of the loss conditional to it being larger than or equal to the VaR. To do so, we evaluate a piecewise linear objective function :math:`f(L)`, dependent on the total loss :math:`L`, that is given by
es_mx: Por último, calculamos el CVaR, es decir, el valor esperado de la pérdida condicional a ser mayor o igual al VaR. Para hacer eso, evaluamos una función objetivo lineal por partes :math:`f(L)`, dependiente de la pérdida total :math:`L`, que está dada por
fr_fr: Enfin, nous calculons le CVaR, c'est-à-dire que la valeur attendue de la perte est conditionnelle à ce qu'elle soit supérieure ou égale à la VaR. Pour ce faire, nous évaluons une fonction objectif linéaire par morceaux :math:`f(L)`, dépendant de la perte totale :math:`L`, qui est donnée par
pt_br: Por último, computamos o CVaR, ou seja, o valor esperado da perda condicionado a ele ser maior ou igual ao VaR. Para isso, avaliamos uma função objetiva linear por partes :math:`f(L)`, dependente da perda total :math:`L`, que é dada por
ta_in: கடைசியாக, நாங்கள் CVaR:math:`f(L)`க் கணக்கிடுகிறோம், அதாவது இழப்புக்கான நிபந்தனைக்குட்பட்ட மதிப்பு VaRரை விட பெரியதாகவோ அல்லது சமமாகவோ இருக்கும். அவ்வாறு செய்ய, ஒரு பிஸ்கேவ் நேரியல் புறநிலை செயல்பாட்டை மதிப்பீடு செய்கிறோம் :math:`f(L)`, மொத்த இழப்பைப் பொறுத்தது:math:`L`,வழங்கப்படுகிறது

source: To normalize, we have to divide the resulting expected value by the VaR-probability, i.e. \ :math:`\mathbb{P}[L \leq VaR]`.
es_mx: Para normalizar, tenemos que dividir el valor esperado resultante entre la probabilidad de VaR, es decir, \ :math:`\mathbb{P}[L \leq VaR]`.
fr_fr: Pour normaliser, nous devons diviser la valeur attendue obtenue par la probabilité de VaR, c.-à-d. \ :math:` \mathbb{P}[ L \leq VaR ] `.
pt_br: Para normalizar, temos que dividir o valor esperado resultante pela probabilidade de VaR, ou seja, \ :math:`\mathbb{P}[L \leq VaR]`.
ta_in: இயல்பாக்குவதற்கு, இதன் விளைவாக எதிர்பார்க்கப்படும் மதிப்பை VaR- நிகழ்தகவு மூலம் வகுக்க வேண்டும், அதாவது. \ :math:`\mathbb{P}[L \leq VaR]`.

source: Next we run QAE to estimate the CVaR.
es_mx: A continuación ejecutamos QAE para estimar el CVaR.
fr_fr: Ensuite, nous exécutons QAE pour estimer la CVaR.
id_id: Selanjutnya kita jalankan QAE untuk memperkirakan CVaR.
pt_br: A seguir executaremos QAE para estimar o CVaR.
ta_in: அடுத்து CVaR ஐ மதிப்பிடுவதற்கு QAE ஐ இயக்குகிறோம்.

source: Last, we compute the CVaR, i.e.Â the expected value of the loss conditional to it being larger than or equal to the VaR. To do so, we evaluate a piecewise linear objective function :math:`f(L)`, dependent on the total loss :math:`L`, that is given by
id_id: Terakhir, kita menghitung CVaR, yaitu nilai yang diharapkan dari kerugian kondisional untuk itu menjadi lebih besar dari atau sama dengan VaR. Untuk melakukannya, kita mengevaluasi sebuah fungsi obyektif linear piecjektif :math:` f (L) `, tergantung pada kerugian total :math:` L `, yang diberikan

source: To normalize, we have to divide the resulting expected value by the VaR-probability, i.e.Â \ :math:`\mathbb{P}[L \leq VaR]`.
id_id: Untuk menormalkan, kita harus membagi nilai yang diharapkan oleh probabilitas VaR-, yaituÂ \ :math:` \mathbb{P}[L \leq VaR] `.
