Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/finance/09_credit_risk_analysis.po
Languages: es_mx, fr_fr, id_id, pt_br, ta_in

source: This page was generated from `tutorials/finance/09_credit_risk_analysis.ipynb`__.
es_mx: Esta página fue generada a partir de `tutorials/finance/09_credit_risk_analysis.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/finance/9_credit_risk_analysis.ipynb`__.
id_id: Halaman ini diperoleh dari `tutorials/finance/09_credit_risk_analysis.ipynb`__.
pt_br: Esta página foi gerada a partir de `tutorials/finance/09_credit_risk_analysis.ipynb `__.
ta_in: இந்த பக்கம் உருவாக்கப்பட்டது `tutorials/finance/09_credit_risk_analysis.ipynb`__.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/09_credit_risk_analysis.ipynb>`_.
es_mx: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/09_credit_risk_analysis.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/09_credit_risk_analysis.ipynb>`_.
id_id: Jalankan secara interaktif dalam `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/09_credit_risk_analysis.ipynb>`_.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/09_credit_risk_analysis.ipynb>`_.
ta_in: IBM குவாண்டம் ஆய்வகத்தில் ஊடாடும் வகையில் இயக்கவும்<https://quantum-computing.ibm.com/jupyter/tutorial/finance/09_credit_risk_analysis.ipynb>_.

source: *Credit Risk Analysis*
es_mx: *Análisis de Riesgo Crediticio*
fr_fr: *Analyse du Risque de Crédit*
id_id: *Analisis Risiko Kredit*
pt_br: *Análise de Risco de Crédito*
ta_in: *கடன் இடர் பகுப்பாய்வு*

source: Introduction
es_mx: Introducción
id_id: Pendahuluan
pt_br: Introdução
ta_in: அறிமுகம்

source: This tutorial shows how quantum algorithms can be used for credit risk analysis. More precisely, how Quantum Amplitude Estimation (QAE) can be used to estimate risk measures with a quadratic speed-up over classical Monte Carlo simulation. The tutorial is based on the following papers:
fr_fr: Ce tutoriel montre comment les algorithmes quantiques peuvent être utilisés pour l'analyse des risques de crédit. Plus précisément, comment l'estimation de l'amplitude quantique (QAE) peut être utilisée pour estimer les mesures de risque avec une accélération quadratique par rapport à la simulation classique de Monte Carlo. Le tutoriel est basé sur les documents suivants:
pt_br: Este tutorial mostra como algoritmos quânticos podem ser usados para a análise de risco de crédito. Mais precisamente, como a Estimativa da Amplitude Quântica (QAE) pode ser usada para estimar medidas de risco com uma aceleração quadrática sobre a simulação clássica de Monte Carlo. O tutorial é baseado nos seguintes artigos:
ta_in: கடன் ஆபத்து பகுப்பாய்விற்கு குவாண்டம் வழிமுறைகள் எவ்வாறு பயன்படுத்தப்படலாம் என்பதை இந்த பயிற்சி காட்டுகிறது. இன்னும் துல்லியமாக, கிளாசிக்கல் மான்டே கார்லோ உருவகப்படுத்துதலின் மீது இருபடி வேகத்துடன் ஆபத்து நடவடிக்கைகளை மதிப்பிடுவதற்கு குவாண்டம் அலைவீச்சு மதிப்பீடு (QAE) எவ்வாறு பயன்படுத்தப்படலாம். பயிற்சி பின்வரும் ஆவணங்களை அடிப்படையாகக் கொண்டது:

source: `Quantum Risk Analysis. Stefan Woerner, Daniel J. Egger. <https://www.nature.com/articles/s41534-019-0130-6>`__ [Woerner2019]
fr_fr: " Analyse des risques quantiques. Stefan Woerner, Daniel J. Egger. <https://www.nature.com/articles/s41534-019-0130-6>` __ [Woerner2019]
pt_br: `Análise de Risco Quântico. Stefan Woerner, Daniel J. Ogger. <https://www.nature.com/articles/s41534-019-0130-6>`__ [Woerner2019]

source: `Credit Risk Analysis using Quantum Computers. Egger et al. (2019) <https://arxiv.org/abs/1907.03044>`__ [Egger2019]
pt_br: `Análise de Risco de Crédito utilizando Computadores Quânticos. Egger et al. (2019) <https://arxiv.org/abs/1907.03044>` __ [Egger2019]

source: A general introduction to QAE can be found in the following paper:
fr_fr: Une introduction générale à la QAE se trouve dans le document suivant:
pt_br: Uma introdução geral ao QAE pode ser encontrada no seguinte artigo:
ta_in: QAE பற்றிய பொதுவான அறிமுகத்தை பின்வரும் தாளில் காணலாம்:

source: `Quantum Amplitude Amplification and Estimation. Gilles Brassard et al. <http://arxiv.org/abs/quant-ph/0005055>`__
pt_br: `Amplificação de Amplitude Quântica e Estimativa. Gilles Brassard et al. <http://arxiv.org/abs/quant-ph/0005055>`__

source: The structure of the tutorial is as follows:
fr_fr: La structure de ce tutoriel est la suivante:
pt_br: A estrutura do tutorial é a seguinte:
ta_in: டுடோரியலின் அமைப்பு பின்வருமாறு:

source: `Problem Definition <#Problem-Definition>`__
fr_fr: `Définition du problème <#Problem-Definition>`__
pt_br: `Definição do Problema <#Problema-Definition>`__

source: `Uncertainty Model <#Uncertainty-Model>`__
fr_fr: `Modèle d'incertitude <#Uncertainty-Model>`__
pt_br: `Modelo de Incerteza <#Incerteza-modelo>`__

source: `Expected Loss <#Expected-Loss>`__
fr_fr: `Perte attendue <#Expected-Loss>`__
pt_br: `Perda Esperada <#Expected-Loss>`__

source: `Cumulative Distribution Function <#Cumulative-Distribution-Function>`__
fr_fr: `Fonction de Distribution Cumulative <#Cumulative-Distribution-Function>`__
pt_br: `Função de Distribuição Cumulativa <#Cumulative-Distribution-Function>`__

source: `Value at Risk <#Value-at-Risk>`__
fr_fr: `Valeur à Risque <#Value-at-Risk>`__
pt_br: `Valor em Risco <#Value-at-Risk> ` __

source: `Conditional Value at Risk <#Conditional-Value-at-Risk>`__
fr_fr: `Valeur à risque conditionnelle <#Conditional-Value-at-Risk>`__
pt_br: `Valor condicional em risco <#Conditional-Value-at-Risco>`__

source: Problem Definition
es_mx: Definición del Problema
fr_fr: Définition du Problème
id_id: Definisi Masalah
pt_br: Definição do Problema
ta_in: சிக்கல் வரையறை

source: In this tutorial we want to analyze the credit risk of a portfolio of :math:`K` assets. The default probability of every asset :math:`k` follows a *Gaussian Conditional Independence* model, i.e., given a value :math:`z` sampled from a latent random variable :math:`Z` following a standard normal distribution, the default probability of asset :math:`k` is given by
es_mx: En este tutorial queremos analizar el riesgo crediticio de una cartera de :math:`K` activos. La probabilidad predeterminada de cada activo :math:`k` sigue un modelo de *Independencia Condicional Gaussiana*, es decir, dado un valor :math:`z` muestreado a partir de una variable aleatoria latente :math:`Z` siguiendo una distribución normal estándar, la probabilidad predeterminada del activo :math:`k` está dada por
fr_fr: Dans ce tutoriel, nous voulons analyser le risque de crédit d'un portefeuille de :math:`K` actifs. La probabilité par défaut de chaque actif :math:`k` suit un modèle *Gaussien d'indépendance conditionnelle*, c'est-à-dire étant donné une valeur :math:`z` échantillonnée à partir d'une variable aléatoire latente :math:`Z` suivant une distribution normale standard, la probabilité par défaut de l'actif :math:`k` est donnée par
id_id: Dalam tutorial ini kita ingin menganalisis risiko kredit sebuah portfolio yang terdiri dari aset-aset :math:`K`. Probabilitas gagal bayar dari setiap aset :math:`k` mengikuti sebuah model *Kebebasan Bersyarat Gauss*, yaitu dengan sebuah sampel nilai :math:`z` yang diambil dari variabel acak laten :math:`Z` yang mengikuti distribusi normal standar, probabilitas gagal bayar dari aset :math:`k` diberikan oleh
pt_br: Neste tutorial queremos analisar o risco de crédito de uma carteira de ativos de :math:` K `. A probabilidade padrão de cada ativo :math:` k ` segue um modelo *Gaussiana Condicional de Independência *, ou seja, dado um valor :math:` z ` exemplificado a partir de uma variável aleatória latente :math:` Z ` seguindo uma distribuição normal padrão, a probabilidade padrão do ativo :math:` k ` é dada por
ta_in: இந்த டுடோரியலில் ஒரு போர்ட்ஃபோலியோவின் கடன் அபாயத்தை பகுப்பாய்வு செய்ய விரும்புகிறோம்:math:`K'சொத்துக்களை.ஒவ்வொரு சொத்தின் இயல்புநிலை நிகழ்தகவு:math:`k`* காஸியன் நிபந்தனை சுதந்திரம் * மாதிரியைப் பின்பற்றுகிறது, அதாவது, ஒரு மதிப்பு கொடுக்கப்பட்டுள்ளது :math:`z`ஒரு மறைந்த சீரற்ற மாறியில் இருந்து மாதிரி :math:`Z``நிலையான இயல்பான விநியோகத்தைப் பின்பற்றி, சொத்தின் இயல்புநிலை நிகழ்தகவு:math:`k` வழங்கியது

source: where :math:`F` denotes the cumulative distribution function of :math:`Z`, :math:`p_k^0` is the default probability of asset :math:`k` for :math:`z=0` and :math:`\rho_k` is the sensitivity of the default probability of asset :math:`k` with respect to :math:`Z`. Thus, given a concrete realization of :math:`Z` the individual default events are assumed to be independent from each other.
es_mx: donde :math:`F` denota la función de distribución acumulativa de :math:`Z`, :math:`p_k^0` es la probabilidad predeterminada del activo :math:`k` para :math:`z=0` y :math:`\rho_k` es la sensibilidad de la probabilidad predeterminada del activo :math:`k` con respecto a :math:`Z`. Por lo tanto, dada una realización concreta de :math:`Z`, los eventos individuales predeterminados se suponen independientes entre sí.
fr_fr: où :math:`F` indique la fonction de distribution cumulée de :math:`Z`, :math:`p_k^0` est la probabilité par défaut de l'actif :math:`k` pour :math:`z=0` et :math:`\rho_k` est la sensibilité de la probabilité par défaut de l'actif :math:`k` par rapport à :math:`Z`. Ainsi, compte tenu d'une réalisation concrète de :math:`Z` les événements par défaut individuels sont supposés être indépendants les uns des autres.
id_id: di mana :math:`F` menandakan fungsi distribusi kumulatif dari :math:`Z`, :math:`p_k^0` adalah probabilitas gagal bayar dari aset :math:`k` untuk :math:`z=0` dan :math:`\rho_k` adalah sensitivitas dari probabilitas gagal bayar aset :math:`k` terhadap :math:`Z`. Dengan demikian, jika terdapat sebuah realisasi konkret dari :math:`Z` maka kejadian gagal bayar individual diasumsikan tidak saling bergantung satu sama lain.
pt_br: onde :math:`F` denota a função de distribuição cumulativa de :math:`Z`, :math:`p_k^0` é a probabilidade padrão do ativo :math:`k` para :math:`z=0` e :math:`\rho_k` é a sensibilidade da probabilidade padrão do ativo :math:`k` com relação a :math:`Z`. Assim, dada uma realização concreta de :math:`Z` os eventos individuais padrões assumem-se como independentes uns dos outros.
ta_in: எங்கே: கணிதம்: `F` என்பது ஒட்டுமொத்த விநியோக செயல்பாட்டைக் குறிக்கிறது :math:` Z` ,:math: `p_k ^ 0` என்பது சொத்தின் இயல்புநிலை நிகழ்தகவு:math:` k` க்கு:math:`z = 0` மற்றும் :math:`\rho_k` என்பது சொத்தின் இயல்புநிலை நிகழ்தகவின் உணர்திறன்:math:` k` தொடர்பா :math: `Z`. ஆகவே, கணிதத்தின் ஒரு தெளிவான உணர்தல் கொடுக்கப்பட்டால்:math: `Z` தனிப்பட்ட இயல்புநிலை நிகழ்வுகள் ஒருவருக்கொருவர் சுயாதீனமாக கருதப்படுகின்றன.

source: We are interested in analyzing risk measures of the total loss
es_mx: Estamos interesados en analizar las medidas de riesgo de la pérdida total
fr_fr: Nous nous intéressons à l'analyse des mesures de risque de perte totale
id_id: Kami tertarik untuk menganalisis tindakan risiko dari kerugian total
pt_br: Estamos interessados em analisar medições de risco de perda total
ta_in: மொத்த இழப்பின் ஆபத்து நடவடிக்கைகளை பகுப்பாய்வு செய்வதில் நாங்கள் ஆர்வமாக உள்ளோம்

source: where :math:`\lambda_k` denotes the *loss given default* of asset :math:`k`, and given :math:`Z`, :math:`X_k(Z)` denotes a Bernoulli variable representing the default event of asset :math:`k`. More precisely, we are interested in the expected value :math:`\mathbb{E}[L]`, the Value at Risk (VaR) of :math:`L` and the Conditional Value at Risk of :math:`L` (also called Expected Shortfall). Where VaR and CVaR are defined as
es_mx: donde :math:`\lambda_k` denota la *pérdida dado el incumplimiento* del activo :math:`k`, y dada :math:`Z`, :math:`X_k(Z)`denota una variable de Bernoulli que representa el evento predeterminado del activo :math:`k`. Más precisamente, estamos interesados en el valor esperado :math:`\mathbb{E}[L]`, el valor en riesgo (Value at Risk, VaR) de :math:`L` y el Valor en Riesgo Condicional de :math:`L` (también llamado Déficit Esperado). Donde VaR y CVaR se definen como
fr_fr: où :math:`\lambda_k` indique la *perte par défaut* de l'actif :math:`k`, et a donné :math:`Z`, :math:`X_k(Z)` désigne une variable de Bernoulli représentant l'événement par défaut de l'actif :math:`k`. Plus précisément, nous nous interessons à la valeur espérée :math:`\mathbb{E}[L]`, la valeur à risque (VaR) de :math:`L` et la valeur conditionnelle à risque de :math:`L` (également appelée déficit attendu). Là où VaR et CVaR sont définis comme
id_id: dimana :math:`\lambda_k` menandakan *perkiraan kerugian akibat gagal bayar* dari aset :math:`k` dan dengan :math:`Z`, :math:`X_k(Z)` menandakan variabel Bernoulli yang mewakili kejadian gagal bayar aset :math:`k`. Lebih tepatnya, kita tertarik pada nilai yang diharapkan :math:`\mathbb{E}[L]`, Nilai Terisiko (Value at Risk/VaR) dari :math:`L` dan Nilai Terisiko Bersyarat (Conditional Value at Risk) dari :math:`L` (disebut juga sebagai Perkiraan Kekurangan (Expected Shortfall). Di mana VaR dan CVaR didefinisikan sebagai
pt_br: onde :math:`\lambda_k` denota a *perda dada padrão* do ativo :math:`k`, e dada :math:`Z`, :math:`X_k (Z)` denota uma variável Bernoulli representando o evento padrão do ativo :math:`k`. Mais precisamente, estamos interessados no valor esperado :math:`\mathbb{E}[L]`, o Valor em Risco (VaR) de :math:`L` e o Valor Condicional em Risco de :math:`L` (também chamado de Shortfall Esperado). Onde VaR e CVaR são definidos como
ta_in: இங்கே:math: `\ lambda_k` என்பது சொத்தின் * கொடுக்கப்பட்ட இயல்புநிலையை * குறிக்கிறது:math:` k`, மற்றும் கொடுக்கப்பட்ட:math:`Z` ,:math:` X_k (Z) `இயல்புநிலை நிகழ்வைக் குறிக்கும் பெர்னலி மாறியைக் குறிக்கிறது சொத்து:math: `கே`. இன்னும் துல்லியமாக, எதிர்பார்க்கப்படும் மதிப்பில் நாங்கள் ஆர்வமாக உள்ளோம்:math: `\ mathbb {E} [L]`, இடர் மதிப்பு (VaR):math:`L` மற்றும் ஆபத்தில் நிபந்தனை மதிப்பு:math:` L `(எதிர்பார்க்கப்படும் பற்றாக்குறை என்றும் அழைக்கப்படுகிறது). VaR மற்றும் CVaR என வரையறுக்கப்பட்டுள்ளது

source: with confidence level :math:`\alpha \in [0, 1]`, and
es_mx: con nivel de confianza :math:`\alpha \in [0, 1]`, y
fr_fr: avec le niveau de confiance :math:`\alpha \in [0, 1]`, et
id_id: dengan tingkat kepercayaan :math:`\alpha \in [0, 1]`, dan
pt_br: com nível de confiança :math:`\alpha \in [0, 1]`, e
ta_in: நம்பிக்கை மட்டத்துடன்:math:`\alpha \in [0, 1]`,மற்றும்

source: For more details on the considered model, see, e.g., Regulatory Capital Modeling for Credit Risk. Marek Rutkowski, Silvio Tarca
es_mx: Para mas detalles sobre el modelo considerado, consulte, por ejemplo, Regulatory Capital Modeling for Credit Risk. Marek Rutkowski, Silvio Tarca
fr_fr: Pour plus de détails sur le modèle considéré, voir par exemple Regulatory Capital Modeling for Credit Risk. Marek Rutkowski, Silvio Tarca
id_id: Untuk informasi lebih lanjut mengenai model yang dipertimbangkan, lihat, misalnya, Regulatory Capital Modeling for Credit Risk. Marek Rutkowski, Silvio Tarca
pt_br: Para obter mais detalhes sobre o modelo considerado, veja, por exemplo, Regulatory Capital Modeling for Credit Risk. Marek Rutkowski, Silvio Tarca
ta_in: கருதப்பட்ட மாதிரி பற்றிய கூடுதல் விவரங்களுக்கு, பார்க்க,e.g., Regulatory Capital Modeling for Credit Risk. Marek Rutkowski, Silvio Tarca

source: The problem is defined by the following parameters: - number of qubits used to represent :math:`Z`, denoted by :math:`n_z` - truncation value for :math:`Z`, denoted by :math:`z_{\text{max}}`, i.e., Z is assumed to take :math:`2^{n_z}` equidistant values in :math:`\{-z_{max}, ..., +z_{max}\}` - the base default probabilities for each asset :math:`p_0^k \in (0, 1)`, :math:`k=1, ..., K` - sensitivities of the default probabilities with respect to :math:`Z`, denoted by :math:`\rho_k \in [0, 1)` - loss given default for asset :math:`k`, denoted by :math:`\lambda_k` - confidence level for VaR / CVaR :math:`\alpha \in [0, 1]`.
es_mx: El problema está definido por los siguientes parámetros: - número de qubits usados para representar :math:`Z`, denotado por :math:`n_z` - valor de truncamiento para :math:`Z`, denotado por :math:`z_{\text{max}}`, es decir, se supone que Z toma :math:`2^{n_z}` valores equidistantes en :math:`\{-z_{max}, ..., +z_{max}\}` - las probabilidades predeterminadas base para cada activo :math:`p_0^k \in (0, 1)`, :math:`k=1, ..., K` - sensibilidades de las probabilidades predeterminadas con respecto a :math:`Z`, denotadas por :math:`\rho_k \in [0, 1)` - pérdida dado el incumplimiento para el activo :math:`k`, denotada por :math:`\lambda_k` - nivel de confianza para VaR / CVaR :math:`\alpha \in [0, 1]`.
fr_fr: Le problème est défini par les paramètres suivants : - nombre de qubits utilisés pour représenter :math:`Z`, notés :math:`n_z` - valeur de troncature pour :math:`Z`, dénoté par :math:`z_{\text{max}}`, i. ., Z est supposé prendre :math:`2^{n_z}` valeurs équidistantes dans :math:`\{-z_{max}, ... +z_{max}\}` - les probabilités par défaut de base pour chaque ressource :math:`p_0^k \in (0, 1)`, :math:`k=1, ... K` - Sensibilité des probabilités par défaut par rapport à :math:`Z`, notés :math:`\rho_k \in [0, 1)` - perte par défaut pour la ressource :math:`k`, notée :math:`\lambda_k` - niveau de confiance pour VaR / CVaR :math:`\alpha \in [0, 1]`.
id_id: Permasalahan tersebut didefinisikan oleh parameter-parameter berikut: - jumlah qubit yang digunakan untuk mewakili :math:`Z`, ditandai dengan :math:`n_z` - nilai pemotongan untuk :math:`Z`, ditandai dengan :math:`z_{\text{max}}`, yaitu Z diasumsikan mengambil nilai-nilai ekuidistan :math:`2^{n_z}` dalam :math:`\{-z_{max}, ..., +z_{max}\}` - probabilitas gagal bayar dasar untuk setiap aset :math:`p_0^k \in (0, 1)`, :math:`k=1, ..., K` - sensitivitas probabilitas gagal bayar terhadap :math:`Z`, ditandai oleh :math:`\rho_k \in [0, 1)` - kerugian akibat gagal bayar untuk aset :math:`k`, ditandai oleh :math:`\lambda_k` - tingkat kepercayaan untuk VaR / CVaR :math:`\alpha \in [0, 1]`.
pt_br: O problema é definido pelos seguintes parâmetros: - número de qubits usados para representar :math:`Z`, denotado por :math:`n_z` - valor de truncamento para :math:`Z`, denotado por :math:`z_{\text{max}}`, i. ., Z presume-se que tenha :math:`2^{n_z}` valores equidistantes em :math:`\{-z_{max}, ... +z_{max}\}` - as probabilidades padrões base para cada ativo :math:`p_0^k \in (0, 1)`, :math:`k=1, ... K` - sensibilidades das probabilidades padrão em relação a :math:`Z`, denotado por :math:`\rho_k \in [0, 1)` - perda padrão dada para o ativo :math:`k`, denotado por :math:`\lambda_k` - nível de confiança do VaR / CVaR :math:`\alpha \in [0, 1]`.
ta_in: சிக்கல் பின்வரும் அளவுருக்களால் வரையறுக்கப்படுகிறது: - பிரதிநிதித்துவப்படுத்த பயன்படுத்தப்படும் குவிட்களின் எண்ணிக:math:`Z`, இதன் மூலம் குறிக்கப்படுகிறது:math:` n_z` - இதற்கான துண்டிப்பு மதிப்பு:math: `Z`, குறிக்கப்படுகிறது, :math:`z_{\text{max}}`,அதாவது Z எடுக்கப்படும் என்று கருதப்படுகிறது:math:`2^{n_z} `இதில் சமமான மதிப்புகள் :math:`\{-z_{max}, ..., +z_{max}\}`- ஒவ்வொரு சொத்துக்கும் அடிப்படை இயல்புநிலை நிகழ்தகவுகள் :math:`p_0^k \in (0, 1)`, :math:`k=1, ..., K` - இது தொடர்பான இயல்புநிலை நிகழ்தகவுகளின் உணர்திறன்-:math:`Z`, denoted by :math:`\rho_k \in [0, 1)`சொத்துக்கான இயல்புநிலை கொடுக்கப்பட்ட இழப்பு:math:` k`, குறிக்கப்படுகிறது:math: `\ lambda_k` - VaR / க்கான நம்பிக்கை நிலை CVaR:math:`\alpha \in [0, 1]`.

source: Uncertainty Model
es_mx: Modelo de Incertidumbre
fr_fr: Modèle d'incertitude
id_id: Model Ketidakpastian
pt_br: Modelo de incerteza
ta_in: நிச்சயமற்ற மாதிரி

source: We now construct a circuit that loads the uncertainty model. This can be achieved by creating a quantum state in a register of :math:`n_z` qubits that represents :math:`Z` following a standard normal distribution. This state is then used to control single qubit Y-rotations on a second qubit register of :math:`K` qubits, where a :math:`|1\rangle` state of qubit :math:`k` represents the default event of asset :math:`k`. The resulting quantum state can be written as
es_mx: Ahora construimos un circuito que carga el modelo de incertidumbre. Esto se puede lograr creando un estado cuántico en un registro de :math:`n_z` qubits que represente a :math:`Z` siguiendo una distribución normal estándar. Este estado luego se usa para controlar rotaciones Y de un solo qubit sobre un segundo registro de qubit de :math:`K` qubits, donde el estado :math:`|1\rangle` del qubit :math:`k` representa el evento predeterminado del activo :math:`k`. El estado cuántico resultante se puede escribir como
fr_fr: Nous construisons maintenant un circuit qui permet de charger le modèle d'incertitude. Ceci peut être réalisé en créant un état quantique dans un registre de :math:`n_z` qubits qui représente :math:`Z` suivant une distribution normale standard. Cet état est ensuite utilisé pour contrôler des rotations en Y sur un second registre de qubits de :math:`K`qubits, où un état :math:`|1\rangle` de qubit :math:`k` représente l'événement par défaut de l'asset :math:`k`. L'état quantique résultant peut être écrit comme
id_id: Kita sekarang membangun sebuah rangkaian yang memuat model ketidakpastian tersebut. Ini dapat dicapai dengan membuat sebuah keadaan kuantum dalam sebuah daftar berisi qubit-qubit :math:`n_z` yang merepresentasikan :math:`Z` dengan mengikuti distribusi normal standar. Keadaan ini kemudian digunakan untuk mengendalikan rotasi-Y qubit satuan pada sebuah daftar qubit kedua yang terdiri dari :math:`K` qubit, di mana sebuah keadaan :math:`|1\rangle` pada qubit :math:`k` merepresentasikan kejadian gagal bayar pada aset :math:`k`. Keadaan kuantum yang dihasilkan dapat ditulis sebagai
pt_br: Nós agora construímos um circuito que carrega o modelo de incerteza. Isto pode ser alcançado através da criação de um estado quântico num registo de :math:`n_z` qubits que representa :math:`Z` seguindo uma distribuição normal padrão. Este estado é então utilizado para controlar o único qubit Y-rotações em um segundo registo de qubit de :math:`K` qubits, onde um estado :math:` | 1\rangle` do qubit :math:`k` representa o evento padrão do ativo :math:`k`. O estado quântico resultante pode ser escrito como
ta_in: நிச்சயமற்ற மாதிரியை ஏற்றும் ஒரு சுற்று ஒன்றை இப்போது உருவாக்குகிறோம். ஒரு பதிவேட்டில் ஒரு குவாண்டம் நிலையை உருவாக்குவதன் மூலம் இதை அடைய முடியும்:math: `n_z` க்யூபிட்ஸ் குறிக்கும்:math:` Z` ஒரு நிலையான சாதாரண விநியோகத்தைத் தொடர்ந்து. இந்த நிலை பின்னர் இரண்டாவது க்யூபிட் பதிவேட்டில் ஒற்றை க்யூபிட் ஒய்-சுழற்சிகளைக் கட்டுப்படுத்தப் பயன்படுகிறது:math:`கே` குவிட்ஸ், அங்கு ஒரு:math:` | 1 \rangle` க்யூபிட் நிலை:math: `k` இயல்புநிலை நிகழ்வைக் குறிக்கிறது சொத்து:math: `k`. இதன் விளைவாக குவாண்டம் நிலையை இவ்வாறு எழுதலாம்

source: where we denote by :math:`z_i` the :math:`i`-th value of the discretized and truncated :math:`Z` [Egger2019].
es_mx: donde denotamos por :math:`z_i` el :math:`i`-ésimo valor de :math:`Z` truncado y discretizado [Egger2019].
fr_fr: où nous notons :math:`z_i` la :math:`i`-ème valeur de la valeur discrétisée et tronquée :math:`Z` [Egger2019].
id_id: di mana kita menandai dengan :math:`z_i` nilai :math:`i` kesekian dari :math:`Z` yang didiskritkan dan dipotong [Egger2019].
pt_br: onde denotamos por :math:`z_i` the :math:`i`-th valor discreto e truncado :math:`Z` [Egger2019].
ta_in: அங்கு நாம் குறிக்கிறோம் :math:`z_i` the :math:`i`துண்டிக்கப்பட்ட மற்றும் துண்டிக்கப்பட்டவற்றின் மதிப்பு :math:`Z` [Egger2019].
