Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/finance/10_qgan_option_pricing.po
Languages: fr_fr, id_id, ko_kr, pt_br, ta_in

source: This page was generated from `tutorials/finance/10_qgan_option_pricing.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/finance/10_qgan_option_pricing.ipynb`__.
id_id: Halaman ini dibuat dari ` tutorials/finance/05_bull_spread_pricing.ipynb ` __.
ko_kr: 이 페이지는 `tutorials/finance/10_qgan_option_pricing.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada, a partir do `tutorials/finance/10_qgan_option_pricing.ipynb`__.
ta_in: இந்த பக்கம் உருவாக்கப்பட்டது`tutorials/finance/10_qgan_option_pricing.ipynb`__.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/10_qgan_option_pricing.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/10_qgan_option_pricing.ipynb>`_.
id_id: Jalankan secara interaktif di 'IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/01_portfolio_optimization.ipynb>`_.
ko_kr: `IBM 퀀텀 랩 <https://quantum-computing.ibm.com/jupyter/tutorial/finance/10_qgan_option_pricing.ipynb>`__ 에서 대화식으로 실행하시오.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/10_qgan_option_pricing.ipynb>`_.
ta_in: IBM குவாண்டம் ஆய்வகத்தில் ஊடாடும் வகையில் இயக்கவும் <https://quantum-computing.ibm.com/jupyter/tutorial/finance/10_qgan_option_pricing.ipynb>_.

source: *Option Pricing with qGANs*
fr_fr: ** Tarification des options avec qGANs**
id_id: *Opsi kalkulasi harga dengan qGANs *
ko_kr: *qGANs 을 이용한 옵션 가격 책정 (Option Pricing)*
pt_br: **Precificação de Opções com qGANs**
ta_in: *qGANs உடன் விருப்ப விலை*

source: Introduction
id_id: Pendahuluan
ko_kr: 소개
pt_br: Introdução
ta_in: அறிமுகம்

source: In this notebook, we discuss how a Quantum Machine Learning Algorithm, namely a quantum Generative Adversarial Network (qGAN), can facilitate the pricing of a European call option. More specifically, a qGAN can be trained such that a quantum circuit models the spot price of an asset underlying a European call option. The resulting model can then be integrated into a Quantum Amplitude Estimation based algorithm to evaluate the expected payoff - see `European Call Option Pricing <03_european_call_option_pricing.ipynb>`__. For further details on learning and loading random distributions by training a qGAN please refer to Quantum Generative Adversarial Networks for Learning and Loading Random Distributions. Zoufal, Lucchi, Woerner. 2019.
fr_fr: Dans ce bloc-notes, nous discutons de la façon dont un algorithme d'apprentissage Quantum Machine Learning Algorithm, à savoir un Qgan (quantum Generative Adversarial Network), peut faciliter la tarification d'une option d'appel européen. Plus précisément, un qGAN peut être entrainé de telle sorte qu'un circuit quantique puisse représenter un modèle de prix au comptant d'un actif sous-jacent à une option d'appel européen. Le modèle qui en résulte peut ensuite être intégré à un algorithme basé sur l'estimation de l'amplitude quantique pour évaluer le paiement anticipé-voir "Prix de l'option d'appel européen" <03_european_call_option_pricing.ipynb>`__. Pour plus de détails sur l'apprentissage et le chargement des distributions aléatoires, veuillez vous référer à Quantum Generative Adversarial Networks for Learning and Loading Random Distributions. Zoufal, Lucchi, Woerner.
id_id: Dalam notebook ini, kita membahas bagaimana sebuah Algoritma Quantum Machine Learning, yaitu quantum Generative Adversarial Network (qGAN), dapat memfasilitasi penetapan harga sebuah pilihan euripean call. Lebih spesifik lagi, sebuah qGAN dapat dilatih sedemikian rupa sehingga sebuah sirkuit kuantum model harga tempat dari aset yang mendasari opsi panggilan Eropa. Model yang dihasilkan kemudian dapat diintegrasikan ke dalam sebuah algoritma berbasis Quantum Amplitude Estimasi untuk mengevaluasi pembayaran yang diharapkan. Lihat ` European Call Option Pricing <03_european_call_option_pricing.ipynb> ` __. Untuk rincian lebih lanjut tentang pembelajaran dan pemuatan distribusi acak dengan melatih sebuah qGAN silahkan mengacu pada Quantum Generative Adversarial Networks for Learning and Loading Random Distro. (Inggris) Zoufal, Lucchi, Woerner. 2019.
ko_kr: 이 노트북에서는 퀀텀 머신 러닝 알고리즘 (Quantum Machine Learning Algorithm), 즉 퀀텀 (quantum Generative Adversarial Network, qGAN) 이 유럽 호출 옵션의 가격 결정을 용이하게 할 수 있는 방법에 대해 논의한다. 보다 구체적으로, qGAN 은 양자 회로가 유럽 콜옵션에 기초한 자산의 현물 가격을 모델링하도록 훈련될 수 있다. 그 결과 얻어진 모델을 퀀텀 진폭 추정 (Quantum Amplitude Estimation) 기반 알고리즘에 통합하여 예상되는 페이오프를 평가할 수 있다 - 참고: `유럽 콜옵션 가격 모델링 <03_european_call_option_pricing.ipynb>`__. qGAN을 훈련하여 랜덤 분포를 학습하고 로드하는 방법에 대한 자세한 내용은 퀀텀 생성 (Quantum Generative Adversarial Networks for Learning and loading Random Distributions) 을 참조하십시오. Zoufal, Lucchi, Woerner. 2019.
pt_br: Neste capitulo, discutimos como um Algoritmo Quântico de Aprendizado de Máquina, a saber, uma Rede Adversária Geradora quântica (qGAN), pode facilitar a determinação do preço de uma opção de compra européia. Mais especificamente, uma qGAN pode ser treinada, tal que modelos de circuito quântico evidenciem o preço à vista de um ativo subjacente a uma opção de compra européia. O modelo resultante pode, então, ser integrado a um algoritmo, baseado em Estimativa de Amplitude Quântica para avaliar o pagamento esperado - veja `Determinando os preços de opções de compra européias <03_european_call_option_pricing.ipynb>`__. Para obter mais detalhes sobre aprendizado e carregamento de distribuições aleatórias, através do treinamento de uma qGAN, consulte Quantum Generative Adversarial Networks for Learning and Loading Random Distributions. Zoufal, Lucchi, Woerner. 2019.
ta_in: இந்த நோட்புக்கில், ஒரு குவாண்டம் இயந்திர கற்றல் வழிமுறை எவ்வாறு விவாதிக்கிறோம், அதாவது குவாண்டம் ஜெனரேடிவ் அட்வர்சரியல் நெட்வொர்க் (q GAN) , ஒரு ஐரோப்பிய அழைப்பு விருப்பத்தின் விலையை எளிதாக்கும்.மேலும் குறிப்பாக,ஒரு குவாண்டம் சர்க்யூட் ஒரு ஐரோப்பிய அழைப்பு விருப்பத்தின் அடிப்படையிலான ஒரு சொத்தின் ஸ்பாட் விலையை மாதிரியாகக் கொண்ட ஒரு q GAN க்கு பயிற்சி அளிக்க முடியும்.இதன் விளைவாக மாதிரியை எதிர்பார்த்த ஊதியத்தை மதிப்பிடுவதற்கு குவாண்டம் அலைவீச்சு மதிப்பீட்டு அடிப்படையிலான வழிமுறையில் ஒருங்கிணைக்க முடியும் - பார்க்க `European Call Option Pricing <03_european_call_option_pricing.ipynb>`__.ஒரு q GAN ஐப் பயிற்றுவிப்பதன் மூலம் சீரற்ற விநியோகங்களைக் கற்றல் மற்றும் ஏற்றுவது பற்றிய கூடுதல் விவரங்களுக்கு, ரேண்டம் விநியோகங்களை கற்றல் மற்றும் ஏற்றுவதற்கான குவாண்டம் ஜெனரேடிவ் விரோதி நெட்வொர்க்குகளைப் பார்க்கவும்.Zoufal,Lucchi,Woerner. 2019.

source: Uncertainty Model
fr_fr: Modèle d'incertitude
id_id: Model Ketidakpastian
ko_kr: 불확실성 모델
pt_br: Modelo de incerteza
ta_in: நிச்சயமற்ற மாதிரி

source: The Black-Scholes model assumes that the spot price at maturity :math:`S_T` for a European call option is log-normally distributed. Thus, we can train a qGAN on samples from a log-normal distribution and use the result as an uncertainty model underlying the option. In the following, we construct a quantum circuit that loads the uncertainty model. The circuit output reads
fr_fr: Le modèle Black-Scholes suppose que le prix au comptant à l'échéance :math:` S_T ` pour une option d'appel européen suite un loi de distribution log-normale. Ainsi, nous pouvons former un qGAN sur des échantillons à partir d'une distribution log-normale et utiliser le résultat comme un modèle d'incertitude sous-jacent à l'option. Dans ce qui suit, nous construisons un circuit quantique qui charge le modèle d'incertitude. La sortie du circuit représente
id_id: Model Black-Scholes mengasumsikan bahwa spot price pada puncak :math:` S_T ` untuk pilihan European call adalah log-biasanya didistribusikan. Dengan demikian, kita dapat melatih sebuah qGAN pada sampel dari distribusi yang normal log dan menggunakan hasilnya sebagai model ketidakpastian yang mendasari pilihan. Dalam hal berikut, kami membangun sirkuit kuantum yang banyak membuat model ketidakpastian. Keluaran sirkuit berbunyi
ko_kr: 블랙 스콜스 모델은 유럽 호출 옵션에 대한 성숙도 :math:`S_T` 의 현물 가격이 정상적으로 분산되어 있다고 가정합니다. 따라서, 로그 정규 분포의 샘플에 대해 qGAN을 훈련하고 결과를 옵션에 기반한 불확실성 모델로 사용할 수 있다. 다음에, 불확실성 모델을 로딩하는 양자 회로를 구성한다. 회로 출력 판독
pt_br: O modelo de Black-Scholes assume que o preço à vista no vencimento :math:`S_T` para uma opção de compra européia é log-normalmente distribuído. Assim, podemos treinar uma qGAN em amostras de uma distribuição log-normal e utilizar o resultado como um modelo de incerteza subjacente à opção. A seguir, construímos um circuito quântico que carrega o modelo de incerteza. A saída do circuito mostra
ta_in: பிளாக்-ஷோல்ஸ் மாதிரி முதிர்ச்சியடைந்த இடத்தில் விலை என்று கருதுகிறது :math:`S_T` ஒரு ஐரோப்பிய அழைப்பு விருப்பம் பதிவு-பொதுவாக விநியோகிக்கப்படுகிறது.எனவே, ஒரு பதிவு-சாதாரண விநியோகத்திலிருந்து மாதிரிகளில் ஒரு qGAN ஐப் பயிற்றுவிக்கலாம் மற்றும் முடிவை விருப்பத்தின் அடிப்படையிலான நிச்சயமற்ற மாதிரியாகப் பயன்படுத்தலாம்.பின்வருவனவற்றில், நிச்சயமற்ற மாதிரியை ஏற்றும் ஒரு குவாண்டம் சுற்று ஒன்றை உருவாக்குகிறோம். சுற்று வெளியீடு படிக்கிறது.சுற்று வெளியீடு படிக்கிறது

source: where the probabilities :math:`p_{\theta}^{j}`, for :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, represent a model of the target distribution.
fr_fr: où les probabilités :math:` p_ {\theta } ^{j}`, pour :math:` j\in \left\{0, \ldots, { 2 ^ n-1 } \right\ } `, représentent un modèle de la distribution cible.
id_id: dimana probabilitasnya :math:` p_ {\theta} ^{j}`, untuk :math:` j\in \left\{0, \ldots, {2 ^ n-1} \right\} `, mewakili sebuah model dari distribusi target.
ko_kr: 여기서, :math:`j\in \left\{0, \ldots, {2^n-1} \right\}` 에 대한 확률 :math:`p_{\theta}^{j}` 는 대상 분포의 모델을 나타낸다.
pt_br: onde as probabilidades :math:`p_{\theta}^{j}`, para :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, representam um modelo da distribuição alvo.
ta_in: நிகழ்தகவுகள் :math:`p_{\theta}^{j}`, for :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, இலக்கு விநியோகத்தின் மாதிரியைக் குறிக்கும்.

source: Evaluate Expected Payoff
fr_fr: Evaluer le paiement attendu
id_id: Evaluasi Hasil yang Diharapkan
ko_kr: 기대수익 (Expected Payoff) 평가
pt_br: Avaliando o Payoff Esperado
ta_in: எதிர்பார்க்கப்படும் ஊதியத்தை மதிப்பிடுங்கள்

source: Now, the trained uncertainty model can be used to evaluate the expectation value of the option’s payoff function with Quantum Amplitude Estimation.
fr_fr: Maintenant, le modèle d'incertitude ainsi entrainé peut être utilisé pour évaluer l'espérance de la fonction de paiement de l'option grâce à l'estimation d'amplitude quantique.
id_id: Sekarang, model ketidakpastian yang terlatih dapat digunakan untuk mengevaluasi nilai ekspektasi dari fungsi payoff pilihan dengan Quantum Amplitude Estimasi.
ko_kr: 이제 훈련된 불확실성 모델을 사용하여 퀀텀 진폭 추정으로 옵션의 페이오프 함수의 기대값을 평가할 수 있다.
pt_br: Agora, o modelo de incerteza treinado pode ser usado para avaliar o valor esperado da função de payoff da opção usando Estimativa de Amplitude Quântica.
ta_in: இப்போது, குவாண்டம் அலைவீச்சு மதிப்பீட்டைக் கொண்டு விருப்பத்தின் செலுத்துதல் செயல்பாட்டின் எதிர்பார்ப்பு மதிப்பை மதிப்பீடு செய்ய பயிற்சி பெற்ற நிச்சயமற்ற மாதிரியைப் பயன்படுத்தலாம்.

source: Plot the probability distribution
fr_fr: Traçage de la distribution des probabilités
id_id: Plot distribusi probabilitas
ko_kr: 확률 분포를 플롯합니다.
pt_br: Plotando a distribuição de probabilidade
ta_in: வரைதல் நிகழ்தகவு பகிர்ந்தளித்தல்

source: Next, we plot the trained probability distribution and, for reasons of comparison, also the target probability distribution.
fr_fr: Ensuite, nous traçons la distribution de probabilité entrainée, ainsi que la distribution de probabilité cible, pour des raisons de comparaison.
id_id: Selanjutnya, kita plot distribusi probabilitas yang terlatih, untuk alasan perbandingan, dan juga target distribusi probabilitas.
ko_kr: 다음으로, 우리는 훈련된 확률 분포를 구성하고, 비교의 이유로, 또한 타겟 확률 분포를 구성한다.
pt_br: A seguir, plotamos a distribuição de probabilidade treinada e, por razões de comparação, também a distribuição de probabilidade alvo.
ta_in: அடுத்து, பயிற்சியளிக்கப்பட்ட நிகழ்தகவு விநியோகத்தையும், ஒப்பீட்டு காரணங்களுக்காக, இலக்கு நிகழ்தகவு விநியோகத்தையும் நாங்கள் சதி செய்கிறோம்.

source: Now, the trained uncertainty model can be used to evaluate the expectation value of the option’s payoff function analytically and with Quantum Amplitude Estimation.
fr_fr: Maintenant, le modèle d'incertitude ainsi entrainé peut être utilisé pour évaluer l'espérance de la fonction de paiement de l'option grâce à l'estimation d'amplitude quantique.
id_id: Sekarang, model ketidakpastian yang terlatih dapat digunakan untuk mengevaluasi nilai ekspektasi dari fungsi payoff pilihan secara analitikal dan dengan Quantum Amplitude Estimation.
pt_br: Agora, o modelo de incerteza treinado pode ser usado para avaliar o valor esperado da função de payoff da opção de forma analítica e com a Estimativa de Amplitude Quântica.
ta_in: இப்போது, பயிற்சியளிக்கப்பட்ட நிச்சயமற்ற மாதிரியை, விருப்பத்தின் செலுத்துதல் செயல்பாட்டின் எதிர்பார்ப்பு மதிப்பை பகுப்பாய்வு ரீதியாகவும், குவாண்டம் அலைவீச்சு மதிப்பீட்டிலும் மதிப்பீடு செய்ய பயன்படுத்தலாம்.
