Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/finance/11_time_series.po
Languages: es_un, id_id, ja_jp, pt_br, ta_in

source: If and when you have access to NASDAQ Data on Demand using your own token, you should replace REPLACE-ME below with the token. To assure the security of the connection, you should also have your own means of validating NASDAQ's certificates. The DataOnDemandProvider constructor has an optional argument ``verify``, which can be ``None`` or a string or a boolean. If it is ``None``, certify certificates will be used (default). If verify is a string, it should be pointing to a certificate for the HTTPS connection to NASDAQ (dataondemand.nasdaq.com), either in the form of a CA\_BUNDLE file or a directory wherein to look.
pt_br: Se e quando você tiver acesso ao NASDAQ Data on Demand usando o seu próprio token, você deverá substituir REPLACE-ME abaixo com o token. Para garantir a segurança da conexão, você também deve ter o seu próprio meio de validar os certificados da NASDAQ. O construtor DataOnDemandProvider tem um argumento opcional ``verify``, que pode ser ``None``, um conjunto de caracteres ou um booleano. Se for ``None``, serão utilizados certificados de certificação (padrão). Se ``verify`` for um conjunto de caracteres, ele deve estar apontando para um certificado para a conexão HTTPS para NASDAQ (dataondemand.nasdaq.com), seja na forma de um arquivo CA\_BUNDLE ou de um diretório para busca.

source: For the actual use of the data, please see the portfolio\_optimization or portfolio\_diversification notebooks.
pt_br: Para o uso real dos dados, por favor, consulte os notebooks portfolio\_optimization ou portfolio\_diversificação.
