Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/finance/11_time_series.po
Languages: es_un, id_id, ja_jp, pt_br, ta_in

source: This page was generated from `tutorials/finance/11_time_series.ipynb`__.
es_un: Esta página fue generada a partir de `tutorials/finance/11_time_series.ipynb`__.
id_id: Halam ini dibuat dari `tutorials/finance/11_time_series.ipynb`__.
ja_jp: このページは `tutorials/finance/11_time_series.ipynb`__ から生成されました。
pt_br: Esta página foi gerada a partir de `tutorials/finance/11_time_series.ipynb`__.
ta_in: இந்த பக்கம் உருவாக்கப்பட்டது `tutorials/finance/11_time_series.ipynb`__.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/11_time_series.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/11_time_series.ipynb>`_.
id_id: Jalankan secara interaktif di 'IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/01_portfolio_optimization.ipynb>`_.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/finance/11_time_series.ipynb>`_ でインタラクティブに実行します。
ta_in: IBM குவாண்டம் ஆய்வகத்தில் ஊடாடும் வகையில் இயக்கவும் <https://quantum-computing.ibm.com/jupyter/tutorial/finance/11_time_series.ipynb> _.

source: *Loading and Processing Stock-Market Time-Series Data*
es_un: *Carga y Procesamiento de Datos de Series de Tiempo del Mercado de Valores*
id_id: * Memuat dan memproses data time-series pasar saham *
ja_jp: *株式市場時系列データの読み込みと処理*
ta_in: *பங்கு-சந்தை நேர-தொடர் தரவை ஏற்றுகிறது மற்றும் செயலாக்குகிறது*

source: Introduction
es_un: Introducción
id_id: Pendahuluan
ja_jp: はじめに
pt_br: Introdução
ta_in: அறிமுகம்

source: Across many problems in finance, one starts with time series. Here, we showcase how to generate pseudo-random time-series, download actual stock-market time series from a number of common providers, and how to compute time-series similarity measures.
es_un: En muchos problemas en finanzas, uno comienza con series de tiempo. Aquí, mostramos cómo generar series de tiempo pseudoaleatorias, descargar series de tiempo reales del mercado de valores de varios proveedores comunes y cómo calcular medidas de similitud de series de tiempo.
id_id: Di banyak masalah di bidang keuangan, salah satunya dimulai dengan time series. Di sini, kita menampilkan bagaimana menghasilkan pseudo-random time-series, menggunggah time series pasar saham yang aktual dari sejumlah penyedia umum, dan bagaimana menghitung kesamaan time-series.
ja_jp: 金融分野の多くの問題では、まず時系列から始まります。ここでは、疑似ランダム時系列を生成する方法、多くの一般的なプロバイダーから実際の株式市場の時系列をダウンロードする方法、そして時系列の類似度を計算する方法を紹介します。
pt_br: Dentre muitos problemas nas finanças, um começa com séries temporais. Aqui, mostraremos como gerar séries temporais pseudoaleatórias, baixar séries temporais reais do mercado de ações de vários provedores comuns, e como computar medidas de similaridade de séries temporais.
ta_in: நிதிகளில் பல சிக்கல்களில், ஒன்று நேரத் தொடரில் தொடங்குகிறது. போலி-சீரற்ற நேரத் தொடரை எவ்வாறு உருவாக்குவது, பல பொதுவான வழங்குநர்களிடமிருந்து உண்மையான பங்கு-சந்தை நேரத் தொடரைப் பதிவிறக்குவது மற்றும் நேர-தொடர் ஒற்றுமை நடவடிக்கைகளை எவ்வாறு கணக்கிடுவது என்பதை இங்கே காண்பிக்கிறோம்.

source: Once the data are loaded, you can run a variety of algorithms on those to aggregate the data. Notably, you can compute the covariance matrix or a variant, which would consider alternative time-series similarity measures based on dynamic time warping (DTW). In DTW, changes that vary in speed, e.g., one stock’s price following another stock’s price with a small delay, can be accommodated.
es_un: Una vez que se cargan los datos, puede ejecutar una variedad de algoritmos en ellos para agregar los datos. En particular, puede calcular la matriz de covarianza o una variante, que consideraría medidas de similitud de series de tiempo alternativas basadas en la deformación dinámica del tiempo (dynamic time warping, DTW). En DTW, se pueden acomodar cambios que varían en velocidad, por ejemplo, el precio de una acción siguiendo el precio de otra acción con un pequeño retraso.
id_id: Setelah data dimuat, Anda dapat menjalankan berbagai algoritma untuk mengumpulkan data. Terutama, Anda dapat menghitung matriks kovarians atau varian, yang akan mempertimbangkan ukuran kesamaan deret waktu alternatif berdasarkan dynamic time warping (DTW). Dalam DTW, perubahan yang bervariasi dalam kecepatan, misalnya, harga satu saham mengikuti harga saham lain dengan penundaan yang sedikit, dapat ditampung.
ta_in: தரவு ஏற்றப்பட்டதும், தரவைத் திரட்ட பலவிதமான வழிமுறைகளை இயக்கலாம். குறிப்பிடத்தக்க வகையில், நீங்கள் கோவாரன்ஸ் மேட்ரிக்ஸ் அல்லது ஒரு மாறுபாட்டைக் கணக்கிடலாம், இது டைனமிக் டைம் வார்பிங் (டி.டி.டபிள்யூ) அடிப்படையில் மாற்று நேர-தொடர் ஒற்றுமை நடவடிக்கைகளைக் கருத்தில் கொள்ளும். டி.டி.டபிள்யூவில், வேகத்தில் மாறுபடும் மாற்றங்கள், எ.கா., ஒரு பங்கின் விலை மற்றொரு பங்குகளின் விலையைத் தொடர்ந்து சிறிய தாமதத்துடன் இடமளிக்கலாம்.

source: If you wish, you can look into the underlying pseudo-random time-series using. Please note that the private class members (starting with underscore) may change in future releases of Qiskit.
es_un: Si lo deseas, puedes consultar las series de tiempo pseudoaleatorias subyacentes utilizando lo siguiente. Ten en cuenta que los miembros de la clase privada (que comienzan con un guión bajo) pueden cambiar en futuras versiones de Qiskit.
id_id: Jika Anda ingin, Anda dapat melihat ke dasarnya meggunakkan pseudo-random time-series. Harap perhatikan bahwa anggota kelas privat (dimulai dengan underscore) dapat berubah dalam rilis Qiskit di masa depan.
ja_jp: ご希望であれば、元になる疑似ランダム時系列を調べることができます。なお、プライベートクラスのメンバー（アンダースコアで始まる）は、Qiskitの将来のリリースで変更される可能性があることに注意してください。
pt_br: Se desejar, você pode observar as séries temporais pseudo-aleatórias subjacentes utilizadas. Por favor, considere que os membros da classe privada (começando pelo underline) podem mudar em lançamentos futuros do Qiskit.
ta_in: நீங்கள் விரும்பினால், நீங்கள் பயன்படுத்தும் போலி-சீரற்ற நேரத் தொடரைப் பார்க்கலாம். கிஸ்கிட்டின் எதிர்கால வெளியீடுகளில் தனியார் வகுப்பு உறுப்பினர்கள் (அடிக்கோடிட்டு தொடங்கி) மாறக்கூடும் என்பதை நினைவில் கொள்க.

source: Clearly, you can adapt the number and names of tickers and the range of dates:
es_un: Claramente, puedes adaptar el número y nombre de los símbolos, así como el rango de fechas:
id_id: Jelas, Anda dapat menyesuaikan angka dan nama tickers dan kisaran tanggal:
ja_jp: この場合、ティッカーの数と名前、日付の範囲を調整することができます。
pt_br: Claramente, você pode adaptar o número e os nomes dos tickers e o intervalo de datas:
ta_in: தெளிவாக, நீங்கள் டிக்கர்களின் எண்ணிக்கை மற்றும் பெயர்கள் மற்றும் தேதிகளின் வரம்பை மாற்றியமைக்கலாம்:

source: Access to closing-price time-series
es_un: Acceso a series de tiempo de precios de cierre
id_id: Akses untuk time-series harga penutupan
ja_jp: 終値の時系列へのアクセス
pt_br: Acessando o time-series do preço de fechamento
ta_in: இறுதி விலை நேரத் தொடருக்கான அணுகல்

source: While the access to real-time data usually requires a payment, it is possible to access historical (adjusted) closing prices via Wikipedia and Quandl free of charge, following registration at: https://www.quandl.com/?modal=register In the code below, one needs to specify actual tickers of actual NASDAQ issues and the access token you obtain from Quandl; by running the code below, you agree to the Quandl terms and conditions, including a liability waiver. Notice that at least two tickers are required for the computation of covariance and time-series matrices, but hundreds of tickers may go beyond the fair usage limits of Quandl.
es_un: Si bien el acceso a datos en tiempo real generalmente requiere un pago, es posible acceder a precios de cierre históricos (ajustados) a través de Wikipedia y Quandl de forma gratuita, luego del registro en: https://www.quandl.com/?modal=register En el siguiente código, es necesario especificar los códigos bursátiles concretos de activos de la NASDAQ y el token de acceso que obtienes de Quandl; al ejecutar el código a continuación, acepta los términos y condiciones de Quandl, incluida una exención de responsabilidad. Ten en cuenta que se requieren al menos dos códigos bursátiles para el cálculo de covarianza y matrices de series de tiempo, pero cientos de códigos bursátiles pueden ir más allá de los límites del uso razonable de Quandl.
id_id: Sementara akses ke data real-time biasanya membutuhkan bayaran, hal tersebut juga memungkinkan untuk mengakses harga penutupan historis melalui Wikipedia dan Quandl bebas biaya, berikut pendaftaran di: https://www.quandl.com/?modal=register Dalam kode di bawah ini, seseorang perlu untuk menentukan tickers aktual dari masalah NASDAQ terkini dan token akses yang Anda peroleh dari Quandl; dengan menjalankan kode di bawah ini, Anda menyetujui syarat dan ketentuan Quandl, termasuk pembebasan tanggung jawab. Perhatikan bahwa setidaknya dua ticker diperlukan untuk perhitungan kovarians dan matriks time-series, tetapi ratusan ticker mungkin melampaui batas penggunaan yang adil dari Quandl.
ja_jp: リアルタイムデータへのアクセスには通常支払いが必要ですが、WikipediaとQuandlを経由して過去の(調整済みの)終値に無料でアクセスすることができます。 https://www.quandl.com/?modal=register に登録が必要です。 以下のコードでは、実際のナスダック銘柄の実際のティッカーとQuandlから取得するアクセストークンを指定する必要があります; 以下のコードを実行することで、免責同意書を含むQuandlの利用規約に同意したことになります。共分散行列と時系列行列の計算には少なくとも2つのティッカーが必要ですが、数百のティッカーはQuandlの公正な使用制限を超えている可能性があることに注意してください。
pt_br: Enquanto o acesso a dados em tempo real geralmente requer um pagamento, é possível acessar preços de fechamento históricos (ajustados) via Wikipedia e Quandl de forma gratuita, seguindo o registro em: https://www.quandl.com/?modal=register No código abaixo, é necessário especificar os tickers reais da NASDAQ e o token de acesso que você obtém de Quandl; Ao executar o código abaixo, você concorda com os termos e condições de Quandl, incluindo uma renúncia de responsabilidade. Observe que pelo menos dois tickers são necessários para a computação de matrizes de covariância e de séries temporais, mas centenas de tickers podem ir além dos limites de uso justo do Quandl.
ta_in: நிகழ்நேர தரவுகளுக்கான அணுகலுக்கு வழக்கமாக கட்டணம் தேவைப்பட்டாலும், பதிவுசெய்ததைத் தொடர்ந்து விக்கிபீடியா மற்றும் குவாண்டல் வழியாக வரலாற்று (சரிசெய்யப்பட்ட) இறுதி விலைகளை இலவசமாக அணுக முடியும் : https://www.quandl.com/?modal=register கீழேயுள்ள குறியீட்டில், உண்மையான NASDAQ சிக்கல்களின் உண்மையான டிக்கர்களையும் குவாண்டலில் இருந்து நீங்கள் பெறும் அணுகல் டோக்கனையும் ஒருவர் குறிப்பிட வேண்டும்;கீழே உள்ள குறியீட்டை இயக்குவதன் மூலம், பொறுப்பு தள்ளுபடி உள்ளிட்ட குவாண்டல் விதிமுறைகளையும் நிபந்தனைகளையும் ஒப்புக்கொள்கிறீர்கள். கோவாரன்ஸ் மற்றும் நேர-தொடர் மெட்ரிக்ஸைக் கணக்கிடுவதற்கு குறைந்தது இரண்டு டிக்கர்கள் தேவை என்பதைக் கவனியுங்கள், ஆனால் நூற்றுக்கணக்கான டிக்கர்கள் குவாண்டலின் நியாயமான பயன்பாட்டு வரம்புகளுக்கு அப்பால் செல்லக்கூடும்.

source: Once the data are loaded, you can again compute the covariance matrix or its DTW variants.
es_un: Una vez cargados los datos, puedes volver a calcular la matriz de covarianza o sus variantes de DTW.
id_id: Setelah data dimuat, Anda dapat lagi menghitung matriks kovarians atau varian DTW nya.
pt_br: Assim que os dados são carregados, você pode voltar a calcular a matriz de covariância ou suas variantes DTW.
ta_in: தரவு ஏற்றப்பட்டதும், நீங்கள் மீண்டும் கோவாரன்ஸ் மேட்ரிக்ஸ் அல்லது அதன் DTW வகைகளை கணக்கிடலாம்.

source: If you wish, you can look into the underlying time-series using:
es_un: Si lo deseas, puedes ver la serie de tiempo subyacente utilizando:
id_id: Jika Anda ingin, Anda dapat melihat ke dalam deret waktu yang mendasari dengan menggunakan:
ja_jp: 必要であれば、以下のような方法で時系列を調べることができます。
pt_br: Se desejar, você pode olhar para o tempo subjacente-série usando:
ta_in: நீங்கள் விரும்பினால், இதைப் பயன்படுத்தி அடிப்படை நேரத் தொடரைப் பார்க்கலாம்:

source: [Optional] Setup token to access recent, fine-grained time-series
es_un: [Optional] Configurar un token para acceder a series de tiempo recientes y detalladas
id_id: [Optional] token pengaturan untuk akses baru-baru ini, seri time-grained time-series
ja_jp: [Optional] 最近の細かい時系列にアクセスするためのセットアップトークン
pt_br: [Optional] Configure o token para acessar séries temporais recentes e refinadas
ta_in: [Optional] சமீபத்திய, நேர்த்தியான நேரத் தொடரை அணுக டோக்கனை அமைக்கவும்

source: If you would like to download professional data, you will have to set-up a token with one of the major providers. Let us now illustrate the data with NASDAQ Data on Demand, which can supply bid and ask prices in arbitrary resolution, as well as aggregates such as daily adjusted closing prices, for NASDAQ and NYSE issues.
es_un: Si deseas descargar datos profesionales, deberás configurar un token con uno de los principales proveedores. Ilustremos ahora los datos con NASDAQ Data on Demand, que puede proporcionar precios de oferta y demanda a una resolución arbitraria, así como agregados, como precios de cierre ajustados diariamente, para activos de NASDAQ y de NYSE.
id_id: Jika Anda ingin mengunduh data profesional, Anda harus mengatur token dengan salah satu penyedia utama. Mari kita sekarang mengilustrasikan data dengan Data NASDAQ on Demand, yang dapat memasok penawaran dan meminta harga dalam resolusi arbiter, serta agregasi seperti harga penutupan harian, untuk masalah NASDAQ dan NYSE.
pt_br: Se você quiser fazer o download de dados profissionais, terá que configurar um token com um dos principais provedores. Vamos agora ilustrar os dados com o NASDAQ Data on Demand, que pode fazer ofertas e solicitar preços em resolução arbitrária, bem como dados agregados como preços de fechamento ajustados diários, para NASDAQ e NYSE.
ta_in: நீங்கள் தொழில்முறை தரவைப் பதிவிறக்க விரும்பினால், முக்கிய வழங்குநர்களில் ஒருவரிடம் டோக்கனை அமைக்க வேண்டும். NASDAQ டேட்டா ஆன் டிமாண்டுடன் தரவை இப்போது விளக்குவோம், இது ஏலத்தை வழங்கலாம் மற்றும் தன்னிச்சையான தீர்மானத்தில் விலைகளைக் கேட்கலாம், அத்துடன் NASDAQ மற்றும் NYSE சிக்கல்களுக்கு தினசரி சரிசெய்யப்பட்ட நிறைவு விலைகள் போன்ற திரட்டுகளையும் வழங்கலாம்.

source: If you don’t have NASDAQ Data on Demand license, you can contact NASDAQ (cf. https://business.nasdaq.com/intel/GIS/Nasdaq-Data-on-Demand.html) to obtain a trial or paid license.
es_un: Si no tienes una licencia de NASDAQ Data on Demand, puedes ponerte en contacto con NASDAQ (cf. https://business.nasdaq.com/intel/GIS/Nasdaq-Data-on-Demand.html) para obtener una licencia de prueba o de pago.
id_id: Jika Anda tidak memiliki lisensi NASDAQ Data on Demand, Anda dapat menghubungi NASDAQ (cf. https://business.nasdaq.com/intel/GIS/Nasdaq-Data-on-Demand.html) untuk mendapatkan trial atau lisensi berbayar.
ja_jp: NASDAQ Data on Demandライセンスをお持ちでない場合は、NASDAQ (https://business.nasdaq.com/intel/GIS/Nasdaq-Data-on-Demand.html)に連絡して、トライアルライセンスまたは有料ライセンスを取得できます。
ta_in: உங்களிடம் கோரிக்கை உரிமத்தில் NASDAQ தரவு இல்லையென்றால், நீங்கள் NASDAQ உடன் தொடர்பு கொள்ளலாம்.சோதனை அல்லது கட்டண உரிமத்தைப் பெற(cf. https://business.nasdaq.com/intel/GIS/Nasdaq-Data-on-Demand.html).

source: If and when you have access to NASDAQ Data on Demand using your own token, you should replace REPLACE-ME below with the token. To assure the security of the connection, you should also have your own means of validating NASDAQ’s certificates. The DataOnDemandProvider constructor has an optional argument ``verify``, which can be ``None`` or a string or a boolean. If it is ``None``, certify certificates will be used (default). If verify is a string, it should be pointing to a certificate for the HTTPS connection to NASDAQ (dataondemand.nasdaq.com), either in the form of a CA_BUNDLE file or a directory wherein to look.
es_un: Si tienes y cuando tengas acceso a NASDAQ Data on Demand utilizando tu propio token, debes reemplazar REPLACE-ME a continuación con el token. Para garantizar la seguridad de la conexión, también debes tener tus propios medios para validar los certificados de NASDAQ. El constructor DataOnDemandProvider tiene un argumento opcional ``verify``, que puede ser ``None`` o una cadena o un valor booleano. Si es ``None``, se utilizarán certificados de confirmación (predeterminado). Si la verificación es una cadena, deberías apuntar a un certificado para la conexión HTTPS a NASDAQ (dataondemand.nasdaq.com), ya sea en forma de archivo CA_BUNDLE o de un directorio donde buscar.
id_id: Jika dan ketika Anda memiliki akses ke Data NASDAQ on Demand dengan menggunakan token Anda sendiri, Anda harus mengganti REPLACE-ME di bawah ini dengan token. Untuk menjamin keamanan koneksi, Anda juga harus memiliki cara Anda sendiri untuk memvalidasi sertifikat NASDAQ. Konstruktor DataOnDemandProvider memiliki argumen opsional ` ` verifikasi ` `, yang dapat berupa ` ` None ` ` ` atau string atau boolean. Jika itu adalah ` ` None ` `, sertifikasi sertifikat akan digunakan (baku). Jika verifikasi adalah string, seharusnya menunjuk ke sebuah sertifikat untuk koneksi HTTPS ke NASDAQ (dataondemand.nasdaq.com), baik dalam bentuk file CA_BUNDLE atau direktori untuk melihat.
ta_in: உங்கள் சொந்த டோக்கனைப் பயன்படுத்தி NASDAQ டேட்டா ஆன் டிமாண்டிற்கு அணுகல் இருந்தால், கீழே உள்ள REPLACE_MEஐ டோக்கனுடன் மாற்ற வேண்டும். இணைப்பின் பாதுகாப்பை உறுதிப்படுத்த, NASDAQ சான்றிதழ்களை சரிபார்க்க உங்கள் சொந்த வழிகளும் இருக்க வேண்டும்.DataOnDemandProvider கட்டமைப்பாளருக்கு விருப்பமான வாதம் `` சரிபார்க்க`` உள்ளது, இது `` எதுவுமில்லை`` அல்லது சரம் அல்லது பூலியன். இது `` எதுவுமில்லை`` என்றால், சான்றிதழ் சான்றிதழ்கள் பயன்படுத்தப்படும் (இயல்புநிலை). சரிபார்ப்பு ஒரு சரம் என்றால், அது CA_BUNDLE கோப்பு வடிவில் அல்லது பார்க்க வேண்டிய கோப்பகத்தின் வடிவத்தில், NASDAQ (dataondemand.nasdaq.com) உடன் HTTPS இணைப்பிற்கான சான்றிதழை சுட்டிக்காட்ட வேண்டும்.

source: Another major vendor of stock market data is Exchange Data International (EDI), whose API can be used to query over 100 emerging and frontier markets that are Africa, Asia, Far East, Latin America and Middle East, as well as the more established ones. See: https://www.exchange-data.com/pricing-data/adjusted-prices.php#exchange-coverage for an overview of the coverage.
es_un: Otro proveedor principal de datos de mercado de valores es Exchange Data International (EDI), cuya API puede ser usada para consultar más de 100 mercados emergentes y fronterizos que son África, Asia, Extremo Oriente, América Latina y Medio Oriente, así como los mercados más establecidos. Veahttps://www.exchange-data.com/pricing-data/adjusted-prices.php#exchange-coverage para un resumen de la cobertura.
id_id: Vendor utama lain dari data pasar saham adalah Exchange Data International (EDI), yang API dapat digunakan untuk meminta lebih dari 100 pasar yang muncul dan terdepan yang merupakan Afrika, Asia, Timur Jauh, Amerika Latin dan Timur Tengah, serta yang lebih mapan. Lihat: https://www.exchange-data.com/pricing-data/adjusted-prices.php#exchange-coverage untuk ikhtisar cakupan.
ja_jp: もう 1 つの主要な株式市場データのベンダーは、 Exchange Data International (EDI)であり、その API を利用して、アフリカ、アジア、極東、ラテンアメリカ、中東など 100 を超える新興市場とフロンティア市場をはじめ、確率されたマーケットを照会することができます。 カバレッジの概要については、 https://www.exchange-data.com/pricing-data/adjusted-prices.php#exchangeを参照してください。
pt_br: Outro importante fornecedor de dados do mercado de ações é o Exchange Data International (EDI), cuja API podem ser usadas para consultar mais de 100 mercados emergentes e de fronteira que são África, Ásia, Extremo Oriente, América Latina e Oriente Médio, bem como os mais estabelecidos. Veja: https://www.exchange-data.com/pricing-data/adjusted-prices.php#exchange-cobertura para uma visão geral da cobertura.
ta_in: பங்குச் சந்தை தரவின் மற்றொரு முக்கிய விற்பனையாளர் எக்ஸ்சேஞ்ச் டேட்டா இன்டர்நேஷனல் (EDI) ஆகும், இதன் API ஆப்பிரிக்கா, ஆசியா, தூர கிழக்கு, லத்தீன் அமெரிக்கா மற்றும் மத்திய கிழக்கு ஆகிய 100 க்கும் மேற்பட்ட வளர்ந்து வரும் மற்றும் எல்லைப்புற சந்தைகளை வினவ பயன்படுகிறது, மேலும் நிறுவப்பட்டவை .கவரேஜ் பற்றிய கண்ணோட்டத்திற்கான பாதுகாப்பு பார்க்க:https://www.exchange-data.com/pricing-data/adjusted-prices.php#exchange.

source: The access again requires a valid access token to replace REPLACE-ME below. The token can be obtained on a trial or paid-for basis at: https://www.quandl.com/
es_un: El acceso nuevamente requiere un token de acceso válido para reemplazar REPLACE-ME a continuación. El token se puede obtener como una versión de prueba o de pago en: https://www.quandl.com/
id_id: Akses memerlukan token akses yang valid untuk menggantikan REPLACE-ME di bawah ini. Token dapat diperoleh pada uji coba atau secara berbayar di: https://www.quandl.com/
ja_jp: このアクセスには、 REPLACE-ME を置き換えるための有効なアクセス・トークンが再度必要です。 このトークンは、試用版または有料で https://www.quandl.com/ から取得できます。
pt_br: O acesso também requer um token de acesso válido para substituir REPLACE-ME abaixo. O token pode ser obtido em um teste ou pré-pago para uso em: https://www.quandl.com/
ta_in: அணுகலுக்கு மீண்டும் கீழே உள்ள REPLACE-ME ஐ மாற்ற சரியான அணுகல் டோக்கன் தேவைப்படுகிறது.டோக்கனை ஒரு சோதனை அல்லது கட்டண அடிப்படையில் பெறலாம்:https://www.quandl.com/

source: One can also access Yahoo Finance Data, no token needed, from Yahoo! Finance.
es_un: También se puede acceder a los datos de Yahoo Finance, sin necesidad de token, desde Yahoo! Finance.
id_id: Seseorang juga dapat mengakses data Yahoo Finance, tidak ada token yang dibutuhkan, dari Yahoo! Finance.
ja_jp: Yahoo! ファイナンスからYahooファイナンスデータに、トークン無しで、アクセスすることもできます。
pt_br: Um deles também pode acessar o Yahoo Finance Data, a partir do Yahoo! Finance, sem a necessidade de um token.
ta_in: Yahooவிலிருந்து Yahoo நிதி தரவையும் அணுகலாம், டோக்கன் தேவையில்லை.

source: For the actual use of the data, please see the portfolio_optimization or portfolio_diversification notebooks.
es_un: Para conocer el uso real de los datos, consulte los cuadernos portfolio_optimization o portfolio_diversification.
id_id: Untuk penggunaan data yang sebenarnya, silakan lihat portfolio_optimization atau portfolio_diversifikasi notebook.
ja_jp: データの実際の使用については、portfolio_optimizationまたは portfolio_diversification ノートブックを参照してください。
ta_in: தரவின் உண்மையான பயன்பாட்டிற்கு, தயவுசெய்து பார்க்கவும் the portfolio_optimization or portfolio_diversification notebooks.

source: **Loading and Processing Stock-Market Time-Series Data**
pt_br: **Carregando e Processando Dados de Séries Temporais do Mercado de Ações**

source: Once the data are loaded, you can run a variety of algorithms on those to aggregate the data. Notably, you can compute the covariance matrix or a variant, which would consider alternative time-series similarity measures based on dynamic time warping (DTW). In DTW, changes that vary in speed, e.g., one stock's price following another stock's price with a small delay, can be accommodated.
pt_br: Uma vez que os dados são carregados, você pode executar uma variedade de algoritmos sobre os mesmos para agregá-los. Notavelmente, você pode calcular a matriz de covariância ou uma variante, o que consideraria medidas de similaridade de séries temporais alternativas baseadas em dynamic time warping (DTW). Na DTW, as mudanças que variam em velocidade, por exemplo, o preço de uma ação seguindo o preço de outra ação com um pequeno atraso, podem ser acomodadas.

source: If you don't have NASDAQ Data on Demand license, you can contact NASDAQ (cf. https://business.nasdaq.com/intel/GIS/Nasdaq-Data-on-Demand.html) to obtain a trial or paid license.
pt_br: Se você não tiver licença NASDAQ Data on Demand, você pode entrar em contato com a NASDAQ (cf. https://business.nasdaq.com/intel/GIS/Nasdaq-Data-on-Demand.html) para obter uma licença de teste ou paga.
