Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/finance/6_basket_option_pricing.po
Languages: fr_fr

source: This page was generated from `tutorials/finance/6_basket_option_pricing.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/finance/6_basket_option_pricing.ipynb`__.

source: **Pricing Basket Options**
fr_fr: **Calcul du prix d'options panier**

source: Suppose a basket option with strike price :math:`K` and two underlying assets whose spot price at maturity :math:`S_T^1`, :math:`S_T^2` follow given random distributions. The corresponding payoff function is defined as:
fr_fr: Supposons une option panier avec prix d'exercice :math:`K` et deux actifs sous-jacents dont les prix au comptant à l'échéance :math:`S_T^1`, :math:`S_T^2` suivent des distributions aléatoires données. La fonction de gain correspondante est définie par :

source: \max\{S_T^1 + S_T^2 - K, 0\} In the following, a quantum algorithm based on amplitude estimation is used to estimate the expected payoff, i.e., the fair price before discounting, for the option:
fr_fr: \max\{S_T^1 + S_T^2 - K, 0\} Dans ce qui suit, un algorithme quantique basé sur l'estimation d'amplitude est utilisé pour estimer le gain attendu, c'est-à-dire le juste prix avant actualisation, pour l'option :

source: \mathbb{E}\left[ \max\{S_T^1 + S_T^2 - K, 0\} \right]. The approximation of the objective function and a general introduction to option pricing and risk analysis on quantum computers are given in the following papers:
fr_fr: \mathbb{E}\left [ \max\ { S_T ^ 1 + S_T ^ 2-K, 0 \ } \right ]. L' approximation de la fonction objectif et une introduction générale à la tarification des options et à l'analyse des risques sur les ordinateurs quantiques sont données dans les articles suivants :

source: Uncertainty Model
fr_fr: Modèle d'incertitude

source: We construct a circuit factory to load a multivariate log-normal random distribution into a quantum state on :math:`n` qubits. For every dimension :math:`j = 1,\ldots,d`, the distribution is truncated to a given interval :math:`[low_j, high_j]` and discretized using :math:`2^{n_j}` grid points, where :math:`n_j` denotes the number of qubits used to represent dimension :math:`j`, i.e., :math:`n_1+\ldots+n_d = n`. The unitary operator corresponding to the circuit factory implements the following:
fr_fr: Nous construisons un circuit afin de représenter une distribution aléatoire en log-normale multidimensionnelle dans un état quantique sur :math:`n` qubits. Pour chaque dimension :math:`j = 1,\ldots,d`, la distribution est limitée à l'intervalle :math:`[low_j, high_j]` et discrétisée en utilisants :math:`2^{n_j}` points, où :math:`n_j` correspond au nombre de qubits utilisés pour représenter la dimension :math:`j`, c'est à dire : :math:`n_1+\ldots+n_d = n`. L'opérateur unitaire correspondant à ce circuit respecte la relation suivante :

source: where :math:`p_{i_1\ldots i_d}` denote the probabilities corresponding to the truncated and discretized distribution and where :math:`i_j` is mapped to the right interval using the affine map:
fr_fr: où :math:`p_{i_1\ldots i_d}` représentent les probabilités de chaque distribution tronquée et discrétisée et où :math:`i_j` est mappé sur l'intervalle approprié en utilisant la carte affine suivante :

source: For simplicity, we assume both stock prices are independent and identically distributed. This assumption just simplifies the parametrization below and can be easily relaxed to more complex and also correlated multivariate distributions. The only important assumption for the current implementation is that the discretization grid of the different dimensions has the same step size.
fr_fr: Pour simplifier, nous supposons que les cours des deux actions sont indépendants et répartis de manière identique. Cette hypothèse simplifie la paramétrisation ci-dessous et peut être facilement étendue à des distributions multivariées plus complexes et également corrélées. La seule hypothèse importante pour l'implémentation suivante est que la grille de discrétisation des différentes dimensions a la même taille de pas.

source: Payoff Function
fr_fr: Fonction de gain

source: The payoff function equals zero as long as the sum of the spot prices at maturity :math:`(S_T^1 + S_T^2)` is less than the strike price :math:`K` and then increases linearly. The implementation first uses a weighted sum operator to compute the sum of the spot prices into an ancilla register, and then uses a comparator, that flips an ancilla qubit from :math:`\big|0\rangle` to :math:`\big|1\rangle` if :math:`(S_T^1 + S_T^2) \geq K`. This ancilla is used to control the linear part of the payoff function.
fr_fr: La fonction de gain est nulle tant que la somme des prix au comptant à l'échéance :math:`(S_T^1 + S_T^2)` est inférieure au prix d'exercice :math:`K` puis cette fonction augmente linéairement. L'implémentation utilise d'abord un opérateur de somme pondérée pour calculer la somme des prix au comptant dans un registre ancillaire, puis utilise un comparateur qui fait basculer un qubit ancillaire de :math:`\big|0\rangle` à :math:`\big|1\rangle` si :math:`(S_T^1 + S_T^2) \geq K`. Ce registre ancillaire est utilisé pour contrôler la partie linéaire de la fonction de gain.

source: The linear part itself is approximated as follows. We exploit the fact that :math:`\sin^2(y + \pi/4) \approx y + 1/2` for small :math:`|y|`. Thus, for a given approximation scaling factor :math:`c_{approx} \in [0, 1]` and :math:`x \in [0, 1]` we consider
fr_fr: La partie linéaire proprement dite est approximée de la façon suivante. On exploite le fait que :math:`\sin^2(y + \pi/4) \approx y + 1/2` pour :math:`|y|` petit. Ainsi, pour un facteur d'échelle d'approximation :math:`c_{approx} \in [0, 1]` et :math:`x \in [0, 1]` on considère

source: for small :math:`c_{approx}`.
fr_fr: pour :math:`c_{approx}` petit.

source: We can easily construct an operator that acts as
fr_fr: Nous pouvons facilement construire un opérateur qui agit ainsi :

source: \big|x\rangle \big|0\rangle \mapsto \big|x\rangle \left( \cos(a*x+b) \big|0\rangle + \sin(a*x+b) \big|1\rangle \right), using controlled Y-rotations.
fr_fr: \big|x\rangle \big|0\rangle \mapsto \big|x\rangle \left( \cos(a*x+b) \big|0\rangle + \sin(a*x+b) \big|1\rangle \right), en employant des portes Rotation-Y.

source: Eventually, we are interested in the probability of measuring :math:`\big|1\rangle` in the last qubit, which corresponds to :math:`\sin^2(a*x+b)`. Together with the approximation above, this allows to approximate the values of interest. The smaller we choose :math:`c_{approx}`, the better the approximation. However, since we are then estimating a property scaled by :math:`c_{approx}`, the number of evaluation qubits :math:`m` needs to be adjusted accordingly.
fr_fr: Il est aussi intéressant de connaitre la probabilité de mesurer :math:`\big|1\rangle` sur le dernier qubit, correspondant à :math:`\sin^2(a*x+b)`. En complément de l'approximation précédente, nous pouvons alors estimer la valeurs des intérêts. Plus :math:`c_{approx}` est choisi petit, meilleure est l'approximation. Cependant, puisque nous estimons une propriété dépendant de :math:`c_{approx}`, le nombre de qubits d'évaluation :math:`m` doit être choisi en conséquence.

source: For more details on the approximation, we refer to: Quantum Risk Analysis. Woerner, Egger. 2018.
fr_fr: Pour plus de détails sur l'approximation, nous nous référons à: Quantum Risk Analysis. Woerner, Egger. 2018.

source: Since the weighted sum operator (in its current implementation) can only sum up integers, we need to map from the original ranges to the representable range to estimate the result, and reverse this mapping before interpreting the result. The mapping essentially corresponds to the affine mapping described in the context of the uncertainty model above.
fr_fr: Étant donné que l'opérateur de somme pondérée (dans son implémentation actuelle) ne peut additionner que des entiers, nous devons mapper depuis les intervalles d'origine vers les intervalles représentables pour estimer le résultat, et inverser cette correspondance avant d'interpréter le résultat. La cartographie correspond essentiellement à la cartographie affine décrite dans le cadre du modèle d'incertitude ci-dessus.

source: Evaluate Expected Payoff
fr_fr: Evaluation du gain attendu

source: We first verify the quantum circuit by simulating it and analyzing the resulting probability to measure the :math:`|1\rangle` state in the objective qubit.
fr_fr: Nous commençons par vérifier le circuit quantique en le simulant et en analysant la probabilité de mesurer l'état :math:`|1\rangle` sur le qubit objectif.

source: Next we use amplitude estimation to estimate the expected payoff.
fr_fr: Puis nous utilisons une estimation d'amplitude pour déterminer le gain attendu.
