Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/textbook/01_IQPE.po
Languages: bn_bn, es_un, fr, ko, pl, pt_un, ta, tr_tr

source: Then we have to apply multiple times the :math:`CU` operator, that, in this example, is the Controlled-\ :math:`CT` gate (:math:`CCT` for short).
es_un: Luego tenemos que aplicar varias veces el operador :math:`CU`, que, en este ejemplo, es la compuerta Controlada-\ :math:`CT` (:math:`CCT` para abreviar).
tr_tr: Bundan sonra :math:`CU` operatörünü defalarca uygulamamız gerekiyor. Bu da, bu örnekte, kontrollü :math:`CU` geçididir (kısaca :math:`CCT`).

source: To implement :math:`CCT` in the circuit, since :math:`T` is a phase gate, we can use the multi-controlled phase gate :math:`\text{MCP}(\theta)`, with :math:`\theta=\pi/4`.
bn_bn: বর্তনীতে (সার্কিট) :math:`CCT` বাস্তবায়নের জন্য আমরা :math:`\theta=\pi/4` -এর সাথে বহুদ্বারা নিয়ন্ত্রিত দশা গেট :math:`\text{MCP}(\theta)` ব্যবহার করতে পারি, যেহেতু :math:`T` একটা দশা গেট।
es_un: Para implementar :math:`CCT` en el circuito, ya que :math:`T` es una compuerta de fase, podemos usar la compuerta de fase multicontrolada :math:`\text{MCP}(\theta)`, con :math:`\theta=\pi/4`.
fr: Afin d'implémenter :math:`CCT`, nous pouvons utiliser le fait que :math:`CT` est une porte de phase. Nous pouvons donc utiliser la porte de phase contrôlée de façon multiple :math:`\text{MCP}(\theta)`, avec :math:`\theta=\pi/4`.
ko: :math:`CCT` 를 회로에 구현할 때, :math:`T` 가 위상 게이트이므로 다중 제어 위상 게이트 :math:`\text{MCP}(\theta)` 와 :math:`\theta=\pi/4` 를 함께 사용한다.
pt_un: Para implementar :math:`CCT` no circuito, dado que :math:`T` é uma porta de fase, podemos usar a porta de fase multi-controlada :math:`\text{MCP}(\theta)`, com :math:`\theta=\pi/4`.
ta: செயல்படுத்த :math:`CCT` சுற்றில், ஏனெனில் :math:`T` என்பது ஒரு கட்ட கேட், நாம் பல கட்டுப்பாட்டு கட்ட கேட்டைப் பயன்படுத்தலாம் :math:`\text{MCP}(\theta)`, உடன் :math:`\theta=\pi/4``.
tr_tr: Devrede :math:`CCT`yi uygulamak için, :math:`T` bir faz kapısı olduğundan, çoklu kontrollü faz geçidini (:math:`\text{MCP}(\theta) `:math:`\theta=\pi/4` ile kullanabiliriz.

source: Let’s apply :math:`2^t` times :math:`\text{MCP}(\pi/4)`. Since for the first step :math:`t=m-1` and :math:`m=3`, we have :math:`2^t=4`.
es_un: Apliquemos :math:`2^t` veces :math:`\text{MCP}(\pi/4)`. Dado que para el primer paso :math:`t=m-1` y :math:`m=3`, tenemos :math:`2^t=4`.
pt_un: Apliquemos :math:`2^t` vezes :math:`\text{MCP}(\pi/4)`. Uma vez que para o primeiro passo :math:`t=m-1` e :math:`m=3`, temos :math:`2^t=4`.
ta: பயன்படுத்தலாம் :math:`2^t` முறை :math:`\text{MCP}(\pi/4)`. முதல் படிக்கு :math:`t=m-1`மற்றும் :math:`m=3``, எங்களிடம் உள்ளது :math:`2^t=4`.
tr_tr: :math:`2^t` kez :math:`\text{MCP}(\pi/4)` uygulayalım. İlk adım olan :math:`t=m-1` ve :math:`m=3` için, :math:`2^t=4` elde ederiz.

source: Finally, we perform the measurement of the auxiliary qubit in x-basis. We can use the ``x_measurement`` function defined above in the example for 1-qubit gate. In this way we have obtained the phase bit :math:`\varphi_3` and stored it in the classical bit :math:`c_0`.
es_un: Finalmente, realizamos la medición del qubit auxiliar en la base x. Podemos usar la función ``x_measurement`` definida anteriormente en el ejemplo para la compuerta de 1 qubit. De esta forma hemos obtenido el bit de fase :math:`\varphi_3` y lo almacenamos en el bit clásico :math:`c_0`.
fr: Enfin, nous réalisons la mesure du qubit auxiliaire dans la base x. Nous pouvons utiliser la fonction ``x_measurement`` définie précédemment dans l'exemple d'un opérateur à 1 qubit. Ainsi, nous obtenons le bit de phase :math:`\varphi_3` et l'enregistrons dans le bit classique :math:`c_0`.
ko: 마지막으로 보조 큐비트의 측정을 x-basis로 수행한다. 1-큐비트 게이트의 예에서 위에 정의된 ``x_measurement`` 함수를 사용할 수 있다. 이 방법으로 얻어진 위상 비트 :math:`\varphi_3` 는 고전 비트 :math:`c_0` 에 저장된다.
pt_un: Finalmente, realizamos a medida do qubit auxiliar na base x. Podemos usar a função ``x_measurement`` definida acima, no exemplo de uma porta de 1 qubit. Dessa forma, obtemos o bit de fase :math:`\varphi_3` e podemos guardá-lo no bit clássico :math:`c_0`.
ta: இறுதியாக, துணை குவிட்டின் அளவீட்டை x-அடிப்படையில் செய்கிறோம். 1-குபிட் கேட்டிற்கான எடுத்துக்காட்டில் மேலே வரையறுக்கப்பட்டுள்ள ``x_measurement`` செயல்பாட்டைப் பயன்படுத்தலாம். இந்த வழியில் நாம் கட்ட பிட் :math:`\varphi_3` ஐப் பெற்று அதைக் கிளாசிக்கல் பிட்டில் :math:`c_0` இல் சேமித்துள்ளோம்.

source: Subsequent steps (2nd, 3rd)
bn_bn: ক্রমানুসারে (২য় ও ৩য় ধাপ)
es_un: Pasos posteriores (segundo, tercero)
fr: Étapes suivantes (deuxième et troisième étapes)
ko: 다음 단계(2번째, 3번째)
pt_un: Passos subsequentes (2°, 3°)
ta: அடுத்தடுத்த படிகள் (2 வது, 3 வது)
tr_tr: Sonraki adımlar (2. ve 3.)

source: Now we build the quantum circuit for the other remaining steps, the second and the third ones. As said in the first example, in these steps we have the additional sub-step of the phase correction.
bn_bn: এখন বাকি ধাপের (২য় ও ৩য়) জন্য কোয়ান্টাম সার্কিট বানাবো। প্রথম উদাহরণের মতো এখানেও দশা সংশোধনের অতিরিক্ত ধাপ আছে।
es_un: Ahora construimos el circuito cuántico para los otros pasos restantes, el segundo y el tercero. Como se dijo en el primer ejemplo, en estos pasos tenemos el subpaso adicional de la corrección de fase.
fr: Nous construisons alors le circuit quantique pour les étapes restantes, la seconde et la troisième. Comme expliqué dans le premier exemple, dans ces étapes, nous avons la sous-étape supplémentaire de la correction de la phase.
ko: 이제 나머지 단계, 즉 두 번째 단계와 세 번째 단계를 위한 양자 회로를 구축한다. 첫 번째 예에서 말했듯이 이 단계에는 위상 보정의 추가 하위 단계가 있다.
pt_un: Agora, construímos o circuito quântico para os outros passos restantes, o segundo e o terceiro. Como dito no primeiro exemplo, nesses passos temos uma subetapa adicional de correção de fase.
ta: இப்போது மீதமுள்ள மற்ற படிகளுக்கு குவாண்டம் சர்க்யூட்டை உருவாக்குகிறோம், இரண்டாவது மற்றும் மூன்றாவது. முதல் எடுத்துக்காட்டில் கூறியது போல், இந்த படிகளில் கட்ட திருத்தத்தின் கூடுதல் துணை-படி உள்ளது.

source: In order to extract the phase bit :math:`\varphi_{2}`, we perform a phase correction of :math:`-\pi\varphi_3/2`.
bn_bn: দশা বিট :math:`\varphi_{2}` নিষ্কাশনের জন্য আমরা :math:`-\pi\varphi_3/2` -এর ত্রুটি সংশোধন করব।
es_un: Para extraer el bit de fase :math:`\varphi_{2}`, realizamos una corrección de fase de :math:`-\pi\varphi_3/2`.
fr: Afin d'extraire le bit de phase :math:`\varphi_{2}`, nous effectuons une correction de phase de :math:`-\pi \varphi_3 /2`.
ko: 위상 비트 :math:`\varphi_{2}` 를 추출하기 위해 :math:`-\pi\varphi_3/2` 의 위상 보정을 실시한다.
pt_un: Para extrair o bit de fase :math:`\varphi_{2}`, fazemos uma correção de fase de :math:`-\pi\varphi_3/2`.
ta: கட்ட பிட் :math:`\varphi_{2}` பிரித்தெடுப்பதற்காக, நாம் ஒரு கணித திருத்தம் செய்கிறோம் :math:`-\pi\varphi_3/2`.
tr_tr: :math:`\varphi_{2}` faz bitini çıkarmak için, :math:`-\pi\varphi_3/2` faz düzeltmesini yapıyoruz.

source: So, after the reset we apply the phase gate :math:`P(\theta)` with phase :math:`\theta=-\pi/2` conditioned by the classical bit :math:`c_0` (:math:`=\varphi_3`).
bn_bn: রিসেটের পর আমরা :math:`\theta=-\pi/2` দশা সম্পন্ন দশা গেট :math:`P(\theta)` প্রয়োগ করবো, শর্ত হিসেবে ক্লাসিক্যাল বিট :math:`c_0` (:math:`=\varphi_3`)।
es_un: Entonces, después del restablecimiento, aplicamos la compuerta de fase :math:`P(\theta)` con la fase :math:`\theta=-\pi/2` condicionada por el bit clásico :math:`c_0` (:math:`=\varphi_3`).
fr: Ainsi, après la réinitialisation, nous appliquons la porte de phase :math:`P(\theta)` avec la phase :math:`\theta=-\pi/2` conditionnée par le bit classique :math:`c_0` (:math:`=\varphi_3`).
ko: 따라서 재설정 후 고전 비트 :math:`c_0` (:math:`=\varphi_3`) 로 조절된 위상 :math:`\theta=-\pi/2` 를 사용하여 위상 게이트 :math:`P(\theta)` 를 적용한다.
pt_un: Então, após fazer o reset, aplicamos a porta de fase :math:`P(\theta)` com fase :math:`\theta=-\pi/2`, condicionada pelo bit clássico :math:`c_0` (:math:`=\varphi_3`).
ta: எனவே, மீட்டமைப்புக்குப் பிறகு நாம் கட்ட கேட்டைப் பயன்படுத்துகிறோம் :math:`P(\theta)` கட்டத்துடன் :math:`\theta=-\pi/2` கிளாசிக்கல் பிட் நிபந்தனைக்குட்பட்டது :math:`c_0` (:math:`=\varphi_3`).
tr_tr: O zaman bu sıfırlamadan sonra, :math:`c_0` (:math:`=\varphi_3`) klasik bitiyle şartlandırılmış :math:`\theta=-\pi/2` fazına sahip :math:`P(\theta)` faz geçidini uygularız.

source: We apply the :math:`CU` operations as we did in the first step. For the second step we have :math:`t=m-2`, hence :math:`2^t=2`. So we apply :math:`\text{MCP}(\pi/4)` :math:`2` times. And then we perform the x-measurement of the qubit :math:`q_0`, storing the phase bit :math:`\varphi_2` in the bit :math:`c_1`.
es_un: Aplicamos las operaciones :math:`CU` como hicimos en el primer paso. Para el segundo paso tenemos :math:`t=m-2`, por lo tanto :math:`2^t=2`. Entonces aplicamos :math:`\text{MCP}(\pi/4)` :math:`2` veces. Y luego realizamos la medición en x del qubit :math:`q_0`, almacenando el bit de fase :math:`\varphi_2` en el bit :math:`c_1`.
fr: Nous appliquons alors les portes :math:"CU" comme nous l'avons fait lors de la première étape. Pour la deuxième étape, nous avons :math:`t=m-2`, donc :math:`2^t=2`. Nous appliquons donc :math:`\text{MCP}\left(\frac{\pi}{4}\right)` deux fois. Ensuite, nous réalisons la mesure dans la base :math:`X` du qubit :math:`q_0`, stockant le résultat, à savoir le bit de phase :math:`\varphi_2`, dans le bit :math:`c_1` du registre classique.
ko: 첫 단계에서 그랬던 것처럼 :math:`CU` 연산을 적용한다. 두 번째 단계에는 :math:`t=m-2` 가 있고, 따라서 :math:`2^t=2` 이다. 그래서 우리는 :math:`\text{MCP}(\pi/4)` 를 :math:`2` 번 적용한다. 그런 다음 큐비트 :math:`q_0` 의 x 측정을 수행하여 결과, 위상 비트 :math:`\varphi_2` 를 비트 :math:`c_1` 에 저장한다.
pt_un: Nós aplicamos as operações :math:`CU` como no primeiro passo. Já no segundo passo, temos :math:`t=m-2`, de modo que :math:`2^t=2`. Então aplicamos :math:`\text{MCP}(\pi/4)` :math:`2` vezes. E então realizamos a medida em x do qubit :math:`q_0`, guardando o bit de fase :math:`\varphi_2` no bit :math:`c_1`.
ta: முதல் படியில் செய்ததைப் போலவே :math:`CU` செயல்பாடுகளைப் பயன்படுத்துகிறோம். இரண்டாவது படிக்கு நம்மிடம் உள்ளது :math:`t=m-2`, எனவே :math:`2^t=2`. எனவே நாம் :math:`\text{MCP}(\pi/4)` :math:`2` முறை பயன்படுத்துகிறோம். பின்னர் நாம் qubit :math:`q_0` இன் x-அளவைச் செய்கிறோம், கட்ட பிட் :math:`\varphi_2` பிட் :math:`c_1` இல் சேமிக்கிறோம்.

source: All substeps of the 3rd step
bn_bn: তৃতীয় ধাপের সব আংশিক ধাপ
es_un: Todos los subpasos del 3er paso
fr: Toutes les sous-étapes de la 3ème étape
ko: 세 번째 단계의 모든 하위 단계
pt_un: Todos os subpassos do 3° passo
ta: 3 வது படியின் அனைத்து உட்பிரிவுகளும்
tr_tr: 3. adımın tüm alt adımları

source: For the 3rd and last step, we perform the reset and initialization of the auxiliary qubit as done in the second step.
bn_bn: ৩য় এবং শেষ ধাপের জন্য আমরা ২য় ধাপের মতো করে সহায়ক কিউবিট রিসেট এবং আরম্ভ করব।
es_un: Para el tercer y último paso, realizamos el restablecimiento e inicialización del qubit auxiliar como se hizo en el segundo paso.
fr: Pour la troisième et dernière étape, nous effectuons la réinitialisation et l'initialisation du qubit auxiliaire, comme nous l'avons fait lors de la deuxième étape.
ko: 세 번째 및 마지막 단계의 경우 두 번째 단계에서 수행된 대로 보조 큐비트의 재설정 및 초기화를 수행한다.
pt_un: Para o 3° e último passo, realizamos o reset e a inicialização do qubit auxiliar como feito no segundo passo.
ta: 3 வது மற்றும் கடைசி படிக்கு, இரண்டாம் கட்டத்தில் செய்ததைப் போல துணை க்யூபிட்டின் மீட்டமைப்பு மற்றும் துவக்கத்தை நாங்கள் செய்கிறோம்.
tr_tr: 3. ve son adım için, ikinci adımda yaptığımız gibi yardımcı kübitin sıfırlanmasını ve başlatılmasını gerçekleştiriyoruz.

source: Then at the 3rd step we have to perform the phase correction of :math:`-2\pi 0.0\varphi_{2}\varphi_{3}= -2\pi \left(\frac{\varphi_2}{4}+\frac{\varphi_3}{8}\right)=-\frac{\varphi_2\pi}{2}-\frac{ \varphi_3\pi}{4}`, thus we have to apply 2 conditioned phase corrections, one conditioned by :math:`\varphi_3` (:math:`=c_0`) and the other by :math:`\varphi_2`\ (:math:`=c_1`). To do this we have to apply the following: - gate :math:`P(-\pi/4)` conditioned by :math:`c_0=1`, that is, by :math:`c=001` (c_if with value :math:`1`) - gate :math:`P(-\pi/2)` conditioned by :math:`c_1=1`, that is, the gate is applied when :math:`c=010` (c_if with values :math:`2`) - gate :math:`P(-3\pi/4)` conditioned by :math:`c_1=1` and :math:`c_0=1` that is, the gate is applied when :math:`c=011` (c_if with values :math:`3`)
es_un: Luego, en el tercer paso, tenemos que realizar la corrección de fase de :math:`-2\pi 0.0\varphi_{2}\varphi_{3}= -2\pi \left(\frac{\varphi_2}{4}+\frac{\varphi_3}{8}\right)=-\frac{\varphi_2\pi}{2}-\frac{ \varphi_3\pi}{4}`, por lo que tenemos que aplicar 2 correcciones de fase condicionadas, una condicionada por :math:`\varphi_3` (:math:`=c_0`) y la otra por :math:`\varphi_2`\ (:math:`=c_1`). Para ello tenemos que aplicar lo siguiente: - compuerta :math:`P(-\pi/4)` condicionada por :math:`c_0=1`, es decir, por :math:`c=001` (c_if con valor :math:`1`) - compuerta :math:`P(-\pi/2)` condicionada por :math:`c_1=1`, es decir, la compuerta se aplica cuando :math:`c=010` (c_if con valor :math:`2`) - compuerta :math:`P(-3\pi/4)` condicionada por :math:`c_1=1` y :math:`c_0=1` es decir, la compuerta se aplica cuando :math:`c=011` (c_if con valor :math:`3`)
fr: Puis à la 3ème étape, nous devons effectuer la correction de phase de :math:`-2\pi 0.0\varphi_{2}\varphi_{3}= -2\pi \left(\frac{\varphi_2}{4}+\frac{\varphi_3}{8}\right)=-\frac{\varphi_2\pi}{2}-\frac{ \varphi_3\pi}{4}`, ainsi nous devons appliquer 2 corrections de phases conditionnelles, l'une étant conditionnée par :math:`\varphi_3` (:math:`=c_0`) et l'autre par :math:`\varphi_2`\ (:math:`=c_1`). Pour cela noous appliquons les portes suivantes : - porte :math:`P(-\pi/4)` conditionné par :math:`c_0=1`, c'est à dire :math:`c=001` (c_if avec la valeur :math:`1`) - porte :math:`P(-\pi/2)` conditionnée par :math:`c_1=1`, c'est à dire, la porte est appliquée lorsque :math:`c=010` (c_if avec la valeur :math:`2`) - porte :math:`P(-3\pi/4)` coonditiononée par :math:`c_1=1` et :math:`c_0=1` c'est à dire que la porte est appliquée si :math:`c=011` (c_if avec la valeur :math:`3`)
ko: 그런 다음 세 번째 단계에서 :math:`-2\pi 0.0\varphi_{2}\varphi_{3}= -2\pi \left(\frac{\varphi_2}{4}+\frac{\varphi_3}{8}\right)=-\frac{\varphi_2\pi}{2}-\frac{ \varphi_3\pi}{4}` 의 위상 보정을 수행해야 한다. 따라서 두 개의 조건부 위상 보정을 적용해야 하는데, 하나는 :math:`\varphi_3` (:math:`=c_0`) 에 의해 적용된 것이고, 다른 하나는 :math:`\varphi_2` (:math:`=c_1`) 에 의해 적용된 것이다. 이를 위해서는 다음과 같이 실행한다: - 게이트 :math:`P(-\pi/4)` 는 :math:`c=001` (c 값이 :math:`1`) 일 때 :math:`c_0=1` 로 적용된다. - 게이트 :math:`P(-\pi/2)` 는 :math:`c=010` (c 값이 :math:`2`) 일 때 :math:`c_1=1` 로 적용된다. - 게이트 :math:`P(-3\pi/4)` 는 :math:`c=011` (c 값이 :math:`3`) 일 때 :math:`c_1=1` 와 :math:`c_0=1` 로 적용된다.
pt_un: Então, no 3° passo, realizamos uma correção de fase de :math:`-2\pi 0.0\varphi_{2}\varphi_{3}= -2\pi \left(\frac{\varphi_2}{4}+\frac{\varphi_3}{8}\right)=-\frac{\varphi_2\pi}{2}-\frac{ \varphi_3\pi}{4}`, portanto precisamos aplicar 2 correções de fase condicionadas, uma condicionada por :math:`\varphi_3` (:math:`=c_0`) e a outra por :math:`\varphi_2`\ (:math:`=c_1`). Para fazer isso, precisamos aplicar o seguinte: - porta :math:`P(-\pi/4)` condicionado por :math:`c_0=1`, ou seja, by :math:`c=001` (c_if com valor :math:`1`) - porta :math:`P(-\pi/2)` condicionado por :math:`c_1=1`, ou seja, a porta é aplicaca quando :math:`c=010` (c_if com valores :math:`2`) - porta :math:`P(-3\pi/4)` condicionado por :math:`c_1=1` e :math:`c_0=1` ou seja, a porta é aplicada quando :math:`c=011` (c_if com valores :math:`3`)
ta: 3வது படியில் நாம் :math:`-2\pi 0.0\varphi_{2}\varphi_{3}= -2\pi \left(\frac{\varphi_2}{4}+ இன் கட்ட திருத்தத்தை செய்ய வேண்டும் \frac{\varphi_3}{8}\right)=-\frac{\varphi_2\pi}{2}-\frac{ \varphi_3\pi}{4}`, எனவே நாம் 2 நிபந்தனைக்குட்பட்ட கட்ட திருத்தங்களைப் பயன்படுத்த வேண்டும், ஒன்று நிபந்தனைக்குட்பட்டது :math:`\varphi_3` (:math:`=c_0`) மற்றும் மற்றொன்று :math:`\varphi_2`\ (:math:`=c_1`). இதைச் செய்ய, நாம் பின்வருவனவற்றைப் பயன்படுத்த வேண்டும்: - கேட் :math:`P(-\pi/4)` நிபந்தனைக்குட்பட்ட :math:`c_0=1`, அதாவது :math:`c=001` (c_if மதிப்பு :math:`1`) - கேட் :math:`P(-\pi/2)` நிபந்தனைக்குட்பட்டது :math:`c_1=1`, அதாவது :math:`c=010 போது கேட் பயன்படுத்தப்படும் ` (c_if with values ​​:math:`2`) - gate :math:`P(-3\pi/4)` நிபந்தனைக்குட்பட்ட :math:`c_1=1` மற்றும் :math:`c_0=1` அதாவது, கேட் பயன்படுத்தப்படும் போது :math:`c=011` (c_if மதிப்புகள் :math:`3`)

source: Next, the :math:`CU` operations: we apply :math:`2^t` times the :math:`\text{MCP}(\pi/4)` gate and since at the 3rd step :math:`t=m-3=0`, we apply the gate only once.
bn_bn: এরপর, :math:`CU` অপারেশনে: আমরা :math:`2^t` বার :math:`\text{MCP}(\pi/4)` গেট প্রয়োগ করব , যেহেতু ৩য় ধাপে :math:`t=m-3=0`, গেটটা আবারো একবার প্রয়োগ করতে পারবো।
es_un: A continuación, las operaciones :math:`CU`: aplicamos :math:`2^t` veces la compuerta :math:`\text{MCP}(\pi/4)` y dado que en el 3er paso :math:`t=m-3=0`, aplicamos la compuerta solo una vez.
fr: Ensuite, pour ce qui est des portes :math:`CU`, nous appliquons :math:`2^t` fois la porte :math:`\text{MCP}\left(\frac{\pi}{4}\right)`et puisque à la troisième étape :math:` t=m-3 = 0`, nous n'appliquons cette porte qu'une seule fois.
ko: 다음으로 :math:`CU` 연산자: :math:`\text{MCP}(\pi/4)` 게이트를 :math:`2^t` 번 적용하고 3단계 :math:`t=m-3=0` 에서는 게이트를 한 번만 적용한다.
pt_un: Em seguida, as operações :math:`CU`: aplicamos :math:`2^t` vezes a porta :math:`\text{MCP}(\pi/4)` e desde o 3° passo :math:`t=m-3=0`, aplicamos a porta apenas uma vez.
ta: அடுத்து, :math:`CU` செயல்பாடுகள்: நாங்கள் பயன்படுத்துகிறோம் :math:`2^t` மடங்கு: :math:`\text{MCP}(\pi/4)` கேட் மற்றும் 3 வது கட்டத்தில் இருந்து :math:`t=m-3=0`, நாங்கள் ஒரு முறை மட்டுமே கேட்டைப் பயன்படுத்துகிறோம்.
tr_tr: Sonra, :math:`CU` işlemleri: :math:`2^t` çarpı :math:`\text{MCP}(\pi/4)` geçitini uygularız ve 3. adımdan itibaren :math:` t=m-3=0`, geçidi sadece bir kez uyguluyoruz.

source: Now, we execute the circuit with the simulator without noise.
bn_bn: এবার আমরা ত্রুটি ছাড়া সার্কিট সিমুলেটরে চালাবো।
es_un: Ahora, ejecutamos el circuito con el simulador sin ruido.
fr: Nous exécutons ensuite ce circuit avec le simulateur sans erreur.
ko: 이제 잡음 없이 시뮬레이터로 회로를 실행한다.
pt_un: Agora, executamos o circuito com o simulador sem ruído.
ta: இப்போது, சத்தமில்லாமல் சிமுலேட்டருடன் சர்க்யூட்டை இயக்குகிறோம்.
tr_tr: Şimdi, bu devreyi gürültüsüz simülatörle yürütüyoruz.

source: We have obtained :math:`100\%` probability to find :math:`\varphi=0.125`, that is, :math:`1/8`, as expected.
bn_bn: আমরা অনুমানমতো :math:`\varphi=0.125` (বা :math:`1/8`) পাওয়ার সম্ভাবনা :math:`100\%` পেয়েছি।
es_un: Hemos obtenido :math:`100\%` de probabilidad de encontrar :math:`\varphi=0.125`, es decir, :math:`1/8`, como se esperaba.
fr: Nous avons obtenu :math:`100\%` de probabilité de trouver :math:`\varphi=0.125`, c'est-à-dire :math:`1/8`, comme nous nous y attendions.
ko: 예상대로 :math:`100\%` 확률로 :math:`\varphi=0.125`, 즉 :math:`1/8` 를 찾을 수 있게 되었다.
pt_un: Obtivemos probabilidade de :math:`100\%` de encontrar :math:`\varphi=0.125`, isto é, :math:`1/8`, como esperado.
ta: நாங்கள் பெற்றுள்ளோம் :math:`100\%` நிகழ்தகவு :math:`\varphi=0.125`, அதாவது, :math:`1/8`, எதிர்பார்த்தபடி.
tr_tr: Beklendiği gibi :math:`\varphi=0.125` yani :math:`1/8` bulmak için :math:`100\%` olasılığını elde ettik.

source: Let’s consider to estimate the phase :math:`\phi=\frac{\pi}{2}` for the eigenstate :math:`|1\rangle`, we should find :math:`\varphi=\frac{1}{4}` (where :math:`\phi = 2 \pi \varphi`). Therefore to estimate the phase we need exactly 2 phase bits, i.e. :math:`m=2`, since :math:`1/2^2=1/4`. So :math:`\varphi=0.\varphi_1\varphi_2`.
ta: Eigenstate :math:`|1\rangle`க்கான கட்டம் :math:`\phi=\frac{\pi}{2}` ஐக் கணக்கிடுவோம், நாம் கண்டுபிடிக்க வேண்டும் :math:`\varphi=\frac{1}{4}` (எங்கே :math:`\phi = 2 \pi \varphi`). எனவே கட்டத்தை மதிப்பிட, நமக்கு சரியாக 2 கட்ட பிட்கள் தேவை, அதாவது :math:`m=2`, என்பதால் :math:`1/2^2=1/4`. எனவே :math:`\varphi=0.\varphi_1\varphi_2`.

source: Now we build the quantum circuit for the first step, that is, the first iteration of the algorithm, to estimate the least significant phase bit :math:`\varphi_m`, in this case :math:`\varphi_2`. For the first step we have 3 sub-steps: - initialization - application of the Controlled-:math:`U` gates - measure of the auxiliary qubit in x-basis
ko: 첫 번째 단계로써 만들 양자 회로, 즉 첫 번째 반복 알고리즘은 최하위 위상 비트 :math:`\varphi_m` 를 추정하는 것이다. 여기서는 :math:`\varphi_2` 이다. 첫 번째 단계는 3개의 하위 단계로 나눠진다: - 초기화 - Controlled-:math:`U` 게이트의 적용 - x 축 기반의 보조 큐비트의 측정
pl: Teraz budujemy obwód kwantowy dla pierwszego kroku, czyli pierwszej iteracji algorytmu, aby oszacować najmniej istotny bit fazy :math:`\varphi_m`, w tym przypadku :math:`\varphi_2`. W pierwszym kroku mamy 3 podkroki: - inicjalizacja - zastosowanie bramek kontrolowanych -:math:`U` - pomiar pomocniczego kubitu w oparciu o x-podstawę
ta: இப்போது நாம் முதல் படிக்கான குவாண்டம் சர்க்யூட்டை உருவாக்குகிறோம், அதாவது, அல்காரிதத்தின் முதல் மறு செய்கை, மிகக் குறைவான முக்கிய கட்ட பிட் :math:`\varphi_m`, இந்த விஷயத்தில் :math:`\varphi_2` ஐ மதிப்பிடுவதற்கு. முதல் படிக்கு நம்மிடம் 3 துணை படிகள் உள்ளன: - துவக்குதல் - கட்டுப்படுத்தப்பட்ட-:math:`U` வாயில்களின் பயன்பாடு - x-அடிப்படையில் துணை குவிட்டின் அளவு

source: Application of the Controlled-:math:`U` gates
ko: Controlled-:math:`U` 게이트의 적용
pl: Zastosowanie bramki Controlled-:math:`U`
ta: கட்டுப்படுத்தப்பட்ட-:math:`U` வாயில்களின் பயன்பாடு

source: Then we have to apply :math:`2^t` times the Controlled-:math:`U` operators (see also in the docs `Two qubit gates <https://qiskit.org/documentation/tutorials/circuits/3_summary_of_quantum_operations.html#Two-qubit-gates>`__), that, in this example, is the Controlled-:math:`S` gate (:math:`CS` for short).
ko: 그러면 Controlled-:math:`U` 연산자들을 :math:`2^t` 번 적용해야 한다 (문서 `두 큐비트 게이트 <https://qiskit.org/documentation/tutorials/circuits/3_summary_of_quantum_operations.html#Two-qubit-gates>`__ 를 참조하라). 여기서는 Controlled-:math:`S` 게이트 (줄여서 :math:`CS`) 를 적용한다.
pl: Następnie musimy zastosować :math:` 2 ^ t ` razy operatory Controlled-:math:` U ` (patrz także w dokumentach `Two qubit gates <https://qiskit.org/documentation/tutorials/circuits/3_summary_of_quantum_operations.html#Two-qubit-gates>` __), że w tym przykładzie jest to Controlled-:math:` S ` gate (:math:`CS` w skrócie).
ta: பிறகு நாம் :math:`2^t` முறை Controlled-:math:`U` ஆபரேட்டர்களைப் பயன்படுத்த வேண்டும் (டாக்ஸில் `இரண்டு குவிட் கேட்கள் <https://qiskit.org/documentation/tutorials/circuits/3_summary_of_quantum_operations. .html#Two-qubit-gates>`__), இந்த எடுத்துக்காட்டில், Controlled-:math:`S` gate (:math:`CS` சுருக்கமாக).

source: Now we build the quantum circuit for the other remaining steps, in this example, only the second one. In these steps we have 4 sub-steps: the 3 sub-steps as in the first step and, in the middle, the additional step of the phase correction - initialization with reset - phase correction - application of the Controlled-:math:`U` gates - measure of the auxiliary qubit in x-basis
ko: 이제 남은 단계들을 위한 양자 회로를 만들어 보자. 이 예에서는 두 번째 단계만을 다룬다. 이 단계는 다음의 4개의 하위 단계가 포함된다: 첫 번째 단계와 같은 3개의 하위 단계와 그 중간의 위상 보정을 위한 추가 단계 - 재설정을 포함한 초기화 - 위상 보정 - Controlled-:math:`U` 게이트 적용 - 보조 큐비트의 x 축 측정으로 구성된다.
pl: Teraz budujemy obwód kwantowy dla pozostałych kroków, w tym przykładzie, tylko dla drugiego. W tych krokach mamy 4 podkroki: 3 podkroki jak w pierwszym kroku, a w środku dodatkowy stopień korekcji fazowej - inicjowanie z resetowaniem - zastosowanie Controlled-:math:`U` bramek - pomiar kubitu pomocniczeego w x-podstawie
ta: இப்போது மீதமுள்ள மற்ற படிகளுக்கு குவாண்டம் சர்க்யூட்டை உருவாக்குகிறோம், இந்த எடுத்துக்காட்டில், இரண்டாவது மட்டுமே. இந்தப் படிகளில் 4 துணைப் படிகள் உள்ளன: முதல் படியில் உள்ளதைப் போன்ற 3 துணைப் படிகள் மற்றும் நடுவில், கட்டத் திருத்தத்தின் கூடுதல் படி - மீட்டமைப்புடன் தொடங்குதல் - கட்டத் திருத்தம் - கட்டுப்படுத்தப்பட்ட பயன்பாடு-:math:` U` வாயில்கள் - x-அடிப்படையில் துணை குவிட்டின் அளவீடு
