Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/textbook/01_IQPE.po
Languages: bn_bn, es_un, fr, ko, pl, pt_un, ta, tr_tr

source: As we want to perform an iterative algorithm in the same circuit, we need to reset the auxiliary qubit :math:`q0` after the measument gate and initialize it again as before to recycle the qubit.
bn_bn: যেহেতু আমরা এই সার্কিটেই একটা ইটারেটিভ এলগোরিদম চালাবো, গেট পরিমাপের পর কিউবিট পুনর্ব্যবহারের জন্য সহায়ক কিউবিট :math:`q0` আমাদের রিসেট করতে হবে।
es_un: Como queremos realizar un algoritmo iterativo en el mismo circuito, necesitamos restablecer el qubit auxiliar :math:`q0` después de la compuerta de medición e inicializarlo nuevamente como antes para reciclar el qubit.
fr: Comme nous voulons réaliser un algorithme itératif dans le même circuit, nous devons réinitialiser le qubit auxiliaire :math:`q0` après la porte de mesure et l'initialiser à nouveau comme précédemment pour recycler le qubit.
ko: 동일한 회로에서 반복적 알고리즘을 수행하려는 경우, 측정 게이트 이후에 보조 큐비트 :math:`q0` 를 재설정하고 이전처럼 다시 초기화하여 큐비트를 재활용해야 한다.
pl: Jak chcemy wykonać algorytm iteracyjny w tym samym obwodzie, musimy zresetować pomocniczy kubit :math:` q0 ` po bramie pomiaru i zainicjalizować go jeszcze raz tak, jak przedtem, aby regenerować kubit.
pt_un: Como queremos realizar um algoritmo iterativo no mesmo circuito, precisamos reiniciar o qubit auxiliar :math:`q0` após a porta de medição e inicializá-lo novamente como antes para reciclar o qubit.
ta: அதே சுற்றில் ஒரு மறு செயல்பாட்டு வழிமுறையை நாம் செய்ய விரும்புவதால், அளவீட்டு கேட்க்குப் பிறகு துணை க்யூபிட் :math:`q0` ஐ மீட்டமைக்க வேண்டும் மற்றும் க்யூபிட்டை மறுசுழற்சி செய்வதற்கு முன்பு மீண்டும் தொடங்க வேண்டும்.
tr_tr: Aynı devrede yinelemeli bir algoritma gerçekleştirmek istediğimiz için, yardımcı kübiti :math:`q0` ölçüm kapısından sonra sıfırlamamız ve kübiti geri dönüştürmek için eskisi gibi yeniden başlatmamız gerekiyor.

source: Phase correction (for step 2)
bn_bn: দ্বিতীয় ধাপের জন্য দশা সংশোধন
es_un: Corrección de fase (para el paso 2)
fr: Correction de phase (pour l'étape 2)
ko: 위상 보정(2단계를 위한)
pl: Faza korekty (dla kroku 2)
pt_un: Correção de fase (para o passo 2)
ta: கட்ட திருத்தம் (படி 2 க்கு)
tr_tr: Faz düzeltme (2. adım için)

source: As seen in the theory, in order to extract the phase bit :math:`\varphi_{1}`, we perform a phase correction of :math:`-\pi\varphi_2/2`. Of course, we need to apply the phase correction in the circuit only if the phase bit :math:`\varphi_2=1`, i.e. we have to apply the phase correction of :math:`-\pi/2` only if the classical bit :math:`c_0` is 1.
es_un: Como se ve en la teoría, para extraer el bit de fase :math:`\varphi_{1}`, realizamos una corrección de fase de :math:`-\pi\varphi_2/2`. Por supuesto, necesitamos aplicar la corrección de fase en el circuito solo si el bit de fase :math:`\varphi_2=1`, es decir, tenemos que aplicar la corrección de fase de :math:`-\pi/2` solo si el bit clásico :math:`c_0` es 1.
pt_un: Como visto na teoria, para extrair o bit de fase :math:`\varphi_{1}`, realizamos uma correção de fase de :math:`-\pi\varphi_2/2`. Claro, precisamos aplicar a correção de fase no circuito apenas se o bit de fase :math:`\varphi_2=1`, ou seja, temos que aplicar a correção de fase de ::math:`-\pi/2` apenas se o bit clássico :math:`c_0` for 1.
ta: கோட்பாட்டில் காணப்படுவது போல், கட்டம் பிட் :math:`\varphi_{1}` பிரித்தெடுப்பதற்காக, நாங்கள் :math:`-\pi\varphi_2/2` என்ற கட்டத் திருத்தத்தைச் செய்கிறோம். நிச்சயமாக, கட்ட பிட் :math:`\varphi_2=1` என்றால் மட்டுமே நாம் சுற்றில் கட்டத் திருத்தத்தைப் பயன்படுத்த வேண்டும், அதாவது கட்ட திருத்தம் :math:`-\pi/2` என்றால் மட்டுமே நாம் சுற்றில் கட்ட திருத்தம் பயன்படுத்த வேண்டும். கிளாசிக்கல் பிட் :math:`c_0` என்பது 1 ஆகும்.
tr_tr: Teoride gördüğümüz gibi, :math:`\varphi_{1}` fazını çıkarmak için biz, bir :math:`-\pi\varphi_2/2` faz düzeltme gerçekleştiriyoruz. Elbette biz sadece eğer faz biti :math:`\varphi_2=1` ise faz düzeltmesini devreye uygulamamız gerekiyor. Örneğin, eğer sadece :math:`c_0` klasik biti 1 ise biz :math:`-\pi/2` ye faz düzeltmesini uygulamalıyız.

source: So, after the reset we apply the phase gate :math:`P(\theta)` with phase :math:`\theta=-\pi/2` conditioned by the classical bit :math:`c_0` (:math:`=\varphi_2`) using the ``c_if`` method. So as we saw in the first part of this tutorial, we have to use the ``c_if`` method with a value of 1, as :math:`1_{10} = 001_{2}` (the subscripts :math:`_{10}` and :math:`_2` indicate the decimal and binary representations).
bn_bn: সেজন্য রিসেটের পর ``c_if`` পদ্ধতি ব্যবহার করে ক্লাসিক্যাল বিট :math:`c_0` (:math:`=\varphi_2`) -এর শর্তাধীনে :math:`\theta=-\pi/2` দশাসহ :math:`P(\theta)` দশা গেট প্রয়োগ করব। এই টিউটোরিয়ালের শুরুতে দেখানো ১ মান নিয়ে ``c_if`` পদ্ধতি ব্যবহার করব, যেহেতু :math:`1_{10} = 001_{2}` (সাবস্ক্রিপ্ট :math:`_{10}` and :math:`_2` দশমিক ও বাইনারি রূপ চিহ্নিত করে)।
es_un: Entonces, después del restablecimiento, aplicamos la compuerta de fase :math:`P(\theta)` con fase :math:`\theta=-\pi/2` condicionada por el bit clásico :math:`c_0` (:math:`=\varphi_2`) usando el método ``c_if``. Entonces, como vimos en la primera parte de este tutorial, tenemos que usar el método ``c_if`` con un valor de 1, como :math:`1_{10} = 001_{2}` (los subíndices :math:`_{10}` y :math:`_2` indican las representaciones decimal y binaria).
fr: Ainsi, après la réinitialisation, nous appliquons la porte de phase :math:`P(\theta)` avec la phase :math:`\theta=-\pi/2` conditionnée par le bit classique :math:`c_0` (:math:`=\varphi_2`) en utilisant la méthode ``c_if``. Ainsi, comme nous l'avons vu dans la première partie de ce tutoriel, nous devons utiliser la méthode ``c_if`` avec une valeur de 1, comme :math:` 1_{10} = 001 _{2}` (les indices :math:`1_{10}` et :math:`_{2}` indiquent respectivement les représentations décimales et binaires).
ko: 따라서 재설정 후에는 ``c_if`` 매서드를 사용한 고전 비트 :math:`c_0` (:math:`=\varphi_2`) 로 조절된 위상 :math:`\theta=-\pi/2` 를 사용하여 위상 게이트 :math:`P(\theta)` 를 적용한다. 이 튜토리얼의 첫 번째 부분에서는 값이 1인 ``c_if`` 매서드를 :math:`1_{10} = 001_{2}` 로 사용해야 한다(아래에 기입한 :math:`_{10}` 및 :math:`_2` 은 십진수 및 이진수를 나타냄).
pl: Tak więc po zresetowaniu zastosujemy bramkę fazową :math:` P (\theta) ` z fazą :math:`\theta=-\pi/2 ` uwarunkowaną klasycznym bitem :math:` c_0 ` (:math:` = \varphi_2 `) przy użyciu metody ``c_if``. Tak więc, jak widzieliśmy w pierwszej części tego kursu, musimy użyć metody ``c_if`` o wartości 1, jako :math:` 1_{10} = 001 _{2}` (indeksy :math:` _{10}` i :math:` _2 ` wskazują reprezentacje dziesiętne i binarne).
pt_un: Então, após o reset aplicamos a porta de fase :math:`P(\theta)` com fase :math:`\theta=-\pi/2` condicionada pelo bit clássico :math:`c_0` (:math:`=\varphi_2`) usando o método ``c_if``. Logo, como vimos na primeira parte deste tutorial, temos que usar o método ``c_if`` com um valor de 1, como em :math:`1_{10} = 001_{2}` (os subscritos :math:`_{10}` e :math:`_2` indicam as representações decimal e binária).
ta: எனவே, மீட்டமைப்புக்குப் பிறகு நாம் கட்ட கேட்டைப் பயன்படுத்துகிறோம் :math:`P(\theta)` கட்டத்துடன் :math:`\theta=-\pi/2` கிளாசிக்கல் பிட் நிபந்தனைக்குட்பட்டது :math:`c_0`(:math:`=\varphi_2`) ``c_if`` முறையைப் பயன்படுத்துதல். இந்த பயிற்சில் முதல் பகுதியில் நாம் பார்த்தது போல, 1 இன் மதிப்புடன் ``c_if`` முறையை நாம் பயன்படுத்த வேண்டும் :math:`1_{10} = 001_{2}` (சந்தாக்கள் :math:`_{10}` மற்றும் :math:`_2` தசம மற்றும் பைனரி பிரதிநிதித்துவங்களைக் குறிக்கிறது).
tr_tr: Böylelikle, sıfırlamadan sonra, klasik bit :math:`c_0` (:math:`\theta=-\pi/2` ile koşullandırılmış faz kapısı :math:`P(\theta)`) ile faz kapısını ``c_if``` yöntemini kullanarak uygularız (:math: `=\varphi_2`). Bu öğreticinin ilk bölümünde gördüğümüz gibi, ``c_if`` yöntemini :math:`1_{10} = 001_{2}` olarak 1 değerinde kullanmamız gerekiyor (alt simgeler :math: `_{10}` ve :math:`_2` ondalık ve ikili temsilleri gösterir).

source: Application of the Controlled-\ :math:`U` gates and x-measurement (for step 2)
es_un: Aplicación de las compuertas :math:`U` Controladas y medición en x (para el paso 2)

source: We apply the :math:`CU` operations as we did in the first step. For the second step we have :math:`t=m-2`, hence :math:`2^t=1`. So we apply :math:`\text{CP}(\pi/2)` once. And then we perform the x-measurement of the qubit :math:`q_0`, storing the result, the phase bit :math:`\varphi_1`, in the bit :math:`c_1` of classical register.
es_un: Aplicamos las operaciones :math:`CU` como hicimos en el primer paso. Para el segundo paso tenemos :math:`t=m-2`, por lo tanto :math:`2^t=1`. Entonces aplicamos :math:`\text{CP}(\pi/2)` una vez. Y luego realizamos la medición en x del qubit :math:`q_0`, almacenando el resultado, el bit de fase :math:`\varphi_1`, en el bit :math:`c_1` del registro clásico.
fr: Nous appliquons alors les portes :math:"CU" comme nous l'avons fait lors de la première étape. Pour la deuxième étape, nous avons :math:`t=m-2`, donc :math:`2^t=1`. Nous appliquons donc :math:`\text{CP}(\pi/2\)` une seule fois. Ensuite, nous réalisons la mesure dans la base :math:`X` du qubit :math:`q_0`, et enregistrons le résultat, à savoir le bit de phase :math:`\varphi_1`, dans le bit :math:`c_1` du registre classique.
ko: 첫 단계에서 그랬던 것처럼 :math:`CU` 연산을 적용한다. 두 번째 단계에는 :math:`t=m-2` 이고, 따라서 :math:`2^t=1` 이다. 그래서 우리는 :math:`\text{CP}(\pi/2)` 를 한 번 적용한다. 그런 다음 큐비트 :math:`q_0` 의 x 측정을 수행하여 결과, 위상 비트 :math:`\varphi_1` 를 고전적 레지스터의 비트 :math:`c_1` 에 저장한다.
pl: Zastosujemy operacje :math:`CU` tak jak to zrobiliśmy w pierwszym kroku. W drugim kroku mamy :math:`t=m-2`, stąd :math:`2^t=1`. A zatem stosujemy :math:`\text{CP}(\pi/2)` jeden raz. A następnie wykonujemy x-pomiar kubitu :math:`q_0`, zapisując wynik, bity fazy :math:`\varphi_1`, w bitie :math:`c_1` rejestru klasycznego.
pt_un: Aplicamos as operações :math:`CU` assim como fizemos no primeiro passo. Para o segundo passo temos :math:`t=m-2`, daí :math:`2^t=1`. Então aplicamos :math:`\text{CP}(\pi/2)` uma vez. E então realizamos a x-medição do qubit :math:`q_0`, armazenando o resultado, o bit de phase :math:`\varphi_1`, no bit :math:`c_1` do registrador clássico.
ta: முதல் படியில் செய்ததைப் போலவே :math:`CU` செயல்பாடுகளைப் பயன்படுத்துகிறோம். இரண்டாவது படிக்கு நம்மிடம் உள்ளது :math:`t=m-2`, எனவே :math:`2^t=1`. எனவே நாம் :math:`\text{CP}(\pi/2)` ஐ ஒருமுறை பயன்படுத்துகிறோம். பின்னர் நாம் qubit :math:`q_0` இன் x-அளவைச் செய்கிறோம், இதன் விளைவாக, பைட் :math:`\varphi 1` என்ற சொற்றொடரை கிளாசிக்கல் பதிவேட்டின் பிட் :math:`c_1` இல் சேமிக்கிறோம்.

source: Et voilà, we have our final circuit
bn_bn: আমরা অন্তিম সার্কিট পেলাম
es_un: Y listo, tenemos nuestro circuito final
fr: Et voilà ! nous avons notre circuit final
ko: 마침내! 최종회로가 완성되었다.
pl: I voilà, mamy nasz ostatni obwód
pt_un: Et voilà, temos nosso circuito final
ta: Et voilà, எங்கள் இறுதி சுற்று உள்ளது
tr_tr: Ve buyrun! Artık nihai devremiz elimizde

source: Let’s execute the circuit with the ``qasm_simulator``, the simulator without noise that run locally.
es_un: Ejecutemos el circuito con el ``qasm_simulator``, el simulador sin ruido que se ejecuta localmente.
pt_un: Executemos o circuito com o ``qasm_simulator``, o simulador sem ruído que funciona localmente.
ta: ``qasm_simulator`` உடன் வட்டத்தை இயக்கலாம், உள்நாட்டில் இயங்கும் இரைச்சல் இல்லாமல் சிமுலேட்டர்.
tr_tr: Lokal olarak çalışan gürültüsüz simülatör olan ``qasm_simulator`` ile devreyi çalıştıralım.

source: In the picture we have the same histograms but on the left we have on the x-axis the string with phase bits :math:`\varphi_1`, :math:`\varphi_2` and on the right the actual phase :math:`\varphi` in decimal representation.
bn_bn: এই ছবিতে একই হিস্টোগ্রাম পেলেও লক্ষ্য করো বাঁ দিকে x-অক্ষে :math:`\varphi_1`, :math:`\varphi_2` দশা বিটদুটো এবং ডানদিকে আসল দশা :math:`\varphi` দশমিকরূপে আছে।
es_un: En la imagen tenemos los mismos histogramas, pero a la izquierda tenemos en el eje x la cadena con bits de fase :math:`\varphi_1`, :math:`\varphi_2` y a la derecha la fase real :math:`\varphi` en representación decimal.
fr: Sur cette image, nous avons les mêmes histogrammes, à l'exception du fait que sur l'axe X de celui de gauche se trouve la représentation binaire de :math:`\varphi`, c'est-à-dire les valeurs de :math:`\varphi_1` et de :math:`\varphi_2` tandis sa représentation décimale se trouve sur celui de droite.
ko: 그림에서 히스토그램은 동일하지만 왼쪽에는 x축에 위상 비트 :math:`\varphi_1` , :math:`\varphi_2` 가 있는 문자열이 있고 오른쪽에는 10진수 표시의 실제 위상 :math:`\varphi` 가 있다.
pl: Na obrazku mamy te same histogramy, ale po lewej stronie na osi x mamy ciąg znaków z bitami fazy :math:`\varphi_1`, :math:`\varphi_2` i po prawej stronie rzeczywisty etap :math:`\varphi` w postaci dziesiętnej.
pt_un: Na imagem temos os mesmos histogramas mas à esquerda temos no eixo x a string com bits de fase :math:`\varphi_1`, :math:`\varphi_2` e à direita a fase real :math:`\varphi` em representação decimal.
ta: படத்தில் எங்களிடம் அதே ஹிஸ்டோகிராம்கள் உள்ளன, ஆனால் இடதுபுறத்தில் x- அச்சில் கட்ட பிட்கள் கொண்ட சரம் உள்ளது :math:`\varphi_1`, :math:`\varphi_2` மற்றும் வலதுபுறத்தில் உண்மையான கட்டம் தசம பிரதிநிதித்துவத்தில் :math:`\varphi`.
tr_tr: Resimde aynı histogramlara sahibiz ama solda x ekseninde :math:`\varphi_1`, :math:`\varphi_2` faz bitlerine sahip dize ve sağda ondalık gösterimde gerçek faz olan :math:`\varphi` var.

source: As we expected we have found :math:`\varphi=\frac{1}{4}=0.25` with a :math:`100\%` probability.
bn_bn: আশানুরূপভাবে আমরা :math:`100\%` সম্ভাবনায় :math:`\varphi=\frac{1}{4}=0.25` পেয়েছি।
es_un: Como esperábamos, hemos encontrado :math:`\varphi=\frac{1}{4}=0.25` con una probabilidad de :math:`100\%`.
fr: Comme nous nous y attendions, nous trouvons :math:`\varphi=\frac{1}{4}=0,25` avec une probabilité de :math:`100\%`.
ko: 예상했던 대로 :math:`100\%` 확률로 :math:`\varphi=\frac{1}{4}=0.25` 를 찾았다.
pl: Jak się spodziewaliśmy znaleźliśmy :math:`\varphi=\frac{1}{4}=0.25` z prawdopodobieństwem :math:`100\%`.
pt_un: Como esperávamos encontramos :math:`\varphi=\frac{1}{4}=0.25` com uma probabilidade de :math:`100\%`.
ta: நாம் எதிர்பார்த்தது போல் நாம் கண்டறிந்தோம் :math:`\varphi=\frac{1}{4}=0.25` உடன் :math:`100\%` நிகழ்தகவு.
tr_tr: Beklediğimiz gibi :math:`\varphi=\frac{1}{4}=0.25` değerini :math:`100\%` olasılıkla bulduk.

source: IPE example with a 2-qubit gate
bn_bn: ২-কিউবিট গেইট সম্পন্ন আইপিই এর উদাহরণ
es_un: Ejemplo de IPE con una compuerta de 2 qubits
fr: Exemple d'IPE avec une porte à deux qubits
ko: 2-큐비트 게이트를 갖는 IPE의 예제
pl: Przykład IPE z dwukubitową bramą
pt_un: Exemplo de IPE com uma porta de 2 qubits
ta: 2-க்யூபிட் கேட்யுடன் IPE உதாரணம்
tr_tr: 2 kübit geçitli IPE örneği

source: Now, we want to apply the IPE algorithm to estimate the phase for a 2-qubit gate :math:`U`. For this example, let’s consider the controlled version of the :math:`T` gate, i.e. the gate :math:`U=\textrm{Controlled-}T` (that from now we will express more compactly with :math:`CT`). Its matrix is
es_un: Ahora, queremos aplicar el algoritmo IPE para estimar la fase para una compuerta :math:`U` de 2 qubits. Para este ejemplo, consideremos la versión controlada de la compuerta :math:`T`, es decir, la compuerta :math:`U=\textrm{Controlled-}T` (que a partir de ahora expresaremos de manera más compacta con :math:`CT`). Su matriz es
pt_un: Agora, queremos aplicar o algoritmo IPE para estimar a fase de uma porta de 2 qubits :math:`U`. Para este exemplo, vamos considerar a versão controlada da porta :math:`T`, ou seja, a porta :math:`U=\textrm{Controlled-}T` (que a partir de agora vamos expressar de forma mais compacta com :math:` CT'). Sua matriz é
ta: இப்போது, ​​2-க்விட் கேட் :math:`U`க்கான கட்டத்தை மதிப்பிடுவதற்கு IPE அல்காரிதத்தைப் பயன்படுத்த விரும்புகிறோம். இந்த எடுத்துக்காட்டிற்கு, :math:`T` வாயிலின் கட்டுப்படுத்தப்பட்ட பதிப்பைக் கருத்தில் கொள்வோம், அதாவது கேட் :math:`U=\textrm{Controlled-}T` (இனிமேல் நாம் :math:` உடன் சுருக்கமாக வெளிப்படுத்துவோம். CT`). அதன் அணி

source: That is, the :math:`CT` gate adds a phase :math:`\pi/4` to the state :math:`|11\rangle`, leaving unchanged the phase of the other computational basis states :math:`|00\rangle`, :math:`|01\rangle`, :math:`|10\rangle`.
bn_bn: অর্থাৎ :math:`CT` গেট :math:`|11\rangle` অবস্থায় :math:`\pi/4` দশা যোগ করে। এই অবস্থায় অন্যান্য গণনার ভিত্তি অবস্থা :math:`|00\rangle`, :math:`|01\rangle`, :math:`|10\rangle` -এর দশা অপরিবর্তিত থাকে।
es_un: Es decir, la compuerta :math:`CT` agrega una fase de :math:`\pi/4` al estado :math:`|11\rangle`, dejando sin cambios la fase de los otros estados de la base computacional :math:`|00\rangle`, :math:`|01\rangle`, :math:`|10\rangle`.
fr: Ainsi, la porte :math:`CT` ajoute une phase de :math:`\frac{\pi}{4}` à l'état :math:`|11\rangle`, et laisse inchangées les phases des autres états de base, à savoir :math:`|00\rangle`, :math:`|01\rangle` et :math:`|10\rangle`.
ko: 즉, :math:`CT` 게이트는 상태 :math:`|11\rangle` 에 위상 :math:`\pi/4` 를 더하며, 다른 계산 기저 상태들 :math:`|00\rangle`, :math:`|01\rangle`, :math:`|10\rangle` 의 위상은 변경되지 않는다.
pt_un: Isto é, a porta :math:`CT` adiciona uma fase :math:`\pi/4` para o estado :math:`|11\rangle`, deixando inalterada a fase dos outros estados de base computacional :math:`|00\rangle`, :math:`|01\rangle`, :math:`|10\rangle`.
ta: அதாவது, :math:`CT` கேட் ஒரு கட்டத்தை சேர்க்கிறது :math:`\pi/4` மாநிலத்திற்கு: :math:`|11\rangle`, மற்ற கணக்கீட்டு அடிப்படையின் நிலை மாறாமல் விட்டுவிடுகிறது: :math:`|00\rangle`, :math:`|01\rangle`, :math:`|10\rangle`.
tr_tr: Yani, :math:`CT` kapısı, :math:`|11\rangle` durumuna bir faz :math:`\pi/4` ekler ve diğer hesaplama temelli durumların fazını değiştirmeden bırakır :math:` |00\rangle`, :math:`|01\rangle`, :math:`|10\rangle`.

source: Let’s consider to estimate the phase :math:`\phi=\pi/4` for the eigenstate :math:`|11\rangle`, we should find :math:`\varphi=1/8`, since :math:`\phi = 2 \pi \varphi`. Therefore to estimate the phase we need exactly 3 classical bits, i.e. \ :math:`m=3`, since :math:`1/2^3=1/8`. So :math:`\varphi=0.\varphi_1\varphi_2\varphi_3`.
es_un: Consideremos estimar la fase :math:`\phi=\pi/4` para el estado propio :math:`|11\rangle`, deberíamos encontrar :math:`\varphi=1/8`, ya que :math:`\phi = 2 \pi \varphi`. Por lo tanto, para estimar la fase necesitamos exactamente 3 bits clásicos, es decir, \ :math:`m=3`, ya que :math:`1/2^3=1/8`. Entonces :math:`\varphi=0.\varphi_1\varphi_2\varphi_3`.

source: As done with the example for the 1-qubit :math:`U` operator we will go through the same steps but this time we will have :math:`3` steps since :math:`m=3`, and we will not repeat all the explanations. So for details see the above example for 1-qubit :math:`U` gate.
bn_bn: ১-কিউবিট :math:`U` অপারেটরের উদাহরণের মতো আমরা একই ধাপ অনুসরণ করব কিন্তু এবার আমাদের :math:`3` গুলো ধাপ থাকবে কারণ :math:`m=3`। এই ব্যাপারে বিস্তারিত জানতে ১-কিউবিট :math:`U` গেটের উদাহরণ দেখুন।
es_un: Como se hizo con el ejemplo para el operador :math:`U` de 1 qubit, seguiremos los mismos pasos, pero esta vez tendremos :math:`3` pasos ya que :math:`m=3`, y no repetiremos todas las explicaciones. Entonces, para obtener más detalles, consulta el ejemplo anterior para la compuerta :math:`U` de 1 qubit.
fr: Comme cela a été fait dans l'exemple pour un opérateur à un qubit :math:`U`, nous allons passer par les mêmes étapes, bien que nous aurons cette fois :math:`3` étapes, étant donné que :math:`m=3` et nous ne répéterons pas toutes les explications. Donc pour plus de détails, nous conseillons de se référer à l'exemple ci-dessus portant sur un opérateur à un qubit :math:`U` gate.
ko: 1큐비트 :math:`U` 연산자의 예와 마찬가지로 동일한 단계를 거치지만 이번에는 :math:`m=3` 이라서 :math:`3` 단계를 거치게 되며 모든 설명을 반복하지는 않을 것이다. 자세한 내용은 위의 1큐비트 :math:`U` 게이트 예를 참조하자.
pl: Tak jak zrobiono za pomocą przykładu operatora `U` 1-qubit :math:, przeprowadzimy te same kroki, ale tym razem będziemy mieć :math:`3`, gdzie :math:`m=3`, i nie będziemy już powtarzać wszystkich wyjaśnień. Więc aby uzyskać więcej informacji, zobacz powyższy przykład bramki jednokubitowej :math:`U`.
pt_un: Como feito com o exemplo para o operador de 1 qubit :math:`U`, seguiremos os mesmos passos, mas desta vez teremos :math:`3` passos já que :math:`m=3`, e não vamos repetir todas as explicações. Portanto, para obter detalhes, consulte o exemplo acima para a porta de 1 qubit :math:`U`.
ta: 1-க்யூபிட் :math:`U` ஆபரேட்டருக்கான எடுத்துக்காட்டுடன் நாம் அதே படிகளைச் செய்வோம் ஆனால் இந்த முறை நமக்கு இருக்கும் :math:`3` படிகள் :math:`m=3`, மற்றும் நாங்கள் செய்வோம் அனைத்து விளக்கங்களையும் மீண்டும் செய்ய வேண்டாம். எனவே விவரங்களுக்கு 1-க்யூபிட் :math:`U` கேட் மேலே உள்ள உதாரணத்தைப் பார்க்கவும்.
tr_tr: 1-kübit :math:`U` operatörü örneğinde olduğu gibi aynı adımları izleyeceğiz ancak bu sefer :math:`m=3` olduğundan beri :math:`3` adımlarımız olacak ve tüm açıklamaları tekrarlamayacağız. Bu nedenle ayrıntılar için yukarıdaki 1-kübit :math:`U` kapısı örneğine bakın.

source: First, we initialize the circuit with 3 qubits, 1 for the auxiliary qubit and 2 for the 2-qubit gate, and 3 classical bits to store the phase bits :math:`\varphi_1`, :math:`\varphi_2`, :math:`\varphi_3`.
bn_bn: প্রথমে আমরা ৩টি কিউবিট নিয়ে সার্কিট চালু করবো, ১টা সহায়ক কিউবিট, ২-কিউবিট গেটের জন্য ২টো। এছাড়াও আমরা ৩টি ক্লাসিক্যাল বিট নেবো যাতে :math:`\varphi_1`, :math:`\varphi_2`, :math:`\varphi_3` দশা বিটের মান সঞ্চয় হবে।
es_un: Primero, inicializamos el circuito con 3 qubits, 1 para el qubit auxiliar y 2 para la compuerta de 2 qubits, y 3 bits clásicos para almacenar los bits de fase :math:`\varphi_1`, :math:`\varphi_2`, :math:`\varphi_3`.
fr: Tout d'abord, nous initialisons le circuit avec 3 qubits, 1 pour le qubit auxiliaire et 2 sur lesquels on appliquera notre opérateur, ainsi qu'avec 3 bits classiques pour stocker les bits de phase :math:`\varphi_1`, :math:`\varphi_2` et :math:`\varphi_3`.
ko: 먼저, 3개의 큐비트 (보조 큐비트용 1개 및 2-큐비트 게이트용 2개)와 위상 비트 :math:`\varphi_1`, :math:`\varphi_2`, :math:`\varphi_3` 를 저장하는 3개의 고전 비트로 회로를 초기화한다.
pt_un: Primeiro, inicializamos o circuito com 3 qubits, 1 para o qubit auxiliar e 2 para a porta de 2 qubits, e 3 bits clássicos para armazenar os bits de fase :math:`\varphi_1`, :math:`\varphi_2`, :math:`\varphi_3`.
ta: முதலில், 3 க்யூபிட், 1 துணை க்யூபிட் மற்றும் 2-க்யூபிட் கேட், மற்றும் 3 கிளாசிக்கல் பிட்கள், கட்ட பிட்களை சேமித்து வைப்பதற்கான சர்க்யூட்டை துவக்குகிறோம் :math:`\varphi_1`, :math:`\varphi_2`, :math:`\varphi_3`.

source: Now we build the quantum circuit for the first step, to estimate the least significant phase bit :math:`\varphi_m=\varphi_3`.
bn_bn: এবার আমরা কম তাৎপর্যপূর্ণ দশা বিট :math:`\varphi_m=\varphi_3` অনুমানের জন্য আমরা কোয়ান্টাম সার্কিট বানাবো।
es_un: Ahora construimos el circuito cuántico para el primer paso, para estimar el bit de fase menos significativo :math:`\varphi_m=\varphi_3`.
fr: Nous construisons alors le circuit quantique pour la première étape, afin d'estimer le bit de phase le moins significatif :math:`\varphi_m = \varphi_3`.
ko: 이제 최하위 위상 비트 :math:`\varphi_m=\varphi_3` 를 추정하기 위해 첫 번째 단계로 양자 회로를 구축한다.
pt_un: Agora construímos o circuito quântico para a primeira etapa, para estimar o bit de fase menos significativo :math:`\varphi_m=\varphi_3`.
ta: குறைந்தபட்ச குறிப்பிடத்தக்க கட்ட பிட்டை மதிப்பிடுவதற்கு இப்போது முதல் கட்டத்திற்கு குவாண்டம் சுற்றுகளை உருவாக்குகிறோம்: :math:`\varphi_m=\varphi_3`.
tr_tr: Şimdi en az anlamlı faz bitini tahmin etmek için ilk adım için kuantum devresini oluşturuyoruz :math:`\varphi_m=\varphi_3`.

source: We initialize the auxiliary qubit and the other qubits with the eigenstate :math:`|11\rangle`.
es_un: Inicializamos el qubit auxiliar y los otros qubits con el estado propio :math:`|11\rangle`.
fr: Nous initialisons le qubit auxiliaire en appliquant une porte d'Hadamard et les deux autres qubits en les mettant dans l'état propre :math:`|11\rangle`.
ko: 고유 상태 :math:`|11\rangle` 로 보조 큐비트와 다른 큐비트들을 초기화한다.
pt_un: Nós inicializamos o qubit auxiliar e os outros qubits com o estado inerente :math:`|11\rangle`.
ta: துணை குவிட் மற்றும் பிற குவிட்களை eigenstate :math:`|11\rangle` மூலம் துவக்குகிறோம்.
