Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/textbook/01_IQPE.po
Languages: bn_bn, es_un, fr, ko, pl, pt_un, ta, tr_tr

source: This page was generated from `tutorials/textbook/01_IQPE.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/algorithms/08_factorizers.ipynb`__ থেকে নেয়া হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/textbook/01_IQPE.ipynb`__.
fr: Cette page a été générée à partir de `tutorials/algorithms/06_qaoa.ipynb`__.
ko: 이 페이지는 `tutorials/textbook/01_IQPE.ipynb`__ 에서 생성되었다.
pl: Ta strona została wygenerowana z `tutorials/textbook/01_IQPE.ipynb`__.
pt_un: Esta página foi gerada a partir de `tutorials/textbook/01_IQPE.ipynb`__.
ta: இந்தப் பக்கம் `tutorials/algorithms/09_IQPE.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
tr_tr: Bu sayfa, `tutorials/algorithms/09_IQPE.ipynb`__ adresinden oluşturulmuştur.

source: Iterative Quantum Phase Estimation Algorithm
bn_bn: ধাপে ধাপে কোয়ান্টাম দশা অনুমানকারী অ্যালগরিদম
es_un: Algoritmo de Estimación de Fase Cuántica Iterativa
fr: Algorithme d'estimation iterative de phase quantique
ko: 반복 양자 위상 추정 알고리즘 (IQPE)
pl: Algorytm IQPE (Iterative Quantum Phase Estimation, pol. Iteracyjnej Estymacji Fazy Kwantowej)
pt_un: Algoritmo de Estimativa de Fase Quântica Iterativa
ta: மறுபயன்பாட்டு குவாண்டம் கட்ட மதிப்பீடு வழிமுறை
tr_tr: Yinelemeli Kuantum Faz Tahmini Algoritması

source: The goal of this tutorial is to understand how the Iterative Phase Estimation (IPE) algorithm works, why would we use the IPE algorithm instead of the QPE (Quantum Phase Estimation) algorithm and how to build it with Qiskit using the same circuit exploiting reset gate and the ``c_if`` method that allows to apply gates conditioned by the values stored in a classical register, resulting from previous measurements.
bn_bn: এই টিউটোরিয়ালগুলোর লক্ষ্য হলো কিভাবে ইটারেটিভ ফেজ এস্টিমেশন (আইপিই) অ্যালোগরিদম কাজ করে, কোয়ান্টাম ফেজ এস্টিমেশন (কিউপিই) এর বদলে কেন আমরা আইপিই ব্যবহার করব এবং Qiskit এর সাহায্যে একই (সার্কিটে পুনঃস্থাপন (রিসেট) যুক্তিবর্তনী (গেইট) এবং ``c_if`` পদ্ধতির সাহায্যে ক্লাসিক্যাল রেজিস্টারে থাকা আগের পরিমাপের মান শর্ত হিসেবে নিয়ে গেট প্রয়োগ করা যায়) কাজে লাগিয়ে কিভাবে আইপিই নির্মাণ (বিল্ড) করা যায়।
es_un: El objetivo de este tutorial es comprender cómo funciona el algoritmo de Estimación de Fase Iterativa (Iterative Phase Estimation, IPE), por qué usaríamos el algoritmo IPE en lugar del algoritmo QPE (Quantum Phase Estimation, Estimación de Fase Cuántica) y cómo construirlo con Qiskit utilizando el mismo circuito aprovechando la compuerta de reinicio y el método ``c_if`` que permite aplicar compuertas condicionadas por los valores almacenados en un registro clásico, resultantes de mediciones previas.
fr: L'objectif de ce tutoriel est de comprendre comment fonctionne l'algorithme itératif d'estimation de phase quantique (IPE en anglais), pourquoi utiliser cet algorithme au lieu de l'algorithme QPE (Quantum Phase Estimation) et comment le construire avec Qiskit en utilisant le même circuit exploitant la porte de réinitialisation et la méthode ``c_if`` qui permet d'appliquer des portes conditionnées par les valeurs stockées dans un registre classique, résultant de mesures antérieures.
ko: 이 튜토리얼의 목표는 Iterative Phase Estimation (IPE, 반복 위상 추정) 알고리즘이 어떻게 작동되는지, 왜 우리가 QPE (Quantum Phase Estimation) 가 아니라 IPE 알고리즘을 사용해야 하는지, 그리고 어떻게 Qiskit을 사용해서 이 알고리즘을 생성할 수 있는지를 이해하는 것이다. 이 알고리즘을 생성할 때에는 초기화 게이트와 ``c_if`` 메서드를 포함한 회로를 사용하면 되는데, 이 ``c_if`` 메서드는 이전의 측정들에서 비롯된 고전 레지스터에 저장된 값들로 조절된 게이트들을 적용할 수 있게 한다.
pl: Celem tego poradnika jest zrozumienie, jak algorytm IPE (Iterative Phase Estimation, pol. Iteracyjnej Estymacji Fazy) działa, dlaczego używalibyśmy algorytmu IPE zamiast algorytmu QPE (Quantum Phase Estimation, pol. Estymacji Fazy Kwantowej) oraz jak zbudować go z Qiskit przy użyciu tego samego obwodu wykorzystującego bramkę resetu i metodę ``c_if``, która pozwala stosować bramki uwarunkowane wartościami przechowywanymi w rejestrze klasycznym, wynikającymi z wcześniejszych pomiarów.
pt_un: O objetivo desse tutorial é entender como o algoritmo de Estimativa de Fase Iterativa (IPE) funciona, porque usaríamos o algoritmo IPE em vez do algoritmo QPE (Estimativa de Fase Quântica) e como construí-lo com o Qiskit usando o mesmo circuito explorando a porta de reset e o método ``c_if`` que permite aplicar portas condicionadas pelos valores armazenados em um registrador clássico, resultantes de medições anteriores.
ta: இந்த டுடோரியலின் குறிக்கோள், படிநிலை கட்ட மதிப்பீடு (IPE) வழிமுறை எவ்வாறு செயல்படுகிறது, QPE (Quantum Phase Estimation) அல்காரிதத்திற்குப் பதிலாக நாம் ஏன் IPE அல்காரிதத்தைப் பயன்படுத்துகிறோம் மற்றும் அதே சர்க்யூட் சுரண்டல் மீட்டமைப்பு வாயிலைப் பயன்படுத்தி அதை எப்படி உருவாக்கலாம் முந்தைய அளவீடுகளின் விளைவாக கிளாசிக்கல் பதிவேட்டில் சேமிக்கப்பட்ட மதிப்புகளால் நிபந்தனைக்குட்பட்ட வாயில்களைப் பயன்படுத்த அனுமதிக்கும் ``c_if`` முறை.

source: **References**
bn_bn: **তথ্যসূত্র (রেফারেন্স)**
es_un: **Referencias**
fr: **Références :**
ko: **참조**
pl: **Źródła**
pt_un: **Referências**
ta: ** குறிப்புகள் **
tr_tr: **Referanslar**

source: `Section 2 of Lab 4: Iterative Phase Estimation (IPE) Algorithm <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__
bn_bn: `পরীক্ষা ৪ এর দ্বিতীয় অংশ: ইটারেটিভ ফেজ এস্টিমেশন (আইপিই) ধারাক্রম (অ্যালোগরিদম) <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__
es_un: `Sección 2 del Lab 4: Algoritmo de Estimación de Fase Iterativa (IPE) <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__
fr: Section 2 du Lab 4: Algorithme d'estimation itérative de phase (IPE) <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>` __
ko: `랩 4의 2절: 반복 단계 추정 (IPE) 알고리즘 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__
pt_un: Seção 2 do Lab 4: Algoritmo de Estimativa de Fase Iterativa (IPE) <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>` __

source: `Ch.3.6 Quantum Phase Estimation <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__
bn_bn: `অধ্যায় ৩.৬ কোয়ান্টাম দশা অনুমান <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__
es_un: `Ch.3.6 Estimación de Fase Cuántica <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__
fr: ` Ch. 3.6 Estimation de la phase quantique <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>` __
ko: `Ch.3.6 양자 위상 추정 <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__
pt_un: `Ch.3.6 Estimativa de Fase Quântica <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__
tr_tr: ` Ch. 3.6 Kuantum Faz Tahmini <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>` __

source: Conditioned gates: the c_if method
es_un: Compuertas condicionadas: el método c_if
fr: Portes conditionnées : la méthode c_if
ko: 조건부 게이트: c_if 메소드
pl: Bramki logiczne: metoda``c_if``
pt_un: Portas condicionadas: o método c_if
ta: நிபந்தனைக்குட்பட்ட வாயில்கள்: c_if முறை

source: Before starting the IPE algorithm, we will give a brief tutorial about the Qiskit conditional method, c_if, as it goes into building the IPE circuit.
bn_bn: আইপিই ধারাক্রম (অ্যালোগরিদম) বোঝার আগে আমাদের Qiskit -এর শর্তসাপেক্ষ পদ্ধতি c_if এর ব্যাপারে জানতে হবে, কারণ আইপিই বর্তনী বানাতে এটা কাজে লাগবে।
es_un: Antes de iniciar el algoritmo IPE, vamos a dar un breve tutorial sobre el método condicional de Qiskit, c_if, a medida que se avanza en la construcción del circuito IPE.
fr: Avant de commencer l'algorithme IPE, nous allons donner un bref tutoriel sur la méthode Qiskit conditionnelle, c_if, dans la construction du circuit IPE.
ko: IPE 알고리즘을 시작하기 전에, IPE 회로를 만들어 내는 Qiskit 조건부 메서드 c_if에 관한 간단한 튜토리얼을 제공할 것이다.
pl: Przed rozpoczęciem algorytmu IPE przeprowadzimy krótki poradnik o metodzie warunkowej Qiskit, ``c_if``, ponieważ jest ona częścią składową budowy obwodu IPE.
pt_un: Antes de iniciar o algoritmo IPE, daremos um breve tutorial sobre o método condicional Qiskit, c_if, conforme se avança na construção do circuito IPE.
ta: IPE வழிமுறையைத் தொடங்குவதற்கு முன், qiskit நிபந்தனை முறை, c_if பற்றி ஒரு சுருக்கமான பயிற்சிகளைக் கொடுப்போம், ஏனெனில் இது IPE சுற்றுவட்டத்தை உருவாக்குகிறது.
tr_tr: IPE algoritmasına başlamadan önce, IPE devresini kurarken Qiskit koşullu metodu c_if hakkında kısa bir eğitim vereceğiz.

source: ``c_if`` is a function (actually a method of the gate class) to perform conditioned operations based on the value stored previously in a classical register. With this feature you can apply gates after a measurement in the same circuit conditioned by the measurement outcome.
bn_bn: ``c_if`` হল gate ক্লাসের একটা পদ্ধতি যা পূর্বে প্রথাগত (ক্লাসিক্যাল) রেজিস্টারে সঞ্চিত মানের উপর নির্ভর করে শর্তাধীন ক্রিয়াকলাপ (অপারেশন) করে। এর সাহায্যে একই বর্তনীতে একবার পরিমাপের পর তার ফলাফল বিচার করে আরো গেট যোগ করতে পারি।
es_un: ``c_if`` es una función (en realidad, un método de la clase compuerta) para realizar operaciones condicionadas basadas en el valor almacenado previamente en un registro clásico. Con esta función puedes aplicar compuertas después de una medición en el mismo circuito condicionado por el resultado de la medición.
fr: ``c_if`` est une fonction (ou plus exactement une méthode de la classe ``Gate``) pour effectuer des opérations conditionnées par la valeur stockée précédemment dans un registre classique. Avec cette fonctionnalité, il est possible d'appliquer des portes après une mesure dans le même circuit conditionnées par le résultat de ladite mesure.
ko: (사실상 게이트 클래스의 메서드인) ``c_if`` 는 고전 레지스터에 저장된 값을 기반으로 조건부 연산을 하는 함수이다. 이 기능으로 회로의 측정 이후에 측정 결과를 조건부로 가지는 게이트를 적용할 수 있다.
pl: ``c_if`` to funkcja (a właściwie metoda o funkcji bramki) wykonująca operacje warunkowe oparte na wartości przechowywanej wcześniej w rejestrze klasycznym. Z tą funkcją można stosować bramki po pomiarach w obwodzie uwarunkowanym rezultatem pomiaru.
pt_un: ``c_if`` é uma função (na verdade um método da classe porta) para realizar operações condicionadas baseadas no valor anteriormente armazenado em um registrador clássico. Com esta funcionalidade, você pode aplicar portas após uma medição no mesmo circuito condicionado pelo resultado da medição.
ta: ``c_if`` என்பது ஒரு பாரம்பரிய பதிவேட்டில் முன்பு சேமிக்கப்பட்ட மதிப்பின் அடிப்படையில் நிபந்தனைக்குட்பட்ட செயல்பாடுகளைச் செய்வதற்கான ஒரு செயல்பாடு (உண்மையில் கேட் வகுப்பின் முறை) ஆகும். இந்த அம்சத்தின் மூலம் அளவீட்டு முடிவுகளால் நிபந்தனைக்குட்பட்ட அதே சுற்றில் ஒரு அளவீட்டுக்குப் பிறகு நீங்கள் வாயில்களைப் பயன்படுத்தலாம்.

source: For example, the following code will execute the :math:`X` gate if the value of the classical register is :math:`0`.
bn_bn: নিচের উদাহরণের কোডে :math:`X` যুক্তিবর্তনী (গেইট) চালাবে যদি প্রথাগত (ক্লাসিক্যাল) রেজিস্টারের মান :math:`0` হয়।
es_un: Por ejemplo, el siguiente código ejecutará la compuerta :math:`X` si el valor del registro clásico es :math:`0`.
fr: Par exemple, le code suivant exécutera la porte :math:`X` si la valeur du registre classique est :math:`0`.
ko: 예를 들어, 다음의 코드는 고전 레지스터의 값이 :math:`0` 인 경우에 :math:`X` 게이트를 실행한다.
pl: Na przykład, poniższy kod uruchomi bramkę :math:`X`, jeśli wartość rejestru klasycznego to :math:`0`.
pt_un: Por exemplo, o código a seguir executará a porta :math:`X` se o valor do registrador clássico for :math:`0`.
ta: எடுத்துக்காட்டாக, பின்வரும் குறியீடு கிளாசிக்கல் பதிவின் மதிப்பு என்றால் :math:`X` கேட் :math:`0`.
tr_tr: Örneğin, klasik kaydın değeri :math:`0` ise, aşağıdaki kod :math:`X` kapısını çalıştıracaktır.

source: We highlight that the method c_if expects as the first argument a whole classical register, not a single classical bit (or a list of classical bits), and as the second argument a value in decimal representation (a non-negative integer), not the value of a single bit, 0, or 1 (or a list/string of binary digits).
bn_bn: উল্লেখ্য: c_if পদ্ধতি প্রথম আর্গুমেন্ট হিসেবে সম্পূর্ণ প্রথাগত (ক্লাসিক্যাল) রেজিস্টার নেয়, একটা প্রথাগত (ক্লাসিক্যাল) বিট বা বিটের তালিকা নয় এবং দ্বিতীয় আর্গুমেন্ট হিসেবে একটা ধনাত্মক অখণ্ড দশমিক সংখ্যা নয়, কোনো একটা বিট (০ বা ১) বা বিটের তালিকা নয়।
es_un: Resaltamos que el método c_if espera como primer argumento un registro clásico completo, no un solo bit clásico (o una lista de bits clásicos), y como segundo argumento un valor en representación decimal (un entero no negativo), no el valor de un solo bit, 0, o 1 (o una lista/cadena de dígitos binarios).
fr: Soulignons que la méthode c_if prévoit comme premier argument un registre classique entier, pas un bit classique simple (ni une liste de bits classiques), et comme second argument une valeur en représentation décimale (un entier non négatif), pas la valeur d'un bit simple, 0, ou 1 (ni une liste / chaîne de chiffres binaires).
ko: 강조할만한 것은 메서드 c_if는 하나의 고전 비트 (또는 고전 비트의 리스트) 가 아닌, 전체 고전 레지스터를 첫 번째 인수로 가지고, 하나의 비트값 0 또는 1 (또는 이진수 리스트/문자열) 이 아닌 (음수가 아닌) 십진수 표현 값을 두 번째 인수로 가질 것으로 기대한다는 것이다.
pl: Podkreślamy, że metoda ``c_if`` spodziewa się jako pierwszy argument całego klasycznego rejestru, nie pojedynczego bitu klasycznego (lub listy bitów klasycznych), oraz jako drugi argument wartość w postaci dziesiętnej (nieujemna liczba całkowita), nie wartości pojedynczego bitu, 0 lub 1 (lub listy/ciągu znaków binarnych).
pt_un: Ressaltamos que o método c_if espera como o primeiro argumento todo um registrador clássico, não um único bit clássico (ou uma lista de bits clássicos), e como o segundo argumento um valor na representação decimal (um inteiro não negativo), não o valor de um único bit, 0 ou 1 (ou uma lista/cadeia de dígitos binários).
ta: c_if முறை முதல் கிளாசிக்கல் பதிவேடு, ஒரு கிளாசிக்கல் பிட் (அல்லது கிளாசிக்கல் பிட்களின் பட்டியல்) அல்ல, இரண்டாவது வாதமாக தசம பிரதிநிதித்துவத்தில் ஒரு மதிப்பு (எதிர்மறை அல்லாத முழு எண்) எதிர்பார்க்கிறது என்பதை நாங்கள் முன்னிலைப்படுத்துகிறோம். ஒற்றை பிட், 0, அல்லது 1 (அல்லது பைனரி இலக்கங்களின் பட்டியல் / சரம்) மதிப்பு.
tr_tr: c_if metodunun ilk argüman olarak tek bir klasik bit (veya bir klasik bit listesi) değil, bütün bir klasik kayıt beklediğini ve ikinci argüman olarak ondalık gösterimde bir değer (negatif olmayan bir tam sayı) beklediğini, tek bir bitin değeri, 0 veya 1 (veya ikili rakamlar listesi/dizesi) olmadığını vurguluyoruz.

source: Let’s make another example. Consider that we want to perform a bit flip on the third qubit after the measurements in the following circuit, when the results of the measurement of :math:`q_0` and :math:`q_1` are both :math:`1`.
es_un: Hagamos otro ejemplo. Considera que queremos realizar un cambio de bit en el tercer qubit después de las mediciones en el siguiente circuito, cuando los resultados de la medición de :math:`q_0` y :math:`q_1` son ambos :math:`1`.
pt_un: Façamos outro exemplo. Considere que queremos executar um bit flip no terceiro qubit após as medições no circuito a seguir, quando os resultados da medição de :math:`q_0` e :math:`q_1` são ambos :math:`1`.
ta: இன்னொரு உதாரணத்தை உருவாக்குவோம். :math:`q_0` மற்றும் :math:`q_1` ஆகிய இரண்டும் :math:`1` இன் அளவீட்டின் முடிவுகள் வரும்போது, பின்வரும் சுற்றில் உள்ள அளவீடுகளுக்குப் பிறகு, மூன்றாவது க்யூபிட்டில் நாம் ஒரு பிட் புரட்டலைச் செய்ய விரும்புகிறோம்.
tr_tr: Başka bir örnek verelim. :math:`q_0` ve :math:`q_1` ölçüm sonuçlarının her ikisi de :math:`1` olduğunda, aşağıdaki devredeki ölçümlerden sonra üçüncü kübit üzerinde biraz çevirme yapmak istediğimizi düşünün.

source: We want to apply the :math:`X` gate, only if both the results of the measurement of :math:`q_0` and :math:`q_1` are :math:`1`. We can do this using the c_if method, conditioning the application of :math:`X` depending on the value passed as argument to c_if.
es_un: Queremos aplicar la compuerta :math:`X`, solo si ambos resultados de la medición de :math:`q_0` y :math:`q_1` son :math:`1`. Podemos hacer esto usando el método c_if, condicionando la aplicación de :math:`X` dependiendo del valor pasado como argumento a c_if.
fr: Nous voulons appliquer la porte :math:`X` seulement si les deux résultats de la mesure de :math:`q_0` et :math:`q_1` sont :math:`1`. Nous pouvons le faire en utilisant la méthode ``c_if``, avec la condition d'application de :math:`X` basée sur la valeur transmise comme argument à ``c_if``.
ko: :math:`q_0` 와 :math:`q_1` 의 측정 결과값이 모두 :math:`1` 인 경우에만 :math:`X` 게이트를 적용하고자 한다. c_if에 인수로 전달된 값에 따라 :math:`X` 의 적용을 조정하는 c_if 메서드를 사용하여 이 작업을 수행할 수 있다.
pl: Chcemy zastosować bramę :math:` X `, tylko jeśli zarówno wynik pomiaru :math:` q_0 `, jak i :math:` q_1 ` wynosi :math:` 1 `. Możemy to zrobić za pomocą metody ``c_if``, warunkującej aplikację :math:` X ` w zależności od wartości przekazanej jako argument do ``c_if``.
pt_un: Queremos aplicar a porta :math:`X` somente se ambos os resultados da medição de :math:`q_0` e :math:`q_1` forem :math:`1`. Podemos fazer isso usando o método c_if, condicionando a aplicação de :math:`X` dependendo do valor passado como argumento para c_if.
ta: :math:`q_0` மற்றும் :math:`q_1` ஆகியவற்றின் அளவீட்டின் இரண்டு முடிவுகளும் :math:`1` ஆக இருந்தால் மட்டுமே, :math:`X` வாயிலைப் பயன்படுத்த விரும்புகிறோம். c_if முறையைப் பயன்படுத்தி நாம் இதைச் செய்யலாம், c_if க்கு வாதமாக அனுப்பப்பட்ட மதிப்பைப் பொறுத்து :math:`X` பயன்பாட்டைக் கண்டிஷனிங் செய்யலாம்.

source: We will have to encode the value to pass to the c_if method such that it will check the values 011 and 111 (in binary representation), since it does not matter what :math:`q_2` is measured as.
es_un: Tendremos que codificar el valor para pasar al método c_if de manera que verifique los valores 011 y 111 (en representación binaria), ya que no importa cómo sea medido :math:`q_2`.
fr: Nous devrons encoder la valeur à passer à la méthode c_if pour qu'elle vérifie les valeurs 011 et 111 (en représentation binaire), car ce n'est pas important ce que :math:`q_2` est mesuré.
ko: :math:`q_2` 가 무엇으로 측정되는지는 중요하지 않기 때문에 (이진 표현에서) 011 및 111의 값을 확인하도록 c_if 메서드에 전달될 값을 암호화해야 한다.
pl: Będziemy musieli zakodować wartość, aby przejść do metody ``c_if`` w taki sposób, że sprawdzi wartości 011 i 111 (w reprezentacji binarnej), ponieważ nie ma znaczenia to, co mierzone jest :math:` q_2 `.
pt_un: Teremos que codificar o valor para passar para o método c_if tal que ele verificará os valores 011 e 111 (em representação binária), uma vez que não importa como :math:`q_2` é medido.
ta: c_if முறைக்கு அனுப்ப மதிப்பைக் குறியாக்கம் செய்ய வேண்டும், அது 011 மற்றும் 111 (பைனரி பிரதிநிதித்துவத்தில்) மதிப்புகளைச் சரிபார்க்கும், ஏனெனில் அது என்ன :math:`q_2` என அளவிடப்படுகிறது.

source: The 2 integer values in decimal representation:
bn_bn: এই ২টি পূর্ণসংখ্যা দশমিক সংখ্যা রূপে:
es_un: Los 2 valores enteros en representación decimal:
fr: Les deux valeurs entières dans la représentation décimale:
ko: 두 정수 값의 십진수 표현은 다음과 같다:
pl: Dwie liczby całkowite w reprezentacji dziesiętnej:
pt_un: Os 2 valores inteiros em representação decimal:
ta: தசம பிரதிநிதித்துவத்தில் 2 முழு மதிப்புகள்:
tr_tr: Ondalık gösterimde 2 tam sayı değeri:

source: We can check the solutions using the bin() method in python (the prefix ``0b`` indicates the binary format).
bn_bn: সমাধান দেখার জন্য আমরা পাইথনের bin() পদ্ধতি কাজে লাগাতে পারি (``0b`` উপসর্গ বোঝায় যে ফলটা বাইনারি)।
es_un: Podemos verificar las soluciones usando el método bin() en python (el prefijo ``0b`` indica el formato binario).
fr: Nous pouvons vérifier les solutions en utilisant la méthode bin() en python (le préfixe ``0b`` indique le format binaire).
ko: Python의 bin() 메서드를 통해 답을 확인할 수 있다 (접두어 ``0b`` 는 이진수 형식을 나타낸다).
pl: Możemy sprawdzić rozwiązania za pomocą metody bin () w p=Pythonie (prefiks ``0b`` wskazuje format binarny).
pt_un: Podemos verificar as soluções usando o método bin() em python (o prefixo ``0b`` indica o formato binário).
ta: பைத்தானில் bin() முறையைப் பயன்படுத்தி தீர்வுகளை நாம் சரிபார்க்கலாம் (``0b`` முன்னொட்டு பைனரி வடிவமைப்பைக் குறிக்கிறது).
tr_tr: Python'da bin() metodunu kullanarak çözümleri kontrol edebiliriz ( ``0b`` ön takısı ikili formatı belirtir).

source: So we have to apply :math:`X` to :math:`q_2` using c_if two times, one for each value corresponding to 011 and 111.
bn_bn: সেজন্য আমরা দুবার c_if ব্যবহার করে :math:`q_2` এর উপর :math:`X` প্রয়োগ করবো, 011 এবং 111 প্রত্যেক মানের জন্য একবার করে।
es_un: Entonces tenemos que aplicar :math:`X` a :math:`q_2` usando c_if dos veces, una para cada valor correspondiente a 011 y 111.
fr: Nous devons donc appliquer :math:`X` à :math:`q_2` en utilisant c_if deux fois, une pour chaque valeur correspondant à 011 et 111.
ko: 그러므로 값 011 and 111 각각에 해당하도록 :math:`q_2` 에 :math:`X` 를 두 번 적용해야 한다.
pl: Zatem musimy zastosować :math:`X` do :math:`q_2` używając ``c_if`` dwa razy, po jednym dla każdej wartości odpowiadającej 011 i 111.
pt_un: Por isso, temos que aplicar :math:`X` a :math:`q_2` utilizando c_if duas vezes, uma para cada valor correspondente a 011 e 111.
ta: எனவே நாம் விண்ணப்பிக்க வேண்டும் :math:`X` முதல் :math:`q_2` இரண்டு முறை c_if ஐப் பயன்படுத்துகிறது, 011 மற்றும் 111 உடன் தொடர்புடைய ஒவ்வொரு மதிப்புக்கும் ஒன்று.
tr_tr: Bu yüzden :math:`X` ile :math:`q_2` arasında c_if kullanarak 011 ve 111'e karşılık gelen her değer için bir tane olmak üzere iki kez uygulamamız gerekir.

source: The motivation for using the IPE algorithm is that QPE algorithm works fine for short depth circuits but when the circuit starts to grow, it doesn’t work properly due to gate noise and decoherence times.
es_un: La motivación para usar el algoritmo IPE es que el algoritmo QPE funciona bien para circuitos de poca profundidad, pero cuando el circuito comienza a crecer, no funciona correctamente debido al ruido de compuerta y los tiempos de decoherencia.
pt_un: A motivação para usar o algoritmo IPE é que o algoritmo QPE funciona bem para circuitos de curta profundidade mas quando o circuito começa a crescer, ele não funciona adequadamente devido aos tempos de ruído da porta e decoerência.
ta: IPE வழிமுறையைப் பயன்படுத்துவதற்கான உந்துதல் என்னவென்றால், குறுகிய ஆழம் சுற்றுகளுக்கு QPE வழிமுறை நன்றாக வேலை செய்கிறது, ஆனால் சுற்று வளரத் தொடங்கும் போது, ​​கேட் சத்தம் மற்றும் டிகோஹரன்ஸ் நேரங்கள் காரணமாக அது சரியாக வேலை செய்யாது.
tr_tr: IPE algoritmasını kullanma motivasyonu; QPE algoritmasının kısa derinlikli devreler için iyi çalışması ancak devre büyümeye başladığında kapı gürültüsü ve uyumsuzluk süreleri nedeniyle düzgün çalışmayacak hâle gelmesidir.
