Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/textbook/01_IQPE.po
Languages: bn_bn, es_un, fr, ko, pl, pt_un, ta, tr_tr

source: Application of the Controlled-:math:`U` gates and x-measurement (for step 2)
ko: Controlled-:math:`U` 게이트 및 x-측정의 적용 (2단계의 과정)
pl: Zastosowanie bramki Controlled-:math:`U` i x-pomiar (dla kroku 2)
ta: கட்டுப்படுத்தப்பட்ட-:math:`U` வாயில்களின் பயன்பாடு மற்றும் x-அளவீடு (படி 2 க்கு)

source: Let’s consider to estimate the phase :math:`\phi=\pi/4` for the eigenstate :math:`|11\rangle`, we should find :math:`\varphi=1/8`, since :math:`\phi = 2 \pi \varphi`. Therefore to estimate the phase we need exactly 3 classical bits, i.e. :math:`m=3`, since :math:`1/2^3=1/8`. So :math:`\varphi=0.\varphi_1\varphi_2\varphi_3`.
ta: Eigenstate :math:`|11\rangle`க்கான கட்டம் :math:`\phi=\pi/4` என்பதை மதிப்பிடுவதைக் கருத்தில் கொள்வோம், நாம் :math:`\varphi=1/8` ஐக் கண்டுபிடிக்க வேண்டும். :math:`\phi = 2 \pi \varphi`. எனவே கட்டத்தை மதிப்பிட, நமக்கு சரியாக 3 கிளாசிக்கல் பிட்கள் தேவை, அதாவது :math:`m=3`, என்பதால் :math:`1/2^3=1/8`. எனவே :math:`\varphi=0.\varphi_1\varphi_2\varphi_3`.

source: Then we have to apply multiple times the :math:`CU` operator, that, in this example, is the Controlled-:math:`CT` gate (:math:`CCT` for short).
ko: 그런 다음 :math:`CU` 연산자를 여러 번 적용해야 한다. 이 예에서는 Controlled-:math:`CT` 게이트(줄여서 :math:`CCT`) 이다.
ta: பிறகு நாம் பல முறை :math:`CU` ஆபரேட்டரைப் பயன்படுத்த வேண்டும், இந்த எடுத்துக்காட்டில், Controlled-:math:`CT` கேட் (:math:`CCT` சுருக்கமாக).

source: Conditined gates: the c_if method
tr_tr: Koşullu kapılar: c_if metodu

source: We want to apply the :math:`X` gate, only if both the results of the measurement of :math:`q_1` and :math:`q_2` are :math:`1`. We can do this using the c_if method, conditioning the application of :math:`X` depending on the value passed as argument to c_if.
tr_tr: Sadece :math:`q_1` ve :math:`q_2` ölçümünün sonuçları :math:`1` ise :math:`X` geçidini uygulamak istiyoruz. Bunu, c_if'e argüman olarak iletilen değere bağlı olarak :math:`X` uygulamasını koşullandırarak c_if yöntemini kullanarak yapabiliriz.

source: We will have to encode the value to pass to the c_if method such that it will check the values 011 and 111 (in binary representation), since it does not matter what is in the rightmost position.
tr_tr: c_if metoduna geçmek için değeri 011 ve 111 değerlerini (ikili gösterimde) kontrol edecek şekilde kodlamamız gerekecek, çünkü en sağda ne olduğu önemli değil.

source: Finally, we perform the measurenment of the auxiliary qubit in x-basis. So we will define a function to perform the x_measure and then apply it.
tr_tr: Son olarak yardımcı kübitin ölçümünü x bazında gerçekleştiriyoruz. Bu yüzden x_measure'ı gerçekleştirmek için bir fonksiyon tanımlayacağız ve sonra uygulayacağız.

source: Now we build the quantum circuit for the other remaining steps, in this example, only the second one. In these steps we have 4 sub-steps: the 3 sub-steps as in the first step and, in the middle, the additional step of the phase correction - initialization with reset - phase correction - application of the Control-\ :math:`U` gates - measure of the auxiliary qubit in x-basis
tr_tr: Şimdi kalan diğer adımlar için kuantum devresini oluşturuyoruz, bu örnek sadece ikincisi için. Bu adımlarda 4 alt adımımız var: ilk adımdaki gibi 3 alt adım ve ortada, faz düzeltmenin ek adımı - sıfırlama ile başlatma - faz düzeltme - Kontrol-\ :math:`U` kapılarının uygulanması - ölçü x bazında yardımcı kübitin ölçüsü

source: Application of the Control-\ :math:`U` gates and x-measurement (for step 2)
tr_tr: Kontrol-\ :math:`U` kapıları ve x-ölçümünün uygulanması (2. adım için)

source: We apply the :math:`CU` operations as we did in the first step. For the second step we have :math:`t=m-2`, hence :math:`2^t=1`. So we apply :math:`\text{CP}(\pi/2)` once. And then we perform the x-measurment of the qubit :math:`q_0`, storing the result, the phase bit :math:`\varphi_1`, in the bit :math:`c_1` of classical register.
tr_tr: İlk adımda yaptığımız gibi :math:`CU` işlemini uygularız. İkinci adımda :math:`2^t=1` olduğundan, bir kere :math:`\text{CP}(\pi/2)` uygularız ve sonra kübit :math:`q_0`ın x-ölçümünü gerçekleştiririz ardından sonucunda faz bitini :math:`\varphi_1` klasik kaydın bit :math:`c_1` içinde saklarız.

source: Now, we want to apply the IPE algorithm to estimate the phase for a 2-qubit gate :math:`U`. For this example, let’s consider the controlled version of the :math:`T` gate, i.e. the gate :math:`U=\textrm{Controlled-}T` (that from now we will express more complactly with :math:`CT`). Its matrix is
tr_tr: Şimdi, 2 kübitlik bir kapı :math:`U` için fazı tahmin etmek üzere IPE algoritmasını uygulamak istiyoruz. Bu örnek için, :math:`T` kapısının kontrollü versiyonunu, yani :math:`U=\textrm{Controlled-}T` kapısını (bundan sonra :math:`CT` ile daha derli toplu bir şekilde ifade edeceğiz) ele alalım. Onun matrisi

source: Let’s consider to estimate the phase :math:`\phi=\pi/4` for the eigenstate :math:`|11\rangle`, we should find :math:`\varphi=1/8`, since :math:`\phi = 2 \pi \varphi`. Therefore to estimate the phase we neeed exactly 3 classical bits, i.e. \ :math:`m=3`, since :math:`1/2^3=1/8`. So :math:`\varphi=0.\varphi_1\varphi_2\varphi_3`.
tr_tr: Özdurum :math:`|11\rangle` için :math:`\phi=\pi/4` aşamasını tahmin etmeye çalışalım, :math:`\varphi=1/8`i bulmalıyız, çünkü :math: `\phi = 2 \pi \varphi`. Bu nedenle, fazı tahmin etmek için tam olarak 3 klasik bite ihtiyacımız var, yani \ :math:`m=3`, çünkü :math:`1/2^3=1/8`.Yani :math:`\varphi=0.\varphi_1\varphi_2\varphi_3`.

source: We inizialize the auxiliary qubit and the other qubits with the eigenstate :math:`|11\rangle`.
tr_tr: Yardımcı kübite ve diğer kübitlere özdurum (eigenstate) :math:`|11\rangle` ile ilk değerini atıyoruz.

source: Finally, we perform the measurenment of the auxiliary qubit in x-basis. We can use the ``x_measurement`` function defined above in the example for 1-qubit gate. In this way we have obtained the phase bit :math:`\varphi_3` and stored it in the classical bit :math:`c_0`.
tr_tr: Son olarak yardımcı kübitin ölçümünü x bazında gerçekleştiriyoruz. 1-kübitlik geçit için örnekte yukarıda tanımlanan ``x_measurement`` fonksiyonunu kullanabiliriz. Bu şekilde :math:`\varphi_3` faz bitini elde ettik ve onu klasik :math:`c_0` bitinde sakladık.

source: We apply the :math:`CU` operations as we did in the first step. For the second step we have :math:`t=m-2`, hence :math:`2^t=2`. So we apply :math:`\text{MCP}(\pi/4)` :math:`2` times. And then we perform the x-measurment of the qubit :math:`q_0`, storing the phase bit :math:`\varphi_2` in the bit :math:`c_1`.
tr_tr: İlk adımda yaptığımız gibi :math:`CU` işlemlerini uygularız. İkinci adım için ise :math:`t=m-2` var, bundan dolayı :math:`2^t=2` olur. O zaman biz :math:`2` kere :math:`\text{MCP}(\pi/4)` uygularız. Onun ardından :math:`c_1` bitinde olan :math:`\varphi_2` faz bitini saklayan :math:`q_0` kübitin x-ölçülmesi gerçekleştiririz.

source: Let's make another example. Consider that we want to perform a bit flip on the third qubit after the measurements in the following circuit, when the results of the measurement of :math:`q_0` and :math:`q_1` are both :math:`1`.
pl: Kolejny przykład. Chcemy wykonać bit flip na trzecim kubicie po pomiarach w następującym obwodzie, kiedy wyniki pomiaru :math:` q_0 ` i :math:` q_1 ` wynoszą dla obu :math:` 1 `.

source: The motivation for using the IPE algorithm is that QPE algorithm works fine for short depth circuits but when the circuit starts to grow, it doesn't work properly due to gate noise and decoherence times.
pl: Uzasadnieniem dla stosowania algorytmu IPE jest to, że algorytm QPE działa poprawnie w przypadku krótkich obwodów głębokości, ale gdy obwód zaczyna rosnąć, nie działa poprawnie ze względu na szum bramy i czasy dekoherencji.

source: Let's apply the IPE algorithm to estimate the phase for :math:`S`-gate. Its matrix is
pl: Zastosujmy algorytm IPE, aby oszacować fazę dla :math:` S `-gate. Jej macierz to

source: Let's consider to estimate the phase :math:`\phi=\frac{\pi}{2}` for the eigenstate :math:`|1\rangle`, we should find :math:`\varphi=\frac{1}{4}` (where :math:`\phi = 2 \pi \varphi`). Therefore to estimate the phase we need exactly 2 phase bits, i.e. :math:`m=2`, since :math:`1/2^2=1/4`. So :math:`\varphi=0.\varphi_1\varphi_2`.
pl: Rozważmy oszacowanie fazy :math:`\phi=\frac{\pi}{2}` dla kąta ostrości :math:`|1\r`, powinniśmy znaleźć :math:`\varphi=\frac{1}{4}` (gdzie :math:`\phi = 2 \pi \varphi`). Dlatego, aby oszacować fazę, potrzebujemy dokładnie 2 bitów faz tj. :math:`m=2`, od :math:`1/2^2=1/4`. Zatem :math:`\varphi=0.\varphi_1\varphi_2`.

source: Let's apply :math:`2^t` times :math:`\text{CP}(\pi/2)`. Since for the first step :math:`t=m-1`, and :math:`m=2`, we have :math:`2^t=2`.
pl: Zastosujmy :math:` 2 ^ t ` razy :math:`\text{CP}(\pi/2) `. Ponieważ dla pierwszego kroku :math:` t=m-1 `, oraz :math:` m=2 `, mamy :math:` 2 ^ t=2 `.

source: As seen in the theory, in order to extract the phase bit :math:`\varphi_{1}`, we perform a phase correction of :math:`-\pi\varphi_2/2`. Of course, we need to apply the phase correction in the circuit only if the phase bit :math:`\varphi_2=1`, i.e. we have to apply the phase correction of :math:`-\pi/2` only if the classical bit :math:`c_0` is 1.
pl: Jak widać w teorii, w celu wyodrębnienia bitu fazowego :math:` \varphi_{1}`, wykonujemy korektę fazową :math:`-\pi\varphi_2/2 `. Oczywiście, musimy zastosować korektę fazową w obwodzie tylko wtedy, gdy bit fazowy :math:` \varphi_2 = 1 `, czyli musimy zastosować poprawkę fazową :math:`-\pi/2 ` tylko wtedy, gdy klasyczny bit :math:` c_0 ` wynosi 1.

source: Now, we want to apply the IPE algorithm to estimate the phase for a 2-qubit gate :math:`U`. For this example, let's consider the controlled version of the :math:`T` gate, i.e. the gate :math:`U=\textrm{Controlled-}T` (that from now we will express more compactly with :math:`CT`). Its matrix is
pl: Teraz chcemy zastosować algorytm IPE, aby oszacować fazę dla dwukubitowej bramy :math:`U`. Dla tego przykładu rozważmy kontrolowaną wersję bramki `T` :math:, tzn. bramę :math:`U=\tekstrm{Controlled-}T` (od teraz będziemy nazywać ją :math:`CT`). Jej macierz to

source: Let's consider to estimate the phase :math:`\phi=\pi/4` for the eigenstate :math:`|11\rangle`, we should find :math:`\varphi=1/8`, since :math:`\phi = 2 \pi \varphi`. Therefore to estimate the phase we need exactly 3 classical bits, i.e. :math:`m=3`, since :math:`1/2^3=1/8`. So :math:`\varphi=0.\varphi_1\varphi_2\varphi_3`.
pl: Rozważmy oszacowanie fazy :math:`\phi=\pi/4` dla kąta ostrości :math:`|11\rangle`, powinniśmy znaleźć :math:`\varphi=1/8` (gdzie :math:`\phi = 2 \pi \varphi`). Dlatego, aby oszacować fazę, potrzebujemy dokładnie 3 klasycznych bitów, tj. :math:`m=3` (gdzie :math:`1/2^3=1/8`). Zatem :math:`\varphi=0.\varphi_1\varphi_2\varphi_3`.

source: IPE
bn_bn: আইপিই
