Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/textbook/01_IQPE.po
Languages: bn_bn, es_un, fr, ko, pl, pt_un, ta, tr_tr

source: The detailed explanation of how the algorithm works can be found in `Iterative Phase Estimation (IPE) Algorithm <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__. To understand QPE in depth, you can see also `Ch.3.6 Quantum Phase Estimation <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__.
bn_bn: ধারাক্রম (অ্যালগরিদম) কিভাবে কাজ করে বিস্তারিত জানতে `ইটারেটিভ ফেজ এস্টিমেশন (আইপিই) ধারাক্রম (অ্যালগরিদম) <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__ দেখো। কিউপিই ব্যাপারে জানতে `অধ্যায় ৩.৬ কোয়ান্টাম ফেজ এস্টিমেশন <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__ দেখো।
es_un: La explicación detallada de cómo funciona el algoritmo se puede encontrar en `Algoritmo de Estimación de Fase Iterativa (IPE) <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__. Para comprender la QPE en profundidad, puedes consultar también `Ch.3.6 Estimación de Fase Cuántica <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__.
fr: L'explication détaillée du fonctionnement de l'algorithme peut être trouvée dans l'algorithme `Iterative Phase Estimation (IPE) Algorithm <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__. Pour comprendre QPE en profondeur, vous pouvez également voir `Ch.3.6 Quantum Phase Estimation <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__.
ko: 알고리즘이 어떻게 동작하는지에 대한 자세한 설명은 `Iterative Phase Estimation (IPE, 반복 위상 추정) 알고리즘 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__ 에서 찾을 수 있다. QPE를 심도 있게 이해하려면 `Ch.3.6 Quantum Phase Estimation (양자 위상 추정) <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__ 에서 볼 수 있다.
pl: Szczegółowe wyjaśnienie, w jaki sposób działa algorytm, można znaleźć w ` Iterative Phase Estimation (IPE) Algorithm <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>` __. Aby zrozumieć QPE in depth, można zobaczyć również ` Ch. 3.6 Quantum phase estimation <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>` __.
pt_un: A explicação detalhada de como o algoritmo funciona pode ser encontrada em `Algoritmo de Estimativa de Fase Iterativa (IPE) <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>` __. Para entender o QPE em profundidade, você pode ver também `Ch.3.6 Estimativa de Fase Quântica <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>` __.
ta: வழிமுறை எவ்வாறு செயல்படுகிறது என்பதற்கான விரிவான விளக்கத்தை `Iterative Phase Estimation (IPE) Algorithm <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__. QPE ஐ ஆழமாக புரிந்து கொள்ள, நீங்கள் `Ch.3.6 Quantum Phase Estimation <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__ காணலாம்.
tr_tr: Algoritmanın nasıl çalıştığına ilişkin ayrıntılı açıklama, `Iterative Phase Estimation (IPE) Algorithm <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__. QPE'yi derinlemesine anlamak için, ayrıca `Ch.3.6 Quantum Phase Estimation <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__ bölümünü de inceleyebilirsiniz.

source: IPE example with a 1-qubit gate for :math:`U`
bn_bn: :math:`U` -এর জন্য ১-কিউবিট গেইট সম্পন্ন আইপিই এর উদাহরণ
es_un: Ejemplo de IPE con una compuerta de 1 qubit para :math:`U`
fr: Exemple d'IPE avec un portail 1-qubit pour :math:` U `
ko: :math:`U` 에 대한 1-큐비트 게이트의 IPE 예제
pl: Przykład IPE z 1-kubitową bramą dla :math:`U`
pt_un: Exemplo do IPE com uma porta de 1 qubit para :math:`U`
ta: இதற்கான 1-க்யூபிட் கேட்டுடன் IPE எடுத்துக்காட்டு :math:`U`
tr_tr: :math:`U` için 1 kübit kapılı IPE örneği

source: We want to apply the IPE algorithm to estimate the phase for a 1-qubit operator :math:`U`. For example, here we use the :math:`S`-gate.
bn_bn: আমরা আইপিই অ্যালগরিদম প্রয়োগ করে ১-কিউবিট অপারেটরের :math:`U` দশা অনুমান করব। উদাহরণরূপে এখানে আমরা :math:`S` -গেট ব্যবহার করব।
es_un: Queremos aplicar el algoritmo IPE para estimar la fase de un operador :math:`U` de 1 qubit. Por ejemplo, aquí usamos la compuerta :math:`S`.
fr: Nous voulons appliquer l'algorithme IPE pour estimer la phase pour un opérateur 1-qubit :math:` U `. Par exemple, nous utilisons ici la porte :math:` S'.
ko: 1-큐비트 연산자 :math:`U` 의 위상을 추정하고자 IPE 알고리즘을 적용하고자 한다. 예를 들어, 여기서는 :math:`S`-게이트를 사용한다.
pl: Chcemy zastosować algorytm IPE, aby oszacować fazę dla operatora 1-kubitowego :math:`U`. Na przykład tutaj używamy :math:`S`-gate.
pt_un: Queremos aplicar o algoritmo IPE para estimar a fase para um operador de 1-qubit :math:` U `. Por exemplo, aqui utilizamos a porta :math:`S`.
ta: 1-க்யூபிட் ஆபரேட்டருக்கான கட்டத்தை மதிப்பிடுவதற்கு IPE வழிமுறையைப் பயன்படுத்த விரும்புகிறோம் :math:`U`. எடுத்துக்காட்டாக, இங்கே நாம் :math:`S`-கேட் பயன்படுத்துகிறோம்.
tr_tr: 1 kübitlik bir operatör :math:`U` için faz aşamasını tahmin etmek üzere IPE algoritmasını uygulamak istiyoruz. Örneğin, burada :math:`S`-kapısını kullanıyoruz.

source: Let’s apply the IPE algorithm to estimate the phase for :math:`S`-gate. Its matrix is
es_un: Apliquemos el algoritmo IPE para estimar la fase de la compuerta :math:`S`. Su matriz es
pt_un: Apliquemos o algoritmo IPE para estimar a fase para a porta :math:` S `. Sua matriz é
ta: இதற்கான கட்டத்தை மதிப்பிடுவதற்கு IPE வழிமுறையைப் பயன்படுத்துவோம் :math:`S`-கேட். அதன் அணி
tr_tr: :math:`S`-geçiş fazını tahmin etmek için IPE algoritmasını uygulayalım. Onun matrisi

source: That is, the :math:`S`-gate adds a phase :math:`\pi/2` to the state :math:`|1\rangle`, leaving unchanged the phase of the state :math:`|0\rangle`
bn_bn: অর্থাৎ :math:`|0\rangle অবস্থার দশা অপরিবর্তিত রেখে :math:`S`- গেট, :math:`|1\rangle` অবস্থায় :math:`\pi/2` দশা যোগ করা হল।
es_un: Es decir, la compuerta :math:`S` agrega una fase de :math:`\pi/2` al estado :math:`|1\rangle`, dejando sin cambios a la fase del estado :math:`|0\rangle`
fr: C'est-à-dire que la porte :math:` S ajoute une phase :math:` \pi/2 ` à l'état :math:` | 1\rangle `, laissant inchangée la phase de l'état :math:` | 0\rangle `
ko: 이 말은 :math:`S`-게이트는 :math:`|1\rangle` 상태에 위상 :math:`\pi/2` 을 더하고, :math:`|0\rangle` 상태의 위상은 변화시키지 않는다
pl: Oznacza to, że :math:` S `-gate dodaje fazę :math:` \pi/2 ` do stanu :math:` | 1\rkąt `, pozostawiając niezmienioną fazę stanu :math:` | 0\rkąt `
pt_un: Ou seja, a porta :math:`S` adiciona uma fase :math:`\pi/2` ao estado :math:`|1\rangle`, deixando inalterada a fase do estado :math:`|0\rangle`
ta: அதாவது, :math:`S`-கேட் ஒரு கட்டத்தை சேர்க்கிறது :math:`\pi/2` நிலைக்கு :math:`|1\rangle`, நிலையின் கட்டத்தை மாற்றாமல் விட்டுவிடுகிறது :math:`|0\rangle`
tr_tr: Yani, :math:`S` geçiti, :math:`\pi/2` durumuna bir faz ekler ve :math:`|1\rangle` durumunun fazını değiştirmeden bırakır :math:`|0 \rangle`

source: In the following, we will use the notation and terms used in `Section 2 of lab 4 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__.
bn_bn: নিচে আমরা `Section 2 of lab 4 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>` __ এর নামকরণ ও পদ ব্যবহার করব।
es_un: En lo siguiente, utilizaremos la notación y los términos utilizados en la `Sección 2 del laboratorio 4 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__.
fr: Dans ce qui suit, nous utiliserons la notation et les termes utilisés dans la section 2 du lab 4 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>` __.
ko: 다음부터는 `랩 4의 2절 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__ 의 표기 및 용법을 사용한다.
pl: Poniżej użyjemy adnotacji i terminów używanych w `Sekcja 2 laboratorium 4 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__.
pt_un: No seguinte, utilizaremos a notação e os termos utilizados na `Seção 2 do laboratório 4 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>` __.
ta: பின்வருவனவற்றில், `Section 2 of lab 4 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__ இல் பயன்படுத்தப்படும் குறியீடு மற்றும் சொற்களைப் பயன்படுத்துவோம்.
tr_tr: Aşağıda, `Section 2 of lab 4 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__ kullanılan gösterim ve terimleri kullanacağız.

source: Let’s consider to estimate the phase :math:`\phi=\frac{\pi}{2}` for the eigenstate :math:`|1\rangle`, we should find :math:`\varphi=\frac{1}{4}` (where :math:`\phi = 2 \pi \varphi`). Therefore to estimate the phase we need exactly 2 phase bits, i.e. \ :math:`m=2`, since :math:`1/2^2=1/4`. So :math:`\varphi=0.\varphi_1\varphi_2`.
es_un: Consideremos estimar la fase :math:`\phi=\frac{\pi}{2}` para el estado propio :math:`|1\rangle`, deberíamos encontrar :math:`\varphi=\frac{1}{4}` (donde :math:`\phi = 2 \pi \varphi`). Por lo tanto, para estimar la fase necesitamos exactamente 2 bits de fase, es decir, \ :math:`m=2`, ya que :math:`1/2^2=1/4`. Entonces :math:`\varphi=0.\varphi_1\varphi_2`.

source: Remember from the theory that for the IPE algorithm, :math:`m` is also the number of iterations, so we need only :math:`2` iterations or steps.
bn_bn: আইপিই অ্যালগরিদম এর থেকে মনে থাকবে, :math:`m` হলো পুনরাবৃত্তির সংখ্যা, অর্থাৎ আমাদের :math:`2` বার পুনরাবৃত্তি করতে হবে।
es_un: Recuerda de la teoría que para el algoritmo IPE, :math:`m` es también el número de iteraciones, por lo que solo necesitamos :math:`2` iteraciones o pasos.
fr: Rappelez-vous de la théorie selon laquelle pour l'algorithme IPE, :math:`m` est aussi le nombre d'itérations, donc nous n'avons besoin que de :math:`2` itérations ou étapes.
ko: IPE 알고리즘에서 :math:`m` 은 반복 횟수이기도 한 점을 기억하라. 따라서 :math:`2` 번의 반복 또는 단계가 필요하다.
pl: Pamiętaj z teorii dla algorytmu IPE, :math:`m` jest również liczbą iteracji, więc potrzebujemy tylko :math:`2` iteracji lub kroków.
pt_un: Lembre-se da teoria de que para o algoritmo IPE, :math:`m` é também o número de iterações, portanto, precisamos de apenas :math:`2` iterações ou etapas.
ta: கோட்பாட்டிலிருந்து IPE வழிமுறைக்கு, :math:`m` என்பது மறு செய்கைகளின் எண்ணிக்கையாகும், எனவே நமக்குத் தேவை :math:`2` மறு செய்கைகள் அல்லது படிகள்.
tr_tr: Teoriden hatırlayın ki, IPE algoritması için :math:`m` aynı zamanda yinelemelerin sayısıdır, bu nedenle yalnızca :math:`2` yinelemelere veya adımlara ihtiyacımız var.

source: First, we initialize the circuit. IPE works with only 1 auxiliary qubit, instead of :math:`m` counting qubits of the QPE algorithm. Therefore, we need 2 qubits, 1 auxiliary qubit and 1 for the eigenstate of :math:`U`-gate, and a classical register of 2 bits, for the phase bits :math:`\varphi_1`, :math:`\varphi_2`.
bn_bn: প্রথমে আমরা সার্কিট চালু করব। আইপিই কেবল একটা সহায়ক কিউবিট নিয়ে কাজ করে, যেখানে কিউপিই অ্যালগরিদম :math:`m` গুলো গণনাকারী কিউবিট ব্যবহার করে। সেজন্য আমাদের ২টি কিউবিট, ১ টা সহায়ক কিউবিট, :math:`U` -গেটের আইজেনস্টেটের জন্য ১ টা কিউবিট এবং ২ বিটের একটা ক্লাসিক্যাল রেজিস্টার (দশা বিট :math:`\varphi_1`, :math:`\varphi_2` -এর জন্য) লাগবে।
es_un: Primero, inicializamos el circuito. IPE trabaja con solo 1 qubit auxiliar, en lugar de :math:`m` qubits contados del algoritmo QPE. Por lo tanto, necesitamos 2 qubits, 1 qubit auxiliar y 1 para el estado propio de la compuerta :math:`U`, y un registro clásico de 2 bits, para los bits de fase :math:`\varphi_1`, :math:`\varphi_2`.
fr: Tout d'abord, nous initialisons le circuit. IPE fonctionne avec seulement 1 qubit auxiliaire, au lieu de :math:`m` comptant des qubits de l'algorithme QPE. Nous avons donc besoin de 2 qubits, 1 qubit auxiliaire et 1 pour l'état propre de :math:`U`-gate, et un registre classique de 2 bits, pour les bits de phase :math:`\varphi_1`, :math:`\varphi_2`.
ko: 먼저 회로를 초기화한다. IPE는 QPE 알고리즘에서 :math:`m` 개의 카운팅 큐비트 (counting qubit) 대신, 1개의 보조 큐비트로 동작한다. 그러므로 1개의 보조 큐비트와 1개의 :math:`U`-게이트의 고유 상태인 총 2개의 큐비트와 위상 비트 :math:`\varphi_1`, :math:`\varphi_2` 를 위한 고전 레지스터 2 비트가 필요하다.
pl: Po pierwsze, inicjujemy obwód. IPE pracuje tylko z 1 pomocniczym kubitem, zamiast :math:`m` liczenia kubitów algorytmu QPE. Dlatego potrzebujemy 2 kubitów, 1 dodatkowego kubitu i 1 dla stanu własnego z :math:` U `-gate, oraz klasycznego rejestru 2 bitów, dla bitó fazowych :math:`\varphi_1 `, :math:`\varphi_2`.
pt_un: Primeiro, inicializamos o circuito. O IPE trabalha com apenas 1 qubit auxiliar, em vez de :math:`m` qubits de contagem do algoritmo QPE. Por isso, precisamos de 2 qubits, 1 qubit auxiliar e 1 para o autoestado da porta :math:`U`, e um registrador clássico de 2 bits, para os bits de fase :math:`\varphi_1`, :math:`\varphi_2`.
ta: முதலில், நாம் சுற்று ஆரம்பிக்கிறோம். :math:`m` QPE வழிமுறைகளின் எண்ணிக்கையை கணக்கிடுவதற்குப் பதிலாக, 1 துணை க்யூபிட் உடன் மட்டுமே IPE வேலை செய்கிறது.எனவே, எங்களுக்கு 2 க்யூபிட்ஸ், 1 துணை க்யூபிட் மற்றும் 1 ஐஜென்ஸ்டேட்: :math:`U`-கேட் மற்றும் 2 பிட்களின் கிளாசிக்கல் பதிவு, கட்ட பிட்களுக்கு :math:`\varphi_1`, :math:`\varphi_2`.
tr_tr: İlk olarak devreyi başlatıyoruz. IPE, QPE algoritmasının :math:`m` kübitlerini saymak yerine yalnızca 1 yardımcı kübit ile çalışır. Bu nedenle, :math:`U`-kapısının öz durumu için 2 kübit, 1 yardımcı kübit ve 1'e ve faz bitleri :math:`\varphi_1`, :math:`\ için 2 bitlik klasik bir kayda ihtiyacımız var.

source: First step
bn_bn: প্রথম ধাপ
es_un: Primer paso
fr: Première étape
ko: 첫 번째 단계
pl: Pierwszy krok
pt_un: Primeiro passo
ta: முதல் படி
tr_tr: Birinci Adım

source: Now we build the quantum circuit for the first step, that is, the first iteration of the algorithm, to estimate the least significant phase bit :math:`\varphi_m`, in this case :math:`\varphi_2`. For the first step we have 3 sub-steps: - initialization - application of the Controlled-\ :math:`U` gates - measure of the auxiliary qubit in x-basis
es_un: Ahora construimos el circuito cuántico para el primer paso, es decir, la primera iteración del algoritmo, para estimar el bit de fase menos significativo :math:`\varphi_m`, en este caso :math:`\varphi_2`. Para el primer paso tenemos 3 subpasos: - inicialización - aplicación de las compuertas Controladas-\ :math:`U` - medición del qubit auxiliar en la base x
tr_tr: Şimdi, en az anlamlı faz bitini tahmin etmek için ilk adım, yani algoritmanın ilk yinelemesi için kuantum devresini oluşturuyoruz :math:`\varphi_m`, bu durumda :math:`\varphi_2` İlk adım için 3 alt adımımız var: - başlatma - Kontrollü-\ :math:`U` kapılarının uygulanması - x bazında yardımcı kübitin ölçümü

source: Initialization
bn_bn: আরম্ভ
es_un: Inicialización
fr: Initialisation
ko: 초기화
pl: Inicjalizacja
pt_un: Inicialização
ta: துவக்கம்
tr_tr: Başlatma

source: The initialization consists of application the Hadamard gate to the auxiliary qubit and the preparation of the eigenstate :math:`|1\rangle`.
bn_bn: আরম্ভের জন্য আমরা আইজেনস্টেট :math:`|1\rangle` -এর প্রস্তুতি ও সহায়ক কিউবিটে হ্যাডামার্ড যুক্তিবর্তনী প্রয়োগ করতে পারি ।
es_un: La inicialización consiste en la aplicación de la compuerta Hadamard al qubit auxiliar y la preparación del estado propio :math:`|1\rangle`.
fr: L'initialisation consiste à appliquer la porte Hadamard au qubit auxiliaire et à préparer l'eigenstate :math:` | 1\rangle `.
ko: 초기화는 Hadamard 게이트를 보조 큐비트에 적용하는 것과 고유 상태 :math:`|1\rangle` 를 준비하는 것으로 구성되어 있다.
pl: Inicjalizacja polega na zastosowaniu bramy Hadamard do kubitu pomocniczego i przygotowania się do stanu własnego :math:` | 1\rangle `.
pt_un: A inicialização consiste da aplicação da porta Hadamard no qubit auxiliar e da preparação do autoestado :math:`|1\rangle`.
ta: துவக்கத்தில் ஹடாமார்ட் கேட் துணை க்யூபிட் மற்றும் ஐஜென்ஸ்டேட் :math:`|1\rangle` தயாரிப்பை உள்ளடக்கியது.
tr_tr: Başlatma, Hadamard kapısının yardımcı kübite uygulanmasından ve özdurumun (eigenstate) :math:`|1\rangle` hazırlanmasından oluşur.

source: Application of the Controlled-\ :math:`U` gates
es_un: Aplicación de las compuertas Controladas-\ :math:`U`
tr_tr: Kontrollü-\ :math:`U` geçişlerinin uygulanması

source: Then we have to apply :math:`2^t` times the Controlled-\ :math:`U` operators (see also in the docs `Two qubit gates <https://qiskit.org/documentation/tutorials/circuits/3_summary_of_quantum_operations.html#Two-qubit-gates>`__), that, in this example, is the Controlled-\ :math:`S` gate (:math:`CS` for short).
es_un: Luego tenemos que aplicar :math:`2^t` veces los operadores Controlados-\ :math:`U` (ver también en la documentación `Compuertas de dos qubits <https://qiskit.org/documentation/tutorials/circuits/3_summary_of_quantum_operations.html#Two-qubit-gates>`__), que, en este ejemplo, es la compuerta Controlada-\ :math:`S` (:math:`CS` para abreviar).
tr_tr: Sonra, :math:`2^t` kere -\ :math:`U` kontrollü operatörleri çarparak uygulamalıyız (`Two qubit gates <https://qiskit.org/documentation/tutorials/circuits/3_summary_of_quantum_operations.html#Two-qubit-gates>`__ 'e bakınız) ki, bu örnekte, kontrollü -\ :math:`S` (kısaca :math:`CS`) geçididir.

source: To implement :math:`CS` in the circuit, since :math:`S` is a phase gate, we can use the controlled phase gate :math:`\text{CP}(\theta)`, with :math:`\theta=\pi/2`.
bn_bn: সার্কিট :math:`CS` বাস্তবায়নের জন্য আমরা :math:`\theta=\pi/2` -এর সাথে নিয়ন্ত্রিত দশা গেইট :math:`\text{CP}(\theta)` ব্যবহার করতে পারি, যেহেতু :math:`S` একটা দশা গেট।
es_un: Para implementar :math:`CS` en el circuito, ya que :math:`S` es una compuerta de fase, podemos usar la compuerta de fase controlada :math:`\text{CP}(\theta)`, con :math:`\theta=\pi/2`.
fr: Pour implémenter :math:` CS ` dans le circuit, puisque :math:` S ` est une porte de phase, nous pouvons utiliser la porte de phase contrôlée :math:`\text{CP}(\theta) `, avec :math:`\theta = \pi/2 `.
ko: :math:`CS` 를 회로에 구현하기 위해선, :math:`S` 가 위상 게이트이므로 제어 위상 게이트 :math:`\text{CP}(\theta)` 의 :math:`\theta=\pi/2` 인 경우를 사용할 수 있다.
pl: Aby zaimplementować :math:`CS` w obwodzie, gdyż :math:`S` jest bramą fazową, możemy użyć kontrolowanej bramki fazy :math:`\text{CP}(\theta)`, z :math:`\theta=\pi/2`.
pt_un: Para implementar :math:`CS` no circuito, já que :math:`S` é um porta de fase, podemos usar a porta de fase controlada :math:`\text{CP}(\theta)`, com :math:`\theta=\pi/2`.
ta: :math:`CS` சுற்றில் செயல்படுத்த, :math:`S` ஒரு கட்ட கேட் என்பதால், கட்டுப்படுத்தப்பட்ட கட்ட கேட்டைப் பயன்படுத்தலாம் :math:`\text{CP}(\theta)`, உடன் :math:`\theta=\pi/2`.
tr_tr: Devrede :math:`CS` uygulamak için, :math:`S` bir faz geçiti olduğundan, kontrollü faz geçiti :math:`\text{CP}(\theta)` kullanabiliriz, :math: `\theta=\pi/2`.

source: Let’s apply :math:`2^t` times :math:`\text{CP}(\pi/2)`. Since for the first step :math:`t=m-1`, and :math:`m=2`, we have :math:`2^t=2`.
es_un: Apliquemos :math:`2^t` veces :math:`\text{CP}(\pi/2)`. Dado que para el primer paso :math:`t=m-1`, y :math:`m=2`, tenemos :math:`2^t=2`.
pt_un: Apliquemos :math:`2^t` vezes :math:`\text{CP}(\pi/2)`. Dado que para o primeiro passo :math:`t=m-1`, e :math:`m=2`, temos :math:`2^t=2`.
ta: :math:`2^t` முறை :math:`\text{CP}(\pi/2)` என்று பயன்படுத்தலாம்.முதல் படி :math:`t=m-1`, மற்றும் :math:`m=2`, எங்களிடம் உள்ளது :math:`2^t=2`.
tr_tr: :math:`2^t` kere :math:`\text{CP}(\pi/2)` uygulayalım. İlk adım için :math:`t=m-1` ve :math:`m=2` olduğundan, elimizde :math:`2^t=2` var.

source: Measure in x-basis
bn_bn: x -ভিত্তিতে পরিমাপ
es_un: Medición en la base x
fr: Mesure dans la base : math:`x`
ko: x 기저로 측정
pl: Środek w x-podstawie
pt_un: Medição na base x
ta: X- அடிப்படையில் அளவிடவும்
tr_tr: X-Bazında Ölçüm

source: Finally, we perform the measurement of the auxiliary qubit in x-basis. So we will define a function to perform the x_measure and then apply it.
bn_bn: অবশেষে আমরা সহায়ক কিউবিট - এর ওপর এক্স বেসিসে পরিমাপ করি। তাই এক্স পরিমাপ করার জন্য আমরা একটি ফাংশান গঠন করব এবং তারপর সেটি প্রয়োগ করব।
es_un: Finalmente, realizamos la medición del qubit auxiliar en la base x. Así que definiremos una función para realizar la x_measure y luego la aplicaremos.
fr: Finalement, nous effectuons la mesure du qubit auxiliaire dans la base : math:`X`. Nous allons donc définir une fonction pour effectuer la mesure-: math:`X`, puis l'appliquer.
ko: 마지막으로, 보조 큐비트를 x 기저에서 측정한다. 따라서 x_measure를 수행하는 함수를 정의하고 적용한다.
pl: Na koniec wykonujemy pomiar kubitu pomocniczego w x-bazie. Zdefiniujemy więc funkcję, która będzie wykonywała x_measure, a następnie zastosuje ją.
pt_un: Finalmente, procedemos com a medição do qubit auxiliar na base-x. Então definiremos uma função para realizar a medida_x e então aplicá-la.
ta: இறுதியாக, துணை குவிட்டின் அளவீட்டை x-அடிப்படையில் செய்கிறோம். எனவே x_measure ஐச் செயல்படுத்த ஒரு செயல்பாட்டை வரையறுப்போம், பின்னர் அதைப் பயன்படுத்துவோம்.

source: In this way we obtain the phase bit :math:`\varphi_2` and store it in the classical bit :math:`c_0`.
bn_bn: এভাবে আমরা দশা বিট :math:`\varphi_2` পাই এবং সেটা ক্লাসিক্যাল বিট :math:`c_0` -এ সঞ্চয় করি।
es_un: De esta forma obtenemos el bit de fase :math:`\varphi_2` y lo almacenamos en el bit clásico :math:`c_0`.
fr: De cette façon, nous obtenons le bit de phase :math:`\varphi_2` et le stockons dans le bit classique :math:`c_0`.
ko: 이 방법으로 위상 비트 :math:`\varphi_2` 를 얻고 이를 고전 비트 :math:`c_0` 에 저장할 수 있다.
pl: W ten sposób uzyskujemy bit fazowy :math:` \varphi_2 ` i przechowujemy go w klasycznym bicie :math:` c_0 `.
pt_un: Desta forma obtemos o bit de fase :math:`\varphi_2` e o armazenamos no bit clássico :math:`c_0`.
ta: இந்த வழியில் நாம் கட்டம் பிட் :math:`\varphi_2` மற்றும் கிளாசிக்கல் பிட் :math:`c_0` இல் சேமிக்கிறோம்.
tr_tr: Bu şekilde :math:`\varphi_2` faz bitini elde ederiz ve onu klasik bit :math:`c_0` içinde saklarız.

source: Subsequent steps (2nd step)
bn_bn: পরবর্তী ধাপসমূহ (২য় ধাপ)
es_un: Pasos posteriores (segundo paso)
fr: Étapes suivantes (2ème étape)
ko: 다음 단계(2번째 단계)
pl: Kolejne kroki (drugi krok)
pt_un: Passos subsequentes (2° passo)
ta: அடுத்தடுத்த படிகள் (2 வது படி)
tr_tr: Sonraki adımlar (2. adım)

source: Now we build the quantum circuit for the other remaining steps, in this example, only the second one. In these steps we have 4 sub-steps: the 3 sub-steps as in the first step and, in the middle, the additional step of the phase correction - initialization with reset - phase correction - application of the Controlled-\ :math:`U` gates - measure of the auxiliary qubit in x-basis
es_un: Ahora construimos el circuito cuántico para los otros pasos restantes, en este ejemplo, solo el segundo. En estos pasos tenemos 4 subpasos: los 3 subpasos como en el primer paso y, en medio, el paso adicional de la corrección de fase - inicialización con restablecimiento - corrección de fase - aplicación de la compuerta :math:`U` Controlada - medición del qubit auxiliar en la base x

source: Initialization with reset
bn_bn: রিসেট দিয়ে আরম্ভ
es_un: Inicialización con restablecimiento
fr: Initialisation avec réinitialisation
ko: 재설정을 통한 초기화
pl: Inicjowanie z resetowaniem
pt_un: Inicialização com reset
ta: மீட்டமைப்புடன் துவக்கம்
tr_tr: İlk Duruma Getirerek (Sıfırlayarak) Başlatma
