Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/1_hamiltonian_and_gate_characterization.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: This looks for a rotation error in the CX gate, i.e. if the gate is actually :math:`CR_x(\pi/2+\delta)` measure :math:`\delta`. This is very similar to the single qubit amplitude error calibration except we need to specify a control qubit (which is set to be in state :math:`|1\rangle`) and the rotation is :math:`\pi`.
bn_bn: এটি CX সার্কিট বরাবর ঘূর্ণন ত্রুটি খুঁজে বের করে, যেমন যদি সত্যিই :math:`CR_x(\pi/2+\delta)` measure :math:`\delta`। এটা একক কিউবিট এর বিস্তার ত্রুটি ক্রমাঙ্কণের সাথে খুবই সাদৃশ্যপূর্ণ , শুধু এটুকু পার্থক্য যে এখানে আমাদের একটি নিয়ন্ত্রন কিউবিটকে ( যেটাকে :math:`|1\rangle` অবস্থায় রাখা হয় ) নির্দিষ্ট করে দিতে হয় এবং তার ঘূর্ণন হয় :math:`\pi`।
es_un: Esto busca un error de rotación en la compuerta CX, es decir, si la compuerta sí es :math:`CR_x(\pi/2+\delta)`, mide :math:`\delta`. Esto es muy similar a la calibración de errores de amplitud para un solo qubit, excepto que es necesario especificar un qubit que actúe como control (que va a ser configurado al estado :math:`|1\rangle`) y la rotación es :math:`\pi`.
fr_fr: Cela cherche une erreur de rotation dans la porte CX, c'est-à-dire si la porte est en fait :math:`CR_x(\pi/2+\delta)` on mesure :math:`\delta`. Ceci est très similaire à l'étalonnage de l'erreur d'amplitude de qubit-unique sauf que nous avons besoin de spécifier un qubit de contrôle (qui est défini pour être dans l'état :math:`|1\rangle`) et la rotation est :math:`\pi`.
id_id: Hal ini mencari kesalahan rotasi pada gerbang CX, i.e. jika gerbang sebenarnya adalah :math:`CR_x (\pi/2 + \delta)` mengukur :math:`\delta`. Hal ini sangat mirip dengan kalibrasi error amplitudo qubit tunggal kecuali kita perlu menentukan sebuah qubit kontrol (yang diatur berada dalam keadaan :math:` | 1\rangle`) dan rotasi adalah :math:`\pi`.
ru_ru: Следующий код ищет ошибку вращения в вентиле CX, т.е. вентиль на самом деле :math:`CR_x(\pi/2+\delta)` и в коде измеряется :math:`\delta`. Это очень похоже на калибровку ошибки амплитуды для одного кубита, за исключением того, что нам нужно указать контрольный бит (который установлен в состояние :math:`|1\rangle`) и вращение :math:`\pi`.
ta_in: இது CX கேட்டில் ஒரு சுழற்சி பிழையைத் தேடுகிறது, அதாவது கேட் உண்மையில் :math:`CR_x(\pi/2+\delta)` ஆகா இருந்தால், அளவீடு :math:`\delta` இருக்கும். இது ஒரு கட்டுப்பாட்டு கியூபிட்டை குறிப்பிட வேண்டும் (இது :math:`|1\rangle` நிலையில் அமைக்கப்பட்டுள்ளது) மற்றும் சுழற்சி :math:`\pi` என்பதைக் குறிப்பிட வேண்டும், தவிர இது ஒற்றை கியூபிட் அலைவீச்சு பிழை அளவுத்திருத்தத்திற்கு மிகவும் ஒத்திருக்கிறது.
tr_tr: Bu CX geçidinde bir rotasyon hatası için arar, örneğin, Eğer kapı :math:`CR_x(\pi/2+\delta)` ise :math:`\delta` ölçer. Bu, tek kübit genlik hata kalibrasyonuna çok benzer, ancak bir kontrol kübiti belirtmemiz gerekir (ki bu :math:`|1\rangle` durumunda olacak şekilde ayarlanmıştır) ve rotasyon :math:`\pi`dir.
zh_tw: 這會在 CX 閘中尋找旋轉錯誤，也就是說，如果此閘實際上是 :math:`CR_x(\pi/2+\delta)`測量 :math:`\delta`。 這與單量子位元振幅誤差校準非常相似，除了我們需要指定一個控制量子位元（其被設定處於量子態 :math:`|1\rangle`）之外，且其旋轉則為 :math:`\pi`。

source: The gate sequence to calibrate the amplitude of the CX gate on Q0-Q1 and Q2-Q3 in parallel:
bn_bn: সমান্তরালে Q0-Q1 এবং Q2-Q3 এর উপর CX সার্কিটের বিস্তারের ক্রমাঙ্কনের বর্তনী ধারা:
es_un: La secuencia de compuertas para calibrar la amplitud de la compuerta CX en Q0-Q1 y Q2-Q3 en paralelo es:
fr_fr: La séquence de porte pour calibrer l'amplitude de la porte CX sur Q0-Q1 et Q2-Q3 en parallèle :
id_id: Urutan gerbang untuk mengkalibrasi amplitudo dari gerbang CX pada Q0-Q1 dan Q2-Q3 secara paralel:
it_it: La sequenza di gate che serve a calibrare l'ampiezza del gate CX in parallelo su Q0-Q1 e Q2-Q3:
ja_jp: Q0-Q1 および Q2-Q3 上の CX ゲートの振幅を並列に較正するゲート・シーケンス :
ko_kr: Q0-Q1 및 Q2-Q3의 CX 게이트 진폭을 동시에 보정하는 게이트 조합:
pt_br: A sequência de portas para calibrar a amplitude da porta CX em Q0-Q1 e Q2-Q3, em paralelo:
ru_ru: Последовательность операций для калибровки амплитуды вентиля CX параллельно на Q0-Q1 и Q2-Q3:
ta_in: Q0-Q1 மற்றும் Q2-Q3 இல் CX கேட்டின் வீச்சுக்கு இணையாக அளவீடு செய்வதற்கான கேட் வரிசை:
tr_tr: Q0-Q1 ve Q2-Q3'teki CX kapısının genliğini paralel olarak kalibre etmek için kapı dizisi:
zh_tw: 對 Q0-Q1 和 Q3-Q4 的 CX 閘進行並行校準的閘序列：

source: Angle Error Characterization for CX Gates
bn_bn: CX যুক্তিবর্তনীসমূহর (গেইট) জন্য কৌণিক ত্রুটি চরিত্রায়ণ (ক্যারেক্টারাইজেশন)
es_un: Caracterización de Errores de Ángulo para Compuertas CX
fr_fr: Caractérisation de l'Erreur d'Angle pour Porte à Qubit-Unique
id_id: Karakterisasi Error Sudut untuk Gerbang CX
it_it: Caratterizzazione dell'Errore di Ampiezza nei Gate CX
ja_jp: CXゲートにおける角度エラーの特性評価
ko_kr: CX 게이트의 각도 에러 특성
pt_br: Caracterização do Erro de Ângulo para Portas CX
ru_ru: Характеризация угловой ошибки для вентилей CX
ta_in: CX கேட்களுக்கான கோணம் பிழை தன்மை
tr_tr: CX Kapıları için Açı Hatası Karakterizasyonu
zh_tw: CX 閘的角度誤差量測

source: Measure the angle error :math:`\theta` in the CX gate, i.e. \ :math:`CR_{\cos(\theta)X+\sin(\theta)Y}(\pi/2)` with respect to the angle of the single qubit gates.
bn_bn: CX সার্কিটে :math:`\theta` কৌণিক ত্রুটি :math:`CR_{\cos(\theta)X+\sin(\theta)Y}(\pi/2)` একক কিউবিট বর্তনীর (সার্কিটের) কোণের সাপেক্ষে পরিমাপ কর
es_un: Medir el error de ángulo :math:`\theta` en la compuerta CX, es decir, \ :math:`CR_{\cos(\theta)X+\sin(\theta)Y}(\pi/2)` con respecto al ángulo de las compuertas de un solo qubit.
fr_fr: Mesurer l'erreur d'angle :math:`\theta` dans la porte CX, c'est-à-dire :math:`CR_{\cos(\theta)X+\sin(\theta)Y}(\pi/2)` par rapport à l'angle des portes à qubit-unique.
id_id: Mengukur error sudut :math:`\theta ` pada gerbang CX, i.e. \ :math:` CR_ {\cos (\theta) X + \sin (\theta) Y} (\pi/2)` terhadap sudut milik gerbang qubit tunggal.
ru_ru: Измерение ошибки угла :math:`\theta` в вентиле CX, т.е. \ :math:`CR_{\cos(\theta)X+\sin(\theta)Y}(\pi/2)` относительно угла для однокубитного вентиля.
ta_in: ஒற்றை கியூபிட் கேட்களின் கோணத்தைப் பொறுத்து, CX கேட்டில் உள்ள கோணப் பிழையை, :math:`\theta`, i.e. \ :math:`CR_{\cos(\theta)X+\sin(\theta)Y}(\pi/2)` அளவிடவும்.
tr_tr: CX geçidindeki :math:`\theta` ölç, örneğin, tek kübit geçidin açışı ile ilgili olarak :math:`CR_{\cos(\theta)X+\sin(\theta)Y}(\pi/2)`.
zh_tw: 測量 CX 閘中的角度誤差 :math:`\theta`，也就是 \:math:`CR_{\cos(\theta)X+\sin(\theta)Y}(\pi/2)` 相對於在單一量子位元閘的角度。

source: The gate sequence to calibrate the CX angle for Q0-Q1 and Q3-Q4 in parallel:
bn_bn: সমান্তরালে Q0-Q1 এবং Q3-Q4 এর উপর CX সার্কিটের কোণের ক্রমাঙ্কনের বর্তনী ধারা:
es_un: La secuencia de compuertas para calibrar el ángulo de CX para Q0-Q1 y Q3-Q4 en paralelo es:
fr_fr: La séquence de porte pour calibrer l'angle de CX pour Q0-Q1 et Q3-Q4 en parallèle :
id_id: Urutan gerbang untuk mengkalibrasi sudut CX untuk Q0-Q1 dan Q3-Q4 secara paralel:
it_it: La sequenza di gate che serve a calibrare l'ampiezza del gate CX in parallelo su Q0-Q1 e Q2-Q3:
ja_jp: Q0-Q1 および Q3-Q4 の CX 角度を並行して調整するゲート・シーケンス:
ko_kr: Q0-Q1 및 Q3-Q4에 대한 CX 각도를 동시에 보정하는 게이트 조합:
pt_br: A sequência de portas para calibrar o ângulo CX para Q0-Q1 e Q3-Q4, em paralelo:
ru_ru: Последовательность вентилей для параллельной калибровки угла CX для Q0-Q1 и Q3-Q4:
ta_in: Q0-Q1 மற்றும் Q3-Q4 க்கான CX கோணத்தை இணையாக அளவீடு செய்வதற்கான கேட் வரிசை:
tr_tr: Q0-Q1 ve Q3-Q4 için CX açısını paralel olarak kalibre etmek için kapı dizisi:
zh_tw: 對 Q0-Q1和 Q3-Q4 的 CX 角度進行並行校準的閘序列：

source: This looks for a rotation error in the CX gate, i.e. if the gate is actually :math:`CR_x(\pi/2+\delta)` measure :math:`\delta`. This is very similar to the single qubit amplitude error calibration except we need to specify a control qubit (which is set to be in state :math:`|1\rangle`) and the rotation is :math:`\pi`.
it_it: Lo scopo è quello di ricavare l'errore di rotazione nel gate CX, ovvero se il gate applicato è :math:`CR_x(\pi/2+\delta)` si vuole andare a misurare il valore di :math:`\delta`. Il fenomeno è molto simile a quello della calibrazione dell'errore di ampiezza nei gate a singolo qubit, a parte la necessità di specificare un qubit di controllo (che è inizializzato nello stato :math:`|1\rangle`) e l'angolo di rotazione che in questo caso è :math:`\pi`.
ja_jp: これにより、CXゲートの回転エラーが検出されます。ゲートが実際に :math:`CR_x(\pi/2+\delta)` の場合、:math:`\delta` を測定します。これは、制御量子ビット（状態:math:`|1\rangle`に設定されている）を指定しなければならないことと、回転が :math:`\pi` であることを除いて、単一量子ビットの振幅エラーの較正と非常に似ています。
ko_kr: 이는 CX 게이트에서 회전 에러를 찾아낸다. 즉, 게이트가 실제로 :math:`CR_x(\pi/2+\delta)` 이면 :math:`\delta`를 측정해 낸다. 이는 제어 큐비트(상태가 :math:`|1\rangle`로 설정됨)를 지정해야 하며 회전은:math:`\pi`로 설정된다는 점을 제외하면 단일 큐비트 진폭 에러 교정과 매우 유사하다.
pt_br: Isto procura um erro de rotação na porta CX, ou seja, se a porta for na verdade :math:`CR_x(\pi/2+\delta)` isto mede o :math:`\delta`. Isto é muito semelhante à calibração de erro de amplitude para um único qubit, exceto que precisamos especificar um qubit de controle (que é configurado para estar no estado :math:`|1\rangle`) e a rotação é :math:`\pi`.

source: Measure the angle error :math:`\theta` in the CX gate, i.e. :math:`CR_{\cos(\theta)X+\sin(\theta)Y}(\pi/2)` with respect to the angle of the single qubit gates.
it_it: Vediamo come misurare l'errore di angolo :math:`\theta` nel gate CX, cioè :math:`CR_{\cos(\theta)X+\sin(\theta)Y}(\pi/2)` rispetto all'angolo dei gate a singolo qubit.
ja_jp: CXゲートでの角度エラー :math:`\theta` 、すなわち単一量子ビット・ゲートの角度に対する :math:`CR_{\cos(\theta)X+\sin(\theta)Y}(\pi/2)` を測定しましょう。
ko_kr: CX 게이트에서 각도 에러 :math:`\theta`, 즉 :math:`CR_{\cos(\theta)X+\sin(\theta)Y}(\pi/2)`를 단일 큐비트 게이트의 각도에 대해 측정한다.
pt_br: Mede o erro de ângulo :math:`\theta` na porta CX, ou seja, :math:`CR_{\cos(\theta)X+\sin(\theta)Y}(\pi/2)` com relação ao ângulo das portas de um único qubit.
