Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/1_hamiltonian_and_gate_characterization.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: This page was generated from `tutorials/noise/1_hamiltonian_and_gate_characterization.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/noise/1_hamiltonian_and_gate_characterization.ipynb`__ হতে উৎপন্ন হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/noise/1_hamiltonian_and_gate_characterization.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/noise/1_hamiltonian_and_gate_characterization.ipynb`__.
id_id: Halaman ini dibuat berdasarkan `tutorials/noise/1_hamiltonian_and_gate_karakterization.ipynb` __.
it_it: Questa pagina è stata generata da `tutorials/noise/1_hamiltonian_and_gate_characterization.ipynb`__.
ja_jp: 当ページは `tutorials/noise/1_hamiltonian_and_gate_characterization.ipynb`__ から生成されました。
ko_kr: 이 페이지는 "tutorials/noise/1_hamian_and_gate_glnb" __ 에서 생성되었다.
pt_br: Esta página foi gerada, a partir do `tutorials/noise/1_hamiltonian_and_gate_characterization.ipynb`__.
ru_ru: Эта страница создана на основе `tutorials/noise/1_hamiltonian_and_gate_characterization.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/noise/1_hamiltonian_and_gate_characterization.ipynb`__ யில் உருவாக்கப்பட்டது.
tr_tr: Bu sayfa `tutorials/noise/1_hamiltonian_and_gate_characterization.ipynb`__ adresinden oluşturuldu.
zh_tw: 此頁面是從 `tutorials/noise/1_hamiltonian_and_gatew_characterization.ipynb`__ 所產生的。

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/1_hamiltonian_and_gate_characterization.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/1_hamiltonian_and_gate_characterization.ipynb>`_.
zh_tw: 在 `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/1_hamiltonian_and_gate_characterization.ipynb>`_中互動地執行。

source: Hamiltonian and Gate Characterization
bn_bn: হ্যামিলটোনিয়ান এবং যুক্তিবর্তনী (গেইট) চরিত্রায়ন
es_un: Caracterización Hamiltoniana y de Compuerta
fr_fr: Caractérisation du hamiltonien et de la porte
id_id: Hamiltonian dan Karakterisasi Gate (Gerbang)
it_it: Hamiltoniana e Caratterizzazione dei Gate
ja_jp: ハミルトニアンとゲートの特性評価
ko_kr: 해밀토니안과 게이트 정의
pt_br: Caracterização Hamiltoniana e de Porta
ru_ru: Гамильтониан и характеристики вентилей
ta_in: ஹாமில்டோனியன் மற்றும் கேட் தன்மை
tr_tr: Hamiltonyen ve Kapı Karakterizasyonu
zh_tw: 哈密頓量與閘的量測

source: This notebook gives examples to demonstrate how to use the ``characterization.hamiltonian`` and ``characterization.gates`` modules in Qiskit Ignis. For a theory background see the `Ignis Community Notebooks <https://github.com/Qiskit/qiskit-community-tutorials/tree/master/ignis>`__.
bn_bn: Qiskit Ignis- এ ``characterization.hamiltonian`` এবং ``characterization.gates`` কীভাবে ব্যবহার করতে হয় কিছু উদাহরণের মাধ্যমে এই নোটবুকটি তা ব্যাখ্যা করে। এ বিষয়ে আরো বিস্তারিত জানতে এই লিংকে যাও <https://github.com/Qiskit/qiskit-community-tutorials/tree/master/ignis>
es_un: Este cuaderno da ejemplos para demostrar cómo utilizar los módulos ``characterization.hamiltonian`` y ``characterization.gates`` en Qiskit Ignis. Para un antecedente teórico, ver los `Cuadernos de la Comunidad de Ignis <https://github.com/Qiskit/qiskit-community-tutorials/tree/master/ignis>`__.
fr_fr: Ce bloc-notes donne des exemples pour montrer comment utiliser les modules ``characterization.hamiltonian`` et ``characterization.gates`` de Qiskit Ignis. Pour la base théorique, voir le `Ignis Community Notebooks <https://github.com/Qiskit/qiskit-community-tutorials/tree/master/ignis>`__.
id_id: Notebook ini memberikan contoh untuk menunjukkan bagaimana menggunakan ``characterization.hamiltonian`` dan ``karakterization.gates`` di Qiskit Ignis. Untuk latar belakang teori lihat ` Ignis Komunitas Notebooks <https://github.com/Qiskit/qiskit-community-tutorials/tree/master/ignis>` __.
it_it: Questo notebook fornisce esempi per mostrare come utilizzare i moduli ``characterization.hamiltonian`` e ``characterization.gates`` di Qiskit Ignis. Per una panoramica teorica vedi `Ignis Community Notebooks <https://github.com/Qiskit/qiskit-community-tutorials/tree/master/ignis>`__.
ja_jp: このノートブックでは、Qiskit Ignisの ``characterization.hamiltonian`` および ``characterization.gates`` モジュールの使用方法を示す例を提供します。理論の背景については、`Ignis Community Notebooks <https://github.com/Qiskit/qiskit-community-tutorials/tree/master/ignis>`__ を参照してください。
ko_kr: 이 노트북은 Qiskit Ignis의 ``characterization.hamiltonian``와 ``characterization.gates`` 모듈을 사용하는 방법을 알려주는 예로 구성되어 있다. 이론적인 배경지식을 위해서는 `Ignis Community Notebooks <https://github.com/Qiskit/qiskit-community-tutorials/tree/master/ignis>`__를 참조하라.
pt_br: Este notebook dá exemplos para demonstrar como utilizar os módulos ``characterization.hamiltonian`` e ``characterization.gates`` no Qiskit Ignis. Para se aprofundar na teoria, veja os ` Notebooks da Comunidade Ignis <https://github.com/Qiskit/qiskit-community-tutorials/tree/master/ignis>`__.
ru_ru: В этом блокноте приведены примеры, демонстрирующие использование модулей ``characterization.hamiltonian`` и ``characterization.gates`` в Qiskit Ignis. Теоретическую основу можно найти в `Ignis Community Notebooks <https://github.com/Qiskit/qiskit-community-tutorials/tree/master/ignis>`__.
ta_in: Qiskit Ignis-ல் ``characterization.hamiltonian`` மற்றும் ``characterization.gates`` தொகுதிக்கூறுகளை எவ்வாறு பயன்படுத்துவது என்பதை நிரூபிக்க இந்தப் பாடநூல் எடுத்துக்காட்டுகளை வழங்குகிறது. இதன் கோட்பாடு பின்னணியைப் பார்க்க `Ignis Community Notebooks <https://github.com/Qiskit/qiskit-community-tutorials/tree/master/ignis>`__.
tr_tr: Bu not defteri, Qiskit Ignis'in ``characterization.hamiltonian`` ve ``characterization.gates`` modüllerinin nasıl kullanılacağını gösteren örnekler verir. Bu konuyla ilgili teorik bilgi için `Ignis Topluluk Defterleri <https://github.com/Qiskit/qiskit-community-tutorials/tree/master/ignis>`__ sitesini ziyaret ediniz.
zh_tw: 此記事本示範如何在 Qiskit Ignis 中使用 ``characterization.hamiltonian`` 和 ``characterization.gates`` 模組。 若想知道更多理論背景，請參閱 `Ignis Community Notebook <https://github.com/Qiskit/qiskit-community-tutorials/tree/master/ignis>`__。

source: Measuring ZZ
bn_bn: ZZ পরিমাপকরণ
es_un: Medición ZZ
fr_fr: Mesurer ZZ
id_id: Mengukur ZZ
it_it: Misurazione di ZZ
ja_jp: ZZ測定
ko_kr: ZZ 측정
pt_br: Medindo ZZ
ru_ru: Измерение ZZ
ta_in: ZZ அளவீடு
tr_tr: ZZ Ölçümü
zh_tw: 量測 ZZ

source: The ``characterization.hamiltonian.zz_circuits`` module builds the circuits to perform an experiment to measure ZZ between a pair of qubits. Here, ZZ is defined as the energy shift on the :math:`|11\rangle` state:
bn_bn: ``characterization.hamiltonian.zz_circuits`` এক জোড়া কিউবিট এর জন্য ZZ এর পরিমাপের পরীক্ষা করতে একটি সার্কিট তৈরী করে। এখানে, ZZ হলো :math:`|11\rangle` অবস্থা (স্টেট) র জন্য শক্তির পরিবর্তন।
es_un: El módulo ``characterization.hamiltonian.zz_circuits`` construye los circuitos para realizar un experimento para medir ZZ entre un par de qubits. Aquí, ZZ se define como el cambio de energía en el estado :math:`|11\rangle`:
fr_fr: Le module ``characterization.hamiltonian.zz_circuits`` construit les circuits pour effectuer un test de mesure ZZ entre une paire de qubits. Ici, ZZ est défini comme le changement d'énergie sur l'état :math:`|11\rangle` :
id_id: Modul ``characterization.hamiltonian.zz_circuits`` membangun sirkuit untuk melakukan percobaan untuk mengukur ZZ antara sepasang qubits. Di sini, ZZ didefinisikan sebagai pergeseran energi pada keadaan :math:`|11\rangle` :
it_it: Il modulo ``characterization.hamiltonian.zz_circuits`` costruisce i circuiti necessari per eseguire un esperimento per misurare ZZ tra una coppia di qubit. ZZ è definito come lo shift energetico sullo stato :math:`|11\rangle`:
ja_jp: ``characterization.hamiltonian.zz_circuits`` モジュールは、2量子ビット間のZZ測定を実験する回路を構築します。ここで、ZZは :math:`|11\rangle` 状態でのエネルギー・シフトとして定義されます:
ko_kr: ``characterization.hamiltonian.zz_circuits`` 모듈은 쌍을 이룬 큐비트 사이에서 ZZ를 측정하는 실험을 수행하기 위해 회로를 만든다. 여기서 :math:`|11\rangle` state: 상태에서의 에너지 이동으로 정의된다.
pt_br: O módulo ``characterization.hamiltonian.zz_circuits`` cria os circuitos para realizar um experimento para medir o ZZ entre um par de qubits. Aqui, o ZZ é definido como o deslocamento de energia no estado :math:`|11\rangle`:
ru_ru: Модуль ``characterization.hamiltonian.zz_circuits`` создает схемы для проведения эксперимента по измерению ZZ между парой кубитов. Здесь ZZ определяется как сдвиг энергии в состоянии :math:`|11\rangle`:
ta_in: ``characterization.hamiltonian.zz_circuits`` தொகுதி ஒரு ஜோடி கியூபிட்களுக்கு இடையில் ZZ ஐ அளவிட ஒரு பரிசோதனையைச் செய்ய சர்க்யூட்களை உருவாக்குகிறது. இங்கே, ZZ என்பது :math:`|11\rangle` நிலையின் மீதான ஆற்றல் மாற்றமாக வரையறுக்கப்படுகிறது:
tr_tr: ``characterization.hamiltonian.zz_circuits`` modülü, bir çift kubit arasındaki ZZ'yi ölçmek için bir deneme yapmak için devreleri oluşturur. Burada ZZ, :math:`|11\rangle` durumunda enerji kayması olarak tanımlanır:
zh_tw: ``characterization.hamiltonian.zz_circuits`` 模組會建置可執行實驗來測量一對量子位元之間的 ZZ的模組 。 在這裡， ZZ 被定義為 :math:`|11\rangle` 量子態的能量變化：

source: The experiment to measure :math:`\xi` is to perform a Ramsey experiment on Q0 (H-t-H) and repeat the Ramsey experiment with Q1 in the excited state. The difference in frequency between these experiments is the rate :math:`\xi`.
bn_bn: :math:`\xi পরিমাপের এই পরীক্ষাটি Q0 (H-t-H) এর ওপর রামসে পরীক্ষা করার জন্য এবং Q1 এর উত্তেজিত দশায় পুনরায় রামসে পরীক্ষাটি করার জন্য করা হয়। এবং এই পরীক্ষাগুলোর কম্পাঙ্কের পার্থক্য হলো :math:`\xi`এর হার।
es_un: El experimento para medir :math:`\xi` es realizar un experimento de Ramsey en Q0 (H-t-H) y repetir el experimento de Ramsey con Q1 en el estado excitado. La diferencia entre la frecuencia de estos experimentos es la tasa :math:`\xi`.
fr_fr: L'expérience pour mesurer :math:`\xi` est d'effectuer une expérience Ramsey sur Q0 (H-t-H) et de répéter l'expérience Ramsey avec Q1 dans l'état excité. La différence de fréquence entre ces expériences est le taux :math:`\xi`.
id_id: Percobaan untuk mengukur :math:`\xi` adalah untuk melakukan percobaan Ramsey pada Q0 (H-t-H) dan mengulang percobaan Ramsey dengan Q1 dalam keadaan tereksitasi. Perbedaan frekuensi antara percobaan ini adalah lajunya :math:`\xi`.
it_it: L'esperimento per misurare :math:`\xi` consiste nell'eseguire un esperimento di Ramsey su Q0 (H-t-H) e ripeterlo con Q1 nello stato eccitato. La differenza delle frequenze risultanti dai due esperimenti è il tasso :math:`\xi`.
ja_jp: :math:`\xi` を測定する実験は、Q0 (H-t-H)上でRamsey実験をし、励起状態のQ1でRamsey実験を繰り返すことです。これらの実験の振動数の違いは、 その比が:math:`\xi`です。
ko_kr: :math:`\xi`를 측정하는 실험은 Q0 (H-t-H) 에 대한 램지 실험을 수행하고, 들뜬 상태(excited state)에서 Q1 으로 램지 실험을 반복하는 것이다. 이들 실험에서 주파수의 차이는, 사이의 차이의 차이는 비율 :math:`\xi`이다.
pt_br: O experimento para medir :math:`\xi` é realizar um experimento de Ramsey em Q0 (H-t-H) e repete o experimento de Ramsey com Q1 no estado aceso. A diferença na frequência entre esses experimentos é a taxa :math:`\xi`.
ru_ru: Эксперимент по измерению :math:`\xi` заключается в измерении осцилляций Рамси на Q0 (H-t-H) и повторении измерения на Q1 в возбужденном состоянии. Разница в частоте между этими экспериментами и есть частота :math:`\xi`.
ta_in: :math:`\xi` அளவிடுவதற்கான சோதனை என்பது Q0 (H-t-H) இல் ராம்சே பரிசோதனையை மேற்கொள்வதும், கிளர்வுற்ற நிலையில் Q1 உடன் ராம்சே பரிசோதனையை மீண்டும் செய்வதும் ஆகும். இந்த சோதனைகளுக்கு இடையிலான அதிர்வெண்ணில் உள்ள வேறுபாடு விகிதம் :math:`\xi` ஆகும்.
tr_tr: Ölçülecek deney :math:`\xi`, Q0 (H-t-H) üzerinde bir Ramsey denemesi yapmak ve Ramsey denemesini Q1 ile uyarılmış durumda tekrarlamaktır. Bu deneyler arasındaki frekans farkı şu şekildedir :math:`\xi`.
zh_tw: 測量 :math:`\xi` 的實驗是對 Q0 (H-t-H) 執行Ramsey實驗，並在Q1處於激發態的情下重複 Ramsey 實驗。 這些實驗之間的頻率差是 :math:`\xi`。

source: One of the features of the fitters is that we can split the circuits into multiple jobs and then give the results to the fitter as a list. This is demonstrated below.
bn_bn: ফিটার-এর একটি বৈশিষ্ট্য হলো আমরা বর্তনীগুলোকে অনেকগুলো কাজে ভাগ করে তারপর সেই ফলাফলগুলোকে একটি তালিকা হিসেবে ফিটারে দিতে পারি। নিচে এটা দেখানো হলো।
es_un: Una de las características de los ajustadores (fitters) es que podemos dividir los circuitos en múltiples trabajos y luego darle los resultados al ajustador como una lista. Esto se demuestra a continuación.
fr_fr: Une des caractéristiques des fitters (ajusteurs) est que nous pouvons diviser les circuits en plusieurs jobs (tâches) et ensuite donner les résultats au fitter comme une liste. Ceci est démontré ci-dessous.
id_id: Salah satu fitur dari fitters adalah bahwa kita dapat membagi sirkuit menjadi beberapa pekerjaan dan kemudian memberikan hasilnya kepada fitter sebagai list. Hal tersebut didemostrasikan seperti dibawah ini.
it_it: Una delle caratteristiche dei fitter è la possibilità di suddividere i circuiti in job multipli e poi passare i diversi risultati al fitter come lista. Qui di seguito ne viene data una dimostrazione.
ja_jp: フィッターの特徴の一つは、回路を複数のジョブに分割してから、結果をリストとしてフィッターに渡すことです。 これを以下に示します。
ko_kr: 적합자(fitter)의 특징 중 하나는 회로를 여러 개의 작업으로 나누고 그 결과를 적합자에게 목록으로 제공할 수 있다는 것이다. 이는 아래에서 설명된다.
pt_br: Uma das características dos equipamentos é que podemos dividir os circuitos em diversas tarefas e, em seguida, dar os resultados para o equipamento como uma lista. Isto é demonstrado abaixo.
ru_ru: Одна из особенностей инструментов для аппроксимации заключается в том, что мы можем разделить цепи на несколько заданий и затем передать результаты аппроксимирующему алгоритму в виде списка. Это показано ниже.
ta_in: ஃபிட்டர்களின் அம்சங்களில் ஒன்று என்னவென்றால், நாம் சர்க்யூட்களைப் பல வேலைகளாகப் பிரிக்கலாம், பின்னர் முடிவுகளை ஒரு பட்டியலாக ஃபிட்டருக்கு கொடுக்கலாம். இது கீழே நிரூபிக்கப்பட்டுள்ளது.
tr_tr: Fitter'ın özelliklerinden biri, devreleri birden fazla işe ayırabilmemiz ve daha sonra sonuçları bir liste halinde fitter'a verebilmemizdir. Bu aşağıda gösterilmiştir.
zh_tw: 擬合器的特點之一是，我們可以將電路分割成多個工作，然後將結果作為一個列表來把結果給擬合器 。 下文說明了這一點。

source: Amplitude Error Characterization for Single Qubit Gates
bn_bn: একক কিউবিট যুক্তিবর্তনীসমূহর (গেইট) জন্য বিস্তার ত্রুটির চরিত্রায়ণ (ক্যারেক্টারাইজেশন)
es_un: Caracterización de Errores de Amplitud para Compuertas de un solo Qubit
fr_fr: Caractérisation de l'erreur d'amplitude pour Porte à Qubit-Unique
id_id: Amplitudo Error Karakterisasi untuk Qubit Gates Tunggal
it_it: Caratterizzazione dell'Errore di Ampiezza nei Gate a Singolo Qubit
ja_jp: 単一量子ビット・ゲートの振幅エラー特性
ko_kr: 단일 큐비트 게이트의 진폭 에러 특성
pt_br: Caracterização do Erro de Amplitude para Portas de Um Único Qubit
ru_ru: Характеризация амплитудной ошибки для однокубитных вентилей
ta_in: ஒற்றை கியூபிட் கேட்களுக்கான அலைவீச்சுப் பிழை தன்மை
tr_tr: Tekli Kübit Kapıları için Genlik Hata Karakterizasyonu
zh_tw: 單一 量子位元閘的振幅誤差量測

source: Measure the amplitude error in the single qubit gates. Here this measures the error in the :math:`\pi/2` pulse. Note that we can run multiple amplitude calibrations in parallel. Here we measure on qubits 2 and 4.
bn_bn: একক কিউবিট সার্কিটের জন্য বিস্তার-ত্রুটি পরিমাপ কর। এখানে :math:`\pi/2`এর তড়িৎস্পন্দন এর জন্য ত্রুটি মাপা হয়েছে। উল্লেখ্য যে, আমরা একাধিক বিস্তার ক্রমাঙ্কন একই সাথে চালনা করতে পারি। এখানে আমরা কিউবিট ২ এবং ৪ এর জন্য পরিমাপ করছি।
es_un: Medir los errores de amplitud en las compuertas de un solo qubit. Aquí se mide el error en el pulso :math:`\pi/2`. Tenga en cuenta que podemos ejecutar múltiples calibraciones de amplitud en paralelo. Aquí medimos en los qubits 2 y 4.
fr_fr: Mesurer l'erreur d'amplitude dans les portes à qubit-unique. Ceci mesure l'erreur dans l'impulsion :math:`\pi/2`. Notez que nous pouvons exécuter plusieurs étalonnages d'amplitude en parallèle. Nous mesurons ici les qubits 2 et 4.
id_id: Mengukur kesalahan amplitudo di gerbang qubit tunggal. Di sini mengukur kesalahan pada :math:`\pi/2` pulsa. Perhatikan bahwa kita dapat menjalankan beberapa amplitudo kalibrasi secara paralel. Di sini kita mengukur pada qubits 2 dan 4.
it_it: Vediamo come misurare l'errore di ampiezza nei gate che agiscono su singolo qubit. Nel tutorial andremo a misurare l'errore nell'impulso di :math:`\pi/2`. Da notare che è possibile eseguire in parallelo diverse calibrazioni dell'ampiezza. Qui andremo ad effettuare la misura sui qubit 2 e 4.
ja_jp: 単一量子ビット・ゲートにおける振幅エラーを測定します。ここでは、:math:`\pi/2'パルスのエラーを測定します。複数の振幅調整を並行して実行できることに注意してください。 ここでは、量子ビット2と4を測定します。
ko_kr: 단일 큐비트 게이트에서 진폭 오류를 측정한다. 여기에서는 :math:`\pi/2`펄스의 오차를 측정한다. 여러 진폭 보정을 병렬로 실행할 수 있다는 점을 참고하라. 여기서는 큐비트 2와 큐비트 4를 측정한다.
pt_br: Medir o erro de amplitude nas portas de um único qubit. Aqui, medimos o erro no pulso de :math:`\pi/2`. Observe que podemos executar múltiplas calibrações de amplitude em paralelo. Aqui, medimos nos qubits 2 e 4.
ru_ru: Измерение амплитудной ошибки в однокубитных вентилях. В приведенном ниже примере измеряется ошибка в импульсе :math:`\pi/2`. Обратите внимание, что мы можем запустить несколько калибровок амплитуды параллельно. Здесь мы измеряем её на кубитах 2 и 4.
ta_in: ஒற்றை கியூபிட் கேட்களில் வீச்சு பிழையை அளவிடவும். இங்கே இது :math:`\pi/2` துடிப்பில் உள்ள பிழையை அளவிடுகிறது. நாம் இணையாக பல அலைவீச்சு அளவீடுகளை இயக்க முடியும் என்பதை நினைவில் கொள்க. இங்கே நாம் 2 மற்றும் 4 கியூபிட்களை அளவிடுகிறோம்.
tr_tr: Tekli kübit kapılarındaki genlik hatasını ölçün. Burada :math:`\pi/2` atımındaki hatayı ölçer. Paralel olarak birden çok genlik kalibrasyonu yapabileceğimizi unutmayın. Burada kübit 2 ve 4'ü ölçüyoruz.
zh_tw: 測量單量子位元閘中的振幅誤差。 這會測量 :math:`\pi/2` 脈衝中的誤差。 請注意，我們可以平行執行多個振幅校準。 在此我們對2號和4號量子位元進行測量。

source: This shows the sequence of the calibration, which is a repeated application of Y90 (U2[0,0]). Note that the measurements are mapped to a minimal number of classical registers in order of the qubit list.
bn_bn: এটি ক্রমাঙ্কনের ধারাকে প্রকাশ করে যা Y90 (U2[0,0]) এর বারবার চলমান একটি প্রক্রিয়া। এখানে উল্লেখ্য যে, কিউবিট এর তালিকার সাথে মিলিয়ে সর্বনিম্ন ক্ল্যাসিক্যাল রেজিস্টারে পরিমাপের ম্যাপিং করা হয়।
es_un: Esto muestra la secuencia de la calibración, que es una aplicación repetida de Y90 (U2[0,0]). Tenga en cuenta que las mediciones se asignan a un número mínimo de registros clásicos en el orden de la lista de qubits.
fr_fr: Ceci montre la séquence de l'étalonnage, qui est une application répétée de Y90 (U2[0,0]). Notez que les mesures sont mappées à un nombre minimal de registres classiques dans l'ordre de la liste des qubits.
id_id: Ini menunjukkan urutan kalibrasi, yang merupakan aplikasi berulang dari Y90 (U2 [0,0]). Perhatikan bahwa pengukuran dipetakan ke jumlah minimal dari register klasik dalam urutan daftar qubit.
it_it: Questa è la sequenza di calibrazione, che consiste nell'applicare ripetutamente Y90 (U2[0,0]). Da notare che le misure sono mappate su un numero minimo di registri classici in ordine di lista di qubit.
ja_jp: これは、較正のシーケンスを示しており、Y90 (U2[0,0])を繰り返したアプリケーションとなります。 測定値は量子ビットリストの順序では、最小数のクラシックレジスターにマッピングされることに注意してください。
ko_kr: 이는 Y90(U2[0,0])을 반복적으로 적용하는 교정 순서를 보여준다. 측정은 큐비트 리스트의 순서로 최소 개수의 고전 레지스터들에 매핑 된다는 것에 주목한다.
pt_br: Isto mostra a sequência da calibração, que é uma aplicação repetida de Y90 (U2[0,0]). Observe que as medições são mapeadas para um número mínimo de registradores clássicos na ordem da lista de qubits.
ru_ru: Здесь показана последовательность калибровки, которая представляет собой повторное применение Y90 (U2[0,0]). Обратите внимание, что измерения отображаются на минимальное количество классических регистров в порядке перечисления кубитов.
ta_in: இது அளவுத்திருத்தத்தின் வரிசையைக் காட்டுகிறது, இது Y90 (U2[0,0]) இன் தொடர்ச்சியான பயன்பாடாகும். இங்கு, கியூபிட் பட்டியலின் வரிசையில் அளவீடுகள் குறைந்த எண்ணிக்கையிலான கிளாசிக்கல் பதிவேடுகளுக்கு மாற்றப்படுகின்றன என்பதை நினைவில் கொள்க.
tr_tr: Bu, Y90'ın (U2 [0,0]) tekrarlanan bir uygulaması olan kalibrasyon dizisini gösterir. Ölçümlerin, kübit listesi sırasına göre asgari sayıda klasik yazmaca eşlendiğine dikkat edin.
zh_tw: 這顯示了校準的順序，它是 Y90 (U2[0,0]) 的重複應用。 請注意，該測量會被對映至以其量子位元清單排序的最少數量古典暫存器。

source: Angle Error Characterization for Single Qubit Gates
bn_bn: একক কিউবিট যুক্তিবর্তনীসমূহর (গেইট) জন্য কৌণিক ত্রুটি চরিত্রায়ণ (ক্যারেক্টারাইজেশন)
es_un: Caracterización de Errores de Ángulo para Compuertas de un solo Qubit
fr_fr: Caractérisation de l'erreur d'angle pour Porte à Qubit-Unique
id_id: Karakterisasi Error Sudut untuk Gerbang Qubit Tunggal
it_it: Caratterizzazione dell'Angolo di Errore nei Gate a Singolo Qubit
ja_jp: 単一量子ビット・ゲートにおける角度エラーの特性評価
ko_kr: 단일 큐비트 게이트의 각도 에러 특성
pt_br: Caracterização do Erro de Ângulo para Portas de Um Único Qubit
ru_ru: Характеризация угловой ошибки для однокубитных вентилей
ta_in: ஒற்றை கியூபிட் கேட்களுக்கான கோணத்தின் பிழை தன்மை
tr_tr: Tek Kübitli Kapılar için Açı Hatası Karakterizasyonu
zh_tw: 單一量子位元閘的角度誤差量測

source: Measure the angle between the X and Y gates:
bn_bn: X এবং Y যুক্তিবর্তনীর মধ্যের কোণ পরিমাপ কর:
es_un: Medir el ángulo entre las compuertas X e Y:
fr_fr: Mesurer l'angle entre les portes X et Y:
id_id: Mengukur sudut antara gerbang X dan Y:
it_it: Vediamo come misurare l'angolo tra i gate X e Y:
ja_jp: X ゲートと Y ゲートの間の角度を測定します。:
ko_kr: X와 Y 게이트 사이의 각도 측정:
pt_br: Mede o ângulo entre as portas X e Y:
ru_ru: Измерение угла между вентилями X и Y:
ta_in: X மற்றும் Y கேட்களுக்கு இடையே உள்ள கோணத்தைக் கணக்கிடுக:
tr_tr: X ve Y kapıları arasındaki açıyı ölçün:
zh_tw: 測量 X 和 Y 閘之間的角度：

source: The gate sequence for measuring the angle error:
bn_bn: কৌণিক ত্রুটি পরিমাপের জন্য যুক্তিবর্তনীর (গেইট) বিন্যাসক্রম:
es_un: La secuencia de compuertas para medir el error de ángulo es:
fr_fr: La séquence de porte pour mesurer l'erreur d'angle :
id_id: Urutan gerbang untuk mengukur error sudut:
it_it: Questa è la sequenza di gate per misurare l'errore dell'angolo:
ja_jp: 角度エラーを測定するためのゲートシーケンス:
ko_kr: 각도 에러를 측정하기 위한 게이트 배열:
pt_br: A sequência de portas para a medição do erro de ângulo:
ru_ru: Последовательность вентилей для измерения ошибки угла:
ta_in: கோணப் பிழையை அளவிடுவதற்கான கேட் வரிசை:
tr_tr: Açı hatasını ölçmek için kapı dizisi:
zh_tw: 測量角度誤差的閘序列：

source: Amplitude Error Characterization for CX Gates
bn_bn: CX যুক্তিবর্তনীসমূহর (গেইট) জন্য বিস্তার ত্রুটি চরিত্রায়ণ (ক্যারেক্টারাইজেশন)
es_un: Caracterización de Errores de Amplitud para Compuertas CX
fr_fr: Caractérisation de l'erreur d'amplitude pour Porte CX
id_id: Karakterisasi Error Amplitudo untuk CX Gates
it_it: Caratterizzazione dell'Errore di Ampiezza nei Gate CX
ja_jp: CX ゲートにおける振幅エラーの特性評価
ko_kr: CX 게이트의 진폭 에러 특성
pt_br: Caracterização do Erro de Amplitude para Portas CX
ru_ru: Характеризация амплитудной ошибки для вентилей CX
ta_in: CX கேட்களுக்கான அலைவீச்சுப் பிழை தன்மை
tr_tr: CX Kapıları için Genlik Hatası Karakterizasyonu
zh_tw: CX 閘的振幅誤差量測
