Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/3_measurement_error_mitigation.po
Languages: bn_bn, es_un, fr_fr, it_it, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: Assume that we apply some noise model from Qiskit Aer to the 5 qubits, then the calibration matrix will have most of its mass on the main diagonal, with some additional ‘noise’.
bn_bn: এখন যদি আমরা Qiskit এয়ার থেকে ৫ কিউবিটের উপর নয়েজ মডেল প্রয়োগ করি, তাহলে ক্রমাঙ্কন (ক্যালিব্রেশন) ম্যাট্রিক্সটির কর্ণ উপাদানের নয়েজ যুক্ত ( মেইন ডায়াগোনাল) ভুক্তি মান বেশি হবে।
es_un: Supongamos que aplicamos algún modelo de ruido de Qiskit Aer a los 5 qubits, entonces la matriz de calibración tendrá la mayor parte de su masa en la diagonal principal, con algo de ‘ruido’ adicional.
fr_fr: Supposons que nous appliquions un modèle de bruit de Qiskit Aer aux 5 qubits, alors la matrice d'étalonnage aura la plus grande partie de ses valeurs sur la diagonale principale, avec un 'bruit' supplémentaire.
it_it: Supponiamo di applicare ai 5 qubit un qualche modello di rumore utilizzando Qiskit Aer, allora la matrice di calibrazione avrà la maggior parte della sua massa sulla diagonale principale, ma qualche 'rumore' aggiuntivo fuori dalla diagonale.
ko_kr: Qiskit Aer의 노이즈 모델을 5개의 큐비트에 적용하고, 보정 매트릭스의 질량의 대부분은 대각선에 있고 일부는 추가적인 '노이즈'가 있다고 가정하자.
ru_ru: Предположим, что мы применим некоторую модель шума из Qiskit Aer к 5 кубитам, тогда калибровочная матрица будет в основном состоять из ненулевых элементов на главной диагонали с некоторым дополнительным "шумом".
ta_in: Qiskit Aer-லிருந்து 5 க்யூபிட்ஸ்-களுக்கு சில இரைச்சல் மாதிரியைப் பயன்படுத்துகிறோம் என்று வைத்துக் கொள்ளுங்கள், பின்னர் அளவொப்புமை மேட்ரிக்ஸ் அதன் கூடுதல் வெகுஜனத்தை முக்கிய மூலைவிட்டத்தில் கொண்டிருக்கும், மேலும் சில கூடுதல் ‘இரைச்சல்’ இருக்கும்.
tr_tr: 5 kübite Qiskit Aer'den bazı gürültü modelleri uyguladığımızı varsayalım, o zaman kalibrasyon matrisi, kütlesinin çoğuna esas köşegen üzerinde biraz ek ‘noise’ ile sahip olacaktır.
zh_tw: 假設我們將某一個噪音模型從 Qiskit Aer 套用到 5 個量子位元，然後校準矩陣會在主對角線上擁有大部分的質量，還有一些額外的 '噪音 ' 。

source: Alternatively, we can execute the calibration circuits using an IBMQ provider.
bn_bn: ক্রমাঙ্কন (ক্যালিব্রেশন) বর্তনী (সার্কিট) ব্যবহারের অন্য আরেকটি উপায় হচ্ছে আইবিএম কিউ প্রোভাইডার ব্যবহার করা।
es_un: Alternativamente, podemos ejecutar los circuitos de calibración utilizando un proveedor de IBMQ.
fr_fr: Alternativement, nous pouvons exécuter les circuits d'étalonnage à l'aide d'un fournisseur de service IBMQ.
it_it: In alternativa, possiamo eseguire i circuiti di calibrazione usando un provider IBMQ.
ja_jp: あるいは、IBMQプロバイダを使用して較正回路を実行することもできます。
ko_kr: 또는 IBMQ 공급자를 사용하여 교정 회로를 실행할 수 있다.
pt_br: Alternativamente, podemos executar os circuitos de calibração usando um provedor IBMQ.
ru_ru: В качестве альтернативы мы можем запустить цепи калибровки с помощью провайдера IBMQ.
ta_in: மாற்றாக, ஒரு IBMQ provider-ஐ பயன்படுத்தி அளவொப்புமை சர்கூட்களை இயக்கலாம்.
tr_tr: Alternatif olarak, bir IBMQ sağlayıcısı kullanarak kalibrasyon devrelerini yürütebiliriz.
zh_tw: 或者，我們也可以使用 IBMQ provider來執行校準電路。

source: Analyzing the Results
bn_bn: ফলাফল বিশ্লেষণ
es_un: Analizando los Resultados
fr_fr: Analyse des Résultats
it_it: Analisi dei Risultati
ja_jp: 結果の分析
ko_kr: 결과 분석
pt_br: Analisando os Resultados
ru_ru: Анализ результатов
ta_in: முடிவுகளை பகுப்பாய்வு செய்தல்
tr_tr: Sonuçları Analiz Etme
zh_tw: 分析結果

source: We would like to compute the total measurement fidelity, and the measurement fidelity for a specific qubit, for example, Q0.
bn_bn: আমরা একটি নির্দিষ্ট কিউবিট যেমন Q0 অথবা পুরো ব্যবস্থার পরিমাপ বিশুদ্ধতা বা মেজারমেন্ট ফাইডালিটি হিসাব করতে চাই।
es_un: Nos gustaría calcular la fidelidad de la medición total y la fidelidad de la medición para un qubit específico, por ejemplo, Q0.
fr_fr: Nous aimerions calculer la fidélité totale de la mesure et la fidélité de la mesure pour un qubit spécifique, par exemple, Q0.
it_it: Vorremmo andare a calcolare la fidelity di misurazione totale, e quella di uno specifico qubit, per esempio, Q0.
ja_jp: 総測定忠実度および、特定の量子ビット（例えばQ0）の測定忠実度を計算します。
ko_kr: 총 측정 정확도와 특정 큐비트, 예를 들어 Q0에 대한 측정 정확도를 계산해보자.
pt_br: Gostaríamos de computar a fidelidade total da medição e a fidelidade da medição para um qubit específico, por exemplo, Q0.
ru_ru: Мы хотели бы вычислить общую точность измерений и точность измерений для конкретного кубита, например, Q0.
ta_in: மொத்த அளவீட்டு சரிபார்த்தலையும், ஒரு குறிப்பிட்ட க்யூபிட்-ற்கான அளவீட்டு சரிபார்த்தலையும் கணக்கிட விரும்புகிறோம், எடுத்துக்காட்டாக, Q0.
tr_tr: Toplam ölçüm doğruluğunu ve belirli bir kübit için ölçüm doğruluğunu hesaplamak istiyoruz, örneğin, Q0.
zh_tw: 我們想要計算總測量準確性，以及特定量子位元的測量保真度(fidelity)，例如， Q0。

source: Since the on-diagonal elements of the calibration matrix are the probabilities of measuring state ‘x’ given preparation of state ‘x’, then the trace of this matrix is the average assignment fidelity.
bn_bn: যেহেতু ক্রমাঙ্কন (ক্যালিব্রেশন) ম্যাট্রিক্সের কর্ণ উপাদান বা ভুক্তি হচ্ছে স্টেট ‘x’ এর পরিমাপন সম্ভাবনা, সেইক্ষেত্রে ম্যাট্রিক্সটির ট্রেস হচ্ছে স্টেট ‘x’ এর গড় বিশুদ্ধতা বা ফাইডালিটি।
es_un: Dado que los elementos de la diagonal de la matriz de calibración son las probabilidades de medir el estado ‘x’ dada la preparación de ese mismo estado, entonces la traza de esta matriz es la fidelidad promedio asignada.
fr_fr: Puisque les éléments sur la diagonale de la matrice d'étalonnage sont les probabilités de mesure de l'état 'x' étant donné la préparation de l'état 'x', alors la trace de cette matrice correspond à la fidélité d'affectation moyenne.
it_it: Dato che gli elementi sulla diagonale della matrice di calibrazione sono le probabilità di misurare lo stato 'x' avendo preparato lo stato 'x', allora la traccia di questa matrice è la fidelity di assegnazione media.
ko_kr: 교정 행렬의 대각선상에 있는 요소는 상태 'x'의 준비가 주어졌을 때 상태 'x'를 측정할 확률이기 때문에, 이 행렬의 트레이스는 평균 할당 충실도이다.
ru_ru: Поскольку диагональные элементы калибровочной матрицы - это вероятности измерения состояния ‘x’ при подготовке состояния ‘x’, то след этой матрицы - это средняя точность подготовки состояния.
ta_in: அளவுத்திருத்த மேட்ரிக்ஸின் மேல்-மூலைவிட்ட கூறுகள் நிலை ‘x’, அளவிடப்பட்ட நிலை ‘x’ ஐ அளவிடுவதற்கான நிகழ்தகவுகள் என்பதால், இந்த மேட்ரிக்ஸின் சுவடு சராசரி ஒதுக்கீட்டு நம்பகத்தன்மையாகும்.
tr_tr: Kalibrasyon matrisinin köşegeni üzerindeki ögeleri, ‘x’ durumunun hazırlanmasında ‘x’ durumunu ölçme olasılıkları olduğundan, bu matrisin izi (trace) ortalama atama doğruluğudur.
zh_tw: 在給定準備狀態 'x' 下，由於校準矩陣的對角元素是測量狀態 'x' 的概率，因此該矩陣的迹數 (trace) 是平均分配保真度 (fidelity)。

source: Applying the Calibration
bn_bn: ক্রমাঙ্কন (ক্যালিব্রেশন) প্রয়োগ
es_un: Aplicando la Calibración
fr_fr: Application de l'Etalonnage
it_it: Applicazione della Calibrazione
ja_jp: 較正の適用
ko_kr: 보정을 적용하기
pt_br: Aplicando a Calibração
ru_ru: Применение калибровки
ta_in: அளவொப்புயை பயன்படுத்துதல்
tr_tr: Kalibrasyonun Uygulanması
zh_tw: 應用校準

source: We now perform another experiment and correct the measured results.
bn_bn: এখন আমরা আরেকটি পরীক্ষন সম্পন্ন করব এবং সঠিক ফলাফল পরিমাপ করব।
es_un: Ahora realizamos otro experimento y corregimos los resultados medidos.
fr_fr: Nous effectuons maintenant un autre test et corrigons les résultats mesurés.
it_it: Ora eseguiamo un altro esperimento e correggiamo i risultati misurati.
ja_jp: 次に別の実験を行い、測定結果を修正します。
ko_kr: 이 우리는 다른 실험을 수행하고 측정된 결과를 수정한다.
pt_br: Agora, realizamos outro experimento e corrigimos os resultados medidos.
ru_ru: Теперь мы проведем еще один эксперимент и скорректируем результаты измерений.
ta_in: நாம் இப்போது மற்றொரு பரிசோதனையைச் செய்து அளவிடப்பட்ட முடிவுகளை சரிசெய்கிறோம்.
tr_tr: Şimdi başka bir deney gerçekleştirip ölçülen sonuçları düzeltiyoruz.
zh_tw: 我們現在進行另一個實驗，並更正測量結果。

source: Correct Measurement Noise on a 3Q GHZ State
bn_bn: একটি তিন কিউবিট GHZ স্টেট এর পরিমাপ দূষণ (মেজারমেন্ট নয়েজ) পরীক্ষণ (কারেক্ট)
es_un: Corregir el Ruido de Medición en un Estado GHZ de 3Q
fr_fr: Corriger le Bruit de Mesure sur un Etat GHZ 3Q
it_it: Correzione del rumore di misura su uno stato GHZ a 3 qubit
ja_jp: 3Q GHZ状態での測定ノイズの補正
pt_br: Corrigindo o Ruído de Medição em um Estado GHZ de 3 Qubits
ru_ru: Коррекция шумов измерений в 3-кубитном GHZ состоянии
ta_in: 3Q GHZ நிலையில் சரியான அளவீட்டு இரைச்சல்
tr_tr: Bir 3Q GHZ Durumu Üzerindeki Ölçüm Gürültüsünü Düzelt
zh_tw: 修正對三量子位元 GHZ 狀態的量測噪音

source: As an example, we start with the 3-qubit GHZ state on the qubits Q2,Q3,Q4:
bn_bn: উদাহরণস্বরূপ, আমরা তিন কিউবিট GHZ স্টেট বা অবস্থা কে Q2,Q3,Q4 দ্বারা প্রকাশ করতে পারি:
es_un: Como ejemplo, empezamos con el estado GHZ de 3 qubits en los qubits Q2, Q3, Q4:
fr_fr: À titre d'exemple, nous commençons avec l'état GHZ 3-qubit sur les qubits Q2,Q3,Q4 :
it_it: Come esempio, partiamo con lo stato GHZ a 3 qubit sui qubit Q2,Q3,Q4:
ja_jp: 例として、Q2、Q3、Q4の3量子ビットのGHZ状態から始めます。:
ko_kr: 예를 들어, Q2, Q3, Q4 큐비트에 대해 3-큐비트 GHZ 상태로 시작한다.
pt_br: Como exemplo, iniciamos com o estado GHZ de 3 qubits nos qubits Q2,Q3,Q4:
ru_ru: В качестве примера мы начинаем с 3-кубитного GHZ состояния на кубитах Q2,Q3,Q4:
ta_in: உதாரணமாக, Q2, Q3, Q4 என்ற க்யூபிட்ஸ்-களில் 3-க்யூபிட் GHZ நிலையில் தொடங்குவோம்:
tr_tr: Örneğin, Q2,Q3,Q4 kübitlerinde 3 kübitli GHZ durumu ile başlıyoruz:
zh_tw: 作為範例，我們以三個量子位元 Q2、Q3 和 Q4 的 GHZ 狀態開始:

source: We now execute the calibration circuits (with the noise model above):
bn_bn: এখন আমরা ক্রমাঙ্কন (ক্যালিব্রেশন) বর্তনী (সার্কিট) সম্পাদনা বা চালনা করব (এক্সিকিউট) ( উপরে বর্ণিত নয়েজ মডেল ব্যবহার করে):
es_un: Ahora ejecutamos los circuitos de calibración (con el modelo de ruido anterior):
fr_fr: Nous exécutons maintenant les circuits d'étalonnage (avec le modèle de bruit ci-dessus):
it_it: Eseguiamo i circuiti di calibrazione (utilizzando il modello di rumore definito sopra):
ja_jp: ここで、較正回路を実行します(上記のノイズモデルを使います)。
ko_kr: 이제 보정 회로 (위의 잡음 모델 포함) 를 실행한다.
pt_br: Executamos, agora, os circuitos de calibração (com o modelo de ruído acima):
ru_ru: Теперь запускаем калибровочные цепи (с указанной выше моделью шума):
ta_in: நாம் இப்போது அளவொப்புமை சர்கூட்களை இயக்குகிறோம் (மேலே உள்ள இரைச்சல் மாதிரியுடன்):
tr_tr: Şimdi kalibrasyon devrelerini yürütüyoruz (Yukarıdaki gürültü modeliyle birlikte):
zh_tw: 我們現在執行校準電路（以上方的噪音模型）：

source: We now compute the results without any error mitigation and with the mitigation, namely after applying the calibration matrix to the results.
bn_bn: এখন আমরা কোন ধরনের ত্রুটি প্রশমন (এরর মিটিগেশন) ব্যবস্থা ছাড়া ফলাফল হিসাব করব । ক্রুটি প্রশমন ব্যবস্থা ব্যবহার করতে হলে ফলাফলের উপর ক্রমাঙ্কন (ক্যালিব্রেশন) ম্যাট্রিক্স ব্যবহার করতে হবে।
es_un: Ahora calculamos los resultados sin ninguna mitigación de errores y con la mitigación, es decir, después de aplicar la matriz de calibración a los resultados.
fr_fr: Nous calculons maintenant les résultats sans aucune atténuation d'erreur et avec l'atténuation, à savoir après avoir appliqué la matrice d'étalonnage aux résultats.
it_it: Ora calcoliamo i risultati senza alcuna mitigazione dell'errore e con la mitigazione, ovvero dopo aver applicato la matrice di calibrazione ai risultati.
ja_jp: ここで、エラー軽減のない結果と軽減した結果（すなわち、結果に較正行列を適用した後のもの）を計算します。
ko_kr: 이제 결과에 보정 매트릭스를 적용한 후 에러를 완화하는 것과 전혀 완화하지 않는 결과를 계산한다.
pt_br: Agora, computamos os resultados sem qualquer mitigação de erros e com a mitigação, a saber, depois de aplicar a matriz de calibração aos resultados.
ru_ru: Теперь мы вычисляем результаты без уменьшения ошибок и с уменьшением, а именно после применения калибровочной матрицы к результатам.
ta_in: எந்தவொரு பிழை குறைத்தலும் இல்லாமல் மற்றும் தணிப்புடன் முடிவுகளை இப்போது கணக்கிடுகிறோம், அதாவது முடிவுகளுக்கு அளவொப்புமை மேட்ரிக்ஸைப் பயன்படுத்திய பிறகு.
tr_tr: Şimdi de sonuçları hiç bir hata azaltması olmadan ve azaltmayla birlikte, yani sonuçlara kalibrasyon matrisini uyguladıktan sonra hesaplıyoruz.
zh_tw: 我們現在計算沒有任何錯誤緩解和有錯誤緩解的結果，也就是在將校準矩陣套用到結果之後。

source: There are two fitting methods for applying the calibration (if no method is defined, then ‘least_squares’ is used). - **‘pseudo_inverse’**, which is a direct inversion of the calibration matrix, - **‘least_squares’**, which constrains to have physical probabilities.
bn_bn: দুইটি প্রচলিত পদ্ধতি আছে এই ক্রমাংকন ম্যাট্রিক্স ব্যবহারের জন্য (যদি কোন পদ্ধতি ব্যবহার করতে হবে উল্লেখ না থাকে তাহলে ‘least_squares’ ব্যবহার করতে হবে)।- **‘pseudo_inverse’** হচ্ছে ক্রমাঙ্কন (ক্যালিব্রেশন) ম্যাট্রিক্সের বিপরীত ম্যাট্রিক্স, যেখানে - **‘least_squares’**, সরাসরি প্রায়োগিক সম্ভাবনার (ফিজিক্যাল প্রবাবিলিটি) মধ্যে সীমাবদ্ধ।
es_un: Hay dos métodos de ajuste para aplicar la calibración (si no se define ningún método, se utiliza ‘least_squares’'). - **‘pseudo_inverse’**, que es una inversión directa de la matriz de calibración, - **‘least_squares’**, que obliga a tener probabilidades físicas.
fr_fr: Il y a deux méthodes d'ajustement pour appliquer l'étalonnage (si aucune méthode n'est définie, alors 'least_squares' est utilisé). - **'pseudo_inverse'**, qui est une inversion directe de la matrice d'étalonnage, - **'least_squares'**, qui contraint à avoir des probabilités physiques.
it_it: Sono disponibili due metodi per l'applicazione della calibrazione (se non è specificato alcun modulo, allora viene utilizzato 'least_squares'). - **'pseudo_inverse'**, che è una inversione diretta della matrice di calibrazione, - **'least_squares'**, che vincola ad avere probabilità fisiche.
ko_kr: 보정을 적용하기 위한 두 개의 피팅 방법이 있다 (정의된 메소드가 없는 경우에는 ‘least_squares’ 가 사용된다). - **'pseudo_inverse'** 는 컬리브레이션 매트릭스의 직접 반전인-**'least_squares'** 이며, 이는 물리적 확률을 갖도록 제한한다.
ru_ru: Для применения калибровки существует два метода аппроксимации (если метод не определен, то используется ‘least_squares’). - **‘pseudo_inverse’**, который является прямой инверсией калибровочной матрицы, - **‘least_squares’**, который ограничивается физическими вероятностями.
ta_in: அளவொப்புயை பயன்படுத்துவதற்கு இரண்டு பொருத்தமான முறைகள் உள்ளன (எந்த முறையும் வரையறுக்கப்படவில்லை என்றால், ‘least_squares’ பயன்படுத்தப்படுகின்றன).- **‘pseudo_inverse’**, இது அளவொப்புமை மேட்ரிக்ஸின் நேரடி தலைகீழ் ஆகும், - **‘least_squares’**, இது உடல் நிகழ்தகவுகளைக் கட்டுப்படுத்துகிறது.
tr_tr: Kalibrasyon uygulamak için iki uydurma (fitting) yöntemi (eğer hiç method tanımlanmamışsa, o zaman ‘least_squares’ kullanılır) vardır. -**‘pseudo_inverse’**, kalibrasyon matrisinin doğrudan ters çevrilmesi, - **‘least_squares’**, fiziksel olasılıklara sahip kısaltmalar.
zh_tw: 套用校準時有兩種適合的方法（如果未定義方法，則會使用 'least_squares'）。 - **‘pseudo_inverse’**，這是校準矩陣的直接反轉， - **'least_squares' **，它提供了額外的限制使最後獲得的是有物理意義的概率。

source: The raw data to be corrected can be given in a number of forms:
bn_bn: যেইসব আদি মান (র ডাটা - raw data) এর সংশোধনী করতে হবে তাদের একটি সাংখ্যিক সংকেত ( নাম্বার অব ফর্মস) থাকে:
es_un: Los datos crudos que se van a corregir se pueden proporcionar de varias formas:
fr_fr: Les données brutes à corriger peuvent être données sous différentes formes:
it_it: I dati grezzi da correggere possono essere forniti in diverse forme:
ja_jp: 修正する生データは、いくつかの形式で指定できます。
ko_kr: 정정할 원시 데이터는 다음과 같은 여러 양식으로 제공될 수 있다.
pt_br: Os dados brutos, a corrigir, podem ser fornecidos em vários formatos:
ru_ru: Исходные данные, подлежащие корректировке, могут быть представлены несколькими способами:
ta_in: சரிசெய்ய வேண்டிய பதனிடப்படாத தரவுகளை பல வடிவங்களில் கொடுக்கலாம்:
tr_tr: Düzeltilecek işlenmemiş veriler, çeşitli biçimlerde verilebilir:
zh_tw: 要更正的原始資料，可以用多種形式提供：

source: Form1: A counts dictionary from results.get_counts,
bn_bn: Form1: একটি গণনা ডিকশনারি আনয়ন (ইম্পোর্ট) করতে হবে results.get_counts লাইব্রেরী থেকে,
es_un: Forma1: Un diccionario de recuentos a partir de results.get_counts,
fr_fr: Forme 1: Un dictionnaire de comptes de results.get_counts,
it_it: Formato1: Un dizionario di conteggi ottenuto da results.get_counts,
ko_kr: Form1: results.get_count 에서 카운트 사전이 있다.
ru_ru: Способ 1: Словарь значений из results.get_counts,
ta_in: வடிவம்1: results.get_counts -ல் இருந்து ஒரு எண்ணும் அகராதி,
tr_tr: Form1: results.get_counts dan bir sayımlar sözlüğü,
zh_tw: 形式1：來自 results.get_counts 的計數字典，

source: Form2: A list of counts of length=len(state_labels),
bn_bn: Form2: একটি তালিকা গণনা করা যার দৈর্ঘ্য হবে length=len(state_labels),
es_un: Forma2: Una lista de recuentos de length=len(state_labels),
fr_fr: Forme 2: liste des comptages de longueur=len(state_labels),
it_it: Formato2: Una lista di conteggi di lunghezza=len(state_labels),
ko_kr: Form2: length=len(state_labels) 의 개수의 목록이다.
ru_ru: Способ 2: Лист числа измерений длиной length=len(state_labels),
ta_in: வடிவம்2: length=len(state_labels) எண்ணிக்கையின் பட்டியல்,
tr_tr: Form2: Uzunluk sayımlarının listesi=len(state_labels),
zh_tw: 形式2：一個 length=len(state_labels) 的計數清單，

source: Form3: A list of counts of length=M*len(state_labels) where M is an integer (e.g. for use with the tomography data),
bn_bn: Form3: length=M*len(state_labels), যেখানে M একটি পুর্ণসংখ্যা দ্বারা একটি স্টেট লেবেলের তালিকা নির্নয় করা (উদাহরণস্বরূপ টমোগ্রাফি এর ডাটা সম্পরকিত কাজে এই সমীকরন ব্যবহার করা যাবে),
es_un: Forma3: Una lista de recuentos de length=M*len(state_labels) donde M es un número entero (por ejemplo, para usar con los datos de la tomografía),
fr_fr: Forme 3: Une liste de comptages de longueur=M*len(state_labels) où M est un entier (par exemple pour l'utilisation avec les données de tomographie),
it_it: Formato3: Una lista di conteggi di lunghezza=M*len(state_labels) dove M è un intero (ad esempio per l'uso con i dati di tomografia),
ko_kr: Form3: length=M*len(state_labels) 의 카운트목록이며, 여기서 M은 정수이다 (예를 들어, 단층 촬영 데이터와 함께 사용하기 위한).
ru_ru: Способ 3: Список числа измерений длиной length=M*len(state_labels), где M - целое число (например для использования с томографическими данными),
ta_in: வடிவம்3: length=M*len(state_labels) எண்ணிக்கையின் பட்டியல், அதில் M என்பது ஒரு integer (எ.கா. டோமோகிராஃபி தரவுடன் பயன்படுத்த),
tr_tr: Form3: M'in bir tam sayı olduğu yerde uzunluk sayımlarının listesi=M*len(state_labels) (örneğin tomografi verileriyle kullanım için),
zh_tw: 形式3 ：一個 length=M*len(state_labels) 的計數清單，其中 M 是一個整數（例如，與斷層掃描資料一起使用），

source: Form4: A qiskit Result (e.g. results as above).
bn_bn: Form4: একটি Qiskit ফলাফল (উদাহরণস্বরূপ উল্লেখিত ফলাফল)।
es_un: Forma4: Un resultado qiskit (por ejemplo, resultados como los anteriores).
fr_fr: Forme 4: Un Résultat qiskit (par exemple les résultats ci-dessus).
it_it: Formato4: Un Result qiskit (ovvero i risultati come riportati sopra).
ko_kr: Form4: qiskit 결과 (예를 들어, 위와 같은 결과).
ru_ru: Способ 4: Результат qiskit (например, results, как показано выше).
ta_in: வடிவம்4: ஒரு qiskit முடிவு (எ.கா. மேலே உள்ள முடிவுகள்).
tr_tr: Form4: Bir qiskit Sonucu (örneğin yukarıdaki gibi sonuçlar).
zh_tw: 形式4： 一個 qiskit 結果（例如上述的結果）。

source: We can now plot the results with and without error mitigation:
bn_bn: এখন আমরা ত্রুটি দূরীকরণ সহ এবং ছাড়া ফলাফলের লেখচিত্র অংকন করতে পারি:
es_un: Ahora podemos mostrar gráficamente los resultados con y sin mitigación de errores:
fr_fr: Nous pouvons maintenant tracer les résultats avec et sans atténuation des erreurs:
it_it: Possiamo ora disegnare su un grafico i risultati con e senza mitigazione dell'errore:
ja_jp: これで、エラーを軽減した場合としない場合の結果をプロットできます。
ko_kr: 이제 에러 완화 여부와 관계없이 결과를 표시할 수 있다.
pt_br: Podemos agora desenhar os resultados com e sem mitigação de erros:
ru_ru: Теперь мы можем построить график результатов с учетом и без учета уменьшения ошибок:
ta_in: இப்போது நாம் நம் முடிவுககளை பிழை தணித்தும் தணிக்காமலும் வகுக்கலாம்:
tr_tr: Artık sonuçları hata azaltma ile ve hata azaltma olmadan çizebiliriz:
zh_tw: 我們現在可以繪製出有以及沒有誤差緩解的結果:

source: Applying to a reduced subset of qubits
bn_bn: কিউবিটের সাবসেট অবনমন প্রক্রিয়া
es_un: Aplicando a un subconjunto reducido de qubits
fr_fr: Application à un sous-ensemble réduit de qubits
it_it: Applicazione ad un sottoinsieme ridotto di qubit
ja_jp: 量子ビットが削減されたサブセットへの適用
ko_kr: 축소된 큐비트 부분 집합에 적용하기
pt_br: Aplicando a um subconjunto reduzido de qubits
ru_ru: Применение к сокращенному подмножеству кубитов
ta_in: Qubit-களின் குறைக்கப்பட்ட துணைக்குழுவுக்கு சேர்த்தல்
tr_tr: İndirgenmiş bir kübit alt kümesine uygulama
zh_tw: 套用至一個量子位元的縮減子集

source: Consider now that we want to correct a 2Q Bell state, but we have the 3Q calibration matrix. We can reduce the matrix and build a new mitigation object.
bn_bn: আমরা একটি 2Q Bell state এর ক্রুটি সংশোধন করতে চাই, কিন্তু আমাদের কাছে একটি 3Q calibration matrix আছে। এই ক্ষেত্রে আমরা ম্যাট্রিক্সটির অবনমন করাতে পারি এবং একটি নতুন ক্রুটি দূরীকরণ অবজেক্ট তৈরি করতে পারি।
es_un: Considere ahora que queremos corregir un estado de Bell de 2Q, pero tenemos la matriz de calibración de 3Q. Podemos reducir la matriz y construir un nuevo objeto de mitigación.
fr_fr: Considérons maintenant que nous voulons corriger un état Bell de 2Q, mais nous avons la matrice d'étalonnage 3Q. Nous pouvons réduire la matrice et construire un nouvel objet d'atténuation.
it_it: Nel caso in cui si volesse correggere stati di Bell a 2 qubit avendo a disposizione una matrice di calibrazione calcolata per 3 qubit, è possibile ridurre la matrice e costruire un nuovo oggetto di mitigazione.
ja_jp: ここで、2Qベル状態を修正したいと思いますが、すでに3Qの較正行列があります。行列を削減し、新たな軽減オブジェクトを構築できます。
ko_kr: 2Q Bell 상태를 수정하고 싶지만 3Q 보정 매트릭스가 있다는 것을 가정하자. 우리는 매트릭스를 줄이고 새로운 완화 개체를 구축할 수 있다.
pt_br: Considere, agora, que queremos corrigir um estado de Bell de 2 qubits, mas temos a matriz de calibração para 3 qubits. Podemos reduzir a matriz e construir um novo objeto de mitigação.
ru_ru: Рассмотрим теперь, что мы хотим исправить состояние Белла для двух кубитов, но у нас есть калибровочная матрица для трех. Мы можем уменьшить матрицу и построить новый объект для коррекции.
ta_in: 2Q பெல் நிலையை சரிசெய்ய விரும்புகிறோம் என்பதை இப்போது கவனியுங்கள், ஆனால் எங்களிடம் 3Q அளவொப்புமை மேட்ரிக்ஸே உள்ளது. நாம் மேட்ரிக்ஸைக் குறைத்து புதிய தணிப்பு பொருளை கட்ட முடியும்.
tr_tr: Şimdi bir 2Q Bell durumunu düzeltmek istediğimizi düşünün, ancak 3Q kalibrasyon matrisimiz var. Matrisi indirgeyebilir ve yeni bir azaltma nesnesi oluşturabiliriz.
zh_tw: 現在我們考慮更正一個 2Q Bell 的態，但我們有 3Q 校準矩陣。 我們可以縮小矩陣，並建立一個新的緩解物件。

source: Tensored mitigation
bn_bn: টেনসর ত্রুটি দূরীকরণ
es_un: Mitigación tensorizada
fr_fr: Mitigation tendue
it_it: Mitigazione localizzata
ja_jp: 軽減のテンソル化
ko_kr: Tensored 완화
pt_br: Mitigação tensorial
ru_ru: Тензорное уменьшение ошибки
ta_in: டெண்சர்ட் குறைத்தல்
tr_tr: Tensörle azaltma
zh_tw: 張量化的緩解
