Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/3_measurement_error_mitigation.po
Languages: bn_bn, es_un, fr_fr, it_it, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: In the following, we illustrate measurement error mitigation of Aqua algorithms on the example of searching the ground state of a Hamiltonian with VQE.
bn_bn: পরবর্তী অংশে, আমরা দেখব কিভাবে অ্যাকোয়া এর ভি কিউ ই (একটি কোয়ান্টাম এলগোরিদম বা ধারাক্রম, যা দ্বারা একটি হ্যামিল্টনিয়ানের ভুমি দশা বা সর্বনিম্ন মান নির্নয় করা যায়) ধারাক্রম বা এলগোরিদম দিয়ে ফলাফল ত্রুটি দূরীকরণ করা যায়।
es_un: A continuación, ilustramos la mitigación de errores de medición de algoritmos de Aqua en el ejemplo de búsqueda del estado base de un Hamiltoniano con el VQE.
fr_fr: Dans ce qui suit, nous illustrons l'atténuation des erreurs de mesure avec les algorithmes Aqua sur l'exemple de la recherche de l'état fondamental d'un Hamiltonien avec VQE.
it_it: Di seguito, mostriamo la mitigazione dell'errore di misura negli algoritmi Aqua attraverso l'esempio della ricerca dello stato fondamentale di una Hamiltoniana utilizzando l'algoritmo VQE.
ja_jp: 以下では、 VQEでハミルトニアンの基底状態を探索する例で、 Aqua のアルゴリズムの測定エラーの緩和を説明します。
ko_kr: 다음에, 본 발명자들은, 예를 들어, VQE를 사용하여 함밀턴의 접지 상태를 탐색하는 예에 대한 아쿠아 (Aqua) 알고리즘의 측정 에러 완화를 예시한다.
pt_br: A seguir, ilustramos a mitigação de erros de medição de algoritmos do Aqua usando, como exemplo, a pesquisa do estado fundamental de um Hamiltoniano com VQE.
ta_in: பின்வருவனவற்றில், VQE உடன் ஒரு ஹாமில்டோனியனின் அடி நிலையைத் தேடுவதற்கான எடுத்துக்காட்டில் Aqua வழிமுறைகளின் அளவீட்டு பிழை குறைத்தல்.
tr_tr: Aşağıda, VQE ile bir Hamiltonyenin temel durumunu arama örneği üzerinde Aqua algoritmalarının ölçüm hatası azaltımını gösteriyoruz.
zh_tw: 以下，我們用 VQE 搜尋哈密頓算符的基態的例子，說明 Aqua 演算法的測量錯誤緩解。

source: First, we need to import the libraries that provide backends as well as the classes that are needed to run the algorithm.
bn_bn: এই এলগোরিদম সম্পাদনার জন্য আমাদের ব্যাকএন্ড থেকে লাইব্রেরী ইম্পোর্ট বা আনয়নের কাজ সম্পন্ন করতে হবে। এই লাইব্রেরীতে প্রয়োজনীয় কিছু ক্লাস আছে যা এলগোরিদম সম্পাদনার জন্য বেশ প্রয়োজনীয়।
es_un: Primero, necesitamos importar las bibliotecas que proporcionan los backends, así como las clases necesarias para ejecutar el algoritmo.
fr_fr: Tout d'abord, nous devons importer les bibliothèques qui fournissent les backends ainsi que les classes nécessaires à l'exécution de l'algorithme.
it_it: Per prima cosa, abbiamo bisogno di importare le librerie che forniscono i backend, così come anche le classi necessarie all'esecuzione dell'algoritmo.
ja_jp: 最初に、バックエンドを提供するライブラリおよびアルゴリズムを実行するために必要なクラスをインポートする必要があります。
ko_kr: 먼저, 알고리즘을 실행하는 데 필요한 클래스뿐만 아니라 백엔드를 제공하는 라이브러리를 가져와야 한다.
pt_br: Primeiro, precisamos importar as bibliotecas que fornecem serviços, bem como as classes que são necessárias para executar o algoritmo.
ru_ru: Во-первых, нам нужно импортировать библиотеки, предоставляющие бэкенды, а также классы, необходимые для работы алгоритма.
ta_in: முதலில், பின்தளத்தில் வழங்கும் libraries மற்றும் வழிமுறையை இயக்கத் தேவையான வகுப்பு இறக்குமதி செய்ய வேண்டும்.
tr_tr: Öncelikle, algoritmayı çalıştırmak için gerekli olan sınıfların yanı sıra arkayüzeyleri sağlayan kitaplıkları içe aktarmamız gerekir.
zh_tw: 首先，我們需要匯入提供後端 (backend) 的程式庫 (libraries)，以及執行演算法所需要的類別 (classes)。

source: Then, we initialize the instances that are required to execute the algorithm.
bn_bn: এখন আমরা এলগোরিদমটি সম্পাদনার জন্য কিছু দৃষ্টান্ত (ইনস্ট্যান্স) বা উদাহরণ ব্যাখ্যা করব।
es_un: Luego, inicializamos las instancias necesarias para ejecutar el algoritmo.
fr_fr: Ensuite, nous initialisons les instances requises pour exécuter l'algorithme.
it_it: Poi, inizializziamo le istanze richieste per eseguire l'algoritmo.
ja_jp: 次に、アルゴリズムを実行するために必要なインスタンスを初期化します。
ko_kr: 그런 다음, 알고리즘을 실행하는 데 필요한 인스턴스를 초기화한다.
pt_br: Em seguida, inicializamos as instâncias que são necessárias para executar o algoritmo.
ru_ru: Затем мы инициализируем объекты, необходимые для выполнения алгоритма.
ta_in: பின்னர், வழிமுறையை இயக்கத் தேவையான நிகழ்வுகளை நாம் துவக்குகிறோம்.
tr_tr: Ardından, algoritmayı yürütmek için gerekli olan örnekleri başlatıyoruz.
zh_tw: 然後，我們初始化運行算法所需的實例 (instances)。

source: Here, we choose the Aer ``qasm_simulator`` as backend and also add a custom noise model. The application of an actual quantum backend provided by IBMQ is outlined in the commented code.
bn_bn: এইখানে আমরা এয়ার ``qasm_simulator`` ব্যাকএন্ড ব্যবহার করেছি। সেই সাথে একটি বিশেষায়িত (কাস্টম) দূষণ বা ত্রুটি নকশা যুক্ত করেছি। পুরো প্রক্রিয়াটি IBMQ এর মন্তব্য কোড এর ব্যাকএন্ড এ বিস্তারিত বর্ণিত আছে।
es_un: Aquí, elegimos ``qasm_simulator`` de Aer como backend y también agregamos un modelo de ruido personalizado. La aplicación de un backend cuántico real proporcionado por IBMQ se muestra en el código comentado.
fr_fr: Ici, nous choisissons ``qasm_simulateur`` de Aer comme backend et nous ajoutons également un modèle de bruit personnalisé. L'application d'un backend quantique réel fourni par IBMQ est décrite dans le code commenté.
it_it: Qui, scegliamo come backend il ``qasm_simulator`` di Aer e aggiungiamo un modello di rumore personalizzato. Nel codice commentato è descritta una applicazione di un effettivo backend quantistico fornito da IBMQ.
ja_jp: ここでは、バックエンドとして Aer の ``qasm_simulator`` を選択し、カスタムノイズモデルを追加します。 IBMQ によって提供される実機の量子バックエンドのアプリケーションは、コメントアウトされたコードにあります。
ko_kr: 여기서 우리는 에어(Aer) ``qasm_simulator`` 를 백엔드로 선택하고 커스텀 노이즈 모델도 추가한다. IBMQ에 의해 제공되는 실제 양자 백엔드의 애플리케이션은 주석 코드에 요약되어 있다.
pt_br: Aqui, escolhemos o ``qasm_simulator`` do Aer como serviço e também adicionamos um modelo de ruído personalizado. A aplicação de um serviço quântico real fornecido pelo IBMQ é delineada no código comentado.
ru_ru: Здесь мы выбираем Aer ``qasm_simulator`` в качестве бэкэнда, а также добавляем пользовательскую модель шума. Применение реального квантового бэкенда, предоставленного IBMQ, описано в прокомментированном коде.
ta_in: இங்கே, நாம் Aer ``qasm_simulator`` ஐ பின்தளமாக தேர்வு செய்கிறோம், மேலும் கஸ்டம் இரைச்சல் மாதிரி-யும் சேர்க்கிறோம். IBMQ வழங்கிய உண்மையான குவாண்டம் பின்தளத்தின் பயன்பாடு கருத்துக் குறியீட்டில் கோடிட்டுக் காட்டப்பட்டுள்ளது.
tr_tr: Burada arkayüzey olarak Aer ``qasm_simulator``ü seçiyoruz ve ayrıca özel bir gürültü modeli ekliyoruz. IBMQ tarafından sağlanan gerçek bir kuantum arkayüzey uygulaması, yorumlanan kodda ana hatlarıyla belirtilmiştir.
zh_tw: 在這裡，我們選擇 Aer 的 ``qasm_simulator``` 作為後端 (backend) 並添加自定義噪音模型。 IBMQ 所提供的實際量子後端的應用可以程式碼中評論找到。

source: Finally, we can run the algorithm and check the results.
bn_bn: এখন আমরা এলগোরিদমটির মহড়া শুরু করতে পারি এবং ফলাফল দেখতে পারি।
es_un: Finalmente, podemos ejecutar el algoritmo y verificar los resultados.
fr_fr: Enfin, nous pouvons exécuter l'algorithme et vérifier les résultats.
it_it: Infine, possiamo eseguire l'algoritmo e verificare i risultati.
ja_jp: 最後に、アルゴリズムを実行し、結果を確認することができます。
ko_kr: 마지막으로 알고리즘을 실행하여 결과를 확인할 수 있다.
pt_br: Por fim, podemos executar o algoritmo e verificar os resultados.
ru_ru: Наконец, мы можем запустить алгоритм и проверить результаты.
ta_in: இறுதியாக, நாம் வழிமுறையை இயக்கி முடிவுகளை சரிபார்க்கலாம்.
tr_tr: Son olarak, algoritmayı çalıştırıp sonuçları kontrol edebiliriz.
zh_tw: 最後，我們可以執行此演算法並檢查其結果。

source: Let us elaborate on the circuit names. We see that there are only four circuits, instead of eight. The total number of required circuits is :math:`2^m` where :math:`m` is the number of qubits in the larget subset (here :math:`m=2`).
it_it: Analizziamo i nomi dei circuiti. Notiamo che ci solo quattro circuiti, invece di otto. Il numero totale di circuiti necessari è :math:`2^m`, dove :math:`m` è il numero di qubit del sottoinsieme più grande (in questo caso :math:`m=2`).
ja_jp: 回路名について詳しく説明しましょう。8つの回路ではなく、4つの回路しかないことがわかります。必要な回路の総数は:math:`2^m`です。ここでの:math:`m`は、大きなサブセットの量子ビットの数です（ここでは m=2）。
pt_br: Vamos elaborar sobre os nomes dos circuitos. Vemos que há apenas quatro circuitos, em vez de oito. O número total de circuitos requeridos é de :math:`2^m` onde :math:`m` é o número de qubits no maior subconjunto (aqui :math:`m=2`).

source: Running Aqua Algorithms with Measurement Error Mitigation
it_it: Esecuzione degli Algoritmi di Aqua utilizzando la Mitigazione degli Errori di Misura
ja_jp: 測定エラーの軽減を用いたAquaのアルゴリズムの実行
pt_br: Executando Algoritmos do Aqua com Mitigação de Erros de Medição

source: To use measurement error mitigation when running quantum circuits as part of an Aqua algorithm, we need to include the respective measurement error fitting instance in the QuantumInstance. This object also holds the specifications for the chosen backend.
it_it: Per utilizzare la mitigazione degli errori di misura quando si eseguono circuiti quantistici come parte di un algoritmo Aqua, abbiamo bisogno di includere la rispettiva istanza di fitting dell'errore di misurazione nel QuantumInstance. Questo oggetto contiene anche le specifiche per il backend scelto.
ja_jp: Aqua のアルゴリズムの一部として量子回路を実行する際に測定エラーの軽減を使用するには、 QuantumInstance にそれぞれの測定エラーをフィッティングするインスタンスを含める必要があります。 このオブジェクトは、選択したバックエンドの仕様も保持します。
pt_br: Para usar a mitigação de erros de medição ao executar circuitos quânticos, como parte de um algoritmo Aqua, precisamos incluir a respectiva instância de ajuste de erro de medição em QuantumInstance. Este objeto também mantém as especificações para o processo interno 'backend' escolhido.

source: The following function **complete\_meas\_cal** returns a list **meas\_calibs** of ``QuantumCircuit`` objects containing the calibration circuits, and a list **state\_labels** of the calibration state labels.
ja_jp: 以下の関数 **complete\_meas\_cal** は、較正回路を含む``QuantumCircuit``オブジェクトのリスト **meas\_calibs** と、較正状態ラベルのリスト ** state\_labels** を返却します。
pt_br: A seguinte função **complete\_meas\_cal** retorna uma lista **meas\_calibs* de objetos ``QuantumCircuit`` contendo os circuitos de calibração e uma lista **state\_labels** dos rótulos dos estados de calibração.

source: **qubit\_list:** A list of qubits to perform the measurement correction on, or:
ja_jp: **qubit\_list:** 測定補正を実行する量子ビットのリスト、または:
pt_br: **qubit\_list:** Uma lista de qubits para realizar a correção de medição, ou:

source: Assume that we apply some noise model from Qiskit Aer to the 5 qubits, then the calibration matrix will have most of its mass on the main diagonal, with some additional 'noise'.
ja_jp: Qiskit Aer から5量子ビットに対し、何らかのノイズモデルをに適用するものと仮定すると、較正行列は主対角線上にほとんどをもちますが、'ノイズ' もあります。
pt_br: Suponha que aplicamos algum modelo de ruído do Qiskit Aer para os 5 qubits, então a matriz de calibração terá a maior parte de sua massa na diagonal principal, com algum 'ruído' adicional.

source: Since the on-diagonal elements of the calibration matrix are the probabilities of measuring state 'x' given preparation of state 'x', then the trace of this matrix is the average assignment fidelity.
ja_jp: 較正行列の対角要素は、状態'x'の準備を前提として状態'x'を測定する確率であり、この行列のトレースは平均割り当て忠実度です。
pt_br: Uma vez que os elementos na diagonal da matriz de calibração são as probabilidades de medir o estado 'x' ,dada a preparação do estado 'x', então, o traço desta matriz é a fidelidade média de atribuição.

source: There are two fitting methods for applying the calibration (if no method is defined, then 'least\_squares' is used). - **'pseudo\_inverse'**, which is a direct inversion of the calibration matrix, - **'least\_squares'**, which constrains to have physical probabilities.
ja_jp: 較正を適用するための２つのフィッティングメソッドがあります（メソッドが定義されていない場合は 'least\_squares' が使用されます）。 - **'pseudo\_inverse'** は較正行列の直接逆行列です。、 - **'least\_squares'** は物理的な確率をもつ制約です。
pt_br: Existem dois métodos de montagem para aplicação da calibração (se nenhum método for definido, então 'least\_squares' é usado). -**' pseudo\_inverse '**, que é uma inversão direta da matriz de calibração, -**' least\_squares' **, que restringe a ter probabilidades físicas.

source: Form1: A counts dictionary from results.get\_counts,
ja_jp: 形式1: results.get\_counts からのディクショナリ数。
pt_br: Forma 1: Um dicionário de contagens obtido da results.get\_counts,

source: Form2: A list of counts of length=len(state\_labels),
ja_jp: 形式2: length=len(state\_labels) による数のリスト。
pt_br: Forma 2: Uma lista de contagens de comprimento=len(state\_labels),

source: Form3: A list of counts of length=M\*len(state\_labels) where M is an integer (e.g. for use with the tomography data),
ja_jp: Form3: length=M\*len(state\_labels) のカウントリスト。ここでのMは整数(e.g. トモグラフィーデータと一緒に使うため),
pt_br: Forma 3: Uma lista de contagens de comprimento=M\*len(state\_labels) em que M é um número inteiro (por exemplo, para uso com os dados de tomografia),

source: Form4: A qiskit Result (e.g. results as above).
ja_jp: 形式4: Qiskitの結果 (e.g. 上記の結果)。
pt_br: Forma 4: Um Result do qiskit (por exemplo, resultados como acima).

source: The calibration can be simplified if the error is known to be local. By "local error" we mean that the error can be tensored to subsets of qubits. In this case, less than :math:`2^n` states are needed for the computation of the calibration matrix.
ja_jp: エラーが局所的であることがわかっている場合は、較正を簡略化できます。"局所的なエラー"とは、エラーを量子ビットのサブセットにテンソル化できることを意味します。この場合、より少ない:math:`2^n`状態は、較正行列の計算に必要となります。
pt_br: A calibração pode ser simplificada, se o erro é reconhecido como local. Por "erro local" queremos dizer que o erro pode ser tensor para subconjuntos de qubits. Neste caso, são necessários menos de :math:`2^n` estados para o cálculo da matriz de calibração.

source: Each basis state of qubits 3 and 4 appears exactly once. Only two basis states are required for qubit 2, so these are split equally across the four experiments. For example, state '0' of qubit 2 appears in state labels '000' and '010'.
ja_jp: 量子ビット3と4の各基底状態は1回だけ出現します。量子ビット2に必要な基底状態は2つだけなので、これらは4つの実験にわたって均等に分割されます。たとえば、量子ビット2の状態 '0' は、状態ラベル '000' と '010' で示されます。
pt_br: Cada estado base dos qubits 3 e 4 aparece, exatamente, uma vez. Apenas dois estados base são necessários para o qubit 2, portanto, estes são divididos, igualmente, através dos quatro experimentos. Por exemplo, o estado '0' do qubit 2 aparece nos rótulos dos estados '000' e '010'.

source: We now execute the calibration circuits on an Aer simulator, using the same noise model as before. This noise is in fact local to qubits 3 and 4 separately, but assume that we don't know it, and that we only know that it is local for qubit 2.
ja_jp: 今度は、以前と同じノイズモデルを使用して、Aerシミュレータで較正回路を実行します。実際、このノイズは量子ビット3と4それぞれに対して局所的ですが、それがわからないこと、および量子ビット2に対して局所的であることがわかっているものと仮定します。
pt_br: Agora, executamos os circuitos de calibração em um simulador Aer, usando o mesmo modelo de ruído de antes. Este ruído é de fato local para os qubits 3 e 4 separadamente, mas assumamos que não temos conhecimento disso, e que só sabemos que é local para o qubit 2.
