Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/3_measurement_error_mitigation.po
Languages: bn_bn, es_un, fr_fr, it_it, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: This page was generated from `tutorials/noise/3_measurement_error_mitigation.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/noise/9_entanglement_verification.ipynb`__-থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/noise/3_measurement_error_mitigation.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/noise/3_measurement_error_mitigation.ipynb`__.
it_it: Questa pagina è stata generata da `tutorials/noise/3_measurement_error_mitigation.ipynb`__.
ja_jp: 当ページは`tutorials/noise/3_measurement_error_mitigation.ipynb`__から生成されました。
ko_kr: 이 페이지는 `tutorials/noise/3_measurement_error_mitigation.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada, a partir do 'tutorials/noise/3_measurement_error_mitigation.ipynb'__.
ru_ru: Эта страница создана на основе `tutorials/noise/3_measurement_error_mitigation.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/noise/3_measurement_error_mitigation.ipynb`__ யில் உருவாக்கப்பட்டது.
tr_tr: Bu sayfa `tutorials/noise/3_measurement_error_mitigation.ipynb`__ adresinden oluşturuldu.
zh_tw: 此頁面是從 `tutorials/noise/3_measurement_error_mitigation.ipynb`__ 產生的。

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/3_measurement_error_mitigation.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/3_measurement_error_mitigation.ipynb>`_.
it_it: Esegui in maniera interattiva su `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/3_measurement_error_mitigation.ipynb>`_.
zh_tw: 在 `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/3_measurement_error_mitigation.ipynb>`_中互動執行。

source: Measurement Error Mitigation
bn_bn: জাত ফলাফল ত্রুটি প্রশমিতকরণ
es_un: Mitigación de Errores de Medición
fr_fr: Atténuation des Erreurs de Mesure
it_it: Mitigazione degli Errori di Misurazione
ja_jp: 測定エラーの軽減
ko_kr: 측정 에러 완화(mitigation)
pt_br: Mitigação de Erros de Medição
ru_ru: Уменьшение ошибок измерения
ta_in: அளவீட்டுப் பிழை குறைத்தல்
tr_tr: Ölçüm Hatası Azaltma
zh_tw: 測量誤差緩解

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
it_it: Introduzione
ja_jp: はじめに
ko_kr: 소개
pt_br: Introdução
ru_ru: Введение
ta_in: முன்னுரை
tr_tr: Giriş
zh_tw: 簡介

source: The measurement calibration is used to mitigate measurement errors. The main idea is to prepare all :math:`2^n` basis input states and compute the probability of measuring counts in the other basis states. From these calibrations, it is possible to correct the average results of another experiment of interest. This notebook gives examples for how to use the ``ignis.mitigation.measurement`` module.
bn_bn: পরিমাপ ক্রমাঙ্কন (ক্যালিব্রেশন) ব্যবহার করে পরিমাপত্রুটি প্রশমিত করা সম্ভব। এই ত্রুটি প্রশমনে প্রথমে সকল ইনপুট মান বা অবস্থা কে :math:`2^n` বেসিস বা ভিত্তি তে হিসাব করা হয় এবং অন্য আরেকটি বেসিস বা ভিত্তিতে তার সম্ভাবনার মান হিসাব করা হয়। এই ধরণের ক্রমাঙ্কন (ক্যালিব্রেশন) থেকে সঠিক মান হিসাব করা সম্ভব। কিভাবে ``ignis.mitigation.measurement`` মডিউল ব্যবহার করে এই কার্য সম্পাদন করা যায় তা এই জুপিটার নোটবুকে উদাহরন সহ দেখানো হবে।
es_un: La calibración de medición se utiliza para mitigar los errores de medición. La idea principal es preparar todos los :math:`2^n` estados base de entrada y calcular la probabilidad de medir los recuentos en los otros estados base. A partir de estas calibraciones, es posible corregir los resultados promedio de otro experimento de interés. Este cuaderno da ejemplos de cómo utilizar el módulo ``ignis.mitigation.measurement``.
fr_fr: La calibration de mesure est utilisée pour atténuer les erreurs de mesure. L'idée principale est de préparer tous les états d'entrée de base de :math:`2^n` et de calculer la probabilité de comptage dans les autres états de base. À partir de ces étalonnages, il est possible de corriger les résultats moyens d'un autre test d'intérêt. Ce bloc-notes donne des exemples d'utilisation du module ``ignis.mitigation.measurement``.
it_it: La calibrazione della misura viene utilizzata per mitigare gli errori di misurazione. L'idea di base è quella di preparare tutti i :math:`2^n` stati di base in input e calcolare la probabilità di misurare i conteggi negli altri stati di base. Grazie a queste calibrazioni, si possono correggere i risultati medi di un altro esperimento di interesse. Questo notebook fornisce degli esempi su come utilizzare il modulo ``ignis.mitigation.measurement``.
ja_jp: 測定較正は、測定エラーを軽減するために使用されます。 主なアイデアは、すべての:math:`2^n`基底入力状態を準備し、他の基底状態での測定数の確率を計算することです。これらの較正により、関心のある別の実験の平均結果を修正することができます。このノートブックは、``ignis.mitigation.measurement``モジュールの使用例を示します。
ko_kr: 측정 교정은 측정 오류를 완화하기 위해 사용된다. 주요 아이디어는 모든 :math:`2^n` 기저 입력 상태를 준비하고 다른 기저 상태에서의 측정 카운트 확률을 계산하는 것이다. 이러한 교정을 사용해 보정을 적용하고자 하는 실험의 평균 결과를 수정할 수 있다. 이 노트북은 ``ignis.mitigation.measurement`` 모듈을 사용하는 방법에 대한 예를 제공한다.
pt_br: A calibração de medição é usada para mitigar erros de medição. A ideia principal é preparar todos os :math:`2^n` estados base da entrada e computar a probabilidade de medir contagens nos outros estados base. A partir destas calibrações, é possível corrigir os resultados médios de outro experimento de interesse. Este notebook dá exemplos de como usar o módulo ``ignis.mitigation.measurement``.
ru_ru: С помощью калибровки измерений можно уменьшить ошибки измерений. Основная идея заключается в подготовке всех базисных входных состояний :math:`2^n` и вычислении вероятности измерения в других базисных состояниях. На основе этих калибровок можно скорректировать средние результаты другого интересующего эксперимента. В этом блокноте приведены примеры использования модуля ``ignis.mitigation.measurement``.
ta_in: அளவீட்டு பிழைகள் குறைக்க அளவீட்டு அளவொப்புமை பயன்படுத்தப்படுகிறது. அனைத்து :math:`2^n` அடிப்படை உள்ளீட்டு நிலைகளையும் தயார் செய்வதும், பிற அடிப்படை நிலைகளில் எண்ணிக்கையை அளவிடுவதற்கான நிகழ்தகவைக் கணக்கிடுவதும் முக்கிய யோசனை. இந்த அளவொப்புமை, ஆர்வத்தின் மற்றொரு பரிசோதனையின் சராசரி முடிவுகளையும் சரிசெய்ய முடியும். இந்த குறிப்பேடு ``ignis.mitigation.measurement`` தொகுதியை எவ்வாறு பயன்படுத்துவது என்பதற்கான எடுத்துக்காட்டுகளை வழங்குகிறது.
tr_tr: Ölçüm kalibrasyonu, ölçüm hatalarını azaltmak için kullanılır. Ana fikir tüm :math:`2^n` temel giriş durumlarını hazırlamak ve diğer temel durumlardaki sayıların ölçüm olasılığını hesaplamaktır. Bu kalibrasyonlardan, ilgilenilen başka bir deneyin ortalama sonuçlarını düzeltmek mümkündür. Bu not defteri ``ignis.mitigation.measurement`` modülünün nasıl kullanılacağına ilişkin örnekler verir.
zh_tw: 測量校準是用來減輕測量誤差。 主要的想法是準備所有 :math:"2^n" 基底輸入狀態並計算其他基底狀態下測量數的概率。 從這些校準中，可以更正另一個感興趣的實驗的平均結果。 此記事本提供範例，說明如何使用 ``ignis.mitigation.measurement`` 模組。

source: 3 Qubit Example of the Calibration Matrices
bn_bn: ৩ কিউবিট ক্রমাঙ্কন (ক্যালিব্রেশন) ম্যাটিক্স নির্ণয় উদাহরণ
es_un: Ejemplo de 3 Qubits de las Matrices de Calibración
fr_fr: Exemple des Matrices de Calibration pour 3 Qubits
it_it: Esempio di Matrici di Calibrazione per 3 Qubit
ja_jp: 3量子ビットの較正行列の例
ko_kr: Calibration 행렬의 세 큐비트 예
pt_br: Exemplo para 3 Qubits das Matrizes de Calibração
ru_ru: Пример Матрицы Калибровки для трех кубитов
ta_in: அளவொப்புமை மெட்ரிக்ஸின் 3 க்யூபிட் எடுத்துக்காட்டு
tr_tr: Kalibrasyon Matrislerinin 3 Kübitli Örneği
zh_tw: 3 量子位元範例（校準矩陣）

source: Assume that we would like to generate a calibration matrix for the 3 qubits Q2, Q3 and Q4 in a 5-qubit Quantum Register [Q0,Q1,Q2,Q3,Q4].
bn_bn: এই উদাহরনে তিনটি কিউবিট যথাক্রমে Q2, Q3 এবং Q4 এর জন্য কিভাবে একটি ৫-কিউবিট কোয়ান্টাম রেজিস্টার [Q0,Q1,Q2,Q3,Q4] এ ক্রমাঙ্কন (ক্যালিব্রেশন) ম্যাট্রিক্স নির্ণয় করা যায় তা দেখানো হবে।
es_un: Suponga que nos gustaría generar una matriz de calibración para los 3 qubits Q2, Q3 y Q4 en un registro cuántico de 5 qubits [Q0, Q1, Q2, Q3, Q4].
fr_fr: Supposons que nous voulions générer une matrice d'étalonnage pour les 3 qubits Q2, Q3 et Q4 dans un registre Quantum 5 qubit [Q0,Q1,Q2,Q3,Q4].
it_it: Supponiamo di voler generare una matrice di calibrazione per i 3 qubit Q2, Q3 e Q4 che fanno parte di un registro quantistico a 5 qubit [Q0,Q1,Q2,Q3,Q4].
ja_jp: 5量子ビットの量子レジスタ [Q0,Q1,Q2,Q3,Q4] のうち、3つの量子ビット Q2、Q3 および Q4 の較正行列を生成するとします。
ko_kr: 5-큐비트 양자 레지스터 [Q0, Q1, Q2, Q3, Q4] 에서 3개의 큐비트 (Q2, Q3및 Q4) 에 대한 교정 행렬을 생성한다고 가정한다.
pt_br: Suponha que gostaríamos de gerar uma matriz de calibração para os 3 qubits Q2, Q3 e Q4 em um Registrador Quântico de 5 qubits [Q0,Q1,Q2,Q3,Q4].
ru_ru: Предположим, что мы хотим создать калибровочную матрицу для трех кубитов Q2, Q3 и Q4 в 5-кубитном квантовом регистре [Q0,Q1,Q2,Q3,Q4].
ta_in: 5-க்யூபிட் குவாண்டம் பதிவேட்டில் [Q0, Q1, Q2, Q3, Q4], 3 க்யூபிட்ஸ் Q2, Q3 மற்றும் Q4 க்கான அளவொப்புமை மேட்ரிக்ஸை உருவாக்க விரும்புகிறோம் என்று வைத்துக் கொள்ளுங்கள்.
tr_tr: 5 kübitlik [Q0, Q1, Q2, Q3, Q4] Kuantum Yazmacında Q2, Q3 ve Q4 için 3 kübitlik bir kalibrasyon matrisi oluşturmak istediğimizi varsayın.
zh_tw: 假設我們要為五量子位元暫存器 [Q0,Q1,Q2,Q3,Q4] 中的三個量子位元Q2、Q3 和 Q4 生成校準矩陣。

source: Since we have 3 qubits, there are :math:`2^3=8` possible quantum states.
bn_bn: যেহেতু আমাদের কাছে তিনটি কিউবিট আছে, তাই এই কোয়ান্টাম মান বা অবস্থা হবে :math:`2^3=8` টি।
es_un: Como tenemos 3 qubits, hay :math:`2^3=8` estados cuánticos posibles.
fr_fr: Puisque nous avons 3 qubits, il y a :math:`2^3=8` états quantiques possibles.
it_it: Dato che abbiamo 3 qubit, esistono :math:`2^3=8` stati quantistici possibili.
ja_jp: 3つの量子ビットがあるため、:math:`2^3=8` 通りの量子状態が存在します。
ko_kr: 세 큐비트을 다루기 때문에 가능한 양자 상태는 :math:`2^3=8`개의 가능한 양자 상태가 있다.
pt_br: Uma vez que temos 3 qubits, existem :math:`2^3=8` possíveis estados quânticos.
ru_ru: Поскольку у нас есть 3 кубита, существует :math:`2^3=8` возможных квантовых состояний.
ta_in: நம்மிடம் 3 க்யூபிட்ஸ் இருப்பதால், அதில் :math:`2^3=8` சாத்தியமான குவாண்டம் நிலைகள் உள்ளன.
tr_tr: 3 kübitimiz olduğundan, :math:`2^3=8` olası kuantum durum var.
zh_tw: 由於我們有 3 個量子位元，所以有 :math:`2^3=8` 種可能的量子態。

source: Generating Measurement Calibration Circuits
bn_bn: পরিমাপ ক্রমাঙ্কন (ক্যালিব্রেশন) যুক্তিবর্তনী
es_un: Generación de Circuitos de Calibración de Medición
fr_fr: Génération de Circuits d'Etalonnage de Mesure
it_it: Generazione dei Circuiti di Calibrazione della Misura
ja_jp: 測定較正回路の生成
ko_kr: 측정 보정(Calibration) 회로 만들기
pt_br: Gerando Circuitos De Calibração De Medição
ru_ru: Генерация цепей для калибровки измерений
ta_in: அளவீட்டு அளவொப்புமை சர்க்யூட்களை உருவாக்குதல்
tr_tr: Ölçüm Kalibrasyon Devreleri Üretme
zh_tw: 產生測量校準電路

source: First, we generate a list of measurement calibration circuits for the full Hilbert space. Each circuit creates a basis state. If there are :math:`n=3` qubits, then we get :math:`2^3=8` calibration circuits.
bn_bn: প্রথমত, আমরা হিলবার্ট স্পেসে একটি পরিমাপ ক্রমাঙ্কন (ক্যালিব্রেশন) বর্তনী (সার্কিট) তালিকা তৈরি করব। প্রতিটা বর্তনী একটি বেসিস বা ভিত্তি মান বা অবস্থা দিবে। যেমন :math:`n=3` কিউবিটের জন্য :math:`2^3=8` টই ক্রমাঙ্কন (ক্যালিব্রেশন) বর্তনী (সার্কিট) হবে।
es_un: Primero, generamos una lista de circuitos de calibración de medición para todo el espacio de Hilbert. Cada circuito crea un estado base. Si hay :math:`n=3` qubits, obtenemos :math:`2^3=8` circuitos de calibración.
fr_fr: D'abord, nous générons une liste de circuits d'étalonnage de mesure pour l'espace complet de Hilbert. Chaque circuit crée un état de base. S'il y a :math:`n=3` qubits, alors nous obtenons :math:`2^3=8` circuits de calibration.
it_it: Per prima cosa, generiamo una lista di circuiti di calibrazione della misura per l'intero spazio di Hilbert. Ogni circuito andrà a creare uno stato di base. Avendo :math:`n=3` qubit, otterremo quindi :math:`2^3=8` circuiti di calibrazione.
ja_jp: まず、ヒルベルト空間全体に対する測定較正回路のリストを生成します。 それぞれの回路は基底状態を生成します。:math:`n=3` 量子ビットがある場合、:math:`2^3=8`通りの較正回路が得られます。
ko_kr: 먼저, 전체 힐버트 공간에 대한 측정 교정 회로 목록을 생성한다. 각 회로는 기저 상태를 생성한다. 만일 :math:`n=3` 큐비트가 있다면, :math:`2^3=8` 개의 교정 회로를 얻게 된다.
pt_br: Primeiro, geramos uma lista de circuitos de calibração de medição para o todo o espaço de :math:Hilbert. Cada circuito cria um estado base. Se houver :math:`n=3` qubits, então obtemos :math:`2^3=8` circuitos de calibração.
ru_ru: Сначала мы генерируем список цепей калибровки измерений для полного гильбертова пространства. Каждая цепь создает базисное состояние. Если имеется :math:`n=3` кубита, то мы получаем :math:`2^3=8` калибровочных цепей.
ta_in: முதலில், முழு ஹில்பர்ட் வெளியீட்டு அளவீட்டு அளவொப்புமை சர்கூட்களின் பட்டியலை உருவாக்குகிறோம். ஒவ்வொரு சர்கூட்டும் ஒரு அடிப்படை நிலையை உருவாக்குகிறது. இங்கு :math:`n=3` க்யூபிட்ஸ் இருந்தால், நாம் :math:`2^3=8` அளவொப்புமை சர்கூட்கள் பெறுகிறோம்.
tr_tr: İlk olarak, tüm Hilbert uzayı için bir ölçüm kalibrasyon devresi listesi üretiyoruz. Her devre bir temel durum oluşturur. Eğer :math:`n=3` kübit varsa, o zaman :math:`2^3=8` kalibrasyon devresi elde ederiz.
zh_tw: 首先，我們會為完全希爾伯特空間生成測量校準電路的清單。 每個電路都會建立一個基底狀態。 如果有 :math:`n=3` 個量子位元，則我們可以得到 :math:`2^3=8` 校準電路。

source: The following function **complete_meas_cal** returns a list **meas_calibs** of ``QuantumCircuit`` objects containing the calibration circuits, and a list **state_labels** of the calibration state labels.
bn_bn: **complete_meas_cal** ফাংশনটি একটি **meas_calibs** নামে ``QuantumCircuit`` এর তালিকা ফলাফল দেয়। এই ``QuantumCircuit`` অবজেক্ট এ ক্রমাঙ্কন (ক্যালিব্রেশন) বর্তনী (সার্কিট) এবং ক্রমাঙ্কন (ক্যালিব্রেশন) মান বা অবস্থা নাম (লেবেল) এর **state_labels** তালিকা থাকে।
es_un: La siguiente función **complete_meas_cal** devuelve una lista **meas_calibs** de objetos ``QuantumCircuit`` que contienen los circuitos de calibración y una lista **state_labels** con las etiquetas de estado de calibración.
fr_fr: La fonction suivante **complete\_meas\_cal** renvoie une liste **meas_calibs** des objets ``QuantumCircuit`` contenant les circuits d'étalonnage, et une liste **state\_labels** des étiquettes d'état d'étalonnage.
it_it: La seguente funzione **complete_meas_cal** restituisce una lista **meas_calibs** di oggetti ``QuantumCircuit`` contenenti i circuiti di calibrazione, e una lista **state_labels** delle etichette dello stato di calibrazione.
ko_kr: 다음 기능 **complete\_meas\_cal** 은 교정 회로를 포함하는 ``QuantumCircuit`` 오브젝트의 **meas\_calibs** 목록과 교정 상태 라벨의 **state\_labels** 목록을 반환한다.
ru_ru: Функция **complete_meas_cal** возвращает список **meas_calibs** объектов ``QuantumCircuit``, содержащих калибровочные цепи, и список **state_labels** меток калибровочных состояний.
ta_in: பின்வரும் செயல்பாடு **complete_meas_cal** அளவொப்புமை சர்க்யூட்கள் கொண்ட ``QuantumCircuit`` பொருட்களின் **meas_calibs** மற்றும் அளவுத்திருத்த நிலை லேபிள்களின் **நிலை_அடையாளக் குறியீடு** ஆகியவற்றை வழங்குகிறது.
tr_tr: Aşağıdaki fonksiyon **complete_meas_cal** kalibrasyon devrelerini içeren ``QuantumCircuit`` nesnelerinin bir **meas_calibs** listesini ve kalibrasyon durumu etiketlerinin bir **state_labels** listesini döndürür.
zh_tw: 下列函數 **complete_meas_cal** 會傳回包含校準電路的 ``QuantumCircuit`` 物件清單**meas_calibs**，以及校準狀態標籤的序列 **state_labels** 。

source: The input to this function can be given in one of the following three forms:
bn_bn: এই ফাংশনের ইনপুট যা যা হতে পারে:
es_un: La entrada a esta función se puede dar en una de las siguientes tres formas:
fr_fr: L'entrée de cette fonction peut être donnée dans l'une des trois formes suivantes:
it_it: L'input a questa funzione può essere passato in uno dei tre seguenti formati:
ja_jp: この関数への入力は、以下の3つの形式のいずれかで指定することができます。
ko_kr: 이 함수의 입력 값은 다음 세 가지 형태 중 하나로 제공된다:
pt_br: A entrada para esta função pode ser dada em uma das três formas, a seguir:
ru_ru: Входные данные для этой функции могут быть заданы тремя способами:
ta_in: இந்த செயல்பாட்டிற்கான உள்ளீட்டை பின்வரும் மூன்று வடிவங்களில் ஒன்றில் கொடுக்கலாம்:
tr_tr: Bu işlevin girdisi aşağıdaki üç formdan birinde verilebilir:
zh_tw: 此函數的輸入可以用下列三種格式的其中一種方式來提供：

source: **qubit_list:** A list of qubits to perform the measurement correction on, or:
bn_bn: **qubit_list:** একটি কিউবিট তালিকা যা পরিমাপ ক্রুটি সংশোধন করবে:
es_un: **qubit_list:** Una lista de qubits a los cuales se les realiza la corrección de medición, o:
fr_fr: ** qubit_list:** Une liste de qubits sur lesquels effectuer la correction de mesure sur, ou :
it_it: **qubit_list:** Una lista di qubit su cui effettuare la correzione di misura, o:
ko_kr: **qubit\_list:** 측정 보정을 수행할 큐비트의 목록 또는:
ru_ru: **qubit_list:** Список кубитов, на которых будет проводится коррекция измерения:
ta_in: **க்யூபிட்_list:** அளவீட்டு திருத்தம் செய்ய க்யூபிட்ஸ்-களின் பட்டியல், அல்லது:
tr_tr: **qubit_list:** Ölçüm düzeltmesinin gerçekleştirileceği kübitlerin listesi, ya da:
zh_tw: **qubit_list:** 是要對以下執行測量更正的量子位元清單，或：

source: **qr (QuantumRegister):** A quantum register, or:
bn_bn: **qr (QuantumRegister):** একটি কোয়ান্টাম রেজিস্টার:
es_un: **qr (QuantumRegister):** Un registro cuántico, o:
fr_fr: **qr (QuantumRegister):** Un registre quantique, ou:
it_it: **qr (QuantumRegister):** Un registro quantistico, o:
ja_jp: **qr (QuantumRegister):** 量子レジスタ、または:
ko_kr: **qr (QuantumRegister):** 양자 레지스터, 또는:
pt_br: **qr (QuantumRegister):** Um registrador quântico, ou:
ru_ru: **qr (QuantumRegister):** Квантовый регистр:
ta_in: **qr (QuantumRegister):** ஒரு குவாண்டம் ரெஜிஸ்டர், அல்லது:
tr_tr: **qr (QuantumRegister):** Bir kuantum yazmacı veya:
zh_tw: **qr (QuantumRegister):** 一個量子暫存器，或：

source: **cr (ClassicalRegister):** A classical register.
bn_bn: **cr (ClassicalRegister):** একটি ক্লাসিকাল রেজিস্টার।
es_un: **cr (ClassicalRegister):** Un registro clásico.
fr_fr: **cr (ClassicalRegister):** Un registre classique.
it_it: **cr (ClassicalRegister):** Un registro classico.
ja_jp: **cr (ClassicalRegister):** 古典レジスタ。
ko_kr: **cr (ClassicalRegister):** 고전적(classical) 레지스터
pt_br: **cr (ClassicalRegister):** Um registro clássico.
ru_ru: **cr (ClassicalRegister):** Классический регистр.
ta_in: **cr (ClassicalRegister):** ஒரு கிளாசிக்கல் பதிவீடு.
tr_tr: **cr (ClassicalRegister):** Bir klasik yazmaç.
zh_tw: **cr (ClassicalRegister):** 一個經典暫存器。

source: In addition, one can provide a string **circlabel**, which is added at the beginning of the circuit names for unique identification.
bn_bn: **circlabel** এই স্ট্রিং টি বর্তনী (সার্কিট) নামের শুরুতে ব্যবহার করা যাতে পারে একক পরিচয়ধারী বর্তনীর জন্য।
es_un: Además, se puede proporcionar una cadena de caracteres **circlabel**, que se agrega al comienzo de los nombres de los circuitos para una identificación única.
fr_fr: En outre, on peut fournir une chaîne de caractères **cerclabel**, qui est ajoutée au début des noms de circuits pour une identification unique.
it_it: Inoltre, è possibile fornire al metodo una stringa **circlabel**, che viene aggiunta all'inizio del nome del circuito per una identificazione univoca.
ja_jp: さらに、一意に識別するため回路名の先頭に追加される文字列 **circlabel** を提供することもできます。
ko_kr: 또한 고유 식별을 위해 회로 이름의 시작 부분에 문자열 **circlabel** 을 추가할 수 있다.
pt_br: Além disto, pode-se fornecer uma string **circlabel**, que é adicionada no início dos nomes dos circuitos para identificação única.
ru_ru: Кроме того, можно указать параметр **circlabel**, который добавляется в начало названий цепей для их уникальной идентификации.
ta_in: கூடுதலாக, ஒருவர் ஒரு ஸ்ட்ரிங் **circlabel**-ஐ வழங்க முடியும், இது தனிப்பட்ட அடையாளங்களுக்காக சர்கூட் பெயர்களின் தொடக்கத்தில் சேர்க்கப்படுகிறது.
tr_tr: Buna ek olarak, benzersiz tanımlama için devre adlarının başına eklenen bir **circlabel** dizgi de sağlanabilir.
zh_tw: 此外，我們還可以提供一個字串 **circlabel**，它會被新增在電路名稱的開頭，以進行唯一識別。

source: For example, in our case, the input is a 5-qubit ``QuantumRegister`` containing the qubits Q2,Q3,Q4:
bn_bn: যেমন, এই ক্ষেত্রে ইনপুট হচ্ছে একটি ৫-কিউবিট ``QuantumRegister`` যার কিউবিট নাম হচ্ছে Q2,Q3,Q4:
es_un: Por ejemplo, en nuestro caso, la entrada es un ``QuantumRegister`` de 5 qubits que contiene a los qubits Q2, Q3, Q4:
fr_fr: Par exemple, dans notre cas, l'entrée est un ``QuantumRegister`` à 5-qubit contenant les qubits Q2,Q3,Q4 :
it_it: Per esempio, nel nostro caso, l'input è un ``QuantumRegister`` a 5 qubit contenente i qubit Q2, Q3, Q4:
ja_jp: 例えば、今回のケースにおける入力は、量子ビットQ2、Q3、Q4を含む5量子ビットの``QuantumRegister``になります。:
ko_kr: 예를 들어, 이 튜토리얼에서는 Q2, Q3, Q4를 포함하는 5 큐비트 ``QuantumRegister`` 라고 할 수 있다.
pt_br: Por exemplo, no nosso caso, a entrada é um ``QuantumRegister`` de 5 qubits contendo os qubits Q2, Q3, Q4:
ru_ru: Например в нашем случае на вход подается 5-кубитный ``QuantumRegister``, содержащий кубиты Q2, Q3, Q4:
ta_in: எடுத்துக்காட்டாக, நம் விஷயத்தில், உள்ளீடு என்பது 5-qubit ``QuantumRegister`` என்பது Q2, Q3, Q4 ஆகிய qubit-களைக் கொண்டுள்ளது:
tr_tr: Örneğin, bizim durumumuzda, girdi Q2, Q3, Q4 kübitlerini içeren 5-kübit ``QuantumRegister`` dir:
zh_tw: 例如，在此情況中，輸入是一個包含量子位元Q2, Q3和Q4的五量子位元的 ``QuantumRegister``:

source: Print the :math:`2^3=8` state labels (for the 3 qubits Q2,Q3,Q4):
bn_bn: তিনটি কিউবিট স্টেটের জন্য :math:`2^3=8` মান বা অবস্থা নাম (লেবেল) প্রিন্ট কর:
es_un: Imprimir las :math:`2^3=8` etiquetas de estado (para los 3 qubits Q2, Q3, Q4):
fr_fr: Imprime les étiquettes d'état :math:`2^3=8` (pour les 3 qubits Q2,Q3,Q4):
it_it: Visualizziamo le etichette per i :math:`2^3=8` stati (per i 3 qubit Q2,Q3,Q4):
ja_jp: :math:`2^3=8` の状態ラベル(Q2、Q3、Q4の3量子ビット)を出力します。:
ko_kr: :math:`2^3=8` 상태 레이블을 출력한다 (Q2, Q3, Q4의 세 큐비트의 레이블):
pt_br: Imprimindo os :math:`2^3=8` rótulos de estado (para os 3 qubits Q2,Q3,Q4):
ru_ru: Выводим :math:`2^3=8` меток состояний (для 3 кубитов: Q2, Q3, Q4):
ta_in: :math:`2^3=8` நிலை அடையாளக் குறியீடுகளை அச்சிட வேண்டும் (3 qubit-களுக்கு Q2, Q3, Q4):
tr_tr: Yazdır :math:`2^3=8` durum etiketleri (3 kübit Q2, Q3, Q4 için):
zh_tw: 列印 :math:`2^3=8` 狀態標籤（對應於其3量子位元Q2,Q3,Q4）：

source: Computing the Calibration Matrix
bn_bn: ক্রমাঙ্কন (ক্যালিব্রেশন) ম্যাট্রিক্স হিসাব
es_un: Calcular la Matriz de Calibración
fr_fr: Calcul de la Matrice d'Etalonnage
it_it: Calcolare la Matrice di Calibrazione
ja_jp: 較正行列の計算
ko_kr: 교정 행렬 계산
pt_br: Computando a Matriz de Calibração
ru_ru: Вычисление Калибровочной Матрицы
ta_in: அளவொப்புமை மேட்ரிக்ஸைக் கணக்கிடு
tr_tr: Kalibrasyon Matrisini Hesaplama
zh_tw: 計算校準矩陣

source: If we do not apply any noise, then the calibration matrix is expected to be the :math:`8 \times 8` identity matrix.
bn_bn: কোন নয়েজ প্রয়োগ না হলে, ক্রমাঙ্কন (ক্যালিব্রেশন) ম্যাট্রিক্সের মাত্রা হবে :math:`8 \times 8` অভেদক ম্যাট্রিক্স।
es_un: Si no aplicamos ningún ruido, se espera que la matriz de calibración sea la matriz de identidad de :math:`8 \times 8`.
fr_fr: Si nous n'appliquons aucun bruit, alors la matrice d'étalonnage devrait être la matrice d'identité :math:`8 \times 8`.
it_it: Se non applichiamo alcun rumore, allora la matrice di calibrazione aspettata deve essere la matrice identità :math:`8 \times 8`.
ja_jp: ノイズを適用しない場合、較正行列は :math:`8 \times 8` の単位行列であることが期待されます。
ko_kr: 노이즈를 적용하지 않으면 교정 행렬은 :math:`8 \times 8` 단위 행렬이 될 것으로 예상된다.
pt_br: Se não aplicarmos nenhum ruído, espera-se, então, que a matriz de calibração seja a matriz identidade :math:`8 \times 8`.
ru_ru: Если мы не вносим никакого шума, то ожидается, что калибровочная матрица будет единичной матрицей :math:`8 \times 8`.
ta_in: நாங்கள் எந்த இரைச்சலையும் பயன்படுத்தாவிட்டால், அளவொப்புமை மேட்ரிக்ஸ் :math:`8 \times 8` அடையாளம் மேட்ரிக்ஸ் என்று எதிர்பார்க்கப்படுகிறது.
tr_tr: Eğer herhangi bir gürültü uygulamazsak o zaman kalibrasyon matrisinin :math:`8 \times 8` birim matris olması beklenir.
zh_tw: 如果我們不添加任何雜訊，那麽校準矩陣應等於 :math:`8 \times 8` 單位矩陣。
