Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/3_measurement_error_mitigation.po
Languages: bn_bn, es_un, fr_fr, it_it, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: The calibration can be simplified if the error is known to be local. By “local error” we mean that the error can be tensored to subsets of qubits. In this case, less than :math:`2^n` states are needed for the computation of the calibration matrix.
bn_bn: ক্রমাঙ্কন (ক্যালিব্রেশন) বর্তনী সরলীকরন সম্ভব যদি ক্রুটিটি স্থানীয় বা লোকাল হয়। এখানে “local error” বা স্থানীয় ক্রুটি বলতে বুঝানো হয়েছে ক্রুটিটি কিউবিটের সাবসেট দ্বারা টেনসর করা সম্ভব। এই ক্ষেত্রে, ক্রমাঙ্কন (ক্যালিব্রেশন) ম্যাট্রিক্স তৈরি করতে :math:`2^n` এর চেয়ে কম সংখ্যক কিউবিট দশা প্রয়োজন।
es_un: La calibración se puede simplificar si se sabe que el error es local. Por “local error” queremos decir que el error puede ser tensorizado a subconjuntos de qubits. En este caso, se necesitan menos de :math:`2^n` estados para el cálculo de la matriz de calibración.
fr_fr: La calibration peut être simplifiée si l'erreur est connue pour être locale. Par "erreur locale", nous entendons que l'erreur peut être localisée à des sous-ensembles de qubits. Dans ce cas, moins de :math:`2^n` états sont nécessaires pour le calcul de la matrice d'étalonnage.
it_it: Se l'errore è locale, la calibrazione può essere semplificata. Con "errore locale" si intende un errore che può essere indicizzato (in maniera tensoriale) su un sottoinsieme di qubit. In questo caso quindi, sono necessari meno di :math:`2^n` stati per il calcolo della matrice di calibrazione.
ko_kr: 오류가 로컬인 것으로 알려져 있는 경우 교정을 단순화할 수 있습니다. "로컬 오류" 는 오류가 하위의 서브세트에 연결될 수 있음을 의미한다. 이 경우에, :math:`2^n` 미만의 상태가 교정 행렬의 계산에 필요하다.
ru_ru: Калибровка может быть упрощена, если известно, что ошибка является локальной. Под “локальной ошибкой” мы имеем в виду то, что ошибка может быть определена для подмножества кубитов. В этом случае для вычисления калибровочной матрицы требуется менее :math:`2^n` состояний.
ta_in: பிழை லோக்கல் என்று தெரிந்தால் அளவுத்திருத்தத்தை எளிமைப்படுத்தலாம். “local error” என்பதன் மூலம் பிழையை க்யூபிட்ஸ்-களின் துணைக்குழுக்களுக்கு மாற்றலாம். இந்த வழக்கில், அளவொப்புமை மேட்ரிக்ஸின் கணக்கீட்டிற்கு :math:`2^n` க்கும் குறைவான நிலைகளே தேவைப்படுகின்றன.
tr_tr: Hatanın yerel olduğu biliniyorsa kalibrasyon basitleştirilebilir. “local error” ile hatanın kübitlerin alt kümelerine tensörlenebileceğini kastediyoruz. Bu durumda, kalibrasyon matrisinin hesaplanması için :math:`2^n` den daha az durum gereklidir.
zh_tw: 如果其誤差為本端(local)，則其校準可被簡化。 “local error” 的意思是，其誤差可以被張量化到該量子位元集合的子集。 在此情況下，對校準矩陣的計算只需要小於 :math:`2^n` 個狀態。

source: Assume that the error acts locally on qubit 2 and the pair of qubits 3 and 4. Construct the calibration circuits by using the function ``tensored_meas_cal``. Unlike before we need to explicitly divide the qubit list up into subset regions.
bn_bn: এখন ধরে নিচ্ছি, কিউবিট ২ এবং কিউবিট ৩ এবং ৪ জোড়ের মধ্যে কোন ক্রুটি পাওয়া গেল। এই ক্রুটি সংশোধনের জন্য একটি ক্রমাঙ্কন (ক্যালিব্রেশন) বর্তনী (সার্কিট) তৈরি করতে হবে ``tensored_meas_cal`` এই ফাংশনটি ব্যবহার করে। পুর্বের মত কিউবিট গুলোকে তাদের সাবসেট রিজিওনে বন্টিত করার কোন প্রয়োজন নেই।
es_un: Suponga que el error actúa localmente en el qubit 2 y en el par de qubits 3 y 4. Construya los circuitos de calibración usando la función ``tensored_meas_cal``. A diferencia de antes, necesitamos dividir explícitamente la lista de qubits en regiones de subconjuntos.
fr_fr: Supposons que l'erreur agit localement sur qubit 2 et la paire de qubits 3 et 4. Construire les circuits d'étalonnage en utilisant la fonction ``tensored_meas_cal``. Contrairement au précédent, nous avons besoin de diviser explicitement la liste de qubit en des sous régions.
it_it: Assumiamo che l'errore agisca localmente sul qubit 2 e sulla coppia di qubit 3 e 4. Costruiamo i circuiti di calibrazione utilizzando la funzione ``tensored_meas_cal``. A differenza dell'esempio precedente, è necessario suddividere esplicitamente la lista di qubit in sotto regioni.
ja_jp: エラーは量子ビット2と、量子ビット3と4のペアに対して局所的に作用すると仮定します。``tensored_meas_cal``関数を使用して、較正回路を構築します。以前とは異なり、量子ビットリストをサブセット領域に明示的に分割する必要があります。
ko_kr: 오류 큐비트 2와 큐비트 3및 4 쌍에서 로컬로 작동한다고 가정하자. ``tensored_meas_cal`` 기능을 사용하여 보정 회로를 구성한다. 이전과는 달리 큐비트 목록을 하위 집합 영역으로 명시적으로 나눌 필요가 있다.
pt_br: Suponha que o erro atua localmente no qubit 2 e no par de qubits 3 e 4. Construa os circuitos de calibração usando a função ``tensored_meas_cal``. Diferentemente de antes, precisamos dividir explicitamente a lista de qubits em regiões de subconjunto.
ru_ru: Предположим, что ошибка действует локально на кубите 2 и паре кубитов 3 и 4. Построим калибровочные схемы с помощью функции ``tensored_meas_cal``. В отличие от предыдущего случая, нам нужно явно разделить список кубитов на подмножества.
ta_in: பிழை க்யூபிட் 2 மற்றும் க்யூபிட்ஸ் 3 மற்றும் 4 இல் லோக்கலில் செயல்படுகிறது என்று வைத்துக் கொள்ளுங்கள். ``tensored_meas_cal`` செயல்பாட்டைப் பயன்படுத்தி அளவொப்புமை சர்கூட்களை உருவாக்கவும். முன்பு போலல்லாமல், க்யூபிட் பட்டியலை வெளிப்படையாக துணைக்குழு பகுதிகளாகப் பிரிக்க வேண்டும்.
tr_tr: Hatanın yerel olarak kübit 2 ve kübit 3 ve 4 çifti üzerinde etkili olduğunu varsayın. Kalibrasyon devrelerini ``tensored_meas_cal`` işlevini kullanarak yapılandırın. Öncekinden farklı olarak, kübit listesini alt küme bölgelerine açıkça bölmemiz gerekiyor.
zh_tw: 假設誤差只本端地(locally) 作用在量子位元 2 以及量子位元 3 和 4 的配對。 使用函數 ``tensored_meas_cal`` 以建構校準電路。不像之前，我們需要將其量子位元清單明確地分割成子集區域。

source: We now retrieve the names of the generated circuits. Note that in each label (of length 3), the least significant bit corresponds to qubit 2, the middle bit corresponds to qubit 3, and the most significant bit corresponds to qubit 4.
bn_bn: এখন আমরা তৈরি হওয়া বা জাত বর্তনী নামাঙ্কন উদ্ধার করব। বিশেষভাবে লক্ষণীয় যে, প্রতি নাম বা লেবেলে সর্বনিম্ন স্থানাঙ্ক বিট মান হচ্ছে কিউবিট ২ এর জন্য, মধ্য বিট মান হচ্ছে কিউবিট ৩ নির্দেশিত এবং সর্বোচ্চ স্থানাঙ্ক বিট মান হচ্ছে কিউবিট ৪।
es_un: Ahora recuperamos los nombres de los circuitos generados. Tenga en cuenta que en cada etiqueta (de longitud 3), el bit menos significativo corresponde al qubit 2, el bit central corresponde al qubit 3 y el bit más significativo corresponde al qubit 4.
fr_fr: Nous récupeons maintenant les noms des circuits générés. Notez que dans chaque étiquette (de longueur 3), le bit le moins significatif correspond au qubit 2, le bit du milieu correspond au qubit 3, et le bit le plus significatif correspond au qubit 4.
it_it: Ricaviamo i nomi dei circuiti generati. Da notare che in ogni etichetta (di lunghezza 3), il bit meno significativo corrisponde al qubit 2, quello intermedio al qubit 3 e il più significativo corrisponde al qubit 4.
ja_jp: 生成された回路名を取得します。各ラベル（長さ3）では、最下位ビットが量子ビット2、中央ビットが量子ビット3、最上位ビットが量子ビット4に対応することに注意してください。
ko_kr: 이제 생성된 회로의 이름을 검색한다. 각각의 라벨 (길이 3의) 에서, 최하위 비트는 큐비트 2에 해당하고, 중간 비트는 큐비트 3에 해당하며, 최상위 비트는 큐비트 4에 해당한다.
pt_br: Agora, recuperamos os nomes dos circuitos gerados. Observe que em cada rótulo (de comprimento 3), o bit menos significativo corresponde ao qubit 2, o bit do meio corresponde ao qubit 3, e o bit mais significativo corresponde ao qubit 4.
ru_ru: Теперь извлекаем имена сгенерированных схем. Заметим, что в каждой метке (длиной 3) наименее значимый бит соответствует кубиту 2, средний бит соответствует кубиту 3, а наиболее значимый бит соответствует кубиту 4.
ta_in: உருவாக்கப்பட்ட சர்கூட்களின் பெயர்களை இப்போது மீட்டெடுக்கிறோம். ஒவ்வொரு லேபிளிலும் (நீளம் 3), குறைவான குறிப்பிடத்தக்க பிட், க்யூபிட் 2 உடன் ஒத்துப்போகிறது, நடுத்தர பிட், க்யூபிட் 3 உடன் ஒத்திருக்கிறது, மற்றும் மிக முக்கியமான பிட், க்யூபிட் 4 உடன் ஒத்துள்ளது என்பதை நினைவில் கொள்க.
tr_tr: Şimdi üretilen devrelerin adlarını alıyoruz. Her etikette (3 uzunlukta), en az anlamlı bit kübit 2'ye, orta bit kübit 3'e ve en önemli bit kübit 4'e karşılık gelir.
zh_tw: 我們現在檢索所產生電路的名稱。 請注意，在每一個標籤（長度為 3）中，最不重要的位元對應於量子位元2 ，中間位元對應於量子位元3 ，且最重要的位元對應於量子位元 4。

source: Let us elaborate on the circuit names. We see that there are only four circuits, instead of eight. The total number of required circuits is :math:`2^m` where :math:`m` is the number of qubits in the target subset (here :math:`m=2`).
bn_bn: বর্তনীর (সার্কিট) নাম কিভাবে নির্ধারিত হবে তা একটু আলোচনা করা যাক। দেখা যাচ্ছে আটটি বর্তনীর পরিবর্তে আমাদের চারটি বর্তনী ব্যবহার করতে হচ্ছে। মোট কতগুলো বর্তনী প্রয়োজন তা নির্ণয় করা হয় :math:`2^m` দ্বারা যেখানে :math:`m` হচ্ছে লক্ষ্য সাবসেটে উপস্থিত কিউবিট সংখ্যা, এই উদাহরণে যা :math:`m=2`।
es_un: Expliquemos detalladamente los nombres de los circuitos. Vemos que solo hay cuatro circuitos, en lugar de ocho. El número total de circuitos requeridos es :math:`2^m` donde :math:`m` es el número de qubits en el subconjunto objetivo (aquí :math:`m=2`).
fr_fr: A propos des noms des circuits, nous voyons qu'il n'y a que quatre circuits, au lieu de huit. Le nombre total de circuits requis est :math:`2^m` où :math:`m` est le nombre de qubits dans le sous-ensemble cible (ici :math:`m=2`).
ko_kr: 회로 이름에 대해 자세히 설명하겠다. 8개가 아닌 4개의 회로만 있다는 것을 볼 수 있다. 필요한 회로의 총 수는 :math:`2^m` 이고, 여기서 :math:`m`은 대상 서브셋의 큐비트 수 (여기서는 :math:`m=2`) 이다.
ru_ru: Давайте подробнее остановимся на названиях цепей. Мы видим, что схем всего четыре, а не восемь. Общее число необходимых схем равно :math:`2^m`, где :math:`m` – число кубитов в целевом подмножестве (здесь :math:`m=2`).
ta_in: சர்கூட் பெயர்களை விரிவாகக் கூறுவோம். எட்டுக்கு பதிலாக நான்கு சுற்றுகள் மட்டுமே இருப்பதைக் காண்கிறோம். தேவையான சுற்றுகளின் மொத்த எண்ணிக்கை:math: `2 ^m` எங்கே:math:`m` என்பது இலக்கு துணைக்குழுவில் உள்ள குவிட்களின் எண்ணிக்கை (இங்கே:math: `m = 2`).
tr_tr: Devre isimlerini oluşturalım. Sekiz yerine sadece dört tane devre olduğunu görüyoruz. Gerekli devrelerin toplam sayısı :math:`2^m`dir, burada :math:`m` hedef altkümedeki kübitlerin sayısıdır (burada :math:`m=2`).
zh_tw: 讓我們詳細說明電路名稱。 我們看到只有 4 個電路，而不是 8 個。 必要電路的總數是 :math:`2^m` ，其中 :math:`m` 是目標子集中的 量子位元數目（這裡為 :math:`m=2`）。

source: Each basis state of qubits 3 and 4 appears exactly once. Only two basis states are required for qubit 2, so these are split equally across the four experiments. For example, state ‘0’ of qubit 2 appears in state labels ‘000’ and ‘010’.
bn_bn: কিউবিট ৩ এবং কিউবিট ৪ এর প্রতিটি বেসিস স্টেট মাত্র একবার দৃশ্যমান হবে। শুধুমাত্র দুইটি বেসিস স্টেট প্রদর্শিত হবে কিউবিট ২ এর জন্য, যা সমভাবে চারটি পরীক্ষনে বন্টিত। উদাহরণস্বরূপ, কিউবিট ২ এর জন্য ‘0’ দশা অবস্থা প্রদর্শিত হবে ‘000’ এবং ‘010’ দ্বারা।
es_un: Cada estado base de los qubits 3 y 4 aparece exactamente una vez. Solo se requieren dos estados base para el qubit 2, por lo que estos se dividen por igual en los cuatro experimentos. Por ejemplo, el estado ‘0’ del qubit 2 aparece en las etiquetas de estado ‘000’ y ‘010’.
fr_fr: Chaque état de base des qubits 3 et 4 apparaît exactement une fois. Seuls deux états de base sont requis pour le qubit 2, de sorte qu'ils sont répartis équitablement entre les quatre tests. Par exemple, l'état '0' du qubit 2 apparaît dans les libellés d'état '000' et '010'.
it_it: Ogni stato di base dei qubit 3 e 4 appare esattamente una volta. Per il qubit 2 sono necessari solamente due stati di base, quindi questi sono equamente suddivisi nei quattro esperimenti. Per esempio, lo stato '0' del qubit 2 appare insieme agli stati '000' e '010'.
ko_kr: 3 및 4의 각각의 기본 상태는 정확히 한번 나타난다. 2개의 기본 상태만이 4비트에 필요하므로, 이들은 4개의 실험에 걸쳐 균등하게 분할된다. 예를 들어, 4비트 2의 상태 '0' 은 상태 레이블 '000' 및 '010' 에 표시된다.
ru_ru: Каждое базисное состояние кубитов 3 и 4 появляется ровно один раз. Для кубита 2 требуется только два базисных состояния, поэтому они распределены поровну между четырьмя экспериментами. Например, состояние ‘0’ кубита 2 появляется в метках состояний ‘000’ и ‘010’.
ta_in: க்யூபிட்ஸ் 3 மற்றும் 4 இன் ஒவ்வொரு அடிப்படை நிலையும் சரியாக ஒரு முறை தோன்றும். க்யூபிட் 2 க்கு இரண்டு அடிப்படை நிலைகள் மட்டுமே தேவை, எனவே இவை நான்கு சோதனைகளிலும் சமமாக பிரிக்கப்படுகின்றன. எடுத்துக்காட்டாக, க்யூபிட் 2 இன் நிலை ‘0’ ஆக இருப்பின், நிலை அடையாளக் குறியீடு ‘000’ மற்றும் ‘010’ இல் தோன்றும்.
tr_tr: Kübit 3 ve 4 ün her taban vektörü tam olarak bir kez görünür. Kübit 2 için sadece 2 taban vektörü gereklidir, böylece dört deney boyunca eşit bir şekilde bölünür. Örneğin, kübit 2'nin ‘0’ durumu, ‘000’ ve ‘010’ durum etiketlerinde görünür.
zh_tw: 量子位元 3 和 4 的每個基底態確切地出現一次。量子位元 2 只需要兩個基底態，所以這些基底態平均分配到四個實驗。 例如，量子位元 2 的狀態 '0' 出現在狀態標籤 '000' 及 '010'中。

source: We now execute the calibration circuits on an Aer simulator, using the same noise model as before. This noise is in fact local to qubits 3 and 4 separately, but assume that we don’t know it, and that we only know that it is local for qubit 2.
bn_bn: এখন আমরা পুর্বের মত একই নয়েজ মডেল বা ক্রুটি মডেল ব্যবহার করে এয়ার সিমুলেটরে ক্রমাঙ্কন (ক্যালিব্রেশন) বর্তনী (সার্কিট) টি সম্পাদনা করব। এই নয়েজ মডেলটি কিউবিট ৩ এবং কিউবিট ৪ এর সাথে সম্পর্কিত, কিন্তু হিসাব সুবিধার জন্য আপাতত তা উপেক্ষনীয়। আমরা ধরে নিব, এইটি শুধুমাত্র কিউবিট ২ এর সাথে সম্পর্কিত।
es_un: Ahora, ejecutamos los circuitos de calibración en un simulador Aer, usando el mismo modelo de ruido que antes. Este ruido en realidad es local para los qubits 3 y 4 por separado, pero asumimos que no lo sabemos y que solo sabemos que es local para el qubit 2.
fr_fr: Nous exécutons maintenant les circuits d'étalonnage sur un simulateur Aer, en utilisant le même modèle de bruit qu'auparavant. Ce bruit est en fait local aux qubits 3 et 4 séparément, mais supposons que nous ne le savons pas, et que nous savons seulement qu'il est local pour le qubit 2.
it_it: Ora eseguiamo i circuiti di calibrazione utilizzando il simulatore Aer, con lo stesso modello di rumore utilizzato in precedenza. Infatti questo rumore è localizzato separatamente sui qubit 3 e 4, ma assumiamo di non avere questa informazione e di sapere solo che il rumore è localizzato sul qubit 2.
ko_kr: 이제 이전과 동일한 소음 모델을 사용하여 Aer 시뮬레이터에서 보정 회로를 실행한다. 이 노이즈는 사실 큐비트 3과 4에 대해 개별적으로 발생하지만, 이것을 모른다는 것을 가정하고 큐비트 2에 대한 로컬 노이즈만 알고 있다고 가정한다.
ru_ru: Теперь мы запускаем калибровочные схемы на симуляторе Aer, используя ту же модель шума, что и раньше. Этот шум на самом деле локален отдельно для кубитов 3 и 4, но предположим, что мы этого не знаем, и что мы знаем, что он локален только для кубита 2.
ta_in: முன்பு இருந்த அதே இரைச்சல் மாதிரியைப் பயன்படுத்தி, இப்போது Aer சிமுலேட்டர்-ல் அளவொப்புமை சர்கூட்களை இயக்குகிறோம். இந்த இரைச்சல் உண்மையில் க்யூபிட்ஸ் 3 மற்றும் 4 க்கு தனித்தனியாக உள்ளது, ஆனால் அது நமக்குத் தெரியாது என்று வைத்துக் கொள்வோம், மேலும் இது க்யூபிட் 2 க்கு லோக்கல் என்று மட்டுமே நமக்குத் தெரியும்.
tr_tr: Şimdi kalibrasyon devrelerini Aer simülatörü üzerinde öncekiyle aynı gürültü modelini kullanarak yürütüyoruz. Bu gürültü, kübit 3 ve 4 için ayrı ayrı yereldir ancak bunu bilmediğimizi ve sadece kübit 2 için yerel olduğunu varsayalım.
zh_tw: 我們現在使用與之前相同的噪音模型在 Aer 模擬器上執行校準電路。事實上，這噪音其實是分別地局限於量子位元 3 和 4，但假設我們還不知道，而且我們只知道它是量子位元 2 的局部噪音。

source: The fitter provides two calibration matrices. One matrix is for qubit 2, and the other matrix is for qubits 3 and 4.
bn_bn: সংস্থাপক বা ফিটার দুইটি ক্রমাঙ্কন (ক্যালিব্রেশন) ম্যাট্রিক্স তৈরি করে দেয়। তন্মধ্যে একটি ম্যাট্রিক্স হচ্ছে কিউবিট ২ এর জন্য, অপর ম্যাট্রিক্সটি হচ্ছে কিউবিট ৩ এবং কিউবিট ৪ এর জন্য।
es_un: El ajustador (fitter) proporciona dos matrices de calibración. Una matriz es para el qubit 2 y la otra matriz es para los qubits 3 y 4.
fr_fr: Le fitter (ajusteur) fournit deux matrices d'étalonnage. Une matrice est pour le qubit 2, et l'autre matrice est pour les qubits 3 et 4.
it_it: Il fitter fornisce due matrici di calibrazione. Una matrice per il qubit 2, e l'altra per i qubit 3 e 4.
ja_jp: フィッターは2つの較正行列を提供します。1つの行列は量子ビット2、もう1つの行列は量子ビット3および4のための行列です。
ko_kr: 적합자(fitter) 은 두 가지 보정 매트릭스를 제공한다. 한 행렬은 큐비트 2에 대한 행렬이고 다른 행렬은 큐비트 3과 4에 대한 행렬이다.
pt_br: O equipamento fornece duas matrizes de calibração. Uma matriz é para qubit 2 e a outra matriz é para qubits 3 e 4.
ru_ru: Модуль подгонки предоставляет две калибровочные матрицы. Одна матрица предназначена для кубита 2, а другая - для кубитов 3 и 4.
ta_in: பொருத்துனர், இரண்டு அளவொப்புமை மேட்ரிக்ஸ்களை வழங்குகிறது. ஒரு மேட்ரிக்ஸ் க்யூபிட் 2 க்கும், மற்றொரு மேட்ரிக்ஸ் க்யூபிட்ஸ் 3 மற்றும் 4 க்கும் ஆகும்.
tr_tr: Birleştirici iki kalibrasyon matrisi sağlar. Bir matris kübit 2 içindir ve diğer matris kübit 3 ve 4 içindir.
zh_tw: 此fitter提供兩個校準矩陣。 一個矩陣用於於量子位元 2，另一個矩陣用於量子位元 3 和 4。

source: We can look at the readout fidelities of the individual tensored components or qubits within a set:
bn_bn: আমরা স্ব স্ব টেনসর উপাদান অথবা একটি কিউবিট সেটের রিডআউট ফাইডালিটি হিসাব রাখতে পারি:
es_un: Podemos observar la lectura de salida de las fidelidades de los componentes individuales tensorizados o de los qubits dentro de un conjunto:
fr_fr: Nous pouvons observer les fidéliités de lecture des composants tensurés ou qubits individuels au sein d'un ensemble:
it_it: Possiamo guardare alle fidelity di lettura dei singoli componenti tensoriali o o dei qubit all'interno di un set:
ja_jp: セット内の個々のテンソル化されたコンポーネントまたは量子ビットの読み出し忠実度を確認できます。:
ko_kr: 다음과 같이 각 tensored 구성 요소 또는 세트 내 큐비트의 판독 충실도(fidelities) 를 살펴볼 수 있다.
pt_br: Podemos observar as fidelidades de leitura dos componentes tensor individuais ou qubits em um conjunto:
ru_ru: Мы можем посмотреть на точность считывания отдельных тензорных компонентов или кубитов в заданном наборе:
ta_in: ஒரு தொகுப்பினுள் தனித்தனி டென்சார்ட் கூறுகள் அல்லது க்யூபிட்ஸ்-களின் வாசிப்பு சரிபார்த்தலை நாம் பார்க்கலாம்:
tr_tr: Bir küme içindeki tek tek tensörlenmiş bileşenlerin veya kübitlerin okuma doğruluklarına bakabiliriz:
zh_tw: 我們可以查看在一個集合內，個別張量化部件或量子位元的讀取準確度 (readout fidelities)：

source: Plot the individual calibration matrices:
bn_bn: নিজস্ব ক্রমাঙ্কন (ক্যালিব্রেশন) ম্যাট্রিক্স লেখচিত্র অংকন:
es_un: Graficar las matrices de calibración individuales:
fr_fr: Tracer les matrices d'étalonnage individuelles :
it_it: Visualizziamo su un grafico ogni singola matrice di calibrazione:
ja_jp: 個々の較正行列をプロットします。
ko_kr: 개별 보정 행렬을 표시한다:
pt_br: Visualizando as matrizes de calibração individuais:
ru_ru: Выводим на экран отдельные калибровочные матрицы:
ta_in: தனிப்பட்ட அளவொப்புமை மேட்ரிக்ஸ்களை வரைதல்:
tr_tr: Ayrı kalibrasyon matrislerinin çizimi:
zh_tw: 繪製個別校準矩陣：

source: Plot the raw vs corrected state:
bn_bn: মূল এবং সঠিক দশা তুল্য লেখচিত্র অংকন:
es_un: Graficar el estado original contra el estado corregido:
fr_fr: Tracer l'état brut par rapport à l'état corrigé:
it_it: Disegniamo su un grafico lo stato grezzo vs lo stato corretto:
ja_jp: 未処理の状態と処理後の状態をプロットします。
pt_br: Desenhando o estado bruto vs corrigido:
ru_ru: Построим графики для необработанного и скорректированного состояний:
ta_in: பதனிடப்படாத vs சரி செய்யப்பட்ட நிலையை வரைதல்:
tr_tr: Ham durumun çizimine karşı düzeltilmiş durumun çizimi:
zh_tw: 繪製原始態與已更正的態：

source: As a check we should get the same answer if we build the full correction matrix from a tensor product of the subspace calibration matrices:
bn_bn: বারবার একই ফলাফল পেতে হলে আমাদের একটু পুর্ণ শুদ্ধিকরণ ম্যাট্রিক্স তৈরি করতে হবে। এই ম্যাট্রিক্স নির্নয় করতে হবে একটি উপ-স্পেস ক্রমাঙ্কন (ক্যালিব্রেশন) ম্যাট্রিক্স এর টেনসর গুনফল থেকে।:
es_un: Para comprobar, deberíamos obtener la misma respuesta si construimos la matriz de corrección completa a partir de un producto tensorial de las matrices de calibración del subespacio:
fr_fr: En tant que vérification, nous devrions obtenir la même réponse si nous construisons la matrice de correction complète à partir d'un produit tensoriel des matrices de calibration de sous-espace:
it_it: Come verifica, dovremmo ottenere la stessa risposta se costruissimo l'intera matrice di correzione calcolando un prodotto tensoriale delle matrici di calibrazione del sotto spazio:
ja_jp: 確認として、部分空間校正行列のテンソル積から完全な較正行列を作成すると、同じ解が得られるはずです。
ko_kr: 다음과 같이 하위 공간 보정 매트릭스의 테서 제품에서 전체 정정 매트릭스를 빌드하는 경우 동일한 응답을 받아야 한다.
pt_br: Como uma verificação devemos obter a mesma resposta se construirmos a matriz de correção completa, a partir de um produto tensorial das matrizes de calibração do subespaço:
ru_ru: В качестве проверки мы должны получить тот же ответ, если мы построим полную матрицу коррекции из тензорного произведения матриц калибровки для подпространства:
ta_in: சரி பார்ப்பதற்காக, துணைவெளி அளவொப்புமை மேட்ரிக்ஸின் டென்சர் தயாரிப்பு-லிருந்து முழு திருத்த மேட்ரிக்ஸை கட்டினால் அதே பதிலைப் பெற வேண்டும்:
tr_tr: Bir kontrol olarak, tam düzeltme matrisini alt uzay kalibrasyon matrislerinin bir tensör çarpımından oluşturursak aynı cevabı almalıyız:
zh_tw: 我們可以做以下的確認。如果我們從子空間校準矩陣的張量積創建完整的修正矩陣，我們應該得到同樣的答案：

source: Running Qiskit Algorithms with Measurement Error Mitigation
bn_bn: পরিমাপ ত্রুটি দূরীকরণের সঙ্গে Qiskit অ্যালোগরিদম চালানো
es_un: Ejecución de Algoritmos Qiskit con Mitigación de Errores de Medición
fr_fr: Exécuter les algorithmes Qiskit avec l'atténuation des erreurs de mesure
ko_kr: 측정 오류를 줄여주는 Qiskit 알고리즘 실행
ru_ru: Запуск алгоритмов Qiskit с уменьшением ошибок измерения
ta_in: அளவீட்டு பிழை குறைப்புடன் Qiskit வழிமுறைகளை இயக்குகிறது
tr_tr: Qiskit Algoritmalarını Ölçüm Hatası Azaltma ile Çalıştırma
zh_tw: 使用測量錯誤緩解以執行 Qiskit 演算法

source: To use measurement error mitigation when running quantum circuits as part of a Qiskit algorithm, we need to include the respective measurement error fitting instance in the QuantumInstance. This object also holds the specifications for the chosen backend.
bn_bn: Qiskit ধারাক্রমের (অ্যালোগরিদম) অংশ হিসেবে কোয়ান্টাম বর্তনী (সার্কিট) চালানোর সময় পরিমাপ ত্রুটি দূরীকরণ ব্যবহার করতে হলে QuantumInstance -এ যথাক্রমে পরিমাপ ত্রুটির (এরর) উপযুক্ত দৃষ্টান্ত (ইনস্ট্যান্স) যোগ করতে হবে। এই অবজেক্টে নির্বাচিত ব্যাকএন্ডের বিবরণও থাকে।
es_un: Para utilizar la mitigación de errores de medición cuando se ejecutan circuitos cuánticos como parte de un algoritmo Qiskit, debemos incluir la instancia de ajuste del error de medición correspondiente en QuantumInstance. Este objeto también contiene las especificaciones del backend elegido.
fr_fr: Pour utiliser l'atténuation des erreurs de mesure lors de l'exécution de circuits quantiques dans le cadre d'un algorithme Qiskit, nous devons inclure l'instance appropriée d'ajustement des erreurs de mesure dans QuantumInstance. Cet objet contient également les spécifications du système d'execution choisi.
ko_kr: Qiskit 알고리즘의 일부로서 양자 회로를 실행할 때 측정 오류 완화를 사용하려면, 퀀텀 인스턴스 (QuantumInstance) 에 각각의 측정 에러 피팅 인스턴스를 포함해야 한다. 이 오브젝트는 또한 선택된 백엔드에 대한 스펙을 보유한다.
ru_ru: Чтобы задействовать функцию уменьшения ошибки измерения при запуске квантовых цепей как часть алгоритма Qiskit, нам необходимо включить соответствующий экземпляр класса корректировки ошибки измерения в QuantumInstance. Этот объект также содержит характеристики выбранного бэкенда.
ta_in: ஒரு Qiskit வழிமுறையின் ஒரு பகுதியாக குவாண்டம் குவாண்டம் சர்கூட்களை இயக்கும் போது அளவீட்டு பிழை குறைத்தலைப் பயன்படுத்த, குவாண்டம் உதாரணம் அந்தந்த அளவீட்டு பிழை பொருத்தும் உதாரணத்தை நாம் சேர்க்க வேண்டும். இந்த பொருள் தேர்ந்தெடுக்கப்பட்ட பின்தளத்தில் விவரக்குறிப்புகளையும் கொண்டுள்ளது.
tr_tr: Qiskit algoritmasının bir parçası olarak kuantum devrelerini çalıştırdığın zaman ölçüm hatası azaltmayı kullanmak için QuantumInstance'a ilgili ölçüm hatası fitting örneğini eklememiz gerekir. Bu nesne ayrıca seçilen arka uç için özelliklerini da içerir.
zh_tw: 若要在 Qiskit 演算法中執行量子電路時使用測量錯誤緩解，我們需要在 QuantumInstance 中包含各自的測量錯誤擬合實例。 此物件也會保留所選後端的規格。
