Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/4_randomized_benchmarking.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: From the known depolarizing errors on the simulation we can predict the **fidelity**. First we need to count the number of **gates per Clifford**.
bn_bn: জ্ঞাত অবমাননাকর ত্রুটিগুলি (অনুকরণ করে রাখা) থেকে আমরা **বিশ্বস্ততার** অনুমান করতে পারি। **ক্লিফোর্ড পিছু যুক্তিবর্তনীগুলির** সংখ্যা আমাদের জেনে রাখা দরকার।
es_un: De los errores conocidos de despolarización de la simulación podemos predecir la **fidelidad**. Primero necesitamos contar el número de **compuertas por Clifford**.
fr_fr: À partir des erreurs de dépolarisation connues sur la simulation, nous pouvons prédire la **fidelity**. Nous devons d'abord compter le nombre de **gates par Clifford**.
id_id: Dari eror depolarisasi yang diketahui pada simulasi kita dapat memprediksi **fidelitas**. Pertama kita perlu menghitung banyaknya **gerbang per Clifford**.
it_it: Utilizzando gli errori di depolarizzazione che abbiamo ricavato dalla simulazione, è possibile predire la **fidelity**. Per prima cosa è necessario contare il numero di **gate per Clifford**.
ja_jp: シミュレーションにおける既知の脱分極誤差から、**忠実度**を予測できます。まず、**クリフォードあたりのゲート数**を数える必要があります。
ko_kr: 시뮬레이션을 통해 알게된 편극 소거(depolarizing) 오류를 사용해 **정확도 (fidelity)** 를 예측할 수 있다. 먼저 **gates per Clifford** 를 센다.
pt_br: A partir dos erros de despolarização conhecidos na simulação podemos prever a **fidelidade**. Primeiro precisamos contar o número de **portas por Clifford**.
ru_ru: Зная ошибки деполяризации, мы можем спрогнозировать **точность**. Сначала нужно посчитать количество **вентилей на последовательность из операторов Клиффорда**.
ta_in: உருவகப்படுத்துதலில் அறியப்பட்ட டிப்போலரைசிங் பிழைகளிலிருந்து **நம்பகத்தன்மையை** கணிக்க முடியும். முதலில் நாம் **கிளிஃபோர்டுக்கு வாயில்களின்** எண்ணிக்கையை அறிய வேண்டும்.
tr_tr: Simülasyonda bilinen depolarize (kutuplaştırılmış) hatalardan **fidelity** 'yi (doğruluk) ön görebiliyoruz. İlk önce, **gates per Clifford** 'ı (Clifford başına hata) saymak zorundayız.
zh_tw: 可以根據模擬中已知的去極化誤差來預測 **fidelity**。 首先，我們需要計算 **gates per Clifford**的數量。

source: The function **gates_per_clifford** takes a list of transpiled RB circuits and outputs the number of basis gates in each circuit.
bn_bn: **gates_per_clifford** ফাংশনটি স্থানান্তরিত RB বর্তনীর (সার্কিট) তালিকা নিয়ে তা থেকে প্রত্যেক বর্তনীর বেসিস যুক্তিবর্তনীর (গেট) সংখ্যা উৎপাদন করে।
es_un: La función **gates_per_clifford** toma una lista de circuitos RB transpilados y produce el número de compuertas base en cada circuito.
fr_fr: La fonction **gates\_per\_clifford** prend une liste de circuits RB transpilés et donne le nombre de portes de base dans chaque circuit.
id_id: Fungsi **gates_per_clifford** mengamibil daftar dari sirkuit RB tertranspilasi dan mengeluarkan jumlah dari gerbang basis untuk setiap sirkuit.
it_it: La funzione **gates_per_clifford** accetta in input una lista di circuiti di RB passati per il transpiler e produce il numero di gate di base in ogni circuito.
ko_kr: **gates_per_clifford** 함수는 전송된 RB 회로들의 리스트를 취하고, 각각의 회로들의 기저 게이트들의 수를 출력한다.
ru_ru: Функция **gates_per_clifford** принимает список трансипилированных RB цепей и выводит количество базовых вентилей в каждой цепи.
ta_in: **gates_per_clifford** செயல்பாடு பரிமாற்றப்பட்ட RB சுற்றுகளின் பட்டியலை எடுத்து ஒவ்வொரு சுற்றிலும் அடிப்படை வாயில்களின் எண்ணிக்கையை வெளியிடுகிறது.
tr_tr: **gates_per_clifford** fonksiyonu transpile edilmiş RB devrelerinin bir listesini alır ve her devredeki taban kapılarının sayısını çıktı verir.
zh_tw: 此函數 **gates_per_clifford** 輸入轉譯RB 電路的清單並輸出每一個電路中的基底閘數。

source: The function **calculate_2q_epc** gives measured errors in the basis gates that were used to construct the Clifford. It assumes that the error in the underlying gates is depolarizing. It outputs the error per a 2-qubit Clifford.
bn_bn: ক্লিফোর্ড বানাতে যেই বেসিস গেটগুলো ব্যবহার করা হয়েছিল, সেগুলোর পরিমাপ ত্রুটি **calculate_2q_epc** ফাংশনটা দেয়। এখানে এটি ধরে নেওয়া হয় যে অন্তর্নিহিত গেটগুলির ত্রুটিটি হতাশাব্যঞ্জক। প্রত্যেক ২- কিউবিট ক্লিফোর্ড এর জন্যে এই ফাংশনটি ত্রুটি গণনা করে।
es_un: La función **calculate_2q_epc** da errores medidos en las compuertas base que fueron usadas para construir el Clifford. Asume que el error en las compuertas subyacentes es despolarizante. Emite el error por un Clifford de 2 qubit.
fr_fr: La fonction **calculate\_2q\_epc** donne des erreurs mesurées dans les portes de base qui ont été utilisées pour construire le Clifford. Il part du principe que l'erreur dans les portes sous-jacentes est dépolarisante. Il génère l'erreur par un Clifford à 2-qubit.
id_id: Fungsi **calculate_2q_epc** memberikan eror terukur pada gerbang basis yang digunakan untuk membuat Clifford. Ini mengasumsikan eror pada gerbang yang mendasar adalah depolarisasi. Ini mengeluarkan eror per Clifford 2-qubit.
it_it: La funzione **calculate_2q_epc** fornisce gli errori misurati nei gate di base che sono stati utilizzati per costruire i gate di Clifford. Si presuppone che l'errore nei gate sottostanti sia di depolarizzazione. L'output della funzione è l'errore per un gate di Clifford a 2 qubit.
ko_kr: **calculate_2q_epc** 함수는 클리포드를 구성하는 데 사용된 기본 게이트에서 측정된 오류를 제공한다. 사용된 게이트의 오류가 편극 소거(depolarizing) 에 의한 것으로 가정한다. 이 함수는 2-큐비트 클리포드 (Clifford) 의 에러를 출력한다.
ru_ru: Функция **calculate_2q_epc** выдает измеренные ошибки в базовых вентилях, которые были использованы для построения последовательности Клиффорда. Предполагается, что ошибка в базовых вентилях является деполяризующей. Она выводит ошибку на 2-кубитную последовательность из операторов Клиффорда.
ta_in: **calculate_2q_epc** செயல்பாடு கிளிஃபோர்டை உருவாக்க பயன்படுத்தப்பட்ட அடிப்படை வாயில்களில் அளவிடப்பட்ட பிழைகளை வழங்குகிறது. அடிப்படை வாயில்களில் உள்ள பிழை நீக்கம் செய்யப்படுவதாக அது கருதுகிறது. இது 2-குவிட் கிளிஃபோர்டுக்கு பிழையை வெளியிடுகிறது.
tr_tr: **calculate_2q_epc** fonksiyonu, Clifford inşa etmek için kullanılan taban kapılarında hesaplanan hataları verir. Bu, altta yatan kapıların kutuplaştırılmış olduğunu varsayar. Her 2 kübit Clifford başına hata verir.
zh_tw: 此函數 **calculate_2q_epc** 會給出基底閘中用來建構 Clifford的測量誤差。 它假設基底閘中的錯誤是去極化的。 它會輸出一個二量子位元的Clifford 誤差。

source: The input to this function is: - **gate_per_cliff:** dictionary of gate per Clifford. - **epg_2q:** EPG estimated by error model. - **qubit_pair:** index of two qubits to calculate EPC. - **list_epgs_1q:** list of single qubit EPGs of qubit listed in ``qubit_pair``. - **two_qubit_name:** name of two qubit gate in ``basis gates`` (default is ``cx``).
bn_bn: এই ফাংশন এর ইনপুট হলো:- **gate_per_cliff:** প্রত্যেক ক্লিফোর্ড-এর জন্য যুক্তিবর্তনীর (গেইট) ডিকশনারি। - **epg_2q:** ত্রুটি নকশা দ্বারা অনুমান করা EPG। - **qubit_pair:** EPC গণনা করবার জন্যে ২টো কিউবিট এর সূচক। - **list_epgs_1q:** ``qubit_pair``-এ তালিকাভুক্ত করে রাখা একক কিউবিট EPG-র তালিকা। - **two_qubit_name:** ``বেসিস গেটগুলোর`` দুই কিউবিট গেট এর নাম (অনুপস্থিতি তে ``cx`` ধরে নেওয়া হবে)।
es_un: La entrada a esta función es: - **gate_per_cliff:** diccionario de la compuerta por Clifford. - **epg_2q:** error por compuerta (Error Per Gate, EPG) estimado por modelo de error. - **qubit_pair:** índice de dos qubits para calcular EPC. - **list_epgs_1q:** lista de EPGs de qubits individuales de los qubits listados en ``qubit_pair``. - **two_qubit_name:** nombre de la compuerta de dos qubits en ``compuertas base`` (por defecto es ``cx``).
fr_fr: L'entrée de cette fonction est : - **gate\_per\_cliff:** dictionnaire de porte par Clifford. - **epg\_2q:** EPG estimé par le modèle d'erreur. - **qubit\_pair:** index de deux qubits pour calculer EPC. - **list\_epgs\_1q:** liste de qubit-unique EPGs des qubits listés dans ``qubit_pair``. - **two\_qubit\_name:** nom de portes de deux qubit dans ``basis gates`` (par défaut ``cx``).
id_id: Masukan dari fungsi ini adalah: - **gate_per_cliff:** kamus dari gerbang per Clifford. - **epg_2q:** EPG terestimasi oleh model eror. - **qubit_pair:** indeks dari dua qubit untuk menghitung EPC. - **list_epgs_1q:** daftar dari qubit tunggal EPGs dari qubit yng terdaftar di ``qubit_pair``. - **two_qubit_name:** nama dari dua qubit dalam ``basis gates`` (default adalah ``cx``).
it_it: La funzione accetta in input: - **gate_per_cliff:** dizionario di gate per Clifford. - **epg_2q:** EPG stimato utilizzando il modello di errore. - **qubit_pair:**- indice di due qubit per calcolare EPC. - **list_epgs_1q:** lista dell'EPG di singolo qubit per i qubit in ``qubit_pair``. - **two_qubit_name:** nome del gate a due qubit in ``basis gates`` (il default è ``cx``).
ko_kr: 이 함수에 대한 입력은 - **gate_per_cliff:** 클리퍼드 당 게이트의 사전 - **epg_2q:** 오류 모델에 의해 추정된 EPG. - **qubit_pair:** EPC를 계산하기 위한 2큐비트의 인덱스. - **list_epgs_1q:** ``qubit_pair`` 에 나열된 단일 큐비트 EPG의 목록. - **two_qubit_name:** ``basis gates`` 에 있는 2큐비트 게이트의 이름 (기본값은 ``cx``).
ru_ru: Входными данными для этой функции являются: - **gate_per_cliff:** словарь вентилей для последовательностей Клиффорда. - **epg_2q:** EPG, оцениваемая моделью ошибок. - **qubit_pair:** индексы двух кубитов для вычисления EPC. - **list_epgs_1q:** список EPG отдельных кубитов в ``qubit_pair``. - **two_qubit_name:** название двухкубитных вентилей в ``basis gates`` (по умолчанию ``cx``).
ta_in: இந்த செயல்பாட்டிற்கான உள்ளீடு: - **gate_per_cliff:** கிளிஃபோர்டுக்கு வாயிலின் அகராதி. - **epg_2q:** EPG பிழை மாதிரியால் மதிப்பிடப்பட்டுள்ளது. - **qubit_pair:** EPC ஐக் கணக்கிட இரண்டு Qubitகளின் அட்டவணை. - **list_epgs_1q:** ``qubit_pair`` இல் பட்டியலிடப்பட்டுள்ள qubitடின் ஒற்றை qubit EPG களின் பட்டியல். -**two_qubit_name:** ``அடிப்படை வாயில்களில்`` இரண்டு qubit வாயிலின் பெயர் (இயல்புநிலை ``cx``).
tr_tr: Bu fonksiyona girdi: - **gate_per_cliff:** Clifford başına kapı sözlüğü. - **epg_2q:** hata modeli tarafından tahmin edilen EPG. - **qubit_pair:** EPC hesaplaması için iki kübitin indeksi. - **list_epgs_1q:** ``qubit_pair`` içerisinde listelenen tek kübitli kübit EPGlerinin listesi. - **two_qubit_name:** ``basis gates`` içerisindeki iki kübit kapısının adı (varsayılan ``cx`` tir).
zh_tw: 該函數的輸入是： - **gate_per_cliff:** 一個包含 gate per Clifford 的字典。 - **epg_2q:** 誤差模型估計的 EPG。 - **qubit_pair:** 用於計算 EPC 的 2 個量子位元的索引。 - **list_epgs_1q:** `` qubit_pair`` 中列出的量子位元的單個量子位元 EPG 清單。 - **two_qubit_name:**``basic gates`` 中的兩個量子位元閘的名稱（預設為``cx``）。

source: Run an RB Sequence with T1,T2 Errors
bn_bn: T১, T২ ত্রুটিগুলোর সহ একটি র. বি ক্রম চালাও
es_un: Ejecutar una secuencia RB con errores T1,T2
fr_fr: Exécuter une séquence RB avec des erreurs T1,T2
id_id: Jalankan sekuens RB dengan Eror T1, T2
it_it: Eseguire una Sequenza RB includendo gli errori T1, T2
ja_jp: T1、T2エラーのあるRBシーケンスを実行する
ko_kr: T1, T2 오류와 함께 RB 시퀀스 실행하기
pt_br: Execute uma Sequência de RB com Erros T1, T2
ru_ru: Запуск RB последовательности с ошибками в T1, T2
ta_in: T1, T2 பிழைகள் கொண்ட RB வரிசையை இயக்கவும்
tr_tr: T1, T2 Hatalarıyla RB dizisinin çalıştırılması
zh_tw: 以 T1、T2 誤差執行 RB 序列

source: We now choose RB sequences that contain only 2-qubit Cliffords.
bn_bn: এবার আমরা সেই র. বি ক্রমগুলোই বাছাই করি যেগুলিতে শুধু ২- কিউবিট ক্লিফর্ড আছে।
es_un: Ahora elegimos secuencias RB que contienen sólo Clifford de 2 qubits.
fr_fr: Nous choisissons maintenant des séquences RB qui ne contiennent que des Cliffords 2-qubits.
id_id: Sekarang kita memilih sekuens RB yang hanya berisi Clifford 2-qubit.
it_it: Selezioniamo solo sequenze di RB che contengono solo gate di Clifford a 2 qubit.
ja_jp: 次に、2量子ビットのクリフォードのみを含むRBシーケンスを選択します。
ko_kr: 이제 2-큐비트 Clifford만 포함하는 RB 시퀀스를 선택한다.
pt_br: Escolhemos agora sequências de RB que contêm apenas Cliffords de 2 qubits.
ru_ru: Теперь мы выбираем последовательности RB, которые содержат только 2-кубитные вентили Клиффорда.
ta_in: 2-qubit கிளிஃபோர்ட்ஸை மட்டுமே கொண்டிருக்கும் RB காட்சிகளை இப்போது தேர்வு செய்கிறோம்.
tr_tr: Şimdi sadece 2 kübitlik Cliffords içeren RB dizilerini seçiyoruz.
zh_tw: 我們現在選擇只含有兩個量子位元Cliffords 的RB序列。

source: We execute these sequences as before, but with a noise model extended with T1/T2 thermal relaxation error, and fit the exponentially decaying curve.
bn_bn: T১/T২ তাপীয় শিথিলকরণ (রিলাক্সেশন) ত্রুটি যুক্ত ত্রুটি নকশা দিয়ে আগের মতন করে এই ক্রমগুলিকে চালাই এবং গুনোত্তরে ক্ষয়িষ্ণু বক্ররেখা টাকে ফিট করি।
es_un: Ejecutamos estas secuencias como antes, pero con un modelo de ruido extendido con error de relajación térmica T1/T2, y ajustamos a una curva que decrece exponencialmente.
fr_fr: Nous exécutons ces séquences comme avant, mais avec un modèle de bruit étendu avec une erreur de relaxation thermique T1/T2 et ajustons la courbe en dégradation exponentielle.
id_id: Kita mengesekusi sekuens ini seperti sebelumnya, tetapi dengan model noise yang diperpanjang dengan eror relaksasi termal T1/T2, dan menyocokkannya dengan kurva peluruhan eksponensial.
it_it: Eseguiamo le sequenze come in precedenza, ma utilizzando un modello di rumore esteso che comprende T1 e T2, l'errore di rilassamento termico, effettuando un fit con una curva di decadimento esponenziale.
ja_jp: 以前のようにこれらのシーケンスを実行しますが、T1/T2熱緩和エラーで拡張されたノイズモデルを使用して、指数関数的に減衰する曲線を近似します。
ko_kr: T1/T2 열적 완화 오류(thermal relaxation error)를 포함해 확장된 노이즈 모델을 사용해 이전과 같이 시퀀스를 실행하고 지수적으로 감소하는 곡선에 맞춰본다.
pt_br: Executamos essas sequências como antes, mas com um modelo de ruído estendido com erro de relaxamento térmico T1/T2, e ajustamos a curva de decaimento exponencial.
ru_ru: Мы запускаем эти последовательности, как и раньше, но с шумовой моделью, дополненной ошибкой тепловой релаксации T1/T2, и аппроксимируем экспоненциально затухающую кривую.
ta_in: இந்த காட்சிகளை நாங்கள் முன்பு போலவே இயக்குகிறோம், ஆனால் T1/T2 வெப்ப தளர்வு பிழையுடன் நீட்டிக்கப்பட்ட சத்தம் மாதிரியுடன், அதிவேகமாக அழுகும் வளைவுக்கு பொருந்தும்.
tr_tr: Bu dizileri daha önce olduğu gibi, ancak T1 / T2 termal durulma hatasıyla genişletilmiş bir gürültü modeliyle çalıştırıyoruz ve üssel olarak bozunma eğrisine fit ediyoruz.
zh_tw: 我們像以前一樣執行這些序列，但額外考慮進一個具有 T1/T2 熱弛緩誤差的噪音模型，並使用指數衰減曲線進行擬合。

source: We count again the number of **gates per Clifford** as before, and calculate the **two-qubit Clifford gate error**, using the predicted primitive gate errors from the coherence limit.
bn_bn: আগের মতন এখানেও আমরা আবার **ক্লিফোর্ড পিছু গেটগুলির** সংখ্যা গণনা করি। এবং এর পর সমদশা (কোহেরেন্স) সীমা থেকে আনুমানিক আদিম গেট ত্রুটিগুলো থেকে **২- কিউবিট ক্লিফোর্ড গেটের ত্রুটি** নিরূপণ করি।
es_un: Contamos de nuevo el número de **compuertas por Clifford** como antes, y calculamos el **error de compuerta Clifford de dos qubits**, utilizando los errores de puerta primitivos predichos desde el límite de coherencia.
fr_fr: Nous comptons à nouveau le nombre de **gates per Clifford** comme avant, et calculons **two-qubit Clifford gate error**, en utilisant les erreurs de porte primitives prédites à partir de la limite de cohérence.
id_id: Kita menghitung lagi jumlah dari **gerbang per Clifford** seperti sebelumnya, dan menghitung **eror gerbang Clifford dua-qubit**, menggunakan eror gerbang primitif yang diperdiksi dari limit koherensi.
it_it: Contiamo di nuovo il numero di **porte per Clifford** come fatto precedentemente, e calcoliamo l'**errore del gate di Clifford a 2 qubit**, utilizzando gli errori di gate primitivi previsti dal limite di coerenza.
ja_jp: 以前と同様に、**クリフォードあたりのゲート数**を再度カウントし、コヒーレンス限界から予測されるプリミティブゲートエラーを使用して、**2量子ビットのクリフォードゲートエラー**を計算します。
ko_kr: 이전과 같이 **gates per Clifford** 의 수를 다시 세고 결맞음 한계를 사용해 예측된 기본 게이트 오류를 사용하여 **two-qubit Clifford gate error** 를 계산한다.
pt_br: Contamos novamente o número de **portas por Clifford** como antes, e calculamos o **erro de porta Clifford de dois bits**, usando os erros das portas primitivas previstos a partir do limite de coerência.
ru_ru: Мы снова рассчитываем количество **вентилей на последовательность Клиффорда**, как и раньше, и вычисляем ошибку **двухкубитного вентиля из группы Клиффорда**, используя предсказанные из пределов когерентности ошибки простых вентилей.
ta_in: முன்பு போலவே கிளிஃபோர்டுக்கு **gates per Clifford** மீண்டும் எண்ணுகிறோம், மேலும் ஒத்திசைவு வரம்பிலிருந்து கணிக்கப்பட்ட பழமையான கேட் பிழைகளைப் பயன்படுத்தி **two-qubit Clifford gate error** கணக்கிடுகிறோம்.
tr_tr: Önceki gibi **gates per Clifford** (Clifford başına kapı) sayısını tekrar sayıyoruz ve eş fazlı olma durumu sınırından tahmin edilen ilksel kapı hatalarını kullanarak **two-qubit Clifford gate error** 'ı hesaplıyoruz.
zh_tw: 我們如同之前一樣再次計算**gates per Clifford** 並使用從同調性極限所預測出的原始閘誤差來計算 **two-qubit Clifford gate error**。

source: First, wee need to choose the following parameters:
ja_jp: 最初に、以下のパラメータを選択する必要があります。
pt_br: Primeiro, precisamos escolher os seguintes parâmetros:

source: **nseeds:** The number of seeds. For each seed you will get a separate list of output circuits in rb\_circs.
ja_jp: **nseeds:** シード値。シードごとに、rb_circs の出力回路の個別リストが得られます。
pt_br: **nseeds:** O número de sequênias. Para cada sequência você receberá uma lista separada de circuitos de saída em rb\_circs.

source: **length\_vector:** The length vector of Clifford lengths. Must be in ascending order. RB sequences of increasing length grow on top of the previous sequences.
ja_jp: **length\_vector:** クリフォードの長さベクトル。昇順にする必要があります。長さが増えるRBシーケンスは、前のシーケンスの上に増えていきます。
pt_br: **length\_vector:** O vetor de comprimento dos comprimentos Clifford. Deve estar em ordem crescente. Sequências de RB crescentes incrementam sobre as sequências anteriores.

source: **rb\_pattern:** A list of the form [[i,j],[k],...] which will make simultaneous RB sequences where Qi,Qj are a 2-qubit RB sequence and Qk is a 1-qubit sequence, etc. The number of qubits is the sum of the entries. For 'regular' RB the qubit\_pattern is just [[0]],[[0,1]].
ja_jp: **rb\_pattern:** [[i,j],[k],...] 形式のリスト。これにより、RBシーケンスが同時に生成されます。Qi、Qj は2量子ビットRBシーケンスで、Qk は1量子ビットシーケンスです。量子ビット数はエントリの合計です。'通常'のRBの場合、量子ビットパターンは [[0]],[[0,1]] です。
pt_br: **rb\_pattern:** Uma lista da forma [[i,j],[k],...] que fará sequências de RB simultâneas onde Qi,Qj são uma sequência RB de 2 qubits e Qk é uma sequência de 1 qubit, etc. O número de qubits é a soma das entradas. Para um RB 'regular' o qubit\_pattern é apenas [[0]],[[0,1]].

source: **length\_multiplier:** If this is an array it scales each rb\_sequence by the multiplier.
ja_jp: **length\_multiplier:** これが配列の場合、それぞれ rb\_sequence の乗算でスケールします。
pt_br: **length\_multiplier:** Se este for uma matriz, ele escala cada rb\_sequence pelo multiplicador.

source: **seed\_offset:** What to start the seeds at (e.g. if we want to add more seeds later).
ja_jp: **seed\_offset:** シードの開始位置（e.g. 後でシードを追加したい場合）。
pt_br: **seed\_offset:** O que inicia as sequências (por exemplo, se quisermos adicionar mais sequências depois).

source: **align\_cliffs:** If true adds a barrier across all qubits in rb\_pattern after each set of cliffords.
ja_jp: **align\_cliffs:** trueの場合、クリフォードの各セットの後に、rb\_pattern のすべての量子ビットにバリアが追加されます。
pt_br: ** align\_cliffs:** Se verdadeiro, adiciona uma barreira em todos os qubits do rb\_pattern após cada conjunto de cliffords.

source: We generate RB sequences. We start with a small example (so it doesn't take too long to run).
ja_jp: RBシーケンスを生成します。まずは小さな例から始めます(実行に時間がかかり過ぎないように)。
pt_br: Geramos as sequências de RB. Começamos com um pequeno exemplo (de modo que não leve muito tempo para executar).

source: In order to generate the RB sequences **rb\_circs**, which is a list of lists of quantum circuits, we run the function ``rb.randomized_benchmarking_seq``.
ja_jp: 量子回路リストのリストであるRBシーケンス **rb\_circs** を生成するため、関数``rb.randomized_benchmarking_seq``を実行します。
pt_br: A fim de gerar as sequências de RB **rb\_circs**, que é uma lista de listas de circuitos quânticos, executamos a função``rb.randomized_benchmarking_seq``.

source: **rb\_circs:** A list of lists of circuits for the rb sequences (separate list for each seed).
ja_jp: **rb\_circs:** rbシーケンスの回路リストのリスト（シードごとの個別リスト）。
pt_br: **rb\_circs:** Uma lista de listas de circuitos para as sequências rb (lista separada para cada sequência).

source: The results in **result\_list** should fit to an exponentially decaying function :math:`A \cdot \alpha ^ m + B`, where :math:`m` is the Clifford length.
ja_jp: **result\_list** の結果は、指数関数的に減衰する関数 :math:`A \cdot \alpha ^ m + B` に適合する必要があります。ここでの :math:`m` はクリフォード長です。
pt_br: Os resultados em **result\_list** devem ajustar-se a uma função exponencialmente decrescente :math:`A \cdot \alpha ^ m + B`, na qual :math:`m` é o comprimento Clifford.

source: EPC = \frac{2^n-1}{2^n} (1-\alpha) (where :math:`n=nQ` is the number of qubits).
pt_br: EPC = \frac{2^n-1}{2^n} (1-\alpha) (onde :math:`n=nQ` é o número de qubits).

source: The function **gates\_per\_clifford** takes a list of transpiled RB circuits and outputs the number of basis gates in each circuit.
ja_jp: 関数**gates\_per\_clifford**は、TranspileされたRB回路のリストを取得し、各回路の基本ゲートの数を出力します。
pt_br: A função **gates\_per\_clifford** recebe uma lista de circuitos de RB transpilados e retorna o número de portas da base em cada circuito.

source: The function **calculate\_2q\_epc** gives measured errors in the basis gates that were used to construct the Clifford. It assumes that the error in the underlying gates is depolarizing. It outputs the error per a 2-qubit Clifford.
ja_jp: 関数**calculate\_2q\_epc**は、クリフォードの構築に使用された基本ゲートの測定誤差を提供します。置かれたゲートのエラーが脱分極であることを前提としています。2量子ビットのクリフォードあたりのエラーを出力します。
pt_br: A função **calculate\_2q\_epc** dá erros medidos nas portas da base que foram usadas para construir o Clifford. Ela assume que o erro nas portas subjacentes é despolarizante. Ela tem como saída o erro de um Clifford de 2 qubits.

source: The input to this function is: - **gate\_per\_cliff:** dictionary of gate per Clifford. - **epg\_2q:** EPG estimated by error model. - **qubit\_pair:** index of two qubits to calculate EPC. - **list\_epgs\_1q:** list of single qubit EPGs of qubit listed in ``qubit_pair``. - **two\_qubit\_name:** name of two qubit gate in ``basis gates`` (default is ``cx``).
ja_jp: この関数への入力は次のとおりです。**gate\_per\_cliff:** クリフォードごとのゲートのディクショナリ。 - **epg\_2q:** 誤差モデルにより推定されるEPG。 - **qubit\_pair:** EPCを計算するための2量子ビットのインデックス。 - **list\_epgs\_1q:** ``qubit_pair``にリストされた量子ビットの単一量子ビットのEPGのリスト。 - **two\_qubit\_name:** ``basis gates``にある2量子ビットゲートの名前（デフォルトは``cx``）。
pt_br: A entrada para esta função é: - **gate\_per\_cliff:** dicionário de porta por Clifford. - **epg\_2q:** EPG estimado por modelo de erro. - **qubit\_pair:** índice de dois qubits para calcular EPC. - **list\_epgs\_1q:** lista de EPGs de qubit único do qubit listado em ``qubit_pair``. - **two\_qubit\_name:** nome da porta de dois qubits no ``basis gates`` (padrão é ``cx``).
