Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/4_randomized_benchmarking.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: This page was generated from `tutorials/noise/4_randomized_benchmarking.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/noise/4_randomized_benchmarking.ipynb`__ -থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/noise/4_randomized_benchmarking.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/noise/4_randomized_benchmarking.ipynb`__.
id_id: Halaman ini dibuat dari `tutorials/noise/4_randomized_benchmarking.ipynb`__.
it_it: Questa pagina è stata generata da `tutorials/noise/4_randomized_benchmarking.ipynb`__.
ja_jp: 当ページは`tutorials/noise/4_randomized_benchmarking.ipynb`__から生成されました。
ko_kr: 이 페이지는 `tutorials/noise/4_randomized_benchmarking.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada a partir do `tutorials/noise/4_randomized_benchmarking.ipynb`__.
ru_ru: Эта страница создана на основе `tutorials/noise/4_randomized_benchmarking.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/noise/4_randomized_benchmarking.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
tr_tr: Bu sayfa `tutorials/noise/4_randomized_benchmarking.ipynb`__ sayfasından oluşturulmuştur.
zh_tw: 此頁面是從 `tutorials/noise/4_randomized_benchmarking.ipynb`__ 產生的。

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/4_randomized_benchmarking.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/4_randomized_benchmarking.ipynb>`_.
it_it: Esegui in maniera interattiva su `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/4_randomized_benchmarking.ipynb>`_.
ta_in: ஊடாடும் வகையில் இயக்கவும் `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/4_randomized_benchmarking.ipynb>`_.
zh_tw: 在 `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/4_randomized_benchmarking.ipynb>`_中互動執行。

source: Randomized Benchmarking
bn_bn: এলোমেলোভাবে মাপকাঠি (বেঞ্চমার্কিং) বের করা
es_un: Análisis Comparativo Aleatorio
fr_fr: Analyse Comparative Aléatoire (Benchmarking Randomisé)
id_id: Patokan Acak
it_it: Benchmarking Casuale
ja_jp: ランダマイズド・ベンチマーキング
ko_kr: 랜덤화된 벤치마킹
pt_br: Benchmarking Randomizado
ru_ru: Рандомизированное тестирование
ta_in: சீரற்ற தரப்படுத்தல்
tr_tr: Rastgele Benchmarking(Değerlendirme deneyi)
zh_tw: 設立隨機化基準

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
id_id: Pendahuluan
it_it: Introduzione
ja_jp: はじめに
ko_kr: 소개
pt_br: Introdução
ru_ru: Введение
ta_in: முன்னுரை
tr_tr: Giriş
zh_tw: 簡介

source: **Randomization benchmarking (RB)** is a well-known technique to measure average gate performance by running sequences of random Clifford gates that should return the qubits to the initial state. Qiskit Ignis has tools to generate one- and two-qubit Clifford gate sequences simultaneously.
bn_bn: যুক্তিবর্তনীর (গেট) মূল কর্মক্ষমতা বের করবার জন্যে **রণ্ডমাইজেসন বেঞ্চমার্কিং** একটি এমন পদ্ধতি যেখানে এলোমেলো ক্রমে ক্লিফোর্ড গেট ব্যবহার করে কিউবিট গুলোকে প্রাথমিক অবস্থাতে ফেরত নিয়ে যাওয়া হয়। Qiskit ইগ্নিসে এই জন্যে এক এবং দুই-সংখক কিউবিট ক্লিফোর্ড যুক্তিবর্তনীর (গেট) ক্রম তৈরি করবার সুবিধা দেওয়া রয়েছে।
es_un: **El análisis comparativo aleatorio (Randomized Benchmarking, RB)** es una técnica bien conocida para medir el rendimiento promedio de las compuertas mediante la ejecución de secuencias aleatorias de compuertas Clifford que deberían devolver los qubits al estado inicial. Qiskit Ignis tiene herramientas para generar secuencias de compuertas Clifford de uno y dos qubits simultáneamente.
fr_fr: **Analyse comparative aléatoire (Randomization benchmarking RB)** est une technique bien connue pour mesurer la performance moyenne des portes en exécutant des séquences de portes Clifford aléatoires qui devraient retourner les qubits à l'état initial. Qiskit Ignis a des outils pour générer simultanément des séquences de portes Clifford à un ou deux qubits.
id_id: **Patokan acak (RB)** adalah teknik terkenal untuk mengukur performa gerbang rata-rata dengan menjalankan sekuens gerbang Clifford acak yang akan mengembalikan qubit ke keadaan awal. Qiskit Ignis memiliki alat untuk menghasilkan sekuens gerbang Clifford satu- dan dua-qubit secara bersamaan.
it_it: **Randomization benchmarking (RB)** è una nota tecnica di misurazione della prestazione media dei gate che consiste nell'eseguire una sequenza casuale di gate di Clifford che dovrebbe riportare i qubit allo stato iniziale. Qiskit Ignis fornisce gli strumenti per generare contemporanemente sequenze di gate di Clifford per uno e due qubit.
ja_jp: **ランダムマイズド・ベンチマーキング（RB）**は、量子ビットを初期状態に戻すランダムクリフォードゲートのシーケンスを実行して、平均ゲートパフォーマンスを測定するためのよく知られた手法です。Qiskit Ignis には、1および2量子ビットのクリフォードゲートシーケンスを同時に生成するツールがあります。
ko_kr: **랜덤화된 벤치마크 (RB)** 는 초기 상태로 큐비트를 리턴해야 하는 랜덤 클리포드 게이트의 시퀀스를 실행함으로써 평균 게이트 성능을 측정하기 위한 잘 알려진 기술이다. Qiskit Ignis는 1개 및 2개의 큐비트 Clifford 게이트 서열을 동시에 생성하는 툴을 갖는다.
pt_br: **benchmarking de randomização (RB)** é uma técnica bem conhecida para medir o desempenho médio do portão, executando sequências de portões Clifford aleatórios que devem devolver os qubits para o estado inicial. O Qiskit Ignis possui ferramentas para gerar sequências de portão Clifford de um e dois qubit simultaneamente.
ru_ru: **Рандомизационная характеризация (randomization benchmarking, RB)** — это хорошо известная техника измерения средней производительности вентилей путем запуска последовательностей случайных вентилей Клиффорда, которые должны возвращать кубиты в исходное состояние. В Qiskit Ignis есть инструменты для одновременной генерации одно- и двухкубитных последовательностей из вентилей Клиффорда.
ta_in: **Randomization benchmarking (RB)** என்பது சீரற்ற கிளிஃபோர்ட் வாயில்களின் காட்சிகளை இயக்குவதன் மூலம் சராசரி வாயில் செயல்திறனை அளவிடுவதற்கான ஒரு நன்கு அறியப்பட்ட நுட்பமாகும். Qiskit இக்னிஸ் ஒன்று மற்றும் இரண்டு-qubit கிளிஃபோர்ட் கேட் காட்சிகளை ஒரே நேரத்தில் உருவாக்கும் கருவிகளைக் கொண்டுள்ளது.
tr_tr: **Rastgele benchmarking (RB)**, kübitleri başlangıç durumuna döndürmesi gereken rastgele Clifford kapı dizilerini çalıştırarak ortalama kapı performansını ölçmek için iyi bilinen bir tekniktir. Qiskit Ignis, aynı anda bir ve iki kübitlik Clifford kapı dizileri oluşturmak için gerekli araçlara sahiptir.
zh_tw: **隨機化基準（ RB）** 是一種眾所周知的方法，可通過執行隨機克利福閘的序列來測量平均閘效能，這些序列會將量子位元返回到初始狀態。 Qiskit Ignis 有工具可以同時產生一個和兩個量子位元的Clifford 的閘序列。

source: This notebook gives an example for how to use the ``ignis.verification.randomized_benchmarking`` module. This particular example shows how to run 2-qubit randomized benchmarking (RB) simultaneous with 1-qubit RB. There are also examples on how to use some of the companion functions for predicting RB fidelity.
bn_bn: এই নোটবুকটিতে ``ignis.verification.randomized_benchmarking`` ব্যবহার করবার উদাহরণ দেওয়া আছে। এই বিশেষ উদাহরণে ২-কিউবিট রণ্ডমাইজড মাপকাঠি (বেঞ্চমার্কিং) কিভাবে ১- কিউবিট রণ্ডমাইজড মাপকাঠির (বেঞ্চমার্কিং) সাথে প্রয়োগ করা যেতে পারে তাহা দেখানো হয়েছে। রণ্ডমাইজড মাপকাঠি (বেঞ্চমার্কিং) - এর বিশ্বস্ততা ক্ষমতার অনুমানের ফাংশনের উদাহরণও দেওয়া হয়েছে এখানে।
es_un: Este cuaderno ofrece un ejemplo de cómo utilizar el módulo ``ignis.verification.randomized_benchmarking``. Este ejemplo en particular muestra cómo ejecutar el análisis comparativo aleatorio de 2 qubits simultáneamente con RB de 1 qubit. También hay ejemplos sobre cómo utilizar algunas de las funciones complementarias para predecir la fidelidad de RB.
fr_fr: Ce bloc-notes donne un exemple d'utilisation du module ``ignis.verification.randomized_benchmarking``. Cet exemple particulier montre comment exécuter le benchmarking randomisé de 2-qubit (RB) simultanément avec le RB à 1 qubit. Il y a aussi des exemples sur la façon d'utiliser certaines des fonctions complémentaires pour prédire la fidélité du RB.
id_id: Notebook ini memberikan contoh bagaimana menggunakan modul ``ignis.verification.randomized_benchmarking``. Contoh khusus ini menunjukkan bagaimana menjalankan patokan acak (RB) 2-qubit secara bersamaan dengan 1-qubit RB. Terdapat juga contoh tentang bagaimana menggunakan fungsi pendamping untuk memprediksi fidelitas RB.
it_it: Questo notebook fornisce un esempio su come utilizzare il modulo ``ignis.verification.randomized_benchmarking``. In particolare, mostra come eseguire contemporaneamente il randomized benchmarking (RB) a 2 e 1 qubit. Ci sono anche esempi su come utilizzare alcune funzioni di accompagnamento per la previsione della fidelity del RB.
ja_jp: このノートブックでは、``ignis.verification.randomized_benchmarking`` モジュールの使用方法を示します。 ここでの例として、1量子ビットRBと同時に2量子ビットRBを実行する方法を示します。また、RBの忠実度を予測するためのコンパニオン関数の一部を使用する方法についての例も示します。
ko_kr: 이 노트북은 ``ignis.verification.randomized_benchmarking`` 모듈을 사용하는 방법에 대한 예를 제공 한다. 제공되는 예시는 1큐비트 RB(무작위 벤치마킹)와 동시에 2큐비트 RB를 실행하는 방법을 보여준다. RB 정확도를 예측하기 위해 일부 추가 기능을 사용하는 방법에 대한 예시도 제공한다.
pt_br: Este notebook dá um exemplo de como usar o módulo ``ignis.verification.randomized_benchmarking``. Este exemplo específico mostra como executar o benchmarking randomizado 2-qubit (RB) simultâneo com o 1-qubit RB. Há também exemplos sobre como usar algumas funções complementares para prever a fidelidade RB.
ru_ru: В этом блокноте приводится пример использования модуля ``ignis.verification.randomized_benchmarking``. Этот конкретный пример показывает, как запустить 2-кубитную рандомизированную характеризацию (RB) одновременно с 1-кубитным RB. Также есть примеры использования некоторых сопутствующих функций для прогнозирования точности RB.
ta_in: ``ignis.verification.randomized_benchmarking`` தொகுதியை எவ்வாறு பயன்படுத்துவது என்பதற்கு இந்த நோட்புக் ஒரு எடுத்துக்காட்டு அளிக்கிறது. இந்த குறிப்பிட்ட எடுத்துக்காட்டு 1-qubit RB உடன் ஒரே நேரத்தில் 2-qubit சீரற்ற தரப்படுத்தல் (RB) ஐ எவ்வாறு இயக்குவது என்பதைக் காட்டுகிறது. RB நம்பகத்தன்மையை கணிக்க சில துணை செயல்பாடுகளை எவ்வாறு பயன்படுத்துவது என்பதற்கான எடுத்துக்காட்டுகள் உள்ளன.
tr_tr: Bu defter, ``ignis.verification.randomized_benchmarking`` modülünün nasıl kullanılacağına dair bir örnek verir. Bu özel örnek, 1 kübitlik RB ile eş zamanlı olarak 2 kübitlik RB'nin nasıl çalıştırılacağını göstermektedir. RB uygunluğunu tahmin etmek için bazı tamamlayıcı işlevlerin nasıl kullanılacağına dair örnekler de vardır.
zh_tw: 此記事本提供了如何使用 ` `ignis.verification.randomized_benchmarking`` 模組的範例。 此特定範例顯示如何與 1-qubit RB 同時執行 2-qubit 隨機化基準（RB）。 也有一些例子說明如何使用一些伴隨函數來預測 RB 的保真度。

source: 1) Select the Parameters of the RB Run
bn_bn: ১) রান্ডমাইজড বেঞ্চমার্কিং (র. বি) এর পরামিতিগুলি নির্বাচন কর
es_un: 1) Seleccionar los parámetros de la ejecución de RB
fr_fr: 1) Sélectionnez les paramètres de l'exécution RB
id_id: 1) Pilih Parameter dari Jalannya RB
it_it: 1) Selezionare i Parametri dell'esecuzione del RB
ja_jp: 1) RB実行におけるパラメータの選択
ko_kr: 1) RB Run의 파라미터를 선택한다.
pt_br: 1) Selecione os Parâmetros da Execução do RB
ru_ru: 1) Выбираем параметры запуска RB
ta_in: 1) RB இயக்கத்தின் அளவுருக்களைத் தேர்ந்தெடுக்கவும்
tr_tr: 1) RB Çalıştırmasının Parametrelerini Seçin
zh_tw: 1）選取 RB 執行的參數

source: First, we need to choose the following parameters:
bn_bn: প্রথমে আমাদের এই পরামিতিগুলি নির্বাচন করতে হবে:
es_un: Primero, necesitamos elegir los siguientes parámetros:
fr_fr: Tout d'abord, il faut choisir les valeurs pour les paramètres suivants:
id_id: Pertama, kita perlu memilih parameter berikut:
it_it: Per prima cosa si devono scegliere i seguenti parametri:
ko_kr: 먼저 다음의 매개 변수를 선택해야 한다.
ru_ru: Для начала необходимо выбрать следующие параметры:
ta_in: முதலில், பின்வரும் அளவுருக்களை நாம் தேர்வு செய்ய வேண்டும்:
tr_tr: İlk olarak aşağıdaki parametreleri seçmeliyiz:
zh_tw: 首先，我們需要選擇以下參數：

source: **nseeds:** The number of seeds. For each seed you will get a separate list of output circuits in rb_circs.
bn_bn: **nseeds:** বীজ (সীড) এর সংখ্যা। প্রত্যেক বীজ (সীড) এর জন্যে একাধিক উৎপাদিত বর্তনী (সার্কিট) তালিকা পাওয়া যাবে rb_circs এ।
es_un: **nseeds:** El número de semillas. Para cada semilla obtendrás una lista separada de circuitos de salida en rb_circs.
fr_fr: **nseeds:** Le nombre de graines. Pour chaque graine, vous obtiendrez une liste séparée de circuits de sortie dans rb\_circs.
id_id: **nseeds:** Jumlah seed. Untuk setiap seed Anda akan mendapatkan daftar terpisah dari sirkuit keluaran dalam rb_circs.
it_it: **nseeds:** Il numero di semi (seed). Per ogni seme si otterrà una lista separata di circuiti di output in rb_circs.
ko_kr: **n시드(nseeds)** 시드의 개수. 각 시드에 따른 분리된 출력 회로 목록을 rb_circs에서 가져온다.
ru_ru: **nseeds:** Количество зерен (случайных последовательностей гейтов). Для каждого seed вы получите отдельный список выходных цепей в rb_cirs.
ta_in: **nseeds:** விதைகளின் எண்ணிக்கை. ஒவ்வொரு விதைக்கும் நீங்கள் rb_circ களில் வெளியீட்டு சுற்று களின் தனி பட்டியலைப் பெறுவீர்கள்.
tr_tr: **nseeds:** Başlangıç değerlerinin sayısıdır. Her başlangıç değeri için rb_circs içerisindeki çıkış devrelerinin ayrı bir listesini elde edeceksiniz.
zh_tw: **nseeds:** 種子數。 對於每一個種子，您將取得 rb_circs 中個別輸出電路清單。

source: **length_vector:** The length vector of Clifford lengths. Must be in ascending order. RB sequences of increasing length grow on top of the previous sequences.
bn_bn: **length_vector:** ক্লিফোর্ড দৈর্ঘ্যগুলির দৈর্ঘ্যরাশি। এগুলি আরোহী ক্রমে থাকা দরকার। বর্তমান ক্রমবর্ধমান র. বি ক্রমগুলি আগেরর ক্রমগুলির উপরে বৃদ্ধি পায়।
es_un: **length_vector:** El vector con las longitudes de Clifford. Debe estar en orden ascendente. Las secuencias RB de longitud creciente aumentan sobre las secuencias anteriores.
fr_fr: **length\_vector:** Le vecteur de longueur de Clifford. Doit être dans un ordre ascendant. Les séquences RB de longueur croissante se développent au-dessus des séquences précédentes.
id_id: **length_vector:** Vektor panjang dari panjang Clifford. Harus berada dalam urutan menaik. Sekuens RB dari peningkatan panjang tumbuh di atas sekuens sebelumnya.
it_it: **length_vector:** Il vettore contenente il numero di gate di Clifford. Deve essere ordinato in ordine crescente. Le sequenze RB di lunghezza crescente sono in aggiunta a quelle precedenti.
ko_kr: **length_vector:** Clifford 길이의 길이 벡터. 오름차순이어야 한다. 길이가 증가하는 RB 서열은 이전 서열의 위에서부터 생성된다.
ru_ru: **length_vector:** Вектор клиффордовых длин (число клиффордовых вентилей в последовательности). Должен записываться в порядке возрастания. Последовательности RB возрастающей длины растут поверх предыдущих последовательностей.
ta_in: **length_vector:** கிளிஃபோர்டு நீளங்களின் நீள திசையன். ஏறுவரிசையில் இருக்க வேண்டும். அதிகரிக்கும் நீளத்தின் RB வரிசைமுறைகள் முந்தைய வரிசைமுறைகளின் மேல் வளரும்.
tr_tr: **length_vector:** Clifford uzunluklarının uzuluk vektörüdür. Artan sırada olmalıdır. Artan uzunlukların RB dizileri, önceki dizilerin üzerinde büyür.
zh_tw: **length_vector：** Clifford 長度向量的長度必須是以遞增順序排列。 增加長度的 RB 序列以前序列為基礎增長。

source: **rb_pattern:** A list of the form [[i,j],[k],…] which will make simultaneous RB sequences where Qi,Qj are a 2-qubit RB sequence and Qk is a 1-qubit sequence, etc. The number of qubits is the sum of the entries. For ‘regular’ RB the qubit_pattern is just [[0]],[[0,1]].
bn_bn: **rb_pattern:** [[i,j],[k],…] গঠনের একটি তালিকা যেখান থেকে যুগপত ভাবে র. বি ক্রমগুলো বানানো হবে। এখানে Qi,Qj হলো ২-কিউবিট র. বি ক্রমটি এবং Qk হলো একটি ১-কিউবিট ক্রম। এন্ট্রিগুলির যোগফল হলো কিউবিট এর সংখ্যা। 'regular' র. বি-এর জন্যে qubit_pattern [[0]],[[0,1]] দিলেই হবে।
es_un: **rb_pattern:** Una lista de la forma [[i,j],[k],…] que creará secuencias RB simultáneas donde Qi, Qj son una secuencia RB de 2-qubit y Qk es una secuencia de 1-qubit, etc. El número de qubits es la suma de las entradas. Para RB 'regular', el patrón qubit_pattern es sólo [[0]],[[0,1]].
fr_fr: **rb\_pattern:** Une liste de la forme [[i,j],[k],... qui fera des séquences RB simultanées où Qi,Qj est une séquence RB de 2 qubits et Qk est une séquence à 1-qubits, etc. Le nombre de qubits est la somme des entrées. Pour le RB 'regular' (régulier) le qubit\_pattern est juste [[0]],[[0,1]].
id_id: **rb_pattern:** Sebuah daftar dalam bentuk [[i,j],[k],…] yang akan membuat sekuens RB bersamaan di mana Qi, Qj adalah sekuens RB 2-qubit dan Qk adalah sekuens 1-qubit, dll. Banyaknya qubit adalah jumlah dari entri. Untuk RB 'regular' qubit_pattern hanyalah [[0]],[[0,1]].
it_it: **rb_pattern:** Una lista della forma [[i,j],[k],…] che permette di eseguire sequenze di RB contemporaneamente, dove Qi,Qj sono una sequenza di RB a 2 qubit e Qk è una sequenza a un 1 qubit, ecc. Il numero di qubit è la somma delle voci. Nel caso di RB tradizionale, il qubit\_pattern è semplicemente [[0]],[[0,1]].
ko_kr: **rb_pattern:** Qi, Qj가 2-큐비트 RB 시퀀스이고 Qk가 1-큐비트 시퀀스인 동시 RB 시퀀스의 목록으로 [[i, j], [k],…] 형태의 list. 큐비트의 수는 항목들의 합계이다. ‘정규‘ RB의 경우, qubit_pattern은 [[0]], [[0, 1]] 이다.
ru_ru: **rb_pattern:** Список вида [[i,j],[k],…], определяющий одновременные RB последовательности, в котором Qi,Qj — 2-кубитная RB последовательность и Qk — 1-кубитная и т.д. Количество кубитов — это сумма входных элементов. Для ‘обычного’ RB это просто [[0]],[[0,1]].
ta_in: **rb_pattern:** படிவத்தின் பட்டியல் [[i, j], [k],…] ஒரே நேரத்தில் RB வரிசைகளை உருவாக்கும், அங்கு Qi, Qj 2-க்யூபிட் RB வரிசை மற்றும் Qk 1-க்யூபிட் வரிசை, முதலியன. க்யூபிட்ஸ்களின் எண்ணிக்கை உள்ளீடுகளின் தொகை. ‘வழக்கமான’ RB க்கு, qubit_pattern என்பது வெறும் [[0]], [[0,1]].
tr_tr: **rb_pattern:** Qi,Qj nin 2 kübitli RB dizisi ve Qk nin 1 kübitli dizi olduğu yerde eş zamanlı RB dizileri yapacak form [[i,j],[k],…] listesidir. Kübit sayısı girişlerin toplamıdır. ‘Normal’ RB için qubit_pattern sadece [[0]],[[0,1]] şeklindedir.
zh_tw: **rb_pattern：** 為一個以 [[i, j], [k],...] 格式的清單，此清單將同時生成 RB 序列，其中Qi和Qj是二量子位元 RB序列，Qk是一量子位元序列，等。量子位元的數目是輸入項目的總和。 對於 '常規' RB 而言， 其qubit_pattern 即為 [[0]]，[[0，1]]。

source: **length_multiplier:** If this is an array it scales each rb_sequence by the multiplier.
bn_bn: **length_multiplier:** এটি যদি array হয়ে তাহলে প্রত্যেক rb_sequence গুনোক দ্বারা গুনিত হবে।
es_un: **length_multiplier:** Si este es una arreglo, entonces escala cada rb_sequence por el multiplicador.
fr_fr: **length\_multiplier:** Si c'est un tableau, il met à l'échelle chaque rb\_sequence par le multiplicateur.
id_id: **length_multiplier:** Jika ini adalah array ini mengalikan setiap rb_sequence dengan pengalinya.
it_it: **length_multiplier:** Nel caso in cui venga passato un vettore, riscala ogni rb_sequence per il moltiplicatore.
ko_kr: **length_multiplier:** 이 값이 배열이면 각 rb_sequence를 곱셈기로 스케일링한다.
ru_ru: **length_multiplier:** Если это массив, то каждая RB последовательность умножается на множитель.
ta_in: ** length_multiplier: ** இது ஒரு வரிசை என்றால், அது ஒவ்வொரு rb_sequence - ஐ அடுத்து பெருக்கினால் அளவிடுகிறது.
tr_tr: **length_multiplier:** Eğer bu bir dizi ise her rb_sequence i çarpana göre ölçeklendirir.
zh_tw: ** length_multiplier: ** 如果這是一個陣列，其將對每一個 rb_sequence 乘以一個乘數。

source: **seed_offset:** What to start the seeds at (e.g. if we want to add more seeds later).
bn_bn: **seed_offset:** সীডগুলি কোন মান থেকে শুরু হবে (যদি পরে আরো সীড যোগ করতে হয়)।
es_un: **seed_offset:** En qué iniciar las semillas (por ejemplo, si queremos añadir más semillas después).
fr_fr: **seed\_offset:** Indique où commencent les graines (par exemple, si nous voulons ajouter plus de graines plus tard).
id_id: **seed_offset:** Untuk memulai seed di mana (misalnya jika kita ingin menambahkan seed lebih banyak lagi nanti).
it_it: **seed_offset:** Da cosa iniziare i semi (ad esempio, se vogliamo aggiungere altri semi in seguito).
ko_kr: **seed_offset:** (예: 나중에 더 많은 시드를 추가하고자 하는 경우) 시드를 시작하는 것.
ru_ru: **seed_offset:** С какого значения seed начинать (например, если позже мы захотим добавить больше зерен).
ta_in: **seed_offset:** விதைகளை எதைத் தொடங்குவது (எ.கா. நாம் பின்னர் அதிக விதைகளைச் சேர்க்க விரும்பினால்).
tr_tr: **seed_offset:** Başlangıç değerine nerede başlayacağız (örneğin daha sonra daha fazla başlangıç değeri eklemek istersek).

source: **align_cliffs:** If true adds a barrier across all qubits in rb_pattern after each set of cliffords.
bn_bn: **align_cliffs:** 'True' হলে ক্লিফোর্ডস সেট এর পরে rb_pattern এর প্রত্যেক কিউবিটে একটি বেষ্টনী যোগ করে দেওয়া হবে।
es_un: **align_cliffs:** Si es verdadero añade una barrera que atraviese a todos los qubits en rb_pattern después de cada conjunto de cliffords.
fr_fr: **align\_cliffs:** Si vrai ajouter une barrière à tous les qubits dans rb\_pattern après chaque ensemble de cliffords.
id_id: **align_cliffs:** Jika benar, tambahkan penghalang untuk semua qubit di rb_pattern setelah setiap set clifford.
it_it: **align_cliffs:** Se impostato a true, dopo ogni insieme di gate di Clifford aggiunge una barriera in rb_pattern su tutti i qubit.
ko_kr: **align_cliffs:** true이면 각각의 cliffords의 집합 뒤에 rb_pattern의 모든 큐비트에 걸쳐 barrier를 추가한다.
ru_ru: **align_cliffs:** Если true, добавляет барьер для всех кубитов в rb_pattern после каждого набора вентилей клиффорда.
ta_in: **align_cliffs:** உண்மை என்றால், ஒவ்வொரு கிளிஃபோர்டுகளுக்கும் பிறகு rb_pattern இல் உள்ள அனைத்து qubitகளிலும் ஒரு தடையை சேர்க்கிறது.
tr_tr: **align_cliffs:** Eğer true ise her cliffords kümesinden sonra rb_pattern içerindeki tüm kübitler boyunca bir bariyer ekler.
zh_tw: **align_cliffs:** 如果為真，則在每組 Cliffords 之後，在 rb_pattern 中的所有量子位元都會新增一個屏障。

source: In this example we have 3 qubits Q0,Q1,Q2. We are running 2Q RB (on qubits Q0,Q2) and 1Q RB (on qubit Q1) simultaneously, where there are twice as many 1Q Clifford gates.
bn_bn: এখানে আমাদের কাছে Q0,Q1,Q2 এই ৩টে কিউবিট আছে। 2Q RB (Q0,Q2 কিউবিটগুলিতে) এবং 1Q RB (Q1 কিউবিটে) একসাথে চালানো হচ্ছে (এখানে দ্বিগুণ বেশি ১Q ক্লিফোর্ড গেট রয়েছে)।
es_un: En este ejemplo tenemos 3 qubits Q0,Q1,Q2. Estamos ejecutando 2Q RB (en los qubits Q0,Q2) y 1Q RB (en el qubit Q1) simultáneamente, donde hay el doble de compuertas Clifford 1Q.
fr_fr: Dans cet exemple, nous avons 3 qubits Q0,Q1,Q2. Nous exécutons 2Q RB (sur qubits Q0,Q2) et 1Q RB (sur qubit Q1) simultanément, où il y a deux fois plus de portes Clifford 1Q.
id_id: Dalam contoh ini kita memiliki 3 qubit Q0, Q1, Q2. Kita menjalankan RB 2Q (pada qubit Q0, Q2) dan RB 1Q (pada qubit Q1) secara bersamaan, di mana terdapat dua kali lebih banyak gerbang Clifford 1Q.
it_it: In questo esempio abbiamo 3 qubit Q0, Q1, Q2. Stiamo eseguendo simultaneamente 2Q RB (sui qubit Q0,Q2) e 1Q RB (sul qubit Q1) dove ci sono il doppio di gate di Clifford ad 1 qubit.
ja_jp: この例では、3つの量子ビットQ0、Q1、Q2があります。2Q RB（量子ビット Q0、Q2）と1Q RB（量子ビットQ1）を同時に実行しています。1Qクリフォードゲートの数は2倍です。
ko_kr: 이 예제에서는 3개의 큐비트(Q0, Q1, Q2)를 사용한다. 2Q RB (큐비트 Q0, Q2) 와 1Q RB (큐비트 Q1)를 동시에 실행하며, 여기서, 1Q 클리포드 게이트가 2배 더 많다.
pt_br: Neste exemplo, temos 3 qubits Q0,Q1,Q2. Estamos executando simultaneamente o 2Q RB (no qubits Q0,Q2) e 1Q RB (no qubit Q1), onde há o dobro de portões Clifford 1Q.
ru_ru: В этом примере у нас есть 3 кубита Q0, Q1, Q2. Мы одновременно выполняем 2Q RB (на кубитах Q0, Q2) и 1Q RB (на кубите Q1), где в два раза больше 1Q клиффордовских вентилей.
ta_in: இந்த எடுத்துக்காட்டில் Q3, Q1, Q2 என்ற 3 க்யூபிட்கள் உள்ளன. நாங்கள் ஒரே நேரத்தில் 2Q RB (க்யூபிட்ஸ் Q0, Q2 இல்) மற்றும் 1Q RB (க்யூபிட் Q1 இல்) ஆகியவற்றை இயக்குகிறோம், அங்கு 1Q கிளிஃபோர்ட் வாயில்கள் இரு மடங்கு அதிகம்.
tr_tr: Bu örnekte 3 kübitimiz Q1,Q2,Q3 var. Aynı anda 2Q RB (Q0, Q2 kübitlerinde) ve 1Q RB'yi (Q1 kübitinde) çalıştırıyoruz, iki kat daha fazla 1Q Clifford kapısının olduğu yerde.
zh_tw: 在此範例中，我們有 3 個量子位元Q0，Q1，Q2。 我們同時執行 2Q RB （位於量子位元 Q0、Q2 ）和 1Q RB （在量子位元Q1 上），其中有兩倍多的 1Q Clifford閘。

source: 2) Generate the RB sequences
bn_bn: ২) র. বি ক্রমগুলী উৎপন্ন করা।
es_un: 2) Generar las secuencias RB
fr_fr: 2) Générer les séquences RB
id_id: 2) Membuat sekuens RB
it_it: 2) Generare le sequenze di RB
ja_jp: 2) RBシーケンスを生成する
ko_kr: 2) RB 서열을 생성한다.
pt_br: 2) Gere as sequências de RB
ru_ru: 2) Создаем RB последовательности
ta_in: 2) RB வரிசைகளை உருவாக்கவும்
tr_tr: 2) RB dizilerini oluşturun
zh_tw: 2）產生 RB 序列
