Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/4_randomized_benchmarking.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: We generate RB sequences. We start with a small example (so it doesn’t take too long to run).
bn_bn: র. বি ক্রম আমরা এখানে উৎপাদন করি। যাতে তাড়াতাড়ি হয়ে যায় সেই জন্যে এখানে ছোট উদাহরণ দেওয়া হয়েছে প্রথমে।
es_un: Generemos secuencias RB. Empecemos con un pequeño ejemplo (por lo que no tarda demasiado en ejecutarse).
fr_fr: Nous générons des séquences RB. Nous commençons par un petit exemple (pour que cela ne prenne pas trop de temps).
id_id: Kita buat sekuens RB. Kita mulai dengan contoh kecil (sehingga tidak akan memakan banyak waktu untuk menjalankannya).
it_it: Generiamo le sequenze RB. Partiamo con un piccolo esempio (così da non impiegare molto tempo nell'esecuzione).
ko_kr: RB 서열을 생성한다. 작은 예제로 시작할 것이기때문에 실행에 시간이 많이 걸리지는 않을 것이다.
ru_ru: Мы формируем RB последовательности. Начнем с небольшого примера (чтобы не пришлось долго запускать).
ta_in: நாங்கள் RB காட்சிகளை உருவாக்குகிறோம். நாங்கள் ஒரு சிறிய எடுத்துக்காட்டுடன் தொடங்குகிறோம் (எனவே இயங்க அதிக நேரம் எடுக்காது).
tr_tr: RB dizileri oluşturuyoruz. Küçük bir örnekle başlıyoruz (böylece çalıştırmak çok uzun sürmüyor).
zh_tw: 我們生成RB序列。 我們從一個小例子開始（如此才不會花太多時間來執行）。

source: In order to generate the RB sequences **rb_circs**, which is a list of lists of quantum circuits, we run the function ``rb.randomized_benchmarking_seq``.
bn_bn: ``rb.randomized_benchmarking_seq`` ফাংশন চালিয়ে আমরা **rb_circs** র.বি ক্রমগুলি পাই। এই **rb_circs** হলো কোয়ান্টাম সার্কিটের একটি তালিকা।
es_un: Para generar las secuencias RB **rb_circs**, que es una lista de listas de circuitos cuánticos, ejecutamos la función ``rb.randomized_benchmarking_seq``.
fr_fr: Afin de générer les séquences RB **rb\_circs**, qui est une liste de listes de circuits quantiques, nous exécutons la fonction ``rb.randomized_benchmarking_seq``.
id_id: Untuk membuat sekuens RB **rb_circs**, yang mana adalah daftar dari daftar sirkuit kuantum, kita jalankan fungsi ``rb.randomized_benchmarking_seq``.
it_it: Per generare le sequenze di RB **rb_circs**, che è una lista di liste di circuiti quantistici, si esegue la funzione ``rb.randomized_benchmarking_seq``.
ko_kr: 양자 회로 목록들의 목록인 RB 시퀀스 **rb_circs** 를 생성하기 위해 ``rb.randomized_benchmarking_seq`` 를 실행한다.
ru_ru: Для создания RB-последовательностей **rb_circs**, которые представляют собой список из списков квантовых цепей, мы запускаем функцию ``rb.randomized_benchmarking_seq``.
ta_in: குவாண்டம் சுற்றுகளின் பட்டியல்களின் பட்டியலான RB காட்சிகளை **rb_circs** உருவாக்க, ``rb.randomized_benchmarking_seq`` செயல்பாட்டை இயக்குகிறோம்.
tr_tr: RB dizileri **rb_circs**, kuantum devreleri listesinin bir listesi, oluşturmak için ``rb.randomized_benchmarking_seq`` fonksiyonunu çalıştırıyoruz.
zh_tw: 為了產生 RB 序列 **rb_cris**，我們運行了 ` ``rb.randomized_benchmarking_seq`` 函數。(**rb_circs**是一個清單，此清單的每個元素各自為一個量子電路清單。)

source: This function returns:
bn_bn: ফাংশনটি ফেরত দেয়:
es_un: Esta función devuelve:
fr_fr: Cette fonction renvoie:
id_id: Fungsi ini mengembalikan:
it_it: Questa funzione restituisce:
ja_jp: この関数は次を返します:
ko_kr: 이 함수는 다음을 리턴한다.
pt_br: Esta função retorna:
ru_ru: Эта функция возвращает:
ta_in: இந்த செயல்பாடு இவ்வாறு விடை தரும்:
tr_tr: Bu işlev şunları döndürür:
zh_tw: 此函數傳回：

source: **rb_circs:** A list of lists of circuits for the rb sequences (separate list for each seed).
bn_bn: **rb_circs:** র. বি ক্রমগুলোর জন্যে বর্তনীর তালিকার একটি তালিকা (প্রত্যেক সিডের আলাদা তালিকা বানানো দরকার)।
es_un: **rb_circs:** Una lista de listas de circuitos para las secuencias rb (una lista separada para cada semilla).
fr_fr: ** rb\_circs:** Une liste des listes de circuits pour les séquences rb (liste séparée pour chaque graine).
id_id: **rb_circs:** Daftar dari daftar sirkuit untuk sekuens rb (daftar terpisah untuk setiap seed).
it_it: **rb_circs:** Una lista di liste di circuiti per le sequenze di rb (una lista separata per ogni seme utilizzato).
ko_kr: **rb_circs:** rb 시퀀스에 대한 회로 목록의 목록 (각 시드 별로 생성된 리스트).
ru_ru: **rb_circs:** Список из списков цепей для rb последовательностей (отдельный список для каждого seed).
ta_in: **rb_circs:** rb காட்சிகளுக்கான சுற்றுகளின் பட்டியல்களின் பட்டியல் (ஒவ்வொரு விதைக்கும் தனி பட்டியல்).
tr_tr: **rb_circs:** rb dizileri için devre listelerinin bir listesi (her başlangıç değeri için ayrı liste).
zh_tw: **rb_circs：** ˊ對於rb 序列，一個元素為電路清單的清單（每一個種子的個別清單）。

source: **xdata:** The Clifford lengths (with multiplier if applicable).
bn_bn: **xdata:** ক্লিফোর্ড দৈর্ঘ্য গুলো (প্রযোজ্য ক্ষেত্রে গুণক সহ)।
es_un: **xdata:** Las longitudes de Clifford (con un multiplicador si aplica).
fr_fr: ** xdata:** Les longueurs de Clifford (avec multiplicateur le cas échéant).
id_id: **xdata:** Panjang Clifford (dengan pengali jika berlaku).
it_it: **xdata:** Le lunghezze di Clifford (con un fattore moltiplicativo se applicabile).
ja_jp: **xdata:** クリフォードの長さ（該当する場合は乗数を含む）。
ko_kr: **xdata:** Clifford 길이 (mulitplier 가있다면 포함되어 있음).
pt_br: **xdata:** Os comprimentos Clifford (com multiplicador, se aplicável).
ru_ru: **xdata:** Длины последовательностей из операторов Клиффорда (с множителем, если это применимо).
ta_in: **xdata:** கிளிஃபோர்ட் நீளம் (பொருந்தினால் பெருக்கத்துடன்).
tr_tr: **xdata:** Clifford uzunlukları (varsa çarpanıyla birlikte).
zh_tw: **xdata:** Clifford 長度（適用時具有乘數）。

source: As an example, we print the circuit corresponding to the first RB sequence:
bn_bn: এখানে উদাহরণ হিসাবে প্রথম র. বি ক্রম এর বর্তনীটি (সার্কিট) প্রিন্ট করে দেখানো হয়ছে।
es_un: Como ejemplo, imprimimos el circuito correspondiente a la primera secuencia RB:
fr_fr: Par exemple, nous imprimons le circuit correspondant à la première séquence RB:
id_id: Sebagai contoh, kita mencetak sirkuit sesuai denga sekuens RB pertama:
it_it: Come esempio, visualizziamo il circuito corrispondente alla prima sequenza di RB:
ja_jp: 例として、最初のRBシーケンスに対応する回路を出力します。
ko_kr: 예를 들어 다음과 같이 첫 번째 RB 시퀀스에 해당하는 회로를 출력한다.
pt_br: Como exemplo, imprimimos o circuito correspondente à primeira sequência de RB:
ru_ru: В качестве примера выведем схему, соответствующую первой RB последовательности:
ta_in: உதாரணமாக, முதல் RB வரிசைக்கு ஒத்த சுற்றுகளை அச்சிடுகிறோம்:
tr_tr: Örnek olarak, ilk RB dizisine karşılık gelen devreyi yazdırıyoruz:
zh_tw: 舉例，我們列印對應於第一個 RB 序列的電路：

source: Look at the Unitary for 1 Circuit
bn_bn: ১ বর্তনীর (সার্কিট) ঐকিকটিকে (ইউনিটারি) দেখো
es_un: Observa a la Unitaria para 1 Circuito
fr_fr: Regardez l'Unitaire pour 1 Circuit
id_id: Lihat ke Unitari untuk 1 Sirkuit
it_it: Visualizzare la Matrice Unitaria di 1 Circuito
ja_jp: 1回路のユニタリーを見る
ko_kr: 1회로의 유니터리(unitary) 를 보면
pt_br: Veja a Unitária para 1 Circuito
ru_ru: Посмотрим на унитарность цепи 1
ta_in: 1 சுற்றுக்கான யூனிட்டரியைப் பாருங்கள்
tr_tr: 1 devre için ünitere bakın
zh_tw: 請看此相對於一個電路的Unitary矩陣 (一個Unitary矩陣代表了一個RB電路)

source: The Unitary representing each RB circuit should be the identity (with a global phase), since we multiply random Clifford elements, including a computed reversal gate. We simulate this using an Aer unitary simulator.
bn_bn: আমরা এখানে এলোমেলো ক্লিফোর্ড উপাদান (এর সাথে গণিত বিপরীত যুক্তিবর্তনী (গেইট) ও থাকে) গুন করি। তাই কলিত বিপরীতার্থক যুক্তিবর্তনী (গেট) সহ প্রত্যেক র. বি বর্তনীর ঐকিকটি (ইউনিটারিটি) সার্বজনীন দশা-যুক্ত অভেদক হওয়া দরকার। Aer এর ঐকিক (ইউনিটারি) সিমুলাটেরের সাহায্যে এটি করা সম্ভব।
es_un: La Unitaria que representa a cada circuito RB debe ser la identidad (con una fase global), ya que multiplicamos elementos Clifford aleatorios, incluida una puerta de inversión calculada. Simulamos esto usando un simulador unitario Aer.
fr_fr: L'Unitaire représentant chaque circuit RB devrait être l'identité (avec une phase globale), puisque nous multiplions les éléments aléatoires de Clifford, y compris une porte d'inversion calculée. Nous simulons cela à l'aide d'un simulateur unitaire Aer.
id_id: Unitari yang mewakili setiap sirkuit RB harus menjadi identitas (dengan fasa global), karena kita mengalikan elemen Cliffor acak, termasuk gerbang pembalikan yang dihitung. Kita mensimulasikan ini menggunakan simulator Aer unitari.
it_it: La matrice Unitaria che rappresenta ciascun circuito di RB dovrebbe essere l'identità (a meno di una fase globale), dato che stiamo semplicemente moltiplicando casualmente elementi di Clifford, incluso in gate calcolato di inversione. Andiamo ad utilizzare un simulatore lo unitary simulator di Aer.
ja_jp: 計算された反転ゲートを含むランダムなクリフォード要素をかけているため、各RB回路を表すユニタリー行列は（グローバル位相で）恒等変換である必要があります。Aerユニタリーシミュレータを使用してこれをシミュレートします。
ko_kr: 각각의 RB 회로를 나타내는 유니테리는 (global phase와 함께) Identity가 되어야 하며, 그 이유는, 우리가 계산된 반전 게이트를 포함하는 랜덤 클리포드 요소들을 곱하기 때문이다. Aer 유니테리 시뮬레이터를 사용하여 이를 시뮬레이션한다.
pt_br: O Unitário representando cada circuito RB deve ser a identidade (com uma fase global), já que multiplicamos elementos Clifford aleatórios, incluindo um portão de reversão computada. Simulamos isso usando um simulador de unidade Aer.
ru_ru: Унитарный оператор, представляющий каждую RB-цепь, должен быть единичным (с глобальной фазой), поскольку мы перемножаем случайные элементы из группы Клиффорда, включая вычисленные обратные гейты. Мы симулируем это с помощью унитарного симулятора Aer.
ta_in: ஒவ்வொரு RB சுற்றுகளையும் குறிக்கும் ஒற்றுமை அடையாளமாக இருக்க வேண்டும் (உலகளாவிய கட்டத்துடன்), ஏனெனில் நாம் கணக்கிடப்பட்ட தலைகீழ் வாயில் உட்பட சீரற்ற கிளிஃபோர்ட் கூறுகளை பெருக்குகிறோம். ஏர் யூனிட்டரி சிமுலேட்டரைப் பயன்படுத்தி இதை உருவகப்படுத்துகிறோம்.
tr_tr: Her RB devresini temsil eden üniter, hesaplanmış bir ters kapı da dahil olmak üzere rastgele Clifford ögelerini çarptığımız için, birim matris (global faz ile birlikte) olmalıdır.
zh_tw: 代表每個 RB 電路的Unitary矩陣是單位矩陣（具有全局相位），因為我們乘以隨機的Clifford元素，包括計算出的反轉閘。 我們用一個 Aer 幺正模擬器來模擬。

source: Define the noise model
bn_bn: ত্রুটি নকশাটি সংজ্ঞায়িত কর
es_un: Definir el modelo de ruido
fr_fr: Définir le modèle de bruit
id_id: Definisikan model noise
it_it: Definire il modello di rumore
ja_jp: ノイズモデルを定義する
ko_kr: 노이즈 모델 정의하기
pt_br: Definir o modelo de ruído
ru_ru: Определяем модель шума
ta_in: இரைச்சல் மாதிரியை வரையறுக்கவும்
tr_tr: Gürültü modelini tanımlayın
zh_tw: 定義雜訊模型

source: We define a noise model for the simulator. To simulate decay, we add depolarizing error probabilities to the CNOT and U gates.
bn_bn: সিমুলেটর এর জন্যে আমরা একটি ত্রুটি নকশা বানাই। এখানে আমরা CNOT এবং U যুক্তিবর্তনীগুলিতে (গেটগুলিতে) বিমেরুকরণ (ডিপোলারাইজেশন) ত্রুটিও যুক্ত করি যাতে ক্ষয় অনুকরণ করা যেতে পারে।
es_un: Definimos un modelo de ruido para el simulador. Para simular el decaimiento, añadimos probabilidades de errores despolarizantes a las compuertas CNOT y U.
fr_fr: Nous définissons un modèle de bruit pour le simulateur. Pour simuler la décadence, nous ajoutons des probabilités d'erreur dépolarisantes aux portes CNOT et U.
id_id: Kita definisikan model noise untuk simulator. Untuk mensimulasikan peluruhan, kita tambahkan probabilitas eror depolarisasi ke gerbang CNOT dan U.
it_it: Definiamo un modello di rumore da utilizzare nel simulatore. Per simulare il decadimento, aggiungiamo probabilità che avvenga un errore di depolarizzazione nei gate CNOT e U.
ja_jp: シミュレータのノイズモデルを定義します。減衰をシミュレートするために、CNOTおよびUゲートに脱分極誤差確率を追加します。
ko_kr: 우리는 시뮬레이터에 대한 잡음 모델을 정의한다. 감쇠를 시뮬레이션하기 위해, CNOT과 U 게이트에 편극소거(depolarizing) 에러 확률을 추가한다.
pt_br: Definimos um modelo de ruído para o simulador. Para simular o decaimento, adicionamos probabilidades de erro de despolarizamento às portas CNOT e U.
ru_ru: Мы определяем модель шума для симулятора. Чтобы смоделировать затухание, мы добавляем вероятность ошибки деполяризации к вентилям CNOT и U.
ta_in: ஒப்புருவாக்கிக்கான இரைச்சல் மாதிரியை நாங்கள் வரையறுக்கிறோம். சிதைவை உருவகப்படுத்த, CNOT மற்றும் U கேட்களில் depolarizing பிழை நிகழ்தகவுகளைச் சேர்க்கிறோம்.
tr_tr: Simülatör için bir gürültü modeli tanımlıyoruz. Bozulmayı simüle etmek için, CNOT ve U kapılarına depolarize edici hata olasılıkları ekliyoruz.
zh_tw: 我們為此模擬器定義了一個噪音模型。 為了模擬衰變，我們在 CNOT 和 U 閘上增加了去極化誤差概率。

source: 3) Execute the RB sequences on Aer simulator
bn_bn: ৩) Aer সিমুলেটর এ র.বি ক্রমগুলি চালাও
es_un: 3) Ejecutar las secuencias RB en el simulador Aer
fr_fr: 3) Exécuter les séquences RB sur le simulateur Aer
id_id: 3) Eksekusi sekuens RB di simulator Aer
it_it: 3) Eseguire la sequenza di RB sul simulatore Aer
ja_jp: 3）AerシミュレータでRBシーケンスを実行する
ko_kr: 3) Aer 시뮬레이터에서 RB 시퀀스 실행하기
pt_br: 3) Execute as sequências de RB no simulador Aer
ru_ru: 3) Запуск последовательностей RB на симуляторе Aer
ta_in: 3) ஏர் ஒப்புருவாக்கியில் RB காட்சிகளை இயக்கவும்
tr_tr: 3) Aer simülatöründe RB dizilerini yürütün
zh_tw: 3）在 Aer 模擬器上執行 RB 序列

source: We can execute the RB sequences either using a Qiskit Aer Simulator (with some noise model) or using an IBMQ provider, and obtain a list of results, ``result_list``.
bn_bn: ত্রুটি নকশা-যুক্ত Qiskit এর Aer সিমুলেটর বা IBMQ প্রোভাইডারের সাহায্যে আমরা র.বি করমগুলী চালিয়ে তা থেকে ``result_list`` পাই।
es_un: Podemos ejecutar las secuencias RB utilizando un simulador Aer de Qiskit (con algún modelo de ruido) o usando un proveedor IBMQ, y obtener una lista de resultados, ``result_list``.
fr_fr: Nous pouvons exécuter les séquences RB soit en utilisant un Qiskit Aer Simulator (avec un modèle de bruit) soit en utilisant un fournisseur de service IBMQ, et obtenir une liste de résultats, ``result_list``.
id_id: Kita dapat mengeksekusi sekuens RB dengan menggunakan simulator Qiskit Aer (dengan beberapa model noise) atau dengan provider IBMQ, dan mendapatkan daftar hasil, ``result_list``.
it_it: Possiamo eseguire le sequenze di RB sia utilizzando un Simulatore di Qiskit Aer (associato ad un modello di rumore), sia un provider IBMQ, ottenendo una lista di risultati, ``result_list``.
ja_jp: Qiskit Aer シミュレーター（ノイズモデル版）またはIBMQプロバイダーを使用してRBシーケンスを実行し、結果のリスト``result_list``を取得できます。
ko_kr: Qiskit Aer Simulator를 사용하거나 IBMQ 공급자를 사용하여 RB 시퀀스를 실행하고, 결과 목록 ( ``result_list``) 을 얻을 수 있다.
pt_br: Podemos executar as sequências de RB usando um Qiskit Aer Simulador (com algum modelo de ruído) ou usando um provedor IBMQ, e obter uma lista de resultados, ``result_list``.
ru_ru: RB последовательности можно запускать либо с помощью Qiskit Aer Simulator (с некоторой моделью шума), либо с помощью провайдера IBMQ, и получать список результатов ``result_list``.
ta_in: ஒரு Qiskit ஏர் ஒப்புருவாக்கியைப் பயன்படுத்தி (சில இரைச்சல் மாதிரியுடன்) அல்லது ஒரு IBMQ வழங்குநரைப் பயன்படுத்தி RB காட்சிகளை இயக்கலாம், மேலும் ``result_list`` முடிவுகளின் பட்டியலைப் பெறலாம்.
tr_tr: RB dizilerini bir Qiskit Aer Simülatörü (bazı gürültü modelleriyle) ya da bir IBMQ sağlayıcısı kullanarak yürütebilir ve sonuçların bir listesini elde edebiliriz, ``result_list``.
zh_tw: 我們可以使用 Qiskit Aer Simulator （具有某種雜訊模型）或使用 一個 IBMQ provider 以執行 RB 序列，並取得結果清單 ``result_list``。

source: 4) Fit the RB results and calculate the gate fidelity
bn_bn: ৪) র.বি ফলাফলগুলি ফিট করিয়ে যুক্তিবর্তনী (গেইট) এর বিশ্বস্ততা গণনা করো
es_un: 4) Ajustar los resultados del RB y calcular la fidelidad de la compuerta
fr_fr: 4) Ajuster les résultats du RB et calculer la fidélité de la porte
id_id: 4) Sesuaikan hasil RB dan kalkulasi fidelitas gerbang
it_it: 4) Calcolare la fidelity dei gate utilizzando i risultati del RB
ja_jp: 4）RB結果を当てはめ、ゲート忠実度を計算する
ko_kr: 4) RB 결과 근사와 게이트 충실도 계산
pt_br: 4) Ajuste os resultados do RB e calcule a fidelidade da porta
ru_ru: 4) Аппроксимация результатов RB и расчет точности вентилей
ta_in: 4) RB முடிவுகளைப் பொருத்தி, வாயில் நம்பகத்தன்மையைக் கணக்கிடுங்கள்
tr_tr: 4) RB sonuçlarını fit edin ve kapı doğruluğunu hesaplayın
zh_tw: 4）擬合其RB 結果並計算其閘的保真度

source: Get statistics about the survival probabilities
bn_bn: উদ্বর্তন সম্ভাবনা সম্পর্কে পরিসংখ্যান গণনা করো
es_un: Obtener estadísticas sobre las probabilidades de supervivencia
fr_fr: Obtenir des statistiques sur les probabilités de survie
id_id: Dapatkan statistik mengenai probabilitas kelangsungannya
it_it: Ottenere statistiche sulle probabilità di sopravvivenza
ja_jp: 生存確率に関する統計を取得する
ko_kr: Survival Probabilities에 대한 통계 얻기
pt_br: Obter estatísticas sobre as probabilidades de sobrevivência
ru_ru: Получение статистики о вероятности выживания
ta_in: உயிர்வாழும் நிகழ்தகவுகள் பற்றிய புள்ளிவிவரங்களைப் பெறுங்கள்
tr_tr: Hayatta kalma ihtimali hakkında istatistikleri alın
zh_tw: 取得存活機率的統計資料

source: The results in **result_list** should fit to an exponentially decaying function :math:`A \cdot \alpha ^ m + B`, where :math:`m` is the Clifford length.
bn_bn: গুণোত্তর হারে ক্ষয়িষ্ণু ফাংশন math:`A \cdot \alpha ^ m + B` - এ **result_list**- এর ফলাফল গুলো মাপসই হওয়া উচিত। এখানে :math:`m` হলো ক্লিফোর্ড দৈর্ঘ্য।
es_un: Los resultados en **result_list** deben adaptarse a una función exponencialmente decreciente :math:`A \cdot \alpha ^ m + B`, donde :math:`m` es la longitud de Clifford.
fr_fr: Les résultats dans **result\_list** devraient correspondre à une fonction à décroissance exponentielle :math:`A \cdot \alpha ^ m + B`, où :math:`m` est la longueur de Clifford.
id_id: Hasil dalam **result_list** seharusnya cocok untuk fungsi peluruhan eksponensial :math:`A \cdot \alpha ^ m + B`, di mana :math:`m` adalah panjang Clifford.
it_it: Il risultato salvato in **result_list** dovrebbe essere descritto da una funzione che decade esponenzialmente :math:`A \cdot \alpha ^ m + B`, dove :math:`m` è la lunghezza di Clifford.
ko_kr: **result_list** 의 결과는 지수적 감쇠 함수 :math:`A \cdot \alpha ^ m + B` 에 맞아 떨어져야 하며, 여기서 :math:`m` 은 클리포드 (Clifford) 길이이다.
ru_ru: Результаты **result_list** должны соответствовать функции :math:`A \cdot \alpha ^ m + B`, где :math:`m` — длина последовательности из набора Клиффорда.
ta_in: **result_list** இல் உள்ள முடிவுகள் அதிவேகமாக அழுகும் செயல்பாட்டிற்கு பொருந்த வேண்டும் :math:`A\cdot\alpha^m+B`, இதில் :math:`m` என்பது கிளிஃபோர்ட் நீளம்.
tr_tr: **result_list** içerisindeki sonuçlar, Clifford uzunluğunun :math:`m` olduğu yerde üssel olarak dağılan :math:`A \cdot \alpha ^ m + B` fonksiyonuna yerleştirilmelidir.
zh_tw: **result_list** 中的結果應可被指數衰減函數 :math:`A \cdot \alpha ^ m + B`擬合，其中 :math:`m` 是Clifford的長度。

source: From :math:`\alpha` we can calculate the **Error per Clifford (EPC)**:
bn_bn: :math:`\alpha` থেকে আমরা **ক্লিফোর্ড পিছু ত্রুটি (Error Per Clifford / EPC)** গণনা করতে পারি।
es_un: A partir de :math:`\alpha` podemos calcular el **Error por Clifford (EPC)**:
fr_fr: De :math:`\alpha` nous pouvons calculer l'**Erreur par Clifford (EPC)**:
id_id: Dari :math:`\alpha` kita dapat menghitung **Eror per Clifford (EPC)**:
it_it: Da :math:`\alpha` è possibile calcolare l'**Error per Clifford (EPC)**:
ja_jp: :math:`\alpha`から、**クリフォードあたりの誤差（Error per Clifford、EPC）** が計算できます。:
ko_kr: :math:`\alpha` 를 사용해, **Error per Clifford (EPC)** 를 계산한다.
pt_br: A partir de :math:`\alpha` podemos calcular o **Erro por Clifford (EPC)**:
ru_ru: Из :math:`\alpha` мы можем вычислить **Error per Clifford (EPC)** (среднюю ошибку на оператор Клиффорда):
ta_in: :math:`\alpha` இல் இருந்து, நாம் **Error per Clifford (EPC)** ஐ கணக்கிடலாம்:
tr_tr: :math:`\alpha` dan **Error per Clifford (EPC)** 'ı (Clifford başına hata) hesaplayabiliriz:
zh_tw: 從:math:`\alpha` 我們可以計算**Error per Clifford (EPC)**：

source: (where :math:`n=nQ` is the number of qubits).
bn_bn: (এখানে :math:`n=nQ` কিউবিটের সংখ্যা)
es_un: (donde :math:`n=nQ` es el número de qubits).
fr_fr: (où :math:`n=nQ` est le nombre de qubits).
id_id: (di mana :math:`n=nQ` adalah banyaknya qubit).
it_it: (dove :math:`n=nQ` è il numero di qubit).
ko_kr: (여기서 :math:`n=nQ`는 큐비트의 수).
ru_ru: (где :math:`n=nQ` — количество кубитов).
ta_in: (அதில் :math:`n=nQ` என்பது qubitகளின் எண்ணிக்கை).
tr_tr: (burada :math:`n=nQ` kübitlerin sayısıdır).
zh_tw: （其中 :math:`n=nQ` 是量子位元的數目）。

source: Plot After 1 Seed
bn_bn: ১টি বীজ (সীড) এর পরে লেখচিত্রটি
es_un: Grafica Después de 1 Semilla
fr_fr: Tracer Après 1 Graine
id_id: Plot Setelah 1 Seed
it_it: Grafico Dopo 1 Seme
ja_jp: 1シードの​​プロット
ko_kr: 1 시드 후 그래프
pt_br: Gráfico Depois de 1 sequência
ru_ru: График после 1 зерна
ta_in: வரைதல் விதை 1-க்குப்பின்
tr_tr: 1 Başlangıç Değerinden Sonra Çizim
zh_tw: 在一個種子之後的圖表

source: Plot with the Rest of the Seeds
bn_bn: বাকি সীডগুলির সঙ্গে লেখচিত্র বানাও
es_un: Grafica con el Resto de las Semillas
fr_fr: Tracer avec le reste des graines
id_id: Plot dengan Seed Lainnya
it_it: Grafico con il Resto dei Semi
ja_jp: 残りのシードのプロット
ko_kr: 나머지 시드들을 사용한 그래프
pt_br: Gráfico com o resto das sequências
ru_ru: График с оставшимися зернами
ta_in: மீதமுள்ள விதைகளுடன் வரைதல்
tr_tr: Geri Kalan Başlangıç Değerleriyle Birlikte Çizim
zh_tw: 對應於剩餘種子的圖表

source: The plot is being updated after each seed.
bn_bn: লেখচিত্রটি প্রত্যেক সীড এর জন্যে হাল নাগাদ করা হচ্ছে।
es_un: La gráfica está siendo actualizada después de cada semilla.
fr_fr: Le tracé est mis à jour après chaque graine.
id_id: Plot akan diperbarui setelah setiap seed.
it_it: Il grafico è stato aggiornato dopo ogni seme.
ja_jp: プロットは各シードの後に​​更新されます。
ko_kr: 각 시드가 실행될 때마다 그래프가 업데이트 되고 있다.
pt_br: O gráfico está sendo atualizado após cada sequência.
ru_ru: График обновляется после каждого зерна.
ta_in: ஒவ்வொரு விதைக்கும் பிறகு வரைதல் புதுப்பிக்கப்படுகிறது.
tr_tr: Çizim, her başlangıç değerinden sonra güncellenir.
zh_tw: 在每一個種子之後，該圖都會被更新。

source: Add more shots to the data
bn_bn: তথ্যে আরো শটসমূহ যোগ করো
es_un: Añadir más iteraciones a los datos
fr_fr: Ajouter des images supplémentaires aux données
id_id: Tambahkan tembakan lebih banyak ke data
it_it: Aggiungere più shot ai dati
ja_jp: データにショットを追加する
ko_kr: 데이터에 샷 추가하기
pt_br: Adicionar mais execuções (shots) aos dados
ru_ru: Добавление дополнительных считываний к данным
ta_in: தரவுக்கு கூடுதல் காட்சிகளைச் சேர்க்கவும்
tr_tr: Veriye daha fazla deneme ekleyin
zh_tw: 增加量測次數並將結果添加至原有的數據

source: Predicted Gate Fidelity
bn_bn: যুক্তিবর্তনীর আনুমানিক বিশ্বস্ততা
es_un: Fidelidad prevista de la compuerta
fr_fr: Fidelity de la Porte Prédite
id_id: Gerbang Fidelitas Prediksi
it_it: Predire la Fidelity dei Gate
ja_jp: ゲート忠実度の予測
ko_kr: 예측된 게이트 정확도
pt_br: Fidelidade da Porta Prevista
ru_ru: Предсказанная точность вентиля
ta_in: கணிக்கப்பட்ட கேட் நம்பகத்தன்மை
tr_tr: Öngörülen Kapı Doğruluğu
zh_tw: 預測的閘保真度
