Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/5_quantum_volume.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr

source: List statistics for each depth. For each depth list if the depth was successful or not and with what confidence interval. For a depth to be successful the confidence interval must be > 97.5%.
bn_bn: প্রতিটি স্তরের (ডেপথ) এর জন্য পরিসংখ্যান তালিকাবদ্ধ করুন। প্রতিটি স্তর (ডেপথ) তালিকার জন্য ডেপথটি সফল কি না এবং যদি হয় তবে তা কতটা কনফিডেন্স পার্থক্যে। একটি ডেপথকে সফল হতে কনফিডেন্স পার্থক্য অবশ্যই > ৯৭.৫% হতে হবে।
es_un: Enlistar las estadísticas de cada nivel de profundidad. Para cada lista, si el nivel de profundidad fue exitoso o no y con que intervalo de confianza. Para que un nivel de profundidad sea exitoso el intervalo de confianza debe ser > 97.5%.
fr_fr: Liste des statistiques pour chaque profondeur. Pour chaque liste de profondeur si la profondeur a été réussie ou non et avec quel intervalle de confiance. Pour qu'une profondeur soit réussie, l'intervalle de confiance doit être de > 97,5%.
id_id: Catat statistik untuk setiap tingkat kedalaman. Untuk setiap kedalaman, catat apabila pada kedalaman tersebut berhasil; dan dengan tingkat kepercayaan apa. Untuk kedalaman yang dapat berhasil, tingkat kepercayaan harus > 97,5%.
it_it: Elenca le statistiche per ogni profondità. Per ciascuna profondità viene visualizzato se ha avuto successo o meno a con che intervallo di confidenza. Affinchè una profondità sia stata eseguita con successo l'intervallo di confidenza deve essere > 97.5%.
ja_jp: 各深さのリスト統計情報。各深さのリストは、その 深さで成功したかどうか、および信頼区間です。ある深さが成功とするためには、信頼区間が97.5%以上でなければなりません。
ko_kr: 각 깊이(depth) 에 대한 통계를 나열한다. 각 깊이는 깊이가 성공했는지 여부와 신뢰 구간(confidence interval) 이 어떠한지를 작성한다. 깊이가 성공하려면 신뢰 구간이 97.5%보다 커야 한다.
pt_br: Listar estatísticas para cada profundidade. Para cada lista de profundidade, se a profundidade foi bem-sucedida ou não, e com o que o intervalo de confiança. Para que uma profundidade seja bem sucedida, o intervalo de confiança deve ser> 97,5%.
ru_ru: Выводим статистику для каждой глубины. Для каждой глубины выводим, прошло ли вычисление глубины успешно или нет, и с каким доверительным интервалом. Для успешного измерения доверительный интервал должен быть > 97,5%.
ta_in: ஒவ்வொரு ஆழத்திற்கும் புள்ளிவிவரங்களை பட்டியலிடுங்கள். ஒவ்வொரு ஆழம் பட்டியலுக்கும் ஆழம் வெற்றிகரமாக இருந்ததா இல்லையா மற்றும் எந்த நம்பிக்கை இடைவெளியுடன் இருந்தால். ஒரு ஆழம் வெற்றிகரமாக இருக்க நம்பிக்கை இடைவெளி> 97.5% ஆக இருக்க வேண்டும்.
tr_tr: Her derinlik için istatistikleri listeleyin. Her derinlik için derinliğin başarılı olup olmadığı ve hangi güven aralığı ile olduğunu listeleyin. Bir derinliğin başarılı olması için, güven aralığı >%97,5 olmalıdır.

source: **Quantum Volume (QV)** is a method to verify device performance and a metric to quantify the computational power of a quantum device. The method is based on the paper "Validating quantum computers using randomized model circuits" (https://arxiv.org/abs/1811.12926).
ja_jp: **Quantum Volume (QV)** は量子デバイスの計算能力を数値化するための方法です。 この方法は論文、"Validating quantum computers using randomized model circuits"(https://arxiv.org/abs/1811.12926)に基づいています。
pt_br: **Quantum Volume (QV)** é um método para verificar o desempenho do dispositivo e uma métrica para quantificar o poder computacional de um dispositivo quântico. O método baseia-se no papel "Validando computadores quânticos usando circuitos de modelos randomizados" (https: //arxiv.org/abs/1811.12926).

source: We generate the quantum volume sequences. We start with a small example (so it doesn't take too long to run).
ja_jp: 量子ボリューム(Quantum Volume) シーケンスを生成します。実行時間を比較的短くするために、まずは小さな例から始めます。
pt_br: Geramos as seqüências de volume quântico. Começamos com um pequeno exemplo (por isso, não leva muito tempo para executar).
