Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/5_quantum_volume.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr

source: This page was generated from `tutorials/noise/5_quantum_volume.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/noise/5_quantum_volume.ipynb`__ -থেকে বানানো হয়েছে।
es_un: Esta página ha sido generada a partir de `tutorials/noise/5_quantum_volume.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/noise/5_quantum_volume.ipynb`__.
id_id: Halaman ini dibuat dari `tutorials/noise/2_relaxation_and_decoherence.ipynb`__.
it_it: Questa pagina è stata generata da `tutorials/noise/5_quantum_volume.ipynb`__.
ja_jp: このページは `tutorials/noise/5_quantum_volume.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/noise/5_quantum_volume.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada a partir do `tutoriais/ruido/5_volume_quantum.ipynb`__.
ru_ru: Эта страница создана на основе `tutorials/noise/5_quantum_volume.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/noise/5_quantum_volume.ipynb`__ இல் இருந்து உருவாக்கப்பட்டது.
tr_tr: Bu sayfa `tutorials/noise/5_quantum_volume.ipynb`__ sayfasından oluşturulmuştur.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/5_quantum_volume.ipynb>`_.
ta_in: ஊடாடும் வகையில் இயக்கவும் `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/5_quantum_volume.ipynb>`_.

source: Quantum Volume
bn_bn: কোয়ান্টাম আয়তন (কোয়ান্টাম ভলিউম)
es_un: Volumen Cuántico
fr_fr: Volume Quantique
id_id: Volume Kuantum
ja_jp: 量子ボリューム(Quantum Volume)
ko_kr: 양자 볼륨
pt_br: Volume Quântico
ru_ru: Квантовый объем
ta_in: குவாண்டம் தொகுதி
tr_tr: Kuantum Hacim

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
id_id: Pendahuluan
it_it: Introduzione
ja_jp: はじめに
ko_kr: 소개
pt_br: Introdução
ru_ru: Введение
ta_in: முன்னுரை
tr_tr: Giriş

source: **Quantum Volume (QV)** is a method to verify device performance and a metric to quantify the computational power of a quantum device. The method is based on the paper “Validating quantum computers using randomized model circuits” (https://arxiv.org/abs/1811.12926).
bn_bn: কোয়ান্টাম আয়তন (কোয়ান্টাম ভলিউম) হল যন্ত্রের দক্ষতা যাচাই করার একটি পদ্ধতি এবং একটি কোয়ান্টাম যন্ত্রের গণনাক্ষমতা পরিমাপ করার একটি পদ্ধতি (মেট্রিক)। এই পদ্ধতিটি “Validating quantum computers using randomized model circuits” (https://arxiv.org/abs/1811.12926) পেপারটির ওপর নির্ভর করে নির্মিত।
es_un: El **Volumen Cuántico (QV)** es un método para verificar el rendimiento de un dispositivo y una métrica para cuantificar el poder computacional de un dispositivo cuántico. Este método está basado en el artículo “Validating quantum computers using randomized model circuits” (https://arxiv.org/abs/1811.12926).
fr_fr: **Quantum Volume (QV)** est une méthode de vérification des performances d'un appareil et une métrique pour quantifier la puissance d'un calculateur quantique. La méthode est basée sur l'article "Validating quantum computers using randomized model circuits" (https://arxiv.org/abs/1811.12926).
id_id: **Kuantum Volume (Quantum Volume (QV))** adalah sebuah metode untuk memverifikasi kinerja perangkat dan sebuah metrik untuk mengkuantifikasi daya komputasi dari sebuah perangkat kuantum. Metode ini didasarkan pada *paper* "Validating quantum computers using randomized model circuits" (https: //arxiv.org/abs/1811.12926).
it_it: **Quantum Volume (QV)** è un metodo per verificare le prestazioni di un dispositivo ed una metrica che permette di quantificare la potenza computazionale di un dispositivo quantistico. Questo metodo è basato sull'articolo "Validating quantum computers using randomized model circuits" (https://arxiv.org/abs/1811.12926).
ko_kr: **Quantum Volume (QV)** 는 디바이스 성능을 검증하는 방법이며, 퀀텀 디바이스의 계산 능력을 정량화하기 위한 메트릭이다. 이 방법은“Validating quantum computers using randomized model circuits” (https://arxiv.org/abs/1811.12926) 에 기초한다.
ru_ru: **Квантовый Объем (QV)** — это метод проверки производительности устройства и метрика для количественной оценки вычислительной мощности квантового устройства. Он основан на статье “Validating quantum computers using randomized model circuits” (https://arxiv.org/abs/1811.12926).
ta_in: **Quantum Volume (QV)** என்பது சாதனத்தின் செயல்திறனை சரிபார்க்க ஒரு முறை மற்றும் ஒரு குவாண்டம் சாதனத்தின் கணக்கீட்டு சக்தியை அளவிட ஒரு அளவீடு ஆகும். "சீரற்ற மாதிரி சுற்றுகளைப் பயன்படுத்தி குவாண்டம் கணினிகளை சரிபார்க்கிறது" (https://arxiv.org/abs/1811.12926) என்ற காகிதத்தை அடிப்படையாகக் கொண்டது.
tr_tr: **Kuantum hacmi (QV)**, cihaz performansını doğrulamak için bir yöntem ve bir kuantum cihazının hesaplama gücünü ölçmek için bir ölçümdür. Bu yöntemin temeli “Validating quantum computers using randomized model circuits” (https://arxiv.org/abs/1811.12926) makalesine dayanmaktadır.

source: This notebook gives an example for how to use the ``ignis.verification.quantum_volume`` module. This particular example shows how to run up to depth 6 quantum volume circuits and will run them using the noisy Aer simulator.
bn_bn: এই নোটবুক কেমন করে ``ignis.verification.quantum_volume`` মডিউলটি ব্যবহার করা যায় সেই উদাহরণ দেয়। এই উদাহরণটি দেখায় কীভাবে ডেপ্থ ৬ কোয়ান্টাম আয়তন (কোয়ান্টাম ভলিউম) বর্তনী (সার্কিট) -কে চালানো যায় এবং তাদের নয়েজি এয়ার সিমুলেটর ব্যবহার করে চালানো যায়।
es_un: Este cuaderno da un ejemplo de como usar el módulo ``ignis.verification.quantum_volume``. Este ejemplo en particular muestra como correr circuitos de volumen cuántico de un nivel de profundidad de hasta 6 y los ejecutaremos usando el simulador con ruido de Aer.
fr_fr: Ce bloc-notes donne un exemple d'utilisation du module ``ignis.verification.quantum_volume``. Cet exemple particulier montre comment exécuter des circuits de volume quantique jusqu'à la profondeur 6 et les exécuter à l'aide du simulateur Aer bruyant.
id_id: Notebook ini memberikan contoh untuk bagaimana menggunakan modul ``ignis.verification.quantum_volume``. Contoh ini menunjukkan bagaimana menjalankan hingga kedalaman 6 sirkuit volume kuantum dan akan menjalankan mereka dengan menggunakan simulator Aer dengan *noise*.
it_it: Questo notebook fornisce un esempio sull'utilizzo del modulo ``ignis.verification.quantum_volume``. In particolare mostra come eseguire diversi circuiti di quantum volume fino a profondità 6 utilizzando il simulatore con rumore di Aer.
ja_jp: このノートブックは、 ``ignis.verification.quantum_volume`` モジュールの使用方法を示します。 この特定の例では、深さ6量子ボリューム回路まで実行し、ノイズがあるAerシミュレータを使用して実行する方法を示します。
ko_kr: 이 노트북은 ``ignis.verification.quantum_volume`` 모듈의 사용 방법에 대한 예를 제공한다. 이 예에서는 최대 깊이 6의 양자 볼륨 회로를 구동하는 방법을 보여 주며, 소음이 심한 Aer 시뮬레이터를 사용하여 회로를 구동한다.
pt_br: Este notebook dá um exemplo para como usar o módulo ``ignis.verification.quantum_volume``. Este exemplo específico mostra como executar circuitos de volume quântico até a profundidade 6, e os executará usando o simulador Aer com ruídos.
ru_ru: В этом блокноте приводится пример использования модуля ``ignis.verification.quantum_volume``. Этот конкретный пример показывает, как запускать цепи, квантовый объем которых может доходить до 6, с помощью симулятора Aer с шумом.
ta_in: `` Ignis.verification.quantum_volume`` தொகுதியை எவ்வாறு பயன்படுத்துவது என்பதற்கு இந்த நோட்புக் ஒரு எடுத்துக்காட்டு அளிக்கிறது. இந்த குறிப்பிட்ட எடுத்துக்காட்டு ஆழம் 6 குவாண்டம் தொகுதி சுற்றுகள் வரை எவ்வாறு இயங்குவது என்பதைக் காட்டுகிறது மற்றும் சத்தமிடும் ஏர் ஒப்புருவாக்கியைப் பயன்படுத்தி அவற்றை இயக்கும்.
tr_tr: Bu not defteri ``ignis.verification.quantum_volume`` modülünün nasıl kullanılacağına dair bir örnek verir. Bu özel örnek, 6 kuantum hacim devrelerinin derinliğine kadar nasıl çalıştırılacağını ve gürültülü Aer simülatörünü kullanarak nasıl çalıştırılacağını gösterir.

source: Select the Parameters of the QV Run
bn_bn: QV Run এর জন্য পরামিতিগুলি নির্বাচন করুন।
es_un: Escoge los parámetros de la corrida de QV
fr_fr: Sélectionner les Paramètres de l'Exécution QV
id_id: Pilih parameter dari QV Run
it_it: Selezionare i Parametri dell'esecuzione del QV
ja_jp: QV 実行のパラメーターを選択します
ko_kr: QV 실행의 매개변수 선택하기
pt_br: Selecione os Parâmetros da Execução QV
ru_ru: Выбираем параметры запуска QV
ta_in: QV இயக்கத்தின் அளவுருக்களை தேர்ந்தெடு
tr_tr: KH Run Parametrelerini Seçin

source: In this example we have 6 qubits Q0,Q1,Q3,Q5,Q7,Q10. We are going to look at subsets up to the full set.
bn_bn: এই উদাহরণে আমাদের আছে ৬ টি কিউবিট যথা Q0,Q1,Q3,Q5,Q7,Q10। আমরা সম্পূর্ণ সেট পর্যন্ত সমস্ত সাবসেটগুলি লক্ষ্য করতে চলেছি।
es_un: En este ejemplo tenemos 6 qubits Q0,Q1,Q3,Q5,Q7,Q10. Vamos a revisar desde subconjuntos hasta el conjunto completo.
fr_fr: Dans cet exemple, nous avons 6 qubits Q0,Q1,Q3,Q5,Q7,Q10. Nous allons regarder les sous-ensembles jusqu'à l'ensemble complet.
id_id: Dalam contoh ini kita memiliki 6 qubit Q0, Q1, Q3, Q5, Q7, Q10. Kita akan melihat subset sampai ke set penuh.
it_it: In questo esempio si utilizzano 6 qubit Q0,Q1,Q3,Q5,Q7,Q10. Esamineremo sottoinsiemi di qubit fino ad utilizzare il set completo.
ja_jp: この例では6量子ビットQ0,Q1,Q3,Q5,Q7,Q10があります。サブセットからフルセットまでみてみます。
ko_kr: 예에서는 6개의 큐비트 Q0, Q1, Q3, Q5, Q7, Q10이 있다. 우리는 전체 세트까지 하위 세트들을 살펴볼 것이다.
pt_br: Neste exemplo temos 6 qubits Q0, Q1, Q3, Q5, Q7, Q10. Vamos olhar para subconjuntos até o conjunto completo.
ru_ru: В этом примере у нас есть 6 кубитов Q0, Q1, Q3, Q5, Q7, Q10. Мы будем рассматривать все подмножества вплоть до полного набора.
ta_in: இந்த எடுத்துக்காட்டில் எங்களிடம் 6 qubit Q0, Q1, Q3, Q5, Q7, Q10 உள்ளது. முழு தொகுப்பு வரை துணைக்குழுக்களைப் பார்க்கப் போகிறோம்.
tr_tr: Bu örnekte 6 kübitimiz var Q0, Q1, Q3, Q5, Q7, Q10. Tam sete kadar alt kümelere bakacağız.

source: Generate QV sequences
bn_bn: QV অনুক্রম উৎপাদন করুন।
es_un: Generar secuencias de QV
fr_fr: Générer des séquences QV
id_id: Hasilkan sekuens QV
it_it: Generare le sequenze di QV
ja_jp: QV シーケンスの生成
ko_kr: QV 시퀀스 생성
pt_br: Gerar seqüências QV
ru_ru: Генерация QV последовательностей
ta_in: QV வரிசையை உருவாக்கு
tr_tr: KH dizileri oluşturma

source: We generate the quantum volume sequences. We start with a small example (so it doesn’t take too long to run).
bn_bn: আমরা কোয়ান্টাম আয়তন (কোয়ান্টাম ভলিউম) অনুক্রম উৎপাদন করবো। আমরা একটি ছোট উদাহরণ থেকে শুরু করবো(যাতে এটি চালাতে বেশি সময় না লাগে)।
es_un: Generamos las secuencias de volumen cuántico. Empezamos con un ejemplo pequeño (para que no tarde tanto en ejecutarse).
fr_fr: Nous générons les séquences de volume quantique. Nous commençons par un petit exemple (qui ne prend pas trop de temps pour s'exécuter).
id_id: Kita buat sekuens volume kuantum. Kita mulai dengan contoh kecil (sehingga tidak terlalu lama untuk dijalankan).
it_it: Generiamo le sequenze di quantum volume. Partiamo con un piccolo esempio (così da non impiegare molto tempo nell'esecuzione).
ko_kr: 우리는 양자 볼륨을 생성한다. 작은 예제부터 시작한다. (따라서 실행하는 데 시간이 너무 오래 걸리지 않는다).
ru_ru: Мы создаем последовательности квантовых объемов. Начнем с небольшого примера (запуск которого не займет слишком много времени).
ta_in: நாங்கள் குவாண்டம் தொகுதி வரிசைகளை உருவாக்குகிறோம். நாங்கள் ஒரு சிறிய எடுத்துக்காட்டுடன் தொடங்குகிறோம் (எனவே இயங்க அதிக நேரம் எடுக்காது).
tr_tr: Kuantum hacim dizilerini oluşturuyoruz. Küçük bir örnekle başlıyoruz (bu yüzden çalıştırması çok uzun sürmüyor).

source: As an example, we print the circuit corresponding to the first QV sequence. Note that the ideal circuits are run on the first n qubits (where n is the number of qubits in the subset).
bn_bn: একটি উদাহরণ স্বরূপ, আমরা প্রথম QV অনুক্রম অনুযায়ী বর্তনী (সার্কিট) প্রিন্ট করলাম। লক্ষ্য করুন যে আদর্শ বর্তনীগুলো প্রথম n কিউবিট এর ওপর চলে(রান করে)(যেখানে n হল ওই সাবসেট এ কিউবিটের সংখ্যা)।
es_un: Como ejemplo, imprimimos el circuito que corresponde a la primera secuencia de QV. Tenga en cuenta que los circuitos ideales son ejecutados en los primeros n qubits (donde n es el numero de qubits en el subconjunto).
fr_fr: Par exemple, nous imprimons le circuit correspondant à la première séquence QV. Notez que les circuits idéaux sont exécutés sur les n premiers qubits (où n est le nombre de qubits dans le sous-ensemble).
id_id: Sebagai contoh, kita mencetak sirkuit yang sesuai dengan sekuens QV pertama. Perhatikan bahwa sirkuit yang ideal dijalankan pada n qubits pertama (di mana n adalah jumlah qubits pada subset).
it_it: Come esempio, abbiamo stampato il circuito corrispondente alla prima sequenza di QV. Da notare che i circuiti ideali vengono eseguiti sui primi n qubit (dove n è il numero di qubit presente nel sottoinsieme preso in considerazione).
ja_jp: 例として、最初のQVシーケンスに対応する回路を出力します。 理想的な回路は最初の n 個の量子ビット実行されることに注意してください(n はサブセットの量子ビット数です)。
ko_kr: 를 들어 첫 번째 QV 시퀀스에 해당하는 회로를 인쇄한다. 이상적인 회로는 첫 번째 n 큐비트(여기서 n은 하위 세트의 큐비트 수) 에서 실행된 다는 점을 유의하자.
pt_br: Como exemplo, imprimimos o circuito correspondente à primeira sequência QV. Observe que os circuitos ideais são executados nos primeiros n qubits (onde n é o número de qubits no subconjunto).
ru_ru: В качестве примера мы отобразим цепь, соответствующую первой последовательности QV. Обратите внимание на то, что идеальные цепи выполняются на первых n кубитах (где n — число кубитов в данной выборке).
ta_in: உதாரணமாக, முதல் QV வரிசைக்கு ஒத்த சுற்றுகளை அச்சிடுகிறோம். இலட்சிய சுற்றுகள் முதல் n குவிட்களில் இயக்கப்படுகின்றன என்பதை நினைவில் கொள்க (இங்கு n என்பது துணைக்குழுவில் உள்ள குவிட்களின் எண்ணிக்கை).
tr_tr: Örnek olarak, ilk KH dizisine karşılık gelen devreyi yazdırıyoruz. İdeal devrelerin ilk n kübit üzerinde çalıştığını unutmayın (burada n, alt kümedeki kübit sayısıdır).

source: Simulate the ideal circuits
bn_bn: আদর্শ বর্তনীগুলোর(সার্কিট) মহড়া(সিমুলেট) করো।
es_un: Simular los circuitos ideales
fr_fr: Simuler les circuits idéaux
id_id: Simulasikan sirkuit yang ideal
it_it: Simulare i circuiti ideali
ja_jp: 理想回路をシミュレートする
ko_kr: 이상적인 회로 시뮬레이션
pt_br: Simular os circuitos ideais
ru_ru: Симуляция идеальных цепей
ta_in: சிறந்த சுற்றுகளை உருவகப்படுத்துங்கள்
tr_tr: İdeal devrelerin simülasyonu

source: The quantum volume method requires that we know the ideal output for each circuit, so use the statevector simulator in Aer to get the ideal result.
bn_bn: কোয়ান্টাম আয়তন (কোয়ান্টাম ভলিউম) পদ্ধতির জন্য আমাদের প্রতিটি বর্তনীর আদর্শ আউটপুট জ্ঞাত হওয়া প্রয়োজন, তাই আদর্শ ফল পেতে এয়ার এ অবস্থা ভেক্টর বা দিকরাশি সিমুলেটর বা মহড়া ব্যবহার করুন।
es_un: El método de volumen cuántico requiere que sepamos la salida ideal para cada circuito, entonces usamos el simulador de vectores de estado de Aer para encontrar el resultado ideal.
fr_fr: La méthode du volume quantique nécessite que nous connaissions la sortie idéale pour chaque circuit, donc utilisez le simulateur d'état d'Aer pour obtenir le résultat idéal.
id_id: Metode volume kuantum mengharuskan kita mengetahui output yang ideal untuk setiap sirkuit, sehingga gunakan simulator *statevector* di Aer untuk mendapatkan hasil yang ideal.
it_it: Il metodo del quantum volume necessita la conoscenza del risultato ideale di ogni circuito, quindi per ottenerlo utilizziamo lo statevector simulator in Aer.
ja_jp: 量子ボリュームメッソッドでは、各回路の理想的な出力を知る必要があります。 Aerのステートベクトルシミュレータを使って理想的な結果を得ることができます
ko_kr: 퀀텀 볼륨 방법은 각각의 회로에 대한 이상적인 출력을 알아야 하기 때문에, Aer 에서 상태기 시뮬레이터를 사용하여 이상적인 결과를 얻을 수 있다.
pt_br: O método de volume quântico requer que saibamos a saída ideal para cada circuito, portanto use o simulador de statevector em Aer para obter o resultado ideal.
ru_ru: Метод квантового объема требует, чтобы мы знали идеальное значение на выходе каждой цепи, поэтому используем симулятор statevector из Aer, чтобы получить идеальный результат.
ta_in: குவாண்டம் தொகுதி முறைக்கு ஒவ்வொரு சுற்றுக்கும் சிறந்த வெளியீட்டை நாம் தெரிந்து கொள்ள வேண்டும், எனவே சிறந்த முடிவைப் பெற ஏரில் உள்ள ஸ்டேட்வெக்டர் சிமுலேட்டரைப் பயன்படுத்தவும்.
tr_tr: Kuantum hacim yöntemi, her devre için ideal çıkışı bilmemizi gerektirir, bu nedenle ideal sonucu elde etmek için Aer'deki durum vektör simülatörünü kullanın.

source: Next, load the ideal results into a quantum volume fitter:
bn_bn: এরপর, একটি কোয়ান্টাম আয়তন (কোয়ান্টাম ভলিউম) ফিটারে আদর্শ ফলগুলি লোড করুন।
es_un: En seguida, cargamos los resultados ideales al ajustador de volumen cuántico:
fr_fr: Ensuite, chargez les résultats idéaux dans un ajusteur de volume quantique:
id_id: Selanjutnya, muat hasil yang ideal ke dalam sebuah volume kuantum *fitter*:
it_it: Successivamente, carichiamo nel quantum volume fitter i risultati ideali:
ja_jp: 次に、理想的な結果を量子ボリュームフィッターにロードします。
ko_kr: 그런 다음, 이상적인 결과를 양자 볼륨 적합자로 로드한다.
pt_br: Em seguida, carregue os resultados ideais em um equipamento de volume quântico:
ru_ru: Затем загружаем идеальные результаты для вычисления квантового объема:
ta_in: அடுத்து, சிறந்த முடிவுகளை குவாண்டம் தொகுதி ஃபிட்டரில் ஏற்றவும்:
tr_tr: Ardından, ideal sonuçları bir kuantum hacim sığdırıcısına yükleyin:

source: Define the noise model
bn_bn: নয়েজ মডেলটি সংজ্ঞায়িত করুন
es_un: Definir el modelo de ruido
fr_fr: Définir le modèle de bruit
id_id: Tentukan model noise
it_it: Definire il modello di rumore
ja_jp: ノイズモデルを定義
ko_kr: 노이즈 모델 정의하기
pt_br: Definir o modelo de ruído
ru_ru: Определяем модель шума
ta_in: இரைச்சல் மாதிரியை வரையறுக்கவும்
tr_tr: Gürültü modelini tanımlayın

source: We define a noise model for the simulator. To simulate decay, we add depolarizing error probabilities to the CNOT and U gates.
bn_bn: সিমুলেটর এর জন্যে আমরা একটি নয়েজ মডেল বানাই। এখানে আমরা CNOT এবং U যুক্তিবর্তনীগুলিতে (গেটগুলিতে) অসমবর্তিত ত্রুটির সম্ভাবনাও যুক্ত করি যাতে ক্ষয় অনুকরণ করা যেতে পারে।
es_un: Definimos el modelo de ruido para el simulador. Para simular el decaimiento, añadimos probabilidades de errores despolarizantes a las compuertas CNOT y U.
fr_fr: Nous définissons un modèle de bruit pour le simulateur. Pour simuler la dégradation, nous ajoutons des probabilités d'erreur dépolarisantes aux portes CNOT et U.
id_id: Kita mendefinisikan model noise untuk simulator. Untuk mensimulasikan penguraian, kita menambahkan kemungkinan eror depolarizing ke gerbang CNOT dan U.
it_it: Definiamo un modello di rumore per il simulatore. Per simulare il decadimento, aggiungiamo una probabilità non nulla che avvenga un errore di depolarizzazione nei gate CNOT e U.
ja_jp: シミュレータのノイズモデルを定義します。減衰をシミュレートするために、CNOTとUゲートに脱分極エラー確率を追加します。
ko_kr: 우리는 시뮬레이터에 대한 잡음 모델을 정의한다. 감쇠를 시뮬레이션하기 위해, CNOT과 U 게이트에 편광 에러(depolarizing error) 확률을 추가한다.
pt_br: Definimos um modelo de ruído para o simulador. Para simular o decaimento, adicionamos probabilidades de erro de despolarizamento aos portões de CNOT e U.
ru_ru: Мы определяем модель шума для симулятора. Чтобы смоделировать затухание, мы добавляем вероятность ошибки деполяризации к вентилям CNOT и U.
ta_in: ஒப்புருவாக்கிக்கான இரைச்சல் மாதிரியை நாங்கள் வரையறுக்கிறோம். சிதைவை உருவகப்படுத்த, CNOT மற்றும் U கேட்களில் depolarizing பிழை நிகழ்தகவுகளைச் சேர்க்கிறோம்.
tr_tr: Simülatör için bir gürültü modeli tanımlıyoruz. Bozunmayı simüle etmek için, CNOT ve U kapılarına depolarize edici hata olasılıkları ekliyoruz.

source: Execute on Aer simulator
bn_bn: এয়ার সিমুলেটরে সম্পাদন করুন।
es_un: Executando en el simulador de Aer
fr_fr: Exécuter sur le simulateur Aer
id_id: Jalankan pada simulator Aer
it_it: Eseguire sul simulatore di Aer
ja_jp: Aerシミュレータで実行
ko_kr: Aer 시뮬레이터 실행하기
pt_br: Executar no simulador Aer
ru_ru: Выполняем на симуляторе Aer
ta_in: ஏர் ஒப்புருவாக்கியை செயற்படுத்து
tr_tr: Aer simülatöründe yürütme

source: We can execute the QV sequences either using a Qiskit Aer Simulator (with some noise model) or using an IBMQ provider, and obtain a list of results, ``result_list``.
bn_bn: Qiskit এর এয়ারসিমুলেটর(কিছু দূষণ (নয়েজ) মডেলের সাহায্যে) বা আইবিএমকিউ প্রোভাইডারের সাহায্যে আমরা QV অনুক্রমগুলি চালাতে পারি এবং তা থেকে ফলাফল তালিকা ``result_list`` পেতে পারি।
es_un: Podemos ejecutar las secuencias de QV usando un Simulador de Qiskit Aer (con un modelo de ruido) o usando un proveedor de IBMQ, y obtenemos una lista de resultados ``result_list``.
fr_fr: Nous pouvons exécuter les séquences QV soit à l'aide d'un simulateur Qiskit Aer (avec un modèle de bruit) soit à l'aide d'un fournisseur de service IBMQ, et obtenir une liste de résultats, ``result_list``.
id_id: Kita dapat mengeksekusi sekuens QV baik dengan menggunakan Qiskit Aer Simulator (dengan beberapa model noise) atau menggunakan *provider* IBMQ, dan memperoleh list hasil, ``result_list``.
it_it: Possiamo eseguire le sequenze di QV sia utilizzando un Simulatore di Qiskit Aer (associato ad un modello di rumore), sia un provider IBMQ, ottenendo una lista di risultati, ``result_list``.
ja_jp: QV シーケンスは、Qiskit Aer Simulator (一部のノイズモデル) を使用するか、IBMQ プロバイダーを使用して実行できます。 そして、``result_list`` の結果のリストを取得します。
ko_kr: Qiskit Aer Simulator를 사용하거나 (일부 노이즈 모델을 사용하여) IBMQ 제공자를 사용하여 QV 시퀀스를 실행하고 결과 목록인 ``result_list`` 를 얻을 수 있다.
pt_br: Podemos executar as sequências de QV usando um Qiskit Aer Simulator (com algum modelo de ruído) ou usando um provedor IBMQ, e obter uma lista de resultados, ``result_list``.
ru_ru: QV последовательности можно запускать либо с помощью Qiskit Aer Simulator (с какой-то моделью шума), либо с помощью провайдера IBMQ, и получать список результатов ``result_list``.
ta_in: ஒரு Qiskit ஏர் ஒப்புருவாக்கியைப் பயன்படுத்தி (சில இரைச்சல் மாதிரியுடன்) அல்லது ஒரு IBMQ வழங்குநரைப் பயன்படுத்தி QV காட்சிகளை இயக்கலாம், மேலும் `` result_list`` முடிவுகளின் பட்டியலைப் பெறலாம்.
tr_tr: KH dizilerini bir Qiskit Aer Simülatörü (bazı gürültü modelleriyle) veya bir IBMQ sağlayıcısı kullanarak yürütebilir ve sonuçların bir listesini elde edebiliriz, ``result_list``.

source: Load the experimental data into the fitter. The data will keep accumulating if this is re-run (unless the fitter is re-instantiated).
bn_bn: পরীক্ষাধীন তথ্য ফিটারটিতে লোড করুন। যদি এটি পুনর্সম্পাদিত হয় তবে তথ্যটি জমা হতে থাকবে(যদিনা ফিটারটি পুনঃ মূহুর্তায়িত করা হয়)।
es_un: Cargamos los datos experimentales al ajustador. La información se seguirá acumulando si se vuelve a ejecutar (a menos de que se cree una nueva instancia del ajustador).
fr_fr: Charger les données expérimentales dans l'ajusterur. Les données continueront à s'accumuler s'il s'agit d'une relance (sauf si l'ajusteur est réinstancié).
id_id: Muat data percobaan ke dalam *fitter*. Data akan tetap terakumulasi jika ini dijalankan kembali (kecuali jika *fitter* tersebut diinisialisasi kembali).
it_it: Carichiamo i dati sperimentali nel fitter. I dati verranno aggiunti e non sovrascritti se effettuiamo una nuova esecuzione (fino a quanto il fitter non viene nuovamente istanziato).
ja_jp: 実験データをフィッターにロードします。データは再実行すると蓄積され続けます（フィッターが再インスタンス化されない限り）。
ko_kr: 실험 데이터를 적합자(fitter) 에 로드한다. (적합자를 다시 인스턴스화하지 않는 한) 재실행해도 데이터는 계속 누적된다.
pt_br: Carregue os dados experimentais no equipamento. Os dados continuarão acumulando se o código for reexecutado (a menos que o equipamento seja reinstanciado).
ru_ru: Загружаем экспериментальные данные для аппроскимации. Данные будут накапливаться при повторном запуске (если не будет создан новый экземпляр fitter).
ta_in: சோதனை தரவை ஃபிட்டரில் ஏற்றவும். இது மீண்டும் இயங்கினால் தரவு குவிந்து கொண்டே இருக்கும் (ஃபிட்டர் மீண்டும் நிறுவப்படாவிட்டால்).
tr_tr: Deneysel verileri sığdırıcıya yükleyin. Bu yeniden çalıştırılırsa veriler birikmeye devam edecektir (birleştirici yeniden örneklenmedikçe).
