Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/6_repetition_code.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: **Example 3:** ``0 1 0000 0001 0000`` would represent a :math:`d=5`, :math:`T=2` repetition code with encoded ``1``. A code qubit on the end of the line is flipped before the second round of syndrome measurements. This is detected by only a single syndrome measurement, because it is on the end of the line. For the same reason, it also disturbs one of the logical readouts.
bn_bn: **উদাহরণ 3.** ``0 1 0000 0001 0000`` চিত্রিত করে একটি :math:`d=5`, :math:`T=2` রিপিটেশন বা পুনরাবৃত্তি কোড যেটি সংকেতাক্ষরিত বা এনকোডেড হয়েছে ``1`` দ্বারা।একটি কোড কিউবিট রেখা বা লাইনের শেষে উল্টানো বা ফ্লিপ করা হয়েছে দ্বিতীয় সিনড্রোম পরিমাপের আগে।এটি সনাক্ত করা হয় শুধু মাত্র একটি একক সিনড্রোম পরিমাপ দিয়ে কারণ এটি রেখা বা লাইনের শেষে থাকে।এই একই কারনে এটি লজিক্যাল বা যৌক্তিক রিডাউট গুলির মধ্যে একটির শান্তিভঙ্গ করে।
es_un: **Ejemplo 3:** ``0 1 0000 0001 0000`` representaría al código de repetición :math:`d=5`, :math:`T=2` con ``1`` codificado. Un qubit de código al final de la fila es volteado antes de la segunda ronda de mediciones de síndrome. Este es detectado por una sola medición de síndrome, porque esta al final de la fila. Por la misma razón, perturba una de las salidas lógicas.
fr_fr: **Exemple 3:** ``0 1 0000 0001 0000`` représenterait un code de répétition :math:`d=5`, :math:`T=2` avec un code de répétition encodé ``1``. Un qubit de code à la fin de la ligne est retourné avant le deuxième cycle de mesures du syndrome. Ceci est détecté par une seule mesure de syndrome, car il est à la fin de la ligne. Pour la même raison, il perturbe aussi une des lectures logiques.
id_id: **Contoh 3:** ``0 1 0000 0001 0000`` akan mewakili :math:`d=5`, :math:`T=2` kdoe repetisi dengan ``1`` yang dienkode. Sebuah qubit kode di barisan akhir dibalikkan sebelum pengukuran sindrom pada putaran kedua. Ini dideteksi hanya oleh satu pengukuran sindrom, karena ini berada pada barisan terakhir. Untuk alasan yang sama, ini juga mengganggu salah satu dari readout logis.
ja_jp: **例 3:** ``0 001 0000`` は :math:`d=5`、 :math:`T=2`繰り返しコードで ``1`` を表します。 行末のコード量子ビットは、シンドローム測定の第二ラウンドの前に反転されます。 これは、ラインの終わりにあるので、単一のシンドローム測定で検出されます。 同じ理由で、それはまた論理的な読み出しのいずれかを妨げます。
ko_kr: **예 3:** ``0 1 0000 0001 0000`` 은 ``1`` 으로 인코딩된 :math:`T=2` 반복 코드인 :math:`d=5` 를 나타낼 것이다. 두 번째 라운드 신드롬 측정 전에 라인 끝에 있는 코드 큐비트가 플립된다. 이것은 라인의 끝에 있기 때문에 단일 신드롬 측정으로만 감지된다. 같은 이유로, 그것은 또한 논리적 판독 중 하나를 방해한다.
pt_br: **Exemplo 3:** ``0 1 0000 0001 0000`` representaria um código de repetição com :math:`d=5` e :math:`T=2`, com um ``1`` codificado. Um qubit de código no final da linha é invertido, antes da segunda rodada de medições da síndrome. Isto é detectado por, apenas, uma única medição da síndrome, pois ele está no fim da linha. Pela mesma razão, isto, também, perturba uma das leituras lógicas.
ru_ru: **Пример 3:** ``0 1 0000 0001 0000`` будет представлять собой код повторения :math:`d=5`, :math:`T=2` с закодированной ``1``. Кодовый кубит в конце линии переворачивается перед вторым раундом измерений синдрома. Это обнаруживается только одним измерением синдрома, поскольку он находится в конце строки. По этой же причине он также нарушает одно из логических считываний.
ta_in: **Example 3:** ``0 1 0000 0001 0000`` என்பது ஒரு :math:`d=5`, :math:`T=2` குறியாக்கப்பட்ட ``1`` உடன் மீண்டும் குறியீடு. நோய்க்குறி அளவீடுகளின் இரண்டாவது சுற்றுக்கு முன் கோட்டின் முடிவில் ஒரு குறியீடு குவிட் புரட்டப்படுகிறது. இது ஒரு நோய்க்குறி அளவீடு மூலம் மட்டுமே கண்டறியப்படுகிறது, ஏனெனில் இது கோட்டின் முடிவில் உள்ளது. அதே காரணத்திற்காக, இது தர்க்கரீதியான வாசிப்புகளில் ஒன்றையும் தொந்தரவு செய்கிறது.
tr_tr: **Örnek 3:** ``0 1 0000 0001 0000``, bir :math:`d=5` 'i, :math:`T=2` ``1`` kodlu tekrar kodunu temsil eder. Satırın sonundaki bir kod kübiti, ikinci tur sendrom ölçümlerinden önce çevrilir. Bu, satırın sonunda olduğu için yalnızca tek bir sendrom ölçümüyle tespit edilir. Aynı nedenle, mantıksal okumalardan birini de bozar.
zh_tw: **範例 3：** ``0 1 0000 0001 0000`` 代表一個 :math:`d=5`， :math:`T=2` 的重複程式碼，編碼為 ``1``。 在第二回合症候群測量之前，在線末端的程式碼量子位元會先被翻轉。因為它在線的末端，所以它是被單一個綜合症測量所偵測。 出於同樣的原因，它也擾亂了其中一個邏輯讀出。

source: Note that in all these examples, a single error causes exactly two characters in the string to change from the value it would have with no errors. This is, in fact, the reason why the logical output consists of both endpoints. It is a property that will be used by the decoder.
bn_bn: মনে রাখা দরকার এই সব উদাহরণ গুলির মধ্যে, একটি একক বা সিঙ্গেল ত্রুটি স্ট্রিংএর মধ্যে ঠিক দুটি চরিত্র তৈরি করে সেই মানের থেকে ত্রুটি বিহীন অবস্থার মানের থেকে পরিবর্তন করার জন্যে।ইহাই সেই কারণ যার জন্য লজিক্যাল বা যৌক্তিক আউটপুটের উভয় শেষপ্রান্ত থাকে। এটি একটি বৈশিষ্ট্য যেটি ডিকোডার ব্যাবহার করবে।
es_un: Ten en cuenta que en todos estos ejemplos, un solo error causa que exactamente dos caracteres de la cadena sean diferentes a que si no hubiera errores. Esta es, de hecho, la razón por la cual las salidas lógicas consisten de ambos extremos de la cadena. Es una propiedad que va a ser usada por el decodificador.
fr_fr: Notez que dans tous ces exemples, une seule erreur entraîne exactement deux caractères dans la chaîne de caractères à changer de la valeur qu'elle aurait sans erreur. C'est en fait la raison pour laquelle la sortie logique se compose des deux extrémités. C'est une propriété qui sera utilisée par le décodeur.
id_id: Perhatikan bahwa dalam semua contoh ini, eror tunggal menyebabkan tepat dua karakter di string untuk berubah bentuk dari nilai yang seharusnya dipunyai tanpa adanya eror. Ini, kenyataannya, adalah alasan mengapa output logis terdiri dari kedua titik akhir. Ini adalah properti yang akan digunakan oleh dekoder.
ja_jp: これらすべての例では、 1つのエラーが発生すると、文字列中の2文字だけが、エラーのない値から変更されます。 これは、実際には、論理出力が両方のエンドポイントで構成されている理由です。デコーダーが使用するプロパティです。
ko_kr: 이러한 모든 예제에서는 단일 오류로 인해 문자열에 있는 정확히 두 개의 문자가 오류가 없는 값에서 변경된다. 실제로 논리 출력이 두 엔드포인트 모두로 구성되는 이유이다. 이것은 디코더에 의해 사용될 속성이다.
pt_br: Note que em todos estes exemplos, um único erro faz com que exatamente dois caracteres na string mudem do valor, que teriam sem erros. Isto é, na verdade, a razão pela qual a saída lógica consiste em ambos os pontos finais. É uma propriedade que será utilizada pelo decodificador.
ru_ru: Обратите внимание, что во всех этих примерах одна ошибка приводит к изменению значения ровно двух символов в строке по сравнению со значением, которое она имела бы при отсутствии ошибок. Это, собственно, и есть причина, по которой логический вывод состоит из обеих конечных точек. Это свойство, которое будет использоваться декодером.
ta_in: இந்த எல்லா எடுத்துக்காட்டுகளிலும், ஒரு பிழையானது சரம் சரியாக இரண்டு எழுத்துக்களை பிழைகள் இல்லாமல் இருக்கும் மதிப்பிலிருந்து மாற்றுவதற்கு காரணமாகிறது என்பதை நினைவில் கொள்க. உண்மையில், இது தருக்க வெளியீடு இரு முனைப்புள்ளிகளையும் கொண்டிருப்பதற்கான காரணம். இது டிகோடரால் பயன்படுத்தப்படும் ஒரு சொத்து.
tr_tr: Tüm bu örneklerde, tek bir hatanın, dizedeki tam olarak iki karakterin, hiçbir hata olmadan sahip olacağı değerin değişmesine neden olduğuna dikkat edin. Aslında mantıksal çıktının her iki uç noktadan oluşmasının nedeni budur. Bu kod çözücü tarafından kullanılacak bir özelliktir.
zh_tw: 請注意，在所有這些範例中，單一誤差會導致字串中準確地有兩個字元的數值改變(變得跟原本沒有誤差的數值不同)。 這事實上是邏輯輸出由兩個端點所組成的原因。 這個性質將會被解碼器所使用。

source: To see the effects of noise, we need to specify a noise model. For example, let’s set up a simple noise model with gate and measurement errors.
bn_bn: দূষণ বা ত্রুটি বা নয়েজের প্রভাব দেখার জন্যে, আমাদের আমাদের দূষণ বা ত্রুটি নকশা নির্দিষ্ট করা দরকার। উদাহরণ স্বরূপ একটা সাধারণ দূষণ বা ত্রুটি নকশা প্রস্তুত করা যাক যুক্তিবর্তনী (গেইট) এবং পরিমাপ ত্রুটি গুলি দ্বারা।
es_un: Para ver los efectos del ruido, necesitamos especificar un modelo de ruido. Por ejemplo, configuremos un modelo simple de ruido con errores de compuertas y de medición.
fr_fr: Pour voir les effets du bruit, il faut spécifier un modèle de bruit. Par exemple, mettons en place un modèle de bruit simple avec des erreurs de porte et de mesure.
id_id: Untuk melihat efek dari noise, kita perlu menentukan model noise. Sebagai contoh, mari kita buat model noise sederhana dengan gerbang dan eror pengukuran.
ja_jp: ノイズの影響を見るためには、ノイズ・モデルを指定する必要があります。例えば、ゲート誤差と測定誤差のある簡単なノイズ・モデルを設定してみましょう。
ko_kr: 노이즈의 효과를 보려면 노이즈 모델을 지정해야 한다. 예를 들어, 게이트 및 측정 오류가 있는 단순 노이즈 모델을 설정하자.
ru_ru: Чтобы увидеть влияние шума, нам необходимо задать модель шума. Например, зададим простую модель шума с ошибками вентилей и ошибками измерения.
ta_in: சத்தத்தின் விளைவுகளைக் காண, நாங்கள் ஒரு சத்தம் மாதிரியைக் குறிப்பிட வேண்டும். எடுத்துக்காட்டாக, கேட் மற்றும் அளவீட்டு பிழைகள் கொண்ட எளிய இரைச்சல் மாதிரியை அமைப்போம்.
tr_tr: Gürültünün etkilerini görmek için bir gürültü modeli belirlememiz gerekiyor. Örneğin, geçit ve ölçüm hataları içeren basit bir gürültü modeli oluşturalım.
zh_tw: 為了看到噪音的影響，我們需要指定一個噪音模型。 例如，讓我們設立一個簡單的噪音模型，其具有閘和測量誤差。

source: This can then be run to generate noisy results. Let’s make a quick function to do this, and then run it.
bn_bn: এটি চালিয়ে দেখা যেতে পারে ত্রুটি পূর্ণ বা নয়েজি ফলাফল পোয়ার জন্য।একটি দ্রুত ফাংশন বা ক্রিয়া তৈরি করা যাক এটি করার জন্য এবং তারপর চালিয়ে বা রান করিয়ে দেখা যাক।
es_un: Esto entonces puede ser ejecutado para generar resultados con ruido. Escribamos rápidamente una función que haga esto, y ejecutémosla.
fr_fr: Cela peut alors être exécuté pour générer des résultats bruyants. Faisons une fonction rapide pour faire cela, puis exécutez-le.
id_id: Hal ini kemudian dapat dijalankan untuk menghasilkan hasil yang noisy. Mari kita membuat sebuah fungsi singkat untuk melakukan ini, dan kemudian menjalankannya.
ja_jp: これを実行することで、ノイズの多い結果を出すことができます。そのための簡単な関数を作成して、実行してみましょう。
ko_kr: 그런 다음 이를 실행하여 노이즈가 많은 결과를 생성할 수 있다. 이를 수행하는 간단한 기능을 만들고 실행하자.
ru_ru: Затем ее можно запустить, чтобы получить шумные результаты. Давайте сделаем для этого короткую функцию, а затем запустим ее.
ta_in: சத்தமான முடிவுகளை உருவாக்க இதை இயக்கலாம். இதைச் செய்ய விரைவான செயல்பாட்டைச் செய்வோம், பின்னர் அதை இயக்கவும்.
tr_tr: Bu daha sonra gürültülü sonuçlar oluşturmak için çalıştırılabilir. Bunu yapmak için hızlı bir işlev yapalım ve sonra çalıştıralım.
zh_tw: 執行此模型可產生具有雜訊的結果。 讓我們做一個快速簡易的函數功能來完成這個動作，然後執行它。

source: Here the non-noisy results are the most likely. The rest of the samples are distributed among other possibilities with non-trivial syndromes.
bn_bn: এখানে ফলাফল গুলি সম্ভবত ত্রুটি বিহীন বা নন - নয়েজি। বাকি নমুনা গুলি সংবিগ্ন অন্যান্য সম্ভাবনার অতুচ্চ্ছ সিনড্রোম গুলির সাথে।
es_un: Aquí los resultados sin ruido son los más probables. El resto de las muestras son distribuidas entre otras posibilidades con síndromes no triviales.
fr_fr: Ici, les résultats non bruyants sont les plus probables. Le reste des échantillons est réparti entre autres possibilités avec des syndromes non triviaux.
id_id: Di sini hasil yang tidak noisy adalah yang paling mungkin. Sisa dari sampel didistribusikan di antara kemungkinan lain dengan sindrom non-trivial.
ja_jp: ノイズ無しの結果は、最も可能性が高いです。サンプルの残りの部分は、非自明なシンドロームの他の可能性に分布しています。
ko_kr: 여기서 잡음이 없는 결과가 가장 유력하다. 나머지 샘플들은 비자명한 신드롬 확률 분포를 따른다.
pt_br: Aqui, os resultados sem ruído são os mais prováveis. O restante das amostras estão distribuídas entre outras possibilidades com síndromes não triviais.
ru_ru: Здесь нешумные результаты являются наиболее вероятными. Остальные результаты распределены между другими возможностями с нетривиальными синдромами.
ta_in: இங்கே சத்தமில்லாத முடிவுகள் பெரும்பாலும். மீதமுள்ள மாதிரிகள் அற்பமற்ற நோய்க்குறிகளுடன் பிற சாத்தியக்கூறுகளுக்கு இடையே விநியோகிக்கப்படுகின்றன.
tr_tr: Burada gürültülü olmayan sonuçlar en olasıdır. Örneklerin geri kalanı, önemsiz olmayan sendromlarla diğer olasılıklar arasında dağıtılır.
zh_tw: 在這裡不具有雜訊的結果是最有可能的。 其餘的樣本分布在其他可能的狀況，這些狀況具有比較複雜的症候群。

source: Decoding a repetition code
bn_bn: একটি রিপিটেশন বা পুনরাবৃত্তি কোড ডিকোড বা সংকেতাক্ষরের অর্থ উদ্ধার করা
es_un: Decodificando un código de repetición
fr_fr: Décodage d'un code de répétition
id_id: Mendekode kode repetisi
it_it: Decodificare un codice di ripetizione
ja_jp: 反復符号をデコードする
ko_kr: 반복 코드 분석하기
pt_br: Decodificando um código de repetição
ru_ru: Декодирование кода повторения
ta_in: மறுபடியும் குறியீட்டை டிகோடிங் செய்கிறது
tr_tr: Tekrarlama kodunun çözülmesi
zh_tw: 解一個重複碼

source: Noisy results can change the logical value at readout, and so affect our ability to read out the logical qubit. This can be mitigated by looking at the syndrome values. These can tell us whether or not the logical values are most likely to have changed, and so allow us to correct for the errors. The process of analyzing the syndrome to correct for the errors is called ‘decoding’. We do this by building a decoding object for our code.
bn_bn: নইজি বা ত্রুটি পূর্ণ ফলাফল পরিবর্তন করতে পারে লজিক্যাল বা যৌক্তিক মান রিডাউট বা পড়বার সময় এবং তাই প্রভাব ফেলে আমাদের লজিক্যাল বা যৌক্তিক কিউবিট পড়বার ক্ষমতার উপর।এটিকে প্রশমিত করা যাবে সিনড্রোম মান দেখে।এগুলি আমাদের বলতে পারে লজিক্যাল বা যৌক্তিক মান গুলি সম্ভবত প্রবর্তিত হয়েছে কি না এবং তাই আমাদের অনুমতি দেয় ত্রুটি সংশোধন করার জন্য।ত্রুটি সংশোধন করার জন্যে সিনড্রোম বিশ্লেষণ করার পদ্ধতি কে বলা হয় ‘ডিকোডিং’। আমরা এটা করি আমাদের কোডের ডিকোডিং অবজেক্ট গঠন বা নির্মাণ করার জন্য।
es_un: Los resultados con ruido pueden cambiar el valor lógico en la medición, y así afectar nuestra habilidad de leer el qubit lógico. Esto puede ser mitigado al analizar los valores de síndrome. Estos nos pueden decir si los valores lógicos han cambiado o no, y entonces nos permiten corregir los errores. El proceso de analizar el síndrome para corregir los errores es llamado ‘decodificación’. Hacemos esto mediante la construcción de un objeto de decodificación para nuestro código.
fr_fr: Les résultats bruyants peuvent changer la valeur logique lors de la lecture et donc affecter notre capacité à lire le qubit logique. Cela peut être atténué en regardant les valeurs du syndrome. Ils peuvent nous dire si oui ou non les valeurs logiques sont les plus susceptibles d'avoir changé, et donc nous permettre de corriger les erreurs. Le processus d'analyse du syndrome pour corriger les erreurs est appelé 'decoding' (décodage). Nous le faisons en construisant un objet de décodage pour notre code.
id_id: Hasil yang noisy dapat mengubah nilai logis dari readout, dan sehingga mempengaruhi kemampuan kita untuk membaca qubit logis. Hal ini dapat dicegah dengan melihat pada nilai sindrom. Ini dapat memberitahu kita apakah nilai logis sangat mungkin sudah berubah, sehingga memungkinkan kita untuk mengoreksi erornya. Proses menganalisis sindrom untuk mengoreksi kesalahan disebut 'mendekode'. Kita melakukan ini dengan membuat sebuah objek dekode untuk kdoe kita.
ja_jp: ノイズの多い結果では、読み出し時の論理値が変わりうるので、論理量子ビットの読み出し能力に影響を与えます。この影響は、シンドローム値を見ることで軽減することができます。これらは、論理値が変化した可能性が高いかどうかを教えてくれるので、エラーを修正することができます。エラーを修正するためにシンドロームを分析するプロセスは、デコーディング」と呼ばれています。これを行うには、コード用のデコーディング・オブジェクトを構築します。
ko_kr: 결과적으로 읽을 수 없는 결과는 논리적인 값을 변경할 수 있으므로 논리적인 값을 읽을 수 있는 우리의 능력에 영향을 미칠 수 있다. 이는 신드롬 값들을 봄으로써 완화될 수 있다. 이들은 논리적 값이 변경되었을 가능성이 가장 높은지 여부를 알 수 있으므로 오류를 정정할 수 dTek. 오류를 정정하기 위해 신드롬을 분석하는 프로세스는 '디코딩' 이라고 불린다. 코드에 대한 디코딩 오브젝트를 빌드하여 이를 수행한다.
ru_ru: Зашумленные результаты могут изменить логическое значение при считывании и таким образом повлиять на нашу способность считывать логический кубит. Это обстоятельство можно ослабить, если посмотреть на значения синдромов. Они могут сказать нам, изменились ли логические значения с наибольшей вероятностью, и таким образом позволить нам исправить ошибки. Процесс анализа синдрома для исправления ошибок называется ‘декодированием’. Для этого мы создаем объект декодирования для нашего кода.
ta_in: சத்தமில்லாத முடிவுகள் வாசிப்பில் தர்க்கரீதியான மதிப்பை மாற்றக்கூடும், எனவே தருக்க குவிட்டைப் படிக்கும் திறனை பாதிக்கும். நோய்க்குறி மதிப்புகளைப் பார்த்து இதைத் தணிக்க முடியும். தர்க்கரீதியான மதிப்புகள் பெரும்பாலும் மாறியிருக்கிறதா இல்லையா என்பதை இவை நமக்குச் சொல்லக்கூடும், எனவே பிழைகளை சரிசெய்ய அனுமதிக்கும். பிழைகளை சரிசெய்ய நோய்க்குறியை பகுப்பாய்வு செய்யும் செயல்முறையை ‘டிகோடிங்’ என்று அழைக்கப்படுகிறது. எங்கள் குறியீட்டிற்கான டிகோடிங் பொருளை உருவாக்குவதன் மூலம் இதைச் செய்கிறோம்.
tr_tr: Gürültülü sonuçlar, okuma sırasında mantıksal değeri değiştirebilir ve bu nedenle mantıksal kübiti okuma yeteneğimizi etkiler. Bu, sendrom değerlerine bakarak hafifletilebilir. Bunlar bize mantıksal değerlerin büyük olasılıkla değişip değişmediğini söyleyebilir ve bu nedenle hataları düzeltmemize izin verir. Hataları düzeltmek için sendromu analiz etme sürecine 'decoding' (kodu çözümleme) denir. Bunu kodumuz için bir kod çözme nesnesi oluşturarak yapıyoruz.
zh_tw: 具有雜訊的結果可以在讀出時改變邏輯值，從而影響我們讀出邏輯量子位元的能力。通過查看症狀值可以減緩這種影響。 這些症狀值可以告訴我們哪些邏輯值是否最有可能發生改變，因此允許我們更正錯誤。 對錯誤進行分析和處理的過程稱為‘decoding’.。 我們通過為我們的程式碼建立一個解碼物件來完成這一任務。

source: This analyzes the code by seeing how different kinds of error change the output. With this information, along with a decoding algorithm, we can determine what the logical value is most likely to have been.
bn_bn: এটি বিশ্লেষণ করে কোডটি কিভাবে বিভিন্ন ত্রুটি আউটপুট পরিবর্তন করে তা দেখে। এই তথ্য এবং ডিকোডিং অ্যালগরিদম দিয়ে আমরা নির্ধারণ করতে পারি কি লজিক্যাল বা যৌক্তিক মান খুব সম্ভব হতে পারত।
es_un: Esto analiza el código al ver cómo diferentes tipos de error cambian el resultado. Con esta información, junto con un algoritmo de decodificación, podemos determinar cuál valor lógico que más probablemente haya sido.
fr_fr: Cela permet d'analyser le code en regardant comment différents types d'erreur modifient la sortie. Avec cette information, ainsi qu'un algorithme de décodage, nous pouvons déterminer quelle est la valeur logique la plus probable.
id_id: Ini menganalisis kode dengan melihat bagaimana berbagai macam eror mengubah keluarannya. Dengan informasi ini, bersama dengan algoritma dekode, kita dapat menentukan nilai logis apa yang paling mungkin terjadi.
ja_jp: これは、エラーの種類によって出力がどのように変化するかを見ることによってコードを分析します。 この情報と、デコードアルゴリズムを組み合わせることで、論理値が何であった可能性が最も高いのかを判断できます。
ko_kr: 이는 서로 다른 종류의 오류가 출력을 어떻게 변화시키는지 보고 코드를 분석한다. 이 정보를 통해 디코딩 알고리즘과 함께 논리적 값이 무엇이었을지를 결정할 수 있다.
pt_br: Isto analisa o código ao ver como diferentes tipos de erro alteram a saída. Com estas informações, juntamente com um algoritmo de decodificação, podemos determinar qual o valor lógico mais provável de ter sido.
ru_ru: Использованная команда позволяет проанализировать код, посмотрев, как различные виды ошибок изменяют выходной сигнал. С помощью этой информации и алгоритма декодирования мы можем определить, каким, скорее всего, было логическое значение.
ta_in: பல்வேறு வகையான பிழைகள் வெளியீட்டை எவ்வாறு மாற்றுகின்றன என்பதைப் பார்த்து இது குறியீட்டை பகுப்பாய்வு செய்கிறது. இந்த தகவலுடன், டிகோடிங் வழிமுறையுடன், தருக்க மதிப்பு என்னவாக இருக்கும் என்பதை நாம் தீர்மானிக்க முடியும்.
tr_tr: Bu, farklı hata türlerinin çıktıyı nasıl değiştirdiğini görerek kodu analiz eder. Bu bilgilerle, bir kod çözme algoritması ile birlikte, mantıksal değerin büyük olasılıkla ne olduğunu belirleyebiliriz.
zh_tw: 這會透過查看不同類型的錯誤改變其輸出的方式來分析程式碼。 有了這些資訊，加上解碼演算法，我們就可以判斷該邏輯值最有可能是什麼了。

source: For example, let’s use the ‘matching’ algorithm to decode, which is based on minimum weight perfect matching. This takes specific output strings as input. We’ll give it the simple example string ``'1 0 001 100 100'``, for a logical ``1`` that has suffered two errors.
bn_bn: উদাহরণ স্বরূপ ব্যাবহার করা যাক ‘ম্যাচিং’ অ্যালগরিদম বা সমাধান পদ্ধতি ডিকোড ‍করার জন্য যেটি সর্বনিম্ন বা মিনিমাম নিখুঁত বা পারফেক্ট ম্যাচিং ভিত্তিক।এটি গ্রহণ করে নির্দিষ্ট আউটপুট স্ট্রিংস ইনপুট হিসেবে।আমাদের এটিকে দেবো সরল উদাহরণ স্ট্রিং ``'1 0 001 100 100'``একটি লজিক্যাল বা যৌক্তিক ``1`` এর জন্য যেটি দুটি ত্রুটি সহ্য করেছে।
es_un: Por ejemplo, usemos el algoritmo de ‘matching’ para decodificar, el cual esta basado en el apareamiento perfecto de mínimo peso. Este toma los strings de salida cómo entrada. Le daremos la cadena de ejemplo ``'1 0 001 100 100'``, para un valor lógico de ``1`` que tiene dos errores.
fr_fr: Par exemple, utilisons l'algorithme de 'matching' (correspondance) pour décoder, qui est basé sur le poids minimum de la correspondance parfaite. Cela prend des chaînes de sortie spécifiques en entrée. Nous lui donnerons l'exemple d'une simple chaîne de caractères ``'1 0 001 100 100'``, pour un ``1`` logique qui a subi deux erreurs.
id_id: Sebagai contoh, mari kita pakai algoritma 'pencocokan' untuk mendekode, yang didasarkan pada pencocokan sempurna dari berat minimum. Ini mengambil keluaran spesifik dari string sebagai masukannya. Kita akan memberikan contoh string sederhana ``'1 0 001 100 100'``, untuk ``1`` logis yang mengalami dua eror.
ja_jp: 例えば、最小重みの完全一致に基づいた「マッチング」アルゴリズムを使ってデコードしてみましょう。このアルゴリズムは特定の出力文字列を入力として受け取ります。ここでは単純な文字列 ``'1 0 001 100 100'`` の例を示します。
ko_kr: 예를 들어, 최소 가중치 완벽 일치를 기반으로 하는 '일치' 알고리즘을 사용하자. 이는 특정 출력 문자열을 입력으로 사용한다. 두 개의 오류를 겪은 논리적인 ``1`` 을 위해 간단한 예제 문자열 ``'1 0 001 100 100'`` 을 제공한다.
ru_ru: Например, для декодирования воспользуемся алгоритмом 'matching', который основан на минимальном весовом идеальном соответствии. В качестве входных данных он принимает определенные выходные строки. Мы дадим ему простой пример строки ``'1 0 001 100 100'`` для логической ``1``, которая претерпела две ошибки.
ta_in: எடுத்துக்காட்டாக, டிகோட் செய்ய ‘பொருந்தும்’ வழிமுறையைப் பயன்படுத்தலாம், இது குறைந்தபட்ச எடை சரியான பொருத்தத்தை அடிப்படையாகக் கொண்டது. இது குறிப்பிட்ட வெளியீட்டு சரங்களை உள்ளீடாக எடுக்கும். இரண்டு பிழைகளை சந்தித்த தர்க்கரீதியான ``1`` க்கு எளிய எடுத்துக்காட்டு சரம் ``'1 0 001 100 100'`` ஐ வழங்குவோம்.
tr_tr: Örneğin, kod çözme için minimum ağırlık mükemmel eşleşmesine dayanan 'eşleştirme' algoritmasını kullanalım. Bu, belirli çıktı dizelerini girdi olarak alır. İki hatadan muzdarip bir mantıksal ``1`` için ``'1 0 001 100 100'`` basit örnek dizisini vereceğiz.
zh_tw: 例如，讓我們使用 'matching' 演算法來解碼（以最小加權完美匹配為基礎）。 這會以特定的輸出字串作為輸入。 我們將提供一個簡單範例字串 ``'1 0 001 100 100'``，對於邏輯 ``1`` ，此字串有兩個錯誤。

source: The output is what the logical part should have been. As you can see, the decoder correctly determined that the readout should have been of a logical ``1``.
bn_bn: আউটপুটটি হলো যেটি লজিক্যাল বা যৌক্তিক অংশ টি হওয়া উচিত ছিল।এটা আপনি দেখতে পাচ্ছেন যে ডিকোডার সঠিকভাবে নির্ধারণ করতে পারছে রিডাউটটি হওয়া উচিত ছিল ``1``।
es_un: La salida es lo qué la parte lógica debió de haber sido. Como puedes ver, el decodificador determinó correctamente que la medición debió de haber sido un ``1``.
fr_fr: La sortie est ce que la partie logique aurait dû être. Comme vous pouvez le voir, le décodeur a correctement déterminé que la lecture aurait dû être d'un ``1`` logique.
id_id: Keluaran adalah bagian logis yang seharusnya. Seperti yang Anda lihat, dekoder dengan benar menentukan bahwa redout seharusnya adalah ``1`` logis.
ja_jp: 出力は論理的な部分が何であるべきかである。 ご覧のとおり、デコーダは読み出しが論理的な ``1`` であるべきだと正しく判断しました。
ko_kr: 출력은 논리적인 부분이 되여아 하는 것이다. 보다시피 디코더는 판독값이 논리적 ``1`` 이어야 한다고 올바르게 판단했다.
pt_br: A saída é o que a parte lógica deveria ter sido. Como se pode ver, o decodificador determinou corretamente que a leitura deveria ter sido de um ``1`` lógico.
ru_ru: Вывод – это то, какой должна была быть логическая часть. Как видите, декодер правильно определил, что считывание должно было быть логической ``1``.
ta_in: வெளியீடு என்பது தர்க்கரீதியான பகுதியாக இருந்திருக்க வேண்டும். நீங்கள் பார்க்க முடியும் என, டிகோடர் சரியாக வாசிப்பு ஒரு தர்க்கரீதியான ``1`` ஆக இருக்க வேண்டும் என்று தீர்மானித்தது.
tr_tr: Çıktı, mantıksal kısmın olması gereken şeydir. Gördüğünüz gibi, kod çözücü, okumanın mantıksal bir ``1`` olması gerektiğini doğru bir şekilde belirledi.
zh_tw: 該邏輯部分先前應該要和該輸出相同。 如您所見，解碼器正確地判斷讀出先前應該要是邏輯的 ``1`` 。
