Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/6_repetition_code.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: This also has a ``logs`` kwarg, which is a list of the circuits for which ``X`` is applied. This is ``['0','1']`` by default.
bn_bn: ইহার একটি ``logs`` কীওয়ার্ড আর্গুমেন্টও আছে, যা একটি বর্তনীর (সার্কিট) তালিকা যার জন্য ``X`` কে প্রয়োগ করা হয়েছে।ইহা গতানুগতিকভাবে ``['0','1']`` ।
es_un: Esto también tiene el kwarg ``logs``, que es una lista de los circuitos para los cuales ``X`` es aplicada. Esto es ``['0','1']`` de forma predeterminada.
fr_fr: Ceci a également un kwarg (argument), ``logs``, qui est une liste des circuits pour lesquels ``X`` est appliqué. C'est ``['0','1']`` par défaut.
id_id: Ini juga memiliki kwarg ``logs``, yang merupakan daftar sirkuit di mana ``X`` diterapkan. Ini adalah ``['0','1']`` secara default.
it_it: È presente anche il kwarg ``logs`` che fornisce la lista dei circuiti per cui è stato applicato ``X``. Questa è ``['0','1']`` da impostazione predefinita.
ja_jp: これは ``logs`` kwarg を持ち、``X`` が適用される回路のリストです。デフォルトでは ``['0','1']`` です。
ko_kr: 이것은 또한 ``X`` 가 적용되는 회로의 목록인 ``logs`` kwarg도 가지고 있다. 이것은 기본적으로 ``['0','1']`` 이다.
pt_br: Este também possui um kwarg ``logs``, que é uma lista dos circuitos para os quais ``X`` é aplicado. Ele é ``['0','1']`` por padrão.
ru_ru: У этого параметра также есть именованный аргумент ``logs``, который представляет собой список цепей, для которых применяется ``X``. По умолчанию это ``['0','1']``.
ta_in: இது ஒரு ``logs`` குவார்க்கையும் கொண்டுள்ளது, இது ``X`` பயன்படுத்தப்படும் சுற்றுகளின் பட்டியல். இது முன்னிருப்பாக ``['0', '1']``.
tr_tr: Bunda ayrıca, ``X`` in uygulandığı devrelerin bir listesi olan bir ``logs`` kwarg'ı vardır. Bu, varsayılan olarak ``['0', '1']`` dir.
zh_tw: 這也有 ``logs`` kwarg，它是已套用 ``X`` 的電路清單。 其預設為 ``['0','1']`` 。

source: Final readout is then done with the ``readout()`` method.
bn_bn: চূড়ান্ত পর্যবেক্ষণ বা রিড আউট তারপর করা হয় ``readout()`` পদ্ধতিটি দিয়ে।
es_un: La lectura final se realiza con el método ``readout()``.
fr_fr: La lecture finale est alors faite avec la méthode ``readout()``.
id_id: Readout terakhir kemudian dilakukan dengan metode ``readout()``.
it_it: La lettura finale viene poi effettuata con il metodo ``readout()``.
ja_jp: 最終的な読み出しは ``readout()`` メソッドで行います。
ko_kr: 그런 다음 최종 판독은 ``readout()`` 방식으로 수행된다.
pt_br: A leitura final é, então, feita com o método ``readout()``.
ru_ru: Окончательное считывание производится методом ``readout()``.
ta_in: இறுதி வாசிப்பு பின்னர் ``readout()`` முறை மூலம் செய்யப்படுகிறது.
tr_tr: Son okuma daha sonra ``readout()`` metoduyla yapılır.
zh_tw: 然後，最終的讀取可以被 ``readout()`` 的方法完成。

source: Running a repetition code
bn_bn: একটি পুনরাবৃত্তি বা রিপিটেশন কোড চালানো বা রান করানো।
es_un: Ejecutar un código de repetición
fr_fr: Exécution d'un code de répétition
id_id: Menjalankan kode repetisi
it_it: Esecuzione di un codice di ripetizione
ja_jp: 反復符号を実行する
ko_kr: 반복 코드 실행하기
pt_br: Executando um código de repetição
ru_ru: Запуск кода повторения
ta_in: மறுபடியும் குறியீட்டை இயக்குகிறது
tr_tr: Tekrarlama kodu çalıştırma
zh_tw: 執行一個重複程式碼

source: The code object produces the circuits required for the code. The user can then run them using any method they prefer, allowing full control over compilation, backends, noise models and so on.
bn_bn: কোড অবজেক্টি বর্তনী (সার্কিট) তৈরি করে প্রয়োজনীয় কোডটির জন্য। ব্যাবহার করি তারপর তার পছন্দ মত জেকনো পদ্ধতি ব্যবহার করে চালাতে বা রুন করাতে পারেন, পূর্ণ নিয়ন্ত্রনের অনুমতি দিয়ে সংকলন, ব্যাকএন্ড, দূষণ বা ত্রুটি নকশা, ইত্যাদির উপর ।
es_un: El objeto code produce los circuitos requeridos para el código. El usuario puede ejecutarlos usando el método que prefieran, permitiendo el control total de la compilación, los backends, los modelos de ruido y así sucesivamente.
fr_fr: L'objet code produit les circuits requis pour le code. L'utilisateur peut ensuite les exécuter en utilisant n'importe quelle méthode qu'il préfère, en permettant un contrôle total de la compilation, des backends (plateformes quantiques), des modèles de bruit, etc.
id_id: Objek kode menghasilkan sirkuit yang dibutuhkan untuk kode. Pengguna kemudian dapat menjalankan mereka dengan menggunakan metode apapun yang disukai, memungkinkan kontrol penuh atas kompilasi, backend, model noise dan sebagainya.
it_it: L'oggetto code produce i circuiti richiesti per il codice di ripetizione. L'utente può quindi eseguirli scegliendo il metodo più adatto, avendo quindi pieno controllo sulla compilazione, i backend, i modelli di rumore e così via.
ja_jp: コードオブジェクトは、コードに必要な回路を生成します。 ユーザーは、任意の方法を使用してそれらを実行し、コンパイル、バックエンド、ノイズモデルなどを完全に制御できます。
ko_kr: 코드 객체는 코드에 필요한 회로를 생성한다. 그런 다음 사용자는 원하는 방법을 사용하여 실행시켜 컴파일, 백엔드, 노이즈 모델 등을 완벽한 제어를 할 수 있다.
pt_br: O objeto de código produz os circuitos necessários para o código. O usuário pode, então, executá-los usando qualquer método que preferir, permitindo o controle total sobre compilação, backends, modelos de ruído e, assim por diante.
ru_ru: Объект кода создает схемы, необходимые для кода. Затем пользователь может запустить их любым удобным для него методом, обеспечивая полный контроль над компиляцией, бэкендами, моделями шума и так далее.
ta_in: குறியீடு பொருள் குறியீட்டிற்கு தேவையான சுற்றுகளை உருவாக்குகிறது. பயனர் பின்னர் அவர்கள் விரும்பும் எந்தவொரு முறையையும் பயன்படுத்தி அவற்றை இயக்க முடியும், இது தொகுப்பு, பின்தளத்தில், சத்தம் மாதிரிகள் மற்றும் பலவற்றில் முழு கட்டுப்பாட்டை அனுமதிக்கிறது.
tr_tr: Kod nesnesi, kod için gerekli devreleri üretir. Kullanıcı daha sonra, derleme, arka uçlar, gürültü modelleri vb. üzerinde tam kontrole izin vererek tercih ettikleri herhangi bir yöntemi kullanarak bunları çalıştırabilir.
zh_tw: 程式碼物件會產生程式碼所必需的電路。 然後，使用者可以使用他們偏好的任何方法來執行它們，從而對編譯的過程，後端、雜訊模型等有完整的控制。

source: For example, here we run them without noise on the ``qasm_simulator``.
bn_bn: উদাহরণ স্বরূপ এখানে আমরা তাদের ``qasm_simulator`` উপর চালাই দূষণ বা ত্রুটি ছাড়াই।
es_un: Por ejemplo, aquí los ejecutamos sin ruido con el ``qasm_simulator``.
fr_fr: Par exemple, ici nous les exécutons sans bruit sur le ``qasm_simulator``.
id_id: Sebagai contoh, di sini kita menjalankan mereka tanpa noise pada ``qasm_simulator``.
it_it: Per esempio, qui li eseguiamo senza rumore sul ``qasm_simulator``.
ja_jp: 例えば、ここでは ``qasm_simulator`` 上でノイズなしで実行します。
ko_kr: 예를 들어 ``qasm_simulator`` 에서 노이즈 없이 실행한다.
pt_br: Por exemplo, aqui, os executamos sem ruído no ``qasm_simulator``.
ru_ru: Например, здесь мы запускаем их без шума на ``qasm_simulator``.
ta_in: எடுத்துக்காட்டாக, இங்கே ``qasm_simulator`` இல் சத்தமின்றி அவற்றை இயக்குகிறோம்.
tr_tr: Örneğin, burada onları ``qasm_simulator`` üzerinde gürültü olmadan çalıştırıyoruz.
zh_tw: 例如，在這裡我們用 ``qasm_simulator`` 來執行沒有雜訊的程式碼。

source: Here the strings from right to left represent the outputs of the syndrome measurement rounds, followed by the final measurement of the code qubits.
bn_bn: এখানে বাম দিক থেকে ডান দিকে যোয়া স্ট্রিংটি সিনড্রোম পরিমাপ রাউন্ড গুলির আউটপুটকে জ্ঞাত করে, পরবর্তীতে কোড কিউবিটের চূড়ান্ত পরিমাপ জ্ঞাত করে।
es_un: Aquí las cadenas de derecha a izquierda representan las salidas de las rondas de mediciones de síndrome, seguidas por las mediciones finales de bits de código.
fr_fr: Ici, les chaînes de droite à gauche représentent les sorties des cycles de mesure du syndrome, suivies de la mesure finale des qubits de code.
id_id: Di sini string dari knan ke kiri mewakili keluaran dari putaran pengukuran sindrom, diikuti dengan pengukuran terakhir dari qubit kode.
it_it: Qui le stringhe lette da destra a sinistra rappresentano i risultati delle misurazioni dei cicli della sindrome, seguiti dalla misura finale dei qubit code.
ja_jp: ここで、右から左への文字列は、シンドローム測定ラウンドの出力を表し、その後に符号量子ビットの最終測定が続きます。
ko_kr: 여기서 오른쪽에서 왼쪽으로 읽는 문자열은 신드롬 측정의 출력을 나타내고, 그 뒤에 코드 큐비트의 최종 측정값이 이어진다.
pt_br: Aqui, as strings da direita para a esquerda representam as saídas das rodadas de medição da síndrome, seguidas da medição final dos qubits de código.
ru_ru: Здесь строковые переменные представляют выходы раундов измерения синдрома справа налево, после чего следует окончательное измерение кодовых кубитов.
ta_in: இங்கே வலமிருந்து இடமாக உள்ள சரங்கள் நோய்க்குறி அளவீட்டு சுற்றுகளின் வெளியீடுகளைக் குறிக்கின்றன, அதைத் தொடர்ந்து குறியீட்டு வினாடிகளின் இறுதி அளவீடு.
tr_tr: Burada sağdan sola dizeler, sendrom ölçüm turlarının çıktılarını ve ardından kod kübitlerinin son ölçümünü temsil eder.
zh_tw: 從右到左的字串代表了症候群測量的輸出，接著是對程式碼量子位元的最終測量。

source: These results need to be rewritten in a different form in order to be decoded. To do this we can use the ``process_results`` method of the code object.
bn_bn: এই ফলাফল গুলি অন্ন রূপে পুনরায় লেখার প্রয়োজন তাদের ডিকোড করার বা সংকেতাক্ষরের অর্থ উদ্ধারের জন্যে।এটা করার জন্য আমরা ব্যাবহার করতে পারি কোড অবজেক্টের ``process_results`` পদ্ধতি ।
es_un: Estos resultados deben ser reescritos en una forma diferente para que puedan ser decodificados. Para esto podemos utilizar el método ``process_results`` del objeto code.
fr_fr: Ces résultats doivent être réécrits sous une forme différente pour être décodés. Pour cela, nous pouvons utiliser la méthode ``process_results`` de l'objet code.
id_id: Hasil ini perlu ditulis ulang dalam bentuk yang berbeda agar dapat didekode. Untuk melakukan ini kita dapat menggunakan metode ``process_results`` dari objek kode.
it_it: Per poter essere decodificati, questi risultati hanno bisogno di essere riscritti in una forma differente. Per fare questo è possibile utilizzare il metodo ``process_results`` dell'oggetto code.
ja_jp: これらの結果は、デコードするために別の形式で書き換える必要があります。 これを行うには、符号オブジェクトの ``process_results`` メソッドを使用します。
ko_kr: 이러한 결과들은 디코딩되기 위해 다른 형태로 개정될 필요가 있다. 이를 위해 코드 객체의 ``process_results`` 방법을 사용할 수 있다.
pt_br: Estes resultados precisam ser reescritos de uma forma diferente para serem decodificados. Para fazer isto, podemos utilizar o método ``process_results`` do objeto.
ru_ru: Эти результаты необходимо переписать в другую форму, чтобы их можно было декодировать. Для этого мы можем использовать метод ``process_results`` объекта code.
ta_in: டிகோட் செய்ய இந்த முடிவுகளை வேறு வடிவத்தில் மீண்டும் எழுத வேண்டும். இதைச் செய்ய, குறியீடு பொருளின் ``process_results`` முறையைப் பயன்படுத்தலாம்.
tr_tr: Bu sonuçların kodunun çözülebilmesi için farklı bir biçimde yeniden yazılması gerekir. Bunu yapmak için kod nesnesinin ``process_results`` metodunu kullanabiliriz.
zh_tw: 這些結果需要以不同的格式重新編寫，才能被解碼。 為了這樣做，我們可以使用程式碼物件的 `process_results`` 方法。

source: The result is a dictionary whose keys are bit strings that represent outputs of the circuit, and the values represent the number of shots for which this output occurred.
bn_bn: ফলাফলটি হলো একটি ডিকশনারি যার কিস গুলি হলো বিট স্ট্রিংস যেগুলি বর্তনীর (সার্কিট) আউটপুট গুলোকে বর্ণনা করে এবং ভ্যালু গুলি শটসমূহের সংখ্যাকে বর্ণনা করে যাদের জন্য আউটপুট পাওয়া গেছে।
es_un: El resultado es un diccionario cuyas claves son cadenas de bits que representan salidas del circuito, y los valores representan el número de iteraciones para los que se produjo esta salida.
fr_fr: Le résultat est un dictionnaire dont les clés sont des chaînes de bits qui représentent les sorties du circuit, et les valeurs représentent le nombre d'exécutions pour lesquelles cette sortie s'est produite.
id_id: Hasilnya adalah kamus yang kuncinya adalah string bit yang merepresentasikan keluaran sirkuit, dan nilainya merepresentasikan jumlah dari tembakan yang mana keluaran ini terjadi.
it_it: Il risultato è un dizionario le cui chiavi sono stringhe di bit che rappresentano gli output del circuito, ed i valori rappresentano il numero di shot che si è ottenuto quell'output.
ja_jp: 結果は、回路の出力を表すビット文字列をキーとする辞書です。 値は、この出力が発生したショットの数を表します。
ko_kr: 결과는 해당 키가 회로의 출력을 나타내는 비트 스트링(bit string) 인 사전이고, 값은 이 출력이 발생한 샷의 수를 나타낸다.
pt_br: O resultado é um dicionário, cujas chaves são strings de bits que representam saídas do circuito, e os valores representam o número de execuções (shots) para os quais esta saída ocorreu.
ru_ru: В результате создается словарь, ключами которого являются битовые строки, представляющие выходные данные схемы, а значениями – количество считываний, за которое эти данные были произведены.
ta_in: இதன் விளைவாக ஒரு அகராதி அதன் விசைகள் பிட் சரங்களாக இருக்கின்றன, அவை சுற்றுகளின் வெளியீடுகளைக் குறிக்கின்றன, மேலும் மதிப்புகள் இந்த வெளியீடு நிகழ்ந்த காட்சிகளின் எண்ணிக்கையைக் குறிக்கும்.
tr_tr: Sonuç, anahtarları devrenin çıktılarını temsil eden bit dizileri olan bir sözlüktür ve değerler, bu çıktının meydana geldiği deneme sayısını temsil eder.
zh_tw: 結果是一個字典，其索引鍵是代表電路的輸出的位元字串，且其值代表最後貢獻到其輸出的量測次數。

source: The strings are not the direct output from the circuits. They have been processed to take the form that helps us correct errors. Here’s a short guided tour.
bn_bn: স্ট্রিং গুলি বর্তনীর (সার্কিট) সমক্ষ আউটপুট নয়। তাদের প্রক্রিয়াজাত করা হয়েছে এমন রূপ নিতে যেটি আমাদের ত্রুটি সংশোধন করতে সাহায্য করবে। এখানে একটি সংক্ষিপ্ত আভাস দেওয়া হলো।
es_un: Las cadenas no son las salidas directas de los circuitos. Estas han sido procesadas para tomar una forma que nos ayude a corregir errores. Aquí hay una breve excursión guiada.
fr_fr: Les chaînes de caractères ne sont pas la sortie directe des circuits. Ils ont été traités pour prendre la forme qui nous aide à corriger les erreurs. Voici une courte visite guidée.
id_id: String-nya bukan merupakan keluaran langsung dari sirkuit. Mereka sudah diproses untuk mengambil bentuk yang membantu kita mengoreksi eror. Berikut adalah panduan pendek.
ja_jp: 文字列は回路からの直接出力ではありません。エラー修正に役立つ形式を取るために処理されています。ここでは、短いガイドツアーが用意されています。
ko_kr: 문자열은 회로의 직접 출력이 아니다. 오류를 정정하는 데 도움이 되는 양식을 사용하도록 처리되었다. 여기 짧은 안내 투어가 있다.
ru_ru: Строковые переменные не являются прямыми выходными данными из схем. Они были специально обработаны, чтобы принять форму, которая помогает нам исправить ошибки. Вот краткий экскурс.
ta_in: சரங்கள் சுற்றுகளிலிருந்து நேரடி வெளியீடு அல்ல. பிழைகளை சரிசெய்ய உதவும் படிவத்தை எடுக்க அவை செயலாக்கப்பட்டுள்ளன. ஒரு குறுகிய வழிகாட்டுதல் சுற்றுப்பயணம் இங்கே.
tr_tr: Dizeler, devrelerin doğrudan çıktısı değildir. Hataları düzeltmemize yardımcı olacak formu alacak şekilde işlendiler. Burada kısa bir rehber sunuluyor.
zh_tw: 這些字串不是該電路的直接輸出。 它們已被轉換成可以協助我們更正錯誤的形式。 以下是一個簡短的導覽。

source: The ``0 0`` to the far left for the logical ``0`` result, and the ``1 1`` to the far left of the logical ``1``, are the logical readout. Any code qubit could be used for this readout, since they should (without errors) all be equal. So we could have just one result here, for one arbitrarily chosen code qubit. Or we could have :math:`d`, one for each qubit. Instead we have two, from the two qubits at either end of the line. This is because it works best with the decoder (which we’ll use later). In the absence of errors, these two values will always be equal.
bn_bn: লজিক্যাল বা যৌক্তিক ``0`` ফলাফলের একবারে বান দিকে থাকা ``0 0`` এবং লজিক্যাল বা যৌক্তিক ``1`` এর একবারে বান দিকে থাকা ``1 1`` গুলি হলো লজিক্যাল রিডাউট। যেকোনো কোড কিউবিট ব্যাবহার করা যেতে পারে নিরীক্ষণ বা রিডাউট করার জন্য,যেহেতু তারা ত্রুটি ছাড়া সবাই সমান। ইচ্ছেমত যেকোনো কোড কিউবিটের আমরা তাই এখানে একটি মাত্র ফলাফল পেতে পারি। তাছাড়া আমাদের থাকবে :math:`d` একটি করে প্রতিটি কিউবিটের জন্যে। পরিবর্তে আমাদের দুটি থাকবে দুটি কিউবিট থেকে লাইনের বা রেখার দুটি প্রান্তে।ইহার কারণ এটি সব থেকে ভালো কার্যকরী হয় ডিকোডারের সাথে যেটা আমরা পরে ব্যাবহার করবো। ত্রুটির অবর্তমানে এই দুটির মান সবসময় সমান।
es_un: El ``0 0`` a la izquierda en el resultado lógico ``0``, y el ``1 1`` a la izquierda en el resultado lógico ``1``, son las mediciones lógicas. Cualquier qubit de código puede ser usado para esta medición, ya que deberían (al no haber errores) de ser todos iguales. Entonces podríamos tener un solo resultado aquí, para un qubit de código elegido arbitrariamente. O podríamos tener :math:`d` resultados, uno para cada qubit. En vez de esto tenemos dos, de los dos qubits en ambos extremos de la fila. Esto es porque así funciona mejor el decodificador (que usaremos más adelante). Si no hay errores, esos dos valores siempre serán iguales.
fr_fr: Le ``0 0`` à l'extrême gauche pour le résultat logique ``0`` et le ``1 1`` à l'extrême gauche de la logique ``1``, sont les lectures logiques. N'importe quel qubit de code peut être utilisé pour cette lecture, car ils devraient tous être égaux (sans erreurs). Nous pourrions donc avoir un seul résultat ici, pour un qubit de code arbitrairement choisi. Ou nous pourrions en avoir :math:`d`, un pour chaque qubits. Au lieu de cela, nous en avons deux, à chaque extrémité de la ligne. C'est parce qu'il fonctionne mieux avec le décodeur (que nous utiliserons plus tard). En l'absence d'erreurs, ces deux valeurs seront toujours égales.
id_id: ``0 0`` ke jauh kiri untuk hasil logis ``0``, dan ``1 1`` ke kanan jauh untuk hasil logis ``1``, adalah readout logis. Setiap qubit kode dapat digunakan untuk readout ini, karena mereka seharusnya (tanpa eror) sama seluruhnya. Jadi kita dapat saja mendapatkan satu hasil di sini, untuk satu kode qubit yang dipilih apapun. Atau kita dapat mendapatkan :math:`d`, satu untuk setiap qubit. Sebaliknya kita memiliki dua, dari dua qubit pada setiap ujung garis. Hal ini karena ini bekerja sangat baik dengan dekoder (yang akan kita pakai nanti). Pada ketidakadanya eror, kedua nilai ini akan selalu sama.
ja_jp: 論理 ``0`` の結果の左端の ``0 0`` 、および論理 ``1`` の左端の ``1 1`` は論理読み出しです。 これらはすべて (エラーがなければ) 等しくなり、読み出しには任意の符号量子ビットを使用できます。したがって、ここでは任意に選択した1つの符号量子ビットに対して1つの結果しか得られません。あるいは、各量子ビットのひとつに :math:`d` を設定することもできます。代わりに、ラインの両端にある2つの量子ビットから2つを得られます。これは、デコーダー (後で使用します) で最適に動作させるためのものです。エラーがない場合、これらの2つの値は常に等しくなります。
ko_kr: ``0 0`` 에서 맨 왼쪽에 있는 논리적인 ``0`` 결과와 ``1 1`` 에서 맨 왼쪽에 있는 논리적 ``1`` 은 논리적인 해독이다. 모든 코드는 이 판독에 사용될 수 있는데, 그 이유는 (오류가 없는) 모든 것이 동일해야 하기 때문이다. 그래서 우리는 여기서 한 가지 결과를 얻을 수 있었다. 임의로 선택된 코드를 위해서였다. 아니면 각각의 것에 하나씩 :math:`d` 가 있을 수도 있다. 그 대신에, 양쪽 끝중에 있는 두개의 큐비트가 있다. 이는 디코더 (나중에 사용할) 로 가장 잘 작동하기 때문이다. 오류가 없으면 이 두 값은 항상 동일하다.
ru_ru: Крайний слева ``0 0`` для логического ``0`` результата и ``1 1`` для крайнего слева логического ``1`` – это логическое считывание. Для этого считывания можно использовать любой кодовый кубит, поскольку все они должны (без ошибок) быть одинаковыми. В принципе, здесь можно было бы использовать только одно число для одного произвольно выбранного кодового кубита. Или мы могли бы использовать :math:`d`, по одному для каждого кубита. Вместо этого мы имеем два результата: от двух кубитов с обоих концов линии. Это связано с тем, что так лучше работает декодер (который мы будем использовать позже). При отсутствии ошибок эти два значения всегда будут равны.
ta_in: தர்க்கரீதியான ``0`` முடிவுக்கு இடதுபுறத்தில் உள்ள ``0 0``, மற்றும் தர்க்கரீதியான ``1`` இன் இடதுபுறத்தில் உள்ள ``1 1`` ஆகியவை தர்க்கரீதியான வாசிப்பு ஆகும். எந்தவொரு குறியீடு குவிட்டையும் இந்த வாசிப்புக்கு பயன்படுத்தலாம், ஏனெனில் அவை (பிழைகள் இல்லாமல்) அனைத்தும் சமமாக இருக்க வேண்டும். எனவே ஒரு தன்னிச்சையாக தேர்ந்தெடுக்கப்பட்ட குறியீடு குவிட்டிற்கு இங்கே ஒரு முடிவை மட்டுமே நாம் பெற முடியும். அல்லது நம்மிடம் இருக்க முடியும் :math:`d`, ஒவ்வொரு குவிட்டிற்கும் ஒன்று. அதற்கு பதிலாக, வரியின் இரு முனைகளிலும் உள்ள இரண்டு குவிட்களிலிருந்து இரண்டு உள்ளன. இது டிகோடருடன் சிறப்பாக செயல்படுவதால் (இது பின்னர் பயன்படுத்துவோம்). பிழைகள் இல்லாத நிலையில், இந்த இரண்டு மதிப்புகள் எப்போதும் சமமாக இருக்கும்.
tr_tr: Mantıksal ``0`` sonucunun en solundaki ``0 0`` ve mantıksal ``1``in en solundaki ``1 1`` mantıksal okumadır. Bu okuma için herhangi bir kod kübiti kullanılabilir, çünkü (hatasız) hepsinin eşit olması gerekir. Yani burada isteğe bağlı seçilmiş bir kod kübiti için tek bir sonuç elde edebiliriz. Ya da her kübit için bir tane :math:`d` alabilirdik. Bunun yerine, satırın her iki ucundaki iki kübitten iki tane var. Bunun nedeni, kod çözücüyle (daha sonra kullanacağımız) en iyi şekilde çalışmasıdır. Hata olmaması durumunda bu iki değer her zaman eşit olacaktır.
zh_tw: 對應於邏輯結果 ``0``，在最左邊的 ``0 0``，以及對應於邏輯結果 ``1``，在最左邊的 ``1 1``，是邏輯讀出。 任何程式碼量子位元都可以用於此讀取，因為它們應該（沒有誤差）都是等價的。 因此，對於任意選擇的一個程式碼量子位元，我們在這裡只能得到一個結果。或者，我們可以有 :math: `d`個結果， 一個結果對應一個量子位元。 不同於上述，我們從線路兩端的兩個量子位中得到兩個結果，這是因為這樣的情況最適合解碼器的運行。 在沒有誤差的情況下，這兩個值永遠是等價的。

source: The following ``0000`` is the :math:`d-1` results of the syndrome measurements for the first round.A ``0`` implies that the corresponding pair of qubits where the same, and ``1`` implies different. There are :math:`d-1` results because the line of :math:`d` code qubits has :math:`d-1` possible neighboring pairs. In the absence of errors, they will all be ``0``.
bn_bn: এই ``0000`` হলো সিনড্রোম পরিমাপের প্রথম রাউন্ডের :math:`d-1` ফলাফল।একটি ``0`` বোঝায় সংশ্লিষ্ট জোড়া কিউবিট গুলির যেখানে আগেরটি এবং ``1`` আলাদা বোঝায়। সেখানে :math:`d-1` ফলাফল আছে কারণ :math:`d` কোড কিউবিটৈর রেখার সম্ভাব্য :math:`d-1` পার্শ্ববর্তী জোড় গুলি আছে। ত্রুটির অবর্তমানে সেগুলি সব ``0`` হবে।
es_un: El ``0000`` siguiente es el resultado :math:`d-1` de las mediciones de síndrome de la primera ronda. Un ``0`` implica que los pares de qubits correspondientes fueron iguales y ``1`` implica que fueron diferentes. Hay :math:`d-1` resultados porque la línea de :math:`d` qubits de código tiene :math:`d-1` posibles pares colindantes. Si no hay errores, todos serán ``0``.
fr_fr: Le ``0000`` suivant est le résultat :math:`d-1` des mesures du syndrome pour le premier cycle. ``0`` implique que la paire correspondante de qubits sont le même et ``1`` implique différent. Il y a :math:`d-1` résultats parce que la ligne de :math:`d` qubits de code a :math:`d-1` paires voisines possibles. En l'absence d'erreurs, ils seront tous ``0``.
id_id: ``0000`` berikut adalah hasil :math:`d-1` dari pengukuran sindrom untuk putaran pertama. ``0`` menunjukkan bahwa pasangan qubit yang sesuai adalah sama, dan ``1`` menunjukkan berbeda. Terdapat :math:`d-1` hasil karena baris kode :math:`d` qubit memiliki :math:`d-1` kemungkinan pasangan bertetanggaan. Tanpa adanya eror, semuanya akan ``0``.
ja_jp: 次の ``0000`` は、最初のラウンドのシンドローム測定の :math:`d-1` 結果です。 ``0`` は対応する量子ビットのペアが同じであることを意味し、 ``1`` は異なることを意味します。 :math:`d` 符号量子ビットの行に :math:`d-1` の可能な隣接ペアがあるため、 :math:`d-1` の結果があります。エラーがない場合、それらはすべて ``0`` になります。
ko_kr: 이 같은 `0000` 은 1차 신드롬 측정 결과인 :math:`d-1` 이다. ``0`` 은 행당하는 큐비트쌍이 동일하다는것을 의미하고 ``1`` 은 다르다는 것을 의미한다. :math:`d` 코드 큐비트 라인에는 :math:`d-1` 가능한 이웃 쌍이 있기 때문에 :math:`d-1` 결과들 나온다. 오류가 없다면 모두 ``0`` 이 될 것이다.
pt_br: Os ``0000`` seguintes são os :math:`d-1` resultados das medições da síndrome para a primeira rodada. Um ``0`` implica que o par correspondente de qubits era igual, e ``1`` implica que era diferente. Existem :math:`d-1` resultados porque a linha de :math:`d` qubits de código tem :math:`d-1` possíveis pares vizinhos. Na ausência de erros, todos serão ``0``.
ru_ru: Следующие ``0000`` – это :math:`d-1` результатов измерений синдрома для первого раунда. ``0`` означает, что соответствующая пара кубитов одинаковая, а ``1`` – разная. Возможно всего :math:`d-1` результатов, потому что линия из :math:`d` кодовых кубитов имеет :math:`d-1` возможных соседних пар. В отсутствие ошибок все они будут ``0``.
ta_in: பின்வரும் ``0000`` :math:`d-1` முதல் சுற்றுக்கான நோய்க்குறி அளவீடுகளின் முடிவுகள். ஒரு ``0`` என்பது தொடர்புடைய ஜோடி குவிட்கள் ஒரே இடத்தில் இருப்பதையும், ``1`` என்பதையும் குறிக்கிறது. வேறுபட்டதைக் குறிக்கிறது. :math:`d-1` முடிவுகள் :math:`d` குறியீடு வினாக்கள் :math:`d-1` சாத்தியமான அண்டை ஜோடிகள் உள்ளன. பிழைகள் இல்லாத நிலையில், அவை அனைத்தும் ``0`` ஆக இருக்கும்.
tr_tr: Aşağıdaki ``0000``, ilk tur için sendrom ölçümlerinin :math:`d-1` sonuçlarıdır.Bir ``0``, kübit çiftinin aynı ve ``1`` farklı olduğunu ima eder. :math:`d-1` sayıda sonuç vardır çünkü :math:`d` kod kübitlerinin satırı :math:`d-1` olası komşu çiftlere sahiptir. Hataların olmaması durumunda hepsi ``0`` olacaktır.
zh_tw: 下列 ``0000`` 是 :math:`d-1` 第一輪症候群測量(syndrome measurements)的結果。 ``0`` 表示對應的量子位元對是相同的，而 ``1`` 表示不同。 我們總共有 :math:`d-1` 個結果因為此擁有 :math:`d` 個程式碼量子位元的線會擁有 :math:`d-1` 個可能的相鄰對。在沒有誤差的情況下，它們都會是 ``0``。
