Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/6_repetition_code.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: The ``0000`` that follows that is the syndrome change between the first and second rounds. It is therefore the bitwise ``OR`` of the syndrome measurement results from the second round with those from the first. In the absence of errors, they will all be ``0``.
bn_bn: ``0000`` যেটি তার পর আসে সেটি হলো সিনড্রোম পরিবর্তন প্রথম এবং দ্বিতীয় রাউন্ডের মধ্যে।এটি তাই সিনড্রোম পরিমাপ ফলাফলের বিটওয়াইজ ``OR`` দ্বিতীয় রাউন্ড থেকে তাদের প্রথমথেকে সাথে নিয়ে। ত্রুটির অবর্তমানে তারা সবাই হবে ``0``।
es_un: El ``0000`` que sigue es el cambio de síndrome entre la primera y segunda ronda. Es, por lo tanto, el operador ``OR`` de los resultados de las mediciones de síndrome de la segunda ronda con los de la primera. Si no hay errores, todos serán ``0``.
fr_fr: Le ``0000`` qui suit est le changement de syndrome entre le premier et le second cycle. C'est donc le ``OR`` au niveau du bit des résultats de la mesure du syndrome du deuxième cycle avec ceux du premier. En l'absence d'erreurs, ils seront tous ``0``.
id_id: ``0000`` yang mengikuti adalah perubahan sindrom antara putaran pertama dan kedua. Oleh karena itu bitwise ``OR`` dari pengukuran sindrom dihasilkan dari putaran kedua dengan yang ada dari putaran pertama. Tanpa adanya eror, mereka semua akan bernilai ``0``.
ja_jp: その後の ``0000`` は、第1ラウンドと第2ラウンドの間のシンドロームの変化です。 したがって、最初からのものと2番目のラウンドからのシンドローム測定結果のビット単位の ``OR`` です。 エラーがなければ、それらはすべて ``0`` になります。
ko_kr: 그 다음에 나오는 ``0000`` 은 첫 번째와 두 번째 라운드 사이의 신드롬 변화이다. 따라서 이는 1차부터 2라운드까지의 신드롬 측정 결과의 비트와이즈 ``OR`` 로 한 것이다. 오류가 없으면 모두 ``0`` 이 될 것이다.
pt_br: O ``0000`` que segue, a isto, é a mudança da síndrome entre a primeira e a segunda rodadas. É, portanto, o ``OR`` bitwise dos resultados da medição da síndrome da segunda rodada com aqueles da primeira. Na ausência de erros, todos serão ``0``.
ru_ru: Следующее за этим ``0000`` является изменением синдрома между первым и вторым раундами. Таким образом, это побитовое ``OR`` результатов измерения синдрома во втором раунде и в первом. В отсутствие ошибок все они будут равны ``0``.
ta_in: அதைத் தொடர்ந்து வரும் `` 0000`` என்பது முதல் மற்றும் இரண்டாவது சுற்றுகளுக்கு இடையிலான நோய்க்குறி மாற்றமாகும். எனவே இது நோய்க்குறி அளவீட்டின் பிட்வைஸ் `` OR`` என்பது இரண்டாவது சுற்றில் இருந்து முதல்வர்களுடன் முடிவடைகிறது. பிழைகள் இல்லாத நிலையில், அவை அனைத்தும் `` 0`` ஆக இருக்கும்.
tr_tr: Bunu takip eden ``0000``, birinci ve ikinci turlar arasındaki sendrom değişikliğidir. Bu nedenle, birinci turdan olanlarla ikinci turdan alınan sendrom ölçüm sonuçlarının bitsel ``OR`` 'udur. Hataların olmaması durumunda hepsi ``0`` olacaktır.
zh_tw: 在其之後的 ``0000`` 是第一輪和第二輪之間的症候群變化。 因此，這是從第一輪到第二輪之間，症候群測量結果中的位元 ``OR``。 在沒有誤差的情況下，它們都將是 ``0``。

source: Subsequent blocks follow the same formula, though the last requires some comment. This is not measured using the standard method (with a link qubit). Instead it is calculated from the final readout measurement of all code qubits. Again it is presented as a syndrome change, and will be all ``0`` in the absence of errors. This is the :math:`T+1`-th block of syndrome measurements since, as it is not done in the same way as the others, it is not counted among the :math:`T` syndrome measurement rounds.
bn_bn: পরবর্তী ব্লক গুলি একটি সূত্র মেনে চলে,যদিও সেসেরটির কিছু কমেন্ট বা মন্তব্যের দরকার হয়।এটি স্ট্যান্ডার্ড বা প্রথাসিদ্ধ পদ্ধতি(একটি লিংক কিউবিটের সাথে) ব্যবহার করে পরিমাপ করা হয়না। পরবর্তীতে এটি গননা করা হয় সমস্ত কোড কিউবিট গুলির চূড়ান্ত রিডাউট পরিমাপ থেকে। আবার এটি একটি সিনড্রোম পরিবর্তন হিসেবে উপস্থাপিত করা হয় এবং সেগুলি সব ``0`` হবে ত্রুটির অবর্তমানে। এটি হলো :math:`T+1` তম সিনড্রোম পরিমাপের ব্লক যেহেতু এটিকে অন্যদের মতন করে করা হয়নি তাই এটিকে :math:`T` সিনড্রোম পরিমাপ রাউন্ডে গুলির সাথে গোনা হয়না।
es_un: Los siguientes bloques siguen la misma fórmula, aunque el último si requiere un comentario. Este no es medido usando el método estándar (con un qubit de enlace). En lugar de esto, es calculado con la última medición de todos los qubits de código. De nuevo, es presentada como un cambio de síndrome, y todos van a ser ``0``, si no hay errores. Este es el :math:`T+1`-ésimo bloque de mediciones de síndrome ya que, como no es realizado de la misma manera que los demás, no se cuenta dentro de las :math:`T` rondas de mediciones de síndrome.
fr_fr: Les blocs suivants suivent la même formule, bien que le dernier nécessite un commentaire. Ceci n'est pas mesuré à l'aide de la méthode standard (avec un qubit de lien). Au lieu de cela, il est calculé à partir de la mesure de lecture finale de tous les qubits de code. Encore une fois, il est présenté comme un changement de syndrome, et sera tout ``0`` en l'absence d'erreurs. Ceci est le :math:`T+1`-ème bloc des mesures du syndrome puisqu'il n'est pas compté parmi les cycles de mesure du syndrome :math:`T`, car il n'est pas fait de la même manière que les autres.
id_id: Blok-blok berikutnya mengikuti formula yang sama, meskipun yang terakhir dibutuhkan beberapa komen, Ini tidak diukur menggunakan metode standar (dengan qubit link). Sebaliknya ini dihitung dari pengukuran readout terakhir dari semua qubit kode. Sekali lagi ini disajikan sebagai perubahan sindrom, dan semuanya menjadi ``0`` dengan tanpa adanya eror. Ini adalah blok :math:`T+1`-th dari pengukuran sindrom sejak ini tidak dilakukan dengan cara seperyi yang lainnya, ini tidak terhitung di antara putaran pengukuran sindrom :math:`T`.
ja_jp: 後続のブロックも同じ式に従いますが、最後のブロックにはコメントが必要です。これは、標準的な方法（リンク量子ビットによる）を使用しても測定されません。代わりに、すべての符号量子ビットの最後の読出測定から計算されます。この場合もシンドロームの変化として表示され、エラーがない場合はすべて ``0`` になります。これはシンドローム測定の :math:`T+1`番目のブロックで、他の方法と同じようには行われないのは、 :math:`T` シンドローム測定ラウンドには含まれないためです。
ko_kr: 마지막으로 일부 주석이 필요하지만 후속 블록은 동일한 수식을 따른다. 이는 표준 방법 (링크 큐비트 포함) 을 사용하여 측정되지 않는다. 대신, 모든 코드 큐비트의 최종 판독 측정으로부터 계산된다. 다시 말해, 그것은 신드롬의 변화로 제시되고 있으며, 오류가 없는 상태에서는 모두 ``0`` 이 될 것이다. 이는 다른것과 동일한 방식으로 이뤄지지 않아 :math:`T` 신드롬 측정 라운드에서 집계되지 않기 때문에 :math:`T+1` 번째 신드롬 측정 블록이다.
pt_br: Os blocos subsequentes seguem a mesma fórmula, embora o último exija algum comentário. Este não é medido usando o método padrão (com um link qubit). Em vez disto, é calculado, a partir da medição da leitura final de todos os qubits de código. Novamente, ela é apresentada como uma mudança da síndrome, e serão todos ``0`` na ausência de erros. Este é o :math:`T+1`-ésimo bloco de medições da síndrome, uma vez que, como não é feito da mesma forma que os outros, não é contado entre as :math:`T` rodadas de medição da síndrome.
ru_ru: Последующие блоки соответствуют той же формуле, хотя последний требует некоторых комментариев. Этот показатель не измеряется стандартным методом (с помощью связующего кубита). Вместо этого он вычисляется из конечного измерения считывания всех кодовых кубитов. Опять же, это представлено как изменение синдрома, и при отсутствии ошибок все значения будут ``0``. Это :math:`T+1`-ый блок синдромных измерений, но, поскольку он выполняется не так, как остальные, он не учитывается среди :math:`T` раундов синдромных измерений.
ta_in: கடைசியாக சில கருத்துக்கள் தேவைப்பட்டாலும், அடுத்தடுத்த தொகுதிகள் அதே சூத்திரத்தைப் பின்பற்றுகின்றன. இது நிலையான முறையைப் பயன்படுத்தி அளவிடப்படவில்லை (இணைப்பு குவிட்டுடன்). அதற்கு பதிலாக இது அனைத்து குறியீடு வினாடிகளின் இறுதி வாசிப்பு அளவிலிருந்து கணக்கிடப்படுகிறது. மீண்டும் இது ஒரு நோய்க்குறி மாற்றமாக வழங்கப்படுகிறது, மேலும் பிழைகள் இல்லாத நிலையில் அனைத்தும் ``0`` ஆக இருக்கும். இது :math:`T+1`-வது நோய்க்குறி அளவீடுகள் என்பதால், இது மற்றவர்களைப் போலவே செய்யப்படாததால், இது கணக்கிடப்படவில்லை :math:`T` நோய்க்குறி அளவீட்டு சுற்றுகள்.
tr_tr: Sonraki bloklar aynı formülü izler, ancak sonuncusu biraz yorum gerektirir. Bu, standart yöntem (bağlantı kübiti ile) kullanılarak ölçülmez. Bunun yerine, tüm kod kübitlerinin son okuma ölçümünden hesaplanır. Yine bir sendrom değişikliği olarak sunulmuştur ve hata yoksa tamamı ``0`` olacaktır. Bu :math:`T+1`-inci sendrom ölçümlerinin bloğudur, çünkü diğerleri ile aynı şekilde yapılmadığından, :math:`T` sendrom ölçüm turları arasında sayılmaz.
zh_tw: 後續的區塊遵循相同的公式，即便其最後的區塊需要一些註解。 這不是使用標準方法（含連結量子位元）來進行測量，而是從所有程式碼量子位元的最終讀出測量中計算出來的。 它再次被呈現為症候群變化，且在沒有誤差的情況下將是全部是 ``0``。 這是第 :math:"T+1" 塊的綜合症測量，因為它沒有像其他方法那樣做，所以不會被計算進 :math:"T" 症候群量測的次數當中。

source: **Example 1:** ``0 0 0110 0000 0000`` would represent a :math:`d=5`, :math:`T=2` repetition code with encoded ``0``. The syndrome shows that (most likely) the middle code qubit was flipped by an error before the first measurement round. This causes it to disagree with both neighboring code qubits for the rest of the circuit. This is shown by the syndrome in the first round, but the blocks for subsequent rounds do not report it as it no longer represents a change. Other sets of errors could also have caused this syndrome, but they would need to be more complex and so presumably less likely.
bn_bn: **উদাহরণ 1:**``0 0 0110 0000 0000`` চিত্রিত করবে একটি :math:`d=5`,:math:`T=2` রিপিটেশন বা পুনরাবৃত্তি কোড সাংকেতাক্ষরিত বা এনকোড হয়েছে ``0`` দিয়ে।সিনড্রোমেটি দেখায় (খুব সম্ভব)যে মাঝের কোড কিউবিটটি উল্টানো বা ফ্লিপ করা হয়েছে একটি ত্রুটির দ্বারা প্রথম পরিমাপ রাউন্ডের আগে।এটি তাকে পার্শ্ববর্তী কোড কিউবিট গুলির সাথে অসমত করায় বাকি বর্তনীর (সার্কিট) জন্যে।এটি সিনড্রোমে দ্বারা দেখানো হয় প্রথম রাউন্ডে কিন্তু পরবর্তী রাউন্ড গুলির জন্যে ব্লক গুলি সেটা আর বিবৃত বা রিপোর্ট করেনা কারণ সেটি আর পরিবর্তন কে চিত্রিত করেনা। অন্ন ত্রুটি সমুহও এই সিনড্রোম ঘটাতে পারতো কিন্তু তাদের হতে হতো আরো জটিল তাই তারা প্রাকদর্শনে কম সম্ভব।
es_un: **Ejemplo 1.** ``0 0 0110 0000 0000`` representaría al código de repetición :math:`d=5`, :math:`T=2` con ``0`` codificado. El síndrome muestra que (muy probablemente) el qubit de código de en medio fue volteado por un error antes de la primera ronda. Esto hace que no esté de acuerdo con los qubits de código colindantes para el resto del circuito. Esto es mostrado por el síndrome en la primera ronda, pero los bloques de las siguientes rondas no lo reportan porque ya no representa un cambio. Otros conjuntos de errores podrían haber causado este síndrome, pero tendrían que ser más complejos y presuntamente más complicados.
fr_fr: **Exemple 1:** ``0 0 0110 0000 0000`` représenterait un code de répétition :math:`d=5`, :math:`T=2` avec un code de répétition encodé ``0``. Le syndrome montre que (très probablement) le qubit de code au milieu a été retourné par une erreur avant le premier cycle de mesure. Cela le fait en désaccord avec les deux qubits de code voisins pour le reste du circuit. Ceci est montré par le syndrome dans le premier cycle, mais les blocs pour les cycles suivants ne le signalent pas car il ne représente plus un changement. D'autres séries d'erreurs auraient également pu causer ce syndrome, mais elles auraient besoin d'être plus complexes et donc probablement moins probables.
id_id: **Contoh 1:** ``0 0 0110 0000 0000`` akan mewakili :math:`d=5`, :math:`T=2` kode repetisi dengan ``0`` yang dienkode. Sindrom menunjukkan bahwa (sangat mungkin) qubit kode yang di tengah dibalik oleh eror sebelum putaran pengukuran pertama. Ini menyebabkannya beberda dengan kedua qubit kode yang bersebelahan untuk sirkuit setelahnya. Ini ditunjukkan oleh sindrom di putaran pertama, tetapi blok untuk putaran selanjutnya tidak melaporkan hal itu karena tidak lagi menunjukkan sebuah perubahan. Set lainnya dari eror juga dapat menyebabkan sindrom ini, tetapi mereka perlu lebih kompleks dan sehingga kurang mungkin.
ja_jp: **例 1:** ``0 0110 0000`` は :math:`d=5`、 :math:`T=2`繰り返しコードでエンコードされた ``0`` を表します。 このシンドロームは、最初の測定ラウンドの前に(おそらく)ミドルコード量子ビットがエラーによって反転されたことを示しています。 これにより、回路の残りの部分について、隣接する両方のコード量子ビットと矛盾することになります。 これは、最初のラウンドでシンドロームによって表示されます。 しかし、その後のラウンドのブロックは、もはや変化を表していないので、それを報告しません。 他の一連のエラーもまたこのシンドロームを引き起こしている可能性がありますが、それらはより複雑で、おそらくそれほど起こらないでしょう。
ko_kr: **예 1:** ``0 0 0110 0000 0000`` 은 ``0``으로 인코딩된 :math:`T=2` 반복 코드인 :math:`d=5` 를 나타낼 것이다. 이 신드롬은 첫 번째 측정 라운드 이전에 중간 코드 포인트가 오류에 의해 플립되었다는 것을 보여준다. 이로 인해 회로의 나머지 부분에 대해 이웃 코드 조회 모두에 동의하지 않는다. 이는 첫 번째 라운드에서 신드롬에 의해 나타나지만, 이후의 라운드를 위한 블록은 더 이상 변화를 나타내지 않는다고 보고하지 않는다. 다른 세트의 에러들 또한 이러한 신드롬을 야기할 수 있지만, 그것들은 더 복잡하고 아마도 덜 가능성이 있을 것이다.
pt_br: **Exemplo 1:** ``0 0 0110 0000 0000`` representaria um código de repetição com :math:`d=5` e :math:`T=2`, tendo um ``0`` codificado. A síndrome mostra que (muito provavelmente) o qubit de código do meio foi invertido por conta de um erro, antes da primeira rodada de medição. Isto faz com que ele discorde de ambos os qubits de código vizinhos, durante o restante do circuito. Isto é mostrado pela síndrome na primeira rodada, mas os blocos para rodadas subsequentes não o reportam, já que ele não representa mais uma mudança. Outros conjuntos de erros, também poderiam ter causado esta síndrome, mas precisariam ser mais complexos e, por consequência, presumivelmente, menos prováveis.
ru_ru: **Пример 1:** ``0 0 0110 0000 0000`` будет представлять собой код повторения с :math:`d=5`, :math:`T=2` и с закодированным ``0``. Синдром показывает, что (скорее всего) средний кодовый кубит был перевернут ошибкой перед первым раундом измерения. Это приводит к тому, что он расходится с обоими соседними кодовыми кубитами на протяжении всей оставшейся части схемы. Это показано синдромом в первом раунде, но блоки для последующих раундов не сообщают об этом, поскольку это больше не представляет собой изменение. Другие наборы ошибок также могли бы вызвать этот синдром, но они должны быть более сложными и поэтому, предположительно, менее вероятными.
ta_in: **Example 1:** ``0 0 0110 0000 0000`` என்பது ஒரு :math:`d=5`, :math:`T=2` குறியாக்கப்பட்ட ``0`` உடன் மீண்டும் குறியீடு. முதல் அளவீட்டு சுற்றுக்கு முன் நடுத்தர குறியீடு குவிட் ஒரு பிழையால் புரட்டப்பட்டதாக (பெரும்பாலும்)நோய்க்குறி காட்டுகிறது. இது மீதமுள்ள சுற்றுக்கான அண்டை குறியீடு க்விட்களுடன் உடன்படவில்லை. இது முதல் சுற்றில் நோய்க்குறியால் காட்டப்படுகிறது, ஆனால் அடுத்தடுத்த சுற்றுகளுக்கான தொகுதிகள் அதைப் புகாரளிக்காது, ஏனெனில் இது இனி மாற்றத்தைக் குறிக்காது. பிற பிழைகள் இந்த நோய்க்குறியை ஏற்படுத்தியிருக்கலாம், ஆனால் அவை மிகவும் சிக்கலானதாக இருக்க வேண்டும், எனவே அவை குறைவாகவே இருக்கும்.
tr_tr: **Örnek 1:** ``0 0 0110 0000 0000``, bir :math:`d=5` 'i, :math:`T=2` ``0`` kodlu tekrar kodunu temsil eder. Sendrom, (büyük olasılıkla) orta kod kübitinin ilk ölçüm turundan önce bir hatayla ters çevrildiğini gösterir. Bu, devrenin geri kalanı için her iki komşu kod kübitiyle uyuşmamasına neden olur. Bu, ilk turdaki sendromla gösterilir, ancak sonraki turlardaki bloklar, artık bir değişikliği temsil etmediği için bunu bildirmez. Diğer hatalar da bu sendroma neden olmuş olabilir, ancak bunların daha karmaşık ve muhtemelen daha az olası olması gerekir.
zh_tw: **範例 1：``0 0 0110 0000 0000`` 將代表一個 :math:`d=5`， :math:`T=2` 的重複碼，編碼為 ``0``。 這種症候群顯示（很可能）在第一次測量回合之前，中間程式碼量子位元被誤差翻轉。 這會導致它不同於在此電路上其他的相鄰程式碼量子位元。 這在第一輪的症候群被顯示，但在後續回合則不會被顯示因為這對後續回合來說已經不再是個變更。 其他的誤差也可能造成這種症候群，但其他的誤差需更加複雜所以理論上不太可能發生。

source: **Example 2:** ``0 0 0010 0010 0000`` would represent a :math:`d=5`, :math:`T=2` repetition code with encoded ``0``. Here one of the syndrome measurements reported a difference between two code qubits in the first round, leading to a ``1``. The next round did not see the same effect, and so resulted in a ``0``. However, since this disagreed with the previous result for the same syndrome measurement, and since we track syndrome changes, this change results in another ``1``. Subsequent rounds also do not detect anything, but this no longer represents a change and hence results in a ``0`` in the same position. Most likely the measurement result leading to the first ``1`` was an error.
bn_bn: **উদাহরণ 2** ``0 0 0010 0010 0000`` চিত্রিত করবে একটি :math:`d=5`, :math:`T=2` রিপিটেশন বা পুনরাবৃত্তি কোড সংকেতাক্ষরিত বা এনকোড হয়েছে ``0`` দ্বারা।এখানে সিনড্রোম পরিমাপ গুলির মধ্যে একটি বিবৃত করেছে একটি পার্থক্য দুটি কোড কিউবিট গুলির মধ্যে প্রথম রাউন্ডে, এবং একটি ``1`` হচ্ছে। পরের রাউন্ডেটি একই প্রভাব না থাকায় সেটির ফলাফল হলো ``0``। যেহেতু এটি আগের ফলাফলের সাথে সহমত হয়নি একই সিনড্রোম পরিমাপের জন্যে এবং যেহেতু আমরা সিনড্রোম পরিবর্তন কে ট্র্যাক করি বা গমন পথ অনুসরণ করি তাই এই পরিবর্তন আরেকটি ``1`` ফলাফল দেয়। পরবর্তী রাউন্ড গুলিও কোনো কিছু সনাক্ত করেনা কিন্তু এটি আর কোনো পরিবর্তন কে চিত্রিত করেনা তাই ফলাফল একই স্থানে একটি ``0`` দেয়। খুব সম্ভব পরিমাপের ফলাফল যেটি ``1`` হচ্ছিল সেটি একটি ভুল ছিল।
es_un: **Ejemplo 2.**``0 0 0010 0010 0000`` representaría al código de repetición :math:`d=5`, :math:`T=2` con ``0`` codificado. Aquí una de las mediciones de síndrome reporta una diferencia entre dos qubits de código en la primera ronda, lo cual resulta en un ``1``. La siguiente ronda no ve el mismo efecto, y resulta en un ``0``. Sin embargo, ya que esto no coincide con el resultado previo para la misma medición de síndrome, y ya que damos seguimiento a los cambios de síndrome, este cambio resulta en un ``1``. Las siguientes rondas tampoco detectan nada, pero esto ya no representa un cambio, por eso resulta en un ``0`` en la misma posición. Muy probablemente el resultado de la medición que resultó en el primer ``1`` fue un error.
fr_fr: **Exemple 2:** ``0 0 0010 0010 0000`` représenterait un code de répétition :math:`d=5`, :math:`T=2` avec un code de répétition encodé ``0``. Ici, une des mesures du syndrome a rapporté une différence entre deux qubits de code au premier cycle, conduisant à un ``1``. Le cycle suivant n'a pas vu le même effet, et a donc abouti à un ``0``. Cependant, étant donné que cela n'est pas en accord avec le résultat précédent pour la même mesure du syndrome, et que nous suivons les changements du syndrome, ce changement entraîne un autre ``1``. Les cycles suivants ne détectent rien non plus, mais cela ne représente plus un changement et donne donc un ``0`` dans la même position. Le résultat de mesure conduisant au premier ``1`` est probablement une erreur.
id_id: **Contoh 2:** ``0 0 0010 0010 0000`` akan mewakili :math:`d=5`, :math:`T=2` kode repetisi dengan ``0`` yang di enkode. Di sini salah satu sindrom pengukuran melaporkan sebuah perbedaan pada dua qubit kode di putaran pertama, mengarah ke ``1``. Putaran selanjutnya tidak melihat efek yang sama, menghasilkan ``0``. Tetapi, karena ini bertentangan dengan hasil sebelumnya untuk sindrom pengukuran yang sama, dan karena kita mleacak perubahan sindrom, perubahan ini menghasilkan ``1``. Putaran selanjutnya juga tidak mendeteksi apapun, tetapi ini tidak lagi mewakili sebuah perubahan sehingga menghasilkan ``0`` di posisi yang sama. Hasil pengukuran yang mengarah ke ``1`` pertama paling mungkin adalah eror.
ja_jp: **例 2:** ``0 0010 0000`` は :math:`d=5`、エンコードされた ``0`` を含む :math:`T=2`繰り返しコードを表します。 ここで、シンドロームの測定値の1つは、1ラウンド目で2つのコード量子ビット間の差異を報告し、``1``につながりました。 次のラウンドでは同じ効果が得られず、結果として ``0`` になりました。 しかし、これは同じシンドローム測定の前の結果と一致しないため、我々はシンドロームの変化を追跡するので、この変化は別の ``1`` になります。 後続のラウンドでも何も検出されませんが、変更は表示されなくなり、同じ位置に ``0`` になります。 最初の ``1`` に至る測定結果はエラーであった可能性があります。
ko_kr: **예 2:** ``0 0 0010 0010 0000`` 은 ``0`` 으로 인코딩된 :math:`T=2` 반복 코드인 :math:`d=5` 를 나타낼 것이다. 여기서 신드롬 측정치 중 하나는 1 라운드에서 두 코드 큐비트 간의 차이를 보고하고 이는 ``1`` 로 만든다. 다음 라운드는 같은 효과를 보지 못하여 ``0`` 으로 귀결된다. 그러나 이는 동일한 신드롬 측정의 이전 결과와 일치하지 않고, 신드롬 변화를 추적했기 때문에 이러한 변화 또는 ``1`` 로 귀결된다. 후속 라운드도 아무것도 감지하지 못하지만 이는 더 이상 변화를 나타내지 않으며 따라서 동일한 위치에서 결과는 ``0`` 이 된다. 아마도 첫 번째 ``1`` 로 나온 측정 결과는 오류였을 것이다.
pt_br: **Exemplo 2:** ``0 0 0010 0010 0000`` representaria um código de repetição com :math:` d=5 ` e :math:` T=2 `, tendo um ``0`` codificado. Aqui, uma das medições da síndrome relatou uma diferença entre dois qubits de código na primeira rodada, levando a um ``1``. A rodada seguinte não viu o mesmo efeito e, assim, resultou em um ``0``. No entanto, uma vez que isto discorda do resultado anterior para a mesma medição da síndrome e, já que acompanhamos alterações da síndrome, esta alteração resulta em outro ``1``. As rodadas subsequentes também não detectam nada, mas isto não representa mais uma mudança e, portanto, resulta em um ``0`` na mesma posição. Muito, provavelmente, o resultado da medição relacionado ao primeiro ``1`` foi um erro.
ru_ru: **Пример 2:** ``0 0 0010 0010 0000`` будет представлять собой код повторения с :math:`d=5`, :math:`T=2` и с закодированным ``0``. Здесь одно из измерений синдрома сообщило о разнице между двумя кодовыми кубитами в первом раунде, что привело к ``1``. В следующем раунде такого эффекта не наблюдалось, что привело к ``0``. Однако, поскольку это расходится с предыдущим результатом для того же измерения синдрома, и поскольку мы отслеживаем изменения синдрома, это изменение приводит к еще одной ``1``. Последующие раунды также ничего не показывают, но это уже не является изменением и, следовательно, приводит к ``0`` в той же позиции. Скорее всего, результат измерения, приведший к первой ``1``, был ошибкой.
ta_in: **Example 2:** ``0 0 0010 0010 0000`` என்பது ஒரு :math:`d=5`, :math:`T=2`குறியாக்கப்பட்ட ``0`` உடன் மீண்டும் குறியீடு. இங்கே நோய்க்குறி அளவீடுகளில் ஒன்று முதல் சுற்றில் இரண்டு குறியீடு வினாடிகளுக்கு இடையிலான வேறுபாட்டைப் புகாரளித்தது, இது ``1`` க்கு வழிவகுத்தது. அடுத்த சுற்று அதே விளைவைக் காணவில்லை, இதனால் ``0`` கிடைத்தது. இருப்பினும், இதே நோய்க்குறி அளவீட்டுக்கான முந்தைய முடிவுடன் இது உடன்படவில்லை என்பதால், நோய்க்குறி மாற்றங்களை நாங்கள் கண்காணிப்பதால், இந்த மாற்றம் மற்றொரு ``1`` இல் விளைகிறது. அடுத்தடுத்த சுற்றுகளும் எதையும் கண்டறியவில்லை, ஆனால் இது இனி ஒரு மாற்றத்தைக் குறிக்காது, எனவே அதே நிலையில் ``0`` விளைகிறது. முதல் ``1`` க்கு வழிவகுக்கும் அளவீட்டு முடிவு பிழையாக இருக்கலாம்.
tr_tr: **Örnek 2:** ``0 0 0010 0010 0000``, bir :math:`d=5` 'i, :math:`T=2` ``0`` kodlu tekrar kodunu temsil eder. Burada, sendrom ölçümlerinden biri, ilk turdaki iki kod kübiti arasında bir ``1`` 'e yol açan bir fark bildirdi. Bir sonraki tur aynı etkiyi görmedi ve bu nedenle ``0`` ile sonuçlandı. Bununla birlikte, bu aynı sendrom ölçümü için önceki sonuçla uyuşmadığından ve sendrom değişikliklerini izlediğimiz için, bu değişiklik başka bir ``1`` ile sonuçlanır. Sonraki turlar da hiçbir şey tespit etmez, ancak bu artık bir değişikliği temsil etmez ve dolayısıyla aynı konumda bir ``0``' ile sonuçlanır. Büyük ihtimalle ilk ``1`` e götüren ölçüm sonucu bir hataydı.
zh_tw: **範例 2：** ``0 0 0010 0010 0000`` 將代表一個 :math:`d=5`， :math:`T=2` 的重複碼，編碼為 ``0``。 這裡的一種症候群測量報告了在第一回合的兩個程式碼量子位元之間的差異，此差異產生了一個 ``1``。 在下一回合我們沒有看到同樣的效果，因此產生了一個 ``0``。 然而，由於這不符合先前相同的症候群測量所產生的結果，且因為我們追踪的是症候群的變化，這改變了另一個 ``1`` 中的結果。 後續的回合也不會偵測任何東西，但這不再代表變更，因此在相同位置中的結果是 ``0``。 最有可能導致第一個 ``1`` 的測量結果是一個錯誤。
