Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/6_repetition_code.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: This page was generated from `tutorials/noise/6_repetition_code.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/noise/6_repetition_code.ipynb`__ -থেকে বানানো হয়েছে।"
es_un: Esta página ha sido generada a partir de `tutorials/noise/6_repetition_code.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/noise/6_repetition_code.ipynb`__.
id_id: Halaman ini dibuat dari `tutorials/noise/2_relaxation_and_decoherence.ipynb`__.
it_it: Questa pagina è stata generata da `tutorials/noise/6_repetition_code.ipynb`__.
ja_jp: このページは `tutorials/noise/6_repetition_code.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/noise/6_repetition_code.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada, a partir do `tutorials/noise/6_repetition_code.ipynb`__.
ru_ru: Эта страница создана на основе `tutorials/noise/6_repetition_code.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/noise/6_repetition_code.ipynb`__ லிருந்து உருவாக்கப்பட்டது.
tr_tr: Bu sayfa `tutorials/noise/6_repetition_code.ipynb`__ sayfasından oluşturulmuştur.
zh_tw: 此頁面是從 `tutorials/noise/6_repelection_code.ipynb `__ 產生的。

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/6_repetition_code.ipynb>`_.
zh_tw: 在 `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/6_repetition_code.ipynb>`_中互動執行。

source: Repetition Codes
bn_bn: পুনরাবৃত্তি বা রিপিটেশন কোড
es_un: Códigos de Repetición
fr_fr: Codes de répétition
id_id: Kode Repetisi
it_it: Codici di Ripetizione
ja_jp: 反復符号
ko_kr: 반복 코드
pt_br: Códigos De Repetição
ru_ru: Коды повторения
ta_in: மறுபடியும் குறியீடுகள்
tr_tr: Tekrarlama Kodları
zh_tw: 重複代碼

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
id_id: Pengantar
it_it: Introduzione
ja_jp: はじめに
ko_kr: 소개
pt_br: Introdução
ru_ru: Введение
ta_in: முன்னுரை
tr_tr: Giriş
zh_tw: 簡介

source: In quantum error correction we take many noisy qubits (which we call *physical qubits*) and use them to store a smaller number of *logical qubits*. The error correction procedure is designed to detect and correct for the effects of noise. This makes the logical qubits much less noisy and more reliable than the physical ones from which they are built.
bn_bn: কোয়ান্টাম ত্রুটি সংশোধন করতে আমরা অনেক ত্রুটিযুক্ত(noisy) কিউবিট(যাদের আমরা বলি *ভৌত(physical) কিউবিট*) নিয়ে থাকি এবং তাদের ব্যাবহার করি কিছু কম সংখ্যক *লজিক্যাল কিউবিট* সঞ্চয় করতে।ত্রুটি সংশোধন পদ্ধতি পরিকল্পিত হয়েছে ত্রুটির (noise) প্রভাব খুঁজে তাকে সংশোধন করতে। এই ভাবে লজিক্যাল কিউবিটকে অনেক কম ত্রুটিযুক্ত (noisy) এবং অনেক বেশি নির্ভরযোগ্য করা যায় ভৌত বা ফিজিক্যাল কিউবিটের থেকে যেগুলি দিয়ে তাদের তৈরি করা হয়।
es_un: En la técnica de corrección de errores cuántica tomamos varios qubits con ruido (a los cuales llamamos *qubits físicos*) y los usamos para guardar un número más pequeño de *qubits lógicos*. El procedimiento de corrección de errores está diseñado para detectar y corregir los efectos del ruido. Esto hace a los qubits mucho menos ruidosos y mucho más fidedignos que los qubits físicos con los que son construidos.
fr_fr: Dans la correction des erreurs quantiques, nous prenons beaucoup de qubits bruyants (que nous appelons *physical qubits*) et nous les utilisons pour stocker un nombre plus petit de *logical qubits*. La procédure de correction des erreurs est conçue pour détecter et corriger les effets du bruit. Cela rend les qubits logiques beaucoup moins bruyants et plus fiables que les qubits physiques à partir desquels ils sont construits.
id_id: Dalam koreksi eror kuantum kita mengambil banyak qubit yang noisy (yang kita sebut *qubit fisik*) dan menggunakan mereka untuk menyimpan *qubit logis* yang lebih sedikit. Prosedur koreksi eror didesain untuk mendeteksi dan mengoreksi dari efek noise. Ini membuat qubit logis sangat lebih tidak noisy dan lebih terpercaya daripada yang fisik dari mana mereka dibangun.
it_it: Quando si affronta la correzione degli errori quantistici, l'approccio è quello di considerare molti qubit rumorosi (chiamati *qubit fisici*) ed utilizzarli per memorizzare un numero inferiore di *qubit logici*. La procedura di correzione degli errori è progettata in modo da rilevare e correggere gli effetti del rumore. Questo procedimento rende i qubit logici molto meno rumorosi e più affidabili rispetto a quelli fisici che li compongono.
ja_jp: 量子エラー訂正では、ノイズの多い量子ビット( *物理量子ビット* と呼ばれる)を多数取り、それらを使って、より少ない数の *論理量子ビット* を格納します。 エラー訂正手順は、ノイズの影響を検出して修正するように設計されています。 これにより、論理量子ビットは、元の物理量子ビットよりもはるかにノイズが少なく、信頼性が高くなります。
ko_kr: 양자 오류 수정에서 우리는 잡음이 많은 큐비트 (*물리적 큐비트*) 를 취하고 이를 사용하여 보다 적은 수의 *논리적 큐비트* 를 저장한다. 오류 정정 절차는 노이즈의 효과를 검출하고 보정하기 위해 설계된다. 이것은 논리적 큐비트가 그것들이 구축되는 물리적인 것보다 훨씬 덜 요란하고 신뢰성이 높게 만든다.
pt_br: Na correção de erros quânticos pegamos muitos qubits ruidosos (que chamamos de *qubits físicos*) e os utilizamos para armazenar um número menor de *qubits lógicos*. O procedimento de correção de erros é projetado para detectar e corrigir os efeitos do ruído. Isto faz com que os qubits lógicos sejam muito menos ruidosos e mais confiáveis, do que os físicos, dos quais são construídos.
ru_ru: В квантовой коррекции ошибок мы берем множество зашумленных кубитов (которые мы называем *физическими кубитами*) и используем их для хранения меньшего числа *логических кубитов*. Процедура коррекции ошибок предназначена для обнаружения и устранения влияния помех. Это делает логические кубиты гораздо менее шумными и более надежными, чем физические, из которых они построены.
ta_in: குவாண்டம் பிழை திருத்தத்தில் நாம் பல சத்தமில்லாத குவிட்களை எடுத்துக்கொள்கிறோம் (அவற்றை * physical qubits* என்று அழைக்கிறோம்) மற்றும் குறைந்த எண்ணிக்கையிலான *logical qubits* சேமிக்க அவற்றைப் பயன்படுத்துகிறோம். பிழை திருத்தும் செயல்முறை சத்தத்தின் விளைவுகளை கண்டறிந்து சரிசெய்ய வடிவமைக்கப்பட்டுள்ளது. இது தர்க்கரீதியான வினாடிகளை அவை கட்டியெழுப்பிய தீகங்களைக் காட்டிலும் மிகக் குறைவான சத்தமாகவும் நம்பகத்தன்மையுடனும் ஆக்குகிறது.
tr_tr: Kuantum hata düzeltmesinde birçok gürültülü kübiti (buna *fiziksel kübit* diyoruz) alırız ve bunları daha az sayıda *mantıksal kübit* 'e depolamak için kullanırız. Hata düzeltme prosedürü, gürültünün etkilerini tespit etmek ve düzeltmek için tasarlanmıştır. Bu, mantıksal kübitleri inşa edildikleri fiziksel kübitlerden çok daha az gürültülü ve daha güvenilir kılar.
zh_tw: 在量子誤差修正中，我們採用了許多噪聲量子位元（我們稱之為 *實體量子位元* ），並使用它們來儲存較小的 *邏輯量子位元*。 該錯誤修正的程序是為了偵測及抵銷噪音的效應而設計的。 這使得邏輯量子位元比它們所建立的實體量子位元的噪音小得多，並且更可靠。(邏輯量子位元是基於實體量子位元而建造。)

source: The repetition code is a simple example of quantum error correction, in which a logical *bit* is stored rather than a logical *qubit*. A given instance of the repetition code is defined by two numbers, which we call :math:`d` and :math:`T`.
bn_bn: পুনরাবৃত্তি বা রিপিটেশন কোড কোয়ান্টাম ত্রুটি সংশোধনের একটি সরল উদাহরণ যেখানে একটি যৌক্তিক বা লজিক্যাল *কিউবিট* নয় বরং একটি যৌক্তিক বা লজিক্যাল *বিট* সঞ্চয় হয়। একটি পুনরাবৃত্তি বা রিপিটেশন কোডের প্রদত্ত দৃষ্টান্ত (ইনস্ট্যান্স) সংজ্ঞায়িত হয় দুটি সংখ্যার দ্বারা,যাদের আমরা বলি :math: `d` এবং :math:`T`।
es_un: El código de repetición es un ejemplo simple de corrección de errores cuántica, en el cual un *bit* lógico es guardado en lugar de un *qubit* lógico. Una instancia dada de código de repetición está definida por dos números, a los que llamamos :math:`d` y :math:`T`.
fr_fr: Le code de répétition est un exemple simple de correction d'erreur quantique, dans lequel un *bit* logique est stocké plutôt qu'un *qubit* logique. Une instance donnée du code de répétition est définie par deux nombres, que nous appelons :math:`d` et :math:`T`.
id_id: Kode repetisi merupakan contoh sederhana dari kokreksi eror kuantum, di mana sebuah *bit* logis disimpan daripada sebuah *qubit* logis. Contoh kode pengulangan adalah ditentukan dua bilangan, yang kita sebut :math:`d` dan :math:`T`.
it_it: Il codice di ripetizione è un semplice esempio di correzione degli errori quantistici, dove si memorizza un *bit* logico piuttosto che un *qubit* logico. Una certa istanza di un codice di ripetizione è definita da due numeri, detti :math:`d` e :math:`T`.
ja_jp: 反復符号は量子エラー訂正の単純な例であり、論理的な *量子ビット* ではなく、論理的な *ビット* が格納されます。反復符号のインスタンスは、:math:`d` および :math:`T` と呼んでいる2つの数値で定義されています。
ko_kr: 반복 코드는 논리적 *비트* 가 논리적 *큐비트* 가 아니라 저장되는 양자 오류 정정의 간단한 예이다. 반복 코드의 주어진 사례는 두 개의 숫자 :math:`d` 와 :math:`T` 로 정의된다.
pt_br: O código de repetição é um exemplo simples de correção de erro quântico, no qual um *bit* lógico é armazenado em vez de um *qubit* lógico. Uma dada instância do código de repetição é definida por dois números, os quais chamamos de :math:`d` e :math:`T`.
ru_ru: Код повторения – это простой пример квантовой коррекции ошибок, в котором хранится логический *бит*, а не логический *кубит*. Данный экземпляр кода повторения определяется двумя числами, которые мы называем :math:`d` и :math:`T`.
ta_in: மறுபடியும் குறியீடு குவாண்டம் பிழை திருத்தம் செய்வதற்கான எளிய எடுத்துக்காட்டு, இதில் ஒரு தருக்க *bit* ஒரு தருக்க *quibit* ஐ விட சேமிக்கப்படுகிறது. மறுபடியும் குறியீட்டின் கொடுக்கப்பட்ட நிகழ்வு இரண்டு எண்களால் வரையறுக்கப்படுகிறது, இதை நாம் அழைக்கிறோம் :math:`d` மற்றும் :math:`T`.
tr_tr: Tekrarlama kodu, mantıksal bir *kübit* yerine mantıksal *bit* 'in depolandığı kuantum hata düzeltmesinin basit bir örneğidir. Tekrarlama kodunun belirli bir örneği, :math:`d` ve :math:`T` adını verdiğimiz iki sayı ile tanımlanır.
zh_tw: 重複碼是量子誤差修正的一個簡單例子，其中是邏輯 *位元* 被儲存，而不是邏輯 *量子位元*。重複碼的一個實例是由兩個數字定義的，我們稱之為 :math:`d` 和 :math:`T`。

source: The :math:`d` parameter determines how many physical qubits are used. The actual information about the logical bit is stored in :math:`d` qubits (which we’ll call *code qubits*). The encoding is done in a very simple way: to encode a ``0``, all these qubits are set in the state :math:`|0\rangle`, to encode a ``1`` they are set to :math:`|1\rangle`. To readout the value, you can just look at any qubit. To read it out in a way that protects against single qubit errors, you can read out all the qubits and take a majority vote.
bn_bn: :math:`d` পরামিতি নির্ধারণ করে কত গুলি ভৌত বা ফিজিক্যাল কিউবিট ব্যাবহার করা হয়েছে। যৌক্তিক বা লজিক্যাল বিটের ব্যাপারে আসল তথ্য সঞ্চয় থাকে :math:`d` কিউবিট গুলিতে (যাদের আমরা বলব *কোড কিউবিট *). এটি সঙ্কেতাক্ষরে লেখা বা এনকোডিং করা হয় একটি সরল উপায়ে: ``0`` কে সঙ্কেতাক্ষরে লিখতে বা এনকোডিং করতে সমস্ত কিউবিট গুলিকে :math:`|0\rangle` মান বা অবস্থায় রাখা হয়,``1`` কে সঙ্কেতাক্ষরে লিখতে বা এনকোডিং করতে তাদের :math:`|1\rangle` মান বা অবস্থায় রাখা হয়।আপনি যেকোনো কিউবিট দেখে মান বা ভ্যালু জানে বা পড়ে নিতে পারেন। যদি একটি (সিঙ্গেল) কিউবিট ত্রুটি বাঁচিয়ে মান দেখতে বা পড়তে চান তাহলে আপনি সবকটি কিউবিট পড়ে বা দেখে সংখ্যাগরিষ্ঠটি বেছে নিন।
es_un: El parámetro :math:`d` determina cuantos qubits físicos son usados. La información como tal del bit lógico es guardada en :math:`d` qubits (a los cuales llamaremos *qubits de código*). La codificación se hace de manera muy simple: para codificar un ``0``, todos estos qubits son inicializados al estado :math:`|0\rangle`, para codificar un ``1``, son inicializados a :math:`|1\rangle`. Para leer el valor, puedes medir cualquier qubit. Para leerlo de manera que lo proteja contra errores de un solo qubit, puedes medir todos los qubits y tomar el valor de la mayoría.
fr_fr: Le paramètre :math:`d` détermine le nombre de qubits physiques utilisés. Les informations réelles sur le bit logique sont stockées dans les qubits :math:`d` (que nous appellerons *code qubits*). L'encodage se fait de manière très simple : pour encoder un ``0``, tous les qubits sont définis dans l'état :math:`|0\rangle`, pour encoder un ``1``, ils sont définis à :math:`|1\rangle`. Pour lire la valeur, vous pouvez juste regarder n'importe quel qubit. Pour le lire d'une manière qui protège contre les erreurs de qubit-uniques, vous pouvez lire tous les qubits et prendre un vote à la majorité.
id_id: Parameter :math:`d` menentukan seberapa banyak qubit fisik yang dipakai. Informasi sebenarnya tentang bit logis disimpan dalam :math:`d` qubit (yang akan kita panggil sebagai *qubit kode*). Enkode dilakukan dengan cara yang sangat sederhana: untuk mengenkode ``0``, semua qubitnya diset dalam keadaan :math:`|0\rangle`, untuk mengenkode ``1`` semua diset ke :math:`|1\rangle`. Untuk membaca nilainya, Anda dapat melihat pada qubit manapun. Untuk membaca dengan cara yang melindungi terhadp eror qubit tunggal, Anda dapat membaca semua qubit dan mengambil suara mayoritas.
ja_jp: パラメータ :math:`d` は、どれくらいの物理量子ビットが使われるかを決定します。論理ビットに関する実際の情報は、:math:`d` 量子ビット (これを符号量子ビットと呼びます) に格納されます。エンコーディングは非常に簡単な方法で行われます：``0`` をエンコードするには、これらすべての量子ビットを状態 :math:`|0\rangle` に設定し、``1`` をエンコードするには、それらを :math:`|1\rangle` に設定します。値を読み取るには、任意の量子ビットを見るだけです。単一量子ビットエラーから保護する方法でそれを読み取るには、すべての量子ビットを読み取って多数決を取ることができます。
ko_kr: :math:`d` 매개변수는 사용되는 물리적인 비트 수를 결정한다. 논리 비트에 대한 실제 정보는 :math:`d` 큐비트들 (우리가 호출하는 *code qubits*) 에 저장된다. 이러한 인코딩은 매우 단순한 방식으로 행해진다: ``0`` 을 인코딩하기 위해 이 모든 큐비트들은 상태 :math:`|0\rangle` 에 설정되어 있으며 ``1`` 을 인코딩하기 위해 :math:`|1\rangle` 로 설정된다. 값을 판독하기 위해서는 약간의 값만 보면 된다. 단일 큐비트 오류로부터 보호하는 방법으로 읽기 위해 모든 큐비트를 읽고 다수의 투표를 수행할 수 있다.
ru_ru: Параметр :math:`d` определяет, сколько физических кубитов используется. Фактическая информация о логическом бите хранится в :math:`d` кубитах (которые мы будем называть *кодовыми кубитами*). Кодирование осуществляется очень просто: для кодирования ``0`` все эти кубиты устанавливаются в состояние :math:`|0\rangle``, для кодирования ``1`` они устанавливаются в состояние :math:`|1\rangle``. Чтобы считать значение, вы можете просто посмотреть на любой кубит. Чтобы считать его так, чтобы защитить от ошибок одного кубита, вы можете считать все кубиты и провести подсчет большинством голосов.
ta_in: :math:`d` அளவுரு எத்தனை உடல் வினாக்கள் பயன்படுத்தப்படுகின்றன என்பதை தீர்மானிக்கிறது. தருக்க பிட் பற்றிய உண்மையான தகவல்கள் இதில் சேமிக்கப்பட்டுள்ளன: :math:`d` குவிட்ஸ் (இதை நாங்கள் *code qubits* என்று அழைக்கிறோம்). குறியாக்கம் மிகவும் எளிமையான முறையில் செய்யப்படுகிறது: ``0`` ஐ குறியாக்க, இந்த வினாடிகள் அனைத்தும் மாநிலத்தில் அமைக்கப்பட்டுள்ளன :math:`| 0 \rangle`, அவை அமைக்கப்பட்ட ``1`` ஐ குறியாக்க :math:`| 1 \rangle`. மதிப்பைப் படிக்க, நீங்கள் எந்த குவிட்டையும் பார்க்கலாம். ஒற்றை குவிட் பிழைகள் இருந்து பாதுகாக்கும் வகையில் இதைப் படிக்க, நீங்கள் அனைத்து வினாடிகளையும் படித்து பெரும்பான்மை வாக்குகளைப் பெறலாம்.
tr_tr: :math:`d parametre fiziksel kübitlerinin nasıl kullanıldıklarını belirtiyor. Logical bitin güncel bilgisi (*kod kübitleri* adlandırdığımız) :math:`d kübitlerinde saklıdır. Kodlama çok basit bir şekilde yapılır: "0"ı kodlamak için, bütün bu kübitlerin :math:`|0\rangle` durumda, "1"i kodlamak için de :math:`|1\rangle` durumlarında kuruluyor. Sonucu okumak için her hangi bir kübite bakmak yeterdir. Tek kübit hatalarına karşı koruma sağlayacak şekilde okumak için tüm kübitleri okuyabilir ve çoğunluk oyu alabilirsin.
zh_tw: 此參數 :math:`d` 決定被使用的實體量子位元數目。 邏輯位元的實際資訊會儲存在 :math:`d` 個量子位元內 （我們將之稱為 *代碼量子位元*）。 其編碼可以很簡單的方式完成：若要編一個 ``0``，我們可以將所有的量子位元設定在此狀態 :math:`|0\rangle`，若要編一個 ``1``，我們可以將所有的量子位元設定在此狀態 :math:`|1\rangle`。 若要重新讀取該數值，您只需查看任何一個量子位元。 如果要以防止量子位元誤差的方式來讀取該數值，您可以讀取所有量子位元並進行多數決。

source: It is not only at readout that we can extract useful information that will help us correct errors. We can also extract information while the logical bit sits idle, or even while it is involved in computation.
bn_bn: ত্রুটি সংশোধনের জন্য সহায়ক তথ্য আমরা যে শুধুমাত্র পড়ে সংগ্রহ করতে পারি তা নয়। আমরা তখনও তথ্য সংগ্রহ করতে পারি যখন লজিক্যাল বা যৌক্তিক বিট কর্মহীন থাকে বা তখনও যখন সেটি গণনারাত থাকে।
es_un: No es solo al momento de la lectura de salida en el que podemos extraer información útil para corregir errores. También podemos extraer información mientras los qubits están inactivos, o incluso mientras están haciendo cálculos.
fr_fr: Ce n'est pas seulement à la lecture que nous pouvons extraire des informations utiles qui nous aideront à corriger les erreurs. Nous pouvons également extraire des informations alors que le bit logique est inactif, ou même lorsqu'il est impliqué dans le calcul.
id_id: Tidak hanya di readout kita dapat mengambil informasi berguna yang dapat membantu kita mengoreksi eror. Kita juga dapat mengekstrak informasi selagi bit logis menganggur, atau bahkan juga saat sedang terlibat dalam komputasi.
it_it: Non è solo in fase di lettura che è possibile estrarre informazioni utili alla correzione degli errori. Si possono infatti estrarre informazioni anche quando i bit logici rimangono inattivi, o addirittura mentre sono coinvolti in calcoli.
ja_jp: エラーの修正に役立つ有用な情報を抽出できるのは、読み出し時だけではありません。 また、論理ビットがアイドル状態のときや、計算に関与しているときでも、情報を抽出できます。
ko_kr: 오류를 수정하는 데 도움이 되는 유용한 정보를 추출할 수 있음을 알 수 있다. 논리 비트가 쓸모 없는 상태로 있는 동안 또는 계산에 관련되어 있는 동안에도 정보를 추출할 수 있다.
pt_br: Não é somente na leitura que podemos extrair informações úteis, que nos ajudarão a corrigir erros. Também podemos extrair informações, enquanto o bit lógico fica ocioso, ou mesmo, enquanto ele está envolvido em uma computação.
ru_ru: Мы можем извлечь полезную информацию, которая поможет нам исправить ошибки, не только при считывании. Мы также можем получить эту информацию, пока логический бит бездействует или даже пока он участвует в вычислениях.
ta_in: பிழைகளை சரிசெய்ய உதவும் பயனுள்ள தகவல்களைப் பிரித்தெடுக்க முடியும் என்பது வாசிப்பில் மட்டுமல்ல. தருக்க பிட் செயலற்ற நிலையில் இருக்கும்போது அல்லது கணக்கீட்டில் ஈடுபடும்போது கூட தகவல்களைப் பிரித்தெடுக்க முடியும்.
tr_tr: Hataları düzeltmemize yardımcı olacak yararlı bilgileri çıkarabilmemiz yalnızca okuma aşamasında değildir. Mantıksal bit boştayken veya hesaplamaya dahil olduğunda bile bilgi çıkarabiliriz.
zh_tw: 我們不僅可以在讀取的時候汲取能幫助我們修正誤差的有用資訊，還能在該邏輯位元閒置時汲取資訊，或甚至是在該邏輯位元正在運算的時候。

source: Since this is an exercise in quantum error correction, we will do this in a way that would also work for logical *qubits*. Specifically, our method of extracting information about errors must not extract any information regarding the stored logical information. In the quantum case, this is required so that we do not disturb superposition states of the stored qubits.
bn_bn: যেহেতু এটি একটি কোয়ান্টাম ত্রুটি সংশোধনের অনুশীলনী তাই আমরা এটা এমন ভাবে করবো যেনো সেটা লজিক্যাল বা যৌক্তিক কিউবিট এর জন্যেও কার্যকরী হয়।বিশেষভাবে, ত্রুটির ক্ষেত্রে আমাদের তথ্য সংগ্রহের পদ্ধতি যেনো সঞ্চিত লজিক্যাল বা যৌক্তিক তথ্য নিষ্কাশন না করে।কোয়ান্টামের ক্ষেত্রে আমাদের ইহা প্রয়োজন যাতে আমরা সঞ্চিত কিউবিটের উপরিপাতনমান বা অবস্থা কে বিরক্ত না করি।
es_un: Como esto es un ejercicio para corrección de errores cuántica, vamos a hacer esto en una manera que también puede funcionar para *qubits* lógicos. Específicamente, nuestro método para extraer información acerca de los errores no debe extraer información acerca de la información lógica almacenada. En el caso de la cuántica, eso es necesario para no alterar los estados de superposición guardados en los qubits.
fr_fr: Comme il s'agit d'un exercice de correction d'erreurs quantiques, nous le ferons d'une manière qui fonctionnerait également pour les *qubits* logiques. Plus précisément, notre méthode d'extraction d'informations sur les erreurs ne doit pas extraire d'informations concernant les informations logiques stockées. Dans le cas de quantique, cela est nécessaire pour que nous ne perturbions pas les états de superposition des qubits stockés.
id_id: Karena ini adalah latihan dalam koreksi error kuantum, Kita akan melakukan ini dengan cara yang juga akan bekerja untuk *qubit* logis. Khususnya, metode kami untuk mengekstrak informasi tentang eror harus tidak mengekstrak informasi lainnya mengenai informasi logis yang tersimpan. Pada kasus kuantum, ini dibutuhkan sehingga kita tidak mengganggu keadaan superposisi dari qubit yang disimpan.
it_it: Dato che si tratta di un esercizio di correzione degli errori quantistici, lo affronteremo in modo che possa anche essere applicato al caso di *qubit* logici. In particolare, il metodo di estrazione dell'informazione sugli errori non deve estrarre alcuna informazione relativa all'informazione logica memorizzata. Nel caso quantistico questo modo di procedere è necessario per non intaccare e disturbare gli stati di sovrapposizione dei qubit memorizzati.
ja_jp: これは量子エラー訂正の練習なので、論理 *量子ビット* でも動作するような方法で行います。具体的には、エラーに関する情報の抽出方法において、保存された論理情報を抽出しないようにします。量子の場合は、格納されている量子ビットの重ね合わせ状態を妨げないようにするする必要があります。
ko_kr: 이것은 양자 오류 정정의 연습이기 때문에 논리적 *큐비트* 를 위해 작동하는 방식으로 이를 수행할 것이다. 특히 오류에 대한 정보를 추출하는 방법은 저장된 논리 정보에 관한 정보를 추출하지 않아야 한다. 양자의 경우에, 저장된 큐비트들의 중첩 상태들을 방해하지 않도록 이것이 요구된다.
pt_br: Uma vez que este é um exercício de correção de erros quânticos, faremos isto de uma maneira que também funcionaria para os *qubits* lógicos. Especificamente, nosso método de extração de informações sobre erros não deve extrair nenhuma informação, a respeito das informações lógicas armazenadas. No caso quântico, isto é necessário, para que não perturbemos estados de superposição dos qubits armazenados.
ru_ru: Поскольку это упражнение по квантовой коррекции ошибок, мы будем делать это таким образом, чтобы это работало и для логических *кубитов*. В частности, наш метод извлечения информации об ошибках не должен получать никакой информации относительно сохраненной логической информации. В квантовом случае это необходимо для того, чтобы не нарушить состояния суперпозиции, в которых находятся кубиты.
ta_in: இது குவாண்டம் பிழை திருத்தம் செய்வதற்கான ஒரு பயிற்சி என்பதால், இதை நாங்கள் தர்க்கரீதியான * qubits * வேலை செய்யும் வகையில் செய்வோம். குறிப்பாக, பிழைகள் பற்றிய தகவல்களைப் பிரித்தெடுக்கும் எங்கள் முறை சேமிக்கப்பட்ட தர்க்கரீதியான தகவல்களைப் பற்றிய எந்த தகவலையும் பிரித்தெடுக்கக்கூடாது. குவாண்டம் வழக்கில், இது தேவைப்படுகிறது, இதனால் சேமிக்கப்பட்ட குவிட்களின் சூப்பர் பொசிஷன் நிலைகளை நாம் தொந்தரவு செய்யக்கூடாது.
tr_tr: Bu kuantum hata düzeltme alıştırması olduğundan, bunu mantıksal *kübitler* için de işe yarayacak şekilde yapacağız. Özellikle, hatalar hakkında bilgi alma yöntemimiz, saklanan mantıksal bilgilerle ilgili herhangi bir bilgi çıkarmamalıdır. Kuantum durumunda, depolanan kübitlerin süperpozisyon durumlarını bozmamak için bu gereklidir.
zh_tw: 由於這是一個量子誤差修正的工作，我們將會以符合邏輯 *量子位元*的方式來做這一工作。 尤其，我們汲取關於誤差的資訊之方法不得汲取關於已經儲存的任何邏輯資訊。 在量子的情況下，這是必需的，因為這樣我們就不會干擾已經儲存的量子位元的疊加狀態。
