Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/6_repetition_code.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: We will extract information over :math:`T` rounds of *syndrome measurements*. For the repetition code, these are based on the fact that all code qubits should be in the same state (all :math:`|0\rangle` or all :math:`|1\rangle`). Any departure from this is therefore a signature of error. Specifically, we imagine our :math:`d` code qubits sitting along a line. We will then perform a measurement on each pair of neighboring code qubits. This will tell us whether they are the same or different, without extracting any information on what their values are.
bn_bn: আমরা তথ্য সংগ্রহ করবো * সিনড্রোম পরিমাপ* গুলির :math:`T` রাউন্ড গুলি থেকে। রিপিটেশন বা পুনরাবৃত্তি কোডের জন্য এগুলি এই যুক্তির উপর নির্ভর করে যে সমস্ত কোড কিউবিট গুলি যেনো একই অবস্থায় উচিত(সমস্ত :math:`|0\rangle` বা সমস্ত :math:`|1\rangle`)। অতএব এর থেকে কোনো প্রস্থান হলো ত্রুটির স্বাক্ষর।বিশেষভাবে আমার কল্পনা করি আমাদের :math:`d` কোড কিউবিট গুলি বসে আছে একটি লাইন বা রেখা বরাবর।আমার তারপর একটি পরিমাপ করবো প্রতিটি জোড়া পার্শ্ববর্তী কোড কিউবিট গুলির জন্যে।এটি আমাদের জানাবে তারা একই বা ভিন্ন,তাদের কি মান সেই ব্যাপারে কোনো তথ্য সংগ্রহ না করে।
es_un: Extraeremos información a lo largo de :math:`T` rondas de *medidas de síndromes*. Para el código de repetición, estas están basadas en el hecho que todos los qubits de código deben de estar en el mismo estado (todos :math:`|0\rangle` o todos :math:`|1\rangle`). Cualquier desvío de esto es una señal de error. Específicamente, nos imaginamos a todos nuestros :math:`d` qubits de código en una fila. En seguida, hacemos la medición en cada par de qubits colindantes. Esto nos va a decir si son iguales o diferentes, sin extraer información alguna acerca de cuales son sus valores.
fr_fr: Nous allons extraire des informations sur les :math:`T` tours de *syndrome measurements* (mesures du syndrome). Pour le code de répétition, elles sont basées sur le fait que toutes les qubits de code doivent être dans le même état (tous :math:`|0\rangle` ou tous :math:`|1\rangle`). Toute dérogation est donc une signature d'erreur. Plus précisément, nous imaginons nos :math:`d` code qubits assis le long d'une ligne. Nous procéderons alors à une mesure sur chaque paire de qubits de code voisins. Cela nous dira si elles sont identiques ou différentes, sans extraire aucune information sur leurs valeurs.
id_id: Kita akan mengekstrak informasi lebih :math:`T` putaran dari *pengukuran sindrom*. Untuk kode repetisi, semuanya berdasarkan faktabahwa semua qubit kode harus berada pada keadaan sama (semua :math:`|0\rangle` atau semua :math:`|0\rangle`). Setiap kepergian dari ini merupakan sebuah tanda eror. Khususnya, kita bayangkan :math:`d` qubit kode kita diam sepanjang barisan. Kita kemudian akan melakukan pengukuran untuk setiap pasangan qubit kode bersebelahan. Ini akan memberitahu kita apakah mereka sama atau berbeda, tanpa mengekstrak informasi apapun tentang apa nilai mereka.
it_it: Andremo ad estrarre informazioni su :math:`T` ripetizioni di *misurazioni della sindrome*. Nel caso del codice di ripetizione, queste si basano sul fatto che tutti i qubit code dovrebbero trovarsi nello stesso stato (tutti :math:`|0\rangle` o tutti :math:`|1\rangle`). Ogni deviazione dal valore aspettato è quindi un segnale della presenza di un errore. In particolare, pensiamo a :math:`d` qubit code disposti lungo una linea. Effettueremo una misura su ogni coppia di qubit code vicini. Questo ci dirà se sono uguali o diversi, senza estrarre alcuna informazione sul loro valore.
ja_jp: :math:`T` ラウンドの *シンドローム測定* に関する情報を抽出します。反復符号の場合、これらはすべての符号量子ビットが同じ状態であるべきという事実に基づいています (すべて :math:`|0\rangle` またはすべて :math:`|1\rangle`)。したがって、ここからの逸脱はエラーのサインです。具体的には、私たちは :math:`d` 符号量子ビットがラインに沿って留まっていることを想像します。次に、隣接する符号量子ビットの各ペアの測定を行います。これにより、これらの値が何であるかという情報を抽出せずに、それらの値が同じか異なるかがわかります。
ko_kr: :math:`T` 회의 *신드롬 측정 (syndrome measurements)* 에 대한 정보가 추출될 것이다. 반복 코드의 경우, 모든 코드 큐비트가 동일한 상태(모두 :math:`|0\rangle` 또는 모두 :math:`|1\rangle`)에 있어야 한다는 사실을 기반으로 한다. 여기서 벗어난다는 것 전부 오차라는 신호이다. 구체적으로, :math:`d` 개의 코드 큐비트들이 한 직선을 따라 놓여 있는 것을 상상할 수 있다. 그러면 인접한 코드 큐비트 쌍에 대한 측정을 수행한다. 이는 각 쌍이 어떤 값을 갖는지에 대한 정보를 추출하지 않고 그들이 같거나 서로 다른지 여부를 알려줄 것이다.
pt_br: Extrairemos informações ao longo de :math:`T` rodadas de *medições da síndrome*. Para o código de repetição, estes baseiam-se no fato de que todos os qubits de código devem estar no mesmo estado (todos :math:`|0\rangle` ou todos :math:`|1\rangle`). Qualquer desvio disto é, portanto, um sinal de erro. Especificamente, imaginamos que nossos :math:`d` qubits de código estão posicionados ao longo de uma linha. Em seguida, realizamos uma medição em cada par de qubits de código vizinhos. Isto nos dirá se eles são iguais ou diferentes, sem extrair nenhuma informação sobre quais são os seus valores.
ru_ru: Мы будем извлекать информацию в процессе :math:`T` раундов *синдромных измерений*. Для кода повторения они основаны на том, что все кубиты кода должны находиться в одном и том же состоянии (все :math:`|0\rangle` или все :math:`|1\rangle`). Любое отклонение от этого является признаком ошибки. В частности, мы представим, что наши кодовые кубиты :math:`d` расположены вдоль линии. Затем мы проведем измерение каждой пары соседних кодовых кубитов. Это даст нам знать, одинаковые они или разные, не извлекая никакой информации о том, каковы их значения.
ta_in: :math:`T` *syndrome measurements*. மறுபடியும் குறியீட்டைப் பொறுத்தவரை, இவை எல்லா குறியீடு வினாக்களும் ஒரே நிலையில் இருக்க வேண்டும் என்ற உண்மையை அடிப்படையாகக் கொண்டவை (அனைத்தும் :math:`| 0 \rangle` அல்லது அனைத்தும் :math:`| 1 \rangle`). இதிலிருந்து எந்தவொரு புறப்பாடும் பிழையின் கையொப்பமாகும். குறிப்பாக, எங்கள் :math:`d` குறியீடு ஒரு வரியுடன் அமர்ந்திருப்பதை நாங்கள் கற்பனை செய்கிறோம். ஒவ்வொரு ஜோடி அண்டை குறியீடு வினாடிகளிலும் ஒரு அளவீடு செய்வோம். அவற்றின் மதிப்புகள் என்ன என்பது பற்றிய எந்த தகவலையும் பிரித்தெடுக்காமல், அவை ஒரே மாதிரியானவை அல்லது வேறுபட்டவை என்பதை இது நமக்குத் தெரிவிக்கும்.
tr_tr: Bilgiyi *sendrom ölçümleri* 'nin :math:`T` turları üzerinden çıkaracağız. Tekrarlama kodu için bunlar, tüm kod kübitlerinin aynı durumda olması gerektiği gerçeğine dayanmaktadır (tümü :math:`|0\rangle` veya tümü :math:`|1\rangle`). Bundan dolayı herhangi bir sapma, bir hata işaretidir. Özellikle, :math:`d` kod kübitlerimizin bir çizgi boyunca oturduğunu hayal ediyoruz. Daha sonra her bir komşu kod kübiti çifti için bir ölçüm yapacağız. Bu bize, değerlerinin ne olduğuna dair herhangi bir bilgi çıkarmadan, aynı mı yoksa farklı mı olduklarını söyleyecektir.
zh_tw: 我們將汲取 :math:`T' 輪 *症候群測量(syndrome measurements)* 的資訊。 對於其重複碼，這些是基於這樣一個所有代碼量子位元都應處於相同狀態（全部都在 :math:`|0\rangle` 或在 :math:`|1\rangle`）的事實。因此，任何與上述的偏離即為錯誤的跡象。想確切地說們，的們 :math:`d` 編碼塊，坐落於這一條直線上。 然後，我們將對每對相鄰碼群進行測量。 這會告訴我們，它們是否相同，而不需要汲取其值的任何資訊。

source: The implementation of these measurements requires :math:`d-1` additional qubits, which we will call *link qubits* for the repetition code. By performing two CNOTs between the pair of code qubits and a corresponding link qubit, the required information (and only the required information) is placed on the link qubit and can then be measured.
bn_bn: এই পরিমাপ গুলি রূপায়ণ করতে :math:`d-1` গুলো অতিরিক্ত কিউবিট দরকার,যাদের আমরা পুনরাবৃত্তি(রিপিটেশন) কোডটির জন্য *সংযোগকারী (লিংক) কিউবিট* বলি। কোড কিউবিট এবং সংশ্লিষ্ট সংযোগকারী (লিংক) কিউবিট জোড়ার মধ্যে দুটো CNOT অপারেশন করে একমাত্র প্রয়োজনীয় তথ্যটি সংযোগকারী (লিংক) কিউবিট এর উপর স্থাপন করে সেটাকে পরিমাপ করা যায়।
es_un: La implementación de estas mediciones requiere :math:`d-1` qubits adicionales, que llamaremos *qubits de enclace* para el código de repetición. Al realizar dos CNOT entre el par de qubits del código y un qubit de enlace correspondiente, la información requerida (y solo la información requerida) se coloca en el qubit de enlace y luego se puede medir.
fr_fr: L'implémentation de ces mesures nécessite :math:`d-1` qubits supplémentaires, que nous appellerons *link qubits* (qubit de lien) pour le code de répétition. En appliquant deux CNOT entre la paire formée par un qubit de code et un qubit de lien correspondant, les informations requises (et seulement les informations requises) sont placées sur le qubit de lien et peuvent ensuite être mesurées.
ja_jp: これらの測定を実装するには、:math:`d-1` の追加量子ビットが必要であり、これを反復符号における *リンク量子ビット* と呼んでいます。符号量子ビットと対応するリンク量子ビットのペアの間で、2つのCNOTを作動させることにより、必要な情報（必要な情報のみ）がリンク量子ビットに配置され、測定することができるようになります。
ko_kr: 이러한 측정의 구현에는 :math:`d-1` 추가 큐비트가 필요하며, 우리는 이를 *link qubits* 이라 부를 것이다. 한 쌍의 코드 큐비트들과 대응하는 링크 큐비트들 사이에 2개의 CNOT들을 수행함으로써, 필요한 정보가 (오로지 필요한 정보만이) 링크 큐비트 상에 배치되고 측정될 수 있다.
ru_ru: Для реализации этих измерений требуется :math:`d-1` дополнительных кубитов, которые мы будем называть *связующими кубитами* (link qubits) для кода повторения. Выполняя два CNOT между парой кодовых кубитов и соответствующим связующим кубитом, необходимая информация (и только необходимая информация) помещается в связующий кубит и затем может быть измерена.
ta_in: இந்த அளவீடுகளை செயல்படுத்துவதற்கு இது தேவைப்படுகிறது :math:`d-1` கூடுதல் குவிட்கள், அவை மீண்டும் குறியீட்டு குறியீட்டிற்கு *link qubits* என்று அழைக்கிறோம். ஜோடி குறியீட்டு குவிட்டுகளுக்கும் அதனுடன் தொடர்புடைய இணைப்பு குவிட்டிற்கும் இடையில் இரண்டு CNOT களைச் செய்வதன் மூலம், தேவையான தகவல்கள் (மற்றும் தேவையான தகவல்கள் மட்டுமே) இணைப்பு குவிட்டில் வைக்கப்பட்டு பின்னர் அளவிடப்படலாம்.
tr_tr: Bu ölçmelerin uygulaması tekrarlama kodu için *bağlama kübitleri* adlandıracağımız :math:`d-1` ek kübitler gerektirir. Kod kübiti çifti ile karşılık gelen bir bağlama kübiti arasında iki CNOT gerçekleştirerek, gerekli bilgi (ve sadece gerekli bilgi) bağlama kübitine yerleştirilir ve daha sonra ölçülebilir.
zh_tw: 這些測量的實作需要 :math:`d-1` 個額外的量子位元，我們將這些額外的量子位元稱作 *連結量子位元 (link qubits)* 。 通過在相鄰編碼量子位元對和相應的結量子位元之間執行兩個 CNOTs ，需要的資訊（且僅需要此資訊）被放置在此結量子位元上，然後可以被測量。

source: Here we provide tools for creating and testing repetition codes. The first thing we need to do is import them.
bn_bn: এখানে আমরা টুল বা সাধনী প্রদান করলাম রিপিটেশন বা পুনরাবৃত্তি কোড তৈরি এবং পরীক্ষা করার জন্য।আমাদের প্রথম কাজ তাদের ইম্পোর্ট বা আনীত করা।
es_un: Aquí proporcionamos herramientas para crear y probar códigos de repetición. La primera cosa que necesitamos hacer es importarlos.
fr_fr: Ici, nous fournissons des outils pour créer et tester les codes de répétition. La première chose à faire est de les importer.
id_id: Di sini kita menyediakan alat untuk membuat dan menguji kode repetisi. Hal pertama yang perlu kita lakukan adalah mengimpor mereka.
it_it: Qui forniamo gli strumenti per creare e testare i codici di ripetizione. La prima cosa da fare è importarli nel codice.
ja_jp: ここでは、反復符号を作成およびテストするためのツールを提供します。はじめに、これらをインポートする必要があります。
ko_kr: 여기서는 반복 코드를 만들고 테스트하기 위한 도구를 제공한다. 우리가 가장 먼저 할 일은 그것들을 불러오는 것이다.
pt_br: Aqui, fornecemos ferramentas para a criação e o teste de códigos de repetição. A primeira coisa que precisamos fazer é importá-las.
ru_ru: Ниже представлены инструменты для создания и тестирования кодов повторения. Первое, что нам нужно сделать, это импортировать их.
ta_in: மறுபடியும் குறியீடுகளை உருவாக்குவதற்கும் சோதனை செய்வதற்கும் இங்கே கருவிகளை வழங்குகிறோம். நாம் செய்ய வேண்டிய முதல் விஷயம் அவற்றை இறக்குமதி செய்வதுதான்.
tr_tr: Burada, tekrarlama kodlarını oluşturmak ve test etmek için araçlar sağlıyoruz. Yapmamız gereken ilk şey onları içe aktarmak.
zh_tw: 在這裡，我們提供工具來建立和測試重複碼。 我們要做的第一件事就是輸入它們。

source: Creating a repetition code
bn_bn: একটি পুনরাবত্তি বা রিপিটেশন কোড তৈরি করা
es_un: Creación de código de repetición
fr_fr: Création d'un code de répétition
id_id: Membuat kode repetisi
it_it: Creazione di un codice di ripetizione
ja_jp: 反復符号を作成する
ko_kr: 반복 코드 만들기
pt_br: Criando um código de repetição
ru_ru: Создание кода повторения
ta_in: மீண்டும் ஒரு குறியீட்டை உருவாக்குதல்
tr_tr: Tekrarlama kodu oluşturma
zh_tw: 建立重複代碼

source: The ``repetition_code`` class creates a code for given values of :math:`d` and :math:`T`.
bn_bn: ``repetition_code`` ক্লাসটি একটি কোড তৈরি করে, :math:`d` এবং :math:`T` এর প্রদত্ত মনের জন্য।
es_un: La clase ``repetition_code`` crea un código para los valores dados de :math:`d` y :math:`T`.
fr_fr: La classe ``repetition_code`` crée un code pour les valeurs données de :math:`d` et :math:`T`.
id_id: Kelas ``repetition_code`` membuat sebuah kode untuk nilai :math:`d` and :math:`T` yang diberikan.
it_it: La classe ``repetition_code`` crea un codice per i valori forniti di :math:`d` e :math:`T`.
ja_jp: ``repetition_code`` クラスは、指定された :math:`d` と :math:`T` の値のコードを作成します。
ko_kr: ``repetition_code`` 클래스는 :math:`d` 와 :math:`T` 의 주어진 값에 대한 코드를 생성한다.
pt_br: A classe ``repetition_code`` cria um código para os valores indicados de :math:`d` e :math:`T`.
ru_ru: Класс ``repetition_code`` создает код для заданных значений :math:`d` и :math:`T`.
ta_in: ``repetition_code`` வகுப்பு கொடுக்கப்பட்ட மதிப்புகளுக்கு ஒரு குறியீட்டை உருவாக்குகிறது :math:`d` மற்றும் :math:`T`.
tr_tr: ``repetition_code`` sınıfı, :math:`d` ve :math:`T` 'nin verilen değerleri için bir kod oluşturur.
zh_tw: 其 ``repetition_code`` 類別建立一個給定值為 :math:`d` 和 :math:`T`的程式代碼。

source: With this we can inspect various properties of the code, such as the names of the qubit registers used for the code and ancilla qubits.
bn_bn: ইহা দ্বারা আমরা কোডটির বিভিন্ন বৈশিষ্ট্য পরীক্ষা করতে পারি, যেমন কোডটির জন্য ব্যাবহৃত কিউবিট রেজিস্টার গুলির নাম এবং অ্যানসিলা কিউবিট গুলি।
es_un: Con esto podemos inspeccionar varias propiedades del código, como nombres de los registros de qubits usados para el código y los qubits ancilla.
fr_fr: Avec cela, nous pouvons inspecter diverses propriétés du code, comme les noms des registres de qubit utilisés pour le code et les qubits de ancilla.
id_id: Dengan ini kita dapat memeriksa berbagai properti dari kode, seperti nama dari qubit register yang digunakan untuk qubit kode dan ancilla.
it_it: Con questo è possibile ricavare diverse proprietà del codice, come i nomi dei registri di qubit utilizzati per il codice ed i qubit ausiliari.
ja_jp: これにより、コードや補助量子ビットに使用される量子ビットレジスタの名前など、コードのさまざまなプロパティを調べることができます。
ko_kr: 이를 통해 코드의 다양한 특성 (예: 코드 및 보조 비트에 사용되는 qubit 레지스터의 이름) 을 검사할 수 있다.
pt_br: Com isto, podemos inspecionar várias propriedades do código, como os nomes dos registradores de qubits utilizados para o código e para os qubits auxiliares.
ru_ru: С его помощью мы можем проверить различные свойства этого кода, например, названия кубитных регистров, используемых для кода и вспомогательных кубитов.
ta_in: இதன் மூலம் குறியீட்டின் பல்வேறு பண்புகளை நாம் ஆராயலாம், அதாவது குறியீட்டிற்கு பயன்படுத்தப்படும் குவிட் பதிவேடுகளின் பெயர்கள் மற்றும் துணை குவிட்கள்.
tr_tr: Bununla, kod ve yardımcı kübitler için kullanılan kübit yazmaçlarının isimleri gibi kodun çeşitli özelliklerini inceleyebiliriz.
zh_tw: 透過此，我們可以檢查程式碼的各種特性，例如用於程式碼和輔助量子位元的量子位元暫存器的名稱。

source: These registers are also attributes of the ``repetition_code`` object.
bn_bn: এই রেজিস্টার গুলি ``repetition_code`` অবজেক্টেরো বৈশিষ্ট্য বা অ্যাট্রিবিউট।
es_un: Estos registros también son atributos del objeto ``repetition_code``.
fr_fr: Ces registres sont aussi des attributs de l'objet ``repetition_code``.
id_id: Register ini juga merupakan atribut dari objek ``repetition_code``.
it_it: Questi registri sono anche attributi dell'oggetto ``repetition_code``.
ja_jp: これらのレジスタは ``repetition_code`` オブジェクトの属性でもあります。
ko_kr: 이 레지스터들은 또한 ``repetition_code`` 객체의 속성이다.
pt_br: Estes registradores são também atributos do objeto ``repetition_code``.
ru_ru: Эти регистры также являются атрибутами объекта ``repetition_code``.
ta_in: இந்த பதிவேடுகள்``repetition_code``` பொருளின் பண்புகளாகும்.
tr_tr: Bu yazmaçlar aynı zamanda ``repetition_code`` nesnesinin özellikleridir.
zh_tw: 這些暫存器也是 ``repetition_code`` 物件的的特性。

source: You can also access the quantum circuits that implement the code. Two of these are produced: one for each of the two possible logical bit values.
bn_bn: আপনি কোয়ান্টাম বর্তনীটি (সার্কিট) অধিগত করতে পারেন যেটি কোডটি রূপায়ণ করে।এদের মধ্যে দুটি সৃষ্ট হয়: একটি করে প্রত্যেক দুটি সম্ভাব্য লজিক্যাল বা যৌক্তিক বিট মনের জন্য।
es_un: También puedes acceder a los circuitos cuánticos que implementan el código. Dos de estos son producidos: uno para cada uno de los valores posibles para los bits lógicos.
fr_fr: Vous pouvez également accéder aux circuits quantiques qui implémentent le code. Deux d'entre eux sont donnés: un pour chacune des deux valeurs possibles de bits logiques.
id_id: Anda juga dapat mengakses sirkuit kuantum yang mengimplementasi kodenya. Dua diantaranya dihasilkan: satu untuk setiap dua nilai bit logis yang mungkin.
it_it: È anche possibile accedere ai circuiti quantistici che implementano il codice. Ne vengono prodotti due: uno per ognuno dei due possibili valori dei bit logici.
ja_jp: コードで実装する量子回路にもアクセスできます。これらのうち2つを生成します:取り得る2つの論理ビット値から、それぞれ1つずつです。
ko_kr: 코드를 구현하는 양자 회로에도 액세스할 수 있다. 이들 중 2개는 가능한 2개의 논리적 비트 값들 각각에 대해 하나씩 생성된다.
pt_br: Você também pode acessar os circuitos quânticos que implementam o código. Dois destes são produzidos: um para cada um dos dois valores de bits lógicos possíveis.
ru_ru: Вы также можете получить доступ к квантовым схемам, реализующим код. Их создается две: по одной для каждого из двух возможных значений логического бита.
ta_in: குறியீட்டை செயல்படுத்தும் குவாண்டம் சுற்றுகளையும் நீங்கள் அணுகலாம். இவற்றில் இரண்டு தயாரிக்கப்படுகின்றன: சாத்தியமான இரண்டு தருக்க பிட் மதிப்புகள் ஒவ்வொன்றிற்கும் ஒன்று.
tr_tr: Kodu uygulayan kuantum devrelerine de erişebilirsiniz. Bunlardan ikisi üretilir: iki olası mantıksal bit değerinin her biri için bir tane.
zh_tw: 你也可以存取執行程式碼的量子電路。 會產生其中兩個：兩個可能的邏輯位元值各一個。

source: Building a custom repetition code
bn_bn: একটি বিশেষায়িত (কাস্টম) রিপিটেশন বা পুনরাবৃত্তি কোড তৈরি করা
es_un: Construyendo un código de repetición personalizado
fr_fr: Génération d'un code de répétition personnalisé
id_id: Membuat kode repetisi sendiri
it_it: Costruzione di un codice di ripetizione personalizzato
ja_jp: カスタム反復符号を構築する
ko_kr: 사용자 정의 반복 코드 빌드하기
pt_br: Gerando um código de repetição personalizado
ru_ru: Создание пользовательского кода повторения
ta_in: தனிப்பயன் மறுபடியும் குறியீட்டை உருவாக்குதல்
tr_tr: Özel bir tekrarlama kodu oluşturma
zh_tw: 建置自訂重複程式碼

source: You can also implement measurement rounds and logical ``X`` gates yourself. For example, let’s set up a code with no syndrome measurement rounds.
bn_bn: আপনি নিজে থেকে পরিমাপ বৃত্তাকার বা রাউন্ড গুলি এবং লজিক্যাল বা যৌক্তিক ``X`` যুক্তিবর্তনী (গেইট) রূপায়ণ করতে পারেন। উদাহার স্বরূপ, একটি কোড সেট আপ করা যাক যাতে কোনো লক্ষণ বা সিনড্রোম পরিমাপ বৃত্তাকার বা রাউন্ড নেয়।
es_un: También puedes implementar rondas de medición y compuertas lógicas ``X`` por ti mismo. Por ejemplo, configuremos un código sin rondas de medidas de síndrome.
fr_fr: Vous pouvez également implémenter des tours de mesure et des portes logiques ``X`` vous-même. Par exemple, mettons en place un code sans cycles de mesure du syndrome.
id_id: Anda juga dapat mengimplementasikan pengukuran gerbang ``X`` putaran dan logis sendiri. Sebagai contoh, mari kita membuat kode dengan tanpa putaran pengukuran sindrom.
ja_jp: また、測定ラウンドや論理 ``X`` ゲートを自分で実装することもできます。例として、シンドローム測定ラウンドなしでコードを設定してみましょう。
ko_kr: 측정 라운드와 논리적 ``X`` 게이트를 직접 구현할 수도 있다. 예를 들어, 증후군 측정 라운드가 없는 코드를 설정하자.
ru_ru: Вы также можете самостоятельно реализовать измерительные раунды и логические вентили ``X``. Например, давайте создадим код без синдромных раундов измерения.
ta_in: அளவீட்டு சுற்றுகள் மற்றும் தர்க்கரீதியான ``X`` வாயில்களையும் நீங்களே செயல்படுத்தலாம். எடுத்துக்காட்டாக, நோய்க்குறி அளவீட்டு சுற்றுகள் இல்லாத குறியீட்டை அமைப்போம்.
tr_tr: Ölçüm turları ve "X" geçitlerini kendin de uygulayabilirsin. Örnek olarak, ölçüm turları sendromu olmayan bir kodu oluşturalım.
zh_tw: 您也可以自行執行測量和邏輯 ``X`` 閘。 例如，讓我們設立一個沒有症候群測量的程式碼。

source: This does nothing but set up two circuits for the two logical encoded states. There are no syndrome measurement rounds, and no final readout.
bn_bn: ইহা কিছুই করেনা কিন্তু দুটি বর্তনী (সার্কিট) সেট আপ করে দুটি লজিক্যাল বা যৌক্তিক সংকেতাক্ষরিত বা এনকোডেড মান বা অবস্থা জন্য। সেখানে কোনো সিনড্রোম বা লক্ষণ পরিমাপ বৃত্তাকার বা রাউন্ড এবং চুড়ান্ত পর্যবেক্ষণ বা রিড‌আউট নেয়।
es_un: Esto no hace nada mas que configurar dos circuitos para los dos estados lógicos codificados. No hay rondas de mediciones de síndromes y no hay lectura final.
fr_fr: Cela ne fait que mettre en place deux circuits pour les deux états codés logiquement. Il n'y a pas de cycle de mesure du syndrome et pas de lecture finale.
id_id: Ini mengatur dua sirkuit untuk kedua keadaan logis yang dienkode. Tidak ada putaran pengukuran sindrom, dan tidak ada readout akhir.
it_it: Questo non fa altro che impostare due circuiti per i due stati logici codificati. Non ci sono cicli di misurazione della sindrome, e nessuna lettura del risultato finale.
ja_jp: これは、2つの論理的にエンコードされた状態に2つの回路を設定するだけです。シンドローム測定ラウンドはなく、最終的な読み出しもありません。
ko_kr: 이 작업은 두 개의 논리 인코딩 상태에 대해 두 개의 회로를 설정하는 작업만 수행한다. 신드롬 수치(syndrome measurement) 도 없고 최종 판독도 없다.
pt_br: Isto não faz nada, além de configurar dois circuitos para os dois estados codificados lógicos. Não há rodadas de medição da síndrome e nenhuma leitura final.
ru_ru: В результате не происходит ничего, кроме создания двух схем для двух логических закодированных состояний. Нет никаких раундов синдромного измерения и нет окончательного считывания.
ta_in: இது இரண்டு தருக்க குறியாக்க நிலைகளுக்கு இரண்டு சுற்றுகளை அமைப்பதைத் தவிர வேறு எதுவும் செய்யாது. நோய்க்குறி அளவீட்டு சுற்றுகள் இல்லை, இறுதி வாசிப்பு இல்லை.
tr_tr: Bu, iki mantıksal kodlanmış durum için iki devre kurmaktan başka bir şey yapmaz. Sendrom ölçüm turları ve son okuma yoktur.
zh_tw: 這只會為兩個邏輯編碼狀態設立兩個電路。 沒有症候群測量，也就沒有最終的讀出。

source: We can add a round using the ``syndrome_measurement()`` method.
bn_bn: আমরা একটি রাউন্ড বা বৃত্তাকার যোগ করতে পারি ``syndrome_measurement()`` পদ্ধতি ব্যাবহার করে।
es_un: Podemos añadir una ronda con el método, ``syndrome_measurement()``.
fr_fr: Nous pouvons ajouter un cycle en utilisant la méthode ``syndrome_measurement()``.
id_id: Kita dapat menambahkan satu putaran dengan menggunakan metode ``syndrome_measurement()``.
it_it: Possiamo aggiungere un ciclo utilizzando il metodo ``syndrome_measurement()``.
ja_jp: ``syndrome_measurement()`` メソッドを使うことでラウンドを追加できます。
ko_kr: 우리는 ``syndrome_measurement ()`` 방법을 사용하여 라운드를 추가할 수 있다.
pt_br: Podemos adicionar uma rodada usando o método ``syndrome_measurement()``.
ru_ru: Мы можем добавить раунд, используя метод ``syndrome_measurement()``.
ta_in: ``syndrome_measurement()`` முறையைப் பயன்படுத்தி ஒரு சுற்று சேர்க்கலாம்.
tr_tr: ``syndrome_measurement()`` metodunu kullanarak bir tur ekleyebiliriz.
zh_tw: 我們可以使用 ``syndrome_measurement()`` 方法來新增一次測量。

source: A logical ``X`` operation can be added using the ``x()`` method.
bn_bn: একটি লজিক্যাল বা যৌক্তিক ``X`` ক্রিয়াকলাপ (অপারেশন) যোগ করা যাবে ``x()`` পদ্ধতি ব্যাবহার করে।
es_un: Una operación lógica ``X`` puede ser añadida con el método ``x()``.
fr_fr: Une opération logique ``X`` peut être ajoutée en utilisant la méthode ``x()``.
id_id: Operasi logis ``X`` dapat ditambahkan dengan menggunakan metode ``x()``.
it_it: Utilizzando il metodo ``x()`` è possibile aggiungere un'operazione logica ``X``.
ja_jp: 論理 ``X`` 操作は ``x()`` メソッドを使用して追加できます。
ko_kr: 논리적인 ``X`` 의 연산은 ``x()`` 방법을 사용하여 추가될 수 있다.
pt_br: Uma operação ``X`` lógica pode ser adicionada utilizando o método ``x()``.
ru_ru: Логическая операция ``X`` может быть добавлена с помощью метода ``x()``.
ta_in: ``x()`` முறையைப் பயன்படுத்தி ஒரு தர்க்கரீதியான ``X`` செயல்பாட்டைச் சேர்க்கலாம்.
tr_tr: ``x()`` metodunu kullanılarak mantıksal bir ``X`` işlemi eklenebilir.
zh_tw: 我們可以使用 ``x()`` 方法來新增一步邏輯 ``X`` 操作 。
