Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/6_repetition_code.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: When we take many samples, we can determine the probability with which the decoder is incorrect. This should decrease exponentially as the code size is increased, since the configurations of noise that fool the decoder become less likely. The probability of a logical error is calculated using the ``logical_prob()`` method. This runs matching by default, but other algorithms can be specified by the ``algorithm`` kwarg.
bn_bn: যখন আমরা অনেক নমুনা নিয়ে থাকি তখন আমরা নির্ধারণ করতে পারি ডিকোডারের ত্রুটিপূর্ণ হওয়ার সম্ভাবনা । যত কোডের আকার বৃদ্ধি পাবে তত এটি হ্রাস পাবে সূচকীয় বা এক্সপোণেন্সিয়াল হারে, যেহেতু দূষণ বা ত্রুটির যান্ত্রিক বিন্যাস (কনফিগারেশন) যেটি ডিকোডারকে বোকা বানায় সেটির সম্ভবনা কমে যায়।একটি লজিক্যাল বা যৌক্তিক ত্রুটির সম্ভবনা গননা করা হয় ``logical_prob()`` পদ্ধতির মাধ্যমে।এটি ম্যাচিং চালায় বা মিলিয়ে দেখে গতানুগতিক ভাবে কিন্তু অন্ন অ্যালগরিদম গুলিকে নির্দিষ্ট করা যাবে ``algorithm`` কীওয়ার্ড আর্গুমেন্ট দিয়ে।
es_un: Cuando tomamos varios ejemplos, podemos determinar la probabilidad de que el decodificador esté incorrecto. Esta debería de disminuir exponencialmente mientras que el tamaño del código aumente, ya que las configuraciones de ruido que engañan al decodificador se vuelven menos probables. La probabilidad de un error lógico es calculada usando el método ``logical_prob()``. Esto ejecuta el apareamiento por defecto, pero otros algoritmos pueden ser especificados en el kwarg ``algorithm``.
fr_fr: Lorsque nous prenons plusieurs échantillons, nous pouvons déterminer avec quelle probabilité le décodeur est incorrect. Cela devrait diminuer de façon exponentielle car la taille du code est augmentée, car les configurations de bruit qui trompent le décodeur deviennent moins probables. La probabilité d'une erreur logique est calculée en utilisant la méthode ``logical_prob()``. Cela exécute la correspondance par défaut, mais d'autres algorithmes peuvent être spécifiés par l'``algorithm`` kwarg (argument).
id_id: Saat kita mengambil banyak sampel, kita dapat menentukan probabilitas di mana dekoder salah. Ini akan berkurang secara eksponensial sebanding dengan peningkatan ukuran kode, karena konfigurasi dari noise yang menipu dekoder menjadi kurang mungkin. Probabilitas dari eror logis dihitung dengan menggunakan metode ``logical_prob()``. Ini menjalankan pencocokan secara default, tetapi algoritma lainnya dapat dispesifikasi dengan kwarg ``algorithm``.
ja_jp: 多くのサンプルを採取すると、デコーダが正しくない確率を特定することができます。 これは、デコーダをだますノイズの構成が低くなるため、コードサイズが大きくなるにつれて指数関数的に減少するはずです。 論理エラーの確率は、``logical_prob()`` メソッドを使用して計算されます。 これはデフォルトでマッチングされますが、他のアルゴリズムは ``algorithm`` kwarg で指定できます。
ko_kr: 많은 샘플을 채취할 때, 우리는 디코더가 정확하지 않은 확률을 결정할 수 있다. 이는 코드 크기가 증가함에 따라 기하급수적으로 감소해야 하는데, 이는 디코더를 무시하는 잡음의 구성이 더 적게 되기 때문이다. 논리적 오류의 확률은 ``logical_prob()`` 방법을 사용하여 계산된다. 이는 기본적으로 일치하지만 다른 알고리즘은 알고리즘 ``algorithm`` kwarg에 의해 지정될 수 있다.
pt_br: Quando pegamos muitas amostras, podemos determinar a probabilidade com a qual o decodificador está incorreto. Isto deve diminuir, exponencialmente, à medida que o tamanho do código é aumentado, uma vez que as configurações de ruído que enganam o decodificador tornam-se menos prováveis. A probabilidade de um erro lógico é calculada utilizando o método ``logical_prob()``. Isto executa a correspondência por padrão, mas outros algoritmos podem ser especificados pelo kwarg ``algorithm``.
ru_ru: Когда мы делаем много измерений, мы можем определить вероятность, с которой декодер ошибается. Она должна экспоненциально уменьшаться по мере увеличения размера кода, поскольку конфигурации шума, которые обманывают декодер, становятся менее вероятными. Вероятность логической ошибки вычисляется с помощью метода ``logical_prob()``. По умолчанию используется метод matching, но другие алгоритмы могут быть заданы с помощью именованного аргумента ``algorithm``.
ta_in: நாம் பல மாதிரிகளை எடுக்கும்போது, ​​டிகோடர் தவறாக இருக்கும் நிகழ்தகவை நாம் தீர்மானிக்க முடியும். குறியீட்டு அளவு அதிகரிக்கப்படுவதால் இது அதிவேகமாகக் குறைய வேண்டும், ஏனெனில் டிகோடரை முட்டாளாக்கும் சத்தத்தின் உள்ளமைவுகள் குறைவாகவே இருக்கும். ஒரு தருக்க பிழையின் நிகழ்தகவு ``logical_prob()`` முறையைப் பயன்படுத்தி கணக்கிடப்படுகிறது. இது இயல்பாக பொருந்தக்கூடியதாக இயங்குகிறது, ஆனால் பிற வழிமுறைகளை ``algorithm`` குவார்க் மூலம் குறிப்பிடலாம்.
tr_tr: Çok sayıda örnek aldığımızda, kod çözücünün hatalı olma olasılığını belirleyebiliriz. Bu, kod boyutu arttıkça katlanarak azalmalıdır, çünkü kod çözücüyü kandıran gürültü konfigürasyonları daha az olası hale gelir. Mantıksal bir hata olasılığı, ``logical_prob()`` metodu kullanılarak hesaplanır. Bu, varsayılan olarak eşleşmeyi çalıştırır, ancak diğer algoritmalar ``algorithm`` kwarg'ı ile belirtilebilir.
zh_tw: 當我們抽取很多樣本時，我們可以確定解碼器不正確的機率。 這應該會隨著程式碼大小的增加而指數下降，因此愚弄解碼器的雜訊的配置變得不太可能。 邏輯錯誤的機率是使用 ``logical_prob()`` 方法計算的。 此方法預設會執行 matching 演算法，但若要執行其他演算法，則可以通過 ``algorithm`` kwarg指定。

source: The :math:`d` parameter determines how many physical qubits are used. The actual information about the logical bit is stored in :math:`d` qubits (which we'll call *code qubits*). The encoding is done in a very simple way: to encode a ``0``, all these qubits are set in the state :math:`|0\rangle`, to encode a ``1`` they are set to :math:`|1\rangle`. To readout the value, you can just look at any qubit. To read it out in a way that protects against single qubit errors, you can read out all the qubits and take a majority vote.
it_it: Il parametro :math:`d` determina il numero di qubit fisici utilizzati. L'informazione effettiva del bit logico è memorizzata in :math:`d` qubit (che vengono chiamati *qubit code*). La codifica viene effettuata in un modo molto semplice: per codificare uno ``0``, tutti questi qubit sono portati allo stato :math:`|0\rangle`, mentre per codificare ``1``, allo stato :math:`|1\rangle`. Per ottenere il valore di lettura è sufficiente guardare qualsiasi qubit. Per evitare di essere soggetti ad errori di singolo qubit, è possibile leggere il valore di tutti i qubit e scegliere quello finale con un voto di maggioranza, ovvero scegliere il valore che si ripete di più.
pt_br: O parâmetro :math:`d` determina quantos qubits físicos são usados. As informações reais sobre o bit lógico são armazenadas em :math:`d` qubits (que chamaremos de *code qubits*). A codificação é feita de uma forma muito simples: para codificar um ``0``, todos estes qubits são configurados no estado :math:`|0\rangle`, para codificar um ``1`` eles são configurados para :math:`|1\rangle`. Para ler o valor, você pode simplesmente olhar para qualquer qubit. Para lê-lo de uma maneira que o proteja contra erros em um único qubit, você pode ler todos os qubits e escolher o valor que mais aparece.

source: The implementation of these measurements requires :math:`d-1` additional qubits, which we will call *link qubits* for the repetition code. By pefforming two CNOTs between the pair of code qubits and a corresponding link qubit, the required information (and only the required information) is placed on the link qubit and can then be measured.
it_it: L'implementazione di queste misurazioni richiede altri :math:`d-1` qubit aggiuntivi, che nel caso del codice di ripetizione vengono chiamati *qubit link*. Applicando due CNOT tra la coppia di qubit code ed il corrispondente qubit link, l'informazione richiesta (e solo quest'ultima) viene posizionata sul qubit link e può così essere misurata.
pt_br: A implementação destas medições requer :math:`d-1` qubits adicionais, que chamaremos *link qubits* para o código de repetição. Ao executar dois CNOTs entre o par de code qubits e um link qubit correspondente, as informações necessárias (e apenas as informações necessárias) são colocadas no link qubit e podem, então, ser medidas.

source: You can also implement measurement rounds and logical ``X`` gates yourself. For example, let's set up a code with no syndrome measurement rounds.
it_it: Puoi anche tu stesso implementare cicli di misurazione e gate logici ``X``. Per esempio, impostiamo un codice senza cicli di misurazione della sindrome.
pt_br: Você também pode implementar rodadas de medição e portas ``X`` lógicas. Por exemplo, vamos configurar um código sem rodadas de medição da síndrome.

source: The strings are not the direct output from the circuits. They have been processed to take the form that helps us correct errors. Here's a short guided tour.
it_it: Le stringhe non sono gli output diretti dei circuiti. Sono state elaborate per assumere la forma che ci aiuta a correggere gli errori. Ecco una breve spiegazione sulla modalità di lettura.
pt_br: As strings não são a saída direta dos circuitos. Elas foram processados para assumir a forma que nos ajuda a corrigir erros. Aqui está uma curta visita guiada.

source: The ``0 0`` to the far left for the logical ``0`` result, and the ``1 1`` to the far left of the logical ``1``, are the logical readout. Any code qubit could be used for this readout, since they should (without errors) all be equal. So we could have just one result here, for one arbitrarily chosen code qubit. Or we could have :math:`d`, one for each qubit. Instead we have two, from the two qubits at either end of the line. This is because it works best with the decoder (which we'll use later). In the absence of errors, these two values will always be equal.
it_it: Lo ``0 0`` all'estrema sinistra per il risultato logico ``0``, e ``1 1`` all'estrema sinistra per il logico ``1``, sono le letture logiche. Qualsiasi qubit code potrebbe essere utilizzato per questa lettura, dato che (senza la presenza di errori) dovrebbero essere tutti uguali. Quindi potremmo avere solo un risultato, per un qubit code scelto arbitrariamente. O ne potremmo avere :math:`d`, uno per ogni qubit. Invece ne abbiamo due, per i due qubit a fine riga. Questo perché funziona meglio con il decoder (che utilizzeremo più tardi). In assenza di errori, questi due valori sarebbero sempre uguali.
pt_br: Os ``0 0`` mais à esquerda para o resultado ``0`` lógico, e o ``1 1`` mais à esquerda do ``1`` lógico são a leitura lógica. Qualquer qubit de código poderia ser usado para esta leitura, uma vez que eles devem (sem erros) ser todos iguais. Assim, poderíamos ter apenas um resultado, aqui, para um qubit de código arbitrariamente escolhido. Ou poderíamos ter :math:`d`, um para cada qubit. Em vez disto, temos dois dos dois qubits em qualquer extremidade da linha. Isto, porque funciona melhor com o decodificador (que usaremos depois). Na ausência de erros, esses dois valores serão sempre iguais.

source: To see the effects of noise, we need to specify a noise model. For example, let's set up a simple noise model with gate and measurement errors.
it_it: Per vedere gli effetti del rumore, dobbiamo specificare un modello di rumore. Per esempio, mettiamo a punto un semplice modello di rumore con gate ed errori di misurazione.
pt_br: Para ver os efeitos do ruído, precisamos especificar um modelo de ruído. Por exemplo, vamos configurar um modelo de ruído simples com erros de porta e de medição.

source: This can then be run to generate noisy results. Let's make a quick function to do this, and then run it.
it_it: Questo può quindi essere eseguito per generare risultati rumorosi. Creiamo una funzione rapida per farlo, e poi eseguiamola.
pt_br: Isto pode, então, ser executado para gerar resultados ruidosos. Vamos criar uma função rápida para fazer isto e, depois executá-la.

source: Noisy results can change the logical value at readout, and so affect our ability to read out the logical qubit. This can be mitigated by looking at the syndrome values. These can tell us whether or not the logical values are most likely to have changed, and so allow us to correct for the errors. The process of analyzing the syndrome to correct for the errors is called 'decoding'. We do this by building a decoding object for our code.
pt_br: Resultados com ruído podem alterar o valor lógico na leitura e, assim, afetar nossa capacidade de ler o qubit lógico. Isto pode ser mitigado olhando para os valores da síndrome. Estes podem dizer-nos se os valores lógicos são ou não mais propensos a ter mudado e, assim, permitem-nos corrigir os erros. O processo de análise da síndrome para corrigir os erros é chamado de 'decodificação'. Fazemos isto construindo um objeto decodificador para o nosso código.

source: For example, let's use the 'matching' algorithm to decode, which is based on minimum weight perfect matching. This takes specific output strings as input. We'll give it the simple example string ``'1 0 001 100 100'``, for a logical ``1`` that has suffered two errors.
pt_br: Por exemplo, vamos usar o algoritmo de 'matching' (correspondência) para decodificar, que é baseado na correspondência perfeita de peso mínimo. Ele recebe strings de saída específicas como entrada. Daremos para ele a simples string de exemplo ``'1 0 001 100 100'``, para um ``1`` lógico que tenha sofrido dois erros.
