Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/7_accreditation.po
Languages: bn_bn, es_un, fr_fr, ja_jp, ko_kr, pt_br, ru_ru, ta_in, zh_tw

source: This page was generated from `tutorials/noise/7_accreditation.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/noise/7_accreditation.ipynb`__ -থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/noise/7_accreditation.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/noise/7_accreditation.ipynb`__.
ja_jp: このページは `tutorials/noise/7_accreditation.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/noise/7_accreditation.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada a partir do `tutoriais/ruido/7_certificacao.ipynb`__.
ru_ru: Эта страница создана на основе `tutorials/noise/7_accreditation.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/ noise / 7_accreditation.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
zh_tw: 此頁面是從 `tutorials/noise/7_accrelitation.ipynb`__ 產生的。

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/7_accreditation.ipynb>`_.
ta_in: IBM குவாண்டம் ஆய்வகத்தில் ஊடாடும் வகையில் இயக்கவும் <https://quantum-computing.ibm.com/jupyter/tutorial/finance/06_basket_option_pricing.ipynb>_.
zh_tw: 在 `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/7_accreditation.ipynb>`_中互動執行。

source: Accreditation protocol
bn_bn: স্বীকৃতিকরণ নিয়মাবলী (অ্যাক্রেডিটেশন প্রোটোকল)
es_un: Protocolo de acreditación
fr_fr: Protocole d'accréditation
ja_jp: 適格性認定プロトコル
ko_kr: 인증 프로토콜
pt_br: Protocolo de acreditação
ru_ru: Протокол аккредитации
ta_in: அங்கீகாரம் நெறிமுறை
zh_tw: 認證標準流程

source: Accreditation Protocol (AP) is a protocol devised to characterize the reliability of noisy quantum devices.
bn_bn: স্বীকৃতিকরণ নিয়মাবলীর (অ্যাক্রেডিটেশন প্রোটোকল বা এপি) মাধ্যমে ত্রুটিপূর্ণ কোয়ান্টাম যন্ত্রাংশর বিশ্বাসযোগ্যতার চিহ্নিত করা যায়।
es_un: El protocolo de acreditación (Accreditation Protocol, AP) es un protocolo destinado a caracterizar la fiabilidad de los dispositivos cuánticos ruidosos.
fr_fr: Le protocole d'accréditation (AP) est un protocole conçu pour caractériser la fiabilité des machines quantiques bruitées.
ja_jp: 適格性認定プロトコル (AP) は、ノイズの多い量子デバイスの信頼性を特徴付けるために考案されたプロトコルです。
ko_kr: 인증 프로토콜 (Accreditation Protocol, AP) 은 잡음이 있는 양자 장치들의 신뢰성을 특성화하고자 고안된 프로토콜이다.
pt_br: O Protocolo de Acreditação (AP) é um protocolo projetado para caracterizar a confiabilidade de dispositivos quânticos ruidosos.
ta_in: அங்கீகார நெறிமுறை என்பது சத்தமில்லாத குவாண்டம் சாதனங்களின் நம்பகத்தன்மையை வகைப்படுத்த வடிவமைக்கப்பட்ட ஒரு நெறிமுறை.
zh_tw: 認證標準流程 (AP) 是一個用來量測噪聲量子器件可靠性的標準流程。

source: Given a noisy quantum device implementing a “target” quantum circuit, AP certifies an upper-bound on the variation distance between the probability distribution of the outputs returned by the device and the ideal probability distribution. This method is based on Ferracin et al, “Accrediting outputs of noisy intermediate-scale quantum devices”, https://arxiv.org/abs/1811.09709.
bn_bn: একটা ত্রুটিপূর্ণ কোয়ান্টাম যন্ত্রাংশকে যদি একটা "লক্ষ্য" কোয়ান্টাম বর্তনী (সার্কিট) বানাতে দেওয়া হয়, স্বীকৃতিকরণ নিয়মাবলী (অ্যাক্রেডিটেশন প্রোটোকল বা এপি) যন্ত্রাংশের দেওয়া সম্ভাবনা বিতরণ ও আসল সম্ভাবনা বিতরণের প্রকরণ দূরত্বর (ভ্যারিয়েশন ডিসটেন্স) ঊর্ধ্বসীমা নির্দেশ করে দেয়। এই পদ্ধতিটি Ferracin et al, "Accrediting outputs of noisy intermediate-scale quantum devices", https://arxiv.org/abs/1811.09709 -এর উপর ভিত্তি করে বানানো।
es_un: Dado un dispositivo cuántico ruidoso que implementa un circuito cuántico "objetivo", AP certifica un límite superior en la distancia de variación entre la distribución de probabilidad de las salidas devueltas por el dispositivo y la distribución de probabilidad ideal. Este método se basa en Ferracin et al, “Accrediting outputs of noisy intermediate-scale quantum devices”, https://arxiv.org/abs/1811.09709.
fr_fr: Etant donné un ordinateur quantique bruité mettant en œuvre un circuit quantique "cible", AP (Protocole d'Accréditation) certifie une borne supérieure sur l'amplitude de la variation entre la distribution de probabilité des sorties retournées par le dispositif et la distribution de probabilité idéale. Cette méthode est basée sur Ferracin et al, "Accreditting outputs of noisy intermédiaire-scale quantum devices", https://arxiv.org/abs/1811.09709.
ja_jp: 「ターゲット」量子回路を実装するノイズの多い量子デバイスに対して、 AP はデバイスから返される出力の確率分布と理想的な確率分布の間の全変動距離に対する上限を保証します。 この方法は Ferracinらの “Accrediting outputs of noisy intermediate-scale quantum devices”, https://arxiv.org/abs/1811.09709. に基づいています。
ko_kr: “목적” 양자 회로를 구현할 잡음이 있는 양자 장치가 주어지면, AP는 장치가 반환하는 출력의 확률 분포와 이상적인 확률 분포 사이의 거리 분산의 상한을 인증한다. 이 방법은 다음을 기초로 한다: Ferracin 외, “Accrediting outputs of noisy intermediate-scale quantum devices”, https://arxiv.org/abs/1811.09709.
ru_ru: При наличии шумного квантового устройства, реализующего “целевую” квантовую схему, ПА подтверждает верхнее ограничение на расстояние по вариации между распределением вероятности выходов, возвращаемых устройством, и идеальным распределением вероятности. Этот метод основан на работе Ferracin et al. “Accrediting outputs of noisy intermediate-scale quantum devices”, https://arxiv.org/abs/1811.09709.
ta_in: ஒரு “target” ​​குவாண்டம் சுற்றுவட்டத்தை செயல்படுத்தும் சத்தமில்லாத குவாண்டம் சாதனம் கொடுக்கப்பட்டால், சாதனம் வழங்கிய வெளியீடுகளின் நிகழ்தகவு விநியோகம் மற்றும் சிறந்த நிகழ்தகவு விநியோகம் ஆகியவற்றுக்கு இடையேயான மாறுபாடு தூரத்தை AP உறுதிப்படுத்துகிறது. இந்த முறை அடிப்படையாக கொண்டதுFerracin et al, “Accrediting outputs of noisy intermediate-scale quantum devices”, https://arxiv.org/abs/1811.09709.
zh_tw: 給定一個執行一個 "目標" 量子電路的噪音量子器件，AP 認證該器件返回的輸出概率分佈與理想概率分佈之間的變化距離的一個上限。 該方法是基於 Ferracin et al, “Accrediting outputs of noisy intermediate-scale quantum devices”, https://arxiv.org/abs/1811.09709.

source: This notebook gives an example for how to use the ignis.characterization.accreditation module. This particular example shows how to accredit the outputs of a 4-qubit quantum circuit of depth 5. All the circuits are run using the noisy Aer simulator.
bn_bn: এই নোটবুকে কিভাবে ignis.characterization.accreditation মডিউল ব্যবহার করতে হয় তার উদাহরণ দেওয়া আছে। বিশেষ করে এই উদাহরণটি দেখায় কিভাবে ৫ স্তর গভীরতার ৪-কিউবিটের কোয়ান্টাম বর্তনীর (সার্কিট) ফল কিভাবে স্বীকৃত করতে হয়। সব বর্তনীগুলো (সার্কিট) ত্রুটিপূর্ণ এয়ার সিমুলেটর ব্যবহার করে চালানো হয়েছে।
es_un: Este cuaderno da un ejemplo de cómo utilizar el módulo ignis.characterization.accreditation. Este ejemplo en particular muestra cómo acreditar los resultados de un circuito cuántico de 4 qubits con profundidad 5. Todos los circuitos se ejecutan utilizando el simulador con ruido Aer.
fr_fr: Ce bloc-notes donne un exemple d'utilisation du module ignis.characterization.accréditation. Cet exemple particulier montre comment accréditer les sorties d'un circuit quantique 4-qubit de profondeur 5. Tous les circuits sont exécutés à l'aide du simulateur d'Aer en utilisant un modèle de bruit.
ja_jp: このノートブックでは、ignis.characterization.accreditation モジュールの使用方法の例を示します。 この例では、深さ5の4量子ビット量子回路の出力をどのように適格性認証するかを示します。 すべての回路は、ノイズのあるAerシミュレータを使用して実行されます。
ko_kr: 이 노트북은 ignis.characterization.accreditation 모듈을 사용하는 방법에 대한 예제를 제공한다. 이 특정한 예제는 깊이 5의 4-큐비트 양자 회로의 출력들을 인증하는 방법을 보여준다. 모든 회로는 잡음이 있는 Aer 시뮬레이터를 이용하여 실행된다.
pt_br: Este notebook dá um exemplo de como utilizar o módulo ignis.characterization.accreditation. Este exemplo específico mostra como acreditar as saídas de um circuito quântico de 4 qubits com profundidade 5. Todos os circuitos são executados usando o simulador Aer com ruído.
ta_in: இந்த நூல் ignis.characterization.accireditation module ஐ எவ்வாறு பயன்படுத்துவது என்பதற்கு ஒரு எடுத்துக்காட்டு அளிக்கிறது.ஆழம் 5 இன் 4-குவிட் குவாண்டம் சுற்றுகளின் வெளியீடுகளை எவ்வாறு அங்கீகரிப்பது என்பதை இந்த குறிப்பிட்ட எடுத்துக்காட்டு காட்டுகிறது.அனைத்து சுற்றுகளும் சத்தமில்லாத ஏர் சிமுலேட்டரைப் பயன்படுத்தி இயக்கப்படுகின்றன.
zh_tw: 此筆記本提供了如何使用 ignis.characterization.accreditation 模組。 此特定範例顯示如何對深度為 5 的 4 - 量子位元量子電路的輸出進行認證 。 所有電路都是使用噪音 Aer 模擬器執行的。

source: Input to the protocol
bn_bn: নিয়মাবলীর ইনপুট
es_un: Entrada al protocolo
fr_fr: Entrée du protocole
ja_jp: プロトコルの入力
ko_kr: 프로토콜 입력
pt_br: Entrada para o protocolo
ru_ru: Входные данные для протокола
ta_in: நெறிமுறைக்கு உள்ளீடு
zh_tw: 認證標準流程的輸入

source: AP can accredit the outputs of a **target circuit** that 1) Takes as input :math:`n` qubits in the state :math:`|{0}>`\ 2) Ends with single-qubit measurements in the Pauli-\ :math:`Z` basis 3) Is made of :math:`m` “bands”, each band containing a round of single-qubit gates and a round of controlled-\ :math:`Z` gates. The accreditation is made by employing **trap circuits**, circuits that can be efficiently simulated on a classical computer and that whose outputs are used to witness the correct functionality of the device.
bn_bn: স্বীকৃতিকরণ নিয়মাবলী (অ্যাক্রেডিটেশন প্রোটোকল) যেসব **লক্ষ্য বর্তনী** -এর ফলকে স্বীকৃত করতে পারে সেগুলো হলো ১) ইনপুট হিসেবে :math:`|{0}>`\ মান বা অবস্থার :math:`n` -গুলো কিউবিট নেয়। ২) একক কিউবিটপরিমাপ হিসেবে পাউলি-\ :math:`Z`বেসিস বা ভিত্তিতে শেষ হয়। ৩) :math:`m` -গুলো "ব্যান্ড" দিয়ে বানানো, প্রত্যেক ব্যান্ড একবার করে একক কিউবিট যুক্তিবর্তনী (গেট) ও একবার করে নিয়ন্ত্রিত \ :math:`Z` যুক্তিবর্তনী (গেট) দিয়ে বানানো। এই স্বীকৃতিকরণ কিছু **ফাঁদ বর্তনী** লাগিয়ে করা হয়েছে। ফাঁদ বর্তনী এমন বর্তনী যেগুলো সহজেই একটা ধ্রুপদী (ক্ল্যাসিকাল) কম্পিউটারে মহড়া (সিমুলেট) করা যায় এবং যাদের ফলগুলো ব্যবহার করে যন্ত্রাংশের সঠিক কার্যকারিতা লক্ষ্য করা যায়।
es_un: AP puede acreditar las salidas de un **circuito objetivo** que: 1) toma como entrada :math:`n` qubits en el estado :math:`|{0}>`\ 2) Finaliza con mediciones de un solo qubit en la base de Pauli-\ :math:`Z` 3) Está hecho de :math:`m` “bandas”, cada banda que contiene una ronda de compuertas de un solo qubit y una ronda de compuertas controladas \ :math:`Z`. La acreditación se hace utilizando **circuitos trampa**, circuitos que se pueden simular de manera eficiente en una computadora clásica y cuyas salidas se utilizan para presenciar la correcta funcionalidad del dispositivo.
fr_fr: AP peut accréditer les sorties d'un **circuit cible* * qui 1) Admet :math:`n` qubits en entrée dans l'état :math:`|{0}>`\ 2) Se termine avec des mesures à un seul qubit dans la base de Pauli-\ :math:`Z` 3) Est faite de :math:`m` "bandes", chacune contenant une série de portes a un seul qubit et une série de portes controlled-\ :math:`Z`. L'accréditation est faite en utilisant des **trap circuits**, qui peuvent être simulés efficacement sur un ordinateur classique et dont les sorties sont utilisées pour vérifier la fonctionnalité correcte de l'appareil.
ja_jp: AP は次の条件を満たす **ターゲット量子回路** の出力の適格性を認定します。 1) :math:`|{0}>` 状態の :math:`n` 量子ビットを入力としている。 \ 2) Pauli-\ :math:`Z` 基底での1量子ビット測定で終わっている。 3) 1量子ビットゲートのラウンドと制御 :math:`Z` ゲートのラウンドを含む :math:`m` 個の"bands" から成ります。 APは **トラップ回路** を用いることで適格性を認定します。トラップ回路は、古典コンピュータで効率的にシミュレートでき、その出力から装置の機能の正しさを認証できる回路です。
ko_kr: AP는 **목적 회로** 의 출력을 인증할 수 있다. 여기서 목적 회로는 1) 상태 :math:`|{0}>` 에 있는 :math:`n` 개의 큐비트를 입력으로 갖고\ 2) Pauli-\ :math:`Z` 기저에서 단일-큐비트 측정으로 끝나며 3) :math:`m` 개의 “밴드”로 구성되어 있고, 각 밴드는 단일-큐비트 게이트와 제어-\ :math:`Z` 게이트를 포함하고 있다. 인증은 **함정 회로**를 이용하는데, 이 회로는 고전 컴퓨터에서도 효과적으로 시뮬레이션이 가능하고 장치의 기능이 올바른지 증명하는데 사용된다.
ru_ru: ПА может аккредитовать выходы **целевой схемы**, которая: 1) принимает на вход :math:`n` кубитов в состоянии :math:`|{0}>`\; 2) завершается измерениями каждого кубита в базисе Паули-\ :math:`Z`; 3) состоит из :math:`m` “областей”, каждый из которых содержит цикл однокубитных вентилей и ряд условных-\ :math:`Z` вентилей. Сертификация осуществляется с помощью **ловушечных схем** – цепей, которые могут быть эффективно смоделированы на классическом компьютере и выходные данные которых используются для подтверждения правильной работы устройства.
ta_in: ஒரு **இலக்கு சுற்று ** இன் வெளியீடுகளை AP அங்கீகரிக்க முடியும் 1) உள்ளீடாக எடுத்துக்கொள்கிறது:math: `n` மாநிலத்தில் குவிட்ஸ்:math:`|{0}> `\ 2) pauli-\:math: `Z` அடிப்படையில் ஒற்றை-குவிட் அளவீடுகளுடன் முடிவடைகிறது 3) ஆனது:math:` m` “bands”, ஒவ்வொரு இசைக்குழுவிலும் ஒரு சுற்று ஒற்றை-குவிட் வாயில்கள் மற்றும் ஒரு சுற்று கட்டுப்படுத்தப்பட்ட- \:math: `Z` வாயில்கள் உள்ளன. ** பொறி சுற்றுகள் **, ஒரு கிளாசிக்கல் கணினியில் திறமையாக உருவகப்படுத்தக்கூடிய சுற்றுகள் மற்றும் சாதனத்தின் சரியான செயல்பாட்டைக் காண அதன் வெளியீடுகள் பயன்படுத்தப்படுகின்றன என்பதன் மூலம் அங்கீகாரம் செய்யப்படுகிறது.
zh_tw: AP 對滿足以下條件的**目標量子電路 (target circuit)** 的輸出進行認證： 1) 輸入是在 :math:`|{0}>`\ 量子態的 :math:`n` 個量子位元。 2) 最後一步是以 Pauli-\ :math:`Z` 為基底的單一量子位元測量。 3) 它是由 :math:`m` “帶(bands)” 組成，每一個“帶”包含了一回合的單一量子位元閘和一回合的 controlled-\ :math:`Z` 閘。 該認證運用了 **陷阱電路 (trap circuits)**。陷阱電路可有效率地被經典計算機模擬，且其輸出可被用於驗證器件功能的正確性。

source: Let’s now draw a target quantum circuit! We start with a simple circuit to generate and measure 4-qubits GHZ states.
bn_bn: একটা লক্ষ্য কোয়ান্টাম বর্তনী (সার্কিট) বানানো যাক! আমরা একটা সহজ বর্তনী (সার্কিট) বানাবো যেটা ৪- কিউবিটসম্পন্ন জিএইচজেড মান বা অবস্থা পরিমাপ করবে।
es_un: ¡Ahora dibujemos un circuito cuántico objetivo! Empezamos con un circuito simple para generar y medir estados GHZ de 4 qubits.
fr_fr: Voyons maintenant un circuit quantique cible ! Nous commençons par un circuit simple pour générer et mesurer des états GHZ de 4-qubits.
ja_jp: ターゲット量子回路を描画してみましょう。 4 量子ビット GHZ 状態を生成して測定します。
ko_kr: 이제 목적 양자 회로를 그려보자! 4-큐비트 GHZ 상태를 생성하고 측정하는 간단한 회로로 시작한다.
ru_ru: Давайте нарисуем целевую квантовую цепь! Мы начнем с простой цепи для создания и измерения 4-кубитных состояний GHZ.
ta_in: இப்போது ஒரு இலக்கு குவாண்டம் சுற்று வரைவோம்! 4-குவிட்ஸ் GHZ நிலைகளை உருவாக்க மற்றும் அளவிட எளிய சுற்றுடன் தொடங்குகிறோம்.
zh_tw: 現在讓我們繪製一個目標量子電路吧！ 我們從一個簡單的電路開始，生成並測量 4-量子位元 GHZ 態。

source: Generating accreditation circuits
bn_bn: স্বীকৃতিকরণ (অ্যাক্রেডিটেশন) বর্তনী বানানো
es_un: Generación de circuitos de acreditación
fr_fr: Génération de circuits d'accréditation
ja_jp: 認定回路の生成
ko_kr: 인증 회로 생성하기
pt_br: Gerando circuitos de acreditação
ru_ru: Создание схем аккредитации
ta_in: அங்கீகார சுற்றுகளை உருவாக்குதல்
zh_tw: 產生認證電路

source: The function :math:`accreditation\_circuits` generates all the circuits required by AP, target and traps. It automatically appends random Pauli gates to the circuits (if the implementation is noisy, these random Pauli gates reduce the noise to Pauli errors ! )
bn_bn: :math:`accreditation\_circuits` -ফাংশনটি এপি এর প্রয়োজনীয় সব ফাঁদ ও লক্ষ্য বর্তনী বানিয়ে দেয়। এটা নিজে থেকেই এলোমেলো পাউলি যুক্তিবর্তনী (গেইট) আসল বর্তনীতে (সার্কিট) জুড়ে দেয় (যদি রূপায়নটা ত্রুটিপূর্ণ হয় তখন এই পাউলি যুক্তিবর্তনীগুলো (গেইট) ত্রুটিকে পাউলি ভুলে কমিয়ে আনে!)
es_un: La función :math:`accreditation\_circuits` genera todos los circuitos requeridos por AP, objetivo y trampas. Agrega automáticamente compuertas de Pauli aleatorias a los circuitos (si la implementación es ruidosa, ¡estas compuertas de Pauli aleatorias reducen el ruido a errores de Pauli!)
fr_fr: La fonction :math:`accreditation\_circuits` génère tous les circuits nécessaires à l'AP, cible et pièges. Il ajoute automatiquement les portes de Pauli aléatoires aux circuits (si l'implémentation est bruyante, ces portes Pauli aléatoires réduisent le bruit aux erreurs de Pauli !)
ja_jp: 関数 :math:`accreditation\_circuits` は、APとターゲットとトラップに必要なすべての回路を生成します。これはランダムな Pauli ゲートを回路に自動的に追加します (実装にノイズがある場合、これらのランダムな Pauli ゲートはノイズをPauli エラーにします! )
ko_kr: 함수 :math:`accreditation\_circuits` 은 AP가 필요로 하는 목적과 함정 회로들을 생성한다. 이 함수는 회로에 임의의 Pauli 게이트들을 자동으로 추가한다 (구현에 잡음이 있는 경우 이러한 임의의 Pauli 게이트들은 Pauli 오차의 잡음을 줄여준다!).
pt_br: A função :math:`accreditation\_circuits` gera todos os circuitos requeridos pelo AP, alvo e armadilhas. Ele automaticamente anexa portas Pauli aleatórias aos circuitos (se a implementação for ruidosa, essas portas Pauli aleatórias reduzem o ruído a erros de Pauli!)
ru_ru: Функция :math:`accreditation\_circuits` создает все цепи, необходимые для ПА: целевую и для ловушек. Она автоматически добавляет к схемам случайные вентили Паули (если реализация зашумлена, эти случайные операторы Паули уменьшают шум до ошибок Паули!)
ta_in: செயல்பாடு: math: `accreditation\_circuits` AP, இலக்கு மற்றும் பொறிகளுக்குத் தேவையான அனைத்து சுற்றுகளையும் உருவாக்குகிறது. இது தானாகவே சீரற்ற பவுலி வாயில்களை சுற்றுகளுக்குச் சேர்க்கிறது (செயல்படுத்தல் சத்தமாக இருந்தால், இந்த சீரற்ற பவுலி வாயில்கள் சத்தத்தை பவுலி பிழைகளுக்கு குறைக்கின்றன!)
zh_tw: 此函數 :math:`accreditation\_circuits` 會產生 AP、目標和陷阱所需要的所有電路。 它會自動將 隨機 Pauli 閘 (random Pauli gates) 附加到電路中（如果該電路的執行很具有許多噪音，這些隨機 Pauli 閘會將噪音減少到 Pauli 錯誤 (Pauli errors)！）

source: It also returns the list :math:`postp\_list` of strings required to post-process the outputs, as well as the number :math:`v\_zero` indicating the circuit implementing the target.
bn_bn: এটা একটা :math:`postp\_list` নামের তালিকা ফেরত দেয় যা ফলাফলগুলো পরে বিশ্লেষণে কাজে লাগে। এর সাথে :math:`v\_zero` সংখ্যাটি ফেরত দেয় যেটা কোন বর্তনী (সার্কিট) লক্ষ্য বর্তনী (সার্কিট) তা নির্দেশ করে।
es_un: También devuelve la lista :math:`postp\_list` de cadenas requeridas para post-procesar las salidas, así como el número :math:`v\_zero` indicando el circuito que implementa el objetivo.
fr_fr: Il renvoie également la liste :math:` postp\_list ` des chaînes requises pour le post-traitement des sorties, ainsi que le nombre :math:`v\_zero` indiquant le circuit d'exécution de la cible.
ja_jp: ターゲットを実装する回路を示す数 :math:`v\_zero` と同時に、出力を事後処理するのに必要な文字列のリスト :math:`postp\_list` を返します。
ko_kr: 또한 출력을 후처리하는 데 필요한 문자열의 리스트 :math:`postp\_list` 와 묵적을 구현하는 회로를 나타내는 숫자 :math:`v\_zero` 도 반환한다.
pt_br: Ela também retorna a lista :math:`postp\_list` de caracteres necessárias para o pós-processamento das saídas, bem como o número :math:`v\_zero` indicando o circuito implementando o alvo.
ru_ru: Он также возвращает список :math:`postp\_list` строковых переменных, необходимых для постобработки выводов, а также число :math:`v\_zero`, указывающее на целевую цепь.
ta_in: இது பட்டியலையும் தருகிறது:math: வெளியீடுகளை பிந்தைய செயலாக்க தேவையான சரங்களின் `postp\_list`, அத்துடன் எண்:math:` v\_zero` இலக்கை செயல்படுத்தும் சுற்றுவட்டத்தைக் குறிக்கிறது.
zh_tw: 它也會傳回後置處理輸出所需的字串清單 :math:`postp\_list`，以及指出執行該目標的電路號碼 :math:`v\_zero`。

source: This is the target circuit with randomly chosen Pauli gates:
bn_bn: এটা এলোমেলোভাবে বেছে নেওয়া পাউলি যুক্তিবর্তনী (গেট) দিয়ে বানানো লক্ষ্য বর্তনী (সার্কিট):
es_un: Este es el circuito objetivo con compuertas Pauli seleccionadas aleatoriamente:
fr_fr: Ceci est le circuit cible avec les portes Pauli choisies aléatoirement:
ja_jp: これはランダムに選ばれたパウリゲートを持つターゲット回路です。
ko_kr: 이것은 임의로 선택된 Pauli 게이트들을 갖는 목적 회로이다:
pt_br: Este é o circuito alvo com portas Pauli escolhidas aleatoriamente:
ru_ru: Это целевая цепь со случайно выбранными операторами Паули:
ta_in: தோராயமாக தேர்ந்தெடுக்கப்பட்ட பவுலி வாயில்கள் கொண்ட இலக்கு சுற்று இது:
zh_tw: 這是具有隨機選取 Pauli 閘的目標電路：

source: This is how a trap looks like:
bn_bn: ফাঁদ বর্তনী এরকম দেখতে হয়:
es_un: Así es como se ve una trampa:
fr_fr: Voici à quoi ressemble un "trap circuit" :
ja_jp: 以下のようなトラップです。
ko_kr: 함정 (회로) 는 다음과 같다:
pt_br: É assim que uma armadilha se parece:
ru_ru: Так выглядит цепь для ловушки:
ta_in: ஒரு பொறி எப்படி இருக்கும்:
zh_tw: 這就是一個陷阱的樣子：

source: One can use the optional twoqubitgate argument to switch use cx instead of cz gates and can arbitrarily change the coupling map, in order to compile to the desired device topology (which in this case might lead to more layers than expected).
bn_bn: two_qubit_gate আর্গুমেন্ট ব্যবহার করে cz যুক্তিবর্তনীর (গেট) বদলে cx করতে পারে এবং অভিপ্রেত যন্ত্রাংশের স্তরবিন্যাসক্রম (টপোলজি) সংকলনের জন্য ইচ্ছামতো কাপলিং নকশা বদলাতে পারে, এক্ষেত্রে যেটা প্রত্যাশিত স্তরসংখ্যার চেয়ে বেশি স্তর বানাতে পারে।
es_un: Se puede usar el argumento opcional two_qubit_gate para cambiar el uso de cx en lugar de compuertas cz y puede cambiar arbitrariamente el mapeo de acoplamiento, con el fin de compilar a la topología de dispositivo deseada (que en este caso podría llevar a más capas de lo esperado).
fr_fr: On peut utiliser l'argument optionnel twoqubitgate pour choisir entre l'utilisation de portes cx au lieu de portes cz, on peut aussi changer arbitrairement la carte de couplage, afin de compiler conformément à la topologie de l'appareil désiré (ce qui, dans ce cas, peut conduire à augmenter le nombre de couches).
ja_jp: 任意のデバイス・トポロジーにコンパイルするために 、オプションの twoqubitgate 引数を使用して、cz ゲートの代わりに cx を使用するように切り替えてカップリングマップを任意に変更することができます。 (この場合、予想以上にレイヤーが生じる可能性があります)
ko_kr: 선택 인수로 two_qubit_gate 를 사용하여 cz 게이트 대신에 cx 게이트로 전환하거나 장치 토폴로지를 원하는 상태로 컴파일하고자 커플링 맵을 임의로 변경할 수 있다 (이 경우 예상보다 많은 계층으로 이어질 수 있음).
ru_ru: Можно использовать дополнительный аргумент two_qubit_gate, чтобы использовать вентиль cx вместо cz и произвольно изменить карту соединений (кубитов), чтобы скомпилировать в желаемую топологию устройства (что в данном случае может привести к большему количеству слоев, чем ожидалось).
ta_in: Cz வாயில்களுக்குப் பதிலாக cx ஐப் பயன்படுத்த விருப்பமான டூக்யூபிட்கேட் வாதத்தை ஒருவர் பயன்படுத்தலாம் மற்றும் விரும்பிய சாதன இடவியலுடன் தொகுக்க, இணைப்பு வரைபடத்தை தன்னிச்சையாக மாற்றலாம் (இது இந்த விஷயத்தில் எதிர்பார்த்ததை விட அதிகமான அடுக்குகளுக்கு வழிவகுக்கும்).
zh_tw: 我們可以利用二量子位元閘的選項來從 cz 閘切換至 cx 閘，且可以任意變更連結對映，以編譯到所需的器件拓蹼(topology)（在此情況下，可能會導致比預期更多層）。

source: Simulate the ideal circuits
bn_bn: আদর্শ বর্তনীগুলোর (সার্কিট) মহড়া (সিমুলেট) করো।
es_un: Simular los circuitos ideales
fr_fr: Simulation de circuits idéaux
ja_jp: 理想回路をシミュレートする
ko_kr: 이상적인 회로 시뮬레이션하기
pt_br: Simulando os circuitos ideais
ru_ru: Симуляция идеальных цепей
ta_in: சிறந்த சுற்றுகளை உருவகப்படுத்துங்கள்
zh_tw: 模擬此理想電路

source: Let’s implement AP.
bn_bn: এপি বাস্তবায়িত করা যাক।
es_un: Implementemos AP.
fr_fr: Mettons en place l'AP.
ja_jp: AP を実装しましょう。
ko_kr: AP를 구현하자.
ru_ru: Давайте реализуем ПА.
ta_in: AP ஐ செயல்படுத்தலாம்.
zh_tw: 讓我們執行 AP。
