Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/7_accreditation.po
Languages: bn_bn, es_un, fr_fr, ja_jp, ko_kr, pt_br, ru_ru, ta_in, zh_tw

source: We use :math:`accreditation\_circuits` to generate target and trap circuits. Then, we use the function :math:`single\_protocol\_run` to implement all these circuits, keeping the output of the target only if all of the traps return the correct output.
bn_bn: :math:`accreditation\_circuits` -এর মাধ্যমে আমরা লক্ষ্য ও ফাঁদ বর্তনী (সার্কিট) বানাই। এরপর :math:`single\_protocol\_run` ব্যবহার করে এই বর্তনীগুলো (সার্কিট) চালাই। আমরা লক্ষ্য বর্তনীর ফলাফল তখনি রাখি যদি সব ফাঁদ বর্তনী সঠিক ফল দেয়।
es_un: Utilizamos :math:`accreditation\_circuits` para generar circuitos objetivo y trampas. Luego, usamos la función :math:`single\_protocol\_run` para implementar todos estos circuitos, manteniendo la salida del objetivo solo si todas las trampas devuelven la salida correcta.
fr_fr: Nous utilisons :math:` accreditation\_circuits ` pour générer des circuits cible et des circuits de trap. Ensuite, nous utilisons la fonction :math:` single\_protocol\_run ` pour implémenter tous ces circuits, en gardant la sortie de la cible uniquement si tous les trap renvoient la sortie correcte.
ja_jp: ターゲット量子回路とトラップ量子回路を生成するのに :math:`accreditation\_circuits` を使います。次に、これら全ての回路を実装するのに関数 :math:`single\_protocol\_run` を使い、全てのトラップが正しい出力を返す場合にのみターゲットの出力を保持します。
ko_kr: 목적 및 함정 회로를 생성하기 위해 :math:`accreditation\_circuits` 를 사용한다. 그런 다음, 함수 :math:`single\_protocol\_run` 로 모든 회로를 구현하여 모든 함정 회로가 올바른 출력을 반환하는 경우에만 목적 회로의 출력을 유지한다.
pt_br: Usamos :math:`accreditation\_circuits` para gerar circuitos alvo e armadilha. Em seguida, utilizamos a função :math:`single\_protocol\_run` para implementar todos esses circuitos, mantendo a saída do alvo apenas se todas as armadilhas retornarem a saída correta.
ru_ru: Мы используем :math:`accreditation\_circuits` для создания целевых цепей и цепей-ловушек. Затем мы применяем функцию :math:`single\_protocol\_run` для реализации всех этих схем, сохраняя выходные данные целевой цепи только в том случае, если все ловушки возвращают правильное значение на выходе.
ta_in: நாங்கள் பயன்படுத்துகிறோம்:math: இலக்கு மற்றும் பொறி சுற்றுகளை உருவாக்க `accreditation\_circuits`. பின்னர், இந்த சுற்றுகள் அனைத்தையும் செயல்படுத்த:math: `single\_protocol\_run` என்ற செயல்பாட்டைப் பயன்படுத்துகிறோம், அனைத்து பொறிகளும் சரியான வெளியீட்டைத் திருப்பினால் மட்டுமே இலக்கின் வெளியீட்டை வைத்திருக்கும்.
zh_tw: 我們使用 :math:`accreditation\_circuits` 來產生目標和陷阱電路。 然後，我們使用函數 :math:`single\_protocol\_run` 來執行所有這些電路，只有在所有陷阱傳回正確的輸出地的情況下才會保留目標的輸出。

source: In the absence of noise, all traps return the expected output, therefore we always accept the output of the target.
bn_bn: ত্রুটি না থাকলে সব ফাঁদ আশানুরূপ ফলাফল দেয়, সেজন্য সবসময় আমরা লক্ষের ফলাফল গ্রহণ করি।
es_un: En ausencia de ruido, todas las trampas devuelven la salida esperada, por lo tanto siempre aceptamos la salida del objetivo.
fr_fr: En l'absence de bruit, tous les trap renvoient la sortie attendue, donc nous acceptons toujours la sortie de la cible.
ja_jp: ノイズがない場合、すべてのトラップは期待される出力を返すため、ターゲットの出力を常に受け入れます。
ko_kr: 잡음이 없는 경우, 모든 함정 회로는 예상되는 출력을 반환하므로, 항상 목적 회로의 출력을 허용한다.
pt_br: Na ausência de ruído, todas as armadilhas retornam a saída esperada, portanto, sempre aceitamos a saída do alvo.
ru_ru: В отсутствие шума все ловушки возвращают ожидаемый результат, поэтому мы всегда принимаем результат целевой цепи.
ta_in: சத்தம் இல்லாத நிலையில், அனைத்து பொறிகளும் எதிர்பார்த்த வெளியீட்டைத் தருகின்றன, எனவே இலக்கின் வெளியீட்டை நாங்கள் எப்போதும் ஏற்றுக்கொள்கிறோம்.
zh_tw: 在沒有噪音的情況下，所有陷阱會傳回預期的輸出，因此我們一律接受目標的輸出。

source: To obtain an upper-bound on the variation distance on the outputs of the target circuit, we need to implement AP :math:`d` times, each time with **v** different trap circuits.
bn_bn: লক্ষ্য বর্তনীর (সার্কিট) ফলাফলের উপর প্রকরণ দূরত্বর (ভ্যারিয়েশন ডিসটেন্স) একটা ঊর্ধ্বসীমা পেতে হলে :math:`d` -বার এপি বানাতে হবে, প্রত্যেকবার ***v*** -সংখ্যক আলাদা আলাদা ফাঁদ বর্তনী (সার্কিট) ব্যবহার করে।
es_un: Para obtener un límite superior en la distancia de variación en las salidas del circuito objetivo, necesitamos implementar AP :math:` d ` veces, cada vez con ** v** diferentes circuitos de trampa.
fr_fr: Pour obtenir une borne supérieure sur l'amplitude de la variation sur les sorties du circuit cible, nous devons implémenter l'AP :math:`d` fois, chaque fois avec **v** circuits de trap différents.
ja_jp: ターゲット回路の出力の変動距離の上限を求めるためには、 **v** だけ異なるトラップ回路ごとに AP を :math:`d` 回実装する必要があります。
ko_kr: 목적 회로의 출력값의 변동 거리 상에서 상부 경계를 얻고자, **v** 개의 상이한 함정 회로를 이용하여 AP를 구현하는 것을 :math:`d` 회 할 필요가 있다.
ru_ru: Чтобы получить верхнее ограничение на расстояние по вариации на выходах целевой схемы, нам нужно реализовать ПА :math:`d` раз, каждый раз с **v** различными схемами-ловушками.
ta_in: இலக்கு சுற்றுகளின் வெளியீடுகளின் மாறுபாடு தூரத்தின் மேல் வரம்பைப் பெற, நாங்கள் AP :math: `d` முறை, ஒவ்வொரு முறையும் ** v ** வெவ்வேறு பொறி சுற்றுகளுடன் செயல்படுத்த வேண்டும்.
zh_tw: 為了在目標電路的輸出上獲取變化距離的一個上限，我們需要執行 AP :math:`d` 次，每次有 **v** 個不同的陷阱電路。

source: The function :math:`bound\_variation\_distance` calculates the upper-bound on the variation distance (VD) using
bn_bn: :math:`bound\_variation\_distance` -ফাংশনটি প্রকরণ দূরত্বর (ভ্যারিয়েশন ডিসটেন্স বা ভিডি) ঊর্ধ্বসীমা নির্ণয় করে। এর জন্য এর লাগে
es_un: La función :math:`bound\_variation\_distance` calcula el límite superior de la distancia de variación (variation distance, VD) usando
fr_fr: La fonction :math:` bound\_variation\_distance'calcule la limite supérieure de la distance de variation (VD) à l'aide de
ja_jp: 関数 :math:`bound\_variation\_distance` は全変動距離(VD)の上限を計算します。
ko_kr: 함수 :math:`bound\_variation\_distance` 는 변동 거리 (VD)의 상부 경계를 다음을 사용하여 계산한다
pt_br: A função :math:`bound\_variation\_distance` calcula o limite superior da distância de variação (VD) usando
ru_ru: Функция :math:`bound\_variation\_distance` вычисляет верхнюю границу расстояния по вариации (variation distance, VD), используя
ta_in: செயல்பாடு:math: `bound\_variation\_distance` பயன்படுத்தி மாறுபாடு தூரத்தின் (வி.டி) மேல்-வரம்பைக் கணக்கிடுகிறது
zh_tw: 該函數 :math:`bound\_variation\_distance` 會計算變異距離 (VD) 的上限。

source: where :math:`\theta\in[0,1]` is a positive number and
bn_bn: যেখানে :math:`\theta\in[0,1]` একটা ধনাত্মক সংখ্যা এবং
es_un: donde :math:`\theta\in[0,1]` es un número positivo y
fr_fr: où :math:`\theta\in [ 0,1 ]` est un nombre positif et
ja_jp: :math:`\theta\in[0,1]` は正の数で、
ko_kr: 여기서 :math:`\theta\in[0,1]` 은 양수이고
pt_br: onde :math:`\theta\in[0,1]` é um número positivo e
ru_ru: где :math:\theta\in[0,1]` — положительное число и
ta_in: எங்கே:math: [0,1] இல்`\ தீட்டா\ ஒரு நேர்மறையான எண் மற்றும்
zh_tw: 其中 :math:`\theta\in[0,1]` 是一個正數且

source: is the maximum probability of accepting an incorrect state for the target. The function :math:`bound\_variation\_distance` also calculates the confidence in the bound as
bn_bn: এটাই লক্ষ্যের ভুল মান বা অবস্থা গ্রহণ করার সর্বোচ্চ সম্ভাবনা। :math:`bound\_variation\_distance` -ফাংশনটি আবদ্ধ সীমার মধ্যে আস্থা নিম্নলিখিত গাণিতিক সূত্রর মাধ্যমে নির্ণয় করে।
es_un: es la probabilidad máxima de aceptar un estado incorrecto para el objetivo. La función :math:`bound\_variation\_distance` también calcula la confianza en el límite como
fr_fr: est la probabilité maximale d'accepter un état incorrect pour la cible. La fonction :math:` bound\_variation\_distance` calcule également la confiance dans la liaison en tant que
ja_jp: は、ターゲットの間違った状態を受け入れる確率の最大値です。関数 :math:`bound\_variation\_distance` は、バインドされた状態の信頼度も計算します。
ko_kr: 는 대상에 대해 올바르지 않은 상태를 허용할 수 있는 최대 확률이다. 함수 :math:`bound\_variation\_distance` 또한 다음과 같이 바인드된의 신뢰도를 계산한다.
pt_br: é a probabilidade máxima de aceitar um estado incorreto para o alvo. A função :math:`bound\_variation\_distance` também calcula a confiança no limite como
ru_ru: — максимальная вероятность принятия неверного состояния для целевой цепи. Функция :math:`bound\_variation\_distance` также вычисляет достоверность границы в виде
ta_in: இலக்குக்கான தவறான நிலையை ஏற்றுக்கொள்வதற்கான அதிகபட்ச நிகழ்தகவு ஆகும். செயல்பாடு:math: `bound\_variation\_distance` என்பதும் கட்டுப்பட்ட நம்பிக்கையை கணக்கிடுகிறது
zh_tw: 是接受目標不正確狀態的機率上限。 函數 :math:`bound\_variation\_distance`也會計算連結中的信任

source: Defining the noise model
bn_bn: ত্রুটি নকশা সংজ্ঞায়িত করা
es_un: Definición del modelo de ruido
fr_fr: Définition du modèle de bruit
ja_jp: ノイズモデルの定義
ko_kr: 잡음 모델 정의하기
pt_br: Definindo o modelo de ruído
ru_ru: Задаём модель шума
ta_in: இரைச்சல் மாதிரியை வரையறுத்தல்
zh_tw: 定義該噪音模型

source: We define a noise model for the simulator. We add depolarizing error probabilities to the controlled-\ :math:`Z` and single-qubit gates.
bn_bn: আমরা সিমুলেটরের জন্য একটা ত্রুটি নকশা বানাবো। আমরা controlled-\ :math:`Z` ও একক কিউবিট যুক্তিবর্তনীতে (গেট) ডি-পোলারাইজিঙ ভুলের সম্ভাবনা যোগ করব।
es_un: Definimos un modelo de ruido para el simulador. Añadimos probabilidades de error despolarizantes a las compuertas controladas\ :math:`Z` y de un solo qubit.
fr_fr: Nous définissons un modèle de bruit pour le simulateur. Nous ajoutons des probabilités d'erreur de dépolarisation aux portes controlled-\ :math:` Z ` et au portes à un seul qubit.
ja_jp: シミュレータのノイズモデルを定義します。制御 :math:`Z` ゲートと1量子ビットゲートに脱分極エラー確率を追加します。
ko_kr: 시뮬레이터에 대한 잡음 모델을 정의한다. controlled-\ :math:`Z` 및 단일 큐비트 게이트들에 편극 소거 오류 (depolarizing error) 확률을 추가한다.
pt_br: Definimos um modelo de ruído para o simulador. Adicionamos probabilidades de erro de despolarização para as portas \ :math:`Z`-controladas e de um único qubit.
ru_ru: Мы определяем модель шума для симулятора и добавляем деполяризующие вероятности ошибок для условных-\ :math:`Z` и однокубитных вентилей.
ta_in: சிமுலேட்டருக்கான சத்தம் மாதிரியை நாங்கள் வரையறுக்கிறோம். கட்டுப்படுத்தப்பட்ட- \:math: `Z` மற்றும் ஒற்றை-குவிட் வாயில்களில் டிப்போலரைசிங் பிழை நிகழ்தகவுகளை நாங்கள் சேர்க்கிறோம்.
zh_tw: 我們為模擬器定義一個噪音模型。 我們將去極化錯誤機率新增至 controlled-\ :math:`Z` 和單一量子位元閘。

source: We then implement noisy circuits and pass their outputs to :math:`single\_protocol\_run`.
bn_bn: এরপর আমরা ত্রুটিপূর্ণ বর্তনী (সার্কিট) বানাই এবং এদের ফলগুলো :math:`single\_protocol\_run` -এখানে পাস করি।
es_un: A continuación, implementamos circuitos ruidosos y pasamos sus salidas a :math:` single\_protocol\_run `.
fr_fr: Nous mettons ensuite en place des circuits bruités et transmettons leurs résultats à :math:` single\_protocol\_run `.
ja_jp: 次にノイズの多い回路を実装し、出力を :math:`single\_protocol\_run` に渡します。
ko_kr: 그런 다음, 잡음 회로를 구현하고 그들의 출력을 :math:`single\_protocol\_run` 로 전달한다.
pt_br: Em seguida, implementamos circuitos com ruído e passamos suas saídas para :math:`single\_protocol\_run`.
ru_ru: Затем мы реализуем зашумленные цепи и передаем их выходы в :math:`single\_protocol\_run`.
ta_in: நாங்கள் சத்தமில்லாத சுற்றுகளைச் செயல்படுத்துகிறோம், அவற்றின் வெளியீடுகளுக்கு அனுப்புகிறோம்:math:`single\_protocol\_run`.
zh_tw: 我們接著執行具有噪音的電路，並將其輸出傳遞給 :math:`single\_protocol\_run`。

source: Changing the number of trap circuits per protocol run changes the upper-bound on the VD, but not the confidence.
bn_bn: প্রতি নিয়মাবলীতে ফাঁদ বর্তনীর (সার্কিট) সংখ্যা বদলে প্রকরণ দূরত্বর (ভ্যারিয়েশন ডিসটেন্স) ঊর্ধ্বসীমা বদলানো যায় কিন্তু আস্থার বদল হয় না।
es_un: Cambiar el número de circuitos trampa por ejecución de protocolo cambia el límite superior en la VD, pero no la confianza.
fr_fr: Changer le nombre de circuits d'alerte par protocole d'exécution change la limite supérieure de la VD, mais pas la confiance.
ja_jp: プロトコル実行あたりのトラップ回路数を変更すると、VDの上限値は変化しますが、信頼性は変化しません。
ko_kr: 프토토콜 실행당 함정 회로 수를 변경하면 VD의 상부 경계도 변경되지만, 신뢰도는 변경되지 않는다.
pt_br: Mudar o número de circuitos armadilha por execução do protocolo altera o limite superior da VD, mas não a confiança.
ru_ru: Изменение количества цепей-ловушек за один прогон протокола изменяет верхнюю границу для VD, но не достоверность.
ta_in: ஒரு நெறிமுறை ஓட்டத்திற்கு பொறி சுற்றுகளின் எண்ணிக்கையை மாற்றுவது VD இன் மேல் வரம்பை மாற்றுகிறது, ஆனால் நம்பிக்கை இல்லை.
zh_tw: 變更每個標準流程的陷阱電路數目會變更 VD 上的上限，但不會改變信心程度。

source: What number of trap circuits will ensure the minimal upper-bound for your target circuit?
bn_bn: কতগুলো ফাঁদ বর্তনী (সার্কিট), লক্ষ্য বর্তনীর (সার্কিট) ন্যূনতম ঊর্ধ্বসীমা নিশ্চিত করে?
es_un: ¿Qué número de circuitos trampa garantizará el límite superior mínimo para nuestro circuito objetivo?
fr_fr: Quel est le nombre de circuits de trap qui assureront la limite supérieure minimale pour votre circuit cible?
ja_jp: ターゲット回路の上限を最小限に抑えるトラップ回路の数は?
ko_kr: 목적 회로의 최소 상부 경계를 보장하는 함정 회로의 수는 얼마일까?
pt_br: Qual número de circuitos armadilha garantirá o limite superior mínimo para o seu circuito alvo?
ru_ru: Какое количество схем-ловушек обеспечит минимальную верхнюю границу для вашей целевой цепи?
ta_in: உங்கள் இலக்கு சுற்றுக்கான குறைந்தபட்ச வரம்பை எந்த எண்ணிக்கையிலான பொறி சுற்றுகள் உறுதி செய்யும்?
zh_tw: 總共需要多少個陷阱電路才能確保您的目標電路有最小上限值？

source: Given a noisy quantum device implementing a "target" quantum circuit, AP certifies an upper-bound on the variation distance between the probability distribution of the outputs returned by the device and the ideal probability distribution. This method is based on Ferracin et al, "Accrediting outputs of noisy intermediate-scale quantum devices", https://arxiv.org/abs/1811.09709.
pt_br: Dado um dispositivo quântico ruidoso implementando um circuito quântico "alvo", o AP certifica um limite superior na distância de variação entre a distribuição de probabilidade das saídas devolvidas pelo dispositivo e a distribuição de probabilidade ideal. Esse método é baseado em Ferracin et al, "Accrediting outputs of noisy intermediate-scale quantum devices", https://arxiv.org/abs/1811.09709.

source: AP can accredit the outputs of a **target circuit** that 1) Takes as input :math:`n` qubits in the state :math:`|{0}>`\ 2) Ends with single-qubit measurements in the Pauli-\ :math:`Z` basis 3) Is made of :math:`m` "bands", each band containing a round of single-qubit gates and a round of controlled-\ :math:`Z` gates. The accreditation is made by employing **trap circuits**, circuits that can be efficiently simulated on a classical computer and that whose outputs are used to witness the correct functionality of the device.
pt_br: O AP pode acreditar as saídas de um **circuito alvo** que 1) Recebe como entrada :math:`n` qubits no estado :math:`|{0}>`\ 2) Termina com medições de qubit únicos na base Pauli-\ :math:`Z` 3) É feito de :math:`m` "bandas", cada banda contendo uma rodada de portas de um único qubit e uma rodada de portas \ :math:` Z `-controladas. A acreditação é feita empregando-se **circuitos armadilha**, circuitos que podem ser eficientemente simulados em um computador clássico e cujas saídas são usadas para testemunhar a funcionalidade correta do dispositivo.

source: Let's now draw a target quantum circuit! We start with a simple circuit to generate and measure 4-qubits GHZ states.
pt_br: Vamos agora desenhar um circuito quântico alvo! Começamos com um circuito simples para gerar e medir o estado GHZ de 4 qubits.

source: One can use the optional twoqubitgate arguement to switch use cx instead of cz gates and can arbitrarily change the coupling map, in order to compile to the desired device topology (which in this case might lead to more layers than expected).
pt_br: Pode-se utilizar o argumento opcional twoqubitgate para alternar e usar portas cx em vez de portas cz e pode alterar arbitrariamente o mapa de acoplamento, a fim de compilar para a topologia do dispositivo desejado (que neste caso pode levar a mais camadas do que o esperado).

source: Let's implement AP.
pt_br: Vamos implementar o AP.

source: To obtain an upper-bound on the variation distance on the outputs of the target circuit, we need to implement AP :math:`d` times, each time with ***v*** different trap circuits.
pt_br: Para obter um limite superior da distância de variação nas saídas do circuito alvo, precisamos implementar o AP :math:`d` vezes, cada vez com ***v*** diferentes circuitos armadilha.

source: **Accreditation Protocol (AP)** is a protocol devised to characterize the reliability of noisy quantum devices.
ru_ru: Протокол аккредитации (ПА) – это протокол, разработанный для оценки надежности шумных квантовых устройств.

source: This notebook gives an example for how to use the ``ignis.characterization.accreditation`` module. This particular example shows how to accredit the outputs of a 4-qubit quantum circuit of depth 5. All the circuits are run using the noisy Aer simulator.
ru_ru: В этом блокноте приводится пример использования модуля ``ignis.characterization.accreditation``. В данном конкретном примере показано, как сертифицировать выходы 4-кубитной квантовой цепи глубиной 5. Все схемы запускаются с помощью шумного симулятора Aer.
