Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/8_tomography.po
Languages: bn_bn, es_un, fr_fr, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: Here we are going to generate and run the state tomography circuits. Only pass the registers we want to perform state tomography on. The code will generate a new classical register for only those measurements.
bn_bn: এবার আমরা স্টেট টমোগ্রাফি সার্কিট তৈরি করব এবং তা সম্পাদনা করব। এইক্ষত্রে আমরা শুধু সেই রেজিস্টারটি পাঠাবো যার উপর আমরা স্টেট টমোগ্রাফি করতে চাই। শুধুমাত্র এই ধ্রুপদী রেজিস্টার গুলোর দশা পরিমাপ করার জন্য কোড একটি নতুন ধ্রুপদী রেজিস্টার (ক্লাসিকাল রেজিস্টার) প্রস্তত করে দেবে।
es_un: Aquí vamos a generar y ejecutar los circuitos de tomografía de estado. Solo pasar los registros a en los que queremos realizar la tomografía de estado. El código generará un nuevo registro clásico solo para esas mediciones.
fr_fr: Ici, nous allons générer et exécuter les circuits de tomographie d'état. Nous ne transmettons que les registres nécessaires sur la tomographie d'état. Le code générera un nouveau registre classique seulement pour les mesures correspondantes.
ja_jp: 次に、状態トモグラフィー回路を生成して実行します。状態トモグラフィーを実行したいレジスタだけを渡します。 コードは、それらの測定のための新しい古典レジスタを生成します。
ko_kr: 여기서는 상태 단층 촬영 회로를 생성하고 실행할 것이다. 오직 상태 단층 촬영을 행할 레지스터만 전달한다. 코드는 이러한 측정에 대해서만 새 클래식 레지스터를 생성한다.
pt_br: Aqui vamos gerar e executar os circuitos de tomografia de estado. Só passe os registradores nos quais queremos realizar a tomografia de estado. O código gerará um novo registrador clássico apenas para essas medições.
ru_ru: Далее мы будем создавать и запускать схемы томографии состояния. Передаем только те регистры, на которых мы хотим выполнить томографию состояния. Код будет генерировать новый классический регистр только для этих измерений.
ta_in: இங்கே நாம் மாநில டோமோகிராபி சுற்றுகளை உருவாக்கி இயக்கப் போகிறோம். நாங்கள் மாநில டோமோகிராஃபி செய்ய விரும்பும் பதிவேடுகளை மட்டுமே அனுப்பவும். அந்த அளவீடுகளுக்கு மட்டுமே குறியீடு புதிய கிளாசிக்கல் பதிவை உருவாக்கும்.
tr_tr: Burada, durum tomografi devrelerini oluşturup yürüteceğiz. Sadece üzerinde durum tomografisi gerçekleştirmek istediğimiz kayıtları geçin. Kod, sadece bu ölçümler için yeni bir klasik kayıt oluşturacak.
zh_tw: 在這裡，我們將生成並運行狀態斷層掃描電路。 我們只傳遞我們想進行狀態斷層掃描的暫存器。 此代碼只會為那些測量產生新的經典暫存器。

source: Now make a copy of this circuit (we will need it for the fitter) and make a new circuit with an ancilla measurement attached (this is what will be run):
bn_bn: এখন এই সার্কিটের একটি পুনলিপি প্রস্তুত করা হবে (যা ফিটারের জন্য ব্যবহার করা হবে) এবং আরেকটি এন্সিলা পরিমাপ সহ নতুন সার্কিট প্রস্তুত করা হবে (এটিই চালানো হবে):
es_un: Ahora hacemos una copia de este circuito (lo necesitaremos para el ajustador o fitter) y hacemos un nuevo circuito con una ancilla de medición anexada (esto es lo que se ejecutará):
fr_fr: Maintenant, faites une copie de ce circuit (nous en aurons besoin pour l'optimiseur) et faites un nouveau circuit avec un qubit auxiliaire pour la mesure (c'est celui-ci qui sera exécuté):
ja_jp: 次に、この回路のコピーを作成し（フィッターに必要です）、アンシラ測定で新しい回路（これが実行されます）を作成します。
ko_kr: 이제 이 회로의 사본을 작성하고 (fitter 에서 필요하게 된다), 보조 측정이 붙어 있는 새로운 회로를 만든다 (이 회로가 실행될 것이다).
pt_br: Agora faça uma cópia deste circuito (precisaremos dele para o fitter) e faça um novo circuito com uma medição auxiliar acoplada (é isso que será executado):
ru_ru: Теперь сделаем копию этой схемы (она нам понадобится для реконструкции) и создаем новую схему с прикрепленным измерением вспомогательного кубита (это то, что будет запущено):
ta_in: இப்போது இந்த சுற்றுகளின் நகலை உருவாக்கவும் (ஃபிட்டருக்கு இது எங்களுக்குத் தேவைப்படும்) மற்றும் ஒரு துணை அளவீடு இணைக்கப்பட்ட புதிய சுற்று ஒன்றை உருவாக்கவும் (இதுதான் இயக்கப்படும்):
tr_tr: Şimdi, bu devrenin (fitter için ihtiyacımız olacak) bir kopyasını oluşturun ve yardımcı ölçüm ekli yeni bir devre yapın (bu çalıştırılacak olan şeydir):
zh_tw: 現在製作這個電路的副本（我們會需要把此電路給擬合器使用），並製作有輔助測量的新電路（這就是將會被執行的電路）：

source: Before sending the results to the state tomography fitter we must strip the register for the Q2 measurement and only keep the results when that register is 1.
bn_bn: স্টেট টমোগ্রাফী ফিটারে ফলাফল প্রেরণের পুর্বে আমাদের Q2 পরিমাপের রেজিস্টার আলাদা করে রাখতে হবে এবং তখনই তা ফলাফলের সাথে যুক্ত রাখতে হবে যখন রেজিস্টারের মান ১ হবে ।
es_un: Antes de enviar los resultados al ajustador de la tomografía de estado, debemos quitar el registro para la medición de Q2 y sólo mantener los resultados cuando ese registro sea 1.
fr_fr: Avant d'envoyer les résultats au module de tomographie d'état, nous devons supprimer le registre pour la mesure de Q2 et conserver les résultats seulement lorsque ce registre est 1.
ja_jp: 状態トモグラフィーフィッターに結果を送信する前に、Q2測定用にレジスタを取り外し、そのレジスタが1の場合にのみ結果を保持する必要があります。
ko_kr: 결과를 상태 단층 촬영 적합자(fitter) 에 보내기 전에 Q2 측정을 위해 래지스터를 제거해야 하며 레지스터가 1일 때만 결과를 유지해야 한다.
pt_br: Antes de enviar os resultados para o fitter da tomografia de estado devemos retirar do registrador a medição do Q2 e apenas manter os resultados quando aquele registrador for 1.
ru_ru: Перед отправкой результатов на реконструкцию томографии состояния мы должны убрать вспомогательный кубит и сохранять только те результаты, когда он был в состоянии 1.
ta_in: முடிவுகளை மாநில டோமோகிராபி ஃபிட்டருக்கு அனுப்புவதற்கு முன், Q2 அளவீட்டுக்கான பதிவேட்டை அகற்ற வேண்டும், அந்த பதிவு 1 ஆக இருக்கும்போது மட்டுமே முடிவுகளை வைத்திருக்க வேண்டும்.
tr_tr: Sonuçları durum tomografisi fitter'ına göndermeden önce, kaydı Q2 ölçümü için çıkarmalıyız ve sadece kayıt 1 olduğunda sonuçları saklamalıyız.
zh_tw: 在將結果傳送到狀態斷層掃描擬合器之前，我們必須將 Q2 測量的暫存器清理，並且只在該暫存器為 1 時保留結果。

source: Gate set tomography
bn_bn: গেট সেট টমোগ্রাফি
es_un: Tomografía de conjunto de compuertas
fr_fr: Tomographie d'ensemble de portes
ja_jp: ゲートセット・トモグラフィー
ko_kr: 게이트 집합 단층 촬영
pt_br: Tomografia de conjunto de portas
ru_ru: Томография набора квантовых вентилей
ta_in: வாயில் அமைக்கப்பட்ட தூரம்
tr_tr: Kapı kümesi tomografisi
zh_tw: 閘集斷層掃描

source: 1-Qubit gate set tomography Examples
bn_bn: ১-কিউবিট গেট সেট টমোগ্রাফির উদাহরণ
es_un: Ejemplos de tomografía de conjunto de compuertas de 1 qubit
fr_fr: Exemple de tomographie d'état à 1 qubit
ja_jp: １量子ビットのゲートセット・トモグラフィーの例
ko_kr: 1-큐비트 게이트 집합 단층 촬영 예제
pt_br: Exemplo de tomografia de conjunto de portas de 1 qubit
ru_ru: Пример томографии набора однокубитных вентилей
ta_in: 1-குபிட் கேட் செட் டோமோகிராஃபி எடுத்துக்காட்டுகள்
tr_tr: 1 kübitli kapı kümesi tomografisi örnekleri
zh_tw: 1 量子位元閘集斷層掃描範例

source: The main difference between gate set tomography and process tomography is that in gate set tomography, the input consists of a gate set basis: A set of gates that are both used in the initialization/measurement phase of the tomography, and are being reconstructed.
bn_bn: যুক্তিবর্তনী ভিত্তিক টমোগ্রাফি (গেট সেট টমোগ্রাফি) এবং প্রক্রিয়াধীন টমোগ্রাফি (প্রসেস টমোগ্রাফি) এর মধ্যে প্রধান পার্থক্য হচ্ছে যুক্তিবর্তনী ভিত্তিক টমোগ্রাফীতে ইনপুট একগুচ্ছ সার্কিট ভিত্তিক বেসিস হিসেবে থাকে। এই গুচ্ছ সার্কিটগুলোকে (সেট অব গেটস) টমোগ্রাফির প্রারম্ভিকরন (ইনিশিয়ালাইজেশন) / পরিমাপ (মেজারমেন্ট) দশা হিসেবে ব্যবহার এবং সম্পাদন করা যাবে।
es_un: La diferencia principal entre la tomografía de conjunto de compuertas y la tomografía de proceso es que en la primera, la entrada consiste en una base de conjunto de compuertas: conjunto de compuertas que se utilizan en la fase de inicialización/medición de la tomografía y que se están reconstruyendo.
fr_fr: La principale différence entre la tomographie de l'ensemble de portes et la tomographie des processus est que dans la tomographie de l'ensemble des portes, l'entrée se compose d'un ensemble de portes: un ensemble de barrières qui sont tous les deux utilisés dans la phase d'initialisation / mesure de la tomographie, et sont en cours de reconstruction.
ja_jp: ゲート・セット・トモグラフィーとプロセス・トモグラフィーの主な違いは、ゲート・セット・トモグラフィーにおいて、入力はゲート・セット・ベースで構成されており、これらのゲートのセットは、トモグラフィーの初期化 /測定フェーズで使用され、再構成されています。
ko_kr: 게이트 집합 단층 촬영과 프로세스 단층 촬영 간의 주요 차이점은, 게이트 집합 단층 촬영에서 입력부는 게이트 집합 기저로 구성되며, 단층 촬영의 초기화와 위상 측정 모두에서 사용되는 게이트들의 집합이 재구성된다.
pt_br: A principal diferença entre a tomografia de conjunto de portas e a tomografia de processo é que na tomografia de conjunto de portas, a entrada consiste em uma base de conjunto de portas: um conjunto de portas que são usados tanto na fase de inicialização/medição da tomografia, quanto estão sendo reconstruídos.
ru_ru: Основное различие между томографией набора вентилей и томографией процесса заключается в том, что в первом случае входные данные состоят из базового набора вентилей: вентилей, которые не только используются в фазе инициализации/измерения томографии, но и будут реконструированы.
ta_in: கேட் செட் டோமோகிராஃபி மற்றும் செயல்முறை டோமோகிராஃபி ஆகியவற்றுக்கு இடையேயான முக்கிய வேறுபாடு என்னவென்றால், கேட் செட் டோமோகிராஃபியில், உள்ளீடு ஒரு கேட் செட் அடிப்படையைக் கொண்டுள்ளது: டோமோகிராஃபியின் துவக்கம் / அளவீட்டு கட்டத்தில் பயன்படுத்தப்பட்ட வாயில்களின் தொகுப்பு மற்றும் புனரமைக்கப்படுகிறது.
tr_tr: Kapı kümesi tomografisi ve süreç tomografisi arasındaki temel fark, kapı kümesi tomografisinde girdinin kapı kümesi temelinden oluşmasıdır: Tomografinin hem başlangıç hem de ölçüm fazında kullanılan bir kapılar kümesi ve yeniden inşa edilmekte olanlar.
zh_tw: 閘集斷層掃描和過程斷層掃描之間的主要區別在於，在閘集斷層掃描中，輸入由一個閘集基底所組成：一組在斷層掃描初始化/測量階段中使用的閘，並且正在被重構。

source: Qiskit supplies a default gateset basis; in order to use this gateset basis in order to reconstruct another gate, this gate should be added to the basis. We use the following method to simplify the process:
bn_bn: Qiskit এর নিজস্ব একটা গেটসেট ভিত্তি (বেসিস) আছে। অন্য একটা যুক্তিবর্তনী (গেইট) পুনর্গঠনে এই গেটসেট ভিত্তি (বেসিস) ব্যবহার করতে হলে এই যুক্তিবর্তনী (গেইট), ভিত্তিতে (বেসিস) যোগ করতে হবে। সহজে ইটা করার জন্য আমরা নিম্নলিখিত পদ্ধতি ব্যবহার করি:
es_un: Qiskit proporciona un conjunto de compuertas base predeterminado; con el fin de utilizar este conjunto base para reconstruir otra compuerta, esta compuerta debe ser añadida a la base. Utilizamos el siguiente método para simplificar el proceso:
fr_fr: Qiskit fournit une base d'ensemble de portes par défaut ; afin d'utiliser cette base d'ensemble de portes pour reconstruire une autre porte, cette porte devrait être ajoutée à la base. Nous utilisons la méthode suivante pour simplifier le processus:
ja_jp: Qiskit はデフォルトのゲートセットベースを提供しています。 このゲートセットベースを使って別のゲートを再構築するために、このゲートをゲートセットベースに追加する必要があります。以下の方法を使用してプロセスを簡素化します。
ko_kr: Qiskit은 기본 게이트 세트 기준을 제공한다. 다른 게이트를 재구성하기 위해 이 게이트 세트 기준을 사용하려면 이 게이트를 기본 게이트 세트에 추가해야 한다. 다음 방법을 사용하여 프로세스를 단순화한다.
pt_br: O Qiskit fornece uma base de conjunto de portas padrão; a fim de utilizar esta base de conjuto de portas para reconstruir outra porta, esta porta deve ser adicionada à base. Usamos o seguinte método para simplificar o processo:
ru_ru: Qiskit предоставляет набор базовых вентилей по умолчанию; чтобы использовать этот набор для реконструкции других вентилей, они должны быть добавлены в набор. Для упрощения процесса мы используем следующий метод:
ta_in: கிஸ்கிட் இயல்புநிலை கேட்செட் அடிப்படையில் வழங்குகிறது; மற்றொரு கேட்டை புனரமைக்க இந்த கேட்செட் அடிப்படையைப் பயன்படுத்த, இந்த வாயில் அடிப்படையில் சேர்க்கப்பட வேண்டும். செயல்முறையை எளிதாக்க பின்வரும் முறையைப் பயன்படுத்துகிறோம்:
tr_tr: Qiskit, varsayılan bir kapı kümesi temeli sağlar; başka bir kapıyı yeniden inşa etmek amacıyla bu kapı kümesini kullanmak için, bu kapı temele eklenmelidir. Süreci basitleştirmek için aşağıdaki yöntemi kullanırız:
zh_tw: Qiskit 提供預設的閘集基底；為了使用此閘集基底以重建另一個閘，該閘應該被加入此基底。 我們使用以下方法來簡化程序：

source: Noiseless 1-qubit gate set tomography
bn_bn: ত্রুটিমুক্ত ১-কিউবিট গেট সেট টমোগ্রাফি
es_un: Tomografía de conjunto de compuertas de 1 qubit sin ruido
fr_fr: Tomographie de portes à 1 qubit sans bruit
ja_jp: ノイズ無しの1量子ビットゲートセット・トモグラフィー
ko_kr: 잡음이 없는 1-큐비트 게이트 집합 단층 촬영
pt_br: Tomografia de conjunto de portas de 1 qubit sem ruido
ru_ru: Томография набора 1-кубитных вентилей без шума
ta_in: சத்தமில்லாத 1-குவிட் கேட்செட் டோமோகிராபி
tr_tr: Gürültüsüz 1 kübitli kapı kümesi tomografisi
zh_tw: 無噪音的 1 量子位元閘集斷層掃描

source: 1-qubit gate set tomography with amplitude damping noise
fr_fr: tomographie de porte à 1 qubit avec bruit d'amortissement d'amplitude
pt_br: Tomografia de conjunto de portas de 1 qubit com ruído de amortecimento de amplitude

source: Note that we add the noise to all gates (meaning also to the gates performing the tomography)
fr_fr: Notez que nous ajoutons le bruit à toutes les portes (c'est-à-dire aussi aux portes qui font la tomographie)
pt_br: Observe que adicionamos o ruído a todas as portas (significando também para as portas realizando a tomografia)

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/8_tomography.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/8_tomography.ipynb>`_.
ta_in: `IBM குவாண்டம் ஆய்வகத்தில் ஊடாடும் வகையில் இயக்கவும் <https://quantum-computing.ibm.com/jupyter/tutorial/noise/8_tomography.ipynb>`_.
zh_tw: 在 `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/8_tomography.ipynb>`_中互動執行。

source: **Quantum process tomography**: Given a circuit, reconstruct a description of the quantum channel :math:`\mathcal{E}` that describes the circuit’s operator when running on the system.
bn_bn: **কোয়ান্টাম প্রক্রিয়াকারী টমোগ্রাফি**: এই সার্কিট সিস্টেম দ্বারা সম্পাদিত সার্কিটের অপারেটর সম্পর্কে ধারনা দেয়। এর বিবরণকালে সার্কিটটি একটি কোয়ান্টাম চ্যানেল :math:`\mathcal{E}` পুনর্গঠন করে।
es_un: **Tomografía de proceso cuántico**: Dado un circuito, reconstruye una descripción del canal cuántico :math:`\mathcal{E}` que describe el operador del circuito cuando se ejecuta en el sistema.
ja_jp: **量子プロセストモグラフィー**: 回路が与えられたとき、量子チャネル :math:`\mathcal{E}` の表記を再構築し、システム上で実行するときの回路の演算子を記述します。
ko_kr: **양자 프로세스 단층 촬영**: 주어진 회로에 대해, 시스템에서 실행되는 회로의 연산자를 기술하는 양자 채널 :math:`\mathcal{E}` 의 설명을 재구성한다.
ru_ru: **Томография квантовых процессов**: На основании данной цепи восстановить описание квантового канала :math:`\mathcal{E}`, который описывает оператор цепи при запуске системы.
ta_in: ** குவாண்டம் செயல்முறை டோமோகிராபி **: ஒரு சுற்று கொடுக்கப்பட்டால், குவாண்டம் சேனலின் விளக்கத்தை மறுகட்டமைக்கவும்:math: `\mathcal {E}` இது கணினியில் இயங்கும் போது சர்க்யூட்டின் ஆபரேட்டரை விவரிக்கிறது.
tr_tr: **Kuantum süreç tomografisi**: Bir devre verildiğinde, sistemde çalışırken devre operatörünü tanımlayan kuantum kanalı :math:`\mathcal{E}` tanımını yeniden oluştur.
zh_tw: **量子過程斷層掃描(Quantum process tomography)**: 給定一個電路，重新建構對該量子通道 :math:`\mathcal{E}` 的描述，此描述形容該電路的運算子作用在該系統時的情形。

source: **Quantum gate set tomography**: Performs process tomography on a set of gates in a self-consistent manner, meaning quantum noises on gates used by the tomography process itself is also taken into account.
bn_bn: **কোয়ান্টাম গেট সেট টমোগ্রাফি**: এই ধরনের টমোগ্রাফিক সার্কিট কিছু নির্দিষ্ট সার্কিটের উপর সেলফ কন্সিস্টেন্ট ভিত্তিতে কাজ করে অর্থাৎ যুক্তিবর্তনীসমূহর (গেইট) উপর টমোগ্রাফিক প্রক্রিয়া দ্বারা ব্যবহৃত কোয়ান্টাম নয়েজকেও এক্ষেত্রে বিবেচনায় নেয়া হয়।
es_un: **Tomografía de conjunto de compuertas cuánticas**: realiza la tomografía de proceso en un conjunto de compuertas de manera autoconsistente, lo que significa que también se tienen en cuenta los ruidos cuánticos en las compuertas utilizadas por el proceso de tomografía en sí.
ja_jp: **量子ゲートセットトモグラフィー**: 一定の方法でゲートの上でプロセストモグラフィを実行します。 つまりトモグラフィーの過程で使われるゲートに 量子ノイズも考慮されています
ko_kr: **양자 게이트 집합 단층 촬영**: 일관성 있는 방식으로 게이트들의 집합에 프로세스를 단층 촬영을 수행하는데, 이는 단층 촬영 프로세스 자체에서 사용되는 게이트에 양자 잡음이 고려된다는 것을 의미한다.
ru_ru: **Томография набора квантовых вентилей**: Выполняет томографию процесса на наборе вентилей самосогласованным образом, то есть квантовые шумы на вентилях, используемых самим процессом томографии, также принимаются во внимание.
ta_in: ** குவாண்டம் கேட் செட் டோமோகிராபி **: டோமோகிராஃபி செயல்முறையால் பயன்படுத்தப்படும் வாயில்களில் குவாண்டம் சத்தம் என்பதன் அர்த்தம், ஒரு தொகுப்பு வாயில்களில் செயல்முறை டோமோகிராஃபி செய்கிறது.
tr_tr: **Kuantum geçit seti tomografisi**: Bir dizi geçit üzerinde süreç tomografisini kendi içinde tutarlı bir şekilde gerçekleştirir, yani tomografi sürecinin kendisi tarafından kullanılan kapılar üzerindeki kuantum gürültüleri de dikkate alınır.
zh_tw: **量子閘集斷層掃描(Quantum gate set tomography)**：以自洽的方式對一組閘進行過程斷層掃描 (process tomography) ，這意味著斷層掃描過程本身所使用的閘的量子噪音也會被考慮進去。

source: In this example, we have a three-qubit system where one of the qubits will be an ancilla for performing state tomography, i.e. only perform tomography when the third qubit is in the state “1”. The circuit is setup in such a way that after conditional tomography we will get a Bell state on the first two qubits.
bn_bn: এই উদাহরনে আমরা তিন কিউবিট সিস্টেম ব্যবহার করে স্টেট টমোগ্রাফি প্রক্রিয়া সম্পাদন করব। এই তিনটি কিউবিটের মধ্যে একটি হবে এনসিলা কিউবিট বা সাহায্যকারী কিউবিট। এনসিলা কিউবিটটি টমোগ্রাফির উপর তখনই কাজ করবে যখন তৃতীয় কিউবিটটির দশা অবস্থা হবে “১” । এই যুক্তিবর্তনীটি এমনভাবে সম্পাদন করা হয় যাতে শর্তাধীন টমোগ্রাফী সম্পাদনের পর প্রথম দুইটি কিউবিট বেল দশায় (বেল স্টেট) এ থাকে।
es_un: En este ejemplo, tenemos un sistema de tres qubits donde uno de los qubits será un auxiliar o ancilla para realizar la tomografía de estado, es decir, solo realiza la tomografía cuando el tercer qubit está en el estado “1”. El circuito está configurado de tal manera que después de la tomografía condicional obtendremos un estado de Bell en los primeros dos qubits.
ja_jp: この例では、3量子ビットシステムがあります。1量子ビットは 状態トモグラフィーを実行するための補助となります。 3番目の量子ビットが状態 “1” の場合にのみ、トモグラフィーを行います。 この回路は、条件付きトモグラフィーの後、最初の2量子ビットがベル状態になるように設定されています。
ko_kr: 이 예제에서, 3-큐비트 시스템의 하나의 큐비트는 보조 큐비트가 되어 상태 단층 촬영을 수행한다. 즉, 세 번째 큐비트가 “1” 상태에 있을 때만 단층 촬영을 수행한다. 이 회로는 이러한 방법으로 설정되어 조건부 단층 촬영에서 첫 두 개의 큐비트에 Bell 상태를 얻을 수 있을 것이다.
ru_ru: В данном примере у нас есть трехкубитная система, в которой один из кубитов является вспомогательным для выполнения томографии состояния, т.е. томография выполняется только тогда, когда третий кубит находится в состоянии “1”. Схема настроена таким образом, что после условной томографии мы получим состояние Белла на первых двух кубитах.
ta_in: இந்த எடுத்துக்காட்டில், எங்களிடம் மூன்று-குவிட் அமைப்பு உள்ளது, அங்கு ஒரு குவிட் மாநில டோமோகிராஃபி செய்வதற்கு ஒரு துணை இருக்கும், அதாவது மூன்றாவது குவிட் “1” மாநிலத்தில் இருக்கும்போது மட்டுமே டோமோகிராஃபி செய்யுங்கள். நிபந்தனை டோமோகிராஃபிக்குப் பிறகு முதல் இரண்டு வினாடிகளில் பெல் நிலையைப் பெறும் வகையில் சுற்று அமைக்கப்பட்டுள்ளது.
tr_tr: Bu örnekte, kübitlerden birinin durum tomografisi gerçekleştirmek için bir yardımcı olacağı üç kübitlik bir sistemimiz var, örneğin, Sadece üçüncü kübitin "1" durumunda olduğu zaman tomografi gerçekleştiriyor. Devre, koşullu tomografiden sonra ilk iki kübitte bir Bell durumu elde edeceğimiz şekilde kurulur.
zh_tw: 在這個例子中，我們有一個 3 量子位元系統，其中一個量子位元會是一個用來執行狀態斷層掃描的輔助量子位元，也就是說僅當第三個量子位元處於狀態 “1” 時才執行斷層掃描。 該電路的設置使得前 2 個量子位元在條件斷層掃描後處於貝爾態。
