Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/8_tomography.po
Languages: bn_bn, es_un, fr_fr, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: This page was generated from `tutorials/noise/8_tomography.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/noise/8_tomography.ipynb`__ -থেকে নেয়া হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/noise/8_tomography.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/noise/5_quantum_volume.ipynb`__.
ja_jp: このページは `tutorials/noise/8_tomography.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/noise/8_tomography.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada a partir do `tutorials/noise/8_tomography.ipynb`__.
ru_ru: Эта страница создана на основе `tutorials/noise/8_tomography.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/noise/8_tomography.ipynb`__. இலிருந்து உருவாக்கப்பட்டது.
tr_tr: Bu sayfa, `tutorials/noise/8_tomography.ipynb`__ sayfasından oluşturulmuştur.
zh_tw: 此頁面是從 `tutorials/noise/8_tomography.ipynb`__ 產生的。

source: Quantum Tomography
bn_bn: কোয়ান্টাম টমোগ্রাফি
es_un: Tomografía Cuántica
fr_fr: Tomographie quantique
ja_jp: 量子トモグラフィー
ko_kr: 양자 단층 촬영
pt_br: Tomografia Quântica
ru_ru: Квантовая томография
ta_in: குவாண்டம் டோமோகிராபி
tr_tr: Kuantum Tomografi
zh_tw: 量子斷層掃描

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
ja_jp: はじめに
ko_kr: 소개
pt_br: Introdução
ru_ru: Введение
ta_in: அறிமுகம்
tr_tr: Giriş
zh_tw: 簡介

source: Quantum tomography is an experimental procedure to reconstruct a description of part of quantum system from the measurement outcomes of a specific set of experiments. In Qiskit we implement the following types of tomography:
bn_bn: কোয়ান্টাম টমোগ্রাফি হচ্ছে এমন একটা পরীক্ষার পদ্ধতি যেখানে নির্দিষ্ট কিছু পরিমাপ ফলাফল থেকে কোয়ান্টাম সিস্টেমটির অংশের পুনঃউৎপাদন বর্ণনা করা হয়। Qiskit এ আমরা নিম্নোক্ত টমোগ্রাফি পদ্ধতি প্রয়োগ করব:
es_un: La tomografía cuántica es un procedimiento experimental para reconstruir una descripción de una parte del sistema cuántico a partir de los resultados de medición de un conjunto específico de experimentos. En Qiskit implementamos los siguientes tipos de tomografía:
fr_fr: La tomographie quantique est une méthode expérimentale pour reconstruire une description d'une partie du système quantique à partir des résultats de mesure d'un ensemble spécifique d'expériences. Dans Qiskit, nous mettons en œuvre les types de tomographie suivants:
ja_jp: 量子トモグラフィー ( Quantum tomography ) は、量子系の一部の記述を、特定の実験の測定結果から再構築する実験的な手法である。 Qiskit では、以下の種類のトモグラフィーを実装しています。
ko_kr: 양자 단층 촬영(Quantum tomography)은 실험의 특정한 경우의 측정 결과들로부터 일부 양자 계의 설명을 재구성하기 위한 실험적인 과정이다. Qiskit 에서는 다음과 같은 유형의 단층 촬영을 구현한다:
pt_br: A tomografia quântica é um procedimento experimental para reconstruir uma descrição de parte de um sistema quântico a partir dos resultados de medição de um conjunto específico de experimentos. No Qiskit implementamos os seguintes tipos de tomografia:
ru_ru: Квантовая томография – это экспериментальная процедура, позволяющая восстановить описание части квантовой системы из результатов измерений определенного набора экспериментов. В Qiskit мы применяем следующие типы томографии:
ta_in: குவாண்டம் டோமோகிராஃபி என்பது ஒரு குறிப்பிட்ட சோதனைகளின் அளவீட்டு விளைவுகளிலிருந்து குவாண்டம் அமைப்பின் ஒரு பகுதியின் விளக்கத்தை மறுகட்டமைப்பதற்கான ஒரு சோதனை முறையாகும். கிஸ்கிட்டில் நாங்கள் பின்வரும் வகை டோமோகிராஃபியை செயல்படுத்துகிறோம்:
tr_tr: Kuantum tomografisi, kuantum sisteminin bir kısmının tanımını, belirli bir deney kümesinin ölçüm sonuçlarından yeniden oluşturmak için kullanılan deneysel bir yöntemdir. Qiskit 'te aşağıdaki tomografi türlerini uyguluyoruz:
zh_tw: 量子斷層掃描是一個實驗方法，從一組特定實驗的測量結果中重建對量子系統的部分描述。 在 Qiskit 中，我們執行了下列類型的斷層掃描：

source: **Quantum state tomography**: Given a state-preparation circuit that prepares a system in a state, reconstruct a description of the density matrix :math:`\rho` of the actual state obtained in the system.
bn_bn: **কোয়ান্টাম স্টেট টমোগ্রাফি**: একটি অবস্থা (স্টেট) প্রস্তুতকারী বর্তনী যা দশার ডেনসিটি ম্যাট্রিক্স :math:`\rho` পুনর্গঠন করে সিস্টেমের প্রকৃত অবস্থা (স্টেট) সম্পর্কে ধারণা দেয়।
es_un: **Tomografía de estado cuántico**: Dado un circuito de preparación de estados que prepara un sistema en un estado dado, reconstruye una descripción de la matriz de densidad :math:`\rho` del estado real obtenido en el sistema.
fr_fr: ** Tomographie de l'état quantique * *: Compte tenu d'un circuit qui prépare un système dans un état donné, il s'agit de reconstruire une description de la matrice de densité :math:`\rho ` de l'état réel obtenu dans le système.
ja_jp: **量子状態トモグラフィー**: 状態にシステムを準備する状態準備回路が与えられています。 システムで得られた実際の状態の密度行列 :math:`\rho` を再構築します。
ko_kr: **양자 상태 단층 촬영**: 시스템을을 상태로 준비하는 상태-준비 회로(state-preparation circuit)에 대해, 시스템에서 얻은 실제 상태의 밀도 행렬 :math:`\rho` 의 설명을 재구성한다.
pt_br: **Tomografia de estado quântico**: Dado um circuito de preparação de estado que prepara um sistema em um estado, reconstrói uma descrição da matriz de densidade :math:`\rho` do estado real obtido no sistema.
ru_ru: **Томография квантовых состояний**: Имея цепь, которая приводит систему в определенное состояние, восстановить описание матрицы плотности :math:`\rho` фактического состояния, полученного в системе.
ta_in: **Quantum state tomography**ஒரு மாநிலத்தில் ஒரு அமைப்பைத் தயாரிக்கும் ஒரு மாநில-தயாரிப்பு சுற்று கொடுக்கப்பட்டால், அடர்த்தி மேட்ரிக்ஸின் விளக்கத்தை மறுகட்டமைக்கவும்:math:`\rho` அமைப்பில் பெறப்பட்ட உண்மையான நிலை.
tr_tr: **Quantum durum tomografisi**: Bir durumdaki sistemi hazırlayan bir durum-hazırlık devresi verildiğinde, sistemde elde edilen gerçek durumun yoğunluk matrisinin :math:`\rho` tanımını yeniden inşa eder.
zh_tw: **量子態斷層掃描**：給定一個狀態準備電路，此電路把一個系統準備在一個量子態，重建對在系統中獲得的對應實際狀態的密度矩陣 :math:`\rho` 之描述。

source: **Quantum process tomograhpy**: Given a circuit, reconstruct a description of the quantum channel :math:`\mathcal{E}` that describes the circuit's operator when running on the system.
fr_fr: **tomograhpie de processus quantique** : Etant donné un circuit, il s'agit de reconstruire une description du canal quantique :math:`\mathcal{E}` décrivant l'opérateur du circuit lorsqu'il s'exécute sur le système.
pt_br: **Tomografia de processo quântico**: Dado um circuito, reconstrói uma descrição do canal quântico :math:`\mathcal{E}` que descreve o operador do circuito ao executar no sistema.

source: **Quantum gate set tomography**: Performs process tomography on a set of gates in a self-consistant manner, meaning quantum noises on gates used by the tomography process itself is also taken into account.
fr_fr: ** tomographie d'ensemble de portes quantiques**: Pour effectuer une tomographie par processus sur un ensemble de portes de manière autonome, ce qui signifie que les bruits quantiques sur les portes utilisées par le processus de tomographie lui-même sont également pris en compte.
pt_br: **Tomografia do conjunto de portas quânticas**: Realiza a tomografia de processo em um conjunto de portas de maneira auto-consistente, significando que os ruídos quânticos nas portas utilizadas pelo próprio processo de tomografia também são levados em conta.

source: This notebook gives examples for how to use the ``ignis.verification.tomography`` modules.
bn_bn: এই নোটবুকটি তে ``ignis.verification.tomography`` এই মডিউলটির ব্যবহার ব্যাখ্যা করা হবে।
es_un: Este cuaderno da ejemplos de cómo usar los módulos ``ignis.verification.tomography``.
fr_fr: Ce bloc-notes donne des exemples d'utilisation des modules ``ignis.verification.tomography``.
ja_jp: このノートブックでは、``ignis.verification.tomography`` モジュールの使用方法を説明します。
ko_kr: 이 노트북은 ``ignis.verification.tomography`` 모듈을 사용하는 방법에 대한 예제를 제공한다.
pt_br: Este notebook dá exemplos de como usar os módulos ``ignis.verification.tomography``.
ru_ru: В этом блокноте приводятся примеры использования модулей ``ignis.verification.tomography``.
ta_in: `` Ignis.verification.tomography``தொகுதிக்கூறுகளை எவ்வாறு பயன்படுத்துவது என்பதற்கான எடுத்துக்காட்டுகளை இந்த நோட்புக் வழங்குகிறது.
tr_tr: Bu not defteri, ``ignis.verification.tomography`` modüllerinin nasıl kullanılacağına dair örnekler verir.
zh_tw: 這個筆記本提供範例說明如何使用 ``ignis.verification.tomography`` 模組。

source: Initial examples
bn_bn: প্রাথমিক উদাহরণসমূহ
es_un: Ejemplos iniciales
fr_fr: Exemples initiaux
ja_jp: 最初の例
ko_kr: 첫 예제
pt_br: Exemplos iniciais
ru_ru: Начальные примеры
ta_in: ஆரம்ப எடுத்துக்காட்டுகள்
tr_tr: İlk örnekler
zh_tw: 初始範例

source: 2-Qubit state tomography Example
bn_bn: ২-কিউবিট অবস্থা (স্টেট) টমোগ্রাফির উদাহরণ
es_un: Ejemplo de tomografía de estado de 2-qubit
fr_fr: Exemple de tomographie d'état à 2 qubits
ja_jp: 2量子ビットの状態トモグラフィーの例
ko_kr: 2-큐비트 상태 단층 촬영 예제
pt_br: Exemplo de tomografia de estado de 2 Qubits
ru_ru: Пример томографии состояния 2‑х кубитов
ta_in: 2-குபிட் மாநில டோமோகிராஃபி எடுத்துக்காட்டு
tr_tr: 2 Kübitli durum tomografisi örneği
zh_tw: 二量子位元狀態斷層掃描範例

source: In the below example we want to perform state tomography on a 2Q Bell state between qubits 3 and 5. To make the reference circuit we generate the expected statevector using ``statevector_simulator`` between qubits 0 and 1.
bn_bn: নিম্নলিখিত উদাহরণে আমরা কিউবিট ৩ এবং ৫ এর উপর 2Q কিউবিট বেল স্টেট টমোগ্রাফি প্রয়োগ করতে চাই। একাজে প্রামাণ্য সার্কিট বা রেফারেন্স সার্কিটের জন্য কিউবিট ০ এবং কিউবিট ১ এর উপর ``statevector_simulator`` ব্যবহার করে অবস্থা দিকরাশি (ভেক্টর) প্রস্তুত করা হবে।
es_un: En el siguiente ejemplo queremos realizar una tomografía de estado en un estado de Bell de 2Q entre los qubits 3 y 5. Para hacer el circuito de referencia generamos el vector de estado esperado usando ``statevector_simulator`` entre qubits 0 y 1.
fr_fr: Dans l'exemple ci-dessous, nous voulons réaliser une tomographie d'état sur un état de Bell à deux qubits entre les qubits 3 et 5. Pour construire le circuit de référence, nous générons le vecteur d'état attendu en utilisant ``statevector_simulateur`` entre les qubits 0 et 1.
ja_jp: 以下の例では、量子ビット3と5の間の2Qベルの状態トモグラフィーを行います。 参照回路を作るために、qubit 0 と 1 の間に ``statevector_simulator`` を使用して期待される状態ベクトルを生成します。
ko_kr: 아래 예제에서는 큐비트 3과 5사이의 2Q Bell 상태에 대한 상태 단층 촬영을 수행하려고 한다. 기준 회로를 만들고자 ``statevector_simulator`` 를 큐비트 0과 1사이에 사용하여 예상 상태 벡터를 생성한다.
pt_br: No exemplo abaixo queremos realizar a tomografia de estado em um estado de Bell de 2 Qubits entre os qubits 3 e 5. Para fazer o circuito de referência geramos o vetor de estado esperado utilizando ``statevector_simulator`` entre os qubits 0 e 1.
ru_ru: В приведенном ниже примере мы хотим выполнить томографию 2-х кубитного состояния Белла, сформированного между кубитами 3 и 5. Для создания контрольной схемы мы создаем ожидаемый вектор состояния между кубитами 0 и 1, используя ``statevector_simulator``.
ta_in: கீழேயுள்ள எடுத்துக்காட்டில், 3 மற்றும் 5 க்கு இடையில் 2Q பெல் நிலையில் மாநில டோமோகிராஃபி செய்ய விரும்புகிறோம். குறிப்பு சுற்று செய்ய, 0 மற்றும் 1 வினாடிகளுக்கு இடையில் ``statevector_simulator`` ஐப் பயன்படுத்தி எதிர்பார்க்கப்படும் ஸ்டேட்வெக்டரை உருவாக்குகிறோம்.
tr_tr: Aşağıdaki örnekte, 3 ve 5 kübitleri arasında, bir 2Q Bell durumu üzerinde durum tomografisi yürütmek istiyoruz. Referans alınan devreyi yapmak için ``statevector_simulator`` kullanarak 0 ve 1 kübitleri arasında beklenilen durum vektörünü oluşturuyoruz.
zh_tw: 在下面的例子中，我們希望對在量子位元 3 和 5之間的 2 Q Bell 狀態進行狀態斷層掃描。 為了要創建其參照電路，我們以在量子位元 0 與 1 之間的 ``statevector_simulator`` 產生預期的狀態向量。

source: Here we are going to generate and run the state tomography circuits. By only passing in the 2 registers we want to measure the state tomography will only run on that reduced :math:`2^2` Hilbert space. However, if we pass the whole register in the state tomography module will try and fit the full :math:`2^6` space.
bn_bn: এখন আমরা দশা টমোগ্রাফি যুক্তিবর্তনী (স্টেট টমোগ্রাফি সার্কিট) প্রস্তুত এবং মহড়া প্রক্রিয়া বর্ননা করব। এইক্ষেত্রে আমরা ২টি রেজিস্টার ব্যবহার করে দশা টমোগ্রাফি (স্টেট টমোগ্রাফি) পরিমাপ করব, এই টমোগ্রাফির সার্কিট :math:`2^2` হিলবার্ট স্পেসে মহড়া সম্পাদন করবে। যদি আমরা পুরো রেজিস্টারটির মহড়া স্টেট টমোগ্রাফি তে সম্পাদন করতে চাই তাহলে মডিউলটি :math:`2^6` এর জন্য ফিট বা উপযোগী করে নিবে।
es_un: Aquí vamos a generar y ejecutar los circuitos de tomografía de estado. Al pasar solo los 2 registros que queremos medir, la tomografía de estado solo se ejecutará en ese espacio reducido de Hilbert de :math:`2^2`. Sin embargo, si pasamos el registro completo en el módulo de tomografía de estado, este intentará encajar el espacio completo de :math:`2^6`.
fr_fr: Ici, nous allons générer et exécuter les circuits de tomographie d'état. En ne passant que dans les 2 registres que nous voulons mesurer, la tomographie d'état ne fonctionnera que sur l'espace Hilbert réduit de :math:`2^2`. Cependant, si nous passons le registre entier dans le module de tomographie d'état il essaiera fonctionner sur l'espace correspondant à l'espace :math:`2^6`.
ja_jp: ここでは状態トモグラフィー回路を生成して実行します。測定したい2つのレジスタを渡すだけでは、状態トモグラフィは :math:`2^2` ヒルベルト空間の縮小版でしか実行されません。しかし、レジスタ全体を渡すと、状態トモグラフィモジュールは :math:`2^6` 空間にフィットするように動作します。
ko_kr: 여기서 상태 단층 촬영 회로를 생성하고 실행할 것이다. 두 개의 레지스터만 전달함으로써 상태 단층 촬영이 감소 된 :math:`2^2` Hlibert 공간에서만 실행된다. 그러나 상태 단층 촬영이 전체 레지스터를 통과하면, 모듈은 모든 :math:`2^6` 공간에서 할 것이다.
pt_br: Aqui vamos gerar e executar os circuitos de tomografia de estado. Ao passar apenas os 2 registradores nos quais queremos medir, a tomografia de estado executará apenas naquele espaço de Hilbert :math:`2^2` reduzido. No entanto, se passarmos o registrador inteiro o módulo de tomografia de estado tentará ajustar o espaço completo de :math:`2^6`.
ru_ru: Далее мы собираемся создать и запустить схемы томографии состояния. Передавая только 2 регистра, которые мы хотим измерить, томография состояния будет работать только на этом уменьшенном :math:`2^2` гильбертовом пространстве. Однако, если мы добавим весь регистр, модуль томографии состояния попытается провести расчет для полного пространства :math:`2^6`.
ta_in: இங்கே நாம் மாநில டோமோகிராபி சுற்றுகளை உருவாக்கி இயக்கப் போகிறோம். 2 பதிவேடுகளில் மட்டுமே கடந்து செல்வதன் மூலம், மாநில டோமோகிராஃபி குறைக்கப்பட்டதை மட்டுமே இயக்கும்:math: `2^2` ஹில்பர்ட் இடம். எவ்வாறாயினும், மாநில டோமோகிராஃபி தொகுதியில் முழு பதிவையும் நாங்கள் கடந்து சென்றால், முழு:math: `2^6` இடத்தைப் பொருத்த முயற்சிக்கும்.
tr_tr: Burada durum tomografi devrelerini oluşturup çalıştıracağız. Sadece 2 kaydı geçerek yalnızca :math:`2^2` ne indirgenmiş Hilbert uzayında yürütülecek durum tomografisini ölçmek istiyoruz. Ancak, durum tomografisinde kayıtların tamamını geçersek modül, deneyecek ve tam :math:`2^6` uzayına sığacaktır.
zh_tw: 在這裡，我們將生成並運行一個狀態斷層掃描電路。 如果我們只把我們想要測量的兩個暫存器傳遞進去，該狀態斷層掃描只會在縮減的 :math:`2^2` 希爾伯特空間上執行。然而，如果我們把全部的暫存器傳遞進去，則該狀態斷層掃描模組會試著擬合其完整的 :math:`2^6` 希爾伯特空間。

source: The fitter will output a density matrix ordered according to how we passed in the registers to ``state_tomography_circuits``.
bn_bn: এই ফিটার একটি ডেনসিটি ম্যাট্রিক্স ফলাফল হিসেবে দিবে। এই ম্যাট্রিক্সটির মাত্রা নির্ভর করে, ``state_tomography_circuits`` যুক্তিবর্তনীতে কতগুলো রেজিস্টার ব্যবহার করে হচ্ছে তার ওপর।
es_un: El ajustador (fitter) generará una matriz de densidad ordenada de acuerdo con cómo pasamos los registros a ``state_tomography_circuits``.
fr_fr: Le module produira une matrice de densité ordonnée selon la façon dont nous avons passé les registres à ``state_tomography_circuits``.
ja_jp: フィッターは ``state_tomography_circuits`` にレジスタに渡した方法に従って順序付けされた密度行列を出力します。
ko_kr: 적합자(fitter)는 레지스터를 ``state_tomography_circuits`` 에 어떻게 전달했냐에 따라서 정렬된 밀도 행렬을 출력할 것이다.
pt_br: O fitter retornará uma matriz de densidade ordenada de acordo com a forma como passamos os registradores a ``state_tomography_circuits``.
ru_ru: Реконструктор выведет матрицу плотности, упорядоченную в соответствии с тем, как мы передали регистры в ``state_tomography_circuits``.
ta_in: ``state_tomography_circuits``க்கு பதிவேட்டில் நாங்கள் எவ்வாறு கடந்து சென்றோம் என்பதற்கு ஏற்ப ஆர்டர் செய்யப்பட்ட அடர்த்தி மேட்ரிக்ஸை ஃபிட்டர் வெளியிடும்.
tr_tr: Fitter, kayıtlarda ``state_tomography_circuits`` nasıl geçtiğimize göre sıralanan bir yoğunluk matrisi çıkaracaktır.
zh_tw: 擬合器會輸出一個密度矩陣，此密度矩陣會根據我們把暫存器傳遞至``state_tomography_circuits`` 的方式被排序。

source: Repeat the Example with Measurement Noise
bn_bn: পরিমাপ দূষণ (নয়েজ) সহ পুরো প্রক্রিয়াটির পুনরাবৃত্তি করো
es_un: Repetir el ejemplo con medición de ruido
fr_fr: Répéter l'exemple avec le bruit de mesure
ja_jp: 測定ノイズを入れて上記の例を繰り返します
ko_kr: 측정 잡음이 있을 때 예제 반복하기
pt_br: Repita o Exemplo com Ruído de Medição
ru_ru: Повторяем пример с шумом при измерении
ta_in: அளவீட்டு சத்தத்துடன் உதாரணத்தை மீண்டும் செய்யவும்
tr_tr: Ölçüm Gürültüsüyle Örneği Tekrarla
zh_tw: 重複測量噪音的範例

source: 1-qubit process tomography example
bn_bn: ১-কিউবিট প্রক্রিয়া (প্রসেস) টমোগ্রাফির উদাহরণ
es_un: Ejemplo de tomografía de proceso de 1 qubit
fr_fr: Exemple de tomographie d'état à 1 qubit
ja_jp: １量子ビットの状態トモグラフィーの例
ko_kr: 1-큐비트 프로세스 단층 촬영 예제
pt_br: Exemplo de tomografia de processo de 1 qubit
ru_ru: Пример томографии 1-кубитного состояния
ta_in: 1-குவிட் செயல்முறை டோமோகிராபி எடுத்துக்காட்டு
tr_tr: 1 kübitli süreç tomografi örneği
zh_tw: 單量子位元過程斷層掃描範例

source: 1-qubit process tomography of two-qubit swap gate
bn_bn: দুই কিউবিট সোয়াপ (swap) গেটের জন্য এক-কিউবিট টমোগ্রাফি প্রক্রিয়া
es_un: Tomografía de proceso de 1 qubit de la compuerta swap (intercambio) de dos qubits
fr_fr: tomographie du processus 1-qubit de la porte d'échange à deux qubits
ja_jp: 2量子ビットスワップゲートの 1量子ビットプロセストモグラフィーについて
ko_kr: 2-큐비트 교환 게이트의 1-큐비트 프로세스 단층 촬영
pt_br: Tomografia de processo de 1 qubit de uma porta swap de 2 qubits
ru_ru: Томография однокубитного процесса для двухкубитного вентиля SWAP (обмена)
ta_in: இரண்டு-குவிட் இடமாற்று வாயிலின் 1-குவிட் செயல்முறை டோமோகிராபி
tr_tr: İki kübitli SWAP kapısının 1 kübitli süreç tomografisi
zh_tw: 對二量子位元交換閘 (swap gate) 的單量子位元過程斷層掃描

source: We will prepare qubit-0 and measure qubit-1 so the reconstructed channel should be an identity.
bn_bn: আমরা কিউবিট-০ তৈরি করব এবং কিউবিট-১ পরিমাপ করব যাতে পুনঃউৎপাদিত চ্যানেলটি একটি অভেদক হিসেবে কাজ করে।
es_un: Prepararemos el qubit 0 y mediremos el qubit 1 por lo que el canal reconstruido debería ser una identidad.
fr_fr: Nous préparerons qubit-0 et mesurerons qubit-1 pour que le canal reconstruit soit une identité.
ja_jp: qubit-0 を準備し、 qubit-1 を測定して、再構成されたチャネルが恒等演算になるようにします。
ko_kr: 큐비트-0을 준비하고 큐비트-1을 측정하여 재구성된 채널이 단위 행렬이 되도록 할 것이다.
pt_br: Vamos preparar o qubit-0 e medir o qubit-1 de modo que o canal reconstruído deve ser uma identidade.
ru_ru: Мы подготовим кубит-0 и измерим кубит-1, поэтому восстановленный канал должен быть тождественным.
ta_in: நாங்கள் குவிட் -0 ஐ தயார் செய்து க்விட் -1 ஐ அளவிடுவோம், எனவே புனரமைக்கப்பட்ட சேனல் ஒரு அடையாளமாக இருக்க வேண்டும்.
tr_tr: Kübit-0'ı hazırlayacak ve kübit-1'i ölçeceğiz, böylece yeniden inşa edilen kanal birim matris olmalı.

source: Advances examples
bn_bn: উচ্চদক্ষতা ভিত্তিক কিছু উদাহরণসমূহ
es_un: Ejemplos avanzados
fr_fr: Exemples d'avances
ja_jp: 先進的な例
ko_kr: 고급 예제
pt_br: Exemplos Avançados
ru_ru: Более сложные примеры
tr_tr: İleri örnekler

source: Generating and fitting random states
bn_bn: দৈবচয়ন ভিত্তিক দশা (র‍্যান্ডম স্টেটস) প্রস্তুতকরন এবং ফিটিং
es_un: Generación y ajuste de estados aleatorios
fr_fr: Génération et ajustement d'états aléatoires
ja_jp: ランダムな状態の生成とフィッティング
ko_kr: 임의 상태 생성 및 피팅
pt_br: Gerando e ajustando estados aleatórios
ru_ru: Создание и реконструкция случайных состояний
ta_in: சீரற்ற நிலைகளை உருவாக்குதல் மற்றும் பொருத்துதல்
tr_tr: Rasgele durumlar oluşturma ve uydurma
zh_tw: 產生和擬合隨機狀態

source: We now test the functions on the state generated by a circuit consisting of a layer of random single qubit unitaries u3.
bn_bn: এখন আমরা দৈবচয়ন ভিত্তিক একটি একক কিউবিট u3 থেকে নির্মিত একটা স্তরবিশিষ্ট একটা বর্তনীর (সার্কিট) বানানো অবস্থা (স্টেট) -এর উপর অন্বয়গুলো (ফাংশন) পরীক্ষা করব।
es_un: Ahora probamos las funciones en el estado generado por un circuito que consta de una capa de unitarios u3 de un solo qubit aleatorios.
fr_fr: Nous testons maintenant les fonctions sur l'état généré par un circuit constitué d'une couche de portes unitaires uniques aléatoires u3.
ja_jp: ここでは、ランダムな1量子ビットのユニタリーu3の層で構成される回路で生成された状態に関する関数をテストします。
ko_kr: 이제 임의의 싱글 큐비트 유니터리 u3 레이어를 포함한 회로로 생성한 상태에 주어진 함수를 테스트 한다.
pt_br: Nós agora testamos as funções no estado gerado por um circuito composto por uma camada de unitárias aleatórias u3 de um único qubit.
ru_ru: Теперь мы испытаем использованные выше функции на состоянии, которое создается цепью, состоящей из слоя случайных однокубитных унитарных операторов u3.
ta_in: சீரற்ற ஒற்றை குவிட் யூனிடரிகளின் u3 அடுக்கைக் கொண்ட ஒரு சுற்று மூலம் உருவாக்கப்படும் மாநிலத்தின் செயல்பாடுகளை இப்போது சோதிக்கிறோம்.
tr_tr: Şimdi, rasgele tek kübit birimleri u3 katmanından oluşan bir devre tarafından üretilen durumdaki fonksiyonları test ediyoruz.
zh_tw: 在由一層 u3 隨機單量子位元幺正閘所組成的電路生成的狀態下，我們現在來測試這些函數。

source: 5-Qubit Bell State
bn_bn: ৫-কিউবিট বেল অবস্থা (স্টেট)
es_un: Estado de Bell de 5 qubits
fr_fr: État de Bell à 5-qubits
ja_jp: 5量子ビットのベル状態
ko_kr: 5-큐비트 Bell 상태
pt_br: Estado de Bell de 5 Qubits
ru_ru: 5-кубитное состояние Белла
ta_in: 5-குபிட் மணி மாநிலம்
tr_tr: 5 Kübitli Bell Durumu
zh_tw: 5-Qubit Bell 狀態

source: 2-Qubit Conditional State Tomography
bn_bn: ২-কিউবিট শর্তসাপেক্ষ অবস্থা (স্টেট) টমোগ্রাফি
es_un: Tomografía de estado condicional de 2 qubit
fr_fr: Tomographie d'état conditionnel 2-qubits
ja_jp: 2量子ビット条件付き状態トモグラフィー
ko_kr: 2-큐비트 조건부 상태 단층 촬영
pt_br: Tomografia de Estado Condicional de 2 Qubits
ru_ru: Условная томография 2-х кубитного состояния
ta_in: 2-குபிட் நிபந்தனை மாநில டோமோகிராபி
tr_tr: 2 Kübitli Koşullu Durum Tomografisi
zh_tw: 2 量子位元條件式斷層掃描

source: In this example, we have a three-qubit system where one of the qubits will be an ancilla for performing state tomography, i.e. only perform tomography when the third qubit is in the state "1". The circuit is setup in such a way that after conditional tomography we will get a Bell state on the first two qubits.
fr_fr: Dans cet exemple, nous avons un système à trois qubits où l'un des qubits sera un qubit auxiliaire pour effectuer la tomographie d'état, c'est-à-dire que la tomographie sera effectuée seulement lorsque le troisième qubit est à l'état "1". Le circuit est configuré de telle façon qu'après une tomographie conditionnelle nous aurons un état de Bell sur les deux premiers qubits.
pt_br: Neste exemplo, temos um sistema de três qubit em que um dos qubits será um auxiliar para a realização da tomografia de estado, ou seja, apenas realiza a tomografia quando o terceiro qubit está no estado "1". O circuito é configurado de tal forma que após a tomografia condicional obteremos um estado de Bell nos dois primeiros qubits.

source: First make a 3Q GHZ state with no classical measurements.
bn_bn: প্রথমে কোনরকম ধ্রুপদী গণনাযন্ত্রের পরিমাপ সাহায্য ছাড়া একটি 3Q GHZ স্টেট সার্কিট বানাতে হবে।
es_un: Primero hagamos un estado GHZ de 3Q sin mediciones clásicas.
fr_fr: Construisons d'abord un état GHZ sur 3 qubits sans mesures classiques.
ja_jp: 最初に古典的な測定なしで3量子ビットのGHZ状態を作ります。
ko_kr: 먼저 고전적인 측정이 없는 3Q GHZ 상태를 만든다.
pt_br: Primeiro faça um estado GHZ de 3 qubits sem medições clássicas.
ru_ru: Сначала создаем 3-х кубитное GHZ состояние без классических измерений.
ta_in: முதலில் கிளாசிக்கல் அளவீடுகள் இல்லாத 3Q GHZ நிலையை உருவாக்குங்கள்.
tr_tr: İlk önce klasik ölçüm olmadan 3Q GHZ durumu yapın.
zh_tw: 在沒有經典測量的情況下，先做一個 三量子位元 GHZ 狀態。
