Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/9_entanglement_verification.po
Languages: bn_bn, es_un, fr_fr, ja_jp, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: We can see how error mitigation dramatically improves our measurement (much more so in PO than in MQC). Let us quantify this using the same DFT method we used in MQC, and calculating the actual fidelities:
bn_bn: আমরা দেখতে পাচ্ছি যে ত্রুটি দূরীকরণ কীভাবে নাটকীয়ভাবে আমাদের পরিমাপকে উন্নত করে (এমকিউসির চেয়ে পিওতে আরও বেশি)। আসুন আমরা এমকিউসি-তে ব্যবহৃত একই ডিএফটি পদ্ধতিটি ব্যবহার করে একে পরিমাপ করি এবং প্রকৃত বিশ্বস্ততা গণনা করি:
es_un: Podemos ver cómo la mitigación de errores mejora drásticamente nuestra medición (mucho más en PO que en MQC). Cuantifiquemos esto usando el mismo método DFT que usamos en MQC y calculando las fidelidades reales:
ja_jp: エラーの軽減によって測定が劇的に改善されることがわかります（MQCよりもPOの方がはるかに優れています）。 MQCで使用したのと同じDFT法を使用してこれを定量化し、実際の忠実度を計算してみましょう。
ru_ru: Мы видим, как подавление ошибок значительно улучшает наши измерения (гораздо сильнее в осцилляциях четности, чем в MQC). Давайте оценим это количественно, используя тот же метод DFT, который мы использовали в MQC, и вычисляя фактические достоверности:
ta_in: பிழை குறைத்தல் எவ்வாறு எங்கள் அளவீட்டை வியத்தகு முறையில் மேம்படுத்துகிறது என்பதைக் காணலாம் (MQC ஐ விட PO இல் அதிகம்). MQC இல் நாங்கள் பயன்படுத்திய அதே DFT முறையைப் பயன்படுத்தி இதை அளவிடுவோம், மேலும் உண்மையான சரிபார்த்தலையைக் கணக்கிடுவோம்:
tr_tr: Hata azaltmasının ölçümümüzü önemli ölçüde nasıl geliştirdiğini görebiliyoruz (PO'da MQC'den çok daha fazla). Bunu, MQC'de kullandığımız aynı DFT yöntemini kullanarak ve gerçek doğrulukları hesaplayarak ölçelim:
zh_tw: 我們可以看到錯誤緩解顯著改善了我們的測量（在 PO 的情況比在 MQC 更加顯著 ）。 讓我們對此進行量化並使用 MQC 中使用的相同 DFT 方法計算實際保真度。

source: As we see, the raw fidelity is much lower than what is achieved with MQC, but the error mitigated result is about the same.
bn_bn: আমরা দেখতে পাই যে, এমকিউসি-র মাধ্যমে প্রাপ্ত বিশ্বস্ততার তুলনায় প্রাথমিক বিশ্বস্ততা অনেকটাই কম, তবে ত্রুটি প্রশমিত ফলাফলটি প্রায় একই রকম।
es_un: Como vemos, la fidelidad bruta es mucho menor que la que se logra con MQC, pero el resultado mitigado de errores es aproximadamente el mismo.
ja_jp: ご覧のとおり、生の忠実度はMACで達成されるものよりもはるかに低いですが、エラーが軽減された結果はほぼ同じです。
ru_ru: Как мы видим, исходная достоверность намного ниже, чем та, что достигается с помощью MQC, но результат сглаживания ошибок примерно такой же.
ta_in: நாம் பார்ப்பது போல், பதனிடப்படாத சரிபார்த்தல் MQC உடன் அடையப்பட்டதை விட மிகக் குறைவு, ஆனால் பிழையைத் தணிக்கும் முடிவு ஒரே மாதிரியாக இருக்கும்.
tr_tr: Gördüğümüz gibi, saf doğruluğu MQC'de elde ettiğimizden çok daha düşük fakat hata azaltılmış sonuç ile neredeyse aynı.
zh_tw: 如我們所見，其原始保真度遠低於 MQC 所達成的效果，但錯誤緩解的結果則是差不多相同的。

source: Part 3: Tomography
bn_bn: তৃতীয় অধ্যায়: টমোগ্রাফি
es_un: Parte 3: Tomografía
fr_fr: Partie 3: Tomographie
ja_jp: パート3：トモグラフィー
pt_br: Parte 3: Tomografia
ta_in: பகுதி 3: முப்பரிமாண வரவி
tr_tr: 3. Bölüm: Tomografi
zh_tw: 第3部分: 斷層掃描

source: The first step in this experiment to just pass a simple GHZ state with *no* measurements. Also, the circuit cannot be transpiled; the ``transpiled`` argument in the ``getGHZChecker()`` method can be turned on and off as is shown
bn_bn: এই পরীক্ষার প্রথম পদক্ষেপটি হল, পরিমাপ *ছাড়াই* কেবল একটি সাধারণ GHZ অবস্থা (স্টেট) সরবরাহ করা। এছাড়াও, সার্কিটটি স্থানান্তরিত করা যায় না; এবং ``getGHZChecker()`` পদ্ধতির ``transpiled`` আর্গুমেন্টটি দেখানো উপায়ে অন এবং অফ করা যায়।
es_un: El primer paso en este experimento es simplemente pasar un estado GHZ simple *sin* mediciones. Además, el circuito no se puede transpilar; el argumento ``transpiled`` en el método ``getGHZChecker()`` se puede activar y desactivar como se muestra
fr_fr: La première étape de cette expérience est de passer un état GHZ simple *sans* opération de mesure. De plus, le circuit ne peut pas être transpilé ; l'argument ``transpiled`` dans la méthode ``getGHZChecker ()`` peut être activé et désactivé comme indiqué
ja_jp: この実験の最初のステップは、測定 *なし* で単純なGHZ状態を通過させることです。 また、回路をトランスパイルすることはできません。 ``getGHZChecker()`` メソッドの ``transpiled`` 引数は、示されているようにオンとオフを切り替えることができます。
pt_br: O primeiro passo neste experimento é apenas passar um simples estado GHZ *sem* medições. Também, o circuito não pode ser transpilado; o argumento ``transpiled``, no método ``getGHZChecker()`` pode ser ligado e desligado como é mostrado
ta_in: * no * அளவீடுகள் இல்லாத எளிய GHZ நிலையை கடக்க இந்த சோதனையின் முதல் படி. மேலும், சுற்று மாற்ற முடியாது; `` getGHZChecker () `` முறையின் ``transpiled`` வாதம் காட்டப்பட்டுள்ளபடி இயக்கப்படலாம் மற்றும் அணைக்கப்படலாம்
tr_tr: Bu deneyde ilk adım *ölçümsüz* basit bir GHZ durumuna geçmek. Ayrıca, devre çevrilemez (transpile); ``getGHZChecker()`` yöntemindeki ``transpile`` argümanı gösterildiği gibi açılıp kapanabilir
zh_tw: 此實驗中的第一個步驟，只是要傳遞一個簡單的 GHZ 狀態與該狀態耦合在一起的 *no* 測量。 此外，該電路不能被轉譯；在 ``getGHZChecker()`` 方法中的 ``transpiled`` 選項可以被開啟和關閉，如所示:

source: We now pass a simulated backend from ``Aer`` to get theoretical statevector counts
bn_bn: তাত্ত্বিক অবস্থা দিকরাশি (ভেক্টর) গণনা পেতে আমরা এখন ``এয়ার`` থেকে পাওয়া একটি সিমুলেটেড ব্যাকএন্ড পাস করি
es_un: Ahora pasamos un backend simulado de ``Aer`` para obtener los conteos teóricos de un vector de estado
fr_fr: Nous avons maintenant un backend simulé par ``Aer`` pour obtenir les quantités théoriques des états vectoriels
ja_jp: ここで、 ``Aer`` からシミュレートされたバックエンドを渡して、理論的な状態ベクトルカウントを取得します。
pt_br: Passamos agora um backend simulado do ``Aer`` para obter contagens do vetor de estados teórico
ta_in: இப்போது தத்துவார்த்த நிலைவெக்டர் எண்ணிக்கையைப் பெற `` Aer`` இலிருந்து உருவகப்படுத்தப்பட்ட பின்தளத்தில் அனுப்புகிறோம்
tr_tr: Şimdi teorik durum vektörü sayımlarını elde etmek için ``Aer`` den bir simülasyon arka ucunu giriyoruz
zh_tw: 我們現在從 ``Aer`` 傳遞一個模擬的後端，以取得理論狀態向量計數。

source: This following code runs tomography experiments on the circuit we defined first, which is then compared to the theoretical statevector to generate a density matrix
bn_bn: নিম্নোক্ত কোডটি আমাদের শুরুতে সংজ্ঞায়িত বর্তনীতে (সার্কিট) টোমোগ্রাফি পরীক্ষা চালায় যাকে পরে ঘনত্বের ম্যাট্রিক্স উৎপন্ন করার জন্য তাত্ত্বিক অবস্থা দিকরাশির (ভেক্টর) সাথে তুলনা করা হয়
es_un: El siguiente código ejecuta experimentos de tomografía en el circuito que definimos primero, que luego se compara con el vector de estado teórico para generar una matriz de densidad
ja_jp: この次のコードは、最初に定義した回路でトモグラフィー実験を実行し、次にそれを理論的な状態ベクトルと比較して密度行列を生成します
ta_in: இந்த பின்வரும் குறியீடு நாம் முதலில் வரையப்பட்ட சுற்றுவட்டத்தில் டோமோகிராபி சோதனைகளை இயக்குகிறது, பின்னர் இது அடர்த்தி மேட்ரிக்ஸை உருவாக்க கோட்பாட்டு ஸ்டேட்வெக்டருடன் ஒப்பிடப்படுகிறது
tr_tr: Bu aşağıdaki kod, ilk olarak tanımladığımız devre üzerinde tomografi deneylerini çalıştırır, bu daha sonra bir yoğunluk matrisi oluşturmak için teorik durum vektörü ile karşılaştırılır
zh_tw: 以下程式碼是在我們最先定義的電路上進行斷層掃描實驗，然後與理論狀態向量比較以生成一個密度矩陣。

source: From here we can get the fidelity, although this method is not as fool proof as the one we will get to eventually:
bn_bn: এখান থেকে আমরা বিশ্বস্ততা পেতে পারি, যদিও এই পদ্ধতিটি শেষ পর্যন্ত আমরা যে পদ্ধতিতে যাবো তার মতো বুদ্ধিমান নয়:
es_un: Desde aquí podemos obtener la fidelidad, aunque este método no es tan infalible como al que llegaremos eventualmente:
fr_fr: De là, nous pouvons obtenir la fidélité, bien que cette méthode ne soit pas aussi robuste que celle à laquelle nous arriverons à la fin :
ja_jp: ここから忠実度を得ることができますが、この方法は最終的に得られる方法ほど確実ではありません。
pt_br: A partir daqui podemos obter a fidelidade, embora este método não seja tão infalível como ao que vamos chegar a eventualmente:
ta_in: இங்கிருந்து நாம் நம்பகத்தன்மையைப் பெறலாம், இருப்பினும் இந்த முறை முட்டாள்தனமான ஆதாரம் அல்ல என்றாலும், இறுதியில் நாம் பெறுவோம்:
tr_tr: Buradan doğruluğu elde edebiliriz, ancak bu yöntem, neticede alacağımız yöntem kadar sağlam değil:
zh_tw: 從這裡我可以獲得其保真度，雖然此方法不如我們最後會討論到的方法防呆。

source: …And now for error mitigation…
bn_bn: …এবং এখন ত্রুটি প্রশমনের জন্য…
es_un: …Y ahora para mitigación de errores…
ja_jp: そしてエラー軽減のために、
ta_in: … இப்போது பிழை குறைப்புக்காக…
tr_tr: ... Ve şimdi hata azaltma için...
zh_tw: …而現在對於錯誤緩解…

source: Now, using ``qiskit.visualization``, we can plot the raw density matrix, real, and imaginary parts being on separate plots,…
bn_bn: এখন, ``qiskit.visualization`` ব্যবহার করে আমরা অপরিমার্জিত ঘনত্বের ম্যাট্রিক্স লেখচিত্র আঁকতে পারি, যেখানে বাস্তব এবং কাল্পনিক অংশগুলি পৃথক লেখে থাকবে…
es_un: Ahora, usando ``qiskit.visualization``, podemos graficar la matriz de densidad bruta, las partes reales e imaginarias en gráficas separadas,…
ja_jp: これで ``qiskit.visualization`` を用い、密度行列そのまま、実部、および虚部を別々にプロットすることができます。
ta_in: இப்போது, ​​`` qiskit.visualization`` ஐப் பயன்படுத்தி, மூல அடர்த்தி மேட்ரிக்ஸ், உண்மையான மற்றும் கற்பனை பாகங்கள் தனித்தனி அடுக்குகளில் இருப்பதை நாங்கள் திட்டமிடலாம்,…
tr_tr: Şimdi, ``qiskit.visualization`` ı kullanarak şunları çizebiliriz: saf yoğunluk matrisini, ayrı çizimler üzerindeki hayali ve gerçek parçaları…
zh_tw: 現在，使用 ``qiskit.visualization``，我們可以將原始密度矩陣、實數、和虛數部分繪製在個別圖形上，…

source: And also the error mitigated density matrix,…
bn_bn: এবং ত্রুটি প্রশমিত ঘনত্ব ম্যাট্রিক্স,…
es_un: Y también la matriz de densidad con mitigación de error,…
ja_jp: また、エラーが軽減された密度行列は、
ta_in: மேலும் பிழை தணிக்கப்பட்ட அடர்த்தி அணி,…
tr_tr: Ve aynı zamanda hata azaltılmış yoğunluk matrisi,…
zh_tw: 並且經過錯誤緩解的密度矩陣，…

source: The actual density matrices can be obtained using the ``fit()`` method. Once we have the density matrix, we can compute the fidelity, which is nothing but half the sum of the four corners of the density matrix; the following method helps us:
bn_bn: প্রকৃত ঘনত্ব ম্যাট্রিকগুলি ``fit()`` পদ্ধতি ব্যবহার করে পাওয়া যায়। ঘনত্ব ম্যাট্রিক্স পাবার পর আমরা বিশ্বস্ততা গণনা করতে পারি, যা ঘনত্ব ম্যাট্রিক্সের চারটি কোণার যোগফলের অর্ধেক ব্যতীত কিছুই নয়; নিম্নলিখিত পদ্ধতিটি আমাদের সহায়তা করে:
es_un: Las matrices de densidad reales se pueden obtener utilizando el método ``fit()``. Una vez que tenemos la matriz de densidad, podemos calcular la fidelidad, que no es más que la mitad de la suma de las cuatro esquinas de la matriz de densidad; el siguiente método nos ayuda:
fr_fr: Les matrices de densité réelles peuvent être obtenues à l'aide de la méthode ``fit ()``. Une fois que nous avons la matrice de densité, nous pouvons calculer la fidélité, qui n'est que la moitié de la somme des quatre coins de la matrice de densité ; la méthode suivante nous aide:
ja_jp: 実際の密度行列は、 ``fit()`` メソッドを使用して取得できます。 密度行列ができたら、忠実度を計算できます。これは、密度行列の4つの角の合計の半分にすぎません。 次の方法が役立ちます。
pt_br: As matrizes densidade reais podem ser obtidas utilizando o método ``fit()``. Uma vez que temos a matriz de densidade, podemos computar a fidelidade, que é simplesmente a metade da soma dos quatro cantos da matriz densidade; o método a seguir nos ajuda:
ta_in: உண்மையான அடர்த்தி மெட்ரிக்குகளை `` fit () `` முறையைப் பயன்படுத்தி பெறலாம். அடர்த்தி மேட்ரிக்ஸைக் கொண்டவுடன், நம்பகத்தன்மையை நாம் கணக்கிட முடியும், இது அடர்த்தி மேட்ரிக்ஸின் நான்கு மூலைகளின் பாதித் தொகையைத் தவிர வேறில்லை; பின்வரும் முறை நமக்கு உதவுகிறது:
tr_tr: Gerçek yoğunluk matrisleri ``fit()`` yöntemi kullanılarak elde edilebilir. Bir kez yoğunluk matrisine sahip olduğumuzda, yoğunluk matrisinin dört köşesinin toplamının yarısından başka bir şey olmayan doğruluğu hesaplayabiliriz; aşağıdaki bize yardımcı olur:
zh_tw: 可以使用 ``fit()`` 方法取得實際的密度矩陣。 一旦我們擁有該密度矩陣，我們就可以計算出其保真度，此保真度可由密度矩陣四個角總和的一半簡單地被計算出；以下的方法幫助我們：

source: As we see, the raw fidelity is much lower than what is achieved with either MQC or Parity Oscillations, but the error mitigated result is about the same.
bn_bn: সুতরাং অপরিমার্জিত বিশ্বস্ততা মান, এম.কিউ.সি বা প্যারিটি দোলন (অসিলেশন) দ্বারা পাওয়া বিশ্বস্ততা মানের চেয়ে অনেক কম (যদিও ত্রুটি প্রশমিত ফলাফল প্রায় একই)।
es_un: Como vemos, la fidelidad bruta es mucho menor que la que se logra con MQC u Oscilaciones de Paridad, pero el resultado mitigado de errores es aproximadamente el mismo.
ja_jp: ご覧のとおり、生の忠実度はMICまたはパリティオシレーションのいずれかで達成されるものよりもはるかに低くなりますが、エラーが軽減された結果はほぼ同じです。
ta_in: நாம் பார்ப்பது போல், மூல நம்பகத்தன்மை MQC அல்லது பரிதி அலைவுகளுடன் அடையப்படுவதை விட மிகக் குறைவு, ஆனால் பிழையைத் தணிக்கும் முடிவு ஒரே மாதிரியாக இருக்கும்.
tr_tr: Gördüğümüz gibi, saf doğruluğu MQC'de elde ettiğimizden çok daha düşük fakat hata azaltılmış sonuç ile neredeyse aynı.
zh_tw: 如我們所見，原始保真度比 MQC 或宇稱震盪可以達到的保真度都要低得多，但世其誤差緩解過後的結果是差不多的。

source: **A note on tomography**
bn_bn: **টমোগ্রাফির ওপরে টীকা**
es_un: **Una nota sobre tomografía**
fr_fr: **Une note sur la tomographie**
ja_jp: **トモグラフィーに関する注記**
pt_br: **Uma nota sobre a tomografia**
tr_tr: ** Tomografi üzerine bir not *
zh_tw: ** 關於斷層掃描的說明 **

source: Do not perform quantum tomography with >5 qubits
bn_bn: ৫টা কিউবিট এর বেশি তে কোয়ান্টাম টমোগ্রাফি করে দেখা উচিত নয়।
es_un: No realizar tomografía cuántica con >5 qubits
fr_fr: Ne pas effectuer de tomographie quantique avec > 5 qubits
ja_jp: 5量子ビットを超える量子トモグラフィーを実行しないでください。
pt_br: Não realize tomografia quântica com > 5 qubits
ta_in: > 5 குவிட்களுடன் குவாண்டம் டோமோகிராஃபி செய்ய வேண்டாம்
tr_tr: > 5 kübit ile kuantum tomografisi gerçekleştirmeyin
zh_tw: 不要使用超過 5 個量子位元來執行量子斷層掃描

source: Conclusion
bn_bn: উপসংহার
es_un: Conclusión
ja_jp: 結論
pt_br: Conclusão
ta_in: முடிவுரை
tr_tr: Sonuç
zh_tw: 結論

source: In conclusion, we see that without error mitigation, MQC is the superior method for characterizing the GHZ state. However, with error mitigation, all methods can, at least for a small number of qubits, achieve a much greater fidelity, and all near the same value. To get more accurate results, aside from using a real device, it is worth increasing the number of shots four to eight-fold. It may be worth comparing how the parallelized circuits used in this notebook perform fidelity-wise versus linearized circuits.
bn_bn: সর্বোপরি আমরা লক্ষ্য করি যে ত্রুটি দূরীকরণ না ব্যবহার করলে এম. কিউ. সি হলো GHZ অবস্থা (স্টেট) চরিত্রয়নের জন্যে সেরা পদ্ধতি। কিন্তু কম সংখক কিউবিট এর জন্যে ত্রুটি দূরীকরণ ব্যবহার করলে প্রায় সব পদ্ধতির একই মানের কাছে অনেক বেশি বিশ্বস্ত এবং তাদের মানগুলো কাছাকাছি। আসল যন্ত্র এবং শটসমূহ এর সংখ্যা বাড়িয়ে আরো সঠিক ফলাফল পাওয়া সম্ভব। বিশ্বস্ততার নিরিখে এই নোটবুকের সমান্তরাল বর্তনী (সার্কিট) এবং রৈখিক বর্তনীর (সার্কিট) তুলনা লক্ষণীয়।
es_un: En conclusión, vemos que sin mitigación de errores, MQC es el método superior para caracterizar el estado GHZ. Sin embargo, con la mitigación de errores, todos los métodos pueden, al menos para una pequeña cantidad de qubits, lograr una fidelidad mucho mayor y todos cerca del mismo valor. Para obtener resultados más precisos, además de usar un dispositivo real, vale la pena aumentar el número de iteraciones entre cuatro y ocho veces. Puede valer la pena comparar cómo los circuitos paralelizados usados en este cuaderno funcionan en fidelidad versus circuitos linealizados.
ja_jp: 結論として、エラーを軽減することなく、MQCがGHZ状態を特徴付ける優れた方法であることがわかります。 ただし、エラーを軽減することで、すべてのメソッドは、少なくとも少数の量子ビットに対して、はるかに高い忠実度を達成でき、すべてほぼ同じ値になります。 より正確な結果を得るには、実際のデバイスを使用する以外に、ショット数を4倍から8倍に増やす価値があります。 このノートブックで使用されている並列化された回路が、忠実度に関して線形化された回路とどのように機能するかを比較する価値があるかもしれません。
ta_in: முடிவில், பிழையைத் தணிக்காமல், MQC என்பது GHZ நிலையை வகைப்படுத்துவதற்கான சிறந்த முறையாகும். இருப்பினும், பிழையைத் தணிப்பதன் மூலம், அனைத்து முறைகளும், குறைந்த பட்சம் ஒரு சிறிய எண்ணிக்கையிலான வினாடிகளுக்கு, அதிக நம்பகத்தன்மையை அடையலாம், மேலும் அனைத்தும் ஒரே மதிப்பிற்கு அருகில் இருக்கும். மிகவும் துல்லியமான முடிவுகளைப் பெற, ஒரு உண்மையான சாதனத்தைப் பயன்படுத்துவதைத் தவிர, காட்சிகளின் எண்ணிக்கையை நான்கு முதல் எட்டு மடங்கு அதிகரிப்பது மதிப்பு. இந்த நோட்புக்கில் பயன்படுத்தப்படும் இணையான சுற்றுகள் நம்பகத்தன்மை வாரியாக மற்றும் நேர்கோட்டுப்படுத்தப்பட்ட சுற்றுகளை எவ்வாறு செய்கின்றன என்பதை ஒப்பிடுவது மதிப்புக்குரியதாக இருக்கலாம்.
tr_tr: Sonuç olarak, hata azaltma olmadan, MQC'nin GHZ durumunu karakterize etmek için üstün bir yöntem olduğunu görüyoruz. Bununla birlikte, hata azaltma ile, tüm yöntemler, en azından az sayıda kübit için, çok daha yüksek bir doğruluk elde edebilir ve hepsi aynı değere yakın olabilmektedir. Daha kesin sonuçlar elde etmek için, gerçek bir cihaz kullanmanın yanı sıra, deneme sayısını dört ila sekiz kat artırmaya değer. Bu not defterinde kullanılan paralel devrelerin, lineer devrelere karşı doğruluk açısından nasıl performans gösterdiğini karşılaştırmaya değer olabilir.
zh_tw: 結論是，我們看到在沒有錯誤緩解的情況下， MQC 是測量 GHZ 狀態的優越方法。 然而在有錯誤緩解的情況下，所有方法都可以達到了更高的保真度並且都接近相同值，至少對於只有少量的量子位元的情況是如此。 為了取得更準確的結果，除了使用真實的器件之外，將測量次數增加 4 到 8 倍是值得的。以保真度來衡量比較此筆記本中所使用的並行化電路與線性化電路可能是值得的。

source: External collaborators
bn_bn: বাহ্যিক সহযোগী
es_un: Colaboradores externos
ja_jp: 外部共同編集者
ta_in: வெளிப்புற ஒத்துழைப்பாளர்கள்
tr_tr: Harici işbirlikçiler
zh_tw: 外部合作者

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/9_entanglement_verification.ipynb>`_.
ta_in: `IBM குவாண்டம் ஆய்வகம் <https://quantum-computing.ibm.com/jupyter/tutorial/noise/9_entanglement_verification.ipynb>`_ இல் ஊடாடும் வகையில் இயக்கவும்.
zh_tw: 在 `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/9_entanglement_verification.ipynb>`_中互動執行。

source: Rohith Karur
ta_in: ரோஹித் கருர்

source: Any mixed quantum state can be identified by a density matrix, defined as $ :nbsphinx-math:`\rho `= :nbsphinx-math:`\Sigma`\ *{i} p\_i \|:nbsphinx-math:`\psi`*\ {i} :nbsphinx-math:`\rangle `:nbsphinx-math:`\langle `:nbsphinx-math:`\psi`\_{i}\| $, where :math:`|\psi_{i} \rangle` are the pure quantum states forming the mixture and :math:`0 < p_i \le 1`, :math:`\Sigma_{i} p_i = 1` are the classical probabilities to be in state :math:`|\psi_{i} \rangle`. We denote the pure density matrix of an ideal GHZ State by :math:`\rho_{p} \equiv |{\rm GHZ} \rangle \langle {\rm GHZ}|`. We want to see how close this matrix is to the density matrix of a GHZ State as produced in an experiment, :math:`\rho_{T}`. One method to quantify this similarity is to calculate the fidelity between the states, :math:`F(\rho_{p},\rho_{T})`
fr_fr: Tout état quantique mixte peut être identifié par une matrice de densité, définie comme $ :nbsphinx-math:`\rho `= :nbsphinx-math:`\Sigma`\ *{i} p\_i \|:nbsphinx-math:`\psi`*\ {i} :nbsphinx-math:`\rangle `:nbsphinx-math:`\langle `:nbsphinx-math:`\psi`\_{i}\| $, où :math:`|\psi_{i} \rangle` sont les états quantiques purs formant le mélange et :math:`0 < p_i \le 1`, :math:`\Sigma_{i} p_i = 1` sont les probabilités classiques d'être dans l'état :math:`|\psi_{i} \rangle`. Nous dénotons la matrice de densité pure d'un état de GHZ idéal par :math:`\rho_{p} \equiv |{\rm GHZ} \rangle \langle {\rm GHZ}|`. Nous voulons voir à quel point cette matrice est proche de la matrice de densité d'un Etat GHZ telle qu'elle est produite dans une expérience, :math:`\rho_{T}`. Une méthode pour quantifier cette similitude est de calculer la fidélité entre les états, :math:`F(\rho_{p},\rho_{T})`
pt_br: Qualquer estado quântico misto pode ser identificado por uma matriz densidade definida como $ :nbsphinx-math:`\rho `= :nbsphinx-math:`\Sigma`\ *{i} p\_i \|:nbsphinx-math:`\psi`*\ {i} :nbsphinx-math:`\rangle `:nbsphinx-math:`\langle `:nbsphinx-math:`\psi`\_{i}\| $, onde :math:`|\psi_{i} \rangle` são os estados quânticos puros que formam a mistura e :math:`0 < p_i \le 1`, :math:`\Sigma_{i} p_i = 1` são as probabilidades clássicas de estar no estado :math:`|\psi_{i} \rangle`. Nós denotamos a matriz de densidade pura de um Estado GHZ ideal por :math:`\rho_{p} \equiv |{\rm GHZ} \rangle \langle {\rm GHZ}|`. Queremos ver o quão próxima esta matriz está de uma matriz densidade de um estado GHZ como produzido em um experimento, :math:`\rho_{T}`. Um método para quantificar esta similaridade é calcular a fidelidade entre os estados, :math:`F(\rho_{p},\rho_{T})`

source: The aim of this tutorial is two-fold: we will explore ways in which we can characterize the GHZ state, and ways in which we can use Ignis' error mitigation tools to increase readout fidelity, regardless of characterization method
fr_fr: Le but de ce tutoriel est double: nous allons explorer des façons de caractériser l'état GHZ, et des façons dont nous pouvons utiliser la bibliothèque lgnis et ses outils d'atténuation des erreurs pour augmenter la fidélité de lecture, indépendamment de la méthode de caractérisation utilisée
pt_br: Este tutorial tem dois objetivos: vamos explorar maneiras em que podemos caracterizar o Estado GHZ, e formas nas quais podemos usar ferramentas de mitigação de erros do Ignis para aumentar a fidelidade de leitura, independentemente do método de caracterização

source: The following import from the ``entanglement`` package contains information needed to create, parallellize and analyze GHZ State circuits
fr_fr: L'importation suivante depuis le package ``entanglement`` contient les informations nécessaires pour créer, paralléliser et analyser les circuits d'état GHZ
pt_br: A importação a seguir do pacote ``entanglement`` contém informações necessárias para criar, paralelizar e analisar circuitos do Estado GHZ

source: The following function creates this "linear" circuit that can measure the GHZ state:
fr_fr: La fonction suivante crée ce circuit "linéaire" qui peut mesurer l'état GHZ:
pt_br: A função a seguir cria esse circuito "linear" que pode medir o Estado GHZ:

source: Multiple Quantum Coherence (MQC) works by taking the preliminary preparation of an :math:`n` qubit GHZ State, and rotating each of the qubit states around the z axis by a phase :math:`\phi`. After that, we apply a X gate, i.e., a :math:`\pi` pulse around the x axis. Then, we apply the inverse of the operations we originally applied to get the GHZ state. In an ideal situation the final state is :math:`|\psi \rangle = \frac{|0 \rangle ^{\otimes n} + e^{i n \phi}|1 \rangle ^{\otimes n}}{\sqrt{2}}`. We can ideally observe the phase collected by projecting :math:`|\psi \rangle` onto the state $\|0 :nbsphinx-math:`\rangle `^{:nbsphinx-math:`\otimes `n} $. This technique is reminiscent of an echo sequence, and has been shown to substantially improve the fidelity during readout.
fr_fr: La Cohérence quantique multiple (MQC) fonctionne en faisant la préparation préliminaire d'un état GHZ de :math:`n` qubits et en tournant chacun des états de qubits autour de l'axe z par une phase :math:` \phi`. Après cela, nous appliquons une porte X, c'est-à-dire une impulsion de :math:`\pi` autour de l'axe x. Ensuite, nous appliquons l'inverse des opérations que nous avons initialement appliquées pour obtenir l'état GHZ. Dans une situation idéale, l'état final est :math:`| \psi \rangle = \frac { | 0 \rangle ^ { \otimes n } + e ^ { i n \phi } | 1 \rangle ^ { \otimes n } } { \sqrt{2}}`. Idéalement nous pouvons observer la phase collecté en projetant :math:`| \psi \rangle` sur l'état $\ | 0 :nbsphinx-math:`\rangle ` ^ {:nbsphinx-math:` \otimes ` n } $. Cette technique rappelle une séquence d'écho et il a été démontré qu'elle améliore considérablement la fidélité au cours de la lecture.
pt_br: A Coerência Quântica Múltipla (MQC) funciona tomando a preparação preliminar de um Estado GHZ de :math:`n` qubits, e girando cada um dos estados dos qubits em torno do eixo z por uma fase :math:`\phi`. Depois disso, aplicamos uma porta X, ou seja, um pulso de :math:`\pi` em torno do eixo x. Em seguida, aplicamos o inverso das operações que originalmente aplicamos para obter o Estado GHZ. Em uma situação ideal o estado final é :math:`|\psi \rangle = \frac{|0 \rangle ^{\otimes n} + e^{i n \phi}|1 \rangle ^{\otimes n}}{\sqrt{2}}`. Podemos observar idealmente a fase coletada projetando :math:`|\psi \rangle` sobre o estado $\|0 :nbsphinx-math:`\rangle `^{:nbsphinx-math:`\otimes `n} $. Esta técnica é reminiscente de uma sequência de eco, e foi mostrado que ela melhora substancialmente a fidelidade durante a leitura.
