Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/9_entanglement_verification.po
Languages: bn_bn, es_un, fr_fr, ja_jp, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: This page was generated from `tutorials/noise/9_entanglement_verification.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/noise/9_entanglement_verification.ipynb`__-থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/noise/9_entanglement_verification.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/noise/9_entanglement_verification.ipynb`__.
ja_jp: 当ページは `tutorials/noise/9_entanglement_verification.ipynb`__ から生成されました。
pt_br: Esta página foi gerada a partir de `tutorials/noise/9_entanglement_verification.ipynb`__.
ru_ru: Эта страница создана на основе `tutorials/noise/9_entanglement_verification.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/noise/9_entanglement_verification.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
tr_tr: Bu sayfa `tutorials/noise/9_entanglement_verification.ipynb`__ adresinden oluşturuldu.
zh_tw: 此頁面是從 `tutorials/noise/9_entanglement_verification.ipynb`__ 產生的。

source: Entanglement Verification
bn_bn: এনট্যাঙ্গেলমেন্ট এর প্রতিপাদন
es_un: Verificación de Entrelazamiento
fr_fr: Vérification de l'intrication
ja_jp: エンタングルメント検証
pt_br: Verificação De Entrelaçamento
ru_ru: Проверка запутанности
ta_in: என்டான்கில்மெண்ட் சரிபார்ப்பு
tr_tr: Dolanıklık Doğrulaması
zh_tw: 糾纏驗證

source: Introduction to the GHZ state
bn_bn: GHZ (জি এইচ জেড) অবস্থার ভূমিকা
es_un: Introducción al estado GHZ
fr_fr: Introduction à l'état GHZ
ja_jp: GHZ 状態の概要
pt_br: Introdução ao Estado GHZ
ru_ru: Знакомство с состоянием GHZ
ta_in: GHZ நிலையின் முன்னுரை
tr_tr: GHZ durumuna giriş
zh_tw: GHZ 狀態簡介

source: **The Greenberger-Horne-Zeilinger (GHZ)** State is a :math:`n`-qubit entangled state best defined by the following state vector:
bn_bn: **গ্রীনবেরগের-হর্ন-জেলিংয়ের (জি এইচ জেড )** অবস্থা হলো একটি :math:`n`-কিউবিট বিজড়িত (এনট্যাঙ্গেল) অবস্থা যেটিকে এই অবস্থা নির্ণায়ক দিকরাশি (স্টেট ভেক্টর) দিয়ে দেখানো যেতে পারে:
es_un: **El estado de Greenberger-Horne-Zeilinger (GHZ)** es un estado entrelazado de :math:`n` qubits mejor definido por el siguiente vector de estado:
fr_fr: **L'État Greenberger-Horne-Zeilinger (GHZ)** est un état intriqué à :math:`n`-qubit que l'on peut. définir par le vecteur d'état suivant :
ja_jp: **Greenberger-Horne-Zeilinger (GHZ)** 状態は、次の状態ベクトルで定義された :math:`n`-qubit のエンタングル状態です。
pt_br: O estado **The Greenberger-Horne-Zeilinger (GHZ)** é um entrelaçamento :math:`n`-qubit melhor definido pelo seguinte vetor de estado:
ru_ru: Состояние **Гринбергера – Хорна – Цайлингера (Greenberger-Horne-Zeilinger, GHZ)** — это запутанное состояние :math:`n`кубитов, которое характеризуется следующим вектором состояния:
ta_in: **The Greenberger-Horne-Zeilinger (GHZ)** நிலை ஒரு :math:`n`-குபிட் எண்டங்கள் நிலை சிறப்பாக வரையறுக்கப்படுகிறது பின்வரும் ஸ்டேட் வெக்டர்:
tr_tr: **Greenberger-Horne-Zeilinger (GHZ)** Durumu :math:`n`-kübitli dolaşık durumdur, en iyi aşağıdaki durum vektörü ile tanımlanır:
zh_tw: **The Greenberger-Horne-Zeilinger (GHZ)** 狀態是一個 :math:`n`-量子位元糾纏態。此糾纏態可被以下狀態向量最完美的定義:

source: Characterization of the GHZ state is very useful in assessing multi-qubit interactions, whose robustness is key to developing large scale quantum computers.
bn_bn: বড় পরিমানে কোয়ান্টাম কম্পিউটারসমূহ বিকাশের মূল চাবিকাঠি হলো বহুকিউবিট মিথস্ক্রিয়ার বলিষ্ঠতা । এই মিথস্ক্রিয়া অধিগত করতে গেলে জি এইচ জেড অবস্থার চরিত্রায়ণ (ক্যারেক্টারাইজেশন) দরকার।
es_un: La caracterización del estado GHZ es muy útil para evaluar las interacciones de múltiples qubits, cuya robustez es clave para desarrollar computadoras cuánticas a gran escala.
fr_fr: La caractérisation de l'état GHZ est très utile pour évaluer les interactions multi-qubits, dont la robustesse est une clé du développement d'ordinateurs quantiques à grande échelle.
ja_jp: GHZ状態の特性は、複数量子ビットの相互作用を評価するのにとても役立ちます。そして、その堅牢性は大規模な量子コンピュータの開発での鍵となります。
pt_br: A caracterização do Estado GHZ é muito útil na avaliação de interações entre múltiplos qubits, cuja robustez é fundamental para o desenvolvimento de computadores quânticos de grande escala.
ru_ru: Характеристика состояния GHZ очень полезна для оценки мультикубитных взаимодействий, устойчивость которых имеет ключевое значение для разработки крупномасштабных квантовых компьютеров.
ta_in: மல்டி-க்யூபிட் இடைவினைகளை மதிப்பிடுவதற்கு GHZ நிலையின் தன்மை மிகவும் பயனுள்ளதாக இருக்கும், பெரிய அளவிலான குவாண்டம் கணினிகளை உருவாக்குவதற்கு அதன் வலிமை முக்கியமானது.
tr_tr: GHZ durumunun karakterizasyonu, sağlamlığı büyük ölçekli kuantum bilgisayarları geliştirmenin anahtarı olan çoklu qubit etkileşimleri değerlendirmede çok kullanışlıdır.
zh_tw: GHZ 狀態的測量對評估多量子位元互動很有幫助，它的穩健性是開發大規模量子計算機的關鍵。

source: Characterizing a quantum state
bn_bn: কোয়ান্টাম অবস্থার (স্টেট) চরিত্রাঙ্কন
es_un: Caracterización de un estado cuántico
fr_fr: Caractérisation d'un état quantique
ja_jp: 量子状態の特徴
pt_br: Caracterizando um estado quântico
ru_ru: Описание квантового состояния
ta_in: ஒரு குவாண்டம் நிலையின் சிறப்பியல்பு
tr_tr: Kuantum durumunu karakterize etme
zh_tw: 測量一個量子態

source: Any mixed quantum state can be identified by a density matrix, defined as :math:`\rho = \sum_{i} p_i |\psi_{i} \rangle \langle \psi_{i}|`, where :math:`|\psi_{i} \rangle` are the pure quantum states forming the mixture and :math:`0 < p_i \le 1`, :math:`\sum_{i} p_i = 1` are the classical probabilities to be in state :math:`|\psi_{i} \rangle`. We denote the pure density matrix of an ideal GHZ State by :math:`\rho_{p} \equiv |{\rm GHZ} \rangle \langle {\rm GHZ}|`. We want to see how close this matrix is to the density matrix of a GHZ State as produced in an experiment, :math:`\rho_{T}`. One method to quantify this similarity is to calculate the fidelity between the states, :math:`F(\rho_{p},\rho_{T})`
bn_bn: যেকোনো মিশ্র কোয়ান্টাম অবস্থা একটি ঘনত্ব ম্যাট্রিক্স দ্বারা চিহ্নিত করা যেতে পারে, যা :math:`\rho = \sum_{i} p_i |\psi_{i} \rangle \langle \psi_{i}|`, হিসাবে সংজ্ঞায়িত করা হয়, যেখানে বিশুদ্ধ কোয়ান্টাম অবস্থা :math:`|\psi_{i} \rangle` মিশ্রণ তৈরি করেএবং আমরা :math:`0 < p_i \le 1`, :math:`\sum_{i} p_i = 1` ধ্রুপদী (ক্লাসিক্যাল) সম্ভাব্যতা কি অবস্থায় থাকতে হবে :math:`|\psi_{i} \rangle` । :math:`\rho_{p} \equiv |{\rm GHZ} \rangle \langle {\rm GHZ}|` দ্বারা একটি আদর্শ GHZ রাজ্যের বিশুদ্ধ ঘনত্বের ম্যাট্রিক্সকে নির্দেশ করি। আমরা দেখতে চাই যে এই ম্যাট্রিক্সটি GHZ রাজ্যের ঘনত্ব ম্যাট্রিক্সের কতটা কাছাকাছি একটি পরীক্ষায় উৎপাদিত হয়েছে, :math:`\rho_{T}` । এই সাদৃশ্য পরিমাপ করার একটি পদ্ধতি হল রাজ্যের মধ্যে বিশ্বস্ততা গণনা করা, :math:`F(\rho_{p},\rho_{T})` ।
es_un: Cualquier estado cuántico mixto puede identificarse mediante una matriz de densidad, definida como :math:`\rho = \sum_{i} p_i |\psi_{i} \rangle \langle \psi_{i}|`, donde :math:`|\psi_{i} \rangle` son los estados cuánticos puros que forman la mezcla y :math:`0 < p_i \le 1`, :math:`\sum_{i} p_i = 1` son las probabilidades clásicas de estar en estado :math:`|\psi_{i} \rangle`. Denotamos la matriz de densidad pura de un estado ideal de GHZ por :math:`\rho_{p} \equiv |{\rm GHZ} \rangle \langle {\rm GHZ}|`. Queremos ver qué tan cerca está esta matriz de la matriz de densidad de un estado GHZ como se produjo en un experimento, :math:`\rho_{T}`. Un método para cuantificar esta similitud es calcular la fidelidad entre los estados, :math:`F(\rho_{p},\rho_{T})`
ja_jp: 任意の混合量子状態は、 :math:`\rho = \sum_{i} p_i |\psi_{i} \rangle \langle \psi_{i}|` として定義された密度行列で識別できます。このとき :math:`|\psi_{i} \rangle` は混合状態を形成する純粋状態を表し、 :math:`0 < p_i \le 1`, :math:`\sum_{i} p_i = 1` は :math:`|\psi_{i} \rangle` の状態をとる古典の確率を示しています。理想的なGHZ状態の純粋密度行列を :math:`\rho_{p} \equiv |{\rm GHZ} \rangle \langle {\rm GHZ}|` で表します。この行列が実験で生成されたGHZ状態の密度行列 :math:`\rho_{T}` にどれだけ近いかを見るために、この類似性を定量化する一つの方法として、状態間の忠実度 :math:`F(\rho_{p},\rho_{T})` を計算します。
ru_ru: Любое смешанное квантовое состояние может быть задано матрицей плотности, которую определяют как :math:`\rho = \sum_{i} p_i |\psi_{i} \rangle \langle \psi_{i}|`, где :math:`|\psi_{i} \rangle` — чистые квантовые состояния, образующие смешанное состояние, а :math:`0 < p_i \le 1`, :math:`\sum_{i} p_i = 1` — классические вероятности находиться в состоянии :math:`|\psi_{i} \rangle`. Обозначим матрицу плотности чистого идеального состояния GHZ через :math:`\rho_{p} \equiv |{\rm GHZ} \rangle \langle {\rm GHZ}|`. Мы хотим узнать, насколько близка эта матрица к матрице плотности GHZ состояния, полученной в эксперименте :math:`\rho_{T}`. Одним из методов количественной оценки этого сходства является вычисление точности воспроизведения состояния, :math:`F(\rho_{p},\rho_{T})`
ta_in: எந்த கலப்பு குவாண்டம் நிலையையும் டென்சிட்டி மேட்ரிஸ் மூலம் அடையாளம் காணலாம், இது வரையறுக்கப்படுகிறது :math:`\rho = \sum_{i} p_i |\psi_{i} \rangle \langle \psi_{i}|`, எங்கே :math:`|\psi_{i} \rangle` என்பது கலவையை உருவாக்கும் தூய குவாண்டம் நிலைகள் மற்றும் :math:`0 < p_i \le 1`, :math:`\sum_{i} p_i = 1` என்பது கிளாசிக்கல் நிகழ்தகவுகள் நிலை :math:`|\psi_{i} \rangle`. ஒரு சிறந்த GHZ மாநிலத்தின் தூய டென்சிட்டி மேட்ரிஸ் நாங்கள் குறிக்கிறோம் :math:`\rho_{p} \equiv |{\rm GHZ} \rangle \langle {\rm GHZ}|`. ஒரு பரிசோதனையில் தயாரிக்கப்பட்ட GHZ நிலையின் டென்சிட்டி மேட்ரிஸுடன் இந்த அணி எவ்வளவு நெருக்கமாக உள்ளது என்பதைப் பார்க்க விரும்புகிறோம் :math:`\rho_{T}`. இந்த ஒற்றுமையை அளவிடுவதற்காக நிலைகளுக்கிடையிலான சரிபார்த்தல்யைக் கணக்கிடும் ஒரு வகை, :math:`F(\rho_{p},\rho_{T})`
tr_tr: Herhangi bir karışık kuantum durumu, $ :nbsphinx-math:`\rho `= :nbsphinx-math:`\Sigma`\ *{i} p\_i \|:nbsphinx-math:`\psi`*\ {i} :nbsphinx-math:`\rangle `:nbsphinx-math:`\langle `:nbsphinx-math:`\psi`\_{i}\| $ olarak tanımlanan bir yoğunluk matrisi ile tanımlanabilmektedir. Burada :math:`|\psi_{i} \rangle`, karışımı oluşturan saf kuantum durumlarıdır ve :math:`0 < p_i \le 1`, :math:`\Sigma_{i} p_i = 1` :math:`|\psi_{i} \rangle` durumundaki klasik olasılıklardır. İdeal bir GHZ Durumunun saf yoğunluk matrisini :math:`\rho_{p} \equiv |{\rm GHZ} \rangle \langle {\rm GHZ}|` şeklinde ifade ediyoruz. Bu matrisin, bir deneyde üretilen GHZ Durumunun yoğunluk matrisine ne kadar yakın olduğunu görmek istiyoruz, :math:`\rho_{T}`. Bu benzerliği ölçmenin bir yöntemi, durumlar arasındaki aslına doğruluğu hesaplamaktır, :math:`F(\rho_{p},\rho_{T})`
zh_tw: 任何混合量子態都可以通過定義為 :math:`\ rho = \sum_{i} p_i |\psi_{i} \rangle \langle \psi_{i}|`的密度矩陣來識別，其中 :math:`|\psi_{i} \rangle` 是用來形成混合態的純態，而 :math:`0 < p_i \le 1`, :math:`\sum_{i} p_i = 1` 是處於狀態 :math:`|\psi_{i} \rangle` 的經典概率。 我們將理想的GHZ態的純密度矩陣表示為 :math:`\rho_{p} \equiv |{\rm GHZ} \rangle \langle {\rm GHZ}|`。 我們想要查看此密度矩陣和實驗產生的 GHZ狀態密度矩陣 :math:`\rho_{T}` 之間距離多遠。有一種方法可以藉由計算其狀態之間的保真度 :math:`F(\rho_{p},\rho_{T})`，以量化此相似性。

source: The aim of this tutorial is two-fold: we will explore ways in which we can characterize the GHZ state, and ways in which we can use Ignis’ error mitigation tools to increase readout fidelity, regardless of characterization method
bn_bn: এই পাঠসমূহ দ্বারা আমরা দুটো জিনিস পরখ করতে চাই। প্রথমত, জি এইচ জেড স্থিতির চরিত্রায়ন কতভাবে করা সম্ভব। এবং, দ্বিতীয়ত, সেই চরিত্রায়ণ (ক্যারেক্টারাইজেশন) পদ্ধতি নির্বিশেষে কিভাবে আমরা ইগ্নিস -এর ত্রুটি দূরীকরণ যন্ত্রগুলির সাহায্যে রিডআউট বিশ্বস্ততা বাড়াতে পারি।
es_un: El objetivo de este tutorial es doble: exploraremos formas en las que podemos caracterizar el estado GHZ, y formas en las que podemos utilizar las herramientas de mitigación de errores de Ignis para aumentar la fidelidad de lectura, independientemente del método de caracterización
ja_jp: このチュートリアルの目的は2つあります。 GHZ 状態を特徴付ける方法と、特性評価方法に関係なく、 Ignis の誤り軽減ツールを使用して読み出しの忠実度を向上させる方法を探ります。
ru_ru: Это руководство преследует две цели: мы рассмотрим способы, с помощью которых можно охарактеризовать состояние GHZ, и методы, с помощью которых можно использовать инструменты Ignis для уменьшения ошибок, чтобы повысить точность считывания независимо от метода характеризации
ta_in: இந்த பயிற்சிகயின் நோக்கம் இரண்டு மடங்கு ஆகும்: GHZ நிலையை நாம் வகைப்படுத்தக்கூடிய வழிகளையும், மற்றும் தன்மை முறையைப் பொருட்படுத்தாமல், வாசிப்பு சரிபார்த்தலை அதிகரிக்க Ignis’ பிழை குறைத்தல் கருவிகளைப் பயன்படுத்தக்கூடிய வழிகளையும் ஆராய்வோம்
tr_tr: Bu eğitimin amacı iki yönlüdür: GHZ durumunu karakterize edebileceğimiz yolları ve karakterizasyon yönteminden bağımsız olarak okuma ve doğruluğunu artırmak için Ignis'in hata azaltma araçlarını kullanabileceğimiz yolları keşfedeceğiz
zh_tw: 本教程的目的有兩方面：我們將探索測量 GHZ 狀態的方式，以及可以利用 Ignis 的錯誤緩解工具以增加讀出保真度的方式，不論其測量方法。

source: Before we go further, let us import everything we will need from basic Qiskit:
bn_bn: এগোনোর আগে মূল Qiskit থেকে আমাদের যাকিছু লাগতে পারে তা আমরা এখানে ইম্পোর্ট বা আনীত করে নেবো।
es_un: Antes de ir más lejos, importemos todo lo que necesitaremos de Qiskit:
fr_fr: Avant d'aller plus loin, importons tout ce dont nous aurons besoin à partir du Qiskit de base:
ja_jp: 先に進む前に、基本的なQiskitから必要なものをすべてインポートしてみましょう。
pt_br: Antes de irmos mais longe, vamos importar tudo o que precisaremos do Qiskit básico:
ru_ru: Прежде чем мы продолжим, давайте импортируем все, что нам понадобится из базового Qiskit:
ta_in: நாம் மேலும் செல்வதற்கு முன், நமக்கு தேவையான அனைத்தையும் அடிப்படை Qiskitலிருந்து இறக்குமதி செய்வோம்:
tr_tr: Daha fazla ilerlemeden önce, temel Qiskit'ten ihtiyacımız olan her şeyi içe aktaralım:
zh_tw: 在我們進一步之前，讓我們從基本的 Qiskit 匯入我們將需要的所有東西：

source: The next two functions are from ignis. The first is for the general error mitigation technique, and the second is specifically for quantum tomography
bn_bn: পরের দুটো অন্বয় (ফাংশন) ইগ্নিস থেকে নেওয়া। প্রথমটি সাধারণ ত্রুটি দূরীকরণ পদ্ধতির জন্যে এবং দ্বিতীয়টি বিশেষভাবে কোয়ান্টাম টমোগ্রাফির জন্যে।
es_un: Las siguientes dos funciones son de ignis, la primera es para la técnica general de mitigación de errores, y la segunda es específicamente para la tomografía cuántica
fr_fr: Les deux fonctions suivantes sont issues dl'ignis. La première concerne la technique générale d'atténuation des erreurs, et la seconde est spécifique pour la tomographie quantique
ja_jp: 次の2つの機能は、Ignisからのものです。1つ目は一般的な誤り軽減手法、2つ目は量子トモグラフィー用です。
pt_br: As duas próximas funções são do ignis. A primeira é para a técnica geral de mitigação de erros, e a segunda é especificamente para a tomografia quântica
ru_ru: Следующие две функции взяты из Ignis. Первая — для общей техники уменьшения ошибок, вторая — для квантовой томографии
ta_in: அடுத்த இரண்டு செயல்பாடுகள் Ignisலிருந்து வந்தவை. முதலாவது பொதுவான பிழையை குறைத்தல் நுட்பத்திற்காகவும், மற்றும் இரண்டாவது குறிப்பாக குவாண்டம் முப்பரிமாண வரவிகஂகாகவும் ஆகுமஂ
tr_tr: Sonraki iki fonksiyon ignis'den. Birincisi genel hata azaltma tekniği için, ikincisi ise özellikle kuantum tomografisi içindir
zh_tw: 接下來的兩個功能來自 ignis。 第一個是針對一般的錯誤緩解技術，而第二個是專門用於量子斷層掃描。

source: The following import from the ``entanglement`` package contains information needed to create, parallelize and analyze GHZ State circuits
bn_bn: GHZ স্টেট সার্কিটগুলি তৈরি, সমান্তরাল এবং বিশ্লেষণের জন্য প্রয়োজনীয় তথ্য ``entanglement`` প্যাকেজ থেকে নিম্নলিখিত গুলি আমদানি করে
es_un: La siguiente importación del paquete ``entanglement`` contiene la información necesaria para crear, paralelizar y analizar circuitos de Estado GHZ
ja_jp: 次の、``entanglement`` パッケージからのインポートには、GHZ状態回路の作成、並列化、分析に必要な情報が含まれています。
ru_ru: Следующие импортирования из пакета ``entanglement`` содержат информацию, необходимую для создания, параллелизации и анализа схем состояния GHZ
ta_in: ``என்டான்கில்மெண்ட்`` பேக்கேஜிலிருந்து பின்வரும் இறக்குமதி GHZ நிலை சர்கூட்களை உருவாக்க இணையாக மற்றும் பகுப்பாய்வு செய்யத் தேவையான தகவல்களைக் கொண்டுள்ளது
tr_tr: Aşağıdaki ``entanglement``(dolanıklık) paketinden içe aktarma, GHZ Durum devrelerini oluşturmak, paralelleştirmek ve analiz etmek için gereken bilgileri içermektedir
zh_tw: 以下從 ``entanglement`` 套件匯入的項目包含建立、平行化及分析 GHZ 狀態電路所需的資訊

source: Preparing a GHZ State
bn_bn: জি এইচ জেড অবস্থা (স্টেট) তৈরি করা
es_un: Preparación de un estado GHZ
fr_fr: Préparation d'un état GHZ
ja_jp: GHZ状態の準備
pt_br: Preparando um Estado GHZ
ru_ru: Подготовка состояния GHZ
ta_in: GHZ நிலையைத் தயாரித்தல்
tr_tr: Bir GHZ durumu hazırlama
zh_tw: 準備一個 GHZ 狀態

source: Let us first go over how to prepare a GHZ State:
bn_bn: কিভাবে জি এইচ জেড অবস্থা (স্টেট) আমরা তৈরি করতে পারি সেটা আমরা প্রথমে দেখবো:
es_un: Primero repasemos cómo preparar un estado GHZ:
fr_fr: Voyons d'abord comment préparer un État GHZ:
ja_jp: まず、GHZ状態を準備する方法について説明します。
pt_br: Vamos primeiro ver como preparar um estado GHZ:
ru_ru: Давайте сначала рассмотрим вопрос о том, как подготовить состояние GHZ:
ta_in: GHZ நிலையை எவ்வாறு தயாரிப்பது என்பதை முதலில் பார்ப்போம்:
tr_tr: İlk olarak GHZ durumunun nasıl hazırlanacağını ele alalım:
zh_tw: 讓我們先一起來看如何準備一個 GHZ 狀態：

source: Say we have a system of :math:`n` qubits, all prepared in the :math:`|0\rangle` state:
bn_bn: ধরো আমাদের কাছে :math:`|0\rangle` অবস্থার (স্টেট) :math:`n` -টি কিউবিট সম্পন্ন একটা সিস্টেম আছে:
es_un: Digamos que tenemos un sistema de :math:` n ` qubits, todos preparados en el estado :math:`|0\rangle`:
fr_fr: Disons que nous avons un système de :math:`n` qubits, tous préparés dans l'état :math:` |0\rangle`:
ja_jp: すべて :math:`|0\rangle` 状態で準備された :math:`n` 量子ビットのシステムがあるとします。
pt_br: Digamos que temos um sistema de :math:`n` qubits, todos preparados no estado :math:`|0\rangle`:
ru_ru: Допустим, у нас есть система из :math:`n` кубитов, все они находятся в состоянии :math:`|0\rangle`:
ta_in: எங்களிடம் :math:`n` க்யூபிட்ஸ் அமைப்பு இருப்பதாக வைத்திருங்கள், அனைத்தும் :math:`|0\rangle` நிலையில் தயாரிக்கப்பட்டுள்ளன:
tr_tr: Hepsi :math:`|0\rangle` durumunda hazırlanmış :math:`n` kübitli bir sistemimiz oldugunu varsayalım.
zh_tw: 假設我們有一個 :math:`n` 量子位元的系統，這些 :math:`n` 個量子位元都被準備在 :math:`|0\rangle` 狀態中：

source: We apply a Hadamard gate to the first qubit: :math:`|0\rangle \longrightarrow \frac{1}{\sqrt{2}}(|0\rangle + |1\rangle)`. Our state now looks like:
bn_bn: প্রথম কিউবিট এর ওপরে আমরা হ্যাডামার্ড যুক্তিবর্তনী লাগলে পাই: :math:`|0\rangle \longrightarrow \frac{1}{\sqrt{2}}(|0\rangle + |1\rangle)` । এখুন এই পর্যায়ে আছি আমরা:
es_un: Aplicamos una compuerta Hadamard al primer qubit: :math:`|0\rangle \longrightarrow \frac{1}{\sqrt{2}}(|0\rangle + |1\rangle)`. Nuestro estado ahora se ve así:
fr_fr: Nous appliquons une porte Hadamard au premier qubit: :math:`|0\rangle \longrightarrow \frac{1}{ \sqrt{2}} (| 0\rangle + | 1\rangle)`. Notre état se présente maintenant comme suit:
ja_jp: 最初の量子ビットにアダマールゲートを適用します： :math:`|0\rangle \longrightarrow \frac{1}{\sqrt{2}}(|0\rangle + |1\rangle)` 。状態は次のようになります。
pt_br: Aplicamos uma porta Hadamard ao primeiro qubit: :math:`|0\rangle \longrightarrow \frac{1}{\sqrt{2}}(|0\rangle + |1\rangle)`. Nosso estado agora se parece com:
ru_ru: Мы применим вентиль Адамара к первому кубиту: :math:`|0\rangle \longrightarrow \frac{1}{\sqrt{2}}(|0\rangle + |1\rangle)`. Теперь наше состояние выглядит следующим образом:
ta_in: முதல் க்யூபிட்டிற்கு நாம் ஒரு ஹாட்மார்ட் கேட் பயன்படுத்துகிறோம் :math:`|0\rangle \longrightarrow \frac{1}{\sqrt{2}}(|0\rangle + |1\rangle)` . நம் நிலை இப்போது:
tr_tr: İlk kübite Hadamard kapısı uygularız: :math:`|0\rangle \longrightarrow \frac{1}{\sqrt{2}}(|0\rangle + |1\rangle)`. Böylece şimdiki durumumuz şöyle görünüyor:
zh_tw: 我們將 Hadamard 閘套用至第一個量子位元：:math:`|0\rangle \longrightarrow \frac{1}{\sqrt{2}}(|0\rangle + |1\rangle)`。 我們現在的狀態看起來如下：

source: Applying on this state a sequence of :math:`n-1` CNOT gate between the :math:`n^{th}` and :math:`(n+1)^{th}` qubits for :math:`n = 0 \ldots n-1` leaves the :math:`n+1` qubit at :math:`|0\rangle` if the :math:`n^{th}` is in :math:`|0\rangle`, and at :math:`|1\rangle` if the :math:`n^{th}` is in :math:`|1\rangle`, thus creating the GHZ State:
bn_bn: এই অবস্থায় যদি :math:`n^{th}` :math:`|0\rangle` এ থেকে তাহলে :math:`n^{th}` থেকে :math:`(n+1)^{th}` কিউবিটগুলিতে (এখানে :math:`n = 0 \ldots n-1`) :math:`n-1` -টা CNOT গেট এর ক্রম প্রয়োগ করলে :math:`n+1` -তম কিউবিট টা :math:`|0\rangle` এ পরিনত হবে। যদি :math:`n^{th}` টা :math:`|1\rangle` এ থাকে তবে :math:`n^{th}` :math:`|1\rangle` এ থাকবে। এইভাবে জি এইচ জেড স্থিতি তৈরি হয়ে যায়:
es_un: Aplicando a este estado una secuencia de :math:`n-1` compuerta CNOT entre el :math:`n^{th}` y :math:`(n+1)^{th}` qubits para :math:`n = 0 \ldots n-1` se deja el qubit :math:`n+1` en :math:`|0\rangle` si el :math:`n^{th}` está en :math:`|0\rangle`, y en :math:`|1\rangle` si el :math:`n^{th}` está en :math:`|1\rangle`, creando así el estado GHZ:
fr_fr: Sur cet état, l'application d'une séquence de :math:`n-1` CNOT entre le :math:`n^{ieme}` et le :math:`(n+1)^{ieme}` qubits pour :math:`n = 0 \ldots n-1` laisse le qubit :math:`n+1` à :math:`|0\rangle` si le :math:`n^{th}` est dans l'état :math:`|0\rangle`, et :math:`|1\rangle` si le :math:`n^{ieme}` qubit est en :math:`|1\rangle`, créant ainsi l'état GHZ:
ja_jp: この状態に、 :math:`n = 0 \ldots n-1` の :math:`n` 番目と :math:`(n+1)` 番目の量子ビットの間に :math:`n-1` CNOTゲートのシーケンスを適用すると、 :math:`n` 番目が :math:`|0\rangle` の場合は :math:`n+1` 番目の量子ビットは :math:`|0\rangle` のまま、 :math:`n` 番目が :math:`|1\rangle` の場合は :math:`|1\rangle` になるGHZ状態が作成されます。
pt_br: Aplicando neste estado uma sequência de :math:`n-1` portas CNOT entre os qubits :math:`n^{th}` e :math:`(n+1)^{th}` para :math:`n = 0 \ldots n-1` deixa o qubit :math:`n+1` em :math:`|0\rangle` se o :math:`n^{th}` estiver em :math:`|0\rangle`, e em :math:`|1\rangle` se o :math:`n^{th}` estiver em :math:`|1\rangle`, criando assim o Estado GHZ:
ru_ru: Применение к этому состоянию последовательности из :math:`n-1` операторов CNOT между кубитами :math:`n` и :math:`(n+1)` для :math:`n = 0 \ldots n-1` оставляет :math:`n+1` кубит в состоянии :math:`|0\rangle`, если :math:`n^{й}` кубит находится в :math:`|0\rangle`, и переводит в :math:`|1\rangle`, если :math:`n^{й}` кубит находится в состоянии :math:`|1\rangle`, создавая таким образом состояние GHZ:
ta_in: இந்த நிலையில் :math:`n-1` CNOT கேடின் வரிசையின் மூலம் :math:`n^{th}` மற்றும் :math:`(n+1)^{th}` க்யூபிட்ஸ்களுக்கு இடையில் :math:`n = 0 \ldots n-1` யில் :math:`n+1` க்யூபிட்ஸ் வெளியேறுகிறது என்றால் அது :math:`|0\rangle` யில் :math:`n^{th}` :math:`|0\rangle` ஆகவும் மற்றும் அது :math:`|1\rangle` யில் :math:`n^{th}` :math:`|1\rangle` ஆகவும் இருக்கும், இதனால் GHZ நிலையை உருவாக்குகிறது:
tr_tr: :math:`n^{th}` ve :math:`(n+1)^{th}` kübitleri arasında bu duruma bir seri :math:`n-1` CNOT kapısı uygulamak, eğer :math:`n^{th}` , :math:`|0\rangle` da ise :math:`n+1` kübitini :math:`|0\rangle` da ve eğer :math:`n^{th}` , :math:`|1\rangle` da ise :math:`n+1` kübitini, :math:`|1\rangle` da bırakır. Bu nedenle GHZ durumunun oluşturulması:
zh_tw: 把一個在第 :math:`n^{th}` 和第 :math:`(n+1)^{th}` 對應於 :math:`n = 0 \ldots n-1`的量子位元之間的 :math:`n-1` CNOT 閘的序列套用到此狀態上，如果第 :math:`n^{th}` 是處於 :math:`|0\rangle` 則使得第 :math:`n+1` 個量子位元處於 :math:`|0\rangle`，如果第 :math:`n^{th}` 是處於 :math:`|1\rangle` 則使得第 :math:`n+1` 個量子位元處於 :math:`|1\rangle`。如此我們則可以建立一個 GHZ 態。

source: The following function creates this “linear” circuit that can measure the GHZ state:
bn_bn: নিম্নলিখিত ফাংশনটি এই "রৈখিক" সার্কিট তৈরি করে যা কিনা জি এইচ জেড অবস্থা (স্টেট) পরিমাপ করতে পারে:
es_un: La siguiente función crea este circuito “lineal” que puede medir el estado GHZ:
ja_jp: 次の関数は、GHZ状態を測定できる “線形” 回路を生成します。
ru_ru: Следующая функция создает эту "линейную" цепь, которая может измерить состояние GHZ:
ta_in: பின்வரும் செயல்பாடு GHZ நிலையை அளவிடக்கூடிய இந்த “நேரியல்” சர்கூட்களை உருவாக்குகிறது:
tr_tr: Aşağıdaki fonksiyon, GHZ durumunu ölçebilecek bu "doğrusal" devreyi oluşturur:
zh_tw: 以下函數會建立可以測量 GHZ 狀態的這個 “線性” 電路：

source: Characterization, Part I
bn_bn: চরিত্রায়ণ (ক্যারেক্টারাইজেশন), অধ্যায় ১
es_un: Caracterización, Parte I
fr_fr: Caractérisation, Partie I
ja_jp: 特性、Part I
pt_br: Caracterização, Parte I
ru_ru: Характеризация, Часть I
ta_in: தன்மை, பகுதி I
tr_tr: Karakterizasyon, Bölüm 1
zh_tw: 測量，第一部分
