Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/9_entanglement_verification.po
Languages: bn_bn, es_un, fr_fr, ja_jp, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: After running experiments on this MQC circuit, we can pick a state to observe oscillations as we sweep :math:`\phi` from :math:`0` to :math:`2 \pi`. Our signal in theory should follow :math:`S(\phi) = \frac{1}{2}(1+cos(n \phi))`. We then perform a Discrete Fourier Transform (DFT: :math:`I_{v}=(1/N)|\Sigma_{\phi}e^{iv\phi}S(\phi)`) to extract the Fidelity of the state, defined by the bounds :math:`2\sqrt{I_{n}} \leq F \leq \sqrt{I_{0}/2}+ \sqrt{I_{n}}`; if desired, an actual value for the fidelity can be obtained: :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1})+\sqrt{I_{n}})` (arXiv:1905.05720).
fr_fr: Après avoir exécuté les expériences sur ce circuit MQC, nous pouvons choisir un état pour observer les oscillations lorsque nous balayons :math:`\phi` de :math:`0` à :math:`2 \pi`. Notre signal en théorie devrait suivre :math:`S(\phi) = \frac{1}{2}(1+cos(n \phi))`. Nous effectuons ensuite une Transformation de Fourier Discrete (DFT: :math:`I_{v}=(1/N)|\Sigma_{\phi}e^{iv\phi}S(\\phi)`) pour extraire la fidélité de l'état, défini par les limites :math:`2\sqrt{I_{n}} \leq F \leq \sqrt{I_{0}/2}+ \sqrt{I_{n}}`; si désiré, une valeur réelle pour la fidélité peut être obtenue : :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1})+\sqrt{I_{n}})` (arXiv:1905. 5720).
pt_br: Depois de executar experimentos neste circuito MQC, nós podemos escolher um estado para observar oscilações enquanto varremos :math:`\phi` de :math:`0` a :math:`2 \pi`. Em teoria, nosso sinal deve seguir :math:`S(\phi) = \frac{1}{2}(1+cos(n \phi))`. Em seguida, realizamos uma Transformada Discreta de Fourier (DFT: :math:`I_{v}=(1/N)|\Sigma_{\phi}e^{iv\phi}S(\phi)`) para extrair a Fidelidade do estado, definida pelos limites :math:`2\sqrt{I_{n}} \leq F \leq \sqrt{I_{0}/2}+ \sqrt{I_{n}}`; caso deseje, um valor real para a fidelidade pode ser obtido: :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1})+\sqrt{I_{n}})` (arXiv:1905.05720).

source: The next method we use to characterize the GHZ state is parity oscillations. After preparing a GHZ state, we apply a combination of rotations about the x and y axes to create various superposition states as a function of :math:`\phi`: :math:`U(\phi) = \otimes_{j}^{N} e^{i\frac{\pi}{4}(cos(\phi)\sigma_{x}^{j}+sin(\phi)\sigma_{y}^{j})}`. We then measure the expectation value :math:`\langle \otimes_{j}^{N} \sigma_{z}^{j} \rangle_{\phi}` as a function of :math:`\phi`, which in theory should lead to parity oscillations between 1 and -1.
fr_fr: La méthode suivante que nous utilisons pour caractériser l'état de GHZ s'appuie sur les oscillations de parité. Après avoir préparé un état GHZ, nous appliquons une combinaison de rotations sur les axes x et y pour créer différents états de superposition en fonction de :math:`\phi`: :math:`U(\phi) = \otimes_{j}^{N} e^{i\frac{\pi}{4}(cos(\phi)\sigma_{x}^{j}+sin(\phi)\sigma_{y}^{j})}`. Nous mesurons ensuite la valeur attendue :math:`\langle \otimes_{j}^{N} \sigma_{z}^{j} \rangle_{\phi}` en fonction de :math:`\phi`, qui en théorie devrait conduire à des oscillations de parité entre 1 et -1.
pt_br: O próximo método que usamos para caracterizar o estado GHZ é as oscilações de paridade. Após preparar um estado GHZ, aplicamos uma combinação de rotações sobre os eixos x e y para criar vários estados de superposição como uma função de :math:`\phi`: :math:`U(\phi) = \otimes_{j}^{N} e^{i\frac{\pi}{4}(cos(\phi)\sigma_{x}^{j}+sin(\phi)\sigma_{y}^{j})}`. Em seguida, medimos o valor esperado :math:`\langle \otimes_{j}^{N} \sigma_{z}^{j} \rangle_{\phi}` como uma função de :math:`\phi`, o que, em teoria, deveria levar a oscilações de paridade entre 1 e -1.

source: The above "linear" circuits are good to perform simulations, but what do we do when we use real devices, where the system can have an arbitrary topology and various errors? We are specifically targeting real hardware here, not just Aer simulation. One technique to reduce real-hardware effects is to parallelize the CNOT gates and thus create a shorter-depth circuit. This can be hugely beneficial efficiency wise, and fidelity wise. The class ``BConfig`` from the module ``parallelize`` does exactly this.
fr_fr: Les circuits "linéaires" ci-dessus sont bons pour effectuer des simulations, mais comment faire lorsque nous utilisons des dispositifs réels, où le système peut avoir une topologie arbitraire et diverses erreurs? Nous ciblons spécifiquement le matériel réel ici, pas seulement la simulation Aer. Une technique pour réduire les effets du matériel réel est de paralléliser les portes CNOT et ainsi créer un circuit plus court. Cela peut être extrêmement bénéfique en termes d'efficacité et de fidélité. La classe ``BConfig`` du module ``parallelize`` fait exactement cela.
pt_br: Os circuitos "lineares" acima são bons para realizar simulações, mas o que fazemos quando utilizamos dispositivos reais, onde o sistema pode ter uma topologia arbitrária e vários erros? Estamos especificamente mirando em hardware real aqui, não apenas simulações do Aer. Uma técnica para reduzir efeitos reais de hardware é paralelizar as portas CNOT e, assim, criar um circuito de menor profundidade. Isso pode ser enormemente benéfico com relação à eficiência e à fidelidade. A classe ``BConfig`` do módulo ``parallelize`` faz exatamente isto.

source: Using the ``noise`` module, we can now define a noise model from ``'ibmq_16_melbourne'`` to "assign" to ``'ibmq_qasm_simulator'``.
fr_fr: A l'aide du module ``bruit``, nous pouvons maintenant définir un modèle de bruit de `` ibmq_16_melbourne`` à "assigner" à ``ibmq_qasm_simulateur``.
pt_br: Utilizando o módulo ``noise``, podemos agora definir um modelo de ruído a partir do ``'ibmq_16_melbourne'`` para "atribuir" ao ``'ibmq_qasm_simulator'``.

source: ``BConfig`` lays the blueprint for creating paralellized circuits. Let us initialize an object taking in the real device we just defined, and name it ``protocirc``. All of our experiments will use it:
fr_fr: ``BConfig`` définit le cadre pour créer des circuits parallélisés. Initialisons un objet en prenant le device réel que nous venons de définir, et nommons le ``protocirc``. Toutes nos expériences l'utiliseront :
pt_br: ``BConfig`` estabelece a planta para a criação de circuitos paralelos. Vamos inicializar um objeto pegando o dispositivo real que acabamos de definir, e nomeá-lo ``protocirc``. Todos os nossos experimentos vão usá-lo:

source: We now retrieve a parallellized MQC circuit for the n qubit device
fr_fr: Nous récupérons maintenant un circuit MQC parallèle pour le système de n qubit
pt_br: Recuperamos agora um circuito de MQC paralelizado para o dispositivo de n qubits

source: Now we get started on error mitigation. We create an identical quantum register and use complete\_meas\_cal from Ignis, to create circuits for calibrated measurements to be excecuted, and a calibration matrix.
fr_fr: Maintenant, nous pouvons commencer l'attenuation des . Nous créons un registre quantique identique nous utilisons complete\_meas\_cal d'Ignis pour créer des circuits à executer pour des mesures de calibration, et une matrice d'étalonnage.
pt_br: Agora começamos com a mitigação de erros. Criamos um registrador quântico idêntico e usamos complete\_meas\_cal do Ignis para criar circuitos para as medições calibradas serem executadas, e uma matriz de calibração.

source: We now retrieve a parallellized Parity Oscillation circuit for the n qubit device, and run experiments in the same fashion as we did in MQC.
fr_fr: Nous récupérons maintenant un circuit de Parity Oscillation parallélisé pour un système à n qubits, et nous exécutons des expériences de la même façon que nous l'avons fait au MQC.
pt_br: Agora nós recuperamos um circuito de Oscilação de Paridade paralelizado para o dispositivo de n qubits, e executamos experimentos da mesma forma que fizemos no MQC.

source: We can see how error mitigation dramatically improves our measurement (much more so in PO than in MQC). Let us quantify this using the same DFT method we used in MQC, and calulating the actual fidelities:
fr_fr: Nous pouvons voir comment l'atténuation des erreurs améliore considérablement notre mesure (beaucoup plus en PO qu'au MQC). Quantifions- ceci en utilisant la même méthode DFT que nous avons utilisée dans le MQC, et calculant les fidélités réelles:
pt_br: Podemos ver como a mitigação de erros melhora drasticamente nossa medição (muito mais em PO do que em MQC). Vamos quantificar isso usando o mesmo método DFT que utilizamos em MQC e calculando as fidelidades reais:

source: As we see, the raw fidelity is much lower than what is acheived with MQC, but the error mitigated result is about the same.
fr_fr: Comme nous le voyons, la fidélité brute est beaucoup plus faible que ce qui est obtenu avec les Oscillations MQC ou de parité, mais le résultat d'atténuation des erreurs est à peu près le même.
pt_br: Como vemos, a fidelidade bruta é muito menor do que a obtida com MQC, mas o resultado com erro mitigado é aproximadamente o mesmo.

source: This following code runs tomography experiments on the circuit we defined first, which is then compared to the theortical statevector to generate a density matrix
fr_fr: Le code suivant exécute des expériences de tomographie sur le circuit que nous avons défini en premier, qui est ensuite comparé au vecteur d'état théorique pour générer une matrice de densité
pt_br: Este código a seguir executa experimentos de tomografia no circuito que definimos primeiro, que é então comparado ao vetor de estados teórico para gerar uma matriz densidade

source: ...And now for error mitigation...
fr_fr: ...Et maintenant pour l'atténuation des erreurs ...
pt_br: ...E agora para a mitigação de erros...

source: Now, using ``qiskit.visualization``, we can plot the raw density matrix, real, and imiginary parts being on separate plots,...
fr_fr: Maintenant, en utilisant ``qiskit.visualization``, nous pouvons tracer la matrice de densité brute, les parties réelles et imaginaires, sur des tracés séparés...
pt_br: Agora, usando ``qiskit.visualization``, podemos representar a matriz de densidade bruta, as partes real e imaginária estando em gráficos separados,...

source: And also the error mitigated density matrix,...
fr_fr: Et aussi la matrice de densité après l'atténuation des erreurs ...
pt_br: E também a matriz densidade com erros mitigados,...

source: As we see, the raw fidelity is much lower than what is acheived with either MQC or Parity Oscillations, but the error mitigated result is about the same.
fr_fr: Comme nous le voyons, la fidélité brute est beaucoup plus faible que ce qui est obtenu avec les Oscillations MQC ou de parité, mais le résultat d'atténuation des erreurs est à peu près le même.
pt_br: Como vemos, a fidelidade bruta é muito menor do que o que é obtido com o MQC ou com as Oscilações de Paridade, mas o resultado com erro mitigado é aproximadamente o mesmo.

source: In conclusion, we see that without error mitigation, MQC is the superior method for characterizing the GHZ state. However, with error mitigation, all methods can, at least for a small number of qubits, acheive a much greater fidelity, and all near the same value. To get more accurate results, aside from using a real device, it is worth increasing the number of shots four to eight-fold. It may be worth comparing how the parallellized circutis used in this notebook perform fidelity-wise versus linearized circuits.
fr_fr: En conclusion, nous voyons que sans atténuation des erreurs, le MQC est la meilleure méthode pour caractériser l'état GHZ. Cependant, avec l'atténuation des erreurs, toutes les méthodes peuvent, au moins pour un petit nombre de qubits, réaliser une fidélité beaucoup plus grande, toutes dans le même ordre de grandeur. Pour obtenir des résultats plus précis, mis à part l'utilisation d'un dispositif réel, il est utile d'augmenter le nombre de tirs de quatre à huit fois. Il peut aussi être utile de comparer la façon dont les circuits parallèles utilisés dans ce bloc-notes se comportent du point de vue de la fidélité par rapport à des circuits linéarisés.
pt_br: Concluindo, vemos que sem a mitigação de erros, o MQC é o método superior para caracterizar o estado GHZ. No entanto, com a mitigação de erros, todos os métodos podem, pelo menos para um pequeno número de qubits, alcançar uma fidelidade muito maior, e todos próximos do mesmo valor. Para obter resultados mais precisos, além de usar um dispositivo real, vale a pena aumentar o número de execuções de quatro a oito vezes. Pode valer a pena comparar o desempenho com relação à fidelidade dos circuitos paralelizados utilizados neste notebook com o dos circuitos linearizados.
