Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/9_entanglement_verification.po
Languages: bn_bn, es_un, fr_fr, ja_jp, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: We begin by defining standard execution parameters:
bn_bn: প্রমান কার্যসম্পাদনের পরামিতিগুলো সংজ্ঞায়িত করার মাধ্যমে আমরা শুরু করি:
es_un: Comenzamos definiendo parámetros de ejecución estándar:
fr_fr: Nous commençons par définir les paramètres d'exécution standard :
ja_jp: 標準の実行パラメータを定義することから始めます。
pt_br: Começamos definindo parâmetros de execução padrão:
ru_ru: Начнем с определения стандартных параметров процесса выполнения:
ta_in: நிலையான செயல்படுத்தல் ஆர்குமென்ட்க்களை வரையறுப்பதன் மூலம் நாங்கள் தொடங்குகிறோம்:
tr_tr: Standart uygulama parametrelerini tanımlayarak başlıyoruz:
zh_tw: 我們首先定義標準執行參數：

source: Now with error mitigation:
bn_bn: ত্রুটি দূরীকরণের ব্যাপারে:
es_un: Ahora con mitigación de errores:
fr_fr: Maintenant, avec l'atténuation des erreurs :
ja_jp: エラー軽減：
pt_br: Agora com a mitigação de erros:
ru_ru: Теперь с уменьшением ошибок:
ta_in: இப்போது பிழை குறைத்தலுடன்:
tr_tr: Şimdi hata azaltma ile:
zh_tw: 現在，在有錯誤緩解的情況下：

source: We will load these values in a dictionary for assessing fidelity later on:
bn_bn: ফিডেলিটি মূল্যায়নের জন্য আমরা এই মানসমূহকে একটি ডিকশনারিতে লোড করে নেবো :
es_un: Cargaremos estos valores en un diccionario para evaluar la fidelidad más adelante:
fr_fr: Nous allons charger ces valeurs dans un dictionnaire pour pouvoir évaluer la fidélité par la suite :
ja_jp: 後で忠実度を評価するために、これらの値を辞書にロードします。
pt_br: Vamos carregar esses valores em um dicionário para avaliar a fidelidade posteriormente em:
ru_ru: Мы загрузим эти значения в словарь для последующей в дальнейшем оценки точности:
ta_in: சரிபார்த்தலை மதிப்பிடுவதற்கு இந்த மதிப்புகளை ஒரு அகராதியில் ஏற்றுவோம்:
tr_tr: Daha sonra aslına uygunluğu değerlendirmek için bu değerleri bir sözlüğe yükleyeceğiz:
zh_tw: 我們將把這些值載入到一個字典中，以便稍後評估保真度：

source: Part 1 : MQC
bn_bn: প্রথম অধ্যায় : এম. কিউ. সি(MQC)
es_un: Parte 1: MQC
fr_fr: Partie 1 : MQC
pt_br: Parte 1: MQC
ru_ru: Часть 1: MQC
ta_in: பகுதி 1: MQC
tr_tr: Bölüm 1: MQC
zh_tw: 第一部分：MQC

source: We now retrieve a parallelized MQC circuit for the n qubit device
bn_bn: এবার আমরা n সংখক কিউবিট যন্ত্রের জন্যে একটি সমান্তরাল এম. কিউ. সি বর্তনী (সার্কিট) পুনরুদ্ধার করি।
es_un: Ahora recuperamos un circuito MQC paralelizado para el dispositivo de n qubits
ja_jp: ここで、n量子ビットデバイスの並列化されたMQC回路を取得します。
ru_ru: Теперь мы получим распараллеленную схему MQC для устройства из n кубитов
ta_in: இப்போது n க்யூபிட் deviceக்கான இணையான MQC சர்கூட் மீட்டெடுகிறோம்
tr_tr: Şimdi, n kübit aygıtı için paralellenmiş bir MQC devresi elde ediyoruz

source: We now execute the MQC experiment:
bn_bn: আমরা এখন এমকিউসি পরীক্ষাটি চালাবো:
es_un: Ahora ejecutamos el experimento MQC:
fr_fr: Nous exécutons maintenant l'expérience MQC :
ja_jp: MQC実験を実行します。
pt_br: Agora executamos o experimento MQC:
ru_ru: Теперь мы проведем эксперимент MQC:
ta_in: நாங்கள் இப்போது MQC பரிசோதனையை இயக்குகிறோம்:
tr_tr: MQC deneyini şimdi yürütüyoruz:
zh_tw: 我們現在執行該 MQC 實驗：

source: Now we will plot the amount of counts measured for :math:`|0 \rangle ^{\otimes n}` as a function of phase. It is important to note that when using a parametrized circuit like the one here, the method ``get_counts()`` accepts an **index** and not a **circuit**. In any other type of experiment, ``get_counts()`` accepts a **circuit**.
bn_bn: এখন আমরা দশা অন্বয় (ফাংশন) :math:`|0 \rangle ^{\otimes n}` -এর পরিমাপ করা গণনার পরিমাণ হিসাব করব। এটা মনে রাখা গুরুত্বপূর্ণ যে যখন এখানকার মতো একটি পর্যামিতিসহ বর্তনী (সার্কিট) ব্যবহার করব যা ``get_counts()`` পদ্ধতি ব্যবহার করে এবং **circuit** না নিয়ে তার **index** কে নেয়। অন্য কোন ধরনের পরীক্ষায় ``get_counts()`` একটি **circuit** কে নেবে।
es_un: Ahora graficaremos la cantidad de recuentos medidos para :math:`|0 \rangle ^{\otimes n}` como una función de fase. Es importante notar que cuando se usa un circuito paralelizado como el de aquí, el método ``get_counts()`` acepta un **índice** y no un **circuito**. En cualquier otro tipo de experimento, ``get_counts()`` acepta un **circuito**.
fr_fr: Nous allons maintenant tracer la quantité d'occurrences mesurées pour :math:`| 0 \rangle ^ { \otimes n }` en fonction de la phase. Il est important de noter que lors de l'utilisation d'un circuit paramétré comme celui ici, la méthode ``get_counts()`` accepte un **index** et non un **circuit**. Dans tout autre type d'expérience, ``get_counts()`` accepte un ** circuit**.
ja_jp: ここで、 :math:`|0 \rangle ^{\otimes n}` について測定されたカウントの量を位相の関数としてプロットします。ここにあるようなパラメータ化された回路を使用する場合、メソッド ``get_counts()`` は **回路** ではなく **インデックス** を受け入れることに注意することが重要です。他のタイプの実験では、 ``get_counts()`` は **回路** を受け入れます。
pt_br: Agora vamos representar a quantidade de contagens medidas para :math:`|0 \rangle ^{\otimes n}` em função da fase. É importante notar que ao usar um circuito parametrizado como esse, o método ``get_counts()`` aceita um **índice** e não um **circuito**. Em qualquer outro tipo de experimento, ``get_counts()``` aceita um **circuito**.
ru_ru: Теперь мы построим график количества отсчётов, измеренных для :math:`|0 \rangle ^{\otimes n}` как функцию фазы. Важно отметить, что при использовании параметризованной цепи, как здесь, метод ``get_counts()`` принимает **index**, а не **circuit**. В любом другом типе эксперимента метод ``get_counts()`` принимает **circuit**.
ta_in: நிலையின் செயல்பாடாக :math:`|0 \rangle ^{\otimes n}` அளவிடப்பட்ட எண்ணிக்கையின் அளவை இப்போது வரைவோம். இங்குள்ளதைப் போன்ற அளவுருப்படுத்தப்பட்ட சர்கூட்யை பயன்படுத்தும் போது, ``get_counts()`` முறை ஒரு **அட்டவணை** ஏற்றுக்கொள்கிறது, ஆனால் **சர்கூட்** அல்ல என்பதை கவனத்தில் கொள்ள வேண்டும். வேறு எந்த வகை பரிசோதனையிலும், ``get_counts()`` ஒரு **circuit** ஐ ஏற்றுக்கொள்கிறது.
tr_tr: Şimdi, :math:`|0 \rangle ^{\otimes n}` için ölçülen sayımların miktarını fazın bir fonksiyonu olarak çizeceğiz. Buradaki gibi parametreleştirilmiş bir devre kullanırken, ``get_counts()`` yönteminin bir **devre** değil bir **indeks** kabul ettiğine dikkat etmek önemlidir. Diğer tüm deney türlerinde, ``get_counts()`` bir **devre** kabul eder.
zh_tw: 現在，我們將繪製出函數 y(x)，其 y 軸為 :math:`|0 \rangle ^{\otimes n}` 測量的計數量，x 軸為相位。 請務必注意，當使用類似此參數化的電路時，該方法 ``get_counts()`` 接受一個 **索引 (index) ** ，而不是 **電路 (circuit) **。 在任何其他類型的實驗中， ``get_counts()`` 接受一個 **電路 **。

source: Now we get started on error mitigation. We create an identical quantum register and use complete_meas_cal from Ignis, to create circuits for calibrated measurements to be executed, and a calibration matrix.
bn_bn: এখন আমরা ত্রুটি প্রশমনের কাজ শুরু করব। আমরা একটি অভিন্ন কোয়ান্টাম রেজিস্ট্রার তৈরি করব এবং ক্রমাঙ্কিত পরিমাপকে নির্বাহের জন্য বর্তনী (সার্কিট) তৈরি করতে ও একটি ক্রমাঙ্কন ম্যাট্রিক্স তৈরি করতে ইগ্নিস থেকে complete_meas_cal ব্যবহার করি।
es_un: Ahora comenzamos con la mitigación de errores. Creamos un registro cuántico idéntico y usamos complete_meas_cal de Ignis, para crear circuitos para que se ejecuten mediciones calibradas, y una matriz de calibración.
ja_jp: ここで、エラーの軽減を開始します。同一の量子レジスタを作成し、Ignisの complete_meas_cal を使用して、実行する較正済み測定用の回路と較正マトリックスを作成します。
ru_ru: Теперь мы приступаем к исправлению ошибок. Мы создаем идентичный квантовый регистр и используем complete_meas_cal из Ignis, чтобы создать цепи для проведения калибровочных измерений и калибровочную матрицу.
ta_in: இப்போது பிழை குறைத்தலை தொடங்குவோம். நாங்கள் ஒரே மாதிரியான quantum register உருவாக்கி, Ignisலிருந்து complete_meas_cal பயன்படுத்துகிறோம், அளவீடு செய்யப்பட்ட அளவீடுகள் செயல்படுத்தப்பட வேண்டிய சர்கூட்கள் மற்றும் ஒரு அளவொப்புமை அணி.
tr_tr: Şimdi hata azaltmaya başlıyoruz. Özdeş bir kuantum yazmacı oluşturuyoruz ve kalibre edilecek ölçümler için devreler ve bir kalibrasyon matrisi oluşturmak için Ignis'ten complete\_meas\_cal kullanıyoruz.
zh_tw: 現在，我們開始進行錯誤緩解。 我們建立一個相同的量子暫存器，並使用 Ignis 的 complete_meas_cal ，來建立一個用來執行校正測量的電路，以及一個校正矩陣。

source: Finally, we have our error mitigated results:
bn_bn: অবশেষে, আমাদের ত্রুটি প্রশমিত ফলাফল পেলাম:
es_un: Finalmente, tenemos nuestros resultados con errores mitigados:
fr_fr: Enfin, nous avons nos résultats avec les erreurs atténuées :
ja_jp: 最後に、エラーを軽減した結果が得られました。
pt_br: Por fim, temos nossos resultados com mitigação de erro:
ru_ru: Наконец, мы получили результаты с исправлением ошибок:
ta_in: இறுதியாக, எங்கள் பிழையைக்குறைக்கும் முடிவுகள் உள்ளன:
tr_tr: Son olarak, hata azaltılmış sonuçlarımızı elde ettik:
zh_tw: 最後，我們得到了錯誤緩解過後的結果。

source: We can see how the error mitigated results yield a far greater fidelity than the raw data
bn_bn: আমরা দেখতে পাচ্ছি যে ত্রুটি প্রশমিত ফলাফলগুলি অপরিমার্জিত তথ্যর ( ডেটা) চেয়ে অনেক বেশি বিশ্বস্ততা অর্জন করে
es_un: Podemos ver cómo los resultados con errores mitigados producen una fidelidad mucho mayor que los datos crudos
fr_fr: Nous pouvons voir comment les résultats utilisant l'atténuation d'erreur produisent une fidélité beaucoup plus grande que les données brutes
ja_jp: エラーが軽減された結果が、生データよりもはるかに忠実であることがわかります。
pt_br: Podemos ver como os resultados com mitigação de erro produzem uma fidelidade muito maior do que os dados brutos
ru_ru: Мы можем убедиться, что результаты, полученные с исправлением ошибок, дают гораздо большую точность, чем необработанные данные
ta_in: பிழையைக்குறைக்கும் முடிவுகள் பதனிடப்படாத தரவை விட மிகப் பெரிய சரிபார்த்தலையை எவ்வாறு தருகின்றன என்பதை நாம் காணலாம்
tr_tr: Hataları azaltılmış sonuçların ham verilerden çok daha fazla doğruluk sağladığını görebiliriz
zh_tw: 我們可以看到錯誤緩解過後的結果產生的保真度遠大於用原始資料對應的保真度。

source: We now plot the DFT and compare the heights of the peaks to give bounds for the fidelity
bn_bn: বিশ্বস্ততার সীমানা দেওয়ার জন্য আমরা এখন ডিএফটি লেখচিত্র প্লট করি এবং শিখরের উচ্চতাগুলি তুলনা করি
es_un: Ahora trazamos la DFT y comparamos las alturas de los picos para dar límites para la fidelidad
fr_fr: Nous traçons maintenant la DFT et comparons les hauteurs des pics pour donner des bornes pour la fidélité
ja_jp: ここで、DFTをプロットし、ピークの高さを比較して、忠実度の境界を示します。
pt_br: Nós agora plotamos o DFT e comparamos as alturas dos picos para definir limites para a fidelidade
ru_ru: Теперь мы построим график DFT и сравним высоты пиков, чтобы получить границы для достоверности
ta_in: நாங்கள் இப்போது DFTயை வரைகிறோம் மற்றும் சிகரங்களின் உயரங்களை ஒப்பிட்டு சரிபார்த்தலுக்கு எல்லைக்குட்பட்டு வழங்குகிறோம்
tr_tr: Şimdi DFT'yi çiziyoruz ve doğruluk sınırlarını vermek için piklerin yüksekliklerini karşılaştırıyoruz
zh_tw: 我們現在繪製其 DFT ，並比較峰值的高度來為保真度設定界限。

source: Statistical bootstrapping has found that the error on these measurements is at most 1.5% (arXiv 1905.05720), so these result fall within error bounds, despite the fidelity being slightly higher than the upper bound, and show how error mitigation dramatically increases fidelity
bn_bn: পরিসংখ্যানগত বুটস্ট্র্যাপিং থেকে জানা যায় যে এই পরিমাপের ত্রুটি সর্বাধিক ১.৫% (arXiv 1905.05720) হয়, সুতরাং ফলাফল উপরের গণ্ডির চেয়ে সামান্য বেশি হওয়া সত্ত্বেও ত্রুটি সীমার মধ্যে পড়ে এবং দেখায় ত্রুটি দূরীকরণের ফলে কীভাবে নাটকীয়ভাবে বিশ্বস্ততা বাড়ে
es_un: El procedimiento de remuestreo (bootstrapping) estadístico ha encontrado que el error en estas mediciones es como máximo del 1.5% (arXiv 1905. 5720), por lo que estos resultados caen dentro de los límites de error, a pesar de que la fidelidad es ligeramente superior al límite superior, y muestran cómo la mitigación de errores aumenta drásticamente la fidelidad
fr_fr: Le bootstrap statistique a permis de constater que l'erreur sur ces mesures est au plus de 1,5% (arXiv 1905.05720), de sorte que ces résultats se situent à l'intérieur des limites d'erreur, malgré la fidélité légèrement supérieure à la limite haute, et montrent comment l'atténuation des erreurs augmente considérablement la fidélité
ja_jp: 統計的ブートストラップにより、これらの測定値の誤差は最大1.5％（arXiv 1905.05720）であることがわかったため、忠実度が上限よりわずかに高いにもかかわらず、これらの結果は誤差範囲内に収まり、誤差の軽減によって忠実度が劇的に向上することがわかります。
pt_br: O bootstrapping estatístico descobriu que o erro nessas medições é no máximo 1.5% (arXiv 1905.05720), portanto, esses resultados caem dentro de limites de erro, apesar da fidelidade ser um pouco maior do que o limite superior, e mostram como a mitigação de erros aumenta drasticamente a fidelidade
ru_ru: Статистическая самозагрузка показала, что ошибка этих измерений составляет не более 1,5% (arXiv 1905.05720), поэтому эти результаты находятся в пределах погрешности, несмотря на то, что точность немного выше верхней границы, и показывают, как уменьшение ошибок значительно увеличивает точность
ta_in: புள்ளிவிவர பூட்ஸ்ட்ராப்பிங் இந்த அளவீடுகளில் பிழை அதிகபட்சம் 1.5% (arXiv 1905.05720) இருப்பதைக் கண்டறிந்துள்ளது, எனவே இந்த முடிவு பிழையின் எல்லைக்குட்பட்டு வருகிறது, சரிபார்த்தல் மேல் வரம்பை விட சற்றே அதிகமாக இருந்தாலும், பிழை குறைத்தல் எவ்வாறு வியத்தகு முறையில் சரிபார்த்தலையை அதிகரிக்கிறது என்பதைக் காட்டுகிறது
tr_tr: İstatistiksel önyükleme, bu ölçümlerdeki hatanın en fazla %1,5 olduğunu buldu (arXiv 1905.05720), bu nedenle bu sonuçlar, aslına uygunluğun üst sınırdan biraz daha yüksek olmasına rağmen hata sınırları içinde kalıyor ve hata azaltmanın doğruluğu nasıl önemli ölçüde artırdığını gösteriyor
zh_tw: 通過統計自助抽樣法我們發現這些測量的錯誤最多為 1.5% (arXiv 1905.05720)，所以即使保真度略高於上限，這些結果也在錯誤範圍內。這些結果也顯示錯誤緩解顯著提高了保真度。

source: Part 2: Parity Oscillation
bn_bn: দ্বিতীয় অধ্যায়: প্যারিটি দোলন (অসিলেশন)
es_un: Parte 2: Oscilación de paridad
fr_fr: Partie 2 : Oscillation de parité
ja_jp: パート2：パリティ振動
pt_br: Parte 2: Oscilação de Paridade
ru_ru: Часть 2: Осцилляции чётности
ta_in: பகுதி 2: பரிதி ஊசலாட்டங்கள்
tr_tr: Bölüm 2: Eşlik Salınımı
zh_tw: 第 2 部分：宇稱震盪

source: We now retrieve a parallelized Parity Oscillation circuit for the n qubit device, and run experiments in the same fashion as we did in MQC.
bn_bn: আমরা এখন n কিউবিট ডিভাইসটির জন্য একটি সমান্তরাল প্যারিটি দোলন (অসিলেশন) বর্তনী (সার্কিট) পুনরুদ্ধার করি এবং এমকিউসিতে আমরা যেমন করেছিলাম তেমনভাবেই পরীক্ষা চালাই।
es_un: Ahora recuperamos un circuito de oscilación de paridad en paralelo para el dispositivo de n qubits y ejecutamos experimentos de la misma manera que lo hicimos en MQC.
ja_jp: ここで、n量子ビットデバイスの並列化されたパリティ発振回路を取得し、MQCで行ったのと同じ方法で実験を実行します。
ru_ru: Теперь мы получим распараллеленную цепь для осцилляции четности для устройства с n кубитами и проведем эксперименты таким же образом, как и в MQC.
ta_in: நாங்கள் இப்போது n க்யூபிட் deviceற்கான ஒரு இணையான பரிதி ஊசலாட்டங்கள் சர்கூட்டை மீட்டெடுக்கிறோம், மேலும் MQC இல் செய்ததைப் போலவே பரிசோதனைகளையும் இயக்குகிறோம்.
tr_tr: Şimdi n kübitlik cihaz için paralelleştirilmiş bir Eşlik Salınım devresi alıyoruz ve MQC'de yaptığımızla aynı şekilde deneyler yapıyoruz.
zh_tw: 我們現在檢索一個對應於 n 量子位元器件的平行化宇稱震盪電路 (Parity Oscillation circuit)，並與我們在 MQC中所做的一樣執行實驗。

source: Now we construct the :math:`\otimes _{j}^{N} \sigma_z^{j}` matrix for instruction, although this is already taken into account in the following method, ``entanglement.analysis.composite_pauli_z_expvalue()``:
bn_bn: এখন আমরা নির্দেশের জন্য :math:`\otimes _{j}^{N} \sigma_z^{j}` ম্যাট্রিক্সটি নির্মাণ করি, যদিও এটি ইতিমধ্যে নিম্নলিখিত পদ্ধতিতে বিবেচনা করা হয়েছে, ``entanglement.analysis.composite_pauli_z_expvalue()``:
es_un: Ahora construimos la matriz :math:`\otimes _{j}^{N} \sigma_z^{j}` por instrucción, aunque esto ya se tiene en cuenta en el siguiente método, ``entanglement.analysis.composite_pauli_z_expvalue()``:
fr_fr: Nous construisons à présent a matrice :math:` \otimes _{j}^{N} \sigma_z ^{j}` pour l'instruction, bien que cette méthode soit déjà prise en compte dans la méthode suivante: ``entanglement.analysis.composite_pauli_z_expvalue ()``:
ja_jp: ここで、命令用の :math:`\otimes _{j}^{N} \sigma_z^{j}` 行列を作成しますが、これは次のメソッド ``entanglement.analysis.composite_pauli_z_expvalue()`` ですでに考慮されています。
pt_br: Agora nós construímos a matriz :math:`\otimes _{j}^{N} \sigma_z^{j}` para instrução, embora isso já seja levado em conta no método a seguir, ``entanglement.analysis.composite_pauli_z_expvalue()``:
ru_ru: Создаем матрицу :math:`\otimes _{j}^{N} \sigma_z^{j}` для инструкции, хотя это уже учтено в методе ``entanglement.analysis.composite_pauli_z_expvalue()``:
ta_in: இப்போது நாம் :math:`\otimes _{j}^{N} \sigma_z^{j}` வழிமுறைகளுக்கான அணி கட்டமைக்கிறோம், இது ஏற்கனவே பின்வரும் முறையில் கணக்கில் எடுத்துக்கொள்ளப்பட்டாலும், ``entanglement.analysis.composite_pauli_z_expvalue()``:
tr_tr: Şimdi, aşağıdaki yöntemde dikkate alınmış olmasına rağmen talimat için :math:`\otimes _{j}^{N} \sigma_z^{j}` matrisini oluşturuyoruz, ``entanglement.analysis.composite_pauli_z_expvalue()``:
zh_tw: 現在我們建構 :math:`\otimes _{j}^{N} \sigma_z^{j}`以作指示，雖然已在以下方法中考量過：``entanglement.analysis.composite_pauli_z_expvalue()``:

source: Now we want to make sure that our list of counts is correctly ordered so that it coincides with the states of the :math:`\otimes _{j}^{N} \sigma_z^{j}`, so that calculating :math:`\langle \otimes _{j}^{N} \sigma_z^{j} \rangle` will be as simple as taking the dot product of this ordered list with the diagonal of :math:`\otimes _{j}^{N} \sigma_z^{j}`. The ``composite_pauli_z_expvalue`` function does just that; it takes a circuit and appropriately orders the state vector counts. We can plot this dot product as a function of :math:`\phi` to observe parity oscillations.
bn_bn: এখন আমরা নিশ্চিত করতে চাই যে আমাদের গণনার তালিকা সঠিকভাবে ক্রমে আছে যাতে এটি :math:`\otimes _{j}^{N} \sigma_z^{j}` অবস্থার (স্টেট) সাথে মিলে যায়, যাতে :math:`\langle \otimes _{j}^{N} \sigma_z^{j} \rangle` গণনা এই তালিকার সাথে :math:`\otimes _{j}^{N} \sigma_z^{j}` -এর কর্ণর ডট প্রোডাক্ট করলেই হবে। ``composite_pauli_z_expvalue`` ফাংশন ঠিক তাই করে; এটি একটি বর্তনী (সার্কিট) নেয় এবং যথাযথভাবে স্টেটের ভেক্টর গণনার ক্রমান্বিত করে। আমরা এই ডট গুনফল একটি অন্বয় (ফাংশন) :math:`\phi` হিসাবে বিবেচনা করতে পারি যা প্যারিটি দোলন (অসিলেশন) পর্যবেক্ষণ করতে সাহায্য করে।
es_un: Ahora queremos asegurarnos de que nuestra lista de conteos esté ordenada correctamente para que coincida con los estados de :math:`\otimes _{j}^{N} \sigma_z^{j}`, así que calcular :math:`\langle \otimes _{j}^{N} \sigma_z^{j} \rangle` será tan sencillo como tomar el producto punto de esta lista ordenada con la diagonal de :math:`\otimes _{j}^{N} \sigma_z^{j}`. La función ``composite_pauli_z_expvalue`` hace justo eso; toma un circuito y ordena apropiadamente los conteos de vectores de estado. Podemos graficar este producto punto como función de :math:`\phi` para observar las oscilaciones de paridad.
fr_fr: Maintenant nous voulons nous assurer que notre liste de compteurs est correctement ordonnée afin qu'elle coïncide avec les états des :math:`\otimes _{j}^{N} \sigma_z ^{j}`, de sorte que le calcul de :math:`\langle \otimes _{j}^{N} \sigma_z^{j} \rangle` sera aussi simple que de prendre le produit à points de cette liste ordonnée avec la diagonale de :math:`\otimes _{j}^{N} \sigma_z ^{j}`. La fonction ``composite_pauli_z_expvalue`` fait exactement cela ; elle prend un circuit et ordonne correctement le nombre de vecteurs d'état. Nous pouvons tracer ce produit en tant que fonction de :math:`\phi` pour observer les oscillations de parité.
ja_jp: ここで、カウントのリストが :math:`\otimes _{j}^{N} \sigma_z^{j}` の状態と一致するように正しく順序付けられていることを確認します。これにより、 :math:`\langle \otimes _{j}^{N} \sigma_z^{j} \rangle` の計算は、この順序付けられたリストの対角線が :math:`\otimes _{j}^{N} \sigma_z^{j}` の内積を取るのと同じくらい簡単になります。 ``composite_pauli_z_expvalue`` 関数はまさにそれを行います。 回路を取り、状態ベクトルカウントを適切に順序付けます。 この内積を :math:`\phi` の関数としてプロットして、パリティの振動を観察できます。
pt_br: Agora queremos ter certeza de que nossa lista de contagens está corretamente ordenada para que ela coincida com os estados do :math:`\otimes _{j}^{N} \sigma_z^{j}`, de modo que calcular :math:`\langle \otimes _{j}^{N} \sigma_z^{j} \rangle` será tão simples quanto tomar o produto escalar desta lista ordenada com a diagonal de :math:`\otimes _{j}^{N} \sigma_z^{j}`. A função ``composite_pauli_z_expvalue`` faz exatamente isso; ela recebe um circuito e ordena apropriadamente as contagens do vetor de estados. Podemos representar esse produto escalar como uma função de :math:`\phi` para observar oscilações de paridade.
ru_ru: Теперь мы хотим убедиться, что наш список отсчётов правильно упорядочен, чтобы он совпадал с состояниями :math:`\otimes _{j}^{N} \sigma_z^{j}`, так что вычисление :math:`\langle \otimes _{j}^{N} \sigma_z^{j} \rangle` будет так же просто, как взять скалярное произведение этого упорядоченного списка с диагональю :math:`\otimes _{j}^{N} \sigma_z^{j}`. Функция ``composite_pauli_z_expvalue`` делает именно это; она берет цепь и соответствующим образом упорядочивает отсчеты вектора состояния. Мы можем построить график этого скалярного произведения как функцию :math:`\phi`, чтобы наблюдать осцилляции четности.
ta_in: இப்போது எங்கள் எண்ணிக்கையின் பட்டியல் சரியாக வரிசைப்படுத்தப்பட்டுள்ளதா என்பதை உறுதிப்படுத்த விரும்புகிறோம், இதனால் அது நிலைகளுடன் ஒத்துப்போகிறது :math:`\otimes _{j}^{N} \sigma_z^{j}`, so that calculating :math:`\langle \otimes _{j}^{N} \sigma_z^{j} \rangle` இந்த ஆர்டர் செய்யப்பட்ட பட்டியலின் புள்ளி தயாரிப்பை மூலைவிட்டத்துடன் எடுத்துக்கொள்வது போல எளிமையாக இருக்கும் :math:`\otimes _{j}^{N} \sigma_z^{j}`. ``composite_pauli_z_expvalue`` செயல்பாடு அதை செய்கிறது; இது ஒரு சர்கூட் எடுத்து, ஸ்டேட் வெக்டர் எண்ணிக்கையை சரியான முறையில் ஆர்டர் செய்கிறது. இந்த புள்ளி தயாரிப்பை நாம் ஒரு செயல்பாடாக வரையலாம் :math:`\phi` பரிதி ஊசலாட்டங்களைக் கவனிக்க.
tr_tr: Şimdi sayım listemizin doğru sıralandığından emin olmak istiyoruz ki :math:`\otimes _{j}^{N} \sigma_z^{j}` durumlarıyla tutarlı olsun, böylece hesaplama :math:`\langle \otimes _{j}^{N} \sigma_z^{j} \rangle` bu sıralanmış liste ile :math:`\otimes _{j}^{N} \sigma_z^{j}` matrisinin köşegeninin nokta çarpımını almak kadar kolay olacaktır. ``composite_pauli_z_expvalue`` fonksiyonu sadece bunu yapar; bir devre alır ve durum vektörleri sayımını uygun bir şekilde sıralar. Bu nokta çarpımını, eşlik salınımlarını keşfetmek için bir :math:`\phi` fonksiyonu olarak çizebiliriz.
zh_tw: 現在我們想要確保計數清單是被正確地排序以匹配以下狀態：:math:`\otimes _{j}^{N} \sigma_z^{j}`。 如此一來，計算 :math:`\langle \otimes _{j}^{N} \sigma_z^{j} \rangle` 會變得和取此有序清單和 :math:`\otimes _{j}^{N} \sigma_z^{j}` 對角線的內積一樣簡單。此``composite_pauli_z_expvalue`` 函數即可完成上述工作。此函數輸入一個電路並合適地排序狀態向量的計數。我們可以以 :math:`\phi`為自變量繪製出這個內積的函數，以觀察宇稱震盪。

source: Now for standard error mitigation:
bn_bn: এখন প্রমান ত্রুটি দূরীকরণের জন্য:
es_un: Ahora la mitigación estándar de errores:
fr_fr: Maintenant, pour l'atténuation standard des erreurs :
ja_jp: 次に、標準エラーを軽減します。
pt_br: Agora para mitigação de erro padrão:
ru_ru: Теперь для стандартного уменьшения ошибок:
ta_in: இப்போது நிலையான பிழை குறைத்தலுக்கு:
tr_tr: Şimdi standart hata azaltma için:
zh_tw: 現在，對於標準錯誤緩解：
