Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/9_entanglement_verification.po
Languages: bn_bn, es_un, fr_fr, ja_jp, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: Multiple Quantum Coherence (MQC)
bn_bn: একাধিক কোয়ান্টাম সমদশা (কোহেরেন্স) (এম. কিউ. সি)
es_un: Coherencia cuántica múltiple (MQC)
fr_fr: Coherence quantique multiple (MQC)
ja_jp: マルチ量子コヒーレンス（Multiple Quantum Coherence、MQC）
pt_br: Coerência Quântica Múltipla (MQC)
ru_ru: Множественная квантовая когерентность (МКК)
tr_tr: Çoklu Kuantum Eşfazlılık (MQC)
zh_tw: 多重量子相干（MQC）

source: Multiple Quantum Coherence (MQC) works by taking the preliminary preparation of an :math:`n` qubit GHZ State, and rotating each of the qubit states around the z axis by a phase :math:`\phi`. After that, we apply a X gate, i.e., a :math:`\pi` pulse around the x axis. Then, we apply the inverse of the operations we originally applied to get the GHZ state. In an ideal situation the final state is :math:`|\psi \rangle = \frac{|0 \rangle ^{\otimes n} + e^{i n \phi}|1 \rangle ^{\otimes n}}{\sqrt{2}}`. We can ideally observe the phase collected by projecting :math:`|\psi \rangle` onto the state :math:`|0 \rangle ^{\otimes n}`. This technique is reminiscent of an echo sequence, and has been shown to substantially improve the fidelity during readout.
bn_bn: একাধিক কোয়ান্টাম সমদশা (কোহেরেন্স) (এম.কিউ.সি) একটি প্রাথমিক GHZ অবস্থাতে থাকা :math:`n` কিউবিট নিয়ে প্রত্যেক কিউবিটকে z-অক্ষ বরাবর :math:`\phi` দশায় ঘুরিয়ে দেয়। এর পর আমরা একটি X গেট (অর্থাৎ x-অক্ষ বরাবর :math:`\pi` পালস) প্রয়োগ করি। তার পর GHZ অবস্থাতে আসার বিপরীত অপারেশন গুলো সঞ্চালন করি। একটি আদর্শ পরিস্থিতিতে :math:`|\psi \rangle = \frac{|0 \rangle ^{\otimes n} + e^{i n \phi}|1 \rangle ^{\otimes n}}{\sqrt{2}}` -এই স্থিতি পেয়ে থাকি আমরা। :math:`|\psi \rangle`কে :math:`|0 \rangle ^{\otimes n}` অবস্থাতে তে প্রয়োগ করে আমরা দশা নির্ণয় করতে পারি। এই কৌশলটি প্রতিধ্বনির অনুক্রমের স্মরণীয় এবং এটি দিয়ে রিডআউট চলাকালীন বিশ্বস্ততার যথেষ্ট উন্নতি দেখা যায়।
es_un: La Coherencia Cuántica Múltiple (Multiple Quantum Coherence, MQC) funciona tomando la preparación preliminar de un Estado GHZ de :math:`n` qubits y rotando cada uno de los estados de qubit alrededor del eje z por una fase :math:`\phi`. Después de eso, aplicamos una compuerta X, es decir, un pulso :math:`\pi` alrededor del eje x. Luego, aplicamos la inversa de las operaciones que aplicamos originalmente para obtener el estado GHZ. En una situación ideal, el estado final es :math:`|\psi \rangle = \frac{|0 \rangle ^{\otimes n} + e^{i n \phi}|1 \rangle ^{\otimes n}}{\sqrt{2}}`. Idealmente, podemos observar la fase recopilada proyectando :math:`|\psi \rangle` en el estado :math:`|0 \rangle ^{\otimes n}`. Esta técnica recuerda a una secuencia de eco y se ha demostrado que mejora sustancialmente la fidelidad durante la lectura.
ja_jp: 多重量子コヒーレンス(MQC)は、 :math:`n` 量子ビットGHZ状態の事前準備を行い、各量子ビット状態をz軸周りに位相 :math:`\phi` で回転させることで動作します。その後、Xゲート、すなわちX軸周りに :math:`\pi` パルスを適用します。その後、最初に適用した演算の逆を適用して、GHZ状態を得ます。理想的な状態では終状態は次のようになります。 :math:`|\psi \rangle = \frac{|0 \rangle ^{\otimes n} + e^{i n \phi}|1 \rangle ^{\otimes n}}{\sqrt{2}}` 理想的には :math:`|\psi \rangle` を :math:`|0 \rangle ^{\otimes n}` 状態に射影して、位相を観測することができます。この技術は、エコーシーケンスを連想させるもので、読み出し時の忠実度を大幅に向上させることが示されています。
ru_ru: Множественная квантовая когерентность (МКК, англ. Multiple Quantum Coherence, MQC) работает путем предварительной подготовки :math:`n`-кубитного состояния GHZ и поворота состояния каждого кубита вокруг оси z на фазу :math:`\phi`. После этого мы применяем вентиль X, т.е. :math:`\pi` импульс вокруг оси x. Затем мы применяем обратные операции, чтобы получить состояние GHZ. В идеальной ситуации конечное состояние :math:`|\psi \rangle = \frac{|0 \rangle ^{\otimes n} + e^{i n \phi}|1 \rangle ^{\otimes n}}{\sqrt{2}}`. В идеале мы можем наблюдать собранную фазу, проецируя :math:`|\psi \rangle` на состояние :math:`|0 \rangle ^{\otimes n}`. Эта техника напоминает спин-эхо последовательность, и было показано, что она значительно улучшает точность во время считывания.
ta_in: Multiple Quantum Coherence(MQC), ஒரு கணிதத்தின் ஆரம்ப தயாரிப்பை எடுத்துக்கொள்வதன் மூலம் செயல்படுகிறது :math:`n` க்யூபிட் GHZ நிலை, மற்றும் ஒவ்வொரு க்யூபிட் நிலைகளையும் z அச்சில் ஒரு நிலைமயாக சுழற்றுகிறது :math:`\phi`. அதன் பிறகு, நாங்கள் ஒரு X கேட் பயன்படுத்துகிறோம், அதாவது, ஒரு :math:`\pi` x அச்சைச் சுற்றி பல்ஸ். பின்னர், GHZ நிலையைப் பெற நாங்கள் முதலில் பயன்படுத்திய செயல்பாடுகளின் தலைகீழாக பயன்படுத்துகிறோம். ஒரு சிறந்த சூழ்நிலையில் இறுதி நிலை :math:`|\psi \rangle = \frac{|0 \rangle ^{\otimes n} + e^{i n \phi}|1 \rangle ^{\otimes n}}{\sqrt{2}} `. :math:`|\psi \rangle` நிலைக்கு :math:`|0 \rangle ^{\otimes n}`. இந்த நுட்பம் ஒரு எதிரொலி வரிசையை நினைவூட்டுகிறது, மேலும் வாசிப்பின் போது சரிபார்த்தலையை கணிசமாக மேம்படுத்துவதாகக் காட்டப்பட்டுள்ளது.
tr_tr: Çoklu Kuantum Eşfazlılığı (MQC), bir :math:`n` kübitlik GHZ Durumunun ön hazırlığını alarak ve kübit durumlarının her birini z ekseni etrafında bir :math:`\phi` fazı ile döndürerek çalışmaktadır. Bundan sonra, bir X kapısı, yani x ekseni etrafında bir :math:`\pi` atımı uygularız. Ardından, GHZ durumunu elde etmek için başlangıçta uyguladığımız işlemlerin tersini uygularız. İdeal bir durumda son durum :math:`|\psi \rangle = \frac{|0 \rangle ^{\otimes n} + e^{i n \phi}|1 \rangle ^{\otimes n}}{\sqrt{2}}` 'dir. :math:`|\psi \rangle` 'yi $\|0 :nbsphinx-math:`\rangle `^{:nbsphinx-math:`\otimes `n} $ durumuna izdüşürerek toplanan fazı ideal olarak gözlemleyebiliriz. Bu teknik, bir yankı dizisini çağrıştırır ve okuma sırasında doğruluğu büyük ölçüde geliştirdiği gösterilmiştir.
zh_tw: 多重量子相干(MQC) 通過以下方式來執行。首先準備 :math:`n` 量子位元 GHZ 狀態並把每個量子位狀態以 z 軸為軸旋轉相位 :math:`\phi` 。 接著，我們套用一個 X 閘，也就是一個以 x 軸旋轉 ​:math:`\pi` 的脈衝。然後，我們採取相反於原先用來獲得 GHZ 狀態的操作。 理想情況下，其最終狀態是 :math:`|\psi \rangle = \frac{|0 \rangle ^{\otimes n} + e^{i n \phi}|1 \rangle ^{\otimes n}}{\sqrt{2}}`。 我們可以理想地觀察通過將 :math:`|\psi \rangle` 投影到狀態 :math:`|0 \rangle ^{\otimes n}` 所上獲得的相位。此方法讓人想起迴聲序列，並且已被證明可以顯著改善讀取時的保真度。

source: The function below creates a linear MQC circuit. As with every circuit from here on, you can change the ``full_measurement`` argument to toggle between full measurement of all qubits or measurement of only the control qubit. Full measurement yields the most accurate results, but for more than 7 qubits, it is recommended to set it to false, and observe only the oscillations between the ``'0'`` and ``'1'`` states.
bn_bn: নীচের অন্বয়টি (ফাংশন) একটি রৈখিক এমকিউসি বর্তনী (সার্কিট) তৈরি করে। এখান থেকে প্রতিটি বর্তনী (সার্কিট) আপনি ``full_measurement`` আর্গুমেন্ট ব্যবহার করে সমস্ত কিউবিট গুলির সম্পূর্ণ পরিমাপ বা শুধুমাত্র নিয়ন্ত্রণ কিউবিট পরিমাপের মধ্যে টগল করতে পারেন। সম্পূর্ণ পরিমাপ সবচেয়ে সুনির্দিষ্ট ফলাফল দেয়, তবে ৭টির বেশি কিউবিটের জন্য এটি এটিকে false হিসাবে সেট করার পরামর্শ দেওয়া হয় এবং কেবল ``'0'`` এবং ``'1'`` -এর মধ্যে দোলনগুলি পর্যবেক্ষণ করা উচিত।
es_un: La siguiente función crea un circuito MQC lineal. Como en todos los circuitos a partir de aquí, se puede cambiar el argumento ``full_measurement`` para alternar entre la medición completa de todos los qubits o la medición de sólo el qubit de control. La medición completa produce los resultados más exactos, pero para más de 7 qubits, se recomienda establecerlo en falso, y observar sólo las oscilaciones entre los estados ``'0'`` y ``'1'``.
fr_fr: La fonction ci-dessous crée un circuit MQC linéaire. Comme pour chaque circuit ici, vous pouvez changer l'argument ``full_measurement`` pour basculer entre la mesure complète de tous les qubits ou la mesure de seulement le qubit de contrôle. La mesure complète donne les résultats les plus précis, mais pour plus de 7 qubits, il est recommandé de la définir à false et d'observer uniquement les oscillations entre les états ``0`` et ``1``.
ja_jp: 以下の関数は、線形MQC回路を生成します。これ以降のすべての回路と同様に、 ``full_measurement`` 引数を変更して、すべての量子ビットの完全な測定と制御量子ビットのみの測定を切り替えることができます。完全な測定によって最も正確な結果が得られますが、7量子ビットを超える場合はfalseに設定し、 ``'0'`` 状態と ``'1'`` 状態の間の振動のみを観察することをお勧めします。
pt_br: A função abaixo cria um circuito de MQC linear. Da mesma forma que todos os circuitos daqui em diante, é possível alterar o argumento ``full_measurement`` para alternar entre a medição completa de todos os qubits ou a medição apenas do qubit de controle. A medição completa produz resultados mais precisos, mas para mais de 7 qubits, recomenda-se configurá-la como falso, e observar apenas as oscilações entre os estados ``'0'`` e ``'1'``.
ru_ru: Приведенная ниже функция создает линейную схему MQC. Как и в любой другой цепи, вы можете изменить аргумент ``full_measurement`` для переключения между измерением всех кубитов или измерением только контрольного кубита. Полное измерение дает наиболее точные результаты, но для более чем 7 кубитов рекомендуется установить значение false и наблюдать только колебания между состояниями ``'0'`` и ``'1'``.
ta_in: கீழே உள்ள செயல்பாடு ஒரு நேரியல் MQC சர்கூட் உருவாக்குகிறது. இங்கிருந்து ஒவ்வொரு சர்கூட்களையும் போலவே, எல்லா க்யூபிட்ஸ்களின் முழு அளவீட்டுக்கும் அல்லது கட்டுப்பாட்டு குவிட்டின் அளவீட்டுக்கும் இடையில் மாறுவதற்கு ``முழு_அளவீடு`` விவாதத்தை மாற்றலாம். முழு அளவீட்டு மிகவும் துல்லியமான முடிவுகளைத் தருகிறது, ஆனால் 7 க்கும் மேற்பட்ட க்யூபிட்ஸ்களுக்கு, அதை பொய்யாக அமைக்க பரிந்துரைக்கப்படுகிறது, மேலும் ``'0'`` மற்றும் ``'1'`` நிலைகளுக்கு இடையிலான ஊசலாட்டங்களை மட்டுமே கவனிக்கவும்.
tr_tr: Aşağıdaki fonksiyon, doğrusal bir ÇKE devresi oluşturur. Bundan sonra her devrede olduğu gibi, tüm kübitlerin tam ölçümü veya yalnızca kontrol kübitinin ölçümü arasında geçiş yapmak için ``full_measurement`` bağımsız değişkenini değiştirebilirsiniz. Tam ölçüm en doğru sonuçları sağlar ancak 7 kübitten fazlası için, yanlış olarak ayarlanması ve yalnızca `` 0 '' ve `` 1 '' durumları arasındaki salınımların gözlemlenmesi önerilir.
zh_tw: 以下函數會建立一個線性 MQC 電路。 與這裡的每一個電路一樣，您可以變更 ``full_measurement`` 選項，以在完整測量所有量子位元或僅測量控制量子位元之間切換。 完整的測量會產生最精確的結果，但如果是超過 7 個量子位元的情況，建議將它設為 false ，並只觀察 ``'0'`` 與 ``'1'`` 狀態之間的震盪。

source: After running experiments on this MQC circuit, we can pick a state to observe oscillations as we sweep :math:`\phi` from :math:`0` to :math:`2 \pi`. Our signal in theory should follow :math:`S(\phi) = \frac{1}{2}(1+\cos(n \phi))`. We then perform a Discrete Fourier Transform (DFT: :math:`I_{v}=(1/N)|\sum_{\phi}e^{iv\phi}S(\phi)`) to extract the Fidelity of the state, defined by the bounds :math:`2\sqrt{I_{n}} \leq F \leq \sqrt{I_{0}/2}+ \sqrt{I_{n}}`; if desired, an actual value for the fidelity can be obtained: :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1})+\sqrt{I_{n}})` (arXiv:1905.05720).
bn_bn: এই এমকিউসি সার্কিটের উপর পরীক্ষা-নিরীক্ষার পরে, আমরা :math:`\phi` কে :math:`0` থেকে :math:`2 \pi` পর্যন্ত ঠেলে দেয়ার সাথে সাথে দোলনগুলি পর্যবেক্ষণ করার জন্য একটি স্টেট বাছাই করতে পারি। তাত্বিকভাবে আমাদের সিগন্যালটির :math:`S(\phi) = \frac{1}{2}(1+cos(n \phi))` কে অনুসরণ করা উচিত। আমরা তারপরে অবস্থার (স্টেট) বিশ্বস্ততা বের করতে একটি ডিস্ক্রিট ফোরিয়ার ট্রান্সফর্ম (ডিএফটি: :math:`I_{v}=(1/N)|\Sigma_{\phi}e^{iv\phi}S(\phi)`) হিসেব করি , যা :math:`2\sqrt{I_{n}} \leq F \leq \sqrt{I_{0}/2}+ \sqrt{I_{n}}`; সীমানা দ্বারা সংজ্ঞায়িত; তবে ফিডেলিটির জন্য একটি আসল মান পাওয়া যেতে পারে : :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1})+\sqrt{I_{n}})` (arXiv:1905.05720).
es_un: Después de ejecutar experimentos en este circuito MQC, podemos elegir un estado para observar las oscilaciones mientras barremos :math:`\phi` de :math:`0` a :math:`2 \pi`. Nuestra señal en teoría debería seguir :math:`S(\phi) = \frac{1}{2}(1+\cos(n \phi))`. Luego realizamos una Transformada Discreta de Fourier (Discrete Fourier Transform, DFT: :math:`I_{v}=(1/N)|\sum_{\phi}e^{iv\phi}S(\phi)`) para extraer la Fidelidad de el estado, definido por los límites :math:`2\sqrt{I_{n}} \leq F \leq \sqrt{I_{0}/2}+ \sqrt{I_{n}}`; si se desea, se puede obtener un valor real para la fidelidad: :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1})+\sqrt{I_{n}})` (arXiv: 1905.05720).
ja_jp: このMQC回路で実験を行った後、 :math:`\phi` を :math:`0` から :math:`2 \pi` までスイープしたときの振動を観察するための状態を選択できます。理論的には、信号は :math:`S(\phi) = \frac{1}{2}(1+\cos(n \phi))` に従う必要があります。 次に、離散フーリエ変換（DFT： :math:`I_{v}=(1/N)|\sum_{\phi}e^{iv\phi}S(\phi)` ）を実行して、境界 :math:`2\sqrt{I_{n}} \leq F \leq \sqrt{I_{0}/2}+ \sqrt{I_{n}}` で定義される状態の忠実度を抽出します。必要に応じて、忠実度の実際の値を取得できます： :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1})+\sqrt{I_{n}})` （arXiv：1905.05720）。
ru_ru: После проведения экспериментов с этой схемой MQC, мы можем выбрать состояние для наблюдения колебаний поскольку :math:`\phi` меняется от :math:`0` до :math:`2 \pi`. Теоретически наш сигнал должен иметь вид :math:`S(\phi) = \frac{1}{2}(1+\cos(n \phi))`. Затем мы выполняем дискретное преобразование Фурье (ДПФ: :math:`I_{v}=(1/N)|\sum_{\phi}e^{iv\phi}S(\phi)`), чтобы извлечь точность состояния, лежащую в пределах :math:`2\sqrt{I_{n}} \leq F \leq \sqrt{I_{0}/2}+ \sqrt{I_{n}}`; при желании можно получить фактическое значение точности: :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1})+\sqrt{I_{n}})` (arXiv:1905.05720).
ta_in: இந்த MQC சர்க்யூட்டில் சோதனைகளை இயக்கிய பிறகு, நாம் துடைக்கும்போது ஊசலாட்டங்களைக் கவனிக்க ஒரு மாநிலத்தைத் தேர்வு செய்யலாம் :math:`\phi` from :math:`0` to :math:`2 \pi`. கோட்பாட்டில் எங்கள் சமிக்ஞை பின்வருமாறு :math:`S(\phi) = \frac{1}{2}(1+\cos(n \phi))`. நம்பகத்தன்மையை பிரித்தெடுக்க ஒரு தனித்துவமான ஃபோரியர் உருமாற்றத்தை (DFT: :math:`I_{v}=(1/N)|\sum_{\phi}e^{iv\phi}S(\phi)`) செய்கிறோம். எல்லைகளால் வரையறுக்கப்பட்ட நிலை :math:`2\sqrt{I_{n}} \leq F \leq \sqrt{I_{0}/2}+ \sqrt{I_{n}}`; விரும்பினால், நம்பகத்தன்மைக்கான உண்மையான மதிப்பைப் பெறலாம்: :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1})+\sqrt{I_{n}})` (arXiv:1905.05720).
tr_tr: Bu MQC devresinde deneyleri çalıştırdıktan sonra, :math:`0` den :math:`2 \pi` e :math:`\phi` i taradığımız esnada salınımları gözlemlemek için bir durum seçebiliriz. Teorik olarak bizim sinyalimiz :math:`S(\phi) = \frac{1}{2}(1+cos(n \phi))` ni takip etmeli. O zaman sınırları :math:`2\sqrt{I_{n}} \leq F \leq \sqrt{I_{0}/2}+ \sqrt{I_{n}}` olarak tanımlanmış durumun doğruluğunu arttırmak için Ayrık Fourier Dönüşümü (DFT: :math:`I_{v}=(1/N)|\Sigma_{\phi}e^{iv\phi}S(\phi)`) yürütebiliriz; eğer istenirse; doğruluk için gerçek bir değer elde edilebilir: :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1})+\sqrt{I_{n}})` (arXiv:1905.05720).
zh_tw: 在這個 MQC 電路上做完實驗後，可以選擇一個狀態來觀察當我們把角度 :math:`\phi` 從 :math:`0` 掃到 :math:`2 \pi` 的震盪。 理論上，我們的訊號應該遵循 :math:`S(\phi) = \frac{1}{2}(1+\cos(n \phi))`。 然後我們執行一個離散傅立葉變換(DFT: :math:`I_{v}=(1/N)|\sum_{\phi}e^{iv\phi}S(\phi)`) 以汲取該狀態被邊界條件所定義的保真度 :math:`2\sqrt{I_{n}} \leq F \leq \sqrt{I_{0}/2}+ \sqrt{I_{n}}`; 想要的話，我們也可以獲得一個保真度的實際值 :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1})+\sqrt{I_{n}})` (arXiv:1905.05720)。

source: Parity Oscillations
bn_bn: প্যারিটি দোলন (অসিলেশন)
es_un: Oscilaciones de Paridad
fr_fr: Oscillations de parité
ja_jp: パリティ振動
pt_br: Oscilações de Paridade
ru_ru: Осцилляции четности
ta_in: பரிதி ஊசலாட்டங்கள்
tr_tr: Parite Salınımları
zh_tw: 宇稱震盪

source: The next method we use to characterize the GHZ state is parity oscillations. After preparing a GHZ state, we apply a combination of rotations about the x and y axes to create various superposition states as a function of :math:`\phi`: :math:`U(\phi) = \otimes_{j}^{N} e^{i\frac{\pi}{4}(\cos(\phi)\sigma_{x}^{j}+\sin(\phi)\sigma_{y}^{j})}`. We then measure the expectation value :math:`\langle \otimes_{j}^{N} \sigma_{z}^{j} \rangle_{\phi}` as a function of :math:`\phi`, which in theory should lead to parity oscillations between 1 and -1.
bn_bn: GHZ অবস্থা (স্টেট) চিহ্নিত করার জন্য আমরা পরবর্তী যে পদ্ধতিটি ব্যবহার করি তা হল প্যারিটি দোলন (অসিলেশন)। একটি GHZ অবস্থা (স্টেট) প্রস্তুত করার পর আমরা x এবং y অক্ষের উপর ঘূর্ণনের সংমিশ্রণ প্রয়োগ করি যাতে :math:`\phi`: :math:`U(\phi) = \otimes_{j}^{N} e^{i\frac{\pi}{4}(\cos(\phi)\sigma_{x}^{j}+\sin(\phi)\sigma_{y}^{j})}` -এর অন্বয় (ফাংশন) হিসাবে বিভিন্ন সুপারপজিশন অবস্থা তৈরি হয়। আমরা তারপর প্রত্যাশা মান :math:`\langle \otimes_{j}^{N} \sigma_{z}^{j} \rangle_{\phi}`, :math:`\phi` এর অন্বয় (ফাংশন) হিসেবে পরিমাপ করি যা তাত্ত্বিকভাবে 1 এবং -1 এর মধ্যে প্যারিটি দোলন (অসিলেশন) পরিচালিত করা উচিত।
es_un: El siguiente método que usamos para caracterizar el estado GHZ son las oscilaciones de paridad. Después de preparar un estado GHZ, aplicamos una combinación de rotaciones sobre los ejes x e y para crear varios estados de superposición en función de :math:`\phi`: :math:`U(\phi) = \otimes_{j}^{N} e^{i\frac{\pi}{4}(\cos(\phi)\sigma_{x}^{j}+\sin(\phi)\sigma_{y}^{j})}`. Luego medimos el valor esperado :math:`\langle \otimes_{j}^{N} \sigma_{z}^{j} \rangle_{\phi}` en función de :math:`\phi`, que en teoría debería conducir a oscilaciones de paridad entre 1 y -1.
ja_jp: GHZ状態を特徴づけるために使用する次の方法は、パリティ振動です。GHZ状態を準備した後、x軸とy軸を中心とした回転の組み合わせを適用して、 :math:`\phi` ： :math:`U(\phi) = \otimes_{j}^{N} e^{i\frac{\pi}{4}(\cos(\phi)\sigma_{x}^{j}+\sin(\phi)\sigma_{y}^{j})}` の関数としてさまざまな重ね合わせ状態を作成します。次に、期待値 :math:`\langle \otimes_{j}^{N} \sigma_{z}^{j} \rangle_{\phi}` を :math:`\phi` の関数として測定します。これにより、理論的には1と-1の間のパリティ振動が発生するはずです。
ru_ru: Следующий метод, который мы используем для характеристики состояния GHZ, — это осцилляции четности. После подготовки GHZ состояния, мы используем комбинацию вращений вокруг осей x и y для создания различных суперпозиционных состояний в зависимости от :math:`\phi`: :math:`U(\phi) = \otimes_{j}^{N} e^{i\frac{\pi}{4}(\cos(\phi)\sigma_{x}^{j}+\sin(\phi)\sigma_{y}^{j})}`. Затем мы измеряем матожидание :math:`\langle \otimes_{j}^{N} \sigma_{z}^{j} \rangle_{\phi}` как функцию :math:`\phi`, что в теории должно привести к осцилляциям четности между 1 и -1.
ta_in: GHZ நிலையை வகைப்படுத்த நாம் பயன்படுத்தும் அடுத்த முறை பரிதி ஊசலாட்டங்கள். ஒரு GHZ நிலையைத் தயாரித்த பிறகு, x மற்றும் y அச்சுகளைப் பற்றிய சுழற்சிகளின் கலவையை பல்வேறு சூப்பர்போசிஷன் நிலைகளை ஒரு செயல்பாடாக உருவாக்குகிறோம் :math:`\phi`: :math:`U(\phi) = \otimes_{j}^{N} e^{i\frac{\pi}{4}(\cos(\phi)\sigma_{x}^{j}+\sin(\phi)\sigma_{y}^{j})}`. நாங்கள் எதிர்பார்ப்பு மதிப்பை அளவிடுகிறோம் :math:`\langle \otimes_{j}^{N} \sigma_{z}^{j} \rangle_{\phi}` இன் செயல்பாடாக :math:`\phi`, இது கோட்பாட்டில் 1 மற்றும் -1 க்கு இடையில் பரிதி ஊசலாட்டங்களுக்கு வழிவகுக்கும்.
tr_tr: GHZ durumunu karakterize etmek için kullanacağımız bir sonraki yöntem, parite salınımlarıdır. Bir GHZ durumu hazırladıktan sonra, bir :math:`\phi`: :math:`U(\phi) = \otimes_{j}^{N} e^{i\frac{\pi}{4}(cos(\phi)\sigma_{x}^{j}+sin(\phi)\sigma_{y}^{j})}` fonksiyonu olarak çeşitli süperpozisyon durumları oluşturmak için x ve y eksenleri etrafında bir dönüş kombinasyonu uyguluyoruz. Daha sonra bir :math:`\phi` fonksiyonu olarak beklenen değeri :math:`\langle \otimes_{j}^{N} \sigma_{z}^{j} \rangle_{\phi} ölçüyoruz, ki teoride 1 ve -1 arasındaki parite salınımlarına neden olmalı.
zh_tw: 用於測量 GHZ 狀態的下一種方法是宇稱震盪。 準備好一個 GHZ 狀態後，我們套用一個以 x 軸和 y 軸的旋轉組合以創建各種疊加狀態，該疊加狀態是一個函數，其自變數為 :math:`\phi`: :math:`U(\phi) = \otimes_{j}^{N} e^{i\frac{\pi}{4}(\cos(\phi)\sigma_{x}^{j}+\sin(\phi)\sigma_{y}^{j})}`。我們接著測量期望值:math:`\langle \otimes_{j}^{N} \sigma_{z}^{j} \rangle_{\phi}`，此期望值是一個函數，其自變數為 :math:`\phi`，這在理論上應該會導致 1 和 -1 之間的宇稱震盪。

source: The following function generates a circuit which is the Parity Oscillation equivalent of the MQC circuit given above
bn_bn: নীচের ফাংশনটি একটি বর্তনী (সার্কিট) তৈরি করে যা উপরের এমকিউসি বর্তনীর (সার্কিট) প্যারিটি দোলনের (অসিলেশন) সমতুল্য
es_un: La siguiente función genera un circuito que es el equivalente de la Oscilación de Paridad del circuito MQC dado anteriormente
fr_fr: La fonction suivante génère un circuit qui est l'équivalent en oscillation de parité du circuit MQC indiqué ci-dessus
ja_jp: 次の関数は、上記のMQC回路と同等のパリティ発振である回路を生成します。
pt_br: A função a seguir gera um circuito que é o equivalente de Oscilação de Paridade do circuito MQC dado acima
ru_ru: Следующая функция генерирует схему, которая является эквивалентом схемы MQC, приведенной выше, по отношению к осцилляции четности
ta_in: பின்வரும் செயல்பாடு ஒரு சர்கூட் ஒன்றை உருவாக்குகிறது, இது மேலே கொடுக்கப்பட்ட MQC சர்கூட்டுக்கு பரிதி ஊசலாட்டமாகும்
tr_tr: Aşağıdaki fonksiyon, yukarıda verilen MQC devresinin Parite Salınım eşdeğeri olan bir devre oluşturur.
zh_tw: 以下的函數會產生一個等效於上述 MQC 電路的宇稱震盪電路。

source: We can obtain fidelity for parity oscillations :math:`S_{\phi}` from :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1}+C)`, where :math:`C`, the coherence is defined as :math:`2\sqrt{I_{n}}`, following the same convention for the DFT as with the MQC method.
bn_bn: আমরা :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1}+C)` থেকে প্যারিটি অসিলেশন (দোলন) :math:`S_{\phi}`এর জন্য বিশ্বস্ততা অর্জন করতে পারি, যেখানে যেখানে ডিএফটি এর জন্য এমকিউসি এর মতন নিয়ম অনুসরণ করে সমদশা (কোহেরেন্স) :math:`C`কে সংজ্ঞায়িত করা হয় :math:`2\sqrt{I_{n}}` হিসেবে।
es_un: Podemos obtener la fidelidad para las oscilaciones de paridad :math:`S_{\phi}` desde :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1}+C)`, donde :math:`C`, es la coherencia y se define como :math:`2\sqrt{I_{n}}`, siguiendo la misma convención para el DFT que con el método MQC.
fr_fr: Nous pouvons obtenir la fidélité pour les oscillations de parité :math:` S_ { \phi } ` de :math:` F = \frac{1}{2}(P_{00...0}+ P_{11...1}+ C) `, où :math:` C `, la cohérence est définie comme :math:` 2\sqrt { I_{n}} `, suivant la même convention pour la DFT que pour la méthode MQC.
ja_jp: :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1}+C)` からパリティ振動 :math:`S_{\phi}` の忠実度を取得できます。ここでの :math:`C` について、コヒーレンスは :math:`2\sqrt{I_{n}}` として定義され、MQCメソッドの場合と同じDFTの規則に従います。
pt_br: Podemos obter a fidelidade para oscilações de paridade :math:`S_{\phi}` from :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1}+C)`, na qual :math:`C`, a coerência é definida como :math:`2\sqrt{I_{n}}`, seguindo a mesma convenção para o DFT como com o método MQC.
ru_ru: Мы можем получить точность для осцилляций четности :math:`S_{\phi}` из :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1}+C)`, где :math:`C` — когерентность, которая определяется как :math:`2\sqrt{I_{n}}`, следуя тому же определению для DFT, что и в методе MQC.
ta_in: பரிதி ஊசலாட்டங்களுக்கான சரிபார்த்தலை நாம் :math:`S_{\phi}` from :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1}+C)` பெறலாம், :math:`C`,ஒத்திசைவு பின்வருமாறு வரையறுக்கப்படுகிறது :math:`2\sqrt{I_{n}}`, MQC முறையைப் போலவே DFTக்கான அதே இணக்கத்தைப் பின்பற்றுகிறது.
tr_tr: :math:`C` de, eş fazlı olma durumu :math:`2\sqrt{I_{n}}` olarak tanımlandığında, Parite salınımları için doğruluğu :math:`S_{\phi}` from :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1}+C)` olarak elde edebiliriz, MQC yöntemiyle olduğu gibi DFT için de aynı kural izlenir.
zh_tw: 從 :math:`F = \frac{1}{2}(P_{00...0}+P_{11...1}+C)` 我們可以得到宇稱震盪的保真度 :math:`S_{\phi}`，其中 :math:`C`是相干，其定義為 :math:`2\sqrt{I_{n}}`，遵循和在 MQC 方法中 DFT 的相同表達式。

source: Tomography
bn_bn: টমোগ্রাফি
es_un: Tomografía
fr_fr: Tomographie
ja_jp: トモグラフィー
pt_br: Tomografia
ru_ru: Томография
ta_in: முப்பரிமாண வரவி
tr_tr: Tomografi
zh_tw: 斷層掃描
