Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/noise/9_entanglement_verification.po
Languages: bn_bn, es_un, fr_fr, ja_jp, pt_br, ru_ru, ta_in, tr_tr, zh_tw

source: Tomography measures the density matrix by producing many nominally identical states and measuring the state instances in different bases. The ideal result of a GHZ state is four equal density matrix elements at the 4 corners of the tensor-product basis, with all other elements vanishing. Although the fidelity can be readily calculated by this method, the method is slow (requires exponential number of measurements in n), and takes prohibitively long times if n is larger than 7 or so. Nevertheless, we will show below how to perform this method as it is relevant for small numbers of qubits.
bn_bn: টমোগ্রাফি অনেক নামমাত্র অভিন্ন অবস্থা (স্টেট) উৎপাদন করে এবং বিভিন্ন ভিত্তিতে (বেসিস) মানের উদাহরণগুলি পরিমাপ করে ঘনত্বের ম্যাট্রিক্স পরিমাপ করে। একটি জি এহচ জেড অবস্থার (স্টেট) আদর্শ ফলাফল হল টেনসর-গুনফল ভিত্তিতে চারটি কোণে চারটি সমান ঘনত্বের ম্যাট্রিক্স উপাদান থাকা, যেখানে অন্য সমস্ত উপাদান অদৃশ্য হয়ে যায়। যদিও এই পদ্ধতি দ্বারা বিশ্বস্ততা সহজেই গণনা করা যায়, তবুও পদ্ধতিটি ধীর গতিতে (n সংখ্যার জন্য সূচকীয় হিসাবের প্রয়োজন), এবং n এর মান ৭ বা তার বেশি হলে এটি অসম্ভব বেশি সময় নেয়। আমরা এই পদ্ধতিটি কীভাবে সম্পাদন করব তা নীচে দেখাব কারণ এটি অল্প সংখ্যক কিউবিটের জন্য প্রাসঙ্গিক।
es_un: La tomografía mide la matriz de densidad produciendo muchos estados nominalmente idénticos y midiendo las instancias de estado en diferentes bases. El resultado ideal de un estado GHZ son cuatro elementos de matriz de igual densidad en las 4 esquinas de la base del producto tensorial, con todos los demás elementos en cero. Aunque la fidelidad se puede calcular fácilmente con este método, el método es lento (requiere un número exponencial de mediciones en n) y toma tiempos prohibitivamente largos si n es mayor que 7 aproximadamente. Sin embargo, mostraremos a continuación cómo realizar este método ya que es relevante para pequeñas cantidades de qubits.
fr_fr: La tomographie mesure la matrice de densité en produisant de nombreux états nominalement identiques et en mesurant les instances d'état dans différentes bases. Le résultat idéal d'un état GHZ est de quatre éléments de matrice de densité égale aux 4 coins de la base du produit tensoriel, tous les autres éléments disparaissent. Bien que la fidélité puisse être facilement calculée par cette méthode, la méthode est lente (nécessite un nombre exponentiel de mesures par rapport à n), et devient très longue au delà de 7. Néanmoins, nous montrerons ci-dessous comment effectuer cette méthode car elle est pertinente pour un petit nombre de qubits.
ja_jp: トモグラフィーは、多くの名目上同一の状態を生成し、異なる基底の状態インスタンスを測定することによって密度行列を測定します。GHZ状態の理想的な結果は、他のすべての要素が消失するテンソル積基底の4つのコーナーで4つの等しい密度行列要素である。この方法で忠実度を容易に計算することができますが、この方法は遅く（指数関数的な数の測定を必要とします）、nが7よりも大きい場合には法外に長い時間がかかります。とはいえ、この方法は少数の量子ビットに対しても有効であるため、以下にその方法を紹介します。
pt_br: A tomografia mede a matriz densidade produzindo muitos estados nominalmente idênticos e medindo as instâncias dos estados em diferentes bases. O resultado ideal de um estado GHZ são quatro elementos da matriz densidade iguais nos 4 cantos da base de produto tensorial, com todos os outros elementos desaparecendo. Embora a fidelidade possa ser prontamente calculada por este método, o método é lento (requer um número exponencial de medições em n), e toma tempos proibitivamente longos se n for maior que 7 ou próximo. Não obstante, mostraremos abaixo como executar este método já que ele é relevante para pequenos números de qubits.
ru_ru: Томография измеряет матрицу плотности путем создания множества номинально идентичных состояний и измерения экземпляров состояний в различных базисах. Идеальным результатом состояния GHZ являются четыре одинаковых элемента матрицы плотности в четырех углах базиса тензорного произведения и отсутствие всех остальных. Хотя точность можно легко вычислить этим методом, этот метод является довольно медленным (требует экспоненциального числа измерений в n) и требует непомерно много времени, если n больше 7 или около того. Тем не менее, ниже мы покажем, как его выполнить, поскольку он актуален для небольшого числа кубитов.
ta_in: முப்பரிமாண வரவி பல பெயரளவில் ஒரே மாதிரியான நிலைகளை உருவாக்குவதன் மூலமும், வெவ்வேறு நிகழ்வுகளில் நிலை நிகழ்வுகளை அளவிடுவதன் மூலமும் டென்சிட்டி மேட்ரிஸை அளவிடுகிறது. GHZ நிலையின் சிறந்த முடிவு டென்சர்-தயாரிப்பு அடிப்படையில் 4 மூலைகளில் நான்கு சம டென்சிட்டி மேட்ரிஸ் உறுப்புகள், மற்ற அனைத்து உறுப்புகளும் மறைந்துவிடும். இந்த முறையால் சரிபார்த்தலை உடனடியாகக் கணக்கிட முடியும் என்றாலும், இந்த முறை மெதுவாக உள்ளது (n இல் அதிவேக எண்ணிக்கையிலான அளவீடுகள் தேவை), மேலும் n 7 அல்லது அதற்கு மேற்பட்டதாக இருந்தால் தடைசெய்யப்பட்ட நீண்ட நேரம் எடுக்கும். ஆயினும்கூட, இந்த முறையை சிறிய எண்ணிக்கையிலான க்யூபிட்ஸ்களுக்குப் பொருத்தமாக இருப்பதால் அதை எவ்வாறு செய்வது என்று கீழே காண்பிப்போம்.
tr_tr: Tomografi, nominal olarak özdeş birçok durumu üreterek ve farklı temellerdeki durum örneklerini ölçerek yoğunluk matrisini ölçer. Bir GHZ durumunun ideal sonucu, tensör-çarpımı temelinin 4 köşesindeki dört eşit yoğunluklu matris elemanıdır ve diğer tüm elemanlar kaybolur. Aslına uygunluk bu yöntemle kolayca hesaplanabilse de, yöntem yavaştır (n cinsinden üstel ölçüm sayısı gerektirir) ve n'nin 7'den büyük olması halinde engelleyici şekilde uzun süreler alır. Ancak, az sayıdaki kübitlerle ilgili olduğundan, bu yöntemin nasıl gerçekleştirileceğini aşağıda göstereceğiz.
zh_tw: 斷層掃描通過產生許多名義上相同的狀態並在不同基底中測量不同的狀態實例，以測量密度矩陣。 GHZ 狀態的理想結果是在張量積的四個角落的密度矩陣元素彼此相同，而所有其他元素消失不見。 雖然這種方法可以很容易地計算保真度，但此方法是緩慢 (需要指數數量級的 n 次量測)，並且如果 n 大於 7 左右，則該方法需要長到難以實現的時間來運行。 不過，我們會在下面演示如何執行此方法，因為它在少量的量子位元情況下還是可行的。

source: Parallelizing circuits
bn_bn: বর্তনী (সার্কিট) সমান্তরাল করা
es_un: Paralelización de circuitos
fr_fr: Parallélisation des circuits
ja_jp: 回路の並列化
pt_br: Paralelizando circuitos
ru_ru: Распараллеливание схем
ta_in: இணையான சர்கூட்
tr_tr: Devrelerin Paralelleştirilmesi
zh_tw: 並行化電路

source: The above “linear” circuits are good to perform simulations, but what do we do when we use real devices, where the system can have an arbitrary topology and various errors? We are specifically targeting real hardware here, not just Aer simulation. One technique to reduce real-hardware effects is to parallelize the CNOT gates and thus create a shorter-depth circuit. This can be hugely beneficial efficiency wise, and fidelity wise. The class ``BConfig`` from the module ``parallelize`` does exactly this.
bn_bn: উপরের "রৈখিক" বর্তনী (সার্কিট) সিমুলেশনের জন্য ভাল, তবে আমরা যখন সত্যিকারের ডিভাইসগুলি ব্যবহার করি, যেখানে সিস্টেমে যথেচ্ছ টপোলজি এবং তাতে বিভিন্ন ত্রুটি থাকতে পারে। আমরা এখানে এয়ার সিমুলেশন নয়, বিশেষত আসল হার্ডওয়্যারটিকে লক্ষ্য করছি। আসল হার্ডওয়্যার এর প্রভাবগুলি হ্রাস করার একটি কৌশল হ'ল CNOT যুক্তিবর্তনীসমূহ (গেইট) সমান্তরাল করা এবং এভাবে একটি অল্প-গভীরতার সার্কিট তৈরি করা। দক্ষতা এবং বিশ্বস্ততার হিসেবে এটি অত্যন্ত উপকারী হতে পারে। মডিউল ``parallelize`` থেকে ``BConfig`` শ্রেণিটি ঠিক এই কাজটি করে।
es_un: Los circuitos "lineales" anteriores son buenos para realizar simulaciones, pero ¿qué hacemos cuando usamos dispositivos reales, donde el sistema puede tener una topología arbitraria y varios errores? Aquí estamos fijándonos específicamente en el hardware real, no solo a la simulación Aer. Una técnica para reducir los efectos del hardware real es paralelizar las puertas CNOT y así crear un circuito de menor profundidad. Esto puede ser muy beneficioso en términos de eficiencia y fidelidad. La clase ``BConfig`` del módulo ``parallelize`` hace exactamente esto.
ja_jp: 上記の「線形」回路は、シミュレーションを実行するのに適していますが、実際のデバイスを使用するときはどうすれば良いでしょうか。各システムは任意のトポロジーをもち、さまざまなエラーが発生するため、どうすればよいでしょうか。 ここではAer シミュレーションだけではなく、実際のハードウェアをターゲットにしています。 実際のハードウェアに起因する影響を減らすための 1 つの方法は、 CNOT ゲートを並列化することで、より短い回路を作成することです。 これは効率の観点からも忠実度の観点からも非常に有益です。モジュール ``parallelize`` のクラス ``BConfig`` はまさにこれを行います。
ru_ru: Приведенные выше “линейные” цепи хороши для проведения симуляций, но что делать, если мы используем реальные устройства, в которых система может иметь произвольную топологию и различные ошибки? Здесь мы ориентируемся именно на реальное оборудование, а не просто на симуляции Aer. Одним из методов уменьшения влияния реального оборудования является распараллеливание операций CNOT и создание таким образом схемы меньшей глубины. Это может принести огромную пользу как в плане эффективности, так и в плане достоверности. Класс ``BConfig`` из модуля ``parallelize`` делает именно это.
ta_in: மேலே உள்ள “நேரியல்r” சுற்றுகள் உருவகப்படுத்துதல்களைச் செய்வது நல்லது, ஆனால் உண்மையான devices பயன்படுத்தும் போது நாம் என்ன செய்வது, அங்கு கணினி தன்னிச்சையான இடவியல் மற்றும் பல்வேறு பிழைகள் இருக்கக்கூடும்? Aer உருவகப்படுத்துதல் மட்டுமல்லாமல், உண்மையான வன்பொருளை இங்கு இலக்கு வைக்கிறோம். உண்மையான-வன்பொருள் விளைவுகளை குறைப்பதற்கான ஒரு நுட்பம், CNOT கேட்ஸ்களை இணைத்து, குறுகிய-ஆழ சர்கூட் ஒன்றை உருவாக்குவதாகும். இது மிகவும் பயனுள்ள செயல்திறன் வாரியாகவும், சரிபார்த்தல் வாரியாகவும் இருக்கும். ``parallelize`` தொகுதியிலிருந்து ``BConfig`` வகுப்பு இதைச் சரியாகச் செய்கிறது.
tr_tr: Yukarıdaki "lineer" devreler simülasyon yapmak için iyidir, ancak sistemin keyfi bir topolojiye ve çeşitli hatalara sahip olabileceği gerçek aygıtları kullandığımızda ne yaparız? Burada sadece Aer simülasyonunu değil, gerçek donanımı hedeflemekteyiz. Gerçek donanım etkilerini azaltmak için bir teknik, CNOT kapılarını paralel hale getirmek ve böylece daha kısa derinlikli bir devre oluşturmaktır. Bu, verimlilik açısından ve doğruluk açısından oldukça faydalı olabilir. ``parallelize`` modülündeki ``BConfig`` sınıfı tam olarak bunu yapar.
zh_tw: 上面的 “線性” 電路非常適合運行模擬，但當我們使用真實器件時，由於每個系統具有一個任意的拓撲 (toplogy) 並且會發生各種錯誤，我們該怎麼辦？ 我們的目標是真正的硬體，而不僅僅是 Aer 模擬。 減少實際硬件影響的一種方法是通過並行化 CNOT 閘來創建較淺層的電路。 這在效率和保真度方面都是非常有益的。 ``parallelize`` 模組中的 ``BConfig`` 類別即可完成上述的任務。

source: First we must configure the optimal backend we want to use. We will consider a simulation backend, ``'ibmq_qasm_simulator'``, disguised as a real device, ``'ibmq_16_melbourne'`` by using a the mock backend ``'FakeMelbourne'``
bn_bn: প্রথমে আমরা যেমনটি চাই তেমন সেরা অনুকূল একটি ব্যাকএন্ড সাজাতে হবে। আমরা ``'ibmq_qasm_simulator'`` একটি সিমুলেশন ব্যাকএন্ড বিবেচনা করব যা একটি নকল ব্যাকএন্ড ``'FakeMelbourne'`` ব্যবহার করে বাস্তব ডিভাইস ``'ibmq_16_melbourne'`` এর ছদ্মবেশ নেয়।
es_un: Primero debemos configurar el backend óptimo que queremos utilizar. Consideraremos un backend de simulación, ``'ibmq_qasm_simulator'``, disfrazado como un dispositivo real, ``'ibmq_16_melbourne'`` mediante el uso de un backend emulado (mock) ``'FakeMelbourne'``
fr_fr: Tout d'abord, nous devons configurer le backend optimal que nous voulons utiliser. Nous considérerons un backend de simulation, ``ibmq_qasm_simulateur``, déguisé en un véritable appareil, ``ibmq_16_melbourne`` en utilisant un faux backend ``FakeMelbourne``
ja_jp: まず、使用するバックエンドを最適なものに設定しなければなりません。ここではシミュレーションバックエンドである ``'ibmq_qasm_simulator'`` を実際のデバイスである ``'ibmq_16_melbourne'`` に見立てて、モックバックエンドである ``'FakeMelbourne'`` を使用します。
pt_br: Primeiro devemos configurar o backend ótimo que queremos utilizar. Consideraremos um backend de simulação, ``'ibmq_qasm_simulator'``, disfarçado como um dispositivo real, ``'ibmq_16_melbourne'``, usando um backend falso ``'FakeMelbourne'``
ru_ru: Сначала мы должны настроить оптимальный бэкенд, который мы хотим использовать. Мы рассмотрим бэкенд-симулятор, ``'ibmq_qasm_simulator'``, замаскированный под реальное устройство ``'ibmq_16_melbourne'``, с помощью имитации ``'FakeMelbourne'``
ta_in: முதலில் நாம் பயன்படுத்த விரும்பும் உகந்த பின்தளத்தில் உள்ளமைக்க வேண்டும். ஒரு உண்மையான device மாறுவேடமிட்டுள்ள ``'ibmq_qasm_simulator'`` என்ற உருவகப்படுத்துதல் பின்தளத்தில், ``'ibmq_16_melbourne'`` ஒரு போலி பின்தளத்தில் ``'FakeMelbourne'`` ஐப் பயன்படுத்துவோம்
tr_tr: Öncelikle kullanmak istediğimiz en uygun arka ucu yapılandırmalıyız. Sahte bir arka uç ``FakeMelbourne '' kullanarak gerçek bir cihaz olan ``'ibmq_16_melbourne'`` görünümüne bürünmüş ``'ibmq_qasm_simulator'`` simülasyon arka ucunu ele alacağız
zh_tw: 首先，我們必須配置我們想要使用的最佳後端。 我們將考慮透過一個仿效後端``'FakeMelbourne'``將一個模擬後端 ``'ibmq_qasm_simulator'`` 偽裝成一個真實器件``'ibmq_16_melbourne'``。

source: Using the ``noise`` module, we can now define a noise model from ``'ibmq_16_melbourne'`` to “assign” to ``'ibmq_qasm_simulator'``.
bn_bn: ``noise`` মডিউল ব্যবহারের মাধ্যমে আমরা এখন `'ibmq_16_melbourne'`` থেকে একটি দূষণ (নয়েজ) নকশা সংজ্ঞায়িত করতে পারি যাতে তাকে ``'ibmq_qasm_simulator'``-এ নিয়োগ করা যায় ।.
es_un: Usando el módulo ``noise``, ahora podemos definir un modelo de ruido usando ``'ibmq_16_melbourne'`` para “asignárselo” a ``'ibmq_qasm_simulator'``.
ja_jp: ``noise`` モジュールを使用して、``'ibmq_16_melbourne'`` から ``'ibmq_qasm_simulator'`` への割り当てまでノイズモデルを定義することができます。
ru_ru: Теперь, используя модуль ``noise``, мы можем определить модель шума из ``'ibmq_16_melbourne'`` для "присвоения" в ``'ibmq_qasm_simulator'``.
ta_in: ``இரைச்சல்`` தொகுதியைப் பயன்படுத்தி, இப்போது ``'ibmq_16_melbourne'`` இலிருந்து ``'ibmq_qasm_simulator'`` க்கு "ஒதுக்க" ஒரு இரைச்சல் மாதிரியை வரையறுக்கலாம்.
tr_tr: ``noise`` modülünü kullanarak ``'ibmq_qasm_simulator'``'e gönderilmek üzere ``'ibmq_16_melbourne'``'dan bir gürültü modeli tanımlayabiliriz.
zh_tw: 通過使用此 ``噪音`` 模組，我們現在可以在 ``'ibmq_16_melbourne'`` 中定義一個噪音模型並將之 “指派 (assign) ” 到 ``'ibmq_qasm_simulator'``。

source: And there we have it. From now on, in the tutorial, when using a real device, not a simulation, just take out every mention and assignment of ``noise_model`` and ``coupling_map``, and assign the real device to ``backend``. The simulator used from now on is no substitute for running a real device.
bn_bn: তো হয়েই গেলো । এখন থেকে, পাঠে (টিউটোরিয়াল) কোনও সিমুলেশন নয়, আসল ডিভাইসটি ব্যবহার করার সময়, ``noise_model`` আর ``coupling_map`` এর প্রতিটি উল্লেখ এবং কাজ বাদ দিয়ে দিন এবং আসল ডিভাইসটিকে ``backend`` এ নিয়োগ করুন। এখন থেকে যে সিমুলেটর ব্যবহার হবে তা আসল ডিভাইসের কোন বিকল্প হতে পারেনা।
es_un: Y ahí lo tenemos. A partir de ahora, en el tutorial, cuando se utilice un dispositivo real, no una simulación, simplemente elimine cada mención y asignación de ``noise_model`` y ``coupling_map``, y asigne el dispositivo real a ``backend``. El simulador utilizado a partir de ahora no sustituye a la ejecución de un dispositivo real.
fr_fr: Et là, nous l'avons. A partir de maintenant, dans le tutoriel, lors de l'utilisation d'un véritable appareil, pas d'une simulation, il suffit de mentionner le ``noise_model`` et ``coupling_map``, et d'assigner le vrai dispositif à ``backend``. Le simulateur utilisé à partir de maintenant n'est pas un substitut à l'exécution d'un véritable appareil.
ja_jp: これで完成です。今後のチュートリアルでは、シミュレーションではなく実デバイスを使う場合は、 ``noise_model`` と ``coupling_map`` の記述と割り当てをすべて削除し、実デバイスを ``backend`` に割り当ててください。これから使うシミュレータは、実デバイスを動かすことに代わるものではありません。
pt_br: E aqui está. A partir de agora, no tutorial, quando usar um dispositivo real, não uma simulação, basta tirar todas as menções e atribuições de ``noise_model`` e ``coupling_map``, e atribuir o dispositivo real a ``backend``. O simulador usado a partir de agora não é nenhum substituto para a execução em um dispositivo real.
ru_ru: Вот и все. С этого момента в учебнике при использовании реального устройства, а не симулятора, просто уберите все упоминания и указания на ``noise_model`` и ``coupling_map``, и присвойте ``backend`` реальное устройство. Используемый здесь и далее симулятор не заменит реального устройства.
ta_in: அங்கே நாம் அதை வைத்திருக்கிறோம். இனிமேல், பயிற்சிகளில், ஒரு உண்மையான device பயன்படுத்தும் போது, ​​ஒரு உருவகப்படுத்துதல் அல்ல, ``noise_model`` மற்றும் ``coupling_map`` ஆகியவற்றின் ஒவ்வொரு குறிப்பையும் ஒதுக்கீட்டையும் எடுத்து, உண்மையான device ``backend`` ஒதுக்கவும். இனிமேல் பயன்படுத்தப்படும் சிமுலேட்டர் உண்மையான device இயக்குவதற்கு மாற்றாக இல்லை.
tr_tr: Ve işte burada. Şu andan itibaren, öğreticide bir simülasyon değil, gerçek bir cihaz kullanırken, ``noise_model´´ ve ``coupling_map´´ ile ilgili her sözü ve atamayı çıkarın ve gerçek cihazı ``backend´´e atayın. Şu andan itibaren kullanılan simülatör, gerçek bir cihazı çalıştırmanın yerini tutamaz.
zh_tw: 好的現在我們擁有它了。 從現在開始，在此教程中當我們使用真實器件而非模擬時，請刪除對 ``noise_model`` 和 ``couple_map`` 的所有提及 (mention) 和指派(assignment)，並將真實器件指派 (assign) 給 ``backend``。 從現在開始使用的模擬器，無法替代執行真實器件。

source: ``BConfig`` lays the blueprint for creating parallelized circuits. Let us initialize an object taking in the real device we just defined, and name it ``protocirc``. All of our experiments will use it:
bn_bn: ``BConfig`` সমান্তরাল সার্কিট তৈরি করার নীলনকশাটি প্রদান করে। আসুন আমাদের সুনির্দিষ্টভাবে সংজ্ঞায়িত বাস্তব ডিভাইসের সাথে একটি অবজেক্টকে সংজ্ঞায়িত করি এবং এর নাম রাখি ``protocirc``। আমাদের সমস্ত পরীক্ষাগুলি এটি ব্যবহার করবে:
es_un: ``BConfig`` establece el plan para crear circuitos paralelizados. Inicialicemos un objeto tomando el dispositivo real que acabamos de definir y llamémoslo ``protocirc``. Todos nuestros experimentos lo usarán:
ja_jp: ``BConfig`` は、並列化された回路を作成するための設計図を示します。 先ほど定義した実際のデバイスを取り込んだオブジェクトを初期化し、``protocirc`` という名前を付けましょう。すべての実験で使用します:
ru_ru: ``BConfig`` закладывает основу для создания распараллеленных цепей. Давайте инициализируем объект, принимающий реальное устройство, которое мы только что определили, и назовем его ``protocirc``. Он будет использоваться во всех наших экспериментах:
ta_in: இணையான சர்கூடை உருவாக்குவதற்கான வரைபடத்தை ``BConfig`` வைக்கிறது. நாம் இப்போது வரையறுத்துள்ள உண்மையான device ஒரு பொருளை எடுத்துக்கொள்வதைத் துவக்கி, அதற்கு ``protocirc`` என்று பெயரிடுவோம். எங்கள் பரிசோதனைகள் அனைத்தும் இதைப் பயன்படுத்தும்:
tr_tr: ``BConfig``, paralelleştirilmiş devreler oluşturmanın planını oluşturmaktadır. Az önce tanımladığımız gerçek cihazı alan bir nesneyi başlatalım ve ona ``protocirc´´ adını verelim. Tüm deneylerimiz bunu kullanacak:
zh_tw: ``BConfig`` 為建立平行化電路勾勒其藍圖。 讓我們初始化一個物件(此物件會把我們剛才定義的真實器件作為輸入)，並將其命名為 ``protocirc``。我們的所有實驗都將會使用它：

source: Error Mitigation
bn_bn: ত্রুটি দূরীকরণ
es_un: Mitigación de errores
fr_fr: Atténuation d'erreurs
ja_jp: エラー軽減
pt_br: Mitigação De Erros
ru_ru: Уменьшение ошибок
ta_in: பிழை குறைத்தல்
tr_tr: Hata Azaltma
zh_tw: 錯誤緩解

source: Qiskit Ignis provides very accurate tools to take raw data and return calibrated data. This is done by getting the raw data, in the form of a vector :math:`v_{raw}` and getting a calibration matrix :math:`A`. The output is then the solution to the optimization problem: :math:`argmin_{v_{cal}} ||Av_{cal}-v_{raw}||^{2}`
bn_bn: Qiskit ইগ্নিস প্রাথমিক ডেটা নিতে এবং ক্যালিব্রেটেড ডেটা ফেরত দেওয়ার জন্য খুব সঠিক সরঞ্জাম সরবরাহ করে। এটি একটি ভেক্টর :math:`v_{raw}` আকারে প্রাথমিক তথ্য এবং এবং একটি ক্রমাঙ্কন ম্যাট্রিক্স :math:`A` নেয়। অনুকূলায়ন (অপ্টিমাইজেশন) সমস্যাসমূহর সমাধান হল আউটপুট :math:`argmin_{v_{cal}} ||Av_{cal}-v_{raw}||^{2}`
es_un: Qiskit Ignis proporciona herramientas muy precisas para tomar datos crudos y devolver datos calibrados. Esto se hace obteniendo los datos crudos, en la forma de un vector :math:`v_{raw}` y obteniendo una matriz de calibración :math:`A`. La salida es entonces la solución al problema de optimización: :math:`argmin_{v_{cal}} ||Av_{cal}-v_{raw}||^{2}`
fr_fr: Qiskit Ignis fournit des outils très précis pour prendre des données brutes et retourner les données calibrées. Pour ce faire, on obtient les données brutes, sous la forme d'un vecteur :math:` v_{raw}` et on obtient une matrice d'étalonnage :math:`A`. La sortie est alors la solution au problème d'optimisation: :math:` argmin_ { v_{cal}} | | Av_{cal}-v_{raw}| | ^{2}`
ja_jp: Qiskit Ignisは、生データを取得して較正済みデータを返すための非常に正確なツールを提供しています。これは，生データをベクトル :math:`v_{raw}` の形式で取得し，較正行列 :math:`A` を取得することで行われます．出力は，最適化問題の解となります： :math:`argmin_{v_{cal}}}．||Av_{cal}-v_{raw}||^{2}`
pt_br: O Qiskit Ignis fornece ferramentas muito precisas para receber dados brutos e retornar dados calibrados. Isto é feito através da obtenção dos dados brutos, na forma de um vetor :math:`v_{raw}` e obtendo uma matriz de calibração :math:`A`. A saída é, então, a solução para o problema de otimização: :math:`argmin_{v_{cal}} ||Av_{cal}-v_{raw}||^{2}`
ru_ru: Qiskit Ignis содержит очень точные инструменты для получения исходных данных и возврата откалиброванных данных. Это делается путем получения исходных данных в виде вектора :math:`v_{raw}` и получения калибровочной матрицы :math:`A`. На выходе получается решение задачи оптимизации: :math:`argmin_{v_{cal}} ||Av_{cal}-v_{raw}||^{2}`
ta_in: பதனிடப்படாத தரவுகளை எடுத்து அளவீடு செய்யப்பட்ட தரவைத் தர Qiskit Ignis மிகவும் துல்லியமான கருவிகளை வழங்குகிறது. பதனிடப்படாத தரவுகளை ஒரு vector வடிவத்தில் பெறுவதன் மூலம் இது செய்யப்படுகிறது :math:`v_{raw}` மற்றும் ஒரு அளவொப்புமை அணி :math:`A`. வெளியீடு பின்னர் தேர்வுமுறை சிக்கலுக்கான தீர்வாகும் :math:`argmin_{v_{cal}} ||Av_{cal}-v_{raw}||^{2}`
tr_tr: Qiskit Ignis, işlenmemiş verileri almak ve kalibre edilmiş verileri döndürmek için çok doğru araçlar sağlar. Bu işlem, işlenmemiş verileri bir vektör :math:` v_{raw}` ve bir kalibrasyon matrisi :math:` A ' biçiminde elde etmek suretiyle yapılır. Daha sonra sonuç, şu optimizasyon problemine çözüm olur: :math:` argmin_ { v_{cal}} | | Av_{cal}-v_{raw}| | ^{2}`
zh_tw: Qiskit Ignis 為輸入原始數據和輸出校準過的數據提供了非常準確的工具。 這是通過取得向量 :math:`v_{raw}` 形式原始數據，以及取得一個校正矩陣 :math:`A`。 則其輸出會是一個最佳化問題的解: :math:`argmin_{v_{cal}} ||Av_{cal}-v_{raw}||^{2}`

source: Experiment Time
bn_bn: পরীক্ষণের সময়
es_un: Tiempo del Experimento
fr_fr: Phase d'expérimentation
ja_jp: 実験時間
pt_br: Hora do experimento
ru_ru: Приступим к эксперименту
ta_in: பரிசோதனை நேரம்
tr_tr: Deney Süresi
zh_tw: 實驗時間

source: Preliminary Steps
bn_bn: প্রাথমিক ধাপসমূহ
es_un: Pasos preliminares
fr_fr: Étapes préliminaires
ja_jp: 事前ステップ
pt_br: Etapas Preliminares
ru_ru: Предварительные шаги
ta_in: பூர்வாங்க படிகள்
tr_tr: Ön Adımlar
zh_tw: 初步步驟

source: The probabilities of measuring :math:`|0\rangle ^{\otimes n}` and :math:`|1\rangle^{\otimes n}` in the GHZ state are important in calculating fidelity. For this, we need to run the following test
bn_bn: বিশ্বস্ততার গণনা করার জন্য জিএইচজেড অবস্থার (স্টেট) মধ্যে :math:`|0\rangle ^{\otimes n}` এবং :math:`|1\rangle^{\otimes n}` পরিমাপের সম্ভাবনাগুলি গুরুত্বপূর্ণ। এই জন্য, আমাদের নিম্নলিখিত পরীক্ষা চালানো প্রয়োজন
es_un: Las probabilidades de medir :math:`|0\rangle ^{\otimes n}` y :math:`|1\rangle^{\otimes n}` en el estado GHZ son importantes para calcular la fidelidad. Para esto, necesitamos ejecutar la siguiente prueba
fr_fr: Les probabilités de mesurer :math:`|0\rangle ^ { \otimes n }` et :math:` | 1\rangle ^ { \otimes n }` dans l'état GHZ sont importantes pour le calcul de la fidélité. Pour cela, nous devons exécuter le test suivant :
ja_jp: GHZ 状態の :math:`|0\rangle^{\otimes n}` と :math:`|1\rangle ^{\otimes n}` を測定する確率は、忠実度を計算する上で重要です。 このためには、次のテストを実行する必要があります
pt_br: As probabilidades de medir :math:`|0\rangle ^{\otimes n}` e :math:`|1\rangle^{\otimes n}` no estado GHZ são importantes no cálculo da fidelidade. Para isso, precisamos executar o teste a seguir
ru_ru: При расчете достоверности важны вероятности измерения :math:`|0\rangle ^{\otimes n}` и :math:`|1\rangle^{\otimes n}` в состоянии GHZ. Вычислим их с помощью следующего теста
ta_in: அளவிடுவதற்கான நிகழ்தகவுகள் :math:`|0\rangle ^{\otimes n}` மற்றும் :math:`|1\rangle^{\otimes n}` GHZ நிலையில் சரிபார்த்தலை கணக்கிடுவதில் முக்கியம். இதற்காக, பின்வரும் சோதனையை இயக்க வேண்டும்
tr_tr: GHZ durumundaki :math:`|0\rangle ^{\otimes n}` ve :math:`|1\rangle^{\otimes n}` ölçüm olasılıkları, doğruluk hesaplamasında önemlidir. Bunun için aşağıdaki testi yapmamız gerekiyor
zh_tw: 在 GHZ 狀態中，測量 :math:`|0\rangle ^{\otimes n}` 和 :math:`|1\rangle^{\otimes n}`的機率在計算保真度時非常重要。 為此，我們需要執行以下測試
