Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/01_advanced_circuits.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ko, pl, pt_un, ru_ru, ta_in, tr_tr

source: This page was generated from `tutorials/circuits_advanced/01_advanced_circuits.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/circuits_advanced/1_advanced_circuits.ipynb`__ থেকে উৎপন্ন হয়েছে।
es_un: Esta página fue generada a partir de ` tutorials/circuits_advanced/01_advanced_circuits.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/circuits_advanced/1_advanced_circuits.ipynb`__.
id_id: Halaman ini dibuat dari ` tutorials/circuits_advanced/01_advanced_circuits.ipynb ` __.
it_it: Questa pagina è stata generata a partire da `tutorials/circuits_advanced/01_advanced_circuits.ipynb`__.
ko: 이 페이지는 `tutorials/circuits_advanced/01_advanced_circuits.ipynb`__ 로부터 생성되었다.
pl: Ta strona została wygenerowana z `tutorials/circuits_advanced/01_advanced_circuits.ipynb`__.
pt_un: Esta página foi gerada a partir do `tutorials/circuits_advanced/01_advanced_circuits.ipynb`__.
ru_ru: Страница создана на основе `tutorials/circuits_advanced/01_advanced_circuits.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/circuits_advanced/01_advanced_circuits.ipynb`__ இருந்து உருவாக்கப்பட்டது.
tr_tr: Bu sayfa `tutorials/circuits_advanced/01_advanced_circuits.ipynb`__ adresinden oluşturulmuştur.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/01_advanced_circuits.ipynb>`_.
id_id: Jalankan secara interaktif di 'IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/01_advanced_circuits.ipynb>` _.
ta_in: கருப்பொருளில் ஊடாடும் வகையில் இயக்கவும் `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits/1_getting_started_with_qiskit.ipynb>`_.

source: Advanced Circuits
bn_bn: উন্নত সার্কিটসমূহ
es_un: Circuitos Avanzados
fr_fr: Circuits avancés
id_id: Sirkuit Lanjutan
it_it: Circuiti Avanzati
ko: 고급 회로
pl: Zaawansowane Obwody
pt_un: Circuitos Avançados
ru_ru: Расширенные возможности при создании цепей
ta_in: மேம்பட்ட மின்சாரம்
tr_tr: İleri Düzey Devreler

source: Opaque gates
bn_bn: অস্বচ্ছ গেটসমূহ
es_un: Compuertas opacas
fr_fr: Portes opaques
id_id: Gate Opaq
it_it: Gates opachi
ko: 불투명한 게이트 (Opaque gates)
pl: Bramki nieprzejrzyste
pt_un: Gates opacos
ru_ru: Непрозрачные гейты
ta_in: ஒளிபுகா கேட்டுகள்
tr_tr: Opak kapılar

source: Composite Gates
bn_bn: সংমিশ্রিত গেটসমূহ
es_un: Compuertas compuestas
fr_fr: Portes composites
id_id: Gate Komposit
it_it: Gates Composti
ko: 합성 게이트들
pl: Bramki złożone
pt_un: Portões compostos
ru_ru: Конструирование гейтов
ta_in: கலப்பு கேட்டுகள்
tr_tr: Bileşik Kapılar

source: Circuits are not immediately decomposed upon conversion ``to_instruction`` to allow circuit design at higher levels of abstraction. When desired, or before compilation, sub-circuits will be decomposed via the ``decompose`` method.
bn_bn: বিমূর্ততার উচ্চ স্তরে সার্কিট ডিজাইনে সাহায্যে করার জন্য ``to_instruction``- এ রূপান্তর করার পরে সার্কিটগুলি সাথে সাথে ডিকম্পোজ হয় না।
es_un: Los circuitos no se descomponen inmediatamente después de la conversión ``to_instruction`` para permitir el diseño del circuito en niveles de abstracción más altos. Cuando se desee, o antes de la compliación, los sub-circuitos se descomprondrán utilizando el método ``decompose``.
fr_fr: Les circuits ne sont pas immédiatement décomposés lors de la conversion ` ` to_instruction ` ` pour permettre la conception de circuits à des niveaux d'abstraction plus élevés. Lorsque vous le souhaitez, ou avant la compilation, les sous-circuits seront décomposés via la méthode ` ` decompose ` `.
id_id: Sirkuit tidak segera terurai pada konversi ` ` to_instruksi ` ` untuk memungkinkan desain sirkuit pada tingkat yang lebih tinggi pada saat abstraksi. Ketika diinginkan, atau sebelum kompilasi, sub-sirkuit akan terurai melalui metode ` ` decompose ` `.
it_it: I circuiti non vengono immediatamente decomposti durante la conversione ``to_instruction`` per consentire la progettazione di circuiti a livelli più alti di astrazione. Se lo si desidera, o prima della compilazione, i sotto circuiti verranno decomposti utilizzando il metodo ``decompose``.
ko: 회로들은 ``to_instruction`` 명령어에 의해 바로 분해되지는 않는데, 이는 회로 설계를 더 고차원의 추상화 단계에서 가능하게 해준다. 임의로 지정된 순간 또는 컴파일 전에, 하위 회로들은 메소드 ``decompose`` 에 의해 분해될 것이다.
pl: Obwody nie są dekomponowane od razu po konwersji na instrukcje ``to_instruction`` aby umożliwić projektowanie obwodów na wyższych poziomach abstrakcji. Gdy jest to pożądane, lub przed kompilacją, pod-obwody zostaną zdekomponowane za pomocą metody ``decompose``.
pt_un: Os circuitos não são imediatamente decompostos mediante a conversão ``to_instruction``, para permitir o design do circuito em níveis mais elevados de abstração. Quando desejado, ou antes da compilação, os sub-circuitos serão decompostos através do método ``decompose``.
ru_ru: Результат вызова подцепи с помощью ``to_instruction`` отображается в виде единого гейта, что позволяет абстрагироваться от его содержания при высокоуровневом проектировании. Разбиение на составляющие происходит непосредственно перед компиляцией или при необходимости вручную с помощью метода ``decompose``.
ta_in: அதிக அளவிலான சுருக்கத்தில் சுற்று வடிவமைப்பை அனுமதிக்க ``to_instruction`` ஐ மாற்றும்போது சுற்றுகள் உடனடியாக சிதைக்கப்படுவதில்லை. விரும்பும் போது, ​​அல்லது தொகுக்கப்படுவதற்கு முன்பு, துணை சுற்றுகள் ``decompose`` முறை வழியாக சிதைக்கப்படும்.
tr_tr: Daha yüksek soyutlama seviyelerinde devre tasarımına izin vermek için ``to_instruction`` dönüşümü üzerine devreler hemen ayrıştırılmaz. İstendiğinde veya derlemeden önce, alt devreler ``decompose`` yöntemi ile ayrıştırılacaktır.

source: Parameterized circuits
bn_bn: প্যারামিটারাইজড সার্কিটসমূহ
es_un: Circuitos parametrizados
fr_fr: Circuits paramétrés
id_id: Sirkuit Berparameter
it_it: Circuiti parametrizzati
ko: 매개변수를 가진 회로들
pl: Obwody sparametryzowane
pt_un: Circuitos parametrizados
ru_ru: Параметризованные цепи
ta_in: அளவுரு சுற்றுகள்
tr_tr: Parametreli devreler

source: We can inspect the circuitâ€™s parameters
id_id: Kita bisa memeriksa parameter dari sirkuit

source: Binding parameters to values
bn_bn: প্যারামিটারের মানগুলি একত্রিত করা
es_un: Vinculando parámetros a valores
fr_fr: Lier les paramètres aux valeurs
id_id: Tautan parameter ke nilai
it_it: Associare i parametri ai valori
ko: 값에 매개변수 바인딩하기
pl: Powiązanie parametrów z wartościami
pt_un: Vinculando parâmetros aos valores
ru_ru: Присваивание значений
ta_in: அளவுருக்களை மதிப்புகளுடன் பிணைத்தல்
tr_tr: Parametreleri değerlere bağlama

source: All circuit parameters must be bound before sending the circuit to a backend. This can be done in one of two ways: - The ``bind_parameters`` method accepts a dictionary mapping ``Parameter``\ s to values, and returns a new circuit with each parameter replaced by its corresponding value. Partial binding is supported, in which case the returned circuit will be parameterized by any ``Parameter``\ s that were not mapped to a value.
es_un: Todos los parámetros de circuito deben estar enlazados antes de enviar el circuito a un backend. Esto se puede hacer de dos maneras: - El método ``bind_parameters`` acepta una correlación de diccionario ``Parameter`` a valores, y devuelve un nuevo circuito con cada parámetro sustituido por su valor correspondiente. Se da soporte al enlace parcial, en cuyo caso el circuito devuelto será parametrizado por cualquier ``Parameter`` que no se correlacionaron con un valor.
fr_fr: Tous les paramètres du circuit doivent être liés avant d'envoyer le circuit à un système d'execution. Cela peut se faire de l'une des deux manières suivantes: - La méthode ` ` bind_parameters ` ` accepte un mappage de ` ` Parameter ` \ s taux valeurs, et retourne un nouveau circuit ou chaque paramètre est remplacé par sa valeur correspondante. Une liaison -bind- partielle est prise en charge, auquel cas le circuit retourné aura comme paramètre(s) les ` ` paramètre ` \ s pour lesquels une valuer n'a pas été fournie.
id_id: Semua parameter sirkuit harus terbaut sebelum mengirim sirkuit ke backend. Hal ini dapat dilakukan dalam salah satu dari dua cara:-` ` ` bind_parameters ` ` method menerima sebuah pemetaan kamus ` ` Parameter ` ` ` \ s ke nilai, dan mengembalikan sebuah sirkuit baru dengan masing-masing parameter diganti dengan nilai yang sesuai. Pembautan parsial didukung, dalam hal ini sirkuit yang dikembalikan akan diparameterisasi oleh setiap ` ` ` parameter ` ` ` \ s yang tidak dipetakan ke nilai.
it_it: Tutti i parametri del circuito devono essere collegati prima di inviare il circuito a un backend. Questo può essere fatto in due modi: - Il metodo ``bind_parameters`` accetta un dizionario di mappatura dei ``Parameter``\ s ai valori e restituisce un nuovo circuito in cui ogni parametro viene sostituito dal suo valore corrispondente. È supportato un binding parziale, nel qual caso il circuito restituito sarà parametrizzato da qualsiasi ``Parameter``\ s che non è stato mappato ad un valore.
ru_ru: Перед отправкой такой цепи на бэкенд (окружение) необходимо определить все ее параметры. Это можно сделать двумя способами: - Метод ``bind_parameters`` задает соответствие словаря ``Parameter`` и набора данных, возвращая новую цепь с конкретными значениями. С его помощью можно также выполнять частичное соответствие, уменьшая тем самым число параметров, оставшихся незаданными.
ta_in: ஒரு பின்னணியை அனுப்புவதற்கு முன் அனைத்து சுற்றுச்சொல் அளவுருக்கள் பிணைந்திருக்க வேண்டும். இதை இரண்டு வழிகளில் ஒன்றில் செய்யலாம்: - ``bind_parameters``முறையில் ஒரு அகராதியை ஏற்றுக்கொள்கிறார் ``Parameter``\ s மதிப்புகளுக்கு, ஒவ்வொரு அளவுருவுடனும் ஒரு புதிய சுற்றுக்கு அதனுடன் தொடர்புடைய மதிப்பீட்டாளரை வழங்குகிறது. பகிர்வு பிணைப்பு ஆதரவு உள்ளது, இதில் திருப்பப்பட்ட சுற்றுப்பயணம் எந்த ``Parameter``\ s ஒரு மதிப்புக்கு வரையறுக்கப்படவில்லை.
tr_tr: Devreyi bir arka uca göndermeden önce tüm devre parametreleri bağlanmalıdır. Bu iki yoldan biriyle yapılabilir: - ``bind_parameters`` yöntemi, ``Parameter``\s değerlerini eşleştiren bir sözlük kabul eder ve her parametresi karşılık gelen değerle değiştirilmiş yeni bir devre döndürür. Kısmi bağlama desteklenmektedir, bu durumda döndürülen devre bir değere eşlenmemiş herhangi bir ``Parameter``\ ile parametrelendirilir.

source: ``qiskit.execute`` now accepts a ``parameter_binds`` keyword argument which, when specified as a list of dictionaries mapping ``Parameter``\ s to values, will bind and execute a circuit on the backend for every mapping dictionary in the list.
es_un: ``qiskit.execute`` ahora acepta un argumento de palabra clave ``parameter_binds`` que, cuando se especifica como una lista de diccionarios de correlación ``Parameter`` a valores, enlazará y ejecutará un circuito en el backend para cada diccionario de mapas de la lista.
fr_fr: ` `qiskit.execute ` ` accepte l'argument ` ` parameter_bind ` ` qui, lorsqu'il est spécifié comme une liste de corrrespondance de ` ` Parameter ` \ s vers des valeurs, va lier -binder- et exécuter un circuit sur le backend pour chaque dictionnaire de mappage -correspondance- de la liste.
id_id: ` `qiskit.eksekusi ` ` sekarang menerima sebuah ` ` ` parameter_bind ` ` argumen kata kunci yang, ketika dispesifikasikan sebagai daftar kamus kamus ` ` Parameter ` ` \ s ke nilai, akan mengikat dan mengeksekusi sebuah sirkuit pada backend untuk setiap kamus pemetaan dalam daftar.
it_it: ``qiskit.execute`` ora accetta l'argomento con parola chiave ``parameter_binds`` che, quando specificato come una lista di dizionari che mappano i ``Parameter``\ s ai valori, legherà ed eseguirà un circuito sul backend per ciascuna corrispondenza nella lista.
ru_ru: В настоящее время ``qiskit.execute`` может также выполнять установку параметров перед запуском цепи на бэкенде. В этом случае необходимо указать в аргументах набор данных с ключом ``parameter_binds``.
ta_in: ``qiskit.execute`` இப்போது ஒரு ``parameter_binds`` முக்கிய வாதத்தை ஏற்றுக்கொள்கிறது, இது ``parameter``\s இன் மதிப்புகளை மேப்பிங் செய்யும் அகராதிகளின் பட்டியலாகக் குறிப்பிடப்பட்டால், ஒவ்வொரு மேப்பிங் அகராதிக்கும் பின்தளத்தில் ஒரு சுற்றுகளை பிணைத்து இயக்கும். பட்டியலில்.
tr_tr: ``qiskit.execute`` artık `` Parameter``\s değerleriyle eşleştirilen sözlüklerin bir listesi olarak belirtildiğinde, her eşleme sözlüğü için arka uçta bir devre bağlayacak ve yürütecek bir ``parametre_binds`` anahtar kelime bağımsız değişkenini kabul ediyor.

source: In the example circuit, we apply a global :math:`R_z(\theta)` rotation on a five-qubit entangled state, and so expect to see oscillation in qubit-0 at :math:`5\theta`.
bn_bn: উদাহরণরত সার্কিটে, আমরা পাঁচ-কিউবিট বিভক্ত অবস্থায় একটি গ্লোবাল :math:`R_z(\theta)` প্রয়োগ করি, সুতরাং কিউবিট-0 তে :math:`5\theta` অবস্থাতে ওসিলেশন দেখার সম্ভাবনা বাড়ে।
es_un: En el circuito de ejemplo, aplicamos una rotación global de :math:` R_z (\theta) en un estado enredado de cinco qubits, y por lo tanto esperamos ver la oscilación en el qubit 0 a :math:` 5\theta `.
fr_fr: Dans cet exemple de circuit, nous appliquons une rotation globale :math:` R_z (\theta) sur un état à cinq qubits intriqués -entangled-, et nous nous attendons a voir une oscillation du qubit-0 de :math:` 5\theta `.
id_id: Dalam sirkuit contoh, kita menerapkan rotasi global :math:` R_z (\theta) ` pada lima qubit yang entangled, dan berharap untuk melihat osilasi dalam qubit-0 pada :math:` 5\theta `.
it_it: Nel circuito di esempio, applichiamo una rotazione globale :math:`R_z(\theta)` su uno stato con cinque qubit in entanglement, e ci aspettiamo quindi di vedere un'oscillazione del qubit 0 di: :math:`5\theta`.
ko: 예제 회로에서, 우리는 전역 :math:`R_z(\theta)` 회전을 5큐비트 얽힘 상태에 적용한다. 그에 따라 우리는 큐비트 0에서 :math:`5\theta` 의 진동을 관찰할 수 있을 것이다.
pl: W obwodzie przykładowym, stosujemy globalny obrót :math:`R_z(\theta)` do pięciokubitowego stanu splatanego, zatem spodziewamy się zobaczyć oscylacje na kubicie-0 przy :math:`5\theta`.
pt_un: No circuito de exemplo, aplicamos uma rotação global :math:`R_z(\theta)` em um estado enredado de cinco qubit, e então espere ver a oscilação em qubit-0 em :math:`5\theta`.
ru_ru: В этом примере мы делаем поворот глобальной фазы :math:`R_z(\theta)` запутанного состояния пятикубитной системы, ожидая увидеть осцилляции нулевого кубита :math:`5\theta`.
ta_in: எடுத்துக்காட்டு சுற்றுவட்டத்தில், நாங்கள் ஒரு உலகளாவிய :math:`R_z(\theta)` ஐந்து-குவிட் சிக்கலான நிலையில் சுழற்சி செய்கிறோம், எனவே குவிட்-0 இல் :math:`5\theta` ஊசலாட்டத்தைக் காணலாம்.
tr_tr: Örnek devrede, bir beş-kübit dolanık durumda global :math:`R_z(\theta)` döndürme uygular ve bu nedenle kübit-0'da :math:`5\theta`'da salınım görmeyi bekleriz.

source: Reducing compilation cost
bn_bn: সংকলন ব্যয় কমানো
es_un: Reduciendo el costo de compilación
fr_fr: Réduction du coût de compilation
id_id: Mengurangi biaya kompilasi
it_it: Ridurre i costi di compilazione
ko: 컴파일 비용 줄이기
pl: Zmniejszanie kosztów kompilacji
pt_un: Reduzindo o custo de compilação
ru_ru: Уменьшение издержек компиляции
ta_in: தொகுப்பு செலவைக் குறைத்தல்
tr_tr: Derleme maliyetinin azaltılması

source: Compiling over a parameterized circuit prior to binding can, in some cases, significantly reduce compilation time as compared to compiling over a set of bound circuits.
bn_bn: কিছু ক্ষেত্রে বাঁধাই না করা প্যারামিটার-যুক্ত সার্কিটের সংকলনে দেখা যায় যে সেটি বাঁধাই করা সার্কিট এর চেয়েও দ্রুত সংকলিত হচ্ছে।
es_un: La compilación sobre un circuito parametrizado antes del enlace puede, en algunos casos, reducir significativamente el tiempo de compilación en comparación con la compilación sobre un conjunto de circuitos enlazados.
fr_fr: La compilation sur un circuit paramétré avant la liaison -binding- peut, dans certains cas, réduire considérablement le temps de compilation par rapport à la compilation sur un ensemble de circuits liés.
id_id: Kompilasi sebuah sirkuit berparameter sebelum diikat dengan nilai parameter, dalam beberapa kasus, dapat secara signifikan mengurangi waktu kompilasi dibandingkan dengan kompilasi satu set sirkuit terkait nilai parameter.
it_it: La compilazione su un circuito parametrizzato prima del binding può, in alcuni casi, ridurre considerevolmente il tempo di compilazione rispetto alla compilazione su un insieme di circuiti collegati.
ko: 결합 전에 파라미터화된 회로를 컴파일하는 것은, 일부 경우에, 결합된 회로들의 세트를 통해 컴파일링하는 것과 비교하여 컴파일 시간을 상당히 감소시킬 수 있다.
pl: Kompilowanie sparametryzowanego obwodu przed powiązaniem może w niektórych przypadkach znacznie skrócić czas kompilacji w porównaniu z kompilowaniem zbioru związanych obwodów.
pt_un: Compilando um circuito parametrizado antes da ligação pode, em alguns casos, reduzir significativamente o tempo de compilação em comparação com a compilação de um conjunto de circuitos conectados.
ru_ru: Предварительная компиляция цепи до установки ее параметров может в некоторых случаях значительно сокращать затрачиваемое время.
ta_in: பிணைப்பதற்கு முந்தைய ஒரு பரிந்துரைக்கப்பட்ட சுற்றுப்பகுதியை ஒப்பிடுகையில், சில வழக்குகளிலும், கூடுதலான கணினிகளின் அமைப்பை ஒப்பிடுகையில், கூடுதலான நேரத்தைக் குறைக்க முடியும்.
tr_tr: Bağlamadan önce parametreli bir devre üzerinde derleme, bazı durumlarda, bir dizi bağlı devre üzerinde derlemeye kıyasla derleme süresini önemli ölçüde azaltabilir.

source: Composition
bn_bn: গঠন(Composition)
es_un: Composición
id_id: Komposisi
it_it: Composizione
ko: 합성
pl: Kompozycja
pt_un: Composição
ru_ru: Конструирование
ta_in: கலவை
tr_tr: Bileşim

source: Parameterized circuits can be composed like standard ``QuantumCircuit``\ s. Generally, when composing two parameterized circuits, the resulting circuit will be parameterized by the union of the parameters of the input circuits.
bn_bn: সাধারণ "কোয়ান্টাম সার্কিট" যেভাবে বানানো যায় ঠিক সেইভাবে প্যারামিটার-যুক্ত সার্কিটগুলো কেও বানানো যায়। যদি একটি প্যারামিটার-যুক্ত সার্কিট দুটি ভিন্ন প্যারামিটার-যুক্ত সার্কিট দ্বারা গঠিত হয়ে থাকে তাহলে সেটির প্যারামিটারগুলির মান সেই দুটি সার্কিট এর মিলন দ্বারা পরিচালিত হবে।
es_un: Los circuitos parametrizados pueden estar compuestos como ``QuantumCircuit`` estándar. Generalmente, al componer dos circuitos parametrizados, el circuito resultante será parametrizado por la unión de los parámetros de los circuitos de entrada.
fr_fr: Les circuits paramétrés peuvent être composés comme des ` ` QuantumCircuit ` ` \ s standard. En général, lors de la composition de deux circuits paramétrés, le circuit résultant sera paramétré par l'union des paramètres des circuits d'entrée.
id_id: Sirkuit parameterisasi dapat disusun seperti standar ``QuantumCircuit ``. Umumnya, ketika menyusun dua sirkuit parameterisasi, sirkuit yang dihasilkan akan diparameterisasi oleh union parameter dari sirkuit input.
it_it: I circuiti parametrizzati possono essere composti come nel caso di ``QuantumCircuit``\ s standard. In generale, quando si compongono due circuiti parametrizzati, il circuito risultante sarà parametrizzato dall'unione dei parametri dei circuiti di ingresso.
ko: 매개변수화 회로(Parameterized circuits) 는 표준인 ``QuantumCircuit``\ 와 같은 것으로 구성될 수 있다. 일반적으로, 두 개의 매개변수화 회로들을 구성할 때, 출력회로는 입력 회로들의 매개변수의 결합에 의해 매개변수를 가지게 된다.
pt_un: Circuitos parametrizados podem ser compostos como o padrão ``QuantumCircuit``\ s. Geralmente, ao compor dois circuitos parametrizados, o circuito resultante será parametrificado pela união dos parâmetros dos circuitos de entrada.
ru_ru: Вы можете использовать параметризованные цепи наряду с обычными ``QuantumCircuit`` для создания составных гейтов. Как правило, при использовании двух таких подцепей множества их параметров объединяются.
ta_in: அளவுருவாக்கப்பட்ட சுற்றுகள் நிலையான ``QuantumCircuit``\s போல உருவாக்கப்படலாம். பொதுவாக, இரண்டு அளவுரு சுற்றுகளை உருவாக்கும் போது, ​​இதன் விளைவாக வரும் சுற்று உள்ளீட்டு சுற்றுகளின் அளவுருக்களின் ஒன்றியத்தால் அளவுருவாக்கப்படும்.
tr_tr: Parametreli devreler standart ``QuantumCircuit``\ ler gibi oluşturulabilir. Genel olarak, iki parametreli devre oluştururken, ortaya çıkan devre, giriş devrelerinin parametrelerinin birleşmesiyle parametrelenecektir.
