Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/01_advanced_circuits.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ko, pl, pt_un, ru_ru, ta_in, tr_tr

source: However, parameter names must be unique within a given circuit. When attempting to add a parameter whose name is already present in the target circuit: - if the source and target share the same ``Parameter`` instance, the parameters will be assumed to be the same and combined - if the source and target have different ``Parameter`` instances, an error will be raised
bn_bn: কিন্তু প্যারামিটার এর নাম একটি সার্কিটে অনন্য হাওয়া দরকার। যদি উত্স এবং লক্ষ্য সার্কিটগুলি একই ``প্যারামিটার`` উদাহরণটি ভাগ করে তাহলে একই নামের প্যারামিটার সার্কিটিতে যোগ করবার সময়ে সেগুলি একটাই প্যারামিটার হিসাবে ধরা হবে। তা না হলে ত্রুটি উত্থাপিত হবে।
es_un: Sin embargo, los nombres de parámetros deben ser exclusivos dentro de un circuito determinado. Cuando se intenta añadir un parámetro cuyo nombre ya está presente en el circuito de destino:-si el origen y el destino comparten la misma instancia de ``Parameter`` En este caso, se supondrá que los parámetros son iguales y combinados: si la fuente y el destino tienen instancias de ``Parameter`` diferentes, se generará un error
fr_fr: Cependant, les noms de paramètre doivent être uniques dans un circuit donné. Lors de la tentative d'ajout d'un paramètre dont le nom est déjà présent dans le circuit cible: - si la source et la cible partagent la même instance ` ` Parameter ` `, les paramètres sont supposés être les mêmes et combinés - si la source et la cible ont des instances ` ` Parameter ` différentes, une erreur sera générée
id_id: Namun, nama parameter harus unik di dalam satu sirkuit tertentu. Ketika mencoba untuk menambahkan sebuah parameter yang namanya sudah ada dalam sirkuit target:-jika sumber dan target memiliki ``Parameter`` yang sama, parameter akan diasumsikan sama dan dikombinasikan-jika sumber dan target memiliki ``Parameter`` berberda, sebuah error akan dikeluarkan
it_it: Tuttavia, i nomi dei parametri devono essere univoci all'interno di un determinato circuito. Quando si tenta di aggiungere un parametro il cui nome è già presente nel circuito di destinazione: - se l'origine e la destinazione condividono la stessa istanza ``Parameter`` si presume che i parametri siano gli stessi e vengono combinati - se l'origine e la destinazione hanno invece istanze ``Parameter`` diverse, verrà generato un errore
ko: 그러나 매개변수 이름은 주어진 회로에서 고유해야 한다. 표적회로에 이름이 이미 있는 매개변수를 추가하려고 할 때: 소스와 표적이 동일한 ``Parameter`` 인스턴스를 공유하면, 매개변수가 동일한 것으로 간주된다. 만일 소스와 표적이 다른 ``Parameter`` 갖는 경우에는 오류가 발생한다.
pl: Jednakże nazwy parametrów muszą być unikalne w obrębie danego obwodu. Podczas próby dodania parametru, którego nazwa jest już obecna w obwodzie docelowym: - jeśli źródło i cel współdzielą tą samą instancję obiektu ``Parameter`` parametry zostaną uznane za takie same i połączone - jeśli źródło i cel mają różne instancje obiektu ``Parameter``, zostanie zgłoszony błąd
pt_un: No entanto, nomes de parâmetros devem ser únicos dentro de um determinado circuito. Quando se tenta adicionar um parâmetro cujo nome já está presente no circuito alvo: - se a fonte e o alvo compartilham a mesma instância ``Parameter``, os parâmetros serão assumidos como iguais e serão combinados - se a fonte e o alvo tiverem diferentes instâncias de ``Parameter``, um erro será gerado
ru_ru: Однако имена должны быть уникальными во всей цепи. При попытке добавить параметр с уже существующим названием: - если источник и назначение используют один и тот же экземпляр ``Parameter``, параметры будут считаться одинаковыми и объединяются - если источник и назначение имеют разные экземпляры ``Parameter``, возникнет ошибка
ta_in: எனினும், அளபுரு பெயர்கள் கொடுக்கப்பட்ட சுற்றுக்கள் உள்ளே தனித்தனியாக இருக்க வேண்டும். ஒரு அளபுரு சேர்க்க முயற்சிக்கும்போது யாருடைய பெயர் ஏற்கனவே இலக்கு சுழற்சியில் உள்ளது: - மூல மற்றும் இலக்கு ஒரே ``Parameter`` எடுத்துக்காட்டு, Parameter ஒரே மற்றும் கூட்டமாக இருக்க வேண்டும் என்றால்-மூல மற்றும் இலக்கு வேறுபாடு ``Parameter`` நிகழ்வுகளைக் கொண்டால், ஒரு பிழை எழுப்பப்படும்
tr_tr: Ancak, parametre adları belirli bir devre içinde benzersiz olmalıdır. Adı hedef devrede zaten mevcut olan bir parametre eklemeye çalışırken: - kaynak ve hedef aynı ``Parametre`` örneğini paylaşıyorsa, parametrelerin aynı ve kombine olduğu varsayılacaktır - kaynak ve hedefte farklı ``Parametre`` örnekleri, bir hata ortaya çıkar

source: To insert a subcircuit under a different parameterization, the ``to_instruction`` method accepts an optional argument (``parameter_map``) which, when present, will generate instructions with the source parameter replaced by a new parameter.
bn_bn: একটি পৃথক প্যারামিটারাইজেশনের অধীনে একটি সাবসারকিট প্রবেশ করানো ``to_instruction`` পদ্ধতিটির চ্ছিক বিকল্প``parameter_map`` দ্বারা সম্ভব যাহা নতুন পরামিতি দ্বারা প্রতিস্থাপিত উত্স পরামিতি সহ নির্দেশাবলী উত্পন্ন করবে।
es_un: Para insertar un subcircuito bajo una parametrización diferente, el método ``to_instruction`` acepta un argumento opcional (`parameter_map``) que, cuando está presente, generará instrucciones con el parámetro de origen sustituido por un nuevo parámetro.
fr_fr: Pour insérer un sous-circuit avec une paramétrisation différente, la méthode ` ` to_instruction ` ` accepte un argument optionnel (` ` parameter_map ` `) qui, lorsqu'il est présent, va générer des instructions ou le paramètre source sera remplacé par un nouveau paramètre.
id_id: Untuk memasukkan sebuah subsirkuit di bawah parameterisasi yang berbeda, metode ``to_instruction`` menerima argumen opsional (``parameter_map``) yang, ketika digunakan, akan menghasilkan instruksi dengan parameter lama yang diganti dengan parameter baru.
it_it: Per inserire un sotto circuito con una diversa parametrizzazione, il metodo ``to_instruction`` accetta un argomento facoltativo (``parameter_map``) che, quando presente, genererà istruzioni con il parametro sorgente sostituito da un nuovo parametro.
ko: 다른 매개변수화 과정을 거진 하위 회로를 추가하기 위해 메서드 ``to_instruction`` 은 추가 전달 인자 (``parameter_map``) 을 가질 수 있는데, 이것이 설정된 경우 소스의 매개변수들이 새로운 매개변수들로 치환된 명령어들을 만들게 된다.
pl: Aby umożliwić wstawianie podobwód z inną parametryzacją, metoda ``to_instruction`` przyjmuje opcjonalny argument (``parameter_map``), który, jeśli jest obecny, wygeneruje instrukcje z parametrem źródłowym zastąpionym przez nowy parametr.
pt_un: Para inserir um subcircuito sob uma parametrização diferente, o método ``to_instruction`` aceita um argumento opcional (``parameter_map``) que, quando presente, irá gerar instruções com o parâmetro de origem substituído por um novo parâmetro.
ru_ru: Для того чтобы вставить подцепь с иными параметрами, используется опциональный аргумент ``parameter_map`` метода ``to_instruction``, при наличии которого значение параметра изменится на новое.
tr_tr: Farklı bir parametreleştirme altında bir alt devre eklemek için, ``to_instruction`` yöntemi isteğe bağlı bir argümanı (``parametre_map``) kabul eder; bu, mevcut olduğunda yeni bir parametreyle değiştirilen kaynak parametresiyle talimatlar oluşturur.

source: We can inspect the circuit’s parameters
bn_bn: আমরা বর্তনীর প্যারামিটার দেখতে পারি
es_un: Podemos revisar los parámetros del circuito
fr_fr: Nous pouvons inspecter les paramètres du circuit
it_it: Possiamo ispezionare i parametri del circuito
pt_un: Podemos inspecionar os parâmetros do circuito
ru_ru: Можно посмотреть список параметров
ta_in: சுற்று அளவுருக்களை நாம் ஆய்வு செய்யலாம்
tr_tr: Devrenin parametrelerini inceleyebiliriz

source: All circuit parameters must be bound before sending the circuit to a backend. This can be done as follows: - The ``bind_parameters`` method accepts a dictionary mapping ``Parameter``\ s to values, and returns a new circuit with each parameter replaced by its corresponding value. Partial binding is supported, in which case the returned circuit will be parameterized by any ``Parameter``\ s that were not mapped to a value.
bn_bn: সার্কিটটিকে ব্যাকএন্ডে প্রেরণের আগে সমস্ত প্যারামিটারগুলি আবদ্ধ করা দরকার। এটি ২ ভাবে করা যায় - ``bind_parameters`` ব্যবহার করে যাহা একটি dictionary (Python প্রোগ্রামিং এ একটি তথ্য কাঠামো) সাহায্যে ``Parameter`` গুলোকে তাদের উপযুক্ত মান এ একত্রিত করে এবং প্রতিটি প্যারমিটারের সাথে সম্পর্কিত মান দ্বারা প্রতিস্থাপিত করে একটি নতুন সার্কিট ফিরিয়ে দেয়। এখানে আংশিক একত্রিত করা সম্ভব কিন্তু সেটা করলে যেই সার্কিট পাওয়া যাবে তাতে ```Parameter`` সম্পর্কিত মান প্রতিস্থাপিত করা থাকবে না।
ko: 모든 회로의 매개변수는 회로를 백엔드로 보내기 전에 값을 할당해야 한다. 이 작업은 다음을 따라 수행 가능하다: ``bind_parameters`` 메서드는 ``Parameter``\ 들의 값을 할당하는 딕셔너리를 받아들이고, 각각의 해당하는 매개변수가 그에 알맞는 값으로 바뀐 새로운 회로를 반환한다. 부분적인 값 지정도 지원되는데, 이 경우 반환된 회로는 특정 값에 할당된 적 없는 ``Parameter``\ 들로 매개변수가 지정된다.
pt_un: Todos os parâmetros de circuito devem ser ligados antes de enviar o circuito para um backend. Isto pode ser feito de duas maneiras: - O método ``bind_parameters`` aceita um dicionário mapeando ``Parameter``\s para valores, e retorna um novo circuito com cada parâmetro substituído pelo seu valor correspondente. A ligação parcial é suportada, e nesse caso o circuito retornado será parametrizado por qualquer ```Parameter``\ s que não foram mapeados para um valor.
