Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/02_operators_overview.po
Languages: bn_bn, fr, it_it, pt_un, ru, ta_in, tr

source: This page was generated from `tutorials/circuits_advanced/02_operators_overview.ipynb`__.
bn_bn: এই পাতাটির উৎস ``tutorials/circuits_advanced/02_operators_overview.ipynb`__ ।
fr: Cette page a été générée à partir de `tutorials/circuits_advanced/2_operators_overview.ipynb`__.
it_it: Questa pagina è stata generata a partire da `tutorials/circuits_advanced/02_operators_overview.ipynb`__.
pt_un: Esta página foi gerada a partir do `tutorials/circuits_advanced/02_operators_overview.ipynb`__.
ru: Страница создана на основе `tutorials/circuits_advanced/02_operators_overview.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/circuits_advanced/02_operators_overview.ipynb`__ இருந்து உருவாக்கப்பட்டது.
tr: Bu sayfa `tutorials/circuits_advanced/02_operators_overview.ipynb`__ adresinden oluşturulmuştur.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/02_operators_overview.ipynb>`_.
ta_in: இயக்குநிலை தொடர்புக்கு `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/02_operators_overview.ipynb>`_.

source: Operators
bn_bn: অপারেটরসমূহ
fr: Opérateurs
it_it: Operatori
pt_un: Operadores
ru: Операторы
ta_in: ஆபரேட்டர்கள்
tr: Operatörler

source: Operator Class
bn_bn: অপারেটর ক্লাস
fr: La Classe Opérateurs
it_it: Classe Operator
pt_un: Classe do operador
ru: Класс Operator
ta_in: ஆபரேட்டர் வகுப்பு
tr: Operatör Sınıfı

source: The ``Operator`` class is used in Qiskit to represent matrix operators acting on a quantum system. It has several methods to build composite operators using tensor products of smaller operators, and to compose operators.
bn_bn: Qiskit এ ``Operator`` ক্লাসটি কোয়ান্টামতন্ত্রের ওপর প্রয়োগকৃত ম্যাট্রিক্স অপারেটরসমূহকে প্রকাশ করে। এটি ছোট অপারেটরসমূহের টেনসর ফল ব্যবহার করে বিভিন্ন উপায়ে যৌগিক (কম্পোজিট) অপারেটর তৈরি করে।
fr: La classe ``Operator`` est utilisée dans Qiskit pour représenter toute matrice unitaire agissant sur un système quantique. Elle possède plusieurs méthodes qui permettent de construire des opérateurs composés en utilisant les produits tensoriels avec de plus petits opérateurs, et pour composer des opérateurs.
it_it: La classe ``Operator`` è utilizzata in Qiskit per rappresentare operatori di matrice che agiscono su un sistema quantistico. Ha diversi metodi per costruire operatori composti attraverso prodotti tensoriali di piccoli operatori, e per comporre operatori.
pt_un: A classe ``Operator`` é usada no Qiskit para representar operadores matriciais que atuam em um sistema quântico. Possui vários métodos para construir operadores compostos utilizando produtos tensoriais de operadores menores e para compor operadores.
ru: Класс ``Operator`` представляет в Qiskit матрицы операторов, действующих на состояние квантовой системы. Для более сложных вариантов есть некоторые методы объединения объектов на основе тензорного и матричного произведений.
ta_in: குவாண்டம் அமைப்பில் செயல்படும் மேட்ரிக்ஸ் ஆபரேட்டர்களைக் குறிக்க Qiskit-ல் ``Operator`` வகுப்பு பயன்படுத்தப்படுகிறது. சிறிய ஆபரேட்டர்களின் tensor product-கள் பயன்படுத்தி கலப்பு ஆபரேட்டர்களை உருவாக்குவதற்கும், ஆபரேட்டர்களை உருவாக்குவதற்கும் இது பல முறைகளைக் கொண்டுள்ளது.
tr: ``Operatör`` sınıfı, Qiskit'te bir kuantum sisteme etki eden matris operatörlerini temsil etmek için kullanılır. Daha küçük operatörlerin tensör çarpımlarını kullanarak bileşik operatörler tasarlamak ve operatörleri oluşturmak için çeşitli yöntemleri vardır.

source: Creating Operators
bn_bn: অপারেটর তৈরি করা
fr: Créer des Opérateurs
it_it: Creare Operatori
pt_un: Criando Operadores
ru: Создание операторов
ta_in: ஆபரேட்டர்களை உருவாக்குதல்
tr: Operatör Oluşturma

source: The easiest way to create an operator object is to initialize it with a matrix given as a list or a Numpy array. For example, to create a two-qubit Pauli-XX operator:
bn_bn: অপারেটর অবজেক্ট তৈরির সবচেয়ে সহজ উপায় হচ্ছে কোনো লিস্ট বা Numpy অ্যারে ধরনের ম্যাট্রিক্স ব্যবহার করা। একটি দ্বি-কিউবিট পউলি (Pauli) - XX অপারেটর তৈরির উপায় হলঃ
fr: Le moyen le plus simple pour créer un opérateur est de l'initialiser avec une matrice construite par une liste ou un tableau Numpy. Par exemple, pour créer un opérateur Pauli-XX sur deux qubits :
it_it: Il modo più semplice per creare un oggetto operatore è inizializzarlo con una matrice data come una lista o un array Numpy. Ad esempio, per creare un operatore Pauli-XX a due qubit:
pt_un: A maneira mais fácil de criar um objeto operador é inicializá-lo com uma matriz dada como uma lista ou como um arranjo Numpy. Por exemplo, para criar um operador Pauli-XX de dois qubits:
ru: Проще всего создать объект класса, инициализируя его как матрицу в виде списка или массива Numpy. Например так мы получим оператор XX, выполняющий логическое "НЕ" на обоих кубитах:
ta_in: ஒரு ஆபரேட்டர் ஆப்ஜெக்ட்டை உருவாக்குவதற்கான எளிதான வழி, ஒரு பட்டியல் அல்லது ஒரு வரிசை வரிசையாக கொடுக்கப்பட்ட மேட்ரிக்ஸுடன் அதை துவக்குவது. எடுத்துக்காட்டாக, இரண்டு-கியூபிட் Pauli-XX ஆபரேட்டரை உருவாக்க:
tr: Bir operatör nesnesi oluşturmanın en kolay yolu, onu liste veya Numpy dizisi olarak verilen bir matrisle başlatmaktır. Örneğin, iki kubitli bir Pauli-XX operatörü oluşturmak için:

source: Operator Properties
bn_bn: অপারেটরের বৈশিষ্ট্যসমূহ
fr: Propriétés de l'objet Operator
it_it: Proprietà dell'Operatore
pt_un: Propriedades do operador
ru: Свойства объекта
ta_in: ஆபரேட்டர் பண்புகள்
tr: Operatör Özellikleri

source: The operator object stores the underlying matrix, and the input and output dimension of subsystems.
bn_bn: অপারেটর অবজেক্টটি অন্তর্নিহিত ম্যাট্রিক্স এবং উপব্যবস্থার (সাবসিস্টেম) ইনপুট ও আউটপুট মাত্রা (ডাইমেনশন) সংরক্ষণ করে।
fr: L'objet ``operator`` contient la matrice ainsi que les dimensions d'entrée et de sortie d'un système ou d'un sous-système.
it_it: L'oggetto operatore memorizza la matrice sottostante, e la dimensione in ingresso e in uscita dei sottosistemi.
pt_un: O objeto operador armazena a matriz subjacente e a dimensão de entrada e de saída dos subsistemas.
ru: Оператор как объект хранит основную матрицу и данные о длине векторов на входе и выходе.
ta_in: ஆபரேட்டர் ஆப்ஜெக்ட் அடிப்படை மேட்ரிக்ஸ், மற்றும் துணை அமைப்புகளின் உள்ளீட்டு மற்றும் வெளியீடு பரிமாணங்களை சேமிக்கிறது.
tr: Operatör nesnesi, temel alınan matrisi ve alt sistemlerin giriş ve çıkış boyutlarını depolar.

source: ``data``: To access the underlying Numpy array, we may use the ``Operator.data`` property.
bn_bn: ``data``: এর অন্তর্বর্তী Numpy অ্যারেটির উপর কাজ করার জন্য আমরা ``Operator.data`` ব্যবহার করতে পারি।
fr: ``data`` : Permet d'accéder à la matrice Numpy sous-jacente en utilisant la propriété `Operator.data`.
pt_un: ``data``: Para acessar o array Numpy subjacente, nós podemos utilizar a propriedade ``Operator.data``.
ru: ``data``: Основной массив Numpy доступен через свойство ``Operator.data``.
ta_in: ``data``: அடிப்படை Numpy வரிசையை அணுக, நாங்கள் ``Operator.data`` பண்பைப் பயன்படுத்தலாம்.
tr: ``data``: Altındaki Numpy dizisine erişmek için ``Operator.data`` özelliğini kullanabiliriz.

source: ``dims``: To return the total input and output dimension of the operator, we may use the ``Operator.dim`` property. *Note: the output is returned as a tuple ``(input_dim, output_dim)``, which is the reverse of the shape of the underlying matrix.*
bn_bn: ``dims``: অপারেটরের মোট ইনপুট আউটপুট মাত্রা (ডাইমেনশন) জানতে ``Operator.dim`` ব্যবহার করা হয়। *নোটঃ আউটপুটটি একটি টাপল (tuple) ``(input_dim, output_dim)`` ফেরত দেয় যা কিনা ম্যাট্রিক্সের আকৃতির (শেইপ) বিপরীত।*
it_it: ``dims``: Per restituire la dimensione totale di input e output dell'operatore possiamo utilizzare la proprietà ``Operator.dim``. * Nota: l'output è restituito come una tupla ``(input_dim, output_dim)``, che corrisponde all'ordine inverso di colonne e righe della matrice sottostante.*
ta_in: ``dims``: ஆபரேட்டரின் மொத்த உள்ளீடு மற்றும் வெளியீட்டு பரிமாணத்தை திருப்பித் தர, நாங்கள் ``Operator.dim`` பண்பைப் பயன்படுத்தலாம். *குறிப்பு: வெளியீடாக ஒரு டப்பிள் ``(input_dim, output_dim)``, என வழங்கப்படுகிறது, இது அடிப்படை மேட்ரிக்ஸின் வடிவத்தின் தலைகீழ் ஆகும்.*

source: Input and Output Dimensions
bn_bn: ইনপুট এবং আউটপুট মাত্রা (ডাইমেনশন)
fr: Dimensions d'entrée et de sortie
it_it: Dimensioni di Input e Output
pt_un: Dimensões de Entrada e Saída
ru: Размер ввода и вывода
ta_in: உள்ளீடு மற்றும் வெளியீட்டு பரிமாணங்கள்
tr: Giriş ve Çıkış Boyutları

source: The operator class also keeps track of subsystem dimensions, which can be used for composing operators together. These can be accessed using the ``input_dims`` and ``output_dims`` functions.
bn_bn: অপারেটর ক্লাস সাবসিস্টেমের মাত্রার (ডাইমেনশন) ট্র্যাক রাখে যা অপারেটরগুলো একসাথে ব্যবহার করতে কাজে লাগে। এগুলো ``input_dims`` এবং ``output_dims`` ফাংশনের সাহায্যে অ্যাক্সেস করা যায়।
fr: La classe ``Operator`` contient également les dimensions du sous-système qui peut être utile pour la composition d'opérateurs. Les valeurs de ces dimensions peuvent être obtenues en utilisant les fonctions ``input_dims`` et ``output_dims``.
it_it: La classe di operatore tiene inoltre traccia delle dimensioni del sottosistema, che possono essere utilizzate per comporre insieme gli operatori. È possibile accedervi utilizzando le funzioni ``input_dims`` e ``output_dims``.
pt_un: A classe de operador também acompanha as dimensões dos subsistemas, que podem ser utilizadas para a composição conjunta dos operadores. Estes podem ser acessados utilizando as funções ``input_dims`` e ``output_dims``.
ru: Класс также отслеживает информацию о размерах подсистем, которая нужна при композиции операторов. Доступ к ней дают функции ``input_dims`` и ``output_dims``.
ta_in: ஆபரேட்டர் வகுப்பு துணை அமைப்பு பரிமாணங்களையும் தடை செய்கிறது, இது ஒன்றாக சேர்ந்த ஆபரேட்டர்களுக்காக பயன்படுகிறது. இவை ``input_dims`` மற்றும் ``output_dims`` செயல்பாடுகளைப் பயன்படுத்தலாம்.
tr: Operatör sınıfı ayrıca operatörleri bir araya getirmek için kullanılabilecek alt sistem boyutlarını da izler. Bunlara ``input_dims`` ve ``output_dims`` fonksiyonlarını kullanarak erişilebilir.

source: For :math:`2^N` by :math:`2^M` operators, the input and output dimension will be automatically assumed to be M-qubit and N-qubit:
bn_bn: :math:`2^N` বাই :math:`2^M` অপারেটরগুলোর জন্য ইনপুট ও আউটপুট মাত্রা M কিউবিট এবং N কিউবিট ধরে নেয়া হয়ঃ
fr: Pour des opérateurs de dimension :math:`2^N` par :math:`2^M`, les dimensions d'entrée et de sortie seront automatiquement interprétées comme représentant M-qubit et N-qubit:
it_it: Per gli operatori di dimensione :math:`2^N` per :math:`2^M`, la dimensione di input e output verrà automaticamente interpretata come M-qubit e N-qubit:
pt_un: Para os operadores :math:`2^N` por :math:`2^M`, a dimensão de entrada e saída será assumida automaticamente como M-qubit e N-qubit:
ru: Для операторов размерности :math:`2^N` на :math:`2^M` по умолчанию полагается М кубитов на входе и N на выходе:
ta_in: :math:`2^N` by :math:`2^M` ஆபரேட்டர்களுக்கு, உள்ளீடு மற்றும் வெளியீட்டு பரிமாணம் தானாகவே M-கியூபிட் மற்றும் N-கியூபிட் என கருதப்படும்:
tr: :math:`2^N`'ye :math:`2^M`' boyutlu operatörleri için, giriş ve çıkış boyutları otomatik olarak M-kubit ve N-kubit olarak kabul edilecektir:

source: If the input matrix is not divisible into qubit subsystems, then it will be stored as a single-qubit operator. For example, if we have a :math:`6\times6` matrix:
bn_bn: ইনপুট ম্যাট্রিক্সটি কিউবিট সাবসিস্টেমে বিভাজ্য না হলে একটি একক কিউবিট হিসেবে সংরক্ষিত হবে।যেমন- আমাদের কাছে যদি একটি :math:`6\times6` ম্যাট্রিক্স থাকেঃ
fr: Si la matrice d'entrée ne peut être divisée en sous systèmes de qubits, elle sera stockée comme un opérateur sur un seul quibt. Par exemple pour une matrice de taille :math:`6\times6` :
it_it: Se la matrice di ingresso non è divisibile in sottosistemi di qubit, allora sarà memorizzata come un operatore di singolo qubit. Ad esempio, se abbiamo una matrice :math:`6\times6`:
pt_un: Se a matriz de entrada não for divisível em subsistemas de qubit, então ela será armazenada como um operador de único qubit. Por exemplo, se tivermos uma matriz :math:`6\times6`:
ru: Если входная матрица не может быть разделена на подсистемы, она будет храниться как однокубитный оператор. Например, для матрицы :math:`6\times6`:
ta_in: உள்ளீட்டு மேட்ரிக்ஸ், கியூபிட் துணை அமைப்புகளாகத் தெரியவில்லை என்றால், அது ஒற்றை கியூபிட் ஆபரேட்டராக சேமிக்கப்படும். எடுத்துக்காட்டாக, நாம்மிடம் ஒரு :math:`6\times6` மேட்ரிக்ஸ்:
tr: Eğer girdi matrisi, kübit alt sistemlerine bölünebilir değilse, o zaman tek-kübitli operatör olarak depolanır. Örneğin, :math:`6\times6` matrisimiz varsa:

source: The input and output dimension can also be manually specified when initializing a new operator:
bn_bn: নতুন অপারেটর নির্ধারণ করার সময়ও ইনপুট আউটপুট মাত্রা (ডাইমেনশন) নির্দিষ্ট করা যায়ঃ
fr: On peut aussi spécifier manuellement les dimensions d'entrée et de sortie au moment de l'initialisation d'un nouvel opérateur :
it_it: La dimensione di input e output può anche essere specificata manualmente quando si inizializza un nuovo operatore:
pt_un: A dimensão de entrada e saída também pode ser especificada manualmente ao inicializar um novo operador:
ru: Размеры также могут быть заданы при инициализации нового оператора вручную:
ta_in: புதிய ஆபரேட்டரை துவக்கும்போது உள்ளீடு மற்றும் வெளியீட்டுக் குணங்கள் நாமாகவே குறிப்பிடலாம்:
tr: Yeni bir operatör başlatılırken giriş ve çıkış boyutları manuel olarak da belirtilebilir:

source: We can also extract just the input or output dimensions of a subset of subsystems using the ``input_dims`` and ``output_dims`` functions:
bn_bn: ``input_dims`` এবং ``output_dims`` ফাংশনগুলো ব্যবহার করেও ইনপুট ও আউটপুটের মাত্রা নির্ণয় করা যায়ঃ
fr: Les fonctions ``input_dims`` et ``output_dims`` permettent de connaître les dimensions d'entrée ou de sortie d'un sous ensemble du du système :
it_it: Possiamo anche estrarre solo le dimensioni di input o output di un sottoinsieme di sottosistemi utilizzando le funzioni ``input_dims`` e ``output_dims``:
pt_un: Nós também podemos extrair apenas as dimensões de entrada ou saída de um subconjunto de subsistemas usando as funções ``input_dims`` e ``output_dims``:
ru: Мы также можем получить информацию о размерности входа или выхода по отдельности, используя функции ``input_dims`` и ``output_dims```:
ta_in: ``input_dims`` மற்றும் ``output_dims`` செயல்பாடுகளைப் பயன்படுத்தி துணை அமைப்புகளின் துணைக்குழுவின் உள்ளீடு அல்லது வெளியீட்டு பரிமாணங்களையும் நாம் பிரித்தெடுக்க முடியும்:
tr: Ayrıca ``input_dims`` ve ``output_dims`` fonksiyonlarını kullanarak alt sistemlerin alt kümelerinin yalnızca giriş ve çıkış boyutlarını çıkarabiliriz:

source: Converting classes to Operators
bn_bn: ক্লাস কে অপারেটরে পরিবর্তন
fr: Conversion de classes en opérateurs
it_it: Conversione delle classi in Operatori
pt_un: Convertendo classes para Operadores
ru: Преобразование классов в операторы
ta_in: வகுப்புகளை ஆபரேட்டர்களாக மாற்றுவது
tr: Sınıfları Operatörlere Dönüştürme

source: Several other classes in Qiskit can be directly converted to an ``Operator`` object using the operator initialization method. For example:
bn_bn: Qiskit এর অন্যান্য প্যাকেজগুলি কোনো ``Operator`` এ সরাসরি পরিবর্তন করা যায় অপারেটর ইনিশিয়ালাইজেশন পদ্ধতি ব্যবহার করে। যেমনঃ
fr: Plusieurs autres types d'objets de Qiskit peuvent être convertis en objets de la classe ``Operator``en utilisant sa méthode d'initialisation. Par exemple :
it_it: Diverse altre classi in Qiskit possono essere direttamente convertite in un oggetto ``Operator`` utilizzando il metodo di inizializzazione dell'operatore. Per esempio:
pt_un: Várias outras classes no Qiskit podem ser diretamente convertidas para um objeto ``Operator`` utilizando o método de inicialização do operador. Por exemplo:
ru: Объекты некоторых других классов Qiskit можно напрямую преобразовать в объект ``Operator`` с помощью метода инициализации. Например:
ta_in: Qiskit-ல் உள்ள பல வகுப்புகளை ஆபரேட்டர் துவக்க முறையைப் பயன்படுத்தி நேரடியாக ``Operator`` ஆப்ஜெக்டாக மாற்றலாம். உதாரணத்திற்கு:
tr: Qiskit'teki birkaç diğer sınıf, operatör başlatma yöntemini kullanarak doğrudan bir ``Operator`` objesine dönüştürülebilir. Örneğin:

source: ``Pauli`` objects
bn_bn: ``Pauli`` অবজেক্টসমূহ
fr: les objets de type `Pauli`
it_it: Oggetti ``Pauli``
pt_un: Objetos ``Pauli``
ru: ``Pauli``
ta_in: ``Pauli`` ஆப்ஜெக்ட்கள்
tr: ``Pauli`` nesneleri

source: ``Gate`` and ``Instruction`` objects
bn_bn: ``Gate`` এবং ``Instruction`` অবজেক্টসমূহ
fr: les objets ``Gate`` et ``Instruction``
it_it: Oggetti ``Gate`` e ``Instruction``
pt_un: Objetos de ``Gate`` e ``Instruction``
ru: ``Gate`` и``Instruction``
ta_in: ``Gate`` மற்றும் ``Instruction`` ஆப்ஜெக்ட்கள்
tr: ``Gate`` ve ``Instruction`` nesneleri

source: ``QuantumCircuits`` objects
bn_bn: ``QuantumCircuits`` অবজেক্টসমূহ
it_it: Gli oggetti ``QuantumCircuits``
ta_in: ``QuantumCircuits`` ஆப்ஜெக்ட்கள்

source: Note that the last point means we can use the ``Operator`` class as a unitary simulator to compute the final unitary matrix for a quantum circuit, without having to call a simulator backend. If the circuit contains any unsupported operations, an exception will be raised. Unsupported operations are: measure, reset, conditional operations, or a gate that does not have a matrix definition or decomposition in terms of gate with matrix definitions.
bn_bn: এখানে উল্লেখ্য যে, আমরা ``Operator`` ক্লাসটি unitary সিমুলেটর হিসেবে একটি কোয়ান্টাম বর্তনীর শেষ unitary ম্যাট্রিক্সের হিসাবনিকাশ করতে ব্যবহার করতে পারি কোনো রকম সিমুলেটর ব্যাকএন্ড এর সাহায্য ছাড়া। বর্তনীতে কোনো অসমর্থিত (আনসাপোর্টেড) অপারেশন থাকলে একটি এক্সেপশন উত্থাপন হবে। আনসাপোর্টেড অপারেশনগুলো হলোঃ পরিমাপ (মেজার), রিসেট, কন্ডিশনাল বা শর্তসাপেক্ষ অপারেশন অথবা কোনো গেইট যার ম্যাট্রিক্স নেই।
fr: Il est à noter que dans le dernier cas l'utilisation de la classe ``operator`` permet de calculer la matrice unitaire correspondant à un circuit quantique sans avoir besoin d'utiliser un émulateur. Si le circuit contient une operation non supportée la fonction retournera une exception. Ces opérations sont : la mesure, la mise à zero, les opérations conditionnelles, ou toute autre porte qui n'est pas définie par une matrice unitaire ou qui ne peut pas être décomposée en portes définies par une matrice unitaire.
it_it: Va notato che l'ultimo punto implica il poter utilizzare la classe ``Operator`` come un simulatore unitario per calcolare la matrice unitaria finale di un circuito quantistico, senza dover utilizzare un backend di simulazione. Se il circuito contiene un'operazione non supportata, la funzione genererà un'eccezione. Le operazioni non supportate sono: misurazione, reset, operazioni condizionali o qualsiasi gate che non abbia una definizione matriciale o una decomposizione in gate con definizione matriciale.
pt_un: Note que o último ponto significa que podemos usar a classe ``Operator`` como um simulador unitário para calcular a matriz unitária final para um circuito quântico, sem ter que chamar um simulador de backend. Se o circuito contiver quaisquer operações não suportadas, uma exceção será levantada. Operações não suportadas são: medida, redefinir, operações condicionais, ou um gate que não tenha uma definição de matriz ou decomposição em termos de gate com definição de matriz.
ru: Отметим, что последний вариант говорит о возможности использования класса ``Operator`` для симуляции конечной унитарной матрицы квантовой цепи без вызова бэкенда. Однако при наличии в цепи каких-либо неподдерживаемых операций возникает исключение. К ним относятся измерение, сброс, условные операции и гейты, непредставимые в виде матрицы и не раскладываемые до таковых.
ta_in: கடைசி புள்ளி என்பது ஒரு சிமுலேட்டர் பின்தளத்தில் அழைக்காமல், ஒரு குவாண்டம் சர்க்யூட்டிற்கான இறுதி யூனிடரி மேட்ரிக்ஸைக் கணக்கிட ``Operator`` வகுப்பை ஒரு யூனிடரி சிமுலேட்டராகப் பயன்படுத்தலாம் என்பதை நினைவில் கொள்க. சர்க்யூட்டுக்கு ஆதரிக்கப்படாத செயல்பாடுகள் ஏதேனும் இருந்தால், விதிவிலக்கு எழுப்பப்படும். ஆதரிக்கப்படாத செயல்பாடுகள்: அளவீட்டு, மீட்டமைத்தல், நிபந்தனை செயல்பாடுகள் அல்லது மேட்ரிக்ஸ் வரையறைகளுடன் கூடிய கேட்டின் அடிப்படையில் மேட்ரிக்ஸ் வரையறை அல்லது சிதைவு இல்லாத ஒரு கேட்.
tr: Son noktanın, bir simülatör backendi çağırmaya gerek kalmadan bir kuantum devreye ait son birim matrisi hesaplamak için ``Operator`` sınıfını birimsel bir simülatör olarak kullanabileceğimiz anlamına geldiğine dikkat edin. Eğer devre herhangi desteklenmeyen bir işlem içeriyorsa bir istisna ortaya çıkacaktır. Desteklenmeyen işlemler: ölçü, sıfırlama, koşullu işlemler ya da bir matris tanımına sahip olmayan veya matris tanımlarıyla kapı açısından ayrışmayan bir kapıdır.

source: Using Operators in circuits
bn_bn: বর্তনীতে (সার্কিট) অপারেটরের ব্যবহার
fr: Utilisation d'opérateurs dans les circuits
it_it: Utilizzo di operatori nei circuiti
pt_un: Usando Operadores em circuitos
ru: Использование операторов в цепях
ta_in: சர்க்யூட்களில் ஆபரேட்டர்களைப் பயன்படுத்துதல்
tr: Devrelerde Operatörlerin Kullanılması

source: Unitary ``Operators`` can be directly inserted into a ``QuantumCircuit`` using the ``QuantumCircuit.append`` method. This converts the ``Operator`` into a ``UnitaryGate`` object, which is added to the circuit.
bn_bn: Unitary ``Operators`` অপারেটরগুলো সরাসরি ``QuantumCircuit.append`` মেথড ব্যবহারের মাধ্যমে ``QuantumCircuit`` এ ব্যবহার করা যায়। এটি ``Operator`` কে একটি ``UnitaryGate`` অবজেক্ট এ রূপান্তর করে যা বর্তনীতে সংযুক্ত হয়।
fr: Les ``Operators`` unitaires peuvent être directement ajoutés à un ``QuantumCircuit`` en utilisant la méthode ``QuantumCircuit.append``. Ceci a pour effet de convertir l'`Operator` en objet de type ``UnitaryGate`` et de l'ajouter au circuit.
it_it: Gli ``Operators`` unitari possono essere aggiunti direttamente a un ``QuantumCircuit`` usando il metodo ``QuantumCircuit.append``. Questo converte l'``Operator`` in un oggetto di tipo ``UnitaryGate`` e lo aggiunge al circuito.
pt_un: ``Operators`` unitários podem ser diretamente inseridos em um ``QuantumCircuit`` usando o método ``QuantumCircuito.append``. Isso converte o ``Operator`` em um objeto ``UnitaryGate``, que é adicionado ao circuito.
ru: Унитарный ``Operator`` может применяться в цепи ``QuantumCircuit`` непосредственно с помощью метода ``QuantumCircuit.append``. В этом случае ``Operator`` будет преобразован в объект ``UnitaryGate``.
ta_in: யூனிடரி ``Operators`` நேரடியாக ``QuantumCircuit`` இல் ``QuantumCircuit.append`` முறையைப் பயன்படுத்தி சேர்க்கலாம். இது ``Operator`` ஐ ``UnitaryGate`` பொருளாக மாற்றுகிறது, இது சர்க்யூட்டுக்கு சேர்க்கப்படுகிறது.
tr: Üniter ``Operators``, ``QuantumCircuit.append`` yöntemi kullanılarak doğrudan bir ``QuantumCircuit``eklenebilir. Bu, ``Operator``ü devreye eklenen bir ``UnitaryGate`` objesine dönüştürür.
