Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/02_operators_overview.po
Languages: bn_bn, fr, it_it, pt_un, ru, ta_in, tr

source: If the operator is not unitary, an exception will be raised. This can be checked using the ``Operator.is_unitary()`` function, which will return ``True`` if the operator is unitary and ``False`` otherwise.
bn_bn: যদি অপারেটরটি unitary না হয় তবে একটি এক্সেপশন উত্থিত হবে। এটি ``Operator.is_unitary()`` ফাংশন দিয়ে পরীক্ষা করা যায় যাতে অপারেটরটি unitary হলে ফাংশনটি ``True`` ফেরত দেয় নতুবা ``False`` দেয়।
fr: Si l'opérateur n'est pas unitaire, une exception sera retournée à l'utilisateur. Ceci peut être prévenu par l'utilisation de la fonction ``Operator.is_unitary()`` qui renvoie ``True`` si l'opérateur est unitaire, et ``False`` sinon.
it_it: Se l'operatore non è unitario, verrà lanciata un'eccezione. Questa può essere preliminarmente controllato usando la funzione ``Operator.is_unitary()``, che restituirà ``True`` se l'operatore è unitario e ``False`` altrimenti.
pt_un: Se o operador não for unitário, uma exceção será gerada. Isto pode ser verificado usando a função ``Operator.is _unitary()``, que retornará ``True`` se o operador for unitário e ``False``, caso contrário.
ru: Если оператор не унитарен, вызывается исключение (exception). Это можно отдельно проверить с помощью функции ``Operator.is_unitary()``, возвращающей ``True`` в случае унитарности и ``False`` при ее отсутствии.
ta_in: ஆபரேட்டர் யூனிடரியாக இல்லாவிட்டால், ஒரு விதிவிலக்கு எழுப்பப்படும். ``Operator.is_unitary()`` செயல்பாட்டைப் பயன்படுத்தி இதைச் சரிபார்க்கலாம், இது ஆபரேட்டர் யூனிடரியாக இருந்தால் ``True`` மற்றும் இல்லையெனில் ``False``.
tr: Eğer operatör üniter değilse, bir istisna ortaya çıkacaktır. Bu, eğer operatör birimsel ise ``True`` ve değilse ``False`` döndürecek ``Operator.is_unitary()`` fonksiyonunu kullanarak kontrol edilebilir.

source: Note that in the above example we initialize the operator from a ``Pauli`` object. However, the ``Pauli`` object may also be directly inserted into the circuit itself and will be converted into a sequence of single-qubit Pauli gates:
bn_bn: উল্লেখ্য যে উপরের উদাহরণে আমরা অপারেটরটি একটি ``Pauli`` অবজেক্ট থেকে পেয়েছি। ``Pauli`` অবজেক্টকে সরাসরি বর্তনীতে ব্যবহার এবং কিছু একক কিউবিট Pauli গেইটে রূপান্তর করা যায়।
fr: Notons que dans l'exemple ci-dessus, l'opérateur est initialisé à l'aide d'un objet de type ``Pauli``. Cependant l'objet de type ``Pauli`` peut aussi être inséré directement dans le circuit, et sera converti en une séquence de gates de Pauli sur un seul qubit :
it_it: Si noti che nell'esempio sopra, l'operatore viene inizializzato usando un oggetto ``Pauli``. Tuttavia, l'oggetto ``Pauli`` può anche essere inserito direttamente nel circuito e verrà convertito in una sequenza di gate di Pauli su singolo qubit:
pt_un: Note que no exemplo acima nós inicializamos o operador de um objeto ``Pauli``. No entanto, o objeto ``Pauli`` também pode ser diretamente inserido no próprio circuito e será convertido em uma sequência de gates Pauli de um único qubit:
ru: Отметим, что в вышеприведенном примере оператор инициализируется из объекта ``Pauli``. Однако ``Pauli`` может применяться в цепи и напрямую, будучи преобразованным в последовательность однокубитных гейтов Паули:
ta_in: மேலே உள்ள எடுத்துக்காட்டில் ஆபரேட்டரை ``Pauli`` ஆப்ஜெக்டிலிருந்து துவக்குகிறோம் என்பதை நினைவில் கொள்க. இருப்பினும், ``Pauli`` ஆப்ஜெக்ட் நேரடியாக சர்க்யூட்டுக்குள் சேர்க்கப்படலாம், மேலும் இது ஒற்றை கியூபிட் Pauli கேட்கள் வரிசையாக மாற்றப்படும்:
tr: Yukarıdaki örnekte, bir ``Pauli`` objesinden operatörü başlatmış olduğumuza dikkat edin. Ancak, ``Pauli`` objesi doğrudan devrenin kendisine eklenebilir ve yüksek ihtimalle tek-kubitli Pauli kapılar dizisine dönüştürülecektir:

source: Combining Operators
bn_bn: অপারেটরের সমাবেশ
fr: Combinaison d'opérateurs
it_it: Combinazione di Operatori
pt_un: Combinando Operadores
ru: Объединение операторов
ta_in: ஆபரேட்டர்களை இணைத்தல்
tr: Operatörleri Birleştirme

source: Operators may be combined using several methods.
bn_bn: বিভিন্ন উপায়ে অপারেটরগুলোর সমাবেশ (কম্বাইন) তৈরি করা যায়।
fr: Les opérateurs peuvent être combinés au moyen de différentes méthodes.
pt_un: Os operadores podem ser combinados usando vários métodos.
ru: Операторы можно сочетать разными методами.
ta_in: ஆபரேட்டர்கள் பல முறைகளைப் பயன்படுத்தி இணைக்கப்படலாம்.
tr: Operatörler birkaç yöntem kullanılarak birleştirilebilirler.

source: Tensor Product
bn_bn: টেনসর ফল (প্রোডাক্ট)
fr: Produit Tensoriel
it_it: Prodotto Tensoriale
pt_un: Produto do Tensor
ru: Тензорное произведение
ta_in: டென்சர் ப்ராடக்ட்
tr: Tensör Çarpımı

source: Two operators :math:`A` and :math:`B` may be combined into a tensor product operator :math:`A\otimes B` using the ``Operator.tensor`` function. Note that if both A and B are single-qubit operators, then ``A.tensor(B)`` = :math:`A\otimes B` will have the subsystems indexed as matrix B on subsystem 0, and matrix :math:`A` on subsystem 1.
bn_bn: :math:`A` এবং :math:`B` দুইটি অপারেটর একটি টেনসর অপারেটর :math:`A\otimes B` এ যুক্ত হতে পারে ``Operator.tensor`` ফাংশন দ্বারা। উল্লেখ্য, যদি A এবং B উভয়েই একক কিউবিট অপারেটর হয় তবে ``A.tensor(B)`` = :math:`A\otimes B` এ ম্যাট্রিক্স B সাবসিস্টেম ০ তে ও ম্যাট্রিক্স :math:`A` সাবসিস্টেম ১ এ ইনডেক্স (সূচিত) করা থাকবে।
it_it: Due operatori :math:`A` e :math:`B` possono essere combinati in un operatore risultato di un prodotto tensoriale :math:`A\otimes B` utilizzando la funzione ``Operator.tensor``. Nota che se sia A che B sono operatori a singolo qubit, allora ``A. tensor(B)`` = :math:`A\otimes B` avrà i sottosistemi indicizzati come matrice B sul sottosistema 0, e matrice :math:`A` sul sottosistema 1.
ta_in: இரண்டு ஆபரேட்டர்கள் :math:`A` மற்றும் :math:`B` ஒரு டென்சர் ப்ராடக்ட் ஆபரேட்டராக இணைக்கப்படலாம் ``Operator.tensor`` செயல்பாட்டைப் பயன்படுத்தி :math:`A\otimes B`. A மற்றும் B இரண்டும் ஒற்றை-கியூபிட் ஆபரேட்டர்களாக இருந்தால், ``A.tensor(B)`` = :math:`A\otimes B` துணை அமைப்பு 0 இல் மேட்ரிக்ஸ் B என குறியிடப்பட்ட துணை அமைப்புகளைக் கொண்டிருக்கும், மற்றும் மேட்ரிக்ஸ் :math:`A` துணை அமைப்பு 1.

source: Tensor Expansion
bn_bn: টেনসর প্রসারণ (এক্সপ্যানশন)
fr: Expansion Tensorielle
it_it: Espansione Tensoriale
pt_un: Expansão de Tensor
ru: Тензорное расширение
ta_in: டென்சர் விரிவாக்கம்
tr: Tensör Açılımı

source: A closely related operation is ``Operator.expand``, which acts like a tensor product but in the reverse order. Hence, for two operators :math:`A` and :math:`B` we have ``A.expand(B)`` = :math:`B\otimes A` where the subsystems indexed as matrix A on subsystem 0, and matrix :math:`B` on subsystem 1.
bn_bn: একটি কাছাকাছি অপারেশন হলো ``Operator.expand`` যেটি বিপরীত ক্রমে টেনসর ফলের অনুরূপ। :math:`A` এবং :math:`B` অপারেটর দুইটির জন্য আমরা পাই ``A.expand(B)`` = :math:`B\otimes A` যেখানে ম্যাট্রিক্স A সাবসিস্টেম ০ তে ও ম্যাট্রিক্স :math:`B` সাবসিস্টেম ১ এ ইনডেক্স (সূচিত) করা থাকবে।
it_it: Un'operazione molto vicina alla precedente è ``Operator.expand`` che agisce come il prodotto tensoriale, ma in ordine inverso. Cioè, per due operatori: :math:`A` e :math:`B` l'espansione ``A.expand(B)`` = :math:`B\otimes A` avrà i sottosistemi indicizzati come matrice A sul sottosistema 0, e matrice :math:`B` sul sottosistema 1.
ta_in: நெருங்கிய தொடர்புடைய செயல்பாடு ``Operator.expand``, இது ஒரு டென்சர் ப்ராடக்ட் போல ஆனால் தலைகீழ் வரிசையில் செயல்படுகிறது. எனவே, இரண்டு ஆபரேட்டர்களுக்கு :math:`A` மற்றும் :math:`B` எங்களிடம் ``A.expand(B)`` = :math:`B\otimes A`, அங்கு துணை அமைப்புகள் துணை அமைப்பு 0 இல் மேட்ரிக்ஸ் A என குறியிடப்படுகின்றன, மற்றும் மேட்ரிக்ஸ் துணை அமைப்பு 1 இல் :math:`B`.

source: Composition
bn_bn: গঠন
it_it: Composizione
pt_un: Composição
ru: Матричное произведение (композиция)
ta_in: கலவை
tr: Bileşim

source: We can also compose two operators :math:`A` and :math:`B` to implement matrix multiplication using the ``Operator.compose`` method. We have that ``A.compose(B)`` returns the operator with matrix :math:`B.A`:
bn_bn: আমরা :math:`A` এবং :math:`B` অপারেটর দুইটি ব্যবহার করে ম্যাট্রিক্স গুণন করতে পারি ``Operator.compose`` মেথডের সাহায্যে। ``A.compose(B)`` -এটি :math:`B.A` ম্যাট্রিক্স অপারেটরটি ফেরত দেয়ঃ
fr: Il est également possible de faire la composition de deux opérateurs :math:`A` et :math:`B` pour implémenter la multiplication de matrices en utilisant la méthode ``Operator.compose``. Ainsi, `A.compose(B)` retourne l'opérateur correspondant à la matrice :math:`B.A` :
it_it: È anche possibile comporre due operatori :math:`A` and :math:`B` per implementare la moltiplicazione tra matrici usando il metodo ``Operator.compose``. Pertanto, ``A.compose(B)`` restituisce l'operatore corrispondente alla matrice :math:`B.A`:
pt_un: Também podemos compor dois operadores :math:`A` e :math:`B` para implementar a multiplicação da matriz usando o método ``Operator.compose``. Temos que o ``A.compose(B)`` retorna o operador com matriz :math:`B.A`:
ru: Мы также можем объединить два последовательно применяемых оператора :math:`A` и :math:`B`, вычисляя их матричное произведение с помощью метода ``Operator.compose``. Результатом ``A.compose(B)`` будет оператор :math:`B.A`:
ta_in: ``Operator.compose`` முறையைப் பயன்படுத்தி மேட்ரிக்ஸ் பெருக்கலை செயல்படுத்த :math:`A` மற்றும் :math:`B` ஆகிய இரண்டு ஆபரேட்டர்களையும் நாங்கள் உருவாக்கலாம். ``A.compose(B)`` ஆபரேட்டரை மேட்ரிக்ஸ் :math:`B.A` துடன் திருப்பித் தருகிறோம்:
tr: :math:`A` ve :math:`B` isimli iki matrisi ayrıca ``Operator.compose`` yöntemini kullanarak matris çarpımı uygulayıp birleştirebiliriz. Sahip olduğumuz ``A.compose(B)``, :math:`B.A` matrisi ile birlikte operatörü döndürür:

source: We can also compose in the reverse order by applying :math:`B` in front of :math:`A` using the ``front`` kwarg of ``compose``: ``A.compose(B, front=True)`` = :math:`A.B`:
bn_bn: আমরা বিপরীতক্রমে :math:`A` এর সামনে :math:`B` বসিয়েও ``compose` এর ``front`` কীওয়ার্ড আর্গুমেন্ট ব্যবহার করতে পারিঃ ``A.compose(B, front=True)`` = :math:`A.B`:
fr: Il est également possible de faire la composition en ordre inverse en appliquant :math:`B` avant :math:`A`, en utilisant l'argument de mot clef front de la méthode compose comme ceci : ``A.compose(B, front=True)``= :math:`A.B` :
it_it: È anche possibile eseguire la composizione in ordine inverso applicando: :math:`B` prima di :math:`A` , usando la kwarg ``front`` del metodo ``compose`` in questo modo: ``A.compose(B, front=True)`` = :math:`A.B`:
pt_un: Também podemos compor na ordem inversa aplicando :math:`B` na frente de :math:`A` usando o ``front`` kwarg de ``compose``: ``A. ompose(B, front=True)`` = :math:`A.B`:
ru: Если :math:`B` нужно применить раньше, чем :math:`A`, можно использовать в методе ``compose`` именованный аргумент ``front``: ``A.compose(B, front=True)`` = :math:`A.B`:
ta_in: ``compose`` -ன் ``front`` kwarg -ஐப் பயன்படுத்தி :math:`B` -க்கு முன்னால் :math:`A` -ஐப் பயன்படுத்துவதன் மூலம் நாம் தலைகீழ் வரிசையில் எழுத முடியும்: ``A.compose(B, front=True)`` = :math:`A.B`:
tr: Ayrıca, ``compose`` un ``front`` argümanını kullanıp :math:`A` matrisinin önüne :math:`B` matrisini uygulayarak ters sıra ile birleştirebiliriz: ``A.compose(B, front=True)`` = :math:`A.B`:

source: Subsystem Composition
bn_bn: সাবসিস্টেমের গঠন
fr: Composition de sous-systèmes
it_it: Composizione di Sottosistemi
pt_un: Composição do Subsistema
ru: Композиция подсистем
ta_in: துணை அமைப்பு கலவை
tr: Alt Sistem Bileşimi

source: Note that the previous compose requires that the total output dimension of the first operator :math:`A` is equal to total input dimension of the composed operator :math:`B` (and similarly, the output dimension of :math:`B` must be equal to the input dimension of :math:`A` when composing with ``front=True``).
bn_bn: উল্লেখ্য যে, প্রথম অপারেটর :math:`A` এর মোট আউটপুট মাত্রা কম্পোজড অপারেটর :math:`B` এর মোট ইনপুট মাত্রার সমান হতে হবে (এবং একইভাবে :math:`B` এর আউটপুট মাত্রা :math:`A` এর ইনপুট মাত্রার সমতুল্য হবে যখন ``front=True``)।
fr: On peut noter que dans les compositions vues précédemment, la dimension totale de sortie du premier opérateur :math:`A` est égale à la dimension totale d'entrée de l'opérateur :math:`B` (et de même, la dimension de sortie de :math:`B` doit être égale à la dimension de l'entrée de :math:`A` lorsque l'on utilise la composition avec l'option ``front=True``).
it_it: Possiamo notare che nelle composizioni viste in precedenza, la dimensione totale dell'output del primo operatore :math:`A` è uguale alla dimensione totale dell'input dell'operatore :math:`B` (e similmente, la dimensione dell'output di: :math:`B` deve essere uguale alla dimensione dell'input di :math:`A` quando si usa la composizione con l'opzione ``front=True``).
pt_un: Note que a composição anterior requer que a dimensão de saída total do primeiro operador :math:`A` seja igual à dimensão de entrada total do operador composto :math:`B` (e da mesma forma, a dimensão de saída de :math:`B` deve ser igual à dimensão de entrada de :math:`A` ao compor com ``front=True``).
ru: Обратите внимание, что матричное произведение требует соответствия размерностей выхода первого оператора :math:`A` и входа второго :math:`B` (и наоборот при аргументе ``front=True``).
ta_in: முந்தைய தொகுப்பிற்கு முதல் ஆபரேட்டரின் மொத்த வெளியீட்டு பரிமாணம் தேவைப்படுகிறது என்பதை நினைவில் கொள்க :math:`A` என்பது இயற்றப்பட்ட ஆபரேட்டரின் மொத்த உள்ளீட்டு பரிமாணத்திற்கு சமம் :math:`B` (அதேபோல், கணிதத்தின் வெளியீட்டு பரிமாணம் :math:`B` இன் உள்ளீட்டு பரிமாணத்திற்கு சமமாக இருக்க வேண்டும் :math:`A` உடன் எழுதும்போது ``front=True``).
tr: Önceki bileşimin, ilk operatörü :math:`A` matrisinin toplam çıkış boyutunun, birleşen operatör :math:`B` matrisinin toplam giriş boyutuna eşit olması gerektiğine dikkat edin. (Ve benzer şekilde, :math:`B` matrisinin çıkış boyutu, ``front=True`` ile birleşim olduğunda, :math:`A` matrisinin giriş boyutuna eşit olmak zorundadır.).

source: We can also compose a smaller operator with a selection of subsystems on a larger operator using the ``qargs`` kwarg of ``compose``, either with or without ``front=True``. In this case, the relevant input and output dimensions of the subsystems being composed must match. *Note that the smaller operator must always be the argument of ``compose`` method.*
bn_bn: একটি বড় অপারেটর থেকে কিছু সাবসিস্টেমের সাহায্যে ``compose`` এর ``qargs`` কীওয়ার্ড ব্যবহার করে ছোট অপারেটর তৈরি করা সম্ভব (``front=True`` সহ বা ছাড়া)। এক্ষেত্রে সাবসিস্টেমের ইনপুট আউটপুট মাত্রা সমান হতে হবে। *উল্লেখ্য যে, ক্ষুদ্রতর অপারেটর সবসময় ``compose`` মেথড এর আর্গুমেন্ট হিসেবে ব্যবহৃত হবে।*
it_it: Possiamo anche comporre un operatore più piccolo selezionando sottosistemi su un operatore più grande utilizzando il kwarg ``qargs``di ``compose``, con o senza ``front=True``. In tal caso, le dimensioni dell'input e dell'output dei sottosistemi composti devono corrispondere. *Nota che l'operatore più piccolo deve sempre essere l'argomento del metodo ``compose``.*
ta_in: ``front=True`` உடன் அல்லது இல்லாமல் ``compose`` இன் ``qargs`` kwarg பயன்படுத்தி ஒரு பெரிய ஆபரேட்டரில் துணை அமைப்புகளின் தேர்வு கொண்ட சிறிய ஆபரேட்டரையும் நாங்கள் உருவாக்கலாம். இந்த வழக்கில், இயற்றப்படும் துணை அமைப்புகளின் தொடர்புடைய உள்ளீடு மற்றும் வெளியீட்டு பரிமாணங்கள் பொருந்த வேண்டும். *சிறிய ஆபரேட்டர் எப்போதும் ``compose`` முறையின் வாதமாக இருக்க வேண்டும் என்பதை நினைவில் கொள்க.*

source: For example, to compose a two-qubit gate with a three-qubit Operator:
bn_bn: উদাহরণস্বরূপ, একটি তিন কিউবিট অপারেটর সহ একটি দ্বি কিউবিট যুক্তিবর্তনীর (গেইট) জন্যঃ
fr: Par exemple, pour composer une porte à deux qubits dans un opérateur à trois qubits :
it_it: Ad esempio, per comporre un gate a due qubit con un operatore a tre qubit:
pt_un: Por exemplo, para escrever um gate de dois qubit com um Operador de três qubit:
ru: Рассмотрим пример объединения двухкубитного гейта с частью трехкубитного оператора:
ta_in: எடுத்துக்காட்டாக, மூன்று-கியூபிட் ஆபரேட்டருடன் இரண்டு-கியூபிட் கேட் உருவாக்க:
tr: Örneğin, iki kubitli bir kapıyı, üç kubitli bir operatör ile birleştirmek için:

source: Linear combinations
bn_bn: রৈখিক সমাবেশ
fr: Combinaisons linéaires
it_it: Combinazioni lineari
pt_un: Combinações lineares
ru: Линейные комбинации
ta_in: நேர் இணைப்புகள்
tr: Doğrusal birleşimler

source: Operators may also be combined using standard linear operators for addition, subtraction and scalar multiplication by complex numbers.
bn_bn: অপারেটরগুলো জটিল সংখ্যার যোগ, বিয়োগ এবং স্কেলার গুণ দ্বারাও যুক্ত করা সম্ভব।
fr: Les opérateurs peuvent aussi être combinés en utilisant les fonctions standards d'addition de soustraction et de multiplication scalaire par des nombres complexes.
it_it: Gli operatori possono anche essere combinati usando le funzioni standard di addizione, sottrazione e moltiplicazione scalare per numeri complessi.
pt_un: Os operadores também podem ser combinados utilizando operadores lineares padrão para adição, subtração e multiplicação escalar por números complexos.
ru: Помимо этого к операторам могут применяться линейные операции, такие как сложение, вычитание и скалярное умножение на комплексное число.
ta_in: சிக்கலான எண்களால் கூட்டல், கழித்தல் மற்றும் அளவிடுதல் பெருக்கத்திற்கான நிலையான நேரியல் ஆபரேட்டர்களைப் பயன்படுத்தி ஆபரேட்டர்கள் இணைக்கப்படலாம்.
tr: Operatörler ayrıca toplama, çıkarma ve karmaşık sayılarla skaler çarpım işlemleri için standart lineer operatörler kullanılarak birleştirilebilir.

source: An important point is that while ``tensor``, ``expand`` and ``compose`` will preserve the unitarity of unitary operators, linear combinations will not; hence, adding two unitary operators will, in general, result in a non-unitary operator:
bn_bn: একটি গুরুত্বপূর্ণ বিষয় হল ``tensor``, ``expand`` এবং ``compose`` unitary অপারেটরসমূহের ইউনিটারিটি সংরক্ষণ করলেও রৈখিক সমাবেশ তা করবেনা; তাই দুইটি ইউনিটারি অপারেটর যোগ করলে একটি নন-ইউনিটারি অপারেটর তৈরি হয়ঃ
fr: Il est important de noter que si les méthodes ``tensor``, ``expand`` and ``compose`` conservent la propriété d'unitarité des opérateurs, les combinaisons linéaires d'opérateurs par contre ne le feront pas; ainsi l'addition de deux opérateurs unitaires donnera en général un opérateur non unitaire :
it_it: È importante notare che se i metodi ` ``tensor``, ``expand`` e ``compose`` mantengono l'unitarietà degli operatori unitari, le combinazioni lineari no; pertanto sommare due operatori unitari risulterà, in generale, in un operatore non unitario:
pt_un: Um ponto importante é que, enquanto ``tensor``, ``expand`` e ``compose`` irão preservar a unidade de operadores unitários, combinações lineares não terão o mesmo efeito; portanto, adicionar dois operadores unitários irá, em geral, resultar num operador não unitário:
ru: Однако отметим, что в отличие от методов ``tensor``, ``expand`` и ``compose``, сохраняющих унитарность, результатом линейного преобразования в общем случае является неунитарный оператор:
ta_in: ஒரு முக்கியமான விஷயம் என்னவென்றால், ``tensor``, ``expand`` மற்றும் ``compose`` ஆகியவை யூனிடரி ஆபரேட்டர்களின் ஒற்றுமையைப் பாதுகாக்கும், நேரியல் சேர்க்கைகள் இருக்காது; எனவே, இரண்டு யூனிடரி ஆபரேட்டர்களைச் சேர்ப்பது, பொதுவாக, யூனிடரி அல்லாத ஆபரேட்டருக்கு வழிவகுக்கும்:
tr: Önemli bir nokta, ``tensor``, ``expand`` ve ``compose`` üniter operatörlerin üniterliğini korurken, lineer kombinasyonlar korumayacak; dolayısıyla, iki üniter operatör toplamak genel olarak üniter olmayan bir operatör ile sonuçlanacaktır:

source: Implicit Conversion to Operators
bn_bn: অপারেটরের রূপান্তর
fr: Conversion implicite en opérateur
it_it: Conversione implicita in operatori
pt_un: Conversão Implícita para Operadores
ru: Неявное преобразование в операторы
ta_in: இயங்குதலுக்கு ஏற்றுமதி மாற்று
tr: Operatörlere Örtülü Dönüşüm

source: Note that for all the following methods, if the second object is not already an ``Operator`` object, it will be implicitly converted into one by the method. This means that matrices can be passed in directly without being explicitly converted to an ``Operator`` first. If the conversion is not possible, an exception will be raised.
bn_bn: উল্লেখ্য যে এ সবগুলো পদ্ধতির জন্য, দ্বিতীয় অবজেক্টটি যদি ``Operator`` না হয় তবে তা মেথডের মাধ্যমে ``Operator`` এ পরিবর্তিত (কনভার্শন) হবে। অর্থাৎ ম্যাট্রিক্সগুলো ``Operator`` এ পরিবর্তন না করেও সরাসরি ব্যবহার করা যাবে। এই রূপান্তর (কনভার্শন) সম্ভব না হলে একটি এক্সেপশন দেখা যাবে।
fr: Notez que pour les méthodes ci-dessous, si le second objet utilisé n'est pas déjà de classe ``Operator``, il sera implicitement converti en objet de classe ``Operator``. Ceci signifie que l'on peut passer directement des objets de type matrice en argument, sans avoir à les convertir préalablement et explicitement en opérateur. Si la conversion n'est pas possible, une exception sera retournée.
it_it: Si noti che per i metodi seguenti, se il secondo oggetto utilizzato non è già di tipo ``Operator``, verrà implicitamente convertito dal metodo stesso. Ciò significa che possiamo passare direttamente oggetti di tipo matrice come argomenti, senza doverli prima convertire esplicitamente in un ``Operator`. Se la conversione non è possibile, verrà generata un'eccezione.
pt_un: Note que para todos os seguintes métodos, se o segundo objeto não é já um objeto ``Operator``, ela será implicitamente convertida em um pelo método. Isto significa que matrizes podem ser passadas diretamente sem serem explicitamente convertidas para um ``Operator`` primeiro. Se a conversão não for possível, uma exceção será gerada.
ru: В рассмотренных ниже примерах, если второй объект не принадлежит к ``Operator``, он будет автоматически преобразован в экземпляр этого класса. Поэтому можно использовать матрицу напрямую без ее предварительного явного преобразования в ``Operator``. При невозможности такой процедуры возникает исключение.
ta_in: பின்வரும் அனைத்து முறைகளுக்கும், இரண்டாவது பொருள் ஏற்கனவே ``Operator`` பொருளாக இல்லாவிட்டால், அது முறையால் ஒன்றாக மறைமுகமாக மாற்றப்படும் என்பதை நினைவில் கொள்க. முதலில் ``Operator`` என வெளிப்படையாக மாற்றப்படாமல் மெட்ரிக்குகளை நேரடியாக அனுப்ப முடியும் என்பதே இதன் பொருள். மாற்றம் சாத்தியமில்லை என்றால், ஒரு விதிவிலக்கு எழுப்பப்படும்.
tr: Aşağıdaki tüm yöntemler için, ikinci nesne zaten bir ``Operatör`` nesnesi değilse, yöntem tarafından örtülü olarak bir ``Operatör`` nesnesine dönüştürüleceğini unutmayın. Bu, matrislerin açıkça bir ``Operatör`` e dönüştürülmeden doğrudan aktarılabileceği anlamına gelir. Dönüştürme mümkün değilse, exception ortaya çıkar.

source: Comparison of Operators
bn_bn: অপারেটরসমূহের সাদৃশ্য
fr: Comparaison d'opérateurs
it_it: Confronto tra Operatori
pt_un: Comparação de Operadores
ru: Сравнение операторов
ta_in: ஒப்பீட்டு ஆபரேட்டர்கள்
tr: Operatörlerin Karşılaştırılması

source: Operators implement an equality method that can be used to check if two operators are approximately equal.
bn_bn: অপারেটরের একটি সমতা নির্ধারণ পদ্ধতি আছে যা দিয়ে দুইটি অপারেটর সমান কিনা তা নির্ণয় করা যায়।
fr: Une méthode de test d'égalité est implémentée pour les objets de type ``Operator``, elle peut être utilisée pour vérifier si deux opérateurs sont approximativement égaux.
it_it: Gli operatori implementano un metodo di uguaglianza che può essere utilizzato per verificare se due operatori sono approssimativamente uguali.
pt_un: Os operadores implementam um método de igualdade que pode ser utilizado para verificar se dois operadores são aproximadamente iguais.
ru: Операторы можно сравнивать друг с другом для проверки их приблизительного взаимного равенства.
ta_in: ஆபரேட்டர்கள் ஒரு சமத்துவ முறையை செயல்படுத்துகின்றனர், இது இரண்டு ஆபரேட்டர்கள் தோராயமாக சமமாக இருக்கிறதா என்று சோதிக்க பயன்படுகிறது.
tr: Operatörler, iki operatörün yaklaşık olarak eşit olup olmadığını kontrol etmek için kullanılabilecek bir eşitlik yöntemine sahiptir.
