Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/02_operators_overview.po
Languages: bn_bn, fr, it_it, pt_un, ru, ta_in, tr

source: Note that this checks that each matrix element of the operators is approximately equal; two unitaries that differ by a global phase will not be considered equal:
bn_bn: অপারেটরের প্রত্যেকটি ম্যাট্রিক্স প্রায় সমান। দুইটি ইউনিটারির যদি সার্বজনীন দশা পার্থক্য থাকে তবে তাদের সমান গণ্য করা হয় নাঃ
fr: Notons que cette méthode vérifie l'égalité approximative entre les éléments correspondant des matrices représentant les opérateurs ; deux opérateurs unitaires qui diffèreraient par une phase globale ne seront pas considérés comme égaux :
it_it: Si noti che questo controllo verifica che ogni elemento della matrice degli operatori sia approssimativamente uguale; due matrici unitarie che differiscono per una fase globale non saranno considerate uguali:
pt_un: Note que isso verifica que cada elemento matrix dos operadores é aproximadamente igual; duas unidades que diferem por uma fase global não serão consideradas iguais:
ru: При этом сравниваются соответствующие элементы матриц, поэтому унитарные операторы с разной глобальной фазой не будут считаться равными:
ta_in: ஆபரேட்டர்களின் ஒவ்வொரு மேட்ரிக்ஸ் உறுப்பு தோராயமாக சமமாக இருப்பதை இது சரிபார்க்கிறது என்பதை நினைவில் கொள்க; உலகளாவிய கட்டத்தால் வேறுபடும் இரண்டு அலகுகள் சமமாக கருதப்படாது:
tr: Bunun, operatörlerin her bir matris elemanının yaklaşık olarak eşit olduğunu kontrol ettiğini unutmayın; genel bir faza göre farklılık gösteren iki üniter eşit kabul edilmeyecektir:

source: Process Fidelity
bn_bn: প্রসেস ফিডেলিটি (যথার্থতা)
fr: Fidélité de Process
it_it: La Fidelity di Processo
pt_un: Fidelidade de Processo
ru: Точность процесса
ta_in: செயலாக்க விகிதங்கள்
tr: İşlem Doğruluğu

source: We may also compare operators using the ``process_fidelity`` function from the *Quantum Information* module. This is an information theoretic quantity for how close two quantum channels are to each other, and in the case of unitary operators it does not depend on global phase.
bn_bn: আমরা অপারেটরগুলির সাদৃশ্য *Quantum Information* মডিউলের ``process_fidelity`` দিয়েও তুলনা করতে পারি। এটি তথ্যের একটি তাত্ত্বিক পরিমাণ যা দুইটি কোয়ান্টাম চ্যানেল কতটা কাছাকাছি তা নির্ণয় করে। অবশ্য ইউনিটারি অপারেটরের ক্ষেত্রে সার্বজনীন দশার উপর নির্ভর করেনা।
fr: Nous pouvons également comparer les opérateurs à l'aide de la fonction ``process_fidelity`` du module *Quantum Information*. Il s'agit d'une notion de la théorie de l'information quantique permettant d'indiquer à quel point deux chemins quantiques sont équivalents, et dans le cas d'opérateurs unitaires, le résultat est indépendant de la phase globale.
it_it: Possiamo anche confrontare gli operatori usando la funzione ``process_fidelity`` del modulo *Quantum Information*. Questa è una quantità teorica che indica quanto due canali quantici siano vicini l'uno all'altro, e nel caso di operatori unitari non dipende dalla fase globale.
pt_un: Podemos também comparar operadores usando a função ``process_fidelity`` a partir do módulo *Informações Quânticas*. Esta é uma informação sobre a quantidade teórica de como dois canais quânticos são próximos um do outro, e no caso dos operadores unitários, isso não depende da fase global.
ru: Другим способом сравнения операторов является функция ``process_fidelity`` из модуля *Quantum Information*. Она показывает теоретическую степень совпадения информации, пройденной через пару схожих квантовых каналов, при этом различие глобальной фазы не будет учитываться.
ta_in: *Quantum Information* தொகுதியிலிருந்து ``process_fidelity`` செயல்பாட்டைப் பயன்படுத்தி ஆபரேட்டர்களையும் ஒப்பிடலாம். இரண்டு குவாண்டம் channels ஒருவருக்கொருவர் எவ்வளவு நெருக்கமாக உள்ளன என்பதற்கான தகவல் கோட்பாட்டு அளவு இது, மற்றும் ஒற்றையாட்சி ஆபரேட்டர்களைப் பொறுத்தவரை இது உலகளாவிய கட்டத்தை சார்ந்தது அல்ல.
tr: *Kuantum Bilgi* modülünden ``process_fidelity`` işlevini kullanarak operatörleri karşılaştırabiliriz. Bu, iki kuantum kanalın birbirine ne kadar yakın olduğuna dair bir bilgi teorisi miktarıdır ve üniter operatörler durumunda, küresel faza bağlı değildir.

source: Note that process fidelity is generally only a valid measure of closeness if the input operators are unitary (or CP in the case of quantum channels), and an exception will be raised if the inputs are not CP.
bn_bn: উল্লেখ্য যে, প্রসেস ফিডেলিটি সাধারণত এরা কতটা কাছাকাছি তার একটি সঠিক পরিমাপ দেয় যদি ইনপুট অপারেটরগুলি ইউনিটারি হয় (অথবা CP কোয়ান্টাম চ্যানেলের ক্ষেত্রে), এবং ইনপুটগুলি CP না হলে একটি এক্সেপশন তৈরি হয়।
fr: Note : la fidélité de process est en général une mesure valide de l'équivalence si les opérateurs considérés sont unitaires (ou CP- complètement positifs- dans le cas de chemins quantiques), et une exception sera retournée si les entrées ne sont pas CP.
it_it: Nota: la fidelity di processo è generalmente una valida misura di somiglianza se gli operatori considerati sono unitari (o CP nel caso di canali quantistici), e verrà generata un'eccezione se gli input non sono CP.
pt_un: Observe que a fidelidade do processo, geralmente, é apenas uma medida válida de proximidade se os operadores de entrada são unitários (ou CP no caso dos canais quânticos), e uma exceção será levantada se as entradas não forem CP.
ru: Эта функция показывает степень совпадения только унитарных операторов (или CP в случае квантовых каналов), в остальных случаях возникает исключение (exception).
ta_in: உள்ளீட்டு ஆபரேட்டர்கள் ஒற்றுமையாக இருந்தால் (அல்லது குவாண்டம் சேனல்களின் விஷயத்தில் CP) செயல்முறை நம்பகத்தன்மை பொதுவாக நெருக்கமான ஒரு சரியான நடவடிக்கை மட்டுமே என்பதை நினைவில் கொள்க, மேலும் உள்ளீடுகள் CP இல்லையென்றால் விதிவிலக்கு எழுப்பப்படும்.
tr: İşlem doğruluğunun genellikle girdi operatörleri üniter (veya kuantum kanalları durumunda CP) ise yalnızca geçerli bir yakınlık ölçüsü olduğunu ve girdiler CP değilse bir istisna oluşacağını unutmayın.

source: ``dims``: To return the total input and output dimension of the operator, we may use the ``Operator.dim`` property. *Note: the output is returned as a tuple* ``(input_dim, output_dim)``, *which is the reverse of the shape of the underlying matrix.*
fr: ``dims``: Pour renvoyer la dimension totale d'entrée et de sortie de l'opérateur, nous pouvons utiliser la propriété ``Operator.dim``. *Remarque: la sortie est retournée sous forme de tuple * ``(input_dim, output_dim)``, * qui est l'inverse de la matrice sous-jacente.*
pt_un: ``dims``: Para devolver a dimensão total de entrada e saída do operador, podemos usar a propriedade ``Operator.dim``. *Nota: a saída é retornada como um tuple* ``(input_dim, output_dim)``, *que é o reverso da forma da matriz subjacente.*
ru: ``dims``: Размеры исходного и преобразованного векторов можно узнать с помощью свойства ``Operator.dim``. *Примечание: Результатом будет кортеж ``(input_dim, output_dim)``, при этом размерность основной матрицы составляет ``output_dim`` на ``input_dim``.*
tr: ``dims``: Operatörün toplam girdi ve çıktı boyutunu döndürmek için ``Operator.dim`` özelliğini kullanabiliriz. *Not: Çıktı, altında yatan matrisin şeklinin tersi olan bir tuple* ``(input_dim, output_dim)`` *olarak döndürülür.*

source: ``QuantumCircuit`` objects
fr: Objets ``QuantumCircuit``
pt_un: Objetos ``QuantumCircuits``
ru: ``QuantumCircuits``
tr: ``QuantumCircuit``nesneleri

source: Two operators :math:`A` and :math:`B` may be combined into a tensor product operator :math:`A\otimes B` using the ``Operator.tensor`` function. Note that if both :math:`A` and :math:`B` are single-qubit operators, then ``A.tensor(B)`` = :math:`A\otimes B` will have the subsystems indexed as matrix :math:`B` on subsystem 0, and matrix :math:`A` on subsystem 1.
fr: Deux opérateurs :math:`A` et :math:`B` peuvent être combinés en un opérateur de produit tensoriel :math:`A\otimes B` en utilisant la fonction ``Operator.tensor``. Notez que si :math:`A` et :math:`B` sont des opérateurs à un seul qubit, alors ``A. ensor(B)`` = :math:`A\otimes B` aura les sous-systèmes indexés comme la matrice :math:`B` sur le sous-système 0, et la matrice :math:`A` sur le sous-système 1.
pt_un: Dois operadores :math:`A` e :math:`B` podem ser combinados em um operador de produto de tensor :math:`A\otimes B` usando a função ``Operator.tensor``. Note que se :math:`A` e :math:`B` são operadores de um único qubit, então ``A.tensor(B)`` = :math:`A\otimes B` terão os subsistemas indexados como matriz :math:`B` no subsistema 0, e a matriz :math:`A` no subsistema 1.
ru: Из двух операторов :math:`A` и :math:`B` можно построить оператор большей размерности, перемножая их тензорно :math:`A\otimes B` с помощью ``Operator.tensor``. Если операторы :math:`A` и :math:`B` являются однокубитными, то ``A.tensor(B)`` = :math:`A\otimes B` означает одновременное действие :math:`B` на нулевой кубит и :math:`A` на первый.
tr: :math:`A` ve :math:`B` adlı iki operatör, ``Operator.tensor`` fonksiyonu kullanılarak bir tensör çarpımına :math:`A\otimes B` birleştirilebilir. :math:`A` ve :math:`B` tek-kubitli operatörler ise o zaman ``A.tensor(B)`` = :math:`A\otimes B` nın 0 alt sistemlerinde :math:`B` matrisi olarak ve 1 alt sistemlerinde :math:`A` matrisi olarak indeksleneceğine dikkat edin.

source: A closely related operation is ``Operator.expand``, which acts like a tensor product but in the reverse order. Hence, for two operators :math:`A` and :math:`B` we have ``A.expand(B)`` = :math:`B\otimes A` where the subsystems indexed as matrix :math:`A` on subsystem 0, and matrix :math:`B` on subsystem 1.
fr: Une opération étroitement liée est ``Operator.expand``, qui agit comme un produit tensoriel mais dans l'ordre inverse. Par conséquent, pour deux opérateurs :math:`A` et :math:`B` nous avons ``A. expand (B)`` = :math:`B\otimes A` où les sous-systèmes sont indexés comme matrice :math:`A` sur le sous-système 0, et la matrice :math:`B` sur le sous-système 1.
pt_un: Uma operação próxima é a ``Operator.expand``, que atua como um produto de tensor, mas na ordem inversa. Portanto, para os dois operadores :math:`A` e :math:`B` temos ``A.expand(B)`` = :math:`B\otimes A` onde os subsistemas indexaram como matriz :math:`A no subsistema 0, e matriz :math:`B` no subsistema 1.
ru: Похожим образом действует и функция``Operator.expand``, вычисляющая тензорное произведение тех же матриц, записанных в обратном порядке. Результатом будет оператор ``A.expand(B)`` = :math:`B\otimes A`, где :math:`A` действует уже на нулевой кубит, а :math:`B` на первый.
tr: Yakından ilişkili bir işlem, tensör çarpımı gibi fakat ters sırada hareket eden ``Operator.expand`` dir. Bu nedenle, :math:`A` ve :math:`B` isimli iki operatör için alt sistemlerin, 0 alt sisteminde :math:`A` matrisi olarak ve 1 alt sisteminde :math:`B` matrisi olarak indeksleneceği yerde ``A.expand(B)`` = :math:`B\otimes A` miz var.

source: We can also compose a smaller operator with a selection of subsystems on a larger operator using the ``qargs`` kwarg of ``compose``, either with or without ``front=True``. In this case, the relevant input and output dimensions of the subsystems being composed must match. *Note that the smaller operator must always be the argument of* ``compose`` *method.*
fr: Nous pouvons également composer un opérateur plus petit avec une sélection de sous-systèmes sur un plus gros opérateur utilisant ``qargs`` kwarg de ``compose``, avec ou sans ``front=True``. Dans ce cas, les dimensions d'entrée et de sortie pertinentes des sous-systèmes composés doivent correspondre. *Notez que le plus petit opérateur doit toujours être l'argument de * ``compose`` * method.*
pt_un: Também podemos compor um operador menor com uma seleção de subsistemas em um operador maior usando o ``qargs`` kwarg de ``compose``, com ou sem ``front=True``. Neste caso, as dimensões relevantes de entrada e saída dos subsistemas que estão a ser compostos devem corresponder. *Observe que o operador menor deve sempre ser o argumento do *método* ``compose``.*
ru: Можно также матрично умножить оператор на выбранную часть другого оператора большей размерности. Для этого применяют аргумент с ключом ``qargs``, независимым от значения ``front``. Здесь также нужно следить за равенством количества столбцов первой матрицы и строк второй. *Меньший по размеру оператор будет аргументом метода ``compose``, применяемого к большему*
tr: Ayrıca, ``front=True`` ile birlikte ya da değil, ``compose`` un ``qargs`` argümanını kullanarak daha büyük bir operatör üzerindeki alt sistemlerin bir seçmesiyle birlikte daha küçük bir operatörü birleştirebiliriz. Bu durumda, birleştirilen alt sistemlerin uygun giriş ve çıkış boyutları eşleşmelidir. *Daha küçük olan operatörün her zaman* ``compose`` *yönteminin argümanı olmasına dikkat edin.*
