Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/03_advanced_circuit_visualization.po
Languages: bn_bn, es_un, id_id, it, ja, ko, pt_un, ru_ru, ta_in, tr

source: **latexdrawerstyle** (bool): When set to True, enable LaTeX mode, which will draw gates like the ``latex`` output modes.
bn_bn: **latexdrawerstyle** (bool): True সেট করা থাকলে, LaTeX মোড লাগু করুন, যা ``latex`` আউটপুট মোডের মতো যুক্তিবর্তনী (গেট) গুলি আঁকবে।
es_un: **latexdrawerstyle** (bool): Cuando se establece en True, la modalidad LaTeX que diseña las compuertas como la modalidad de salida ``latex`` es habilitada.
id_id: ** latexdrawerstyle** (bool): Ketika diatur ke True, aktifkan mode LaTeX, yang akan menggambar gerbang seperti mode ` ` latex ` ` ` output.
it: **latexdrawerstyle** (bool): Quando è impostato su True, la modalità LaTeX che disegna i gate come modalità di output ``latex`` è abilitata.
ja: **latexdrawerstyle** (bool): True に設定すると、LaTex モードが有効になり、ゲートを ``latex`` 出力モードで描画する。
ko: **latexdrawerstyle** (bool): 참일때 LaTeX 모드로 전환하여 게이트를 ``latex`` output 모드로 그려준다.
pt_un: **latexdrawerstyle** (bool): Quando configurado como True, ativa o modo LaTeX, que desenhará gates como os modos de saída ``látex``.
ru_ru: **latexdrawerstyle** (bool): Значение True включает режим отображения гейтов в стиле LaTeX.
ta_in: **latexdrawerstyle** (bool): உண்மை என அமைக்கப்பட்டால், லாடெக்ஸ் பயன்முறையை இயக்கவும், இது `` latex`` வெளியீட்டு முறைகள் போன்ற வாயில்களை வரையும்.
tr: **latexdrawerstyle** (bool): True olarak ayarlandığında, ``latex`` çıkış modları gibi kapı çizecek LaTeX modunu etkinleştirir.

source: **usepiformat** (bool): When set to True, use radians for output.
bn_bn: **usepiformat** (bool): সত্য (True) হিসাবে সেট করা হলে, আউটপুট জন্য রেডিয়ান ব্যবহার করুন।
es_un: **usepiformat** (bool): Cuando se establece en True, se usan radianes para la salida.
id_id: ** usepiformat** (bool): Ketika diatur ke True, gunakan radian untuk keluaran.
it: **usepiformat** (bool): Quando impostato su True, usa i radianti per l'output.
ja: **usepiformat** (bool): True にセットすると、ラジアンを出力に利用する。
ko: **usepiformat** (bool): 참이면 출력에 라디안을 사용한다.
pt_un: **usepiformat** (bool): Quando configurado como True, use radianos para saída.
ru_ru: **usepiformat** (bool): При True углы указываются в радианах.
ta_in: ** usepiformat ** (bool): உண்மை என அமைக்கப்பட்டால், வெளியீட்டிற்கு ரேடியன்களைப் பயன்படுத்தவும்.
tr: **usepiformat** (bool): True olarak ayarlandığında, çıktı için radyan kullanır.

source: **fold** (int): The number of circuit elements at which to fold the circuit. Defaults to 20
bn_bn: **fold** (int): বর্তনী (সার্কিট) কে ফোল্ড করার জন্য সার্কিট উপাদানের সংখ্যা। ডিফল্ট 20
es_un: **fold** (int): El número de elementos de circuito presentados a lo largo de la visualización. El valor predeterminado es 20
id_id: ** fold** (int): Jumlah elemen sirkuit untuk melipat sirkuit. Default-nya: 20
it: **fold** (int): il numero di elementi del circuito dopo cui andare a capo nella visualizzazione. L'impostazione predefinita è 20
ja: **fold** (int): 回路を折り返す回路要素の数。デフォルトは20。
ko: **fold** (int): 회로를 접게 되는 회로요소들의 개수 기본값은 20이다.
pt_un: **fold** (int): O número de elementos de circuito em que dobrar o circuito. O padrão é 20
ru_ru: **fold** (int): Число элементов цепи на одной строке 20
ta_in: **fold** (int): சுற்று மடிக்க வேண்டிய சுற்று கூறுகளின் எண்ணிக்கை. இயல்புநிலை 20 ஆக
tr: **fold** (int): Devrenin katlanacağı devre elemanlarının sayısı. Varsayılan değer 20

source: **cregbundle** (bool): If set True, bundle classical registers.
bn_bn: **cregbundle** (bool): যদি এটি সত্য(True) সেট করা হয়, তবে ক্লাসিকাল রেজিস্টারগুলি বান্ডেল করুন।
es_un: **cregbundle** (bool): Si se establece en True, se agrupan los registros clásicos.
id_id: ** cregbundle** (bool): Jika diset True, bundel klasik digunakan.
it: **cregbundle** (bool): Se impostato su True, i registri classici vengono raggruppati insieme.
ja: **cregbundle** (bool): True にセットすると、古典レジスタをバンドルする。
ko: **cregbundle** (bool): 참(True) 이면 고전 레지스터를 묶는다.
pt_un: **cregbundle** (bool): Se definido como True, registros clássicos do bundle.
ru_ru: **cregbundle** (bool): При True классические биты отображаются единым регистром.
ta_in: ** cregbundle ** (bool): உண்மை என அமைத்தால், கிளாசிக்கல் பதிவுகளை மூட்டை.
tr: **cregbundle** (bool): True olarak ayarlanırsa, klasik yazmaçları gruplar.

source: **showindex** (bool): If set True, draw an index.
bn_bn: **শো ইনডেক্স** (বুল): যদি সত্য দিয়ে নিযুক্ত করা থাকে তবে একটি সূচিপত্র আঁকুন।
es_un: **showindex** (bool): Si se establece en True, dibuja un índice.
id_id: ** showindex** (bool): Jika diatur True, haslkan sebuah index.
it: **showindex** (bool): Se impostato a True, disegna un indice.
ja: **showindex** (bool): True にセットすると、インデックスを表示。
ko: **showindex** (bool): 참(True) 이면 인덱스를 그린다.
pt_un: **showindex** (bool): Se definido True, desenha um índice.
ru_ru: **showindex** (bool): Значение True показывает индекс.
ta_in: ** showindex ** (bool): உண்மை என அமைத்தால், ஒரு குறியீட்டை வரையவும்.
tr: **showindex** (bool): True olarak ayarlanırsa, bir dizin çizer.

source: **compress** (bool): If set True, draw a compressed circuit.
bn_bn: **সংকুচিত (কম্প্রেস )** (বুল): যদি সত্য দিয়ে নিযুক্ত করা থাকে তবে একটি সংকুচিত বর্তনী (সার্কিট) আঁকুন ।
es_un: **compress** (bool): Si se establece en True, dibuja un circuito comprimido.
id_id: ** compress** (bool): Jika diset True, gambarkan sirkuit yang dikompresi.
it: **compressa** (bool): Se impostato a True, disegna un circuito compresso.
ja: **compress** (bool): True にセットすると、圧縮した回路を描画。
ko: **Compress** (bool): 참(True) 이면 압축된 회로를 그린다.
pt_un: **compress** (bool): Se definido True, desenhe um circuito comprimido.
ru_ru: **compress** (bool): Значение True отображает схему в сжатом виде.
ta_in: **compress** (bool): உண்மை என அமைத்தால், சுருக்கப்பட்ட சுற்று வரையவும்.
tr: **compress** (bool): True olarak ayarlanırsa, sıkıştırılmış bir devre çizer.

source: **figwidth** (int): The maximum width (in inches) for the output figure.
bn_bn: **ছবির প্রস্থ (ফিগউইড্থ) ** (ইন্ট ): ফলাফলের চিত্রের জন্য সর্বাধিক প্রস্থ (ইঞ্চিতে)।
es_un: **figwidth** (int): El alcho máximo (en pulgadas) para la figura mostrada.
id_id: ** figwidth** (int): Lebar maksimum (dalam inci) untuk angka keluaran.
it: **figwidth** (int): La larghezza massima (in pollici) per la figura in output.
ja: **figwidth** (int): 出力図の最大幅(単位はインチ)。
ko: **figwidth** (int): 출력되는 그림의 최대 너비(인치 단위).
pt_un: **figwidth** (int): A largura máxima (em polegadas) para a figura de saída.
ru_ru: **figwidth** (int): Максимальная ширина изображения (в дюймах).
ta_in: ** figwidth ** (int): வெளியீட்டு உருவத்திற்கான அதிகபட்ச அகலம் (அங்குலங்களில்).
tr: **figwidth** (int): Çıktı figürü için maksimum genişlik (inç cinsinden).

source: **dpi** (int): The DPI to use for the output image. Defaults to 150.
bn_bn: **ডিপিআই** (ইন্ট): ফলাফল চিত্রের জন্য ব্যবহার করার ডিপিআই। ডিফল্ট -এ ১৫০ ।
es_un: **dpi** (int): La resolución (en puntos por pulgada, DPI) a utilizar en la figura mostrada. El valor predeterminado es 150.
id_id: ** dpi** (int): DPI digunakan untuk gambar keluaran. Baku ke 150.
it: **dpi** (int): I DPI da usare per l'immagine di output. Il valore predefinito è 150.
ja: **dpi** (int): 出力イメージに利用される DPI。デフォルトは 150。
ko: **dpi** (int): 이미지의 DPI 설정 기본값은 150이다.
pt_un: **dpi** (int): O DPI a ser usado para a imagem de saída. O padrão é 150.
ru_ru: **dpi** (int): Разрешение изображения 150.
ta_in: ** dpi ** (int): வெளியீட்டு படத்திற்கு பயன்படுத்த DPI. இயல்புநிலை 150 ஆக உள்ளது.
tr: **dpi** (int): Çıktı görüntüsü için kullanılacak DPI. Varsayılan değer 150'dir.

source: **creglinestyle** (str): The style of line to use for classical registers. Choices are ``'solid'``, ``'doublet'``, or any valid matplotlib ``linestyle`` kwarg value. Defaults to ``doublet``.
bn_bn: ** ক্রেগলাইনস্টাইল ** (str): ক্লাসিকাল রেজিস্টার নিবন্ধগুলির জন্য ব্যবহৃত লাইনের শৈলী। পছন্দগুলি হ'ল ``'solid'``, ``'doublet'``, বা কোনও বৈধ matplotlib ``linestyle`` কীওয়ার্ড আর্গুমেন্টের মান। ডিফল্ট -এ ``doublet``।
es_un: **creglinestyle** (str): El estilo de línea a utilizar para los registros clásicos. Las opciones son ``'solid'``, ``'doublet'``, o cualquier valor que pueda tomar el kwarg ``linestyle`` de matplotlib. El valor predeterminado es ``doublet``.
id_id: ** creglinestyle** (str): Gaya dari baris digunakan untuk register klasik. Pilihan adalah ` ` ` solid '` `, ` `' doublet ' ` `, atau setiap valid matplotlib ` ` linestyle ` ` ` kwarg value. Default-nya: ` ` doublet ` `.
it: **creglinestyle** (str): definisce lo stile di linea da utilizzare per i registri classici. Le scelte sono ``'solid'``, ``'doublet'``, o qualsiasi kwarg matplotlib valido per l'argomento della parola chiave ``linestyle``. L'impostazione predefinita è ``doublet``.
ja: **creglinestyle** (str): 古典レジスタの線スタイル。選択値は、 ``'solid'`` 、 ``'doublet'`` 、あるいは matplotlib で有効な ``linestyle`` キーワード引数の値。デフォルトは ``'doublet'`` 。
ko: **creglinestyle** (str): 고전 레지스터에 사용할 선의 디자인 스타일. 옵션 중에는 ``'solid'``, ``'doublet'``, 또는 다른 유효한 matplotlib의 ``linestyle`` kwarg 값을 넣을 수 있다. 기본값은 ``doublet`` 이다.
pt_un: **creglinestyle** (str): O estilo da linha a ser usado para registros clássicos. As opções são ``'solid'``, ``'doublet'``, ou qualquer valor matplotlib ``linestyle`` kwarg. O padrão é ``doublet``.
ru_ru: **creglinestyle** (str): Тип линии классического регистра. Можно установить ``'solid'``, ``'doublet'`` (по умолчанию) или любой другой аргумент ``linestyle``, используемый matplotlib.
ta_in: ** creglinestyle ** (str): கிளாசிக்கல் பதிவேடுகளுக்கு பயன்படுத்த வேண்டிய வரியின் பாணி. தேர்வுகள் `` 'solid'``, ``' doublet'``, அல்லது எந்தவொரு செல்லுபடியாகும் matplotlib `` linestyle`` kwarg மதிப்பு. இயல்புநிலை `` doublet``.
tr: **creglinestyle** (str): Klasik yazmaçlar için kullanılacak çizgi stili. Seçenekler ``'solid'``, ``'doublet'``, veya herhangi bir geçerli matplotlib ``linestyle`` kwarg değeridir. Varsayılan olarak ``doublet``.

source: circuit_drawer() as function
bn_bn: ফাংশন হিসাবে সার্কিট_ড্রয়ার()
es_un: circuit_drawer() como función
id_id: circuit_drawer () sebagai fungsi
it: circuit_drawer() come funzione
ja: 関数としてのcircuit_drawer()
ko: 함수로서의 circuit\_drawer()
pt_un: circuit_drawer() como função
ru_ru: circuit_drawer() как функция
ta_in: circuit_drawer () செயல்பாடாக
tr: fonksiyon olarak circuit_drawer()

source: If you have an application where you prefer to draw a circuit with a self-contained function instead of as a method of a circuit object, you can directly use the ``circuit_drawer()`` function, which is part of the public stable interface from ``qiskit.tools.visualization``. The function behaves identically to the ``circuit.draw()`` method, except that it takes in a circuit object as required argument.
bn_bn: আপনার যদি এমন কোনো অ্যাপ্লিকেশন থাকে যেখানে আপনি সার্কিট (বর্তনী) অবজেক্ট পদ্ধতির পরিবর্তে স্বনির্ভর ফাংশন দিয়ে একটি সার্কিট আঁকতে পছন্দ করেন, আপনি সরাসরি ``circuit_drawer()`` ফাংশনটি ব্যবহার করতে পারেন, যেটা `is qiskit.tools.visualization`` এর সর্বসাধারণ স্থিত ইন্টারফেসের অংশ। এই `` ফাংশনটি ``circuit.draw()`` পদ্ধতির সাথে অভিন্ন আচরণ করে, ব্যতীত এটি প্রয়োজনীয় আর্গুমেন্ট (যুক্তি) হিসাবে একটি সার্কিট (বর্তনী) অবজেক্ট নেয়।
es_un: Si se tiene una aplicación donde se prefiere dibujar un circuito con una función autónoma en vez de usar un método de un objeto circiuto, puedes utilizar la función ``circuit_drawer()``, la cual es parte de la interfaz pública estable de ``qiskit.tools.visualization``. La función se comporta de forma idéntica al método ``circuit.draw()``, excepto que toma un objeto de circuito como argumento necesario.
id_id: Jika Anda memiliki aplikasi di mana Anda lebih suka menggambar sebuah sirkuit dengan fungsi mandiri bukan sebagai metode dari objek sirkuit, Anda dapat langsung menggunakan ` ` circuit_laci () ` ` ` fungsi, yang merupakan bagian dari antarmuka stabil publik dari ` `qiskit.tools.visualisasi ` `. Fungsi tersebut berperilaku secara identik dengan ` `circuit.draw () ` ` metode, namun ia memerlukan objek sirkuit sebagai argumen yang diperlukan.
it: Se si lavora con un'applicazione in cui si preferisce disegnare un circuito con una funzione autonoma anziché con un metodo di un oggetto circuito, è possibile utilizzare direttamente la funzione ``circuit_drawer()``, che fa parte dell'interfaccia pubblica stabile da ``qiskit.tools.visualization``. La funzione si comporta in modo identico al metodo ``circuit.draw()``, tranne per il fatto che si aspetta come argomento un oggetto circuito.
ja: circuit オブジェクトのメソッドではなく、自己完結型の関数を利用して回路を描画したいアプリケーションを持っている場合、 ``qiskit.tools.visualization`` からの public stable interface の一つである、 ``circuit_drawer()`` 関数を直接利用することができます。この関数は、 ``circuit.draw()`` メソッドと全く同様に振る舞いますが、circuit オブジェクトを引数として受け取るという点のみ異なります。
ko: 회로 객체의 메소드가 아니라 자체 포함 함수로 회로를 그리는 것을 선호하는 애플리케이션이 있는 경우에는 ``qiskit.tools.visualization`` 에서 public stable 인터페이스의 일부인 ``circuit_drawer()`` 기능을 직접 사용할 수 있다. 이 함수는 요구되는 인자로서 회로 객체를 취하는 것을 제외하고는 ``circuit.draw()`` 함수와 동일하게 동작한다.
pt_un: Se você tem um aplicativo onde você prefere desenhar um circuito com uma função auto-contida em vez de um método de um objeto de circuito, você pode usar diretamente a função ``circuit_drawer()``, que faz parte da interface pública estável de ``qiskit.tools.visualization``. A função se comporta de forma idêntica ao método ``circuit.draw()``, exceto que recebe um objeto de circuito como argumento necessário.
ru_ru: Если вы хотите отобразить цепь, не используя метод объекта, а применяя отдельную функцию стороннего приложения, можно напрямую использовать ``circuit_drawer()``, являющуюся частью открытого стабильного интерфейса из ``qiskit.tools.visualization``. Эта функция ведет себя аналогично рассмотренному методу, однако требует указания цепи в качестве аргумента.
ta_in: ஒரு சுற்று பொருளின் முறையாக இல்லாமல் ஒரு தன்னிறைவான செயல்பாட்டைக் கொண்டு ஒரு சுற்று வரைய விரும்பினால், நீங்கள் நேரடியாக `` circuit_drawer() `` செயல்பாட்டைப் பயன்படுத்தலாம், இது பொது நிலையான இடைமுகத்தின் ஒரு பகுதியாகும் ``qiskit.tools.visualization`` இலிருந்து. செயல்பாடு `` circuit.draw() `` முறைக்கு ஒத்ததாக செயல்படுகிறது, தவிர அது ஒரு சுற்று பொருளில் தேவையான வாதமாக எடுக்கும்.
tr: Bir devre nesnesinin metodu yerine bağımsız bir işleve sahip bir devre çizmeyi tercih ettiğiniz bir uygulamanız varsa, doğrudan ``qiskit.tools.visualization``'dan genel kaarlı arabirimin bir parçası olan ``circuit_drawer()`` işlevini kullanabilirsiniz. İşlev, bağımsız değişken olarak bir devre nesnesini alması dışında, ``circuit.draw ()`` metoduyla aynı şekilde davranır.

source: Note: In Qiskit Terra <= 0.7, the default behavior for the circuit_drawer() function is to use the latex output backend, and in 0.6.x that includes a fallback to mpl if latex fails for any reason. Starting with release > 0.7, the default changes to the text output.
bn_bn: টীকা: Qiskit টেরা <= 0.7 এ, সার্কিট_ড্রয়ার () ( circuit_drawer()) ফাংশনের জন্য ডিফল্ট আচরণ হ'ল ল্যাটেক্স আউটপুট ব্যাকএন্ড ব্যবহার করা, এবং 0.6.x এ ল্যাটেক্স কোনও কারণে ব্যর্থ হলে mpl একটি fallback অন্তর্ভুক্ত করে। রিলিজ > 0.7 থেকে শুরু করে পাঠ্যের আউটপুটটিতে ডিফল্ট পরিবর্তন হয়।
es_un: Nota: En Qiskit Terra <= 0.7, el comportamiento por defecto de la función circuit_drawer() es utilizar un backend de salida latex, y en 0.6.x incluye una sustitución a mpl en caso de que latex falle por alguna razón. A partir de la versión > 0.7, la visualización predeterminada cambia a texto de salida.
id_id: Catatan: Dalam Qiskit Terra < = 0.7, perilaku defauly\t untuk fungsi circuit_drawer() adalah dengan menggunakan keluaran backend latex, dan dalam 0.6.x yang meliputi suatu fallback ke mpl jika lateks gagal karena alasan apapun. Dimulai dengan rilis > 0.7, perubahan baku pada keluaran teks.
it: Nota: in Qiskit Terra <= 0.7, il comportamento predefinito per la funzione circuit_drawer() è quello di utilizzare come backend di output latex, e in particolare in 0.6.x si include una fallback a mpl se latex fallisce per qualsiasi motivo. A partire dai rilasci > 0.7, la visualizzazione predefinita è in modalità testo.
ja: 注記: Qiskit Terra <= 0.7 における circuit_drawer() 関数のデフォルト動作は latext 出力バックエンドの使用になります。0.6.x では、latex がなんらかの事情で失敗した場合、mpl で代替するようになっています。release > 0.7 からのデフォルトは、text 出力に変わっています。
ko: 참고: Qiskit Terra <= 0.7에서, circuit_drawer() 함수는 기본적으로 LaTeX 출력 백엔드를 사용한다. 그리고 0.6.x 버전 라인업에서는 LaTeX이 어떤 이유로 작동 실패할 경우 mpl(matplotlib)으로 자동 전환된다. 릴리즈 > 0.7 부터, 기본값은 텍스트 출력으로 변경된다.
pt_un: Nota: No Qiskit Terra <= 0.7, o comportamento padrão para a função circuit_drawer() é usar o serviço de saida do latex, e na 0.6.x que inclui um fallback para mpl se o latex falhar por qualquer motivo. Começando com o release > 0.7, o padrão muda para a saída de texto.
ru_ru: Примечание: В версиях Qiskit Terra <= 0.7, функция circuit_drawer() использует latex-отображение по умолчанию, при этом в 0.6.x резервным вариантом служит mpl при возникновении любых ошибок. Начиная с версии > 0.7 стандартным является текстовый вывод.
ta_in: Note: Qiskit Terra <= 0.7 இல், circuit_drawer() செயல்பாட்டின் இயல்புநிலை நடத்தை லேடெக்ஸ் வெளியீட்டு பின்தளத்தில் பயன்படுத்துவதும், மற்றும் 0.6.x இல் எந்த காரணத்திற்காகவும் latex தோல்வியுற்றால் mpl. வெளியீடு> 0.7 தொடங்கி, இயல்புநிலை உரை வெளியீட்டில் மாறுகிறது.
tr: Not: Qiskit Terra <= 0.7 içerisinde, circuit_drawer() fonksiyonu için varsayılan davranış lateks çıktı backendini kullanmaktır ve 0.6.x içerisinde, lateks herhangi bir nedenle başarısız olursa mpl'ye geri döndüren bir yedek içerir. 0.7 sürümünden büyük bir sürümle başlayarak varsayılan, metin çıktısına değişir.

source: The first two options are shared among all three backends. They allow you to configure both the bit orders and whether or not you draw barriers. These can be set by the ``reverse_bits`` kwarg and ``plot_barriers`` kwarg, respectively. The examples below will work with any output backend; ``mpl`` is used here for brevity.
bn_bn: প্রথম দুটি বিকল্পকে তিনটি ব্যাকেন্ডের মধ্যে ভাগ করা হয়েছে। তারা আপনাকে বিট অর্ডার এবং বেষ্টনীগুলি আঁকা কিনা তা সাজাতে দেয় । ``reverse_bits`` কীওয়ার্ড আর্গুমেন্ট এবং ``plot_barriers`` কীওয়ার্ড আর্গুমেন্ট দ্বারা এগুলি নিশ্চিত করা যায়। নীচের উদাহরণগুলি যে কোনও আউটপুট ব্যাকএন্ডে কাজ করবে। এখানে সংক্ষিপ্ত করার জন্য ``mpl`` ব্যবহৃত হয়েছে।
es_un: Las dos primeras opciones se comparten entre los tres backends. Te permiten configurar tanto el orden de bits como si dibujas o no barreras. Estos se pueden establecer mediante el kwarg ``reverse_bits`` y el kwarg ``plot_barriers``, respectivamente. Los ejemplos siguientes funcionarán con cualquier backend de salida; ``mpl`` se utiliza aquí para ser breves.
it: Le prime due opzioni sono condivise tra tutti e tre i backend. Consentono di configurare sia l'ordine dei bit sia e se visualizzare o meno le barriere. Questi possono essere definiti rispettivamente dal kwarg ``reverse_bits`` e dal kwarg ``plot_barriers``. Gli esempi seguenti funzioneranno con qualsiasi backend di output; verrà illustrato solo il caso del ``mpl`` per brevità.
ja: 最初の2つのオプションは、ビット順とバリアを引くかどうかを設定できるもので、3つのバックエンドすべてで共有されています。 これらはそれぞれ ``plot_barriers`` kwargと ``plot_barriers`` kwargで設定できます。 以下の例はどの出力バックエンドでも動作しますが、簡潔にするためここでは ``mpl`` だけを使用します。
ko: 처음 두 개의 옵션은 세 개의 백엔드(Renderer) 전부 공유한다. 이를 통해 비트 순서와 장벽을 그릴지에 대한 여부를 둘 다 설정할 수 있다. 이들은 ``reverse_bits`` 키워드와 ``plot_barriers`` 키워드에 의해 각각 설정될 수 있다. 아래 예제는 어떤 출력 백엔드와도 작동할 것이며 여기에선 간결성을 위해 ``mpl`` 이 사용된다.
pt_un: As duas primeiras opções são compartilhadas entre todos os três backends. Eles permitem que você configure ambos os pedidos de bits e se você desenha ou não barreiras. Estes podem ser configurados pelo ```reverse_bits`` kwarg e ``plot_barriers`` kwarg, respectivamente. Os exemplos abaixo trabalharão com qualquer serviço de saída; ``mpl`` é usado aqui para brevidade.
ru_ru: Первые две опции доступны для всех трех типов отображений. Они позволяют настраивать порядок битов (по ключу ``reverse_bits``) и наличие разделителей (по ключу ``plot_barriers``) независимо друг от друга. Приведенные ниже примеры будут работать с любым выводом; ``mpl`` выбран для краткости.
tr: İlk iki seçenek üç backend arasında paylaşılır. Hem bit sıralarını hem de bariyer çizip çizmediğinizi yapılandırmanıza izin verir. Bunlar sırasıyla ``reverse_bits`` kwarg ve ``plot_barriers`` kwarg tarafından ayarlanabilmektedir. Aşağıdaki örnekler herhangi bir çıktı backendiyle çalışacaktır; ``latex`` burada kısalık amacıyla kullanılmıştır.

source: A text output is useful for quickly seeing the output while developing a circuit, but it doesn't provide the most flexibility in its output. There are two alternative output renderers for the quantum circuit. One uses `matplotlib <https://matplotlib.org/>`__, and the other uses `LaTeX <https://www.latex-project.org/>`__, which leverages the `qcircuit package <https://github.com/CQuIC/qcircuit>`__. These can be specified by using ``mpl`` and ``latex`` values for the ``output`` kwarg on the draw() method.
ja: テキスト出力は、回路の構築中、出力を早く見るのに便利な一方、最も柔軟な出力を提供しているわけではありません。量子回路には、他に2つの出力レンダラーがあります。 `matplotlib <https://matplotlib.org/>`__ を使うものと、 `qcircuit パッケージ <https://github.com/CQuIC/qcircuit>`__ を活用した `LaTeX <https://www.latex-project.org/>`__ を使うものです。これらは draw() メソッドの ``output`` キーワード引数に ``mpl`` もしくは ``latex`` の値をセットすることで指定できます。

source: By default, the ``draw()`` method returns the rendered image as an object and does not output anything. The exact class returned depends on the output specified: ``'text'`` (the default) returns a ``TextDrawer`` object, ``'mpl'`` returns a ``matplotlib.Figure`` object, and ``latex`` returns a ``PIL.Image`` object. Having the return types enables modifying or directly interacting with the rendered output from the drawers. Jupyter notebooks understand these return types and render them for us in this tutorial, but when running outside of Jupyter, you do not have this feature automatically. However, the ``draw()`` method has optional arguments to display or save the output. When specified, the ``filename`` kwarg takes a path to which it saves the rendered output. Alternatively, if you're using the ``mpl`` or ``latex`` outputs, you can leverage the ``interactive`` kwarg to open the image in a new window (this will not always work from within a notebook but will be demonstrated anyway).
ja: デフォルトでは、 ``draw()`` メソッドはレンダリングされた画像をオブジェクトとして返し、何も出力しません。返される正確なクラスは、指定された出力によって異なります。``'text'`` （デフォルト）は ``TextDrawer`` オブジェクトを返し、``'mpl'`` は ``matplotlib.Figure`` オブジェクトを返し、 ``latex`` は ``PIL.Image`` オブジェクトを返します。 リターンタイプを使用すると、ドロワーからのレンダリングされた出力を変更したり、直接操作したりできます。 Jupyterノートブックはこれらのリターンタイプを理解し、このチュートリアルでレンダリングしますが、Jupyterの外部で実行する場合、この機能は自動的に使用されません。 ただし、 ``draw()`` メソッドには、出力を表示または保存するためのオプションの引数があります。 指定すると、``filename`` kwargは、レンダリングされた出力を保存するパスを取ります。 または、 ``mpl`` または ``latex`` 出力を使用している場合は、``interactive`` kwargを利用して、新しいウィンドウで画像を開くことができます（これは、ノートブック内から常に機能するとは限りませんが、とにかくデモンストレーションされます）。
