Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/03_advanced_circuit_visualization.po
Languages: bn_bn, es_un, id_id, it, ja, ko, pt_un, ru_ru, ta_in, tr

source: This page was generated from `tutorials/circuits_advanced/03_advanced_circuit_visualization.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/circuits_advanced/1_advanced_circuits.ipynb`__ থেকে উৎপন্ন হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/circuits_advanced/03_advanced_circuit_visualization.ipynb`__.
id_id: Halaman ini diambil dari `tutorials/circuits_advanced/03_advanced_circuit_visualization.ipynb`__.
it: Questa pagina è stata generata a partire da `tutorials/circuits_advanced/03_advanced_circuit_visualization.ipynb`__.
ja: 当ページは `tutorials/circuits_advanced/03_advanced_circuit_visualization.ipynb`__ から生成されました。
ko: 이 페이지는 `tutorials/circuits_advanced/03_advanced_circuit_visualization.ipynb`__ 로부터 생성되었다.
pt_un: Esta página foi gerada a partir de `tutorials/circuits_advanced/03_advanced_circuit_visualization.ipynb`__.
ru_ru: Страница создана на основе `tutorials/circuits_advanced/03_advanced_circuit_visualization.ipynb`__.
ta_in: இந்த பக்கம் ` tutorials/circuits/1_getting_started_with_qiskit.ipynb ` __ இருந்து உருவாக்கப்பட்டது.
tr: Bu sayfa `tutorials/circuits_advanced/03_advanced_circuit_visualization.ipynb`__ adresinden oluşturulmuştur.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/03_advanced_circuit_visualization.ipynb>`_.
id_id: Jalankan secara interaktif di `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/03_advanced_circuit_visualization.ipynb>`_.
ta_in: கருப்பொருளில் ஊடாடும் வகையில் இயக்கவும் ` IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits/1_getting_started_with_qiskit.ipynb>` _.

source: Visualizing a Quantum Circuit
bn_bn: কোয়ান্টাম বর্তনী দৃষ্টিগোচর করা
es_un: Visualizando un circuito cuántico
id_id: Visualisasi Sirkuit Kuantum
it: Visualizzare un circuito quantistico
ja: 量子回路の可視化
ko: 양자 회로를 시각화 하기
pt_un: Visualizando um Circuito Quântico
ru_ru: Визуализация квантовой цепи
ta_in: ஒரு குவாண்டம் சுற்று காட்சிப்படுத்துதல்
tr: Bir Kuantum Devresini Görselleştirme

source: Drawing a Quantum Circuit
bn_bn: কোয়ান্টাম সার্কিট সিমুলেট করা
es_un: Dibujando un circuito cuántico
id_id: Menggambar Sirkuit Quantum
it: Disegnare un circuito quantistico
ja: 量子回路の描画
ko: 양자 회로 그리기
pt_un: Desenhando um Circuito Quântico
ru_ru: Изображение квантовой цепи
ta_in: ஒரு குவாண்டம் சுற்று வரைதல்
tr: Bir Kuantum Devresi Çizme

source: When building a quantum circuit, it often helps to draw the circuit. This is supported natively by a ``QuantumCircuit`` object. You can either call ``print()`` on the circuit, or call the ``draw()`` method on the object. This will render a `ASCII art version <https://en.wikipedia.org/wiki/ASCII_art>`__ of the circuit diagram.
bn_bn: কোয়ান্টাম বর্তনী (সার্কিট) তৈরি করার সময় এটি প্রায়শই সার্কিট আঁকতে সহায়তা করে। এটি স্থানীয়ভাবে একটি ``QuantumCircuit`` বস্তু দ্বারা সমর্থিত। আপনি হয় সার্কিটের ``print()`` কল করতে পারেন, বা অবজেক্টের উপর ``draw()`` পদ্ধতি কল করতে পারেন। এটি বর্তনীর একটি `ASCII art version <https://en.wikipedia.org/wiki/ASCII_art>`__ যেটি দৃশ্যায়নটিকে বানায়।
es_un: Al construir un circuito cuántico, a menudo es útil dibujar el circuito. Esto es soportado de forma nativa por un objeto "QuantumCircuit". Puede llamar a "print ()" en el circuito o llamar al método "draw ()" en el objeto. Esto generará una "versión de arte ASCII <https://en.wikipedia.org/wiki/ASCII_art>"__ del diagrama de circuito.
id_id: Menggambar sirkuit berguna ketika membangun sirkuit kuantum. Membuat gambar ini didukung secara natif oleh ` ` QuantumCircuit ` ` objek. Anda dapat memanggil ` ` print () ` ` ` di sirkuit, atau memanggil ` ` draw () ` ` ` metode pada objek. Ini akan menghasilkan ` ASCII art versi <https://en.wikipedia.org/wiki/ASCII_art>` __ dari diagram sirkuit.
it: Quando si costruisce un circuito quantistico, disegnare il circuito spesso aiuta. Questa funzionalità è implementata in modo nativo dall'oggetto ``QuantumCircuit``. È possibile chiamare il metodo ``print()`` sul circuito o il metodo ``draw()`` sull'oggetto. Questo creerà una versione a caratteri ASCII <https://en.wikipedia.org/wiki/ASCII_art>`__ del diagramma del circuito.
ja: 量子回路の作成中、回路の描画が助けになることがよくあります。回路の描画は、``QuantumCircuit`` オブジェクトによりネイティブにサポートされています。回路について ``print()`` を呼ぶことも、オブジェクトに対して ``draw()`` メソッドを呼ぶこともできます。これらは、回路図を `アスキー・アート <https://en.wikipedia.org/wiki/ASCII_art>`__ 風に描画します。
ko: 양자 회로를 작성할 때 종종 그 회로를 그려보는 것이 도움이 된다. 이 기능은 ``QuantumCircuit`` 객체에서 기본적으로 지원된다. 회로를 그리려면 회로에 ``print()`` 를 사용하거나 객체에서 ``draw()`` 매서드를 불러오는 방법이 있다. 이렇게 하면 회로 다이어그램이 `ASCII art 버전 <https://en.wikipedia.org/wiki/ASCII_art>`__ 으로 그려진다.
pt_un: Ao construir um circuito quântico, muitas vezes ajuda a desenhar o circuito. Isso é suportado nativamente por um objeto ``QuantumCircuit``. Você pode chamar ``print()`` no circuito, ou chamar o método ``draw()`` no objeto. Isto irá renderizar uma `versão de arte ASCII <https://en.wikipedia.org/wiki/ASCII_art>`__ do diagrama de circuito.
ru_ru: Просмотр создаваемой квантовой цепи часто оказывается полезным при ее проектировании. Такая возможность по умолчанию предусмотрена для объектов ``QuantumCircuit``. Вы можете использовать как ``print()`` с цепью в качестве аргумента, так и метод ``draw()``. Результатом будет схема в виде `ASCII-графики <https://ru.wikipedia.org/wiki/ASCII-графика>`__.
ta_in: ஒரு quantum circuit கட்டும் போது, ​​இது பெரும்பாலும் சுற்று வரைய உதவுகிறது. இது `` quantum circuit`` பொருளால் சொந்தமாக ஆதரிக்கப்படுகிறது. நீங்கள் சுற்றுக்கு ``print() `` என்று அழைக்கலாம் அல்லது பொருளின் மீது `` draw() `` முறையை அழைக்கலாம். இது சுற்று வரைபடத்தின் `ASCII கலை பதிப்பு <https://en.wikipedia.org/wiki/ASCII_art>` __ ஐ வழங்கும்.
tr: Bir kuantum devresi oluşturulurken genellikle devreyi çizmeye yardımcı olur. Bu, bir ``QuantumCircuit`` objesi tarafından doğal olarak desteklenir. Devrede ``print()`` çağırabilir ya da objedeki ``draw()`` yöntemini çağırabilirsiniz. Bu, devre diyagramının bir `ASCII art version <https://en.wikipedia.org/wiki/ASCII_art>`__ (ASCII sanat sürümünü) görselleştirecektir.

source: Alternative Renderers for Circuits
bn_bn: বর্তনীর জন্য বিকল্প দৃশ্যায়ন
es_un: Graficadores alternos para circuitos
id_id: Render Alternatif untuk Sirkuit
it: Altri modi per disegnare i circuiti
ja: 回路の別なレンダラー
ko: 회로 시각화 대체 방법들 (Renderers)
pt_un: Renderizadores Alternativos para Circuitos
ru_ru: Альтернативные визуализаторы цепей
ta_in: மின்சாரங்களுக்கான மாற்று
tr: Devreler İçin Alternatif Görselleştiriciler

source: A text output is useful for quickly seeing the output while developing a circuit, but it doesn’t provide the most flexibility in its output. There are two alternative output renderers for the quantum circuit. One uses `matplotlib <https://matplotlib.org/>`__, and the other uses `LaTeX <https://www.latex-project.org/>`__, which leverages the `qcircuit package <https://github.com/CQuIC/qcircuit>`__. These can be specified by using ``mpl`` and ``latex`` values for the ``output`` kwarg on the draw() method.
bn_bn: একটি পাঠ্য ফলাফল, বর্তনী (সার্কিট) বিকাশকালে ফলাফলটি দ্রুত দেখার জন্য দরকারী, তবে এটি তার ফলাফলটিতে সর্বাধিক নমনীয়তা সরবরাহ করে না। কোয়ান্টাম বর্তনী (সার্কিট) -র জন্য দুটি বিকল্প ফলাফল সরবরাহকারী রয়েছে । একটি `matplotlib <https://matplotlib.org/>`__, ব্যবহার করে এবং অন্যটি LaTeX<https://www.latex-project.org/>`__, ব্যবহার করে যা `qcircuit package <https://github.com/CQuIC/qcircuit>`__ টির উদ্দেশ্যসাধন করে। এগুলি draw() পদ্ধতির কীওয়ার্ড আর্গুমেন্ট ( কোআর্গ ) ``output`` এর জন্য `` mpl`` এবং ``latex`` মান ব্যবহার করে নির্দিষ্ট করা যেতে পারে।
es_un: Una salida de texto es útil para ver rápidamente el resultado mientras se desarrolla un circuito, pero no provee la mayor flexibilidad en su resultado de salida. Hay dos graficadores de salida alternativos para el circuito cuántico. Uno usa `matplotlib <https://matplotlib.org/>`__, y el otro usa `LaTeX <https://www.latex-project.org/>`__, que aprovecha el paquete `qcircuit <https://github.com/CQuIC/qcircuit>`__. Estos pueden ser especificados utilizando los valores ``mpl`` y ``latex`` para el kwarg ``output`` en el método draw().
id_id: Keluaran teks berguna untuk melihat output sekilas saat membuat sirkuit, tetapi tidak memberikan banyak fleksibilitas di keluarannya. Terdapat dua alternatif perender keluaran untuk sirkuit kuantum. Satu memakai `matplotlib <https://matplotlib.org/>`__, dan satu lagi memakai `LaTeX <https://www.latex-project.org/>`__, dengan memanfaatkan 'paket qcircuit <https://github.com/CQuIC/qcircuit>`__. Ini dapat dispesifikasi menggunakan nilai ``mpl`` dan ``latex`` untuk kwarg ``output`` pada metode draw().
it: L'output in formato testuale è utile per visualizzare rapidamente l'output durante lo sviluppo di un circuito, ma non fornisce la massima flessibilità. Ci sono altre due modalità di visualizzazione per il circuito quantistico. Una usa `matplotlib <https://matplotlib.org/>`__, e l'altra usa `LaTeX <https://www.latex-project.org/>`__, che sfrutta il `pacchetto qcircuit <https://github.com/CQuIC/qcircuit>`__. Queste opzioni di visualizzazione possono essere specificate utilizzando i valori ``mpl`` o ``latex``' per il kwarg ``output`` nel metodo draw().
pt_un: Uma saída de texto é útil para ver rapidamente a saída quando estiver desenvolvendo um circuito, mas não fornece a maior flexibilidade em sua saída. Existem dois renderizadores de saída alternativos para o circuito quântico. Um usa `matplotlib <https://matplotlib.org/>`__, e o outro usa `LaTeX <https://www.latex-project.org/>`__, que aproveita o `qcircuit package <https://github.com/CQuIC/qcircuit>`__. Estes podem ser especificados usando valores de ``mpl`` e ``latex`` para o método ``output`` kwarg no draw().
ru_ru: Текстовый вывод полезен для быстрого просмотра при работе с цепью но не обладает достаточной гибкостью. В качестве альтернативы можно использовать `matplotlib <https://matplotlib.org/>`__, или `LaTeX <https://www.latex-project.org/>`__, использующий пакет `qcircuit <https://github.com/CQuIC/qcircuit>`__. Значение ``mpl`` или``latex`` нужно указать в качестве именованнованного аргумента ``output`` в методе draw().
ta_in: ஒரு சுற்று உருவாக்கும் போது வெளியீட்டை விரைவாகக் காண உரை வெளியீடு பயனுள்ளதாக இருக்கும், ஆனால் அது அதன் வெளியீட்டில் அதிக நெகிழ்வுத்தன்மையை வழங்காது. குவாண்டம் சுற்றுக்கு இரண்டு மாற்று வெளியீட்டு ரெண்டரர்கள் உள்ளன. ஒன்று `matplotlib <https://matplotlib.org/>` __ ஐப் பயன்படுத்துகிறது, மற்றொன்று `LaTeX <https://www.latex-project.org/>` __ ஐப் பயன்படுத்துகிறது, இது `qcircuit package <https: / /github.com/CQuIC/qcircuit>`__. draw() முறையில் `` output`` குவார்க்குக்கு `` mpl`` மற்றும் `` latex`` மதிப்புகளைப் பயன்படுத்துவதன் மூலம் இவற்றைக் குறிப்பிடலாம்.

source: Controlling output from circuit.draw()
bn_bn: Circuit.draw() থেকে ফলাফল নিয়ন্ত্রণ
es_un: Controlando la salida de circuit.draw()
id_id: Mengendalikan output dari circuit.draw ()
it: Controllo dell'output di circuit.draw()
ja: circuit.draw()からの出力の制御
ko: circuit.draw()의 출력값 설정하기
pt_un: Controlando a saída do circuit.draw()
ru_ru: Управлением выводом circuit.draw()
ta_in: Circuit.draw () இலிருந்து வெளியீட்டைக் கட்டுப்படுத்துதல்
tr: circuit.draw() içinden çıkışın denetlenmesi

source: By default, the draw method returns the rendered image as an object and does not output anything. The exact class returned depends on the output specified: ``'text'``\ (the default) returns a ``TextDrawer`` object, ``'mpl'`` returns a ``matplotlib.Figure`` object, and ``latex`` returns a ``PIL.Image`` object. Having the return types enables modifying or directly interacting with the rendered output from the drawers. Jupyter notebooks understand these return types and render them for us in this tutorial, but when running outside of Jupyter, you do not have this feature automatically. However, the ``draw()`` method has optional arguments to display or save the output. When specified, the ``filename`` kwarg takes a path to which it saves the rendered output. Alternatively, if you’re using the ``mpl`` or ``latex`` outputs, you can leverage the ``interactive`` kwarg to open the image in a new window (this will not always work from within a notebook but will be demonstrated anyway).
es_un: Por defecto, el método draw devuelve la imagen renderizada como uno objeto y no muestra nada. La clase exacta del objeto devuelto depende del output especificado: ``text'`` (la opción predeterminada) devuelve un objeto ``TextDrawer``, ``mpl'`` devuelve un objeto ``matplotlib.Figure`` y ``latex'`` devuelve un objeto ``PIL.Image``. Conocer los tipos de salida permite modificar o interactuar directamente con las salidas renderizadas. Los cuadernos de Jupyter comprenden todos los tipos de salida y los renderizan por nosotros en este tutorial, pero al ejecutar fuera de Jupyter esta función no está disponible automáticamente. No obstante, el método ``draw()`` tiene argumentos opcionales para mostrar o guardar el output. Cuando se especifica, el kwarg ``filename`` toma una ruta en la que se guarda el output renderizado. De forma alternativa, si se está utilizando los outputs ``mpl`` o ``latex``, puedes aprovechar el kwarg ``interactive`` para mostrar la imagen en una nueva ventana (esto no funcionará siempre dentro de un cuaderno pero se demuestra de todos modos).
id_id: Secara default, metode pengundian mengembalikan gambar yang diberikan sebagai objek dan tidak menghasilkan apa-apa. Kelas yang tepat kembali bergantung pada keluaran yang ditentukan: ` ` 'text '` ` ` (default) mengembalikan ` ` TextDrawer ` ` objek, ` `' 'mpl' ` ` kembali a ` `matplotlib.Figure ` ` ` objek, dan ` ` lateks ` ` kembali a ` `PIL.Image ` ` ` objek. Memiliki tipe pengembalian yang memungkinkan memodifikasi atau langsung berinteraksi dengan keluaran yang diberikan dari penyimpanan. Jupyter notebook memahami jenis pengembalian ini dan merender untuk kita dalam tutorial ini, tetapi ketika berjalan di luar Jupyter, Anda tidak memiliki fitur ini secara otomatis. Namun, ` ` draw () ` ` metode memiliki argumen opsional untuk menampilkan atau menyimpan hasil. Bila dispesifikasikan, nama ` ` filename ` ` kwarg mengambil sebuah path yang akan menyimpan keluaran yang telah diberikan. Atau, jika Anda menggunakan ` ` mpl ` ` atau ` ` latex ` ` output, Anda dapat memanfaatkan ` ` interaktif ` ` kwarg untuk membuka gambar dalam jendela baru (ini tidak akan selalu bekerja dari dalam notebook tetapi akan ditunjukkan juga).
ta_in: முன்னிருப்பாக, draw முறை காண்பிக்கப்பட்ட படத்தை ஒரு object அளிக்கிறது மற்றும் எதையும் வெளியிடுவதில்லை. குறிப்பிடப்பட்ட வெளியீட்டைப் பொறுத்து சரியான வகுப்பு திரும்பும்: ``'text'``\ (இயல்புநிலை) ஒரு `` TextDrawer`` பொருளைத் தருகிறது, ``'mpl'`` ஒரு ``matplotlib.Figure`` பொருளைத் தருகிறது, `` latex`` ஒரு `` PIL.Image`` object தருகிறது. வருவாய் வகைகளைக் கொண்டிருப்பது இழுப்பறைகளிலிருந்து வழங்கப்பட்ட வெளியீட்டை மாற்றியமைக்க அல்லது நேரடியாக தொடர்பு கொள்ள உதவுகிறது. jupyter notebook இந்த வருவாய் வகைகளைப் புரிந்துகொண்டு அவற்றை இந்த tutorial எங்களுக்கு வழங்குகின்றன, ஆனால் Jupyterருக்கு வெளியே இயங்கும் போது, ​​இந்த feature உங்களிடம் தானாக இல்லை. இருப்பினும், `` draw() `` முறை வெளியீட்டைக் காண்பிக்க அல்லது சேமிக்க விருப்ப arguments கொண்டுள்ளது. குறிப்பிடப்பட்டால், `` filename`` kwarg வழங்கப்பட்ட பாதையை அது சேமிக்கும் பாதையை எடுக்கும். மாற்றாக, நீங்கள் `` mpl`` அல்லது `` latex`` வெளியீடுகளைப் பயன்படுத்துகிறீர்கள் என்றால், படத்தை ஒரு புதிய சாளரத்தில் திறக்க `` interactive`` kwargகைப் பயன்படுத்தலாம் (இது எப்போதும் ஒரு notebookலிருந்து இயங்காது, ஆனால் எப்படியும் நிரூபிக்கப்படும்).

source: Customizing the output
bn_bn: ফলাফলটি স্বনির্ধারন করা হচ্ছে
es_un: Personalizando la salida
id_id: Penyesuaian Output
it: Personalizzare l'output
ja: 出力のカスタマイズ
ko: 출력을 맞춤 하기
pt_un: Customizando a saída
ru_ru: Настройка вывода
ta_in: வெளியீட்டைத் தனிப்பயனாக்குதல்
tr: Çıktıyı özelleştirme

source: Depending on the output, there are also options to customize the circuit diagram rendered by the circuit.
bn_bn: ফলাফলের উপর নির্ভর করে, সার্কিট দ্বারা অনুষ্ঠিত সার্কিটর (বর্তনীর) চিত্রটি স্বনির্ধারন করার বিকল্পও রয়েছে।
es_un: Dependiendo de la salida, también hay opciones que permiten personalizar el renderizado del diagrama del circuito.
id_id: Tergantung pada keluaran, ada juga pilihan untuk menyesuaikan diagram sirkuit yang diberikan oleh sirkuit.
it: A seconda del tipo di output, ci sono anche opzioni per personalizzare lo schema del circuito.
ja: 出力によっては、回路によって表示される回路図をカスタマイズするオプションもあります。
ko: 결과에 따라 회로 다이어그램을 맞춤 해 주는 옵션들이 준비되어 있다.
pt_un: Dependendo da saída, há também opções para customizar o diagrama de circuito renderizado pelo circuito.
ru_ru: В некоторых случаях можно настроить вид схемы, соответствующей цепи.
ta_in: வெளியீட்டைப் பொறுத்து, சுற்று வழங்கிய சுற்று வரைபடத்தைத் தனிப்பயனாக்க விருப்பங்களும் உள்ளன.
tr: Çıktıya bağlı olarak, devre tarafından oluşturulan devre şemasını özelleştirme seçenekleri de vardır.

source: Disable Plot Barriers and Reversing Bit Order
bn_bn: প্লটের (লেখচিত্রের) অন্তরায় এবং বিট অর্ডারের পশ্চাদ্দিকে ফিরানো থেকে অক্ষম করুন
es_un: Desactivar la visualización de barreras e invertir el orden de los bits
id_id: Menonaktifkan Hambatan Plot dan membalikkan Pengurutan Bit
it: Disabilitare la Visualizzazione delle Barriere e Invertire l'Ordine dei Bit
ja: バリアのプロット無効化とビット順序の反転
ko: 장벽 (Barriers) 그림 금지와 비트 순서 뒤집기
pt_un: Desabilitar Barreiras de Plotagem e Ordem de Bits de Reversão
ru_ru: Пропуск разделителей и обратный порядок битов
ta_in: Plot Barriers மற்றும் தலைகீழ் பிட் வரிசையை முடக்கு
tr: Çizim Bariyerlerini ve Bit Sırasını Terslemeyi Devre Dışı Bırakma

source: The first two options are shared among all three backends. They allow you to configure both the bit orders and whether or not you draw barriers. These can be set by the ``reverse_bits`` kwarg and ``plot_barriers`` kwarg, respectively. The examples below will work with any output backend; ``latex`` is used here for brevity.
id_id: Dua pilihan pertama dibagi di antara ketiga backends. Mereka memungkinkan Anda untuk mengkonfigurasi kedua perintah bit dan apakah Anda menggambar hambatan atau tidak. Ini dapat diatur oleh ` ` reverse_bits ` ` kwarg dan ` ` plot_hambatan ` ` kwarg, masing-masing. Contoh di bawah ini akan bekerja dengan backend keluaran apapun; ` ` latex ` ` digunakan di sini untuk singkatnya.
ta_in: முதல் இரண்டு விருப்பங்கள் மூன்று பின்தளத்தில் பகிரப்படுகின்றன. பிட் ஆர்டர்கள் மற்றும் நீங்கள் தடைகளை வரையலாமா இல்லையா என்பதை கட்டமைக்க அவை உங்களை அனுமதிக்கின்றன. இவற்றை முறையே `` reverse_bits`` kwarg மற்றும் `` plot_barriers`` kwarg மூலம் அமைக்கலாம். கீழேயுள்ள எடுத்துக்காட்டுகள் எந்த வெளியீட்டு பின்தளத்தில் வேலை செய்யும்; ``latex`` இங்கு சுருக்கமாகப் பயன்படுத்தப்படுகிறது.

source: Backend-specific customizations
bn_bn: ব্যাকএন্ড-নির্দিষ্ট স্বনির্ধারন
es_un: Configuraciones específicas para el backend
id_id: Kustomisasi spesifik backend
it: Personalizzazioni specifiche del backend
ja: バックエンド特有のカスタマイズ
ko: 백엔드 특정 맞춤
pt_un: Customizações específicas do backend
ru_ru: Настройки, зависящие от визуализатора
ta_in: பின்தளத்தில் குறிப்பிட்ட தனிப்பயனாக்கம்
tr: Arkayüzeye özgü özelleştirmeler
