Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/03_advanced_circuit_visualization.po
Languages: bn_bn, es_un, id_id, it, ja, ko, pt_un, ru_ru, ta_in, tr

source: Some available customizing options are specific to a backend. The ``line_length`` kwarg for the ``text`` backend can be used to set a maximum width for the output. When a diagram is wider than the maximum, it will wrap the diagram below. The ``mpl`` backend has the ``style`` kwarg, which is used to customize the output. The ``scale`` option is used by the ``mpl`` and ``latex`` backends to scale the size of the output image with a multiplicative adjustment factor. The ``style`` kwarg takes in a ``dict`` with multiple options, providing a high level of flexibility for changing colors, changing rendered text for different types of gates, different line styles, etc. Available options are:
bn_bn: কিছু উপলব্ধ কাস্টমাইজিং বিকল্প কিছু ব্যাকএন্ডের জন্য নির্দিষ্ট। আউটপুটটির সর্বাধিক প্রস্থ নির্ধারণ করতে ``text`` ব্যাকএন্ডের জন্য ``line_length`` কীওয়ার্ড আর্গুমেন্ট ব্যবহার করা যেতে পারে। যখন চিত্রটি সর্বাধিকের চেয়ে প্রশস্ত হবে, এটি নীচের চিত্রটি wrap করে নেবে । ``mpl`` ব্যাকএন্ডে ``style`` কীওয়ার্ড আর্গুমেন্ট রয়েছে, যা আউটপুট কাস্টমাইজ করতে ব্যবহৃত হয়। ``scale`` বিকল্পটি একটি গুণগত সমন্বয় ফ্যাক্টর সহ আউটপুট চিত্রের আকার স্কেল করতে ``mpl`` এবং ``latex`` ব্যাকেন্ডগুলি ব্যবহার করে। ``style`` কীওয়ার্ড আর্গুমেন্টটি একাধিক বিকল্পের সাথে একটি ``dict`` গ্রহণ করে, রঙ পরিবর্তন করার জন্য একটি উচ্চ স্তরের নমনীয়তা সরবরাহ করে, বিভিন্ন ধরণের গেটের জন্য রেন্ডার পাঠ্য পরিবর্তন করে, বিভিন্ন লাইনের শৈলী ইত্যাদি । উপলভ্য বিকল্পগুলি:
es_un: Algunas opciones de personalización son específcas para un backend. El kwarg ``line_length`` para el backend ``text`` puede ser utilizado para establecer un ancho máximo para la salida. Cuando un diagrama es más ancho que el máximo especificado, el diagrama continuará en la siguiente línea. El backend ``mpl`` tiene el kwarg ``style``, el cual se usa para personalizar el output. La opción ``scale`` se utiliza en los backends ``mpl`` y ``latex`` para escalar el tamaño de la imagen de salida con un factor de ajuste multiplicativo. El kwarg ``style`` toma un ``dict``con múltples opciones, ofreciendo un alto nivel de flexibilidad para cambiar colores, cambiar el texto renderizado para diferentes tipos de compuertas, diferentes estilos de línea, etc. Las opciones disponibles son:
id_id: Beberapa pilihan kustomisasi yang tersedia dikhususkan untuk sebuah backend. ` ` line_length ` ` kwarg untuk ` ` text ` ` ` backend dapat digunakan untuk mengatur lebar maksimum untuk keluaran. Ketika sebuah diagram lebih lebar dari yang maksimal, maka akan mengabungkan diagram di bawah ini. ` ` mpl ` ` ` backend memiliki ` ` style ` ` kwarg, yang digunakan untuk menyesuaikan keluaran. Pilihan ` ` scale ` ` digunakan oleh ` ` mpl ` ` dan ` ` latex ` ` backends untuk menskalakan ukuran gambar keluaran dengan faktor penyesuaian multiplikatif. ` ` style ` ` kwarg mengambil dalam sebuah ` ` dict ` ` ` dengan beberapa pilihan, menyediakan tingkat yang tinggi dari fleksibilitas untuk mengubah warna, mengubah teks yang diberikan untuk tipe gerbang yang berbeda, gaya baris yang berbeda, dll. Pilihan yang tersedia adalah:
it: Alcune opzioni di personalizzazione disponibili possono essere specifiche per un backend. Il kwarg ``line_length` per il backend di tipo ``text`` può essere utilizzato per impostare una larghezza massima dell'output. Quando un diagramma è più largo del massimo, il disegno continua sulla riga successiva. Per il tipo di backend ``mpl`` è anche possibile utilizzare il kwarg ``style`` per personalizzare l'output. L'opzione ``scale`` viene utilizzata dai backend ``mpl`` e ``latex`` per ridurre le dimensioni dell'immagine in uscita con un fattore di regolazione moltiplicativo. Il kwarg ``style`` viene specificato utilizzando un``dict`` (dizionario Python) con più opzioni, fornendo un alto livello di flessibilità nel cambiare i colori, modificare il testo per diversi tipi di gate, diversi stili di linee, ecc. Le opzioni disponibili sono:
ja: 一部の利用可能なカスタマイズオプションは、バックエンドに固有です。 ``text`` バックエンドの ``line_length`` キーワード引数は、出力の最大幅を設定するために使用できます。ダイアグラムの幅が指定値より広い場合は、ダイアグラムが下に折り返されます。 ``mpl`` バックエンドには、出力をカスタマイズするための ``style`` 引数があります。 ``scale`` オプションは、 ``mpl`` と ``latex`` バックエンドが出力画像のサイズを調整するのに使われる、倍数調整因子です。 ``style`` キーワード引数は、複数のオプションを ``dict`` 型で取ることができます。色を変更するための高度な柔軟性の提供や、さまざまなゲートタイプやラインスタイルのためのテキストレンダリングの変更などです。利用可能なオプションは次の通りです。:
ko: 사용 가능한 일부 사용자 지정 옵션은 백엔드에 따라 다르다. ``text`` 백엔드에 대한 ``line_length`` kwarg를 사용하여 출력의 최대 너비를 설정할 수 있다. 다이어그램이 최대값보다 넓으면 아래 다이어그래을 래핑(wrapping) 한다. ``mpl`` 백엔드에는 사용자에 따라 출력을 맞춤 지정하는 데 사용되는 ``style`` kwarg가 있다. ``scale`` 옵션은 ``mpl`` 및 ``latex`` 백엔드에서 곱셈 조정 계수(multiplicative adjustment factor) 를 이용하여 출력 이미지의 크기를 조정하는 데 사용된다. ``style`` kwarg는 여러 옵션이 있는 ``dict`` 를 가져와서 색상 변경, 다양한 유형의 게이트, 다양한 선 스타일 등에 대하여 렌더링된 텍스트를 변경하는 데 높은 수준의 유연성을 제공한다. 사용 가능한 옵션은 다음과 같다:
pt_un: Algumas opções de customização disponíveis são específicas para um backend. O ``line_length`` kwarg para o ``texto`` backend pode ser usado para configurar uma largura máxima para a saída. Quando um diagrama é mais largo do que o máximo, ele ficará contigo no diagrama abaixo. O backend ``mpl`` tem o ``estilo`` kwarg, que é usado para customizar a saída. A opção ``scale`` é utilizada pelos backends ``mpl`` e ``látex``, para escalar o tamanho da imagem de saída com um fator de ajuste multiplicativo. O ``style`` kwarg leva em um ``dict``, com várias opções, fornecendo um alto nível de flexibilidade para alteração de cores, alteração de texto renderizado para diferentes tipos de gates, estilos de linha diferentes, etc. As opções disponíveis são:
ru_ru: Некоторые опции доступны только для определенных типов вывода. Именованный аргумент ``line_length``, применяемый для ``text``, задает длину строки, после которой происходит перенос. При выводе в виде ``mpl`` доступна дополнительная настройка в аргументе с ключом ``style``. Опция ``scale`` (для ``mpl`` или ``latex``) масштабирует размер, умножая его на задаваемое число. Словарь в именованном аргументе ``style`` дает расширенный доступ, позволяя изменять цвета, наименования вентилей, типы линий и прочее. Список доступных опций и их значений по умолчанию:
ta_in: சில தனிப்பயன் விருப்பங்கள் ஒரு பின்னணிக்கு குறிப்பிடப்படுகின்றன. வெளியீட்டுக்கான அதிகபட்ச அகலத்தை அமைக்க ` ` உரை ` ` உரைக்கான ` ` kwarg ` ` kwarg `. ஒரு வரைபடம் அதிகபட்சமாக விட பெரியது, அது கீழே வரைபடத்தை மடிக்கிறது. The ` mpl ` ` backend has the ` style ` kwarg, which is used to customize the output. ` ` அளவிலான ` ` செலவு ` ` mpl ` ` மற்றும் ` ` latex` ` பின்புலத்தால் பயன்படுத்தப்படுகிறது பெரும்பாலான ஒத்திசைவு காரணத்துடன் வெளியீட்டு பிம்பத்தின் அளவை அளவுக்கு. ` `style ` ` kwarg பல விருப்பத்தேர்வுகளுடன் ` ` கண்காணிப்பு ` ` கணக்கில் எடுத்துக்கொள்ளும், வண்ணங்களை மாற்றுவதற்கு ஒரு உயர்ந்த நிலையை வழங்கும், வெவ்வேறு வகையான வாயுக்கள், வெவ்வேறு வரி பாணிகள், ஆகியவற்றுக்கு மாற்றம் செய்யும். இருக்கும் விருப்பங்கள் உள்ளன:
tr: Mevcut bazı özelleştirme seçenekleri bir backende özgüdür. ``text`` backendi için ``line_length`` kwargı (anahtar kelime argümanı), çıktı için maksimum genişlik ayarlamak üzere kullanılabilir. Bir diyagram maksimumdan daha geniş olduğunda, aşağıdaki diyagramı sarar. ``mpl`` backendinde, çıktıyı özelleştirmek için kullanılan ``style`` kwargı bulunur. ``scale`` seçeneği, ``mpl`` ve `` latex`` tarafından, çıktı görüntüsünün boyutunu çarpımsal bir ayarlama faktörü ile ölçeklendirmek için kullanılır. ``style`` kwargı, renkleri değiştirmek için yüksek seviyeli esneklik sağlamak, farklı tipte kapılar için işlenmiş metni değiştirmek, farklı çizgi stilleri vb. için çok sayıda seçeneğe sahip bir ``dict`` alır. Mevcut seçenekler şunlardır:

source: **textcolor** (str): The color code to use for text. Defaults to ``'#000000'``
bn_bn: **পাঠ্যের রঙ** (str): পাঠ্যের জন্য যে রঙের কোডটি ব্যবহার করা হয়। ``'#000000'`` পূর্ণ নির্ধারিত।
es_un: ** textcolor** (str): El código de color a utilizar para texto. El valor predeterminado es ``'#000000'``
id_id: ** textcolor** (str): Kode warna untuk digunakan untuk teks. Baku ke ` ` '#000000' ` `
it: ** textcolor ** (str): Il codice colore da utilizzare per il testo. L'impostazione predefinita è ``'#000000'``
ja: **textcolor** (str): テキストのために使用するカラーコード。デフォルトは ``'#000000'`` になる。
ko: **textcolor** (str): 텍스트에 사용할 색상 코드 기본설정은 ``'#000000'`` 이다.
pt_un: **textcolor** (str): O código de cores a ser usado para o texto. O padrão é ``'#000000'``
ru_ru: **textcolor** (str): Цвет основного текста ``'#000000'``
ta_in: ** textcolor ** (str): உரைக்கு பயன்படுத்த வேண்டிய வண்ண குறியீடு. இயல்புநிலை `` '# 000000'``
tr: **metin rengi** (str): Metin için kullanılacak renk kodu. Varsayılan değeri ``'#000000'``

source: **subtextcolor** (str): The color code to use for subtext. Defaults to ``'#000000'``
bn_bn: **উপ পাঠ্যের রঙ** (str): উপপাঠ্যের জন্য যে রঙের কোডটি ব্যবহার করা হয়। ``'#000000'`` পূর্ণ নির্ধারিত।
es_un: **subtextcolor** (str): El código de color a utilizar para subtexto. El valor predeterminado es ``'#000000'``
id_id: ** subtextcolor** (str): Kode warna untuk digunakan untuk subteks. Baku ke ` ` '#000000' ` `
it: **subtextcolor** (str): codice colore da utilizzare per il sottotesto. L'impostazione predefinita è ``'#000000'``
ja: **subtextcolor** (str) : サブテキストのために使用するカラーコード。デフォルトは ``'#000000'`` になる。
ko: **subtextcolor** (str): 서브텍스트에 사용할 색상코드 기본설정은 ``'#000000'`` 이다.
pt_un: **subtextcolor** (str): O código de cores a ser usado para subtexto. O padrão é ``'#000000'``
ru_ru: **subtextcolor** (str): Цвет подтекста ``'#000000'``
ta_in: ** subtextcolor ** (str): துணை உரைக்கு பயன்படுத்த வேண்டிய வண்ண குறியீடு. இயல்புநிலை `` '# 000000'``
tr: **alt metin rengi** (str): Alt metin için kullanılacak renk kodu. Varsayılan değeri ``'#000000'``

source: **linecolor** (str): The color code to use for lines. Defaults to ``'#000000'``
bn_bn: **পংক্তির রঙ** (str): পংক্তির জন্য যে রঙের কোডটি ব্যবহার করা হয়। ``'#000000'`` পূর্ণ নির্ধারিত।
es_un: ** textcolor** (str): El código de color a utilizar para líneas. El valor predeterminado es ``'#000000'``
id_id: ** linecolor** (str): Kode warna untuk digunakan untuk baris. Baku ke ` ` '#000000' ` `
it: ** linecolor ** (str): codice colore da utilizzare per le linee. L'impostazione predefinita è ``'#000000'``
ja: **linecolor** (str): ラインのために使用するカラーコード。デフォルトは ``'#000000'`` になる。
ko: **linecolor** (str): 선들에 사용할 색상 코드 기본설정은 ``'#000000'`` 이다.
pt_un: **linecolor** (str): O código de cores a usar para linhas. O padrões é ``'#000000'``
ru_ru: **linecolor** (str): Цвет линий ``'#000000'``
ta_in: ** linecolor ** (str): வரிகளுக்கு பயன்படுத்த வேண்டிய வண்ண குறியீடு. இயல்புநிலை `` '# 000000'``
tr: **çizgi rengi** (str): Çizgiler için kullanılacak renk kodu. Varsayılan değeri ``'#000000'``

source: **creglinecolor** (str): The color code to use for classical register lines ``'#778899'``
bn_bn: **ক্রেগ পংক্তির রঙ** (str): ``'#778899'`` রঙের কোডটি ধ্রুপদী রেজিস্টার পংক্তিগুলির জন্য ব্যবহার করা হয়।
es_un: ** creglinecolor** (str): El código de color a utiliza para las líneas del los registros clásicos ``'#778899'``
id_id: ** creglinecolor** (str): Kode warna yang digunakan untuk baris register klasik ` ` '#778899' ` `
it: **creglinecolor** (str): codice colore da utilizzare per le righe dei registri classici ``'#778899'``
ja: **creglinecolor** (str): 古典レジスタの線に使用するカラー・コード。デフォルトは ``'#778899'`` 。
ko: **creglinecolor** (str): 고전 레지스트에 사용할 색상코드는 ``'#778899'`` 이다.
pt_un: **creglinecolor** (str): O código de cores a ser usado para as linhas clássicas de registro ``'#778899'``
ru_ru: **creglinecolor** (str): Цвет линий классического регистра ``'#778899'``
ta_in: ** creglinecolor ** (str): கிளாசிக்கல் பதிவு வரிகளுக்கு பயன்படுத்த வண்ண குறியீடு `` '# 778899'``
tr: **creglinecolor** (str): Klasik yazmaç çizgileri için kullanılacak renk kodu ``'#778899'``

source: **gatetextcolor** (str): The color code to use for gate text ``'#000000'``
bn_bn: **গেট পাঠ্যের রঙ** (str): ``'#000000'`` রঙের কোডটি গেট পাঠ্যের জন্য ব্যবহার করা হয়।
es_un: ** gatetextcolor** (str): El código de color a utilizar para el texto de las compuertas ``'#000000'``
id_id: ** gatetextcolor** (str): Kode warna untuk digunakan untuk teks gerbang ` ` '#000000' ` `
it: ** gatetextcolor ** (str): codice colore da utilizzare per il testo nei gate ``'#000000'``
ja: **gatetextcolor** (str): ゲート・テキストのカラーコード。デフォルトは ``'#000000'`` 。
ko: **gatetextcolor** (str): 게이트 텍스트에 사용할 색상코드는 ``'#000000'`` 이다.
pt_un: **gatetextcolor** (str): O código de cores a ser usado no texto do gate ``'#000000'``
ru_ru: **gatetextcolor** (str): Цвет текста внутри вентилей ``'#000000'``
ta_in: ** gatetextcolor ** (str): கேட் உரைக்கு பயன்படுத்த வேண்டிய வண்ண குறியீடு `` '# 000000'``
tr: **kapı metin rengi** (str): Kapı metni için kullanılacak renk kodu ``'#000000'``

source: **gatefacecolor** (str): The color code to use for gates. Defaults to ``'#ffffff'``
bn_bn: **গেট মুখের রঙ** (str): গেটের জন্য যে রঙের কোডটি ব্যবহার করা হয়। ``'#ffffff'`` পূর্ণ নির্ধারিত।
es_un: **gatefacecolor** (str): El código de color a utilizar para las compuertas. El valor predeterminado es ``'#ffffff'``
id_id: ** gatefacecolor** (str): Kode warna yang digunakan untuk gerbang. Default-nya: ` ` '#ffffff' ` `
it: **gatefacecolor** (str): codice colore da utilizzare per i gate. Il valore predefinito è ``'#ffffff'``
ja: **gatefacecolor** (str): ゲートのために使用するカラー・コード。デフォルトは ``'#ffffff'`` 。
ko: **gatefacecolor** (str): 게이트에 사용할 색상코드 기본설정은 ``'#ffffff'`` 이다.
pt_un: **gatefacecolor** (str): O código de cores a ser usado para gates. O padrão é ``'#ffffff'``
ru_ru: **gatefacecolor** (str): Цвет вентилей ``'#ffffff'``
ta_in: ** gatefacecolor ** (str): வாயில்களுக்கு பயன்படுத்த வேண்டிய வண்ண குறியீடு. இயல்புநிலை `` '# ffffff'``
tr: **gatefacecolor** (str): Kapılar için kullanılacak renk kodu. Varsayılan değeri ``'#ffffff'``

source: **barrierfacecolor** (str): The color code to use for barriers. Defaults to ``'#bdbdbd'``
bn_bn: **অন্তরায় মুখের রঙ** (str): অন্তরায়ের জন্য যে রঙের কোডটি ব্যবহার করা হয়। ``'#bdbdbd'`` পূর্ণ নির্ধারিত।
es_un: **barrierfacecolor** (str): El código de color a usar para las barreras. El valor predeterminado es ``'#bdbdbd'``
id_id: ** barrierfacecolor** (str): Kode warna untuk digunakan untuk hambatan. Default-nya: ` ` '#bdbdbd' ` `
it: **barrierfacecolor** (str): codice colore da utilizzare per le barriere. L'impostazione predefinita è ``'#bdbdbd'``
ja: **barrierfacecolor** (str): バリアーのために使用するカラーコード。デフォルトは ``'#bdbdbd'`` になる。
ko: **barrierfacecolor** (str): 배리어(Barriers) 에 사용할 색상코드 기본설정은 ``'#bdbdbd'`` 이다.
pt_un: **barrierfacecolorr** (str): O código de cores a ser usado para barreiras. O padrão é ``'#bdbdbd'``
ru_ru: **barrierfacecolor** (str): Цвет разделителей ``'#bdbdbd'``
ta_in: ** barrierfacecolor ** (str): தடைகளுக்கு பயன்படுத்த வண்ண குறியீடு. இயல்புநிலை `` '# bdbdbd'``
tr: **barrierfacecolor** (str): Bariyerler için kullanılacak renk kodu. Varsayılan değeri ``'#bdbdbd'``

source: **backgroundcolor** (str): The color code to use for the background. Defaults to ``'#ffffff'``
bn_bn: **পটভূমির রঙ** (str): পটভূমির জন্য যে রঙের কোডটি ব্যবহার করা হয়। ``'#ffffff'`` পূর্ণ নির্ধারিত।
es_un: **backgroundcolor** (str): El código de color a utilizar para el fondo. El valor predeterminado es ``'#ffffff'``
id_id: ** gatefacecolor** (str): Kode warna ini digunakan untuk latar belakang. Default-nya: ` ` '#ffffff' ` `
it: **backgroundcolor** (str): il codice colore da utilizzare per lo sfondo. L'impostazione predefinita è ``'#ffffff'``
ja: **backgroundcolor** (str): 背景のために使用するカラーコード。デフォルトは ``'#ffffff'`` になる。
ko: **backgroundcolor** (str): 배경에 사용할 색상코드 기본설정은 ``'#ffffff'`` 이다.
pt_un: **backgroundcolor** (str): O código de cores a ser usado no plano de fundo. O padrão é ``'#ffffff'``
ru_ru: **backgroundcolor** (str): Фоновый цвет ``'#ffffff'``
ta_in: ** backgroundcolor ** (str): பின்னணிக்கு பயன்படுத்த வேண்டிய வண்ண குறியீடு. இயல்புநிலை `` '# ffffff'``
tr: **backgroundcolor** (str): Arka plan için kullanılacak renk kodu. Varsayılan değeri ``'#ffffff'``

source: **fontsize** (int): The font size to use for text. Defaults to 13
bn_bn: **অক্ষরের আকার** (int): পাঠ্যের জন্য যে অক্ষরের আকারটি ব্যবহার করা হয়। পূর্ণ নির্ধারিত মান হল ১৩।
es_un: **fontsize** (int): El tamaño de fuente a utilizar para el texto. El valor predeterminado es 13
id_id: ** fontsize** (int): Ukuran font yang digunakan untuk teks. Default-nya di 13
it: **fontsize** (int): dimensione del carattere da utilizzare per il testo. L'impostazione predefinita è 13
ja: **fontsize** (int): テキストのフォント・サイズ。デフォルトは13。
ko: **fontsize** (int): 텍스트의 글씨 크기 기본값은 13이다.
pt_un: **fontsize** (int): O tamanho da fonte a ser usado para o texto. O padrão é 13
ru_ru: **fontsize** (int): Кегль (размер) основного текста 13
ta_in: **fontsize** (int): உரைக்கு பயன்படுத்த வேண்டிய எழுத்துரு அளவு. இயல்புநிலை 13 க்கு
tr: **fontsize** (inç): Metin için kullanılacak yazı tipi boyutu. Varsayılan değer 13'tür

source: **subfontsize** (int): The font size to use for subtext. Defaults to 8
bn_bn: **উপঅক্ষরের আকার** (int): উপপাঠ্যের জন্য যে অক্ষরের আকারটি ব্যবহার করা হয়। পূর্ণ নির্ধারিত মান হল ৮।
es_un: **subfontsize** (int): El tamaño de fuente a utilizar para el subtexto. El valor predeterminado es 8
id_id: ** fontsize** (int): Ukuran font yang digunakan untuk subteks. Default-nya di 8
it: **subfontsize** (int): La dimensione del carattere da utilizzare per il sottotesto. L'impostazione predefinita è 8
ja: **subfontsize** (int): サブテキストのフォント・サイズ。デフォルトは8。
ko: **subfontsize** (int): 서브텍스트의 글씨 크기 기본값은 8이다.
pt_un: **subfontsize** (int): O tamanho da fonte a ser usado para subtexto. O padrão é 8
ru_ru: **subfontsize** (int): Кегль подтекста 8
ta_in: **subfontsize** (int): துணை உரைக்கு பயன்படுத்த வேண்டிய எழுத்துரு அளவு. இயல்புநிலை 8 க்கு
tr: **subfontsize** (int): Alt metin için kullanılacak yazı tipi boyutu. Varsayılan değer 8

source: **displaytext** (dict): A dictionary of the text to use for each element type in the output visualization. The default values are:
bn_bn: **displaytext** (dict): আউটপুট ভিজুয়ালাইজেশনে প্রত্যেক রকম উপাদান ব্যবহারের জন্য পাঠ্যের একটি ডিকশনারি। ডিফল্ট মানগুলি হ'ল:
es_un: **displaytext** (dict): Un diccionario del texto a utilizar para cada tipo de elemento en la visualización de salida. Los valores predeterminados son:
id_id: ** displaytext** (dict): Sebuah kamus dari teks yang akan digunakan untuk setiap tipe elemen dalam visualisasi keluaran. Nilai default adalah:
it: **displaytext** (dict): Un dizionario contenente il testo da utilizzare per ogni tipo di elemento nella visualizzazione dell'output. I valori predefiniti sono:
ja: **displaytext** (dict): 可視化の出力において、個々の要素タイプで使われるテキスト辞書。デフォルト値は以下のとおり:
ko: **displaytext** (dict): 출력 시각화의 각 요소 유형에 사용할 딕셔너리. 기본값들은 다음과 같다.
pt_un: **displaytext** (dit): Um dicionário do texto a ser usado para cada tipo de elemento na visualização de saída. Os valores padrão são:
ru_ru: **displaytext** (dict): Словарь отображаемых элементов. По умолчанию:
ta_in: ** displaytext ** (dict): வெளியீட்டு காட்சிப்படுத்தலில் ஒவ்வொரு உறுப்பு வகைக்கும் பயன்படுத்த உரையின் அகராதி. இயல்புநிலை மதிப்புகள்:
tr: **displaytext** (dict): Çıktı görselleştirmesinde her bir öğe türü için kullanılacak metnin sözlüğü. Varsayılan değerler:

source: You must specify all the necessary values if using this. There is no provision for an incomplete dict passed in.
bn_bn: এটি ব্যবহার করা হলে আপনাকে অবশ্যই সমস্ত প্রয়োজনীয় মান নির্দিষ্ট করতে হবে। অসম্পূর্ণ ডিকশনারিটি (অভিধানটি) পাস করার কোনো ব্যবস্থা নেই।
es_un: Debes especificar todos los valores necesarios si se utiliza esto. Un diccionario incompleto no está previsto.
id_id: Anda harus menentukan semua nilai yang diperlukan jika menggunakan ini. Tidak ada ketentuan untuk larangan yang tidak lengkap yang disahkan.
it: È necessario specificare tutti i valori necessari se lo si utilizza. Un dizionario incompleto non è previsto.
ja: これを使用する場合は、必要な値をすべて指定する必要があります。 不完全な辞書を渡すことはできません。
ko: 이를 사용하게 될 경우, 요구되는 모든 값을 명시해야 한다. 불완전한 딕셔너리를 넘겨받았을 경우에 대한 규칙은 존재하지 않는다.
pt_un: Você deve especificar todos os valores necessários se estiver usando isso. Não há nenhum provisionamento quando passado um dicionário incompleto.
ru_ru: При использовании этой опции необходимо определить все значения. Неполное задание словаря не предусмотрено.
ta_in: இதைப் பயன்படுத்தினால் தேவையான அனைத்து மதிப்புகளையும் நீங்கள் குறிப்பிட வேண்டும். நிறைவேற்றப்பட்ட முழுமையற்ற கட்டளைக்கு எந்த ஏற்பாடும் இல்லை.
tr: Bunu kullanıyorsanız, gerekli tüm değerleri belirtmeniz gerekir. İletilen eksik bir dict için herhangi bir önlem yoktur.

source: **displaycolor** (dict): The color codes to use for each circuit element. By default, all values default to the value of ``gatefacecolor`` and the keys are the same as ``displaytext``. Also, just like ``displaytext``, there is no provision for an incomplete dict passed in.
bn_bn: **displaycolor** (dict): প্রতিটি বর্তনী (সার্কিট) উপাদানের জন্য ব্যবহারযোগ্য রঙের কোড। ডিফল্টরূপে, ``gatefacecolor`` এর সমস্ত ডিফল্ট মান এবং কী গুলি ``displaytext`` এর সমান। এছাড়াও, ঠিক ``displaytext`` এর মতো, এখানে অসম্পূর্ণ dict পাসের কোনও ব্যবস্থা নেই।
es_un: **displaycolor** (dict): Los códigos de color a utilizar para cada elemento del circuito. Por default, todos los valores predeterminados coinciden con el valor de ``gatefacecolor`` y las palabras clave son las mismas de ``displaytext``. Al igual que con ``displaytext`` un diccionario incompleto no está provisto.
id_id: ** displaycolor** (dict): Kode warna yangdigunakan untuk setiap elemen sirkuit. Secara dasar, semua nilai defaulr ke nilai dari ` ` gatefacecolor ` ` dan kunci-kunci-kuncinya sama dengan ` ` displaytext ` `. Juga, sama seperti ` ` displaytext ` `, tidak ada ketentuan untuk suatu larangan yang tidak lengkap yang disahkan.
it: ** displaycolor ** (dict): I codici colore da utilizzare per ogni elemento del circuito. Per impostazione predefinita, tutti i valori predefiniti sono quelli di ``gatefacecolor`` e le parole chiave sono le stesse di ``displaytext``. Inoltre, come con ``displaytext``, un dizionario incompleto non è previsto.
ja: **displaycolor** (dict): 各回路の要素に利用されるカラーコード。デフォルトでは、値は ``gatefacecolor`` のデフォルト値、キーは ``displaytext`` と同じになります。 ``displaytext`` と同様に、不完全な辞書を渡すことはできません。
ko: **displaycolor** (dict): 각 회로 요소에 사용할 색상 코드. 기본적으로 모든 값은 ``gatefacecolor`` 의 값을 사용하며, 키는 ``displaytext`` 에 해당한다. 또한, ``displaytext`` 와 동일하게, 불완전한 딕셔너리가 넘겨졌을 경우에 대한 규칙은 존재하지 않는다.
pt_un: **displaycolor** (ditado): Os códigos das cores a serem usados para cada elemento do circuito. Por padrão, todos os valores padrão para o valor de ``gatefaclabelor`` e as chaves são as mesmas que ``displaytext``. Além disso, tal como ``displaytext``, não há nenhum provisionamento quando passado um dicionário incompleto.
ru_ru: **displaycolor** (dict): Цветовой словарь элементов цепи. По умолчанию значения совпадают с ``gatefacecolor`` и ``displaytext``. Как и в предыдущем случае, словарь необходимо определить целиком.
ta_in: **displaycolor** (dict): ஒவ்வொரு சுற்று உறுப்புக்கும் பயன்படுத்த வேண்டிய வண்ண குறியீடுகள். இயல்பாக, எல்லா மதிப்புகளும் இயல்புநிலையாக `` gatefacecolor`` மற்றும் விசைகள் `` displaytext`` க்கு சமம். மேலும், ``displaytext`` போலவே, முழுமையடையாத ஆணையை நிறைவேற்றுவதற்கான ஏற்பாடுகளும் இல்லை.
tr: **displaycolor** (dict): Her devre elemanı için kullanılacak renk kodları. Aksi belirtilmediği takdirde, tüm değerler varsayılan olarak ``gatefacecolor`` değerine ayarlanır ve tuşlar ``displaytext`` ile aynıdır. Ayrıca, tıpkı ``displaytext`` gibi, eksik bir dict için herhangi bir hüküm yoktur.
