Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/03_advanced_circuit_visualization.po
Languages: bn_bn, es_un, id_id, it, ja, ko, pt_un, ru_ru, ta_in, tr

source: By default, the ``draw()`` method returns the rendered image as an object and does not output anything. The exact class returned depends on the output specified: ``'text'`` (the default) returns a ``TextDrawer`` object, ``'mpl'`` returns a ``matplotlib.Figure`` object, and ``latex`` returns a ``PIL.Image`` object. Having the return types enables modifying or directly interacting with the rendered output from the drawers. Jupyter notebooks understand these return types and render them for us in this tutorial, but when running outside of Jupyter, you do not have this feature automatically. However, the ``draw()`` method has optional arguments to display or save the output. When specified, the ``filename`` kwarg takes a path to which it saves the rendered output. Alternatively, if you’re using the ``mpl`` or ``latex`` outputs, you can leverage the ``interactive`` kwarg to open the image in a new window (this will not always work from within a notebook but will be demonstrated anyway).
pt_un: Por padrão, o método ``draw()`` retorna a imagem renderizada como um objeto e não produz nada. A classe exata retornada depende da saída especificada: ``'text'`` (o padrão) retorna um objeto ``TextDrawer``, ``'mpl'`` retorna um objeto ``matplotlib.Figure`` e ` `latex`` retorna um objeto ``PIL.Image``. Ter os tipos de retorno permite modificar ou interagir diretamente com a saída renderizada das gavetas. Os notebooks Jupyter entendem esses tipos de retorno e os renderizam para nós neste tutorial, mas ao executar fora do Jupyter, você não tem esse recurso automaticamente. No entanto, o método ``draw()`` possui argumentos opcionais para exibir ou salvar a saída. Quando especificado, o kwarg ``filename`` pega um caminho no qual ele salva a saída renderizada. Alternativamente, se você estiver usando as saídas ``mpl`` ou ``latex``, você pode aproveitar o kwarg ``interactive`` para abrir a imagem em uma nova janela (isso nem sempre funcionará dentro de um notebook, mas será demonstrado de qualquer maneira).
ru_ru: По умолчанию метод ``draw()`` просто возвращает нарисованную схему как объект, класс которого зависит от типа вывода: ``TextDrawer`` для ``'text'`` (по умолчанию), ``matplotlib.Figure`` для ``'mpl'`` и ``PIL.Image`` для ``latex``. Эти типы позволяют изменять или напрямую взаимодействовать с полученным изображением. Блокноты Jupyter могут их распознать, как например в данном руководстве, однако вне Jupyter это не происходит автоматически. Метод ``draw()`` содержит необязательные аргументы для настроек отображения или сохранения вывода. Путь, куда будет сохранен файл, задается по ключу ``filename``, а при выводе ``mpl`` и ``latex``, можно использовать ключ ``interactive``, чтобы открыть изображение в новом окне (может не сработать при работе в блокноте, но в любом случае отобразит схему).
