Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/04_transpiler_passes_and_passmanager.po
Languages: bn_bn, es_un, fr, id, it_it, ja, ko_kr, pt_un, ru_ru, ta_in, tr_tr

source: Now map this to the 20-qubit Tokyo device, with different optimization levels:
bn_bn: এটাকে এবার ২০- কিউবিটসম্পন্ন টোকিও যন্ত্রে আলাদা আলাদা অনুকূলিতকরণ মানে নকশায়িতো করা হলো:
es_un: Ahora mapeamos esto al dispositivo Tokyo de 20-qubits, con diferentes niveles de optimización:
fr: A présent, voici ce que donnerait la transpilation sur la plateforme "Tokyo" de 20 qubit, avec les différents niveaux d'optimisation :
id: Sekarang, petakan ini ke perangkat 20-qubit Tokyo, dengan tingkat optimasi berbeda:
it_it: Ora andiamo a mappare il circuito sul device Tokyo a 20 qubit, utilizzando i diversi livelli di ottimizzazione:
ja: では、これを異なる最適化レベルで20量子ビットの Tokyo デバイスにマップします。
ko_kr: 이제 이를 서로 다른 최적화 레벨을 사용하여 20-큐비트 Tokyo 디바이스에 맵핑하시오.
pt_un: Agora, mapeie isto para o servidor de 20-qubit chamado Tokyo, com um nível de otimização diferente:
ru_ru: Отправим цепь на 20-кубитное устройство Tokyo, пробуя разные уровни оптимизации:
ta_in: இப்போது இதை 20-குவிட் டோக்கியோ சாதனத்தில் வரைபடமாக்குங்கள், வெவ்வேறு தேர்வுமுறை நிலைகளுடன்:
tr_tr: Şimdi bunu 20-kübitli Tokyo cihazı ile farklı optimizasyon seviyelerinde eşleştirelim:

source: Introducing the DAG
bn_bn: ডিএজি (DAG) এর পরিচিতি
es_un: Introducción al DAG
fr: Introduction au GAD (Graphe Acyclique Direct)
id: Memperkenalkan DAG
it_it: Introduzione al DAG
ja: DAGの紹介
ko_kr: DAG 소개
pt_un: Apresentando o DAG
ru_ru: Введение в ОАГ
ta_in: DAG ஐ அறிமுகப்படுத்துகிறது
tr_tr: DAG'nin tanıtılması

source: In Qiskit, we represent circuits internally using a Directed Acyclic Graph (DAG). The advantage of this representation over a pure list of gates (i.e., *netlist*) is that the flow of information between operations are explicit, making it easier for passes to make transformation decisions without changing the semantics of the circuit.
bn_bn: Qiskit -এর ভিতরে বর্তনীগুলোকে অচক্রাকার নির্দেশিত লেখচিত্র (ডিরেক্টেড অ্যাসাইক্লিক গ্রাফ বা ডিএজি) এর দ্বারা বোঝানো হয়। বর্তনীকে বিভিন্ন গেটের সমন্বয় ( *netlist* ) হিসেবে দেখানোর চেয়ে ডিএজি এর দ্বারা দেখানোর সুবিধা হলো তথ্যের গতিপথটা এর ক্ষেত্রে স্পষ্ট, ফলে ছারপত্রগুলো বর্তনীর কাজ/ফলাফল/অর্থ না বদলে সহজেই রূপান্তর করতে পারে।
es_un: En Qiskit representamos a los circuitos internamente usando Grafos Acíclicos Dirigidos (Directed Acyclic Graph, DAG). La ventaja de esta representación sobre una lista pura de compuertas (es decir, *netlist*) es que el flujo de información entre operaciones es explícito, lo que facilita que los pases tomen decisiones de transformación sin cambiar la semántica del circuito.
fr: Dans Qiskit, la représentation interne des circuit se fait en utilisant un Graphe Acyclique Direct (GAD). Par rapport à une liste de portes (netlist), cette représentation a l'avantage de rendre explicite le flot d'information entre les opérations, ce qui rend les décisions de transformation plus faciles pour les passes, sans changer la signification du circuit.
id: Di Qiskit, kami merepresentasikan internal sirkuit memakai Grafik Asiklik Terarah (DAG). Kelebihan dari representasi ini dibanding dengan daftar gerbang secara murni (i.e., *netlist*) adalah aliran informasi antara operasi menjadi eksplisit sehingga mempermudah pass untuk membuat keputusan mentransformasi tanpa mengubah semantik sirkuit.
it_it: In Qiskit, i circuiti sono internamente rappresentati utilizzando un Directed Acyclic Graph (DAG). Il vantaggio di questa rappresentazione rispetto ad una lista di gate (ovvero *netlist*) è che il flusso di informazioni tra le operazioni è esplicito, e questo rende più semplice alle pass decidere come applicare le trasformazioni senza modificare le semantiche del circuito.
ja: Qiskit では、回路の表現として有向非巡回グラフ( Directed Acyclic Graph - DAG) を内部的に使用しています。純粋なゲートのリスト（つまり *netlist* ) に比べてこの表現の利点は、操作間の情報のフローが明示的になり、回路のセマンティックを変更することなくパスが変換の決定をするのにより容易である点です。
ko_kr: 키스킷에서는 DAG (Directed Acyclic Graph)를 사용하여 내부적으로 회로를 나타낸다. 순수한 게이트 목록 (예: * netlist *)에 비하여 이와 같은 표현의 장점은 작업 간의 정보 흐름이 명시적이므로 패스가 회로의 의미를 변경하지 않고 변환 결정을 쉽게 내릴 수 있다는 것이다.
pt_un: No Qiskit, representamos circuitos, internamente, usando um Gráfico Acíclico Direcionado (DAG). A vantagem desta representação sobre uma lista pura de portões (ou seja, *netlist*) é que, o fluxo de informações, entre as operações, são explícitas, tornando mais fácil para os passes tomarem decisões de transformação, sem alterar a semântica do circuito.
ru_ru: Внутри Qiskit мы представляем цепи в виде ориентированного ациклического графа (ОАГ). В отличие от простого перечисления вентилей, такая сетевая схема (*список соединений*) явно отображает поток информации между операциями, позволяя упростить форму цепи без изменения ее содержания.
ta_in: Qiskit ட்டில், திசைக்கப்பட்ட அசைக்ளிக் வரைபடம் (DAG) பயன்படுத்தி உள்நாட்டில் சுற்றுகளை பிரதிநிதித்துவப்படுத்துகிறோம். வாயில்களின் தூய்மையான பட்டியலில் (அதாவது, * netlist *) இந்த பிரதிநிதித்துவத்தின் நன்மை என்னவென்றால், செயல்பாடுகளுக்கு இடையிலான தகவல்களின் ஓட்டம் வெளிப்படையானது, இது சுற்றுகளின் சொற்பொருளை மாற்றாமல் மாற்ற முடிவுகளை எடுக்க பாஸ்களை எளிதாக்குகிறது.
tr_tr: Qiskit'te, devreleri bir Yönlendirilmiş Asiklik Grafı(DAG) kullanarak dahili olarak temsil ediyoruz. Bu gösterimin saf bir kapı listesine (yani, *netlist*) göre avantajı, işlemler arasındaki bilgi akışının açık olması ve geçişlerin devrenin anlamını değiştirmeden dönüşüm kararları almasını kolaylaştırmasıdır.

source: Let’s start by building a simple circuit, and examining its DAG.
bn_bn: একটা সহজ বর্তনী (সার্কিট) বানিয়ে তার ডিএজি পরীক্ষা করা যাক।
es_un: Empecemos por construir un circuito simple y examinar su DAG.
fr: Commençons par construire un circuit simple, et examinons son GAD.
it_it: Iniziamo costruendo un semplice circuito ed esaminando il suo DAG.
ko_kr: 간단한 회로를 구축하고 DAG를 살펴보겠다.
ru_ru: Начнем с создания простой цепи и изучения ее ОАГ.
ta_in: எளிமையான சுற்று ஒன்றை உருவாக்கி, அதன் DAG ஐ ஆராய்வதன் மூலம் ஆரம்பிக்கலாம்.
tr_tr: Basit bir devre kurarak ve DAG'ı inceleyerek başlayalım.

source: In the DAG, there are three kinds of graph nodes: qubit/clbit input nodes (green), operation nodes (blue), and output nodes (red). Each edge indicates data flow (or dependency) between two nodes.
bn_bn: ডিএজিতে তিন রঙের লেখচিত্রের নোড দেখা যায়: কিউবিট/সিএলবিট ইনপুট নোড (সবুজ), গণনার নোড (নীল) এবং ফলাফল নোড (লাল). এক নোড থেকে অন্য নোড-এ তীরচিহ্নগুলো তথ্য প্রবাহের দিক (বা নির্ভরশীলতার দিক) নির্দেশ করে।
es_un: En el DAG, hay tres tipos de nodos de grafos: nodos de entrada de qubit/clbit (verde), nodos de operación (azul) y nodos de salida (rojo). Cada borde indica el flujo de datos (o dependencia) entre dos nodos.
fr: Dans le GAD, il y a trois types de noeuds différents : les qubits/cbits (en vert), les opérations (en bleu) et les sorties (en rouge). Chaque arête indique le flot (ou la dépendance) entre deux noeuds. (note: on utilise l'acronyme en anglais **dag** dans le code suivant).
id: Di DAG, terdapat tiga jenis simpul: simpul masukan qubit/clbit (hijau), simpul operasi (biru), dan simpul keluaran (merah). Setiap tepi mengindikasikan aliran data (atau keterkaitan) antar dua simpul.
it_it: Nel DAG, ci sono tre tipi di rappresentazione grafica dei nodi: i nodi di input dei qubit/clbit (in verde), i nodi che rappresentano operazioni (in blu), e i nodi di output (in rosso). Ogni collegamento indica il flusso di dati (o dipendenza) tra due nodi.
ja: DAGには、３種類のグラフノードがあります：qubit/clbit インプットノード(緑)、操作ノード(青)、及びアウトプットノード(赤) です。各エッジはノード間のデータの流れ(もしくは依存性) を示しています。
ko_kr: DAG에는 세 가지 종류의 그래프 노드가 있다: qubit/clbit 입력 노드 (녹색), 연산 노드 (파란색), 출력 노드 (빨간색). 각 엣지(edge) 는 두 노드 간의 데이터 흐름 (또는 종속성) 을 나타낸다.
pt_un: No DAG, existem três tipos de vértices do gráfico: vértices de entrada do qubit/clbit (verde), vértices de operação (azul) e vértices de saída (vermelho). Cada aresta indica fluxo de dados (ou dependência) entre dois vértices.
ru_ru: В ОАГ существуют три вида узлов: вход бита или кубита (зеленые), операция (синие) и выход (красные). Каждое ребро отвечает передаче данных (или зависимости) между двумя вершинами.
ta_in: DAG இல், மூன்று வகையான வரைபட முனைகள் உள்ளன: குவிட் / கிளிபிட் உள்ளீட்டு முனைகள் (பச்சை), செயல்பாட்டு முனைகள் (நீலம்) மற்றும் வெளியீட்டு முனைகள் (சிவப்பு). ஒவ்வொரு விளிம்பும் இரண்டு முனைகளுக்கு இடையில் தரவு ஓட்டத்தை (அல்லது சார்பு) குறிக்கிறது.
tr_tr: DAG'da üç çeşit grafik düğümü vardır: kübit/clbit giriş düğümleri (yeşil), işlem düğümleri (mavi) ve çıkış düğümleri (kırmızı). Her kenar, iki düğüm arasındaki veri akışını (veya bağımlılığını) gösterir.

source: Therefore, writing a transpiler pass means using Qiskit’s DAGCircuit API to analyze or transform the circuit. Let’s see some examples of this.
bn_bn: অর্থাৎ, ট্রান্সপাইলার পাস লেখার মানে Qiskit -এর DAGCircuit এপিআই এর দ্বারা বর্তনীর (সার্কিট) বিশ্লেষণ বা পরিবর্তন করা। এর কিছু উদাহরণ দেখা যাক।
es_un: Por lo tanto, escribir un pase al transpilador significa utilizar la API DAGCircuit de Qiskit para analizar o transformar el circuito. Veamos algunos ejemplos de esto.
fr: Ainsi, l'écriture d'une passe de transpilation implique que l'on utilise l'API DAGCircuit de Qiskit afin d'analyser ou transformer le circuit. Voyons des exemples.
it_it: Quindi, scrivere una transpiler pass vuol dire utilizzare l'API DAGCircuit di Qiskit per analizzare o trasformare il circuito. Vediamo qualche esempio.
ko_kr: 따라서 트랜스파일러 패스를 작성한다는 것은 키스킷의 DAGCircuit API를 사용하여 회로를 분석하거나 변환하는 것을 의미한다. 이에 대한 몇 가지 예시들을 살펴보자.
ru_ru: Таким образом, создание прохода транспайлера подразумевает использование API DAGCircuit для анализа или преобразования цепи. Рассмотрим некоторые примеры.
ta_in: எனவே, டிரான்ஸ்பைலர் பாஸை எழுதுவது என்பது சுற்று பகுப்பாய்வு செய்ய அல்லது மாற்றுவதற்கு Qiskit's DAGCircuit API ஐப் பயன்படுத்துவதாகும். இதற்கு சில எடுத்துக்காட்டுகளைப் பார்ப்போம்.
tr_tr: Bu nedenle, bir aktarııc geçişi yazmak, devreyi analiz etmek veya dönüştürmek için Qiskit'in DAGCircuit API'sini kullanmak anlamına gelir. Bunun bazı örneklerini görelim.

source: **a. Get all op nodes in the DAG:**
bn_bn: ** ক. সব চালু নোডগুলোকে ডিএজি তে আনা হলো: **
es_un: **a. Poner todos los nodos op en el DAG:**
fr: **a. Obtenir les noeuds opérationnels du GAD :**
id: **a. Dapatkan semua simpul op di DAG:**
it_it: **a. Ottenere tutti i nodi di operazioni presenti nel DAG:**
ja: **a. DAG中の全ての操作ノードを取得します:**
ko_kr: ** a. DAG의 모든 op 노드 가져오기: **
pt_un: **a. Obter todos os nós de operações no DAG:**
ru_ru: **a. Получение всех операционных вершин ОАГ:**
tr_tr: **a. DAG'daki tüm op düğümlerini alın:**

source: Each node is an instance of the ``DAGOpNode`` class. Let’s examine the information stored in the second op node.
es_un: Cada nodo es una instancia de la clase ``DAGOpNode``. Examinemos la información guardada en el segundo nodo op.
fr: Chaque noeud est une instance de la classe ``DAGOpNode``. Examinons les informations stockées dans le second nœud op.
ru_ru: Каждая вершина является экземпляром класса ``DAGOpNode``. Например во второй операционной вершине хранится следующая информация.

source: **b. Add an operation to the back:**
bn_bn: ** খ. পিছনে একটা কাজ যোগ করা হলো: **
es_un: **b. Añadir una operación a la parte trasera:**
fr: **b. Ajouter une opération à la fin : **
id: **b. Tambahkan operasi ke belakang:**
it_it: **b. Aggiungere un'operazione alla fine:**
ja: **b. 後ろに操作を追加します:**
ko_kr: ** b. 뒤에 연산 추가하기: **
pt_un: **b. Adicione um operador para a parte de trás:**
ru_ru: **b. Добавление операции в конец:**
tr_tr: **b. Arkaya bir işlem ekleyin:**

source: **c. Add an operation to the front:**
bn_bn: ** গ. সামনে একটা ক্রিয়াকলাপ যোগ করা: **
es_un: **c. Añadir una operación a la parte delantera:**
fr: **c. Ajouter une opération au début :**
it_it: **c. Aggiungere un'operazione all'inizio:**
ko_kr: ** c. 앞에 연산 추가하기: **
ru_ru: **c. Добавление операции в начало:**

source: **d. Substitute a node with a subcircuit:**
bn_bn: ** ঘ. একটি নোডের পরিপূরকরূপে একটা উপবর্তনীর (সাব সার্কিট) ব্যবহার: **
es_un: **d. Substituir un nodo con un subcircuito:**
fr: **d. Substituer un sous-circuit à un noeud :**
it_it: **d. Sostituire un nodo con un sotto circuito:**
ko_kr: ** d. 하위 회로를 사용하여 노드를 대체하기 **
ru_ru: **d. Замена вершины подцепью:**
tr_tr: **d. Bir düğümü bir alt devre ile değiştirin:**

source: Finally, after all transformations are complete, we can convert back to a regular QuantumCircuit object. This is what the transpiler does! It takes a circuit, operates on it in DAG form, and outputs a transformed circuit.
bn_bn: সব পরিবর্তন হয়ে যাওয়ার পর আমরা পুনরায় একটা QuantumCircuit জিনিসে রূপান্তর করতে পারি। এটাই ট্রান্সপাইলারের কাজ! এটা একটা বর্তনী নেয়, তার উপর ডিএজি অবস্থায় কাজ করে এবং ফলাফলরূপে একটা পরিবর্তিত বর্তনী দেয়।
es_un: Finalmente, después de que todas las transformaciones hayan sido completadas, podemos convertir de vuelta a un objeto QuantumCircuit. ¡Esto es lo que hace el transpilador! Toma un circuito, opera sobre el en su forma DAG, y regresa un circuito transformado.
fr: Finalement, après avoir effectué toutes ces transformations, on peut reconvertir le GAD en un objet de type QuantumCircuit. C'est ce que fait le transpileur ! Il prend un circuit, travaille dessus sous sa forme de GAD, et fournit comme résultat un circuit transformé.
id: Akhirnya, setelah semua transformasi selesai, kita dapat mengonversi balik ke objek QuantumCircuit reguler. Inilah yang dilakukan transpiler! Transpiler mengambil sirkuit, mengoperasikannya dalam bentuk DAG, dan mengeluarkan sirkuit yang tertransformasi.
it_it: Infine, dopo che tutte le trasformazioni sono complete, si può riconvertire ad un regolare oggetto QuantumCircuit. Questo è quello che fa il transpiler! A partire da un circuito, lavora sulla sua forma DAG e produce in output un circuito modificato.
ja: 最後に、全ての変換が完了した後に、通常の QuantumCircuit オブジェクトに戻すことができます。これがトランスパイラーが実施していることです！ 回路を受け取り、DAG 形式で操作し、変換した回路を出力します。
ko_kr: 마지막으로 모든 변환이 완료된 후에는 일반 QuantumCircuit 객체로 다시 변환할 수 있다. 이것이 트랜스파일러가 하는 일이다! 트랜스파일러는 회로를 취하고(take), DAG 형태로 작동하고(operate), 변환된 회로를 출력한다(output).
pt_un: Por fim, após todas as transformações serem completadas, podemos converter, de volta, para um objeto QuantumCircuit regular. Isto é o que o transpilador faz! Ele recebe um circuito, opera nele na forma DAG e fornece, como resultado, um circuito transformado.
ru_ru: В итоге после всех преобразований мы можем вернуться к обычному объекту QuantumCircuit. Именно это и делает транспайлер. Он берет цепь, работает с ней в формате ОАГ, а затем возвращает преобразованную цепь.
ta_in: இறுதியாக, அனைத்து மாற்றங்களும் முடிந்தபின், நாம் ஒரு வழக்கமான குவாண்டம் சர்க்யூட் பொருளுக்கு மாற்றலாம். டிரான்ஸ்பைலர் இதைத்தான் செய்கிறது! இது ஒரு சுற்று எடுத்து, DAG வடிவத்தில் இயங்குகிறது, மற்றும் மாற்றப்பட்ட சுற்று வெளியிடுகிறது.
tr_tr: Son olarak, tüm dönüşümler tamamlandıktan sonra, normal bir QuantumCircuit nesnesine geri dönüş yapabiliriz. Aktarıcının yaptığı iş budur! Bir devre alır, üzerinde DAG formunda çalışır ve çıktı olarak dönüştürülmüş bir devre verir.

source: Implementing a BasicMapper Pass
bn_bn: BasicMapper ছাড়পত্র বাস্তবায়ন(ইমপ্লিমেন্ট) করা
es_un: Implementación de un Pase BasicMapper
fr: Implémentation d'une passe BasicMapper
id: Menerapkan BasicMapper Pass
it_it: Implementazione di una Pass BasicMapper
ja: BasicMapper パスを実装してみる
ko_kr: BasicMapper 패스 구현
pt_un: Implementando um passe BasicMapper
ru_ru: Реализация прохода BasicMapper
ta_in: ஒரு அடிப்படை மேப்பர் பாஸை செயல்படுத்துகிறது
tr_tr: Bir BasicMapper Geçişinin uygulanması

source: Now that we are familiar with the DAG, let’s use it to write a transpiler pass. Here we will implement a basic pass for mapping an arbitrary circuit to a device with limited qubit connectivity. We call this the BasicMapper. This pass is included in Qiskit Terra as well.
bn_bn: এখন যেহেতু আমরা ডিএজি -এর ব্যাপারে জানি, এটা ব্যবহার করে একটা ট্রান্সপাইলার পাস লেখা যাক। এখানে আমরা একটা সাধারণ পাস বানাবো যেটা একটা বর্তনীকে একটা সীমিত কিউবিটের যন্ত্রের উপযোগী করবে। এটাকে আমরা BasicMapper বলি। Qiskit টেরা -তে এই পাসটি দেওয়া আছে।
es_un: Ahora que estamos familiarizados con el DAG, usémoslo para escribir un pase al transpilador. Aquí vamos a implementar un pase básico para mapear un circuito arbitrario a un dispositivo con conectividad de qubits limitada. Llamamos a esto un BasicMapper. Este pase también está incluido en Qiskit Terra.
fr: Maintenant que nous sommes familiers du principe du GAD, utilisons le pour construire une passe de transpilation. Ici nous allons implémenter une passe de base pour faire correspondre un circuit quelconque à une machine dont la connectivité entre les qubits est limitée. Ceci s'appelle le BasicMapper. Cette passe est également incluse dans Qiskit Terra.
it_it: Ora che siamo familiari con un DAG, utilizziamolo per scrivere una transpiler pass. Si andrà ad implementare una pass di base che effettua una mappatura di un circuito arbitrario su un dispositivo che ha limitata connettività tra qubit. Questo procedimento si chiama BasicMapper. Questo tipo di pass è anche inclusa in Qiskit Terra.
ko_kr: 이제 DAG에 대하여 익숙해졌으므로 이를 사용하여 트랜스파일러 패스를 작성해보겠다. 여기서는 큐비트 연결이 제한된 장치에 임의의 회로를 매핑하기 위한 기본 패스를 구현한다. 이것을 BasicMapper 라고 한다. 이 패스는 키스킷 테라에도 포함되어 있다.
ru_ru: Поскольку теперь мы знакомы с ОАГ, используем его для написания прохода транспайлера. Создадим базовое преобразование произвольной цепи для запуска на устройстве с ограниченным числом связей между кубитами. Такой проход называется BasicMapper и содержится в Qiskit Terra.
ta_in: இப்போது நாம் DAG உடன் தெரிந்திருக்கிறோம், ஒரு டிரான்ஸ்பைலர் பாஸை எழுத இதைப் பயன்படுத்தலாம். வரையறுக்கப்பட்ட குவிட் இணைப்பு கொண்ட சாதனத்திற்கு தன்னிச்சையான சுற்று வரைபடத்திற்கான அடிப்படை பாஸை இங்கே செயல்படுத்துவோம். இதை நாங்கள் பேசிக்மாப்பர் என்று அழைக்கிறோம். இந்த பாஸ் Qiskit டெர்ராவிலும் சேர்க்கப்பட்டுள்ளது.
tr_tr: Şimdi DAG'ı bildiğimize göre, bunu bir transpiler geçişi yazmak için kullanalım. Burada, sınırlı kübit bağlantısı olan bir cihaza keyfi bir devre eşlemek için temel bir geçiş yapacağız. Buna BasicMapper diyoruz. Bu geçiş Qiskit Terra'da da mevcuttur.

source: The first thing to do when writing a transpiler pass is to decide whether the pass class derives from a ``TransformationPass`` or ``AnalysisPass``. Transformation passes modify the circuit, while analysis passes only collect information about a circuit (to be used by other passes). Then, the ``run(dag)`` method is implemented, which does the main task. Finally, the pass is registered inside the ``qiskit.transpiler.passes`` module.
bn_bn: ট্রান্সপাইলার ছাড়পত্র লেখার সময় সবার আগে ঠিক করতে হবে এই ছারপত্রের ক্লাসটা কোন ক্লাস থেকে বানানো হবে: ``TransformationPass`` না ``AnalysisPass``। পরিবর্তনের ছাড়পত্রের দ্বারা বর্তনীতে পরিবর্তন করা যায়, যেখানে বিশ্লেষণ ছাড়পত্র একটা বর্তনী সম্পর্কে তথ্য জোগাড় করে অন্য ছাড়পত্রে ব্যবহারের জন্য। এরপর আসল কাজের জন্য ``run(dag)`` পদ্ধতি লেখা হয়। সবশেষে, ছাড়পত্রটিকে ``qiskit.transpiler.passes`` মডিউলে নথিভুক্ত করা হয়।
es_un: La primera cosa que hay que hacer al escribir un pase al transpilador es decidir si la clase del pase deriva de ``TransformationPass`` o ``AnalysisPass``. Los pases de transformación modifican el circuito, mientras que los pases de análisis solo recopilan información acerca de un circuito (para ser usada por otros pases). Luego, se implementa el método ``run(dag)``, que ejecuta la tarea principal. Finalmente, el pase se registra en el módulo ``qiskit.transpiler.passes``.
fr: Le premier choix à effectuer est de décider si le type de passe est du type TransformationPass ou du type AnalysisPass. Les passes de type transformation modifient le circuit, alors que les passes de type analyse ne font que collecter de l'information (qui pourra être utilisée par les autres passes). Puis la méthode run(dag) est appelée, elle exécute la tâche principale. Enfin la passe est enregistrée dans le module qiskit.transpiler.passes.
id: Yang pertama perlu dilakukan saat menulis pass transpiler adalah memutuskan apakah kelas pass diperoleh dari ``TransformationPass`` atau ``AnalysisPass``. Pass transformasi mengubah sirkuit sementara pass analisis hanya mengambil informasi dari sebuah sirkuit (untuk dipakai pass lainnya). Kemudian, metode ``run(dag)`` diterapkan, yang berfungsi untuk melakukan pekerjaan utama. Akhirnya, pass sudah teregistrasi dalam modul ``qiskit.transpiler.passes``.
it_it: La prima cosa da fare quando si scrive una transpiler pass è decidere se questa è di tipo ``TransformationPass`` o ``AnalysisPass``. Le pass di trasformazione modificano il circuito, mentre quelle di analisi raccolgono informazioni sul circuito (che verranno poi utilizzate da altre pass). Quindi viene implementato il metodo ``run(dag)`` che effettua il passaggio principale. Infine, la pass viene registrata nel modulo ``qiskit.transpiler.passes``.
ja: トランスパイラーパスを作成する時に最初にやらなければいけないことは、パスクラスを ``TransformationPass`` か ``AnalysisPass`` のどちらから派生させるかを決定することです。Transformationパス は回路を修正しますが、Analysisパス は回路の情報を収集する(のちに別のパスで利用される) のみです。次に、メインタスクとなる ``run(dag)`` メソッドを実装します。最後に、 ``qiskit.transpiler.passes`` モジュールの内部に登録させます。
pt_un: A primeira coisa a fazer, ao escrever um passe de transpilador, é decidir se a classe pass deriva de um ``TransformationPass`` ou ``AnalysisPass``. Passes de transformação modificam o circuito, enquanto passes de análise, apenas coletam informações sobre um circuito (para ser usado por outros passes). Em seguida, o método ``run (dag)`` é implementado, fazendo a tarefa principal. Por fim, o passe é registrado, dentro do módulo ``qiskit.transpiler.passes``.
ru_ru: Прежде всего нужно определиться, какой из классов,``TransformationPass`` или ``AnalysisPass``, мы будем использовать. Первый отвечает за преобразование цепи, в то время как второй только собирает о ней информацию (используемую другими проходами). Затем применяем метод ``run(dag)``, который и выполняет основную работу. В самом конце регистрируем проход в модуле ``qiskit.transpiler.passes``.
ta_in: டிரான்ஸ்பைலர் பாஸ் எழுதும் போது செய்ய வேண்டிய முதல் விஷயம், பாஸ் வகுப்பு ``TransformationPass`` அல்லது ``AnalysisPass`` என்பதிலிருந்து பெறப்பட்டதா என்பதை தீர்மானிக்க வேண்டும். உருமாற்ற பாஸ்கள் சுற்றுவட்டத்தை மாற்றியமைக்கின்றன, பகுப்பாய்வு பாஸ்கள் ஒரு சுற்று பற்றிய தகவல்களை மட்டுமே சேகரிக்கின்றன (பிற பாஸ்கள் பயன்படுத்த). பின்னர், ``run (dag)`` முறை செயல்படுத்தப்படுகிறது, இது முக்கிய பணியை செய்கிறது. இறுதியாக, பாஸ் ``qiskit.transpiler.passes`` தொகுதிக்குள் பதிவு செய்யப்பட்டுள்ளது.
tr_tr: Bir transpiler geçişi yazarken yapılacak ilk şey, geçiş sınıfının ``TransformationPass`` veya ``AnalysisPass`` dan türetilmiş olup olmadığına karar vermektir. Analiz geçişleri sadece bir devre (diğer geçişler tarafından kullanılacak) hakkında bilgi toplarken, dönüşüm geçişleri devreyi değiştirir. Ardından, ana görevi yapan ``run(dag)`` yöntemi uygulanır. Son olarak, geçiş ``qiskit.transpiler.passes`` modülüne kaydedilir.
