Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/04_transpiler_passes_and_passmanager.po
Languages: bn_bn, es_un, fr, id, it_it, ja, ko_kr, pt_un, ru_ru, ta_in, tr_tr

source: There can be passes that do the same job, but in different ways. For example, the ``TrivialLayout``, ``DenseLayout`` and ``NoiseAdaptiveLayout`` all choose a layout (binding of virtual qubits to physical qubits), but use different algorithms and objectives. Similarly, the ``BasicSwap``, ``LookaheadSwap`` and ``StochasticSwap`` all insert swaps to make the circuit compatible with the coupling map. The modularity of the transpiler allows plug-and-play replacements for each pass.
bn_bn: আলাদা আলাদা ছাড়পত্র একই কাজ আলাদা ভাবে করতে পারে। উদাহরণস্বরূপ, ``TrivialLayout``, ``DenseLayout`` এবং ``NoiseAdaptiveLayout`` তিনটেই একটা নকশা বেছে নেয় (কাল্পনিক কিউবিটকে বাস্তব কিউবিটে রূপান্তর করা), কিন্তু কিভাবে করে এবং করার পরের ফলাফল আলাদা। একইভাবে, ``BasicSwap``, ``LookaheadSwap`` এবং ``StochasticSwap`` সবাই বর্তনীকে, যুগ্মীকরণ মানচিত্রের (কাপলিং ম্যাপ) উপযুক্ত করার জন্য অদলবদল করে। ট্রান্সপাইলারের কাজকে ছোট করে ভাঙার ক্ষমতার (মডুলারিটি) সাহায্যে প্রতি ছারেই ছোট অদলবদল করা যায়।
es_un: Puede haber diferentes pases que hagan lo mismo, pero de diferente manera. Por ejemplo, los pases ``TrivialLayout``, ``DenseLayout`` y ``NoiseAdaptiveLayout`` escogen una disposición (enlace entre qubits virtuales a qubits físicos), pero usan diferentes algoritmos y objetivos. Similarmente, los pases ``BasicSwap``, ``LookaheadSwap`` y ``StochasticSwap`` insertan intercambios para hacer a los circuitos compatibles con un mapa de acoplamiento. La modularidad del transpilador permite hacer cambios a los pases y ejecutarlos fácilmente.
fr: Il peut se trouver des passes qui font la même chose, mais de manière différente. Par exemple : ``TrivialLayout``, ``DenseLayout`` et ``NoiseAdaptiveLayout`` permettent toutes de choisir un layout (relation entre les qubits virtuels et les qubits physiques), mais elles utilisent des algorithmes différents pour des objectifs différents. De même ``BasicSwap``, ``LookaheadSwap`` et ``StochasticSwap`` ont toutes pour effet d'insérer des swap (échanges) pour rendre un circuit compatible avec la carte de couplage. Le caractère modulaire du transpileur permet de faire des substitutions de ces passes.
id: Terdapat pass yang melakukan kerja yang sama, tetapi dengan cara yang berbeda. Contohnya, ``TrivialLayout``, ``DenseLayout`` dan ``NoiseAdaptiveLayout`` semua memilih satu susunan (pengikatan qubit virtual ke qubit fisik), tetapi memakai algoritma dan objektif yang berbeda. Demikian pula ``BasicSwap``, ``LookaheadSwap`` dan ``StochasticSwap``, semua menambahkan swap untuk membuat sirkuit cocok dengan coupling map. Modularitas dari transpilator memperbolehkan pasang-dan-pakai dalam penggantian setiap pass.
it_it: Potrebbero esistere pass che fanno lo stesso lavoro, ma in modi differenti. Per esempio, ``TrivialLayout``, ``DenseLayout`` e ``NoiseAdaptiveLayout`` scelgono tutte un layout (associazione di qubit vituali a qubit fisici) ma utilizzando algoritmi ed obiettivi diversi. Analogamente, ``BasicSwap``, ``LookaheadSwap`` e ``StochasticSwap`` inseriscono scambi per rendere un circuito compatibile con la coupling map. La modularità del transpiler permette sostituzioni plug-and-play per ogni pass.
ja: 同じジョブをこなすパスがあっても、その方法は様々です。例えば、 ``TrivialLayout`` 、 ``DenseLayout`` および ``NoiseAdaptiveLayout`` は、すべてレイアウト（物理量子ビットへの仮想量子ビットのバインド）の選択ですが、それぞれ異なるアルゴリズムや目的のために使います。同様に、 ``BasicSwap`` 、 ``LookaheadSwap`` および ``StochasticSwap`` は結合マップに適合するように swap を挿入して回路を作成します。トランスパイラーのモジュール性により、各パスをプラグアンドプレイで置き換えられます。
ko_kr: 동일한 기능을 제공하지만 다른 방법으로 구성되는 패스가 있을 수 있다. 예를 들어 ``TrivialLayout``, ``DenseLayout`` 과 ``NoiseAdaptiveLayout`` 은 모두 레이아웃(가상 큐비트를 물리적 큐비트에 바인딩) 을 선택하지만 다른 알고리즘과 목표를 사용한다. 마찬가지로 ```BasicSwap``, ``LookaheadSwap``, ``StochasticSwap`` 등도 회로가 커플링 맵과 호환되도록 스왑을 삽입한다. 트랜스파일러의 모듈화는 각 패스마다 플러그 앤 플레이 교체를 허용한다.
pt_un: Pode haver passes que façam o mesmo trabalho, mas de maneiras diferentes. Por exemplo, o ``TrivialLayout``, ``DenseLayout`` e ``NoiseAdaptiveLayout`` todos escolhem um layout (ligação de qubits virtuais para qubits físicos), mas usam algoritmos e objetivos diferentes. Da mesma forma, o ``BasicSwap``, ``LookaheadSwap`` e ``StochasticSwap`` todos fazem a inserção de swaps para tornar o circuito compatível com o mapa de acoplamento. A modularidade do transpilador permite reposicionamentos de plug-and-play para cada passe.
ru_ru: Одно и то же задание может быть выполнено разными способами. Например, ``TrivialLayout``, ``DenseLayout`` и``NoiseAdaptiveLayout`` задают компоновку (привязку виртуальных кубитов к физическим), используя при этом различные алгоритмы и цели. Аналогичным образом ``BasicSwap``, ``LookaheadSwap`` и ``StochasticSwap`` меняют состояния кубитов местами, делая цепь совместимой со схемой сопряжений конкретного устройства. Модулярность транспайлера позволяет делать быстрые замены каждого прохода.
ta_in: ஒரே வேலையைச் செய்யும் பாஸ்கள் இருக்கலாம், ஆனால் வெவ்வேறு வழிகளில். எடுத்துக்காட்டாக, ``TrivialLayout``, ``DenseLayout`` மற்றும் ``NoiseAdaptiveLayout`` அனைத்தும் ஒரு தளவமைப்பைத் தேர்வுசெய்கின்றன (மெய்நிகர் குவிட்டுகளை இயற்பியல் குவிட்டுகளுடன் பிணைத்தல்), ஆனால் வெவ்வேறு வழிமுறைகள் மற்றும் குறிக்கோள்களைப் பயன்படுத்துகின்றன. இதேபோல், ``BasicSwap``, ``LookaheadSwap`` மற்றும் ``StochasticSwap`` அனைத்தும் இணைக்கும் வரைபடத்துடன் சுற்றுக்கு இணக்கமாக மாற்றங்களைச் செருகும். டிரான்ஸ்பைலரின் மட்டுப்படுத்தல் ஒவ்வொரு பாஸிற்கும் செருகுநிரல் மற்றும் விளையாட்டு மாற்றுகளை அனுமதிக்கிறது.
tr_tr: Aynı işi fakat farklı yollarla yapan geçişler olabilir. Örneğin, ``TrivialLayout``, ``DenseLayout`` ve ``NoiseAdaptiveLayout`` hepsi farklı bir layout/yerleşim (sanal kubitlerin fiziksel kubitler bağlanması) seçer fakat farklı algoritmalar ve objeler kullanır. Benzer şekilde, ``BasicSwap``, ``LookaheadSwap`` ve ``StochasticSwap`` hepsi devreyi bağlantılı harita ile uyumlu hale getirmek için değişimler(swap) ekler. Transpiler modularitesi, her geçiş için tak ve çalıştır değiştirmelerine izin verir.

source: Below, we show the swapper passes all applied to the same circuit, to transform it to match a linear chain topology. You can see differences in performance, where the ``StochasticSwap`` is clearly the best. However, this can vary depending on the input circuit.
bn_bn: নিচে আমরা অদলবদলের ছারপত্রগুলো একটি বর্তনীতে প্রয়োগ করেছি, যাতে এটা রৈখিক শৃঙ্খল বিন্যাসে পরিবর্তিত হয়। এর থেকে পরিষ্কার যে ছাড়পত্রগুলোর কর্মক্ষমতা আলাদা আলাদা, যাদের মধ্যে ``StochasticSwap`` সবচেয়ে ভালো। যদিও ইনপুট বর্তনীর সাথে সাথে এই ফল বদলাতে পারে।
es_un: A continuación, mostramos todos los pases de intercambio aplicados a un mismo circuito, para transformarlo para que coincida con una topología de cadena lineal. Las diferencias en rendimiento son evidentes, donde ``StochasticSwap`` es claramente el mejor. Sin embargo, esto puede variar dependiendo del circuito de entrada.
fr: Ci-dessous nous montrons les passes de swap appliquées à un seul et même circuit pour le transformer en une topologie correspondant à une chaine linéaire. On peut voir que la performance la meilleure est atteinte lorsque ``StochasticSwap`` est utilisée. Mais ceci peut varier en fonction de votre circuit.
id: Di bawah, kami memperlihatkan swap dari pass yang diaplikasikan ke satu sirkuit yang sama, untuk mentransformasi sirkuit untuk mencocokkan topologi rantai linear. Anda dapat melihat perbedaan performa, di mana ``StochasticSwap`` jelas adalah yang terbaik. Tetapi, ini dapat bervariasi tergantung sirkuit inputan.
it_it: Di seguito mostriamo le swapper pass tutte applicate allo stesso circuito, per trasformarlo in modo da adattarsi ad una topologia a catena lineare. Si può notare una differenza nelle performance, dove la ``StochasticSwap`` è chiaramente la migliore. Tuttavia, questo può variare al variare del circuito di input.
ja: 以下では、swap パスを全て同じ回路、線形鎖トポロジーに適合するように変換しているもの、に適用したものを示しています。パフォーマンスに違いが見られ、明らかに ``StochasticSwap`` がベストです。しかしながら、入力回路によって違いが現れるでしょう。
ko_kr: 아래에서는 동일한 회로에 적용된 모든 스왑퍼의 패스를 보여 주며, 선형 체인 토폴로지와 일치하도록 변환한다. ``StochasticSwap`` 이 최고의 성능을 보여주는 것을 포함해 스왑퍼 패스 간의 성능 차이를 확인할 수 있다. 그러나 이것은 입력 회로에 따라 다를 수 있다.
pt_un: Abaixo, mostramos todos os passes de troca aplicados para o mesmo circuito para transformá-lo, para combinar com uma topologia de cadeia linear. Você pode ver diferenças de desempenho, em que o ``StochasticSwap`` é, claramente, o melhor. No entanto, isto pode variar, dependendo do circuito de entrada.
ru_ru: Ниже мы покажем, как обменные проходы преобразуют одну и ту же цепь для запуска на устройстве с линейной топологией. Сравнение производительности показывает, что самым лучшим вариантом является ``StochasticSwap``. Однако это сильно зависит от вида входной цепи.
ta_in: கீழே, ஒரு நேரியல் சங்கிலி இடவியலுடன் பொருந்துமாறு மாற்றுவதற்காக, ஒரே சுற்றுக்கு பயன்படுத்தப்படும் ஸ்வாப்பர் பாஸ்கள் அனைத்தையும் காண்பிக்கிறோம். செயல்திறனில் உள்ள வேறுபாடுகளை நீங்கள் காணலாம், அங்கு ``StochasticSwap`` தெளிவாக சிறந்தது. இருப்பினும், உள்ளீட்டு சுற்றுக்கு ஏற்ப இது மாறுபடும்.
tr_tr: Aşağıda, bir lineer zincir topolojisine uyacak şekilde dönüştürmek için aynı devreye uygulanan bütün takas geçişlerini gösteriyoruz. ``StochasticSwap`` ın net bir şekilde en iyi olduğu performans farklarını görebilirsiniz. Ancak, bu girilen devreye göre değişiklik gösterebilir.

source: Preset Pass Managers
bn_bn: আগে থেকে বানানো ছাড়পত্র পরিচালক
es_un: Administradores de Pases Preestablecidos
fr: Gestionnaires de passes pré-configurées
id: Manajer Pass Preset
it_it: Pass Manager Predefiniti
ja: プリセット パスマネージャー
ko_kr: 사전 설정 패스 매니저
pt_un: Gerenciador de passes predefinidos
ru_ru: Встроенные менеджеры проходов
ta_in: முன்னமைக்கப்பட்ட பாஸ் மேலாளர்கள்
tr_tr: Ön Ayarlı Geçiş Yöneticileri

source: Qiskit comes with several pre-defined pass managers, corresponding to various levels of optimization achieved through different pipelines of passes. Currently ``optimization_level`` 0 through 3 are supported; the higher the number, the more optimized it is, at the expense of more time. Choosing a good pass manager may take trial and error, as it depends heavily on the circuit being transpiled and the backend being targeted.
bn_bn: বিভিন্ন ছাড়পত্রের বিভিন্ন ধাপের বিভিন্ন মানের অনুকূলিতকরণের জন্য Qiskit -এর মধ্যে অনেক ছাড়পত্র পরিচালক আগে থেকে বানানো আছে। আপাতত ``optimization_level`` কেবল ০ থেকে ৩ অব্দি বানানো(০-কোনো অনুকূলিতকরণ না, ১-হালকা, ২-মাঝারি, ৩-ভারী) এবং যত ভারী অনুকূলিতকরণ, গণনার সময় তত বেশি। একটা ভালো ছাড়পত্র পরিচালক বেছে নিতে আন্দাজের আশ্রয় নিতে হয়, কারণ এটা কোন বর্তনী ট্রান্সপাইলড হচ্ছে এবং ব্যাকএন্ড -এ কোন বর্তনী লক্ষ্য তার উপর নির্ভরশীল।
es_un: Qiskit viene con varios administradores de pases predefinidos, que corresponden a varios niveles de optimización logrados a través de diferentes canalizaciones de pases. Actualmente, se soportan ``optimization_level`` de 0 a 3; entre más alto sea el número, más se optimizará, a expensas de un mayor tiempo. Elegir un buen administrador de pases puede requerir prueba y error, ya que depende en gran medida del circuito que se transpila y el backend al que se dirige.
fr: Qiskit inclut plusieurs gestionnaires de passes prédéfinis qui correspondent à différents niveaux d'optimisation obtenus selon différents arrangement de passes. Actuellement les niveaux d'optimisation 0 à 3 sont implémentés. Le niveau le plus haut (3) correspond à l'optimisation la meilleure, mais le temps d'optimisation est également le plus élevé. Le choix du meilleur gestionnaire de passes peut-être fait à l'aide d'essais, tant l'optimisation dépend du circuit lui même et de la plateforme sur lequel il va être exécuté.
id: Qiskit mempunyai beberapa manajer pass bawaan, sesuai dengan tingkat optimasi yang ciapai melalui jalur-jalur pass yang berbeda. Sekarang ini ``optimization_level`` 0 sampai 3 sudah didukung; semakin tinggi angkanya, semakin optimal, dengan harga waktu yang lebih lama. Memilih manajer pass yang baik membutuhkan banyak percobaan, karena sangat bergantung pada sirkuit yang ditranspilasikan dan backend yang dipakai.
it_it: Qiskit fornisce numerosi pass manager predefiniti, corrispondenti a diversi livelli di ottimizzazione raggiunti attraverso diverse sequenze di pass. Attualmente, i valori supportati per ``optimization_level`` vanno da 0 a 3; più il numero è alto, più il circuito è ottimizzato, a scapito del tempo di esecuzione. Scegliere un buon pass manager potrebbe richiedere diversi tentativi ed errori, in quanto dipende sia dal circuito che dal backend scelto.
ja: Qiskit には既定のパスマネージャーを用意しており、異なるパスのパイプラインを通じて達成される様々な最適化レベルに対応しています。現時点で ``optimization_level`` は 0 から 3 までサポートされており、一番大きな数字はより最適化されますが、一方で時間を消費します。トランスパイルされる回路とターゲットとなるバックエンドに非常に依存するので、最適なパスマネージャーの選択は試行錯誤を繰り返します。
ko_kr: 키스킷에는 여러 개의 사전 정의된 패스 매니저가 함께 제공되며, 이는 서로 다른 패스 파이프라인을 통해 달성되는 다양한 수준의 최적화에 대응한다. 현재 ``optimization_level`` 0에서 3까지 지원되고 있는데 숫자가 높을수록 최적화에 더 많은 시간이 소요된다. 좋은 패스 매니저를 선택하는 것은 시행착오를 동반하며, 이는 트랜스파일링되는 회로와 목표가 되는 백엔드에 크게 좌우되기 때문이다.
pt_un: O Qiskit vem com vários gerenciadores de passe pré-definidos, correspondentes a vários níveis de otimização alcançados, através de diferentes condutas de passes. Atualmente, ``otimization_level`` 0 até 3 são suportados; quanto maior o número, mais otimizado ele é, à custa de mais tempo. Escolher um bom gestor de passe, pode ser uma tarefa de tentativa e erro, já que depende muito do circuito, que está sendo transpilado e do backend de destino.
ru_ru: Qiskit содержит несколько предустановленных менеджеров разного уровня оптимизации, определяемого маршрутом проходов. Параметр ``optimization_level`` может принимать значения от 0 до 3; чем больше это число, тем глубже будет оптимизация и тем больше времени займет эта процедура. Выбор подходящего менеджера чаще всего достигается методом проб и ошибок, так как сильно зависит от цепи и бэкенда.
ta_in: Qiskit பல முன் வரையறுக்கப்பட்ட பாஸ் மேலாளர்களுடன் வருகிறது, இது பல்வேறு அளவிலான பாஸ்கள் மூலம் அடையப்பட்ட பல்வேறு நிலை தேர்வுமுறைகளுக்கு ஒத்திருக்கிறது. தற்போது ``optimization_level`` 0 முதல் 3 வரை ஆதரிக்கப்படுகிறது; அதிக எண்ணிக்கையில், அதிக நேரத்தின் இழப்பில் இது மிகவும் உகந்ததாக இருக்கும். ஒரு நல்ல பாஸ் மேலாளரைத் தேர்ந்தெடுப்பது சோதனை மற்றும் பிழையை எடுக்கக்கூடும், ஏனெனில் இது சுற்று பரிமாற்றம் மற்றும் பின்தளத்தில் குறிவைக்கப்படுவதைப் பொறுத்தது.
tr_tr: Qiskit, farklı pipeline/veri hattı geçişleri ile elde edilen çeşitli seviyelerde optimizasyona karşılık gelen birçok önceden tanımlı geçiş yöneticileri ile gelir. Şu anda ``optimization_level`` 0 ile 3 arasında destekleniyor; sayı ne kadar yüksek olursa daha fazla zaman harcayarak o kadar iyi bir optimizasyon elde edilir. İyi bir geçiş yöneticisi seçmek, ağırlıklı olarak aktarılan devreye ve hedeflenilen backende bağlı olduğu için deneme yanılma gerektirebilir.

source: Here we illustrate the different levels by looking at a state synthesis circuit. We initialize four qubits to an arbitrary state, and then try to optimize the circuit that achieves this.
bn_bn: এখানে একটা অবস্থা সংশ্লেষ বর্তনীর মাধ্যমে বিভিন্ন দেখার চেষ্টা করবো। আমরা ৪টি কিউবিটকে ইচ্ছামতো অবস্থার মান দিয়ে শুরু করবো এবং বর্তনীকে নিম্নোক্তভাবে অনুকূলিতকরণের চেষ্টা করবো।
es_un: Aquí ilustramos los diferentes niveles viendo el circuito de síntesis del estado. Inicializamos 4 qubits en un estado arbitrario y intentamos optimizar el circuito que logre esto.
fr: Nous illustrons ici les différents niveaux d'optimisation en regardant un circuit de synthèse d'état. Il s'agit d'initialiser quatre qubits dans un état arbitraire, et d'optimiser le circuit qui y parvient.
id: Di sini kita menggambarkan tingkat-tingkat yang berbeda dengan melihat keadaan sintesis sirkuit. Kita menginisialisasi empat qubit kekeadaan apa saja, kemudian mencoba mengoptimasi sirkuit yang mencapai hal ini.
it_it: Qui vengono illustrati i diversi livelli utilizzando un circuito di sintesi degli stati. Inizializziamo quattro qubit ad uno stato arbitrario, e andiamo poi a provare ad ottimizzare il circuito risultante.
ja: ここでは、異なるレベルの結果を状態合成 (state synthesis) 回路で見てみたいと思います。４つの量子ビットを任意の状態で初期化し、これを実現する回路を最適化します。
ko_kr: 여기에서는 상태를 인위적으로 조작한 회로를 사용해 다양한 트랜스파일 수준을 설명한다. 네 개의 큐비트를 임의의 상태로 초기화한 다음, 이 상태를 만들어낼 수 있도록 회로를 최적화 한다.
pt_un: Aqui, ilustramos os diferentes níveis, olhando para um circuito de síntese de estado. Inicializamos quatro qubits em um estado arbitrário e, em seguida, tentamos otimizar o circuito, que realiza isto.
ru_ru: Рассмотрим, чем отличаются эти уровни на примере создания некоторого состояния. Инициализируем четырехкубитный регистр произвольным образом, а затем попробуем оптимизировать цепь, которая может задать такое состояние.
ta_in: ஒரு நிலை தொகுப்பு சுற்று பார்ப்பதன் மூலம் வெவ்வேறு நிலைகளை இங்கே விளக்குகிறோம். நாங்கள் நான்கு வினாடிகளை ஒரு தன்னிச்சையான நிலைக்குத் துவக்குகிறோம், பின்னர் இதை அடையும் சுற்றுகளை மேம்படுத்த முயற்சிக்கிறோம்.
tr_tr: Burada, bir durum sentez devresine bakarak farklı seviyeleri gözümüzde canlandırıyoruz. 4 kübiti rastgele durum haline getiririz ve daha sonra bunu elde eden devreyi optimize etmeye çalışırız.

source: ``optimization_level=0``: just maps the circuit to the backend, with no explicit optimization (except whatever optimizations the mapper does).
bn_bn: ``optimization_level=0``: ম্যাপারের নিজস্ব অনুকূলিতকরণ (অপ্টিমাইজেশন) বাদে অন্য কোনো কিছু না করে বর্তনীকে ব্যাকএন্ড-এ চিত্রিত করে দেয়।
es_un: ``optimization_level=0``: mapea el circuito al backend, sin optimización explicita (excepto por las optimizaciones que se hagan al mapear).
fr: ``optimization_level=0``: fait correspondre le circuit à la carte de connection des qubits de la plateforme ciblée, sans optimisation explicite (sauf celles issues de la correspondance entre les qubits logiques et physiques afin de minimiser les swaps).
id: ``optimization_level=0``: hanya memetakan sirkuit ke backend, dengan tidak ada optimasi (kecuali optimasi yang dipakai pemeta).
it_it: ``optimization_level=0``: effettua solo una mappatura del circuito sul backend, senza una ottimizzazione esplicita (ad eccezione di quella effettuata dal mapper).
ja: ``optimization_level=0`` : 明示的な最適化をせず回路をバックエンドにマップします(どの最適化でもマッパーが実施する項目を除く)。
ko_kr: ``optimization_level=0``: 눈에 띄는 최적화 없이 회로를 백엔드에 매핑하기만 한다.(매퍼의 최적화 작업은 제외).
pt_un: ``optimization_level=0``: somente mapeia o circuito para o processo interno, sem nenhuma otimização explícita (exceto, quaisquer otimizações feitas pelo mapeador).
ru_ru: ``optimization_level=0``: просто отображает цепь на бэкенд без явной оптимизации (за исключением необходимой при отображении).
ta_in: ``optimization_level=0``: வெளிப்படையான தேர்வுமுறை இல்லாமல் (மேப்பர் செய்யும் எந்த மேம்படுத்தல்களையும் தவிர), பின்தளத்தில் சுற்றுக்கு வரைபடம்.
tr_tr: ``optimization_level=0``: sadece devreyi backende eşler, belirli bir optimizasyon olmadan (eşleştiren kişinin yaptığı optimizasyonlar hariç).

source: ``optimization_level=1``: maps the circuit, but also does light-weight optimizations by collapsing adjacent gates.
bn_bn: ``optimization_level=1``: বর্তনীকে চিত্রিত করার সাথে প্রতিবেশী দ্বারগুলো মিশিয়ে হালকা অনুকূলিতকরণ করে।
es_un: ``optimization_level=1``: mapea el circuito, pero también hace optimizaciones ligeras colapsando compuertas adyacentes.
fr: ``optimization_level=1``: optimisation légère, en plus d'établir la correspondance décrite ci dessus, ce niveau ajoute un premier niveau d'optimisation par réduction des portes adjacentes lorsque c'est possible.
id: ``optimization_level=1``: memetakan sirkuit, tetapi juga melakukan optimasi ringan dengan menghilangkan gerbang yang berdekatan.
it_it: ``optimization_level=1``: mappa il circuito ma effettua anche ottimizzazioni di peso leggero, andando a collassare gate adiacenti.
ja: ``optimization_level=1`` : 回路をマップしますが、隣接するゲートをつぶすといった軽量の最適化を実施します。
ko_kr: ``optimization_level=1``: 회로를 매핑하며 인접한 게이트를 한데 묶어서 가벼운 최적화를 수행한다.
pt_un: ``optimization_level=1``: mapeia o circuito, mas também realiza otimizações leves, colapsando portas adjacentes.
ru_ru: ``optimization_level=1``: отображает цепь и слегка ее оптимизирует, сворачивая соседние вентили.
ta_in: ``optimization_level=1``: சுற்று வரைபடத்தை வரைபடமாக்குகிறது, ஆனால் அருகிலுள்ள வாயில்களை உடைப்பதன் மூலம் குறைந்த எடை மேம்படுத்தல்களையும் செய்கிறது.
tr_tr: ``optimization_level=1``: devreyi eşler, fakat ayrıca komşu kapıları daraltarak hafif optimizasyonlar yapar.

source: ``optimization_level=2``: medium-weight optimization, including a noise-adaptive layout and a gate-cancellation procedure based on gate commutation relationships.
bn_bn: ``optimization_level=2``: দ্বারগুলোর নিজস্ব পরিবহন সম্পর্কের উপর ভিত্তি করে দ্বার বাতিল করা এবং ত্রুটি সহনকারী নকশা বানায়। এর সাথে মাঝারি স্তরের অনুকূলকরন করে।
es_un: ``optimization_level=2``: optimización media, incluye un diseño adaptable al ruido y un procedimiento de cancelación de compuerta basado en las relaciones de conmutación de compuerta.
fr: ``optimization_level=2``: optimisation moyenne, qui ajoute un système d'adaptation au bruit ainsi qu'une procédure de réduction des portes en utilisant des relations de commutation.
id: ``optimization_level=2``: optimasi menengah, termasuk susunan gangguan-adaptif dan prosedur penghilangan gerbang berdasarkan hubungan komutasi gerbang.
it_it: ``optimization_level=2``: ottimizzazione di medio peso, che include un layout adattivo rispetto al rumore e una procedura di cancellazione dei gate basata sulle loro relazioni di commutazione.
ja: ``optimization_level=2`` : 中程度の最適化で、ノイズに適応したレイアウト、ゲートの交換関係に基づくゲートキャンセル処理が含まれます。
ko_kr: ``optimization_level=2``: 노이즈-적용 레이아웃을 포함하는 중간-가중치 최적화 및 게이트 명령어 관계에 기초한 게이트-취소 절차를 포함한다.
pt_un: ``optimization_level=2``: otimizações médias, incluindo um layout adaptável ao ruído e um procedimento de cancelamento de portas, a partir de relações de comutação das portas.
ru_ru: ``optimization_level=2``: средняя оптимизация, включающая поправку на шум и удаление вентилей на основе их коммутации.
ta_in: ``optimization_level=2``: நடுத்தர எடை உகப்பாக்கம், இதில் சத்தம்-தகவமைப்பு தளவமைப்பு மற்றும் கேட் பரிமாற்ற உறவுகளின் அடிப்படையில் ஒரு கேட்-ரத்து நடைமுறை.
tr_tr: ``optimization_level=2``: orta ağırlıklı optimizasyon, kapı değişme ilkeleri temeline dayalı bir kapı iptali ve gürültü-adaptif layout/yerleşim dahil.

source: ``optimization_level=3``: heavy-weight optimization, which in addition to previous steps, does resynthesis of two-qubit blocks of gates in the circuit.
bn_bn: ``optimization_level=3``: ভারী অনুকূলিতকরণ, পূর্বের কাজগুলোর সাথে বর্তনীতে দুই কিউবিটবিশিষ্ট দ্বারের পুনরায় সংশ্লেষ করে।
es_un: ``optimization_level=3``: optimización intensa, que además de los pasos anteriores, hace una resíntesis de bloques de compuertas de dos qubits en el circuito.
fr: ``optimization_level=3``: optimisation lourde, qui ajoute aux étapes précédentes la synthèse par blocs de portes sur deux qubits dans le circuit.
id: ``optimization_level=3``: optimasi berat, semua yang ada di langkah sebelumnya, ditambah dengan resintesis dari gerbang blok dua qubit dalam sirkuit.
it_it: ``optimization_level=3``: ottimizzazione spinta, che oltre agli step sopra elencati, effettua la risintesi dei blocchi di gate a due qubit presenti nel circuito.
ja: ``optimization_level=3`` : 重量な最適化で、前までのステップに加え、回路にある２量子ビットの再合成 (resynthesis) を実施します。
ko_kr: ``optimization_level=3``: 이전의 단계의 최적화에 덧붙여 회로 내 두 개의 큐비트 블록에 대한 게이트의 재조합(resynthesis)을 수행하는 중량 최적화.
pt_un: ``optimization_level=3``: otimização pesada, que, além das etapas anteriores, faz a resíntese de blocos de portas de dois qubits no circuito.
ru_ru: ``optimization_level=3``: сложная оптимизация, которая в дополнение к предыдущим шагам затрагивает двухкубитные вентили.
ta_in: ``optimization_level=3``: கனமான எடை உகப்பாக்கம், இது முந்தைய படிகளுக்கு மேலதிகமாக, சுற்றுகளில் இரண்டு-குவிட் தொகுதிகளின் வாயில்களை மறுசீரமைக்கிறது.
tr_tr: ``optimization_level=3``: ağır optimizasyon, önceki adımlara ek olarak devredeki iki kübitli kapı bloklarının yeniden sentezini yapar.
