Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/04_transpiler_passes_and_passmanager.po
Languages: bn_bn, es_un, fr, id, it_it, ja, ko_kr, pt_un, ru_ru, ta_in, tr_tr

source: This pass functions as follows: it traverses the DAG layer-by-layer (each layer is a group of operations that does not act on independent qubits, so in theory all operations in a layer can be done independently). For each operation, if it does not already meet the coupling map constraints, the pass identifies a swap path and inserts swaps to bring the two qubits close to each other.
bn_bn: ছাড়পত্র ফাংশনের কার্যপ্রণালী: এটি ডিএজি টাকে স্তরে স্তরে ঘুরে দেখে, যেখানে প্রতি স্তর এমন কিছু গণনা থাকে যেগুলোতে অংশগ্রহণকারী কিউবিট পরস্পরের উপর নির্ভরশীল না অর্থাৎ প্রত্যেকটি গণনা সমান্তরালভাবে করা যাবে। প্রত্যেক গণনার জন্য ছাড়পত্র একটা অদলবদলের পথ বের করে এবং অদলবদল করে যাতে দুটো কিউবিটের মান কাছাকাছি আসে, যদি না আগে থেকেই গণনাটি সংযোজন নকশার শর্তগুলো মেনে নেয়।
es_un: Este pase funciona de la siguiente manera: atraviesa el DAG capa por capa (cada capa es un grupo de operaciones que no actúa en qubits independientes, entonces, en teoría, todas las operaciones en una capa pueden ser ejecutadas independientemente). Para cada operación, si no cumple ya las restricciones del mapa de acoplamiento, el pase identifica una ruta de intercambio e inserta swaps para acercar los dos qubits entre sí.
fr: Cette passe fonctionne de la manière suivante : elle traverse le GAD (Graphe Acyclique Direct) couche après couche (chaque couche est un ensemble d'opérations qui n'ont pas d'action sur des qubits indépendants, donc théoriquement toutes les opérations d'une couche peuvent être exécutées indépendamment les unes des autres). Pour chacune des opérations, si elle ne correspond pas aux contraintes de la carte de couplage, la passe identifie une possibilité d'échange (swap) pour amener les qubits l'un à coté de l'autre.
id: Fungsi pass ini adalah sebagai berikut: melewati DAG lapisan demi lapisan (setiap lapisan adalah sebuah kelompok operasi yang tidak bertindak terhadap qubit independen, jadi dalam teori semua operasi dalam lapisan dapat dilakukan secara independen). Untuk setiap operasi, jika tidak memenuhi batasan coupling map, pass akan mengidentifikasi jalur swap dan menambahkan swap untuk membawa dua qubit dekat satu sama lain.
it_it: Quasta pass funziona nel seguente modo: attraversa il DAG strato dopo strato (ogni strato è un gruppo di operazioni che non agisce su qubit indipendenti, quindi al livello teorico tutte le operazioni in uno strato possono essere eseguite indipendentemente). Per ogni operazione, se non soddisfa già i vincoli della coupling map, la pass identifica un percorso di scambi ed inserisce ogni scambio in modo da avvicinare i due qubit.
ja: このパスは以下のように機能します：DAG をレイヤー毎に横断します(各レイヤーは独立した量子ビットに作用しない操作のグループで、理論的にはレイヤーに存在する操作は独立して実行できます)。各操作に対して、既にカップリングマップの制約に適合していない場合には、パスは swap パスを特定し、２つの量子ビットが近くなるように swap を追加していきます。
ko_kr: 이러한 패스는 다음과 같이 함수를 전달한다: 이것은 DAG층별 (각 층은 독립적인 쿼비트로 동작하지 않는 연산의 그룹이므로, 이론적으로 레이어의 모든 연산들은 독립적으로 행해질 수 있다). 각 조작에 대해, 연결 맵 제한조건을 아직 충족하지 않는 경우, 패스는 스왑 경로를 식별하고 스왑을 삽입하여 두 개의 쿼리가 서로 인접하게 한다.
pt_un: Este passe funciona da seguinte forma: ele atravessa a DAG camada-por-camada (cada camada é um grupo de operações, que não atua em qubits independentes, portanto, em teoria, todas as operações em uma camada podem ser feitas de forma independente). Para cada operação, se ela já não atende às restrições de mapa de acoplamento, o passe identifica um caminho de troca e insere swaps para trazer os dois qubits próximos uns dos outros.
ru_ru: Этот проход работает следующим образом: он послойно просматривает ОАГ (каждый слой состоит из операций, не затрагивающих независимые кубиты, поэтому теоретически все операции слоя могут действовать независимо). Если операция не соответствует схеме сопряжений, проход находит и реализует обменный путь для сближения двух кубитов.
ta_in: இந்த பாஸ் பின்வருமாறு செயல்படுகிறது: இது DAG லேயர்-பை-லேயரைக் கடந்து செல்கிறது (ஒவ்வொரு லேயரும் சுயாதீனமான குவிட்களில் செயல்படாத செயல்பாடுகளின் குழு, எனவே கோட்பாட்டில் ஒரு அடுக்கில் உள்ள அனைத்து செயல்பாடுகளும் சுயாதீனமாக செய்யப்படலாம்). ஒவ்வொரு செயல்பாட்டிற்கும், இது ஏற்கனவே இணைப்பு வரைபடக் கட்டுப்பாடுகளைச் சந்திக்கவில்லை என்றால், பாஸ் ஒரு இடமாற்று பாதையை அடையாளம் கண்டு, இரண்டு குவிட்டுகளையும் ஒருவருக்கொருவர் நெருக்கமாகக் கொண்டுவருவதற்கு இடமாற்றுகளைச் செருகும்.
tr_tr: Bu geçiş aşağıdaki gibi işlev görür: DAG katman katman-geçiş yapar (her katman bağımsız kübitlere etki etmeyen bir işlem grubudur, bu nedenle teoride bir katmandaki tüm işlemler bağımsız olarak yapılabilir). Her işlem için, bağlantı haritası kısıtlamalarını karşılamıyorsa, geçiş bir takas yolunu tanımlar ve iki kübiti birbirine yakınlaştırmak için takaslar ekler.

source: Follow the comments in the code for more details.
bn_bn: আরো তথ্যের জন্য প্রোগ্রামের মধ্যের মন্তব্যগুলো লক্ষ্য করো।
es_un: Sigue los comentarios del código para más detalles.
fr: Regardez les commentaires dans le code ci-dessous pour plus de détails.
id: Ikuti komentar dalam kode untuk rincian lebih lanjut.
it_it: Si faccia riferimento ai commenti inseriti nel codice per avere più dettagli.
ja: 詳細はコード中のコメントを参照してください。
ko_kr: 자세한 내용은 코드의 주석을 따르십시오.
pt_un: Siga os comentários no código para mais detalhes.
ru_ru: Дополнительные сведения смотрите в комментариях к коду.
ta_in: மேலும் விவரங்களுக்கு குறியீட்டில் உள்ள கருத்துகளைப் பின்பற்றவும்.
tr_tr: Daha fazla ayrıntı için koddaki yorumları izleyin.

source: Let’s test this pass on a small example circuit.
bn_bn: একটা ছোট বর্তনীতে (সার্কিট) এইপাসটি চালিয়ে দেখা যাক।
es_un: Probemos este pase en un circuito pequeño de ejemplo.
fr: Essayons cette passe sur un petit circuit.
it_it: Andiamo a testare questa pass su un piccolo circuito di esempio.
ko_kr: 간단한 예제 회로에서 이 패스를 테스트해보자.
ru_ru: Проверим работу прохода на небольшой пробной цепи.
ta_in: இந்த பாஸை ஒரு சிறிய எடுத்துக்காட்டு சுற்றுகளில் சோதிக்கலாம்.
tr_tr: Bu geçişi küçük bir örnek devre üzerinde test edelim.

source: Now we construct a pass manager that contains our new pass. We pass the example circuit above to this pass manager, and obtain a new, transformed circuit.
bn_bn: এবার আমরা আমাদের নতুন ছাড়পত্রের জন্য একটা ছাড়পত্র পরিচালক বানাবো। এই উদাহরণ বর্তনীটি আমরা ছাড়পত্র পরিচালকের কাছে পাঠাবো এবং একটা নতুন রূপান্তরিত বর্তনী পাবো।
es_un: Ahora, construimos el administrador de pases que contiene a nuestro nuevo pase. Pasamos el circuito de ejemplo anterior a este administrador de pases para obtener un nuevo circuito transformado.
fr: Maintenant nous construisons un gestionnaire de passes qui contient notre nouvelle passe. Nous lui fournissons le circuit example ci-dessus en paramètre pour obtenir un nouveau circuit après qu'il ait été transformé.
id: Sekarang kita membangun manajer pass yang berisi pass kita yang baru. Kita memberikan contoh sirkuit di atas kepada manajer pass, dan mendapatkan sirkuit baru yang telah ditransformasi.
it_it: Ora costruiamo un pass manager che contenga la nostra nuova pass. Mandiamo il circuito di esempio sopra indicato al pass manager per ottenere un nuovo circuito trasformato.
ja: 我々の新しいパスを含むパスマネージャーを構築します。上記の回路例をこのパスマネージャに渡し、変換された新しい回路を受け取ります。
ko_kr: 이제 새로운 패스를 포함하는 패스 관리자를 구성한다. 위의 예제 회로를 이 패스 관리자에게 전달하고 새로운 변환된 회로를 얻는다.
pt_un: Agora, construímos um gerenciador de passes, que contém nosso novo passe. Passamos o circuito de exemplo, acima, para este gerenciador de passes e obtemos um novo circuito transformado.
ru_ru: Создадим менеджер, содержащий новый проход. Отправим ему нашу пробную цепь и получим ее в преобразованном виде.
ta_in: இப்போது எங்கள் புதிய பாஸைக் கொண்ட பாஸ் மேலாளரை உருவாக்குகிறோம். மேலே உள்ள எடுத்துக்காட்டு சுற்று இந்த பாஸ் மேலாளருக்கு அனுப்புகிறோம், மேலும் புதிய, மாற்றப்பட்ட சுற்று பெறுகிறோம்.
tr_tr: Şimdi yeni geçişimizi içeren bir geçiş yöneticisi oluşturuyoruz. Yukarıdaki örnek devreyi bu geçiş yöneticisine aktarıyoruz ve yeni, dönüştürülmüş bir devre elde ediyoruz.

source: Note that this pass only inserts the swaps necessary to make every two-qubit interaction conform to the device coupling map. It does not, for example, care about the direction of interactions, or the native gate set supported by the device. This is a design philosophy of Qiskit’s transpiler: every pass performs a small, well-defined action, and the aggressive circuit optimization is achieved by the pass manager through combining multiple passes.
bn_bn: লক্ষ্য করো, এই পাসটি কেবল সেই অদলবদলগুলো করে যাতে সব ২-কিউবিট কার্যকলাপ যন্ত্রের সংযোজন নকশার সাথে মিলে যায়। এটা কার্যের অভিমুখ বা যন্ত্রের স্থানীয় যুক্তিবর্তনীর (গেইট) প্রকৃতির খেয়াল করে না। এটা Qiskit ট্রান্সপাইলারের একটা দার্শনিক নকশা বা ডিজাইন: সব পাস ছোট, পূর্ব-নির্ধারিত পদক্ষেপ বা ক্রিয়া বা কাজ করে এবং একাধিক পাসের সাহায্যে পাস ব্যবস্থাপক (ম্যানেজার) বর্তনীর অনুকূলিতকরন করে।
es_un: Ten en cuenta que este pase solo inserta los swaps necesarios para hacer que todas las interacciones entre dos qubits se ajusten al mapa de acoplamiento del dispositivo. No se preocupa, por ejemplo, de la dirección de las interacciones, o el conjunto de compuertas nativo soportado por el dispositivo. Esta es una filosofía de diseño del transpilador de Qiskit: cada pase realiza una acción pequeña y bien definida, y la optimización agresiva de circuitos es lograda por el administrador de pases mediante una combinación de múltiples pases.
fr: Notez que cette passe n'insère que les swaps nécessaires pour que chaque interaction à deux qubit soit conforme à la carte dee couplage de l'appareil. Il ne s'agit pas, par exemple, de la direction des interactions ou de l'ensemble de porte natif pris en charge par l'unité. C'est une philosophie de conception du transpileur de Qiskit: chaque passe exécute une petite action bien définie, et l'optimisation efficace du circuit est réalisée par le gestionnaire de passes en combinant plusieurs passes.
it_it: Da notare che questa pass inserisce soltanto gli scambi necessari a rendere ogni interazione a due qubit conforme alla coupling map del dispositivo. Questa è la filosofia con cui è stato disegnato il transpiler di Qiskit: ogni pass effettua un'azione ristretta e ben definita e l'ottimizzazione del circuito più aggressiva è raggiunta dal pass manager combinando molteplici pass.
ru_ru: Отметим, что этот проход только добавляет обмены для соответствия каждой двухкубитной операции схеме сопряжений. При этом не имеет значения, к примеру, направление взаимодействия или какие внутренние вентили поддерживаются устройством. В этом суть транспайлера Qiskit: каждый проход выполняет небольшое, четко определенное действие, а полная оптимизация контура достигается их комбинацией с помощью менеджера.
ta_in: இந்த பாஸ் ஒவ்வொரு இரண்டு-குவிட் தொடர்புகளையும் சாதன இணைப்பு வரைபடத்துடன் ஒத்துப்போகச் செய்ய தேவையான இடமாற்றுகளை மட்டுமே செருகும் என்பதை நினைவில் கொள்க. எடுத்துக்காட்டாக, இது இடைவினைகளின் திசையைப் பற்றியோ அல்லது சாதனத்தால் ஆதரிக்கப்படும் சொந்த வாயில் தொகுப்பைப் பற்றியோ கவலைப்படுவதில்லை. இது Qiskit ட்டின் டிரான்ஸ்பைலரின் வடிவமைப்பு தத்துவம்: ஒவ்வொரு பாஸும் ஒரு சிறிய, நன்கு வரையறுக்கப்பட்ட செயலைச் செய்கிறது, மேலும் பல பாஸ்களை இணைப்பதன் மூலம் பாஸ் மேலாளரால் ஆக்கிரமிப்பு சுற்று தேர்வுமுறை அடையப்படுகிறது.
tr_tr: Bu geçişin yalnızca her iki-kübit etkileşiminin cihaz bağlantı haritasına uymasını sağlamak için gerekli olan takasları eklediğini unutmayın. Örneğin, etkileşimlerin yönünü veya aygıt tarafından desteklenen yerel kapı kümesini önemsemez. Bu, Qiskit'in transpiler'ının bir tasarım felsefesidir: her geçiş küçük, iyi tanımlanmış bir eylem gerçekleştirir ve agresif devre optimizasyonu, geçiş yöneticisi tarafından çoklu geçişleri birleştirerek elde edilir.

source: Transpiler Logging
bn_bn: ট্রান্সপাইলারের ঘটনাপঞ্জি
es_un: Logging del Transpilador
fr: Journal du Transpileur
id: Pencatatan Transpiler
it_it: Logging del Transpiler
ja: トランスパイラーロギング
ko_kr: 송수신기 로깅
pt_un: Registro do Transpilador
ru_ru: Ведение логов транспайлера
ta_in: டிரான்ஸ்பைலர் பதிவு செய்தல்
tr_tr: Aktarıcı Günlüğü

source: Due to the complexity of the internal operations that the transpiler is performing it’s likely that you’ll end up in a situation where you’d like to debug an issue or just understand more of what is happening inside the transpiler when you call it. To facilitate this the transpiler emits log messages as part of its normal operation. This logging uses the Python standard library ``logging`` module to emit the log messages. Python’s standard logging was used because it allows Qiskit-Terra’s logging to integrate in a standard way with other applications and libraries.
bn_bn: ট্রান্সপাইলারের অভ্যন্তরীন ক্রিয়াকলাপ অত্যন্ত জটিল ও দীর্ঘ। সেজন্য অনেক সময় কাজের উন্নতি জানার জন্য বা কোথাও কোনো ত্রুটি নির্ণয় ও সংশোধন (ডিবাগিং) করার জন্য ট্রান্সপাইলারের মধ্যে কি হচ্ছে তা জানা দরকার। এজন্যই ট্রান্সপাইলার কাজ করাকালীন নিজে থেকেই একটা ঘটনাপঞ্জি বানাতে থাকে। এই ঘটনাপঞ্জি পাইথন -এর নিজস্ব ``logging`` মডিউল ব্যবহার করে ঘটনার বিবরণ দেয়। পাইথন -এর সাধারণ ঘটনাপঞ্জি ব্যবহারের কারণ এর সাহায্যে সহজেই Qiskit টেরা -এর ঘটনাপঞ্জি অন্য গ্রন্থাগার বা অ্যাপ্লিকেশনে সংযোগ করা যায়।
es_un: Debido a la complejidad de las operaciones internas que el transpilador está realizando, es probable que termines en una situación donde te gustaría depurar un problema o simplemente entender más de lo que está pasando dentro del transpilador cuando lo llamas. Para facilitar esto, el transpilador emite mensajes de registro como parte de su funcionamiento normal. Este registro utiliza el módulo ``logging`` de la biblioteca estándar de Python para emitir los mensajes de registro. El logging estándar de Python se utilizó porque permite que los registros de Qiskit-Terra se integren de manera estándar con otras aplicaciones y bibliotecas.
fr: Du fait de la complexité des opérations internes qui sont effectuées par le transpileur, il est probable que vous soyez confronté à une situation où vous souhaiterez corriger un problème ou simplement que vous souhaitiez mieux comprendre ce qu'il se passe lorsque vous invoquez le transpileur. Afin de faciliter cela, le transpileur écrit un journal de messages lors de son exécution normale. Ce journal est écrit à l'aide du module `logging` de la bibliothèque standard de Python. La journalisation standard de Python a été choisie car elle permet au module Terra de Qiskit de s'intégrer de manière naturelle avec d'autres bibliothèques ou applications.
it_it: A causa della complessità delle operazioni interne eseguite dal transpiler, è probabile trovarsi nella situazione in cui diventa necessario effettuare un debug di una problematica o solo dover capire meglio cosa sta succedendo all'interno del traspiler una volta invocato. Per facilitare questo, il transpiler produce messaggi di log come parte del suo normale funzionamento. Il logging utilizza il modulo ``logging`` della libreria standard di Python per la produzione dei log. È stata utilizzata la libreria standard di logging di Python perchè permette al loggin di Qiskit-Terra di essere integrato in modo standard con altre applicazioni e librerie.
ru_ru: Из-за сложности внутренних операций, выполняемых транспайлером, вы, возможно, когда-нибудь столкнетесь с необходимостью отладки проблем или получения подробной информации о том, что происходит при его работе. Для этого будут полезны логи, которые обычно ведет транспайлер. Журнал записей ведется с помощью модуля ``logging`` стандартной библиотеки Python, что удобно в интеграции Qiskit Terra с другими приложениями и библиотеками.
ta_in: டிரான்ஸ்பைலர் நிகழ்த்தும் உள் செயல்பாடுகளின் சிக்கலான தன்மை காரணமாக, நீங்கள் ஒரு சிக்கலை பிழைத்திருத்த விரும்பும் சூழ்நிலையில் நீங்கள் முடிவடையும் அல்லது டிரான்ஸ்பைலரை அழைக்கும்போது என்ன நடக்கிறது என்பதைப் புரிந்துகொள்ளலாம். இதை எளிதாக்க டிரான்ஸ்பைலர் அதன் இயல்பான செயல்பாட்டின் ஒரு பகுதியாக பதிவு செய்திகளை வெளியிடுகிறது. பதிவுச் செய்திகளை வெளியிடுவதற்கு இந்த பதிவு பைதான் நிலையான நூலகத்தின் ``logging'` தொகுதியைப் பயன்படுத்துகிறது. பைத்தானின் நிலையான பதிவு பயன்படுத்தப்பட்டது, ஏனெனில் இது Qiskit-டெர்ராவின் பதிவு மற்ற பயன்பாடுகள் மற்றும் நூலகங்களுடன் நிலையான வழியில் ஒருங்கிணைக்க அனுமதிக்கிறது.
tr_tr: Transpiler'ın gerçekleştirdiği dahili işlemlerin karmaşıklığı nedeniyle, bir sorunu ayıklamak veya yalnızca aradığınızda transpiler içinde neler olduğunu daha fazla anlamak istediğiniz bir duruma geleceksiniz. Bunu kolaylaştırmak için, transpiler normal çalışmasının bir parçası olarak günlük mesajları yayar. Bu günlük kaydı, günlük iletilerini göndermek için Python standart kütüphane ``logging`` modülünü kullanır. Python'un standart günlüğü burada kullanıldı çünkü Qiskit-Terra günlüğünün diğer uygulamalar ve kütüphanelerle standart bir şekilde bütünleşmesine izin veriyor.

source: For a more thorough introduction to Python logging refer to the `official documentation <https://docs.python.org/3/library/logging.html>`__ and the tutorials and cookbook linked off of there.
bn_bn: Python এর ঘটনাপঞ্জি সম্পর্কে আরো জানতে হলে এখানে `official documentation <https://docs.python.org/3/library/logging.html>`__ গিয়ে শিক্ষণীগুলো দেখো।
es_un: Para una introducción más a fondo del logging de Python, consulte la `documentación oficial <https://docs.python.org/3/library/logging.html>`__ y los tutoriales y libros de código enlazados ahí.
fr: Pour une description plus précise de la journalisation de Python vous pouvez vous référer à la `documentation officielle<https://docs.python.org/3/library/logging.html>`__ et aux tutoriels et exemples que vous y trouverez.
id: Untuk introduksi catatan Python lebih lengkap mengacu kepada `dokumentasi resmi <https://docs.python.org/3/library/logging.html>`__ dan tutorial dan intruksi detail terdapat di sana.
it_it: Per avere un'introduzione più approfondita al logging di Python, si faccia riferimento alla `documentazione ufficiale <https://docs.python.org/3/library/logging.html>`__ e ai tutorial e cookbook che si trovano lì referenziati.
ja: Python のロギングについての情報は、 `公式ドキュメント <https://docs.python.org/3/library/logging.html>`__ 、及びリンク先のチュートリアルと cookbook を参照してください。
pt_un: Para uma introdução mais completa, aos logs do Python, consulte a `documentação oficial <https://docs.python.org/3/library/logging.html>`__ e os tutoriais e cookbooks, mencionados lá.
ru_ru: Для более подробной информации о логах в Python обратитесь к `официальной документации <https://docs.python.org/3/library/logging.html>`__ и предлагаемым в ней руководствам.
ta_in: பைத்தான் பதிவு குறித்த முழுமையான அறிமுகத்திற்கு `official documentation <https://docs.python.org/3/library/logging.html>`__ மற்றும் பயிற்சிகள் மற்றும் சமையல் புத்தகம் ஆகியவை அங்கிருந்து இணைக்கப்பட்டுள்ளன.
tr_tr: Python günlüğüne daha ayrıntılı bir giriş için `official documentation <https://docs.python.org/3/library/logging.html>`__'e ve oradan bağlantılı eğitimlere ve tarif kitabına bakın.

source: Note: Most of the logging module functions used in this section adjust global settings. If you run commands in this section it might effect the output from other cells if they are run in a different order.
bn_bn: মনে রেখো: এই অংশে ব্যবহৃত অধিকাংশ ঘটনাপঞ্জি মডিউল সার্বজনীন সেটিংস নির্ভর করা। সঠিক ক্রমে না চালানো হলে এই অংশে চালানো নির্দেশ (কম্যান্ড) অন্য অংশের ফলাফলে প্রভাব ফেলতে পারে।
es_un: Nota: la mayoría de las funciones del módulo logging usadas aquí ajustan configuraciones globales. Si corres comandos de esta sección puede que afecte las salidas de otras celdas si son ejecutadas en diferente orden.
fr: Remarque: La plupart des fonctions de module de journalisation utilisées dans cette section adaptent les paramètres globaux. Si vous exécutez des commandes dans cette section, elle peut effectuer la sortie d'autres cellules si elles sont exécutées dans un ordre différent.
id: Catatan: Sebagian besar fungsi modul pencatatan yang dipakai dalam bagian ini menyesuaikan pengaturan global. Jika Anda menjalankan perintah dalam bagian ini mungkin akan berdampak pada keluaran dari sel lainnya jika dijalankan dengan urutan yang berbeda.
it_it: Nota: La maggior parte delle funzioni presenti nel modulo di logging utilizzate in questa sezione modificano le impostazioni globali. Se esegui un comando in questa sezione potrebbe influire sull'output di altre celle se vengono eseguite in ordine differente.
ja: 注: このセクションで使用されるロギングモジュールの機能のほとんどは、グローバル設定を調整します。このセクションのコマンドを実行すると、他のセルからの出力に影響を与える可能性があります。
ko_kr: 참고: 이 섹션에서 사용되는 대부분의 로깅 모듈 기능은 글로벌 설정을 조정한다. 이 섹션에서 명령을 실행하면 (다른 셀의 출력이 다른 순서로 실행되는 경우) 해당 출력이 영향을 받을 수 있다.
pt_un: Nota: a maioria das funções do módulo de registro utilizado nesta seção ajusta as configurações globais. Se você executar comandos nesta seção ele pode efetivar a saída de outras células se elas forem executadas em uma ordem diferente.
ru_ru: Примечание: Большинство функций модуля ведения журнала операций, используемых в этом разделе, затрагивает глобальные настройки. Запуск этих команд может влиять на результат работы других ячеек при запуске в другом порядке.
ta_in: குறிப்பு: இந்த பிரிவில் பயன்படுத்தப்படும் பெரும்பாலான பதிவு தொகுதி செயல்பாடுகள் உலகளாவிய அமைப்புகளை சரிசெய்கின்றன. இந்த பிரிவில் நீங்கள் கட்டளைகளை இயக்கினால், மற்ற கலங்களிலிருந்து அவை வேறு வரிசையில் இயங்கினால் அது வெளியீட்டை பாதிக்கும்.
tr_tr: Not: Bu bölümde kullanılan günlük modülü işlevlerinin çoğu genel ayarları düzenler. Bu bölümdeki komutları çalıştırırsanız, farklı bir sırayla çalıştırılırlarsa diğer hücrelerden gelen çıktıyı etkileyebilir.

source: Configuring Python Standard Library Logging
bn_bn: Python -এর ঘটনাপঞ্জির নিজস্ব গ্রন্থাগারের সজ্জায়ন
es_un: Configuración de la Biblioteca Estándar de Python Logging
fr: Configuration de la bibliothèque standard de journalisation
id: Mengonfigurasi Pustaka Standar Pencatatan dari Python
it_it: Configurazione del Logging della Libreria Standard di Python
ja: Python ロギング標準ライブラリの設定
ko_kr: Python Standard Library 로깅 구성하기
pt_un: Configurando o Registro de Biblioteca Padrão Python
ru_ru: Настройка стандартного ведения журнала библиотеки Python
ta_in: பைதான் நிலையான நூலக பதிவை கட்டமைத்தல்
tr_tr: Python Standart Kütüphane Günlük Kaydını Yapılandırma
