Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/04_transpiler_passes_and_passmanager.po
Languages: bn_bn, es_un, fr, id, it_it, ja, ko_kr, pt_un, ru_ru, ta_in, tr_tr

source: This page was generated from `tutorials/circuits_advanced/04_transpiler_passes_and_passmanager.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/circuits_advanced/1_advanced_circuits.ipynb`__ থেকে উৎপন্ন হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/circuits_advanced/04_transpiler_passes_and_passmanager.ipynb`__.
fr: Cette page a été générée à partir de `tutorials/circuits_advanced/4_transpiler_passes_and_passmanager.ipynb`__.
id: Halaman ini disadur dari `tutorials/circuits_advanced/04_transpiler_passes_and_passmanager.ipynb`__.
it_it: Questa pagina è stata generata da `tutorials/circuits_advanced/04_transpiler_passes_and_passmanager.ipynb`__.
ja: 当ページは `tutorials/circuits_advanced/04_transpiler_passes_and_passmanager.ipynb`__から生成されました。
ko_kr: 이 페이지는 `tutorials/circuits_advanced/04_transpiler_passes_and_passmanager.ipynb`__ 로부터 생성되었다.
pt_un: Esta página foi gerada, a partir de `tutorials/circuits_advanced/04_transpiler_passes_and_passmanager.ipynb`__.
ru_ru: Страница создана на основе `tutorials/circuits_advanced/04_transpiler_passes_and_passmanager.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/circuits_advanced/04_transpiler_passes_and_passmanager.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
tr_tr: Bu sayfa `tutorials/circuits_advanced/04_transpiler_passes_and_passmanager.ipynb`__ adresinden oluşturuldu.

source: Transpiler Passes and Pass Manager
bn_bn: ট্রান্সপাইলারের ছাড়পত্র ও ছাড়পত্র পরিচালক
es_un: Pases al Transpilador y Administrador de Pases
fr: Passes du transpileur et gestionnaire de passes
id: Transpiler Pass dan Manager Pass
it_it: Transpiler Pass e Pass Manager
ja: トランスパイラー パスとパス マネージャー
ko_kr: 트랜스파일러 패스 및 패스 매니저
pt_un: Transpilador de passes e gerenciador de passes
ru_ru: Проходы транспайлера и менеджер проходов
ta_in: டிரான்ஸ்பைலர் பாஸ் மற்றும் பாஸ் மேலாளர்
tr_tr: Aktarıcı Geçişleri ve Geçiş Yöneticisi

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
id: Pengantar
it_it: Introduzione
ja: はじめに
ko_kr: 소개
pt_un: Introdução
ru_ru: Введение
ta_in: முன்னுரை
tr_tr: Giriş

source: A central component of Qiskit Terra is the transpiler, which is designed for modularity and extensibility. The goal is to be able to easily write new circuit transformations (known as transpiler **passes**), and combine them with other existing passes. Which passes are chained together and in which order has a major effect on the final outcome. This pipeline is determined by a **pass manager**, which schedules the passes and also allows passes to communicate with each other by providing a shared space. In this way, the transpiler opens up the door for research into aggressive optimization of quantum circuits.
bn_bn: Qiskit Terra -এর একটা গুরুত্বপূর্ণ অঙ্গ হলো ট্রান্সপাইলার, যেটিকে কাজ ছোট করে ভাঙা (মডুলারিটি) ও পরে কাজকে বড়ো করে নেওয়ার (এক্সটেন্সিবিলিটি) জন্য বানানো হয়েছে।
es_un: Un componente central de Qiskit Terra es el transpilador, el cual está diseñado para modularidad y extensibilidad. El objetivo es lograr escribir fácilmente transformaciones de circuitos (conocidos como **pases** al transpilador), y combinarlos con otros pases existentes. Cuáles pases son conectados y en qué orden tiene un efecto substancial en el resultado final. Este camino es determinado por un **administrador de pases**, el cual ordena los pases y también permite que los pases se comuniquen entre sí, proporcionándoles un espacio compartido. De esta manera, el transpilador abre la puerta a la investigación sobre la optimización agresiva de los circuitos cuánticos.
fr: Le transpileur est un composant central de Qiskit Terra, il est conçu pour être modulaire et extensible. L'objectif est d'être en mesure de créer de nouvelles transformations de circuit (appelées passes du transpileur), et de les combiner avec les autres passes existantes. La manière dont les passes sont combinées entre elles et l'ordre dans lequel elle sont appliquées a un effet déterminant sur le résultat final. C'est le pass manager (gestionnaire de passes), qui ordonnance les différentes passes et leur permet de communiquer ensemble au travers d'un espace de communication spécifique. Le transpileur ouvre ainsi la porte sur un champ de recherche vers une optimisation significative des circuits quantiques.
id: Komponen sentral dari Qiskit Terra adalah transpiler, yang dirancang untuk modularitas dan extensibilitas. Tujuannya adalah untuk mudah menulis transformasi sirkuit baru (dikenal sebagai transpiler ** passes**), dan menggabungkannya dengan pass-pass yang ada. Pass-pass apa yang dirantai bersama dan dengan urutan apa memiliki efek besar pada hasil akhir. Baris pipeline ini ditentukan oleh ** pass manager * *, yang menjadwalkan pass dan juga memungkinkan pass untuk berkomunikasi satu sama lain melalui ruang bersama. Dengan cara ini, transpiler memungkinkan untuk riset optimisasi agresif tentang sirkuit kuantum.
it_it: Uno dei componenti centrali di Qiskit Terra è il transpiler, che è stato disegnato per garantire modularità ed estensibilità. L'obiettivo è quello di poter facilmente scrivere nuove trasformazioni dei circuiti (note come transpiler **pass**), e combinarle con pass esistenti. Come le pass sono concatenate tra loro ed in quale ordine ha un importante effetto sul risultato finale. La pipeline è determinata da un **pass manager** che pianifica le pass e permette a diverse pass di comunicare tra di loro mettendo a disposizione uno spazio condiviso. In questo modo, il transpiler apre la strada alla ricerca di ottimizzazioni efficaci dei circuiti quantistici.
ja: Qiskit Terra の中核コンポーネントはトランスパイラーで、モジュール性と拡張性のために設計されています。目的は新しい回路の変換(トランスパイラー **パス** と呼んでいます) を簡単に書けるようにし、他の既存のパスと組み合わせられるようにすることです。これらのパスを連鎖させ、どの順番で適用するかは、最終的な結果に大きな影響を与えます。このパイプラインは **パスマネージャー** により決定されます。パスマネージャーは、パスをスケジューリングし、共有スペースによるパス間の相互通信を行えるようにしています。このようにトランスパイラーは、量子回路の積極的な最適化の研究のために、ドアを開放しています。
ko_kr: 키스킷 테라의 중심 구성요소는 모듈성과 확장성을 위해 설계된 트랜스파일러다. 새로운 회로 변환(트랜스파일러 **passes** 로 알려져 있음) 을 쉽게 작성할 수 있고, 이를 다른 기존 패스와 결합하는 것이 목표다. 어떤 패스가 체인으로 묶여 있고 어떤 순서가 최종 결과에 큰 영향을 미치는가. 이 파이프라인은 **pass manager** 에 의해 결정되는데, 이 관리자는 패스를 예약하고 공유 공간을 제공하여 패스가 서로 통신할 수 있도록 한다. 이런 식으로 트랜스파일러는 적극적으로 양자 회로의 최적화에 대한 연구의 문을 연다.
pt_un: Um componente central do Qiskit Terra é o transpilador, que é projetado para modularidade e extensibilidade. O objetivo é ser capaz de escrever, facilmente, novas transformações de circuito (conhecidas como **transpiler passes**) e combiná-las com outros passes existentes. Quais passes são encadeados em conjunto e, em que ordem, tem um grande efeito sobre o resultado final. Este pipeline é determinado por um **gerenciador de passe**, que planeja os passes e, também, permite que os passes se comuniquem, entre si, fornecendo um espaço compartilhado. Desta forma, o transpilador abre a porta para pesquisa, em otimização agressiva de circuitos quânticos.
ru_ru: Центральным компонентом Qiskit Terra является транспайлер, обеспечивающий модульность и расширяемость. Его преимущество состоит в возможности легко записывать новые преобразования цепи (так называемые **проходы** транспайлера) и комбинировать их с уже имеющимися. При этом на конечный результат сильно влияет порядок и сочетание действий. Маршрут определяется с помощью **менеджера проходов**, планирующего преобразования и формирующего общее пространство их взаимодействия. Благодаря этому транспайлер открывает возможность глубокой оптимизации квантовых цепей.
ta_in: Qiskit டெர்ராவின் மையக் கூறு டிரான்ஸ்பைலர் ஆகும், இது மட்டுப்படுத்தல் மற்றும் விரிவாக்கத்திற்காக வடிவமைக்கப்பட்டுள்ளது. புதிய சுற்று மாற்றங்களை (டிரான்ஸ்பைலர் **passes** என அழைக்கப்படுகிறது) எளிதாக எழுத முடியும், மேலும் அவற்றை ஏற்கனவே உள்ள பிற பாஸுடன் இணைக்க முடியும். எந்த பாஸ்கள் ஒன்றாக இணைக்கப்பட்டுள்ளன மற்றும் எந்த வரிசையில் இறுதி முடிவில் பெரிய தாக்கத்தை ஏற்படுத்துகிறது. இந்த பைப்லைன் ஒரு *pass manager*ஆல் தீர்மானிக்கப்படுகிறது, இது பாஸ்களை திட்டமிடுகிறது மற்றும் பகிரப்பட்ட இடத்தை வழங்குவதன் மூலம் பாஸ்கள் ஒருவருக்கொருவர் தொடர்பு கொள்ள அனுமதிக்கிறது. இந்த வழியில், குவாண்டம் சுற்றுகளின் ஆக்கிரோஷமான தேர்வுமுறை குறித்த ஆராய்ச்சிக்கான கதவு டிரான்ஸ்பைலர் திறக்கிறது.
tr_tr: Qiskit Terra'nın merkezi bir bileşeni, modülerlik ve genişletilebilirlik için tasarlanmış aktarıcıdır. Amaç, yeni devre dönüşümlerini (aktarıcı **geçişleri** olarak bilinir) kolayca yazabilmek ve mevcut diğer geçişlerle birleştirmektir. Hangi geçişler birlikte zincirlenir ve hangi düzenin nihai sonuç üzerinde büyük etkisi vardır. Bu ardışık düzen, geçişleri programlayan ve geçişlerin ortak bir alan sağlayarak birbirleriyle iletişim kurmasına olanak tanıyan bir **geçiş yöneticisi** tarafından belirlenir. Bu şekilde, aktarıcı kuantum devrelerinin agresif optimizasyonuna yönelik araştırma için kapı açar.

source: In this notebook, we look at the built-in passes, how to use the pass manager, and develop a simple custom transpiler pass. In order to do the latter, we first need to introduce the internal representation of quantum circuits in Qiskit, in the form of a Directed Acyclic Graph, or **DAG**. Then, we illustrate a simple swap mapper pass, which transforms an input circuit to be compatible with a limited-connectivity quantum device.
bn_bn: এই নোটবুকে আমরা আগে বানানো ছাড়পত্র (পাস), ছাড়পত্র পরিচালকের (ম্যানেজার) ব্যবহার পদ্ধতি এবং নিজেরা একটা সহজ ট্রান্সপাইলার ছাড়পত্র বানানো শিখবো। নিজেদের ট্রান্সপাইলার ছাড়পত্র বানাতে হলে Qiskit -এর ভিতরের কোয়ান্টাম বর্তনীগুলো অচক্রাকার নির্দেশিত লেখচিত্রের (ডিরেক্টেড এসাইক্লিক গ্রাফ) মাধ্যমে দেখাতে হবে। এরপর, আমরা একটা সহজ অদলবদলের নক্সারক্ষকের(ম্যাপার) ছাড়পত্র, যেটা একটা ইনপুট বর্তনীকে একটা সীমিত সংযোগের কোয়ান্টাম যন্ত্রের উপযোগী বানিয়ে তোলে।
es_un: En este cuaderno, analizamos los pases incorporados, cómo usar el administrador de pases y desarrollamos un pase personalizado simple de transpilador. Para hacer esto último, primero tenemos que introducir la representación interna de los circuitos cuánticos en Qiskit, en la forma de Grafos Acíclicos Dirigidos o **DAG** (Directed Acyclic Graph). Después, ilustramos un pase de mapeo de intercambio simple, el cual transforma un circuito de entrada para que sea compatible con un dispositivo cuántico de conectividad limitada.
fr: Dans ce notebook, nous examinons les passes pré-programmées, comment utiliser le gestionnaire de passes, et nous allons développer une passe personnalisée simple de transpileur. Pour le dernier point, nous avons besoin d'introduire préalablement la notion de représentation interne de circuit quantique dans Qiskit, sous la forme d'un Graphe Acyclique Directionnel GAD (en anglais DAG pour Direct Acyclic Graph). Ensuite nous prendrons l'exemple de la passe d'échanges simples, qui permet de transformer un circuit pour l'adapter à un appareil dont la connectivité entre les qubits est limitée.
id: Dalam notebook ini, kita akan melihat pass bawaan, cara menggunakan pengelola pass, dan membuat transpilator pass sederhana. Untuk membuat transpilator pass, pertama-tama kita perlu mengenalkan representasi internal dalam sirkuit kuantum di Qiskit, dalam bentuk Grafik Asiklik Terarah, atau **DAG** (Directed Acyclic Graph). Kemudian, kita akan mengilustrasikan swap mapper pass, yang mentransformasi sirkuit inputan menjadi cocok dengan perangkat kuantum dengan konektivitas terbatas.
it_it: In questo notebook, si andranno a mostrare le pass integrate, come utilizzare il pass manager e si andrà a sviluppare una semplice transpiler pass personalizzata. Per poter raggiungere quest'ultimo punto, è prima necessario introdurre la rappresentazione interna dei circuiti quantistici in Qiskit, nella forma di un Directed Acyclic Graph, o **DAG**. Poi si mostrerà una semplice swap mapper pass, che rende un circuito di input compatibile con un dispositivo quantistico a connettività limitata.
ja: このノートブックでは、ビルドインされたパスを調べ、パスマネージャーの利用法を確認し、簡単なトランスパイラーパスを開発します。そのために、最初に有向非巡回グラフ（Directed Acyclic Graph、DAG）の形で、Qiskitにおける量子回路の内部表現を紹介します。次に、入力回路を接続性の制限された量子デバイスと互換性を持つように変換する、単純な swap mapper パスを示します。
ko_kr: 이 노트북에서는 내장된 패스, 패스 매니저 사용법 등을 살펴보고, 간단한 맞춤형 트랜스파일러 패스를 개발한다. 후자를 하기 위해서는 우선 **DAG** (Directed Acyclic Graph) 의 형태로 키스킷으로 양자 회로의 내부를 표현한다. 그런 다음 입력 회로를 제한된 연결 양자 장치와 호환되도록 변환하는 간단한 스왑 매퍼 패스를 설명한다.
pt_un: Neste notebook, olhamos para os passes embutidos, como usar o gerenciador de passes e desenvolver um simples transpilador de passe personalizado. Para fazer o último, precisamos, primeiramente, introduzir a representação interna dos circuitos quânticos em Qiskit, na forma de um Gráfico Acíclico Direcionado, ou **DAG**. Em seguida, ilustramos um simples mapeador de passe de troca, que transforma um circuito de entrada, para ser compatível com um dispositivo quântico de conectividade limitada.
ru_ru: В этом блокноте мы рассмотрим встроенные проходы и порядок работы с менеджером, а также разработаем простой проход транспайлера самостоятельно. Познакомимся сначала с внутренним представлением квантовых цепей Qiskit в виде ориентированного ациклического графа **ОАГ**. Затем покажем как устроен проход со swap-отображениями (swap=обмен), подготавливающий цепь для запуска на квантовом устройстве с ограниченным числом связей.
ta_in: இந்த நோட்புக்கில், உள்ளமைக்கப்பட்ட பாஸ்கள், பாஸ் மேலாளரை எவ்வாறு பயன்படுத்துவது மற்றும் எளிய தனிப்பயன் டிரான்ஸ்பைலர் பாஸை உருவாக்குவது ஆகியவற்றைப் பார்க்கிறோம். பிந்தையதைச் செய்ய, முதலில் கிஸ்கிட்டில் குவாண்டம் சுற்றுகளின் உள் பிரதிநிதித்துவத்தை ஒரு நேரடி அசைக்ளிக் வரைபடம் அல்லது **DAG** வடிவத்தில் அறிமுகப்படுத்த வேண்டும். பின்னர், ஒரு எளிய இடமாற்று மேப்பர் பாஸை நாங்கள் விளக்குகிறோம், இது ஒரு உள்ளீட்டு சுற்று ஒரு வரையறுக்கப்பட்ட-இணைப்பு குவாண்டம் சாதனத்துடன் இணக்கமாக இருக்கும்.
tr_tr: Bu not defterinde, yerleşik geçişlere, geçiş yöneticisinin nasıl kullanılacağına ve basit bir özel transpiler geçişi geliştireceğine bakıyoruz. Sonuncusunu yapmak için önce Qiskit'teki kuantum devrelerinin dahili temsilini Yönlendirilmiş Bir Asiklik Graf veya **DAG** şeklinde tanıtmamız gerekir. Daha sonra, bir giriş devresini sınırlı bağlantılı bir kuantum cihazı ile uyumlu olacak şekilde dönüştüren basit bir takas eşleyici geçişini gösteririz.

source: **Before you start**: You may need to install the ``pydot`` library and the ``graphviz`` library for the DAG plotting routines. If you are using Anaconda Python, you can install both with the ``conda`` command. If you use your system’s native Python interpreter, install ``pydot`` using the ``pip`` command, and install ``graphviz`` using your system’s native package manager (e.g. ``yum``, ``apt``, ``dnf``, ``brew``, etc.).
bn_bn: ** শুরু করার আগে **: অচক্রাকার নির্দেশিত লেখচিত্র (DAG) আঁকার জন্য ``pydot`` ও ``graphviz`` - এই দুটি গ্রন্থাগার (লাইব্রেরি) ইনস্টল করতে হবে। এনাকোন্ডার Python - এ ``conda`` নির্দেশের সাহায্যে দুটোই ইনস্টল করা যায়। গঠনতন্ত্রের (সিস্টেমের) নিজস্ব Python অনুবাদককে (ইন্টারপ্রিটার) ``pydot`` -টি ``pip`` নির্দেশের মাধ্যমে ও ``graphviz`` -টি গঠনতন্ত্রের (সিস্টেমের) নিজস্ব বান্ডিল পরিচালক (প্যাকেজ ম্যানেজার), যেমন- ``yum``, ``apt``, ``dnf``, ``brew`` ইত্যাদির মাধ্যমে ইনস্টল করা যায়।
es_un: **Antes de comenzar**: Es posible que necesites instalar las librerías ``pydot`` y ``graphviz`` para las rutinas de graficado de DAG. Si usas Anaconda Python, puedes instalar ambos con el comando ``conda``. Si usas el intérprete de Python nativo a tu sistema, puedes instalar ``pydot`` con el comando ``pip``, y ``graphviz`` con el administrador de paquetes nativo a tu sistema (por ejemplo, ``yum``, ``apt``, ``dnf``, ``brew``, etc.).
fr: ***Avant de commencer*** : Vous devrez peut-être installer la bibliothèque ``pydot`` et la bibliothèque ``graphviz`` pour les routines de tracé des DAG. Si vous utilisez Anaconda Python, vous pouvez installer les deux bibliothèques avec la commande ``conda``. Si vous utilisez l'interpréteur Python natif de votre système, installez ``pydot`` en utilisant la commande ``pip`` et installez ``graphviz`` en utilisant le gestionnaire de paquets natif de votre système (comme ``yum``, ``apt``, ``dnf``, ``brew``, etc.).
it_it: ***Prima di iniziare***: Potrebbe essere necessario installare le librerie ``pydot``e ``graphviz`` per il corretto funzionamento delle routine di visualizzazione dei grafici DAG. Se si utilizza Python Anaconda, è possibile installare le due librerie con il comando ``conda``. Se si utilizza invece l'interprete Python nativo del sistema operativo, la libreria ``pydot`` si può installare utilizzando il comando ``pip``, mentre ``graphviz`` utilizzando il manager di pacchetti nativo del sistema (come ad esempio ``yum``, ``apt``, ``dnf``, ``brew``, etc.).
ko_kr: **시작하기 전에**: DAG 플로팅 루팅을 위해 ``pydot`` 라이브러리와 ``graphviz`` 라이브러리를 설치가 필요할 수도 있습니다. Anaconda Python을 사용하는 경우 ``conda`` 명렁어를 통해 통해 두 가지 라이브러리를 모두 설치할 수 있습니다. 시스템의 기본 Python 인터프리터를 사용하는 경우 ``pip`` 명령어를 통해 ``pydot`` 를 설치하고 시스템의 기본 패키지 관리자를 사용하여 ``graphviz`` 를 설치합니다. (즉. ``yum``, ``apt``, ``dnf``, ``brew``, 등등).
ru_ru: **Перед началом работы*: Для построения ОАГ вам могут потребоваться библиотеки ``pydot`` и ``graphviz``. При работе в Anaconda они устанавливаются с помощью команды ``conda``. Если вы используете встроенный системный интерпретатор Python, установка ``pydot`` выполняется командой ``pip``, а``graphviz`` - встроенным менеджером пакетов (``yum``, ``apt``, ``dnf``, ``brew`` и т.д.).
ta_in: **Before you start**: DAG சதி நடைமுறைகளுக்கு ``pydot`` நூலகத்தையும் ``graphviz`` நூலகத்தையும் நிறுவ வேண்டியிருக்கலாம். நீங்கள் அனகோண்டா பைத்தானைப் பயன்படுத்துகிறீர்கள் என்றால், ``conda`` கட்டளையுடன் இரண்டையும் நிறுவலாம். உங்கள் கணினியின் சொந்த பைதான் மொழிபெயர்ப்பாளரைப் பயன்படுத்தினால், ``pip`` கட்டளையைப் பயன்படுத்தி ``pydot`` ஐ நிறுவவும், உங்கள் கணினியின் சொந்த தொகுப்பு நிர்வாகியைப் பயன்படுத்தி ``graphviz`` ஐ நிறுவவும் (எ.கா. ``yum``, ``apt``, ``dnf``, ``brew``, போன்றவை).
tr_tr: ***Başlamadan önce***: DAG çizim yordamı için ``pydot`` ve ``graphviz`` kütüphanelerini kurmanız gerekebilir. Eğer Anaconda Python kullanıyorsanız ``conda`` komutu ile ikisini de kurabilirsiniz. Eğer sisteminizin yerel Python yorumlayıcısını kullanıyorsanız ``pip`` komutu kullanarak ``pydot`` u ve sisteminizin yerel paket yöneticisini (örneğin ``yum``, ``apt``, ``dnf``, ``brew``, vb.) kullanarak ``graphviz`` i kurun.

source: PassManager object
bn_bn: PassManager জিনিস (অবজেক্ট)
es_un: Objeto PassManager
fr: L'objet PassManager
id: Object PassManager
it_it: L'oggetto PassManager
ja: パスマネージャーオブジェクト
ko_kr: PassManager 객체
pt_un: Objeto gerenciador de passes
ru_ru: Объект PassManager
ta_in: PassManager பொருள்
tr_tr: PassManager nesnesi

source: Lets you specify the set of passes you want.
bn_bn: প্রয়োজনমতো ছাড়পত্রের দল এর দ্বারা নির্দেশ করা যায়।
es_un: Te permite especificar el conjunto de pases que quieres.
fr: Il permet de spécifier le nombre de passes désirées.
id: Memungkinkan Anda menentukan set dari pass yang Anda inginkan.
it_it: Consente di specificare l'insieme di pass che si desidera utilizzare.
ja: 必要なパスのセットが指定できます。
ko_kr: 원하는 패스 세트를 지정한다.
pt_un: Permite que você especifique o conjunto de passes desejados.
ru_ru: Позволяет указать желаемый набор проходов.
ta_in: நீங்கள் விரும்பும் பாஸின் தொகுப்பைக் குறிப்பிட உங்களை அனுமதிக்கிறது.
tr_tr: İstediğiniz geçiş kümesini belirtmenize izin verir.

source: All of Qiskit’s transpiler passes are accessible from ``qiskit.transpiler.passes``.
bn_bn: Qiskit -এর সমস্ত ট্রান্সপাইলার পাস ``qiskit.transpiler.passes`` থেকে পাওয়া যাবে।
es_un: Todos los pases al transpilador de Qiskit son accesibles con ``qiskit.transpiler.passes``.
fr: La liste des types de passes disponibles pour le transpileur de Qiskit peut être accédée à l'aide de ``qiskit.transpiler.passes``.
it_it: Tutte le pass di Qiskit sono accessibili utilizzando ``qiskit.transpiler.passes``.
ko_kr: 모든 키스킷의 트랜스파일러 패스는 ``qiskit.transpiler.passes`` 로 부터 불러올 수 있다.
ru_ru: Все проходы транспайлера доступны в ``qiskit.transpiler.passes``.
ta_in: Qiskit ட்டின் டிரான்ஸ்பைலர் பாஸ்கள் அனைத்தும் ``qiskit.transpiler.passes`` இலிருந்து அணுகக்கூடியவை.
tr_tr: Tüm Qiskit'in transpiler geçişlerine ``qiskit.transpiler.passes`` adresinden erişilebilmektedir.

source: Different Variants of the Same Pass
bn_bn: একই ছাড়পত্রের বিভিন্ন রূপ।
es_un: Diferentes Variantes del Mismo Pase
fr: Différentes variétés d'une même passe
id: Perbedaan Jenis dari Pass yang Sama
it_it: Diverse Varianti della Stessa Pass
ja: 同じパスの異なる実装
ko_kr: 동일한 패스의 다양한 변형
pt_un: Diferentes variações do mesmo passe
ru_ru: Вариабельность проходов
ta_in: ஒரே பாஸின் வெவ்வேறு மாறுபாடுகள்
tr_tr: Aynı Geçişin Farklı Çeşitleri
