Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/04_transpiler_passes_and_passmanager.po
Languages: bn_bn, es_un, fr, id, it_it, ja, ko_kr, pt_un, ru_ru, ta_in, tr_tr

source: By default Python Standard Logging only prints log messages at the ``WARNING``, ``ERROR``, or ``CRITICAL`` log levels. Since none of the logs emitted by the transpiler use these log levels (they’re all informative) you need to configure logging.
bn_bn: সাধারণতঃ Python -এর নিজস্ব ঘটনাপঞ্জি তিনরকমের ঘটনার হিসেব রাখে, ``WARNING``, ``ERROR``, আর ``CRITICAL``। কিন্তু ট্রান্সপাইলারের ঘটনা এই তিনধরণের সাথে মেলে না (কারণ ট্রান্সপাইলার কেবল তথ্যভিত্তিক ঘটনা পাঠায়)। সেজন্য এই নিজস্ব ঘটনাপঞ্জিকে একটু সাজিয়ে নিতে হয়।
es_un: Por defecto, el Logging Estándar de Python solo imprime mensajes en los niveles de registro ``WARNING``, ``ERROR``, o ``CRITICAL``. Ya que ninguno de los registros emitidos por el transpilador usa estos niveles de registro (todos son informativos) tienes que configurar logging.
fr: Par défaut la bibliothèque de journalisation standard de Python ne produit que les messages de niveau ``WARNING``, ``ERROR`` ou ``CRITICAL``. Dans la mesure où aucun des messages générés par le transpileur n'utilise ces niveaux (ils sont tous informatifs) il faut reconfigurer les paramètres de journalisation.
it_it: Come impostazione predefinita, i livelli di log dei messaggi visualizzati della libreria di logging Standard di Python sono solo ``WARNING``, ``ERROR``, o ``CRITICAL``. Dato che nessuno dei log prodotti dal transpiler utilizza questi livelli (sono tutti di tipo informativo), è necessario configurare il logging.
ko_kr: 기본적으로 Python 표준 로깅은 ``WARNING``, ``ERROR``, 혹은 ``CRITICAL`` 로그 수준에서만 로그 메세지를 출력한다. 트랜스파일러에서 내보낸 로그는 이러한 로그 수준을 사용하지 않으므로 (모든 정보를 제공하기에) 로깅을 구성해야 한다.
ru_ru: По умолчанию стандартное ведение журнала Python включает сообщения уровней ``WARNING``, ``ERROR``, или ``CRITICAL``. Так как ни одно сообщение о работе транспайлера не относится к этом уровням (они все информативные), нужно выполнить предварительную настройку.
ta_in: இயல்பாக பைதான் ஸ்டாண்டர்ட் உள்நுழைவு பதிவு செய்திகளை ``WARNING``, ``ERROR``, அல்லது ``CRITICAL`` பதிவு நிலைகளில் மட்டுமே அச்சிடுகிறது. டிரான்ஸ்பைலரால் உமிழப்படும் பதிவுகள் எதுவும் இந்த பதிவு நிலைகளைப் பயன்படுத்துவதில்லை (அவை அனைத்தும் தகவலறிந்தவை) நீங்கள் பதிவை உள்ளமைக்க வேண்டும்.
tr_tr: Varsayılan olarak Python Standart Günlük Kaydı, günlük iletilerini yalnızca ``WARNING``, ``ERROR`` veya ``CRITICAL`` günlük düzeylerinde yazdırır. Transpiler tarafından yayılan günlüklerin hiçbiri bu günlük düzeylerini kullanmadığından (hepsi bilgilendirici) günlük kaydını yapılandırmanız gerekir.

source: The simplest way to do this is to just run:
bn_bn: এটা করার সবচেয়ে সহজ উপায় হল:
es_un: La forma más sencilla de hacer esto es simplemente ejecutar:
fr: La manière la plus simple d'y parvenir est d'executer :
id: Cara paling sederhana untuk melakukannya adalah hanya menjalankan:
it_it: Il modo più semplice per farlo è eseguire:
ja: 最も簡単な方法は次を実行することです:
ko_kr: 이를 수행하는 가장 간단한 방법은 다음을 실행하는 것이다.
pt_un: A maneira mais simples de fazer isto é apenas executar:
ru_ru: Проще всего сделать это, запустив:
ta_in: இதைச் செய்வதற்கான எளிய வழி ஓடுவதுதான்:
tr_tr: Bunu yapmanın en basit yolu sadece şunu çalıştırmaktır:

source: The ``basicConfig()`` function (see the docs here: https://docs.python.org/3/library/logging.html#logging.basicConfig) configures a root handler and formatter. We also specify the `log level <https://docs.python.org/3/library/logging.html#levels>`__ to display with the ``level`` kwarg. Setting it to a level will also include and higher levels. For example, if you set it to ``'INFO'`` in addition to the ``INFO`` level this will also include the ``WARNING``, ``ERROR``, and ``CRITICAL`` log levels.
bn_bn: ``basicConfig()`` ফাংশনটি (এখানে পুরো তথ্য দেখো: https://docs.python.org/3/library/logging.html#logging.basicConfig) মূল নিয়ন্ত্রক ও বিন্যাসককে সাজায়। আমরা কোন `log level <https://docs.python.org/3/library/logging.html#levels>`__ টা দেখাবে সেটাও ``level`` kwarg এর দ্বারা বলে দিই। নিম্নস্তরের ঘটনাপঞ্জি দেখতে চাইলে তার সঙ্গে উপরস্তরের সব ঘটনাপঞ্জি আসে। উদাহরণস্বরূপ, কেউ যদি ``'INFO'`` স্তরের ঘটনাপঞ্জি দেখতে চায়, এর সাথে ``WARNING``, ``ERROR`` এবং ``CRITICAL`` স্তরের ঘটনাপঞ্জিও দেখাবে।
es_un: La función ``basicConfig()`` (ver la documentación aquí: https://docs.python.org/3/library/logging.html#logging.basicConfig) configura un controlador raíz y un formateador. También especificamos el `nivel de registro <https://docs.python.org/3/library/logging.html#levels>`__ a mostrar con el kwarg ``level``. Configurarlo a un nivel también va a hacer que incluya los niveles más altos. Por ejemplo, si lo configuras al nivel ``'INFO'`` además del nivel ``INFO`` esto también va a incluir los niveles de registro ``WARNING``, ``ERROR``, and ``CRITICAL``.
fr: La fonction basicConfig() (voir la documentation ici: https://docs.python.org/3/library/logging.html#logging.basicConfig) configure un capteur et un formateur de message. Nous spécifions également le `niveau de journal <https://docs.python.org/3/library/logging.html#levels>`__ à afficher avec l'argument de mot clef level. Le choix d'un niveau de journalisation implique la journalisation des niveaux supérieurs. Par exemple, si on règle le niveau de journalisation ``INFO``, alors en plus de ce niveau on récupèrera les messages des niveaux supérieurs : ``WARNING``, ``ERROR``, et ``CRITICAL``.
id: Fungsi ``basicConfig()`` (lihat dokumentasinya di sini: https://docs.python.org/3/library/logging.html#logging.basicConfig) mengonfigurasi penangan dan pemformat dasar. Kita juga menentukan `tingkat log <https://docs.python.org/3/library/logging.html#levels>`__ untuk ditampilkan bersama kwarg ``level``. Mengatur itu ke suatu tingkat juga akan mencakup tingkatan yang lebih tinggi. Sebagai contoh, jika Anda mengatur itu ke ``'INFO'``, selain tingkat ``INFO`` akan juga dicakup tingkatan ``WARNING``, ``ERROR``, dan ``CRITICAL``.
it_it: La funzione ``basicConfig()`` (vedere i documenti presenti al seguente link: https://docs.python.org/3/library/logging.html#logging.basicConfig) va a configurare un root handler e formatter. Andiamo a specificare anche `il livello di log <https://docs.python.org/3/library/logging.html#levels>`__ per visualizzare il kwarg ``level``. Impostarlo su un livello includerà anche i livelli superiori. Per esempio, impostando ``'INFO'``, oltre al livello ``'INFO'`` verrano inclusi anche i livelli di log ``WARNING``, ``ERROR``, e ``CRITICAL``.
ja: ``basicConfig()`` 関数 (ドキュメントは以下を参照してください: https://docs.python.org/3/library/logging.html#logging.basicConfig) ルートハンドラーとフォーマッタを設定します。ここでは `ログレベル <https://docs.python.org/3/library/logging.html#levels>`__ を ``level`` kwarg で設定しています。特例のレベルに設定するとより高位のレベルも含まれます。例えば、 ``INFO`` に設定すると、 ``INFO`` レベルだけではなく、 ``WARNING`` 、 ``ERROR`` 、 及び ``CRITICAL`` ログレベルも含まれます。
ko_kr: ``basicConfig()`` 함수 (다음의 문서를 참고하라: https://docs.python.org/3/library/logging.html#logging.basicConfig) 는 루트 핸들러와 포매터를 구성한다. 또한, `로그 레벨 (log level) <https://docs.python.org/3/library/logging.html#levels>`__ 을 지정해 ``level`` kwarg와 함께 표시할 수 있다. 특정 레벨로 설정한다면 그 레벨의 상위 레벨들도 포함시킬 것이다. 예를 들어, ``'INFO'`` 와 ``INFO`` 레벨로 설정한다면 이는 ``WARNING``, ``ERROR``, 그리고 ``CRITICAL`` 로그 레벨들도 포함시킬 것이다.
pt_un: A função ``basicConfig()`` (veja os docs aqui: https://docs.python.org/3/library/logging.html#logging.basicConfig) configura um manipulador de raiz e formatador. Também especificamos o `nível de log <https://docs.python.org/3/library/logging.html#levels>` __ para exibir com o ``level`` kwarg. Fixá-lo em um nível, também, incluirá níveis mais altos. Por exemplo, se configurar para ``'INFO'``, além do nível ``INFO``, este incluirá, também, os níveis de log ``WARNING``, ``ERROR``, e ``CRITICAL``.
ru_ru: Функция ``basicConfig()`` (см. документацию здесь: https://docs.python.org/3/library/logging.html#logging.basicConfig) настраивает корневой обработчик и форматирование. Кроме того, укажем `уровень логирования <https://docs.python.org/3/library/logging.html#levels>`__ с помощью именованного аргумента ``level``. Установка определенного уровня автоматически включает и все более высокие. Например при выборе ``'INFO'`` помимо него будут присутствовать сообщения уровней ``WARNING``, ``ERROR``, и ``CRITICAL``.
ta_in: அவர் ``basicConfig()`` செயல்பாடு (இங்கே ஆவணங்களைக் காண்க: https://docs.python.org/3/library/logging.html#logging.basicConfig) ஒரு ரூட் ஹேண்ட்லர் மற்றும் வடிவமைப்பாளரை உள்ளமைக்கிறது. ``level`` குவார்க்குடன் காண்பிக்க `log level <https://docs.python.org/3/library/logging.html#levels>`__ ஐயும் குறிப்பிடுகிறோம். அதை ஒரு நிலைக்கு அமைப்பது மேலும் உயர் நிலைகளையும் உள்ளடக்கும். எடுத்துக்காட்டாக, நீங்கள் அதை ``INFO`` நிலைக்கு கூடுதலாக ``'INFO`` என அமைத்தால், இதில் ``WARNING``, ``ERROR``, மற்றும் ``CRITICAL`` பதிவு நிலைகளும் அடங்கும்.
tr_tr: ``basicConfig()`` işlevi (buradaki dokümanlara bakın: https://docs.python.org/3/library/logging.html#logging.basicConfig) bir kök işleyici ve biçimlendirici yapılandırır. Ayrıca ``level`` kwarg ile görüntülenmesi için ``log level <https://docs.python.org/3/library/logging.html#levels>`__ belirtiyoruz. Bir düzeye ayarlamak da daha yüksek seviyeleri içerecektir. Örneğin, ``INFO`` seviyesine ek olarak ``'INFO'`` a ayarlarsanız, bu ``WARNING``, ``ERROR``, ve ``CRITICAL`` kayıt seviyelerini de içerecektir.

source: Now the python environment in this notebook is configured to emit log messages to stderr when you run the transpiler. For example:
bn_bn: এখন এই নোটবুকের Python পরিবেশে ট্রান্সপাইলার চলাকালীন stderr এ ঘটনাপঞ্জি রাখার জন্য প্রস্তুত। উদাহরণস্বরূপ:
es_un: Ahora el entorno de python de este cuaderno se configura para emitir mensajes de registro a stderr cuando corras el transpilador. Por ejemplo:
fr: A présent, l'environnement Python de ce notebook est configuré de manière à émettre les messages de journalisation vers la sortie standard lorsque le transpileur est exécuté. Par exemple :
id: Sekarang lingkungan python dalam notebook ini dikonfigurasi untuk mengeluarkan pesan catatan ke stderr saat Anda menjalankan transpiler. Sebagai contoh:
it_it: Ora l'invironment Python di questo notebook è configurato in modo da produrre messaggi di log sullo stderr quando si esegue il transpiler. Per esempio:
ja: このノートブックの Python 環境ではトランスパイラーを実行した時に stderr にログメッセージを出力するように設定されています。例えば：
ko_kr: 이제 이 노트북의 python 환경은 트랜스파일러를 실행할 때 로그 메세지를 stderr로 내보내도록 구성되었다. 예를 들면:
pt_un: Agora, o ambiente python neste notebook está configurado para emitir mensagens de log para stderr, quando você executar o transpilador. Por exemplo:
ru_ru: Теперь среда Python в этом блокноте настроена на вывод сообщений журнала на stderr при запуске транспайлера. Например:
ta_in: இப்போது இந்த நோட்புக்கில் உள்ள பைதான் சூழல் நீங்கள் டிரான்ஸ்பைலரை இயக்கும்போது stderr க்கு பதிவு செய்திகளை வெளியிடுவதற்கு கட்டமைக்கப்பட்டுள்ளது. உதாரணத்திற்கு:
tr_tr: Artık bu not defterindeki python ortamı, transpiler'ı çalıştırdığınızda günlük mesajlarını stderr'a gönderecek şekilde yapılandırılmıştır. Örneğin:

source: Note: basicConfig() will only work when called the first time it’s called. It detects if a root handler and formatter have already been setup (either by using an earlier basicConfig() call or otherwise) and does nothing if they have. Further adjustments will have to by interacting with the handler directly.
bn_bn: মনে রেখো: basicConfig() শুধু প্রথমবার ডাকার পর কাজ করবে। এটা খুঁজে দেখে যদি রুট হ্যান্ডলার ও ফরম্যাটার আগে থেকে বানানো আছে কিনা (আগে basicConfig() ডেকে বা অন্য পদ্ধতিতে) এবং থাকলে কোনো কাজ করে না। এর পরের সামঞ্জস্যকরণগুলো সরাসরি হ্যান্ডলারের সাথে পারস্পরিক ক্রিয়া করে করতে হবে।
es_un: Nota: basicConfig() solo va a funcionar cuando se ejecute por primera vez. Detecta si un controlador raíz y un formateador ya han sido configurados (ya sea mediante una llamada anterior a basicConfig() o de otra manera) y no hace nada si ya fueron configurados. Ajustes adicionales tendrán que interactuar directamente con el controlador.
fr: Remarque : basicConfig() ne fonctionne que lorsqu'il est appelé pour la première fois. Il détecte si un gestionnaire root et un programme de formatage ont déjà été configurés (soit à l'aide d'un appel basicConfig() antérieur ou autre) et ne fait rien s'ils l'ont été. D'autres ajustements devront être effectués en interagissant directement avec le gestionnaire.
it_it: Nota: basicConfig() funzionerà solo la prima volta che viene invocato. Rileva se un root handler e formatter sono già stati impostati (sia utilizzando una precedente chiamata a basicConfig() o in altri modi) e non esegue alcuna azione se lo sono stati. Ulteriori modifiche dovranno essere apportate interagendo direttamente con l'handler.
ko_kr: 참고: basicConfig()는 처음 호출될 때만 작동한다. 이는 루트 핸들러나 포맷터가 이미 설정되어 있는지 (이전의 basicConfig() 호출을 사용하던가 다른 방법으로) 감지하고, 둘 다 이미 설정되어 있는 경우 아무것도 수행하지 않는다. 추가적인 조정은 핸들러와 직접 상호작용하여 이루어질 수 있다.
ru_ru: Примечание: basicConfig() работает только при первом вызове. Прежде всего она определяет, настроены корневой обработчик и верстальщик (с помощью предыдущего вызова basicConfig() или как-то иначе) и ничего не делает, если это так. Дальнейшая корректировка производится путем прямого взаимодействия с обработчиком.
ta_in: குறிப்பு: basicConfig() முதன்முதலில் அழைக்கப்படும் போது மட்டுமே செயல்படும். ரூட் கையாளுநர் மற்றும் வடிவமைப்பாளர் ஏற்கனவே அமைக்கப்பட்டிருந்தால் (முந்தைய basicConfig() அழைப்பைப் பயன்படுத்துவதன் மூலம் அல்லது வேறுவிதமாக) இது கண்டறியப்பட்டு, அவை இருந்தால் எதுவும் செய்யாது. கையாளுபவருடன் நேரடியாக தொடர்புகொள்வதன் மூலம் மேலும் மாற்றங்கள் செய்யப்பட வேண்டும்.
tr_tr: Not: basicConfig() yalnızca ilk kez çağrıldığında çalışır. Bir kök işleyici ve biçimlendiricinin önceden kurulmuş olup olmadığını algılar (önceki bir basicConfig() çağrısı kullanarak veya başka bir şekilde) ve varsa hiçbir şey yapmaz. Daha fazla ayarlamanın, işleyiciyle doğrudan etkileşime girerek yapılması gerekecektir.

source: As you can clearly see here when calling ``transpile()`` it now prints 2 types of log messages. The first is at the ``INFO`` log level and come from the pass manager. These indicate each pass that was executed and how long that took. The second are at the ``DEBUG`` level and come from the StochasticSwap pass and describes the internal operation of that pass. It’s useful for debugging issues in the pass’s operation.
bn_bn: এখানে দেখা যাচ্ছে যে ``transpile()`` ফাংশনকে ডাকলে দুই ধরণের ঘটনাপঞ্জি তৈরী হয়। প্রথমে আসে ``INFO`` স্তরের ঘটনাপঞ্জি যেটা পাস ব্যবস্থাপকের (ম্যানেজার) কাছ থেকে আসে। এতে কোন কোন পাস সম্পন্ন হয়েছে ও কতক্ষন লেগেছে তা বলা থাকে। দ্বিতীয় স্তর ``DEBUG`` আসে StochasticSwap পাস থেকে এবং এতে পাসের আভ্যন্তরীন ক্রিয়াকলাপ বর্ণিত থাকে। পাসের ক্রিয়াকলাপের ত্রুটি নির্ণয় ও সংশোধন (ডিবাগিং) করতে এই ঘটনাপঞ্জি কাজে লাগে।
es_un: Como puedes ver claramente aquí, al ejecutar ``transpile()`` ahora imprime 2 tipos de mensaje de registro. El primero está al nivel de registro ``INFO`` y proviene del administrador de pases. Estos indican cada pase que se ejecutó y cuánto tiempo tomó. El segundo está al nivel de registro ``DEBUG`` y proviene del pase StochasticSwap y describe la operación interna de ese pase. Es útil para depurar problemas en la operación del pase.
fr: Comme vous pouvez le voir clairement, lorsque que nous appelons ``transpile()`` il se produit deux types de messages. D'une part ceux qui sont de niveau ``INFO`` en provenance du gestionnaire de passes. Ces derniers indiquent les passes qui sont exécutées et leur durée d'execution. D'autre part ceux de niveau ``DEBUG`` et qui proviennent de la passe StochasticSwap et qui en décrivent les opérations internes. Ils sont utiles pour corriger des problèmes de cette passe.
it_it: Come si vede chiaramente qui ora quando si invoca ``transpile()`` vengono stampati 2 tipi di messaggi di log. Il primo è a livello di log ``INFO`` e viene dal pass manager. Questi indicano ogni pass eseguita e quanto tempo ha impiegato. I secondi sono a livello ``DEBUG`` e provengono dalla pass StochasticSwap e ne descrivono il funzionamento interno. È utile nel caso di problemi di debug nel funzionamento della pass.
ru_ru: Теперь видно, что при вызове ``transpile()`` печатается уже два типа сообщений журнала. Первый тип относится к уровню ``INFO`` и за них отвечает менеджер. Здесь отмечается каждый выполненный проход и затраченное на это время. Сообщения второго типа соответствуют уровню``DEBUG``, возникают при работе StochasticSwap и описывают структуру данного конкретного прохода. Это будет полезно при его отладке.
ta_in: ``transpile()`` என்று அழைக்கும் போது நீங்கள் இங்கே தெளிவாகக் காணலாம், இது இப்போது 2 வகையான பதிவு செய்திகளை அச்சிடுகிறது. முதலாவது ``INFO`` பதிவு மட்டத்தில் உள்ளது மற்றும் பாஸ் மேலாளரிடமிருந்து வருகிறது. செயல்படுத்தப்பட்ட ஒவ்வொரு பாஸையும், எவ்வளவு நேரம் எடுத்தன என்பதையும் இவை குறிக்கின்றன. இரண்டாவது ``DEBUG`` மட்டத்தில் உள்ளது மற்றும் ஸ்டோகாஸ்டிக் ஸ்வாப் பாஸிலிருந்து வந்து அந்த பாஸின் உள் செயல்பாட்டை விவரிக்கிறது. பாஸின் செயல்பாட்டில் உள்ள பிழைத்திருத்தங்களுக்கு இது பயனுள்ளதாக இருக்கும்.
tr_tr: Burada açık bir şekilde görebileceğiniz gibi, ``transpile ()`` çağrılırken artık 2 tür günlük mesajı yazdırıyor. Bunlardan ilki, ``INFO`` kayıt seviyesindedir ve geçiş yöneticisinden gelir. Bunlar, gerçekleştirilen her geçişi ve bunun ne kadar sürdüğünü gösterir. İkincisi, ``DEBUG`` seviyesindedir ve StochasticSwap geçişinden gelir ve bu geçişin iç çalışmasını açıklar. Geçiş işlemindeki sorunları gidermek için kullanışlıdır.

source: Adjusting the log level for the transpiler
bn_bn: ট্রান্সপাইলারের ঘটনাপঞ্জিকে সাজিয়ে নেওয়া
es_un: Ajustando el nivel de registro para el transpilador
fr: Réglage du niveau de journalisation du transpileur
id: Menyesuakian tingkat log untuk transpiler
it_it: Regolazione del livello dei log del transpiler
ja: トランスパイラーのログレベルを調整する
ko_kr: 트랜스파일러에 대한 로그 레벨 조정하기
pt_un: Ajustando o nível do log para o transpiler
ru_ru: Настройка уровня логирования транспайлера
ta_in: டிரான்ஸ்பைலருக்கான பதிவு அளவை சரிசெய்தல்
tr_tr: Aktarıcı için günlük seviyesini ayarlama

source: The qiskit transpiler uses a single namespace ``qiskit.transpiler``, as used by ``logging.getLogger('qiskit.transpiler')``. This makes it very easy to adjust the log level for just the transpiler. For example if you only wish to see log messages at the INFO level or above you can run:
bn_bn: Qiskit ট্রান্সপাইলার ``qiskit.transpiler`` নামের একটা নেমস্পেস ব্যবহার করে, যেভাবে ``logging.getLogger('qiskit.transpiler')`` এটা ব্যবহার করে। এর ফলে শুধু ট্রান্সপাইলারের জন্য ঘটনাপঞ্জিকে সহজেই নিজের মতো ঠিকঠাক করে নেওয়া যায়। উদাহরণস্বরূপ যদি কেউ তথ্য বা তার উপরের স্তরের ঘটনার পঞ্জি দেখতে চায় তাহলে সে ব্যবহার করবে:
es_un: El transpilador qiskit usa un solo espacio de nombres ``qiskit.transpiler``, como lo usa ``logging.getLogger('qiskit.transpiler')``. Esto hace que sea muy fácil ajustar el nivel de registro solamente para el transpilador. Por ejemplo, si solo desea ver los mensajes de registro en el nivel INFO o superior, puede ejecutar:
fr: Le transpileur qiskit utilise un espace de noms unique ``qiskit.transpiler``, tel qu'utilisé par ``logging.getLogger('qiskit.transpiler')``. Il est donc très facile de régler le niveau de le logging pour le transpilateur spécifiquement. Par exemple, si vous souhaitez seulement voir les messages de log au niveau INFO ou supérieur, vous pouvez exécuter :
it_it: Il transpiler di Qiskit utilizza un singolo namespace chiamato ``qiskit.transpiler``, come utilizzato da ``logging.getLogger('qiskit.transpiler')``. Questo rende molto semplice modificare il livello di log solo per il transpiler. Per esempio se si desidera visualizzare solo messaggi di log a livello INFO, è possibile eseguire:
ja: Qiskit トランスパイラーは、``logging.getLogger('qiskit.transpiler')`` で利用されているように、 単一のネームスペース ``qiskit.transpiler`` を利用しています。これによりトランスパイラー単独のログレベルを調整することが簡単に出来ます。例えば、INFO レベル以上のログメッセージだけを確認したい場合は、次のように実行できます：
ko_kr: qiskit transpiler는 ``logging.getLogger('qiskit.transpiler')`` 에서 사용하는 것처럼 단일 네임스페이스 ``qiskit.transpiler`` 를 사용한다. 이렇게 하면 transpiler만을 위해 로그 레벨을 조정하는 것이 매우 쉽다. 예를 들어, INFO 레벨 이상의 로그 메시지만 보려는 경우 다음을 실행할 수 있다.
pt_un: O transpilador qiskit usa um único namespace ``qiskit.transpiler``, como usado por ``logging.getLogger('qiskit.transpiler')``. Isso faz com que seja muito fácil ajustar o nível de log apenas para o transpiler. Por exemplo, se você deseja ver mensagens de log no nível INFO ou mais detalhadas você pode executar:
ru_ru: Единое пространство имен ``qiskit.transpiler``, используемое в ``logging.getLogger('qiskit.transpiler')``, позволяет легко настроить уровень журнала транспайлера. Например, если вы хотите видеть сообщения журнала на уровне INFO и выше, вы можете запустить:
ta_in: ``Logging.getLogger ('qiskit.transpiler')`` பயன்படுத்தும் Qiskit டிரான்ஸ்பைலர் ``qiskit.transpiler`` என்ற ஒற்றை பெயர்வெளியைப் பயன்படுத்துகிறது. இது டிரான்ஸ்பைலருக்கான பதிவு அளவை சரிசெய்ய மிகவும் எளிதாக்குகிறது. எடுத்துக்காட்டாக, நீங்கள் INFO மட்டத்தில் அல்லது அதற்கு மேல் பதிவு செய்திகளைக் காண விரும்பினால் மட்டுமே இயக்க முடியும்:
tr_tr: Qiskit aktarıcı, ``logging.getLogger('qiskit.transpiler')`` tarafından kullanılan tek bir ``qiskit.transpiler`` ad alanı kullanır. Bu, sadece aktarıcı için günlük seviyesini ayarlamayı kolaylaştırmaktadır. Örneğin, günlük iletilerini yalnızca INFO düzeyinde veya üstünde görmek istiyorsanız şunları çalıştırabilirsiniz:

source: Setting up logging to deal with parallel execution
bn_bn: সমান্তরাল গণনা সামলানোর জন্য ঘটনাপঞ্জি রাখার ব্যবস্থা করা
es_un: Configuración del registro para lidiar con la ejecución en paralelo
fr: Réglage de la journalisation pour gérer l'exécution en parallèle
id: Mengatur pencatatan untuk menangani eksekusi paralel
it_it: Impostazione del logging nel caso di esecuzione in parallelo
ja: 平行実行を扱うためのログ設定
ko_kr: 병렬 실행을 처리하기 위해 로깅 설정하기
pt_un: Configurando o log para trabalhar com execução paralela
ru_ru: Настройка логирования при параллельном выполнении
ta_in: இணையான செயல்பாட்டைச் சமாளிக்க பதிவுகளை அமைத்தல்
tr_tr: Paralel yürütme ile başa çıkmak için günlüğe kaydetmeyi ayarlama
