Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/04_transpiler_passes_and_passmanager.po
Languages: bn_bn, es_un, fr, id, it_it, ja, ko_kr, pt_un, ru_ru, ta_in, tr_tr

source: When running the transpiler with multiple circuits by default these circuits are transpiled in parallel. If you want to do this with logging enabled and be able to understand the output some additional steps are required.
bn_bn: যদি একাধিক বর্তনীর উপর ট্রান্সপাইলার চালানো হয় তাহলে এই ট্রান্সপাইলেশনগুলো সমান্তরালভাবে হয়। যদি এই সমান্তরাল গণনার ঘটনাপঞ্জি রাখতে হয় এবং সেই পঞ্জিকে বোধগম্য হতে হয় তাহলে আরো কিছু ধাপ করতে হয়।
es_un: Cuando se ejecuta el transpilador con múltiples circuitos, por defecto estos circuitos se transpilan en paralelo. Si deseas hacerlo con el logging (registro) habilitado y poder entender el mensaje de salida, se necesitan algunos pasos adicionales.
fr: Lorsque l'on execute le transpileur avec plusieurs circuits, le réglage par défaut fait que la transpilation de ces circuits se fait en parallèle. Si vous faites ceci avec la journalisation activée, et que vous voulez pouvoir comprendre la sortie, il y a quelques étapes supplémentaires à accomplir.
id: Saat menjalakan transpiler dengan beberapa sirkuit lazimnya sirkuit-sirkuit ini akan ditranspilkan dalam paralel. Jika anda ingin melakukan ini dengan pencatatan yang diaktifkan dan mengerti keluarannya, diperlukan beberapa langkah tambahan.
it_it: Quando si esegue il transpiler con più circuiti, per default questi vengono processati in parallelo. Se si desidera effettuare questa operazione avendo il logging abilitato ed essere in grado di interpretare l'output, sono necessari dei passaggi aggiuntivi.
ja: 複数の回路をトランスパイルする時にはデフォルトではこれらの回路は平行でトランスパイルされます。ログレベルを設定してこれを実行し、出力を理解できるようにするには追加のステップが必要です。
ko_kr: 기본적으로 여러 회로에서 트랜스파일러를 실행할 때 이러한 회로들은 병렬로 트랜스파일된다. 로깅이 활성화된 상태에서 이를 수행하고 출력을 이해할 수 있으려면 몇 가지 추가 단계가 필요하다.
pt_un: Ao executar o transpilador com vários circuitos, por padrão, estes circuitos são transpilados em paralelo. Se você deseja fazer isto com o registro de log ativado e ser capaz de entender a saída, algumas etapas adicionais são necessárias.
ru_ru: При запуске транспайлера с несколькими цепями, по умолчанию они обрабатываются параллельно. Если вы не хотите запутаться в сообщениях, потребуется несколько дополнительных шагов.
ta_in: இயல்புநிலையாக பல சுற்றுகளுடன் டிரான்ஸ்பைலரை இயக்கும் போது இந்த சுற்றுகள் இணையாக அனுப்பப்படுகின்றன. உள்நுழைவு இயக்கப்பட்டிருப்பதன் மூலம் இதைச் செய்ய விரும்பினால், வெளியீட்டைப் புரிந்து கொள்ள சில கூடுதல் படிகள் தேவை.
tr_tr: Transpiler çoklu devrelerle çalıştırıldığında varsayılan olarak bu devreler paralel olarak aktarılır. Bunu günlüğe kaydetme etkinken yapmak ve çıktıyı anlayabilmek istiyorsanız bazı ek adımlar gereklidir.

source: If you were just to enable logging as above and then pass ``transpile()`` multiple circuits you’ll get results that are difficult to decipher. For example:
bn_bn: যদি উপরের মতো শুধু ঘটনাপঞ্জি চালু করা দরকার তাহলে ``transpile()`` -কে এক বা একাধিক বর্তনীর উপর ডাকতে হবে। যদিও একাধিক বর্তনীর ক্ষেত্রে এই পঞ্জির অর্থোদ্ধার খুবই কঠিন। উদাহরণস্বরূপ:
es_un: Si habilitas el logging como se hizo arriba, y pasas ``transpile()`` a múltiples circuitos obtendrás resultados que son difíciles de descifrar. Por ejemplo:
fr: Si vous ne faisiez qu'activer la journalisation comme ci-dessus et que vous envoyez plusieurs circuits à ``transpile()``, vous obtiendrez des messages difficiles à interpréter. Par exemple :
it_it: Se si abilitasse il logging soltanto seguendo i passaggi sopra descritti e passando a ``transpile()`` più di un circuito, i risultati sarebbero difficili da decifrare. Per esempio:
ko_kr: 위와 같이 로깅을 활성화한 다음 ``transpile()`` 다중 회로를 통과하면 해독하기 어려운 결과를 얻을 수 있다. 예를 들면:
ru_ru: Если вы просто включите логирование, как делали это раньше, а затем отправите в ``transpile()`` несколько цепей, то получите результаты, которые трудно расшифровать. Например:
ta_in: மேலே குறிப்பிட்டுள்ளபடி உள்நுழைவை இயக்கி, ``transpile()`` பல சுற்றுகளை அனுப்பினால், புரிந்துகொள்ள கடினமாக இருக்கும் முடிவுகளைப் பெறுவீர்கள். உதாரணத்திற்கு:
tr_tr: Sadece yukarıdaki gibi günlüğe kaydetmeyi etkinleştirip ``transpile()``ı birden daha fazla devreye geçerseniz, deşifrelemesi zor sonuçlar alırsınız. Örneğin:

source: As you can see here we get log messages from all 3 circuits being transpiled together. There is no way to know which pass is part of which circuit’s transpilation. Luckily Python logging provides tools to deal with this. The simplest one is to just change the `log formatter <https://docs.python.org/3/library/logging.html#logging.Formatter>`__ so that includes additional information so we can associate a log message with the process it came from.
bn_bn: দেখা যাচ্ছে যে আমরা ৩ টে বর্তনীর (সার্কিট) ট্রান্সপাইলেশন ঘটনাপঞ্জি একসঙ্গে পাওয়া গেলো। এর থেকে কোন পাস কোন বর্তনীর (সার্কিট) ট্রান্সপাইলেশনের জন্য তা বোঝা সম্ভব না। সৌভাগ্যবশত, Python নিজের ঘটনাপঞ্জি এই অসুবিধা দূর করার যন্ত্রপাতি দেয়। সবচেয়ে সহজ পদ্ধতি হলো ঘটনাপঞ্জি বিন্যাসকে বদলে ফেলা `log formatter <https://docs.python.org/3/library/logging.html#logging.Formatter>`__ যাতে এতে আরো কিছু তথ্য থাকে যার থেকে বোঝা যাবে কোন প্রক্রিয়ায় কোন ঘটনা ঘটেছে।
es_un: Como puedes ver, aquí obtenemos mensajes de registro de los 3 circuitos que han sido transpilados juntos. No hay manera de saber cuál pase es parte de la transpilación de qué circuito. Por suerte, el logging de Python proporciona herramientas para lidiar con esto. La mejor manera es simplemente cambiar el `formateador de registro <https://docs.python.org/3/library/logging.html#logging.Formatter>`__ para que incluya información adicional, para que podamos asociar los mensajes de registro al proceso que lo emitió.
fr: Comme on peut le voir ici, nous obtenons des messages de journal des 3 circuits qui sont transpilés ensemble. Il n'y a pas de moyen de savoir de savoir à quel circuit correspond une passe. Par chance Python fournit des outils qui peuvent nous aider. Le plus simple est de changer le `formateur du journal <https://docs.python.org/3/library/logging.html#logging.Formatter>`__ de manière à inclure les informations supplémentaires permettant d'associer un message au processus dont il provient.
it_it: Come si può vedere, qui si ottengono messaggi di log da tutti e 3 i circuiti lavorati insieme dal transpiler. Non c'è modo di conoscere l'associazione tra il circuito sottoposto al processo del transpiler e le pass. Per fortuna Python fornisce strumenti che permettono di affrontare questa limitazione. La soluzione più semplice è quella di modificare solamente il `log formatter <https://docs.python.org/3/library/logging.html#logging.Formatter>`__ in modo da includere informazioni aggiuntive che rendono possibile associare il messaggio di log al processo che lo ha generato.
ru_ru: Как видно здесь, мы получаем общий журнал сообщений о транспиляции всех трех цепей сразу. При этом невозможно определить, какую из них преобразует каждый из записанных проходов. Однако с этим может помочь настройка логирования Python. Проще всего изменить формат `логов <https://docs.python.org/3/library/logging.html#logging.Formatter>`__ так, чтобы они включали в себя дополнительную информацию для определения, какой из процессов записал конкретное сообщение.
ta_in: நீங்கள் இங்கே பார்க்க முடியும் என அனைத்து 3 சுற்றுகளிலிருந்தும் பதிவு செய்திகள் ஒன்றாக அனுப்பப்படுகின்றன. எந்த சுற்றுவட்டத்தின் இடமாற்றத்தின் ஒரு பகுதி எந்த பாஸ் என்பதை அறிய வழி இல்லை. அதிர்ஷ்டவசமாக பைதான் பதிவுசெய்தல் இதைச் சமாளிப்பதற்கான கருவிகளை வழங்குகிறது. எளிமையானது `log formatter <https://docs.python.org/3/library/logging.html#logging.Formatter>`__ மாற்றுவதால் கூடுதல் தகவல்களை உள்ளடக்கியது, எனவே ஒரு பதிவு செய்தியை நாம் இணைக்க முடியும் செயல்முறை அது வந்தது.
tr_tr: Burada görebileceğiniz gibi, birlikte transpile edilen 3 devrenin tümünden günlük mesajları alıyoruz. Hangi geçişin hangi devrenin transpilasyonunun bir parçası olduğunu bilmenin bir yolu yoktur. Neyse ki Python günlüğü bununla başa çıkmak için araçlar sağlamaktadır. Bunlardan en basit olanı `log formatter <https://docs.python.org/3/library/logging.html#logging.Formatter>`__ değiştirmektir, böylece bir günlük iletisini kaynaklandığı süreç ile ilişkilendirebiliriz.

source: Then rerun the ``transpile()`` call and see the new log formatter.
bn_bn: এরপর ``transpile()`` আবার চালালে নতুন ঘটনাপঞ্জির বিন্যাসককে দেখা যাবে।
es_un: Luego, vuelve a ejecutar ``transpile()`` y observa el nuevo formateador de registro.
fr: Vous pouvez alors recommencer l'execution de ``transpile()`` et voir le nouveau journal de messages.
id: Kemudian jalankan kembali ``transpile()`` dan kita dapat melihat catatan peformat yang baru.
it_it: Quindi ri-eseguiamo la chiamata ``transpile()`` e vediamo il nuovo formato del log.
ja: 次に、 ``transpile()`` 呼び出しを再実行し新しいログフォーマッタを確認します。
ko_kr: 그런 다음 ``transpile()`` 호출을 다시 실행하고 새 로그 포맷터를 확인한다.
pt_un: Em seguida, reexecute a chamada ``transpile()`` e veja o novo formatador de log.
ru_ru: Перезапустим ``transpile()`` и посмотрим на новый формат журнала.
ta_in: பின்னர் ``transpile()`` அழைப்பை மீண்டும் இயக்கி புதிய பதிவு வடிவமைப்பைக் காண்க.
tr_tr: Ardından ``transpile()`` çağrısını yeniden çalıştırın ve yeni günlük biçimlendiricisini görün.

source: Now the format for the log messages has been changed and it includes a process name for each of the transpilation processes so it’s at least clear which log messages go together.
bn_bn: এখন ঘটনাপঞ্জির গঠন বদলে গেছে। এখন এটি প্রতি ট্রান্সপাইলেশন প্রক্রিয়ার জন্য প্রক্রিয়ার নাম দেখায় যাতে কোন ঘটনা কোন প্রক্রিয়াতে হয়েছে তা বোঝা যায়।
es_un: Ahora el formato de mensajes de registro ha sido cambiado e incluye el nombre del proceso para cada proceso de transpilación para que por lo menos sea claro que mensajes de registro van juntos.
fr: A présent, le format des messages du journal a été modifié et il inclut le nom du process de transpilation qui l'émet, ainsi il est facile de voir quels sont les messages qui ont un lien entre eux.
it_it: Ora il formato dei messaggi di log è stato modificato ed include il nome del processo per ogni passaggio della trasformazione del transpiler, in modo che sia almeno chiaro quali messaggi di log fanno parte di uno stesso processo.
ko_kr: 이제 로그 메시지의 형식이 변경되었으며 각 변환 프로세스에 대한 프로세스 이름이 포함되어 있으므로 적어도 어떤 로그 메시지가 함께 연결되는지 명확하게 알 수 있다.
ru_ru: Теперь вид логов изменился и включает в себя имена всех процессов транспиляции, что, по крайней мере, проясняет, какие из сообщений связаны друг с другом.
ta_in: இப்போது பதிவு செய்திகளுக்கான வடிவம் மாற்றப்பட்டுள்ளது, மேலும் இது ஒவ்வொரு பரிமாற்ற செயல்முறைகளுக்கும் ஒரு செயல்முறை பெயரை உள்ளடக்கியது, எனவே எந்த பதிவு செய்திகளும் ஒன்றாக செல்கின்றன என்பது தெளிவாகிறது.
tr_tr: Artık günlük mesajlarının formatı değiştirildi ve aktarım işlemlerinin her biri için bir işlem adı içeriyor, bu nedenle en azından hangi günlük mesajlarının bir araya geldiği açık.

source: There are many different options for how you can configure, this example is pretty limited. Refer to the documentation for more examples and options to build more sophisticated use cases that suit your specific use case or preferences.
bn_bn: এই উদাহরণটি খুবই ছোট। এছাড়াও সাজানোর জন্য আরো প্রচুর বিকল্প আছে। নিজের প্রয়োজনমতো বানানোর জন্য মূল নথিতে আরো বিকল্প ও উদাহরণ দেওয়া আছে।
es_un: Hay muchas opciones de cómo puedes configurar, este ejemplo es bastante limitado. Consulta la documentación para más ejemplos y opciones para construir casos de uso más sofisticados que se adapten a tu caso específico o a tus preferencias.
fr: Il y a de nombreuses manières de paramétrer le contenu du journal de messages. L'exemple précédent est assez limité, vous pouvez vous reporter à la documentation pour d'autres examples et options pour construire des configurations qui correspondent à vos préférences et aux cas d'usage que vous avez.
id: Ada banyak pilihan untuk bagaimana Anda mengonfigurasi, contoh di sini sangat terbatas. Anda dapat mengacu pada dokumentasi untuk contoh lebih banyak dan opsi untuk pembuatan lebih canggih yang sesuai dengan penggunaan yang Anda butuhkan atau inginkan.
it_it: Esistono molte opzioni di configurazione, questo esempio è molto limitato. Si faccia riferimento alla documentazione per più esempi e opzioni per costruire use case più sofisticati e adatti a particolari esigenze o preferenze.
ja: 設定には多くの異なるオプションがあります。この例ではかなり限られています。より多くの例とオプションについてはドキュメントを参照し、あなたの特別なユースケースと好みに応じてより洗練されたユースケースをビルド出来るようにしてください。
pt_un: Existem muitas opções diferentes, para como você pode configurar, este exemplo é bem limitado. Consulte a documentação para obter mais exemplos e opções para construir casos de uso mais sofisticados, que se adequam ao seu caso de uso ou preferências específicas.
ru_ru: Существует много различных вариантов настроек, так что нами рассмотрен лишь один из частных примеров. Дополнительные примеры и опции более сложных вариантов использования, которые могут быть полезны, вы можете посмотреть в документации.
ta_in: நீங்கள் எவ்வாறு கட்டமைக்க முடியும் என்பதற்கு பல வேறுபட்ட விருப்பங்கள் உள்ளன, இந்த எடுத்துக்காட்டு மிகவும் குறைவாகவே உள்ளது. உங்கள் குறிப்பிட்ட பயன்பாட்டு வழக்கு அல்லது விருப்பங்களுக்கு ஏற்றவாறு அதிநவீன பயன்பாட்டு நிகழ்வுகளை உருவாக்க கூடுதல் எடுத்துக்காட்டுகள் மற்றும் விருப்பங்களுக்கு ஆவணங்களைப் பார்க்கவும்.
tr_tr: Nasıl yapılandırabileceğiniz konusunda birçok farklı seçenek vardır, bu örnek oldukça sınırlıdır. Özel kullanım durumunuza veya tercihlerinize uygun daha karmaşık kullanım örnekleri oluşturmak için daha fazla örnek ve seçenek için belgelere bakın.

source: Each node is an instance of the ``DAGNode`` class. Let’s examine the information stored in the second op node.
it_it: Ogni nodo è un'istanza della classe ``DAGNode``. Esaminiamo le informazioni memorizzate nel secondo nodo di operazione.
ko_kr: 각 노드는 ``DAGNode`` 클래스의 인스턴스이다. 두 번째 op 노트에 저장된 정보를 살펴보자.
ta_in: ஒவ்வொரு முனையும் ``DAGNode`` வகுப்பின் ஒரு எடுத்துக்காட்டு. இரண்டாவது ஒப் முனையில் சேமிக்கப்பட்ட தகவல்களை ஆராய்வோம்.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/04_transpiler_passes_and_passmanager.ipynb>`_.
ko_kr: `IBM 퀀텀 랩 <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/04_transpiler_passes_and_passmanager.ipynb>`_ 에서 대화식으로 실행하시오.

source: All of Qiskit's transpiler passes are accessible from ``qiskit.transpiler.passes``.
ja: Qiskit のトランスパイラーパスは、すべて ``qiskit.transpiler.passes`` から取得できます。

source: Let's start by building a simple circuit, and examining its DAG.
ja: 簡単な回路を構築して、DAG を調べてみましょう。

source: **c. Add an operation to the front:**
ja: **c. 前に操作を追加します:**

source: **d. Substitute a node with a subcircuit:**
ja: **d. ノードをサブ回路で置き換えます:**

source: Let's test this pass on a small example circuit.
ja: このパスを小さな回路例で試してみましょう。
