Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/05_pulse_gates.po
Languages: bn_bn, es_un, fr_fr, id_id, ja_jp, ko, pt_un, ru_ru, ta_in, tr

source: This page was generated from `tutorials/circuits_advanced/05_pulse_gates.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/circuits_advanced/05_pulse_gates.ipynb`__ থেকে উৎপন্ন হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/circuits_advanced/05_pulse_gates.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/circuits_advanced/05_pulse_gates.ipynb`__.
id_id: Halaman ini dibuat dari ` tutorials/circuits_advanced/01_advanced_circuits.ipynb ` __.
ja_jp: 当ページは `tutorials/circuits_advanced/05_pulse_gates.ipynb`__ から生成されました。
ko: 이 페이지는 `tutorials/circuits_advanced/05_pulse_gates.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada de `tutorials/circuits_advanced/05_pulse_gates.ipynb`__.
ru_ru: Страница создана на основе `tutorials/circuits_advanced/05_pulse_gates.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/circuits_advanced/05_pulse_gates.ipynb`__ இருந்து உருவாக்கப்பட்டது.
tr: Bu sayfa `tutorials/circuits_advanced/05_pulse_gates.ipynb`__ adresinden oluşturulmuştur.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/05_pulse_gates.ipynb>`_.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/05_pulse_gates.ipynb>`_ でインタラクティブに実行します。
ta_in: இயங்குநிலை தொடர்புக்கு `IBM குவாண்டம் ஆய்வகம் <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/05_pulse_gates.ipynb>`_.

source: Pulse gates
bn_bn: পাউলি যুক্তিবর্তনী (গেইট)
es_un: Compuertas de pulso
fr_fr: Portes d'impulsions
id_id: Gerbang Pulsa
ja_jp: パルスゲート
ko: 펄스 게이트들
pt_un: Portas de pulso
ru_ru: Импульсные вентили
ta_in: பல்ஸ் கேட்கள்
tr: Atım kapıları

source: Most quantum algorithms can be described with circuit operations alone. When we need more control over the low-level implementation of our program, we can use *pulse gates*. Pulse gates remove the constraint of executing circuits with basis gates only, and also allow you to override the default implementation of any basis gate.
bn_bn: অধিকাংশ কোয়ান্টাম সমাধান পদ্ধতি শুধু বর্তনী (সার্কিট) ক্রিয়াকলাপ (অপারেশন) দিয়ে বোঝানো যায়। আমাদের প্রোগ্রামের নিম্নস্তর রূপের ওপর আরো নিয়ন্ত্রণ পেতে হলে আমরা *তড়িৎস্পন্দন বা পালস যুক্তিবর্তনী (গেইট)* ব্যবহার করতে পারি। বর্তনী (সার্কিট) শুধু বেসিস বা ভিত্তি যুক্তিবর্তনী (গেইট) দিয়ে চালাতে হবে এমন নিষেধাজ্ঞা তড়িৎস্পন্দন বা পালস যুক্তিবর্তনী (গেইট) তুলে দেয় এবং যেকোনো বেসিস বা ভিত্তি যুক্তিবর্তনী (গেইট) এর সাধারণ রূপায়নকে পরিবর্তন করতে দেয়।
es_un: La mayoría de los algoritmos cuánticos se pueden describir solo con operaciones de circuito. Cuando necesitamos más control sobre la implementación de bajo nivel de nuestro programa, podemos usar *compuertas de pulso*. Las compuertas de pulso eliminan la restricción de ejecutar circuitos solamente con compuertas base y también te permiten anular la implementación predeterminada de cualquier compuerta base.
fr_fr: La plupart des algorithmes quantiques peuvent être décrits sous forme de circuits contenant des opérations. Lorsque nous avons besoin d'un contrôle de bas niveau très précis nous pouvons utiliser les *portes d'impulsion*. Les portes d'impulsions enlèvent les contraintes liées à l'execution de circuits utilisant les portes de base uniquement, et permettent aussi de reprogrammer les portes de bases.
ja_jp: ほとんどの量子アルゴリズムは回路演算だけで記載できます。 プログラムの低レベル実装をより制御する必要がある場合は、*パルスゲート*を使用することができます。 パルスゲートは、基底ゲートのみで回路を実行するという制約を取り除き、任意の基底ゲートのデフォルト実装をオーバーライドすることを可能にします。
ko: 대부분의 양자 알고리즘은 회로 작동만으로 설명할 수 있다. 프로그램의 저수준 구현에 대한 제어가 필요할 때 *펄스 게이트* 를 사용할 수 있다. 펄스 게이트는 기본 게이트 만을 사용해 회로를 실행하는 제약을 뛰어넘어 어떤 기본 게이트라도 기본 구현된 것을 재정의할 수 있다
pt_un: A maioria dos algoritmos quânticos podem ser descritos, simplesmente, com operações de circuito. Quando precisamos de mais controle sobre a implementação de baixo nível do nosso programa, podemos usar *portas de pulso*. Portas de pulso removem a restrição de executar circuitos, apenas com portões de base, e, também permitem que você substitua a implementação padrão de qualquer portão de base.
ru_ru: Большинство квантовых алгоритмов можно описать цепями, состоящими из обычных операций. Однако доступен и более глубокий контроль низкоуровневой реализации программ с помощью *импульсных вентилей*. Они снимают ограничение на применение только базовых вентилей, и даже позволяют эти базовые вентили переопределить.
ta_in: சுற்று செயல்பாடுகளுடன் மட்டும் பெரும்பாலான குவாண்டம் வழிமுறைகளை விவரிக்க முடியும். எங்கள் திட்டத்தின் குறைந்த அளவிலான செயல்பாட்டில் எங்களுக்கு கூடுதல் கட்டுப்பாடு தேவைப்படும்போது, *pulse gates* பயன்படுத்தலாம். துடிப்பு வாயில்கள் அடிப்படை வாயில்களுடன் மட்டுமே சுற்றுகளை இயக்குவதற்கான தடையை நீக்குகின்றன, மேலும் எந்த அடிப்படை வாயிலின் இயல்புநிலை செயல்பாட்டை மேலெழுதவும் உங்களை அனுமதிக்கிறது.
tr: Çoğu kuantum algoritması, yalnızca devre işlemleriyle tanımlanabilir. Programımızın düşük seviyeli uygulaması üzerinde daha fazla kontrole ihtiyacımız olduğunda *atım geçitleri* kullanabiliriz. Atım kapıları, yalnızca temel geçitlerle devre yürütme kısıtlamasını ortadan kaldırır ve ayrıca herhangi bir temel geçidin varsayılan uygulamasını geçersiz kılmanıza izin verir.

source: Pulse gates allow you to map a logical circuit gate (e.g., ``X``) to a Qiskit Pulse program, called a ``Schedule``. This mapping is referred to as a *calibration*. A high fidelity calibration is one which faithfully implements the logical operation it is mapped from (e.g., whether the ``X`` gate calibration drives :math:`|0\rangle` to :math:`|1\rangle`, etc.).
bn_bn: তড়িৎস্পন্দন বা পালস যুক্তিবর্তনী (গেইট) এর দ্বারা একটা যুক্তিবর্তনীকে (লজিক গেট) (যেমন, ``X`` ) Qiskit তড়িৎস্পন্দন বা পালস প্রোগ্রামের (যাকে ``Schedule`` বলে) উপর চিত্রিত করা যায়। এই ম্যাপিংকে (চিত্রায়ন) *ক্রমাঙ্কন (ক্যালিব্রেশন)* বলে। একটা উচ্চ ক্রমাঙ্কন (ক্যালিব্রেশন) হলো যেটা উৎস ক্রিয়াকলাপকে (অপারেশন) বিশ্বস্তভাবে বানায় (যেমন ``X`` যুক্তিবর্তনী (গেইট) ক্রমাঙ্কন (ক্যালিব্রেশন) :math:`|0\rangle` -কে :math:`|1\rangle` -তে পরিবর্তন করে)।
es_un: Las compuertas de pulso te permiten mapear una compuerta de circuito lógico (por ejemplo, ``X``) a un programa de Qiskit Pulse, llamado ``Schedule``. Este mapeo se conoce como *calibración*. Una calibración de alta fidelidad es aquella que implementa fielmente la operación lógica desde la que está mapeada (por ejemplo, si la calibración de la compuerta ``X`` impulsa :math:`|0\rangle` a :math:`|1\rangle`, etc.).
fr_fr: Les portes d'impulsions vous permettent de faire correspondre une porte quantique (par exemple, ``X``) à un programme Qiskit Pulse, appelé ``Schedule``. Cette correspondance est appelée une *calibration*. Une calibration de haute fidélité est une calibration qui implémente fidèlement l'opération voulue (par exemple, la fidélité avec laquelle une porte ``X`` fait passer l'état de :math:`|0\rangle` à :math:`|1\rangle`, etc.).
id_id: Gerbang pulsa memungkinkan Anda untuk memetakan gerbang sirkuit logis (misalnya, ` ` X ` `) ke sebuah program Qiskit Pulse, yang disebut ` ` Jadwal ` `. Pemetaan ini disebut sebagai *kalibrasi *. Sebuah kalibrasi yang tinggi adalah salah satu yang dengan setia mengimplementasikan operasi logis itu dipetakan dari (misalnya, apakah kalibrasi ` ` X ` ` ` gerbang drive :math:` | 0\rsudut ` ke :math:` | 1\rsudut `, dll).
ja_jp: パルスゲートでは、論理回路ゲート(例: ``X``) を``Schedule``と呼ばれるQiskit Pulseプログラムにマッピングすることができます。このマッピングは *較正* と呼ばれます。忠実度の高い較正は、マッピングされた論理演算を忠実に実装するものです (例: ``X`` ゲート較正が :math:`|0\rangle` を :math:`|1\rangle` にするかどうかなど)。
ko: 펄스 게이트를 사용하면 논리 회로 게이트(예: ``X`` )를 ``Schedule`` 이라고 하는 Qiskit 펄스 프로그램에 mapping 할 수 있다. 이 사상 작업을 *교정* 이라고 한다. 높은 정확도의 교정은 mapping 된 논리 연산(예: ``X`` 게이트 교정은 :math:`|0\rangle` 을 :math:`|1\rangle` 로 바꾼다, 등등)을 충실히 구현하는 교정이다.
pt_un: Portas de pulso permitem mapear uma porta de circuito lógico (por exemplo, ``X``) para um programa Qiskit Pulse chamado de ``Schedule``. Este mapeamento é referido como uma *calibração*. Uma calibração de alta fidelidade é uma que implementa fielmente a operação lógica da qual é mapeada (por exemplo, se a calibração do ``X`` direciona :math:`|0\rangle` to :math:`|1\rangle`, etc.).
ru_ru: Импульсные вентили позволяют вам самостоятельно задать логические операции (например, отрицание ``X``) в программе Qiskit Pulse, называемой ``Schedule`` (планирование). Этот процесс называется *калибровкой*. Точная калибровка правильно выполняет ту логическую операцию, которой она соответствует (т.е. калибровка ``X`` переводит :math:`|0\rangle` в :math:`|1\rangle` и т.д.).
ta_in: பல்ஸ் கேட்கள் ``Schedule`` எனப்படும் Qiskit Pulse திட்டத்தில், ஒரு தர்க்கரீதியான சர்க்யூட் கேட்டை (எ.கா., ``X``) அமைக்க உதவுகிறது. இந்த மேப்பிங் *calibration* என குறிப்பிடப்படுகிறது. உயர் நம்பக அளவுத்திருத்தம் என்பது அது வரைபடப்படுத்தப்பட்ட தர்க்கரீதியான செயல்பாட்டை உண்மையாக செயல்படுத்துகிறது (எ.கா., ``X`` கேட் அளவுத்திருத்தம் :math:`|0\rangle` முதல் :math:`|1\rangle` வரை இயக்குகிறதா என்பது, மற்றும் பல...).
tr: Atım kapıları, mantıksal bir devre kapısını (örneğin, ``X``) ``Schedule`` olarak adlandırılan bir Qiskit Atım programına eşlemenize olanak tanır. Bu eşlemeye *kalibrasyon* denir. Yüksek doğruluklu bir kalibrasyon, eşlendiği mantıksal işlemi doğru bir şekilde uygulayan bir kalibrasyondur (örneğin, ``X`` kapısı kalibrasyonunun :math:`|0\rangle` ile :math:`|1\rangle` arasında gidip gelmediği gibi vb.).

source: A schedule specifies the exact time dynamics of the input signals across all input *channels* to the device. There are usually multiple channels per qubit, such as drive and measure. This interface is more powerful, and requires a deeper understanding of the underlying device physics.
bn_bn: একটা সময়সূচীতে বর্ণনা করা থাকে কখন কোন ইনপুট *চ্যানেলে* কিভাবে কোন ইনপুট সংকেত দেওয়া হবে। প্রত্যেক কিউবিটের জন্য একাধিক চ্যানেল থাকে, যেমন ড্রাইভ এবং পরিমাপ (মেসার). এই উপস্থাপনটি আরো শক্তিশালী এবং এর জন্য যন্ত্রের অভ্যন্তরীন ক্রিয়াকলাপের গভীর জ্ঞান প্রয়োজন।
es_un: Un planificador (schedule) especifica la dinámica de tiempo exacta de las señales de entrada a través de todos los *canales* de entrada al dispositivo. Por lo general, hay varios canales por qubit, como dirección (drive) y medición (measure). Esta interfaz es más poderosa y requiere una comprensión más profunda de la física subyacente del dispositivo.
fr_fr: Un schedule (planning) spécifie la dynamique temporelle exacte des signaux d'entrée sur tous les canaux *channels* allant vers le système. Il existe généralement plusieurs canaux par qubit, tels que le canal d'entrée et le canal de mesure. Cette interface est plus puissante et nécessite une compréhension plus approfondie de la physique des dispositifs sous-jacents.
id_id: Sebuah jadwal menjelaskan dinamika waktu yang tepat dari sinyal masukan di semua saluran masukan * ke perangkat. Biasanya ada beberapa saluran per qubit, seperti drive dan measure. Antarmuka ini lebih kuat, dan membutuhkan pemahaman yang lebih dalam tentang perangkat fisika yang mendasarinya.
ja_jp: スケジュールは、デバイスに対する全入力 *チャンネル* にわたる入力信号の正確な時間ダイナミクスを指定します。 通常、ドライブや計測など、量子ビットごとに複数のチャネルがあります。 このインターフェイスはより強力であり、基礎となるデバイス物理についてより深く理解する必要があります。
ko: 스케줄은 장치에 대한 모든 입력 *채널들* 에 걸쳐 입력 신호의 정확한 시간 역학을 지정한다. 일반적으로 큐비트 마다 구동 및 측정과 같은 여러 채널이 있다. 이 인터페이스는 더 강력하며 기본적인 장치의 물리학적 원리를 더 깊이 이해해야 한다.
pt_un: Uma programação especifica a dinâmica de tempo exata dos sinais de entrada em todas as entradas *canais* para o dispositivo. Geralmente, há vários canais por qubit, como direção e medida. Essa interface é mais poderosa e requer uma compreensão mais profunda da física do dispositivo subjacente.
ru_ru: Планирование позволяет задать точную форму сигналов, подаваемых на все входные *каналы* устройства. Обычно каждый кубит имеет несколько каналов - управление и измерение. Работа с таким серьезным интерфейсом требует более глубокого понимания физики устройства.
ta_in: ஒரு அட்டவணை சாதனத்திற்கு அனைத்து உள்ளீடு *channels* முழுவதும் உள்ளீடு சிக்னல்களின் சரியான நேர இயக்கவியல் குறிப்பிடுகிறது. பொதுவாக ஒரு குபீரின் பல சேனல்கள் உள்ளன, அதாவது இயக்கி மற்றும் அளவிடு. இந்த இடைமுகம் மிகவும் சக்திவாய்ந்தது, மேலும் அடிப்படை சாதன இயற்பியல் ஒரு ஆழமான புரிதல் தேவைப்படுகிறது.
tr: Bir zaman çizelgesi, cihaza giden tüm giriş *kanalları* boyunca giriş sinyallerinin tam zaman dinamiklerini belirtir. Genellikle kübit başına düşen sürücü ve ölçü gibi birden çok kanal vardır. Bu arayüz daha güçlüdür ve temelindeki cihaz fiziğinin daha derinden anlaşılmasını gerektirir.

source: It’s important to note that Pulse programs operate on physical qubits. A drive pulse on qubit :math:`a` will not enact the same logical operation on the state of qubit :math:`b` – in other words, gate calibrations are not interchangeable across qubits. This is in contrast to the circuit level, where an ``X`` gate is defined independent of its qubit operand.
bn_bn: মনে রাখতে হবে যে তড়িৎস্পন্দন বা পালস নিয়মাবলী (প্রোগ্রাম ) বাস্তব কিউবিটের উপর কাজ করে। একটা ড্রাইভ তড়িৎস্পন্দন বা পালস, :math:`a` -কিউবিটে যে যৌক্তিক ক্রিয়াকলাপ (অপারেশন) করবে, তা :math:`b` কিউবিটের উপর কাজ করার পর এক ফল দেবে না। সহজ কথায় যুক্তিবর্তনী (গেইট) ক্রমাঙ্কন (ক্যালিব্রেশন) কিউবিটের মধ্যে আদান-প্রদান করা যায় না। এটা বর্তনী (সার্কিট) স্তরের বিপরীত, যেখানে একটা ``X`` যুক্তিবর্তনী (গেইট) কিউবিট ইনপুটের উপর নির্ভরশীল নয়।
fr_fr: Il est important de noter que les programmes Pulse fonctionnent sur des qubits physiques. Une impulsion d'entraînement sur le qubit :math:`a` ne va pas mettre en oeuvre la même opération logique sur l'état d'un autre qubit :math:`b`-en d'autres termes, les étalonnages d'un porte ne sont pas interchan geables d'un qubit à un autre. Ceci contrairement au niveau circuit, où une porte ``X`` est définie indépendamment du qubit sur lequel elle opère.
id_id: Penting untuk dicatat bahwa program Pulse beroperasi pada qubit fisik. Sebuah pulsa drive pada qubit :math:` a ` tidak akan memberlakukan operasi logis yang sama pada keadaan qubit :math:` b `-dengan kata lain, kalibrasi gerbang tidak dapat dipertukarkan di seluruh qubit. Hal ini berbeda dengan tingkat sirkuit, di mana sebuah gerbang ` ` X ` ` didefinisikan independen dari operan qubit nya.
ja_jp: Pulseプログラムは物理的な量子ビットで動作することに注意することが重要です。 量子ビット :math:`a` のドライブパルスは、量子ビット :math:`b` の状態で同じ論理演算を行いません。 ゲート較正は量子ビット間で交換できません。これは回路レベルとは異なり、``X`` ゲートは量子ビットオペランドと独立して定義されます。
ko: 펄스 프로그램은 물리적인 큐비트에 작용하는 것임을 주목하는 것이 중요하다. 큐비트 :math:`a` 에 가해진 구동 펄스는 큐비트 :math:`b` 의 상태에 같은 논리적 연산을 하지 않는다 - 바꾸어 말하면 게이트 교정은 큐비트들 사이에 상호 교환이 가능하지 않다. 이것은 ``X`` 게이트가 대상 큐비트에 독립적으로 정의되는 회로 레벨과는 대조적이다.
ru_ru: Важно отметить, что программы Pulse работают с физическими кубитами. Управляющий импульс, посылаемый на кубит :math:`a`, не будет выполнять ту же самую логическую операцию на кубите :math:`b`, то есть калибровка вентилей не сохраняется при смене кубитов. Это отличается от обычной работы с цепями, когда вентиль ``X`` не зависит от объекта, к которому он применяется.
ta_in: பல்ஸ் புரோகிராம்கள் உடல் சார்ந்த qubitsகளில் இயங்குவது குறிப்பிடத்தக்கது. qubit "math:a" இல் ஒரு இயக்கி துடிப்பு qubit "math:'b" என்ற நிலையில் அதே தருக்க செயல்பாட்டை செயல்படுத்த ாது - வேறு வார்த்தைகளில் கூறுவதானால், கேட் அளவொப்புமைகள் qubis முழுவதும் மாற்றமுடியாது. இது சர்கூட் மட்டத்திற்கு மாறாக, ஒரு "X" கேட் அதன் qubit operand இன் சுயாதீனமாக வரையறுக்கப்படுகிறது.
tr: Atım programlarının fiziksel kübitler üzerinde çalıştığını unutmamak önemlidir. Kübit :math:`a` üzerindeki bir sürücü atımı, kübit :math:`b` durumunda aynı mantıksal işlemi gerçekleştirmez – başka bir deyişle, geçit kalibrasyonları kübitler arasında değiştirilemez. Bu, bir "X" kapısının kübit işleneninden bağımsız olarak tanımlandığı devre seviyesinin aksinedir.

source: This page shows you how to add a calibration to your circuit.
bn_bn: এই পৃষ্ঠা থেকে কিভাবে আপনার বর্তনীতে (সার্কিট) ক্রমাঙ্কন (ক্যালিব্রেশন) গঠন করতে হয় তা দেখতে পারেন।
es_un: Esta página te muestra cómo agregar una calibración a tu circuito.
fr_fr: Cette page vous montre comment ajouter une calibration à votre circuit.
id_id: Halaman ini menunjukkan Anda bagaimana untuk menambahkan kalibrasi di sirkuit Anda.
ja_jp: このページでは、回路に較正を追加する方法を説明します。
ko: 이 페이지는 회로에 교정을 추가하는 법을 보여준다.
pt_un: Esta página mostra como adicionar uma calibração ao seu circuito.
ru_ru: Эта страница показывает, как добавить калибровку в вашу цепь.
ta_in: உங்கள் சுற்றுக்கு ஒரு அளவொப்புமை எவ்வாறு சேர்ப்பது என்பதை இந்தப் பக்கம் காட்டுகிறது.
tr: Bu sayfa, devrenize nasıl bir kalibrasyon ekleyeceğinizi gösterir.

source: **Note:** To execute a program with pulse gates, the backend has to be enabled with OpenPulse. You can check via ``backend.configuration().open_pulse``, which is ``True`` when OpenPulse is enabled. If it is enabled and the pulse gates feature is not enabled, you can `schedule <07_pulse_scheduler.ipynb>`__ your input circuit.
bn_bn: **টীকা:** তড়িৎস্পন্দন বা পালস যুক্তিবর্তনী (গেইট) এর সাহায্যে কোনো নির্দেশাবলী (প্রোগ্রাম) চালাতে হলে OpenPulse ব্যাকএন্ড চালু করতে হবে। ``backend.configuration().open_pulse`` চালিয়ে যদি ``True`` পাওয়া যায় তার অর্থ OpenPulse চালু আছে। যদি এটা চালু থাকে কিন্তু তড়িৎস্পন্দন বা পালস যুক্তিবর্তনী (গেইট) বৈশিষ্ট্য (ফিচার) চালু না থাকে তাহলে ইনপুট বর্তনীতে (সার্কিট) `schedule <07_pulse_scheduler.ipynb>`__ ব্যবহার করা যায়।
es_un: **Nota:** Para ejecutar un programa con compuertas de pulso, el backend debe estar habilitado con OpenPulse. Puedes verificar con ``backend.configuration().open_pulse``, que es ``True`` cuando OpenPulse está habilitado. Si está habilitado y la función de compuertas de pulso no está activada, puedes `planificar <07_pulse_scheduler.ipynb>`__ tu circuito de entrada.
fr_fr: **Note:** Pour exécuter un programme avec des portes d'impulsion, le backend doit être activé avec OpenPulse. Vous pouvez vérifier cela en utilisant ``backend.configuration().open_pulse``, qui est ``True`` quand OpenPulse est activé. S'il est activé et que la fonction des portes d'impulsion n'est pas activée, vous pouvez `construire<07_pulse_scheduler.ipynb>`__ votre circuit d'entrée.
id_id: ** Catatan:** Untuk melaksanakan sebuah program dengan gerbang pulsa, backend harus diaktifkan dengan OpenPulse. Anda dapat memeriksa melalui ` `backend.konfigurasi ().open_pulse ` ` `, akan ` ` True ` ` ketika OpenPulse diaktifkan. Jika diaktifkan dan fitur gerbang pulsa tidak diaktifkan, anda dapat ` schedule <07_pulse_scheduler.ipynb> ` __ rangkaian masukan anda.
ja_jp: **注意:** パルスゲートでプログラムを実行するには、バックエンドの OpenPulse を有効にする必要があります。これは``backend.configuration().open_pulse`` で確認できます。OpenPulseが有効な場合``True`` です。 有効になっていてパルスゲート機能が有効になっていない場合は、入力回路を`スケジュール <07_pulse_scheduler.ipynb>`__ することができます。
ko: **참고:** 펄스 게이트가 있는 프로그램을 실행하기 위해서는 OpenPulse를 지원하는 벡엔드를 사용해야 한다. ``backend.configuration().open_pulse`` 의 옵션이 ``True`` 인 것으로 OpenPulse를 사용할 수 있는지 확인할 수 있다. OpenPulse가 활성화 되어 있고 펄스 게이트 기능이 활성화되지 않은 경우, 입력 회로에 `스케쥴 <07_pulse_scheduler.ipynb>`__ 를 사용할 수 있다.
pt_un: **Nota:** Para executar um programa com portas de pulso, o backend deve ser habilitado com o OpenPulse. Você pode verificar, via ``backend.configuration().open_pulse``, que é ``True``, quando o OpenPulse está habilitado. Se estiver habilitado e as portas de pulso não estiverem ativados, você pode, no seu circuito de entrada `agendar <07_pulse_scheduler.ipynb>`__.
ru_ru: **Примечание:** Для выполнения программы, содержащей импульсные вентили, бэкенд должен быть пригоден к работе с OpenPulse. Проверить это можно с помощью ``backend.configuration().open_pulse``, который вернет ``True`` при возможности использования OpenPulse. Если он доступен, а импульсные вентили – нет, то вы можете `запланировать <07_pulse_scheduler.ipynb>`__ вашу цепь.
ta_in: **குறிப்பு:** பல்ஸ் கேட்ஸ் கொண்ட ஒரு நிரலை இயக்க, பின்முனை OpenPulse உடன் செயல்படுத்தப்பட வேண்டும். OpenPulse செயலாக்கப்படும் போது "backend.configuration().open_pulse" வழியாக நீங்கள் பார்க்கலாம். அது செயல்படுத்தப்பட்டு, துடிப்பு வாயில்கள் அம்சம் செயல்படுத்தப்படவில்லை என்றால், நீங்கள் '<07_pulse_scheduler.ipynb>'' உங்கள் உள்ளீடு சுற்று திட்டமிட முடியும்.
tr: **Not:** Atım geçitleri olan bir programı yürütmek için arkayüzeyin OpenPulse ile etkinleştirilmesi gerekir. OpenPulse etkinleştirildiğinde ``True`` olan ``backend.configuration().open_pulse`` üzerinden kontrol edebilirsiniz. Etkinleştirilmişse ve atım geçitlerinin özelliği etkinleştirilmemişse, giriş devrenizi `schedule <07_pulse_scheduler.ipynb>`__ ile zamanlayabilirsiniz.

source: Build your circuit
bn_bn: আপনার বর্তনী (সার্কিট) তৈরি করুন
es_un: Construye tu circuito
fr_fr: Construire votre circuit
id_id: Bangun sirkuit Anda
ja_jp: 回路の構築
ko: 회로 구성하기
pt_un: Construindo o circuito
ru_ru: Создание вашей цепи
ta_in: உங்கள் சர்கூட் கட்ட
tr: Devrenizi oluşturun

source: Let’s start with a very simple example, a Bell state circuit.
bn_bn: একটি খুব সহজ উদাহরন দিয়ে শুরু করা যাক, তা হল বেল স্টেট বর্তনী (সার্কিট)।
fr_fr: Commençons par un exemple très simple, un circuit produisant l'état de Bell.
id_id: Mari kita mulai dengan contoh yang sangat sederhana, sebuah sirkuit Bell state.
ja_jp: 非常に簡単な例、Bell状態の回路から始めましょう。
ko: 아주 간단한 예인 벨 상태(Bell state) 회로로부터 시작하자.
ru_ru: Давайте начнем с самого простого примера и рассмотрим цепь, которая создает состояние Белла.
ta_in: ஒரு மிக எளிய உதாரணத்துடன் தொடங்குவோம், ஒரு பெல் நிலை சர்கூட்.
tr: Çok basit bir örnekle başlayalım, bir Bell durumu devresi.

source: Build your calibrations
bn_bn: আপনার ক্রমাঙ্কন (ক্যালিব্রেশন) গঠন করুন
es_un: Construye tus calibraciones
fr_fr: Construire vos calibrations
id_id: Bangun kalibrasi Anda
ja_jp: 較正の作成
ko: 교정 구성하기
pt_un: Fazendo as suas calibrações
ru_ru: Создание вашей калибровки
ta_in: உங்கள் அளவொப்புமைகளை உருவாக்கவும்
tr: Kalibrasyonlarınızı oluşturun

source: Now that we have our circuit, let’s define a calibration for the Hadamard gate on qubit 0.
bn_bn: বর্তনী (সার্কিট) তৈরী, এবার কিউবিট ০ এর উপর হ্যাডামার্ড যুক্তিবর্তনীর জন্য একটা ক্রমাঙ্কন (ক্যালিব্রেশন) সংজ্ঞায়িত করা যাক।
fr_fr: Maintenant que nous avons notre circuit, définissons une calibration pour la porte Hadamard sur le qubit 0.
id_id: Sekarang kita memiliki sirkuit kita, mari kita mendefinisikan kalibrasi untuk gerbang Hadamard pada qubit 0.
ja_jp: 回路ができたので、量子ビット 0のアダマールゲートに対する較正を定義しましょう。
ko: 이제 회로가 있으므로 큐비트 0에 대한 Hadamard 게이트의 교정을 정의하자.
ru_ru: Так как теперь у нас есть цепь, давайте зададим калибровку гейта Адамара на нулевом кубите.
ta_in: இப்போது நாம் நமது சர்கூட்வேண்டும் என்று, qubit 0 இல் ஹாட்மார்ட் கேட் ஒரு அளவொப்புமை வரையறுக்க லாம்.
tr: Artık devremize sahip olduğumuza göre, Hadamard kapısı için 0 kübiti üzerinde bir kalibrasyon tanımlayalım.
