Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/05_pulse_gates.po
Languages: bn_bn, es_un, fr_fr, id_id, ja_jp, ko, pt_un, ru_ru, ta_in, tr

source: In practice, the pulse shape and its parameters would be optimized through a series of Rabi experiments (see the `Qiskit Textbook <https://qiskit.org/textbook/ch-quantum-hardware/calibrating-qubits-openpulse.html>`__ for a walk through). For this demonstration, our Hadamard will be a Gaussian pulse. We will *play* our pulse on the *drive* channel of qubit 0.
bn_bn: কার্যকালীন, তড়িৎস্পন্দনের (পালস) আকার ও প্যারামিটারগুলো বিভিন্ন রবি গবেষণার মাধ্যমে স্থির করা হয়। বিশদে জানতে `Qiskit Textbook <https://qiskit.org/textbook/ch-quantum-hardware/calibrating-qubits-openpulse.html>`__ দেখো। এই প্রদর্শনীর জন্য আমাদের হ্যাডম্যার্ড একটা গসীয়ান তড়িৎস্পন্দন (পালস) হবে। আমরা ০ কিউবিটের *ড্রাইভ* চ্যানেলে তড়িৎস্পন্দনটি (পালস) চালাবো।
es_un: En la práctica, la forma del pulso y sus parámetros se optimizarían a través de una serie de experimentos Rabi (consulta el `Libro de Texto de Qiskit <https://qiskit.org/textbook/ch-quantum-hardware/calibrating-qubits-openpulse.html>`__ para profundizar). Para esta demostración, nuestra compuerta Hadamard será un pulso Gaussiano. *Reproduciremos* nuestro pulso en el canal de *dirección* (drive) del qubit 0.
fr_fr: Dans la pratique, la forme de l'impulsion et ses paramètres devraient être optimisés à travers une série d'expériences de Rabi (voir le `Qiskit Textbook <https://qiskit.org/textbook/ch-quantum-hardware/calibrating-qubits-openpulse.html>`__ pour une preemière approche). Pour cette démonstration, notre Hadamard sera une impulsion gaussienne. Nous allons *jouer* notre impulsion sur le *canal d'entrée* du qubit 0.
id_id: Dalam praktiknya, bentuk pulsa dan parameter-parameternya akan dioptimalkan melalui serangkaian eksperimen Rabi (lihat ` Qiskit Textbook <https://qiskit.org/textbook/ch-quantum-hardware/calibrating-qubits-openpulse.html>` __ untuk mempelajari lebih jauh). Untuk demonstrasi ini, Hadamard kita akan menjadi pulsa Gaussian. Kita akan * play * pulsa kita pada * drive * saluran qubit 0.
ja_jp: 実際に パルスの形状とパラメータは一連のRabi実験を通して最適化されます(`Qiskit Textbook <https://qiskit.org/textbook/ch-quantum-hardware/calibrating-qubits-openpulse.html>`__ を参照)。 このデモンストレーションでは、アダマールはガウスパルスになります。量子ビット0の*ドライブ*チャンネルでパルスを*再生*します。
ko: 실제로, 펄스의 모양과 매개변수들은 Rabi 실험(Rabi experiments)의 반복을 통해 최적화된다 (`Qiskit 교과서 <https://qiskit.org/textbook/ch-quantum-hardware/calibrating-qubits-openpulse.html>`__ 를 따라가라). 이를 시연하고자 Hadamard는 가우시안(Gaussian)펄스가 될 것이다. 큐비트 0의 *구동* 채널에 펄스를 *발생* 시킬 것이다.
pt_un: Na prática a forma do pulso e seus parâmetros serão otimizados através de uma série de experimentos Rabi (veja o `Qiskit Textbook <https://qiskit.org/textbook/ch-quantum-hardware/calibrating-qubits-openpulse.html>`__ para uma explicação). Para esta demonstração, nosso Hadamard será um pulso gaussiano. Vamos *jogar* nosso pulso no canal *direção* do qubit 0.
ru_ru: На самом деле форма импульса и его параметры подбираются с помощью серии экспериментов Раби (смотрите `Qiskit Textbook <https://qiskit.org/textbook/ch-quantum-hardware/calibrating-qubits-openpulse.html>`__ для ознакомления). В нашем примере вентиль Адамара будет импульсом гауссовой формы. Мы *запускаем* его на *управляющем* канале кубита 0.
ta_in: நடைமுறை, பழுப்பு வடிவம் மற்றும் அதன் அளபுருக்கள் ரபி ஆய்வுகளின் ஒரு தொடர் மூலம் ஒப்பிடப்படும் (பார்க்க ` Qiskit Textbook <https://qiskit.org/textbook/ch-quantum-hardware/calibrating-qubits-openpulse.html>` _ _ for a walk through). இந்தப் போராட்டத்துக்காக, நமது ஹாம்டர்ட் ஒரு காஸ்சியன் நுழைவு இருப்பது. நாம் * இயக்கி * நுழைவு * இயக்கி * வழி * அலைவரிசை 0.
tr: Pratikte, atım şekli ve parametreleri bir dizi Rabi deneyi yoluyla optimize edilecektir (bkz.`Qiskit Textbook <https://qiskit.org/textbook/ch-quantum-hardware/calibrating-qubits-openpulse.html>`__ bir gezinti için). Bu gösteri için Hadamard'ımız bir Gauss atımı olacaktır. Atımımızı kübit 0'ın *sürücü* kanalında *canlardıracağız*.

source: Don’t worry too much about the details of building the calibration itself; you can learn all about this on the following page: `building pulse schedules <06_building_pulse_schedules.ipynb>`__.
bn_bn: ক্রমাঙ্কন (ক্যালিব্রেশন) গঠনের (বিল্ড) ব্যাপারে বিস্তারিত জানতে `building pulse schedules <06_building_pulse_schedules.ipynb>`__ পৃষ্ঠাটি খুলে দেখো।
fr_fr: Ne vous inquiétez pas trop des détails de la construction de l'étalonnage lui-même ; vous pouvez en apprendre plus sur ce sujet à la page suivante: `construction des ordonnancements d'impulsions<06_building_pulse_schedules.ipynb> `__.
id_id: Jangan terlalu khawatir dengan detail dari membangun kalibrasinya; Anda dapat mempelajari semua hal ini pada halaman berikut: ` membangun jadwal pulsa <06_building_pulse_schedules.ipynb> ` __.
ja_jp: 較正自体の構築の詳細についてはあまり心配しないでください。 次のページ、`building pulse schedules <06_building_pulse_schedules.ipynb>`__、でこれについてすべてを学ぶことができます。
ko: 교정을 구성하는 세부사항 자체에 대해 너무 걱정하지 마라. `펄스 스케줄 작성 <06_building_pulse_schedules.ipynb>`__ 페이지에서 이에 대해 모두 학습할 수 있다.
ru_ru: Пока не будем сильно вдаваться в детали создания калибровки; вы сможете узнать об этом подробнее на следующей странице: `планирование импульса <06_building_pulse_schedules. pynb>`__.
ta_in: அளவொப்புமை விவரங்களைப் பற்றி அதிகம் கவலைப்பட வேண்டாம்; பின்வரும் பக்கத்தில் இதைப் பற்றி நீங்கள் அனைத்தையும் கற்றுக்கொள்ளலாம்: 'building பல்ஸ் அட்டவணை <06_building_pulse_schedules.ipynb>'.
tr: Kalibrasyonun kendisini oluşturmanın ayrıntıları hakkında çok fazla endişelenmeyin; bununla ilgili her şeyi aşağıdaki sayfada öğrenebilirsiniz: `building pulse schedules <06_building_pulse_schedules.ipynb>`__.

source: Let’s draw the new schedule to see what we’ve built.
bn_bn: নতুন সময়সূচি (শিডিউল) এঁকে কি বানানো হয়েছে তা দেখা যাক।
fr_fr: Dessinons le nouveau programme d'impulsions pour voir ce que nous avons construit.
id_id: Mari kita gambar jadwal baru untuk melihat apa yang telah kita bangun.
ja_jp: 新しいスケジュールを描画して、何を作ったのか見てみましょう。
ko: 무엇이 구성되었는지를 보고자 새로운 스케줄을 그리자.
ru_ru: Давайте отрисуем планирование импульса и посмотрим, что у нас получилось.
ta_in: நாங்கள் கட்டப்பட்ட என்ன பார்க்க புதிய திட்டத்தை வரைய.
tr: Neler yaptığımızı görmek için yeni programı çizelim.

source: Link your calibration to your circuit
bn_bn: বর্তনীর (সার্কিট) সাথে ক্রমাঙ্কন (ক্যালিব্রেশন) এর সংযোগস্থাপন
es_un: Vincula tu calibración a tu circuito
fr_fr: Connectez votre calibration à votre circuit
id_id: Hubungkan kalibrasi Anda ke sirkuit Anda
ja_jp: 較正と回路のリンク
ko: 회로에 교정을 링크하기
pt_un: Vincule sua calibração ao seu circuito
ru_ru: Привязка калибровки к вашей цепи
ta_in: உங்கள் அளவொப்புமை உங்கள் சர்கூட் இணைக்க
tr: Kalibrasyonunuzu devrenize bağlayın

source: All that remains is to complete the registration. The circuit method ``add_calibration`` needs information about the gate and a reference to the schedule to complete the mapping:
bn_bn: এখন শুধু নিবন্ধীকরণ সম্পুর্ণ করা বাকি। বর্তনী (সার্কিট) পদ্ধতি ``add_calibration`` ম্যাপিং (চিত্রায়ন) সম্পূর্ণ করার জন্য, যুক্তিবর্তনীর (গেইট) বিবরণ এবং সময়সূচীর তথ্যসূত্র (রেফারেন্স) প্রয়োজন:
es_un: Todo lo que queda es completar el registro. El método de circuito ``add_calibration`` necesita información sobre la compuerta y una referencia al planificador para completar el mapeo:
fr_fr: Il ne reste plus qu'à compléter l'enregistrement. La méthode de circuit ``add_calibration`` a besoin d'informations sur la porte et d'une référence à la planification pour terminer la correspondance:
id_id: Semua yang tersisa adalah untuk menyelesaikan registrasi. Metode sirkuit ` ` add_calibration ` ` ` membutuhkan informasi tentang gerbang dan referensi untuk jadwal untuk menyelesaikan pemetaan:
ja_jp: 残っているのは、登録を完了することだけです。 回路メソッド ``add_calibration`` にはゲートに関する情報とマッピングを完了するスケジュールへの参照が必要です。
ko: 등록을 마무리하는 것만이 남았다. 회로 메서드 ``add_calibration`` 은 사상을 완료하고자 게이트 정보와 스케줄에 대한 참조를 필요로 한다:
pt_un: Resta, apenas, completar o registro. O método de circuito ``add_calibration`` precisa de informações sobre a porta e a referência ao cronograma para completar o mapeamento:
ru_ru: Остается только сделать запись. Методу ``add_calibration`` требуется информация о вентиле и ссылка на планирование для завершения сопоставления:
ta_in: மீதமுள்ள அனைத்து பதிவு முடிக்க உள்ளது. சர்கூட் முறை "add_calibration" கேட் பற்றிய தகவல் மற்றும் வரைபடமாக்கலை முடிக்க அட்டவணைபற்றிய குறிப்பு தேவைப்படுகிறது:
tr: Geriye sadece kaydı tamamlamak kalıyor. Devre yöntemi ``add_calibration`` eşlemeyi tamamlamak için kapı hakkında bilgiye ve zaman çizelgesine referansa ihtiyaç duyar:

source: The ``gate`` can either be a ``circuit.Gate`` object or the name of the gate. Usually, you’ll need a different schedule for each unique set of ``qubits`` and ``parameters``. Since the Hadamard gate doesn’t have any parameters, we don’t have to supply any.
bn_bn: ``যুক্তিবর্তনী (গেইট)`` -টি ``circuit.Gate`` অবজেক্ট বা যুক্তিবর্তনীর (গেইট) নাম হতে পারে। সাধারণত প্রত্যেক অনন্য ``কিউবিট`` ও ``প্যারামিটার`` সেটের জন্য আলাদা আলাদা সময়সূচী লাগে। যেহেতু হ্যাডামার্ড যুক্তিবর্তনী কোনো প্যারামিটার নেয় না, আমরা কোনো প্যারামিটার দেব না।
fr_fr: La ``gate``(porte) peut être soit un objet de type ``circuit.Gate`` soit le nom d'une porte. Habituellement, vous aurez besoin d'un planning différent pour chaque ensemble unique de ``qubits`` et de ``parameters``. Puisque la porte Hadamard n’a aucun paramètre, nous n’avons pas à en fournir un.
id_id: ` ` gate ` ` dapat berupa sebuah ` `circuit.Gate ` ` objek atau nama dari gerbang. Biasanya, Anda akan membutuhkan jadwal yang berbeda untuk setiap set unik dari ` ` qubits ` ` dan ` ` ` parameter ` `. Karena gerbang Hadamard tidak memiliki parameter apapun, kita tidak harus memasok apapun.
ja_jp: ``gate`` は、``circuit.Gate`` オブジェクトまたはゲートの名前にすることができます。 通常、``qubits`` と ``parameters`` の固有のセットそれぞれに対し、異なるスケジュールが必要になります。 アダマールゲートにはパラメータがありませんので、何も入力する必要はありません。
ko: ``gate`` 는 ``circuit.Gate`` 객체이거나 게이트의 이름 그대로가 될 수 있다. 보통 ``qubits`` 와 ``parameters`` 의 각각의 독특한 집합마다 다른 스케줄이 필요할 것이다. Hadamard 게이트에는 어떠한 매개변수도 없기 때문에, 어떤 것도 넘길 필요가 없다.
ru_ru: При этом ``gate`` может быть как объектом ``circuit.Gate``, так и названием вентиля. Обычно для каждого отдельного набора ``qubits`` и ``parameters`` нужно отдельное планирование. Поскольку вентиль Адамара параметров не содержит, никаких параметров определять не нужно.
ta_in: "கேட்" என்பது "சர்கூட்" ஆக இருக்கலாம். கேட்' பொருள் அல்லது கேட் பெயர். வழக்கமாக, ஒவ்வொரு தனிப்பட்ட தொகுப்புக்கும் வெவ்வேறு அட்டவணை தேவைப்படும் 'qubits' மற்றும் "ஆர்குமென்ட்'. ஹாட்மார்ட் கேட் எந்த ஆர்குமென்ட் இல்லை என்பதால், நாங்கள் எந்த வழங்க வேண்டிய அவசியமில்லை.
tr: ``gate``, bir ``circuit.Gate`` nesnesi veya geçit adı olabilir. Genellikle, her benzersiz ``qubits`` ve ``parameters`` kümesi için farklı bir programa ihtiyacınız olacaktır. Hadamard geçidinin herhangi bir parametresi olmadığı için, herhangi birini sağlamamız gerekmiyor.

source: Lastly, note that the transpiler will respect your calibrations. Use it as you normally would (our example is too simple for the transpiler to optimize, so the output is the same).
bn_bn: মনে রেখো, ট্রান্সপাইলার তোমার করা ক্রমাঙ্কন (ক্যালিব্রেশন) গুলো কাজে লাগায়। এটাকে সাধারণ ভাবেই ব্যবহার করবে। আমাদের উদাহরণটা অনুকূলিত করা ট্রান্সপাইলারের জন্য খুবই সহজ। তাই ফলাফলে কোনো পরিবর্তন হয়নি।
es_un: Por último, ten en cuenta que el transpilador respetará tus calibraciones. Utilízalo como lo harías normalmente (nuestro ejemplo es demasiado simple para que el transpilador lo optimice, por lo que la salida es la misma).
fr_fr: Enfin, notez que le transpilleur respectera vos calibrations. Utilisez-le comme vous le feriez normalement (ici, notre exemple est trop simple pour que le transpilleur puisse optimiser, donc la sortie est la même).
id_id: Terakhir, catatan bahwa transpiler akan menghormati kalibrasi Anda. Gunakan itu sebagaimana biasanya. (contoh kami terlalu sederhana untuk transpiler untuk dioptimasikan, sehingga keluaran adalah sama).
ja_jp: 最後に、トランスパイラーは較正を尊重することに注意してください。 通常どおりに使用してください (この例ではトランスパイラーを最適化するには簡単すぎるので、出力は同じです)。
ko: 마지막으로 트랜스파일러는 당신의 교정을 준수하다는 걸 주의하자. 그럴 거라고 생각하고 사용하자 (우리의 예는 트랜스파일러가 최적화하기에는 너무 간단하므로 출력이 같다).
pt_un: Por último, note que o transpilador respeitará suas calibrações. Use-o como você normalmente usaria (nosso exemplo é muito simples para que o transpilador o otimize, então a saída é a mesma).
ru_ru: В конце отметим, что транспайлер будет учитывать ваши калибровки. Используйте его как обычно (наш пример слишком прост для оптимизации, так что результаты совпадают).
ta_in: இறுதியாக, டிரான்ஸ்பைலர் உங்கள் அளவொப்புமைகளை மதிக்கும் என்பதை நினைவில் கொள்ளவும். நீங்கள் வழக்கமாக அதை பயன்படுத்த (எங்கள் உதாரணம் டிரான்ஸ்பைலர் உகந்ததாக மிகவும் எளிது, எனவே வெளியீடு அதே தான்).
tr: Son olarak, aktarıcının kalibrasyonlarınıza uyacağını unutmayın. Normalde yaptığınız gibi kullanın (örneğimiz aktarıcının optimize etmesi için çok basittir, dolayısıyla çıktı aynıdır).

source: Notice that ``h`` is not a basis gate for the mock backend ``FakeAlmaden``. Since we have added a calibration for it, the transpiler will treat our gate as a basis gate; *but only on the qubits for which it was defined*. A Hadamard applied to a different qubit would be unrolled to the basis gates.
bn_bn: লক্ষ্য করো ``h`` কিন্তু ``FakeAlmaden`` নামক ছদ্ম ব্যাকএন্ডের ভিত্তি (বেসিস) যুক্তিবর্তনী (গেইট) নয়। যেহেতু আমরা এর জন্য একটা ক্রমাঙ্কন (ক্যালিব্রেশন) যোগ করেছি, ট্রান্সপাইলার আমাদের যুক্তিবর্তনীকে (গেইট) *কেবল সংজ্ঞায়িত কিউবিটের জন্য ভিত্তি (বেসিস) যুক্তিবর্তনী (গেইট) হিসেবে গ্রহণ করবে*। একটা অন্য কিউবিটে একটা হ্যাডামার্ড প্রয়োগ করলে সেটা ভিত্তি (বেসিস) যুক্তিবর্তনীতে (গেইট) পরিবর্তিত হয়ে যাবে।
ja_jp: ``h`` はモックバックエンド ``FakeAlmaden`` の基底ゲートではないことに注意してください。 較正を追加したので、トランスパイラーはゲートを基底ゲートとして扱います。*ただし、定義された量子ビット上のみです*。 別の量子ビットに適用されるアダマールは、基底ゲートに展開されます。
ta_in: "h" என்பது போலி பின்நிலை "FakeAlmaden" க்கான அடிப்படை கேட் அல்ல என்பதை கவனிக்கவும். நாம் அதற்கு ஒரு அளவொப்புமை சேர்த்துள்ளோம் என்பதால், டிரான்ஸ்பைலர் எங்கள் கேட் ஒரு அடிப்படை கேட் என கருதுவோம்; *but only on the qubits for which it was defined*. ஒரு ஹடமாத் வேறு ஒரு qubit பயன்படுத்தப்படும் அடிப்படை கேட்கள் unrolled வேண்டும்.

source: That’s it!
bn_bn: এটিই!
fr_fr: C'est tout !
id_id: Itu saja!
ja_jp: 以上です！
ko: 다 됐다!
ru_ru: Теперь все готово!
ta_in: அவ்வளவுதான்!
tr: Bu kadar!

source: Custom gates
bn_bn: বিশেষায়িত (কাস্টম) যুক্তিবর্তনী (গেইট)
es_un: Compuertas personalizadas
fr_fr: Portes personnalisées
id_id: Gerbang khusus
ja_jp: カスタムゲート
ko: 사용자 설정 게이트
pt_un: Portas personalizadas
ru_ru: Пользовательские вентили
ta_in: கஸ்டம் கேட்
tr: Özel kapılar

source: We’ll briefly show the same process for nonstandard, completely custom gates. This demonstration includes a gate with parameters.
bn_bn: সংক্ষেপে কিছু অন্যরকমের পুরোপুরি বিশেষায়িত (কাস্টম) যুক্তিবর্তনীর (গেইট) জন্য এই প্রক্রিয়াটি (প্রসেস) দেখে নেওয়া যাক। এই উদাহরণে আমরা একটা পরামিতি (প্যারামিটার) সহ একটা যুক্তিবর্তনী (গেইট) নেবো।
fr_fr: Nous montrerons brièvement le même processus pour les portes non standard, complètement personnalisées. Cette démonstration comprend une porte avec des paramètres.
id_id: Kami akan menunjukkan secara singkat proses yang sama untuk nonstandar, sepenuhnya gerbang khusus. Demonstrasi ini mencakup sebuah gerbang dengan parameter.
ja_jp: 非標準で、完全なるカスタムゲートに対して同じプロセスを簡単に示します。このデモンストレーションにはパラメーター付きゲートが含まれています。
ko: 비표준의 완전한 사용자 설정 게이트에 대해 같은 과정을 간단히 볼 것이다. 이번 시연에서는 매개변수가 있는 게이트가 포함되었다.
ru_ru: Мы кратко покажем тот же процесс для нестандартных вентилей, полностью задаваемых пользователем. Разберем также варианты с параметрами.
ta_in: நாம் சுருக்கமாக அதே செயல்முறை காட்ட வேண்டும் தரமற்ற, முற்றிலும் விருப்ப கேட்கள். இந்த செயல்விளக்கத்தில் அளவுருக்கள் கொண்ட ஒரு கேட் அடங்கும்.
tr: Standart olmayan, tamamen özel kapılar için aynı süreci kısaca göstereceğiz. Bu gösterimde, parametreleri olan bir kapı bulunur.

source: If we use the ``Gate`` instance variable ``custom_gate`` to add the calibration, the parameters are derived from that instance. Remember that the order of parameters is meaningful.
bn_bn: ক্রমাঙ্কন (ক্যালিব্রেশন) করার জন্য যদি আমরা ``Gate`` -এর দৃষ্টান্ত (ইনস্ট্যান্স) চল রাশি ``custom_gate`` ব্যবহার করি, পরামিতির (প্যারামিটার) মানগুলো সেখান থেকে নেওয়া হবে। মনে রাখতে হবে পরামিতি (প্যারামিটার) এর ক্রম অর্থপূর্ণ।
es_un: Si usamos la variable de instancia ``custom_gate`` de ``Gate`` para agregar la calibración, los parámetros se derivan de esa instancia. Recuerda que el orden de los parámetros es significativo.
fr_fr: Si nous utilisons la variable ``custom_gate`` de l'instance ``Gate`` pour ajouter l'étalonnage, les paramètres sont dérivés de cette instance. N'oubliez pas que l'ordre des paramètres est significatif.
id_id: Jika kita menggunakan ` ` Gate ` `variable instansi ` ` custom_gate ` ` untuk menambahkan kalibrasi, parameter berasal dari instansi tersebut. Ingat bahwa urutan parameter bermakna.
ja_jp: 較正を追加するために ``Gate`` のインスタンスである変数 ``custom_gate`` を使用する場合、パラメーターはそのインスタンスから派生します。 パラメーターの順序には意味があることに注意してください。
ko: 만약 교정을 추가하고자 ``Gate`` 인스턴스 변수 ``custom_gate`` 를 사용한다면, 그 매개변수들은 인스턴스로부터 도출된다. 매개변수 순서가 의미가 있음을 유념하라.
pt_un: Se usarmos a variável de instância ``Gate`` ``custom_gate`` para adicionar a calibração, os parâmetros são derivados dessa instância. Lembre-se de que a ordem dos parâmetros é significativa.
ru_ru: Если мы используем экземпляр ``Gate`` в переменной ``custom_gate`` для добавления калибровки, то параметры берутся из этого экземпляра. При этом имеет значение порядок упоминания параметров.
ta_in: அளவுத்திருத்தம் சேர்க்க "Gate" நேர்வு மாறியை "custom_gate" பயன்படுத்தினால், அளபுருக்கள் அந்த நேர்விலிருந்து தருவிக்கப்பட்டன. அளவுருக்களின் வரிசை அர்த்தமுள்ளதாக இருப்பதை நினைவில் கொள்ளுங்கள்.
tr: Kalibrasyon eklemek için ``Gate`` örnek değişkeni ``custom_gate`` kullanırsak, parametreler o örnekten türetilir. Parametrelerin sırasının anlamlı olduğunu unutmayın.

source: Normally, if we tried to transpile our ``circ``, we would get an error. There was no functional definition provided for ``"my_custom_gate"``, so the transpiler can’t unroll it to the basis gate set of the target device. We can show this by trying to add ``"my_custom_gate"`` to another qubit which hasn’t been calibrated.
bn_bn: সাধারণত যদি আমরা ``circ`` কে ট্রান্সপাইলের চেষ্টা করি আমরা একটা ত্রুটি পাবো। ``"my_custom_gate"`` এর কোনো কার্যকরী সংজ্ঞা না থাকার জন্য ট্রান্সপাইলার এটাকে লক্ষ্য যন্ত্রের ভিত্তি (বেসিস) যুক্তিবর্তনীতে (গেইট) ভাঙতে পারে না। এটা দেখার জন্য আমরা ক্রমাঙ্কিত (ক্যালিব্রেটেড) না করা একটা কিউবিটে ``"my_custom_gate"`` যোগ করতে পারি।
fr_fr: Normalement, si nous essayions de transpile notre circuit ``circ``, nous aurions une erreur. Aucune définition fonctionnelle n'ayant été fournie pour ``"my_custom_gate"``, de sorte que le transpileur ne peut pas le faire correspondre à des portes de l'ensemble dese portes de base de l'appareil cible. Nous pouvons le montrer en essayant d'ajouter ``"my_custom_gate"`` à un autre qubit qui lui n'a pas été calibré.
id_id: Biasanya, jika kita mencoba untuk transpile ` ` circ ` `, kita akan mendapatkan kesalahan. Tidak ada definisi fungsional yang disediakan untuk ` ` "my_custom_gate" ` `, sehingga transpiler tidak dapat membukanya ke gerbang basis set dari perangkat target. Kita dapat menunjukkan ini dengan mencoba menambahkan ` ` "my_custom_gate" ` ` ` ke qubit lain yang belum dikalibrasi.
ja_jp: 通常、``circ`` をトランスパイルしようとするとエラーになります。 ``"my_custom_gate"``の機能定義が提供されていないので、トランスパイラーはターゲットデバイスの基底ゲート・セットに展開することができません。 較正されていない別の量子ビットに ``"my_custom_gate"`` を追加すると、これを表示できます。
ko: 보통 우리가 ``circ`` 를 트랜스파일링하려고 하면 에러를 보게 될 것이다. ``"my_custom_gate"`` 에 제공되는 함수적 정의가 없기 때문에, 트랜스파일러는 이를 대상 장치의 기본 게이트 집합으로 전개할 수 없다. ``"my_custom_gate"`` 를 교정되지 않은 또 다른 큐비트에 추가하려고 시도하면 이런 현상을 볼 수 있다.
ru_ru: Если бы мы пытались транспилировать наш ``circ`` как обычно, то получили бы ошибку. Без определения функции ``"my_custom_gate"`` транспайлер не может разложить его по базовым вентилям устройства. Это можно увидеть при попытке применить ``"my_custom_gate"`` к некалиброванному кубиту.
ta_in: பொதுவாக, நாம் நமது 'circ' ஐ மாற்ற முயன்றால், பிழை ஏற்படும். "my_custom_gate" க்கு செயல்பாட்டு வரையறை எதுவும் வழங்கப்படவில்லை, எனவே டிரான்ஸ்பைலர் இலக்கு சாதனத்தின் அடிப்படை கேட் செட் அதை உருட்ட முடியாது. அளவுத்திருத்தம் செய்யமுடியாத மற்றொரு qubit இல் "my_custom_gate" சேர்க்க முயற்சிசெய்வதன் மூலம் இதை நாம் காட்ட முடியும்.
tr: Normalde ``circ``imizi aktarmaya çalışırsak, bir hata alırdık. ``"my_custom_gate"`` için sağlanan herhangi bir işlevsel tanım yoktur, bu nedenle aktarıcı onu hedef cihazın temel geçit setine açamıyor. Kalibre edilmemiş başka bir kübite ``"my_custom_gate"`` eklemeye çalışarak bunu gösterebiliriz.

source: Notice that ``h`` is not a basis gate for the mock backend ``FakeHanoi``. Since we have added a calibration for it, the transpiler will treat our gate as a basis gate; *but only on the qubits for which it was defined*. A Hadamard applied to a different qubit would be unrolled to the basis gates.
es_un: Ten en cuenta que ``h`` no es una compuerta base para el backend emulado ``FakeHanoi``. Ya que le hemos agregado una calibración, el transpilador tratará a nuestra compuerta como una compuerta base; *pero solo en los qubits para los que se definió*. Una Hadamard aplicada a un qubit diferente se desplegaría en las compuertas base.
fr_fr: Notez que ``h`` n'est pas une porte de base pour le backend simulé ``FakeHanoï``. Puisque nous avons ajouté une calibration pour elle, le transpilleur traitera notre porte comme une porte de base; *mais seulement sur les qubits pour lesquels elle a été définie*. Une porte de Hadamard appliquée à un autre qubit aurait été transformée en une suite de portes de base.
ko: ``h`` 가 모조 백엔드 ``FakeHanoi`` 의 기저 게이트가 아닌 것에 주목하자. 보정이 추가되었기 때문에 트랜스파일러는 해당 게이트를 기저 게이트로 취급할 것이다; *하지만 오직 정의되었던 큐비트들에 대해서만 취급할 것이다*. 다른 큐비트에 적용된 Hadamard는 기저 게이트들로 전개될 것이다.
tr: ``h``'nin sahte arka ucu olan ``FakeHanoi`` için bir temel kapı olmadığına dikkat edin. Bunun için bir kalibrasyon eklediğimiz için, diller arası derleyici kapımızı temel kapı olarak değerlendirecek; *ancak yalnızca tanımlandığı kübitlerde*. Farklı bir kübite uygulanan bir Hadamard, temel kapılara açılır.
