Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/06_building_pulse_schedules.po
Languages: bn_bn, es_un, fr, id_id, ja_jp, ko, pt_un, ta, tr

source: Here, we will go over the most important Pulse Builder features for learning how to build schedules. This is not exhaustive; for more details about what you can do using the Pulse Builder, check out the `Pulse API reference <https://qiskit.org/documentation/apidoc/pulse.html>`__.
bn_bn: এখানে, আমরা কিভাবে সময়সূচী তৈরি করতে হয় তা শেখার জন্য সর্বাধিক গুরুত্বপূর্ণ পালস বিল্ডার এর বৈশিষ্ট্যগুলি পুনরালোচনা করবো। এটি সম্পূর্ণ নয়; পালস বিল্ডার ব্যবহার করে আপনি কি করতে পারেন সে সম্পর্কে আরো বিস্তারিত জানার জন্য, `Pulse API reference <https://qiskit.org/documentation/apidoc/pulse.html>` দেখুন।
es_un: Aquí, repasaremos las características más importantes del Constructor de Pulso para aprender a crear planificadores. Esto no es exhaustivo; Para obtener más detalles sobre lo que puede hacer con el Constructor de Pulso, consulta la `referencia de la API de Pulse <https://qiskit.org/documentation/apidoc/pulse.html>`__.
fr: Ici, nous allons passer en revue les plus importantes fonctionnalités de Pulse Builder pour apprendre à construire des plannings. Ce n'est pas exhaustif et pour plus de détails sur ce que vous pouvez faire à l'aide de Pulse Builder, consultez la référence d'API `Pulse <https://qiskit.org/documentation/apidoc/pulse.html>` __.
id_id: Di sini, kita akan melihat fitur Pulse Builder paling penting untuk belajar bagaimana membuat jadwal. Ini tidak lengkap; untuk detail lebih banyak mengenai yang dapat Anda lakukan menggunakan Pulse Builder, cek `referensi Pulsa API <https://qiskit.org/documentation/apidoc/pulse.html>`__.
ja_jp: ここでは、スケジュールの作成方法を学ぶための最も重要なPulse Builder機能について説明します。 ここの記述は完全なものではありません。Pulse Builder を使用してできることの詳細については、`Pulse API reference <https://qiskit.org/documentation/apidoc/pulse.html>`__ を参照してください。
ko: 여기에서는 스케줄을 작성하는 방법을 학습하고자 가장 중요한 Pulse Builder 기능을 검토한다. 이는 완전하지 않는다. 펄스 빌더를 사용하여 수행할 수 있는 작업에 대한 자세한 내용은 `Pulse API 참조 <https://qiskit.org/documentation/apidoc/pulse.html>`__ 를 확인하라.
pt_un: Aqui, vamos analisar os recursos mais importantes do Pulse Builder para aprender como criar agendamentos. Isto não aborda à exaustão; para mais detalhes sobre o que você pode fazer usando o Construtor de Pulso, confira a `Referência da API Pulso <https://qiskit.org/documentation/apidoc/pulse.html>`__.
ta: இங்கே, அட்டவணைகளை எவ்வாறு உருவாக்குவது என்பதைக் கற்றுக்கொள்வதற்கான மிக முக்கியமான பல்ஸ் பில்டர் அம்சங்களைப் பார்ப்போம். இது முழுமையானது அல்ல; பல்ஸ் பில்டரைப் பயன்படுத்தி நீங்கள் என்ன செய்ய முடியும் என்பது பற்றிய கூடுதல் விவரங்களுக்கு, இதனைப் `Pulse API reference <https://qiskit.org/documentation/apidoc/pulse.html>`__ பார்க்கவும்.
tr: Burada, çizelgelerin nasıl oluşturulacağını öğrenmek için en önemli Atım Derleyici özelliklerini gözden geçireceğiz. Bu kapsamlı değildir; Atım Derleyiciyi kullanarak neler yapabileceğiniz hakkında daha fazla ayrıntı için `Pulse API reference <https://qiskit.org/documentation/apidoc/pulse.html>`__ adresine bakın.

source: Alignment contexts
bn_bn: প্রান্তিককরণ প্রসঙ্গ
es_un: Contextos de alineación
fr: Contextes d'alignement
ja_jp: 配置コンテキスト
ko: 정렬 컨텍스트
pt_un: Contextos de alinhamento
ta: சீரமைப்பு சூழல்கள்
tr: Hizalama bağlamları

source: The builder has alignment contexts which influence how a schedule is built. Contexts can also be nested. Try them out, and use ``.draw()`` to see how the pulses are aligned.
bn_bn: বিল্ডার এর সারিবদ্ধকরণ প্রসঙ্গ রয়েছে যা একটি সময়সূচী কীভাবে তৈরি হয় তা প্রভাবিত করে। প্রসঙ্গগুলিও বাসা বাঁধতে পারে। তাদের চেষ্টা করে দেখুন, এবং pulse গুলি কিভাবে একত্রিত হয় তা দেখতে ".draw ()" ব্যবহার করুন।
es_un: El constructor tiene contextos de alineación que influyen en cómo se construye un planificador. Los contextos también se pueden anidar. Pruébalos y usa ``.draw()`` para ver cómo se alinean los pulsos.
fr: Le générateur comporte des contextes d'alignement qui influencent la manière dont un planning est généré. Les contextes peuvent également être imbriqués. Essayez-les et utilisez la méthode ``.draw ()`` pour voir comment les impulsions sont alignées.
id_id: Pembangun memiliki konteks penjajaran yang mempengaruhi bagaimana sebuah jadwal dibangun. Konteks juga dapat bersarang. Coba kerjakan, dan gunakan ``.draw()`` untuk melihat bagaimana pulsa yang disejajarkan.
ja_jp: ビルダーは、スケジュールの構築方法に影響する配置コンテキストを持ちます。 コンテキストを入れ子にすることもできます。それらを試し、``.draw()`` を使用してパルスがどのように配置されるかを確認してください。
ko: 빌더에는 스케줄 작성 방법에 영향을 주는 정렬 컨텍스트가 있다. 컨텍스트는 다중 구조가 될 수도 있다. 펄스가 어떻게 정렬되었는지 보려면 다중 구조 밖으로 나와서 ``.draw ()`` 를 사용한다.
pt_un: O construtor tem contextos de alinhamento que influenciam a forma como um agendamento é construído. Os contextos também podem ser aninhados. Experimente-os usando ``.draw()`` para ver como os pulsos se alinham.
ta: பில்டர் ஒரு அட்டவணை எவ்வாறு கட்டமைக்கப்படுகிறது என்பதைப் பாதிக்கும் சீரமைப்பு சூழல்களைக் கொண்டுள்ளது. சூழல்கள் கூட்டாகவும் சேர்க்கப்படலாம். அவற்றை முயற்சிக்கவும், பல்ஸ்களை எவ்வாறு சீரமைக்கப்படுகின்றன என்பதைக் காண ``.draw()`` ஐப் பயன்படுத்தவும்.
tr: Oluşturucu, bir çizelgenin nasıl oluşturulacağını etkileyen hizalama bağlamlarına sahiptir. Bağlamlar da iç içe olabilir. Bunları deneyin ve atımların nasıl hizalandığını görmek için ``.draw()`` kullanın.

source: Regardless of the alignment context, the duration of the resulting schedule is as short as it can be while including every instruction and following the alignment rules. This still allows some degrees of freedom for scheduling instructions off the “longest path”. The examples below illuminate this.
bn_bn: প্রান্তিককরণ প্রেক্ষাপট যাই হোক না কেন, সারিবদ্ধকরণের নিয়ম অনুসরণ করে এবং প্রতিটি নির্দেশনা সহ ফলাফলের সময়সূচী হবে যতটা সংক্ষিপ্ত সম্ভব। এটি এখনও "দীর্ঘতম পথ" থেকে নির্ধারিত নির্দেশাবলীর জন্য কিছু ডিগ্রী স্বাধীনতার অনুমতি দেয়। নীচের উদাহরণগুলি এটি আলোকিত করে।
es_un: Independientemente del contexto de alineación, la duración del planificador resultante es lo más breve posible, al incluir todas las instrucciones y seguir las reglas de alineación. Esto todavía permite algunos grados de libertad para planificar instrucciones fuera del “camino más largo”. Los ejemplos siguientes ilustran esto.
fr: Indépendamment du contexte d'alignement, la durée du planning résultant est aussi courte qu'elle peut l'être en incluant toutes les instructions et en suivant les règles d'alignement. Cela permet toujours quelques degrés de liberté pour planifier des instructions sur le « plus long chemin ». Les exemples ci-dessous illustrent cela.
id_id: Terlepas dari konteks penjajaran, durasi dari hasil penjadwalan akan sependek-pendeknya dengan memasukkan setiap instruksi dan mengikuti aturan penjajaran. Ini tetap memungkinkan beberapa derajat kebebasan untuk menjadwalkan instruksi dari "jalur terpanjang". Contoh di bawah akan mencerahkan ini.
ja_jp: 配置コンテキストに関係なく、結果のスケジュールの長さは、すべての命令を含め配置ルールに従うのと同等くらい短いです。これにより、「最も長いパス」から命令をスケジュールするある程度の自由度があります。以下の例ではこれを示しています。
ko: 정렬 컨텍스트에 관계없이, 결과 스케줄의 지속 시간은 모든 지시사항 및 정렬 규칙을 따르는 한 가능한 짧게 된다. 이는 여전히 “가장 긴 경로” 가 아니라면 소정의 자유도를 허용한다. 아래의 예제들은 이것을 조명한다.
pt_un: Independentemente do contexto do alinhamento, a duração do agendamento resultante é tão curta quanto pode ser enquanto inclui todas instruções e segue as regras do alinhamento. Isso ainda permite alguns graus de liberdade para agendar instruções fora do “caminho mais longo”. Os exemplos abaixo demonstram isso.
ta: சீரமைப்புச் சூழலைப் பொருட்படுத்தாமல், ஒவ்வொரு அறிவுறுத்தலையும் சேர்த்து, சீரமைப்பு விதிகளைப் பின்பற்றும்போது, ​​இதன் விளைவாக வரும் கால அட்டவணையின் காலம் குறுகியதாக இருக்கும்.“longest path” இருந்து வழிமுறைகளை திட்டமிடுவதற்கு இது இன்னும் சில அளவிலான சுதந்திரத்தை அனுமதிக்கிறது. கீழே உள்ள எடுத்துக்காட்டுகள் இதை விளக்குகின்றன.
tr: Hizalama bağlamından bağımsız olarak, ortaya çıkan programın süresi, her talimatı dahil ederken ve hizalama kurallarını takip ederken olabildiğince kısadır. Bu yine de “longest path” dışındaki talimatları planlamak için bir dereceye kadar serbestlik sağlar. Aşağıdaki örnekler bunu aydınlatmaktadır.

source: The builder has alignment contexts that influence how a schedule is built. The default is ``align_left``.
bn_bn: বিল্ডার এর সারিবদ্ধকরণ প্রসঙ্গ রয়েছে যা একটি সময়সূচী কীভাবে তৈরি হয় তা প্রভাবিত করে। ডিফল্ট হল "align_left"।
es_un: El constructor tiene contextos de alineación que influyen en cómo se construye un planificador. El valor predeterminado es ``align_left``.
fr: Le "Pulse Builder" possède des contextes d'alignement qui influencent la façon dont un planning est construit. La valeur par défaut est ``align_left``.
id_id: Pembangun memiliki konteks penjajaran yang mempengaruhi bagaimana sebuah jadwal dibangun. Lazimnya adalah ``align_left``.
ja_jp: ビルダーはスケジュールの構築方法に影響する配置コンテキストを持っています。デフォルトは ``align_left`` です。
ko: 빌더에는 스케줄 작성 방법에 영향을 주는 정렬 컨텍스트가 있다. 기본값은 ``align_left`` 이다.
pt_un: O construtor tem contextos de alinhamento que influenciam como um agendamento é construído. O padrão é ``align_left``.
ta: பில்டர் ஒரு அட்டவணை எவ்வாறு கட்டமைக்கப்படுகிறது என்பதைப் பாதிக்கும் சீரமைப்பு சூழல்களைக் கொண்டுள்ளது. இது இயல்பு நிலை ``align_left``.
tr: Oluşturucu, bir çizelgenin nasıl oluşturulacağını etkileyen hizalama bağlamlarına sahiptir. Varsayılan ``align_left`` şeklindedir.

source: Notice how there is no scheduling freedom for the pulses on ``D1``. The second waveform begins immediately after the first. The pulse on ``D0`` can start at any time between ``t=0`` and ``t=100`` without changing the duration of the overall schedule. The ``align_left`` context sets the start time of this pulse to ``t=0``. You can think of this like left-justification of a text document.
bn_bn: লক্ষ্য করুন কিভাবে "D1" এ পালস গুলির জন্য কোন নির্ধারিত স্বাধীনতা নেই। প্রথম তরঙ্গের পরপরই দ্বিতীয় তরঙ্গরূপ শুরু হয়। সামগ্রিক সময়সূচির সময়কাল পরিবর্তন না করে "D0" এর পালসটি "t = 0" এবং "t = 100" এর মধ্যে যেকোনো সময় শুরু হতে পারে। "Align_left" প্রসঙ্গ এই পালসটির শুরুর সময়কে "t = 0" এ সেট করে। আপনি এটিকে একটি টেক্সট ডকুমেন্টের বাম-ন্যায্যতার মতো ভাবতে পারেন।
es_un: Observa cómo no hay libertad de planificación para los pulsos en ``D1``. La segunda forma de onda comienza inmediatamente después de la primera. El pulso en ``D0`` puede comenzar en cualquier momento entre ``t=0`` y ``t=100`` sin cambiar la duración del planificador general. El contexto ``align_left`` establece la hora de inicio de este pulso en ``t=0``. Puedes pensar en esto como una justificación a la izquierda de un documento de texto.
fr: Remarquez qu'il n'y a pas de liberté de programmation pour les impulsions sur ``D1``. La seconde impulsion d'onde commence immédiatement après la première. L'impulsion sur ``D0`` peut commencer à tout moment entre ``t=0`` et ``t=100`` sans changer la durée de l'horaire global. Le contexte ``align_left`` définit l'heure de début de cette impulsion à ``t=0``. Vous pouvez y penser comme la justification à gauche d'un document texte.
id_id: Perhatikan bahwa tidak ada kebebasan penjadwalan untuk pulsa pada ``D1``. Bentuk gelombang kedua langsung mulai setelah yang pertama. Pulsa pada ``D0`` dapat mulai kapan saja antara ``t=0`` dan ``t=100`` tanpa mengubah durasi dari jadwal keseluruhan. Konteks ``align_left`` menetapkan waktu mulai pulsa ke ``t=0``. Anda dapat menganalogikan ini seperti justifikasi-kiri pada dokumen teks.
ja_jp: ``D1`` 上のパルスにはスケジューリングの自由度がないことに注意してください。2 番目の波形は最初の波形の直後に始まります。 ``D0`` 上のパルスは、スケジュール全体の期間を変更することなく、``t=0`` と ``t=100`` の間でいつでも開始できます。 ``align_left`` コンテキストでは、パルスの開始時刻を ``t=0`` に設定します。これはテキスト文書の左揃えのように考えることができます。
ko: ``D1`` 의 펄스에는 스케줄링의 자유도가 없다는 것을 주목하라. 두 번째 파형은 첫 번째 파형 직후에 시작된다. ``D0`` 의 펄스는 전반적인 스케줄의 지속 시간을 바꾸지 않고 ``t=0`` 과 ``t=100`` 사이에서 언제든지 시작할 수 있다. ``align_left`` 컨텍스트는 이 펄스의 시작 시간을 ``t=0`` 로 설정하는 것이다. 이것은 마치 글 문서에서의 왼쪽 맞춤과 비슷하게 생각할 수 있다.
pt_un: Observe como não há liberdade de agendamento para os pulsos no ``D1``. A segunda forma de onda começa imediatamente após a primeira. O pulso em ``D0`` pode começar em qualquer momento entre ``t=0`` e ``t=100`` sem mudar a duração do agendamento geral. O contexto ``align_left`` define o horário de início deste pulso para ``t=0``. Você pode pensar nisto como a justificação à esquerda de um documento de texto.
ta: ``D1`` இல் பல்ஸ்களுக்கு எப்படி திட்டமிடல் சுதந்திரம் இல்லை என்பதைக் கவனியுங்கள். இரண்டாவது அலைவடிவம் முதல் முடிந்த உடனேயே தொடங்குகிறது. ``D0`` இல் உள்ள துடிப்பு ``t = 0`` மற்றும் ``t = 100`` ஆகியவற்றுக்கு இடையில் எந்த நேரத்திலும் ஒட்டுமொத்த அட்டவணையின் கால அளவை மாற்றாமல் தொடங்கலாம். ``align_left`` சூழல் இந்த துடிப்பின் தொடக்க நேரத்தை ``t = 0`` என அமைக்கிறது. இதனை நீங்கள் உரை ஆவணத்தின் இடது-மையப்படுத்துதல் என நினைத்துக் கொள்ளலாம்.
tr: ``D1`` üzerindeki atımlar için nasıl zamanlama özgürlüğü olmadığına dikkat edin. İkinci dalga biçimi birinciden hemen sonra başlar. ``D0`` üzerindeki atım, genel programın süresini değiştirmeden ``t=0`` ile ``t=100`` arasında herhangi bir zamanda başlayabilir. ``align_left`` bağlamı, bu atımın başlangıç zamanını ``t=0`` olarak ayarlar. Bunu bir metin belgesinin sola yaslaması gibi düşünebilirsiniz.

source: Unsurprisingly, ``align_right`` does the opposite of ``align_left``. It will choose ``t=100`` in the above example to begin the gaussian pulse on ``D0``. Left and right are also sometimes called “as soon as possible” and “as late as possible” scheduling, respectively.
bn_bn: এটি আশ্চর্যজনক নয় যে ``align_right`` ``align_left`` এর বিপরীত কাজ করে। এটি ``D0`` এ গাউসিয়ান পালস শুরু করতে উপরের উদাহরণে ``t = 100`` নির্বাচন করবে। বাম এবং ডান কে কখনও কখনও যথাক্রমে "as soon as possible" এবং "as late as possible" সময়সূচী বলা হয়।
es_un: Como era de esperarse, ``align_right`` hace lo contrario de ``align_left``. Elegirá ``t=100`` en el ejemplo anterior para comenzar el pulso Gaussiano en ``D0``. La izquierda y la derecha también se denominan a veces planificación “lo antes posible” y “lo más tarde posible”, respectivamente.
fr: Sans surprise, ``align_right`` fait le contraire de ``align_left``. Il choisira ``t=100`` dans l'exemple ci-dessus pour commencer l'impulsion gaussienne sur ``D0``. La gauche et la droite sont aussi parfois appelées « aussi vite que possible » et « aussi tard que possible », respectivement.
id_id: Tidak mengherankan, ``align_right`` melakukan kebalikan dari ``align_left``. Itu akan memilih ``t=100`` pada contoh di atas untuk memulai pulsa gaussian ``D0``. Kiri dan kanan masing-masing juga kadang disebut sebagai penjadwalan "sesegera mungkin" dan "seterlambat mungkin".
ja_jp: 当然、``align_right`` は ``align_left`` の反対です。``D0`` 上でガウスパルスを開始する上記の例では ``t=100`` を選択します。 左と右は、それぞれ「できるだけ早く」と「できるだけ遅く」スケジューリングとも呼ばれることがあります。
ko: 당연하게도 ``align_right`` 는 ``align_left`` 와는 반대의 동작을 한다. 이는 ``D0`` 의 가우시안 펄스를 ``t=100`` 일 때 시작하도록 선택할 것이다. 좌우는 때때로 각각 "가능한 한 빨리" 와 "가능한 한 늦은" 스케줄링으로 불린다.
pt_un: Não surpreendentemente, ``align_right`` faz o oposto de ``align_left``. Ele escolherá ``t=100`` no exemplo acima para começar o pulso gaussiano em ``D0``. Esquerdo e direito são às vezes também chamados de agendamentos "assim que possível" e de "tão tarde quanto possível", respectivamente.
ta: ஆச்சரியப்படும் படி அல்லாமல், ``align_right`` ஆனது ``align_left`` க்கு நேர்மாறாக செயல்படுகிறது. ``D0`` இல் காஸியன் பல்ஸைத் தொடங்க இது மேலே உள்ள எடுத்துக்காட்டில் ``t = 100`` ஐத் தேர்ந்தெடுக்கும். இடது மற்றும் வலது சில நேரங்களில் முறையே “as soon as possible” மற்றும் “as late as possible” திட்டமிடல் என்றும் அழைக்கப்படுகின்றன.
tr: Şaşırtıcı olmayan bir şekilde, ``align_right``, ``align_left``in tersini yapar. Gauss atımını ``D0`` üzerinde başlatmak için yukarıdaki örnekte ``t=100``ü seçecektir. Sol ve sağ bazen sırasıyla “as soon as possible” ve “as late as possible” zamanlama olarak da adlandırılır.

source: If the duration of a particular block is known, you can also use ``align_equispaced`` to insert equal duration delays between each instruction.
bn_bn: যদি একটি নির্দিষ্ট ব্লকের সময়কাল জানা থাকে, আপনি প্রতিটি নির্দেশের মধ্যে একই সময়কাল বিলম্ব যুক্ত করতে ``align_equispaced`` ব্যবহার করতে পারেন।
es_un: Si se conoce la duración de un bloque en particular, también puedes usar ``align_equispaced`` para insertar retardos de igual duración entre cada instrucción.
fr: Si la durée d'un bloc particulier est connue, vous pouvez également utiliser ``align_equispaced`` pour insérer des délais d'égale durée entre chaque instruction.
id_id: Jika durasi dari blok tertentu diketahui, Anda dapat menggunakan ``align_equispaced`` untuk memasukkan penundaan durasi yang sama antara setiap instruksi.
ja_jp: 特定のブロックの期間がわかっている場合は、 ``align_equispace`` を使って各命令の間に同じ長さの遅延を挿入することもできます。
ko: 특정 블록의 지속 시간을 알고 있는 경우, 각 명령어 사이에 동일한 지속 시간 지연을 삽입하고자 ``align_equispaced`` 를 사용할 수도 있다.
pt_un: Se a duração de um determinado bloco é conhecida, você também pode usar ``align_equispaced`` para inserir atrasos de duração iguais entre cada instrução.
ta: ஒரு குறிப்பிட்ட தொகுதியின் காலம் தெரிந்தால், ஒவ்வொரு அறிவுறுத்தலுக்கும் இடையில் சம கால தாமதங்களைச் சேர்க்க ``align_equispaced`` ஐப் பயன்படுத்தலாம்.
tr: Belirli bir bloğun süresi biliniyorsa, her komut arasına eşit süreli gecikmeler eklemek için ``align_equispaced`` kullanabilirsiniz.

source: This alignment context does not schedule instructions in parallel. Each instruction will begin at the end of the previously added instruction.
bn_bn: এই প্রান্তিককরণ প্রসঙ্গ সমান্তরাল নির্দেশাবলী নির্ধারণ করে না। প্রতিটি নির্দেশ পূর্বে যোগ করা নির্দেশের শেষে শুরু হবে।
es_un: Este contexto de alineación no planifica instrucciones en paralelo. Cada instrucción comenzará al final de la instrucción agregada anteriormente.
fr: Ce contexte d'alignement ne prévoit pas d'instructions en parallèle. Chaque instruction commence à la fin de l'instruction précédemment ajoutée.
id_id: Konteks penjajaran ini tidak menjadwalkan instruksi secara paralel. Setiap instruksi akan dimulai pada akhir instruksi yang telah ditambahkan sebelumnya.
ja_jp: この配置コンテキストは、並列に命令をスケジュールしません。各命令は、以前に追加した命令の最後に開始されます。
ko: 이 정렬 컨텍스트는 지시사항을 병렬로 스케줄하지 않는다. 각 명령어는 이전에 추가된 명령어의 끝에서 시작된다.
pt_un: Este contexto de alinhamento não agenda as instruções em paralelo. Cada instrução começará ao final da instrução previamente adicionada.
ta: இந்த சீரமைப்புச் சூழல் இணையாக வழிமுறைகளைத் திட்டமிடவில்லை. ஒவ்வொரு அறிவுறுத்தலும் முன்னர் சேர்க்கப்பட்ட அறிவுறுத்தலின் முடிவிலேயே தொடங்கும்.
tr: Bu hizalama bağlamı, talimatları paralel olarak zamanlamaz. Her talimat, daha önce eklenen talimatın sonunda başlayacaktır.

source: Phase and frequency offsets
bn_bn: ফেজ এবং ফ্রিকোয়েন্সি অফসেট
es_un: Desplazamientos de fase y frecuencia
fr: Offsets de phase et de fréquence
ja_jp: 位相および周波数オフセット
ko: 위상 및 주파수 오프셋
pt_un: Deslocamentos de fase e frequência
ta: கட்டம் மற்றும் அதிர்வெண் ஆஃப்செட்டுகள்
tr: Faz ve frekans kesintileri

source: We can use the builder to help us temporarily offset the frequency or phase of our pulses on a channel.
bn_bn: আমরা একটি চ্যানেলে আমাদের ফ্রিকোয়েন্সি বা পালস এর পর্যায়কে অস্থায়ীভাবে অফসেট করতে বিল্ডার এর সহায়তা নিতে পারি।
es_un: Podemos usar el constructor para ayudarnos a desplazar temporalmente la frecuencia o fase de nuestros pulsos en un canal.
fr: Nous pouvons utiliser le "Pulse builder" pour nous aider à compenser temporairement la fréquence ou la phase de nos impulsions sur un canal.
id_id: Kita dapat menggunakan pembangun untuk membantu sementara dalam mengimbangi frekuensi atau fasa pulsa kita pada saluran.
ja_jp: このビルダーを使用すると、チャンネル上のパルスの周波数や位相を一時的に補正することができます。
ko: 이 빌더를 사용하여 채널의 펄스 주파수나 위상에 일시적인 오프셋을 줄 수 있다.
pt_un: Podemos usar o construtor para nos ajudar a deslocar temporariamente a frequência ou fase dos nossos pulsos em um canal.
ta: ஒரு சேனலில் நம் பல்ஸ்களின் அதிர்வெண் அல்லது கட்டத்தை தற்காலிகமாக ஈடுசெய்ய நாம் பில்டரைப் பயன்படுத்தலாம்.
tr: Bir kanaldaki atımlarımızın frekansını veya fazını geçici olarak dengelememize yardımcı olması için oluşturucuyu kullanabiliriz.

source: We encourage you to visit the `Pulse API reference <https://qiskit.org/documentation/apidoc/pulse.html>`__ to learn more.
bn_bn: আরো জানার জন্য আমরা আপনাকে `Pulse API reference <https://qiskit.org/documentation/apidoc/pulse.html>`__ দেখার জন্য উৎসাহিত করছি।
es_un: Te recomendamos que visites la `referencia de la API de Pulse <https://qiskit.org/documentation/apidoc/pulse.html>`__ para aprender más.
fr: Nous vous encourageons à consulter la référence pour l'API `Pulse <https://qiskit.org/documentation/apidoc/pulse.html>`__ pour en savoir plus.
id_id: Kita menganjurkan Anda untuk berkunjung ke `referensi Pulsa API <https://qiskit.org/documentation/apidoc/pulse.html>`__ untuk belajar lebih banyak.
ja_jp: 詳細については、`Pulse API reference <https://qiskit.org/documentation/apidoc/pulse.html>`__ を参照することをお勧めします。
ko: 더 많은 정보를 얻을 수 있도록 `펄스 API 참조 <https://qiskit.org/documentation/apidoc/pulse.html>`__ 를 방문하라.
pt_un: Nós o encorajamos a visitar a `Referência API Pulse <https://qiskit.org/documentation/apidoc/pulse.html>`__ para saber mais.
ta: மேலும் இதனைப் பற்றி அறிந்து கொள்ள, நாங்கள் உங்களை இதனைப் `Pulse API reference <https://qiskit.org/documentation/apidoc/pulse.html>`__ பார்வையிட ஊக்குவிக்கிறோம்.
tr: Daha fazla bilgi edinmek için `Pulse API reference <https://qiskit.org/documentation/apidoc/pulse.html>`__ adresini ziyaret etmenizi öneririz.

source: alt text
ko: 대체 텍스트
tr: alternatif metin

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/06_building_pulse_schedules.ipynb>`_.
id_id: Jalankan secara interaktif di `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/06_building_pulse_schedules.ipynb>`_.
