Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/06_building_pulse_instructions.po
Languages: fr_fr, pt_br

source: This page was generated from `tutorials/circuits_advanced/06_building_pulse_instructions.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/circuits_advanced/06_building_pulse_instructions.ipynb`__.
pt_br: Esta página foi gerada de `tutorials/circuits_advanced/06_building_pulse_instructions.ipynb`__.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/06_building_pulse_instructions.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/06_building_pulse_instructions.ipynb>`_.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/06_building_pulse_instructions.ipynb>`_.

source: Building Pulse Instructions
fr_fr: Construire des instructions Pulse
pt_br: Construindo Instruções Pulse

source: Pulse programs, which are called ``Schedule``\ s, describe instruction sequences for the control electronics.
fr_fr: Les programmes Pulse, appelés ` ` Schedule ` ` \ s, décrivent des séquences d'instructions pour l'électronique de contrôle.
pt_br: Programas Pulse, que são chamados de ``Schedule``\ s, descrevem sequências de instruções para a eletrônica de controle.

source: On this page, we will cover in depth these ``Instruction``\ s available through Qiskit Pulse:
fr_fr: Sur cette page, nous allons couvrir en profondeur ces ``Instruction``\ s disponibles via Qiskit Pulse :
pt_br: Nesta página, cobriremos, em profundidade, estas ``Instruction``\ s disponíveis por meio do Qiskit Pulse:

source: Each instruction type has its own set of operands. As you can see above, they each include at least one ``Channel`` to specify where the instruction will be applied.
fr_fr: Chaque type d'instruction possède son propre ensemble d'opérandes. Comme vous pouvez le voir ci-dessus, ils incluent chacun au moins un ` ` Channel ` ` pour spécifier où l'instruction sera appliquée.
pt_br: Cada tipo de instrução possui seu próprio conjunto de operandos. Como você pode ver, acima, cada um deles inclui, pelo menos, um ``Channel`` para especificar, onde a instrução será aplicada.

source: **Channels** are labels for signal lines from the control hardware to the quantum chip.
fr_fr: ** Les canaux ** (``Channels``) sont des étiquettes pour les lignes de signal depuis le matériel (`` hardware``) de contrôle jusqu'à la puce quantique.
pt_br: **Canais** são rótulos de linhas de sinal do hardware de controle para o chip quântico.

source: ``DriveChannel``\ s are typically used for *driving* single qubit rotations,
fr_fr: ` ` DriveChannel ` ` \ s sont généralement utilisés pour * conduire * des rotations de qubits uniques,
pt_br: ``DriveChannel``\ s são tipicamente utilizados para *conduzir* rotações de um único qubit,

source: ``ControlChannel``\ s are typically used for multi-qubit gates or additional drive lines for tunable qubits,
fr_fr: Les ``ControlChannel``\ s sont généralement utilisés pour des portes multi-qubits ou les lignes de commande supplémentaires pour les qubits réglables,
pt_br: ``ControlChannel``\ s são tipicamente usados para portas multi-qubit ou linhas de transmissão adicionais para qubits ajustáveis,

source: ``MeasureChannel``\ s are specific to transmitting pulses which stimulate readout, and
fr_fr: ` ` MeseChannel ` ` \ s sont spécifiques à la transmission des impulsions qui stimulent la lecture, et
pt_br: ``MeasureChannel``\ s são específicos para transmissão de pulsos, que estimulam a leitura, e

source: ``AcquireChannel``\ s are used to trigger digitizers which collect readout signals.
fr_fr: ` ` AcquireChannel ` ` \ s sont utilisés pour déclencher des numériseurs qui collectent des signaux de lecture.
pt_br: ``AcquireChannel``\ s são usados para acionar digitalizadores, que coletam sinais de leitura.

source: ``DriveChannel``\ s, ``ControlChannel``\ s, and ``MeasureChannel``\ s are all ``PulseChannel``\ s; this means that they support *transmitting* pulses, whereas the ``AcquireChannel`` is a receive channel only and cannot play waveforms.
fr_fr: ` ` DriveChannel ` ` \ s, ` ` ControlChannel ` ` \ s, et ` ` MeasureChannel ` ` \ s sont tous ` ` PulseChannel ` ` \ s ; cela signifie qu'ils prennent en charge * les impulsions de transmission *, alors que ` ` AcquireChannel ` ` est un canal de réception seulement et ne peut pas générer de formes d'ondes.
pt_br: ``DriveChannel``\ s, ``ControlChannel``\ s, e ``MeasureChannel``\ s são todos ``PulseChannel``\ s; Isto significa que eles suportam a *transmissão* de pulsos, enquanto o ``AcquireChannel`` é apenas um canal receptor e não pode gerar ondas.

source: For the following examples, we will create one ``DriveChannel`` instance for each ``Instruction`` that accepts a ``PulseChannel``. Channels take one integer ``index`` argument. Except for ``ControlChannel``\ s, the index maps trivially to the qubit label.
fr_fr: Pour les exemples suivants, nous allons créer une instance ` ` DriveChannel ` ` pour chaque ` ` Instruction ` ` qui accepte un ` ` PulseChannel ` `. Les canaux prennent un argument d'entier ` ` index ` `. A l'exception de ` ` ControlChannel ` ` \ s, l'index se mappe trivialement sur l'étiquette du qubit.
pt_br: Para os seguintes exemplos, vamos criar uma instância ``DriveChannel`` para cada ``Instruction``, que aceita um ``PulseChannel``. Canais recebem um argumento ``index`` inteiro. Exceto pelos ``ControlChannel``\ s, o índice mapeia trivialmente para o rótulo do qubit.

source: One of the simplest instructions we can build is ``Delay``. This is a blocking instruction that tells the control electronics to output no signal on the given channel for the duration specified. It is useful for controlling the timing of other instructions.
fr_fr: L'une des instructions les plus simples que nous pouvons construire est ` ` Delay ` `. Il s'agit d'une instruction de blocage qui indique à l'électronique de contrôle de ne générer aucun signal sur le canal donné, pour la durée spécifiée. Il est utile pour contrôler le minutage (´´timing´´) des autres instructions.
pt_br: Uma das instruções mais simples, que podemos construir, é a ``Delay``. Trata-se de uma instrução de bloqueio, que diz à eletrônica de controle, para não produzir nenhum sinal, no canal determinado pela duração especificada. Ela é útil para controlar a cronometragem (timing) de outras instruções.

source: The duration here and elsewhere is in terms of the backend’s cycle time (1 / sample rate), ``dt``.
fr_fr: La durée ici et ailleurs est exprimée en termes de temps de cycles du backend (1 / taux d'échantillonnage), ``dt``.

source: To build a ``Delay`` instruction, we pass the duration and channel:
fr_fr: Pour construire une instruction ` ` Delay ` `, nous transmettons la durée et le canal:
pt_br: Para construir uma instrução ``Delay``, passamos a duração e o canal:

source: where ``channel`` can be any kind of channel, including ``AcquireChannel``.
fr_fr: où ``channel`` peut être n'importe quel canal, y compris ``AcquireChannel``.
pt_br: onde ``channel`` pode ser qualquer tipo de canal, incluindo o ``AcquireChannel``.

source: That’s all there is to it. This instruction, ``delay_5dt``, is ready to be included in a ``Schedule``. Any instruction appended after ``delay_5dt`` on the same channel will execute five timesteps later than it would have without this delay.
fr_fr: C'est tout ce qu'il y a à faire. Cette instruction, ``delay_5dt``, est prête à être incluse dans un ``Schedule``. Toute instruction ajoutée après ``delay_5dt`` sur le même canal exécutera cinq intervalles de temps plus tard qu'elle ne l'aurait fait sans ce délai.

source: The ``Play`` instruction is responsible for executing *pulses*. It’s straightforward to build one:
fr_fr: L'instruction ``Play`` permet l'exécution des *impulsions* (pulses). Il est simple d'en construire une:

source: Let’s clarify what the ``pulse`` argument is and explore a few different ways to build one.
fr_fr: Précisons ce qu'est l'argument de ``pulse`` et explorons quelques façons différentes de construire un.

source: Pulses
fr_fr: Impulsions (``Pulses``)
pt_br: Pulsos

source: A ``Pulse`` specifies an arbitrary pulse *envelope*. The modulation frequency and phase of the output waveform are controlled by the ``SetFrequency`` and ``ShiftPhase`` instructions, which we will cover next.
fr_fr: Un ``Pulse`` spécifie une impulsion arbitraire *enveloppe*. La fréquence de modulation et la phase de la forme d'onde de sortie sont contrôlées par les instructions ``SetFrequency`` et ``ShiftPhase``, que nous couvrirons ensuite.
pt_br: Um ``Pulse`` especifica um *envelope* de pulso arbitrário. A frequência de modulação e a fase da onda de saída são controladas pelas instruções ``SetFrequency`` e ``ShiftPhase``, que abordaremos, em seguida.

source: The image below may provide some intuition for why they are specified separately. Think of the pulses which describe their envelopes as input to an arbitrary waveform generator (AWG), a common lab instrument – this is depicted in the left image. Notice the limited sample rate discritizes the signal. The signal produced by the AWG may be mixed with a continuous sine wave generator. The frequency of its output is controlled by instructions to the sine wave generator; see the middle image. Finally, the signal sent to the qubit is demonstrated by the right side of the image below.
fr_fr: L'image ci-dessous peut fournir une certaine intuition pour la raison pour laquelle ils sont spécifiés séparément. Pensez aux impulsions qui décrivent leurs enveloppes comme entrées dans un générateur de forme d'onde arbitraire (AWG, Arbitrary Waveform Generator), un instrument de laboratoire commun -- ceci est représenté dans l'image de gauche. Remarquez que le taux d'échantillonnage limité rend le signal discret. Le signal produit par l'AWG peut être mélangé avec un générateur d'ondes sinusoïdales continue. La fréquence de sa sortie est contrôlée par des instructions au générateur d'onde sinusoïdale ; voir l'image du milieu. Enfin, le signal envoyé au qubit est montré sur le côté droit de l'image ci-dessous.

source: **Note**: The hardware may be implemented in other ways, but if we keep the instructions separate, we avoid losing explicit information, such as the value of the modulation frequency.
fr_fr: **Note** : Le matériel peut être implémenté par d'autres moyens, mais si nous gardons les instructions séparées, nous évitons de perdre des informations explicites, comme la valeur de la fréquence de modulation.
pt_br: **Nota**: O hardware pode ser implementado de outras formas, mas se mantivermos as instruções separadas, evitamos perder informação explícita, como o valor da frequência de modulação.

source: There are many methods available to us for building up pulses. Our ``library`` within Qiskit Pulse contains helpful methods for building ``Pulse``\ s. Let’s take for example a simple Gaussian pulse – a pulse with its envelope described by a sampled Gaussian function. We arbitrarily choose an amplitude of 1, standard deviation :math:`\sigma` of 10, and 128 sample points.
fr_fr: Il existe de nombreuses méthodes pour construire les impulsions. Notre ``bibliothèque`` dans Qiskit Pulse contient des méthodes utiles pour construire des `` Pulse`` \ s. Prenons par exemple une simple impulsion gaussienne -- une impulsion dont l'enveloppe est décrite par une fonction gaussienne échantillonnée. Nous avons choisi arbitrairement une amplitude de 1, une déviation standard :math:`\sigma` de 10, et 128 points d'échantillonnage.

source: Parametric pulses
fr_fr: Impulsions paramétriques
pt_br: Pulsos paramétricos

source: Let’s build our Gaussian pulse using the ``Gaussian`` parametric pulse. A parametric pulse sends the name of the function and its parameters to the backend, rather than every individual sample. Using parametric pulses makes the jobs you send to the backend much smaller. IBM Quantum backends limit the maximum job size that they accept, so parametric pulses may allow you to run larger programs.
fr_fr: Construisons notre impulsion Gaussienne en utilisant l'impulsion paramétrique ``Gaussian``. Une impulsion paramétrique envoie le nom de la fonction et de ses paramètres au système d'exécution (backend), plutôt qu'à chaque échantillon individuel. L'utilisation d'impulsions paramétriques rend les tâches que vous envoyez au backend beaucoup plus petites. IBM Quantum backends limitent la taille maximale de travail qu'ils acceptent, de sorte que les impulsions paramétriques peuvent vous permettre d'exécuter des programmes plus grands.

source: Other parametric pulses in the ``library`` include ``GaussianSquare``, ``Drag``, and ``ConstantPulse``.
fr_fr: Les autres impulsions paramétriques de la librairie (``library``) incluent ``GaussianSquare``, ``Drag`` et ``ConstantPulse``.
pt_br: Outros pulsos paramétricos na ``library`` incluem ``GaussianSquare``, ``Drag``, e ``ConstantPulse``.

source: **Note**: The backend is responsible for deciding exactly how to sample the parametric pulses. It is possible to draw parametric pulses, but the samples displayed are not guaranteed to be the same as those executed on the backend.
fr_fr: ** Note**: L'e système d'exécution (´´backend´´) est chargé de décider exactement comment échantillonner les impulsions paramétriques. Il est possible de dessiner des impulsions paramétriques, mais les échantillons affichés ne sont pas garantis d'être les mêmes que ceux exécutés sur le backend.
pt_br: **Nota**: O serviço é responsável por decidir, exatamente, como amostrar os pulsos paramétricos. É possível desenhar pulsos paramétricos, mas as amostras exibidas não são, necessariamente, as mesmas que são executadas no backend.

source: **Pulse waveforms described by samples**
fr_fr: ** Les formes d'onde des impulsions décrites par les échantillons * *
pt_br: **Formas de onda de pulso descritas por amostras**

source: It is also possible to specify the waveform as an array of samples. We pass the samples to a ``Waveform``.
fr_fr: Il est également possible de spécifier la forme d'onde (``Waveform``) comme une rangée (``array``) d'échantillons. Nous transmettons les échantillons à un ` ` Waveform` `.
pt_br: Também é possível especificar a forma de onda, como uma matriz de amostras. Passamos as amostras para um ``Waveform``.

source: **Pulse library functions**
fr_fr: **Fonctions de la bibliothèque (``library``) d'impulsions**
pt_br: **Funções da biblioteca Pulse**

source: Our own pulse library has sampling methods to build a ``Waveform`` from common functions.
fr_fr: Notre propre bibliothèque d'impulsions a des méthodes d'échantillonnage pour construire un ` ` Waveform ` ` à partir de fonctions communes.
pt_br: A nossa própria biblioteca de pulsos tem métodos de amostragem para criar uma ``Waveform`` de funções comuns.

source: External libraries
fr_fr: Librairies (Biblitothèques) externes
pt_br: Bibliotecas externas

source: Alternatively, you can make use of an external library.
fr_fr: Vous pouvez également utiliser une bibliothèque externe.
pt_br: Alternativamente, você pode fazer uso de uma biblioteca externa.

source: Regardless of which method you use to specify your ``pulse``, ``Play`` is instantiated the same way:
fr_fr: Quelle que soit la méthode que vous utilisez pour spécifier votre impulsion (``pulse``), ``Play`` est instanciée de la même manière :
pt_br: Independentemente, de qual método você use para especificar o seu ``pulse``, ``Play`` é instanciada da mesma forma:

source: The ``Play`` instruction gets its duration from its ``Pulse``: the duration of a parametrized pulse is an explicit argument, and the duration of a ``Waveform`` is the number of input samples.
fr_fr: L'instruction ``Play`` récupère sa durée depuis son ``Pulse`` : la durée d'une impulsion paramétrée est un argument explicite, et la durée d'un ``Waveform`` est le nombre d'échantillons d'entrée.
pt_br: A instrução ``Play`` obtém sua duração, a partir do seu ``Pulse``: a duração de um pulso parametrizado é um argumento explícito, e a duração de uma ``Waveform`` é o número de amostras de entrada.

source: The frequency of a channel can be updated at any time within a ``Schedule`` by the ``SetFrequency`` instruction. It takes a float ``frequency`` and a ``PulseChannel`` ``channel`` as input. All pulses on a channel following a ``SetFrequency`` instruction will be modulated by the given frequency until another ``SetFrequency`` instruction is encountered or until the program ends.
fr_fr: La fréquence d'un canal peut être mise à jour à tout moment dans un ``Schedule`` par l'instruction ``SetFrequency``. Il prend une ``frequency`` flottante et un ``PulseChannel`` en entrée. Toutes les impulsions sur un canal suivant une instruction ``SetFrequency`` seront modulées par la fréquence donnée jusqu'à ce qu'une autre instruction ``SetFrequency`` soit rencontrée ou jusqu'à ce que le programme se termine.
pt_br: A frequência de um canal pode ser atualizada, a qualquer momento, dentro de uma ``Schedule`` pela instrução ``SetFrequency``. Ela recebe um float ``frequency`` e um ``channel`` ``PulseChannel`` como entrada. Todos os pulsos em um canal, depois de uma instrução ``SetFrequency``, serão modulados pela frequência dada, até que outra instrução ``SetFrequency`` seja encontrada ou, até que o programa termine.

source: The instruction has an implicit duration of ``0``.
fr_fr: L'instruction a une durée implicite de ` ` 0 ` `.
pt_br: A instrução tem uma duração implícita de ``0``.

source: **Note**: The frequencies that can be requested are limited by the total bandwidth and the instantaneous bandwidth of each hardware channel. In the future, these will be reported by the ``backend``.
fr_fr: ** Remarque: Les fréquences qui peuvent être demandées sont limitées par la bande passante totale et la bande passante instantanée de chaque canal matériel (``hardware``). A l'avenir, ces informations seront rapportées par le ` ` backend ` `.
pt_br: **Nota**: As frequências, que podem ser solicitadas, são limitadas pela largura de banda total e pela largura de banda instantânea de cada canal de hardware. No futuro, estas serão reportadas pelo ``backend``.

source: The ``ShiftPhase`` instruction will increase the phase of the frequency modulation by ``phase``. Like ``SetFrequency``, this phase shift will affect all following instructions on the same channel until the program ends. To undo the affect of a ``ShiftPhase``, the negative ``phase`` can be passed to a new instruction.
fr_fr: L'instruction ``ShiftPhase`` augmentera la phase de la modulation de fréquence par ``phase``. Comme ``SetFrequency``, ce décalage de phase affectera toutes les instructions suivantes sur le même canal jusqu'à la fin du programme. Pour annuler l'effet d'une ``ShiftPhase``, la ``phase`` négative peut être passée à une nouvelle instruction.
pt_br: A instrução ``ShiftPhase`` aumentará a fase da modulação de frequência por ``phase``. Como na ``SetFrequency``, este deslocamento de fase afetará todas as instruções seguintes no mesmo canal, até que o programa termine. Para desfazer o efeito de uma ``ShiftPhase``, a ``phase`` negativa pode ser passada para uma nova instrução.

source: Like ``SetFrequency``, the instruction has an implicit duration of ``0``.
fr_fr: Comme ` ` SetFrequency ` `, l'instruction a une durée implicite de ` ` 0 ` `.
pt_br: Tal como a ``SetFrequency``, a instrução tem uma duração implícita de ``0``.

source: ``Acquire``
fr_fr: ` ` Acquérir ` `

source: The ``Acquire`` instruction triggers data acquisition for readout. It takes a duration, an ``AcquireChannel`` which maps to the qubit being measured, and a ``MemorySlot`` or a ``RegisterSlot``. The ``MemorySlot`` is classical memory where the readout result will be stored. The ``RegisterSlot`` maps to a register in the control electronics which stores the readout result for fast feedback.
fr_fr: L'instruction ``Acquire`` déclenche l'acquisition de données pour readout. Il prend une durée, un ``AcquireChannel`` qui correspond au qubit mesuré, et un ``MemorySlot`` ou un ``RegisterSlot``. Le ``MemorySlot`` est une mémoire classique où le résultat de lecture sera stocké. Le ``RegisterSlot`` correspond à un registre dans l'électronique de contrôle qui stocke le résultat de lecture pour un feedback rapide.
pt_br: A instrução ``Acquire`` aciona a aquisição de dados para leitura. Ela recebe uma duração, um ``AcquireChannel``, que mapeia para o qubit sendo medido e um ``MemorySlot`` ou um ``RegisterSlot``. O ``MemorySlot`` é memória clássica, onde o resultado da leitura será armazenado. O ``RegisterSlot`` mapeia para um registrador na electrónica de controle, que armazena o resultado de leitura para feedback rápido.
