Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/06_building_pulse_schedules.po
Languages: bn_bn, es_un, fr, id_id, ja_jp, ko, pt_un, ta, tr

source: You may also supply a complex list or array directly to ``play``
bn_bn: আপনি একটি জটিল তালিকা বা অ্যারে সরাসরি ``play`` তে সরবরাহ করতে পারেন
es_un: También puedes proporcionar una lista o matriz compleja directamente para ``play``
fr: Vous pouvez également fournir une liste ou un tableau de complexes directement pour ``play``
ko: 또한, 복소수 리스트나 배열을 ``play`` 에 직접 제공할 수도 있다.
pt_un: Você também pode fornecer uma lista complexa ou matriz diretamente para ``play``
ta: நீங்கள் ஒரு சிக்கலான பட்டியல் அல்லது வரிசையை நேரடியாக ``play`` க்கு வழங்கலாம்
tr: Ayrıca doğrudan ``play`` için karmaşık bir liste veya dizi de sağlayabilirsiniz

source: The ``play`` instruction gets its duration from its ``Pulse``: the duration of a parametrized pulse is an explicit argument, and the duration of a ``Waveform`` is the number of input samples.
bn_bn: ``প্লে`` নির্দেশটি তার ``পালস`` থেকে এর সময়কাল পায়: একটি প্যারামেট্রাইজড পালসের সময়কাল একটি স্পষ্ট আর্গুমেন্ট, এবং একটি ``ওয়েভফর্ম`` এর সময়কাল ইনপুট নমুনার সংখ্যা।
es_un: La instrucción ``play`` obtiene su duración de su ``Pulse``: la duración de un pulso parametrizado es un argumento explícito, y la duración de una ``Waveform`` es el número de muestras de entrada.
fr: L'instruction ``play`` récupère sa durée depuis son ``Pulse`` : la durée d'une impulsion paramétrée est un argument explicite, et la durée d'un ``Waveform`` est le nombre d'échantillons d'entrée.
id_id: Instruksi ``play`` mendapatkan durasinya dari ``Pulse``: durasi dari pulsa yang diparameterisasi adalah argumen eksplisit, dan durasi dari ``Waveform`` adalah jumlah dari sampel masukan.
ja_jp: ``play`` 命令は、``Pulse`` から期間を取得します。パラメーター化されたパルスの期間は明示的な引数であり、``Waveform``の期間は入力サンプルの数です。
ko: ``Play`` 명령어의 지속 시간(duration)은 ``Pulse`` 에서 가져온다: 매개변수화된 펄스의 지속 시간은 명시적으로 인자에 전달되고, ``Waveform`` 의 지속 시간은 입력 샘플의 수이다.
pt_un: A instrução ``play`` obtém a duração de seu ``Pulse``: a duração de um pulso parametrizado é um argumento explícito e a duração de uma ``Waveform`` é o número de amostras de entrada.
ta: ``play`` அறிவுறுத்தல் அதன் கால அளவை அதன் ``Pulse`` இலிருந்து பெறுகிறது: அளவுருவாக்கப்பட்ட பல்ஸின் காலம் வெளிப்படையான ஆர்க்யுமென்ட் ஆகும், மேலும் ``Waveform`` காலம் உள்ளீட்டு மாதிரிகளின் எண்ணிக்கை.
tr: ``play`` komutu, süresini ``Pulse``den alır: parametreli bir atım süresi açık bir argümandır ve ``Waveform``un süresi girdi örneklerinin sayısıdır.

source: As explained previously, the output pulse waveform envelope is also modulated by a frequency and phase. Each channel has a `default frequency listed in the backend.defaults() <08_gathering_system_information.ipynb#Defaults>`__.
bn_bn: পূর্বে ব্যাখ্যা করা হয়েছে, আউটপুট পালস তরঙ্গাকৃতি আচ্ছাদন এছাড়াও একটি ফ্রিকোয়েন্সি এবং ফেজ দ্বারা সংশোধন করা হয়। প্রতিটি চ্যানেলের একটি `default frequency listed in the backend.defaults() <08_gathering_system_information.ipynb#Defaults>`__ আছে।
es_un: Como se explicó anteriormente, la envolvente de la forma de onda del pulso de salida también está modulada por una frecuencia y una fase. Cada canal tiene una `frecuencia predeterminada listada en backend.defaults() <08_gathering_system_information.ipynb#Defaults>`__.
fr: Comme nous l'avons expliqué précédemment, l'enveloppe de l'impulsion de sortie est également modulée par une fréquence et une phase. Chaque canal a une `fréquence par défaut accessible par backend.defaults () <08_gathering_system_information.ipynb#Defaults>`__.
ja_jp: 前述したように、出力パルス波形エンベロープも周波数と位相によって変調されます。各チャンネルには、 backend.defaults() にリストされているデフォルトの周波数があります（`参照 <08_gathering_system_information.ipynb#Defaults>`__ ）。
ko: 앞서 설명한 바와 같이, 출력 펄스의 파형 포락선 또한 주파수와 위상에 변조된다. 각 채널은 `backend.defaults()에 나열된 기본 주파수 <08_gathering_system_information.ipynb#Defaults>`__ 를 가진다.
pt_un: Como explicado anteriormente, o envelope da forma de onda do pulso de saída também é modulado por uma frequência e fase. Cada canal possui uma `frequência padrão listada no ``backend.defaults()`` <09_gathering_system_information.ipynb#Defaults>`__.
ta: முன்பு விளக்கியது போல, வெளியீட்டு துடிப்பு அலைவடிவ உறை ஒரு அதிர்வெண் மற்றும் கட்டத்தால் மாற்றியமைக்கப்படுகிறது. ஒவ்வொரு சேனலுக்கும் `default frequency listed in the backend.defaults() <08_gathering_system_information.ipynb#Defaults>`__ இல் பட்டியலிடப்பட்டுள்ளது.
tr: Daha önce açıklandığı gibi, çıkış atımları dalga biçimi zarfı da bir frekans ve faz tarafından modüle edilir. Her kanalın `default frequency listed in the backend.defaults() <08_gathering_system_information.ipynb#Defaults>`__ içinde listelenen varsayılan bir frekansı vardır.

source: The frequency of a channel can be updated at any time within a ``Schedule`` by the ``set_frequency`` instruction. It takes a float ``frequency`` and a ``PulseChannel`` ``channel`` as input. All pulses on a channel following a ``set_frequency`` instruction will be modulated by the given frequency until another ``set_frequency`` instruction is encountered or until the program ends.
bn_bn: একটি চ্যানেলের ফ্রিকোয়েন্সি ``set_frequency`` নির্দেশ দ্বারা একটি ``সময়সূচী`` এর মধ্যে যে কোন সময় আপডেট করা যেতে পারে। এটি একটি float ``ফ্রিকোয়েন্সি`` এবং একটি ``PulseChannel`` ``চ্যানেল`` ইনপুট হিসাবে নেয়। একটি ``set_frequency`` নির্দেশ অনুসরণ করে একটি চ্যানেলে সমস্ত তড়িৎস্পন্দন বা পালস প্রদত্ত ফ্রিকোয়েন্সি দ্বারা মড্যুলেট করা হবে যতক্ষণ না অন্য একটি ``set_frequency`` নির্দেশনা আসে অথবা প্রোগ্রাম শেষ না হওয়া পর্যন্ত।
es_un: La frecuencia de un canal se puede actualizar en cualquier momento dentro de un ``Schedule`` mediante la instrucción ``set_frequency``. Toma una ``frequency`` de tipo flotante y un ``channel`` tipo ``PulseChannel`` como entrada. Todos los pulsos en un canal que siguen una instrucción ``set_frequency`` serán modulados por la frecuencia dada hasta que se encuentre otra instrucción ``set_frequency`` o hasta que finalice el programa.
fr: La fréquence d'un canal peut être mise à jour à tout moment dans un ``Schedule`` par l'instruction ``set_frequency``. Il prend une ``frequency`` flottante et un ``PulseChannel`` en entrée. Toutes les impulsions sur un canal suivant une instruction ``set_frequency`` seront modulées par la fréquence donnée jusqu'à ce qu'une autre instruction ``set_frequency`` soit rencontrée ou jusqu'à ce que le programme se termine.
id_id: Frekuensi dari sebuah saluran dapat diperbarui kapan saja dalam sebuah ``Schedule`` oleh instruksi ``set_frequency``. Akan diambil float ``frequency`` dan sebuah ``PulseChannel`` ``channel`` sebagai masukan. Semua pulsa dalam saluran setelah instruksi ``set_frequency`` akan dimodulasi oleh frekuensi yang diberikan sampai instruksi ``set_frequency`` lain ditemukan atau sampai program selesai.
ja_jp: チャンネルの周波数は、 ``set_frequency`` 命令により ``Schedule`` 内でいつでも更新できます。浮動小数点の ``frequency`` と ``PulseChannel`` ``channel`` を入力として受け取ります。 ``set_frequency`` 命令に続くチャンネル上のすべてのパルスは、別の ``set_frequency`` 命令が検出されるまで、またはプログラムが終了するまで、指定された周波数で変調されます。
ko: 채널의 주파수는 ``set_frequency`` 명령어를 사용해 ``Schedule`` 내에서 언제든지 갱신할 수 있다. 이는 부동소숫점(float) 타입의 ``frequency`` 와 ``PulseChannel``, ``channel`` 을 입력으로 받는다. ``set_frequency`` 명령어가 적용되는 채널 안의 모든 펄스는 다른 ``set_frequency`` 명령을 만나거나 프로그램이 종료될 때까지 주어진 주파수에 의해 변조된다.
pt_un: A frequência de um canal pode ser atualizada, a qualquer momento, dentro de uma ``Schedule`` pela instrução ``set_frequency``. Leva uma ``frequency`` do tipo flutuante e um ``PulseChannel`` ``canal`` como entrada. Todos os pulsos em um canal na sequência de uma instrução ``set_frequency`` serão modulados pela frequência determinada até que outra instrução ``set_frequency`` seja encontrada ou até que o programa termine.
ta: சேனலின் அதிர்வெண் எந்த நேரத்திலும் ``Schedule`` க்குள் ``set_frequency`` அறிவுறுத்தலால் புதுப்பிக்கப்படலாம். இது ஒரு float ``frequency`` மற்றும் ``PulseChannel`` ``channel`` ஆகியவற்றை உள்ளீடாக எடுக்கும். ``set_frequency`` அறிவுறுத்தலைத் தொடர்ந்து ஒரு சேனலில் உள்ள அனைத்து பல்ஸ்களும் மற்றொரு ``set_frequency`` அறிவுறுத்தல் வரும் வரை அல்லது நிரல் முடியும் வரை கொடுக்கப்பட்ட அதிர்வெண் மூலம் மாற்றியமைக்கப்படும்.
tr: Bir kanalın frekansı, ``set_frequency`` komutuyla ``Schedule`` dahilinde herhangi bir zamanda güncellenebilir. Girdi olarak bir kayan nokta ``frequency`` ve bir ``PulseChannel`` ``channel`` alır. Bir ``set_frequency`` komutunu izleyen bir kanaldaki tüm atımlar, başka bir ``set_frequency`` komutuyla karşılaşılıncaya veya program bitene kadar verilen frekans tarafından modüle edilecektir.

source: The instruction has an implicit duration of ``0``.
bn_bn: নির্দেশটির ``0`` এর একটি অন্তর্নিহিত সময়কাল রয়েছে।
es_un: La instrucción tiene una duración implícita de ``0``.
fr: L'instruction a une durée implicite de ``0``.
id_id: Instruksi memiliki durasi implisit ``0``.
ja_jp: 命令の暗黙の期間は ``0`` です。
ko: 명령어는 암묵적으로 ``0`` 의 지속시간을 갖는다.
pt_un: A instrução tem uma duração implícita de ``0``.
ta: அறிவுறுத்தலுக்கு ``0`` என்ற மறைமுக காலம் உள்ளது.
tr: Talimatın mutlak süresi ``0``dır.

source: **Note**: The frequencies that can be requested are limited by the total bandwidth and the instantaneous bandwidth of each hardware channel. In the future, these will be reported by the ``backend``.
bn_bn: **দ্রষ্টব্য**: যে ফ্রিকোয়েন্সিগুলি অনুরোধ করা যেতে পারে তা মোট ব্যান্ডউইথ এবং প্রতিটি হার্ডওয়্যার চ্যানেলের তাৎক্ষণিক ব্যান্ডউইথ দ্বারা সীমাবদ্ধ। ভবিষ্যতে, এগুলি ``ব্যাকএন্ড`` দ্বারা রিপোর্ট করা হবে।
es_un: **Nota**: Las frecuencias que se pueden solicitar están limitadas por el ancho de banda total y el ancho de banda instantáneo de cada canal de hardware. En el futuro, estos serán reportados por el ``backend``.
fr: **Remarque**: Les fréquences qui peuvent être demandées sont limitées par la bande passante totale et la bande passante instantanée de chaque canal matériel (``hardware``). A l'avenir, ces informations seront rapportées par le ``backend``.
id_id: **Catatan**: Frekuensi yang dapat diminta dibatasi oleh bandwidth total dan bandwidth sesaat dari setiap saluran perangkat keras. Di masa depan, hal ini akan dilaporkan oleh ``backend``.
ja_jp: **注記** ：要求できる周波数は、各ハードウェア・チャンネルの合計帯域幅と瞬時帯域幅によって制限されます。将来的には、これらは ``backend`` によって報告されます。
ko: **참고**: 요청할 수 있는 주파수는 총 대역폭과 각 하드웨어 채널의 순간 대역폭에 의해 제한된다. 향후 이러한 정보는 ``backend`` 를 통해 보고 받을 수 있을 것이다.
pt_un: **Nota**: as frequências que podem ser solicitadas são limitadas pela largura de banda total e pela largura de banda instantânea de cada canal de hardware. No futuro, estes serão reportados pelo ``backend``.
ta: **குறிப்பு**: கோரக்கூடிய அதிர்வெண்கள் மொத்த அலைவரிசை மற்றும் ஒவ்வொரு வன்பொருள் சேனலின் உடனடி அலைவரிசை ஆகியவற்றால் வரையறுக்கப்படுகின்றன. எதிர்காலத்தில், இவை ``backend`` -ல் புகாரளிக்கப்படும்.
tr: **Not**: Talep edilebilecek frekanslar, her bir donanım kanalının toplam bant genişliği ve anlık bant genişliği ile sınırlıdır. Gelecekte, bunlar ``backend`` tarafından rapor edilecektir.

source: The ``shift_phase`` instruction will increase the phase of the frequency modulation by ``phase``. Like ``set_frequency``, this phase shift will affect all following instructions on the same channel until the program ends. To undo the affect of a ``shift_phase``, the negative ``phase`` can be passed to a new instruction.
bn_bn: ``Shift_phase`` নির্দেশ ফ্রিকোয়েন্সি মড্যুলেশন এর ফেজ ``phase`` দ্বারা বৃদ্ধি করবে। ``Set_frequency`` এর মত, এই ফেজ শিফট প্রোগ্রাম শেষ না হওয়া পর্যন্ত একই চ্যানেলে নিম্নলিখিত সমস্ত নির্দেশাবলীকে প্রভাবিত করবে। একটি ``shift_phase`` এর প্রভাব পূর্বাবস্থায় ফেরানোর জন্য, negative ``ফেজ`` একটি নতুন নির্দেশে প্রেরণ করা যেতে পারে।
es_un: La instrucción ``shift_phase`` aumentará la fase de la modulación de frecuencia por ``phase``. Al igual que ``set_frequency``, este cambio de fase afectará a todas las instrucciones siguientes en el mismo canal hasta que finalice el programa. Para deshacer el efecto de un ``shift_phase``, la ``phase`` negativa se puede pasar a una nueva instrucción.
fr: L'instruction ``shift_phase`` augmentera la phase de la modulation de fréquence d'une quantité correspondant à la valeur de ``phase``. Comme pour ``set_frequency``, ce décalage de phase affectera toutes les instructions suivantes sur le même canal jusqu'à la fin du programme. Pour annuler l'effet d'une ``shift_phase``, il faudra en refaire une avec la quantité opposé comme valeur de ``phase``.
id_id: Instruksi ``shift_phase`` akan meningkatkan fasa dari modulasi frekuensi sebanyak ``phase``. Seperti ``set_frequency``, pergeseran fasa akan berdampak pada semua instruksi setelahnya di saluran yang sama sampai program selesai. Untuk membatalkan pengaruh dari ``shift_phase``, ``phase`` negatif dapat diberikan sebagai instruksi baru.
ja_jp: ``shift_phase`` 命令は、周波数変調の位相を ``phase`` ごとに増やします。 ``set_frequency`` と同様に、この位相シフトは、プログラムが終了するまで、同じチャンネル上のすべての後続の命令に影響します。 ``shift_phase`` の影響を元に戻すには、負の ``phase`` を新しい命令に渡すことができます。
ko: ``shift_phase`` 명령어는 주파수 변조의 위상을 ``phase`` 만큼 증가시킨다. ``set_frequency`` 와 마찬가지로 이 위상 이동은 프로그램이 끝날 때까지 동일한 채널의 모든 후속 명령에 영향을 미친다. ``shift_phase`` 의 영향을 되돌리려면 음수로 된 ``phase`` 를 새로운 명령어로 전달할 수 있다.
pt_un: A instrução ``shift_phase`` aumentará a fase da modulação de frequência por ``phase``. Como ``set_frequency``, essa alteração de fase afetará todas as instruções seguintes no mesmo canal até que o programa termine. Para desfazer o efeito de um ``shift_phase``, o negativo da ``phase`` pode ser passado para uma nova instrução.
ta: ``shift_phase`` அறிவுறுத்தல் அதிர்வெண் பண்பேற்றத்தின் கட்டத்தை ``phase`` அதிகரிக்கும். ``set_frequency`` ஐப் போலவே, இந்த கட்ட மாற்றமும் நிரல் முடியும் வரை ஒரே சேனலில் பின்வரும் அனைத்து வழிமுறைகளையும் பாதிக்கும். ``shift_phase`` இன் பாதிப்பைச் செயல்தவிர்க்க, எதிர்மறையான ``phase`` ஒரு புதிய அறிவுறுத்தலுக்கு அனுப்பப்படலாம்.
tr: ``shift_phase`` komutu, frekans modülasyonunun fazını ``phase`` kadar artıracaktır. ``set_frequency`` gibi, bu faz kayması, program bitene kadar aynı kanaldaki tüm takip eden talimatları etkileyecektir. Bir ``shift_phase``'in etkisini geri almak için, negatif ``phase`` yeni bir komuta geçirilebilir.

source: Like ``set_frequency``, the instruction has an implicit duration of ``0``.
bn_bn: ``Set_frequency`` এর মত, নির্দেশের ``0`` এর অন্তর্নিহিত সময়কাল রয়েছে।
es_un: Como ``set_frequency``, la instrucción tiene una duración implícita de ``0``.
fr: Comme ``set_frequency``, l'instruction a une durée implicite de ``0``.
id_id: Seperti ``set_frequency``, instruksi ini memiliki durasi implit ``0``.
ja_jp: ``set_frequency`` と同様に、命令の暗黙の期間は ``0`` です。
ko: ``set_frequency`` 와 같이, 이 명령어는 암묵적으로 ``0`` 의 지속 시간을 갖는다.
pt_un: Como ``set_frequency``, a instrução tem uma duração implícita de ``0``.
ta: ``set_frequency`` போலவே, அறிவுறுத்தலும் ``0`` இன் மறைமுக காலத்தைக் கொண்டுள்ளது.
tr: ``set_frequency`` gibi, talimatın mutlak süresi ``0``dır.

source: The ``acquire`` instruction triggers data acquisition for readout. It takes a duration, an ``AcquireChannel`` which maps to the qubit being measured, and a ``MemorySlot`` or a ``RegisterSlot``. The ``MemorySlot`` is classical memory where the readout result will be stored. The ``RegisterSlot`` maps to a register in the control electronics which stores the readout result for fast feedback.
bn_bn: ``acquire`` নির্দেশনাটি রিডআউট এর জন্য ডেটা অধিগ্রহণকে ট্রিগার করে। এটি একটি সময় নেয়, একটি ``AcquireChannel`` যা পরিমাপকৃত কিউবিট, এবং একটি ``MemorySlot`` বা ``RegisterSlot`` কে ম্যাপ করে। ``MemorySlot`` হল ক্লাসিক্যাল মেমরি যেখানে রিডআউট ফলাফল সংরক্ষণ করা হবে। ``RegisterSlot`` কন্ট্রোল ইলেকট্রনিক্সের একটি রেজিস্টারে ম্যাপ করে যা দ্রুত প্রতিক্রিয়া জানার জন্য রিডআউট ফলাফল সংরক্ষণ করে।
es_un: La instrucción ``acquire`` activa la adquisición de datos para su lectura. Se necesita una duración, un ``AcquireChannel`` que se asigna al qubit que se está midiendo y un ``MemorySlot`` o un ``RegisterSlot``. El ``RegisterSlot`` es una memoria clásica donde se almacenará el resultado de la lectura. El ``RegisterSlot`` se asigna a un registro en la electrónica de control que almacena el resultado de la lectura para una respuesta rápida.
fr: L'instruction ``acquire`` déclenche l'acquisition de données pour effectuer une lecture. Il prend en argument une durée, un ``AcquireChannel`` qui correspond au qubit mesuré, et un ``MemorySlot`` ou un ``RegisterSlot``. Le ``MemorySlot`` est une mémoire classique où le résultat de lecture sera stocké. Le ``RegisterSlot`` correspond à un registre dans l'électronique de contrôle qui stocke le résultat de lecture pour un resultat rapide.
id_id: Instruksi ``acquire`` memicu akuisisi data untuk bacaan. Ini membutuhkan sebuah durasi, sebuah ``AcquireChannel`` yang akan memetakan ke qubit yang diukur, dan sebuah ``MemorySlot`` atau ``RegisterSlot``. ``MemorySlot`` merupakan memori klasik di mana hasil bacaan akan disimpan. ``RegisterSlot`` memetakan ke register di elektronik kontrol yang menyimpan hasil bacaan untuk umpan balik yang cepat.
ja_jp: ``acquire`` 命令は、読み出しのためのデータ取得をトリガーします。 それは、持続時間、測定されている量子ビットにマップする ``AcquireChannel`` および、 ``MemorySlot`` または ``RegisterSlot`` を必要とします。 ``MemorySlot`` は、読み出し結果が保存される古典的なメモリです。 ``RegisterSlot`` は、高速フィードバックのための読み出し結果を保存する制御電子回路のレジスタにマッピングします。
ko: ``acquire`` 명령어는 읽을 데이터 수집을 촉발한다. 측정될 큐비트에 매핑되는 ``AcquireChannel`` 과, ``MemorySlot`` 또는 ``RegisterSlot`` 을 수행하는 데는 시간이 걸린다. ``MemorySlot`` 은 읽은 결과가 저장될 고전적인 메모리이다. ``RegisterSlot`` 은 빠른 피드백을 위해 읽은 결과를 저장하는 제어 전자 장치의 레지스터에 매핑된다.
pt_un: A instrução ``acquire`` dispara a aquisição de dados para leitura. Tem a duração, um ``AcquireChannel`` que mapeia o qubit sendo medido, e um ``MemorySlot`` ou um ``RegisterSlot``. O ``MemorySlot`` é a memória clássica onde o resultado da leitura será armazenado. O ``RegisterSlot`` mapeia para um registro em um controle eletrônico que armazena o resultado de leitura para rápido feedback.
ta: ``acquire`` அறிவுறுத்தல் வாசிப்புக்கான தரவு கையகப்படுத்துதலைத் தூண்டுகிறது. சில கால அவகாசம் எடுத்துக்கொண்டு ``AcquireChannel`` அளவிடப்படும் க்யூபிட்டை வரையறுக்கப்படுகிறது, மற்றும் ஒரு ``MemorySlot`` அல்லது ``RegisterSlot``. ``MemorySlot`` என்பது கிளாசிக்கல் நினைவகம், அங்கு ரீட்அவுட் முடிவு சேமிக்கப்படும். கட்டுப்பாட்டு மின்னணுவியலில் ஒரு பதிவேட்டில் ``RegisterSlot`` வரையறுக்கப்படும், இது விரைவான பின்னூட்டத்திற்கான ரீட்அவுட் முடிவை சேமிக்கிறது.
tr: ``acquire`` komutu, okuma için veri alımını tetikler. Bir süre, ölçülen kübitle eşleşen bir ``AcquireChannel`` ve bir ``MemorySlot`` veya ``RegisterSlot`` alır. ``MemorySlot`` okuma sonucunun saklanacağı klasik hafızadır. ``RegisterSlot``, hızlı geri bildirim için okuma sonucunu saklayan kontrol elektroniğindeki bir kayıtla eşlenir.

source: The ``acquire`` instructions can also take custom ``Discriminator``\ s and ``Kernel``\ s as keyword arguments.
bn_bn: ``acquire`` নির্দেশাবলী কাস্টম ``Discriminator``\ s এবং ``Kernel``\ s গুলিকে কীওয়ার্ড আর্গুমেন্ট হিসাবে গ্রহণ করতে পারে।
es_un: Las instrucciones ``acquire`` también pueden tomar ``Discriminator``\ s y ``Kernel``\ s personalizados como palabras clave en los argumentos.
fr: Les instructions ``acquire`` peuvent également prendre des ``Discriminator``\ s personnalisés et des ``Kernel``\ s en tant qu'arguments de mot-clé.
id_id: Instruksi ``acquire`` juga dapat mengambil ``Discriminator``\ s dan ``Kernel``\ s suaian sebagai argumen keyword.
ja_jp: ``acquire`` 命令は、キーワード引数としてカスタム``Discriminator``と``Kernel``を取ることもできます。
ko: ``acqurie`` 명령어는 또한 키워드 인수로써 사용자 정의 ``Discriminator``\ 들과 커널 ``Kernel``\ 들을 받을 수 있다.
pt_un: As instruções ``acquire`` também podem considerar ``Discriminator``\ s personalizados e ``Kernel``\ s como argumentos de palavras-chave.
ta: ``acquire`` வழிமுறைகள் தனிப்பயன் `Discriminator``\ கள் மற்றும் ``Kernel``\ கள் முக்கிய ஆர்க்யுமென்ட்களாக எடுத்துக் கொள்ளலாம்.
tr: ``acquire`` talimatları ayrıca özel ``Discriminator``\ s ve ``Kernel``\ s anahtar kelime bağımsız değişkenlerini alabilir.

source: Now that we know how to add ``Schedule`` instructions, let’s learn how to control exactly when they’re played.
bn_bn: এখন যেহেতু আমরা ``Schedule`` নির্দেশাবলী কিভাবে যোগ করতে জানি, আসুন জেনে নিই কিভাবে সেগুলি চালালে ঠিকভাবে নিয়ন্ত্রণ করা যায়।
es_un: Ahora que sabemos cómo agregar instrucciones ``Schedule``, aprendamos a controlar exactamente cuándo son ejecutadas.
fr: Maintenant que nous savons comment ajouter des instructions de type ``Schedule``, apprenons à contrôler exactement quand elles sont executées.
id_id: Sekarang setelah kita tahu bagaimana menambah instruksi ``Schedule``, mari kita belajar bagaimana mengontrol ketika mereka dimainkan.
ja_jp: ``Schedule`` 命令を追加する方法がわかったので、再生されるタイミングを正確に制御する方法を学びましょう。
ko: 이제 스케줄 ``Schedule`` 명령어를 추가하는 방법을 알고 있으니, 그들이 발생될 때 정확하게 제어하는 방법을 배운다.
pt_un: Agora que sabemos como adicionar instruções ``Schedule``, vamos aprender a controlar exatamente quando elas são executadas.
ta: ``Schedule`` வழிமுறைகளை எவ்வாறு சேர்ப்பது என்பது இப்போது நமக்குத் தெரியும், அவை செயல்படுத்தும் போது எவ்வாறு கட்டுப்படுத்துவது என்பதைக் கற்றுக்கொள்வோம்.
tr: Artık "Schedule" talimatlarının nasıl ekleneceğini bildiğimize göre, tam olarak ne zaman haraket edeceğini, nasıl kontrol edeceğimizi öğrenelim.

source: Pulse Builder
bn_bn: পালস বিল্ডার
es_un: Constructor de Pulso
fr: Générateur d'impulsions
ko: 펄스 빌더 (Pulse Builder)
pt_un: Construtor de pulso
ta: பல்ஸ் பில்டர்
tr: Atım Oluşturucu
