Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/06_building_pulse_schedules.po
Languages: bn_bn, es_un, fr, id_id, ja_jp, ko, pt_un, ta, tr

source: **Note**: The hardware may be implemented in other ways, but if we keep the instructions separate, we avoid losing explicit information, such as the value of the modulation frequency.
bn_bn: ** দ্রষ্টব্য **: হার্ডওয়্যার অন্যান্য উপায়েও প্রয়োগ করা যেতে পারে, কিন্তু যদি আমরা নির্দেশাবলী গুলি আলাদা রাখি, তাহলে আমরা স্পষ্ট তথ্য হারানো এড়াতে পারি , যেমন মড্যুলেশন ফ্রিকোয়েন্সিটির মান।
es_un: **Nota**: El hardware puede implementarse de otras formas, pero si mantenemos las instrucciones separadas, evitamos perder información explícita, como el valor de la frecuencia de modulación.
fr: **Note** : Le matériel peut être implémenté par d'autres moyens, mais si nous gardons les instructions séparées, nous évitons de perdre des informations, comme la valeur de la fréquence de modulation.
id_id: **Catatan**: Perangkat keras dapat diimplementasikan dengan cara lain, tetapi jika kita menjaga instruksinya terpisah, kita menghindari kehilangan informasi eksplisit, seperti nilai dari frekuensi modulasi.
ja_jp: **注記** ：ハードウェアは他の方法で実装することもできますが、命令を別々にしておけば、変調周波数の値などの明示的な情報が失われるのを回避できます。
ko: **Note**: 하드웨어는 다른 방식으로 구현될 수 있지만, 명령어를 분리해서 설정하면 변조 주파수의 값과 같은 명시적 정보가 손실되는 것을 피할 수 있다.
pt_un: **Nota**: O hardware pode ser implementado de outras formas, mas se mantivermos as instruções separadas, evitamos perder informação explícita, como o valor da frequência de modulação.
ta: **குறிப்பு**: வன்பொருள் பிற வழிகளில் செயல்படுத்தப்படலாம், ஆனால் நாம் வழிமுறைகளை தனித்தனியாக வைத்திருந்தால், பண்பேற்றம் அதிர்வெண்ணின் மதிப்பு போன்ற வெளிப்படையான தகவல்களை இழப்பதைத் தவிர்க்கிறோம்.
tr: **Not**: Donanım başka şekillerde uygulanabilir, ancak talimatları ayrı tutarsak, modülasyon frekansının değeri gibi açık bilgileri kaybetmekten kaçınırız.

source: There are many methods available to us for building up pulses. Our ``library`` within Qiskit Pulse contains helpful methods for building ``Pulse``\ s. Let’s take for example a simple Gaussian pulse – a pulse with its envelope described by a sampled Gaussian function. We arbitrarily choose an amplitude of 1, standard deviation :math:`\sigma` of 10, and 128 sample points.
bn_bn: তড়িৎস্পন্দন বা পালস তৈরির জন্য আমাদের কাছে অনেক পদ্ধতি রয়েছে। Qiskit তড়িৎস্পন্দন বা পালসের মধ্যে আমাদের ``library`` এর মধ্যে ``Pulse``নির্মাণের জন্য সহায়ক পদ্ধতি রয়েছে। উদাহরণস্বরূপ একটি সাধারণ গাউসিয়ান তড়িৎস্পন্দন বা পালস ধরা যাক - একটি পালস যার আচ্ছাদন একটি নমুনাযুক্ত গাউসিয়ান ফাংশন দ্বারা বর্ণিত। আমরা নির্বিচারে 1 এর একটি প্রশস্ততা, আদর্শ বিচ্যুতি: :math:`\sigma` 10 এবং 128 টি নমুনা পয়েন্ট নির্বাচন করি।
es_un: Disponemos de muchos métodos para construir pulsos. Nuestra ``library`` dentro de Qiskit Pulse contiene métodos útiles para construir ``Pulse``\ s. Tomemos, por ejemplo, un pulso Gaussiano simple – un pulso con su envolvente descrita por una función Gaussiana muestreada. Elegimos arbitrariamente una amplitud de 1, desviación estándar :math:`\sigma` de 10 y 128 puntos de muestra.
fr: Il existe de nombreuses méthodes pour construire les impulsions. Notre ``bibliothèque`` dans Qiskit Pulse contient des méthodes utiles pour construire des `` Pulse`` \ s. Prenons par exemple une simple impulsion gaussienne -- une impulsion dont l'enveloppe est décrite par une fonction gaussienne échantillonnée. Nous avons choisi arbitrairement une amplitude de 1, une déviation standard :math:`\sigma` de 10, et 128 points d'échantillonnage.
id_id: Ada banyak metode yang tersedia bagi kita untuk membangun pulsa. ``library`` kami pada Qiskit Pulse mengandung metode yang berguna untuk membangun ``Pulse``\ s. Mari kita ambil contoh pulsa Gaussian sederhana – pulsa dengan amplopnya dideskripsikan oleh fungsi Gaussian yang disampel. Kita memilih apa saja amplitudo dari 1, standar deviasi :math:`\sigma` dari 10, dan 128 titik sampel.
ja_jp: パルスを構築するために利用できる方法は多くあります。Qiskit Pulse 内の ``library`` には、 ``Pulse`` を構築するための便利なメソッドが含まれています。たとえば、単純なガウスパルス、つまりサンプリングされたガウス関数によって記述されたエンベロープを持つパルスを考えてみましょう。振幅1、標準偏差10 :math:`\sigma` 、および128サンプルポイントを任意に選択します。
ko: 펄스를 생성할 수 있는 많은 방법들이 있다. Qiskit Pulse 내의 ``library`` 에는 ``Pulse``\ 들을 생성하는 유용한 방법이 포함되어 있다. 가우시안 펄스 (Gaussian pulse, 가우스 함수를 샘플링하여 포락선을 갖는다)를 예로 들어보자. 임의로 진폭을 1, 표준 편차 :math:`\sigma` 를 10으로 하여 128개의 샘플 개수를 선택한다.
pt_un: Há muitos métodos disponíveis para a construção de pulsos. A nossa ``library``, dentro do Qiskit Pulse, contém métodos úteis para a construção de ``Pulse``\ s. Tomemos, por exemplo, um pulso Gaussiano simples -- um pulso com seu envelope, descrito por uma função gaussiana amostrada. Escolhemos, arbitrariamente, uma amplitude de 1, um desvio-padrão :math:`\sigma` de 10, e 128 pontos de amostragem.
ta: பல்ஸ் வகைகளை உருவாக்குவதற்கு நமக்குப் பல முறைகள் உள்ளன. Qiskit Pulse -க்குள் உள்ள எங்கள் ``library``, ``Pulse``\ களை உருவாக்குவதற்கான பயனுள்ள முறைகளைக் கொண்டுள்ளது. உதாரணமாக ஒரு எளிய காஸியன் பல்ஸ் - ஒரு மாதிரி காஸியன் செயல்பாட்டால் விவரிக்கப்பட்டுள்ள உறை கொண்ட ஒரு பல்ஸ். வீச்சு 1, நிலையான விலகல் :math:`\sigma` of 10 மற்றும் 128 மாதிரி புள்ளிகளை நாம் தன்னிச்சையாகத் தேர்வு செய்கிறோம்.
tr: Atımları oluşturmak için elimizde birçok yöntem var. Qiskit Pulse içindeki ``library`` ``Pulse``\ 'lar oluşturmak için yararlı yöntemler içerir. Örneğin, basit bir Gauss atımını ele alalım - örneklenmiş bir Gauss işleviyle tanımlanan zarfı olan bir atım. İsteğe bağlı olarak 1 genlik, standart sapma :math:`\sigma` 10 ve 128 örnek nokta seçiyoruz.

source: **Note**: The amplitude norm is arbitrarily limited to ``1.0``. Each backend system may also impose further constraints – for instance, a minimum pulse size of 64. These additional constraints, if available, would be provided through the ``BackendConfiguration`` which is described `here <08_gathering_system_information.ipynb#Configuration>`__.
bn_bn: টীকা: প্রশস্ততার মান নির্বিচারে ``1.0`` এর মধ্যে সীমাবদ্ধ। প্রতিটি ব্যাকএন্ড সিস্টেম আরও সীমাবদ্ধতা আরোপ করতে পারে - উদাহরণস্বরূপ, 64 এর ন্যূনতম পালস আকার। যদি এই অতিরিক্ত সীমাবদ্ধতা পাওয়া যায়, ``BackendConfiguration`` এর মাধ্যমে প্রদান করা হবে যা <08_gathering_system_information.ipynb#Configuration> -এ বর্ণনা করা হয়েছে ।
es_un: **Nota**: La norma de la amplitud está limitada arbitrariamente a ``1.0``. Cada sistema de backend también puede imponer restricciones adicionales, por ejemplo, un tamaño de pulso mínimo de 64. Estas restricciones adicionales, si están disponibles, se proporcionarían a través de la ``BackendConfiguration`` que se describe `aquí <08_gathering_system_information.ipynb#Configuration>`__.
fr: **Note** : L'amplitude maximale autorisée est ``1.0``. Chacun des système peut toutefois imposer des contraintes supplémentaires sur le nombre minimum et maximum d'échantillons autorisés dans une impulsion. Ces contraintes supplémentaires, si disponibles, sont fournies par la fonction ``BackendConfiguration`` qui est décrite `ici <08_gathering_system_information.ipynb#Configuration>`__.
id_id: **Catatan**: Norm amplitudo terbatas sampai ``1.0``. Setiap sistem backend dapat memberikan batasan lebih lanjut – sebagai contoh, ukuran pulsa minimal 64. Batasan-batasan tambahan ini, jika ada, disediakan melalui ``BackendConfiguration`` yang dijelaskan `di sini <08_gathering_system_information.ipynb#Configuration>`__.
ja_jp: 注記：振幅ノルムは ``1.0`` に制限されています。個々のバックエンドシステムは、更なる制約、例えば最小パルスサイズは64など、も課しています。これらの追加の制約は、利用可能な場合、 `ここ <08_gathering_system_information.ipynb#Configuration>`__ で説明する ``BackendConfiguration`` を通じて提供されます。
ko: **참고**: 진폭 크기는 ``1.0`` 로 제한된다. 또한 각 백엔드 시스템은 최소 펄스 크기를 64로 두는 것과 같은 추가적인 제약을 가할 수 있다. 이러한 추가적인 제약 조건들은 `여기 <08_gathering_system_information.ipynb#Configuration>`__ 에 기술된 ``BackendConfiguration`` 를 통해 제공된다.
pt_un: **Nota**: A norma de amplitude é, arbitrariamente, limitada a ``1.0``. Cada sistema de backend, também pode impor mais restrições – por exemplo, um tamanho de pulso mínimo de 64. Estas restrições adicionais, se disponíveis, seriam fornecidas, através da ``BackendConfiguration`` que é descrita `aqui <08_gathering_system_information.ipynb#Configuration>`__.
ta: **குறிப்பு**: வீச்சு விதிமுறை தன்னிச்சையாக ``1.0`` என வரையறுக்கப்பட்டுள்ளது. ஒவ்வொரு பின்தளத்தில் அமைப்பும் மேலும் தடைகளை விதிக்கக்கூடும் - உதாரணமாக, குறைந்தபட்ச பல்ஸ் அளவு 64. இந்த கூடுதல் தடைகள் கிடைத்தால், ``BackendConfiguration`` மூலம் வழங்கப்படும், அது விவரமாகப் பார்க்கலாம் `இங்கு <08_gathering_system_information.ipynb#Configuration>`__.
tr: **Not**: Genlik normu keyfi olarak ``1.0`` ile sınırlıdır. Her arka uç sistemi ayrıca başka kısıtlamalar da uygulayabilir – örneğin, minimum 64 atım boyutu. Bu ek kısıtlamalar, varsa, burada açıklanan ``BackendConfiguration`` aracılığıyla sağlanır `here <08_gathering_system_information.ipynb#Configuration>`__.

source: Parametric pulses
bn_bn: পরামিতিক তড়িৎস্পন্দন বা পালস
es_un: Pulsos paramétricos
fr: Impulsions paramétriques
id_id: Pulsa Parametrik
ja_jp: パラメトリック・パルス
ko: 매개변수 펄스
pt_un: Pulsos paramétricos
ta: அளவுரு பல்ஸ்கள்
tr: Parametrik atımlar

source: Let’s build our Gaussian pulse using the ``Gaussian`` parametric pulse. A parametric pulse sends the name of the function and its parameters to the backend, rather than every individual sample. Using parametric pulses makes the jobs you send to the backend much smaller. IBM Quantum backends limit the maximum job size that they accept, so parametric pulses may allow you to run larger programs.
bn_bn: আসুন ``গাউসিয়ান`` প্যারামেট্রিক তড়িৎস্পন্দন বা পালস ব্যবহার করে আমাদের গাউসিয়ান পালস তৈরি করি। একটি প্যারামেট্রিক পালস প্রতিটি স্বতন্ত্র নমুনার পরিবর্তে ব্যাকএন্ডে ফাংশনের নাম এবং এর প্যারামিটার পাঠায়। প্যারামেট্রিক তড়িৎস্পন্দন বা পালস ব্যবহার করে আপনি ব্যাকএন্ডে পাঠানো কাজগুলিকে অনেক ছোট করে দেয়। আইবিএম কোয়ান্টাম ব্যাকএন্ডগুলি তাদের কাজের সর্বোচ্চ আকার সীমিত করে, তাই প্যারামেট্রিক তড়িৎস্পন্দন বা পালসগুলি আপনাকে বড় প্রোগ্রাম চালানোর অনুমতি দিতে পারে।
es_un: Construyamos nuestro pulso Gaussiano usando el pulso paramétrico ``Gaussian``. Un pulso paramétrico envía el nombre de la función y sus parámetros al backend, en lugar de cada muestra individual. El uso de pulsos paramétricos hace que los trabajos que envías al backend sean mucho más pequeños. Los backends de IBM Quantum limitan el tamaño máximo de trabajo que aceptan, por lo que los pulsos paramétricos pueden permitirte ejecutar programas más grandes.
fr: Construisons notre impulsion Gaussienne en utilisant l'impulsion paramétrique ``Gaussian``. Une impulsion paramétrique envoie le nom de la fonction et de ses paramètres au système d'exécution (backend), plutôt qu'à chaque échantillon individuel. L'utilisation d'impulsions paramétriques rend les tâches que vous envoyez au backend beaucoup plus petites. IBM Quantum backends limitent la taille maximale de travail qu'ils acceptent, de sorte que les impulsions paramétriques peuvent vous permettre d'exécuter des programmes plus grands.
id_id: Mari kita membuat pulsa Gaussian memakai pulsa parametrik ``Gaussian``. Sebuah pulsa parametrik mengirim nama dari fungsi dan parameternya ke backend, bukan setiap sampel individu. Menggunakan pulsa parametrik membuat pekerjaan yang Anda kirim ke backend jauh lebih kecil. Backend IBM Quantum memberikan batas pekerjaan maksimum yang diterima sehingga pulsa parametrik memungkinkan Anda menjalankan program yang lebih besar.
ja_jp: ``Gaussian`` パラメトリック・パルスを使用してガウスパルスを作成してみましょう。パラメトリック・パルスは、個々のサンプルごとではなく、関数の名前とそのパラメーターをバックエンドに送信します。 パラメトリック・パルスを使用すると、バックエンドに送信するジョブがはるかに小さくなります。 IBM Quantum バックエンドは、それらが受け入れる最大ジョブサイズを制限するため、パラメトリック・パルスを使うことで、より大きなプログラムを実行できる場合があります。
ko: 가우시안 펄스를 ``Gaussian`` 매개변수 펄스를 이용해 만들어 보자. 매개변수 펄스는 개별적인 샘플들이 아니라 함수의 이름과 매개변수들을 백엔드에 전송한다. 매개변식 펄스를 사용하면 백엔드에 보내는 작업이 훨씬 작아지게 된다. IBM 양자 백엔드는 수용하는 최대 작업 크기를 제한하므로, 매개변수 펄스로 더 큰 프로그램을 실행할 수 있다.
pt_un: Vamos construir nosso pulso gaussiano usando o pulso paramétrico ``Gaussian``. Um pulso paramétrico envia o nome da função e seus parâmetros para o backend, ao invés de cada amostra individual. Usar pulsos paramétricos torna muito menor o trabalho que você manda para o backend. Os backends IBM Quantum limitam o tamanho máximo do trabalho que eles aceitam, então pulsos paramétricos podem permitir que você execute programas maiores.
ta: ``Gaussian`` அளவுரு பல்ஸைப் பயன்படுத்தி நாம் காஸியன் பல்ஸை உருவாக்குவோம். ஒரு அளவுரு பல்ஸ் ஒவ்வொரு தனிப்பட்ட மாதிரியையும் விட, செயல்பாட்டின் பெயரையும் அதன் அளவுருக்களையும் பின்தளத்தில் அனுப்புகிறது. அளவுரு பல்ஸ்களைப் பயன்படுத்துவதால் நீங்கள் பின்தளத்தில் அனுப்பும் வேலைகள் மிகச் சிறியதாக இருக்கும். IBM Quantum backends ஏற்றுக்கொள்ளும் அதிகபட்ச வேலை அளவைக் கட்டுப்படுத்துகிறது, எனவே அளவுரு பல்ஸ் பெரிய நிரல்களை இயக்க உங்களை அனுமதிக்கலாம்.
tr: Gauss atımımızı ``Gaussian`` parametrik atımını kullanarak oluşturalım. Parametrik bir atım, işlevin adını ve parametrelerini her bir ayrı örnek yerine arkayüzeye gönderir. Parametrik atımları kullanmak, arkayüzeye gönderdiğiniz işleri çok daha küçük hale getirir. IBM Kuantum arkayüzleri, kabul ettikleri maksimum iş boyutunu sınırlar, bu nedenle parametrik atımlar daha büyük programları çalıştırmanıza izin verebilir.

source: Other parametric pulses in the ``library`` include ``GaussianSquare``, ``Drag``, and ``Constant``.
bn_bn: ``library`` এর অন্যান্য প্যারামেট্রিক পালসগুলির মধ্যে রয়েছে ``GaussianSquare``, ``Drag`` এবং ``Constant``।
es_un: Otros pulsos paramétricos en la ``library`` incluyen ``GaussianSquare``, ``Drag``, y ``Constant``.
fr: Les autres impulsions paramétriques de la librairie (``library``) incluent ``GaussianSquare``, ``Drag`` et ``Constant``.
id_id: Pulsa parametrik lain dalam ``library`` termasuk ``GaussianSquare``, ``Drag``, dan ``Constant``.
ja_jp: ``library`` の他のパラメトリック・パルスには、``GaussianSquare`` 、 ``Drag`` 、および ``Constant`` が含まれます。
ko: ``library`` 에 포함된 다른 매개변수 펄스들은 ``GaussianSquare``, ``Drag``, 그리고 ``Constant`` 이다.
pt_un: Outros pulsos paramétricos na ``library`` incluem ``GaussianSquare``, ``Drag``, e ``Constant``.
ta: ``library`` -யில் மற்ற அளவுரு பல்ஸ்களில் ``GaussianSquare``, ``Drag``, மற்றும் ``Constant`` ஆகியவை அடங்கும்.
tr: ``library``deki diğer parametrik darbeler arasında ``GaussianSquare``, ``Constant`` ve ``Drag`` bulunur.

source: **Note**: The backend is responsible for deciding exactly how to sample the parametric pulses. It is possible to draw parametric pulses, but the samples displayed are not guaranteed to be the same as those executed on the backend.
bn_bn: ** দ্রষ্টব্য **: প্যারামেট্রিক তড়িৎস্পন্দন বা পালসের নমুনা ঠিক কিভাবে নিতে হবে তা নির্ধারণের জন্য ব্যাকএন্ড দায়ী। প্যারামেট্রিক তড়িৎস্পন্দন বা পালস আঁকা সম্ভব, কিন্তু প্রদর্শিত নমুনাগুলি ব্যাকএন্ডে কার্যকর হওয়াগুলির সমান হওয়ার নিশ্চয়তা দেয় না।
es_un: **Nota**: El backend es responsable de decidir exactamente cómo muestrear los pulsos paramétricos. Es posible dibujar pulsos paramétricos, pero no se garantiza que las muestras mostradas sean las mismas que las ejecutadas en el backend.
fr: ** Note**: L'e système d'exécution (´´backend´´) est chargé de décider exactement comment échantillonner les impulsions paramétriques. Il est possible de dessiner des impulsions paramétriques, mais les échantillons affichés ne sont pas garantis d'être les mêmes que ceux exécutés sur le backend.
id_id: **Catatan**: Backend bertanggung jawab untuk menentukan bagaimana menyampel pulsa parametrik. Anda dapat menarik pulsa parametrik, tetapi sampel yang ditampilkan tidak dijamin akan sama dengan yang dieksekusi pada backend.
ja_jp: **注記** ：バックエンドには、パラメトリック・パルスをサンプリングする方法を正確に決定する責任があります。パラメトリック・パルスを描画することは可能ですが、表示されるサンプルがバックエンドで実行されたものと同じであるとは限りません。
ko: **참고**: 백엔드가 매개변수 펄스를 샘플링하는 방법을 결정한다. 매개변수 펄스를 그리는 것은 가능하지만, 그려진 샘플들이 백엔드에서 실행된 것과 동일하다는 것은 보장되진 않는다.
pt_un: **Nota**: O backend é responsável por decidir exatamente como amostrar os pulsos paramétricos. É possível desenhar pulsos paramétricos, mas não se garante que as amostras exibidas são as mesmas que são executadas no backend.
ta: **குறிப்பு**: அளவுரு பல்ஸ்களை எவ்வாறு மாதிரியாக்குவது என்பதைத் தீர்மானிப்பது பின்தளத்தின் பொறுப்பாகும். அளவுரு பல்ஸ்களை வரைய முடியும், ஆனால் காட்டப்படும் மாதிரிகள் பின்தளத்தில் செயல்படுத்தப்பட்டதைப் போலவே இருக்கும் என்று உத்தரவாதம் அளிக்கப்படவில்லை.
tr: **Not**: Arkayüzey parametrik atımların tam olarak nasıl örnekleneceğine karar vermekten sorumludur. Parametrik atımlar çizmek mümkündür, ancak görüntülenen örneklerin arkayüzeyde yürütülenlerle aynı olması garanti edilmez.

source: Pulse waveforms described by samples
bn_bn: নমুনা দ্বারা বর্ণিত পালস ওভেফর্মস
es_un: Formas de onda de pulso descritas por muestras
fr: Les formes d'onde des impulsions décrites par les échantillons
id_id: Bentuk gelombang pulsa dideskripsikan oleh sampel
ja_jp: サンプルによって記述されたパルス波形
ko: 샘플로 묘사되는 펄스 파형
pt_un: Formas de ondas de pulso descritas pelas amostras
ta: மாதிரிகளால் விவரித்த பல்ஸ் அலைவடிவங்கள்
tr: Örnekler tarafından açıklanan atım dalga biçimleri

source: A ``Waveform`` is a pulse signal specified as an array of time-ordered complex amplitudes, or *samples*. Each sample is played for one cycle, a timestep ``dt``, determined by the backend. If we want to know the real-time dynamics of our program, we need to know the value of ``dt``. The (zero-indexed) :math:`i^{th}` sample will play from time ``i*dt`` up to ``(i + 1)*dt``, modulated by the qubit frequency.
bn_bn: একটি ``ওয়েভফর্ম`` হল একটি পালস সিগন্যাল যা সময়-নির্দেশিত জটিল পরিবর্ধন বা *নমুনা * এর একটি অ্যারে হিসাবে নির্দিষ্ট করা হয়। প্রতিটি নমুনা একটি চক্রের জন্য বাজানো হয়, একটি টাইমস্টেপ ``dt``, ব্যাকএন্ড দ্বারা নির্ধারিত। যদি আমরা আমাদের প্রোগ্রামের রিয়েল-টাইম গতিবিদ্যা জানতে চাই, তাহলে আমাদের ``dt`` এর মান জানতে হবে। (শূন্য-সূচীকৃত) :math:`i^{th}` নমুনাটি ``i*dt`` সময় থেকে ``(i + 1)*dt`` পর্যন্ত চলবে, যা কিউবিট ফ্রিকোয়েন্সি দ্বারা সংশোধন করা হবে।
es_un: Una ``Waveform`` (forma de onda) es una señal de pulso especificada como un arreglo de amplitudes complejas ordenadas en el tiempo, o *muestras*. Cada muestra se reproduce para un ciclo, un paso en el tiempo ``dt``, determinado por el backend. Si queremos conocer la dinámica en tiempo real de nuestro programa, necesitamos conocer el valor de ``dt``. La muestra (indexada desde cero) :math:`i^{th}` se interpretará a partir del tiempo ``i*dt`` up to ``(i + 1)*dt``, modulada por la frecuencia del qubit.
fr: Une forme d'impulsion (``Waveform``) est un signal défini par une liste de d'amplitudes complexes ordonnancées appelés *samples* (échantillons). Chaque *sample* est envoyé durant un temps de cycle ``dt``, determiné par le backend. Si nous voulons en savoir plus au sujet de la dynamique en temps réel de notre programme, il faut connaitre la valeur de ``dt``. L'échantillon :math:`i^{th}` (l'index commençant à 0) sera envoyé depuis l'instant ``i*dt`` jusqu'à l'instant ``(i + 1)*dt``, en modulation par la fréquence du qubit.
id_id: Sebuah ``Waveform`` adalah sinyal pulsa yang dispesifikasikan sebagai array dari amplitudo kompleks terurut-waktu, atau *sampel*. Setiap sampel dimainkan dalam satu siklus, langka waktu ``dt``, yang ditentukan oleh backend. Jika kita ingin mengetahui dinamika waktu sebenernya dari program, kita perlu mengetahui nilai ``dt``. Sampel (indeks nol) :math:`i^{th}` akan dimainkan dari waktu ``i*dt`` sampai ``(i + 1)*dt``, dimodulasi oleh frekuensi qubit.
ja_jp: ``Waveform`` は、時間順に並べられた複素振幅または *サンプル* の配列として指定されたパルス信号です。各サンプルは、バックエンドによって決定される1サイクル、タイムステップ ``dt`` で再生されます。プログラムのリアルタイムダイナミクスを知りたい場合は、 ``dt`` の値を知る必要があります。:math:`i^{th}` サンプル(インデックスは0開始)を、量子ビット周波数によって調節された、時間`i*dt`` から ``(i + 1)*dt``まで再生します。
ko: ``Waveform`` 은 시간 순서의 복소 진폭이나 *샘플* 들의 배열로 지정된 펄스 신호이다. 각 샘플은 한 주기로 발생하며 시간 간격 ``dt`` 는 백엔드가 결정한다. 프로그램의 실시간 동역학을 알고 싶다면 ``dt`` 의 값을 알아야 한다. (0부터 시작하는) :math:`i^{th}` 번째 샘플은 시간이 ``i*dt`` 일 때부터 ``(i + 1)*dt`` 까지 발생하며, 큐비트 주파수로 변조된다.
pt_un: Uma ``Waveform`` é um sinal de pulso especificado, como um array de amplitudes complexas e ordenadas no tempo, ou *amostras*. Cada amostra é executada por um ciclo, um timestep ``dt``, determinado pelo backend. Se queremos saber a dinâmica do nosso programa em tempo real, precisamos saber o valor de ``dt``. A amostra :math:`i^{th}` (zero-indexed) irá executar do passo ``i*dt`` até o ``(i + 1)*dt``, modulada pela frequência do qubit.
ta: ஒரு ``Waveform`` என்பது நேர-வரிசைப்படுத்தப்பட்ட சிக்கலான பெருக்கங்கள் அல்லது *மாதிரிகள்* என குறிப்பிடப்படும் பல்ஸ் சிக்னலாகும். ஒவ்வொரு மாதிரியும் ஒரு சுழற்சிக்காக இயக்கப்படுகிறது, இது ஒரு பின்தளத்தில் தீர்மானிக்கப்படும் ``dt``. எங்கள் திட்டத்தின் நிகழ்நேர இயக்கவியல் பற்றி அறிய விரும்பினால், ``dt`` இன் மதிப்பை நாம் அறிந்து கொள்ள வேண்டும். ஒரு (பூஜ்ஜிய-குறியீட்டு) :math:`i^{th}` மாதிரியானது, நேரம் ``i*dt`` முதல் ``(i + 1)*dt`` வரை, க்யூபிட் அதிர்வெண்ணால் மாற்றியமைக்கப்படும்.
tr: ``Waveform``, zamana göre sıralı karmaşık genlikler veya *örnekler* dizisi olarak belirtilen bir atım sinyalidir. Her örnek, arka uç tarafından belirlenen bir ``dt`` zaman adımı olan bir döngü için oynatılır. Programımızın gerçek zamanlı dinamiklerini bilmek istiyorsak ``dt`` değerini bilmemiz gerekir. (Sıfır dizinli) :math:`i^{th}` örneği, ``i*dt`` zamanından ``(i + 1)*dt``ye kadar, kübit frekansı tarafından modüle edilmiş olarak gösterecektir.

source: Pulse library functions
bn_bn: তড়িৎস্পন্দন বা পালস লাইব্রেরি ফাংশন
es_un: Funciones de la biblioteca Pulse
fr: Fonctions de la bibliothèque (``library``) d'impulsions
id_id: Fungsi pustaka pulsa
ja_jp: パルス・ライブラリー関数
ko: 펄스 라이브러리 함수
pt_un: Funções da biblioteca de pulsos
ta: பல்ஸ் நூலக செயல்பாடுகள்
tr: Atım kütüphanesi işlevleri

source: Our own pulse library has sampling methods to build a ``Waveform`` from common functions.
bn_bn: আমাদের নিজস্ব পালস লাইব্রেরিতে সাধারণ ফাংশন থেকে ``Waveform`` তৈরির নমুনা পদ্ধতি রয়েছে।
es_un: Nuestra propia biblioteca de pulsos tiene métodos de muestreo para construir una ``Waveform`` a partir de funciones comunes.
fr: Notre propre bibliothèque d'impulsions a des méthodes d'échantillonnage pour construire un ``Waveform`` à partir de fonctions communes.
id_id: Pustaka pulsa kita memiliki metode penyampelan untuk membangun ``Waveform`` dari fungsi umum.
ja_jp: 独自のパルス・ライブラリーには、一般的な関数から ``Waveform`` を作成するためのサンプリング・メソッドがあります。
ko: 제공되는 펄스 라이브러리는 일반적인 함수로부터 ``Waveform`` 을 만들기 위한 샘플링 방법을 가지고 있다.
pt_un: Nossa própria biblioteca pulso tem métodos de amostragem para construir uma ``Waveform``, a partir de funções comuns.
ta: எங்கள் சொந்த துடிப்பு நூலகத்தில் பொதுவான செயல்பாடுகளிலிருந்து ``Waveform`` உருவாக்க மாதிரி முறைகள் உள்ளன.
tr: Kendi darbe kitaplığımız, ortak işlevlerden bir ``Waveform`` derlemek için örnekleme yöntemlerine sahiptir.

source: Regardless of which method you use to specify your ``pulse``, ``play`` is added to your schedule the same way:
bn_bn: আপনার ``pulse`` নির্দিষ্ট করার জন্য আপনি যে পদ্ধতিটি ব্যবহার করেন না কেন, ``play`` আপনার সময়সূচীতে একইভাবে যোগ করা হয়:
es_un: Independientemente del método que uses para especificar tu ``pulse``, ``play`` se agrega a tu planificador de la misma manera:
fr: Quelle que soit la méthode que vous utilisez pour spécifier votre impulsion (``pulse``), ``play`` est instanciée de la même manière :
id_id: Terlepas dari metode yang Anda gunakan untuk menentukan ``pulse``, ``play`` ditambahkan ke jadwal Anda dengan cara yang sama:
ja_jp: ``pulse`` を指定する方法に関係なく、``play`` は同じ方法でスケジュールに追加されます:
ko: ``pulse`` 를 특정하기 위해 어떤 방법을 사용하든 ``play`` 는 같은 방식으로 스케줄에 추가된다.
pt_un: Independente do método que você usar para especificar seu ``pulse``, ``play`` é adicionado ao seu agendamento da mesma forma:
ta: உங்கள் ``pulse`` ஐக் குறிப்பிட நீங்கள் எந்த முறையைப் பயன்படுத்தினாலும், ``play`` உங்கள் அட்டவணையில் அதே வழியில் சேர்க்கப்படுகிறது:
tr: ``pulse``yi belirlemek için hangi yöntemi kullanırsanız kullanın, ``play`` programınıza aynı şekilde eklenir:
