Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/06_building_pulse_schedules.po
Languages: bn_bn, es_un, fr, id_id, ja_jp, ko, pt_un, ta, tr

source: This page was generated from `tutorials/circuits_advanced/06_building_pulse_schedules.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/circuits_advanced/1_advanced_circuits.ipynb`__ থেকে উৎপন্ন হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/circuits_advanced/06_building_pulse_schedules.ipynb`__.
fr: Cette page a été générée à partir de `tutorials/circuits_advanced/06_building_pulse_schedules.ipynb`__.
id_id: Halaman ini dibuat dari `tutorials/circuits_advanced/06_building_pulse_schedules.ipynb`__.
ja_jp: 当ページは `tutorials/circuits_advanced/06_building_pulse_schedules.ipynb`__ から生成されました。
ko: 이 페이지는 `tutorials/circuits_advanced/06_building_pulse_schedules.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada, a partir de `tutorials/circuits_advanced/06_building_pulse_schedules.ipynb`__.
ta: இந்த பக்கம் `tutorials/circuits_advanced/06_building_pulse_schedules.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
tr: Bu sayfa `tutorials/circuits_advanced/06_building_pulse_schedules.ipynb`__ adresinden oluşturulmuştur.

source: Building Pulse Schedules
bn_bn: পালস সময়সূচী তৈরির পদ্ধতি
es_un: Construyendo Planificadores de Pulso
fr: Construire des ordonnancements d'impulsions
id_id: Membangun Jadwal Pulsa
ja_jp: Pulseスケジュールの構築
ko: 펄스 스케줄 구성하기
pt_un: Construindo planejamento de pulsos
ta: பல்ஸ் அட்டவணை உருவாக்குதல்
tr: Atım Zamanlamalarını Oluşturma

source: Pulse gates define a low-level, exact representation for a circuit gate. A single operation can be implemented with a pulse program, which is comprised of multiple low-level instructions. To learn more about pulse gates, refer back to the documentation `here <05_pulse_gates.ipynb>`__. This page details how to create pulse programs.
bn_bn: তড়িৎস্পন্দন বা পালস একটি বর্তনী (সার্কিট) যুক্তিবর্তনী (গেইট) জন্য একটি মৌলিক স্তরের, সঠিক উপস্থাপনা সংজ্ঞায়িত করে | একটি একক ক্রিয়াকলাপ (অপারেশন) একটি তড়িৎস্পন্দন বা তড়িৎস্পন্দন বা পালস নির্দেশমালার সাথে বাস্তবায়ন করা যেতে পারে, যা একাধিক মৌলিক স্তরের নির্দেশাবলী নিয়ে গঠিত। তড়িৎস্পন্দন বা তড়িৎস্পন্দন বা পালস গেট সম্পর্কে আরও জানতে, প্রদর্শক (ডকুমেন্টেশন) ফিরে যান `এখানে <05_pulse_gates.ipynb>` __। এই পৃষ্ঠাটি কীভাবে তড়িৎস্পন্দন বা পালস নির্দেশমালা তৈরি করতে হয় তা বিশদ করে।
es_un: Las compuertas de pulso definen una representación exacta de bajo nivel para una compuerta de circuito. Se puede implementar una sola operación con un programa de pulsos, que se compone de múltiples instrucciones de bajo nivel. Para obtener más información sobre las compuertas de pulso, consulta la documentación `aquí <05_pulse_gates.ipynb>`__. Esta página detalla cómo crear programas de pulso.
fr: Les portes d'impulsions définissent une représentation exacte de bas niveau pour une porte d'un circuit. Une opération unique peut être implémentée avec un programme d'impulsions, qui comprend plusieurs instructions de bas niveau. Pour en savoir plus sur les entrées d'impulsions, reportez-vous à la documentation ` ici <05_pulse_gates.ipynb> ` __. Cette page explique comment créer des programmes d'impulsions.
ko: 펄스 게이트는 회로 게이트에 대한 낮은 레벨(low-level)의 정확한 표현을 정의한다. 하나의 연산은 다수의 낮은 레벨 명령들로 구성된 펄스 프로그램으로 구현될 수 있다. 펄스 게이트에 대해서 자세히 배우려면 이 `문서 <05_pulse_gates.ipynb>`__ 를 참고하라. 이 페이지에서는 펄스 프로그램을 어떻게 만드는지에 대해 자세히 다룬다.
pt_un: Portas de pulso definem uma representação exata de baixo nível para um portão de circuito. Uma única operação pode ser implementada com um programa de pulso, composto por múltiplas instruções de baixo nível. Para aprender mais sobre portas pulse, consulte a documentação `aqui <05_pulse_gates.ipynb>`__. Esta página detalha como criar programas de pulso.
ta: பல்ஸ் கேட்கள் ஒரு சுற்று கேட்டுக்கு குறைந்த அளவிலான, சரியான பிரதிநிதித்துவத்தை வரையறுக்கின்றன. பல்ஸ் ப்ரோக்ராமுடன் ஒரு ஒற்றை செயல்பாட்டை செயல்படுத்த முடியும், இது பல குறைந்த-நிலை வழிமுறைகளைக் கொண்டுள்ளது. பல்ஸ் கேட்ளைப் பற்றி மேலும் அறிய, `இந்த <05_pulse_gates.ipynb>`__ ஆவணத்தைப் பார்க்கவும். பல்ஸ் ப்ரோக்ராம்களை எவ்வாறு உருவாக்குவது என்பதை இந்த பக்கம் விவரிக்கிறது.
tr: Atım geçitlerini, bir devre kapısı için düşük seviyeli, kesin bir temsili tanımlar. Çoklu düşük seviyeli komutlardan oluşan bir atım programı ile tek bir işlem gerçekleştirilebilir. Atım kapıları hakkında daha fazla bilgi edinmek için `here <05_pulse_gates.ipynb>`__ belgelerine bakın. Bu sayfa, atım programlarının nasıl oluşturulacağını ayrıntılarıyla anlatır.

source: Note: For IBM devices, pulse programs are used as subroutines to describe gates. Previously, some devices accepted full programs in this format, but this is being sunset in December 2021. Other providers may still accept full programs in this format. Regardless of how the program is used, the syntax for building the program is the same. Read on to learn how!
bn_bn: টীকা: আই. বি. এম এর যন্ত্রের জন্য, তড়িৎস্পন্দন বা পালস নির্দেশমালা গেট বর্ণনা করার জন্য সাবরুটিন হিসাবে ব্যবহৃত হয়। পূর্বে, কিছু যন্ত্রের এই বিন্যাসে সম্পূর্ণ প্রোগ্রামগুলো গ্রহণ করাছিল, কিন্তু এটি 2021 সালের ডিসেম্বরে বন্ধ হচ্ছে। অন্যান্য প্রোভাইডার এখনও এই বিন্যাসে সম্পূর্ণ প্রোগ্রাম গ্রহণ করতে পারে। প্রোগ্রামটি যেভাবেই ব্যবহার করা হোক না কেন, প্রোগ্রাম তৈরির গঠন (সিনট্যাক্স) একই। কিভাবে জানতে পড়ুন!
es_un: Nota: Para los dispositivos IBM, los programas de pulso se utilizan como subrutinas para describir compuertas. Anteriormente, algunos dispositivos aceptaban programas completos en este formato, pero esto dejará de estar disponible en diciembre de 2021. Es posible que otros proveedores aún acepten programas completos en este formato. Independientemente de cómo se use el programa, la sintaxis para construir el programa es la misma. ¡Sigue leyendo para aprender!
fr: Remarque : pour les ordinateurs d'IBM, les programmes d'impulsions sont utilisés comme sous-programmes pour décrire les portes. Auparavant, certains appareils acceptaient des programmes complets dans ce format, mais ce ne sera plus le cas après décembre 2021. D'autres fournisseurs peuvent encore accepter des programmes complets dans ce format. Quelle que soit la façon dont le programme est utilisé, la syntaxe de création du programme est la même. Lisez plus bas pour apprendre comment !
ko: 참고: IBM 장치의 경우, 펄스 프로그램들이 게이트를 설명하는 서브루틴으로써 사용되고 있다. 예전에는 일부 장치들만 이 형식으로 전체 프로그램들을 받아들였지만, 이는 2021년 12월에 종료될 것이다. 다른 공급자들은 여전히 이 형식의 프로그램을 받아들일 수도 있다. 프로그램이 어떻게 사용되는지에 상관 없이, 프로그램을 작성하는 구문은 동일하다. 어떻게 하는지 읽어보라!
pt_un: Nota: Para dispositivos IBM, os programas de pulso são usados como subrotinas para descrever portas. Anteriormente, alguns dispositivos aceitaram programas completos neste formato, mas isso está sendo descontinuado eté dezembro de 2021. Outros provedores podem ainda aceitar programas completos neste formato. Independentemente de como o programa é usado, a sintaxe para construção do programa é a mesma. Leia mais para aprender como!
ta: குறிப்பு: IBM சாதனங்களுக்கு, கேட்களை விவரிக்க பல்ஸ் ப்ரோக்ராம்கள் சப்ரூட்டின்களாகப் பயன்படுத்தப்படுகின்றன. முன்னதாக, சில சாதனங்கள் இந்த வடிவமைப்பில் முழு ப்ரோக்ராம்களையும் ஏற்றுக்கொண்டன, ஆனால் இது டிசம்பர் 2021 இல் நிறுத்தப்பட்டது. பிற வழங்குநர்கள் இந்த வடிவமைப்பில் முழு ப்ரோக்ராம்களையும் ஏற்கலாம். ப்ரோக்ராம் எவ்வாறு பயன்படுத்தப்படுகிறது என்பதைப் பொருட்படுத்தாமல், ப்ரோக்ராம்மை உருவாக்குவதற்கான தொடரியல் ஒன்றுதான். எப்படி என்பதை அறிய படிக்கவும்!
tr: Not: IBM aygıtları için, kapıları tanımlamak için alt rutinler olarak atım programları kullanılır. Önceden, bazı cihazlar bu biçimdeki tam programları kabul ediyordu, ancak bu Aralık 2021'de sona eriyor. Diğer sağlayıcılar yine de bu biçimde tam programları kabul edebilir. Programın nasıl kullanıldığına bakılmaksızın, programı oluşturmak için kullanılan sözdizimi aynıdır. Nasıl olduğunu öğrenmek için okumaya devam edin!

source: Pulse programs, which are called ``Schedule``\ s, describe instruction sequences for the control electronics. We build ``Schedule``\ s using the Pulse Builder. It’s easy to initialize a schedule:
bn_bn: তড়িৎস্পন্দন বা পালস নির্দেশমালা , যাকে ``Schedule``\ s বলা হয়, নিয়ন্ত্রণ ইলেকট্রনিক্সের জন্য নির্দেশ ক্রম বর্ণনা করে। আমরা তড়িৎস্পন্দন বা পালস নির্মাতা ব্যবহার করে ``Schedule``\ s তৈরি করি। একটি ``Schedule`` শুরু করা সহজ:
es_un: Los programas de pulso, que se llaman ``Schedule``\ s, describen las secuencias de instrucciones para la electrónica de control. Construimos ``Schedule``\ s usando el Constructor de Pulso (Pulse Builder). Es fácil inicializar un planificador:
fr: Les programmes Pulse, aussi appelés ``Schedule``\ s, décrivent des séquences d'instructions pour l'électronique de contrôle. Nous construisons ces programmes ``Schedule``\ s à l'aide de Pulse Builder (constructeur de d'impulsions). Il est facile d'initialiser un planning:
id_id: Program pulsa, yang disebut ``Schedule``\ s, menjelaskan urutan instruksi untuk perangkat elektronik kontrol. Kita membangun ``Schedule``\ s menggunakan Pulse Builder. Sangat mudah untuk menginisialisasi jadwal:
ja_jp: パルス・プログラムは、``Schedule`` と呼ばれ、制御エレクトロニクスの命令シーケンスを記述します。 Pulse Builder を使用して ``Schedule`` を作成します。スケジュールを初期化するのは簡単です：
ko: ``Schedule``\ 들이라 불리는 펄스 프로그램은 전자 제어를 위한 명령어 순서이다. Pulse Builder를 사용하여 ``Schedule``\ 들을 구축한다. 스케줄을 쉽게 시작시킬 수 있다.
pt_un: Programas pulso, que são chamados de ``Schedule``\ s, descrevem as sequências de instruções para os aparelhos de controle eletrônico. Preparamos a ``Schedule``\ s usando o Construtor de Pulsos. É fácil inicializar um agendamento:
ta: பல்ஸ் நிரல்கள், ``Schedule`` \ கள் என அழைக்கப்படுகின்றன, அவை கட்டுப்பாட்டு மின்னணுவியல் வழிமுறைகளை விவரிக்கின்றன. பல்ஸ் பில்டரைப் பயன்படுத்தி ``Schedule`` யை உருவாக்குகிறோம். அட்டவணையைத் தொடங்குவது எளிது:
tr: ``Schedule``\ olarak adlandırılan atım programları, kontrol elektroniği için talimat dizilerini tanımlar. Atım derlericisi kullanarak `Schedule``\'ları oluşturuyoruz. Programı başlatmak kolaydır:

source: You can see that there are no instructions yet. The next section of this page will explain each of the instructions you might add to a schedule, and the last section will describe various *alignment contexts*, which determine how instructions are placed in time relative to one another.
bn_bn: আপনি দেখতে পারেন যে এখনও কোন নির্দেশনা নেই। এই পৃষ্ঠার পরবর্তী অংশটি আপনি যে সময়সূচীতে যোগ করতে পারেন তার প্রতিটি নির্দেশাবলী ব্যাখ্যা করবে এবং শেষ অংশটি বিভিন্ন *alignment contexts* বর্ণনা করবে, যা নির্দেশ করে কিভাবে একে অপরের আপেক্ষিক সময়ে নির্দেশাবলী স্থাপন করা হয়।
es_un: Puedes ver que aún no hay instrucciones. La siguiente sección de esta página explicará cada una de las instrucciones que podrías agregar a un planificador, y la última sección describirá varios *contextos de alineación*, que determinan cómo se colocan las instrucciones en el tiempo en relación con las otras.
fr: Vous pouvez voir qu'il n'y a pas encore d'instruction. La section suivante de cette page explique chacune des instructions que vous pouvez ajouter à un planning, et la dernière section décrit les différents *contextes d'alignement*, qui déterminent comment les instructions sont placées dans le temps les unes par rapport aux autres.
id_id: Anda dapat melihat tidak belum terdapat instruksi. Bagian berikutnya dari halaman ini akan menjalaskan setiap dari instruksi yang mungkin ingin Anda tambahkan ke jadwal, dan pada bagian terakhir akan dijelaskan berbagai *alignment contexts*, yang menentukan bagaimana instruksi ditempatkan dalam waktu yang relatif satu dengan lainnya.
ja_jp: 命令がまだないことがわかります。 このページの次のセクションでは、スケジュールに追加する各命令について説明します。 そして最後のセクションでは、さまざまな *配置コンテキスト* について説明します。これにより、命令が互いに相対的にどのように時間内に配置されるかが決まります。
ko: 아직 명령어가 없다는 것을 알 수 있다. 이 페이지의 다음 절에서는 스케줄에 추가할 수 있는 각 명령어를 설명하고, 마지막 절에서는 다양한 *정렬 컨텍스트* 를 설명하며, 이 컨텍스트는 명령어가 시간 순서에 따라 상대적으로 배치되는 방법을 결정한다.
pt_un: Você pode ver que ainda não há instruções. A próxima seção desta página explicará cada uma das instruções que você pode adicionar a um agendamento e a última seção descreverá vários *contextos de alinhamento*, que determinam como as instruções são posicionadas em relação ao tempo, umas com as outras.
ta: இதுவரை எந்த வழிமுறைகளும் இல்லை என்பதை நீங்கள் காணலாம். இந்த பக்கத்தின் அடுத்த பகுதி நீங்கள் ஒரு அட்டவணையில் சேர்க்கக்கூடிய ஒவ்வொரு வழிமுறைகளையும் விளக்கும், மேலும் கடைசி பகுதி பல்வேறு *alignment contexts* விவரிக்கும், இது ஒருவருக்கொருவர் தொடர்புடைய நேரத்தில் அறிவுறுத்தல்கள் எவ்வாறு வைக்கப்படுகின்றன என்பதை தீர்மானிக்கிறது.
tr: Henüz talimat olmadığını görebilirsiniz. Bu sayfanın bir sonraki bölümü, bir programa ekleyebileceğiniz talimatların her birini açıklayacak ve son bölüm, talimatların birbirine göre zaman içinde nasıl yerleştirildiğini belirleyen çeşitli *hizalama bağlamlarını* açıklayacaktır.

source: ``Schedule`` Instructions
bn_bn: ``Schedule`` নির্দেশনা
es_un: Instrucciones de ``Schedule``
fr: ``Ordonnancer`` des Instructions
id_id: Instruksi ``Schedule``
ja_jp: ``Schedule``命令
ko: ``Schedule`` 명령어
pt_un: Instruções da ``Schedule``
ta: ``Schedule`` வழிமுறைகள்
tr: ``Schedule`` Talimatları

source: `set_frequency(frequency, channel) <#set_frequency>`__
pt_un: ```set_frequency(frequency, channel)`` <#frequency>`__

source: `shift_phase(phase, channel) <#shift_phase>`__
pt_un: ```shift_phase(phase, channel)`` <#phase>`__

source: Each instruction type has its own set of operands. As you can see above, they each include at least one ``Channel`` to specify where the instruction will be applied.
bn_bn: প্রতিটি নির্দেশনা ধরনের নিজস্ব অপারেন্ড গুচ্ছ আছে। আপনি উপরে দেখতে পাচ্ছেন, নির্দেশাবলী কোথায় প্রয়োগ করা হবে তা নির্দিষ্ট করার জন্য তাদের প্রতিটিতে কমপক্ষে একটি ``Channel`` অন্তর্ভুক্ত রয়েছে।
es_un: Cada tipo de instrucción tiene su propio conjunto de operandos. Como puedes ver arriba, cada uno incluye al menos un ``Channel`` para especificar dónde se aplicará la instrucción.
fr: Chaque type d'instruction possède son propre ensemble d'opérandes. Comme vous pouvez le voir ci-dessus, ils incluent chacun au moins un ``Channel`` pour spécifier où l'instruction sera appliquée.
id_id: Setiap tipe instruksi memiliki set operan masing-masing. Seperti yang Anda lihat di atas, mereka masing-masing memasukkan setidaknya satu ``Channel`` untuk menentukan di mana instruksi akan diterapkan.
ja_jp: 各命令タイプは、独自のオペランドセットを持ちます。上記のように、それぞれに少なくとも1つの ``Channel`` が含まれており、命令の適用先を特定しています。
ko: 각 명령어 유형은 고유한 피연산자 집합이 있다. 위에서 볼 수 있듯이, 이들은 명령어가 어디에 적용될 것인가를 지정하기 위해 적어도 하나의 ``Channel`` 을 포함하고 있다.
pt_un: Cada tipo de instrução tem seu próprio conjunto de operações. Como você pode ver, acima, cada um deles inclui, pelo menos, um ``Canal`` para especificar, onde a instrução será aplicada.
ta: ஒவ்வொரு வழிமுறை வகை அதன் தனிப்பட்ட அமைப்புகளைக் கொண்டது. நீங்கள் மேலே பார்க்க முடியும், அவர்கள் ஒவ்வொன்றும் குறைந்தபட்சம் ஒரு ``Channel`` குறிப்பிடுவது எங்கே பயன்பாடு செய்யப்படும்.
tr: Her komut tipinin kendi işlenen seti vardır. Yukarıda görebileceğiniz gibi, her biri talimatın nereye uygulanacağını belirtmek için en az bir ``Channel`` içerir.

source: **Channels** are labels for signal lines from the control hardware to the quantum chip.
bn_bn: **চ্যানেল** হল নিয়ন্ত্রণ যন্ত্র থেকে কোয়ান্টাম চিপ পর্যন্ত সিগন্যাল লাইনের নাম (লেবেল)।
es_un: Los **Canales** son etiquetas para las líneas de señal desde el hardware de control hasta el chip cuántico.
fr: Les **Channels** (Canaux) sont des étiquettes pour les lignes de signal depuis le matériel de contrôle jusqu'à la puce quantique.
id_id: ** Channels** adalah label untuk jalur sinyal dari perangkat keras kontrol ke chip kuantum.
ja_jp: **Channels** は、制御ハードウェアから量子チップへの信号線のラベルです。
ko: **채널들(Channels)** 은 제어 하드웨어에서 양자 칩까지의 신호 라인에 대한 레이블이다.
pt_un: **Canais** são rótulos de linhas de sinal do hardware de controle para o processador quântico.
ta: **Channels** என்பது கட்டுப்பாட்டு வன்பொருளிலிருந்து குவாண்டம் சில்லுக்கான சமிக்ஞை வரிகளுக்கான லேபிள்கள்.
tr: **Kanallar**, kontrol donanımından kuantum çipine giden sinyal hatları için etiketlerdir.

source: ``DriveChannel``\ s are typically used for *driving* single qubit rotations,
bn_bn: ``DriveChannel``\ গুলি সাধারণত একক কিউবিট ঘূর্ণনের * ড্রাইভিং * এর জন্য ব্যবহৃত হয়,
es_un: ``DriveChannel``\ s son usados típicamente para *dirigir* rotaciones de un solo qubit,
fr: ``DriveChannel``\ s sont généralement utilisés pour *contrôler* des rotations de qubits uniques,
id_id: ``DriveChannel``\ s biasanya digunakan untuk *mengemudi* putaran satu qubit,
ja_jp: ``DriveChannel`` は通常、単一量子ビットの回転を *ドライブ* するのに使用されます。
ko: ``DriveChannel``\ 들은 일반적으로 단일 큐비트의 회전을 *구동* 하는데 사용되고,
pt_un: ``DriveChannel``\ s são usadas tipicamente para *orientar* rotações simples de qubit,
ta: ``DriveChannel``\கள் பொதுவாக *driving* ஒற்றை க்யூபிட் சுழற்சிகளுக்குப் பயன்படுத்தப்படுகின்றன,
tr: ``DriveChannel``\ s genellikle *enerjik* tek kübit dönüşler için kullanılır,

source: ``ControlChannel``\ s are typically used for multi-qubit gates or additional drive lines for tunable qubits,
bn_bn: ``ControlChannel``\ গুলি সাধারণত মাল্টি-কিউবিট গেট বা টিউনেবল (tunable)কিউবিটগুলির অতিরিক্ত ড্রাইভ লাইনের জন্য ব্যবহৃত হয়,
es_un: ``ControlChannel``\ s son usados típicamente para compuertas multiqubit o líneas de dirección adicionales para qubits ajustables,
fr: Les ``ControlChannel``\ s sont généralement utilisés pour des portes multi-qubits ou les lignes de commande supplémentaires pour les qubits réglables,
id_id: `ControlChannel``\ s biasanya digunakan untuk gerbang banyak-qubit atau jalur kemudi tambahan untuk qubit yang bisa disesuaikan,
ja_jp: ``ControlChannel`` は通常、複数量子ビットゲートや、調整可能な量子ビットの追加ドライブ線に使用されます。
ko: ``ControlChannel``\ 들은 일반적으로 다중 큐비트 게이트 또는 조정 가능한 큐비트의 추가 드라이브 라인에 사용되고,
pt_un: ``ControlChannel``\ s são usadas tipicamente para portas multi-qubit ou linhas de direção adicionais para qubits ajustáveis,
ta: ``ControlChannel``\ கள் பொதுவாக மல்டி-க்யூபிட் கேட்கள் அல்லது ட்யூனபிள் க்யூபிட்களுக்கான கூடுதல் டிரைவ் கோடுகள்,
tr: ``ControlChannel``\ s genellikle çoklu kübit kapıları veya ayarlanabilir kübitler için ek sürücü hatları için kullanılır,

source: ``MeasureChannel``\ s are specific to transmitting pulses which stimulate readout, and
bn_bn: ``MeasureChannel``\ গুলি পালস প্রেরণের জন্য নির্দিষ্ট যা রিড-আউটকে উদ্দীপিত করে, এবং
es_un: ``MeasureChannel``\ s son específicos para transmitir pulsos que estimulan la lectura, y
fr: ``MeasureChannel``\ s sont spécifiques à la transmission des impulsions qui stimulent la lecture, et
id_id: ``MeasureChannel``\ s spesifik untuk mentransmisikan pulsa yang mendorong bacaan, dan
ja_jp: ``MeasureChannel`` は、読み出しを促す送信パルスに特化しています。
ko: ``MeasureChannel``\ 들은 신호를 읽도록 하는 펄스의 전송에 한정되며,
pt_un: ``MeasureChannel``\ s são específicos para transmissão de pulsos, que estimulam a leitura e
ta: ``MeasureChannel``\ கள் வாசிப்பைத் தூண்டும் பல்ஸ்களைக் கடத்துவதற்கு குறிப்பிட்டவை, மற்றும்
tr: ``MeasureChannel``\ s, okumayı uyaran atımları iletmeye özeldir ve

source: ``AcquireChannel``\ s are used to trigger digitizers which collect readout signals.
bn_bn: ডিজিটাইজারগুলিকে ট্রিগার করতে ``AcquireChannel``\ গুলি ব্যবহার করা হয় যা রিড-আউট সিগন্যাল সংগ্রহ করে।
es_un: ``AdquireChannel``\ s se utilizan para activar los digitizadores que recolectan señales de lectura.
fr: ``AcquireChannel``\ s sont utilisés pour déclencher des numériseurs qui collectent des signaux de lecture.
id_id: ``AcquireChannel``\ s digunakan untuk memicu digitizers yang mengumpulkan sinyal bacaan.
ja_jp: ``AcquireChannel`` は、読み出し信号を収集するデジタイザーをトリガーするために使用されます。
ko: ``AcquireChannel``\ 들은 읽은 (아날로그 신호를 디지털 신호로 바꾸어) 신호를 수집하는 디지타이저(digitizer)를 동작시키는데 사용된다.
pt_un: ``AcquireChannel``\ s são usados para acionar digitalizadores que recolhem sinais de leitura.
ta: ``AcquireChannel``\ கள் ரீட்அவுட் சிக்னல்களை சேகரிக்கும் டிஜிட்டலைசர்களைத் தூண்டுவதற்குப் பயன்படுத்தப்படுகின்றன.
tr: ``AcquireChannel``\ s, okuma sinyallerini toplayan sayısallaştırıcıları tetiklemek için kullanılır.

source: ``DriveChannel``\ s, ``ControlChannel``\ s, and ``MeasureChannel``\ s are all ``PulseChannel``\ s; this means that they support *transmitting* pulses, whereas the ``AcquireChannel`` is a receive channel only and cannot play waveforms.
bn_bn: ``DriveChannel``\ , ``ControlChannel``\, এবং ``MeasureChannel``\ গুলি সব ``PulseChannel``; এর মানে হল যে তারা * পালস প্রেরণ * সমর্থন করে, যেখানে ``AcquireChannel`` শুধুমাত্র একটি রিসিভ চ্যানেল এবং তরঙ্গরূপ চালাতে পারে না।
es_un: ``DriveChannel``\ s, ``ControlChannel``\ s, y ``MeasureChannel``\ s son todos ``PulseChannel``\ s; esto significa que soportan *transmitir* pulsos, mientras que el ``AdquireChannel`` es un canal solo de recepción y no puede reproducir formas de onda.
fr: ``DriveChannel``\ s, ``ControlChannel``\ s, et ``MeasureChannel``\ s sont tous dans la catégorie des ``PulseChannel``\ s ; cela signifie qu'ils prennent en charge *les impulsions de transmission*, alors que ``AcquireChanne`` est un canal de réception seulement et ne peut pas générer de formes d'ondes.
id_id: ``DriveChannel``\ s, ``ControlChannel``\ s, dan``MeasureChannel``\ s semua adalah ``PulseChannel``\ s; ini berarti mereka mendukung *transmisi* pulsa, sedangkan ``AcquireChannel`` hanya saluran penerima dan tidak dapat menjalankan bentuk gelombang.
ja_jp: ``DriveChannel`` 、 ``ControlChannel`` 、 ``MeasureChannel`` は、すべて ``PulseChannel`` です。これは、これらが *送信* パルスをサポートしていることを意味します。一方、 ``AcquireChannel`` は受信チャンネルのみであり、波形を出すことはできません。
ko: ``DriveChannel``\ 들, ``ControlChannel``\ 들 그리고 ``MeasureChannel``\ 들은 모두 ``PulseChannel``\ 들이다. 이는 그들이 펄스의 *전송* 을 지원하는 반면, ``AcquireChannel``\ 은 수신 채널일 뿐 파형을 발생시킬 수는 없다는 뜻이다.
pt_un: ``DriveChannel``\ s, ``ControlChannel``\ s, e ``MeasureChannel``\ s são todos ``PulseChannel``\ s; Isso significa que eles suportam pulsos *transmissores*, enquanto o ``AcquireChannel`` é apenas um canal que apenas recebe e não pode executar formas de ondas.
ta: ``DriveChannel``\ கள், ``ControlChannel``\ கள், மற்றும் ``MeasureChannel``\ கள், இவை எல்லாம் ``PulseChannel``\ கள்; இதன் பொருள் அவை *transmitting* பல்ஸ்களை ஆதரிக்கின்றன, அதேசமயம் ``AcquireChannel`` என்பது பெறும் சேனல் மட்டுமே, மேலும் அலைவடிவங்களை இயக்க முடியாது.
tr: ``DriveChannel``\ s, ``ControlChannel``\ s ve ``MeasureChannel``\ s, tümü ``PulseChannel``\ s; bu, *gönderici* atımları destekledikleri anlamına gelir, oysa ``AcquireChannel`` yalnızca bir alma kanalıdır ve dalga biçimlerini canlandıramaz.
