Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/06_building_pulse_schedules.po
Languages: bn_bn, es_un, fr, id_id, ja_jp, ko, pt_un, ta, tr

source: For the following examples, we will create one ``DriveChannel`` instance for each ``Instruction`` that accepts a ``PulseChannel``. Channels take one integer ``index`` argument. Except for ``ControlChannel``\ s, the index maps trivially to the qubit label.
bn_bn: নিম্নলিখিত উদাহরণগুলির জন্য, আমরা প্রতিটি ``Instruction`` এর জন্য একটি ``DriveChannel`` উদাহরণ তৈরি করব যা একটি ``PulseChannel`` গ্রহণ করে। চ্যানেলগুলি একটি পূর্ণসংখ্যা ``index`` আর্গুমেন্ট নেয়। ``ControlChannel``\ গুলি ছাড়া, সূচকটি ট্রিভিয়ালি কিউবিট লেবেলে ম্যাপ করে।
es_un: Para los siguientes ejemplos, crearemos una instancia de ``DriveChannel`` para cada ``Instruction`` que acepte un ``PulseChannel``. Los canales toman un argumento entero ``index``. Excepto para los ``ControlChannel``\ s, el índice mapea trivialmente a la etiqueta del qubit.
fr: Pour les exemples suivants, nous allons créer une instance ``DriveChannel`` pour chaque ``Instruction`` qui accepte un ``PulseChannel``. Les canaux prennent un argument entier ``index``. A l'exception de ``ControlChannel`` \ s, l'index correspond trivialement à l'étiquette du qubit.
id_id: Untuk contoh berikut, kita akan membuat satu contoh ``DriveChannel`` untuk setiap ``Instruction`` yang menerima sebuah ``PulseChannel``. Saluran akan mengambil sebuah bilangan bulat argumen ``index``. Kecuali untuk ``ControlChannel``\s, indeks memetakan ke label qubit secara trivial.
ja_jp: 以下の例では、``PulseChannel`` を受け取る ``Instruction`` ごとに、ひとつの ``DriveChannel`` インスタンスを生成しています。チャンネルは、ひとつの数値 ``index`` 引数を取ります。 `` ControlChannel`` を除き、インデックスが量子ビットラベルにマッピングされるのは自明です。
ko: 다음 예제들에서는 ``PulseChannel`` 을 허용하는 각 ``Instruction`` 에 대해 하나의 ``DriveChannel`` 인스턴스를 생성한다. 채널은 하나의 정수로된 ``index`` 인수를 사용한다. ``ControlChannel``\ 들을 제외하고 인덱스는 큐비트 레이블에 맞추어 매핑된다.
pt_un: Para os seguintes exemplos, vamos criar uma instância ``DriveChannel`` para cada ``Instruction`` que aceita um ``PulseChannel``. Canais recebem um argumento ``index`` tipo inteiro. Exceto por ``ControlChannel``\ s, o índice mapeia trivialmente para a label qubit.
ta: பின்வரும் எடுத்துக்காட்டுகளுக்கு, ``PulseChannel`` ஏற்றுக்கொள்ளும் ஒவ்வொரு ``Instruction``-க்கும் ஒரு ``DriveChannel`` உதாரணத்தை உருவாக்குவோம். சேனல்கள் ஒரு முழு எண் ``index`` ஆர்கியுமென்ட்டை எடுத்துக்கொள்கின்றன. ``ControlChannel``\ கள் தவிர, குறியீட்டு எண்கள் க்யூபிட் அடையாளக் குறியீட்டையே அற்பமாக வரையருக்கிறது.
tr: Aşağıdaki örnekler için, bir ``PulseChannel`` kabul eden her ``Instruction`` için bir ``DriveChannel`` örneği oluşturacağız. Kanallar bir tamsayı ``index`` argümanı alır. ``ControlChannel``\ s dışında, dizin önemsiz bir şekilde qubit etiketiyle eşleşir.

source: The pulse ``Schedule`` is independent of the backend it runs on. However, we can build our program in a context that is aware of the target backend by supplying it to ``pulse.build``. When possible you should supply a backend. By using the channel accessors ``pulse.<type>_channel(<idx>)`` we can make sure we are only using available device resources.
bn_bn: পালস ``Schedule`` যে ব্যাকএন্ড এর উপর চলে তার থেকে স্বাধীন। যাইহোক, আমরা একটি প্রেক্ষাপটে আমাদের প্রোগ্রাম তৈরি করতে পারি যা ``pulse.build`` এ সরবরাহ করার দ্বারা টার্গেট ব্যাকএন্ড সম্বন্ধে অবগত হয়। সম্ভব হলে আপনার একটি ব্যাকএন্ড সরবরাহ করা উচিত। চ্যানেল অ্যাক্সেসর ``pulse.<type>_channel(<idx>)`` ব্যবহার করে আমরা নিশ্চিত করতে পারি যে আমরা কেবল উপলব্ধ ডিভাইস রিসোর্স ব্যবহার করছি।
es_un: El pulso ``Schedule`` es independiente del backend en el que se ejecuta. Sin embargo, podemos construir nuestro programa en un contexto que sea consciente del backend objetivo suministrándolo a ``pulse.build``. Cuando sea posible, debes proporcionar un backend. Al usar los accesores del canal ``pulse.<type>_channel(<idx>)`` podemos asegurarnos de que solo estamos utilizando recursos disponibles del dispositivo.
fr: L'impulsion ``Schedule`` est indépendante du backend sur lequel elle s'exécute. Cependant, nous pouvons construire notre programme dans un contexte conscient du backend cible en le fournissant à ``pulse.build``. Dans la mesure du possible, vous devriez fournir un backend. En utilisant les accesseurs de canaux ``pulse.<type>_channel(<idx>)`` nous pouvons nous assurer que nous n'utilisons que les ressources disponibles de la machine.
ko: 이 펄스의 ``Schedule`` 은 그것이 실행되는 백엔드와는 독립적이다. 그러나 대상 백엔드를 ``pulse.build`` 에 제공함으로써 컨텍스트가 대상 백엔드를 인식하고 있는 상황에서 프로그램을 구현할 수 있다. 가능하면 백엔드를 제공하는 게 좋다. 채널 접근자 ``pulse.<type>_channel(<idx>)`` 를 사용함으로써 사용 가능한 장치 자원들만 사용하고 있는지 확인할 수 있다.
pt_un: O pulso ``Schedule`` é independente do serviço em que é executado. No entanto, podemos construir nosso programa num contexto que está ciente do serviço alvo, fornecendo-o para ``pulse.build``. Quando possível, você deve fornecer um serviço. Usando os acessores de canal ``pulse.<type>_channel(<idx>)`` nós podemos nos certificar que estamos utilizando apenas recursos de dispositivo disponíveis.
ta: துடிப்பு ``Schedule`` அது இயங்கும் பின்தளத்தில் இருந்து சுயாதீனமாக உள்ளது. எவ்வாறாயினும், எங்கள் திட்டத்தை ``pulse.build`` க்கு வழங்குவதன் மூலம் இலக்கு பின்தளத்தில் தெரிந்த சூழலில் உருவாக்க முடியும். முடிந்தால் நீங்கள் ஒரு பின்தளத்தில் வழங்க வேண்டும். சேனல் அணுகல்களைப் பயன்படுத்துவதன் மூலம் ``pulse.<type>_channel(<idx>)`` நாங்கள் கிடைக்கக்கூடிய சாதன வளங்களை மட்டுமே பயன்படுத்துகிறோம் என்பதை உறுதிப்படுத்த முடியும்.
tr: ``Schedule`` atımı, üzerinde çalıştığı backendden bağımsızdır. Ancak programımızı, ``pulse.build``e vererek hedef arka ucunun farkında olan bir bağlamda inşa edebiliriz. Mümkün olduğunda bir arka uç sağlamalısınız. ``pulse.<type>_channel(<idx>)`` kanal erişimcilerini kullanarak, yalnızca mevcut cihaz kaynaklarını kullandığımızdan emin olabiliriz.

source: One of the simplest instructions we can build is ``delay``. This is a blocking instruction that tells the control electronics to output no signal on the given channel for the duration specified. It is useful for controlling the timing of other instructions.
bn_bn: অন্যতম সহজ একটি নির্দেশনা আমরা তৈরী করতে পারি যা হলো ``delay``। এটি একটি ব্লকিং নির্দেশ যা নির্দিষ্ট ইলেকট্রনিক্সকে নির্দিষ্ট সময়ের জন্য প্রদত্ত চ্যানেলে কোন সংকেত আউটপুট করতে বলে না। এটি অন্যান্য নির্দেশাবলীর সময় নিয়ন্ত্রণের জন্য দরকারী।
es_un: Una de las instrucciones más simples que podemos construir es ``delay``. Esta es una instrucción de bloqueo que le dice a la electrónica de control que no dé salida a ninguna señal en el canal dado durante el tiempo especificado. Es útil para controlar la sincronización de otras instrucciones.
fr: L'une des instructions les plus simples que nous pouvons construire est ``delay``. Il s'agit d'une instruction de blocage qui indique à l'électronique de contrôle de ne générer aucun signal sur le canal donné, pour la durée spécifiée. Il est utile pour contrôler le ´´timing´´ des autres instructions.
id_id: Salah satu instruksi yang paling sederhana yang dapat kita buat adalah ``delay``. Ini adalah instruksi pemblokiran yang memberitahu elektronik kontrol untuk tidak mengeluarkan sinyal pada suatu saluran selama durasi yang ditentukan. Ini berguna untuk mengontrol waktu dari intstruksi lainnya.
ja_jp: 最も簡単な命令のひとつは ``delay`` です。これはブロッキング命令で、指定された継続時間中、指定されたチャンネルに信号を出力しないように、制御電子装置に対して指示を出します。他の命令のタイミングを制御するのに便利です。
ko: 가장 간단한 명령어 중 하나는 ``delay`` 이다. 이것은 제어 전자 장치가 지정된 (지속) 시간 동안 주어진 채널에 신호를 출력하지 않도록 하는 차단 명령이다. 다른 명령어의 타이밍을 조절하는 데 유용하다.
pt_un: Uma das instruções mais simples que podemos construir é ``delay``. Esta é uma instrução de bloqueio, que diz para o controle eletrônico não produzir nenhum sinal no canal dado, durante a duração especificada. É útil para controlar o timing de outras instruções.
ta: நாம் உருவாக்கக்கூடிய எளிய வழிமுறைகளில் ஒன்று ``delay``. இது ஒரு தடுக்கும் அறிவுறுத்தலாகும், இது குறிப்பிட்ட காலத்திற்கு குறிப்பிட்ட சேனலில் எந்த சிக்னலையும் வெளியிட கட்டுப்பாட்டு மின்னணுவியலைக் கூறுகிறது. பிற அறிவுறுத்தல்களின் நேரத்தைக் கட்டுப்படுத்த இது பயனுள்ளதாக இருக்கும்.
tr: Oluşturabileceğimiz en basit komutlardan biri ``delay``'dır. Bu, kontrol elektroniğine belirtilen süre boyunca verilen kanalda sinyal vermemesini söyleyen bir engelleme talimatıdır. Diğer talimatların zamanlamasını kontrol etmek için kullanışlıdır.

source: The duration here and elsewhere is in terms of the backend’s cycle time (1 / sample rate), ``dt``. It must take an integer value.
bn_bn: এখানে এবং অন্য কোথাও সময়কাল ব্যাকএন্ডের চক্রের সময় অনুসারে (1 / sample rate), ``dt``। এটি অবশ্যই একটি পূর্ণসংখ্যার মান নিতে হবে।
es_un: La duración aquí y en otros lugares está en términos del tiempo de ciclo del backend (1 / tasa de muestreo), ``dt``. Debe tomar un valor entero.
fr: La durée ici et ailleurs est exprimée en termes de temps de cycles du backend (1 / taux d'échantillonnage), ``dt``. Il s'agit d'une valeur entière.
id_id: Durasi di sini dan di tempat lain adalah dalam siklus waktu dari backend (1 / laju sampel). ``dt``. Ini harus mengambil nilai bilangan bulat.
ja_jp: ここやその他の場所における期間は、バックエンドのサイクル時間 (1 / サンプルレート) を単位とした `` dt`` です。整数値をとります。
ko: 여기서 및 다른 곳에서의 지속 시간은 백엔드의 사이클 시간 (샘플링 속도의 역수), ``dt`` 로 나타난다. 이는 정수를 사용해야 한다.
pt_un: A duração aqui e, em outro lugar, é em termos de tempo de ciclo do backend (1 / taxa da amostra), ``dt``. Deve levar um valor inteiro.
ta: இங்கே மற்றும் பிற இடங்களின் காலம் பின்தளத்தில் சுழற்சி நேரம் (1 / sample rate), ``dt`` ஆக இருக்கும். இது ஒரு முழு மதிப்பை எடுக்க வேண்டும்.
tr: Buradaki ve diğer yerlerdeki süre, arka ucun döngü süresi (1 / örnek oranı), ``dt`` cinsindendir. Bir tamsayı değeri almalıdır.

source: To add a ``delay`` instruction, we pass a duration and a channel, where ``channel`` can be any kind of channel, including ``AcquireChannel``. We use ``pulse.build`` to begin a Pulse Builder context. This automatically schedules our delay into the schedule ``delay_5dt``.
bn_bn: একটি ``delay`` নির্দেশ যোগ করার জন্য, আমরা একটি সময়কাল এবং একটি চ্যানেল পাস করি, যেখানে ``channel``, ``AcquireChannel`` সহ যেকোনো ধরনের চ্যানেল হতে পারে। আমরা একটি পালস বিল্ডার প্রসঙ্গ শুরু করতে ``pulse.build`` ব্যবহার করি। যা স্বয়ংক্রিয়ভাবে আমাদের বিলম্বকে সময়সূচী ``delay_5dt`` তে নির্ধারণ করে।
es_un: Para agregar una instrucción ``delay``, pasamos una duración y un canal, donde ``channel`` puede ser cualquier tipo de canal, incluyendo ``AcquireChannel``. Usamos ``pulse.build`` para comenzar un contexto de Constructor de Pulso. Esto planifica automáticamente nuestro retraso en el programa ``delay_5dt``.
fr: Pour ajouter une instruction ``delay``, nous spécifions une durée et un canal, où ``channel`` peut être n'importe quel type de canal, y compris ``AcquireChannel``. Nous utilisons ``pulse.build`` pour commencer un contexte de générateur d'impulsions. Cela planifie automatiquement notre délai dans le planning ``delay_5dt``.
id_id: Untuk menambah instruksi ``delay``, kita memberikan durasi dan saluran, di mana ``channel`` dapat berupa saluran apa saja, termasuk ``AcquireChannel``. Kita menggunakan ``pulse.build`` untuk memulai konteks Pulse Builder. Ini akan menjadwalkan penundaan secara otomatis ke jadwal ``delay_5dt``.
ja_jp: ``delay`` 命令を追加するには、期間とチャンネルを渡します。ここで、``channel`` は ``AcquireChannel`` を含む任意の種類のチャンネルになります。 Pulse Builder コンテキストを開始するには ``pulse.build`` を使用します。これにより、スケジュール ``delay_5dt`` に遅延が自動的にスケジュールされます。
ko: ``delay`` 명령어를 추가하려면 지속 시간과 채널을 전달하는데, 여기서 ``channel`` 은 ``AcquireChannel`` 을 포함한 어떤 종류의 채널도 될 수 있다. 펄스 빌더 컨텍스트를 시작할 때 ``pulse.build`` 를 사용한다. 이것은 자동으로 ``delay_5dt`` 스케줄에 지연을 예정시킨다.
pt_un: Para adicionar uma instrução de ``delay`` passamos uma duração e um canal, onde ``canal`` pode ser qualquer tipo de canal, incluindo ``AcquireChannel``. Usamos ``pulse.build`` para começar um contexto Pulse Builder. Isto automaticamente agenda o atraso no agendamento de ``delay_5dt``.
ta: ``delay`` அறிவுறுத்தலைச் சேர்க்க, நாங்கள் ஒரு கால அளவையும் ஒரு சேனலையும் கடந்து செல்கிறோம், அங்கு ``channel`` என்பது ``AcquireChannel`` உட்பட எந்தவொரு சேனலாகவும் இருக்கலாம். பல்ஸ் பில்டர் சூழலைத் தொடங்க ``pulse.build`` ஐப் பயன்படுத்துகிறோம். இது ``delay_5dt`` அட்டவணையில் தானாகவே நம் தாமதத்தைத் திட்டமிடுகிறது.
tr: Bir ``delay`` talimatı eklemek için, bir süre ve bir kanal geçiyoruz, burada ``channel``, ``AcquireChannel`` dahil olmak üzere herhangi bir kanal olabilir. Atım derleyici bağlamını başlatmak için ``pulse.build`` kullanıyoruz. Bu, gecikmemizi otomatik olarak ``delay_5dt`` zamanlamasına ayarlar.

source: That’s all there is to it. Any instruction added after this delay on the same channel will execute five timesteps later than it would have without this delay.
bn_bn: এখানেই এটার সমাপ্তি। এই চ্যানেলে এই বিলম্বের পরে যোগ করা যেকোনো নির্দেশ এই বিলম্ব ছাড়াই পাঁচটি টাইমস্টেপ পরে কার্যকর হবে।
es_un: Eso es todo al respecto. Cualquier instrucción agregada después de este retraso en el mismo canal se ejecutarán cinco pasos de tiempo más tarde de lo que lo habría hecho sin este retraso.
fr: C'est tout ce qu'il y a à faire. Toute instruction ajoutée après ce délai sur le même canal sera exécutée cinq temps plus tard qu'elle ne l'aurait été sans ce délai.
id_id: Itulah semuanya. Setiap instruksi yang ditambahkan setelah penundaan ini dalam saluran yang sama akan dieksekusi lima langkah waktu lebih lambat daripada tanpa penundaan.
ja_jp: これがすべてです。 同じチャンネルでこの遅延の後に追加された命令は、この遅延がない場合よりも 5 タイムステップ遅れて実行されます。
ko: 그게 전부이다. 동일한 채널에서 이 지연 이후에 추가된 모든 명령어들은 이 지연이 없는 경우보다 5개의 시간 간격 이후에 실행된다.
pt_un: Isto é tudo o que há nisto. Qualquer instrução adicionada, após este atraso, no mesmo canal, executará cinco vezes mais tarde, do que teria sem esse atraso.
ta: அதற்கான எல்லாமே இருக்கிறது. அதே சேனலில் இந்தத் தாமதத்திற்குப் பிறகு சேர்க்கப்படும் எந்தவொரு அறிவுறுத்தலும் இந்தத் தாமதம் இல்லாமல் ஐந்து மடங்கு தாமதமாக இயங்கும்.
tr: Hepsi bu kadar. Aynı kanalda bu gecikmeden sonra eklenen herhangi bir talimat, bu gecikme olmasaydı gerçekleşecek olan durumdan beş adım daha geç gerçekleştirecektir.

source: The ``play`` instruction is responsible for executing *pulses*. It’s straightforward to add a play instruction:
bn_bn: ``play`` নির্দেশনা *pulses* চালানোর জন্য দায়ী। ``play`` নির্দেশ যোগ করা সহজ:
es_un: La instrucción ``play`` es responsable de ejecutar *pulsos*. Es sencillo añadir una instrucción de reproducción:
fr: L'instruction ``play`` permet l'exécution des *pulses* (impulsions). Il est simple d'en construire une:
id_id: Instruksi ``play`` bertanggung jawab untuk mengeksekusi *pulsa*. Ini cukup mudah untuk menambahkan instruksi mainkan:
ja_jp: ``play`` 命令は*パルス*の実行を担当します。``play`` 命令を追加するのは簡単です。
ko: ``Play`` 명령어는 *펄스* 를 발생시키는 역할을 담당한다. 이 명령어를 추가하는 과정은 간단하다.
pt_un: A instrução ``Rodando`` é responsável para executar *pulsos*. É simples adicionar uma instrução para rodar:
ta: *pulses* ஐ இயக்க ``play`` அறிவுறுத்தலே பொறுப்பாகும். play வழிமுறையைச் சேர்ப்பது நேரடியானது:
tr: ``play`` talimatı *atımların* yürütülmesinden sorumludur. Bir hareket talimatı eklemek kolaydır:

source: Let’s clarify what the ``pulse`` argument is and explore a few different ways to build one.
bn_bn: আসুন ``pulse`` যুক্তিটি কী তা ব্যাখ্যা করি এবং একটি তৈরি করার কয়েকটি ভিন্ন উপায় অন্বেষণ করি।
es_un: Aclaremos lo que es el argumento ``pulse`` y exploremos algunas maneras diferentes de construir uno.
fr: Précisons ce qu'est l'argument de ``pulse`` et explorons quelques façons différentes d'en construire un.
id_id: Mari kita klarifikasi apa itu argumen ``pulsa`` dan mengeksplorasi beberapa cara berbeda untuk membangun.
ja_jp: ``pulse`` の引数が何であるかを明確にして、それを構築するいくつかの異なる方法を探りましょう。
ko: ``pulse`` 의 전달인자가 무엇인지를 분명히 하고, 이를 만드는 몇 가지 다른 방법들을 탐구해보자.
pt_un: Vamos esclarecer o que o argumento ``pulse`` é e explorar algumas maneiras diferentes de construir um.
ta: ``pulse`` ஆர்கியுமென்ட் என்ன என்பதை தெளிவுபடுத்துவோம், மேலும் ஒன்றை உருவாக்க சில வேறுபட்ட வழிகளை ஆராய்வோம்.
tr: ``pulse`` argümanının ne olduğunu açıklığa kavuşturalım ve bir tane oluşturmanın birkaç farklı yolunu keşfedelim.

source: Pulses
bn_bn: তড়িৎস্পন্দন বা পালস
es_un: Pulsos
fr: Impulsions (``Pulses``)
id_id: Pulsa
ja_jp: パルス
ko: 펄스
pt_un: Pulsos
ta: பல்ஸ்கள்
tr: Atımlar

source: A ``Pulse`` specifies an arbitrary pulse *envelope*. The modulation frequency and phase of the output waveform are controlled by the ``set_frequency`` and ``shift_phase`` instructions, which we will cover next.
bn_bn: একটি ``Pulse`` একটি ইচ্ছাধীন পালস *envelope* নির্দিষ্ট করে। আউটপুট ওয়েভফর্মের ফেজ এবং মড্যুলেশন ফ্রিকোয়েন্সি যথাক্রমে ``set_frequency`` এবং ``shift_phase`` নির্দেশাবলী দ্বারা নিয়ন্ত্রিত হয়, যা আমরা পরবর্তীতে কভার করবো।
es_un: Un ``Pulse`` especifica un pulso *envolvente* arbitrario. La frecuencia de modulación y la fase de la forma de onda de salida están controladas por las instrucciones ``set_frequency`` y ``shift_phase``, que cubriremos a continuación.
fr: Un ``Pulse`` permet de spécifier une *enveloppe* arbitraire d'impulsion. La fréquence de modulation et la phase de la forme d'onde de sortie sont contrôlées par les instructions ``SetFrequency`` et ``ShiftPhase``, que nous couvrirons ensuite.
id_id: Sebuah ``Pulse`` menentukan *amplop* pulsa apa aja. Frekuensi modulasi dan fasa dari bentuk gelombang keluaran dikontrol oleh instruksi ``set_frequency`` dan ``shift_phase``, yang akan kita jelaskan kemudian.
ja_jp: ``Pulse`` は、任意のパルス *エンベロープ* を指定します。出力波形の変調周波数と位相は、次に説明する ``setFrequency`` と ``shiftPhase`` 命令によって制御されます。
ko: ``Pulse`` 는 임의의 펄스 *포락선(envelope)* 을 지정한다. 출력 파형의 변조 주파수와 위상은 다음에 다룰 ``set_frequency`` 와 ``shift_phase`` 로 제어된다.
pt_un: Um ``Pulse`` especifica um pulso *envelope* arbitrário. A frequência de modulação e a fase da onda de saída são controladas pela instrução ``set_frequency`` e ``shift_phase``, que abordaremos em seguida.
ta: ஒரு ``Pulse`` ஒரு தன்னிச்சையான பல்ஸ் *envelope* ஐக் குறிக்கிறது. வெளியீட்டு அலைவடிவத்தின் பண்பேற்றம் அதிர்வெண் மற்றும் கட்டம் ``set_frequency`` மற்றும் ``shift_phase`` அறிவுறுத்தல்களால் கட்டுப்படுத்தப்படுகின்றன, அவை அடுத்ததாக நாம் காண்போம்.
tr: ``Pulse``, rastgele bir atım *zarfı* belirtir. Çıkış dalga formunun modülasyon frekansı ve fazı, daha sonra ele alacağımız ``set_frequency`` ve ``shift_phase`` talimatları tarafından kontrol edilir.

source: The image below may provide some intuition for why they are specified separately. Think of the pulses which describe their envelopes as input to an arbitrary waveform generator (AWG), a common lab instrument – this is depicted in the left image. Notice the limited sample rate discritizes the signal. The signal produced by the AWG may be mixed with a continuous sine wave generator. The frequency of its output is controlled by instructions to the sine wave generator; see the middle image. Finally, the signal sent to the qubit is demonstrated by the right side of the image below.
bn_bn: নীচের ছবিটি কেন সেগুলি আলাদাভাবে নির্দিষ্ট করা হয়েছে তার জন্য কিছু অন্তর্দৃষ্টি প্রদান করতে পারে। পালসগুলির কথা চিন্তা করুন যা তাদের আচ্ছাদনগুলিকে একটি নির্বিচার তরঙ্গাকৃতি জেনারেটরের (arbitrary waveform generator - AWG) ইনপুট হিসাবে বর্ণনা করে, একটি সাধারণ ল্যাব যন্ত্র - এটি বাম ছবিতে দেখানো হয়েছে। লক্ষ্য করুন সীমিত নমুনা হার সংকেতকে অস্বীকার করে। AWG দ্বারা উত্পাদিত সংকেত একটি ক্রমাগত সাইন ওয়েভ জেনারেটরের সাথে মিশে যেতে পারে। এর আউটপুটের ফ্রিকোয়েন্সি সাইন ওয়েভ জেনারেটরের নির্দেশ দ্বারা নিয়ন্ত্রিত হয়; মাঝের ছবিটি দেখুন। অবশেষে, কিউবিটে পাঠানো সংকেতটি নীচের চিত্রের ডান দিক দিয়ে প্রদর্শিত হয়।
es_un: La siguiente imagen puede proporcionar una idea de por qué se especifican por separado. Piensa en los pulsos que describen sus envolventes como entrada a un generador de forma de onda arbitraria (arbitrary waveform generator, AWG), un instrumento de laboratorio común; esto se muestra en la imagen de la izquierda. Observa que la frecuencia de muestreo limitada discretiza la señal. La señal producida por el AWG se puede mezclar con un generador de onda sinusoidal continua. La frecuencia de su salida se controla mediante instrucciones al generador de onda sinusoidal; observa la imagen de en medio. Finalmente, la señal enviada al qubit se muestra en el lado derecho de la imagen de abajo.
fr: L'image ci-dessous peut fournir une certaine intuition pour la raison pour laquelle cees arguments sont spécifiés séparément. Pensez aux impulsions qui décrivent leurs enveloppes comme entrées dans un générateur de forme d'onde arbitraire (AWG, Arbitrary Waveform Generator), un instrument de laboratoire commun -- ceci est représenté dans l'image de gauche. Remarquez que le taux d'échantillonnage limité rend le signal discret. Le signal produit par l'AWG peut être mélangé avec un générateur d'ondes sinusoïdales continue. La fréquence de sa sortie est contrôlée par des instructions au générateur d'onde sinusoïdale ; voir l'image du milieu. Enfin, le signal envoyé au qubit est montré sur le côté droit de l'image ci-dessous.
id_id: Gambar di bawah ini dapat memberikan intuisi mengapa mereka ditentukan secara terpisah. Pikirkan pulsa yang menggambarkan amplopnya sebagai input ke generator bentuk gelombang apa saja (arbitrary waveform generator/AWG), instrumen lab yang umum – ini digambarkan pada gambar yang kiri. Perhatikan laju sampel yang terbatas mendiskritkan sinyalnya. Sinyal yang dihasilkan oleh AWG dapat tercampur dengan sebuah generator sinyal sinus kontinu. Frekuensi dari outputnya dikontrol oleh instruksi ke generator sinyal sinus; lihat gambar yang tengah. Akhirnya, sinyal yang dikirimkan ke qubit didemonstrasikan pada gambar yang kanan di bawah ini.
ja_jp: 以下の画像は、なぜそれらが個別に指定されているかを直感的に示しています。一般的な研究機器である任意波形発生器 (arbitrary waveform generator、AWG) への入力として、エンベロープを表すパルスを考えてください。これは左の画像に示されています。制限されたサンプルレートが信号を区別していることに注意してください。AWGによって生成された信号は、連続正弦波ジェネレータと混合されます。その出力の周波数は、正弦波発生器への指示によって制御されます。中央の画像を参照してください。最後に、量子ビットに送信された信号は、下の画像の右側に示されています。
ko: 아래의 그림은 왜 그들을 따로 지정해야하는지에 대한 직관을 제공할 수 있다. 펄스의 포락선이 일반적인 실험실 장비인 임의 파형 발생기(arbitrary waveform generator, AWG)에 입력되어 왼쪽 그림과 같이 나타나는 것을 생각해 보라. 제한된 샘플링율이 신호를 이산화(디지털화)시키는 것에 유의하라. AWG가 발생시킨 신호는 연속 사인파 발생기와 혼합될 수 있다. 출력 주파수는 사인파 발생기에 주어진 명령으로 제어된다 (가운데 그림을 보라). 마지막으로 큐비트에 전송되는 신호는 아래 그림의 오른쪽 그림으로 설명될 수 있다.
pt_un: A imagem, abaixo, pode fornecer alguma intuição para o motivo pelo qual elas são especificadas, separadamente. Pense em pulsos que descrevem seus envelopes como entrada, para um gerador de onda arbitrária (AWG), um instrumento comum do laboratório -- isto é retratado na imagem da esquerda. Observe que a taxa de amostragem limitada descreve o sinal. O sinal produzido pelo AWG pode ser misturado com um gerador de ondas senoidais contínuas. A frequência de sua saída é controlada por instruções para o gerador de ondas senoidais; veja a imagem do meio. Finalmente, o sinal enviado para o qubit é demonstrado pelo lado direito da imagem, abaixo.
ta: கீழேயுள்ள படம் அவை ஏன் தனித்தனியாக குறிப்பிடப்படுகின்றன என்பதற்கான சில உள்ளுணர்வை வழங்கக்கூடும். ஒரு பொதுவான ஆய்வக கருவியான தன்னிச்சையான அலைவடிவ ஜெனரேட்டருக்கு (AWG) உள்ளீடாக அவற்றின் உறைகளை விவரிக்கும் பருப்புகளைப் பற்றி சிந்தியுங்கள் - இது இடது படத்தில் சித்தரிக்கப்பட்டுள்ளது. வரையறுக்கப்பட்ட மாதிரி விகிதம் சமிக்ஞையை வேறுபடுத்துகிறது என்பதைக் கவனியுங்கள். AWG ஆல் உருவாக்கப்படும் சமிக்ஞை தொடர்ச்சியான சைன் அலை ஜெனரேட்டருடன் கலக்கப்படலாம். அதன் வெளியீட்டின் அதிர்வெண் சைன் அலை ஜெனரேட்டருக்கான வழிமுறைகளால் கட்டுப்படுத்தப்படுகிறது; நடுத்தர படத்தைப் பார்க்கவும். இறுதியாக, க்யூபிட்டிற்கு அனுப்பப்படும் சமிக்ஞை கீழே உள்ள படத்தின் வலது பக்கத்தால் நிரூபிக்கப்படுகிறது.
tr: Aşağıdaki görüntü, neden ayrı olarak belirtildiklerine dair bazı sezgiler sağlayabilir. Zarflarını, yaygın bir laboratuvar aleti olan rastgele bir dalga biçimi üretecine (AWG) girdi olarak tanımlayan atımları düşünün - bu, soldaki resimde gösterilmektedir. Sınırlı örnekleme hızının sinyali ayırt ettiğine dikkat edin. AWG tarafından üretilen sinyal, sürekli bir sinüs dalgası üreteci ile karıştırılabilir. Çıkışının frekansı, sinüs dalgası üretecine verilen talimatlarla kontrol edilir; ortadaki resme bakın. Son olarak, kübite gönderilen sinyal aşağıdaki görüntünün sağ tarafında gösterilmiştir.
