Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/07_building_pulse_schedules.po
Languages: fr_fr, ja_jp

source: This page was generated from `tutorials/circuits_advanced/07_building_pulse_schedules.ipynb`__.
fr_fr: Cette page a été générée à partir de ` tutorials/circuits_advanced/07_building_pulse_schedules.ipynb ` __.
ja_jp: 当ページは `tutorials/circuits_advanced/07_building_pulse_schedules.ipynb`__ から生成されました。

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/07_building_pulse_schedules.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le ` IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/07_building_pulse_schedules.ipynb>` _.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/07_building_pulse_schedules.ipynb>`_ でインタラクティブに実行します。

source: Building Pulse Schedules
fr_fr: Construire des ordonnancements d'impulsions
ja_jp: Pulseスケジュールの構築

source: Building ``Schedule``\ s is very straightforward, yet there are a few ways to compose them. We’re going to explore these different methods here.
fr_fr: Planifier des ordonnancements (``Schedule``) est très simple, même si plusieurs méthodes existent pour cela. Nous allons explorer ici ces différentes méthodes.
ja_jp: ``Schedule`` を構築するのはとても簡単ですが、それらを構成する方法はいくつかあります。ここでは、これらの様々な方法を見ていきます。

source: In this tutorial we use the ``Play`` instruction, with a ``ConstantPulse`` pulse argument. To learn about these and other ``Instruction``\ s, first check out `this page <2_building_pulse_instructions.ipynb>`__.
fr_fr: Dans ce tutoriel, nous allons utiliser l'instruction ``Play`` prenant en argument une impulsion de type ``ConstantPulse``. Pour découvrir les différents types d'Instructions, consultez `cette page <2_building_pulse_instructions.ipynb>`__.

source: Tip: ``Instruction``\ s can be treated just like ``Schedule``\ s – that means all the methods we use here work equally well for composing ``Schedule``\ s with ``Schedule``\ s, ``Instruction``\ s with ``Instruction``\ s, or between the two.
fr_fr: Astuce: les ``Instruction``\s peuvent être traitée comme des ``Schedule``\ s - cela signifie que toutes les méthodes que nous utilisons ici fonctionnent tout autant pour pour composer des ``Schedule``\ s entre eux, ou des ``instruction``\ s entre elles ou les uns avec les autres.
ja_jp: ヒント: ``Instruction`` は ``Schedule`` と同じように扱うことができます。つまり、ここで使用するすべてのメソッドは ``Schedule`` と ``Schedule`` 、 ``Instruction`` と ``Instruction`` 、あるいはその２つの間で構成する場合にも同様に適切に処理されます。

source: As the basis for trying out the composition methods, let’s initialize a couple dummy ``Schedule``\ s.
fr_fr: Pour appréhender la composition de méthodes, initialisons un couple de ``Schedule``\s.
ja_jp: 構成メソッドを試すための基礎として、ふたつのダミー ``Schedule`` を初期化しておきましょう。

source: ``insert`` or ``|``
fr_fr: ``insert`` ou ``|``
ja_jp: ``insert`` または ``|``

source: The ``insert`` method schedules an ``Instruction`` or ``Schedule`` at a particular time. Let’s use it to give each of our schedules a different instruction.
fr_fr: La méthode ``insert`` définit une durée sur une ``Instruction`` ou sur un ``Schedule``. Utilisons la pour attribuer différentes durées à nos objets ``Schedule``.
ja_jp: ``insert`` メソッドは特定の時間に ``Instruction`` または ``Schedule`` をスケジュールします。それぞれのスケジュールに異なる命令を与えるために使いましょう。

source: The insert schedule method overloads the ``|`` (or) operator for ``Schedule``\ s, so we will use this special syntax on schedule ``B``. When using this syntactic sugar, the ``time`` argument is implicitly zero.
fr_fr: La méthode insert surcharge l'opérateur ``|`` (ou) lorsqu'elle est appliquée à des ``Schedule``\s, aussi allons-nous utiliser cette syntaxe sur l'objet ``B``. Sous ces conditions, l'argument ``time`` est implicitement positionné à zéro.
ja_jp: insertスケジュールメソッドは、 ``|`` (or) 演算子を ``Schedule`` にオーバーロードするため、スケジュール ``B`` でこの特別な構文を使用します。この糖衣構文を使用する場合、 ``time`` 引数は暗黙的にゼロになります。

source: ``shift`` or ``<<``
fr_fr: ``shift`` ou ``<<``
ja_jp: ``shift`` または ``<<``

source: Sometimes we need to offset one schedule from ``time=0``. For instance, when using ``|``, we use ``shift`` to add an instruction at a time besides zero.
fr_fr: Il est parfois nécessaire de décaler l'exécution d'une impulsion (et ainsi ne plus avoir ``time=0``). Lorsque nous utilisons l'opérateur ``|``, la commande ``shift`` permet d'ajouter ce décalage.
ja_jp: 時々、あるスケジュールを ``time=0`` からオフセットする必要があります。 例えば、 ``|`` を使用する場合は、ゼロ以外の時刻に命令を追加するために ``shift`` を使用します。

source: Let’s see how we can use ``insert`` to compose schedules ``A`` and ``B`` together.
fr_fr: Voyons comment nous pouvons utiliser ``insert`` pour composer les schedules ``A`` et ``B`` ensemble.
ja_jp: ``insert`` を使って ``A`` と ``B`` のスケジュールを一緒に構成する方法を見てみましょう。

source: ``append`` or ``+``
fr_fr: ``append`` ou ``+``
ja_jp: ``append`` または ``+``

source: The ``append`` method is like ``insert``, but the insertion time is determined for us. The ``Instruction`` or ``Schedule`` being added will begin when all the channels common to the two become free. If they contain no common channels, then the ``Schedule`` will be appended at ``time=0``. In pseudocode:
fr_fr: La méthode ``append`` est équivalente à la méthode ``insert``, mais le temps d'insertion est déterminé automatiquement. L'objet ``Instruction`` ou ``Schedule`` sera exécuté dès que tous les canaux (channels) communs aux deux seront libres. Si les deux objets ne contiennent pas de canaux communs, l'objet ``Schedule`` sera exécuté à time=0. En pseudocode:
ja_jp: ``append`` メソッドは ``insert` に似ていますが、挿入時間は私たちのために決定されます。追加される ``Instruction`` または ``Schedule`` は、2つに共通のすべてのチャネルが解放されたときに開始されます。共通のチャネルが含まれていない場合、 ``Schedule`` は ``time=0`` で追加されます。 擬似コードの場合：

source: The append schedule method overloads the ``+`` (add) operator for Schedules.
fr_fr: La méthode append surcharge l'opérateur ``+`` (plus) dans le cadre d'ordonnancements.
ja_jp: appendスケジュールメソッドは、Scheduleの ``+`` (add) 演算子をオーバーロードします。

source: Let’s continue with schedule ``A`` and schedule ``B``. Remember that they both have instructions scheduled on the same channel, ``DriveChannel(0)``. Schedule ``A`` contains positive amplitude pulses, and schedule ``B`` contains negative amplitude pulses.
fr_fr: Illustrons cela avec nos schedules ``A`` et ``B``. Rappelons nous que tous les deux ont des instructions définies sur le même canal,`` DriveChannel(0)``. Le schedule ``A`` contient des impulsions d'amplitude positive, le schedule ``B`` contient des impulsions d'amplitude négative.
ja_jp: スケジュール ``A`` とスケジュール ``B`` を続けて行きましょう。どちらも同じチャネル、 ``DriveChannel(0)`` でスケジュールされた命令があることを覚えておいてください。スケジュール ``A`` は正の振幅パルスを含み、スケジュール ``B`` は負の振幅パルスを含みます。

source: Let’s see what happens when there are no common channels.
fr_fr: Voyons ce qui se passe lorsque les objets schedule n'ont pas de canal en commun.
ja_jp: 共通のチャネルがない場合に何が起こるか見てみましょう。

source: Warning: Common channels is not the same as common qubits. Measurements require different channels than gate operations, even on one qubit. If you simply append a measurement to a schedule, you’ll likely schedule your measurement at ``time=0``, not what you were expecting! Instead, use the shift operation, with ``schedule.duration`` as the time argument.
fr_fr: Attention: Avoir des canaux communs ne signifie pas avoir des qubits communs. Les mesures requièrent d'utiliser des canaux différents des opérations de portes, même sur un seul qubit. Si vous faites un schedule d'une mesure, la mesure se fera sans doute à ``time=0``, ce qui n'est pas ce que attendez à priori ! Nous vous conseillons plutôt d'utiliser l'opération shift, avec ``schedule.duration`` comme argument temporel.
ja_jp: 警告: 共通チャネルは共通量子ビットと同じではありません。ひとつの量子ビットだったとしても、測定にはゲート操作とは異なるチャネルが必要です。単純に測定をスケジュールに追加すると、 ``time=0`` で測定をスケジュールすることになり、期待していたものではないではなくなってしまいます。代わりに、時刻の引数として ``schedule.duration`` とあわせて shift 操作が使えます。

source: This time, the new instruction being appended was added at ``time=0``, because it did not have any instructions on ``DriveChannel(0)``.
fr_fr: Dans cette situation, la nouvelle instruction a été exécutée à ``time=0``, car il n'y avait pas d'instruction sur ``DriveChannel(0)``.
ja_jp: 今回、新たな命令は ``time=0`` に追加されました。それは、 ``DriveChannel(0)`` に関する命令がなかったためです。

source: Be wary: ``append`` only “slides” the appended schedule into the original around channels that are not common between them. The following example demonstrates this point.
fr_fr: Attention: ``append`` ne ``glisse`` le planning que pour les canaux distincts. L'exemple suivant illustre ce point.
ja_jp: 注意してください: ``append`` は、追加されたスケジュールを、それらの間で共通ではない元のチャネルに "スライド" させるだけです。 次の例は、この点を示しています。

source: Congrats, you’ve mastered schedule composition!
fr_fr: Félicitation, vous maitrisez la composition d'ordonnancements (``Schedule``) !
ja_jp: おめでとうございます。スケジュール構成をマスターしました。

source: On the next page, we will see how to `add measurements to your schedule <4_adding_measurements.ipynb>`__.
fr_fr: Dans la prochaine section, nous verrons comment `ajouter des mesures à votre ordonnancement`<4_adding_measurements.ipynb>`__.
