Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/07_pulse_scheduler.po
Languages: bn_bn, es_un, fr, id_id, ja_jp, ko_kr, pt_un, ta_in, tr

source: This page was generated from `tutorials/circuits_advanced/07_pulse_scheduler.ipynb`__.
bn_bn: এই পেজটির উৎস `tutorials/circuits_advanced/2_operators_overview.ipynb`__ ।
es_un: Esta página fue generada a partir de `tutorials/circuits_advanced/07_pulse_scheduler.ipynb`__.
fr: Cette page a été générée à partir de `tutorials/circuits_advanced/07_pulse_scheduler.ipynb`__.
id_id: Halaman ini dibuat dari ` tutorials/circuits_advanced/01_advanced_circuits.ipynb ` __.
ja_jp: 当ページは `tutorials/circuits_advanced/07_pulse_scheduler.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/circuits_advanced/07_pulse_scheduler.ipynb`__ 로부터 생성되었다.
pt_un: Esta página foi gerada a partir de `tutorials/circuits_advanced/07_pulse_scheduler.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/circuits_advanced/07_pulse_scheduler.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
tr: Bu sayfa `tutorials/circuits_advanced/07_pulse_scheduler.ipynb`__ adresinden oluşturulmuştur.

source: Using the Scheduler
bn_bn: শিডিউলারের ব্যবহার
es_un: Usando el Planificador
fr: Utiliser le Scheduler
id_id: Menggunakan Scheduler (Pembuat Jadwal)
ja_jp: スケジューラーの使用
ko_kr: 스케줄러 사용하기
pt_un: Usando o agendador
ta_in: திட்டமிடுபவரைப் பயன்படுத்துதல்
tr: Zamanlayıcıyı Kullanma

source: The scheduler will translate a ``QuantumCircuit`` into a Pulse ``Schedule``, using gate and measurement *calibrations*: an optimized pulse-level description of an operation on particular qubits.
bn_bn: শিডিউলারটি ``QuantumCircuit`` কে একটি পালস ``Schedule`` এ পরিনত করবে যা ব্যবহার করে তা হল মেজারমেন্ট *calibrations*: নির্দিষ্ট কোনো কিউবিটসমুহের ওপর ক্রিয়াশীলতার একটি উন্নীত পালস লেভেলের মাপকাঠি।
es_un: El planificador traducirá un ``QuantumCircuit`` en un ``Schedule`` de pulsos, utilizando *calibraciones* de compuertas y mediciones: una descripción optimizada a nivel de pulsos de una operación en qubits particulares.
fr: L'ordonnanceur (``Scheduler``) va traduire un ``QuantumCircuit`` en une Pulse ``Schedule``, en utilisant des *calibrations* des ´´gates´´ et des mesures: une description optimisée au niveau d'impulsion d'une opération sur des qubits particuliers.
id_id: Pembuat jadwal akan menerjemahkan sebuah ` ` QuantumCircuit ` `menjadi Pulsa` ` Schedule ` ` dengan menggunakan gerbang dan pengukuran * kalibrasi *: deskripsi tingkat pulsa dari operasi pada qubits tertentu yang dioptimalkan.
ja_jp: スケジューラーは、ゲートと測定 *較正* を使用して、``QuantumCircuit`` を パルス ``Schedule`` に変換します。これは特定の量子ビットに関する操作の最適化されたパルスレベルの記述です。
ko_kr: 스케줄러는 ``QuantumCircuit`` 을 게이트와 측정 *교정* (특정 큐비트 연산에 대해 최적화된 펄스-레벨 기술)을 이용하여 펄스 ``Schedule`` 로 변환한다.
pt_un: O agendador irá traduzir um ``QuantumCircuit`` em um Pulso ``Schedule``, usando a porta e *calibrações* de medições: uma descrição otimizada de nível pulso de uma operação em determinados qubits.
ta_in: கேட் மற்றும் அளவீட்டு *calibrations* களைப் பயன்படுத்தி, ``QuantumCircuit`` ஐ ஒரு பல்ஸுக்கு ``Schedule`` என்று திட்டமிடுபவர் மொழிபெயர்ப்பார்: குறிப்பிட்ட க்யூபிட்களில் ஒரு செயல்பாட்டின் உகந்த பல்ஸ்-நிலை விளக்கம்.
tr: Zamanlayıcı, geçit ve ölçüm *kalibrasyonları*: belirli kübitler üzerindeki bir işlemin optimize edilmiş bir atım seviyesi açıklamasını kullanarak bir ``QuantumCircuit``de bir Atım ``Schedule``a çevirecektir.

source: Backends that are OpenPulse enabled will typically have calibrations defined for measurements and for each of its basis gates. Calibrations can also be defined or updated by the user.
bn_bn: OpenPulse চালু থাকলে সেসব ব্যাকএন্ডে সাধারণত পরিমাপ এবং এর প্রত্যেক বেসিস গেইটের জন্য ক্যালিব্রেশন সংজ্ঞায়িত থাকে। ব্যবহারকারী ইচ্ছা করলে সে ক্যালিব্রেশন সংজ্ঞায়িত বা পরিবর্তন করতে পারে।
es_un: Los backends que están habilitados para OpenPulse normalmente tendrán calibraciones definidas para las mediciones y para cada una de sus compuertas base. El usuario también puede definir o actualizar las calibraciones.
fr: Les systèmes d'exécution (``Backends``) qui sont activés avec OpenPulse auront généralement des calibrations définis pour des mesures et pour chacune de ses portes (``gates``) de base. Les calibrations peuvent également être définis ou mis à jour par l'utilisateur.
id_id: Backends yang diaktifkan OpenPulse biasanya memiliki kalibrasi yang didefinisikan untuk pengukuran dan untuk setiap gerbang dasar. Kalibrasi juga dapat didefinisikan atau diperbarui oleh pengguna.
ja_jp: OpenPulse対応のバックエンドは、通常、測定用および各基底ゲート用に定義された較正を行います。 較正は、ユーザーによって定義または更新することもできます。
ko_kr: OpenPulse가 활성화된 백엔드는 일반적으로 측정 및 각 기본 게이트에 대해 정의된 보정이 있다. 사용자가 교정을 정의하거나 업데이트할 수도 있다.
pt_un: Backends que estão habilitados como OpenPulse normalmente terão calibrações definidas para medições e para cada uma de suas portas base. As calibrações também podem ser definidas ou atualizadas pelo usuário.
ta_in: ஓப்பன் பல்ஸ் இயக்கப்பட்ட பின்தளத்தில் பொதுவாக அளவீடுகள் மற்றும் அதன் ஒவ்வொரு அடிப்படை வாயில்களுக்கும் வரையறுக்கப்பட்ட அளவுத்திருத்தங்கள் இருக்கும். அளவுத்திருத்தங்களை பயனரால் வரையறுக்கலாம் அல்லது புதுப்பிக்கலாம்.
tr: OpenPulse etkinleştirilmiş arkayüzeyler, tipik olarak ölçümler ve temel geçitlerinin her biri için tanımlanmış kalibrasyonlara sahip olacaktır. Kalibrasyonlar ayrıca kullanıcı tarafından tanımlanabilir veya güncellenebilir.

source: Basic usage
bn_bn: প্রাথমিক ব্যবহার
es_un: Uso básico
fr: Utilisation de base
id_id: Penggunaan dasar
ja_jp: 基本的な使い方
ko_kr: 기본 사용법
pt_un: Uso básico
ta_in: அடிப்படை பயன்பாடு
tr: Temel kullanım

source: To start, build a quantum circuit as you would normally. For our example below, we create a simple Bell state.
bn_bn: প্রথমে আপনি যেভাবে কোয়ান্টাম সার্কিট নির্মাণ করতেন সেভাবে সাধারণ একটা সার্কিট নির্মাণ করুন। উদাহরণের জন্য আমরা একটা সিম্পল বেল স্টেট বানাবো।
es_un: Para empezar, construye un circuito cuántico como lo harías normalmente. Para nuestro ejemplo a continuación, creamos un estado de Bell simple.
fr: Pour commencer, construisez un circuit quantique comme vous le feriez normalement. Pour notre exemple ci-dessous, nous créons un simple état de Bell.
id_id: Untuk memulai, Anda bisa membangun rangkaian kuantum seperti biasanya. Untuk contoh kita di bawah ini, kita membuat sebuah keadaan Bell yang sederhana.
ja_jp: まず、普通に量子回路を構築します。以下の例では、シンプルな Bell 状態を作成します。
ko_kr: 우선, 평소처럼 양자 회로를 만든다. 아래 예제에서는 간단한 Bell 상태를 작성한다.
pt_un: Para começar, construa um circuito quântico como você faria normalmente. Para o nosso exemplo abaixo, criamos um estado simples de Bell.
ta_in: தொடங்க, நீங்கள் சாதாரணமாக ஒரு குவாண்டம் சுற்று உருவாக்க. கீழே உள்ள எங்கள் எடுத்துக்காட்டுக்கு, நாங்கள் ஒரு எளிய பெல் நிலையை உருவாக்குகிறோம்.
tr: Başlamak için normalde yaptığınız gibi bir kuantum devresi oluşturun. Aşağıdaki örneğimiz için basit bir Bell durumu oluşturuyoruz.

source: We'll use the mocked backend, ``FakeHanoi``, to demonstrate how to use the scheduler. It contains default calibrations for measurement and for its basis gates. The Hadamard operation is not one of those basis gates, so we use the transpiler to compile our input circuit to an equivalent circuit in terms of the basis gates of the device.
es_un: Usaremos el backend emulado, ``FakeHanoi``, para demostrar cómo usar el planificador. Contiene calibraciones predeterminadas para la medición y para sus compuertas base. La operación Hadamard no es una de esas compuertas base, por lo que usamos el transpilador para compilar nuestro circuito de entrada en un circuito equivalente en términos de las compuertas base del dispositivo.

source: Let's see how our schedule ``schedule`` built from the circuit ``transpiled_circ`` looks.
es_un: Veamos cómo se ve nuestro planificador ``schedule`` construido a partir del circuito ``transpiled_circ``.

source: That covers the basics! We used the transpiler to rewrite the circuit in terms of the basis gates, and then used the backend's default calibrations to schedule the transpiled circuit. Next we will go through scheduling with calibrations we will build ourselves.
es_un: ¡Eso cubre lo básico! Usamos el transpilador para reescribir el circuito en términos de las compuertas base y luego usamos las calibraciones predeterminadas del backend para planificar el circuito transpilado. A continuación, pasaremos por la planificación con calibraciones que construiremos nosotros mismos.

source: Scheduling with custom gate definitions
bn_bn: কাস্টম গেইট দ্বারা সময়সূচী বানানো
es_un: Planificación con definiciones de compuertas personalizadas
fr: Ordonnance avec des définitions de porte customisées
id_id: Penjadwalan dengan definisi gerbang khusus
ja_jp: カスタム・ゲート定義によるスケジューリング
ko_kr: 사용자 정의 게이트로 스케줄링하기
pt_un: Agendamento com definições de porta customizadas
ta_in: தனிப்பயன் கேட் வரையறைகளுடன் திட்டமிடல்
tr: Özel kapı tanımlarıyla programlama

source: If your input circuit has calibrations defined, it will use those calibrations when scheduling your circuit.
bn_bn: যদি ইনপুট বর্তনীতে (সার্কিট) আগে থেকে ক্রমাঙ্কন (ক্যালিব্রেশন) সংজ্ঞায়িত থাকে তাহলে বর্তনী (সার্কিট) সূচিত করার সময় ওই ক্রমাঙ্কন (ক্যালিব্রেশন) গুলো ব্যবহৃত হবে।
es_un: Si tu circuito de entrada tiene calibraciones definidas, se utilizarán esas calibraciones al planificar tu circuito.
fr: Si votre circuit d'entrée a des calibrations définies, ces calibrations seront utilisées lors de la planification de votre circuit.
id_id: Jika sirkuit masukan Anda memiliki kalibrasi yang didefinisikan, itu akan menggunakan kalibrasi tersebut ketika penjadwalan sirkuit Anda.
ja_jp: 入力回路に較正が定義されている場合は、回路をスケジュールするときにこれらの較正を使用します。
ko_kr: 입력 회로에 교정이 정의되어 있는 경우, 회로를 스케줄할 때 그 교정을 사용한다.
pt_un: Se seu circuito de entrada tiver calibrações definidas, ele usará essas calibrações ao agendar seu circuito.
ta_in: உங்கள் உள்ளீட்டு சுற்று அளவீடுகள் வரையறுக்கப்பட்டிருந்தால், உங்கள் சுற்று திட்டமிடும்போது அது அந்த அளவுத்திருத்தங்களைப் பயன்படுத்தும்.
tr: Eğer giriş devrenizde tanımlanmış kalibrasyonlar varsa, devrenizi planlarken bu kalibrasyonları kullanacaktır.

source: Notice that the initial pulse on ``D0``, the Hadamard gate, is now implemented with our custom pulse.
bn_bn: লক্ষ্য করো, ``D0`` হ্যাডামার্ড গেটে প্রাথমিক তড়িৎস্পন্দনটি আমাদের কাস্টম পালস দিয়ে বানানো হয়েছে।
es_un: Observa que el pulso inicial en ``D0``, la compuerta Hadamard, ahora se implementa con nuestro pulso personalizado.
fr: Notez que l'impulsion initiale sur ``D0``, la porte Hadamard, est maintenant implémentée avec notre impulsion personnalisée.
id_id: Perhatikan bahwa pulsa awal pada ` ` D0 ` `, gerbang Hadamard, sekarang diimplementasikan dengan pulsa kustom kita.
ja_jp: ``D0`` 上の最初のパルスである、アダマールゲートがカスタムパルスで実装されていることに注意してください。
ko_kr: ``D0`` 의 초기 펄스인 Hadamard 게이트가 이제 사용자 정의 펄스로 구현되었다는 것에 주목하자.
pt_un: Observe que o pulso inicial de ``D0``, a porta Hadamard, está agora implementado com nosso pulso personalizado.
ta_in: ``D0`` இன் ஆரம்ப துடிப்பு, ஹடமார்ட் கேட் இப்போது எங்கள் தனிப்பயன் துடிப்புடன் செயல்படுத்தப்படுவதைக் கவனியுங்கள்.
tr: Hadamard kapısı olan ``D0`` üzerindeki ilk atıma artık özel atım uygulandığına dikkat edin.

source: Scheduler methods
bn_bn: শিডিউলারের ম্যাথডসমুহ
es_un: Métodos del planificador
fr: Méthode d'ordonnance (``scheduler``)
id_id: Metode penjadwalan (Scheduler)
ja_jp: スケジューラーのメソッド
ko_kr: 스케줄러 메서드
pt_un: Métodos de agendamento
ta_in: திட்டமிடல் முறைகள்
tr: Zamanlayıcı yöntemleri

source: The scheduler can follow multiple routines. By default, it follows an *as late as possible* (ALAP) rule. Another scheduling method is *as soon as possible*, (ASAP). For both methods, the output schedule is minimal: in the longest-duration operation path of the input circuit, the start time of each operation is the end time of the proceeding operation. The methods determine how to schedule operations outside that longest path.
bn_bn: শিডিউলার অসংখ্য পদ্ধতি ব্যাবহার করতে পারে। তবে প্রাথমিকভাবে, এটি *as late as possible* (ALAP) পদ্ধতি ব্যাবহার করে। এছাড়া আরেকটি পদ্ধতি হল *as soon as possible* বা (ASAP)। দুই পদ্ধতিতেই আউটপট শিডিউল হল নুন্যতম হয়: ইনপুট সার্কিটের বেশি সময় ধরে অপারেশনের ক্ষেত্রে প্রত্যেকটি অপারেশনের শুরুর সময় পূর্বে চলা অপারেশোনের শেষের সময়ের সমান। পদ্ধতিগুলো মূলত বেশি সময়ের অপারেশনের বাইরে কিভাবে সার্কিটগুলোকে শিডিউল করতে হবে তা বোঝায়।
es_un: El planificador puede seguir varias rutinas. De forma predeterminada, sigue una regla *lo más tarde posible* (as late as possible, ALAP). Otro método de planificación es *lo antes posible*, (as soon as possible, ASAP). Para ambos métodos, la planificación de salida es mínima: en la ruta de operación de mayor duración del circuito de entrada, la hora de inicio de cada operación es el tiempo de finalización de la operación en curso. Los métodos determinan cómo planificar operaciones fuera de esa ruta más larga.
fr: L'ordonnanceur peut suivre plusieurs routines. Par défaut, il suit une règle *aussi tard que possible* (ALAP, as late as possible). Une autre méthode d'ordonnance est *dès que possible* (ASAP, as soon as possible). Pour les deux méthodes, le planning de sortie est minimal: dans le chemin d'opération de durée la plus longue du circuit d'entrée, le moment de début de chaque opération correspond au moment de fin de l'opération procédédente. Les méthodes déterminent comment planifier (``schedule``) des opérations en dehors de ce chemin le plus long.
id_id: Scheduler dapat mengikuti beberapa rutin. Secara standar, itu mengikuti aturan * seakhir mungkin * (ALAP) aturan. Metode penjadwalan lain adalah * sesegera mungkin *, (ASAP). Untuk kedua metode, jadwal keluaran minimal: dalam jalur operasi durasi terpanjang dari sirkuit masukan, waktu mulai dari setiap operasi adalah waktu akhir dari operasi pemprosesan. Metode ini menentukan bagaimana jadwal operasi di luar jalur terpanjang.
ja_jp: スケジューラーは複数のルーチンに従うことができます。デフォルトでは、*可能な限り遅く* (ALAP) ルールに従います。 別のスケジューリング方法は *できるだけ早く* (ASAP) です。 両方の方法で、出力スケジュールは最小です: 入力回路の最長期間の動作経路内で、各操作の開始時刻は進行中の操作の終了時刻です。 メソッドは、その最も長いパスの外で操作をスケジュールする方法を決定します。
ko_kr: 스케줄러는 여러 처리 순서를 따를 수 있다. 기본값으로 *가능한 한 늦는 (as late as possible)* (ALAP) 규칙을 따른다. 다른 스케줄링 메서드는 *가능한 한 빠른 (as soon as possible)* (ASAP) 이다. 두 메서드 모두 출력 스케줄이 최소이다: 입력 회로의 가장 긴 지속 시간의 연산 경로에서 각 연산의 시작 시간은 선행하는 연산의 종료 시간이다. 이 메서드들은 가장 긴 경로가 아닌 쪽에서 연산의 스케줄을 결정한다.
pt_un: O agendador pode seguir várias rotinas. Por padrão, segue uma regra *tão tarde quanto possível* (ALAP). Outro método de agendamento é *assim que possível*, (ASAP). Para ambos os métodos, o cronograma de saída é mínimo: no caminho da operação de duração mais longa do circuito de entrada, o horário de início de cada operação é o momento final da operação de processo. Os métodos determinam como agendar operações fora do caminho mais longo.
ta_in: திட்டமிடுபவர் பல நடைமுறைகளைப் பின்பற்றலாம். இயல்பாக, இது *as late as possible* (ALAP) விதியைப் பின்பற்றுகிறது. மற்றொரு திட்டமிடல் முறை *as soon as possible*, (ASAP). இரண்டு முறைகளுக்கும், வெளியீட்டு அட்டவணை மிகக் குறைவு: உள்ளீட்டு சுற்றுகளின் நீண்ட கால செயல்பாட்டு பாதையில், ஒவ்வொரு செயல்பாட்டின் தொடக்க நேரமும் முந்தைய செயல்பாட்டின் இறுதி நேரம். அந்த நீண்ட பாதைக்கு வெளியே செயல்பாடுகளை எவ்வாறு திட்டமிடுவது என்பதை முறைகள் தீர்மானிக்கின்றன.
tr: Zamanlayıcı birden fazla rutini takip edebilir. Varsayılan olarak, *olabildiğince geç* (ALAP) kuralını izler. Diğer bir zamanlama yöntemi ise *en kısa sürede* (ASAP) yöntemidir. Her iki yöntem için de çıkış programı minimumdur: giriş devresinin en uzun süreli çalışma yolunda, her işlemin başlangıç zamanı, devam eden işlemin bitiş zamanıdır. Yöntemler, bu en uzun yolun dışındaki işlemlerin nasıl programlanacağını belirler.

source: This is made clear through an example:
bn_bn: উদাহরণের মাধ্যমে এটা সহজ করা হল:
es_un: Esto queda claro a través de un ejemplo:
fr: Ceci devient clair à travers un exemple:
id_id: Hal ini diperjelas melalui contoh:
ja_jp: これは、以下の例によって明確になります:
ko_kr: 이는 다음 예제를 통해 명확하게 작성된다:
pt_un: Isso é explicado melhor com um exemplo:
ta_in: இது ஒரு எடுத்துக்காட்டு மூலம் தெளிவுபடுத்தப்படுகிறது:
tr: Bu, bir örnekle açıklığa kavuşturulmuştur:

source: For our mocked backend, these :math:`X` gate operations are each the same duration (``duration = 160 dt``). For the schedule to be minimal, the two :math:`X` operations on qubit 0 will be scheduled back-to-back, and the measurement pulse will immediately follow the second of those pulses.
bn_bn: আমাদের পরিবর্তিত ব্যাকেন্ডের জন্য, প্রত্যেক :math:`X` গেটের অপারেশনগুলোর সময় একই (``duration = 160 dt``) । এবার শিডিউলকে সরবনিম্ন বা নুন্যতম হতে হলে কিউবিট 0 এর ওপর দুটি :math:`X` অপারেশন একের পর এক পর্যায়ক্রমে হবে এবং মেজারমেন্ট পালস তাৎক্ষনিকভাবেই ওই পালসগুলর সময় সেকেন্ডে খেয়াল করা শুরু করেব।
es_un: Para nuestro backend emulado, estas operaciones de compuerta :math:`X` tienen la misma duración (``duration = 160 dt``). Para que la planificación sea mínima, las dos operaciones :math:`X` en el qubit 0 se planificarán una tras otra, y el pulso de medición seguirá inmediatamente al segundo de esos pulsos.
fr: Pour notre backend simulé, ces opérations de :math:`X` sont toutes de la même durée (``durée = 160 dt``). Pour que le planning (``schedule``) soit minimal, les deux opérations :math:` X` sur le qubit 0 seront planifiées consécutives (``back-to-back``), et l'impulsion de mesure suivra immédiatement la seconde de ces impulsions.
id_id: Untuk mocked backend kami, ini :math:` X ` gate operasi ini masing-masing memiliki durasi yang sama (` ` durasi = 160 dt ` `). Untuk jadwal yang minimal, dua :math:` X ` operasi pada qubit 0 akan dijadwalkan back-to-back, dan pengukuran pulsa akan segera mengikuti detik dari kedua pulsa tersebut.
ja_jp: モックバックエンドでは、これらの :math:`X` ゲート操作はそれぞれ同じ継続時間(``duration = 160 dt``)です。 スケジュールを最小限にするために、量子ビット 0 の 2 つの :math:`X` 操作が繰り返しスケジュールされます。 測定パルスは2個目のパルスのすぐ後ろに追随します
ko_kr: 모조 백엔드에서는, 이 :math:`X` 게이트 연산들의 지속 시간 (``duration = 160 dt``)이 같다. 스케줄을 최소화하려면 큐비트 0에 가해지는 두 :math:`X` 연산이 잇따라 스케줄되어야 하며, 측정 펄스가 두 펄스들 직후에 바로 따라와야 한다.
pt_un: Para o nosso backend simulado, estas operações de porta :math:`X` são cada uma a mesma duração (``duration = 160 dt``). Para que o agendamento seja mínimo, as duas operações de :math:`X` no qubit 0 serão agendadas back-to-back e o pulso de medição seguirá imediatamente o segundo desses pulsos.
ta_in: எங்கள் கேலி செய்யப்பட்ட பின்தளத்தில், இவை :math:`X` கேட் செயல்பாடுகள் ஒவ்வொன்றும் ஒரே கால அளவு (``duration = 160 dt``). அட்டவணை மிகக் குறைவாக இருக்க, இரண்டு :math:`X` க்யூபிட் 0 இல் `X` செயல்பாடுகள் பின்-பின்-திட்டமிடப்படும், மற்றும் அளவீட்டு துடிப்பு உடனடியாக அந்த பருப்புகளில் இரண்டைப் பின்தொடரும்.
tr: Taklitçi arkayüzümüz için, bu :math:`X` geçit işlemlerinin her biri aynı süreye sahiptir (``duration = 160 dt``). Zamanın minimum olması için, kübit 0'daki iki :math:'X' işlemi arka arkaya planlanacak ve ölçüm atımı bu atımların ikincisini hemen takip edecektir.

source: ALAP will choose the latest valid time to schedule lesser-constrained operations, so the :math:`X` gate on qubit 1 will play in sync with the second :math:`X` gate on qubit 0.
bn_bn: এএলএপি কম সীমাবদ্ধ ক্রিয়াকলাপ (অপারেশন) গুলো একদম সর্বশেষ সময় নির্বাচন করে, যাতে কিউবিট ১ এ :math:`X` যুক্তিবর্তনী (গেইট) এবং কিউবিট ০ এর দ্বিতীয় :math:`X` যুক্তিবর্তনী (গেইট) সময়ের সাথে সুসংহত থাকে।
es_un: ALAP elegirá el último tiempo válido para planificar operaciones con menos restricciones, por lo que la compuerta :math:`X` en el qubit 1 se reproducirá en sincronía con la segunda compuerta :math:`X` en el qubit 0.
fr: ALAP choisira le dernier moment valide pour ordonnancer des opérations moins restreintes, de sorte que la porte :math:`X` sur le qubit 1 exécutera en synchronisation avec la deuxième porte :math:`X` sur le qubit 0.
id_id: ALAP akan memilih waktu terakhir yang valid untuk menjadwalkan operasi yang terbatasi lebih rendah, sehingga :math:` X ` gate pada qubit 1 akan dimulai secara sinkron dengan kedua :math:` X ` gate pada qubit 0.
ja_jp: ALAP はより制限が少ない操作をスケジュールする最新の有効時間を選択するため、量子ビット1の :math:`X` ゲートは、量子ビット0の2番目の :math:`X` ゲートと同期して実行されます
ko_kr: ALAP는 유효한 시간 중 가장 나중을 택하여 제한이 적은 연산을 스케줄할 것이며, 따라서 큐비트 1의 :math:`X` 게이트는 큐비트 0의 두 번째 :math:`X` 게이트와 동시에 발생된다.
pt_un: ALAP irá escolher o último horário válido para agendar operações menos restritas, então a porta :math:`X` no qubit 1 irá executar sincronizadamente com a segunda porta :math:`X` no qubit 0.
ta_in: குறைவான கட்டுப்பாட்டு செயல்பாடுகளை திட்டமிட சமீபத்திய சரியான நேரத்தை ALAP தேர்வு செய்யும், எனவே க்யூபிட் 1 இல் :math:`X` கேட் கூபிட் 0 இல் இரண்டாவது :math:`X` கேட்டுடன் ஒத்திசைவாக செயல்படும்.
tr: ALAP, daha az kısıtlı işlemleri planlamak için en son geçerli zamanı seçecektir, bu nedenle kübit 1'deki :math:`X` kapısı, kübit 0'daki ikinci :math:`X` kapısı ile senkronize olarak gerçekleşecektir.

source: On the other hand, as the name suggests, ASAP will schedule operations as soon as its resources are free. Thus, the :math:`X` gate on qubit 1 will be scheduled at ``time=0``, in sync with the first :math:`X` gate on qubit 0.
bn_bn: অন্যদিকে, নাম অনুযায়ী ASAP এর রিসোর্স ফাকা হওয়ার সাথে সাথে অপারেশন সিডিউল করবে। এইভাবেই তাল মিলিয়ে কিউবিট 0 এর ওপর প্রথমে :math:`X` হয়ে তারপর কিউবিট 1 এর ওপর :math:`X` গেট ``time=0`` সময়ে শিডিউল হবে।
es_un: Por otro lado, como sugiere el nombre, ASAP planificará operaciones tan pronto como sus recursos estén libres. Por lo tanto, la compuerta :math:`X` en el qubit 1 se planificará en ``time=0``, en sincronía con la primera compuerta :math:`X` en el qubit 0.
fr: D'autre part, comme son nom l'indique, ASAP ordonnancera des opérations dès que ses ressources seront libres. Ainsi, la porte :math:`X` sur le qubit 1 sera programmée à ``time=0``, en synchronisation avec la première porte :math:`X` sur le qubit 0.
id_id: Di sisi lain, seperti namanya, ASAP akan menjadwalkan operasi segera setelah sumber dayanya bebas. Dengan demikian, :math:` X ` gate pada qubit 1 akan dijadwalkan pada ` ` time=0 ` `, sinkron dengan :math:` X ` x pertama pada qubit 0.
ja_jp: 一方、名前が示すように、ASAPはリソースが解放されるとすぐに操作をスケジュールします。 したがって、量子ビット1 の :math:`X` ゲートは ``time=0`` にスケジュールされます。 量子ビット0の最初の :math:`X` ゲートと同期しています。
ko_kr: 한편, 이름이 암시하는 바와 같이, ASAP는 자원이 되는 한 가장 빠르게 연산을 스케줄할 것이다. 고로, 큐비트 1의 :math:`X` 게이트는 큐비트 0의 첫 번째 :math:`X` 게이트와 동시인 ``time=0`` 으로 스케줄될 것이다.
pt_un: Por outro lado, como o nome sugere, o ASAP irá agendar as operações assim que seus recursos estiverem livres. Assim, a porta :math:`X` no qubit 1 será agendada para ``time=0``, em sincronia com a primeira porta :math:`X` no bit 0.
ta_in: மறுபுறம், பெயர் குறிப்பிடுவது போல, ASAP அதன் வளங்கள் இலவசமானவுடன் செயல்பாடுகளை திட்டமிடும். எனவே, க்யூபிட் 1 இல் :math:`X` கேட் ``time = 0`` என திட்டமிடப்படும், இது க்யூபிட் 0 இல் முதல் :math:`X` கேட் உடன் ஒத்திருக்கும்.
tr: Öte yandan, adından da anlaşılacağı gibi, ASAP, kaynakları özgür olur olmaz operasyonları planlayacaktır. Böylece, kübit 1'deki :math:`X' geçiti, kübit 0'daki ilk :math:`X` geçitiyle senkronize olarak ``time=0``'da programlanacaktır.
