Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/07_pulse_scheduler.po
Languages: bn_bn, es_un, fr, id_id, ja_jp, ko_kr, pt_un, ta_in, tr

source: ALAP is the default because it allows qubits to remain idle as long as possible. In this case, the difference between ALAP and ASAP may be negligible, but in ALAP, qubit 0 has *no* time to decay from the excited state before measurement.
bn_bn: ALAP হল মৌলিক কারন এটা কিইউবিটগুলোকে যথাসম্ভব স্থায়ী হতে সাহায্য করে। এক্ষেত্রে, ALAP এবং ASAP এর মধ্যে তুলনা উপেক্ষণীয় হতে পারে, কিন্তু কেবলমাত্র ALAP তে কিউবিট 0 এর মেজারমেন্টের আগে উত্তেজিত শক্তিস্তর হতে বিচ্যুত হয়ে আসার কোন সময় থাকেনা।
es_un: ALAP es el predeterminado porque permite que los qubits permanezcan inactivos el mayor tiempo posible. En este caso, la diferencia entre ALAP y ASAP puede ser insignificante, pero en ALAP, el qubit 0 *no* tiene tiempo para decaer desde el estado excitado antes de la medición.
fr: ALAP est la valeur par défaut car elle permet aux qubits de rester inactifs aussi longtemps que possible. Dans ce cas, la différence entre ALAP et ASAP peut être négligeable, mais dans ALAP, le qubit 0 a * pas de temps * de décomposition (``decay``) à partir de l'état excité avant la mesure.
id_id: ALAP adalah standar karena memungkinkan qubits untuk tetap menganggur selama mungkin. Dalam hal ini, perbedaan antara ALAP dan ASAP mungkin dapat diabaikan, tetapi dalam ALAP, qubit 0 memiliki waktu * tidak * waktu untuk meluruh dari keadaan tereksitasi sebelum pengukuran.
ja_jp: ALAP は、量子ビットを可能な限りアイドル状態のままにできるため、デフォルトです。 この例の場合、ALAP と ASAP の違いは無視できますが、ALAP では、 量子ビット0は、測定前に励起状態から崩壊する時間が *ありません* 。
ko_kr: ALAP가 기본값인 이유는 큐비트들이 가능한 한 오랫동한 유휴 상태를 유지할 수 있기 때문이다. 이 경우, ALAP와 ASAP의 차이는 무시할 수 있지만, ALAP에선 큐비트 0은 측정 전에 들뜬 상태에서 붕괴할 수 있는 시간이 *없다.*
pt_un: ALAP é o padrão porque permite que qubits permaneçam inativos tanto tempo quanto possível. Neste caso, a diferença entre ALAP e ASAP pode ser negligenciável, mas no ALAP, o qubit 0 *não* tem tempo para se decair do estado excitado antes da medição.
ta_in: ALAP இயல்புநிலையாகும், ஏனெனில் இது க்யூபிட்களை முடிந்தவரை சும்மா இருக்க அனுமதிக்கிறது. இந்த வழக்கில், ALAP க்கும் ASAP க்கும் இடையிலான வேறுபாடு மிகக் குறைவாக இருக்கலாம், ஆனால் ALAP இல், அளவீட்டுக்கு முன் உற்சாகமான நிலையிலிருந்து சிதைவதற்கு க்யூபிட் 0 க்கு நேரம் *இல்லை*.
tr: ALAP varsayılandır çünkü kübitlerin mümkün olduğu kadar uzun süre boşta kalmasına izin verir. Bu durumda, ALAP ve ASAP arasındaki fark önemsiz olabilir, ancak ALAP'ta kübit 0'ın ölçümden önce uyarılmış durumdan bozulmaya zamanı yoktur.

source: We’ll use the mocked backend, ``FakeAlmaden``, to demonstrate how to use the scheduler. It contains default calibrations for measurement and for its basis gates. The Hadamard operation is not one of those basis gates, so we use the transpiler to compile our input circuit to an equivalent circuit in terms of the basis gates of the device.
id_id: Kita akan menggunakan backend palsu, ` ` FakeAlmaden ` `, untuk menunjukkan bagaimana menggunakan pembuat jadwal. Ini mengandung kalibrasi standar untuk pengukuran dan untuk gerbang dasar. Operasi Hadamard bukan salah satu dari gerbang dasar, jadi kita gunakan transpiler untuk mengkompilasi rangkaian input kita ke rangkaian yang ekivalen dalam hal dasar gerbang dari perangkat.

source: Let’s see how our schedule ``schedule`` built from the circuit ``transpiled_circ`` looks.
bn_bn: তাহলে চলুন এবার দেখে নেয়া যাক ``transpiled_circ`` নামক সার্কিট থেকে তৈরি আমাদের ``schedule`` দেখতে কেমন।
id_id: Mari kita lihat bagaimana jadwal kita ` ` schedule ` ` dibangun dari sirkuit ` ` transpiled_circ ` `.
ja_jp: 回路 ``transpiled_circ`` から構築されたスケジュール ``schedule`` がどのように見えるか見てみましょう。
ko_kr: 회로 ``transpiled_circ`` 에서 만들어진 스케줄 ``schedule`` 이 어떤 모습인지 보라.
ta_in: எங்கள் அட்டவணை ``schedule`` சுற்று ``transpiled_circ`` இலிருந்து எவ்வாறு உருவாக்கப்பட்டுள்ளது என்பதைப் பார்ப்போம்.
tr: Bakalım ``transpiled_circ`` devresinden oluşturulan ``schedule`` programımız nasıl görünüyor.

source: That covers the basics! We used the transpiler to rewrite the circuit in terms of the basis gates, and then used the backend’s default calibrations to schedule the transpiled circuit. Next we will go through scheduling with calibrations we will build ourselves.
bn_bn: এটা কেবল আমাদের ব্যাসিকগুলো উপস্থাপন করে। আমরা ব্যাসিস গেটগুলো অনুযায়ী সার্কিটকে নতুন করে লিখতে ট্রান্সপাইলার ব্যাবহার করেছিলাম, এবং তারপরে ট্রান্সপাইল করা সারকিটগুলকে শিডিউল করতে ব্যাকএন্ডের প্রাথমিক ক্যালিব্রেশন ব্যাবহার করেছিলাম। এখন আমরা নিজে নিজেই ক্যালিব্রেশনগুলো কিভাবে শিডিউল করতে হয় বা কল করতে হয় তা শিখব।
id_id: Itu mencakup dasar-dasar! Kami menggunakan transpiler untuk menulis ulang sirkuit dalam bentuk gerbang basis, dan kemudian menggunakan kalibrasi standar backend untuk menjadwalkan transpiled cicuit. Selanjutnya kita akan melakukannya melalui penjadwalan dengan kalibrasi kita akan membangun diri kita sendiri.
ja_jp: これは基本がカバーされています! 基底ゲートを使って回路を書き換えるためにトランスパイラーを使いました。そして、バックエンドのデフォルト較正を使ってトランスパイラー回路をスケジュールしました。次に、私たち自身が構築する較正でスケジュールしましょう。
ko_kr: 기본을 익혔다! 트랜스파일러를 사용하여 기본 게이트들로 회로를 다시 썼고, 백앤드의 초기값 교정을 사용하여 트랜스파일된 회로를 스케줄로 만들었다. 다음에는 교정을 직접 구성하여 스케줄링을 해 볼 것이다.
ta_in: அது அடிப்படைகளை உள்ளடக்கியது! அடிப்படை வாயில்களின் அடிப்படையில் சுற்றுகளை மீண்டும் எழுத நாங்கள் டிரான்ஸ்பைலரைப் பயன்படுத்தினோம், பின்னர் பின்தளத்தில் இயல்புநிலை அளவீடுகளைப் பயன்படுத்தினோம். அடுத்து நாம் நம்மை உருவாக்குவோம் அளவுத்திருத்தங்களுடன் திட்டமிடுவோம்.
tr: Bu temelleri kapsar! Devreyi temel kapılar açısından yeniden yazmak için aktarıcıyı kullandık ve ardından aktarılan devreyi programlamak için arkayüzeyin varsayılan kalibrasyonlarını kullandık. Daha sonra kendimiz kuracağımız kalibrasyonlarla çizelgeleme yapacağız.

source: We’ll use the mocked backend, ``FakeHanoi``, to demonstrate how to use the scheduler. It contains default calibrations for measurement and for its basis gates. The Hadamard operation is not one of those basis gates, so we use the transpiler to compile our input circuit to an equivalent circuit in terms of the basis gates of the device.
ja_jp: スケジューラーの使い方を示すために、モックのバックエンドの ``FakeHanoi`` を使います。測定用と基本のゲート用のデフォルトの較正が含まれています。 アダマール演算は、それらの基底ゲート操作ではないので、トランスパイラーを使って、入力回路をデバイスの基底ゲートを使った等価回路にコンパイルします。
ko_kr: ``FakeHanoi`` 모조 백엔드를 사용하여 스케줄러를 사용하는 방법을 시연할 것이다. 여기에는 측정 및 기본 게이트에 대한 초기값 교정이 포함되어 있다. Hadamard 연산은 기본 게이트들 중 하나가 아니기 때문에, 트랜스파일러를 사용하여 입력 회로를 장치의 기본 게이트들로 구성된 동등한 회로로 만들 것이다.
ta_in: திட்டமிடலை எவ்வாறு பயன்படுத்துவது என்பதை விளக்குவதற்கு, கேலி செய்யப்பட்ட பின்தளமான ``FakeHanoi`` ஐப் பயன்படுத்துவோம். இது அளவீடு மற்றும் அதன் அடிப்படை வாயில்களுக்கான இயல்புநிலை அளவுத்திருத்தங்களைக் கொண்டுள்ளது. ஹடமார்ட் செயல்பாடு அந்த அடிப்படை வாயில்களில் ஒன்றல்ல, எனவே சாதனத்தின் அடிப்படை வாயில்களின் அடிப்படையில் சமமான சுற்றுக்கு எங்கள் உள்ளீட்டு சுற்றுகளை தொகுக்க டிரான்ஸ்பைலரைப் பயன்படுத்துகிறோம்.
tr: Zamanlayıcının nasıl kullanılacağını göstermek için sahte arka uç ``FakeHanoi`` kullanacağız. Bu ölçüm ve temel kapılar için varsayılan kalibrasyonları içerir. Hadamard işlemi bu temel kapılardan biri değildir, bu nedenle giriş devremizi cihazın temel kapıları açısından bir eşdeğer devreye derlemek için diller arası derleyiciyi kullanırız.
