Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/08_gathering_system_information.po
Languages: bn_bn, es_un, fr, id_id, ja, ko_kr, pt_un, ta_in, tr

source: Likewise, each qubit will have a ``Schedule`` defined for each basis gate, and they can be appended directly to any ``Schedule`` you build.
bn_bn: একইভাবে, প্রতিটি কিউবিটের একটি ``Schedule`` সংজ্ঞায়িত করা থাকবে প্রতিটি বেসিস বা ভিত্তি যুক্তিবর্তনীর(গেইট) জন্য এবং তারা যে কোনও``Schedule``এর গঠনেতে যোগদান করতে পারে।
es_un: De la misma manera, cada qubit tendrá un ``Schedule`` definido para cada compuerta base, y pueden ser anexados directamente a cualquier ``Schedule`` que construyas.
fr: De même, chaque qubit aura un ``Schedule`` défini pour chaque porte de base, et ils peuvent être ajoutés directement à n'importe quel ``Schedule`` que vous construisez.
id_id: Demikian juga, setiap qubit akan memiliki ``Schedule`` yang didefinisikan untuk setiap gerbang basis, dan mereka dapat ditambahkan langsung pada setiap ``Schedule`` yang Anda buat.
ja: 同様に、各量子ビットは基底ゲートごとに定義された ``Schedule`` を持ち、作成した ``Schedule`` に直接追加することができます。
ko_kr: 마찬가지로 각 큐비트는 각각의 기본 게이트에 대해 정의된 스케줄 ``Schedule`` 을 갖게 되며, 사용자가 빌드하는 모든 스케줄 ``Schedule`` 에 직접 첨부할 수 있다.
pt_un: Da mesma forma, cada qubit terá uma ``Schedule`` definida para cada porta base e elas podem ser anexadas diretamente a qualquer ``Schedule`` que você construir.
ta_in: அதேபோல், ஒவ்வொரு க்யூபிட்டிலும் ஒவ்வொரு அடிப்படை கேட்டுக்கும் ஒரு ``Schedule`` வரையறுக்கப்பட்டிருக்கும், மேலும் அவை நீங்கள் உருவாக்கும் எந்தவொரு ``Schedule``க்கும் நேரடியாக சேர்க்கப்படலாம்.
tr: Benzer şekilde, her kübit, her bir temel geçit için tanımlanmış bir ``Schedule``a sahip olacaktır ve bunlar, oluşturduğunuz herhangi bir ``Schedule``a doğrudan eklenebilir.

source: While building your schedule, you can also use ``calibrations.add(name, qubits, schedule)`` to store useful ``Schedule``\ s that you’ve made yourself.
bn_bn: আপনার নির্ধারিত সময়সূচী গঠনের সময়, আপনি অবশ্যই ``calibrations.add(name, qubits, schedule)``ব্যবহার করতে পারেন ``Schedule``\দের রাখতে যা আপনি তৈরী করেছেন।
fr: Lors de la construction de votre ordonnancement, vous pouvez également utiliser ``calibrations.add (name, qubits, schedule)`` pour stocker les ``Schedule``\ s utiles que vous avez effectués vous-même.
id_id: Saat membangun jadwal Anda, Anda juga dapat menggunakan ``calibrations.add(name, qubits, schedule)`` untuk menyimpan ``Schedule``\ s berguna yang Anda buat sendiri.
ko_kr: 스케줄을 작성하는 동안에는 사용자가 직접 작성한 유용한 스케줄 ``Schedule``\s 을 저장하기 위해 ``calibrations.add(name, qubits, schedule)`` 을 사용할 수 있다.
pt_un: Ao criar sua schedule, você também pode usar ``calibrations.add(name, qubits, schedule)`` para armazenar ``Schedule``\ s úteis que você mesmo preparou.
ta_in: உங்கள் அட்டவணையை உருவாக்கும்போது, ​​நீங்களே உருவாக்கிய பயனுள்ள ``Schedule``\ s சேமிக்க ``calibrations.add(name, qubits, schedule) `` ஐப் பயன்படுத்தலாம்.
tr: Zamanlamanızı oluştururken, kendi oluşturduğunuz faydalı ``Schedule``\ ları saklamak için ``calibrations.add(name, qubits, schedule)``ı da kullanabilirsiniz.

source: On this `page <07_pulse_scheduler.ipynb>`__, we’ll show how to schedule ``QuantumCircuit``\ s into Pulse ``Schedule``\ s.
bn_bn: `page <07_pulse_scheduler.ipynb>`__এতে, আমরা দেখাবো যে কিভাবে সময়সূচী করতে হয় ``QuantumCircuit``\গুলি ``Schedule``\তড়িৎস্পন্দন বা পালস গুলিতে।
fr: Sur cette `page <07_pulse_scheduler.ipynb>`__, nous allons montrer comment construire et ordonnancer les ``QuantumCircuit``\ s dans Pulse ``Schedule``\ s.
ko_kr: 이 `페이지 <07_pulse_scheduler.ipynb>`__ 에서 우리는 ``Quantum Circuit``\s 를 펄스 ``Schedule`` 로 어떻게 예약하는지 보여줄 것이다.
pt_un: Na `página <07_pulse_scheduler.ipynb>`__, mostraremos como agendar ``QuantumCircuit``\ s em Pulse ``Schedule``\ s.
ta_in: இந்த `பக்கம் <07_pulse_scheduler.ipynb>` __ இல், ``QuantumCircuit``\ s into Pulse ``Schedule``\ s இல் எவ்வாறு திட்டமிடுவது என்பதைக் காண்பிப்போம்.
tr: Bu sayfada `page <07_pulse_scheduler.ipynb>`__, ``QuantumCircuit``\ s 'in atım "Schedule" \ 'ına nasıl zamanlanacağını göstereceğiz.

source: Programming a quantum computer at the microwave pulse level requires more information about the device than is required at the circuit level. A quantum circuit is built for an abstract quantum computer -- it will yield the same quantum state on any quantum computer (except for varying performance levels). A pulse schedule, on the other hand, is so specific to the device, that running one program on two different backends is not expected to have the same result, even on perfectly noiseless systems.
es_un: La programación de una computadora cuántica a nivel de pulso de microondas requiere más información sobre el dispositivo de la que se requiere a nivel de circuito. Un circuito cuántico se construye para una computadora cuántica abstracta; producirá el mismo estado cuántico en cualquier computadora cuántica (excepto para diferentes niveles de rendimiento). Un planificador de pulsos, por otro lado, es tan específico para el dispositivo, que no se espera que ejecutar un programa en dos backends diferentes tenga el mismo resultado, incluso en sistemas perfectamente sin ruido.
ja: マイクロ波パルスレベルで量子コンピューターをプログラミングするには、回路レベルでプログラミングするよりもデバイスに関する詳細な情報が必要です。 量子回路は、抽象的な量子コンピューターのために構築されます– つまり、量子回路は、あらゆる量子コンピューター上で同じ状態を生成します (性能レベルが異なる場合を除いて)。 一方、パルススケジュールはデバイスに固有のものです。 2つの異なるバックエンドで1つのプログラムを実行して同じ結果を得ることは期待されていません。完全にノイズのないシステムだとしてもです。

source: As a basic example, imagine a drive pulse ``q0_X180`` calibrated on qubit 0 to enact an :math:`X180` pulse, which flips the state of qubit 0. If we use the samples from that pulse on qubit 1 on the same device, or qubit 0 on another device, we do not know what the resulting state will be -- but we can be pretty sure it won't be an :math:`X180` operation. The qubits are each unique, with various drive coupling strengths. If we have specified a frequency for the drive pulse, it's very probable that pulse would have little effect on another qubit, which has its own resonant frequency.
es_un: Como ejemplo básico, imagina un pulso de dirección (drive) ``q0_X180`` calibrado en el qubit 0 para promulgar un pulso :math:`X180`, que invierte el estado del qubit 0. Si usamos las muestras de ese pulso en el qubit 1 en el mismo dispositivo, o el qubit 0 en otro dispositivo, no sabemos cuál será el estado resultante; pero podemos estar bastante seguros de que no será una operación :math:`X180`. Cada uno de los qubits es único, con varias fuerzas de acoplamiento de dirección (drive). Si hemos especificado una frecuencia para el pulso de dirección, es muy probable que el pulso tenga poco efecto en otro qubit, que tiene su propia frecuencia de resonancia.
ja: 基本的な例として、ドライブ・パルスの ``q0_X180`` を量子ビット0で較正し、量子ビット0の状態を反転させる :math:`X180` パルスを実行することを想像してください。同じデバイス上の量子ビット1、または別のでデバイス上の量子ビット0のパルスのサンプルを使用すると、結果の状態は分かりませんが、 :math:`X180` 演算子にはならないことが確信できます。各量子ビットはそれぞれ固有であり、さまざまなドライブカップリング強度があります。ドライブ・パルスの周波数を指定した場合、そのパルスは独自の共振周波数を持つ他の量子ビットにほとんど影響しない可能性があります。

source: The first thing you'll need to do is grab a backend to inspect. Here we use a mocked backend that contains a snapshot of data from the real OpenPulse-enabled backend.
es_un: Lo primero que debes hacer es tomar un backend a inspeccionar. Aquí usamos un backend emulado que contiene una fotografía de los datos del backend real habilitado para OpenPulse.
ja: 最初にする必要があるのは、バックエンドを調べることです。 ここでは、実際のOpenPulse対応バックエンドからのデータのスナップショットを含むモックのバックエンドを使用します。

source: The configuration is where you'll find data about the static setup of the device, such as its name, version, the number of qubits, and the types of features it supports.
es_un: La configuración es donde encontrarás datos sobre la configuración estática del dispositivo, como su nombre, versión, la cantidad de qubits y los tipos de características que admite.
ja: 構成では、デバイスの静的設定に関するデータを確認できます。 名前、バージョン、量子ビットの数、サポートされている機能の種類など。

source: Let's build a description of our backend using information from the ``backend``'s config.
es_un: Construyamos una descripción de nuestro backend usando información de la configuración del ``backend``.
ja: ``backend`` の構成からの情報を使ってバックエンドの説明を作りましょう。

source: Neat! All of the above configuration is available for any backend, whether enabled with OpenPulse or not, although it is not an exhaustive list. There are additional attributes available on Pulse backends. Let's go into a bit more detail with those.
es_un: ¡Genial! Toda la configuración anterior está disponible para cualquier backend, ya sea habilitado con OpenPulse o no, aunque no es una lista exhaustiva. Hay atributos adicionales disponibles en los backends de Pulse. Vamos a entrar en un poco más de detalle con ellos.
ja: 素晴らしいです。 OpenPulseが有効であるかどうかに関わらず、上記のすべての構成は任意のバックエンドで利用できますが、包括的なリストではありません。 Pulseバックエンドには追加の属性があります。もう少し詳しく見てみましょう。

source: The **timescale**, ``dt``, is backend dependent. Think of this as the inverse sampling rate of the control rack's arbitrary waveform generators. Each sample point and duration in a Pulse ``Schedule`` is given in units of this timescale.
es_un: La **escala de tiempo**, ``dt``, depende del backend. Piensa en esto como la frecuencia de muestreo inversa de los generadores de formas de onda arbitrarias de la plataforma de control. Cada punto de muestra y duración en un ``Schedule`` de pulso se da en unidades de esta escala de tiempo.
ja: **時間単位**、 ``dt`` はバックエンドに依存しています。これは、制御ラックの任意の波形ジェネレータの逆サンプリングレートだと考えてください。 Pulse の ``Schedule`` の各サンプルポイントと期間は、この時間単位で与えられます。

source: The configuration also provides information that is useful for building measurements. Pulse supports three measurement levels: ``0: RAW``, ``1: KERNELED``, and ``2: DISCRIMINATED``. The ``meas_levels`` attribute tells us which of those are supported by this backend. To learn how to execute programs with these different levels, see this page -- COMING SOON.
es_un: La configuración también proporciona información útil para la construcción de mediciones. Pulse admite tres niveles de medición: ``0: RAW``, ``1: KERNELED``, y ``2: DISCRIMINATED``. El atributo ``meas_levels`` nos dice cuáles de ellos son compatibles con este backend. Para aprender a ejecutar programas con estos diferentes niveles, vea esta página -- PRÓXIMAMENTE.
ja: 構成は、測定の構築に有用な情報も提供します。Pulseは3つの測定レベルに対応しています: ``0: RAW`` 、 ``1: KERNELED`` および ``2: DISCRIMINATED`` です。 ``meas_levels`` 属性は、このバックエンドでサポートされているものを示します。 これらの異なるレベルでプログラムを実行する方法については、こちらのページを参照してください – 近日公開予定です。

source: For backends which support measurement level 0, the sampling rate of the control rack's analog-to-digital converters (ADCs) also becomes relevant. The configuration also has this info, where ``dtm`` is the time per sample returned:
es_un: Para los backends que admiten el nivel de medición 0, la frecuencia de muestreo de los convertidores analógico-digital (ADC) de la plataforma de control también se vuelve relevante. La configuración también tiene esta información, donde ``dtm`` es el tiempo por muestra regresado:
ja: 測定レベル0をサポートするバックエンドでは、制御ラックのアナログ-デジタルコンバータ (analog-to-digital converters、ADC) のサンプリングレートも関連性があります。 構成にはこの情報も含まれており、``dtm`` はサンプルごとに返される時間です。

source: The ``backend`` properties contain data that was measured and optionally reported by the provider. Let's see what kind of information is reported for qubit 0.
es_un: Las propiedades del ``backend`` contienen datos que fueron medidos y, opcionalmente, informados por el proveedor. Veamos qué tipo de información se reporta para el qubit 0.
ja: ``backend`` プロパティーには、プロバイダーによって測定され、オプションで報告されたデータが含まれています。量子ビット0でどのような情報が報告されているか見てみましょう。

source: Finally, one of the most important aspects of the ``backend`` for ``Schedule`` building is the ``InstructionScheduleMap``. This is a basic mapping from a circuit operation's name and qubit to the default pulse-level implementation of that instruction.
es_un: Finalmente, uno de los aspectos más importantes del ``backend`` para la construcción de un ``Schedule`` es ``InstructionScheduleMap``. Este es un mapeo básico del nombre de la operación de un circuito y el qubit a la implementación predeterminada a nivel de pulso de esa instrucción.
ja: 最後は、``Schedule`` をビルドするための ``backend`` の最も重要な側面の 1 つである ``InstructionScheduleMap`` です。 これは回路動作名と量子ビットから、その命令のデフォルトのパルスレベル実装までの基本のマッピングです。

source: Rather than build a measurement schedule from scratch, let's see what was calibrated by the backend to measure the qubits on this device:
es_un: En lugar de crear un planificador de medición desde cero, veamos qué calibró el backend para medir los qubits en este dispositivo:
ja: 測定スケジュールを最初から作成するのではなく、バックエンドがこのデバイス上の量子ビットを測定するために何を較正したかを確認します。

source: While building your schedule, you can also use ``calibrations.add(name, qubits, schedule)`` to store useful ``Schedule``\ s that you've made yourself.
es_un: Mientras construyes tu planificador, también puedes utilizar ``calibrations.add(name, qubits, schedule)`` para almacenar ``Schedule``\ s útiles que tú mismo has hecho.
ja: スケジュールを作成する際には、 ``calibrations.add(name, qubits, schedule)`` を使って、自分で作成した便利な ``Schedule`` を保存することもできます。

source: On this `page <07_pulse_scheduler.ipynb>`__, we'll show how to schedule ``QuantumCircuit``\ s into Pulse ``Schedule``\ s.
es_un: En esta `página <07_pulse_scheduler.ipynb>`__, mostraremos cómo planificar ``QuantumCircuit``\ s en ``Schedule``\ s de Pulse.
ja: この `ページ <07_pulse_scheduler.ipynb>`__ では、Pulse ``Schedule`` に ``QuantumCircuit`` をどのようにスケジュールするかを紹介します。
