Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/08_gathering_system_information.po
Languages: bn_bn, es_un, fr, id_id, ja, ko_kr, pt_un, ta_in, tr

source: Neat! All of the above configuration is available for any backend, whether enabled with OpenPulse or not, although it is not an exhaustive list. There are additional attributes available on Pulse backends. Let’s go into a bit more detail with those.
bn_bn: দারুণ! উপরের সমস্ত যান্ত্রিক বিন্যাস (কনফিগারেশন) যেকোনো ব্যাকএন্ডের জন্য উপলব্ধ, OpenPulse চালু থাক বা না থাক কিনা, যদিও এটি একটি সম্পূর্ণ তালিকা নয়। তড়িৎস্পন্দন বা পালস ব্যাকএন্ডের অতিরিক্ত বৈশিষ্ট্যসমূহ আছে।আসুন তাদের বিষয়ে একটু বেশি বিস্তারিতভাবে জানি।
fr: Super! Toutes les configurations ci-dessus sont disponibles pour n'importe quel backend, qu'ils supportent OpenPulse ou pas, bien qu'il ne s'agisse pas d'une liste exhaustive. Il y a des attributs supplémentaires disponibles sur les backends qui supportant Pulse. Allons un peu plus dans le détail avec ceux-ci.
id_id: Bagus! Semua konfigurasi di atas terdapat pada backend mana pun, apakah diaktifkan OpenPulse atau tidak, meskipun itu bukan daftar yang lengkap. Terdapat atribut tambahan yang pada backend Pulse. Mari kita tinjau lebih detail lagi.
ko_kr: 모든 구성은 전체 목록이 아니더라도 OpenPulse를 사용할 수 있는지 여부에 관계없이 백엔드에 사용할 수 있다. 펄스 백엔드에서 사용 가능한 추가 속성이 있습니다. 그것들로 좀 더 자세히 살펴보자.
pt_un: Legal! Toda a configuração acima está disponível para qualquer backend, seja habilitado com OpenPulse ou não, embora não seja uma lista exaustiva. Existem atributos adicionais disponíveis no backend do Pulse. Vamos entrar um pouco mais em detalhes destes.
ta_in: மேலேயுள்ள உள்ளமைவுகள் எந்தவொரு பின்தளத்திலுமஂ கிடைக்கின்றன, இது ஓப்பன் பல்ஸுடன் இயக்கப்பட்டிருந்தாலும் இல்லாவிட்டாலும், அது ஒரு முழுமையான பட்டியல் அல்ல. பல்ஸ் பின்தளத்தில் கூடுதல் பண்புக்கூறுகள் உள்ளன. அவற்றை மேலுமஂ விரிவாகப் பார்ப்போம்.
tr: Temiz! Yukarıdaki yapılandırmanın tümü, kapsamlı bir liste olmamasına rağmen, OpenPulse ile etkinleştirilip etkinleştirilmediğine bakılmaksızın herhangi bir arka uç için kullanılabilir. Atım arka uçlarında ek özellikler mevcuttur. Bunlarla ilgili biraz daha detaya inelim.

source: The **timescale**, ``dt``, is backend dependent. Think of this as the inverse sampling rate of the control rack’s arbitrary waveform generators. Each sample point and duration in a Pulse ``Schedule`` is given in units of this timescale.
bn_bn: **সময়মাপনী** টি ``dt``, হল ব্যাকএন্ড শর্ত। এটিকে মনে করুন কন্ট্রোল রাকের(rack’s) নির্বিচারে তরঙ্গাকৃতি জেনারেটর গুলির বিপরীত নমুনা হার। একটি তড়িৎস্পন্দন বা পালস ``Schedule`` এতে প্রতিটি নমুনা বিন্দু এবং সময়কাল সময়মাপনীর একক গুলিতে দেওয়া হয়।
fr: Le **timescale**, ``dt``, dépend du backend. Pensez à cela comme le taux d'échantillonnage inverse des générateurs d'ondes arbitraires. Chaque point d'échantillon et la durée d'une Pulse ``Schedule`` est donné en unités de cette échelle de temps.
id_id: **timescale**, ``dt``, tergantung backend. Pikir ini sebagai laju sampel invers dari tingkat kontrol acak generator bentuk gelombang. Setiap titik sampel dan durasi dalam Pulse ``Schedule`` diberikan dalam unit skala waktu ini.
ko_kr: **기간 (timescale)**, ``dt`` 는 백엔드 의존적이다. 이를 제어 랙의 임의의 파형 생성기의 역샘플링 비율로 생각하하자. 펄스의 "스케줄" 에 있는 각각의 샘플 포인트 및 지속기간은 이러한 시간스케일의 단위로 제공된다.
pt_un: O **intervalo de tempo**, ``dt``, é dependente do backend. Pense nisso como a inversa da taxa de amostragem dos geradores de formas de onda arbitrárias do rack de controle. Cada ponto de amostragem e duração em um Pulse ``Schedule`` é fornecido em unidades desta periodicidade.
ta_in: ** timescale **, `` dt``, பின்தளத்தில் சார்ந்துள்ளது. கட்டுப்பாட்டு ரேக்கின் தன்னிச்சையான அலைவடிவ ஜெனரேட்டர்களின் தலைகீழ் மாதிரி வீதமாக இதை நினைத்துப் பாருங்கள். ஒரு துடிப்பு `` அட்டவணையில்` ஒவ்வொரு மாதிரி புள்ளி மற்றும் கால அளவு இந்த கால அளவின் அலகுகளில் கொடுக்கப்பட்டுள்ளது.
tr: **zaman ölçeği**, ``dt``, arka uca bağlıdır. Bunu, kontrol rafının keyfi dalga biçimi oluşturucularının ters örnekleme hızı olarak düşünün. Bir Atım ``Schedule``ndaki her numune noktası ve süresi, bu zaman ölçeğinin birimlerinde verilir.

source: The configuration also provides information that is useful for building measurements. Pulse supports three measurement levels: ``0: RAW``, ``1: KERNELED``, and ``2: DISCRIMINATED``. The ``meas_levels`` attribute tells us which of those are supported by this backend. To learn how to execute programs with these different levels, see this page – COMING SOON.
bn_bn: যান্ত্রিক বিন্যাস (কনফিগারেশন) অবশ্যই এমন তথ্য প্রদান করে যা পরিমাপ গঠনের জন্য উপযোগী।তড়িৎস্পন্দন বা পালস তিনটি পরিমাপ স্তরগুলিকেঃ ``0: RAW``, ``1: KERNELED`` এবং``2: DISCRIMINATED``সাহায্য করে।``meas_levels``বৈশিষ্ট্যটি(অ্যাট্রিবিউট) আমাদেরকে বলে কোন বৈশিষ্ট্যগুলিকে এই ব্যাকএন্ড দ্বারা সাহায্য করা হয়। বিভিন্ন স্তরে কিভাবে প্রোগ্রামগুলোকে চালোনা করতে হবে তা শিখতে, এই পৃষ্ঠাটি দেখুন–শীঘ্র আসছে।
fr: La configuration fournit également des informations utiles pour construire des mesures. Pulse supporte trois niveaux de mesure : ``0: RAW``, ``1: KERNELED``, et ``2: DISCRIMINATED``. L'attribut ``meas_levels`` nous indique lequel de ces niveaux est supporté par ce backend. Pour savoir comment exécuter des programmes avec ces différents niveaux, consultez cette page -- BIENTOT DISPONIBLE.
id_id: Konfigurasi juga memberikan informasi yang berguna untuk membangun pengukuran. Pulse mendukung tiga tingkat pengukuran: ``0: RAW``, ``1: KERNELED``, dan ``2: DISCRIMINATED``. Atribut ``meas_levels`` memberitahu kita mana dari ketiga itu yang didukung oleh backend ini. Untuk mempelajari bagaimana menjalankan program dengan tingkat-tingkat yang berbeda ini, lihat halaman ini – COMING SOON.
ko_kr: 또한 구성은 측정을 빌드하는 데 유용한 정보를 제공한다. 펄스는 세가지 측정 수준을 지원한다: ``0: RAW``, ``1: KERNELED``, 및 ``2: DISCRIMINATED``. ``meas_levels`` 속성은 이들 중 어느 것이 이 백엔드에 의해 지원되는지를 말해준다. 이러한 다른 레벨로 프로그램을 실행하는 방법을 학습하려면 이 페이지를 참조하라. - COMING SOON
pt_un: A configuração também fornece informações que são úteis para a construção de medições. Pulse suporta três níveis de medição: ``0: RAW``, ``1: KERNELED``, e ``2: DISCRIMINATED``. O atributo ``meas_levels`` nos diz quais destes são suportados por este backend. Para saber como executar programas com esses níveis diferentes, consulte esta página – EM BREVE.
ta_in: கட்டமைப்பு அளவீடுகளுக்கு பயனுள்ள தகவல்களையும் உள்ளமைவு வழங்குகிறது. பல்ஸ் மூன்று அளவீட்டு நிலைகளை ஆதரிக்கிறது: `` 0: RAW``, `` 1: KERNELED``, மற்றும் `` 2: DISCRIMINATED``. இநஂத பின்தளத்தில் எவையெலஂலாமஂ ஆதரிக்கப்படுகின்றன என்பதை ``meas_levels`` பண்புக்கூறு நமக்குக் கூறுகிறது. இந்த வெவ்வேறு நிலைகளைக் கொண்ட நிரல்களை எவ்வாறு செயல்படுத்துவது என்பதை அறிய, இந்த பக்கத்தைப் பார்க்கவும் - விரைவில்.
tr: Konfigürasyon ayrıca, bina ölçümleri için faydalı bilgiler sağlar. Atım, üç ölçüm seviyesini destekler: ``0: RAW``, ``1: KERNELED`` ve ``2: DISCRIMINATED``. ``meas_levels`` özelliği bize bu arkayüzey tarafından hangilerinin desteklendiğini söyler. Bu farklı düzeylerde programların nasıl yürütüleceğini öğrenmek için bu sayfaya bakın – YAKINDA.

source: For backends which support measurement level 0, the sampling rate of the control rack’s analog-to-digital converters (ADCs) also becomes relevant. The configuration also has this info, where ``dtm`` is the time per sample returned:
bn_bn: ০স্তরে ব্যাকএন্ডের জন্য কোন পরিমাপটি সাহায্যকারী, নিয়ন্ত্রণ রাকের (rack’s) এনালগ-টু-ডিজিটাল পরিবর্তক (কনভার্টার) (ADCs) এর নমুনা হারটি প্রাসঙ্গিক হয়ে যায়।যান্ত্রিক বিন্যাসেরও (কনফিগারেশন) এই তথ্য রয়েছে, যেখানে ``dtm`` হল প্রতি সময় ফেরত পাওয়া নমুনাঃ
fr: Pour les backends qui supportent le niveau de mesure 0, le taux d'échantillonnage des convertisseurs analogiques/numériques (analog-to-digital converters ou ADC) du rack d'électronique de contrôle devient également pertinent. La configuration a également cette info, où ``dtm`` est le temps retournée par échantillon:
id_id: Untuk backend yang mendukung pengukuran tingkat 0, laju penyampelan dari konverter analog ke digital (ADC) rak kontrol menjadi relevan. Konfigurasi juga mempunyai informasi ini, di mana ``dtm`` adalah waktu per sampel yang dikembalikan:
ko_kr: 측정 수준 0을 지원하는 백엔드의 경우, 제어 랙의 아날로그-디지털 변환기 (ADC) 의 샘플링 레이트도 관련된다. 이 구성에는 다음 정보가 있으며 여기서 ``dtm`` 은 샘플당 리턴된 시간이다.
pt_un: Para os backends com suporte a medições de nível 0, a taxa de amostragem da plataforma de controle dos conversores analógico-digitais (ADCs) também se torna relevante. A configuração também possui essa informação, onde ``dtm`` é o tempo por amostra retornada:
ta_in: அளவீட்டு நிலை 0 ஐ ஆதரிக்கும் பின்தளத்தில், கட்டுப்பாட்டு ரேக்கின் அனலாக்-டு-டிஜிட்டல் மாற்றிகள் (ADC கள்) மாதிரி விகிதமும் பொருத்தமானதாகிறது. இந்த உள்ளமைவிலும் மேலுமுளஂள தகவலானது,`` dtm`` என்பது ஒரு மாதிரிக்கு திரும்பிய நேரதஂதை குறிபஂபிடுகிறது:
tr: 0 ölçüm seviyesini destekleyen arkayüzeyler için, kontrol rafının analogdan dijitale dönüştürücülerinin (ADC'ler) örnekleme hızı da önemli hale gelir. Konfigürasyon ayrıca şu bilgiyi içerir; burada ``dtm``, numune başına döndürülen zamandır:

source: The measurement map, explained in detail on [this page COMING SOON], is also found here.
bn_bn: পরিমাপ ম্যাপিং, [শীঘ্র আসছে এই পৃষ্ঠায়ে] বিস্তারিতভাবে বর্ণিত হয়েছে, যা অবশ্য এখানে পাওয়া যাবে।
es_un: El mapa de medición, explicado en detalle en [esta página PRÓXIMAMENTE], también se encuentra aquí.
fr: La carte de mesure, expliquée en détail sur [cette page BIENTOT DISPONIBLE], se trouve également ici.
id_id: Peta pengukuran, yang dijelaskan secara rinci pada [halaman ini COMING SOON], juga ditemukan di sini.
ja: このページ（準備中）で詳しく説明されている測定マップはここでも見られます。
ko_kr: [이 페이지 COMING SOON] 에 자세히 설명되어 있는 측정 맵도 여기에서 찾을 수 있다.
pt_un: O mapa de medição, explicado em detalhes na [esta página EM BREVE], também é encontrado aqui.
ta_in: [இந்த பக்கம் விரைவில் வருகிறது] இல் விரிவாக விளக்கப்பட்டுள்ள அளவீடுமஂ ஒப்பிடப்படுவதை இங்கே காணலாமஂ.
tr: [Bu sayfada ÇOK YAKINDA] ayrıntılı olarak açıklanan ölçüm haritası da burada bulunur.

source: The configuration also supplies convenient methods for getting channels for your schedule programs. For instance:
bn_bn: যান্ত্রিক বিন্যাস (কনফিগারেশন) যাতে আপনার প্রোগ্রামগুলোর সময়সূচীর জন্য চ্যানেলগুলি পাওয়ার জন্য সুবিধাপূর্ণ পদ্ধতিদের ও যোগান দেয়। উদাহরণস্বরূপঃ
es_un: La configuración también proporciona métodos convenientes para obtener canales para tus programas de planificación. Por ejemplo:
fr: La configuration fournit également des méthodes pratiques pour obtenir des canaux pour vos programmes d'horaire (´´schedule´´). Par exemple:
id_id: Konfigurasi ini juga memberikan metode yang mudah untuk mendapatkan saluran untuk program jadwal Anda. Sebagai contoh:
ja: 構成では、スケジュールプログラムのチャンネルを取得するための便利なメソッドも提供します。例えば:
ko_kr: 또한 구성은 스케줄 프로그램의 채널을 가져오는 편리한 방법을 제공한다. 예를 들면,
pt_un: A configuração também fornece métodos convenientes para obter canais para seus programas schedule. Por exemplo:
ta_in: உங்கள் அட்டவணை நிரல்களுக்கான சேனல்களைப் பெறுவதற்கான வசதியான முறைகளையும் உள்ளமைவு வழங்குகிறது. உதாரணமாக:
tr: Yapılandırma ayrıca zamanlama programlarınız için kanalları almak için uygun yöntemler sağlar. Örneğin:

source: It is a matter of style and personal preference whether you use ``config.drive(0)`` or ``DriveChannel(0)``.
bn_bn: ``config.drive(0)``অথবা``DriveChannel(0)``কোনটি ব্যবহার করবেন সেটি আপনি শৈলী এবং ব্যক্তিগত পছন্দের একটি বিষয় যা আপনি ব্যবহার করেন।
es_un: Es una cuestión de estilo y preferencia personal si utilizas ``config.drive(0)`` o ``DriveChannel(0)``.
fr: C'est une question de style et de préférence personnelle que vous utilisiez ``config.drive(0)`` ou ``DriveChannel(0)``.
id_id: Ini adalah masalah gaya dan preferensi pribadi apakah Anda menggunakan ``config.drive(0)`` atau ``DriveChannel(0)``.
ja: ``config.drive(0)`` または ``DriveChannel(0)`` を使用するかどうかはスタイルと個人の好みの問題です。
ko_kr: ``config.drive(0)`` 나 ``DriveChannel(0)`` 을 사용하는 것은 스타일과 개인 취향의 문제다.
pt_un: É uma questão de estilo e preferência pessoal se você usa ``config.drive(0)`` ou ``DriveChannel(0)``.
ta_in: நீங்கள் `` config.drive (0) `` அல்லது `` DriveChannel(0) `` ஐப் பயன்படுத்துகிறீர்களா என்பது பாணி மற்றும் தனிப்பட்ட விருப்பம்.
tr: ``config.drive(0)`` veya ``DriveChannel(0)`` kullanıp kullanmadığınız, stil ve kişisel tercih meselesidir.

source: Properties
bn_bn: বৈশিষ্ট্য
es_un: Propiedades
fr: Propriétés
id_id: Properti
ja: プロパティー
ko_kr: 특성
pt_un: Propriedades
ta_in: பண்புகள்
tr: Özellikler

source: The ``backend`` properties contain data that was measured and optionally reported by the provider. Let’s see what kind of information is reported for qubit 0.
bn_bn: ``backend``এর বৈশিষ্ট্যগুলি পরিমাপিত এবং প্রোভাইডারকতৃক বিকল্পভাবে জানানো তথ্য ( ডেটা) দ্বারা সমৃদ্ধ। কিউবিট ০ এর জন্য কেমন তথ্য জানা গেছে দেখা যাক।
fr: Les propriétés ``backend`` contiennent des données qui ont été mesurées et éventuellement rapportées par le fournisseur. Voyons quel type d'information est rapporté pour le qubit 0.
id_id: Properti ``backend`` memuat data yang diukur dan secara opsional dilaporkan oleh penyedia. Mari kita melihat informasi apa yang dilaporkan untuk qubit 0.
ko_kr: 백엔드 ``backend`` 특성에는 제공자가 측정하고 선택적으로 보고한 데이터가 포함되어 있다. 0에 대해 어떤 종류의 정보가 보고되었는지 살펴보자.
pt_un: As propriedades ``backend`` contêm dados que foram medidos e opcionalmente relatados pelo provedor. Vamos ver que tipo de informação é reportada para o qubit 0.
ta_in: ``backend`` பண்புகள் அளவிடப்பட்ட மற்றும் வழங்குநரால் விருப்பமாக அறிவிக்கப்பட்ட தரவைக் கொண்டுள்ளன. க்யூபிட் 0 க்கு என்ன வகையான தகவல் தெரிவிக்கப்படுகிறது என்பதைப் பார்ப்போம்.
tr: ``backend`` özellikleri, sağlayıcı tarafından ölçülen ve isteğe bağlı olarak raporlanan verileri içerir. Şimdi kübit 0 için ne tür bilgiler rapor edildiğini görelim.

source: Properties are not guaranteed to be reported, but backends without Pulse access typically also provide this data.
bn_bn: বৈশিষ্ট্যগুলি জানানো হবে কিনা তা নিশ্চিত নয়, কিন্তু ব্যাকএন্ডগুলো তড়িৎস্পন্দন বা পালসের প্রবেশাধিকার ছাড়া সাধারণত এই তথ্য প্রদান করে।
es_un: No se garantiza que se notifiquen las propiedades, pero los backends sin acceso a Pulse normalmente también proporcionan estos datos.
fr: Les propriétés ne sont pas garanties d'être signalées, mais les backends sans accès Pulse fournissent généralement ces données.
id_id: Properti tidak dijamin akan dilaporkan, tetapi backend tanpa akses Pulse biasanya juga menyediakan data ini.
ja: プロパティーは報告される保証はありませんが、Pulseアクセスのないバックエンドは通常、このデータを提供します。
ko_kr: 특성은 보고되는 것이 보장되지 않지만, 펄스 액세스 없이 백엔드는 일반적으로 이 데이터도 제공한다.
pt_un: As propriedades não têm a garantia de serem relatadas, mas os backends sem acesso ao Pulse normalmente também fornecem esses dados.
ta_in: பண்புகள் புகாரளிக்க உத்தரவாதம் இல்லை, ஆனால் பல்ஸ் அணுகல் இல்லாத பின்பின்னிலையில் பொதுவாக இந்த தரவை வழங்குகிறது.
tr: Özelliklerin raporlanacağı garanti edilmez, ancak Pulse erişimi olmayan arkayüzeyler de genellikle bu verileri sağlar.

source: Defaults
bn_bn: পূর্ব নির্ধারিত
es_un: Predeterminados
fr: Données par défaut
id_id: Default
ja: デフォルト
ko_kr: 기본값
pt_un: Padrões
ta_in: முன்னிருப்பு
tr: Varsayılanlar

source: Unlike the other two sections, ``PulseDefaults`` are only available for Pulse-enabled backends. It contains the default program settings run on the device.
bn_bn: অন্য দুটি বিভাগের মতো নয়,``PulseDefaults`` শুধুমাত্র পালস-চালিত ব্যাকএন্ডদের জন্য উপলব্ধ। এটি রাখে পূর্বনির্ধারিত প্রোগ্রামের সেটিংস যা যন্ত্রটিতে চালিত হয়।
es_un: A diferencia de las otras dos secciones, los ``PulseDefaults`` solo están disponibles para backends habilitados para Pulse. Contiene la configuración predeterminada del programa que se ejecuta en el dispositivo.
fr: Contrairement aux deux autres sections, ``PulseDefaults`` ne sont disponibles que pour les backends activés par Pulse. Il contient les paramètres de programme par défaut exécutés sur l'appareil.
id_id: Tidak seperti dua bagian lainnya, ``PulseDefaults`` hanya tersedia pada backend yang Pulsa diaktifkan. Ini berisi pengaturan bawaan program yang dijalankan pada perangkat.
ja: 他の 2 つのセクションとは異なり、``PulseDefaults`` は Pulse-enabled バックエンドでのみ使用できます。デバイス上で実行されるデフォルトのプログラム設定が含まれています。
ko_kr: 다른 두 섹션과는 달리 ``PulseDefaults`` 는 Pulse-enabled 백엔드에만 사용할 수 있다. 여기에는 디바이스에서 실행되는 기본 프로그램 설정이 포함되어 있다.
pt_un: Ao contrário das outras duas seções, o ``PulseDefaults`` está disponível apenas para backends habilitados pelo Pulse. Ele contém as configurações padrão do programa que são executadas no dispositivo.
ta_in: மற்ற இரண்டு பிரிவுகளைப் போலன்றி, ``PulseDefaults`` பல்ஸ்-இயக்கப்பட்ட பின்நிலையில் மட்டுமே கிடைக்கும். இது சாதனத்தில் இயங்கும் முன்னிருப்பு நிரல் அமைப்புகளைக் கொண்டுள்ளது.
tr: Diğer iki bölümden farklı olarak, ``PulseDefaults`` yalnızca Atım özellikli arkayüzeyler için kullanılabilir. Cihazda çalıştırılan varsayılan program ayarlarını içerir.

source: Drive frequencies
bn_bn: ড্রাইভ ফ্রিকোয়েন্সি সমূহ
es_un: Frecuencias de dirección (drive)
fr: Fréquences des unités de conduite
id_id: Frekuensi drive
ja: ドライブ周波数
ko_kr: 구동 주파수
pt_un: Frequências de acionamento
ta_in: டிரைவஂ அதிர்வெண்கள்
tr: Sürücü frekansları

source: Defaults contains the default frequency settings for the drive and measurement signal channels:
bn_bn: স্বতঃসিদ্ধ নিয়মানুসারে ড্রাইভের জন্য পূর্বনির্ধারিত কম্পাঙ্ক সেটিংকস এবংপরিমাপ সিগনাল চ্যানেলগুলো রয়েছেঃ
es_un: Defaults contienen los valores de frecuencia predeterminados para los canales de señal de medición (measurement) y dirección (drive):
fr: Les valeurs par défaut contiennent les paramètres de fréquence par défaut pour le conducteur (``drive``) et les canaux de mesure du signal:
id_id: Default berisi pengaturan frekuensi default untuk saluran sinyal drive dan pengukuran:
ja: デフォルトには、ドライブと測定信号チャンネルのデフォルト周波数設定が含まれています。
ko_kr: 기본값은 드라이브 및 측정 신호 채널에 대한 기본 빈도 설정을 포함한다:
pt_un: Os padrões contém as configurações de frequência padrão para os canais de sinal de acionamento e medição:
ta_in: முன்னிருப்பு இயக்கி மற்றும் அளவீட்டு சமிக்ஞை சேனல்களுக்கான முன்னிருப்பு அதிர்வெண் அமைப்புகளைக் கொண்டுள்ளது:
tr: Varsayılanlar, sürücü ve ölçüm sinyali kanalları için varsayılan frekans ayarlarını içerir:

source: Pulse Schedule definitions for QuantumCircuit instructions
bn_bn: কোয়ান্টাম যুক্তিবর্তনী নির্দেশনা হল পালস সময়সূচীপালস সময়সূচীর সংজ্ঞা।
es_un: Definiciones del Planificador de Pulso para instrucciones de QuantumCircuit
fr: Définitions de planning d'impulsions pour les instructions QuantumCircuit
id_id: Definisi Jadwal Pulsa dan instruksi QuantumCircuit
ja: QuantumCircuit 命令のパルススケジュールの定義
ko_kr: QuantumCircuit 명령어에 대한 펄스 스케줄 정의
pt_un: Definição de agendamento de pulso para instruções QuantumCircuit
ta_in: குவாண்டம் சுற்று வழிமுறைகளுக்கான பல்ஸ் அட்டவணை வரையறைகள்
tr: QuantumCircuit komutları için Atım Çizelgesi tanımları

source: Finally, one of the most important aspects of the ``backend`` for ``Schedule`` building is the ``InstructionScheduleMap``. This is a basic mapping from a circuit operation’s name and qubit to the default pulse-level implementation of that instruction.
bn_bn: শেষ পর্যন্ত, ``backend`` এর ``Schedule`` গঠন করার সবচেয়ে গুরুত্বপূর্ণ একটিদিক হল ``InstructionScheduleMap``। এটি একটি বর্তনী (সার্কিট) ক্রিয়াকলাপ (অপারেশন) এর নাম থেকে একটি প্রাথমিক ম্যাপিং (চিত্রায়ন) এবং পূর্বনির্ধারিত পালস-স্তরে সেই নির্দেশনায়ে কিউবিট রূপায়ণ (ইমপ্লিমেন্টেশন)।
fr: Enfin, l'un des aspects les plus importants de ``backend`` pour ``Schedule`` est la ``InstructionScheduleMap``. Il s'agit d'une correspondance de base entre le nom d'une opération de circuit et de la mise en oeuvre du niveau d'impulsion par défaut de cette instruction.
id_id: Akhirnya, salah satu aspek terpenting dari ``backend`` untuk membangun ``Schedule`` adalah ``InstructionScheduleMap``. Ini adalah pemetaan dasar dari nama operasi sirkuit dan qubit ke implementasi tingkat pulsa default dari instruksi itu.
ko_kr: 마지막으로 스케줄 ``Schedule`` 빌딩의 백엔드 ``backend`` 의 가장 중요한 측면 중 하나는 ``InstructionScheduleMap`` 이다. 이것은 회로 작동 이름 및 큐비트에서 해당 명령의 기본 펄스 레벨 구현으로 매핑되는 기본 기능이다.
pt_un: Por fim, um dos aspectos mais importantes para a construção da ``Schedule`` do ``backend`` é o ``InstructionScheduleMap``. Este é um mapeamento básico do nome de uma operação do circuito e qubit para a implementação padrão a nível de pulso dessa instrução.
ta_in: இறுதியாக, `` Schedule`` கட்டிடத்திற்கான `` backend`` மிக முக்கியமான அம்சங்களில் ஒன்று," ``InstructionScheduleMap``. இது ஒரு சுற்று செயல்பாட்டின் பெயர் மற்றும் க்யூபிட்டிலிருந்து அந்த அறிவுறுத்தலின் முன்னிருப்பு துடிப்பு-நிலை செயல்படுத்தலுக்கான அடிப்படை விவரணையாக்கம் ஆகும்.
tr: Son olarak, ``Schedule`` oluşturmak için en önemli ``backend`` bakış açılarından biri ``InstructionScheduleMap``tir. Bu bir devre isminden ve kübitinden o komutun varsayılan atım-düzeyi uygulanmasına temel bir eşlemedir.

source: Rather than build a measurement schedule from scratch, let’s see what was calibrated by the backend to measure the qubits on this device:
bn_bn: গোড়ার থেকে একটি পরিমাপ সময়সূচি গঠন করার চেয়ে, দেখা যাক কিভাবে ব্যাকএন্ডে ক্রমাঙ্কিত হয়েছিল এই যন্ত্রে কিউবিটগুলির পরিমাপ করার জন্যঃ
fr: Plutôt que de construire un ordonnancement de mesure à partir de zéro, voyons ce qui a été calibré par le backend pour mesurer les qubits sur cet appareil:
id_id: Daripada membangun jadwal pengukuran dari awal, mari kita lihat apa yang dikalibrasi oleh backend untuk mengukur qubit pada perangkat ini:
ko_kr: 측정 스케줄을 처음부터 빌드하지 않고 백엔드에 의해 보정된 내용을 확인하여 이 디바이스의 큐비트를 측정하라.
pt_un: Ao invés de criar uma schedule de medição do zero, vamos ver o que foi calibrado pelo backend para medir os qubits neste dispositivo:
ta_in: புதிதாக ஒரு அளவீட்டு அட்டவணையை உருவாக்குவதற்கு பதிலாக, இந்த சாதனத்தில் உள்ள க்யூபிட்களை அளவிட பின்முடிவுலையில் அளவீடு செய்யப்பட்டதைப் பார்ப்போம்:
tr: Sıfırdan bir ölçüm programı oluşturmak yerine, bu cihazdaki kübitleri ölçmek için arkayüzeyi tarafından neyin kalibre edildiğini görelim:

source: This can easily be appended to your own Pulse ``Schedule`` (``sched += calibrations.get('measure', <qubits>) << sched.duration``)!
bn_bn: এই সহজে আপনার নিজের তড়িৎস্পন্দন বা পালস যোগ করা যেতে পারে``Schedule`` (``sched += calibrations.get('measure', <qubits>) << sched.duration``)!
es_un: ¡Esto se puede adjuntar fácilmente a tu propio ``Schedule`` de Pulse (``sched += calibrations.get('measure', <qubits>) << sched.duration``)!
fr: Ceci peut facilement être ajouté à votre propre Pulse ``Schedule`` (``sched += calibrations.get('measure', <qubits>) << sched.duration``)!
id_id: Hal ini dapat dengan mudah ditambahkan ke Pulse ``Schedule`` Anda (``sched += calibrations.get('measure', <qubits>) << sched.duration``)!
ja: これは Pulse の ``Schedule`` (``sched += calibrations.get('measure', <qubits>) << sched.duration``) に簡単に追加できます!
ko_kr: 이것은 자체 펄스 스케줄 ``Schedule`` (``sched += calibrations.get('measure', <qubits>) << sched.duration``)에 쉽게 추가될 수 있다.
pt_un: Isto pode facilmente ser adicionado ao seu próprio ``Schedule`` Pulse (``sched += calibrations.get('measure', <qubits>) << sched.duration``)!
ta_in: இது உங்கள் சொந்த பல்ஸ்சுடன் எளிதாக சேர்க்கப்படலாம் ``Schedule`` (``sched += calibrations.get('measure', <qubits>) << sched.duration``)!
tr: Bu, kendi Atım``Schedule`` (``sched += calibrations.get('measure', <qubits>) << sched.duration``) kolayca eklenebilir!
