Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/08_gathering_system_information.po
Languages: bn_bn, es_un, fr, id_id, ja, ko_kr, pt_un, ta_in, tr

source: This page was generated from `tutorials/circuits_advanced/08_gathering_system_information.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/circuits_advanced/08_gathering_system_information.ipynb`__থেকে উৎপন্ন হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/circuits_advanced/08_gathering_system_information.ipynb`__.
fr: Cette page a été générée à partir de `tutorials/circuits_advanced/08_gathering_system_information.ipynb`__.
id_id: Halaman ini dibuat dari `tutorials/circuits_advanced/08_gathering_system_information.ipynb`__.
ja: 当ページは `tutorials/circuits_advanced/08_gathering_system_information.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/circuits_advanced/08_gathering_system_information.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `tutorials/circuits_advanced/08_gathering_system_information.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/circuits_advanced/08_gathering_system_information.ipynb`__ எனஂபதிலி௫நஂது உருவாக்கப்பட்டது.
tr: Bu sayfa `tutorials/circuits_advanced/08_gathering_system_information.ipynb`__ adresinden oluşturulmuştur.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/08_gathering_system_information.ipynb>`_.
ta_in: கருப்பொருளில் ஊடாடும் வகையில் இயக்கவும் ` IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits/1_getting_started_with_qiskit.ipynb>` _.

source: Obtaining information about your ``backend``
bn_bn: আপনার ``backend`` সম্পর্কে তথ্য প্রাপ্ত করে।
es_un: Obteniendo información sobre tu ``backend``
fr: Obtenir d'informations à propos de votre ``backend``
id_id: Memperoleh informasi tentang ``backend`` Anda
ja: ``backend`` に関する情報の取得
ko_kr: ``backend`` 에 대한 정보를 얻기
pt_un: Obtendo informações sobre o seu ``backend``
ta_in: உங்கள் ``backend`` பற்றிய தகவல்களைப் பெறுதல்
tr: ``backend`` iniz hakkında bilgi edinme

source: *Note: All the attributes of the backend are described in detail in the*\ `Qiskit Backend Specifications <https://arxiv.org/pdf/1809.03452.pdf>`__\ *. This page reviews a subset of the spec.*
bn_bn: *টীকা: ব্যাকএন্ডের সমস্ত বৈশিষ্ট্য *\ `কিস্কিট ব্যাকএন্ড স্পেসিফিকেশন <https://arxiv.org/pdf/1809.03452.pdf>` __ \ *এ বিস্তারিত বর্ণনা করা হয়েছে। এই পৃষ্ঠাটি স্পেসিফিকেশন-এর একটি উপসেট পর্যালোচনা করে।*
es_un: *Nota: Todos los atributos del backend se describen en detalle en las* \ `Qiskit Backend Specifications <https://arxiv.org/pdf/1809.03452.pdf>`__\ *. Esta página analiza un subconjunto de la especificación.*
fr: *Remarque: Tous les attributs du système d'exécution (``backend``) sont décrits en détail dans le document* `Qiskit Backend Specifications <https://arxiv.org/pdf/1809.03452.pdf>`__. *Cette page examine un sous-ensemble de la spécification.*
id_id: *Catatan: Semua atribut backend dijelaskan secara rinci di *\ `Qiskit Backend Specifications <https://arxiv.org/pdf/1809.03452.pdf>`__\ *. Halaman ini mengulas sebagian dari spesifikasinya.*
ja: *注: バックエンドの全ての属性については、* `Qiskit Backend Specifications <https://arxiv.org/pdf/1809.03452.pdf>`__ *に詳しく記述されています。このページでは、仕様の一部について見直します。*
ko_kr: *참고: 백엔드의 모든 속성은*\ `Qiskit 백엔드 스펙 <https://arxiv.org/pdf/1809.03452.pdf>`__\ * 에 자세히 설명되어 있다. 이 페이지에서는 스펙의 하위 집합을 개관한다.*
pt_un: *Nota: Todos os atributos do backend estão descritos em detalhes na*\ `Especificações do Backend do Qiskit <https://arxiv.org/pdf/1809.03452.pdf>`__\ *. Esta página revisa um subconjunto da especificação.*
ta_in: * குறிப்பு: பின்னணி அனைத்து குணங்கள் *\` Qiskit Backend Specifications <https://arxiv.org/pdf/1809.03452.pdf>` __\ *. இந்த பக்கம் வெப்பமடைதலின் ஒரு துணை விவரம். *
tr: *Not: Arkayüzeyin tüm özellikleri*\ `Qiskit Backend Specifications <https://arxiv.org/pdf/1809.03452.pdf>`__\ * bölümünde ayrıntılı olarak açıklanmıştır. Bu sayfa, spesifikasyonun bir alt kümesini inceler.*

source: Programming a quantum computer at the microwave pulse level requires more information about the device than is required at the circuit level. A quantum circuit is built for an abstract quantum computer – it will yield the same quantum state on any quantum computer (except for varying performance levels). A pulse schedule, on the other hand, is so specific to the device, that running one program on two different backends is not expected to have the same result, even on perfectly noiseless systems.
bn_bn: একটি কোয়ান্টাম কম্পিউটারকে বেতারতরঙ্গ তড়িৎস্পন্দন বা পালস স্তরে প্রোগ্রামিং করতে, বর্তনী (সার্কিট) স্তরেতে যা তথ্য লাগে তার থেকে ও বেশি যন্ত্রটির সমপর্কে আরো তথ্য দরকার। একটি কোয়ান্টাম বর্তনী (সার্কিট) গঠিত হয় একটি সংক্ষিপ্ত কোয়ান্টাম কম্পিউটারের জন্য–যেকোনো কোয়ান্টাম কম্পিউটারে এটা একই কোয়ান্টাম মান বা অবস্থা উৎপাদন করবে ( বিভিন্ন কর্মক্ষমতা ছাড়া)। অন্যদিকে, একটি পালস সময়সূচী যন্ত্র বিশেষে নির্দিষ্ট, একটি প্রোগ্রামকে দুটি বিভিন্ন ব্যাকএন্ডে চালালে একই ফলাফল প্রত্যাশিত নয়, এমনকি সম্পূর্ণ ত্রুটিহীণ পদ্ধতিতে ও।
fr: La programmation d'un ordinateur quantique au niveau des impulsions micro-ondes nécessite plus d'informations sur l'appareil que ce qui est requis au niveau du circuit. Un circuit quantique est construit pour un ordinateur quantique abstrait -- il donnera le même état quantique sur n'importe quel ordinateur quantique (sauf pour des niveaux de performance variables). Un ordonnancement (``schedule``) d'impulsions, d'autre part, est si spécifique à l'appareil, que l'exécution d'un programme sur deux backends différents ne devrait pas avoir le même résultat, même sur des systèmes parfaits (sans bruit).
id_id: Memogramkan komputer kuantum pada tingkat pulsa gelombang mikro membutuhkan lebih banyak informasi mengenai perangkat dibandingkan dalam tingkat sirkuit. Sirkuit kuantum dibuat untuk komputer kuantum yang abstrak – hasil keadaan kuantum yang dihasilkan akan sama pada setiap komputer kuantum (kecuali untuk variasi tingkat performa). Jadwal pulsa, di sisi lain, sangat spesifik tergantung perangkat, sehingga menjalankan satu program dalam dua backend yang berbeda tidak akan menghasilkan hasil yang sama, bahkan pada sistem tanpa gangguan sekalipun.
ko_kr: 마이크로파 펄스 레벨에서 양자 컴퓨터를 프로그래밍하는 것은 회로 레벨에서 요구되는 것보다 디바이스에 대한 더 많은 정보를 필요로 한다. 양자 회로는 추상 양자 컴퓨터를 위해 만들어지며, 어떠한 양자 컴퓨터에서도 동일한 양자 상태를 만들 수 있다 (다양한 성능 수준을 제외하고는). 다른 한편으로, 펄스 스케쥴은 디바이스에 매우 특정하며, 2개의 상이한 백엔드 상에서 하나의 프로그램을 실행하는 것은 완전히 무소음인 시스템에서도 동일한 결과를 가질 것으로 예상되지 않는다.
pt_un: Programar um computador quântico no nível de pulso de micro-ondas requer mais informações sobre o dispositivo do que as necessárias no nível do circuito. Um circuito quântico é construído para um computador quântico abstrato -- ele irá produzir o mesmo estado quântico em qualquer computador quântico (exceto para níveis variados de desempenho). Por outro lado, uma schedule de pulso é tão específica ao dispositivo, que ao rodar um programa em dois backends diferentes não se espera ter o mesmo resultado, mesmo em sistemas perfeitamente sem ruído.
ta_in: மைக்ரோவேவ் பல்ஸிலி௫நஂது ஒரு குவாண்டம் கணினியை நிரலாக்க, சர்கூடிலி௫நஂது தேவைப்படுவதை விட சாதனத்தைப் பற்றிய கூடுதல் தகவல்கள் தேவை. ஒரு குவாண்டம் சர்கூட் ஒரு சுருக்கமான குவாண்டம் கணினிக்காக கட்டப்பட்டுள்ளது - இது எந்த குவாண்டம் கணினியிலும் அதே குவாண்டம் நிலையை வழங்கும் (மாறுபட்ட செயல்திறன் நிலைகளைத் தவிர). ஒரு பல்ஸ் அட்டவணை, மறுபுறம், சாதனத்திற்கு மிகவும் குறிப்பிட்டது, இரண்டு வெவ்வேறு பின்தளத்தில் ஒரு நிரலை இயக்குவது ஒரே மாதிரியான பலனைத் தரும் என்று எதிர்பார்க்கப்படுவதில்லை, துளஂளியமான நாயஂஸஂெலஸஂ கணினிகளில் கூட.
tr: Bir kuantum bilgisayarı mikrodalga atım seviyesinde programlama da aygıt ile ilgili bilgi devre düzeyindeki gerekli bilgiden daha fazla gereklidir. Bir kuantum devresi soyut kuantum bilgisayarlarda oluşur- herhangi bir kuantum bilgisayarda (değişen performans seviyeleri dışında) benzer kuantum durumları sağlayacaktır. Diğer taraftan bir atım zamanlaması, cihaza özel olan iki farklı arka uçta çalışan bir programdan aynı sonuç almak beklenemez, hatta oldukça gürültüsüz sistemlerde bile beklenemez.

source: As a basic example, imagine a drive pulse ``q0_X180`` calibrated on qubit 0 to enact an :math:`X180` pulse, which flips the state of qubit 0. If we use the samples from that pulse on qubit 1 on the same device, or qubit 0 on another device, we do not know what the resulting state will be – but we can be pretty sure it won’t be an :math:`X180` operation. The qubits are each unique, with various drive coupling strengths. If we have specified a frequency for the drive pulse, it’s very probable that pulse would have little effect on another qubit, which has its own resonant frequency.
bn_bn: একটি প্রাথমিক উদাহরণস্বরূপ, মনে করুন একটি :math:`X180`তড়িৎস্পন্দন বা পালস সম্পন্ন করতে, একটি ড্রাইভ তড়িৎস্পন্দন বা পালস ``q0_X180`` কে যা কিউবিট ০ র উপরে ক্রমাঙ্কিত (ক্যালিব্রেটেট) কিউবিট ০ র মান বা অবস্থাকে যা উল্টে দেয়। যদি আমরা ওই তড়িৎস্পন্দন বা পালসের নমুনা (স্যাম্পল) কে একই যন্ত্রের কিউবিট ১ র উপরে ব্যবহার করা হয় , অথবা অন্য যন্ত্রের কিউবিট ০র উপরে, আমরা জানতে পারি না কি ফলাফল মান বা অবস্থা হবে–কিন্তু আমরা নিশ্চিত ভাবে বলতে পারি যে সেটি একটি :math:`X180` ক্রিয়াকলাপ (অপারেশন) হবে না। কিউবিটগুলি প্রতিটি অদ্বিতীয়, বিভিন্ন ড্রাইভ সংযোজন শক্তি সমূহ সহ। যদি ড্রাইভ তড়িৎস্পন্দন বা পালসটির কম্পাঙ্ক নির্দিষ্ট করি , এটি খুবই সম্ভাবনীয় যে তড়িৎস্পন্দন বা পালস অন্য কিউবিটের উপর খুবই কম প্রভাব ফেলবে, যার নিজস্ব অনুনাদিত কম্পাঙ্ক রয়েছে।
fr: Comme exemple de base, imaginez une impulsion de conduite ``q0_X180`` calibrée sur le qubit 0 pour mettre en oeuvre une impulsion de :math:`X180`, qui flippe l'état du qubit 0. Si nous utilisons les échantillons de cette impulsion sur le qubit 1 sur le même appareil, ou qubit 0 sur un autre appareil, nous ne savons pas ce que sera l'état résultant -- mais nous pouvons être sûrs que ce ne sera pas une opération :math:`X180`exacte. Les qubits sont uniques, avec diverses forces de couplage. Si nous avons spécifié une fréquence pour l'impulsion de conduite, il est très probable que cette impulsion aurait peu d'effet sur un autre qubit, qui a sa propre fréquence de résonance.
id_id: Sebagai contoh sederhana, bayangkan pulsa drive ``q0_X180`` dikalibrasi pada qubit 0 untuk memberlakukan pulsa :math:`X180`, yang membalikkan keadaan dari qubit 0. Jika kita memakai sampel dari pulsa itu pada qubit 1 dalam perangkat yang sama, atau qubit 0 pada perangkat lain, kita tidak tahu keadaan apa yang dihasilkan – tetapi kita cukup yakin hasilnya bukan opearsi :math:`X180`. Qubit masing-masing unik, dengan berbagai kekuatan kopling drive. Jika kita telah menentukan frekuensi untuk pulsa drive, sangat mungkin bahwa pulsa akan memiliki sedikit efek pada qubit lain, yang memiliki frekuensi resonansinya sendiri.
ko_kr: 기본적인 예로, 드라이브 펄스 ``q0_X180`` 이 큐비트 0에서 보정된 :math:`X180` 펄스를 구현하는 것을 상상해 보자. 만약 우리가 같은 기기의 큐비트 1에 있는 그 펄스의 샘플을 사용하거나 다른 기기에서 큐비트 0을 사용하면, 결과적으로 어떤 상태가 될지는 모르겠지만, :math:`X180` 연산이 아닐 것이라고 확신할 수 있다. 이 큐비트들은 각각 고유하며, 다양한 드라이브 커플링 강도를 갖는다. 만약 우리가 드라이브 펄스에 대해 주파수를 지정한다면, 펄스가 그 자신의 공진 주파수를 갖는 또 다른 쿼트에 거의 영향을 미치지 않을 가능성이 매우 높다.
pt_un: Como um exemplo básico, imagine um pulso direcionado ``q0_X180`` calibrado no qubit 0 para executar um pulso de :math:`X180`, que vira o estado de qubit 0. Se usarmos as amostras desse pulso no qubit 1 no mesmo dispositivo, ou no qubit 0 em outro dispositivo, não sabemos qual será o estado resultante - mas podemos ter certeza de que não será uma operação :math:`X180`. Os qubits são únicos, com diferentes forças de acoplamento. Se tivermos especificado uma frequência para o pulso de condução, é muito provável que o pulso tenha pouco efeito em outro qubit, que tem sua própria frequência ressonante.
ta_in: ஒரு அடிப்படை எடுத்துக்காட்டு, ஒரு டிரைவ் பல்ஸ் `` q0_X180`` க்யூபிட் 0 இல் அளவீடு செய்யப்பட்டதை கற்பனை செய்து பாருங்கள் :math: `X180` பல்ஸ், இது க்யூபிட் 0 நிலையை புரட்டுகிறது. அந்த பல்ஸ்லிருந்து மாதிரிகளை அதே சாதனத்தில் க்யூபிட் 1 இல் அல்லது மற்றொரு சாதனத்தில் க்யூபிட் 0 ஐப் பயன்படுத்தினால், இதன் விளைவாக இறுதி நிலை என்ன இருக்கும் என தெரியாது. ஆனாலஂ உறுதியாக :math: ` X180` செயல்பாடாக இருகஂகாது.
tr: Temel bir örnek olarak, kübit 0'ın durumunu değiştiren bir :math:'X180' atımını etkinleştirmek için kübit 0'da kalibre edilmiş ``q0_X180`` bir sürücü atımı hayal edin. Aynı cihazda veya başka bir cihazda kübit 0'da, sonuçtaki durumun ne olacağını bilmiyoruz - ancak bunun bir :math:`X180` işlemi olmayacağından oldukça emin olabiliriz. Kübitlerin her biri benzersizdir ve çeşitli bağlayıcı güçleri vardır. Sürücü atımı için bir frekans belirlediysek, atımın kendi rezonans frekansına sahip başka bir kübit üzerinde çok az etkisi olması çok muhtemeldir.

source: With that, we have motivated why information from the backend may be very useful at times for building Pulse schedules. The information included in a ``backend`` is broken into three main parts:
bn_bn: এর সাথে, আমরা পালস সময়সূচী গঠনের সময়ে ব্যাকএন্ডের থেকে তথ্য কেন অত্য়ন্ত প্রয়োজনীয় হতে পারে সেই সম্পর্কে অনুপ্রাণিত হই। ব্যাকএন্ডের (backend) অন্তর্ভুক্ত তথ্য তিনটি প্রধান ভাগে বিভক্তঃ
es_un: Con eso, hemos motivado por qué la información del backend puede ser muy útil en ocasiones para crear planificadores de Pulse. La información incluida en un ``backend`` se divide en tres partes principales:
fr: Avec ça, nous avons motivé la raison pour laquelle l'information du backend peut être très utile parfois pour construire des horraires (``schedules``) Pulse. L'information incluse dans une ``backend`` est divisée en trois parties principales:
id_id: Dengan itu, kita telah memotivasi mengapa informasi dari backend akan sangat berguna saat membangun jadwal Pulse. Informasi yang termasuk dalam ``backend`` dibagi menjadi tiga bagian utama:
ja: これにより、バックエンドからの情報がPulseスケジュールの作成に非常に役立つ理由がわかりました。 ``backend`` に含まれる情報は 3 つの主要部分に分かれています。
ko_kr: 그 결과, 우리는 백엔드로부터의 정보가 펄스 스케쥴을 구축하기 위해 때때로 매우 유용할 수 있는 이유를 갖게 되었다. 백엔드 ``backend`` 에 포함된 정보는 세 가지 주요 부분으로 나뉜다.
pt_un: Com isso, motivamos a razão pela qual as informações do backend podem ser às vezes muito úteis para a construção de agendamentos do Pulse. A informação incluída em um ``backend`` é dividida em três partes principais:
ta_in: அதனுடன், பின்புலத்திலிருந்து தகவல்கள் பல்ஸ் திட்டப்பணி கட்டுவதற்கு நேரத்தில் மிகவும் பயனுள்ளதாகத் தெரிவித்துள்ளோம். ஒரு ``backend`` மூன்று முக்கிய பகுதிகளாக உடைந்தது:
tr: Bununla birlikte arkayüzden gelen bilgilerin neden Atım zamanlamalarını oluşturmak için bazen çok yararlı olabileceğini belirtmiş olduk. Bir ``arkayüz``de yer alan bilgiler üç ana bölüme ayrılmıştır:

source: `Configuration <#Configuration>`__: static backend features
bn_bn: `Configuration <#Configuration>`__: স্থির ব্যাকএন্ডের বৈশিষ্ট্য (ফিচার) সমূহ।
es_un: `Configuración <#Configuration>`__: características estáticas del backend
fr: `Configuration <#Configuration>`__: caractéristiques statiques du backend
id_id: `Configuration <#Configuration>`__: fitur backend statis
ja: `構成 <#Configuration>`__: 静的なバックエンドの特徴
ko_kr: `구성 <#Configuration>`__ 정적 백엔드 기능
pt_un: `Configuration <#Configuration>`__: recursos de backend estáticos
ta_in: `Configuration <#Configuration> ` __: நிலையான பின்னணி அம்சங்கள்
tr: `Configuration <#Configuration>`__: statik arkayüzey özellikleri

source: `Properties <#Properties>`__: measured and reported backend characteristics
bn_bn: `Properties <#Properties>`__: পরিমাপ এবং ব্যাকএন্ডের জ্ঞাপিত বৈশিষ্ট্যাবলী।
es_un: `Propiedades <#Properties>`__: características del backend medidas y reportadas
fr: `Properties <#Properties>`__: caractéristiques mesurées et rapportées du backend
id_id: `Properties <#Properties>`__: mengukur dan melaporkan karakteristik backend
ja: `プロパティー <#Properties>`__: 測定されレポートされたバックエンドの特性
ko_kr: `특성 <#Properties>`__: 측정 및 보고된 백엔드 특성
pt_un: `Properties <#Properties>`__: características de backend medidas e relatadas
ta_in: `Properties <#Properties> ` __: அளவு மற்றும் அறிக்கப்பட்ட பின்னணி பண்புகள்
tr: `Properties <#Properties>`__: ölçülen ve rapor edilen arkayüzey özellikleri

source: `Defaults <#Defaults>`__: default settings for the OpenPulse-enabled backend
bn_bn: `Defaults <#Defaults>`__: স্বতঃসিদ্ধ নিয়মানুসারে OpenPulse চালিত ব্যাকএন্ডের বিন্যাশ করে।
es_un: `Predeterminados <#Defaults>`__: configuración predeterminada para el backend habilitado para OpenPulse
fr: `Defaults <#Defaults>`__: paramètres par défaut pour le backend supportant OpenPulse
id_id: `Defaults <#Defaults>`__: pengaturan baku untuk backend yang mengaktifkan OpenPulse
ja: `デフォルト <#Defaults>`__ : OpenPulse対応バックエンドのデフォルト設定
ko_kr: `기본값 <#Defaults>`__: OpenPulse 사용 백엔드에 대한 기본 설정
pt_un: `Defaults <#Defaults>`__: configurações padrão para o backend habilitado pelo OpenPulse
ta_in: ` Defaults <#Defaults> ` _: OpenPulse-செயல்படுத்தப்பட்ட பின்னணிக்கு முன்னிருப்பு அமைப்புகள்
tr: `Defaults <#Defaults>`__: OpenPulse-enabled arkayüzeyi için varsayılan ayarlar

source: which are each covered in the following sections. While all three of these contain interesting data for Pulse users, the defaults are *only* provided for backends enabled with OpenPulse.
bn_bn: যা প্রতিটি নিম্নলিখিত বিভাগে আবৃত হয়েছে। যখন এই তিনটি তড়িৎস্পন্দন বা পালস সমস্তের ব্যবহারকারিরা আকর্ষণীয় তথ্য (ডেটা) ধারণ করে, OpenPulse চালিত ব্যাকএন্ডের জন্য * শুধুমাত্র *স্বতঃসিদ্ধ নিয়মানুসারে যা হয় তা উপলব্ধ করা হয়।
es_un: las cuales son tratadas en las siguientes secciones. Si bien las tres contienen datos interesantes para los usuarios de Pulse, los valores predeterminados *solo* son proporcionados para los backends habilitados con OpenPulse.
fr: qui sont chacune couvertes dans les sections suivantes. Bien que ces trois contiennent des données intéressantes pour les utilisateurs de Pulse, les valeurs par défaut sont *seulement* fournies pour les backends activés avec OpenPulse.
id_id: yang masing-masing dijelaskan dalam bagian selanjutnya. Sementara ketiganya memuat data menarik untuk pengguna Pulse, yang bakunya *hanya* disediakan untuk backend yang diaktifkan dengan OpenPulse.
ja: それぞれが次のセクションで説明されています。これら3つすべてがPulseユーザーにとって興味深いデータを含んでいますが、デフォルトはOpenPulseが有効になっているバックエンドに *のみ* 提供されてます。
ko_kr: 이는 각각 다음 섹션에서 다루어진다. 이 세 가지 모두가 Pulse 사용자를 위한 흥미로운 데이터를 포함하고 있지만, 기본값은 OpenPulse를 사용하여 사용할 수 있는 백엔드에 제공된 *전용* 뿐이다.
pt_un: que são abordadas cada uma nas seguintes seções. Embora todos estas três partes contenham dados interessantes para usuários do Pulse, os padrões são fornecidos *apenas* para backends habilitados com OpenPulse.
ta_in: பின்வரும் பகுதிகளில் ஒவ்வொன்றும் மூடப்பட்டுள்ளன. இவற்றில் மூன்று முழுவதும் பல்ஸ் பயனர்களுக்கு ஆசிரியமான தரவு கொண்டிருக்கும் போது, முன்னிருப்புகள் *only* ஓபன்ஸ் (OpenPulse) செயற்படுத்தப்பட்ட பின்னணிகளுக்கு மட்டும் கொடுக்கப்பட்டுள்ளது.
tr: bunların her biri aşağıdaki bölümlerde ele alınmıştır. Üçü de Atım kullanıcıları için ilginç veriler içeriyor olsa da, varsayılanlar *yalnızca* OpenPulse ile etkinleştirilen arkayüzeyler için sağlanmıştır.

source: The first thing you’ll need to do is grab a backend to inspect. Here we use a mocked backend that contains a snapshot of data from the real OpenPulse-enabled backend.
bn_bn: প্রথম জিনিস যা আপনার দরকার একটি ব্যাকএন্ডকে ধরে পরীক্ষা করা। এখানে আমরা একটি ছদ্ম ব্যাকএন্ডকে ব্যবহার করছি যার আছে সত্যিকারের OpenPulse-চালিত ব্যাকএন্ডের থেকে তথ্যের ( ডেটা) স্ন্যাপশট ।
fr: La première chose que vous devrez faire est de récupérer un backend à inspecter. Ici, nous utilisons un backend simulé qui contient une images des données d'un backend réel supportant OpenPulse.
id_id: Hal pertama yang perlu Anda lakukan adalah mengambil backend untuk diperiksa. Di sini kita menggunakan contoh backend yang mengandung cuplikan data dari backend yang diaktifkan OpenPulse aslinya.
ko_kr: 가장 먼저 해야 할 일은 검사를 하기 위해 백엔드를 잡는 것이다. 여기서는 실제 OpenPulse가 가능한 백엔드로부터의 데이터 스냅샷을 포함하는, mocked 백엔드를 사용한다.
pt_un: A primeira coisa que você precisa fazer é acessar um backend para inspecionar. Aqui usamos um backend simulado (mocked, em inglês) que contém um instantâneo dos dados de um backend real habilitado por um OpenPulse.
ta_in: நாம் செய்ய வேண்டிய முதல் விஷயம், ஆய்வு செய்ய ஒரு பின்நிலையை பெருவது.
tr: Yapmanız gereken ilk şey, incelemek için bir arkayüzey almaktır. Burada, gerçek OpenPulse etkin arkayüzeyden alınan verilerin anlık görüntüsünü içeren sahte bir arka uç kullanıyoruz.

source: Configuration
bn_bn: যান্ত্রিক বিন্যাস (কনফিগারেশন)
es_un: Configuración
id_id: Konfigurasi
ja: 構成
ko_kr: 구성
pt_un: Configuração
ta_in: உள்ளமைவு
tr: Yapılandırma

source: The configuration is where you’ll find data about the static setup of the device, such as its name, version, the number of qubits, and the types of features it supports.
bn_bn: যান্ত্রিক বিন্যাস (কনফিগারেশন) হল যেখানে যন্ত্রের স্থিতি সেটআপের সম্পর্কে তথ্যগুলি( ডেটা)খুজে পাবেন,যেমন এটির নাম,সংস্করণ,কিউবিটের সংখ্যা এবং তার সাহায্যকারী বৈশিষ্ট্যের (ফিচার) প্রকার।
fr: La configuration est là où vous trouverez des données sur la configuration statique de l'appareil, comme son nom, sa version, le nombre de qubits et les types de fonctionnalités qu'il supporte.
id_id: Konfigurasi adalah di mana Anda menemukan data tentang pengaturan statis dari perngkat, seperti nama, versi, jumlah qubit, dan jenis fitur yang didukung.
ko_kr: 구성은 디바이스의 정적 설정에 대한 데이터 (예: 이름, 버전, 큐비트의 수 및 지원하는 기능의 유형) 를 찾을 수 있는 위치이다.
pt_un: A configuração é onde você encontrará dados sobre a configuração estática do dispositivo, como o seu nome, versão, o número de qubits e os tipos de recursos que ele suporta.
ta_in: சாதனத்தின் நிலையான அமைப்பைப் பற்றிய தரவை நீங்கள் காணும் இடம்தான் உள்ளமைவு, அதன் பெயர், பதிப்பு, க்யூபிட்களின் எண்ணிக்கை மற்றும் அது ஆதரிக்கும் அம்சங்கள் போன்றவை.
tr: Yapılandırma; adı, sürümü, kübit sayısı ve desteklediği özellik türleri gibi cihazın statik kurulumuyla ilgili verileri bulacağınız yerdir.

source: Let’s build a description of our backend using information from the ``backend``\ ’s config.
bn_bn: চলুন আমাদের ব্যাকএন্ডের একটি বিবরণ গঠন বা নির্মাণ (বিল্ড) করা যাক ``backend``\ ব্যাকএন্ডের কনফিগের তথ্যকে ব্যবহার করে।
fr: Construisons une description de notre backend en utilisant les informations de la configuration du ``backend``.
id_id: Mari kita buat deskripsi dari backend kita dengan menggunakan informasi dari konfigurasi `backend``\ ’s.
ko_kr: 백엔드에 대한 설명을 백엔드 ``backend``\의 구성의 정보를 사용하여 빌드한다.
pt_un: Vamos construir uma descrição do nosso backend usando as informações da configuração do ``backend``.
ta_in: `` backend``யினஂ உள்ளமைவின் தகவலைப் பயன்படுத்தி பின்தளத்தில் விளக்கத்தை உருவாக்க கூடுமஂ.
tr: ``backend``\ ’in yapılandırmasından gelen bilgileri kullanarak arkayüzeye ilişkin bir tanımını oluşturalım.
