Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/09_pulse_simulator_duffing_model.po
Languages: bn_bn, es_un, fr_fr, id_id, ko_kr, pt_br, ta_in

source: This page was generated from `tutorials/circuits_advanced/09_pulse_simulator_duffing_model.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/circuits_advanced/09_pulse_simulator_duffing_model.ipynb`__ থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/circuits_advanced/09_pulse_simulator_duffing_model.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/circuits_advanced/09_pulse_simulator_duffing_model.ipynb`__.
id_id: Halaman ini dibuat dari `tutorials/circuits_advanced/09_pulse_simulator_duffing_model.ipynb`__.
ko_kr: 이 페이지는 `tutorials/circuits_advanced/09_pulse_simulator_duffing_model.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada a partir de `tutorials/circuits_advanced/09_pulse_simulator_duffing_model.ipynb`__.
ta_in: இந்த பக்கம் 'tutorials/circuits_advanced/09_pulse_simulator_duffing_model.ipynb`__ இருந்து உருவாக்கப்பட்டது.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/09_pulse_simulator_duffing_model.ipynb>`_.
id_id: Jalankan secara interaktif di `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/09_pulse_simulator_duffing_model.ipynb>`_.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/09_pulse_simulator_duffing_model.ipynb>`_.

source: Qiskit Aer: Pulse simulation of two qubits using a Duffing oscillator model
bn_bn: Qiskit এয়ার: একটি Duffing দোলক বা অসিলেটর মডেল ব্যবহার করে দুটি কিউবিটের তড়িৎস্পন্দন বা পালস সিমুলেশন
es_un: Qiskit Aer: Simulación de pulsos de dos qubits usando un modelo de oscilador de Duffing
fr_fr: Qiskit Aer: simulation d'impulsion de deux qubits en utilisant un modèle d'oscillateur Duffing
id_id: Qiskit Aer: Simulasi pulsa dari dua qubit dengan menggunakan model Duffing oscillator
ko_kr: Qiskit Aer: Duffing 오실레이터 모델을 이용한 2 큐비트의 펄스 시뮬레이션
pt_br: Qiskit Aer: Simulação de pulso de dois qubits usando um modelo de oscilador de Duffing
ta_in: Qiskit ஏர்: டஃபிங் ஆஸிலேட்டர் மாதிரியைப் பயன்படுத்தி இரண்டு குவிட்களின் துடிப்பு உருவகப்படுத்துதல்

source: This notebook shows how to use the Qiskit Aer pulse simulator, which simulates experiments specified as pulse ``Schedule`` objects at the Hamiltonian level. The simulator solves the Schrodinger equation for a specified Hamiltonian model and pulse ``Schedule`` in the frame of the drift Hamiltonian.
bn_bn: এই নোটবুক দেখায় কিভাবে কিস্কিট এয়ার পালস সিমুলেটর ব্যবহার করতে হয়, যা হ্যামিল্টোনিয়ান স্তরে পালস ``Schedule`` বস্তু হিসাবে নির্দিষ্ট পরীক্ষাগুলি অনুকরণ করে। সিমুলেটর একটি নির্দিষ্ট হ্যামিল্টোনিয়ান মডেলের জন্য Schrodinger সমীকরণ সমাধান করে এবং ড্রিফট হ্যামিল্টোনিয়ানের ফ্রেমে ``Schedule`` পালস করে।
es_un: Este cuaderno muestra cómo utilizar el simulador de pulso Qiskit Aer, que simula experimentos especificados como objetos ``Schedule`` de pulso a nivel Hamiltoniano. El simulador resuelve la ecuación de Schrodinger para un modelo Hamiltoniano específico y un ``Schedule`` de pulso en el marco del Hamiltoniano de deriva.
fr_fr: Ce bloc-notes montre comment utiliser le simulateur d'impulsion Qiskit Aer, qui simule les expériences spécifiées comme des objets d'impulsion ``Schedule`` au niveau Hamiltonien. Le simulateur résout l'équation Schrodinger pour un modèle Hamiltonien spécifié et l'impulsion ``Schedule`` dans le cadre de Hamiltonien de dérive.
id_id: Notebook ini menunjukkan bagaimana menggunakan Qiskit Aer pulse simulator, yang mensimulasikan eksperimen yang ditentukan sebagai pulse ` ` Schedule ` ` objek pada tingkat Hamiltonian. Simulator ini memecahkan persamaan Schrodinger untuk model Hamiltonian yang ditentukan dan pulsa ` ` Schedule ` ` dalam kerangka dari Hamiltonian drift.
ko_kr: 이 노트북은 Hamiltonian 레벨에서 펄스 ``Schedule`` 객체로 지정되는 실험을 시뮬레이션하는 Qiskit Aer 펄스 시뮬레이터의 사용법을 설명한다. 이 시뮬레이터는 특정 Hamiltonian 모델과 펄스 ``Schedule`` 에 대한 Schrodinger 방정식을 drift Hamiltonian 프레임에서 해결한다.
pt_br: Este notebook mostra como usar o simulador de pulso Qiskit Aer, que simula experimentos especificados como objetos pulso ``Schedule`` ao nível Hamiltoniano. O simulador resolve a equação Schrodinger para um modelo Hamiltoniano e pulso ``Schedule`` especificados no quadro Hamiltoniano derivado.
ta_in: இந்த நோட்புக் Qiskit ஏர் துடிப்பு சிமுலேட்டரை எவ்வாறு பயன்படுத்துவது என்பதைக் காட்டுகிறது, இது ஹாமில்டோனிய மட்டத்தின் துடிப்பு ``Schedule`` பொருள்களாக குறிப்பிடப்பட்ட சோதனைகளை உருவகப்படுத்துகிறது. சிமுலேட்டர் ஒரு குறிப்பிட்ட ஹாமில்டோனிய மாதிரிக்கான ஷ்ரோடிங்கர் சமன்பாட்டைத் தீர்க்கிறது மற்றும் சறுக்கல் ஹாமில்டோனியனின் சட்டத்தில் ``Schedule`` துடிப்பு.

source: In particular, in this tutorial we will:
bn_bn: বিশেষ করে, আমরা এই টিউটোরিয়ালসমূহে যা করব:
es_un: En particular, en este tutorial:
fr_fr: En particulier, dans ce tutoriel, nous allons :
ko_kr: 특히 이 튜토리얼에서는 다음의 작업들을 수행할 것이다:
pt_br: Em particular, neste tutorial vamos:
ta_in: குறிப்பாக, இந்த டுடோரியலில் நாம் செய்வோம்:

source: Construct a model of a two qubit superconducting system.
bn_bn: একটি দুই কিউবিট সুপারকন্ডাক্টিং পদ্ধতির একটি মডেল গঠন করুন।
es_un: Construir un modelo de un sistema superconductor de dos qubits.
fr_fr: Construire un modèle d'un système supraconducteur à deux qubits.
ko_kr: 두 개의 큐비트의 초전도 시스템의 모형을 생성한다.
pt_br: Construir um modelo de um sistema de supercondução de dois qubits.
ta_in: இரண்டு குவிட் சூப்பர் கண்டக்டிங் அமைப்பின் மாதிரியை உருவாக்குங்கள்.

source: Calibrate :math:`\pi` pulses on each qubit in the simulated system.
bn_bn: সিমুলেটেড সিস্টেমে প্রতিটি কিউবিটে :math:`\pi` তড়িৎস্পন্দন বা পালস ক্যালিব্রেট করুন।
es_un: Calibrar pulsos :math:`\pi` en cada qubit en el sistema simulado.
fr_fr: Calibrer des implusions :math:`\pi` sur chaque qubit dans le système simulé.
ko_kr: 시뮬레이션되는 시스템 속의 각 큐비트에 대한 :math:`\pi` 펄스들을 조정한다.
pt_br: Calibrar :math:` \pi ` pulsos em cada qubit no sistema simulado.
ta_in: ஒவ்வொரு குறும்படத்தின் ஒவ்வொரு குறும்படத்திலும் கலந்து :math:` \pi ` pulses.

source: Observe cross-resonance oscillations when driving qubit 1 with target qubit 0.
bn_bn: লক্ষ্য কিউবিট 0 দিয়ে কিউবিট 1 চালানোর সময় ক্রস-অনুরণন দোলনগুলি পর্যবেক্ষণ করুন।
es_un: Observar oscilaciones de resonancia cruzada al controlar el qubit 1 con el qubit objetivo 0.
fr_fr: Observer les oscillations de résonance croisée lorsque vous agissez sur le qubit 1 avec le qubit 0 comme cible.
ko_kr: 목표 큐비트 0을 사용하여 큐비트 1을 구동할 때의 교차-공진 진동을 관측한다.
pt_br: Observar oscilações de ressonância cruzada ao conduzir o qubit 1 para o qubit de destino 0.
ta_in: இலக்கு குவிட் 0 உடன் குவிட் 1 ஐ ஓட்டும்போது குறுக்கு-அதிர்வு அலைவுகளை கவனிக்கவும்.

source: The Introduction outlines the concepts and flow of this notebook.
bn_bn: ভূমিকা এই নোটবুকের ধারণা এবং প্রবাহের রূপরেখা দেয়।
es_un: La Introducción describe los conceptos y el flujo de este cuaderno.
fr_fr: L'introduction présente les concepts et le flux de ce bloc-notes.
id_id: Pengantar menguraikan konsep dan alur dari notebook ini.
ko_kr: 소개에는 이 노트북의 개념과 플로우가 요약되어 있다.
pt_br: A Introdução descreve os conceitos e o fluxo deste notebook.
ta_in: அறிமுகம் இந்த நோட்புக்கின் கருத்துகள் மற்றும் ஓட்டத்தை கோடிட்டுக்காட்டுகிறது.

source: 1. Introduction
bn_bn: ১. ভূমিকা
es_un: 1. Introducción
id_id: 1. Pengantar
ko_kr: 1. 소개
pt_br: 1. Introdução
ta_in: 1. அறிமுகம்

source: The main sections proceed as follows.
bn_bn: নিম্নরূপে প্রধান বিভাগগুলি বর্ণনা করা হয়েছে।
es_un: Las secciones principales proceden de la siguiente manera.
fr_fr: Les sections principales se présentent comme suit.
id_id: Bagian utama dilanjutkan sebagai berikut.
ko_kr: 중요 섹션은 다음과 같이 진행된다.
pt_br: As principais seções seguem-se da seguinte maneira.
ta_in: முக்கிய பிரிவுகள் பின்வருமாறு தொடர்கின்றன.

source: Section 3: Duffing oscillator model
bn_bn: বিভাগ ৩: Duffing অসিলেটর (দোলক) মডেল
es_un: Sección 3: Modelo de oscilador de Duffing
fr_fr: Section 3: Modèle d'oscillateur de Duffing
id_id: Bagian 3: Model osilator Duffing
ko_kr: 섹션 3: 더핑 진동자 (Duffing oscillator) 모델
pt_br: Seção 3: Modelo de oscilador de Duffing
ta_in: பிரிவு 3: டஃபிங் ஆஸிலேட்டர் மாதிரி

source: To simulate a physical system, it is necessary to specify a model. In this notebook, we will model superconducting qubits as a collection of *Duffing oscillators*. The model is specified in terms of the following parameters:
bn_bn: একটি বাহ্যিক সিস্টেম অনুকরণ করার জন্য, একটি মডেল নির্দিষ্ট করা প্রয়োজন। এই নোটবুকে, আমরা সুপারকন্ডাক্টিং কিউবিটসকে *ডাফিং অসিলেটর* এর সংগ্রহ হিসাবে মডেল করব। মডেলটি নিম্নলিখিত পরামিতিগুলির ক্ষেত্রে নির্দিষ্ট করা হয়েছে:
es_un: Para simular un sistema físico, es necesario especificar un modelo. En este cuaderno, modelaremos qubits superconductores como una colección de *osciladores Duffing*. El modelo se especifica en términos de los siguientes parámetros:
fr_fr: Pour simuler un système physique, il est nécessaire de spécifier un modèle. Dans ce notebook, nous allons modéliser les qubits supraconducteurs comme une collection d'*oscillateurs Duffing*. Le modèle est spécifié en fonction des paramètres suivants :
id_id: Untuk mensimulasikan sistem fisik, diperlukan untuk menentukan suatu model. Dalam notebook ini, kita akan memodelkan qubit superkonduktor sebagai koleksi dari * Duffing oscillators *. Model ditentukan oleh syarat-syarat dari parameter berikut:
ko_kr: 실제 시스템을 시뮬레이션하려면 모델을 지정해야 한다. 이 노트북에서는 *Duffing oscillator* 들의 컬렉션으로서 초전도 (superconducting) 큐비트를 모델링한다. 모델은 다음 매개 변수에 따라 지정된다.
pt_br: Para simular um sistema físico é necessário especificar um modelo. Neste notebook, iremos modelar qubits supercondutores como uma coleção de *osciladores de Duffing*. O modelo é especificado em termos dos seguintes parâmetros:
ta_in: ஒரு உடல் அமைப்பை உருவகப்படுத்த, ஒரு மாதிரியைக் குறிப்பிடுவது அவசியம். இந்த நோட்புக்கில், மாதிரி சூப்பர் கண்டக்டிங் க்விட்களை *Duffing oscillators* தொகுப்பாக காண்போம். பின்வரும் அளவுருக்களின் அடிப்படையில் மாதிரி குறிப்பிடப்பட்டுள்ளது:

source: Each Duffing oscillator is specified by a frequency :math:`\nu`, anharmonicity :math:`\alpha`, and drive strength :math:`r`, which result in the Hamiltonian terms:
bn_bn: প্রতিটি ডাফিং অসিলেটর একটি ফ্রিকোয়েন্সি দ্বারা নির্ধারিত হয় :math:`\nu`, anharmonicity :math:`\alpha`, এবং ড্রাইভ শক্তি :math:`r`, যার ফলে হ্যামিল্টোনিয়ান শর্তাবলী:
es_un: Cada oscilador de Duffing es especificado por una frecuencia :math:`\nu`, una anarmonicidad :math:`\alpha`, y una fuerza de dirección (drive) :math:`r`, que resultan en los términos Hamiltonianos:
fr_fr: Chaque oscillateur Duffing est spécifié par une fréquence :math:`\nu`, anharmonicité :math:`\alpha`, et amplitude :math:`r`, qui se traduit par les termes Hamiltoniens :
id_id: Setiap osilator Duffing dispesifikasikan oleh frekuensi :math:`\nu `, anharmonisitas :math:` \alpha `, dan kekuatan drive :math:` r `, yang menghasilkan istilah Hamiltonian:
ko_kr: 각각의 Duffing oscillator는 주파수 :math:`\nu`, 비조화성 :math:`\alpha`, 드라이브 강도 :math:`r` 로 명시되어 있으며, 이로 인한 해밀토니안은 다음과 같다.
pt_br: Cada oscilador de Duffing é especificado por uma frequência :math:`\nu`, anarmonicidade :math:`\alpha` e força :math:`r`, que resultam nos termos Hamiltonianos:
ta_in: ஒவ்வொரு டஃபிங் ஆஸிலேட்டரும் ஒரு அதிர்வெண் மூலம் குறிப்பிடப்படுகிறது :math: `\nu`, அன்ஹார்மோனிசிட்டி :math: ` \ ஆல்பா`, மற்றும் இயக்கி வலிமை :math: `r`, இதன் விளைவாக ஹாமில்டோனிய சொற்கள்:

source: where :math:`D(t)` is the signal on the drive channel for the qubit, and :math:`a^\dagger` and :math:`a` are, respectively, the creation and annihilation operators for the qubit. Note that the drive strength :math:`r` sets the scaling of the control term, with :math:`D(t)` assumed to be a complex and unitless number satisfying :math:`|D(t)| \leq 1`.
bn_bn: যেখানে: গণিত: `ডি (টি)` কিউবিটের জন্য ড্রাইভ চ্যানেলে সংকেত, এবং :math`a^\dagger` এবং :math:`a` যথাক্রমে, কিউবিটের জন্য সৃষ্টি এবং বিনাশ অপারেটর । লক্ষ্য করুন যে ড্রাইভ শক্তি :math;`r` নিয়ন্ত্রণ শব্দটির স্কেলিং সেট করে, :math:`D(t)` একটি জটিল এবং এককবিহীন সংখ্যা :math:`|D(t)| \leq 1` কে সন্তুষ্ট করে বলে মনে করে।
es_un: donde :math:`D(t)` es la señal en el canal de dirección para el qubit, y :math:`a^\dagger` y :math:`a` son, respectivamente, los operadores de creación y aniquilación para el qubit. Ten en cuenta que la fuerza de dirección :math:`r` establece la escala del término de control, con :math:`D(t)` se asume que es un número complejo y sin unidades que satisface :math:`|D(t)| \leq 1`.
fr_fr: où :math:`D(t)` est le signal sur le canal de commande pour le qubit, et :math:`a^\dagger` et :math:`a` sont, respectivement, les opérateurs de création et d'annihilation pour le qubit. Notez que l'amplitude :math:`r` définit la mise à l'échelle du terme de contrôle, avec :math:`D(t)` supposé être un nombre complexe et sans unité satisfaisant :math:`|D(t)| \leq 1`.
ko_kr: 여기서 :math:`D(t)` 는 큐비트에 대한 드라이브 채널의 신호이고, :math:`a^\dagger` 와 :math:`a` 는 각각 큐비트에 대한 생성과 소멸 연산자이다. 드라이브 강도 :math:`r` 은 제어 항의 크기를 설정하는데, 이 때 :math:`D(t)` 는 복소이고 단위가 없으며, :math:`|D(t)| \leq 1` 의 조건을 만족하는 수라고 가정되는 점에 유의하라.
pt_br: onde :math:`D(t)` é o sinal no canal de transmissão do qubit, e :math:`a^\dagger` e :math:`a` são, respectivamente, os operadores de criação e aniquilação do qubit. Observe que a força de transmissão :math:`r` define o tamanho do termo de controle, com :math:`D(t)` assumido por ser um número complexo e sem unidade satisfatória com :math:`|D(t)| \leq 1`.
ta_in: எங்கே:math: `D(t)` என்பது குவிட்டிற்கான டிரைவ் சேனலில் உள்ள சமிக்ஞையாகும், மேலும்:math: `a ^\dagger` மற்றும்:math:`a` ஆகியவை முறையே, குவிட்டிற்கான உருவாக்கம் மற்றும் நிர்மூலமாக்கல் ஆபரேட்டர்கள் . இயக்கி வலிமை:math: `r` கட்டுப்பாட்டு காலத்தின் அளவை அமைக்கிறது, இதனுடன் :math:`D(t) `ஒரு சிக்கலான மற்றும் அலகு இல்லாத எண்ணாக திருப்தி அளிக்கிறது :math:` |D(t) | \leq 1`.

source: A coupling between a pair of oscillators :math:`(l,k)` is specified by the coupling strength :math:`J`, resulting in an exchange coupling term:
bn_bn: একজোড়া অসিলেটর :math:`(l,k)` এর মধ্যে একটি কাপলিং কাপলিং স্ট্রং :math:`J` দ্বারা নির্দিষ্ট করা হয়, যার ফলে এক্সচেঞ্জ কাপলিং টার্ম হয়:
es_un: Un acoplamiento entre un par de osciladores :math:`(l,k)` se especifica mediante la fuerza de acoplamiento :math:`J`, lo que da como resultado un término de acoplamiento de intercambio:
fr_fr: Un couplage entre une paire d'oscillateurs :math:`(l, k)` est spécifié par la force de couplage :math:`J`, résultant en un terme de couplage d'échange:
ko_kr: 한 쌍의 진동자 :math:`(l,k)` 사이의 결합은 결합 강도 :math:`J` 에 의해 지정되어 교환 결합 항을 생성한다:
pt_br: Um acoplamento entre um par de osciladores :math:`(l,k)` é especificado pela força de acoplamento :math:`J`, resultando em um termo de acoplamento das trocas:
ta_in: ஒரு ஜோடி ஆஸிலேட்டர்களுக்கு இடையில் ஒரு இணைப்பு:math: `(l,k)` இணைப்பு வலிமையால் குறிப்பிடப்படுகிறது:math: `J`, இதன் விளைவாக பரிமாற்ற இணைப்பு கால:

source: where the subscript denotes which qubit the operators act on.
bn_bn: যেখানে সাবস্ক্রিপ্ট নির্দেশ করে কোন কিউবিটের উপর অপারেটররা কাজ করে।
es_un: donde el subíndice denota en qué qubit actúan los operadores.
fr_fr: où l'indice indique sur quel qubit les opérateurs agissent.
ko_kr: 여기서 아래 첨자는 연산자가 어느 큐비트에 적용되는지를 표시한다.
pt_br: onde o subscript denota em qual qubit os operadores atuam.
ta_in: ஆபரேட்டர்கள் எந்த குவிட்டில் செயல்படுகிறார்கள் என்பதை சந்தா குறிக்கிறது.

source: Additionally, for numerical simulation, it is necessary to specify a cutoff dimension; the Duffing oscillator model is *infinite dimensional*, and computer simulation requires restriction of the operators to a finite dimensional subspace.
bn_bn: উপরন্তু, সংখ্যাসূচক সিমুলেশনের জন্য, একটি কাটঅফ মাত্রা নির্দিষ্ট করা প্রয়োজন; ডাফিং অসিলেটর মডেল হল *অসীম মাত্রিক*, এবং কম্পিউটার সিমুলেশনের জন্য অপারেটরদের একটি সীমিত মাত্রিক সাবস্পেসে সীমাবদ্ধতা প্রয়োজন।
es_un: Además, para la simulación numérica, es necesario especificar una dimensión de corte; el modelo del oscilador de Duffing es de *dimensión infinita*, y una simulación por computadora requiere de la restricción de los operadores a un subespacio de dimensión finita.
fr_fr: De plus, pour la simulation numérique, il est nécessaire de spécifier une dimension de coupure ; le modèle d'oscillateur de Duffing est de *dimension infinie *, et la simulation par ordinateur nécessite une restriction des opérateurs à un sous-espace de dimension finie.
ko_kr: 추가적으로, 수치 시뮬레이션의 경우 컷오프 차원을 지정해야 한다. Duffing oscillator 모델은 *무한 차원* 이며, 컴퓨터 시뮬레이션은 유한 차원의 부분공간에 대한 연산자들의 제한을 필요로 한다.
pt_br: Além disso, para simulação numérica, é necessário especificar uma dimensão de corte; o modelo do oscilador de Duffing é de *infinito dimensional* e a simulação do computador requer restrição dos operadores a um subespaço dimensional finito.
ta_in: கூடுதலாக, எண் உருவகப்படுத்துதலுக்கு, வெட்டு பரிமாணத்தைக் குறிப்பிடுவது அவசியம்; டஃபிங் ஆஸிலேட்டர் மாதிரி *infinite dimensional* ஆகும், மேலும் கணினி உருவகப்படுத்துதலுக்கு ஆபரேட்டர்களை ஒரு வரையறுக்கப்பட்ட பரிமாண துணைவெளிக்கு கட்டுப்படுத்த வேண்டும்.

source: **In the code:** We will define a model of the above form for two coupled qubits using the helper function ``duffing_system_model``.
bn_bn: **কোডে:** আমরা হেল্পার ফাংশন ``duffing_system_model`` ব্যবহার করে দুই জোড়া কিউবিটের জন্য উপরের ফর্মের একটি মডেল সংজ্ঞায়িত করব।
es_un: **En el código:** Definiremos un modelo de la forma anterior para dos qubits acoplados usando la función auxiliar ``duffing_system_model``.
fr_fr: **Dans le code:** Nous allons définir un modèle de la forme ci-dessus pour deux qubits couplés à l'aide de la fonction ``duffing_system_model``.
id_id: ** Dalam kode: ** Kita akan mendefinisikan sebuah model dari bentuk di atas untuk dua qubits yang digabungkan menggunakan fungsi pembantu ` ` duffing_system_system_model ` `.
ko_kr: ** 코드에서:** ``duffing_system_model`` 이라는 헬퍼 함수를 사용하여 두 개의 결합된 큐비트에 대해 위의 양식을 가진 모델을 정의할 것이다.
pt_br: **No código:** Definiremos um modelo do formato acima para dois qubits acoplados usando a função auxiliar ``duffing_system_model``.
ta_in: **In the code:** ' 'duffing_system_model' ' என்ற உதவி செயல்பாட்டைப் பயன்படுத்தி இரண்டு இணைந்த குவிட்டுகளுக்கு மேற்கண்ட படிவத்தின் மாதிரியை வரையறுப்போம்.

source: Section 4: :math:`\pi`-pulse calibration using Ignis
bn_bn: বিভাগ ৪ঃ ইগ্নিস ব্যবহার করে :math:`\pi` - তড়িৎস্পন্দন বা পালস ক্রমাঙ্কন (ক্যালিব্রেশন)
es_un: Sección 4: calibración de pulso :math:`\pi` usando Ignis
fr_fr: Section 4: :math:`\pi`-impulsion calibration en utilisant Ignis
id_id: Bagian 4: :math:` \pi `-kalibrasi pulsa menggunakan Ignis
pt_br: Seção 4: :math:`\pi`-pulse calibração usando Ignis
ta_in: பகுதி 4: :math:` \pi ` -இக்னிஸைப் பயன்படுத்தி துடிப்பு அளவுத்திருத்தம்

source: Once the model is defined, we will calibrate :math:`\pi`-pulses on each qubit. A :math:`\pi`-pulse is defined as a pulse on the drive channel of a qubit that “flips” the qubit; i.e. that takes the ground state to the first excited state, and the first excited state to the ground state.
bn_bn: একবার মডেলটি সংজ্ঞায়িত হয়ে গেলে, আমরা :math:`\pi`-পালস প্রতিটি কিউবিটে ক্যালিব্রেট করব। :math:`\pi` -তড়িৎস্পন্দন বা পালসকে একটি কিউবিট এর ড্রাইভ চ্যানেলে একটি পালস হিসেবে সংজ্ঞায়িত করা হয় যা কিউবিটকে‘ ফ্লিপ ’করে; অর্থাত এটি গ্রাউন্ড স্টেটকে প্রথম উত্তেজিত অবস্থায় নিয়ে যায় এবং প্রথম উত্তেজিত অবস্থা গ্রাউন্ড স্টেটে নিয়ে যায়।
es_un: Una vez definido el modelo, calibraremos pulsos :math:`\pi` en cada qubit. Un pulso :math:`\pi` se define como un pulso en el canal de dirección de un qubit que “voltea” el qubit; es decir, lleva el estado fundamental al primer estado excitado y el primer estado excitado al estado fundamental.
fr_fr: Une fois le modèle défini, nous calibrons :math:`\pi`-pulse sur chaque qubit. Une :math:`\pi`-pulse est définie comme une impulsion sur le canal de commande d'un qubit qui "inverse" le qubit ; c'est-à-dire qui échange l’état fondamental et le premier état excité.
id_id: Setelah model ini didefinisikan, kita akan mengkalibrasi :math:` \pi `-pulsa di setiap qubit. Sebuah :math:` \pi `-pulse didefinisikan sebagai pulsa pada saluran drive dari qubit yang "membalik" qubit; yaitu yang mengambil keadaan dasar untuk keadaan tereksitasi pertama, dan keadaan tereksitasi pertama ke keadaan dasar.
ko_kr: 모델이 정의되고 나면 각 큐비트에 적용될 :math:`\pi` 펄스를 보정할 것이다. :math:`\pi` 펄스는 큐비트를 "뒤집는" (바닥 상태를 첫번째 들뜬 상태로 바꾸거나, 첫번째 들뜬 상태를 바닥 상태로 바꾸는) 큐비트의 드라이브 채널에 대한 펄스로 정의된다.
pt_br: Uma vez que o modelo for definido, calibraremos :math:`\pi`-pulses em cada qubit. Um :math:`\pi`-pulse é definido como um pulso no canal de condução de um qubit que "vira" o qubit; Isso leva o estado fundamental ao primeiro estado excitado, e ao primeiro estado excitado até o estado fundamental.
ta_in: ஒரு முறை மாதிரி வரையறுக்கப்பட்டால், நாம் :math:`\pi `-ஒவ்வொரு குவிட்டிலும் துடிப்பு வகைகள். A :math:`\pi`-துடிப்பு என்பது ஒரு குவிட்டின் டிரைவ் சேனலில் ஒரு துடிப்பு என வரையறுக்கப்படுகிறது, அது குவிட்டை“புரட்டுகிறது”; அதாவது, அது நிலத்தடி நிலையை முதல் உற்சாகமான நிலையை, முதல் உற்சாகமான நிலையை தரை நிலையை கொண்டு செல்கிறது.

source: We will experimentally find a :math:`\pi`-pulse for each qubit using the following procedure:
bn_bn: আমরা পরীক্ষামূলকভাবে নিম্নলিখিত পদ্ধতি ব্যবহার করে প্রতিটি কিউবিটের জন্য :math:`\pi` -pulse খুঁজে পাব:
es_un: Experimentalmente encontraremos un pulso :math:`\pi` para cada qubit usando el siguiente procedimiento:
fr_fr: Nous trouverons expérimentalement une impulsion :math:` \pi` pour chaque qubit à l'aide de la procédure suivante:
ko_kr: 다음 절차를 사용하여 각 큐비트에 대해 :math:`\pi` 펄스를 실험적으로 찾을 것이다.
pt_br: Vamos encontrar, experimentalmente, um :math:`\pi`-pulse para cada qubit utilizando o seguinte procedimento:
ta_in: பின்வரும் நடைமுறையைப் பயன்படுத்தி ஒவ்வொரு குவிட்டிற்கும் ஒரு:math: `\pi`-துடிப்பு:

source: A fixed pulse shape is set - in this case it will be a Gaussian pulse.
bn_bn: একটি নির্দিষ্ট পালস আকৃতি সেট করা হয় - এই ক্ষেত্রে এটি একটি গাউসিয়ান পালস হবে।
es_un: Se establece una forma de pulso fija; en este caso, será un pulso Gaussiano.
fr_fr: Une forme d'impulsion fixe est définie-dans ce cas, il s'agit d'une impulsion gaussienne.
ko_kr: 고정 펄스 형상이 설정되는데, 이 경우에는 Gaussian 펄스가 될 것이다.
pt_br: Uma forma de pulso fixa é definida - neste caso, será um pulso Gaussiano.
ta_in: ஒரு நிலையான துடிப்பு வடிவம் அமைக்கப்பட்டுள்ளது - இந்த விஷயத்தில் அது காஸியன் துடிப்பு இருக்கும்.

source: A sequence of experiments is run, each consisting of a Gaussian pulse on the qubit, followed by a measurement, with each experiment in the sequence having a subsequently larger amplitude for the Gaussian pulse.
bn_bn: পরীক্ষাগুলির একটি ক্রম চালানো হয়, প্রত্যেকটিই কিউবিটে একটি গাউসিয়ান পালস নিয়ে গঠিত, তারপরে একটি পরিমাপ, ক্রমের প্রতিটি পরীক্ষায় পরবর্তীতে গাউসিয়ান পালসের জন্য বৃহত্তর বিস্তার রয়েছে।
es_un: Se ejecuta una secuencia de experimentos, cada uno de los cuales consta de un pulso Gaussiano en el qubit, seguido de una medición, y cada experimento de la secuencia tiene una amplitud posteriormente mayor para el pulso Gaussiano.
fr_fr: Une séquence d'expériences est exécutée, chacune composée d'une impulsion gaussienne sur le qubit, suivie d'une mesure, avec chaque expérience dans la séquence ayant une amplitude plus grande que l'expérience précédente pour le pulse gaussien.
ko_kr: 각각 큐비트에 대해 이전의 실험보다 더 큰 진폭을 가진 Gaussian 펄스로 구성되는 일련의 실험이 실행되고 측정된다.
pt_br: Uma sequência de experimentos é executada, cada um consistindo de um pulso Gaussiano no qubit, seguido de uma medida, com cada experimento na sequência tendo uma amplitude maior para o pulso Gaussiano.
ta_in: சோதனைகளின் வரிசை இயக்கப்படுகிறது, ஒவ்வொன்றும் குவிட்டில் ஒரு காஸியன் துடிப்பு கொண்டது, அதைத் தொடர்ந்து ஒரு அளவீடு செய்யப்படுகிறது, ஒவ்வொரு சோதனையிலும் வரிசையில் காஸியன் துடிப்புக்கு பெரிய வீச்சு உள்ளது.
