Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/09_pulse_simulator_duffing_model.po
Languages: bn_bn, es_un, fr_fr, id_id, ko_kr, pt_br, ta_in

source: The measurement data is fit, and the pulse amplitude that completely flips the qubit is found (i.e. the :math:`\pi`-pulse amplitude).
bn_bn: পরিমাপ তথ্য উপযুক্ত, এবং পালস বিস্তার যা পুরোপুরি কিউবিটকে উল্টে দেয় (যেমন: :math:`\pi`-পালস প্রশস্ততা)
es_un: Los datos de medición se ajustan y se encuentra la amplitud de pulso que invierte completamente el qubit (es decir, la amplitud del pulso :math:`\pi`).
fr_fr: Les données de mesure sont interpolées et l'amplitude d'impulsion qui inverse complètement le qubit est trouvée (c'est-à-dire l'amplitude du :math:`\pi`-pulse).
ko_kr: 측정 데이터를 분석해 큐비트를 완전히 뒤집는 펄스 진폭을 (:math:`\pi` 펄스 진폭을) 찾는다.
pt_br: Os dados de medição são adequados e a amplitude de pulso que transforma completamente o qubit é encontrada (ou seja, amplitude :math:`\pi`-pulse).
ta_in: அளவீட்டுத் தரவு பொருத்தமானது, மேலும் குவிட்டை முழுவதுமாக புரட்டுகின்ற துடிப்பு வீச்சு காணப்படுகிறது (அதாவது :math: `\pi`-pulse amplitude).

source: **In the code:** Using Ignis we will construct ``Schedule`` objects for the above experiments, then fit the data to find the :math:`\pi`-pulse amplitudes.
bn_bn: **কোডে:** ইগনিস ব্যবহার করে আমরা উপরের পরীক্ষাগুলির জন্য ``Schedule`` অবজেক্ট তৈরি করব, তারপর :math:`\pi` -pulse বিস্তার খুঁজে বের করার জন্য ডেটা ফিট করব।
es_un: **En el código:** Usando Ignis construiremos objetos ``Schedule`` para los experimentos anteriores, luego ajustaremos los datos para encontrar las amplitudes de pulso :math:`\pi`.
fr_fr: **Dans le code:** En utilisant Ignis, nous allons construire des objets ``Schedule`` pour les tests ci-dessus, puis ajuster les données pour trouver les amplitudes de :math:`\pi`-impulsion.
id_id: ** Dalam kode: ** Menggunakan Ignis kita akan menyusun ` ` Schedule ` ` object untuk percobaan di atas, maka sesuai dengan data untuk menemukan amplitudo pulsa :math:` \pi `.
ko_kr: **코드에서:** 이그니스를 사용해 위의 실험들에 대한 ``Schedule`` 객체를 구축하고 데이터를 분석하여 :math:`\pi` 펄스 진폭들을 찾을 것이다.
pt_br: **No código:** usando Ignis, vamos construir o objeto ``Schedule`` para os experimentos acima e ajustar os dados para encontrar as amplitudes :math:`\pi`-pulse.
ta_in: **In the code:** இக்னிஸைப் பயன்படுத்தி மேலே உள்ள சோதனைகளுக்கு ``Schedule`` பொருள்களை உருவாக்குவோம், பின்னர் :math: `\pi`-துடிப்பு பெருக்கங்களைக் கண்டறிய தரவைப் பொருத்துவோம்.

source: Section 5: Cross-resonance oscillations
bn_bn: বিভাগ ৫: ক্রস-অণুরণন দোলন
es_un: Sección 5: Oscilaciones de resonancia cruzada
fr_fr: Section 5: Oscillations de résonance croisée
id_id: Section 5: Osilasi Cross-resonance
ko_kr: 섹션 5: 교차-공진 진동
pt_br: Seção 5: Oscilações de ressonância cruzada
ta_in: பகுதி 5: குறுக்கு-அதிர்வு ஊசலாட்டங்கள்

source: Once the :math:`\pi`-pulses are calibrated, we will simulate the effects of cross-resonance driving on qubit :math:`1` with target qubit :math:`0`. This means that we will drive qubit :math:`1` at the frequency of qubit :math:`0`, with the goal of observing that the trajectory and oscillations of qubit :math:`0` *depends* on the state of qubit :math:`1`. This phenomenon provides a basis for creating two-qubit *controlled* gates. Note: This section requires the calibration of the :math:`\pi`-pulse in Section 4.
bn_bn: একবার :math:`\pi`- তড়িৎস্পন্দনের (পালসের) ক্রমাঙ্কন (ক্যালিব্রেশন) হয়ে গেলে, আমরা লক্ষ্য (টার্গেট) কিউবিট :math:`0` সহ কিউবিট :math:`1` -এর উপর ক্রস-অণুরণন ড্রাইভিং এর প্রভাবগুলি সিমুলেট করব। এর মানে হল যে আমরা কিউবিট :math:`0`-এর কম্পাঙ্কে কিউবিট :math:`1` চালিত (ড্রাইভ) করব, সঙ্গে পর্যবেক্ষণের লক্ষ্য হল যে কিউবিট :math:`1`-এর মান বা অবস্থার উপর কিউবিট :math:`0`-এর গতিপথ এবং দোলনগুলি *নির্ভর করে*। এই ঘটনাটি দুই-কিউবিট *নিয়ন্ত্রিত* যুক্তিবর্তনীগুলি (গেইট) তৈরির জন্য একটি বেসিস বা ভিত্তি প্রদান করে। টীকাঃ এই বিভাগে বিভাগ ৪-এর মধ্যে :math:`\pi`-তড়িৎস্পন্দন বা পালসের ক্রমাঙ্কন (ক্যালিব্রেশন) করা প্রয়োজন।
es_un: Una vez calibrados los pulsos :math:`\pi`, simularemos los efectos de la conducción por resonancia cruzada en el qubit :math:`1` con el qubit :math:`0` como objetivo. Esto significa que conduciremos el qubit :math:`1` a la frecuencia del qubit :math:`0`, con el objetivo de observar que la trayectoria y las oscilaciones del qubit :math:`0` *dependen* del estado del qubit :math:`1`. Este fenómeno proporciona una base para la creación de puertas *controladas* de dos qubits. Nota: Esta sección requiere la calibración de pulsos :math:`\pi` en la Sección 4.
fr_fr: Une fois que les :math:`\pi`-impulsions sont calibrées, nous allons simuler les effets de la résonance croisée en conduisant sur le qubit :math:`1` avec le qubit cible :math:`0`. Cela signifie que nous allons conduire le qubit :math:`1` à la fréquence du qubit :math:`0`, dans le but d'observer que la trajectoire et les oscillations de qubit :math:`0` *dépendent* de l'état du qubit :math:`1`. Ce phénomène fournit une base pour créer des portes à deux qubits *contrôlées*. Note: Cette section nécessite l'étalonnage de la :math:`\pi`-impulse dans la Section 4.
id_id: Setelah :math:`\ pi`-pulsa dikalibrasi, kita akan mensimulasikan efek dari pergerakan resonansi silang pada qubit :math:`1` dengan target qubit :math:`0`. Ini berarti kita akan menjalankan qubit :math:`1` pada frekuensi qubit :math:` 0`, dengan tujuan mengamati bahwa lintasan dan osilasi qubit :math:`0` * bergantung * pada status qubit :math:`1`. Fenomena ini memberikan dasar untuk membuat gerbang dua qubit *terkontrol *. Catatan: Bagian ini memerlukan kalibrasi :math:`\ pi`-pulsa di Bagian 4.
ko_kr: :math:`\pi`-펄스들이 교정되면, 타겟 큐비트 :math:`0` 를 통해 큐비트 :math:`1` 에 교차-공명 효과를 시뮬레이션을 할 것이다. 이는 큐비트 :math:`1` 의 상태에 따라 *달라지는* 큐비트 :math:`0` 의 궤적과 진동을 관찰하는 것을 목표로, 큐비트 :math:`0` 의 주파수로 큐비트 :math:`1` 을 구동한다는 의미이다. 이 현상은 두-큐비트 *제어* 게이트들을 생성하는 기저를 제공한다. 참고: 이 섹션은 섹션 4의 :math:`\pi`-펄스의 교정을 필요로 한다.
pt_br: Uma vez que os :math:`\pi`-pulses forem calibrados, vamos simular os efeitos da ressonância cruzada de acionamento no qbit :math:`1` com alvo no qubit :math:`0`. Isso significa que vamos acionar o qubit :math:`1` na frequência do qubit :math:`0`, com o objetivo de observar que as trajetórias e oscilações do qubit :math:`0` *dependem* do estado do qubit :math:`1`. Este fenômeno fornece a base para a criação de portas *controladas* para dois qubits. Nota: Esta seção requer a calibração do :math:`\pi`-pulse na Seção 4.
ta_in: ஒரு முறை :math: `\pi`-துடிப்பு வகைகள் அளவீடு செய்யப்பட்டவுடன், குயிட்: கணிதத்தில் குறுக்கு-அதிர்வு ஓட்டுதலின் விளைவுகளை நாங்கள் உருவகப்படுத்துவோம் :math:`1` இலக்கு குவிட் :math:`0`. இதன் பொருள் என்னவென்றால், குவிட் :math: `1`, குவிட் அதிர்வெண்ணில் :math:`0`, குவிட்டின் பாதை மற்றும் ஊசலாட்டங்கள் :math:`0` *நிலையைப் பொறுத்தது* குவிட் :math:`1`. இந்த நிகழ்வு இரண்டு-குவிட் *கட்டுப்படுத்தப்பட்ட* வாயில்களை உருவாக்குவதற்கான அடிப்படையை வழங்குகிறது. குறிப்பு: இந்த பிரிவுக்கு :math: அளவுத்திருத்தம் தேவைப்படுகிறது: பிரிவு 4 இல் `\pi`-துடிப்பு.

source: To observe cross-resonance driving, we will use experiments very similar to the :math:`\pi`-pulse calibration case:
bn_bn: ক্রস-অনুরণন ড্রাইভিং পর্যবেক্ষণ করার জন্য, আমরা পরীক্ষণগুলি :math:`\pi` -পালস ক্রমাঙ্কন ক্ষেত্রের অনুরূপ ব্যবহার করব:
es_un: Para observar la conducción por resonancia cruzada, usaremos experimentos muy similares al caso de calibración de pulso :math:`\pi`:
fr_fr: Pour observer la conduite en résonance croisée, nous utiliserons des expériences très similaires à celles utilisées pour calibrer le :math:`\pi`-pulse:
ko_kr: 교차-공명 구동을 관찰하기 위해 :math:`\pi` 펄스 보정 실험과 비슷한 실험들을 활용할 것이다:
pt_br: Para observar a ressonância cruzada, usaremos experimentos muito semelhantes aos do caso de calibração :math:`\pi`-pulse:
ta_in: குறுக்கு-அதிர்வு ஓட்டுதலைக் கவனிக்க, :math: `\pi`-துடிப்பு அளவுத்திருத்த வழக்கு:

source: Initially, qubit :math:`1` is either left in the ground state, or is driven to its first excited state using the :math:`\pi`-pulse found in Section 4.
bn_bn: প্রাথমিকভাবে, কিউবিট : math:`1` হয় গ্রাউন্ড স্টেটে রেখে দেওয়া হয়, অথবা বিভাগ 4 এ পাওয়া: math:` \ pi`-pulse ব্যবহার করে তার প্রথম উত্তেজিত অবস্থায় চালিত হয়।
es_un: Inicialmente, el qubit :math:`1` se deja en el estado fundamental o se conduce a su primer estado excitado usando el pulso :math:`\pi` que se encuentra en la Sección 4.
fr_fr: Initialement, le qubit :math:`1` est soit laissé dans son état fondamental, ou bien conduit vers son premier état excité en utilisant le :math:`\pi`-pulse trouvé dans la Section 4.
ko_kr: 처음에는, 큐비트 :math:`1` 은 바닥 상태에 남아있던가, 아니면 섹션 4의 :math:`\pi` 펄스를 사용해 첫 번째 들뜬 상태에 올라가게 된다.
pt_br: Inicialmente, o qubit :math:`1` é deixado no estado fundamental, ou é conduzido ao primeiro estado excitado usando o :math:`\pi`-pulse encontrado na Seção 4.
ta_in: ஆரம்பத்தில், க்விட்:math: `1` என்பது நிலத்தடி நிலையில் விடப்படுகிறது, அல்லது பிரிவு 4 இல் காணப்படும்:math:` \pi`-துடிப்பு பயன்படுத்தி அதன் முதல் உற்சாகமான நிலைக்கு இயக்கப்படுகிறது.

source: A sequence of experiments is run, each consisting of a Gaussian pulse on qubit :math:`1` driven at the frequency of qubit :math:`0`, followed by a measurement of both qubits, with each experiment of the sequence having a subsequently larger amplitude for the Gaussian pulse.
bn_bn: পরীক্ষাগুলির একটি ক্রম চালানো হয়, যার প্রত্যেকটিতে একটি গাউসিয়ান পালস থাকে যা কিউবিটে :math:`1` চালিত হয়, যার ফ্রিকোয়েন্সি :math:`0` পরীক্ষণগুলির একটি ক্রম চালানো হয়, প্রত্যেকটিই কিউবিটে একটি গাউসিয়ান পালস নিয়ে গঠিত, তারপরে একটি পরিমাপ, ক্রমের প্রতিটি পরীক্ষায় পরবর্তীতে গাউসিয়ান পালসের জন্য বৃহত্তর বিস্তার রয়েছে।
es_un: Se ejecuta una secuencia de experimentos, cada uno de los cuales consta de un pulso Gaussiano en el qubit :math:`1` dirigido a la frecuencia del qubit :math:`0`, seguido de una medición de ambos qubits, y cada experimento de la secuencia tiene subsecuentemente una mayor amplitud para el pulso Gaussiano.
fr_fr: Une séquence d'expériences est exécutée, chacune composée d'une impulsion gaussienne sur le qubit :math:`1` effectuée à la fréquence du qubit :math:`0`, suivie d'une mesure, avec chaque expérience dans la séquence ayant une amplitude plus grande que l'expérience précédente pour le pulse gaussien.
ko_kr: 각각 큐비트에 대해 이전의 실험보다 더 큰 진폭을 가지고, 큐비트 :math:`0` 의 주파수를 가지며, 큐비트 :math:`1` 에 대해 구동되는 Gaussian 펄스로 구성되는 일련의 실험이 실행되고 측정된다.
pt_br: Uma sequência de experimentos é executada: cada um consiste em um pulso gaussiano no qubit :math:`1` conduzido pela frequência do qubit :math:`0`, seguido pela medição de ambos os qubits, com cada experimento - subsequentemente - tendo uma amplitude maior para o pulso gaussiano.
ta_in: சோதனைகளின் வரிசை இயக்கப்படுகிறது, ஒவ்வொன்றும் குவிட் மீது காஸியன் துடிப்பு கொண்டது:math: `1` குவிட் அதிர்வெண்ணில் இயக்கப்படுகிறது:math:` 0`, அதைத் தொடர்ந்து இரண்டு குவிட்களின் அளவீடு, வரிசையின் ஒவ்வொரு பரிசோதனையும் ஒரு பின்னர் காஸியன் துடிப்புக்கான பெரிய வீச்சு.

source: **In the code:** Functions for defining the experiments and visualizing the data are constructed, including a visualization of the trajectory of the target qubit on the Bloch sphere.
bn_bn: **কোডে:** পরীক্ষা -নিরীক্ষা সংজ্ঞায়িত করার জন্য এবং ডেটা ভিজ্যুয়ালাইজ করার জন্য ফাংশনগুলি তৈরি করা হয়েছে, যার মধ্যে ব্লোচ গোলকের উপরে টার্গেট কিউবিটের গতিপথের একটি ভিজ্যুয়ালাইজেশন রয়েছে।
es_un: **En el código:** Se construyen funciones para definir los experimentos y visualizar los datos, incluida una visualización de la trayectoria del qubit objetivo en la esfera de Bloch.
fr_fr: **Dans le code:** les fonctions de définition des tests et de visualisation des données sont construites, y compris une visualisation de la trajectoire du qubit cible sur la sphère de Bloch.
id_id: ** Dalam kode: ** Fungsi untuk mendefinisikan percobaan dan memvisualisasikan data yang dibangun, termasuk visualisasi dari lintasan target qubit pada bola Bloch.
ko_kr: **코드에서:** 실험들을 정의하고 데이터를 시각화하는 함수들을 구축하는데, 이에는 블로흐 구면에서 목표 큐비트의 궤적을 시각화하는 함수를 포함한다.
pt_br: **No código:** Funções para definir os experimentos e visualizar os dados são construídas, incluindo a visualização da trajetória do qubit alvo na esfera de Bloch.
ta_in: **In the code:** சோதனைகளை வரையறுப்பதற்கும் தரவைக் காட்சிப்படுத்துவதற்கும் செயல்பாடுகள் கட்டமைக்கப்படுகின்றன, இதில் ப்ளொச் கோளத்தில் இலக்கு குவிட்டின் பாதையின் காட்சிப்படுத்தல் அடங்கும்.

source: 2. Imports
bn_bn: ২. ইম্পোর্টসমূহ
es_un: 2. Importaciones
fr_fr: 2. Importations
id_id: 2. Mengimpor
ko_kr: 2. 가져오기
pt_br: 2. Importações
ta_in: 2. இறக்குமதி

source: This notebook makes use of the following imports.
bn_bn: এই নোটবুক নিম্নলিখিত ইম্পোর্টগুলি ব্যবহার করে।
es_un: Este cuaderno hace uso de las siguientes importaciones.
fr_fr: Ce bloc-notes utilise les importations suivantes.
id_id: Notebook ini membuat penggunaan impor berikut.
ko_kr: 이 노트북은 다음과 같은 import를 사용합니다.
pt_br: Este notebook faz uso das importações a seguir.
ta_in: இந்த நூல் பின்வரும் இறக்குமதியின் பயன்பாடு செய்கிறது.

source: Import qiskit libraries for working with ``pulse`` and calibration:
bn_bn: ``pulse`` এবং ক্রমাঙ্কনের (ক্যালিব্রেশন) সাথে কাজ করার জন্য কিস্কিট (Qiskit) লাইব্রেরি ইম্পোর্ট বা আনীত করুনঃ
es_un: Importar las librerías de Qiskit para trabajar con ``pulse`` y calibración:
fr_fr: Importer des bibliothèques qiskit pour travailler avec ``pulse`` et calibration:
id_id: Impor pustaka qiskit untuk bekerja dengan ` ` pulse ` ` dan kalibrasi:
ko_kr: ``pulse``및 보정에 대한 작업을 위해 qiskit 라이브러리를 가져온다.
pt_br: Importar bibliotecas do qiskit para trabalhar com ``pulse`` e calibração:
ta_in: ``pulse`` மற்றும் அளவுத்திருத்தத்துடன் பணிபுரிய qiskit நூலகங்களை இறக்குமதி செய்க:

source: Imports for qiskit pulse simulator:
bn_bn: কিস্কিট (Qiskit) তড়িৎস্পন্দন বা পালস সিমুলেটরের জন্য ইম্পোর্ট বা আনীত সমূহঃ
es_un: Importaciones para el simulador de pulsos de Qiskit:
fr_fr: Imports pour le simulateur d'impulsion qiskit:
id_id: Impor untuk simulator pulsa qiskit:
ko_kr: Qiskit 펄스 시뮬레이터 가져오기:
pt_br: Importação para simulador de qiskit pulse:
ta_in: Qiskit துடிப்பு சிமுலேட்டருக்கான இறக்குமதி:

source: 3. Duffing oscillator system model
bn_bn: 3. ডাফিং অসিলেটর সিস্টেম মডেল
es_un: 3. Modelo de sistema de oscilador de Duffing
fr_fr: 3. Modèle du système d'oscillateur Duffing
id_id: 3. Model sistem osilator Duffing
ko_kr: 3. 더핑 진동자 (Duffing oscillator) 시스템 모델
pt_br: 3. Modelo de sistema de oscilator de Duffing
ta_in: 3. டஃபிங் ஆஸிலேட்டர் சிஸ்டம் மாடல்

source: An object representing a model for a collection of Duffing oscillators can be constructed using the ``duffing_system_model`` function. Here we construct a :math:`2` Duffing oscillator model with cutoff dimension :math:`3`.
bn_bn: ডাফিং (Duffing) দোলকসমূহের (অসিলেটর) সংগ্রহের জন্য একটি মডেলের প্রতিনিধিত্বকারী একটি অবজেক্ট ``duffing_system_model`` ফাংশনটি ব্যবহার করে গঠিত হতে পারে। এখানে আমরা কাটঅফ মাত্রা :math:`3` র সাথে একটি :math:`2` ডাফিং (Duffing) দোলক (অসিলেটর) মডেল গঠন করব।
es_un: Se puede construir un objeto que representa un modelo para una colección de osciladores Duffing usando la función ``duffing_system_model``. Aquí construimos un modelo de oscilador :math:`2` Duffing con dimensión de corte :math:`3`.
fr_fr: Un objet représentant un modèle pour une collection d'oscillateurs Duffing peut être construit en utilisant la fonction ``duffing_system_model``. Ici, nous construisons un modèle d'oscillateur :math:`2` Duffing avec la dimension de coupe :math:`3`.
id_id: Sebuah objek yang mewakili sebuah model untuk kumpulan osilator Duffing dapat dibangun dengan menggunakan fungsi ``duffing_system_system_model``. Di sini kita membangun sebuah model osilator :math:`2` Duffing dengan cutoff dimensi :math:`3`.
ko_kr: Duffing 진동자 모음에 대한 모델을 나타내는 객체는 ``duffing_system_model`` 함수를 사용하여 구축할 수 있다. 여기서는 컷오프 (cutoff) 차원 :math:`3` 을 가진 :math:`2` Duffing 진동자 모델을 구축한다.
pt_br: Um objeto que representa um modelo para uma coleção de osciladores de Duffing pode ser construído utilizando a função ``duffing_system_model``. Aqui nós construímos um modelo de oscilação de Duffing :math: com a dimensão de corte :math:`3`.
ta_in: டஃபிங் ஆஸிலேட்டர்களின் தொகுப்பிற்கான ஒரு மாதிரியைக் குறிக்கும் ஒரு பொருள் ``duffing_system_model`` செயல்பாட்டைப் பயன்படுத்தி உருவாக்கப்படலாம். இங்கே நாம் ஒரு :math:`3` வெட்டு பரிமாணத்துடன் :math:`2` டஃபிங் ஆஸிலேட்டர் மாதிரி உருவாக்குகிறோம்.

source: The function ``duffing_system_model`` returns a ``PulseSystemModel`` object, which is a general object for storing model information required for simulation with the ``PulseSimulator``.
bn_bn: ``duffing_system_model`` ফাংশনটি একটি ``PulseSystemModel`` অবজেক্টকে ফেরত দেয়, যা ``PulseSimulator`` টির সাথে সিমুলেশনের জন্য প্রয়োজনীয় মডেল তথ্য সংরক্ষণের জন্য একটি সাধারণ (জেনারেল) অবজেক্ট।
es_un: La función ``duffing_system_model`` devuelve un objeto ``PulseSystemModel``, que es un objeto general para almacenar la información del modelo requerido para la simulación con el ``PulseSimulator``.
fr_fr: La fonction ``duffing_system_model`` retourne un objet ``PulseSystemModel``, qui est un objet général pour stocker les informations de modèle requises pour la simulation avec le ``PulseSimulator``.
id_id: Fungsi ``duffing_system_model`` mengembalikan objek ``PulseSystemModel``, yang merupakan objek umum untuk menyimpan informasi model yang diperlukan untuk simulasi dengan ``PulseSimulator``.
ko_kr: ``duffing_system_model`` 함수는 ``PulseSystemModel`` 객체를 반환하는데, 이는 ``PulseSimulator`` 를 포함한 시뮬레이션에 필요한 모델 정보를 저장하는 일반적인 객체이다.
pt_br: A função ``duffing_system_model`` retorna um objeto ``PulseSystemModel``, que é um objeto geral para armazenar informações de modelo necessárias para simulação com o ``PulseSimulator``.
ta_in: ``duffing_system_model`` செயல்பாடு ஒரு ``PulseSystemModel`` பொருளைத் தருகிறது, இது ``PulseSimulator`` உடன் உருவகப்படுத்துதலுக்குத் தேவையான மாதிரி தகவல்களைச் சேமிப்பதற்கான பொதுவான பொருளாகும்.

source: 4 Calibrating :math:`\pi` pulses on each qubit using Ignis
bn_bn: 4 ইগনিস ব্যবহার করে প্রতিটি কিউবিটে :math:`\pi` তড়িৎস্পন্দন বা পালস ক্যালিব্রেট করা
es_un: 4 Calibración de pulsos :math:`\pi` en cada qubit usando Ignis
fr_fr: 4 Calibrant :math:`\pi` impulsions sur chaque qubit en utilisant Ignis
id_id: 4 Kalibrasi pulsa :math:`\pi ` di setiap qubit menggunakan Ignis
ko_kr: 4. Ignis를 이용하여 각각의 큐비트에 대한 :math:`\pi` 의 펄스들을 보정하기
pt_br: 4 Usando Ignis em cada qubit para calibrar pulsos :math:`\pi`
ta_in: 4 அளவுத்திருத்தம் இக்னிஸைப் பயன்படுத்தி ஒவ்வொரு குவிட்டிலும் :math:`\pi` துடிப்பு வகைகள்

source: As described in the introduction, we now calibrate :math:`\pi` pulses on each qubit in ``two_qubit_model``. The experiments in this calibration procedure are known as *Rabi experiments*, and the data we will observe are known as *Rabi oscillations*.
bn_bn: ভূমিকাতে বর্ণিত হিসাবে, আমরা এখন গণনা করি :math:`\pi` তড়িৎস্পন্দন বা পালস প্রতিটি কিউবিট - এ ``two_qubit_model``। এই ক্রমাঙ্কন পদ্ধতির পরীক্ষাগুলি *Rabi experiments* নামে পরিচিত, এবং আমরা যে তথ্যগুলি পর্যবেক্ষণ করব তা *Rabi experiments* নামে পরিচিত।
es_un: Como se describe en la introducción, ahora calibramos pulsos :math:`\pi` en cada qubit en ``two_qubit_model``. Los experimentos en este procedimiento de calibración se conocen como *experimentos Rabi*, y los datos que observaremos se conocen como *oscilaciones Rabi*.
fr_fr: Comme décrit dans l'introduction, nous calibrons maintenant :math:`\pi` impulsion sur chaque qubit dans ``two_qubit_model``. Les tests de cette procédure d'étalonnage sont connus sous le nom de *tests Rabi*, et les données que nous observerons sont connues sous le nom d'*oscillations Rabi*.
id_id: Seperti yang dijelaskan dalam pengenalan, kita sekarang mengkalibrasi pulsa :math:` \pi ` pada setiap qubit dalam ``two_qubit_model``. Eksperimen dalam prosedur kalibrasi ini dikenal sebagai *Eksperimen Rabi*, dan data yang akan kita amati dikenal sebagai *osilasi Rabi*.
ko_kr: 도입부에 설명된 바와 같이, 이제 ``two_qubit_model`` 에서 :math:`\pi` 펄스를 보정할 수 있다. 이 교정 절차에서의 실험은 *Rabi experiments* 으로 알려져 있고, 관찰할 데이터는 *Rabi oscillations* 로 알려져 있다.
pt_br: Como descrito na introdução, agora calibramos pulse :math:`\pi` em cada qubit em ``two_qubit_model``. Os experimentos neste procedimento de calibração são conhecidos como *experimentos Rabi* e os dados que iremos observar são conhecidos como *oscilações Rabi*.
ta_in: அறிமுகத்தில் விவரிக்கப்பட்டுள்ளபடி, இப்போது நாம் ``two_qubit_model`` இல் ஒவ்வொரு குவிட்டிலும் :math:`\pi` துடிப்பு அளவீடு செய்கிறோம் . இந்த அளவுத்திருத்த நடைமுறையில் உள்ள சோதனைகள் *Rabi experiments* என அழைக்கப்படுகின்றன, மேலும் நாம் கவனிக்கும் தரவு *Rabi oscillations* என அழைக்கப்படுகிறது.

source: 4.1 Constructing the schedules
bn_bn: 4.1 সময়সূচী তৈরি করা
es_un: 4.1 Construcción de los planificadorers
fr_fr: 4.1 Construire les plannings
id_id: 4.1 Membangun Schedule
ko_kr: 4.1 스케줄 구성하기
pt_br: 4.1 - Construindo as schedules
ta_in: 4.1 அட்டவணைகளை உருவாக்குதல்

source: We construct the schedules using the ``rabi_schedules`` function in Ignis. To do this, we need to supply an ``InstructionScheduleMap`` containing a measurement schedule.
bn_bn: আমরা ইগ্নিসে ``rabi_schedules`` ফাংশনটি ব্যবহার করে সময়সূচী (শিডিউল) গুলি গঠন করব। এইটি করতে, আমাদের একটি পরিমাপ সময়সূচী (শিডিউল) ধারণকারী একটি ``InstructionScheduleMap`` সরবরাহ করার প্রয়োজন।
es_un: Construimos los planificadores utilizando la función ``rabi_schedules`` en Ignis. Para ello, necesitamos proporcionar un ``InstructionScheduleMap`` que contenga un planificador de medición.
fr_fr: Nous construisons les plannings en utilisant la fonction ``rabi_schedules`` dans Ignis. Pour faire cela, nous devons fournir un ``InstructionScheduleMap`` contenant un planning de mesure.
id_id: Kami membangun jadwal dengan menggunakan fungsi ``rabi_schedules`` di Ignis. Untuk melakukan hal ini, kita perlu memasok ``InstructionScheduleMap`` yang berisi jadwal pengukuran.
ko_kr: Ignis의 ``rabi_schedules`` 을 사용하여 스케줄을 짤 수 있다. 이를 위해서는 측정 스케줄을 포함한 ``InstructionScheduleMap`` 을 공급해야 한다.
pt_br: Nós construímos os agendamentos utilizando a função ``rabi_schedules`` no Ignis. Para fazer isso, precisamos fornecer um ``InstructionScheduleMap`` que contém um agendamento de medição.
ta_in: இக்னிஸில் ``rabi_schedules`` செயல்பாட்டைப் பயன்படுத்தி அட்டவணைகளை உருவாக்குகிறோம். இதைச் செய்ய, அளவீட்டு அட்டவணையைக் கொண்ட ``InstructionScheduleMap`` ஐ வழங்க வேண்டும்.

source: Next, construct the Rabi schedules.
bn_bn: এরপর, রাবি (Rabi) সময়সূচী (schedules) গুলিকে তৈরি করুন।
es_un: A continuación, construye los planificadores Rabi.
fr_fr: Ensuite, construire les plannings Rabi.
id_id: Selanjutnya, menyusun jadwal Rabi.
ko_kr: 다음으로, 라비 (Rabi) 스케줄을 구성한다.
pt_br: Em seguida, construa os agendamentos dos Rabi.
ta_in: அடுத்து, ராபி அட்டவணைகளை உருவாக்குங்கள்.
