Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/09_pulse_simulator_duffing_model.po
Languages: bn_bn, es_un, fr_fr, id_id, ko_kr, pt_br, ta_in

source: The ``Schedule``\ s in ``rabi_schedules`` correspond to experiments to generate Rabi oscillations on both qubits in parallel. Each experiment consists of a Gaussian pulse on the qubits of a given magnitude, followed by measurement.
bn_bn: ``rabi_schedules``-এর ``Schedule``\ s সমানভাবে উভয় কিউবিটগুলির উপর রাবি (Rabi) দোলনগুলি উৎপন্ন করতে পরীক্ষণ (এক্সপেরিমেন্ট) গুলির সাথে মিলে যায়। প্রতি পরীক্ষণ (এক্সপেরিমেন্ট) একটি প্রদত্ত মানের কিউবিটগুলির উপর একটি গাউসিয়ান (Gaussian) তড়িৎস্পন্দন বা পালস দিয়ে গঠিত, পরিমাপ দ্বারা অনুসারিত।
es_un: Los ``Schedule``\ s en ``rabi_schedules`` corresponden a experimentos para generar oscilaciones Rabi en ambos qubits en paralelo. Cada experimento consiste en un pulso Gaussiano en los qubits de una magnitud dada, seguido de una medición.
fr_fr: Les ``Schedule``\ s dans ``rabi_schedules`` correspondent à des tests pour générer des oscillations Rabi sur les deux qubits en parallèle. Chaque test consiste en une impulsion Gaussienne d'une magnitude donnée sur les qubits, suivie par la mesure.
id_id: ``Schedule``\ dalam ``rabi_schedules`` sesuai dengan eksperimen untuk menghasilkan osilasi Rabi pada kedua qubit secara paralel. Setiap percobaan terdiri dari pulsa Gaussian pada qubit dari besaran yang diberikan, diikuti dengan pengukuran.
ko_kr: ``rabi_schedules`` 의 ``Schedule`` 들은 병렬 구성의 큐비트들에 모두 라비 진동을 생성하는 실험에 해당한다. 각 실험은 주어진 크기의 큐비트에 대한 Gaussian 펄스로 구성되고, 뒤이어 측정이 이루어진다.
pt_br: As ``Schedule``\ s em ``rabi_schedules`` correspondem a experimentos para gerar oscilações Rabi em ambos os qubits em paralelo. Cada experimento consiste em um pulse Gaussiano nos qubits em uma determinada magnitude, seguido pela medição.
ta_in: ``rabi_schedules`` இல் உள்ள ``Schedule``\ s, இரண்டு குவிட்டுகளிலும் இணையாக ரபி அலைவுகளை உருவாக்கும் சோதனைகளுக்கு ஒத்திருக்கிறது. ஒவ்வொரு பரிசோதனையும் கொடுக்கப்பட்ட அளவின் குவிட்ஸில் காஸியன் துடிப்பைக் கொண்டுள்ளது, அதைத் தொடர்ந்து அளவீடு செய்யப்படுகிறது.

source: For example:
bn_bn: উদাহরণরূপে:
es_un: Por ejemplo:
fr_fr: Par exemple:
id_id: Sebagai contoh:
ko_kr: 예를 들어:
pt_br: Por exemplo:
ta_in: உதாரணமாக:

source: 4.2 Simulate the Rabi experiments
bn_bn: 4.2 Rabi পরীক্ষণের (এক্সপেরিমেন্টের) অনুকরণ
es_un: 4.2 Simulación de los experimentos de Rabi
fr_fr: 4.2 Simuler les tests de Rabi
id_id: 4.2 Simulasi eksperimen Rabi
ko_kr: 4.2 Rabi 실험 시뮬레이션
pt_br: 4.2 Simular os experimentos de Rabi
ta_in: 4.2 ரபி சோதனைகளை உருவகப்படுத்துங்கள்

source: To simulate the Rabi experiments, assemble the ``Schedule`` list into a qobj. When assembling, pass the ``PulseSimulator`` as the backend.
bn_bn: রাবি (Rabi) পরীক্ষণ (এক্সপেরিমেন্ট) গুলিকে সিমুলেট করতে, ``Schedule`` তালিকাটি একটি কোয়ান্টাম অবজেক্টে (Qobj) একত্রিত করুন। একত্রিত করার সময়, ব্যাকএন্ড রূপে ``PulseSimulator`` পাস করুন।
es_un: Para simular los experimentos Rabi, ensambla la lista de ``Schedule`` en un qobj. Al ensamblarla, pasa el ``PulseSimulator`` como el backend.
fr_fr: Pour simuler les tests de Rabi, assemblez la liste ``Schedule`` dans un qobj. Lors de l'assemblage, passez le ``PulseSimulator`` comme backend.
id_id: Untuk mensimulasikan eksperimen Rabi, susun daftar ``Schedule`` ke dalam qobj. Saat menyusun, berikan ``PulseSimulator`` sebagai backend.
ko_kr: 라비 실험을 시뮬레이션하기 위해서는 ``Schedule`` 목록을 qobj로 조립하고, 조립할 때에는 ``PulseSimulator`` 를 백엔드로 사용하여야 한다.
pt_br: Para simular os experimentos Rabi, monte a lista ``Schedule`` em um qobj. Quando estiver montando, passe o ``PulseSimulator`` como backend.
ta_in: ரபி சோதனைகளை உருவகப்படுத்த, ``Schedule`` பட்டியலை ஒரு qobj இல் இணைக்கவும். கூடியிருக்கும்போது, ​​``PulseSimulator`` பின்தளத்தில் அனுப்பவும்.

source: Here, we want to use local oscillators with frequencies automatically computed from Duffing model Hamiltonian.
bn_bn: এখানে, আমরা ডাফিং (Duffing) মডেল হ্যামিল্টোনিয়ান থেকে স্বয়ংক্রিয়ভাবে গণনা করা কম্পাঙ্ক গুলি সহ স্থানীয় দোলক (অসিলেটর) গুলি ব্যবহার করতে চাই।
es_un: Aquí, queremos utilizar osciladores locales con frecuencias calculadas automáticamente a partir del modelo Hamiltoniano de Duffing.
fr_fr: Ici, nous voulons utiliser des oscillateurs locaux avec des fréquences calculées automatiquement à partir du modèle Duffing Hamiltonian.
id_id: Di sini, kita ingin menggunakan osilator lokal dengan frekuensi yang dihitung secara otomatis dari model Duffing Hamiltonian.
ko_kr: 여기서는 Duffing 모델 Hamiltonian에서 자동으로 계산되는 주파수들을 갖는 로컬 진동자들을 사용할 것이다.
pt_br: Aqui, queremos utilizar osciladores locais com frequências calculadas automaticamente a partir do modelo de Duffing Hamiltoniano.
ta_in: இங்கே, டஃபிங் மாதிரி ஹாமில்டோனியனிடமிருந்து தானாகக் கணக்கிடப்பட்ட அதிர்வெண்களுடன் உள்ளூர் ஊசலாட்டங்கள் பயன்படுத்த விரும்புகிறோம்.

source: Run the simulation using the simulator backend.
bn_bn: সিমুলেটর ব্যাকএন্ডটিকে ব্যবহার করে সিমুলেশনটি চালান।
es_un: Ejecuta la simulación usando el simulador de backend.
fr_fr: Exécuter la simulation en utilisant le backend du simulateur.
id_id: Jalankan simulasi dengan menggunakan backend simulator.
ko_kr: 시뮬레이터 백엔드를 사용하여 시뮬레이션을 실행한다.
pt_br: Execute a simulação usando o simulator backend.
ta_in: சிமுலேட்டர் பின்தளத்தில் பயன்படுத்தி உருவகப்படுத்துதலை இயக்கவும்.

source: 4.3 Fit and plot the data
bn_bn: 4.3 ডেটার উপযুক্তিকরণ (ফিট) এবং লেখচিত্র অঙ্কন
es_un: 4.3 Ajustar y graficar los datos
fr_fr: 4.3 Ajuster et tracer les données
id_id: 4.3 Menyesuaikan dan memplot data
ko_kr: 4.3 데이터 구성 및 시각화
pt_br: 4.3 Ajustar e plotar os dados
ta_in: 4.3 தரவைப் பொருத்தி சதி செய்யுங்கள்

source: Next, we use ``RabiFitter`` in Ignis to fit the data, extract the :math:`\pi`-pulse amplitude, and then plot the data.
bn_bn: এরপর, আমরা তথ্যটি (ডেটা) উপযুক্ত (ফিট) করতে ইগ্নিসে ``RabiFitter`` ব্যবহার করব, :math:`\pi`- তড়িৎস্পন্দন বা পালস বিস্তারটি নিষ্কাশন করব, এবং তারপরে তথ্যটি (ডেটা) লেখচিত্র অঙ্কন করব।
es_un: A continuación, usamos ``RabiFitter`` de Ignis para ajustar los datos, extraer la amplitud del pulso :math:`\pi`, y luego graficar los datos.
fr_fr: Ensuite, nous utilisons ``RabiFitter`` dans Ignis pour ajuster les données, extraire l'amplitude des impulsions :math:`\pi`, puis tracer les données.
id_id: Selanjutnya, kita menggunakan ``RabiFitter`` di Ignis agar sesuai dengan data, ekstrak amplitudo :math:`\pi `, dan kemudian plot data.
ko_kr: 다음으로는 Ignis의 ``RabiFitter`` 를 사용하여 데이터를 분석하고 :math:`\pi` 펄스 진폭을 추출하며, 데이터를 도식화할 것이다.
pt_br: Em seguida, usamos ``RabiFitter`` no Ignis para ajustar os dados, extraímos a amplitude :math:`\pi`-pulse, e então plotamos os dados.
ta_in: அடுத்து, தரவைப் பொருத்துவதற்கு இக்னிஸில் ``RabiFitter`` ஐப் பயன்படுத்துகிறோம், :math: `\pi`- துடிப்பு வீச்சு பிரித்தெடுத்து, பின்னர் தரவைத் திட்டமிடவும்.

source: Plotted is the averaged IQ data for observing each qubit. Observe that here, each qubit oscillates between the 0 and 1 state. The amplitude at which a given qubit reaches the peak of the oscillation is the desired :math:`\pi`-pulse amplitude.
bn_bn: অঙ্কিত লেখচিত্র হলো প্রতি কিউবিটের পর্যবেক্ষণের জন্য আইকিউ (IQ) তথ্যের (ডেটা) গড়। পর্যবেক্ষণ করুন যে এখানে, প্রতি কিউবিট ০ এবং ১ মান বা অবস্থার মধ্যে স্পন্দিত হয়। প্রত্যাশিত :math:`\pi`-তড়িৎস্পন্দন বা পালসের বিস্তার হল যে বিস্তারে একটি প্রদত্ত কিউবিট দোলনের শীর্ষে পৌছায়।
es_un: Se grafican los datos IQ promediados para observar cada qubit. Observa que aquí, cada qubit oscila entre el estado 0 y 1. La amplitud a la que un qubit dado alcanza el pico de la oscilación es la amplitud de un pulso :math:`\pi` deseada.
fr_fr: Ce qui est tracée est la moyenne des données IQ pour l'observation de chaque qubit. Observer qu'ici, chaque qubit oscille entre l'état 0 et 1. L'amplitude à laquelle un qubit donné atteint le sommet de l'oscillation est l'amplitude d'impulsion :math:`\pi` souhaitée.
id_id: Plot adalah data IQ rata-rata untuk mengamati setiap qubit. Perhatikan bahwa di sini, setiap qubit berosilasi antara keadaan 0 dan 1. Amplitudo di mana qubit tertentu mencapai puncak osilasi adalah yang diinginkan amplitudo pulsa :math:`\pi`.
ko_kr: 그래프의 데이터는 각 큐비트를 관찰했을 때 나온 평균화된 IQ 데이터이다. 여기서 각 큐비트는 0 과 1 상태 사이를 오간다. 주어진 큐비트가 진동의 정점에 도달했을 때의 진폭이 바로 찾고 있었던 :math:`\pi` 펄스의 진폭이다.
pt_br: São plotados os dados médios do IQ para observar cada qubit. Observe que aqui, cada qubit oscila entre o estado 0 e 1. A amplitude em que um determinado qubit atinge o pico da oscilação é a desejada amplitude :math:`\pi`-pulse.
ta_in: ஒவ்வொரு குவிட்டையும் கவனிப்பதற்கான சராசரி IQ தரவு திட்டமிடப்பட்டுள்ளது. இங்கே கவனிக்கவும், ஒவ்வொரு குவிட் 0 மற்றும் 1 நிலைக்கு இடையில் ஊசலாடுகிறது. கொடுக்கப்பட்ட குவிட் அலைவு உச்சத்தை அடையும் வீச்சு விரும்பத்தக்கது :math:`\pi`-துடிப்பு வீச்சு.

source: 5. Oscillations from cross-resonance drive
bn_bn: ৫. ক্রস-অনুরণন ড্রাইভ থেকে দোলন সমূহ
es_un: 5. Oscilaciones desde el impulso de resonancia cruzada
fr_fr: 5. Oscillations de résonance croisée de la commande
id_id: 5. Osilasi dari cross-resonance drive
ko_kr: 5. 교차-공명 드라이브로부터의 진동
pt_br: 5. Oscilações da unidade de ressonância cruzada
ta_in: 5. குறுக்கு-அதிர்வு இயக்ககத்திலிருந்து ஊசலாட்டங்கள்

source: Next, we simulate the effects of a cross-resonance drive on qubit :math:`1` with target qubit :math:`0`, observing that the trajectory and oscillations of qubit :math:`0` *depends* on the state of qubit :math:`1`.
bn_bn: এরপরে, আমরা কিউবিট :math:`1` -এর সঙ্গে লক্ষ্য (টার্গেট) কিউবিট :math:`0` -এর উপর একটি ক্রস-অণুরণন ড্রাইভের প্রভাবগুলিকে সিমুলেট করি, পর্যবেক্ষণ করা যাচ্ছে যে কিউবিট :math:`0`-এর গতিপথটি এবং দোলনগুলি কিউবিট :math:`1`-এর মান বা অবস্থার উপর *নির্ভর করে*।
es_un: A continuación, simulamos los efectos de un direccionamiento (impulso o drive) de resonancia cruzada en el qubit :math:`1` con el qubit :math:`0` como objetivo, observando que la trayectoria y las oscilaciones del qubit :math:`0` *depende* del estado del qubit :math:`1`.
fr_fr: Ensuite, nous simulons les effets de résonance croisée sur le qubit :math:`1` de commande avec le qubit cible :math:`0`, observant que la trajectoire et les oscillations du qubit :math:`0` *dépendent* de l'état du qubit :math:`1`.
id_id: Selanjutnya, kita mensimulasikan efek dari penggerak resonansi silang pada qubit :math:`1` dengan target qubit :math:`0`, mengamati bahwa lintasan dan osilasi qubit :math:`0` *bergantung* pada keadaan dari qubit :math:`1`.
ko_kr: 다음으로, 타겟 큐비트 :math:`0` 를 통해 큐비트 :math:`1` 에 교차-공명 효과를 시뮬레이션하여 큐비트 :math:`1` 의 상태에 따라 *달라지는* 큐비트 :math:`0` 의 궤적과 진동을 관찰한다.
pt_br: Em seguida, simulamos os efeitos do acionamento de ressonância cruzada no qubit :math:`1` com destino qubit :math:`0`, observando que a trajetória e oscilações do qubit :math:`0` *dependem* do estado do qubit :math:`1`.
ta_in: அடுத்து, குவிட் :math:`1` இலக்கு குவிட் :math:` 0` உடன் குறுக்கு-அதிர்வு இயக்ககத்தின் விளைவுகளை நாங்கள் உருவகப்படுத்துகிறோம், குவிட்டின் பாதை மற்றும் ஊசலாட்டங்கள் :math:`0` குவிட்டின் நிலையைப் பொறுத்தது :math:`1`.

source: **Note:** This section depends on the :math:`\pi`-pulse calibrations of Section 2.
bn_bn: **টীকাঃ** এই বিভাগটি বিভাগ ২ -এর :math:`\pi`- তড়িৎস্পন্দন বা পালস ক্রমাঙ্কন (ক্যালিব্রেশন) গুলির উপর নির্ভর করে।
es_un: **Nota:** Esta sección depende de las calibraciones del pulso :math:`\pi` de la Sección 2.
fr_fr: **Remarque:** Cette section dépend des calibrations des impulsions :math:`\pi` de la section 2.
id_id: ** Note:** Bagian ini tergantung pada kalibrasi :math:` \pi `-kalibrasi pulsa Bagian 2.
ko_kr: **참고:** 이 섹션은 섹션 2의 :math:`\pi`-펄스 교정에 따라 달라진다.
pt_br: **Nota:** Esta seção depende das calibrações do :math:`\pi`-pulso da Seção 2.
ta_in: **குறிப்பு:** இந்த பிரிவு பிரிவு 2 இன் :math:`\ பை`-துடிப்பு அளவீடுகள் பொறுத்தது.

source: 5.1 Cross-resonance ``ControlChannel`` indices
bn_bn: 5.1 ক্রস-অনুরণন ``ControlChannel`` সূচক
es_un: 5.1 Índices de ``ControlChannel`` de resonancia cruzada
fr_fr: 5.1 Indices de résonance croisée ``ControlChannel``
id_id: 5.1 Indeks ``ControlChannel '' dengan resonansi silang
ko_kr: 5.1 교차-공명 ``ControlChannel`` 인덱스
pt_br: 5.1 Índices de ressonância cruzada ``ControlChannel``
ta_in: 5.1 குறுக்கு-அதிர்வு ``ControlChannel`` குறியீடுகள்

source: Driving qubit :math:`1` at the frequency of qubit :math:`0` requires use of a pulse ``ControlChannel``. The model generating function ``duffing_system_model``, automatically sets up ``ControlChannels`` for performing cross-resonance drives between pairs of coupled qubits. The index of the ``ControlChannel`` for performing a particular cross-resonance drive is retrievable using the class method ``control_channel_index`` on the returned ``PulseSystemModel``. For example, to get the ``ControlChannel`` index corresponding to a CR drive on qubit 1 with target 0, call the function ``control_channel_index`` with the tuple ``(1,0)``:
bn_bn: কিউবিট :math:`0`-এর কম্পাঙ্কে ড্রাইভিং কিউবিট :math:`1`-এর একটি তড়িৎস্পন্দন বা পালস ``ControlChannel``-এর ব্যবহার প্রয়োজন। মডেল তৈরির ফাংশন``duffing_system_model``, এক জোড়া যুগ্ম (কাপলড) কিউবিটগুলির মধ্যে ক্রস-অনুরণন চালানোর জন্য স্বয়ংক্রিয়ভাবে ``ControlChannels`` তৈরি করে। প্রত্যাবৃত্ত ``PulseSystemModel``-এ ক্লাস পদ্ধতি ``control_channel_index`` ব্যবহার করে একটি নির্দিষ্ট ক্রস-অনুরণন ড্রাইভ সম্পাদনের জন্য ``ControlChannel``-এর সূচকটি পুনরুদ্ধারযোগ্য হয়। উদাহরণ স্বরূপ, লক্ষ্য (টার্গেট) ০ সহ কিউবিট ১-এ একটি সিআর (CR) ড্রাইভের সাথে সম্পর্কিত ``ControlChannel`` সূচক পেতে, টাপল ``(1,0)`` সহ ``control_channel_index`` ফাংশনটি কল করুনঃ
es_un: Direccionar (impulsar o driving) el qubit :math:`1` a la frecuencia del qubit :math:`0` requiere el uso de un pulso ``ControlChannel``. La función de generación de modelo ``duffing_system_model``, configura automáticamente ``ControlChannels`` para realizar controles de resonancia cruzada entre pares de qubits acoplados. El índice del ``ControlChannel`` para ejecutar un direccionamiento de resonancia cruzada en particular se puede recuperar utilizando el método de clase ``control_channel_index`` en el objeto ``PulseSystemModel`` devuelto. Por ejemplo, para obtener el índice del ``ControlChannel`` correspondiente a un direccionamiento CR en el qubit 1 con el objetivo 0, llama a la función ``control_channel_index`` con la tupla ``(1,0)``:
fr_fr: Conduire le qubit :math:`1` à la fréquence du qubit :math:`0` nécessite l'utilisation d'une impulsion ``ControlChannel``. La fonction de génération de modèles ``duffing_system_model``, configure automatiquement ``ControlChannels`` pour effectuer des résonance croisée de commandes entre des paires de qubits couplés. L'index du ``ControlChannel`` pour effectuer une résonance croisée de commande est récupérable en utilisant la méthode de classe ``control_channel_index`` sur le ``PulseSystemModel`` retourné. Par exemple, pour obtenir l'index ``ControlChannel`` correspondant à une CR de commande sur qubit 1 avec la cible 0, appeler la fonction ``control_channel_index`` avec le tuple ``(1,0)``:
id_id: Qubit :math:`1`yang berjalan pada frekuensi qubit :math:`0` memerlukan penggunaan pulsa ``ControlChannel``. Fungsi penghasil model ``duffing_system_model``, secara otomatis mengatur ``ControlChannels '' untuk melakukan penggerak resonansi silang antara pasangan qubit yang digabungkan. Indeks ``ControlChannel`` untuk menjalankan resonansi silang tertentu dapat diambil menggunakan metode kelas ``control_channel_index`` pada ``PulseSystemModel`` yang dikembalikan. Misalnya, untuk mendapatkan indeks ``ControlChannel`` yang sesuai dengan drive CR pada qubit 1 dengan target 0, panggil fungsi ``control_channel_index`` dengan tuple ``(1,0)``:
ko_kr: 큐비트 :math:`0` 의 주파수로 큐비트 :math:`1` 을 구동하려면 ``ControlChannel`` 펄스를 사용해야 한다. 모델 생성 함수 ``duffing_system_model`` 은 결합된 큐비트들 쌍 사이에 교차-공명 구동(CR drive)을 수행하는 ``ControlChannels`` 를 자동으로 설정한다. 개별적인 교차-공명 구동을 수행하는 ``ControlChannel`` 의 인덱스는 반환된 ``PulseSystemModel`` 에 클래스 메서드 ``control_channel_index`` 를 사용하여 검색할 수 있다. 예를 들어, 타겟 큐비트 0에 큐비트 1을 교차-공명 구동하는 것에 해당하는 ``ControlChannel`` 의 인덱스를 얻으려면 튜플 ``(1,0)`` 과 함께 함수 ``control_channel_index`` 를 호출하면 된다.
pt_br: Direcionar o qubit :math:`1` na frequência do qubit :math:`0` requer o uso do pulse ``ControlChannel``. O modelo que gera a função ``duffing_system_model``, configura automaticamente ``ControlChannels`` para a execução de unidades de ressonância cruzada entre pares de qubits acoplados. O índice do ``ControlChannel`` para executar uma unidade de ressonância cruzada específica é recuperável utilizando o método de classe ``control_channel_index`` no ``PulseSystemModel`` retornado. Por exemplo, para obter o índice de ``ControlChannel`` correspondente a uma unidade CR no qubit 1 com alvo 0, chame a função ``control_channel_index`` com a tupla ``(1,0)``:
ta_in: ஓட்டுநர் குவிட் :math:`1` குவிட் அதிர்வெண்ணில் :math:` 0` க்கு ஒரு துடிப்பு ``ControlChannel`` தேவைப்படுகிறது. மாதிரி உருவாக்கும் செயல்பாடு ``duffing_system_model``, ஜோடி இணைந்த குவிட்டுகளுக்கு இடையில் குறுக்கு-அதிர்வு இயக்கிகளைச் செய்வதற்கு தானாகவே `ControlChannel` அமைக்கிறது. ஒரு குறிப்பிட்ட குறுக்கு-அதிர்வு இயக்கி செய்வதற்கான ``ControlChannel`` இன் குறியீடானது, திரும்பிய ``PulseSystemModel`` இல் உள்ள ``control_channel_index`` என்ற வகுப்பு முறையைப் பயன்படுத்தி மீட்டெடுக்கப்படுகிறது. எடுத்துக்காட்டாக, இலக்கு 0 உடன் குவிட் 1 இல் CR டிரைவோடு தொடர்புடைய ``ControlChannel`` குறியீட்டைப் பெற, ``control_channel_index`` செயல்பாட்டை டூப்பிள் ``(1,0)`` உடன் அழைக்கவும்:

source: Hence, to perform a cross-resonance drive on qubit :math:`1` with target qubit :math:`0`, use ``ControlChannel(1)``. This will be made use of when constructing ``Schedule`` objects in this section.
bn_bn: অতএব, কিউবিট :math:`1` টার্গেট qubit :math:`0` এর উপর একটি ক্রস-অনুরণন চালানোর জন্য, ``ControlChannel (1)`` ব্যবহার করুন। এই বিভাগে ``Schedule`` অবজেক্ট নির্মাণের সময় এটি ব্যবহার করা হবে।
es_un: Por lo tanto, para realizar un impulso (direccionamiento o drive) de resonancia cruzada en el qubit :math:`1` con el qubit :math:`0` como objetivo, usa ``ControlChannel(1)``. Esto se utilizará al construir objetos ``Schedule`` en esta sección.
fr_fr: Ainsi, pour effectuer une résonance croisée de commande sur le qubit :math:`1` avec le qubit cible :math:`0`, utiliser ``ControlChannel(1)``. Cela sera utilisé lors de la construction d'objets ``Schedule`` dans cette section.
id_id: Oleh karena itu, untuk melakukan penggerak resonansi silang pada qubit :math:`1` dengan target qubit :math:`0`, gunakan ``ControlChannel(1)``. Ini akan digunakan saat membuat objek ``Jadwal`` di bagian ini.
ko_kr: 따라서, 타겟 큐비트 :math:`0` 로 큐비트 :math:`1` 에 교차-공명 구동을 수행하려면, ``ControlChannel(1)`` 을 사용한다. 이는 이 세션에서 ``Schedule`` 객체를 구성할 때도 사용될 것이다.
pt_br: Portanto, para realizar uma unidade de ressonância cruzada no qubit :math:`1` com alvo no qubit :math:`0`, use ``ControlChannel(1)``. Isto será utilizado quando estivermos construindo os objeto ``Schedule`` desta seção.
ta_in: எனவே, குவிட் :math:`1` இலக்கு குவிட் :math:` 0` உடன் குறுக்கு-அதிர்வு இயக்கி செய்ய, ``ControlChannel(1)`` ஐப் பயன்படுத்தவும். இந்த பிரிவில் `` Schedule`` பொருள்களை உருவாக்கும்போது இது பயன்படுத்தப்படும்.

source: 5.2 Functions to generate the experiment list, and analyze the output
bn_bn: 5.2 পরীক্ষণ (এক্সপেরিমেন্ট) তালিকা তৈরির ফাংশন, এবং আউটপুট বিশ্লেষণ
es_un: 5.2 Funciones para generar la lista de experimentos y analizar el resultado
fr_fr: 5.2 Fonctions permettant de générer la liste d'expérimentation et d'analyser la sortie
id_id: 5.2 Fungsi untuk menghasilkan daftar eksperimen, dan menganalisa keluaran
ko_kr: 5.2 실험 목록 생성 및 출력 분석하는 함수
pt_br: 5.2 Funções para gerar a lista de experimentos e analisar a saída
ta_in: 5.2 சோதனை பட்டியலை உருவாக்குவதற்கான செயல்பாடுகள் மற்றும் வெளியீட்டை பகுப்பாய்வு செய்தல்

source: First, we define a function ``cr_drive_experiments``, which, given the drive and target indices, and the option to either start with the drive qubit in the ground or excited state, returns a list of experiments for observing the oscillations.
bn_bn: প্রথমত, আমরা একটি ফাংশন ``cr_drive_experiments`` কে সংজ্ঞায়িত করি, যা ড্রাইভ এবং টার্গেট ইনডেক্স, এবং হয় ড্রাইভ কিউবিট দিয়ে গ্রাউন্ড বা উত্তেজিত অবস্থায় শুরু করার বিকল্প দেওয়া থাকলে, দোলন পর্যবেক্ষণের জন্য পরীক্ষণ (এক্সপেরিমেন্ট) এর একটি তালিকা প্রদান করে।
es_un: Primero, definimos la función ``cr_drive_experiments``, que, dados los índices de dirección (drive) y objetivo (target), y la opción de comenzar con el qubit de direccionamiento en el estado fundamental o en el estado excitado, regresa una lista de experimentos para observar las oscilaciones.
fr_fr: Tout d'abord, nous définissons une fonction ``cr_drive_experiments``, qui, étant donné la commande et les indices cibles, selon l'option de démarrer à l'état fondamental ou à l'état excité, renvoie une liste d'expériences pour observer les oscillations.
id_id: Pertama, kita mendefinisikan fungsi ``cr_drive_experiments``, yang, dengan indeks drive dan target, dan opsi untuk memulai dengan qubit drive di keadaan dasar atau tereksitasi, mengembalikan daftar eksperimen untuk mengamati osilasi.
ko_kr: 먼저, 주어진 구동 인덱스와 타겟 인덱스, 그리고 구동 큐비트가 바닥 상태 혹은 들뜬 상태에서 시작하는지에 대한 옵션을 받아 진동을 관찰하는 실험 목록을 반환하는 함수 ``cr_drive_experiments`` 를 정의한다.
pt_br: Primeiro, definimos uma função ``cr_drive_experiments``, que, dada a unidade e os índices alvo, e a opção de começar com o qubit em estado neutro ou estado de excitação, retorna uma lista de experimentos para observação das oscilações.
ta_in: முதலில், ``cr_drive_experiments`` என்ற செயல்பாட்டை வரையறுக்கிறோம், இது இயக்கி மற்றும் இலக்கு குறியீடுகளையும், தரையில் அல்லது உற்சாகமான நிலையில் இயக்கி குவிட்டிலிருந்து தொடங்குவதற்கான விருப்பத்தையும், ஊசலாட்டங்களைக் கவனிப்பதற்கான சோதனைகளின் பட்டியலைத் தருகிறது.

source: Next we create two functions for observing the data:
bn_bn: তারপর আমরা তথ্য (ডেটা) পর্যবেক্ষণের জন্য দুইটি ফাংশন তৈরি করব:
es_un: A continuación, creamos dos funciones para observar los datos:
fr_fr: Ensuite, nous créons deux fonctions pour observer les données :
ko_kr: 다음으로 데이터를 관찰하는 두 개의 함수를 작성한다.
pt_br: A seguir, criaremos duas funções para a observação dos dados:
ta_in: அடுத்து தரவைக் கவனிக்க இரண்டு செயல்பாடுகளை உருவாக்குகிறோம்:

source: ``plot_cr_pop_data`` - for plotting the oscillations between the ground state and the first excited state
bn_bn: ``plot_cr_pop_data`` - গ্রাউন্ড স্টেট এবং প্রথম উত্তেজিত দশার বা অবস্থার মধ্যে দোলন লেখচিত্র অঙ্কনের জন্য
es_un: ``plot_cr_pop_data`` - para graficar las oscilaciones entre el estado fundamental y el primer estado excitado
fr_fr: ``plot_cr_pop_data`` - pour tracer les oscillations entre l'état fondamental et le premier état excité
ko_kr: ``plot_cr_pop_data`` - 바닥 상태와 첫번째 들뜬 상태 사이의 진동을 그리기 위해
pt_br: ``plot_cr_pop_data`` - para plotar as oscilações entre o estado fundamental e o primeiro estado excitado
ta_in: `` plot_cr_pop_data`` - தரை நிலைக்கும் முதல் உற்சாகமான மாநிலத்திற்கும் இடையிலான ஊசலாட்டங்களைத் திட்டமிடுவதற்கு

source: ``plot_bloch_sphere`` - for viewing the trajectory of the target qubit on the bloch sphere
bn_bn: ``plot_bloch_sphere`` - bloch গোলকের উপর লক্ষ্য কিউবিটের গতিপথ দেখার জন্য
es_un: ``plot_bloch_sphere`` - para ver la trayectoria del qubit objetivo en la esfera de Bloch
fr_fr: ``plot_bloch_sphere`` - pour voir la trajectoire du qubit cible sur la sphère de bloch
ko_kr: ``plot_bloch_sphere`` - 목적 큐비트의 블로흐 구 상에서의 궤적을 보기 위해
pt_br: ``plot_bloch_sphere`` - para ver a trajetória do qubit alvo na esfera do bloch
ta_in: `` plot_bloch_sphere`` - ப்ளொச் கோளத்தில் இலக்கு குவிட்டின் பாதையைப் பார்ப்பதற்காக

source: 5.3 Drive qubit 1 to observe CR oscillations on qubit 0
bn_bn: 5.3 কিউবিট ০ র উপর CR দোলন সমূহকে পর্যবেক্ষণ করতে কিউবিট ১ কে চালনা করুন
es_un: 5.3 Direccionar el qubit 1 para observar las oscilaciones CR en el qubit 0
fr_fr: 5.3 Commande du qubit 1 pour observer les oscillations CR sur le qubit 0
id_id: 5.3 Drive qubit 1 untuk mengamati osilasi CR pada qubit 0
ko_kr: 5.3 큐비트 0에서의 CR 진동을 관찰하기 위해 큐비트 1을 드라이브
pt_br: 5.3 Direcione o qubit 1 para observar oscilações CR no qubit 0
ta_in: 5.3 குவிட் 0 இல் சிஆர் அலைவுகளைக் காண குவிட் 1 ஐ இயக்கவும்
