Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/09_pulse_simulator_duffing_model.po
Languages: bn_bn, es_un, fr_fr, id_id, ko_kr, pt_br, ta_in

source: Qubit 1 in the ground state
bn_bn: গ্রাউন্ড স্টেটে কিউবিট ১
es_un: Qubit 1 en el estado fundamental
fr_fr: Qubit 1 à l'état fondamental
id_id: Qubit 1 dalam keadaan dasar
pt_br: Qubit 1 no estado fundamental
ta_in: தரை நிலையில் குபிட் 1

source: First, we drive with both qubit 0 and qubit 1 in the ground state.
bn_bn: প্রথমত, আমরা গ্রাউন্ড স্টেটে থাকা কিউবিট ০ এবং কিউবিট ১ উভয়কে দিয়ে চালাবো।
es_un: Primero, direccionamos tanto con el qubit 0 como con el qubit 1 en el estado fundamental.
fr_fr: Tout d'abord, nous amenons le qubit 0 et le qubit 1 à l'état fondamental.
id_id: Pertama, kita jalankan dengan kedua qubit 0 dan qubit 1 pada keadaan dasar.
ko_kr: 첫 번째로, 큐비트 0과 큐비트 1 모두를 바닥 상태에서 드라이브 한다.
pt_br: Primeiro, orientamos o "qubit 0" e "qubit 1" para o estado neutro.
ta_in: முதலில், நாங்கள் தரை நிலையில் குவிட் 0 மற்றும் க்விட் 1 இரண்டையும் கொண்டு ஓட்டுகிறோம்.

source: Run the simulation:
bn_bn: সিমুলেশনটি চালানঃ
es_un: Ejecuta la simulación:
fr_fr: Lancer la simulation:
id_id: Jalankan simulasi:
ko_kr: 시뮬레이터 실행시키기:
pt_br: Execute a simulação:
ta_in: உருவகப்படுத்துதலை இயக்கவும்:

source: Observe that qubit 1 remains in the ground state, while excitations are driven in qubit 0.
bn_bn: উত্তেজনা বা উদ্দীপন কিউবিট ০ তে চালিত হওয়ার সময় যেন কিউবিট ১ গ্রাউন্ড স্টেটেই থাকে তা পর্যবেক্ষণ করুন।
es_un: Observa que el qubit 1 permanece en el estado fundamental, mientras que las excitaciones son impulsadas en el qubit 0.
fr_fr: Observons que le qubit 1 reste à l'état fondamental, tandis que les excitations sont amenées sur le qubit 0.
id_id: Amati bahwa qubit 1 tetap berada di keadaan dasar, sementara eksitasi didorong dalam qubit 0.
ko_kr: 큐비트 0에 여기가 구동되는 동안 큐비트 1은 여전히 바닥 상태에 있는 것을 관찰하라.
pt_br: Observe que o qubit 1 permanece no estado neutro, enquanto as excitações são conduzidas no qubit 0.
ta_in: குவிட் 1 தரை நிலையில் இருப்பதைக் கவனியுங்கள், அதே நேரத்தில் உற்சாகங்கள் குவிட் 0 இல் இயக்கப்படுகின்றன.

source: We may also observe the trajectory of qubit 0 on the Bloch sphere:
bn_bn: আমরা Bloch গোলকের উপর কিউবিট ০ এর গতিপথও পর্যবেক্ষণ করতে পারি:
es_un: También podemos observar la trayectoria del qubit 0 en la esfera de Bloch:
fr_fr: Nous pouvons également observer la trajectoire du qubit 0 sur la sphère de Bloch:
id_id: Kita mungkin juga mengamati lintasan qubit 0 di bola Bloch:
ko_kr: 또한 우리는 블로흐 구에서 0의 궤적을 관찰할 수 있다.
pt_br: Também podemos observar a trajetória do qubit 0 na esfera Bloch:
ta_in: ப்ளொச் கோளத்தில் குவிட் 0 இன் பாதையையும் நாம் கவனிக்கலாம்:

source: Qubit 1 in the first excited state
bn_bn: প্রথম উত্তেজিত দশায় বা অবস্থায় কিউবিট ১
es_un: Qubit 1 en el primer estado excitado
fr_fr: Qubit 1 dans le premier état excité
id_id: Qubit 1 dalam keadaan tereksitasi pertama
ko_kr: 첫 번째 들뜬 상태의 큐비트 1
pt_br: Qubit 1 no primeiro estado excitado
ta_in: முதல் உற்சாகமான நிலையில் கியூபிட் 1

source: Next, we again perform a CR drive qubit 1 with qubit 0 as the target, but now we start each experiment by flipping qubit 1 into the first excited state.
bn_bn: এরপরে, আমরা আবার একটি সিআর ড্রাইভ কিউবিট 1 কিউবিট 0 এর সাথে সঞ্চালন করি টার্গেট হিসাবে, কিন্তু এখন আমরা প্রথম এক্সাইটেড অবস্থায় কিউবিট 1 উল্টিয়ে প্রতিটি পরীক্ষণ শুরু করি।
es_un: A continuación, nuevamente ejecutamos un direccionamiento CR en el qubit 1 con el qubit 0 como objetivo, pero ahora comenzamos cada experimento cambiando el qubit 1 al primer estado excitado.
fr_fr: Ensuite, nous réalisons à nouveau une commande CR du qubit 1 avec le qubit 0 comme cible, mais maintenant nous commençons chaque expérience en plaçant le qubit 1 dans le premier état excité.
id_id: Selanjutnya, kita melakukan CR lagi untuk menjalankan qubit 1 dengan qubit 0 sebagai target, tapi sekarang kita memulai setiap percobaan dengan membalik qubit 1 ke dalam keadaan tereksitasi pertama.
ko_kr: 다음으로, 큐비트 0을 타겟으로 큐비트 1에 CR drive를 다시 수행하지만, 여기서는 각 실험을 큐비트 1을 첫 번째 들뜬 상태로 바꿔서 시작한다.
pt_br: Em seguida, voltamos a executar o direcionamento CR no qubit 1 com alvo no qubit 0, mas agora começamos cada experimento invertendo o qubit 1 no primeiro estado de excitação.
ta_in: அடுத்து, மீண்டும் ஒரு CR டிரைவ் குவிட் 1 ஐ குவிட் 0 உடன் இலக்காகக் கொண்டுள்ளோம், ஆனால் இப்போது ஒவ்வொரு பரிசோதனையையும் குவிட் 1 ஐ முதல் உற்சாகமான நிலைக்கு புரட்டுவதன் மூலம் தொடங்குவோம்.

source: Observe that now qubit 1 is in the excited state, while oscillations are again being driven on qubit 0, now at a different rate as before.
bn_bn: লক্ষ্য করুন যে এখন কিউবিট 1 এখন আগের মতো ভিন্ন হারে উত্তেজিত অবস্থায় আছে, যখন দোলনগুলি আবার কিউবিট 0 তে চালিত হচ্ছে।
es_un: Observa que ahora el qubit 1 está en el estado excitado, mientras que las oscilaciones están siendo impulsadas nuevamente en el qubit 0, ahora a una tasa diferente a la anterior.
fr_fr: Observons que maintenant qubit 1 est dans l'état excité, alors que les oscillations entrainent à nouveau le qubit 0, à présent avec un comportement différent du précédent.
id_id: Amati bahwa sekarang qubit 1 berada dalam keadaan tereksitasi, sementara osilasi kembali dijalankan pada qubit 0, sekarang pada tingkat yang berbeda seperti sebelumnya.
ko_kr: 이제 큐비트 0에 진동이 예전과 다른 속도로 구동되는 동안 큐비트 1이 들뜬 상태에 있는 것을 관찰하라.
pt_br: Observe que agora o qubit 1 está no estado de excitação, enquanto oscilações voltam a ser conduzidas no qubit 0, agora em uma taxa diferente da anterior.
ta_in: இப்போது குவிட் 1 உற்சாகமான நிலையில் இருப்பதைக் கவனியுங்கள், அதே நேரத்தில் ஊசலாட்டங்கள் மீண்டும் குவிட் 0 இல் இயக்கப்படுகின்றன, இப்போது முன்பு போலவே வேறு விகிதத்தில்.

source: Again, observe the trajectory of qubit 0 on the Bloch sphere:
bn_bn: আবার, Bloch গোলকের উপর কিউবিট ০ এর গতিপথ পর্যবেক্ষণ করুনঃ
es_un: Nuevamente, observa la trayectoria del qubit 0 en la esfera de Bloch:
fr_fr: Nous pouvons également observer la trajectoire du qubit 0 sur la sphère de Bloch:
id_id: Sekali lagi, amati lintasan dari qubit 0 di bola Bloch:
ko_kr: 다시, 블로흐 구에서 0의 궤적을 관찰한다.
pt_br: Novamente, observe a trajetória do qubit 0 na esfera Bloch:
ta_in: மீண்டும், ப்ளொச் கோளத்தில் குவிட் 0 இன் பாதையை கவனிக்கவும்:

source: Here we see that qubit 0 takes a *different* trajectory on the Bloch sphere when qubit 1 is in the excited state. This is what enables controlled operations between two qubits.
bn_bn: এখানে আমরা দেখতে পাচ্ছি যে যখন কিউবিট ১ উত্তেজিত দশায় বা অবস্থায় আছে কিউবিট ০ ব্লক গোলকের উপর একটি *অন্য* গতিপথ নিয়েছে । এইটাই দুইটি কিউবিটের মধ্যে নিয়ন্ত্রিত ক্রিয়াকলাপ (অপারেশন) গুলিকে সক্রিয় করে।
es_un: Aquí vemos que el qubit 0 toma una trayectoria *diferente* en la esfera de Bloch cuando el qubit 1 está en el estado excitado. Esto es lo que permite operaciones controladas entre dos qubits.
fr_fr: Ici nous voyons que le qubit 0 prend une trajectoire *différente* sur la sphère Bloch quand le qubit 1 est dans l'état excité. C'est ce qui permet des opérations contrôlées entre deux qubits.
id_id: Di sini kita melihat bahwa qubit 0 mengambil lintasan * berbeda * pada bola Bloch ketika qubit 1 berada dalam keadaan tereksitasi. Ini adalah apa yang memungkinkan operasi terkontrol antara dua qubits.
ko_kr: 여기서 우리는 큐비트 1이 들뜬 상태에 있을 때, 블로흐 구 상에서 *상이한* 궤적을 취한다는 것을 알 수 있다. 이것이 2개의 큐비트 사이의 제어된 동작을 가능하게 하는 것이다.
pt_br: Aqui vemos que o qubit 0 seguiu uma trajetória *diferente* na esfera Bloch enquanto o qubit 1 está no estado excitado. Isso é o que possibilita operações controladas entre dois qubits.
ta_in: குவிட் 1 உற்சாகமான நிலையில் இருக்கும்போது, ​​குவிட் 0 ப்ளாச் கோளத்தில் *different* பாதையை எடுக்கும் என்பதை இங்கே காண்கிறோம். இதுதான் இரண்டு குவிட்டுகளுக்கு இடையில் கட்டுப்படுத்தப்பட்ட செயல்பாடுகளை செயல்படுத்துகிறது.

source: In particular, in this tutorial we will: - Construct a model of a two qubit superconducting system. - Calibrate :math:`\pi` pulses on each qubit in the simulated system. - Observe cross-resonance oscillations when driving qubit 1 with target qubit 0.
id_id: Secara khusus, dalam tutorial ini kita akan: - Membangun sebuah model dari sistem superkonduktor dua qubit. - Kalibrasi :math:` \pi ` pulsa pada setiap qubit dalam sistem simulasi. - Mengamati osilasi cross-resonance ketika menjalankan qubit 1 dengan target qubit 0.

source: where :math:`D(t)` is the signal on the drive channel for the qubit, and :math:`a^\dagger` and :math:`a` are, respectively, the creation and annihilation operators for the qubit. Note that the drive strength :math:`r` sets the scaling of the control term, with :math:`D(t)` assumed to be a complex and unitless number satisfying :math:`|D(t)| \leq 1`. - A coupling between a pair of oscillators :math:`(l,k)` is specified by the coupling strength :math:`J`, resulting in an exchange coupling term:
id_id: dimana :math:` D (t) ` adalah sinyal pada saluran drive untuk qubit, dan :math:` a ^ \dagger ` dan :math:` a `adalah, masing-masing, operator penciptaan dan pemusnahan untuk qubit. Perhatikan bahwa kekuatan drive :math:` r ` mengatur kekuatan dari kontrol, dengan :math:` D (t) ` diasumsikan sebagai sebuah bilangan kompleks tanpa unit yang memenuhi syarat :math:` | D (t) | \leq 1 `. -Interaksi antara sepasang osilator :math:` (l, k) ` dispesifikasikan oleh kekuatan kopling :math:` J `, menghasilkan exchange coupling:

source: where the subscript denotes which qubit the operators act on. - Additionally, for numerical simulation, it is necessary to specify a cutoff dimension; the Duffing oscillator model is *infinite dimensional*, and computer simulation requires restriction of the operators to a finite dimensional subspace.
id_id: di mana subskrip menunjukkan qubit mana yang ditindaklanjuti oleh operator. - Selain itu, untuk simulasi numerik, perlu ditentukan dimensi cutoff; model osilator Duffing adalah * dimensi tak terhingga *, dan simulasi komputer memerlukan pembatasan operator ke subruang berdimensi terbatas.

source: We will experimentally find a :math:`\pi`-pulse for each qubit using the following procedure: - A fixed pulse shape is set - in this case it will be a Gaussian pulse. - A sequence of experiments is run, each consisting of a Gaussian pulse on the qubit, followed by a measurement, with each experiment in the sequence having a subsequently larger amplitude for the Gaussian pulse. - The measurement data is fit, and the pulse amplitude that completely flips the qubit is found (i.e. the :math:`\pi`-pulse amplitude).
id_id: Kami secara eksperimental akan menemukan :math:`\pi`-pulsa untuk setiap qubit menggunakan prosedur berikut: - Bentuk pulsa tetap disetel - dalam hal ini akan menjadi pulsa Gaussian. - Urutan eksperimen dijalankan, masing-masing terdiri dari pulsa Gaussian pada qubit, diikuti dengan pengukuran, dengan setiap eksperimen dalam urutan tersebut memiliki amplitudo yang lebih besar untuk pulsa Gaussian. - Data pengukuran cocok, dan amplitudo pulsa yang sepenuhnya membalik qubit ditemukan (yaitu :math:`\pi`-amplituda pulsa).

source: To observe cross-resonance driving, we will use experiments very similar to the :math:`\pi`-pulse calibration case: - Initially, qubit :math:`1` is either left in the ground state, or is driven to its first excited state using the :math:`\pi`-pulse found in Section 4. - A sequence of experiments is run, each consisting of a Gaussian pulse on qubit :math:`1` driven at the frequency of qubit :math:`0`, followed by a measurement of both qubits, with each experiment of the sequence having a subsequently larger amplitude for the Gaussian pulse.
id_id: Untuk mengamati penggerak resonansi silang, kita akan menggunakan eksperimen yang sangat mirip dengan kasu kalibrasi :math:`\pi`: - Awalnya, qubit :math:`1` dibiarkan dalam keadaan dasar, atau didorong ke keadaan tereksitasi pertama menggunakan :math:`\ pi` pulsa yang ditemukan di Bagian 4. - Urutan eksperimen dijalankan, masing-masing terdiri dari pulsa Gaussian pada qubit :math:`1` yang digerakkan pada frekuensi qubit :math:`0`, diikuti dengan pengukuran kedua qubit, dengan setiap eksperimen urutan memiliki amplitudo yang lebih besar untuk pulsa Gaussian.

source: Next we create two functions for observing the data: - ``plot_cr_pop_data`` - for plotting the oscillations between the ground state and the first excited state - ``plot_bloch_sphere`` - for viewing the trajectory of the target qubit on the bloch sphere
id_id: Selanjutnya kita membuat dua fungsi untuk mengamati data: - ``plot_cr_pop_data`` - untuk memplot osilasi antara keadaan dasar dan keadaan tereksitasi pertama - ``plot_bloch_sphere`` - untuk melihat lintasan qubit target pada bola bloch
