Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/10_pulse_simulator_backend_model.po
Languages: bn_bn, es_un, fr_fr, id_id, ko_kr, pt_br, ta_in, tr_tr

source: This page was generated from `tutorials/circuits_advanced/10_pulse_simulator_backend_model.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/circuits_advanced/10_pulse_simulator_backend_model.ipynb`__ থেকে উৎপন্ন হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/circuits_advanced/10_pulse_simulator_backend_model.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/circuits_advanced/10_pulse_simulator_backend_model.ipynb`__.
id_id: Halaman ini dibuat dari `tutorials/circuits_advanced/09_pulse_simulator_duffing_model.ipynb`__.
ko_kr: 이 페이지는 `tutorials/circuits_advanced/10_pulse_simulator_backend_model.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada a partir de `tutorials/circuits_advanced/10_pulse_simulator_backend_model.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/circuits_advanced/10_pulse_simulator_backend_model.ipynb`__ இருந்து உருவாக்கப்பட்டது.
tr_tr: Bu sayfa `tutorials/circuits_advanced/10_pulse_simulator_backend_model.ipynb`__ adresinden oluşturulmuştur.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/10_pulse_simulator_backend_model.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/10_pulse_simulator_backend_model.ipynb>`_.
id_id: Jalankan secara interaktif di `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/09_pulse_simulator_duffing_model.ipynb>`_.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/10_pulse_simulator_backend_model.ipynb>`_.
ta_in: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/10_pulse_simulator_backend_model.ipynb>`_ ஊடாடும் வகையில் இயக்கவும்.

source: Qiskit Aer: Pulse simulation of a backend model
bn_bn: Qiskit এয়ারঃ তড়িৎস্পন্দন বা পালস সিমুলেশনের ব্যাকেন্ড মডেল
es_un: Qiskit Aer: Simulación de pulso de un modelo de backend
fr_fr: Qiskit Aer: Simulation d'impulsion pour un modèle de backend
id_id: Qiskit Aer: Simulasi pulsa dari model backend
ko_kr: Qiskit Aer: 백엔드 모델의 펄스 시뮬레이션
pt_br: Qiskit Aer: Simulação de pulso de um modelo de backend
ta_in: Qiskit ஏர்: பின்தளத்தில் மாதிரியின் துடிப்பு உருவகப்படுத்துதல்
tr_tr: Qiskit Aer: Bir arkayüzey modelinin atım simülasyonu

source: This notebook shows how to use the Aer pulse simulator using a model generated from a backend. In particular, we run a Rabi experiment to find a :math:`\pi`-pulse amplitude on a model of the Armonk one qubit backend, generated from the ``FakeArmonk`` mock backend.
bn_bn: এই নোটবুকে দেখানো হয়েছে কিভাবে ব্যাকএন্ড থেকে পাওয়া একটা নকশা ব্যবহার করে এয়ার তড়িৎস্পন্দন (পালস) সিমুলেটর কাজে লাগাতে হয়। আমরা ``FakeArmonk`` নকল ব্যাকএন্ড দিয়ে বানানো আরমঙ্ক একক কিউবিট ব্যাকএন্ডের উপর একটা রবি গবেষণা চালিয়ে :math:`\pi` - তড়িৎস্পন্দন (পালস) বিস্তার নির্ণয় করবো।
es_un: Este cuaderno muestra cómo utilizar el simulador de pulso Aer utilizando un modelo generado a partir de un backend. En particular, realizamos un experimento Rabi para encontrar una amplitud de pulso :math:`\pi` en un modelo del backend Armonk de un qubit, generado a partir del backend emulado ``FakeArmonk``.
fr_fr: Ce ``notebook`` montre comment utiliser le simulateur d'impulsions Aer à l'aide d'un modèle généré à partir d'un système d'exécution (``backend``). En particulier, nous avons mené une expérience Rabi pour tester une amplitude d'impulsion :math:` \pi sur un modèle du backend Armonk à un qubit, généré à partir du backend ``FakeArmonk`` de simulation.
id_id: Notebook ini menunjukkan bagaimana menggunakan simulator pulsa Aer menggunakan model yang dibuat dari backend. Secara khusus, kita menjalankan eksperimen Rabu untuk mencari :math:`\pi`-amplitudo pulsa pada model dari Armonk backend satu qubit, dibuat dari ``FakeArmonk`` backend contoh.
ko_kr: 이 노트북은 백엔드에서 생성된 모델을 사용하여 Aer 펄스 시뮬레이터를 어떻게 사용하는지를 보여준다. 특히 우리는 `FakeArmonk` 라는 가상의 백엔드 로부터 생성된 1 큐비트 Armonk 백엔드 모델의 :math:`\pi`- 펄스 진폭을 찾기 위해 라비 실험을 진행한다.
pt_br: Este notebook mostra como usar o simulador de pulso Aer usando um modelo gerado a partir de um backend. Em particular, realizamos um experimento Rabi para encontrar uma amplitude de :math:`\pi`-pulse em um modelo Armonk de um qubit backend, gerado a partir do backend de simulação ``FakeArmonk``.
ta_in: இந்த குறிப்பேடு ஒரு பின்தளத்தில் இருந்து உருவாக்கப்பட்ட மாதிரியைப் பயன்படுத்தி ஏர் துடிப்பு சிமுலேட்டரை எவ்வாறு பயன்படுத்துவது என்பதைக் காட்டுகிறது. குறிப்பாக, ஒரு π கண்டுபிடிக்க ஒரு ரபி பரிசோதனையை நாங்கள் நடத்துகிறோம் FakeArmonk போலி பின்தளத்தில் இருந்து உருவாக்கப்படும் அர்மோங்க் 1 குவிட் பின்தளத்தில் ஒரு மாதிரியில் pi-துடிப்பு வீச்சு.குறிப்பேடுகுறிப்பேடு.
tr_tr: Bu not defteri, bir arkayüzeyden oluşturulan bir model kullanılarak Aer atım simülatörünün nasıl kullanılacağını gösterir. Özellikle, ``FakeArmonk`` taklitçi arkayüzeyinden oluşturulan Armonk bir kübit arkayüzeyinin bir modelinde bir :math:`\pi`-atım genliği bulmak için bir Rabi deneyi yürütüyoruz.

source: Table of contents
fr_fr: Table des matières
id_id: Daftar isi

source: `Imports <#imports>`__
fr_fr: ` Importations <#imports> `__
id_id: `Impor <#imports>`__

source: `Construct model from backend <#model>`__
fr_fr: `Construire le modèle depuis le backend <#model>`__
id_id: `Konstruksi model dari backend <#model>`__

source: `Run Rabi experiments and fit :math:`\pi`-pulse amplitude <#rabi>`__
fr_fr: `Lancer des expériences Rabi et s'adapter à :math:`\pi`-pulse amplitude <#rabi>`__
id_id: `menjalankan eksperimen Rabi dan mencocokkan :math:`\pi`-amplitudo pulsa <#rabi>`__

source: 1. Imports
bn_bn: ১. ইম্পোর্টসমূহ
es_un: 1. Importaciones
fr_fr: 1. Importations
id_id: 1. Mengimpor
ko_kr: 1. 가져오기
pt_br: 1. Importações
ta_in: 1. இறக்குமதி
tr_tr: 1. İçe Aktarmalar

source: Import general libraries:
bn_bn: সাধারন লাইব্রেরি গুলো ইম্পোর্ট করুনঃ
es_un: Importar bibliotecas generales:
fr_fr: Importer des bibliothèques générales:
id_id: Impor pustaka umum:
ko_kr: 일반 라이브러리 가져오기:
pt_br: Importar bibliotecas gerais:
ta_in: பொது நூலகங்களை இறக்குமதி செய்க:
tr_tr: Genel kütüphaneleri içe akrarın:

source: Import Rabi experiment generator and fitter from Ignis, and other functions for job submission:
bn_bn: কাজ (জব) জমা দেওয়ার জন্য ইগ্নিস থেকে রবি গবেষণা, ফিটার ও অন্যান্য ফাংশন ইম্পোর্ট করা হল:
es_un: Importar generador de experimentos Rabi y ajustador desde Ignis, y otras funciones para el envío de trabajos:
fr_fr: Importer le générateur d'expériences Rabi et l'ajusteur d'Ignis, ainsi que d'autres fonctions pour la soumission d'une tâche:
id_id: Impor generator eksperimen Rabi dan penyocok dari Ignis, dan fungsi lainnya untuk pengajuan pekerjaan:
ko_kr: Rabi 실험 생성기와 함수추정기를 Ignis로부터 가져오고 작업 제출을 위한 기타 기능들을 가져오기
pt_br: Importar gerador de experimentos Rabi e fitter do Ignis e outras funções para a submissão de tarefas:
ta_in: இக்னிஸிலிருந்து ரபி பரிசோதனை மின் ஆக்கி மற்றும் ஃபிட்டரை இறக்குமதி செய்யுங்கள், மற்றும் வேலை சமர்ப்பிப்பதற்கான பிற செயல்பாடுகள்:
tr_tr: Ignis'ten Rabi deney oluşturucu, montajcısını ve iş teslimi için diğer işlevleri içe aktarın:

source: Import ``PulseSimulator`` and ``PulseSystemModel`` for pulse simulation, as well as the mock Armonk backend:
bn_bn: নকল আরমঙ্ক ব্যাকএন্ড এবং তড়িৎস্পন্দন (পালস) সিমুলেশনের জন্য ``PulseSimulator`` ও ``PulseSystemModel`` ইম্পোর্ট করা:
es_un: Importar ``PulseSimulator`` y ``PulseSystemModel`` para la simulación de pulsos, así como el backend emulado de Armonk:
fr_fr: Importez ``PulseSimulator`` et ``PulseSystemModel`` pour la simulation d'impulsions, ainsi que le backend de simulation Armonk:
id_id: Impor ``PulseSimulator`` dan ``PulseSystemModel`` untuk simulasi pulsa, serta backend Armonk percobaan:
ko_kr: 펄스 시뮬레이션을 위해 `PulseSimulator`` 와 ``PulseSystemModel``, mock Armonk를 가져온다.
pt_br: Importar ``PulseSimulator`` e ``PulseSystemModel`` para simulação de pulso, bem como o backend simulado Armonk:
ta_in: துடிப்பு உருவகப்படுத்துதலுக்காக ``PulseSimulator`` மற்றும் ``PulseSystemModel`` ஆகியவற்றை இறக்குமதி செய்க, அத்துடன் போலி அர்மோங்க் பின்தளத்தில்:
tr_tr: Atım simülasyonu için ``PulseSimulator`` ve ``PulseSystemModel``i ve ayrıca taklitçi Armonk arkayüzeyini içe aktarın:

source: 2. Construct model from backend
bn_bn: ২. ব্যাকএন্ড থেকে মডেল তৈরি করুন
es_un: 2. Construir un modelo desde el backend
fr_fr: 2. Construire le modèle à partir du backend
id_id: 2. Konstruksi model dari backend
ko_kr: 2. 백엔드에서 모델 생성
pt_br: 2. Construir modelo a partir do backend
ta_in: 2. பின்தளத்தில் இருந்து மாதிரியை உருவாக்குங்கள்
tr_tr: 2. Modeli arkayüzeyden oluşturun

source: This section demonstrates the use of the ``PulseSystemModel.from_backend`` function for generating ``PulseSystemModel`` objects from a backend.
bn_bn: একটা ব্যাকএন্ড থেকে ``PulseSystemModel`` বানানোর জন্য ``PulseSystemModel.from_backend`` -এর ব্যবহার পদ্ধতি এই অংশে আলোচনা করা হয়েছে।
es_un: Esta sección demuestra el uso de la función ``PulseSystemModel.from_backend`` para generar objetos ``PulseSystemModel`` desde un backend.
fr_fr: Cette section démontre l'utilisation de la fonction ``PulseSystemModel.from_backend`` pour générer des objets ``PulseSystemModel`` à partir d'un backend.
id_id: Bagian ini menunjukkan penggunaan fungsi ``PulseSystemModel.from_backend`` untuk membuat objek ``PulseSystemModel`` dari sebuah backend.
ko_kr: 이 섹션에서는 백엔드에서 ``PulseSystemModel`` 오브젝트를 생성하는 데 필요한 ``PulseSystemModel.from_backend`` 함수를 사용하는 방법에 대해 설명한다.
pt_br: Esta seção demonstra o uso da função ``PulseSystemModel.from_backend`` para gerar objetos ``PulseSystemModel`` a partir de um backend.
ta_in: இந்த பிரிவு ஒரு பின்தளத்தில் இருந்து ``PulseSystemModel`` பொருட்களை உருவாக்குவதற்கான ``PulseSystemModel.from_backend`` செயல்பாட்டின் பயன்பாட்டை நிரூபிக்கிறது.
tr_tr: Bu bölüm, bir arka uçtan ``PulseSystemModel`` nesneleri oluşturmak için ``PulseSystemModel.from_backend`` işlevinin kullanımını gösterir.

source: **Note:** Hamiltonian parameters reported in the backends change over time. To stabilize this tutorial relative to these changes, after instantiating ``FakeArmonk``, we manually override the Hamiltonian reported in the backend configuration to static values.
bn_bn: **টীকা:** ব্যাকএন্ডের প্রতিবেদনে পাওয়া হ্যামিল্টোনিয়ান প্যারামিটারগুলো সময়ের সাথে পরিবর্তিত হয়। এই পাঠসমূহ (টিউটোরিয়াল) এই পরিবর্তন নিরপেক্ষ বানানোর জন্য ``FakeArmonk`` বানানোর পর আমরা ব্যাকএন্ড যান্ত্রিক বিন্যাসের (কনফিগারেশন) প্রতিবেদনে পাওয়া হ্যামিল্টোনিয়ানের মান স্থির মানে পরিবর্তন করি।
es_un: **Nota:** Los parámetros hamiltonianos reportados en los backends cambian con el tiempo. Para estabilizar este tutorial en relación con estos cambios, después de crear una instancia de ``FakeArmonk``, anulamos manualmente el Hamiltoniano reportado en la configuración del backend a valores estáticos.
fr_fr: **Note:** Les paramètres Hamiltoniens signalés dans les backends changent au fil du temps. Pour figer ce tutoriel par rapport à ces changements, après avoir instancié ``FakeArmonk``, nous substituons manuellement l' Hamiltonian rapporté dans la configuration du backend par des valeurs statiques.
id_id: ** Note:** Parameter Hamiltonian yang dilaporkan pada backend berubah terhadap waktu. Untuk menstabilkan tutorial ini relatif terhadap perubahan, setelah memberi contoh ``FakeArmonk``, kita secara manual menimpa Hamiltonian yang dilaporkan dalam konfigurasi backend menjadi nilai statis.
ko_kr: **참고:** 백엔드에서 보고된 해밀턴 매개변수는 시간 경과에 따라 변경됩니다. 이러한 변경과 관련하여 이 튜토리얼을 안정화하기 위해 ``FakeArmonk`` 을 인스턴스화한 후에는 백엔드 구성에서 보고된 해밀턴을 정적 값으로 수동으로 대체한다.
pt_br: **Nota:** Parâmetros Hamiltonianos relatados na alteração de backends ao longo do tempo. Para estabilizar este tutorial em relação a essas mudanças, após instanciar ``FakeArmonk``, substituímos manualmente o Hamiltonian relatado na configuração de backend com valores estáticos.
ta_in: **குறிப்பு:** பின்தளத்தில் அறிவிக்கப்பட்ட ஹாமில்டோனிய அளவுருக்கள் காலப்போக்கில் மாறுகின்றன. இந்த மாற்றங்களுடன் தொடர்புடைய இந்த டுடோரியலை உறுதிப்படுத்த, ``FakeArmonk`` ஐ நிறுவிய பின், பின்தளத்தில் உள்ளமைவில் அறிக்கையிடப்பட்ட ஹாமில்டோனியனை நிலையான மதிப்புகளுக்கு கைமுறையாக மேலெழுதும்.
tr_tr: **Not:** Arka uçlarda rapor edilen Hamilton parametreleri zamanla değişir. Bu öğreticiyi bu değişikliklere göre stabilize etmek için, ``FakeArmonk`` örneğini başlattıktan sonra, arka uç konfigürasyonunda bildirilen Hamiltonian'ı statik değerlere manuel olarak geçersiz kılıyoruz.

source: Instantiate mock backend:
bn_bn: নকল ব্যাকএন্ড চালু করা:
es_un: Instanciar un backend emulado:
fr_fr: Instancier un système d'exécution (``backend``) de simulation:
id_id: Memberi contoh backend:
ko_kr: 모의 백엔드를 설치:
pt_br: Instanciar o backend simulado:
ta_in: மோக் பின்னணியை நிறுவுக:
tr_tr: Taklitçi arkayüzeyi örnekle:

source: Manually override Hamiltonian parameters:
bn_bn: হ্যামিল্টোনিয়ান প্যারামিটার হাতে করে বাতিল করা:
es_un: Sobreescribir manualmente los parámetros del Hamiltoniano:
fr_fr: Remplacer manuellement les paramètres Hamiltoniens:
id_id: Menimpa parameter Hamiltonian secara manual:
ko_kr: 다음과 같이 해밀토니안 (Hamiltonian) 매개변수를 수동으로 대체한다:
pt_br: Sobrescreva manualmente os parâmetros Hamiltonianos:
ta_in: ஹாமில்டோனிய அளவுருக்களை கைமுறையாக மேலெழுது:
tr_tr: Homilton parametrelerini manuel olarak geçersiz kıl:

source: Generate model from backend:
bn_bn: ব্যাকএন্ড থেকে মডেল তৈরি করুনঃ
es_un: Generar un modelo desde el backend:
fr_fr: Générer le modèle à partir du backend:
id_id: Membuat model dari backend:
ko_kr: 백엔드에서 모델 생성하기:
pt_br: Gerar modelo a partir do backend:
ta_in: பின்தளத்தில் இருந்து மாதிரி உருவாக்கவும்:
tr_tr: Backend'den model oluştur:

source: 3. Run Rabi experiments and fit :math:`\pi`-pulse amplitude
bn_bn: ৩. রবি গবেষণা চালাও এবং :math:`\pi` - তড়িৎস্পন্দন (পালস) বিস্তার মানানসই (ফিট) করো।
es_un: 3. Ejecutar experimentos Rabi y ajuste de amplitud de pulso :math:`\pi`
fr_fr: 3. Lancer des expériences Rabi et s'adapter à l'amplitude :math:`\pi`-pulse
id_id: 3. Menjalankan eksperimen Rabi dan menyocokkan :math:`\pi`-amplitudo pulsa
ko_kr: 3. Rabi 실험을 실행하고 :math:`\pi` 펄스의 진폭을 맞춘다.
pt_br: 3. Faça experimentos Rabi e encaixe em :math:`\pi`-pulse amplitude
ta_in: 3.ரபி சோதனைகளை இயக்கி பொருத்தவும் :math:`\pi`-துடிப்பு வீச்சு
tr_tr: 3. Rabi deneylerini çalıştırın ve :math:`\pi`-atım genliğine uyun

source: Next, we run a Rabi experiments generated using Ignis on the simulator using the system model generated from the Armonk backend.
bn_bn: এরপর আমরা আরমংক ব্যাকএন্ড থেকে পাওয়া সিস্টেম নকশা ব্যবহার করে সিমুলেটরে একটা রবি গবেষণা চালাবো (এটা ইগ্নিস ব্যবহার করে বানানো)।
es_un: A continuación, ejecutamos los experimentos de Rabi generados utilizando Ignis en el simulador utilizando el modelo de sistema generado a partir del backend Armonk.
fr_fr: Ensuite, nous exécutons une expérience Rabi générée à l'aide d'Ignis sur le simulateur, en utilisant le modèle système généré à partir du backend Armonk.
id_id: Selanjutnya, kita menjalankan eksperimen Rabi yang dibuat Ignis pada simulator menggunakan model sistem yang dibuat dari backend Armonk.
ko_kr: 다음으로, Armonk 백엔드로부터 생성된 시스템 모델을 사용하여 시뮬레이터에서 Ignis를 사용하여 생성된 Rabi 실험을 실행한다.
pt_br: Em seguida, executamos experimentos Rabi gerados usando Ignis no simulador usando o modelo de sistema gerado a partir do backend Armonk.
ta_in: அடுத்து, அர்மோங்க் பின்தளத்தில் இருந்து உருவாக்கப்பட்ட கணினி மாதிரியைப் பயன்படுத்தி சிமுலேட்டரில் இக்னிஸைப் பயன்படுத்தி உருவாக்கப்பட்ட ஒரு ரபி சோதனைகளை இயக்குகிறோம்.
tr_tr: Ardından, Armonk arkayüzeyinden oluşturulan sistem modelini, simülatörde Ignis kullanılarak oluşturulan bir Rabi deneyi çalıştırıyoruz.

source: First, construct Rabi experiment schedules:
bn_bn: সর্বপ্রথমে , রাবি এক্সপেরিমেন্ট শিডিউল তৈরি করুনঃ
es_un: Primero, construye planificadores de experimentos Rabi:
fr_fr: Premièrement, construire les ordonnances (``schedules``) d'expérimentation de Rabi:
id_id: Pertama, membangun jadwal eksperimen Rabi:
ko_kr: 첫 번째로 라비 (Rabi) 실험 스케줄을 구성한다:
pt_br: Primeiro, construa agendamentos de experimentos Rabi:
ta_in: முதலில், ரபி பரிசோதனை அட்டவணைகளை உருவாக்குங்கள்:
tr_tr: İlk olarak Rabi deneyi için bir program kur:

source: Assemble the ``qobj`` for job submission. When assembling pulse schedules to be used with the pulse simulator, pass the ``PulseSimulator`` as the backend.
bn_bn: কাজ (জব) জমা দেওয়ার জন্য ``qobj`` টা তৈরী করা হোক। তড়িৎস্পন্দন (পালস) সিমুলেটরের সাথে ব্যবহারের জন্য পালস সময়সূচী দেওয়ার সময় ব্যাকএন্ড রূপে ``PulseSimulator`` দিতে হবে।
es_un: Ensambla el ``qobj`` para el envío del trabajo. Al ensamblar planificadores de pulso para usar con el simulador de pulso, se debe indicar el ``PulseSimulator`` como el backend.
fr_fr: Assemblez le ``qobj`` pour soumission d'une tâche (``job``). Lors de l'assemblage des ordonnances (``schedules``) d'impulsions à utiliser avec le simulateur d'impulsions, passez le ``PulseSimulator`` comme backend.
id_id: Kumpulkan ``qobj`` untuk pengajuan pekerjaan. Saat merakit jadwal pulsa untuk digunakan dengan simulator pulsa, berikan ``PulseSimulator`` sebagai backend.
ko_kr: 작업 제출용 ``qobj`` 를 조합한다. 펄스 시뮬레이터와 함께 사용될 펄스 스케쥴을 조합하는 경우에는 ``PulseSimulator`` 를 백엔드로 전달한다.
pt_br: Monte o ``qobj`` para o envio da tarefa. Ao montar agendamentos de pulso a serem usados com o simulador de pulso, passe o ``PulseSimulator`` como o backend.
ta_in: வேலை சமர்ப்பிக்க ``qobj`` ஐ இணைக்கவும். துடிப்பு சிமுலேட்டருடன் பயன்படுத்தப்பட வேண்டிய துடிப்பு அட்டவணைகளை வரிசைப்படுத்தும் போது, ``PulseSimulator`` பின்தளத்தில் அனுப்பவும்.
tr_tr: İş teslimi için ``qobj`` birleştirin. Atım simülatörü ile kullanılacak atım çizelgelerini birleştirirken, arkayüzey olarak ``PulseSimulator``'ünü iletin.

source: Run the simulation:
bn_bn: সিমুলেশনটি চালানঃ
es_un: Ejecuta la simulación:
fr_fr: Lancer la simulation:
id_id: Jalankan simulasi:
ko_kr: 시뮬레이터 실행시키기:
pt_br: Execute a simulação:
ta_in: உருவகப்படுத்துதலை இயக்கவும்:
tr_tr: Simülasyonu çalıştırın:

source: Generate the Rabi oscillation plot and find the :math:`\pi`-pulse amplitude:
bn_bn: রবি দোলনের লেখচিত্র বানিয়ে :math:`\pi` - তড়িৎস্পন্দন (পালস) বিস্তার নির্ণয় করো:
es_un: Genera la gráfica de la oscilación Rabi y encuentra la amplitud de pulso :math:`\pi`:
fr_fr: Générer le tracé d'oscillation Rabi et trouver l'amplitude :math:`\pi`-pulse:
id_id: Membuat plot osilasi Rabi dan mencari :math:`\pi`-pulsa amplitudo:
ko_kr: Rabi 진동 그래프를 생성하고, :math:`\pi` - 펄스 진폭을 찾는다:
pt_br: Gere o diagrama de oscilação Rabi e veja a :math:`\pi`-pulse amplitude:
ta_in: ரபி அலைவு சதித்திட்டத்தை உருவாக்கி, கண்டுபிடி: :math:`\pi`-துடிப்பு வீச்சு:
tr_tr: Rabi salınım grafiğini oluşturun ve :math:`\pi`-atım genliğini bulun:
