Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/12_pulse_simulator_backend_model.po
Languages: ja_jp, pt_br

source: This page was generated from `tutorials/circuits_advanced/12_pulse_simulator_backend_model.ipynb`__.
ja_jp: 当ページは `tutorials/circuits_advanced/12_pulse_simulator_backend_model.ipynb`__ から生成されました。
pt_br: Esta página foi gerada a partir de `tutorials/circuits_advanced/12_pulse_simulator_backend_model.ipynb`__.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/12_pulse_simulator_backend_model.ipynb>`_.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/12_pulse_simulator_backend_model.ipynb>`_ でインタラクティブに実行します。
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits_advanced/12_pulse_simulator_backend_model.ipynb>`_.

source: Qiskit Aer: Pulse simulation of a backend model
ja_jp: Qiskit Aer: バックエンド・モデルの Pulse シミュレーション
pt_br: Qiskit Aer: Simulação de pulso de um modelo de backend

source: This notebook shows how to use the Aer pulse simulator using a model generated from a backend. In particular, we run a Rabi experiment to find a :math:`\pi`-pulse amplitude on a model of the Armonk one qubit backend, generated from the ``FakeArmonk`` mock backend.
ja_jp: このノートでは、バックエンドから生成されたモデルを使用して Aer パルスシミュレーターを使用する方法を紹介します。具体的には、1量子ビットバックエンド、``FakeArmonk`` モックバックエンドから生成されたArmonk のモデル上で :math:`\pi`-パルスの振幅を見つけるためのラビ(Rabi)実験を行います。
pt_br: Este caderno mostra como usar o simulador de pulso Aer usando um modelo gerado a partir de um backend. Em particular, realizamos um experimento Rabi para encontrar uma amplitude de :math:`\pi`-pulse amplitude em um modelo de um qubit no backend Armonk, gerado a partir do backend de simulação ``FakeArmonk``.

source: Table of contents
ja_jp: 目次
pt_br: Índice

source: `Imports <#imports>`__
ja_jp: `インポート <#imports>`__
pt_br: `Importações <#imports>`__

source: `Construct model from backend <#model>`__
ja_jp: `バックエンドからモデルを構築する <#model>`__
pt_br: `Construa modelo a partir do backend <#model>` __

source: `Run Rabi experiments and fit :math:`\pi`-pulse amplitude <#rabi>`__
ja_jp: `ラビ実験を実行し :math:`\pi`パルスの振幅をフィッティングする <#rabi>`__
pt_br: `Execute experimentos Rabi e encaixe em :math:`\pi`-pulse amplitude <#rabi>`__

source: 1. Imports
ja_jp: 1. インポート
pt_br: 1. Importações

source: Import general libraries:
ja_jp: 一般的なライブラリーをインポート:
pt_br: Importar bibliotecas gerais:

source: Import Rabi experiment generator and fitter from Ignis, and other functions for job submission:
ja_jp: Ignisからラビ実験生成器とフィッターをインポートし、ジョブ提出のためのその他の機能をインポートします:
pt_br: Importar o gerador de experimentos Rabi e fitter do Ignis e outras funções para a submissão de tarefas:

source: Import ``PulseSimulator`` and ``PulseSystemModel`` for pulse simulation, as well as the mock Armonk backend:
ja_jp: パルスシミュレーション用の ``PulseSimulator`` と ``PulseSystemModel`` とモックのArmonk バックエンドをインポートします。
pt_br: Importar ``PulseSimulator`` e ``PulseSystemModel`` para simulação de pulso, bem como o backend de imitação Armonk:

source: 2. Construct model from backend
ja_jp: 2. バックエンドからモデルを構築する
pt_br: 2. Construir modelo a partir do backend

source: This section demonstrates the use of the ``PulseSystemModel.from_backend`` function for generating ``PulseSystemModel`` objects from a backend.
ja_jp: このセクションでは、バックエンドから ``PulseSystemModel`` オブジェクトを生成するための ``PulseSystemModel.from_backend`` 関数の使い方について説明します。
pt_br: Esta seção demonstra o uso da função ``PulseSystemModel.from_backend`` para gerar objetos ``PulseSystemModel`` a partir de um backend.

source: **Note:** Hamiltonian parameters reported in the backends change over time. To stabilize this tutorial relative to these changes, after instantiating ``FakeArmonk``, we manually override the Hamiltonian reported in the backend configuration to static values.
ja_jp: **注記** ：バックエンドで報告されるハミルトニアンパラメーターは、時間の経過とともに変化します。 これらの変更に対してこのチュートリアルを安定させるために、 ``FakeArmonk`` をインスタンス化した後、バックエンド構成で報告されたハミルトニアンを静的な値に手動でオーバーライドします。
pt_br: **Nota:** Parâmetros do Hamiltoniano relatados nos backends mudam ao longo do tempo. Para estabilizar este tutorial em relação a essas mudanças, após instanciar ``FakeArmonk``, substituímos manualmente o Hamiltoniano relatado na configuração do backend para valores estáticos.

source: Instantiate mock backend:
ja_jp: モックバックエンドのインスタンス化:
pt_br: Instanciar o backend simulado:

source: Manually override Hamiltonian parameters:
ja_jp: ハミルトニアンパラメータを手動でオーバーライドします。
pt_br: Sobrescreva manualmente os parâmetros do Hamiltoniano:

source: Generate model from backend:
ja_jp: バックエンドからモデルを生成:
pt_br: Gerar modelo a partir do backend:

source: 3. Run Rabi experiments and fit :math:`\pi`-pulse amplitude
ja_jp: 3. ラビ実験を実行し、 :math:`\pi`-pulseの振幅をフィッティングします
pt_br: 3. Executar experimentos Rabi e ajuste de :math:`\pi`-pulse amplitude

source: Next, we run a Rabi experiments generated using Ignis on the simulator using the system model generated from the Armonk backend.
ja_jp: 次に、Armonkバックエンドから生成されたシステムモデルを使用して、シミュレータ上のIgnisを使用して生成されたラビ実験を実行します。
pt_br: Em seguida, executamos experimentos Rabi gerados usando Ignis no simulador usando o modelo de sistema gerado a partir do backend Armonk.

source: First, construct Rabi experiment schedules:
ja_jp: まず、ラビ実験のスケジュールを作成します。
pt_br: Primeiro, construa schedules de experimento Rabi:

source: Assemble the ``qobj`` for job submission. When assembling pulse schedules to be used with the pulse simulator, pass the ``PulseSimulator`` as the backend.
ja_jp: ジョブ送信のために``qobj`` を組み立てます。パルスシミュレーターと一緒に使用するパルススケジュールを組み立てる場合は、バックエンドとして ``PulseSimulator`` を渡します。
pt_br: Monte o ``qobj`` para o envio da tarefa. Ao montar schedules de pulso a serem usados com o simulador de pulso, passe o ``PulseSimulator`` como o backend.

source: Run the simulation:
ja_jp: シミュレーションを実行します:
pt_br: Execute a simulação:

source: Generate the Rabi oscillation plot and find the :math:`\pi`-pulse amplitude:
ja_jp: ラビ振動をプロットし、 :math:`\pi`-パルスの振幅を探します:
pt_br: Gere o diagrama de oscilação Rabi e encontre a amplitude do :math:`\pi`-pulse:
