Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/2_operators_overview.po
Languages: es_mx, ko_kr

source: Operators
es_mx: Operadores
ko_kr: 연산자

source: Operator Class
es_mx: Clase de Operador
ko_kr: 연산자 클래스

source: Creating Operators
es_mx: Creando Operadores
ko_kr: 연산자 만들기

source: The easiest way to create an operator object is to initialize it with a matrix given as a list or a Numpy array. For example, to create a two-qubit Pauli-XX operator:
es_mx: La forma más fácil de crear un objeto operador es inicializarlo con una matriz dada como una lista o un arreglo Numpy. Por ejemplo, para crear un operador Pauli-XX de dos qubits:
ko_kr: 연산자 객체를 만드는 가장 쉬운 방법은 리스트나 Numpy 배열로 주어진 행렬을 연산자로 초기화 하는 것이다. 예를 들면 두 큐빗 Pauli-XX 연산자를 작성하고자 한다면 다음과 같이 할 수 있다.

source: Operator Properties
es_mx: Propiedades del Operador
ko_kr: 연산자의 특성

source: The operator object stores the underlying matrix, and the input and output dimension of subsystems.
es_mx: El objeto ``operator`` almacena la matriz subyacente, al igual que las dimensiones de entrada y salida de los subsistemas.
ko_kr: 연산자 객체는 그 기반이 되는 행렬과 서브시스템들의 입력 및 출력 차원을 포함한다.

source: ``data``: To access the underly Numpy array, we may use the ``Operator.data`` property.
es_mx: ``data``: Para acceder a la matriz de Numpy subyacente, podemos usar la propiedad ``Operator.data``.
ko_kr: ``data``: 기반이 되는 Numpy 배열에 접근하고자 할 때 사용한다. ``Operator.data`` 속성에 해당한다.

source: ``dims``: To return the total input and output dimension of the operator, we may use the ``Operator.dim`` property. *Note: the output is returned as a tuple ``(input_dim, output_dim)``, which is the reverse of the shape of the underlying matrix.*
es_mx: ``dims``: Para obtener las dimensiones de entrada y salida del operador, podemos utilizar la propiedad ``Operator.dim``. *Nota: la salida es una tupla ``(input_dim, output_dim)``, que corresponde al orden inverso de columnas y filas de la matriz subyacente.*
ko_kr: ``dims``: 연산자의 전체 입력과 출력의 차원을 반환하고자 할때 사용한다. ``Operator.dim`` 속성에 해당한다. *주의: 출력은 튜플 ``(input_dim, output_dim)``을 반환한다. 이는 기반 행렬*의 모양과 반대이다.

source: Input and Output Dimensions
es_mx: Dimensiones de entrada y salida
ko_kr: 입력과 출력의 차원

source: The operator class also keeps track of subsystem dimensions, which can be used for composing operators together. These can be accessed using the ``input_dims`` and ``output_dims`` functions.
es_mx: La clase ``operator`` también realiza un seguimiento de las dimensiones del subsistema, que pueden utilizarse para componer operadores. Se puede acceder a ellas utilizando las funciones `` input_dims `` y `` output_dims ``.
ko_kr: 연산자 클래스는 서브시스템의 차원을 추적하기 때문에 다중결합 연산자를 작성하는데 사용할 수 있다. 이 값은 ``input_dims`` 와``output_dims`` 함수를 이용하여 접근할 수 있다.

source: For :math:`2^N` by :math:`2^M` operators, the input and output dimension will be automatically assumed to be M-qubit and N-qubit:
es_mx: Para los operadores de dimensiones :math:`2^N` por :math:`2^M`, la dimensión de entrada y salida se asumirá automáticamente como M-qubit y N-qubit:
ko_kr: 연산자의 행이 :math:`2^M`개이고 열이 :math:`2^M`개이면 입력과 출력 차원이 자동으로 M 큐빗과 N 큐빗으로 가정된다.

source: If the input matrix is not divisible into qubit subsystems, then it will be stored as a single-qubit operator. For example, if we have a :math:`6\times6` matrix:
es_mx: Si la matriz de entrada no es divisible en subsistemas de qubits, será guardada como un operador de un solo qubit. Por ejemplo, si tenemos una matriz de :math:`6\times6`:
ko_kr: 입력된 행렬을 서브시스템으로 나눌 수 없는 경우 단일 연산자로 저장된다. 예를 들어 입력된 행렬이 :math:`6\times6` matrix:이면

source: The input and output dimension can also be manually specified when initializing a new operator:
es_mx: La dimensión de entrada y salida también se puede especificar manualmente al inicializar un operador nuevo:
ko_kr: 입력과 출력 차원은 새 연산자를 초기화 해 줄 때 수동으로 명시해 줄 수 있다.

source: Converting classes to Operators
es_mx: Conversión de clases a Operadores
ko_kr: 클래스를 연산자로 변환하기

source: ``Pauli`` objects
es_mx: Objetos ``Pauli``
ko_kr: ``Pauli`` 객체

source: ``Gate`` and ``Instruction`` objects
es_mx: Objetos ``Gate`` e ``Instruction``
ko_kr: ``Gate`` 와 ``Instruction`` 객체

source: ``QuantumCircuits`` objects
es_mx: Los objetos ``QuantumCircuits``
ko_kr: ``QuantumCircuits`` 객체

source: Note that the last point means we can use the ``Operator`` class as a unitary simulator to compute the final unitary matrix for a quantum circuit, without having to call a simulator backend. If the circuit contains any unsupported operations, an exception will be raised. Unsupported operations are: measure, reset, conditional operations, or a gate that does not have a matrix definition or decomposition in terms of gate with matrix definitions.
es_mx: Note que el último punto significa que podemos usar la clase ``Operator`` como un simulador unitario para calculcar la matriz unitaria final de un circuito cuántico, sin tener que llamar a un backend de simulación. Si el circuito contiene alguna operación no soportada, la función generará una excepción. Las operaciones no soportadas son: medición, reset, operaciones condicionales o alguna compuerta que no tenga una definición matricial o descomposición en términos de compuertas con definiciones matriciales.

source: Using Operators in circuits
es_mx: Uso de operadores en circuitos
ko_kr: 회로에서 연산자 사용하기

source: Unitary ``Operators`` can be directly inserted into a ``QuantumCircuit`` using the ``QuantumCircuit.append`` method. This converts the ``Operator`` into a ``UnitaryGate`` object, which is added to the circuit.
es_mx: Los ``Operators``unitarios pueden ser insertados directamente a un ``QuantumCircuit``utilizando el método ``QuantumCircuit.append``. Esto convierte al objeto ``Operator``en un objeto ``UnitaryGate``, el cual se añade al circuito.
ko_kr: 유니터리 ``Operators``는 매서드 ``QuantumCircuit.append``를 이용하여 ``QuantumCircuit``에 바로 넣을 수 있다. 이는 ``Operator``를 회로에 추가되는 ``UnitaryGate`` 객체로 바꿔준다.

source: If the operator is not unitary, an exception will be raised. This can be checked using the ``Operator.is_unitary()`` function, which will return ``True`` if the operator is unitary and ``False`` otherwise.
es_mx: Si el operador no es unitario, se levantará una excepción. Esto puede ser revisado preliminarmente utilizando la función ``Operator.is_unitary()``, la cual devolverá ``True`` si el operador es unitario y ``False`` si no.
ko_kr: 만약 연산자가 유니터리가 아니면 예외 처리 된다.유니터리인지는 함수 ``Operator.is_unitary()``를 사용하면 확인할 수 있다. 만약 연산자가 유니터리이면 ``True``를 그렇지 않으면 ``False``를 반환한다.

source: Note that in the above example we initialize the operator from a ``Pauli`` object. However, the ``Pauli`` object may also be directly inserted into the circuit itself and will be converted into a sequence of single-qubit Pauli gates:
es_mx: Note que en ejemplo anterior inicializamos el operador desde un objeto ``Pauli``. Sin embargo, el objeto ``Pauli`` también puede ser insertado directamente en el circuito y será convertido en una secuencia de compuertas de Pauli de un solo qubit:

source: Combining Operators
es_mx: Combinación de operadores
ko_kr: 연산자 결합하기

source: Operators my be combined using several methods.
es_mx: Los operadores pueden ser combinados utilizando varios métodos.
ko_kr: 연산자들은 다양한 방법으로 결합할 수 있다.

source: Tensor Product
es_mx: Producto tensorial
ko_kr: 텐서 곱

source: Two operators :math:`A` and :math:`B` may be combined into a tensor product operator :math:`A\otimes B` using the ``Operator.tensor`` function. Note that if both A and B are single-qubit operators, then ``A.tensor(B)`` = :math:`A\otimes B` will have the subsystems indexed as matrix B on subsystem 0, and matrix :math:`A` on subsystem 1.
es_mx: Dos operadores :math:`A` y :math:`B` pueden ser combinados en un operador que resulta del producto tensorial :math:`A\otimes B` utilizando la función `Operator.tensor`. Tenga en cuenta que si A y B son ambos operadores de un solo qubit, entonces ``A.tensor(B)`` = :math:`A\otimes B`A\otimes B` tendrá los subsistemas indexados como matriz B en el subsistema 0, y matriz :math:`A` en el subsistema 1.
ko_kr: 두 연산자 :math:`A` 와 :math:`B`는 함수 ``Operator.tensor``를 사용하여 텐서곱 연산자 :math:`A\otimes B` 로 결합할 수 있다. 만약 A와 B가 단일 큐빗 연산자라면 ``A.tensor(B)`` = :math:`A\otimes B`를 하면 :math:`B`는 서브시스템 0에 :math:`A`는 서브시스템 1에 해당한다.

source: Tensor Expansion
es_mx: Expansión Tensorial
ko_kr: 텐서 확장

source: Composition
es_mx: Composición
ko_kr: 구성

source: We can also compose two operators :math:`A` and :math:`B` to implement matrix multiplication using the ``Operator.compose`` method. We have that ``A.compose(B)`` returns the operator with matrix :math:`B.A`:
es_mx: También podemos componer dos operadores :math:`A`y :math:`B` para implemetar la multiplicación matricial utilizando el método ``Operator.compose``. Por lo tanto, ``A.compose(B)``devuelve el operador correspondiente a la matriz :math:`B.A`:

source: We can also compose in the reverse order by applying :math:`B` in front of :math:`A` using the ``front`` kwarg of ``compose``: ``A.compose(B, front=True)`` = :math:`A.B`:
es_mx: También podemos componer en orden inverso aplicando :math:`B` delante de :math:`A` usando el argumento (kwarg) ``front`` de ``compose``: ``A. compose(B, front=True)`` = :math:`A.B`:

source: Subsystem Composition
es_mx: Composición de subsistemas
ko_kr: 서브시스템 구성

source: Note that the previous compose requires that the total output dimension of the first operator :math:`A` is equal to total input dimension of the composed operator :math:`B` (and similarly, the output dimension of :math:`B` must be equal to the input dimension of :math:`A` when composing with ``front=True``).
es_mx: Note que las composiciones vistas anteriormente se requiere que la dimensión de salida del primer operador :math:`A` sea igual a la dimensión de entrada del operador :math:`B` (y de manera análoga, la dimensión de salida de :math:`B`debe ser igual a la dimensión de entrada de :math:`A` cuando se compone utilizando la opción ``front=True``).

source: We can also compose a smaller operator with a selection of subsystems on a larger operator using the ``qargs`` kwarg of ``compose``, either with or without ``front=True``. In this case, the relevant input and output dimensions of the subsystems being composed must match. *Note that the smaller operator must always be the argument of ``compose`` method.*
es_mx: También podemos componer un operador más pequeño con una selección de subsistemas en un operador más grande usando el kwarg ``qargs`` del método ``compose``, ya sea con o sin ``front=True``. En este caso, las dimensiones de entrada y salida de los subsistemas que están siendo compuestos deben coincidir. *Tenga en cuenta que el operador más pequeño siempre debe ser el argumento del método ``compose``.*

source: For example, to compose a two-qubit gate with a three-qubit Operator:
es_mx: Por ejemplo, para componer una compuerta de dos qubits con un operador de tres qubits:

source: Linear combinations
es_mx: Combinaciones lineales
ko_kr: 선형 결합

source: Operators may also be combined using standard linear operators for addition, subtraction and scalar multiplication by complex numbers.
es_mx: Los operadores también pueden ser combinados usando las operaciones estándar de suma, resta y multiplicación escalar por un número complejo.

source: Implicit Conversion to Operators
es_mx: Conversión implícita a operadores

source: Note that for all the following methods, if the second object is not already an ``Operator`` object, it will be implicitly converted into one by the method. This means that matrices can be passed in directly without being explicitly converted to an ``Operator`` first. If the conversion is not possible, an exception will be raised.
es_mx: Note que para todos lo métodos siguientes, si el segundo objeto no es del tipo ``Operator``, el método lo convertirá implicitamente a uno de ese tipo. Esto significa que se pueden pasar directamente objetos de tipo matriz como argumento, sin tener que convertirlas a un ``Operator`` anteriormente. Si la conversión no es posible, se generará una excepción.

source: Comparison of Operators
es_mx: Comparación entre operadores
ko_kr: 연산자의 비교

source: Operators implement an equality method that can be used to check if two operators are approximately equal.
es_mx: Los operadores implementan un método de igualdad que puede ser utilizado para verificar si dos operadores son aproximadamente iguales.
ko_kr: 연산자는 두 연산자가 거의 동일한지 확인하는데 사용할 수 있는 등식 매서드를 제공한다.

source: Process Fidelity
es_mx: Fidelidad de Proceso
ko_kr: 프로세스 정확도(Fidelity)

source: Note that process fidelity is generally only a valid measure of closeness if the input operators are unitary (or CP in the case of quantum channels), and an exception will be raised if the inputs are not CP.
es_mx: Tenga en cuenta que la fidelidad de proceso es generalmente sólo una medida válida de proximidad si los operadores de entrada son unitarios (o CP en el caso de canales cuánticos), y se generará una excepción si las entradas no son CP.
ko_kr: 프로세스 정확도는 입력 연산자들이 유니터리(혹은 양자 채널의 경우 CP) 일 때만 그들의 유사도를 평가하는 유용한 척도이다. 만약 입력이 CP가 아니면 예외 처리 된다.

source: This page was generated from `tutorials/circuits_advanced/2_operators_overview.ipynb`__.
ko_kr: 이 페이지는 "tutorials/회로its_advanced/2_operators_overview.ipynb" __ 에서 생성되었다.

source: The ``Operator`` class is used in Qiskit to represent matrix operators acting on a quantum system. It has several methods to build composite operators using tensor products of smaller operators, and to compose operators.
ko_kr: Qiskit에서 ``Operator`` 클래스는 양자 시스템에 작용하는 행렬 연산자를 나타내는데 사용된다. 이 클래스는 텐서 곱을 이용한 다중 결합 연산자를 만들거나 연산자를 작성하는데 필요한 다양한 매서드를 포함한다.

source: We can also extract just the input or output dimensions of a subset of subsystems using the ``input_dims`` and ``output_dims`` functions:
ko_kr: 또한``input_dims``와 ``output_dims`` 함수를 사용하여 일부 서브시스템들의 입력 혹은 출력 차원만을 추출할 수 있다.

source: Several other classes in Qiskit can be directly converted to an ``Operator`` object using the operator initialization method. For example:
ko_kr: Qiskit에서 사용되는 다른 클래스들은 연산자 초기화 매서드를 사용하여 ``Operator`` 객체로 바로 변환 가능하다. 예를 들어

source: A closely related operation is ``Operator.expand``, which acts like a tensor product but in the reverse order. Hence, for two operators :math:`A` and :math:`B` we have ``A.expand(B)`` = :math:`B\otimes A` where the subsystems indexed as matrix A on subsystem 0, and matrix :math:`B` on subsystem 1.
ko_kr: 가장 관련된 연산은 ``Operator.expand``으로 텐서 곱과 같이 작용하지만 순서가 반대이다. 두 연산자 :math:`A` 와 :math:`B`에 대해 ``A.expand(B)`` = :math:`B\otimes A`이다. 여기서 행렬 A는 서브시스템 0에 :math:`B`는 서브시스템 1에 해당한다.

source: Note that this checks that each matrix element of the operators is approximately equal; two unitaries that differ by a global phase will not be considered equal:
ko_kr: 이는 연산자의 각 행렬 성분들이 대략적으로 동일 한지를 확인한다. 전역 위상이 다른 두 유니터리는 다르게 간주한다.

source: We may also compare operators using the ``process_fidelity`` function from the *Quantum Information* module. This is an information theoretic quantity for how close two quantum channels are to each other, and in the case of unitary operators it does not depend on global phase.
ko_kr: 또한, *Quantum Information * 모듈의 "process_fidelity" 기능을 사용하여 연산자를 비교할 수도 있다. 이는 두 개의 양자 채널이 얼마나 유사한지를 나타내는 정보이론적 양이며 유니터리 연산자의 경우 글로벌 위상에는 의존하지 않는다.
