Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits_advanced/3_advanced_circuit_visualization.po
Languages: fr_fr

source: This page was generated from `tutorials/circuits_advanced/3_advanced_circuit_visualization.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/circuits_advanced/3_advanced_circuit_visualization.ipynb`__.

source: Visualizing a Quantum Circuit
fr_fr: Visualisation d'un circuit quantique

source: Drawing a Quantum Circuit
fr_fr: Dessin d'un circuit quantique

source: When building a quantum circuit, it often helps to draw the circuit. This is supported natively by a ``QuantumCircuit`` object. You can either call ``print()`` on the circuit, or call the ``draw()`` method on the object. This will render a `ASCII art version <https://en.wikipedia.org/wiki/ASCII_art>`__ of the circuit diagram.
fr_fr: Lors de la construction d'un circuit quantique, le dessin du circuit aide souvent. Cette fonctionnalité est implémentée nativement par un objet ` ` QuantumCircuit ` `. Vous pouvez la méthode ` ` print () ` `, ou la méthode ` ` draw () ` ` sur le circuit. Cela donnera une version utilisant les caractères ASCII <https://en.wikipedia.org/wiki/ASCII_art>` __ du diagramme du circuit.

source: Alternative Renderers for Circuits
fr_fr: Autres manière de dessiner les circuits

source: A text output is useful for quickly seeing the output while developing a circuit, but it doesn't provide the most flexibility in its output. There are two alternative output renderers for the quantum circuit. One uses `matplotlib <https://matplotlib.org/>`__, and the other uses `LaTeX <https://www.latex-project.org/>`__, which leverages the `qcircuit package <https://github.com/CQuIC/qcircuit>`__. These can be specified by using ``mpl`` and ``latex`` values for the ``output`` kwarg on the draw() method.
fr_fr: Une sortie texte est utile pour voir rapidement la sortie tout en développant un circuit, mais elle ne fournit pas nécessairement le résultat le plus utile. Il existe deux autres modes d'affichage pour le circuit quantique. L'une utilise ` matplotlib <https://matplotlib.org/>` __, et l'autre utilise ` LaTeX <https://www.latex-project.org/>` __, lequel utilise le paquet qcircuit <https://github.com/CQuIC/qcircuit>` __. Ces options d'affichage peuvent être spécifiées en utilisant les valeurs ` ` mpl ` ` ou ` ` latex ` ` pour le paramètre de mot clef ` `output ` ` sur la méthode draw().

source: Controlling output from circuit.draw()
fr_fr: Contrôle de la sortie de circuit.draw()

source: By default, the draw method returns the rendered image as an object and does not output anything. The exact class returned depends on the output specified: ``'text'``\ (the default) returns a ``TextDrawer`` object, ``'mpl'`` returns a ``matplotlib.Figure`` object, and ``latex`` returns a ``PIL.Image`` object. Having the return types enables modifying or directly interacting with the rendered output from the drawers. Jupyter notebooks understand these return types and render them for us in this tutorial, but when running outside of Jupyter, you do not have this feature automatically. However, the ``draw()`` method has optional arguments to display or save the output. When specified, the ``filename`` kwarg takes a path to which it saves the rendered output. Alternatively, if you're using the ``mpl`` or ``latex`` outputs, you can leverage the ``interactive`` kwarg to open the image in a new window (this will not always work from within a notebook but will be demonstrated anyway).
fr_fr: Par défaut, la méthode de dessin renvoie l'image affichée en tant qu'objet et ne produit rien. La classe exacte retournée dépend de la sortie spécifiée: ` ` text'` ` \ (la valeur par défaut) renvoie un objet ` ` TextDrawer ` `, ` ` ` ` mpl'` ` renvoie un objet ` `matplotlib.Figure ` ` ` , et ` ` latex ` ` retourne un objet ` `PIL.Image'`. Le fait de connaître les types de retour permet de modifier ou d'interagir directement avec la sortie des moteurs de dessin. Les notebooks Jupyter comprennent ces types de retour et les affichent pour nous dans ce tutoriel, mais en dehors du contexte de Jupyter, cette fonctionnalité n'est pas disponible automatiquement. Cependant, la méthode ` ` draw () ` ` permet d'utiliser des arguments optionnels pour afficher ou enregistrer la sortie. Lorsqu'il est spécifié, l'argument de mot clef ` ` filename nom de fichier ` ` permet de spécifier le dossier vers lequel la sortie est enregistrée. Autrement, si vous utilisez les sorties ` ` mpl ` ` ou ` ` latex ` `, vous pouvez tirer parti de l'argument de mot clef ` ` interactive ``pour ouvrir l'image dans une nouvelle fenêtre (cela ne fonctionne pas toujours à l'intérieur d'un notebook).

source: Customizing the output
fr_fr: Personnalisation de la sortie

source: Depending on the output, there are also options to customize the circuit diagram rendered by the circuit.
fr_fr: Selon le type de sortie, il y a aussi des options pour personnaliser le schéma du circuit.

source: Disable Plot Barriers and Reversing Bit Order
fr_fr: Désactiver les barrières de traçage et inverser l'ordre des bits

source: The first two options are shared among all three backends. They allow you to configure both the bit orders and whether or not you draw barriers. These can be set by the ``reverse_bits`` kwarg and ``plot_barriers`` kwarg, respectively. The examples below will work with any output backend; ``latex`` is used here for brevity.
fr_fr: Les deux premières options sont partagées entre les trois backends. Ils vous permettent de configurer à la fois l'ordre des bits et si vous tracez ou non des barrières. Celles-ci peuvent être définies par le kwarg (argument de mot clé) ``reverse_bits`` et le kwarg ``plot_barriers``, respectivement. Les exemples ci-dessous fonctionneront avec n'importe quel backend de sortie; pour être bref, nous illustrons seulement le cas ``latex``.

source: Backend-specific customizations
fr_fr: Personnalisations spécifiques au backend

source: Some available customizing options are specific to a backend. The ``line_length`` kwarg for the ``text`` backend can be used to set a maximum width for the output. When a diagram is wider than the maximum, it will wrap the diagram below. The ``mpl`` backend has the ``style`` kwarg, which is used to customize the output. The ``scale`` option is used by the ``mpl`` and ``latex`` backends to scale the size of the output image with a multiplicative adjustment factor. The ``style`` kwarg takes in a ``dict`` with multiple options, providing a high level of flexibility for changing colors, changing rendered text for different types of gates, different line styles, etc. Available options are:
fr_fr: Certaines options de personnalisation disponibles peuvent être spécifiques à un type de sortie. La valeur de l'argument de mot clef ``line_length`` pour la sortie de type ``texte`` peut être utilisée pour définir une largeur maximale pour la sortie. Lorsqu'un diagramme est plus large que le maximum, le dessin se poursuit à la ligne suivante. Pour le type de sortie ``mpl`` l'argument ``style`` peut aussi être utilisé pour personnaliser la sortie. L'option ``scale`` est utilisée par les modes de sortie ``mpl`` et ``latex`` pour réduire la taille de l'image de sortie avec un facteur d'ajustement multiplicatif. L'argument ``style`` est spécifié à l'aide d'un ``dict`` (dictionnaire Python) avec de multiples options, offrant un haut niveau de flexibilité pour changer les couleurs, le rendu du texte pour différents types de portes, différents styles de lignes, etc. Les options disponibles sont les suivantes:

source: **textcolor** (str): The color code to use for text. Defaults to ``'#000000'``
fr_fr: ** textcolor** (str): Code de couleur à utiliser pour le texte. La valeur par défaut est ``'#000000'``

source: **subtextcolor** (str): The color code to use for subtext. Defaults to ``'#000000'``
fr_fr: ** subtextcolor** (str): Code de couleur à utiliser pour le sous-texte. La valeur par défaut est ``'#000000'``

source: **linecolor** (str): The color code to use for lines. Defaults to ``'#000000'``
fr_fr: ** linecolor** (str): Code de couleur à utiliser pour les lignes. La valeur par défaut est ``'#000000'``

source: **creglinecolor** (str): The color code to use for classical register lines ``'#778899'``
fr_fr: ** creglinecolor** (str): Code de couleur à utiliser pour les lignes des registres classiques. La valeur par défaut est ``'#778899'``

source: **gatetextcolor** (str): The color code to use for gate text ``'#000000'``
fr_fr: ** gatetextcolor** (str): Code de couleur à utiliser pour le texte dans les portes. La valeur par défaut est ``'#000000'``

source: **gatefacecolor** (str): The color code to use for gates. Defaults to ``'#ffffff'``
fr_fr: ** gatefacecolor** (str): Code de couleur à utiliser pour les portes. La valeur par défaut est ` `'#ffffff'` ` `

source: **barrierfacecolor** (str): The color code to use for barriers. Defaults to ``'#bdbdbd'``
fr_fr: ** barrierfacecolor** (str): Code de couleur à utiliser pour les barrières. La valeur par défaut est ``'#bdbdbd'``

source: **backgroundcolor** (str): The color code to use for the background. Defaults to ``'#ffffff'``
fr_fr: **backgroundcolor** (str): Le code de couleur à utiliser pour l'arrière-plan. Par défaut, ``'#ffffff'``

source: **fontsize** (int): The font size to use for text. Defaults to 13
fr_fr: ** fontsize** (int): taille de police à utiliser pour le texte. La valeur par défaut est 13

source: **subfontsize** (int): The font size to use for subtext. Defaults to 8
fr_fr: ** fontsize** (int): taille de police à utiliser pour le texte de petite taille. La valeur par défaut est 8

source: **displaytext** (dict): A dictionary of the text to use for each element type in the output visualization. The default values are:
fr_fr: ** displaytext** (dict): dictionnaire contenant le texte à utiliser pour chaque type d'élément dans la visualisation de sortie. Les valeurs par défaut sont :

source: You must specify all the necessary values if using this. There is no provision for an incomplete dict passed in.
fr_fr: Vous devez spécifier toutes les valeurs nécessaires si vous l'utilisez. Un dictionnaire incomplet passé donnera des résultats non garantis, voire des erreurs.

source: **displaycolor** (dict): The color codes to use for each circuit element. By default, all values default to the value of ``gatefacecolor`` and the keys are the same as ``displaytext``. Also, just like ``displaytext``, there is no provision for an incomplete dict passed in.
fr_fr: ** displaycolor** (dict): Les codes de couleur à utiliser pour chaque élément de circuit. Par défaut, toutes les valeurs par défaut sont celles de ``gatefacecolor`` et les mots clés sont les mêmes que pour ``displaytext``. Aussi, comme pour ``displaytext``, un dictionnaire incomplet passé donnera des résultats non garantis, voire des erreurs.

source: **latexdrawerstyle** (bool): When set to True, enable LaTeX mode, which will draw gates like the ``latex`` output modes.
fr_fr: ** latexdrawerstyle** (bool): Lorsqu'il est défini sur True, le mode LaTeX qui trace les portes comme le mode de sortie ``latex`` est activé.

source: **usepiformat** (bool): When set to True, use radians for output.
fr_fr: ** usepiformat** (bool): Lorsqu'il est défini sur True, les sorties sont exprimées en radians.

source: **fold** (int): The number of circuit elements at which to fold the circuit. Defaults to 20
fr_fr: ** fold** (int): Le nombre d'éléments de circuit présentés sur une largeur d'affichage. La valeur par défaut est 20.

source: **cregbundle** (bool): If set True, bundle classical registers.
fr_fr: **cregbundle** (bool): Lorsqu'il est défini sur True, les registres classiques sont regroupés.

source: **showindex** (bool): If set True, draw an index.
fr_fr: ** showindex** (bool): Lorsqu'il est défini sur True, un index est dessiné.

source: **compress** (bool): If set True, draw a compressed circuit.
fr_fr: ** compres** (bool): Si la valeur est True, dessine un circuit compressé.

source: **figwidth** (int): The maximum width (in inches) for the output figure.
fr_fr: ** figwidth** (int): La largeur maximale (en pouces) de la figure de sortie.

source: **dpi** (int): The DPI to use for the output image. Defaults to 150.
fr_fr: ** dpi** (int): Le DPI (résolution en pixel par pouce) à utiliser pour l'image de sortie. La valeur par défaut est 150.

source: **creglinestyle** (str): The style of line to use for classical registers. Choices are ``'solid'``, ``'doublet'``, or any valid matplotlib ``linestyle`` kwarg value. Defaults to ``doublet``.
fr_fr: ** creglinestyle** (str): Définit le style de ligne à utiliser pour les registres classiques. Les choix sont ``'solid'``, ``'doublet'``, ou n'importe quelle valeur valide de matplotlib pour l'argument de mot clef ``linestyle``. La valeur par défaut est ``doublet``.

source: circuit\_drawer() as function
fr_fr: circuit\_drawer() en tant que fonction

source: If you have an application where you prefer to draw a circuit with a self-contained function instead of as a method of a circuit object, you can directly use the ``circuit_drawer()`` function, which is part of the public stable interface from ``qiskit.tools.visualization``. The function behaves identically to the ``circuit.draw()`` method, except that it takes in a circuit object as required argument.
fr_fr: Si vous avez une application où vous préférez tracer un circuit avec une fonction autonome au lieu d'utiliser un méthode sur un objet de type circuit, vous pouvez utiliser directement la fonction ``circuit_drawer()``, qui fait partie de l'interface publique stable de ``qiskit.tools.visualisation``. La fonction se comporte de façon identique à la méthode ``circuit.draw()``, sauf qu'elle attend un argument de type circuit.

source: Note: In Qiskit Terra <= 0.7, the default behavior for the circuit\_drawer() function is to use the latex output backend, and in 0.6.x that includes a fallback to mpl if latex fails for any reason. Starting with release > 0.7, the default changes to the text output.
fr_fr: Note: Dans Qiskit Terra < = 0.7, la fonction circuit\_drawer () utilise pr défaut le type de sortie latex. en particulier la version 0.6.x inclut une substitution à ``mpl`` si la sortie latex échoue pour quelque raison que ce soit. A partir de l'édition 0.8, l'affichage par défaut enst en mode ``text``.
