Repository: qiskit-community/qiskit-translations
Catalog: optimization/docs/locale/*/LC_MESSAGES/migration/01_migration_guide_to_v0.5.po
Languages: es_un, ja, te

source: This page was generated from `docs/migration/01_migration_guide_to_v0.5.ipynb`__.
es_un: Esta página fue generada a partir de `docs/migration/01_migration_guide_to_v0.5.ipynb`__.
ja: このページは `docs/migration/01_migration_guide_to_v0.5.ipynb`__ から生成されました。
te: ఈ పేజీ నుండి రూపొందించబడింది` docs/migration/01_migration_guide_to_v0.5.ipynb ` __.

source: Qiskit Optimization v0.5 Migration Guide
es_un: Guía de Migración de Qiskit Optimization v0.5
ja: Qiskit Optimization v0.5 移行ガイド
te: కిస్కిట్ ఆప్టిమైజేషన్ v0.5 మైగ్రేషన్ గైడ్

source: This tutorial will guide you through the process of migrating your code from Qiskit Optimization v0.4 to v0.5.
es_un: Este tutorial te guiará a través del proceso de migración de tu código de Qiskit Optimization v0.4 a v0.5.
ja: このチュートリアルでは、コードを Qiskit Optimization v0.4 から v0.5 へマイグレーションするプロセスをガイドします。
te: ఈ ట్యుటోరియల్ మీ కోడ్‌ని Qiskit ఆప్టిమైజేషన్ v0.4 నుండి v0.5కి మార్చే ప్రక్రియ ద్వారా మీకు మార్గనిర్దేశం చేస్తుంది.

source: Overview
es_un: Descripción General
ja: 概要
te: ఓవర్వ్యూ

source: Qiskit Terra v0.22 introduces new algorithm implementations that leverage `Qiskit Primitives <https://qiskit.org/documentation/apidoc/primitives.html>`__ (Estimator and Sampler). The former algorithm implementations that leverage opflow will be deprecated in the future release.
es_un: Qiskit Terra v0.22 presenta nuevas implementaciones de algoritmos que aprovechan las `Primitivas de Qiskit <https://qiskit.org/documentation/apidoc/primitives.html>`__ (Estimator y Sampler). Las implementaciones de algoritmos anteriores que aprovechan el flujo de operaciones quedarán obsoletas en la versión futura.
ja: Qiskit Terra v0.22 では、`Qiskit Primitives <https://qiskit.org/documentation/apidoc/primitives.html>`__ (Estimator および Sampler) を活用する新しいアルゴリズムの実装が導入されています。 opflow を利用する以前のアルゴリズムの実装は、将来のリリースで廃止される予定です。
te: Qiskit Terra v0.22, `కిస్కిట్ ప్రిమిటివ్స్ <https://qiskit.org/documentation/apidoc/primitives.html>`__ (ఎస్టిమేటర్ మరియు సాంప్లర్)ను ప్రభావితం చేసే కొత్త అల్గారిథమ్ అమలులను పరిచయం చేసింది. భవిష్యత్ విడుదలలో అప్‌ఫ్లోను ప్రభావితం చేసే మునుపటి అల్గారిథమ్ అమలులు నిలిపివేయబడతాయి.

source: Qiskit Optimization v0.5 supports both the new and the former algorithms of Qiskit Terra v0.22 until the former algorithms are deprecated.
es_un: Qiskit Optimization v0.5 es compatible con los algoritmos nuevos y anteriores de Qiskit Terra v0.22 hasta que los algoritmos anteriores queden obsoletos.
ja: Qiskit Optimization v0.5は、Qiskit Terra v0.22の新アルゴリズムと旧アルゴリズムの両方を、旧アルゴリズムが非推奨になるまでサポートします。
te: Qiskit ఆప్టిమైజేషన్ v0.5 పూర్వపు అల్గారిథమ్‌లు నిలిపివేయబడే వరకు, Qiskit Terra v0.22 యొక్క కొత్త మరియు మునుపటి అల్గారిథమ్‌లు రెండింటికి మద్దతు ఇస్తుంది.

source: It is not the intention to provide detailed explanations of the primitives in this migration guide. We suggest that you read the `corresponding resources <https://qiskit.org/documentation/apidoc/primitives.html>`__ of the Qiskit Terra documentation instead.
es_un: No es la intención proporcionar explicaciones detalladas de las primitivas en esta guía de migración. Te sugerimos que leas los `recursos correspondientes <https://qiskit.org/documentation/apidoc/primitives.html>`__ de la documentación de Qiskit Terra en su lugar.
ja: この移行ガイドでPrimitives の詳細な説明を提供することは意図していません。 代わりに Qiskit Terra ドキュメントの `対応するリソース <https://qiskit.org/documentation/apidoc/primitives.html>`__ を読むことをお勧めします。
te: ఈ మైగ్రేషన్ గైడ్‌లో ప్రధమికాల వివరణాత్మక వివరణలను అందించడం ఉద్దేశ్యం కాదు. బదులుగా Qiskit Terra డాక్యుమెంటేషన్ యొక్క `సంబంధిత వనరులను <https://qiskit.org/documentation/apidoc/primitives.html>`__ చదవమని మేము సూచిస్తున్నాము.

source: We use ``qiskit.primitives.Sampler`` in this guide as an example of Sampler implementation, which follows ``qiskit.primitives.BaseSampler`` interface. Users can also use other Sampler implementations such as ``BackendSampler`` (qiskit-terra), ``AerSampler`` (qiskit-aer), and Qiskit Runtime Sampler (qiskit-ibm-runtime).
es_un: Usamos ``qiskit.primitives.Sampler`` en esta guía como un ejemplo de implementación de Sampler, que sigue a la interfaz ``qiskit.primitives.BaseSampler``. Los usuarios también pueden utilizar otras implementaciones de Sampler como ``BackendSampler`` (qiskit-terra), ``AerSampler`` (qiskit-aer) y Qiskit Runtime Sampler (qiskit-ibm-runtime).
ja: 本ガイドでは、Samplerの実装例として ``qiskit.primitives.Sampler`` を使用します。これは ``qiskit.primitives.BaseSampler`` インターフェースに従った実装です。 ``BackendSampler`` (qiskit-terra), ``AerSampler`` (qiskit-aer), Qiskit Runtime Sampler (qiskit-ibm-runtime) などの他のSampler実装も使用することが可能です。
te: మేము ఈ గైడ్‌లో ``qiskit.primitives.Sampler``ని సాంప్లర్ అమలుకు ఉదాహరణగా ఉపయోగిస్తాము, ఇది ``qiskit.primitives.BaseSampler`` ఇంటర్‌ఫేస్‌ని అనుసరిస్తుంది. వినియోగదారులు ``BackendSampler`` (qiskit-terra), ``AerSampler`` (qiskit-aer) మరియు Qiskit Runtime Sampler (qiskit-ibm-runtime) వంటి ఇతర సాంప్లర్ అమలులను కూడా ఉపయోగించవచ్చు.

source: The former algorithms exist in ``qiskit.algorithms.minimum_eigen_solvers`` and we can access them by ``qiskit.algorithms.*``. On the other hand, the new algorithms exist in ``qiskit.algorithms.minimum_eigensolvers`` and we can access them by ``qiskit.algorithms.minimum_eigensolvers.*``. Note that the difference is ``minimum_eigen_solvers`` (former) and ``minimum_eigensolvers`` (new).
es_un: Los algoritmos anteriores existen en ``qiskit.algorithms.minimum_eigen_solvers`` y podemos acceder a ellos mediante ``qiskit.algorithms.*``. Por otro lado, los nuevos algoritmos existen en ``qiskit.algorithms.minimum_eigensolvers`` y podemos acceder a ellos mediante ``qiskit.algorithms.minimum_eigensolvers.*``. Ten en cuenta que la diferencia es ``minimum_eigen_solvers`` (anterior) y ``minimum_eigensolvers`` (nuevo).
ja: 前のアルゴリズムは ``qiskit.algorithms.minimum_eigen_solvers`` に存在し、 ``qiskit.algorithms.*`` によってアクセスすることができました。一方、新しいアルゴリズムは ``qiskit.algorithms.minimum_eigensolvers`` に存在し、 ``qiskit.algorithms.minimum_eigensolvers.*`` によってアクセスすることができます。違いは ``minimum_eigen_solvers`` (旧) と ``minimum_eigensolvers`` (新) であることに注意してください。
te: మునుపటి అల్గారిథమ్‌లు ``qiskit.algorithms.minimum_eigen_solvers``లో ఉన్నాయి మరియు మనం వాటిని ``qiskit.algorithms.*`` ద్వారా యాక్సెస్ చేయవచ్చు. మరోవైపు, కొత్త అల్గారిథమ్‌లు ``qiskit.algorithms.minimum_eigensolvers``లో ఉన్నాయి మరియు మనం వాటిని ``qiskit.algorithms.minimum_eigensolvers.*`` ద్వారా యాక్సెస్ చేయవచ్చు. వ్యత్యాసం ``కనిష్ట_ఈజెన్_పరిష్కారాలు`` (మునుపటి) మరియు ``కనిష్ట_ఈజెన్‌సోల్వర్స్`` (కొత్తది) అని గమనించండి.

source: ``MinimumEigenOptimizer`` of Qiskit Optimization can use ``qiskit.algorithms.MinimumEigenSolver`` interface of the former algorithms and ``qiskit.algorithms.minimum_eigensolvers.SamplingMinimumEigensolver`` interface of the new algorithms. Note that ``MinimumEigenOptimizer`` cannot basically handle ``qiskit.algorithms.minimum_eigensolvers.MinimumEigensolver`` of the new algorithms. But there is an exception. ``MinimumEigenOptimizer`` can handle ``algorithms.minimum_eigensolver.NumPyMinimumEigensolver`` though it inherits ``qiskit.algorithms.minimum_eigensolvers.MinimumEigensolver``. It is because ``algorithms.minimum_eigensolver.NumPyMinimumEigensolver`` has an extension that allows users to access the eigen states.
es_un: ``MinimumEigenOptimizer`` de Qiskit Optimization puede usar la interfaz ``qiskit.algorithms.MinimumEigenSolver`` de los algoritmos anteriores y la interfaz ``qiskit.algorithms.minimum_eigensolvers.SamplingMinimumEigensolver`` de los algoritmos nuevos. Ten en cuenta que ``MinimumEigenOptimizer`` básicamente no puede manejar ``qiskit.algorithms.minimum_eigensolvers.MinimumEigensolver`` de los algoritmos nuevos. Pero hay una excepción. ``MinimumEigenOptimizer`` puede manejar ``algorithms.minimum_eigensolver.NumPyMinimumEigensolver`` aunque hereda de ``qiskit.algorithms.minimum_eigensolvers.MinimumEigensolver``. Es porque ``algorithms.minimum_eigensolver.NumPyMinimumEigensolver`` tiene una extensión que permite a los usuarios acceder a los estados propios.
ja: Qiskit Optimization の ``MinimumEigenOptimizer`` は、旧アルゴリズムの ``qiskit.algorithms.MinimumEigenSolver`` インターフェースと新アルゴリズムの ``qiskit.algorithms.minimum_eigensolvers.SamplingMinimumEigensolver`` インターフェースを利用することができます。なお、 ``MinimumEigenOptimizer`` は基本的に新しいアルゴリズムの ``qiskit.algorithms.minimum_eigensolvers.MinimumEigensolver`` を扱うことができません。しかし、例外があります。MinimumEigenOptimizer`` は ``qiskit.algorithms.minimum_eigensolvers.MinimumEigensolver`` を継承していますが、 ``algorithms.minimum_eigensolver.NumPyMinimumEigensolver`` をハンドリングすることができます。これは ``algorithms.minimum_eigensolver.NumPyMinimumEigensolver`` が固有値にアクセスするための拡張を持っているからです。
te: Qiskit ఆప్టిమైజేషన్ యొక్క ``MinimumEigenOptimizer`` మునుపటి అల్గారిథమ్‌ల యొక్క ``qiskit.algorithms.MinimumEigenSolver`` ఇంటర్‌ఫేస్‌ని మరియు కొత్త అల్గారిథమ్‌ల యొక్క``qiskit.algorithms.minimum_eigensolvers.SamplingMinimumEigensolver`` ఇంటర్‌ఫేస్‌ ను ఉపయోగించగలదు. ``MinimumEigenOptimizer`` ప్రాథమికంగా కొత్త అల్గారిథమ్‌ల యొక్క ``qiskit.algorithms.minimum_eigensolvers.MinimumEigensolver``ని నిర్వహించలేదని గమనించండి. కానీ ఒక మినహాయింపు ఉంది. ``MinimumEigenOptimizer`` ``algorithms.minimum_eigensolver.NumPyMinimumEigensolver``ని నిర్వహించగలదు, అయినప్పటికీ ఇది ``qiskit.algorithms.minimum_eigensolvers.MinimumEigensolver``ని వారసత్వంగా పొందుతుంది. ఎందుకంటే ``algorithms.minimum_eigensolver.NumPyMinimumEigensolver`` ఐగేన్ స్టేట్‌లను యాక్సెస్ చేయడానికి వినియోగదారులను అనుమతించే పొడిగింపును కలిగి ఉంది.

source: The following is the corresponding table.
es_un: La siguiente es la tabla correspondiente.
ja: 対応する表を以下に示します。
te: కిందిది సంబంధిత పట్టిక.

source: Former algorithm
es_un: Algoritmo anterior
ja: 以前のアルゴリズム
te: మునుపటి అల్గోరిథమ్

source: New algorithm
es_un: Algoritmo nuevo
ja: 新しいアルゴリズム
te: నూతనమైన అల్గరిథమ్

source: Setup of a problem
es_un: Configuración de un problema
ja: 問題のセットアップ
te: సమస్యను సెటప్ చేయుట

source: NumPyMinimumEigensolver
te: నమ్ పై మినిమమ్ ఐగన్ సాల్వర్

source: Previously
es_un: Previamente
ja: 以前
te: గతంలో

source: New
es_un: Nuevo
ja: 新規
te: కొత్త

source: VQE (former) → SamplingVQE (new)
es_un: VQE (anterior) → SamplingVQE (nuevo)
ja: VQE (旧) → SamplingVQE (新規)
te: VQE (మునుపటి) → SamplingVQE (కొత్త)

source: An error occurs due to ``VQE`` with ``Estimator``. You can use ``SamplingVQE`` with ``Sampler`` instead (see the previous cell).
es_un: Se produce un error debido a ``VQE`` con ``Estimator``. Puedes usar ``SamplingVQE`` con ``Sampler`` en su lugar (ver la celda anterior).
ja: ``Estimator`` で ``VQE`` が原因でエラーが発生します。代わりに ``SamplingVQE`` で ``SamplingVQE`` を使用できます (前のセルを参照してください)。
te: ``ఎస్టిమేటర్``తో ``VQE`` కారణంగా ఎర్రర్ ఏర్పడింది. బదులుగా మీరు ``SamplingVQE``ని ``Sampler``తో ఉపయోగించవచ్చు (మునుపటి సెల్ చూడండి).

source: ``WarmStartQAOAOptimizer`` can use both the former ``qiskit.algorithms.QAOA`` and the new ``qiskit.algorithms.minimum_eigensolvers.QAOA`` as follows.
es_un: ``WarmStartQAOAOptimizer`` puede usar tanto el ``qiskit.algorithms.QAOA`` anterior como el ``qiskit.algorithms.minimum_eigensolvers.QAOA`` nuevo de la siguiente manera.
ja: ``WarmStartQAOAOptimizer`` は、以前の ``qiskit.algorithms.QAOA`` と新しい ``qiskit.algorithms.minimum_eigensolvers.QAOA`` の両方を使用できます。
te: ``WarmStartQAOAOptimizer`` ఈ క్రింది విధంగా మునుపటి ``qiskit.algorithms.QAOA` మరియు కొత్త ``qiskit.algorithms.minimum_eigensolvers.QAOA` రెండింటినీ ఉపయోగించవచ్చు.

source: ``GroverOptimizer``
te: ``గ్రోవర్ ఆప్టిమైజర్``

source: ``GroverOptimizer`` supports both ``QuantumInstance`` and ``BaseSampler``. But users must specify one of them.
es_un: ``GroverOptimizer`` admite tanto ``QuantumInstance`` como ``BaseSampler``. Pero los usuarios deben especificar uno de ellos.
ja: ``GroverOptimizer`` は ``QuantumInstance`` と ``BaseSampler`` の両方をサポートしていますが、ユーザーはそれらのいずれかを指定する必要があります。
te: ``GroverOptimizer`` రు ``QuantumInstance`` మరియు ``BaseSampler`` రెండింటికి మద్దతు ఇస్తుంది. కానీ వినియోగదారులు తప్పనిసరిగా వాటిలో ఒకదాన్ని పేర్కొనాలి.`.

source: An error occurs because both ``quantum_instance`` and ``sampler`` are set. You can set only one of them.
es_un: Se produce un error porque tanto ``quantum_instance`` como ``sampler`` están configurados. Puedes configurar solo uno de ellos.
ja: ``quantum_instance`` と ``sampler`` の両方が設定されているため、エラーが発生します。設定できるのは一つのみです。
te: ``quantum_instance`` మరియు ``sampler`` రెండూ సెట్ చేయబడినందున ఎర్రర్ ఏర్పడింది. మీరు వాటిలో ఒకదాన్ని మాత్రమే సెట్ చేయాలి.
