Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/01_circuit_basics.po
Languages: bn_bn, es_un, fr, ja, ko, pt_un, ta, te, tr_tr, vi_vn, zh_tw

source: The simulators above are useful because they provide information about the state output by the ideal circuit and the matrix representation of the circuit. However, a real experiment terminates by *measuring* each qubit (usually in the computational :math:`|0\rangle, |1\rangle` basis). Without measurement, we cannot gain information about the state. Measurements cause the quantum system to collapse into classical bits.
bn_bn: উপরের সিমুলেটরগুলি দরকারী, কারণ তারা আদর্শ বর্তনী এবং বর্তনীর ম্যাট্রিক্স উপস্থাপনার দ্বারা দশার ফলাফল সম্পর্কে তথ্য সরবরাহ করে। যদিও একটি বাস্তব গবেষণা প্রতিটি কিউবিট *measuring* করে শেষ হয় (সাধারণত গণনা :math:`|0\rangle, |1\rangle` ভিত্তিতে)। পরিমাপ ছাড়া আমরা দশা সম্পর্কে তথ্য অর্জন করতে পারি না। পরিমাপের কারণে কোয়ান্টাম সিস্টেমটি ধ্রুপদী বিটের মধ্যে পতিত হচ্ছে ।
es_un: Los simuladores anteriores son útiles porque proporcionan información sobre el estado de salida del circuito ideal y la representación matricial del circuito. Sin embargo, un experimento real termina *midiendo* cada qubit (generalmente en la base computacional :math:`|0\rangle, |1\rangle`). Sin medición, no podemos obtener información sobre el estado. Las mediciones hacen que el sistema cuántico colapse en bits clásicos.
fr: Les simulateurs précédents sont utiles car ils fournissent une information sur l'état de sortie d'un circuit idéal et la représentation matricielle de ce circuit. Toutefois, une expérience réelle se termine par la mesure de chaque qubit (habituellement sur la ba se de calcul :math:`|0\rangle, |1\rangle`). Sans mesure, on ne peut pas récupérer d'information à propos de l'état. Mais la mesure provoque l'effrondrement du système quantique en un système de bits classiques.
ja: 上記のシミュレーションは、理想的な回路と回路の行列表示で状態の情報を出力してくれるため便利です。しかし、実際の実験は、各量子ビットを *測定* することで終了します（一般には計算基底 :math:`|0\rangle, |1\rangle` を測定に使います）。測定なしでは、状態の情報を得ることはできません。測定により、量子システムは古典的なビットに崩壊します。
ko: 이러한 시뮬레이터들은 회로의 행렬 상태를 보여주고 이상적인 회로의 상태 결과에 대한 정보를 주기 때문에 유용하다. 그러나 실제의 실험은 각각의 큐비트(보통 computational :math:`|0\rangle, |1\rangle` 기저로 표현된다)를 *측정* 함으로써 끝난다. 측정이 없다면, 상태에 대한 정보를 얻을 수 없다. 또한 측정을 통해 양자 시스템은 고전적인 비트로 붕괴하게 된다.
pt_un: Os simuladores acima são úteis porque fornecem informação sobre o estado final do circuito ideal e a representação em forma de matriz do circuito. No entanto, um experimento real termina *medindo* cada qubit (geralmente na base computacional :math:`|0\rangle, |1\rangle` ). Sem medições, não podemos obter informações sobre o estado. Medições fazem o sistema quântico colapsar para bits clássicos.
ta: மேலேயுள்ள சிமுலேட்டர்கள் பயனுள்ளதாக இருக்கும், ஏனெனில் அவை நிலை சுற்று பற்றிய தகவல்களை இலட்சிய சுற்று மற்றும் சுற்றுகளின் மேட்ரிக்ஸ் பிரதிநிதித்துவத்தால் வழங்குகின்றன. இருப்பினும், ஒரு உண்மையான சோதனை ஒவ்வொரு க்யூபிட்டையும் *measuring* மூலம் முடிவடைகிறது (வழக்கமாக கணக்கீட்டில் :math:`|0\rangle, |1 \rangle` அடிப்படையில்).அளவீடு இல்லாமல், நாங்கள் நிலையைப் பற்றிய தகவல்களைப் பெற முடியாது. அளவீடுகள் குவாண்டம் அமைப்பு கிளாசிக்கல் பிட்களில் சரிவதற்கு காரணமாகின்றன.
te: పై సిమ్యులేటర్‌లు ఉపయోగకరంగా ఉంటాయి ఎందుకంటే అవి ఐడీఎల్ సర్క్యూట్ మరియు సర్క్యూట్ యొక్క మ్యాట్రిక్స్ ప్రాతినిధ్యం ద్వారా స్టేట్ అవుట్‌పుట్ గురించి సమాచారాన్ని అందిస్తాయి. అయినప్పటికీ, ప్రతి క్విట్‌ను *మెజర్మెంట్* ద్వారా నిజమైన ప్రయోగం ముగుస్తుంది (సాధారణంగా గణన :math:`|0\rangle, |1\rangle` బేసిస్లో). మెజర్మెంట్ లేకుండా, మనము స్టేట్ గురించి సమాచారాన్ని పొందలేము. మెజర్మెంట్లు క్వాంటం వ్యవస్థను క్లాసికల్ బిట్స్‌గా కొలాప్స్ అయ్యేలా చేస్తాయి.
tr_tr: Yukarıdaki simülatörler yararlıdır çünkü ideal devre tarafından durum çıktısı ve devrenin matris gösterimi hakkında bilgi sağlarlar. Bununla birlikte, gerçek bir deney her bir kübitin *ölçülmesiyle* sona erer (genellikle hesaplama :math:`|0\rangle, |1\rangle` tabanında). Ölçüm olmadan, durum hakkında bilgi edinemeyiz. Ölçümler, kuantum sisteminin klasik bitlere çökmesine neden olur.
vi_vn: Các trình mô phỏng trên rất hữu ích vì chúng cung cấp thông tin về trạng thái đầu ra của mạch lý tưởng và biểu diễn ma trận của mạch. Tuy nhiên, một thí nghiệm thực sẽ kết thúc bằng cách *đo* mỗi qubit ( thường trong cơ sở tính toán :math:`|0\rangle, |1\rangle`). Nếu không có phép đo, chúng ta không thể có được thông tin về trạng thái. Các phép đo khiến hệ thống lượng tử sụp đổ thành các bit cổ điển.
zh_tw: 上面的模擬器很有用，因為它們提供了由理想電路輸出的狀態以及電路的矩陣表示。 不過，實際實驗會終止 *測量* 每一個 qubit （通常在計算 `|0\rangle， |1\rangle`基底）。 在沒有測量的情況下，我們無法獲得有關狀態的資訊。 測量使量子系統崩潰為古典的位元。

source: For example, suppose we make independent measurements on each qubit of the three-qubit GHZ state
bn_bn: উদাহরণস্বরূপ, ধরুন আমরা তিন-কিউবিট GHZ স্টেটের প্রতিটি কিউবিটে স্বাধীনভাবে পরিমাপ করি
es_un: Por ejemplo, supongamos que hacemos mediciones independientes en cada qubit del estado GHZ de tres qubits
fr: Par exemple, supposons que nous fassions des mesures indépendantes sur chaque qubit de l'état GHZ à trois qubits
ja: 例えば、3量子ビットのGHZ状態の各量子ビットを独立に測定するとしましょう。
ko: 예를 들어, 3개의 큐비트를 가진 GHZ 상태의 각각의 큐비트를 독립적으로 측정한다고 가정해 보자.
pt_un: Por exemplo, suponha que façamos medições independentes em cada qubit do estado GHZ de três qubits
ta: எடுத்துக்காட்டாக, நாம் மூன்று-கிட் GHZ மாநிலத்தின் ஒவ்வொரு விகிதத்தில் சுதந்திரமான அளவீடுகள் செய்யும்
te: ఉదాహరణకు, మూడు-క్విట్ GHZ స్థితి యొక్క ప్రతి క్విట్‌పై మనం స్వతంత్ర కొలతలు చేసామని అనుకుందాం
tr_tr: Örneğin, üç-kübitlik GHZ durumunun her bir kübiti üzerinde bağımsız ölçümler yaptığımızı varsayalım
vi_vn: Ví dụ, giả sử chúng ta thực hiện các phép đo độc lập trên mỗi qubit của trạng thái GHZ ba qubit
zh_tw: 例如，假設我們在三量子位元 GHZ 狀態的每一個位元上進行獨立測量

source: |\psi\rangle = (|000\rangle +|111\rangle)/\sqrt{2},
ta: | \psi\rகோணம் = (| 000\rகோணம் + | 111\rகோணம்)/\sqrt{2},

source: and let :math:`xyz` denote the bitstring that results. Recall that, under the qubit labeling used by Qiskit, :math:`x` would correspond to the outcome on qubit 2, :math:`y` to the outcome on qubit 1, and :math:`z` to the outcome on qubit 0.
bn_bn: এবং এটি ধরা যায় :math:`xyz` ফলাফল বিটস্ট্রিংকে চিহ্নিত করে। স্মরণ করুন, Qiskit দ্বারা ব্যবহৃত কিউবিট নামাঙ্কনে, :math:`x`, কিউবিট ২ এর ফলাফলের সাথে, :math:`y` কিউবিট ১ এ ফলাফলের সাথে, এবং :math:`z` কিউবিট ০ এ ফলাফলের সাথে মিলিত হবে।
es_un: y denotemos la cadena de bits resultante como :math:`xyz`. Recuerda que, bajo el etiquetado de qubits utilizado por Qiskit, :math:`x` correspondería al resultado en el qubit 2, :math:`y` al resultado en el qubit 1, y :math:`z` al resultado en qubit 0.
fr: et notons :math:`xyz` la chaîne de bits résultante. Rappelons que, dans la convention de nommage des qubits utilisée par Qiskit, :math:`x` correspond à la sortie du qubit 2, :math:`y` à la sortie du qubit 1 et :math:`z` à la sortie du qubit 0.
ja: :math:`xyz` が結果のビット列を示すとしましょう。 Qiskitで使用される量子ビットのラベリング方法では、:math:`x` は量子ビット2の結果に対応し、:math:`y` は量子ビット1の結果に対応し、そして、 :math:`z` は量子ビット0の結果に対応します。
ko: 그리고 :math:`xyz` 를 결과의 비트 문자열이라고 하자. Qiskit에서 사용되는 큐비트 표기로는 :math:`x` 가 큐비트 2의 결과에 해당하고, :math:`y` 는 큐비트 1, 그리고 :math:`z` 는 큐비트 0에 해당한다는 사실을 기억하자.
pt_un: e deixe :math:`xyz` denotar o bitstring que resultou. Lembre que, sob o rótulo de qubit usado pelo Qiskit, :math:`x` corresponderia ao resultado no qubit 2, :math:`y` para o resultado no qubit 1 e :math:`z` para o resultado no qubit 0.
ta: மற்றும் விடுங்கள் :math:`xyz` விளைவிக்கும் பிட்ஸ்ட்ரிங்கைக் குறிக்கிறது. Qiskit பயன்படுத்திய க்யூபிட் லேபிளிங்கின் கீழ் , :math:`x` என்பது க்யூபிட் 2 இன் முடிவுக்கு ஒத்திருக்கும், :math:`y` க்யூபிட் 1 இன் முடிவுக்கு, மற்றும் :math:`z` க்யூபிட் 0.
te: మరియు :math:`xyz` ఫలితాన్నిచ్చే బిట్‌స్ట్రింగ్‌ని సూచిస్తాయి. Qiskit ఉపయోగించిన qubit లేబులింగ్ క్రింద, :math:`x` qubit 2 లోని ఫలితానికి, :math:`y` qubit 1 లోని ఫలితానికి మరియు :math:`z`qubit 0 లోని ఫలితానికి అనుగుణంగా ఉంటుందని గుర్తుంచుకోండి.
tr_tr: ve :math:`xyz` sonuç bit dizisini göstersin. Qiskit tarafından kullanılan kübit etiketlemesinin altında şunu hatırlayın :math:`x` kübit 2'deki sonuca, :math:`y` kübit 1'deki sonuca, ve :math:`z` kübit 0'daki sonucuna karşılık gelir.
vi_vn: và để :math:`xyz` biểu thị chuỗi bit kết quả. Nhớ lại , cách qubit được đánh nhãn mà Qiskit đã sử dụng, :math:`x` sẽ ứng với kết quả của qubit 2, :math:`y` sẽ ứng với kết quả của qubit 1, và :math:`z` sẽ ứng với kết quả của qubit 0.
zh_tw: 並讓 :math:`xyz` 表示各個位元的結果字串。Qiskit 可通過各量子位元的標簽調用，:math:`x` 對應於 qubit 2 的結果、:math:`y` 對應於 qubit 1 的結果，而 :math:`z` 對應於 qubit 0 的結果。

source: Note: This representation of the bitstring puts the most significant bit (MSB) on the left, and the least significant bit (LSB) on the right. This is the standard ordering of binary bitstrings. We order the qubits in the same way (qubit representing the MSB has index 0), which is why Qiskit uses a non-standard tensor product order.
bn_bn: টীকা: বিটস্ট্রিংয়ের এই উপস্থাপনাটি বামদিকে সবচেয়ে উল্লেখযোগ্য বিট (MSB) এবং ডানদিকে অন্তত উল্লেখযোগ্য বিট (LSB) রাখে। এটি বাইনারি বিটস্ট্রিংয়ের প্রামাণ্য ক্রম। কিউবিট গুলি একই ক্রমানুসারে স্থাপন করা হয় (এম এস বি প্রতিনিধিত্বকারী কিউবিট গুলির সূচক ০ থাকে), তাই Qiskit প্রামাণ্য টেনসর টেনসর গুণন (প্রোডাক্ট) ব্যবহার করে না।
es_un: Nota: Esta representación de la cadena de bits coloca el bit más significativo (Most Significant Bit, MSB) a la izquierda y el bit menos significativo (Least Significant Bit, LSB) a la derecha. Este es el orden estándar de cadenas de bits binarias. Ordenamos los qubits de la misma manera (el qubit que representa el MSB tiene índice 0), por lo que Qiskit utiliza un orden de producto tensorial no estándar.
fr: Note: Cette représentation de la chaîne de bits place le bit le plus significatif (MSB) à gauche, et le bit le moins significatif (LSB) sur la droite. Il s'agit de l'ordre standard des bits binaires. Nous commandons les qubits de la même façon (le qubit représentant le MSB a l'index 0), c'est pourquoi Qiskit utilise un ordre de produit tensoriel non standard.
ja: 注記：このビット文字列の表現では最上位ビットが左側、最下位ビットが右側に配置されます。これは、バイナリビット文字列における標準的な順序です。そのため、同じ方法で量子ビットも並べます（最上位ビットを表す量子ビットのインデックスは0です）。これが、Qiskitが非標準的なテンソル積の順序を使用する理由です。
ko: 참고: 이러한 비트열 표기는 most significant bit (MSB) 를 왼쪽에 두고 least significant bit (LSB) 를 오른쪽에 둔다. 이는 이진 비트열을 표기하는 일반적인 순서이다. 우리는 큐비트도 이 규칙에 따라 배열한다 (MSB에 해당하는 큐비트는 0으로 인덱스된다). 따라서 Qiskit은 일반적이지 않은 텐서 곱 순서를 사용한다.
pt_un: Obs.: Esta representação do bitstring coloca o bit mais significativo (MSB) à esquerda, e o bit menos significativo (LSB) à direita. Esta é a ordenação padrão de bitstrings binárias. Ordenamos os qubits da mesma forma (qubit representando o MSB tem índice 0), razão pela qual o Qiskit usa uma ordem de produto de tensor não padrão.
ta: குறிப்பு: பிட்ரசின் இந்த பிரதிநிதிப்பு இடது மிகவும் குறிப்பிடத்தக்க பிட் (MSB), மற்றும் குறைந்தது குறிப்பிடத்தக்க பிட் (LSB) வலது. இது இரும bitstrings-யின் நிலையான ஒழுங்குபடுத்தும். நாம் ஒரே வழியில் க்யூபிட் வரிசையில் வரிசைப்படுத்துகிறது (MSB குறித்த குறும்படம் சுட்டி 0), அதனால் Qiskit ஒரு நிலையான டென்ஸர் தயாரிப்பு வரிசை பயன்படுத்துகிறது.
te: గమనిక: బిట్‌స్ట్రింగ్ యొక్క ఈ ప్రాతినిధ్యం ఎడమవైపున అత్యంత ముఖ్యమైన బిట్ (MSB) ని మరియు కుడివైపున కనీసం ముఖ్యమైన బిట్ (LSB) ని ఉంచుతుంది. ఇది బైనరీ బిట్‌స్ట్రింగ్‌ల ప్రామాణిక క్రమం. మేము క్విట్‌లను అదే విధంగా ఆర్డర్ చేస్తాము (MSBని సూచించే క్విట్‌లో ఇండెక్స్ 0 ఉంది), అందుకే Qiskit ప్రామాణికం కాని టెన్సర్ ఉత్పత్తి క్రమాన్ని ఉపయోగిస్తుంది.
tr_tr: Not: Bit dizisinin bu gösterimi en anlamlı biti (MSB) sola, en az anlamlı biti (LSB) sağa yerleştirir. Bu ikili bit dizilerinin standart sıralamasıdır. Kübitleri aynı şekilde sıralıyoruz (en anlamlı biti temsil eden kübit indeksi 0'dir), bu yüzden Qiskit standart olmayan bir tensör çarpımı sıralaması kullanıyor.
vi_vn: Lưu ý: Việc biểu diễn chuỗi bit này đặt bit quan trọng nhất (MSB) ở bên trái và bit ít quan trọng nhất (LSB) ở bên phải. Đây là thứ tự tiêu chuẩn của chuỗi bit nhị phân. Chúng tôi sắp xếp thứ tự các qubit theo cùng một cách (qubit đại diện cho MSB có chỉ số 0), đó là lý do tại sao Qiskit sử dụng thứ tự sản phẩm tensor không theo chuẩn thông thường.
zh_tw: 附註：我們利用二進位字串的標準排序，將最重要的位元（MSB）放在左邊，而將最不重要的位元（LSB）放在右邊。我們以相同方式排列量子位元（代表 MSB 量子位元的標簽為 0）。這就是為什麼 Qiskit 使用非標準張量積排序。

source: Recall the probability of obtaining outcome :math:`xyz` is given by
bn_bn: স্মরণ করুন, :math:`xyz` ফলাফল পাওয়ার সম্ভাব্যতা হল
es_un: Recuerda la probabilidad de obtener un resultado :math:`xyz` viene dada por
fr: Rappelons que la probabilité d'obtenir un résultat :math:`xyz` est définie par
ja: :math:`xyz` の結果が得られる確率は、以下のように与えられることを思い出してください。
ko: :math:`xyz` 의 결과를 얻는 확률은 다음과 같이 주어진다.
pt_un: Lembre-se que a probabilidade de obter resultado :math:`xyz` é dada por
ta: முடிவைப் பெறுவதற்கான நிகழ்தகவை நினைவுகூருங்கள் :math:`xyz` வழங்கியது
te: ఫలితం పొందే సంభావ్యతను గుర్తుకు తెచ్చుకోండి :math:`xyz` ద్వారా ఇవ్వబడింది
tr_tr: :math:`xyz` çıktısının elde edilme olasılığının şu şekilde verildiğini hatırlayın
vi_vn: Nhớ lại rằng xác suất đạt được kết quả :math:`xyz` được cho bởi
zh_tw: 依前所述，獲得 :math:`xyz` 結果的機率可以表時為

source: and as such for the GHZ state probability of obtaining 000 or 111 are both 1/2.
bn_bn: এবং যেমন GHZ স্টেটের ক্ষেত্রে 000 বা 111 পাওয়ার সম্ভাবনা উভয় ক্ষেত্রেই 1/2।
es_un: y como tal para el estado GHZ, la probabilidad de obtener 000 o 111 es 1/2.
fr: et ainsi les probabilités d'obtenir 000 ou 111 à partir de l'état GHZ sont toutes les deux 1/2.
ja: そして、GHZ状態の場合、000または111が得られる確率はどちらも1/2です。
ko: 따라서 GHZ 상태에서 000 혹은 111의 결과를 얻을 확률은 둘 다 1/2이다.
pt_un: e como tal, a probabilidade de estado GHZ de obter 000 ou 111 são ambos de 1/2.
ta: ஆயிரக்கணக்கான GHZ மாநில உற்பத்தி மாநில அளவிலான ஆயிரம் அல்லது 111 இரண்டும்.
te: మరియు 000 లేదా 111 పొందే GHZ స్థితి సంభావ్యత రెండూ 1/2.
tr_tr: ve bu şekilde GHZ durumu için 000 veya 111 elde etme olasılığı her ikisi için de 1/2'dir.
vi_vn: và như vậy đối với trạng thái GHZ xác suất thu được 000 hoặc 111 đều là 1/2.
zh_tw: 從而，由 GHZ 狀態獲得結果 000 或 111 的概率都是 1/2。

source: To simulate a circuit that includes measurement, we need to add measurements to the original circuit above, and use a different Aer backend.
bn_bn: পরিমাপ অন্তর্ভুক্ত এমন একটি সার্কিট অনুকরণ করতে, আমাদের উপরের মূল সার্কিটটিতে পরিমাপ যুক্ত করতে হবে এবং একটি ভিন্ন Aer ব্যাকএন্ড ব্যবহার করতে হবে।
es_un: Para simular un circuito que incluye medición, necesitamos agregar mediciones al circuito original anterior y usar un backend de Aer diferente.
fr: Pour simuler un circuit qui inclut la mesure, nous avons besoin d'ajouter les mesures aux circuits précédents et d'utiliser un environnement Aer différent.
ja: 測定を含む回路をシミュレートするためには、上記の回路に測定を追加し、異なるAerバックエンドを使用する必要があります。
ko: 측정을 포함하는 회로를 시뮬레이트하기 위해서는 원래의 회로에 측정들을 추가해야 하고, 다른 Aer 백엔드를 사용해야 한다.
pt_un: Para simular um circuito que inclui medição, precisamos adicionar medições ao circuito original acima e usar um backend Aer diferente.
ta: அளவீடுகளைக் கொண்டிருக்கும் ஒரு சுற்றுச்சூழல், நாம் மேலே மூல சுற்றுப்பாதைக்கு அளவுகோல்களை சேர்க்க வேண்டும், மற்றும் வேறுபடும் ஆர் பின்னணியை பயன்படுத்தவும்.
te: కొలతను కలిగి ఉన్న సర్క్యూట్‌ను అనుకరించడానికి, పైన ఉన్న అసలు సర్క్యూట్‌కు మేము కొలతలను జోడించాలి మరియు వేరే Aer బ్యాకెండ్‌ని ఉపయోగించాలి.
tr_tr: Ölçümü içeren bir devreyi simüle etmek için yukarıdaki orijinal devreye ölçümler eklememiz ve farklı bir Aer arka ucu kullanmamız gerekir.
vi_vn: Để mô phỏng một mạch bao gồm phép đo, chúng ta cần thêm các phép đo vào mạch gốc ở trên và sử dụng một backend Aer khác.
zh_tw: 若要模擬包含測量的電路，我們需要將測量方法新增至上方的原始電路，並使用不同的 Aer 後端。

source: This circuit adds a classical register, and three measurements that are used to map the outcome of qubits to the classical bits.
bn_bn: এই বর্তনী (সার্কিট) একটি ধ্রুপদী (ক্লাসিক্যাল) রেজিস্টার এবং তিনটি পরিমাপ এর দ্বারা সার্কিট যোগ করে, যেগুলো কিউবিটের ফলাফল, ধ্রুপদী (ক্লাসিক্যাল) বিট গুলিতে সঞ্চয় করে।
es_un: Este circuito agrega un registro clásico y tres mediciones que se utilizan para mapear el resultado de los qubits a los bits clásicos.
fr: Ce circuit ajoute un registre classique, et 3 mesures qui sont utilisés pour faire correspondre la mesure de chaque qubit à son bit classique.
ja: この回路は古典レジスターと３つの測定を追加して、量子ビットの結果を古典ビットにマップします。
ko: 이 회로는 고전 레지스터와, 큐비트의 결과를 고전 비트에 연결하기 위한 세 개의 측정들을 추가한다.
pt_un: Este circuito adiciona um registro clássico e três medições que são usadas para mapear o resultado dos qubits nos bits clássicos.
ta: இந்த சுற்றுப்பாதை ஒரு கிளாசிரியர் பதிப்பு சேர்க்கிறது, மற்றும் மூன்று அளவுகள் that are used to map to map to map to the classical bits.
te: ఈ సర్క్యూట్ క్లాసికల్ రిజిస్టర్‌ను జోడిస్తుంది మరియు క్విట్‌ల ఫలితాన్ని క్లాసికల్ బిట్‌లకు మ్యాప్ చేయడానికి ఉపయోగించే మూడు కొలతలు.
tr_tr: Bu devre, klasik bir saklayıcı ve kübitlerin sonuçlarını klasik bitlerle eşleştirmek için kullanılan üç ölçüm ekler.
vi_vn: Mạch này bổ sung một thanh ghi cổ điển, và ba phép đo được sử dụng để ánh xạ kết quả của qubit tới các bit cổ điển.
zh_tw: 這個電路新增了一個古典暫存器與三個測量操作，它們將量子位元的測量結果一一映射到古典位元上。

source: To simulate this circuit, we use the ``qasm_simulator`` in Qiskit Aer. Each run of this circuit will yield either the bitstring 000 or 111. To build up statistics about the distribution of the bitstrings (to, e.g., estimate :math:`\mathrm{Pr}(000)`), we need to repeat the circuit many times. The number of times the circuit is repeated can be specified in the ``execute`` function, via the ``shots`` keyword.
bn_bn: বর্তনীটি(সার্কিট) সিমুলেট করার জন্য আপনি Qiskit এয়ার -এর ``qasm_simulator`` ব্যবহার করতে পারেন। প্রত্যেকবার ফলাফল হিসাবে বিটস্ট্রিং ০০০ অথবা ১১১ পাওয়া যাবে। বিটস্ট্রিংগুলির বিতরণ সম্পর্কে পরিসংখ্যান তৈরি করতে (উদাহরণ: অনুমান :math:`\mathrm{Pr}(000)`), আপনাদের বর্তনীটির (সার্কিট) পুনরাবৃত্তি করতে হবে। পুনরাবৃত্তির সংখ্যা ``execute`` ফাংশনের ``shots`` কীওয়ার্ড এর মাধ্যমে নির্ধারণ করা যায়।
es_un: Para simular este circuito, usamos el ``qasm_simulator`` de Qiskit Aer. Cada ejecución de este circuito producirá la cadena de bits 000 o 111. Para generar estadísticas sobre la distribución de las cadenas de bits (para, por ejemplo, estimar :math:`\mathrm{Pr}(000)`), necesitamos repetir el circuito muchas veces. El número de veces que se repite el circuito se puede especificar en la función ``execute``, mediante la palabra clave ``shots``.
fr: Pour simuler ce circuit, nous utilisons ``qasm_simulator`` de Qiskit Aer. Chaque exécution ("tir" ou "shot" en anglais) de ce circuit aboutira soit à une séquence 000, soit à 111. Pour obtenir une statistique de la distribution des résultats (par exemple, estimer :math:`\mathrm{Pr}(000)`), nous devrons exécuter le circuit plusieurs fois. Le nombre de fois où le circuit sera testé peut être spécifié dans la fonction ``execute`` par le mot-clé ``shots``.
ja: この回路をシミュレートするためには、Qiskit Aerの ``qasm_simulator`` を使います。この回路を実行するたびに000または111が生成されます。ビット列の分布についての統計を取るために(例えば、:math:`\mathrm{Pr}(000)` を見積もるために)、何回も回路を繰り返す必要があります。回路の繰り返し回数は ``execute`` 関数の ``shots`` キーワードで指定できます。
ko: 이 회로를 시뮬레이트하기 위해서 Qiskit Aer 에 있는 ``qasm_simulator`` 를 사용한다. 이 회로의 각각의 실행은 비트 문자열 000 혹은 111을 생성한다. 비트 문자열 (예를 들어 :math:`\mathrm{Pr}(000)` )의 분포에 대한 통계를 얻기 위해서는 회로를 여러번 실행해야 한다. 회로가 반복되는 횟수를 결정하기 위해서는 ``execute`` 함수에 있는 ``shots`` 키워드를 조정하면 된다.
pt_un: Para simular este circuito, usamos o ``qasm_simulator`` do Qiskit Aer. Cada execução desse circuito resultará na bitstring 000 ou 111. Para construir estatísticas sobre a distribuição das bitstrings (para, por exemplo, estimar :math:`\mathrm{Pr}(000)`), precisamos repetir o circuito várias vezes. O número de repetições pode ser especificado na função ``execute`` através da palavra-chave ``shots``.
ta: இந்த சுற்றுப்பாதை பாதிப்பதற்கு, நாங்கள் Qiskit Aer ``qasm_simulator`` பயன்படுத்தும்.இந்த சுற்றுச்சூழல் ஒவ்வொரு ஓட்டும் பிட்ரேட் 000 அல்லது 111. Bitstrings (to, எ. கா, கணக்கெடுப்பு :math:`\mathrm{Pr}(000)`) பற்றிய புள்ளிவிவரங்கள் பற்றிய புள்ளிவிவரங்கள் உருவாக்க வேண்டும். இந்த சாதனத்தின் எண்ணிக்கை மறுபடியும், ``shots`` என்ற சொல் வழியாக, ``execute`` செயல்பாட்டில் குறிப்பிடலாம்.
te: ఈ సర్క్యూట్‌ను అనుకరించడానికి, మేము Qiskit Aerలో ``qasm_simulator``ని ఉపయోగిస్తాము. ఈ సర్క్యూట్ యొక్క ప్రతి పరుగు బిట్‌స్ట్రింగ్ 000 లేదా 111ని ఇస్తుంది. బిట్‌స్ట్రింగ్‌ల పంపిణీ గురించి గణాంకాలను రూపొందించడానికి (ఉదా., అంచనా :math:`\mathrm{Pr}(000)`), మేము దీన్ని పునరావృతం చేయాలి చాలా సార్లు సర్క్యూట్. సర్క్యూట్ ఎన్నిసార్లు పునరావృతం చేయబడుతుందో ``షాట్స్`` కీవర్డ్ ద్వారా ``ఎగ్జిక్యూట్`` ఫంక్షన్‌లో పేర్కొనవచ్చు.
tr_tr: Bu devreyi simüle etmek için Qiskit Aer'deki ``qasm_simulator``ı kullanıyoruz. Bu devrenin her çalışması 000 veya 111 bit dizisini verir. Bit dizelerinin dağılımı hakkında istatistik oluşturmak için (örneğin, :math:`\mathrm{Pr}(000)`ı tahmin etmek için), devreyi birçok kez tekrar ettirmemiz gerekir. Devrenin tekrarlanma sayısı, ``shots`` anahtar kelimesi ile ``execute`` işlevinde belirlenebilir.
vi_vn: Để mô phỏng mạch này, chúng tôi sử dụng ``qasm_simulator`` trong Qiskit Aer. Mỗi lần chạy mạch này sẽ mang lại kết quả là chuỗi bit 000 hoặc 111. Để xây dựng thống kê về sự phân bố của các chuỗi bit (ví dụ như để ước tính :math:`\mathrm{Pr}(000)`), chúng ta phải lặp lại mạch nhiều lần. Số lần mạch được lặp lại có thể được chỉ định trong hàm ``execute``, thông qua từ khóa ``shots``.
zh_tw: 如果要模擬此電路，我們使用 Qiskit Aer 中的 ``qasm_simulator``。每一個執行此電路都會輸出位元字串 000 或 111。如果統計輸出位元字串的分佈（例如，估計得到 :math:`\mathrm{Pr}(000)` 的幾率），我們需要多次重複此電路。在 ``execute`` 函數中，透過關鍵字 ``shots``，可以指定電路重複的次數。

source: Once you have a result object, you can access the counts via the function ``get_counts(circuit)``. This gives you the *aggregated* binary outcomes of the circuit you submitted.
bn_bn: আপনার কোনও ফলাফলের অবজেক্ট তৈরী হয়ে গেলে আপনি `` get_counts (circuit) `` ফাংশনটির মাধ্যমে পরিসংখ্যান গুলি পর্যবেক্ষণ করতে পারেন. এটি আপনাকে উপস্থাপিত সার্কিটের * একত্রিত (aggregated) * বাইনারি ফলাফল দেয়।
es_un: Una vez que tengas un objeto de resultado, puedes acceder a los recuentos a través de la función ``get_counts(circuit)``. Esto te brinda los resultados binarios *agregados* del circuito que enviaste.
fr: Une fois que vous avez un objet résultat, vous pouvez obtenir le comptage (counts) par la fonction ``get_counts(circuit)``. Cela vous donne le résultat sous forme **d'agrégats** binaires du circuit testé.
ja: result オブジェクトを取得できたら、``get_counts(circuit)`` 関数を使用して回数を取得することができます。これにより、送信した回路の *集計* されたバイナリー結果が得られます。
ko: 결과 객체를 얻은 후에는 이러한 시뮬레이션 횟수를 ``get_counts(circuit)`` 함수를 통해 접근할 수 있다. 이를 통해서 지금까지 실행했던 시뮬레이션의 합산된 결과 값을 구할 수 있다.
pt_un: Uma vez que você possua um objeto de resultado, você pode acessar as contagens através da função ``get_counts(circuit)``. Isso lhe fornece os resultados binários *agregados* do circuito que você submeteu.
ta: உங்களிடம் ஒரு முடிவு பொருள் கிடைத்ததும், ``get_counts (circuit)`` முறை மூலம் எண்ணிக்கையை அணுகலாம். இது நீங்கள் ஓடிய சோதனையின் மொத்த விளைவுகளை வழங்குகிறது.
te: మీరు ఫలిత వస్తువును కలిగి ఉన్న తర్వాత, మీరు ``get_counts(circuit)`` ఫంక్షన్ ద్వారా గణనలను యాక్సెస్ చేయవచ్చు. ఇది మీరు సమర్పించిన సర్క్యూట్ యొక్క *సమగ్ర* బైనరీ ఫలితాలను అందిస్తుంది.
tr_tr: Bir sonuca sahip olduğunuzda, sayılara ``get_counts(circuit)`` işlevi üzerinden erişebilirsiniz. Bu, gönderdiğiniz devrenin *toplanmış* ikili sonuçlarını verir.
vi_vn: Khi bạn có một đối tượng kết quả, bạn có thể truy cập số lượng(counts) thông qua hàm ``get_counts(circuit)``. Hàm này cung cấp cho bạn kết quả nhị phân * tổng hợp * của mạch bạn đã gửi.
zh_tw: 當您有結果之後，您可以透過函數 ``get_counts(circuit)`` 來獲得計數。 這會 *集中* 給您所提交電路的二進位結果。
