Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/01_circuit_basics.po
Languages: bn_bn, es_un, fr, ja, ko, pt_un, ta, te, tr_tr, vi_vn, zh_tw

source: Approximately 50 percent of the time, the output bitstring is 000. Qiskit also provides a function ``plot_histogram``, which allows you to view the outcomes.
bn_bn: প্রায় 50 শতাংশ সময়, আউটপুট বিটস্ট্রিংটি 000। Qiskit ``plot_histogram`` নামে একটি ফাংশনও সরবরাহ করে, যা আপনাকে ফলাফলগুলি দেখতে দেয়।
es_un: Aproximadamente el 50 por ciento de las veces, la cadena de bits de salida es 000. Qiskit también proporciona una función ``plot_histogram``, que te permite ver los resultados.
fr: Approximativement 50% du temps, le résultat sera 000. Qiskit fournit également une fonction ``plot_histogram`` qui vous permet de visualiser le résultat.
ja: 約50％の回数で、出力ビット文字列は000です。Qiskitは、結果を表示できる関数 ``plot_histogram`` も提供します。
ko: 대략 50 퍼센트 정도는 결과 비트 문자열이 000인 값을 가진다. 또한 Qiskit은 결과를 보여주는 ``plot_histogram`` 함수를 제공한다.
pt_un: Aproximadamente 50% do tempo, a bitstring de saída é 000. O Qiskit também fornece uma função ``plot_histogram``, que permite você ver os resultados.
ta: ஏறத்தாழ 50 சதவீதம் நேரம், வெளியீடு பிட்ரம் 000. Qiskit also provides a function ``plot_histogram``, which allows you to view the outcomes.
te: దాదాపు 50 శాతం సమయం, అవుట్‌పుట్ బిట్‌స్ట్రింగ్ 000. Qiskit కూడా ``plot_histogram`` ఫంక్షన్‌ను అందిస్తుంది, ఇది ఫలితాలను వీక్షించడానికి మిమ్మల్ని అనుమతిస్తుంది.
tr_tr: Zamanın yaklaşık yüzde 50'sinde, çıktı bit dizisi 000'dır. Qiskit ayrıca sonuçları görmenizi sağlayan bir ``plot_histogram`` fonksiyonu da sağlamaktadır.
vi_vn: Xấp xỉ 50% thời gian, kết quả của chuỗi bit đầu ra là 000. Qiskit cũng cung cấp một hàm ``plot_histogram``, cho phép bạn xem kết quả.
zh_tw: 大約 50% 的機率，輸出位元串是 000。Qiskit 還提供了 ``plot_histogram`` 函數，可讓您檢視結果。

source: The estimated outcome probabilities :math:`\mathrm{Pr}(000)` and :math:`\mathrm{Pr}(111)` are computed by taking the aggregate counts and dividing by the number of shots (times the circuit was repeated). Try changing the ``shots`` keyword in the ``execute`` function and see how the estimated probabilities change.
bn_bn: :math:`\mathrm{Pr}(000)``এবং :math:`\mathrm{Pr}(111)` আনুমানিক সম্ভাবনার মান, সমস্ত পরিসংখ্যাকে শট সংখ্যা (বর্তনীটির পুনর্ব্যবহার সংখ্যা) দিয়ে ভাগ করে গণনা করা হয় । ``execute`` ফাংশনের ``shots``কীওয়ার্ডের মান পরিবর্তন করে অনুমানযোগ্য সম্ভাবনাগুলির কিরূপ পরিবর্তন হয় তা দেখুন।
es_un: Las probabilidades de salida estimadas :math:`\mathrm{Pr}(000)` y :math:`\mathrm{Pr}(111)` se calculan tomando los conteos agregados y dividiendo entre el número de iteraciones (cantidad de veces que el circuito fue repetido). Intenta cambiar el valor de ``shots`` en la función ``execute`` y ve cómo cambian las probabilidades estimadas.
fr: Les probabilités estimées des résultats :math:`\mathrm{Pr}(000)` et :math:`\mathrm{Pr}(111) sont calculées en prenant l'agrégat comptage (counts) et en le divisant par le nombres de "tirs" (le nombre de répétitions de l'execution du circuit). Essayez de modifier la valeur du mot-clé ``shots`` dans la fonction ``execute`` et voyez comment cela affecte la probabilité estimée.
ja: 推定された結果の確率 :math:`\mathrm{Pr}(000)` と :math:`\mathrm{Pr}(111)` は、カウントを集計し、ショット数（回路が繰り返された回数）で割ることによって計算されます。 ``execute`` 関数の ``shots`` キーワードを変更してみて、推定される確率がどのように変化するか確認してください。
ko: 예측값인 확률 :math:`\mathrm{Pr}(000)`과 :math:`\mathrm{Pr}(111)`는 유효 카운트를 모두 더한 후에 (회로가 몇번 실행되었는지를 가르키는) 시뮬레이션 숫자로 나누어서 계산되어진다. ``execute`` 함수에 있는 ``shots`` 키워드를 수정해 보면서 예측 확률값이 어떻게 변하는지 살펴보라.
pt_un: As probabilidades estimadas do resultado :math:`\mathrm{Pr}(000)` e :math:`\mathrm{Pr}(111)` são computadas dividindo as contagens agregadas pelo número de shots (vezes que o circuito foi repetido). Tente alterar a palavra-chave ``shots`` na função ``execute`` e veja como as probabilidades estimadas mudam.
ta: மதிப்பிடப்பட்ட விளைவு நிகழ்தகவுகள் :math:`\mathrm{Pr}(000)` மற்றும் :math:`\mathrm{Pr}(111)` மொத்த எண்ணிக்கையை எடுத்து காட்சிகளின் எண்ணிக்கையால் வகுப்பதன் மூலம் கணக்கிடப்படுகிறது (சுற்று இருந்த நேரங்கள் மீண்டும் மீண்டும்). ``execute`` செயல்பாட்டில் ``shots`` முக்கிய சொல்லை மாற்ற முயற்சிக்கவும், மதிப்பிடப்பட்ட நிகழ்தகவுகள் எவ்வாறு மாறுகின்றன என்பதைப் பார்க்கவும்.
te: అంచనా వేయబడిన ఫలిత సంభావ్యతలు :math:`\mathrm{Pr}(000)` మరియు :math:`\mathrm{Pr}(111)` మొత్తం గణనలను తీసుకొని షాట్‌ల సంఖ్యతో (సర్క్యూట్ జరిగిన సమయాలలో విభజించడం ద్వారా గణించబడతాయి. పునరావృతం). ``execute`` ఫంక్షన్‌లో ``shots`` కీవర్డ్‌ని మార్చడానికి ప్రయత్నించండి మరియు అంచనా వేయబడిన సంభావ్యత ఎలా మారుతుందో చూడండి.
tr_tr: Tahmini sonuç olasılıkları :math:`\mathrm{Pr}(000)` ve :math:`\mathrm{Pr}(111)` kümesindeki toplam sayıları alarak ve bunları deneme sayısına (devrenin tekrarlanma sayısı) bölünerek hesaplanır. ``execute`` işlevindeki ``shots`` anahtar kelimesini değiştirmeyi deneyin ve tahmini olasılıkların nasıl değiştiğini görün.
vi_vn: Xác suất ước tính của kết quả :math:`\mathrm{Pr}(000)` và :math:`\mathrm{Pr}(111)` được tính bằng cách lấy số tổng hợp các lần đếm và chia cho số tổng số lần (shots) (số lần lặp lại mạch). Hãy thử thay đổi từ khóa ``shots`` trong hàm ``execute`` và xem các xác suất ước tính thay đổi như thế nào.
zh_tw: 要估計結果為 :math:`\mathrm{Pr}(000)` 和 :math:`\mathrm{Pr}(111)` 幾率，需分別由結果的總計數除以電路回復的次數得到。請嘗試變更 ``execute`` 函數中的關鍵字 ``shots``，來查看估計機率如何變化。

source: After you create the circuit with its registers, you can add gates ("operations") to manipulate the registers. As you proceed through the tutorials you will find more gates and circuits; below is an example of a quantum circuit that makes a three-qubit GHZ state
ja: レジスタで回路を作成した後、レジスタを操作するためのゲート ("演算") を追加することができます。チュートリアルを進めていくと、さらに多くのゲートと回路が見つかります。以下は3量子ビットのGHZ状態を作る量子回路の例です。
te: మీరు దాని రిజిస్టర్‌లతో సర్క్యూట్‌ను సృష్టించిన తర్వాత, రిజిస్టర్‌లను మార్చటానికి మీరు గేట్‌లను ("ఆపరేషన్స్") జోడించవచ్చు. మీరు ట్యుటోరియల్స్ ద్వారా కొనసాగినప్పుడు మీరు మరిన్ని గేట్లు మరియు సర్క్యూట్‌లను కనుగొంటారు; మూడు-క్విట్ GHZ స్థితిని చేసే క్వాంటం సర్క్యూట్ యొక్క ఉదాహరణ క్రింద ఉంది

source: Qiskit's quant_info module also has an operator method which can be used to make a unitary operator for the circuit. This calculates the :math:`2^n \times 2^n` matrix representing the quantum circuit.
es_un: El módulo quant_info de Qiskit también tiene un método de operador que puede usarse para hacer un operador unitario para el circuito. Esto calcula la matriz :math:`2^n \times 2^n` que representa el circuito cuántico.
ja: Qiskitのquant_infoモジュールには、回路のユニタリー演算子を作成するために使用できる演算子メソッドもあります。 これにより、量子回路を表す :math:`2^n \times 2^n` 行列が計算されます。
te: Qiskit యొక్క quant_info మాడ్యూల్ కూడా ఒక ఆపరేటర్ పద్ధతిని కలిగి ఉంది, ఇది సర్క్యూట్ కోసం యూనిటరీ ఆపరేటర్‌ను తయారు చేయడానికి ఉపయోగించవచ్చు. ఇది క్వాంటం సర్క్యూట్‌ను సూచించే :math:`2^n \times 2^n` మాతృకను గణిస్తుంది.

source: To create such a state, we start with a three-qubit quantum register. By default, each qubit in the register is initialized to :math:`|0\rangle`. To make the GHZ state, we apply the following gates: - A Hadamard gate :math:`H` on qubit 0, which puts it into the superposition state :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}`. - A controlled-Not operation (:math:`C_{X}`) between qubit 0 and qubit 1. - A controlled-Not operation between qubit 0 and qubit 2.
tr_tr: Böyle bir durum yaratmak için üç kübitlik bir kuantum yazmaçıyla başlıyoruz. Varsayılan olarak, yazmaçtaki her kübit :math:`|0\rangle` olarak başlatılır. GHZ durumunu yapmak için takip eden kapıları uygularız: - Kübit 0'da bir Hadamard kapısı :math:`H`, bu kübiti süperpozisyon durumuna sokar :math:`\left(|0\rangle+|1\rangle\right )/\sqrt{2}`. - kübit 0 ve kübit 1 arasında kontrollü-Not işlemi (:math:`C_{X}`). - Kübit 0 ve kübit 2 arasında kontrollü-Not işlemi.
