Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/01_circuit_basics.po
Languages: bn_bn, es_un, fr, ja, ko, pt_un, ta, te, tr_tr, vi_vn, zh_tw

source: This page was generated from `tutorials/circuits/01_circuit_basics.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/circuits/01_circuit_basics.ipynb`__ -থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/circuits/01_circuit_basics.ipynb`__.
fr: Cette page a été générée à partir de `tutorials/circuits/01_circuit_basics.ipynb`__.
ja: このページは `tutorials/circuits/01_circuit_basics.ipynb`__ から生成されました。
ko: 이 페이지는 `tutorials/circuits/01_circuit_basics.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `tutorials/finance/11_time_series.ipynb`__.
ta: இந்த பக்கம் `tutorials/circuits/1_getting_started_with_qiskit.ipynb`__ இல் இருந்து உருவாக்கப்பட்டது.
te: ఈ పేజీ `tutorials/circuits/01_circuit_basics.ipynb`__ నుండి రూపొందించబడింది.
tr_tr: Bu sayfa `tutorials/circuits/01_circuit_basics.ipynb`__ adresinden oluşturulmuştur.
zh_tw: 這個頁面是從 `tutorials/circuits/01_circuit_basics.ipynb`__ 產生的。

source: Circuit Basics
bn_bn: বর্তনীর (সার্কিট) প্রাথমিক ধারণা
es_un: Aspectos Básicos de un Circuito
fr: Principes de base des circuits
ja: 回路の基本
ko: 회로의 기초
pt_un: Básico sobre Circuito
ta: மின்சுற்று அடிப்படை
te: సర్క్యూట్ బేసిక్స్
tr_tr: Devre Temelleri
vi_vn: Nguyên lý cơ bản của mạch lượng tử
zh_tw: 基本電路

source: Here, we provide an overview of working with Qiskit. Qiskit provides the basic building blocks necessary to program quantum computers. The fundamental unit of Qiskit is the `quantum circuit <https://en.wikipedia.org/wiki/Quantum_circuit>`__. A basic workflow using Qiskit consists of two stages: **Build** and **Run**. **Build** allows you to make different quantum circuits that represent the problem you are solving, and **Run** that allows you to run them on different backends. After the jobs have been run, the data is collected and postprocessed depending on the desired output.
bn_bn: এখানে, আমরা Qiskit এর সাথে কাজ করার একটি সাধারণ ধারণা পাবো। কোয়ান্টাম কম্পিউটারের প্রোগ্রাম করার জন্য প্রয়োজনীয় বিল্ডিং ব্লক Qiskit সরবরাহ করে। Qiskit এর মৌলিক এককটি হ'ল `quantum circuit <https://en.wikipedia.org/wiki/Quantum_circuit>`__। Qiskit -এর প্রাথমিক কর্মপ্রবাহ দুটি ধাপ নিয়ে গঠিত: **Build** এবং **Run**। আপনি যে সমস্যার সমাধান করছেন তা প্রতিনিধিত্ব করার জন্য **Build** আপনাকে বিভিন্ন কোয়ান্টাম সার্কিট তৈরি করতে দেয় এবং **Run** আপনাকে বিভিন্ন ব্যাক-এন্ডে এগুলোকে চালানোর অনুমতি দেয়। কাজ সম্পাদনের পর, ডেটা সংগ্রহ করা হয় এবং পছন্দমত ফলাফলের উপর নির্ভর করে পরবর্তী গণনা করা হয়।
es_un: Aquí, proporcionamos una descripción general del trabajo con Qiskit. Qiskit proporciona los componentes básicos necesarios para programar computadoras cuánticas. La unidad fundamental de Qiskit es el `circuito cuántico <https://en.wikipedia.org/wiki/Quantum_circuit>`__. Un flujo de trabajo básico con Qiskit consta de dos etapas: **Construir** y **Ejecutar**. **Construir** te permite crear diferentes circuitos cuánticos que representan el problema que estás resolviendo y **Ejecutar** te permite ejecutarlos en diferentes backends. Una vez que se han ejecutado los trabajos (jobs), los datos se recopilan y posprocesan según el resultado deseado.
fr: Ici, nous vous présentons une vue d'ensemble de l'utilisation de Qiskit. Le package fondamental de Qiskit est Terra qui fournit les éléments de base nécessaires à la programmation des ordinateurs quantiques. L'unité fondamentale de Qiskit est le `circuit quantique <https://en.wikipedia.org/wiki/Quantum_circuit>`__. Un workflow de base en utilisant Qiskit se compose de deux étapes : **Build** et **Execute**. **Build** vous permet de construire différents circuits quantiques qui représentent le problème que vous êtes en train de résoudre, et **Execute** qui vous permet de les exécuter sur différents backends. Après que les travaux ont été exécutés, les données sont collectées et traitées en fonction du résultat souhaité.
ja: ここでは、Qiskitでの作業概要を説明します。Qiskitは、量子コンピューターのプログラミングに必要な、基本構成要素を提供します。Qiskitの基本単位は `量子回路（quantum circuit） <https://en.wikipedia.org/wiki/Quantum_circuit>`__ です。Qiskitを使用した基本的なワークフローは、 **構築** と **実行** の2つのステージで構成されます。 **構築** では、あなたが解きたい問題を表現するさまざまな量子回路を構築でき、 **実行** では、その量子回路をさまざまなバックエンドで実行します。ジョブが実行された後、目的とする出力に応じたデータが収集され、後処理されます。
ko: 여기에서는 Qiskit 사용에 대한 개요를 설명한다. Qiskit은 양자 컴퓨터를 프로그램하기 위해 필수적인 기초 구성 요소들을 제공한다. Qiskit의 기본 단위는 `양자 회로 <https://en.wikipedia.org/wiki/Quantum_circuit>`__ 이다. Qiskit의 작업 흐름은 두 단계로 나뉜다: **빌드** 와 **실행** 이다. **빌드** 는 해결하고픈 문제를 나타내는 다양한 양자회로들을 구축할 수 있게 하며, **실행** 은 이 회로들을 여러 백엔드에서 실행할 수 있게 한다. 작업들이 다 실행되었을 때, 데이터는 원하는 출력에 따라 수집되고 후처리가 된다.
pt_un: Aqui, fornecemos uma visão geral sobre como trabalhar com o Qiskit. O Qiskit fornece os blocos de construção básicos necessários para programar computadores quânticos. A sua unidade fundamental é o `quantum circuit <https://en.wikipedia.org/wiki/Quantum_circuit>`__. Um fluxo de trabalho básico usando Qiskit consiste de dois estágios: **Construir** e **Executar**. **Construir** permite que você crie diferentes circuitos quânticos que representam o problema que você está resolvendo, e **Executar** permite que você os execute em diferentes backends. Após a execução dos trabalhos, os dados são coletados e processados dependendo do resultado desejado.
ta: இங்கு, நாங்கள் Qiskit யுடன் பணிபுரிந்த ஒரு மேலோட்டை வழங்குங்கள். Qiskit. Qiskit அடிப்படை தொகுப்பு டெர்ரா அதாவது நிரல் குண்டம் கணினிகளுக்கு தேவையான அடிப்படை கட்டிடக்கலை வழங்குகிறது. Qiskit இன் அடிப்படை அலகு `ക്வாண்டம் சுழல் <https://en.wikipedia.org/wiki/Quantum_circuit>`__. Qiskit பயன்படுத்தி ஒரு அடிப்படை பணிமேடை இரண்டு நிலைகளைக் கொண்டுள்ளது:**Build** and **Execute**. **Build** சிக்கலைக் குறிக்கும் வெவ்வேறு குவாண்டம் சுற்றுகளை நீங்கள் செய்ய வேண்டும், மற்றும் **Execute** இது வெவ்வேறு பின்தளத்தில் அவற்றை இயக்க உங்களை அனுமதிக்கிறது. வேலைகள் இயங்குவதற்கு பிறகு, தேவையான வெளியீட்டைப் பொறுத்து, தரவு தொகுக்கப்பட்டு பதவியேற்றுகிறது.
te: ఇక్కడ, మేము Qiskitతో పని చేసే అవలోకనాన్ని అందిస్తాము. క్విస్కిట్ క్వాంటం కంప్యూటర్‌లను ప్రోగ్రామ్ చేయడానికి అవసరమైన ప్రాథమిక బిల్డింగ్ బ్లాక్‌లను అందిస్తుంది. Qiskit యొక్క ప్రాథమిక యూనిట్ `క్వాంటం సర్క్యూట్ <https://en.wikipedia.org/wiki/Quantum_circuit>`__. Qiskitని ఉపయోగించే ప్రాథమిక వర్క్‌ఫ్లో రెండు దశలను కలిగి ఉంటుంది: **బిల్డ్** మరియు **రన్**. **బిల్డ్** మీరు పరిష్కరిస్తున్న సమస్యను సూచించే విభిన్న క్వాంటం సర్క్యూట్‌లను తయారు చేయడానికి మిమ్మల్ని అనుమతిస్తుంది మరియు **రన్** వివిధ బ్యాకెండ్‌లలో వాటిని అమలు చేయడానికి మిమ్మల్ని అనుమతిస్తుంది. జాబ్‌లు అమలు చేయబడిన తర్వాత, కావలసిన అవుట్‌పుట్‌పై ఆధారపడి డేటా సేకరించబడుతుంది మరియు పోస్ట్‌ప్రాసెస్ చేయబడుతుంది.
tr_tr: Burada, Qiskit ile çalışmaya genel bir bakış sunuyoruz. Qiskit, kuantum bilgisayarları programlamak için gerekli temel yapı taşlarını sağlar. Qiskit'in temel birimi `quantum circuit <https://en.wikipedia.org/wiki/Quantum_circuit>`__'dir. Qiskit kullanan temel bir iş akışı iki aşamadan oluşur: **Oluştur** ve **Çalıştır**. **Yap**, çözdüğünüz sorunu temsil eden farklı kuantum devreleri oluşturmanıza ve bunları farklı arkayüzeylerde çalıştırmanıza olanak tanıyan **Çalıştır** yapmanıza olanak tanır. İşler çalıştırıldıktan sonra veriler toplanır ve istenen çıktıya bağlı olarak sonradan işlenir.
vi_vn: Tại đây, chúng tôi cung cấp thông tin tổng quát về cách làm việc với Qiskit. Qiskit cung cấp các khối xây dựng cơ bản và cần thiết để lập trình máy tính lượng tử. Đơn vị cơ bản của Qiskit là `mạch lượng tử <https://en.wikipedia.org/wiki/Quantum_circuit>`__. Quy trình làm việc cơ bản khi sử dụng Qiskit bao gồm hai giai đoạn: **Xây dựng** và **Chạy**. **Xây dựng** cho phép bạn tạo ra những mạch lượng tử khác nhau biểu diễn cho vấn đề bạn đang giải quyết, và **Chạy** cho phép bạn chạy những mạch lượng tử này trên những backends khác nhau. Sau khi các công việc đã được chạy, dữ liệu sẽ được thu thập và xử lý sau đó tùy thuộc vào kết quả đầu ra mong muốn của bạn.
zh_tw: 在這裡，我們提供使用 Qiskit 的概述。Qiskit 提供了程式量子計算機所需的基本構建塊。Qiskit 的基本單位是 `量子電路 <https://en.wikipedia.org/wiki/Quantum_circuit>`__。使用 Qiskit 的基本工作流程由兩個階段組成： **Build** 和 **Run**。**Build** 可讓您製作不同的量子電路，代表您正在解決的問題，**Run**可讓您在不同的後端執行它們。在執行工作之後，根據想要的輸出，您可以收集訊息並進行後續的處理。

source: Building the circuit
bn_bn: বর্তনী (সার্কিট) নির্মাণ
es_un: Construir el circuito
fr: Construction du circuit
ja: 回線の構築
ko: 회로 만들기
pt_un: Construindo o circuito
ta: சுற்றுப்பாதை கட்டிடம்
te: సర్క్యూట్ నిర్మించడం
tr_tr: Devrenin oluşturulması
vi_vn: Xây dựng mạch lượng tử
zh_tw: 建立電路

source: The basic element needed for your first program is the QuantumCircuit. We begin by creating a ``QuantumCircuit`` comprised of three qubits.
bn_bn: প্রথম প্রোগ্রামের জন্য প্রয়োজনীয় মৌলিক উপাদানটি হল QuantumCircuit। আমরা তিনটি কিউবিট সমন্বিত একটি ``QuantumCircuit`` তৈরির মাধ্যমে শুরু করব।
es_un: El elemento básico necesario para tu primer programa es el QuantumCircuit. Comenzamos creando un ``QuantumCircuit`` compuesto de tres qubits.
fr: L'élément de base dont vous aurez besoin pour un premier programme est le QuantumCircuit (circuit quantique). Nous commençons par créer un ``QuantumCircuit`` constitué de 3 qubits.
ja: 最初のプログラムに必要な基本要素は、QuantumCircuitです。まず、3つの量子ビットで構成される ``QuantumCircuit`` を作成します。
ko: 첫번째 프로그램을 위해 필요한 제일 기초적인 요소는 QuantumCircuit이다. 세 개의 큐비트으로 이루어진 ``QuantumCircuit`` 을 만드는 것으로 시작하자.
pt_un: O elemento básico necessário para seu primeiro programa é o QuantumCircuit. Começamos por criar um ``QuantumCircuit`` composto de três qubits.
ta: உங்கள் முதல் திட்டத்திற்கு தேவையான அடிப்படை உறுப்பு குவாண்டம் சிர்குட் ஆகும். மூன்று க்யூபிட்களைக் கொண்ட ``QuantumCircuit`` ஐ உருவாக்குவதன் மூலம் தொடங்குவோம்.
te: మీ మొదటి ప్రోగ్రామ్‌కు అవసరమైన ప్రాథమిక మూలకం QuantumCircuit. మేము మూడు క్విట్‌లతో కూడిన ``QuantumCircuit``ని సృష్టించడం ద్వారా ప్రారంభిస్తాము.
tr_tr: İlk programınız için gereken temel unsur QuantumCircuit'dir. Üç kübitten oluşan bir ``QuantumCircuit`` oluşturarak başlıyoruz.
vi_vn: Thành phần cơ bản cần thiết cho chương trình đầu tiên của bạn là QuantumCircuit. Chúng ta bắt đầu với việc tạo một ``QuantumCircuit`` bao gồm ba qubit.
zh_tw: 您的第一個程式所需的基本元素是 QuantumCircuit。首先，我們建立一個由三個位元組成的 ``QuantumCircuit``。

source: After you create the circuit with its registers, you can add gates (“operations”) to manipulate the registers. As you proceed through the tutorials you will find more gates and circuits; below is an example of a quantum circuit that makes a three-qubit GHZ state
bn_bn: সার্কিটটি রেজিস্টারগুলি দিয়ে তৈরি করার পরে, আপনি রেজিস্টার গুলি পরিচালনা করতে গেইট (“operations”) যুক্ত করতে পারেন। টিউটোরিয়ালগুলির মাধ্যমে আপনি আরও গেট এবং সার্কিট পাবেন। নিচে কোয়ান্টাম সার্কিটের একটি উদাহরণ দেওয়া হলো যা তিন কিউবিট GHZ মান তৈরি করে।
fr: Aprés avoir créé le circuit avec ses registres, vous pouvez ajouter les portes ("opérations") pour manipuler les registres. En parcourant les tutoriels vous trouverez davantage de portes et de circuits; ci-dessous un exemple de circuit quantique qui crée un état GHZ avec 3 qubits
ko: 레지스터를 가진 회로를 만들고 난 후, 레지스터를 조작하기 위해 게이트 ("연산") 를 추가할 수 있다. 튜토리얼을 계속 진행하며 더 많은 종류의 게이트들과 회로를 알아갈 수 있을 것이다. 아래는 3-큐비트 GHZ 상태를 만드는 양자 회로의 한 예시이다.
ta: நீங்கள் அதன் பதிவேடுகளுடன் சுற்று உருவாக்கிய பிறகு, பதிவேடுகளை கையாள கேட்களை (“செயல்பாடுகள்”) சேர்க்கலாம். நீங்கள் பயிற்சிகள் வழியாக செல்லும்போது அதிக கேட்கள் மற்றும் சுற்றுகள் இருப்பதைக் காண்பீர்கள்; மூன்று க்யூபிட் GHZ நிலையை உருவாக்கும் குவாண்டம் சுற்றுக்கு ஒரு எடுத்துக்காட்டு கீழே
tr_tr: Devreyi yazmaçları ile oluşturduktan sonra, kayıtları işlemek için kapılar (“operations”) ekleyebilirsiniz. Eğitici Belgelerde ilerledikçe daha fazla kapı ve devre bulacaksınız; aşağıda, üç kübitlik bir GHZ durumu oluşturan bir kuantum devresi örneği verilmiştir
vi_vn: Sau khi tạo mạch với các thanh ghi của nó, bạn có thể thêm các cổng ("thao tác") để tác động các thanh ghi. Khi bạn xem qua các hướng dẫn bạn sẽ tìm thấy nhiều cổng và mạch hơn nữa; dưới đây là một ví dụ của một mạch lượng tử tạo ra trạng thái GHZ của 3 qubit
zh_tw: 在建立具有暫存器的電路之後，您可以新增閘（“操作”）來操作暫存器。當您繼續進行教程時，您將學到更多的閘和電路；以下是構成一個三量子位元 GHZ 狀態的量子電路的範例。

source: |\psi\rangle = \left(|000\rangle+|111\rangle\right)/\sqrt{2}.
ta: |\psi\rகோணம் = (|000\rகோணம்+|111\rகோணம்)/\sqrt{2}.
zh_tw: |\psi\rangle = \left(|00\rangle+|11\rangle\right)/\sqrt{2}.

source: To create such a state, we start with a three-qubit quantum register. By default, each qubit in the register is initialized to :math:`|0\rangle`. To make the GHZ state, we apply the following gates: - A Hadamard gate :math:`H` on qubit 0, which puts it into the superposition state :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}`. - A Controlled-NOT operation (:math:`C_{X}`) between qubit 0 and qubit 1. - A Controlled-NOT operation between qubit 0 and qubit 2.
es_un: Para crear dicho estado, comenzamos con un registro cuántico de tres qubits. De forma predeterminada, cada qubit del registro se inicializa en :math:`|0\rangle`. Para hacer el estado GHZ, aplicamos las siguientes compuertas: - Una compuerta Hadamard :math:`H` en el qubit 0, que lo pone en el estado de superposición :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}`. - Una operación NOT controlada (:math:`C_{X}`) entre el qubit 0 y el qubit 1. - Una operación NOT controlada entre el qubit 0 y el qubit 2.
fr: Pour créer un tel état, nous démarrons avec un registre quantique de 3 qubits. Par défaut, chaque qubit du registre est initialisé à :math:`|0\rangle`. Pour créer l'état GHZ, on applique les portes suivantes: - Une porte Hadamard :math:`H` sur le qubit 0, qui le place dans un état de superposition :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}`. - Une opération "controlled-Not" (NON-contrôlé ou C-not) (:math:`C_{X}`) entre le qubit 0 et le qubit 1. - Une opération "controlled-Not" (C-not) entre le qubit 0 et le qubit 2.
ja: このような状態を作成するには、3量子ビットの量子レジスタから始めます。デフォルトでは、レジスタの各量子ビットは :math:`|0\rangle` に初期化されています。GHZ状態を作成するには、次のゲートを適用します: - 量子ビット0にアダマールゲート :math:`H` を適用して、重ね合わせ状態 :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}` にする。 - 0量子ビットと1量子ビットの間に、制御NOT演算子（ :math:`C_{X}` ）を適用する。 - 0量子ビットと2量子ビットの間に、制御NOT演算子を適用する。
ko: 이러한 상태를 만들기 위해서는 우선 세개의 큐비트로 양자 레지스터를 구성한다. 기본적으로 레지스터의 각 큐비트는 :math:`|0\rangle` 로 초기화된다. GHZ 상태를 만들기 위해 다음 게이트를 적용한다: - 중첩 상태 :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}` 로 만들어주는 Hadamard(하다마드) 게이트 :math:`H` 를 큐비트 0에 적용한다. - 큐비트 0과 큐비트 1에 Controlled-NOT 연산 (:math:`C_{X}`)을 적용한다. - 큐비트 0과 큐비트 2에 Controlled-NOT 연산을 적용한다.
pt_un: Para criar tal estado, começamos com um registrador quântico de três qubits. Por padrão, cada qubit no registrador é inicializado para :math:`|0\rangle`. Para fazer o estado GHZ, aplicamos as seguintes portas: - Uma porta Hadamard :math:`H` no qubit 0, que o coloca no estado de superposição :math:`\left(|0\rangle+|1\rangle\right )/\sqrt{2}`. - Uma operação Controlled-NOT (:math:`C_{X}`) entre o qubit 0 e o qubit 1. - Uma operação Controlled-NOT entre o qubit 0 e o qubit 2.
ta: அத்தகைய நிலையை உருவாக்க, நாம் மூன்று குவிட் குவாண்டம் பதிவேட்டில் தொடங்குகிறோம். இயல்பாக, பதிவேட்டில் உள்ள ஒவ்வொரு குவிட்டும் :math:`|0\rangle` க்கு துவக்கப்படும். GHZ நிலையை உருவாக்க, பின்வரும் வாயில்களைப் பயன்படுத்துகிறோம்: - Qubit 0 இல் ஒரு Hadamard கேட் :math:`H`, இது சூப்பர்போசிஷன் நிலைக்கு :math:`\left(|0\rangle+|1\rangle\right )/\sqrt{2}`. - Qubit 0 மற்றும் qubit 1 க்கு இடையில் ஒரு கட்டுப்படுத்தப்பட்ட-NOT செயல்பாடு (:math:`C_{X}`).
te: అటువంటి స్థితిని సృష్టించడానికి, మేము మూడు-qubit క్వాంటం రిజిస్టర్‌తో ప్రారంభిస్తాము. డిఫాల్ట్‌గా, రిజిస్టర్‌లోని ప్రతి క్విట్ :math:`|0\rangle`కి ప్రారంభించబడుతుంది. GHZ స్థితిని చేయడానికి, మేము ఈ క్రింది గేట్‌లను వర్తింపజేస్తాము: - qubit 0పై హడమార్డ్ గేట్ :math:`H`, ఇది దానిని సూపర్‌పొజిషన్ స్థితికి ఉంచుతుంది :math:`\left(|0\rangle+|1\rangle\right )/\sqrt{2}`. - qubit 0 మరియు qubit 1 మధ్య నియంత్రిత-నాట్ ఆపరేషన్ (:math:`C_{X}`). - qubit 0 మరియు qubit 2 మధ్య నియంత్రిత-నాట్ ఆపరేషన్.

source: On an ideal quantum computer, the state produced by running this circuit would be the GHZ state above.
bn_bn: একটি আদর্শ কোয়ান্টাম কম্পিউটারে, এই সার্কিটটি চালিয়ে প্রাপ্ত মান বা স্টেটটি উপরের GHZ মান বা অবস্থা হবে।
es_un: En una computadora cuántica ideal, el estado producido al ejecutar este circuito sería el estado GHZ anterior.
fr: Dans un calculateur quantique parfait, l'état produit en lançant ce circuit serait l'état GHZ ci-dessus.
ja: 理想的な量子コンピューターでは、この回路を実行することによって生成される状態は、上記のGHZ状態になります。
ko: 이상적인 양자 컴퓨터에서 이 회로를 실행한다면 위의 GHZ 상태가 만들어질 것이다.
pt_un: Em um computador quântico ideal, o estado produzido pela execução deste circuito seria o estado GHZ acima.
ta: ஒரு சாதாரண வானிலை கணினியில், இந்த சுற்றுப்பாதை இயங்கும் மாநிலம் மேலே GHZ மாநிலமாக இருப்பது.
te: ఆదర్శవంతమైన క్వాంటం కంప్యూటర్‌లో, ఈ సర్క్యూట్‌ని అమలు చేయడం ద్వారా ఉత్పత్తి చేయబడిన స్థితి పైన ఉన్న GHZ స్థితిగా ఉంటుంది.
tr_tr: İdeal bir kuantum bilgisayarda, bu devre çalıştırılarak üretilen durum, yukarıdaki GHZ durumu olacaktır.
vi_vn: Trên một máy tính lượng tử lý tưởng, trạng thái được tạo ra bằng cách chạy mạch này sẽ là trạng thái GHZ ở trên.
zh_tw: 在理想的量子計算機上，執行此電路所產生的會是上文提及的 GHZ 態。

source: In Qiskit, operations can be added to the circuit one by one, as shown below.
bn_bn: Qiskit এ ক্রিয়াকলাপগুলি সার্কিটের সাথে এক এক করে নিম্নলিখিতভাবে যুক্ত করা যেতে পারে।
es_un: En Qiskit, las operaciones se pueden agregar al circuito una por una, como se muestra a continuación.
fr: Dans Qiskit, les opérations peuvent être ajoutées au circuit une par une, comme montré ci-dessous.
ja: Qiskitでは、以下に示すように、回路に操作を1つずつ追加することができます。
ko: Qiskit에서는 아래와 같이 연산들을 회로에 하나씩 추가할 수 있다.
pt_un: No Qiskit, as operações podem ser adicionadas ao circuito uma a uma, como mostrado abaixo.
ta: Qiskit இல், செயல்பாடுகள் ஒன்றை ஒன்று, கீழே காட்டப்பட்ட ஒன்று சேகரிக்கு சேர்க்கலாம்.
te: Qiskitలో, క్రింద చూపిన విధంగా కార్యకలాపాలు ఒక్కొక్కటిగా సర్క్యూట్‌కు జోడించబడతాయి.
tr_tr: Qiskit'te işlemler aşağıda gösterildiği gibi tek tek devreye eklenebilir.
zh_tw: 在 Qiskit 中，多個操作可以被依次增加到電路中，如下所示。

source: Visualize Circuit
bn_bn: বর্তনী (সার্কিট) চিত্রায়ন করা
es_un: Visualizar el circuito
fr: Visualisation du circuit
ja: 回路の可視化
ko: 회로 시각화하기
pt_un: Visualizar Circuito
ta: சுற்றுப்பாதை காட்சிப்படுத்தவும்
te: సర్క్యూట్‌ను దృశ్యమానం చేయుట
tr_tr: Devreyi Görselleştirme
vi_vn: Hiển thị mạch lượng tử
zh_tw: 電路視覺化

source: You can visualize your circuit using Qiskit ``QuantumCircuit.draw()``, which plots the circuit in the form found in many textbooks.
bn_bn: আপনি Qiskit ``QuantumCircuit.draw()`` ব্যবহার করে সার্কিট চিত্রায়িত করতে পারেন যেরূপ বহুসংখ্যক পাঠ্যপুস্তকের মধ্যে সার্কিট থাকে।
es_un: Puedes visualizar tu circuito usando ``QuantumCircuit.draw()`` de Qiskit, que dibuja el circuito en la forma que se encuentra en muchos libros de texto.
fr: Vous pouvez visualiser le circuit en utilisant Qiskit ``QuantumCircuit.draw()``, qui dessinera le circuit de la façon dont on le voit dans de nombreux ouvrages.
ja: Qiskitの ``QuantumCircuit.draw()`` を使うことで、多くの教科書で見られるような形式に回路をプロットし、可視化することができます。
ko: Qiskit ``QuantumCircuit.draw()`` 는 회로를 많은 교재에 나오는 형식으로 그려주는데, 이를 이용해 회로를 시각화할 수 있다.
pt_un: Você pode visualizar seu circuito usando Qiskit ``QuantumCircuit.draw()``, que desenha o circuito na forma encontrada em muitos livros didáticos.
ta: Qiskit ``QuantumCircuit.draw ()``, பல உரைநூல்களில் காணப்பட்ட மாதிரிகளில் சுற்றுப்பயணத்தை வரையறுக்கிறது.
te: మీరు Qiskit ``QuantumCircuit.draw()``ని ఉపయోగించి మీ సర్క్యూట్‌ను విజువలైజ్ చేయవచ్చు, ఇది అనేక పాఠ్యపుస్తకాలలో కనిపించే రూపంలో సర్క్యూట్‌ను ప్లాట్ చేస్తుంది.
tr_tr: Devreyi birçok ders kitabında bulunan biçimde çizen Qiskit ``QuantumCircuit.draw()`` kullanarak devrenizi görselleştirebilirsiniz.
vi_vn: Bạn có thể xem mạch của mình bằng Qiskit ``QuantumCircuit.draw()``, vẽ sơ đồ mạch ở dạng có thể được tìm thấy trong nhiều sách tham khảo.
zh_tw: 您可以使用 Qiskit ``QuantumCircuit.draw()`` 視覺化您的電路，該方法會以許多教科書中的形式繪製電路。

source: In this circuit, the qubits are put in order, with qubit zero at the top and qubit two at the bottom. The circuit is read left to right (meaning that gates that are applied earlier in the circuit show up further to the left).
bn_bn: এই সার্কিটটিতে, কিউবিট-গুলি একটি ক্রমে রাখা হয়েছে যেখানে শূন্য কিউবিট একদম শীর্ষে এবং দ্বিতীয় কিউবিট একদম নিচে রয়েছে। সার্কিটটি বামদিক থেকে ডানদিকে পড়া হয় (যার অর্থ হল যেই গেটস গুলো সার্কিটে আগে প্রয়োগ করা হয়েছে সেই গুলো আরও বামদিকে প্রদর্শিত হবে)।
es_un: En este circuito, los qubits se ordenan, con el qubit cero en la parte superior y el qubit dos en la parte inferior. El circuito se lee de izquierda a derecha (lo que significa que las primeras compuertas que se aplican en el circuito se muestran más a la izquierda).
fr: Dans le circuit, les qubits sont mis dans un ordre où le qubit 0 sera en haut et le qubit 2 en bas. Le circuit est lu de gauche à droite (ce qui signifie que les portes appliquées en premiers sont celles de gauche et ainsi de suite).
ja: この回路では、量子ビットが順番に配置されており、一番上が量子ビット0、一番下が量子ビット2です。回路は左から右に読みます（つまり、回路の初めに適用されたゲートが左側に表示されます）。
ko: 이 회로에서는 큐비트들이 0 큐비트은 위쪽에 1 큐비트는 아래쪽에 놓이도록 순서가 정해져 있다. 회로는 왼쪽에서 오른쪽으로 읽혀지는데, 이것은 가장 왼쪽의 게이트들이 회로에서 먼저 적용된다는 것을 의미한다.
pt_un: Neste circuito, os qubits são colocados em ordem, com o qubit zero na parte superior e o qubit dois na parte inferior. O circuito é lido da esquerda para a direita (as portas aplicadas antes no circuito aparecem mais para a esquerda).
ta: இந்த சுற்றுப்பாதையில், க்யூபிட்கள் வரிசையில் வைக்கப்பட்டு, மேலே குறும்படத்துடன், கீழே இரண்டு மேல் விட்டு. சுற்றுச்சூழல் வலது இடமாக வாசிக்கப்பட்டுள்ளது (அதாவது முந்தைய சுற்றுப்பாதையில் பயன்படுத்தப்பட்டிருக்கும் கோடுகள் மேலும் இடது வரை காட்டுகின்றன).
te: ఈ సర్క్యూట్‌లో, క్విట్‌లు క్రమంలో ఉంచబడతాయి, పైభాగంలో క్విట్ సున్నా మరియు దిగువన క్విట్ రెండు ఉంటాయి. సర్క్యూట్ ఎడమ నుండి కుడికి చదవబడుతుంది (అంటే సర్క్యూట్‌లో ముందుగా వర్తింపజేసిన గేట్‌లు మరింత ఎడమ వైపుకు చూపబడతాయి).
tr_tr: Bu devrede, kübitler üstte kübit sıfır ve altta kübit iki olacak şekilde sıralanır. Devre soldan sağa okunur (yani devrede daha önce uygulanan kapılar daha solda görünür).
zh_tw: 在此電路中，量子位元是照順序排列的，qubit 0 在頂端，而 qubit 1在底端。電路是由左至右讀取（表示在電路中較早應用的門會顯示在左側）。
