Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/01_circuit_basics.po
Languages: bn_bn, es_un, fr, ja, ko, pt_un, ta, te, tr_tr, vi_vn, zh_tw

source: When representing the state of a multi-qubit system, the tensor order used in Qiskit is different than that used in most physics textbooks. Suppose there are :math:`n` qubits, and qubit :math:`j` is labeled as :math:`Q_{j}`. Qiskit uses an ordering in which the :math:`n^{\mathrm{th}}` qubit is on the left side of the tensor product, so that the basis vectors are labeled as :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0`.
bn_bn: মাল্টি-কিউবিট (বহু কিউবিট) গঠনতন্ত্রের স্থিতি উপস্থাপন করার সময়, টেনসর যেই ক্রমে Qiskit এ ব্যবহৃত হয় সেটা বেশিরভাগ পদার্থবিজ্ঞান পাঠ্যপুস্তকের থেকে ভিন্ন। ধরে নেয়া যাক এখানে :math:`n` qubits (কিউবিট) আছে এবং qubit (কিউবিট) :math:`j` কে :math:`Q_{j}` হিসাবে আখ্যায়িত আছে। Qiskit একটি ক্রম ব্যবহার করে যেটায় :math:`n^{\mathrm{th}}` qubit (কিউবিট) টেনসর গুণফলের বামদিকে অবস্থান করে, যাতে বেসিস ভেক্টর (ভিত্তি দিকরাশি) গুলি কে :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0` ভাবে আখ্যায়িত হয়।
es_un: Al representar el estado de un sistema de varios qubits, el orden de los tensores utilizado en Qiskit es diferente al utilizado en la mayoría de los libros de texto de física. Supongamos que hay :math:`n` qubits, y el qubit :math:`j` está etiquetado como :math:`Q_{j}`. Qiskit usa un orden en el que el qubit :math:`n^{\mathrm{th}}` está en el lado izquierdo del producto tensorial, de modo que los vectores base están etiquetados como :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0`.
fr: Lorsqu'on représente l'état d'un système à plusieurs qubits, l'ordre des produits tensoriels utilisé dans Qiskit est différent de celui de la plupart des manuels de physique. Supposons qu'il y a :math:`n` qubits, et que le qubit :math:`j` est étiqueté comme :math:`Q_{j}`. Qiskit utilise un ordre dans lequel le qubit :math:` n^{ \mathrm{th}} ` est sur le côté gauche du produit tensoriel, de sorte que les vecteurs de base sont marqués comme :math:` Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0 `.
ja: 複数の量子ビットのシステムの状態を表現する際にQiskitで使われるテンソル積の順番は、多くの物理の教科書で使われる順番と異なります。:math:`n` 個の量子ビットがあり、:math:`j` 番目の量子ビットは :math:`Q_{j}` とラベル付けされていると仮定します。Qiskitでは、 :math:`n^{\mathrm{th}}` 番目の量子ビットはテンソル積の左側にあるので、基底ベクトルは、:math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0` とラベル付けされます。
ko: 다중 큐비트 시스템의 상태를 나타낼 때, Qiskit은 대부분의 물리 교재에서 사용되는 텐서(tensor)의 순서와는 반대 되는 순서를 사용한다. :math:`n` 개의 큐비트가 있고, 큐비트 :math:`j` 는 :math:`Q_{j}` 로 표시된다고 가정하자. Qiskit에서는 (기저 벡터들을 :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0` 로 표현하기 위하여) :math:`n^{\mathrm{th}}` 큐비트를 텐서 곱의 가장 왼편에 위치하도록 만드는 순서체계(ordering)를 사용한다.
pt_un: Ao representar o estado de um sistema multi-qubit, a ordem tensorial utilizada no Qiskit é diferente daquela empregada na maioria dos livros de física. Suponha que existam :math:`n` qubits, e o qubit :math:`j` é rotulado como :math:`Q_{j}`. O Qiskit usa uma ordem na qual o qubit :math:`n^{\mathrm{th}}` está do lado esquerdo do produto tensorial, de forma que os vetores de base são rotulados como :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0`.
ta: பல-க்யூபிட் அமைப்பின் நிலையைக் குறிக்கும் போது, ​​Qiskit டில் பயன்படுத்தப்படும் டென்சர் வரிசை பெரும்பாலான இயற்பியல் பாடப்புத்தகங்களில் பயன்படுத்தப்படுவதை விட வித்தியாசமானது. :math:`n` க்யூபிட், மற்றும் க்யூபிட் :math:`j` என பெயரிடப்பட்டுள்ளது :math:`Q_{j}`. Qiskit ஒரு வரிசையைப் பயன்படுத்துகிறது: இதில் :math:`n^{\mathrm{th}}` க்யூபிட் டென்சர் தயாரிப்பின் இடது பக்கத்தில் உள்ளது, இதனால் அடிப்படை திசையன்கள் பின்வருமாறு பெயரிடப்பட்டுள்ளன :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0`.
te: బహుళ-క్కుబిట్ సిస్టమ్ యొక్క స్థితిని సూచించేటప్పుడు, Qiskitలో ఉపయోగించే టెన్సర్ క్రమం చాలా భౌతిక శాస్త్ర పాఠ్యపుస్తకాలలో ఉపయోగించిన దానికంటే భిన్నంగా ఉంటుంది. :math:`n` క్కుబిట్లు ఉన్నాయని అనుకుందాం మరియు qubit :math:`j`కి :math:`Q_{j}` అని లేబుల్ చేయబడింది. Qiskit ఉపయోగించే క్రమంలో, :math:`n^{\mathrm{th}}` క్కుబిట్ టెన్సర్ ఉత్పత్తికి ఎడమ వైపున ఉంటుంది, తద్వారా బేసిస్ వెక్టర్‌లు :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0`గా లేబుల్ చేయబడతాయి.
tr_tr: Çok kübitli bir sistemin durumunu temsil ederken, Qiskit'te kullanılan tensör sırası, çoğu fizik ders kitabında kullanılandan farklıdır. Diyelim ki :math:`n` kübitler var ve kübit :math:`j` :math:`Q_{j}` olarak etiketlendi. Qiskit, :math:`n^{\mathrm{th}}` kübitinin tensör ürününün sol tarafında olduğu bir sıralama kullanır, böylece temel vektörler :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0` olarak etiketlenir.
vi_vn: Khi biểu diễn trạng thái của một hệ nhiều qubit, thứ tự tensor được sử dụng trong Qiskit khác với thứ tự được sử dụng trong hầu hết các sách vật lý. Giả sử ta có :math:`n` qubit, và qubit :math:`j` được đánh dấu là :math:`Q_{j}`. Qiskit sử dụng thứ tự trong đó qubit :math:`n^{\mathrm{th}}` ở bên trái tích tensor, do đó những vector cơ sở được đánh dấu là :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0`.
zh_tw: 在表示多量子位系統的狀態時，Qiskit 中使用的張量順序與大多數物理教科書中所使用的不同。假設有 :math:`n` 個量子元位，其中第 :math:`j` 個被標記為 :math:`Q_{j}`。Qiskit 使用的順序是第 :math:`n` 個 qubit 放在張量積的最左邊，所以基底向量被標記為 :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0`。

source: For example, if qubit zero is in state 0, qubit 1 is in state 0, and qubit 2 is in state 1, Qiskit would represent this state as :math:`|100\rangle`, whereas many physics textbooks would represent it as :math:`|001\rangle`.
bn_bn: উদাহরণ স্বরূপ, যদি শূন্য কিউবিটটি 0 স্টেটে থাকে, প্রথম কিউবিটটি 0 স্টেটে থাকে, এবং দ্বিতীয় কিউবিটটি ১ স্টেটে থাকে, তাহলে Qiskit ওই স্টেটটাকে :math:`|100\rangle` ভাবে উপস্থাপন করবে, যদিও বেশিরভাগ পদার্থবিজ্ঞানের পাঠ্যপুস্তকে ওটাকে :math:`|001\rangle` ভাবে উপস্থাপন করা হয়।
es_un: Por ejemplo, si el qubit cero está en el estado 0, el qubit 1 está en el estado 0 y el qubit 2 está en el estado 1, Qiskit representaría este estado como :math:`|100\rangle`, mientras que muchos libros de texto de física lo representarían como :math:`|001\rangle`.
fr: Par exemple, si le qubit zéro est dans l'état 0, le qubit 1 est dans l'état 0, le qubit 2 dans l'état 1, Qiskit représentera cet état par :math:`|100\rangle`, tandis que de nombreux manuels de physiques l'auraient représenté par :math:`|001\rangle`.
ja: 例えば、量子ビットゼロが0、量子ビット1が0、量子ビット2が1のとき、Qiskitはこの状態を :math:`|100\rangle` と表現します。一方で、多くの物理の教科書はこの状態を :math:`|001\rangle` と表現します。
ko: 예를 들어, 큐비트 0이 0 상태에 있고, 큐비트 1이 0 상태, 큐비트 2가 1 상태에 있을 때, Qiskit은 이 상태를 :math:`|100\rangle` 로 표현하는데, 대부분의 물리 교과서에서는 :math:`|001\rangle` 로 표현한다.
pt_un: Por exemplo, se o qubit zero estiver no estado 0, o qubit 1 no estado 0 e o qubit 2 no estado 1, o Qiskit representaria este estado como :math:`|100\rangle`, enquanto que muitos livros sobre física o representariam como :math:`|001\rangle`.
ta: எடுத்துக்காட்டாக, க்யூபிட் பூஜ்ஜியம் 0 நிலையிலும், குவிட் 1 நிலை 0 ஆகவும், க்யூபிட் 2 நிலை 1 ஆகவும் இருந்தால், Qiskit இந்த நிலையை பின்வருமாறு குறிக்கும் :math:`|100\rangle`, அதே நேரத்தில் பல இயற்பியல் பாடப்புத்தகங்கள் இதைக் குறிக்கும் :math:`|001\rangle`.
te: ఉదాహరణకు, క్విట్ జీరో స్టేట్ 0లో ఉంటే, క్విట్ 1 స్టేట్ 0 లో ఉంటే, మరియు క్విట్ 2 స్టేట్ 1లో ఉంటే, క్విస్కిట్ ఈ స్థితిని :math:`|100\rangle`గా సూచిస్తుంది, అయితే చాలా ఫిజిక్స్ పాఠ్యపుస్తకాలు దీనిని సూచిస్తాయి. :math:`|001\rangle`.
tr_tr: Örneğin, 0.kübit, 0 durumundaysa, 1.kübit 0 durumundaysa ve 2.kübit 1 durumundaysa, Qiskit bu durumu :math:`|100\rangle' olarak gösterirken; birçok fizik ders kitabı bunu :math:`|001\rangle` şeklinde temsil eder.
vi_vn: Ví dụ, nếu qubit 0 ở trạng thái 0, qubit 1 ở trạng thái 0 và qubit 2 ở trạng thái 1, Qiskit sẽ biểu diễn trạng thái này dưới dạng :math:`|100\rangle`, trong khi nhiều sách tham khảo vật lý sẽ biểu diễn nó dưới dạng :math:`|001\rangle`.
zh_tw: 例如說，如果 qubit 0 處於狀態 0，qubit 1 處於狀態 0，而 qubit 2 在狀態 1 中，Qiskit 將表示此狀態為 :math:`|100\rangle`，而許多物理教科書將代表它為 :math:`|001\rangle`。

source: This difference in labeling affects the way multi-qubit operations are represented as matrices. For example, Qiskit represents a controlled-X (:math:`C_{X}`) operation with qubit 0 being the control and qubit 1 being the target as
bn_bn: আখ্যা দেত্তয়ার এই পার্থক্যটি প্রভাবিত করে যেভাবে মাল্টি-কিউবিট (বহু কিউবিট ) অপারেশনগুলি কে ম্যাট্রিক্স হিসাবে উপস্থাপন করে | উদাহরণস্বরূপ, Qiskit একটি কন্ট্রোল্ড-এক্স (:math:`C_{X}`) অপারেশনে, কিউবিট 0 টি কন্ট্রল এবং কিউবিট ১ টা টার্গেট হিসাবে উপস্থাপন করে
es_un: Esta diferencia en el etiquetado afecta la forma en que las operaciones de varios qubit se representan como matrices. Por ejemplo, Qiskit representa una operación X controlada (:math:`C_{X}`) con el qubit 0 siendo el control y el qubit 1 siendo el objetivo como
fr: Cette différence d'affichage affecte la façon dont les opérations multi-qubits sont représentées en tant que matrices. Par exemple, Qiskit représente une opération Control-X (:math:`C_{X}`) avec un qubit 0 étant le qubit de contrôle et un qubit 1 qui est la cible par
ja: このラベリングの違いは、複数量子ビットの演算子が行列として表現されるときの方法に影響します。例えば、Qiskitは制御X (:math:`C_{X}`) 演算子で量子ビット0を制御ビット、量子ビット1をターゲット・ビットとするとき、以下のように表現します。
ko: 이러한 표현의 차이는 다중 큐비트 연산이 행렬로 표현될 때 나타나게 된다. 예를 들어 큐비트 0이 제어 큐비트이고 큐비트 1이 목표 큐비트일 때, controlled-X (:math:`C_{X}`) 연산은 Qiskit에서 다음과 같이 표현된다.
pt_un: Essa diferença de rotulagem afeta a forma como as operações multi-qubit são representadas como matrizes. Por exemplo, o Qiskit representa uma operação X-controlada (:math:`C_{X}`) com o qubit 0 sendo o controle e o qubit 1 sendo o alvo como
ta: இந்த வேறுபாட்டில் வேறுபாடு பாதிக்கப்படாமல் பல விரிவான செயல்பாடுகள் மடங்குகளாக பிரதிபலிக்கும். எடுத்துக்காட்டாக, Qiskit ஒரு கட்டுப்பாட்டை-X (:math:`C_{X}`) செயல்பாடு 0 ஆக இருப்பது கட்டுப்பாட்டை மற்றும் க்யூபிட் 1 என்று இலக்கு என்று
te: లేబులింగ్‌లోని ఈ వ్యత్యాసం బహుళ-క్విట్ ఆపరేషన్‌లను మాత్రికల వలె సూచించే విధానాన్ని ప్రభావితం చేస్తుంది. ఉదాహరణకు, Qiskit నియంత్రిత-X (:math:`C_{X}`) ఆపరేషన్‌ని సూచిస్తుంది, qubit 0 నియంత్రణ మరియు qubit 1 లక్ష్యం
tr_tr: Etiketlemedeki bu fark, çoklu kübitli işlemlerin matrisler olarak temsil edilme şeklini etkiler. Örneğin, Qiskit bir kontrollü-X (:math:`C_{X}`) işlemini, kübit 0'ın kontrol olduğu ve kübit 1'in hedef olduğu işlem olarak temsil eder.
vi_vn: Sự khác biệt về cách đánh dấu này ảnh hưởng đến cách các phép toán đa qubit được biểu diễn dưới dạng ma trận. Ví dụ, Qiskit biểu diễn một cổng điều khiển-X (controlled-X)(:math:`C_{X}`) với qubit 0 để điều khiển và qubit 1 là mục tiêu như sau
zh_tw: 此標記差異會影響多量子位元操作的矩陣表示的。例如，Qiskit 代表 controlled-X（:math:`C_{X}`）操作中，qubit 0 是控制位元，qubit 1 是目標位元。

source: C_X = \begin{pmatrix} 1 & 0 & 0 & 0 \\ 0 & 0 & 0 & 1 \\ 0 & 0 & 1 & 0 \\ 0 & 1 & 0 & 0 \\\end{pmatrix}.
ta: C_X = \begin{pmatrix} 1 & 0 & 0 & 0 \\ 0 & 0 & 0 & 0 & 0 \\ 0 & 0 & 0 \\ 0 & 0 & 0 & 0 \\ \end{pmatrix}.

source: Simulating circuits
bn_bn: বর্তনীর (সার্কিট) মহড়া (সিমুলেশন) করা
es_un: Simular circuitos
fr: Simulation des circuits
ja: 回路のシミュレーション
ko: 회로 시뮬레이션하기
pt_un: Simulando circuitos
ta: சிம்லேட்டிங் குறும்படங்கள்
te: సిమ్యులేటింగ్ సర్క్యూట్లు
tr_tr: Devrelerin simülasyonu
vi_vn: Mô phỏng mạch lượng tử
zh_tw: 電路模擬

source: To simulate a circuit we use the quant_info module in Qiskit. This simulator returns the quantum state, which is a complex vector of dimensions :math:`2^n`, where :math:`n` is the number of qubits (so be careful using this as it will quickly get too large to run on your machine).
bn_bn: একটি সার্কিট অনুকরণ করার জন্য আমরা Qiskit এর quant_info মডিউল ব্যবহার করি। এই সিমুলেটরটি কোয়ান্টামের স্থিতি কে প্রত্যাবর্তন করে, যা :math:`2^n` মাত্রাসম্পন্ন একটি জটিল দিকরাশি, যেখানে :math:`n` হল কিউবিট-এর সংখ্যা (তাই এটি ব্যবহারের সময় সতর্কতা অবলম্বন করুন কারণ এটি আপনার মেশিনে চালানোর সময় দ্রুত খুব বড় হয়ে যাবে)।
es_un: Para simular un circuito usamos el módulo quant_info en Qiskit. Este simulador devuelve el estado cuántico, que es un vector complejo de dimensión :math:`2^n`, donde :math:`n` es el número de qubits (así que ten cuidado al usar esto, ya que rápidamente se volverá demasiado grande para ejecutar en tu máquina).
fr: Pour simuler un circuit, nous utilisons le module quant_info de Qiskit. Ce simulateur renvoie l'état quantique, qui est un vecteur complexe de dimension :math:`2^n`, où :math:`n` est le nombre de qubits (alors soyez prudent en utilisant ceci car il va rapidement devenir trop grand pour s'exécuter sur votre machine).
ja: 回路をシミュレートするには、Qiskitのquant_infoモジュールを使います。このシミュレーターは、 :math:`2^n` 次元の複素ベクトルである量子状態を返します。ここで :math:`n` は量子ビットの数です（ですので、ご自身のマシンで実行するには大きすぎる数にすぐ到達してしまうことに注意してください）。
ko: 회로를 시뮬레이션하고자 Qiskit 의 quant_info 모듈을 사용한다. 이 시뮬레이터는 :math:`2^n` 차원의의 복소 벡터인 양자 상태를 반환하는데, 여기서 :math:`n` 은 큐비트의 개수이다 (따라서 로컬 머신에서 돌릴 때 순식간에 너무 큰 용량을 차지하게 될 수 있어 주의해야 한다).
pt_un: Para simular um circuito, nós usamos o módulo Qiskit quant_info. Ese simulador retorna o estado quântico, que é um vetor complexo de dimensão :math:`2^n`, na qual :math:`n` é o número de qubits (então tenha cuidado ao usá-lo, já que ele rapidamente se tornará grande demais para a execução na sua máquina).
ta: ஒரு சர்க்யூட்டை உருவகப்படுத்த நாம் Qiskit இல் குவாண்ட்_இன்ஃபோ தொகுதியைப் பயன்படுத்துகிறோம். இந்த சிமுலேட்டர் குவாண்டம் நிலையை அளிக்கிறது, இது பரிமாணங்களின் சிக்கலான திசையன் :math:`2^n`, எங்கே :math:`n` என்பது க்யூபிட்களின் எண்ணிக்கை (எனவே இதைப் பயன்படுத்துவதில் கவனமாக இருங்கள், ஏனெனில் அது விரைவாக இயங்க பெரிதாகிவிடும் உங்கள் கணினியில்).
te: సర్క్యూట్‌ని అనుకరించడానికి మేము Qiskitలో quant_info మాడ్యూల్‌ని ఉపయోగిస్తాము. ఈ సిమ్యులేటర్ క్వాంటం స్థితిని అందిస్తుంది, ఇది పరిమాణాల సంక్లిష్ట వెక్టర్ :math:`2^n`, ఇక్కడ :math:`n` అనేది క్విట్‌ల సంఖ్య (కాబట్టి మీ మెషీన్‌లో అమలు చేయడానికి ఇది చాలా పెద్దదిగా ఉంటుంది కాబట్టి దీన్ని ఉపయోగించి జాగ్రత్తగా ఉండండి).
vi_vn: Để mô phỏng một mạch lượng tử, chúng ta sử dụng module quant-info trong Qiskit. Trình mô phỏng này trả về những trạng thái lượng tử, là những vector phức :math:`2^n` chiều, với :math:`n` là số qubit (vì vậy hãy cẩn thận khi sử dụng vì nó sẽ nhanh chóng trở nên quá lớn để chạy trên máy của bạn).
zh_tw: 若要模擬一個電路，我們需使用 Qiskit 中的 quant_info 模組。這個模擬器會傳回維度是 :math:`2^n` 的複數向量所描述的量子狀態，其中 :math:`n` 是量子位元的數目（由於計算量會隨之迅速增加，甚至無法在您的電腦上執行，所以請謹慎使用）。

source: There are two stages to the simulator. The first is to set the input state and the second to evolve the state by the quantum circuit.
bn_bn: মহড়াকারির (সিমুলেটর) দুটি পর্যায় আছে। প্রথমটি ইনপুট মান (স্টেট) সেট করা এবং দ্বিতীয়টি কোয়ান্টাম সার্কিটের মাধ্যমে স্টেট বিবর্তিত করা।
es_un: Hay dos etapas en el simulador. La primera es establecer el estado de entrada y la segunda es hacer evolucionar el estado mediante el circuito cuántico.
fr: Il y a deux étapes pour le simulateur. La premières consiste à définir l'état d'entrée et la seconde à faire évoluer cet état au travers du circuit quantique.
ja: シミュレーターには 2 つのステージがあります。 1つ目は、入力状態を設定し、2つ目は量子回路で状態を進化させます。
ko: 시뮬레이터에는 두 가지 단계가 있다. 첫 번째로는 입력 상태를 설정하는 것이고 두 번째는 양자 회로로 상태를 발전시키는 것이다.
pt_un: O simulador possui duas etapas, sendo a primeira definir o estado de entrada e a segunda evoluir esse estado com base no circuito quântico.
ta: சிமுலேட்டருக்கு இரண்டு நிலைகள் உள்ளன. முதலாவது உள்ளீட்டு நிலையை அமைப்பது மற்றும் இரண்டாவது குவாண்டம் சுற்று மூலம் நிலையை உருவாக்குவது.
te: సిమ్యులేటర్‌కు రెండు దశలు ఉన్నాయి. మొదటిది ఇన్‌పుట్ స్థితిని సెట్ చేయడం మరియు రెండవది క్వాంటం సర్క్యూట్ ద్వారా స్థితిని అభివృద్ధి చేయడం.
vi_vn: Có hai giai đoạn cho trình mô phỏng. Đầu tiên là thiết lập trạng thái đầu vào và sau đó phát triển trạng thái bằng mạch lượng tử.
zh_tw: 模擬器的工作有兩個階段。第一階段是設定輸入的狀態，而第二階段則是利用量子電路來演化該狀態。

source: Qiskit also provides a visualization toolbox to allow you to view the state.
bn_bn: Qiskit আপনাকে এই অবস্থা (স্টেট) পরিদর্শনের জন্য একটি দৃশ্যায়ন সরঞ্জাম-বক্স (visualization toolbox) ও সরবরাহ করে।
es_un: Qiskit también proporciona un conjunto de herramientas de visualización que te permiten ver el estado.
fr: Qiskit fournit aussi une boite à outil de visualisation qui permet d'afficher ces résultats.
ja: Qiskitには、この結果を見るための視覚化ツールボックスも用意されています。
ko: Qiskit은 이러한 결과들을 보여주는 시각화 도구상자를 제공한다.
pt_un: O Qiskit também fornece uma caixa de ferramentas de visualização a fim de permitir que você observe esses resultados.
ta: இந்த முடிவுகளைக் காண உங்களை அனுமதிக்க கிஸ்கிட் ஒரு காட்சிப்படுத்தல் கருவிப்பெட்டியையும் வழங்குகிறது.
te: Qiskit స్థితిన్ని వీక్షించడానికి మిమ్మల్ని అనుమతించడానికి విజువలైజేషన్ టూల్‌బాక్స్‌ను కూడా అందిస్తుంది.
tr_tr: Qiskit ayrıca bu sonuçları görüntülemenize izin veren bir görselleştirme araç kutusu da sağlar.
vi_vn: Qiskit cũng cung cấp một toolbox về trực quan hóa để cho phép bạn xem trạng thái.
zh_tw: Qiskit 還提供了視覺化工具盒，讓您檢視狀態。

source: Below, we use the visualization function to plot the qsphere and a hinton representing the real and imaginary components of the state density matrix :math:`\rho`.
bn_bn: নিচে, আমরা ভিজ্যুয়ালাইজেশন ফাংশনটি ব্যবহার করে qsphere এবং একটি হিন্টন প্লট করি, যা স্টেট ঘনত্ব ম্যাট্রিক্সের :math:`\rho` বাস্তব এবং কাল্পনিক উপাদানগুলির প্রতিনিধিত্ব করে।
es_un: A continuación, usamos la función de visualización para dibujar la qsphere y un diagrama de hinton que representa los componentes real e imaginario de la matriz de densidad de estado :math:`\rho`.
fr: Ci-dessous, nous utilisons la fonction de visualisation pour afficher les points correspondants aux composantes réelles et imaginaires de la matrice densité :math:`\rho`.
ja: 以下のように、qsphereのプロット、また状態の密度行列である :math:`\rho` の実数部と虚数部をhinton表示でプロットする機能が使えます。
ko: 아래에서는 시각화 함수를 이용해 qsphere와 상태 밀도 행렬 :math:`\rho` 의 실수와 허수 부분을 나타내는 힌턴 다이어그램을 그렸다.
pt_un: Abaixo, utilizaremos a função de visualização para desenhar os componentes reais e imaginários da matriz de densidade de estados :math:`\rho`.
ta: கீழே, நாம் விசைவு செயல்கூறு பயன்படுத்த qsphere மற்றும் ஒரு ஹிங்கன், மாநில அடர்த்தி மாட்ரிக்ஸ் :math:`\rho`.
te: దిగువన, మేము qsphereని ప్లాట్ చేయడానికి విజువలైజేషన్ ఫంక్షన్‌ని ఉపయోగిస్తాము మరియు స్టేట్ డెన్సిటీ మ్యాట్రిక్స్ :math:`\rho` యొక్క నిజమైన మరియు ఊహాత్మక భాగాలను సూచించే హింటన్‌ను ఉపయోగిస్తాము.
tr_tr: Aşağıda, durum yoğunluk matrisinin gerçek ve hayali bileşenlerini çizmek için görselleştirme işlevini kullanıyoruz :math:`\rho`.
vi_vn: Ở dưới, chúng tôi sử dụng hàm trực quan hóa để vẽ đồ thị qsphere và một hinton đại diện cho phần thực và ảo của một trạng thái, ma trận mật độ :math:`\rho`.
zh_tw: 下面，我們使用視覺化功能來繪製 Q-sphere 和 Hinton 圖，代表狀態密度矩陣 :math:`\rho` 的實部和虛部。

source: Unitary representation of a circuit
bn_bn: বর্তনী (সার্কিট)-র ঐকিক (ইউনিটারি) উপস্থাপনা
es_un: Representación unitaria de un circuito
fr: Représentation unitaire d'un circuit
ja: 回路のユニタリー表現
ko: 회로의 유니터리 표현
pt_un: Representação unitária de um circuito
ta: ஒரு சுற்றுச்சூழல் ஒழுங்குபடுத்தல்
te: సర్క్యూట్ యొక్క యూనిటరీ ప్రాతినిధ్యం
tr_tr: Bir devrenin üniter temsili
vi_vn: Biểu diễn dưới dạng đơn nhất (unitary) của một mạch lượng tử
zh_tw: 電路的么正表示

source: Qiskit’s quant_info module also has an operator method which can be used to make a unitary operator for the circuit. This calculates the :math:`2^n \times 2^n` matrix representing the quantum circuit.
bn_bn: Qiskit -এর quant_info মডিউলে একটি অপারেটর পদ্ধতি রয়েছে যা বর্তনীর (সার্কিট) জন্য একক অপারেটর তৈরি করতে ব্যবহার করা যেতে পারে। এটি কোয়ান্টাম সার্কিটের প্রতিনিধিত্বকারী :math:`2^n \times 2^n` ম্যাট্রিক্স গণনা করে করে।
fr: Le module quant_info de Qiskit dispose également d'une méthode `operator` qui peut être utilisée pour créer un opérateur unitaire pour le circuit. Ceci calcule la matrice :math:`2^n \times 2^n` qui représente le circuit quantique.
ko: 또한, Qiskit의 quant_info 모듈에는 회로를 위한 단일 연산자를 만들기 위해 사용될 수 있는 연산자 메서드가 있다. 이는 양자 회로를 나타내는 :math:`2^n \times 2^n` 행렬을 계산한다.
ta: கிஸ்கிட்டின் குவாண்ட்_இன்ஃபோ தொகுதிக்கு ஒரு ஆபரேட்டர் முறையும் உள்ளது, இது சுற்றுக்கு ஒரு ஒற்றை ஆபரேட்டரை உருவாக்க பயன்படுகிறது. இது கணக்கிடுகிறது :math:`2^n \முறை 2^n` அணி குவாண்டம் சுற்றுவட்டத்தைக் குறிக்கிறது.
tr_tr: Qiskit'in quant_info modülü ayrıca devreyi üniter bir operatör yapmak için kullanılabilecek bir operatör metoduna sahiptir. Bu, kuantum devresini temsil eden :math:`2^n \times 2^n` matrisini hesaplamaktadır.
vi_vn: Module quant_info của Qiskit cũng có một phương thức toán tử có thể được dùng để tạo một toán tử đơn nhất (unitary) cho mạch lượng tử. Nó tính toán ma trận :math:`2^n \times 2^n` biểu diễn mạch lượng tử.
zh_tw: Qiskit 的 quant_info 模組也有一個操作方法，可以用來對電路進行么正運算的操作。它可用於計算代表量子電路的 :math:`2^n \times 2^n` 矩陣。

source: OpenQASM backend
bn_bn: OpenQASM ব্যাকএন্ড
es_un: Backend OpenQASM
fr: Backend OpenQASM
ja: OpenQASM バックエンド
ko: OpenQASM 백엔드
pt_un: Backend OpenQASM
ta: OpenQASM பின்னணி
te: OpenQASM బ్యాకెండ్
tr_tr: OpenQASM arka ucu
vi_vn: Backend OpenQASM
zh_tw: OpenQASM 後端
