Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/1_getting_started_with_qiskit.po
Languages: bn_bn, es_un, fr, it_it, ja, ko_kr, pt_br, pt_un, ru_ru, ta_in, te, tr_tr, zh_tw

source: In this circuit, the qubits are put in order, with qubit zero at the top and qubit two at the bottom. The circuit is read left to right (meaning that gates that are applied earlier in the circuit show up further to the left).
bn_bn: এই সার্কিটটি (বর্তনীটি) তে, কিউবিট-গুলি একটি ক্রমে রাখা হয়েছে যেখানে শূন্য কিউবিট একদম শীর্ষে এবং দ্বিতীয় কিউবিট একদম নিচে রয়েছে। সার্কিটটি (বর্তনীটি) বামদিক থেকে ডানদিকে পড়া হয় (যার অর্থ হল যেই গেটস গুলো সার্কিটে (বর্তনীটে) আগে প্রয়োগ করা হয়েছে সেই গুলো আরও বামদিকে প্রদর্শিত হবে)।
it_it: In questo circuito, i qubit sono messi in ordine, con il qubit zero nella parte superiore e il qubit due in basso. Il circuito si legge da sinistra a destra (il che significa che i gate applicati per primi nel circuito appaiono più a sinistra).
ko_kr: 이 회로에 있는 큐비트들은 순서 대로 배치되며 큐비트 0은 위쪽에 큐비트 2는 아래쪽에 놓이게 된다. 회로는 왼쪽에서 부터 오른쪽으로 읽는다 (가장 왼쪽에 배치된 게이트들이 회로에서 먼저 적용된다는 것을 의미한다)
pt_br: Neste circuito, os qubits são ordenados com qubit zero na parte superior e qubit dois na parte inferior. O circuito é lido da esquerda para a direita (significando que portões que são aplicados no circuito mais cedo aparecem mais para a esquerda).
pt_un: Neste circuito, os qubits são colocados em ordem, com o qubit zero na parte superior e o qubit dois na parte inferior. O circuito é lido da esquerda para a direita (as portas aplicadas antes no circuito aparecem mais para a esquerda).
ru_ru: В данной схеме кубиты нумеруются сверху вниз, начиная с нулевого. Цепь читается слева направо, то есть гейты, которые применяются раньше других, расположены левее.
ta_in: இந்த சுற்றில், க்யூபிட்கள் ஒழுங்கமைவைக்கப்படுகின்றன, மேல் பகுதியில் க்யூபிட் பூஜ்ஜியம் மற்றும் கீழே இரண்டு க்யூபிட். சுற்று இடது வலது படிக்கப்படுகிறது (அதாவது சுற்றில் முன்பு பயன்படுத்தப்படும் கேட்ஸ் மேலும் இடது வரை காட்டுகின்றன).
tr_tr: Bu devrede, kübitler, kübit sıfır üstte ve kübit iki altta olacak şekilde sıraya konur. Devre soldan sağa okunur (yani devrede daha önce uygulanan kapılar daha solda görünür).
zh_tw: 在此電路中，量子位元是照順序排列的，qubit 0 在頂端，而 qubit 2在底端。電路是由左至右讀取（表示在電路中較早執行的閘會顯示在左側）。

source: When representing the state of a multi-qubit system, the tensor order used in Qiskit is different than that used in most physics textbooks. Suppose there are :math:`n` qubits, and qubit :math:`j` is labeled as :math:`Q_{j}`. Qiskit uses an ordering in which the :math:`n^{\mathrm{th}}` qubit is on the left side of the tensor product, so that the basis vectors are labeled as :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0`.
bn_bn: মাল্টি-কিউবিট (বহু কিউবিট) গঠনতন্ত্রের স্থিতি উপস্থাপন করার সময়, Qiskit এ ব্যবহৃত টেনসর ক্রম বেশিরভাগ পদার্থবিজ্ঞান পাঠ্যপুস্তকের থেকে ভিন্ন। ধরে নেয়া যাক এখানে :math:`n` কিউবিট আছে এবং কিউবিট :math:`j` কে :math:`Q_{j}` হিসাবে আখ্যা দেত্তয়া হয়েছে। Qiskit একটি ক্রম ব্যবহার করে যেটাতে :math:`n^{\mathrm{th}}` qubit (কিউবিট) টেনসর গুণফলের বামদিকে অবস্থান করে, যাতে বেসিস ভেক্টর (ভিত্তি দিকরাশি) গুলি কে :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0` ভাবে আখ্যা দেয়া হয়।
es_un: Al representar el estado de un sistema de varios qubits, el orden de los productos tensoriales utilizado en Qiskit es diferente al utilizado en la mayoría de los libros de texto de física. Supongamos que hay :math:`n` qubits, y el qubit :math:`j` está etiquetado como :math:`Q_{j}`. Qiskit usa un orden en el que el qubit :math:`n^{\mathrm{th}}` está en el lado izquierdo del producto tensorial, de modo que los vectores base están etiquetados como :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0`.
fr: Lorsque l'on représente l'état d'un système à plusieurs qubits, l'ordre des produits tensoriels utilisé dans Qiskit est différent de celui de la plupart des manuels de physique. Supposons qu'il y a :math:`n` qubits, et que le qubit de numéro :math:`j` soit dénoté par :math:`Q_{j}`. Qiskit utilise l'ordre dans lequel le qubit numéro :math:`n` est à gauche dans l'expression du produit tensoriel, de telle sorte à ce que les vecteurs de base soient dénotés par :math:` Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0`.
it_it: Quando si rappresenta lo stato di un sistema a più qubit, l'ordine dei tensori utilizzato in Qiskit è diverso da quello usato nella maggior parte dei libri di testo di fisica. Supponiamo di avere :math:`n` qubit, ed il qubit :math:`j` etichettato come :math:`Q_{j}`. Qiskit visualizza un ordinamento in cui il qubit :math:`n^{\mathrm{th}}` è sul lato sinistro del prodotto tensore, in modo che i vettori base siano indicati come :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0`.
ja: 複数の量子ビットのシステムの状態を表現する際に Qiskit で使われるテンソル積の順番は、多くの物理の教科書で使われる順番と異なります。:math:`n` 個の量子ビットがあり、:math:`j` 番目の量子ビットは :math:`Q_{j}` とラベル付けされていると仮定します。Qiskitでは、 :math:`n` 番目の量子ビットはテンソル積の左側にあるので、基底ベクトルは、:math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0` とラベル付けされます。
pt_br: Ao representar o estado de um sistema multi-qubit, a ordem de tensor utilizada no Qiskit é diferente daquela utilizada na maioria dos livros sobre física. Suponhamos que existam :math:`n` qubits, e o qubit :math:`j` é rotulado como :math:`Q_{j}`. O Qiskit usa uma ordenação na qual o :math:`n^{\mathrm{th}}` qubit está do lado esquerdo do produto tensorial, de modo que os vetores de base são rotulados como :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0`.
pt_un: Ao representar o estado de um sistema de múltiplos qubits, a ordem tensorial utilizada no Qiskit é diferente daquela empregada na maioria dos livros de física. Suponha que existam :math:`n` qubits, e o qubit :math:`j` é rotulado como :math:`Q_{j}`. O Qiskit usa uma ordem na qual o qubit :math:`n^{\mathrm{th}}` está do lado esquerdo do produto tensorial, de forma que os vetores de base são rotulados como :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0`.
ru_ru: При представлении состояния многокубитной системы, порядок, используемый в Qiskit, отличается от того, что используется в большинстве пособий по физике. Предположим, что имеется :math:`n` кубитов, и кубит :math:`j` отмечен как :math:`Q_{j}`. Qiskit использует порядок, в котором кубит :math:`n^{\mathrm{th}}` находится в левой части тензорного произведения так, что базисные векторы отмечены как :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0`.
ta_in: பல-க்யூபிட் அமைப்பின் நிலையைபிரதிநிதித்துவப்படுத்தும் போது, Qiskit-டில் பயன்படுத்தப்படும் டென்சர் ஆர்டர் பெரும்பாலான இயற்பியல் பாடப்புத்தகங்களில் பயன்படுத்தப்படுவதை விட வேறுபட்டது. :math:`n` க்யூபிட்கள், மற்றும் க்யூபிட் :math:`j` என பெயரிடப்பட்டுள்ளது :math:`Q_{j}`.Qiskit ஒரு வரிசைப்படுத்தலை பயன்படுத்துகிறது, அதில் :math:`n^{\mathrm{th}}` க்யூபிட் டென்சர் தயாரிப்பின் இடது பக்கத்தில் உள்ளது, இதனால் அடிப்படை வெக்டர்கள் :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0` என்று பெயரிடப்படுகின்றன.
te: బహుళ-క్విట్ సిస్టమ్ యొక్క స్థితిని సూచించేటప్పుడు, క్విస్కిట్‌లో ఉపయోగించే టెన్సర్ క్రమం చాలా ఫిజిక్స్ పాఠ్యపుస్తకాలలో ఉపయోగించిన దానికంటే భిన్నంగా ఉంటుంది. ఉన్నాయి అనుకుందాం :math:`n` క్విట్‌లు మరియు క్విట్ :math:`j` గా లేబుల్ చేయబడింది :math:`Q_{j}`. క్విస్కిట్ ఆర్డరింగ్‌ని ఉపయోగిస్తుంది :math:`n^{\mathrm{th}}` qubit టెన్సర్ ఉత్పత్తికి ఎడమ వైపున ఉంటుంది, తద్వారా ప్రాతిపదిక వెక్టర్‌లు ఇలా లేబుల్ చేయబడతాయి :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0`.
tr_tr: Qiskit'te kullanılan tensor sırası, çoklu kübit sisteminin durumunu temsil ederken çoğu fizik ders kitabında kullanılandan farklıdır. :math:`n` kübit olduğunu ve :math:`j` kübitinin :math:`Q_{j}` kübiti olarak etiketlendiğini varsayalım. Qiskit, :math:`n^{\mathrm{th}}` kübitinin tensör çarpımının solunda olduğu bir sıralama kullanır, böylece taban vektörleri :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0` olarak etiketlenir.
zh_tw: 在表示多量子位系統的狀態時，Qiskit 中使用的張量順序與大多數物理教科書中所使用的不同。假設有 :math:`n` 個量子元位，其中第 :math:`j` 個被標記為 :math:`Q_{j}`。Qiskit 使用的順序是第 :math:`n^{\mathrm{th}} 個 qubit 放在張量積的最左邊，所以基底向量被標記為 :math:`Q_{n-1}\otimes \cdots \otimes Q_1\otimes Q_0`。

source: For example, if qubit zero is in state 0, qubit 1 is in state 0, and qubit 2 is in state 1, Qiskit would represent this state as :math:`|100\rangle`, whereas many physics textbooks would represent it as :math:`|001\rangle`.
bn_bn: উদাহরণ স্বরূপ, যদি শূন্য কিউবিটটি 0 স্থিতি তে থাকে, প্রথম কিউবিটটি 0 স্থিতি তে থাকে, এবং দ্বিতীয় কিউবিটটি ১ স্থিতি তে থাকে, তাহলে Qiskit ওই স্থিতি টা কে :math:`|100\rangle` ভাবে উপস্থাপন করবে, যদিও বেশিরভাগ পদার্থবিজ্ঞান পাঠ্যপুস্তকে ওটাকে :math:`|001\rangle` ভাবে উপস্থাপন করে।
it_it: Ad esempio, se il qubit zero è nello stato 0, il qubit 1 è nello stato 0, e il qubit 2 è nello stato 1, Qiskit rappresenterà questo stato come :math:`|100\rangle`, mentre molti libri di testo di fisica lo rappresenterebbero come :math:`|001\rangle`.
ko_kr: 예를 들어, 큐빗 0이 0 상태에 있고, 큐비트 1이 0 상태, 큐비트 2가 1 상태에 있을 때, 키스킷은 이 상태를 :math:`|100\rangle로 표현하는데, 대부분의 물리 교재들을 :math:`|001\rangle`로 표현한다.
pt_br: Por exemplo, se o qubit zero estiver no estado 0, o qubit 1 no estado 0 e o qubit 2 no estado 1, o Qiskit representaria este estado como :math:`|100\rangle`, enquanto que muitos livros sobre física o representariam como :math:`|001\rangle`.
pt_un: Por exemplo, se o qubit zero estiver no estado 0, o qubit 1 no estado 0 e o qubit 2 no estado 1, o Qiskit representaria este estado como :math:`|100\rangle`, enquanto que muitos livros sobre física o representariam como :math:`|001\rangle`.
ru_ru: Например, если нулевой кубит находится в состоянии 0, 1-й кубит также находится в состоянии 0, а кубит 2 находится в состоянии 1, Qiskit представит это состояние как :math:`|100\rangle`, в то время как многие книги по физике будут представлять его как :math:`|001\rangle`.
ta_in: உதாரணமாக, க்யூபிட் பூஜ்ஜியம் நிலையில் 0, மற்றும் க்யூபிட் 1 நிலையில் 0, மற்றும் க்யூபிட் 2 நிலையில் உள்ளது 1, Qiskit இந்த நிலையில் :math:`|100\rangle` என பிரதிநிதித்துவப்படுத்துவார், அதே நேரத்தில் பல இயற்பியல் பாடப்புத்தகங்கள் அதை :math:`|001\rangle` என பிரதிநிதித்துவப்படுத்தும்.
tr_tr: Örneğin, kübit sıfır 0 durumunda, kübit 1 0 durumunda ve kübit 2 1 durumunda ise, Qiskit bu durumu şu şekilde temsil eder :math:`|100\rangle`, oysa birçok fizik ders kitabı bunu :math:`|001\rangle` şeklinde temsil eder .
zh_tw: 例如說，如果 qubit 0 處於狀態 0，qubit 1 處於狀態 0，而 qubit 2 在狀態 1 ，Qiskit 將此狀態表示為 :math:`|100\rangle`，而許多物理教科書會表示為 :math:`|001\rangle`。

source: This difference in labeling affects the way multi-qubit operations are represented as matrices. For example, Qiskit represents a controlled-X (:math:`C_{X}`) operation with qubit 0 being the control and qubit 1 being the target as
bn_bn: নামাঙ্কনের পার্থক্যটি মাল্টি-কিউবিট (বহু কিউবিট) অপারেশনগুলির ম্যাট্রিক্স হিসাবে উপস্থাপনকে প্রভাবিত করে| উদাহরণস্বরূপ, Qiskit একটি কন্ট্রোল্ড-এক্স (:math:`C_{X}`) অপারেশনে যেখানে কিউবিট 0 টি কন্ট্রল এবং কিউবিট ১ টা টার্গেট নিম্নভাবে উপস্থাপন করে
it_it: Questa differenza nel formalismo influenza il modo in cui le operazioni a più qubit sono rappresentate come matrici. Ad esempio, Qiskit rappresenta un'operazione controlled-X (:math:`C_{X}`) con il qubit 0 che funge da controllo e il qubit 1 che rappresenta il target come
ko_kr: 이러한 표현의 차이는 다중 큐비트 연산이 매트릭스로 표현될 때 나타나게 된다. 예를 들어 큐비트 0이 제어 큐비트이고, 큐비트 1이 목표 큐비트일 때, 조절된 X (:math:`C_{X}`) 연산은 키스킷에서 다음과 같이 표현된다.
pt_br: Essa diferença de rotulagem afeta a forma como as operações multi-qubit são representadas como matrizes. Por exemplo, o Qiskit representa uma operação X-controlada (:math:`C_{X}`) com o qubit 0 sendo o controle e o qubit 1 sendo o alvo como
pt_un: Essa diferença na rotulação afeta a forma como as operações multi-qubit são representadas como matrizes. Por exemplo, o Qiskit representa uma operação X-controlada (:math:`C_{X}`) com o qubit 0 sendo o controle e o qubit 1 sendo o alvo como
ru_ru: Это различие в обозначении влияет на то, как многокубитные операции представляются с помощью матриц. Например, Qiskit представляет управляемую операцию X (:math:`C_{X}`) с нулевым контролирующим кубитом и 1-м целевым как
ta_in: லேபிளிங்கில் உள்ள இந்த வேறுபாடு பல-க்யூபிட் செயல்பாடுகளை அணிகளுக்காகக் குறிக்கும் முறையை பாதிக்கிறது. எடுத்துக்காட்டாக, Qiskit என்பது ஒரு கட்டுப்படுத்தப்பட்ட- X (:math:`C_{X}`) செயல்பாட்டைக் குறிக்கிறது, க்யூபிட் 0 கட்டுப்பாடு மற்றும் க்யூபிட் 1 இலக்கு
tr_tr: Etiketlemedeki bu fark, çoklu-kübit işlemlerinin matris olarak temsil edilme şeklini etkiler. Örneğin, Qiskit kontrollü-X işlemini (:math:`C_ {X}`) kübit 0'ın kontrol ve kübit 1'in hedef olduğu bir şekilde temsil eder
zh_tw: 此表示方式的差異會影響多量子位元操作的矩陣表示。例如，Qiskit 代表 controlled-X(:math:`C_{X}`)操作中，qubit 0 是控制位元，qubit 1 是目標位元。

source: Simulating circuits using Qiskit Aer
bn_bn: Qiskit এয়ার দিয়ে সার্কিট-গুলি (বর্তনীগুলি) সিমুলেট করা
es_un: Simulación de circuitos usando Qiskit Aer
fr: Simuler des circuits en utilisant Qiskit Aer
it_it: Simulare i circuiti utilizzando Qiskit Aer
ja: Qiskit Aer を使った回路のシミュレーション
ko_kr: 키스킷 아르 (Aer) 를 사용하여 회로 시뮬레이션 하기
pt_br: Simulando circuitos usando Qiskit Aer
pt_un: Simulando circuitos usando Qiskit Aer
ru_ru: Симуляция цепей с использованием Qiskit Aer
ta_in: Qiskit Aer பயன்படுத்தி சுற்றுகளை உருவகப்படுத்துதல்
te: Qiskit Aer ఉపయోగించి సర్క్యూట్‌లను అనుకరించడం
tr_tr: Qiskit Aer kullanarak devreleri simüle etme
zh_tw: 用 Qiskit Aer 模擬電路

source: Qiskit Aer is our package for simulating quantum circuits. It provides many different backends for doing a simulation. There is also a basic, Python only, implementation called ``BasicAer`` in Terra that can be used as a drop-in replacement for ``Aer`` in the examples below.
bn_bn: Qiskit এয়ার আমাদের প্যাকেজ যা দিয়ে কোয়ান্টাম সার্কিট-গুলি (বর্তনীগুলি) সিমুলেট করা হয়। এটা সিমুলেশন করার জন্য অনেক ব্যাকএন্ড সরবরাহ করে। এখানে আরো একটি Python দিয়ে করা একটা রূপায়ণ (ইমপ্লিমেন্টেশন) আছে, ``BasicAer`` বলে, যেটা যে কোনো সময়ে ``Aer`` এর বদলে ব্যবহার করা যেতে পারে। নিচের উদাহরণগুলো লক্ষ্য কর।
es_un: Qiskit Aer es nuestro paquete para simular circuitos cuánticos. Proporciona muchos backends diferentes para realizar una simulación. También hay una implementación básica, solo en Python, llamada ``BasicAer`` en Terra que se puede usar como reemplazo directo de ``Aer`` en los ejemplos a continuación.
fr: Qiskit Aer est le module qui nous permet de simuler des circuits quantiques. Il fournit plusieurs plateformes différentes pour effectuer une telle simulation. Il existe également dans Terra une implémentation simple utilisant exclusivement Python appelée ``BasicAer`` qui peut être utilisée comme une alternative à ``Aer`` dans les exemples suivants.
it_it: Qiskit Aer il il pacchetto per simulare i circuiti quantistici. Fornisce molti backend differenti per realizzare una simulazione. Nel pacchetto Terra c'è anche una implementazione base, solo Python, chiamata ``BasicAer`` che può essere usata come sostituto di `Aer`` negli esempi di seguito.
ja: Qiskit Aer は、量子回路をシミュレーションするパッケージです。シミュレーションするためのバックエンドは複数あります。以下の例にあるように ``Aer`` の完全互換性部品として使うことのできるTerraの ``BasicAer`` と呼ばれるベーシックな Python のみの実装もあります。
ko_kr: 키스킷 아르는 양자 회로를 시뮬레이션 하기 위한 패키지이다. 이것은 시뮬레이션을 실행하기 위한 많은 다양한 후위 처리 장치를 제공한다. 아래에 나타난 예와 같이 테라에서는 ``Aer``를 대체하기 위해 사용될 수 있는 ``BasicAer``라 불리는 파이썬 버전의 구현도 있다.
pt_br: O Qiskit Aer é o nosso pacote para simular circuitos quânticos. Ele fornece muitos backends diferentes para fazer uma simulação. Há também uma implementação básica, em Python, chamada ``BasicAer`` no Qiskit Terra que pode ser usado como um substituto drop-in para o ``Aer`` nos exemplos abaixo.
pt_un: Qiskit Aer é o nosso pacote para a simulação de circuitos quânticos. Ele provê diferentes backends para a realização de simulações. Há também uma implementação básica, apenas para Python, chamada ``BasicAer`` no Terra que pode ser usada como um substituto direto para o ``Aer``, como nos exemplos abaixo.
ru_ru: Qiskit Aer - наш пакет для симуляции квантовых цепей. Он предоставляет несколько различных окружений для выполнения симуляций. Существует также базовый пакет, написанный полностью на Python, пакет ``BasicAer`` в пакете Terra, который может быть использован в качестве замены пакета ``Aer`` в примерах ниже.
ta_in: Qiskit Aer என்பது குவாண்டம் சுற்றுகளை உருவகப்படுத்துவதற்கான எங்கள் தொகுப்பாகும். இது ஒரு உருவகப்படுத்துதலுக்கு பல்வேறு பின்தளங்களை வழங்குகிறது. கீழே உள்ள எடுத்துக்காட்டுகளில் ``Aer`` க்கு மாற்றாகப் பயன்படுத்தக்கூடிய டெர்ராவில் ``BasicAer`` என்று அழைக்கப்படும் அடிப்படை, பைதான் மட்டும் செயல்படுத்தப்படுகிறது.
te: Qiskit Aer అనేది క్వాంటం సర్క్యూట్‌లను అనుకరించే మా ప్యాకేజీ. ఇది అనుకరణ చేయడానికి అనేక విభిన్న బ్యాకెండ్‌లను అందిస్తుంది. దిగువ ఉదాహరణల్లో ``Aer``కి డ్రాప్-ఇన్ రీప్లేస్‌మెంట్‌గా ఉపయోగించబడుతుంది, టెర్రాలో ``BasicAer`` అనే ప్రాథమిక, పైథాన్ మాత్రమే అమలు చేయబడింది.
tr_tr: Qiskit Aer, kuantum devreleri simüle etmek için kullandığımız paketimizdir. Bir simülasyon yapmak için birçok farklı arka uç sağlar. Terra'da ``BasicAer`` adı verilen ve aşağıdaki örneklerde ``Aer`` için bir yedek olarak kullanılabilecek basit bir Python uygulaması da vardır.
zh_tw: Qiskit Aer 是我們用於模擬量子電路的套件，它提供不同的後臺進行模擬，Terra 中也有一個基本但僅限用 Python 實現的套件，稱作 "BasicAer"，可以用於當作 "Aer" 的替代，我們將在下方做範例。

source: Statevector backend
bn_bn: স্টেটভেক্টর (অবস্থা দিকরাশি) ব্যাকএন্ড
es_un: Backend para vector de estado
fr: Backend dédié aux vecteurs d'état
it_it: Backend Statevector
ja: 状態ベクトル・バックエンド
ko_kr: 상태벡터 후위 처리 장치
pt_br: Backend de statevector
pt_un: Backend de Vetor de Estados
ru_ru: Окружение векторного состояния
ta_in: ஸ்டேட்வெக்டர் பின்தளத்தில்
te: స్టేట్‌వెక్టర్ బ్యాకెండ్
tr_tr: Hal vektörü (statevector) arka ucu
zh_tw: 狀態向量後臺

source: The most common backend in Qiskit Aer is the ``statevector_simulator``. This simulator returns the quantum state, which is a complex vector of dimensions :math:`2^n`, where :math:`n` is the number of qubits (so be careful using this as it will quickly get too large to run on your machine).
bn_bn: Qiskit এয়ার-এ সবচেয়ে প্রচলিত ব্যাকএন্ড হল ``statevector_simulator``। এই সিমুলেটরটি কোয়ান্টামের স্থিতি কে প্রত্যাবর্তন করে, যা :math:`2^n` মাত্রার একটি জটিল দিকরাশি, যেখানে :math:`n` হল কিউবিট-এর সংখ্যা (তাই এটি ব্যবহারের সময় সতর্কতা অবলম্বন করুন কারণ এটি আপনার মেশিনে চালানোর সময় দ্রুত খুব বড় হয়ে যাবে)।
es_un: El backend más común en Qiskit Aer es el ``statevector_simulator``. Este simulador devuelve el estado cuántico, que es un vector complejo de dimensiones :math:`2^n`, donde :math:`n` es el número de qubits (así que ten cuidado al usar esto, ya que rápidamente se volverá demasiado grande para ejecutar en tu máquina).
fr: Le backend le plus commun de Qiskit Aer est le ``statevector_simulator``. Ce simulateur renvoie l'état quantique, qui est un vecteur complexe de dimension :math:`2^n`, où :math:`n` est le nombre de qubits (faites donc attention en utilisant ce backend, comme la taille du vecteur en question peut rapidement devenir trop grande pour votre machine).
it_it: Il backend più comune in Qiskit Aer è lo ``statevector_simulator``. Questo simulatore restituisce lo stato quantistico, che è un vettore complesso di dimensioni :math:`2^n`, dove :math:`n` è il numero di qubit (pertanto va utilizzato con attenzione poiché diventerà rapidamente troppo grande per essere eseguito sulla vostra macchina).
ja: Qiskit Aer における最も一般的なバックエンドは、``statevector_simulator`` です。このシミュレーターは、 :math:`2^n` 次元の複素ベクトルである量子状態を返します。ここで :math:`n` は量子ビットの数です(ですので、ご自身のマシンで実行するには大きすぎる数にすぐ到達してしまうことに注意してください)。
ko_kr: 키스킷 아르에 사용되는 가장 일반적인 후위 처리 장치는 ``statevector_simulator``이다. 이 시뮬레이터는 양자 상태를 돌려주는데, 이는 큐비트의 갯수가 :math:`n`일 때, :math:`2^n`의 차원을 가지는 복소수 벡터이다. (따라서 실행시 빠르게 그 크기가 늘어나기 때문에 주의해야 한다.)
pt_br: O backend mais comum no Qiskit Aer é o ``statevector_simulator``. Este simulador retorna o estado quântico, o qual é um vetor complexo de dimensões :math:`2^n`, onde :math:`n` é o número de qubits (portanto, tenha cuidado ao usá-lo já que ele ficará rapidamente muito grande para rodar em sua máquina).
pt_un: O backend mais comum do Qiskit Aer é o ``statevector_simulator``. Ele retorna o estado quântico, que é um vetor complexo de dimensão :math:`2^n`, na qual :math:`n` é o número de qubits (então tenha cuidado ao usá-lo, já que ele rapidamente se tornará grande demais para a execução na sua máquina).
ru_ru: ``Симулятор векторного состояния (statevector_simulator)`` - самый распространенный тип окружения в Qiskit Aer. Данный симулятор возвращает квантовое состояние, являющееся комплексным вектором с количеством измерений :math:`2^n`, где :math:`n` — это количество кубитов (будьте осторожны, так как схема может легко стать слишком сложной для запуска на Вашем компьютере).
ta_in: Qiskit Aer இல் மிகவும் பொதுவான பின்தளமானது ``statevector_simulator`` ஆகும். இந்த சிமுலேட்டர் குவாண்டம் நிலையை அளிக்கிறது, இது பரிமாணங்களின் சிக்கலான திசையன் :math:`2^n`, எங்கே :math:`n` என்பது க்யூபிட்களின் எண்ணிக்கை (எனவே இதைப் பயன்படுத்துவதில் கவனமாக இருங்கள், ஏனெனில் அது விரைவாக இயங்க பெரிதாகிவிடும் உங்கள் கணினியில்).
te: Qiskit Aerలో అత్యంత సాధారణ బ్యాకెండ్ ది statevector_simulator. ఈ సిమ్యులేటర్ క్వాంటం స్థితిని అందిస్తుంది, ఇది పరిమాణాల సంక్లిష్ట వెక్టర్ :math:`2^n`, ఎక్కడ :math:`n` అనేది క్విట్‌ల సంఖ్య (కాబట్టి దీన్ని ఉపయోగించి జాగ్రత్తగా ఉండండి, ఎందుకంటే ఇది మీ మెషీన్‌లో రన్ చేయడానికి చాలా పెద్దదిగా మారుతుంది).
tr_tr: Qiskit Aer'deki en yaygın arka uç ``statevector_simulator`` dür. Bu simülatör, karmaşık bir vektörü olan kuantum durumunu döndürür boyutunu :math:`2^n` olan, burada :math:`n`, kübit sayısıdır (bu yüzden bunu kullanırken dikkat edin çünkü bu makinenizde çalışabilmesi için hızlıca fazla büyük hale gelecektir).
zh_tw: Qiskit Aer 最常見的後臺是 ``statevector_simulator``。這個模擬器會傳回維度是 :math:`2^n` 的複數向量所描述的量子狀態，其中 :math:`n` 是量子位元的數目（由於計算量會隨之迅速增加，甚至無法在您的電腦上執行，所以請謹慎使用）。

source: To run the above circuit using the statevector simulator, first you need to import Aer and then set the backend to ``statevector_simulator``.
bn_bn: উপরের সার্কিটটি (বর্তনীটি) স্টেটভেক্টর সিমুলেটর দিয়ে চালানোর জন্য, আপনাকে প্রথমে এয়ার ইম্পোর্ট (আমদানি) করতে হবে এবং তারপরে ব্যাকএন্ডটি ``statevector_simulator`` এ স্থির করতে হবে।
es_un: Para ejecutar el circuito anterior usando el simulador de statevector, primero debes importar Aer y luego configurar el backend con ``statevector_simulator``.
fr: Pour exécuter le circuit ci-dessus en utilisant le simulateur de vecteur d'état, vous devez d'abord importer Aer et ensuite paramétrer l'environnement d'exécution, ou backend en anglais, sur ``statevector_simulator``.
it_it: Per eseguire il circuito di sopra usando il simulatore statevector, è necessario innanzitutto importare Aer e quindi impostare il backend a ``statevector_simulator``.
ja: 状態ベクトル・シミュレーターを使って、上記の回路を実行するためには、最初に Aer をインポートしてから、バックエンドを ``statevector_simulator`` に設定する必要があります。
ko_kr: 위의 회로를 상태벡터 시뮬레이터를 이용하여 실행할 때, 우선 아르를 임포트하고 후위 처리 장치를 ``statevector_simulator``로 설정해야 한다.
pt_br: Para executar o circuito acima usando o simulador statevector, primeiro você precisa importar o Aer e, em seguida, configurar o backend para ``statevector_simulator``.
pt_un: Para executar o circuito acima usando o backend de vetor de estados, primeiro é necessário importar o Aer e então definir o backend como ``statevector_simulator``.
ru_ru: Чтобы запустить вышеописанную схему с помощью симулятора векторного состояния, сначала необходимо импортировать пакет Aer, а затем установить ``statevector_simulator`` в качестве используемого окружения.
ta_in: ஸ்டேட்வெக்டர் சிமுலேட்டரைப் பயன்படுத்தி மேலே உள்ள சர்க்யூட்டை இயக்க, முதலில் நீங்கள் ஏரை இறக்குமதி செய்து பின்னாடி ``statevector_simulator`` என அமைக்க வேண்டும்.
te: స్టేట్‌వెక్టర్ సిమ్యులేటర్‌ని ఉపయోగించి పై సర్క్యూట్‌ను అమలు చేయడానికి, ముందుగా మీరు Aerని దిగుమతి చేసి, ఆపై బ్యాకెండ్‌ను ``statevector_simulator``కి సెట్ చేయాలి.
tr_tr: Durum vektörü simülatörünü kullanarak yukarıdaki devreyi çalıştırmak için, önce Aer'i içe aktarmanız ve ardından arka ucu ``statevector_simulator`` olarak ayarlamanız gerekir.
zh_tw: 為了用 statevector simulator 執行上述電路，首先我們要引入 Aer，接著將 backend 設定為 ``statevector_simulator``。
