Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/1_getting_started_with_qiskit.po
Languages: bn_bn, es_un, fr, it_it, ja, ko_kr, pt_br, pt_un, ru_ru, ta_in, te, tr_tr, zh_tw

source: This page was generated from `tutorials/circuits/1_getting_started_with_qiskit.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/circuits/1_getting_started_with_qiskit.ipynb`__ থেকে উৎপন্ন হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/circuits/1_getting_started_with_qiskit.ipynb`__.
fr: Cette page a été générée puis traduite à partir de `tutorials/circuits/1_getting_started_with_qiskit.ipynb`__.
it_it: Questa pagina è stata generata a partire da `tutorials/circuits/1_getting_started_with_qiskit.ipynb`__.
ja: このページは `tutorials/circuits/1_getting_started_with_qiskit.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/회로 /1_getting_started_qiskit.ipynb` __ 에서 생성되었다.
pt_br: Esta página foi gerada a partir do `tutorials/circuits/1_getting_started_with_qiskit.ipynb`__.
pt_un: Esta página foi originada de `tutorials/circuits/1_getting_started_with_qiskit.ipynb`__.
ru_ru: Страница создана на основе `tutorials/circuits/1_getting_started_with_qiskit.ipynb`__.
ta_in: இந்தப் பக்கம் `tutorials/circuits/1_getting_started_with_qiskit.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
te: ఈ పేజీ `tutorials/circuits/1_getting_started_with_qiskit.ipynb`__ నుండి రూపొందించబడింది.
tr_tr: Bu sayfa `tutorials/circuits/1_getting_started_with_qiskit.ipynb`__ adresinden oluşturulmuştur.
zh_tw: 這個頁面是從 `tutorials/circuits/1_getting_started_with_qiskit.ipynb`__ 產生的。

source: Getting Started with Qiskit
bn_bn: Qiskit দিয়ে শুরু করা যাক।
es_un: Primeros Pasos con Qiskit
fr: Démarrer avec Qiskit
it_it: Come iniziare con Qiskit
ja: Qiskit 入門
ko_kr: 키스킷 시작하기
pt_br: Primeiros passos com Qiskit
pt_un: Começando com o Qiskit
ru_ru: Начало работы с Qiskit
ta_in: Qiskit உடன் தொடங்குதல்
te: క్విస్కిట్‌తో ప్రారంభించడం
tr_tr: Qiskit'e Başlarken
zh_tw: Qiskit 入門

source: Here, we provide an overview of working with Qiskit. The fundamental package of Qiskit is Terra that provides the basic building blocks necessary to program quantum computers. The fundamental unit of Qiskit is the `quantum circuit <https://en.wikipedia.org/wiki/Quantum_circuit>`__. A basic workflow using Qiskit consists of two stages: **Build** and **Execute**. **Build** allows you to make different quantum circuits that represent the problem you are solving, and **Execute** that allows you to run them on different backends. After the jobs have been run, the data is collected and postprocessed depending on the desired output.
bn_bn: এখানে, আমরা Qiskit এর সাথে কাজ করার একটি সাধারণ ধারণা পাবো। Qiskit এর মূল প্যাকেজটি হল টেরা (Terra) যা কোয়ান্টাম কম্পিউটার নির্দেশমালা (প্রোগ্রাম) করার জন্য প্রয়োজনীয় নির্মাণ নকশা (বিল্ডিং ব্লক) সরবরাহ করে। Qiskit এর মূল এককটি হ'ল `quantum circuit <https://en.wikipedia.org/wiki/Quantum_circuit>`__। Qiskit ব্যবহার করে একটি প্রাথমিক কর্মপ্রবাহ দুটি ধাপ নিয়ে গঠিত: **নির্মাণ (বিল্ড)** এবং **কার্যকর(এক্সিকিউট)**। **নির্মাণ (বিল্ড)** আপনাকে বিভিন্ন কোয়ান্টাম বর্তনী (সার্কিট) তৈরি করতে দেয় যা আপনি যে সমস্যার সমাধান করছেন তাতে প্রতিনিধিত্ব করে এবং **কার্যকর (এক্সিকিউট)** যা আপনাকে এগুলি বিভিন্ন ব্যাক-এন্ডে চালানোর অনুমতি দেয়। কাজগুলি কার্যকর করার পরে, তথ্য (ডেটা) সংগ্রহ করা হয় এবং পছন্দসই ফলাফলের উপর নির্ভর করে পরবর্তী প্রক্রিয়া (পোস্টপ্রসেস) করা হয়।
es_un: Aquí, proporcionamos una descripción general del trabajo con Qiskit. El paquete fundamental de Qiskit es Terra que proporciona los bloques de construcción básicos necesarios para programar computadoras cuánticas. La unidad fundamental de Qiskit es el `circuito cuántico <https://en.wikipedia.org/wiki/Quantum_circuit>`__. Un flujo de trabajo básico con Qiskit consta de dos etapas: **Construir** y **Ejecutar**. **Construir** te permite crear diferentes circuitos cuánticos que representan el problema que estás resolviendo, y **Ejecutar** te permite ejecutarlos en diferentes backends. Una vez que se han ejecutado los trabajos, los datos se recopilan y se procesan posteriormente según la salida deseada.
fr: Ici, nous présentons une vue d'ensemble de l'utilisation de Qiskit. Le package fondamental de Qiskit est Terra, qui fournit les éléments de base nécessaires à la programmation des ordinateurs quantiques. L'unité fondamentale de Qiskit est le `circuit quantique <https://en.wikipedia.org/wiki/Quantum_circuit>`__. Un travail de base avec Qiskit se décompose en deux étapes : la **construction** et l'**exécution**. La **construction** permet de construire différents circuits quantiques qui représentent le problème que vous êtes en train de résoudre, tandis que l'**exécution** permet de les executer sur différents backends. Après l'exécution des circuits, les données sont collectées et traitées en fonction du résultat souhaité.
it_it: In queste sezioni viene fornita una panoramica su come lavorare con Qiskit. Il pacchetto fondamentale di Qiskit è Terra che fornisce i blocchi di base necessari per programmare con i computer quantistici. L'unità fondamentale di Qiskit è il `circuito quantistico <https://en.wikipedia.org/wiki/Quantum_circuit>`__. Un flusso di lavoro elementare che utilizza Qiskit consiste in due fasi: **Build** e **Execute**. **Build** consente di realizzare differenti circuiti quantistici relativi al problema che si vuole risolvere, e **Execute** consente di eseguirli su diversi backend. Dopo che i job sono stati eseguiti, i dati sono raccolti ed elaborati a seconda dell'output desiderato.
ja: ここでは、Qiskit での作業概要を説明します。Qiskit の基本パッケージは Terra です。これは、量子コンピューターのプログラミングに必要な、基本構成要素を提供します。Qiskit の基本単位は `量子回路 <https://en.wikipedia.org/wiki/Quantum_circuit>`__ です。Qiskit を使用した基本的なワークフローは、 **構築** と **実行** の2つのステージで構成されます。 **構築** では、あなたが解きたい問題を表現するさまざまな量子回路を構築でき、 **実行** では、その量子回路をさまざまなバックエンドで実行します。ジョブが実行された後、目的とする出力に応じたデータが収集され、後処理されます。
pt_br: Aqui, apresentamos uma visão do trabalho com o Qiskit. O pacote fundamental do Qiskit é o Terra que fornece os blocos básicos de desenvolvimento, necessários para programar computadores quânticos. A unidade fundamental do Qiskit é o `circuito quantum <https://en.wikipedia.org/wiki/Quantum_circuit>`__. Um fluxo de trabalho básico usando Qiskit consiste em dois estágios: **Construir** e **Executar**. **Construir** permite que você crie circuitos quânticos diferentes que representam o problema que você está resolvendo, e **Execute** permite que você os execute em diferentes backends. Após a execução dos trabalhos, os dados são coletados e processados dependendo da saída desejada.
pt_un: Aqui, trazemos uma visão geral de como utilizar o Qiskit. O pacote fundamental do Qiskit é o Terra, que fornece os blocos básicos de construção necessários para programar computadores quânticos. A unidade fundamental do Qiskit é o `circuito quântico <https://en.wikipedia.org/wiki/Quantum_circuit>`__. Um fluxo básico utilizando Qiskit consiste de dois estágios: **Construção** e **Execução**. **Construção** permite que você faça diferentes circuitos quânticos que representam o problema que você está resolvendo, e **Execução** permite que você rode tais circuitos em diferentes backends. Após rodar os processos, os dados são coletados e pós-processados dependendo da saída desejada.
ru_ru: Здесь мы представляем обзор работы с Qiskit. Основной пакет Qiskit Terra предоставляет основные блоки, необходимые для программирования квантовых компьютеров. Фундаментальная единица Qiskit — это цепь `(quantum circuit) <https://en.wikipedia.org/wiki/Quantum_circuit>`__. Базовый процесс работы с Qiskit состоит из двух этапов: **Создание (Build)** и **Запуск (Execute)**. **Build** позволяет создавать различные квантовые схемы, представляющие решаемую проблему, и **Execute**, запускающий их в разных окружениях. После выполнения задач, с окружения собираются данные и обрабатываются в зависимости от желаемого результата.
ta_in: இங்கே, Qiskit உடன் பணிபுரியும் கண்ணோட்டத்தை நாங்கள் வழங்குகிறோம். Qiskit அடிப்படை தொகுப்பு டெர்ரா ஆகும், இது குவாண்டம் கம்ப்யூட்டர்களை நிரல் செய்ய தேவையான அடிப்படை கட்டுமான தொகுதிகளை வழங்குகிறது. Qiskit அடிப்படை அலகு `quantum circuit <https://en.wikipedia.org/wiki/Quantum_circuit>`__. Qiskit பயன்படுத்தி ஒரு அடிப்படை பணிப்பாய்வு இரண்டு நிலைகளைக் கொண்டுள்ளது: **கட்டமைப்பு** மற்றும் **செயல்படுத்துதல்**. **கட்டமைப்பு** நீங்கள் தீர்க்கும் சிக்கலைக் குறிக்கும் வெவ்வேறு குவாண்டம் சர்க்யூட்களை உருவாக்க உங்களை அனுமதிக்கிறது, மேலும் **செயல்படுத்துதல்** அவற்றை வெவ்வேறு பின்தளத்தில் இயக்க அனுமதிக்கிறது. வேலைகள் இயக்கப்பட்ட பிறகு, விரும்பிய வெளியீட்டைப் பொறுத்து தரவு சேகரிக்கப்பட்டு பின் செயலாக்கப்படும்.
te: ఇక్కడ, మేము Qiskitతో పని చేసే అవలోకనాన్ని అందిస్తాము. Qiskit యొక్క ప్రాథమిక ప్యాకేజీ Terra, ఇది క్వాంటం కంప్యూటర్‌లను ప్రోగ్రామ్ చేయడానికి అవసరమైన ప్రాథమిక బిల్డింగ్ బ్లాక్‌లను అందిస్తుంది. Qiskit యొక్క ప్రాథమిక యూనిట్ `క్వాంటం సర్క్యూట్ <https://en.wikipedia.org/wiki/Quantum_circuit>`__. Qiskitని ఉపయోగించే ప్రాథమిక వర్క్‌ఫ్లో రెండు దశలను కలిగి ఉంటుంది: **బిల్డ్** మరియు **ఎగ్జిక్యూట్**. **బిల్డ్** మీరు పరిష్కరిస్తున్న సమస్యను సూచించే విభిన్న క్వాంటం సర్క్యూట్‌లను తయారు చేయడానికి మిమ్మల్ని అనుమతిస్తుంది మరియు **ఎగ్జిక్యూట్**ని వివిధ బ్యాకెండ్‌లలో అమలు చేయడానికి మిమ్మల్ని అనుమతిస్తుంది. జాబ్‌లు అమలు చేయబడిన తర్వాత, కావలసిన అవుట్‌పుట్‌పై ఆధారపడి డేటా సేకరించబడుతుంది మరియు పోస్ట్‌ప్రాసెస్ చేయబడుతుంది.
tr_tr: Burada, Qiskit ile çalışmaya genel bir bakış sunuyoruz. Qiskit'in temel paketi, kuantum bilgisayarları programlamak için gerekli temel yapı taşlarını sağlayan Terra'dır. Qiskit'in temel birimi `quantum circuit <https://en.wikipedia.org/wiki/Quantum_circuit>`__. Qiskit kullanan temel bir iş akışı iki aşamadan oluşur: **Oluşturma** ve **Yürütme**. **Oluşturma**, çözmekte olduğunuz sorunu temsil eden farklı kuantum devreleri oluşturmanıza ve bunları farklı arka uçlarda çalıştırmanıza izin veren **Yürütme** yapmanıza olanak tanır. İşler çalıştırıldıktan sonra, veriler toplanır ve istenen çıktıya bağlı olarak son işlemden geçirilir.

source: Circuit Basics
bn_bn: বর্তনীর (সার্কিট) প্রাথমিক ধারণা
es_un: Conceptos Básicos de un Circuito
fr: Principes de base des circuits
it_it: Fondamenti dei circuiti
ja: 回路の基本
ko_kr: 회로 기초
pt_br: Circuitos básicos
pt_un: Princípios básicos sobre Circuitos
ru_ru: Основы цепей
ta_in: சர்க்யூட் அடிப்படைகள்
te: సర్క్యూట్ బేసిక్స్
tr_tr: Devre Temelleri
zh_tw: 基礎電路

source: Building the circuit
bn_bn: বর্তনী (সার্কিট) নির্মাণ
es_un: Construcción del circuito
fr: Construction du circuit
it_it: Costruire il circuito
ja: 回線の構築
ko_kr: 회로 만들기
pt_br: Construindo o circuito
pt_un: Construindo o circuito
ru_ru: Построение цепей
ta_in: சர்க்யூட் கட்டமைத்தல்
te: సర్క్యూట్ నిర్మించడం
tr_tr: Devrenin oluşturulması
zh_tw: 建立電路

source: The basic element needed for your first program is the QuantumCircuit. We begin by creating a ``QuantumCircuit`` comprised of three qubits.
bn_bn: প্রথম নির্দেশমালাটির (প্রোগ্রাম) জন্য প্রয়োজনীয় মৌলিক উপাদানটি হল QuantumCircuit। আমরা তিনটি কিউবিট সমন্বিত একটি ``QuantumCircuit`` তৈরির মাধ্যমে শুরু করি।.
es_un: El elemento básico necesario para tu primer programa es el QuantumCircuit. Comenzamos creando un ``QuantumCircuit`` compuesto por tres qubits.
fr: L'élément de base dont vous aurez besoin pour ce premier programme est le QuantumCircuit (circuit quantique). Nous commençons par créer un ``QuantumCircuit`` constitué de 3 qubits.
it_it: L'elemento base necessario per il primo programma è il QuantumCircuit. Iniziamo creando un ``QuantumCircuit`` composto da tre qubit.
ja: 最初のプログラムに必要な基本要素は、QuantumCircuitです。まず、3つの量子ビットで構成される ``QuantumCircuit`` を作成します。
ko_kr: 첫 프로그램을 위한 기본 요소는 QuantumCircuit 이며. 우리는 세 개의 큐빗으로 구성된 ``QuantumCircuit``을 만드는 것으로 시작한다.
pt_br: O elemento básico necessário para o seu primeiro programa é o QuantumCircuit. Vamos criar um ``QuantumCircuit`` composto por três qubits.
pt_un: O elemento básico necessário para seu primeiro programa é o QuantumCircuit. Começamos por criar um ``QuantumCircuit`` composto de três qubits.
ru_ru: Основным элементом, необходимым для первой программы, является QuantumCircuit. Начнем с создания ``QuantumCircuit``, состоящего из трех кубитов.
ta_in: உங்கள் முதல் நிரலுக்கு தேவையான அடிப்படை உறுப்பு குவாண்டம்சர்க் ஆகும். நாம் மூன்று க்யூபிட்களைக் கொண்ட ஒரு ``QuantumCircuit`` உருவாக்குவதன் மூலம் தொடங்குகிறோம்.
te: మీ మొదటి ప్రోగ్రామ్‌కు అవసరమైన ప్రాథమిక మూలకం QuantumCircuit. మేము మూడు క్విట్‌లతో కూడిన ``QuantumCircuit``ని సృష్టించడం ద్వారా ప్రారంభిస్తాము.
tr_tr: İlk programınız için gereken temel öğe QuantumCircuit'dir. Üç kübitten oluşan bir ``QuantumCircuit`` oluşturarak başlıyoruz.
zh_tw: 您第一個程式所需的基本元素是 QuantumCircuit。我們先建立一個由三個量子位元組成的 “量子電路”

source: After you create the circuit with its registers, you can add gates (“operations”) to manipulate the registers. As you proceed through the tutorials you will find more gates and circuits; below is an example of a quantum circuit that makes a three-qubit GHZ state
bn_bn: বর্তনী (সার্কিট) টি রেজিস্টারগুলি দিয়ে তৈরি করার পরে, আপনি রেজিস্টার গুলি পরিচালনা করতে যুক্তিবর্তনী (গেইট) ("ক্রিয়াকলাপ (অপারেশন)") যুক্ত করতে পারেন। টিউটোরিয়ালগুলির মাধ্যমে আপনি আরও দ্বার এবং বর্তনী (সার্কিট) পাবেন। নীচে কোয়ান্টাম বর্তনীর (সার্কিটের) একটি উদাহরণ দেওয়া হলো যা তিন কিউবিট GHZ মান তৈরি করে।
it_it: Dopo aver creato il circuito con i suoi registri, è possibile aggiungere gate ("operazioni") per manipolare i registri. Procedendo con i tutorial si incontreranno diversi gate e circuiti; di seguito c'è un esempio di un circuito quantistico che realizza uno stato a tre qubit GHZ
pt_un: Após criar o circuito com seus registradores, você pode adicionar portas (“operações”) para manipular os registradores. Conforme você avançar pelos tutoriais, descobrirá mais portas e circuitos; abaixo há um exemplo de circuito quântico que cria um estado GHZ de três qubits
ru_ru: После создания цепи с регистрами, можно добавлять гейты ("операции") для работы с регистрами. По мере прохождения учебных материалов Вы найдете больше гейтов и цепей; Ниже приведен пример квантовой цепи, которая создает состояние GHZ для трех кубитов
ta_in: நீங்கள் அதன் பதிவேடுகளுடன் சுற்று உருவாக்கிய பிறகு, பதிவுகளை கையாள கேட்களை ("செயல்பாடுகள்") சேர்க்கலாம். பயிற்சிகள் மூலம் நீங்கள் தொடரும்போது நீங்கள் அதிக வாயில்கள் மற்றும் சுற்றுகளைக் காண்பீர்கள்; கீழே மூன்று க்யூபிட் GHZ நிலையை உருவாக்கும் குவாண்டம் சுற்றுக்கு ஒரு உதாரணம்
tr_tr: Devreyi kuantum yazmaçları ile oluşturduktan sonra, yazmaçları değiştirmek için kapılar (“operations”) ekleyebilirsiniz. Dokümantasyonda ilerledikçe daha fazla kapı ve devre bulacaksınız; aşağıda üç-kübit GHZ durumu oluşturan bir kuantum devre örneği verilmiştir

source: |\psi\rangle = \left(|000\rangle+|111\rangle\right)/\sqrt{2}.
bn_bn: |\psi\rangle = \left(|00\rangle+|11\rangle\right)/\sqrt{2}.

source: To create such a state, we start with a three-qubit quantum register. By default, each qubit in the register is initialized to :math:`|0\rangle`. To make the GHZ state, we apply the following gates: - A Hadamard gate :math:`H` on qubit 0, which puts it into the superposition state :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}`. - A controlled-Not operation (:math:`C_{X}`) between qubit 0 and qubit 1. - A controlled-Not operation between qubit 0 and qubit 2.
bn_bn: এমন একটি স্থিতি (স্টেট্ ) তৈরি করতে, আমরা তিন-কিউবিট কোয়ান্টাম রেজিস্টার দিয়ে শুরু করি। পূর্বনির্ধারিতভাবে (ডিফল্ট) রেজিস্টারের প্রতিটি কিউবিট :math:`|0\rangle` থেকে শুরু করা হয়। GHZ স্থিতিটি তৈরি করতে, আমরা নিম্নলিখিত যুক্তিদ্বার (গেট) গুলি প্রয়োগ করি:- ১. কিউবিট ০-এ একটি হ্যাডামার্ড যুক্তিদ্বার (গেট) :math:`H` যা এটিকে উপরিপাতন (সুপারপজিশন) স্থিতি :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}` এ ফেলেছে। ২. কিউবিট ০ এবং কিউবিট ১ এর মধ্যে একটি কনট্রোলড নট অপারেশন (:math:`C_{X}`)। ৩. কিউবিট 0 এবং কিউবিট ২ এর মধ্যে একটি কনট্রোলড নট অপারেশন।
it_it: Per creare un tale stato, iniziamo con un registro quantistico a tre qubit. Di default, ogni qubit nel registro è inizializzato a :math:`|0\rangle`. Per realizzare lo stato GHZ, applichiamo i seguenti gate: - Un gate Hadamard :math:`H` sul qubit 0, che lo mette nello stato di sovrapposizione :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}`. - Una operazione controlled-Not (:math:`C_{X}`) tra il qubit 0 e il qubit 1. - Una operazione controlled-Not tra il qubit 0 e il qubit 2.
pt_br: Para criar tal estado, começamos com um registo quântico de três qubit. Por padrão, cada qubit no registro é inicializado para o :math:`|0\rangle`. Para tornar o estado de GHZ, aplicamos os seguintes gates: - Um Hadamard gate :math:`H` no qubit 0, que o coloca no estado de superposição :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}`. - Uma operação controlada Not (:math:`C_{X}`) entre o qubit 0 e o qubit 1. - Uma operação controlada Not entre o qubit 0 e o qubit 2.
pt_un: Para criar tal estado, nós começamos com um registrador quântico de 3 qubits. Por padrão, cada qubit no registrador é inicializado em :math:`|0\rangle`. Para fazer o estado GHZ, as seguintes portas são aplicadas: - Uma porta Hadamard :math:`H` no qubit 0, que o coloca no estado de superposição :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}`. - Uma operações de inversão controlada (:math:`C_{X}`) entre os qubit 0 e 1. - Outra operação de inversão controlada entre os qubit 0 e 2.
ru_ru: Чтобы создать такое состояние, необходим квантовый регистр с тремя кубитами. По умолчанию каждый кубит инициализируется в состоянии :math:`|0\rangle`. Чтобы создать состояние GHZ, мы применяем следующее: - Гейт Адамара :math:`H` на кубит с индексом 0, которая помещает его в состояние суперпозиции :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}`. - Гейт CNOT (контролируемое логическое "НЕ") (:math:`C_{X}`) между кубитами с адресами 0 и 1. - Гейт CNOT между кубитами 0 и 2.
ta_in: அத்தகைய நிலையை உருவாக்க, நாங்கள் மூன்று-க்யூபிட் குவாண்டம் பதிவோடு தொடங்குகிறோம். இயல்பாக, பதிவேட்டில் உள்ள ஒவ்வொரு க்யூபிட்டும் ஆரம்பிக்கப்பட்டது: :math:`|0\rangle`. GHZ மாநிலத்தை உருவாக்க, நாங்கள் பின்வரும் வாயில்களைப் பயன்படுத்துகிறோம்: - ஒரு ஹடாமார்ட் வாயில் க்யூபிட் 0 இல் :math:`H`, இது சூப்பர் பொசிஷன் நிலையில் வைக்கிறது :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}`. - கட்டுப்படுத்தப்பட்ட-அல்லாத செயல்பாடு (:math:`C_{X}`) க்யூபிட் 0 மற்றும் க்யூபிட் 1.- ஒரு கட்டுப்படுத்தப்பட்ட-க்யூபிட் 0 மற்றும் க்யூபிட் 2 க்கு இடையே செயல்பாடு.
tr_tr: Böyle bir durum yaratmak için üç kübitlik bir kuantum yazmacı ile başlarız. Varsayılan olarak, yazmaçtaki her bir kübit :math:`|0\rangle` ile başlatılır. GHZ durumunu yapmak için, aşağıdaki kapıları uygularız: - Kübit 0'a bir Hadamard kapısı :math:`H`, onu süperpozisyon durumuna :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}` getirir. - Kübit 0 ve kübit 1 arasında bir kontrollü-Değil işlemi (:math:`C_{X}`). - Kübit 0 ve kübit 2 arasında kontrollü-Değil işlemi.
zh_tw: 為了建立這種狀態，我們從一個三量子位元的量子暫存器開始。根據預設，暫存器中的每一個量子位元會起始設定為 :math:`|0\rangle`。若要製備為 GHZ 狀態，需要執行以下步驟：- 在 qubit 0 上放 Hadamard 閘 :math:`H`，將它變成疊加態 :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}`。- 在 qubit 0 與 qubit 1 之間放 CNOT 閘（:math:`C_{X}`）。- 在 qubit 0 與 qubit 2 之間放 CNOT 閘。

source: On an ideal quantum computer, the state produced by running this circuit would be the GHZ state above.
bn_bn: একটি আদর্শ কোয়ান্টাম কম্পিউটারে, এই বর্তনী (সার্কিট) টি চালিয়ে প্রাপ্ত মান বা অবস্থা (স্টেট্) টি উপরের GHZ মান বা অবস্থা হবে।
es_un: En una computadora cuántica ideal, el estado producido al ejecutar este circuito sería el estado GHZ anterior.
fr: Dans un calculateur quantique parfait, l'état produit en exécutant ce circuit serait l'état GHZ ci-dessus.
it_it: Su un computer quantistico ideale, lo stato prodotto dall'esecuzione di questo circuito sarebbe lo stato GHZ in alto.
ja: 理想的な量子コンピューターでは、この回路を実行することによって生成される状態は、上記のGHZ状態になります。
ko_kr: 이상적인 양자 컴퓨터에서는 이 회로에 의해 만들어진 상태는 위에 생성된 GHZ 상태이다.
pt_br: Em um computador quântico ideal, o estado produzido após rodar este circuito seria o estado GHZ acima.
pt_un: Em um computador quântico ideal, a execução desse circuito produziria o estado GHZ acima.
ru_ru: На идеальном квантовом компьютере состояние, производимое при запуске этой цепи, было бы состояние GHZ описанное формулой выше.
ta_in: ஒரு சிறந்த குவாண்டம் கணினியில், இந்த சுற்று இயங்குவதன் மூலம் உற்பத்தி செய்யப்படும் நிலை மேலே உள்ள GHZ மாநிலமாக இருக்கும்.
te: ఆదర్శవంతమైన క్వాంటం కంప్యూటర్‌లో, ఈ సర్క్యూట్‌ని అమలు చేయడం ద్వారా ఉత్పత్తి చేయబడిన స్థితి పైన ఉన్న GHZ స్థితిగా ఉంటుంది.
tr_tr: İdeal bir kuantum bilgisayarında, bu devrenin çalıştırılmasıyla üretilen durum yukarıdaki GHZ durumu olacaktır.
zh_tw: 在理想的量子計算機上，執行此電路所產生的結果會是上述提及的 GHZ 態。

source: In Qiskit, operations can be added to the circuit one by one, as shown below.
bn_bn: Qiskit এ বর্তনীর (সার্কিট) সাথে ক্রিয়াকলাপগুলি নিম্নলিখিতভাবে এক এক করে যুক্ত করা যেতে পারে।
es_un: En Qiskit, las operaciones se pueden agregar al circuito una por una, como se muestra a continuación.
fr: Dans Qiskit, les opérations peuvent être ajoutées au circuit une par une, comme montré ci-dessous.
it_it: In Qiskit, le operazioni possono essere aggiunte al circuito una alla volta, come mostrato di seguito.
ja: Qiskit では、以下に示すように、回路に操作を1つずつ追加することができます。
ko_kr: 키스킷에서는 아래와 같이 연산을 회로에 하나씩 추가 할 수 있다.
pt_br: No Qiskit, as operações podem ser adicionadas ao circuito uma a uma, como mostrado abaixo.
pt_un: No Qiskit, as operações podem ser adicionadas ao circuito uma a uma, como mostrado abaixo.
ru_ru: В Qiskit операции можно добавить к цепи один за другим, как показано ниже.
ta_in: Qiskit, கீழே காட்டப்பட்டுள்ளது போல், செயல்பாடுகளை ஒவ்வொன்றாக சுற்றுக்குச் சேர்க்கலாம்.
te: Qiskitలో, క్రింద చూపిన విధంగా కార్యకలాపాలు ఒక్కొక్కటిగా సర్క్యూట్‌కు జోడించబడతాయి.
tr_tr: Qiskit'te işlemler, aşağıda gösterildiği gibi devreye birer birer eklenebilir.
zh_tw: 在 Qiskit 中，多個操作可以被依次增加到電路中，如下所示。

source: Visualize Circuit
bn_bn: বর্তনী (সার্কিট) দৃশ্যায়িত করা
es_un: Visualizar el circuito
fr: Visualisation du circuit
it_it: Visualizzare il Circuito
ja: 回路の可視化
ko_kr: 회로 가시화하기
pt_br: Visualizar Circuito
pt_un: Visualizar o Circuito
ru_ru: Визуализация цепи
ta_in: சர்க்யூட்டை காட்சிப்படுத்தவும்
te: సర్క్యూట్ దృశ్యమానం
tr_tr: Devreyi Görselleştir
zh_tw: 電路視覺化

source: You can visualize your circuit using Qiskit ``QuantumCircuit.draw()``, which plots the circuit in the form found in many textbooks.
bn_bn: আপনি Qiskit ``QuantumCircuit.draw()`` ব্যবহার করে বর্তনী (সার্কিট) দৃশ্যায়িত করতে পারেন, যেমন বহুসংখ্যক পাঠ্যপুস্তকের মধ্যে বর্তনী (সার্কিট) থাকে।
es_un: Puedes visualizar tu circuito usando ``QuantumCircuit.draw()`` de Qiskit, que dibuja el circuito en la forma que se encuentra en muchos libros de texto.
fr: Vous pouvez visualiser le circuit en utilisant la méthode ``QuantumCircuit.draw()``, qui dessinera le circuit tel qu'on le voit dans de nombreux ouvrages.
it_it: È possibile visualizzare il proprio circuito utilizzando Qiskit ``QuantumCircuit.draw()``, che disegna il circuito nella forma che troviamo in molti libri di testo.
ja: Qiskitの ``QuantumCircuit.draw()`` を使うことで、多くの教科書で見られるような形式に回路をプロットし、可視化することができます。
ko_kr: 키스킷의 ``QuantumCircuit.draw()``를 사용하여 회로를 시각화 할 수 있으며. 여러 교재에 보여진 형태로 회로가 그려진다.
pt_br: Você pode visualizar seu circuito usando Qiskit ``QuantumCircuit.draw()``, que plota o circuito na forma encontrada em muitos livros didáticos.
pt_un: Você pode visualizar seu circuito usando Qiskit ``QuantumCircuit.draw()``, que desenha o circuito na forma encontrada em muitos livros didáticos.
ru_ru: Вы можете визуализировать свою схему с помощью метода Qiskit ``QuantumCircuit.draw()``, который выводит схему в форме, которую можно найти во многих пособиях.
ta_in: Qiskit ``QuantumCircuit.draw()`` ஐப் பயன்படுத்தி உங்கள் சுற்றுவட்டத்தை நீங்கள் காட்சிப்படுத்தலாம், இது பல பாடப்புத்தகங்களில் காணப்படும் வடிவத்தில் சுற்றுகளைத் திட்டமிடுகிறது.
te: మీరు Qiskitని ఉపయోగించి మీ సర్క్యూట్‌ను దృశ్యమానం చేయవచ్చు ``QuantumCircuit.draw()``, ఇది అనేక పాఠ్యపుస్తకాలలో కనిపించే రూపంలో సర్క్యూట్‌ను ప్లాట్ చేస్తుంది.
tr_tr: Devrenizi birçok ders kitabında bulunan formda çizen Qiskit ``QuantumCircuit.draw()`` kullanarak görselleştirebilirsiniz.
zh_tw: 您可以用 Qiskit ``QuantumCircuit.draw()`` 將你的程式碼視覺化，是許多教科書會採用的電路畫法
