Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/1_getting_started_with_qiskit.po
Languages: bn_bn, es_un, fr, it_it, ja, ko_kr, pt_br, pt_un, ru_ru, ta_in, te, tr_tr, zh_tw

source: The estimated outcome probabilities :math:`\mathrm{Pr}(000)` and :math:`\mathrm{Pr}(111)` are computed by taking the aggregate counts and dividing by the number of shots (times the circuit was repeated). Try changing the ``shots`` keyword in the ``execute`` function and see how the estimated probabilities change.
bn_bn: :math:`\mathrm{Pr}(000)``এবং :math:`\mathrm{Pr}(111)` আনুমানিক ফলাফল সম্ভাবনা গণনা করতে মোট গৃহীত পরিসংখ্যানকে শট সংখ্যা (বর্তনীটির পুনর্ব্যবহার সংখ্যা) দিয়ে ভাগ করা হয়। ``shots``কীওয়ার্ডটি পরিবর্তন করে ``execute`` ব্যবহার করে অনুমানযোগ্য সম্ভাবনাগুলির কিরূপ পরিবর্তন হয় তা দেখুন।
it_it: Le probabilità risultanti stimate :math:`\mathrm{Pr}(000)` e :math:`\mathrm{Pr}(111)` sono calcolate considerando il conteggio aggregato e dividendo per il numero di shot (volte in cui il circuito è stato ripetuto). Provando a modificare il valore della parola chiave ``shots`` nella funzione ``execute`` si può vedere come cambiano le probabilità stimate.
ko_kr: 예측 값인 확률 :math:`\mathrm{Pr}(000)`과 :math:`\mathrm{Pr}(111)`는 유효 카운트를 모두 더한 후에 (회로가 몇 번 실행되었는지를 가르키는) 시뮬레이션 숫자로 나누어서 계산되어진다. ``execute`` 함수에 있는 ``shots`` 키워드를 수정해 보면서 예측 확률 값이 어떻게 변하는지 살펴보기 바란다.
pt_br: As probabilidades estimadas do resultado :math:`\mathrm{Pr}(000)` e :math:`\mathrm{Pr}(111)` são calculadas pegando as contagens agregadas e dividindo pelo número de shots (vezes que o circuito foi repetido). Tente alterar a palavra-chave ``shots`` na função ``execute`` e veja como as probabilidades se alteram.
pt_un: A probabilidades estimadas das saídas :math:`\mathrm{Pr}(000)` e :math:`\mathrm{Pr}(111)` são calculadas tomando as contagens agregadas e dividindo pelo número de shots (vezes que o circuito foi repetido). Tente mudar a palavra-chave ``shots`` na função ``execute`` e veja como as probabilidades estimadas mudam.
ru_ru: Приблизительные вероятности исхода :math:`\mathrm{Pr}(000)` и :math:`\mathrm{Pr}(111)` вычисляются путем деления количества раз, когда был получен конкретный результат, на количество запусков (повторений). Попробуйте изменить параметр ``shots`` в функции ``execute`` и посмотрите, как изменяются вероятности.
ta_in: மதிப்பிடப்பட்ட விளைவு நிகழ்தகவு :math:`\mathrm{Pr}(000)` மற்றும் :math:`\mathrm{Pr}(111)` மொத்த எண்ணிக்கையை எடுத்து காட்சிகளின் எண்ணிக்கையால் வகுப்பதன் மூலம் கணக்கிடப்படுகிறது (சுற்று மீண்டும் மீண்டும் செய்யப்பட்ட முறை). ``execute`` செயல்பாட்டில் ``shots`` முக்கிய வார்த்தையை மாற்ற முயற்சிக்கவும் மற்றும் மதிப்பிடப்பட்ட நிகழ்தகவுகள் எவ்வாறு மாறுகின்றன என்பதைப் பார்க்கவும்.
tr_tr: Tahmini sonuç olasılıkları :math:`\mathrm{Pr}(000)` ve :math:`\mathrm{Pr}(111)` toplam sayıları alarak ve deneme sayısına (devrenin tekrarlanma sayısı) bölünerek hesaplanır. ``execute`` işlevindeki ``shots`` anahtar kelimesini değiştirmeyi deneyin ve tahmini olasılıkların nasıl değiştiğini görün.
zh_tw: 要估計結果為 :math:`\mathrm{Pr}(000)` 和 :math:`\mathrm{Pr}(111)` 機率，需分別由各輸出結果的總計數除以電路反覆執行的次數。請嘗試變更 ``execute`` 函數中的關鍵字 ``shots``，來查看估計機率會如何變化。

source: Here, we provide an overview of working with Qiskit. The fundamental package of Qiskit is Terra that provides the basic building blocks necessary to program quantum computers. The fundamental unit of Qiskit is the `**quantum circuit** <https://en.wikipedia.org/wiki/Quantum_circuit>`__. A basic workflow using Qiskit consists of two stages: **Build** and **Execute**. **Build** allows you to make different quantum circuits that represent the problem you are solving, and **Execute** that allows you to run them on different backends. After the jobs have been run, the data is collected and postprocessed depending on the desired output.
ko_kr: 여기서는 키스킷을 사용하기에 대한 요약을 제공한다. 키스킷의 기반이 되는 패키지는 테라(Terra)이며, 양자 컴퓨터를 프로그램하기 위한 기본 블럭들을 제공한다. 키스킷의 기반 유닛은 `**양자 회로** <https://en.wikipedia.org/wiki/Quantum_circuit>`__ 이다. 키스킷을 사용하는 작업 흐름은 다음의 두 가지 단계로 이루어져 있다. **만들기** and **실행하기**. **만들기** 단계는 풀려고 하는 문제를 표현하는 여러 양자 회로들을 만들수 있게 해주고, **실행하기** 단계는 각각의 회로를 다른 후위 처리 장치에서 실행하게 해준다. 작업이 실행되고 난 후에 원하는 출력에 따라 자료가 수집되고 후 처리되게 된다.

source: After you create the circuit with its registers, you can add gates ("operations") to manipulate the registers. As you proceed through the tutorials you will find more gates and circuits; below is an example of a quantum circuit that makes a three-qubit GHZ state
es_un: Después de crear el circuito con sus registros, puedes agregar compuertas ("operaciones") para manipular los registros. A medida que avances en los tutoriales, encontrarás más compuertas y circuitos; a continuación, se muestra un ejemplo de un circuito cuántico que genera un estado GHZ de tres qubits
fr: Après avoir créé le circuit avec ses registres, vous pouvez ajouter les portes ("opérations") pour manipuler les registres. En parcourant les tutoriels vous trouverez davantage de portes et de circuits ; ci-dessous un exemple de circuit quantique qui crée un état GHZ avec 3 qubits
ja: レジスタで回路を作成した後、レジスタを操作するためのゲート ("演算") を追加することができます。チュートリアルを進めていくと、さらに多くのゲートと回路が見つかります。以下は3量子ビットのGHZ状態を作る量子回路の例です。
ko_kr: 레지스터로 구성된 회로를 만든 후 게이트("연산")을 추가 하여 레지스터를 조작할 수 있다. 사용 지침서를 진행하면서, 더 많은 게이트와 회로에 대해 배울 수 있고. 아래는 삼-큐비트 GHZ 상태를 만드는 양자 회로의 예다.
pt_br: Depois de criar o circuito com os registros, você pode adicionar portas ("operações") para manipular os registros. Conforme avançar nos tutoriais, você encontrará mais portas e circuitos; abaixo está um exemplo de um circuito quântico que cria um estado de 3-qubit GHZ
te: మీరు దాని రిజిస్టర్‌లతో సర్క్యూట్‌ను సృష్టించిన తర్వాత, రిజిస్టర్‌లను మార్చటానికి మీరు గేట్‌లను ("ఆపరేషన్స్") జోడించవచ్చు. మీరు ట్యుటోరియల్స్ ద్వారా కొనసాగినప్పుడు మీరు మరిన్ని గేట్లు మరియు సర్క్యూట్‌లను కనుగొంటారు; మూడు-క్విట్ GHZ స్థితిని చేసే క్వాంటం సర్క్యూట్ యొక్క ఉదాహరణ క్రింద ఉంది

source: To create such a state, we start with a three-qubit quantum register. By default, each qubit in the register is initialized to :math:`|0\rangle`. To make the GHZ state, we apply the following gates: \* A Hadamard gate :math:`H` on qubit 0, which puts it into the superposition state :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}`. \* A controlled-Not operation (:math:`C_{X}`) between qubit 0 and qubit 1. \* A controlled-Not operation between qubit 0 and qubit 2.
ko_kr: 위와 같은 상태를 만들기 위해서는 삼-큐비트 양자 레지스터로 시작해야 한다. 기본적으로 레지스터에 있는 각각의 큐비트는 :math:`|0\rangle` 상태로 초기화 되어 있으며. GHZ 상태로 만들기 위해서는 다음과 같은 게이트를 적용해야 한다. 큐비트 0에 \* 하다마드 게이트 :math:`H`를 적용하여서 중첩상태 :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}`로 만든다. \* 그 다음은 조절된 부정 연산 (:math:`C_{X}`)을 큐빗 0과 큐빗 1 사이에 적용. \* 그리고 조절된 부정 연산을 큐빗 0과 큐빗 2 사이에 적용한다.

source: When representing the state of a multi-qubit system, the tensor order used in Qiskit is different than that used in most physics textbooks. Suppose there are :math:`n` qubits, and qubit :math:`j` is labeled as :math:`Q_{j}`. Qiskit uses an ordering in which the :math:`n^{\mathrm{th}}` qubit is on the left side of the tensor product, so that the basis vectors are labeled as :math:`Q_n\otimes \cdots \otimes Q_1\otimes Q_0`.
ko_kr: 다중 큐비트 시스템의 상태를 나타낼 때에, 키스킷은 대부분의 물리 교재에서 사용되는 텐서(tensor)의 순서와는 반대 되는 순서를 사용한다. 만약 :math:`n`개의 큐빗이 있고, 큐비트 :math:`j`가 :math:`Q_{j}`로 표시되었다고 하자. 키스킷은 :math:`n^{\mathrm{th}}` 큐비트는 텐서 곱의 왼쪽 편에 있어서 기저 벡터들이 :math:`Q_n\otimes \cdots \otimes Q_1\otimes Q_0`로 표현되어 진다.

source: Now that we have chosen the backend, it's time to compile and run the quantum circuit. In Qiskit we provide the ``execute`` function for this. ``execute`` returns a ``job`` object that encapsulates information about the job submitted to the backend.
ko_kr: 후위 처리 장치를 정한 이후에 양자 회로를 컴파일하고 실행해야 한다. 이를 위해 키스킷은 ``execute``함수를 제공한다. ``execute``은 후위 처리 장치에 제출된 작업에 대한 정보를 함축하고 있는 ``job`` 객체를 되돌려 준다.
pt_br: Agora que escolhemos o backend, é hora de compilar e executar o circuito quântico. No Qiskit fornecemos a função ``execute`` para isso. ``execute`` retorna um objeto ``job`` que encapsula informações sobre o trabalho submetido ao backend.

source: Below, we use the visualization function to plot the real and imaginary components of the state density matrix :nbsphinx-math:`\rho`.
ko_kr: 아래에는 시각화 함수를 사용하여 상태 밀도 매트릭스 :nbsphinx-math:`\rho`의 실수와 허수를 나타낸 것이다.

source: |\psi\rangle = |000\rangle +|111\rangle)/\sqrt{2},
ko_kr: |\psi\rangle = |000\rangle+|111\rangle\right)/\sqrt{2}.

source: To create such a state, we start with a three-qubit quantum register. By default, each qubit in the register is initialized to :math:`|0\rangle`. To make the GHZ state, we apply the following gates: - A Hadamard gate :math:`H` on qubit :math:`q_{0}`, which puts it into the superposition state :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}`. - A controlled-Not operation (:math:`C_{X}`) between qubit :math:`q_{0}` and qubit :math:`q_{1}`. - A controlled-Not operation between qubit :math:`q_{0}` and qubit :math:`q_{2}`.
es_un: Para crear tal estado, comenzamos con un registro cuántico de tres qubits. De forma predeterminada, cada qubit en el registro se inicializa en :math:`|0\rangle`. Para hacer el estado GHZ, aplicamos las siguientes compuertas: - Una puerta Hadamard :math:`H` en qubit :math:`q_{0}`, que lo pone en el estado de superposición :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}`. - Una operación Not controlada (:math:`C_{X}`) entre el qubit :math:`q_{0}` y el qubit :math:`q_{1}`. - Una operación Not controlada entre el qubit :math:`q_{0}` y el qubit :math:`q_{2}`.
fr: Pour créer un tel état, nous commençons par un registre quantique à trois qubits. Par défaut, chaque qubit dans le registre est initialisé à :math:`|0\rangle`. Pour obtenir l'état GHZ, nous appliquons les portes suivantes : - Une porte Hadamard :math:`H` sur le qubit :math:`q_{0}`, qui le met dans l'état de superposition :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}`. - Une opération pas contrôlée (:math:`C_{X}`) entre le qubit :math:`q_{0}` et le qubit :math:`q_{1}`. - Une opération contrôlée-Pas entre le qubit :math:`q_{0}` et le qubit :math:`q_{2}`.
ja: このような状態を作成するには、3量子ビットの量子レジスターから始めます。デフォルトでは、レジスターの各量子ビットは :math:`|0\rangle` に初期化されています。GHZ状態を作成するには、次のゲートを適用します: - 量子ビット :math:`q_{0}` にアダマールゲート :math:`H` を適用して、重ね合わせ状態 :math:`\left(|0\rangle+|1\rangle\right)/\sqrt{2}` にします。 - 量子ビット :math:`q_{0}` と量子ビット :math:`q_{1}` の間に、制御NOT演算子 (:math:`C_{X}`) を適用します。 - 量子ビット :math:`q_{0}` と量子ビット :math:`q_{2}` の間に、制御NOT演算子を適用します。
te: అటువంటి స్థితిని సృష్టించడానికి, మేము మూడు-క్విట్ క్వాంటం రిజిస్టర్‌తో ప్రారంభిస్తాము. డిఫాల్ట్‌గా, రిజిస్టర్‌లోని ప్రతి క్విట్ :math:`|0\rangle`కి ప్రారంభించబడుతుంది. GHZ స్థితిని చేయడానికి, మేము ఈ క్రింది గేట్‌లను వర్తింపజేస్తాము: - క్విట్:math:`q_{0}`పై హడమార్డ్ గేట్ :math:`H`, ఇది సూపర్‌పొజిషన్ స్థితి :math:`\left(|0 \rangle+|1\rangle\right)/\sqrt{2}`. - qubit :math:`q_{0}` మరియు qubit :math:`q_{1}` మధ్య నియంత్రిత-కాని ఆపరేషన్ (:math:`C_{X}`). - qubit :math:`q_{0}` మరియు qubit :math:`q_{2}` మధ్య నియంత్రిత-కాని ఆపరేషన్.

source: In this circuit, the qubits are put in order, with qubit :math:`q_{0}` at the top and qubit :math:`q_{2}` at the bottom. The circuit is read left to right (meaning that gates that are applied earlier in the circuit show up further to the left).
es_un: En este circuito, los qubits son ordenados, con el qubit :math:`q_{0}` en la parte superior y el qubit :math:`q_{2}` en la parte inferior. El circuito se lee de izquierda a derecha (lo que significa que las compuertas que se aplican antes en el circuito aparecen más a la izquierda).
fr: Dans ce circuit, les qubits sont mis dans l'ordre, avec le qubit :math:`q_{0}` en haut et le qubit :math:`q_{2}` en bas. Le circuit est lu de gauche à droite (ce qui signifie que les portes qui sont appliquées plus tôt dans le circuit apparaissent plus loin à gauche).
ja: この回路では、量子ビットが順番に配置されており、一番上が量子ビット :math:`q_{0}` 、一番下が量子ビット :math:`q_{2}` です。回路は左から右に読みます (つまり、回路の初めに適用されたゲートが左側に表示されます)。
te: ఈ సర్క్యూట్‌లో, క్విట్‌లు ఎగువన qubit :math:`q_{0}` మరియు దిగువన qubit :math:`q_{2}`తో క్రమంలో ఉంచబడతాయి. సర్క్యూట్ ఎడమ నుండి కుడికి చదవబడుతుంది (అంటే సర్క్యూట్‌లో ముందుగా వర్తింపజేసిన గేట్‌లు మరింత ఎడమ వైపుకు చూపబడతాయి).

source: For example, if qubit :math:`Q_{0}` is in state 0, qubit :math:`Q_{1}` is in state 0, and qubit :math:`Q_{2}` is in state 1, Qiskit would represent this state as :math:`|100\rangle`, whereas many physics textbooks would represent it as :math:`|001\rangle`.
es_un: Por ejemplo, si el qubit :math:`Q_{0}` está en el estado 0, el qubit :math:`Q_{1}` está en el estado 0 y el qubit :math:`Q_{2}` está en el estado 1, Qiskit representaría este estado como :math:`|100\rangle`, mientras que muchos libros de texto de física lo representarían como :math:`|001\rangle`.
fr: Par exemple, si le qubit :math:`Q_{0}` est en état 0, qubit :math:`Q_{1}` est en état 0, et qubit :math:`Q_{2}` est en état 1, Qiskit représenterait cet état comme :math:`|100\rangle`, alors que beaucoup de manuels de physique le représenteraient comme :math:`|001\rangle`.
ja: 例えば、量子ビット :math:`Q_{0}` が状態0、量子ビット :math:`Q_{1}` が状態0、量子ビット :math:`Q_{2}` が状態1のとき、Qiskit はこの状態を :math:`|100\rangle` と表現します。一方、多くの物理の教科書では、この状態を :math:`|001\rangle` と表現します。
te: ఉదాహరణకు, qubit :math:`Q_{0}` స్థితి 0లో ఉంటే, qubit :math:`Q_{1}` స్థితి 0లో మరియు qubit :math:`Q_{2}` స్థితి 1లో ఉంటే, Qiskit ఈ స్థితిని :math:`|100\rangle`గా సూచిస్తుంది, అయితే అనేక భౌతిక శాస్త్ర పాఠ్యపుస్తకాలు దీనిని :math:`|001\rangle`గా సూచిస్తాయి.

source: This difference in labeling affects the way multi-qubit operations are represented as matrices. For example, Qiskit represents a controlled-X (:math:`C_{X}`) operation with qubit :math:`Q_{0}` being the control and qubit :math:`Q_{1}` being the target as
es_un: Esta diferencia en el etiquetado afecta la forma en que las operaciones multi-qubit se representan como matrices. Por ejemplo, Qiskit representa una operación X controlada (:math:`C_{X}`) con el qubit :math:`Q_{0}` siendo el control y el qubit :math:`Q_{1}` siendo el objectivo, como
fr: Cette différence dans l'étiquetage affecte la façon dont les opérations multi-qubit sont représentées comme des matrices. Par exemple, Qiskit représente une opération contrôlée-X (:math:`C_{X}`) avec le qubit :math:`Q_{0}` étant le contrôle et le qubit :math:`Q_{1}` étant la cible comme
ja: このラベリングの違いは、複数量子ビットの演算が行列として表現されるときの方法に影響します。例えば、Qiskit は制御 X (:math:`C_{X}`) 演算において量子ビット :math:`Q_{0}` を制御ビット、量子ビット :math:`Q_{1}` をターゲットビットとするとき、以下のように表現します。
te: లేబులింగ్‌లోని ఈ వ్యత్యాసం బహుళ-క్విట్ ఆపరేషన్‌లను మాత్రికల వలె సూచించే విధానాన్ని ప్రభావితం చేస్తుంది. ఉదాహరణకు, Qiskit నియంత్రిత-Xని సూచిస్తుంది (:math:`C_{X}`) క్విట్‌తో ఆపరేషన్ :math:`Q_{0}` నియంత్రణ మరియు క్విట్ :math:`Q_{1}` వంటి లక్ష్యంగా ఉండటం

source: Now that we have chosen the backend, it's time to compile and run the quantum circuit. In Qiskit we provide the ``run`` method for this. ``run`` returns a ``job`` object that encapsulates information about the job submitted to the backend.
es_un: Ahora que hemos elegido el backend, es momento de compilar y ejecutar el circuito cuántico. En Qiskit proporcionamos el método ``run`` para esto. ``run`` devuelve un objeto ``job`` que encapsula la información sobre el trabajo enviado al backend.
fr: Maintenant que nous avons choisi le backend, il est temps de compiler et d'exécuter le circuit quantique. Dans Qiskit nous fournissons la méthode ``run`` pour cela. ``run`` retourne un objet ``job`` qui encapsule les informations sur la tâche soumise à l'arrière-plan.
ja: バックエンドを選択したので、量子回路をコンパイルして実行します。Qiskit には、そのために ``run`` メソッドがあります。``run`` は、バックエンドに送信されたジョブの情報をカプセル化するオブジェクトである ``job`` を返します。
te: ఇప్పుడు మేము బ్యాకెండ్‌ని ఎంచుకున్నాము, ఇది క్వాంటం సర్క్యూట్‌ను కంపైల్ చేయడానికి మరియు అమలు చేయడానికి సమయం ఆసన్నమైంది. Qiskitలో మేము దీని కోసం ``run`` పద్ధతిని అందిస్తాము. ``run`` బ్యాకెండ్‌కు సమర్పించిన జాబ్ గురించి సమాచారాన్ని సంగ్రహించే ``job`` ఆబ్జెక్ట్‌ని అందిస్తుంది.

source: and let :math:`xyz` denote the bitstring that results. Recall that, under the qubit labeling used by Qiskit, :math:`x` would correspond to the outcome on qubit :math:`q_{2}`, :math:`y` to the outcome on qubit :math:`q_{1}`, and :math:`z` to the outcome on qubit :math:`q_{0}`.
es_un: y dejemos que :math:`xyz` denote la cadena de bits que resulta. Recuerda que, bajo el etiquetado de qubits utilizado por Qiskit, :math:`x` correspondería al resultado en el qubit :math:`q_{2}`, :math:`y` al resultado en el qubit :math:`q_{1}` y :math:`z` al resultado en el qubit :math:`q_{0}`.
fr: et notons :math:`xyz` la chaîne de bits résultante. Rappelons que, dans la convention de nommage des qubits utilisée par Qiskit, :math:`x` correspond à l'état résultant du qubit :math:`q_{2}`, :math:`y` à l'état résultant du qubit :math:`q_{1}`, et :math:`z` à l'état résultant du qubit :math:`q_{0}`.
ja: :math:`xyz` が結果のビット列を示すとしましょう。 Qiskitで使用される量子ビットのラベリング方法では、:math:`x` は量子ビット :math:`q_{2} の結果に対応し、:math:`y` は量子ビット :math:`q_{1} の結果に対応し、そして、 :math:`z` は量子ビット :math:`q_{0} の結果に対応します。
te: మరియు :math:`xyz` ఫలితాన్నిచ్చే బిట్‌స్ట్రింగ్‌ని సూచిస్తాయి. Qiskit ఉపయోగించిన క్విట్ లేబులింగ్ క్రింద, :math:`x` qubit :math:`q_{2}`, :math:`y` qubitపై ఫలితానికి అనుగుణంగా ఉంటుంది :math:`q_ qubit :math:`q_{0}`పై ఫలితానికి {1}`, మరియు :math:`z`.

source: To simulate this circuit, we use the ``qasm_simulator`` in Qiskit Aer. Each run of this circuit will yield either the bitstring 000 or 111. To build up statistics about the distribution of the bitstrings (to, e.g., estimate :math:`\mathrm{Pr}(000)`), we need to repeat the circuit many times. The number of times the circuit is repeated can be specified in the ``run`` method, via the ``shots`` keyword.
es_un: Para simular este circuito, usamos el ``qasm_simulator`` de Qiskit Aer. Cada ejecución de este circuito producirá la cadena de bits 000 o 111. Para generar estadísticas sobre la distribución de las cadenas de bits (para, por ejemplo, estimar :math:`\mathrm{Pr}(000)`), necesitamos repetir el circuito muchas veces. El número de veces que se repite el circuito se puede especificar en el método ``run``, mediante la palabra clave ``shots``.
fr: Pour simuler ce circuit, nous utilisons ``qasm_simulator`` de Qiskit Aer. Chaque exécution ("tir" ou "shot" en anglais) de ce circuit aboutira soit à une séquence 000, soit à 111. Afin d'obtenir une statistique de la distribution des résultats (par exemple, afin d'estimer :math:`\mathrm{Pr}(000)`), nous devons répéter cette expérience plusieurs fois. Le nombre d'expériences, qui est aussi le nombre de fois où le circuit sera exécuté peut être spécifié dans la fonction ``run`` par le mot-clé ``shots``.
ja: この回路をシミュレートするためには、Qiskit Aerの ``qasm_simulator`` を使います。この回路を実行するたびに000または111が生成されます。ビット列の分布についての統計を取るために (例えば、:math:`\mathrm{Pr}(000)` を見積もるために) 、何回も回路を繰り返す必要があります。回路の繰り返し回数は ``run`` メソッドの ``shots`` キーワードで指定できます。
te: ఈ సర్క్యూట్‌ను అనుకరించడానికి, మేము Qiskit Aerలో ``qasm_simulator``ని ఉపయోగిస్తాము. ఈ సర్క్యూట్ యొక్క ప్రతి పరుగు బిట్‌స్ట్రింగ్ 000 లేదా 111ని ఇస్తుంది. బిట్‌స్ట్రింగ్‌ల పంపిణీ గురించి గణాంకాలను రూపొందించడానికి (ఉదా., అంచనా :math:`\mathrm{Pr}(000)`), మేము దీన్ని పునరావృతం చేయాలి చాలా సార్లు సర్క్యూట్. సర్క్యూట్ ఎన్నిసార్లు పునరావృతం చేయబడుతుందో ``run`` పద్ధతిలో, ``shots`` కీవర్డ్ ద్వారా పేర్కొనవచ్చు.

source: The estimated outcome probabilities :math:`\mathrm{Pr}(000)` and :math:`\mathrm{Pr}(111)` are computed by taking the aggregate counts and dividing by the number of shots (times the circuit was repeated). Try changing the ``shots`` keyword in the ``run`` method and see how the estimated probabilities change.
es_un: Las probabilidades de resultado estimadas :math:`\mathrm{Pr}(000)` y :math:`\mathrm{Pr}(111)` se calculan tomando los conteos agregados y dividiendo entre el número de iteraciones (cantidad de veces que el circuito fue repetido). Intenta cambiar el valor de ``shots`` en el método ``run`` y observa cómo cambian las probabilidades estimadas.
fr: Les probabilités estimées des résultats :math:`\mathrm{Pr}(000)` et :math:`\mathrm{Pr}(111) sont calculées en prenant les agrégats précédents et en les divisant par le nombres de "tirs" (le nombre de répétitions de l'exécution du circuit). Essayez par exemple de modifier la valeur du mot-clé ``shots`` dans la fonction ``run`` afin de voir la manière dont la probabilité estimée est affectée.
ja: 推定された結果の確率 :math:`\mathrm{Pr}(000)` と :math:`\mathrm{Pr}(111)` は、カウントを集計し、ショット数 (回路が繰り返された回数) で割ることによって計算されます。 ``run`` メソッドの ``shots`` キーワードを変更してみて、推定される確率がどのように変化するかを確認してください。
te: అంచనా వేసిన ఫలితం సంభావ్యత :math:`\mathrm{Pr}(000)` మరియు :math:`\mathrm{Pr}(111)` మొత్తం గణనలను తీసుకొని మరియు షాట్‌ల సంఖ్యతో విభజించడం ద్వారా గణించబడతాయి (సర్క్యూట్ పునరావృతమయ్యే సమయాలు). ``shots`` పద్ధతిలో కీవర్డ్‌ని మార్చడానికి ప్రయత్నించండి `` run`` మరియు అంచనా వేయబడిన సంభావ్యత ఎలా మారుతుందో చూడండి.

source: Below, we use the visualization function to plot the real and imaginary components of the state density matrix $ :nbsphinx-math:`\rho`$.
pt_br: Abaixo, usamos a função de visualização para traçar os componentes reais e imaginários da matriz de densidade do estado $ :nbsphinx-math:`\rho`$.

source: C_X = \begin{pmatrix} 1 & 0 & 0 & 0 \\ 0 & 0 & 0 & 1 \\ 0 & 0 & 1 & 0 \\ 0 & 1 & 0 & 0 \\\end{pmatrix}.
te: C_X = \begin{pmatrix} 1 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 \\\\end{pmatrix}.
