Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/1_getting_started_with_qiskit.po
Languages: bn_bn, es_un, fr, it_it, ja, ko_kr, pt_br, pt_un, ru_ru, ta_in, te, tr_tr, zh_tw

source: For example, suppose we make independent measurements on each qubit of the three-qubit GHZ state
bn_bn: উদাহরণস্বরূপ, ধরা যাক আমরা একটি তিন-qubit GHZ অবস্থা এর প্রত্যেক কিউবিটের স্বাধীন পরিমাপ করলাম
es_un: Por ejemplo, supongamos que hacemos mediciones independientes en cada qubit del estado GHZ de tres qubits
fr: Par exemple, supposons que nous fassions des mesures indépendantes sur chaque qubit de l'état GHZ à trois qubits
it_it: Ad esempio, supponiamo di effettuare misurazioni indipendenti su ciascun qubit dello stato a tre qubit GHZ
ja: 例えば、3量子ビットのGHZ状態の各量子ビットを独立に測定するとしましょう。
ko_kr: 예를 들어 삼-큐비트인 GHZ 상태의 각각의 큐비트를 독립적으로 측정한다고 가정해 보자.
pt_br: Por exemplo, suponha que façamos medições independentes em cada qubit do estado GHZ de três qubits
pt_un: Por exemplo, suponha que façamos medições independentes em cada qubit do estado GHZ de três qubits
ru_ru: Например, предположим, что мы производим независимые друг от друга измерения каждого кубита состояния GHZ из трех кубитов
ta_in: எடுத்துக்காட்டாக, மூன்று-க்யூபிட் GHZ மாநிலத்தின் ஒவ்வொரு க்யூபிட்டிலும் நாங்கள் சுயாதீன அளவீடுகளை செய்கிறோம் என்று வைத்துக்கொள்வோம்
te: ఉదాహరణకు, మూడు-క్విట్ GHZ స్థితి యొక్క ప్రతి క్విట్‌పై మనం స్వతంత్ర కొలతలు చేసామని అనుకుందాం
tr_tr: Örneğin, üç-kübit GHZ durumunun her bir kübiti üzerinde bağımsız ölçümler yaptığımızı varsayalım
zh_tw: 例如，假設我們在三量子位元 GHZ 狀態的每一個位元上進行獨立測量

source: and let :math:`xyz` denote the bitstring that results. Recall that, under the qubit labeling used by Qiskit, :math:`x` would correspond to the outcome on qubit 2, :math:`y` to the outcome on qubit 1, and :math:`z` to the outcome on qubit 0.
bn_bn: এবং ধরি :math:`xyz` ফলাফল বিটস্ট্রিংকে চিহ্নিত করে। স্মরণ করুন যে, Qiskit দ্বারা ব্যবহৃত কিউবিট লেবেলের অধীনে, :math:`x` এ কিউবিট ২ এর ফলাফল, :math:`y` এ কিউবিট ১ এর ফলাফল, এবং :math:`z` এ কিউবিট ০ এর ফলাফল নির্দেশিত হবে।
it_it: e usiamo :math:`xyz` per denotare la stringa di bit risultante. Si ricordi che, nel formalismo usato da Qiskit per i qubit, :math:`x` corrisponderebbe al risultato sul qubit 2, :math:`y` al risultato sul qubit 1, e :math:`z` al risultato sul qubit 0.
ko_kr: 그리고 :math:`xyz`을 결과의 비트 문자열이라고 하자. 키스킷에서 사용되는 큐비트 표기로는 :math:`x`가 큐비트 2의 결과에 해당하고 :math:`y` 는 큐비트 1, 그리고 :math:`z`는 큐비트 0에 해당한다는 사실을 기억하기 바란다.
pt_br: e deixe :math:`xyz` denotar o bitstring que resultou. Lembre que, sob o rótulo de qubit usado pelo Qiskit, :math:`x` corresponderia ao resultado no qubit 2, :math:`y` para o resultado no qubit 1 e :math:`z` para o resultado no qubit 0.
pt_un: e considere :math:`xyz` denotando a bitstring resultante. Lembre que, sob o rótulo de qubit usado pelo Qiskit, :math:`x` corresponderia ao resultado no qubit 2, :math:`y` para o resultado no qubit 1 e :math:`z` para o resultado no qubit 0.
ru_ru: и пусть :math:`xyz` - результирующая строка из нулей и единиц. Напомним, что в системе упорядочивания, используемой Qiskit, :math:`x` будет соответствовать результату на втором кубите, :math:`y` - результату на 1-м кубите, и :math:`z` - на нулевом.
ta_in: மற்றும் அனுமதிக்க :math:`xyz` என்பது பிட்ஸ்ட்ரிங்கைக் குறிக்கிறது. Qiskit பயன்படுத்திய க்யூபிட் லேபிளிங்கின் கீழ், :math:`x` க்யூபிட் 2 இன் முடிவுக்கு ஒத்திருக்கும், :math:`y`க்யூபிட் 1 ன் முடிவுக்கு, மற்றும் :math:`z` க்யூபிட் 0 இல் முடிவுக்கு, அதை நினைவுபடுத்துங்கள்.
tr_tr: ve :math:`xyz` sonuç bit dizisini göstersin. Qiskit tarafından kullanılan kübit etiketlemesinin altında şunu hatırlayın :math:`x` kübit 2'deki sonuca, :math:`y` kübit 1'deki sonuca, ve :math:`z` kübit 0'daki sonucuna karşılık gelir.
zh_tw: 並讓 :math:`xyz` 表示各個位元的結果字串。Qiskit 可通過各量子位元的標簽調用，:math:`x` 對應於 qubit 2 的結果、:math:`y` 對應於 qubit 1 的結果，而 :math:`z` 對應於 qubit 0 的結果。

source: Note: This representation of the bitstring puts the most significant bit (MSB) on the left, and the least significant bit (LSB) on the right. This is the standard ordering of binary bitstrings. We order the qubits in the same way (qubit representing the MSB has index 0), which is why Qiskit uses a non-standard tensor product order.
bn_bn: বি: দ্র: বিটস্ট্রিংয়ের এই উপস্থাপনাটি বামদিকে সবচেয়ে উল্লেখযোগ্য বিট(M. S. B) এবং ডানদিকে অন্তত উল্লেখযোগ্য বিট (LSB) রাখে। এটি বাইনারি বিটস্ট্রিংয়ের প্রামাণ্য ক্রম।একইভাবে কিউবিটগুলি এই ক্রমানুসারে স্থাপন করা হয় (MSB প্রতিনিধিত্বকারী কিউবিট গুলির সূচক ০ থাকে), তাই Qiskit একটি প্রামাণ্য টেনসর গুণন (প্রোডাক্ট) ক্রম ব্যবহার করে না।
es_un: Nota: Esta representación de la cadena de bits coloca el bit más significativo (most significant bit, MSB) a la izquierda y el bit menos significativo (least significant bit, LSB) a la derecha. Este es el orden estándar de cadenas de bits binarias. Ordenamos los qubits de la misma manera (el qubit que representa el MSB tiene índice 0), por lo que Qiskit utiliza un orden de producto tensorial no estándar.
fr: Note: Cette représentation de la chaîne de bits place le bit le plus significatif (MSB) à gauche, et le bit le moins significatif (LSB) à droite. Il s'agit de l'ordre standard utilisé pour représenter des chaînes de bits. Nous représentons les qubits de la même façon (le qubit représentant le MSB est associé à l'index 0), c'est pourquoi Qiskit utilise un ordre de produit tensoriel non standard.
it_it: Nota: Questa rappresentazione della stringa di bit posiziona il bit più significativo (MSB) sulla sinistra, e il bit meno significativo (LSB) sulla destra. Questo è l'ordinamento standard delle stringhe di bit binarie. Ordiniamo i qubit allo stesso modo (il qubit che rappresenta il MSB ha indice 0), motivo per cui Qiskit utilizza un ordine non standard del prodotto tensoriale.
ja: 注記：このビット文字列の表現では最上位ビット (MSB) が左側、最下位ビット (LSB) が右側に配置されます。これは、バイナリビット文字列における標準的な順序です。そのため、同じ方法で量子ビットも並べます (最上位ビットを表す量子ビットのインデックスは0です)。これが、Qiskit が非標準的なテンソル積の順序を使用する理由です。
ko_kr: 참고: 이러한 비트열 표기는 가장 중요한 비트 (MSB) 를 왼쪽에 가정 덜 중요한 비트 (LSB) 를 오른쪽에 둔다. 이는 이진 비트열을 표기하는 일반적인 순서이다. 우리는 큐비트도 이 규칙에 따라 배열한다. 따라서 MSB에 해당하는 큐비트는 0으로 인덱스 되며 이는 일반적인 텐서 곱 순서와는 다르다.
pt_br: Nota: Esta representação do bitstring coloca o bit mais significativo (sigla em inglês, MSB) à esquerda, e o bit menos significativo (sigla em inglês, LSB) à direita. Esta é a ordem padronizada para bitstrings binários. Ordena-se os qubits da mesma maneira (qubit representando o MSB tem índice "0"), razão para o Qiskit usar uma ordem diversa para o tensor.
pt_un: Obs.: Esta representação da bitstring coloca o bit mais significativo (MSB) à esquerda, e o bit menos significativo (LSB) à direita. Esta é a ordenação padrão de bitstrings binárias. Ordenamos os qubits da mesma forma (qubit representando o MSB tem índice 0), razão pela qual o Qiskit usa uma ordem de produto tensorial fora do padrão.
ru_ru: Примечание: Такое представление битовой строки делает наиболее значительный бит (MSB - most significant bit) слева, а наименее значительный бит (LSB - least significant bit) - справа. Это стандартный порядок бинарных битовых строк. Мы упорядочиваем кубиты аналогичным образом (кубит, представляющий MSB, имеет индекс 0), поэтому Qiskit использует нестандартный порядок тензорного произведения.
ta_in: குறிப்பு: பிட்ஸ்ட்ரிங்கின் இந்த பிரதிநிதித்துவம் மிகவும் குறிப்பிடத்தக்க பிட் (MSB) ஐ இடதுபுறத்திலும், குறைந்த குறிப்பிடத்தக்க பிட் (LSB) ஐ வலதுபுறத்திலும் வைக்கிறது. இது பைனரி பிட்ஸ்ட்ரிங்கின் நிலையான வரிசைப்படுத்தல் ஆகும். நாங்கள் அதே வழியில் க்யூபிட்களை ஆர்டர் செய்கிறோம் (MSB ஐ குறிக்கும் க்யூபிட் குறியீட்டு 0 ஐக் கொண்டுள்ளது), அதனால்தான் Qiskit தரமற்ற டென்சர் தயாரிப்பு வரிசையைப் பயன்படுத்துகிறது.
te: గమనిక: బిట్‌స్ట్రింగ్ యొక్క ఈ ప్రాతినిధ్యం ఎడమవైపున అత్యంత ముఖ్యమైన బిట్ (MSB) ని మరియు కుడివైపున కనీసం ముఖ్యమైన బిట్ (LSB) ని ఉంచుతుంది. ఇది బైనరీ బిట్‌స్ట్రింగ్‌ల ప్రామాణిక క్రమం. మేము క్విట్‌లను అదే విధంగా ఆర్డర్ చేస్తాము (MSBని సూచించే క్విట్‌లో ఇండెక్స్ 0 ఉంది), అందుకే Qiskit ప్రామాణికం కాని టెన్సర్ ఉత్పత్తి క్రమాన్ని ఉపయోగిస్తుంది.
tr_tr: Not: Bit dizisinin bu gösterimi en anlamlı biti (MSB) sola, en az anlamlı biti (LSB) sağa yerleştirir. Bu ikili bit dizilerinin standart sıralamasıdır. Kübitleri aynı şekilde sıralıyoruz (en anlamlı biti temsil eden kübit indeksi 0'dir), bu yüzden Qiskit standart olmayan bir tensör çarpımı sıralaması kullanıyor.
zh_tw: 附註：我們利用二進位字串的標準排序，將最重要的位元（MSB）放在左邊，而將最不重要的位元（LSB）放在右邊。我們以相同方式排列量子位元（代表 MSB 量子位元的標簽為 0）。這就是為什麼 Qiskit 使用非標準張量積排序。

source: Recall the probability of obtaining outcome :math:`xyz` is given by
bn_bn: স্মরণ করুন, :math:`xyz` ফলাফল পাওয়ার সম্ভাব্যতা দেওয়া হয়েছে
es_un: Recuerda que la probabilidad de obtener un resultado :math:`xyz` está dada por
fr: Rappelons que la probabilité d'obtenir le résultat :math:`xyz` est donnée par
it_it: Ricordiamo che la probabilità di ottenere un risultato :math:`xyz` è data da
ja: :math:`xyz` の結果が得られる確率は、以下のように与えられることを思い出してください。
ko_kr: :math:`xyz` 의 결과를 얻는 확률은 다음과 같이 주어진다
pt_br: Lembre-se que a probabilidade de obter resultado :math:`xyz` é dada por
pt_un: Lembre-se que a probabilidade de obter resultado :math:`xyz` é dada por
ru_ru: Вероятность получения одного конкретного результата :math:`xyz` равна
ta_in: முடிவைப் பெறுவதற்கான நிகழ்தகவை நினைவுகூருங்கள் :math:`xyz` வழங்கப்பட்டது
te: ఫలితం పొందే సంభావ్యతను గుర్తుకు తెచ్చుకోండి :math:`xyz` ద్వారా ఇవ్వబడింది
tr_tr: :math:`xyz` çıktısının elde edilme olasılığının şu şekilde verildiğini hatırlayın
zh_tw: 依前所述，獲得 :math:`xyz` 結果的機率可以表示為

source: and as such for the GHZ state probability of obtaining 000 or 111 are both 1/2.
bn_bn: এবং যেমন GHZ স্টেট এর ক্ষেত্রে 000 বা 111 পাওয়ার সম্ভাবনা উভয় ক্ষেত্রেই 1/2।
es_un: y como tal para el estado de GHZ, la probabilidad de obtener 000 o 111 es 1/2.
fr: ce qui assure que les probabilités d'obtenir 000 ou 111 à partir de l'état GHZ sont toutes les deux égales à 1/2.
it_it: e pertanto per lo stato GHZ le probabilità di ottenere 000 o 111 sono entrambe 1/2.
ja: そして、GHZ状態の場合、000または111が得られる確率はどちらも1/2です。
ko_kr: 그러므로 GHZ 상태에서 000 혹은 111 상태를 얻을 확률은 둘 다 1/2 이다.
pt_br: e como tal, a probabilidade de estado GHZ de obter 000 ou 111 são ambos de 1/2.
pt_un: e como tal, as probabilidades de se obter 000 ou 111 no estado GHZ são ambas de 1/2.
ru_ru: в этом случае вероятности получения 000 или 111 в состоянии GHZ равны 1/2.
ta_in: மற்றும் GHZ மாநில நிகழ்தகவுக்கான 000 அல்லது 111 இரண்டும் 1/2 ஆகும்.
te: మరియు 000 లేదా 111 పొందే GHZ స్థితి సంభావ్యత రెండూ 1/2.
tr_tr: ve böylelikle GHZ durumu için 000 veya 111 elde etme olasılığı her ikisi için de 1/2'dir.
zh_tw: 然後，由 GHZ 狀態獲得 000 或 111 結果的機率都是 1/2。

source: To simulate a circuit that includes measurement, we need to add measurements to the original circuit above, and use a different Aer backend.
bn_bn: পরিমাপ অন্তর্ভুক্ত এমন একটি সার্কিট সিমুলেট করতে আমাদের উপরের মূল সার্কিটটিতে পরিমাপ যুক্ত করতে হবে এবং একটি ভিন্ন Aer ব্যাকএন্ড ব্যবহার করতে হবে।
es_un: Para simular un circuito que incluya mediciones, necesitamos agregar las mediciones al circuito original anterior y usar un backend Aer diferente.
fr: Pour simuler un circuit qui inclut des mesures, nous avons besoin d'ajouter lesdites mesures au circuit précédent et d'utiliser un backend Aer différent.
it_it: Per simulare un circuito che includa la misura, è necessario aggiungere misurazioni al circuito originale di sopra, e utilizzare un diverso backend Aer.
ja: 測定を含む回路をシミュレートするためには、上記の回路に測定を追加し、異なる Aer バックエンドを使用する必要があります。
ko_kr: 측정이 포함된 회로를 시뮬레이션하기 위해서는, 원래의 회로에 측정 모듈을 추가해야 하며, 이를 위해 다른 아르 후위 처리 장치를 사용한다.
pt_br: Para simular um circuito que inclui medição, precisamos adicionar medições ao circuito original acima e usar um backend Aer diferente.
pt_un: Para simular um circuito que inclua medições, nós precisamos adicionar elas ao circuito original acima e usar um backend Aer diferente.
ru_ru: Для симуляции цепи, включающей измерения, необходимо добавить измерения в оригинальную схему, представленную выше, и использовать другое окружение Aer.
ta_in: அளவீட்டை உள்ளடக்கிய ஒரு சுற்று உருவகப்படுத்த, மேலே உள்ள அசல் சுற்றுக்கு நாம் அளவீடுகளைச் சேர்க்க வேண்டும், மேலும் வேறு Aer பின்தளத்தைப் பயன்படுத்த வேண்டும்.
te: కొలతను కలిగి ఉన్న సర్క్యూట్‌ను అనుకరించడానికి, పైన ఉన్న అసలు సర్క్యూట్‌కు మేము కొలతలను జోడించాలి మరియు వేరే Aer బ్యాకెండ్‌ని ఉపయోగించాలి. కొలత.
tr_tr: Ölçümü içeren bir devreyi simüle etmek için yukarıdaki orijinal devreye ölçümler eklememiz ve farklı bir Aer arka ucu kullanmamız gerekir.
zh_tw: 若要模擬包含測量的電路，我們需要將測量方法新增至上方的原始電路，並使用不同的 Aer 後臺。

source: This circuit adds a classical register, and three measurements that are used to map the outcome of qubits to the classical bits.
bn_bn: এই বর্তনী (সার্কিট) একটি ধ্রুপদী (ক্লাসিক্যাল) রেজিস্টার এবং তিনটি পরিমাপ যোগ করেছে যার দ্বারা কিউবিটের ফলগুলো ধ্রুপদী (ক্লাসিক্যাল) বিটগুলোতে গুলিতে সঞ্চয় করা হয়।
es_un: Este circuito agrega un registro clásico y tres mediciones que se utilizan para mapear el resultado de los qubits a los bits clásicos.
fr: Ce circuit ajoute un registre classique ainsi que trois mesures placées de telle sorte à faire correspondre la mesure de chaque qubit à son bit classique associé.
it_it: Questo circuito aggiunge un registro classico, e tre misurazioni che sono usate per mappare il risultato dei qubit sui bit classici.
ja: この回路は古典レジスタと３つの測定を追加して、量子ビットの結果を古典ビットにマッピングします。
ko_kr: 이 회로는 클래식 레지스터와, 큐비트의 결과를 고전 비트에 연결하기 위한 세 개의 측정들을 추가한다.
pt_br: Este circuito adiciona um registro clássico e três medições que são usadas para mapear o resultado dos qubits para os bits clássicos.
pt_un: Este circuito adiciona um registrador clássico e três medições que são usadas para mapear o resultado dos qubits nos bits clássicos.
ru_ru: Эта схема добавляет классические регистры и три измерения, которые используются для сопоставления результатов кубитов с классическими битами.
ta_in: இந்த சுற்று ஒரு கிளாசிக்கல் பதிவையும், மூன்று அளவீடுகளையும் க்யூபிட்களின் முடிவுகளை கிளாசிக்கல் பிட்களுக்கு வரைபடமாக்கப் பயன்படுகிறது.
te: ఈ సర్క్యూట్ క్లాసికల్ రిజిస్టర్‌ను జోడిస్తుంది మరియు క్విట్‌ల ఫలితాన్ని క్లాసికల్ బిట్‌లకు మ్యాప్ చేయడానికి ఉపయోగించే మూడు కొలతలు.
tr_tr: Bu devre, klasik bir saklayıcı ve kübitlerin sonuçlarını klasik bitlerle eşleştirmek için kullanılan üç ölçüm ekler.
zh_tw: 此電路新增了一個古典暫存器與三個測量操作，它們將量子位元的測量結果一一映射到古典位元上。

source: To simulate this circuit, we use the ``qasm_simulator`` in Qiskit Aer. Each run of this circuit will yield either the bitstring 000 or 111. To build up statistics about the distribution of the bitstrings (to, e.g., estimate :math:`\mathrm{Pr}(000)`), we need to repeat the circuit many times. The number of times the circuit is repeated can be specified in the ``execute`` function, via the ``shots`` keyword.
bn_bn: সার্কিট সিমুলেট করার জন্য আপনি Qiskit এয়ার এর ``qasm_simulator`` ব্যবহার করতে পারেন। প্রত্যেকবার ফলাফল হিসাবে বিটস্ট্রিং ০০০ অথবা ১১১ পাওয়া যাবে। বিটস্ট্রিংগুলির বিতরণ সম্পর্কে পরিসংখ্যান তৈরি করতে ( উদাহরণস্বরূপ :math:`\mathrm{Pr}(000)` অনুমান করতে), আপনাদের বর্তনটির পুনরাবৃত্তি করতে হবে। বর্তনীটির পুনরাবৃত্তির সংখ্যা ``execute`` ফাংশনের ``shots`` কীওয়ার্ড এর মাধ্যমে মধ্যে নির্ধারণ করা যায়।
it_it: Per simulare il circuito, usiamo il ``qasm_simulator`` in Qiskit Aer. Ogni esecuzione di questo circuito produrrà o la stringa di bit 000 o 111. Per costruire statistiche sulla distribuzione delle stringhe di bit (ad esempio, per stimare :math:`\mathrm{Pr}(000)`), occorre ripetere il circuito molte volte. Il numero di volte in cui il circuito va ripetuto può essere specificato nella funzione ``execute``, tramite la parola chiave ``shots``.
ko_kr: 이 회로를 시뮬레이션하기 위해서는 키스킷 아르에 있는 ``qasm_simulator``를 사용해야 한다. 이 회로 각각의 실행은 비트 문자열 000 혹은 111을 생성하며. 또한 비트 문자열 (예를 들어 :math:`\mathrm{Pr}(000)`)의 분포에 대한 통계를 얻기 위해서는 회로를 여러 번 실행해야 한다. 회로가 반복되는 횟수를 결정하기 위해서는 ``execute`` 함수에 있는 ``shots`` 키워드를 조정하면 된다.
pt_br: Para simular este circuito, nós usamos o ``qasm_simulator`` no Qiskit Aer. Cada execução deste circuito irá gerar a bitstring 000 ou 111. Para construir estatísticas sobre a distribuição dos bitstrings (por exemplo, para estimar :math:`\mathrm{Pr}(000)`), precisamos repetir o circuito várias vezes. O número de vezes que o circuito será repetido pode ser especificado na função ``execute``, através da palavra-chave ``shots``.
pt_un: Para simular este circuito, usamos o ``qasm_simulator`` do Qiskit Aer. Cada execução desse circuito resultará na bitstring 000 ou 111. Para construir estatísticas sobre a distribuição das bitstrings (para, por exemplo, estimar :math:`\mathrm{Pr}(000)`), precisamos repetir o circuito várias vezes. O número de repetições pode ser especificado na função ``execute`` através da palavra-chave ``shots``.
ru_ru: Чтобы симулировать эту цепь, мы используем ``qasm_simulator`` из Qiskit Aer. Каждый запуск даст либо строку 000, либо 111. Чтобы собрать статистику о распределении битовых строк (т.e. оценить :math:`\mathrm{Pr}(000)`), нам нужно повторить запуск схемы множество раз. Количество повторений запусков может быть указано в функции ``execute``, при помощи именованного параметра ``shots``.
ta_in: இந்த சுற்று உருவகப்படுத்த, நாங்கள் Qiskit Aer இல் ``qasm_simulator`` ஐப் பயன்படுத்துகிறோம். இந்த சுற்றின் ஒவ்வொரு ஓட்டமும் பிட்ஸ்ட்ரிங் 000 அல்லது 111 ஐ கொடுக்கும். பிட்ஸ்ட்ரிங்கின் விநியோகம் பற்றிய புள்ளிவிவரங்களை உருவாக்க (எ.கா., மதிப்பீடு :math:`\mathrm{Pr}(000)`), நாம் பல முறை சுற்று திரும்ப வேண்டும். ``shots`` முக்கிய சொல் மூலம், ``execute`` செயல்பாட்டில் சர்க்யூட் எத்தனை முறை திரும்பத் திரும்ப குறிப்பிடப்படுகிறது.
tr_tr: Bu devreyi simüle etmek için Qiskit Aer'deki ``qasm_simulator``ü kullanıyoruz. Bu devrenin her çalışması 000 veya 111 bit dizisini verir. Bit dizelerinin dağılımı hakkında istatistik oluşturmak için (örneğin, :math:`\mathrm{Pr}(000)`ı tahmin etmek için), devreyi birçok kez tekrar etmemiz gerekir. Devrenin tekrarlanma sayısı, ``shots`` anahtar kelimesi ile ``execute`` işlevinde belirlenebilir.
zh_tw: 如果要模擬此電路，我們使用 Qiskit Aer 中的 ``qasm_simulator``。每一個執行此電路都會輸出位元字串 000 或 111。如果統計輸出位元字串的分佈（例如，估計得到 :math:`\mathrm{Pr}(000)` 的機率），我們需要多次重複此電路。在 ``execute`` 函數中，透過關鍵字 ``shots``，可以指定電路重複的次數。

source: Once you have a result object, you can access the counts via the function ``get_counts(circuit)``. This gives you the *aggregated* binary outcomes of the circuit you submitted.
bn_bn: কোনও ফলাফলের অবজেক্ট তৈরী হয়ে গেলে আপনি `` get_counts (circuit) `` ফাংশনটির মাধ্যমে পরিসংখ্যান গুলি পর্যবেক্ষণ করতে পারেন। এটি আপনাকে উপস্থাপিত সার্কিটের *aggregated* বাইনারি ফলাফল দেয়।
es_un: Una vez que tengas un objeto de resultado, puedes acceder a los recuentos a través de la función ``get_counts(circuit)``. Esto te brinda los resultados binarios *agregados* del circuito que enviaste.
fr: Une fois que vous avez un objet résultat, vous pouvez obtenir le décompte des dits résultats (counts) par la fonction ``get_counts(circuit)``. Cela vous donne le résultat sous forme *d'agrégats* de chaînes binaires du circuit testé.
it_it: Una volta che si è ottenuto l'oggetto risultante, è possibile accedere ai conteggi tramite la funzione ``get_counts(circuit)``. Tale funzione restituisce gli esiti binari *aggregati* del circuito che è stato inviato.
ja: result オブジェクトを取得できたら、``get_counts(circuit)`` 関数を使用して回数を取得することができます。これにより、送信した回路の *集計* されたバイナリ結果が得られます。
ko_kr: 결과 객체를 얻은 후에는 ``get_counts(circuit)`` 함수를 통해서 시뮬레이션 횟수에 접근할 수 있다. 이를 통해서 지금까지 실행한 시뮬레이션의 *합산된* 결과값을 구할 수 있다.
pt_br: Uma vez que você possua um objeto de resultado, você pode acessar as contagens através da função ``get_counts(circuit)``. Isso gera os resultados binários *agregados* do circuito que você submeteu.
pt_un: Uma vez que você possua um objeto de resultado, você pode acessar as contagens através da função ``get_counts(circuit)``. Isso lhe fornece os resultados binários *agregados* do circuito que você submeteu.
ru_ru: После получения результата, метод ``get_counts(circuit)`` может дать доступ к данным счетчика. Он формирует *совокупные* бинарные результаты запускаемой цепи.
ta_in: நீங்கள் ஒரு முடிவு பொருளை பெற்றவுடன், ``get_counts(circuit)`` செயல்பாட்டின் மூலம் எண்ணிக்கையை அணுகலாம். இது நீங்கள் சமர்ப்பித்த சுற்றின் *திரட்டப்பட்ட* பைனரி விளைவுகளை வழங்குகிறது.
te: మీరు ఫలిత వస్తువును కలిగి ఉన్న తర్వాత, మీరు ``get_counts(circuit)`` ఫంక్షన్ ద్వారా గణనలను యాక్సెస్ చేయవచ్చు. ఇది మీరు సమర్పించిన సర్క్యూట్ యొక్క *సమగ్ర* బైనరీ ఫలితాలను అందిస్తుంది.
tr_tr: Bir sonuç nesnesine sahip olduğunuzda, sayılara ``get_counts(circuit)`` işlevi üzerinden erişebilirsiniz. Bu, gönderdiğiniz devrenin *toplanmış* ikili sonuçlarını verir.
zh_tw: 當您得到結果後，您可以透過函數 ``get_counts(circuit)`` 來獲得計數。 這會 *集中* 給您所提交電路的二進位結果。

source: Approximately 50 percent of the time, the output bitstring is 000. Qiskit also provides a function ``plot_histogram``, which allows you to view the outcomes.
bn_bn: প্রায় 50 শতাংশ সময়, আউটপুট বিটস্ট্রিংটি 000 হয়। Qiskit ``plot_histogram`` নামে একটি ফাংশনও সরবরাহ করে, যা আপনাকে ফলাফলগুলি দেখতে দেয়।
es_un: Aproximadamente el 50 por ciento de las veces, la cadena de bits de salida es 000. Qiskit también proporciona una función ``plot_histogram``, que te permite ver los resultados.
fr: Environ 50% du temps, le résultat sera 000. Qiskit fournit également une fonction ``plot_histogram`` qui vous permet de visualiser les résultats.
it_it: Circa il 50 per cento delle volte, la stringa di bit di output è 000. Qiskit fornisce anche una funzione ``plot_histogram``, che consente di visualizzare i risultati.
ja: 約50％の出力ビット文字列は000です。Qiskit は、結果を表示できる関数 ``plot_histogram`` も提供します。
ko_kr: 대략 50 퍼센트 정도는 000값의 결과 비트 문자열을 가진다. 또한 키스킷의 ``plot_histogram``함수를 통해 결과를 확인할 수 있다.
pt_br: Aproximadamente 50% do tempo, a bitstring de saída é 000. O Qiskit também fornece uma função ``plot_histogram``, que permite você ver os resultados.
pt_un: Aproximadamente 50% das vezes, a string de bits da saída é 000. Qiskit também provê a função ``plot_histogram``, que permite que você veja os resultados.
ru_ru: Приблизительно в 50% случаев, результирующая бинарная строка - 000. Qiskit также предоставляет функцию ``plot_histogram``, которая позволяет просматривать результаты в виде гистограммы.
ta_in: ஏறக்குறைய 50 சதவிகிதம், வெளியீடு பிட்ஸ்ட்ரிங் 000 ஆகும். Qiskit ஒரு செயல்பாட்டை வழங்குகிறது ``plot_histogram``, இது விளைவுகளைப் பார்க்க உங்களை அனுமதிக்கிறது.
te: దాదాపు 50 శాతం సమయం, అవుట్‌పుట్ బిట్‌స్ట్రింగ్ 000. Qiskit కూడా ``plot_histogram`` ఫంక్షన్‌ను అందిస్తుంది, ఇది ఫలితాలను వీక్షించడానికి మిమ్మల్ని అనుమతిస్తుంది.
tr_tr: Zamanın yaklaşık yüzde 50'sinde, çıktı bit dizisi 000'dir. Qiskit ayrıca sonuçları görmenizi sağlayan bir ``plot_histogram`` işlevi de sağlar.
zh_tw: 從下圖中可以看出，輸出位元串為 000 的機率約 50% 。Qiskit 還提供了 ``plot_histogram`` 函數，可讓您檢視結果。
