Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/1_getting_started_with_qiskit.po
Languages: bn_bn, es_un, fr, it_it, ja, ko_kr, pt_br, pt_un, ru_ru, ta_in, te, tr_tr, zh_tw

source: Now that we have chosen the backend, it’s time to compile and run the quantum circuit. In Qiskit we provide the ``execute`` function for this. ``execute`` returns a ``job`` object that encapsulates information about the job submitted to the backend.
bn_bn: এখন আমরা ব্যাকএন্ড নির্বাচন করে নিয়েছি, এখন সেই কোয়ান্টাম সার্কিটটি (বর্তনীটি) সংকলন (কম্পাইল) এবং চালানোর সময়। Qiskit এ আমরা এর জন্য ``execute`` ফাংশন সরবাহ করি। ``execute`` একটি ``job`` অবজেক্ট কে প্রত্যাবর্তন করে যা ব্যাকএন্ড-এ জমা দেওয়া job-এর সম্পর্কে তথ্য লুকিয়ে রাখে।
it_it: Ora che è stato scelto il backend, è il momento di compilare ed eseguire il circuito quantistico. In Qiskit è fornita la funzione ``execute`` per questo. ``execute`` restituisce un oggetto ``job`` che racchiude le informazioni sul job inviato al backend.
pt_un: Agora que já escolhemos o backend, é hora de compilar e executar o circuito quântico. No Qiskit, é provida a função ``execute`` para isso. Ela retorna um objeto ``job`` que encapsula a informação quanto à tarefa sendo enviada ao backend.
ru_ru: Теперь, когда мы выбрали окружение, пришло время скомпилировать и запустить квантовую цепь. Qiskit предоставляет для этого функцию ``execute``. ``execute`` возвращает объект ``job``, который включает в себя информацию о задаче, отправленной на выполнение в окружение.
ta_in: இப்போது நாங்கள் பின்தளத்தை தேர்ந்தெடுத்துள்ளோம், குவாண்டம் சுற்றுகளை தொகுத்து இயக்க வேண்டிய நேரம் இது. Qiskit இல் நாங்கள் இதற்கு ``execute`` செயல்பாட்டை வழங்குகிறோம். பின்தளத்தில் சமர்ப்பிக்கப்பட்ட வேலை பற்றிய தகவலை உள்ளடக்கிய ``job`` பொருளை ``execute`` வழங்குகிறது.
tr_tr: Şimdi backendi seçtiğimize göre kuantum devresini derleme ve çalıştırma zamanı. Qiskit'te bunun için ``execute`` fonksiyonunu sağlıyoruz. ``execute``, backende gönderilen işler hakkında bilgi kapsülleyen (encapsulate) bir ``job(iş)`` objesi döndürür.
zh_tw: 現在我們已經選好後臺了，是時候編譯和執行量子電路。 在 Qiskit 中，我們為此工作提供一種函數叫 ``execute`` ， ``execute`` 會返回一個物件 `job`，此物件封存了有關要傳給後端的作業訊息。

source: Tip: You can obtain the above parameters in Jupyter. Simply place the text cursor on a function and press Shift+Tab.
bn_bn: টিপ: আপনি জুপিটারে উপরের প্যারামিটার-গুলি (স্থিতিমাপগুলি) পেতে পারেন। কেবল ওই টেক্সট কার্সারটি একটি ফাংশনের উপরে রেখে শিফট + ট্যাব টিপুন।
es_un: Tip: Puedes obtener los parámetros anteriores en Jupyter. Simplemente coloca el cursor de texto en una función y presiona Mayús+Tab.
fr: Astuce: Il est possible d'obtenir les paramètres ci-dessus dans Jupyter. Placez simplement le curseur sur une fonction et pressez Shift+Tab.
it_it: Suggerimento: È possibile ottenere i parametri di cui sopra in Jupyter. Basta posizionare il cursore di testo su una funzione e premere Shift+Tab.
ja: ヒント：上記のパラメータは Jupyter で取得できます。関数にテキストカーソルを置いて、Shift+Tab を押すだけです。
ko_kr: 팁: 주피터에서는 위의 매개 변수들을 손쉽게 얻을 수 있다. 단순히 문자 커서를 함수 위에 놓고 Shift+Tab을 누르면 된다.
pt_br: Dica: Você pode obter os parâmetros acima no Jupyter. Basta colocar o cursor de texto em uma função e pressionar Shift+Tab.
pt_un: Dica: Você pode obter os parâmetros acima no Jupyter. Simplesmente coloque o cursor sobre uma função e aperte Shift+Tab.
ru_ru: Совет: Вы можете получить информацию о перечисленных выше параметрах в Jupyter. Поместите курсор на функцию и нажмите Shift+Tab.
ta_in: உதவிக்குறிப்பு: Jupyter இல் மேலே உள்ள அளவுருக்களை நீங்கள் பெறலாம். ஒரு செயல்பாட்டில் உரை கர்சரை வைத்து Shift+Tab ஐ அழுத்தவும்.
te: చిట్కా: మీరు పై పారామితులను జూపిటర్‌లో పొందవచ్చు. టెక్స్ట్ కర్సర్‌ను ఫంక్షన్‌పై ఉంచండి మరియు Shift+Tab నొక్కండి.
tr_tr: İpucu: Yukarıdaki parametreleri Jupyter'de elde edebilirsiniz. Metin imlecini bir işlevin üzerine getirin ve Shift+Tab tuşlarına basın.
zh_tw: 提示：你可以在 Jypyter 裡獲得上述的參數，只要簡單地將文本放在函數上，或是按鍵盤上的 Shift+Tab。

source: When you run a program, a job object is made that has the following two useful methods: ``job.status()`` and ``job.result()``, which return the status of the job and a result object, respectively.
bn_bn: যখন আপনি একটি নির্দেশমালা (প্রোগ্রাম) চালাবেন, একটি কাজ (জব) অবজেক্ট তৈরি করা হয় যেটাতে নিম্নলিখিত দুটি দরকারি ফাংশন আছে: ``job.status()`` এবং ``job.result()``, যেটা যথাক্রমে কাজ (জব) এর স্থিতি এবং ফলাফলের অবজেক্ট-টি প্রত্যাবর্তন করে।
es_un: Cuando ejecutas un programa, se crea un objeto de trabajo que tiene los siguientes dos métodos útiles: ``job.status()`` y ``job.result()``, que devuelven el estado del trabajo y un objeto con el resultado, respectivamente.
fr: Lorsque vous exécutez un programme, un objet job est créé. Cet objet possède deux méthodes pouvant se révéler utiles : ``job.status()`` et ``job.result()``, qui retourneront respectivement l'état du job et un objet résultat.
it_it: Quando si esegue un programma, viene costruito un oggetto job che ha i seguenti due utili metodi: ``job.status()`` e ``job.result()``, che restituiscono lo stato del job e l'oggetto risultante, rispettivamente.
ja: プログラムを実行すると、二つの便利なメソッドをもったジョブ・オブジェクトが作られます： ``job.status()`` と ``job.result()`` です。これらは、ジョブのステータスと結果オブジェクトをそれぞれ返します。
ko_kr: 프로그램을 실행할 때, 작업 객체는 다음의 두 메소드 ``job.status()`` 와 ``job.result()``를 가지는데, 각각은 작업의 대한 상태와 그 결과를 돌려준다.
pt_br: Quando você executa um programa, um objeto é criado com os dois métodos úteis a seguir: ``job.status()`` e ``job.result()``, que retornam, respectivamente, o status e o objeto resultante do job.
pt_un: Ao rodar um programa, um objeto job é criado que tem 2 métodos úteis: ``job.status()`` e ``job.result()``, que retornam o estados da tarefa e um objeto result, respectivamente.
ru_ru: При запуске программы создается объект задачи (job) с двумя полезными методами: ``job.status()`` и ``job.result()``, которые возвращают текущий статус выполнения задачи и объект с результатом ее выполнения соответственно.
ta_in: நீங்கள் ஒரு திட்டத்தை இயக்கும்போது, ​​பின்வரும் இரண்டு பயனுள்ள முறைகளைக் கொண்ட ஒரு வேலை பொருள் தயாரிக்கப்படுகிறது: ``job.status()`` மற்றும் ``job.result()``, இது வேலையின் நிலை மற்றும் முடிவு பொருளைத் தரும், முறையே.
te: మీరు ప్రోగ్రామ్‌ను అమలు చేసినప్పుడు, జాబ్ ఆబ్జెక్ట్ ఈ క్రింది రెండు ఉపయోగకరమైన పద్ధతులను కలిగి ఉంటుంది: ``job.status()`` మరియు ``job.result()``, ఇది ఉద్యోగం యొక్క స్థితిని మరియు ఫలిత వస్తువును అందిస్తుంది, వరుసగా.
tr_tr: Bir programı çalıştırdığınızda, sırasıyla işin durumunu ve bir sonuç nesnesini döndüren ``job.status()`` ve ``job.result()`` iki yararlı metoda sahip bir iş nesnesi oluşturulur.
zh_tw: 當你執行程式時，生成的 job 物件具有以下兩個有用的方法：“job.status()” 和 “job.result()”，它們分別傳回 job 的狀態和結果物件。

source: Note: Jobs run asynchronously, but when the result method is called, it switches to synchronous and waits for it to finish before moving on to another task.
bn_bn: দ্রষ্টব্য: কাজ (জব) গুলি অসমনিয়ত ভাবে চালিত হয়, কিন্তু যখন ফলাফল পদ্ধতি কে ডাকা হয়, তখন এটি সমকালীনে পরিবর্তন হয় এবং অন্য কোনো কার্যে যাওয়ার আগে এটি শেষ হওয়ার জন্য অপেক্ষা করে।
es_un: Nota: Los trabajos se ejecutan de forma asincrónica, pero cuando se llama al método de resultado, cambia a forma síncrona y se espera a que finalice antes de pasar a otra tarea.
fr: Note : Les tâches s'exécutent de façon asynchrone, mais quand la méthode result est appelée, on bascule en mode synchrone et on attend que la tâche en cours soit finie avant de passer à la suivante.
it_it: Nota: I job sono eseguiti in modo asincrono, ma quando il metodo del risultato viene chiamato, passa a modalità sincrona e attende che il metodo finisca prima di passare ad un'altra attività.
ja: 注記：ジョブは非同期に実行されますが、result メソッドが呼び出されると同期に切り替わり、終了するのを待ってから別のタスクに進みます。
ko_kr: 참고: 작업은 비동기화 방식으로 실행되지만, 결과 메소드가 호출되면, 동기화 방식으로 전환되어서 다른 작업으로 옮겨가기 전에 작업이 끝날 때까지 기다리게 된다.
pt_br: Nota: As tarefas são executadas assincronamente, mas quando o método de resultado é chamado, alterna para a execução síncrona e aguarda o término antes de passar para outra tarefa.
pt_un: Obs.: Tarefas rodam assincronamente, mas quando o método result é chamado, isso muda para um modo síncrono e espera que termine antes de prosseguir para outra task.
ru_ru: Примечание: Задачи выполняются асинхронно, но в момент вызова метода получения результата, выполнение переходит в синхронный режим и ожидает его завершения, прежде чем перейти к выполнению следующих инструкций.
ta_in: குறிப்பு: வேலைகள் ஒத்திசைவற்ற முறையில் இயங்குகின்றன, ஆனால் முடிவு முறை அழைக்கப்படும் போது, ​​அது ஒத்திசைவுக்கு மாறி, மற்றொரு பணிக்குச் செல்வதற்கு முன் அது முடிவடையும் வரை காத்திருக்கிறது.
te: గమనిక: జాబ్స్ అసమకాలికంగా నడుస్తాయి, కానీ ఫలిత పద్ధతిని పిలిచినప్పుడు, అది సింక్రోనస్‌కి మారుతుంది మరియు మరొక పనికి వెళ్లే ముందు అది పూర్తయ్యే వరకు వేచి ఉంటుంది.
tr_tr: Not: İşler eşzamansız olarak çalışır, ancak sonuç metodu çağrıldığında eşzamanlı duruma geçer ve başka bir göreve geçmeden önce işlemin tamamlanmasını bekler.
zh_tw: 備註：job 的運行不是同步的，但當呼叫 result 方法時，它會切換到同步並等待它完成，才會繼續執行下一個作業。

source: The results object contains the data and Qiskit provides the method ``result.get_statevector(circ)`` to return the state vector for the quantum circuit.
bn_bn: ফলাফলের অবজেক্ট-টিতে তথ্য থাকে এবং কোয়ান্টাম সার্কিট-এর (বর্তনীর) স্টেট ভেক্টরটি (অবস্থা দিকরাশিটি) প্রত্যাবর্তন করার জন্য Qiskit ``result.get_statevector(circ)`` পদ্ধতিটি সরবরাহ করে।
es_un: El objeto de resultados contiene los datos y Qiskit proporciona el método ``result.get_statevector(circ)`` para devolver el vector de estado del circuito cuántico.
fr: L'objet result contient les données voulues et Qiskit fournit la méthode ``result.get_statevector(circ)`` pour retourner le vecteur d'état du circuit quantique.
it_it: L'oggetto risultante contiene i dati e Qiskit fornisce il metodo ``result.get_statevector(circ)`` per restituire il vettore di stato del circuito quantistico.
ja: Result オブジェクトにはデータが含まれており、Qiskit は量子回路の状態ベクトルを返す ``result.get_statevector(circ)`` メソッドを提供しています。
ko_kr: 결과 객체는 데이터를 가지고 있으며, 키스킷은 양자 회로에 대한 상태 벡터를 돌려주는 ``result.get_statevector(circ)`` 메소드를 제공한다.
pt_br: Os objetos resultantes contém os dados e o Qiskit provê o método ``result.get_statevector(circ)`` para retornar o estado do vetor para o circuito quântico.
pt_un: O objeto results contém os dados e o Qiskit provê o método ``result.get_statevector(circ)`` para retornar o vetor de estados para o circuito quântico.
ru_ru: Для получения векторного состояния квантовой цепи из объекта с результатом выполнения задачи, Qiskit предоставляет метод ``result.get_statevector(circ)``.
ta_in: குவாண்டம் சர்க்யூட்டுக்கான நிலை திசையனைத் திருப்பித் தருவதற்கு, முடிவுப் பொருள் தரவு மற்றும் Qiskit ``result.get_statevector(circ)`` முறையை வழங்குகிறது.
te: ఫలితాల ఆబ్జెక్ట్ డేటాను కలిగి ఉంది మరియు Qiskit క్వాంటం సర్క్యూట్ కోసం స్టేట్ వెక్టర్‌ను తిరిగి ఇవ్వడానికి ``result.get_statevector(circ)`` పద్ధతిని అందిస్తుంది.
tr_tr: Sonuç nesnesi verileri içerir ve Qiskit, kuantum devresinin durum vektörünü döndürmek için ``result.get_statevector(circ)`` metodunu sağlar.
zh_tw: 結果物件包含數據，Qiskit 提供一種方法 ``result.get_statevector(circ)`` 以傳回量子電路的狀態向量。

source: Qiskit also provides a visualization toolbox to allow you to view these results.
bn_bn: Qiskit আপনাকে এই ফলাফলগুলি পরিদর্শনের জন্য একটি দৃশ্যায়ন সরঞ্জাম -বক্স ও সরবরাহ করে।
es_un: Qiskit también proporciona un conjunto de herramientas de visualización que te permiten ver estos resultados.
fr: Qiskit fournit aussi une boite à outil de visualisation qui permet d'afficher ces résultats.
it_it: Qiskit fornisce anche un toolbox di visualizzazione per consentire la visione di questi risultati.
ja: Qiskitは、これらの結果を見るための可視化ツールボックスも提供しています。
ko_kr: 또한 키스킷은 이러한 결과들을 확인할 수 있도록 시각화 도구상자를 제공한다.
pt_br: O Qiskit também fornece uma caixa de ferramentas de visualização para permitir que você visualize esses resultados.
pt_un: O Qiskit também fornece uma toolbox de visualização a fim de permitir que você observe esses resultados.
ru_ru: Также Qiskit предоставляет пакет визуализации, позволяющий просматривать эти результаты.
ta_in: இந்த முடிவுகளைப் பார்க்க உங்களை அனுமதிக்கும் ஒரு காட்சிப்படுத்தல் கருவிப்பெட்டியையும் Qiskit வழங்குகிறது.
te: Qiskit ఈ ఫలితాలను వీక్షించడానికి మిమ్మల్ని అనుమతించడానికి విజువలైజేషన్ టూల్‌బాక్స్‌ను కూడా అందిస్తుంది.
tr_tr: Qiskit ayrıca bu sonuçları görüntülemenize izin veren bir görselleştirme araç kutusu da sunar.
zh_tw: Qiskit 亦提供了視覺化工具箱，讓您檢視狀態。

source: Below, we use the visualization function to plot the real and imaginary components of the state density matrix :math:`\rho`.
bn_bn: নিচে আমরা দৃশ্যায়ন ফাংশনটি ব্যবহার করে অবস্থা (স্টেট) ঘনত্ব (ডেন্সিটি) ম্যাট্রিক্স :math:`\rho` এর আসল এবং কাল্পনিক উপাদানগুলি কে অঙ্কন করবো।
es_un: A continuación, usamos la función de visualización para graficar los componentes reales e imaginarios de la matriz de densidad :math:`\rho` del estado.
fr: Ci-dessous, nous utilisons la fonction de visualisation pour afficher les points correspondants aux composantes réelles et imaginaires de la matrice de densité :math:`\rho`.
it_it: In basso, viene utilizzata la funzione di visualizzazione per disegnare i componenti reale ed immaginario della matrice densità di stato :math:`\rho`.
ja: 以下のように、状態の密度行列である :math:`\rho` の実数部と虚数部をプロットする可視化関数が使えます。
pt_un: Abaixo, utilizaremos a função de visualização para desenhar as componentes reais e imaginárias da matriz de densidade de estados :math:`\rho`.
ru_ru: Ниже мы используем функцию визуализации, позволяющую графически выразить реальные и мнимые компоненты матрицы :math:`\rho`.
ta_in: கீழே, நிலை அடர்த்தி மேட்ரிக்ஸின் உண்மையான மற்றும் கற்பனை கூறுகளை சதி செய்ய காட்சிப்படுத்தல் செயல்பாட்டைப் பயன்படுத்துகிறோம் :math:`\rho`.
te: దిగువన, మేము స్టేట్ డెన్సిటీ మ్యాట్రిక్స్ :math:`\rho` యొక్క వాస్తవ మరియు ఊహాత్మక భాగాలను ప్లాట్ చేయడానికి విజువలైజేషన్ ఫంక్షన్‌ని ఉపయోగిస్తాము.
tr_tr: Aşağıda, durum yoğunluk matrisinin gerçek ve hayali bileşenlerini çizmek için görselleştirme işlevini kullanıyoruz :math:`\rho`.
zh_tw: 下面我們會用視覺化函數繪製狀態密度矩陣 :math:`\rho` 的實部和虛部。

source: Unitary backend
bn_bn: ঐকিক (ইউনিটারি) ব্যাকএন্ড
es_un: Backend para la matriz unitaria
fr: Backend associé aux opérateurs unitaires
it_it: Backend Unitario
ja: ユニタリー・バックエンド
ko_kr: 단일 후위 장치
pt_br: Backend unitário
pt_un: Backend Unitário
ru_ru: Унитарное окружение
ta_in: ஒற்றை பின்தளத்தில்
te: యూనిటరీ బ్యాకెండ్
tr_tr: Üniter arka uç
zh_tw: 么正後臺

source: Qiskit Aer also includes a ``unitary_simulator`` that works *provided all the elements in the circuit are unitary operations*. This backend calculates the :math:`2^n \times 2^n` matrix representing the gates in the quantum circuit.
bn_bn: Qiskit এয়ার এর মধ্যে কর্মক্ষম ``unitary_simulator`` অন্তর্ভুক্ত, *প্রদত্ত বর্তনীর(সার্কিট ) এর সকল উপাদান কে একক ক্রিয়াকলাপ সম্পন্ন হতে হবে*। এই ব্যাকএন্ডটি :math:`2^n \times 2^n` ম্যাট্রিক্স গণনা করতে পারে যা কোয়ান্টাম বর্তনী (সার্কিট) এর গেটস রূপে উপস্থাপন করে।
es_un: Qiskit Aer también incluye un ``unitary_simulator`` que funciona *siempre que todos los elementos del circuito sean operaciones unitarias*. Este backend calcula la matriz :math:`2^n \times 2^n` que representa las compuertas en el circuito cuántico.
fr: Qiskit Aer inclut également ``unitary_simulator`` qui permet, *en supposant que tous les éléments du circuit soient des opérations unitaires*, de calculer la matrice de taille :math:`2^n \times 2^n` représentant les portes du circuit quantique.
it_it: Qiskit Aer include anche un ``unitary_simulator`` che funziona *a condizione che tutti gli elementi del circuito siano operazioni unitarie*. Questo backend calcola la matrice :math:`2^n \times 2^n` che rappresenta i gate nel circuito quantistico.
ja: Qiskit Aer には、 *回路のすべての要素をユニタリー演算* にする ``unitary_simulator`` も含まれます。このバックエンドは、量子回路のゲートを表す :math:`2^n \times 2^n` の行列を計算します。
ko_kr: 또한 키스킷 아르는 *회로의 모든 요소가 단일 연산일 때에 작동하는* ``unitary_simulator``를 포함하고 있다. 이 후위 처리 장치는 양자 회로에서 게이트를 나타내는 :math:`2^n \times 2^n` 행렬을 계산한다.
pt_br: O Qiskit Aer também inclui um ``unitary_simulator`` que funciona *desde que todos os elementos no circuito sejam operações unitárias*. Este backend calcula a matriz :math:`2^n \times 2^n` que representa os gates no circuito quântico.
pt_un: O Qiskit Aer também inclui um ``unitary_simulator`` que funciona *desde que todos os elementos no circuito sejam operações unitárias*. Esse backend calcula a matrix :math:`2^n \times 2^n` que representa as portas no circuito quântico.
ru_ru: Qiskit Aer также включает в себя ``унитарный симулятор (unitary_simulator)``, который работает *при условии, что все элементы в цепи являются унитарными операциями*. Это окружение вычисляет матрицу :math:`2^n \times 2^n` представляющую вентили в квантовой схеме.
ta_in: Qiskit Aer ஒரு ``unitary_simulator`` ஐயும் உள்ளடக்கியது *இது சுற்றில் உள்ள அனைத்து உறுப்புகளும் ஒற்றை செயல்பாடுகள்*. இந்த பின்தளத்தில் கணக்கிடப்படுகிறது :math:`2^n \times 2^n` குவாண்டம் சர்க்யூட்டில் உள்ள வாயில்களைக் குறிக்கும் அணி.
te: Qiskit Aer ఒక ``unitary_simulator`` ని కూడా కలిగి ఉంటుంది, ఇది పని చేస్తుంది *సర్క్యూట్‌లోని అన్ని మూలకాలు ఏకీకృత కార్యకలాపాలను అందించినట్లయితే*. ఈ బ్యాకెండ్ క్వాంటం సర్క్యూట్‌లోని గేట్‌లను సూచించే :math:`2^n \times 2^n` మాతృకను గణిస్తుంది.
tr_tr: Qiskit Aer ayrıca, *devredeki tüm elemanların üniter işlemler olması koşuluyla* çalışan bir ``unitary_simulator`` içerir. Bu arka uç, kuantum devresindeki kapıları temsil eden :math:`2^n\times2^n` matrisini hesaplar.
zh_tw: Qiskit Aer 亦提供只要*電路中所有元素都是么正操作*就能使用的 ``unitary_simulator``。這個後臺可以計算量子電路中閘操作的 :math:`2^n \times 2^n`矩陣表示。

source: OpenQASM backend
bn_bn: OpenQASM ব্যাকএন্ড
es_un: Backend OpenQASM
fr: Backend OpenQASM
it_it: Backend OpenQASM
ja: OpenQASMバックエンド
ko_kr: OpenQASM 후위 처리 장치
pt_br: Backend OpenQASM
pt_un: Backend OpenQASM
ru_ru: Окружение OpenQASM
ta_in: OpenQASM பின்தளத்தில்
tr_tr: OpenQASM arka ucu
zh_tw: OpenQASM 後臺

source: The simulators above are useful because they provide information about the state output by the ideal circuit and the matrix representation of the circuit. However, a real experiment terminates by *measuring* each qubit (usually in the computational :math:`|0\rangle, |1\rangle` basis). Without measurement, we cannot gain information about the state. Measurements cause the quantum system to collapse into classical bits.
bn_bn: উপরের সিমুলেটরগুলি দরকারী কারণ তারা আদর্শ বর্তনী এবং বর্তনীর ম্যাট্রিক্স উপস্থাপনার দ্বারা দশার ফলাফল সম্পর্কে তথ্য সরবরাহ করে। যদিও একটি বাস্তব গবেষণা প্রতিটি কিউবিট *পরিমাপ* করে শেষ হয় (সাধারণত গণনা :math:`|0\rangle, |1\rangle` ভিত্তিতে)। পরিমাপ ছাড়া আমরা দশা সম্পর্কে জানতে পারি না। পরিমাপের কারণে কোয়ান্টাম সিস্টেম টি ধ্রুপদী বিটের মধ্যে পতিত হচ্ছে ।
es_un: Los simuladores anteriores son útiles porque proporcionan información sobre el estado de salida del circuito ideal y la representación matricial del circuito. Sin embargo, un experimento real termina *midiendo* cada qubit (generalmente en la base computacional :math:`|0\rangle, |1\rangle`). Sin medición, no podemos obtener información sobre el estado. Las mediciones hacen que el sistema cuántico colapse en bits clásicos.
fr: Les simulateurs précédents sont utiles car ils fournissent une information sur l'état de sortie d'un circuit idéal et la représentation matricielle de ce circuit. Toutefois, une expérience réelle se termine par la mesure de chaque qubit (habituellement sur la base de calcul :math:`|0\rangle, |1\rangle`). Sans mesure, on ne peut pas récupérer d'information à propos de l'état. Cependant, la mesure provoque l'effondrement du système quantique en un système de bits classiques.
it_it: I simulatori precedenti sono utili perché forniscono informazioni sullo stato di output del circuito ideale e la rappresentazione matriciale del circuito. Tuttavia, un esperimento reale termina *misurando* ciascun qubit (tipicamente nella base computazionale :math:`|0\rangle, |1\rangle`). Senza misurazione, non è possibile ottenere informazioni sullo stato. Le misurazioni forzano il sistema quantistico a collassare nei bit classici.
ja: 上記のシミュレーターは、理想的な回路から出力される状態と、回路の行列表現に関する情報を提供してくれるため便利です。 ただし、実際の実験は、各量子ビット (通常は、計算基底 :math:`|0\rangle, |1\rangle`) を *測定* することで終了します。 測定なしでは、状態に関する情報を得ることができません。 測定は、量子システムに古典的なビットへの崩壊を引き起こします。
ko_kr: 이러한 시뮬레이터들은 회로의 행렬 상태를 나타내고 이상적인 회로의 결과에 대한 정보를 주기 때문에 유용하다. 그러나 실제의 실험은 각각의 큐비트 (보통 계산적인 :math:`|0\rangle, |1\rangle` 베이스로 표현되는)를 *측정(measuring)*함으로서 종료 된다. 측정 없이는, 상태에 대한 정보를 얻을 수 없다. 그 이유는 측정을 통해서 양자 시스템은 고전적인 비트로 변환되기 때문이다.
pt_br: Os simuladores acima são úteis porque fornecem informações sobre a saída do estado pelo circuito ideal e a representação da matriz do circuito. No entanto, um experimento real termina por *medir* cada qubit (normalmente na base computacional :math:`|0\rangle, |1\rangle`). Sem a medição, não podemos obter informações sobre o estado. As medidas fazem com que o sistema quântico seja desmembrado em bits clássicos.
pt_un: Os simuladores acima são úteis porque fornecem informações sobre o estado final do circuito ideal e a representação matricial do circuito. No entanto, um experimento real termina *medindo* cada qubit (geralmente na base computacional :math:`|0\rangle, |1\rangle` ). Sem medições, não podemos obter informações sobre o estado. Medições fazem o sistema quântico colapsar para bits clássicos.
ru_ru: Приведенные выше симуляторы полезны, поскольку они предоставляют информацию о результирующем состоянии с помощью идеальной цепи и ее матричного представления. Однако, реальный эксперимент заканчивается *измерением* каждого кубита (обычно в вычислительном базисе :math:`|0\rangle, |1\rangle`). Без измерения мы не можем получить информацию о состоянии. Измерения заставляют квантовую систему схлопываться в классические биты.
ta_in: மேலே உள்ள சிமுலேட்டர்கள் பயனுள்ளதாக இருக்கும், ஏனெனில் அவை சரியான சுற்று மற்றும் சுற்று மேட்ரிக்ஸ் பிரதிநிதித்துவம் மூலம் மாநில வெளியீடு பற்றிய தகவல்களை வழங்குகின்றன. இருப்பினும், ஒரு உண்மையான சோதனை ஒவ்வொரு க்யூபிட்டையும் *அளவிடுவதன்* மூலம் முடிவடைகிறது (பொதுவாக கணக்கீட்டில் :math:`|0\rangle, |1\rangle` அடிப்படையில்). அளவீடு இல்லாமல், நாங்கள் மாநிலத்தைப் பற்றிய தகவல்களைப் பெற முடியாது. அளவீடுகள் குவாண்டம் அமைப்பை கிளாசிக்கல் பிட்களாகச் சிதைக்கச் செய்கிறது.
te: పై సిమ్యులేటర్‌లు ఉపయోగకరంగా ఉంటాయి ఎందుకంటే అవి ఆదర్శ సర్క్యూట్ మరియు సర్క్యూట్ యొక్క మ్యాట్రిక్స్ ప్రాతినిధ్యం ద్వారా స్టేట్ అవుట్‌పుట్ గురించి సమాచారాన్ని అందిస్తాయి. అయినప్పటికీ, ప్రతి క్విట్‌ను *కొలవడం* ద్వారా నిజమైన ప్రయోగం ముగుస్తుంది (సాధారణంగా గణన :math:`|0\rangle, |1\rangle` ఆధారంగా). కొలత లేకుండా, మేము రాష్ట్రం గురించి సమాచారాన్ని పొందలేము. కొలతలు క్వాంటం వ్యవస్థను క్లాసికల్ బిట్స్‌గా కూలిపోయేలా చేస్తాయి.
tr_tr: Yukarıdaki simülatörler yararlıdır çünkü ideal devre tarafından durum çıktısı ve devrenin matris gösterimi hakkında bilgi sağlarlar. Bununla birlikte, gerçek bir deney her bir kübitin *ölçülmesiyle* sona erer (genellikle hesaplama :math:`|0\rangle, |1\rangle` tabanında). Ölçüm olmadan, durum hakkında bilgi edinemeyiz. Ölçümler, kuantum sisteminin klasik bitlere çökmesine neden olur.
zh_tw: 上述的模擬器很有用，因為它們提供了理想電路輸出的狀態與以矩陣表示的電路。 然而實際上，qubit 的量子態會因為測量而終止（通常落在 :math:`|0\rangle, |1\rangle` basis）。 在沒有測量的情況下，我們無法獲得 qubit 的量子態。 測量會使量子系統塌縮為古典位元。
