Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/2_plotting_data_*_qiskit.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_br, ru, ta_in, tr_tr, zh_tw

source: ``'plot_state_qsphere'``: The Qiskit unique view of a quantum state where the amplitude and phase of the state vector are plotted in a spherical ball. The amplitude is the thickness of the arrow and the phase is the color. For mixed states it will show different ``'qsphere'`` for each component.
bn_bn: ``'plot_state_qsphere'``: এটি Qiskit এর বানানো কোয়ান্টাম অবস্থার একটি অদ্বিতীয় রূপ বা ছবি যেখানে অবস্থা ভেক্টরের বিস্তার ও পর্যায় একটি গোলকের মধ্যে কয়েকটা তীরের মাধ্যমে আঁকা হয়। এই তীরগুলির বেধ হলো বিস্তার এবং রং হলো পর্যায় (সব পর্যায়ের আলাদা রং)। মিশ্র অবস্থার ক্ষেত্রে প্রতিটি অংশের জন্য আলাদা আলাদা ``'qsphere'`` দেখানো হয়।
es_un: ``'plot_state_qsphere'``: La visualización única de Qiskit para un estado cuántico, en ella la amplitud y la fase del vector de estado se trazan en una esfera. La amplitud es el grosor de la flecha y la fase es el color. Para los estados mixtos mostrará diferentes ``'qsphere'`` para cada componente.
fr_fr: ` ` plot_state_qsphere'` `: la vue unique Qiskit d'un état quantique où l'amplitude et la phase du vecteur d'état sont tracées dans une boule sphérique. L'amplitude est l'épaisseur de la flèche et la phase est la couleur. Pour les états mixtes, il affiche différentes ` ` qsphere'` ` ` pour chaque composant.
id_id: ` ` 'plot_state_qsphere ' ` `: Pandangan unik Qiskit dari state kuantum di mana amplitudo dan fase dari state vektor diplot dalam bola bulat. Ketebalan dari panah adalah amplitudo dan warna adalah fase. Untuk state campuran, ini akan menampilkan ` ` 'qsphere ' ` ` berbeda untuk setiap komponen.
it_it: ``'plot_state_qsphere'``: La vista unica di Qiskit in cui l'ampiezza e la fase del vettore di stato sono rappresentate in una sfera. Lo spessore della freccia ne indica l'ampiezza ed il colore la fase. Nel caso di stati misti vengono mostrati diversi ``'qsphere'`` per ogni componente.
ja_jp: ``'plot_state_qsphere'``: 状態ベクトルの振幅と位相が球体にプロットされる、量子状態のQiskit独自ビュー。
ko_kr: ``'plot_state_qsphere'``: 상태 벡터의 진폭과 위상이 구체에 그려지는 양자 상태로 키스킷에 특화된 시각화다. 진폭은 화살표의 굵기이며, 위상은 색으로 나타난다. 혼합된 상태에 대해서는 각 컴포넌트에 대해서 다른 ``'qsphere'``를 보여줄 것이다.
pt_br: ``'plot_state_qsphere'``: Visualização única do Qiskit de um estado quântico na qual a amplitude e fase do vetor de estado são traçados em uma bola esférica. A amplitude é a espessura da seta e a fase é a cor. Para estados mistos, mostrará diferentes ``'qsphere'`` para cada componente.
ru: ``'plot_state_qsphere'``: Уникальное представление квантового состояния в Qiskit, при котором амплитуда и фаза вектора состояния наносятся на сферу. Амплитуду показывает толщина стрелки, а фазу — ее цвет. У смешанного состоянии отобразятся ``'qsphere'`` для каждого компонента.
ta_in: `` 'plot_state_qsphere'``: மாநில திசையனின் வீச்சு மற்றும் கட்டம் ஒரு கோளப் பந்தில் திட்டமிடப்பட்டுள்ள ஒரு குவாண்டம் நிலையின் கிஸ்கிட் தனித்துவமான பார்வை. வீச்சு என்பது அம்புக்குறியின் தடிமன் மற்றும் கட்டம் நிறம். கலப்பு மாநிலங்களுக்கு இது ஒவ்வொரு கூறுக்கும் வெவ்வேறு `` 'qsphere'` ஐக் காண்பிக்கும்.
tr_tr: ``'plot_state_qsphere'``: Durum vektörünün genliğinin ve fazının küresel bir top içinde çizildiği Qiskit kuantum durumun eşsiz görünümü. Genlik, okun kalınlığıdır ve faz renktir. Karışık durumlar için, her bileşen için farklı ``qsphere`` gösterecektir.
zh_tw: ``'plot_state_qsphere'``：Qiskit 獨特的量子態視圖。它將狀態向量的振幅和相位繪製在一個球體中。振幅由箭頭的厚度表示，而相位則是由顏色。對於混合狀態，它將對每個部分顯示不同的 ``'qsphere'``。

source: ``'plot_state_paulivec'``: The representation of the state matrix using Pauli operators as the basis :math:`\rho=\sum_{q=0}^{d^2-1}p_jP_j/d`.
bn_bn: ``'plot_state_paulivec'``: পাউলি অপারেটরসমূহ ব্যবহার করে অবস্থা ম্যাট্রিক্সের ভিত্তিরূপে উপস্থাপন :math:`\rho=\sum_{q=0}^{d^2-1}p_jP_j/d`.
es_un: ``'plot_state_paulivec'``: La representación de la matriz de estado utilizando operadores de Pauli como base :math:`\rho = \sum_ {q= 0} ^ {d ^ 2-1} p_jP_j/d`.
fr_fr: ` ` 'plot_state_paulivec'` ` `: la représentation de la matrice d'état à l'aide des opérateurs Pauli comme base :math:`\rho = \sum_ { q= 0 } ^ { d ^ 2-1 } p_jP_j/d `.
id_id: ` ` 'plot_state_paulivec ' ` `: Representasi dari state matriks menggunakan operator Pauli sebagai dasar :math:`\rho = \sum_ {q= 0} ^ {d ^ 2-1} p_jP_j/d `.
it_it: ``'plot_state_paulivec'``: Rappresenta la matrice di stato utilizzando come base gli operatori di Pauli :math:`\rho=\sum_{q=0}^{d^2-1}p_jP_j/d`.
ja_jp: ``'plot_state_paulivec'``: :math:`\rho=\sum_{q=0}^{d^2-1}p_jP_j/d` を基底としたパウリ演算子による状態行列の表現。
ko_kr: ``'plot_state_paulivec'``: :math:`\rho=\sum_{q=0}^{d^2-1}p_jP_j/d` 기저를 파울리 (Pauli) 연산자로 사용하는 상태 행렬을 나타낸다.
pt_br: ``'plot_state_paulivec'``: Representação da matriz de estados usando os operadores de Pauli como base :math:`\rho=\sum_{q=0}^{d^2-1}p_jP_d`.
ta_in: `` 'plot_state_paulivec'``: பவுலி ஆபரேட்டர்களை அடிப்படையாகப் பயன்படுத்தும் மாநில மேட்ரிக்ஸின் பிரதிநிதித்துவம்: math: `\rho = \ sum_ {q = 0} ^ {d ^ 2-1} p_jP_j / d`.
tr_tr: ``'plot_state_paulivec'``: temel olarak Pauli operatörlerini kullanarak durum matrisinin temsili :math:`\rho=\sum_{q=0}^{d^2-1}p_jP_j/d`.
zh_tw: ``'plot_state_paulivec'``：以 Pauli 運算子作爲基底表示的量子態矩陣 :math:`\rho=\sum_{q=0}^{d^2-1}p_jP_j/d`。

source: ``'plot_state_hinton'``: Same as ``'city'`` but where the size of the element represents the value of the matrix element.
bn_bn: ``'plot_state_hinton'``: এটি ``'city'`` এর মতোই, শুধু এখানে উপাদানের আকার ম্যাট্রিক্সের উপাদানের মান নির্দেশ করে।
es_un: ``'plot_state_hinton'``: Igual que ``'city'`` pero aquí, el tamaño del elemento representa el valor del elemento de matriz.
fr_fr: ` ` plot_state_hinton'` `: Identique à ` ` 'city'` ` ` mais où la taille de l'élément représente la valeur de l'élément de matrice.
id_id: ` ` ''plot_state_hinton '` `: Sama dengan ` ` ` 'city' ` ` dengan pengecualian di mana ukuran elemen mewakili nilai elemen matriks.
it_it: ``'plot_state_hinton'``: Simile a ``'city'`` con la differenza che la dimensione dell'elemento rappresenta il valore dell'elemento di matrice.
ja_jp: ``'plot_state_hinton'``: ``'city'`` と同様だが、要素の大きさは行列要素の値を表す。
ko_kr: ``'plot_state_hinton'``: ``'city'`` 형태로 나타내는 것은 동일하지만, 요소의 크기는 행렬 요소의 값을 나타낸다.
pt_br: ``'plot_state_hinton'``: Idêntico a ``'city'`` com a diferença de que o tamanho do elemento representa o valor do elemento da matriz.
ru: ``'plot_state_hinton'``: То же, что и ``'city'``, но размер элемента отражает значение элемента матрицы.
ta_in: ` 'plot_state_hinton '` `: அதே ` ` 'city' ` ` ஆனால் எங்கு உறுப்பின் அளவு மாட்ரிக்ஸ் உறுப்பின் மதிப்பை குறிக்கும்.
tr_tr: ``'plot_state_hinton'``: ``city`` ile aynı, ancak öğenin boyutu matris öğesinin değerini temsil eder.
zh_tw: ``'plot_state_hinton'``：與 ``'city'`` 相同，但各部分面積的大小表示矩陣元素的值。

source: ``'plot_bloch_multivector'``: The projection of the quantum state onto the single qubit space and plotting on a bloch sphere.
bn_bn: ``'plot_bloch_multivector'``: একটি কিউবিট স্থানে কোয়ান্টাম অবস্থার অভিক্ষেপ এবং ব্লক গোলকের (Bloch sphere) এর উপর লেখ আঁকা।
es_un: ``'pl_bloch_multivector'``: La proyección del estado cuántico sobre el espacio de un solo qubit graficado en una esfera de Bloch.
fr_fr: ` ` plot_bloch_multivectoriel'` `: la projection de l'état quantique sur l'espace d'un qubit unique et présentée sur une sphère de bloch.
id_id: ` ` 'plot_bloch_multivector ' ` `: Proyeksi dari state kuantum ke ruang qubit tunggal dan diplot pada bola bloch.
it_it: ``'plot_bloch_multivector'``: Viene proiettato lo stato quantistico sullo spazio del singolo qubit e rappresentato su una sfera di bloch.
ja_jp: ``'plot_bloch_multivector'``: 量子状態を単一量子ビット空間へ射影し、ブロッホ球上にプロットする。
ko_kr: ``'plot_bloch_multivector'``: 양자 상태를 하나의 큐비트 공간에 투영하고, 블로흐 구체에 시각화 한다.
pt_br: ``'plot_bloch_multivector'``: Projeção do estado quântico no espaço de um único qubit e traçando em um bloco da esfera.
ru: ``'plot_bloch_multivector'``: Проекция квантового состояния на однокубитное пространство и отображение полученной сферы Блоха.
tr_tr: ``'plot_bloch_multivector``: Kuantum durumunun tek kübitlik alana izdüşümü ve bir bloch küresine çizimi.
zh_tw: ``'plot_bloch_multivector'``：將量子狀態投影到單量子位元的空間，並繪製在 Bloch 球上。

source: Here we see that there is no information about the quantum state in the single qubit space as all vectors are zero.
bn_bn: এখানে আমরা দেখছি যে এক কিউবিট স্থানে কোয়ান্টাম অবস্থার কোনো তথ্য নেই, কারণ সব ভেক্টরের মান শুন্য।
es_un: Aquí vemos que no hay información sobre el estado cuántico en el espacio de un solo qubit ya que todos los vectores son cero.
fr_fr: Nous voyons ici qu'il n'y a pas d'informations sur l'état quantique dans l'espace d'un qubit unique car tous les vecteurs sont nulls.
id_id: Di sini kita melihat bahwa tidak ada informasi tentang state kuantum dalam ruang qubit tunggal karena semua vektor adalah nol.
it_it: Qui possiamo vedere che non ci sono informazioni sullo stato quantistico nello spazio del singolo qubit perchè tutti i vettori sono nulli.
ja_jp: ここでは、すべてのベクトルがゼロであるため、単一量子ビット空間内には、量子状態に関する情報がないことがわかります。
ko_kr: 여기서는 모든 벡터가 0이기 때문에 하나의 큐비트 공간에서 양자 상태에 대해서 정보가 없는 것을 확인한다.
pt_br: Neste caso, verificamos que não há qualquer informação sobre o estado quântico no espaço de um único qubit, uma vez que todos os vetores são zero.
ru: Здесь информация о квантовом состоянии в однокубитном пространстве отсутствует, так как все векторы равны нулю.
ta_in: அனைத்து திசையன்களும் பூஜ்ஜியமாக இருப்பதால் ஒற்றை குவிட் இடத்தில் குவாண்டம் நிலை பற்றி எந்த தகவலும் இல்லை என்பதை இங்கே காண்கிறோம்.
tr_tr: Burada, tüm vektörler sıfır olduğu için tek kübit uzayında kuantum durumu hakkında hiçbir bilgi olmadığını görüyoruz.
zh_tw: 這裡我們看到，在單量子位元空間中沒有量子態的訊息，因為所有的向量都是零。

source: Options when using state plotting functions
bn_bn: অবস্থা লেখচিত্র বানানোর ফাংশনগুলি ব্যবহারের সময় থাকা অপশনগুলো নিম্নরূপ
es_un: Opciones al usar funciones para graficar estados
fr_fr: Options lors de l'utilisation des fonctions de présentation de l''état
id_id: Opsi saat menggunakan fungsi penggambaran state
it_it: Personalizzazione quando si utilizzano le funzioni di visualizzazione dello stato
ja_jp: 状態プロット関数を使用するときのオプション
ko_kr: 상태 그리기 함수를 이용할때 옵션
pt_br: Opções quando usando funções de visualização do estado
ru: Опции при отображении состояни]
ta_in: மாநிலத்தின் செயல்பாடுகளைப் பயன்படுத்தும்போது தேர்வுகள்
tr_tr: Durum çizme işlevlerini kullanırken seçenekler
zh_tw: 量子態繪圖函數的選項

source: The various functions for plotting quantum states provide a number of options to adjust how the plots are rendered. Which options are available depends on the function being used.
bn_bn: কোয়ান্টাম স্টেটের লেখচিত্র আঁকার জন্য থাকা ফাংশনগুলোর মধ্যে অনেক অপশন থাকে যাতে আমরা লেখচিত্রটিকে নিজেদের মতো সাজাতে পারি। কিভাবে সাজাবো তা নির্ভর করে আমরা কোন ফাংশন আমরা ব্যবহার করছি তার ওপর।
es_un: Las diversas funciones para graficar estados cuánticos proporcionan una serie de opciones para ajustar cómo se renderizan cada una de las gráficas. Las opciones disponibles dependen de la función que se utilice.
fr_fr: Les différentes fonctions de présentation des états quantiques fournissent plusieurs d'options pour ajuster la façon dont les tracés sont créés. Les options disponibles dépendent de la fonction utilisée.
id_id: Berbagai fungsi untuk penggambaran state kuantum memberikan sejumlah pilihan untuk menyesuaikan bagaimana plot dirender. Opsi mana yang tersedia bergantung pada fungsi yang sedang digunakan.
it_it: Le diverse funzioni per la visualizzazione degli stati quantistici forniscono una serie di opzioni che permettono di personalizzare l'aspetto dei grafici che vengono creati. Le opzioni disponibili dipendono dalla funzione utilizzata.
ja_jp: 量子状態をプロットするためのさまざまな関数は、プロットのレンダリング方法を調整するための多くのオプションを提供します。 使用できるオプションは、使用している関数により異なります。
ko_kr: 양자 상태를 시각화하는 여러 함수는 그래프가 그려지는 방법을 조율하는 여러 옵션을 제공한다. 사용할 수있는 옵션은 사용중인 함수에 따라 다르다.
pt_br: As várias funções para a visualização de estados quânticos fornecem uma série de opções para ajustar a forma como os gráficos são renderizados. Quais opções estão disponíveis depende da função sendo usada.
ru: Различные функции для построения квантовых состояний предоставляют ряд опций для настройки способа отображения графиков. Доступные опции зависят от используемой функции.
ta_in: குவாண்ட் மாநிலங்களுக்கான பல்வேறு செயல்பாடுகள் எவ்வாறு பரிந்துரைக்கப்பட்டுள்ளன. எந்த விருப்பங்கள் கிடைக்கப்பெறும் செயல்பாடு செயல்படுகிறது.
tr_tr: Kuantum durumlarını çizmeye yönelik çeşitli işlevler, grafiklerin nasıl oluşturulacağını ayarlamak için bir dizi seçenek sunar. Hangi seçeneklerin kullanılabileceği kullanılan işleve bağlıdır.
zh_tw: 各種量子態繪圖函數提供了許多選項來調整繪圖的呈現方式。可用的選項取決於所使用的繪製函數。

source: **plot_state_city()** options
bn_bn: **plot\_state\_city()** এর অপশনগুলো নিম্নরূপ
es_un: Opciones **plot_state_city()**
id_id: Opsi **plot_state_city () **
ja_jp: **plot_state_city()** オプション
ru: Опции **plot_state_city()**
ta_in: ** plot_state_city () * தேர்வுகள்
zh_tw: **plot_state_city()** 選項

source: **title** (str): a string that represents the plot title
bn_bn: **title** (str): একটি স্ট্রিং যা লেখচিত্রের নাম প্রদর্শন করে
es_un: ** title** (str): una cadena que representa el título de la gráfica
fr_fr: ** title** (str): chaîne représentant le titre du diagramme
id_id: ** title** (str): string yang menjadi judul plot
it_it: **title** (str): una stringa che definisce il titolo del grafico
ja_jp: **title** (str): プロットのタイトルを表す文字列
ko_kr: **title** (str): 그림 제목을 나타내는 문자열
pt_br: **title** (str): uma string que representa o título do gráfico
ru: **title** (str): строка, представляющая заголовок графика
ta_in: ** தலைப்பு ** (str): சுட்டி தலைப்பை குறிக்கும் சரம்
tr_tr: **title** (str): çizim başlığını temsil eden bir dize
zh_tw: **title** (str)：表示繪圖標題的字串

source: **figsize** (tuple): figure size in inches (width, height).
bn_bn: **figsize** (tuple): ইঞ্চি এককে লেখচিত্রের আকার (দৈর্ঘ্য, প্রস্থ)।
es_un: **figsize** (tuple): tamaño de la figura en pulgadas (ancho, alto).
fr_fr: ** figsize** (n-uplet): taille du diagramme en pouces (largeur, hauteur).
id_id: ** figsize** (tuple): ukuran figur dalam inci (lebar, tinggi).
it_it: **figsize** (tuple): definisce la dimensione della figura in pollici (larghezza, altezza).
ja_jp: **figsize** (tuple): 図のサイズ。単位はインチ (幅, 高さ)。
ko_kr: **figsize** (tuple): 인치로 나타낸 그림 크기 (넓이, 높이).
pt_br: **figsize** (tupla): tamanho da figura em polegadas (largura, altura).
ru: **figsize** (tuple): размер в дюймах (ширина, высота).
ta_in: ** figsize** (tuple): அங்குல அளவு (அகலம், உயரம்).
tr_tr: **figsize** (tuple): inç cinsinden şekil boyutu (genişlik, yükseklik).
zh_tw: **figsize** (tuple)：圖片尺寸（英吋）（寬度，高度）。

source: **color** (list): a list of len=2 giving colors for real and imaginary components of matrix elements.
bn_bn: **color** (list): এখানে একটি রঙের নামের তালিকা পাঠানো হয় যাতে দুটি নাম থাকে, একটি ম্যাট্রিক্সের বাস্তব উপাদানগুলোর রঙের নাম আর অন্যটি কাল্পনিক উপাদানগুলোর রঙের নাম।
es_un: **color** (lista): una lista de len = 2 que da colores para los componentes reales e imaginarios de los elementos de la matriz.
fr_fr: ** color** (liste): une liste de longueur= 2 donnant des couleurs pour les composantes réelles et imaginaires des éléments de la matrice.
id_id: ** color** (list): list dengan len= 2 memberikan warna untuk komponen real dan imajiner dari elemen matriks.
it_it: **color** (list): una lista di len=2 che definisce i colori da usare per le componenti reale ed immaginaria della matrice densità.
ja_jp: **color** (list): 行列要素の実部と虚部の色を指定する、長さ2のリスト。
ko_kr: **color** (list): 구성 요소의 실수와 허수 부분에 대한 색을 나타내는 길이=2의 목록.
pt_br: **color** (lista): uma lista de len=2 dando cores para os componentes reais e imaginárias dos elementos da matriz.
ru: **color** (list): список из двух элементов, дающий цвета для реальных и мнимых компонентов матричных элементов.
ta_in: ** வண்ணம் (list): len= 2 என்ற பட்டியலை உண்மையான மற்றும் காத்திருக்கும் உறுப்புகளுக்கான வண்ணங்களை கொடுக்கிறது.
tr_tr: **color** (liste): matris elemanların gerçek ve sanal bileşenleri için renk veren bir len=2 listesi.
zh_tw: **color** (list)：len=2 表示矩陣元素的實部和虛部顏色的列表。

source: **plot_state_hinton()** options
bn_bn: **plot\_state\_hinton()** এর অপশনগুলো নিম্নরূপ
es_un: Opciones para **plot_state_hinton()**
id_id: Opsi **plot_state_hinton ()**
ja_jp: **plot_state_hinton()** オプション
ru: Опции **plot_state_hinton()**
ta_in: ** plot_state_hinton() * தேர்வுகள்
zh_tw: **plot_state_hinton()** 選項

source: **plot_state_paulivec()** options
bn_bn: **plot\_state\_paulivec()** এর অপশনগুলো নিম্নরূপ
es_un: Opciones para **plot_state_paulivec()**
id_id: Opsi **plot_state_paulivec ()**
ja_jp: **plot_state_paulivec()** オプション
ru: Опции **plot_state_paulivec()**
ta_in: ** plot_state_ paulivec () * தேர்வுகள்
zh_tw: **plot_state_paulivec()** 選項

source: **color** (list or str): color of the expectation value bars.
bn_bn: **color** (list or str): যে যে স্তম্ভ (bar) গুলো আসবে তাদের সবার একই রং চাইলে একটি রঙের নাম, বা সবার আলাদা রং চাইলে প্রত্যেক স্তম্ভের জন্য আলাদা রঙের নামের তালিকা দিতে হবে।
es_un: ** color** (list o str): color de las barras de valor esperado.
fr_fr: **color** (liste ou str): couleur des barres de valeur attendues.
id_id: ** color** (list atau str): warna dari nilai ekspektasi bar.
it_it: **color** (list o str): definisce il colore delle barre che rappresentano il valore di aspettazione.
ja_jp: **color** (list または str): 期待値バーの色。
ko_kr: **color** (list 또는 str): 기대 값의 막대의 색.
pt_br: **color** (lista ou str): cor esperada das barras dos valores.
ru: **color** (list или str): цвет столбцов математических ожиданий.
ta_in: ** வண்ணம் (list or str): எதிர்பாராத மதிப்பு பட்டைகளின் வண்ணம்.
tr_tr: **color** (liste veya str): beklenti değeri çubuklarının rengi.
zh_tw: **color** (list or str)：期望值長條的顏色。

source: **plot_state_qsphere()** options
bn_bn: **plot\_state\_paulivec()** এর অপশনগুলো নিম্নরূপ
es_un: Opciones para **plot_state_qsphere()**
id_id: Opsi **plot_state_qsphere ()**
ja_jp: **plot_state_qsphere()** オプション
ru: Опции **plot_state_qsphere()**
ta_in: ** plot_state_qsphere () * * விருப்பங்கள்
zh_tw: **plot_state_qsphere()** 選項

source: **plot_bloch_multivector()** options
bn_bn: **plot\_bloch\_multivector()** এর অপশনগুলো নিম্নরূপ
es_un: Opciones para **plot_bloch_multivector()**
id_id: Opsi **plot_bloch_multivector ()**
ja_jp: **plot_bloch_multivector()** オプション
ru: Опции **plot_bloch_multivector()**
ta_in: ** plot_ bloch_multivector () * * தேர்வுகள்
zh_tw: **plot_bloch_multivector()** 選項

source: Using the output from state plotting functions
bn_bn: স্টেট এর লেখচিত্রের ফাংশনগুলোর ফলাফল ব্যবহার করে
es_un: Usar la salida de las funciones para graficar estados
fr_fr: Utilisation des paramètres retournés par les fonctionsde visualisation d'état
id_id: Menggunakan output dari fungsi plot state
it_it: Utilizzo dell'output delle funzioni di visualizzazione dello stato
ja_jp: 状態プロット関数からの出力の使用
ko_kr: 양자 상태를 그리는 함수의 출력 사용하기
pt_br: Usando a saída de funções de visualização de estado
ru: Использование выходных данных отображения состояния
ta_in: வெளியீட்டை மாநிலமாகக் கொண்டு செயல்பாடுகள்
tr_tr: Durum çizim fonksiyonlarından elde edilen çıktıyı kullanma
zh_tw: 使用量子態繪圖函數的輸出

source: When using any of the state plotting functions it returns a ``matplotlib.Figure`` for the rendered visualization. Jupyter notebooks understand this return type and render it for us in this tutorial, but when running outside of Jupyter you do not have this feature automatically. However, the ``matplotlib.Figure`` class natively has methods to both display and save the visualization. You can call ``.show()`` on the returned object to open the image in a new window (assuming your configured matplotlib backend is interactive). Or alternatively you can call ``.savefig('out.png')`` to save the figure to ``out.png`` in the current working directory. The ``savefig()`` method takes a path so you can adjust the location and filename where you’re saving the output.
bn_bn: যখনই কোন মান বা অবস্থা লেখচিত্র বানানোর ফাংশন ব্যবহার হয় সেটা একটা ``matplotlib.Figure`` জিনিস বানিয়ে ফেরত দেয়, যার মধ্যে লেখচিত্রের দৃশ্যায়ন থাকে। এই শিক্ষনীতে জুপিটার নোটবুক এই জিনিসটি চিনতে পারে এবং আমাদের জন্য ফলাফল ছবিটি এঁকে দেয়। কিন্তু জুপিটারের বাইরে এই সুবিধাটি নিজে থেকে আসে না। ``matplotlib.Figure`` এই ক্লাসটির মধ্যে ছবি আঁকার ও দৃশ্যায়নটি সংরক্ষণ করার দুই পদ্ধতিই লেখা আছে। প্রয়োজনমতো এর উপর ``.show()`` ফাংশন ডেকে অন্য একটি উইন্ডোতে ছবিটি দেখা যেতে পারে(যদি matplotlib এর ব্যাকএন্ড মিথষ্ক্রিয় (ইন্টারেক্টিভ) ঠিকঠাক সাজানো থাকে)। অথবা ``.savefig('out.png')`` ফাংশন ডেকে ছবিটি ``out.png`` নামে বতর্মান ডিরেক্টরিতে সংরক্ষণ করা যেতে পারে। ``savefig()`` পদ্ধতিটি একটি পথ নেয় যাতে কোথায় কি নামে ছবিটি সংরক্ষণ হচ্ছে সেটা আমরা নিয়ন্ত্রণ করতে পারি।
es_un: Al usar cualquiera de las funciones de visualización de estados, se devuelve un objeto de clase ``matplotlib.Figure`` para la visualización renderizada. Los cuadernos de Jupyter entienden este tipo de objeto y hacen el render dentro de este tutorial, pero al correr la función fuera de Jupyter no se tiene esta capacidad automáticamente. Sin embargo, la clase ``matplotlib.Figure`` tiene métodos nativos para mostrar y guardar la visualización. Puedes llamar al método ``.show()`` en el objeto devuelto para abrir la imagen en una nueva ventana (asumiendo el backend de matplotlib que tienes configurado es interactivo). O alternativamente, puedes llamar ``.savefig('out.png')`` para guardar la figura a ``out.png`` en el directorio de trabajo actual. El método ``savefig()`` tiene de entrada una ruta para que puedas ajustar la ubicación y nombre del archivo donde estés guardando la salida.
id_id: Ketika menggunakan salah satu fungsi gambar state dia mengembalikan sebuah ` `matplotlib.Figure ` ` ` untuk visualisasi yang telah dirender. Jupyter notebook memahami jenis return ini dan render untuk kita di tutorial ini, tapi ketika dieksekusi di luar Jupyter Anda tidak memiliki fitur ini secara otomatis. Namun, kelas natif ` `matplotlib.Figure ` ` ` memiliki metode untuk kedua tampilan dan menyimpan visualisasi. Anda dapat memanggil ` `.show () ` ` pada objek yang dikembalikan untuk membuka gambar dalam jendela baru (dengan asumsi backend matplotlib anda yang dikonfigurasi adalah interaktif). Atau secara alternatif Anda dapat memanggil ` `.savefig( 'out.png') ` ` untuk menyimpan figur ke ` `out.png ` `. ` ` savefig () ` ` ` metode mengambil sebuah path sehingga Anda dapat menyesuaikan lokasi dan nama file di mana Anda menyimpan output.
ja_jp: 視覚化のために plot_histogram() 関数を呼び出した場合の返り値は ``matplotlib.Figure`` です。Jupyter notebook は返り値の型を理解するので、このチュートリアルでは表示されますが、Jupyter 以外で実行する場合にはこの機能は自動的には使えません。``matplotlib.Figure`` クラス自体は視覚化されたものを表示、保存する機能をもともと持っています。``plot_histogram()`` から返されたオブジェクトに対して ``.show()`` を呼び出すとイメージが新しいウィンドウで開きます (このときmatplotlib バックエンドをインタラクティブに設定していることを想定) 。あるいは ``.savefig('out.png')`` で 図を ``out.png`` に保存できます。 ``savefig()`` メソッドはパスを引数に取り、保存しようとしている図の場所やファイル名を指定できます。
ta_in: எந்தவொரு மாநில சதி செயல்பாடுகளையும் பயன்படுத்தும் போது, ​​காண்பிக்கப்பட்ட காட்சிப்படுத்தலுக்கு `` மேட்லோட்லிப். ஜூபிட்டர் நோட்புக்குகள் இந்த வருவாய் வகையைப் புரிந்துகொண்டு இந்த டுடோரியலில் எங்களுக்காக வழங்குகின்றன, ஆனால் ஜூபிட்டருக்கு வெளியே இயங்கும் போது இந்த அம்சம் தானாக உங்களிடம் இல்லை. இருப்பினும், `` matplotlib.Figure`` வகுப்பில் காட்சிப்படுத்தல் மற்றும் காட்சிப்படுத்தல் ஆகிய இரண்டிற்கும் முறைகள் உள்ளன. புதிய சாளரத்தில் படத்தைத் திறக்க நீங்கள் திரும்பிய பொருளில் `` .ஷோ () `` ஐ அழைக்கலாம் (உங்கள் உள்ளமைக்கப்பட்ட மேட்லோட்லிப் பின்தளத்தில் ஊடாடும் என்று கருதி). அல்லது மாற்றாக, தற்போதைய பணி அடைவில் உள்ள `` out.png`` இல் படத்தை சேமிக்க `` .சேவ்ஃபிக் ('out.png') `` ஐ அழைக்கலாம். `` சேவ்ஃபிக் () `` முறை ஒரு பாதையை எடுக்கும், எனவே நீங்கள் வெளியீட்டைச் சேமிக்கும் இடம் மற்றும் கோப்பு பெயரை சரிசெய்யலாம்.
zh_tw: 當使用任何量子態繪圖函數時，它會返回一個 ``matplotlib.Figure`` 來呈現視覺化。Jupyter notebooks 知道該返回類型，並在本教程中為我們所用。但在 Jupyter 之外執行時，您無法自動擁有此功能。不過，``matplotlib.Figure`` 類擁有原生的視覺化顯示與存儲方法。您可以使用 ``plot_histogram()`` 返回對象中的 ``.show()`` ，以在新視窗中開啟圖片（假設您配置的 matplotlib 後端是可互動的）。或者，您也可以使用 ``.savefig('out.png')``，將圖片儲存至 ``out.png``。``savefig()`` 方法需要輸入一個路徑，因此您可以自定義存儲地址與文檔名。
