Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/2_plotting_data_*_qiskit.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_br, ru, ta_in, tr_tr, zh_tw

source: This page was generated from `tutorials/circuits/2_plotting_data_in_qiskit.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/circuits/2_plotting_data_in_qiskit.ipynb`__ থেকে তৈরি হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/circuit/2_plotting_data_in_qiskit.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/circuits/2_plotting_data_in_qiskit.ipynb`__.
id_id: Halaman ini disadur dari ` tutorials/circuits/1_getting_started_with_qiskit.ipynb ` __.
it_it: Questa pagina è stata generata a partire da `tutorials/circuits/2_plotting_data_in_qiskit.ipynb`__.
ja_jp: 当ページは `tutorials/circuits/2_plotting_data_in_qiskit.ipynb`__ から生成されました。
ko_kr: 이 페이지는 tutorials/순회 /2_plotting_data_in_qis.ipynb 에서 생성되었다.
pt_br: Esta página foi gerada a partir do link `tutorials/circuits/2_plotting_data_in_qiskit.ipynb`__.
ru: Страница создана на основе `tutorials/circuits/2_plotting_data_in_qiskit.ipynb`__.
ta_in: இந்த பக்கம் ` tutorials/circuits/1_getting_started_with_qiskit.ipynb ` __ இல் இருந்து உருவாக்கப்பட்டது.
tr_tr: Bu sayfa `tutorials/circuits/2_plotting_data_in_qiskit.ipynb`__ adresinden oluşturulmuştur.
zh_tw: 這個頁面是由 `tutorials/circuits/2_plotting_data_in_qiskit.ipynb`__ 產生。

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits/2_plotting_data_in_qiskit.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits/2_plotting_data_in_qiskit.ipynb>`__.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits/2_plotting_data_in_qiskit.ipynb>`_ でインタラクティブに実行します。
ta_in: கருப்பொருளில் ஊடாடும் வகையில் இயக்கவும் ` IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/circuits/1_getting_started_with_qiskit.ipynb>` _.

source: Qiskit Visualizations
bn_bn: Qiskit এ দৃশ্যায়ন (ভিজুয়ালাইজেশন)
es_un: Visualizaciones en Qiskit
fr_fr: Visualisations Qiskit
id_id: Visualisasi Qiskit
it_it: Visualizzazioni in Qiskit
ja_jp: Qiskit 可視化ツール
ko_kr: 키스킷 시각화하기
pt_br: Visualizações no Qiskit
ru: Визуализации Qiskit
ta_in: கிஸ்கிட் காட்சிப்படுத்தல்
tr_tr: Qiskit Görselleştirmeleri
zh_tw: Qiskit 視覺化

source: Plot histogram
bn_bn: আয়তলেখ (হিস্টোগ্রাম) আঁকা
es_un: Crear un histograma
fr_fr: Afficher l'histogramme
id_id: Tampilkan Histogram
it_it: Creare un istogramma
ja_jp: ヒストグラムのプロット
ko_kr: 히스토그램 그리기
pt_br: Desenhando o histograma
ta_in: பழுப்பு வரைபடம்
tr_tr: Histogram çizimi

source: To visualize the data from a quantum circuit run on a real device or ``qasm_simulator`` we have made a simple function
bn_bn: কোয়ান্টাম বর্তনী থেকে প্রাপ্ত তথ্য দৃশ্যায়ন করতে বর্তনীটি আসল যন্ত্রে বা ``qasm_simulator`` এ কার্যকর করার জন্য
es_un: Para visualizar los datos de un circuito cuántico ejecutado en un dispositivo real o "quasm_simulator", hemos hecho una función simple
fr_fr: Pour visualiser les données d'un circuit quantique exécuté sur un appareil réel ou ` ` qasm_simulateur ` ` nous avons fait une fonction simple
id_id: Untuk memvisualisasikan data dari sebuah sirkuit kuantum yang dijalankan pada perangkat nyata atau ` ` ` qasm_simulator ` ` kita telah membuat sebuah fungsi sederhana
it_it: Per visualizzare i risultati dell'esecuzione di un circuito quantistico sia su un dispositivo reale che sul simulatore ``qasm_simulator``, si può fare uso della seguente funzione
ja_jp: 実デバイスまたは ``qasm_simulator`` 上で実行される量子回路からのデータを可視化するために、シンプルな関数を用意しています。
ko_kr: 실제 장치 또는 ``qasm_simulator``에서 실행되는 양자 회로의 데이터를 가시화하기 위해서 간단한 함수를 만들었다.
pt_br: Para visualizar os dados que um circuito quântico executa em um dispositivo real ou no ``qasm_simulator``, fizemos uma função simples
ru: Для визуализации данных, полученных от квантовой схемы на реальном устройстве или на ``qasm_simulator``, мы сделали простую функцию
ta_in: ஒரு சாதாரண சாதனம் அல்லது ` ` qasm_ simulator ` ` நாம் ஒரு எளிய செயல்கூறு செய்தது
tr_tr: Gerçek bir cihaz veya ``qasm_simulator`` üzerinde çalışan bir kuantum devresinden gelen verileri görselleştirmek için basit bir fonksiyon oluşturduk
zh_tw: 為了圖示化量子電路在實體量子電腦或 ``qasm_simulator`` 執行的計算結果，我們提供一個簡單的函數做使用

source: As an example we make a 2-qubit Bell state
bn_bn: উদাহরণস্বরূপ, আমরা ২-কিউবিট সম্পন্ন বেল অবস্থা (বেল স্টেট) বানাবো
es_un: Como ejemplo, generaremos un estado de Bell de 2 qubits
fr_fr: À titre d'exemple, nous faisons un état de Bell avec 2-qubit
id_id: Sebagai contoh kita membuat sebuah 2-qubit Bell state
it_it: Ecco un esempio che realizza uno stato di Bell a 2 qubit
ja_jp: 例として、2量子ビットのベル状態を作ります。
ko_kr: 예를 들어 2-큐비트 벨 (Bell) 상태를 만든다.
pt_br: Como um exemplo, fazemos um estado de Bell de 2 qubits
ru: В качестве примера мы делаем двухкубитное состояние Белла
ta_in: ஒரு உதாரணமாக நாம் 2-கிபிட் மணி மாநிலம் செய்கிறோம்
tr_tr: Örnek olarak 2-kübitlik Bell durumu oluşturuyoruz
zh_tw: 我們以兩個量子位元的 Bell state 做舉例

source: Options when plotting a histogram
bn_bn: আয়তলেখ (হিস্টোগ্রাম) আঁকার বিভিন্ন উপায়
es_un: Opciones al graficar un histograma
fr_fr: Options lors de la préparation d'un histogramme
id_id: Opsi untuk gambar sebuah histogram
it_it: Opzioni nella creazione di un istogramma
ja_jp: ヒストグラムをプロットするときのオプション
ko_kr: 히스토그램 그래프 옵션
pt_br: Opções quando desenhamos um histograma
ru: Опции при построении гистограммы
ta_in: ஹிஸ்டோகிராம் ஒழுங்கும்போது தேர்வுகள்
tr_tr: Histogram çizerken kullanılabilecek seçenekler
zh_tw: 繪製直方圖函數的可調參數

source: The ``plot_histogram()`` has a few options to adjust the output graph. The first option is the ``legend`` kwarg. This is used to provide a label for the executions. It takes a list of strings use to label each execution’s results. This is mostly useful when plotting multiple execution results in the same histogram. The ``sort`` kwarg is used to adjust the order the bars in the histogram are rendered. It can be set to either ascending order with ``asc`` or descending order with ``dsc``. The ``number_to_keep`` kwarg takes an integer for the number of terms to show, the rest are grouped together in a single bar called rest. You can adjust the color of the bars with the ``color`` kwarg which either takes a string or a list of strings for the colors to use for the bars for each execution. You can adjust whether labels are printed above the bars or not with the ``bar_labels`` kwarg. The last option available is the ``figsize`` kwarg which takes a tuple of the size in inches to make the output figure.
ja_jp: ``plot_histogram()`` には出力グラフの調整のためのいくつかのオプションがあります。最初のオプションは ``legend`` kwarg (可変長引数) です。これは実行のラベル指定に利用します。特に同じヒストグラム中の複数の実行結果をプロットする場合に有益です。``sort`` kwarg はヒストグラム描画においてバーの順番を調整します。 ``asc`` 昇順 か ``dsc`` 降順のどちらかを指定できます。 ``number_to_keep`` kwarg は表示の項目数を指定します。それ以外は rest と呼ばれるバーに集約されます。``color`` kwarg はバーの配色を調整します。各実行のバーに利用される配色の文字列か文字列のリストを指定します。``bar_labels`` kwarg ではバーの上にラベルを表示するかを調整できます。最後のオプションは ``figsize`` kwarg で、出力図形のサイズをインチで指定したタプルです。
ta_in: The ` plot_ histogram () ` ` ` ` plot_histogram () ` ` வெளியீடு வரைபடத்தை தவிர்த்து சில விருப்பங்கள் கொண்டது. முதல் விருப்பத்தேர்வு ` கொள்கை ` ` kwarg. இது விதிவிலக்குகளுக்கு ஒரு விளக்கச்சீட்டை வழங்குவதற்கு பயன்படுகிறது. இது ஒவ்வொரு இயக்கத்தின் முடிவுகளின் முடிவுகளைக் கொண்டு ஒரு பட்டியலை எடுத்துக் கொள்ளும். இது பெரும்பாலும் பயனுள்ளதாகும் ஒரே ஹிஸ்டோகிராங்கில் பல செயல்பாடு முடிவடைந்தால். ` ` kwarg ` ` kwarg இன் ஹிஸ்டோகிராயில் பட்டைகளை ஒழுங்கற்ற பயன்படுகிறது. இது ` ` dsc ` ` ` ` asc ` ` அல்லது டெஸ்க் ` ` ` asc ` `. ` ` kwar_ to_keep ` ` kwarg takes an integer to the number of terms to show, the rest are grouped together in a single bar called rest. You can adjust the color of the bars with the ` ` color ` ` kwarg which takes a string or a list of strings for the colors to use for each execution for each execution. பட்டியலுக்கு மேலே அச்சிடப்பட்டதா அல்லது ` bar_labels ` ` kwarg. The last option is the ` ` figsize ` ` kwarg which takes a tuple of the size in इंच to make the output figure.

source: Using the output from plot_histogram()
bn_bn: plot_histogram() থেকে প্রাপ্ত ফলাফলের ব্যবহার করা
es_un: Usando la salida de plot_histogram()
id_id: Menggunakan output dari plot_histogram ()
ja_jp: plot_histogram() による出力の使用
ru: Использование вывода plot_histogram()
ta_in: Plot_ histogram () வெளியீட்டை பயன்படுத்தி
zh_tw: 使用 plot_histogram() 的輸出

source: When using the plot_histogram() function it returns a ``matplotlib.Figure`` for the rendered visualization. Jupyter notebooks understand this return type and render it for us in this tutorial, but when running outside of Jupyter you do not have this feature automatically. However, the ``matplotlib.Figure`` class natively has methods to both display and save the visualization. You can call ``.show()`` on the returned object from ``plot_histogram()`` to open the image in a new window (assuming your configured matplotlib backend is interactive). Or alternatively you can call ``.savefig('out.png')`` to save the figure to ``out.png``. The ``savefig()`` method takes a path so you can adjust the location and filename where you’re saving the output.
bn_bn: plot_histogram() ফাংশন একটি ``matplotlib.Figure`` ফেরত পাঠায় যেটি দৃশ্যায়নটিকে বানায়। এই শিক্ষনীতে জুপিটার নোটবুক এই জিনিসটি চিনতে পারে এবং আমাদের জন্য ফলাফল ছবিটি এঁকে দেয়। কিন্তু জুপিটারের বাইরে এই সুবিধাটি নিজে থেকে আসে না। ``matplotlib.Figure`` এই ক্লাসটির মধ্যে ছবি আঁকার ও দৃশ্যায়নটি সংরক্ষণ করার দুই পদ্ধতিই লেখা আছে। প্রয়োজনমতো এর ফলাফলের উপর ``.show()`` ফাংশন ডেকে অন্য একটি উইন্ডোতে ছবিটি দেখা যেতে পারে(যদি matplotlib এর ব্যাকএন্ড ইন্টারেক্টিভ ঠিকঠাক সাজানো থাকে)। অথবা ``.savefig('out.png')`` ফাংশন ডেকে ছবিটি ``out.png`` নামে সংরক্ষণ করা যেতে পারে। ``savefig()`` পদ্ধতিটি একটি পথ নেয় যাতে কোথায় কি নামে ছবিটি সংরক্ষণ হচ্ছে সেটা আমরা নিয়ন্ত্রণ করতে পারি।
es_un: Al usar la función plot_histogram() esta devuelve un objeto de clase ``matplotlib.Figure`` para la visualización renderizada. Los cuadernos de Jupyter entienden este tipo de objeto y hacen el render dentro de este tutorial, pero al correr la función fuera de Jupyter no se tiene esta característica automáticamente. Sin embargo, la clase ``matplotlib.Figure`` tiene métodos nativos para mostrar y guardar la visualización. Puedes llamar al método ``.show()`` en el objeto devuelto por ``plot_histogram()`` para abrir la imagen en una nueva ventana (asumiendo el backend de matplotlib que tienes configurado es interactivo). O alternativamente, puedes llamar ``.savefig('out.png')`` para guardar la figura a ``out.png``. El método ``savefig()`` tiene de entrada una ruta para que puedas ajustar la ubicación y nombre del archivo donde estés guardando la salida.
id_id: Ketika menggunakan plot_histogram () fungsi itu mengembalikan sebuah ` `matplotlib.Figure ` ` ` untuk visualisasi yang telah dirender. Jupyter notebook memahami jenis return ini dan render untuk kita di tutorial ini, tapi ketika dieksekusi di luar Jupyter Anda tidak memiliki fitur ini secara otomatis. Namun, kelas natif ` `matplotlib.Figure ` ` ` memiliki metode untuk kedua tampilan dan menyimpan visualisasi. Anda dapat memanggil ` `.show () ` ` pada objek yang dikembalikan dari ` ` plot_histogram () ` ` untuk membuka gambar dalam jendela baru (dengan asumsi backend matplotlib anda yang dikonfigurasi adalah interaktif). Atau secara alternatif Anda dapat memanggil ` `.savefig( 'out.png') ` ` untuk menyimpan figur ke ` `out.png ` `. ` ` savefig () ` ` ` metode mengambil sebuah path sehingga Anda dapat menyesuaikan lokasi dan nama file di mana Anda menyimpan output.
ja_jp: 視覚化のために plot_histogram() 関数を呼び出した場合の返り値は ``matplotlib.Figure`` です。Jupyter notebook は返り値の型を理解するので、このチュートリアルでは表示されますが、Jupyter 以外で実行する場合にはこの機能は自動的には使えません。``matplotlib.Figure`` クラス自体は視覚化されたものを表示、保存する機能をもともと持っています。``plot_histogram()`` からの返り値オブジェクトに対して ``.show()`` を呼び出すとイメージが新しいウィンドウで開きます (matplotlib バックエンドをインタラクティブに設定していることを想定)。あるいは ``.savefig('out.png')`` で 図を ``out.png`` に保存できます。``savefig()`` メソッドはパスを引数に取り、保存しようとしている図の場所やファイル名を指定できます。
ta_in: எந்தவொரு மாநில சதி செயல்பாடுகளையும் பயன்படுத்தும் போது, ​​காண்பிக்கப்பட்ட காட்சிப்படுத்தலுக்கு `` மேட்லோட்லிப். ஜூபிட்டர் நோட்புக்குகள் இந்த வருவாய் வகையைப் புரிந்துகொண்டு இந்த டுடோரியலில் எங்களுக்காக வழங்குகின்றன, ஆனால் ஜூபிட்டருக்கு வெளியே இயங்கும் போது இந்த அம்சம் தானாக உங்களிடம் இல்லை. இருப்பினும், `` matplotlib.Figure`` வகுப்பில் காட்சிப்படுத்தல் மற்றும் காட்சிப்படுத்தல் ஆகிய இரண்டிற்கும் முறைகள் உள்ளன. புதிய சாளரத்தில் படத்தைத் திறக்க நீங்கள் திரும்பிய பொருளில் ``.ஷோ () `` ஐ அழைக்கலாம் (உங்கள் உள்ளமைக்கப்பட்ட மேட்லோட்லிப் பின்தளத்தில் ஊடாடும் என்று கருதி). அல்லது மாற்றாக, தற்போதைய பணி அடைவில் உள்ள `` out.png`` இல் படத்தை சேமிக்க ``.சேவ்ஃபிக் ('out.png') `` ஐ அழைக்கலாம். `` சேவ்ஃபிக் () `` முறை ஒரு பாதையை எடுக்கும், எனவே நீங்கள் வெளியீட்டைச் சேமிக்கும் இடம் மற்றும் கோப்பு பெயரை சரிசெய்யலாம்.
zh_tw: 當使用 plot_histogram() 函數時，它會返回一個 ``matplotlib.Figure`` 來呈現視覺化。Jupyter notebooks 知道該返回類型，並在本教程中為我們所用。但在 Jupyter 之外執行時，您無法自動擁有此功能。不過，``matplotlib.Figure`` 類擁有原生的視覺化顯示與存儲方法。您可以使用 ``plot_histogram()`` 返回對象中的 ``.show()`` ，以在新視窗中開啟圖片（假設您配置的 matplotlib 後端是可互動的）。或者，您也可以使用 ``.savefig('out.png')``，將圖片儲存至 ``out.png``。``savefig()`` 方法需要輸入一個路徑，因此您可以自定義存儲地址與文檔名。

source: Plot State
bn_bn: লেখচিত্রের অবস্থা
es_un: Graficar el Estado
fr_fr: Tracé de l'état
it_it: Visualizzare lo Stato
ja_jp: 状態のプロット
ko_kr: 상태 그리기
pt_br: Visualizando o Estado
ru: Отображение состояния
ta_in: பில்லா மாநிலம்
tr_tr: Hal Çizimi
zh_tw: 繪製狀態

source: In many situations you want to see the state of a quantum computer. This could be for debugging. Here we assume you have this state (either from simulation or state tomography) and the goal is to visualize the quantum state. This requires exponential resources, so we advise to only view the state of small quantum systems. There are several functions for generating different types of visualization of a quantum state
bn_bn: অনেকসময় আমরা কোয়ান্টাম কম্পিউটারের অবস্থা দেখতে চাই। প্রোগ্রাম ডিবাগ করতে এটা দরকার। এখানে আমরা অনুমান করছি যে আমাদের কাছে এই অবস্থাটি আছে (সিমুলেশন বা অবস্থার টোমোগ্রাফি থেকে) এবং লক্ষ্য হলো কোয়ান্টাম অবস্থার দৃশ্যায়ন করা। এটি প্রচুর পরিমাণ সময় ও অর্থ ব্যয় করে তাই সবসময় ছোট কোয়ান্টাম তন্ত্রের অবস্থা দেখা উচিত। এই অবস্থার বিভিন্ন রকমের দৃশ্যায়নের জন্য বিভিন্ন পদ্ধতি বানানো আছে
es_un: En muchas ocasiones, querrás ver el estado de una computadora cuántica. Para depurar tu código por ejemplo. Aquí asumimos que tienes un estado cuántico (ya sea por una simulación o por tomografía de estado) y que el objetivo es visualizarlo. Esto requiere una cantidad de recursos exponencial, por lo que aconsejamos visualizar únicamente el estado de pequeños sistemas cuánticos. Hay varias funciones para generar distintos tipos de visualización de un estado cuántico
fr_fr: Dans de nombreuses situations, vous voulez voir l'état de l'ordinateur quantique. Cela peut être pour le débogage. Nous supposons ici que vous avez cet état (obtenu par simulation ou tomographie d'état) et l'objectif est de visualiser l'état quantique. Cela nécessite des ressources exponentielles, donc nous conseillons de n'observer l'état que de petits systèmes quantiques. Il existe plusieurs fonctions permettant de générer différents types de visualisations d'un état quantique
id_id: Dalam banyak situasi Anda ingin melihat state dari komputer kuantum. Ini bisa untuk debugging. Di sini kita asumsikan Anda memiliki state ini (baik dari simulasi atau state tomografi) dan tujuannya adalah untuk visualisasi state kuantum. Hal ini membutuhkan eksponensial memori dan waktu, jadi kami menyarankan untuk hanya melihat state dari sistem kuantum kecil. Ada beberapa fungsi untuk menghasilkan jenis visualisasi berbeda dari state kuantum
it_it: In molte situazioni può essere utile visualizzare lo stato di un computer quantistico. Ad esempio in fase di debug. Supponiamo di avere un determinato stato quantistico (ad esempio risultato di una simulazione o di una tomografia quantistica) e di volerlo visualizzare. A tale scopo esistono diverse funzioni che permettono di generare diversi tipi di visualizzazione. Queste operazioni richiedono risorse esponenziali, per cui è sempre consigliato visualizzare solo lo stato di piccoli sistemi quantistici
ja_jp: 多くの状況において、量子コンピューターの状態を見たいことがあるでしょう。デバッグ用途などが考えられます。ここでは、ある状態（シミュレーションまたは状態トモグラフィーから得られたもの）があり、この量子状態を可視化することが目的であるものと仮定します。可視化には指数関数的なリソースが必要になるため、小さな量子システムの状態表示までに留めてください。量子状態のさまざまなタイプの可視化を生成するため、いくつかの関数があります。
ko_kr: 많은 경우에 양자 컴퓨터의 상태를 확인하길 원할 것이다. 디버깅을 위한 확인이 될 수 있다. 에를들어 시뮬레이션을 하거나 단층 촬영(state tomography) 의 상태를 가지고 있고, 그 양자 상태를 시각화하는 것이라고 가정해보자. 이 경우에는 많은 양의 연산이 필요하다, 따라서 작은 양자 시스템의 상태만을 보기를 권한다. 양자 상태를 다른 형태로 시각화하는 여러 함수가 존재한다.
pt_br: Em muitas situações, você quer ver o estado de um computador quântico. Isto pode ser para depuração. Aqui, assumimos que você tem este estado (seja da simulação ou da tomografia do estado) e o objetivo é visualizar o estado quântico. Isto requer recursos exponenciais, então, aconselhamos a ver apenas o estado de sistemas quânticos pequenos. Existem várias funções para gerar diferentes tipos de visualização de um estado quântico
ru: Во многих случаях вы захотите увидеть состояние квантового компьютера. Например, для отладки. Предположим, что это состояние уже есть (полученное путем симуляции или томографии) и теперь нужно его визуализировать. Требования к ресурсам при этом растут экспоненциально, поэтому рекомендуется просматривать состояния только малых квантовых систем. Существует несколько функций для различных типов визуализации квантового состояния
ta_in: பல சூழ்நிலைகளில் நீங்கள் ஒரு குவாண்டம் கணினியின் நிலையைக் காண விரும்புகிறீர்கள். இது பிழைத்திருத்தத்திற்காக இருக்கலாம். இங்கே இந்த நிலை உங்களிடம் இருப்பதாக நாங்கள் கருதுகிறோம் (உருவகப்படுத்துதல் அல்லது மாநில டோமோகிராஃபி இருந்து) மற்றும் குவாண்டம் நிலையைக் காண்பதே குறிக்கோள். இதற்கு அதிவேக வளங்கள் தேவை, எனவே சிறிய குவாண்டம் அமைப்புகளின் நிலையை மட்டுமே காண அறிவுறுத்துகிறோம். ஒரு குவாண்டம் நிலையின் பல்வேறு வகையான காட்சிப்படுத்தலை உருவாக்குவதற்கு பல செயல்பாடுகள் உள்ளன
tr_tr: Birçok durumda bir kuantum bilgisayarın durumunu görmek istersiniz. Bu hata ayıklama için olabilir. Burada bu duruma sahip olduğunuzu(simülasyon veya durum tomografisi) ve hedefin kuantum durumunu görselleştirmek olduğunu varsayıyoruz. Bu, üstel kaynaklar gerektirir, bu nedenle sadece küçük kuantum sistemlerinin durumunu görüntülemenizi öneririz. Bir kuantum durumun farklı görselleştirme türlerini oluşturmak için çeşitli işlevler vardır
zh_tw: 在多數情況下，您可能是爲了代碼除錯，會想看到量子計算機中的態。 我們假設你有這個量子態（無論是從模擬或是 state tomography 中得到），而我們希望將這量子態視覺化。這需要指數級的運算資源，因此我們建議只檢視小量子系統的狀態。有幾種不同的函數可用於實現量子態的視覺化

source: A quantum state is either a state matrix :math:`\rho` (Hermitian matrix) or statevector :math:`|\psi\rangle` (complex vector). The state matrix is related to the statevector by
bn_bn: একটি কোয়ান্টাম অবস্থা হয় একটি অবস্থা ম্যাট্রিক্স :math:`\rho` (হারমিসিয়ান ম্যাট্রিক্স) বা অবস্থা ভেক্টর :math:`|\psi\rangle` (জটিল ভেক্টর)। অবস্থা ম্যাট্রিক্স এবং অবস্থা ভেক্টরের সম্পর্ক হলো
es_un: Un estado cuántico es una matriz de estado :math:`\rho` (matriz hermitiana) o vector de estado :math:`|\psi\rangle` (vector complejo). La matriz de estado está relacionada con el vector de estado por
fr_fr: Un état quantique est soit une matrice d'état :math:`\rho ` (matrice hermitienne) ou un vecteur d'état :math:` | \psi\rangle ` (vecteur complexe). La matrice d'état est liée au vecteur d'état par
id_id: Suatu state kuantum adalah suatu state matriks :math:`\rho ` (matriks Hermitian) atau statevektor :math:` | \psi\rangle ` (vektor kompleks). State matriks berhubungan dengan statevector seperti
it_it: Uno stato quantistico può essere rappresentato come una matrice di stato :math:`\rho` (matrice Hermitiana) o come un vettore di stato :math:`|\psi\rangle` (un vettore complesso). La matrice è legata al vettore di stato da
ja_jp: 量子状態は、状態行列 :math:`\rho` (エルミート行列) または状態ベクトル :math:`|\psi\rangle` (複素ベクトル)で記述されます。状態行列は状態ベクトルと次式の関係にあります。
ko_kr: 양자 상태는 상태 행렬 :math:`\rho` (에르미트 행렬) 이나 상태벡터 :math:`|\psi\rangle` (복소 벡터) 중에 하나이다. 상태 행렬은 다음으로 상태벡터와 관련이 된다.
pt_br: Um estado quântico é uma matriz :math:`\rho` (matriz Hermitiana) ou um vetor de estado :math:`├\psi\rangle` (vetor complexo). A matriz densidade está relacionada ao vetor de estado por
ta_in: ஒரு குவாண்டம் நிலை என்பது ஒரு மாநில அணி: math: `\rho` (ஹெர்மிடியன் அணி) அல்லது மாநிலவெக்டர்: math:` | \ psi \rangle` (சிக்கலான திசையன்). மாநில அணி என்பது மாநிலவெக்டருடன் தொடர்புடையது
tr_tr: Kuantum durumu ya bir durum matrisidir :math:`\rho` (Hermisyen matris) ya da durum vektörüdür :math:`|\psi\rangle` (karmaşık vektör). Durum matrisi, durum vektörü ile şu şekilde ilişkilidir
zh_tw: 量子態由一個狀態矩陣 :math:`\rho` （Hermitian 矩陣）或狀態向量 :math:`|\psi\rangle` （複數向量）表示。狀態矩陣與狀態向量的關係是：

source: and is more general as it can represent mixed states (positive sum of statevectors)
bn_bn: এবং এটি আরো সাধারণ কারণ এটি মিশ্র অবস্থা দেখাতে পারে ( অবস্থা ভেক্টরগুলির ধনাত্মক যোগফল)
es_un: y es más general, ya que puede representar estados mixtos (suma positiva de vectores de estado)
fr_fr: et est plus général car il peut représenter des états mixtes (somme positive des vecteurs d'états)
id_id: dan lebih umum karena dapat mewakili state campuran (hasil penambahan positif dari statevectors)
it_it: ed è più generale in quanto può rappresentare stati misti (somma positiva dei vettori di stato)
ja_jp: そして、混合状態（状態ベクトルの正の和）で表すのが、より一般的です。
ko_kr: 그리고 일반적인 혼합 상태(mixed states) 도 (상태벡터의 양의 합으로) 나타낼 수 있다.
pt_br: e é mais geral, pois pode representar estados mistos (soma positiva de vetores de estado)
ru: и носит более общий характер, поскольку может представлять смешанные состояния (представимые иначе в виде положительной сумма векторов состояния)
ta_in: மேலும் பொதுவாகத் திகழ்கிறது இது கலந்த மாநிலங்களைக் குறிக்கும் (நேர்மையான கணக்கெடுப்புகளின் கூடுதலாக)
tr_tr: ve karışık (mixed) durumları (durum vektörlerinin pozitif toplamları) temsil edebileceğinden dolayı daha geneldir
zh_tw: 另有可以代表混合狀態（狀態向量的正數和）的更一般的形式：

source: The visualizations generated by the functions are:
bn_bn: এই ফাংশনগুলির দ্বারা বানানো দৃশ্যায়নগুলি হলো:
es_un: Las visualizaciones generadas por las funciones son:
id_id: Visualisasi yang dihasilkan oleh fungsi-fungsi tersebut adalah:
ja_jp: 関数によって生成される可視化は、以下のとおりです。:
ko_kr: 함수에 의해 시각화할 수 있는 것은 다음과 같다.
ru: К визуализациям, создаваемым функциями, относятся:
ta_in: செயற்பாடுகளால் உருவாக்கப்பட்ட விவசாயங்கள்:
tr_tr: İşlevler tarafından oluşturulan görselleştirmeler şunlardır:
zh_tw: 實現視覺化的函數有：

source: ``'plot_state_city'``: The standard view for quantum states where the real and imaginary (imag) parts of the state matrix are plotted like a city.
bn_bn: ``'plot_state_city'``: সাধারণত কোয়ান্টাম অবস্থার ছবিগুলো যেখানে অবস্থা ম্যাট্রিক্সের বাস্তব ও কাল্পনিক অংশগুলো শহরের বাড়ির মতো করে আঁকা।
es_un: ``'plot_state_city'``: La visualización estándar para los estados cuánticos donde las partes reales e imaginarias (imag) de la matriz de estado se grafican asemejando una ciudad.
id_id: ` ` ''plot_state_city ' ` `: Pandangan standar untuk state kuantum di mana bagian riil dan imajiner (imag) dari state matriks diplot seperti sebuah kota.
ja_jp: ``'plot_state_city'``: 状態行列の実部と虚部が都市のようにプロットされている、量子状態の標準的なビュー。
ko_kr: ``'plot_state_city'``: 상태 행렬의 실수와 허수 (imag) 부분이 도시의 건물과 같은 형태로 그려지는 양자 상태를 나타내는 표준적인 시각화.
ta_in: ` 'plot_state_city ' ` `: குவாண்ட் மாநிலங்களுக்கான நிலையான பார்வையாளர், மாநில மேட்ரிக்ஸின் உண்மையான மற்றும் கலாச்சார (imag) பகுதிகள் ஒரு நகரத்தைப் போல வரையறுக்கப்படுகின்றன.
tr_tr: ``'plot_state_city'``: Durum matrisinin gerçek ve sanal (imag) kısımlarının şehir gibi çizildiği kuantum durumlar için standart görünüm.
zh_tw: ``'plot_state_city'``：量子狀態的標準視圖，量子態矩陣的實部與虛部（imag）將繪製成像城市一樣。
