Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/2_plotting_data_*_qiskit.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_br, ru, ta_in, tr_tr, zh_tw

source: Interactive State Plots for Jupyter Notebooks
fr_fr: Tracés d'état interactifs pour les notebooks Jupyter
it_it: Visualizzazione interattiva degli stati nei Notebook Jupyter
ja_jp: Jupyter Notebook でのインタラクティブな状態プロット
ko_kr: 주피터 노트북 용 상호작용하는 상태 그래프
pt_br: Visualização interativa dos estados para Notebooks Jupyter
tr_tr: Jupyter Not Defteri için Etkileşimli Durum Grafikleri

source: Just like with ``plot_histogram()`` there is a second set of functions for each of the functions to plot the quantum state. These functions have the same name but with a prepended ``i``:
fr_fr: Comme pour ` ` plot_histogram () ` ` il y a un deuxième set de fonctions pour chacune des fonctions afin d'afficher tracer l'état quantique. Ces fonctions portent le même nom mais avec un préfixe ` ` i ` `:
it_it: Proprio come con la funzione ``plot_histogram()`` esiste un secondo set di funzioni per ciascuna delle funzione appena descritte che permette di tracciare lo stato quantistico interattivamente. Queste funzioni hanno lo stesso nome ma con l'aggiunta di una ``i`` davanti:
ja_jp: ``plot_histogram()`` と同じように、量子状態をプロットする関数ごとに、2番目の関数があります。 これらの関数の名前は同じですが、先頭に ``i`` が追加されます。
ko_kr: ``plot_histogram()``와 같이 양자 상태를 그리기 위한 다른 함수 집합이 있다. 이런 함수는 동일한 이름을 가지지만, ``i``를 접두어로 가진다:
pt_br: Assim como na função ``plot_histogram()``, há um segundo conjunto de funções para cada uma das funções de visualização do estado quântico. Estas funções têm o mesmo nome, mas com um ``i`` na frente:
tr_tr: Tıpkı ``plot_histogram()`` gibi, kuantum durumunu çizmek için her bir işlev için ikinci bir işlev kümesi vardır. Bu işlevler aynı ada sahiptir, ancak başına bir ``i`` eklidir:

source: These functions are made using an externally hosted JS library for use in Jupyter notebooks. The interactive plot can only be used if you’re running inside a Jupyter notebook and only if you have external connectivity to the host with the JS library. If you use these functions outside of a Jupyter notebook it will fail.
ja_jp: これらの関数は、Jupyter Notebook で使用するために外部でホストされた JSライブラリを使用して作成されます。インタラクティブなプロットは Jupyter Notebook 内での実行かつ、JSライブラリを使用しホストに外部接続している場合のみ使用できます。Jupyter Notebook 外でこれらの関数を使用すると失敗するでしょう。

source: Plot Bloch Vector
bn_bn: ব্লক ভেক্টরের লেখচিত্র
es_un: Gráfica del Vector de Bloch
fr_fr: Tracer le vecteur de Bloch
id_id: Gambar Bloch Vector
it_it: Visualizzazione del vettore di Bloch
ja_jp: ブロッホ・ベクトルのプロット
ko_kr: 블로흐(Bloch) 벡터 그리기
pt_br: Visualizando vetores Bloch
ru: Отображение вектора Блоха
ta_in: பிளாக் பிளாக் வெக்டர்
tr_tr: Bloch Vektörü Çizimi
zh_tw: 繪製 Bloch 向量圖

source: A standard way of plotting a quantum system is using the Bloch vector. This only works for a single qubit and takes as input the Bloch vector.
bn_bn: কোয়ান্টাম সিস্টেম লেখচিত্র বানানোর একটি সাধারণ পদ্ধতি হলো ব্লক ভেক্টরের মাধ্যমে। এটা কেবল একটা কিউবিটের ক্ষেত্রে কাজ করে এবং ইনপুটরূপে একটা ব্লক ভেক্টর নেয়।
es_un: Una forma estándar de trazar un sistema cuántico es usar el vector de Bloch. Esto sólo funciona para un solo qubit y toma como entrada el vector de Bloch.
fr_fr: Une façon standard d'afficher un système quantique est d'utiliser le vecteur de Bloch. Ceci ne fonctionne que pour un seul qubit et prend en paramètre d'entrée le vecteur de Bloch.
id_id: Cara yang standar untuk gambar sistem kuantum adalah menggunakan vektor Bloch. Ini hanya bisa untuk qubit tunggal dan mengambil vektor Bloch sebagai input.
it_it: Un modo standard di visualizzare un sistema quantistico è quello di utilizzare il vettore di Bloch. Questa visualizzazione funziona solo per un singolo qubit e si aspetta come input il vettore di Bloch.
ja_jp: 量子系をプロットする標準的な方法は、ブロッホ・ベクトルを使用することです。ブロッホ・ベクトルを入力値とするこの方法は、単一の量子ビットにしか適用できません。
ko_kr: 양자 시스템을 그리는 표준적인 방법은 블로흐 (Bloch) 벡터를 사용하는 것이다. 이는 하나의 큐비트에 대해서만 동작하고, 블로흐 벡터를 입력으로 받는다.
pt_br: Uma maneira padrão de visualizar um sistema quântico é usando um vetor de Bloch. Isto só funciona para um único qubit e recebe como entrada o vetor de Bloch.
ru: Нагляднее всего изобразить состояние квантовой системы с помощью вектора Блоха. Однако это работает только для одного кубита и принимает в качестве входных данных вектор Блоха.
ta_in: வலைப்பதிவொன்றின் ஒரு நிலையான வழி வலைப்பதிவுகளைப் பயன்படுத்தி வலைப்பதிவுகளைப் பயன்படுத்தி வருகின்றது. இது ஒரு குறும்படத்துக்கு மட்டுமே வேலை செய்கிறது மற்றும் பிளாக் வெக்டரை உள்ளீட்டை எடுத்துக்கொள்கிறது.
tr_tr: Bir kuantum sistemi çizmenin standart bir yolu Bloch vektörünü kullanmaktır. Bu sadece tek bir kübit için çalışır ve Bloch vektörünü girdisi olarak alır.
zh_tw: 一個繪製量子系統的標準方法是使用 Bloch 向量。 這只適用於單一量子位元 ，並以 Bloch 向量作爲輸入。

source: The Bloch vector is defined as :math:`[x = \mathrm{Tr}[X \rho], y = \mathrm{Tr}[Y \rho], z = \mathrm{Tr}[Z \rho]]`, where :math:`X`, :math:`Y`, and :math:`Z` are the Pauli operators for a single qubit and :math:`\rho` is the state matrix.
bn_bn: ব্লক ভেক্টরকে এভাবে সংজ্ঞায়িত করা হয় :math:`[x = \mathrm{Tr}[X \rho], y = \mathrm{Tr}[Y \rho], z = \mathrm{Tr}[Z \rho]]`, যেখানে :math:`X`, :math:`Y`, এবং :math:`Z` হলো একটি কিউবিটের পাউলি অপারেটর (Pauli operator) এবং :math:`\rho` হলো স্টেট ম্যাট্রিক্স।
es_un: El vector de Bloch se define como :math:`[x = \masthrm{Tr}[X \rho], y = \mathrm{Tr}[Y \rho], z = \mathrm{Tr}[Z \rho]] `, donde :math:`X`, :math:`Y`, y :math:`Z` son los operadores de Pauli para un único qubit y :math:`\rho` es la matriz de estado.
fr_fr: Le vecteur de Bloch est défini comme :math:` [ x = \mathrm{Tr}[ X \rho ], y = \mathrm{Tr}[ Y \rho ], z = \mathrm{Tr}[ Z \rho ] ] `, où :math:` X `, :math:` Y `, et :math:` Z ` sont les opérateurs de Pauli pour un seul qubit et :math:`\rho ` est sa matrice d'état.
id_id: Vektor Bloch didefinisikan sebagai :math:` [x = \mathrm{Tr}[X \rho], y = \mathrm{Tr}[Y \rho], z = \mathrm{Tr}[Z \rho]] `, di mana :math:` X `, :math:` Y `, dan :math:` Z ` adalah operator Pauli untuk satu qubit tunggal dan :math:`\rho ` adalah state matriks.
it_it: Il vettore di Bloch è definito come :math:`[x = \mathrm{Tr}[X \rho], y = \mathrm{Tr}[Y \rho], z = \mathrm{Tr}[Z \rho]]`, dove :math:`X`, :math:`Y`, e :math:`Z` sono gli operatori Pauli per un singolo qubit e :math:`\rho` è la matrice di densità.
ja_jp: ブロッホ・ベクトルは :math:`[x = \mathrm{Tr}[X \rho], y = \mathrm{Tr}[Y \rho], z = \mathrm{Tr}[Z \rho]]` として定義されます。:math:`X`、:math:`Y` および :math:`Z` は単一量子ビットのパウリ演算子、:math:`\rho` は状態行列です。
ko_kr: 블로흐 벡터는 :math:`[x = \mathrm{Tr}[X \rho], y = \mathrm{Tr}[Y \rho], z = \mathrm{Tr}[Z \rho]]`로 정의되고, 여기서 :math:`X`, :math:`Y`, :math:`Z`는 하나의 큐비트에 대한 파울리 (Pauli) 연산자이고, :math:`\rho`는 상태 행렬이다.
pt_br: O vetor de Bloch é definido como :math:`[x = \mathrm{Tr}[X \rho], y = \mathrm{Tr}[Y \rho], z = \mathrm{Tr}[Z \rho]]`, onde :math:`X`, :math:`Y`, e :math:`Z` são os operadores de Pauli para um único qubit e :math:`\rho` é a matriz `de estado.
ta_in: ப்ளொச் திசையன் பின்வருமாறு வரையறுக்கப்படுகிறது: கணிதம்: `[x = th math {Tr} [X \ rho], y = \ math {Tr} [Y \ rho], z = \ math {Tr} [Z \ rho]] `, எங்கே: math:` X` ,: math: `Y`, மற்றும்:math:` Z` ஆகியவை ஒற்றை குவிட்டிற்கான பவுலி ஆபரேட்டர்கள் மற்றும்: கணிதம்: `\rho` என்பது மாநில அணி.
tr_tr: Bloch vektörü şu şekilde tanımlanır :math:`[x = \mathrm{Tr}[X \rho], y = \mathrm{Tr}[Y \rho], z = \mathrm{Tr}[Z \rho]]`, burada :math:`X`, :math:`Y`, ve :math:`Z` tek bir kübit için Pauli operatörleridir ve :math:`\rho` durum matrisidir.
zh_tw: Bloch 向量的定義為 :math:`[x = \mathrm{Tr}[X \rho], y = \mathrm{Tr}[Y \rho], z = \mathrm{Tr}[Z \rho]]`，其中 :math:`X`，:math:`Y` 和 :math:`Z` 是單量子位元的 Pauli 運算子，而 :math:`\rho` 是量子態矩陣。

source: Options for plot_bloch_vector()
bn_bn: plot\_bloch\_vector() এর অপশনগুলো নিম্নরূপ
es_un: Opciones para plot_bloch_vector()
id_id: Opsi untuk plot_bloch_vector ()
ja_jp: plot_bloch_vector() のオプション
ru: Опции для plot_bloch_vector()
ta_in: Plot_ bloch_vector () க்கு விருப்பங்கள்
zh_tw: plot_bloch_vector() 的選項

source: **figsize** (tuple): Figure size in inches (width, height).
bn_bn: **figsize** (tuple): ইঞ্চি এককে লেখচিত্রের আকার (দৈর্ঘ্য, প্রস্থ)।
es_un: **figsize** (tuple): Tamaño de la figura en pulgadas (ancho, alto).
fr_fr: ** figsize** (n-uplet): taille du diagramme en pouces (largeur, hauteur).
id_id: ** figsize** (tuple): ukuran figur dalam inci (lebar, tinggi).
it_it: **figsize** (tuple): definisce la dimensione della figura in pollici (larghezza, altezza).
ja_jp: **figsize** (tuple): 図のサイズ。単位はインチ (幅, 高さ)。
ko_kr: **figsize** (tuple): 인치로 나타낸 그림 크기 (너비, 높이).
pt_br: **figsize** (tupla): tamanho da figura em polegadas (largura, altura).
ru: **figsize** (tuple): размер в дюймах (ширина, высота).
ta_in: ** figsize** (tuple): அங்குல அளவு (அகலம், உயரம்).
tr_tr: **figsize** (tuple): İnç olarak şekil boyutu (genişlik, yükseklik).
zh_tw: **figsize** (tuple)：圖片尺寸（英吋）（寬度，高度）。

source: Adjusting the output from plot_bloch_vector()
bn_bn: plot\_bloch\_vector() এর থেকে পাওয়া ফলাফলকে সাজানো
es_un: Ajustando la salida de plot_bloch_vector()
id_id: Menyesuaikan output dari plot_bloch_vector()
ja_jp: plot_bloch_vector() の出力の調整
ru: Настройка вывода функции plot_bloch_vector()
ta_in: Plot_ bloch_vector () இருந்து வெளியீட்டை கட்டுப்படுத்துகிறது
zh_tw: 調整 plot_bloch_vector() 的輸出

source: When using the ``plot_bloch_vector`` function it returns a ``matplotlib.Figure`` for the rendered visualization. Jupyter notebooks understand this return type and render it for us in this tutorial, but when running outside of Jupyter you do not have this feature automatically. However, the ``matplotlib.Figure`` class natively has methods to both display and save the visualization. You can call ``.show()`` on the returned object to open the image in a new window (assuming your configured matplotlib backend is interactive). Or alternatively you can call ``.savefig('out.png')`` to save the figure to ``out.png`` in the current working directory. The ``savefig()`` method takes a path so you can adjust the location and filename where you’re saving the output.
bn_bn: ``plot_bloch_vector`` ফাংশন একটি ``matplotlib.Figure`` ফেরত পাঠায় যেটি দৃশ্যায়নটিকে বানায়। এই শিক্ষনীতে জুপিটার নোটবুক এই জিনিসটি চিনতে পারে এবং আমাদের জন্য ফলাফল ছবিটি এঁকে দেয়। কিন্তু জুপিটারের বাইরে এই সুবিধাটি নিজে থেকে আসে না। ``matplotlib.Figure`` এই ক্লাসটির মধ্যে ছবি আঁকার ও দৃশ্যায়নটি সংরক্ষণ করার দুই পদ্ধতিই লেখা আছে। প্রয়োজনমতো এর ফলাফলের উপর ``.show()`` ফাংশন ডেকে অন্য একটি উইন্ডোতে ছবিটি দেখা যেতে পারে(যদি matplotlib এর ব্যাকএন্ড পারস্পরিক ক্রিয়াশীল থাকে)। অথবা ``.savefig('out.png')`` ফাংশন ডেকে ছবিটি ``out.png`` নামে বর্তমান ডিরেক্টরিতে সংরক্ষণ করা যেতে পারে। ``savefig()`` পদ্ধতিটি একটি পথ নেয় যাতে কোথায় কি নামে ছবিটি সংরক্ষণ হচ্ছে সেটা আমরা নিয়ন্ত্রণ করতে পারি।
es_un: Al usar la función ``plot_bloch_vector``, se devuelve un objeto de clase ``matplotlib.Figure`` para la visualización renderizada. Los cuadernos de Jupyter entienden este tipo de objeto y hacen el render dentro de este tutorial, pero al correr la función fuera de Jupyter no se tiene esta capacidad automáticamente. Sin embargo, la clase ``matplotlib.Figure`` tiene métodos nativos para mostrar y guardar la visualización. Puedes llamar al método ``.show()`` en el objeto devuelto para abrir la imagen en una nueva ventana (asumiendo el backend de matplotlib que tienes configurado es interactivo). O alternativamente, puedes llamar a ``.savefig('out.png')`` para guardar la figura a ``out.png`` en el directorio de trabajo actual. El método ``savefig()`` tiene de entrada una ruta para que puedas ajustar la ubicación y nombre del archivo donde estés guardando la salida.
id_id: Ketika menggunakan ` ` plot_bloch_vector ` ` ` fungsi itu mengembalikan ` `matplotlib.Figure ` ` ` untuk visualisasi yang dirender. Jupyter notebook memahami jenis return ini dan merender untuk di tutorial ini, tapi ketika berjalan di luar Jupyter Anda tidak memiliki fitur ini secara otomatis. Namun, kelas natif ` `matplotlib.Figure ` ` ` memiliki metode untuk kedua tampilan dan menyimpan visualisasi. Anda dapat memanggil ` `.show () ` ` pada objek yang dikembalikan untuk membuka gambar dalam jendela baru (asumsikan backend matplotlib anda yang dikonfigurasi adalah interaktif). Atau secara alternatif anda dapat memanggil ` `.savefig( 'out.png') ` ` untuk menyimpan figur ke ` `out.png ` ` di direktori kerja saat ini. ` ` savefig () ` ` ` metode mengambil argumen sebuah path sehingga Anda dapat menyesuaikan lokasi dan nama file di mana Anda menyimpan output.
ja_jp: 視覚化のために ``plot_bloch_vector`` 関数を呼び出した場合の返り値は ``matplotlib.Figure`` です。Jupyter notebook は返り値の型を理解するので、このチュートリアルでは表示されますが、Jupyter 以外で実行する場合にはこの機能は自動的には使えません。``matplotlib.Figure`` クラス自体は視覚化されたものを表示、保存する機能をもともと持っています。返されたオブジェクトに対して ``.show()`` を呼び出すとイメージが新しいウィンドウで開きます (このときmatplotlib バックエンドをインタラクティブに設定していることを想定) 。あるいは ``.savefig('out.png')`` で 図を ``out.png`` に保存できます。 ``savefig()`` メソッドはパスを引数に取り、保存しようとしている図の場所やファイル名を指定できます。
ta_in: எந்தவொரு மாநில சதி செயல்பாடுகளையும் பயன்படுத்தும் போது, ​​காண்பிக்கப்பட்ட காட்சிப்படுத்தலுக்கு `` மேட்லோட்லிப். ஜூபிட்டர் நோட்புக்குகள் இந்த வருவாய் வகையைப் புரிந்துகொண்டு இந்த டுடோரியலில் எங்களுக்காக வழங்குகின்றன, ஆனால் ஜூபிட்டருக்கு வெளியே இயங்கும் போது இந்த அம்சம் தானாக உங்களிடம் இல்லை. இருப்பினும், `` matplotlib.Figure`` வகுப்பில் காட்சிப்படுத்தல் மற்றும் காட்சிப்படுத்தல் ஆகிய இரண்டிற்கும் முறைகள் உள்ளன. புதிய சாளரத்தில் படத்தைத் திறக்க நீங்கள் திரும்பிய பொருளில் ``.ஷோ () `` ஐ அழைக்கலாம் (உங்கள் உள்ளமைக்கப்பட்ட மேட்லோட்லிப் பின்தளத்தில் ஊடாடும் என்று கருதி). அல்லது மாற்றாக, தற்போதைய பணி அடைவில் உள்ள `` out.png`` இல் படத்தை சேமிக்க ``.சேவ்ஃபிக் ('out.png') `` ஐ அழைக்கலாம். `` சேவ்ஃபிக் () `` முறை ஒரு பாதையை எடுக்கும், எனவே நீங்கள் வெளியீட்டைச் சேமிக்கும் இடம் மற்றும் கோப்பு பெயரை சரிசெய்யலாம்.
zh_tw: 當使用 ``plot_bloch_vector`` 函數時，它會返回一個 ``matplotlib.Figure`` 來呈現視覺化。Jupyter notebooks 知道該返回類型，並在本教程中為我們所用。但在 Jupyter 之外執行時，您無法自動擁有此功能。不過，``matplotlib.Figure`` 類擁有原生的視覺化顯示與存儲方法。您可以使用 ``plot_histogram()`` 返回對象中的 ``.show()`` ，以在新視窗中開啟圖片（假設您配置的 matplotlib 後端是可互動的）。或者，您也可以使用 ``.savefig('out.png')``，將圖片儲存至 ``out.png``。``savefig()`` 方法需要輸入一個路徑，因此您可以自定義存儲地址與文檔名。

source: The ``plot_histogram()`` has a few options to adjust the output graph. The first option is the ``legend`` kwarg. This is used to provide a label for the executions. It takes a list of strings use to label each execution's results. This is mostly useful when plotting multiple execution results in the same histogram. The ``sort`` kwarg is used to adjust the order the bars in the histogram are rendered. It can be set to either ascending order with ``asc`` or descending order with ``dsc``. The ``number_to_keep`` kwarg takes an integer for the number of terms to show, the rest are grouped together in a single bar called rest. You can adjust the color of the bars with the ``color`` kwarg which either takes a string or a list of strings for the colors to use for the bars for each execution. You can adjust whether labels are printed above the bars or not with the ``bar_labels`` kwarg. The last option available is the ``figsize`` kwarg which takes a tuple of the size in inches to make the output figure.
fr_fr: ` ` plot_histogram () ` ` a quelques options pour ajuster le graphique de sortie. La première option est la variable nommée présente (kwarg) ` ` legend ` `. Cette valeur est utilisée pour fournir un libellé pour les exécutions. Elle utilise une une liste de chaînes de caractères pour identifier les résultats de chaque exécution. Ceci est surtout utile lors du traçage de plusieurs résultats d'exécution dans le même histogramme. La variable nommée ` ` trier ` ` est utilisée pour ajuster l'ordre des barres dans l'histogramme. Elle peut être définie par ordre croissant avec ` ` asc ` ` ou par ordre décroissant avec ` ` dsc ` `. La variable nommée ` ` number_to_keep ` ` prend un entier pour le nombre de termes à afficher, les autres sont regroupés dans une seule barre appelé reste. Vous pouvez ajuster la couleur des barres avec la variable nommée ` ` couleur ` ` qui prend une chaîne de caractères ou une liste de chaînes de caractères pour les couleurs à utiliser pour les barres pour chaque exécution. Vous pouvez ajuster si les libellés sont imprimés au-dessus des barres ou non avec la variable ` ` bar_labels ` `. La dernière option disponible est la variable ` ` figsize ` ` qui prend un n-uplet de la taille en pouces pour créer le diagramme en sortie.
it_it: La funzione ``plot_histogram()`` ha diversi parametri che permettono di personalizzare il grafico che si sta creando. Il primo parametro è il kwarg ``legend``, utilizzato per aggiungere etichette ai risultati di diverse esecuzioni. Il parametro si aspetta una lista di stringhe che utilizza per aggiungere le etichette ai risultati di ogni esecuzione. Questa opzione è molto utile quando si vogliono rappresentare più risultati nello stesso istogramma. Il kwarg ``sort`` viene invece usato per regolare l'ordine in cui le diverse barre dell'istogramma vengono visualizzate. Può essere impostato in ordine crescente con ``asc`` o in ordine decrescente con ``dsc``. Si può anche definire il numero di esecuzioni da visualizzare con il parametro kwarg ``number_to_keep``, che si aspetta un intero, il resto dei risultati viene raggruppato in una singola barra chiamata rest (altro). È possibile regolare il colore delle barre con il kwarg ``color`` che si aspetta come parametro una stringa o una lista di stringhe con i colori da usare per ogni esecuzione. Anche la posizione stessa della legenda è modificabile con il parametro kwarg ``bar_labels``. Infine, l'ultima opzione disponibile è il kwarg ``figsize`` che richiede una tupla che indica la dimensione del grafico di output espressa in pollici.
ko_kr: ``plot_histogram()``은 결과를 조정하는 몇 가지 옵션이 있다. 첫 번째 옵션은 ``legend`` 입력(kwarg) 이다. 이 옵션은 실행에 대한 레이블을 제공하는데 사용된다. 이는 각 실행의 결과에 레이블을 다는데 사용되는 문자열의 목록을 이용한다. 이는 보통 동일한 히스토그램에 여러 개의 실행 결과를 그릴 때 유용하게 사용된다. ``sort`` 입력은 히스토그램의 막대들이 그려지는 순서를 조정할 때 사용된다. ``asc``로 증가되는 순서를 명시하거나, ``dsc``로 감소되는 순서를 명시할 수 있다. ``number_to_keep`` 입력은 보여줄 단어의 수를 결정한다. 만약 단어가 이 숫자보다 크다면, 나머지는 레스트 (rest) 로 명시되는 하나의 막대로 그룹지어진다. ``color`` 입력은 각 실행에 대한 막대의 색을 명시하기 위해서 색을 명시하는 색이나 색으로 된 목록을 전달할 수 있다. ``bar_labels`` 입력으로 레이블이 막대의 위에 나타날지 여부를 조정할 수 있다. 마지막 옵션은 ``figsize`` 입력으로, 출력 그림의 크기를 인치 (inch) 단위로 나타낸다.
pt_br: A função ``plot_histogram()`` tem algumas opções para ajustar o gráfico desenhado. A primeira opção é o kwarg ``legend``. Esta é usada para fornecer um rótulo para as execuções. Ela recebe uma lista de strings usadas para rotular os resultados de cada execução. Isto é útil, principalmente, ao desenhar múltiplos resultados de execução no mesmo histograma. O kwarg ``sort`` é usado para ajustar a ordem na qual as barras no histograma são apresentadas. Ele pode ser definido ou para uma ordem ascendente com ``asc`` ou para uma ordem decrescente com ``dsc``. O kwarg ``number_to_keep`` recebe um inteiro para o número de termos a serem mostrados, o resto é agrupado em uma única barra chamada resto. Você pode ajustar a cor das barras com o kwarg ``color`` que recebe uma sequência de caracteres ou uma lista de opções para as cores a serem usadas nas barras para cada execução. Você pode ajustar se os rótulos são impressos acima das barras ou não, com o kwarg ``bar_labels``. A última opção disponível é o kwarg ``figsize`` que leva uma tupla do tamanho em polegadas para fazer a figura de saída.
tr_tr: ``plot_histogram()`` çıktı grafiğini ayarlamak için birkaç seçeneğe sahiptir. İlk seçenek ``legend`` anahtar kelime argümanıdır. Bu, yürütmeler için bir etiket sağlamak için kullanılır. Her yürütmenin sonuçlarını etiketlemek için kullanılan dizelerin bir listesini alır. Bu çoğunlukla aynı histogramda birden fazla yürütme sonucu çizilirken kullanışlıdır. ``sort`` anahtar kelime argümanı, histogramdaki çubukların oluşturulma sırasını ayarlamak için kullanılır. ``asc`` ile artan veya ``dsc`` ile azalan sırada ayarlanabilir. ``number_to_keep`` anahtar kelime argümanı, gösterilecek terimlerin sayısı için bir tamsayı alır, diğerleri kalan olarak adlandırılan tek bir çubukta gruplanır. Çubukların rengini, her bir yürütme için çubuklar için kullanılacak renklerin bir dizesini veya dizelerin listesini alan ``color`` anahtar kelime argümanı ile ayarlayabilirsiniz. Etiketlerin çubukların üzerine yazdırılıp yazdırılmayacağını ``bar_labels`` anahtar kelime argümanı ile ayarlayabilirsiniz. Mevcut son seçenek, çıkış rakamını oluşturmak için inç cinsinden bir veri grubu olarak alan ``figsize`` anahtar kelime argümanıdır.

source: Using the output from plot\_histogram()
fr_fr: Utilisation de la sortie de plot\_histogram ()
it_it: Utilizzo dell'output di plot\_histogram ()
ko_kr: plot\_histogram()에서 출력된 시각화 사용하기
pt_br: Usando a saída da função plot\_histogram()
tr_tr: plot\_histogram() işlevinin çıktısını kullanma
