Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/2_plotting_data_*_qiskit.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_br, ru, ta_in, tr_tr, zh_tw

source: The ``plot_histogram()`` has a few options to adjust the output graph. The first option is the ``legend`` kwarg. This is used to provide a label for the executions. It takes a list of strings used to label each execution's results. This is mostly useful when plotting multiple execution results in the same histogram. The ``sort`` kwarg is used to adjust the order the bars in the histogram are rendered. It can be set to either ascending order with ``asc`` or descending order with ``desc``. The ``number_to_keep`` kwarg takes an integer for the number of terms to show, the rest are grouped together in a single bar called rest. You can adjust the color of the bars with the ``color`` kwarg which either takes a string or a list of strings for the colors to use for the bars for each execution. You can adjust whether labels are printed above the bars or not with the ``bar_labels`` kwarg. The last option available is the ``figsize`` kwarg which takes a tuple of the size in inches to make the output figure.
ru: ` ` plot_histogram () ` ` имеет несколько опций для настройки выходного графика. Первый вариант-это "легенда" "kwarg". Используется для предоставления метки для выполнений. Он принимает список строк, используемых для подписи результатов каждого выполнения. Это в основном полезно при планировании нескольких результатов выполнения в одной гистограмме. Для регулировки порядка отображения столбцов в гистограмме используется ` ` сорт ` ` kwarg. Его можно задать либо в порядке возрастания, либо в порядке убывания, либо в порядке убывания ` ` desc ` `. ` ` number_to_keept ` ` kwarg принимает целое число для числа терминов, которые нужно показать, остальные группируются в одном столбике под названием rest. Вы можете настроить цвет решетки с помощью ` ` color ` ` kwarg, который либо принимает строку, либо список строк для цветов, которые будут использоваться для столбцов для каждого выполнения. Можно настроить, печатаются ли метки над решетками, а не с ` ` bar_labels ` ` kwarg. Последним вариантом может быть ` ` figsize ` ` kwarg, который принимает кортеж размером в дюймах, чтобы сделать выходную фигуру.
