Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/2_plotting_data_*_qiskit.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_br, ru, ta_in, tr_tr, zh_tw

source: When using the plot\_histogram() function it returns a ``matplotlib.Figure`` for the rendered visualization. Jupyter notebooks understand this return type and render it for us in this tutorial, but when running outside of Jupyter you do not have this feature automatically. However, the ``matplotlib.Figure`` class natively has methods to both display and save the visualization. You can call ``.show()`` on the returned object from ``plot_histogram()`` to open the image in a new window (assuming your configured matplotlib backend is interactive). Or alternatively you can call ``.savefig('out.png')`` to save the figure to ``out.png``. The ``savefig()`` method takes a path so you can adjust the location and filename where you're saving the output.
fr_fr: Lorsque vous utilisez la fonction plot\_histogram (), elle renvoie un ` `matplotlib.Figure ` pour la visualisation. Les notebooks Jupyter comprennent ce type de reponse et en font la présentation pour nous dans ce tutoriel, mais en dehors de Jupyter, vous n'avez pas cette fonctionnalité automatiquement. Cependant, la classe ` `matplotlib.Figure ` a des méthodes natives pour l'affichage et la sauvegarde de la visualisation. Vous pouvez appeler ` ` .show () ` ` sur l'objet retourné de ` ` plot_histogram () ` ` pour ouvrir l'image dans une nouvelle fenêtre (en supposant que votre backend matplotlib configuré est interactif). Ou bien vous pouvez appeler ` `.savefig('out.png') ` ` pour sauvegarder le diagramme dans ` `out.png ` `. La méthode ` ` savefig () ` ` accepte un paramètre de chemin pour que vous puissiez ajuster l'emplacement et le nom de fichier où vous enregistrez la sortie.
it_it: La funzione plot\_histogram() restituisce una istanza di ``matplotlib.Figure`` per la visualizzazione. I notebook Jupyter riconoscono questo tipo di istanza e rendono, come in questo tutorial, la visualizzazione automatica. Questa funzionalità non è automaticamente presente quando non si utilizzano i notebook Jupyter. Tuttavia, la classe ``matplotlib.Figure`` possiede nativamente dei metodi che permettono di mostrare e di salvare la visualizzazione. Usando il metodo ``.show()`` sull'oggetto risultato del comando ``plot_histogram()`` è possibile aprire l'immagine in una nuova finestra (assumendo che il backend configurato di matplotlib sia interattivo). Usando invece il metodo ``.savefig('out.png')`` è possibile salvare l'immagine in ``out.png``. Il parametro richiesto dal metodo ``savefig()`` corrisponde al path e al nome del file dove si vuole salvare l'immagine di output.
ko_kr: Plot\_histogram() 함수를 사용할 때 주어진 시각화에 대해서 ``matplotlib.Figure``을 반환한다. 주피터 노트북은 이 반환 형식을 이해하고, 노트북에서 볼 수 있도록 출력을 하지만, 주피터 외부에서 실행할 때는 자동적으로 출력되지는 않는다. 그러나 ``matplotlib.Figure`` 클라스는 시각화를 출력하고 저장하는 방법이 있다. 새로운 창에 이미지를 나타내기 위해서는 ``plot_histogram()``에서 반환되는 객체에 ``.show()``을 호출할 수 있다 (설정된 matplotlib 처리 장치가 쌍방향적일때 가능). 다른 방법으로는 ``.savefig('out.png')``을 호출하여 그림을 ``out.png``으로 저장할 수 있다. ``savefig()`` 메소드는 출력 위치를 입력으로 받고, 사용자가 원하는 위치와 파일 이름을 조정할 수 있다.
pt_br: Ao usar a função plot\_histogram(), a mesma retorna uma ``matplotlib.Figure`` para a visualização renderizada. Os notebooks do Jupyter entendem este tipo de retorno e renderizam-no para nós, neste tutorial, mas quando estiver executando fora do Jupyter você não tem esse recurso, automaticamente. No entanto, a classe ``matplotlib.Figure`` nativamente tem métodos para exibir e salvar a visualização. Você pode chamar ``.show()`` no objeto retornado de ``plot_histogram()`` para abrir a imagem em uma nova janela (supondo que seu backend de matplotlib configurado seja interativo). Ou, alternativamente, você pode chamar ``.savefig('out.png')`` para salvar a figura em ``out.png``. O método ``savefig()`` recebe um caminho, então, você pode ajustar o local e o nome do arquivo onde está salvando a saída.

source: **plot\_state\_city()** options
it_it: Le opzioni di **plot\_state\_city()**
ko_kr: **plot\_state\_city()** 옵션
pt_br: Opções da função **plot\_state\_city()**
tr_tr: **plot\_state\_city()** seçenekleri

source: **plot\_state\_hinton()** options
it_it: Le opzioni di **plot\_state\_hinton()**
ko_kr: **plot\_state\_hinton()** 옵션
pt_br: Opções da função **plot\_state\_hinton()**
tr_tr: **plot\_state\_hinton()** seçenekleri

source: **plot\_state\_paulivec()** options
it_it: Le opzioni di **plot\_state\_paulivec()**
ko_kr: **plot\_state\_paulivec()** 옵션
pt_br: Opções da função **plot\_state\_paulivec()**
tr_tr: **plot\_state\_paulivec()** seçenekleri

source: **plot\_state\_qsphere()** options
it_it: Le opzioni di **plot\_state\_qsphere()**
ko_kr: **plot\_state\_qsphere()** 옵션
pt_br: Opções da função **plot\_state\_qsphere()**
tr_tr: **plot\_state\_qsphere()** seçenekleri

source: **plot\_bloch\_multivector()** options
fr_fr: ** plot\_bloch\_multivecteur () * * options
it_it: Le opzioni di **plot\_bloch\_multivector()**
ko_kr: **plot\_bloch\_multivector()** 옵션
pt_br: Opções da função **plot\_bloch\_multivector()**
tr_tr: **plot\_bloch\_multivector()** seçenekleri

source: When using any of the state plotting functions it returns a ``matplotlib.Figure`` for the rendered visualization. Jupyter notebooks understand this return type and render it for us in this tutorial, but when running outside of Jupyter you do not have this feature automatically. However, the ``matplotlib.Figure`` class natively has methods to both display and save the visualization. You can call ``.show()`` on the returned object to open the image in a new window (assuming your configured matplotlib backend is interactive). Or alternatively you can call ``.savefig('out.png')`` to save the figure to ``out.png`` in the current working directory. The ``savefig()`` method takes a path so you can adjust the location and filename where you're saving the output.
fr_fr: Lors de l'utilisation des fonctions de visualisation d'état, elles retournent un ` `matplotlib.Figure ` pour la visualisation. Les notebooks Jupyter comprennent ce type de paramètre retourné et sont utilisés par ce tutoriel, mais en dehors de Jupyter, vous n'avez pas cette fonctionnalité automatiquement. Cependant, la classe ` `matplotlib.Figure ` a des méthodes pour l'affichage et la sauvegarde de la visualisation. Vous pouvez appeler ` ` .show () ` ` sur l'objet retourné pour ouvrir l'image dans une nouvelle fenêtre (en supposant que votre backend matplotlib configuré est interactif). Ou encore, vous pouvez appeler ` `.savefig('out.png') ` ` pour enregistrer le diagramme` `out.png ` ` dans le répertoire de travail en cours. La méthode ` ` savefig () ` ` accepte un chemin en paramètre afin que vous puissiez ajuster l'emplacement et le nom de fichier en sortie.
it_it: L'utilizzo di una qualsiasi di queste funzioni restituisce un'istanza ``matplotlib.Figure`` per la visualizzazione. I notebook Jupyter riconoscono questo tipo di istanza e la visualizzazione avviene in automatico, come in questo tutorial. Nel caso in cui lo stesso codice venisse utilizzato fuori da Jupyter, si perderebbe questa funzionalità di visualizzazione automatica. Tuttavia, la classe ``matplotlib.Figure`` possiede nativamente dei metodi che permettono di mostrare e di salvare la visualizzazione. Usando il metodo ``.show()`` è possibile aprire l'immagine in una nuova finestra (assumendo che il backend configurato di matplotlib sia interattivo). Usando invece il metodo ``.savefig('out.png')`` è possibile salvare l'immagine come ``out.png`` nella cartella di lavoro. Il parametro del metodo ``savefig()`` corrisponde al path e al nome del file e permette di decidere dove si vuole salvare l'immagine di output.
ko_kr: 우리가 양자 상태를 그리는 함수를 사용할 때, 그려진 시각화의 결과로 ``matplotlib.Figure``를 반환한다. 주피터 노트북은 반환 형식을 이해하고, 노트북에 자동으로 그린다. 하지만 주피터 외부에서 구동할 때는 이 기능이 자동으로 실행되지는 않는다. 그러나 ``matplotlib.Figure`` 클라스는 시각화를 출력하고 저장하는 방법이 있다. 새로운 창에 이미지를 나타내기 위해서 ``.show()``을 이용하여 호출할 수 있다 (설정된 matplotlib 처리 장치가 쌍방향적일때 가능). 다른 방법으로는 ``.savefig('out.png')``을 호출하여 그림을 ``out.png``으로 현디랙토리에 저장할 수 있다. ``savefig()`` 메소드는 출력 위치를 입력으로 받고, 사용자가 원하는 위치와 파일 이름을 조정할 수 있다.
pt_br: Ao usar qualquer uma das funções de visualização de estado, retorna uma ``matplotlib.Figure`` para a visualização renderizada. Os notebooks do Jupyter entendem este tipo de retorno e renderizam-no para nós, neste tutorial, mas quando estiver executando, fora do Jupyter, você não tem esse recurso, automaticamente. No entanto, a classe ``matplotlib.Figure`` , nativamente, tem métodos para exibir e salvar a visualização. Você pode chamar ``.show()`` no objeto retornado para abrir a imagem em uma nova janela (supondo que o backend de matplotlib configurado seja interativo). Ou, como alternativa, você pode chamar ``.savefig('out.png')`` para salvar a figura em ``out.png`` no diretório de trabalho atual. O método ``savefig()`` recebe um caminho para que você possa ajustar o local e o nome do arquivo onde está salvando a saída.
ru: Все функции, отображающие состояние, возвращают ``matplotlib.Figure`` для дальнейшей визуализации. Блокноты Jupyter распознают данный тип и выводят изображение, но при работе вне Jupyter этого не происходит автоматически. Однако, класс ``matplotlib.Figure`` имеет встроенные методы отображения и сохранения визуализации. Применение ``.show()`` к полученному объекту открывает изображение в новом окне (если сконфигурированный бэкенд matplotlib бэкэнд интерактивен). Для его сохранения под названием ``out.png`` в текущем рабочем каталоге следует использовать ``.savefig('out.png')``. В ``savefig()`` можно задать как имя, так и путь к файлу.
tr_tr: Durum çizim işlevlerinden herhangi birini kullanırken, görüntülenen görselleştirme için bir ``matplotlib.Figure`` döndürür. Jupyter not defteri bu dönüş türünü anlıyor ve bu eğitimde bizim için oluşturuyor, ancak Jupyter dışında çalışırken bu özelliğe otomatik olarak sahip değilsiniz. Bununla birlikte, ``matplotlib.Figure`` sınıfı yerel olarak görselleştirmeyi görüntüleme ve kaydetme yöntemlerine sahiptir. Görüntüyü yeni bir pencerede açmak için döndürülen nesnede ``.show()`` öğesini çağırabilirsiniz (yapılandırılmış matplotlib arka ucunuzun etkileşimli olduğu varsayılarak). Veya alternatif olarak, figürü geçerli çalışma dizinindeki ``out.png`` konumuna kaydetmek için ``.savefig('out.png')`` 'yi çağırabilirsiniz. ``savefig()`` yöntemi, çıktıyı kaydettiğiniz konumu ve dosya adını ayarlayabilmenizi sağlar.

source: These functions are made using an externally hosted JS library for use in Jupyter notebooks. The interactive plot can only be used if you're running inside a Jupyter notebook and only if you have external connectivity to the host with the JS library. If you use these functions outside of a Jupyter notebook it will fail.
fr_fr: Ces fonctions sont contenues dans une bibliothèque JS externe pour les notebooks Jupyter. Le tracé interactif ne peut être utilisé que si vous êtes à l'intérieur d'un bloc-notes Jupyter et uniquement si vous avez une connectivité avec l'hôte qui execute la bibliothèque JS. Si vous utilisez ces fonctions en dehors d'un bloc-notes Jupyter, cela ne fonctionnera pas.
it_it: Queste funzioni sono realizzate utilizzando una libreria JS esterna che ne permette l'utilizzo nei notebook Jupyter. Il grafico interattivo può essere utilizzato solo all'interno di un notebook Jupyter e solo se si dispone di una connettività verso l'host che espone la libreria JS. Non è possibile utilizzare queste funzioni fuori da un notebook Jupyter.
ko_kr: 이런 함수들은 주피터 노트북에 사용되기 위해서 외부에 호스팅되는 JS 라이브러리를 사용하여 만들어진다. 상호적인 그림은 주피터 노트북 내에서 구동되고, JS 라이브러리를 가진 외부 호스트에 연결이 있는 때에만 사용될 수 있다. 주피터 노트북 외부에서 이 함수들을 사용하면 실패할 것이다.
pt_br: Essas funções são feitas usando uma biblioteca JS hospedada externamente para uso em notebooks Jupyter. O gráfico interativo só pode ser usado se você estiver rodando dentro de um notebook Jupyter e, somente, se você tiver conectividade externa ao host com a biblioteca JS. Se você usar essas funções fora de um notebook Jupyter elas não funcionarão.
tr_tr: Bu işlevler Jupyter not defterinde kullanılmak üzere harici olarak barındırılan bir JS kütüphanesi kullanılarak yapılır. Etkileşimli çizim yalnızca bir Jupyter not defteri içinde çalışıyorsanız ve yalnızca JS kütüphanesi ile ana bilgisayara harici bağlantınız varsa kullanılabilir. Bu işlevleri bir Jupyter not defteri dışında kullanırsanız başarısız olur.

source: Options for plot\_bloch\_vector()
fr_fr: Options pour plot\_bloch\_vector()
it_it: Le opzioni di plot\_bloch\_vector()
ko_kr: plot\_bloch\_vector()의 옵션들
pt_br: Opções para a função plot\_bloch\_vector()
tr_tr: plot\_Bloch\_vector() için seçenekler

source: Adjusting the output from plot\_bloch\_vector()
fr_fr: Ajuster le résultat de plot\_bloch\_vector()
it_it: Come regolare l'output di plot\_bloch\_vector()
ko_kr: plot\_bloch\_vector() 에서의 출력 조정하기
pt_br: Ajustando a saída da função plot\_bloch\_vector()
tr_tr: plot\_bloch\_vector() 'den çıktıyı ayarlama

source: When using the ``plot_bloch_vector`` function it returns a ``matplotlib.Figure`` for the rendered visualization. Jupyter notebooks understand this return type and render it for us in this tutorial, but when running outside of Jupyter you do not have this feature automatically. However, the ``matplotlib.Figure`` class natively has methods to both display and save the visualization. You can call ``.show()`` on the returned object to open the image in a new window (assuming your configured matplotlib backend is interactive). Or alternatively you can call ``.savefig('out.png')`` to save the figure to ``out.png`` in the current working directory. The ``savefig()`` method takes a path so you can adjust the location and filename where you're saving the output.
fr_fr: Lors de l'utilisation de ``plot_bloch_vector``, la fonction renvoie un ` `matplotlib.Figure ` pour la visualisation. Les notebooks Jupyter comprennent ce type de paramètre retourné et sont utilisés par ce tutoriel, mais en dehors de Jupyter, vous n'avez pas cette fonctionnalité automatiquement. Cependant, la classe ` `matplotlib.Figure ` a des méthodes pour l'affichage et la sauvegarde de la visualisation. Vous pouvez appeler ` ` .show () ` ` sur l'objet retourné pour ouvrir l'image dans une nouvelle fenêtre (en supposant que votre backend matplotlib configuré est interactif). Ou encore, vous pouvez appeler ` `.savefig('out.png') ` ` pour enregistrer le diagramme` `out.png ` ` dans le répertoire de travail en cours. La méthode ` ` savefig () ` ` accepte un chemin en paramètre afin que vous puissiez ajuster l'emplacement et le nom de fichier en sortie.
it_it: L'utilizzo della funzione ``plot_bloch_vector`` restituisce un'istanza ``matplotlib.Figure`` per la visualizzazione. I notebook Jupyter riconoscono questo tipo di istanza e la visualizzazione avviene in automatico, come in questo tutorial. Nel caso in cui lo stesso codice venisse utilizzato fuori da Jupyter, si perderebbe questa funzionalità di visualizzazione automatica. Tuttavia, la classe ``matplotlib.Figure`` possiede nativamente dei metodi che permettono di mostrare e di salvare la visualizzazione. Usando il metodo ``.show()`` è possibile aprire l'immagine in una nuova finestra (assumendo che il backend configurato di matplotlib sia interattivo). Usando invece il metodo ``.savefig('out.png')`` è possibile salvare l'immagine come ``out.png`` nella cartella di lavoro. Il parametro del metodo ``savefig()`` corrisponde al path e al nome del file e permette di decidere dove si vuole salvare l'immagine di output.
ko_kr: ``plot_bloch_vector`` 함수를 사용할 때, 그려진 시각화의 결과로 ``matplotlib.Figure``를 반환한다. 주피터 노트북은 반환 형식을 이해하고, 노트북에 자동으로 그린다. 하지만 주피터 외부에서 구동할 때는 이 기능이 자동으로 실행되지는 않는다. 그러나 ``matplotlib.Figure`` 클라스는 시각화를 출력하고 저장하는 방법이 있다. 새로운 창에 이미지를 나타내기 위해서 ``.show()``을 이용하여 호출할 수 있다 (설정된 matplotlib 처리 장치가 쌍방향적일때 가능). 다른 방법으로는 ``.savefig('out.png')``을 호출하여 그림을 ``out.png``으로 현디랙토리에 저장할 수 있다. ``savefig()`` 메소드는 출력 위치를 입력으로 받고, 사용자가 원하는 위치와 파일 이름을 조정할 수 있다.
pt_br: Ao usar a função ``plot_bloch_vector``, ela retorna uma ``matplotlib.Figure`` para a visualização renderizada. Notebooks Jupyter entendem este tipo de retorno e renderizam ele para nós, nesse tutorial, mas quando estiver executando fora do Jupyter você não possuirá esse recurso, automaticamente. No entanto, a classe ``matplotlib.Figure`` possui nativamente métodos para exibir e salvar a visualização. Você pode chamar ``.show()`` no objeto retornado para abrir a imagem em uma nova janela (assumindo que o seu backend configurado de matplotlib seja interativo). Alternativamente, você pode chamar ``.savefig('out.png')`` para salvar a figura em ``out.png`` no diretório atual. O método ``savefig()`` recebe um caminho, então, você pode ajustar o local e o nome do arquivo em que está salvando a saída.
ru: Функция ``plot_bloch_vector`` возвращает ``matplotlib.Figure`` для дальнейшей визуализации. Блокноты Jupyter распознают данный тип и выводят изображение, но при работе вне Jupyter этого не происходит автоматически. Однако, класс ``matplotlib.Figure`` имеет встроенные методы отображения и сохранения визуализации. Применение ``.show()`` к полученному объекту открывает изображение в новом окне (если сконфигурированный бэкенд matplotlib бэкэнд интерактивен). Для его сохранения под названием ``out.png`` в текущем рабочем каталоге следует использовать ``.savefig('out.png')``. В ``savefig()`` можно задать как имя, так и путь к файлу.
tr_tr: ``plot_bloch_vector`` işlevini kullanırken, görüntülenen görselleştirme için bir ``matplotlib.Figure`` döndürür. Jupyter not defteri bu dönüş türünü anlıyor ve bu eğitimde bizim için oluşturuyor, ancak Jupyter dışında çalışırken bu özelliğe otomatik olarak sahip değilsiniz. Bununla birlikte, ``matplotlib.Figure`` sınıfı yerel olarak görselleştirmeyi görüntüleme ve kaydetme yöntemlerine sahiptir. Görüntüyü yeni bir pencerede açmak için döndürülen nesnede ``.show()`` öğesini çağırabilirsiniz (yapılandırılmış matplotlib arka ucunuzun etkileşimli olduğu varsayılarak). Veya alternatif olarak, figürü geçerli çalışma dizinindeki ``out.png`` konumuna kaydetmek için ``.savefig('out.png')`` 'yi çağırabilirsiniz. ``savefig()`` yöntemi, çıktıyı kaydettiğiniz konumu ve dosya adını ayarlayabilmenizi sağlar.

source: ``plot_histogram(data)``
bn_bn: ``plot_histogram(data)`` ফাংশনটি বানানো হয়েছে।
fr_fr: ` ` plot_histogramme (données) ` `
ta_in: சதி_ஹிஸ்டோகிராம் (தரவு)
tr_tr: ``plot_histogram(veri)``

source: The visualizations generated by the functions are: - ``'plot_state_city'``: The standard view for quantum states where the real and imaginary (imag) parts of the state matrix are plotted like a city.
fr_fr: Les visualisations générées par les fonctions sont:-` 'plot_state_city'` `: la vue standard des états quantiques où les parties réelles et imaginaires (imag) de la matrice d'état sont dessinés comme une ville.
it_it: Le visualizzazioni generate dalle funzioni sono: - ``'plot_state_city'``: La vista standard degli stati quantistici dove la parte reale ed immaginaria (imag) vengono rappresentate come una città.
pt_br: As visualizações geradas pelas funções são: - ``'plot_state_city'``: Visualização padrão para estados quânticos, em que as partes, reais e imaginárias (imag), da matriz densidade são traçadas como uma cidade.

source: The ``plot_histogram()`` has a few options to adjust the output graph. The first option is the ``legend`` kwarg. This is used to provide a label for the executions. It takes a list of strings use to label each execution’s results. This is mostly useful when plotting multiple execution results in the same histogram. The ``sort`` kwarg is used to adjust the order the bars in the histogram are rendered. It can be set to either ascending order with ``asc`` or descending order with ``desc``. The ``number_to_keep`` kwarg takes an integer for the number of terms to show, the rest are grouped together in a single bar called rest. You can adjust the color of the bars with the ``color`` kwarg which either takes a string or a list of strings for the colors to use for the bars for each execution. You can adjust whether labels are printed above the bars or not with the ``bar_labels`` kwarg. The last option available is the ``figsize`` kwarg which takes a tuple of the size in inches to make the output figure.
bn_bn: ``plot_histogram()`` এর থেকে প্রাপ্ত লেখচিত্রগুলি সাজানোর জন্য কিছু বিকল্প আছে। প্রথম বিকল্প হলো ``legend`` কীওয়ার্ড আর্গুমেন্ট (kwarg)। এর কাজ হলো ফলাফলের নাম (লেবেল) দেওয়া। এটা একটা নামের তালিকা নিয়ে প্রত্যেকটি ফলাফলের আলাদা আলাদা নাম (লেবেল) দেয়। যখন একই হিস্টোগ্রামে অনেকগুলো ফলাফল একসঙ্গে দেখানো হয় তখন এটা খুবই কাজে লাগে। ``sort`` কীওয়ার্ড আর্গুমেন্ট (kwarg) এর সাহায্যে হিস্টোগ্রামের স্তম্ভগুলি মানের ক্রমানুসারে সাজানো যায়। ক্রমবর্ধমান বা ক্রমহাসমান নির্দেশ করা যায় যথাক্রমে ``asc`` ও ``desc`` এর সাহায্যে। ``number_to_keep`` কীওয়ার্ড আর্গুমেন্ট (kwarg) এর কাজ হলো কতগুলো ফল এক করে দেখাবে, যদি এই সংখ্যা মোট ফলাফল সংখ্যার চেয়ে কম হয় তখন বাকি ফলগুলো একসঙ্গে "rest" নামক একটি স্তম্ভে দেখানো হয়। স্তম্ভগুলির রং ``color`` কীওয়ার্ড আর্গুমেন্ট (kwarg) এর সাহায্যে নির্বাচন করা যায়। সব স্তম্ভে এক রং দিতে চাইলে একটি রং এর নাম বা প্রত্যেক স্তম্ভে আলাদা আলাদা রং চাইলে রঙের নামের তালিকা পাঠানো যায়। স্তম্ভের নামগুলি স্তম্ভের উপরে না নিচে দেখাবে তা ঠিক করা যায় ``bar_labels`` কীওয়ার্ড আর্গুমেন্ট (kwarg) এর সাহায্যে। শেষ বিকল্পটি হলো ``figsize`` কীওয়ার্ড আর্গুমেন্ট (kwarg) যার কাজ একটি টাপল এর মাধ্যমে অন্তিম চিত্রটির আকার ইঞ্চি এককে নেওয়া।
es_un: La función ``plot_histogram()`` tiene algunas opciones para ajustar la gráfica de salida. La primera opción es el argumento kwarg llamado ``legend``. Se utiliza para proporcionar una etiqueta para las ejecuciones. Se necesita una lista de cadenas que se utilizan para etiquetar los resultados de cada ejecución. Esto es sobre todo útil cuando se grafican varios resultados de ejecución en el mismo histograma. El kwarg llamado ``sort`` se usa para ajustar el orden en que se representan las barras en el histograma. Se puede configurar en orden ascendente con ``asc`` o en orden descendente con ``desc``. El kwarg ``number_to_keep`` toma un número entero para el número de términos a mostrar, el resto se agrupa en una sola barra llamada resto. Puedes ajustar el color de las barras con el kwarg ``color`` que toma una cadena o una lista de cadenas para los colores que se utilizarán para las barras para cada ejecución. Puedes ajustar si las etiquetas se imprimen encima de las barras o no con el kwarg ``bar_labels``. La última opción disponible es el kwarg ``figsize`` que toma una tupla con el tamaño en pulgadas para hacer la figura de salida.
zh_tw: ``plot_histogram()`` 有幾個選項可調整輸出圖片。第一個選項是 ``legend``，可用來為執行結果添加標籤。它的輸入是一系列用於標示每個執行結果的字串。它在同一個直方圖中繪製多個執行結果時十分好用。``sort`` 可用來調整直方圖中的長條的呈現順序。它可以用 ``asc`` 設為升序或 ``desc`` 降序。``number_to_keep`` 可輸入一個整數表示需要顯示的項目數量。其餘的則會在一個稱為 rest 的單一條欄中集中顯示。您可以使用 ``color`` 來調整長條的顏色。它需要輸入一個或一組字串，以用於設置每一個執行結果的長條顔色。 您可以用 ``bar_labels`` 選擇標籤是否顯示在長條上方。最後一個可以設置選項是 ``figsize``。它需要輸入一個以英寸為單位的元組作爲圖片尺寸，來製作輸出圖。

source: Plot Histogram
ru: Отображение гистограммы
