Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/3_summary_of_quantum_operations.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja, ko_kr, pt_br, ru, sw_ke, ta, tr

source: where :math:`a` and :math:`b` are complex numbers constrained such that :math:`U^\dagger U = I` for all :math:`0\leq\theta\leq\pi` and :math:`0\leq \phi<2\pi`. This gives 3 constraints and as such :math:`a\rightarrow -e^{i\lambda}\sin(\theta/2)` and :math:`b\rightarrow e^{i\lambda+i\phi}\cos(\theta/2)` where :math:`0\leq \lambda<2\pi` giving
bn_bn: যেখানে :math:`a` এবং :math:`b` এমন জটিল সংখ্যা যা :math:`U^\dagger U = I` সমস্ত :math:`0\leq\theta\leq\pi` এবং :math:`0\leq \phi<2\pi` এর জন্য সীমাবদ্ধ। এটি 3 টি সীমাবদ্ধতা (কনস্ট্রেইন্টস) দেয় এবং যেমন :math:`a\rightarrow -e^{i\lambda}\sin(\theta/2)` এবং :math:`b\rightarrow e^{i\lambda+i\phi}\cos(\theta/2)` যেখানে :math:`0\leq \lambda<2\pi` দেয়
es_un: donde :math:`a` y :math:`b` son números complejos restringidos, tales que :math:`U^\dagger U = I` para todo :math:`0\leq\theta\leq\pi` y :math:`0\leq \phi<2\pi`. Esto da tres restricciones y como tal :math:`a\rightarrow -e^{i\lambda}\sin(\theta/2)` y :math:`b\rightarrow e^{i\lambda+i\phi}\cos(\theta/2)` donde :math:`0\leq \lambda<2\pi` dando por resultado
fr_fr: où :math:`a` et :math:`b` sont des nombres complexes contraints tels que :math:`U^\dagger U = I` pour tous les :math:`0\leq\theta\leq\pi` et :math:`0\leq \phi<2\pi`. Cela donne 3 contraintes et donc :math:`a\rightarrow -e^{i\lambda}\sin(\theta/2)` et :math:`b\rightarrow e^{i\lambda+i\phi}\cos(\theta/2)` où :math:`0\leq \lambda<2\pi` qui donnent
id_id: dimana :math:` a ` dan :math:` b ` adalah bilangan kompleks dengan batasan berupa :math:` U ^ \dagger U = I ` untuk semua :math:` 0\leq\theta \leq\pi ` dan :math:` 0\leq \phi <2\pi `. Ini memberikan 3 batasan dan sebagai seperti :math:` a\rightarrow -e ^ {i\lambda} \sin (\theta/2) ` dan :math:` b\rightarrow e ^ {i\lambda + i\phi} \cos (\theta/2) ` dimana :math:` 0\leq \lambda \lambda <2\pi ` menghasilkan
it_it: dove :math:`a` e :math:`b` sono numeri complessi che verificano :math:`U^\dagger U = I` per ogni :math:`0\leq\theta\leq\pi` e :math:`0\leq \phi<2\pi`. Questo introduce 3 vincoli, e tali che :math:`a\rightarrow -e^{i\lambda}\sin(\theta/2)` e :math:`b\rightarrow e^{i\lambda+i\phi}\cos(\theta/2)` con :math:`0\leq \lambda<2\pi` arrivando a
ja: ここでの :math:`a` および :math:`b` は、すべての :math:`0\leq\theta\leq\pi` および :math:`0\leq \phi<2\pi` に対して :math:`U^\dagger U = I` となるような制約を持つ複素数です。これにより３つの制約が与えられ、:math:`0\leq \lambda<2\pi` において :math:`a\rightarrow -e^{i\lambda}\sin(\theta/2)` および :math:`b\rightarrow e^{i\lambda+i\phi}\cos(\theta/2)` となり、次式が得られます。
ko_kr: 여기서 임의로 주어진 :math:`0\leq\theta\leq\pi` 와 :math:`0\leq\phi<2\pi` 에 대해 :math:`a` 와 :math:`b` 는 :math:`U^\dagger U=I` 를 만족하는 복소수이다. 이는 세가지 제약 조건을 제공하며 이를 만족하는 :math:`a` 와 :math:`b` 는 :math:`0\leq\lambda<2\pi` 를 이용하여 :math:`a\rightarrow -e^{i\lambda}\sin(\theta/2)` 와 :math:`b\rightarrow e^{i\lambda+i\phi}\cos(\theta/2)` 로 표현할 수 있다. 따라서
pt_br: onde :math:`a` e :math:`b` são números complexos condicionados, tais que :math:`U^\dagger U = I` para todo :math:`0\leq\theta\leq\pi` e :math:`0\leq \phi<2\pi`. Isto fornece três condições, de modo que :math:`a\rightarrow -e^{i\lambda}\sin(\theta/2)` e :math:`b\rightarrow e^{i\lambda+i\phi}\cos(\theta/2)`, onde :math:`0\leq \lambda<2\pi` resultando em
ru: где :math:`a` и :math:`b` — комплексные числа, удовлетворяющие условию :math:`U^\dagger U = I` при любых :math:`0\leq\theta\leq\pi` и :math:`0\leq \phi<2\pi`. Это задает три ограничения, из чего следует, что :math:`a\rightarrow -e^{i\lambda}\sin(\theta/2)` и :math:`b\rightarrow e^{i\lambda+i\phi}\cos(\theta/2)` при :math:`0\leq \lambda<2\pi`, а в целом
sw_ke: pale ambapo :math:`a` na :math:`b` ni namba changamani zilizozuiliwa hivi kwamba :math:`U^\dagger U = I` kwa :math:`0\leq\theta\leq\pi` na :math:`0\leq \phi<2\pi`. Hii inatupa vizuizi 3 na kwa hivyo :math:`a\rightarrow -e^{i\lambda}\sin(\theta/2)` na :math:`b\rightarrow e^{i\lambda+i\phi}\cos(\theta/2)` pale ambapo :math:`0\leq \lambda<2\pi` hivyo kutupa
ta: :math:`a` and :math:`b` எனும் சிக்கல் எண்கள் :math:`U^\dagger U = I` for all :math:`0\leq\theta\leq\pi` and :math:`0\leq \phi<2\pi`. இது 3 கட்டுப்பாட்டுகள் மற்றும் :math:`a\rightarrow-e^{i\lambda}\sin(\theta/2)` and :math:`b\rightarrow e^{i\lambda+i\phi}\cos(\theta/2)` where :math:`0\leq\lambda<2\pi` giving
tr: burada :math:`a` ve :math:`b` kısıtlanmış karmaşık sayılardır, öyle ki :math:`U^\dagger U = I` tüm :math:`0\leq\theta\leq\pi` ve :math:`0\leq \phi<2\pi` için. Bu 3 kısıtlama verir ve şöyle :math:`a\rightarrow -e^{i\lambda}\sin(\theta/2)` ve :math:`b\rightarrow e^{i\lambda+i\phi}\cos(\theta/2)` burada :math:`0\leq \lambda<2\pi`

source: This is the most general form of a single qubit unitary.
bn_bn: এটি একটি একক কিউবিট ঐকিকের (ইউনিটারি) সর্বাধিক সাধারণ রূপ।
es_un: Esta es la forma más general de una compuerta unitaria para un solo qubit.
fr_fr: Il s'agit de la forme la plus générale d'un qubit unitaire/unique.
id_id: Ini adalah bentuk paling umum dari unitary untuk satu qubit.
it_it: Questa è la forma più generale di un operatore unitario che agisce su un singolo qubit.
ja: これは単一量子ビットユニタリの最も一般的な形式です。
ko_kr: 이는 단일 큐비트에 작용되는 유니터리의 가장 일반적인 형태이다.
pt_br: Esta é a forma mais geral da unitária de um único qubit.
ru: Это наиболее распространенная форма представления однокубитной унитарной операции.
sw_ke: Hii ndiyo aina ya jumla/kawaida zaidi ya matrix ya umoja ya qubit moja.
ta: இது மிகவும் பொதுவான வடிவம் ஒரே விரைவான தனிமங்களாகும்.
tr: Bu, tek bir kübit üniter matrisin en genel biçimidir.

source: Single-Qubit Gates
bn_bn: একক-কিউবিট যুক্তিবর্তনীগুলি (গেইট)
es_un: Compuertas de un solo qubit
fr_fr: Portes à un seul Qubit
id_id: Gate Qubit Tunggal
it_it: Gate a singolo qubit
ja: 単一量子ビットゲート
ko_kr: 단일 큐비트 게이트
pt_br: Portas de um qubit
ru: Однокубитные вентили
sw_ke: Malango ya Qubit Moja
ta: ஒற்றை-க்யூபிட் கேட்ஸ்
tr: Tek-Kübit Kapıları

source: The single-qubit gates available are: - u gates - Identity gate - Pauli gates - Clifford gates - :math:`C3` gates - Standard rotation gates
fr_fr: Les portes (gates) mono-qubit disponibles sont: - u gates - Identity gate - Pauli gates - Clifford gates - :math:`C3` gates - Standard rotation gates
id_id: Gate qubit tunggal yang tersedia adalah:- gate u - gate Identity - gate Pauli - gate Clifford- :math:` C3 ` gates- gate standar rotasi
it_it: I gate a singolo qubit disponibili possono essere divisi in: - gate u - gate identità - gate di Pauli - gate di Clifford - gate :math:`C3` - gate standard di rotazione
pt_br: As portas de um qubit disponíveis são: - u gates - Identity gate - Pauli gates - Clifford gates - :math:`C3` gates - Standard rotation gates
sw_ke: Malango ya kwanta yenye qubit moja yanayopatikana ni: - malango ya u - lango la Identity - malango ya Pauli - malango ya Clifford - malango ya :math:`C3` - malango ya mizunguko sanifu (Standard rotation)

source: We have provided a backend: ``unitary_simulator`` to allow you to calculate the unitary matrices.
bn_bn: একক ম্যাট্রিক্সগুলো গণনার জন্য আমরা ``unitary_simulator`` নামক একটি ব্যাকএন্ড সরবরাহ করেছি।
es_un: Hemos provisto un backend: ``unitary_simulator`` que te permite calcular las matrices unitarias.
fr_fr: Nous avons fourni un backend : ``unitary_simulator`` pour vous permettre de calculer les matrices unitaires.
id_id: Kami telah menyediakan sebuah backend: ` ` unitary_simulator ` ` untuk memungkinkan Anda menghitung matriks unitary.
it_it: Il backend ``unitary_simulator`` è a disposizione per calcolare le matrici unitarie.
ja: ユニタリ行列を計算するためのバックエンドである ``unitary_simulator`` が用意されています。
ko_kr: 우리는 이러한 유니터리 행렬 계산이 가능하도록 해 주는 백엔드: ``unitary_simulator`` 를 제공한다.
pt_br: Fornecemos um backend: ``unitary_simulator`` para permitir calcular as matrizes unitárias.
ru: Использование бэкенда ``unitary_simulator`` позволяет найти унитарную матрицу для каждого из них.
sw_ke: Tumetayarisha backend: ``unitary_simulator`` ili kukuruhusu kukokotoa matriki ya umoja.
ta: நாங்கள் ஒரு பின்னணி வழங்கியுள்ளது: ` ` unitary_simulator ` ` unitary matrices கணக்கிட அனுமதிக்கிறது.
tr: Üniter matrisleri hesaplamanıza izin vermek için bir arka uç sağladık: ``unitary_simulator``.

source: u gates
fr_fr: portes U
id_id: gate u
it_it: Gate u
pt_br: Portas u
sw_ke: malango ya u

source: In Qiskit we give you access to the general unitary using the :math:`u3` gate
bn_bn: Qiskit-এ আমরা :math:`u3` যুক্তিবর্তনী ব্যবহার করে আপনাকে সাধারণ এককের (জেনারেল ইউনিটারি) প্রবেশাধিকার দেই।
fr_fr: Dans Qiskit nous vous donnons accès à l'unicité générale en utilisant la porte :math:`u3`
id_id: Dalam Qiskit kami memberikan Anda akses ke unitary umum melalui gate :math:` u3 `
it_it: All'interno del Qiskit si può usare il gate unitario generico tramite il gate :math:`u3`
pt_br: No Qiskit nós lhe damos acesso à unitária geral usando a porta :math:`u3`
sw_ke: Katika Qiskit, tunakupa ufikiaji kwa matriki ya jumla ya umoja kwa kutumia lango la :math:`u3`

source: The :math:`u2(\phi, \lambda) =u3(\pi/2, \phi, \lambda)` gate has the matrix form
bn_bn: :math:`u2(\phi, \lambda) =u3(\pi/2, \phi, \lambda)` যুক্তিবর্তনীর (গেইট) ম্যাট্রিক্স রূপ হল
fr_fr: La porte :math:`u2(\phi, \lambda) =u3(\pi/2, \phi, \lambda)` a la forme de la matrice
id_id: Gate :math:` u2 (\phi, \lambda) = u3 (\pi/2, \phi, \lambda) ` memiliki bentuk matriks
it_it: Il gate :math:`u2(\phi, \lambda) =u3(\pi/2, \phi, \lambda)` ha la seguente forma matriciale
pt_br: A porta :math:`u2(\phi, \lambda) =u3(\pi/2, \phi, \lambda)` tem a forma matricial
sw_ke: Lango la :math:`u2(\phi, \lambda) =u3(\pi/2, \phi, \lambda)` lina matrix yenye muundo wa

source: This is a useful gate as it allows us to create superpositions.
bn_bn: এটি একটি দরকারী যুক্তিবর্তনী কারণ এটি আমাদের উপরিপাতন (সুপারপজিশন) তৈরি করতে দেয়।
fr_fr: C'est une porte utile car elle nous permet de créer des superpositions.
id_id: Ini adalah gerbang yang berguna untuk menciptakan superposisi.
it_it: Questo gate è molto utile perché permette di creare sovrapposizioni.
pt_br: Esta é uma porta útil, já que nos permite criar superposições.
sw_ke: Lango hili ini muhimu kwani linatuwezesha kuunda superpositions.

source: The :math:`u1(\lambda)= u3(0, 0, \lambda)` gate has the matrix form
fr_fr: La porte :math:` u1 (\lambda) = u3 (0, 0, \lambda) a la forme matricielle
id_id: Gate :math:` u1 (\lambda) = u3 (0, 0, \lambda) ` memiliki bentuk matriks
it_it: Il gate :math:`u1(\lambda)= u3(0, 0, \lambda)` ha la seguente forma matriciale
pt_br: A porta :math:`u1(\lambda)= u3(0, 0, \lambda)` tem a forma matricial

source: u1(\lambda) = \begin{pmatrix} 1 & 0 \\ 0 & e^{i \lambda} \end{pmatrix},
fr_fr: u1(\lambda) = \start{pmatrix} & 0 \\ 0 & e^{i \lambda} \end{pmatrix},

source: which is useful as it allows us to apply a quantum phase.
bn_bn: এটি কার্যকর কারণ এটি আমাদের কোয়ান্টাম দশা প্রয়োগ করতে দেয়।
es_un: la cuál es útil ya que nos permite aplicar una fase cuántica.
fr_fr: qui est utile car il nous permet d'appliquer une phase quantique.
id_id: yang berguna untuk menerapkan fase kuantum.
it_it: che è utile in quanto permette di applicare una fase quantistica.
ja: これは、量子位相の適用に役立ちます。
ko_kr: 이는 양자 위상을 만들어 주므로 유용하다.
pt_br: que é útil, uma vez que nos permite aplicar uma fase quântica.
ru: что позволяет изменить локальную фазу состояния.
sw_ke: ambayo ni muhimu kwani inatuwezesha kutumia awamu ya kwanta.
ta: இது ஒரு குவாண்டம் கட்டத்தைப் பயன்படுத்த எங்களுக்கு அனுமதிப்பதால் இது பயனுள்ளதாக இருக்கும்.
tr: ki bu bizim kuantum fazı uygulamamıza izin verdiği için faydalıdır.

source: Identity gate
bn_bn: অভেদক (আইডেন্টিটি) যুক্তিবর্তনী (গেইট)
es_un: Compuerta Identidad
fr_fr: Porte identité
id_id: Gate Identitas
it_it: Gate identità
ja: 恒等ゲート
ko_kr: 항등(identity) 게이트
pt_br: Porta identidade
ru: Единичный вентиль
sw_ke: Lango la Identity
ta: அடையாள வாயில்
tr: Birim kapı

source: The identity gate is :math:`Id = u0(1)`.
bn_bn: আইডেন্টিটি যুক্তিবর্তনীটি হল :math:`Id = u0(1)`।
fr_fr: La porte identité est :math:`Id = u0(1)`.
id_id: Gate identitas adalah :math:` Id = u0 (1) `.
it_it: Il gate identità è :math:`Id = u0(1)`.
pt_br: A porta identidade é :math:`Id = u0(1)`.
sw_ke: Lango la identity ni :math:`Id = u0(1)`.

source: Pauli gates
bn_bn: পাউলি যুক্তিবর্তনী (গেইট)
es_un: Compuertas de Pauli
fr_fr: Portes de Pauli
id_id: Gate Pauli
it_it: Gate di Pauli
ja: パウリゲート
ko_kr: 파울리(Pauli) 게이트
pt_br: Portas Pauli
ru: Вентили Паули
sw_ke: Malango ya Pauli
ta: பல்ஸ் வாயில்கள்
tr: Pauli kapıları

source: :math:`X`: bit-flip gate
bn_bn: :math:`X`: বিট-ফ্লিপ বা মান পরিবর্তন যুক্তিবর্তনী (গেইট)
es_un: :math:`X`: compuerta de cambio de bit
fr_fr: :math:` X `: porte d'inversion (flip-bit)
id_id: :math:` X `: gate bit-flip
it_it: :math:`X`: gate bit-flip
ja: :math:`X`: ビット・フリップ・ゲート
ko_kr: :math:`X`: 비트 플립 게이트
pt_br: :math:`X`: porta inversora (bit-flip)
ru: :math:`X`: вентиль переворота бита
sw_ke: :math:`X`: ni lango la bit-flip
tr: :math:`X`: bit çevirme kapısı

source: The bit-flip gate :math:`X` is defined as:
bn_bn: :math:`X` মান পরিবর্তন (বিট-ফ্লিপ) যুক্তিবর্তনীর (গেইট) সংজ্ঞা হল:
es_un: La compuerta de cambio de bit :math:`X` está definida como:
fr_fr: La porte bit-flip :math:`X` est définie comme :
id_id: Gate bit-flip :math:` X ` didefinisikan sebagai:
it_it: Il gate bit-flip :math:`X` è definito come:
ja: ビット・フリップ・ゲート :math:`X` は次のように定義されています。
ko_kr: 비트 플립 게이트 :math:`X` 는 다음과 같이 정의된다.
pt_br: A porta inversora :math:`X` é definida como:
ru: Вентиль :math:`X` определяется как:
sw_ke: Lango la bit-flip :math:`X` limefafanuliwa kama:
ta: இந்த bit-flip gate :math:`X` என வரையறுக்கப்படுகிறது:
tr: Bit çevirme kapısı :math:`X` şu şekilde tanımlanır:

source: X = \begin{pmatrix} 0 & 1\\ 1 & 0 \end{pmatrix}= u3(\pi,0,\pi)
fr_fr: X = \start{pmatrix} & 1\\ 1 & 0 \end{pmatrix}= u3(\pi,0,\pi)

source: :math:`Y`: bit- and phase-flip gate
bn_bn: :math: `Y`: কণার অবস্থা (bit) এবং দশা (phase) পরিবর্তনকারী যুক্তিবর্তনী
es_un: :math:`Y`: compuerta de cambio de bit y de fase
fr_fr: :math:`Y`: porte d'inversion de bits et de phase
id_id: :math:` Y `: gate flip bit dan fase
it_it: :math:`Y`: gate bit- e phase-flip
ja: :math:`Y` : ビット・アンド・フェーズ・フリップ・ゲート
ko_kr: :math:`Y`: 비트와 위상 플립 게이트
pt_br: :math:`Y`: porta inversora de bit e fase (bit- and phase-flip)
ru: :math:`Y`: вентиль битового и фазового переворотов
sw_ke: :math:`Y`: ni lango la bit-flip pamwe na phase-flip
ta: :math:`Y`: பிட்- மற்றும் கட்ட-திருப்பு வாயில்
tr: :math:`Y`: bit ve faz çevirme kapısı

source: The :math:`Y` gate is defined as:
bn_bn: :math:`Y` যুক্তিবর্তনীর সংজ্ঞায়ন হচ্ছে:
es_un: La compuerta :math:`Y` está definida como:
fr_fr: La porte :math:`Y` est définie comme :
id_id: Gate :math:` Y ` didefinisikan sebagai:
it_it: Il gate :math:`Y` è definito come:
ja: :math:`Y` ゲートは次のように定義されています。
ko_kr: :math:`Y` 게이트는 다음과 같이 정의된다.
pt_br: A porta :math:`Y` é definida como:
ru: Вентиль :math:`Y` определяется как:
sw_ke: Lango la :math:`Y` limefafanuliwa kama:
ta: :math:`Y` வாயில் வரையறுக்கப்பட்டுள்ளது:
tr: :math:`Y` kapısı şu şekilde tanımlanır:

source: :math:`Z`: phase-flip gate
bn_bn: :math:`Z`: দশা পরিবর্তনকারী যুক্তিবর্তনী (গেইট)
es_un: :math:`X`: compuerta de cambio de fase
fr_fr: :math:`Z` : porte d'inversion de phase
id_id: :math:` Z `: gate fase flip
it_it: :math:`Z`: gate phase-flip
ja: :math:`Z`: フェーズ・フリップ・ゲート
ko_kr: :math:`Z`: 위상 플립 게이트
pt_br: :math:`Z`: porta inversora de fase (phase-flip)
ru: :math:`Z`: вентиль фазового переворота
sw_ke: :math:`Z`: ni lango la phase-flip
tr: :math:`Z`: faz çevirme kapısı

source: The phase-flip gate :math:`Z` is defined as:
bn_bn: দশা পরিবর্তনকারী যুক্তিবর্তনী (গেইট) :math:`Z` এর সংজ্ঞায়ন হচ্ছেঃ:
es_un: La compuerta de cambio de fase :math:`Z` está definida como:
fr_fr: La porte d'inversion (flip) de phase :math:` Z ` est définie comme suit:
id_id: Gate fase-flip :math:` Z ` didefinisikan sebagai:
it_it: Il gate phase-flip :math:`Z` è definito come:
ja: フェーズ・フリップ・ゲート :math:`Z` は、次のように定義されます。
ko_kr: 위상 플립 게이트 :math:`Z` 는 다음과 같이 정의된다.
pt_br: A porta :math:`Z` é definida como:
ru: Вентиль :math:`Z` определяется как:
sw_ke: Lango la phase-flip :math:`Z` limefafanuliwa kama:
ta: இந்த phase-flip gate :math:`Z` என வரையறுக்கப்படுகிறது:
tr: Faz çevirme kapısı :math:`Z` şu şekilde tanımlanır:

source: Z = \begin{pmatrix} 1 & 0\\ 0 & -1 \end{pmatrix}=u1(\pi)
fr_fr: Z = \start{pmatrix} & 0\\ 0 & -1 \end{pmatrix}=u1(\pi)

source: Clifford gates
bn_bn: ক্লিফোর্ড যুক্তিবর্তনী
es_un: Compuertas de Clifford
fr_fr: Portes de Clifford
id_id: Gate Clifford
it_it: Gate di Clifford
ja: クリフォードゲート
ko_kr: 클리포드 (Clifford) 게이트
pt_br: Portas Clifford
ru: Вентили Клиффорда
sw_ke: Malango ya Clifford
ta: Clifford வாயுக்கள்
tr: Clifford kapıları

source: Hadamard gate
bn_bn: হাদামার্দ যুক্তিবর্তনী
es_un: Compuerta de Hadamard
fr_fr: Porte d'Hadamard
id_id: Gate Hadamard
it_it: Gate Hadamard
ja: アダマールゲート
ko_kr: 하다마드(Hadamard) 게이트
pt_br: Porta Hadamard
ru: Вентиль Адамара
sw_ke: Lango la Hadamard
ta: ஹாட்மார்ட் கேட்
tr: Hadamard kapısı

source: :math:`S` (or, :math:`\sqrt{Z}` phase) gate
bn_bn: :math:`S` ( অথবা, :math:`\sqrt{Z} দশা) যুক্তিবর্তনী (গেইট)
es_un: Compuerta :math:`S` (o fase :math:`\sqrt{Z}`)
fr_fr: porte :math:`S` (ou, :math:`\sqrt{Z}` phase)
id_id: Gate :math:` S ` (atau, :math:` \sqrt{Z}` fase)
it_it: Gate :math:`S` (o, :math:`\sqrt{Z}`)
ja: :math:`S` (または、 :math:`\sqrt{Z}` フェーズ) ゲート
ko_kr: :math:`S` (or, :math:`\sqrt{Z}` 위상) 게이트
pt_br: Porta :math:`S` (ou, fase :math:`\sqrt{Z}`)
ru: Вентиль :math:`S` (соответствует :math:`\sqrt{Z}`)
sw_ke: Lango la :math:`S` (au, :math:`\sqrt{Z}` awamu)
ta: :math:`S` (or, :math:`\sqrt{Z}` கட்டம்) வாயில்
tr: :math:`S` (ya da, :math:`\sqrt{Z}` faz) kapısı

source: :math:`S^{\dagger}` (or, conjugate of :math:`\sqrt{Z}` phase) gate
bn_bn: :math:`S^{\dagger}` (অথবা, :math:`\sqrt{Z}` এর অনুবন্ধী দশা) যুক্তিবর্তনী (গেইট)
es_un: Compuerta :math:`S^{\dagger}` (o conjugada de fase :math:`\sqrt{Z}`)
fr_fr: porte :math:`S^{\dagger}` (ou, conjuguant la phase :math:`\sqrt{Z}` )
id_id: Gate :math:` S ^ {\dagger} ` (atau, conjugate dari :math:` \sqrt{Z}` fase)
it_it: Gate :math:`S^{\dagger}` (o, coniugato di :math:`\sqrt{Z}`)
ja: :math:`S^{\dagger}` (または :math:`\sqrt{Z}` フェーズの共役 ) ゲート
ko_kr: :math:`S^{\dagger}` (또는 :math:`\sqrt{Z}` 위상의 켤레) 게이트
pt_br: Porta :math:`S^{\dagger}` (ou, conjugada da fase :math:`\sqrt{Z}`)
ru: Вентиль :math:`S^{\dagger}` (сопряженный к :math:`\sqrt{Z}`)
sw_ke: Lango la :math:`S^{\dagger}` (au, mnyambuliko wa :math:`\sqrt{Z}` awamu)
ta: :math:`S^{\dagger}` (அல்லது, இணைத்தல் :math:`\sqrt{Z}` கட்டம்) வாயில்
tr: :math:`S^{\dagger}` (ya da, :math:`\sqrt{Z}` nin eşleniği faz) kapısı

source: :math:`C3` gates
bn_bn: :math:`C3 যুক্তিবর্তনী (গেইট)
es_un: Compuertas :math:`C3`
fr_fr: portes :math:`C3`
id_id: Gate :math:` C3 `
it_it: Gate :math:`C3`
ja: :math:`C3` ゲート
ko_kr: :math:`C3` 게이트
pt_br: Portas :math:`C3`
ru: Вентили :math:`C3`
sw_ke: Malango ya :math:`C3`
ta: :math:`C3` வாயுக்கள்
tr: :math:`C3` kapıları

source: :math:`T` (or, :math:`\sqrt{S}` phase) gate
bn_bn: :math:`T` (অথবা, :math:`\sqrt{S}` দশা) যুক্তিবর্তনী (গেইট)
es_un: Compuerta :math:`T` (o fase :math:`\sqrt{S}`)
fr_fr: porte :math:`T` (ou, phase :math:`\sqrt{S}`)
id_id: Gate :math:` T ` (atau, :math:` \sqrt{S}` fase)
it_it: Gate :math:`T` (o, :math:`\sqrt{S}`)
ja: :math:`T` (または、 :math:`\sqrt{S}` フェーズ) ゲート
ko_kr: :math:`T` (혹은, :math:`\sqrt{S}` 위상) 게이트
pt_br: Porta :math:`T` (ou, fase :math:`\sqrt{S}`)
ru: Вентиль :math:`T` (соответствует :math:`\sqrt{S}`)
sw_ke: Lango la :math:`T` (au, :math:`\sqrt{S}` awamu)
ta: :math:`T` (or, :math:`\sqrt{S}` கட்டம்) வாயில்
tr: :math:`T` (ya da, :math:`\sqrt{S}` faz) kapısı

source: :math:`T^{\dagger}` (or, conjugate of :math:`\sqrt{S}` phase) gate
bn_bn: :math:`T^{\dagger}` (অথবা, :math:`\sqrt{S}` এর অনুবন্ধী দশা) যুক্তিবর্তনী (গেইট)
es_un: Compuerta :math:`T^{\dagger}` (o conjugada de fase :math:`\sqrt{S}`)
fr_fr: porte :math:`T^{\dagger}` (ou, conjuguant la phase :math:`\sqrt{S}`)
id_id: Gate :math:` T ^ {\dagger} ` (atau, conjugate dari :math:` \sqrt{S}` fase)
it_it: Gate :math:`T^{\dagger}` (o, coniugato di :math:`\sqrt{S}`)
ja: :math:`T^{\dagger}` (または :math:`\sqrt{S}` フェーズの共役 ) ゲート
ko_kr: :math:`T^{\dagger}` (혹은, :math:`\sqrt{S}` 위상의 켤레) 게이트
pt_br: Porta :math:`T^{\dagger}` (ou, conjugada da fase :math:`\sqrt{S}`)
ru: Вентиль :math:`T^{\dagger}` (сопряженный к :math:`\sqrt{S}`)
sw_ke: Lango la :math:`T^{\dagger}` (au, mnyambuliko wa :math:`\sqrt{S}` awamu)
tr: :math:`T^{\dagger}` (ya da, :math:`\sqrt{S}` nin eşleniği faz) kapısı

source: Standard Rotations
bn_bn: প্রামাণিক (স্টান্ডার্ড) ঘূর্ণন
es_un: Rotaciones estándar
fr_fr: Rotations standard
id_id: Rotasi Standar
it_it: Rotazioni standard
ja: 標準回転
ko_kr: 표준 회전
pt_br: Rotações Padrão
ru: Вентили вращения
sw_ke: Mizunguko ya Kawaida
ta: நிலையான சுழல்
tr: Standart Dönüşler

source: The standard rotation gates are those that define rotations around the Paulis :math:`P=\{X,Y,Z\}`. They are defined as
bn_bn: প্রামাণিক ঘুর্ণনশীল যুক্তিবর্তনী সেগুলো যারা পাউলী :math:`P=\{X,Y,Z\}` কেন্দ্র করে ঘুর্ণন করে। এদের সংজ্ঞা হল
es_un: Las compuertas de rotaciones estándar son aquellas que definen rotaciones alrededor de las Paulis :math:`P=\{X,Y,Z\}`. Están definidas como
fr_fr: Les portes de rotation standard sont celles qui définissent les rotations autour des :math:`P=\{X,Y,Z\}` de Pauli. Elles sont définies comme
id_id: Gate rotasi standar adalah gate rotasi di sekitar Paulis :math:` P = \ {X, Y, Z\} `. Mereka didefinisikan sebagai
it_it: I gate di rotazione standard sono quelli che definiscono le rotazioni attorno ai gate di Pauli :math:`P=\{X,Y,Z\}`. Sono definiti come
ja: 標準回転ゲートは、パウリ :math:`P=\{X,Y,Z\}` の周囲で回転を定義するゲートが定義されているものです。
ko_kr: 표준 회전 게이트들은 파울리 :math:`P=\{X,Y,Z\}` 에 대응하는 블로흐 벡터 축을 기준으로한 회전을 정의하는 게이트다. 다음과 같이 정의되는데,
pt_br: As portas de rotação padrão são aquelas que definem rotações em torno de :math:`P=\{X,Y,Z\}` de Pauli. Elas são definidas como
ru: Вентили вращения задают повороты сферы Блоха вокруг осей :math:`X,Y,Z`. Они определяются как
sw_ke: Malango ya mzunguko ya kawaida ni yale ambayo yanafafanua mizunguko karibu na Paulis :math:`P=\{X,Y,Z\}`. Yanafafanuliwa kama
ta: நிலையான சுழற்சி வாயுக்கள் பாலஸ் :math:` P =\{X, Y, Z\} `.அவை என வரையறுக்கப்படுகின்றன
tr: Standart döndürme kapıları Pauli'lerin etrafında dönüşleri tanımlayan kapılardır :math:`P=\{X,Y,Z\}`. Şu şekilde tanımlanırlar

source: Rotation around X-axis
bn_bn: X-অক্ষ ঘিরে আবর্তন
es_un: Rotación alrededor del eje X
fr_fr: Rotation autour de l'axe X
id_id: Rotasi di sekitar sumbu X
it_it: Rotazione attorno all'asse X
ja: X 軸まわりの回転
ko_kr: X축에 관한 회전
pt_br: Rotação em torno do eixo X
ru: Поворот вокруг оси X
sw_ke: Mzunguko karibu na jira-X
ta: X-அச்சை சுற்றி சுழற்று
tr: X ekseni etrafında dönme

source: Rotation around Y-axis
bn_bn: Y-অক্ষ ঘিরে আবর্তন
es_un: Rotación alrededor del eje Y
fr_fr: Rotation autour de l'axe des Y
id_id: Rotasi di sekitar sumbu Y
it_it: Rotazione attorno all'asse Y
ja: Y 軸まわりの回転
ko_kr: Y축에 관한 회전
pt_br: Rotação em torno do eixo Y
ru: Поворот вокруг оси Y
sw_ke: Mzunguko karibu na jira-Y
ta: Y-அச்சை சுற்றி சுழற்று
tr: Y ekseni etrafında dönme

source: Rotation around Z-axis
bn_bn: Z-অক্ষ ঘিরে আবর্তন
es_un: Rotación alrededor del eje Z
fr_fr: Rotation autour de l'axe Z
id_id: Rotasi di sekitar sumbu Z
it_it: Rotazione attorno all'asse Z
ja: Z 軸まわりの回転
ko_kr: Z축에 관한 회전
pt_br: Rotação em torno do eixo Z
ru: Поворот вокруг оси Z
sw_ke: Mzunguko karibu na jira-Z
ta: Z-அச்சை சுற்றி சுழற்று
tr: Z ekseni etrafında dönme
