Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/3_summary_of_quantum_operations.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja, ko_kr, pt_br, ru, sw_ke, ta, tr

source: Note we’ve introduced a shorthand for the tensor product of basis vectors, wherein :math:`\left|0\right\rangle \otimes \left|0\right\rangle` is written as :math:`\left|00\right\rangle`. The state of an :math:`n`-qubit system can be described using the :math:`n`-fold tensor product of single-qubit basis vectors. Notice that the basis vectors for a 2-qubit system are 4-dimensional; in general, the basis vectors of an :math:`n`-qubit system are :math:`2^{n}`-dimensional, as noted earlier.
bn_bn: লক্ষ্য করো আমরা বেসিস (ভিত্তি) দিকরাশির টেনসর গুণফল (প্রোডাক্ট) ছোট করে লিখেছি, যেখানে :math:`\left|0\right\rangle \otimes \left|0\right\rangle` এর স্থানে :math:`\left|00\right\rangle` লেখা হয়েছে। :math:`n` -কিউবিট যন্ত্রের অবস্থা প্রকাশের জন্য :math:`n`-বার একক কিউবিট বেসিস (ভিত্তি) দিকরাশির টেনসর গুণফল (প্রোডাক্ট) ব্যবহার করা যেতে পারে। মনে রেখো ২-কিউবিটসম্পন্ন একটা যন্ত্রের বেসিস (ভিত্তি) দিকরাশি ৪-মাত্রিক (ডাইমেনশনাল)। সাধারণত :math:`n` -কিউবিটসম্পন্ন যন্ত্রের বেসিস (ভিত্তি) দিকরাশি :math:`2^{n}`-মাত্রিক (ডাইমেনশনাল)।
it_it: Da notare che abbiamo introdotto un'abbreviazione per il prodotto tensoriale dei vettori di base, per cui :math:`\left|0\right\rangle \otimes \left|0\right\rangle` è scritto come :math:`\left|00\right\rangle`. Lo stato di un sistema a :math:`n`-qubit può essere descritto usando il prodotto tensoriale :math:`n`-fold dei vettori di base di singolo qubit. Da notare anche che i vettori di base per un sistema a due qubit sono quadri-dimensionali; in generale i vettori di base di un sistema a :math:`n`-qubit sono :math:`2^{n}`-dimensionali, come mostrato prima.
ko_kr: 우리는 기저 벡터의 텐서 곱에서 :math:`\left|0\right\rangle \otimes \left|0\right\rangle` 를 :math:`\left|00\right\rangle` 와 같이 씀으로써 간략한 표현을 도입하여 사용하였다. :math:`n` 큐비트 시스템의 상태는 단일 큐비트 기저 벡터들을 :math:`n` 번 텐서곱 하여 표현할 수 있다. 2 큐비트 시스템의 기저 벡터의 차원은 4차원이며 일반적으로 :math:`n` 큐비트 시스템의 기저 벡터의 차원은 :math:`2^{n}` 임을 주목하자.
pt_br: Observe que introduzimos um atalho para o produto tensorial de vetores da base, onde :math:`\left|0\right\rangle \otimes \left|0\right\rangle` é escrito como :math:`\left|00\right\rangle`. O estado de um sistema de :math:`n`-qubits pode ser descrito usando o produto tensorial de :math:`n`-vezes de vetores da base de um único qubit. Observe que os vetores da base para um sistema 2-qubits são 4-dimensionais; em geral, os vetores da base de um sistema de :math:`n` qubits são :math:`2^{n}`-dimensionais, como observado, anteriormente.
sw_ke: Kumbuka tumeanzisha hatimkato ya ufumbuzi wa tensor ya vekta msingi, ambapo :math:`\left|0\right\rangle \otimes \left|0\right\rangle` imeandikwa kama :math:`\left|00\right\rangle`. Hali ya mfumo wenye qubit :math:`n` inaweza kuelezewa kwa kutumia ufumbuzi wa tensor wa fold :math:`n` wa vekta-msingi zenye qubit moja. Tanabahi kwamba vekta za msingi za mfumo wa qubit 2 zina pandeolwa 4; kwa ujumla, vekta msingi za mfumo wenye qubit :math:`n` zina pandeolwa :math:`2^{n}`, kama ilivyoelezwa hapo awali.
ta: அடிப்படை திசையன்களின் டென்சர் தயாரிப்புக்கான சுருக்கெழுத்தை நாங்கள் அறிமுகப்படுத்தியுள்ளோம், இதில் :math:`\left|0\right\rangle \otimes\left|0\right\rangle` என எழுதப்பட்டுள்ளது :math:`\left|00\right\rangle`. ஒரு :math:`n`-க்யூபிட்அமைப்பின் நிலை: கணிதத்தைப் பயன்படுத்தி விவரிக்கப்படலாம்: ஒற்றை-க்யூபிட் அடிப்படை திசையன்களின் :math:`n`- மடங்கு டென்சர் தயாரிப்பு. 2-க்யூபிட் அமைப்புக்கான அடிப்படை திசையன்கள் 4 பரிமாணங்களைக் கொண்டிருப்பதைக் கவனியுங்கள்; பொதுவாக, ஒரு :math:`n`- க்யூபிட் அமைப்பின் அடிப்படை திசையன்கள் :math:`2^{n}` பரிமாணமானது, முன்பு குறிப்பிட்டது போல.
tr: :math:`\left|0\right\rangle \otimes \left|0\right\rangle` in bunun yerine :math:`\left|00\right\rangle` şeklinde yazıldığı taban vektörlerinin tensör çarpımı için bir kısayol tanıttık. :math:`n` kübitlik bir sistemin durumu, tek kübit taban vektörlerinin :math:`n` katlı tensör çarpımı kullanılarak açıklanabilmektedir. Bir iki kübitlik sistem için taban vektörlerinin 4 boyutlu olduğuna dikkat edin; genellikle, daha önce de belirtildiği gibi :math:`n` kübitlik bir sistemin taban vektörleri :math:`2^{n}` boyutludur.

source: Within the physics community, the qubits of a multi-qubit systems are typically ordered with the first qubit on the left-most side of the tensor product and the last qubit on the right-most side. For instance, if the first qubit is in state :math:`\left|0\right\rangle` and second is in state :math:`\left|1\right\rangle`, their joint state would be :math:`\left|01\right\rangle`. Qiskit uses a slightly different ordering of the qubits, in which the qubits are represented from the most significant bit (MSB) on the left to the least significant bit (LSB) on the right (little-endian). This is similar to bitstring representation on classical computers, and enables easy conversion from bitstrings to integers after measurements are performed. For the example just given, the joint state would be represented as :math:`\left|10\right\rangle`. Importantly, *this change in the representation of multi-qubit states affects the way multi-qubit gates are represented in Qiskit*, as discussed below.
es_un: Dentro de la comunidad de física, los qubits de un sistema multi-qubit se ordenan típicamente con el primer qubit en el lado más a la izquierda del producto tensorial y el último qubit en el lado más a la derecha. Por ejemplo, si el primer qubit está en el estado :math:`\left|0\right\rangle` y el segundo está en el estado :math:`\left|1\right\rangle`, su estado conjunto sería :math:`\left|01\right\rangle`. Qiskit usa un orden ligeramente diferente de los qubits, en el que los qubits se representan desde el bit más significativo (most significant bit, MSB) a la izquierda hasta el bit menos significativo (least significant bit, LSB) a la derecha (little-endian). Esto es similar a la representación de cadenas de bits en computadoras clásicas, y permite una fácil conversión de cadenas de bits a enteros después de realizar las mediciones. Para el ejemplo que se acaba de dar, el estado en conjunto se representa como :math:`\left|10\right\rangle`. Es importante recordar que, *este cambio en la representación de estados multi-qubit afecta la forma en que las compuertas de múltiples qubits son representadas en Qiskit*, como se explica a continuación.
ja: 物理コミュニティでは、複数量子ビット系の量子ビットは通常、テンソル積の左端に最初の量子ビットがあり、右端に最後の量子ビットが来るように順序づけられています。例えば、最初の量子ビットの状態が :math:`\left|0\right\rangle` で、2番目のものが :math:`\left|1\right\rangle` の状態のとき、それらの結合状態は :math:`\left|01\right\rangle` のようになります。Qiskitでは少し異なる量子ビットの順番をとります。左に最上位ビット(most significant bit、MSB)をとり、右に最下位ビット(least significant bit、LSB)をとるように表されます(リトルエンディアン)。これは古典コンピュータにおけるビット列表現と似ていて、測定が行われた後のビット列から整数への変換が容易になります。上記の例では、結合状態は :math:`\left|10\right\rangle` と表されます。重要なのは、以下で説明されるように、*複数量子ビットの状態の表現のこの変更が、Qiskitでの複数量子ビットゲートの表現方法に影響がある*ということです。
ko_kr: 물리 커뮤니티 내에서, 다중 큐비트 시스템의 큐비트는 일반적으로 텐서 곱의 가장 왼쪽에 있는 첫 번째 큐비트와 가장 오른쪽에 있는 마지막 큐비트로 순서를 결정한다. 예를 들어, 첫 번째 큐비트가 상태 :math:`\left|0\right\rangle` 이고 두 번째 큐비트가 :math:`\left|1\right\rangle` 상태인 경우 결합 상태는 :math:`\left|01\right\rangle` 로 정하는 것이 일반적이다. 하지만 Qiskit은 큐비트의 정렬 순서를 다르게 사용한다. 큐비트는 왼쪽의 최상위 비트(MSB)에서 오른쪽(리틀 엔디안)의 최하위 비트(LSB)로 표시된다. 이 방식은 기존 컴퓨터의 비트열 표현과 유사하기 때문에 측정 후 비트열을 정수로 쉽게 변환할 수 있다. 따라서 방금 주어진 예의 연합 상태는 :math:`\left|10\right\rangle` 로 표시된다. 아주 중요하게, *다중 큐비트 상태 표현의 이런 차이점은 아래에서 살펴볼 바와 같이 Qiskit* 에서 다중 큐비트 게이트가 표현되는 방식에 영향을 미친다.
ru: В физике нумерация кубитов в сложных системах обычно выполняется слева направо, в таком же порядке составляется и тензорное произведение, начиная с первого и заканчивая последним. Например, если первый кубит находится в состоянии :math:`\left|0\right\rangle` а второй — в состоянии :math:`\left|1\right\rangle`, итоговым состоянием будет :math:`\left|01\right\rangle`. Qiskit же нумерует их иначе, начиная со старшего кубита (most significant bit, MSB) слева и заканчивая младшим (least significant bit, LSB) справа (little-endian). Это похоже на представление битовой строки в классическом компьютере и упрощает преобразование полученной в результате измерений строки битов в целое число. Для указанного примера итоговым состоянием будет :math:`\left|10\right\rangle`. Важно, что *такое представление многокубитных состояний влияет на вид матриц многокубитных вентилей в Qiskit*, как показано далее.
tr: Fizik topluluğunda, çoklu-kübitli sistemlerin kübitleri, tipik olarak ilk kübit, tensör gösteriminin en sol tarafında ve son kubit en sağda olacak şekilde sıralanır. Örneğin, ilk kübit :math:`\left|0\right\rangle` durumundaysa ve ikincisi :math:`\left|1\right\rangle` durumundaysa, ortak durumları :math:`\left|01\right\rangle` olur. Qiskit, kübitlerin soldaki en önemli bitten (MSB) sağdaki en küçük bite (LSB) kadar temsil edildiği kübitlerin biraz farklı bir sırasını kullanır (little-endian). Bu, klasik bilgisayarlardaki bit dizisi temsiline benzer ve ölçümler yapıldıktan sonra bit dizelerinden tamsayılara kolay dönüşüm sağlar. Yeni verilen örnek için, ortak durum şu şekilde temsil edilir :math:`\left|10\right\rangle`. Önemli olarak, *çok-kübit durumlarının temsilindeki bu değişiklik, çoklu-kübit kapıların Qiskit'te temsil edilme şeklini*, aşağıda tartışıldığı gibi etkiler.

source: We can work out the action of :math:`C_{U}` as follows. Recall that the basis vectors for a two-qubit system are ordered as :math:`\left|00\right\rangle, \left|01\right\rangle, \left|10\right\rangle, \left|11\right\rangle`. Suppose the **control qubit** is **qubit 0** (which, according to Qiskit’s convention, is one the *right-hand* side of the tensor product). If the control qubit is in :math:`\left|1\right\rangle`, :math:`U` should be applied to the **target** (qubit 1, on the *left-hand* side of the tensor product). Therefore, under the action of :math:`C_{U}`, the basis vectors are transformed according to
bn_bn: আমরা :math:`C_{U}` এর কার্যক্রম এভাবে সম্পন্ন করতে পারি। মনে করুন সেই দ্বি-কিউবিট ব্যবস্থার একক দিকরাশি (বেসিস ভেক্টর) :math:`\left|00\right\rangle, \left|01\right\rangle, \left|10\right\rangle, \left|11\right\rangle` এভাবে সজ্জিত। ধরা যাক, **নিয়ন্ত্রণ কিউবিট** হলো **কিউবিট ০** (যেটা, Qiskit-এর চিরাচরিত রীতি অনুযায়ী, টেন্সর গুণফলের ডানদিকে থাকবে)। যদি নিয়ন্ত্রণ কিউবিট :math:`\left|1\right\rangle` অবস্থায় থাকে, তবে **নিয়ন্ত্রিত কিউবিটে** (কিউবিট ১, টেন্সর গুণফলের বামে) :math:`U` প্রয়োগ করতে হবে। সেহেতু, :math:`C_{U}` এর কার্যবিধি অনুযায়ী, একক দিকরাশি এভাবে পরিবর্তিত হবে
id_id: Kita bisa melihat aksi dari :math:`C_{U}` seperti berikut. Seperti sebelumnya, vektor basis dari sistem dua qubit diurut seperti :math:`\left|00\right\rangle, \left|01\right\rangle, \left|10\right\rangle, \left|11\right\rangle`. Anggap **qubit pengontrol** adalah **qubit ke 0** (yang menurut konvensi Qiskit, disebelah kanan dari produk tensor). Jika qubit pengontrol adalah :math:`\left|1\right\rangle`, :math:`U` harus diaplikasi ke **target** (qubit ke 1, di sebelah kiri dari produk tensor). Karena itu, dengan aplikasi :math:`C_{U}, vektor basis ditransform berdasarkan
it_it: Si può comprendere l'azione di :math:`C_{U}` come segue. Si ricordi che i vettori di base per un sistema a due qubit sono ordinati come :math:`\left|00\right\rangle, \left|01\right\rangle, \left|10\right\rangle, \left|11\right\rangle`. Si supponga che il **qubit di controllo** sia **qubit 0** (che, secondo la convenzione usata in Qiskit, è quello all' *estremo destro* del prodotto tensoriale). Se il qubit di controllo è nello stato :math:`\left|1\right\rangle`, :math:`U` dovrebbe essere applicato al qubit di **target** (qubit 1, all' *estremo sinistro* del prodotto tensoriale). Quindi, per effetto di :math:`C_{U}`, i vettori di base sono trasformati secondo
ko_kr: 우리는 :math:`C_{U}` 가 어떻게 작용하는 다음과 같이 살펴볼 수 있다. 우선 두 큐비트 시스템의 기저 벡터는 :math:`\left|00\right\rangle, \left|01\right\rangle, \left|10\right\rangle, \left|11\right\rangle` 순으로 쓸 수 있다. **제어 큐비트** 는 **큐비트 0** 이라 가정하자(Qiskit 표기에 따르면 텐서곱 연산의 *오른쪽* 에 해당). 만약 제어 큐비트가 :math:`\left|1\right\rangle` 이면 :math:`U`가 **표적 큐비트** 에 적용된다(큐비트 1, 텐서곱의 *왼쪽*). 그러므로 :math:`C_{U}` 가 작용할 때 기저 벡터들은 다음과 같이 변환된다.
pt_br: Podemos encontrar a ação de :math:`C_{U}` da seguinte forma. Lembre que os vetores da base para um sistema de dois qubits são ordenado como :math:`\left|00\right\rangle, \left|01\right\rangle, \left|10\right\rangle, \left|11\right\rangle`. Suponha que o **qubit de controle** é o **qubit 0** (o qual, de acordo com a convenção do Qiskit, fica no lado *mais à direita* do produto tensorial). Se o qubit de controle estiver em :math:`\left|1\right\rangle`, :math:`U` deve ser aplicada ao **alvo** (o qubit 1, no lado *mais à esquerda* do produto tensorial). Portanto, sob a ação de :math:`C_{U}`, os vetores da base são transformados conforme
sw_ke: Tunaweza kusuluhisha utekelezaji wa :math:`C_{U}` kama ifuatavyo. Kumbuka kwamba vekta msingi za mfumo wa qubit mbili huorodheshwa kama :math:`\left|00\right\rangle, \left|01\right\rangle, \left|10\right\rangle, \left|11\right\rangle`. Tuseme kwamba **qubit iliyodhibitiwa** ni **qubit 0** (ambayo, kulingana na mkataba wa Qiskit, iko kwenye upande wa *mkono wa kulia* wa ufumbuzi wa tensor). Ikiwa qubit iliyodhibitiwa iko katika hali ya :math:`\left|1\right\rangle`, :math:`U` inapaswa kutekelezwa kwenye **lengo** (qubit 1, upande wa *mkono wa kushoto* wa ufumbuzi wa tensor). Kwa hivyo, chini ya utekelezaji wa :math:`C_{U}`, vekta msingi hubadilishwa kulingana na
ta: :math:`C_{U}` இன் செயலை நாம் பின்வருமாறு செய்ய முடியும். இரண்டு-குவிட் அமைப்பிற்கான அடிப்படை திசையன்கள் இவ்வாறு கட்டளையிடப்பட்டுள்ளன என்பதை நினைவில் கொள்க: :math:`\left|00\right\rangle, \left|01\right\rangle, \left|01\right\rangle, \left|11\right\rangle`. **கட்டுப்பாட்டு குவிட்** **க்விட் 0** (இது கிஸ்கிட்டின் மாநாட்டின் படி, டென்சர் தயாரிப்பின் * வலது கை * பக்கமாகும்) என்று வைத்துக்கொள்வோம். கட்டுப்பாட்டு குவிட் இருந்தால்: :math:`\left|1\right\rangle`, :math:`U` **இலக்குக்கு** பயன்படுத்தப்பட வேண்டும்(குவிட் 1, *இடது கை* பக்கத்தில் டென்சர் தயாரிப்பு). எனவே, :math:`C_ {U}` இன் கீழ், அடிப்படை திசையன்கள் அதன்படி மாற்றப்படுகின்றன
tr: :math:`C_{U}` işlemini aşağıdaki gibi hesaplayabiliriz. İki kübit bir sistem için taban vektörlerinin :math:`\left|00\right\rangle, \left|01\right\rangle, \left|10\right\rangle, \left|11\right\rangle` şeklinde sıralandığını hatırlayın. **Kontrol kübit** in **kübit 0** (Qiskit'in düzenine göre tensör çarpımının *sağ* tarafındaki) olduğunu varsayalım. Eğer kontrol kübit :math:`\left|1\right\rangle`, :math:`U` içerisindeyse **hedef** (kübit 1, tensör çarpımının *sol* tarafındaki) üzerine uygulanmalı. Bu yüzden, :math:`C_{U}` işlemi altında, taban vektörleri şuna göre dönüştürülür

source: Controlled-X (or, Controlled-NOT) gate
es_un: Compuerta X controlada (o NOT controlado)
ja: 制御 X (制御NOT) ゲート
ko_kr: Controlled-X (또는, Controlled-NOT) 게이트
ru: Управляемый-X (или управляемый-NOT) вентиль
ta: கட்டுப்படுத்தப்பட்ட-X (அல்லது, கட்டுப்படுத்தப்பட்ட-NOT) குவாண்டம் லாஜிக் கேட்
tr: Kontrollü X(veya Kontrollü NOT) kapısı

source: The Controlled-NOT gate flips the ``target`` qubit when the control qubit is in the state :math:`\left|1\right\rangle`. If we take the MSB as the control qubit (e.g. ``cx(q[1],q[0])``), then the matrix would look like
ko_kr: Controlled-NOT 게이트는 제어 큐비트의 상태가 :math:`\left|1\right\rangle` 일 때 ``Target`` 큐비트를 반전시킨다. 만약 제어 큐비트가 MSB라면 (예를 들면, ``cx(q[1],q[0])``) 그 행렬은 다음과 같다.
ta: கட்டுப்பாட்டு குபிட் நிலை :math:`\left|1\right\rangle` என்ற நிலையில் இருக்கும்போது, Controlled-NOT கேட் ``target`` குபிட்டை புரட்டுகிறது. MSB ஐ கட்டுப்பாட்டு குபிட்டாக எடுத்துக் கொண்டால் (எ.கா. `cx(q[1],q[0])``), பின்னர் அணி இப்படி இருக்கும்
tr: Kontrol kübiti :math:`\left|1\right\rangle` durumundayken Kontrollü-NOT (CNOT) kapısı ``hedef`` kübiti tersine çevirir. Kontrol kübiti (e.g. ``cx(q[1],q[0])``) olarak MSB (most significant bit)'i alırsak o zaman matris şu şekilde görünür

source: However, when the LSB is the control qubit, (e.g. ``cx(q[0],q[1])``), this gate is equivalent to the following matrix:
bn_bn: যদি সর্বনিম্ন গুরুত্বের বিটটি (এলএসবি) নিয়ন্ত্রনকারী কিউবিট হয়, ( যেমন, ``cx(q[0],q[1])``), তাহলে যুক্তিবর্তনীটির গাণিতিক প্রকাশ হবে নিম্নোক্ত ম্যাট্রিক্সের মত:
id_id: Namun, ketika LSB adalah qubit kontrol, (mis. ` ` cx (q[0], q[1]) ` `), gerbang ini akan setara dengan matriks berikut:
it_it: Quando invece il qubit di controllo è il LSB (ad esempio ``cx(q[0],q[1])``), questo gate è equivalente alla seguente matrice:
ko_kr: 그러나 조절 큐비트가 LSB이면 (e.g. ``cx(q[0],q[1])``), 이 게이트는 다음 행렬과 동일하다.
pt_br: No entanto, quando o qubit de controle é o LSB, (por exemplo, ``cx(q[0],q[1])``), esta porta é equivalente à seguinte matriz:
sw_ke: Hata hivyo, wakati LSB ndio qubit iliyodhibitiwa, (k.m. ``cx(q[0],q[1])``), lango hili ni sawa na matriki ifuatayo:
ta: எனினும், LSB கட்டுப்பாட்டு விகிதத்தில், (e.g. ``cx(q[0],q[1])``), இந்த வாய்ப்பாடு பின்வரும் மாட்ரிக்ஸுக்கு சமமானது:
tr: Ancak LSB kontrol kübiti olduğunda, (örneğin ``cx(q[0],q[1])``), bu kapı aşağıdaki matrise eşdeğerdir:

source: Controlled :math:`Z` (or, controlled Phase-Flip) gate
es_un: Compuerta controlada :math:`Z` (o, cambio de fase controlada)
ja: 制御 :math:`Z` （または、制御位相反転）ゲート
ko_kr: Controlled :math:`Z` (위상 제어) 게이트
ru: Управляемый :math:`Z` вентиль (или управляемый вентиль фазового переворота)
ta: கட்டுப்படுத்தப்பட்ட :math:`Z` (அல்லது, கட்டுப்படுத்தப்பட்ட ஃபேஸ்-ஃபிளிப்) கேட்
tr: Kontrollü :math:`Z` (veya, kontrollü Faz-Çevirme) kapısı

source: Controlled :math:`u` rotation
bn_bn: কন্ট্রোল্ড :math:`u` ঘূর্ণন
es_un: Rotación :math:`u` controlada
ja: 制御 :math:`u` 回転
ko_kr: 제어 :math:`u` 회전
ru: Управляемое вращение :math:`u`
sw_ke: Mzunguko wa :math:`u` uliodhibitiwa
ta: கட்டுப்படுத்தப்பட்டது :math:`u` சுழற்சி
tr: Kontrollü :math:`u` döndürme

source: Perform controlled-:math:`u` rotation on the target qubit if the control qubit (here LSB) is :math:`\left|1\right\rangle`.
es_un: Realiza la rotación :math:`u` controlada en el qubit objetivo si el qubit de control (aquí LSB) es :math:`\left|1\right\rangle`.
ja: 制御量子ビット（ここではLSB）が :math:`\left|1\right\rangle` の場合、ターゲット量子ビットに対して制御-:math:`u` 回転を実行します。
ru: Задает управляемое вращение :math:`u` целевого кубита, если управляющий (здесь это младший) находится в состоянии :math:`\left|1\right\rangle`.
tr: Eğer kontrol kübiti (burada LSB) :math:`\left|1\right\rangle` ise hedef kübit üzerinde kontrollü-:math:`u` döndürme yapın.

source: We don’t have access to all the information when we make a measurement in a quantum computer. The quantum state is projected onto the standard basis. Below are two examples showing a circuit that is prepared in a basis state and the quantum computer prepared in a superposition state.
bn_bn: কোয়ান্টাম কম্পিউটারের পরিমাপের সময় আমাদের কাছে সমস্ত তথ্যর প্রবেশাধিকার থাকে না। এই কারণে কোয়ান্টাম অবস্থা আদর্শ ভিত্তির (বেসিস) প্রেক্ষিতে হিসেব করা হয়। একটি বর্তনী কিভাবে বেসিস অবস্থায় এবং কোয়ান্টাম কম্পিউটারের উপরিপাতন (সুপারপজিশন) অবস্থায় হিসেব করা হয় নিচে দুইটি উদাহরণ দিয়ে দেখানো হল ।
id_id: Kita tidak memiliki akses ke semua informasi ketika kita membuat pengukuran dalam komputer kuantum. Keadaan kuantum diproyeksikan ke basis standar. Di bawah ini adalah dua contoh yang menunjukkan sebuah sirkuit yang disiapkan dalam basis dasar dan komputer kuantum yang disiapkan dalam keadaan superposisi.
it_it: Non abbiamo accesso a tutte le informazioni quanto facciamo una misura in un computer quantistico. Lo stato quantistico viene proiettato nella base standard. Di seguito ci sono due esempi che mostrano un circuito preparato in uno stato di base ed il quantum computer preparato in uno stato di sovrapposizione.
ko_kr: 양자 컴퓨터에서 측정을 수행하여도 모든 정보를 얻을 수는 없다. 양자 상태는 표준 기저에 사영된다. 아래 두 예는 각각 양자상태들이 기저 상태 중 하나로 준비되거나 중첩 상태로 준비되는 회로를 보여준다.
pt_br: Não temos acesso a todas as informações quando fazemos uma medição em um computador quântico. O estado quântico é projetado sobre a base padrão. Abaixo estão dois exemplos que mostram um circuito que é preparado em um estado da base e o computador quântico preparado em um estado de superposição.
sw_ke: Hatuna ufikiaji wa maelezo yote tunapofanya kipimo kwenye tarakilishi ya kwanta. Hali ya kwanta inapochomozwa kwenye standard basis. Ifuatayo ni mifano miwili inayoonyesha saketi ambayo imetayarishwa katika hali ya basis na tarakilishi ya kwanta iliyoandaliwa katika hali ya superposition.
ta: நாம ் எல ் லாம ் தகவல ் களுக ் கு அணுக ் கும ் இல ் லாமல ் ஒரு கணினியில ் ஒரு அளவிற ் கு அளவில ் லை. குவாண்ட் மாநிலம் நிலையான அடிப்படையில் முன்வைக்கப்படுகிறது. கீழே ஒரு அடிப்படை மாநிலத்தில் தயாரிக்கும் ஒரு சுற்றுப்பயணத்தை காட்டும் இரண்டு உதாரணங்கள் மற்றும் சூழல் நிலையில் தயாரித்த குவாண்டம் கணினி.
tr: Bir kuantum bilgisayarda ölçüm yaparken bütün bilgiye erişemeyiz. Kuantum durumu standart taban üzerine projelendirilir. Aşağıdakiler, bir taban durumu içerisinde hazırlanan bir devre ve bir süperpozisyon durumu içerisinde hazırlanan bir kuantum bilgisayarı gösteren iki örnektir.
