Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/3_summary_of_quantum_operations.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja, ko_kr, pt_br, ru, sw_ke, ta, tr

source: A common multi-qubit gate involves the application of a gate to one qubit, conditioned on the state of another qubit. For instance, we might want to flip the state of the second qubit when the first qubit is in :math:`\left|0\right\rangle`. Such gates are known as *controlled gates*. The standard multi-qubit gates consist of two-qubit gates and three-qubit gates. The two-qubit gates are: - controlled Pauli gates - controlled Hadamard gate - controlled rotation gates - controlled phase gate - controlled u3 gate - swap gate
bn_bn: একটি কিউবিটের উপরে কার্যরত একটি যুক্তিবর্তনী, যা আরেকটি কিউবিটের অবস্থার সাপেক্ষে শর্তাধীন, নিয়ে একটি সাধারণ একাধিক কিউবিট যুক্তিবর্তনী (গেইট) তৈরি হয়। যেমন, আমরা হয়ত দ্বিতীয় কিউবিটের অবস্থা উল্টে দিতে চাই যখন প্রথম কিউবিটের মান :math:`\left|0\right\rangle`। এরকম যুক্তিবর্তনীকে (গেইট) *নিয়ন্ত্রিত যুক্তিবর্তনী* বলা হয়। আদর্শ একাধিক কিউবিট যুক্তিবর্তনীতে দ্বি-কিউবিট এবং ত্রি-কিউবিট যুক্তিবর্তনী থাকে। দ্বি-কিউবিট যুক্তিবর্তনীগুলো হলো: - নিয়ন্ত্রিত পাউলি যুক্তিবর্তনী (গেইট) - নিয়ন্ত্রিত হ্যাডামার্ড হ্যাডামার্ড যুক্তিবর্তনী - নিয়ন্ত্রিত ঘূর্ণন হ্যাডামার্ড যুক্তিবর্তনী - নিয়ন্ত্রিত দশা যুক্তিবর্তনী (গেইট)- নিয়ন্ত্রিত U3 যুক্তিবর্তনী - অদলবদল (সোয়াপ) যুক্তিবর্তনী (গেইট)।
es_un: Una compuerta común de múltiples qubits implica la aplicación de una compuerta a un qubit condicionado al estado de otro qubit. Por ejemplo, podríamos querer cambiar el estado del segundo qubit cuando el primer qubit está en :math:`\left|0\right\rangle`. Estas compuertas son conocidas como *compuertas controladas*. Las compuertas estándar de múltiples qubits consisten en compuertas de dos qubits y de tres qubits. Las compuertas de dos qubits son: - compuertas de Pauli controladas - compuerta Hadamard controlada - compuertas de rotación controladas - compuerta de fase controlada - compuerta u3 controlada - compuerta de intercambio
fr_fr: Une porte multiqubit simple implique l'application d'une porte à un qubit, conditionnée à l'état d'un autre qubit. Par exemple, nous pourrions faire basculer l'état du deuxième qubit lorsque le premier qubit est en :math:` \left | 0\right\rangle `. Ces portes sont connues sous le nom de "portes contrôlées" *. Les portes multi-qubits standard se composent de portes avec deux qubits et de portes avec trois qubit.s Les portes de deux qubits sont: - les portes de Pauli - les portes Hadamard contrôlées - les portes de rotation contrôlée -les portes de contrôle de phase - la porte contrôlée u3 - la poste de permutation (swap)
id_id: Sebuah gate multi-qubit umum melibatkan aplikasi dari sebuah gate ke satu qubit, dikondisikan dengan state dari qubit lain. Misalnya, kita mungkin ingin membalik state dari qubit kedua ketika qubit pertama adalah :math:` \left | 0\right\rangle `. Gate tersebut dikenal sebagai *gate terkontrol*. Gate multi-qubit standar terdiri dari gate dua qubit dan gate tiga qubit. Gate dua qubit adalah: -gate Pauli terkontrol - gate Hadamard terkontrol - gate rotasi terkontrol - gate phase terkontrol - gate u3 ternkontrol - gate swap
it_it: Un tipico gate a più qubit comprende l'applicazione di un gate ad un qubit, condizionata dallo stato di un altro qubit. Ad esempio, si potrebbe voler invertire lo stato del secondo qubit quando il primo qubit è nello stato :math:`\left|0\right\rangle`. Tali gate sono conosciuti come *gate controllati*. Il tipico gate a più qubit consiste di gate a due e tre qubit. I gate a due qubit sono: - gate di Pauli controllati - gate di Hadamard controllati - gate di rotazione controllati - gate di fase controllati - gate u3 controllati - swap gate
ja: 複数 qubit ゲートに共通なものとして、一つの qubit にゲートを適用し、別の qubit の状態に応じて制御するというものがあります。例えば、最初の qubit が :math:`\left|0\right\rangle` の時に、2つ目の qubit の状態をフリップしたい場合があります。このようなゲートは *制御ゲート* と知られています。標準的な複数 qubit ゲートは 2 qubit ゲートと 3 qubit ゲートから構成されています。2 qubit ゲートは： - 制御パウリゲート -制御アダマールゲート - 制御回転ゲート - 制御位相ゲート - 制御 u3 ゲート -スワップゲート です。
ko_kr: 일반적인 다중 큐비트 게이트는 한 큐비트에 가하는 게이트나 다른 큐비트에 조건부로 작용하는 게이트나 그 응용을 모두 포함한다. 예를들어 첫번째 큐비트이 :math:`\left|0\right\rangle` 일 때 두번째 큐비트가 플립되는 게이트를 고려하자. 이러한 게이트는 *제어 게이트* (controlled gates)로 알려져 있다. 표준 다중 큐비트 게이트는 두 큐비트 게이트와 세 큐비트 게이트로 구성되어 있는데 두 비트 게이트에는 -제어 파울리 게이트 (controlled Pauli gates) - 제어 하다마드 게이트 (controlled Hadamard gate) - 제어 회전 게이트 (controlled rotation gates) - 제어 위상 게이트 (controlled phase gate) - 제어 u3게이트 (controlled u3 gate) - 교환 게이트 (swap gate)가 있으며
pt_br: Uma porta de múltiplos qubits comum envolve a aplicação de uma porta de um único qubit, condicionada pelo estado de outro qubit. Por exemplo, podemos desejar inverter o estado do segundo qubit, quando o primeiro estiver em :math:`\left|0\right\rangle`. Tais portas são conhecidas como *portas controladas*. A portas padrão de múltiplos qubits consistem de portas de dois qubits e três qubits. As portas de dois qubits são: - portas Pauli controladas - porta Hadamard controlada - portas de rotação controladas - portas de fase controladas - porta u3 controlada - porta swap
ru: Обычно многокубитные вентили означают применение вентиля к одному кубиту в зависимости от состояния другого. Примером может служить битовый переворот второго кубита при условии, что первый находится в состоянии :math:`\left|0\right\rangle`. Такие вентили называются *управляемыми*. Многокубитные вентили составляются из двухкубитных и трехкубитных. К двухкубитным относятся: - управляемые вентили Паули - управляемый вентиль Адамара - управляемые вентили вращения - управляемый фазовый вентиль - управляемый вентиль u3 - обменный вентиль
sw_ke: Lango la kawaida la qubit nyingi linajumuisha utekelezaji wa lango kwenye qubit moja, kulingana na masharti kutoka kwenye hali ya qubit nyingine. Kwa mfano, tunaweza kutaka kupindua hali ya qubit ya pili wakati qubit ya kwanza iko katika hali ya :math:`\left|0\right\rangle`. Malango ya aina hiyo yanajulikana kama *malango yanayodhibitiwa (controlled gates)*. Malango ya kawaida ya qubit nyingi yanajumuisha malango ya qubit mbili na malango ya qubit tatu. Malango ya qubit mbili ni: - Malango ya Pauli yaliyodhibitiwa - lango la Hadamard linalodhibitiwa - malango ya mzunguko yanayodhibitiwa - lango la awamu linalodhibitiwa - lango la u3 linalodhibitiwa - lango la kubadilishana (swap gate)
ta: ஒரு பொதுவான பல-விகிதமான வாயிலாக ஒரு வாயிலாக ஒரு விரைவில் பயன்பாட்டை உள்ளடக்கி, மற்றொரு குறும்படத்தின் மாநிலத்தில் காத்திருந்தது. உதாரணமாக, முதல் குவிட் :math:`\left |0\right\rangle`. இத்தகைய வாயுக்கள் * கட்டுப்படுத்தப்பட்ட வாயுக்கள் * என அறியப்படுகின்றன. நிலையான பெரும்பாலான வாயுக்கள் இரு-கிபைட் வாயுக்கள் மற்றும் மூன்று-கிட் வாயுக்கள் கொண்டது. இரு-கிட் வாயுக்கள்: - கட்டுப்படுத்தப்பட்ட பவுலி வாயில்கள்-கட்டுப்படுத்தப்பட்ட ஹாமார்டு வாயில்-கட்டுப்படுத்தப்பட்ட சுழற்சி வாயில்கள்-கட்டுப்படுத்தப்பட்ட கட்டமைப்பின் வாயிலாக-கட்டுப்படுத்தப்பட்ட u3 வாயில்-swap வாயிலாக
tr: Ortak bir çoklu-kübit geçidi, bir kapının bir kübite , başka bir kubitin durumuna bağlı olarak uygulanmasını içerir. Örneğin, ilk kübit :math:`\left|0\right\rangle` olduğunda zaman ikinci kübitin durumunu çevirmek isteyebiliriz. Bu tür kapılar *kontrollü kapılar* olarak bilinir. Standart çoklu-kübit kapıları iki-kübitli kapılar ve üç-qubitli kapılardan oluşur. İki kübitli kapılar: - kontrollü Pauli kapıları - kontrollü Hadamard kapısı - kontrollü döndürme kapıları - kontrollü faz kapısı - kontrollü u3 kapısı - takas kapısı

source: The three-qubit gates are: - Toffoli gate - Fredkin gate
bn_bn: তিন-কিউবিট যুক্তিবর্তনী (গেইট) - টফোলি যুক্তিবর্তনী (গেইট) - ফ্রেডকিন যুক্তিবর্তনী (গেইট)
es_un: Las compuertas de tres qubits son: - Compuerta de Toffoli - Compuerta de Fredkin
fr_fr: Les portes à trois qubits sont:- la porte de Toffoli - la porte de Fredkin
id_id: Gerbang tiga qubit adalah: - gate Toffoli - gate Fredkin
it_it: I gate a tre qubit sono: - gate di Toffoli - gate di Fredkin
ja: 3量子ビットゲートは: - トフォリゲート -フレドキンゲートです。
ko_kr: 세 큐비트 게이트에는 - Toffoli gate - Fredkin gate가 있다.
pt_br: As portas de três qubits são: - Porta Toffoli - Porta Fredkin
ru: Ктрехкубитным: - вентиль Тоффоли - вентиль Фредкина
sw_ke: Malango ya qubit tatu ni: - lango la Toffoli - lango la Fredkin
ta: மூன்று-கிட் வாயில்கள்: - Toffoli gate-Fredkin gate
tr: Üç-kübitli kapılar: - Toffoli kapısı - Fredkin kapısı

source: Two-qubit gates
bn_bn: দ্বি-কিউবিট যুক্তিবর্তনীসমূহ (গেইট)
es_un: Compuertas de dos qubits
fr_fr: Portes à deux qubits
id_id: Gate dua qubit
it_it: Gate a due qubit
ja: 2量子ビット(two-qubit) ゲート
ko_kr: 이중 큐비트 게이트
pt_br: Portas de dois qubits
ru: Двухкубитные вентили
sw_ke: Malango ya qubit mbili
ta: இரண்டு-மேற்கோள் வாயுக்கள்
tr: İki-kübitli kapılar

source: Most of the two-qubit gates are of the controlled type (the SWAP gate being the exception). In general, a controlled two-qubit gate :math:`C_{U}` acts to apply the single-qubit unitary :math:`U` to the second qubit when the state of the first qubit is in :math:`\left|1\right\rangle`. Suppose :math:`U` has a matrix representation
bn_bn: দ্বি-কিউবিট যুক্তিবর্তনীগুলোর (গেইট) বেশিরভাগ হচ্ছে নিয়ন্ত্রিত ধরণের (অদলবদল (সোয়াপ) যুক্তিবর্তনী বাদে)। সাধারণত, একটি নিয়ন্ত্রিত দ্বি-কিউবিট যুক্তিবর্তনী (গেইট) :math:`C_{U}` দ্বিতীয় কিউবিটে একটি একক কিউবিট ঐকিক (ইউনিটারি) :math:`U` প্রয়োগ করে প্রথম কিউবিট :math:`\left|1\right\rangle` অবস্থায় থাকে। যেমন, :math:`U` এর একটি ম্যাট্রিক্স রূপ হল
es_un: La mayoría de las compuertas de dos qubits son del tipo controlado (la compuerta SWAP es la excepción). En general, una compuerta controlada de dos qubits :math:`C_{U}` actúa para aplicar una transformación unitaria :math:`U` de un qubit al segundo qubit cuando el estado del primer qubit está en :math:`\left|1\right\rangle`. Supongamos que :math:`U` tiene una representación matricial
fr_fr: La plupart des portes à deux qubits sont de type contrôlé (la porte SWAP étant l'exception). En général, une porte à deux qubits contrôlée :math:`C_{U}` agit pour appliquer l'unitaire a simple qubit :math:`U` au second qubit lorsque l'état du premier qubit est en :math:`\left|1\right\rangle`. Supposons que :math:`U` ait une représentation matricielle
id_id: Sebagian besar gate dua qubit adalah gate terkontrol (kecuali gate SWAP). Secara umum, sebuah gate dua qubit terkendali :math:` C_{U}` bertindak untuk menerapkan unitary satu qubit :math:` U ` ke qubit kedua bila state qubit pertama adalah :math:` \left | 1\right\rangle `. Misalkan :math:` U ` memiliki representasi matriks
it_it: La maggior parte dei gate a due qubit sono di tipo controllato (con l'eccezione del gate SWAP). In generale, un gate a due qubit controllato :math:`C_{U}` agisce applicando il gate untario a singolo qubit :math:`U` al secondo qubit quando il primo qubit è nello stato :math:`\left|1\right\rangle`. Si supponga che :math:`U` abbia una rappresentazione matriciale
ja: 多くの2量子ビットゲートは制御タイプのものです（SWAP ゲートは例外になります）。一般的に、制御2量子ビットゲート :math:`C_{U}` は 最初の量子ビットが :math:`\left|1\right\rangle` の時に、2つ目の量子ビットに対して単独量子ビット :math:`U` を適用します。 :math:`U` が以下の行列表示であるとします。
ko_kr: 대부분의 두 큐비트 게이트들은 다른 큐비트에 의해 조절되는 유형이다. (SWAP 게이트는 예외) 일반적으로 다른 큐비트에 의해 조절되는 두 큐비트 게이트 :math:`C_{U}` 는 첫번째 큐비트의 상태가 :math:`\left|1\right\rangle` 일 때 단일 큐비트 유니터리 :math:`U` 를 두번째 큐비트에 가하는 식이다. 유니터리 :math:`U` 가 다음 행렬이라고 가정하자.
pt_br: A maioria das portas de dois qubits é do tipo controlado (a porta SWAP sendo a exceção). Em geral, uma porta de dois qubits controlada :math:`C_{U}` atua aplicando a unitária de um qubit :math:`U` ao segundo qubit ,quando o estado do primeiro qubit está em :math:`\left|1\right\rangle`. Suponha que :math:`U` tenha uma representação matricial
ru: Большинство двухкубитных вентилей относятся к управляемым (за исключением SWAP). Все управляемые двухкубитные вентили :math:`C_{U}` применяют однокубитный :math:`U` ко второму кубиту, если первый находится в состоянии :math:`\left|1\right\rangle`. Допустим, что матричное представление :math:`U` имеет вид
sw_ke: Mengi ya malango ya qubit mbili ni ya aina iliyodhibitiwa (isipokuwa lango la kubadilishana (SWAP gate)). Kwa ujumla, lango la qubit mbili linalodhibitiwa :math:`C_{U}` hutumika kutekeleza hesabu ya matriki ya umoja (unitary) ya qubit moja :math:`U` kwenye qubit ya pili wakati hali ya qubit ya kwanza iko katika hali ya :math:`\left|1\right\rangle`. Tuseme kwamba :math:`U` ina uwakilishi wa matriki
ta: பெரும்பாலான இரு-கிட் வாயில்கள் கட்டுப்படுத்தப்பட்ட வகை (SWAP கிட்டத்தினை வித்தியாசமாக இருப்பது). பொதுவாக, ஒரு கட்டுப்படுத்தப்பட்ட இரண்டு-விகிதமான வாயில் :math:`C_{U}` செயல்பாடு ஒற்றை-விகிதமான :math:`U` க்கு இரண்டாவது குறும்படம் :math:`\left|1\right\rangle`. சாதாரண :math:`U` க்கு மேட்ரிக்ஸ் பிரதிநிதித்துவம் உள்ளது
tr: İki-kubitli kapıların çoğu kontrollü tiptedir (SWAP kapısı istisnadır). Genel olarak, bir kontrollü iki-kubit kapısı :math:`C_{U}`, ilk kübitin durumu :math:`\left|1\right\rangle` olduğunda tek-kübit üniter :math: `U` 'yi, ikinci kübite uygular. Diyelim ki :math:`U` bir matris temsiline sahip

source: We can work out the action of :math:`C_{U}` as follows. Recall that the basis vectors for a two-qubit system are ordered as :math:`\left|00\right\rangle, \left|01\right\rangle, \left|10\right\rangle, \left|11\right\rangle`. Suppose the **control qubit** is **qubit 0** (which, according to Qiskit's convention, is one the *right-hand* side of the tensor product). If the control qubit is in :math:`\left|1\right\rangle`, :math:`U` should be applied to the **target** (qubit 1, on the *left-hand* side of the tensor product). Therefore, under the action of :math:`C_{U}`, the basis vectors are transformed according to
es_un: Podemos determinar la acción de :math:`C_{U}` de la siguiente manera. Recuerda que los vectores base de un sistema de dos qubits son ordenados como :math:`\left|00\right\rangle, \left|01\right\rangle, \left|10\right\rangle, \left|11\right\rangle`. Supón que el **qubit control** es **qubit 0** (que de acuerdo con las convenciones de Qiskit, es el que está del lado *derecho* del producto tensorial). Si el qubit control está en :math:`\left|1\right\rangle`, se debe aplicar :math:`U` al **objetivo** (el qubit 1, del lado *izquierdo* del producto tensorial). Por lo tanto, bajo la acción de :math:`C_{U}`, los vectores base son transformados acorde a
fr_fr: Nous pouvons définir l'action de :math:`C_{U}` comme suit. Rappelez-vous que les vecteurs de base pour un système à deux qubits sont ordonnés comme ceci: :math:`\left|00\rdroit\r\left|01\right\rangle, \left|10\right\rangle, \left|11\right\rangle`. Supposons que le **qubit de contrôle ** soit **qubit 0** (ce qui, selon la convention de Qiskit, est du côté *droit* du produit de tenseur). Si le qubit de contrôle est en :math:`\left|1\right\rangle`, :math:`U` devrait être appliqué à la **cible** (qubit 1, du côté *gauche* du produit de tenseur). Par conséquent, sous l'action de :math:`C_{U}`, les vecteurs de base sont transformés en fonction de
ru: Рассмотрим принцип действия :math:`C_{U}`. Базис двухкубитной системы упорядочен следующим образом :math:`\left|00\right\rangle, \left|01\right\rangle, \left|10\right\rangle, \left|11\right\rangle`. Пусть **контролирующим** является **кубит 0** (расположенный, как принято в Qiskit, *справа* в тензорном произведении). Если он находится в состоянии :math:`\left|1\right\rangle`, :math:`U` будет применен к **целевому** кубиту 1(расположенному *слева* в тензорном произведении). Тогда :math:`C_{U}` изменяет базисные вектора следующим образом

source: In matrix form, the action of :math:`C_{U}` is
bn_bn: ম্যাট্রিক্সরূপে, :math:`C_{U}` এর কাজ হচ্ছে
es_un: En forma de matriz, la acción de :math:`C_{U}` es
fr_fr: Sous forme de matrice, l'action de :math:` C_{U}` est
id_id: Dalam bentuk matriks, aksi dari :math:` C_{U}` adalah
it_it: In forma matriciale, l'azione di :math:`C_{U}` è
ja: 行列形式では、 :math:`C_{U}` の作用は
ko_kr: :math:`C_{U}` 를 행렬로 나타내면 다음과 같다.
pt_br: Em sua forma matricial, a ação de :math:`C_{U}` é
ru: В матричном виде действие :math:`C_{U}` означает
sw_ke: Katika muundo wa matriki, utekelezaji wa :math:`C_{U}` ni
ta: மாட்ரிக்ஸ் வடிவில், :math:`C_{U}`
tr: Matris biçiminde, :math:`C_{U}` eylemi

source: To work out these matrix elements, let
bn_bn: এইসকল ম্যাট্রিক্স উপাদানগুলোর কাজ করার জন্য, ধরা যাক
es_un: Para elaborar estos elementos de la matriz, digamos que
fr_fr: Pour trouver ces éléments de la matrice, prenons
id_id: Untuk mengetahui elemen-elemen matriks ini, biarkan
it_it: Per arrivare a questi elementi di matrice, si consideri
ja: これらのマトリックス要素を処理するには、
ko_kr: 이러한 행렬 성분을 알아내려면,
pt_br: Para encontrar estes elementos da matriz, considere
ru: Для определения матричные элементов, запишем их как
sw_ke: Ili kusuluhisha hivi vipengee vya matriki, wacha
ta: இந்த மாட்ரிக்ஸ் தனிமங்கள் வெளியே வேலை செய்யவும்
tr: Bu matris elemanlarını çözmek için

source: compute the action of :math:`C_{U}` (given above), and compute the inner products.
bn_bn: -এর কাজ (উপরের প্রদত্ত) :math:`C_{U}` -এর পদক্ষেপ গণনা করতে দাও এবং অভ্যন্তরীন গুণফল গণনা করতে দাও।
es_un: calcula la acción de :math:`C_{U}` (dada anteriormente), y calcula los productos internos.
fr_fr: calcule l'action de :math:`C_{U}` (donné ci-dessus) et calcule les produits intérieurs.
id_id: menghitung aksi dari :math:` C_{U}` (seperti di atas), dan menghitung produk dalam.
it_it: si calcoli l'azione di :math:`C_{U}` (data sopra), e si calcolino i prodotti interni.
ja: として、 :math:`C_{U}` (上記のもの)を作用させ、内積を計算することで導出されます。
ko_kr: 위에 주어진 :math:`C_{U}` 의 작용을 먼저 계산하고 내적을 계산한다.
pt_br: calcule a ação de :math:`C_{U}` (dado acima), e calcule os produtos internos.
ru: применим :math:`C_{U}` (как показано выше) и посчитаем скалярные произведения.
sw_ke: kokotoa utekelezaji wa :math:`C_{U}` (iliyotolewa hapo juu), na kokotoa inner products.
ta: :math:`C_{U}` (மேலே கொடுக்கப்பட்ட) நடவடிக்கையை ஒழுங்குபடுத்தவும், மற்றும் உட்புற பொருட்களை கட்டமைக்கவும்.
tr: :math:`C_{U}` (yukarıda verilen) eylemini hesaplayın ve iç çarpımları hesaplayın.

source: As shown in the examples below, this operation is implemented in Qiskit as ``cU(q[0],q[1])``.
bn_bn: নিম্নলিখিত উদাহরণে যেমনটি দেখানো হয়েছে, এই ক্রিয়াকলাপ (অপারেশন) Qiskit-এ এভাবে বাস্তবায়ন করা হয়েছে ``cU(q[0],q[1])``।
es_un: Como se muestra en los ejemplos siguientes, esta operación es implementada en Qiskit como ``cU (q[0], q[1])``.
fr_fr: Comme le montrent les exemples ci-dessous, cette opération est implémentée dans Qiskit sous la forme ` ` cU (q[0], q[1]) ` `.
id_id: Seperti pada contoh di bawah ini, operasi ini diimplementasikan di Qiskit sebagai ` ` ` cU (q[0], q[1]) ` `.
it_it: Come mostrato negli esempi di seguito, questa operazione è implementata in Qiskit come ``cU(q[0],q[1])``.
ja: 以下の例に示すように、この操作は Qiskit では ``cU(q[0],q[1])`` として実装されています。
ko_kr: 아래 예에서 볼 수 있듯이 이 연산은 Qiskit에서 ``cU(q[0],q[1])`` 로 구현되어 있다.
pt_br: Como mostrado nos exemplos abaixo, esta operação é implementada no Qiskit como ``cU(q[0],q[1])``.
ru: Как показано ниже, эта операция реализована в Qiskit как ``cU(q[0],q[1])``.
sw_ke: Kama ilivyoonyeshwa katika mifano iliyo hapo chini, operesheni hii imetekelezwa kwenye Qiskit kama ``cU(q[0],q[1])``.
ta: கீழே எடுத்துக்காட்டாக காட்டப்பட்டதால், இந்த செயல்பாடு Qiskit இல் ``cu (q[0], q[1])``.
tr: Aşağıdaki örneklerde gösterildiği gibi, bu işlem Qiskit'te ``cU(q[0],q[1])`` olarak uygulanır.

source: If **qubit 1 is the control and qubit 0 is the target**, then the basis vectors are transformed according to
bn_bn: যদি **কিউবিট ১ নিয়ন্ত্রক এবং কিউবিট ০ নিয়ন্ত্রিত হয়**, তাহলে একক দিকরাশিসমূহ (বেসিস ভেক্টর) এভাবে পরিবর্তিত হবে
es_un: Si **qubit 1 es el de control y qubit 0 es el objetivo**, entonces los vectores base se transforman de acuerdo con
fr_fr: Si ** qubit 1 est le contrôle et qubit 0 est la cible * *, les vecteurs de base sont transformés selon
id_id: Jika **qubit ke 1 adalah kontrol dan qubit ke 0 adalah target**, maka vektor dasar diubah sesuai dengan
it_it: Se **il qubit 1 è il qubit di controllo e il qubit 0 è quello target**, allora i vettori di base vengono trasformati secondo
ja: もし **量子ビット1 が制御で、量子ビット 0 が ターゲット** の場合には、基底ベクトルは次のもので変換されます。
ko_kr: 만약 **큐비트 1이 제어 큐비트 그리고 큐비트 0이 표적 큐비트** 이라면, 기저 벡터는 다음과 같이 변환된다.
pt_br: Se **o qubit 1 é o controle e o qubit 0 é o alvo**, então os vetores da base são transformados, de acordo com
ru: Если же **кубит 1 является управляющим, а кубит 0 — целевым**, то базисные вектора преобразуются иначе
sw_ke: Ikiwa **qubit 1 ndiyo qubit iliyodhibitiwa na qubit 0 ndiyo qubit lengwa**, basi vekta msingi hubadilishwa kulingana na
ta: **குவிட் 1 என்பது கட்டுப்பாடாகவும், குவிட் 0 இலக்கு** ஆகவும் இருந்தால், அடிப்படை திசையன்கள் அதற்கேற்ப மாற்றப்படுகின்றன
tr: **kübit 1 kontrol ve kübit 0 hedef** ise, temel vektörler şuna göre dönüştürülür

source: which implies the matrix form of :math:`C_{U}` is
bn_bn: যা থেকে প্রতীয়মান হয়ে যে :math:`C_{U}` এর ম্যাট্রিক্সরূপ হছে
es_un: lo que implica que la forma matricial de :math:`C_{U}` sea
fr_fr: qui implique que la forme matricielle de :math:` C_{U}` est
id_id: yang berarti bentuk matriks dari :math:` C_{U}` adalah
it_it: che implica che la forma matriciale di :math:`C_{U}` sia
ja: この場合の :math:`C_{U}` の行列表示は次のようになります。
ko_kr: 이는 :math:`C_{U}` 의 행렬 형태가 다음과 같음을 의미한다.
pt_br: o que implica que a forma matricial de :math:`C_{U}` é
ru: это означает, что матричный вид :math:`C_{U}` будет следующим
sw_ke: ambayo inaashiria kwamba mfumo wa matriki wa :math:`C_{U}` ni
ta: இது :math:`C_{U}`
tr: :math:`C_{U}` 'nın matris formunu gösterir

source: Controlled Pauli Gates
bn_bn: নিয়ন্ত্রিত পাউলি যুক্তিবর্তনী
es_un: Compuertas de Pauli Controladas
fr_fr: Portes de Pauli contrôlées
id_id: Gate Pauli terkontrol
it_it: Gate di Pauli controllati
ja: 制御パウリゲート
ko_kr: 제어 파울리 게이트(Controlled Pauli Gate)
pt_br: Portas Pauli Controladas
ru: Управляемые вентили Паули
sw_ke: Malango ya Pauli Yaliyodhibitiwa
ta: கட்டுப்படுத்தப்பட்ட பவுலா ஜேட்ஸ்
tr: Kontrollü Pauli Kapıları

source: Controlled-X (or, controlled-NOT) gate
fr_fr: Porte Controllée-X (ou, contrôlée-NOT)
id_id: Gate kontrol-X (atau, kontrol-NOT)
it_it: Gate X controllato (o controlled-NOT)
pt_br: Porta X controlada (or, Não controlada)
sw_ke: Lango la X-linalodhibitiwa ( au NOT linalodhibitiwa)

source: The controlled-not gate flips the ``target`` qubit when the control qubit is in the state :math:`\left|1\right\rangle`. If we take the MSB as the control qubit (e.g. ``cx(q[1],q[0])``), then the matrix would look like
fr_fr: La porte contrôlée-NOT inverse le qubit ` ` cible ` ` lorsque le qubit de contrôle est dans l'état :math:` \left | 1\right\rangle `. Si nous prenons le MSB comme qubit de contrôle (par exemple ` ` cx (q[1], q[0]) ` `), alors la matrice ressemblera à

source: However, when the LSB is the control qubit, (e.g. ``cx(q[0],q[1])``), this gate is equivalent to the following matrix:
es_un: Sin embargo, cuando el LSB es el qubit control, (por ejemplo, ``cx(q[0],q[1])``), esta compuerta es equivalente a la siguiente matriz:
fr_fr: Cependant, lorsque le LSB est le qubit de contrôle (par exemple "cx" (q[0], q[1]) ` `), cette porte est équivalente à la matrice suivante:
ru: А если управляющим является младший кубит (то есть ``cx(q[0],q[1])``), вентиль эквивалентен матрице:

source: Controlled :math:`Y` gate
bn_bn: কন্ট্রোল্ড :math:`Y` যুক্তিবর্তনী (গেইট)
es_un: Compuerta :math:`Y` controlada
fr_fr: Porte controllée :math:`Y`
id_id: Gerbang Controlled :math:`Y`
it_it: Gate :math:`Y` controllato
ja: 制御 :math:`Y` ゲート
ko_kr: 제어 :math:`Y` 게이트 (Controlled Y Gate)
pt_br: Porta :math:`Y` controlada
sw_ke: Lango la :math:`Y` Lililodhibitiwa
ta: கட்டுப்படுத்தல் :math:`Y` வாயில்
tr: Kontrollü :math:`Y` kapısı
