Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/3_summary_of_quantum_operations.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja, ko_kr, pt_br, ru, sw_ke, ta, tr

source: This page was generated from `tutorials/circuits/3_summary_of_quantum_operations.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/circuits/3_summary_of_quantum_operations.ipynb`__ থেকে নেয়া হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/circuits/3_summary_of_quantum_operations.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/circuits/3_summary_of_quantum_operations.ipynb`__.
id_id: Halaman ini disadur dari ` tutorials/circuits/1_getting_started_with_qiskit.ipynb ` __.
it_it: Questa pagina è stata generata a partire da `tutorials/circuits/3_summary_of_quantum_operations.ipynb`__.
ja: 当ページは `tutorials/circuits/3_summary_of_quantum_operations.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/circuits/3_summary_of_quantum_operations.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada, a partir do `tutoriais/circuitos/3_resumo_de_operações_quantum.ipynb`__.
ru: Страница создана на основе `tutorials/circuits/3_summary_of_quantum_operations.ipynb`__.
sw_ke: Ukurasa huu umezalishwa kutoka `tutorials/circuits/3_summary_of_quantum_operations.ipynb`__.
ta: இந்த பக்கம் `tutorials/circuits/1_getting_started_with_qiskit.ipynb`__ இல் இருந்து உருவாக்கப்பட்டது.
tr: Bu sayfa `tutorials/circuits/3_summary_of_quantum_operations.ipynb`__ adresinden oluşturulmuştur.

source: Summary of Quantum Operations
bn_bn: কোয়ান্টাম প্রক্রিয়ার সারমর্ম
es_un: Resumen de Operaciones Cuánticas
fr_fr: Liste des opérateurs quantiques
id_id: Ringkasan Operasi Quantum
it_it: Riepilogo delle Operazioni Quantistiche
ja: 量子操作の概要
ko_kr: 양자 연산 요약
pt_br: Resumo das Operações Quânticas
ru: Перечень квантовых операций
sw_ke: Muhtasari wa Operesheni za Kwanta
ta: Quantum செயல்பாடுகளின் சுருக்கம்
tr: Kuantum İşlemlerinin Özeti

source: In this section we will go into the different operations that are available in Qiskit Terra. These are: - Single-qubit quantum gates - Multi-qubit quantum gates - Measurements - Reset - Conditionals - State initialization
fr_fr: Dans cette section, nous aborderons les différents opérateurs disponibles dans Qiskit Terra. Ils sont : - Portes quantiques simples - Portes quantiques multi-qubit - Mesures - Reset - operateurs Conditionels - opérations d'initialisation d'état

source: We will also show you how to use the three different simulators: - unitary\_simulator - qasm\_simulator - statevector\_simulator
fr_fr: Nous vous montrerons également comment utiliser les trois simulateurs différents:-unitaire\_simulateur-qasm\_simulateur de vecteur d'état\_simulateur

source: Single Qubit Quantum states
bn_bn: একক কিউবিট কোয়ান্টাম অবস্থা (স্টেট)
es_un: Estados cuánticos de un qubit
fr_fr: Etats quantiques d'un Qubit unitaire
id_id: Singel Kubit Kuantum State
it_it: Stati quantistici di un singolo qubit
ja: 単一量子ビット量子状態
ko_kr: 단일 큐비트 양자 상태
pt_br: Estados quânticos de um único qubit
ru: Однокубитные квантовые состояния
sw_ke: Hali za kwanta za qubit moja
ta: ஒற்றை குப்ட் குவாண்டம் நிலைகள்
tr: Tek Kübit Kuantum durumları

source: A single qubit quantum state can be written as
bn_bn: একটি একক কিউবিট কোয়ান্টাম অবস্থা (স্টেট) নিম্নরূপে লেখা যায়
es_un: Un estado cuántico de un qubit se puede escribir como
fr_fr: L'état quantique d'un seul qubit peut être écrit en tant que
id_id: Sebuah state kuantum qubit tunggal dapat ditulis sebagai
it_it: Lo stato quantistico di un singolo qubit può essere descritto così
ja: 単一量子ビット量子状態は次のように記述できます。
ko_kr: 단일 큐비트 양자 상태는 다음과 같이 기술할 수 있다
pt_br: O estado quântico de um qubit pode ser escrito como
ru: Квантовое состояние отдельного кубита можно записать в виде
sw_ke: Hali ya kwanta yenye qubit moja inaweza kuandikwa kama
ta: ஒரே ஒரு குவிட் குவாண்டம் கூறு என எழுதலாம்
tr: Tek bir kübit kuantum durumu şu şekilde yazılabilir

source: where :math:`\alpha` and :math:`\beta` are complex numbers. In a measurement the probability of the bit being in :math:`\left|0\right\rangle` is :math:`|\alpha|^2` and :math:`\left|1\right\rangle` is :math:`|\beta|^2`. As a vector this is
bn_bn: যেখানে :math:`\alpha` এবং :math:`\beta` জটিল সংখ্যা। এখানে :math:`\left|0\right\rangle` দশা পরিমাপণের সম্ভাব্যতা হচ্ছে :math:`|\alpha|^2` এবং :math:`\left|1\right\rangle` দশা পরিমাপণের সম্ভাব্যতা হচ্ছে :math:`|\beta|^2`। দিকরাশি হিসেবে যা
es_un: donde :math:`\alpha` y :math:`\beta` son números complejos. En una medición, la probabilidad de que el bit esté en :math:`\left|0\right\rangle` es :math:`|\alpha|^2` y :math:`\left|1\right\rangle` es :math:`|\beta|^2`. Como vector esto es
fr_fr: où :math:`\alpha` et :math:`\beta` sont des nombres complexes. Dans une mesure, la probabilité que le bit soit dans :math:`\left|0\right\rangle est :math:`|\alpha|^2` et :math:`\left|1\right\rangle` est :math:`|\beta|^2`. En tant que vecteur, c'est
id_id: dimana :math:` \alpha ` dan :math:` \beta ` adalah bilangan kompleks. Dalam pengukuran probabilitas bit berada di :math:` \left | 0\right\rangle ` adalah :math:` | \alpha | ^ 2 ` dan :math:` \left | 1\right\rangle ` adalah :math:` | \beta | ^ 2 `. Sebagai vektor ini adalah
it_it: dove :math:`\alpha` e :math:`\beta` sono numeri complessi. La probabilità che il qubit dia come risultato della misura :math:`\left|0\right\rangle` è data da :math:`|\alpha|^2`, mentre quella che dia come risultato :math:`\left|1\right\rangle` è data da :math:`|\beta|^2`. Sotto forma di vettore, lo stato si indica
ja: ここでの :math:`\alpha` と :math:`\beta` は複素数です。測定において、ビットが :math:`\left|0\right\rangle` になる確率は :math:`|\alpha|^2` 、:math:`\left|1\right\rangle` になる確率は :math:`|\beta|^2` です。ベクトルとしては、次のように記述できます。
ko_kr: 여기서 :math:`\alpha` 및 :math:`\beta` 는 복소수이다. 측정에서 큐비트가 :math:`\left|1\right\rangle` 에 있을 확률은 :math:`|\alpha|^2` 이고 :math:`\left|1\right\rangle` 은 :math:`|\beta|^ 2`. 벡터로서 이것은
pt_br: onde :math:`\alpha` e :math:`\beta` são números complexos. Em uma medição, a probabilidade do bit estar em :math:`\left|0\right\rangle` é :math:`|\alpha|^2` e em :math:`\left|1\right\rangle` é :math:`|\beta|^2`. Representando como um vetor isso é
ru: где :math:`\alpha` и :math:`\beta` — комплексные числа. При этом вероятность того, что кубит при измерении окажется в состоянии :math:`\left|0\right\rangle` равна :math:`|\alpha|^2` , а в состоянии :math:`\left|1\right\rangle` — :math:`|\beta|^2`. Можно записать это в виде вектора
sw_ke: pale ambapo :math:`\alpha` na :math:`\beta` ni namba changamani. Katika kipimo, uwezekano wa bit kuwa kwenye :math:`\left|0\right\rangle` ni :math:`|\alpha|^2` na :math:`\left|1\right\rangle` ni :math:`|\beta|^2`. Kama vekta, hii ni
ta: எங்கே :math:`\alpha` மற்றும் :math:`\beta` என்பது சிக்கலான எண்கள். ஒரு அளவீட்டில் பிட் இருப்பதற்கான நிகழ்தகவு :math:`\left|0\right\rangle` is :math:`|\alpha|^2` and :math:`\left|1\right\rangle` is :math:`|\beta|^2`. ஒரு திசையன் இது
tr: burada :math:`\alpha` and :math:`\beta` karmaşık sayılardır. Bir ölçümde, bitin :math:`\left|0\right\rangle` olma olasılığı :math:`|\alpha|^2` dir ve :math:`\left|1\right\rangle` olma olasılığı :math:`|\beta|^2` dir. Bir vektör olarak bu

source: \left|\psi\right\rangle = \begin{pmatrix} \alpha \\ \beta \end{pmatrix}.
fr_fr: \left|\psi\right\rangle = \start{pmatrix} \alpha \\ \beta \end{pmatrix}.

source: Note, due to the conservation of probability :math:`|\alpha|^2+ |\beta|^2 = 1` and since global phase is undetectable :math:`\left|\psi\right\rangle := e^{i\delta} \left|\psi\right\rangle` we only require two real numbers to describe a single qubit quantum state.
bn_bn: টীকা, যেহেতু সম্ভাবনার সংরক্ষনশীলতা অনুযায়ী :math:`|\alpha|^2+|\beta|^2 = 1` এবং গ্লোবাল ফেজ অনির্ণেয়, সেহেতু একটি একক কিউবিট কণার দশা :math:`\left|\psi\right\rangle := e^{i\delta} \left|\psi\right\rangle` প্রকাশে আমাদের শুধুমাত্র দুইটি বাস্তব সংখ্যা প্রয়োজন।
es_un: Note que debido a la conservación de la probabilidad :math:`|\alpha|^2+ |\beta|^2 = 1` y dado que la fase global es indetectable :math:`\left|\psi\right\rangle := e^{i\delta} \left|\psi\right\rangle` sólo requerimos dos números reales para describir el estado cuántico de un solo qubit.
fr_fr: Notez que , en raison de la conservation de la probabilité :math:`|\alpha|^2+ |\beta|^2 = 1` et puisque la phase globale n'est pas détectable :math:`\left|\psi\right\rangle := e^{i\delta} \left|\psi\right\rangle` nous n'avons besoin que de deux nombres réels pour décrire un seul état quantique.
id_id: Catatan, karena adanya konservasi probabilitas :math:` | \alpha | ^ 2 + | \beta | ^ 2 = 1 ` dan karena fase global tidak terdeteksi :math:` \left | \psi\right\rangle: = e ^ {i\delta} \left | \psi\right\rangle ` kita hanya memerlukan dua bilangan real untuk menggambarkan state kuantum qubit tunggal.
it_it: E' da notare che, dal momento che la conservazione della probabilità impone che :math:`|\alpha|^2+ |\beta|^2 = 1`, e poichè la fase globale non è misurabile :math:`\left|\psi\right\rangle := e^{i\delta} \left|\psi\right\rangle`, bastano solo due numeri reali per descrivere lo stato di un singolo qubit.
ja: 注記、確率の保存の :math:`|\alpha|^2+ |\beta|^2 = 1` と、 :math:`\left|\psi\right\rangle := e^{i\delta} \left|\psi\right\rangle` により絶対的な位相は検出できないことから、単一量子ビットの量子状態を記述するためには２つの実数のみを必要とします。
ko_kr: 확률의 보존으로 인해 :math:`|\alpha|^2+ |\beta|^2 = 1` 이며 전역 위상이 감지되지 않기 때문에 :math:`\left|\psi\right\rangle := e^{i\delta} \left|\psi\right\rangle` 단일 큐비트 양자 상태를 설명하기 위해 두 개의 실수만 필요하다.
pt_br: Note que, devido à conservação da probabilidade :math:`|\alpha|^2+ |\beta|^2 = 1` e, como a fase global é indetectável :math:`\left|\psi\right\rangle := e^{i\delta}, \left|\psi\right\rangle` necessitamos de apenas dois números reais, para descrever o estado quântico de um único qubit.
ru: Учитывая нормировку вероятности :math:`|\alpha|^2+ |\beta|^2 = 1` и тот факт, что глобальная фаза :math:`\left|\psi\right\rangle := e^{i\delta} \left|\psi\right\rangle`не является наблюдаемой величиной, для описания квантового состояния отдельного кубита достаточно двух действительных чисел.
sw_ke: Kumbuka, kwa sababu ya uhifadhi wa uwezekano :math:`|\alpha|^2+ |\beta|^2 = 1` na kwa kuwa awamu ya jumla haiwezi kutambulika :math:`\left|\psi\right\rangle := e ^{i\delta} \left|\psi\right\rangle` tunahitaji nambari mbili halisi pekee ili kuelezea hali ya kwanta ya qubit moja.
ta: Note, due to the conservation of probability :math:`|\alpha|^2+ |\beta|^2 = 1` and since global phase is undetectable :math:`\left|\psi\right\rangle := e^{i\delta} \left|\psi\right\rangle` நாம் மட்டும் இரண்டு உண்மையான எண்களை மட்டும் தேவை.
tr: Olasılığı korumak :math:`|\alpha|^2+ |\beta|^2 = 1` ve global faz algılanamaz olduğu için :math:`\left|\psi\right\rangle := e^{i\delta} \left|\psi\right\rangle` tek bir kübit kuantum durumunu tanımlamak için yalnızca iki reel sayıya ihtiyacımız var.

source: A convenient representation is
bn_bn: একটি সার্বজনীন সাংকেতিক প্রকাশ হচ্ছে
es_un: Una representación conveniente es
fr_fr: Une représentation pratique est
id_id: Sebuah representasi yang praktis adalah
it_it: Una rappresentazione utile è data da
ja: 便利な表現として、
ko_kr: :math:`0\leq\phi<2\pi` 과 :math:`0\leq\theta\leq\pi` 때 다음과 같이 나타낼수 있다.
pt_br: Uma representação conveniente é
ru: Удобно представить его в следующем виде
sw_ke: Uwakilishi unaofaa ni
ta: ஒரு சுலபமான பிரதிநிதிபதி உள்ளது
tr: Uygun bir temsil

source: where :math:`0\leq \phi < 2\pi`, and :math:`0\leq \theta \leq \pi`. From this, it is clear that there is a one-to-one correspondence between qubit states (:math:`\mathbb{C}^2`) and the points on the surface of a unit sphere (:math:`\mathbb{R}^3`). This is called the Bloch sphere representation of a qubit state.
bn_bn: যেখানে :math:`0\leq \phi < 2\pi` এবং :math:`0\leq \theta \leq \pi`। এ থেকে, এটি স্পষ্ট যে কিউবিট মানগুলির (:math:`\mathbb{C}^2`) এবং একক গোলকের পৃষ্ঠের পয়েন্টগুলির (:math:`\mathbb{R}^3`) মধ্যে একক সম্পর্ক রয়েছে। একে বলা হয় ব্লক গোলক যা একটি কিউবিট অবস্থার (স্টেট) প্রতিনিধি।
es_un: donde :math:`0\leq \phi < 2\pi`, y :math:`0\leq \theta \leq \pi`. A partir de esto, es claro que existe una correspondencia de uno a uno entre los estados de los qubits (:math:`\mathbb{C}^2`) y los puntos sobre la superficie de una esfera unitaria (:math:`\mathbb{R}^3`). Esta se denomina la representación de la esfera de Bloch del estado de un qubit.
fr_fr: où :math:`0\leq \phi < 2\pi`, et :math:`0\leq \theta \leq \pi`. À partir de là, il est clair qu'il y a une correspondance un à un entre les états du qubit (:math:`\mathbb{C}^2`) et les points à la surface d'une sphère unitaire (:math:`\mathbb{R}^3`). Ceci est appelé la représentation de la sphère Bloch de l'état du qubit.
id_id: di mana :math:` 0\leq \phi < 2 \pi `, dan :math:` 0\leq \theta \leq \pi `. Dari ini, adalah jelas bahwa ada korespondensi satu-persatu antara state qubit (:math:` \mathbb{C}^ 2 `) dan titik-titik pada permukaan sebuah unit bola (:math:` \mathbb{R}^ 3 `). Hal ini disebut representasi bola Bloch dari state qubit.
it_it: dove :math:`0\leq \phi < 2\pi`, e :math:`0\leq \theta \leq \pi`. Da questa formula si evince chiaramente l'esistenza di una corrispondenza uno a uno tra i possibili stati di un qubit (:math:`\mathbb{C}^2`) ed i punti sulla superficie di una sfera unitaria (:math:`\mathbb{R}^3`). Questa viene chiamata la rappresentazione sulla sfera di Bloch dello stato di un qubit.
ja: ただし、:math:`0\leq \phi < 2\pi` 、および :math:`0\leq \theta \leq \pi` とします。これより、量子ビット状態（ :math:`\mathbb{C}^2` ）と、単位球面上の点（ :math:`\mathbb{R}^3` ）との間に 1 対 1 の対応があることが明らかとなっています。 これは量子ビット状態のブロッホ球表現と呼ばれます。
ko_kr: 여기서 :math:`0\leq\phi<2\pi` 및 :math:`0\leq\theta\leq\pi` 이다. 물론 큐비트 상태 (:math:`\mathbb{C}^2`)와 단위 구 표면의 점 (:math:`\mathbb{R}^3`)은 일대일로 대응된다. 이를 큐비트 상태의 블로흐 구체 표현이라고 한다.
pt_br: onde :math:`0\leq \phi < 2\pi`, and :math:`0\leq \theta \leq \pi`. A partir disto, fica claro que existe uma correspondência um-pra-um (bijeção) entre os estados do qubit (:math:`\mathbb{C}^2`) e os pontos na superfície de uma esfera unitária (:math:`\mathbb{R}^3`). Isto é chamado de representação da esfera de Bloch do estado de um qubit.
ru: где :math:`0\leq \phi < 2\pi` и :math:`0\leq \theta \leq \pi`. Тогда очевидно, что можно задать однозначное соответствие между квантовым состоянием (:math:`\mathbb{C}^2`) и точкой на поверхности единичной сферы (:math:`\mathbb{R}^3`). Это называется представлением квантового состояния с помощью сферы Блоха.
sw_ke: pale :math:`0\leq \phi < 2\pi`, na :math:`0\leq \theta \leq \pi`. Kutokana na hili, ni wazi kwamba kuna uhusiano wa moja kwa moja kati ya hali za qubit (:math:`\mathbb{C}^2`) na pointi kwenye uso wa tufe la umoja (:math:`\mathbb {R}^3`). Hii inaitwa uwakilishi wa tufe la Bloch la hali ya qubit.
ta: எங்கே :math:`0\leq \phi < 2\pi`, மற்றும் :math:`0\leq \theta \leq \pi`. இதிலிருந்து, க்யூபிட் மாநிலங்களுக்கும் (:math:`\mathbb{C}^2`) மற்றும் ஒரு அலகு கோளத்தின் மேற்பரப்பில் உள்ள புள்ளிகளுக்கும் (:math:`\mathbb{R}^3`). இது ஒரு க்யூபிட் மாநிலத்தின் ப்ளொச் கோள பிரதிநிதித்துவம் என்று அழைக்கப்படுகிறது.
tr: burada :math:`0\leq \phi < 2\pi` ve :math:`0\leq \theta \leq \pi`. Bunda, kübit durumları (:math:`\mathbb{C}^2`) ile birim kürenin (:math:`\mathbb{R}^3`). yüzeyindeki noktalar arasında bire bir uyum olduğu açıktır. Bu, kübit durumunun Bloch küre gösterimidir.

source: Quantum gates/operations are usually represented as matrices. A gate which acts on a qubit is represented by a :math:`2\times 2` unitary matrix :math:`U`. The action of the quantum gate is found by multiplying the matrix representing the gate with the vector which represents the quantum state.
bn_bn: কোয়ান্টাম গেটগুলি / অপারেশনগুলি সাধারণত ম্যাট্রিক্স হিসাবে উপস্থাপিত হয়। একটি গেট যা একটি কিউবিটে কাজ করে :math:`2\times 2` ইউনিটারি ম্যাট্রিক্স :math:`U` দ্বারা প্রতিনিধিত্ব করে। কোয়ান্টাম গেটের কার্যকারিতা কোয়ান্টাম মানের প্রতিনিধিত্বকারী ভেক্টরগুলির সাথে গেটের ম্যাট্রিক্সকে গুণ করে পাওয়া যায়।
es_un: Las compuertas u operaciones cuánticas son usualmente representadas como matrices. Una compuerta que actúa sobre un qubit se representa como una matriz unitaria :math:`U` de :math:`2\times 2`. La acción de la compuerta cuántica se encuentra multiplicando la matriz que representa la compuesta con el vector que representa el estado cuántico.
fr_fr: Les portes/opérations quantiques sont généralement représentées par des matrices. Une porte qui agit sur un qubit est représentée par une matrice unitaire :math:`2\times 2` :math:`U`. L'action de la porte quantique se calcule en multipliant la matrice représentant la porte avec le vecteur qui représente l'état quantique.
id_id: Gate kuantum/operasi biasanya diwakili sebagai matriks. Sebuah gate yang beroperasi di atas sebuah qubit diwakili oleh :math:` 2\times 2 ` matrik unitary :math:` U `. Aksi dari gate kuantum ditemukan dengan mengalikan matriks yang mewakili gate dengan vektor yang mewakili state kuantum.
it_it: I gate/operatori quantistici sono generalmente rappresentati come matrici. Un gate che agisce su un qubit è rappresentato da una matrice unitaria :math:`2\times 2`, :math:`U`. L'azione del gate quantistico sul qubit si ottiene moltiplicando la matrice che rappresenta l'operatore per il vettore che rappresenta lo stato quantistico.
ja: 通常、量子ゲート/操作は行列として表されます。1量子ビットに作用するゲートは、 :math:`2\times 2` ユニタリ行列 :math:`U` によって表されます。 量子ゲートの作用は、ゲートを表す行列を量子状態を表すベクトルにかけることによって分かります。
ko_kr: 양자 게이트/연산은 일반적으로 행렬로 표현한다. 특히 큐비트에 작용하는 게이트는 :math:`2\times2` 유니테리 행렬 :math:`U` 로 표현 된다. 그리고 양자 게이트의 작용은 양자 상태를 나타내는 벡터에 게이트를 나타내는 행렬을 곱함으로써 알 수 있다.
pt_br: Portas/Operações quânticas são geralmente representadas como matrizes. Uma porta que atua em um qubit é representada por uma matriz unitária :math:`2\times 2` :math:`U`. A ação da porta quântica é obtida multiplicando a matriz, que representa a porta, pelo vetor, que representa o estado quântico.
ru: Квантовые вентили/операции обычно представляют в виде матриц. Однокубитный вентиль является унитарной матрицей :math:`U` размера :math:`2\times 2`.
sw_ke: Malango au operesheni za kwanta kwa kawaida huwakilishwa kama matrices.Lango linalofanya kazi kwa qubit linawakilishwa na matrix ya umoja :math:`U` yenye utaratibu wa :math:`2\times 2`. Utendaji wa lango la kwanta unapatikana kwa kuzidisha matrix inayowakilisha lango na vekta ambayo inawakilisha hali ya kwanta.
ta: குவாண்டம் கோடுகள்/செயல்பாடுகள் பொதுவாக மாடிகளாக பிரதிபடுத்தப்படுகின்றன. ஒரு விகிதத்தில் செயல்படும் ஒரு வாயில் ஒரு :math:`2\times 2` ஒற்றையாட்சி அணி :math:`U`. குவாண்ட் கோட்டின் நடவடிக்கை, குவாண்டம் கூறை குறிக்கும் வெக்டர் கொண்டு வாயில் பிரதிநிதித்துவம் செய்கிறது.
tr: Kuantum kapıları/işlemleri genellikle matrisler olarak temsil edilir. Bir kübit üzerinde etkili olan :math:`2\times 2` üniter matris :math:`U` isminde bir kapı şekilde temsil edilir. Kuantum kapısının etkisi, kapıyı temsil eden matrisin kuantum durumunu temsil eden vektörle çarpılmasıyla bulunur.

source: A general unitary must be able to take the :math:`\left|0\right\rangle` to the above state. That is
bn_bn: একটি সাধারণ একক ক্রিয়াকলাপ অবশ্যই :math:`\left|0\right\rangle` থেকে উল্লিখিত অবস্থা (স্টেট) পেতে সক্ষম হবে। যার অর্থ হচ্ছে
es_un: Una unitaria general debe poder llevar el :math:`\left|0\right\rangle` al estado anterior. Esto es
fr_fr: Un état unitaire général doit être en mesure de prendre l'angle :math:`\left|0\rdroit\rà l'état ci-dessus. C'est à dire
id_id: Sebuah unitary umum harus dapat mengubah :math:` \left | 0\right\rangle ` ke state di atas. Itu adalah
it_it: Una matrice unitaria generica deve essere in grado di portare lo stato :math:`\left|0\right\rangle` allo stato sopra riportato. Questo si traduce in
ja: 一般的なユニタリは、:math:`\left|0\right\rangle` を上記の状態にできなければなりません。 これは、
ko_kr: 일반적으로 유니테리 상태에서는 :math:`\left|0\right\rangle` 을 위의 상태로 만들 수 있어야 한다. 따라서 :math:`U` 는 다음과 같다.
pt_br: Uma unitária geral deve ser capaz de levar :math:`\left|0\right\rangle` para o estado acima. Isto é
ru: В общем виде такая матрица должна переводить :math:`\left|0\right\rangle` в указанное выше произвольное состояние. Поэтому
sw_ke: Matrix ya umoja ya kawaida lazima iweze kuchukua :math:`\left|0\right\rangle` hadi kwenye hali iliyo hapo juu. Yaani
ta: ஒரு பொதுவான அதனை :math:`\left|0\right\rangle` அதாவது
tr: Genel bir üniter :math:`\left|0\right\rangle` ı yukarıdaki duruma götürebilmelidir. Yani
