Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/3_summary_of_quantum_operations.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja, ko_kr, pt_br, ru, sw_ke, ta, tr

source: Note that here we have used an equivalent as it is different to u1 by a global phase :math:`e^{-i \phi/2}`.
bn_bn: বিশেষ দ্রষ্টব্য এই যে,আমাদের দশার সংজ্ঞায়ন একটা তুল্য ব্যবহার করেছি কারণ u1 এর সাথে সমমানের কিন্তু :math:`e^{-i \phi/2}` সার্বজনীন (গ্লোবাল) দশা পার্থক্য দ্বারা ভিন্ন।
fr_fr: Notez qu'ici nous avons utilisé un équivalent car il est différent de u1 par une phase globale :math:` e ^ {-i \phi/2 } `.
id_id: Perhatikan bahwa di sini kita telah menggunakan yang ekuivalen karena berbeda dengan u1 di fase global :math:` e ^ {-i \phi/2} `.
it_it: È da notare che qui abbiamo usato un equivalente in quanto differisce da u1 per una fase globale :math:`e^{-i \phi/2}`.
pt_br: Perceba que aqui utilizamos um equivalente, já que difere de u1, por uma fase global :math:`e^{-i \phi/2}`.
sw_ke: Kumbuka kuwa hapa tumetumia iliyo sawa kwani ni tofauti na u1 kwa awamu ya jumla :math:`e^{-i \phi/2}`.

source: Note this is different due only to a global phase.
bn_bn: এই দশা শুধুমাত্র সার্বজনীন (গ্লোবাল) দশার সংজ্ঞায়নের কারণে ভিন্নতর।
es_un: Nota que esto es diferente debido sólo a una fase global.
fr_fr: Notez que ceci est différent en raison de la phase globale.
id_id: Perhatikan ini berbeda hanya di fase global.
it_it: Da notare che l'unica differenza è una fase globale.
ja: これは、グローバル・フェーズのみ異なることに注意してください。
ko_kr: 이는 전역 위상 (Global Phase) 값만 다를 뿐이라는 사실을 주목하자.
pt_br: Note que isto é diferente, apenas devido a uma fase global.
ru: Различие здесь только в глобальной фазе.
sw_ke: Kumbuka hii ni tofauti kwa sababu tu ya awamu ya jumla.
ta: இது ஒரு உலகளாவிய காலத்துக்கு மட்டுமே வேறுபடுகிறது.
tr: Bunun yalnızca global bir faz nedeniyle farklı olduğunu unutmayın.

source: Multi-Qubit Gates
bn_bn: বহু কিউবিট যুক্তিবর্তনী
es_un: Compuertas de múltiples qubits
fr_fr: Portes multi-Qubit
id_id: Gate Multi-Qubit
it_it: Gate multi-qubit
ja: 複数量子ビットゲート
ko_kr: 다중 큐비트 게이트
pt_br: Portas de Múltiplos Qubits
ru: Многокубитные вентили
sw_ke: Malango ya Qubit Nyingi
ta: பல க்யூபிட் கேட்ஸ்
tr: Çoklu Kübit Kapıları

source: Mathematical Preliminaries
bn_bn: গাণিতিক প্রারম্ভিক আবশ্যতা
es_un: Preliminares Matemáticos
fr_fr: Préliminaires mathématiques
id_id: Pendahuluan Matematika
it_it: Introduzione matematica
ja: 数学的準備
ko_kr: 수학적 예비
pt_br: Preliminares Matemáticos
ru: Математическое введение
sw_ke: Utangulizi wa Hisabati
ta: கணித உரிமைகள்
tr: Matematiksel Hazırlıklar

source: The space of a quantum computer grows exponentially with the number of qubits. For :math:`n` qubits the complex vector space has dimension :math:`d=2^n`. To describe states of a multi-qubit system, the tensor product is used to "glue together" operators and basis vectors.
es_un: El espacio de una computadora cuántica crece exponencialmente con el número de qubits. Para :math:`n` qubits el espacio vectorial complejo tiene dimensión :math:`d=2^n`. Para describir los estados de un sistema de varios qubits, se utiliza el producto tensorial para "unir" a los operadores y a los vectores base.
fr_fr: L'espace d'un ordinateur quantique croît exponentiellement avec le nombre de qubits. Pour :math:`n` qubits l'espace vectoriel complexe a la dimension :math:`d=2^n`. Pour décrire les états d'un système multi-qubits, le produit de tenseur est utilisé pour 'coller ensemble' les opérateurs et les vecteurs de base.
ja: 量子コンピューターの次元は、量子ビットの数に対して指数関数的に大きくなります。:math:`n` 量子ビットの場合、複素数ベクトル空間は :math:`d=2^n` 次元になります。複数量子ビット系の状態を表すためには、テンソル積が演算子と基底ベクトルの”結合”として使われます。
ru: Пространство квантового компьютера при увеличении числа кубит растет экспоненциально. Комплексное векторное пространство :math:`n` кубит имеет размерность :math:`d=2^n`. При описании состояний многокубитной системы "склеить" операторы и базисные вектора можно с помощью тензорного произведения.

source: Let's start by considering a 2-qubit system. Given two operators :math:`A` and :math:`B` that each act on one qubit, the joint operator :math:`A \otimes B` acting on two qubits is
es_un: Empecemos por considerar un sistema de 2 qubits. Dados dos operadores :math:`A` y :math:`B` donde cada uno actúa en un qubit, el operador conjunto :math:`A \otimes B` que actúa en dos qubits es
fr_fr: Commençons par considérer un système a 2-qubit. Étant donné les deux opérateurs :math:` A ` et :math:` B ` et que chacun agit sur un seul qubit, l'opérateur commun :math:` A \otimes B' agissant sur les deux qubits est
ja: 2量子ビットシステムを考える所から始めてみましょう。それぞれ片方の量子ビットに作用する :math:`A` と :math:`B` という2つの演算子を用意し、2つの量子ビットに作用する結合演算子 :math:`A \otimes B` は、
ru: Начнем с двухкубитной системы системы. Если каждый из операторов :math:`A` и :math:`B` действует на отдельный кубит, то результирующий оператор :math:`A \otimes B` действует на два кубита сразу

source: where :math:`A_{jk}` and :math:`B_{lm}` are the matrix elements of :math:`A` and :math:`B`, respectively.
bn_bn: যেখানে :math:`A_{jk}` এবং :math:`B_{lm}` হচ্ছে যথাক্রমে :math:`A` এবং :math:`B` এর ম্যাট্রিক্স উপাদান।
es_un: donde :math:`A_{jk}` y :math:`B_{lm}` son los elementos de la matriz de :math:`A` y :math:`B`, respectivamente.
fr_fr: où :math:` A_{jk}` et :math:` B_{lm}` sont les éléments matriciels de :math:` A ` et :math:` B `, respectivement.
id_id: dimana :math:` A_{jk}` dan :math:` B_{lm}` adalah elemen matriks dari :math:` A ` dan :math:` B `, masing-masing.
it_it: dove :math:`A_{jk}` e :math:`B_{lm}` sono gli elementi della matrice di :math:`A` e :math:`B`, rispettivamente.
ja: ここでは、 :math:`A_{jk}` と :math:`B_{lm}` は :math:`A` と :math:`B` それぞれの行列成分になります。
ko_kr: 여기서 :math:`A_{jk}` 와 :math:`B_{lm}` 는 각각 :math:`A` 와 :math:`B` 의 행렬 성분이다.
pt_br: onde :math:`A_{jk}` e :math:`B_{lm}` são os elementos de :math:`A` e :math:`B`, respectivamente.
ru: где :math:`A_{jk}` и :math:`B_{lm}` — матричные элементы :math:`A` и :math:`B` соответственно.
sw_ke: pale ambapo :math:`A_{jk}` na :math:`B_{lm}` ndio vipengele vya matriki ya :math:`A` na :math:`B`, mtawalia.
ta: எங்கே :math:`A_{jk}` மற்றும் :math:`B_{lm}` ஆகியவை :math:`A` மற்றும் :math:`B`.
tr: burada :math:`A_{jk}` ve :math:`B_{lm}` sırasıyla :math:`A`ve :math:`B`, 'nin matris öğeleridir.

source: Analogously, the basis vectors for the 2-qubit system are formed using the tensor product of basis vectors for a single qubit:
bn_bn: প্রসঙ্গত, ২-কিউবিট সিস্টেমের বেসিস দিকরাশি (ভেক্টর) গঠন করা হয় একক কিউবিটের বেসিস দিকরাশির টেন্সর গুণনের মাধ্যমে:
es_un: Análogamente, los vectores base para el sistema de 2 qubits son formados utilizando el producto tensorial de vectores base para un solo qubit:
fr_fr: De façon analogue, les vecteurs de base pour le système à deux qubits sont formés à l'aide du produit tensoriel des vecteurs de base pour un seul qubit:
id_id: Secara analog, vektor dasar untuk sistem 2-qubit dibentuk dengan menggunakan produk tensor dari vektor dasar untuk satu qubit:
it_it: Analogamente, i vettori di base del sistema a due qubit vengono formati usando il prodotto tensoriale dei vettori di base del singolo qubit:
ja: 類似的に、2量子ビット系の基底ベクトルは、単一量子ビットでの基底ベクトルのテンソル積を使って形成されます。
ko_kr: 유사하게 두 큐비트 시스템의 기저 벡터들은 단일 큐비트의 기저 벡터들을 텐서 곱하여 형성된다.
pt_br: Analogamente, os vetores da base para o sistema de 2 qubits são formados usando o produto tensorial dos vetores da base para um único qubit:
ru: Базисные вектора двухкубитной системы также создаются как тензорное произведение базисных векторов отдельных кубитов:
sw_ke: Kwa ulinganifu, vekta za msingi za mfumo wa qubit 2 huundwa kwa kutumia ufumbuzi wa tensor wa vekta za msingi kwa qubit moja:
ta: அதாவது, 2-குவிட் முறைமைகளுக்கான அடிப்படை வெக்டர்ஸ் அடிப்படை வெக்டுகளைப் பயன்படுத்தி ஒரே குறும்படங்களுக்காக உருவாக்கப்படுகின்றன:
tr: Benzer şekilde, 2-kübit sisteminin temel vektörleri, tek bir kübit için temel vektörlerin tensörel gösterimi kullanılarak oluşturulur:

source: Note we've introduced a shorthand for the tensor product of basis vectors, wherein :math:`\left|0\right\rangle \otimes \left|0\right\rangle` is written as :math:`\left|00\right\rangle`. The state of an :math:`n`-qubit system can be described using the :math:`n`-fold tensor product of single-qubit basis vectors. Notice that the basis vectors for a 2-qubit system are 4-dimensional; in general, the basis vectors of an :math:`n`-qubit sytsem are :math:`2^{n}`-dimensional, as noted earlier.
fr_fr: Notez que nous avons introduit un raccourci pour le produit tensoriel des vecteurs de base, dans lequel :math:` \left | 0\right\rangle \otimes \left | 0\right\rangle ` est écrit comme :math:` \left | 00\right\rangle `. L'état d'un système :math:` n `-qubit peut être décrit à l'aide du produit tenseur :math:` n " de vecteurs à base d'un seul qubit. Notez que les vecteurs de base d'un système à deux qubits ont 4-dimensions; en général, les vecteurs de base d'un sytsème à :math:` n `-qubit sont :math:` 2 ^{n}`-dimensionnels, comme indiqué précédemment.

source: Basis vector ordering in Qiskit
bn_bn: Qiskit-এ একক দিকরাশির ক্রমবিন্যাস
es_un: Orden de los vectores base en Qiskit
fr_fr: Ordre des vecteurs de base dans Qiskit
id_id: Urutan vektor basis di Qiskit
it_it: Ordinamento dei vettori di base in Qiskit
ja: Qiskitにおける基底ベクトル表記の順番
ko_kr: Qiskit에 사용되는 기저 벡터의 순서
pt_br: Ordem do vetor da base no Qiskit
ru: Порядок базисных векторов в Qiskit
sw_ke: Kuagiza vekta ya msingi katika Qiskit
ta: Qiskit இல் Basis வெக்டர்
tr: Qiskit'te temel vektör sıralaması

source: Within the physics community, the qubits of a multi-qubit systems are typically ordered with the first qubit on the left-most side of the tensor product and the last qubit on the right-most side. For instance, if the first qubit is in state :math:`\left|0\right\rangle` and second is in state :math:`\left|1\right\rangle`, their joint state would be :math:`\left|01\right\rangle`. Qiskit uses a slightly different ordering of the qubits, in which the qubits are represented from the most significant bit (MSB) on the left to the least significant bit (LSB) on the right (big-endian). This is similar to bitstring representation on classical computers, and enables easy conversion from bitstrings to integers after measurements are performed. For the example just given, the joint state would be represented as :math:`\left|10\right\rangle`. Importantly, *this change in the representation of multi-qubit states affects the way multi-qubit gates are represented in Qiskit*, as discussed below.
bn_bn: পদার্থবিজ্ঞানে একাধিক কিউবিট ব্যবস্থার টেন্সর গুণনের কিউবিটকে, প্রথমটা সর্ববামে এবং শেষেরটা সর্বডানে রেখে ক্রমবিন্যাস করা হয়ে থাকে। যেমন, প্রথম কিউবিট যদি :math:`\left|0\right\rangle` এই অবস্থায় এবং দ্বিতীয় কিউবিট যদি :math:`\left|1\right\rangle` এই অবস্থায় থাকে তবে তাদের মিলিত অবস্থা হবে :math:`\left|01\right\rangle`। Qiskit-এ কিউবিটের একটু ভিন্ন ক্রম অনুসরণ করা হয়ে থাকে, যেখানে সর্বোচ্চ গুরুত্বের কিউবিটকে (এমএসবি) বামে এবং সর্বনিম্ন গুরুত্বের (এলএসবি) কিউবিটগুলোকে ডানে রাখা হয়। এটি ধ্রুপদি কম্পিউটিং-এর বিটস্ট্রিং-এর মতোই এবং পরিমাপ করার পরে বিটস্ট্রিংগুলো থেকে পূর্ণসংখ্যায় সহজে রূপান্তর করা সম্ভব হয়। প্রদত্ত উদাহরণে, যৌথ অবস্থা এভাবে প্রকাশ করা যায় :math:`\left|10\right\rangle`। গুরুত্বপুর্ণভাবে, একাধিক কিউবিট প্রকাশ করার *এই পরিবর্তনটি Qiskit-এ একাধিক কিউবিটের প্রকাশকে প্রভাবিত করে*, নিচে তা আলোচনা করা হলো।
fr_fr: Au sein de la communauté des physiciens, les qubits d'un système multiqubit sont généralement classés avec le premier qubit sur le côté gauche du produit tensoriel et le dernier qubit sur le côté droit. Par exemple, si le premier qubit est à l'état :math:` \left | 0\right\rangle ` et le second est dans l'état :math:` \left | 1\right\rangle `, leur état joint est :math:` \left | 01\right\rangle `. Qiskit utilise un ordre légèrement différent des qubits, dans lequel les qubits sont représentés du bit le plus significatif (MSB) sur la gauche au bit le moins significatif (LSB) à droite (big-endian). Ceci est similaire à la représentation chaine de bits 'bitstring' sur les ordinateurs classiques, et permet une conversion facile des bitstring en nombres entiers une fois les mesures effectuées. Pour l'exemple qui vient d'être donné, l'état joint est représenté sous la forme :math:` \left | 10\right\rangle `. Fait important, * ce changement dans la représentation des états multiqubits affecte la façon dont les portes multiqubit sont représentées dans Qiskit *, comme indiqué ci-dessous.
id_id: Dalam komunitas fisika, qubit dari sebuah sistem multi-qubit biasanya disusun dengan qubit pertama di sisi paling kiri dari produk tensor dan qubit terakhir di sisi paling kanan. Misalnya, jika qubit pertama dalam state :math:` \left | 0\right\rangle ` dan kedua adalah dalam state :math:` \left | 1\right\rangle `, state bersama mereka akan menjadi :math:` \left | 01\right\rangle `. Qiskit menggunakan urutan qubit yang sedikit berbeda, di mana qubit direpresentasikan dari bit yang paling signifikan (MSB) di kiri ke bit yang paling sedikit signifikan (LSB) di sebelah kanan (big-endian). Hal ini mirip dengan representasi bitstring pada komputer klasik, dan memudahkan konversidari bitstring ke bilangan bulat setelah pengukuran dilakukan. Untuk contoh dari sebelumnya, state bersama akan direpresentasikan sebagai :math:` \left | 10\right\rangle `. Hal penting, *perubahan dalam representasi state multi-qubit mempengaruhi cara gate multi-qubit ditulis dalam Qiskit *, seperti yang dibahas di bawah ini.
it_it: All'interno della comunità della Fisica, i qubit di un sistema a più qubit sono tipicamente ordinati con il primo qubit all'estremo sinistro del prodotto tensoriale, e l'ultimo qubit all'estremo destro. Per esempio, se il primo qubit è nello stato :math:`\left|0\right\rangle` e il secondo è nello stato :math:`\left|1\right\rangle`, il loro stato combinato sarà :math:`\left|01\right\rangle`. Qiskit usa un ordine dei qubit leggermente diverso, nel quale i qubit sono rappresentati a partire dal bit più significativo (MSB) a sinistra fino al bit meno significativo (LSB) a destra (big-endian). Questa convenzione è simile alla rappresentazione di stringhe di bit nei computer classici, e permette la facile conversione da stringhe di bit a interi dopo aver eseguito le misurazioni. Nell'esempio appena sopra, lo stato combinato sarà rappresentato come :math:`\left|10\right\rangle`. È importante notare che *questo cambio nella rappresentazione di stati a più qubit influenza il modo in cui stati a più qubit sono rappresentati in Qiskit*, come discusso di seguito.
pt_br: Dentro da comunidade de física, os qubits de sistemas com múltiplos qubits são, normalmente, ordenados com o primeiro qubit do lado esquerdo do produto tensorial e o último qubit do lado direito. Por exemplo, se o primeiro qubit estiver em um estado :math:`\left|0\right\rangle` e o segundo estiver no estado :math:`\left|1\right\rangle`, o seu estado conjunto seria :math:`\left|01\right\rangle`. O Qiskit usa uma ordem ligeiramente diferente para os qubits, em que eles são representados do bit mais significativo (MSB) à esquerda para o bit menos significativo (LSB) à direita (big-endian). Isto é semelhante à representação de bitstrings em computadores clássicos e permite fácil conversão de bitstrings para inteiros, após à realização de medições. Pelo exemplo que acabamos de dar, o estado conjunto seria representado como :math:`\left|10\right\rangle`. Importante, *esta mudança na representação dos estados de múltiplos qubits afeta a forma como as portas de múltiplos qubits são representadas no Qiskit*, conforme discutido abaixo.
sw_ke: Katika jamii ya wanafizikia, qubits za mifumo yenye qubit nyingi kwa kawaida huorodheshwa hivi kwamba qubit ya kwanza i upande wa kushoto wa ufumbuzi wa tensor na qubit ya mwisho i upande wa kulia zaidi. Kwa mfano, ikiwa qubit ya kwanza iko katika hali :math:`\left|0\right\rangle` na ya pili iko katika hali :math:`\left|1\right\rangle`, hali yao kwa pamoja itakuwa:math:`\left|01\right\rangle`. Qiskit hutumia orodhesho tofauti kidogo la qubits, ambalo qubits zinawakilishwa kutoka biti muhimu zaidi (most significant bit - MSB) upande wa kushoto hadi biti isiyo muhimu zaidi (least significant bit - LSB) upande wa kulia (big-endian). Hii ni sawa na uwakilishi wa bitstring kwenye kompyuta za kawaida, na inawezesha uongofu rahisi kutoka bitstrings hadi namba kamili baada ya vipimo kufanywa. Katika mfano uliopewa hivi punde, hali yao kwa pamoja itawakilishwa kama :math:`\left|10\right\rangle`. Muhimu, *mabadiliko haya katika uwakilishi wa hali zenye qubit mbalimbali huathiri jinsi malango ya qubit nyingi yanawakilishwa katika Qiskit*, kama ilivyojadiliwa hapa chini.

source: The representation used in Qiskit enumerates the basis vectors in increasing order of the integers they represent. For instance, the basis vectors for a 2-qubit system would be ordered as :math:`\left|00\right\rangle`, :math:`\left|01\right\rangle`, :math:`\left|10\right\rangle`, and :math:`\left|11\right\rangle`. Thinking of the basis vectors as bit strings, they encode the integers 0,1,2 and 3, respectively.
bn_bn: Qiskit এ বেসিস দিকরাশি গুলোকে এমনভাবে প্রকাশ করা হয় যাতে তাদের ক্রম পুর্ণসংখ্যার মত ক্রমিক হয়। যেমন, একটি ২-কিউবিট ব্যবস্থার ক্রম হবে যথাক্রমে :math:`\left|00\right\rangle`, :math:`\left|01\right\rangle`, :math:`\left|10\right\rangle`, :math:`\left|11\right\rangle`। এই বেসিস দিকরাশিগুলোকে বিট স্ট্রিঙের সাথে তুলনা করা যায় এবং এদের ০,১,২,৩ এই ক্রম অনুসারে চিহ্নিত করা হয়।
es_un: La representación utilizada en Qiskit enumera los vectores base en orden creciente a los enteros que representan. Por ejemplo, los vectores base para un sistema de dos qubits serán ordenados como :math:`\left|00\right\rangle`, :math:`\left|01\right\rangle`, :math:`\left|10\right\rangle`, y :math:`\left|11\right\rangle`. Imaginando los vectores base como cadenas de bits, estos codifican los enteros 0, 1, 2 y 3, respectivamente.
fr_fr: La représentation utilisée dans Qiskit énumère les vecteurs de base dans l'ordre croissant des entiers qu'ils représentent. Par exemple, les vecteurs de base d'un système 2-qubit sont classés comme ceci :math:` \left | 00\right\rangle `, :math:` \left | 01\right\rangle `, :math:` \left | 10\right\rangle `, and :math:` \left | 11\right\rangle `. En pensant aux vecteurs de base comme des chaînes de bits, ils encodent les entiers 0,1,2 et 3, respectivement.
id_id: Representasi yang digunakan Qiskit meningkatkan vektor basis seperti urutan bilangan bulat yang mereka wakili. Sebagai contoh, vektor basis dari sistem 2 qubit akan diurut sebagai :math:` \left | 00\right\rangle `, :math:` \left | 01\right\rangle `, :math:` \left | 10\right\rangle `, dan :math:` \left | 11\right\rangle `. Analogi dari vektor basis sebagai string bit, mereka mengkodekan bilangan bulat 0,1,2 dan 3, satu persatu.
it_it: La rappresentazione usata in Qiskit elenca i vettori della base in ordine crescente in base agli interi che rappresentano. Per esempio, i vettori di base per un sistema a 2 qubit saranno ordinati come :math:`\left|00\right\rangle`, :math:`\left|01\right\rangle`, :math:`\left|10\right\rangle`, e :math:`\left|11\right\rangle`. Pensando ai vettori di base come a stringhe di bit, essi rappresentano gli interi 0, 1, 2 e 3, rispettivamente.
ja: Qiskitで使用される表現は、基底ベクトルをそれらが表す整数の昇順で列挙します。たとえば、2量子ビット系の基底ベクトルは、:math:`\left|00\right\rangle`、:math:`\left|01\right\rangle`、:math:`\left|10\right\rangle`、および :math:`\left|11\right\rangle` の順序になります。基底ベクトルをビット文字列と見なし、それぞれを整数の 0、1、2、3 にエンコードします。
ko_kr: Qiskit에서 사용하는 표현은 기저 벡터를 표현하는 숫자가 증가하는 순으로 숫자를 메긴다. 예를 들어 두 큐비트 시스템의 기저 벡터들은 :math:`\left|00\right\rangle`, :math:`\left|01\right\rangle`, :math:`\left|10\right\rangle`, and :math:`\left|11\right\rangle` 순으로 배열된다. 이때 기저 벡터에 대응하는 비트열을 살펴보면 각각 0,1,2,3이 인코딩 되어 있다.
pt_br: A representação usada no Qiskit enumera os vetores da base em ordem crescente dos inteiros que eles representam. Por exemplo, os vetores da base para um sistema de 2 qubits seria ordenado como :math:`\left|00\right\rangle`, :math:`\left|01\right\rangle`, :math:`\left|10\right\rangle`, e :math:`\left|11\right\rangle`. Pensando nos vetores da base como strings de bits, eles codificam os inteiros 0,1,2 e 3, respectivamente.
ru: При таком способе представления в Qiskit, базисные вектора расположены в порядке увеличения номера каждого из них в двоичном представлении. К примеру, упорядоченный базис двухкубитной системы имеет вид :math:`\left|00\right\rangle`, :math:`\left|01\right\rangle`, :math:`\left|10\right\rangle`, :math:`\left|11\right\rangle`. Тогда бинарные строки соответствуют числам 0,1,2,3.
sw_ke: Uwakilishi unaotumiwa katika Qiskit huorodhesha vekta za msingi katika mpangilio unaoongezeka wa nambari kamili zinazowakilisha. Kwa mfano, vekta msingi za mfumo wa qubit 2 zitaagizwa kama :math:`\left|00\right\rangle`, :math:`\left|01\right\rangle`, :math:`\left|10\right\rangle`, na :math:`\left|11\right\rangle`. Kufikiria vekta msingi kama bitstrings, husimba namba kamili 0,1,2 na 3, mtawaliwa.
ta: Qiskit இல் பயன்படுத்தப்படும் பிரதிநிதித்துப் புள்ளிவிவரங்களின் அடிப்படை வரிசைகளின் எண்ணிக்கை அதிகரிக்கும்.உதாரணமாக, 2-க்யூபிட் அமைப்புக்கான அடிப்படை திசையன்கள் என வரிசைப்படுத்தப்படும் :math:`\left|00\right\rangle`, :math:`\left|01\right\rangle`, :math:`\left|10\right\rangle`, and :math:`\left|11\right\rangle`. அடிப்படையிலான வெக்டர்ஸ் (பிட் ஸ்ட்ரிங்ஸ்) ஆகியவற்றின் அடிப்படையில், அவர்கள் எண்ணிக்கை 0,1,2 மற்றும் 3 ஆகியவற்றை குறியீடு செய்யும்.
tr: Qiskit'te kullanılan gösterim, temsili vektörleri temsil ettikleri tamsayıların sırasına göre sıralar. Örneğin, bir 2-kübit sisteminin temel vektörleri şu şekilde sıralanır :math:`\left|00\right\rangle`, :math:`\left|01\right\rangle`, :math:`\left|10\right\rangle`, ve :math:`\left|11\right\rangle`. Temel vektörleri bit dizeleri olarak düşünerek, sırasıyla 0,1,2 ve 3 tamsayılarını kodlarlar.

source: Controlled operations on qubits
bn_bn: কিউবিটের উপরে নিয়ন্ত্রিত ক্রিয়াকলাপ (অপারেশন)
es_un: Operaciones controladas en qubits
fr_fr: Opérations contrôlées sur des qubits
id_id: Operasi terkontrol pada qubits
it_it: Operazioni controllate sui qubit
ja: 量子ビットに対する制御操作
ko_kr: 큐비트에 적용되는 조절 연산들
pt_br: Operações controladas em qubits
ru: Управляемые операции на кубитах
sw_ke: Operesheni zinazodhibitiwa kwenye qubits
ta: க்யூட்டில் கட்டுப்படுத்தல் செயல்பாடுகள்
tr: Kübitlerde kontrollü işlemler
