Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/3_summary_of_quantum_operations.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja, ko_kr, pt_br, ru, sw_ke, ta, tr

source: Here the classical bit by the first measurement is random but the conditional operation results in the qubit being deterministically put into :math:`\left|1\right\rangle`.
bn_bn: এখানে ধ্রুপদি বিটের প্রথম পরিমাপ এলোপাতাড়ি হয় কিন্তু কিউবিটের মধ্যে শর্তাধীন ক্রিয়াকলাপের মান স্থীরিকরনভাবেই :math:`\left|1\right\rangle` লেখা যায়।
es_un: Aquí el bit clásico por la primera medición es aleatorio, pero la operación condicional da como resultado que el qubit sea determinísticamente puesto en :math:`\left|1\right\rangle`.
fr_fr: Ici, le bit classique de la première mesure est aléatoire, mais l'opération conditionnelle résulte en un qubit déterministiquement mis en :math:` \left | 1\right\rangle `.
id_id: Di sini bit klasik dengan pengukuran pertama adalah acak tetapi operasi kondisional menghasilkan qubit yang secara pasti menghasilkan :math:` \left | 1\right\rangle`.
it_it: Qui il bit classico che dipende dalla prima misura è casuale, ma l'operazione condizionale mette il qubit deterministicamente in :math:`\left|1\right\rangle`.
ja: ここで、最初の測定による古典ビットはランダムですが、条件付きの演算の結果は、量子ビットは決定論的に :math:`\left|1\right\rangle` になります。
ko_kr: 여기서 첫번째 측정에 따른 고전 비트는 무작위이지만 조건 연산의 결과 상태는 결정적으로 :math:`\left|1\right\rangle` 이다.
pt_br: Aqui o bit clássico pela primeira medição é aleatório, mas a operação condicional resulta no qubit ser,deterministicamente, colocado em :math:`\left|1\right\rangle`.
ru: Здесь значение классического бита является случайным результатом первого измерения, однако условная операция приводит к тому, что кубит всегда окажется в состоянии :math:`\left|1\right\rangle`.
sw_ke: Hapa biti ya klasiki, kwa kipimo cha kwanza ni cha nasibu lakini operesheni yenye masharti husababisha qubit kuwekwa kwa uthabiti katika :math:`\left|1\right\rangle`.
ta: இங்கு முதன்மையான அளவிலான அளவு ஒழுங்குபடுத்தப்பட்டுள்ளது ஆனால் குறும்படத்திலுள்ள செயல் முடிவுகளின் முடிவுகள் :math:`\left|1\right\rangle`.
tr: Burada klasik bit ilk ölçümü rastgele olmakla birlikte, koşullu işlem kübitin deterministik olarak :math:`\left|1\right\rangle` içine konulmasına neden olur.

source: Arbitrary initialization
bn_bn: স্বেচ্ছাচারি সূচনা
es_un: Inicialización arbitraria
fr_fr: Initialisation arbitraire
id_id: Inisialisasi ke segala keadaan
it_it: Inizializzazione arbitraria
ja: 任意の初期化
ko_kr: 임의 초기화
pt_br: Inicialização arbitrária
ru: Инициализация в произвольном состоянии
sw_ke: Uanzishaji wa kiholela
ta: மாநில ஆரம்பம்
tr: Rastgele başlatma

source: What if we want to initialize a qubit register to an arbitrary state? An arbitrary state for :math:`n` qubits may be specified by a vector of :math:`2^n` amplitudes, where the sum of amplitude-norms-squared equals 1. For example, the following three-qubit state can be prepared:
bn_bn: কিভাবে আমরা কোয়ান্টাম রেজিস্টারকে ইচ্ছামুলক অবস্থা থেকে সুচনা করতে পারি? যেকোন :math:`n` কিউবিট অবস্থাকে দিকারাশির :math:`2^n` মান দ্বারা প্রকাশ করা সম্ভব, যেখানে মানগুলোর বর্গের যোগফল হবে ১। উদাহরনস্বরূপ, নিচে একটি তিন-কিউবিটের অবস্থা বিবেচনা করা হল:
es_un: ¿Qué pasa si queremos inicializar un registro del qubit a un estado arbitrario? Un estado arbitrario para :math:`n` qubits puede ser especificado por un vector de :math:`2^n` amplitudes, donde la suma de amplitud-normas al cuadrado es igual a 1. Por ejemplo, el siguiente estrado de 3 qubits puede ser preparado:
fr_fr: Et si nous voulons initialiser un registre de qubit à un état arbitraire? Un état arbitraire pour :math:` n ` qubits peut être spécifié par un vecteur d'amplitude :math:` 2 ^ n ` , où la somme des amplitudes au carré est égale à 1. Par exemple, l'état tri-qubit suivant peut être préparé:
id_id: Bagaimana jika kita ingin menginisialisasi sebuah qubit register ke segala keadaan? Setiap keadaan dari :math:`n ` qubit dapat ditentukan dari sebuah vektor dengan :math:` 2 ^ n ` amplitudo, dimana jumlah kuadrat norma amplitudo sama dengan 1. Sebagai contoh, keadaan tiga qubit berikut dapat disiapkan:
it_it: Cosa fare se si vuole inizializzare il registro di qubit in uno stato arbitrario? Uno stato arbitrario per :math:`n` qubit può essere specificato da un vettore di :math:`2^n` ampiezze, dove la somma dei quadrati delle norme delle ampiezze è uguale ad 1. Per esempio, è possibile preparare il seguente stato a 3 qubit:
ja: 量子ビットのレジスターを任意の状態に初期化したい場合はどうなりますか？ :math:`n` 量子ビットの任意の状態は、:math:`2^n` の振幅のベクトルで指定できます。ここで、振幅 - ノルム - 平方の合計は1です。例えば、次の3量子ビットの状態を用意するには以下のようにします：
ko_kr: 큐비트 레지스터를 임의의 상태로 초기화 하고 싶다면 어떻게 하면 될까? :math:`n` 큐비트의 임의의 상태는 각 진폭을 절대값 해서 제곱한 값을 모두 더했을 때 1이 되는 :math:`2^n` 개의 진폭을 나타내는 숫자로 구성된 벡터로 표현할 수 있다. 예를 들어, 다음의 세 큐비트 상태는 이렇게 준비될 수 있다.
pt_br: E se quisermos inicializar um registrador de qubits em um estado arbitrário? Um estado arbitrário para :math:`n` qubits, pode ser especificado por um vetor de :math:`2^n` amplitudes, em que a soma das normas, ao quadrado das amplitudes, é igual a 1. Por exemplo, o seguinte estado de três qubit pode ser preparado:
ru: Что делать, если мы хотим инициализировать регистр кубитов в произвольном состоянии? Любое состояние для :math:`n` кубитов может быть представлено вектором амплитуд размерности :math:`2^n`, сумма квадартов компонент которого равна единице. Например, можно подготовить следующее трехкубитное состояние:
sw_ke: Je, iweje iwapo tunataka kuanzisha rejista ya qubit katika hali ya kiholela? Hali holela ya qubit :math:`n` inaweza kubainishwa na vector yenye tambo :math:`2^n`, pale ambapo jumla ya amplitude-norms-squared ni 1. Kwa mfano, hali ifuatayo ya qubit tatu inaweza kutayarishwa:
ta: ஒரு தன்னிச்சையான நிலைக்கு ஒரு குவிட் பதிவேட்டை தொடங்க விரும்பினால் என்ன செய்வது? இதற்கான ஒரு தன்னிச்சையான நிலை :math:`n` குவிட்ஸ் ஒரு திசையன் மூலம் குறிப்பிடப்படலாம் :math:`2^n` பெருக்கங்கள், அங்கு வீச்சு-விதிமுறைகள்-சதுரங்களின் தொகை சமம் 1. எடுத்துக்காட்டாக, பின்வரும் மூன்று-குவிட் நிலை ஆயத்தமாக இரு:
tr: Peki eğer bir kubit kaydını isteğe bağlı bir durumda başlatmak istiyorsak ne olacak? :math:`n` kübit için rasgele bir durum aşağıdaki gibi bir :math:`2^n` vektörünün genlikleri ile belirtilebilir, burada genlik-normların karesi toplamı 1'e eşittir. Örneğin, aşağıda üç-kübitlik durum şu şekilde hazırlanabilir:

source: `Fidelity <https://en.wikipedia.org/wiki/Fidelity_of_quantum_states>`__ is useful to check whether two states are the same or not. For quantum (pure) states :math:`\left|\psi_1\right\rangle` and :math:`\left|\psi_2\right\rangle`, the fidelity is
bn_bn: `বিশ্বস্ততা <https://en.wikipedia.org/wiki/Fidelity_of_quantum_states>`__ দুটো অবস্থার মান সমান কিনা চেক করার জন্য গুরুত্বপূর্ণ। বিশুদ্ধ কোয়ান্টাম অবস্থার :math:`\left|\psi_1\right\rangle` এবং :math:`\left|\psi_2\right\rangle`, এদের বিশ্বস্ততা হল
es_un: `Fidelidad <https://en.wikipedia.org/wiki/Fidelity_of_quantum_states>`__ es útil para comprobar si dos estados son iguales o no. Para estados cuánticos (puros) :math:`\left|\psi_1\right\rangle` y :math:`\left|\psi_2\right\rangle`, la fidelidad es
fr_fr: `La fidelité <https://en.wikipedia.org/wiki/Fidelity_of_quantum_states>` __ est utile pour vérifier si deux états sont identiques ou non. Pour les états quantiques (purs) :math:` \left | \psi_1\right\rangle ` et :math:` \left | \psi_2\right\rangle `, la fidélité est
id_id: ` Fidelity <https://en.wikipedia.org/wiki/Fidelity_of_quantum_states>` __ berguna untuk memeriksa apakah dua state sama atau tidak. Untuk state kuantum (murni) :math:` \left | \psi_1\right\rangle` dan :math:` \left | \psi_2\right\rangle `, fidelity nya adalah
it_it: La `fidelity <https://en.wikipedia.org/wiki/Fidelity_of_quantum_states>`__ è utile per verificare se due stati sono uguali o meno. Per due stati quantistici (puri) :math:`\left|\psi_1\right\rangle` e :math:`\left|\psi_2\right\rangle`, la fidelity è
ja: `Fidelity(忠実度) <https://en.wikipedia.org/wiki/Fidelity_of_quantum_states>`_ は、2つの状態が同じかどうかを確認するのに役立ちます。 （純粋な）量子状態 :math:`\left|\psi_1\right\rangle` と :math:`\left|\psi_2\right\rangle`,の場合、Fidelity (忠実度) 度は
ko_kr: `Fidelity <https://en.wikipedia.org/wiki/Fidelity_of_quantum_states>`__ 는 두 상태가 같은지 확인하는데 유용하다. 두 pure 양자 상태 :math:`\left|\psi_1\right\rangle` 와 :math:`\left|\psi_2\right\rangle` 의 fidelity는 다음과 같다.
pt_br: `Fidelidade <https://en.wikipedia.org/wiki/Fidelity_of_quantum_states>`__ é útil para verificar se dois estados são o mesmo ou não. Para estados quânticos (puros) :math:`\left|\psi_1\right\rangle` e :math:`\left|\psi_2\right\rangle`, a fidelidade é
ru: `Схожесть квантовых состояний <https://en.wikipedia.org/wiki/Fidelity_of_quantum_states>`__ можно использовать для проверки того, являются ли эти состояния одинаковыми. Для квантовых (чистых) состояний :math:`\left|\psi_1\right\rangle` и :math:`\left|\psi_2\right\rangle`схожесть определяется как
sw_ke: `Fidelity <https://en.wikipedia.org/wiki/Fidelity_of_quantum_states>`__ ni muhimu kuangalia iwapo hali mbili zinafanana au la. Kwa hali za kwanta (safi) :math:`\left|\psi_1\right\rangle` na :math:`\left|\psi_2\right\rangle`, usahihi ni
ta: `Fidelity <https://en.wikipedia.org/wiki/Fidelity_of_quantum_states>`__ இரண்டு மாநிலங்கள் ஒரே அல்லது இல்லையா என்பதை சரிபார்க்கவும் பயன்படுகிறது.குவாண்டம் (தூய்மையான) நிலைகளுக்கு :math:`\left|\psi_1\right\rangle` and :math:`\left|\psi_2\right\rangle`, நம்பகத்தன்மை
tr: `Fidelity <https://en.wikipedia.org/wiki/Fidelity_of_quantum_states>`__ iki durumun aynı olup olmadığını kontrol etmek için kullanışlıdır. Kuantum (saf) durumlar :math:`\left|\psi_1\right\rangle` ve :math:`\left|\psi_2\right\rangle` için doğruluk

source: The fidelity is equal to :math:`1` if and only if two states are equal.
bn_bn: পরিমাপণ সুক্ষতা :math:`1` হবে কেবল এবং কেবলমাত্র যদি দুইটি দশা সমান থাকে।
es_un: La fidelidad es igual a :math:`1` si y sólo si dos estados son iguales.
fr_fr: La fidélité est égale à :math:` 1 si et seulement si les deux états sont égaux.
id_id: Fidelity itu sama dengan :math:` 1 ` jika dan hanya jika dua state sama.
it_it: La fidelity è uguale a :math:`1` se e solo se i due stati sono uguali.
ja: 2つの状態が同じ場合に限り、忠実度は :math:`1` に等しくなります。
ko_kr: 두 상태가 동일할 때만 fidelity 값은 :math:`1` 이 된다.
pt_br: A fidelidade é igual a :math:`1` se e, somente se, dois estados são iguais.
ru: Она равна :math:`1` только в том случае, если два состояния одинаковы.
sw_ke: Usahihi huwa :math:`1` ikiwa na ikiwa tu hali mbili ndizo ziko sawa.
ta: இரு மாநிலங்களும் சமம் என்றால் மட்டுமே :math:`1` க்கு சமமானது.
tr: Eğer yalnızca iki durum eşitse doğruluk :math:`1` 'a eşittir.

source: Further details:
bn_bn: পরবর্তী ব্যাখাঃ:
es_un: Más detalles:
fr_fr: Plus de détails:
id_id: Rincian lebih lanjut:
it_it: Ulteriori dettagli:
ja: 更に詳細な説明：
ko_kr: 자세한 내용:
pt_br: Mais detalhes:
ru: Дополнительные сведения:
sw_ke: Maelezo zaidi:
ta: மேலும் விவரங்கள்:
tr: Ek ayrıntılar:

source: How does the desired state get generated behind the scenes? There are multiple methods for doing this. Qiskit uses a `method proposed by Shende et al <https://arxiv.org/abs/quant-ph/0406176>`__. Here, the idea is to assume the quantum register to have started from our desired state, and construct a circuit that takes it to the :math:`\left|00..0\right\rangle` state. The initialization circuit is then the reverse of such circuit.
bn_bn: কিভাবে একটি প্রত্যাশিত ফলাফল পাওয়া যাবে? বিভিন্ন উপায় আছে। Qiskit, `Shende et al <https://arxiv.org/abs/quant-ph/0406176>`__ প্রস্তাবিত পদ্ধতি অনুসরণ করে। এইক্ষেত্রে, আমাদের প্রত্যাশিত অবস্থার মান পুর্বেই কোয়ান্টাম রেজিস্টারে অনুমান করে নেয়া হয় এবং বর্তনী তৈরী করা হয় যা একে :math:`\left|00..0\right\rangle` অবস্থায় নিয়ে যায়। ফলে বর্তনীর প্রারম্ভিক অবস্থা উল্টো হয়।
es_un: ¿Cómo se genera el estado deseado detrás de las escenas? Hay varios métodos para hacer esto. Qiskit usa un `método propuesto por Shende et al <https://arxiv.org/abs/quant-ph/0406176>`__. Aquí, la idea es asumir que el registro cuántico ha comenzado desde nuestro estado deseado, y construir un circuito que lo lleve al estado :math:`\left|00..0\right\rangle`. El circuito de inicialización es entonces el reverso de tal circuito.
fr_fr: Comment l'état souhaité est-il généré ? Il existe plusieurs méthodes pour ce faire. Qiskit utilise une méthode proposée par Shende et al <https://arxiv.org/abs/quant-ph/0406176>` __. Ici, l'idée est de supposer que le registre quantique a commencé à partir de notre état souhaité, et de construire un circuit qui l'emmène à l'état :math:` \left | 00 .. 0\right\rangle ` . Le circuit d'initialisation est alors l'inverse de ce circuit.
id_id: Bagaimana pembuatan keadaan yang diinginkan di balik layar? Ada beberapa metode untuk melakukan hal ini. Qiskit menggunakan sebuah `metode yang diusulkan oleh Shende et al <https://arxiv.org/abs/quant-ph/0406176>` __. Di sini, idenya adalah untuk mengasumsikan register kuantum telah dimulai dari keadaan yang diinginkan, dan membangun sebuah sirkuit yang membawanya ke :math:` \left | 00 .. 0\right\rangle ` ` state. Sirkuit inisialisasi ini kemudian menjadi kebalikan dari sirkuit tersebut.
it_it: Come viene generato lo stato desiderato dietro le quinte? Ci sono diversi metodi per farlo. Qiskit usa un `metodo proposto da Shende et al <https://arxiv.org/abs/quant-ph/0406176>`__. Qui l'idea è di assumere che il registro quantistico parta dallo stato desiderato, e di costruire quindi un circuito che lo porti nello stato :math:`\left|00..0\right\rangle`. Il circuito di inizializzazione è quindi l'inverso di questo circuito così costruito.
ja: 裏では、どのようにして目的の状態が生成されるのでしょうか。 複数の方法がありますが、 Qiskitは `Shendeらによって提案された方法 <https://arxiv.org/abs/quant-ph/0406176>`__ を使っています。 これは、量子レジスタが我々の望む状態から始まったと仮定し、それを :math:`\left|00..0\right\rangle` の状態にする回路を構築するアイデイアです。 初期化回路はこの回路の逆になります。
ko_kr: 어떻게 원하는 상태가 준비될 수 있을까? 이를 수행할 수 있는 다양한 방법들이 있지만 Qiskit에서는 `Shende et al이 제안한 방법 <https://arxiv.org/abs/quant-ph/0406176>`__ 를 사용한다. 이 논문의 아이디어는 양자 레지스터가 애초에 원하는 상태로 시작했다고 가정한 다음 :math:`\left|00..0\right\rangle` 상태로 변환하는 회로를 구성하는 것이다. 그리고 이 회로의 역변환을 하여 초기화 회로를 얻는다.
pt_br: Como o estado desejado é gerado nos bastidores? Existem vários métodos para fazer isto. O Qiskit usa um `método proposto por Shende et al <https://arxiv.org/abs/quant-ph/0406176>`__. Aqui, a ideia é assumir que o registrador quântico iniciou, a partir do nosso estado desejado, e construir um circuito que o leva para o estado :math:`\left|00..0\right\rangle`. O circuito de inicialização é, então, o inverso de tal circuito.
ru: Как же получить нужное состояние? Существует несколько методов. Qiskit использует метод `Shende et al <https://arxiv.org/abs/quant-ph/0406176>`__. Идея состоит в создании схему, преобразующей квантовый регистр из этого состояния в :math:`\left|00..0\right\rangle`. Тогда инициализация будет проходить по обратному алгоритму.
sw_ke: Je, hali inayotakiwa huszalishwaje nyuma ya pazia? Kuna njia nyingi za kufanya hivi. Qiskit hutumia `method proposed by Shende et al <https://arxiv.org/abs/quant-ph/0406176>`__. Hapa, wazo ni kudhania rejista ya kwanta imeanza kutoka katika hali yetu tunayoitaka, kisha kuunda saketi inayoipeleka kwenye hali ya :math:`\left|00..0\right\rangle`. Saketi wa uanzishaji basi ni kinyume cha saketi hiyo.
ta: திரைக்கு பின்னால் விரும்பிய நிலை எவ்வாறு உருவாகிறது? இதைச் செய்ய பல முறைகள் உள்ளன. கிஸ்கிட் `ஷெண்டே மற்றும் பலர் முன்மொழியப்பட்ட ஒரு முறையைப் பயன்படுத்துகிறார் <https://arxiv.org/abs/quant-ph/0406176>`__. இங்கே, குவாண்டம் பதிவேட்டை நாம் விரும்பிய நிலையிலிருந்து ஆரம்பித்ததாகக் கருதி, அதை எடுத்துச் செல்லும் ஒரு சுற்று ஒன்றை உருவாக்குதல் :math:`\left|00..0\right\rangle` நிலை. துவக்க சுற்று பின்னர் அத்தகைய சுற்றுக்கு தலைகீழ் ஆகும்.
tr: İstenen durum perde arkasında nasıl oluşturulur? Bunu yapmak için birden fazla yöntem vardır. Qiskit, `method proposed by Shende et al <https://arxiv.org/abs/quant-ph/0406176>`__ kullanır. Burada fikir, kuantum kaydının istediğimiz durumdan başladığını varsaymak ve bunu :math:`\left|00..0\right\rangle` durumuna götüren bir devre oluşturmaktır. Başlatma devresi bu devrenin tersidir.

source: To take an arbitrary quantum state to the zero state in the computational basis, we perform an iterative procedure that disentangles qubits from the register one-by-one. We know that any arbitrary single-qubit state :math:`\left|\rho\right\rangle` can be taken to the :math:`\left|0\right\rangle` state using a :math:`\phi`-degree rotation about the Z axis followed by a :math:`\theta`-degree rotation about the Y axis:
bn_bn: একটি কোয়ান্টাম অবস্থা কে শুন্য অবস্থায় নিয়ে গাণিতিক কার্যক্রম সম্পাদন করতে হবে, আমাদের বেশ কয়েকবার একটি একটি করে পরিসাংখ্যিক যোগাযোগমুক্ত (ডিজএনট্যাঙ্গেলড) কিউবিট কে হিসেব করতে হয়। আমরা জানি যেকোন কিউবিটের অবস্থা :math:`\left|\rho\right\rangle` থেকে :math:`\left|0\right\rangle` প্রকাশ করা যাবে। এর জন্য প্রয়োজন একটি :math:`\phi` ডিগ্রী পরিমাণ Z অক্ষ ঘিরে আবর্তন ও এরপর :math:`\theta`- ডিগ্রী Y- অক্ষ বরাবর আবর্তন:
es_un: Para llevar un estado cuántico arbitrario al estado cero en la base computacional, realizamos un procedimiento iterativo que desentrelaza los qubits del registro uno por uno. Sabemos que cualquier estado arbitrario de un solo qubit :math:`\left|\rho\right\rangle` puede ser llevado al estado :math:`\left|0\right\rangle` utilizando una rotación de :math:`\phi` grados sobre el eje Z seguido de una rotación de :math:`\theta` grados sobre el eje Y:
fr_fr: Pour obtenir un état quantique arbitraire zéro dans la base de calcul, nous effectuons une procédure itérative qui démêle les qubits du registre un par un. Nous savons que tout état arbitraire à un seul qubit :math:` \left |\rho\right\rangle ` peut être modifié vers l'état :math:` \left | 0\right\rangle ` en utilisant une rotation autout de l'axe Z de :math:` \phi `-degrès suivie d'une rotation autour de l'axe Y de :math:`\theta `-degrés
id_id: Untuk mengubah segala state kuantum ke state nol di basis komputasi, kita melakukan prosedur iterasi untuk menguraikan qubit di register satu per satu. Kita tahu bahwa setiap state dari satu qubit :math:`\left|\rho\right\rangle` bisa diubah ke state :math:`\left|0\right\rangle` dengan sebuah rotasi :math:`\phi`-derajat di seputar sumbu Z dilanjutkan dengan sebuah rotasi :math:`\theta`-derajat di seputar sumbu Y:
it_it: Per portare uno stato quantistico arbitrario allo stato zero nella base computazionale, viene fatta una procedura iterativa che distrugge l'entanglement dei qubit nel registro uno ad uno. Sappiamo che uno stato arbitrario a singolo qubit :math:`\left|\rho\right\rangle` può essere portato nello stato :math:`\left|0\right\rangle` usando una rotazione di :math:`\phi`-gradi attorno all'asse Z, seguita da una rotazione di :math:`\theta`-gradi attorno all'asse Y:
ja: 任意の量子状態を計算基底のゼロ状態にするために、1つずつレジスターから量子ビットのもつれをほどく反復的な手順を行ないます。任意の1量子ビット状態 :math:`\left|\rho\right\rangle` は次のようにZ軸まわりの :math:`\phi` 度回転とY軸まわりの :math:`\theta` 度回転を用いることで :math:`\left|0\right\rangle` 状態にすることができます。
ko_kr: 우리는 임의의 양자 상태를 계산가능한 기저(computational basis)의 영 상태(zero state)로 만들고자 큐비트을 얽힘을 푸는 과정을 반복한다. 임의의 단일 큐비트 상태 :math:`\left|\rho\right\rangle` 는 Z축을 중심으로 회전하는 :math:`\phi`-자유도 회전과 Y축을 중심으로 회전하는 :math:`\theta`-자유도 회전을 연이어 수행하여 상태 :math:`\left|0\right\rangle` 로 변환할 수 있다.
pt_br: Para levar um estado quântico arbitrário para o estado zero na base computacional, realizamos um procedimento iterativo que desentrelaça qubits do registrador um a um. Sabemos que qualquer estado arbitrário de um único qubit :math:`\left|\rho\right\rangle` pode ser levado para o estado :math:`\left|0\right\rangle` utilizando uma rotação de :math:`\phi` graus sobre o eixo Z seguido de uma rotação de :math:`\theta` graus sobre o eixo Y:
ru: Чтобы вернуть квантовый регистр из произвольного состояния в исходное, отделяем и преобразуем каждым кубит по очереди.Известно что любое однокубитное состояние :math:`\left|\rho\right\rangle` можно получить из :math:`\left|0\right\rangle`, используя поворот на :math:`\phi` вокруг оси Z и поворот на :math:`\theta`вокруг оси Y:
sw_ke: Ili kupeleka hali yoyote ya kwanta hadi kwa hali ya sifuri katika computational basis, tunafanya utaratibu wa marudiorudio ambao hutenganisha qubits kutoka kwa rejista moja kwa moja. Tunajua kuwa hali yoyote ya qubit moja :math:`\left|\rho\right\rangle` inaweza kuchukuliwa hadi hali ya :math:`\left|0\right\rangle` kwa kutumia mzunguko wa digrii :math:`\phi` kuzunguka jira-Z ikifuatiwa na mzunguko digrii :math:`\theta` kuzunguka jira-Y:
ta: கணக்கீட்டு அடிப்படையில் ஒரு தன்னிச்சையான குவாண்டம் நிலையை பூஜ்ஜிய நிலைக்கு எடுத்துச் செல்ல, பதிவேட்டில் இருந்து குவிட்களை ஒவ்வொன்றாக பிரிக்கும் ஒரு செயல்பாட்டு செயல்முறையை நாங்கள் செய்கிறோம். எந்தவொரு தன்னிச்சையான ஒற்றை-குவிட் நிலை :math:`\left|\rho\right\rangle` ஐ :math:`\left|0\right\rangle` நிலைக்கு ஒரு :math:`\phi`-இசட் அச்சைப் பற்றிய டிகிரி சுழற்சி தொடர்ந்து ஒரு: math:` \ தீட்டா` டிகிரி சுழற்சி Y அச்சு பற்றி:
tr: Hesaplama esasına göre rasgele bir kuantum durumu sıfır durumuna almak için, kübitleri kayıttan tek tek çözen yinelemeli bir prosedür uygularız. Herhangi bir keyfi tek-kübit durumunun :math:`\left|\rho\right\rangle` :math:`\phi`-derece Z ekseni etrafında dönüşü ve ardından :math:`\theta`-derece Y ekseni etrafında dönüşü kullanılarak :math:`\left|0\right\rangle` durumuna alınabileceğini biliyoruz:

source: Since now we are dealing with :math:`n` qubits instead of just 1, we must factorize the state vector to separate the Least Significant Bit (LSB):
bn_bn: যেহেতু আমরা এখন ১টির বদলে :math:`n` সংখ্যক কিউবিট নিয়ে কাজ করছি, আমাদের অবশ্যই সর্বনিম্ন গুরুত্বের বিট (এলএসবি) আলাদা করার জন্য অবস্থা দিকরাশিকে (স্টেট ভেক্টর) গুণণীয়কে বিভক্ত করতে হবে।
es_un: Puesto que ahora estamos tratando con :math:`n` qubits en lugar de sólo 1, debemos factorizar el vector del estado para separar el bit menos significativo (LSB):
fr_fr: Puisque maintenant nous avons affaire avec :math:` n ` qubits au lieu de seulement 1, nous devons factoriser le vecteur d'état pour extraire le bit le moins significatif (LSB least significant bit):
id_id: Sejak sekarang kita membahas dengan :math:` n ` qubit bukan hanya 1, kita harus memfaktorkan state vektor untuk memisahkan Least Significant Bit (LSB):
it_it: Poichè ora si sta lavorando con :math:`n` qubit invece che con uno solo, serve rifattorizzare il vettore di stato per separare il bit meno significativo (LSB):
ja: ここからは、1量子ビットの代わりに :math:`n` 量子ビットを扱うと、状態ベクトルを分解して最下位ビット(LSB)方式で分離する必要があります。
ko_kr: 우리가 지금 다루고 있는 큐비트은 한 개가 아닌 :math:`n` 개이므로 상태 벡터에서 가정 덜 중요한 비트(LSB)를 분리해 내고자 다음과 같이 성분 별로 묶어 분해 한다.
pt_br: Como agora estamos lidando com :math:`n` qubits, ao invés de apenas 1, precisamos fatorar o vetor de estado, para separar o Bit Menos Significativo (LSB):
ru: При работе не с одним, а с :math:`n` кубитами, представим вектор состояния в виде тензорного произведения, выделяя младший кубит (LSB):
sw_ke: Kwa kuwa sasa tunashughulika na qubits :math:`n` badala ya 1 tu, ni lazima tu-factorize state vekta ili kutenganisha Least Significant Bit (LSB):
ta: இப்போது நாம் :math:`n` qubits க்கு பதிலாக 1, நாம் ஒரு மாநில வெக்டரை தனிப்பயனாக்க வேண்டும், Least Significant Bit (LSB):
tr: Şu ana kadar sadece 1 yerine :math:`n` kübit ile uğraştık, En Az Önemli Bit'i (LSB) ayırmak için durum vektörünü çarpanlarına ayırmalıyız:
