Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/3_summary_of_quantum_operations.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja, ko_kr, pt_br, ru, sw_ke, ta, tr

source: Now each of the single-qubit states :math:`\left|\rho_0\right\rangle, ..., \left|\rho_{2^{n-1}-1}\right\rangle` can be taken to :math:`\left|0\right\rangle` by finding appropriate :math:`\phi` and :math:`\theta` angles per the equation above. Doing this simultaneously on all states amounts to the following unitary, which disentangles the LSB:
bn_bn: এখন একক কিউবিটের সকল অবস্থাসমূহ :math:`\left|\rho_0\right\rangle, ..., \left|\rho_{2^{n-1}-1}\right\rangle`, উপরিউক্ত প্রত্যেক সমীকরণের জন্য সঠিক :math:`\phi` এবং :math:`\theta` কোণ বের করার মাধ্যমে :math:`\left|0\right\rangle`- এ রূপান্তর করা সম্ভব। যা একযোগে সকল অবস্থায় প্রয়োগ করলে তা নিম্নলিখিত ঐকিকের (ইউনিটারি) সমান হবে, যা সর্বনিম্ন গুরুত্বের বিটকে (এলএসবি) বিচ্ছিন্ন (ডিসএন্ট্যাঙ্গাল) করে দেয়:
es_un: Ahora, cada uno de los estados de un solo qubit :math:`\left|\rho_0\right\rangle, ..., \left|\rho_{2^{n-1}-1}\right\rangle` se puede llevar a :math:`\left|0\right\rangle` mediante la búsqueda de los ángulos :math:`\phi` y :math:`\theta` apropiados según la ecuación anterior. Hacer esto simultáneamente en todos los estados equivale a la siguiente unitaria, que desentrelaza el LSB:
fr_fr: Maintenant chacun des états à un seul qubit :math:` \left |\rho_0\right\rangle, ..., \left |\rho_ { 2 ^{n-1}-1 }\right\rangle ` peut être transformé vers :math:` \left | 0\right\rangle ` en trouvant les angles :math:` \phi ` et :math: `\theta ` appropriés en suivant l'équation ci-dessus. Faire cela simultanément sur tous les états revient à l'unité suivante, qui démêle la LSB:
id_id: Sekarang setiap keadaan single-qubit :math:`\left|\rho_0\right\rangle, ..., \left|\rho_{2^{n-1}-1}\right\rangle` dapat dibuat menjadi :math:`\left|0\right\rangle` dengan menemukan sudut :math:`\phi` dan :math:`\theta` yang sesuai menurut persamaan di atas. Melakukan semua ini secara simultan kepada seluruh keadaan akan menghasilkan unitary berikut yang akan membebaskan LSB:
it_it: Ora, ciascuno degli stati a singolo qubit :math:`\left|\rho_0\right\rangle, ..., \left|\rho_{2^{n-1}-1}\right\rangle` può essere portato in :math:`\left|0\right\rangle` trovando gli angoli :math:`\phi` e :math:`\theta` appropriati per l'equazione di cui sopra. Fare questo simultaneamente su tutti gli stati corrisponde al seguente unitario, che rompe l'entanglement del LSB:
ja: ここで、それぞれの1量子ビット状態 :math:`\left|\rho_0\right\rangle, ..., \left|\rho_{2^{n-1}-1}\right\rangle` は、 上の式に従って適切な角度 :math:`\phi` と :math:`\theta` を見つけることで :math:`\left|0\right\rangle` に取れます。 すべての状態でこれを同時に行うことは、最下位ビットの量子もつれをほどくユニタリ行列は次のようになります：
ko_kr: 이제 각 단일 큐비트 상태 :math:`\left|\rho_0\right\rangle, ..., \left|\rho_{2^{n-1}-1}\right\rangle` 는 적절한 각도 :math:`\phi` and :math:`\theta` 를 찾아내므로써 :math:`\left|0\right\rangle` 로 변환할 수 있다. LSB의 얽힘을 풀어 나가는 이 과정을 모든 상태 동시에 수행하는 유니터리는 다음과 같다.
pt_br: Agora, cada um dos estados de um único qubit :math:`\left|\rho_0\right\rangle, ..., \left|\rho_{2^{n-1}-1}\right\rangle` pode ser levado a :math:`\left|0\right\rangle` encontrando os ângulos :math:`\phi` e :math:`\theta` apropriados, pela equação acima. Fazer isto, simultaneamente, em todos os estados, equivale a seguinte unitária, que desentrelaça o LSB:
ru: Теперь каждое однокубитное состояние :math:`\left|\rho_0\right\rangle, ..., \left|\rho_{2^{n-1}-1}\right\rangle` можно превратить :math:`\left|0\right\rangle` при определенных углах :math:`\phi` и :math:`\theta` из приведенного выражения. Одновременное выполнение этого для всех состояний равносильно унитарной операции, отделяющей младший кубит:
sw_ke: Sasa kila moja ya hali za qubit moja :math:`\left|\rho_0\right\rangle, ..., \left|\rho_{2^{n-1}-1}\right\rangle` zinaweza kuchukuliwa hadi kwa :math:`\left|0\right\rangle` kwa kutafuta pembe zinazofaa za :math:`\phi` na :math:`\theta` kadiri ya mlinganyo ulio hapo juu. Kufanya hivi kwa wakati mmoja kwenye hali zote hutupa unitary ifuatayo, ambayo hutenganisha LSB:
ta: இப்போது ஒற்றை-குவிட் ஒவ்வொன்றும் கூறுகிறது :math:`\left|\rho_0\right\rangle,..., \left|\rho_{2^{n-1}-1}\right\rangle` to :math:`\left|0\right\rangle` பொருத்தமானதைக் கண்டுபிடிப்பதன் மூலம் :math:`\phi` மற்றும் :math:`\theta` மேலே உள்ள சமன்பாட்டின் கோணங்கள்.. எல்லா மாநிலங்களிலும் ஒரே நேரத்தில் இதைச் செய்வது பின்வரும் ஒற்றுமைக்கு சமம், இது LSB ஐத் துண்டிக்கிறது:
tr: Şimdi tek kübit durumlarının her biri aşağıdaki denklemlere uygun :math:`\phi` ve :math:`\theta` bulunarak :math:`\left|\rho_0\right\rangle, ..., \left|\rho_{2^{n-1}-1}\right\rangle` :math:`\left|0\right\rangle` alınabilir. Bunu tüm durumlarda aynı anda yapmak, LSB'yi çözen aşağıdaki üniter anlamına gelir:

source: Hence,
bn_bn: হেতু,
es_un: Por lo tanto,
fr_fr: C'est pourquoi
id_id: Sehingga,
it_it: Quindi,
ja: よって
ko_kr: 그러므로,
pt_br: Consequentemente,
ru: Следовательно,
sw_ke: Hivyo,
ta: எனவே,
tr: Bu yüzden,

source: U can be implemented as a "quantum multiplexor" gate, since it is a block diagonal matrix. In the quantum multiplexor formalism, a block diagonal matrix of size :math:`2^n \times 2^n`, and consisting of :math:`2^s` blocks, is equivalent to a multiplexor with :math:`s` select qubits and :math:`n-s` data qubits. Depending on the state of the select qubits, the corresponding blocks are applied to the data qubits. A multiplexor of this kind can be implemented after recursive decomposition to primitive gates of cx, rz and ry.
es_un: U se puede implementar como una compuerta de "multiplexor cuántico", ya que es una matriz diagonal de bloque. En el formalismo del multiplexor cuántico, una matriz diagonal de bloque de tamaño :math:`2^n \times 2^n`, y que consiste de :math:`2^s` bloques, es equivalente a un multiplexor con :math:`s` qubits seleccionados y :math:`n-s` qubits de datos. Dependiendo del estado de los qubits seleccionados, los bloques correspondientes se aplican a los qubits de datos. Un multiplexor de este tipo puede ser implementado después de una descomposición recursiva a las compuertas primitivas de cx, rz y ry.
fr_fr: U peut être implémenté comme une porte de "multiplexage quantique", puisqu'il s'agit d'une matrice diagonale de bloc. Dans le formalisme quantique de multiplexage, une matrice diagonale de bloc de dimensions :math:` 2 ^ n \t, et comprenant :math:` 2 ^ blocs, est équivalente à un multiplexeur avec :math:` s ` qubits de sélection et :math:` n-s ` qubits de données. En fonction de l'état des bits de sélection, les blocs correspondants sont appliqués aux bits de données. Un multiplexeur de ce type peut être mis en œuvre après une décomposition récursive vers les portes primitives cx, rz et ry.
ru: U может быть реализовано как "квантовый мультиплексор", поскольку имеет блочно-диагональный вид. В таком формализме блочно-диагональная матрица размера :math:`2^n \times 2^n`, состоящая из :math:`2^s` блоков, эквивалента мультиплексору c :math:`s` управляющими и :math:`n-s` управляемыми кубитами. В зависимости от состояния управляющих кубитов, соответствующие блоки применяются к управляемым. Такой мультиплексор можно реализовать путем рекурсивного разложения на элементарные вентили cx, rz and ry.

source: In this section we will go into the different operations that are available in Qiskit Terra. These are:
bn_bn: এই অংশে Qiskit টেরা তে ব্যবহৃত কয়েকটি কার্যকারকের বর্ণনা দেয়া হবেঃ
es_un: En esta sección presentaremos las diferentes operaciones que están disponibles en Qiskit Terra. Estas son:
id_id: Pada bagian ini kita akan masuk ke dalam operasi yang berbeda yang tersedia dalam Qiskit Terra, antara lain:
it_it: In questa sezione vedremo le diverse operazioni disponibili su Qiskit Terra. Queste sono:
ja: このセクションでは、Qiskit Terraで利用可能なさまざまな操作について説明します。これらは次のとおりです。
ko_kr: 본 섹션에서는 Qiskit Terra에서 이용 가능한 여러 가지 연산들에 대하여 다룬다. 목록은 다음과 같다:
pt_br: Nesta seção entraremos nas diferentes operações que estão disponíveis no Qiskit Terra. Estas são:
ru: В этом разделе мы рассмотрим различные операции, которые доступны в Qiskit Terra. К их числу относятся:
sw_ke: Katika sehemu hii tutaangazia operesheni tofauti ambazo zinapatikana katika Qiskit Terra. Hizi ni:
ta: இந்த பகுதியிலே Qiskit Terra இல் கிடைக்கும் பல்வேறு செயல்பாடுகளுக்குச் செல்லலாம். இவை:
tr: Bu bölümde, Qiskit Terra'da mevcut olan farklı operasyonlara gireceğiz. Bu bilgiler şunlardır:

source: Single-qubit quantum gates
bn_bn: একক কিউবিট যুক্তি বর্তনী
es_un: Compuertas cuánticas de un solo qubit
id_id: Gerbang kuantum tunggal-qubit
it_it: Gate quantistici a singolo qubit
ja: 単一量子ビットゲート
ko_kr: 단일 큐비트 양자 게이트
pt_br: Portas quânticas de um único qubit
ru: Однокубитные квантовые вентили
sw_ke: Malango ya Kwanta ya Qubit Moja
ta: ஒற்றை-கிட் குவாண்டம் வாயுக்கள்
tr: Tek kübitli kuantum kapıları

source: Multi-qubit quantum gates
bn_bn: বহু কিউবিট প্রায়োগিক যুক্তি বর্তনী
es_un: Compuertas cuánticas para varios qubits
id_id: Gerbang kuantum multi-qubit
it_it: Gate quantistici a più qubit
ja: 複数量子ビットゲート
ko_kr: 다중 큐비트 양자 게이트
pt_br: Portas quânticas de múltiplos qubits
ru: Многокубитные квантовые вентили
sw_ke: Malango ya Kwanta ya Qubit ya Nyingi
ta: மல்டி-க்விட் குவாண்டம் வாயில்கள்
tr: Çoklu kübit kuantum kapıları

source: Conditionals
bn_bn: শর্তসাপেক্ষ
es_un: Condicionales
id_id: Kondisional
it_it: Istruzioni condizionali
ja: 条件文
ko_kr: 조건
pt_br: Condicionais
ru: Условные операции
sw_ke: Masharti
ta: நிலை
tr: Koşullular

source: State initialization
bn_bn: অবস্থা (স্টেট) সূচিতকরণ
es_un: Inicialización del estado
id_id: Inisialisasi keadaan
it_it: Inizializzazione arbitraria
ja: 状態の初期化
ko_kr: 상태 초기화
pt_br: Inicialização de estado
ru: Инициализация состояния
sw_ke: Uanzilishaji wa hali ya kwanta
ta: கூறு ஆரம்பம்
tr: Durum başlatma

source: We will also show you how to use the three different simulators:
bn_bn: কিভাবে তিনটি ভিন্ন ভিন্ন সিমুলেটর ব্যবহার করতে হয় তার প্রয়োগ দেখানো হবে:
es_un: También te mostraremos como usar los tres diferentes simuladores:
id_id: Kami juga akan menunjukkan kepada Anda bagaimana cara menggunakan tiga simulator yang berbeda:
it_it: Vi mostreremo anche come utilizzare i tre diversi simulatori:
ja: また、以下の 3 つの異なるシミュレーターの使用方法についても説明します。
ko_kr: 또한 세 가지 종류의 시뮬레이터를 사용하는 방법도 설명한다.
pt_br: Mostraremos também como usar os três simuladores distintos:
ru: Мы также покажем, как использовать три различных симулятора:
sw_ke: Pia tutakuonyesha jinsi ya kutumia zile simulator tatu tofauti:
ta: மூன்று வெவ்வேறு சிமுலேட்டர்களை எவ்வாறு பயன்படுத்துவது என்பதையும் நாங்கள் உங்களுக்குக் காண்பிப்போம்:
tr: Bu üç farklı simülatörü nasıl kullanacağınızı da göstereceğiz:

source: The single-qubit gates available are: - U gate - P gate - Identity gate - Pauli gates - Clifford gates - :math:`C3` gates - Standard rotation gates
es_un: Las compuertas de un solo qubit disponibles son: - Compuerta U - Compuerta P - Compuerta identidad - Compuertas de Pauli - Compuertas de Clifford - Compuertas :math:`C3` - Compuertas de rotación estándar
ja: 使用可能な単一量子ビットゲートは次のとおりです。- Uゲート - Pゲート - 恒等ゲート - パウリゲート - クリフォードゲート - :math:`C3` ゲート - 標準回転ゲート
ko_kr: 사용할 수 있는 단일 큐비트 게이트는 다음과 같다: - U 게이트 - P 게이트 - Identity 게이트 - Pauli 게이트 - Clifford 게이트 - :math:`C3` 게이트 - 표준 회전(Standard rotation) 게이트
ru: К однокубитным относятся: - вентиль U - вентиль P - единичный вентиль - вентили Паули - вентили Клиффорда - вентили :math:`C3` - вентили вращения
ta: கிடைக்கக்கூடிய ஒற்றை குவிட் வாயில்கள்: - U கேட் - பி கேட் - அடையாள வாயில் - பாலி கேட்ஸ் - கிளிஃபோர்ட் கேட்ஸ் - :math:`C3` வாயில்கள் - நிலையான சுழற்சி வாயில்கள்
tr: Mevcut tek-kübit kapıları şunlardır: - U kapısı - P kapısı - Birim kapı - Pauli kapıları - Clifford kapıları - :math:`C3` kapıları - Standart döndürme kapıları

source: U gate
es_un: Compuerta U
ja: Uゲート
ko_kr: U 게이트
ru: Вентиль U
tr: U kapısı

source: In Qiskit we give you access to the general unitary using the :math:`u` gate, which has the following matrix form
es_un: En Qiskit te damos acceso a la unitaria general usando la compuerta :math:`u`, la cual tiene la siguiente forma matricial
ja: Qiskit では、 :math:`u` ゲートを使用して一般のユニタリーにアクセスできます。このゲートには、次の行列形式があります。
ko_kr: Qiskit에서는 다음과 같은 행렬 형식을 가진 :math:`u` 게이트를 사용하여 일반 유니테리를 사용할 수 있다.
ru: В Qiskit унитарная операция в общем виде определяется вентилем :math:`u`, матрица которого имеет вид
ta: #: ../../tutorials/circuits/3_குவாண்டம்_செயல்பாடுகளின்_சுருக்கம்.ipynb:163 கோப்பு: 3_summary_of_quantum_operations.po
tr: Qiskit'te, aşağıdaki matris formuna sahip olan :math:`u` kapısını kullanarak genel üniter'e erişmenizi sağlıyoruz

source: Note on U gate deprecation
es_un: Nota sobre la obsolescencia de la compuerta U
ja: Uゲート非推奨のメモ
ko_kr: U 게이트 사용중단에 대한 노트
ru: Примечание об устаревании
ta: U கேட் நீக்கம் பற்றிய குறிப்பு
tr: U kapısı kullanımdan kaldırma notu

source: The QuantumCircuit methods :math:`u1`, :math:`u2` and :math:`u3` are now deprecated. Instead, the following replacements should be used.
es_un: Los métodos de QuantumCircuit :math:`u1`, :math:`u2` y :math:`u3` ahora están obsoletos. En su lugar, se deben utilizar los siguientes reemplazos.
ja: QuantumCircuitメソッド :math:`u1` 、 :math:`u2` 、および :math:`u3` は非推奨になりました。代わりに、次の代替品を使用する必要があります。
ko_kr: QuantumCircuit의 메서드들 중 :math:"u1", :math:"u2" 및 :math:"u3" 은 이제 더 이상 사용되지 않는다. 대신에 다음 메서드들을 사용한다.
ru: Методы :math:`u1`, :math:`u2` и :math:`u3` класса QuantumCircuit являются устаревшими. Их можно заменить следующим образом
ta: QuantumCircuit முறைகள் :math:`u1`, :math:`u2` மற்றும் :math:`u3` ஆகியவை இப்போது நிறுத்தப்பட்டுள்ளன. அதற்குப் பதிலாக, பின்வரும் மாற்றீடுகள் பயன்படுத்தப்பட வேண்டும்.
tr: QuantumCircuit metodları :math:`u1`, :math:`u2` ve :math:`u3` artık kullanımdan kaldırılmıştır. Bunun yerine, aşağıdaki değiştirme işlemleri kullanılmalıdır.

source: P gate
es_un: Compuerta P
ja: P ゲート
ko_kr: P 게이트
ru: Вентиль P
ta: P கேட்
tr: P kapısı

source: The :math:`p(\lambda)= u(0, 0, \lambda)` gate has the matrix form
bn_bn: :math:`p(\lambda)= u(0, 0, \lambda)` যুক্তিবর্তনীর ম্যাট্রিক্স রূপ হল
es_un: La compuerta :math:`p(\lambda)= u(0, 0, \lambda)` tiene la forma matricial
ja: :math:`p(\lambda)= u(0, 0, \lambda)` ゲートは次の行列形式を持ちます。
ko_kr: 게이트 :math:`p(\lambda)= u(0, 0, \lambda)` 는 다음과 같은 행렬로 표현된다.
ru: Вентиль :math:`p(\lambda)= u(0, 0, \lambda)` представим в виде матрицы
sw_ke: Lango la :math:`p(\lambda)= u(0, 0, \lambda)` lina matrix yenye muundo wa
ta: :math:`p(\lambda)= u(0, 0, \lambda)` கேட் அணி வடிவத்தைக் கொண்டுள்ளது
tr: :math:`p(\lambda)= u(0, 0, \lambda)` kapısı matris formuna sahiptir

source: The identity gate is :math:`Id = p(0)`.
es_un: La compuerta identidad es :math:`Id = p(0)`.
ja: 恒等ゲートは、 :math:`Id = p(0)` です。
ko_kr: 항등 게이트는 :math:`Id = p(0)` 이다.
ru: Единичный вентиль — это :math:`Id = p(0)`.
ta: அடையாள வாயில் :math:`Id = p(0)`.
tr: Birim kapı :math:`Id = p(0)` dir.

source: Note that here we have used an equivalent as it is different to :math:`p` by a global phase :math:`e^{-i \phi/2}`.
es_un: Ten en cuenta que aquí hemos usado un equivalente, ya que es diferente a :math:`p` por una fase global :math:`e^{-i \phi/2}`.
ja: ここでは、グローバル位相 :math:`e^{-i \phi/2}` によって :math:`p` とは異なるため、同等のものを使用していることに注意してください。
ko_kr: :math:`p` 과 전역 위상 :math:`e^{-i \phi/2}` 의 차이로 인해 등가식을 사용했음을 참고한다.
ru: Обратите внимание, что его можно заменить на аналогичный вентиль :math:`p`, отличающийся только ненаблюдаемой глобальной фазой :math:`e^{-i \phi/2}`.
ta: உலகளாவிய கட்டம் :math:`e^{-i \phi/2}` மூலம் :math:`p` க்கு வித்தியாசமாக இருப்பதால், சமமான ஒன்றை இங்குப் பயன்படுத்தியுள்ளோம்.
tr: Burada :math:`p` bir global faza :math:`e^{-i \phi/2}` göre farklı olduğu için bir eşdeğer kullandığımızı unutmayın.

source: The space of a quantum computer grows exponentially with the number of qubits. For :math:`n` qubits the complex vector space has dimension :math:`d=2^n`. To describe states of a multi-qubit system, the tensor product is used to “glue together” operators and basis vectors.
bn_bn: কোয়ান্টাম কম্পিউটারের গণনা ক্ষেত্র (স্পেস) কিউবিট সংখ্যার সাথে সুচকীয় হারে বৃদ্ধি পায়। যেমন :math:`n` কিউবিটের জন্য জটিল সংখ্যার দিকরাশিজনিত ক্ষেত্রের (কমপ্লেক্স ভেক্টর স্পেস) মাত্রা হচ্ছে :math:`d=2^n`। বহু-কিউবিটের গঠন (সিস্টেম) অবস্থা সংজ্ঞায়নের জন্য টেন্সর গুণন ব্যবহার হয় যা কার্যকারক এবং বেসিস দিকরাশিগুলোকে একত্রে আটকে রাখে।
id_id: Ruang dari komputer kuantum bertambah secara eksponensial dengan jumlah qubit. Untuk :math:` n ` qubit ruang vektor kompleks memiliki dimensi :math:` d=2 ^ n `. Untuk menggambarkan state dari sebuah sistem multi-qubit, produk tensor digunakan untuk "merekatkan" operator dan basis vektor.
it_it: Lo spazio a disposizione di un computer quantistico cresce esponenzialmente con il numero di qubit. Per :math:`n` qubit lo spazio vettoriale complesso ha dimensione :math:`d=2^n`. Per descrivere gli stati di sistemi a più qubit, il prodotto tensoriale è lo strumento che unisce insieme operatori e vettori di base.
ko_kr: 양자 컴퓨터를 기술하는 공간의 차원은 큐비트의 개수가 증가함에 따라 지수적으로 증가한다. :math:`n` 큐비트를 기술하는 복소 벡터 공간은 :math:`d=2^n` 차원을 가지기 때문이다. 다중 큐비트 시스템의 상태를 표현할 때는 텐서 곱을 사용하여 연산자들이나 기저 벡터들 사이를 "붙여줄" 수 있다.
pt_br: O espaço de um computador quântico cresce exponencialmente com o número de qubits. Para :math:`n` qubits, o espaço vetorial complexo tem dimensão :math:`d=2^n`. Para descrever estados de um sistema com múltiplos qubits, o produto tensorial é usado para "grudar" operadores e vetores da base.
sw_ke: Nafasi ya tarakilishi ya kwanta hukua kwa kasi ajabu kwa uwiano wa idadi ya qubits. Kwa qubits :math:`n`, nafasi ya vekta changamani ina upandeolwa :math:`d=2^n`. Ili kuelezea hali za mfumo wa qubit nyingi, ufumbuzi wa tensor hutumiwa “kuunganisha pamoja“ opereta na vekta za msingi.
ta: ஒரு குவாண்ட் கணினியின் விண்வெளி விகிதங்களின் எண்ணிக்கை வளரும். இதற்கு:math:`n` க்யூபிட் ஸ் சிக்கலான திசையன் இடத்திற்கு பரிமாணம் உள்ளது :math:`d=2 ^n`பல-க்யூபிட் அமைப்பின் நிலைகளை விவரிக்க, டென்சர் தயாரிப்பு ஆபரேட்டர்கள் மற்றும் அடிப்படை திசையன்களை "glue together" பயன்படுத்தப்படுகிறது.
tr: Bir kuantum bilgisayarın uzayı kübitlerin sayısı ile birlikte üssel olarak büyür. :math:`n` kübit için karmaşık vektör uzayı :math:`d=2^n` boyuta sahiptir. Çok kübitli bir sisteminin durumunu tanımlamak için tensör çarpımı, operatörleri ve taban vektörlerini “birbirine yapıştırmak” için kullanılır.

source: Let’s start by considering a 2-qubit system. Given two operators :math:`A` and :math:`B` that each act on one qubit, the joint operator :math:`A \otimes B` acting on two qubits is
bn_bn: ২-কিউবিটের একটি ব্যবস্থা বিবেচনা করা যাক। যদি :math:`A` এবং :math:`B` কার্যকারক (অপারেটরস) দুইটি ভিন্ন ভিন্ন একক কিউবিটের উপর কাজ করে, তাহলে একইসাথে দুইটি কিউবিটের উপর ক্রিয়াকারী যুগ্ম অপারেটর :math:`A \otimes B` হল
id_id: Mari kita mulai dengan melihat sistem dua qubit. Dari dua operator :math:` A ` dan :math:` B ` yang masing-masing beroperasi di satu qubit, operator bersama :math:` A \otimes B ` beroperasi pada dua qubit adalah
it_it: Iniziamo considerando un sistema a due qubit. Dati due operatori :math:`A` e :math:`B` che agiscono ciascuno su un solo qubit, l'operatore unico :math:`A \otimes B` che agisce sui due qubit è
ko_kr: 우선 두 개의 큐비트들로 구성된 시스템을 생각해 보자. 각 큐비트에 작용하는 두 개의 연산자 :math:`A` 와 :math:`B` 가 주어졌을 때 두 개의 큐비트에 동시에 작용하는 연합 연산자 :math:`A \otimes B` 은 다음과 같다.
pt_br: Vamos começar considerando um sistema de 2 qubits. Dados dois operadores :math:`A` e :math:`B`, tais que cada um age em um qubit, o operador conjunto :math:`A \otimes B` atuando em dois qubits é
sw_ke: Hebu tuanze kwa kuzingatia mfumo wa qubit 2. Kwa kuzingatia opereta mbili :math:`A` na :math:`B` amabazo kila moja hufanya kazi kwa qubit moja, joint opereta :math:`A \otimes B` inayotenda kwa qubits mbili ni
ta: 2-க்யூபிட் அமைப்பைக் கருத்தில் கொண்டு ஆரம்பிக்கலாம்.இரண்டு ஆபரேட்டர்கள் கொடுக்கப்பட்டவை :math:`A` மற்றும :math:`B` ஒவ்வொன்றும் ஒரு க்யூபிட்டில் செயல்படுகின்றன, கூட்டு ஆபரேட்டர் :math:`A \otimes B` இரண்டு க்யூபிட்டுகளில் செயல்படுவது
tr: 2 kübitlik bir sistemi düşünerek başlayalım. Her biri bir kübit üzerinde etkili olan :math:`A` ve :math:`B` operatörleri verildiğinde iki kübit üzerine etkiyen :math:`A \otimes B` ortak operatör
