Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/3_summary_of_quantum_operations.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja, ko_kr, pt_br, ru, sw_ke, ta, tr

source: U can be implemented as a “quantum multiplexor” gate, since it is a block diagonal matrix. In the quantum multiplexor formalism, a block diagonal matrix of size :math:`2^n \times 2^n`, and consisting of :math:`2^s` blocks, is equivalent to a multiplexor with :math:`s` select qubits and :math:`n-s` data qubits. Depending on the state of the select qubits, the corresponding blocks are applied to the data qubits. A multiplexor of this kind can be implemented after recursive decomposition to primitive gates of cx, rz and ry.
bn_bn: U যুক্তিবর্তনীকে (গেইট) "কোয়ান্টাম মাল্টিপ্লেক্সর" যুক্তিবর্তনী (গেইট) হিসাবে বাস্তবায়ন করা যায়, যেহেতু এটি ব্লক কর্ণ ম্যাট্রিক্স। কোয়ান্টাম মাল্টিপ্লেক্সার রীতি অনুযায়ী, :math:`2^n \times 2^n` আকৃতির একটি ব্লক ডায়াগোনাল ম্যাট্রিক্স এবং তার মধ্যে থাকা :math:`2^s` ব্লক, :math:`s` নির্বাচিত কিউবিট এবং :math:`n-s` তথ্য কিউবিটের মাল্টিপ্লেক্সরের সমতুল্য। নির্বাচিত কিউবিটের অবস্থার উপর ভিত্তি করে অনুরূপ ব্লকসমূহ তথ্য কিউবিটে প্রয়োগ করা হয়। এই ধরণের একটি মাল্টিপ্লেক্সর পুনঃপুনঃ পরিবর্তনের পরে প্রাথমিক যুক্তিবর্তনীসমূহ (গেইট) cx, rz এবং ry-তে বাস্তবায়ন করা সম্ভব।
id_id: U dapat diimplementasikan sebagai gerbang "quantum multiplexor" karena berbentuk matriks diagonal blok. Dalam formalisme kuantum multiplexor, blok matriks diagonal ukuran :math:` 2 ^ n \times 2 ^ n `, dan terdiri dari :math:` 2 ^ s ` blocks, setara dengan multiplexor dengan :math:` s ` qubits terpilih dan :math:` n-s ` qubits data. Tergantung pada keadaan dari qubits terpilih, blok-blok yang sesuai diterapkan untuk qubits data. Sebuah multiplekor dari jenis ini dapat diimplementasikan setelah dekomposisi rekursif ke gerbang primitif cx, rz dan ry.
it_it: U può essere implementato come un gate "quantum multiplexor", dal momento che è una matrice diagonale a blocchi. Nel formalismo quantum multiplexor, una matrice diagonale a blocchi di dimensioni :math:`2^n \times 2^n`, e formata da :math:`2^s` blocchi, è equivalente ad un multiplexor con :math:`s` qubit di selezione e :math:`n-s` qubit di dati. A seconda dello stato dei qubit di selezione, i blocchi corrispondenti sono applicati ai qubit dati. Un multiplexor di questo tipo può essere implementato dopo la scomposizione ricorsiva nei gate primitivi cx, rz e ry.
ko_kr: U는 블록 대각 행렬이므로 "양자 멀티플렉서(quantum multiplexor)" 게이트로 구현할 수 있다. 양자 멀티플렉서에서 크기가 :math:`2^n \times 2^n`이며 :math:`2^s`개의 블록 행렬로 구성된 블록 대각 행렬은 선택 큐비트이 :math:`s`개이고 데이터 큐비트가 :math:`n-s`개인 멀티플렉서와 동일하다. 이때 선택 큐비트의 상태에 따라 데이터 큐비트에 적용되는 블록이 선택된다. 이러한 종류의 멀티플렉서는 기본게이트 cx, rz 그리고 ry를 이용하여 재귀적으로 분해한 형태로 구현할 수 있다.
pt_br: U pode ser implementado como uma porta “multiplexadora quântica”, uma vez que se trata de uma matriz diagonal em blocos. No formalismo de multiplexores quânticos, uma matriz diagonal em blocos de tamanho :math:`2^n \times 2^n`, e constituída por blocos de :math:`2^s`, é equivalente a um multiplexador com :math:`s` qubits de seleção e :math:`n-s` qubits de dados. Dependendo do estado dos qubits de seleção, os blocos correspondentes são aplicados nos qubits de dados. Um multiplexador deste tipo pode ser implementado, após à decomposição recursiva para as portas primitivas de cx, rz e ry.
sw_ke: U inaweza kutekelezwa kama lango la “quantum multiplexor”, kwa kuwa ni matrix ya diagonal za mraba. Katika mfumo wa quantum multiplexor, matrix ya diagonal za mraba yenye ukubwa wa :math:`2^n \times 2^n`, na inayojumuisha miraba :math:`2^s`, ni sawa na multiplexor yenye qubits zilizochaguliwa :math:`s` na qubits za data :math:`n-s`. Kutegemea hali ya qubits zilizochaguliwa, miraba husika hutekelezwa kwa qubits za data. Multiplexor ya aina hii inaweza kutekelezwa baada ya mtengano wa marudiorudio kwa milango ya kimsingi ya cx, rz na ry.
ta: U ஒரு "குவாண்டம் மல்டிபிளெக்சர்" வாயிலாக செயல்படுத்தப்படலாம், ஏனெனில் இது ஒரு தொகுதி மூலைவிட்ட அணி. குவாண்டம் மல்டிபிளெக்சர் ஃபார்மலிசத்தில், ஒரு தொகுதி மூலைவிட்ட அணி :math:`2^n \முறை 2^n`, மற்றும் பின்வருவனவற்றை உள்ளடக்கியது :math:`2^s` தொகுதிகள், இதனுடன் ஒரு மல்டிபிளெக்சருக்கு சமம் :math: `கள் `குவிட்ஸைத் தேர்ந்தெடுக்கவும்: கணிதம்:`என்எஸ்` தரவு குவிட்கள். தேர்ந்தெடுக்கப்பட்ட குவிட்டுகளின் நிலையைப் பொறுத்து, தரவுத் தொகுதிகளுக்கு தொடர்புடைய தொகுதிகள் பயன்படுத்தப்படுகின்றன. Cx, rz மற்றும் ry ஆகியவற்றின் பழமையான வாயில்களுக்கு சுழல்நிலை சிதைவுக்குப் பிறகு இந்த வகையான ஒரு மல்டிபிளெக்சரை செயல்படுத்தலாம்.
tr: U bir blok köşegen matris olduğundan, bir “quantum multiplexor” kapısı olarak uygulanabilir. Kuantum çoklayıcı biçimciliğinde, :math:`2^n \times 2^n` boyutunda ve :math:`2^s` bloktan oluşan bir blok köşegen matris, :math:`s` seçim kübiti ve :math:`n-s` veri kübiti ile birlikte bir çoklayıcı ile eşdeğerdir. Seçim kübitlerinin durumuna bağlı olarak karşılık gelen bloklar veri kübitlerine uygulanır. Bu tür bir çoklayıcı, cx, rz ve ry'nin temel kapılarına özyinelemeli ayrıştırmadan sonra uygulanabilir.

source: Note we've introduced a shorthand for the tensor product of basis vectors, wherein :math:`\left|0\right\rangle \otimes \left|0\right\rangle` is written as :math:`\left|00\right\rangle`. The state of an :math:`n`-qubit system can be described using the :math:`n`-fold tensor product of single-qubit basis vectors. Notice that the basis vectors for a 2-qubit system are 4-dimensional; in general, the basis vectors of an :math:`n`-qubit system are :math:`2^{n}`-dimensional, as noted earlier.
es_un: Ten en cuenta que hemos introducido una abreviación para el producto tensorial de los vectores base, donde :math:`\left|0\right\rangle \otimes \left|0\right\rangle` se escribe como :math:`\left|00\right\rangle`. El estado de un sistema de :math:`n` qubits se puede describir usando el producto tensorial :math:`n`-múltiple de vectores base de un solo qubit. Observa que los vectores base para un sistema de 2 qubits son de 4 dimensiones; en general, los vectores base de un sistema de :math:`n` qubits son de dimensión :math:`2^{n}`, como se señaló anteriormente.
ja: ここでは、基底ベクトルの略記を導入します。:math:`\left|0\right\rangle \otimes \left|0\right\rangle` は :math:`\left|00\right\rangle` と表現されます。 :math:`n` 量子ビット系の状態は、単一量子ビットベクトルの :math:`n` 階のテンソル積を使って書き下すことができます。2量子ビット系の基底ベクトルは、4次元になります。前に述べたように、一般に、 :math:`n` 量子ビット系の基底ベクトルは、 :math:`2^{n}` 次元になります。
ru: Обратите внимание на краткую форму записи тенорного произведения базисных векторов, то есть :math:`\left|0\right\rangle \otimes \left|0\right\rangle` эквивалентно :math:`\left|00\right\rangle`. Состояние :math:`n`-кубитной системы может быть описано с помощью :math:`n`-кратного тензорного произведения однокубитных базисных векторов. Отметим также, что размерность каждого двухкубитного базисного вектора равна четырем, а каждого :math:`n`-кубитного — :math:`2^{n}`, как и было сказано ранее.

source: The controlled-not gate flips the ``target`` qubit when the control qubit is in the state :math:`\left|1\right\rangle`. If we take the MSB as the control qubit (e.g. ``cx(q[1],q[0])``), then the matrix would look like
id_id: Gerbang controlled-not akan membalik qubit ` ` target ` ` ketika qubit kontrol berada dalam keadaan :math:` \left | 1\right\rangle `. Jika MSB diambil sebagai qubit kontrol (misalnya ` ` cx (q[1], q[0]) ` `), maka matriksnya akan terlihat seperti
it_it: Il gate controlled-not inverte il qubit ``target`` quando il qubit di controllo è nello stato :math:`\left|1\right\rangle`. Se si considera il MSB come qubit di controllo (ad esempio ``cx(q[1],q[0])``), allora la matrice avrà la forma seguente
pt_br: A porta controlada NOT inverte o qubit ``alvo`` ,quando o qubit de controle estiver no estado :math:`\left|1\right\rangle`. Se tomarmos o MSB como qubit de controle (ex.: ``cx(q[1],q[0])``), então a matriz pareceria com
sw_ke: Lango la NOT-linalodhibitiwa hupindua qubit ``target`` wakati qubit iliyodhibitiwa iko katika hali ya :math:`\left|1\right\rangle`. Tukichukua MSB kama qubit iliyodhibitiwa (k.m. ``cx(q[1],q[0])``), basi matriki iingeonekana kama

source: The Controlled-NOT gate flips the ``target`` qubit when the control qubit is in the state :math:`\left|1\right\rangle`. If we take the MSB as the control qubit (e.g. ``cx(q[1],q[0])``), then the matrix would look like
ru: Управляемый-NOT вентиль переворачивает ``целевой``кубит≤ если управляющий находится в состоянии :math:`\left|1\right\rangle`. Если старший кубит является управляющим (то есть ``cx(q[1],q[0])``), матрица имеет вид
