Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/3_summary_of_quantum_operations.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja, ko_kr, pt_br, ru, sw_ke, ta, tr

source: The `Toffoli gate <https://en.wikipedia.org/wiki/Quantum_logic_gate#Toffoli_(CCNOT)_gate>`__ flips the third qubit if the first two qubits (LSB) are both :math:`\left|1\right\rangle`:
bn_bn: টফোলি যুক্তিবর্তনী <https://en.wikipedia.org/wiki/Quantum_logic_gate#Toffoli_(CCNOT)_gate>__ তৃতীয় কিউবিটকে পালটায় যদি প্রথম দুটো কিউবিট (এল এস বি) দুটই :math:`\left|1\right\rangle`:
es_un: La `compuerta de Toffoli <https://en.wikipedia.org/wiki/Quantum_logic_gate#Toffoli_(CCNOT)_gate>`__ invierte el tercer qubit si los dos primeros qubits (LSB) son ambos :math:`\left|1\right\rangle`:
fr_fr: La " porte de Toffoli <https://en.wikipedia.org/wiki/Quantum_logic_gate#Toffoli_(CCNOT)_gate>` __ inverse le troisième qubit si les deux premiers qubits (LSB) sont tous les deux :math:` \left | 1\right\rangle `:
id_id: `Toffoli gate <https://en.wikipedia.org/wiki/Quantum_logic_gate#Toffoli_(CCNOT)_gate>` __ membalik qubit ketiga jika yang dua qubit pertama (LSB) adalah dua-duanya :math:` \left | 1\right\rangle `:
it_it: Il `gate Toffoli <https://en.wikipedia.org/wiki/Quantum_logic_gate#Toffoli_(CCNOT)_gate>`__ cambia il terzo qubit se i primi due qubit (LSB) sono entrambi :math:`\left|1\right\rangle`:
ja: `Toffoliゲート <https://en.wikipedia.org/wiki/Quantum_logic_gate#Toffoli_(CCNOT)_gate>`__ は、最初の2つの量子ビット(LSB)がどちらも :math:`\left|1\right\rangle` のとき、3番目の量子ビットを反転します:
ko_kr: `토폴리 게이트 <https://en.wikipedia.org/wiki/Quantum_logic_gate#Toffoli_(CCNOT)_gate>`__ 는 첫번째와 두번째 큐비트(LSB)이 모두 :math:`\left|1\right\rangle` 일 때 세번째 큐비트을 플립한다.
pt_br: A `porta Toffoli <https://en.wikipedia.org/wiki/Quantum_logic_gate#Toffoli_(CCNOT)_gate>`__ inverte o terceiro qubit, se os dois primeiros qubits (LSB) forem ambos :math:`\left|1\right\rangle`:
ru: `Вентиль Тоффоли <https://ru.wikipedia.org/wiki/Вентиль_Тоффоли >`__ переворачивает третий кубит, если каждый из первых двух (младших) находится в состоянии :math:`\left|1\right\rangle`:
sw_ke: Lango la `Toffoli <https://en.wikipedia.org/wiki/Quantum_logic_gate#Toffoli_(CCNOT)_gate>`__ hupindua qubit ya tatu ikiwa qubit za kwanza mbili (LSB) ziko katika hali ya :math:`\left|1\right\rangle`:
ta: `டோஃபோலி கேட் <https://en.wikipedia.org/wiki/Quantum_logic_gate#Toffoli_ (CCNOT) _gate>`__ முதல் இரண்டு குவிட்கள் (LSB) இரண்டும் இருந்தால் மூன்றாவது குவிட்டைப் புரட்டுகிறது :math:`\left|1\right\rangle`:
tr: `Toffoli gate <https://en.wikipedia.org/wiki/Quantum_logic_gate#Toffoli_(CCNOT)_gate>`__ eğer ilk iki kübitin (LSB) ikisi de :math:`\left|1\right\rangle` ise üçüncü kübiti çevirir:

source: \left|abc\right\rangle \rightarrow \left|bc\oplus a\right\rangle \otimes \left|b\right\rangle \otimes \left|c\right\rangle.
fr_fr: \left|abc\right\rangle \rightarrow \left|bc\oplus un angle\right\rangle \otimes \left|b\right\rangle \otimes \left|c\right\rangle.

source: In matrix form, the Toffoli gate is
bn_bn: টফোলি যুক্তিবর্তনীর ম্যাট্রিক্স রূপ হচ্ছে
es_un: En forma matricial, la compuerta de Toffoli es
fr_fr: Sous forme de matrice, la porte Toffoli est
id_id: Dalam bentuk matrik, gate Toffoli adalah
it_it: In forma matriciale, il gate Toffoli è
ja: 行列形式では、トフォリゲートは
ko_kr: 행렬식으로 표현한 토폴리 게이트는 다음과 같다.
pt_br: Em sua forma matricial, a porta Toffoli é
ru: В матричном виде вентиль Тоффоли выглядит как
sw_ke: Katika muundo wa matriki, lango la Toffoli ni
ta: மாட்ரிக்ஸ் வடிவில் டோஃப்லோலி வாயிலாக உள்ளது
tr: Matris formunda, Toffoli kapısı şu şekildedir

source: C_{CX} = \begin{pmatrix} 1 & 0 & 0 & 0 & 0 & 0 & 0 & 0\\ 0 & 1 & 0 & 0 & 0 & 0 & 0 & 0\\ 0 & 0 & 1 & 0 & 0 & 0 & 0 & 0\\ 0 & 0 & 0 & 0 & 0 & 0 & 0 & 1\\ 0 & 0 & 0 & 0 & 1 & 0 & 0 & 0\\ 0 & 0 & 0 & 0 & 0 & 1 & 0 & 0\\ 0 & 0 & 0 & 0 & 0 & 0 & 1 & 0\\ 0 & 0 & 0 & 1 & 0 & 0 & 0 & 0 \end{pmatrix}.
fr_fr: C_{CX} = \begin{pmatrix} 1 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0\\ 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 \\ 0 & 0 & 0 & 0 & 0 & 0 \end{pmatrix}.

source: Controlled swap gate (Fredkin Gate)
bn_bn: কন্ট্রোল্ড অদলবদল (সোয়াপ) যুক্তিবর্তনী (গেইট) (ফ্রেডকিন যুক্তিবর্তনী (গেইট))
es_un: Compuerta de intercambio controlada (Compuerta Fredkin)
fr_fr: Porte d'échange (swap) contrôlée (Porte de Fredkin)
id_id: Gate kontrol swap (Gate Fredkin)
it_it: Gate di scambio controllato (gate Fredkin)
ja: 制御SWAPゲート (Fredkinゲート)
ko_kr: 교환 제어 게이트(프레드킨 게이트)(Controlled swap gate, Fredkin gate)
pt_br: Porta controlada de troca (Porta Fredkin)
ru: Вентиль управляемого обмена (вентиль Фредкина)
sw_ke: Lango la kubadilishana (swap) (lango la Fredkin)
ta: கட்டுப்படுத்தப்பட்ட swap வாயில் (Fredkin Gate)
tr: Kontrollü swap kapısı (Fredkin Kapısı)

source: The `Fredkin gate <https://en.wikipedia.org/wiki/Quantum_logic_gate#Fredkin_(CSWAP)_gate>`__, or the *controlled swap gate*, exchanges the second and third qubits if the first qubit (LSB) is :math:`\left|1\right\rangle`:
bn_bn: ফ্রেডকিন যুক্তিবর্তনী <https://en.wikipedia.org/wiki/Quantum_logic_gate#Fredkin_(CSWAP)_gate>`__, অথবা *নিয়ন্ত্রিত অদলবদল (সোয়াপ) যুক্তিবর্তনী (গেইট)*, যা দ্বিতীয় এবং তৃতীয় কিউবিটের জায়গা নিজেদের মধ্যে পরিবর্তন করে যদি প্রথম কিউবিট (এলএসবি) :math:`\left|1\right\rangle` হয়:
es_un: La `compuerta de Fredkin <https://en.wikipedia.org/wiki/Quantum_logic_gate#Fredkin_(CSWAP)_gate>`__, o la *compuerta de intercambio controlada*, intercambia el segundo y tercer qubits si el primer qubit (LSB) es :math:`\left|1\right\rangle`:
fr_fr: La `porte de Fredkin <https://en.wikipedia.org/wiki/Quantum_logic_gate#Fredkin_(CSWAP)_gate>`__, ou la *porte d'échange contrôlée*, échange les deuxième et troisième qubits si le premier qubit (LSB) est :math:`\left|1\right\rangle`:
id_id: `Fredkin gate <https://en.wikipedia.org/wiki/Quantum_logic_gate#Fredkin_(CSWAP)_gate>` __, atau *controlled swap gate*, menukar qubit kedua dan ketiga jika qubit pertama (LSB) adalah :math:` \left | 1\right\rangle `:
it_it: Il `gate Fredkin <https://en.wikipedia.org/wiki/Quantum_logic_gate#Fredkin_(CSWAP)_gate>`__, o il *gate di scambio controllato*, scambia il secondo ed il terzo qubit se il primo qubit (LSB) è :math:`\left|1\right\rangle`:
ja: `Fredkinゲート <https://en.wikipedia.org/wiki/Quantum_logic_gate#Fredkin_(CSWAP)_gate>`__、または *制御SWAPゲート* は、最初の量子ビット(LSB)が :math:`\left|1\right\rangle` のとき、2番目と3番目の量子ビットを交換します:
ko_kr: `프레드킨 게이트 <https://en.wikipedia.org/wiki/Quantum_logic_gate#Fredkin_(CSWAP)_gate>`__ 혹은 *교환 제어 게이트(controlled swap gate)* 는 첫번째(LSB) 큐비트이 :math:`\left|1\right\rangle` 일 때 두번째와 세번째 큐비트를 교환한다.
pt_br: A `porta Fredkin <https://en.wikipedia.org/wiki/Quantum_logic_gate#Fredkin_(CSWAP)_gate>`__, ou *porta controlada de troca*, troca o segundo e o terceiro qubits, se o primeiro qubit (LSB) for :math:`\left|1\right\rangle`:
ru: `Вентиль Фредкина <https://ru.wikipedia.org/wiki/Вентиль_Фредкина >`__, или *вентиль управляемого обмена*, меняет местами состояния второго и третьего кубитов, если первый (младший) находится в состоянии :math:`\left|1\right\rangle`:
sw_ke: Lango la `Fredkin gate <https://en.wikipedia.org/wiki/Quantum_logic_gate#Fredkin_(CSWAP)_gate>`__, au *lango la kubadilishana (swap) lililodhibitiwa*, hubadilisha qubit za pili na za tatu iwapo qubit ya kwanza (LSB) ni :math:`\left|1\right\rangle`:
ta: The `Fredkin gate <https://en.wikipedia.org/wiki/Quantum_logic_gate#Fredkin_(CSWAP)_gate>`__, அல்லது *கட்டுப்படுத்தப்பட்ட இடமாற்று வாயில்*, முதல் குவிட் (LSB) என்றால் இரண்டாவது மற்றும் மூன்றாவது குவிட்களை பரிமாறிக்கொள்கிறது :math:`\left|1\right\rangle`:
tr: `Fredkin gate <https://en.wikipedia.org/wiki/Quantum_logic_gate#Fredkin_(CSWAP)_gate>`__ veya *kontrollü takas geçiti*, birinci kübit (LSB):math:`\left|1\right\rangle` ise, ikinci ve üçüncü kübitleri değiştirir:

source: In matrix form, the Fredkin gate is
bn_bn: ফ্রেডকিন যুক্তিবর্তনীর ম্যাট্রিক্স রূপ হচ্ছে
es_un: En forma matricial, la compuerta de Fredkin es
fr_fr: Sous forme de matrice, la porte Fredkin est
id_id: Dalam bentuk matrik, gate Fredkin adalah
it_it: In forma matriciale, il gate Fredkin è
ja: 行列形式では、Fredkinゲートは以下の通りになります。
ko_kr: 프레드킨 게이트를 행렬로 표현하면 다음과 같다.
pt_br: Em sua forma matricial, a porta Fredkin é
ru: В матричном виде вентиль Фердкина имеет вид
sw_ke: Katika muundo wa matriki, lango la Fredkin ni
ta: அணி வடிவத்தில், ஃப்ரெட்ரிக்ஸ் கேட் உள்ளது
tr: Matris formunda, Fredkin kapısı şu şekildedir

source: C_{\mathrm{SWAP}} = \begin{pmatrix} 1 & 0 & 0 & 0 & 0 & 0 & 0 & 0\\ 0 & 1 & 0 & 0 & 0 & 0 & 0 & 0\\ 0 & 0 & 1 & 0 & 0 & 0 & 0 & 0\\ 0 & 0 & 0 & 0 & 0 & 1 & 0 & 0\\ 0 & 0 & 0 & 0 & 1 & 0 & 0 & 0\\ 0 & 0 & 0 & 1 & 0 & 0 & 0 & 0\\ 0 & 0 & 0 & 0 & 0 & 0 & 1 & 0\\ 0 & 0 & 0 & 0 & 0 & 0 & 0 & 1 \end{pmatrix}.
fr_fr: C_{\mathrm{SWAP}} = \begin{pmatrix} 1 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0\\ 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 1 \end{pmatrix}.

source: Non-unitary operations
bn_bn: অনৈকিক ক্রিয়াকলাপ (অপারেশন)
es_un: Operaciones no unitarias
fr_fr: Opérations non unitaires
id_id: Operasi non-unitary
it_it: Operazioni non unitarie
ja: 非ユニタリ操作
ko_kr: 비 유니테리 연산들 (Non-unitary operations)
pt_br: Operações não unitárias
ru: Неунитарные операции
sw_ke: Operesheni zisizo unitary
ta: கூடுதலான செயல்பாடுகள்
tr: Üniter olmayan operasyonlar

source: Now that we have gone through all the unitary operations in quantum circuits, we also have access to non-unitary operations. These include measurements, reset of qubits, and classical conditional operations.
bn_bn: এখন আমরা কোয়ান্টাম বর্তনীর সকম একক কার্যক্রম সংক্রান্ত যুক্তিবর্তনীর সাথে পরিচিত ফলে কোয়ান্টাম বর্তনীর নন-ইউনিটারী কার্যক্রমও আমরা সদ্য পরিচিত হওয়া যুক্তিবর্তনী দিয়ে করতে পারব। এই নন-ইউনিটারি কার্যক্রমের মধ্যে আছে মেজারমেন্টস, কিউবিটকে প্রারম্ভিক অবস্থায় ফিরিয়ে আনা এবং ক্লাসিকাল শর্তাধীন কার্যক্রম (অপারেশনস)।
es_un: Ahora que hemos pasado por todas las operaciones unitarias en circuitos cuánticos, también tenemos acceso a operaciones no unitarias. Estas incluyen mediciones, restablecimiento de qubits, y operaciones condicionales clásicas.
fr_fr: En plus de toutes les opérations unitaires dans les circuits quantiques, nous avons aussi accès à des opérations non unitaires. Il s'agit notamment des mesures, de la réinitialisation des qubits et des opérations conditionnelles classiques.
id_id: Setelah kita melihat semua operasi unitary dalam sirkuit kuantum, kita juga memiliki akses ke operasi non-unitary. Ini termasuk pengukuran, riset, dan operasi kondisional klasik.
it_it: Dopo aver visto tutte le operazioni unitarie disponibili nei circuiti quantistici, andiamo a osservare anche le operazioni non unitarie. Queste includono le misure, il reset dei qubit e le operazioni condizionali classiche.
ja: ここまで、量子回路におけるすべてのユニタリ操作について見てきましたが、非ユニタリ操作についても見ていきましょう。ここでは、測定、キュービットのリセット、そして古典的条件付き操作が含まれます。
ko_kr: 양자 회로에서 사용가능한 모든 유니터리 연산들을 살펴보았으니 이제 유니터리가 아닌 연산들을 살펴보도록 하자. 유니터리가 아닌 연산에는 측정, 큐비트의 reset, classical conditional 연산이 있다.
pt_br: Agora que passamos por todas as operações unitárias em circuitos quânticos, também temos acesso a operações não unitárias. Estas incluem medições, reset de qubits e operações condicionais clássicas.
ru: Рассмотрев все унитарные операции квантовых схем, перейдем к неунитарным. К ним относятся измерения, перезагрузка кубита и классические условные операции.
sw_ke: Sasa kwa kuwa tumepitia operesheni zote za unitary katika saketi za kwanta, pia tunaweza kupata kufikia operesheni zisizo za unitary. Hizi ni pamoja na vipimo, kuweka upya qubits na operesheni za masharti ya kawaida.
ta: இப ் பொழுது நாம ் அனைத ் தத ் தில ் சென ் றோம ். இவை அளவீடுகள், குறும்படங்களின் மறுமலைகள், மற்றும் சாதாரண சம்பந்தமான செயல்பாடுகள் ஆகியவை அடங்கும்.
tr: Artık kuantum devrelerdeki bütün üniter operasyonları gördüğümüze göre, üniter olmayan operasyonlara da bakabiliriz. Bunlar ölçümler, kübitlerin sıfırlanması ve klasik koşullu işlemleri içerir.

source: Measurements
bn_bn: পরিমাপ
es_un: Mediciones
fr_fr: Mesures
id_id: Pengukuran
it_it: Misurazioni
ja: 測定
ko_kr: 측정
pt_br: Medições
ru: Измерения
sw_ke: Vipimo
ta: மேற்கோள்கள்
tr: Ölçümler

source: We don't have access to all the information when we make a measurement in a quantum computer. The quantum state is projected onto the standard basis. Below are two examples showing a circuit that is prepared in a basis state and the quantum computer prepared in a superposition state.
es_un: No tenemos acceso a toda la información cuando hacemos una medición en una computadora cuántica. El estado cuántico es proyectado a una de las bases estándar. A continuación, hay dos ejemplos que muestran un circuito preparado en un estado base y la computadora cuántica preparada en un estado de superposición.
fr_fr: Nous n'avons pas accès à toutes les informations lorsque nous faisons une mesure dans un ordinateur quantique. L'état quantique est projeté sur la base standard. Ci-dessous sont deux exemples montrant un circuit qui est préparé dans un état de base et l'ordinateur quantique préparé dans un état de superposition.
ru: При измерениях в квантовом компьютере невозможно получить всю информацию. Состояние кубита проектируется на стандартный базис. Ниже приведены два примера со схемами, создающими базисное состояние и состояние суперпозиции.

source: The simulator predicts that 100 percent of the time the classical register returns 0.
bn_bn: এই সিমুলেটর ভবিষ্যদ্বাণী করে যে ১০০ শতাংশ বার ধ্রুপদি রেজিস্টার ০ দেবে।
es_un: El simulador predice que el 100% de las veces el registro clásico devuelve 0.
fr_fr: Le simulateur prédit que 100% du temps que le registre classique renvoie 0.
id_id: Simulator ini memprediksi bahwa 100 persen dari setiap waktu register klasik menghasilkan 0.
it_it: Il simulatore prevede che al 100% di probabilità il registro classico restituirà 0.
ja: シミュレーターは古典レジスタが0を返す確率が100%であることを予測しています。
ko_kr: 이 시뮬레이터는 100퍼센트 확률로 고전적인 레지스터의 값이 0 임을 예측한다.
pt_br: O simulador prevê que, em 100% do tempo, o registrador clássico retorna 0.
ru: Симулятор показывает, что в 100 процентах случаев в классическом регистре будет 0.
sw_ke: Chombo cha uigaji kinatabiri kuwa asilimia 100 kila mara, rejista ya kawaida hurejesha 0.
ta: சிகிச்சை 100 சதவீதத்தின்படி, கிளாசிரியர் பதிவு 0 என்று காட்டும்.
tr: Simülatör, klasik yazmacının yüzde 100'ünün 0 döndürdüğünü tahmin ediyor.

source: The simulator predicts that 50 percent of the time the classical register returns 0 or 1.
bn_bn: এই সিমুলেটর ভবিষ্যদ্বাণী করে যে সময় ৫০ শতাংশ সময় ধ্রুপদি রেজিস্টার ০ কিংবা ১ মান দেয়।
es_un: El simulador predice que el 50% de las veces, el registro clásico devuelve 0 o 1.
fr_fr: Le simulateur prédit que 50% du temps le registre classique soit 0 ou 1.
id_id: Simulator ini memprediksi bahwa 50 persen dari setiap waktu register klasik menghasilkan 0 atau 1.
it_it: Il simulatore prevede che al 50% di probabilità il registro classico restituirà 0 o 1.
ja: シミュレーターは古典レジスタが0もしくは1を返す確率が50%であることを予測しています。
ko_kr: 이 시뮬레이터는 50퍼센트 확률로 고전적인 레지스터의 값이 0이거나 1임을 예측한다.
pt_br: O simulador prevê que, em 50% do tempo, o registrador clássico retorna 0 ou 1.
ru: Симулятор показывает, что в 50 процентах случаев в классическом регистре будет 0.
sw_ke: Chombo cha uigaji hutabiri kwamba asilimia 50 kila mara, rejista ya kawaida hurejesha 0 au 1.
ta: பாரம்பரியக் கோட்பாடு 50 சதவீதத்தின்படி நுழைவு பதிவு 0 அல்லது 1 என்று காட்டும்.
tr: Simülatör, klasik yazmacın yüzde 50'sinin 0 veya 1 döndürdüğünü tahmin ediyor.

source: Reset
bn_bn: পুনস্থাপন (রিসেট)
es_un: Restablecimiento
fr_fr: Réinitialisation
id_id: Riset
ja: リセット
ko_kr: 초기화 (Reset)
pt_br: Redefinir
ru: Сброс
sw_ke: Weka upya
ta: மீட்டமை
tr: Sıfırlama

source: It is also possible to ``reset`` qubits to the :math:`\left|0\right\rangle` state in the middle of computation. Note that ``reset`` is not a Gate operation, since it is irreversible.
bn_bn: কিউবিটগুলকে ```পূর্বাবস্থা (রিসেট)``` অর্থাৎ :math:`\left|0\right\rangle` অবস্থায় করা সম্ভব গণনা চলাকালীন। মনে রাখবেন যে ```পূর্বাবস্থা (রিসেট)``` কিন্তু কোনও যুক্তিবর্তনী (গেইট) নয়, যেহেতু সেটা অপরিবর্তনীয়।
es_un: También es posible ``reset`` (restablecer) qubits al estado :math:`\left|0\right\rangle` en medio del cálculo. Ten en cuenta que ``reset`` no es una operación de compuerta, ya que es irreversible.
fr_fr: Il est également possible de ` ` réinitialiser ` ` les qubits vers l'état :math:` \left | 0\rposition\rangle ` au milieu du calcul. Notez que ` ` reset ` ` n'est pas une porte logique, puisqu'elle est irréversible.
id_id: Hal ini juga mungkin untuk ` ` reset ` ` qubits ke :math:` \left | 0\right\rangle` di tengah komputasi. Perhatikan bahwa ` ` reset ` ` bukan sebuah operasi gate, karena dia tidak reversibel.
it_it: E' anche possibile ``effettuare il reset`` di qubit allo stato :math:`\left|0\right\rangle` durante l'esecuzione. Da notare che il ``reset`` non è un gate di operazione, poichè non è reversibile.
ja: リセット演算子はキュービットを計算の途中で :math:`\left|0\right\rangle` 状態に ``リセット`` することができます。ここでの ``リセット`` は、不可逆なのでゲート操作ではないことに注意してください。
ko_kr: 계산하는 동안 큐비트들을 :math:`\left|0\right\rangle` 상태로 ``재설정`` 하는 것도 가능하다. ``재설정`` 은 가역연산이 아니므로 게이트 연산이 아님을 주목하자.
pt_br: Também é possível ``reset`` qubits para o estado :math:`\left|0\right\rangle` no meio do processamento. Observe que ``reset`` não é uma operação de Gate, uma vez que é irreversível.
ru: Также можно перезагрузить кубит с помощью ``reset``, переводя его состояние в :math:`\left|0\right\rangle` в процессе вычислений. Обратите внимание, что ``reset`` не является вентилем, так как это необратимая операция.
sw_ke: Inawezekana pia kufanya ``reset`` ya qubits zikawa katika hali ya :math:`\left|0\right\rangle` katikati ya utarakilishi. Kumbuka kuwa ``reset`` sio operesheni ya lango kwa kuwa haiwezi kutenduliwa.
ta: இது :math:`\left|0\right\rangle` கணக்கீட்டின் நடுவில் நிலை. ``reset`` என்பதை ஒரு கேட் செயல்பாடு இல்லை என்பதை கவனிக்கவும், அது அறுதியாக உள்ளது.
tr: Ayrıca kübitleri hesaplamanın ortasında :math:`\left|0\right\rangle` durumuna ``reset`` mümkündür. ``reset`` geri döndürülemez olduğu için bir kapı işlemi olmadığını unutmayın.

source: Here we see that for both of these circuits the simulator always predicts that the output is 100 percent in the 0 state.
bn_bn: এইখানে আমরা দেখতে পাচ্ছি যে, সিমুলেটরটি শতভাগ ০ অবস্থার ফলাফল ভবিষ্যৎবাণী করে।.
es_un: Aquí vemos que para ambos de estos circuitos el simulador siempre predice que la salida es del 100 porciento en el estado 0.
fr_fr: Ici, nous voyons que pour ces deux circuits, le simulateur prévoit toujours que la sortie est à 100% dans l'état 0.
id_id: Di sini kita melihat bahwa untuk kedua sirkuit ini simulator selalu memprediksi bahwa output adalah 100 persen dalam keadaan 0.
it_it: Qui vediamo che per entrambi questi circuiti il simulatore prevede sempre che l'output è al 100% di probabilità nello stato 0.
ja: ここで、両方の回路においてシミュレーターは出力が100%の確率で0状態であることを常に予測することが確認できます。
ko_kr: 여기서 우리는 시뮬레이터가 두 회로 모두 결과값이 0 상태임을 100 퍼센트의 확률로 예측함을 알 수 있다.
pt_br: Aqui vemos que, para ambos os circuitos, o simulador sempre prevê que a saída é o estado 0, em 100% das vezes.
ru: Как видно ниже, для обеих схем симулятор предсказывает, что в 100 процентах случаев результатом будет 0.
sw_ke: Hapa tunaona kuwa kwa saketi zote mbili, chombo cha uigaji kila wakati hutabiri kuwa pato ni asilimia 100 katika hali ya 0.
ta: இந்த இரண்டு சுற்றுகளுக்கும் சிமுலேட்டர் எப்போதும் 0 நிலையில் வெளியீடு 100 சதவீதம் என்று கணிக்கிறது என்பதை இங்கே காண்கிறோம்.
tr: Burada, her iki devre için de simülatörün her zaman yüzde 100 çıkışın 0 durumunda olduğunu tahmin ettiğini görüyoruz.

source: Conditional operations
bn_bn: শর্তাধীন কার্যক্রম
es_un: Operaciones condicionales
fr_fr: Opérations conditionnelles
id_id: Operasi kondisional
it_it: Operazioni condizionali
ja: 条件付き操作
ko_kr: 조건 연산자
pt_br: Operações condicionais
ru: Условные операции
sw_ke: Operesheni zenye masharti
ta: நிபந்தனை செயல்பாடுகள்
tr: Koşullu işlemler

source: It is also possible to do operations conditioned on the state of the classical register
bn_bn: ধ্রুপদী রেজিস্টারের অবস্থা শর্তাধীন কার্যক্রম দ্বারা করা সম্ভব।
es_un: También es posible realizar operaciones condicionadas al estado del registro clásico
fr_fr: Il est également possible d'effectuer des opérations conditionnées par l'état du registre classique
id_id: Juga bisa untuk melakukan operasi dikondisikan dari keadaan register klasik
it_it: E' anche possibile fare delle operazioni condizionate dallo stato del registro classico
ja: 古典レジスタの状態に応じて操作を行うことも可能です。
ko_kr: 고전적인 레지스터의 상태에 따라 연산을 하는 것도 가능하다.
pt_br: Também é possível fazer operações condicionadas ao estado do registrador clássico
ru: Также можно выполнять операции, обусловленные состоянием классического регистра
sw_ke: Inawezekana pia kufanya operesheni zilizowekwa masharti juu ya hali ya rejista ya kawaida
ta: செம்மொழி பதிவு நிலையிலான செயல்பாடுகள் கூட இயலாது
tr: Klasik yazmacın durumuna göre işlem yapmak da mümkündür.

source: Here the classical bit always takes the value 0 so the qubit state is always flipped.
bn_bn: এখানে ধ্রুপদি বিট সম সময় ০ মান ধারণ করে তাই তার কিউবিটের অবস্থা সবসময় উল্টানো থাকে।
es_un: Aquí el bit clásico siempre toma el valor 0 para que el estado del qubit sea siempre invertido.
fr_fr: Ici, le bit classique prend toujours la valeur 0 donc l'état du qubit est toujours inversé.
id_id: Di sini bit klasik selalu mengambil nilai 0 sehingga keadaan qubit selalu dibalik.
it_it: Qui il bit classico prende sempre il valore 0 quindi lo stato del qubit viene sempre capovolto.
ja: ここでは古典ビットは常に値0をとるので、量子ビットの状態は常に反転されます。
ko_kr: 여기서 고전 비트의 값은 항상 0이라서 큐비트의 상태는 항상 플립된다.
pt_br: Aqui o bit clássico sempre recebe o valor 0, então, o estado do qubit é sempre invertido.
ru: Здесь классический бит всегда принимает значение 0, поэтому состояние кубита всегда переворачивается.
sw_ke: Hapa, biti ya klasiki kila mara huchukua thamani ya 0, kwa hivyo hali ya qubit kila wakati huwa imepinduliwa.
ta: இங்கு சாதாரண பிட் எப்போதும் மதிப்பு 0 எடுத்துக்கொள்ளும் எனவே குவிட் மாநிலம் எப்பொழுதும் ஒழுங்குபடுத்துகிறது.
tr: Burada klasik bit her zaman 0 değerini alır, böylece kübit durumu her zaman ters çevrilir.
