Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/circuits/3_summary_of_quantum_operations.po
Languages: bn_bn, es_un, fr_fr, id_id, it_it, ja, ko_kr, pt_br, ru, sw_ke, ta, tr

source: Apply the :math:`Y` gate to the target qubit if the control qubit is the MSB
bn_bn: যদি নিয়ন্ত্রনকারী কিউবিট MSB হয়, তাহলে নিয়ন্ত্রিত কিউবিটে :math:`Y` প্রয়োগ করা যাবে।
es_un: Aplicamos la compuerta :math:`Y` al qubit objetivo si el qubit de control es el MSB
fr_fr: Applique la porte :math:` Y au qubit cible si le qubit de contrôle est le MSB
id_id: Terapkan gerbang :math:` Y ` ke qubit target jika qubit kontrol adalah MSB
it_it: Applica il gate :math:`Y` al qubit target, se il qubit di controllo è il MSB
ja: 制御量子ビットが MSB の場合、ターゲット量子ビットに :math:`Y` ゲートを適用します。
ko_kr: 조절 큐비트이 MSB이면 :math:`Y` 게이트를 목표 큐비트에 적용한다.
pt_br: Aplica a porta :math:`Y` no qubit alvo, se o qubit de controle for o MSB
ru: Применяет вентиль :math:`Y` к целевому кубиту, если управляющим является старший
sw_ke: Tekeleza lango la :math:`Y` kwenye qubit lengwa iwapo qubit iliyodhibitiwa ni MSB
ta: கட்டுப்பாட்டு குறும்படம் MSB என்றால் :math:`Y` வாயில் இலக்கு விகிதத்தை பயன்படுத்து
tr: Kontrol kübiti MSB ise :math:`Y` kapısını hedef kübitine uygular

source: or when the LSB is the control
bn_bn: অথবা যখন এলএসবি নিয়ন্ত্রনকারী কিউবিট হবে।
es_un: o cuando el LSB es el control
fr_fr: ou lorsque le LSB est le qubit de contrôle
id_id: atau ketika LSB adalah kontrol
it_it: o quando invece il LSB è il qubit di controllo
ja: あるいはLSBを制御にした場合
ko_kr: 만약 조절 큐비트이 LSB이면 다음을 적용한다.
pt_br: ou quando o LSB é o controle
ru: или младший кубит
sw_ke: au wakati LSB ipo kwenye udhibiti
ta: அல்லது LSB கட்டுப்பாடு பொழுது
tr: veya LSB kontrol olduğunda

source: Controlled :math:`Z` (or, controlled Phase) gate
bn_bn: কন্ট্রোল্ড :math:`Z (অথবা, কন্ট্রোল্ড দশা) যুক্তিবর্তনী (গেইট)
fr_fr: Porte de contrôle :math:`Z` (ou, porte de contrôle de phase)
id_id: Gerbang Controlled :math:`Z` (atau, controlled Phase)
it_it: Gate :math:`Z` controllato (o fase controllata)
pt_br: Porta :math:`Z` controlada (ou, Fase controlada)
sw_ke: Lango la :math:`Z` Lililodhibitiwa ( au, awamu linalodhibitiwa)

source: Similarly, the controlled Z gate flips the phase of the target qubit if the control qubit is :math:`\left|1\right\rangle`. The matrix looks the same regardless of whether the MSB or LSB is the control qubit:
bn_bn: একইভাবে, যদি নিয়ন্ত্রণকারী কিউবিট :math:`\left|1\right\rangle` হয়, তাহলেই কন্ট্রোল্ড Z যুক্তিবর্তনীতে টার্গেট কিউবিটের দশা পরিবর্তন হবে। ম্যাট্রিক্সটি কন্ট্রোল কিউবিটের এমএসবি অথবা এলএসবি এর উপর নির্ভর করে না:
es_un: Del mismo modo, la compuerta Z controlada invierte la fase del qubit objetivo si el qubit de control es :math:`\left|1\right\rangle`. La matriz se ve igual independientemente de si el MSB o LSB es el qubit de control:
fr_fr: De même, la porte contrôlée Z inverse la phase du qubit cible si le qubit de contrôle est :math:` \left | 1\right\rangle `. La matrice est la même, que le qubit de contrôle soit le MSB ou le LSB:
id_id: Demikian pula, gerbang Z yang dikendalikan akan membalikkan fase dari qubit target jika qubit kontrol adalah :math:` \left | 1\right\rsudut `. Matriks akan terlihat sama terlepas dari apakah MSB atau LSB yang merupakan qubit kontrol:
it_it: In maniera simile, il gate Z controllato inverte la fase del qubit target se il qubit di controllo è :math:`\left|1\right\rangle`. La matrice è la stessa indipendentemente dal fatto che il qubit di controllo sia il MSB o il LSB:
ja: 同様に、制御量子ビットが :math:`\left|1\right\rangle` である場合には、制御された Z ゲートがターゲット量子ビットの位相を反転させます。 この行列は、 MSB または LSB が制御量子ビットかどうかに関係なく、同じになります。
ko_kr: 비슷하게, 위상 반전 게이트는 표적 큐비트의 상태가 :math:`\left|1\right\rangle` 일 때 제어 큐비트의 위상을 뒤집어 준다. 제어 큐비트가 MSB인 경우나 LSB인 경우나 상관없이 행렬은 같은 모양이다.
pt_br: Da mesma forma, a porta Z controlada inverte a fase do qubit alvo, se o qubit de controle for :math:`\left|1\right\rangle`. A matriz parece a mesma, independentemente, de o MSB ou LSB ser o qubit de controle:
ru: Таким же образом управляемый Z gate переворачивает фазу целевого кубита, если управляющий находится в состоянии :math:`\left|1\right\rangle`. При этом вид матрицы не зависит от того, является ли управляющий кубит старшим или младшим:
sw_ke: Vile vile, lango la Z linalodhibitiwa hugeuza awamu ya qubit lengwa ikiwa qubit iliyodhibitiwa iko katika hali ya :math:`\left|1\right\rangle`. Matriki inaonekana sawa bila kujali iwapo MSB au LSB ndio qubit ya kudhibiti:
ta: அதேபோல், கட்டுப்படுத்தப்பட்ட Z வாயில் வெப்பம் சிக்குறுத்தும் விகிதத்தை :math:`\left|1\right\rangle`. MSB அல்லது LSB கட்டுப்பாட்டு குறும்படம் என்பதை இல்லையென்றால் மாட்ரிக்ஸ் ஒரே தெரிகிறது:
tr: Benzer şekilde, eğer kontrol kübiti :math:`\left|1\right\rangle` ise kontrollü Z kapısı hedef kübitin fazını çevirir. Matris, MSB veya LSB'nin kontrol kübiti olup olmadığına bakılmaksızın aynı görünür:

source: Controlled Hadamard gate
bn_bn: কন্ট্রোল্ড হ্যাডামার্ড যুক্তিবর্তনী (গেট)
es_un: Compuerta de Hadamard controlada
fr_fr: Porte de Hadamard contrôlée
id_id: Gate Kontrol Hadamard
it_it: Gate Hadamard Controllato
ja: 制御アダマールゲート
ko_kr: 조절된 Hadamard 게이트
pt_br: Porta controlada Hadamard
ru: Управляемый вентиль Адамара
sw_ke: Lango la Hadamard Lililodhibitiwa
ta: கட்டுப்படுத்தப்பட்ட ஹாட்மார்ட் வாயில்
tr: Kontrollü Hadamard kapısı

source: Apply :math:`H` gate to the target qubit if the control qubit is :math:`\left|1\right\rangle`. Below is the case where the control is the LSB qubit.
bn_bn: যদি নিয়ন্ত্রণ কিউবিট :math:`\left|1\right\rangle`.হয় তাহলে :math:`H` যুক্তিবর্তনী লক্ষ্য কিউবিটে প্রয়োগ করুন। কনট্রোল কিউবিট এলএসবি হলে নিচের পন্থা অবলম্বন করুন।
es_un: Aplica la compuerta :math:`H` al qubit objetivo si el qubit de control es :math:`\left|1\right\rangle`. A continuación, se muestra el caso en el que el control es el qubit LSB.
fr_fr: Applique la porte :math:` H ` au qubit cible si le qubit de contrôle est :math:` \left | 1\right\rangle `. Ci-dessous se trouve le cas où le qubit de contrôle est le LSB.
id_id: Terapkan :math:` H ` H ` ke target qubit jika kontrol qubit adalah :math:` \left | 1\right\rangle `. Di bawah ini adalah contoh ketika kontrol tersebut adalah LSB qubit.
it_it: Applica il gate :math:`H` al qubit target se il qubit di controllo è nello stato :math:`\left|1\right\rangle`. Di seguito è mostrato il caso in cui il qubit di controllo è il LSB.
ja: 制御量子ビットが :math:`\left|1\right\rangle` のとき、ターゲット量子ビットに :math:`H` ゲートを適用します。制御がLSB量子ビットの時、以下の通りになります。
ko_kr: 만약 제어 큐비트가 :math:`\left|1\right\rangle` 이면 :math:`H` 를 타겟 큐비트에 적용한다. 아래는 제어 큐비트가 LSB 큐비트인 경우이다.
pt_br: Aplica a porta :math:`H` no qubit alvo, se o qubit de controle for :math:`\left|1\right\rangle`. Abaixo, está o caso em que o controle é o qubit LSB.
ru: Применяет вентиль :math:`H` к целевому кубиту≤ если управляющий находится в состоянии :math:`\left|1\right\rangle`. Ниже приводится случай, когда управляющим является младший кубит.
sw_ke: Tekeleza lango la :math:`H` kwenye qubit lengwa iwapo qubit iliyodhibitiwa iko katika hali ya :math:`\left|1\right\rangle`. Hapo chini, ni kesi ambapo qubit iliyodhibitiwa ni qubit ya LSB.
ta: :math:`H` வாயில் இலக்கு விகிதத்தில் கட்டுப்பாட்டு விகிதத்தை :math:`\left|1\right\rangle`. கீழே, கட்டுமானம் LSB குவிட் எங்கே உள்ளது.
tr: Kontrol kübiti :math:`\left|1\right\rangle` ise hedef kübite için :math:`H` kapısı uygula. Kontrolün LSB kübit olduğu durum aşağıdadır.

source: Controlled rotation gates
bn_bn: কন্ট্রোল্ড পরামিতিক (রোটেশন বা ঘূর্ণন) যুক্তিবর্তনী
es_un: Compuertas de rotación controladas
fr_fr: Portes de rotation contrôlées
id_id: Gate Kontrol Rotasi
it_it: Gate di rotazione controllati
ja: 制御回転ゲート
ko_kr: 회전 제어 게이트 (Controlled rotation gate)
pt_br: Portas de rotação controladas
ru: Вентили управляемого вращения
sw_ke: Malango ya Mzunguko Yaliyodhibitiwa
ta: கட்டுப்படுத்தப்பட்ட சுழற்சி வாயுக்கள்
tr: Kontrollü döndürme kapıları

source: Controlled rotation around Z-axis
bn_bn: Z-অক্ষের চারপাশে নিয়ন্ত্রিত ঘূর্ণন
es_un: Rotación controlada alrededor del eje Z
fr_fr: Rotation contrôlée autour de l'axe Z
id_id: Kontrol rotasi seputar sumbu Z
it_it: Rotazione controllata attorno all'asse Z
ja: Z軸周りの制御された回転
ko_kr: Z-축을 기준으로 한 회전 제어
pt_br: Rotação controlada em torno do eixo Z
ru: Управляемое вращение вокруг оси Z
sw_ke: Mzunguko unaodhibitiwa kuzunguka jira-Z
ta: Z-அச்சு சுற்றி கட்டுப்படுத்தும் சுழற்சி
tr: Z-ekseni etrafında kontrollü döndürme

source: Perform rotation around Z-axis on the target qubit if the control qubit (here LSB) is :math:`\left|1\right\rangle`.
bn_bn: Z-অক্ষের চারপাশে ঘূর্ণন সম্পাদন করুন লক্ষ্য কিউবিটের উপর যদি নিয়ন্ত্রণ কিউবিট (এখানে এল এস বি) - :math:`\left|1\right\rangle`.
es_un: Realiza la rotación alrededor del eje Z en el qubit de destino si el qubit de control (aquí LSB) es :math:`\left|1\right\rangle`.
fr_fr: Effectue rotation autour de Z-axis sur le qubit cible si le qubit de contrôle (ici LSB) est :math:`\left|1\right\rangle`.
id_id: Lakukan rotasi di seputar sumbu Z pada target qubit jika kontrol qubit (disini LSB) adalah :math:` \left | 1\right\rangle `.
it_it: Esegue una rotazione attorno all'asse Z sul qubit target se il qubit di controllo (qui il LSB) è nello stato :math:`\left|1\right\rangle`.
ja: 制御量子ビット(ここではLSB)が :math:`\left|1\right\rangle` の場合、ターゲット量子ビットでZ軸周りの回転を実行します。
ko_kr: 만약 조절 큐비트 (여기서는 LSB)가 :math:`\left|1\right\rangle`인 경우 z-축을 중심으로 회전 변환을 실행한다.
pt_br: Executa uma rotação em torno do eixo Z no qubit alvo, se o qubit de controle (LSB aqui) for :math:`\left|1\right\rangle`.
ru: Задает вращение вокруг оси Z целевого кубита, если управляющий (здесь это младший) находится в состоянии :math:`\left|1\right\rangle`.
sw_ke: Tekeleza mzunguko kuzunguka jira-Z kwenye qubit lengwa iwapo qubit iliyodhibitiwa (hapa ni LSB) ni :math:`\left|1\right\rangle`.
ta: Z-அச்சின் சுழற்சி சுழற்சி சுழற்சி சுழற்சி விகிதத்தில்(இங்கு LSB) :math:`\left|1\right\rangle`.
tr: Eğer kontrol kübit (burada LSB):math:`\left|1\right\rangle` ise, hedef kübit üzerinde Z ekseni etrafında döndürme yapın.

source: Controlled phase rotation
bn_bn: নিয়ন্ত্রিত দশা (ফেজ) ঘূর্ণন
es_un: Rotación de fase controlada
fr_fr: Rotation de phase contrôlée
id_id: Kontrol rotasi fase
it_it: Rotazione di fase controllata
ja: 制御位相回転
ko_kr: 위상 제어 회전
pt_br: Rotação de fase controlada
ru: Управляемое фазовое вращение
sw_ke: Mzunguko wa awamu uliodhibitiwa
ta: கட்டுப்படுத்தப்பட்ட பக்க சுழற்சி
tr: Kontrollü faz döndürme

source: Perform a phase rotation if both qubits are in the :math:`\left|11\right\rangle` state. The matrix looks the same regardless of whether the MSB or LSB is the control qubit.
bn_bn: Z-অক্ষের চারপাশে ঘূর্ণন সম্পাদন করুন যদি দুটো কিউবিট :math:`\left|11\right\rangle` অবস্থায় থাকে। এম এস বি কিংবা এল এস বি কে নিয়ন্ত্রিত বিট হিসেবে দেখলেও ম্যাট্রিক্সটা একই থাকে।
es_un: Realiza una rotación de fase si ambos qubits están en el estado :math:`\left|11\right\rangle`. La matriz tiene el mismo aspecto independientemente de si el MSB o LSB es el qubit de control.
fr_fr: Effectuez une rotation de phase si les deux bits se trouvent dans l'état :math:` \left | 11\right\r. La matrice est la même, que le MSB ou le LSB soit le qubit de contrôle.
id_id: Lakukan rotasi fase jika kedua qubit adalah :math:` \left | 11\right\rangle`. Matrik terlihat sama terlepas dari apakah MSB atau LSB adalah qubit kontrol.
it_it: Esegue una rotazione di fase se entrambi i qubit sono nello stato :math:`\left|11\right\rangle`. La matrice è la stessa indipendentemente dal fatto che il qubit di controllo sia il MSB o il LSB.
ja: 両方の量子ビットが :math:`\left|11\right\rangle` の状態の場合、位相の回転を実行します。 行列は、MSBまたはLSBが制御量子ビットであるかどうかに関係なく同じに見えます。
ko_kr: 만약 두 큐비트가 모두 :math:`\left|11\right\rangle` 상태에 있으면 위상 회전을 실시한다. 이 경우 조절 큐비트가 MSB나 LSB에 상관없이 행렬은 같은 형태이다.
pt_br: Realiza uma rotação da fase, se ambos os qubits estiverem no estado :math:`\left|11\right\rangle`. A matriz parece a mesma, independentemente, do MSB ou do LSB ser o qubit de controle.
ru: Задает поворот фазы для состояния :math:`\left|11\right\rangle`. Вид матрицы не зависит от того, является ли управляющий кубит старшим или младшим.
sw_ke: Tekeleza mzunguko wa awamu iwapo qubits zote mbili ziko katika hali ya :math:`\left|11\right\rangle`. Matriki inaonekana sawa pasi na kadirio la iwapo MSB au LSB ni qubit iliyodhibitiwa.
ta: இரண்டு க்யூட்டுகள் :math:`\left|11\right\rangle` மாநிலமாகும். MMSB அல்லது LSB கட்டுப்பாட்டு குறும்படம் இருந்ததா என்பதை இல்லையென்றால் மாட்ரிக்ஸ் ஒரே தெரிகிறது.
tr: Her iki kübit de :math:`\left|11\right\rangle` durumundaysa, bir faz rotasyonu gerçekleştirin. Matris, MSB veya LSB'nin kontrol kübiti olup olmadığına bakılmaksızın aynı görünür.

source: C_{u1}(\lambda) = \begin{pmatrix} 1 & 0 & 0 & 0\\ 0 & 1 & 0 & 0\\ 0 & 0 & 1 & 0\\ 0 & 0 & 0 & e^{i\lambda} \end{pmatrix}
fr_fr: C_{u1}(\lambda) = \begin{pmatrix} 1 & 0 & 0 & 0 & 0\\ 0 & 0 & 0 & 0\\ 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & e^{i\lambda} \end{pmatrix}

source: Controlled :math:`u3` rotation
fr_fr: Rotation :math:`u3` contrôlée
id_id: Kontrol rotasi :math:` u3 `
it_it: Rotazione :math:`u3` controllata
pt_br: Rotação :math:`u3` controlada

source: Perform controlled-\ :math:`u3` rotation on the target qubit if the control qubit (here LSB) is :math:`\left|1\right\rangle`.
bn_bn: কন্ট্রোল্ড :math:`u3` ঘূর্ণন লক্ষ কিউবিটের উপর যদি নিয়ন্ত্রিত কিউবিট (এখানে এল এস বি) :math:`\left|1\right\rangle` হয়।
fr_fr: Effectue la rotation contrôlée-\ :math:`u3` sur le qubit cible si le qubit de contrôle (ici LSB) est :math:`\left|1\right\rangle`.
id_id: Lakukan rotasi control-\ :math:` u3 ` pada target qubit jika kontrol qubit (di sini LSB) adalah :math:` \left | 1\right\rangle `.
it_it: Esegue una rotazione :math:`u3` controllata sul qubit target se il qubit di controllo (qui il LSB) è nello stato :math:`\left|1\right\rangle`.
pt_br: Executa uma rotação :math:`u3` controlada no qubit alvo, se o qubit de controle (aqui LSB) for :math:`\left|1\right\rangle`.
sw_ke: Tekeleza mzunguko wa :math:`u3` uliodhibitiwa kwenye qubit lengwa iwapo qubit iliyodhibitiwa (hapa ni LSB) ni :math:`\left|1\right\rangle`.

source: SWAP gate
bn_bn: অদলবদল (সোয়াপ) যুক্তিবর্তনী (গেইট)
es_un: Compuerta SWAP
fr_fr: Porte SWAP
id_id: Gate SWAP
it_it: Gate SWAP
ja: SWAP ゲート
ko_kr: 교환 게이트(SWAP gate)
pt_br: Porta SWAP
ru: Вентиль SWAP
sw_ke: Lango la SWAP
ta: SWAP கிட்டம்
tr: SWAP kapısı

source: The SWAP gate exchanges the two qubits. It transforms the basis vectors as
bn_bn: অদলবদল (সোয়াপ) যুক্তিবর্তনী দু'টি কিউবিট বিনিময় করে। একক দিকরাশিকে এটি এভাবে পরিবর্তন করে
es_un: La compuerta SWAP intercambia los dos qubits. Transforma los vectores bases como
fr_fr: La porte SWAP échange les deux qubits. Elle transforme les vecteurs de base en
id_id: Gate SWAP menukar dua qubit. Ini mengubah vektor basis sebagai
it_it: Il gate SWAP scambia i due qubit. Trasforma i vettori di base secondo
ja: SWAPゲートは2つの量子ビットを交換します。それは次のように基底ベクトルを変換します。
ko_kr: SWAP 게이트는 두 큐비트의 상태를 서로 바꿔 준다. 이는 기저 벡터를 다음과 같이 변환한다.
pt_br: A porta SWAP troca os dois qubits. Ela transforma os vetores da base da seguinte maneira
ru: Вентиль SWAP меняет состояния двух кубитов местами. Он преобразует базисные вектора следующим образом
sw_ke: Lango la SWAP hubadilisha qubits hizo mbili. Inabadilisha vekta msingi kama
ta: SWAP கிட்டத்தட்ட இரண்டு க்விட்ஸை வெளியேற்றுகிறது. இது அடிப்படை வெக்டர்களை மாற்றுகிறது
tr: SWAP kapısı iki kübiti değiştirir. Temel vektörleri şu şekilde dönüştürür

source: \left|00\right\rangle \rightarrow \left|00\right\rangle~,~\left|01\right\rangle \rightarrow \left|10\right\rangle~,~\left|10\right\rangle \rightarrow \left|01\right\rangle~,~\left|11\right\rangle \rightarrow \left|11\right\rangle,
fr_fr: \left|00\rangle\rdroit \rdroite \left|00\rdroite\rangle ~,~\left|01\rangle\rangle \rdroite \left|10\rangle droit\rangle~, \left|10\right\rangle \rightarrow \left|01\right\rangle~,~\left|11\right\rangle \rightarrow \left|11\right\rangle,

source: which gives a matrix representation of the form
bn_bn: যা এই প্রকার একটি ম্যাট্রিক্স উপস্থাপনা দেয়
es_un: que da una representación matricial de la forma
fr_fr: qui donne une représentation matricielle de la forme
id_id: yang memberikan representasi matrik berbentuk
it_it: che produce la seguente rappresentazione matriciale
ja: 行列表現は以下の通りです。
ko_kr: 이것은 다음의 행렬 표현식을 가진다.
pt_br: o que fornece uma representação matricial da forma
ru: что дает матричное представление вида
sw_ke: ambayo inaipa uwakilishi wa matriki wenye muundo wa
ta: இது வடிவத்தின் ஒரு மாட்ரிக்ஸ் பிரதிநிதித்தைக் கொடுக்கிறது
tr: formun matris temsilini veren

source: \mathrm{SWAP} = \begin{pmatrix} 1 & 0 & 0 & 0\\ 0 & 0 & 1 & 0\\ 0 & 1 & 0 & 0\\ 0 & 0 & 0 & 1 \end{pmatrix}.
fr_fr: \mathrm{SWAP} = \begin{pmatrix} 1 & 0 & 0 & 0 & 0 \\ 0 & 0 & 0 & 0 & 0 \\ 0 & 0 & 0 & 0 & 0 \\ 0 & 0 & 1 \end{pmatrix}.

source: Three-qubit gates
bn_bn: তিন-কিউবিট যুক্তিবর্তনী (গেইট)
es_un: Compuertas de tres qubits
fr_fr: Portes à trois qubits
id_id: Gate tiga qubit
it_it: Gate a tre qubit
ja: 3量子ビット・ゲート
ko_kr: 삼중 큐비트 게이트
pt_br: Portas de três qubits
ru: Трехкубитные вентили
sw_ke: Malango ya qubit tatu
ta: இரண்டு-மேற்கோள் வாயுக்கள்
tr: Üç-kübitli kapılar

source: There are two commonly-used three-qubit gates. For three qubits, the basis vectors are ordered as
bn_bn: সর্বাধিক ব্যবহৃত তিন-কিউবিট যুক্তিবর্তনী দু'টি আছে। তিন কিউবিটের জন্য, একক দিকরাশিকে এভাবে ক্রম করা হয়
es_un: Hay dos compuertas de tres qubit comúnmente usadas. Para tres qubits, los vectores base se ordenan como
fr_fr: Il y a deux portes à trois qubits communément utilisées. Pour trois qubits, les vecteurs de base sont ordonnés comme
id_id: Ada dua macam gerbang tiga qubit yang biasa digunakan. Untuk tiga qubits, vektor basis diurut sebagai
it_it: Ci sono due gate a tre qubit comunemente utilizzati. Per tre qubit, i vettori di base sono ordinati come segue
ja: 一般に使用されている2つの3量子ビット・ゲートがあります。3量子ビットにおいて、基底ベクトルは以下の順番になります。
ko_kr: 일반적으로 사용되는 두 가지 삼중 큐비트 게이트가 있다. 세 큐비트의 경우 기저 벡터는 다음과 같이 정렬된다.
pt_br: Existem duas portas de três qubits, comumente, usadas. Para três qubits, os vetores da base são ordenados como
ru: Наиболее распространены два трекубитных вентиля. Базисные вектора такой системы упорядочены следующим образом
sw_ke: Kuna malango mawili ya kawaida ya qubit tatu yanayotumiwa. Kwa qubit tatu, vekta msingi huorodheshwa kama
ta: இரு முக்கோணங்கள் மூன்று-பிட் வாயுக்களும் உள்ளன. மூன்று குறும்படங்களுக்காக, அடிப்படை வெக்டர்களை அளிக்கப்படுகின்றன
tr: İki yaygın olarak kullanılan üç-kübitli kapı vardır. Üç kübit için taban vektörleri şu şekilde sıralanır

source: \left|000\right\rangle, \left|001\right\rangle, \left|010\right\rangle, \left|011\right\rangle, \left|100\right\rangle, \left|101\right\rangle, \left|110\right\rangle, \left|111\right\rangle,
fr_fr: \left|000\rangle droit\r, \left|001\rangle droit\r, \left|010\rangle droit\rangle , \left|011\rangle droit\rangle \left|100\right\rangle, \left|101\right\rangle, \left|110\right\rangle, \left|111\right\rangle,

source: which, as bitstrings, represent the integers :math:`0,1,2,\cdots, 7`. Again, Qiskit uses a representation in which the first qubit is on the right-most side of the tensor product and the third qubit is on the left-most side:
bn_bn: বিটস্ট্রিং এ যা পুর্ণসংখ্যা আকারে প্রকাশ করা যাবে :math:`0,1,2,\cdots, 7`। এইক্ষেত্রে Qiskit টেন্সর গুণনের সবচেয়ে ডানপাশকে প্রথম কিউবিট হিসেবে এবং সবচেয়ে বামপাশকে তৃতীয় কিউবিট হিসেবে বিবেচনা করেঃ:
es_un: que, como cadenas de bits, representan los enteros :math:`0,1,2,\cdots, 7`. Nuevamente, Qiskit utiliza una representación en la que el primer qubit está en el extremo derecho del producto tensorial y el tercer qubit está en el extremo izquierdo:
fr_fr: qui, en tant que chaînes de bits, représentent les entiers :math:`0,1,2,\cdots, 7`. Encore une fois, Qiskit utilise une représentation dans laquelle le premier qubit est celui le plus à droite du produit tenseur et le troisième qubit est le plus à gauche :
id_id: yang, sebagai bitstring, mewakili bilangan bulat :math:` 0,1,2, \cdots, 7 `. Sekali lagi, Qiskit menggunakan representasi di mana qubit pertama berada di sisi yang paling kanan dari produk tensor dan qubit ketiga berada di sisi paling kiri:
it_it: che, come stringhe di bit, rappresentano gli interi :math:`0,1,2,\cdots, 7`. Di nuovo, Qiskit usa una rappresentazione in cui il primo qubit è quello tutta a destra nel prodotto tensoriale, ed il terzo quello tutto a sinistra:
ja: ビット・ストリングは、整数 :math:`0,1,2,\cdots, 7` を表します。繰り返しになりますが、Qiskitは最初の量子ビットがテンソル積の右端にあり、3番目の量子ビットが左端にあるという表現を使用します:
ko_kr: 비트열 처럼 정수 :math:`0,1,2,\cdots, 7` 를 나타낸다. 다시한번 말하지만 Qiskit은 첫번째 큐비트를 가장 오른쪽에 세번째 큐비트를 가장 왼쪽에 위치하는 표현을 사용한다.
pt_br: que, como bitstrings, representam os inteiros :math:`0,1,2,\cdots, 7`. Novamente, o Qiskit usa uma representação, em que o primeiro qubit está do lado direito do produto tensorial e o terceiro qubit está do lado mais à esquerda:
ru: рассматривая их как бинарные строки, получаем числа :math:`0,1,2,\cdots, 7`. Опять-таки, Qiskit располагает первый кубит справа в тензорном произведении, а третий — слева
sw_ke: ambayo, kama bitstrings, huwakliisha namba kamili :math:`0,1,2,\cdots, 7`. Tena, Qiskit hutumia uwakilishi ambapo qubit ya kwanza iko upande wa kulia zaidi wa ufumbuzi wa tensor na qubit ya tatu iko upande wa kushoto zaidi:
ta: இது,பிட்ஸ்ட்ரிங்ஸாக, முழு எண்களைக் குறிக்கிறது :math:`0,1,2, \cdots, 7`. மீண்டும், கிஸ்கிட் ஒரு பிரதிநிதித்துவத்தைப் பயன்படுத்துகிறது, இதில் முதல் குவிட் டென்சர் தயாரிப்பின் வலதுபுறத்திலும் மூன்றாவது குவிட் இடதுபுறத்திலும் உள்ளது:
tr: bit dizisi olarak tamsayıları :math:`0,1,2,\cdots, 7` temsil eder. Yine, Qiskit, birinci kübitin tensör çarpımının en sağ tarafında ve üçüncü kubitin en solda olduğu bir temsili kullanır:

source: Toffoli gate (:math:`ccx` gate)
bn_bn: টফোলি যুক্তিবর্তনী (গেইট) (:math:`ccx` যুক্তিবর্তনী (গেইট))
es_un: Compuerta de Toffoli (compuerta :math:`ccx`)
fr_fr: Porte de Toffoli (:math:` ccx ` gate)
id_id: Gate Toffoli (:math:` ccx ` gate)
it_it: Gate Toffoli (:math:`ccx` gate)
ja: Toffoliゲート( :math:`ccx` ゲート)
ko_kr: 토폴리(Toffoli) 게이트 (:math:`ccx` 게이트)
pt_br: Porta Toffoli (porta :math:`ccx`)
ru: Вентиль Тоффоли (вентиль :math:`ccx`)
sw_ke: Lango la Toffoli (lango la :math:`ccx`)
tr: Toffoli kapısı (:math:`ccx` kapısı)
