Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/01_algorithms_introduction.po
Languages: bn_bn, es_un, fr_fr, id_id, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr, vi_vn, zh_tw

source: Let’s draw the ansatz so we can see it’s a QuantumCircuit where θ[0] through θ[7] will be the parameters that are varied as VQE optimizer finds the minimum eigenvalue. We’ll come back to the parameters later in a working example below.
bn_bn: ansatz-কে আঁকলে আমরা একটি কোয়ান্টাম বর্তনী দেখতে পাব যেখানে θ [0] থেকে θ [7] এমন প্যারামিটারগুলি হবে যা পরিবর্তিত হবে যখন ভি কিউ ই অপ্টিমাইজার সর্বনিম্ন আইজেন ভ্যালু খুঁজে নিবে। নীচের একটি কার্যকারী উদাহরণে আমরা আবারও প্যারামিটারগুলিতে ফিরে আসব।
es_un: Dibujemos el ansatz para que podamos ver que es un QuantumCircuit donde θ[0] a θ[7] van a ser parámetros que serán variados mientras que el optimizador VQE encuentra el mínimo eigenvalor. Volveremos a revisar los parámetros más adelante en un ejemplo.
fr_fr: Nous allons dessiner l'ansatz afin de voir que c'est un QuantumCircuit où θ[0] à θ[7] seront les paramètres qui varieront afin que l'optimiseur VQE trouve la valeur propre minimale. Nous reviendrons plus tard sur les paramètres dans un exemple ci-dessous.
id_id: Mari kita gambar ansatz sehingga bisa dilihat ini adalah sebuah QuantumCircuit dimana dari θ[0] sampai θ[7] adalah parameter yang divariasi ketika pengoptimisasi VQE menemukan eigenvalue minimum. Kita akan kembali ke parameter - parameter ini nanti dalam contoh di bawah ini.
ja_jp: VQE オプティマイザーが最小固有値を求める際の変分パラメーターが θ[0] から θ[7] であるような QuantumCircuit となっていることを確認するため、 ansatz を描画してみましょう。パラメータについては、後ほど作業例で説明します。
ko_kr: Ansatz를 그려서(draw) QuantumCircuit임을 확인해 보자. 여기서 θ[0] 부터 θ[7] 는 VQE 옵티마이저가 최소 고유값을 찾음에 따라 변화하는 매개 변수이다. 아래의 작업 예제에서 매개변수로 다시 돌아올 것이다.
pt_br: Vamos desenhar o ansatz para que possamos ver que é um QuantumCircuit onde[0] através de θ[7] serão os parâmetros variados conforme o otimizador do VQE encontrar o eigenvalue mínimo. Voltaremos aos parâmetros mais tarde, abaixo, em um exemplo funcional.
ta_in: அன்சாட்ஸை வரைவோம், இது ஒரு குவாண்டம் சிர்க்யூட் என்பதைக் காணலாம், அங்கு Q [0] முதல் θ [7] வரை அளவுருக்கள் மாறுபடும், இது VQE ஆப்டிமைசர் குறைந்தபட்ச ஈஜென்வெல்யூவைக் கண்டுபிடிப்பதால் மாறுபடும். கீழேயுள்ள ஒரு வேலை எடுத்துக்காட்டில் நாங்கள் பின்னர் அளவுருக்களுக்கு வருவோம்.
vi_vn: Chúng ta hãy vẽ ansatz để có thể thấy nó là một mạch với từ θ[0] đến θ[7] là các tham số để VQE tìm trị riêng nhỏ nhất. Chúng ta sẽ quay lại với các tham số sau, khi làm việc với một ví dụ dưới đây.

source: But more is needed before we can run the algorithm so let’s get to that next.
bn_bn: তবে অ্যালগরিদম চালাতে পারার আগে আরও কিছু প্রয়োজন, তাই পরবর্তীতে যাওয়া যাক।
es_un: Pero se necesita más para poder ejecutar un algoritmo, así que, vamos a ello a continuación.
fr_fr: Mais il faut plus de choses avant de pouvoir exécuter l'algorithme, alors passons à la suivante.
id_id: Tapi banyak hal diperlukan sebelum kita dapat menjalankan algoritma ini jadi mari kita bahas.
ja_jp: しかしアルゴリズムの実行には、これだけではまだ不十分です。次に進みましょう。
ko_kr: 하지만 알고리즘을 실행하려면 몇 가지 일들이 필요하므로 다음 단계로 넘어가도록 하겠다.
pt_br: Mas é necessário mais antes de podermos executar o algoritmo, então vamos em frente.
ru_ru: Но сначала выполним необходимую подготовку.
ta_in: நாங்கள் வழிமுறையை இயக்குவதற்கு முன்பு இன்னும் பல தேவை, எனவே அடுத்ததைப் பெறுவோம்.
tr: Ancak algoritmayı çalıştırmadan önce daha fazlasına ihtiyaç var, o yüzden bir sonraki aşamaya geçelim.
vi_vn: Nhưng cần nhiều hơn nữa trước khi chúng ta có thể chạy thuật toán, nên hãy tiếp tục đã.
zh_tw: 但我們還需要更多的時間來執行這個演算法，讓我們可以在接下來的時間再接觸這個。

source: How to run an algorithm?
bn_bn: একটি অ্যালগরিদম কিভাবে চালানো যেতে পারে?
es_un: ¿Cómo ejecutar un algoritmo?
fr_fr: Comment exécuter un algorithme ?
id_id: Bagaimana menjalankan algoritma?
ja_jp: アルゴリズムの実行
ko_kr: 알고리즘을 실행하는 방법은 무엇입니까?
pt_br: Como executar um algoritmo?
ru_ru: Как запустить алгоритм?
ta_in: ஒரு வழிமுறையை எவ்வாறு இயக்குவது?
tr: Bir algoritma nasıl çalıştırılır?
vi_vn: Làm thế nào để chạy một thuật toán?
zh_tw: 如何執行演算法？

source: In order to run an algorithm we need to have backend, a simulator or real device, on which the circuits that comprise the algorithm can be run. So for example we can use the ``statevector_simulator`` from the BasicAer provider.
es_un: Para ejecutar un algoritmo necesitamos tener un backend, ya sea un simulador o un dispositivo real; en el que los circuitos que conforman el algoritmo puedan ser ejecutados. Por ejemplo, podemos usar el ``statevector_simulator`` del proveedor BasicAer.
fr_fr: Pour exécuter un algorithme, nous devons avoir un arrière plan, un simulateur ou un appareil réel, sur lequel les circuits qui composent l'algorithme peuvent être exécutés. Ainsi, par exemple, nous pouvons utiliser le ``statevector_simulator`` du fournisseur BasicAer.
id_id: Untuk menjalankan algoritma kita perlu memiliki backend, sebuah simulator atau perangkat nyata, di mana sirkuit yang mewujudkan algoritma dapat dijalankan. Jadi misalnya kita dapat menggunakan ``statevector_simulator`` dari provider BasicAer.
ja_jp: アルゴリズムを実行するためには、そのアルゴリズムを構成する回路の実行が可能なバックエンド、シミュレーター、実デバイスが必要です。例えば、 BasicAer プロバイダーの ``statevector_simulator`` を用いることができます。
ko_kr: 알고리즘을 실행하기 위해, 알고리즘을 구성하는 회로가 실행될 수 있는 백엔드, 시뮬레이터 또는 실제 장치가 있어야 한다. 예를 들어, ``statevector_simulator`` 를 BasicAer 에서 가져다 사용할 수 있다.
pt_br: Para executar um algoritmo precisamos ter um simulador ou dispositivo real no backend, sobre o qual os circuitos que compreendem o algoritmo podem ser executados. Assim, por exemplo, podemos usar o ``statevector_simulator`` do provedor BasicAer.
ta_in: ஒரு வழிமுறையை இயக்குவதற்கு, பின்தளத்தில், ஒரு சிமுலேட்டர் அல்லது உண்மையான சாதனம் இருக்க வேண்டும், அதில் வழிமுறையை உள்ளடக்கிய சுற்றுகள் இயக்கப்படலாம். எனவே எடுத்துக்காட்டாக, BasicAer வழங்குநரிடமிருந்து `` statevector_simulator`` ஐப் பயன்படுத்தலாம்.
vi_vn: Để chạy một thuật toán chúng ta cần phải có backend, mô phỏng hoặc thiết bị thực, mà trên đó các mạch biểu diễn một thuật toán có thể chạy được. Ví dụ, chúng ta có thể sử dụng ``statevector_simulator`` từ nhà cung cấp BasicAer.

source: Now a backend on its own does not have information on how you might want to run the circuits etc. For example how many shots, do you want a noise model, even options around transpiling the circuits. For this Qiskit Aqua has a `QuantumInstance <https://qiskit.org/documentation/stubs/qiskit.aqua.QuantumInstance.html>`__ which is provided both the backend as well as various settings around the circuit processing and execution so for instance:
es_un: Un backend por si solo no tiene la información de como deberías de correr los circuitos etc. Es decir, no te va a decir cuantas iteraciones usar, si necesitas un modelo de ruido, o cuales son tus opciones al transpilar el circuito. Para esto, Qiskit Aqua tiene `QuantumInstance <https://qiskit.org/documentation/stubs/qiskit.aqua.QuantumInstance.html>`__ al que se le proporciona con el backend al igual que algunas especificaciones de configuración del procesamiento y ejecución del circuito, por ejemplo:
fr_fr: Maintenant, un arrière plan seul ne dispose pas d'informations sur la façon dont vous pourriez vouloir exécuter les circuits, etc. Par exemple, combien de tirs, voulez-vous un modèle de bruit, même des options autour du transpileur pour les circuits. Pour cela Qiskit Aqua a un " QuantumInstance <https://qiskit.org/documentation/stubs/qiskit.aqua.QuantumInstance.html>` __ qui est fourni à la fois avec l'arrière plan ainsi que divers réglages autour du circuit de traitement et d'exécution, par exemple:
id_id: Sekarang backend itu sendiri tidak memiliki informasi tentang bagaimana Anda mungkin ingin menjalankan sirkuit dll. Misalnya berapa banyak shots, bagaimana Anda ingin model derau, atau bahkan pilihan bagaimana mentranspilasi sirkuit. Untuk ini Qiskit Aqua memiliki `QuantumInstance <https://qiskit.org/documentation/stubs/qiskit.aqua.QuantumInstance.html>`__ yang menyediakan baik backend serta berbagai pengaturan di sekitar pengolahan sirkuit dan eksekusi sehingga misalnya:
ja_jp: この時点で、バックエンド単体はどのように回路を動作させるかといった情報をもっていません。例えば、ショット数、ノイズモデルを使うかどうか、回路のトランスパイル周りのオプションなどです。そのため、Qiskit Aquaには `QuantumInstance <https://qiskit.org/documentation/stubs/qiskit.aqua.QuantumInstance.html>`__ があり、バックエンドだけでなく、回路の処理や実行に関する様々な設定を提供しています。
ko_kr: 이제 백엔드 자체에는 회로를 실행하는 방법 등에 대한 정보가 없다. 예를 들어, 얼마나 많은 샷, 노이즈 모델을 원하는가? 회로의 transpiling에 대한 옵션이 필요한가? 키스킷 아쿠아에는 백엔드 뿐만 아니라 회로 처리 및 실행에 대한 다양한 설정을 제공하는 `QuantumInstance <https://qiskit.org/documentation/stubs/qiskit.aqua.QuantumInstance.html>`__ 가 있다.
pt_br: Agora, um backend por conta própria não tem informações sobre como você executaria os circuitos etc. Por exemplo quantos shots, se você quer um modelo de ruído ou até mesmo opções de transpiling nos circuitos. Para este Qiskit Aqua, existe um `QuantumInstance <https://qiskit.org/documentation/stubs/qiskit.aqua.QuantumInstance.html>`__ fornecendo tanto o backend como também várias configurações em torno do processamento do circuito e execução, assim por exemplo:
ta_in: இப்போது ஒரு பின்தளத்தில் நீங்கள் எவ்வாறு சுற்றுகளை இயக்க விரும்புகிறீர்கள் என்பது பற்றிய தகவல்கள் இல்லை. எடுத்துக்காட்டாக, எத்தனை காட்சிகளை, உங்களுக்கு ஒரு சத்தம் மாதிரி வேண்டுமா, சுற்றுகளை மாற்றுவதற்கான விருப்பங்கள் கூட. இதற்காக Qiskit அக்வாவில் `QuantumInstance <https://qiskit.org/documentation/stubs/qiskit.aqua.QuantumInstance.html>` __ உள்ளது, உதாரணமாக:இது பின்தளத்தில் மற்றும் சுற்றுச் செயலாக்கத்தைச் சுற்றியுள்ள பல்வேறு அமைப்புகளையும் செயல்படுத்துகிறது:
vi_vn: Bây giờ, một backend tự bản thân nó không có thông tin về việc bạn muốn các mạch lượng tử được chạy như thế nào. Ví dụ bao nhiêu lần chạy, bạn có muốn một mô hình nhiễu không, thậm chí các lựa chọn cho việc mạch được biên dịch thế nào. Vì thế Qiskit Aqua cung cấp `QuantumInstance <https://qiskit.org/documentation/stubs/qiskit.aqua.QuantumInstance.html>`__ với các backend cũng như nhiều thiết lập khác nhau xung quanh việc xử lý và thực thi của mạch lượng tử, ví dụ:

source: Note: if you provide the backend directly then internally a QuantumInstance will be created from it, with default settings, so at all times the algorithms are working through a QuantumInstance.
bn_bn: টীকা: যদি একটি ব্যাকএন্ড সরাসরি দেওয়া থাকে তাহলে অভ্যন্তরীণভাবে ডিফল্ট সেটিংস সহ একটি QuantumInstance বানিয়ে নেওয়া হয়ে। অতএব অ্যালগরিদম সারাক্ষনই QuantumInstance এর মাধ্যমে কাজ করে থাকে।
es_un: Nota: si proporcionas el backend directamente, un QuantumInstance con configuración predeterminada va a ser creado a partir de este, de esta manera los algoritmos siempre funcionan a través de un QuantumInstance.
fr_fr: Note : si vous fournissez directement le backend, une instance QuantumInstance sera créée à partir de celui-ci, avec les paramètres par défaut, donc en tout temps les algorithmes fonctionnent à travers une QuantumInstance.
id_id: Catatan: jika Anda memberikan backend secara langsung maka secara internal sebuah QuantumInstance akan dibuat darinya, dengan pengaturan standar, sehingga setiap saat algoritma bekerja melalui sebuah QuantumInstance.
ja_jp: 注: バックエンドを直接提供した場合は、デフォルト設定で内部的に QuantumInstance が作成されるので、アルゴリズムは常に QuantumInstance を通して動作します。
ko_kr: 참고: 백엔드를 직접적으로 제공하면 내부적으로 QuantumInstance가 기본 설정으로 생성되므로, 알고리즘은 항상 QuantumInstance를 통해 작동한다.
pt_br: Nota: se você fornecer o backend diretamente então internamente ums QuantumInstance será criado a partir dele, com configurações padrão, para que os algoritmos trabalhem todo o tempo através de uma QuantumInstance.
ta_in: குறிப்பு: நீங்கள் பின்னணியை நேரடியாக தரும் என்றால் நேரடியாக ஒரு குவாண்டம் உதாரணம் உருவாக்கப்படும், முன்னிருப்பு அமைப்புகளுடன், அதனால் அனைத்து நேரத்தில் படிமங்கள் ஒரு குவாண்டம் உதாரணம் வழியாக இயங்குகின்றன.
vi_vn: Lưu ý: nếu sau đó bạn cung cấp backend trực tiếp thì một QuantumInstance sẽ được tạo từ nó, với thiết lập mặc định, vì vậy các thuật toán đang hoạt động thông qua một QuantumInstance mọi lúc.

source: So now we would be able to call the `run() <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html#qiskit.aqua.algorithms.VQE.run>`__ method, which is common to all algorithms and returns a result specific for the algorithm. In this case since VQE is a MinimumEigensolver we could use the `compute_mininum_eigenvalue() <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html#qiskit.aqua.algorithms.VQE.compute_minimum_eigenvalue>`__ method. The latter is the interface of choice for the application modules, such as Chemistry and Optimization, in order that they can work interchangeably with any algorithm within the specific category.
es_un: Ahora podemos llamar al método `run() <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html#qiskit.aqua.algorithms.VQE.run>`__, que es igual en todos los algoritmos y regresa un resultado especifico para el algoritmo. En este caso, como el VQE es un MinimumEigensolver, podemos usar el método `compute_mininum_eigenvalue() <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html#qiskit.aqua.algorithms.VQE.compute_minimum_eigenvalue>`__. Este ultimo es la interfaz que mejor funciona en módulos de aplicaciones como Química y Optimización, de esta manera pueden funcionar con cualquier algoritmo dentro de la categoría especificada.
fr_fr: Nous pouvons à présent appeler la méthode `run()<https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.run.html>`__ , qui est commune à tous les algorithmes et renvoie un résultat spécifique pour l'algorithme. Dans ce cas, puisque VQE est un MinimumEigensolver nous pourrions utiliser la méthode `compute_mininum_eigenvalue() <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.compute_minimum_eigenvalue.html>`__ . C'est l'interface de choix pour les modules d'application tels que Chimie et Optimisation, afin qu'ils puissent fonctionner de manière interchangeable avec n'importe quel algorithme de la même catégorie.
id_id: Jadi sekarang kita akan dapat memanggil metoda `run() <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html#qiskit.aqua.algorithms.VQE.run>`__, yang umum untuk semua algoritma dan mengembalikan hasil spesifik untuk algoritma. Dalam hal ini karena VQE adalah MinimumEigensolver kita bisa menggunakan metoda `compute_mininum_eigenvalue() <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html#qiskit.aqua.algorithms.VQE.compute_minimum_eigenvalue>`__. Yang terakhir ini adalah interface pilihan untuk modul aplikasi, seperti Kimia dan Optimisasi, agar mereka dapat digunakan secara kompatibel dengan setiap algoritma dalam kategori tertentu.
ko_kr: 그래서 이제 모든 알고리즘에 공통적인 `run() <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.run.html>`__ 메서드를 호출하고 알고리즘에 특정한 결과를 반환할 수 있게 되었다. 이 경우, VQE는 MinimumEigensolver 이기 때문에, `compute_mininum_eigenvalue() <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.compute_minimum_eigenvalue.html>`__ 메소드를 사용할 수 있다. 후자는 특정 카테고리 내의 임의의 알고리즘과 상호교환가능하게 동작할 수 있도록, 화학 및 최적화와 같은 애플리케이션 모듈에 대한 선택의 인터페이스이다.
pt_br: Então agora nós poderíamos chamar o método `run() <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html#qiskit.aqua.algorithms.VQE.run>`__, que é comum a todos os algoritmos e retorna um resultado específico para o algoritmo. Neste caso, uma vez que o VQE é um minimumEigensolver nós poderíamos usar o método `compute_mininum_eigenvalue() <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html#qiskit.aqua.algorithms.VQE.compute_minimum_eigenvalue>`__. Este método é a interface escolhida para os módulos de aplicação, como Química e Otimização, para que eles possam funcionar de forma recíproca com qualquer algoritmo dentro da categoria específica.
ta_in: எனவே இப்போது நாம் `run() <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html#qiskit.aqua.algorithms.VQE.run>` __ முறை, இது அனைத்து வழிமுறைகளுக்கும் பொதுவானது மற்றும் வழிமுறைக்கு குறிப்பிட்ட முடிவை வழங்குகிறது. இந்த வழக்கில் VQE ஒரு குறைந்தபட்ச Eigensolver என்பதால் நாம் `compute_mininum_eigenvalue () <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html#qiskit.aqua.algorithms.VQE. __ முறை. பிந்தையது வேதியியல் மற்றும் ஆப்டிமைசர் போன்ற பயன்பாட்டு தொகுதிகளுக்கான தேர்வு இடைமுகமாகும், அவை குறிப்பிட்ட வகைக்குள் உள்ள எந்த வழிமுறையுடனும் மாறி மாறி செயல்பட முடியும்.
vi_vn: Bây giờ chúng ta có thể gọi `run() <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html#qiskit.aqua.algorithms.VQE.run>`__, đây là cách gọi chung cho tất cả thuật toán và sẽ trả về kết quả tương ứng với mỗi thuật toán. Trong trường hợp này, VQE là một MinimumEigensolver nên chúng ta có thể sử dụng `compute_mininum_eigenvalue() <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html#qiskit.aqua.algorithms.VQE.compute_minimum_eigenvalue>`__. Thứ hai là giao diện được lựa chọn cho các module ứng dụng, chẳng hạn như Hóa học và Tối ưu hóa, để chúng có thể hoạt động thay thế cho nhau với bất kỳ thuật toán nào trong danh mục cụ thể.

source: A complete working example
bn_bn: একটি সম্পূর্ণ কার্যকরী উদাহরণ
es_un: Un ejemplo funcional completo
fr_fr: Voici un exemple complet
id_id: Sebuah contoh lengkap konkrit
ja_jp: 完全な実例
ko_kr: 완전한 작업 예제
pt_br: Um exemplo de trabalho completo
ru_ru: Полный рабочий пример
ta_in: ஒரு முழுமையான பணி உதாரணம்
tr: Tam çalışan bir örnek
vi_vn: Một ví dụ hoàn chỉnh
zh_tw: 完整的工作範例

source: Let’s put what we have learned from above together and create a complete working example. VQE will find the minimum eigenvalue, i.e. minimum energy value of a Hamiltonian operator and hence we need such an operator for VQE to work with. Such an operator is given below. This was originally created by the Chemistry application module as the Hamiltonian for an H2 molecule at 0.735A interatomic distance. It’s a sum of Pauli terms as below, but for now I am not going to say anything further about it since the goal is to run the algorithm, but further information on operators can be found in other tutorials.
es_un: Juntemos lo que hemos aprendido anteriormente y creemos un ejemplo funcional completo. VQE encontrará el valor propio mínimo, es decir, el valor mínimo de energía de un operador Hamiltoniano y, por lo tanto, necesitamos dicho operador para que VQE funcione. Dicho operador se da a continuación. Esto fue creado originalmente por el módulo de aplicación de Química como el Hamiltoniano para una molécula de H2 a una distancia interatómica de 0.735A. Es una suma de términos de Pauli como se muestra a continuación, pero por ahora no voy a decir nada más al respecto ya que el objetivo es ejecutar el algoritmo, pero se puede encontrar más información sobre los operadores en otros tutoriales.
fr_fr: Appliquons ce que nous avons appris précédemment et créons un exemple complet. VQE trouvera la valeur propre minimale, par exemple la valeur énergétique minimale d'un opérateur Hamilitonien, nous avons donc besoin d'un tel opérateur pour que VQE fonctionne. Un tel opérateur est fourni plus bas. Il a été créé à l'origine par le module d'application Chimie comme Hamiltonien pour une molécule H2 à une distance interatomique de 0,735A. C'est la somme des termes de Pauli ci-dessous. N'en disons pas plus pour le moment car l'objectif est d'exécuter l'algorithme, mais de plus amples informations sur les opérateurs peuvent être trouvées dans d'autres tutoriels.
ko_kr: 위에서부터 배운 것을 모아서 완벽한 작업 예제를 만들어 보자. VQE는 최소 고유 값 (eigenvalue), 즉, 헤밀턴 연산자의 최소 에너지 값을 찾을 것이며, 따라서 우리는 VQE에 대해 작업하기 위한 연산자가 필요하다. 이러한 오퍼레이터는 아래에 주어진다. 이는 원래의 화학 적용 모듈에 의해 0.735A 원자간 거리에서 H2 분자에 대한 해밀턴으로 생성되었다. 이는 아래와 같은 파울리 용어의 합이나, 지금은 알고리즘을 실행하는 것이 목표이기 때문에 이에 관한 추가적인 내용을 덧붙이지 않을 것이며, 연산자에 대한 추가 정보는 다른 학습서에서 찾을 수 있다.
pt_br: Vamos colocar tudo o que aprendemos acima junto e criar um exemplo completo de trabalho. O VQE irá encontrar o valor minimum eigenvalue, ou seja, valor mínimo de energia de um operador Hamilitoniano e, portanto, precisamos de um operador com o qual o VQE possa trabalhar. Um operador desse tipo é fornecido abaixo. Isso foi originalmente criado pelo módulo de aplicativo de Química como um Hamiltonian para uma molécula de H2 à distância interatômica de 0,735A. É uma soma de termos Pauli abaixo, mas, por enquanto, não vou falar sobre isso, já que o objetivo é executar o algoritmo, porém informações adicionais sobre operadores podem ser encontradas em outros tutoriais.

source: So let’s build a VQE instance passing the operator, and a backend using a QuantumInstance, to the constructor. Now VQE does have setters so the operator and backend can also be passed later. Setting them later can be useful when creating an algorithm without this problem specific information and then later using it, say with the chemistry application module, which would create the operator for the specific chemistry problem being solved.
es_un: Construiremos una instancia del VQE, pasándole el operador y un backend al constructor usando QuantumInstance. También tenemos la opción de pasar el operador y el backend más adelante. Hacer esto puede ser útil al crear un algoritmo sin tener la información especifica de este problema, así más adelante puedes usarlo en conjunto con el modulo de aplicaciones de química para crear un operador para el problema de química que vayas a resolver.
fr_fr: Alors construisons une instance VQE en passant au constructeur l'opérateur et un backend en utilisant une instance de QuantumInstance. Notons que VQE dispose de méthodes de type "setter" pour que l'opérateur et le backend puissent également être passés plus tard, ce qui peut être utile lors de la création d'un algorithme sans ces informations spécifiques, par exemple avec le module d'application de chimie, pour créer l'opérateur correspondant au problème spécifique de chimie en cours de résolution.
id_id: Jadi mari kita buat sebuah instans VQE yang melewati operator, dan sebuah backend menggunakan QuantumInstance, untuk konstruktor. Sekarang VQE memiliki setter sehingga operator dan backend juga dapat diteruskan nanti. Menetapkan mereka kemudian dapat berguna ketika membuat sebuah algoritma tanpa informasi spesifik dari permasalahannya dan kemudian menggunakannya, katakanlah dengan modul aplikasi kimia, yang akan membuat operator untuk masalah kimia spesifik yang dingin dipecahkan.
ko_kr: 따라서 연산자를 전달하는 VQE 인스턴스와 QuantumInstance를 사용하는 백엔드를 생성자에 빌드하자. 이제 VQE에는 연산자 및 백엔드가 나중에 전달될 수 있도록 설정이 맞추어져 있다. 이들을 나중에 설정하면 이 문제에 대한 특정 정보 없이 알고리즘을 작성한 후 추후 이를 사용할 때 요긴하게 쓰인다. 예를 들어 특정 화학 문제를 해결하는 연산자를 작성하는 화학 애플리케이션 모듈 같은 것이 있다. 결국 해야 하는 일은 동일한 셈이다.
pt_br: Então vamos construir uma instância VQE passando o operador e um backend, usando um QuantumInstance, para a construtora. Agora o VQE tem setters para que o operador e backend também possam ser passados mais tarde. Fixá-las posteriormente pode ser útil ao criar um algoritmo sem que este problema tenha informações específicas e depois, posteriormente, utilizá-lo, digamos com o módulo de aplicação de química, o qual criaria o operador para o problema específico de química ser resolvido.
ta_in: ஆகவே, ஆபரேட்டரைக் கடந்து செல்லும் ஒரு VQE நிகழ்வையும், ஒரு குவாண்டம் இன்ஸ்டான்ஸைப் பயன்படுத்தி ஒரு பின்தளத்தில் கட்டமைப்பையும் உருவாக்குவோம். இப்போது VQE க்கு செட்டர்கள் உள்ளன, எனவே ஆபரேட்டர் மற்றும் பின்தளத்தில் பின்னர் அனுப்பலாம். இந்த சிக்கல் குறிப்பிட்ட தகவல் இல்லாமல் ஒரு வழிமுறையை உருவாக்கும் போது அவற்றை பின்னர் அமைப்பது பயனுள்ளதாக இருக்கும், பின்னர் அதைப் பயன்படுத்தும்போது, வேதியியல் பயன்பாட்டு தொகுதிடன் சொல்லுங்கள், இது குறிப்பிட்ட வேதியியல் சிக்கலைத் தீர்க்க ஆபரேட்டரை உருவாக்கும்.
vi_vn: Vì vậy, hãy xây dựng một thực thể VQE đi qua toán tử và một backend bằng cách sử dụng một QuantumInstance, cho phương thức khởi tạo. Bây giờ VQE đã có các bộ đặt để toán tử và backend cũng có thể được thông qua sau đó. Đặt chúng sau có thể hữu ích khi tạo một thuật toán mà không có thông tin cụ thể về vấn đề này và sau đó sử dụng nó, chẳng hạn như với module ứng dụng hóa học, sẽ tạo ra toán tử cho vấn đề hóa học cụ thể đang được giải quyết.
