Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/01_algorithms_introduction.po
Languages: bn_bn, es_un, fr_fr, id_id, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr, vi_vn, zh_tw

source: This page was generated from `tutorials/algorithms/01_algorithms_introduction.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/algorithms/01_algorithms_introduction.ipynb`-থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/algorithms/01_algorithms_introduction.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/algorithms/01_algorithms_introduction.ipynb`__.
id_id: Halaman ini dibuat dari `tutorials/algorithms/01_algorithms_introduction.ipynb`__.
ja_jp: このページは `tutorials/algorithms/01_algorithms_introduction.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/algorithms/01_algorithms_introduction.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada a partir de `tutorials/algorithms/01_algorithms_introduction.ipynb`__.
ru_ru: Страница создана на основе `tutorials/algorithms/01_algorithms_introduction.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/algorithms/08_grover_examples.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
tr: Bu sayfa `tutorials/algorithms/01_algorithms_introduction.ipynb`__ sayfasından oluşturulmuştur.
vi_vn: Trang này được tạo từ `tutorials/algorithms/01_algorithms_introduction.ipynb`__.
zh_tw: 這頁面是由 `tutorials/algorithms/01_algorithms_introduction.ipynb`__ 產生的。

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/01_algorithms_introduction.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/01_algorithms_introduction.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/01_algorithms_introduction.ipynb>`_.
id_id: Jalankan secara interaktif di 'IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/01_algorithms_introduction.ipynb>`_.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/01_algorithms_introduction.ipynb>`_ でインタラクティブに実行します。
ko_kr: `IBM 퀀텀 랩 <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/01_algorithms_introduction.ipynb>`_ 에서 대화식으로 실행하십시오.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/01_algorithms_introduction.ipynb>`_.
ta_in: `IBM Quantum` ஆய்வகத்தில் ஊடாடும் வகையில் இயக்கவும். `<https://quantum-computing.ibm.com/jupyter/tutorial/finance/01_portfolio_optimization.ipynb>`_.
vi_vn: Chạy tương tác trực tiếp trên `IBM Quantum Lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/01_algorithms_introduction.ipynb>` _.

source: An Introduction to Algorithms in Qiskit
bn_bn: Qiskit-এ ধারাক্রমগুলোর (অ্যালগরিদম) ভূমিকা।
es_un: Introducción a algoritmos en Qiskit
fr_fr: Introduction aux algorithmes dans Qiskit
id_id: Perkenalan Algoritma di Qiskit
ja_jp: Qiskit におけるアルゴリズム入門
ko_kr: 키스킷의 알고리즘 소개
pt_br: Uma introdução aos Algoritmos no Qiskit
ru_ru: Введение в алгоритмы в Qiskit
ta_in: Qiskit உள்ள வழிமுறைகள் ஒரு அறிமுகம்
tr: Qiskit'te Algoritmalara Giriş
vi_vn: Mở đầu về thuật toán trong Qiskit
zh_tw: Qiskit 中的演算法簡介

source: This is an introduction to algorithms in Qiskit and provides a high-level overview to help understand the various aspects of the functionality to get started. Other tutorials will provide more in-depth material, on given algorithms, and ways to use them etc.
bn_bn: এই লেখাটি কিস্কিট এর অ্যালগরিদমগুলোর সাথে পরিচয় করিয়ে দেবে, যা বিভিন্ন ক্ষেত্রে এই অ্যালগরিদমের ব্যবহার সম্পর্কে একটা উচ্চপর্যায়ের ধারণা দিয়ে শেখা শুরু করেতে সাহায্য করবে। অন্যান্য টিউটোরিয়ালগুলোতে প্রদত্ত অ্যালগোরিদমসমূহের আরও গভীর বিষয়গুলো এবং তাদের ব্যবহার নিয়ে আরও বিষদ ধারণা দেওয়া হবে।
es_un: Esta es una introducción a algoritmos en Qiskit la cual proporciona un visión general para ayudarte a entender los diversos aspectos de su funcionalidad para poder comenzar. Otros tutoriales proporcionan un material más a profundidad para algunos algoritmos y maneras de usarlos, etc.
fr_fr: Il s'agit d'une introduction aux algorithmes dans Qiskit pour fournir une vue d'ensemble de haut niveau et aider à comprendre les différents aspects fonctionnels pour commencer. D'autres didacticiels fourniront un matériel plus approfondi, sur des algorithmes donnés, et sur les façons de les utiliser, etc.
id_id: Ini adalah perkenalan algoritma - algoritma yang ada di Qiskit dan memberi ringkasan tingkat tinggi untuk membantu memahami berbagai aspek fungsi untuk memulai program. Tutorial lainnya akan memberikan materi mendalam tentang algoritma, cara untuk menggunakannya, dll.
ja_jp: これは Qiskit によるアルゴリズムの入門編となっており、入門にあたって様々な機能の理解に役立つ高水準の概観を提供しています。その他のチュートリアルでは、アルゴリズムやその使用方法などについて、より詳細な資料を提供します。
ko_kr: 이는 Qiskit의 알고리즘에 대한 소개로, 시작할 기능의 다양한 측면을 이해하는 데 도움이 되는 고급 개요를 제공한다. 다른 학습서에서는 보다 상세한 자료, 주어진 알고리즘 및 이들을 사용하는 방법 등을 제공합니다.
pt_br: Esta é uma introdução aos algoritmos no Qiskit e fornece uma visão geral de alto nível para ajudar a entender os vários aspectos da funcionalidade a ser iniciado. Outros tutoriais fornecerão material mais aprofundado, sobre os algoritmos, e formas de usá-los, etc.
ru_ru: Данный раздел является введением в алгоритмы в Qiskit и представляет собой общий обзор, помогающий понять различные аспекты функционирования для начала работы. В других руководствах будет представлен более глубокий материал по конкретным алгоритмам, способам их использования и т.д.
ta_in: இது Qiskit-ல் உள்ள வழிமுறைகளுக்கான அறிமுகம் மற்றும் தொடங்குவதற்கான செயல்பாட்டின் பல்வேறு அம்சங்களைப் புரிந்துகொள்ள உதவும் உயர் மட்ட கண்ணோட்டத்தை வழங்குகிறது. பிற பயிற்சிகள் கொடுக்கப்பட்ட வழிமுறைகள் மற்றும் அவற்றைப் பயன்படுத்துவதற்கான வழிகள் போன்றவற்றில் இன்னும் ஆழமான விஷயங்களை வழங்கும்.
tr: Bu, Qiskit'teki algoritmalara giriş niteliğindedir ve başlarken işlevselliğin çeşitli yönlerini anlamanıza yardımcı olmak için üst düzey bir genel bakış sağlar. Diğer tutoriallar, verilen algoritmalar üzerinde daha derinlemesine materyal ve bunları kullanma yöntemlerini vb. sağlayacaktır.
vi_vn: Phần mở đầu này giới thiệu về các thuật toán trong Qiskit và cung cấp một cái nhìn tổng quan để giúp hiểu rõ các khía cạnh khác nhau của cách vận hành để có thể bắt đầu làm việc. Các hướng dẫn khác sẽ cung cấp nhiều chi tiết sâu hơn, trên những thuật toán nhất định, và cách sử dụng chúng, vv.
zh_tw: 這是 Qiskit 中的演算法簡介，並提供高階概觀，以協助瞭解要開始使用各方面的功能。其他指導教學將提供更深入的資料、既定的演算法，以及使用方法等。

source: How is the algorithm library structured?
bn_bn: অ্যালগরিদম লাইব্রেরিটি কীভাবে সাজানো হয়েছে?
es_un: ¿Cómo está estructurada la librería de algoritmos?
fr_fr: Comment la bibliothèque d'algorithmes est-elle structurée ?
id_id: Bagaimana struktur pustaka algoritma?
ja_jp: アルゴリズム・ライブラリの構成
ko_kr: 알고리즘 라이브러리는 어떻게 구성되어 있습니까?
pt_br: Como a biblioteca de algoritmos está estruturada?
ru_ru: Как устроена библиотека алгоритмов?
ta_in: எப்படி வழிமுறை நூலகம் வடிவமைக்கப்பட்டுள்ளது?
tr: Algoritma kütüphanesi nasıl yapılandırılmıştır?
vi_vn: Thư viện thuật toán được tổ chức thế nào?
zh_tw: 演算法程式庫的結構方式為何？

source: Qiskit provides a number of `Algorithms <https://qiskit.org/documentation/apidoc/qiskit.aqua.algorithms.html>`__ and they are grouped by category according to the task they can perform. For instance ``Minimum Eigensolvers`` to find the smallest eigen value of an operator, for example ground state energy of a chemistry Hamiltonian or a solution to an optimization problem when expressed as an Ising Hamiltonian. There are ``Classifiers`` for machine learning classification problems and ``Amplitude Estimators`` for value estimation that can be used say in financial applications. The full set of categories can be seen in the Algorithms documentation link above.
es_un: Qiskit provee un numero de `Algoritmos <https://qiskit.org/documentation/apidoc/qiskit.aqua.algorithms.html>`__ agrupados por categoría de acuerdo a la tarea que realizan. Por ejemplo: "Minimum Eigensolvers" puede ser utilizado para encontrar el eigenvalor más pequeño de un operador, esto puede ser la energía del estado fundamental de un Hamiltoniano en química, o la solución de un problema de optimización, si es expresado como un Hamiltoniano de Ising. También existen "Classifiers" o "clasificadores" para problemas de clasificación con aprendizaje de máquina y "Amplitude Estimators" o "estimadores de amplitud" para estimar los valores que pueden ser utilizados, por un decir, en aplicaciones en finanzas. El conjunto completo de categorías se puede encontrar en la documentación de algoritmos en el link de arriba.
fr_fr: Qiskit fournit un certain nombre d'`Algorithmes <https://qiskit.org/documentation/apidoc/qiskit.aqua.algorithms.html>`__ regroupés par catégorie en fonction de la tâche qu'ils peuvent accomplir. Par exemple ``Minimum Eigensolvers`` pour trouver la plus petite valeur propre d'un opérateur, par exemple l'énergie de base d'un Hamiltonien en chimie ou une solution à un problème d'optimisation lorsqu'il est exprimé en tant qu'Hamiltonien d'Ising. Il y a des ``Classes`` pour les problèmes de classification d'apprentissage automatique et des ``Estimateurs d'amplitude`` pour l'estimation de la valeur qui peut être utilisée par exemple dans les applications financières. L'ensemble complet des catégories peut être vu dans le lien de documentation des algorithmes ci-dessus.
id_id: Qiskit menyediakan sejumlah `Algorithms <https://qiskit.org/documentation/apidoc/qiskit.aqua.algorithms.html>`__ dan mereka dikelompokkan berdasarkan kategori sesuai dengan tugas yang dapat mereka lakukan. Sebagai contoh ``Minimum Eigensolvers`` untuk menemukan eigenvalue terkecil dari operator, misalnya energi keadaan dasar dari Hamiltonian kimia atau solusi optimisasi ketika ditulis sebagai Hamiltonian Ising. Ada ``Classifier`` untuk klasifikasi pembelajaran mesin dan ``Estimasi Amplitudo`` untuk estimasi nilai yang dapat digunakan dalam aplikasi keuangan. Set lengkap kategori dapat dilihat di link dokumentasi Algorithms di atas.
ja_jp: Qiskit は、多くの `アルゴリズム <https://qiskit.org/documentation/apidoc/qiskit.aqua.algorithms.html>`__ を提供しており、それらは適用可能なタスクに応じてカテゴリーごとにグループ分けされています。例えば、化学的なハミルトニアンの基底エネルギーや、イジングハミルトニアンとして表現された最適化問題の解といった、演算子の最小固有値を求めるための ``Minimum Eigensolvers`` があります。また、機械学習における分類問題のための ``Classifiers`` や、金融アプリケーションなどに用いられる推定のための ``Amplitude Estimators`` があります。カテゴリーの全セットは、上記リンク先のアルゴリズム・ドキュメントで見ることができます。
ko_kr: Qiskit은 다수의 `알고리즘들 <https://qiskit.org/documentation/apidoc/qiskit.aqua.algorithms.html>`__ 을 제공하며, 이들은 수행할 수 있는 작업에 따라 카테고리별로 그룹화되어 있다. 예를 들어, ``Minimum Eigensolvers`` 는 작동/연산자의 가장 작은 고유값, 예를 들어, 화학 해밀턴의 접지 상태 에너지, 또는 Ising Hamiltonian 으로 표현되는 최적화 문제에 대한 해법을 찾는다. 그 중에는 머신러닝의 분류 문제를 해결하기 위한 ``Classifiers`` 와, 금융 애플리케이션에서 활용될 수 있는 ``Amplitude Estimators`` 가 존재한다. 전체 카테고리는 위의 알고리즘 문서 링크에서 확인 가능하다.
pt_br: O Qiskit fornece um número de `Algoritmos <https://qiskit.org/documentation/apidoc/qiskit.aqua.algorithms.html>`__ e eles estão agrupados por categoria de acordo com a tarefa que eles podem executar. Por exemplo, ``Minimum Eigensolvers`` para encontrar o menor valor eigen de um operador, por exemplo, a energia subterrânea da química Hamiltoniana ou uma solução para um problema de otimização quando expressa como Ising Hamiltonian. Existem ``Classifiers`` para problemas de classificação de machine learning e ``Amplitude Estimator`` para estimativa de valor que pode ser usada por exemplo em aplicações financeiras. O conjunto completo de categorias pode ser visto no link acima, com a documentação dos Algoritmos.
ta_in: Qiskit பல 'Algorithms <https://qiskit.org/documentation/apidoc/qiskit.aqua.algorithms.html>` __ ஐ வழங்குகிறது, மேலும் அவை அவர்கள் செய்யக்கூடிய பணிக்கு ஏற்ப வகைப்படுத்தப்படுகின்றன. உதாரணமாக, ஒரு ஆபரேட்டரின் மிகச்சிறிய ஈஜென் மதிப்பைக் கண்டுபிடிக்க ``Minimum Eigensolvers``, எடுத்துக்காட்டாக, வேதியியல் ஹாமில்டோனியனின் நில நிலை ஆற்றல் அல்லது ஐசிங் ஹாமில்டோனியனாக வெளிப்படுத்தப்படும்போது தேர்வுமுறை சிக்கலுக்கான தீர்வு. இயந்திர கற்றல் வகைப்பாடு சிக்கல்களுக்கு ``Classifiers`` மற்றும் நிதி பயன்பாடுகளில் பயன்படுத்தக்கூடிய மதிப்பு மதிப்பீட்டிற்கான ``Amplitude Estimators`` ஆகியவை உள்ளன. மேலே உள்ள அல்காரிதம்ஸ் ஆவணமாக்கல் இணைப்பில் வகைகளின் முழு தொகுப்பையும் காணலாம்.
vi_vn: Qiskit cung cấp một số `Thuật toán <https://qiskit.org/documentation/apidoc/qiskit.aqua.algorithms.html>` __ và chúng được nhóm thành các danh mục dựa theo nhiệm vụ mà chúng có thể thực hiện. Ví dụ, với ``Minimum Eigensolvers`` để tìm trị riêng nhỏ nhất của một toán tử như năng lượng trạng thái thấp nhất của một Hamilton hóa học hoặc đáp số cho bài toán tối ưu hóa được biểu diễn dưới dạng mô hình Ising Hamiltonian. ``Classifiers`` cho các bài toán phân loại học máy và ``Amplitude Estimators`` cho ước lượng giá trị có thể được sử dụng trong các ứng dụng tài chính. Có thể tìm thấy đầy đủ các danh mục trong liên kết tài liệu Thuật toán ở trên.

source: Algorithms are configurable and often part of the configuration will be in the form of smaller building blocks, of which different instances of the building block type can be given. For instance with ``VQE``, the Variational Quantum Eigensolver, it takes a trial wavefunction, in the form of a ``QuantumCircuit`` and a classical optimizer among other things. Such building blocks can be found as `Components <https://qiskit.org/documentation/apidoc/qiskit.aqua.components.html>`__ and as circuits from the `Circuit Library <https://qiskit.org/documentation/apidoc/circuit_library.html>`__.
es_un: Los algoritmos son configurables y a menudo parte de su configuración será en forma de pequeños bloques de construcción, de los cuales se pueden obtener diferentes instancias del tipo de bloque de construcción. Por ejemplo, con el ``VQE`` (Variational Quantum Eigensolver), toma una función de onda de prueba en la forma de un ``QuantumCircuit`` y un optimizador clásico, además de otras cosas. Bloques de construcción como este pueden ser encontrados como `Componentes <https://qiskit.org/documentation/apidoc/qiskit.aqua.components.html>`__ y como circuitos de la `Librería de circuitos <https://qiskit.org/documentation/apidoc/circuit_library.html>`__.
fr_fr: Les algorithmes sont configurables et font souvent partie de la configuration sous la forme de blocs de construction plus petits, dont différentes instances du type de bloc de construction peuvent être données. Par exemple avec le ``VQE``, le Variational Quantum Eigensolver, il prend une fonction d'essai d'onde, sous la forme d'un ``QuantumCircuit`` et d'un optimiseur classique, entre autres. De tels blocs de construction peuvent être trouvés en tant que `Components <https://qiskit.org/documentation/apidoc/qiskit.aqua.components.html>`__ et en tant que circuits de la `Bibliothèque Circuit <https://qiskit.org/documentation/apidoc/circuit_library.html>`__.
id_id: Algoritma yang dapat dikonfigurasi dan sering menjadi bagian dari konfigurasi adalah dalam bentuk blok bangunan yang lebih kecil, dimana contoh yang berbeda dari tipe blok bangunan dapat diberikan. Misalnya dengan ``VQE``, Variational Quantum Eigensolver, dibutuhkan fungsi gelombang uji, dalam bentuk ``QuantumCircuit`` dan pengoptimasi klasik, dan masih banyak lagi. Blok bangunan semacam itu dapat ditemukan sebagai `Components <https://qiskit.org/documentation/apidoc/qiskit.aqua.components.html>`__ dan sebagai sirkuit dari `Circuit Library <https://qiskit.org/documentation/apidoc/circuit_library.html>`__.
ja_jp: アルゴリズムは構成することが可能で、多くの場合、そうした構成の一部は小さな構成要素となっており、構成要素の型ごとに異なったインスタンスを指定することができます。例えば ``VQE`` (Variational Quantum Eigensolver) は、試行波動関数を ``QuantumCircuit`` の形で受け取り、また古典的なオプティマイザーなども受け取ります。このような構成要素は `Components <https://qiskit.org/documentation/apidoc/qiskit.aqua.components.html>`__ から、回路は `Circuit Library <https://qiskit.org/documentation/apidoc/circuit_library.html>`__ から、それぞれ入手することができます。
ko_kr: 알고리즘은 구성 가능하며 구성의 일부는 종종 빌딩블록 유형의 다른 인스턴스를 제공 할 수 있는 더 작은 빌딩블록의 형태로 되어 있다. 예를 들어, Variational Quantum Eigensolver인 ``VQE``는 ``QuantumCircuit`` 형태의 시험 파동(trial wavefunction)과 고전적인 옵티마이저(optimizer)를 인자로 갖는다. 이와 같은 빌딩블록은 `컴포넌트 <https://qiskit.org/documentation/apidoc/qiskit.aqua.components.html>`__ 와 `회로 라이브러리 <https://qiskit.org/documentation/apidoc/circuit_library.html>`__ 의 회로로 찾을 수 있다.
pt_br: Algoritmos são configuráveis e muitas vezes, parte da configuração estará na forma de blocos de construção menores, dos quais, diferentes instâncias do tipo bloco de construção podem ser fornecidas. Por exemplo, com ``VQE``, o Variacional Quantum Eigensolver, precisa de uma função de onda experimental, na forma de um ``QuantumCircuit`` e um otimizador clássico entre outras coisas. Tais blocos de construção podem ser encontrados como `Components <https://qiskit.org/documentation/apidoc/qiskit.aqua.components.html>`__ e como circuitos da `Circuit Library <https://qiskit.org/documentation/apidoc/circuit_library.html>`__.
ta_in: வழிமுறைகள் உள்ளமைக்கக்கூடியவை மற்றும் பெரும்பாலும் உள்ளமைவின் ஒரு பகுதி சிறிய கட்டுமானத் தொகுதிகளின் வடிவத்தில் இருக்கும், அவற்றில் கட்டிடத் தொகுதி வகையின் வெவ்வேறு நிகழ்வுகளை வழங்க முடியும். உதாரணமாக, `` VQE``, மாறுபட்ட குவாண்டம் ஐஜென்சால்வர், இது ஒரு சோதனை அலைவடிவத்தை எடுக்கிறது, இது ``QuantumCircuit`` மற்றும் பிறவற்றில் கிளாசிக்கல் ஆப்டிமைசர் வடிவத்தில். இத்தகைய கட்டுமானத் தொகுதிகளை `Components <https://qiskit.org/documentation/apidoc/qiskit.aqua.components.html>` __ மற்றும் `Circuit Library <https://qiskit.org/documentation/apidoc/circuit_library.html>`__ எனக் காணலாம்.
vi_vn: Các thuật toán có thể cấu hình được và thường các phần của cấu hình được chia thành các cấu thành (building block) bé hơn, từ đó có thể tạo từ các đơn vị của các loại cấu thành khác nhau. Ví dụ với ``VQE``, the Variational Quantum Eigensolver, nó lấy một hàm sóng thử, dưới dạng một mạch lượng tử, và một bộ tối ưu cổ điển và thêm nữa. Những cấu thành như vậy có thể là các components, tìm thấy ở `Components <https://qiskit.org/documentation/apidoc/qiskit.aqua.components.html>`__ và có thể là các mạch lượng tử, tìm thấy ở `Circuit Library <https://qiskit.org/documentation/apidoc/circuit_library.html>`__.

source: Let’s take a look at an example to construct a VQE instance. Here ``TwoLocal`` is the variational form (trial wavefunction), a parameterized circuit which can be varied, and ``SLSQP`` a classical optimizer. These are created as separate instances and passed to VQE when it is constructed. Trying, for example, a different classical optimizer, or variational form is simply a case of creating an instance of the one you want and passing it into VQE.
bn_bn: এবারে কিভাবে একটি ভি. কিউ. ই এর ইনস্ট্যান্স তৈরি করা যেতে পারে তাহা দেখা যাক। নিম্নলিখিত উদাহরণটি তে ``TwoLocal`` হলো একটি পরিবর্তনশীল (ভ্যারিয়েশনাল) মাত্রা, একটি পরামিতিক (প্যারামিটারাইজড) বর্তনী (সার্কিট) যা নিয়ন্ত্রণ করা যেতে পারে এবং ``SLSQP`` একটি ক্লাসিক্যাল অনুকূলায়ক (অপটিমাইজার)। যখন ভি. কিউ. ই তৈরি করা হয় তখন এগুলি আলাদা দৃষ্টান্ত (ইনস্ট্যান্স) বানিয়ে তাটিতে যুক্ত করে দেওয়া হয়। পছন্দ মতন ক্লাসিক্যাল অনুকূলায়ক (অপটিমিয়ের) বা পরিবর্তনশীল (ভ্যারিয়েশনাল) মাত্রা তৈরি করে সেগুলি ভি. কিউ. ই তে প্রয়োজন মত দেওয়া যায় এই ভাবে।
es_un: Veamos un ejemplo para construir una instancia de VQE. Aquí "TwoLocal" es lo que se conoce como la forma variacional (función de onda de prueba), que es un circuito parametrizado que puede ser variado y "SLSQP" es un optimizador clásico. Ambos son creados como distintas instancias y son introducidos al VQE cuando este es construido. Si quieres intentar, por ejemplo, con un distinto optimizador o distinta forma variacional solo es cosa de crear una instancia nueva de lo que quieras hacer e introducirlo al VQE.
fr_fr: Regardons un exemple pour construire une instance VQE. Ici, ``TwoLocal`` est la forme variationnelle (fonction d'essai d'onde), un circuit paramétré qui peut être varié, et ``SLSQP`` un optimiseur classique. Ceux-ci sont créées sous la forme d'instances séparées et passées à VQE quand elles sont construites. Essayer, par exemple, un optimiseur classique différent, ou une forme variationnelle revient simplement à créer l'instance voulue et à la passer au VQE.
id_id: Mari kita lihat contoh konstruksi dari instans VQE. Di sini ``TwoLocal`` adalah bentuk variasional (fungsi gelombang uji), sebuah sirkuit berparameter yang dapat divariasikan, dan ``SLSQP`` sebuah pengoptimisasi klasik. Keduanya dibuat sebagai instans terpisah dan diteruskan ke VQE ketika dikonstruksi. Mencoba, sebagai contoh, pengoptimal klasik berbeda, atau bentuk variasional lainnya adalah semudah menciptakan sebuah instans dari yang Anda inginkan dan diteruskan ke VQE.
ja_jp: VQE インスタンスを構築する例を見てみましょう。ここで ``TwoLocal`` は変分形式 (試行波動関数) 、つまりパラメーター表示されている変分可能な回路であり、 ``SLSQP`` は古典的なオプティマイザーです。これらは別々のインスタンスとして作成され、 VQE の構築時に渡されます。例えば、別の古典的なオプティマイザーや変分形式を試す場合には、単純に所望のインスタンスを作成して、 VQE に渡すだけでよいです。
ko_kr: VQE 인스턴스를 구성하는 예제를 살펴보자. 여기서 ``TwoLocal`` 은 다양한 형태 (시험 파동), 다양할 수 있는 파라미터화된 회로, 그리고 고전적인 최적화 프로그램인 ``SLSQP`` 이다. 이들은 별개의 인스턴스로서 생성되고, 구성될 때 VQE로 전달된다. 예를 들어, 다른 고전적 최적화 프로그램 또는 다양한 양식은 단순히 원하는 것의 인스턴스를 작성하여 VQE에 전달하는 경우이다.
pt_br: Vamos dar uma olhada em um exemplo para construir uma instância de VQE. Aqui ``TwoLocal`` é a forma variacional (versão de ondas de teste), um circuito parametrizado que pode ser variado e ``SLSQP`` um otimizador clássico. Estas são criadas como instâncias separadas e transmitidas para o VQE quando este for construído. Tentando, por exemplo, um otimizador clássico diferente, ou forma variacional é simplesmente um caso de criação de uma instância da que você deseja e a passagem para o VQE.
ru_ru: Рассмотрим подробнее, как создать экземпляр класса VQE. ``TwoLocal`` представляет собой вариационную модель (пробную волновую функцию) в виде квантовой цепи с меняющимися параметрами, а ``SLSQP`` является классическим алгоритмом оптимизации. Они создаются как отдельные экземпляры и передаются в VQE при его построении. Для того чтобы попробовать, например, другой классический оптимизатор или вариационную схему, достаточно создать экземпляр нужного вам метода и передать его в VQE.
ta_in: VQE உதாரணத்தை உருவாக்க ஒரு எடுத்துக்காட்டைப் பார்ப்போம். இங்கே ``TwoLocal`` என்பது மாறுபட்ட வடிவம் (சோதனை அலை செயல்பாடு), அளவுருவாக்கப்பட்ட சுற்று, இது மாறுபடும், மற்றும் `` SLSQP`` ஒரு கிளாசிக்கல் ஆப்டிமைசர். இவை தனித்தனி நிகழ்வுகளாக உருவாக்கப்பட்டு, அது கட்டப்படும்போது VQE க்கு அனுப்பப்படும். எடுத்துக்காட்டாக, வேறுபட்ட கிளாசிக்கல் ஆப்டிமைசர் அல்லது மாறுபட்ட வடிவத்தை முயற்சிப்பது என்பது நீங்கள் விரும்பும் ஒரு நிகழ்வை உருவாக்கி அதை VQE க்கு அனுப்பும் ஒரு சந்தர்ப்பமாகும்.
tr: Bir VQE örneği oluşturmak için bir örneğe göz atalım. Burada ``TwoLocal`` değişimsel formdur (deneme dalga fonksiyonu), değiştirilebilen parametreli bir devre ve ``SLSQP`` klasik bir eniyileştiricidir. Bunlar ayrı örnekler olarak oluşturulur ve yapılandırıldığında VQE'ye aktarılır. Örneğin, farklı bir klasik eniyileştiriciyi veya değişimsel formu denemek, basitçe istediğiniz bir örneğini oluşturup bunu VQE'ye aktarmanın bir örneğidir.
vi_vn: Hãy xem một ví dụ để xây dựng một VQE. Ở đây ``TwoLocal`` là dạng biến đổi (hàm sóng thử nghiệm), một mạch tham số có thể thay đổi, và ``SLSQP`` một bộ tối ưu cổ điển. Chúng được tạo như là các đơn vị riêng biệt và đưa cho VQE khi nó được xây dựng. Thử, ví dụ, một bộ tối ưu hóa cổ điển khác, hoặc dạng biến đổi (variational form) chỉ đơn giản là một một thực thể của mạch mà bạn muốn và đưa nó vào VQE.
zh_tw: 讓我們來看看一個範例來建構 VQE 實例。這裡 ``TwoLocal`` 是變數形式(試驗波函數)，可改變的參數化電路，以及 ``SLSQP`` 古典優化器。這些會建立為個別實例，並在建構時傳遞至 VQE。例如，嘗試不同的古典優化器，或變異形式，只是建立一個您想要的實例，並將其傳遞至 VQE 的案例。
