Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/01_algorithms_introduction.po
Languages: bn_bn, es_un, fr_fr, id_id, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr, vi_vn, zh_tw

source: To close off let’s also change the estimator primitive inside the a VQE. Maybe you’re satisfied with the simulation results and now want to use a shot-based simulator, or run on hardware!
tr: Konuyu sonlandırmadan önce, bir VQE içindeki tahminci temel öğesini de değiştirelim. Belki de simülasyon sonuçlarından memnunsunuz ve şimdi deneme tabanlı bir simülatör kullanmak veya donanım üzerinde çalışmak istiyorsunuz!

source: In this example we’re changing to a shot-based estimator, still using Qiskit Terra’s reference primitive. However you could replace the primitive by e.g. Qiskit Aer’s estimator (``qiskit_aer.primitives.Estimator``) or even a real backend (``qiskit_ibm_runtime.Estimator``).
tr: Bu örnekte, hala Qiskit Terra'nın referans temel öğesini kullanan, deneme tabanlı bir tahminciye geçiyoruz. Bununla birlikte, temel öğeyi ör. Qiskit Aer'in tahmincisi (``qiskit_aer.primitives.Estimator``) ile veya hatta gerçek bir arka uç (``qiskit_ibm_runtime.Estimator``) ile değiştirebilirsiniz.

source: For noisy loss functions, the SPSA optimizer typically performs well, so we also update the optimizer. See also the `noisy VQE tutorial <https://qiskit.org/documentation/tutorials/algorithms/03_vqe_simulation_with_noise.html>`__ for more details on shot-based and noisy simulations.
tr: Gürültülü kayıp fonksiyonları için, SPSA optimize edicisi genellikle iyi performans gösterir, bu nedenle optimize ediciyi de güncelleriz. Deneme tabanlı ve gürültülü simülasyonlar hakkında daha fazla ayrıntı için ayrıca `gürültülü VQE eğitimine <https://qiskit.org/documentation/tutorials/algorithms/03_vqe_simulation_with_noise.html>` bakın.

source: Note: We do not fix the random seed in the simulators here, so re-running gives slightly varying results.
tr: Not: Burada simülatörlerdeki rastgele başlangıç değerini düzeltmiyoruz, bu nedenle yeniden çalıştırma biraz farklı sonuçlar veriyor.

source: Qiskit provides a number of `Algorithms <https://qiskit.org/documentation/apidoc/algorithms.html>`__ and they are grouped by category according to the task they can perform. For instance ``Minimum Eigensolvers`` to find the smallest eigen value of an operator, for example ground state energy of a chemistry Hamiltonian or a solution to an optimization problem when expressed as an Ising Hamiltonian. There are ``Linear Solvers`` for linear systems of equations problems and ``Amplitude Estimators`` for value estimation that can be used say in financial applications. The full set of categories can be seen in the Algorithms documentation link above.
bn_bn: Qiskit বেশ কয়েকটি `অ্যালগরিদম <https://qiskit.org/docamentation/apidoc/algorithms.html>` সরবরাহ করে এবং তাদের কাজ অনুসারে তাদেরকে শ্রেণিবদ্ধ করা হয়েছে। উদাহরণস্বরূপ ``Minimum Eignesolvers``- যা কোনও অপারেটরের ক্ষুদ্রতম স্বকীয়মান খোঁজার জন্য, যেমন একটি রসায়ন হ্যামিল্টোনিয়ানের গ্রাউন্ড স্টেট শক্তি বের করতে অথবা আইসিং হ্যামিল্টনিয়ান হিসেবে প্রকাশিত অপ্টিমাইজেশনের সমস্যার সমাধান বের করতে, ব্যবহার করা যায়। মেশিন লার্নিং ক্লাসিফিকেশন সমস্যার জন্য `Classifiers` রয়েছে এবং ব্যবস্থাপনাবিদ্যার অ্যাপ্লিকেশনগুলিতে ব্যবহৃত মান অনুমানের জন্য রয়েছে ``Amplitude Estimators``। সম্পূর্ণ বিভাগগুলির জন্য উপরের অ্যালগরিদম ডকুমেন্টেশন লিঙ্কে দেখা যেতে পারে।
ru_ru: Qiskit содержит ряд `алгоритмов <https://qiskit.org/documentation/apidoc/algorithms.html>`__, классифицируемых по типам выполняемых задач. Например ``Minimum Eigensolvers`` ищет наименьшее собственное значение оператора, поэтому может вычислить энергию основного состояния молекулы и справиться с проблемой оптимизации, заданной в модели Изинга. Также упомянем ``Linear Solvers``, который способен решать системы линейных уравнений, и перспективный в финансовой сфере для оценки стоимости ``Amplitude Estimators``. Полную классификацию можно найти по указанной выше ссылке.
zh_tw: Qiskit 提供了許多 `Algorithms<https://qiskit.org/documentation/apidoc/algorithms.html>`__ ，它們依種類分組，根據它們可以執行的作業來分類。例如，``Minimum Eigensolvers`` 可以找出一個算子的最小特徵值，例如，化學Hamiltonian的基態能量或對最佳化問題的解當問題可以用 Ising Hamiltonian 表示時。另外有 ``Linear Solvers`` 可以解線性系統的方程問題，以``Amplitude Estimators`` 可以用在像是金融相關應用的數值估計。您可以在上面的演算法文件鏈結中看到完整的種類集。

source: In order to run an algorithm we need to have backend, a simulator or real device, on which the circuits that comprise the algorithm can be run. So for example we can use the ``aer_simulator_statevector`` from the Aer provider.
bn_bn: একটি ধারাক্রম​ (অ্যালগোরিদম) চালানোর জন্য​ একটি ব্যাকএন্ড, একটি সিমুলেটর, অথবা আসল যন্ত্রটির​ থাকা প্রয়োজন, যেটায় ধারাক্রমের​ বর্তনীগুলো (সার্কিটস​) চালানো যাবে। উদাহরণ হিসেবে আমরা এয়ার এর ``aer_simluator_statevector`` ব্যবহার করতে পারি।
ru_ru: Для этого нам нужен подходящий данному примеру backend (программно-аппаратная часть сервиса), которым может быть как симулятор, так и реальное устройство. Здесь, к примеру, используется ``aer_simulator_statevector``из Aer.
zh_tw: 為了執行一個演算法，我們需要有後台、模擬器或真實元件，這些平台上構成演算法的電路可以被執行。因此，例如，我們可以使用從 Aer 提供者所提供的``aer_simulator_statevector``。

source: Now a backend on its own does not have information on how you might want to run the circuits etc. For example how many shots, do you want a noise model, even options around transpiling the circuits. For this Qiskit Terra has a `QuantumInstance <https://qiskit.org/documentation/stubs/qiskit.utils.QuantumInstance.html>`__ which is provided both the backend as well as various settings around the circuit processing and execution so for instance:
bn_bn: বর্তনী (সার্কিট) চালানোর দরকারি তথ্য যেমন শটসমূহ, দূষণ বা ত্রুটি নকশা (নয়েজ মডেল), বর্তনী (সার্কিট) ট্রান্সপাইল করবার বিকল্পগুলি একটি ব্যাকএন্ডে নাও থাকতে পারে। সেজন্যই `QuantumInstance <https://qiskit.org/documentation/stubs/qiskit.aqua.QuantumInstance.html>`__ Qiskit Terra তে রয়েছে। এর দ্বারা বর্তনী (সার্কিট)-এর ব্যাকএন্ড অথবা নানান আরো প্রয়োজনীয় তথ্য নির্দিষ্টকরণ করা যায়। উদাহণস্বরূপ:

source: So now we would be able to call the `compute_mininum_eigenvalue() <https://qiskit.org/documentation/stubs/qiskit.algorithms.VQE.html#qiskit.algorithms.VQE.compute_minimum_eigenvalue>`__ method. The latter is the interface of choice for the application modules, such as Nature and Optimization, in order that they can work interchangeably with any algorithm within the specific category.
bn_bn: অতএব, আমরা এখন `compute_mininum_eigenvalue() <https://qiskit.org/documentation/stubs/qiskit.algorithms.VQE.html#qiskit.algorithms.VQE.compute_minimum_eigenvalue>`__ মেথডকে কল করতে পারব। পরবর্তি ধাপ হল Nature এবং Optimization এর মত এপ্লিকেশন মডিউলগুলোকে পছন্দ করার ধাপ, যেখানে মডিউলগুলো একটি নির্দিষ্ট শাখায় নিজেরদের মধ্যে রদবদল হতে পারে।
ru_ru: Теперь нам доступен метод `compute_mininum_eigenvalue() <https://qiskit.org/documentation/stubs/qiskit.algorithms.VQE.html#qiskit.algorithms.VQE.compute_minimum_eigenvalue>` __. Он является интерфейсом для вызова таких модулей как Nature или Optimization и обеспечивает совместимость их работы с алгоритмами данного типа.
zh_tw: 因此，現在我們可以呼叫 `compute_mininum_eigenvalue() <https://qiskit.org/documentation/stubs/qiskit.algorithms.VQE.html#qiskit.algorithms.VQE.compute_minimum_eigenvalue>`__ 方法。後者是應用程式模組(例如 Nature 和 Optimization)的選擇界面，以讓它們可以與特定種類內的任何演算法互換地工作。

source: So let’s build a VQE instance passing a backend using a QuantumInstance, to the constructor. Now VQE does have setters so the QuantumInstance can also be passed later.
bn_bn: তাহলে চলুন এবার কন্সট্রাক্টরের সাথে QuantumInstance ব্যবহার করে ব্যাকএন্ড দিয়ে একটি ভি কিউ ই ( VQE) অবস্থা গঠন করে নেয়া যাক। এখন ভি কিউ ই (VQE) এর সেটার(setter) থেকে গেল যেন পরে QuantumInstance সেটাকে পাস করতে পারে।

source: Note: In order that you can run this notebook and see the exact same output the random number generator used throughout algorithms in algorithms_globals, as well as the transpiler and simulator, via the QuantumInstance, are seeded. You do not have to do this but if want to be able to reproduce the exact same outcome each time then this is how it’s done.
bn_bn: বি:দ্র: যাতে আপনি এই নোটবুকটি চলাতে পারেন এবং একদম আগের মতই আউটপুট দেখতে পারেন, তার জন্য র‍্যান্ডম নাম্বার জেনারেটর, যেটা সারা অ্যালগরিদমের algorithms_globals, transpiler এবং simulator এর মধ্যে QuantumInstance এর মাধ্যমে হয়ে থাকে, তা স্থাপন করে দেয়া হয়েছে।

source: From the above result we can see it took the optimizer ``65`` evaluations of parameter values until it found the minimum eigenvalue of ``-1.85727`` which is the electronic ground state energy of the given H2 molecule. The optimal parameters of the ansatz can also be seen which are the values that were in the ansatz at the minimum value.
bn_bn: উপরিউক্ত ফলাফলে আমরা লক্ষ্য করেতে পারি যে, হাইড্রোজেন অণুর সর্বনিম্ন কক্ষপথের ইলেকট্রনের শক্তি ``-1.85727`` এর নূন্যতম আইগেন মান খুজে না পাওয়া পর্যন্ত এই অপটিমাইজারটি ``65`` বার চালনা হয়েছে। সর্বনিম্ন মানের চলকগুলোর যেই যেই মান Ansatz এর নুন্যতম ফলাফলে ছিল সেগুলো Ansatz এর গৌণ চলকগুলো দেখা যায়।
ru_ru: Судя по результату, оптимизатор менял значение параметров ``65`` раз до достижения минимального собственного значения ``-1,85727``, которое и соответствует энергии основного электронного уровня молекулы водорода. Здесь также приведены оптимальные параметры анзаца, при которых он дает искомое число.
zh_tw: 從上述結果中，我們可以看到，優化器對參數值評估了65次才找到最小特徵值`` -1.85727``，此最小特徵值也就是該給定 H2 分子的電子基態能量。我們也可以看到該擬設的最佳化參數，即在擬設中的最小的值。

source: Using VQE setting QuantumInstance after Construction
bn_bn: নির্মাণমূলক কাজ শেষে ভি কিউ ই (VQE) দিয়ে QuantumInstance এর ব্যবহার

source: To close off let’s also create a VQE instance without supplying the QuantumInstance. We later set it as long as by the time VQE runs it has a QuantumInstance to use.
bn_bn: পরিশেষে, QuantumInstance কে সরাসরি না ব্যবহার করে একটা ভি কিউ ই (VQE) দৃষ্টান্ত (ইনস্ট্যান্স) তৈরি করে নেয়া যাক। যতক্ষন ভি কিউ ই (VQE) চলতে থাকে এতে ব্যবহারের জন্য একটা QuantumInstance থাকে ঠিক ততক্ষন আমরা পরে একে বসিয়ে দেই।

source: So now we would be able to call the `run() <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.run.html>`__ method, which is common to all algorithms and returns a result specific for the algorithm. In this case since VQE is a MinimumEigensolver we could use the `compute_mininum_eigenvalue() <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.compute_minimum_eigenvalue.html>`__ method. The latter is the interface of choice for the application modules, such as Chemistry and Optimization, in order that they can work interchangeably with any algorithm within the specific category.
ja_jp: この時点で、 `run() <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.run.html>`__ メソッドを呼び出すことができるようになりました。これは全てのアルゴリズムに共通のもので、アルゴリズムごとに特有の結果を返り値とします。今回の場合は、 VQE が MinimumEigensolver であるので、 `compute_mininum_eigenvalue() <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.compute_minimum_eigenvalue.html>`__ メソッドを使うことができます。後者は、 Chemistry や Optimization といったアプリケーション・モジュールのための選択肢となっているインターフェースであり、特定のカテゴリー内のどのアルゴリズムとも互換性をもって動作するようにすることができます。

source: So let’s build a VQE instance passing the operator, and a backend using a QuantumInstance, to the constructor. Now VQE does have setters so the operator and backend can also be passed later. Setting them later can be useful when creating an algorithm without this problem specific information and then later using it, say with the chemistry application module, which would create the operator for the specific chemistry problem being solved. which it has to do the same thing.
ja_jp: では、コンストラクターに演算子と QuantumInstance によるバックエンドを渡して、 VQE インスタンスを作成してみましょう。ここで VQE にはセッターがあるので、演算子とバックエンドは後から渡すこともできます。これらを後から設定することは、問題特有の情報をもたないアルゴリズムを作成して、後からそれを利用するという場合に便利です。例えば、 Chemistry アプリケーション・モジュールを用いて、解くべき特定の化学の問題のための演算子を用意し、それを後から設定することができます。

source: Now a backend on its own does not have information on how you might want to run the circuits etc. For example how many shots, do you want a noise model, even options around transpiling the circuits. For this Qiskit Terra has a ```QuantumInstance`` <https://qiskit.org/documentation/stubs/qiskit.utils.QuantumInstance.html>`__ which is provided both the backend as well as various settings around the circuit processing and execution so for instance:
ru_ru: Сам по себе он не содержит информацию об особенностях обработки вашей цепи (количество повторов, наличие шума, особенности транспиляции и т.д.). С этим может помочь `QuantumInstance <https://qiskit.org/documentation/stubs/qiskit.utils.QuantumInstance.html>` __ из Terra, обеспечивающий помимо выбора бэкенда еще и настройку запуска:

source: Note: if you provide the backend directly then internally a ``QuantumInstance`` will be created from it, with default settings, so at all times the algorithms are working through a ``QuantumInstance``.
ru_ru: Примечание: При непосредственном выборе бэкенда также создается ``QuantumInstance`` с настройками по умолчанию, поэтому по сути алгоритмы всегда используют именно его.

source: So let’s build a VQE instance passing a backend using a ``QuantumInstance``, to the constructor. Now VQE does have setters so the ``QuantumInstance`` can also be passed later.
ru_ru: Рассмотрим пример работы VQE, в котором бэкенд задается ``QuantumInstance`` уже на начальном этапе. Однако эта процедура может быть быть выполнена и позднее, такой вариант мы тоже разберем.

source: Note: In order that you can run this notebook and see the exact same output the random number generator used throughout algorithms in ``algorithms_globals``, as well as the transpiler and simulator, via the ``QuantumInstance``, are seeded. You do not have to do this but if want to be able to reproduce the exact same outcome each time then this is how it’s done.
ru_ru: Примечание: В работе алгоритма важную роль играет генератор случайных чисел и здесь использована возможность его инициализации через ``QuantumInstance``. Поэтому при каждом запуске вы будете получать один и тот же результат. Это не обязательная процедура, но иногда она бывает полезной, поэтому разберем ее в нашем примере.

source: Using VQE setting ``QuantumInstance`` after Construction
ru_ru: Отложенное использование ``QuantumInstance`` при работе с VQE

source: To close off let’s also create a VQE instance without supplying the ``QuantumInstance``. We later set it as long as by the time VQE runs it has a ``QuantumInstance`` to use.
ru_ru: В заключение рассмотрим порядок создания объекта VQE без непосредственного применения ``QuantumInstance``. Здесь мы выполним его позднее.
