Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/01_algorithms_introduction.po
Languages: bn_bn, es_un, fr_fr, id_id, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr, vi_vn, zh_tw

source: Note: In order that you can run this notebook and see the exact same output the random number generator used throughout Aqua in aqua_globals, as well as the transpiler and simulator, via the QuantumInstance, are seeded. You do not have to do this but if want to be able to reproduce the exact same outcome each time then this is how it’s done.
es_un: Nota: para ejecutar este cuaderno y ver exactamente el mismo resultado devuelto por el generador de números aleatorios utilizado en Aqua en aqua_globals, así como el resultado del transpilador y el simulador, a través del QuantumInstance, seria necesario utilizar el mismo "seed". No es necesario hacer esto pero si quieres reproducir exactamente los mismos resultados cada vez, así es como se hace.
fr_fr: Note: Afin que vous puissiez exécuter ce bloc-notes et voir la même sortie, le générateur de nombres aléatoires utilisé dans Aqua dans aqua_globals, ainsi que le transpileur et le simulateur, au travers de QuantumInstance, sont ensemencés. Il n'est pas indispensable de le faire, sauf si vous voulez pouvoir reproduire exactement le même résultat à chaque fois.
id_id: Catatan: Agar Anda dapat menjalankan notebook ini dan melihat output yang sama, generator bilangan acak yang digunakan di seluruh Aqua dalam aqua_globals, serta transpiler dan simulator, melalui QuantumInstance, di set dengan seed. Anda tidak perlu melakukan ini tetapi jika ingin mendapat hasil yang sama setiap kali maka ini adalah caranya.
ja_jp: 注: このノートブックを実行して全く同じ出力が得られるようにするため、 Aqua 全体で用いられている乱数生成器は aqua_globalsで、トランスパイラーとシミュレーターは QuantimInstance を通して、それぞれシード値が固定されています。このようにする必要は必ずしもありませんが、毎回全く同じ結果を再現したい場合にはこのようにします。
ko_kr: 참고: 이 노트북을 실행하고 aqua_globals의 Aqua에서 사용되는 난수 생성기와 정확히 동일한 출력을 확인하려면 QuantumInstance를 통해 전송자 및 시뮬레이터를 시딩한다. 이 작업은 선택사항이며, 매번 정확히 동일한 결과를 재생할 수 있기를 원할 경우에 이 작업을 수행하면 된다.
pt_br: Nota: Para que você possa executar este notebook e ver o resultado exato, o gerador de números aleatórios usado em toda a Aqua em aqua_globals, assim como o transpiler e o simulador, através da QuantumInstance precisa ser usado. Você não precisa fazer isso, mas se quiser ser capaz de reproduzir exatamente o mesmo resultado toda vez, então é assim que se faz.
ta_in: குறிப்பு: நீங்கள் இந்த நோட்புக்கை இயக்கவும், அக்வா_குளோபால்களில் அக்வா முழுவதும் பயன்படுத்தப்படும் சீரற்ற எண் ஜெனரேட்டரைப் பார்க்கவும், அதே போல் குவாண்டம் இன்ஸ்டான்ஸ் வழியாக டிரான்ஸ்பைலர் மற்றும் சிமுலேட்டரை விதைக்கவும் முடியும். நீங்கள் இதைச் செய்ய வேண்டியதில்லை, ஆனால் ஒவ்வொரு முறையும் அதே விளைவை மீண்டும் உருவாக்க முடியும் என்றால், இது இப்படித்தான் செய்யப்படுகிறது.
vi_vn: Lưu ý: Để bạn có thể chạy notebook này và xem chính xác output mà bộ random number generator sử dụng trong toàn bộ Aqua trong aqua_globals, cũng như trình vận chuyển và trình mô phỏng, thông qua QuantumInstance, được gieo hạt. Bạn không cần phải làm điều này nhưng nếu bạn muốn có thể tái tạo lại kết quả chính xác mỗi lần, đây là cách nó được thực hiện.

source: So let’s run VQE and print the result object it returns.
bn_bn: চলুন, এখন ভি কিউ ই (VQE) চালানো যাক এবং এটার ফলাফল অবজেক্টটি (যা এটি আউটপুট দেয়) প্রিন্ট করে দেখানো যাক।
es_un: Ahora corramos el VQE e imprimamos el objeto que devuelve como resultado.
fr_fr: Lançons donc VQE et affichons l'objet résultat qu'il retourne.
id_id: Jadi mari kita jalankan VQE dan print hasil objek yang dihasilkan.
ja_jp: それでは VQE を実行して、その返り値を表示してみましょう。
ko_kr: 따라서 VQE를 실행하고 반환한 결과 오브젝트를 출력한다.
pt_br: Então, vamos executar o VQE e imprimir o resultado que ele retorna.
ru_ru: Давайте запустим VQE и посмотрим на возвращаемый в результате объект.
ta_in: எனவே VQE ஐ இயக்கலாம் மற்றும் அதன் விளைவு பொருளை அச்சிடுக.
tr: Öyleyse VQE'yi çalıştıralım ve döndürdüğü sonuç nesnesini yazdıralım.
vi_vn: Do đó, hãy cùng chạy VQE và xuất đối tượng kết quả trả về.
zh_tw: 因此，讓我們執行 VQE，並列印其傳回的結果物件。

source: From the above result we can see it took the optimizer ``72`` evaluations of parameter values until it found the minimum eigenvalue of ``-1.85727`` which is the electronic ground state energy of the given H2 molecule. The optimal parameters of the ansatz can also be seen which are the values that were in the ansatz at the minimum value.
es_un: Del resultado anterior podemos observar que le tomó al optimizador ``72`` evaluaciones de los valores de los parámetros hasta que encontró el eigenvalor mínimo de ``-1.85727``, que es la energía de los electrones en el estado base de la molécula dada de H2. Los parámetros óptimos del ansatz también se pueden ver, estos son los valores en el ansatz al llegar al valor mínimo.
fr_fr: À partir du résultat ci-dessus, nous pouvons voir qu'il a pris les évaluations de l'optimiseur ``72`` des valeurs des paramètres jusqu'à ce qu'il trouve la valeur propre minimale de ``-1.85727`` qui est l'énergie de l'état fondamental électronique de la molécule H2 donnée. Les paramètres optimaux de l'ansatz peuvent également être vus et sont les valeurs qui étaient dans l'ansatz à la valeur minimale.
id_id: Dari hasil di atas kita bisa melihat pengoptimisasi memerlukan ``72`` evaluasi dari nilai parameter sampai menemukan nilai eigen minimum ``-1.85727`` yang merupakan energi keadaan dasar elektronik dari molekul H2 yang diberikan. Parameter optimal dari ansatz juga dapat dilihat yang merupakan nilai yang ada di dalam ansatz pada nilai eigen minimum.
ja_jp: 上記の結果から、与えられた H2 分子の電子の基底エネルギーである ``-1.85727`` という最小固有値を得るまで、オプティマイザーが ``72`` 回のパラメーター評価を要したことがわかります。また、 ansatz の最適パラメーターは、 ansatz が最小値であったときの値を見ればわかります。
ko_kr: 위의 결과에서 주어진 H2 분자의 전자 접지 상태 에너지(electronic ground state energy) 인 ``-1.85727``의 최소 고유값을 찾을 때까지, 옵티마이저가 매개 변수 값을 ``72`` 평가한 것을 확인할 수 있다. 또한, Ansatz의 최적 매개 변수는 ansatz의 매개 변수들 중 최소값을 갖는 매개변수 임을 확인할 수 있다.
pt_br: Do resultado acima nós podemos ver que o otimizador ``72`` foi levado pelas avaliações dos valores dos parâmetros até que ele encontre o valor minimum eigenvalue of ``-1.85727`` que é a energia eletrônica do estado fundamental da molécula H2 indicada. Os parâmetros ideais do ansatz também podem ser vistos, que são os valores que estavam nos ansatz com valor mínimo.
ta_in: ஆப்டிமைசர் மேலே கொடுக்கப்பட்ட முடிவிலிருந்து, அளவுரு மதிப்புகளின் உகப்பாக்கி `` 72`` மதிப்பீடுகளை எடுத்ததைக் காணலாம், இது `` -1.85727`` இன் குறைந்தபட்ச eigenvalue க் கண்டுபிடிக்கும் வரை, இது கொடுக்கப்பட்ட H2 மூலக்கூறின் மின்னணு நில நிலை ஆற்றலாகும். ansatz ன் உகந்த அளவுருக்கள் ansatz ல் குறைந்தபட்ச மதிப்பில் இருந்த மதிப்புகள் என்பதையும் காணலாம்.
vi_vn: Từ kết quả trên, chúng ta có thể thấy trình tối ưu hóa ``72`` đánh giá các giá trị tham số cho đến khi nó tìm thấy giá trị riêng tối thiểu là ``-1.85727``', là năng lượng trạng thái cơ bản điện tử của phân tử H2 đã cho. Các tham số tối ưu của ansatz cũng có thể được xem là các giá trị nằm trong ansatz ở giá trị nhỏ nhất.

source: Using VQE as a MinimumEigensolver
es_un: Usando el VQE como un MinimumEigensolver
fr_fr: Utiliser VQE comme MinimumEigensolver
id_id: Menggunakan VQE sebagai MinimumEigensolver
ja_jp: MinimumEigensolver としての VQE
ko_kr: VQE를 MinimumEigensolver로 사용하기
pt_br: Usando VQE como um MinimumEigensolver
ta_in: VQE ஐ குறைந்தபட்ச ஈஜென்சால்வராகப் பயன்படுத்துதல்
vi_vn: Sử dụng VQE như một MinimumEigensolver

source: To close off let’s use the MinimumEigensolver interface and also create a VQE instance without supplying either the operator or QuantumInstance. We later set the QuantumInstance and finally pass the operator on the ``compute_minimum_eigenvalue`` method (though we could have passed it in earlier via the setter instead, as long as by the time VQE runs it has an operator to work on).
es_un: Para cerrar, usaremos la interface de MinimumEigensolver y crearemos una instancia de VQE pero no le daremos ni el operador ni el QuantumInstance. Más adelante añadiremos QuantumInstance y finalmente introduciremos el operador con el método ``compute_minimum_eigenvalue`` (aunque también podríamos haberlo pasado antes atreves del setter, siempre y cuando a la hora que vaya a correrse el VQE este tenga un operador sobre el cual trabajar).
fr_fr: Pour conclure nous utilisons l'interface MinimumEigensolver et créons également une instance VQE sans fournir ni l'opérateur ni QuantumInstance. Plus tard nous avons défini QuantumInstance et finalement passé l'opérateur sur la méthode ``compute_minimum_eigenvalue`` (bien que nous aurions pu le passer plus tôt via le setter à la place, à condition que le VQE fonctionne et qu'il y ait un opérateur).
id_id: Untuk penutup, mari kita gunakan interface MinimumEigensolver dan juga membuat instans VQE tanpa memasok baik operator atau QuantumInstance. Kita kemudian menetapkan QuantumInstance dan akhirnya menyalurkan operator ke metoda ``compute_minimum_eigenvalue`` (meskipun kita bisa juga menyalurkannnya lebih awal melalui setter, selama pada saat VQE berjalan ada operator untuk dijalankan).
ja_jp: 最後に、 MinimumEigensolver インターフェースを用いて、演算子も QuantumInstance も与えずに VQE インスタンスを作成してみましょう。後から QusntumInstance を設定し、最後に演算子を ``compute_minimum_eigenvalue`` メソッドに渡します。 (ただし、 VQE が実行されるまでに演算子がありさえすれば、より早い段階でセッターによって渡しておいても構いません。)
ko_kr: 이를 닫기 위해서, 최소치 (MinimumEigensolver) 인터페이스를 사용하고, 오퍼레이터 또는 QuantumInstance를 제공하지 않고 VQE 인스턴스를 생성한다. 나중에 퀀텀 인스턴스를 설정하고 마지막으로 ``compute_minimum_eigenvalue`` 메소드에서 연산자를 전달한다 (이 메소드는 VQE가 실행하는 시간에 의해 작동하는 연산자를 갖는다).
pt_br: Para finalizar vamos usar a interface MinimumEigensolver e também criar uma instância de VQE sem fornecer o operador ou o QuantumInstance. Posteriormente, definimos a instância QuantumInstance e finalmente passamos o operador no método ``compute_minimum_eigenvalue`` (embora ao invés disso, pudéssemos tê-lo passado mais cedo através do setter, desde que no momento de executar o VQE, ele tenha um operador para trabalhar).
ta_in: மூடுவதற்கு MinimumEigensolver இடைமுகத்தைப் பயன்படுத்துவோம், மேலும் ஆபரேட்டர் அல்லது குவாண்டம் இன்ஸ்டான்ஸை வழங்காமல் ஒரு VQE நிகழ்வையும் உருவாக்கலாம். நாங்கள் பின்னர் குவாண்டம் இன்ஸ்டான்ஸை அமைத்து, இறுதியாக ஆபரேட்டரை ``compute_minimum_eigenvalue`` முறைக்கு அனுப்புகிறோம் (அதற்கு பதிலாக அதை செட்டர் வழியாக முன்பே அனுப்பியிருக்கலாம், VQE இயங்கும் வரை அது செயல்பட ஒரு ஆபரேட்டர் உள்ளது).
vi_vn: Tóm tắt lại, hãy sử dụng giao diện MinimumEigensolver và cùng với đó tạo một VQE instance mà không cần cung cấp toán tử hoặc QuantumInstance. Sau đó, chúng ta đặt QuantumInstance và cuối cùng truyền toán tử vào method ``compute_minimum_eigenvalue`` (mặc dù chúng ta có thể đã truyền nó vào trước đó thông qua setter, miễn là vào thời điểm VQE chạy, nó có một toán tử để hoạt động).

source: As the identical seeding was used as the prior example the result can be seen to be the same.
bn_bn: আগের উদাহরণের সাথে অভিন্ন সিডিং (seeding) ব্যবহার্যের ফলে ফলাফলটিও এখানে এক।
es_un: Cómo se utilizo exactamente el mismo "seed" qué en el ejemplo anterior, se puede observar que el resultado es el mismo.
fr_fr: Comme un amorçage identique a été utilisé comme l'exemple précédent, le résultat peut être considéré comme le même.
id_id: Karena seed identik digunakan pada contoh sebelumnya hasilnya dapat dilihat menjadi sama.
ja_jp: 先ほどの例と同じシード値が使われているので、結果は同じであることがわかります。
ko_kr: 이전 예로서 동일한 시딩(seeding) 이 사용되었기 때문에, 결과는 동일한 것으로 보일 수 있다.
pt_br: Uma vez que a semeadura idêntica foi utilizada como exemplo prévio, o resultado pode ser visto como o mesmo.
ru_ru: Проведенная ранее инициализация генератора случайных чисел позволяет получить тот же самый результат, что удобно для сравнения двух подходов.
ta_in: ஒத்திசைவு சேமிப்பு முந்தைய உதாரணமாக பயன்படுத்தப்பட்டதால் இதன் விளைவு ஒரே இருக்க முடியும்.
vi_vn: Vì các seeding giống nhau đã được sử dụng làm ví dụ như trước, kết quả có thể được xem là như nhau.
zh_tw: 由於相同的播種被用作前一個例子，結果可以看出是相同的。

source: This concludes this introduction to algorithms in Qiskit. Please check out the other algorithm tutorials in this series for both broader as well as more in depth coverage of the algorithms.
bn_bn: Qiskit এ অ্যালগরিদম এর ভূমিকা এখানেই উপসংহার। গভীর ভাবে বা আরো অন্যান্য অ্যালগরিদম পরখ করতে বাকি টিউটোরিয়াল গুলি দেখতে পারেন।
es_un: Esto concluye esta introducción a algoritmos en Qiskit. Por favor revisa otros de los tutoriales de algoritmos de esta serie para encontrar más explicaciones más a profundidad de los algoritmos.
fr_fr: Ceci conclut cette introduction aux algorithmes dans Qiskit. Veuillez consulter les autres tutoriels d'algorithmes de cette série pour une couverture plus large et plus en profondeur des algorithmes.
id_id: Ini mengakhiri pengenalan pada algoritma di Qiskit. Silahkan periksa tutorial algoritma lainnya dalam seri ini untuk cakupan algoritma yang lebih luas dan lebih dalam.
ja_jp: これで Qiskit におけるアルゴリズムの入門編は終了です。このシリーズの他のアルゴリズム・チュートリアルでは、より広い範囲のアルゴリズムをより詳細に学ぶことができます。
ko_kr: 이로써 Qiskit을 사용한 알고리즘 입문에 대하여 다루었다. 알고리즘에 대한 좀더 깊고 넓은 내용에 흥미가 있다면, 본 시리즈의 다른 알고리즘 사용 지침서들 또한 참고해 주시길 바란다.
pt_br: Isso conclui essa introdução aos algoritmos no Qiskit. Confira os outros tutoriais de algoritmos nesta série para uma cobertura mais ampla e mais profunda dos algoritmos.
ru_ru: На этом мы завершаем введение в алгоритмы Qiskit. Для более подробного изучения обратите внимание на другие статьи данного руководства.
ta_in: இது Qiskit-ல் உள்ள வழிமுறைகளுக்கான இந்த அறிமுகத்தை முடிக்கிறது. இந்த தொடரின் பிற வழிமுறை பயிற்சிகளை பரந்த மற்றும் வழிமுறைகளின் ஆழமான கவரேஜில் பாருங்கள்.
tr: Bu, Qiskit'teki algoritmalara girişi tamamlıyor. Algoritmaların hem daha geniş hem de derinlemesine kapsamı için lütfen bu serideki diğer algoritma eğitsellerine göz atın.
vi_vn: Phần này kết thúc mục giới thiệu về các thuật toán trong Qiskit. Vui lòng xem các hướng dẫn thuật toán khác trong loạt bài này để biết cả phạm vi rộng hơn cũng như chuyên sâu hơn về các thuật toán.
zh_tw: Qiskit 中的演算法簡介到此結束。請查看在此系列中其他演算法指導教學，以進行更廣泛及更深入地涵蓋演算法。

source: Qiskit provides a number of `Algorithms <https://qiskit.org/documentation/apidoc/algorithms.html>`__ and they are grouped by category according to the task they can perform. For instance ``Minimum Eigensolvers`` to find the smallest eigen value of an operator, for example ground state energy of a chemistry Hamiltonian or a solution to an optimization problem when expressed as an Ising Hamiltonian. There are ``Time Evolvers`` for the time evolution of quantum systems and ``Amplitude Estimators`` for value estimation that can be used say in financial applications. The full set of categories can be seen in the Algorithms documentation link above.
tr: Qiskit birçok `Algorithma <https://qiskit.org/documentation/apidoc/algorithms.html>`__ sunar ve bu algoritmalar, gerçekleştirebilecekleri görevlere göre belirlenen kategorilerle gruplandırılırlar. Örneğin, bir operatörün en küçük öz değerini bulmak için ``Minimum Eigensolvers``, örneğin bir kimya Hamiltonyen'inin temel durumundaki enerjisi ya da Ising Hamiltonyen olarak ifade edildiğinde, bir optimizasyon problemi çözümüdür. Kuantum sistemlerinin zaman evrimi için ``Time Evolvers`` ve finansal uygulamalarda kullanılabilecek değer tahmini için ``Amplitude Estimators`` vardır. Kategorilerin tamamı yukarıdaki Algoritmalar dokümantasyon bağlantısında görülebilir.

source: Algorithms are configurable and often part of the configuration will be in the form of smaller building blocks, of which different instances of the building block type can be given. For instance with ``VQE``, the Variational Quantum Eigensolver, it takes a trial wavefunction, in the form of a ``QuantumCircuit`` and a classical optimizer among other things.
bn_bn: ধারাক্রমদের (অ্যালোগরিদম) সাজানো সম্ভব (কনফিগারেবল), আর সাধারণত সাজানোর (কনফিগারেশন​) কিছুটা ভাগ ছোট ছোট মৌলিক অংশ (বিল্ডিং ব্লক) দিয়ে তৈরী, যা কিনা বিভিন্ন রকম হতে পারে। যেমন ``VQE``, কিংবা ভ্যারিয়শনাল কোয়ান্টাম আইগেনসলভার এর ক্ষেত্রে পরিক্ষীত (ট্রায়াল) ওয়েভফাংশন, ``QuantumCircuit`` এবং প্রথাগত (ক্লাসিকাল) অপটিমাইজার ইত্যাদির মাধ্যমে নেওয়া হ​য়।
ru_ru: Алгоритмы можно настраивать, и часто в их конфигурацию входят более мелкие структурные элементы, из которых можно получить различные экземпляры типа структурного элемента. Например, для ``VQE`` (Variational Quantum Eigensolver — квантовый вариационный алгоритм вычисления собственного значения), помимо остальных параметров, требуется пробная волновая функция в виде ``QuantumCircuit`` и классический алгоритм оптимизации.
tr: Algoritmalar yapılandırılabilir ve genellikle yapılandırmanın bir parçası, yapı taşı türünün farklı örneklerinin verilebileceği daha küçük yapı taşları biçiminde olacaktır. Örneğin, "VQE", Variational Quantum Eigensolver ile, diğer şeylerin yanı sıra "QuantumCircuit" ve klasik bir optimize edici biçiminde bir deneme dalga fonksiyonu alır.
zh_tw: 演算法是可配置的，且通常部分配置會以較小的建置區塊形式存在，而對於每個小建置區塊，有相對應的不同實例可以選擇。例如，``VQE``，變分量子特徵值求解器，它有一個 ``QuantumCircuit`` 形式的試驗波函數和一個古典優化器等等。

source: Let’s draw the ansatz so we can see it’s a ``QuantumCircuit`` where θ[0] through θ[7] will be the parameters that are varied as VQE optimizer finds the minimum eigenvalue. We’ll come back to the parameters later in a working example below.
ru_ru: Отображая анзац, видно, что он представляет собой квантовую цепь ``QuantumCircuit`` с параметрами θ[0] - θ[7], которые будут меняться в процессе поиска минимального собственного значения оптимизатором VQE. В нижеприведенном примере мы к ним еще вернемся.
tr: Ansatz'ı çizelim, böylece onun bir ``QuantumCircuit`` olduğunu görebiliriz, burada θ[0]'dan θ[7]'ye kadar olan parametreler, VQE eniyileştirici minimum özdeğeri buldukça değişen parametreler olacaktır. Aşağıdaki çalışma örneğinde parametrelere daha sonra geri döneceğiz.

source: Algorithms rely on the primitives to evaluate expectation values or sample circuits. The primitives can be based on a simulator or real device and can be used interchangeably in the algorithms, as they all implement the same interface.
tr: Algoritmalar, beklenti değerlerini veya örnek devreleri değerlendirmek için temel öğelere güvenir. Temel öğeler, bir simülatöre veya gerçek bir cihaza dayalı olabilir ve hepsi aynı arayüzü uyguladığı için algoritmalarda birbirinin yerine kullanılabilir.

source: In the VQE, we have to evaluate expectation values, so for example we can use the ``qiskit.primitives.Estimator`` which is shipped with the default Qiskit Terra installation.
tr: VQE'de beklenti değerlerini değerlendirmemiz gerekir, örneğin varsayılan Qiskit Terra kurulumuyla birlikte gelen ``qiskit.primitives.Estimator``'ı kullanabiliriz.

source: This estimator uses an exact, statevector simulation to evaluate the expectation values. We can also use a shot-based and noisy simulators or real backends instead. For more information of the simulators you can check out `Qiskit Aer <https://qiskit.org/documentation/apidoc/aer_primitives.html>`__ and for the actual hardware `Qiskit IBM Runtime <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/>`__.
tr: Bu tahminci, beklenti değerlerini değerlendirmek için tam bir durum vektörü simülasyonu kullanır. Bunun yerine deneme tabanlı ve gürültülü simülatörler veya gerçek arka uçlar da kullanabiliriz. Simülatörler hakkında daha fazla bilgi için `Qiskit Aer <https://qiskit.org/documentation/apidoc/aer_primitives.html>`__ ve gerçek donanım için `Qiskit IBM Runtime <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/>`__'a göz atabilirsiniz.

source: With all the ingredients ready, we can now instantiate the VQE:
tr: Tüm bileşenler hazır olduğunda, artık VQE'yi başlatabiliriz:

source: Now we can call the `compute_mininum_eigenvalue() <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.compute_minimum_eigenvalue.html#qiskit.algorithms.minimum_eigensolvers.VQE.compute_minimum_eigenvalue>`__ method. The latter is the interface of choice for the application modules, such as Nature and Optimization, in order that they can work interchangeably with any algorithm within the specific category.
tr: Artık `compute_mininum_eigenvalue() <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.compute_minimum_eigenvalue.html#qiskit.algorithms.minimum_eigensolvers.VQE.compute_minimum_eigenvalue>`__ metodunu çağırabiliriz. İkincisi ise, belirli kategorideki herhangi bir algoritma ile birbirinin yerine geçebilmeleri amacıyla Nature ve Optimizasyon gibi uygulama modülleri için tercih edilmekte olan arayüzdür.

source: Let’s put what we have learned from above together and create a complete working example. VQE will find the minimum eigenvalue, i.e. minimum energy value of a Hamiltonian operator and hence we need such an operator for VQE to work with. Such an operator is given below. This was originally created by the Nature application module as the Hamiltonian for an H2 molecule at 0.735A interatomic distance. It’s a sum of Pauli terms as below, but for now I am not going to say anything further about it since the goal is to run the algorithm, but further information on operators can be found in other tutorials.
bn_bn: এখনও পর্যন্ত যা দেখানো হয়েছে তা এবার একটি সম্পূর্ণ কার্যকরী উদাহরণ এর মাধ্যমে বোঝানো যাক। যেহেতু VQE নিম্নতম স্বকীয়মান (আইগেনভ্যালু), অর্থাত হ্যামিল্টনিয়ন এর নিম্নতম শক্তির মান বার করবে, তাই সেটির জন্য উপযুক্ত অপারেটর দরকার। নিচে দেওয়া অপারেটরটি সেই কাজে ব্যবহার করা যেতে পারে। এটিকে প্রকৃতি (নেচার) অ্যাপলিকেশন মডুল তৈরি করেছিল​ H2 অণুর হ্যামিল্টনিয়ন এর জন্য​, 0.735A আন্তঃপরমাণু দূরত্বে। এটি পাউলি পদগুলির যোগফল, যেরকম নীচের উদাহরণে দেখানো হ​য়েছে, কিন্তু এদের নিয়ে আর কিছু এখানে বলব না, তবে অপারেটর নিয়ে অন্যান্য পাঠ (টিউটোরিয়াল) দেখতে পারো।
ru_ru: Обобщим вышесказанное и рассмотрим работу алгоритма в целом. Прежде всего нам потребуется оператор, минимальное собственное значение (энергию основного состояния) которого и будет искать VQE. Он приведен ниже и представляет собой созданный модулем Nature гамильтониан молекулы водорода с межатомным расстоянием в 0,735 ангстрем. Оператор задается с помощью матриц Паули, знакомство с которыми мы пока отложим. На данный момент наша цель — запустить алгоритм.
tr: Yukarıdan öğrendiklerimizi bir araya getirelim ve eksiksiz bir çalışma örneği oluşturalım. VQE minimum özdeğeri yani bir Hamilitonian operatörünün minimum enerji değerini bulacaktır ve dolayısıyla VQE'nin birlikte çalışması için böyle bir operatöre ihtiyacımız vardır. Böyle bir operatör aşağıda verilmiştir. Bu, başlangıçta Kimya uygulama modülü tarafından 0.735A atomlararası mesafede bir H2 molekülü için Hamiltonian olarak oluşturulmuştur. Bu Pauli terimlerinin toplamı aşağıdaki gibidir, fakat şimdilik bu konuda daha fazla bir şey söylemeyeceğim çünkü asıl amaç algoritmayı çalıştırmaktır, ancak operatörler hakkında daha fazla bilgiyi diğer eğitimlerde bulabilirsiniz.
zh_tw: 讓我們把從上面學到的東西放在一起，創造出一個完整的工作範例。 VQE 會找到最小特徵值，即 Hamiltonian 算子的最小能量值，因此我們需要一個用於 VQE 的算子來運行。下面我們給出了這樣的算子。此算子原本是由 Nature 應用模組以 0.735A 的原子間距離為 H2 分子的創建的 Hamiltonian。這是所有 Pauli 項的總和，如下，但現在關於這我不會再講更多了，因為我們的目標是執行此演算法，但在其他指導教學中可以找到關於算子的進一步資訊。

source: From the above result we can see the number of cost function (=energy) evaluations the optimizer took until it found the minimum eigenvalue of :math:`\approx -1.85727` which is the electronic ground state energy of the given H2 molecule. The optimal parameters of the ansatz can also be seen which are the values that were in the ansatz at the minimum value.
tr: Yukarıdaki sonuçtan, verilen H2 molekülünün elektronik temel durum enerjisi olan :math:`\approx -1.85727`nin minimum özdeğerini bulana kadar optimize edicinin maliyet fonksiyonu (=enerji) değerlendirmeleri sayısını görebiliriz. Minimum değerde ansatz'da bulunan değerler olan ansatz'ın optimal parametreleri de görülebilir.

source: Updating the primitive inside VQE
tr: VQE içindeki temel öğeyi güncelleme
