Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/01_grover.po
Languages: fr_fr, pt_br

source: ``good_state`` is used to check whether the measument result is correct or not internally. It can be a list of binary strings, a list of integer, ``Statevector``, and Callable. If the input is a list of bitstrings, each bitstrings in the list represents a good state. If the input is a list of integer, each integer represent the index of the good state to be :math:`|1\rangle`. If it is a ``Statevector``, it represents a superposition of all good states.
fr_fr: ``good_state`` est utilisé pour vérifier si le résultat de mesure est correct ou non. Il peut s'agir d'une liste de chaînes binaires, d'une liste de nombres entiers, ou un ``Statevector``. Si l'entrée est une liste de chaînes de bits, chaque chaîne de bits de la liste représente un état à rechercher. Si l'entrée est une liste d'entiers, chaque entier représente l'indice de l'état à rechercher :math:` | 1\r'. S'il s'agit d'un ``Statevector``, il représente une superposition de tous les états à rechercher.
pt_br: ``good_state`` é usado para verificar se o resultado do medido está correto ou não internamente. Ele pode ser uma lista de strings binárias, uma lista de inteiros, ``Statevector`` e Callable. Se o input for uma lista de bitstrings, cada bitstrings na lista representa um estado bom. Se o valor de entrada for uma lista de inteiros, cada inteiro representa o índice do estado bom como :math:`|1\rangle`. Se for um ``Statevector``, representa uma superposição de todos os estados bons.

source: The number of ``iterations``
fr_fr: Le nombre d'``itérations``
pt_br: O número de ` ` iterações ` `

source: The number of repetition of applying the Grover operator is important to obtain the correct result with Grover's algorithm. The number of iteration can be set by the ``iteration`` argument of ``Grover``. The following inputs are supported: \* an integer to specify a single power of the Grover operator that's applied \* or a list of integers, in which all these different powers of the Grover operator are run consecutively and after each time we check if a correct solution has been found
fr_fr: Le nombre de répétitions d'application de l'opérateur Grover est important pour obtenir le résultat correct avec l'algorithme de Grover. Le nombre d'itérations peut être défini par l'argument ``itération`` de ``Grover``. Les entrées suivantes sont prises en charge: \ * un entier pour spécifier une seule puissance de l'opérateur Grover qui est appliqué \ * ou une liste d'entiers, représentant les itérations de l'opérateur Grover à exécuter consécutivement et entre lesquelles nous pouvons vérifier si une solution correcte a été trouvée
pt_br: O número de repetições da aplicação do operador de Grover é importante para obter o resultado correto com o algoritmo de Grover. O número de iterações pode ser configurado pelo argumento ``iteration``, do ``Grover``. As entradas a seguir são suportadas: \* um inteiro para especificar uma única potência do operador de Grover que é aplicada \ * ou uma lista de inteiros, na qual todas estas diferentes potências do operador de Grover são executadas consecutivamente e depois de cada vez verificamos se uma solução correta foi encontrada

source: Additionally there is the ``sample_from_iterations`` argument. When it is ``True``, instead of the specific power in ``iterations``, a random integer between 0 and the value in ``iteration`` is used as the power Grover's operator. This approach is useful when we don't even know the number of solution.
fr_fr: De plus, il y a l'argument ``sample_from_iterations``. Quand il est à ``True``, au lieu d'appliquer le nombre d'itérations spécifiées, un nombre entier aléatoire compris entre 0 et la valeur de ``iteration`` est utilisé comme nombre d'itérations de l'opérateur de Grover. Cette approche est utile lorsque nous ne connaissons même pas le nombre de solutions.
pt_br: Adicionalmente há o argumento ` ` sample_from_iterations ` `. Quando for ` ` True ` `, em vez de uma potência específica em ` ` iterações ` `, um inteiro aleatório entre 0 e o valor em ` ` interation` ` é usado como operador de força de Grover. Essa abordagem é útil quando nem sequer conhecemos o número de solução.

source: For more details of the algorithm using ``sample_from_iterations``, see [4].
fr_fr: Pour plus de détails sur l'algorithme utilisant ``sample_from_iterations``, voir [4].
pt_br: Para obter mais detalhes do algoritmo usando ``sample_from_iterations``, consulte [4].

source: When the number of solutions is known, we can also use a static method ``optimal_num_iterations`` to find the optimal number of iterations. Note that the output iterations is an approximate value. When the number of qubits is small, the output iterations may not be optimal.
fr_fr: Lorsque le nombre de solutions est connu, nous pouvons également utiliser une méthode statique ``optimal_num_iterations`` pour obtenir le nombre optimal d'itérations. Notez que le nombre d'itérations ainsi obtenu est une valeur approximative. Lorsque le nombre de qubits est faible, ce nombre d'itérations peut ne pas être optimal.
pt_br: Quando o número de soluções é conhecido, podemos também utilizar um método estático ` ` optimal_num_iterations ` ` para encontrar o número ideal de iterações. Observe que as iterações de saída são um valor aproximado. Quando o número de qubits é pequeno, as iterações de saída podem não ser ótimas.

source: Applying ``post_processing``
fr_fr: Application du ``post_processing``
pt_br: Aplicando ``post_processing``

source: We can apply an optional post processing to the top measurement for ease of readability. It can be used e.g. to convert from the bit-representation of the measurement ``[1, 0, 1]`` to a DIMACS CNF format ``[1, -2, 3]``.
fr_fr: Nous pouvons appliquer un post-traitement optionnel à la mesure supérieure pour faciliter la lecture. Il peut être utilisé, par exemple, pour convertir la représentation binaire de la mesure ``[ 1, 0, 1 ]`` à un format DIMACS CNF ``[ 1, -2, 3 ]``.
pt_br: Podemos aplicar um processamento posterior opcional para a medição superior para facilitar a legibilidade. Pode ser utilizado, por exemplo, para converter a partir do bit-representação da medição " ` [1, 0, 1] ` ` a um formato de DIMACS CNF ` ` [1, -2, 3] ` `.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/01_grover.ipynb>`_.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/01_grover.ipynb>`_.
