Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/01_grover.po
Languages: fr_fr, pt_br

source: This page was generated from `tutorials/algorithms/01_grover.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/simulators/1_aer_provider.ipynb`__.
pt_br: Esta página foi gerada, a partir do 'tutorials/simulators/1_aer_provider.ipynb'__.

source: Grover's Algorithm and Amplitude Amplification
fr_fr: Algorithme de Grover et Amplification d'amplitude
pt_br: Algoritmo de Grover e Amplificação De Amplitude

source: Grover's algorithm is one of the most famous quantum algorithms introduced by Lov Grover in 1996 `1 <L.%20K.%20Grover,%20A%20fast%20quantum%20mechanical%20algorithm%20for%20database%20search.%20Proceedings%2028th%20Annual%20Symposium%20on>`__. It has initially been proposed for unstructured search problems, i.e. for finding a marked element in a unstructured database. However, Grover's algorithm is now a subroutine to several other algorithms, such as Grover Adaptive Search `2 <A.%20Gilliam,%20S.%20Woerner,%20C.%20Gonciulea,%20Grover%20Adaptive%20Search%20for%20Constrained%20Polynomial%20Binary%20Optimization.>`__. For the details of Grover's algorithm, please see `Grover's Algorithm <https://qiskit.org/textbook/ch-algorithms/grover.html>`__ in the Qiskit textbook.
fr_fr: L'algorithme de Grover est l'un des algorithmes quantiques les plus célèbres introduits par Lov Grover en 1996 ` 1 <L.%20K.%20Grover,%20A%20fast%20quantum%20mechanical%20algorithm%20for%20database%20search.%20Proceedings%2028th%20Annual%20Symposium%20on>` __. Il a d'abord été proposé pour des problèmes de recherche non structurés, c'est-à-dire pour trouver un élément marqué dans une base de données non structurée. Cependant, l'algorithme de Grover est maintenant une sous-routine de plusieurs autres algorithmes, tels que Grover Adaptive Search ` 2 <A.%20Gilliam,%20S.%20Woerner,%20C.%20Gonciulea,%20Grover%20Adaptive%20Search%20for%20Constrained%20Polynomial%20Binary%20Optimization.>` __. Pour les détails de l'algorithme de Grover, veuillez consulter l'algorithme de Grover <https://qiskit.org/textbook/ch-algorithms/grover.html>` __ dans le manuel Qiskit.
pt_br: O algoritmo de Grover é um dos algoritmos quânticos mais famosos introduzidos por Lov Grover em 1996 ` 1 <L.%20K.%20Grover,%20A%20fast%20quantum%20mechanical%20algorithm%20for%20database%20search.%20Proceedings%2028th%20Annual%20Symposium%20on>` __. Foi inicialmente proposto para problemas de busca não estruturados, ou seja, para encontrar um elemento marcado em um banco de dados não estruturado. No entanto, o algoritmo de Grover é agora uma subrotina para vários outros algoritmos, como o Grover Adaptive Search ` 2 <A.%20Gilliam,%20S.%20Woerner,%20C.%20Gonciulea,%20Grover%20Adaptive%20Search%20for%20Constrained%20Polynomial%20Binary%20Optimization.>` __. Para os detalhes do algoritmo de Grover, por favor, consulte ` Grover's Algoritmo <https://qiskit.org/textbook/ch-algorithms/grover.html>` __ no Qiskit textbook.

source: Qiskit implements Grover's algorithm in the ``Grover`` class. This class also includes the generalized version, Amplitude Amplification [3], and allows setting individual iterations and other meta-settings to Grover's algorithm.
fr_fr: Qiskit implémente l'algorithme de Grover dans la classe ` ` Grover ` `. Cette classe inclut également la version généralisée : l'amplification d'amplitude [3], et permet de définir des itérations individuelles et d'autres méta-paramètres à l'algorithme de Grover.
pt_br: Qiskit implementa o algoritmo de Grover na classe ``Grover``. Esta classe também inclui a versão generalizada, a Amplificação da Amplitude [3], e permite a configuração de iterações individuais e outras meta-configurações do algoritmo do Grover.

source: **References:**
fr_fr: **Références :**
pt_br: **Referências:**

source: [3]: Brassard, G., Hoyer, P., Mosca, M., & Tapp, A. (2000). Quantum Amplitude Amplification and Estimation. http://arxiv.org/abs/quant-ph/0005055
fr_fr: [3]: Brassard, G., Hoyer, P., Mosca, M., et Tapp, A. (2000). Amplitude et estimation de l'amplitude quantique. http://arxiv.org/abs/quant-ph/0005055

source: Grover's algorithm
fr_fr: Algorithme de Grover
pt_br: Algoritmo de Grover

source: Grover's algorithm uses the Grover operator :math:`\mathcal{Q}` to amplify the amplitudes of the good states:
fr_fr: L'algorithme de Grover utilise l'opérateur Grover :math:` \mathcal{Q}` pour amplifier les amplitudes des états recherchés :
pt_br: O algoritmo de Grover usa o operador Grover :math:` \mathcal{Q}` para amplificar as amplitudes dos bons estados:

source: Here, \* :math:`\mathcal{A}` is the initial search state for the algorithm, which is just Hadamards, :math:`H^{\otimes n}` for the textbook Grover search, but can be more elaborate for Amplitude Amplification \* :math:`\mathcal{S_0}` is the reflection about the all 0 state
fr_fr: Ici, \ * :math:` \mathcal{A}` est l'état de recherche initial de l'algorithme, qui est juste un état de superposition de tous les qubits d'entrée obtenu par :math:` H ^ { \otimes n } ` pour la recherche de Grover de manuel, mais peut être plus élaboré pour l'amplification d'amplitude \ * :math:` \mathcal{S_0}` est la réflexion par rapport à l'état où tous les qubits sont à l'état 0
pt_br: Aqui, \* :math:`\mathcal{A}` é o estado de busca inicial do algoritmo, que é apenas Hadamards, :math:`H^{\otimes n}` no documento de Busca de Grover, mas pode ser mais elaborada para Amplificação de Amplitude \* :math:`\mathcal{S_0}` é a reflexão sobre o estado 0

source: |x\rangle \mapsto \begin{cases} -|x\rangle, &x \neq 0 \\ |x\rangle, &x = 0\end{cases} \* :math:`\mathcal{S_f}` is the oracle that applies
fr_fr: |x\rangle \mapsto \begin{cases} -|x\rangle, &x \neq 0 \\ |x\rangle, &x = 0 \end{cases} \ * :math:` \mathcal{S_f}` est l'oracle qui applique
pt_br: |x\rangle \mapsto \begin{cases} -|x\rangle, &x \neq 0 \\ |x\rangle, &x = 0\end{cases} \* :math:`\mathcal{S_f}` é o oráculo que aplica

source: |x\rangle \mapsto (-1)^{f(x)}|x\rangle where :math:`f(x)` is 1 if :math:`x` is a good state and otherwise 0.
fr_fr: |x\rangle \mapsto (-1) ^ { f (x) } |x\rangle où :math:` f (x) ` est 1 si :math:` x ` est l'état rechercher et sinon 0.
pt_br: |x\rangle \mapsto (-1)^{f(x)}|x\rangle where :math:`f(x)` is 1 if :math:`x` é um bom estado e, caso contrário, 0.

source: In a nutshell, Grover's algorithm applies different powers of :math:`\mathcal{Q}` and after each execution checks whether a good solution has been found.
fr_fr: En un mot, l'algorithme de Grover applique différentes puissances de :math:` \mathcal{Q}` et après chaque exécution vérifie si une bonne solution a été trouvée.
pt_br: Em poucas palavras, o algoritmo de Grover aplica pesos diferentes de :math:`\mathcal{Q}` e depois de cada execução verifica se uma boa solução foi encontrada.

source: Running Grover's algorithm
fr_fr: Exécution de l'algorithme de Grover
pt_br: Executando o algoritmo de Grover

source: To run Grover's algorithm with the ``Grover`` class, firstly, we need to specify an oracle for the circuit of Grover's algorithm. In the following example, we use ``QuantumCircuit`` as the oracle of Grover's algorithm. However, there are several other class that we can use as the oracle of Grover's algorithm. We talk about them later in this tutorial.
fr_fr: Pour exécuter l'algorithme de Grover à l'aide de la classe ``Grover``, premièrement, nous devons spécifier un oracle pour le circuit de l'algorithme de Grover. Dans l'exemple suivant, nous utilisons ``QuantumCircuit`` comme oracle de l'algorithme de Grover. Cependant, il existe plusieurs autres classes que nous pouvons utiliser comme oracle de l'algorithme de Grover. Nous en parlons plus loin dans ce tutoriel.
pt_br: Para executar o algoritmo de Grover com a classe ` ` Grover ` `, em primeiro lugar, precisamos especificar um oráculo para o circuito do algoritmo de Grover. No exemplo a seguir, utilizamos ` ` QuantumCircuit ` ` como o oráculo do algoritmo de Grover. No entanto, existem diversas outras classe que podemos usar como oráculo do algoritmo de Grover. Falamos sobre eles mais tarde neste tutorial.

source: Note that the oracle for ``Grover`` mush be a *phase-flip* oracle. That is, it multiplies the amplitudes of the of "good states" by a factor of :math:`-1`. We explain later how to convert a *bit-flip* oracle to a phase-flip oracle.
fr_fr: Notez que l'oracle de ``Grover`` doit être un oracle de *phase-flip*. En d'autres termes, il multiplie les amplitudes des "bons états" par un facteur :math:` -1 `. Nous expliquons plus tard comment convertir un oracle * bit-flip * en oracle de phase-flip.
pt_br: Observe que o oráculo para ` ` Grover ` ` precisa ser um oráculo * phase-flip *. Ou seja, multiplica as amplitudes dos "good states" por um fator de :math:` -1 `. Explicamos mais tarde como converter um oráculo * bit-flip * para um oráculo phase-flip.

source: Then, we specify a backend and call the ``run`` method of ``Grover`` with a backend to execute the circuits. The returned result type is a ``GroverResult``.
fr_fr: Ensuite, nous spécifions un backend et nous appelons la méthode ``run`` de ``Grover``. Le type de résultat renvoyé est un ``GroverResult``.
pt_br: Em seguida, especificamos um backend e chamamos o método ``run`` de ``Grover`` com um backend para executar os circuitos. O tipo de resultado retornado é um ``GroverResult``.

source: If the search was successful, the ``oracle_evaluation`` attribute of the result will be ``True``. In this case, the most sampled measurement, ``top_measurement``, is one of the "good states". Otherwise, ``oracle_evaluation`` will be False.
fr_fr: Si la recherche a réussi, l'attribut ``oracle_evaluation`` du résultat sera ``True``. Dans ce cas, la mesure la plus fréquemment obtenue, ``top_measurement``, est l'un des "bons états". Sinon, ``oracle_evaluation`` sera False.
pt_br: Se a pesquisa foi bem-sucedida, o resulado do atributo ``oracle_evaluation`` será ``True``. Neste caso, a medição mais realizada, ``top_measurement``, é um dos "bons estados". Caso contrário, ``oracle_evaluation`` será False.

source: In the example, the result of ``top_measurement`` is ``11`` which is one of "good state". Thus, we succeeded to find the answer by using ``Grover``.
fr_fr: Dans notre exemple, le résultat de ``top_measurement`` est ``11`` qui est l'état recherché. Ainsi, nous avons réussi à trouver la réponse en utilisant ``Grover``.
pt_br: No exemplo, o resultado de ``top_measurement`` é ``11`` que é um de "bom estado". Assim, nós encontramos a resposta utilizando ``Grover``.

source: Using the different types of classes as the oracle of ``Grover``
fr_fr: Utiliser les différents types de classes comme oracle de ``Grover``
pt_br: Utilizando os diferentes tipos de classes como oráculo de ``Grover``

source: In the above example, we used ``QuantumCircuit`` as the oracle of ``Grover``. However, we can also use ``qiskit.aqua.components.oracles.Oracle``, and ``qiskit.quantum_info.Statevector`` as oracles. All the following examples are when :math:`|11\rangle` is "good state"
fr_fr: Dans l'exemple ci-dessus, nous avons utilisé ``QuantumCircuit`` comme l'oracle de ``Grover``. Cependant, nous pouvons également utiliser ``qiskit.aqua.components.oracles.Oracle``, et ``qiskit.quantum_info.Statevector`` comme oracles. Dans les exemples suivants, l'état à rechercher est :math:` | 11\rangle `
pt_br: No exemplo acima, utilizamos ``QuantumCircuit`` como o oráculo de ``Grover``. No entanto, podemos também utilizar ``qiskit.aqua.components.oracles.Oracle``, e ``qiskit.quantum_info.Statevector`` como oráculos. Todos os exemplos a seguir são quando :math:` | 11\rângulo ` é "bom estado"

source: Internally, the statevector get's mapped to a quantum circuit:
fr_fr: En interne, le statevector est mappé à un circuit quantique :
pt_br: Internamente, o statevector fica mapeado para um circuito quântico:

source: The ``Oracle`` components in Qiskit Aqua allow for an easy construction of more complex oracles. The ``Oracle`` type has the interesting subclasses: \* ``LogicalExpressionOracle``: for parsing logical expressions such as ``'~a | b'``. This is expecially useful for solving 3-SAT problems (see `Using Grover's Algorithm to Perform Quantum Search <https://github.com/qiskit-community/qiskit-community-tutorials/blob/master/optimization/grover.ipynb>`__ in Qiskit-community-tutorials). \* ``TrutheTableOracle``: for converting binary truth tables to circuits
fr_fr: Les composants ``Oracle`` de Qiskit Aqua permettent une construction facile d'oracles plus complexes. Le type ``Oracle`` a les sous-classes utiles suivantes : \ * ``LogicalExpressionOracle``: pour l'analyse d'expressions logiques telles que ``'~ a | b'``. Ceci est particulièrement utile pour résoudre les problèmes 3-SAT (voir ` Utilisation de l'algorithme de Grover pour effectuer une recherche quantique <https://github.com/qiskit-community/qiskit-community-tutorials/blob/master/optimization/grover.ipynb>` __ dans Qiskit-community-tutorials). \ * ``TrutheTableOracle``: pour convertir des tables de vérité binaires en circuits
pt_br: Os componentes ` ` Oracle ` ` ` no Qiskit Aqua permitem uma construção fácil de oráculos mais complexos. O tipo ` ` Oracle ` ` tem as subclasses interessantes: \ * ` ` LogicalExpressionOracle ` `: para análise de expressões lógicas tais como ` ` '~ a | b' ` `. Isto é especialmente útil para solução de problemas de 3-SAT (ver ` Using Grover's Algorithm to Perform Quantum Search <https://github.com/qiskit-community/qiskit-community-tutorials/blob/master/optimization/grover.ipynb>` __ in Qiskit-community-tutoriais). \ * ` ` TrutheTableOracle ` `: para conversão de tabelas de verdade binária em circuitos

source: Here we'll use the ``LogicalExpressionOracle`` for the simple example of finding the state :math:`|11\rangle`, which corresponds to ``'a & b'``.
fr_fr: Ici nous allons utiliser ``LogicalExpressionOracle`` pour par exemple marquer l'état à rechercher :math:`| 11\rangle`, qui correspond à ``'a & b'``.
pt_br: Aqui vamos usar o ``LogicalExpressionOracle`` para o exemplo simples de encontrar o estado :math:`├11\rangle`, que corresponde a ``'a & b'``.

source: You can observe, that this oracle is actually implemented with three qubits instead of two!
fr_fr: Vous pouvez observer, que cet oracle est en fait implémenté avec trois qubits au lieu de deux !
pt_br: Podem observar, que este oráculo é efectivamente implementado com três qubits em vez de dois!

source: That is because the ``LogicalExpressionOracle`` is not a phase-flip oracle (which flips the phase of the good state) but a bit-flip oracle. This means it flips the state of an auxiliary qubit if the other qubits satisfy the condition. For Grover's algorithm, however, we require a phase-flip oracle. To convert the bit-flip oracle to a phase-flip oracle we sandwhich the controlled-NOT by :math:`X` and :math:`H` gates, as you can see in the circuit above.
fr_fr: C'est parce que ``LogicalExpressionOracle`` n'est pas un oracle de phase-flip (qui flip la phase de l'état à rechercher) mais un oracle de flip-flip. Cela signifie qu'il retourne l'état d'un qubit auxiliaire si les autres qubits satisfont à la condition. Pour l'algorithme de Grover, cependant, nous avons besoin d'un oracle de phase-flip. Pour convertir l'oracle de bit-flip en un oracle de phase-flip nous entourons les controlled-NOT avec des portes :math:` X ` et :math:` H `, comme on peut le voir sur le circuit ci-dessus.
pt_br: Isso porque o ``LogicalExpressionOracle`` não é um oráculo inversor de fase (que inverte a fase do estado bom) mas um oráculo inversor de bit. Isso significa que ele inverte o estado de um qubit auxiliar se os outros qubits satisfazem a condição. Para o algoritmo de Grover, no entanto, exigimos um oráculo de inversão de fase. Para converter o oráculo de inversão de bits para um oráculo de inversão de fase nós envolvemos o NOT-controlado por portas :math:`X` e :math:`H`, como você pode ver no circuito acima.

source: **Note:** This transformation from a bit-flip to a phase-flip oracle holds generally and you can use this to convert your oracle to the right representation.
fr_fr: **Note:** Cette transformation d'un bit-flip à un oracle de phase-flip est généralement valable et vous pouvez l'utiliser pour convertir votre oracle vers la bonne représentation.
pt_br: **Nota:** Esta transformação de um bit-flip para um oráculo phase-flip geralmente se mantém e você pode usar isso para converter seu oráculo para a representação correta.

source: Amplitude amplification
fr_fr: Amplification de l'amplitude
pt_br: Amplificação de amplitude

source: Grover's algorithm uses Hadamard gates to create the uniform superposition of all the states at the beginning of the Grover operator :math:`\mathcal{Q}`. If some information on the good states is available, it might be useful to not start in a uniform superposition but only initialize specific states. This, generalized, version of Grover's algorithm is referred to *Amplitude Amplification*.
fr_fr: L'algorithme de Grover utilise des portes de Hadamard pour créer la superposition uniforme de tous les états au début de l'opérateur de Grover :math:` \mathcal{Q}`. Si certaines informations sur les bons états sont disponibles, il peut être utile de ne pas démarrer dans une superposition uniforme mais d'initialiser uniquement des états spécifiques. Cette version, généralisée, de l'algorithme de Grover est appelée *Amplification d'Amplitude*.
pt_br: O algoritmo do Grover usa portas Hadamard para criar a superposição uniforme de todos os estados no início do operador Grover :math:`\mathcal{Q}`. Se estiver disponível alguma informação sobre os bons Estados, poderá ser útil não começar com uma superposição uniforme, mas apenas inicializar os estados específicos. Isto, generalizado a versão do algoritmo de Grover se refere à *Amplificação de Amplitude*.

source: In Qiskit, the initial superposition state can easily be adjusted by setting the ``state_preparation`` argument.
fr_fr: Dans Qiskit, l'état de superposition initial peut facilement être ajusté en définissant l'argument ``state_preparation``.
pt_br: No Qiskit, o estado inicial de superposição pode facilmente ser ajustado definindo o argumento ``state_preparation``.

source: State preparation
fr_fr: Préparation de l'état
pt_br: Preparação do Estado

source: A ``state_preparation`` argument is used to specify a quantum circuit that prepares a quantum state for the start point of the amplitude amplification. By default, a circuit with $H^{:nbsphinx-math:`\otimes `n} $ is used to prepare uniform superposition (so it will be Grover's serach). The diffusion circuit of the amplitude amplification relrects ``state_preparation`` automatically.
fr_fr: Un argument ``state_préparation`` est utilisé pour spécifier un circuit quantique préparant un état quantique pour le point de départ de l'amplification de l'amplitude. Par défaut, un circuit avec $H^ {:nbsphinx-math:` \otimes` n } $ est utilisé pour préparer une superposition uniforme (ce sera donc l'algorithme de Grover). Le circuit de diffusion de l'amplification d'amplitude est généré automatiquement par ``state_préparation``.
pt_br: Um argumento ``state_preparation`` é usado para especificar um circuito quântico que prepara um estado quântico para o ponto inicial da amplificação de amplitude. Por padrão, um circuito com $H^{:nbsphinx-math:`\otimes `n} $ é usado para preparar a superposição uniforme (de modo que será a busca de Grover). O circuito de difusão da amplificação de amplitude reflete o ``state_preparation`` automaticamente.

source: Full flexibility
fr_fr: Flexibilité totale
pt_br: Flexibilidade total

source: For more advanced use, it is also possible to specify the entire Grover operator by setting the ``grover_operator`` argument. This might be useful if you know more efficient implementation for :math:`\mathcal{Q}` than the default construction via zero reflection, oracle and state preparation.
fr_fr: Pour une utilisation plus avancée, il est également possible de spécifier l'opérateur Grover en définissant l'argument ``grover_operator``. Cela peut être utile si vous connaissez une implémentation plus efficace pour :math:` \mathcal{Q}` que la construction par défaut via la réflexion autour de zéro, l'oracle et la préparation de l'état.
pt_br: Para uso mais avançado, também é possível especificar o operador de Grover inteiro, configurando o argumento ` ` grover_operator ` ` `. Isso pode ser útil se você souber uma implementação mais eficiente para :math:` \mathcal{Q}` do que a construção padrão via reflexão zero, oracle e preparação de estado.

source: The ``qiskit.circuit.library.GroverOperator`` can be a good starting point and offers more options for an automated construction of the Grover operator. You can for instance \* set the ``mcx_mode`` \* ignore qubits in the zero reflection by setting ``reflection_qubits`` \* explicitly exchange the :math:`\mathcal{S_f}, \mathcal{S_0}` and :math:`\mathcal{A}` operations using the ``oracle``, ``zero_reflection`` and ``state_preparation`` arguments
fr_fr: La bibliothèque ``qiskit.circuit.library.GroverOperator`` peut être un bon point de départ et offre plus d'options pour une construction automatisée de l'opérateur de Grover. Vous pouvez par exemple \ * définir le ``mcx_mode`` \ * ignorer les qubits dans la réflexion autour de zéro en définissant ``reflection_qubits`` \ * explicitement échanger les :math:` \mathcal{S_f}, \mathcal{S_0}` et :math:` \mathcal{A}`` à l'aide des arguments ``oracle``, ``zero_reflet`` et ``state_preparation``
pt_br: O ``qiskit.circuit.library.GroverOperator`` pode ser um bom ponto de partida e oferece mais opções para uma construção automatizada do operador de Grover. Você pode, por exemplo, \* definir o ``mcx_mode`` \*, ignorar qubits na reflexão zero definindo o ``reflection_qubits``, \* explicitamente trocar as operações :math:`\mathcal{S_f}, \mathcal{S_0}` e :math:`\mathcal{A}` usando os argumentos ``oracle``, ``zero_reflection`` e ``state_preparation``

source: For instance, imagine the good state is a three qubit state :math:`|111\rangle` but we used 2 additional qubits as auxiliary qubits.
fr_fr: Par exemple, imaginez que le bon état est un état trois qubits :math:` | 111\rangle ` mais que nous avons utilisé 2 qubits supplémentaires en tant que qubits auxiliaires.
pt_br: Por exemplo, imagine que o bom estado é um estado de três qubit `:math:` | 111\rangle ` mas utilizamos 2 qubits adicionais como qubits auxiliares.

source: Then, per default, the Grover operator implements the zero reflection on all five qubits.
fr_fr: Alors, par défaut, l'opérateur Grover implémentera la réflexion autour de zéro sur les cinq qubits.
pt_br: Em seguida, por padrão, o operador Grover implementa a reflexão zero em todos os cinco qubits.

source: But we know that we only need to consider the first three:
fr_fr: Mais nous savons que nous devons seulement considérer les trois premiers:
pt_br: Mas sabemos que só precisamos considerar os três primeiros:

source: Dive into other arguments of ``Grover``
fr_fr: Détails sur d'autres arguments de ``Grover``
pt_br: Mergulhando em outros argumentos de ` ` Grover ` `

source: ``Grover`` has arugments other than ``oracle`` and ``state_preparation``. We will explain them in this section.
fr_fr: ` ` Grover ` ` admet des arguments autres que ``oracle`` et ``state_préparation``. Nous les expliquerons dans cette section.
pt_br: ``Grover`` tem argumentos diferentes de ``oracle`` e ``state_preparation``. Explicaremos eles nesta seção.

source: Specifying ``good_state``
fr_fr: Spécifier ``good_state``
pt_br: Especificar ` ` good_state ` `
