Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/02_vqe_convergence.po
Languages: bn_bn, es_un, fr_fr, id_id, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, vi_vn, zh_tw

source: Finally since the above problem is still easily tractable classically we can use NumPyMinimumEigensolver to compute a reference value for the solution. We can now plot the difference from the resultant exact solution as the energy converges with VQE towards the minimum value which should be that exact classical solution.
bn_bn: শেষ পর্যন্ত যেহেতু উপরের সমস্যাটি এখনও সহজভাবে প্রথাগতভাবে (ক্লাসিক্যালি) ট্র্যাকটেবল তাই আমরা সমাধানের জন্য একটি তথ্যসূত্র (রেফারেন্স) মান গণনা করতে NumPyMinimumEigensolver ব্যবহার করতে পারি। আমরা এখন ফলস্বরূপ সঠিক সমাধান থেকে পার্থক্যটি প্লট করতে পারি কারণ শক্তিটি ভি কিউ ই -র সাথে ন্যূনতম মানের দিকে রূপান্তর করে যা সেই সঠিক প্রথাগত (ক্লাসিক্যাল) সমাধান হওয়া উচিত।
es_un: Finalmente, ya que el problema anterior se puede resolver fácilmente de manera clásica, podemos usar NumPyMinimumEigensolver para calcular una referencia para el valor de la solución. Ahora podemos graficar la diferencia de la solución exacta mientras la energía calculada con VQE converge al valor mínimo, que debería de ser la solución calculada clásicamente.
fr_fr: Enfin, puisque le problème ci-dessus est toujours facilement calculable classiquement, nous pouvons utiliser NumPyMinimumEigensolver pour calculer une valeur de référence très proche de la solution exacte. Nous pouvons maintenant tracer la différence entre la solution exacte et les valeurs obtenues lors des itérations de l'optimiseur, car avec VQE l'énergie converge vers la valeur minimale qui devrait être la solution exacte obtenue classiquement.
id_id: Akhirnya karena masalah di atas masih bisa dipecahkan secara klasik kita dapat menggunakan NumPyMinimumEigensolver untuk menghitung nilai referensi dari solusi. Sekarang kita dapat plot perbedaan dari solusi eksak ketika energi VQE konversi menuju nilai minimum yang seharusnya adalah sama dengan solusi eksak klasik.
ja_jp: 最後に、上記の問題は古典的な手法で容易に解くことができるので、 NumPyMinimumEigensolver を用いて厳密解を計算しておきます。このようにすることで、 VQE によってエネルギーが古典的な厳密解である最小値へ収束していく過程において、厳密解との差をプロットすることができるようになります。
ko_kr: 마지막으로 위의 문제는 여전히 고전적으로 다루기 쉬우므로 NumPyMinimumEigensolver를 사용하여 솔루션에 대한 참조 값을 계산할 수 있다. 이제 에너지가 VQE에 수렴하며 고전적인 정확해(exact solution) 인 최소값으로 이동함에 따라, 이 최소값과 도출된 정확해(exact solution) 의 차이를 그릴 수 있다.
pt_br: Por fim, uma vez que o problema acima ainda é facilmente tratável classicamente podemos utilizar o NumPyMinimumEigensolver para computar um valor de referência para a solução. Podemos agora representar graficamente a diferença da solução exata resultante à medida que a energia converge com o VQE em direção ao valor mínimo que deveria ser aquela solução clássica exata.
ru_ru: В завершение, поскольку приведенная выше задача все еще легко решаема классически, мы можем использовать NumPyMinimumEigensolver для вычисления контрольного значения для найденного решения. Теперь мы можем построить график отличия от полученного точного решения, так как энергия сходится с VQE к минимальному значению, которое должно быть точным классическим решением.
ta_in: இறுதியாக மேலே உள்ள சிக்கல் இன்னும் எளிதில் பிரிக்கக்கூடியதாக இருப்பதால், தீர்வுக்கான குறிப்பு மதிப்பைக் கணக்கிட NumPyMinimumEigensolver ஐப் பயன்படுத்தலாம். ஆற்றல் துல்லியமான கிளாசிக்கல் தீர்வாக இருக்க வேண்டிய குறைந்தபட்ச மதிப்பை நோக்கி VQE உடன் ஒன்றிணைவதால், இதன் விளைவாக வரும் சரியான தீர்விலிருந்து வேறுபாட்டை நாம் இப்போது திட்டமிடலாம்.
tr_tr: Son olarak, yukarıdaki sorun klasik olarak hala kolayca izlenebilir olduğu için çözüme uygun bir referans değeri hesaplamak için NumPyMinimumEigensolver kullanabiliriz. Şimdi, enerji VQE ile tam olarak klasik çözüm olması gereken minimum değere doğru yakınsarken ortaya çıkan kesin çözümden farkı çizebiliriz.
vi_vn: Cuối cùng, do bài toán trên dễ dàng giải được một cách cổ điển, ta có thể sử dụng NumPyMinimumEigensolver để tính giá trị tham chiếu (reference) cho nghiệm tìm được. Bây giờ, ta có thể vẽ sự khác biệt từ nghiệm chính xác cuối cùng khi năng lượng hội tụ với VQE tới giá trị cực tiểu thu được với nghiệm cổ điển chính xác.
zh_tw: 最後，由於上述問題仍很容易被追踪，因此我們可以使用 NumPyMinimumEigensover 來計算解決方案的參照值。 我們現在可以根據產生的精確解決方案來繪製不同的解決方案，因為能量會與 VQE 轉換成最小的值，而這應該是精確的經典解決方案。

source: Using Gradient framework
bn_bn: নতিমাত্রার কাঠামো ব্যবহার করে
es_un: Utilizando la estructura del Gradiente
fr_fr: Utilisation de l'infrastructure Gradient
id_id: Menggunakan Kerangka Gradien
ja_jp: 勾配フレームワークの利用
ko_kr: 점진적인 프레임워크(Gradient framework) 사용하기
pt_br: Usando o framework Gradient
ru_ru: Использование градиентного метода
ta_in: கிரேடியெண்ட் வரைபடத்தை பயன்படுத்தி
tr_tr: Gradyan yapısını kullanma
vi_vn: Sử dụng Gradient framework
zh_tw: 使用 Gradient 架構

source: Qiskit now has a Gradient framework as part of the Operator capability. With the gradient computed for the optimizer we now see just the optimization steps themselves.
es_un: Qiskit ahora tiene una estructura de gradiente cómo parte del las capacidades del Operador. Con el gradiente calculado para el optimizador, ahora podemos ver solo los pasos de optimización.
fr_fr: Qiskit dispose désormais d'une structure Gradient dans le cadre de la fonctionnalité Opérateur. Avec le gradient calculé pour l'optimiseur, nous ne voyons maintenant que les étapes d'optimisation elles-mêmes.
id_id: Qiskit sekarang memiliki kerangka gradien sebagai bagian dari kapabilitas Operator. Dengan gradien yang dihitung untuk optimizer kita barusan sekarang melihat langkah-langkah optimasi sendiri.
ja_jp: Qiskitには、 Operator 機能の一部として Gradient フレームワークがあります。オプティマイザー用に計算された勾配によって、最適化ステップそのものを可視化することができます。
ko_kr: 이제 Qiskit은 오퍼레이터 기능의 일부로서 점진적인 프레임워크를 갖는다. 최적화 계산된 기울기를 사용하여 이제 최적화 단계 자체만 볼 수 있습니다.
pt_br: O Qiskit agora tem um framework Gradient como parte das funcionalidades de Operator. Com o gradiente calculado para o otimizador vemos agora apenas os próprios passos da otimização.
vi_vn: Qiskit hiện nay có Gradient framework như một phần của Operator capability. Với gradient tính từ optimizer ta có thể quan sát các bước tối ưu.

source: Monitoring via the logging
bn_bn: লগিংয়ের সাহায্যে নিরীক্ষণ করা
es_un: Monitoreo a través de los registros
fr_fr: Surveillance via la journalisation
id_id: Pemantauan melalui logging
ja_jp: ログによるモニタリング
ko_kr: 로깅(logging) 을 통한 모니터링
pt_br: Monitoramento via registro (logging)
ru_ru: Наблюдение с помощью протоколирования
ta_in: பதிவு வழியாக கண்காணித்தல்
tr_tr: Günlük tutma yoluyla izleme
vi_vn: Giám sát thông qua logging
zh_tw: 透過登錄表來監測

source: Much of the code is instrumented with `Python logging <https://docs.python.org/3/library/logging.html>`__ statements. The logging is configurable to adjust level of logging etc. An easy way to enable logging in the ``qiskit.aqua`` module is to run the following code, where here we set the logging level to ``INFO``
es_un: Mucho del código esta instrumentado con sentencias de `Python logging <https://docs.python.org/3/library/logging.html>`__. El "logging" es configurable para ajustar el nivel de registro de datos etc. Una manera fácil de habilitar el logging en el modulo de ``qiskit.aqua`` es correr el siguiente código, donde ponemos en nivel de registro de datos a ``INFO``
fr_fr: Une grande partie du code est instrumentalisée avec des instructions `Python logging <https://docs.python.org/3/library/logging.html>`__. La journalisation est configurable pour ajuster le niveau de détails, etc. Un moyen facile d'activer la journalisation dans le module ``qiskit.aqua`` est d'exécuter le code suivant, où nous définissons ici le niveau de journalisation à ``INFO``
id_id: Sebagian banyak kode instruksi logging melalui `Python logging <https://docs.python.org/3/library/logging.html>`__. Logging ini bisa dikonfigurasi menyesuaikan levelnya dsb. Cara mudah untuk memungkinkan logging di module ``qiskit.aqua`` adalah dengan menjalankan kode dibawah, dimana level logging di set ``INFO``
ja_jp: コードの多くは、 `Python logging <https://docs.python.org/3/library/logging.html>`__ ログが取られています。ロギングのレベルなどを調整するために、ロギングの設定を行うことができます。 ``qiskit.aqua`` モジュールでロギングを有効にする簡単な方法は、以下のコードを実行することです。ここでは、ロギングのレベルを ``INFO`` に設定します。
ko_kr: 이 코드의 대부분은 `Python logging <https://docs.python.org/3/library/logging.html>`__ 문을 사용하여 진단하고 추적할 수 있다. 로깅 시에는 로깅 레벨 등을 조정하도록 구성할 수 있다. ``qiskit.aqua`` 모듈에서 로깅을 시작하고자 할 때는 다음의 코드를 실행하여 쉽게 시작할 수 있다. 여기서 우리는 로깅 레벨을 ``INFO`` 로 설정한다.
pt_br: Grande parte do código é instrumentado com declarações `Python logging <https://docs.python.org/3/library/logging.html>`__. O logging é configurável para ajustar o nível de logging, etc. Uma maneira fácil de ativar o logging no módulo ``qiskit.aqua`` é executar o código a seguir, onde aqui definimos o nível de logging como ``INFO``
vi_vn: Phần lớn mã được thiết kế với ` Python logging <https://docs.python.org/3/library/logging.html>` __ statements. Logging có thể cấu hình để điều chỉnh mức v.v... Một cách dê ̃ dàng để kích hoạt logging trong ̀ Qiskit.aqua ` ` mô-đun là chạy mã sau đây, ở đây chúng tôi đặt mức logging là ` ` INFO ` `

source: and at INFO level logging VQE will include information on the evaluations, as below.
bn_bn: এবং INFO স্তরে লগিং ভি কিউ ই নীচের হিসাবে মূল্যায়নের তথ্য অন্তর্ভুক্ত করবে।
es_un: y al nivel INFO el logging del VQE incluirá información sobre las evaluaciones, como es mostrado en seguida.
fr_fr: et au niveau de journalisation INFO, VQE inclura des informations sur les évaluations d'énergie, comme ci-dessous.
id_id: dan di INFO level logging dari VQE akan berisi informasi dari evaluasi, seperti dibawah.
ja_jp: また INFO レベルのロギングでは、 VQE は評価に関する以下のような情報を含んでいます。
ko_kr: 그리고 INFO level logging에서, VQE는 아래와 같이 평가들에 대한 정보를 포함할 것이다.
pt_br: e com logging no nível INFO o VQE incluirá informações sobre as avaliações, como abaixo.
ru_ru: и на уровне INFO ведение журнала VQE будет включать в себя информацию об оценках, как показано ниже.
ta_in: மற்றும் INFO அளவு லோகிங் VQE இன் மதிப்பீடுகளின் தகவல்களை கீழே உள்ளடக்குகிறது.
tr_tr: ve INFO düzeyinde VQE günlük kaydı, değerlendirmelere ilişkin bilgileri aşağıdaki gibi içerecektir.
vi_vn: và tại mức logging INFO, VQE sẽ bao gồm thông tin của các đánh giá như dưới đây.
zh_tw: 而在 INFO 層次記載 VQE，將包括評估的相關資訊，如下。

source: This notebook demonstrates using Qiskitâ€™s VQE algorithm to plot graphs of the convergence path to ground state energy with a selected set of optimizers.
id_id: Notebook ini mendemonstrasikan penggunaan algoritma VQE dari Qiskit untuk plot grafik jalur konvergensi ke energi keadaan dasar dengan set yang dipilih dari pengoptimisasi.

source: Variational algorithms in Qiskit, like `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.VQE.html>`__ and `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.QAOA.html>`__, provide the option for a user to give a callback method that can be used to monitor optimization progress as the algorithm runs and converges to the minimum. The callback is invoked for each functional evaluation by the optimizer and provides the current optimizer value, evaluation count, current optimizer parameters etc. Note that, depending on the specific optimizer this may not be each iteration (step) of the optimizer, so for example if the optimizer is calling the cost function to compute a finite difference based gradient this will be visible via the callback.
bn_bn: Qiskit এর পরিবর্তনশীল (ভ্যারিয়েশনাল) অ্যালগোরিথম ​, যেমন `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.VQE.html>`__ এবং `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.QAOA.html>`__ ব্যবহারকারী কে এই বিকল্প প্রদান করে যে যেভাবে অ্যালগোরিথম অনুকূলকরণ (অপটিমাইজার) অগ্রসর করে সর্বনিম্ন মানের দিকে একত্রিত হ​য় সেটি তারা একটি কলব্যাক প্রক্রিয়ার সাহায্যে নিরীক্ষণ করতে পারে। এই কলব্যাকটি অনুকূলায়কের প্রতিটি কার্যকারী মূল্যায়নের জন্য আহ্বান করা হ​য়​, এবং এটি অনুকূলায়কের বর্তমান মান​, মূল্যায়নের সংখ্যা, বর্তমান অনুকূলায়ক পরামিতি ইত্যাদি প্রদান করে। দ্রষ্টব্য​, কোন নির্দিষ্ট অনুকূলায়কের জন্য এটি প্রতিটি ধাপের জন্য নাও হতে পারে, যেমন অনুকূলায়কটি যদি সীমাবদ্ধ পার্থক্য ভিত্তিক নতিমাত্রা গণনা করার জন্য কস্ট ফাংশানকে ডাকে, তবে তা কলব্যাকের সাহায্যে দেখা যাবে।
ru_ru: Вариационные алгоритмы в Qiskit, такие как `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.VQE.html>`__ и `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.QAOA.html>`__, предоставляют пользователю возможность задать функцию обратного вызова, которая может быть использована для отслеживания хода оптимизации по мере выполнения алгоритма и сходимости его к минимуму. Обратный вызов выполняется для каждой функциональной оценки алгоритмом оптимизации и предоставляет текущее значение функции оптимизации, количество оценок, текущие параметры оптимизации и т.д. Обратите внимание, что в зависимости от конкретного алгоритма оптимизации это может быть не каждая итерация (шаг) алгоритма, поэтому, например, если алгоритм вызывает функцию потерь для вычисления градиента на основе метода конечных разностей, это будет видно через обратный вызов.
ta_in: `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.VQE.html>`__ மற்றும் `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.QAOA.html>`__ போன்ற Qiskit ல் உள்ள மாறுபட்ட வழிமுறைகள், ஒரு பயனர் ஒரு அழைப்பு முறையை வழங்குவதற்கான விருப்பத்தை வழங்கவும், இது வழிமுறை இயங்குவதோடு குறைந்தபட்சமாக மாறும்போது தேர்வுமுறை முன்னேற்றத்தைக் கண்காணிக்கப் பயன்படுகிறது. ஒவ்வொரு செயல்பாட்டு மதிப்பீட்டிற்கும் உகப்பாக்கி மூலம் அழைப்பு திரும்ப அழைக்கப்படுகிறது மற்றும் தற்போதைய உகப்பாக்கி மதிப்பு, மதிப்பீட்டு எண்ணிக்கை, தற்போதைய உகப்பாக்கி அளவுருக்கள் போன்றவற்றை வழங்குகிறது. குறிப்பிட்ட உகப்பாக்கியைப் பொறுத்து இது உகப்பாக்கியின் ஒவ்வொரு மறு செய்கை (படி) ஆக இருக்காது, எனவே ஒரு வரையறுக்கப்பட்ட வேறுபாடு அடிப்படையிலான சாய்வைக் கணக்கிடுவதற்கு உகப்பாக்கி செலவுச் செயல்பாட்டை அழைத்தால், இது திரும்பப்பெறுதல் வழியாகத் தெரியும்.
tr_tr: Qiskit'te `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__ ve `QAOA <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QAOA.html>`__ gibi değişimsel algoritmalar, bir kullanıcıya, algoritma çalışırken ve minimuma yaklaşırken optimizasyon ilerlemesini izlemek için kullanılabilecek bir geri arama yöntemi verme seçeneği sağlar. Geri çağırma, optimize edici tarafından her bir fonksiyonel değerlendirme için çağrılır ve mevcut optimizasyon değerini, değerlendirme sayısını, mevcut optimizasyon parametrelerini vb. sağlar. Belirli bir optimize ediciye bağlı olarak, bunun optimize edicinin her yinelemesi (adımı) olmayabileceğini unutmayın, bu nedenle örneğin, optimize edici sonlu bir farka dayalı gradyan hesaplamak için maliyet işlevini çağırıyorsa, bunu geri arama yoluyla gözlemlenebilir.
zh_tw: Qiskit 中的變分演算法(如 `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.VQE.html>`__ 和 `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.QAOA.html>`__)提供了一個選項給使用者，可用來監視最佳化進度的回呼方法，隨著演算法運算並收斂到其最小值。最佳化器會呼叫每一個功能評估的回呼，並提供現行最佳化器的數值、評估計數、現行最佳化器參數等。請注意，視特定最佳化器而定，這可能不是最佳化器的每一個反覆運算(步驟)，例如，如果最佳化器呼叫成本函數來計算有限差異型的梯度，則會透過回呼來顯示此值。

source: First we create a qubit operator for VQE. Here we will use the same operator as used in the algorithms introduction, which was originally computed by Qiskit Nature for an H2 molecule.
bn_bn: প্রথমে আমরা ভি.কিউ.ই-র জন্যে একটি কিউবিট অপারেটর তৈরি করি। অ্যালগরিদম অধ্যায়ের ভূমিকাতে Qiskit Chemistry দ্বারা হাইড্রোজেন অণুর জন্যে পাওয়া অপারেটরটি এখানে আমরা ব্যবহার করবো।
ru_ru: Сначала мы создадим оператор кубита для VQE. Здесь мы будем использовать тот же оператор, что и во введении к алгоритмам, который был первоначально вычислен с помощью Qiskit Nature для молекулы H2.
ta_in: முதலில் நாம் VQE க்காக ஒரு க்யூபிட் ஆபரேட்டரை உருவாக்குகிறோம். வழிமுறைகளின் அறிமுகத்தில் பயன்படுத்தப்பட்ட அதே ஆபரேட்டரை இங்கே பயன்படுத்துவோம், இது முதலில் H2 மூலக்கூறுக்கு Qiskit Nature வேதியியலால் கணக்கிடப்பட்டது.
tr_tr: İlk önce VQE için bir kübit operatörü oluşturuyoruz. Burada, bir Hidrojen molekülü için orijinal olarak Qiskit Nature tarafından hesaplanan, algoritmalara girişte kullanılan operatörün aynısını kullanacağız.
zh_tw: 首先，我們會建立 VQE 的量子位元算子。在這裡，我們將使用演算法簡介中使用的相同算子，這原本是通過 Qiskit Nature 為了計算的 H2 分子的算子。

source: Qiskit now has a Gradient framework as part of the Opflow capability. With the gradient computed for the optimizer we now see just the optimization steps themselves.
bn_bn: কিসকিটের এখন Opflow সামর্থ্যের অংশ হিসাবে একটি নতিমাত্রা (গ্রেডিয়েন্ট) কাঠামো রয়েছে। অনুকূলায়ক এর (অপ্টিমাইজারের) জন্য নতিমাত্রা (গ্রেডিয়েন্ট)- র সাথে গণনা করে আমরা এখন কেবলমাত্র অনুকূলকরণ (অপটিমাইজার) এর পদক্ষেপগুলি দেখতে পাচ্ছি।
ru_ru: Qiskit теперь имеет градиентную схему как часть возможности Opflow. Вычислив градиент для оптимизатора, мы теперь видим только сами шаги оптимизации.
ta_in: ஆபரேட்டர் திறனின் ஒரு பகுதியாக Qiskit இப்போது ஒரு சாய்வு கட்டமைப்பைக் கொண்டுள்ளது. ஆப்டிமைசருக்காக கணக்கிடப்பட்ட சாய்வு மூலம், இப்போது தேர்வுமுறை தங்களைத் தாங்களே காண்கிறோம்.
tr_tr: Qiskit artık Opflow yeteneğinin bir parçası olarak bir Gradient çerçevesine sahiptir. Optimize edici için hesaplanan gradyan ile artık sadece optimizasyon adımlarını görüyoruz.
zh_tw: Qiskit 現在有一個 Gradient 架構，作為 Opflow 功能的一部分。由於優化器的梯度已經計算好，我們現在只會看到最佳化步驟本身。

source: Much of the code is instrumented with `Python logging <https://docs.python.org/3/library/logging.html>`__ statements. The logging is configurable to adjust level of logging etc. Here we set the logging level to ``INFO``
bn_bn: বেশিরভাগ কোডটি পাইথন লগিং <https://docs.python.org/3/library/logging.html> `__ বিবৃতি দিয়ে চালিত হয়। লগিং ইত্যাদির স্তর সমন্বয় করার জন্ লগিংয কনফিগার যোগ্য। এখানে আমরা লগিং স্তরটিকে `` INFO`` তে সেট করি
ru_ru: Большая часть кода оснащена отчётами `Python logging <https://docs.python.org/3/library/logging.html>`__. Запись в журнал настраивается для настройки уровня протоколирования и т.д. Здесь мы установили уровень ведения отчета ``INFO``
ta_in: குறியீட்டின் பெரும்பகுதி `பைதான் பதிவு `Python logging <https://docs.python.org/3/library/logging.html>`__ அறிக்கைகளுடன் கருவியாக உள்ளது. பதிவுசெய்தல் அளவை சரிசெய்ய உள்நுழைவு கட்டமைக்கப்படுகிறது. இங்கே நாம் பதிவு நிலையை ``INFO`` என அமைத்துள்ளோம்
tr_tr: Kodun çoğu `Python logging <https://docs.python.org/3/library/logging.html>`__ ifadeleriyle donatılmıştır. Günlüğe kaydetme, günlüğe kaydetme düzeyi vb. ayarlamak için yapılandırılabilir. Burada günlük düzeyini ``INFO`` olarak ayarlıyoruz.
zh_tw: 大部分程式碼裝載了 `Python 記載 <https://docs.python.org/3/library/logging.html>`__ 陳述。 其記載是可配置的，以調整記載層次等。 在這裡，我們將記載層次設為 ``INFO``

source: INFO:qiskit.algorithms.minimum_eigen_solvers.vqe:Energy evaluation returned [-1.07392554] - 116.41884 (ms), eval count: 1 INFO:qiskit.algorithms.minimum_eigen_solvers.vqe:Energy evaluation returned [-1.43698938] - 4.05884 (ms), eval count: 2 INFO:qiskit.algorithms.minimum_eigen_solvers.vqe:Energy evaluation returned [-1.74596698] - 7.40194 (ms), eval count: 3 INFO:qiskit.algorithms.minimum_eigen_solvers.vqe:Energy evaluation returned [-1.75399268] - 6.61016 (ms), eval count: 4
ta_in: INFO:qiskit.algorithms.minimum_eigen_solvers.vqe:Energy மதிப்பீடு வெளியீடு [-1.07392554] - 116.41884 (ms), eval count: 1 INFO:qiskit.algorithms.minimum_eigen_solvers.vqe:Energy மதிப்பீடு வெளியீடு [-1.43698938]- 4.05884 (ms) eval count: 2 INFO:qiskit.algorithms.minimum_eigen_solvers.vqe:Energy மதிப்பீடு வெளியீடு [-1.74596698] - 7.40194 (ms), eval count: 3 INFO:qiskit.algorithms.minimum_eigen_solvers.vqe:Energy மதிப்பீடு வெளியீடு [-1.75399268] - 6.61016 (ms), eval count: 4
tr_tr: INFO:qiskit.algorithms.minimum_eigen_solvers.vqe:Enerji değerlendirmesi geri döndü [-1.07392554] - 116.41884 (ms), değerlendirme sayısı: 1 INFO:qiskit.algorithms.minimum_eigen_solvers.vqe:Enerji değerlendirmesi geri döndü [-1.43698938] - 4.05884 (ms), değerlendirme sayısı: 2 INFO:qiskit.algorithms.minimum_eigen_solvers.vqe:Enerji değerlendirmesi döndürüldü [-1.74596698] - 7.40194 (ms), değerlendirme sayısı: 3 INFO:qiskit.algorithms.minimum_eigen_solvers.vqe:Enerji geri döndürüldü [-1.75399268] - 6.61016 (ms), değerlendirme sayısı: 4
