Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/02_vqe_advanced_options.po
Languages: de, es_un, fr, ja_jp, ko_kr, pl, pt_un, ta, te, tr_tr

source: In the first algorithms tutorial, you learned how to set up a basic `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>`__ algorithm. Now, you will see how to provide more advanced configuration parameters to explore the full range of capabilities of Qiskit's variational algorithms: `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>`__, `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.QAOA.html>`__ and `VQD <https://qiskit.org/documentation/stubs/qiskit.algorithms.eigensolvers.VQD.html>`__ among others. In particular, this tutorial will cover how to set up a ``callback`` to monitor convergence and the use of custom ``initial point``\ s and ``gradient``\ s.
pl: Po przejściu przez pierwszy poradnik dotyczący algorytmów, wiesz już jak utworzyć podstawowy algorytm `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>`__. Tym razem dowiesz się, jak stworzyć bardziej zaawansowane parametry konfiguracji, aby odkryć pełen wachlarz możliwości algorytmów zmiennych w Qiskit, między innymi `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>`__, `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.QAOA.html>`__ i `VQD <https://qiskit.org/documentation/stubs/qiskit.algorithms.eigensolvers.VQD.html>`__. Ten poradnik obejmuje w szczególności to, jak skonfigurować ``callback``, by monitorować zbieżność i użycie spersonalizowanych ``initial point``/-ów i ``gradient``/-ów.
pt_un: No primeiro tutorial de algoritmos, você aprendeu como configurar um algoritmo básico `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>`__. Agora, você verá como fornecer parâmetros de configuração mais avançados para explorar toda a gama de recursos dos algoritmos variacionais do Qiskit: `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>` __, `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.QAOA.html>`__ e `VQD <https://qiskit.org/documentation/stubs/qiskit.algorithms.eigensolvers.VQD.html>`__ entre outros. Em particular, este tutorial explicará como configurar um ``callback`` para monitorar a convergência e o uso de ``ponto inicial``\ s e ``gradiente``\ s personalizados.
te: మొదటి అల్గారిథమ్‌ల ట్యుటోరియల్‌లో, మీరు ప్రాథమిక `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>`__ అల్గారిథమ్‌ని ఎలా సెటప్ చేయాలో నేర్చుకున్నారు. ఇప్పుడు, Qiskit యొక్క వైవిధ్య అల్గారిథమ్‌ల యొక్క పూర్తి స్థాయి సామర్థ్యాలను అన్వేషించడానికి మరింత అధునాతన కాన్ఫిగరేషన్ పారామితులను ఎలా అందించాలో మీరు చూస్తారు: `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>`__, `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.QAOA.html>`__ మరియు `VQD <https://qiskit.org/documentation/stubs/qiskit.algorithms.eigensolvers.VQD.html>`__ ఇతరులలో. ప్రత్యేకించి, ఈ ట్యుటోరియల్ కన్వర్జెన్స్‌ను పర్యవేక్షించడానికి ``కాల్‌బ్యాక్``ని ఎలా సెటప్ చేయాలో మరియు కస్టమ్ ``ఇనిషియల్ పాయింట్``\ లు మరియు ``గ్రేడియంట్``\ లను ఎలా సెటప్ చేయాలో వివరిస్తుంది.

source: You are now ready to compare a set of optimizers through the ``VQE`` callback. The minimum energy of the H2 Hamiltonian can be found quite easily, so the maximum number of iterations (``maxiter``) does not have to be very large. You can once again use ``TwoLocal`` as the selected trial wavefunction (i.e. ansatz).
pl: Teraz możesz porównać zestawy optymalizatorów za pomocą callbacku ``VQE``. Minimalną wartość hamiltonianu energii H2 można łatwo uzyskać, więc maksymalna liczba iteracji (``maxiter```) nie musi być bardzo duża. Możesz po raz kolejny użyć ``TwoLocal`` jako wybranej próbnej funkcji falowej (czyli ansatz).
pt_un: Agora você pode comparar um conjunto de otimizadores através do callback ``VQE``. A energia mínima do hamiltoniano H2 pode ser encontrada facilmente, então o número máximo de iterações (``maxiter``) não precisa ser muito grande. Você pode mais uma vez usar ``TwoLocal`` como a função de onda de teste selecionada (ou seja, ansatz).
te: మీరు ఇప్పుడు ``VQE`` కాల్‌బ్యాక్ ద్వారా ఆప్టిమైజర్‌ల సెట్‌ను సరిపోల్చడానికి సిద్ధంగా ఉన్నారు. H2 హామిల్టోనియన్ యొక్క కనిష్ట శక్తిని చాలా సులభంగా కనుగొనవచ్చు, కాబట్టి గరిష్ట సంఖ్యలో పునరావృత్తులు (``maxiter``) చాలా పెద్దదిగా ఉండవలసిన అవసరం లేదు. మీరు ఎంచుకున్న ట్రయల్ వేవ్‌ఫంక్షన్‌గా (అంటే ansatz) మరోసారి ``TwoLocal``ని ఉపయోగించవచ్చు.

source: In Qiskit's variational algorithms, if the provided optimizer uses a gradient-based technique, the default gradient method will be finite differences. However, these classes include an option to pass custom gradients via the ``gradient`` parameter, which can be any of the provided methods within Qiskit's `gradient <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.html>`__ framework, which fully supports the use of primitives. This section shows how to use custom gradients in the VQE workflow.
pl: W algorytmach wariacyjnych Qiskit, jeśli podany optymalizator wykorzystuje technikę gradientową, domyślną metodą gradientu będzie metoda różnic skończonych. Jednak te klasy uwzględniają opcję przekazywania gradientów niestandardowych za pomocą parametru ``gradient``, poprzez dowolną z dostępnych metod w ramach gradientu Qiskit `gradient <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.html>` __, który w pełni wspiera korzystanie z elementów podstawowych. W tej sekcji przedstawiono sposób korzystania z gradientów niestandardowych w organizacji pracy VQE.
pt_un: Nos algoritmos variacionais do Qiskit, se o otimizador fornecido usar uma técnica baseada em gradiente, o método de gradiente padrão será o de diferenças finitas. No entanto, essas classes incluem uma opção para passar gradientes personalizados por meio do parâmetro ``gradient``, que pode ser qualquer um dos métodos fornecidos no framework `gradient <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.html>`__, que suporta totalmente o uso de primitivas. Esta seção mostra como usar gradientes personalizados no fluxo de trabalho do VQE.
te: Qiskit యొక్క వైవిధ్య అల్గారిథమ్‌లలో, అందించబడిన ఆప్టిమైజర్ గ్రేడియంట్-ఆధారిత సాంకేతికతను ఉపయోగిస్తే, డిఫాల్ట్ గ్రేడియంట్ పద్ధతి పరిమిత వ్యత్యాసాలను కలిగి ఉంటుంది.అయితే, ఈ తరగతులు ``గ్రేడియంట్`` పరామితి ద్వారా కస్టమ్ గ్రేడియంట్‌లను పాస్ చేసే ఎంపికను కలిగి ఉంటాయి, ఇది Qiskit యొక్క `గ్రేడియంట్ <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.html>`__ ఫ్రేమ్‌వర్క్‌లో అందించిన పద్ధతుల్లో ఏదైనా కావచ్చు, ఇది ఆదిమ పదాల వినియోగానికి పూర్తిగా మద్దతు ఇస్తుంది. VQE వర్క్‌ఫ్లో కస్టమ్ గ్రేడియంట్‌లను ఎలా ఉపయోగించాలో ఈ విభాగం చూపుతుంది.

source: You might wonder... *Why set a custom initial point?* Well, this option can come in handy if you have a guess for a reasonable starting point for the problem, or perhaps know information from a prior experiment.
pl: Możesz się zastanawiać… *Po co ustawiać niestandardowy punkt początkowy?* Otóż ta opcja może okazać się przydatna, jeśli podejrzewasz, gdzie może zaczynać się problem lub wiesz to z wcześniejszego eksperymentu.
pt_un: Você pode se perguntar… *Por que definir um ponto inicial personalizado?* Bem, essa opção pode ser útil se você tiver um palpite para um ponto de partida razoável para o problema ou tiver informações de um experimento anterior.
te: మీరు ఆశ్చర్యపోవచ్చు... *కస్టమ్ ప్రారంభ బిందువును ఎందుకు సెట్ చేయాలి?* సరే, మీరు సమస్యకు సహేతుకమైన ప్రారంభ స్థానం కోసం ఊహించినట్లయితే లేదా ముందస్తు ప్రయోగం నుండి సమాచారాన్ని తెలుసుకుంటే ఈ ఎంపిక ఉపయోగపడుతుంది.

source: To demonstrate this feature, let's look at the results from our previous VQE run:
pl: Aby zademonstrować tę funkcję, przyjrzyjmy się wynikom z poprzedniego uruchomienia VQE:
pt_un: Para demonstrar esse recurso, vejamos os resultados de nossa execução VQE anterior:
te: ఈ లక్షణాన్ని ప్రదర్శించడానికి, మా మునుపటి VQE రన్ నుండి ఫలితాలను చూద్దాం:

source: This can be particularly useful in cases where we have two closely related problems, and the solution to one problem can be used to guess the other's. A good example might be plotting dissociation profiles in chemistry, where we change the inter-atomic distances of a molecule and compute its minimum eigenvalue for each distance. When the distance changes are small, we expect the solution to still be close to the prior one. Thus, a popular technique is to simply use the optimal point from one solution as the starting point for the next step. There also exist more complex techniques, where we can apply extrapolation to compute an initial position based on prior solution(s) rather than directly use the prior solution.
pl: Może to być szczególnie pomocne w przypadkach, gdy mamy dwa ściśle powiązane problemy, a rozwiązanie jednego problemu może zostać wykorzystane do rozwiązania drugiego. Dobrym przykładem może być wykreślanie profili dysocjacji w chemii, gdzie zmieniamy odległości międzyatomowe cząsteczki i obliczamy jej wartość własną dla każdej odległości. Gdy zmiany odległości są niewielkie, spodziewamy się, że rozwiązanie będzie zbliżone do poprzedniego. Tak więc popularną techniką jest po prostu wykorzystanie optymalnego punktu z poprzedniego rozwiązania jako punktu wyjścia dla kolejnego kroku. Istnieją również bardziej złożone techniki, w których możemy zastosować ekstrapolację w celu obliczenia pozycji początkowej w oparciu o wcześniejsze rozwiązanie/-a zamiast bezpośrednio korzystać z poprzedniego rozwiązania.
pt_un: Isso pode ser particularmente útil nos casos em que temos dois problemas intimamente relacionados e a solução de um deles pode ser usada para adivinhar a do outro. Um exemplo pode ser traçar perfis de dissociação em química, onde alteramos as distâncias interatômicas de uma molécula e calculamos o autovalor mínimo para cada distância. Quando as mudanças na distância forem pequenas, esperamos que a solução ainda esteja próxima da anterior. Assim, uma técnica famosa é simplesmente usar o ponto ótimo de uma solução como ponto de partida para a próxima etapa. Também existem técnicas mais complexas, nas quais podemos aplicar a extrapolação para calcular uma posição inicial com base na(s) solução(ões) anterior(es) em vez de usar diretamente a solução anterior.
te: మనకు దగ్గరి సంబంధం ఉన్న రెండు సమస్యలు ఉన్న సందర్భాల్లో ఇది చాలా ఉపయోగకరంగా ఉంటుంది మరియు ఒక సమస్యకు పరిష్కారం మరొకదానిని ఊహించడానికి ఉపయోగించవచ్చు. రసాయన శాస్త్రంలో డిస్సోసియేషన్ ప్రొఫైల్‌లను ప్లాట్ చేయడం ఒక మంచి ఉదాహరణ, ఇక్కడ మేము అణువు యొక్క అంతర్-అణు దూరాలను మారుస్తాము మరియు ప్రతి దూరానికి దాని కనీస ఈజెన్‌వాల్యూని గణిస్తాము. దూరం మార్పులు చిన్నగా ఉన్నప్పుడు, పరిష్కారం ఇప్పటికీ మునుపటిదానికి దగ్గరగా ఉంటుందని మేము ఆశిస్తున్నాము. అందువల్ల, ఒక పరిష్కారం నుండి సరైన పాయింట్‌ను తదుపరి దశకు ప్రారంభ బిందువుగా ఉపయోగించడం అనేది ఒక ప్రసిద్ధ సాంకేతికత. మరింత సంక్లిష్టమైన పద్ధతులు కూడా ఉన్నాయి, ఇక్కడ మేము ముందస్తు పరిష్కారాన్ని నేరుగా ఉపయోగించకుండా ముందస్తు పరిష్కారం(ల) ఆధారంగా ప్రారంభ స్థానాన్ని గణించడానికి ఎక్స్‌ట్రాపోలేషన్‌ను వర్తింపజేయవచ్చు.
