Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/02_vqe_convergence.po
Languages: bn_bn, es_un, fr_fr, id_id, ja_jp, ko_kr, pt_br, ru_ru, ta_in, tr_tr, vi_vn, zh_tw

source: This page was generated from `tutorials/algorithms/02_vqe_convergence.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/algorithms/02_vqe_convergence.ipynb`__ -থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de ` tutorials/algorithms/02_vqe_convergence.ipynb ` __.
fr_fr: Cette page a été générée à partir de `tutorials/algorithms/02_vqe_convergence.ipynb`__.
id_id: Halaman ini dibuat dari `tutorials/algoritms/02_vqe_convergence.ipynb`__.
ja_jp: このページは `tutorials/algorithms/02_vqe_convergence.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/algorithms/02_vqe_convergence.ipynb`__ 로부터 생성되었다.
pt_br: Esta página foi gerada, a partir do `tutorials/algorithms/02_vqe_convergence.ipynb`__.
ru_ru: Страница создана на основе `tutorials/algorithms/01_algorithms_introduction.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/algorithms/02_vqe_convergence.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
tr_tr: Bu sayfa `tutorials/algorithms/02_vqe_convergence.ipynb`__ adresinden oluşturulmuştur.
vi_vn: Trang này được tạo ra từ `tutorials/algorithms/02_vqe_convergence.ipynb`__.
zh_tw: 此頁面是從 `tutorials/algorithms/02_vqe_convergence.ipynb`__ 所產生的。

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/02_vqe_convergence.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/02_vqe_convergence.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/02_vqe_convergence.ipynb>` _.
id_id: Jalankan secara interaktif di 'IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/02_vqe_convergence.ipynb>`_.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/02_vqe_convergence.ipynb>`_ でインタラクティブに実行します。
ko_kr: `IBM 퀀텀 랩 <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/02_vqe_convergence.ipynb>`_ 에서 대화식으로 실행하시오.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/02_vqe_convergence.ipynb>`_.
vi_vn: Chạy tương tác trong `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/02_vqe_convergence.ipynb>`_.

source: Monitoring VQE convergence
bn_bn: ভি কিউ ই এর এক-কেন্দ্রাভিমুখতা (কনভারজেন্স) নিরীক্ষণকরণ
es_un: Monitoreo de la convergencia de VQE
fr_fr: Surveillance de la convergence VQE
id_id: Pemantauan konvergensi VQE
ja_jp: VQE の収束性モニタリング
ko_kr: VQE 수렴 모니터링
pt_br: Monitorando a convergência do VQE
ru_ru: Контроль сходимости VQE
ta_in: VQE குவிதலைக் கண்காணித்தல்
tr_tr: VQE yakınsamasını izleme
vi_vn: Giám sát sự hội tụ của VQE
zh_tw: 觀察 VQE 收斂

source: Variational algorithms in Qiskit, like `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__ and `QAOA <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QAOA.html>`__, provide the option for a user to give a callback method that can be used to monitor optimization progress as the algorithm runs and converges to the minimum. The callback is invoked for each functional evaluation by the optimizer and provides the current optimizer value, evaluation count, current optimizer parameters etc. Note that, depending on the specific optimizer this may not be each iteration (step) of the optimizer, so for example if the optimizer is calling the cost function to compute a finite difference based gradient this will be visible via the callback.
es_un: Los algoritmos variacionales en Qiskit, cómo `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__ y `QAOA <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QAOA.html>`__, dan la opción al usuario de dar un método "callback" que puede ser utilizado para monitorear el progreso del algoritmo mientras este se corre y converge al valor mínimo. El callback es llamado para cada evaluación funcional del optimizador y devuelve el valor actual del optimizador, el conteo de evaluaciones, los parámetros del optimizador etc. Note que dependiendo en el optimizador especifico puede que esto no sea cada iteración (paso) del optimizador, por ejemplo, si el optimizador esta llamando a la función de costo para calcular un gradiente basado en diferencia finita, esto va a ser evidente atreves del callback.
fr_fr: Les algorithmes variationnels de Qiskit, tels que `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>` __ et `QAOA <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QAOA.html>` __, permettent à un utilisateur de fournir une méthode de rappel (callback) qui peut être utilisée pour surveiller la progression de l'optimisation lorsque l'algorithme s'exécute et converge vers le minimum. Le callback est appelé pour chaque évaluation fonctionnelle par l'optimiseur et fournit la valeur de l'optimiseur en cours, le nombre d'évaluations, les paramètres de l'optimiseur, etc. Notez que, selon l'optimiseur spécifique, il ne s'agit pas de chaque itération (étape) de l'optimiseur. Par exemple, si l'optimiseur appelle la fonction de coût pour calculer un gradient basé sur les différences finies, cela sera visible via le callback.
id_id: Algoritma variasional dalam Qiskit, seperti ` VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>` __ dan ` QAOA <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QAOA.html>` __, memberikan pilihan bagi pengguna untuk memberikan metode callback yang dapat digunakan untuk memantau kemajuan optimisasi ketika algoritma berjalan dan menuju ke minimum. Callback dipanggil untuk setiap evaluasi fungsional oleh optimizer dan menyediakan nilai optimizer saat itu, jumlah evaluasi, parameter optimizer saat itu dll. Perhatikan bahwa, tergantung pada spesifikasi optimizer ini mungkin tidak bisa pada setiap iterasi (langkah) dari optimizer, jadi misalnya jika optimizer memanggil fungsi cost untuk menghitung gradien berbasis finite difference ini akan terlihat melalui callback.
ja_jp: `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__ や `QAOA <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QAOA.html>`__ といった Qiskit における変分アルゴリズムでは、アルゴリズムが実行されて最小値に収束するまでの最適化の進捗状況を監視することができ、そのためのコールバックメソッドをユーザーに提供するオプションが用意されています。このコールバックは、オプティマイザ ーによる関数評価ごとに呼び出され、現在のオプティマイザーのパラメーターや関数値、評価回数などを返します。オプティマイザーによっては、これが各反復 (ステップ) ごとでない場合があることに注意してください。
ko_kr: `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__ 및 `QAOA <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QAOA.html>`__ 와 같은 변분 알고리즘(Variational algorithms)은 사용자에게 알고리즘이 실행되어 최소값으로 수렴할 때 최적화 진행 상황을 모니터링할 수 있는 콜백 메서트를 옵션으로 제공한다. 콜백은 옵티마이저에 의하여 각 functional evaluation 시 호출되며, 현재 옵티마이저의 값, 평가 횟수, 현재 옵티마이저의 매개 변수 등을 제공한다. 특정 옵티마이저에 따라 이는 각 반복 (단계)에 호출되는 것이 아닐 수 있음에 주의하라. 예를 들어, 만약 옵티마이저가 유한 차분 그래디언트를 계산하기 위해 비용 함수를 호출하면 콜백을 통해 확인할 수 있다.
pt_br: Algoritmos variacionais no Qiskit, como o `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__ e o `QAOA <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QAOA.html>`__, fornecem a opção do usuário dar um método de callback que pode ser usado para monitorar o progresso da otimização conforme o algoritmo é executado e converge para o mínimo. O callback é invocado para cada avaliação funcional pelo otimizador e fornece o valor atual do otimizador, a contagem da avaliação, os parâmetros otimizadores atuais, etc. Observe que, dependendo do otimizador específico isto pode não ser a cada iteração (step) do otimizador, portanto, por exemplo, se o otimizador estiver chamando a função de custo para computar um gradiente de diferença finita isso será visível via callback.
vi_vn: Thuật toán biến phân (variational) trong Qiskit như `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__ và `QAOA <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QAOA.html>`__, cung cấp lựa chọn cho người dùng một phương thức callback có thể dùng để giám sát quá trình tối ưu khi thuật toán chạy và hội tụ về cực tiểu. Callback được gọi đến cho mỗi đánh giá hàm với optimizer và cung cấp giá trị optimizer hiện tại, số lượng đánh giá, tham số đánh giá hiện tại optimizer parameters, vân vân. Chú ý rằng phụ thuộc vào optimizer cụ thể, nó có thể không là các bước lặp của optimizer, ví dụ nếu optimizer gọi hàm mất mát để tính gradient dựa trên sai phân hữu hạn, nó sẽ hiển thị được qua callback.

source: This notebook demonstrates using Qiskit’s VQE algorithm to plot graphs of the convergence path to ground state energy with a selected set of optimizers.
bn_bn: অনুকূলায়কের একটি নির্বাচিত সেটের সাহায্যে Qiskit এর ভি কিউ ই অ্যালগোরিথমের নিম্নতম শক্তির অবস্থার দিকে এককেন্দ্রাভিমুখতার লেখচিত্র এই নোটবুকটি প্রদর্শন করে।
es_un: Este cuaderno demuestra cómo utilizar el algoritmo VQE de Qiskit para generar gráficas de la ruta de convergencia a la energía de estado fundamental con un conjunto seleccionado de optimizadores.
fr_fr: Ce notebook montre l'utilisation de l'algorithme VQE de Qiskit pour tracer des graphiques du chemin de convergence vers l'énergie de l'état fondamental avec un ensemble sélectionné d'optimiseurs.
ja_jp: このノートブックでは Qiskit の VQE アルゴリズムを用いて、選択したオプティマイザーのセットによる基底エネルギーへの収束の様子を、グラフにプロットする方法を示します。
ko_kr: 이 노트북은 키스킷의 VQE 알고리즘을 사용하여 선택된 세트의 최적화 프로그램으로 접지 상태 에너지에 대한 수렴 경로 그래프를 구성하는 방법을 설명한다.
pt_br: Este notebook demonstra o uso do algoritmo VQE do Qiskit para desenhar gráficos do caminho de convergência para a energia do estado fundamental com um conjunto selecionado de otimizadores.
ru_ru: Этот блокнот демонстрирует использование алгоритма VQE от Qiskit для построения графиков траектории сходимости к энергии основного состояния с выбранным набором оптимизирующих алгоритмов.
ta_in: இந்த காட்சிப் புத்தகம் Qiskit's VQE படிமுறையை பயன்படுத்தி வரையறுக்கப்பட்ட பாதையை வரையறுக்கிறது.
tr_tr: Bu not defteri, seçilmiş bir dizi optimize edici ile temel durum enerjisine yakınsama yolunun grafiklerini çizmek için Qiskit’in VQE algoritmasını kullanmayı gösteriyor.
vi_vn: Notebook này minh họa sử dụng thuật toán VQE của Qiskit vẽ các đồ thị đường hội tụ đến trạng thái cơ bản với tập các optimizers được lựa chọn.
zh_tw: 此記事本示範使用 Qiskit的 VQE 演算法，以選定的一組最佳化參數來針對基態收斂的情形作圖。

source: First we create a qubit operator for VQE. Here we will use the same operator as used in the algorithms introduction, which was originally computed by Qiskit Chemistry for an H2 molecule.
es_un: Primero creamos un operador de qubit para VQE. Aquí vamos a utilizar el mismo operador utilizado en la introducción de algoritmos, que fue calculado originalmente por Qiskit Chemistry para una molécula H2.
fr_fr: Tout d'abord, nous créons un opérateur pour VQE. Ici nous utiliserons le même opérateur que celui qui a été utilisé dans l'introduction des algorithmes, et initialement calculé par Qiskit Chemistry pour une molécule H2.
id_id: Pertama kita buat operator qubit untuk VQE. Di sini kita menggunakan operator sama seperti pada perkenalan algoritma, yang aslinya dihitung dengan Qiskit Chemistry untuk molekul H2.
ja_jp: まず、 VQE用の量子ビット演算子を作成します。ここでは、アルゴリズム入門で用いたものと同じ演算子を使用します。この演算子は元々 H2 分子用に Qiskit Chemistry によって計算されたものです。
ko_kr: 먼저, VQE에 대한 큐비트 연산자를 만든다. 여기서는 앞서 키스킷의 알고리즘 소개에서 사용된 것과 동일한 (H2 분자에 대하여 원래 Qiskit Chemistry에서 계산된) 연산자를 사용할 것이다.
pt_br: Primeiro, criamos um operador de qubit para o VQE. Aqui, vamos usar o mesmo operador usado na introdução do algoritmo, que foi originalmente calculado pelo Qiskit Chemistry para uma molécula de H2.
vi_vn: Đầu tiên, ta tạo một toán tử qubit cho VQE. Ở đây, ta sẽ sử dụng toán tử như đã dùng ở phần giới thiệu thuật toán mà ban đầu được tính ở Qiskit Chemistry cho một phân tử H2.

source: We will show the callback usage below over a set of optimizers for comparison. The minimum energy of the H2 Hamiltonian can be found quite easily so we are able to set maxiters to a small value
bn_bn: তুলনার জন্য আমরা নীচে কলব্যাকের ব্যবহারটি অপ্টিমাইজারের (অনুকূলায়ক) একটি সেট দিয়ে দেখাব। H2 হ্যামিল্টনীয়ানের ন্যূনতম শক্তিটি খুব সহজেই পাওয়া যায় তাই আমরা maxiters কে একটি ছোট মান সেট করতে সক্ষম হয়েছি।
es_un: A continuación, mostraremos el uso del callback sobre un conjunto de optimizadores para comparar. La energía mínima del Hamiltoniano de H2 es fácil de encontrar por lo que podemos fijar maxiters —valor máximo de iteraciones— a un valor pequeño.
fr_fr: Nous allons montrer l'utilisation d'une fonction de rappel (callback) ci-dessous sur un ensemble d'optimiseurs afin de comparer. L'énergie minimale du Hamiltonien H2 peut être trouvée assez facilement, donc nous sommes en mesure de régler le paramètre maxiters à une petite valeur
id_id: Kita akan memperlihatkan penggunaan callback serperti di bawah ini terhadap satu set optimizer untuk perbandingan. Energi minimum Hamiltonian H2 dapat mudah ditemukan sehingga kita cukup mengatur maxiters ke nilai yang kecil
ja_jp: 比較するためのオプティマイザーのセットにおける、コールバックの使用法を以下に示します。 H2 ハミルトニアンの最小エネルギーは非常に容易に見つけることができるので、 maxiters を小さな値に設定することができます。
ko_kr: 비교를 위해 일련의 옵티마이저에 대한 콜백 사용법을 아래에서 확인할 수 있다. H2 Hamiltonian의 최소 에너지는 아주 쉽게 찾을 수 있으므로 맥시터(maxiters) 를 작은 값으로 설정할 것이다.
pt_br: Mostraremos o uso do callback abaixo sobre um conjunto de otimizadores para comparação. A energia mínima do Hamiltoniano do H2 pode ser encontrada bastante facilmente então podemos configurar maxiters para um valor pequeno.
ru_ru: Ниже мы покажем для сравнения использование обратного вызова для набора оптимизаторов. Минимальная энергия гамильтониана H2 может быть найдена довольно легко, поэтому мы можем установить maxiter на небольшое значение
ta_in: ஒப்பிடுவதற்கான உகப்பாக்கிகளின் தொகுப்பில் கீழே அழைப்பு பயன்பாட்டைக் காண்பிப்போம். H2 ஹாமில்டோனியனின் குறைந்தபட்ச ஆற்றலை மிக எளிதாகக் காணலாம், எனவே மாக்சிட்டர்களை ஒரு சிறிய மதிப்புக்கு அமைக்க முடியும்
tr_tr: Aşağıda, karşılaştırma için bir dizi optimize ediciler üzerinde geri arama kullanımını göstereceğiz. H2 Hamiltonyen'in minimum enerjisi gayet kolay bulunabilir, böylece maksiteri küçük bir değere ayarlayabiliriz
vi_vn: Ta sẽ biểu diễn việc sử dụng callback dưới đây qua một tập hợp các optimizers để so sánh. Giá trị cực tiểu năng lượng của Hamilton H2 có thể tìm được dễ dàng, do đó ta có thể đặt maxiters bằng một giá trị nhỏ
zh_tw: 我們將展示如何在一組最佳化參數中使用回呼法以進行比較。 這可以讓我們很容易地找到 H2 哈密頓量的最小能量，故能夠將 maxiters 設定為一個小數值

source: Now from the callback data we stored we can plot the energy value at each objective function call each optimizer makes. An optimizer using a finite difference method for computing gradient has that characteristic step like plot where for a number of evaluations it is computing the value for close by points to establish a gradient (the close by points having very similar values whose difference cannot be seen on the scale of the graph here).
bn_bn: এখন আমরা সঞ্চিত কলব্যাক তথ্য ( ডেটা ) থেকে, প্রতিটি অপটিমাইজার কল করে, আমরা প্রতিটি নৈর্ব্যক্তিক অন্বয় (অব্জেক্টিভ ফাংশন) এ শক্তি মান লেখচিত্র (প্লট) করতে পারি। গ্রেডিয়েন্টের কম্পিউটিংয়ের জন্য সীমাবদ্ধ পার্থক্য পদ্ধতি ব্যবহার করে একটি অনুকূলায়ক এর (অপ্টিমাইজারের) সেই প্লটের মতো বৈশিষ্ট্যযুক্ত ধাপ রয়েছে যেখানে অনেকগুলি মূল্যায়নের জন্য এটি নতিমাত্রা (গ্রেডিয়েন্ট) স্থাপনের জন্য পয়েন্ট দ্বারা কাছাকাছি মানের মান গণনা করা হয় (খুব সমান মানযুক্ত পয়েন্টগুলির সাথে কাছাকাছির পার্থক্য গ্রাফের স্কেল এ দেখা যায় না)।
es_un: Ahora, de la información que guardamos del callback, podemos graficar los valores de energía en los puntos en los que cada optimizador llama a la función objetivo. Un optimizador que usa el método de diferencia finita para encontrar el gradiente tiene la grafica que cambia cómo en pasos, donde para un numero de evaluaciones, está utilizando puntos cercanos para establecer un gradiente (los puntos cercanos que tienen valores muy similares para los cuales su diferencia no puede observarse en la escala de la gráfica aquí).
fr_fr: Maintenant, à partir des données de callback que nous avons stockées, nous pouvons tracer la valeur d'énergie à chaque appel de fonction objectif que chaque optimiseur fait. Un optimiseur utilisant une méthode de différence finie pour le calcul du gradient a ce tracé avec des plateaux caractéristique où, pour un certain nombre d'évaluations consécutives, il calcule la valeur d'énergie pour des points très proches (les points très proches ayant des valeurs d'énergie très similaires, la différence ne peut être vue sur l'échelle du graphique).
id_id: Sekarang dari data callback yang disimpan kita dapat plot nilai energi pada setiap panggilan fungsi objektif dari tiap optimizer. Optimizer menggunakan metode finite difference untuk komputasi gradien memiliki karakteristik seperti plot tangga di mana untuk sejumlah evaluasi komputasi nilai di sekitar titik-titik untuk meghitung gradien (titik yang dekat memiliki nilai yang mirip sehingga perbedaan tidak dapat dilihat pada skala grafik di sini).
ja_jp: 保存されたコールバック・データから、各オプティマイザーが行う目的関数の呼び出しごとのエネルギー値をプロットすることができます。勾配の計算に有限差分法を用いたオプティマイザーでは、勾配を得るために多くの評価では近くにある点の値を計算していて、プロットのように特徴的なステップを示します。 (近くにある点は非常に似た値をもち、その差を今回のグラフのスケールで見ることはできません。)
ko_kr: 이제 저장한 콜백 데이터에서 각 옵티마이저가 각각의 목적 함수를 호출하여 발생하는 에너지 값을 그려볼 수 있다. 유한 차분 방법을 사용하여 기울기를 계산하는 옵티마이저는 수 많은 평가에서 기울기를 설정하기 위해 가까운 지점에 대한 값을 계산하는 plot과 같은 특성 단계를 가진다. (여기 그래프의 눈금에서는 차이를 구별하기 힘들 정도로 매우 유사한 값을 가진 가까운 지점임)
pt_br: Agora a partir dos dados de callback que armazenamos podemos traçar o valor da energia em cada chamada da função objetiva que cada otimizador faz. Um otimizador usando um método de diferenças finitas para o cálculo do gradiente tem aquele gráfico com degraus característicos onde para várias avaliações ele está calculando o valor de pontos próximos para estabelecer um gradiente (os pontos próximos tendo valores muito semelhantes cuja diferença não pode ser vista na escala do gráfico aqui).
ru_ru: Теперь из сохраненных нами данных обратного вызова мы можем построить график значения энергии при каждом вызове целевой функции, который делает каждый оптимизатор (алгоритм оптимизации). Алгоритм оптимизации, использующий метод конечных разностей для вычисления градиента, имеет такой же характерный шаг, как и график, где для нескольких оценок он вычисляет значение для близких точек, чтобы установить градиент (близкие точки имеют очень похожие значения, разница которых не видна на масштабе графика).
ta_in: இப்போது நாங்கள் சேமித்த கால்பேக் தரவிலிருந்து ஒவ்வொரு உகப்பாக்கி செய்யும் ஒவ்வொரு புறநிலை செயல்பாடு அழைப்பிலும் ஆற்றல் மதிப்பைக் குறிக்கலாம். கம்ப்யூட்டிங் சாய்வுக்கான வரையறுக்கப்பட்ட வேறுபாடு முறையைப் பயன்படுத்தும் ஒரு உகப்பாக்கி சதி போன்ற சிறப்பியல்பு படி உள்ளது, அங்கு பல மதிப்பீடுகளுக்கு இது ஒரு சாய்வு நிறுவ புள்ளிகளுக்கு நெருக்கமான மதிப்பைக் கணக்கிடுகிறது (புள்ளிகளின் நெருக்கமான வேறுபாடுகளைக் காண முடியாத ஒத்த மதிப்புகளைக் கொண்ட புள்ளிகள் இங்கே வரைபடத்தின் அளவு).
tr_tr: Şimdi depoladığımız geri arama verilerinden, her bir eniyileştiricinin yaptığı her nesnel fonksiyondaki enerji değerini çizebiliriz. Gradyan hesaplaması için sonlu bir fark metodu kullanan en iyileştiricinin bir dizi değerlendirmeye uygun bir degrade oluşturmak için yakın noktaların değerini hesapladığı çizime benzer karakteristik adımları vardır (farkı buradaki grafiğin ölçeğinde görülemeyen çok benzer değerlere sahip noktalara yakın).
vi_vn: Bây giờ từ dữ diệu callback đã lưu, ta có thể vẽ giá trị năng lượng tại mỗi lần gọi hàm mục tiêu (objective function) mỗi optimizer tạo ra. Một optimizer sử dụng phương pháp sai phân hữu hạn để tính gradient có đường đặc trưng như đồ thị, trong đó với một số lượng các đánh giá, nó tính giá trị các điểm gần sát nhau để dựng gradient (các điểm gần sát nhau có giá trị rất gần nhau mà sai phân không thể nhìn đối với thang của đồ thị ở đây).
zh_tw: 現在，從我們儲存的回應資料中，我們可以在每個最佳化工具所呼叫的每個目標函數呼叫中繪製能量值。 一種用於計算梯度的有限差分方法的優化器具有特徵步驟，該特徵步驟包括針對多個評價的圖形，該特徵步驟計算出接近點以建立梯度（該點具有非常相似的值，其差無法在這裡的圖形的標度上被看到）。
