Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/02_vqe_advanced_options.po
Languages: de, es_un, fr, ja_jp, ko_kr, pl, pt_un, ta, te, tr_tr

source: This page was generated from `tutorials/algorithms/02_vqe_advanced_options.ipynb`__.
de: Diese Seite wurde aus `tutorials/circuits_advanced/1_advanced_circuits.ipynb`__ generiert.
es_un: Esta página fue generada a partir de `tutorials/algorithms/02_vqe_advanced_options.ipynb`__.
fr: Cette page a été générée à partir de `tutorials/algorithms/02_vqe_advanced.ipynb`__.
ja_jp: このページは `tutorials/algorithms/02_vqe_advanced_options.ipynb`__から生成されました。
ko_kr: 이 페이지는 `tutorials/algorithms/02_vqe_advanced_options.ipynb`__ 에서 생성되었다.
pl: Ta strona została wygenerowana z `tutorials/algorithms/02_vqe_advanced_options.ipynb`__.
pt_un: Esta página foi gerada, a partir do `tutorials/algorithms/02_vqe_advanced.ipynb`__.
ta: இந்தப் பக்கம் `tutorials/algorithms/04_vqe_advanced.ipynb`__ இல் இருந்து உருவாக்கப்பட்டது.
te: ఈ పేజీ `tutorials/algorithms/02_vqe_advanced_options.ipynb`__ నుండి రూపొందించబడింది.
tr_tr: Bu sayfa `tutorials/algorithms/02_vqe_advanced_options.ipynb`__ adresinden oluşturulmuştur.

source: Advanced VQE Options
de: Erweiterte WQE Einstellungen
es_un: Opciones Avanzadas de VQE
fr: Options Avancées de VQE
ja_jp: 高度なVQEオプション
pl: Ustawienia zaawansowane VQE
pt_un: Opções avançadas de VQE
ta: மேம்பட்ட VQE விருப்பங்கள்
te: అధునాతన VQE ఎంపికలు
tr_tr: Gelişmiş VQE Seçenekleri

source: In the first algorithms tutorial, you learned how to set up a basic `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>`__ algorithm. Now, you will see how to provide more advanced configuration parameters to explore the full range of capabilities of Qiskit’s variational algorithms: `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>`__, `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.QAOA.html>`__ and `VQD <https://qiskit.org/documentation/stubs/qiskit.algorithms.eigensolvers.VQD.html>`__ among others. In particular, this tutorial will cover how to set up a ``callback`` to monitor convergence and the use of custom ``initial point``\ s and ``gradient``\ s.
fr: Dans le premier tutoriel d'algorithmes, vous avez appris comment mettre en place un algorithme basique `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>`__. Maintenant, vous allez voir comment fournir des paramètres de configuration plus avancés pour explorer toute la gamme de capacités des algorithmes variationnels de Qiskit : `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>`__, `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.QAOA.html>`__ et `VQD <https://qiskit.org/documentation/stubs/qiskit.algorithms.eigensolvers.VQD.html>`__ entre autres. En particulier, ce tutoriel couvrira comment configurer un ``callback`` pour surveiller la convergence et l'utilisation des ``initial point``\ s personnalisés et des ``gradient``\ s.
ja_jp: 最初のアルゴリズムチュートリアルでは、基本的な `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>`__ アルゴリズムをどのように設定するかを学びました。`VQE`` <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>`__, `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.QAOA.html>`__, `VQD <https://qiskit.org/documentation/stubs/qiskit.algorithms.eigensolvers.VQD.html>`__ など、Qiskitの変分アルゴリズムの能力をフルに発揮するために、より高度な設定パラメーターの与え方をみていただきます。特に、収束を監視するための ``callback`` のセットアップ方法と、カスタム ``initial point`` と ``gradient`` の使用方法について説明します。
ta: முதல் அல்காரிதம் டுடோரியலில், அடிப்படை `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>`__ அல்காரிதம் அமைப்பது எப்படி என்பதை நீங்கள் கற்றுக்கொண்டீர்கள். இப்போது, Qiskit இன் மாறுபாடு அல்காரிதம்களின் முழு அளவிலான திறன்களை ஆராய்வதற்கான மேம்பட்ட உள்ளமைவு அளவுருக்களை எவ்வாறு வழங்குவது என்பதை நீங்கள் பார்க்கலாம்: `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.html>`. __, `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.QAOA.html>`__ மற்றும் `VQD <https://qiskit.org/documentation/stubs/qiskit.algorithms..VQD.html>`__ மற்றவற்றுடன். குறிப்பாக, ஒருங்கிணைப்பு மற்றும் தனிப்பயன் ``initial point``\ கள் மற்றும் ``gradient``\ களின் பயன்பாட்டைக் கண்காணிக்க ``callback`` அமைப்பது எப்படி என்பதை இந்த டுடோரியல் விவரிக்கும்.

source: Callback
es_un: Devolución de Llamada (Callback)
fr: Procédure de rappel (callback)
ja_jp: コールバック
ko_kr: 콜백
ta: திரும்பஅழை
te: కాలిబాక్
tr_tr: Geri çağırma

source: Callback methods can be used to monitor optimization progress as the algorithm runs and converges to the minimum. The callback is invoked for each functional evaluation by the optimizer and provides the current optimizer value, evaluation count, current optimizer parameters etc. Note that, depending on the specific optimizer this may not be each iteration (step) of the optimizer, so for example if the optimizer is calling the cost function to compute a finite difference based gradient this will be visible via the callback.
de: Rückrufmethoden können zur Überwachung der Optimierungsfortschritte verwendet werden, da der Algorithmus ausgeführt wird und auf das Minimum konvergiert. Der Callback wird für jede funktionale Auswertung durch das Optimierungsprogramm aufgerufen und stellt den aktuellen Optimierungsprogrammwert, die Auswertungsanzahl, die aktuellen Optimierungsparameter des Optimierungsprogramms usw. bereit. Beachten Sie, dass dies, abhängig vom jeweiligen Optimierungsprogramm, nicht jede Iteration (Schritt) des Optimierungsprogramms sein kann, so dass zum Beispiel, wenn das Optimierungsprogramm die Kostenfunktion aufruft, um einen endlichen Unterschied basierten Gradienten zu berechnen, dies über den Callback sichtbar ist.
es_un: Los métodos de devolución de llamada (callback) se pueden usar para monitorear el progreso de la optimización a medida que el algoritmo se ejecuta y converge al mínimo. El optimizador invoca la devolución de llamada para cada evaluación funcional y proporciona el valor actual del optimizador, el recuento de evaluaciones, los parámetros actuales del optimizador, etc. Ten en cuenta que, según el optimizador específico, es posible que no sea cada iteración (paso) del optimizador, por ejemplo, si el optimizador está llamando a la función de costo para calcular un gradiente basado en diferencias finitas, esto será visible a través de la devolución de llamada.
fr: Les méthodes de rappel peuvent être utilisées pour surveiller la progression de l'optimisation au fur et à mesure que l'algorithme s'exécute et converge au minimum. Le callback est appelé pour chaque évaluation fonctionnelle par l'optimiseur et fournit la valeur actuelle de l'optimiseur, le nombre d'évaluations, les paramètres actuels de l'optimiseur, etc. Notez que, selon l'optimiseur spécifique, cela peut ne pas être chaque itération (étape) de l'optimisateur, donc par exemple si l'optimiseur appelle la fonction coût pour calculer un gradient de différence finie, cela sera visible via le callback.
ja_jp: コールバック・メソッドを使用すると、アルゴリズムの実行と最小値への収束に伴い、最適化の進捗状況を監視することができます。コールバックは、オプティマイザーによる機能評価ごとに呼び出され、現在のオプティマイザー値、評価回数、現在のオプティマイザー・パラメータなどを提供します。特定のオプティマイザーによっては、オプティマイザーの各反復（ステップ）とは限らないので、例えば、オプティマイザーが有限差分ベースの勾配を計算するためにコスト関数を呼び出している場合、コールバックを通じてこれが見えるようになることに注意してください。
ko_kr: 콜백 메서드를 사용하여 알고리즘이 실행되고 최소값으로 수렴될 때 최적화 진행률을 모니터링할 수 있다. 콜백은 옵티마이저의 각 기능 평가에 대해 호출되며 현재 옵티마이저 값, 평가 카운트, 현재 옵티마이저 매개변수 등을 제공한다. 특정 옵티마이저에 따라 이 메서드는 옵티마이저의 각 반복(단계)이 아닐 수 있으므로, 예를 들어 옵티마이저 유한차 경사도를 계산하기 위해 비용 함수를 호출하는 경우 콜백을 통해 볼 수 있다.
pl: Callback może być używany do monitorowania postępu optymalizacji w trakcie gdy, algorytm się uruchamia i zbiega do minimum. Callback jest wykorzystywany przy każdej ocenie funkcjonalnej przeprowadzanej przez optymalizator i pokazuje aktualne wartości optymalizatora, liczbę ocen, bieżące parametry optymalizatora itp. Pamiętaj, że proces może się różnić w zależności od optymalizatora dla każdej iteracji (kroku). Jeśli optymalizator przykładowo wywoła funkcję kosztu w celu obliczenia gradientu opartego na skończonej różnicy to będzie to widoczne poprzez callback.
pt_un: Os métodos de callback podem ser usados para monitorar o progresso da otimização à medida que o algoritmo é executado e converge para o mínimo. O callback é invocado para cada avaliação funcional pelo otimizador e fornece o valor atual do otimizador, contagem de avaliação, parâmetros atuais do otimizador, etc. Observe que, dependendo do otimizador específico, pode não ser cada iteração (etapa) do otimizador, por exemplo se o otimizador estiver chamando a função de custo para calcular um gradiente baseado em diferença finita, isso será visível por meio do callback.
ta: அல்காரிதம் இயங்கும் மற்றும் குறைந்தபட்சமாக ஒன்றிணைவதால், தேர்வுமுறை முன்னேற்றத்தைக் கண்காணிக்க கால்பேக் முறைகள் பயன்படுத்தப்படலாம். ஆப்டிமைசரால் ஒவ்வொரு செயல்பாட்டு மதிப்பீட்டிற்கும் கால்பேக் செயல்படுத்தப்படுகிறது மற்றும் தற்போதைய உகப்பாக்கி மதிப்பு, மதிப்பீட்டு எண்ணிக்கை, தற்போதைய உகப்பாக்கி அளவுருக்கள் போன்றவற்றை வழங்குகிறது. குறிப்பிட்ட ஆப்டிமைசரைப் பொறுத்து இது ஆப்டிமைசரின் ஒவ்வொரு மறு செய்கை (படி) ஆக இருக்காது என்பதை நினைவில் கொள்ளவும். ஒரு வரையறுக்கப்பட்ட வேறுபாட்டின் அடிப்படையிலான சாய்வு கணக்கிடுவதற்கு உகப்பாக்கி செலவு செயல்பாட்டை அழைக்கிறது என்றால், இது திரும்ப அழைப்பின் மூலம் தெரியும்.
te: అల్గోరిథం నడుస్తుంది మరియు కనిష్ట స్థాయికి చేరినప్పుడు ఆప్టిమైజేషన్ పురోగతిని పర్యవేక్షించడానికి కాల్‌బ్యాక్ పద్ధతులు ఉపయోగించబడతాయి. ఆప్టిమైజర్ ద్వారా ప్రతి ఫంక్షనల్ మూల్యాంకనం కోసం కాల్‌బ్యాక్ ప్రారంభించబడుతుంది మరియు ప్రస్తుత ఆప్టిమైజర్ విలువ, మూల్యాంకన గణన, ప్రస్తుత ఆప్టిమైజర్ పారామితులు మొదలైన వాటిని అందిస్తుంది. నిర్దిష్ట ఆప్టిమైజర్‌పై ఆధారపడి ఇది ఆప్టిమైజర్ యొక్క ప్రతి పునరావృతం (దశ) కాకపోవచ్చు, కాబట్టి ఉదాహరణకు ఆప్టిమైజర్ పరిమిత వ్యత్యాస ఆధారిత గ్రేడియంట్‌ను గణించడానికి కాస్ట్ ఫంక్షన్‌ని పిలుస్తుంటే, ఇది కాల్‌బ్యాక్ ద్వారా కనిపిస్తుంది.
tr_tr: Geri çağırma metodları, algoritma çalışırken ve minimuma yaklaştıkça optimizasyon ilerlemesini izlemek için kullanılabilir. Geri çağırma, optimize edici tarafından her işlevsel değerlendirme için çağrılır ve mevcut optimize edici değerini, değerlendirme sayısını, mevcut optimize edici parametreleri vb. sağlar. Belirli optimize ediciye bağlı olarak bunun optimize edicinin her yinelemesi (adım) olmayabileceğini unutmayın; optimize edici, sonlu fark tabanlı bir gradyanı hesaplamak için maliyet işlevini çağırıyorsa, bu, geri çağırma aracılığıyla görünür olacaktır.

source: This section demonstrates how to leverage callbacks in ``VQE`` to plot the convergence path to the ground state energy with a selected set of optimizers.
de: Dieser Abschnitt zeigt, wie man Callbacks in ``VQE`` nutzen kann, um den Konvergenzpfad zur Grundzustandsenergie mit einem ausgewählten Satz von Optimierern zu plotten.
es_un: Esta sección demuestra cómo aprovechar las devoluciones de llamada en ``VQE`` para graficar la ruta de convergencia a la energía del estado fundamental con un conjunto seleccionado de optimizadores.
fr: Cette section montre comment tirer parti des callbacks dans ``VQE`` pour tracer le chemin de convergence vers l'énergie de l'état fondamental avec un ensemble sélectionné d'optimiseurs.
ja_jp: このセクションでは、``VQE`` のコールバックを利用して、選択したオプティマイザーのセットで基底状態のエネルギーへの収束パスをプロットする方法を示します。
ko_kr: 이 섹션은 ``VQE`` 에서 콜백을 활용하여 선택된 옵티마이저 세트를 사용하여 바닥 상태 에너지에 대한 수렴 경로 도표를 그려 방법을 보여준다.
pl: Ta sekcja pokazuje, jak wykorzystać callback w ``VQE``, aby nakreślić ścieżkę zbieżności do energii stanu podstawowego za pomocą wybranego zestawu optymalizatorów.
pt_un: Esta seção demonstra como alavancar callbacks em ``VQE`` para traçar o caminho de convergência para a energia do estado fundamental com um conjunto selecionado de otimizadores.
ta: தேர்ந்தெடுக்கப்பட்ட உகப்பாக்கிகள் மூலம் தரை நிலை ஆற்றலுக்கான ஒருங்கிணைப்புப் பாதையைத் திட்டமிட, ``VQE`` இல் அழைப்புகளை எவ்வாறு மேம்படுத்துவது என்பதை இந்தப் பிரிவு விளக்குகிறது.
te: ఎంచుకున్న ఆప్టిమైజర్‌ల సెట్‌తో గ్రౌండ్ స్టేట్ ఎనర్జీకి కన్వర్జెన్స్ పాత్‌ను ప్లాట్ చేయడానికి ``VQE``లో కాల్‌బ్యాక్‌లను ఎలా ప్రభావితం చేయాలో ఈ విభాగం ప్రదర్శిస్తుంది.
tr_tr: Bu bölüm, seçili optimize edici seti ile temel durum enerjisine yakınsama yolunu çizmek için ``VQE``de geri çağırmalardan nasıl yararlanılacağını gösteriyor.

source: First, you need a qubit operator for VQE. For this example, you can use the same operator as used in the algorithms introduction, which was originally computed by Qiskit Nature for an H2 molecule.
de: Zunächst benötigen Sie einen Qubit-Operator für VQE. Für dieses Beispiel können Sie den gleichen Operator wie in der Einführung der Algorithmen verwenden, der ursprünglich von Qiskit Nature für ein H2-Molekül berechnet wurde.
es_un: Primero, necesitas un operador de qubit para VQE. Para este ejemplo, puedes usar el mismo operador que se usó en la introducción de los algoritmos, que Qiskit Nature calculó originalmente para una molécula de H2.
fr: Tout d'abord, nous créons un opérateur quantique pour VQE. Ici nous utiliserons le même opérateur que celui qui a été utilisé dans l'introduction aux algorithmes, et initialement calculé par Qiskit Nature pour une molécule H2.
ja_jp: まず、VQE用の量子ビット演算子が必要です。この例では、アルゴリズム紹介で使用したものと同じ演算子を使用することができます。これは、もともとQiskit NatureによってH2分子に対して計算されたものです。
ko_kr: 먼저, VQE에 대한 큐비트 연산자가 필요하다. 이 예제에서는 앞서 Qiskit의 알고리즘 소개에서 사용된 것과 동일한 (H2 분자에 대하여 원래 Qiskit Nature에서 계산된) 연산자를 사용할 것이다.
pl: Najpierw potrzebujesz operatora kubitów dla VQE. Dla przykładu możesz użyć tego samego operatora, którego użyto we wprowadzeniu algorytmów i który został pierwotnie stworzony przez zestaw narzędzi Qiskit Nature dla cząsteczki H2.
pt_un: Primeiro, você precisa de um operador qubit para VQE. Para este exemplo, você pode usar o mesmo operador usado na introdução de algoritmos, que foi originalmente calculado pelo Qiskit Nature para uma molécula de H2.
ta: முதலில், உங்களுக்கு VQEக்கு ஒரு குவிட் ஆபரேட்டர் தேவை. இந்த எடுத்துக்காட்டில், அல்காரிதம்ஸ் அறிமுகத்தில் பயன்படுத்தப்பட்ட அதே ஆபரேட்டரை நீங்கள் பயன்படுத்தலாம், இது முதலில் கிஸ்கிட் நேச்சரால் H2 மூலக்கூறுக்காகக் கணக்கிடப்பட்டது.
te: ముందుగా, మీకు VQE కోసం క్విట్ ఆపరేటర్ అవసరం. ఈ ఉదాహరణ కోసం, మీరు అల్గారిథమ్‌ల పరిచయంలో ఉపయోగించిన అదే ఆపరేటర్‌ని ఉపయోగించవచ్చు, ఇది వాస్తవానికి H2 మాలిక్యూల్ కోసం Qiskit Nature ద్వారా గణించబడింది.
tr_tr: İlk önce VQE için bir kübit operatörüne ihtiyacınız var. Bu örnekte, bir Hidrojen molekülü için orijinal olarak Qiskit Nature tarafından hesaplanan, algoritmalara girişte kullanılan operatörün aynısını kullanabilirsiniz.

source: The next step is to instantiate the ``Estimator`` of choice for the evaluation of expectation values within ``VQE``. For simplicity, you can select the ``qiskit.primitives.Estimator`` shipped with the default Qiskit Terra installation.
de: Der nächste Schritt besteht darin, den ``Estimator`` der Wahl für die Auswertung der Erwartungswerte innerhalb von ``VQE`` zu instanziieren. Der Einfachheit halber können Sie den ``qiskit.primitives.Estimator`` wählen, der mit der Standardinstallation von Qiskit Terra geliefert wird.
es_un: El siguiente paso es instanciar el ``Estimator`` elegido para la evaluación de los valores esperados dentro de ``VQE``. Para simplificar, puedes seleccionar ``qiskit.primitives.Estimator`` entregado con la instalación predeterminada de Qiskit Terra.
fr: L'étape suivante consiste à instancier l' `` Estimateur`` de choix pour l'évaluation des valeurs attendues dans ``VQE``. Pour simplifier, vous pouvez sélectionner ``qiskit.primitives.Estimator`` livré avec l'installation Qiskit Terra par défaut.
ja_jp: 次のステップでは、``VQE`` 内で期待値を評価するための ``Estimator`` をインスタンス化します。簡単のために、Qiskit Terraのデフォルトインストールに同梱されている ``qiskit.primitives.Estimator`` を選択することができます。
ko_kr: 다음 단계는 ``VQE`` 내에서 기댓값을 평가하기 위해 선택한 ``Estimator`` 를 인스턴스화하는 것이다. 단순성을 위해 기본 Qiskit Terra 설치와 함께 제공되는 ``qiskit.primitives.Estimator`` 를 선택할 수 있다.
pl: Następnym krokiem jest utworzenie instancji ``Estimator`` dla oceny wartości oczekiwanych w ``VQE``. Dla uproszczenia możesz wybrać ``qiskit.primitives.Estimator`` z domyślną instalacją Qiskit Terra.
pt_un: O próximo passo é instanciar o ``Estimator`` de escolha para a avaliação dos valores esperados dentro do ``VQE``. Para simplificar, você pode selecionar o ``qiskit.primitives.Estimator`` fornecido com a instalação padrão do Qiskit Terra.
ta: அடுத்த படி, ``VQE``க்குள் எதிர்பார்ப்பு மதிப்புகளின் மதிப்பீட்டிற்கான தேர்வின் ``மதிப்பீட்டாளர்`` ஐ உடனடியாகச் செய்வது. எளிமைக்காக, இயல்புநிலை Qiskit Terra நிறுவலுடன் அனுப்பப்பட்ட ``qiskit.primitives.Estimator`` ஐ நீங்கள் தேர்ந்தெடுக்கலாம்.
te: తదుపరి దశ ``VQE``లో నిరీక్షణ విలువల మూల్యాంకనం కోసం ఎంపిక యొక్క ``ఎస్టిమేటర్``ని ఇన్‌స్టాంటియేట్ చేయడం. సరళత కోసం, మీరు డిఫాల్ట్ Qiskit టెర్రా ఇన్‌స్టాలేషన్‌తో రవాణా చేయబడిన ``qiskit.primitives.Estimator``ని ఎంచుకోవచ్చు.
tr_tr: Bir sonraki adım, ``VQE`` içindeki beklenti değerlerinin değerlendirilmesi için tercih edilen ``Estimator``'u başlatmaktır. Basit olması için, varsayılan Qiskit Terra kurulumuyla birlikte gelen ``qiskit.primitives.Estimator``'u seçebilirsiniz.

source: You are now ready to compare a set of optimizers through the ``VQE`` callback. The minimum energy of the H2 Hamiltonian can be found quite easily, so the maximum number of iterations (``maxiter``) does not have to be very large. You can once again use ``TwoLocal`` as the selected trial wavefunction (i.e. ansatz).
fr: Vous êtes maintenant prêt à comparer un ensemble d'optimisateurs à travers le callback ``VQE``. L'énergie minimale du Hamiltonien de H2 peut être trouvée assez facilement, donc le nombre maximum d'itérations (``maxiter``) ne doit pas être très grand. Vous pouvez à nouveau utiliser ``TwoLocal`` comme fonction d'essai sélectionnée (i.e. ansatz).
ja_jp: これで ``VQE`` コールバックを使用してオプティマイザーを比較する準備が整いました。H2ハミルトニアンの最小エネルギーは非常に簡単に求めることができるので、最大反復回数(``maxiter``)はあまり大きくする必要はありません。選択した試行波動関数（つまりansatz）として、再び ``TwoLocal`` を使用することができます。
ko_kr: 이제 ``VQE`` 콜백을 통해 옵티마이저 세트를 비교할 준비가 되었다. H2 해밀토니안의 최소 에너지는 매우 쉽게 찾을 수 있기 때문에 최대 반복 횟수 (``maxiter``) 는 매우 클 필요가 없다. ``TwoLocal`` 를 선택한 시행 파동 함수 (즉, ansatz)으로 다시 한번 사용할 수 있다.
ta: நீங்கள் இப்போது ``VQE`` கால்பேக் மூலம் ஆப்டிமைசர்களின் தொகுப்பை ஒப்பிட்டுப் பார்க்கத் தயாராக உள்ளீர்கள். H2 ஹாமில்டோனியனின் குறைந்தபட்ச ஆற்றலை மிக எளிதாகக் கண்டறிய முடியும், எனவே அதிகபட்ச எண்ணிக்கையிலான மறு செய்கைகள் (``maxiter``) மிகப் பெரியதாக இருக்க வேண்டியதில்லை. தேர்ந்தெடுக்கப்பட்ட சோதனை அலைச் செயல்பாடாக (அதாவது ansatz) நீங்கள் மீண்டும் ``TwoLocal`` ஐப் பயன்படுத்தலாம்.
tr_tr: Artık ``VQE`` geri çağırma yoluyla bir dizi optimize ediciyi karşılaştırmaya hazırsınız. H2 Hamiltoniyenin minimum enerjisi oldukça kolay bir şekilde bulunabilir, dolayısıyla maksimum iterasyon sayısının (``maxiter``) çok büyük olması gerekmez. Seçilen deneme dalga fonksiyonu (yani ansatz) olarak bir kez daha ``TwoLocal`` kullanabilirsiniz.

source: Now, from the callback data you stored, you can plot the energy value at each objective function call each optimizer makes. An optimizer using a finite difference method for computing gradient has that characteristic step-like plot where for a number of evaluations it is computing the value for close by points to establish a gradient (the close by points having very similar values whose difference cannot be seen on the scale of the graph here).
de: Anhand der gespeicherten Rückrufdaten können Sie nun den Energiewert bei jedem Aufruf der Zielfunktion durch den Optimierer aufzeichnen. Ein Optimierer, der eine Finite-Differenzen-Methode zur Berechnung des Gradienten verwendet, hat diese charakteristische schrittweise Darstellung, bei der er für eine Reihe von Auswertungen den Wert für nahe beieinander liegende Punkte berechnet, um einen Gradienten zu ermitteln (die nahe beieinander liegenden Punkte haben sehr ähnliche Werte, deren Unterschied auf der Skala des Diagramms hier nicht zu sehen ist).
es_un: Ahora, a partir de los datos de devolución de llamada que almacenaste, puedes graficar el valor de la energía en cada llamada de la función objetivo que hace cada optimizador. Un optimizador que utiliza un método de diferencias finitas para calcular el gradiente tiene esa gráfica escalonada característica en el que, para una serie de evaluaciones, calcula el valor de los puntos cercanos para establecer un gradiente (los puntos cercanos tienen valores muy similares cuya diferencia no se puede ver en la escala de la gráfica aquí).
fr: Maintenant, à partir des données de callback que nous avons stockées, nous pouvons tracer la valeur d'énergie à chaque appel de fonction objectif que chaque optimiseur fait. Un optimiseur utilisant une méthode de différence finie pour le calcul du gradient a ce tracé avec des plateaux caractéristique où, pour un certain nombre d'évaluations consécutives, il calcule la valeur d'énergie pour des points très proches (les points très proches ayant des valeurs d'énergie très similaires, la différence ne peut être vue sur l'échelle du graphique).
ja_jp: 保存されたコールバック・データから、各オプティマイザーが行う目的関数の呼び出しごとのエネルギー値をプロットすることができます。勾配の計算に有限差分法を用いたオプティマイザーでは、勾配を得るために多くの評価では近くにある点の値を計算していて、プロットのように特徴的なステップを示します。 (近くにある点は非常に似た値をもち、その差を今回のグラフのスケールで見ることはできません。)
ko_kr: 이제 저장한 콜백 데이터에서 각 옵티마이저가 각각의 목적 함수를 호출하여 발생하는 에너지 값을 그려볼 수 있다. 유한 차분법을 사용하여 기울기를 계산하는 옵티마이저는 수 많은 평가에서 기울기를 설정하기 위해 가까운 지점에 대한 값을 계산하는 plot과 같은 특성 단계를 가진다. (여기 그래프의 눈금에서는 차이를 구별하기 힘들 정도로 매우 유사한 값을 가진 가까운 지점임)
pl: Z zapisanych danych callback można teraz wykreślić wartość energetyczną w każdym wywołaniu funkcji celu każdego optymalizatora. Optymalizator wykorzystujący metodę różnicowania skończonego dla gradientu obliczeniowego posiada tę charakterystyczny wykres przypominający schodki, gdzie dla pewnej liczby ocen oblicza wartości zbliżonych punktów w celu ustalenia gradientu (zbliżony punkty o bardzo podobnych wartościach, których różnica nie może być widoczna w skali wykresu).
pt_un: Agora, a partir dos dados do callback que você armazenou, você pode plotar o valor de energia em cada chamada de função objetivo que cada otimizador faz. Um optimizador que usa um método de diferenças finitas para calcular o gradiente tem aquele gráfico de passos característico onde para um número de avaliações calcula o valor dos pontos próximos para estabelecer um gradiente (os pontos próximos têm valores muito semelhantes cuja diferença não pode ser vista na escala do gráfico aqui).
ta: இப்போது, ​​நீங்கள் சேமித்த கால்பேக் தரவிலிருந்து, ஒவ்வொரு ஆப்டிமைசரும் செய்யும் ஒவ்வொரு புறநிலை செயல்பாட்டிலும் ஆற்றல் மதிப்பைத் திட்டமிடலாம். சாய்வைக் கணக்கிடுவதற்கு வரையறுக்கப்பட்ட வேறுபாடு முறையைப் பயன்படுத்தும் ஒரு உகப்பாக்கியானது, ஒரு படிநிலை போன்ற ப்ளாட்டைக் கொண்டுள்ளது, அங்கு பல மதிப்பீடுகளுக்கு அது சாய்வு நிறுவுவதற்கு புள்ளிகளுக்கு நெருக்கமான மதிப்பைக் கணக்கிடுகிறது. (இங்குள்ள வரைபடத்தின் அளவுகோலில் வேறுபாட்டைக் காண முடியாத மிகவும் ஒத்த மதிப்புகளைக் கொண்ட புள்ளிகளுக்கு நெருக்கமானது).
te: ఇప్పుడు, మీరు నిల్వ చేసిన కాల్‌బ్యాక్ డేటా నుండి, ప్రతి ఆప్టిమైజర్ చేసే ప్రతి ఆబ్జెక్టివ్ ఫంక్షన్ కాల్‌లో మీరు శక్తి విలువను ప్లాట్ చేయవచ్చు. కంప్యూటింగ్ గ్రేడియంట్ కోసం పరిమిత వ్యత్యాస పద్ధతిని ఉపయోగించే ఆప్టిమైజర్ ఆ లక్షణ దశల ప్లాట్‌ను కలిగి ఉంటుంది, ఇక్కడ అనేక మూల్యాంకనాల కోసం ఇది గ్రేడియంట్‌ను స్థాపించడానికి దగ్గరగా పాయింట్ల కోసం విలువను గణిస్తుంది (ఇక్కడ గ్రాఫ్ స్కేల్‌లో తేడా కనిపించని చాలా సారూప్య విలువలను కలిగి ఉన్న పాయింట్ల ద్వారా దగ్గరగా ఉంటుంది).
tr_tr: Şimdi, depoladığınız geri arama verilerinden, her bir optimize edici yaptığı her amaç fonksiyondaki enerji değerini çizebilirsiniz. Gradyan hesaplaması için sonlu bir fark metodu kullanan optimize edicinin bir dizi değerlendirmeye uygun bir gradyan oluşturmak için yakın noktaların değerini hesapladığı çizime benzer karakteristik adımları vardır (farkı buradaki grafiğin ölçeğinde görülemeyen çok benzer değerlere sahip noktalara yakın).
