Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/02_vqe_advanced_options.po
Languages: de, es_un, fr, ja_jp, ko_kr, pl, pt_un, ta, te, tr_tr

source: Finally, since the above problem is still easily tractable classically, you can use ``NumPyMinimumEigensolver`` to compute a reference value for the solution.
de: Da das obige Problem klassisch immer noch leicht lösbar ist, können Sie ``NumPyMinimumEigensolver`` verwenden, um einen Referenzwert für die Lösung zu berechnen.
es_un: Finalmente, dado que el problema anterior todavía es fácilmente tratable de forma clásica, puedes usar ``NumPyMinimumEigensolver`` para calcular un valor de referencia para la solución.
fr: Enfin, puisque le problème ci-dessus est toujours facilement tractable classiquement, vous pouvez utiliser ``NumPyMinimumEigensolver`` pour calculer une valeur de référence pour la solution.
ja_jp: 最後に、上記の問題はまだ古典的に簡単に扱えるので、 ``NumPyMinimumEigensolver`` を使って解の参照値を計算することができます。
ko_kr: 마지막으로, 위의 문제는 고전적으로 여전히 쉽게 다루기 쉽기 때문에, ``NumPyMinimumEigensolver`` 를 사용하여 솔루션에 대한 기준 값을 계산할 수 있다.
pl: Ze względu na to, że powyższy problem nadal łatwo zidentyfikować w sposób klasyczny, możesz użyć ``NumPyMinimumEigensolver``, aby obliczyć wartość odniesienia dla danego rozwiązania.
pt_un: Finalmente, uma vez que o problema acima ainda é facilmente tratável classicamente, você pode usar ``NumPyMinimumEigensolver`` para calcular um valor de referência para a solução.
ta: இறுதியாக, மேலே உள்ள சிக்கல் பாரம்பரியமாக இன்னும் எளிதில் தீர்க்கக்கூடியதாக இருப்பதால், தீர்வுக்கான குறிப்பு மதிப்பைக் கணக்கிட ``NumPyMinimumEigensolver`` ஐப் பயன்படுத்தலாம்.
te: చివరగా, పైన పేర్కొన్న సమస్య ఇప్పటికీ క్లాసికల్‌గా సులభంగా పరిష్కరించదగినది కనుక, మీరు పరిష్కారం కోసం సూచన విలువను గణించడానికి ``NumPyMinimumEigensolver``ని ఉపయోగించవచ్చు.
tr_tr: Son olarak, yukarıdaki problem klasik olarak kolayca izlenebilir olduğundan, çözüm için bir referans değeri hesaplamak üzere ``NumPyMinimumEigensolver`` kullanabilirsiniz.

source: You can now plot the difference between the ``VQE`` solution and this exact reference value as the algorithm converges towards the minimum energy.
de: Sie können nun die Differenz zwischen der ``VQE``- Lösung und diesem exakten Referenzwert darstellen, während der Algorithmus gegen das Energieminimum konvergiert.
es_un: Ahora puedes graficar la diferencia entre la solución de ``VQE`` y este valor de referencia exacto a medida que el algoritmo converge hacia la energía mínima.
fr: Vous pouvez maintenant tracer la différence entre la solution ``VQE`` et cette valeur de référence exacte lorsque l'algorithme converge vers l'énergie minimale.
ja_jp: アルゴリズムが最小エネルギーに収束していく過程で、``VQE`` の解とこの正確な参照値との差をプロットすることができるようになりました。
ko_kr: 이제 알고리즘이 최소 에너지로 수렴할 때 ``VQE`` 솔루션과 이 정확한 참조값 사이의 차이를 도표를 그려 표현할 수 있다.
pl: Możesz teraz nakreślić różnicę pomiędzy rozwiązaniem ``VQE`` a tą konkretną wartością odniesienia, ponieważ algorytm jest zbieżny z minimalną energią.
pt_un: Agora você pode plotar a diferença entre a solução ``VQE`` e este valor de referência exato conforme o algoritmo converge para a energia mínima.
ta: அல்காரிதம் குறைந்தபட்ச ஆற்றலை நோக்கிச் செல்லும்போது ``VQE`` தீர்வுக்கும் இந்தச் சரியான குறிப்பு மதிப்புக்கும் இடையே உள்ள வித்தியாசத்தை நீங்கள் இப்போது திட்டமிடலாம்.
te: మీరు ఇప్పుడు ``VQE`` సొల్యూషన్ మరియు అల్గారిథమ్ కనిష్ట శక్తి వైపు కలుస్తున్నందున ఈ ఖచ్చితమైన సూచన విలువ మధ్య వ్యత్యాసాన్ని ప్లాట్ చేయవచ్చు.
tr_tr: Algoritma minimum enerjiye doğru yaklaşırken artık ``VQE`` çözümü ile bu tam referans değeri arasındaki farkı çizebilirsiniz.

source: Gradients
de: Gradienten
es_un: Gradientes
ja_jp: 勾配
ko_kr: 그라디언트
pl: Gradienty
pt_un: Gradientes
ta: க்ரேடியன்ட்டுகள்
tr_tr: Gradyanlar

source: In Qiskit’s variational algorithms, if the provided optimizer uses a gradient-based technique, the default gradient method will be finite differences. However, these classes include an option to pass custom gradients via the ``gradient`` parameter, which can be any of the provided methods within Qiskit’s `gradient <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.html>`__ framework, which fully supports the use of primitives. This section shows how to use custom gradients in the VQE workflow.
fr: Dans les algorithmes variationnels de Qiskit, si l'optimiseur fourni utilise une technique basée sur un gradient, la méthode par défaut du gradient sera les différences finies. Cependant, ces classes incluent une option pour passer des gradients personnalisés via le paramètre ``gradient``, qui peut être n'importe laquelle des méthodes fournies dans le cadre Qiskit `gradient <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.html>` __, qui supporte entièrement l'utilisation des primitives. Cette section explique comment utiliser des gradients personnalisés dans le flux de travaux VQE.
ja_jp: Qiskit の変分アルゴリズムにおいて、提供されるオプティマイザーが勾配ベースの手法を使用する場合、デフォルトの勾配メソッドは有限差分法となります。しかし、これらのクラスには ``gradient`` パラメーターを介してカスタム勾配を渡すオプションがあり、primitiveの使用を完全にサポートする Qiskit の `gradient <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.html>`__ フレームワーク内で提供されるメソッドのいずれかを使用することが可能です。このセクションでは、VQEワークフローでカスタムgradients を使用する方法について説明します。
ko_kr: Qiskit의 변이 알고리즘에서, 제공된 옵티마이저가 그라디언트 기반 기술을 사용하는 경우, 기본 그라디언트 방법은 유한차가 될 것이다. 그러나 이러한 클래스에는 ``gradient`` 매개 변수를 통해 사용자 지정 그라디언트를 전달하는 옵션이 포함되어 있으며, 이는 primitive의 사용을 완전히 지원하는 Qiskit의 `gradient <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.html>`__ 프레임워크 내에서 제공되는 방법 중 하나일 수 있다. 이 섹션에서는 VQE 워크플로우에서 사용자 지정 그라디언트를 사용하는 방법을 보여 준다.
ta: கிஸ்கிட்டின் மாறுபாடு அல்காரிதம்களில், வழங்கப்பட்ட உகப்பாக்கி சாய்வு அடிப்படையிலான நுட்பத்தைப் பயன்படுத்தினால், இயல்புநிலை சாய்வு முறை வரையறுக்கப்பட்ட வேறுபாடுகளாக இருக்கும். இருப்பினும், இந்த வகுப்புகள் ``கிரேடியன்ட்`` அளவுரு வழியாக தனிப்பயன் சாய்வுகளை அனுப்புவதற்கான விருப்பத்தை உள்ளடக்கியது, இது Qiskit இன் `கிரேடியன்ட் <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients க்குள் வழங்கப்பட்ட முறைகளில் ஏதேனும் இருக்கலாம்..html>`__ ஃப்ரேம்வொர்க், இது முதற்பொருள்களின் பயன்பாட்டை முழுமையாக ஆதரிக்கிறது. VQE பணிப்பாய்வுகளில் தனிப்பயன் சாய்வுகளை எவ்வாறு பயன்படுத்துவது என்பதை இந்தப் பிரிவு காட்டுகிறது.
tr_tr: Qiskit'in değişimsel algoritmalarında, sağlanan optimize edici gradyan tabanlı bir teknik kullanıyorsa, varsayılan gradyan metodu sonlu farklar olacaktır. Ancak bu sınıflar, temel öğelerin kullanımını tamamen destekleyen Qiskit'in `gradyan <https://qiskit.org/documentation/stubs/qiskit.algorithms.gradients.html>`__ çerçevesi içindeki sağlanan yöntemlerden herhangi biri olabilen ``gradient`` parametresi aracılığıyla özel gradyan geçirme seçeneği içerir. Bu bölüm, VQE iş akışında özel gradyanların nasıl kullanılacağını gösterir.

source: The first step is to initialize both the corresponding primitive and primitive gradient:
de: Der erste Schritt besteht darin, sowohl das entsprechende Primitiv als auch den primitiven Gradienten zu initialisieren:
es_un: El primer paso es inicializar tanto la correspondiente primitiva como el gradiente primitivo:
fr: La première étape consiste à initialiser la primitive et la primitive de gradient correspondante :
ja_jp: まず、対応するprimitive とprimitive gradient の両方を初期化します。
ko_kr: 첫 번째 단계는 해당 primitive 및 primitive 그라디언트를 모두 초기화하는 것이다:
pl: Pierwszym krokiem jest zainicjowanie zarówno odpowiedniego elementu podstawowego, jak i gradientu podstawowego:
pt_un: O primeiro passo é inicializar a primitiva correspondente e o gradiente primitivo:
ta: முதல் படி, தொடர்புடைய பழமையான மற்றும் பழமையான சாய்வு இரண்டையும் துவக்க வேண்டும்:
te: మొదటి దశ సంబంధిత ఆదిమ మరియు ఆదిమ ప్రవణత రెండింటినీ ప్రారంభించడం:
tr_tr: İlk adım, karşılık gelen temel öğe ve temel öğe gradyanını başlatmaktır:

source: Now, you can inspect an SLSQP run using the ``FiniteDiffEstimatorGradient`` from above:
de: Nun können Sie einen SLSQP-Lauf mit Hilfe des ``FiniteDiffEstimatorGradient`` von oben untersuchen:
es_un: Ahora, puedes inspeccionar una ejecución de SLSQP usando el ``FiniteDiffEstimatorGradient`` de arriba:
fr: A présent, vous pouvez inspecter une exécution SLSQP à l'aide de ``FiniteDiffEstimatorGradient`` comme ci-dessus :
ja_jp: さて、上記の ``FiniteDiffEstimatorGradient`` を用いて SLSQP の実行を検査することができます。
ko_kr: 이제 위에서 ``FiniteDiffEstimatorGradient`` 를 사용하여 SLSQP 실행을 점검할 수 있다.
pl: Teraz można spróbować uruchomić SLSQP przy użyciu powyższego ``FiniteDiffEstimatorGradient``:
pt_un: Agora, você pode inspecionar uma execução SLSQP usando o ``FiniteDiffEstimatorGradient`` acima:
ta: இப்போது, ​​மேலே உள்ள ``FiniteDiffEstimatorGradient`` ஐப் பயன்படுத்தி SLSQP இயக்கத்தை நீங்கள் ஆய்வு செய்யலாம்:
te: ఇప్పుడు, మీరు ఎగువ నుండి ``FiniteDiffEstimatorGradient``ని ఉపయోగించి SLSQP రన్‌ని తనిఖీ చేయవచ్చు:
tr_tr: Artık yukarıdan ``FiniteDiffEstimatorGradient`` kullanarak bir SLSQP çalıştırmasını inceleyebilirsiniz:

source: Initial point
de: Anfangspunkt
es_un: Punto inicial
fr: Point de départ
ja_jp: 初期点(Initial point)
ko_kr: 초기 지점
pl: Punkt początkowy
pt_un: Ponto inicial
ta: ஆரம்ப புள்ளி
te: ప్రారంభ పాయింట్
tr_tr: Başlangıç noktası

source: By default, the optimization begins at a random point within the bounds defined by the ansatz. The ``initial_point`` option allows to override this point with a custom list of values that match the number of ansatz parameters.
de: Standardmäßig beginnt die Optimierung an einem zufälligen Punkt innerhalb der durch den Ansatz definierten Grenzen. Die Option ``initial_point`` erlaubt es, diesen Punkt mit einer benutzerdefinierten Liste von Werten zu überschreiben, die der Anzahl der Ansatzparameter entspricht.
es_un: Por defecto, la optimización comienza en un punto aleatorio dentro de los límites definidos por el ansatz. La opción ``initial_point`` permite anular este punto con una lista personalizada de valores que coincidan con el número de parámetros del ansatz.
fr: Par défaut, l'optimisation commence à un point aléatoire dans les limites définies par l'ansatz. L'option ``initial_point`` permet de remplacer ce point par une liste personnalisée de valeurs qui correspondent au nombre de paramètres ansatz.
ja_jp: デフォルトでは、最適化はansatzで定義された境界内のランダムな点から開始されます。 ``initial_point`` オプションを使用すると、この点を、ansatz のパラメーター数に応じたカスタムリストで上書きすることができます。
ko_kr: 기본적으로 최적화는 ansatz에 의해 정의된 경계 내의 무작위 점에서 시작된다. ``initial_point`` 옵션을 사용하면 이 점을 ansatz 매개 변수의 수와 일치하는 사용자 지정 값 목록으로 재정의할 수 있다.
pl: Domyślnie optymalizacja rozpoczyna się w losowym punkcie w granicach określonych przez ansatz. Opcja ``initial_point`` pozwala zastąpić ten punkt za pomocą niestandardowej listy wartości, które odpowiadają liczbie parametrów ansatz.
pt_un: Por padrão, a otimização começa em um ponto aleatório dentro dos limites definidos pelo ansatz. A opção ``initial_point`` permite substituir este ponto com uma lista personalizada de valores que correspondem ao número de parâmetros ansatz.
ta: இயல்பாக, தேர்வுமுறையானது ansatz வரையறுக்கப்பட்ட எல்லைக்குள் ஒரு சீரற்ற புள்ளியில் தொடங்குகிறது. ``initial_point`` விருப்பம், ansatz அளவுருக்களின் எண்ணிக்கையுடன் பொருந்தக்கூடிய மதிப்புகளின் தனிப்பயன் பட்டியலுடன் இந்தப் புள்ளியை மேலெழுத அனுமதிக்கிறது.
te: డిఫాల్ట్‌గా, ఆప్టిమైజేషన్ ansatz ద్వారా నిర్వచించబడిన హద్దుల్లోని యాదృచ్ఛిక పాయింట్ వద్ద ప్రారంభమవుతుంది. ``initial_point`` ఎంపిక ansatz పారామితుల సంఖ్యకు సరిపోలే విలువల అనుకూల జాబితాతో ఈ పాయింట్‌ని భర్తీ చేయడానికి అనుమతిస్తుంది.
tr_tr: Varsayılan olarak, optimizasyon ansatz tarafından tanımlanan sınırlar içinde rastgele bir noktada başlar. ``initial_point`` seçeneği, ansatz parametrelerinin sayısıyla eşleşen özel bir değerler listesiyle bu noktayı geçersiz kılmaya izin verir.

source: You might wonder… *Why set a custom initial point?* Well, this option can come in handy if you have a guess for a reasonable starting point for the problem, or perhaps know information from a prior experiment.
fr: Vous pourriez vous demander… *Pourquoi définir un point initial personnalisé ? Eh bien, cette option peut vous être utile si vous avez une estimation pour un point de départ raisonnable pour le problème, ou peut-être parce que vous connaissez des informations d'une expérience antérieure.
ja_jp: *なぜカスタム初期点を設定するの?* と思うかもしれません。このオプションは、問題の妥当な開始点についての推測がある場合、あるいは以前の実験からの情報を知っている場合に便利です。
ko_kr: 여기서 이와 같은 질문을 던질 수 있다. *사용자 지정 초기 지점을 설정하는 이유는 무엇일까?* 이 옵션은 문제의 합리적인 시작점을 추측하거나 사전 실험의 정보를 알고 있는 경우에 유용할 수 있다.
ta: நீங்கள் ஆச்சரியப்படலாம்... *ஏன் தனிப்பயன் ஆரம்ப புள்ளியை அமைக்க வேண்டும்?* சரி, சிக்கலுக்கான நியாயமான தொடக்க புள்ளியை நீங்கள் யூகித்தால் அல்லது முந்தைய பரிசோதனையின் தகவலை அறிந்திருந்தால் இந்த விருப்பம் பயனுள்ளதாக இருக்கும்.
tr_tr: Merak edebilirsiniz... *Neden özel bir başlangıç noktası ayarladınız?* Sorun için makul bir başlangıç noktası tahmininiz varsa veya önceki bir deneyden bilginiz varsa bu seçenek kullanışlı olabilir.

source: To demonstrate this feature, let’s look at the results from our previous VQE run:
fr: Pour illustrer cette fonctionnalité, regardons les résultats de notre précédente exécution VQE:
ja_jp: この機能を実証するために、前回のVQEの実行結果を見てみましょう。
ko_kr: 이 기능을 시연하기 위해 이전 VQE 실행 결과를 살펴보자:
ta: இந்த அம்சத்தை நிரூபிக்க, எங்கள் முந்தைய VQE ரன் முடிவுகளைப் பார்ப்போம்:
tr_tr: Bu özelliği göstermek için, önceki VQE çalışmamızın sonuçlarına bakalım:

source: Now, you can take the ``optimal_point`` from the above result and use it as the ``initial_point`` for a follow-up computation.
de: Nun können Sie den ``optimalen_Punkt`` aus dem obigen Ergebnis nehmen und ihn als ``Initial_Punkt`` für eine weitere Berechnung verwenden.
es_un: Ahora, puedes tomar el ``optimal_point`` del resultado anterior y usarlo como el ``initial_point`` para un cálculo de seguimiento.
fr: Maintenant, vous pouvez prendre le ``optimal_point`` du résultat ci-dessus et l'utiliser comme ``initial_point`` pour un calcul ultérieur.
ja_jp: 上記の結果から ``optimal_point`` を取り出し、それを ``initial_point`` として後続の計算に使用することができます。
ko_kr: 이제 위의 결과에서 ``optimal_point`` 를 가져와 후속 계산을 위해 ``initial_point`` 로 사용할 수 있다.
pl: Teraz możesz przyjąć ``optimal_point`` z powyższego wyniku jako ``initial_point`` w kontynuacji obliczeń.
pt_un: Agora, você pode pegar o ``optimal_point`` do resultado acima e usá-lo como o ``initial_point`` para um cálculo de acompanhamento.
ta: இப்போது நாம் மேலே உள்ள முடிவிலிருந்து ``optimal_point`` -ஐ எடுத்து இங்கே ``initial point`` ஆகப் பயன்படுத்தலாம்.
te: ఇప్పుడు, మీరు పై ఫలితం నుండి ``ఆప్టిమల్_పాయింట్``ని తీసుకోవచ్చు మరియు తదుపరి గణన కోసం దాన్ని ``ఇనిషియల్_పాయింట్``గా ఉపయోగించవచ్చు.
tr_tr: Şimdi, yukarıdaki sonuçtan ``optimal_point``'i alabilir ve takip eden hesaplama için ``initial_point`` olarak kullanabilirsiniz.

source: **Note:** ``initial_point`` is now a keyword-only argument of the ``VQE`` class (i.e, it must be set following the ``keyword=value`` syntax).
de: **Anmerkung:** ``initial_point`` ist jetzt ein reines Schlüsselwort-Argument der Klasse ``VQE`` (d.h. es muss nach der Syntax ``keyword=value`` gesetzt werden).
es_un: **Nota:** ``initial_point`` ahora es un argumento de palabra clave únicamente de la clase ``VQE`` (es decir, debe establecerse siguiendo la sintaxis ``keyword=value``).
fr: ** Note:** ``initial_point`` est maintenant un argument de type mot clé de la classe ``VQE`` (c'est-à-dire qu'il doit être défini à la suite de la syntaxe ``mot clé = valeur``).
ja_jp: **注記:** ``initial_point`` は ``VQE`` クラスのキーワードのみの引数になりました (つまり、 ``keyword=value`` 構文に従って設定する必要があります)。
ko_kr: **참고:** ``initial_point`` 는 이제 ``VQE`` 클래스의 키워드 전용 인수이다 (즉, ``keyword=value`` 구문에 따라 설정해야 함).
pl: **Uwaga:** ``initial_point`` jest teraz argumentem słowa kluczowego (keyword-only argument) klasy ``VQE`` (tj. musi być ustawiony zgodnie ze składnią ``keyword=value``).
pt_un: **Observação:** ``initial_point`` agora é um argumento apenas de palavra-chave da classe ``VQE`` (ou seja, deve ser definido seguindo a sintaxe ``keyword=value``).
ta: **குறிப்பு:** ```initial_point`` என்பது இப்போது ``VQE`` வகுப்பின் முக்கிய வார்த்தைகள் மட்டுமேயான வாதமாகும் (அதாவது, இது ``keyword=value`` தொடரியலைப் பின்பற்றி அமைக்கப்பட வேண்டும்).
te: **గమనిక:** ``initial_point`` అనేది ఇప్పుడు ``VQE`` క్లాస్‌కి కీవర్డ్-మాత్రమే ఆర్గ్యుమెంట్ (అంటే, ఇది తప్పనిసరిగా ``keyword=value`` సింటాక్స్‌ను అనుసరించి సెట్ చేయాలి).
tr_tr: **Not:** ``initial_point`` artık ``VQE`` sınıfının yalnızca anahtar kelime argümanıdır (yani, ``keyword=value`` sözdizimine göre ayarlanmalıdır).

source: By looking at the ``cost_function_evals`` you can notice how the initial point helped the algorithm converge faster (in just 1 iteration, as we already provided the optimal solution).
de: Wenn man sich die ``cost_function_evals`` ansieht, kann man feststellen, wie der Ausgangspunkt dem Algorithmus geholfen hat, schneller zu konvergieren (in nur 1 Iteration, da wir bereits die optimale Lösung geliefert haben).
es_un: Al observar el ``cost_function_evals``, puedes notar cómo el punto inicial ayudó al algoritmo a converger más rápido (en solo 1 iteración, ya que proporcionamos la solución óptima).
fr: En regardant les ``cost_function_evals`` vous pouvez remarquer comment le point initial a aidé l'algorithme à converger plus rapidement (en une seule itération, comme nous avons déjà fourni la solution optimale).
ja_jp: ``cost_function_evals`` を見ると、初期点がいかにアルゴリズムの収束を早めたかがわかります（すでに最適解を提供しているため、わずか1回の反復です）。
ko_kr: ``cost_function_evals`` 를 보면 (이미 최적의 솔루션을 제공했기 때문에 단 한 번의 반복으로) 초기 포인트가 알고리즘을 더 빨리 수렴하는 데 어떻게 도움이 되었는지 알 수 있다.
pl: Patrząc na ``cost_function_evals``, można zauważyć, jak punkt początkowy pomógł algorytmowi zbiegać się szybciej (w zaledwie 1 iteracji, ponieważ już zapewniliśmy optymalne rozwiązanie).
pt_un: Olhando para ``cost_function_evals`` você pode notar como o ponto inicial ajudou o algoritmo a convergir mais rápido (em apenas 1 iteração, pois já fornecemos a solução ótima).
ta: ``cost_function_evals`` ஐப் பார்ப்பதன் மூலம், அல்காரிதம் வேகமாக ஒன்றிணைவதற்கு ஆரம்பப் புள்ளி எவ்வாறு உதவியது என்பதை நீங்கள் கவனிக்கலாம் (வெறும் 1 மறு செய்கையில், நாங்கள் ஏற்கனவே உகந்த தீர்வை வழங்கியுள்ளோம்).
te: ``cost_function_evals``ని చూడటం ద్వారా అల్గోరిథం వేగంగా కలుస్తుంది (కేవలం 1 పునరావృతంలో, మేము ఇప్పటికే సరైన పరిష్కారాన్ని అందించాము) ప్రారంభ పాయింట్ ఎలా సహాయపడిందో మీరు గమనించవచ్చు.
tr_tr: ``cost_function_evals``'a bakarak, başlangıç noktasının algoritmanın daha hızlı yakınsama yapmasına nasıl yardımcı olduğunu fark edebilirsiniz (yalnızca 1 yinelemede en uygun çözümü zaten sağladığımız için).

source: This can be particularly useful in cases where we have two closely related problems, and the solution to one problem can be used to guess the other’s. A good example might be plotting dissociation profiles in chemistry, where we change the inter-atomic distances of a molecule and compute its minimum eigenvalue for each distance. When the distance changes are small, we expect the solution to still be close to the prior one. Thus, a popular technique is to simply use the optimal point from one solution as the starting point for the next step. There also exist more complex techniques, where we can apply extrapolation to compute an initial position based on prior solution(s) rather than directly use the prior solution.
fr: Cela peut être particulièrement utile dans les cas où nous avons deux problèmes étroitement liés, et la solution à un problème peut être utilisée pour deviner les autres. Un bon exemple pourrait être le tracé de profils de dissociation en chimie, où nous changeons les distances interatomiques d'une molécule et calculons sa valeur propre minimale pour chaque distance. Lorsque les changements de distance sont faibles, nous nous attendons à ce que la solution soit encore proche de la solution précédente. Ainsi, une technique populaire consiste à utiliser simplement le point optimal d'une solution comme point de départ pour l'étape suivante. Il existe également des techniques plus complexes, où nous pouvons appliquer une extrapolation pour calculer une position initiale basée sur une ou des solutions antérieures plutôt que d'utiliser directement la solution précédente.
ja_jp: これは、特に、密接に関連した2つの問題があり、一方の問題の解から他方の問題を推測できるような場合に有効です。例えば、化学の解離プロファイルのプロットでは、分子の原子間距離を変化させ、それぞれの距離に対する最小固有値を計算することがよくあります。距離の変化が小さい場合、解はやはり以前の解に近いと考えられます。そのため、ある解の最適点を次のステップの出発点として利用するという手法が一般的です。また、より複雑な手法として、先行解を直接利用するのではなく、外挿を適用して先行解に基づく初期位置を計算する方法もあります。
ko_kr: 이는 밀접하게 관련된 두 가지 문제를 가지고 있는 경우에 특히 유용할 수 있으며, 한 문제에 대한 해결책은 다른 문제를 추측하는 데 사용될 수 있다. 좋은 예로 화학에서 분자의 원자 간 거리를 변경하고 각 거리에 대한 최소 고유값을 계산하는 해리(dissociation) 프로파일을 그리는 것일 수 있다. 거리 변화가 적을 때 우리는 솔루션이 여전히 이전 솔루션의 근처에 있을 것으로 예상할 수 있다. 따라서 일반적인 테크닉은 단순하게 한 솔루션의 최적점을 다음 단계의 시작 지점으로 사용하는 것이다. 또한 이전 솔루션을 직접 사용하는 대신 이전 솔루션들을 기반으로 초기 위치를 계산하기 위해 외삽법(extrapolation)을 적용할 수 있는 더 복잡한 기술이 있다.
ta: நமக்கு இரண்டு நெருங்கிய தொடர்புடைய பிரச்சனைகள் இருக்கும் சந்தர்ப்பங்களில் இது மிகவும் பயனுள்ளதாக இருக்கும், மேலும் ஒரு பிரச்சனைக்கான தீர்வை மற்றொன்றை யூகிக்க பயன்படுத்தலாம். ஒரு நல்ல உதாரணம் வேதியியலில் விலகல் சுயவிவரங்களைத் திட்டமிடலாம், அங்கு நாம் ஒரு மூலக்கூறின் அணுக்களுக்கு இடையேயான தூரங்களை மாற்றி ஒவ்வொரு தூரத்திற்கும் அதன் குறைந்தபட்ச ஈஜென் மதிப்பைக் கணக்கிடுகிறோம். தூர மாற்றங்கள் சிறியதாக இருக்கும் போது, ​​தீர்வு இன்னும் முந்தையதற்கு நெருக்கமாக இருக்கும் என்று எதிர்பார்க்கிறோம். எனவே, ஒரு தீர்விலிருந்து உகந்த புள்ளியை அடுத்த படிக்கான தொடக்கப் புள்ளியாகப் பயன்படுத்துவது ஒரு பிரபலமான நுட்பமாகும். மிகவும் சிக்கலான நுட்பங்களும் உள்ளன, முன் தீர்வை நேரடியாகப் பயன்படுத்துவதற்குப் பதிலாக, முந்தைய தீர்வின் (கள்) அடிப்படையில் ஆரம்ப நிலையைக் கணக்கிடுவதற்கு எக்ஸ்ட்ராபோலேஷனைப் பயன்படுத்தலாம்.
tr_tr: Bu, özellikle birbiriyle yakından ilişkili iki problemimiz olduğu ve bir problemin çözümünün diğerini tahmin etmek için kullanılabildiği durumlarda yararlı olabilir. İyi bir örnek, bir molekülün atomlar arası mesafelerini değiştirdiğimiz ve her mesafe için minimum özdeğerini hesapladığımız kimyadaki ayrışma profillerini çizmek olabilir. Mesafe değişiklikleri küçük olduğunda, çözümün bir öncekine yakın olmasını bekleriz. Bu nedenle, popüler bir teknik, bir çözümdeki en uygun noktayı bir sonraki adım için başlangıç noktası olarak kullanmaktır. Doğrudan önceki çözümü kullanmak yerine önceki çözüm(ler)e dayalı bir başlangıç konumunu hesaplamak için ekstrapolasyon uygulayabileceğimiz daha karmaşık teknikler de vardır.

source: Advanced VQE (algorithm) options
ko_kr: 고급 VQE (알고리즘) 옵션

source: In the first algorithms tutorial, you learned how to set up a basic ```VQE`` <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>`__ algorithm. Now, you will see how to provide more advanced configuration parameters to explore the full range of capabilities of Qiskit’s variational algorithms: ```VQE`` <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>`__, ```QAOA`` <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.QAOA.html>`__ and ```VQD`` <https://qiskit.org/documentation/stubs/qiskit.algorithms.eigensolvers.VQD.html>`__ among others. In particular, this tutorial will cover how to set up a ``callback`` to monitor convergence and the use of custom ``initial point``\ s and ``gradient``\ s.
ko_kr: 첫 번째 알고리즘 튜토리얼에서는 기본 ```VQE`` <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>`__ 알고리즘을 설정하는 방법을 배웠다. 이제 ```VQE`` <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.VQE.html>`__, ```QAOA`` <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.QAOA.html>`__, ```VQD`` <https://qiskit.org/documentation/stubs/qiskit.algorithms.eigensolvers.VQD.html>`__ 등 Qiskit의 변이 알고리즘의 모든 기능을 탐색하기 위해 보다 고급 구성 매개 변수를 제공하는 방법을 살펴보겠다. 특히, 이 튜토리얼은 수렴과 맞춤형 ``initial point``\ s 및 ``gradient``\ s 의 사용을 모니터링하기 위해 ``callback`` 을 설정하는 방법을 다룰 것이다.
