Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/03_vqe_simulation_with_noise.po
Languages: bn_bn, es_un, fr, id_id, ja_jp, ko_kr, pl, pt_br, pt_un, ru_ru, ta_in, te, tr_tr, vi_vn, zh_tw

source: First we need to get an actual device backend and from its ``configuration`` and ``properties`` we can setup a coupling map and a noise model to match the device. While we could leave the simulator with the default all to all map, this shows how to set the coupling map too. Note: We can also use this coupling map as the entanglement map for the variational form if we choose.
bn_bn: প্রথমে আমাদের একটি আসল ব্যাকএন্ড ডিভাইস নিতে হবে তারপর এর ``configuration`` এবং ``properties`` থেকে আমরা ডিভাইসটি খাপ খাওাতে একটি coupling_map এবং নয়েজ মডেল বানিয়ে নিতে পারব। আমরা যখন সিমুলেটরকে সব ম্যাপের প্রাথমিক অবস্থা দিয়ে দিব তখন এটা কিভাবে coupling map বসাতে হয় সেটাও দেখাবে। বি: দ্র: আমরা যদি চাই তাহলে ভ্যারিয়েশনাল অবস্থার জন্য coupling map কে এন্ট্যাঙ্গেলমেন্ট ম্যাপ হিসেবে ব্যবহার করতে পারব।
es_un: Primero tenemos que obtener un backend de un dispositivo y de su ``configuración`` y ``propiedades`` podemos configurar un mapa de acoplamiento y un modelo de ruido para que coincida con el dispositivo. Aunque podríamos dejar el simulador con el mapa predeterminado, aquí también se muestra como ajustar el mapa de acoplamiento. Nota: También puedes usar el mapa de acoplamiento cómo mapa de entrelazamiento para la forma variacional, si así lo deseas.
id_id: Pertama kita perlu mendapatkan backend perangkat nyata dan dari ` ` configuration ` ` dan ` `properties ` ` kita dapat mengatur pemetaan pasangan dan model noise sesuai dengan perangkat. Sementara kita bisa membiarkan simulator dengan default pemetaan semua-ke-semua, ini menunjukkan bagaimana mengatur pemetaan pasangan juga. Catatan: Kita juga dapat menggunakan pasangan pemetaan ini sebagai peta entanglement untuk bentuk variasional jika kita memilih.
ja_jp: まず、実際のデバイスのバックエンドを取得し、その ``configuration`` と ``properties`` から、デバイスに合うようカップリング・マップとノイズ・モデルを設定します。シミュレーターをデフォルトの全結合マップのままにしておくこともできますが、ここではカップリング・マップの設定方法を示しています。注: 変分形式のエンタングルメント・マップとして、このカップリング・マップを用いることもできます。
ko_kr: 먼저 실제 기기 백엔드를 확보하고 그의 ``구성(configuration)`` 과 ``속성(properties)`` 을 사용하여 장치와 일치하는 커플링 맵(coupling map) 과 노이즈 모델을 설정할 수 있습니다. 기본적으로 모든 맵에 시뮬레이터를 둘 수 있지만, 이는 커플링 맵을 설정하는 방법을 보여 준다. 참고: 이 커플링 맵을 선택하는 경우 다양한 양식에 대한 얽힘 맵으로 사용할 수도 있다.
pt_br: Primeiro precisamos obter um backend de dispositivo real e a partir da seu ``configuration`` e ``properties`` nós podemos configurar um mapa de acoplamento e um modelo de ruído equiparável com o dispositivo. Embora pudéssemos deixar o simulador com o mapa padrão todos-para-todos, isto mostra como definir o mapa de acoplamento também. Nota: Também podemos usar este mapa de acoplamento como o mapa de entrelaçamento para a forma variacional, se quisermos.
ru_ru: Сначала нам нужно получить backend реального устройства, и на основе его ``конфигурации`` и ``свойств`` мы можем установить карту связи и модель шума соответствующего данному устройству. Несмотря на то, что мы могли бы оставить симулятор с картой по умолчанию "один к одному", здесь показано, как настроить и карту связи. Примечание: Мы также можем использовать эту карту связи в качестве карты запутанности для вариационной схемы, если захотим.
ta_in: முதலில் நாம் ஒரு உண்மையான சாதனை பின்னணி பெற வேண்டும் மற்றும் அதன் ``configuration`` மற்றும் ``properties`` நாம் ஒரு கூட்டு வரைபடம் மற்றும் ஒரு ஒளி மாதிரி சாதனை பொருந்தும். நாம் அனைத்து வரைபடங்களையும் முன்னிருப்பாக விட்டு விட்டு செல்லும் போது, இந்த காட்டுகிறது கூம்பு வரைபடத்தை எப்படி அமைக்க எப்படி. குறிப்பு: நாம் தேர்வு செய்யப்பட்டால் வேறுபடி வடிவத்துக்காக இந்த கூம்பு வரைபடத்தை பயன்படுத்த முடியும்.
tr_tr: İlk olarak gerçek bir cihaz backend almalıyız ve onun ``konfigürasyon`` ve ``özellikler`` inden cihazı eşleştirmek için bir bağlantı haritası ve gürültü modeli ayarlayabiliriz. Simülatörü tamamen varsayılan olarak tüm haritaya bırakabilirken, bu aynı zamanda bağlantı haritasının nasıl ayarlanacağını da gösterir. Not: Eğer seçebilirsek bu bağlantı haritasını değişimsel biçime uygun olarak dolanıklık haritası gibi kullanabiliriz.
vi_vn: Đầu tiên, chúng ta cần lấy một backend của thiết bị thực tế và từ ``cấu hình`` và ``thuộc tính`` của nó, chúng ta có thể thiết lập một coupling map để kết nối và tạo mô hình nhiễu cho phù hợp với thiết bị. Trong khi chúng ta có thể để trình mô phỏng theo mặc định cho tất cả các map, điều này cho thấy làm thế nào để đặt một coupling map. Lưu ý: Chúng ta cũng có thể sử dụng coupling map như là một entanglement map cho biểu mẫu thay đổi nếu chúng ta chọn.
zh_tw: 首先，我們需要獲得一個實際的元件後台，從它的 ``configuration`` 和 ``properties`` 我們可以繪製耦合圖和雜訊模型來與元件匹配。雖然我們可以讓模擬器使用預設的所有對所有的映射，這解釋了如何設置耦合圖。注意:我們也可以選擇使用這個耦合圖作為變分形式的糾纏映射。

source: Note: simulation with noise will take longer than without noise.
bn_bn: বি: দ্র: নয়েজমুক্ত সিমুলেশনের চেয়ে নয়েজযুক্ত সিমুলেশন বেশি সময় নেবে।
es_un: Nota: una simulación con ruido va a tomar más tiempo que una sin ruido.
id_id: Catatan: simulasi dengan noise akan memakan waktu lebih lama daripada tanpa noise.
ja_jp: 注: ノイズを伴うシミュレーションには、ノイズを含まない場合に比べて時間がかかります。
ko_kr: 참고: 노이즈가 있는 시뮬레이션은 노이즈가 없을 때보다 더 오래 걸립니다.
pt_br: Obs.: simulações com ruído levarão mais tempo do que sem ruído.
ru_ru: Примечание: симуляция с шумом займет больше времени, чем без шума.
ta_in: குறிப்பு: சத்தத்துடன் உருவகப்படுத்துதல் சத்தம் இல்லாமல் இருப்பதை விட அதிக நேரம் எடுக்கும்.
tr_tr: Not: gürültülü simülasyon, gürültüsüz olandan daha uzun sürecektir.
vi_vn: Chú ý: Mô phỏng với nhiễu sẽ chậm hơn so với khi không có nhiễu.
zh_tw: 注意:以雜訊模擬的時間會比沒有雜訊的時間更長。

source: Terra Mock Backends:
bn_bn: টেরা মক ব্যাকএন্ডসমূহ (Terra Mock Backends):
es_un: Backends de Imitación de Terra:
id_id: Backend Sederhana Terra:
ja_jp: Terra 擬似バックエンド:
ko_kr: Terra Mock 백엔드:
pt_br: Backends Simulados Terra:
ta_in: டெரா மோக் பின்னணி:
zh_tw: Terra 模擬後端

source: We will use real noise data for an IBM Quantum device using the date stored in Qiskit Terra. Specifically, in this tutorial, the device is ibmq_vigo.
bn_bn: আমরা Qiskit Terra তে সংরক্ষিত ডেটা ব্যবহার করে একটা IBM কোয়ান্টাম ডিভাইসের আসল নয়েজ ডেটাকে কাজে লাগাবো। বিশেষ করে এই টিউটোরিয়ালে আমরা ``ibmq_vigo`` ডিভাইসটি ব্যবহার করব।
es_un: Usaremos los datos reales de ruido de un Dispositivo Cuántico de IBM usando la información guardada en Qiskit Terra. Específicamente, en este tutorial, el dispositivo es ibmq_vigo.
id_id: Kita akan menggunakan data derau nyata untuk perangkat IBM Quantum menggunakan data yang disimpan di Qiskit Terra. Khususnya, dalam tutorial ini, perangkat adalah ibmq_vigo.
ja_jp: Qiskit Terra に保存されているデータを用いて、IBM Quantum デバイスの実ノイズ・データを使用します。具体的に、このチュートリアルでのデバイスは ibmq_vigo です。
ko_kr: Qiskit Terra에 저장된 날짜를 사용하여 실시간 노이즈 데이터를 사용한다. 구체적으로 본 튜토리얼에서 사용된 디바이스는 ``ibmq_vigo`` 이다.
pt_br: Utilizaremos dados reais de ruído para um dispositivo IBM Quantum usando os dados armazenados no Qiskit Terra. Especificamente, neste tutorial, o dispositivo é o ibmq_vigo.
ru_ru: Мы будем использовать реальные данные о шумах для устройства IBM Quantum, используя данные, хранящиеся в Qiskit Terra. В частности, в этом примере устройство называется ibmq_vigo.
ta_in: Qiskit Terra இல் சேமித்த தேதியை பயன்படுத்தி ஒரு IBM குவாண்டம் சாதனத்துக்கு உண்மையான ஒளி தரவு பயன்படுத்தும். குறிப்பாக, இந்த உளவியல், சாதனம் ibmq_vigo.
tr_tr: Qiskit Terra içerisinde depolanan veriyi kullanarak bir IBM Kuantum aygıtı için gerçek bir gürültü kullanacağız. Özellikle bu eğitselde, bu cihaz ibmq_vigo dur.
vi_vn: Chúng ta sẽ sử dụng dữ liệu nhiễu thực tế cho các thiết bị lượng tử IBM sử dụng dữ liệu lưu trữ trong Qiskit Terra. Chi tiết hơn, trong hướng dẫn này, thiết bị được sử dụng là ibmq_vigo.
zh_tw: 我們將使用對應於儲存在 Qiskit Terra 內日期的 IBM Quantum 設備真實噪音數據。具體而言，在此教程中，使用的設備是 ``ibmq_vigo``。

source: Performance *with* noise and measurement error mitigation
bn_bn: নয়েজ *সহ* কর্মক্ষমতা এবং হিসবনিকাশের ত্রূটি লঘুকরন (measurement error mitigation)
es_un: Rendimiento *con* ruido y mitigación de errores de medición
id_id: Kinerja *dengan* derau dan mitigasi galat pengukuran
ja_jp: *ノイズおよび測定誤差緩和がある場合* のパフォーマンス
ko_kr: 소음을 *포함하고* 측정 오류 완화를 적용하였을 때의 성능
pt_br: Desempenho *com* ruído e mitigação de erros de medição
ru_ru: Производительность *с* шумом и уменьшением погрешности измерения
ta_in: சத்தம் மற்றும் அளவீட்டு பிழை குறைப்புடன் செயல்திறன்
tr_tr: Gürültü *ile* gürültü ve ölçüm hatası azaltma
vi_vn: Hiệu suật *với* nhiễu và đo đạc sự giảm thiểu sai số
zh_tw: 效能*具有*雜訊與降低測量誤差

source: Now we will add method for measurement error mitigation, which increases the fidelity of measurement. Here we choose ``CompleteMeasFitter`` to mitigate the measurement error. The calibration matrix will be auto-refresh every 30 minute (default value).
bn_bn: এখন আমরা পরিমাপ ত্রুটি দূরীকরণ এর পদ্ধতি যোগ করব যা হিসাবনিকাশের সম্ভাব্যতা বাড়িয়ে দেবে। এখানে হিসাবনিকাশের ত্রুটি কমাতে আমরা ``CompleteMeasFitter`` বাছাই করেছি। গতানুগতিকভাবেই ক্যালিব্রেশন ম্যাট্রিক্সটি প্রতি ৩০ মিনিট অন্তর নিজে নিজে রিফ্রেশ হয়ে নেবে।
es_un: Ahora agregaremos un método para la mitigación de errores de medición, lo cual aumenta la fidelidad de la medición. Aquí escogemos ``CompleteMeasFitter``para mitigar el error de medición. La matriz de calibración se va a refrescar cada 30 minutos (valor predeterminado).
id_id: Sekarang kita akan menambahkan metode untuk mitigasi error pengukuran, yang meningkatkan fidelity pengukuran. Di sini kita memilih ` ` CompleteMeasFitter ` ` untuk mitigasi error pengukuran. Matrik kalibrasi akan di perbarui otomatis setiap 30 menit (nilai default).
ja_jp: 測定誤差の軽減手法を追加し、測定の忠実度を高めます。ここでは、測定誤差を軽減するために ``CompleteMeasFitter`` を選択します。較正行列は 30 分ごと (デフォルト値) に自動更新されます。
ko_kr: 이제 측정의 정확도를 높이는 측정 오차 완화 방법을 추가할 것이다. 측정 오류를 완화하기 위해 ``CompleteMeasFitter`` 를 선택한다. 보정 매트릭스는 30분마다 자동으로 기본값으로 고쳐진다.
pt_br: Agora adicionaremos um método para mitigação de erros de medição, o que aumenta a fidelidade da medição. Aqui escolhemos ``CompleteMeasFitter`` para mitigar o erro de medição. A matriz de calibração será de atualização automática a cada 30 minutos (valor padrão).
ru_ru: Теперь мы добавим метод для уменьшения ошибки измерения, который повышает точность измерения. Здесь мы выбираем ``CompleteMeasFitter`` для уменьшения ошибки измерения. Калибровочная матрица будет автоматически обновляться каждые 30 минут (значение по умолчанию).
ta_in: இப்போது அளவீட்டு பிழை குறைப்புக்கான முறையைச் சேர்ப்போம், இது அளவீட்டின் நம்பகத்தன்மையை அதிகரிக்கிறது. அளவீட்டு பிழையைத் தணிக்க ``CompleteMeasFitter`` ஐ இங்கே தேர்வு செய்கிறோம். அளவுத்திருத்த அணி ஒவ்வொரு 30 நிமிடங்களுக்கும் (இயல்புநிலை மதிப்பு) தானாக புதுப்பிக்கப்படும்.
tr_tr: Şimdi ölçümün doğruluğunu yükselten ölçüm hatası azaltması için yöntem ekleyeceğiz. Burada ölçüm hatasını azaltmak için ``CompleteMeasFitter`` ı seçeriz. Kalibrasyon matrisi her 30 dakikada bir otomatik olarak yenilenir (varsayılan değer).
vi_vn: Bây giờ chúng ta sẽ thêm phương thức (method) cho việc đo lường sự giảm thiểu sai số, điều mà sẽ tăng fidelity của phép đo. Ở đây chúng ta chọn ``CompleteMeasFitter`` để giảm thiểu các sai số phép đo. Ma trận hiệu chuẩn sẽ được làm mới mỗi 30 phút (giá trị mặc định).
zh_tw: 現在我們將添加減少測量誤差的方法，這增加了測量的真實性。這裡我們選擇``CompleteMeasFitter`` 來減少測量誤差。校準矩陣將每 30 分鐘自動刷新一次(預設值)。

source: Lets bring the results together here for a summary.
bn_bn: এবার সব ফলাফলগুলোকে একসাথে নিয়ে একটি সারমর্ম দেয়া যাক।
es_un: Juntemos los resultados para un resumen.
id_id: Mari kita kumpulkan hasilnya bersama - sama di sini sebagai ringkasan.
ja_jp: ここで、結果をまとめてみましょう。
ko_kr: 결과는 여기서 요약을 위해 함께 표시한다.
pt_br: Vamos juntar os resultados aqui para um resumo.
ru_ru: Давайте соберем все результаты вместе, чтобы подвести итог.
ta_in: முடிவுகளை இங்கே சுருக்கமாகக் கொண்டு வரலாம்.
tr_tr: Sonuçları bir özet için birlikte buraya getirelim.
vi_vn: Hãy xem các kết quả cùng nhau cho một bản tóm tắt.
zh_tw: 讓我們在這裡匯總結果以進行總結。

source: We produced a reference value using a classical algorithm and then proceeded to run VQE on a qasm simulator. While the simulation is ideal (no noise) there is so called shot-noise due to sampling - increasing the number of shots reduces this as more and more samples are taken, but shots was left at the default of 1024 and we see a small effect in the outcome.
bn_bn: আমরা প্রথাগত (ক্লাসিক্যাল) ধারাক্রম (অ্যালোগরিদম) ব্যবহার করে একটি তথ্যসূত্র (রেফারেন্স) মান বের করেছিলাম এবং পরবরতিতে qasm সিমুলেটর এ ভি কিউ ই (VQE) চালাতে অগ্রসর হয়েছিলাম। যখন সিমুলেশনটি প্রাথমিক অবস্থায় ছিল (নয়েজমুক্ত) তখন স্যাম্পলিং এর কারনে তথাকথিত শট-ত্রুটি (shot-noise) ছিল - যত বেশী স্যাম্পল নেওয়া হয় শটের সংখ্যা বাড়ালে শট-ত্রুটি তত কমে যায়, কিন্তু শটগুলো তো প্রাথমিকভাবে ১০২৪ এ বসানো ছিল যেটার জন্য আমরা ফলাফলে সামান্য বিচ্যুতি দেখতে পাই।
es_un: Produjimos un valor de referencia utilizando un algoritmo clásico y procedimos a correr el VQE en un simulador de qasm. Aunque la simulación no es ideal (sin ruido) esta el llamado "shot-noise" causado por el muestreo — aumentar el numero de iteraciones reduce esto ya que más muestreos son realizados, pero las iteraciones se dejaron con el valor predeterminado de 1024 y podemos ver un pequeño efecto en el resultado.
id_id: Kami mendapatkan nilai referensi dari algoritma klasik dan kemudian menjalankan VQE pada simulator qasm. Walau simulasi ini ideal (tanpa noise) ada pengaruh shot-noise karena sampling- dan menambah jumlah shot mengurangi ini seiring banyaknya sampel diambil, tetapi shot ditetapkan nilai default 1024 dan kita melihat efek kecil dalam hasil.
ja_jp: 古典アルゴリズムを用いて参照値を求め、 qasm シミュレーター上で VQE を実行しました。 シミュレーションは理想的な (ノイズがない) ものですが 、サンプリングに起因するショットノイズと呼ばれるものがあります。ショット数を増やすとより多くのサンプルが得られるのでこれは減少しますが、ショット数は 1024 のままであり、結果には小さな影響が見られます。
ko_kr: 우리는 고전적 알고리즘을 사용하여 기준값을 생성한 다음, qasm 시뮬레이터에서 VQE를 실행하도록 진행했다. 시뮬레이션이 이상적이기는 하지만 (노이즈가 없음), 샘플링으로 인한 총 샷 노이즈(shot-noise) 가 있다. 총 샷 수를 증가시키면 더 많은 샘플을 얻어 샷노이즈를 줄일수 있지만, 샷은 1024의 기본값으로 남아 있어, 결과에 작은 영향을 줍니다.
pt_br: Produzimos um valor de referência usando um algoritmo clássico e depois prosseguimos para executar o VQE em um simulador qasm. Enquanto a simulação é ideal (sem ruído) há o chamado shot-noise devido à amostragem - aumentando o número de repetições (shots) reduz-se isso à medida que mais e mais amostras são medidas, mas as repetições foram deixadas no valor padrão de 1024 e vemos um pequeno efeito no resultado.
ru_ru: Мы получили контрольное значение с помощью классического алгоритма, а затем запустили VQE на симуляторе qasm. Хотя симуляция идеальна (нет шума), существует так называемый дробовой шум из-за выборки - увеличение числа считываний уменьшает этот эффект, поскольку берется все больше и больше отсчетов, но число считываний было оставлено по умолчанию 1024, и мы видим небольшой эффект в результате.
ta_in: நாங்கள் ஒரு கிளாசிக்கல் வழிமுறையைப் பயன்படுத்தி ஒரு குறிப்பு மதிப்பை உருவாக்கி, பின்னர் ஒரு Qasm சிமுலேட்டரில் VQE ஐ இயக்கத் தொடங்கினோம். உருவகப்படுத்துதல் சிறந்தது என்றாலும் (சத்தம் இல்லை) மாதிரி காரணமாக ஷாட்-இரைச்சல் என்று அழைக்கப்படுகிறது - காட்சிகளின் எண்ணிக்கையை அதிகரிப்பது மேலும் மேலும் மாதிரிகள் எடுக்கப்படுவதால் இதைக் குறைக்கிறது, ஆனால் காட்சிகள் 1024 இன் இயல்புநிலையில் விடப்பட்டன, மேலும் ஒரு சிறிய விளைவைக் காண்கிறோம் முடிவில்.
tr_tr: Klasik bir algoritma kullanarak bir referans değeri ürettik ve daha sonra bir qasm simülatöründe VQE yi yürütmeye devam ettik. Simülasyon ideal olsa da (gürültü yokken), örneklemeye bağlı olarak atış gürültüsü söz konusudur - atış sayısının arttırılması, daha fazla örnek alındıkça bunu azaltır, ancak atışlar varsayılan olarak 1024'te bırakılmıştır ve sonuçta küçük bir etki görmekteyiz.
vi_vn: Chúng ta đã tạo ra một giá trị tham chiếu bằng cách sử dụng một thuật toán cổ điển và sau đó tiến hành chạy VQE trên một trình mô phỏng qasm. Khi mô phỏng lý tưởng (không có nhiễu) vẫn có thứ được gọi là shot-noise do lấy mẫu - tăng số lượng shot làm giảm nó nhiều hơn khi nhiều mẫu được lấy, nhưng số lượng shot được để ở mặc định là 1024 và chúng ta thấy một hiệu ứng nhỏ trong kết quả.
zh_tw: 我們使用古典演算法生成了一個參考值，然後繼續在 qasm 模擬器上運行 VQE。雖然模擬是理想的(沒有雜訊)，但由於採樣而產生所謂的雜訊 - 隨著越來越多的樣本被採集，增加運行數量會減少雜訊，但預設值為 1024 我們看到對結果產生了一個小的影響。

source: Then we added noise using a model taken off a real device and can see the result is affected. Finally we added measurement noise mitigation which adjusts the results in an attempt to alleviate the affect of noise in the classical equipment measuring the qubits.
bn_bn: তারপর আমরা একটি আসল ডিভাইস থেকে সরানো মডেল ব্যবহার করে নয়েজ যোগ করেছি এবং ফলাফল যে প্রভাবিত হতে পারে তা দেখেছি। সর্বোপরি আমরা পরিমাপ দূষণ বা ত্রুটিনিরসন (মিটিগেশন) যোগ করেছি, যা এবার ফলাফলগুলকে কিউবিট পরিমাপের ক্লাসিকাল যন্ত্রপাতিতে গোলমালের প্রভাব কমানোর প্রচেষ্টায় সমন্বয়সাধন করে।
es_un: En seguida, añadimos ruido utilizando un modelo derivado de un dispositivo real y vimos que el resultado fue afectado. Finalmente añadimos mitigación del ruido de medición lo cual ajusta los resultados en un intento de aligerar el efecto del ruido en el equipamiento clásico que mide los qubits.
id_id: Kemudian kita menambah noise menggunakan model yang diambil dari perangkat nyata dan dapat melihat pengaruhnya. Akhirnya kita menambahkan mitigasi error pengukuran yang menyesuaikan hasil supaya pengaruh noise dalam peralatan klasik pengukur qubit dapat dikurangi.
ja_jp: 次に、実際のデバイスから取り出したモデルを使用してノイズを加え、結果が影響を受けることを確認できます。最後に、古典的な装置で量子ビットを測定する際の、ノイズの影響を軽減するために、測定結果を調整する測定ノイズ緩和を追加しました。
ko_kr: 그런 다음 실제 디바이스에서 제거된 모델을 사용하여 노이즈를 추가하여 결과가 영향을 받는 것을 확인할 수 있습니다. 마지막으로, 측정 잡음 완화를 추가하여, 큐비트를 측정하는 고전장치에서 잡음의 영향을 완화시키기 위한 시도로 결과를 조정한다.
pt_br: Depois adicionamos ruído usando um modelo retirado de um dispositivo real e podemos ver que o resultado é afetado. Por último, acrescentamos a mitigação de ruído de medição que ajusta os resultados na tentativa de atenuar o impacto do ruído no equipamento clássico que mede os qubits.
ru_ru: Затем мы добавили шум, используя модель, взятую с реального устройства, и увидели, что это повлияло на результат. Наконец, мы добавили уменьшение шума при измерении, которое корректирует результаты в попытке уменьшить влияние шума в классическом оборудовании, измеряющем кубиты.
ta_in: உண்மையான சாதனத்திலிருந்து எடுக்கப்பட்ட மாதிரியைப் பயன்படுத்தி சத்தத்தைச் சேர்த்துள்ளோம், இதன் விளைவாக பாதிக்கப்படுவதைக் காணலாம். இறுதியாக அளவீட்டு இரைச்சலைக் குறைப்பதைச் சேர்த்துள்ளோம், இது கிளாசிட்களை அளவிடும் கிளாசிக்கல் கருவிகளில் சத்தத்தின் தாக்கத்தைத் தணிக்கும் முயற்சியில் முடிவுகளை சரிசெய்கிறது.
tr_tr: Daha sonra gerçek bir cihazdan alınan bir model kullanarak gürültü ekledik ve sonucun etkilendiğini görebiliyoruz. Son olarak, kübitleri ölçen klasik ekipmandaki gürültünün etkisini hafifletmek amacıyla sonuçları ayarlayan ölçüm gürültüsü azaltma özelliğini ekledik.
vi_vn: Và sau đó chúng ta thêm nhiễu vào và sử dụng model trên một thiết bị thực tế và chúng ta có thể thấy kết quả bị ảnh hưởng. Cuối cùng chúng ta đã thêm môt phép đo giảm thiếu sai số để có thể điều chỉnh kết quả trong một nỗ lực để giảm bớt ảnh hưởng của nhiễu trong các thiết bị cổ điển trong việc đo lường các qubit.
zh_tw: 然後我們使用從真實元件上取下的模型添加雜訊，可以看到結果受到影響。最後，我們添加了測量雜訊降低，以嘗試降低量子位元在古典設備中測量的雜訊影響。

source: This notebook demonstrates using the `Qiskit Aer <https://qiskit.org/aer>`__ ``qasm_simulator`` to run a simulation with noise, based on a given noise model. This can be useful to investigate behavior under different noise conditions. Aer not only allows you to define your own custom noise model, but also allows a noise model to be easily created based on the properties of a real quantum device. The latter is what this notebook will demonstrate since the goal is to show VQE with noise and not the more complex task of how to build custom noise models.
ja_jp: このノートブックでは、`Qiskit Aer <https://qiskit.org/aer>`__ の ``qasm_simulator`` を使用し、与えられたノイズ・モデルに基づいて、ノイズを伴うシミュレーションの実行方法を示します。これは、異なるノイズ条件下での挙動を調べる際に役立ちます。 Aer では、独自のノイズ・モデルを定義できるだけでなく、実際の量子デバイスの特性に基づいたノイズ・モデルを簡単に作成することができます。後者は、独自のノイズ・モデルをどのように構築するかということよりも複雑なタスクではなく、今回はノイズを伴う VQE を実演することが目的であるので、このノートブックでは後者を扱います。
ko_kr: 이 노트북은 `키스킷 에어 <https://qiskit.org/aer>`__ ``qasm_simulator`` 를 통해 주어진 노이즈 모델을 기반으로 시뮬레이션을 실행하는 것을 시연한다. 이는 상이한 잡음 조건 하에서의 거동을 조사하는 데 유용할 수 있다. 에어는 사용자 고유의 노이즈 모델을 사용자가 정의할 수 있도록 허용할 뿐만 아니라 실제 양자 디바이스의 특성을 기반으로 노이즈 모델을 쉽게 작성할 수 있도록 해준다. 노이즈가 포함된 VQE 알고리즘의 결과를 보여주는 것이 목표이므로 후자의 경우가 바로 본 노트북에서 시연하고자 하는 것이며, 커스텀 노이즈 모델을 만드는 방법에 비하여 어렵지 않다.

source: `Qiskit Ignis <https://qiskit.org/ignis>`__ provides a solution to mitigate the measurement error when running on a noisy simulation or a real quantum device. This solution is leveraged by the ``QuantumInstance`` module which allows any algorithm using it to automatically have measurement noise mitigation applied.
ja_jp: `Qiskit Ignis <https://qiskit.org/ignis>`__ は、ノイズの多いシミュレーションや、実際の量子デバイス上で実行した場合の測定誤差を緩和するソリューションを提供します。このソリューションは、 ``QuantumInstance`` モジュールによって活用され、これを用いたアルゴリズムが測定ノイズの緩和を自動的に適用できるようになっています。
ko_kr: `키스킷 이그니스 <https://qiskit.org/ignis>`__ 는 노이즈 시뮬레이션 또는 실제 양자 디바이스에서 실행할 때 측정 오류를 완화하는 솔루션을 제공한다. 이 솔루션은 ``QuantumInstance`` 모듈에서 활용되며, 이를 이용하는 알고리즘은 자동으로 측정 노이즈 완화를 적용할 수 있다.
