Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/03_vqe_simulation_with_noise.po
Languages: bn_bn, es_un, fr, id_id, ja_jp, ko_kr, pl, pt_br, pt_un, ru_ru, ta_in, te, tr_tr, vi_vn, zh_tw

source: Once the noise model is defined, you can run ``VQE`` using an Aer ``Estimator``, where you can pass the noise model to the underlying simulator using the ``backend_options`` dictionary. Please note that this simulation will take longer than the noiseless one.
fr: Une fois le modèle de bruit est défini, vous pouvez exécuter le ``VQE`` en utilisant le ``Estimator`` d'Aer, où vous pouvez passer le modèle de bruit au simulateur sous-jacent en utilisant le dictionnaire ``backend_options``. Veuillez noter que cette simulation prendra plus de temps que la simulation sans bruit.
pl: Określiwszy model szumu, można uruchomić ``VQE`` przy użyciu Aer ``Estimator``, gdzie istnieje możliwość przekazania modelu szumu do bazowego symulatora za pomocą słownika ``backend_options``. Warto jednak pamiętać, że taka symulacja potrwa dłużej niż symulacja bez szumu.
pt_un: Uma vez que o modelo de ruído é definido, você pode rodar ``VQE`` usando um Aer ``Estimator``, onde você pode passar o modelo de ruído para o simulador subjacente usando o dicionário ``backend_options``. Observe que esta simulação levará mais tempo do que a sem ruído.
te: నాయిస్ మోడల్ నిర్వచించబడిన తర్వాత, మీరు Aer ``ఎస్టిమేటర్``ని ఉపయోగించి ``VQE``ని అమలు చేయవచ్చు, ఇక్కడ మీరు ``backend_options`` నిఘంటువుని ఉపయోగించి అంతర్లీన సిమ్యులేటర్‌కి నాయిస్ మోడల్‌ను పంపవచ్చు. ఈ అనుకరణ శబ్దం లేని దాని కంటే ఎక్కువ సమయం పడుతుందని దయచేసి గమనించండి.

source: Instead of defining a new instance of the ``VQE`` class, you can now simply assign a new estimator to our previous ``VQE`` instance. As the callback method will be re-used, you will also need to re-start the ``counts`` and ``values`` variables to be able to plot the convergence graph later on.
fr: Au lieu de définir une nouvelle instance de la classe ``VQE``, vous pouvez maintenant simplement assigner un nouvel estimateur à notre instance ``VQE`` précédente. Comme la méthode de rappel sera réutilisée, vous aurez également besoin de relancer les variables ``counts`` et ``values`` pour pouvoir ensuite tracer le graphique de convergence.
pl: Zamiast definiować nowy przypadek klasy ``VQE``, teraz możesz przypisać nowy estymator do poprzedniej wersji ``VQE``. Ponieważ metoda wywołań zwrotnych zostanie użyta kolejny raz, konieczne będzie ponowne uruchomienie zmiennych ``counts`` i ``values``, w celu sporządzenia grafu zbieżności.
pt_un: Em vez de definir uma nova instância da classe ``VQE``, agora você pode simplesmente atribuir um novo estimador à nossa instância ``VQE`` anterior. Como o método callback será reutilizado, você também precisará reiniciar as variáveis ``counts`` e ``values`` para poder traçar o gráfico de convergência mais tarde.
te: ``VQE`` తరగతి యొక్క కొత్త ఉదాహరణను నిర్వచించడానికి బదులుగా, మీరు ఇప్పుడు మా మునుపటి ``VQE`` ఉదాహరణకి కొత్త అంచనాను కేటాయించవచ్చు. కాల్‌బ్యాక్ పద్ధతి మళ్లీ ఉపయోగించబడుతుంది కాబట్టి, తర్వాత కన్వర్జెన్స్ గ్రాఫ్‌ను ప్లాట్ చేయడానికి మీరు ``గణనలు`` మరియు ``విలువలు`` వేరియబుల్‌లను మళ్లీ ప్రారంభించాలి.

source: Summary
fr: En résumé
pl: Podsumowanie
pt_un: Resumo
te: సారాంశము

source: In this tutorial, you compared three calculations for the H2 molecule ground state. First, you produced a reference value using a classical minimum eigensolver. Then, you proceeded to run ``VQE`` using the Qiskit Aer ``Estimator`` with 1024 shots. Finally, you extracted a noise model from a backend and used it to define a new ``Estimator`` for noisy simulations. The results are:
fr: Dans ce tutoriel, vous avez comparé trois calculs pour l'état fondamental de la molécule H2. Tout d'abord, vous avez produit une valeur de référence en utilisant un "eigensolver" classique. Ensuite, vous avez exécuté le ``VQE`` en utilisant le Qiskit Aer ``Estimator`` avec 1024 coups. Enfin, vous avez extrait un modèle de bruit d'un backend et vous l'avez utilisé pour définir un nouveau ``Estimator`` pour des simulations avec bruit. Les résultats sont les suivants :
pl: W niniejszym tutorialu zestawiono trzy obliczenia stanu podstawowego dla cząsteczki H2. Najpierw otrzymano wartość odniesienia przy użyciu klasycznego minimalnego eigensolvera. Następnie zastosowano ``VQE``, używając do tego QiskitAer ``Estimator`` z 1024 próbami (shots). Na koniec wyodrębniono model szumu z backendu i użyto go do zdefiniowania nowego ``Estimator``-a dla symulacji z szumem. Wyniki są następujące:
pt_un: Neste tutorial, você comparou três cálculos para o estado fundamental da molécula de H2. Primeiro, você produziu um valor de referência usando um autosolver mínimo clássico. Em seguida, você executou ``VQE`` usando o Qiskit Aer ``Estimator`` com 1024 disparos. Finalmente, você extraiu um modelo de ruído de um back-end e o usou para definir um novo ``Estimator`` para simulações de ruído. Os resultados são:
te: ఈ ట్యుటోరియల్‌లో, మీరు H2 మాలిక్యూల్ గ్రౌండ్ స్టేట్ కోసం మూడు లెక్కలను పోల్చారు. ముందుగా, మీరు క్లాసికల్ కనీస ఈజెన్‌సోల్వర్‌ని ఉపయోగించి సూచన విలువను రూపొందించారు. తర్వాత, మీరు 1024 షాట్‌లతో Qiskit Aer ``Estimator``ని ఉపయోగించి ``VQE``ని అమలు చేయడం కొనసాగించారు. చివరగా, మీరు బ్యాకెండ్ నుండి నాయిస్ మోడల్‌ను సంగ్రహించారు మరియు ధ్వనించే అనుకరణల కోసం కొత్త ``ఎస్టిమేటర్``ని నిర్వచించడానికి దాన్ని ఉపయోగించారు. ఫలితాలు:

source: You can notice that, while the noiseless simulation's result is closer to the exact reference value, there is still some difference. This is due to the sampling noise, introduced by limiting the number of shots to 1024. A larger number of shots would decrease this sampling error and close the gap between these two values.
fr: Vous pouvez remarquer que, si le résultat de la simulation sans bruit est plus proche de la valeur de référence exacte, il y a encore une différence. Ceci est dû au bruit d'échantillonnage, introduit en limitant le nombre de coups à 1024. Un plus grand nombre de coups diminuerait cette erreur d'échantillonnage et comblerait l'écart entre ces deux valeurs.
pl: Choć wynik symulacji bez szumu bliski jest dokładnej wartości odniesienia, wciąż istnieje zauważalna różnica. Wynika to z zaszumienia próbkowania spowodowanego liczbą prób ograniczoną do 1024. Zwiększenie liczby prób zmniejszyłoby zaszumienie próbkowania oraz różnicę pomiędzy wartościami.
pt_un: Você pode notar que, embora o resultado da simulação sem ruído esteja mais próximo do valor de referência exato, ainda há uma diferença. Isso se deve ao ruído de amostragem, introduzido ao limitar o número de disparos a 1024. Um número maior de disparos diminuiria esse erro de amostragem e diminuiria a diferença entre esses dois valores.
te: నోయిస్‌లెస్ సిమ్యులేషన్ యొక్క ఫలితం ఖచ్చితమైన రిఫరెన్స్ విలువకు దగ్గరగా ఉన్నప్పటికీ, ఇంకా కొంత తేడా ఉందని మీరు గమనించవచ్చు. షాట్‌ల సంఖ్యను 1024కి పరిమితం చేయడం ద్వారా ప్రవేశపెట్టిన నమూనా శబ్దం దీనికి కారణం. ఎక్కువ సంఖ్యలో షాట్‌లు ఈ నమూనా లోపాన్ని తగ్గించి, ఈ రెండు విలువల మధ్య అంతరాన్ని మూసివేస్తాయి.

source: As for the noise introduced by real devices (or simulated noise models), it could be tackled through a wide variety of error mitigation techniques. The `Qiskit Runtime Primitives <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/>`__ have enabled error mitigation through the ``resilience_level`` option. This option is currently available for remote simulators and real backends accessed via the Runtime Primitives, you can consult `this tutorial <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/Error-Suppression-and-Error-Mitigation.html>`__ for further information.
fr: Quant au bruit généré par des appareils réels (ou des modèles de bruit simulés), il peut être traité par une grande variété de techniques de réduction d'erreur. Le `Qiskit Runtime Primitives <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/>`__ a activé l'atténuation des erreurs via l'option ``resilience_level``. Cette option est actuellement disponible pour les simulateurs distants et les backends réels accessibles via Runtime Primitives, vous pouvez vous référer à `ce tutoriel <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/Error-Suppression-and-Error-Mitigation.html>`__ pour plus d'informations.
pl: Z szumem wyprodukowanym przez rzeczywiste urządzenia (a także symulowane modele szumu) można uporać się za pomocą licznych mitygacji błędów. Elementy podstawowe z `Qiskit Runtime Primitives <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/>`__ pozwalają na mitygację błędów poprzez opcję ``resilience_level``. Opcja ta jest aktualnie dostępna dla zdalnych symulatorów oraz prawdziwych backendów. Można uzyskać do niej dostęp poprzez elementy podstawowe Runtime Primitives. Po więcej informacji przejdź do `tego tutorialu <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/Error-Suppression-and-Error-Mitigation.html>`.
pt_un: Quanto ao ruído introduzido por dispositivos reais (ou modelos de ruído simulados), ele pode ser resolvido por meio de uma ampla variedade de técnicas de mitigação de erros. Os `Qiskit Runtime Primitives <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/>`__ habilitaram a mitigação de erros através da opção ``resilience_level``. Esta opção está atualmente disponível para simuladores remotos e backends reais acessados por meio dos Primitivos de tempo de execução, você pode consultar `este tutorial <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/Error-Suppression-and-Error-Mitigation.html>`__ para mais informações.
te: వాస్తవ పరికరాలు (లేదా అనుకరణ నాయిస్ మోడల్‌లు) ద్వారా పరిచయం చేయబడిన నాయిస్ విషయానికొస్తే, అనేక రకాల లోపాలను తగ్గించే పద్ధతుల ద్వారా దీనిని పరిష్కరించవచ్చు. `Qiskit Runtime Primitives <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/>`__ ``resilience_level`` ఎంపిక ద్వారా లోపాన్ని తగ్గించడాన్ని ప్రారంభించాయి. ఈ ఎంపిక ప్రస్తుతం రిమోట్ సిమ్యులేటర్‌లు మరియు రన్‌టైమ్ ప్రిమిటివ్స్ ద్వారా యాక్సెస్ చేయబడిన రియల్ బ్యాకెండ్‌ల కోసం అందుబాటులో ఉంది, మీరు సంప్రదించవచ్చు `ఈ ట్యుటోరియల్ <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/Error-Suppression-and-Error-Mitigation.html>`__ తదుపరి సమాచారం కోసం.
