Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/03_vqe_simulation_with_noise.po
Languages: bn_bn, es_un, fr, id_id, ja_jp, ko_kr, pl, pt_br, pt_un, ru_ru, ta_in, te, tr_tr, vi_vn, zh_tw

source: This page was generated from `tutorials/algorithms/03_vqe_simulation_with_noise.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/algorithms/03_vqe_simulation_with_noise.ipynb`__ -থেকে বানানো হয়েছে।
es_un: Esta página fue generada desde `tutorials/algorithms/03_vqe_simulation_with_noise.ipynb`__.
fr: Cette page a été générée à partir de `tutorials/algorithms/03_vqe_simulation_with_noise.ipynb`__.
id_id: Halaman ini dibuat dari `tutorials/algoritms/03_vqe_simulation_with_noise.ipynb`__.
ja_jp: このページは `tutorials/algorithms/03_vqe_simulation_with_noise.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/algorithms/03_vqe_simulation_with_noise.ipynb`__ 에서 생성되었다.
pl: Ta strona została wygenerowana z `tutorials/algorithms/03_vqe_simulation_with_noise.ipynb`__.
pt_br: Esta página foi gerada, a partir do `tutorials/algorithms/03_vqe_simulation_with_noise.ipynb`__.
pt_un: Esta página foi gerada, a partir do `tutorials/algorithms/03_vqe_simulation_with_noise.ipynb`__.
ru_ru: Страница создана на основе `tutorials/algorithms/01_algorithms_introduction.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/algorithms/03_vqe_simulation_with_noise.ipynb`__ இதிலிருந்து உருவாக்கப்பட்டது.
te: ఈ పేజీ `tutorials/algorithms/03_vqe_simulation_with_noise.ipynb`__ నుండి రూపొందించబడింది.
tr_tr: Bu sayfa `tutorials/algorithms/03_vqe_simulation_with_noise.ipynb`__ sayfasından oluşturulmuştur.
vi_vn: Trang này được tạo ra từ `tutorials/algorithms/03_vqe_convergence.ipynb`__.
zh_tw: 這個頁面是從`tutorials/algorithms/03_vqe_simulation_with_noise.ipynb`__所產生的。

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/03_vqe_simulation_with_noise.ipynb>`_.
id_id: Jalankan secara interaktif di 'IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/03_vqe_simulation_with_noise.ipynb>`_.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/03_vqe_simulation_with_noise.ipynb>`_ でインタラクティブに実行します。
ko_kr: `IBM 퀀텀 랩 <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/03_vqe_simulation_with_noise.ipynb>`_ 에서 대화식으로 실행하시오.

source: VQE on Aer simulator with noise
bn_bn: এয়ার (Aer) সিমুলেটরে ত্রুটি-যুক্ত ভি.কিউ.ই
es_un: VQE en el simulador Aer con ruido
id_id: VQE di simulator Aer dengan derau
ja_jp: ノイズのある Aer シミュレーターでのVQE
ko_kr: 노이즈가 있는 에어(Aer) 시뮬레이터에서의 VQE
pt_br: VQE no simulador Aer com ruído
ru_ru: VQE на симуляторе Aer с шумом
ta_in: சத்தத்துடன் ஏர் சிமுலேட்டரில் VQE
tr_tr: Aer simülatöründe gürültülü VQE
vi_vn: VQE trên bộ mô phỏng Aer với nhiễu

source: This notebook demonstrates using the `Qiskit Aer <https://qiskit.org/documentation/the_elements.html#aer>`__ ``qasm_simulator`` to run a simulation with noise, based on a given noise model. This can be useful to investigate behavior under different noise conditions. Aer not only allows you to define your own custom noise model, but also allows a noise model to be easily created based on the properties of a real quantum device. The latter is what this notebook will demonstrate since the goal is to show VQE with noise and not the more complex task of how to build custom noise models.
id_id: Notebook ini mendemonstrasikan penggunaan ` Qiskit Aer <https://qiskit.org/documentation/the_elements.html#aer>` __ ` ` qasm_simulator ` ` untuk menjalankan simulasi dengan noise, berdasarkan model noise yang diberikan. Ini berguna untuk menyelidiki perilaku di bawah kondisi noise yang berbeda. Aer tidak hanya memungkinkan Anda untuk mendefinisikan model noise kustom, tetapi juga memungkinkan model noise dibuat berdasarkan perangkat kuantum nyata. Yang terakhir adalah tujuan demonstrasi notebook untuk demonstrasi VQE dengan model noise dan bukan hal lebih rumit bagaimana membuat model noise kustom.

source: `Qiskit Ignis <https://qiskit.org/documentation/the_elements.html#ignis>`__ provides a solution to mitigate the measurement error when running on a noisy simulation or a real quantum device. This solution is leveraged by the ``QuantumInstance`` module which allows any algorithm using it to automatically have measurement noise mitigation applied.
id_id: ` Qiskit Ignis <https://qiskit.org/documentation/the_elements.html#ignis>` __ menyediakan solusi untuk mitigasi error pengukuran ketika eksekusi dengan simulasi noise atau perangkat kuantum nyata. Solusi ini dimanfaatkan oleh modul ` ` QuantumInstance ` ` yang memungkinkan setiap algoritma secara otomatis memiliki mitigasi error pengukuran.

source: Further information on Qiskit Aer noise model can be found in the online `Qiskit Aer documentation <https://qiskit.org/documentation/apidoc/aer_noise.html>`__, also there is tutorial for `building noise models <../simulators/3_building_noise_models.ipynb>`__.
bn_bn: Qiskit Aer নয়েজ মডেল সম্পর্কে আরও তথ্য অনলাইনে পাওয়া যাবে `Qiskit Aer documentation <https://qiskit.org/documentation/apidoc/aer_noise.html>`__,, এছাড়াও `building noise models <../simulators/3_building_noise_models.ipynb>`__ এর জন্য টিউটোরিয়াল আছে ।
es_un: Más información acerca del modelo de ruido de Qiskit Aer puede ser encontrada en `Qiskit Aer documentation <https://qiskit.org/documentation/apidoc/aer_noise.html>`__, ahí también hay un tutorial para construir modelos de ruido <../simulators/3_building_noise_models.ipynb>`__.
id_id: Informasi lebih lanjut tentang model noise Qiskit Aer dapat ditemukan online di ` dokumentasi Qiskit Aer <https://qiskit.org/documentation/apidoc/aer_noise.html>` __, juga ada tutorial untuk ` pembuatan model noise <../simulators/3_building_noise_models.ipynb> ` __.
ja_jp: Qiskit Aer によるノイズ・モデルの詳細については、`Qiskit Aer documentation <https://qiskit.org/documentation/apidoc/aer_noise.html>`__ を参照してください。また `building noise models <../simulators/3_building_noise_models.ipynb>`__ というチュートリアルも用意されています。
ko_kr: 키스킷 에어 노이즈 모델에 대한 자세한 내용은 온라인 `키스킷 에어 문서 <https://qiskit.org/documentation/apidoc/aer_noise.html>`__, 에서 찾을 수 있으며 `노이즈 모델을 생성하는 법 <../simulators/3_building_noise_models.ipynb>`__ 과 관련한 사용 지침서도 있으니 참고하도록 한다.
pt_br: Mais informações sobre o modelo de ruído do Qiskit Aer podem ser encontradas na documentação online do `Qiskit Aer <https://qiskit.org/documentation/apidoc/aer_noise.html>`__, também há um tutorial para `construir modelos de ruído <../simulators/3_building_noise_models.ipynb>`__.
ru_ru: Дополнительную информацию о модели шума Qiskit Aer можно найти в онлайн документации по Qiskit Aer <https://qiskit.org/documentation/apidoc/aer_noise.html>`__, также есть учебник для `building noise models <. /simulators/3_building_noise_models.ipynb>`__.
ta_in: Qiskit ஏர் இரைச்சல் மாதிரியைப் பற்றிய கூடுதல் தகவல்களை ஆன்லைனில் `Qiskit Aer documentation <https://qiskit.org/documentation/apidoc/aer_noise.html>`__, இல் காணலாம், மேலும் அதற்கான பயிற்சி `building noise models <../simulators/3_building_noise_models.ipynb>`__.
tr_tr: Qiskit Aer gürültü modeli ile ilgili daha fazla bilgi çevrimiçi olarak `Qiskit Aer documentation <https://qiskit.org/documentation/apidoc/aer_noise.html>`__ içerisinde bulunabilir, ayrıca gürültü modelleri oluşturmak için `building noise models <../simulators/3_building_noise_models.ipynb>`__ bir eğitsel de vardır.
vi_vn: Thông tin chi tiết về mô hình nhiễu Qiskit Aer có thể được tìm thấy trong tài liệu trực tuyến `Qiskit Aer <https://qiskit.org/documentation/apidoc/aer_noise.html>`__, đồng thời cũng có hướng dẫn cho `xây dựng mô hình nhiễu <../simulators/3_building_noise_moduls.ipynb>`__.
zh_tw: 關於 Qiskit Aer 雜訊模型的更多信息可以在線上 `Qiskit Aer documentation <https://qiskit.org/documentation/apidoc/aer_noise.html>`__ 中找到，還有關於 `building noise models<../simulators/3_building_noise_models.ipynb>`__的教程。

source: Further information on measurement error mitigation in Qiskit Ignis can be found in the tutorial for `measurement error mitigation <https://qiskit.org/documentation/tutorials/noise/3_measurement_error_mitigation.html>`__.
bn_bn: কিসকিট ইগনিসে পরিমাপ ত্রুটি প্রশমনের আরও তথ্য পাওয়া যাবে `measurement error mitigation <https://qiskit.org/documentation/tutorials/noise/3_measurement_error_mitigation.html>` __ এর টিউটোরিয়ালে।
es_un: Más información acerca de la mitigación de errores de medición de Qiskit puede ser encontrada en el tutorial `measurement error mitigation <https://qiskit.org/documentation/tutorials/noise/3_measurement_error_mitigation.html>`__.
id_id: Informasi lebih lanjut tentang mitigasi error pengukuran di Qiskit Ignis dapat ditemukan di tutorial ` mitigasi pengukuran error <https://qiskit.org/documentation/tutorials/noise/3_measurement_error_mitigation.html>` __.
ja_jp: Qiskit Ignisによる測定誤差軽減の詳細については、`measurement error mitigation <https://qiskit.org/documentation/tutorials/noise/3_measurement_error_mitigation.html>`__ というチュートリアルを参照してください。
ko_kr: Qiskit Ignis의 측정 오류 완화에 대한 자세한 정보는 '측정 오류 완화 <https://qiskit.org/documentation/tutorials/noise/3_measurement_error_mitigation.html>' __ 튜토리얼에서 확인할 수 있다.
pt_br: Mais informações sobre mitigação de erro de medição no Qiskit Ignis podem ser encontradas no tutorial para `mitigação de erro de medição <https://qiskit.org/documentation/tutorials/noise/3_measurement_error_mitigation.html>`__.
ta_in: Qiskit இக்னிஸில் அளவீட்டு பிழை குறைப்பு பற்றிய கூடுதல் தகவல்களை `measurement error mitigation <https://qiskit.org/documentation/tutorials/noise/3_measurement_error_mitigation.html>`__. க்கான பயிற்சியில் காணலாம்.
tr_tr: Qiskit Ignis içerisindeki ölçüm hata azaltması ile ilgili daha fazla bilgi `measurement error mitigation <https://qiskit.org/documentation/tutorials/noise/3_measurement_error_mitigation.html>`__ eğitseli içerisinde bulunabilir.
vi_vn: Thông tin chi tiết về giảm thiểu sai số đo lường trong Qiskit Ignis có thể được tìm thấy trong hướng dẫn cho `giảm thiếu sai số đo lường <https://qiskit.org/documentation/tutorials/noise/3_measurement_error_mitigation.html>`__.
zh_tw: 關於 Qiskit Ignis 中減少測量誤差的更多信息可以在 `測量誤差緩解<https://qiskit.org/documentation/tutorials/noise/3_measurement_error_mitigation.html>` 的教程中找到。

source: Noisy simulation will be demonstrated here with VQE, finding the minimum (ground state) energy of an Hamiltonian, but the technique applies to any quantum algorithm from Qiskit Aqua.
id_id: Simulasi noise akan ditunjukkan di sini dengan VQE, menemukan energi minimum (ground state) dari Hamiltonian, tetapi teknik ini berlaku untuk setiap algoritma kuantum dari Qiskit Aqua.
ja_jp: ここでは、ハミルトニアンの最小 (基底) エネルギーを求める VQE を用いてノイズを伴うシミュレーションを示しますが、この手法はQiskit Aquaのいかなる量子アルゴリズムにも適用することが可能です。
ko_kr: 노이즈를 포함한 시뮬레이션은 VQE와 함께 여기에서 설명될 것이고, Hamiltonian의 최소 (접지 상태) 에너지를 찾을 수 있지만, 이 기술은 Qiskit Aqua 로부터의 임의의 양자 알고리즘에 적용된다.

source: So for VQE we need a qubit operator as input. Here, once again, we will take a set of paulis that were originally computed by Qiskit Chemistry, for an H2 molecule, so we can quickly create an Operator.
id_id: Jadi untuk VQE kita butuh operator qubit sebagai input. Di sini, sekali lagi, kita akan mengambil satu set paulis yang awalnya dihitung dengan Qiskit Kimia, untuk molekul H2, sehingga kita dapat dengan cepat membuat sebuah Operator.
ja_jp: VQE は、入力として量子ビット演算子が必要です。ここでもう一度 Qiskit Chemistry によって計算された H2 分子用のパウリ演算子のセットを選ぶことで、すぐに演算子を作成することができます。
ko_kr: 그래서 VQE에 대해서는 큐비트 연산자를 입력으로 해야 한다. 여기서, Qiskit Chemistry에 의해 H2 분자을 계산 한 것처럼, 우리는 신속하게 파풀리스 세트를 이용한 오퍼레이터를 생성할 수 있다.

source: As the above problem is still easily tractable classically we can use NumPyMinimumEigensolver to compute a reference value so we can compare later the results.
bn_bn: যেহেতু উপরের সমস্যাটি এখনও ক্লাসিকভাবে সহজেই ট্র্যাক্টেবল আমরা একটি তথ্যসূত্র (রেফারেন্স) মান গণনা করতে NumPyMinimumEigensolver ব্যবহার করতে পারি যাতে আমরা পরে ফলাফলগুলির তুলনা করতে পারি।
es_un: Como el problema de arriba es resuelto fácilmente de manera clásica, podemos usar NumPyMinimumEigensolver para calcular un valor de referencia para comparar los resultados mas tarde.
id_id: Karena masalah di atas mudah dipecahkan secara klasik kita dapat menggunakan NumPyMinimumEigensolver untuk menghitung nilai referensi untuk membandingkan hasil nanti.
ja_jp: 上記の問題は古典手法によって簡単に解けるので、後で結果を比較できるように、 NumPyMinimumEigensolver を用いて参照値を計算しておきます。
ko_kr: 위의 문제점이 여전히 쉽게 추적 가능하기 때문에 NumPyMinimumEigensolver를 사용하여 참조 값을 계산할 수 있으므로 나중에 결과를 비교할 수 있다.
pt_br: Como o problema acima ainda é facilmente tratável classicamente podemos usar o NumPyMinimumEigensolver para computar um valor de referência para que possamos comparar mais tarde os resultados.
ru_ru: Поскольку приведенная выше задача все еще легко решается классически, мы можем использовать NumPyMinimumEigensolver для вычисления точного значения, чтобы позже сравнить результаты.
ta_in: மேலே பிரச்சினை இன்னும் மிக எளிமையான தட்பவெப்பநிலையைக் கொண்டிருப்பதால் நாம் NumPyMinimumEigensolver பயன்படுத்த முடியும் ஒரு குறிப்பு மதிப்பை கணக்கிட முடியும் அதனால் நாம் பின்னர் முடிவுகளையும் ஒப்பிடுவோம்.
tr_tr: Yukarıdaki sorun hala kolay bir şekilde izlenirken klasik olarak bir referans değeri hesaplamak için NumPyMinimumEigensolver kullanabiliriz, böylece daha sonra sonuçları karşılaştırabiliriz.
vi_vn: Vì vấn đề trên vẫn dễ dàng giải được bằng máy tính cổ điển, chúng ta có thể sử dụng NumPyMinimumEigensolver để tính ra một giá trị tham chiếu để chúng ta có thể so sánh các kết quả sau này.
zh_tw: 由於上述問題使用古典仍然很容易解決，我們可以使用 NumPyMinimumEigensolver 來計算參考值，以便稍後我們比較結果。

source: Performance *without* noise
bn_bn: * ত্রুটি(নয়েস) * ছাড়া কর্মক্ষমতা (পারফরমেন্স)
es_un: Rendimiento *sin* ruido
fr: Performance *sans* bruit
id_id: Kinerja *tanpa* derau
ja_jp: *ノイズがない場合* のパフォーマンス
ko_kr: 노이즈를 *포함하지 않은* 성능
pl: Wydajność *bez* szumu
pt_br: Desempenho *sem* ruído
pt_un: Desempenho *sem* ruído
ru_ru: Производительность *без* шума
ta_in: *ஒலி இல்லாமல் செயல் *
te: ప్రదర్శన * శబ్దం లేకుండా *
tr_tr: Gürültü *olmadan* performans
vi_vn: Hiệu suất *khi không có* nhiễu
zh_tw: *無*雜訊下的表現

source: First we will run on the simulator without adding noise to see the result. I have created the backend and QuantumInstance, which holds the backend as well as various other run time configuration, which are defaulted here, so it easy to compare when we get to the next section where noise is added. There is no attempt to mitigate noise or anything in this notebook so the latter setup and running of VQE is identical.
bn_bn: প্রথমে ফলাফল দেখার জন্য আমরা নয়েজ অ্যাড না করেই সিমুলাটরে একে একবার চালাব। আমি ব্যাকএন্ড এবং QuantumInstance বানিয়ে নিয়েছি, যা ব্যাকএন্ড এর সাথে সাথে বিভিন্ন রান টাইম উপাদান ধরে রাখে। কাজেই যখন আমরা নয়েজযুক্ত ধাপে যাই তখন এভাবে তুলনা করাটা সহজ হয়ে যায়। সুতরাং এখানে নয়েজ বা অন্যকিছু কমানোর কোনই চেষ্টা করা হয়নি যাতে পরের ভি কিউ ই (VQE) সেটাপ এবং চালানো হুবহু একই হয়।
es_un: Primero tenemos que correr el simulador sin añadir ruido para poder ver el resultado. Se crea el backend y el QuantumInstance, que sostiene el backend, al igual que otras configuraciones para la ejecución, que son predeterminadas aquí, para que sea fácil comparar al llegar a la siguiente sección, cuando se le añada el ruido. No hay ningún intento de mitigar el ruido ni nada en este cuaderno, para que la configuración y la ejecución del VQE más adelante, sea idéntica.
id_id: Pertama kita akan eksekusi di simulator tanpa noise untuk melihat hasilnya. Telah dibuat backend dan QuantumInstance, yang memegang backend serta berbagai konfigurasi runtime lainnya, yang menjadi acuan di sini, sehingga mudah untuk dibandingkan ketika kita sampai ke bagian berikutnya di mana noise ditambahkan. Tidak ada upaya untuk mengurangi noise atau apa pun di notebook ini sehingga pengaturan terakhir dan hasil eksekusi VQE adalah identik.
ja_jp: まずは結果を見るため、ノイズを加えずにシミュレーター上で実行してみます。バックエンドとその他のランタイム設定が与えられた QuantumInstance を作成しましたが、次のセクションでノイズを加えた場合と比較がしやすいように、ここではデフォルトの設定となっています。このノートブックではノイズの緩和手法を試していないので、後半部分の設定と VQE の実行は同じです。
ko_kr: 먼저, 결과를 보기 위해 노이즈를 추가하지 않고 시뮬레이터에서 실행한다. 우리는 백엔드와 QuantumInstance를 작성했는데, 이는 여기에서 기본값으로 사용되는 다양한 다른 런타임 구성뿐만 아니라 백엔드도 포함하고 있기 때문에, 다음 섹션에 가면 노이즈가 추가되는 다음 섹션을 쉽게 비교할 수 있다. VQE의 설정 및 실행이 동일하도록, 노이즈 또는 이 노트북에서의 어떤 것을 완화시키려는 시도는 없다.
pt_br: Primeiro vamos rodar no simulador sem adicionar ruído para ver o resultado. Criei o backend e a QuantumInstance, que guarda o backend bem como várias outras configurações de tempo de execução, que são deixadas como padrão aqui, de modo que será fácil de comparar quando chegarmos à próxima seção onde o ruído é adicionado. Não há nenhuma tentativa de mitigar o ruído ou qualquer coisa neste notebook então a última configuração e execução do VQE é idêntica.
ru_ru: Сначала мы запустим симулятор без добавления шума, чтобы увидеть результат. Я создал backend и QuantumInstance, который хранит backend, а также различные другие конфигурации времени выполнения, которые установлены здесь по умолчанию, чтобы было легко сравнить их, когда мы перейдем к следующему разделу, где добавляется шум. В этом блокноте нет попыток уменьшить шум или что-либо еще, поэтому последняя настройка и запуск VQE идентичны.
ta_in: முதலில் முடிவைக் காண சத்தம் சேர்க்காமல் சிமுலேட்டரை இயக்குவோம். நான் பின்தளத்தில் மற்றும் குவாண்டம்இன்ஸ்டான்ஸை உருவாக்கியுள்ளேன், இது பின்தளத்தில் மற்றும் பல ரன் நேர உள்ளமைவுகளை வைத்திருக்கிறது, அவை இங்கு இயல்புநிலையாக உள்ளன, எனவே சத்தம் சேர்க்கப்படும் அடுத்த பகுதிக்கு வரும்போது ஒப்பிடுவது எளிது. இந்த நோட்புக்கில் சத்தம் அல்லது எதையும் குறைக்க எந்த முயற்சியும் இல்லை, எனவே VQE இன் பிந்தைய அமைவு மற்றும் இயக்கம் ஒரே மாதிரியாக இருக்கும்.
tr_tr: Sonucu görmek için ilk olarak gürültü eklemeden simülatör üzerinde çalışacağız. Backendi ve burada varsayılan olarak ayarlanan diğer çeşitli çalışma zamanı yapılandırmasını tutan QuantumInstance'ı ve backendi oluşturdum, böylece gürültünün eklendiği diğer bölüme geçtiğimizde karşılaştırmak kolay olur. Bu not defteri içerisinde gürültüyü ya da herhangi bir şeyi azaltmaya yönelik bir girişim yok. Böylece VQE'nin ikinci kurulumu ve yürütülmesi aynı olur.
vi_vn: Đầu tiên chúng ta sẽ chạy trên trình giả lập mà không cần thêm nhiễu để xem kết quả. Tôi đã tạo backend và QuantumInstance, cái sẽ giữ phần backend cũng như các cấu hình thời gian chạy khác được mặc định ở đây, vì vậy sẽ dễ dàng so sánh khi chúng ta đến phần tiếp theo khi mà nhiễu được thêm vào. Không có bất kì nỗ lực nào để giảm nhiễu hoặc bất cứ thứ gì trong notebook này để lần thiết lập và thực thi sau của VQE là giống hệt.
zh_tw: 首先，我們在不添加雜訊的情況下在模擬器上運行以查看結果。我已經創建了後端和 QuantumInstance，它用來保存了後端以及其他各種運行時的配置，這些配置是預設的，所以對與下一個添加雜訊的部分很容易進行比較。因為我們沒有嘗試降低此筆記本中的雜訊或任何東西，因此後面的 VQE 設置和運行是相同的。

source: We captured the energy values above during the convergence so we can see what went on in the graph below.
bn_bn: আমরা উপরের শক্তির মানগুলো অভিসারের (convergence) সময় সংরক্ষন করেছি, ফলস্বরূপ কি হয়েছে তা আমরা নিম্নোক্ত গ্রাফে দেখতে পাই।
es_un: Guardamos los valores de energía de arriba durante la convergencia para que podamos ver que paso en la grafica de abajo.
id_id: Kami mendapat nilai energi seperti di atas ketika konvergensi sehingga kita dapat melihat apa yang terjadi di grafik di bawah ini.
ja_jp: 上記のエネルギー値が収束とともに得られ、以下のグラフにその挙動を見て取ることができます。
ko_kr: 우리는 수렴하는 동안 위에 있는 에너지 가치를 포착했기 때문에 아래 그래프에서 무엇이 진행되었는지 알 수 있습니다.
pt_br: Nós capturamos os valores da energia acima durante a convergência, para podermos ver o que aconteceu no gráfico abaixo.
ru_ru: Мы зафиксировали приведенные выше значения энергии во время сходимости, чтобы мы могли видеть, что произошло на графике приведенном ниже.
ta_in: ஒன்றிணைக்கும் போது மேலே உள்ள ஆற்றல் மதிப்புகளை நாங்கள் கைப்பற்றினோம், எனவே கீழேயுள்ள வரைபடத்தில் என்ன நடந்தது என்பதைக் காணலாம்.
tr_tr: Yakınsama esnasında yukarıdaki enerji değerlerini yakaladık, böylece aşağıdaki grafikte neler olduğunu görebiliriz.
vi_vn: Chúng ta đã thu được giá trị năng lượng ở trên trong suốt quá trình hội tụ để có thể thấy những gì diễn ra trong đồ thị bên dưới.
zh_tw: 我們在收斂過程中獲得了其能量值，因此我們可以在下圖中看到發生了什麼。

source: Performance *with* noise
bn_bn: নয়েজ *সহ* কর্মক্ষমতা
es_un: Rendimiento *con* ruido
fr: Performance *avec* bruit
id_id: Kinerja *dengan* derau
ja_jp: *ノイズがある場合* のパフォーマンス
ko_kr: 노이즈를 *포함한* 성능
pl: Wydajność *z* szumu
pt_br: Desempenho *com* ruído
pt_un: Desempenho *com* ruído
ru_ru: Производительность *с* шумом
ta_in: சத்தத்துடன் செயல்திறன்
te: ప్రదర్శన *శబ్దంతో*
tr_tr: Gürültü *ile* performans
vi_vn: Hiệu suất *khi có* nhiễu
zh_tw: *有*雜訊下的表現

source: Now we will add noise. Here we will create a noise model for Aer from an actual device. You can create custom noise models with Aer but that goes beyond the scope of this notebook. Links to further information on Aer noise model, for those that may be interested in doing this, were given above.
bn_bn: এখন আমরা নয়েজ যোগ করব। এখানে আমরা আসল ডিভাইস থেকে Aer এর জন্য একটি নয়েজ মডেল তৈরি করব। আপনি চাইলে কাস্টম নয়েজ মডেল তৈরি করে নিতে পারেন কিন্তু সেটা এই নোটবুকের আলোচলনার বাইরে চলে যাবে। যারা এটা করতে চান তাদের জন্য Aer নয়েজ মডেলের বিস্তারিত তথ্যসম্বলিত লিংক উপরে দেওায় আছে।
es_un: Ahora agregaremos el ruido. Aquí crearemos el modelo de ruido para Aer de un dispositivo real. Puedes crear tus propios modelos de ruido con Aer, pero esto esta fuera de lo cubierto en este cuaderno. Los links para ver más información del modelo de ruido de Aer, para los que estén interesados se encuentran más arriba.
id_id: Sekarang kita menambahkan noise. Di sini kita membuat model noise untuk Aer dari perangkat nyata. Anda dapat membuat model kustom noise dengan Aer tapi itu di luar cakupan notebook ini. Tautan ke informasi lebih lanjut tentang model noise Aer, bagi mereka yang mungkin tertarik, diberikan di atas.
ja_jp: 次に、ノイズを加えます。ここでは、実際のデバイスから Aer のノイズ・モデルを作成します。 Aer ではカスタムのノイズ・モデルを作成することができますが、このノートブックでは取り上げません。 Aer ノイズ・モデルに関する詳細は、上記のリンクを参照してください。
ko_kr: 이제 우리는 노이즈를 추가할 것이다. 여기에서 실제 디바이스에서 Aer에 대한 잡음 모델을 만들었다. Aer를 사용하여 사용자 정의 노이즈 모델을 작성할 수 있지만 이는 이 노트북의 범위를 벗어난다. 이를 수행하는 데 관심이 있는 사람들을 위해 Aer 노이즈 모델에 대한 추가 정보에 대한 링크가 제공되었다.
pt_br: Agora vamos adicionar ruído. Aqui vamos criar um modelo de ruído para o Aer a partir de um dispositivo real. Você pode criar modelos de ruído personalizados com o Aer, mas isso vai além do escopo deste notebook. Links para mais informações sobre o modelo de ruído do Aer, para aqueles que possam estar interessados em fazer isso, foram dados acima.
ru_ru: Теперь мы добавим шум. Здесь мы создадим модель шума для Aer на основе реального устройства. Вы можете создавать собственные модели шума в Aer, но это выходит за рамки данного блокнота. Ссылки на дополнительную информацию о модели шума Aer для тех, кто может быть в этом заинтересован, были приведены выше.
ta_in: இப்போது சத்தம் சேர்ப்போம். இங்கே ஒரு உண்மையான சாதனத்திலிருந்து ஏர் க்கான இரைச்சல் மாதிரியை உருவாக்குவோம். நீங்கள் ஏர் மூலம் தனிப்பயன் இரைச்சல் மாதிரிகளை உருவாக்கலாம், ஆனால் அது இந்த நோட்புக்கின் எல்லைக்கு அப்பாற்பட்டது. ஏர் இரைச்சல் மாதிரியைப் பற்றிய கூடுதல் தகவலுக்கான இணைப்புகள், இதைச் செய்ய ஆர்வமுள்ளவர்களுக்கு மேலே கொடுக்கப்பட்டுள்ளன.
tr_tr: Şimdi gürültü ekleyeceğiz. Burada asıl cihazdan Aer için bir gürültü modeli oluşturacağız. Aer ile özel gürültü modelleri oluşturabilirsiniz ancak bu not defterinin kapsamının dışına çıkar. Aer gürültü modeli ile alakalı daha fazla bilgiyi içeren bağlantılar, bunu yapmaya ilgili kişiler için, yukarıda verilmiştir.
vi_vn: Bây giờ chúng ta sẽ thêm nhiễu vào. Tại đây chúng ta sẽ tạo một model nhiễu cho Aer trong một thiết bị thực tế. Bạn có thể tạo một bản nhiễu tùy chỉnh với Aer nhưng điều đó vượt ra ngoài phạm vi của notebook này. Đường dẫn đến các model nhiều trong Aer, cho những ai hứng thú sẽ được để ở phía trên.
