Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/03_vqe_simulation_with_noise.po
Languages: bn_bn, es_un, fr, id_id, ja_jp, ko_kr, pl, pt_br, pt_un, ru_ru, ta_in, te, tr_tr, vi_vn, zh_tw

source: This notebook demonstrates using the `Qiskit Aer <https://qiskit.org/documentation/the_elements.html#aer>`__ ``aer_simulator`` to run a simulation with noise, based on a given noise model. This can be useful to investigate behavior under different noise conditions. Aer not only allows you to define your own custom noise model, but also allows a noise model to be easily created based on the properties of a real quantum device. The latter is what this notebook will demonstrate since the goal is to show VQE with noise and not the more complex task of how to build custom noise models.
bn_bn: এই নোটবুকটিতে দেখানো হয়েছে যে কিভাবে একটি নির্দিষ্ট ত্রুটি (noise) নকশার(simulation) জন্যে `Qiskit Aer <https://qiskit.org/documentation/the_elements.html#aer>`__ ``aer_simulator`` ব্যবহার করে একটি সিমুলেশন চালানো যায়। নানান প্রকৃতির ত্রুটি (noise) এর ফলাফল দেখতে এর সাহায্য নেওয়া যেতে পারে। Aer দ্বারা আপনারা নিজের মনের মতন noise মডেল বানাতে পারেন অথবা একটি আসল কোয়ান্টাম যন্ত্রের বৈশিষ্টের ত্রুটি (noise) মডেল বানাতে পারো। যেহেতু এই নোটবুক এর মূল উদ্দেশ্য ত্রুটিযুক্ত ভি কিউ ই( VQE)-র পরিচালনা করে দেখানো তাই দ্বিতীয় পদ্ধতিটি ব্যবহার করা রয়েছে এখানে।.
es_un: Este cuaderno demuestra el uso de `Qiskit Aer <https://qiskit.org/documentation/the_elements.html#aer>`__ ``aer_simulator`` para ejecutar una simulación con ruido, basada en un modelo de ruido dado. Esto puede resultar útil para investigar el comportamiento en diferentes condiciones de ruido. Aer no solo te permite definir tu propio modelo de ruido personalizado, sino que también permite crear fácilmente un modelo de ruido basado en las propiedades de un dispositivo cuántico real. Esto último es lo que demostrará este cuaderno, ya que el objetivo es mostrar VQE con ruido y no la tarea más compleja de cómo construir modelos de ruido personalizados.
pt_br: Este notebook demonstra o uso do `Qiskit Aer <https://qiskit.org/documentation/the_elements.html#aer>`__ ``aer_simulator`` para executar uma simulação com ruído, baseado em um determinado modelo de ruído. Isso pode ser útil para investigar o comportamento sob diferentes condições de ruído. O Aer não só lhe permite definir seu próprio modelo de ruído personalizado, mas também permite que um modelo de ruído seja facilmente criado baseado nas propriedades de um dispositivo quântico real. Este segundo é o que este notebook irá demonstrar, uma vez que o objetivo é mostrar o VQE com ruído e não a tarefa mais complexa de como construir modelos de ruído personalizados.
ru_ru: Этот блокнот демонстрирует использование `Qiskit Aer <https://qiskit.org/documentation/the_elements.html#aer>`__ ``aer_simulator`` для запуска симуляции с шумом, основанной на заданной модели шума. Это может быть полезно для исследования поведения при различных видах шума. Aer не только позволяет определить собственную модель шума, но и позволяет легко создать модель шума на основе свойств реального квантового устройства. Последнее и будет продемонстрировано в этом блокноте, поскольку целью является демонстрация VQE с шумом, а не более сложная задача построения собственных моделей шума.
ta_in: `Qiskit Aer <https://qiskit.org/documentation/the_elements.html#aer>`__ ``aer_simulator`` கொடுக்கப்பட்ட இரைச்சல் மாதிரியை அடிப்படையாகக் கொண்டு, சத்தத்துடன் ஒரு உருவகப்படுத்துதலை இயக்க இந்த நோட்புக் நிரூபிக்கிறது. வெவ்வேறு இரைச்சல் நிலைமைகளின் கீழ் நடத்தை விசாரிக்க இது பயனுள்ளதாக இருக்கும். உங்கள் சொந்த தனிப்பயன் இரைச்சல் மாதிரியை வரையறுக்க ஏர் உங்களை அனுமதிப்பது மட்டுமல்லாமல், உண்மையான குவாண்டம் சாதனத்தின் பண்புகளின் அடிப்படையில் இரைச்சல் மாதிரியை எளிதில் உருவாக்க அனுமதிக்கிறது. பிந்தையது இந்த நோட்புக் நிரூபிக்கும் என்பதால், VQE ஐ சத்தத்துடன் காண்பிப்பதே குறிக்கோள், தனிப்பயன் இரைச்சல் மாதிரிகளை எவ்வாறு உருவாக்குவது என்பது மிகவும் சிக்கலான பணி அல்ல.
tr_tr: Bu not defteri belirli bir gürültü tabanlı model üzerinde, gürültülü simülasyon çalıştırmayı `Qiskit Aer <https://qiskit.org/documentation/the_elements.html#aer>` kullanarak gösterir. Farklı gürültü koşullarının altında davranış incelemek için yararlı/kullanışlı olabilir. Aer, tek kendi özel gürültü modelinizi tanımlamaya değil, gerçek kuantum ayıtlarının özelliklerine bağlı olarak kolayca gürültülü model oluşturmanıza da izin verir. Son olarak bu not defterinin amacı gürültülü VQE'yi göstermek olduğundan özel gürültü modelleri oluşturmanın daha karmaşık görevlerini gösterme amacı yoktur.
zh_tw: 此筆記本示範使用 `Qiskit Aer <https://qiskit.org/documentation/the_elements.html#aer>`__ ``aer_simulator`` ，根據給定的雜訊模型來執行含有雜訊的模擬。這對於在不同雜訊條件下的行為進行調查很有用。 Aer 不僅可以讓您定義自己的自訂雜訊模型，也可讓雜訊模型根據真實量子元件的特性而輕易地被建立。後者是這個筆記本將展示的，因為目標是顯示有雜訊的 VQE ，而不是如何建立自訂雜訊模型的更複雜的任務。

source: `Qiskit Ignis <https://qiskit.org/documentation/apidoc/ignis.html>`__ provides a solution to mitigate the measurement error when running on a noisy simulation or a real quantum device. This solution is leveraged by the ``QuantumInstance`` module which allows any algorithm using it to automatically have measurement noise mitigation applied.
bn_bn: `Qiskit Ignis <https://qiskit.org/documentation/apidoc/ignis.html>`___ একটি নয়েসি সিমুলেশন বা একটি বাস্তব কোয়ান্টাম ডিভাইসে চলার সময় পরিমাপ ত্রুটি প্রশমিত করার সমাধান প্রদান করে। এই সমাধানটি ``QuantumInstance`` মডিউল দ্বারা লিভারেজ করা হয়েছে যা এটি ব্যবহার করে যে কোনও অ্যালগরিদমকে স্বয়ংক্রিয়ভাবে পরিমাপের দূষণ বা ত্রুটি প্রশমন প্রয়োগ করতে দেয়।
es_un: `Qiskit Ignis <https://qiskit.org/documentation/apidoc/ignis.html>`__ proporciona una solución para mitigar el error de medición cuando se ejecuta en una simulación ruidosa o en un dispositivo cuántico real. Esta solución es aprovechada por el módulo ``QuantumInstance`` que permite que cualquier algoritmo que lo utilice tenga aplicada automáticamente la mitigación del ruido de medición.
pt_br: `Qiskit Ignis <https://qiskit.org/documentation/apidoc/ignis.html>`__ fornece uma solução para mitigar o erro de medição quando executado em uma simulação ruidosa ou em um dispositivo quântico real. Esta solução é aproveitada pelo módulo ``QuantumInstance`` que permite que qualquer algoritmo que o usa tenha automaticamente aplicada a atenuação do ruído de medição.
ta_in: `Qiskit Ignis <https://qiskit.org/documentation/apidoc/ignis.html>`__ சத்தமில்லாத உருவகப்படுத்துதல் அல்லது உண்மையான குவாண்டம் சாதனத்தில் இயங்கும் போது அளவீட்டு பிழையைத் தணிக்க ஒரு தீர்வை வழங்குகிறது. இந்த தீர்வு ``QuantumInstance`` தொகுதிக்கூறுகளால் பயன்படுத்தப்படுகிறது, இது எந்த வழிமுறையும் பயன்படுத்தும் அளவீட்டு தானாக அளவீட்டு இரைச்சல் குறைப்பை அனுமதிக்கிறது.
tr_tr: `Qiskit Ignis <https://qiskit.org/documentation/the_elements.html#ignis>`__ gürültülü bir simülasyon ya da gerçek bir kuantum cihaz üzerinde çalışırken ölçüm hatasının azaltılması için bir çözüm sağlamaktadır. Bu çözüm, otomatik olarak ölçüm gürültü azaltması uygulamak için kullanılan her algoritmaya olanak sağlayan ``QuantumInstance`` modülü tarafından oluşturulmaktadır.
zh_tw: `Qiskit Ignis <https://qiskit.org/documentation/apidoc/ignis.html>`__ 提供一個解決方案，以減少在雜訊模擬或實際量子元件上執行時的測量誤差。此解決方案被``QuantumInstance`` 模組所利用，它允許使用它的任何演算法自動開啟具有測量雜訊降低功能。

source: Noisy simulation will be demonstrated here with VQE, finding the minimum (ground state) energy of an Hamiltonian, but the technique applies to any quantum algorithm from Qiskit.
bn_bn: VQE দিয়ে এখানে ত্রুটিপূর্ণ সিমুলেশন দেখানো হবে, হ্যামিল্টোনিয়ানের ন্যূনতম (গ্রাউন্ড স্টেট ) শক্তি খুঁজে পাওয়া যাবে, কিন্তু কৌশলটি কিস্কিটের যেকোনো কোয়ান্টাম অ্যালোগরিদমের ক্ষেত্রে প্রযোজ্য।
es_un: La simulación ruidosa se demostrará aquí con VQE, encontrando la energía mínima (estado fundamental) de un Hamiltoniano, pero la técnica se aplica a cualquier algoritmo cuántico de Qiskit.
pt_br: Asimulação ruidosa será demonstrada aqui com o VQE, encontrando a energia mínima (estado fundamental) de um Hamiltoniano, mas a técnica se aplica a qualquer algoritmo quântico de Qiskit.
ru_ru: Симуляция с шумом будет продемонстрирована здесь на примере VQE, находящего минимальную (основного состояния) энергию гамильтониана, но метод применим к любому квантовому алгоритму из Qiskit.
ta_in: ஒரு ஹாமில்டோனியனின் குறைந்தபட்ச (தரை நிலை) ஆற்றலைக் கண்டுபிடிக்கும் VQE உடன் சத்தம் உருவகப்படுத்துதல் இங்கே நிரூபிக்கப்படும், ஆனால் கிஸ்கிட்டிலிருந்து எந்த குவாண்டம் அல்காரிதத்திற்கும் இந்த நுட்பம் பொருந்தும்.
tr_tr: Gürültü simülasyonu burada VQE, bir Hamiltonian'ın minimum enerjisini (taban durumu) bulma ile gösterilecektir fakat teknik Qiskit Aqua'dan herhangi bir kuantum algoritması için geçerlidir.
zh_tw: 利用VQE尋找哈密頓量最小能量(基態) 的範例，噪音模擬會在這裡被演示 ，找到哈密頓量的最小（地面狀態）能量，但該技術適用於 Qiskit 的任何量子演算法。

source: So for VQE we need a qubit operator as input. Here, once again, we will take a set of paulis that were originally computed by Qiskit Nature, for an H2 molecule, so we can quickly create an Operator.
bn_bn: সুতরাং VQE এর জন্য আমাদের ইনপুট হিসাবে একটি কিউবিট অপারেটর প্রয়োজন। এখানে, আবার, আমরা একটি H2 অণুর জন্য Qiskit নেচার দ্বারা গণনা করা পাউলির একটি সেট নেবে, যাতে আমরা দ্রুত একটি অপারেটর তৈরি করতে পারি।
es_un: Entonces, para VQE, necesitamos un operador de qubits como entrada. Aquí, una vez más, tomaremos un conjunto de paulis que fueron originalmente calculados por Qiskit Nature, para una molécula de H2, para que podamos crear rápidamente un Operator.
pt_br: Portanto, precisamos de um operador de qubit como entrada para o VQE. Aqui, mais uma vez, vamos pegar um conjunto de paulis que foram originalmente calculados no Qiskit Nature para uma molécula H2, para que possamos criar um Operator rapidamente.
ru_ru: Итак, для VQE нам нужен оператор кубита в качестве входных данных. Здесь мы снова возьмем набор операторов Паули, которые были первоначально вычислены Qiskit Nature для молекулы H2, чтобы быстро создать оператор.
ta_in: மூலக்கூறுஎனவே VQE க்கு உள்ளீடாக ஒரு குயுபிட் ஆபரேட்டர் தேவை. இங்கே, மீண்டும், H2 மூலக்கூறுக்காக, Qiskit வேதியியலால் முதலில் கணக்கிடப்பட்ட பாலிஸின் தொகுப்பை எடுப்போம், எனவே விரைவாக ஒரு ஆபரேட்டரை உருவாக்க முடியும்.
tr_tr: VQE için girdi olarak bir kübit operatörüne ihtiyacımız vardır. Burada, bir kez daha, bir H2 molekülü için ilk olarak Qiskit Chemistry tarafından hesaplanan bir paulis seti alacağız, bu şekilde hızlıca bir operatör oluşturabiliriz.
zh_tw: 因此，對於 VQE，我們需要一個量子位元算子作為輸入。在這裡，再一次，我們會拿一組由 Qiskit Nature 所計算出來的 paulis ，用於一個 H2 分子，這樣我們就可以快速建立一個算子。

source: The ``QuantumInstance`` module provides a solution to mitigate the measurement error when running on a noisy simulation or a real quantum device. This allows any algorithm using it to automatically have measurement noise mitigation applied.
ru_ru: Модуль ``QuantumInstance`` предоставляет способ уменьшения ошибки измерения при запуске на симуляторе с шумом или на реальном квантовом устройстве. Это позволяет любому алгоритму, использующему его, автоматически выполнять уменьшение шума измерений.

source: VQE with Qiskit Aer Primitives
fr: VQE avec Qiskit Aer Primitives
pl: VQE z elementami podstawowymi Qiskit Aer
pt_un: VQE com Qiskit Aer Primitives
te: Qiskit Aer Primitives తో VQE

source: This notebook demonstrates how to leverage the `Qiskit Aer Primitives <https://qiskit.org/documentation/apidoc/aer_primitives.html>`__ to run both noiseless and noisy simulations locally. Qiskit Aer not only allows you to define your own custom noise model, but also to easily create a noise model based on the properties of a real quantum device. This notebook will show an example of the latter, to illustrate the general workflow of running algorithms with local noisy simulators.
fr: Ce notebook montre comment tirer parti des `Qiskit Aer Primitives <https://qiskit.org/documentation/apidoc/aer_primitives.html>`__ pour exécuter localement des simulations sans bruit et avec bruit. Qiskit Aer vous permet non seulement de définir votre propre modèle de bruit personnalisé, mais aussi de créer un modèle de bruit basé sur les propriétés d'un vrai appareil quantique facilement. Ce nootbook montrera un exemple de ce dernier, pour illustrer le workflow général des algorithmes d'exécutions avec des simulateurs locaux de bruit.
pl: Ten notes pokazuje jak wykorzystać `elementy podstawowe Qiskit Aer <https://qiskit.org/documentation/apidoc/aer_primitives.html>`__ do lokalnej symulacji z szumem lub bez. Qiskit Aer pozwala na zdefiniowanie niestandardowych modeli szumu, jak i na stworzenie ich na wzór właściwości prawdziwych urządzeń kwantowych. Ten notes prezentuje przykład tworzenia tego drugiego rodzaju modelu, żeby zobrazować ogólny przebieg pracy algorytmów z lokalnymi symulatorami z szumem.
pt_un: Este notebook demonstra como aproveitar o `Qiskit Aer Primitives <https://qiskit.org/documentation/apidoc/aer_primitives.html>`__ para executar simulações silenciosas e ruidosas localmente. O Qiskit Aer não apenas permite que você defina seu próprio modelo de ruído personalizado, mas também crie facilmente um modelo de ruído com base nas propriedades de um dispositivo quântico real. Este notebook mostrará um exemplo do último, para ilustrar o fluxo de trabalho geral da execução de algoritmos com simuladores locais de ruído.
te: స్థానికంగా శబ్దం లేని మరియు ధ్వనించే అనుకరణలను అమలు చేయడానికి `Qiskit Aer Primitives <https://qiskit.org/documentation/apidoc/aer_primitives.html>`__ ఎలా ఉపయోగించాలో ఈ నోట్‌బుక్ ప్రదర్శిస్తుంది. Qiskit Aer మీ స్వంత కస్టమ్ నాయిస్ మోడల్‌ను నిర్వచించడమే కాకుండా, నిజమైన క్వాంటం పరికరం యొక్క లక్షణాల ఆధారంగా సులభంగా నాయిస్ మోడల్‌ను రూపొందించడానికి కూడా మిమ్మల్ని అనుమతిస్తుంది. స్థానిక ధ్వనించే అనుకరణ యంత్రాలతో రన్నింగ్ అల్గారిథమ్‌ల యొక్క సాధారణ వర్క్‌ఫ్లోను వివరించడానికి ఈ నోట్‌బుక్ రెండో దానికి ఉదాహరణను చూపుతుంది.

source: For further information on the Qiskit Aer noise model, you can consult the `Qiskit Aer documentation <https://qiskit.org/documentation/apidoc/aer_noise.html>`__, as well the tutorial for `building noise models <../simulators/3_building_noise_models.ipynb>`__.
fr: Pour plus d'informations sur le modèle de bruit Qiskit Aer, vous pouvez consulter la `documentation de Qiskit Aer <https://qiskit.org/documentation/apidoc/aer_noise.html>`__. ainsi que le tutoriel pour `construire des modèles de bruit <. /simulators/3_building_noise_models.ipynb>`__.
pl: Więcej informacji na temat modelu szumu Qiskit Aer można znaleźć w `Dokumentacji Qiskit Aer <https://qiskit.org/documentation/apidoc/aer_noise.html>`__, jak również poradniku `tworzenie modeli szumu <../simulators/3_building_noise_models.ipynb>`__.
pt_un: Para mais informações sobre o modelo de ruído Qiskit Aer, você pode consultar a `documentação do Qiskit Aer <https://qiskit.org/documentation/apidoc/aer_noise.html>`__, bem como o tutorial para `construir modelos de ruído <.. /simulators/3_building_noise_models.ipynb>`__.
te: Qiskit Aer నాయిస్ మోడల్‌పై మరింత సమాచారం కోసం, మీరు `Qiskit Aer డాక్యుమెంటేషన్ <https://qiskit.org/documentation/apidoc/aer_noise.html>`__, అలాగే `బిల్డింగ్ నాయిస్ మోడల్స్ కోసం ట్యుటోరియల్‌ని సంప్రదించవచ్చు. <../simulators/3_building_noise_models.ipynb>`__.

source: The algorithm of choice is once again VQE, where the task consists on finding the minimum (ground state) energy of a Hamiltonian. As shown in previous tutorials, VQE takes in a qubit operator as input. Here, you will take a set of Pauli operators that were originally computed by Qiskit Nature for the H2 molecule, using the ``SparsePauliOp`` class.
fr: L'algorithme choisi est encore une fois le VQE, où la tâche consiste à trouver l'énergie minimale (état fondamental) d'un hamiltonien. Comme indiqué dans les tutoriels précédents, le VQE utilise un opérateur de qubit en entrée. Ici, vous prenez un ensemble d'opérateurs de Pauli qui ont été initialement calculés par Qiskit Nature pour la molécule H2, en utilisant la classe ``SparsePauliOp``.
pl: Również w tym wypadku wybieramy algorytm VQE, a zadanie polega na znalezieniu minimalnej energii (stanu podstawowego) hamiltonianu. Tak jak pokazano w poprzednich tutorialach, VQE przyjmuje operator kubita jako dane wejściowe. W tym przypadku weźmy operatory Pauliego utworzone przez Qiskit Nature dla cząsteczki H2 przy użyciu klasy ``SparsePauliOp``.
pt_un: O algoritmo escolhido é mais uma vez o VQE, onde a tarefa consiste em encontrar a energia mínima (estado fundamental) de um hamiltoniano. Conforme mostrado nos tutoriais anteriores, o VQE usa um operador qubit como entrada. Aqui, você pegará um conjunto de operadores de Pauli que foram originalmente calculados pelo Qiskit Nature para a molécula H2, usando a classe ``SparsePauliOp``.
te: ఎంపిక యొక్క అల్గోరిథం మరోసారి VQE, ఇక్కడ పని హామిల్టోనియన్ యొక్క కనీస (గ్రౌండ్ స్టేట్) శక్తిని కనుగొనడం. మునుపటి ట్యుటోరియల్‌లలో చూపినట్లుగా, VQE క్విట్ ఆపరేటర్‌ను ఇన్‌పుట్‌గా తీసుకుంటుంది. ఇక్కడ, మీరు ``SparsePauliOp`` క్లాస్‌ని ఉపయోగించి, H2 మాలిక్యూల్ కోసం Qiskit Nature ద్వారా మొదట గణించబడిన Pauli ఆపరేటర్‌ల సమితిని తీసుకుంటారు.

source: As the above problem is still easily tractable classically, you can use ``NumPyMinimumEigensolver`` to compute a reference value to compare the results later.
fr: Comme le problème ci-dessus est toujours facilement tractable classiquement, vous pouvez utiliser ``NumPyMinimumEigensolver`` pour calculer une valeur de référence pour les résultats plus tard.
pl: Jako że powyższy problem jest łatwy do namierzenia klasycznie, możesz użyć ``NumPyMinimumEigensolver``, aby obliczyć wartość odwołania w celu późniejszego porównania wyników.
pt_un: Como o problema acima ainda é facilmente tratável classicamente, você pode usar ``NumPyMinimumEigensolver`` para calcular um valor de referência para comparar os resultados posteriormente.
te: పై సమస్య ఇప్పటికీ క్లాసికల్‌గా సులభంగా పరిష్కరించదగినదిగా ఉన్నందున, ఫలితాలను తర్వాత పోల్చడానికి సూచన విలువను గణించడానికి మీరు ``NumPyMinimumEigensolver``ని ఉపయోగించవచ్చు.

source: The following examples will all use the same ansatz and optimizer, defined as follows:
fr: Les exemples suivants utiliseront tous les mêmes ansatz et optimiseur, défini comme suit :
pl: Poniższe przykłady wykorzystują ten sam ansatz oraz optymalizator, zdefiniowane w następujący sposób:
pt_un: Os exemplos a seguir usarão o mesmo ansatz e otimizador, definidos da seguinte forma:
te: కింది ఉదాహరణలు అన్నీ ఒకే ansatz మరియు ఆప్టిమైజర్‌ని ఉపయోగిస్తాయి, ఈ క్రింది విధంగా నిర్వచించబడ్డాయి:

source: Let's first run the ``VQE`` on the default Aer simulator without adding noise, with a fixed seed for the run and transpilation to obtain reproducible results. This result should be relatively close to the reference value from the exact computation.
fr: Tout d'abord, exécutons le ``VQE`` avec le simulateur Aer par défaut sans ajouter de bruit, avec une graine fixe pour l'exécution et effectuons la transpilation pour obtenir des résultats reproductibles. Ce résultat devrait être relativement proche de la valeur de référence du calcul exact.
pl: Przeprowadź najpierw ``VQE`` na domyślnym symulatorze Aer bez dodawania szumu, z określonym ziarnem dla danego uruchomienia i transpilacji w celu uzyskania powtarzalnych wyników. Wynik powinien być dość zbliżony do wartości odniesienia z dokładnych obliczeń.
pt_un: Vamos primeiro executar o ``VQE`` no simulador Aer padrão sem adicionar ruído, com uma seed fixa para a execução e transpilação para obter resultados reprodutíveis. Este resultado deve ser relativamente próximo ao valor de referência do cálculo exato.
te: పునరుత్పాదక ఫలితాలను పొందడం కోసం రన్ మరియు ట్రాన్స్‌పిలేషన్ కోసం స్థిరమైన సీడ్‌తో శబ్దాన్ని జోడించకుండా డిఫాల్ట్ Aer సిమ్యులేటర్‌లో ముందుగా ``VQE``ని రన్ చేద్దాం. ఈ ఫలితం ఖచ్చితమైన గణన నుండి సూచన విలువకు సాపేక్షంగా దగ్గరగా ఉండాలి.

source: You captured the energy values above during the convergence, so you can track the process in the graph below.
fr: Vous avez capturé les valeurs énergétiques ci-dessus lors de la convergence, vous pouvez donc suivre le processus dans le graphique ci-dessous.
pl: Powyższe wartości energii zostały przechwycone podczas konwergencji. Proces można zaobserwować na poniższym wykresie.
pt_un: Você capturou os valores de energia acima durante a convergência, então você pode acompanhar o processo no gráfico abaixo.
te: కన్వర్జెన్స్ సమయంలో మీరు పైన ఉన్న శక్తి విలువలను క్యాప్చర్ చేసారు, కాబట్టి మీరు దిగువ గ్రాఫ్‌లో ప్రాసెస్‌ని ట్రాక్ చేయవచ్చు.

source: Now, let's add noise to our simulation. In particular, you will extract a noise model from a (fake) device. As stated in the introduction, it is also possible to create custom noise models from scratch, but this task is beyond the scope of this notebook.
fr: Maintenant, ajoutons du bruit à notre simulation. En particulier, vous allez extraire un modèle de bruit à partir d’un (faux) appareil. Comme indiqué dans l'introduction, il est également possible de créer des modèles de bruit personnalisés à partir de zéro, mais cette tâche dépasse le cadre de ce notebook.
pl: Teraz uwzględnijmy szum w naszej symulacji. Model szumu wyodrębnić można z (fałszywego) urządzenia. Jak zaznaczono we wstępie, istnieje możliwość stworzenia niestandardowego modelu szumu od podstaw, ale zadanie to wykracza poza zakres tego poradnika.
pt_un: Agora, vamos adicionar ruído à nossa simulação. Em particular, você extrairá um modelo de ruído de um dispositivo (falso). Conforme comentado na introdução, também é possível criar do zero modelos de ruído personalizados, mas isso está além do escopo deste notebook.
te: ఇప్పుడు, మన అనుకరణకు శబ్దాన్ని జోడిద్దాం. ప్రత్యేకించి, మీరు (నకిలీ) పరికరం నుండి నాయిస్ మోడల్‌ను సంగ్రహిస్తారు. పరిచయంలో చెప్పినట్లుగా, స్క్రాచ్ నుండి కస్టమ్ శబ్దం నమూనాలను సృష్టించడం కూడా సాధ్యమే, అయితే ఈ పని ఈ నోట్బుక్ యొక్క పరిధికి మించినది.

source: First, you need to get an actual device backend and from its ``configuration`` and ``properties`` you can setup a coupling map and a noise model to match the device. Note: You can also use this coupling map as the entanglement map for the variational form if you choose to.
fr: Tout d'abord, voud devez obtenir un système d'execurtion réel et nous pouvons configurer une carte de couplage et un modèle de bruit à partir de sa ``configuration`` et de ses ``properties`` pour qu'il corresponde à l'appareil. Remarque : Vous pouvez aussi utiliser cette carte de couplage comme carte d'intrication pour la forme variationnelle si vous le choisissez.
pl: Po pierwsze, z poziomu backendu urządzenia możesz stworzyć mapę połączeń kwantowych (coupling map) oraz model szumu zgodny z urządzeniem, używając do tego ``configuration`` i ``properties``. Zauważ, że możesz też użyć mapy połączeń jako mapy splątań kwantowych dla alternatywnej formy.
pt_un: Primeiro, você precisa obter um back-end do dispositivo real e, a partir de sua ``configuração`` e ``propriedades``, você pode configurar um mapa de acoplamento e um modelo de ruído para corresponder ao dispositivo. Observação: você também pode usar este mapa de acoplamento como o mapa de emaranhamento para a forma variacional, se desejar.
te: ముందుగా, మీరు అసలు పరికర బ్యాకెండ్‌ని పొందాలి మరియు దాని ``కాన్ఫిగరేషన్`` మరియు ``ప్రాపర్టీస్`` నుండి మీరు పరికరానికి సరిపోయేలా కప్లింగ్ మ్యాప్ మరియు నాయిస్ మోడల్‌ను సెటప్ చేయవచ్చు. గమనిక: మీరు ఈ కప్లింగ్ మ్యాప్‌ని ఎంచుకుంటే వైవిధ్య ఫారమ్‌కు చిక్కు మ్యాప్‌గా కూడా ఉపయోగించవచ్చు.
