Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/04_vqe_advanced.po
Languages: bn_bn, es_un, fr_fr, id_id, ja_jp, ko_kr, pt_br, ru_ru, ta_in, te_in, tr_tr, vi_vn

source: Where this becomes useful for examples where we the solution to one problem can be used to for a guess for the solution to a very close similar problem. Chemistry is very good example where we change the inter-atomic distance(s) of molecule to plot a dissociation profile. When the distance changes are small we expect the solution to still be nearby the prior one. One technique is to simply use the optimal point from one solution as the starting point for the next step. Now more complex techniques are possible that do some extrapolation to compute an initial position based on prior solution(s) rather than directly use the prior solution. The Qiskit Chemistry `sampling_potential_energy_surfaces <../chemistry/05_Sampling_potential_energy_surfaces.ipynb#Extrapolation>`__ tutorial shows such bootstrapping and extrapolation.
es_un: Esto puede ser bastante útil para ejemplos donde la solución a un problema puede ser usado para una suposición para una solución a un problema muy similar. La química es un muy buen ejemplo donde cambiamos las distancias inter-atómicas de una molécula para graficar un perfil de disociación. Cuando los cambios de distancia son pequeños esperamos que la solución sea cercana a la anterior. Una técnica es simplemente usar el punto optimo de una solución como el punto de partida para el siguiente paso. Hay técnicas mas complejas que utilizan extrapolaciones para calcular un punto inicial basado en los resultados anteriores, en vez de directamente usar la solución anterior. El tutorial de Qiskit Chemistry `sampling_potential_energy_surfaces <../chemistry/05_Sampling_potential_energy_surfaces.ipynb#Extrapolation>` muestra este bootstrapping y extrapolación.
fr_fr: Cela devient utile pour des exemples où nous pouvons utiliser la solution à un problème pour trouver une solution à un problème similaire très proche. La chimie est un très bon exemple où nous changeons la distance interatomique de la molécule pour tracer un profil de dissociation. Lorsque les changements de distance sont faibles, nous nous attendons à ce que la solution reste à proximité de la précédente. L'une des techniques consiste à simplement utiliser le point optimal d'une solution comme point de départ pour l'étape suivante. Maintenant, des techniques plus complexes sont possibles qui font une extrapolation pour calculer une position initiale basée sur la(les) solution(s) antérieure(s) plutôt que d'utiliser directement la solution précédente. Le tutoriel `sampling_potential_energy_surfaces <../chemistry/05_Sampling_potential_energy_surfaces.ipynb#Extrapolation>`__ montre un tel processus d'amorçage et d'extrapolation.
id_id: Ini berguna untuk contoh-contoh di mana solusi untuk satu masalah dapat digunakan untuk tebakan masalah lain yang serupa. Kimia adalah satu contoh baik di mana kita mengubah jarak antar atom di molekul untuk plot profil disosiasi. Ketika perubahan jarak kecil diharapkan solusi masih berada di dekat yang sebelumnya. Salah satu teknik adalah dengan menggunakan titik optimal dari satu solusi sebagai titik awal untuk langkah berikutnya. Sekarang teknik yang lebih kompleks bisa diterapkan dari ekstrapolasi untuk menghitung titik awal berdasarkan solusi sebelumnya daripada langsung menggunakan solusi sebelumnya. Tutorial Qiskit Chemistry ` sampling_potential_energy_permukaan <../chemistry/05_Sampling_potential_energy_surfaces.ipynb#Extrapolation> ` __ menunjukkan cara bootstrapping dan ekstrapolasi untuk itu.
ko_kr: 이는 하나의 문제에 대한 해결책이 상당히 유사한 문제에 대한 해결책을 추측하는데 사용될 수 있는 예제들에 유용하게 사용된다. 화학에서 좋은 예시로 분자의 원자 간 거리를 변경하며 dissociation 프로파일을 그려야 하는 경우가 있다. 거리 변화가 적을 때 우리는 솔루션이 여전히 이전 솔루션의 근처에 있을 것으로 예상할 수 있다. 한 가지 테크닉은 단순하게 한 솔루션의 최적 점을 다음 단계의 시작 지점으로 사용하는 것이다. 이제 이전 솔루션을 직접 사용하는 대신 이전 솔루션을 기반으로 초기 위치를 계산하기 위하여 약간의 외삽(extrapolation)을 수행하는 더 복잡한 기술이 가능하다. 키스킷 화학의 `sampling_potential_energy_surfaces <../chemistry/05_Sampling_potential_energy_surfaces.ipynb#Extrapolation>`__ 사용 지침서는 이러한 bootstrapping과 외삽을 보여준다.
pt_br: Isso torna-se útil por exemplo quando a solução para um problema pode ser utilizada para adivinhar a solução de um problema muito semelhante. A química é um bom exemplo, onde mudamos distância(s) interatômica(s) da molécula para traçar um perfil de dissociação. Quando as variações da distância são pequenas, esperamos que a solução ainda esteja nas proximidades da anterior. Uma técnica é simplesmente usar o ponto ideal de uma solução como ponto de partida para o próximo passo. Agora, técnicas mais complexas que fazem alguma extrapolação para calcular uma posição inicial com base em soluções prévias ao invés de usar diretamente a solução anterior são possíveis. O tutorial `sampling_potential_energy_surfaces <../chemistry/05_Sampling_potential_energy_surfaces.ipynb#Extrapolation>`__ do Qiskit Chemistry mostra o bootstraping e a extrapolação.
vi_vn: Khi điều này trở nên hữu ích cho các ví dụ mà chúng ta giải pháp cho một vấn đề có thể được sử dụng để đoán giải pháp cho một vấn đề tương tự rất gần. Hóa học là một ví dụ rất tốt khi chúng ta thay đổi khoảng cách giữa các nguyên tử (s) của phân tử để vẽ một cấu hình phân ly. Khi những thay đổi về khoảng cách nhỏ chúng ta mong đợi giải pháp vẫn ở gần đó. Một kỹ thuật là chỉ cần sử dụng điểm tối ưu từ một giải pháp là điểm bắt đầu cho bước tiếp theo. Bây giờ các kỹ thuật phức tạp hơn là có thể thực hiện một số phép ngoại suy để tính toán một vị trí ban đầu dựa trên các giải pháp trước đó thay vì sử dụng trực tiếp các giải pháp trước đó. Hướng dẫn Qiskit Chemistry `sampling_potential_energy_surfaces <../chemistry/05_Sampling_potential_energy_surfaces.ipynb#Extrapolation>`__ chỉ ra bootstrapping và sự mở rộng.

source: Expectation
bn_bn: গড় মান
es_un: Valor Esperado
fr_fr: Espérance
id_id: Ekspektasi
ko_kr: 기대
pt_br: Expectativas
ru_ru: Математическое ожидание
ta_in: எதிர்பார்ப்பு
te_in: ఎక్స్పిటేషన్
tr_tr: Beklenti
vi_vn: Kỳ vọng

source: The energy of the Hamiltonian operator that VQE is working on is the expectation value when evaluated with the parameterized variational form. To compute the expectation value VQE uses an instance of an `expectation <https://qiskit.org/documentation/apidoc/qiskit.aqua.operators.expectations.html>`__ object. Such an instance may be supplied via the ``expectation`` parameter, or in the default case, where it has a value of ``None``, VQE will use the `ExpectationFactory <https://qiskit.org/documentation/stubs/qiskit.aqua.operators.expectations.ExpectationFactory.html>`__ to create itself a suitable instance based on the supplied backend.
es_un: La energía del operador Hamiltoniano que el VQE esta utilizando es el valor esperado cuando se evalúa con la forma variacional parametrizada. Para calcular el valor esperado VQE utiliza una instancia de un objeto `expectation <https://qiskit.org/documentation/apidoc/qiskit.aqua.operators.expectations.html>`__. Dicha instancia puede ser suministrada utilizando el parámetro ``expectation``, o en el caso por defecto, donde tiene un valor de ``None``, el VQE va a usar `ExpectationFactory <https://qiskit.org/documentation/stubs/qiskit.aqua.operators.expectations.ExpectationFactory.html>`__ para crear una instancia por si solo basada en el backend suministrado.
fr_fr: L'énergie de l'opérateur Hamiltonien sur lequel VQE travaille est la valeur attendue lorsqu'il est évalué avec la forme variationnelle paramétrée. Pour calculer la valeur attendue, VQE utilise une instance d'un objet `expectation <https://qiskit.org/documentation/apidoc/qiskit.aqua.operators.expectations.html>`__. Une telle instance peut être fournie via le paramètre ``expectation``, ou dans le cas par défaut, où elle a une valeur de ``None``, VQE utilisera la `ExpectationFactory <https://qiskit.org/documentation/stubs/qiskit.aqua.operators.expectations.ExpectationFactory.html>`__ pour créer une instance appropriée basée sur le backend fourni.
id_id: Energi dari operator Hamiltonian yang VQE hitung adalah nilai ekspektasi ketika dievaluasi dengan bentuk variasional berparameter. Untuk menghitung nilai ekspektasi VQE menggunakan sebuah instans dari objek ` expectation <https://qiskit.org/documentation/apidoc/qiskit.aqua.operators.expectations.html>`. Instans tersebut dapat dipasok melalui parameter ` ` expectation ` `, atau secara default, ketika nilainya ` ` None ` `, VQE akan menggunakan ` ExpectationFactory <https://qiskit.org/documentation/stubs/qiskit.aqua.operators.expectations.ExpectationFactory.html>` __ untuk membuat sendiri sebuah instans yang sesuai dengan backend yang disediakan.
ja_jp: VQEが求めているハミルトニアン演算子のエネルギーは、パラメーター化された変分形式で評価された場合の期待値です。期待値を計算するために、 VQE は `expectation <https://qiskit.org/documentation/apidoc/qiskit.aqua.operators.expectations.html>`__ オブジェクトのインスタンスを使用しています。このようなインスタンスは ``expectation`` パラメーターで与えられますが、デフォルトで ``None`` の値を取っている場合に VQE は、 `ExpectationFactory <https://qiskit.org/documentation/stubs/qiskit.aqua.operators.expectations.ExpectationFactory.html>`__ を用いて、与えられたバックエンドに基づき、適切なインスタンスを作成します。
ko_kr: VQE가 작업하고 있는 해밀토니안 연산자의 에너지는 파라미터화된 variational form과 함께 평가될 때의 기대값이다. 기대값을 계산하기 위해, VQE는 `expectation <https://qiskit.org/documentation/apidoc/qiskit.aqua.operators.expectations.html>`__ 객체의 인스턴스를 사용한다. 이러한 인스턴스는 ``expectation`` 매개변수를 통해 제공되거나, 디폴트( ``None`` )값인 경우, VQE는 제공된 백엔드를 기반으로 적절한 인스턴스를 생성하기 위하여 `ExpectationFactory <https://qiskit.org/documentation/stubs/qiskit.aqua.operators.expectations.ExpectationFactory.html>`__ 를 사용할 것이다.
pt_br: A energia do operador Hamiltoniano no qual o VQE está trabalhando é o valor esperado quando avaliado com a forma variacional parametrizada. Para calcular o valor esperado o VQE usa uma instância de um objeto `expectation <https://qiskit.org/documentation/apidoc/qiskit.aqua.operators.expectations.html>`__. Tal instância pode ser fornecida através do parâmetro ``expectation``, ou no caso padrão em que ela tem um valor de ``None``, o VQE usará a `ExpectationFactory <https://qiskit.org/documentation/stubs/qiskit.aqua.operators.expectations.ExpectationFactory.html>`__ para criar por si próprio uma instância adequada com base no backend fornecido.
vi_vn: Năng lượng của toán tử Hamilton mà VQE đang làm việc là giá trị kỳ vọng khi được đánh giá với dạng biến phân tham số hóa. Để tính toán giá trị kỳ vọng, VQE sử dụng một instanace của đối tượng `expectation <https://qiskit.org/documentation/apidoc/qiskit.aqua.operators.expectations.html>`__. Một instance như vậy có thể được cung cấp thông qua tham số ``expectation`` hoặc trong trường hợp mặc định sẽ mang giá trị ``None``, VQE sẽ sử dụng `ExpectationFactory <https://qiskit.org/documentation/stubs/qiskit.aqua.operators.expectations.ExpectationFactory.html>__ để tự tạo một instance phù hợp dựa trên backend được cung cấp.

source: For most cases letting VQE create a suitable instance is sufficient. However the Qiskit Aer qasm_simulator supports a snapshot instruction that can be used in conjunction with the operator expectation computation. If used then the outcome is ideal, i.e. like the statevector simulator, and has no shot noise. Since people normally choose the qasm_simulator to have shot noise (sampling noise), and be more like a real-device outcome, VQE has an ``include_custom`` flag that is passed on to the ExpectationFactory. When using Aer qasm simulator, and this is set ``True``, the factory will return ``AerPauliExpectation`` which uses the snapshot instruction, when ``False``, default, then the regular ``PauliExpectation`` is returned.
es_un: Para la mayoría de los casos, permitir que VQE cree una instancia adecuada es suficiente. Sin embargo, Qiskit Aer qasm_simulator soporta la instrucción "snapshot" que se puede usar junto con el cálculo de valor esperado del operador. Si se utiliza, entonces el resultado es ideal— es decir, como el simulador de vectores de estado— y no tiene ruido de disparo. Dado que normalmente la gente elige el simulador qasm_simulador para que haya ruido en las mediciones (ruido de muestreo) y que sea más parecido a un resultado de un dispositivo real, VQE tiene el flag ``include_custom`` que es pasado a ExpectationFactory. Cuando se usa el simulador qasm de Aer y esto es ``True``, ExpectationFactory devolverá ``AerPauliExpectation`` que usa la instrucción snapshot, cuando sea `` False ``, por defecto, devuelve el ``PauliExpectation`` normal.
fr_fr: Dans la plupart des cas, laisser VQE créer une instance appropriée est suffisant. Cependant, le qasm_simulator de Qiskit Aer prend en charge une instruction d'instantané (snapshot) qui peut être utilisée en conjonction avec le calcul de valeur attendue de l'opérateur. S'il est utilisé alors le résultat est idéal, c'est-à-dire comme le simulateur statevector, et n'a pas de bruit dû à un nombre de mesures fini. Puisque le qasm_simulator est souvent choisi pour avoir ce bruit de mesure (bruit d'échantillonnage), et être plus proche d'un résultat matériel réel, VQE a un flag ``include_custom`` qui est passé à l'ExpectationFactory. Lorsque vous utilisez le simulateur Aer qasm_simulator, et ``include_custom`` est défini à ``True``, l'ExpectationFactory retournera ``AerPauliExpectation`` qui utilise les instructions de l'instantané, quand ``False``, par défaut, alors la ``PauliExpectation`` normale est retournée.
id_id: Untuk sebagian besar kasus cukup dengan membiarkan VQE membuat instans yang sesuai. Namun, Qiskit Aer qasm_simulator mendukung instruksi snapshot yang dapat digunakan dengan operator penghitungan ekspektasi. Jika digunakan maka hasilnya adalah ideal, yaitu seperti simulator statevector, dan tidak ada noise dari shot. Karena pilihan biasa qasm_simulator memiliki noise dari shot (noise dari sampling), dan berlaku seperti hasil perangkat nyata, VQE memiliki flag ` ` include_custom ` ` yang diteruskan ke ExpectationFactory. Ketika menggunakan Aer qasm simulator, dan diset ` ` True ` `, factory akan mengembalikan ` ` AerPauliExpectation ` ` dengan instruksi snapshot, ketika ` ` False ` `, yang default, seperti biasa mengembalikan ` ` PauliExpectation ` `.
ja_jp: ほとんどの場合は VQE に作成させるだけで十分です。しかし Qiskit Aer の qasm_simulator はスナップショット命令をサポートしており、演算子の期待値計算と組み合わせて用いることができます。これを使えば、状態ベクトル・シミュレーターのように、出力はショット・ノイズの乗らない理想的なものとなります。通常はショット・ノイズ (サンプリング・ノイズ) を乗せて、より実デバイスに近い結果が得られるよう、 qasm_simulator を選択するので、 VQE にはExpectationFactory に渡される ``include_custom`` フラグが用意されています。これを True に設定すると、スナップショット命令を使用した ``AerPauliExpectation`` が返され、デフォルトの False に設定すると、通常の ``PauliExpectation`` が返されます。
ko_kr: 대부분의 경우 VQE가 적절한 인스턴스를 생성하도록 하는 것으로 충분하다. 그러나 Qiskit Aer qasm_simulator는 연산자 기대값 연산과 함께 사용할 수 있는 snapshot instruction을 제공한다. 이를 사용하면 이상적인 (즉, 상태 벡터 시뮬레이터와 같이) 결과를 얻을 수 있으며 샷 노이즈가 없다. 사람들은 일반적으로 qasm_simulator를 선택하여 샷 노이즈 (샘플링 노이즈)를 갖고, 이는 실제 장치의 결과와 유사하기 때문에, VQE에는 ExpectationFactory에 전달되는 ``include_custom`` 플래그가 있다. Aer qasm simulator를 사용할 때, 플래그를 ``True`` 로 설정하면 ExpectationFactory는 snapshot instruction을 사용하는 ``AerPauliExpectation`` 를 반환할 것이고, ``False`` (디폴트)로 설정하면, ``PauliExpectation`` 를 반환할 것이다.
pt_br: Para a maioria dos casos deixar o VQE criar uma instância adequada é suficiente. No entanto o qasm_simulator do Qiskit Aer suporta uma instrução instantânea (snapshot) que pode ser usada em conjunto com o cálculo da esperança do operador. Se for usada o resultado é ideal, isto é, como o simulador de statevector, e não tem shot-noise. Uma vez que as pessoas normalmente escolhem o qasm_simulator para ter shot-noise (ruído de amostragem), e ser mais parecido com o resultado de um dispositivo real, o VQE tem uma flag ``include_custom`` que é passada para a ExpectationFactory. Quando estiver usando o simulador qasm do Aer, e está estiver definida como ``True``, a fábrica retornará uma ``AerPauliExpectation`` que usa a instrução instantânea, já quando estiver definida como ``False``, padrão, é retornada a ``PauliExpectation`` habitual.
vi_vn: Đối với hầu hết các trường hợp, để VQE tạo một instance phù hợp là đủ. Tuy nhiên, Qiskit Aer qasm_simulator hỗ trợ một lệnh chụp nhanh có thể được sử dụng cùng với tính toán kỳ vọng của phép toán. Nếu lệnh chụp nhanh được sử dụng thì kết quả là lý tưởng, tức là giống như trình mô phỏng trạng thái và không có nhiễu trong quá trình lấy mẫu. Vì mọi người thường chọn qasm_simulator để có nhiễu trong việc lấy mẫu và giống với kết quả thực tế, VQE có cờ ``include_custom`` được chuyển đến ExpectationFactory. Khi sử dụng Aer qasm simulator và và giá trị của cờ ``include_custom`` là ``True``, factory sẽ trả về ``AerPauliExpectation`` sử dụng lệnh chụp nhanh, khi cờ ``include_custom`` mang giá trị mặc định là ``False``, kết quả trả về là ``PauliExpectation`` thông thường.

source: The following example shows ``include_custom=True`` where the outcome matches the statevector simulator. In fact it can be better/faster to do this than use the statevector_simulator directly. This is because in the latter case when the Hamiltonian is a sum of Paulis it must be converted to matrix form, and this is avoided when using the snapshot instruction done when include_custom is True.
bn_bn: নিম্নলিখিত উদাহরনসমুহে যেখানে ফলাফল স্টেটভেক্টোর সিমুলেটরের সাথে মিলে যায় সেখানে ``include_custom=True`` দেখায়। এমনকি সরাসরি স্টেটভেক্টোর সিমুলেটর ব্যবহার না করে এভাবে করলে এগুলোর গতি আরও বাড়বে। এর কারণ হল পরবর্তীতে যখন হ্যামিল্টোনিয়ান পাউলিগুলোর যোগফল হবে, তখন একে অবশ্যই ম্যাট্রিক্স আকারে রূপান্তর করতে হবে। আর যখন include_custom True হবে এবং স্ন্যাপশট নির্দেশনা ব্যবহৃত হবে, তখন একে এড়িয়ে যাওয়া হবে।
es_un: El siguiente ejemplo muestra ``include_custom=True`` donde el resultado coincide con el simulador de vectores de estado. De hecho, puede ser mejor/más rápido hacer esto en lugar de utilizar el statevector_simulator directamente. Esto es porque, cuando el Hamiltoniano es una suma de matrices de Pauli, este debe ser convertido a forma matricial y al usar la instrucción snapshot cuando include_custom es True, esto es evitado.
fr_fr: L'exemple suivant montre ``include_custom=True`` où le résultat correspond au simulateur statevector. En fait, il peut être mieux/plus rapide de le faire que d'utiliser directement le simulateur statevector_simulator. C'est parce que dans ce dernier cas lorsque le Hamiltonien est une somme de Paulis, il doit être converti en une matrice, ce qui est évité lors de l'utilisation de l'instruction de snapshot lorsque include_custom est True.
id_id: Contoh berikut menunjukkan ` ` include_custom=True ` ` di mana hasilnya cocok dengan simulator statevector. Pada kenyataannya bisa lebih baik/lebih cepat melakukan ini daripada langsung menggunakan statevector_simulator. Hal ini karena dalam kasus terakhir ketika Hamiltonian adalam jumlah dari term Pauli, ia harus dikonversi ke bentuk matrik, dan ini dihindari ketika menggunakan instruksi snapshot waktu include_custom adalah True.
ko_kr: 다음 예제는 결과가 상태 벡터 시뮬레이터와 일치하는 ``include_custom=True`` 를 보여준다. 사실 statevector_simulator를 직접 사용하는 것보다 이 작업을 수행하는 것이 더 좋고/빠를 수 있다. 이는 (Pauli 합인 Hamiltonian이 행렬 형식으로 변환되어야 하는) 후자의 경우, include_custom이 True일 때 snapshot 명령을 수행하면 이를 방지할 수 있기 때문이다.
pt_br: O exemplo a seguir mostra ``include_custom=True`` onde o resultado corresponde ao simulador de statevector. Na verdade, pode ser melhor/mais rápido fazer isso do que usar o statevector_simulator diretamente. Isto porque, no último caso, quando o Hamiltoniano é uma soma de Paulis, ele tem de ser convertido para a forma matricial, e isso é evitado com o uso da instrução snapshot quando include_custom é True.
ru_ru: Следующий пример показывает ``include_custom=True``, где результат соответствует симулятору statevector. На самом деле это может быть лучше/быстрее, чем использовать statevector_simulator напрямую. Это происходит потому, что в последнем случае, когда гамильтониан является суммой операторов Паули, он должен быть преобразован в матричную форму, а этого можно избежать при использовании инструкции snapshot, выполняемой, когда include_custom равен True.
ta_in: பின்வரும் எடுத்துக்காட்டு ``include_custom=True`` ஐக் காட்டுகிறது, அங்கு விளைவு, ஸ்டேட்வெக்டர் சிமுலேட்டருடன் பொருந்துகிறது. உண்மையில் statevector_simulator-ஐ நேரடியாகப் பயன்படுத்துவதை விட இதைச் செய்வது நல்லது/வேகமாக இருக்கும். ஏனென்றால், பின்வரும் சந்தர்ப்பத்தில், ஹாமில்டோனியன் Paulis தொகையாக இருக்கும்போது அது மேட்ரிக்ஸ் வடிவமாக மாற்றப்பட வேண்டும், மேலும் include_custom உண்மை எனும்போது செய்யப்படும் ஸ்னாப்ஷாட் வழிமுறைகளைப் பயன்படுத்தும்போது இது தவிர்க்கப்படுகிறது.
te_in: కింది ఉదాహరణ ``include_custom=True``ని చూపుతుంది, ఇక్కడ ఫలితం స్టేట్‌వెక్టర్ సిమ్యులేటర్‌తో సరిపోలుతుంది. నిజానికి స్టేట్‌వెక్టర్_సిమ్యులేటర్‌ని నేరుగా ఉపయోగించడం కంటే దీన్ని చేయడం మంచిది/వేగంగా ఉంటుంది. ఎందుకంటే హామిల్టోనియన్ అనేది పాలిస్ యొక్క మొత్తం అయినప్పుడు అది తప్పనిసరిగా మాతృక రూపంలోకి మార్చబడాలి మరియు చేర్చబడిన_కస్టమ్ నిజం అయినప్పుడు చేసిన స్నాప్‌షాట్ సూచనలను ఉపయోగించినప్పుడు ఇది నివారించబడుతుంది.
tr_tr: Aşağıdaki örnek, sonucun ``include_custom=True`` ile eşleştiği durum vektör simülatörünü gösterir. Aslında bu, statevector_simulator'ü doğrudan kullanmadan daha iyi/daha hızlı olabilir. Bunun nedeni, Hamiltonyen'in, Pauli'lerin toplamı olduğu ikinci durumda matris formuna dönüştürülmesi gerektiğidir ve include_custom True olduğunda yapılan anlık görüntü talimatı kullanılırken bundan kaçınılır.
vi_vn: Ví dụ sau cho thấy ``include_custom = True`` trong đó kết quả khớp với trình mô phỏng của statevector. Trên thực tế, làm điều này có thể tốt hơn / nhanh hơn so với sử dụng trực tiếp statevector_simulator. Nguyên nhân là do trong trường hợp sau đây, khi toán tử Hamilton là một tổng của các phép đo Pauli, nó phải được chuyển đổi thành dạng ma trận và điều này được bỏ qua khi lệnh chụp nhanh được thực hiện và giá trị của include_custom là True.
