Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/04_vqe_advanced.po
Languages: bn_bn, es_un, fr_fr, id_id, ja_jp, ko_kr, pt_br, ru_ru, ta_in, te_in, tr_tr, vi_vn

source: By default, the ``PauliExpectation`` object, that would have be chosen when include_custom is False (or when using Aer aer_simulator, or a real device) groups Paulis into commuting sets. This is efficient as it runs less circuits to compute the expectation. However, if for some reason you wanted to run a circuit for each Pauli then then grouping can be turned off when constructing the PauliExpectation. You need to explicitly pass in such an expectation instance to VQE to have it work this way though as shown below.
bn_bn: প্রাথমিকভাবে, PauliExpectation অবজেক্ট, যখন include_custom FALSE বা Aer aer_simulator, বা একটি বাস্তব ডিভাইস ব্যবহার করার সময় পাউলিগুলকে কমিউটিং সেটে গ্রুপ করে, তখন এটি নির্বাচন করা হবে। এটি কার্যকর, কার্‌ এটি এক্সপেক্টেশন মান হিসাব করার জন্য কম সার্কিট চালায়। যাইহোক, যদি কোন কারণে আপনি প্রতিটি পাউলির জন্য একটি সার্কিট চালাতে চান তবে পলি এক্সপেক্টেশন নির্মাণের সময় গ্রুপিং বন্ধ করা যেতে পারে। VQE- এর কাছে এইরকম এক্সপেক্টেশনের উদাহরণ আপনাকে যেভাবে স্পষ্টভাবে পাস করতে হবে তা নিম্নরূপ ।
ru_ru: По умолчанию объект ``PauliExpectation'', который будет выбран, если include_custom равен False (или при использовании Aer aer_simulator, или реального устройства), группирует операторы Паули в коммутирующие множества. Это эффективно, так как запускается меньше схем для вычисления матожидания. Однако, если по какой-то причине вы хотите запустить цепь для каждого оператора Паули, то группировку можно отключить при построении PauliExpectation. Для этого нужно явно передать VQE экземпляр такого математического ожидания, как показано ниже.
ta_in: இயல்பாக, ``PauliExpectation`` பொருளில்உதாரணம், include_custom தவறானது (அல்லது Aer aer_simulator அல்லது ஒரு உண்மையான சாதனத்தைப் பயன்படுத்தும் போது) Paulis பயணத் தொகுப்புகளாகக் குழுவாகக் கொண்டிருக்கும். எதிர்பார்ப்பைக் கணக்கிடுவதற்கு இது குறைந்த சர்க்யூட்களை இயக்குவதால் இது திறமையானது. இருப்பினும், சில காரணங்களால் நீங்கள் ஒவ்வொரு Pauli-க்கும் ஒரு சர்க்யூட் இயக்க விரும்பினால், PauliExpectation -ஐ உருவாக்கும்போது குழுவாக்கத்தை அணைக்க முடியும். கீழே காட்டப்பட்டுள்ளபடி இந்த வழியில் செயல்பட நீங்கள் VQE க்கு இதுபோன்ற எதிர்பார்ப்பு நிகழ்வில் வெளிப்படையாக அனுப்ப வேண்டும்.
te_in: డిఫాల్ట్‌గా, ``PauliExpectation`` ఆబ్జెక్ట్, చేర్చబడిన_కస్టమ్ తప్పు అయినప్పుడు (లేదా Aer aer_simulator, లేదా నిజమైన పరికరాన్ని ఉపయోగిస్తున్నప్పుడు) పాలీస్‌ను కమ్యూటింగ్ సెట్‌లుగా వర్గీకరిస్తుంది. నిరీక్షణను గణించడానికి ఇది తక్కువ సర్క్యూట్‌లను అమలు చేస్తుంది కాబట్టి ఇది సమర్థవంతమైనది. అయితే, కొన్ని కారణాల వల్ల మీరు ప్రతి పౌలికి సర్క్యూట్‌ని అమలు చేయాలనుకుంటే, పౌలీ ఎక్స్‌పెక్టేషన్‌ను నిర్మిస్తున్నప్పుడు సమూహాన్ని ఆఫ్ చేయవచ్చు. దిగువ చూపిన విధంగా ఈ విధంగా పని చేయడానికి మీరు VQEకి అటువంటి నిరీక్షణ సందర్భంలో స్పష్టంగా పాస్ చేయాలి.
tr_tr: Varsayılan olarak, include_custom öğesi False olduğunda (veya Aer aer_simulator veya gerçek bir aygıt kullanılırken) seçilecek olan ``PauliExpectation`` nesnesi, Paulis'i gidip gelme kümeleri halinde gruplandırır. Bu, beklentiyi hesaplamak için daha az devre çalıştırdığı için verimlidir. Ancak, herhangi bir nedenle her Pauli için bir devre çalıştırmak isterseniz, o zaman PauliExpectation oluşturulurken gruplama kapatılabilir. Aşağıda gösterildiği gibi, bu şekilde çalışmasını sağlamak için böyle bir beklenti örneğini açıkça VQE'ye iletmeniz gerekir.

source: While you may be familiar with passing a QuantumInstancen created from a ``aer_simulator_statevector`` a ``aer_simulator`` or real device backend, it is possible to use the advanced simulation modes of Aer too when applicable. For instance we can easily use the Aer `Matrix Product State <../simulators/7_matrix_product_state_method.ipynb>`__ method, that has the potential to scale to larger numbers of qubits.
bn_bn: যদিও আপনি ``aer_simulator_statevector`` থেকে ``aer_simulator``থেকে তৈরি কোয়ান্টাম ইন্সট্যান্সন পাস করার সাথে পরিচিত হতে পারেন, প্রযোজ্য হলে এয়ারের উন্নত সিমুলেশন মোডগুলিও ব্যবহার করা সম্ভব। উদাহরণস্বরূপ, আমরা সহজেই aer ম্যাট্রিক্স প্রোডাক্ট স্টেট পদ্ধতি ব্যবহার করতে পারি, যা বৃহত্তর সংখ্যক কিউবিট পর্যন্ত বর্ধিত করার সম্ভাবনা রাখে।
ru_ru: Несмотря на то, что вы можете быть знакомы с передачей QuantumInstance, созданного из ``aer_simulator_statevector``, на backend ``aer_simulator`` или на реальное устройство, можно использовать и дополнительные режимы моделирования Aer, когда это применимо. Например, мы можем легко использовать метод Aer `Matrix Product State <.../simulators/7_matrix_product_state_method.ipynb>`__, который позволяет увеличить число кубитов.
ta_in: ``aer_simulator_statevector`` ஒரு ``aer_simulator`` அல்லது உண்மையான சாதன பின்தளத்தில் இருந்து உருவாக்கப்பட்ட ஒரு QuantumInstance கடத்துவதை நீங்கள் அறிந்திருக்கலாம், பொருந்தும் போது Aer-இன் மேம்பட்ட சிமுலேஷன் பயன்முறைகளையும் பயன்படுத்தலாம். உதாரணமாக, Aer `Matrix Product நிலை <../simulators/7_matrix_product_state_method.ipynb>`__ முறையை நாம் எளிதாகப் பயன்படுத்தலாம், இது அதிக எண்ணிக்கையிலான க்யூபிட்ஸ்களுக்கு அளவிடக்கூடிய ஆற்றலைக் கொண்டுள்ளது.
te_in: మీరు ``aer_simulator_statevector`` నుండి సృష్టించబడిన QuantumInstanceని ఉత్తీర్ణత సాధించి ఉండవచ్చు, ఒక ``aer_simulator`` లేదా నిజమైన పరికర బ్యాకెండ్, వర్తించేటప్పుడు Aer యొక్క అధునాతన అనుకరణ మోడ్‌లను కూడా ఉపయోగించడం సాధ్యమవుతుంది. ఉదాహరణకు, మేము Aer `మ్యాట్రిక్స్ ఉత్పత్తి స్థితి <../simulators/7_matrix_product_state_method.ipynb>`__ పద్ధతిని సులభంగా ఉపయోగించవచ్చు, అది పెద్ద సంఖ్యలో క్విట్‌లకు స్కేల్ చేయగల సామర్థ్యాన్ని కలిగి ఉంటుంది.
tr_tr: Bir ``aer_simulator_statevector``dan ``aer_simulator`` veya gerçek cihaz arka ucundan oluşturulan bir QuantumInstancen'i geçirmeye aşina olsanız da, uygun olduğunda Aer'in gelişmiş simülasyon modlarını kullanmak da mümkündür. Örneğin, daha fazla sayıda kübite ölçekleme potansiyeline sahip Aer `Matrix Product State <../simulators/7_matrix_product_state_method.ipynb>`__ yöntemini kolayca kullanabiliriz.

source: Here we we see that result was arrived at much more quickly where ``optimizer_evals`` is 10 versus 72 when it started from a random value when the initial point was not supplied (default of None).
ja_jp: ここでは、初期値が与えられず (デフォルトでNone) ランダムな値から開始した場合の 72 という ``optimizer_evals`` の値が 10 となっていることから、結果がより早く得られているのがわかります。

source: Where this becomes useful for examples where we the solution to one problem can be used to for a guess for the solution to a very close similar problem. Chemistry is very good example where we change the inter-atomic distance(s) of molecule to plot a dissociation profile. When the distance changes are small we expect the solution to still be nearby the prior one. One technique is to simply use the optimal point from one solution as the starting point for the next step. Now more complex techniques are possible that do some extrapolation to compute an initial based on prior solution(s) rather than directly use the prior solution. The Qiskit Chemistry `sampling_potential_energy_surfaces <../chemistry/05_Sampling_potential_energy_surfaces.ipynb#Extrapolation>`__ tutorial shows such bootstrapping and extrapolation.
ja_jp: これが役に立つのは、例えばある問題に対する解を、それに非常に似た問題に対する解の推測のために使える場合です。化学は、分子の原子間距離を変えて、解離プロファイルをプロットするという、非常に良い例です。距離の変化が小さい場合には、解がその前の解の近くにあることが予測されます。一つの手法として単純に、ある解の最適点を次のステップの出発点として用いることがあります。現在では、前の解を直接的に用いるのではなく、前の解に基づいて外挿を行って初期値を計算するという、より複雑なテクニックが可能となっています。Qiskit Chemistry の `sampling_potential_energy_surfaces <../chemistry/05_Sampling_potential_energy_surfaces.ipynb#Extrapolation>`__ チュートリアルでは、このようなブートストラップと外挿を紹介しています。
