Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/04_vqe_advanced.po
Languages: bn_bn, es_un, fr_fr, id_id, ja_jp, ko_kr, pt_br, ru_ru, ta_in, te_in, tr_tr, vi_vn

source: This page was generated from `tutorials/algorithms/04_vqe_advanced.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/algorithms/04_vqe_advanced.ipynb`__ -থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/algorithms/04_vqe_advanced.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/algorithms/04_vqe_advanced.ipynb`__.
id_id: Halaman ini dibuat dari `tutorials/algoritms/04_vqe_advanced.ipynb`__.
ja_jp: このページは `tutorials/algorithms/04_vqe_advanced.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/algorithms/04_vqe_advanced.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada, a partir do `tutorials/algorithms/04_vqe_advanced.ipynb`__.
ru_ru: Эта страница создана на основе `tutorials/algorithms/04_vqe_advanced.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/algorithms/04_vqe_advanced.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
te_in: ఈ పేజీ `tutorials/algorithms/04_vqe_advanced.ipynb`__ నుండి రూపొందించబడింది.
tr_tr: Bu sayfa `tutorials/algorithms/04_vqe_advanced.ipynb`__ adresinden oluşturulmuştur.
vi_vn: Trang này được tạo ra từ `tutorials/algorithms/02_vqe_convergence.ipynb`__.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/04_vqe_advanced.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/04_vqe_advanced.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `<https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/04_vqe_advanced.ipynb>`_.
id_id: Jalankan secara interaktif di 'IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/04_vqe_advanced.ipynb>`_.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/04_vqe_advanced.ipynb>`_ でインタラクティブに実行します。
ko_kr: `IBM 퀀텀 랩 <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/04_vqe_advanced.ipynb>`_ 에서 대화식으로 실행하시오.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/04_vqe_advanced.ipynb>`_.
ta_in: இயக்குநிலை தொடர்புக்கு `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/04_vqe_advanced.ipynb>`_.
vi_vn: Chạy tương tác trong `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/04_vqe_advanced.ipynb>`_.

source: Advanced VQE usage
bn_bn: উন্নত ভি কিউ ই ব্যবহার
es_un: Uso avanzado del VQE
fr_fr: Utilisation avancée de VQE
id_id: Penggunaan VQE tingkat lanjut
ja_jp: VQE の高度な使い方
ko_kr: VQE 활용 심화
pt_br: Uso avançado do VQE
ru_ru: Расширенное использование VQE
ta_in: மேம்பட்ட VQE பயன்பாடு
te_in: అధునాతన VQE వినియోగం
tr_tr: Gelişmiş VQE kullanımı
vi_vn: Sử dụng VQE nâng cao

source: There exist several parameters for configuring and using more advanced `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__ capabilities. This tutorial will cover the parameters such as ``initial_point``, ``expectation`` and ``gradient``.
es_un: Existen varios parámetros para configurar y usar capacidades más avanzadas del `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__. Este tutorial va a cubrir los parámetros como ``initial_point``, ``expectation`` y``gradient``.
fr_fr: Il existe plusieurs paramètres permettant de configurer et d'utiliser des capacités avancées de "VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>" __ . Ce tutoriel couvrira les paramètres tels que ``initial_point``, ``attente`` et ``gradient``.
id_id: Ada beberapa parameter untuk konfigurasi dan penggunaan ` VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>` __ lebih lanjut. Tutorial ini akan mencakup parameter seperti ` ` ` initial_point ` `, ` ` expectation ` ` dan ` ` gradient ` `.
ja_jp: `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__ のより高度な機能を設定して使用するために、いくつかのパラメータが用意されています。このチュートリアルでは、 ``initial_point``, ``expectation``, ``gradient`` などのパラメーターについて説明します。
ko_kr: 심화된 `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__ 기능을 구성하고 사용하기 위한 몇 가지 매개변수가 있다. 본 사용 지침서에서는 ``initial_point``, ``expectation``, ``gradient`` 등의 매개변수를 다룰 것이다.
pt_br: Existem vários parâmetros para configurar e usar recursos mais avançados do `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__. Este tutorial vai cobrir parâmetros como ``initial_point``, ``expectation`` e ``gradient``.
vi_vn: Có một số tham số để định cấu hình và sử dụng nâng cao hơn khả năng của `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__. Hướng dẫn này sẽ bao gồm các thông số như ``initial_point``, ``expectation`` và ``gradient``.

source: It will also cover advanced simulator use such as using Aer with the Matrix Product State method.
bn_bn: এটি ম্যাট্রিক্স প্রোডাক্ট স্টেট পদ্ধতির সাথে এয়ার ব্যবহারের মতো উন্নত সিমুলেটরের ব্যবহারকেও অন্তর্ভুক্ত করে।
es_un: También cubrirá el uso avanzado del simulador, tal como el uso de Aer con el método de tren de tensores —también conocido como Matriz Product State o MPS.
fr_fr: Il couvrira également l'utilisation avancée du simulateur, comme l'utilisation d'Aer avec la méthode Matrix Product State.
id_id: Ini juga akan mencakup penggunaan simulator lanjutan seperti Aer dengan metode Matrix Product State.
ja_jp: また、 Matrix Product State 法による Aer の利用法など、シミュレーターの高度な使用法についても解説します。
ko_kr: 또한 Matrix Product State 방법과 함께 에어(Aer) 를 사용하는 것과 같은 고급 시뮬레이터 사용에 대해서도 다룬다.
pt_br: Ele também irá abranger o uso avançado do simulador como a utilização do Aer com o método de Estado de Produto Matricial.
ru_ru: Также будут рассмотрены расширенные возможности использования симулятора, как например, использование Aer с методом Matrix Product State.
ta_in: மேட்ரிக்ஸ் தயாரிப்பு நிலை முறையுடன் (Matrix Product State method) Aer பயன்படுத்துவது போன்ற மேம்பட்ட சிமுலேட்டர் பயன்பாட்டையும் இது உள்ளடக்கும்.
te_in: ఇది Matrix ఉత్పత్తి స్థితి పద్ధతితో Aerని ఉపయోగించడం వంటి అధునాతన సిమ్యులేటర్ వినియోగాన్ని కూడా కవర్ చేస్తుంది.
tr_tr: Ayrıca, Aer'i Matris Çarpım Durumu yöntemiyle kullanmak gibi gelişmiş simülatör kullanımını da kapsayacaktır.
vi_vn: Nó cũng sẽ bao gồm việc sử dụng trình mô phỏng nâng cao như sử dụng Aer với phương pháp State Product State.

source: Here we will use the same operator as used in the other VQE algorithms tutorials.
bn_bn: এখানেও আমরা অন্যান্য ভি কিউ ই অ্যালগরিদম টিউটোরিয়ালের ক্ষেত্রে ব্যবহৃত অপারেটরটিকেই ব্যবহার করব।
es_un: Aquí usaremos el mismo operador que se uso en los otros tutoriales de algoritmos VQE.
fr_fr: Ici, nous utiliserons le même opérateur que dans les autres tutoriels d'algorithmes VQE.
id_id: Di sini kita akan menggunakan operator sama seperti dalam tutorial algoritma VQE yang lain.
ja_jp: ここでは、他の VQE アルゴリズムのチュートリアルで用いたものと同じ演算子を使用します。
ko_kr: 여기서는 다른 VQE 알고리즘 사용 지침서에서 사용된 것과 동일한 연산자를 사용한다.
pt_br: Aqui usaremos o mesmo operador usado nos outros tutoriais dos algoritmos VQE.
ru_ru: Здесь мы используем тот же оператор, что и в других уроках по алгоритмам VQE.
ta_in: மற்ற VQE வழிமுறைகளின் பயிற்சிகளில் பயன்படுத்தப்படும் அதே ஆபரேட்டரை இங்கே பயன்படுத்துவோம்.
te_in: ఇక్కడ మేము ఇతర VQE అల్గారిథమ్‌ల ట్యుటోరియల్‌లలో ఉపయోగించిన అదే ఆపరేటర్‌ని ఉపయోగిస్తాము.
tr_tr: Burada diğer VQE algoritmalarının eğitimlerinde kullanılan operatörün aynısını kullanacağız.
vi_vn: Ở đây chúng tôi sẽ sử dụng toán tử tương tự như đã sử dụng trong các hướng dẫn thuật toán VQE khác.

source: Initial point
bn_bn: প্রাথমিক বিন্দু
es_un: Punto inicial
fr_fr: Point initial
id_id: Titik awal
ja_jp: 初期点(Initial point)
ko_kr: 초기 지점
pt_br: Ponto inicial
ru_ru: Начальная точка
ta_in: ஆரம்ப புள்ளி
tr_tr: Başlangıç noktası
vi_vn: Ðiểm đầu tiên

source: The ``initial_point`` parameter allows the optimization to begin at the given point, where the point is a list of parameters that will configure the variational form. By default the initial point is ``None`` which means that VQE will choose one. The choice in in this case is if the supplied variational form has a preferred point, based on the initial state provided to it, then this will be chosen, otherwise a random initial point that fits with any bounds the variational has will be chosen. If an initial point is supplied it will take priority though and be used - note though it must match in length to the number of parameters in the variational form circuit.
es_un: El parámetro ``initial_point`` permite que la optimización empiece en el punto dado, donde el punto es un lista de parámetros que van a configurar la forma variacional. Por defecto el punto inicial es ``None`` que significa que el VQE va a elegir uno. La decisión en este caso es que si la forma variacional dada tiene un punto preferencial basado en el estado inicial que se le provee, este será elegido, de otra manera, se elegirá un punto aleatorio que se ajuste correctamente con los limites del variacional. Si el punto inicial es dado, este tomará prioridad -sin embargo el largo de este debe ser igual que el largo del numero de parámetros en el circuito de la forma variacional.
fr_fr: Le paramètre ``initial_point`` permet à l'optimisation de commencer au point donné, où le point est une liste de paramètres qui configureront la forme variationnelle. Par défaut, le point initial est ``None``, ce qui signifie que VQE en choisira un. Le choix dans ce cas est: si la forme variationnelle fournie a un point préféré, basé sur l'état initial fourni, alors il sera choisi, sinon un point initial aléatoire satisfaisant les limites de la variationnelles sera tiré. Si un point initial est fourni, il prendra cependant la priorité et sera utilisé - notez qu'il doit correspondre en longueur au nombre de paramètres dans le circuit de la forme variationnelle.
id_id: Parameter ` ` initial_point ` ` atau titik awal memungkinkan optimasi untuk dimulai pada titik yang diberikan, di mana titik adalah daftar parameter yang menjadi konfigurasi bentuk variasional. Secara default titik awal adalah ` ` None ` ` yang berarti VQE akan memilih satu. Pilihan ini adalah jika bentuk variasional yang diberikan memiliki preferensi titik pilihan, berdasarkan state awal yang diberikan, maka itu akan dipilih, jika tidak, titik awal acak yang sesuai dengan batas variasional yang akan dipilih. Jika titik awal dipasok itu akan menjadi prioritas dan digunakan-catatan titik awal harus cocok dalam panjang dengan jumlah parameter dari sirkuit variasional.
ja_jp: パラメータ ``initial_point`` によって、最適化を開始する点を指定することができます。デフォルトで初期値は ``None`` であり、この場合 VQE が初期点を選びます。このときの選択は、初期状態に基づいて変分形式に好ましい点がある場合にはその点が選ばれ、そうでない場合には変分法の全ての境界条件に適合するランダムな初期点が選ばれます。初期点が与えられたときは、それが優先的に用いられます。ただしその長さは、変分回路のパラメーター数と一致していなければならないことに注意してください。
ko_kr: ``initial_point`` 매개변수를 사용하면 주어진 지점에서 최적화를 시작할 수 있다. 여기서 지점이란 variational form을 구성할 매개변수의 목록이다. 기본적으로 초기 지점은 ``None`` 이며, 이는 VQE가 한 가지를 선택할 것임을 의미한다. 이 경우, 선택은 (초기 상태를 기반으로) variational form에 제공된 preferred point가 있을 경우 그 점이 선택되며, 그렇지 않다면 variational의 경계와 맞닿는 지점에 위치한 임의의 초기 지점이 선택된다. 초기 지점이 제공되면 우선적으로 사용된다. 이때, 제공된 초기 지점은 variational form 회로의 매개변수 개수와 길이가 동일해야 함에 유의하라.
pt_br: O parâmetro ``initial_point`` permite que a otimização comece no ponto determinado, onde o ponto é uma lista de parâmetros que configurarão a forma variacional. Por padrão o ponto inicial é ``None`` o que significa que o VQE escolherá um. A escolha neste caso é: se a forma variacional fornecida tiver um ponto preferencial, com base no estado inicial fornecido a ela, então este será escolhido, caso contrário, será escolhido um ponto inicial aleatório que se encaixe com quaisquer limites que a forma variacional tenha. Se um ponto inicial for fornecido, ele terá prioridade e será usado - note no entanto que ele deve corresponder em comprimento ao número de parâmetros no circuito da forma variacional.
vi_vn: Tham số ``initial_point`` cho phép quá trình tối ưu hóa bắt đầu tại điểm đã cho, trong đó điểm là danh sách các tham số sẽ điều chỉnh dạng biến phân. Theo mặc định, điểm ban đầu là ``None`` có nghĩa là VQE sẽ chọn một điểm. Sự lựa chọn trong trường hợp này là nếu dạng biến phân được cung cấp có điểm ưu tiên, dựa trên trạng thái ban đầu được cung cấp cho nó, thì điểm này sẽ được chọn, nếu không thì điểm ban đầu ngẫu nhiên phù hợp với bất kỳ giới hạn nào biến phân có sẽ được chọn. Nếu một điểm ban đầu được cung cấp, nó sẽ được ưu tiên và được sử dụng - lưu ý rằng nó phải khớp về độ dài với số lượng tham số trong mạch biến phân.

source: Why to use a initial point? One reason would be if you have guess a reasonable starting point for the problem or perhaps know have information from a prior experiment.
bn_bn: প্রাথমিক পয়েন্ট কেন ব্যবহার করবেন? একটি কারণ হতে পারে যে, আপনি আপনার সমস্যার জন্য একটি যুক্তিসঙ্গত প্রারম্ভ বিন্দু ধরে নিতে সক্ষম অথবা পূর্ববর্তী কোন পরীক্ষা-নিরীক্ষা হতে আপনার কাছে কিছু সংশ্লিষ্ট তথ্যাদি আছে।
es_un: ¿Por qué usar un punto inicial? Una razón puede ser que ya tengas una idea razonable de un punto inicial para el problema, o quizá tengas información de un experimento anterior.
fr_fr: Pourquoi utiliser un point initial ? Si par exemple vous avez deviné un bon point de départ pour le problème ou si des expériences précédentes vous ont déjà permis d'en apprendre un peu sur la solution.
id_id: Mengapa menggunakan titik awal? Salah satu alasannya adalah jika Anda memiliki tebakan titik awal yang bagus untuk masalah atau memiliki informasi dari percobaan sebelumnya.
ja_jp: なぜ初期点を使うのでしょうか。理由としては、問題にとって合理的な出発点が推測される場合や、過去の実験から得られた情報がある場合などが考えられます。
ko_kr: 초기 지점을 사용하는 이유는 무엇인가? 한 가지 이유는 문제에 대한 합리적인 시작 지점을 추측할 수 있었거나 이전 실험을 통해 얻은 정보가 있는 경우일 것이다.
pt_br: Por que usar um ponto inicial? Uma razão seria se você tiver conseguido adivinhar um ponto de partida razoável para o problema ou talvez tenha informações de um experimento prévio.
ru_ru: Зачем использовать начальную точку? Одна из причин - если вы определили разумную начальную точку для решения задачи или, возможно, располагаете информацией из предыдущего эксперимента.
ta_in: ஆரம்ப புள்ளியை ஏன் பயன்படுத்த வேண்டும்? சிக்கலுக்கான ஒரு நியாயமான தொடக்கப் புள்ளியை நீங்கள் யூகித்திருந்தால் அல்லது முந்தைய பரிசோதனையிலிருந்து தகவல் இருந்தால் ஒருவேளை ஒரு காரணமாக இருக்கலாம்.
te_in: ప్రారంభ పాయింట్‌ను ఎందుకు ఉపయోగించాలి? మీరు సమస్యకు సహేతుకమైన ప్రారంభ బిందువును ఊహించినట్లయితే లేదా ముందస్తు ప్రయోగం నుండి సమాచారాన్ని కలిగి ఉంటే ఒక కారణం కావచ్చు.
tr_tr: Neden bir başlangıç noktası kullanmalı? Bunun bir nedeni, problem için makul bir başlangıç noktası tahmin etmeniz veya belki de önceki bir deneyden bilgi sahibi olmanız olabilir.
vi_vn: Tại sao phải sử dụng một điểm ban đầu? Lý do là nếu bạn đoán được điểm bắt đầu hợp lý cho vấn đề hoặc có thể bạn biết có thông tin từ một thử nghiệm trước đó.

source: To demonstrate the use let’s first simply repeat the first working example from the `algorithms introduction <01_algorithms_introduction.ipynb#A-complete-working-example>`__ tutorial to get a solution’s optimal point.
bn_bn: এই ব্যবহারটি প্রদর্শনের জন্য `algorithms introduction <01_algorithms_introduction.ipynb#A-complete-working-example>`__ টিউটোরিয়াল থেকে প্রথম কার্যকারী উদাহরণটি পুনরাবৃত্তি করা যাক, যা আমাদের কোন সমধানের সর্বোত্তম বিন্দু পেতে সাহায্য করে।
es_un: Para mostrar su uso, primero hay que repetir el primer ejemplo del tutorial `introducción a algoritmos <01_algorithms_introduction.ipynb#A-complete-working-example>`__ para obtener el punto optimo de una solución.
fr_fr: Pour démontrer l'utilisation, nous allons tout d'abord répéter le premier exemple de travail à partir du tutoriel `l'introduction d'algorithmes <01_algorithms_introduction.ipynb#A-complete-working-example>`__ pour obtenir le point optimal d'une solution.
id_id: Untuk memperagakan penggunaan ini pertama-tama mari kita ulangi contoh pertama dari tutorial `algorithms introduction <01_algorithms_introduction.ipynb#A-complete-working-example>`__ untuk mendapatkan point optimal.
ja_jp: 使い方を説明するために、まず `algorithms introduction <01_algorithms_introduction.ipynb#A-complete-working-example>`__ チュートリアルの最初の作業例を繰り返して、解を与える最適点を求めてみましょう。
ko_kr: 사용법을 보여주기 위하여 먼저 `키스킷의 알고리즘 소개 <01_algorithms_introduction.ipynb#A-complete-working-example>`__ 사용 지침서의 첫 번째 예제를 단순 반복하여 솔루션의 최적 점을 얻는다.
pt_br: Para demonstrar o uso vamos simplesmente repetir o primeiro exemplo funcional do tutorial de `introdução a algoritmos <01_algorithms_introduction.ipynb#A-complete-working-example>`__ para obter o ponto ideal de uma solução.
ru_ru: Чтобы продемонстрировать использование, давайте сначала просто повторим первый рабочий пример из урока `введение в алгоритмы <01_algorithms_introduction.ipynb#A-complete-working-example>`__, чтобы получить оптимальную точку решения.
ta_in: பயன்பாட்டை நிரூபிக்க, முதலில் `வழிமுறைகள் முன்னுரை <01_algorithms_introduction.ipynb#A-complete-working-example>`__ பயிற்சிகள் இருந்து ஒரு தீர்வின் உகந்த புள்ளியைப் பெறுவதற்கான முதல் வேலை உதாரணத்தை மீண்டும் செய்வோம்.
te_in: ఉపయోగాన్ని ప్రదర్శించడానికి, పరిష్కారం యొక్క సరైన పాయింట్‌ను పొందడానికి `algorithms పరిచయం <01_algorithms_introduction.ipynb#A-complete-working-example>`__ ట్యుటోరియల్ నుండి మొదటి పని ఉదాహరణను పునరావృతం చేద్దాం.
tr_tr: Kullanımı göstermek için önce, çözümün optimal noktasını elde etmek için `algorithms introduction <01_algorithms_introduction.ipynb#A-complete-working-example>`__ öğreticisindeki ilk çalışma örneğini tekrarlayalım.
vi_vn: Để chứng minh việc sử dụng, trước tiên chúng ta hãy lặp lại ví dụ làm việc đầu tiên từ hướng dẫn `algorithms introduction <01_algorithms_introduction.ipynb#A-complete-working-example>` để có được điểm tối ưu của giải pháp.

source: Now we can take the ``optimal_point`` from the above result and use it as the ``initial_point`` here.
bn_bn: এখন আমরা উপরের ফলাফল থেকে ``optimal_point`` নিতে পারি এবং এটি এখানে ``initial_point`` হিসাবে ব্যবহার করতে পারি।
es_un: Ahora podemos tomar el ``optimal_point``del resultado de arriba y usarlo como el ``initial_point`` aquí.
fr_fr: Maintenant nous pouvons prendre le point optimal ``optimal_point`` depuis le résultat ci-dessus et l'utiliser comme ``initial_point`` ici.
id_id: Sekarang kita dapat menggunakan ` ` optimal_point ` ` dari hasil di atas sebagai ` ` ` initial_point ` ` di sini.
ja_jp: 上の結果から ``optimal_point`` を取り出して、これを ``initial_point`` として用います。
ko_kr: 이제 위의 결과에서 ``optimal_point`` 를 가져와 여기에서 ``initial_point`` 로 사용할 수 있다.
pt_br: Agora podemos tomar o ``optimal_point`` do resultado acima e usá-lo como o ``initial_point`` aqui.
ru_ru: Теперь мы можем взять ``optimal_point`` из вышеприведенного результата и использовать ее в качестве ``initial_point`` здесь.
ta_in: இப்போது நாம் மேலே உள்ள முடிவிலிருந்து ``optimal_point`` -ஐ எடுத்து இங்கே ``initial point`` ஆக பயன்படுத்தலாம்.
te_in: ఇప్పుడు మనం పై ఫలితం నుండి ``optimal_point``ని తీసుకోవచ్చు మరియు దానిని ఇక్కడ ``initial_point``గా ఉపయోగించవచ్చు.
tr_tr: Şimdi yukarıdaki sonuçtan ``optimal_point``i alıp burada ``initial_point`` olarak kullanabiliriz.
vi_vn: Bây giờ chúng ta có thể lấy ``optimal_point`` từ kết quả trên và sử dụng nó làm ``initial_point`` ở đây.

source: Here we see that result was arrived at much more quickly where ``optimizer_evals`` is 10 versus 72 when it started from a random value when the initial point was not supplied (default of None).
es_un: Aquí podemos ver que el resultado ha sido obtenido mucho más rápido, donde``optimizer_evals`` es 10 en lugar de 72 cuando comenzó con un valor aleatorio y donde el punto inicial no fue establecido (predeterminado o ninguno).
fr_fr: Ici, nous voyons que le résultat a été obtenu beaucoup plus rapidement car ``optimizer_evals`` vaut 10, contre 72 quand l'algorithme a commencé à partir d'une valeur aléatoire du fait que le point initial n'ai pas été fourni (par défaut à la valeur None).
id_id: Di sini bisa dilihat hasil didapat jauh lebih cepat dimana ` ` ` optimizer_evals ` ` adalah 10 dibanding 72 ketika dimulai dari nilai acak ketika titik awal tidak dipasok (dengan default None).
ko_kr: 여기서 ``optimizer_evals`` 는 10으로, 초기 지점이 제공되지 않아(기본값: None) 임의의 값에서 시작했을 때의 결과값 72에 비하면 훨씬 더 빠르게 결과에 도달했음을 알 수 있다.
pt_br: Aqui vemos que o resultado foi obtido muito mais rapidamente já que ``optimizer_evals`` é 10 contra 72 de quando se iniciou a partir de um valor aleatório quando o ponto inicial não foi fornecido (padrão de None).
vi_vn: Ở đây, chúng ta thấy rằng kết quả đến nhanh hơn nhiều khi ``optimizer_evals`` là 10 so với 72 khi nó bắt đầu từ một giá trị ngẫu nhiên khi điểm ban đầu không được cho trước (mặc định là None).
