Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/04_vqe_advanced.po
Languages: bn_bn, es_un, fr_fr, id_id, ja_jp, ko_kr, pt_br, ru_ru, ta_in, te_in, tr_tr, vi_vn

source: In case you have doubts here is the qasm_simulator again but include_custom has been left to default to False. The optimization ended abruptly, presumably due to the shot noise confusing the SLSQP optimizer. The optimal value can be seen to be wrong too, i.e. -1.098 versus the correct -1.857.
es_un: En caso de que tengas dudas, aquí esta el qasm_simulator pero include_custom se ha dejado con su valor predeterminado, False. La optimización termina de manera abrupta, presuntamente causado porque el ruido de muestreo confunde al optimizador SLSQP. Además, se puede ver que el valor óptimo es incorrecto, esto es -1.098 contra el valor correcto de -1.857.
fr_fr: Dans le cas où vous avez des doutes voici de nouveau le simulateur qasm_simulator mais include_custom a été laissé par défaut à False. L'optimisation s'est arrêtée brusquement, probablement à cause du bruit de la prise de vue qui confond l'optimiseur SLSQP. La valeur optimale peut également être considérée comme incorrecte, c'est-à-dire -1.098 contre -1.857.
id_id: Jika Anda memiliki keraguan di sini adalah dengan qasm_simulator lagi tapi include_custom telah di set False seperti default. Optimasi berakhir tiba-tiba, mungkin karena noise shot membingungkan optimizer SLSQP. Nilai optimal dapat dilihat untuk menjadi salah juga, yaitu -1,098 dibanding yang benar -1.857.
ja_jp: 念のため、ここで再度 qasm_simulator を実行しますが、 include_custom はデフォルトの False のままとしておきます。すると、おそらくショット・ノイズが SLSQP オプティマイザー を混乱させたために、最適化は突然終了しています。最適値も正解の -1.857 に対して -1.098 と、間違っています。
ko_kr: 여기에 의문이 있는 경우에는 qasm_simulator를 다시 사용하지만 include_custom은 디폴트인 False로 둔다. SLSQP 옵티마이저가 최적화를 수행하던 중 샷 노이즈로 인하여 최적화가 갑자기 종료되었다. 이때, 최적의 값도 잘못된 것을 볼 수 있다 (즉, -1.098이 아닌 -1.857이 올바른 값임).
pt_br: Caso você tenha dúvidas, aqui é o qasm_simulator novamente, mas include_custom foi deixado como padrão, que é False. A otimização terminou abruptamente, presumivelmente devido ao shot-noise (ruído de disparo) confundindo o otimizador SLSQP. O valor ideal também pode ser visto como errado, isto é, -1,098 contra o valor correto -1,857.
vi_vn: Trong trường hợp bạn nghi ngờ, vẫn là qasm_simulator nhưng giá trị cờ include_custom đã được để mặc định thành False. Quá trình tối ưu hóa kết thúc đột ngột, có lẽ là do nhiễu trong lúc đo đạc gây nhầm lẫn cho trình tối ưu hóa SLSQP. Giá trị tối ưu cũng có thể bị sai, tức là -1,098 so với kết quả đúng là -1,857.

source: Changing the optimizer to SPSA, which is designed to work in noisy environments, gets us a better result. Though the noise has affected the outcome so it’s not as accurate.
bn_bn: SPSA তে অপ্টিমাইজার পরিবর্তন করা, যা গোলমাল পরিবেশে কাজ করার জন্য ডিজাইন করা হয়েছে, আমাদের একটি ভাল ফলাফল দেয়। যদিও নয়েজ ফলাফলকে প্রভাবিত করেছে তাই এটি সঠিক নয়।
es_un: Cambiar el optimizador a SPSA, que esta diseñado para trabajar en ambientes con ruido nos da un mejor resultado. Pero el ruido afectó el resultado entonces no es tan preciso.
fr_fr: Changer l'optimiseur en SPSA, qui est conçu pour fonctionner dans des environnements bruités, nous donne un meilleur résultat, bien que le bruit ait affecté celui-ci, il n’est donc pas aussi précis.
id_id: Mengubah optimizer ke SPSA, yang dirancang untuk bekerja di lingkungan dengan noise, memberi hasil yang lebih baik. Walau begitu noise telah mempengaruhi hasilnya sehingga tidak begitu akurat.
ja_jp: オプティマイザーをノイズの多い環境で動作するよう設計された SPSA に変更すると、より良い結果が得られます。ただし、ノイズが結果に影響を与えているため、正確性は劣ります。
ko_kr: 노이즈 환경에서 작동하도록 설계된 SPSA로 옵티마이저를 변경하면 더 좋을 결과를 얻을 수 있다. 그렇지만 노이즈가 결과에 영향을 주었기 때문에 정확하지는 않다.
pt_br: Mudar o otimizador para SPSA, que é projetado para trabalhar em ambientes ruidosos, nos proporciona um resultado melhor. No entanto não é tão preciso pois o ruído afetou o resultado.
ru_ru: Замена оптимизатора на SPSA, который предназначен для работы в шумной среде, дает нам лучший результат. Однако шум повлиял на результат, поэтому он не такой точный.
ta_in: சத்தம் அதிகமான சூழலில் வேலை செய்ய வடிவமைக்கப்பட்ட SPSA க்கு ஆப்டிமைசரை மாற்றுவதால் நம்மால் ஒரு சிறந்த முடிவைப் பெற முடிகிறது. இரைச்சல் முடிவை பாதித்திருந்தாலும், அது அவ்வளவு துல்லியமாக இல்லை.
te_in: ఆప్టిమైజర్‌ను SPSAకి మార్చడం, ఇది ధ్వనించే వాతావరణంలో పని చేయడానికి రూపొందించబడింది, మాకు మెరుగైన ఫలితం లభిస్తుంది. శబ్దం ఫలితాన్ని ప్రభావితం చేసినప్పటికీ అది అంత ఖచ్చితమైనది కాదు.
tr_tr: Optimize ediciyi gürültülü ortamlarda çalışmak üzere tasarlanmış SPSA olarak değiştirmek bize daha iyi bir sonuç verir. Gürültü sonucu etkilemiş olsa da, o kadar doğru değil.
vi_vn: Thay đổi trình tối ưu hóa thành SPSA, được thiết kế để hoạt động trong môi trường nhiễu giúp chúng ta có được kết quả tốt hơn. Mặc dù nhiễu đã ảnh hưởng đến kết quả làm nó không chính xác.

source: As mentioned above, an expectation object can be explicitly given (so the internal ``ExpectationFactory`` and include_custom are never used/needed. Below we create an ``AerPauliExpectation`` and pass this to VQE. We can see the result matches that above where we set include_custom to True and let VQE create its own expectation object.
bn_bn: উপরিউক্ত কোড অনুযায়ী, একটি এক্সপেকটেশন অবজেক্ট বাহ্যিকভাবে দেওয়া যেতে পারে (তাই অভ্যন্তরীণ ``ExpectationFactory`` এবং include_custom ব্যবহার করা হয় না/প্রয়োজন নেই)। নিচে VQE পাস করতে আমরা ``AerPauliExpectation`` তৈরি করি। আমরা দেখতে পাচ্ছি যে ফলাফলটি আমরা যেখানে দেখেছি তার উপরে include_custom True ধরা হয়েছে এবং VQE কে এর নিজস্ব এক্সপেকটেশন অবজেক্ট তৈরি করতে দেয়া হয়েছে।
es_un: Como se menciono anteriormente, el objeto de valor esperado puede ser dado explícitamente (para que ``ExpectationFactory`` y include_custom nunca sean usados/necesitados). A continuación creamos ``AerPauliExpectation`` y lo pasamos a VQE. Podemos ver que el resultado coincide con el que obtuvimos arriba cuando establecimos include_custom como True y dejamos que VQE creara su propio valor esperado.
fr_fr: Comme mentionné ci-dessus, un objet expectation peut être explicitement donné (donc les ``ExpectationFactory`` internes et include_custom ne sont jamais utilisés ni nécessaires). Ci-dessous nous créons une instance de ``AerPauliExpectation`` et passons celle-ci à VQE. Nous pouvons voir que les résultats correspondent à ceux obtenus plus haut, où nous définissons include_custom à True et laissons VQE créer son propre objet expectation.
id_id: Seperti disebutkan di atas, sebuah objek ekspektasi dapat secara eksplisit diberikan (sehingga internal ` ` ExpectationFactory ` ` dan include_custom tidak pernah digunakan/dibutuhkan). Di bawah ini kita membuat sebuah ` ` AerPauliExpectation ` ` dan meneruskannya ke VQE. Kita dapat melihat hasil yang cocok dengan yang di atas di mana kita menetapkan include_custom menjadi True dan membiarkan VQE membuat objek ekspektasi sendiri.
ja_jp: 上述のように、期待値オブジェクトは明示的に与えることができます。 (そのため、内部の ``ExpectationFactory`` や include_custom は決して使用されることも、必要とされることはありません) 以下では ``AerPauliExpectation`` を作成し、 VQE に渡しています。結果は、 include_custom を True として VQE に独自の期待値オブジェクトを作成させた、上の結果と一致していることが確認できます。
ko_kr: 위에서 언급했듯이 expectation 객체는 명시적으로 주어질 수 있다 (따라서 내부의 ``ExpectationFactory`` 와 include_custom은 사용되지 않으며 필요하지도 않음). 아래에서는 ``AerPauliExpectation`` 를 생성하고 이를 VQE에 전달한다. 이때 결과는 include_custom을 True로 설정하고 VQE가 자체적으로 expectation 객체를 생성하도록 설정하였을 때의 결과와 일치하는 것을 확인할 수 있다.
pt_br: Como mencionado acima, um objeto de esperança pode ser explicitamente dado (então o ``ExpectationFactory`` interno e include_custom nunca são usados/necessários). Abaixo nós criamos uma ``AerPauliExpectation`` e passamos ela para o VQE. Podemos ver que os resultados correspondem com os acima onde definimos include_custom como True e deixamos o VQE criar seu próprio objeto de esperança.
ru_ru: Как упоминалось выше, объект для расчета математического ожидания может быть задан явно, поэтому внутренние ``ExpectationFactory`` и include_custom никогда не понадобятся/ не нужны. Ниже мы создаём ``AerPauliExpectation`` и передаём его в VQE. Мы видим, что результат совпадает с результатом приведенным выше, где мы установили include_custom в True и позволили VQE создать свой собственный объект для расчета матожидания.
ta_in: மேலே குறிப்பிட்டுள்ளபடி, ஒரு எதிர்பார்ப்பு பொருள் வெளிப்படையாகக் கொடுக்க முடியும் (ஆகவே, உள் ``ExpectationFactory`` மற்றும் include_custom ஒருபோதும் பயன்படுத்தப்படுவதில்லை/தேவையில்லை. கீழே நாம் ஒரு ``AerPauliExpectation`` ஐ உருவாக்கி இதை VQE-க்கு அனுப்புகிறோம். மேலே include_custom உண்மை என அமைத்து, VQE அதன் சொந்த எதிர்பார்ப்பு பொருள் உருவாக்க அனுமதிக்கிறோம்.
te_in: పైన పేర్కొన్నట్లుగా, నిరీక్షణ వస్తువు స్పష్టంగా ఇవ్వబడుతుంది (కాబట్టి అంతర్గత ``ExpectationFactory`` మరియు include_custom ఎప్పుడూ ఉపయోగించబడవు/అవసరం లేదు. క్రింద మేము ``AerPauliExpectation``ని సృష్టించి, దీన్ని VQEకి పాస్ చేస్తాము. పైన మేము చేర్చిన_కస్టమ్‌ని ఒప్పుకు సెట్ చేసిన ఫలితంతో సరిపోలడాన్ని మనం చూడవచ్చు మరియు VQE దాని స్వంత నిరీక్షణ వస్తువును సృష్టించనివ్వండి.
tr_tr: Yukarıda belirtildiği gibi, bir beklenti nesnesi açıkça verilebilir (böylece dahili ``ExpectationFactory`` ve include_custom asla kullanılmaz/gerekli değildir. Aşağıda bir ``AerPauliExpectation`` oluştururuz ve bunu VQE'ye iletiriz. Yukarıdaki include_custom öğesini True olarak ayarladık ve VQE'nin kendi beklenti nesnesini oluşturmasına izin verdik.
vi_vn: Như đã đề cập ở trên, một đối tượng kỳ vọng có thể được đưa ra rõ ràng (để cho ``ExpectationFactory`` và ``include_custom`` bao giờ được sử dụng / cần thiết trong nội bộ). Sau đây, chúng ta tạo một ``AerPauliExpectation`` và truyền nó vào VQE. Chúng ta có thể thấy kết quả khớp với kết quả ở trên, chỗ chúng ta gán giá trị True cho include_custom và để VQE tạo đối tượng kỳ vọng của riêng nó.

source: By default, the ``PauliExpectation`` object, that would have be chosen when include_custom is False (or when using BasicAer qasm_simultor, or a real device) groups Paulis into commuting sets. This is efficient as it runs less circuits to compute the expectation. However, if for some reason you wanted to run a circuit for each Pauli then then grouping can be turned off when constructing the PauliExpectation. You need to explicitly pass in such an expectation instance to VQE to have it work this way though as shown below.
id_id: Secara default, objek ` ` PauliExpectation ` `, yang akan dipilih ketika include_custom adalah False (atau ketika menggunakan BasicAer qasm_simulator, atau perangkat nyata) mengelompokkan term Paulis ke dalam set yang komutatif. Ini efisien karena jumlah sirkuit penghitung ekspektasi berkurang. Namun, jika untuk beberapa alasan Anda ingin menjalankan sebuah sirkuit untuk setiap term Pauli maka pengelompokan dapat dimatikan ketika membuat PauliExpectation. Anda perlu secara eksplisit meneruskan instans ekspektasi tersebut ke VQE agar bekerja dengan cara ini seperti yang ditunjukkan di bawah.
ja_jp: デフォルトでは、 include_custom が False の場合 (あるいは BasicAer の qasm_simulator や実デバイスを使用している場合) に選ばれる ``PauliExpectation`` オブジェクトは、 Pauli 行列を交換演算子の組としてグループ化します。これは、期待値を計算するための回路数を減らすことができるので、効率的です。しかし何らかの理由で、Pauli 演算子ごとに回路を実行したい場合には、 PauliExpectation を作成する際に、グループ化をオフにすることができます。以下に示すように、この方法で動作させるためには、明示的に VQE へこのような期待値インスタンスを渡す必要があります。

source: Gradient
bn_bn: নতিমাত্রা
es_un: Gradiente
id_id: Gradien
ko_kr: 구배
pt_br: Gradiente
ru_ru: Градиент
ta_in: க்ரேடியன்ட்டு
tr_tr: Gradyan

source: Optimizers that use a gradient-based technique can be supplied with a user defined gradient that will be used instead of their default gradient computation which is usually done by simple finite difference. Gradients are passed indirectly via to the optimizer via its ``gradient`` parameter.
bn_bn: নতি-ভিত্তিক কৌশল ব্যবহার করে এমন অপ্টিমাইজারগুলি (অনুকূলায়ক) কোনও ব্যবহারকারী সংজ্ঞায়িত নতিমাত্রার সাথে সরবরাহ করা যেতে পারে যা তাদের ডিফল্ট নতিমাত্রা গণনার পরিবর্তে ব্যবহৃত হবে। এটি সাধারণত সহজ সীমাবদ্ধ পার্থক্যের দ্বারা পরিমাপ করা হয়। নতিমাত্রাগুলি অপ্টিমাইজারের মাধ্যমে তার ``gradient`` প্যারামিটারের মাধ্যমে পরোক্ষভাবে সরবরাহ করা হয়।
es_un: A los optimizadores que utilizan técnicas basadas en gradientes se les puede suministrar un gradiente definido por el usuario que va a ser usado en vez del gradiente definido por defecto que normalmente es calculado mediante una diferencia finita. Los gradientes pueden ser pasados indirectamente a través del optimizador mediante su parámetro ``gradient``.
fr_fr: Les optimiseurs qui utilisent une technique basée sur le gradient peuvent être créés avec un gradient défini par l'utilisateur qui sera utilisé à la place de leur calcul de gradient par défaut, qui est généralement calculé par simple différence finie. Les gradients sont passés indirectement via l'optimiseur au moyen de son paramètre ``gradient``.
id_id: Pengoptimasi yang menggunakan teknik berbasis gradien dapat dipasok dengan gradien yang didefinisikan pengguna disamping default dari komputasi gradien yang biasanya adalah finite difference sederhana. Gradien-gradien diteruskan secara tidak langsung ke pengoptimasi melalui parameter ` ` gradient ` ` nya.
ja_jp: 勾配ベースの手法を用いるオプティマイザーには、通常は単純な有限差分で求められるデフォルトの勾配の代わりとして、ユーザー定義の勾配を与えることができます。勾配はオプティマイザーの ``gradient`` パラメーターを介して、間接的にオプティマイザーに渡されます。
ko_kr: 그래디언트를 기반으로한 기술을 사용하는 옵티마이저는 기본적으로 제공된 단순 유한 차분(simple finite difference) 으로 수행되는 그래디언트 계산 방식 대신에 사용자가 정의한 그래디언트가 제공될 수 있다. 그래디언트는 ``gradient`` 매개 변수를 통해 옵티마이저로 간접적으로 전달된다.
pt_br: Os otimizadores que utilizam uma técnica baseada no gradiente podem ser fornecidos como um gradiente definido pelo usuário que será usado em vez de seu cálculo de gradiente padrão, o que geralmente é feito por uma simples diferença finita. Os gradientes são passados indiretamente ao otimizador através de seu parâmetro ``gradient``.
ru_ru: Оптимизаторы, использующие градиентную схему, могут быть снабжены заданным пользователем градиентом, который будет использоваться вместо стандартного вычисления градиента, обычно выполняемого простыми конечными разностями. Градиенты передаются оптимизатору косвенно через его параметр ``gradient``.
ta_in: க்ரேடியன்ட்டு அடிப்படையிலான நுட்பத்தைப் பயன்படுத்தும் ஆப்டிமைசர்கள் பயனர் வரையறுக்கப்பட்ட கிரேடியன்டுடன் வழங்கப்படலாம், அவை முன்னிருப்பு க்ரேடியன்ட்டு கணக்கீட்டிற்குப் பதிலாகப் பயன்படுத்தப்படும், இது பொதுவாக எளிய வரையறுக்கப்பட்ட வேறுபாட்டால் செய்யப்படுகிறது. க்ரேடியன்ட்டு அதன் ``gradient`` ஆர்குமென்ட் வழியாக மறைமுகமாக ஆப்டிமைசர் வழியாக தேர்ச்சி பெறுகிறது.
te_in: గ్రేడియంట్-ఆధారిత సాంకేతికతను ఉపయోగించే ఆప్టిమైజర్‌లను వినియోగదారు నిర్వచించిన గ్రేడియంట్‌తో సరఫరా చేయవచ్చు, ఇది సాధారణంగా సాధారణ పరిమిత వ్యత్యాసంతో నిర్వహించబడే వారి డిఫాల్ట్ గ్రేడియంట్ గణనకు బదులుగా ఉపయోగించబడుతుంది. గ్రేడియంట్లు దాని ``గ్రేడియంట్`` పరామితి ద్వారా ఆప్టిమైజర్‌కి పరోక్షంగా పంపబడతాయి.
tr_tr: Gradyan tabanlı bir teknik kullanan optimize ediciler, genellikle basit sonlu fark ile yapılan varsayılan gradyan hesaplamaları yerine kullanılacak kullanıcı tanımlı bir gradyan ile sağlanabilir. Gradyanlar, ``gradient`` parametresi aracılığıyla optimize ediciye dolaylı olarak aktarılır.
vi_vn: Các công cụ tối ưu hóa sử dụng một kỹ thuật dựa trên gradient có thể được người dùng cho trước một gradient xác định mà sẽ được sử dụng thay vì tính toán gradient theo mặc định, thường được thực hiện bởi sự khác biệt hữu hạn đơn giản. Gradien được truyền gián tiếp thông qua thuật toán tối ưu qua tham số ``gradient``.

source: As the use of a user supplied ``gradient`` was shown in the `Monitoring VQE Convergence <02_vqe_convergence.ipynb#Using-Gradient-framework>`__ tutorial I will simply refer you there. Also the `Gradients framework <../operators/02_gradients_framework.ipynb>`__ tutorial has much more about the gradients themselves.
bn_bn: `Monitoring VQE Convergence <02_vqe_convergence.ipynb#Using-Gradient-framework>`__ টিউটোরিয়ালে একজন ব্যবহারকারী সরবরাহকৃত ``gradient`` এর ব্যবহার দেখানো হয়েছে তাই আমি আপনাকে সেখানে যেতে নির্দেশনা দেব। তাছাড়াও `Gradients framework <../operators/02_gradients_framework.ipynb>`__ টিউটোরিয়ালে গ্রাডিয়েণ্টের ব্যাপের আরও অনেক কিছু আছে।
es_un: Como el uso de un gradiente suministrado por el usuario fue explicado en el tutorial `Monitoreo de la convergencia de VQE <02_vqe_convergence.ipynb#Using-Gradient-framework>`__ simplemente haré referencia a el. También el tutorial `Estructura de los gradientes <../operators/02_gradients_framework.ipynb>`__ tiene mucho más material acerca de los gradientes.
fr_fr: Comme l'utilisation d'un ``gradient`` fourni par un utilisateur a été montrée dans le tutoriel `Monitoring VQE Convergence <02_vqe_convergence.ipynb#Using-Gradient-framework>`__ je vais simplement vous y référer. Le `Gradients framework <../operators/02_gradients_framework.ipynb>`__ a aussi beaucoup plus d'informations à propos des gradients eux-mêmes.
id_id: Sebagai contoh penggunaan dari ` ` gradient ` ` yang ditentukan user ditunjukkan di tutorial ` Monitor Konvergensi VQE <02_vqe_convergence.ipynb#Using-Gradient-framework> ` __ yang hanya dirujuk di sini. Juga tutorial ` Kerangka Gradien <../operators/02_gradients_framework.ipynb> ` __ memiliki lebih banyak informasi tentang gradien.
ja_jp: `Monitoring VQE Convergence <02_vqe_convergence.ipynb#Using-Gradient-framework>`__ チュートリアルでは、ユーザー定義の ``gradient`` の使用法が示されているので、そちらを参照してください。また `Gradients framework <../operators/02_gradients_framework.ipynb>`__ チュートリアルには、勾配そのものについての詳細が示されています。
ko_kr: 사용자에 의하여 제공된 ``gradient`` 를 사용하는 방법은 `VQE 수렴 모니터링 <02_vqe_convergence.ipynb#Using-Gradient-framework>`__ 사용 지침서를 참조하도록 한다. 또한 `Gradients framework <../operators/02_gradients_framework.ipynb>`__ 사용 지침서에는 그라디언트 자체에 대하여 자세히 설명한다.
pt_br: Como o uso de um ``gradient`` fornecido pelo usuário foi mostrado no tutorial `Monitorando a Convergência do VQE <02_vqe_convergence.ipynb#Using-Gradient-framework>`__ vou simplesmente referi-los lá. O tutorial `Gradients framework <../operators/02_gradients_framework.ipynb>`__ tem muito mais sobre os gradientes em si também.
ru_ru: Поскольку использование пользовательского ``градиента`` было показано в уроке ``Контроль сходимости VQE <02_vqe_convergence.ipynb#Using-Gradient-framework>`__, я просто направлю вас туда. Также в уроке `Gradients framework <.../operators/02_gradients_framework.ipynb>` есть гораздо больше информации о самих градиентах.
ta_in: ``gradient`` வழங்கப்பட்ட பயனரின் பயன்பாடு `Monitoring VQE Convergence <02_vqe_convergence.ipynb#Using-Gradient-framework>`__ பயிற்சிகளில் காண்பிக்கப்படுவதால், நான் உங்களை அங்கேயே குறிப்பிடுவேன். `Gradients framework <../operators/02_gradients_framework.ipynb>`__ பயிற்சிகளில் க்ரேடியன்ட்டுகளைப் பற்றி அதிகம் உள்ளது.
te_in: వినియోగదారు అందించిన ``గ్రేడియంట్`` వినియోగం `మానిటరింగ్ VQE కన్వర్జెన్స్ <02_vqe_convergence.ipynb#Using-Gradient-framework>`__ ట్యుటోరియల్‌లో చూపబడినందున నేను మిమ్మల్ని అక్కడ సూచిస్తాను. అలాగే `గ్రేడియంట్స్ ఫ్రేమ్‌వర్క్ <../operators/02_gradients_framework.ipynb>`__ ట్యుటోరియల్‌లో గ్రేడియంట్స్ గురించి చాలా ఎక్కువ ఉన్నాయి.
tr_tr: Kullanıcı tarafından sağlanan bir ``gradient`` kullanımı, `Monitoring VQE Convergence <02_vqe_convergence.ipynb#Using-Gradient-framework>`__ eğitselinde gösterildiğinden, sizi oraya yönlendireceğim. Ayrıca, `Gradients framework <../operators/02_gradients_framework.ipynb>`__ eğitseli, gradyanların kendileri hakkında çok daha fazla bilgiyi içerir.
vi_vn: Bởi vì việc sử dụng một định nghĩa ``gradient`` người dùng cung cấp được thể hiện trong bài hướng dẫn `Monitoring VQE Convergence <02_vqe_convergence.ipynb#Using-Gradient-framework>`__, tôi chỉ đơn giản sẽ chỉ các bạn tại chỗ đó. Ngoài ra bài hướng dẫn `Gradients framework <../operators/02_gradients_framework.ipynb>`__ có nhiều thứ để nỏi hơn về gradients.

source: Quantum Instance and advanced simulation
bn_bn: কোয়ান্টাম দৃষ্টান্ত (ইনস্ট্যান্স) এবং উন্নত সিমুলেশন
es_un: Quantum Instance y simulación avanzada
fr_fr: Instance Quantum et simulation avancée
id_id: Instans Kuantum dan simulasi lanjutan
ja_jp: Quantum Instance と高度なシミュレーション
ko_kr: 양자 인스턴스 및 고급 시뮬레이션
pt_br: Instância Quântica e simulação avançada
ru_ru: Quantum Instance и расширенное моделирование
ta_in: குவாண்டம் உதாரணம் மற்றும் மேம்பட்ட சிமுலேஷன்
te_in: క్వాంటం ఇన్‌స్టాన్స్ మరియు అధునాతన అనుకరణ
tr_tr: Kuantum Örneği ve gelişmiş simülasyon
vi_vn: Thực thể lượng tử và mô phỏng nâng cao

source: While you may be familar with passing a QuantumInstancen created from a ``statevector_simulator`` a ``qasm_simulator`` or real device backend, it is possible to use the advanced simulation modes of Aer too when applicable. For instance we can easily use the Aer `Matrix Product State <../simulators/7_matrix_product_state_method.ipynb>`__ method, that has the potential to scale to larger numbers of qubits.
id_id: Walau kita telah cukup mengenal penerusan QuantumInstance dibuat dari ` ` statevector_simulator ` `, atau ` ` qasm_simulator ` ` atau backend perangkat nyata, kita bisa juga menggunakan mode simulasi lanjutan dari Aer. Misalnya kita bisa dengan mudah menggunakan metoda Aer ` Matrix Product State <../simulators/7_matrix_product_state_metod.ipynb> ` __, yang berpotensi bisa dilakukan untuk lebih banyak qubit.
ja_jp: ``statevector_simulator`` や ``qasm_simulator`` 、実デバイスのバックエンドから作成された QuantumInstance を渡す方法が一般的ですが、 Aer の高度なシミュレーション・モードを使用することも可能です。例えば、 Aer の `Matrix Product State <../simulators/7_matrix_product_state_method.ipynb>`__ メソッドは簡単に用いることができて、より多くの量子ビットに拡張できる可能性をもっています。

source: By default, the ``PauliExpectation`` object, that would have be chosen when include_custom is False (or when using BasicAer qasm_simulator, or a real device) groups Paulis into commuting sets. This is efficient as it runs less circuits to compute the expectation. However, if for some reason you wanted to run a circuit for each Pauli then then grouping can be turned off when constructing the PauliExpectation. You need to explicitly pass in such an expectation instance to VQE to have it work this way though as shown below.
es_un: De forma predeterminada, el objeto ``PauliExpectation``, que se habría elegido cuando include_custom es False (o cuando se usa el qasm_simulator de BasicAer, o un dispositivo real) agrupa Paulis en conjuntos de conmutación. Esto es eficiente ya que ejecuta menos circuitos para calcular el valor esperado. Sin embargo, si por alguna razón desea ejecutar un circuito para cada Pauli, entonces la agrupación puede desactivarse al construir la PauliExpectation. Debe pasar explícitamente dicha instancia de expectativa al VQE para que funcione de esta manera, como se muestra a continuación.
fr_fr: Par défaut, l'objet ``PauliExpectation``, qui aurait été choisi lorsque include_custom est False (ou lors de l'utilisation de BasicAer qasm_simulator, ou sur un appareil réel) regroupe les Paulis dans des ensembles qui commutent deux à deux. Ceci est efficace car moins de circuits doivent être exécutés pour calculer les valeurs attendues. Cependant, si pour une raison quelconque vous vouliez exécuter un circuit pour chaque Pauli, alors le regroupement peut être désactivé lors de la construction de l'instance de PauliExpectation. Vous devez pour cela passer explicitement l'instance à VQE, comme montré ci-dessous.
ko_kr: 기본적으로, include_custom이 False (이거나 BasicAer의 qasm_simultor 혹은 실제 디바이스를 사용할 때), ``PauliExpectation`` 객체는 Paulis를 commuting set로 그룹화한다. 이는 기대값을 계산하기 위하여 더 적은 회로를 실행하므로 효율적이다. 그러나 어떤 이유로든 각 Pauli에 대하여 회로를 실행하려는 경우 PauliExpectation을 구성할 때 그룹화를 수행하지 않을 수 있다. 이러한 방식으로 작업을 수행하려면, 아래에 보여지는 바와 같이 expectation 인스턴스를 VQE에 명시적으로 전달해야 한다.
pt_br: Por padrão, o objeto ``PauliExpectation``, que seria escolhido quando include_custom é False (ou quando usando o BasicAer qasm_simultor, ou um dispositivo real), agrupa as Paulis em conjuntos comutáveis. Isso é eficiente já que executa menos circuitos para computar a esperança. No entanto, se por algum motivo você quisesse executar um circuito para cada Pauli então o agrupamento pode ser desabilitado ao construir a PauliExpectation. Você precisa passar explicitamente tal instância da esperança para o VQE para que ele funcione desta forma no entanto, como mostrado abaixo.
