Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/04_vqe_advanced.po
Languages: bn_bn, es_un, fr_fr, id_id, ja_jp, ko_kr, pt_br, ru_ru, ta_in, te_in, tr_tr, vi_vn

source: While you may be familiar with passing a QuantumInstancen created from a ``statevector_simulator`` a ``qasm_simulator`` or real device backend, it is possible to use the advanced simulation modes of Aer too when applicable. For instance we can easily use the Aer `Matrix Product State <../simulators/7_matrix_product_state_method.ipynb>`__ method, that has the potential to scale to larger numbers of qubits.
fr_fr: Bien que vous soyez peut-être familiers avec le fait de passer une instance de QuantumInstance créé à partir d'un ``statevector_simulator`` ou d'un ``qasm_simulator`` ou d'une interface de vrai puce quantum, il est également possible d'utiliser les modes de simulation avancés d'Aer. Par exemple, nous pouvons facilement utiliser la méthode Aer `Matrix Product State <../simulators/7_matrix_product_state_method.ipynb>`__, qui a le potentiel de pouvoir simuler un plus grand nombre de qubits.
ko_kr: ``statevector_simulator``, ``qasm_simulator``, 또는 실제 장치 백엔드에서 생성된 QuantumInstance을 전달하는 데 익숙할 수 있지만, 적용 가능한 경우에는 Aer의 고급 시뮬레이션 모드도 사용할 수 있다. 예를 들어, Aer의 `행렬 곱 상태 <../simulators/7_matrix_product_state_method.ipynb>`__ 메서드를 우리는 쉽게 사용하여 더 많은 개수의 큐비트로 확장시킬 수 있다.
pt_br: Embora você possa estar familiarizado com a passagem de uma QuantumInstance criada a partir de um ``statevector_simulator`` ao ``qasm_simulator`` ou serviço de dispositivo real, é possível usar os modos avançados de simulação do Aer também, quando aplicáveis. Por exemplo, nós podemos facilmente usar o método `Matrix Product State <../simulators/7_matrix_product_state_method.ipynb>`__ do Aer, que tem o potencial de escalar para um número maior de qubits.

source: There exist several parameters for configuring and using more advanced `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.VQE.html>`__ capabilities. This tutorial will cover the parameters such as ``initial point``, ``expectation`` and ``gradient``.
bn_bn: আরো উন্নত `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.VQE.html>` __ ক্ষমতাগুলি কনফিগার এবং ব্যবহার করার জন্য বেশ কয়েকটি পরামিতি (প্যারামিটার) রয়েছে। এই টিউটোরিয়ালটি ``initial point``, ``expectation`` এবং ``gradient`` এর মতো প্যারামিটারগুলি কভার করবে।
ru_ru: Существует несколько параметров для настройки и использования более продвинутых возможностей `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.VQE.html>`__. В этом уроке будут рассмотрены такие параметры, как ``начальная точка``, ``ожидание`` и ``градиент``.
ta_in: மேலும் மேம்பட்ட `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.VQE.html>`__ திறன்களை பயன்படுத்துவதற்கு பல ஆர்குமென்ட் இருக்கிறது. இந்த பயிற்சிகள் ``initial_point``, ``expectation`` மற்றும் ``gradient`` போன்ற ஆர்குமென்ட்களை உள்ளடக்கும்.
te_in: మరింత అధునాతన `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.VQE.html>`__ సామర్థ్యాలను కాన్ఫిగర్ చేయడానికి మరియు ఉపయోగించడానికి అనేక పారామితులు ఉన్నాయి. ఈ ట్యుటోరియల్ ``initial point``, ``expectation`` మరియు ``gradient`` వంటి పారామితులను కవర్ చేస్తుంది.
tr_tr: Daha gelişmiş `VQE <https://qiskit.org/documentation/stubs/qiskit.algorithms.VQE.html>`__ özelliklerini yapılandırmak ve kullanmak için birkaç parametre vardır. Bu eğitimde``initial point``, ``expectation`` ve ``gradient`` gibi parametreler ele alınacaktır.

source: The ``initial_point`` parameter allows the optimization to begin at the given point, where the point is a list of parameters that will configure the ansatz. By default the initial point is ``None`` which means that VQE will choose one. The choice in in this case is if the supplied ansatz has a preferred point, based on the initial state provided to it, then this will be chosen, otherwise a random initial point that fits with any bounds the ansatz has will be chosen. If an initial point is supplied it will take priority though and be used - note though it must match in length to the number of parameters in the ansatz circuit.
bn_bn: যেখানে পয়েন্টগুলো ansatz কে সুসজ্জিত করবে এমন প্যারামিটাগুচ্ছের লিস্ট হিসেবে থাকে, ``initial_point`` প্যারামিটারটি সেখানে একটি প্রদত্ত অবস্থায় অপ্টিমাইজেশনকে শুরু করতে সাহায্য করে। প্রাথমিকভাবে `initial_point`` কে ``None`` হিসেবে গন্য করা হয়, তথা VQE শুধুমাত্র একটি পয়েন্ট বাছাই করে নেবে। আর এক্ষেত্রে যদি পূর্বে সরবারহকৃত ansatz এর প্রাথমিকভাবে যে স্টেট দেয়া হয়েছে তার ওপর ভিত্তি করে একটি পছন্দসই পয়েন্ট থাকে, তাহলে তাকে বাছাই করা হবে। অন্যথায়, ansatz এর যেকোনো সীমার সাথে মানানসই হতে পারে এমন একটি র‍্যান্ডম প্রাথমিক পয়েন্ট বাছাই করা হবে। কিন্তু যদি আগে থেকেই একটি প্রাথমিক পয়েন্ট সরবারহ করা হয় তাহলে সেটা আগে অগ্রাধিকার পেয়ে ব্যবহৃত হবে। বি: দ্র: যদিও একে ansatz সারকিটের প্যারামিটাগুলোর সংখ্যার সাথে মিলতে হবে।
ru_ru: Параметр ``initial_point`` позволяет начать оптимизацию с заданной точки, где точка - это список параметров, которые будут формировать анзац. По умолчанию начальной точкой является ``None``, что означает, что VQE выберет одну. Выбор в данном случае заключается в том, что если у предоставленного анзаца есть предпочтительная точка, основанная на предоставленном ему начальном состоянии, то она будет выбрана, в противном случае будет выбрана случайная начальная точка, которая соответствует любым ограничениям анзаца. Если начальная точка предоставлена, то она будет иметь приоритет и будет использоваться - обратите внимание, что ее длина должна соответствовать количеству параметров в схеме анзаца.
ta_in: ``initial_point`` ஆர்குமென்ட் கொடுக்கப்பட்ட புள்ளியில் தேர்வுமுறை தொடங்க அனுமதிக்கிறது, அங்கு புள்ளி என்பது அன்சட்ஸ் (ansatz) உள்ளமைக்கும் ஆர்குமென்ட்களின் பட்டியல். இயல்பாக தொடக்க புள்ளி ``None`` அதாவது VQE ஒன்றைத் தேர்ந்தெடுக்கும். இந்த வழக்கில் தேர்வு என்னவென்றால், வழங்கப்பட்ட அன்சட்ஸுக்கு வழங்கப்பட்ட ஆரம்ப நிலையின் அடிப்படையில் விருப்பமான புள்ளி இருந்தால், இது தேர்வு செய்யப்படும், இல்லையெனில் அன்சட்ஸின் எந்த எல்லைகளுக்கும் பொருந்தக்கூடிய ஒரு சீரற்ற ஆரம்ப புள்ளி தேர்வு செய்யப்படும். ஒரு ஆரம்ப புள்ளி வழங்கப்பட்டால், அது முன்னுரிமை எடுக்கும் மற்றும் பயன்படுத்தப்படும் - குறிப்பாக இது அன்சட்ஸ் சுற்றுகளில் உள்ள ஆர்குமென்ட்களின் எண்ணிக்கையுடன் நீளத்துடன் பொருந்த வேண்டும்.
te_in: ``initial_point`` పరామితి ఇచ్చిన పాయింట్ వద్ద ఆప్టిమైజేషన్‌ను ప్రారంభించడానికి అనుమతిస్తుంది, ఇక్కడ పాయింట్ అనేది ansatzని కాన్ఫిగర్ చేసే పారామితుల జాబితా. డిఫాల్ట్‌గా ప్రారంభ పాయింట్ ``ఏదీ కాదు`` అంటే VQE ఒకదాన్ని ఎంచుకుంటుంది. ఈ సందర్భంలో ఎంపిక ఏమిటంటే, సరఫరా చేయబడిన ansatz ఒక ప్రాధాన్య పాయింట్‌ని కలిగి ఉంటే, దానికి అందించిన ప్రారంభ స్థితి ఆధారంగా, ఇది ఎంపిక చేయబడుతుంది, లేకుంటే ansatz కలిగి ఉన్న ఏదైనా హద్దులతో సరిపోయే యాదృచ్ఛిక ప్రారంభ పాయింట్ ఎంచుకోబడుతుంది. ప్రారంభ బిందువు సరఫరా చేయబడితే, అది ప్రాధాన్యతను తీసుకుంటుంది మరియు ఉపయోగించబడుతుంది - అయితే ఇది తప్పనిసరిగా ansatz సర్క్యూట్‌లోని పారామితుల సంఖ్యకు పొడవుతో సరిపోలాలి.
tr_tr: ``initial_point`` parametresi, optimizasyonun verilen noktada başlamasına izin verir; burada nokta, ansatz'ı yapılandıracak bir parametre listesidir. Varsayılan olarak başlangıç noktası ``None``, bu da VQE'nin birini seçeceği anlamına gelir. Bu durumda seçim, sağlanan ansatz'ın kendisine sağlanan ilk duruma bağlı olarak tercih edilen bir noktası varsa, o zaman bu seçilecektir, aksi takdirde ansatz'ın herhangi bir sınırına uyan rastgele bir başlangıç noktası seçilecektir. Bir başlangıç noktası sağlanmışsa, yine de öncelik kazanacak ve kullanılacaktır - ansatz devresindeki parametre sayısıyla uzunluk olarak eşleşmesi gerektiğine dikkat edin.

source: Here we see that result was arrived at much more quickly with ``optimizer_evals`` when it started from a random value when the initial point was not supplied (default of None).
bn_bn: এখানে আমরা দেখতে পাই যে, প্রাথমিক বিন্দু না দেয়ায় (default of None) ``optimizer_evals`` যখন এলোমেলো মান থেকে শুরু হয়, তার বিপরীতে আমরা বেশ তাড়াতাড়িই আমাদের ফলাফলে পৌঁছে যেতে পারি।
ru_ru: Здесь мы видим, что результат был получен гораздо быстрее при использовании ``optimizer_evals``, когда он начинал со случайного значения и начальная точка не была задана (по умолчанию None).
ta_in: ஆரம்ப புள்ளி வழங்கப்படாதபோது (முன்னிருப்பு - None) ஒரு தொடர்பின்றி எடுக்கப்பட்ட மதிப்பிலிருந்து தொடங்கியபோது, ``optimizer_evals`` உடன் அந்த முடிவு மிக விரைவாக வந்துள்ளது என்பதை இங்கே காண்கிறோம்.
te_in: ప్రారంభ పాయింట్ సప్లై చేయనప్పుడు (ఏదీ డిఫాల్ట్ కాదు) యాదృచ్ఛిక విలువ నుండి ప్రారంభమైనప్పుడు ఫలితం ``ఆప్టిమైజర్_ఎవాల్స్``తో చాలా త్వరగా చేరుకుందని ఇక్కడ మనం చూస్తాము.
tr_tr: Burada ilk nokta sağlanmadığında rastgele bir değerden başladığında (varsayılan Hiçbiri) ``optimizer_evals`` ile sonuca çok daha hızlı ulaşıldığını görüyoruz.

source: Where this becomes useful for examples where we the solution to one problem can be used to for a guess for the solution to a very close similar problem. Chemistry is very good example where we change the inter-atomic distance(s) of molecule to plot a dissociation profile. When the distance changes are small we expect the solution to still be nearby the prior one. One technique is to simply use the optimal point from one solution as the starting point for the next step. Now more complex techniques are possible that do some extrapolation to compute an initial position based on prior solution(s) rather than directly use the prior solution.
bn_bn: যেখানে এটি উদাহরণের জন্য উপযোগী হয়ে ওঠে সেখানে একটি সমস্যার সমাধান একটি খুব কাছাকাছি অনুরূপ সমস্যার সমাধানের জন্য অনুমানের জন্য একে ব্যবহার করা যেতে পারে। রসায়ন একটি খুব ভাল উদাহরণ যেখানে আমরা অণুর আন্ত-আনবিক দূরত্বগুলি পরিবর্তন করে একটি বিচ্ছিন্ন প্রোফাইল তৈরি করি। যখন দূরত্বের পরিবর্তনগুলি ছোট হয় তখন আমরা আশা করি সমাধান আগেরটির কাছাকাছি থাকবে। একটি কৌশল হল কেবলমাত্র একটি সমাধান থেকে পরবর্তী ধাপের সূচনা বিন্দু হিসেবে অনুকূল বিন্দুকে ব্যবহার করা। এখন আরো জটিল কৌশলগুলি সমাধান করা সম্ভব যা পূর্বের সমাধানগুলি এর উপর সরাসরি ভিত্তি না করেই একটি প্রাথমিক অবস্থান গণনার জন্য কিছু এক্সট্রোপোলেশন করে হিসাবনিকাশ করে।
ru_ru: Это полезно для примеров, когда решение одной задачи может быть использовано для предположения решения очень близкой аналогичной задачи. Химия - очень хороший пример, когда мы изменяем межатомные расстояния между молекулами, чтобы построить профиль диссоциации. Когда изменения расстояния малы, мы ожидаем, что решение все еще будет близко к предыдущему. Один из методов заключается в том, чтобы просто использовать оптимальную точку из одного решения в качестве отправной точки для следующего шага. Теперь возможны более сложные методы, которые делают некоторую экстраполяцию для вычисления начального положения на основе предыдущего решения (решений), а не напрямую используют предыдущее решение.
ta_in: எடுத்துக்காட்டுகளுக்கு இது பயனுள்ளதாக இருக்கும் இடத்தில், ஒரு பிரச்சினைக்கான தீர்வை மிக நெருக்கமான ஒத்த பிரச்சினைக்கான தீர்வுக்கான யூகத்திற்கு பயன்படுத்தலாம். வேதியியல் மிகச் சிறந்த எடுத்துக்காட்டு, அங்கு ஒரு விலகல் சுயவிவரத்தைத் திட்டமிட மூலக்கூறின் இடை-அணு தூரத்தை (களை) மாற்றுகிறோம். தூர மாற்றங்கள் சிறியதாக இருக்கும்போது, தீர்வு இன்னும் முந்தையதை அருகில் இருக்கும் என்று எதிர்பார்க்கிறோம். ஒரு நுட்பம் ஒரு தீர்விலிருந்து உகந்த புள்ளியை அடுத்த கட்டத்திற்கான தொடக்க புள்ளியாகப் பயன்படுத்துவது. இப்போது மிகவும் சிக்கலான நுட்பங்கள் சாத்தியமானவை, அவை முந்தைய தீர்வை நேரடியாகப் பயன்படுத்துவதற்குப் பதிலாக முந்தைய தீர்வை (களை) அடிப்படையாகக் கொண்டு ஒரு ஆரம்ப நிலையை கணக்கிட சில விரிவாக்கங்களைச் செய்கின்றன.
te_in: ఉదాహరణల కోసం ఇది ఉపయోగపడుతుంది, ఇక్కడ మేము ఒక సమస్యకు పరిష్కారాన్ని చాలా దగ్గరి సారూప్య సమస్యకు పరిష్కారం కోసం అంచనా వేయడానికి ఉపయోగించవచ్చు. రసాయన శాస్త్రం చాలా మంచి ఉదాహరణ, ఇక్కడ మేము డిస్సోసియేషన్ ప్రొఫైల్‌ను ప్లాట్ చేయడానికి అణువు యొక్క అంతర్-అణు దూరం(ల) ని మారుస్తాము. దూరం మార్పులు చిన్నగా ఉన్నప్పుడు, పరిష్కారం మునుపటిదానికి సమీపంలోనే ఉంటుందని మేము ఆశిస్తున్నాము. ఒక పరిష్కారం నుండి సరైన పాయింట్‌ను తదుపరి దశకు ప్రారంభ బిందువుగా ఉపయోగించడం ఒక సాంకేతికత. ఇప్పుడు మరింత సంక్లిష్టమైన సాంకేతికతలు సాధ్యమే, ఇవి నేరుగా ముందస్తు పరిష్కారాన్ని ఉపయోగించకుండా ముందస్తు పరిష్కారం(ల) ఆధారంగా ప్రారంభ స్థానాన్ని గణించడానికి కొంత ఎక్స్‌ట్రాపోలేషన్‌ను చేస్తాయి.
tr_tr: Bunun, bir problemin çözümünün, çok yakın benzer bir problemin çözümü için bir tahminde bulunmak için kullanılabileceği örnekler için yararlı olduğu yerlerde. Kimya, bir ayrışma profili çizmek için molekülün atomlar arası uzaklık(lar)ını değiştirdiğimiz çok iyi bir örnektir. Mesafe değişiklikleri küçük olduğunda, çözümün hala öncekine yakın olmasını bekleriz. Bir teknik, bir sonraki adım için başlangıç noktası olarak bir çözümdeki en uygun noktayı kullanmaktır. Şimdi, önceki çözümü doğrudan kullanmak yerine önceki çözüm(ler) e dayalı bir başlangıç pozisyonu hesaplamak için bazı ekstrapolasyonlar yapan daha karmaşık teknikler mümkündür.

source: The energy of the Hamiltonian operator that VQE is working on is the expectation value when evaluated with the parameterized ansatz. To compute the expectation value VQE uses an instance of an `expectation <https://qiskit.org/documentation/apidoc/qiskit.opflow.expectations.html>`__ object. Such an instance may be supplied via the ``expectation`` parameter, or in the default case, where it has a value of ``None``, VQE will use the `ExpectationFactory <https://qiskit.org/documentation/stubs/qiskit.opflow.expectations.ExpectationFactory.html>`__ to create itself a suitable instance based on the supplied backend.
bn_bn: VQE যে হ্যামিল্টনিয়ানের ওপর কাজ করে তার শক্তি হল যখন পরামিতিক ansatz দ্বারা নির্ধারণ করা হয় তার এক্সপেক্টেশনের মান। VQE এক্সপেক্টেশন মান হিসাব করতে `expectation <https://qiskit.org/documentation/apidoc/qiskit.opflow.expectations.html>`__ অবজেক্ট ব্যবহার করে। এই ধরনের একটি উদাহরণ ``expectation`` প্যারামিটারের মাধ্যমে সরবরাহ করা যেতে পারে, অথবা প্রাথমিকভাবে, যেখানে এর মান ``None`` হবে সেখানে VQE তে ব্যাকএণ্ড কর্তৃক সরবারহকৃত উপযুক্ত উদাহরন অনুযায়ী `ExpectationFactory <https://qiskit.org/documentation/stubs/qiskit.opflow.expectations.ExpectationFactory.html>`__ ব্যবহার করবে।
ru_ru: Энергия гамильтониана, над которым работает VQE, является значением математического ожидания при оценке с помощью параметризованного анзаца. Для вычисления значения матожидания VQE использует экземпляр объекта `expectation <https://qiskit.org/documentation/apidoc/qiskit.opflow.expectations.html>`__. Такой экземпляр может быть предоставлен через параметр ``expectation``, или в случае по умолчанию, когда он имеет значение ``None``, VQE будет использовать ``ExpectationFactory`` <https://qiskit.org/documentation/stubs/qiskit.opflow.expectations.ExpectationFactory.html>`__ для создания подходящего экземпляра на основе предоставленного backend.
ta_in: VQE பணிபுரியும் ஹாமில்டோனிய ஆபரேட்டரின் ஆற்றல் அளவுருவாக்கப்பட்ட அன்சாட்ஸுடன் மதிப்பீடு செய்யும்போது எதிர்பார்ப்பு மதிப்பு. எதிர்பார்ப்பு மதிப்பைக் கணக்கிட VQE ஒரு `expectation <https://qiskit.org/documentation/apidoc/qiskit.opflow.expectations.html>`__ ஆப்ஜெக்டின் உதாரணத்தைப் பயன்படுத்துகிறது. அத்தகைய நிகழ்வு ``expectation`` பராமீட்டர் வழியாக வழங்கப்படலாம் அல்லது இயல்புநிலை வழக்கில், அது ``None`` என்ற மதிப்பைக் கொண்டிருக்கலாம், VQE `ExpectationFactory <https://qiskit.org/documentation/stubs/qiskit.opflow.expectations.ExpectationFactory.html>`__ வழங்கப்பட்ட பின்தளத்தில் அடிப்படையில் ஒரு பொருத்தமான நிகழ்வை உருவாக்க உதவும்.
te_in: VQE పని చేస్తున్న హామిల్టోనియన్ ఆపరేటర్ యొక్క శక్తి అనేది పారామీటర్ చేయబడిన ansatzతో మూల్యాంకనం చేసినప్పుడు అంచనా విలువ. నిరీక్షణ విలువను గణించడానికి VQE ఒక `నిరీక్షణ <https://qiskit.org/documentation/apidoc/qiskit.opflow.expectations.html>`__ వస్తువు యొక్క ఉదాహరణను ఉపయోగిస్తుంది.అటువంటి ఉదాహరణ ``expectation`` పరామితి ద్వారా అందించబడవచ్చు లేదా డిఫాల్ట్ సందర్భంలో, దానికి ``None`` విలువ ఉంటే, VQE అందించిన బ్యాకెండ్ ఆధారంగా తగిన ఉదాహరణను సృష్టించడానికి `ExpectationFactory <https://qiskit.org/documentation/stubs/qiskit.opflow.expectations.ExpectationFactory.html>`__ ని ఉపయోగిస్తుంది.
tr_tr: VQE'nin üzerinde çalıştığı Hamilton operatörünün enerjisi, parametreli ansatz ile değerlendirildiğinde beklenen değerdir. Beklenti değerini hesaplamak için VQE, bir `expectation <https://qiskit.org/documentation/apidoc/qiskit.opflow.expectations.html>`__ nesnesinin bir örneğini kullanır. Böyle bir örnek, ``expectation`` parametresi aracılığıyla sağlanabilir veya ``None`` değerine sahip olduğu varsayılan durumda, VQE, sağlanan arka uca dayalı olarak kendisine uygun bir örnek oluşturmak için `ExpectationFactory <https://qiskit.org/documentation/stubs/qiskit.opflow.expectations.ExpectationFactory.html>`__ kullanacaktır.

source: For most cases letting VQE create a suitable instance is sufficient. However the Qiskit Aer aer_simulator supports a snapshot instruction that can be used in conjunction with the operator expectation computation. If used then the outcome is ideal, i.e. like the statevector simulator, and has no shot noise. Since people normally choose the aer_simulator to have shot noise (sampling noise), and be more like a real-device outcome, VQE has an ``include_custom`` flag that is passed on to the ExpectationFactory. When using Aer qasm simulator, and this is set ``True``, the factory will return ``AerPauliExpectation`` which uses the snapshot instruction, when ``False``, default, then the regular ``PauliExpectation`` is returned.
bn_bn: বেশিরভাগ ক্ষেত্রে ভি কিউ ই (VQE)- কে একটি উপযুক্ত উদাহরণ তৈরি করা যথেষ্ট। যাইহোক কিস্কিট এয়ার aer_simulator একটি স্ন্যাপশট নির্দেশনা সমর্থন করে যা অপারেটর সম্ভাব্যতার পরিমাণ গণনার সাথে ব্যবহার করা যেতে পারে। যদি ব্যবহার করা হয় তবে ফলাফলটি আদর্শ, যেমন স্টেটভেক্টর সিমুলেটর, এবং কোন শট শব্দ নেই। যেহেতু মানুষ সাধারনত aer_simulator বেছে নেয় শট ত্রুটি (স্যাম্পলিং ত্রুটি), এবং অনেকটা বাস্তব যন্ত্রের ফলাফলের মত, VQE- এর একটি ``include_custom`` পতাকা আছে যা ExpectationFactory- এ দেওয়া হয়। Aer qasm সিমুলেটর ব্যবহার করার সময়, এবং এটি "True" সেট করা হলে, কারখানাটি ``AerPauliExpectation`` ফিরিয়ে দেবে যা স্ন্যাপশট নির্দেশনা ব্যবহার করে, যখন "False", ডিফল্ট, তারপর নিয়মিত ``PauliExpectation` ফেরত দেওয়া হয়।
ru_ru: Для большинства случаев достаточно позволить VQE создать подходящий экземпляр. Однако Qiskit Aer aer_simulator поддерживает инструкцию snapshot, которая может быть использована вместе с вычислением математического ожидания оператора. Если ее использовать, то результат будет идеальным, т.е. как в симуляторе вектора состояния, и не будет иметь дробового шума. Поскольку люди обычно выбирают aer_simulator, чтобы он имел дробовой шум (шум выборки) и был более похож на результат реального устройства, VQE имеет опцию ``include_custom``, которая передается в ExpectationFactory. При использовании симулятора Aer qasm, если данный параметр установлен ``True``, фабрика возвращает ``AerPauliExpectation``, который использует инструкцию snapshot, если ``False`` (значение по умолчанию) то возвращается обычный ``PauliExpectation``.
ta_in: பெரும்பாலான சந்தர்ப்பங்களில் VQE ஒரு பொருத்தமான உதாரணத்தை உருவாக்க அனுமதித்தால் போதுமானது. இருப்பினும், Qiskit Aer aer_சிமுலேட்டர் ஒரு ஸ்னாப்ஷாட் அறிவுறுத்தலை ஆதரிக்கிறது, இது ஆபரேட்டர் எதிர்பார்ப்பு கணக்கீட்டுடன் இணைந்து பயன்படுத்தப்படலாம். பயன்படுத்தினால், விளைவு சிறந்தது, அதாவது ஸ்டேட்வெக்டர் சிமுலேட்டரைப் போன்றது, மற்றும் இரைச்சல் செலுத்தல் இல்லை. மக்கள் பொதுவாக aer_சிமுலேட்டர் -ஐ குறைவான இரைச்சல் செலுத்தல் (மாதிரிகள் இரைச்சல்) தேர்வு செய்வதால், மேலும் உண்மையான சாதன விளைவுகளைப் போலவே இருக்க வேண்டும் என்பதால், VQE இல் ``include_custom`` பிளாக் உள்ளது, இது எதிர்பார்ப்பு செயல்திறனுக்கு அனுப்பப்படுகிறது. Aer பிளவு சிமுலேட்டரைப் பயன்படுத்தும் போது, இது ``True`` என அமைக்கப்பட்டால், செயல்திறன் ஸ்னாப்ஷாட் வழிமுறைகளைப் பயன்படுத்தும் ``AerPauliExpectation`` ஐத் தரும், ``False``, முன்னிருப்பு, என அமைக்கப்பட்டால் வழக்கமான ``PauliExpectation`` ஐத் தரும்.
te_in: చాలా సందర్భాలలో తగిన ఉదాహరణను సృష్టించడానికి VQE ని అనుమతించడం సరిపోతుంది. అయితే Qiskit Aer aer_simulator ఆపరేటర్ ఎక్స్‌పెక్టేషన్ కంప్యూటేషన్‌తో కలిపి ఉపయోగించే స్నాప్‌షాట్ సూచనలకు మద్దతు ఇస్తుంది. ఉపయోగించినట్లయితే, ఫలితం ఆదర్శంగా ఉంటుంది, అంటే స్టేట్‌వెక్టర్ సిమ్యులేటర్ లాగా ఉంటుంది మరియు షాట్ నాయిస్ ఉండదు. వ్యక్తులు సాధారణంగా ఏర్_సిమ్యులేటర్‌ని షాట్ నాయిస్ (నాయిస్ శాంప్లింగ్ నాయిస్) కలిగి ఉండటానికి ఎంచుకుంటారు మరియు వాస్తవ-పరికర ఫలితం వలె ఉంటుంది కాబట్టి, VQE ఒక ``include_custom`` ఫ్లాగ్‌ని కలిగి ఉంది, అది ExpectationFactoryకి పంపబడుతుంది. Aer qasm సిమ్యులేటర్‌ని ఉపయోగిస్తున్నప్పుడు మరియు ఇది ``ట్రూ`` అని సెట్ చేయబడినప్పుడు, ఫ్యాక్టరీ ``AerPauliExpectation``ని అందిస్తుంది, ఇది స్నాప్‌షాట్ సూచనను ఉపయోగిస్తుంది, ``False``, డిఫాల్ట్‌గా ఉన్నప్పుడు సాధారణ ``PauliExpectation`` తిరిగి ఇవ్వబడుతుంది.
tr_tr: Çoğu durumda, VQE'nin uygun bir örnek oluşturmasına izin vermek yeterlidir. Ancak Qiskit Aer aer_simulator, operatör beklenti hesaplamasıyla birlikte kullanılabilen bir anlık görüntü talimatını destekler. Kullanılırsa sonuç idealdir, yani durum vektörü simülatörü gibidir ve deneme gürültüsü yoktur. İnsanlar normalde aer_simülatörü deneme gürültüsü (örnekleme gürültüsü) için seçtiklerinden ve daha çok gerçek cihaz sonucu gibi olduğundan, VQE'nin ExpectationFactory ile iletilen bir ``include_custom`` geçiş bayrağı vardır. Aer qasm simülatörünü kullanırken ve bu ``True`` olarak ayarlandığında, fabrika anlık görüntü talimatını kullanan``AerPauliExpectation``ı döndürür, ``False`` varsayılan olduğunda, normal ``PauliExpectation`` döndürülür.

source: In case you have doubts here is the aer_simulator again but include_custom has been left to default to False. The optimization ended abruptly, presumably due to the shot noise confusing the SLSQP optimizer.
bn_bn: যদি আপনার কোন সন্দেহ থাকে, তাহলে include_custom প্রাথমিক ভাবে False রেখে আবারও aer_simulator ব্যবহার করা হল। অপ্টিমাইজেশান হঠাৎ শেষ হয়ে গেছে, সম্ভবত শট নয়েজের কারণে SLSQP অপ্টিমাইজারকে বিভ্রান্ত হয়ে গেছে ।
ru_ru: Если у вас есть сомнения, вот снова aer_simulator, но значение include_custom было оставлено по умолчанию False. Оптимизация закончилась внезапно, предположительно из-за дробового шума, сбивающего с толку оптимизатор SLSQP.
ta_in: உங்களுக்கு இங்கே சந்தேகம் இருந்தால் மீண்டும் aer_simulator உள்ளது, ஆனால் include_custom முன்னிருப்பு தவறுக்கு விடப்பட்டுள்ளது. தேர்வுமுறை திடீரென முடிந்தது, இரைச்சல் செலுத்தல் SLSQP ஆப்டிமைசெர் குழப்புவதால் இருக்கலாம்.
te_in: మీకు సందేహాలు ఉన్నట్లయితే, ఇక్కడ మళ్లీ aer_simulator ఉంది కానీ చేర్చు_కస్టమ్ డిఫాల్ట్‌గా ఫాల్స్‌కు వదిలివేయబడింది. ఆప్టిమైజేషన్ ఆకస్మికంగా ముగిసింది, బహుశా షాట్ శబ్దం SLSQP ఆప్టిమైజర్‌ను గందరగోళానికి గురిచేస్తుంది.
tr_tr: Şüpheniz varsa, burada yine aer_simulator var, ancak include_custom varsayılan olarak False olarak bırakıldı. Optimizasyon, muhtemelen SLSQP optimize edicinin kafasını karıştıran atış gürültüsü nedeniyle aniden sona erdi.
