Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/05_iqpe_from_vqe.po
Languages: es_un, fr_fr, id_id, ja_jp, ko_kr, pt_br, ta_in, vi_vn

source: This page was generated from `tutorials/algorithms/05_iqpe_from_vqe.ipynb`__.
es_un: Esta página fue generada a partir de `tutorials/algorithms/05_iqpe_from_vqe.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/algorithms/05_iqpe_from_vqe.ipynb`__.
id_id: Halaman ini dibuat dari ` tutorials/algoritms/05_iqpe_from_vqe.ipynb ` __.
ja_jp: このページは `tutorials/algorithms/05_iqpe_from_vqe.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/algorithms/05_iqpe_from_vqe.ipynb`__ 로부터 생성되었다.
pt_br: Esta página foi gerada, a partir do `tutorials/algorithms/05_iqpe_from_vqe.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/algorithms/05_iqpe_from_vqe.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
vi_vn: Trang này được tạo từ `tutorials/algorithms/05_iqpe_from_vqe.ipynb`__.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/05_iqpe_from_vqe.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/05_iqpe_from_vqe.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/05_iqpe_from_vqe.ipynb>`_.
id_id: Jalankan secara interaktif di ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/05_iqpe_from_vqe.ipynb>` _.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/05_iqpe_from_vqe.ipynb>`_ でインタラクティブに実行します。
ko_kr: `IBM 퀀텀 랩 <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/05_iqpe_from_vqe.ipynb>`_ 에서 대화식으로 실행하십시오.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/05_iqpe_from_vqe.ipynb>`_.
ta_in: `IBM குவாண்டம் ஆய்வகத்தில் <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/07_grover.ipynb>` _ இல் ஊடாடும் வகையில் இயக்கவும்.
vi_vn: Chạy tương tác trực tiếp trong `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/05_iqpe_from_vqe.ipynb>`_.

source: IQPE and evolution of VQE output state
es_un: IQPE y la evolución del estado de salida de VQE
fr_fr: IQPE et l'évolution de l'état de sortie VQE
id_id: IQPE dan evolusi state output VQE
ja_jp: IQPE と VQE 出力状態の発展
ko_kr: IQPE와 VQE 출력 상태의 변화
pt_br: IQPE e evolução do estado de saída do VQE
ta_in: IQPE மற்றும் VQE வெளியீட்டு நிலையின் பரிணாமம்
vi_vn: IQPE và tiến triển của trạng thái đầu ra VQE

source: This notebook demonstrates using an output result state from `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__ as the input, starting state for evolution by the `IQPE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.IQPE.html>`__ (Iterative Quantum Phase Estimation) algorithm.
es_un: Este cuaderno muestra el uso del estado de resultado de salida de ` VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>` __ como la entrada, el estado inicial para la evolución mediante el algoritmo ` IQPE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.IQPE.html>` __ (Estimación Iterativa de Fase Quántica).
fr_fr: Ce bloc-notes montre l'utilisation d'un état de résultat en sortie à partir de `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__ comme entrée, état de départ de l'évolution par l'algorithme `IQPE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.IQPE.html>`__ (Iterative Quantum Phase Estimation) .
id_id: Notebook ini berisi demonstrasi penggunaan output state dari ` VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>` __ sebagai input, memulai state untuk evolusi oleh algoritma ` IQPE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.IQPE.html>` __ (Iterative Quantum Phase Estimation).
ja_jp: このノートブックでは、 `IQPE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.IQPE.html>`__ (Iterative Quantum Phase Estimation) アルゴリズムの入力、つまり開始状態として、 `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__ から得られた出力結果状態を利用する方法を実演します。
ko_kr: 이 노트북은 `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__ 알고리즘의 출력 상태를 `IQPE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.IQPE.html>`__ (Iterative Quantum Phase Estimation) 알고리즘의 시작 상태로 사용하는 방법을 설명한다.
pt_br: Este notebook demonstra o uso de um estado resultante de saída do `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__ como o estado inicial, de entrada, para evolução pelo algoritmo `IQPE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.IQPE.html>`__ (Estimação de Fase Quântica Iterativa).
ta_in: இந்த நோட்புக் `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>` __ இலிருந்து வெளியீட்டு முடிவு நிலையைப் பயன்படுத்துவதை நிரூபிக்கிறது, `IQPE <https: //qiskit.org/documentation/stubs/qiskit.aqua.algorithms.IQPE.html> `__ (மறுபயன்பாட்டு குவாண்டம் கட்ட மதிப்பீடு) வழிமுறை.
vi_vn: Notebook này thể hiện cách sử dụng trạng thái kết quả output từ `VQE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQE.html>`__ làm input, trạng thái bắt đầu cho sự tiến triển theo thuật toán `IQPE <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.IQPE.html>`__ (Iterative Quantum Phase Estimation).

source: This is accomplished by first running VQE and then preparing IQPE’s initial state using the variational form as produced by VQE upon its termination.
es_un: Esto se logra primero ejecutando el VQE y luego preparando el estado inicial de IQPE usando la forma variacional producida por VQE.
fr_fr: Ceci est accompli en exécutant d'abord VQE puis en préparant l'état initial de l'IQPE en utilisant la forme variationnelle telle qu'elle est produite par VQE lors de son arrêt.
id_id: Hal ini dicapai dengan pertama-tama menjalankan VQE dan kemudian mempersiapkan state awal IQPE dengan menggunakan bentuk variasional seperti yang dihasilkan VQE setelah dia berhenti.
ja_jp: これは最初に VQE を実行し、終了時に得られた変分形式によって IQPE の初期状態を準備することで達成されます。
ko_kr: 먼저 VQE를 실행하고 VQE에서 생성되는 변분 형태를 IQPE의 초기 상태로 사용하는 방식으로 구현한다.
pt_br: Isso é realizado primeiro rodando o VQE e depois preparando o estado inicial do IQPE usando a forma variacional como produzida pelo VQE mediante sua finalização.
ta_in: இது முதலில் VQE ஐ இயக்குவதன் மூலமும், அதன் முடிவில் VQE ஆல் தயாரிக்கப்பட்ட மாறுபட்ட வடிவத்தைப் பயன்படுத்தி IQPE இன் ஆரம்ப நிலையைத் தயாரிப்பதன் மூலமும் செய்யப்படுகிறது.
vi_vn: Điều này được thực hiện bằng cách chạy VQE sau đó chuẩn bị trạng thái ban đầu của IQPE bằng cách sử dụng hình thức biến đổi như đã thực hiện với VQE khi kết thúc nó.

source: First we create a qubit operator for VQE. Here we will use the same operator as used in the algorithms introduction, which was originally computed by Qiskit Chemistry for an H2 molecule.
es_un: Primero creamos un operador de qubits para VQE. Aquí utilizaremos el mismo operador que usamos en la introducción a algoritmos, que fue calculado originalmente por Qiskit Chemistry para la molécula de H2.
fr_fr: Nous créons tout d'abord un opérateur pour VQE. Ici nous utiliserons le même opérateur que celui qui a été utilisé dans l'introduction des algorithmes, et initialement calculé par Qiskit Chemistry pour une molécule H2.
id_id: Pertama kita buat operator qubit untuk VQE. Di sini kita menggunakan operator sama seperti pada perkenalan algoritma, yang aslinya dihitung dengan Qiskit Chemistry untuk molekul H2.
ja_jp: まず、 VQE 用の量子ビット演算子を作成します。ここではアルゴリズムの紹介で用いたものと同じ、元々は Qiskit Chemistry によって H2 分子のために計算された演算子を使用します。
ko_kr: 우선, VQE의 큐비트 연산자를 생성한다. 이 예제에서는 알고리즘 소개에서 사용했던것과 동일한 H2 분자에 대해 Qiskit Chemistry를 사용해 계산했던 것과 같은 연산자를 사용한다.
pt_br: Primeiro, criamos um operador de qubit para o VQE. Aqui, vamos usar o mesmo operador usado na introdução do algoritmo, que foi originalmente calculado pelo Qiskit Chemistry para uma molécula de H2.
ta_in: முதலில் நாம் VQE க்காக ஒரு குவிட் ஆபரேட்டரை உருவாக்குகிறோம். வழிமுறைகளின் அறிமுகத்தில் பயன்படுத்தப்பட்ட அதே ஆபரேட்டரை இங்கே பயன்படுத்துவோம், இது முதலில் எச் 2 மூலக்கூறுக்கு கிஸ்கிட் வேதியியலால் கணக்கிடப்பட்டது.
vi_vn: Đầu tiên, ta tạo một toán tử qubit cho VQE. Ở đây, ta sẽ sử dụng toán tử như đã dùng ở phần giới thiệu thuật toán mà ban đầu được tính ở Qiskit Chemistry cho một phân tử H2.

source: First we will use the classical NumPyMinimumEigensolver to compute a reference ground state energy value so later we can compare with the VQE result first, then IQPE’s.
es_un: Primero vamos a usar el NumPyMinimumEigensolver clásico para calcular el valor de referencia de la energía del estado base para que luego podamos comparar con el resultado del VQE primero, y luego con la del IQPE.
fr_fr: Nous utiliserons tout d'abord le NumPyMinimumEigensolver classique pour calculer une valeur de référence de l'état fondamental si plus tard nous pouvons comparer avec le résultat VQE en premier, puis celui de l'IQPE.
id_id: Pertama kita akan menggunakan versi klasik NumPyMinimumEigensolver untuk menghitung nilai energi state dasar sebagai referensi sehingga kemudian kita dapat membandingkan dengan hasil VQE terlebih dahulu, dan kemudian dengan IQPE.
ja_jp: 最初に古典的な NumPyMinimumEigensolver によって、基準となる基底エネルギーを計算しておきます。このようにすることで、後から VQE や IQPE の結果と比較することができます。
ko_kr: 먼저, 기존 NumPyMinimumEigensolver를 사용하여 기준 바닥 상태 에너지 값을 계산한 후 VQE 결과와 먼저 비교하고, 다음으로 IQPE와 비교할 것이다.
pt_br: Primeiro, vamos usar o NumPyMinimumEigensolver clássico para calcular o valor de referência da energia do estado fundamental, para que possamos depois comparar com o resultado do VQE primeiro, e então do IQPE.
ta_in: முதலில் ஒரு குறிப்பு நில நிலை ஆற்றல் மதிப்பைக் கணக்கிட கிளாசிக்கல் NumPyMinimumEigensolver ஐப் பயன்படுத்துவோம், எனவே பின்னர் முதலில் VQE முடிவுடன் ஒப்பிடலாம், பின்னர் IQPE கள்.
vi_vn: Đầu tiên chúng ta sẽ sử dụng các NumPyimumeigensolver cổ điển để tính toán giá trị năng lượng của trạng thái cơ bản tham chiếu để sau này chúng ta có thể so sánh với kết quả VQE, sau đó là kết quả của IQPE.

source: Having established the reference ground energy, we next carry on with our experiment. First we configure a VQE algorithm instance. The idea is that we can set an termination condition such that the VQE instance returns rather quickly with a rough estimation result.
es_un: Una vez que establecimos el valor de referencia para la energía del estado base, podemos continuar con el experimento. Primero configuramos una instancia del algoritmo VQE. La idea es que podamos establecer una condición de terminación dada que la instancia de VQE devuelva rápido un resultado estimado.
fr_fr: Après avoir établi l'énergie de référence de base, nous poursuivons notre expérience; nous configurons d'abord une instance d'algorithme VQE. L'idée est que nous puissions définir une condition de résiliation telle que l'instance VQE fournisse assez rapidement un résultat approximatif d'estimation.
id_id: Setelah menetapkan referensi energi dasar, kita berikutnya melanjutkan dengan eksperimen. Pertama kita membuat konfigurasi sebuah instans dari algoritma VQE. Idenya adalah kita dapat mengatur kondisi pengakhiran sedemikian rupa sehingga instans VQE berakhir agak cepat dengan hasil estimasi kasar.
ja_jp: 基準となる基底エネルギーが得られたので、実験を次に進めます。まず、 VQE アルゴリズムのインスタンスを設定します。ここでは、VQE インスタンスがおおよその推定結果を早く返すよう終了条件を設定しています。
ko_kr: 기준이되는 바닥 상태 에너지가 계산 된 후 본격 적인 실험을 진행한다. 우선 VQE 알고리즘 인스턴스를 구성한다. 정밀 하지는 않지만 사용할 만한 계산 값이 빨리 반환 될 수 있도록 적절한 알고리즘 종료 조건을 설정합니다.
pt_br: Tendo estabelecido a energia fundamental de referência, nós seguimos com o nosso experimento. Primeiro configuramos uma instância do algoritmo VQE. A ideia é que possamos configurar uma condição de finalização de tal forma que a instância do VQE retorne bastante rapidamente com uma estimativa aproximada.
ta_in: குறிப்பு நில ஆற்றலை நிறுவிய பின்னர், அடுத்ததாக எங்கள் பரிசோதனையை மேற்கொள்கிறோம். முதலில் நாம் ஒரு VQE வழிமுறை உதாரணத்தை உள்ளமைக்கிறோம். யோசனை என்னவென்றால், ஒரு மதிப்பீட்டு நிலையை நாம் அமைக்கலாம், அதாவது VQE நிகழ்வு ஒரு தோராயமான மதிப்பீட்டு முடிவுடன் விரைவாக திரும்பும்.
vi_vn: Sau khi thiết lập năng lượng nền tham chiếu, chúng ta tiếp tục tiến hành thí nghiệm. Đầu tiên chúng ta cấu hình một instance thuật toán VQE. Ý tưởng là chúng ta có thể đặt điều kiện kết thúc sao cho instance VQE trả về kết quả ước lượng sơ bộ một cách nhanh chóng.

source: As previously indicated, the energy estimation result is rather rough–it is far from being an acceptable final estimation figure. But, it is close enough such that the accompanying variational form might be a reasonably good approximation to the ground eigenstate, which means the corresponding wave function can serve as the initial state for the IQPE execution that follows. We next prepare such an initial state.
es_un: Como fue previamente indicado, el resultado de la energía estimada es bastante aproximada —está lejos de ser una estimación aceptable. Pero esta suficientemente cerca para que la forma variacional que lo acompaña sea un aproximado razonable del eigenestado base, lo cual significa que la función de onda correspondiente puede ser usada como el estado inicial para la ejecución del IQPE que sigue. A continuación, preparamos dicho estado inicial.
fr_fr: Comme cela a été indiqué précédemment, le résultat de l’estimation de l’énergie est plutôt grossier – il est loin d’être un chiffre d’estimation final acceptable. Cependant il est assez proche, de telle sorte que la forme variationnelle qui l'accompagne pourrait être une approximation raisonnablement correcte de l'état propre de base, ce qui signifie que la fonction d'onde correspondante peut servir d'état initial pour l'exécution IQPE qui suit. Nous préparons ensuite un tel état initial.
id_id: Seperti yang ditunjukkan sebelumnya, hasil perkiraan energi agak kasar -- jauh dari angka perkiraan akhir yang dapat diterima sebagai valid. Tetapi, hal ini cukup dekat sehingga bentuk variasional yang menyertainya mungkin merupakan perkiraan yang cukup baik untuk eigenstate dasar, yang berarti fungsi gelombang yang terkait dapat berfungsi sebagai state awal untuk eksekusi IQPE yang mengikuti. Kami berikutnya mempersiapkan state awal seperti itu.
ja_jp: 先に述べたように、エネルギーの推定結果はかなり大雑把なもので、最終的な推定値として許容できるものからはかけ離れています。しかし、それに伴う変分形式が基底固有状態の良い近似となっているということ、つまり対応する波動関数が後に続く IQPE の初期状態として役立つということを言うには、十分近いものとなっています。次にそのような初期状態を用意しましょう。
ko_kr: 전술한 바와 같이, 에너지 추정 결과는 다소 대략적(rough) 이며 수용 가능한 최소 추정 수치와는 거리가 멀다. 그러나 수반되는 variational form은 바닥 고유 상태에 대하여 합리적으로 좋은 근사치가 될 수 있을만큼 충분히 가까우며, 이는 해당 파동 함수(wave function) 가 후속 IQPE 실행을 위한 초기 상태 역할을 할 수 있다는 것을 의미한다. 이제 이와 같은 초기 상태를 준비할 것이다.
pt_br: Como indicado anteriormente, o resultado da estimação da energia é bastante grosseiro-está longe de ser uma figura de estimação final aceitável. Mas, é próximo o suficiente para que a forma variacional acompanhante possa ser uma aproximação razoavelmente boa do autoestado fundamental, o que significa que a função de onda correspondente pode servir como estado inicial para a execução do IQPE depois. A seguir preparamos tal estado inicial.
ta_in: முன்னர் சுட்டிக்காட்டப்பட்டபடி, ஆற்றல் மதிப்பீட்டு முடிவு மிகவும் கடினமானதாகும் - இது ஏற்றுக்கொள்ளக்கூடிய இறுதி மதிப்பீட்டு நபராக இருந்து வெகு தொலைவில் உள்ளது. ஆனால், அதனுடன் கூடிய மாறுபட்ட வடிவம் தரையில் உள்ள ஐஜென்ஸ்டேட்டுக்கு ஒரு நல்ல தோராயமாக இருக்கக்கூடும், அதாவது தொடர்புடைய அலை செயல்பாடு தொடர்ந்து வரும் IQPE மரணதண்டனைக்கான ஆரம்ப நிலையாக செயல்பட முடியும். அத்தகைய ஆரம்ப நிலையை நாங்கள் அடுத்ததாக தயார் செய்கிறோம்.
vi_vn: Như đã chỉ ra trước đây, kết quả ước tính năng lượng khá "thô" - nó khá xa so với con số ước tính cuối cùng có thể chấp nhận được. Tuy nhiên, nó đủ gần để hình thức biến đổi đi kèm có thể là một phép gần đúng hợp lý so với trạng thái riêng cơ bản, có nghĩa là hàm sóng tương ứng có thể đóng vai trò là trạng thái ban đầu cho việc thực thi IQPE sau đó. Tiếp theo chúng ta chuẩn bị một trạng thái khởi tạo như vậy.

source: With the VQE-generated quantum state wave function prepared for the initial state, we now go ahead with configuring and running an IQPE instance.
es_un: Con la función de onda del estado cuántico generada por VQE preparada para el estado inicial, podemos continuar configurando y ejecutando la instancia de IQPE.
fr_fr: Avec la fonction d'onde d'état quantique générée par VQE préparée pour l'état initial, nous allons maintenant procéder à la configuration et à l'exécution d'une instance IQPE.
id_id: Dengan fungsi gelombang state kuantum dari VQE yang disiapkan untuk state awal, kita sekarang melanjutkan dengan konfigurasi dan menjalankan sebuah instans IQPE.
ja_jp: VQE が生成した量子状態の波動関数を初期状態として用意できたので、次に IQPE インスタンスの設定と実行に進みます。
ko_kr: 초기 상태를 위하여 VQE로부터 생성된 양자 상태 파동 함수(quantum state wave function) 를 사용하여, 이제 IQPE 인스턴스를 구성하고 실행할 것이다.
pt_br: Com a função de onda quântica gerada pelo VQE preparada para o estado inicial, agora vamos em frente com a configuração e execução de uma instância IQPE.
ta_in: ஆரம்ப நிலைக்கு தயாரிக்கப்பட்ட VQE- உருவாக்கிய குவாண்டம் நிலை அலை செயல்பாடு மூலம், இப்போது ஒரு IQPE நிகழ்வை உள்ளமைத்து இயக்குவதில் முன்னேறுகிறோம்.
vi_vn: Với hàm sóng trạng thái lượng tử do VQE tạo ra được chuẩn bị cho trạng thái ban đầu, bây giờ chúng ta tiếp tục với việc định cấu hình và chạy một IQPE instance.

source: As can be seen, the resultant ground state energy estimation, as produced by IQPE, is much more accurate that the intermediate result produced by VQE.
es_un: Como se puede ver, la estimación de la energía del estado base resultante, como es producida por el IQPE, es mucho más precisa que el estado intermedio producido por VQE.
fr_fr: Comme on peut le voir, l'estimation de l'énergie de l'état fondamental qui en résulte, telle que produite par l'IQPE, est beaucoup plus précise que le résultat intermédiaire produit par VQE.
id_id: Seperti yang dapat dilihat, estimasi energi state dasar, seperti yang dihasilkan oleh IQPE, jauh lebih akurat daripada hasil yang dihasilkan oleh VQE.
ja_jp: このように IQPE で得られた基底エネルギーの推定結果は、 VQE によって得られた中間結果よりもはるかに正確となっています。
ko_kr: 보다시피, IQPE에 의한 바닥 상태 에너지 추정 결과는 VQE의 중간 결과보다 훨씬 더 정확하다.
pt_br: Como pode ser visto, a estimativa de energia do estado fundamental resultante, conforme produzido pelo IQPE, é muito mais precisa que o resultado intermediário produzido pelo VQE.
ta_in: காணக்கூடியது போல, இதன் விளைவாக நிலத்தடி மாநில ஆற்றல் மதிப்பீடு, IQPE ஆல் தயாரிக்கப்பட்டது, VQE ஆல் உற்பத்தி செய்யப்படும் இடைநிலை முடிவு மிகவும் துல்லியமானது.
vi_vn: Có thể thấy, kết quả ước tính năng lượng trạng thái cơ bản do IQPE tạo ra, chính xác hơn nhiều so với kết quả trung gian do VQE tạo ra.
