Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/05_qaoa.po
Languages: es_un, fr, ja, ko, ta, te

source: This page was generated from `tutorials/algorithms/05_qaoa.ipynb`__.
es_un: Esta página fue generada a partir de `tutorials/algorithms/05_qaoa.ipynb`__.
fr: Cette page a été générée à partir de `tutorials/algorithms/05_qaoa.ipynb`__.
ja: このページは `tutorials/algorithms/05_qaoa.ipynb`__ から生成されました。
ko: 이 페이지는 `tutorials/algorithms/05_qaoa.ipynb`__ 로부터 생성되었다.
ta: இந்த பக்கம் `tutorials/algorithms/05_qaoa.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
te: ఈ పేజీ `tutorials/algorithms/05_qaoa.ipynb`__ నుండి రూపొందించబడింది.

source: Quantum Approximate Optimization Algorithm
es_un: Algoritmo Cuántico de Optimización Aproximada
fr: Algorithme Quantique d'Optimisation Approximée
ja: 量子近似最適化アルゴリズム
ko: 양자 근사 최적화 알고리즘
ta: குவாண்டம் தோராயமான உகப்பாக்கம் வழிமுறைகள்
te: క్వాంటం ఉజ్జాయింపు ఆప్టిమైజేషన్ అల్గోరిథం

source: Qiskit has an implementation of the Quantum Approximate Optimization Algorithm `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.QAOA.html>`__ and this notebook demonstrates using it for a graph partition problem.
es_un: Qiskit tiene una implementación del Algoritmo Cuántico de Optimización Aproximada (Quantum Approximate Optimization Algorithm) `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.QAOA.html>`__ y este cuaderno demuestra su uso para un problema de partición de grafos.
fr: Qiskit dispose d'une implémentation d'Algorithme Quantique d'Optimisation Approximée `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.QAOA.html>`__ et ce bloc-notes démontre son utilisation pour un problème de partition de graphe.
ja: Qiskit には量子近似最適化アルゴリズム `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.QAOA.html>`__ の実装があり、このノートブックではグラフ分割問題への適用方法を示します。
ko: Qiskit에는 양자 근사 최적화 알고리즘 `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.QAOA.html>`__ 이 구현되어 있다. 이 노트북은 그래프 분할 (graph partition) 문제에 이를 적용하는 방법을 시연할 것이다.
ta: கிஸ்கிட் குவாண்டம் தோராயமான தேர்வுமுறை வழிமுறை 'QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.QAOA.html>'__ ஐ செயல்படுத்துகிறது, மேலும் இந்த நோட்புக் வரைபட பகிர்வு சிக்கலுக்கு அதைப் பயன்படுத்துவதை நிரூபிக்கிறது.
te: Qiskit క్వాంటం ఉజ్జాయింపు ఆప్టిమైజేషన్ అల్గారిథమ్ `QAOA <https://qiskit.org/documentation/stubs/qiskit.algorithms.minimum_eigensolvers.QAOA.html>`__ అమలును కలిగి ఉంది మరియు ఈ నోట్‌బుక్ దానిని ఒక సమస్య కోసం ఉపయోగించడాన్ని ప్రదర్శిస్తుంది.

source: Before we begin, let's import the ``annotations`` module from ``__future__`` to allow postponed evaluation of annotations. This enables us to use simpler type hints throughout the notebook.
es_un: Antes de comenzar, importemos el módulo ``annotations`` de ``__future__`` para permitir la evaluación pospuesta de las anotaciones. Esto nos permite usar sugerencias de tipo más simples en todo el cuaderno.
fr: Avant de commencer, importons le module ``annotations`` de ``__future__`` pour permettre une évaluation reportée des annotations. Cela nous permet d'utiliser des astuces plus simples dans tout le notebook.
ja: 始める前に、 ``__future__`` から ``annotations`` モジュールをインポートして、アノテーションの評価を延期できるようにしましょう。これにより、ノートブック全体でよりシンプルな型ヒントを使用できるようになります。
te: మేము ప్రారంభించడానికి ముందు, ఉల్లేఖనాల వాయిదా మూల్యాంకనాన్ని అనుమతించడానికి ``__future__`` నుండి ``ఉల్లేఖనాలు`` మాడ్యూల్‌ని దిగుమతి చేద్దాం. ఇది నోట్‌బుక్ అంతటా సరళమైన టైప్ సూచనలను ఉపయోగించడానికి మాకు వీలు కల్పిస్తుంది.

source: First we create a graph and draw it so it can be seen.
es_un: Primero creamos una gráfica y la dibujamos para que se pueda ver.
fr: Tout d'abord, nous créons un graphique et le dessinons pour qu'il puisse être vu.
ja: まずランダムなグラフを作成し、可視化します。
ko: 먼저 그래프를 생성하고 이를 그려서 확인해보자.
ta: முதலில் நாம் ஒரு வரைபடத்தை உருவாக்கி அதை வரைவதால் அதைப் பார்க்க முடியும்.
te: మొదట మనం ఒక గ్రాఫ్‌ని సృష్టించి, దానిని చూడగలిగేలా గీస్తాము.

source: The brute-force method is as follows. Basically, we exhaustively try all the binary assignments. In each binary assignment, the entry of a vertex is either 0 (meaning the vertex is in the first partition) or 1 (meaning the vertex is in the second partition). We print the binary assignment that satisfies the definition of the graph partition and corresponds to the minimal number of crossing edges.
es_un: El método de fuerza bruta es el siguiente. Básicamente, probamos exhaustivamente todas las asignaciones binarias. En cada asignación binaria, la entrada de un vértice es 0 (lo que significa que el vértice está en la primera partición) o 1 (lo que significa que el vértice está en la segunda partición). Imprimimos la asignación binaria que satisface la definición de la partición del grafo y corresponde al número mínimo de aristas que se cruzan.
fr: La méthode brute-force est la suivante. En résumé, toutes les affectations binaires sont tentées. Dans chaque affectation binaire, l'entrée d'un sommet est soit 0 (ce qui signifie que le sommet est dans la première partition) soit 1 (ce qui signifie que le sommet est dans la deuxième partition). Nous affichons l'assignation binaire qui satisfait à la définition de la partition graphique et qui correspond au nombre minimal d'arêtes croisées.
ja: 総当たり法は以下の通りです。基本的には、あらゆる二進数の割り当てを網羅的に試します。それぞれの二進数の割り当てでは、頂点の値は 0 (その頂点が第一パーティションにあることを示す) か、 1 (その頂点が第二パーティションにあることを示す) のいずれかとなっています。グラフ分割の定義を満たし、パーティション間の辺の数が最小となる場合に対応する二進数の割り当てを表示します。
ko: 억지 방법(brute-force method) 은 다음과 같다. 기본적으로 철저히 모든 경우의 수에 대하여 바이너리 할당(binary assignment) 을 시도한다. 각 바이너리 할당에서 꼭짓점의 항목은 0 (꼭짓점이 첫 번째 분할 영역에 있음을 의미) 또는 1 (꼭짓점이 두 번째 분할 영역에 있음을 의미) 이다. 그래프 분할의 정의를 충족하면서 모서리 교차횟수가 최소인 바이너리 할당 결과를 출력한다.
ta: Brute-force முறை பின்வருமாறு. அடிப்படையில், அனைத்து பைனரி பணிகளையும் நாம் முழுமையாக முயற்சிக்கிறோம். ஒவ்வொரு பைனரி ஒதுக்கீட்டிலும், ஒரு வெர்டெக்ஸின் நுழைவு 0 (அதாவது வெர்டெக்ஸ் முதல் பகிர்வில் உள்ளது) அல்லது 1 (அதாவது வெர்டெக்ஸ் இரண்டாவது பகிர்வில் உள்ளது). வரைபட பகிர்வின் வரையறையை பூர்த்திசெய்யும் பைனரி அசைன்மென்ட்டை நாம் அச்சிடுகிறோம், மேலும் குறைந்த எண்ணிக்கையிலான குறுக்கு விளிம்புகளுக்கு ஒத்திருக்கிறது.
te: బ్రూట్-ఫోర్స్ పద్ధతి క్రింది విధంగా ఉంది. ప్రాథమికంగా, మేము అన్ని బైనరీ అసైన్‌మెంట్‌లను సమగ్రంగా ప్రయత్నిస్తాము. ప్రతి బైనరీ అసైన్‌మెంట్‌లో, శీర్షం యొక్క ప్రవేశం 0 (అంటే శీర్షం మొదటి విభజనలో ఉంది) లేదా 1 (అంటే శీర్షం రెండవ విభజనలో ఉందని అర్థం). మేము గ్రాఫ్ విభజన యొక్క నిర్వచనాన్ని సంతృప్తిపరిచే బైనరీ అసైన్‌మెంట్‌ను ప్రింట్ చేస్తాము మరియు క్రాసింగ్ అంచుల కనీస సంఖ్యకు అనుగుణంగా ఉంటుంది.

source: The graph partition problem can be converted to an Ising Hamiltonian. Qiskit has different capabilities in the Optimization module to do this. Here, since the goal is to show QAOA, the module is used without further explanation to create the operator. The paper `Ising formulations of many NP problems <https://arxiv.org/abs/1302.5843>`__ may be of interest if you would like to understand the technique further.
es_un: El problema de la partición de grafos se puede convertir a un Hamiltoniano de Ising. Qiskit tiene diferentes capacidades en el módulo de Optimization para hacer esto. Aquí, dado que el objetivo es mostrar QAOA, el módulo se usa sin más explicación para crear el operador. El artículo `Ising formulations of many NP Problems <https://arxiv.org/abs/1302.5843>`__ puede ser de interés si deseas comprender mejor la técnica.
fr: Le problème de la partition graphique peut être converti en un Hamiltonien Ising. Qiskit dispose de différentes capacités dans le module d'optimisation pour ce faire. Ici, puisque l'objectif est de montrer QAOA, le module est utilisé sans explication supplémentaire pour créer l'opérateur. L'article `Ising formulations of many NP problems <https://arxiv.org/abs/1302.5843>`__ peut être intéressant si vous souhaitez mieux comprendre cette technique.
ja: グラフ分割問題は、イジング・ハミルトニアンに変換することができます。 Qiskit では、これを実行するため最適化モジュールに別の機能が用意されています。ここでは QAOA を実演することが目的なので、演算子を作成するためのモジュールについては、これ以上説明せずに用いることとします。 `Ising formulations of many NP problems <https://arxiv.org/abs/1302.5843>`__ という論文は、この手法をより理解したいという方に興味深いかもしれません。
ko: 그래프 분할 문제는 이징 해밀토니안 (Ising Hamiltonian) 으로 변환할 수 있다. Qiskit은 이를 수행하기 위하여 최적화 모듈에서 다양한 기능을 제공한다. 여기서 목표는 QAOA를 보여주는 것이므로 추가 설명 없이 모듈을 사용하여 연산자를 생성한다. 위의 기술을 더 이해하고 싶다면 다음의 논문 `Ising formulations of many NP problems <https://arxiv.org/abs/1302.5843>`__ 이 흥미로울 것이다.
ta: வரைபட பகிர்வு சிக்கலை ஐசிங் ஹாமில்டோனியனாக மாற்றலாம். இதைச் செய்வதற்கான உகப்பாக்கம் தொகுதியில் கிஸ்கிட் வெவ்வேறு திறன்களைக் கொண்டுள்ளது. இங்கே, QAOA ஐக் காண்பிப்பதே குறிக்கோள் என்பதால், ஆபரேட்டரை உருவாக்க தொகுதி மேலும் விளக்கம் இல்லாமல் பயன்படுத்தப்படுகிறது. `Ising formulations of many NP problems <https://arxiv.org/abs/1302.5843>`__ நீங்கள் நுட்பத்தை மேலும் புரிந்து கொள்ள விரும்பினால் ஆர்வமாக இருக்கலாம்.
te: గ్రాఫ్ విభజన సమస్యను ఐసింగ్ హామిల్టోనియన్‌గా మార్చవచ్చు. దీన్ని చేయడానికి ఆప్టిమైజేషన్ మాడ్యూల్‌లో Qiskit విభిన్న సామర్థ్యాలను కలిగి ఉంది. ఇక్కడ, QAOAని చూపడం లక్ష్యం కాబట్టి, ఆపరేటర్‌ని సృష్టించడానికి మాడ్యూల్ తదుపరి వివరణ లేకుండా ఉపయోగించబడుతుంది. మీరు సాంకేతికతను మరింత అర్థం చేసుకోవాలనుకుంటే `అనేక NP సమస్యలకు సంబంధించిన సూత్రీకరణలు <https://arxiv.org/abs/1302.5843>`__ అనే పేపర్ ఆసక్తిని కలిగిస్తుంది.

source: So lets use the QAOA algorithm to find the solution.
es_un: Entonces, usemos el algoritmo QAOA para encontrar la solución.
fr: Utilisons donc l'algorithme QAOA pour trouver la solution.
ja: では QAOA アルゴリズムを用いて、解を求めましょう。
ko: 그래서 QAOA 알고리즘을 사용하여 솔루션을 찾아보자.
ta: எனவே தீர்வைக் காண QAOA வழிமுறையைப் பயன்படுத்தலாம்.
te: కాబట్టి పరిష్కారాన్ని కనుగొనడానికి QAOA అల్గారిథమ్‌ని ఉపయోగించండి.

source: The outcome can be seen to match to the value computed above by brute force. But we can also use the classical ``NumPyMinimumEigensolver`` to do the computation, which may be useful as a reference without doing things by brute force.
es_un: Se puede ver que el resultado coincide con el valor calculado anteriormente por fuerza bruta. Pero también podemos usar el ``NumPyMinimumEigensolver`` clásico para hacer el cálculo, que puede ser útil como referencia sin hacer las cosas por fuerza bruta.
fr: Le résultat peut être considéré comme correspondant à la valeur calculée ci-dessus par la force brute. Mais nous pouvons aussi utiliser le classique ``NumPyMinimumEigensolver`` pour faire le calcul, ce qui peut être utile comme référence sans utiliser la méthode de force brute.
ja: 結果は、上記の総当たり法で計算された値に一致していることがわかります。一方、古典的な ``NumPyMinimumEigensolver`` によって計算を行うこともできます。この方法は、総当たり法を用いずに参照値を得る上で役に立つでしょう。
ko: 도출된 결과는 위에서 억지 기법으로 계산한 값과 일치하는 것을 확인할 수 있다. 그러나 또한 우리는 기존의 ``NumPyMinimumEigensolver`` 를 사용하여 계산을 수행할 수 있는데, 이는 억지 기법을 수행하지 않는 다는 점에서 참조하면 유용할 것이다.
ta: Brute force பயன்படுத்துவதன் மூலம் கணக்கிடப்பட்ட மதிப்புடன் பொருந்தக்கூடிய விளைவைக் காணலாம். ஆனால் கணக்கீட்டைச் செய்ய கிளாசிக்கல் NumPyMinimumEigensolver ஐப் பயன்படுத்தலாம், இது brute force பயன்படுத்தாமல் ஒரு குறிப்பாக பயனுள்ளதாக இருக்கும்.
te: బ్రూట్ ఫోర్స్ ద్వారా పైన లెక్కించబడిన విలువకు ఫలితం సరిపోలినట్లు చూడవచ్చు. కానీ గణన చేయడానికి మనం క్లాసికల్ ``NumPyMinimumEigensolver``ని కూడా ఉపయోగించవచ్చు, ఇది క్రూరమైన శక్తితో పనులు చేయకుండా సూచనగా ఉపయోగపడుతుంది.

source: It is also possible to use VQE as is shown below
es_un: También es posible utilizar VQE como se muestra a continuación
fr: Il est également possible d'utiliser VQE comme indiqué ci-dessous
ja: また、以下のようにして VQE を用いることも可能です。
ko: 아래와 같이 VQE를 사용할 수도 있다
ta: கீழே காட்டப்பட்டுள்ளபடி VQE ஐப் பயன்படுத்தவும் முடியும்
te: దిగువ చూపిన విధంగా VQEని ఉపయోగించడం కూడా సాధ్యమే

source: Before we begin, let’s import the ``annotations`` module from ``__future__`` to allow postponed evaluation of annotations. This enables us to use simpler type hints throughout the notebook.
ko: 시작하기 전에, ``__future__`` 에서 ``annotations`` 모듈을 주석의 연기된 평가를 위해 불러오자. 이렇게 하면 노트북 전체에서 더 간단한 유형의 힌트를 사용할 수 있다.
ta: தொடங்குவதற்கு முன், சிறுகுறிப்புகளின் ஒத்திவைக்கப்பட்ட மதிப்பீட்டை அனுமதிக்க '__future__' என்பதிலிருந்து 'annotations' தொகுதியை இறக்குமதி செய்வோம். இது நோட்புக் முழுவதும் எளிய வகை குறிப்புகளைப் பயன்படுத்த உதவுகிறது.
