Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/06_grover.po
Languages: bn_bn, es_un, fr_fr, ko_kr, pl, ru, ta_in, te, tr_tr

source: Additionally there is the ``sample_from_iterations`` argument. When it is ``True``, instead of the specific power in ``iterations``, a random integer between 0 and the value in ``iteration`` is used as the power Grover’s operator. This approach is useful when we don’t even know the number of solution.
bn_bn: এছাড়াও ``sample_from_iterations`` নামক একটা আরগুমেন্ট আছে। যখন এটা ``True`` হয়, গ্রোভারের অপারেটরের মত নির্দিষ্ট সূচকের পুনরাবৃত্তির বদলে 0 এবং পুনরাবৃত্তির মানের একটি র‍্যান্ডম ইন্টেজার এখানে ব্যাবহ্রিত হয়।
es_un: Además, existe el argumento ``sample_from_iterations``. Cuando es ``True``, en lugar de la potencia específicada en ``iterations``, se utiliza un número entero aleatorio entre 0 y el valor en ``iteration`` como el operador de potencia de Grover. Este enfoque es útil cuando ni siquiera sabemos la cantidad de soluciones.
fr_fr: De plus, il y a l'argument ``sample_from_iterations``. Quand il est à ``True``, au lieu d'appliquer le nombre d'itérations spécifiées, un nombre entier aléatoire compris entre 0 et la valeur de ``iteration`` est utilisé comme nombre d'itérations de l'opérateur de Grover. Cette approche est utile lorsque nous ne connaissons pas le nombre de solutions.
ko_kr: 이와 더불어 ``sample_from_iterations`` 인수가 있다. ``True`` 이면 ``iterations`` 의 특정 거듭 제곱 대신 0과 ``iterations`` 의 값 사이의 임의의 정수가 그로버 연산자의 제곱으로 사용된다. 이러한 접근 방식은 솔루션의 개수를 모를 때 조차도 유용하다.
ru: Существует также аргумент ``sample_from_iterations``. При значении ``True`` степени оператора будут случайными числами от 0 до ``iteration`` в каждой из серий. Это полезно, если количество решений неизвестно.
ta_in: கூடுதலாக, ``sample_from_iterations`` வாதம் உள்ளது. இது ``True`` ஆக இருக்கும்போது, ``iterations`` இல் உள்ள குறிப்பிட்ட சக்திக்கு பதிலாக, 0 மற்றும் ``iterations`` இன் மதிப்பு ஆகியவற்றுக்கு இடையேயான ஒரு சீரற்ற முழு எண் பவர் க்ரோவரின் ஆபரேட்டராகப் பயன்படுத்தப்படுகிறது. தீர்வின் எண்ணிக்கை கூட நமக்குத் தெரியாதபோது கூட இந்த அணுகுமுறை பயனுள்ளதாக இருக்கும்.
tr_tr: Ek olarak ``sample_from_iterations`` argümanı vardır. ``True`` olduğunda, ``iterations`` içerisinde özel bir kuvvet yerine 0 ve ``iteration`` içindeki değer arasında rasgele bir tam sayı, Grover operatörünün kuvveti olarak kullanılır. Bu yaklaşım, çözüm sayısını bile bilmediğimiz zaman kullanışlı olmaktadır.

source: For more details of the algorithm using ``sample_from_iterations``, see [4].
bn_bn: ``sample_from_iterations`` ব্যাবহার করে অ্যালগরিদমটির সম্পর্কে বিস্তারিত জানতে [4] দেখুন।
es_un: Para obtener más detalles sobre el algoritmo que utiliza ``sample_from_iterations``, consulta [4].
fr_fr: Pour plus de détails sur l'algorithme utilisant ``sample_from_iterations``, voir [4].
ko_kr: ``sample_from_iterations`` 를 사용하는 알고리즘에 대한 자세한 내용은 [4] 를 참조하라.
pl: Więcej szczegółów na temat algorytmu wykorzystującego ``sample_from_iterations`` znajdziesz w [4].
ru: Более подробная информация об использовании ``sample_from_iterations`` имеется в [4].
ta_in: ``sample_from_iterations``, ஐப் பயன்படுத்தி வழிமுறையின் கூடுதல் விவரங்களுக்கு, [4] ஐப் பார்க்கவும்.
te: అల్గోరిథం యొక్క మరిన్ని వివరాల కోసం ``సాంపిల్_ఫ్రమ్_ఇటరేషన్స్``ని ఉపయోగించి, [4] చూడండి.
tr_tr: ``sample_from_iterations`` kullanan algoritma hakkında daha fazla ayrıntı için bakınız [4].

source: [4]: Boyer et al., Tight bounds on quantum searching `arxiv:quant-ph/9605034 <https://arxiv.org/abs/quant-ph/9605034>`__
te: [4]: బోయర్ మరియు ఇతరులు., క్వాంటం శోధనపై గట్టి హద్దులు `arxiv:quant-ph/9605034 <https://arxiv.org/abs/quant-ph/9605034>`__
tr_tr: [4]: Boyer et al., Boyer ve diğerleri, Kuantum aramasında sıkı sınırlar `arxiv:quant-ph/9605034 <https://arxiv.org/abs/quant-ph/9605034>`__

source: When the number of solutions is known, we can also use a static method ``optimal_num_iterations`` to find the optimal number of iterations. Note that the output iterations is an approximate value. When the number of qubits is small, the output iterations may not be optimal.
bn_bn: যখন ফলাফলের সংখ্যা জানা হয়ে যায়, সর্বচ্চ সংখ্যক পুনরাবৃত্তি খুজে পেতে আমরা ``optimal_num_iterations`` স্ট্যাটিক মেথডটি ব্যাবহার করতে পারি।
es_un: Cuando se conoce el número de soluciones, también podemos usar un método estático ``optimal_num_iterations`` para encontrar el número óptimo de iteraciones. Ten en cuenta que las iteraciones de salida son un valor aproximado. Cuando el número de qubits es pequeño, las iteraciones de salida pueden no ser óptimas.
fr_fr: Lorsque le nombre de solutions est connu, nous pouvons également utiliser une méthode statique ``optimal_num_iterations`` pour obtenir le nombre optimal d'itérations. Notez que le nombre d'itérations ainsi obtenu est une valeur approximative. Lorsque le nombre de qubits est faible, ce nombre d'itérations peut ne pas être optimal.
ko_kr: 솔루션의 개수를 알고있는 경우 정적 메서드 ``optimal_num_iterations`` 를 사용하여 최적의 반복 횟수를 찾을 수도 있다. 출력된 반복 횟수는 대략적인(approximate) 값임에 주의하여야 한다. 큐비트 수가 적으면 출력된 값은 최적이 아닐 수도 있다.
ru: Если число решений известно, можно также использовать метод ``optimal_num_iterations`` для поиска оптимального количества итераций. Обратите внимание, что выводимое значение является приблизительным. Для малого числа кубитов оно может быть неподходящим.
ta_in: தீர்வுகளின் எண்ணிக்கை அறியப்படும்போது, மறு செய்கைகளின் உகந்த எண்ணிக்கையைக் கண்டறிய நிலையான முறையான ``optimal_num_iterations`` ஐப் பயன்படுத்தலாம். வெளியீட்டு மறு செய்கைகள் தோராயமான மதிப்பு என்பதை நினைவில் கொள்க. குயூபிட்டுகளின் எண்ணிக்கை சிறியதாக இருக்கும்போது, வெளியீட்டு மறு செய்கைகள் உகந்ததாக இருக்காது.
te: పరిష్కారాల సంఖ్య తెలిసినప్పుడు, మేము పునరావృతాల యొక్క సరైన సంఖ్యను కనుగొనడానికి స్టాటిక్ పద్ధతి ``optimal_num_iterations``ని కూడా ఉపయోగించవచ్చు. అవుట్‌పుట్ పునరావృత్తులు సుమారుగా విలువ అని గమనించండి. క్విట్‌ల సంఖ్య తక్కువగా ఉన్నప్పుడు, అవుట్‌పుట్ పునరావృత్తులు సరైనవి కాకపోవచ్చు.
tr_tr: Çözüm sayısı bilindiğinde, ideal iterasyon sayısını bulmak için bir statik metod ``optimal_num_iterations`` kullanabiliriz. Çıktı iterasyonlarının yaklaşık bir değer olduğunu unutmayın. Kübitlerin sayısı küçük olduğunda, çıktı iterasyonları ideal olmayabilir.

source: Applying ``post_processing``
bn_bn: ``post_processing`` এর ব্যাবহার
fr_fr: Application du ``post_processing``
ko_kr: ``post_processing`` 적용하기
ru: Применение ``post_processing``
ta_in: ``post_processing`` பயன்பாடு
te: ``పోస్ట్_ప్రాసెసింగ్``ని వర్తింపజేస్తోంది
tr_tr: ``post_processing`` uygulama

source: We can apply an optional post processing to the top measurement for ease of readability. It can be used e.g. to convert from the bit-representation of the measurement ``[1, 0, 1]`` to a DIMACS CNF format ``[1, -2, 3]``.
bn_bn: সহজে পড়ার জন্য আমরা সর্বশেষ মেজারমেন্টে একটি ঐচ্ছিক পোস্ট প্রসেসিং প্রয়োগ করতে পারি। এটা ব্যাবহ্রিত হতে পারে, যেমন: মেজারমেন্টের বিট-রিপ্রেজেন্টেশন ``[1, 0, 1]`` থেকে একটি DIMACS CNF রুপী ``[1, -2, 3]``।
fr_fr: Nous pouvons appliquer un post-traitement optionnel à la mesure la plus courante pour faciliter la lecture. Ce post-traitement peut être utilisé, par exemple, pour convertir la représentation binaire de la mesure ``[ 1, 0, 1 ]`` à un format DIMACS CNF ``[ 1, -2, 3 ]``.
ko_kr: 가독성을 높이기 위해 상단 측정에 선택적 후처리를 적용할 수 있다. 이는 예를 들어 측정된 ``[1, 0, 1]`` 의 비트 표현 형식으로부터 DIMACS CNF 형식의 ``[1, -2, 3]`` 으로 변환하는 데 사용될 수 있다.
ru: Для удобства иногда применяется дополнительная обработка результатов. Например, можно преобразовать побитовое представление ``[1, 0, 1]`` в формат DIMACS CNF ``[1, -2, 3]``.
ta_in: வாசிப்பு எளிமைக்கு மேல் அளவீட்டுக்கு விருப்பமான இடுகை செயலாக்கத்தை நாங்கள் பயன்படுத்தலாம். இதைப் பயன்படுத்தலாம் எ.கா. அளவீட்டின் பிட்-பிரதிநிதித்துவத்திலிருந்து ``[1, 0, 1]`` DIMACS CNF வடிவத்திற்கு மாற்ற ``[1, -2, 3]``.
tr_tr: En üst ölçüme okuma kolaylığı için isteğe bağlı bir rötuş uygulayabiliriz. Örneğin, ölçümün bit gösteriminden ``[1, 0, 1]`` DIMACS CNF formatına ``[1, -2, 3]`` dönüştürülmesi için kullanılabilir.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/06_grover.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/06_grover.ipynb>`_.
ta_in: `IBM குவாண்டம் ஆய்வகத்தில் `<https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/07_grover.ipynb>`இல் இயங்குநிலை தொடர்பாக இயக்கவும்.

source: Which we observe that this oracle implements a phase flip when the state is :math:`|11\rangle`
fr_fr: Nous observons que cet oracle implémente une inversion de phase pour l'état :math:`|11\rangle `
ko_kr: 이는 상태가 :math:`|11\rangle` 일 때 오라클이 위상을 반전시키는 것을 관측한다.
pl: Obserwujemy, że ta wyrocznia implementuje odwrócenie fazy, gdy stan to :math:`|11\rangle`
ru: Как мы можем увидеть, оракул переключает фазу для состояния :math:`|11\rangle`
te: స్టేట్ :math:`|11\rangle` అయినప్పుడు ఈ ఒరాకిల్ ఫేస్ ఫ్లిప్‌ను అమలు చేస్తుందని గమనించవచ్చు

source: As mentioned above, Grover’s algorithm requires a *phase-flip* oracle. A bit-flip oracle flips the state of an auxiliary qubit if the other qubits satisfy the condition. To use these types of oracles with Grover’s we need to convert the bit-flip oracle to a phase-flip oracle by sandwiching the auxiliary qubit of the bit-flip oracle by :math:`X` and :math:`H` gates.
fr_fr: Comme mentionné ci-dessus, l'algorithme de Grover nécessite un oracle *de phase* . Un oracle de bit-flip change l'état d'un qubit auxiliaire si les autres qubits satisfont à la condition. Pour utiliser ces types d'oracles avec Grover's nous avons besoin de convertir l'oracle de bit-flip à un oracle de phase-flip oracle en prenant en sandwich le qubit auxiliaire de l'oracle de bt-fliip par des portes :math:`X` et :math:`H`.
ko_kr: 앞서 언급한 대로, Grover 알고리즘은 *위상-반전* 오라클을 필요로 한다. 비트-반전 오라클은 다른 큐비트들이 조건을 충족하면 보조 큐비트의 상태를 반전시킨다. Grover 알고리즘에서 이러한 유형의 오라클들을 사용하려면 비트-반전 오라클을 :math:`X` 와 :math:`H` 게이트로 샌드위치처럼 감쌈으로써 비트-반전 오라클을 위상-반전 오라클로 바꿀 필요가 있다.
ru: Как уже упоминалось ранее, алгоритму Гровера нужно *переключить фазу*. Другой вариант связан с переключением бита и изменяет состояние вспомогательного кубита, если все остальные удовлетворяют заданному условию. Но тогда в алгоритме Гровера нужно дополнительно окружить оператор переключения бита вентилями :math:`X` и :math:`H`, что даст по сути как раз переключение фазы.

source: A ``state_preparation`` argument is used to specify a quantum circuit that prepares a quantum state for the start point of the amplitude amplification. By default, a circuit with :math:`H^{\otimes n}` is used to prepare uniform superposition (so it will be Grover’s search). The diffusion circuit of the amplitude amplification reflects ``state_preparation`` automatically.
fr_fr: Un argument ``state_preparation`` est utilisé pour spécifier un circuit quantique préparant un état quantique pour le point de départ de l'amplification de l'amplitude. Par défaut, un circuit avec :math:`H^{\otimes n}` est utilisé pour préparer une superposition uniforme (ce sera donc l'algorithme de Grover). Le circuit de diffusion de l'amplification d'amplitude est généré automatiquement par ``state_preparation``.
ko_kr: ``state_preparation`` 인자는 진폭 증폭의 시작점인 양자 상태를 준비하는 양자 회로를 명시하기 위해 사용된다. 기본적으로 :math:`H^{\otimes n}` 을 포함한 회로는 (Grover의 검색을 위한) 균일한 중첩 상태를 준비하기 위해 사용된다. 진폭 증폭의 확산 (diffusion) 회로는 자동으로 ``state_preparation`` 를 반영한다.
ru: Аргумент ``state_preparation`` используется для уточнения начальных условий в квантовой цепи, создающей определенное состояние. По умолчанию схема с :math:`H^{\otimes n}` подготавливает равномерную суперпозицию (для последующего поиска Гровера). Концепция усиления амплитуды автоматически отражает ``state_preparation``.

source: Grover's Algorithm and Amplitude Amplification
pl: Algorytm Grovera i wzmacnianie amplitudy
te: గ్రోవర్స్ అల్గోరిథం మరియు యాంప్లిట్యూడ్ యాంప్లిఫికేషన్

source: Grover's algorithm is one of the most famous quantum algorithms introduced by Lov Grover in 1996 [1]. It has initially been proposed for unstructured search problems, i.e. for finding a marked element in a unstructured database. However, Grover's algorithm is now a subroutine to several other algorithms, such as Grover Adaptive Search [2]. For the details of Grover's algorithm, please see `Grover's Algorithm <https://qiskit.org/textbook/ch-algorithms/grover.html>`__ in the Qiskit textbook.
pl: Algorytm Grovera, przedstawiony w 1996 roku przez Lova Grovera [1], jest jednym z najbardziej znanych algorytmów kwantowych. Początkowo miał on znaleźć zastosowanie w rozwiązywaniu problemów wyszukiwania niestrukturalnego, tj. znalezienia oznaczonego elementu w niestrukturalnej bazie danych. Jednak algorytm Grovera jest teraz podprocedurą do kilku innych algorytmów, takich jak wyszukiwanie adaptacyjne Grovera (ang. Grover Adaptive Search) [2]. Aby dowiedzieć się więcej na temat algorytmu Grovera, zapoznaj się z sekcją ` Algorytm Grovera <https://qiskit.org/textbook/ch-algorithms/grover.html>` __ w podręczniku Qiskit.
te: 1996లో లోవ్ గ్రోవర్ ప్రవేశపెట్టిన అత్యంత ప్రసిద్ధ క్వాంటం అల్గారిథమ్‌లలో గ్రోవర్స్ అల్గోరిథం ఒకటి [1]. ఇది ప్రారంభంలో నిర్మాణాత్మక శోధన సమస్యల కోసం ప్రతిపాదించబడింది, అనగా నిర్మాణాత్మక డేటాబేస్లో గుర్తించబడిన మూలకాన్ని కనుగొనడం కోసం. అయినప్పటికీ, గ్రోవర్స్ అల్గోరిథం ఇప్పుడు గ్రోవర్ అడాప్టివ్ సెర్చ్ [2] వంటి అనేక ఇతర అల్గారిథమ్‌లకు సబ్ రొటీన్ ఉంది. గ్రోవర్స్ అల్గారిథమ్ వివరాల కోసం, దయచేసి Qiskit పాఠ్యపుస్తకంలోని `గ్రోవర్స్ అల్గారిథమ్ <https://qiskit.org/textbook/ch-algorithms/grover.html>`__ని చూడండి.

source: Qiskit implements Grover's algorithm in the ``Grover`` class. This class also includes the generalized version, Amplitude Amplification [3], and allows setting individual iterations and other meta-settings to Grover's algorithm.
pl: Qiskit wdraża algorytm Grovera w klasie ` ` Grover ` ` `. Ta klasa obejmuje również uogólnioną wersję – wzmacnianie amplitudy [3], oraz umożliwia ustawianie indywidualnych iteracji i innych meta-ustawień dla algorytmu Grovera.
te: Qiskit గ్రోవర్స్ అల్గారిథమ్‌ను ``గ్రోవర్`` క్లాస్లో అమలు చేస్తుంది. ఈ క్లాస్ సాధారణీకరించిన సంస్కరణ, యాంప్లిట్యూడ్ యాంప్లిఫికేషన్ [3] ని కూడా కలిగి ఉంది మరియు గ్రోవర్స్ అల్గారిథమ్‌కు ఇండివిడ్యుఅల్ ఇట్రేషన్స్ మరియు ఇతర మెటా-సెట్టింగ్‌లను సెట్ చేయడానికి అనుమతిస్తుంది.

source: Grover's algorithm
pl: Algorytm Grovera
te: గ్రోవర్స్ అల్గోరిథం

source: Grover's algorithm uses the Grover operator :math:`\mathcal{Q}` to amplify the amplitudes of the good states:
pl: Algorytm Grovera używa operatora Grover :math:`\mathcal{Q}` do wzmocnienia amplitud dobrych stanów:
te: గ్రోవర్స్ అల్గోరిథం గ్రోవర్ ఆపరేటర్ :math:`\mathcal{Q}`ని మంచి స్టేట్ల వ్యాప్తిని అంప్లిఫై చేయడానికి ఉపయోగిస్తుంది:

source: In a nutshell, Grover's algorithm applies different powers of :math:`\mathcal{Q}` and after each execution checks whether a good solution has been found.
pl: W skrócie, algorytm Grovera stosuje różne potęgi :math:`\mathcal{Q}` i po każdym wykonaniu sprawdza, czy zostało znalezione poprawne rozwiązanie.
te: క్లుప్తంగా, గ్రోవర్స్ అల్గోరిథం విభిన్న :math:`\mathcal{Q}` యొక్క ఘాతాంకాలని వర్తింపజేస్తుంది మరియు ప్రతి అమలు తర్వాత మంచి పరిష్కారం కనుగొనబడిందో లేదో తనిఖీ చేస్తుంది.

source: Running Grover's algorithm
pl: Uruchamianie algorytmu Grovera
te: గ్రోవర్స్ అల్గోరిథంను అమలు చేయడం

source: To run Grover's algorithm with the ``Grover`` class, firstly, we need to specify an oracle for the circuit of Grover's algorithm. In the following example, we use ``QuantumCircuit`` as the oracle of Grover's algorithm. However, there are several other class that we can use as the oracle of Grover's algorithm. We talk about them later in this tutorial.
pl: Aby uruchomić algorytm Grovera z klasą ``Grover``, po pierwsze musimy określić wyrocznię dla obwodu algorytmu Grovera. W poniższym przykładzie użyjemy ``QuantumCircuit`` jako wyroczni algorytmu Grovera. Istnieje jednak kilka innych klas, które możemy wykorzystać jako wyrocznie algorytmu Grovera. Mówimy o nich w dalszej części tego kursu.
te: గ్రోవర్స్ అల్గారిథమ్‌ను ``Grover`` క్లాస్‌తో రన్ చేయడానికి, ముందుగా, గ్రోవర్ అల్గారిథమ్ సర్క్యూట్ కోసం మనం ఒరాకిల్‌ను పేర్కొనాలి. కింది ఉదాహరణలో, మనము గ్రోవర్ యొక్క అల్గోరిథం యొక్క ఒరాకిల్‌గా ``QuantumCircuit``ని ఉపయోగిస్తాము. అయినప్పటికీ, గ్రోవర్స్ అల్గోరిథం యొక్క ఒరాకిల్‌గా మనం ఉపయోగించగల అనేక ఇతర క్లాస్లు ఉన్నాయి. మనము ఈ ట్యుటోరియల్‌లో వాటి గురించి తరువాత మాట్లాడుతాము.

source: Note that the oracle for ``Grover`` must be a *phase-flip* oracle. That is, it multiplies the amplitudes of the of "good states" by a factor of :math:`-1`. We explain later how to convert a *bit-flip* oracle to a phase-flip oracle.
pl: Zauważ, że wyrocznią dla ` ` Grover ` ` musi być * phase-flip *. Mnoży ona amplitudy "dobrych stanów" przez współczynnik :math:` -1 `. Później wyjaśniamy, jak przekształcić wyrocznię * bit-flip * w wyrocznię zmiany fazy.
te: ``గ్రోవర్`` కోసం ఒరాకిల్ తప్పనిసరిగా *ఫేస్-ఫ్లిప్* ఒరాకిల్ అయి ఉంటుందని గమనించండి. అంటే, ఇది "మంచి స్థితుల" యొక్క వ్యాప్తిని :math:`-1` కారకంతో గుణిస్తుంది. *బిట్-ఫ్లిప్* ఒరాకిల్‌ను ఫేస్-ఫ్లిప్ ఒరాకిల్‌గా ఎలా మార్చాలో మేము తరువాత వివరిస్తాము.

source: If the search was successful, the ``oracle_evaluation`` attribute of the result will be ``True``. In this case, the most sampled measurement, ``top_measurement``, is one of the "good states". Otherwise, ``oracle_evaluation`` will be False.
pl: Jeśli wyszukiwanie zakończyło się pomyślnie, atrybut ``oracle_evaluation`` będzie miał wartość ``True``. W tym przypadku pomiar ``top_measurement``, w którym pobrano najwięcej próbek, jest jednym z "dobrych stanów". W przeciwnym razie ``oracle_evaluation`` będzie mieć wartość False.
te: శోధన విజయవంతమైతే, ఫలితం యొక్క ``oracle_evaluation`` లక్షణం ``నిజం`` అవుతుంది. ఈ సందర్భంలో, అత్యంత నమూనా కొలత, ``top_measurement``, "మంచి స్థితులలో" ఒకటి. లేదంటే, ``oracle_evaluation`` తప్పు అవుతుంది.

source: In the example, the result of ``top_measurement`` is ``11`` which is one of "good state". Thus, we succeeded to find the answer by using ``Grover``.
pl: W tym przykładzie wynikiem ``top_measurement`` jest ``11``, który jest jednym z „dobrych stanów”. W związku z tym udało nam się znaleźć odpowiedź używając ``Grover``.
te: ఉదాహరణలో, ``top_measurement`` ఫలితం ``11``, ఇది "మంచి స్థితి"లో ఒకటి. ఆ విధంగా, మేము ``గ్రోవర్``ని ఉపయోగించడం ద్వారా సమాధానాన్ని కనుగొనడంలో విజయం సాధించాము.

source: In the above example, we used ``QuantumCircuit`` as the oracle of ``Grover``. However, we can also use ``qiskit.quantum_info.Statevector`` as oracle. All the following examples are when :math:`|11\rangle` is "good state"
pl: W powyższym przykładzie użyliśmy ` ` QuantumCircuit ` ` jako wyroczni` ` Grover ` `. Jednak możemy również użyć ` `qiskit.quantum_info.Statevector ` ` jako wyroczni. Wszystkie przykłady mają zastosowanie, gdy :math:` | 11\rkąt ` jest „dobrym stanem”
te: పై ఉదాహరణలో, మేము ``గ్రోవర్`` యొక్క ఒరాకిల్‌గా ``QuantumCircuit``ని ఉపయోగించాము. అయినప్పటికీ, మనం ``qiskit.quantum_info.Statevector``ని ఒరాకిల్‌గా కూడా ఉపయోగించవచ్చు. కింది ఉదాహరణలన్నీ :math:`|11\rangle` "మంచి స్థితి" అయినప్పుడు

source: Here we'll use the ``PhaseOracle`` for the simple example of finding the state :math:`|11\rangle`, which corresponds to ``'a & b'``.
pl: Tutaj użyjemy ``PhaseOracle`` dla prostego przykładu znalezienia stanu :math:` | 11\rkąt `, który odpowiada ``'a & b'``.
te: ఇక్కడ మనం ``'a & b'``కి అనుగుణంగా ఉండే స్థితి :math:`|11\rangle`ని కనుగొనే సాధారణ ఉదాహరణ కోసం ``PhaseOracle``ని ఉపయోగిస్తాము.

source: As mentioned above, Grover's algorithm requires a *phase-flip* oracle. A bit-flip oracle flips the state of an auxiliary qubit if the other qubits satisfy the condition. To use these types of oracles with Grover's we need to convert the bit-flip oracle to a phase-flip oracle by sandwiching the auxiliary qubit of the bit-flip oracle by :math:`X` and :math:`H` gates.
pl: Jak wspomniano powyżej, algorytm Grovera wymaga wyroczni *phase-flip*. Wyrocznia powodująca odwrócenie bitu (ang. bit-flip), odwraca qubit pomocniczy, jeśli pozostałe qubity spełniają warunek. Aby użyć tego typu wyroczni z algorytmem Grovera, musimy przekształcić wyrocznię odwracającą bit na wyrocznię odwracającą fazę, poprzez włożenie qubitu pomocniczego wyroczni odwracającej bit między bramki :math:`X` i :math:`H`.
te: పైన పేర్కొన్నట్లుగా, గ్రోవర్ యొక్క అల్గారిథమ్‌కు *ఫేజ్-ఫ్లిప్* ఒరాకిల్ అవసరం. ఇతర క్విట్‌లు షరతును సంతృప్తిపరిచినట్లయితే, ఒక బిట్-ఫ్లిప్ ఒరాకిల్ సహాయక క్విట్ స్థితిని తిప్పుతుంది. గ్రోవర్స్‌తో ఈ రకమైన ఒరాకిల్‌లను ఉపయోగించడానికి మనం బిట్-ఫ్లిప్ ఒరాకిల్ యొక్క సహాయక క్విట్‌ను :math:`X` మరియు :math:`H` గేట్‌ల ద్వారా శాండ్‌విచ్ చేయడం ద్వారా ఫేజ్-ఫ్లిప్ ఒరాకిల్‌గా మార్చాలి.

source: Grover's algorithm uses Hadamard gates to create the uniform superposition of all the states at the beginning of the Grover operator :math:`\mathcal{Q}`. If some information on the good states is available, it might be useful to not start in a uniform superposition but only initialize specific states. This, generalized, version of Grover's algorithm is referred to *Amplitude Amplification*.
pl: Algorytm Grovera wykorzystuje bramki Hadamarda do tworzenia jednolitej superpozycji wszystkich stanów na początku operatora Grover :math:` \mathcal{Q}`. Jeśli dostępne są pewne informacje o dobrych stanach, być może warto nie zaczynać w jednolitej superpozycji, a jedynie zainicjalizować określone stany. Ta uogólniona wersja algorytmu Grovera jest określana jako *Wzmacnianie Amplitudy*.
te: గ్రోవర్ యొక్క అల్గోరిథం గ్రోవర్ ఆపరేటర్ :math:`\mathcal{Q}` ప్రారంభంలో అన్ని రాష్ట్రాల యొక్క ఏకరీతి సూపర్‌పొజిషన్‌ను సృష్టించడానికి హడమర్డ్ గేట్‌లను ఉపయోగిస్తుంది. మంచి స్థితులపై కొంత సమాచారం అందుబాటులో ఉన్నట్లయితే, ఏకరీతి సూపర్‌పొజిషన్‌లో ప్రారంభించకుండా నిర్దిష్ట స్థితులను మాత్రమే ప్రారంభించడం ఉపయోగకరంగా ఉండవచ్చు. ఇది సాధారణీకరించబడిన, గ్రోవర్ యొక్క అల్గోరిథం యొక్క సంస్కరణను *యాంప్లిట్యూడ్ యాంప్లిఫికేషన్*గా సూచిస్తారు.

source: A ``state_preparation`` argument is used to specify a quantum circuit that prepares a quantum state for the start point of the amplitude amplification. By default, a circuit with :math:`H^{\otimes n}` is used to prepare uniform superposition (so it will be Grover's search). The diffusion circuit of the amplitude amplification reflects ``state_preparation`` automatically.
pl: Argument ``state_preparation`` jest używany do określenia obwodu kwantowego, który przygotowuje stan kwantowy dla punktu początkowego amplitudy. Domyślnie układ z :math:`H^{\otimes n}` jest używany do przygotowania jednolitej superpozycji (więc będzie to wyszukiwanie Grovera). Obwód dyfuzyjny wzmocnienia amplitudy odzwierciedla ``state_preparation`` automatycznie.
te: యాంప్లిట్యూడ్ యాంప్లిఫికేషన్ యొక్క ప్రారంభ స్థానం కోసం క్వాంటం స్థితిని సిద్ధం చేసే క్వాంటం సర్క్యూట్‌ను పేర్కొనడానికి ``స్టేట్_ప్రిపరేషన్`` ఆర్గ్యుమెంట్ ఉపయోగించబడుతుంది. డిఫాల్ట్‌గా, ఏకరీతి సూపర్‌పొజిషన్‌ను సిద్ధం చేయడానికి :math:`H^{\otimes n}`తో సర్క్యూట్ ఉపయోగించబడుతుంది (కాబట్టి ఇది గ్రోవర్ యొక్క శోధన అవుతుంది). యాంప్లిట్యూడ్ యాంప్లిఫికేషన్ యొక్క డిఫ్యూజన్ సర్క్యూట్ ``స్టేట్_ప్రిపరేషన్``ని స్వయంచాలకంగా ప్రతిబింబిస్తుంది.
