Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/06_grover.po
Languages: bn_bn, es_un, fr_fr, ko_kr, pl, ru, ta_in, te, tr_tr

source: This page was generated from `tutorials/algorithms/06_grover.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/algorithms/08_factorizers.ipynb`__ - থেকে নেয়া হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/algorithms/06_grover.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/algorithms/06_grover.ipynb`__.
ko_kr: 이 페이지는 `tutorials/algorithms/06_grover.ipynb`__ 로부터 생성되었다.
pl: Ta strona została wygenerowana z `tutorials/algorithms/06_grover.ipynb`__.
ru: Эта страница была создана на основе `tutorials/algorithms/06_grover.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/algorithms/07_grover.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
te: ఈ పేజీ `tutorials/algorithms/06_grover.ipynb`__ నుండి రూపొందించబడింది.
tr_tr: Bu sayfa `tutorials/algorithms/06_grover.ipynb`__ adresinden oluşturulmuştur.

source: Grover’s Algorithm and Amplitude Amplification
bn_bn: গ্রোভার অ্যালগরিদম এবং বিস্তার বিবর্ধন
es_un: Algoritmo de Grover y Amplificación de Amplitud
fr_fr: Algorithme de Grover et Amplification d'Amplitude
ko_kr: 그로버 알고리즘과 진폭 증폭
ru: Алгоритм Гровера и Усиление Амплитуды
ta_in: க்ரோவரின் அல்காரிதம் மற்றும் அலைவீச்சு பெருக்கம்
tr_tr: Grover Algoritması ve Genlik Amplifikasyonu

source: Grover’s algorithm is one of the most famous quantum algorithms introduced by Lov Grover in 1996 [1]. It has initially been proposed for unstructured search problems, i.e. for finding a marked element in a unstructured database. However, Grover’s algorithm is now a subroutine to several other algorithms, such as Grover Adaptive Search [2]. For the details of Grover’s algorithm, please see `Grover’s Algorithm <https://qiskit.org/textbook/ch-algorithms/grover.html>`__ in the Qiskit textbook.
bn_bn: লোভ গ্রোভার দ্বারা ১৯৯৬ সালে বানানো গ্রোভার অ্যালগরিদম [1] হচ্ছে কোয়ান্টাম অ্যালগরিদমগুলি দের মধ্যে যুক্তিযুক্তভাবে সবচেয়ে বিখ্যাত। এটি প্রথমে কাঠামোগত অনুসন্ধান সমস্যার (একটি কাঠামোহীন ডাটাবেসে চিহ্নিত উপাদান বের করার জন্য) জন্যে উত্থাপন করা হয়েছিল। ইদানিং এটি একাধিক অ্যালগরিদম এর মধ্যে মিলিত। উদাহরণ মূলক গ্রোভার অভিযোজিত অনুসন্ধান (গ্রোভার অ্যাডাপ্টিভ সার্চ) [2]। এর উপরে আরো জানতে Qiskit নোটবুকে `গ্রোভার অ্যালগরিদম <https://qiskit.org/textbook/ch-algorithms/grover.html>`__ দেখুন।
es_un: El algoritmo de Grover es uno de los algoritmos cuánticos más famosos introducido por Lov Grover en 1996 [1]. Inicialmente se propuso para problemas de búsqueda no estructurados, es decir, para encontrar un elemento marcado en una base de datos no estructurada. Sin embargo, el algoritmo de Grover es ahora una subrutina de varios otros algoritmos, como Grover Adaptive Search [2]. Para obtener más información sobre el algoritmo de Grover, consulte `Grover’s Algorithm <https://qiskit.org/textbook/ch-algorithms/grover.html>`__ en el libro de texto de Qiskit.
fr_fr: L'algorithme de Grover est l'un des algorithmes quantiques les plus célèbres introduits par Lov Grover en 1996 [1]. Il a d'abord été proposé pour des problèmes de recherche non structurés, c'est-à-dire pour trouver un élément marqué dans une base de données non structurée. Cependant, l'algorithme de Grover est maintenant une sous-routine de plusieurs autres algorithmes, tels que Grover Adaptive Search [2]. Pour les détails de l'algorithme de Grover, veuillez consulter `Grover's Algorithm <https://qiskit.org/textbook/ch-algorithms/grover.html>`__ dans le manuel Qiskit.
ko_kr: Grover 알고리즘은 1996년[1]에 Lov Grover가 도입한 가장 유명한 양자 알고리즘들 중 하나이다. 구조화되지 않은 데이터베이스에서 표시된 요소를 찾는, 구조화되지 않은 검색 문제들에 대해 처음 제안되었다. 하지만 Grover 알고리즘은 이제 Grover 적응 탐색 (Grover Adaptive Search)[2]과 같은 여러 다른 알고리즘들의 서브루틴이다. Grover 알고리즘에 대한 자세한 내용은 Qiskit 교재에서 `Grover 알고리즘 <https://qiskit.org/textbook/ch-algorithms/grover.html>`__ 을 참조하기 바란다.
ru: Алгоритм Гровера — один из самых известных квантовых алгоритмов, впервые предложенный Ловом Гровером в 1996 году [1]. Изначально он был предложен для решения задач неструктурированного поиска, то есть для нахождения помеченного элемента в неструктурированной базе данных. Однако в настоящее время алгоритм Гровера является подпрограммой нескольких других алгоритмов, таких как адаптивный поиск Гровера [2]. Подробности алгоритма Гровера смотрите в разделе `Алгоритм Гровера <https://qiskit.org/textbook/ch-algorithms/grover.html>`__ в учебнике по Qiskit.
ta_in: க்ரோவரின் வழிமுறை 1996 இல் லோவ் க்ரோவர் அறிமுகப்படுத்திய மிகவும் பிரபலமான குவாண்டம் வழிமுறைகளில் ஒன்றாகும் [1]. இது ஆரம்பத்தில் கட்டமைக்கப்படாத தேடல் சிக்கல்களுக்கு முன்மொழியப்பட்டது, அதாவது கட்டமைக்கப்படாத தரவுத்தளத்தில் குறிக்கப்பட்ட உறுப்பைக் கண்டுபிடிப்பதற்காக. இருப்பினும், க்ரோவரின் வழிமுறை இப்போது க்ரோவர் தகவமைப்பு தேடல் [2] போன்ற பல வழிமுறைகளுக்கு ஒரு சப்ரூட்டீன் ஆகும். க்ரோவரின் வழிமுறையின் விவரங்களுக்கு, Qiskit பாடப்புத்தகத்தில் `Grover’s Algorithm <https://qiskit.org/textbook/ch-algorithms/grover.html>`__ ஐப் பார்க்கவும்.
tr_tr: Grover algoritması, 1996 yılında Lov Grover tarafından tanıtılan en ünlü kuantum algoritmalarından biridir [1]. Başlangıçta yapılandırılmamış arama problemleri için, yani yapılandırılmamış bir veritabanında işaretli bir öğe bulmak için önerilmiştir. Bununla birlikte, Grover'ın algoritması artık Grover Adaptive Search [2] gibi diğer birçok algoritmanın bir alt rutinidir. Grover'ın algoritmasının ayrıntıları için lütfen Qiskit ders kitabında `Grover’s Algorithm <https://qiskit.org/textbook/ch-algorithms/grover.html>`__ bölümüne bakın.

source: Qiskit implements Grover’s algorithm in the ``Grover`` class. This class also includes the generalized version, Amplitude Amplification [3], and allows setting individual iterations and other meta-settings to Grover’s algorithm.
bn_bn: Qiskit গ্রভারের অ্যালগরিদমকে ``Grover`` শ্রেণিতে সম্পাদন করে। এই শ্রেণিতে সাধারণকৃত সংস্করণ, বিস্তার পরিবর্ধন [3] অন্তর্ভুক্ত রয়েছে, এবং এটি গ্রোভারের অ্যালগরিদমে পৃথক পুনরাবৃত্তি এবং অন্যান্য মেটা-সেটিংস সেট করার অনুমতি দেয়।
es_un: Qiskit implementa el algoritmo de Grover en la clase ``Grover``. Esta clase también incluye la versión generalizada, Amplificación de Amplitud [3], y permite configurar iteraciones individuales y otros meta-ajustes para el algoritmo de Grover.
fr_fr: Qiskit implémente l'algorithme de Grover dans la classe ``Grover``. Cette classe inclut également la version généralisée, Amplitude Amplification [3], et permet de définir des itérations individuelles et d'autres méta-paramètres à l'algorithme de Grover.
ko_kr: Qiskit은 ``Grover`` 클래스에서 Grover의 알고리즘을 구현한다. 이 클래스에는 일반화된 버전인 진폭 증폭 [3] 이 포함되며, 개별 반복 및 기타 메타 설정을 Grover의 알고리즘으로 설정할 수 있다.
ru: Qiskit реализует алгоритм Гровера в классе ``Grover``. Этот класс также включает в себя обобщенную версию, Усиление Амплитуды [3], и позволяет задавать индивидуальные итерации и другие мета-настройки алгоритму Гровера.
ta_in: Qiskit க்ரோவரின் வழிமுறையை ``Grover`` வகுப்பில் செயல்படுத்துகிறது. இந்த வகுப்பில் பொதுவான பதிப்பு, அலைவீச்சு பெருக்கம் [3] ஆகியவை அடங்கும், மேலும் க்ரோவரின் வழிமுறைக்கு தனிப்பட்ட மறு செய்கைகள் மற்றும் பிற மெட்டா அமைப்புகளை அமைக்க அனுமதிக்கிறது.
tr_tr: Qiskit, Grover'ın algoritmasını ``Grover`` sınıfında uygular. Bu sınıf ayrıca genelleştirilmiş bir sürüm olan Genlik Amplifikasyonunu [3] içerir ve bireysel yinelemelerin ve diğer meta-ayarların Grover'ın algoritmasına ayarlanmasına izin verir.

source: **References:**
bn_bn: **রেফারেন্স সমূহ:**
es_un: **Referencias:**
fr_fr: **Références :**
ko_kr: **참조:**
pl: **Źródła:**
ru: **Ссылки:**
te: **ప్రస్తావనలు:**
tr_tr: **Referanslar:**

source: [1]: L. K. Grover, A fast quantum mechanical algorithm for database search. Proceedings 28th Annual Symposium on the Theory of Computing (STOC) 1996, pp. 212-219. https://arxiv.org/abs/quant-ph/9605043
bn_bn: [1]: L. K. Grover, ডাটাবেস অনুসন্ধানের জন্য একটি দ্রুত কোয়ান্টাম মেকানিকাল অ্যালগরিদম। থিউরি অফ কম্পিউটিংয়ের ২৮ তম বার্ষিক সিম্পোজিয়ামের ক্রিয়াকলাপ (STOC) ১৯৯৬, pp. 212-219. https://arxiv.org/abs/quant-ph/9605043
ta_in: [1]: எல். கே. க்ரோவர், தரவுத்தள தேடலுக்கான வேகமான குவாண்டம் இயந்திர வழிமுறை. செயல்முறைகள் 28 வது வருடாந்திர சிம்போசியம் ஆஃப் தியரி ஆஃப் கம்ப்யூட்டிங் (STOC) 1996, pp. 212-219. https://arxiv.org/abs/quant-ph/9605043
tr_tr: [1]: L. K. Grover, Veritabanı araması için hızlı bir kuantum mekanik algoritması. Bildiriler 28. Yıllık Bilgisayar Teorisi Sempozyumu (STOC) 1996, s. 212-219. https://arxiv.org/abs/quant-ph/9605043

source: [2]: A. Gilliam, S. Woerner, C. Gonciulea, Grover Adaptive Search for Constrained Polynomial Binary Optimization. https://arxiv.org/abs/1912.04088
bn_bn: [2]: A. Gilliam, S. Woerner, C. Gonciulea, গ্রোভার অ্যাডাপটিভ সার্চ ফর কনস্ট্রেনেড পলিনোমিয়াল বাইনারি অপটিমাইজেশন, https://arxiv.org/abs/1912.04088
ta_in: [2]: ஏ. கில்லியம், எஸ். வோர்னர், சி. கோன்சியுலியா, கட்டுப்படுத்தப்பட்ட பல்லுறுப்புறுப்பு பைனரி உகப்பாக்கலுக்கான குரோவர் தகவமைப்பு தேடல். https://arxiv.org/abs/1912.04088
tr_tr: [2]: A. Gilliam, S. Woerner, C. Gonciulea, Kısıtlı Polinom İkili Optimizasyon için Grover Uyarlamalı Arama. https://arxiv.org/abs/1912.04088

source: [3]: Brassard, G., Hoyer, P., Mosca, M., & Tapp, A. (2000). Quantum Amplitude Amplification and Estimation. http://arxiv.org/abs/quant-ph/0005055
bn_bn: [3]: Brassard, G., Hoyer, P., Mosca, M., & Tapp, A. (২০০০). কোয়ান্টাম বিস্তার পরিবর্ধন এবং অনুমান। http://arxiv.org/abs/quant-ph/0005055
pl: [3]: Brassard, G., Hoyer, P., Mosca, M., & Tapp, A. Quantum Amplitude Amplification and Estimation. 2000. (http://arxiv.org/abs/quant-ph/0005055)
ta_in: [3]: பிராஸார்ட், ஜி., ஹோயர், பி., மோஸ்கா, எம்., & டாப், ஏ. (2000). குவாண்டம் அலைவீச்சு பெருக்கம் மற்றும் மதிப்பீடு. http://arxiv.org/abs/quant-ph/0005055
tr_tr: [3]: Brassard, G., Hoyer, P., Mosca, M., & Tapp, A. (2000). Kuantum Genlik Amplifikasyonu ve Tahmini. http://arxiv.org/abs/quant-ph/0005055

source: Grover’s algorithm
bn_bn: গ্রোভার অ্যালগরিদম / ধরাক্রম
es_un: Algoritmo de Grover
fr_fr: Algorithme de Grover
ko_kr: 그로버 알고리즘
ru: Алгоритм Гровера
ta_in: க்ரோவரின் வழிமுறை
tr_tr: Grover'ın algoritması

source: Grover’s algorithm uses the Grover operator :math:`\mathcal{Q}` to amplify the amplitudes of the good states:
bn_bn: গ্রোভারের অ্যালগরিদম বিস্তার পরিবর্ধন করতে :math:`\mathcal{Q}` অপারেটরটি ব্যাবহার করে:
es_un: El algoritmo de Grover utiliza el operador de Grover :math:`\mathcal{Q}` para amplificar las amplitudes de los estados correctos:
fr_fr: L'algorithme de Grover utilise l'opérateur Grover :math:`\mathcal{Q}` pour amplifier les amplitudes des bons états :
ko_kr: 그로버 알고리즘은 그로버 연산자 :math:`\mathcal{Q}` 를 사용해서 좋은 상태들의 진폭을 증폭시킨다.
ru: Алгоритм Гровера использует оператор :math:`\mathcal{Q}` для усиления амплитуды "хороших" состояний:
ta_in: குரோவரின் வழிமுறை குரோவர் ஆபரேட்டர் :math:`\mathcal{Q}` பயன்படுத்தி நல்ல நிலைகளின் பெருக்கங்களைப் பெருக்கும்:
tr_tr: Grover'ın algoritması, iyi durumların genliklerini yükseltmek için Grover operatörünü :math:`\mathcal{Q}` kullanır:

source: Here, \* :math:`\mathcal{A}` is the initial search state for the algorithm, which is just Hadamards, :math:`H^{\otimes n}` for the textbook Grover search, but can be more elaborate for Amplitude Amplification \* :math:`\mathcal{S_0}` is the reflection about the all 0 state
bn_bn: এখানে, \* :math:`\mathcal{A}` হল অ্যালগরিদমটির প্রাথমিক অনুসন্ধানপূর্বক অবস্থা, যেটা কেবল গ্রোভার অনুসন্ধানের জন্য Hadamard গেটসমুহ :math:`H^{\otimes n}` , কিন্তু বিস্তার পরিবর্ধনের জন্য বিস্তারযোগ্য, :math:`\mathcal{S_0}` হল সবগুলো 0 অবস্থার প্রতিফলন।
es_un: Aquí, \* :math:`\mathcal{A}` es el estado de búsqueda inicial para el algoritmo, que es solo Hadamards, :math:`H^{\otimes n}` para la búsqueda de Grover del libro de texto, pero puede ser más elaborado para la Amplificación de Amplitud \* :math:`\mathcal{S_0}` es la reflexión sobre todo el estado 0
fr_fr: Ici, \ * :math:` \mathcal{A}` est l'état de recherche initial de l'algorithme, qui est juste un état de superposition de tous les qubits d'entrée obtenu par :math:`H ^ {\otimes n}` pour la recherche de Grover générale, mais peut être plus élaboré pour l'amplification d'amplitude \ * :math:` \mathcal{S_0}` est la réflexion par rapport à l'état où tous les qubits sont à l'état 0
ko_kr: 여기서, \* :math:`\mathcal{A}` 는 알고리즘의 초기 탐색 상태이며, 이는 하다마드 (Hadamards), 그로버(Grover) 검색 교과서의 경우 :math:`H^{\otimes n}` 로도 나타낼 수 있지만 이와 같이 표시할 경우 모든 큐비트가 0인 상태를 나타내는 진폭 증폭 (Amplitude Amplification) \* :math:`\mathcal{S_0}` 에 대해 더 자세히 설명할 수 있다.
pl: W tym przypadku, \* :math:`\mathcal{A}` jest początkowym stanem wyszukiwania algorytmu, który jest po prostu transformatą Hadamarda :math:`H^{\otimes n}` dla algorytmu Grovera, ale może być bardziej szczegółowy dla wzmacniania amplitudy \*:math:`\mathcal{S_0}` jest odbiciem wszystkich stanów 0
ru: Здесь \* :math:`\mathcal{A}` — это начальное состояние для поиска в алгоритме, которое просто создается применением оператора Адамара :math:`H^{\otimes n}` ко всем кубитам (учебный пример для поиска Гровера), но также может быть задано более подробно для Усиления Амплитуды \* :math:`\mathcal{S_0}` — это отображение для всех нулевых состояний
ta_in: இங்கே, * A என்பது வழிமுறையின் ஆரம்ப தேடல் நிலை, இது வெறும் ஹடமார்ட்ஸ், H⊗n க்ரோவர் தேடலுக்கான பாடநூல், ஆனால் அலைவீச்சு பெருக்கத்திற்கு இன்னும் விரிவாக இருக்கலாம் * S0 என்பது அனைத்து 0 நிலைகளையும் பற்றிய பிரதிபலிப்பாகும்
te: ఇక్కడ, \* :math:`\mathcal{A}` అనేది అల్గోరిథం కోసం ప్రారంభ శోధన స్టేట్, ఇది కేవలం Hadamards, :math:`H^{\otimes n}` పాఠ్యపుస్తకం గ్రోవర్ శోధన కోసం, కానీ మరింత ఉండవచ్చు యాంప్లిట్యూడ్ యాంప్లిఫికేషన్ కోసం విశదీకరించు \* :math:`\mathcal{S_0}` అనేది మొత్తం 0 స్థితికి సంబంధించిన ప్రతిబింబం
tr_tr: Burada, \* :math:`\mathcal{A}`, Grover arama ders kitabı için yalnızca Hadamardlar, :math:`H^{\otimes n}` olan algoritmanın ilk arama durumudur, ancak daha fazlası olabilir Genlik Amplifikasyonu için ayrıntılı \* :math:`\mathcal{S_0}` tümü 0 durumunun yansımasıdır

source: \* :math:`\mathcal{S_f}` is the oracle that applies
bn_bn: \* :math:`\mathcal{S_f}` ওরাকলটি প্রয়োগ করে,
es_un: \* :math:`\mathcal{S_f}` es el oráculo que se aplica
fr_fr: \*:math:`\mathcal{S_f}` est l'oracle qui s'applique
ko_kr: \* :math:`\mathcal{S_f}` 는 적용되는 오라클이며
pl: stosuje się wyrocznię \* :math:`\mathcal{S_f}`
ru: \* :math:`\mathcal{S_f}` это оракул, который реализует
ta_in: \* :math:`\mathcal{S_f}` என்பது பொருந்தும் ஆரக்கிள்
te: \* :math:`\mathcal{S_f}` అనేది వర్తించే ఒరాకిల్
tr_tr: \* :math:`\mathcal{S_f}` geçerli olan ayrıcalıktır

source: where :math:`f(x)` is 1 if :math:`x` is a good state and otherwise 0.
bn_bn: যেখানে :math:`f(x)` হল 1 যদি :math:`x` একটি সুষম অবস্থা হয়, আর তা নাহলে 0.
es_un: donde :math:`f(x)` es 1 si :math:`x` es un estado correcto y de lo contrario 0.
fr_fr: où :math:`f (x)` vaut 1 si :math:`x` est un état recherché et sinon 0.
ko_kr: 여기서 :math:`x` 가 바람직한 상태일 때, :math:`f(x)` 는 1이고, 그렇지 않으면 0이다.
pl: gdzie :math:` f (x) ` jest 1, jeśli :math:` x ` jest dobrym stanem, a w przeciwnym razie: 0.
ru: где :math:`f(x)` равно 1, если :math:`x` - хорошее состояние, и 0 в противном случае.
ta_in: :math:`x` ஒரு நல்ல நிலை என்றால், :math:`f(x)` என்பது 1, இல்லையெனில் 0.
te: ఇక్కడ :math:`x` మంచి స్టేట్ అయితే :math:`f(x)` 1 లేదా 0.
tr_tr: burada :math:`f(x)` 1 ise :math:`x` yararlı bir durumdur ve aksi takdirde 0'dır.

source: In a nutshell, Grover’s algorithm applies different powers of :math:`\mathcal{Q}` and after each execution checks whether a good solution has been found.
bn_bn: সংক্ষেপে, গ্রোভারের অ্যালগরিদম :math:`\mathcal{Q}` বিভিন্ন সূচক প্রয়োগ করে এবং প্রতিটি সম্পাদন কার্যকর করার পরে একটি ভাল সমাধান পাওয়া গেছে কিনা তা পরীক্ষা করে।
fr_fr: En un mot, l'algorithme de Grover applique différentes puissances de :math:`\mathcal{Q}` et après chaque exécution vérifie si une bonne solution a été trouvée.
ko_kr: 간단히 말해서, 그로버 알고리즘은 :math:`\mathcal{Q}` 를 다양한 지수(power)로 적용하여 실행한 후, 각 실행에서 좋은 솔루션이 있는지를 확인한다.
ru: Проще говоря, алгоритм Гровера применяет различные степени :math:`\mathcal{Q}` и после каждого выполнения проверяет, было ли найдено правильное решение.
ta_in: சுருக்கமாக, க்ரோவரின் வழிமுறை :math:`\mathcal{Q}` இன் வெவ்வேறு சக்திகளைப் பயன்படுத்துகிறது மற்றும் ஒவ்வொரு செயல்படுத்தல் முடிந்தபின்னும் ஒரு நல்ல தீர்வு காணப்பட்டதா என்பதை சரிபார்க்கிறது.
tr_tr: Özetle, Grover'ın algoritması farklı :math:`\mathcal{Q}` yetkilerini uygular ve her yürütmeden sonra iyi bir çözüm bulunup bulunmadığını kontrol eder.

source: Running Grover’s algorithm
bn_bn: গ্রোভারের অ্যালগরিদম চালানো
es_un: Ejecutar el algoritmo de Grover
fr_fr: Exécution de l'algorithme de Grover
ko_kr: 그로버 알고리즘 실행하기
ru: Выполнение алгоритма Гровера
ta_in: க்ரோவரின் வழிமுறை இயங்குகிறது
tr_tr: Grover'ın algoritmasını çalıştırma

source: To run Grover’s algorithm with the ``Grover`` class, firstly, we need to specify an oracle for the circuit of Grover’s algorithm. In the following example, we use ``QuantumCircuit`` as the oracle of Grover’s algorithm. However, there are several other class that we can use as the oracle of Grover’s algorithm. We talk about them later in this tutorial.
bn_bn: গ্রোভারের অ্যালগরিদমকে ``Grover`` শ্রেণীর সাথে চালাতে প্রথমে আমাদের গ্রোভারের অ্যালগরিদমের সার্কিটের জন্য একটি ওরাকল নির্ধারণ করতে হবে। নিম্নলিখিত উদাহরণে, আমরা গ্রোভারের অ্যালগরিদমের ওরাকল হিসাবে ``QuantumCircuit`` ব্যবহার করেছি। তবে, আরও কয়েকটি শ্রেণি রয়েছে যেগুলো আমরা গ্রোভারের অ্যালগরিদমের ওরাকল হিসাবে ব্যবহার করতে পারি। আমরা সেগুলো সম্পর্কে এই টিউটোরিয়ালের শেষেরদিকে আলোচনা করব।
es_un: Para ejecutar el algoritmo de Grover con la clase ``Grover``, en primer lugar, necesitamos especificar un oráculo para el circuito del algoritmo de Grover. En el siguiente ejemplo, usamos ``QuantumCircuit`` como el oráculo del algoritmo de Grover. Sin embargo, hay varias otras clases que podemos usar como oráculo del algoritmo de Grover. Hablamos de ellos más adelante en este tutorial.
fr_fr: Pour exécuter l'algorithme de Grover à l'aide de la classe ``Grover``, premièrement, nous devons spécifier un oracle. Dans l'exemple suivant, nous utilisons une instance de la classe ``QuantumCircuit`` comme oracle de l'algorithme de Grover. Cependant, il existe plusieurs autres classes que nous pouvons utiliser comme oracle. Nous en parlons plus loin dans ce tutoriel.
ko_kr: 그로버 알고리즘을 ``Grover`` 클래스로 실행하려면 먼저 그로버 알고리즘 회로에 오라클을 지정해야 한다. 다음 예에서 우리는 ``QuantumCircuit`` 을 그로버 알고리즘의 오라클로 사용한다. 하지만, 그로버 알고리즘의 오라클로 사용할 수 있는 몇 가지 다른 클래스가 있다. 이들에 대해 우리는 이 사용 지침서의 뒷부분에서 이야기한다.
ru: Чтобы запустить алгоритм Гровера с помощью класса ``Grover``, сначала нужно указать оракул для квантовой цепи алгоритма Гровера. В приведенном ниже примере в качестве оракула алгоритма Гровера мы используем ``QuantumCircuit``. Однако есть еще целый ряд других классов, которые мы можем использовать в качестве оракула алгоритма Гровера. Мы поговорим о них чуть позже в этом руководстве.
ta_in: க்ரோவரின் வழிமுறையை ``Grover`` வகுப்போடு இயக்க, முதலில், க்ரோவரின் வழிமுறையின் சுற்றுக்கு ஒரு ஆரக்கிளைக் குறிப்பிட வேண்டும். பின்வரும் எடுத்துக்காட்டில், க்ரோவரின் வழிமுறையின் ஆரக்கிளாக ``QuantumCircuit`` ஐப் பயன்படுத்துகிறோம். இருப்பினும், க்ரோவரின் வழிமுறையின் ஆரக்கிளாக நாம் பயன்படுத்தக்கூடிய பல வகுப்புகள் உள்ளன. இந்த டுடோரியலில் அவற்றைப் பற்றி பின்னர் பேசுகிறோம்.
tr_tr: Grover'ın algoritmasını ``Grover`` sınıfı ile çalıştırmak için öncelikle Grover algoritmasının devresi için bir ayrıcalık belirlememiz gerekiyor. Aşağıdaki örnekte, Grover algoritmasının kara kutusu olarak ``QuantumCircuit`` kullanıyoruz. Ancak, Grover'ın algoritmasının kara kutusu olarak kullanabileceğimiz birkaç sınıf daha var. Bu eğitimde daha sonra onlar hakkında konuşacağız.

source: Note that the oracle for ``Grover`` must be a *phase-flip* oracle. That is, it multiplies the amplitudes of the of “good states” by a factor of :math:`-1`. We explain later how to convert a *bit-flip* oracle to a phase-flip oracle.
bn_bn: লক্ষ্য কর ``Grover`` এর জন্য ওরাকলটি অবশ্যই একটি *phase-flip* ওরাকল হতে হবে। অর্থাৎ, এটা সুষম অবস্থার বিস্তারকে :math:`-1` এর একটি গুনিতক দ্বারা গুন করে। কিভাবে একটি *bit-flip* ওরাকলকে একটি phase-flip ওরাকলে পরিণত করা যায় তা আমরা পরে আলোচনা করব।
es_un: Tenga en cuenta que el oráculo para ``Grover`` debe ser un oráculo *de cambio de fase*. Es decir, multiplica las amplitudes de los "estados correctos" por un factor de :math:`-1`. Más adelante explicamos cómo convertir un oráculo *bit-flip* en un oráculo de cambio de fase.
fr_fr: Notez que l'oracle de ``Grover`` doit être un oracle de *phase-flip*. En d'autres termes, il multiplie les amplitudes des états recherchés par un facteur :math:`-1`. Nous expliquons plus tard comment convertir un oracle de type *bit-flip* en oracle de type phase-flip.
ko_kr: ``Grover`` 오라클에는 *phase-flip* 오라클이 있다는 것을 주목하라. 즉, “좋은 상태” 의 진폭을 :math:`-1` 로 곱하는 것이다. 우리는 나중에 다시 한 번 *비트-플립* 오라클을 위상-플립으로 변환하는 방법을 설명한다.
ru: Обратите внимание, что оракул для ``Grover`` должен быть оракулом *фазового переворота*. То есть, он должен умножать амплитуды "хороших состояний" на коэффициент :math:`-1`. Позже мы объясним, как преобразовать оракул с *переключением бита* в оракул с переключением фаз.
ta_in: ``Grover`` க்கான ஆரக்கிள் ஒரு *phase-flip* ஆரக்கிளாக இருக்க வேண்டும் என்பதை நினைவில் கொள்க. அதாவது, இது “good states” பெருக்கங்களை ஒரு :math:`-1` காரணியால் பெருக்குகிறது. *phase-flip* ஆரக்கிளை ஒரு *bit-flip* ஆரக்கிளாக மாற்றுவது எப்படி என்பதை பின்னர் விளக்குகிறோம்.
tr_tr: ``Grover`` için kara kutunun bir *faz çevirme* kara kutusu olması gerektiğini unutmayın. Yani, “good states” genliklerini bir :math:`-1` faktörü ile çarpar. Daha sonra bir *bit-flip* kahininin bir faz çevirme kahinine nasıl dönüştürüleceğini açıklayacağız.

source: Then, we specify a backend and call the ``run`` method of ``Grover`` with a backend to execute the circuits. The returned result type is a ``GroverResult``.
bn_bn: তারপরে, আমরা একটি ব্যাকএন্ড পছন্দ করি এবং সার্কিটগুলি সম্পাদন করতে ব্যাকএন্ড সহ ``Grover`` এর ``run`` মেথডটি কল করি। প্রত্যাবর্তিত ফলাফলের ধরণটি হল একটি ``GroverResult``।
es_un: Luego, especificamos un backend y llamamos al método ``run`` de ``Grover`` con un backend para ejecutar los circuitos. El tipo de resultado devuelto es un ``GroverResult``.
fr_fr: Ensuite, nous spécifions un backend et nous appelons la méthode ``run`` de ``Grover``. Le type de résultat renvoyé est un ``GroverResult``.
ko_kr: 다음으로, 백엔드를 지정하고 ``Grover`` 의 ``run`` 메서드를 백엔드와 함께 호출하여 회로를 실행한다. 반환된 결과 유형은 ``GroverResult`` 이다.
pl: Następnie określamy backend i wywołujemy metodę ``run`` z ``Grover`` z backendem, aby wykonać obwód. Zwrócony typ wyniku to ``GroverResult``.
ru: Затем мы указываем бэкенд и вызываем метод ``run`` класса ``Grover`` с бэкендом для выполнения схем. Тип возвращаемого результата - ``GroverResult``.
ta_in: பின்னர், நாங்கள் ஒரு பின்தளத்தில் குறிப்பிடுகிறோம், ``Grover`` இன் ``run`` முறையை ஒரு பின்தளத்தில் சுற்றுகளை இயக்க அழைக்கிறோம். வெளியீட்டு வகை ``GroverResult``.
te: అప్పుడు, మేము బ్యాకెండ్‌ను పేర్కొని, సర్క్యూట్‌లను అమలు చేయడానికి బ్యాకెండ్‌తో ``గ్రోవర్`` యొక్క ``రన్`` పద్ధతిని కాల్ చేస్తాము. తిరిగి వచ్చిన ఫలితం రకం ``GroverResult``.
tr_tr: Daha sonra bir backend belirleriz ve devreleri yürütmek için bir backend ile ``Grover``ın ``run`` metodunu çağırırız. Döndürülen sonuç türü bir ``GroverResult``dır.
