Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/06_grover.po
Languages: bn_bn, es_un, fr_fr, ko_kr, pl, ru, ta_in, te, tr_tr

source: The number of repetition of applying the Grover operator is important to obtain the correct result with Grover's algorithm. The number of iteration can be set by the ``iteration`` argument of ``Grover``. The following inputs are supported: \* an integer to specify a single power of the Grover operator that's applied \* or a list of integers, in which all these different powers of the Grover operator are run consecutively and after each time we check if a correct solution has been found
pl: Liczba powtórzeń zastosowania operatora Grovera jest ważna dla uzyskania poprawnego wyniku przy użyciu algorytmu Grovera. Liczba iteracji może być ustawiona przez argument ``iteration`` w ``Grover``. Obsługiwane są następujące dane: \* liczba całkowita określająca pojedynczą moc operatora Grover \* lub listę liczb całkowitych, w którym wszystkie te różne uprawnienia operatora Grover są wykonywane kolejno i po każdym razie sprawdzamy, czy znaleziono poprawne rozwiązanie.
te: గ్రోవర్ యొక్క అల్గారిథమ్‌తో సరైన ఫలితాన్ని పొందడానికి గ్రోవర్ ఆపరేటర్‌ని వర్తింపజేయడం యొక్క పునరావృత సంఖ్య చాలా ముఖ్యం. పునరావృత సంఖ్యను ``గ్రోవర్`` యొక్క `` పునరావృతం`` ఆర్గ్యుమెంట్ ద్వారా సెట్ చేయవచ్చు. కింది ఇన్‌పుట్‌లకు మద్దతు ఉంది: \* వర్తింపజేయబడిన గ్రోవర్ ఆపరేటర్ యొక్క ఒకే శక్తిని పేర్కొనడానికి ఒక పూర్ణాంకం \* లేదా పూర్ణాంకాల జాబితా, దీనిలో గ్రోవర్ ఆపరేటర్ యొక్క ఈ విభిన్న శక్తులన్నీ వరుసగా అమలు చేయబడతాయి మరియు ప్రతిసారీ సరైన పరిష్కారం కనుగొనబడిందో లేదో తనిఖీ చేస్తాము

source: Additionally there is the ``sample_from_iterations`` argument. When it is ``True``, instead of the specific power in ``iterations``, a random integer between 0 and the value in ``iteration`` is used as the power Grover's operator. This approach is useful when we don't even know the number of solution.
pl: Istnieje jeszcze argument ``sample_from_iterations``. Kiedy wynosi on``True``, zamiast konkretnej mocy w ``iterations``, jako operator mocy używana jest losowa liczba całkowita pomiędzy 0 a wartością w ``iterations``. Jest to przydatne, gdy nie znamy nawet liczby rozwiązań.
te: అదనంగా ``నమూనా_నుండి_మళ్లీ`` వాదన ఉంది. ఇది ``ట్రూ`` అయినప్పుడు, ``ఇటరేషన్‌లు``లోని నిర్దిష్ట శక్తికి బదులుగా, 0 మరియు ``ఇటరేషన్``లోని విలువ మధ్య యాదృచ్ఛిక పూర్ణాంకం పవర్ గ్రోవర్ ఆపరేటర్‌గా ఉపయోగించబడుతుంది. పరిష్కారం యొక్క సంఖ్య కూడా మనకు తెలియనప్పుడు ఈ విధానం ఉపయోగపడుతుంది.

source: We can apply an optional post processing to the top measurement for ease of readability. It can be used e.g. to convert from the bit-representation of the measurement ``[1, 0, 1]`` to a DIMACS CNF format ``[1, -2, 3]``.
te: చదవగలిగే సౌలభ్యం కోసం మేము టాప్ మెజర్‌మెంట్‌కు ఐచ్ఛిక పోస్ట్ ప్రాసెసింగ్‌ని వర్తింపజేయవచ్చు. దీనిని ఉపయోగించవచ్చు ఉదా. కొలత ``[1, 0, 1]`` యొక్క బిట్-ప్రాతినిధ్యం నుండి DIMACS CNF ఫార్మాట్ ``[1, -2, 3]``కి మార్చడానికి.

source: [1]: L. K. Grover, A fast quantum mechanical algorithm for database search. Proceedings 28th Annual Symposium on the Theory of Computing (STOC) 1996, pp. 212-219. https://arxiv.org/abs/quant-ph/9605043
pl: [1]: L. K. Grover, A fast quantum mechanical algorithm for database search. Proceedings 28th Annual Symposium on the Theory of Computing (STOC) (https://arxiv.org/abs/quant-ph/9605043), 1996, s. 212-219.
