Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/06_grover.po
Languages: bn_bn, es_un, fr_fr, ko_kr, pl, ru, ta_in, te, tr_tr

source: If the search was successful, the ``oracle_evaluation`` attribute of the result will be ``True``. In this case, the most sampled measurement, ``top_measurement``, is one of the “good states”. Otherwise, ``oracle_evaluation`` will be False.
bn_bn: অনুসন্ধানটি সফল হলে, ফলাফলটির ``oracle_evaluation`` অ্যাট্রিবিউট ``True`` হবে। এই ক্ষেত্রে, সর্বাধিক নমুনাকৃত হিসাব ``top_measurement`` হল অনেকগুলো সূষম অবস্থার মধে একটি অবস্থা।
es_un: Si la búsqueda fue exitosa, el atributo ``oracle_evaluation`` del resultado será ``True``. En este caso, la medida más muestreada, ``top_measurement``, es uno de los "estados correctos". De lo contrario, ``oracle_evaluation`` será False.
fr_fr: Si la recherche a réussi, l'attribut ``oracle_evaluation`` du résultat sera ``True``. Dans ce cas, la mesure la plus fréquemment obtenue, ``top_measurement``, est l'un des états recherchés. Sinon, ``oracle_evaluation`` sera ``False``.
ko_kr: 만약 검색이 성공하면 도출된 결과의 ``oracle_evaluation`` 속성은 ``참`` 이 될 것이다. 이 경우에는, 가장 샘플화된 측정인 ``top_measurement`` 는 “좋은 상태” 중 하나이며 그렇지 않다면 ``oracle_evaluation`` 은 거짓이 될 것이다.
ru: Если поиск был успешным, значение параметра ``oracle_evaluation`` результата будет равно ``True``. В этом случае самое отобранное измерение, ``top_measurement``, является одним из "хороших состояний". В противном случае ``oracle_evaluation`` будет False.
ta_in: தேடல் வெற்றிகரமாக இருந்தால், முடிவின் ``oracle_evaluation`` பண்புக்கூறு ``True``. இந்த வழக்கில், மிகவும் மாதிரியான அளவீட்டு, ``top_measurement``,“good states” ஒன்றாகும். இல்லையெனில், ``oracle_evaluation`` தவறானது.
tr_tr: Arama başarılı olursa, sonucun ``oracle_evaluation`` özelliği ``True`` olacaktır. Bu durumda en çok örneklenen ölçüm olan ``top_measurement``, “good states” biridir. Aksi takdirde, ``oracle_evaluation`` False olacaktır.

source: In the example, the result of ``top_measurement`` is ``11`` which is one of “good state”. Thus, we succeeded to find the answer by using ``Grover``.
bn_bn: উদাহরণস্বরূপ, ``top_measurement`` এর ফলাফল হল ``11``, যা একটি “good state”। এভাবে, আমরা গ্রোভার ব্যবহার করে ফলাফলটি বের করতে পেরেছি।
es_un: En el ejemplo, el resultado de ``top_measurement`` es ``11`` que es un "estado correcto". Por lo tanto, logramos encontrar la respuesta usando ``Grover``.
fr_fr: Dans cet exemple, le résultat de ``top_measurement`` est ``11`` qui est l'état recherché. Ainsi, nous avons réussi à trouver la réponse en utilisant ``Grover``.
ko_kr: 예를 들어, ``top_measurement`` 의 결과는 ``11`` 이다. ``11`` 은 좋은 상태 중 하나이다. 그래서 우리는 ``Grover`` 를 이용해 답을 찾는 데 성공했다.
ru: В приведенном примере результат ``top_measurement`` равен ``11``, что является одним из "хороших состояний". Таким образом, нам удалось найти ответ с помощью ``Grover``.
ta_in: எடுத்துக்காட்டில், ``top_measurement`` இன் விளைவாக `` 11`` என்பது “good state” ஒன்றாகும். இதனால், ``Grover`` ஐப் பயன்படுத்தி பதிலைக் கண்டுபிடிக்க நாங்கள் வெற்றி பெற்றோம்.
tr_tr: Örnekte, ``top_measurement`` sonucu, “good state”den biri olan ``11``dir. Böylece ``Grover`` kullanarak cevabı bulmayı başardık.

source: Using the different types of classes as the oracle of ``Grover``
bn_bn: ওরাকল হিসাবে ``Grover`` এর বিভিন্ন ধরণের ক্লাস ব্যবহার করা
es_un: Usando los diferentes tipos de clases como el oráculo de ``Grover``
fr_fr: Utiliser les différents types de classes comme oracle de ``Grover``
ko_kr: 다양한 유형의 클래스를 ``Grover`` 의 오라클로 사용하기
pl: Używanie różnych typów klas jako wyroczni ``Grover``
ru: Использование различных типов классов в качестве оракула ``Grover``
ta_in: ``Grover`` இன் ஆரக்கிள் என பல்வேறு வகையான வகுப்புகளைப் பயன்படுத்துதல்
te: విభిన్న రకాల తరగతులను ``గ్రోవర్`` యొక్క ఒరాకిల్‌గా ఉపయోగించడం
tr_tr: Farklı sınıf türlerini ``Grover``ın kara kutusu olarak kullanma

source: In the above example, we used ``QuantumCircuit`` as the oracle of ``Grover``. However, we can also use ``qiskit.quantum_info.Statevector`` as oracle. All the following examples are when :math:`|11\rangle` is “good state”
bn_bn: যদিও, আমরা ওরাকল হিসাবে ``qiskit.quantum_info.Statevector`` ব্যবহার করতে পারতাম, উপরিউক্ত উদাহরনে ``QuantumCircuit`` কে ``Grover`` এর ওরাকল হিসাবে ব্যবহার করেছি। “good state” হিসেবে :math:`|11\rangle` এর উদাহরণগুলো নিম্নরূপ,
es_un: En el ejemplo anterior, usamos ``QuantumCircuit`` como el oráculo de ``Grover``. Sin embargo, también podemos usar ``qiskit.quantum_info.Statevector`` como oráculo. Todos los siguientes ejemplos son cuando :math:`|11\rangle` es el "estado correcto"
fr_fr: Dans l'exemple ci-dessus, nous avons utilisé la classe ``QuantumCircuit`` comme l'oracle de ``Grover``. Cependant, nous pouvons également utiliser ``qiskit.aqua.components.oracles.Oracle``, et ``qiskit.quantum_info.Statevector`` comme oracles. Dans les exemples suivants, l'état recherché est :math:`| 11\rangle`
ko_kr: 위의 예에서 우리는 ``QuantumCircuit`` 을 ``Grover`` 의 오라클로 사용했다. 그러나 우리는 또한 ``qiskit.quantum_info.Statevector`` 를 오라클로 사용할 수도 있다. 다음의 예제들은 모두 :math:`|11\rangle` 가 “좋은 상태”일때 이다.
ru: В приведенном выше примере мы использовали ``QuantumCircuit`` в качестве оракула ``Grover``. Однако, в качестве оракула мы также можем использовать ``qiskit.quantum_info.Statevector``. Во всех следующих примерах :math:`|11\rangle` является "хорошим состоянием"
ta_in: மேலேயுள்ள எடுத்துக்காட்டில், ``Grover`` இன் ஆரக்கிளாக ``QuantumCircuit`` ஐப் பயன்படுத்தினோம். இருப்பினும் ``qiskit.quantum_info.Statevector`` ஐ ஆரக்கிளாகவும் பயன்படுத்தலாம். பின்வரும் எல்லா எடுத்துக்காட்டுகளும் :math:`|11\rangle`` என்பது “good state”ல் இருக்கும்போது
tr_tr: Yukarıdaki örnekte, ``Grover``ın kara kutusu olarak``QuantumCircuit``i kullandık. Ancak oracle olarak ``qiskit.quantum_info.Statevector`` da kullanabiliriz. Aşağıdaki örneklerin tümü :math:`|11\rangle` “good state” olduğunda geçerlidir

source: Internally, the statevector is mapped to a quantum circuit:
bn_bn: ইন্টারনালি, স্টেকভেক্টরটি কোয়ান্টাম সার্কিটে ম্যাপ করা হয়:
es_un: Internamente, el vector de estado se asigna a un circuito cuántico:
fr_fr: En interne, le vecteur d'état est projeté sur circuit quantique :
ko_kr: 내부적으로, 상태 벡터는 양자 회로로 대응된다.
pl: Wewnętrznie wektor stanu jest połączony z obwodem kwantowym:
ru: При этом, внутри алгоритма вектор состояний отображается на квантовую схему:
ta_in: உட்புறமாக, ஸ்டேட்வெக்டர் ஒரு குவாண்டம் சுற்றுக்கு மாற்றப்படுகிறது:
te: అంతర్గతంగా, స్టేట్‌వెక్టర్ క్వాంటం సర్క్యూట్‌కు మ్యాప్ చేయబడింది:
tr_tr: Dahili olarak, durum vektörü bir kuantum devresine eşlenir:

source: Qiskit allows for an easy construction of more complex oracles: \* ``PhaseOracle``: for parsing logical expressions such as ``'~a | b'``. This is especially useful for solving 3-SAT problems and is shown in the accompanying `Grover Examples <07_grover_examples.ipynb>`__ tutorial.
bn_bn: Qiskit আরও জটিল ওরাকলগুলি সহজেই নির্মাণের সুযোগ দেয়। যেমন লজিকাল এক্সপ্রেশন বাছাই করার জন্য \* ``PhaseOracle``, যদি এবং কেবল যদি ``'~a | b'`` হয়। এটি বিশেষত 3-SAT সমস্যা সমাধানের জন্য সহায়ক এবং এর সাথে সম্পৃক্ত `Grover Examples <07_grover_examples.ipynb>`__ টিউটোরিয়ালে প্রদর্শিত হবে।
es_un: Qiskit permite una fácil construcción de oráculos más complejos: \* ``PhaseOracle``: para analizar expresiones lógicas como ``'~a | b'``. Esto es especialmente útil para resolver problemas de 3-SAT y se muestra en el tutorial `Ejemplos de Grover <07_grover_examples.ipynb>`__ adjunto.
fr_fr: Qiskit permet de construire facilement des oracles plus complexes: \* ``PhaseOracle`` : pour l'analyse d'expressions logiques telles que ``'~ a | b'``. Ceci est particulièrement utile pour résoudre les problèmes 3-SAT et est démontré dans le tutoriel " Grover Exemples <07_grover_examples.ipynb> ` __.
ko_kr: Qiskit을 사용하면 보다 복잡한 오라클을 쉽게 구성할 수 있다. \* ``PhaseOracle``: ``'~a | b'`` 와 같은 논리 식을 구문 분석하는 데 사용된다. 이는 3-SAT 문제를 해결하는 데 특히 유용하며 `Grover Examples <07_grover_examples.ipynb>`__ 사용 지침서에 나와 있다.
pl: Qiskit pozwala na łatwą konstrukcję bardziej złożonych wyroczni: \* ``PhaseOracle``: do analizy wyrażeń logicznych, takich jak ``'~a | b'``. Jest to szczególnie przydatne do rozwiązywania problemów 3-SAT, co można zobaczyć w sekcji `Algorytm Grovera – przykłady <07_grover_examples.ipynb>`.
ru: Qiskit также позволяет с легкостью конструировать и более сложные оракулы \* ``PhaseOracle`` для анализа логических выражений, таких как ``'~a | b'``. Это особенно удобно для решения задачи 3-SAT и показано в соответствующем разделе `Grover Examples <07_grover_examples.ipynb>`__ руководства.
ta_in: மிகவும் சிக்கலான ஆரக்கிள்களை எளிதாக உருவாக்க Qiskit \ * ``PhaseOracle``: அனுமதிப்பதன் மூலம்: ``'~a | b'``. போன்ற தருக்க வெளிப்பாடுகளை பாகுபடுத்தப்பட்டது. 3-SAT சிக்கல்களைத் தீர்க்க இது மிகவும் பயனுள்ளதாக இருக்கும், மேலும் அதனுடன் `Grover Examples <07_grover_examples.ipynb>`__ டுடோரியலில் காட்டப்பட்டுள்ளது.
te: Qiskit మరింత సంక్లిష్టమైన ఒరాకిల్స్‌ను సులభంగా నిర్మించడానికి అనుమతిస్తుంది: \* ``ఫేజ్‌ఒరాకిల్``: ``'~a | b'`` వంటి తార్కిక వ్యక్తీకరణలను అన్వయించడం కోసం. ఇది 3-SAT సమస్యలను పరిష్కరించడానికి ప్రత్యేకంగా ఉపయోగపడుతుంది మరియు దానితో పాటుగా ఉన్న `గ్రోవర్ ఉదాహరణలు <07_grover_examples.ipynb>`__ ట్యుటోరియల్‌లో చూపబడింది.
tr_tr: Qiskit, daha karmaşık kara kutuların kolayca oluşturulmasını sağlar: \* ``PhaseOracle``: ``'~a | b'`` gibi mantıksal ifadeleri ayrıştırmak için. Bu özellikle 3-SAT problemlerini çözmek için kullanışlıdır ve beraberindeki `Grover Examples <07_grover_examples.ipynb>`__ öğreticisinde gösterilmiştir.

source: Here we’ll use the ``PhaseOracle`` for the simple example of finding the state :math:`|11\rangle`, which corresponds to ``'a & b'``.
bn_bn: এখানে আমরা সরল উদাহরণসরূপ :math:`|11\rangle` অবস্থা অনুসন্ধানের জন্য ``PhaseOracle`` ব্যবহার করব, যখন ``'a & b'`` হয়।
es_un: Aquí usaremos el ``PhaseOracle`` para el ejemplo simple de encontrar el estado :math:`|11\rangle`, que corresponde a ``'a & b'``.
fr_fr: Dans cet exemple simple, nous allons utiliser ``PhaseOracle`` pour trouver l'état :math:`| 11\rangle`, qui correspond à ``'a & b'``.
ko_kr: 여기서는 ``'a & b'`` 에 해당하는 상태 :math:`|11\rangle` 를 찾는 간단한 예제로 ``PhaseOracle`` 을 사용한다.
ru: Здесь мы будем использовать ``PhaseOracle`` для простого примера нахождения состояния :math:`|11\rangle`, которое соответствует ``'a & b'``.
ta_in: நிலையைக் கண்டுபிடிப்பதற்கான எளிய எடுத்துக்காட்டுக்கு இங்கே ``PhaseOracle`` ஐப் பயன்படுத்துவோம் :math:`|11\rangle`, இது ``'a & b'`` உடன் ஒத்திருக்கிறது.
tr_tr: Burada, ``'a & b'``ye karşılık gelen :math:`|11\rangle` durumunu bulmanın basit örneği için ``PhaseOracle``ı kullanacağız.

source: You can observe, that this oracle is actually implemented with three qubits instead of two!
bn_bn: আপনি পর্যবেক্ষণ করতে পারেন যে, এই ওরাকলটি দুটির পরিবর্তে তিনটি কিউবিট দিয়ে বাস্তবায়িত হয়েছে!
es_un: Puedes observar que, ¡este oráculo se implementa con tres qubits en lugar de dos!
ta_in: இந்த ஆரக்கிள் உண்மையில் இரண்டுக்கு பதிலாக மூன்று குயூபிட்களுடன் செயல்படுத்தப்படுகிறது என்பதை நீங்கள் அவதானிக்கலாம்!
tr_tr: Bu kara kutunun, aslında iki yerine üç kübit ile uygulandığını gözlemleyebilirsiniz!

source: That is because the ``PhaseOracle`` is not a phase-flip oracle (which flips the phase of the good state) but a bit-flip oracle. This means it flips the state of an auxiliary qubit if the other qubits satisfy the condition. For Grover’s algorithm, however, we require a phase-flip oracle. To convert the bit-flip oracle to a phase-flip oracle we sandwich the controlled-NOT by :math:`X` and :math:`H` gates, as you can see in the circuit above.
bn_bn: এর কারণ হল ``PhaseOracle`` কোনো ফেজ-ফ্লিপ ওরাকল নয় (যা সুষম অবস্থার ধাপটিকে বদলিয়ে দেয়) বিট-ফ্লিপ ওরাকল। অর্থাৎ এটি যদি অন্যান্য কিউবিটগুলো শর্তটি পূরণ করে তবে এটি একটি গৌণ কিউবিট এর অবস্থা ফ্লিপ করে। তাও গ্রোভারের অ্যালগরিদমের জন্য আমাদের একটি ফেজ-ফ্লিপ ওরাকল প্রয়োজন। যেমনটি আপনি উপরের সার্কিটটিতে দেখতে পাচ্ছেন, বিট-ফ্লিপ ওরাকলকে একটি ফেজ-ফ্লিপ ওরাকলে রূপান্তর করতে আমরা controled-NOT গেটকে :math:`X` এবং :math:`H` গেট দ্বারা পরিবর্তন করি।
es_un: Esto se debe a que el ``PhaseOracle`` no es un oráculo de cambio de fase (que cambia la fase del estado correcto) sino un oráculo de cambio de bit. Esto significa que cambia el estado de un qubit auxiliar si los otros qubits satisfacen la condición. Para el algoritmo de Grover, sin embargo, necesitamos un oráculo de cambio de fase. Para convertir el oráculo de cambio de bits en un oráculo de cambio de fase, intercalamos las compuertas NOT controladas por compuertas :math:`X` y :math:`H`, como puedes ver en el circuito de arriba.
ta_in: ஏனென்றால், ``PhaseOracle`` என்பது ஒரு phase-flip ஆரக்கிள் அல்ல (இது நல்ல நிலை கட்டத்தை புரட்டுகிறது). இதன் பொருள் மற்ற குவிட்கள் நிபந்தனையை பூர்த்தி செய்தால் அது ஒரு துணை குயூபிட்டின் நிலையை புரட்டுகிறது. க்ரோவரின் வழிமுறைக்கு, எங்களுக்கு ஒரு phase-flip ஆரக்கிள் தேவைப்படுகிறது. bit-flip ஆரக்கிளை ஒரு phase-flip ஆரக்கிளாக மாற்ற, கட்டுப்படுத்தப்பட்ட- NOT: சாண்ட்விச் :math:`X` மற்றும் :math:`H` வாயில்கள், மேலே உள்ள சுற்றுகளில் நீங்கள் காணக்கூடியது.
tr_tr: Bunun nedeni,``PhaseOracle``ın bir faz-çevirme kara kutusu değil (iyi durumun fazını çeviren) değil, bir bit-çevirme kara kutu olmasıdır. Bu, diğer kübitler koşulu sağlıyorsa, yardımcı kübitin durumunu ters çevirdiği anlamına gelir. Ancak Grover'ın algoritması için bir faz-çevirme kara kutusuna ihtiyacımız var. Bit-çevirme kara kutusunu bir faz çevirme kara kutusuna dönüştürmek için, yukarıdaki devrede görebileceğiniz gibi, kontrollü-NOT'u :math:`X` ve :math:`H` kapıları ile şıkıştırıyoruz.

source: **Note:** This transformation from a bit-flip to a phase-flip oracle holds generally and you can use this to convert your oracle to the right representation.
bn_bn: **Note:** এভাবে বিট-ফ্লিপ থেকে একটি ফেজ-ফ্লিপ ওরাকল এ রূপান্তরটি সাধারণভাবে সংরক্ষিত হয় এবং আপনি আপনার ওরেকলকে যথার্থ প্রতিরূপে রূপান্তর করতে এটি ব্যবহার করতে পারেন।
es_un: **Nota:** Esta transformación de un oráculo de cambio de bits a un cambio de fase se mantiene en general y puedes usar esto para convertir tu oráculo en la representación correcta.
fr_fr: **Note:** Cette transformation d'un oracle de bit-flip en oracle de phase-flip est valable en general et vous pouvez l'utiliser pour convertir votre oracle vers la bonne représentation.
ko_kr: **참고:** 비트-플립에서 위상-플립 오라클로의 이러한 변환은 일반적으로 유지되며, 이를 사용하여 오라클을 올바른 표현으로 변환할 수 있다.
pl: **Uwaga:** Ta transformacja z wyroczni odwracającej bit na wyrocznię odwracającą fazę ma charakter ogólny i można jej użyć do przekształcenia reprezentacji wyroczni.
ru: **Примечание:** Это преобразование из оракула с переключением битов в оракул с переключением фаз применимо в любом случае, и вы можете использовать его для перевода вашего оракула в правильное представление.
ta_in: **Note:** ஒரு bit-flip லிருந்து ஒரு phase-flip மாற்றம் ஆரக்கிள் பொதுவாக வைத்திருக்கிறது, மேலும் உங்கள் ஆரக்கிளை சரியான பிரதிநிதித்துவத்திற்கு மாற்ற இதைப் பயன்படுத்தலாம்.
te: **గమనిక:** బిట్-ఫ్లిప్ నుండి ఫేజ్-ఫ్లిప్ ఒరాకిల్‌కు ఈ రూపాంతరం సాధారణంగా ఉంటుంది మరియు మీరు మీ ఒరాకిల్‌ను సరైన ప్రాతినిధ్యంగా మార్చడానికి దీన్ని ఉపయోగించవచ్చు.
tr_tr: **Not:** Bir bit çevirmeden faz-çevirme kara kutusuna dönüşüm genel olarak geçerlidir ve bunu, kara kutunuzun doğru temsile dönüştürmek için kullanabilirsiniz.

source: Amplitude amplification
bn_bn: বিস্তার বিবর্ধন
es_un: Amplificación de amplitud
fr_fr: Amplification de l'amplitude
ko_kr: 진폭 증폭
pl: Wzmacnianie amplitudy
ru: Усиление амплитуды
ta_in: அலைவீச்சு பெருக்கம்
tr_tr: Genlik amplifikasyonu

source: Grover’s algorithm uses Hadamard gates to create the uniform superposition of all the states at the beginning of the Grover operator :math:`\mathcal{Q}`. If some information on the good states is available, it might be useful to not start in a uniform superposition but only initialize specific states. This, generalized, version of Grover’s algorithm is referred to *Amplitude Amplification*.
bn_bn: গ্রোভারের অ্যালগরিদম সবগুলো মৌলিক সুপারপজিশন তৈরি করতে গ্রোভার অপারেটর :math:`\mathcal{Q}` এর শুরুতে হাদামারড গেটগুলি ব্যবহার করে। যদি সুষম অবস্থার ওপর কোন তথ্য থেকে থাকে, তবে একে মৌলিক সুপারপজিশনে শুরু না করিয়ে কেবল একটি নির্দিষ্ট অবস্থায় স্থির করলে উপকারি হতে পারে। গ্রভারের অ্যালগরিদমের এই সারাংশিত ভার্শনকে *বিস্তার পরিবর্ধন* বলে অভিহিত করা হয়।
es_un: El algoritmo de Grover usa compuertas Hadamard para crear la superposición uniforme de todos los estados al comienzo del operador de Grover :math:`\mathcal{Q}`. Si se dispone de alguna información sobre los estados correctos, puede resultar útil no comenzar en una superposición uniforme, sino solo inicializar estados específicos. Esta versión generalizada del algoritmo de Grover se conoce como *Amplificación de Amplitud*.
fr_fr: L'algorithme de Grover utilise des portes de Hadamard pour créer la superposition uniforme de tous les états au début de l'opérateur de Grover :math:`\mathcal{Q}`. Si certaines informations sur les états recherchés sont disponibles, il peut être utile de ne pas démarrer dans une superposition uniforme mais d'initialiser uniquement des états spécifiques. Cette version, généralisée, de l'algorithme de Grover est appelée *Amplification d'Amplitude*.
ko_kr: Grover 알고리즘은 하다마드 (Hadamard) 게이트를 사용하여 Grover 연산자 :math:`\mathcal{Q}` 의 시작 부분에 모든 상태의 균일 중첩을 만든다. 좋은 상태에 대한 일부 정보를 사용할 수 있는 경우 균일 중첩 상태에서 시작하지 않고 특정 상태만 초기화하는 것이 유용할 수 있다. 이와 같이 일반화된 버전의 Grover 알고리즘을 *Amplitude Amplification* 이라고 한다.
ru: Алгоритм Гровера использует вентили Адамара для создания равномерной суперпозиции всех состояний в начале оператора Гровера :math:`\mathcal{Q}`. Если имеется некоторая информация о "хороших состояниях", может оказаться полезным не начинать с равномерной суперпозиции, а инициализировать только конкретные состояния. Эта обобщенная версия алгоритма Гровера называется *Амплитудным усилением*.
ta_in: க்ரோவர் ஆபரேட்டர் :math:`\mathcal{Q}` இன் தொடக்கத்தில் அனைத்து நிலைகளின் சீரான சூப்பர் போசிஷனை உருவாக்க க்ரோவரின் வழிமுறை ஹடமார்ட் வாயில்களைப் பயன்படுத்துகிறது . நல்ல நிலைகள் குறித்த சில தகவல்கள் கிடைத்தால், ஒரே மாதிரியான சூப்பர் போசிஷனில் தொடங்காமல் இருப்பது பயனுள்ளதாக இருக்கும், ஆனால் குறிப்பிட்ட நிலைகளை மட்டுமே துவக்கலாம். இது, குரோவரின் வழிமுறையின் பொதுமைப்படுத்தப்பட்ட பதிப்பு *Amplitude Amplification* என குறிப்பிடப்படுகிறது.
tr_tr: Grover algoritması, Grover operatörünün :math:`\mathcal{Q}` başlangıcında bütün durumların tek tip süperpozisyonunu oluşturmak için Hadamard kapılarını kullanmaktadır. Eğer istenilen durumların bazı bilgileri mevcutsa tek tip bir süperpozisyondan başlamamak ancak sadece belirli durumları başlatmak yararlı olabilir. Grover algoritmasının bu, genelleştirilmiş, sürümü *Amplitude Amplification* (Genlik Yükseltme) olarak adlandırılır.

source: In Qiskit, the initial superposition state can easily be adjusted by setting the ``state_preparation`` argument.
bn_bn: কিস্কিটে প্রাথমিক সুপারপজিশন স্টেট খুব সহজেই ``state_preparation`` আরগুমেন্ট বসিয়ে রদবদল করে নেয়া যায়।
es_un: En Qiskit, el estado de superposición inicial se puede ajustar fácilmente configurando el argumento ``state_preparation``.
fr_fr: Dans Qiskit, l'état de superposition initial peut facilement être ajusté en définissant l'argument ``state_preparation``.
ko_kr: Qiskit에서 초기 중첩 상태는 ``state_preparation`` 전달인자를 설정하여 쉽게 조정할 수 있다.
pl: W Qiskit początkowy stan superpozycji może być łatwo skorygowany poprzez ustawienie argumentu ``state_preparation````.
ru: В Qiskit первоначальное состояние суперпозиции можно легко скорректировать, задав аргумент ``state_preparation``.
ta_in: Qiskit, ``state_preparation`` வாதத்தை அமைப்பதன் மூலம் ஆரம்ப superposition state யை எளிதாக சரிசெய்ய முடியும்.
te: Qiskitలో, ``state_preparation`` వాదనను సెట్ చేయడం ద్వారా ప్రారంభ సూపర్‌పొజిషన్ స్థితిని సులభంగా సర్దుబాటు చేయవచ్చు.
tr_tr: Qiskit'te, ilk süperpozisyon durumu ``state_preparation`` argümanını ayarlanarak kolayca ayarlanabilir.

source: State preparation
bn_bn: State preparation - অবস্থা ব্যবস্থাপন
es_un: Preparación del estado
fr_fr: Préparation de l'état
ko_kr: 상태 준비
pl: Przygotowanie stanu
ru: Подготовка состояния
ta_in: நிலை தயாரிப்பு
te: స్టేట్ ప్రిపరేషన్
tr_tr: Durum hazırlığı

source: A ``state_preparation`` argument is used to specify a quantum circuit that prepares a quantum state for the start point of the amplitude amplification. By default, a circuit with $H^{:nbsphinx-math:`\otimes `n} $ is used to prepare uniform superposition (so it will be Grover’s search). The diffusion circuit of the amplitude amplification reflects ``state_preparation`` automatically.
bn_bn: ``state_preparation`` আর্গুমেন্টটি কোয়ান্টাম সার্কিট চিহ্নিত করতে ব্যবহৃত হয় যা বিস্তার পরিবর্ধনের প্রারম্ভিকতার জন্য কোয়ান্টাম স্টেট প্রস্তুত করে। প্রাথমিকভাবে, $H^{:nbsphinx-math:`\otimes `n}$ সহ একটি সার্কিট মৌলিক সুপারপজিশন তৈরি করতে ব্যাহৃত হয়(যেন এটি একটি গ্রভার সার্চ হয়)। বিস্তার বিবর্ধনের ডিফিউশান সার্কিটটি স্বয়ংক্রিয়ভাবেই ``state_preparation`` ব্যাবর্তন করে।
es_un: Se utiliza un argumento de ``state_preparation`` para especificar un circuito cuántico que prepara un estado cuántico para el punto de inicio de la amplificación de amplitud. Por defecto, un circuito con $H^{:nbsphinx-math:`\otimes `n} $ se usa para preparar una superposición uniforme (por lo que será la búsqueda de Grover). El circuito de difusión de la amplificación de amplitud refleja el ``state_preparation`` automáticamente.
ta_in: வீச்சு பெருக்கத்தின் தொடக்கப் புள்ளிக்கு ஒரு குவாண்டம் நிலையைத் தயாரிக்கும் குவாண்டம் சுற்றுவட்டத்தைக் குறிப்பிட ``state_preparation`` வாதம் பயன்படுத்தப்படுகிறது. இயல்பாக,$H^{:nbsphinx-math:`\otimes `n} $ உடன் ஒரு சுற்று ஒரே மாதிரியான சூப்பர் போசிஷனைத் தயாரிக்கப் பயன்படுகிறது (எனவே இது க்ரோவரின் தேடலாக இருக்கும்). வீச்சு பெருக்கத்தின் பரவல் சுற்று தானாகவே ``state_preparation`` பிரதிபலிக்கிறது.
tr_tr: Bir ``state_preparation`` argümanı, genlik yükseltmesi başlangıç noktasına uygun bir kuantum durumu hazırlayan kuantum devresi belirlemek için kullanılır. Varsayılan olarak, $H^{:nbsphinx-math:`\otimes `n} $ li bir devre, tek tip süperpozisyon hazırlamak için kullanılır (yani Grover araması olacak). Genlik yükseltmenin difüzyon devresi ``state_preparation`` argümanını otomatik olarak yansıtır.

source: Full flexibility
bn_bn: Full flexibility-সম্পূর্ণ অভিযোজ্যতা
es_un: Flexibilidad total
fr_fr: Flexibilité totale
ko_kr: 완전한 유연성
pl: Pełna elastyczność
ru: Полная гибкость
ta_in: முழு நெகிழ்வுத்தன்மை
te: పూర్ణ నాణ్యత
tr_tr: Tam esneklik
