Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/06_grover.po
Languages: bn_bn, es_un, fr_fr, ko_kr, pl, ru, ta_in, te, tr_tr

source: For more advanced use, it is also possible to specify the entire Grover operator by setting the ``grover_operator`` argument. This might be useful if you know more efficient implementation for :math:`\mathcal{Q}` than the default construction via zero reflection, oracle and state preparation.
bn_bn: আরও বেশি তদতিরিক্ত ব্যবহারের জন্য, সম্পূর্ণ গ্রোভার অপারেটরটি ``grover_operator`` আর্গুমেন্ট দ্বারা নির্দিষ্ট করাও সম্ভব। আর এটা তখনি লাভবান হবে যখন আপনি জিরো রিফ্লেকশন, ওরাকল অথবা স্টেট প্রিপারেশোনের চেয়ে :math:`\mathcal{Q}` এর জন্য বেশি ফলপ্রদ নিষ্পাদন জানবেন।
es_un: Para un uso más avanzado, también es posible especificar todo el operador Grover configurando el argumento ``grover_operator``. Esto podría ser útil si conoces una implementación más eficiente para :math:`\mathcal{Q}` que la construcción predeterminada a través de la reflexión cero, el oráculo y la preparación del estado.
fr_fr: Pour une utilisation plus avancée, il est également possible de spécifier l'opérateur Grover en définissant l'argument ``grover_operator``. Cela peut être utile si vous connaissez une implémentation plus efficace pour :math:`\mathcal{Q}` que la construction par défaut via la réflexion zéro, l'oracle et la préparation de l'état.
ko_kr: 고급 사용을 위해서는 ``grover_operator`` 인수를 설정하여 전체 그로버 연산자를 지정할 수도 있다. 이는 0을 기준으로 한 반사, 오라클및 상태 준비를 통해 기본 구성보다 :math:`\mathcal{Q}` 의 효율적인 구현을 알고 있는 경우에 유용할 수 있다.
pl: Dla bardziej zaawansowanych zastosowań możliwe jest również określenie całego operatora Grover poprzez ustawienie argumentu ``grover_operator``. To może okazać się przydatne, jeśli znasz bardziej wydajną implementację dla :math:`\mathcal{Q}` niż domyślna konstrukcja poprzez odbicie 0, przygotowanie wyroczni i stanu.
ru: Для более продвинутого использования можно также указать весь оператор Гровера, задав аргумент ``grover_operator``. Это может быть полезно, если вы знаете более эффективную реализацию для :math:`\mathcal{Q}`, чем конструкция по умолчанию через нулевое отображение, оракул и подготовку состояния.
ta_in: மேலும் மேம்பட்ட பயன்பாட்டிற்கு, ``grover_operator`` வாதத்தை அமைப்பதன் மூலம் முழு க்ரோவர் ஆபரேட்டரையும் குறிப்பிடலாம். பூஜ்ஜிய பிரதிபலிப்பு, ஆரக்கிள் மற்றும் மாநில தயாரிப்பு வழியாக இயல்புநிலை கட்டுமானத்தை விட :math:`\mathcal{Q}` இதற்கான திறமையான செயல்படுத்தல் உங்களுக்குத் தெரிந்தால் இது பயனுள்ளதாக இருக்கும்.
te: మరింత అధునాతన ఉపయోగం కోసం, ``grover_operator`` ఆర్గ్యుమెంట్‌ని సెట్ చేయడం ద్వారా మొత్తం గ్రోవర్ ఆపరేటర్‌ను పేర్కొనడం కూడా సాధ్యమవుతుంది. జీరో రిఫ్లెక్షన్, ఒరాకిల్ మరియు స్టేట్ ప్రిపరేషన్ ద్వారా డిఫాల్ట్ నిర్మాణం కంటే :math:`\mathcal{Q}` కోసం మరింత సమర్థవంతమైన అమలు మీకు తెలిస్తే ఇది ఉపయోగకరంగా ఉండవచ్చు.
tr_tr: Daha ileri düzeyde kullanım için, ``grover_operator`` argümanını ayarlayarak bütün Grover operatörünü belirtmek de mümkündür. Bu, :math:`\mathcal{Q}` için sıfır yansıma, kara kutu (oracle) ve durum hazırlama yoluyla varsayılan yapımdan daha verimli bir uygulama biliyorsanız kullanışlı olabilir.

source: The ``qiskit.circuit.library.GroverOperator`` can be a good starting point and offers more options for an automated construction of the Grover operator. You can for instance \* set the ``mcx_mode`` \* ignore qubits in the zero reflection by setting ``reflection_qubits`` \* explicitly exchange the :math:`\mathcal{S_f}, \mathcal{S_0}` and :math:`\mathcal{A}` operations using the ``oracle``, ``zero_reflection`` and ``state_preparation`` arguments
bn_bn: গ্রোভার অপারেটরের স্বয়ংক্রিয় উৎপাদনের জন্য ``qiskit.circuit.library.GroverOperator`` একটি উপযুক্ত সূত্রপাত হতে পারে। উদাহরণস্বরূপ, আপনি বাহ্যিকভাবে ``reflection_qubits`` \* বসিয়ে কিউবিট জিরো রিফ্লেকশনের মাঝের কিউবিটসমুহকে উপেক্ষা করে ``oracle``, ``zero_reflection`` এবং ``state_preparation`` আরগুমেন্টগুলো দ্বারা :math:`\mathcal{S_f}, \mathcal{S_0}` এবং :math:`\mathcal{A}` কে পরিবর্তন করতে পারেন।
es_un: El ``qiskit.circuit.library.GroverOperator`` puede ser un buen punto de partida y ofrece más opciones para una construcción automatizada del operador Grover. Por ejemplo, puedes \* establecer el ``mcx_mode`` \* ignorar qubits en la reflexión cero configurando ``reflection_qubits`` \* intercambiar explícitamente los operadores :math:`\mathcal{S_f}, \mathcal{S_0}` y :math:`\mathcal{A}` usando los argumentos ``oracle``, ``zero_reflection`` y ``state_preparation``
fr_fr: La classe ``qiskit.circuit.library.GroverOperator`` peut être un bon point de départ et offre plus d'options pour une construction automatisée de l'opérateur de Grover. Vous pouvez par exemple \* définir le ``mcx_mode`` \* ignorer les qubits dans la réflexion autour de zéro en définissant ``reflection_qubits`` \* explicitement échanger les opérations :math:`\mathcal{S_f}, \mathcal{S_0}` et :math:`\mathcal{A}` à l'aide des arguments ``oracle``, ``zero_reflection`` et ``state_preparation``
ko_kr: ``qiskit.circuit.library.GroverOperator`` 는 좋은 출발점이 될 수 있으며 Grover 오퍼레이터의 자동화된 구성을 위한 더 많은 옵션을 제공한다. 예를 들어 ``reflection_qubits`` 가 ``oracle``, ``zero_reflection`` 및 ``state_preparation`` 인수를 사용하여 :math:`\mathcal{S_f}, \mathcal{S_0}` 및 :math:`\mathcal{A}` 연산을 명시적으로 교환하도록 설정하여 zero reflection에서 큐비트를 무시하도록 ``mcx_mode`` 를 설정할 수 있다.
pl: ``qiskit.circuit.library.GroverOperator`` może być dobrym punktem wyjścia i oferuje więcej możliwości zautomatyzowanej budowy operatora Grover. Możesz na przykład \* ustawić ``mcx_mode`` \* zignorować wyjście z odbicia ustawiając ``reflection_qubits`` \* zmienić wyłącznie operacje :math:`\mathcal{S_f}, \mathcal{S_0}` i :math:`\mathcal{A}`, używając argumentów ``oracle``, ``zero_reflection`` i ``state_preparation``
ru: Библиотека ``qiskit.circuit.library.GroverOperator`` может служить хорошей отправной точкой и предлагает множество дополнительных возможностей для автоматического построения оператора Гровера. Можно, например \* задать ``mcx_mode`` \* игнорировать кубиты в нулевом отображении задав ``reflection_qubits`` \* явным образом заменить операции :math:`\mathcal{S_f}, \mathcal{S_0}` и :math:`\mathcal{A}` используя аргументы ``oracle``, ``zero_reflection`` и ``state_preparation``
ta_in: ``qiskit.circuit.library.GroverOperator`` ஒரு நல்ல தொடக்க புள்ளியாக இருக்கக்கூடும், மேலும் க்ரோவர் ஆபரேட்டரின் தானியங்கி கட்டுமானத்திற்கான கூடுதல் விருப்பங்களை வழங்குகிறது. உதாரணமாக \ * ``reflection_qubits`` அமைப்பதன் மூலம் பூஜ்ஜிய பிரதிபலிப்பில் உள்ள புறக்கணிப்புகளை புறக்கணிக்க ``mcx_mode`` \* பயன்படுத்தி ``oracle``, ``zero_reflection`` மற்றும் ``state_preparation`` வாதங்களைப் பயன்படுத்தி :math:`\mathcal{S_f}, \mathcal{S_0}` and :math:`\mathcal{A}` வெளிப்படையாக பரிமாறிக்கொள்ளலாம்
te: ``qiskit.circuit.library.GroverOperator`` అనేది మంచి ప్రారంభ స్థానం మరియు గ్రోవర్ ఆపరేటర్ యొక్క స్వయంచాలక నిర్మాణం కోసం మరిన్ని ఎంపికలను అందిస్తుంది. ఉదాహరణకు మీరు \* ``reflection_qubits`` \*ని సెట్ చేయడం ద్వారా సున్నా ప్రతిబింబంలో ``mcx_mode`` \* విస్మరించండి క్విట్‌లను సెట్ చేయవచ్చు:math:`\mathcal{S_f}, \mathcal{S_0}` మరియు :math:`\mathcal{A}` కార్యకలాపాలు ``ఒరాకిల్``, ``zero_reflection`` మరియు ``state_preparation`` ఆర్గ్యుమెంట్‌లను ఉపయోగిస్తాయి
tr_tr: ``qiskit.circuit.library.GroverOperator`` iyi bir başlangıç noktası olabilir ve Grover operatörünün otomatik yapımı için bize daha fazla seçenek sunar. Örneğin \* ``mcx_mode`` u ayarlayabilirsiniz \* ``reflection_qubits`` i ayarlayarak sıfır yansımadaki kübitleri yoksayabilirsiniz \* ``oracle``, ``zero_reflection`` ve ``state_preparation`` argümanlarını kullanarak :math:`\mathcal{S_f}, \mathcal{S_0}` ve :math:`\mathcal{A}` işlemlerini açıkça karşılıklı olarak değiştirebilirsiniz

source: For instance, imagine the good state is a three qubit state :math:`|111\rangle` but we used 2 additional qubits as auxiliary qubits.
bn_bn: উদাহরণস্বরূপ, মনে করুন সুষম অবস্থাটা হল তিন কিউবিটের একটা অবস্থা :math:`|111\rangle`, কিন্তু আমরাতো অতিরিক্ত ২টি কিউবিট গৌণ কিউবিট হিসেবে ব্যাবহার করেছি।
es_un: Por ejemplo, imagina que el estado correcto es un estado de tres qubits :math:`|111\rangle` pero usamos 2 qubits adicionales como qubits auxiliares.
fr_fr: Par exemple, imaginez que le bon état soit l'état à trois qubits :math:`|111\rangle` et que nous ayons utilisé 2 qubits supplémentaires en tant que qubits auxiliaires.
ko_kr: 예를 들어, 좋은 상태는 3개의 큐비트 상태 ( :math:`|111\rangle`) 이지만, 2개의 추가적인 큐비트를 사용했다고 가정해보자.
pl: Załóżmy na przykład, że dobrym stanem jest ten stan trzech kubitów :math:`|111\r`, ale użyliśmy 2 dodatkowych kubitów jako pomocniczych.
ru: Представим, например, что хорошее состояние - это состояние из трех кубитов :math:`|111\rangle`, но мы использовали 2 дополнительных кубита в качестве вспомогательных.
ta_in: உதாரணமாக, நல்ல நிலை மூன்று குயூபிட் நிலை என்று கற்பனை செய்து பாருங்கள் :math:`|111\rangle` ஆனால் நாம் 2 கூடுதல் குயூபிட்களை துணை குயூபிட்களாகப் பயன்படுத்தினோம்.
te: ఉదాహరణకు, మంచి స్థితి మూడు క్విట్‌ల స్థితిని ఊహించుకోండి :math:`|111\rangle` కానీ మేము 2 అదనపు క్విట్‌లను సహాయక క్విట్‌లుగా ఉపయోగించాము.
tr_tr: Örneğin, iyi durumun üç kübitlik bir durum olduğunu hayal edin :math:`|111\rangle` ama yardımcı kübitler olarak 2 ek kübit kullandık.

source: Then, per default, the Grover operator implements the zero reflection on all five qubits.
bn_bn: তারপর নিয়মাফিকভাবে নিম্নক্ত গ্রোভার অপারেটরটি ৫টি কিউবিউটের সবগুলোর উপরেই জিরো রিফ্লেকশন প্রয়োগ করে।
es_un: Luego, por defecto, el operador Grover implementa la reflexión cero en los cinco qubits.
fr_fr: Alors, par défaut, l'opérateur Grover implémentera la réflexion autour de zéro sur les cinq qubits.
ko_kr: 그 다음, 기본적으로, 그로버 연산자는 5개의 모든 큐비트에 대해 제로 반사를 구현한다.
pl: Wówczas operator Grover domyślnie wdraża odbicie zerowe dla wszystkich pięciu kubitów.
ru: Тогда по умолчанию оператор Гровера реализует нулевое отображение на всех пяти кубитах.
ta_in: பின்னர், இயல்புநிலையாக, க்ரோவர் ஆபரேட்டர் அனைத்து ஐந்து குயூபிட்ளிலும் பூஜ்ஜிய பிரதிபலிப்பை செயல்படுத்துகிறது.
te: అప్పుడు, డిఫాల్ట్‌గా, గ్రోవర్ ఆపరేటర్ మొత్తం ఐదు క్విట్‌లపై సున్నా ప్రతిబింబాన్ని అమలు చేస్తుంది.
tr_tr: Ardından, varsayılan olarak, Grover operatörü sıfır yansımayı beş kübitin tümüne uygular.

source: But we know that we only need to consider the first three:
bn_bn: কিন্তু আমরাতো জানিই যে আমাদেরকে শুধু প্রথম তিনটা কিউবিটক বিবেচনা করতে হবে:
es_un: Pero sabemos que solo debemos considerar los tres primeros:
fr_fr: Mais nous savons que nous devons seulement considérer les trois premiers :
ko_kr: 하지만 우리는 처음 세 가지만을 고려해도 된다는 것을 알고 있다.
pl: Wiemy jednak, że musimy wziąć pod uwagę tylko trzy pierwsze:
ru: Но мы знаем, что нам нужно учитывать только первые три:
ta_in: ஆனால் முதல் மூன்றை மட்டுமே நாம் கருத்தில் கொள்ள வேண்டும் என்பதை நாம் அறிவோம்:
te: కానీ మనం మొదటి మూడింటిని మాత్రమే పరిగణించాల్సిన అవసరం ఉందని మాకు తెలుసు:
tr_tr: Ama sadece ilk üçünü dikkate almamız gerektiğini biliyoruz:

source: Dive into other arguments of ``Grover``
bn_bn: ``Grover`` এর অন্যান্য আরগুমেন্ট উদ্ঘাটন করা
es_un: Sumergirse en otros argumentos de ``Grover``
fr_fr: Détails sur d'autres arguments de ``Grover``
ko_kr: ``Grover`` 의 여러 인수들에 대하여 알아보기
pl: Poznaj inne argumenty ``Grover``
ru: Ознакомление с другими аргументами ``Grover``
ta_in: ``Grover`` இன் பிற வாதங்களுக்கு முழுக்கு
te: ``గ్రోవర్`` యొక్క ఇతర వాదనలలోకి ప్రవేశించండి
tr_tr: ``Grover``ın diğer argümanlarına dalın

source: ``Grover`` has arguments other than ``oracle`` and ``state_preparation``. We will explain them in this section.
bn_bn: ``Grover`` এর ``oracle`` এবং ``state_preparation`` ছাড়াও অন্যান্য আরগুমেন্ট আছে। এই অনুচ্ছেদে আমরা তা ব্যাখ্যা করব।
es_un: ``Grover`` tiene otros argumentos además de ``oracle`` y ``state_preparation``. Los explicaremos en este apartado.
fr_fr: ``Grover`` admet des arguments autres que ``oracle`` et ``state_preparation``. Nous les expliquerons dans cette section.
ko_kr: ``Grover`` 는 ``oracle`` 과 ``state_preparation`` 이외에도 여러 인수들을 가지고 있다. 이 섹션에서는 이에 대하여 설명할 것이다.
pl: ``Grover`` ma inne argumenty niż ``oracle`` i ``state_preparation``. Wyjaśnimy je w tej sekcji.
ru: Помимо ``oracle`` и ``state_preparation``, у ``Grover`` есть и другие аргументы. Мы объясним их в этом разделе.
ta_in: ``Grover`` க்கு ``oracle`` மற்றும் `` state_preparation`` தவிர வேறு வாதங்கள் உள்ளன. அவற்றை இந்த பகுதியில் விளக்குவோம்.
te: ``గ్రోవర్``కు ``ఒరాకిల్`` మరియు ``స్టేట్_ప్రిపరేషన్`` కాకుండా ఇతర వాదనలు ఉన్నాయి. మేము వాటిని ఈ విభాగంలో వివరిస్తాము.
tr_tr: "Grover", "oracle" ve ``state_preparation`` dışında bağımsız değişkenlere sahip. Bunları bu bölümde açıklayacağız.

source: Specifying ``good_state``
bn_bn: ``good_state`` - ``সুষম_অবস্থা`` নির্দিষ্টকরন:
es_un: Especificar el ``good_state``
fr_fr: Spécification de ``good_state``
ko_kr: ``good_state`` 를 지정하기
pl: Określenie ``good_state``
ru: Уточнение ``good_state``
ta_in: ``good_state`` யை குறிப்பிடுகிறது
te: ``మంచి_స్టేట్``ని పేర్కొంటోంది
tr_tr: ``good_state`` belirtilmesi

source: ``good_state`` is used to check whether the measurement result is correct or not internally. It can be a list of binary strings, a list of integer, ``Statevector``, and Callable. If the input is a list of bitstrings, each bitstrings in the list represents a good state. If the input is a list of integer, each integer represent the index of the good state to be :math:`|1\rangle`. If it is a ``Statevector``, it represents a superposition of all good states.
bn_bn: ইন্টারনালি পরিমাপন ফল সঠিক হচ্ছে কিনা তা যাচাই করতে ``good_state`` ব্যবহার করা হয়। এটা বাইনারি স্ট্রিং এর একটি লিস্ট হতে পারে, আবার ইন্টেজার, ``Statevector`` কিংবা কলেবল হতে পারে। যদি ইনপুট একটি ইন্টেজারের লিস্ট হয়, তাহলে প্রত্যেকটা ইন্টেজার সুষম অবস্থার ধারা হিসেবে :math:`|1\rangle` দেখায়। আর যদি এটা একটা ``Statevector`` হয়, তাহলে সব সুষম অবস্থার সুপারপজিশন দেখায়।
es_un: ``good_state`` se utiliza para comprobar si el resultado de la medición es correcto o no internamente. Puede ser una lista de cadenas binarias, una lista de enteros, ``Statevector`` y Callable. Si la entrada es una lista de cadenas de bits, cada cadena de bits de la lista representa un estado correcto. Si la entrada es una lista de números enteros, cada número entero representa el índice del estado correcto que será :math:`|1\rangle`. Si es un ``Statevector``, representa una superposición de todos los estados correctos.
fr_fr: ``good_state`` est utilisé pour vérifier si le résultat de mesure est correct ou non. Il peut s'agir d'une liste de chaînes binaires, d'une liste de nombres entiers, d'une instance de ``Statevector`` ou d'un Callable. Si l'entrée est une liste de chaînes de binaire, chaque chaîne de la liste représente un état correct à rechercher. Si l'entrée est une liste d'entiers, chaque entier représente l'indice du qubit qui doit être à :math:`|1\rangle`. S'il s'agit d'une instance de ``Statevector``alors tous les états à rechercher doivent être en superposition dans l'instance de ``Statevector`` passée.
ko_kr: ``good_state`` 는 측정 결과가 내부적으로 올바른지 여부를 확인하는 데 사용된다. 이는 바이너리 문자열 리스트, 정수 리스트, ``Statevector`` 및 Callable일 수 있다. 입력이 비트 문자열 리스트인 경우 리스트의 각 비트 문자열은 좋은 상태(good state)를 나타낸다. 입력이 정수 리스트인 경우 각 정수는 좋은 상태의 인덱스가 :math:`|1\rangle` 임을 나타낸다. 입력이 ``Statevector`` 이면 모든 좋은 상태의 중첩을 나타낸다.
pl: ``good_state`` jest używany do sprawdzania czy wynik pomiaru jest wewtrzętnie poprawny, czy nie. Może to być lista ciągów binarnych, lista liczb całkowitych, ``Statevector``, i obiekt wywoływalny (ang. callable). Jeśli dane wejściowe są listą ciągów bitów, każdy ciąg bitów na liście reprezentuje dobry stan. Jeśli dane wejściowe są listą liczby całkowitych, każda liczba całkowita reprezentuje indeks stanu dobrego :math:`|1\rangle`. Jeśli to ``Statevector``, reprezentują one superpozycję wszystkich dobrych stanów.
ru: ``good_state`` используется для внутренней проверки правильности или неправильности результата измерения. Это может быть список битовых строк, список целых чисел, ``Statevector`` и название состояния (Callable). Если входными данными является список битовых строк, каждая битовая строка в списке представляет хорошее состояние. Если входными данными является список целых чисел, то каждое целое число представляет индекс хорошего состояния :math:`|1\rangle`. Если это ``Statevector``, то он представляет собой суперпозицию всех хороших состояний.
ta_in: அளவீட்டு முடிவு சரியானதா அல்லது உள்நாட்டில் இல்லையா என்பதைச் சரிபார்க்க ``good_state`` பயன்படுத்தப்படுகிறது. இது பைனரி சரங்களின் பட்டியல், முழு எண்களின் பட்டியல், ``Statevector``, மற்றும் அழைக்கக்கூடியது. உள்ளீடு பிட்ஸ்ட்ரிங்ஸின் பட்டியல் என்றால், பட்டியலில் உள்ள ஒவ்வொரு பிட்ஸ்ட்ரிங்ஸும் ஒரு நல்ல நிலையைக் குறிக்கும். உள்ளீடு முழு எண்ணின் பட்டியலாக இருந்தால், ஒவ்வொரு முழு எண்ணும் நல்ல நிலையின் குறியீட்டைக் குறிக்கும் :math:`|1\rangle`. இது ஒரு ``Statevector`` என்றால், இது அனைத்து நல்ல மாநிலங்களின் சூப்பர் போசிஷனைக் குறிக்கிறது.
te: కొలత ఫలితం సరైనదేనా లేదా అంతర్గతంగా కాదా అని తనిఖీ చేయడానికి ``గుడ్_స్టేట్`` ఉపయోగించబడుతుంది. ఇది బైనరీ స్ట్రింగ్‌ల జాబితా, పూర్ణాంకాల జాబితా, ``స్టేవెక్టర్`` మరియు కాల్ చేయదగినది కావచ్చు. ఇన్‌పుట్ బిట్‌స్ట్రింగ్‌ల జాబితా అయితే, జాబితాలోని ప్రతి బిట్‌స్ట్రింగ్‌లు మంచి స్థితిని సూచిస్తాయి. ఇన్‌పుట్ పూర్ణాంకాల జాబితా అయితే, ప్రతి పూర్ణాంకం మంచి స్థితి యొక్క సూచికను సూచిస్తుంది :math:`|1\rangle`. ఇది ``స్టేవెక్టర్`` అయితే, ఇది అన్ని మంచి రాష్ట్రాల సూపర్‌పొజిషన్‌ను సూచిస్తుంది.
tr_tr: ``good_state`` ölçüm sonucunun doğru olup olmadığını veya dahili olmadığını kontrol etmek için kullanılır. İkili karakter dizilerinin listesi, tam sayı (integer) listesi, ``Statevector`` ve çağrılabilir olabilir. Eğer girdi bit dizisi listesi ise listedeki her bit dizisi bir istenilen durumu temsil eder. Eğer girdi bir tam sayı listesi ise her tam sayı, :math:`|1\rangle` olması için istenilen durumun indeksini temsil eder. Eğer bir ``Statevector`` ise istenilen bütün durumların süperpozisyonunu temsil eder.

source: The number of ``iterations``
bn_bn: ``পুনরাবৃত্তির`` সংখ্যা
es_un: El número de ``iterations``
fr_fr: Le nombre d'itérations (``iteration``)
ko_kr: ``iterations`` 의 횟수
pl: Liczba ``iterations``
ru: Число итераций ``iterations``
ta_in: ``iterations`` எண்ணிக்கை
te: `` పునరావృత్తులు`` సంఖ్య
tr_tr: ``iterations`` sayısı

source: The number of repetition of applying the Grover operator is important to obtain the correct result with Grover’s algorithm. The number of iteration can be set by the ``iteration`` argument of ``Grover``. The following inputs are supported: \* an integer to specify a single power of the Grover operator that’s applied \* or a list of integers, in which all these different powers of the Grover operator are run consecutively and after each time we check if a correct solution has been found
bn_bn: গ্রোভারের অ্যালগরিদমের মাধ্যমে সঠিক ফলাফল পেতে গ্রোভার অপারেটর প্রয়োগের পুনরাবৃত্তির সংখ্যা গুরুত্বপূর্ণ। পুনরাবৃত্তির সংখ্যা ``Grover`` এর ``iteration`` আরগুমেন্ট দ্বারা সেট করা যেতে পারে। সাপোর্টেড ইনপুটগুলো নিম্নরূপ: গ্রোভার অপারেটরের সূচক নির্দিষ্ট করতে একটি \*ইন্টেজার অথবা এটি \*ইন্টেজারের লিস্ট, যেগুলোতে এইসব গ্রোভার অপারেটরের সূচকগুলো বারবার এবং প্রত্যেকবার আমাদের চেক করার পর সঠিক সমাধান খুঁজে পাওয়া গেছে কিনা জেনে সম্পাদিত হয়
es_un: El número de repeticiones de aplicar el operador de Grover es importante para obtener el resultado correcto con el algoritmo de Grover. El número de iteraciones se puede establecer mediante el argumento ``iteration`` de ``Grover``. Se admiten las siguientes entradas: \* un número entero para especificar una sola potencia del operador Grover que se aplica \* o una lista de enteros, en la que todas estas diferentes potencias del operador Grover se ejecutan consecutivamente y después de cada ejecución comprobamos si se ha encontrado una solución correcta
fr_fr: Le nombre de répétitions d'application de l'opérateur Grover est important pour obtenir le résultat correct avec l'algorithme de Grover. Le nombre d'itérations peut être défini par l'argument ``iteration`` de ``Grover``. Les entrées suivantes sont prises en charge : \* un entier pour spécifier le nombre d'itérations de l'opérateur Grover qui doivent être appliquées \* ou une liste d'entiers, représentant les itérations de l'opérateur Grover à exécuter consécutivement et entre lesquelles nous pouvons vérifier si une solution correcte a été trouvée
ko_kr: Grover 알고리즘을 사용하여 올바른 결과를 얻으려면 Grover 연산자를 적용하는 반복 횟수가 중요하다. 반복 횟수는 ``Grover`` 의 ``iteration`` 인수로 설정할 수 있다. 다음과 같은 입력이 지원된다: \* 적용되는 Grover 연산자의 단일 거듭 제곱(a single power) 을 지정하는 정수 \* 또는 Grover 연산자의 이러한 모든 서로 다른 거듭 제곱이 연속적으로 실행되며 올바른 솔루션을 찾았다면 매번 다음과 같은지 확인한다.
ru: Для получения правильного результата работы алгоритма Гровера важно правильное количество применений оператора. Число итераций может быть установлено с помощью аргумента ``iteration`` в ``Grover``. Поддерживаются следующие входные данные: \* целое число, задающее итоговую степень оператора Гровера, или \* список целых чисел, в этом случае оператор будет применяться сериями соответствующих длин с промежуточной проверкой результата
ta_in: க்ரோவரின் வழிமுறையுடன் சரியான முடிவைப் பெற க்ரோவர் ஆபரேட்டரைப் பயன்படுத்துவதற்கான எண்ணிக்கை மீண்டும் முக்கியமானது. மறு செய்கையின் எண்ணிக்கையை ``Grover`` இன் ``iteration`` வாதத்தால் அமைக்கலாம். பின்வரும் உள்ளீடுகள் ஆதரிக்கப்படுகின்றன: \ * பயன்படுத்தப்படும் க்ரோவர் ஆபரேட்டரின் ஒற்றை சக்தியைக் குறிப்பிடுவதற்கான ஒரு முழு எண் \ * அல்லது முழு எண்களின் பட்டியல், இதில் க்ரோவர் ஆபரேட்டரின் இந்த வெவ்வேறு சக்திகள் அனைத்தும் தொடர்ச்சியாக இயங்குகின்றன, ஒவ்வொரு முறையும் சரியான தீர்வு காணப்பட்டதா என்பதை நாம் சரிபார்க்கிறோம்
tr_tr: Grover operatörünün uygulanmasının tekrar sayısı, Grover algoritması ile doğru sonuç elde etmek için önemlidir. İterasyon sayısı ``Grover`` ın ``iteration`` argümanı ile ayarlanabilmektedir. Aşağıdaki girdiler desteklenir: \* uygulanan Grover operatörünün tek bir kuvvetini belirtmek için bir tam sayı \* veya Grover operatörünün tüm bu farklı kuvvetlerinin arka arkaya çalıştırıldığı ve her seferinde doğru bir çözüm bulunup bulunmadığını kontrol ettiğimiz tam sayıların bir listesi
