Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/06_qaoa.po
Languages: es_un, fr_fr, id_id, ja_jp, ko_kr, pt_br, ta_in, vi_vn

source: This page was generated from `tutorials/algorithms/06_qaoa.ipynb`__.
es_un: Esta página fue generada a partir de `tutorials/algorithms/06_qaoa.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/algorithms/06_qaoa.ipynb`__.
id_id: Halaman ini dihasilkan dari ` tutorials/algoritms/06_qaoa.ipynb ` __.
ja_jp: このページは `tutorials/algorithms/06_qaoa.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/algorithms/06_qaoa.ipynb`__ 로부터 생성되었다.
pt_br: Esta página foi gerada, a partir do `tutorials/algorithms/06_qaoa.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/algorithms/06_qaoa.ipynb`__இலிருந்து உருவாக்கப்பட்டது.
vi_vn: Trang này được tạo từ `tutorials/algorithms/06_qaoa.ipynb`__.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/06_qaoa.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/06_qaoa.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le ` IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/06_qaoa.ipynb>` _.
id_id: Jalankan secara interaktif di ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/06_qaoa.ipynb>` _.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/06_qaoa.ipynb>`_ でインタラクティブに実行します。
ko_kr: `IBM 퀀텀 랩 <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/06_qaoa.ipynb>`_ 에서 대화식으로 실행하시오.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/06_qaoa.ipynb>`_.
ta_in: `IBM குவாண்டம் ஆய்வகத்தில் <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/06_qaoa.ipynb>` _ இல் ஊடாடும் வகையில் இயக்கவும்.
vi_vn: Chạy tương tác trực tiếp trong `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/02_vqe_convergence.ipynb>`_.

source: Quantum Approximate Optimization Algorithm
es_un: Algoritmo Cuántico de Optimización Aproximada
fr_fr: Algorithme d'optimisation Approximé Quantum
id_id: Algoritma Perkiraan Optimisasi Kuantum
ko_kr: 양자 근사 최적화 알고리즘 (Quantum Approximate Optimization Algorithm)
pt_br: Algoritmo De Otimização Quântica Aproximada
ta_in: குவாண்டம் தோராயமான உகப்பாக்கம் அல்காரிதம்
vi_vn: Thuật toán Tối ưu hóa xấp xỉ lượng tử

source: Qiskit has an implementation of the Quantum Approximate Optimization Algorithm `QAOA <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QAOA.html>`__ and this notebook demonstrates using it for a graph partition problem.
es_un: Qiskit tiene una implementación del Algoritmo Cuántico de Optimización Aproximada (Quantum Approximate Optimization Algorithm) en `QAOA <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QAOA.html>`__ y este cuaderno muestra su uso para un problema de partición de grafos.
fr_fr: Qiskit dispose d'une implémentation de l'algorithme QAOA <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QAOA.html>` __ et ce bloc-notes démontre son utilisation pour un problème de partition graphique.
id_id: Qiskit memiliki implementasi dari Quantum Approximate Optimization Algoritma ` QAOA <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QAOA.html>` __ dan notebook ini menunjukkan cara menggunakannya untuk masalah partisi graph.
ja_jp: Qiskit には Quantum Approximate Optimization Algorithm `QAOA <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QAOA.html>`__ の実装があり、このノートブックではグラフ分割問題への適用方法を実演します。
ko_kr: 키스킷에는 양자 근사 최적화 알고리즘 `QAOA <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QAOA.html>`__ 이 구현되어 있다. 이 노트북은 그래프 분할 (graph partition) 문제에 이를 적용하는 방법을 시연할 것이다.
pt_br: O Qiskit possui uma implementação do algoritmo de otimização quântica aproximada `QAOA <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QAOA.html>`__ e este notebook demonstra a sua utilização para um problema de partição de grafos.
ta_in: குவாண்டம் தோராயமான உகப்பாக்கம் அல்காரிதம் `QAOA <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QAOA.html>` __ இன் செயல்பாட்டை Qiskit கொண்டுள்ளது, மேலும் இந்த நோட்புக் ஒரு வரைபட பகிர்வு சிக்கலுக்கு அதைப் பயன்படுத்துவதை நிரூபிக்கிறது.
vi_vn: Qiskit có triển khai Thuật toán Tối ưu hóa xấp xỉ lượng tử `QAOA <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QAOA.html>`__ và cuốn sổ này thể hiện cách sử dụng nó cho bài toán phân vùng đồ thị.

source: While QAOA can be directly used it often more convenient to use it in conjunction with the Optimization module. See the Optimization tutorials for more information.
es_un: Aunque el QAOA puede se usado de manera directa, comúnmente es más conveniente usarlo en conjunto con el modulo de Optimización. Vea los tutoriales de Optimización para más información.
fr_fr: Bien que QAOA puisse être utilisé directement, il est souvent plus pratique de l'utiliser conjointement avec le module d'optimisation. Pour plus d'informations, reportez-vous aux tutoriels d'optimisation.
id_id: Sementara QAOA dapat langsung digunakan seringkali lebih nyaman untuk menggunakannya dengan modul Optimisasi. Lihat tutorial Optimisasi untuk informasi lebih lanjut.
ja_jp: QAOA を直接的に用いることもできますが、最適化モジュールと組み合わせて使用すると便利です。詳細については、 Optimization チュートリアルを参照してください。
ko_kr: QAOA는 직접 사용할 수도 있지만, 최적화 모듈과 함께 사용하는 것이 더 편리하다. 자세한 내용은 최적화 사용 지침서를 참조하라.
pt_br: Embora o QAOA pode ser utilizado diretamente, é muitas vezes mais conveniente usá-lo em conjunto com o módulo Optimization. Veja os tutoriais de Optimization para obter mais informações.
ta_in: QAOA ஐ நேரடியாகப் பயன்படுத்தலாம் என்றாலும், உகப்பாக்கம் தொகுதிடன் இணைந்து அதைப் பயன்படுத்துவது பெரும்பாலும் வசதியானது. மேலும் தகவலுக்கு உகப்பாக்கம் பயிற்சிகளைப் பார்க்கவும்.
vi_vn: Tuy QAOA có thể được sử dụng trực tiếp, sẽ thuận tiện hơn khi sử dụng nó kết hợp với mô-đun tối ưu hóa. Xem các Hướng dẫn Tối ưu hóa để biết thêm chi tiết.

source: First we create a random graph and draw it so it can be seen.
es_un: Primero creamos un grafo aleatorio y lo dibujamos para poder verlo.
fr_fr: Tout d'abord, nous créons un graphique aléatoire et le dessinons pour qu'il puisse être vu.
id_id: Pertama kita membuat graph acak dan meggambarnya untuk melihatnya.
ja_jp: まずランダムなグラフを作成し、可視化します。
ko_kr: 먼저 무작위 그래프를 생성하고 이를 그려서 확인해보자.
pt_br: Primeiro criamos um grafo aleatório e o desenhamos para que ele possa ser visto.
ta_in: முதலில் நாம் ஒரு சீரற்ற வரைபடத்தை உருவாக்கி அதை வரைகிறோம், எனவே அதைக் காணலாம்.
vi_vn: Đầu tiên chúng ta tạo ra một đồ thị ngẫu nhiên và vẽ nó để nó được hiển thị.

source: The brute-force method is as follows. Basically, we exhaustively try all the binary assignments. In each binary assignment, the entry of a vertex is either 0 (meaning the vertex is in the first partition) or 1 (meaning the vertex is in the second partition). We print the binary assignment that satisfies the definition of the graph partition and corresponds to the minimal number of crossing edges.
es_un: El método de fuerza bruta es el siguiente. Básicamente, intentamos todos las asignaciones binarias de manera exhaustiva. En cada asignación, la entrada del vértice va a ser o 0 (que significa que el vértice esta en la primera partición) o 1 (que significa que el vértice esta en la segunda partición). Imprimimos la asignación binaria que satisface la definición de la partición de grafos y corresponde con el mínimo numero de bordes cruzados.
fr_fr: La méthode brute-force est la suivante. En résumé, toutes les affectations binaires sont tentées. Dans chaque affectation binaire, l'entrée d'un sommet est soit 0 (ce qui signifie que le sommet est dans la première partition) soit 1 (ce qui signifie que le sommet est dans la deuxième partition). Nous imprimons l'assignation binaire qui satisfait à la définition de la partition graphique et qui correspond au nombre minimal de bords croisés.
id_id: Metode brute-force adalah sebagai berikut. Pada dasarnya, kita membabi buta mencoba semua alokasi biner. Di setiap alokasi biner, entri dari sebuah vertex adalah baik 0 (artinya vertex berada pada partisi pertama) atau 1 (artinya vertex berada pada partisi kedua). Kita print alokasi biner yang memenuhi definisi dari partisi graph dan sesuai dengan jumlah minimal dari edge yang bersilangan.
ja_jp: 総当たり法は以下の通りです。基本的には、あらゆる二進数の割り当てを網羅的に試します。それぞれの二進数の割り当てでは、頂点の値は 0 (その頂点が第一パーティションにあることを示す) か、 1 (その頂点が第二パーティションにあることを示す) のいずれかとなっています。グラフ分割の定義を満たし、パーティション間の辺の数が最小となる場合に対応する二進数の割り当てを表示します。
ko_kr: 무차별 대입(brute-force) 방법은 다음과 같다. 기본적으로 철저히 모든 경우의 수에 대하여 바이너리 할당(binary assignment) 을 시도한다. 각 바이너리 할당에서 꼭짓점의 항목은 0 (꼭짓점이 첫 번째 분할 영역에 있음을 의미) 또는 1 (꼭짓점이 두 번째 분할 영역에 있음을 의미) 이다. 그래프 분할의 정의를 충족하면서 모서리 교차횟수가 최소인 바이너리 할당 결과를 출력한다.
pt_br: O método exaustivo é o seguinte. Basicamente, tentamos exaustivamente todas as atribuições binárias. Em cada atribuição binária, a entrada de um vértice é ou 0 (significando que o vértice está na primeira partição) ou 1 (ou seja, o vértice está na segunda partição). Nós imprimimos a atribuição binária que satisfaz a definição da partição do gráfico e que corresponde ao número mínimo de arestas de cruzamento.
ta_in: முரட்டு-சக்தி முறை பின்வருமாறு. அடிப்படையில், அனைத்து பைனரி பணிகளையும் நாங்கள் முழுமையாக முயற்சிக்கிறோம். ஒவ்வொரு பைனரி ஒதுக்கீட்டிலும், ஒரு வெர்டெக்ஸின் நுழைவு 0 (அதாவது வெர்டெக்ஸ் முதல் பகிர்வில் உள்ளது) அல்லது 1 (அதாவது வெர்டெக்ஸ் இரண்டாவது பகிர்வில் உள்ளது). வரைபட பகிர்வின் வரையறையை பூர்த்திசெய்யும் பைனரி அசைன்மென்ட்டை நாங்கள் அச்சிடுகிறோம், மேலும் குறைந்த எண்ணிக்கையிலான குறுக்கு விளிம்புகளுக்கு ஒத்திருக்கிறது.
vi_vn: Phương pháp brute-force như sau: về cơ bản, chúng ta thử hoàn toàn tất cả các phép gán nhị phân. Trong mỗi phép gán nhị phân, mục nhập của đỉnh là 0 (có nghĩa là đỉnh nằm trong phân hoạch đầu tiên) hoặc 1 (có nghĩa là đỉnh nằm trong phân hoạch thứ hai). Chúng ta in ra phép gán nhị phân thỏa mãn định nghĩa của phân hoạch đồ thị và tương ứng với số cạnh chéo nhỏ nhất.

source: The graph partition problem can be converted to an Ising Hamiltonian. Qiskit has different capabilities in the Optimization module to do this. Here, since the goal is to show QAOA, the module is used without further explanation to create the operator. The paper `Ising formulations of many NP problems <https://arxiv.org/abs/1302.5843>`__ may be of interest if you would like to understand the technique further.
es_un: El problema de la partición de gráficas se puede convertir a un Hamiltoniano de Ising. Qiskit tiene diferentes capacidades en el módulo de Optimización para hacer esto. Aquí, dado que el objetivo es mostrar QAOA, el módulo se usa sin más explicación para crear el operador. El artículo `Ising formulations of many NP Problems <https://arxiv.org/abs/1302.5843>`__ puede ser de interés si desea comprender mejor la técnica.
fr_fr: Le problème de la partition graphique peut être converti en un Hamiltonien Ising. Qiskit dispose de différentes capacités dans le module d'optimisation pour ce faire. Ici, puisque l'objectif est de montrer QAOA, le module est utilisé sans explication supplémentaire pour créer l'opérateur. L'article `Ising formulations of many NP problems <https://arxiv.org/abs/1302.5843>`__ peut être intéressant si vous souhaitez mieux appréhender la technique.
ja_jp: グラフ分割問題は、イジング・ハミルトニアンに変換することができます。 Qiskit では、これを実行するため最適化モジュールに別の機能が用意されています。ここでは QAOA を実演することが目的なので、演算子を作成するためのモジュールについては、これ以上説明せずに用いることとします。 `Ising formulations of many NP problems <https://arxiv.org/abs/1302.5843>`__ という論文は、この手法をより理解したいという方に興味深いかもしれません。
ko_kr: 그래프 분할 문제는 이징 해밀토니안 (Ising Hamiltonian)으로 변환할 수 있다. 키스킷은 이를 수행하기 위하여 최적화 모듈에서 다양한 기능을 제공한다. 여기서 목표는 QAOA를 보여주는 것이므로 추가 설명 없이 모듈을 사용하여 연산자를 생성한다. 위의 기술을 더 이해하고 싶다면 다음의 논문 `Ising formulations of many NP problems <https://arxiv.org/abs/1302.5843>`__이 흥미로울 것이다.
pt_br: O problema de partição de gráfico pode ser convertido em um Hamiltoniano de Ising. Qiskit tem diferentes recursos no módulo Optimization para fazer isso. Aqui, já que o objetivo é mostrar o QAOA, o módulo é usado sem mais explicações para criar o operador. O artigo `Ising formulations of many NP problems <https://arxiv.org/abs/1302.5843>`__ pode ser de interesse se você quiser entender mais a técnica.
ta_in: வரைபட பகிர்வு சிக்கலை ஐசிங் ஹாமில்டோனியனாக மாற்றலாம். இதைச் செய்வதற்கான உகப்பாக்கம் தொகுதியில் கிஸ்கிட் வெவ்வேறு திறன்களைக் கொண்டுள்ளது. இங்கே, QAOA ஐக் காண்பிப்பதே குறிக்கோள் என்பதால், ஆபரேட்டரை உருவாக்க தொகுதி மேலும் விளக்கம் இல்லாமல் பயன்படுத்தப்படுகிறது. `Ising formulations of many NP problems<https://arxiv.org/abs/1302.5843>` __ நீங்கள் நுட்பத்தை மேலும் புரிந்து கொள்ள விரும்பினால் ஆர்வமாக இருக்கலாம்.

source: So lets use the QAOA algorithm to find the solution.
es_un: Entonces, usemos el algoritmo QAOA para encontrar la solución.
fr_fr: Utilisons donc l'algorithme QAOA pour trouver la solution.
id_id: Jadi mari kita gunakan algoritma QAOA untuk menemukan solusinya.
ja_jp: では QAOA アルゴリズムを用いて、解を求めましょう。
ko_kr: QAOA를 사용하여 솔루션을 찾아보자.
pt_br: Então vamos usar o algoritmo de QAOA para encontrar a solução.
ta_in: எனவே தீர்வைக் காண QAOA வழிமுறையைப் பயன்படுத்தலாம்.
vi_vn: Hãy sử dụng thuật toán QAOA để tìm lời giải.

source: The outcome can be seen to match to the value computed above by brute force. But we can also use the classical ``NumPyMinimumEigensolver`` to do the computation, which may be useful as a reference without doing things by brute force.
es_un: Se puede notar que el resultado coincide con el valor calculado por fuerza bruta. Pero también podemos usar el ``NumPyMinimumEigensolver`` clásico para hacer el calculo, lo cual puede ser útil como referencia sin tener que recurrir a la fuerza bruta.
fr_fr: Le résultat peut être considéré comme correspondant à la valeur calculée ci-dessus par la force brute. Mais nous pouvons aussi utiliser le classique ` ` NumPyMinimumEigensolver ` ` pour faire le calcul, ce qui peut être utile comme référence sans faire les choses par la force brute.
id_id: Hasilnya dapat dilihat cocok dengan nilai yang dihitung di atas dengan brute force. Tapi kita juga dapat menggunakan cara klasik ` ` NumPyMinimumEigensolver ` ` untuk melakukan komputasi, yang mungkin berguna sebagai referensi tanpa melakukan dengan brute force.
ja_jp: 結果は、上記の総当たり法で計算された値に一致していることがわかります。一方、古典的な ``NumPyMinimumEigensolver`` によって計算を行うこともできます。この方法は、総当たり法を用いずに参照値を得る上で役に立つでしょう。
ko_kr: 도출된 결과는 위에서 무차별 대입으로 계산한 값과 일치하는 것을 확인할 수 있다. 그러나 또한 우리는 기존의 ``NumPyMinimumEigensolver`` 를 사용하여 계산을 수행할 수 있는데, 이는 무차별 대입을 수행하지 않는 다는 점에서 참조하면 유용할 것이다.
pt_br: Pode-se ver que o resultado está de acordo com o valor calculado acima exaustivamente. Mas também podemos usar o ``NumPyMinimumEigensolver`` clássico para fazer a computação, que pode ser útil como referência sem fazer as coisas exaustivamente.
ta_in: முரட்டு சக்தியால் மேலே கணக்கிடப்பட்ட மதிப்புடன் பொருந்தக்கூடிய விளைவைக் காணலாம். ஆனால் கணக்கீட்டைச் செய்ய கிளாசிக்கல் `` NumPyMinimumEigensolver`` ஐப் பயன்படுத்தலாம், இது முரட்டுத்தனமாக விஷயங்களைச் செய்யாமல் ஒரு குறிப்பாக பயனுள்ளதாக இருக்கும்.
vi_vn: Kết quả có thể được hiển thị sao cho phù hợp với giá trị được tính bởi brute-force bên trên. Nhưng chúng ta cũng có thể dùng ``NumPyimumeigensolver`` cổ điển để làm tính toán và sử dụng nó như một tham chiếu mà không làm với brute-force.

source: It is also possible to use VQE as is shown below
es_un: También es posible utilizar el VQE como se muestra a continuación
fr_fr: Il est également possible d'utiliser VQE comme indiqué ci-dessous
id_id: Juga mungkin menggunakan VQE seperti yang ditunjukkan di bawah ini
ja_jp: また、以下のようにして VQE を用いることも可能です。
ko_kr: 아래와 같이 VQE를 사용할 수도 있다.
pt_br: Também é possível utilizar o VQE como é mostrado abaixo
ta_in: கீழே காட்டப்பட்டுள்ளபடி VQE ஐப் பயன்படுத்தவும் முடியும்
vi_vn: Cũng có thể sử dụng VQE như cách dưới đây
