Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/07_grover_examples.po
Languages: bn_bn, es_un, fr_fr, ko, pt_br, ru, sw_ke, ta_in, te, tr_tr, zh_tw

source: This page was generated from `tutorials/algorithms/07_grover_examples.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/algorithms/07_grover_examples.ipynb`__ -থেকে নেওয়া হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/algorithms/07_grover_examples.ipynb`__.
fr_fr: Cette page a été générée puis traduite à partir de `tutorials/algorithms/07_grover_examples.ipynb`__.
ko: 이 페이지는 `tutorials/algorithms/07_grover_examples.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada, a partir de `tutorials/algorithms/07_grover.ipynb`__.
ru: Эта страница создана на основе `tutorials/algorithms/07_grover_examples.ipynb`__.
sw_ke: Ukurasa huu umezalishwa kutoka `tutorials/algorithms/07_grover_examples.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/algorithms/07_grover_examples.ipynb`__. லிருந்து உருவாக்கப்பட்டது.
te: ఈ పేజీ `tutorials/algorithms/07_grover_examples.ipynb`__ నుండి రూపొందించబడింది.
tr_tr: Bu sayfa, `tutorials/algorithms/07_grover_examples.ipynb`__ adresinden oluşturulmuştur.
zh_tw: 此頁面是從 `tutorials/algorithms/07_grover_examples.ipynb`__所產生的。

source: Grover’s algorithm examples
bn_bn: Grover এর অ্যালগরিদমের উদাহরণ​সমূহ
es_un: Ejemplos de algoritmos de Grover
fr_fr: Exemples d'utilisations de l'algorithme de Grover
ko: 그로버 알고리즘 예제들
pt_br: Exemplos do algoritmo de Grover
ru: Примеры применения алгоритма Гровера
sw_ke: Mifano ya alogaridhimu ya Grover
ta_in: க்ரோவர் வழிமுறையின் எடுத்துக்காட்டுகள்
tr_tr: Grover algoritması örnekleri
zh_tw: Grover 演算法範例

source: This notebook has examples demonstrating how to use the Qiskit `Grover <https://qiskit.org/documentation/stubs/qiskit.algorithms.Grover.html>`__ search algorithm, with different oracles.
bn_bn: বিভিন্ন ওরাকেল ব্যবহার করে কিভাবে Qiskit Grover <https://qiskit.org/documentation/stubs/qiskit.algorithms.Grover.html> এর অনুসন্ধান অ্যালগোরিথম ব্যবহার করতে হ​য় তা এই নোটবুকে দেখানো হয়েছে।
es_un: Este cuaderno tiene ejemplos que demuestran cómo usar el algoritmo de búsqueda de `Grover <https://qiskit.org/documentation/stubs/qiskit.algorithms.Grover.html>`__ de Qiskit, con diferentes oráculos.
fr_fr: Ce notebook présente des exemples montrant comment utiliser l'algorithme de recherche de `Grover <https://qiskit.org/documentation/stubs/qiskit.algorithms.Grover.html>`__ de Qiskit, en utilisant différents oracles.
ko: 본 노트북에는 `Grover <https://qiskit.org/documentation/stubs/qiskit.algorithms.Grover.html>`__ 검색 알고리즘을 다양한 오라클과 함께 사용하는 방법을 설명하는 예제가 있다.
pt_br: Este notebook tem exemplos demonstrando como usar o algoritmo de busca de `Grover <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Grover.html>`__ do Qiskit com diferentes oráculos.
ru: В этом блокноте приведены примеры, демонстрирующие использование поискового алгоритма Qiskit `Grover <https://qiskit.org/documentation/stubs/qiskit.algorithms.Grover.html>`__ с различными оракулами.
sw_ke: Daftari hili lina mifano inayoonyesha jinsi ya kutumia alogaridhimu ya Qiskit ya utafutaji ya `Grover <https://qiskit.org/documentation/stubs/qiskit.algorithms.Grover.html>`__, kutumia oracles tofauti tofauti.
ta_in: இந்த குறிப்பேடு Qiskit `Grover <https://qiskit.org/documentation/stubs/qiskit.algorithms.Grover.html>`__ தேடல் வழிமுறை, வெவ்வேறு ஆரக்கிள்களுடன் எவ்வாறு பயன்படுத்துவது என்பதை விளக்கும் எடுத்துக்காட்டுகள் உள்ளன.
te: వివిధ ఒరాకిల్స్‌తో Qiskit `Grover <https://qiskit.org/documentation/stubs/qiskit.algorithms.Grover.html>`__ శోధన అల్గారిథమ్‌ను ఎలా ఉపయోగించాలో వివరించే ఉదాహరణలు ఈ నోట్‌బుక్‌లో ఉన్నాయి.
tr_tr: Bu not defteri, Qiskit `Grover <https://qiskit.org/documentation/stubs/qiskit.algorithms.Grover.html>`__ arama algoritmasının nasıl kullanılacağını farklı kara kutularla (oracle) gösteren örnekleri içerir.
zh_tw: 此筆記本範例示範如何使用不同的 oracles 來執行 Qiskit `Grover <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Grover.html>`__ 搜尋演算法，

source: Finding solutions to 3-SAT problems
bn_bn: 3-SAT সমস্যার সমাধান খুজে বের করা।
es_un: Encontrar soluciones a los problemas 3-SAT
fr_fr: Trouver des solutions à des problèmes 3-SAT
ko: 3-SAT 문제에 대한 해결책 찾기
pt_br: Encontrando soluções para problemas 3-SAT
ru: Поиск решений проблемы логической выполнимости 3-SAT
sw_ke: Kutafuta suluhisho kwa matatizo ya 3-SAT
ta_in: 3-SAT சிக்கல்களுக்கு தீர்வுகளைக் கண்டறிதல்
te: 3-SAT సమస్యలకు పరిష్కారాలను కనుగొనడం
tr_tr: 3-SAT problemlerine çözümler üretme
zh_tw: 為 3-SAT 問題尋找解決方案

source: Let’s look at an example 3-Satisfiability (3-SAT) problem and walk-through how we can use Quantum Search to find its satisfying solutions. 3-SAT problems are usually expressed in `Conjunctive Normal Forms (CNF) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__ and written in the `DIMACS-CNF <http://www.satcompetition.org/2009/format-benchmarks2009.html>`__ format. For example:
bn_bn: আসুন আমরা 3-সন্তুষ্টিযোগ্যতা (3-SAT) উদাহরনের সমস্যাটি দেখি এবং কীভাবে আমরা কোয়ান্টাম অনুসন্ধান এর সন্তোষজনক সমাধানগুলি খুঁজতে পারি। 3-স্যাট সমস্যাগুলি সাধারণত `কনজেক্টিভ নরমাল ফর্মগুলিতে (CNF) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__ প্রকাশ করা হয় এবং `DIMACS-CNF <http://www.satcompetition.org/2009/format-benchmarks2009.html>`__ ফর্ম্যাটে লেখা। উদাহরণ স্বরূপ :
es_un: Veamos un ejemplo de problema de 3-Satisfabilidad (3-SAT) y veamos cómo podemos usar la búsqueda cuántica para encontrar sus soluciones satisfactorias. Los problemas de 3-SAT generalmente se expresan en `Formas normales conjuntivas (Conjunctive Normal Forms, CNF) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__ y se escriben en el formato `DIMACS-CNF <http://www.satcompetition.org/2009/format-benchmarks2009.html>`__. Por ejemplo:
fr_fr: Examinons un exemple de problème de satisfaction 3-SAT et la façon dont nous pouvons utiliser l'algorithme de recherche quantique pour trouver ses solutions. Les problèmes 3-SAT sont habituellement exprimés par une `Forme normale conjonctive (FNC) <https://fr.wikipedia.org/wiki/Forme_normale_conjonctive>`__ et écrit dans le format `DIMACS-CNF <http://www.satcompetition.org/2009/format-benchmarks2009.html>` __. Par exemple :
ko: 3-SAT (3-Satisfiability) 문제의 예를 살펴보고 양자 검색(Quantum Search)을 사용하여 만족스러운 솔루션을 찾는 방법을 살펴보겠다. 3-SAT 문제는 일반적으로 `Conjunctive Normal Forms (CNF) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__ 로 표현되고 `DIMACS-CNF <http://www.satcompetition.org/2009/format-benchmarks2009.html>`__ 형식으로 작성된다. 예를 들면:
pt_br: Vamos olhar um exemplo de problema de 3-Satisfiability (3-SAT) e avançar em como podemos usar a Busca Quântica para encontrar as soluções satisfatórias. Problemas 3-SAT geralmente são expressos em `Formas Normais Conjuntivas (CNF) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__ e escritos no formato `DIMACS-CNF <http://www.satcompetition.org/2009/format-benchmarks2009.html>`__. Por exemplo:
ru: Давайте рассмотрим пример проблемы логической выполнимости 3-SAT и проследим, как мы можем использовать квантовый поиск для нахождения удовлетворяющих её решений. Задачи 3-SAT обычно выражаются в виде`конъюнктивных нормальных форм (КНФ) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__ и записываются в формате `DIMACS-CNF <http://www.satcompetition.org/2009/format-benchmarks2009.html>`__. Например:
ta_in: ஒரு எடுத்துக்காட்டு 3-Satisfiabitlity (3-SAT) சிக்கலைப் பார்ப்போம், அதன் திருப்திகரமான தீர்வுகளைக் கண்டறிய குவாண்டம் தேடலை எவ்வாறு பயன்படுத்தலாம் என்பதைப் பார்ப்போம். 3-SAT சிக்கல்கள் வழக்கமாக `Conjunctive Normal Forms (CNF) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__ மற்றும் `DIMACS-CNF <http://www.satcompetition.org/2009/format-benchmarks2009.html>`__ முறையில் வெளிப்படுத்தலாம். உதாரணத்திற்கு:
tr_tr: Örnek bir 3-Satisfiability (3-SAT, 3-Tatmin-Edilebilirlik) problemine göz gezdirelim ve problemin tatmin edici çözümlerini bulmak için Kuantum Arama'yı nasıl kullanabileceğimizi inceleyelim. 3-SAT problemleri genellikle `Conjunctive Normal Forms (CNF) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__ biçiminde ifade edilir ve `DIMACS-CNF <http://www.satcompetition.org/2009/format-benchmarks2009.html>`__ şeklinde yazılır. Örneğin:
zh_tw: 讓我們來看看 3-Satisfiability (3-SAT)問題，以及我們如何使用量子搜尋來尋找其滿足的解決方案的範例。3-SAT 問題通常以 `Conjunctive Normal Forms (CNF) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__ 表示，並以 `DIMACS-CNF <http://www.satcompetition.org/2009/format-benchmarks2009.html>`__ 格式編寫。例如:

source: The CNF of this 3-SAT instance contains 3 variables and 5 clauses:
bn_bn: এই 3-SAT দৃষ্টান্তের (ইনস্ট্যান্স) CNF এর 3 টি চল রাশি এবং 5 টি ধারা রয়েছে:
es_un: El CNF de esta instancia 3-SAT contiene 3 variables y 5 cláusulas:
fr_fr: La FNC de cette instance 3-SAT contient 3 variables et 5 clauses :
ko: 이 3-SAT 인스턴스의 CNF에는 3개의 변수와 5개의 절이 포함된다.
pt_br: O CNF desta instância de 3-SAT contém 3 variáveis e 5 cláusulas:
ru: КНФ данного экземпляра 3-SAT содержит 3 переменные и 5 дизъюнктивных одночленов:
sw_ke: CNF ya tukio hili la 3-SAT lina vigezo 3 na vifungu 5:
ta_in: இந்த 3-SAT உதாரணம் CNF 3 மாறிகள் மற்றும் 5 உட்பிரிவுகளைக் கொண்டுள்ளது:
te: ఈ 3-SAT ఉదాహరణ యొక్క CNF 3 వేరియబుల్స్ మరియు 5 క్లాజులను కలిగి ఉంది:
tr_tr: Bu 3-SAT örneğinin CNF'si 3 değişken ve 5 madde içerir:
zh_tw: 此 3-SAT 實例的 CNF 包含 3 個變數和 5 個子句:

source: It can be verified that this 3-SAT problem instance has three satisfying solutions:
bn_bn: এটা প্রমাণ করা যেতে পারে যে এই 3-SAT সমস্যার দৃষ্টান্তের (ইনস্ট্যান্স) জন্য তিনটি সন্তোষজনক সমাধান রয়েছে:
es_un: Se puede verificar que esta instancia de problema 3-SAT tiene tres soluciones satisfactorias:
fr_fr: On peut vérifier que cette instance 3-SAT admet trois solutions satisfaisantes :
ko: 이 3-SAT 문제 인스턴스는 다음과 같은 세 가지 해결책을 갖고 있다는 것을 확인할 수 있다.
pt_br: Pode-se verificar que esta instância do problema de 3-SAT tem três soluções satisfatórias:
ru: Можно показать, что данный пример задачи 3-SAT имеет три решения, удовлетворяющих выражению выше:
sw_ke: Inaweza kuthibitishwa kuwa tukio hili la 3-SAT lina suluhisho tatu za kuridhisha:
ta_in: இந்த 3-SAT சிக்கல் உதாரணம் மூன்று திருப்திகரமான தீர்வுகளைக் கொண்டுள்ளது என்பதை சரிபார்க்க முடியும்:
te: ఈ 3-SAT సమస్య ఉదాహరణ మూడు సంతృప్తికరమైన పరిష్కారాలను కలిగి ఉందని ధృవీకరించవచ్చు:
tr_tr: Bu 3-SAT problem örneğinin üç tane tatmin edici çözümünün olduğu doğrulanabilir:
zh_tw: 可以驗證，這 3-SAT 問題實例有三個滿足的解決方案:

source: :math:`(v_1, v_2, v_3) = (T, F, T)` or :math:`(F, F, F)` or :math:`(T, T, F)`
es_un: :math:`(v_1, v_2, v_3) = (T, F, T)` o :math:`(F, F, F)` o :math:`(T, T, F)`
pt_br: :math:` (v_1, v_2, v_ 3) = (T, F, T) ` ou :math:` (F, F, F) ` ou :math:` (T, T, F) `
ru: :math:`(v_1, v_2, v_3) = (T, F, T)` или :math:`(F, F, F)` или :math:`(T, T, F)`
sw_ke: :math:`(v_1, v_2, v_3) = (T, F, T)` au :math:`(F, F, F)` au :math:`(T, T, F)`
tr_tr: :math:`(v_1, v_2, v_3) = (T, F, T)` veya :math:`(F, F, F)` veya :math:`(T, T, F)`

source: Or, expressed using the DIMACS notation:
bn_bn: অথবা DIMACS পদ্ধতির সাহায্যে প্রকাশিত করা।
es_un: O expresado usando la notación DIMACS:
fr_fr: Ou, utilisant la notation DIMACS-CNF :
ko: 또는 다음처럼 DIMACS 표기법을 사용하여 표현할 수 있다:
pt_br: Ou, expresso usando a notação DIMACS:
ru: Или используя обозначения DIMACS:
sw_ke: Au, imeonyeshwa kwa kutumia nukuu ya DIMACS:
ta_in: அல்லது, DIMACS குறியீட்டைப் பயன்படுத்தி வெளிப்படுத்தப்படுகிறது:
te: లేదా, DIMACS సంజ్ఞామానాన్ని ఉపయోగించి వ్యక్తీకరించబడింది:
tr_tr: Veya, DIMACS gösterimi kullanılarak ifade edilir:
zh_tw: 或者，使用 DIMACS 表示法表示:

source: ``1 -2 3``, or ``-1 -2 -3``, or ``1 2 -3``.
bn_bn: ``1 -2 3``, অথবা ``-1 -2 -3``, অথবা ``1 2 -3``.
es_un: ``1 -2 3``, o ``-1 -2 -3``, o ``1 2 -3``.
ko: ``1 -2 3`` 혹은 ``-1 -2 -3`` 혹은 ``1 2 -3``.
ru: ``1 -2 3``, или ``-1 -2 -3``, или ``1 2 -3``.
sw_ke: ``1 -2 3``, au ``-1 -2 -3``, au ``1 2 -3``.
ta_in: ``1 -2 3``, அல்லது ``-1 -2 -3``, அல்லது ``1 2 -3``.
tr_tr: ``1 -2 3``, veya ``-1 -2 -3``, veya ``1 2 -3``.
zh_tw: ` ` 1 -2 3`` ，或 ` -1 -2 -3``，或 ``1 2 -3``。

source: With this example problem input, we then create the corresponding ``oracle`` for our ``Grover`` search. In particular, we use the ``PhaseOracle`` component, which supports parsing DIMACS-CNF format strings and constructing the corresponding oracle circuit.
bn_bn: তারপর এই উদাহরনরত সমস্যার ইনপুট দিয়ে আমরা ``Grover`` সার্চের জন্য সাদৃশ্য ``oracle`` গঠন করি। বিশেষত আমরা ``PhaseOracle`` বর্তনীটি ব্যাবহার করি, যেটা DIMACS-CNF ধরনের স্ট্রিং বেছে নিতে এবং ওরাকল বর্তনী নির্মাণে সমর্থন করে।
es_un: Con esta entrada de problema de ejemplo, creamos el ``oracle`` correspondiente para nuestra búsqueda de ``Grover``. En particular, utilizamos el componente ``PhaseOracle``, que admite el análisis de cadenas de formato DIMACS-CNF y la construcción del correspondiente circuito de oráculo.
fr_fr: En utilisant cet exemple de problème, nous créons ensuite l'``oracle`` correspondant pour notre recherche par algorithme de ``Grover``. En particulier, nous utilisons la classe ``PhaseOracle``, qui prend en charge l'analyse syntaxique des chaînes de caractères au format DIMACS-CNF et la construction du circuit de l'oracle correspondant.
ko: 이 예제 문제 입력을 통해서 우리는 ``Grover`` 검색을 위해 해당하는 ``oracle`` 을 작성한다. 특히, 여기에는 ``PhaseOracle`` 성분을 사용하는데, 이는 DIMACS-CNF 형태 문자열의 파싱 및 대응하는 오라클 회로를 구성하는 것을 지원한다.
pt_br: Com este exemplo de problema de entrada, criamos então o ``oráculo`` correspondente para a nossa busca de ``Grover``. Em particular, utilizamos a componente ``PhaseOracle``, que suporta a interpretação de strings no formato DIMACS-CNF e a construção do circuito do oráculo correspondente.
ru: Используя исходные данные из этого примера, мы создаем соответствующий ``oracle`` для осуществления нашего поиска ``Grover``. В частности, мы используем компонент ``PhaseOracle``, который осуществляет обработку строк формата DIMACS-CNF и создает соответствующую цепь оракула.
ta_in: இந்த எடுத்துக்காட்டு சிக்கல் உள்ளீட்டைக் கொண்டு, எங்கள் ``Grover`` தேடலுக்கான தொடர்புடைய ``oracle`` ஐ உருவாக்குகிறோம். குறிப்பாக, நாங்கள் ``PhaseOracle`` கூறுகளைப் பயன்படுத்துகிறோம், இது DIMACS-CNF வடிவமைப்பு ஸ்ட்ரிஂங்களைப் பாகுபடுத்துவதற்கும் அதனுடன் தொடர்புடைய ஆரக்கிள் சர்க்யூட்களை உருவாக்குவதற்கும் துணைபுரிகிறது.
te: ఈ ఉదాహరణ సమస్య ఇన్‌పుట్‌తో, మేము మా ``గ్రోవర్`` శోధన కోసం సంబంధిత ``ఒరాకిల్``ని సృష్టిస్తాము. ప్రత్యేకించి, మేము DIMACS-CNF ఫార్మాట్ స్ట్రింగ్‌లను అన్వయించడానికి మరియు సంబంధిత ఒరాకిల్ సర్క్యూట్‌ను రూపొందించడానికి మద్దతిచ్చే ``ఫేజ్‌ఒరాకిల్`` కాంపోనెంట్‌ని ఉపయోగిస్తాము.
tr_tr: Bu örnek problem girdisiyle ``Grover`` aramamız için ilgili ``oracle``ı oluşturuyoruz. Özellikle, DIMACS-CNF biçimindeki karakter dizilerini parçalamayı ve ilgili kara kutu (oracle) devresini oluşturmayı destekleyen ``PhaseOracle`` bileşenini kullanıyoruz.

source: The ``oracle`` can now be used to create an Grover instance:
bn_bn: এখন গ্রোভার দৃষ্টান্ত তৈরি করতে ``oracle`` ব্যবহৃত হতে পারে।
es_un: El ``oracle`` ahora se puede usar para crear una instancia de Grover:
fr_fr: La variable ``oracle`` peut alors être utilisée pour créer une instance d'un problème de Grover :
ko: 이제 Grover 인스턴스를 생성하는 데 ``oracle`` 을 사용할 수 있다.
pt_br: O ``oráculo`` agora pode ser usado para criar uma instância de Grover:
ru: Теперь ``oracle`` (оракул) можно использовать для создания экземпляра класса Grover:
sw_ke: ``Oracle`` sasa inaweza kutumika kuunda tukio la Grover:
ta_in: க்ரோவர் உதாரணத்தை உருவாக்க ``oracle`` இப்போது பயன்படுத்தப்படலாம்:
te: గ్రోవర్ ఉదాహరణను సృష్టించడానికి ఇప్పుడు ``ఒరాకిల్``ని ఉపయోగించవచ్చు:
tr_tr: Şimdi, bir Grover örneği oluşturmak için ``oracle`` kullanılabilir:
zh_tw: 現在可以使用 ``oracle`` 來建立 Grover 實例:

source: We can then configure the backend and run the Grover instance to get the result:
bn_bn: আর তারপর আমরা ফলাফল পেতে ব্যাকএন্ড এবং গ্রোভার দৃষ্টান্ত গুছিয়ে নিতে পারি:
es_un: Luego podemos configurar el backend y ejecutar la instancia de Grover para obtener el resultado:
fr_fr: Nous pouvons alors configurer le backend et exécuter l'instance de problème de Grover pour obtenir le résultat :
ko: 그런 다음 백엔드를 구성하고 그로버 인스턴스를 실행하여 결과를 얻을 수 있다.
pt_br: Podemos, então, configurar o backend e executar a instância de Grover para obter o resultado:
ru: Затем мы можем настроить бэкенд и запустить экземпляр класса Grover, чтобы получить результат:
sw_ke: Kisha tunaweza kusanidi backend na kutekeleza tukio la Grover ili kupata matokeo:
ta_in: முடிவைப் பெற நாம் பின்தளத்தில் உள்ளமைத்து க்ரோவர் உதாரணத்தை இயக்கலாம்:
te: మేము బ్యాకెండ్‌ను కాన్ఫిగర్ చేయవచ్చు మరియు ఫలితాన్ని పొందడానికి గ్రోవర్ ఉదాహరణను అమలు చేయవచ్చు:
tr_tr: Sonrasında arka-yüzü yapılandırabilir ve sonucu elde etmek için Grover örneğini çalıştırabiliriz:
zh_tw: 然後，我們可以選擇後台，並執行 Grover 範例，以取得結果:

source: As seen above, a satisfying solution to the specified 3-SAT problem is obtained. And it is indeed one of the three satisfying solutions.
bn_bn: উপরিউক্ত বিধি মোতাবেক, নির্দিষ্টকৃত 3-SAT সমস্যার একটি গ্রহণীয় সমাধান পাওয়া গেছে। আর এটা প্রকৃতপক্ষে তিনটি গ্রহণীয় সমাধানের মধ্যে একটা।
es_un: Como se vio anteriormente, se obtiene una solución satisfactoria al problema 3-SAT especificado. Y de hecho es una de las tres soluciones satisfactorias.
fr_fr: Comme on l'a vu ci-dessus, la solution renvoyée est bien l'une des trois solutions satisfaisantes admises par notre problème.
ko: 위에서 볼 수 있듯이 지정된 3-SAT 문제에 대한 만족스러운 솔루션을 얻는다. 그리고 획득한 솔루션은 실제로 세 가지 만족스러운 솔루션 중 하나이다.
pt_br: Como visto acima, uma solução satisfatória para o problema de 3-SAT especificado é obtida. E é de fato uma das três soluções satisfatórias.
ru: Как видно из вышеприведенной ячейки, решение удовлетворяющее указанной задачи 3-SAT получено. И это действительно одно из трех возможных решений.
sw_ke: Kama inavyoonekana hapo juu, suluhisho la kuridhisha kwa tatizo maalum la 3-SAT linapatikana. Na kwa kweli ni mojawapo ya suluhisho tatu za kuridhisha.
ta_in: மேலே பார்த்தபடி, குறிப்பிட்ட 3-SAT சிக்கலுக்கு திருப்திகரமான தீர்வு பெறப்படுகிறது. இது உண்மையில் மூன்று திருப்திகரமான தீர்வுகளில் ஒன்றாகும்.
te: పైన చూసినట్లుగా, పేర్కొన్న 3-SAT సమస్యకు సంతృప్తికరమైన పరిష్కారం లభిస్తుంది. మరియు ఇది నిజానికి మూడు సంతృప్తికరమైన పరిష్కారాలలో ఒకటి.
tr_tr: Yukarıda görüldüğü gibi, belirtilen 3-SAT problemine tatmin edici bir çözüm elde edilmiştir. Ve bu gerçekten de tatmin edici üç çözümden biridir.
zh_tw: 如上所見，得到了對指定的 3-SAT 問題的滿足方案。而這確實是三種滿足的解決方案之一。

source: Since we used the ``'aer_simulator'``, the complete measurement result is also returned, as shown in the plot below, where it can be seen that the binary strings ``000``, ``011``, and ``101`` (note the bit order in each string), corresponding to the three satisfying solutions all have high probabilities associated with them.
bn_bn: যেহেতু আমরা ``'aer_simulator'`` সিমুলেটর ব্যাবহার করেছি, নিচের গ্রাফের মত, যেখানে দেখা যায় যে সবগুলো সমাধানের মধ্যে তিনটা গ্রহণযোগ্য সমাধান বাইনারি স্ট্রিং `000``, ``011``, এবং ``101`` (প্রত্যেক স্ট্রিং-এ বিটের ক্রম লক্ষ্য কর), যাদের সবগুলোরই অত্যধিক সম্ভাব্যতা আছে, সেগুলর সম্পূর্ণ মেজারমেন্টের ফলাফলও রিটার্ন করেছে ।
es_un: Dado que utilizamos el ``'aer_simulator'``, también es devuelto el resultado de la medición completa, como se muestra en la gráfica a continuación, donde se puede ver que las cadenas binarias ``000``, ``011``, y ``101`` (observa el orden de los bits en cada cadena), correspondientes a las tres soluciones satisfactorias, tienen todas altas probabilidades asociadas.
fr_fr: Puisque nous avons utilisé l'``aer_simulator``, le résultat de chaque mesure est également retourné, comme montré sur le graphique ci-dessous, où l'on peut voir que les chaînes binaires ``000``, ``011``, et ``101`` (notez l'ordre des bits dans chaque chaîne), correspondant aux trois solutions satisfaisantes ont toutes des probabilités associées élevées.
pt_br: Como usamos o ``'aer_simulator'``, o resultado completo da medição também é retornado, como mostrado no gráfico abaixo, onde pode ser visto que as strings binárias ``000``, ``011``, e ``101`` (note a ordem dos bits em cada string) correspondentes às três soluções satisfatórias têm todas altas probabilidades associadas a elas.
ta_in: நாங்கள் ``'aer_simulator'`` பயன்படுத்தியதால், கீழேயுள்ள அடுக்கில் காட்டப்பட்டுள்ளபடி, முழுமையான அளவீட்டு முடிவும் திரும்பப் பெறப்படுகிறது, அங்கு பைனரி ஸ்ட்ரிங்கள் ``000``, ``011``, மற்றும் ``101`` (ஒவ்வொரு ஸ்ட்ரிங்கிலும் பிட் வரிசையைக் கவனியுங்கள்), மூன்று திருப்திகரமான தீர்வுகளுடன் தொடர்புடையது, அவற்றுடன் தொடர்புடைய உயர் நிகழ்தகவுகள் உள்ளன.
tr_tr: ``'aer_simulator'`` kullandığımız için, aşağıdaki grafikte gösterildiği gibi, tam ölçüm sonucu da döndürülür. Bu grafikte, üç tatmin edici çözüme tekabül eden ``000``, ``011``, and ``101`` (Her karakter dizisindeki bit sıralamasına dikkat edin.) ikili karakter dizilerinin hepsinin kendileriyle ilişkilendirilmiş yüksek olasılıklara sahip olduğu görülmektedir.

source: Boolean Logical Expressions
bn_bn: Boolean লজিকাল এক্সপ্রেশন
es_un: Expresiones Lógicas Booleanas
fr_fr: Expressions logiques booléennes
ko: 불리언(Boolean) 논리 표현식
pt_br: Expressões Lógicas Booleanas
ru: Логические выражения
ta_in: பூலியன் தருக்க வெளிப்பாடுகள்
te: బూలియన్ లాజికల్ ఎక్స్ప్రెషన్స్
tr_tr: Boole Mantıksal İfadeler

source: Qiskit’s ``Grover`` can also be used to perform Quantum Search on an ``Oracle`` constructed from other means, in addition to DIMACS. For example, the ``PhaseOracle`` can actually be configured using arbitrary Boolean logical expressions, as demonstrated below.
bn_bn: DIMACS এর সাথে সাথে একটি ``Oracle``এ কোয়ান্টাম সার্চ চালনা করতে Qiskit এর ``Grover`` ব্যবহৃত হতে পারে। উদাহরণস্বরূপ, ``PhaseOracle`` কে ইচ্ছামত বুলিয়ান লজিকাল এক্সপ্রেশন দিয়ে নিম্নরুপে কনফিগার করে নেয়া যেতে পারে,
es_un: El ``Grover`` de Qiskit también se puede utilizar para realizar búsquedas cuánticas en un ``Oracle`` construido a partir de otros medios, además de DIMACS. Por ejemplo, el ``PhaseOracle`` se puede configurar utilizando expresiones lógicas booleanas arbitrarias, como se muestra a continuación.
fr_fr: La classe ``Grover`` de Qiskit peut également être utilisée pour effectuer une recherche quantique sur un ``Oracle`` construit à partir d'autres moyens, en plus d'une chaîne de caractères au format DIMACS-CNF. Par exemple, il est possible de configurer le ``PhaseOracle`` à l'aide d'expressions logiques booléennes arbitraires, comme montré ci-dessous.
ko: Qiskit의 ``Grover`` 는 또한 DIMM외에 다른 방법으로 구성된 ``Oracle`` 에서 양자 검색(Quantum Search) 를 수행하는 데 사용될 수 있다. 예를 들어, ``PhaseOracle`` 은 실제로 임의의 불리언 논리식을 사용하여 구성할 수 있다.
pt_br: O ``Grover`` do Qiskit também pode ser usado para executar a Busca Quântica em um ``Oráculo`` construído a partir de outros meios, além de DIMACS. Por exemplo, o ``PhaseOracle`` pode na verdade ser configurado usando expressões lógicas Booleanas arbitrárias, como demonstrado abaixo.
ru: В Qiskit ``Grover`` также может быть использован для выполнения квантового поиска на ``Oracle``, построенном другими способами, помимо DIMACS. Например, ``PhaseOracle``, как показано ниже, может быть задан с помощью произвольных логических выражений.
ta_in: DIMACS-உடன் கூடுதலாக, பிற வழிகளிலிருந்து கட்டப்பட்ட ``Oracle`` இல் குவாண்டம் தேடலைச் செய்ய Qiskit-ன் ``Grover`` பயன்படுத்தப்படலாம். எடுத்துக்காட்டாக, ``PhaseOracle`` உண்மையில் கீழே காட்டப்பட்டுள்ளபடி தன்னிச்சையான பூலியன் தருக்க வெளிப்பாடுகளைப் பயன்படுத்தி கட்டமைக்க முடியும்.
tr_tr: Qiskit'in ``Grover``ı, DIMACS'nin yanı sıra başka yöntemlerle oluşturulan bir ``Oracle`` üzerinde de Kuantum Arama gerçekleştirilmesinde kullanılabilir. Örneğin, aşağıda gösterildiği gibi, ``PhaseOracle`` aslında isteğe bağlı Boole mantıksal ifadeler kullanılarak yapılandırılabilir.
