Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/07_grover_examples.po
Languages: bn_bn, es_un, fr_fr, ko, pt_br, ru, sw_ke, ta_in, te, tr_tr, zh_tw

source: In the example above, the input Boolean logical expression ``'(w ^ x) & ~(y ^ z) & (x & y & z)'`` should be quite self-explanatory, where ``^``, ``~``, and ``&`` represent the Boolean logical XOR, NOT, and AND operators, respectively. It should be quite easy to figure out the satisfying solution by examining its parts: ``w ^ x`` calls for ``w`` and ``x`` taking different values; ``~(y ^ z)`` requires ``y`` and ``z`` be the same; ``x & y & z`` dictates all three to be ``True``. Putting these together, we get the satisfying solution ``(w, x, y, z) = (False, True, True, True)``, which our ``Grover``\ ’s result agrees with.
bn_bn: উপরিউক্ত উদাহরনে বুলিয়ান লজিকাল এক্সপ্রেশন হিসেবে ইনপুট ``'(w ^ x) & ~(y ^ z) & (x & y & z)'`` অনেকটা স্ব-ব্যাখ্যামূলক হওয়া উচিত, যেখানে ``^``, ``~``, এবং ``&`` বুলিয়ান লজিকাল অপারেটরগুলো যথাক্রমে XOR, NOT, এবং AND কে বোঝায়। ইনপুটের অংশগুলো পরীক্ষা করে যেমন: ``w ^ x`` হতে ``w`` এবং ``x`` এর আলাদা আলাদা মান নিয়ে, ``~(y ^ z)`` এর ``y`` এবং ``z`` এর একই মান নিয়ে, আবার ``x & y & z`` এর সবগুলোতে ``True``বসিয়ে গ্রহনযোগ্য সমাধান খুজে বের করা অনেকটা সহজ হতে পারে। সফলস্বরূপ, আমরা গ্রহণযোগ্য সমাধান পাই, যার সাথে আমাদের গ্রোভারের সমান্ধান সাদৃশ্যপূর্ণ।
es_un: En el ejemplo anterior, la expresión lógica booleana de entrada ``'(w ^ x) & ~(y ^ z) & (x & y & z)'`` debería ser bastante autoexplicativa, donde ``^``, ``~``, y ``&`` representan los operadores lógicos booleanos XOR, NOT y AND, respectivamente. Debería ser bastante fácil descubrir la solución satisfactoria examinando sus partes: ``w ^ x`` requiere que `` w '' y `` x '' tomen valores diferentes; ``~(y ^ z)`` requiere que ``y`` y ``z`` sean iguales; ``x & y & z`` dicta que los tres son ``True``. Al juntarlos, obtenemos la solución satisfactoria ```(w, x, y, z) = (False, True, True, True)``, con lo que el resultado de nuestro ``Grover`` concuerda.
fr_fr: Dans l'exemple ci-dessus, l'expression booléenne logique en entrée ``'(w ^ x) & ~(y ^ z) & (x & y & z)'`` devrait être assez explicite, où les opérateurs ``^``, ``~`` et ``&`` représentent respectivement les opérateurs logiques XOR, NON et ET. Il devrait être assez facile de trouver la solution satisfaisante en examinant ses composantes : ``w ^ x`` nécessite que ``w`` et ``x`` aient des valeurs différents ; ``~(y ^ z)`` impose que que ``y`` et ``z`` aient la même valeur; ``x & y & z`` impose que les trois valeurs soient à ``True``. En combinant ces trois contraintes nous obtenons la solution satisfaisante ``(w, x, y, z) = (False, True, True, True)``, ce qui est en accord avec notre résultat obtenu avec ``Grover``.
ko: 위의 예에서, 입련된 불리언 논리 표현식 ``'(w ^ x) & ~(y ^ z) & (x & y & z)'`` 은 상당히 스스로 설명가능(self-explanatory) 해야 하는데, ``^``, ``~``, ``&`` 는 각각 불리언 논리 XOR, NOT, AND 연산자를 나타낸다. 각 요소들을 살펴보면 만족스러운 솔루션을 쉽게 찾을 수 있다: ``w ^ x`` 는 ``w`` 와 ``x`` 가 서로 다른 값을 갖도록; ``~(y ^ z)`` 는 ``y`` 와 ``z`` 가 같은 값을 갖도록; ``x & y & z`` 는 모든 세 값이 반드시 ``True`` 가 되도록 호출한다. 이를 종합해보면, ``Grover`` 들의 결과와 일치하는 만족스러운 솔루션 ``(w, x, y, z) = (False, True, True, True)`` 를 얻는다.
pt_br: No exemplo acima, a expressão lógica booleana de entrada ``'(w ^ x) & ~(y ^ z) & (x & y & z)'`` deve ser bastante auto-explicativa, onde ``^``, ``~`` e ``&`` representam os operadores booleanos XOR, NOT e AND respectivamente. Deve ser relativamente fácil descobrir a solução satisfatória examinando as suas partes: ``w ^ x`` resulta em ``w`` e ``x`` tomando valores diferentes; ``~(y ^ z)`` requer que ``y`` e ``z`` sejam o mesmo; ``x & y & z`` dita que todos os três sejam ``True``. Juntando isso, obtemos a solução satisfatória ``(w, x, y, z) = (False, True, True, True)``, que concorda com o resultado do nosso ``Grover``.
ru: В приведенном выше примере входное логическое выражение ``'(w ^ x) & ~(y ^ z) & (x & y & z)'``, где ``^``, ``~`` и ``&`` представляют собой логические исключающее ИЛИ, НЕ и И соответственно, должно быть достаточно понятным. Найти решение, удовлетворяющее выражению, достаточно легко, если проанализировать его части: ``w ^ x`` обязывает ``w`` и ``x`` принимать различные значения; для ``~(y ^ z)`` необходимо, чтобы ``y`` и ``z`` совпадали; ``x & y & z`` предписывает всем трем переменным быть ``True``. Сложив все это вместе, мы получаем удовлетворяющее решение ``(w, x, y, z) = (False, True, True, True)``, с которым согласуется результат нашего поиска с помощью алгоритма ``Grover``.
ta_in: மேலே உள்ள எடுத்துக்காட்டில், பூலியன் தருக்க வெளிப்பாடு ``'(w ^ x) & ~(y ^ z) & (x & y & z)'`` மிகவும் சுய விளக்கமாக இருக்க வேண்டும், அங்கு ``^``, ``~``, மற்றும் ``&`` முறையே பூலியன் தருக்க XOR, NOT மற்றும் AND ஆபரேட்டர்களைக் குறிக்கின்றன. அதன் பகுதிகளை ஆராய்வதன் மூலம் திருப்திகரமான தீர்வைக் கண்டறிவது மிகவும் எளிதாக இருக்க வேண்டும்: ``w ^ x``, ``w`` மற்றும் ``x`` வெவ்வேறு மதிப்புகளை எடுத்துக்கொள்வதற்கான அழைப்புகள்; ``~ (y ^ z)`` க்கு ``y`` மற்றும் ``z`` ஆகியவை ஒரே மாதிரியாக இருக்க வேண்டும்; ``x & y & z`` மூன்றையும் ``True`` என்று ஆணையிடுகிறது. இவற்றைச் சேர்த்து, திருப்திகரமான தீர்வைப் பெறுகிறோம் ``(w, x, y, z) = (False, True, True, True)``, இது எங்கள் ``Grover``\ ’s இன் முடிவு ஒப்புக்கொள்கிறது.
tr_tr: Yukarıdaki örnekte, ``^``, ``~``, and ``&`` sembollerinin sırasıyla XOR, NOT, ve AND operatörlerini temsil ettiği ``'(w ^ x) & ~(y ^ z) & (x & y & z)'`` Boole mantıksal ifade girdisinin kendisi aslında gayet açıklayıcıdır. Bölümlerini tek tek inceleyerek tatmin edici çözümü anlamak oldukça basittir: ``w ^ x`` ifadesi ``w`` ve ``x``in farklı değerler almasını gerektirir; ``~(y ^ z)`` ifadesi ``y`` ve ``z``nin aynı olmasını gerektirir; ``x & y & z`` ifadesi üçünün de ``True`` olduğuna işaret eder. Bunları birleştirirsek, ``Grover``ımızın sonucuyla örtüşen ``(w, x, y, z) = (False, True, True, True)`` tatmin edici çözümünü elde etmiş oluyoruz.

source: :math:`(\neg v_1 \vee \neg v_2 \vee \neg v_3) \wedge (v_1 \vee \neg v_2 \vee v_3) \wedge (v_1 \vee v_2 \vee \neg v_3) \wedge (v_1 \vee \neg v_2 \vee \neg v_3) \wedge (\neg v_1 \vee v_2 \vee v_3)`
pt_br: :math:` (\neg v_1 \vee \neg v_2 \vee \neg v_ 3) \wedge (v_1 \vee \neg v_2 \vee v_ 3) \wedge (v_1 \vee v_2 \vee \neg v_ 3) \wedge (v_1 \vee \neg v_2 \vee \neg v_ 3) \wedge (\neg v_1 \vee v_2 \vee v_2 \vee v_ 3) `

source: Since we used the ``Sampler``, the complete measurement result is also returned, as shown in the plot below, where it can be seen that the binary strings ``000``, ``011``, and ``101`` (note the bit order in each string), corresponding to the three satisfying solutions all have high probabilities associated with them.
ko: ``Sampler`` 를 사용했기 때문에, 아래의 플롯과 같이 전체 측정 결과도 반환된다. 여기서 바이너리 문자열 ``000`` 과 ``011`` 과 ``101`` (각 문자열의 비트 순서에 주의) 들은 모두 이에 대응되는 높은 확률을 갖는 3개의 만족하는 솔루션에 대응한다.
te: మేము ``మాదిరి``ని ఉపయోగించినందున, దిగువ ప్లాట్‌లో చూపిన విధంగా పూర్తి కొలత ఫలితం కూడా అందించబడుతుంది, ఇక్కడ బైనరీ స్ట్రింగ్‌లు ``000``, ``011`` మరియు ``101 ``అని చూడవచ్చు. (ప్రతి స్ట్రింగ్‌లోని బిట్ క్రమాన్ని గమనించండి), మూడు సంతృప్తికరమైన పరిష్కారాలకు అనుగుణంగా అన్నింటికీ వాటితో అనుబంధించబడిన అధిక సంభావ్యత ఉంటుంది.

source: Grover's algorithm examples
te: గ్రోవర్ యొక్క అల్గోరిథం ఉదాహరణలు

source: Let's look at an example 3-Satisfiability (3-SAT) problem and walk-through how we can use Quantum Search to find its satisfying solutions. 3-SAT problems are usually expressed in `Conjunctive Normal Forms (CNF) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__ and written in the `DIMACS-CNF <http://www.satcompetition.org/2009/format-benchmarks2009.html>`__ format. For example:
te: 3-సంతృప్తి (3-SAT) సమస్యను ఉదాహరణగా పరిశీలిద్దాం మరియు దాని సంతృప్తికరమైన పరిష్కారాలను కనుగొనడానికి క్వాంటం శోధనను ఎలా ఉపయోగించవచ్చో చూద్దాం. 3-SAT సమస్యలు సాధారణంగా `కంజుంక్టివ్ నార్మల్ ఫారమ్‌లు (CNF) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__లో వ్యక్తీకరించబడతాయి మరియు `DIMACS-CNF <http://www.satcompetition.org/2009/format-benchmarks2009.html>`__ ఫార్మాట్‌లో వ్రాయబడతాయి. ఉదాహరణకి:

source: Qiskit's ``Grover`` can also be used to perform Quantum Search on an ``Oracle`` constructed from other means, in addition to DIMACS. For example, the ``PhaseOracle`` can actually be configured using arbitrary Boolean logical expressions, as demonstrated below.
te: Qiskit యొక్క ``గ్రోవర్`` DIMACSతో పాటు ఇతర మార్గాల నుండి నిర్మించిన ``Oracle``పై క్వాంటం శోధనను నిర్వహించడానికి కూడా ఉపయోగించవచ్చు. ఉదాహరణకు, దిగువ ప్రదర్శించిన విధంగా, ``PhaseOracle`` నిజానికి ఏకపక్ష బూలియన్ లాజికల్ ఎక్స్‌ప్రెషన్‌లను ఉపయోగించి కాన్ఫిగర్ చేయవచ్చు.

source: In the example above, the input Boolean logical expression ``'(w ^ x) & ~(y ^ z) & (x & y & z)'`` should be quite self-explanatory, where ``^``, ``~``, and ``&`` represent the Boolean logical XOR, NOT, and AND operators, respectively. It should be quite easy to figure out the satisfying solution by examining its parts: ``w ^ x`` calls for ``w`` and ``x`` taking different values; ``~(y ^ z)`` requires ``y`` and ``z`` be the same; ``x & y & z`` dictates all three to be ``True``. Putting these together, we get the satisfying solution ``(w, x, y, z) = (False, True, True, True)``, which our ``Grover``'s result agrees with.
te: పై ఉదాహరణలో, ఇన్‌పుట్ బూలియన్ లాజికల్ ఎక్స్‌ప్రెషన్ ``'(w ^ x) & ~(y ^ z) & (x & y & z)'`` చాలా స్వీయ వివరణాత్మకంగా ఉండాలి, ఇక్కడ ``^``, ``~``, మరియు ``&`` వరుసగా బూలియన్ లాజికల్ XOR, NOT మరియు AND ఆపరేటర్‌లను సూచిస్తాయి. దాని భాగాలను పరిశీలించడం ద్వారా సంతృప్తికరమైన పరిష్కారాన్ని గుర్తించడం చాలా సులభం: ``w ^ x`` విభిన్న విలువలను తీసుకొని ``w`` మరియు ``x`` కోసం కాల్ చేస్తుంది; ``~(y ^ z)``కి ``y`` మరియు ``z`` ఒకేలా ఉండాలి; ``x & y & z`` మూడింటిని ``నిజం`` అని నిర్దేశిస్తుంది. వీటిని కలిపి ఉంచితే, మన ``గ్రోవర్`` ఫలితం అంగీకరించే ``(w, x, y, z) = (False, True, True, True)`` అనే సంతృప్తికరమైన పరిష్కారం లభిస్తుంది.
