Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/07_grover.po
Languages: es_un, id_id, ja_jp, ko_kr, pt_br, vi_vn

source: The ``Oracle`` components in Qiskit Aqua allow for an easy construction of more complex oracles. The ``Oracle`` type has the interesting subclasses: \* ``LogicalExpressionOracle``: for parsing logical expressions such as ``'~a | b'``. This is especially useful for solving 3-SAT problems and is shown in the accompanying `Grover Examples <08_grover_examples.ipynb>`__ tutorial. \* ``TrutheTableOracle``: for converting binary truth tables to circuits
es_un: Los componentes ``Oracle`` en Qiskit Aqua permiten una fácil construcción de oráculos más complejos. El tipo ``Oracle`` tiene subclases interesantes, cómo: \* ``LogicalExpressionOracle``: para analizar gráficamente expresiones lógicas como ``'~a | b'``. Esto es especialmente útil al solucionar problemas 3-SAT y se muestra en la sección `Grover Examples <08_grover_examples.ipynb>`__ tutorial. \* ``TrutheTableOracle``: para convertir tablas de verdad binarias a circuitos
id_id: Komponen ``Oracle`` di Qiskit Aqua memudahkan konstruksi oracle yang lebih kompleks. Tipe ``Oracle`` memiliki subkelas yang menarik: \* ``LogicalExpressionOracle``: untuk mengurai ekspresi logis seperti ``'~ a | b'``. Ini sangat berguna untuk memecahkan masalah 3-SAT dan bisa dilihat di penyerta tutorial `Contoh Grover <08_grover_examples.ipynb>` \* ``TrutheTableOracle``: untuk mengubah tabel kebenaran biner ke sirkuit
ja_jp: Qiskit Aqua の ``Oracle`` コンポーネントを用いれば、より複雑なオラクルを簡単に構築することが可能です。 ``Oracle`` 型には興味深いサブクラスがあります。 \* ``LogicalExpressionOracle``: ``'~a | b'`` のような論理式を解析するためのものです。これは特に 3-SAT 問題を解くのに便利で、 `Grover Examples <08_grover_examples.ipynb>`__ チュートリアルで説明されています。 \* ``TrutheTableOracle``: 真理値表を回路に変換するための関数です。
pt_br: Os componentes ``Oracle`` no Qiskit Aqua permitem uma construção fácil de oráculos mais complexos. O tipo ``Oracle`` tem as interessantes subclasses: \* ``LogicalExpressionOracle``: para a interpretação de expressões lógicas tais como ``'~a | b'``. Isto é especialmente útil para a solução de problemas de 3-SAT e é mostrada no tutorial que acompanha esse `Exemplos de Grover <08_grover_examples.ipynb>`__. \* ``TrutheTableOracle``: para a conversão de tabelas verdade binárias em circuitos
vi_vn: Các thành phần của ``Oracle`` trong Qiskit Aqua cho phép việc xây dựng dễ dàng các công cụ đối xứng phức tạp hơn. Loại ``Oracle`` có các lớp con: \* ``LogicalExpressionOracle``: phân tích các biểu thức logic như ``'~a | b'``. Việc này đặc biệt hữu dụng cho việc giải quyết các vấn đề 3-SAT và được minh họa ở hướng dẫn `Grover Examples <08_grover_examples.ipynb>`__. \* ``TrutheTableOracle``: biến đổi các bảng chân lý nhị phân thành các mạch

source: Here we’ll use the ``LogicalExpressionOracle`` for the simple example of finding the state :math:`|11\rangle`, which corresponds to ``'a & b'``.
es_un: Aquí utilizaremos ``LogicalExpressionOracle`` para el ejemplo simple de encontrar el estado :math:`|11\rangle`, que corresponde a ``'a & b'``.
id_id: Di sini kita akan menggunakan ``LogicalExpressionOracle`` untuk contoh sederhana menemukan state :math:` |11\rangle`, yang merupakan solusi ``'a & b'``.
ja_jp: ここでは ``LogicalExpressionOracle`` を用い、``'a & b'`` に対応する状態である :math:`|11\rangle` を見つける、簡単な例を示します。
ko_kr: 여기서는 ``'a & b'`` 에 해당하는 상태 :math:`|11\rangle` 를 찾는 간단한 예제로 ``LogicalExpressionOracle`` 을 사용한다.
pt_br: Aqui vamos usar o ``LogicalExpressionOracle`` para o exemplo simples de encontrar o estado :math:`|11\rangle`, que corresponde a ``'a & b'``.
vi_vn: Chúng ta sẽ sử dụng ``LogicalExpressionOracle`` trong một ví dụ đơn giản về việc tìm trạng thái :math:`|11\rangle`, tương đương với ``'a & b'``.

source: You can observe, that this oracle is actually implemented with three qubits instead of two!
es_un: Se puede observar, que este oráculo en realidad se implementa con tres qubits, ¡en vez de dos!
id_id: Anda dapat mengamati, bahwa oracle ini diimplementasikan dengan tiga qubit dan bukan dua!
ja_jp: このオラクルは、実際には二つではなく三つの量子ビットで実装されていることがわかります。
ko_kr: 여러분은 이것이 실제로 2개가 아니라 3개의 큐비트로 구현된다는 것을 관찰할 수 있습니다!
pt_br: Podem observar que este oráculo é efetivamente implementado com três qubits em vez de dois!
vi_vn: Bạn có thể thấy rằng công cụ đối xứng này thực chất được triển khai với ba qubit thay vì là hai!

source: That is because the ``LogicalExpressionOracle`` is not a phase-flip oracle (which flips the phase of the good state) but a bit-flip oracle. This means it flips the state of an auxiliary qubit if the other qubits satisfy the condition. For Grover’s algorithm, however, we require a phase-flip oracle. To convert the bit-flip oracle to a phase-flip oracle we sandwich the controlled-NOT by :math:`X` and :math:`H` gates, as you can see in the circuit above.
es_un: Esto es porque ``LogicalExpressionOracle`` no es un oráculo de phase-flip (el cual voltea la fase del estado viable) sino que un oráculo bit-flip. Esto significa que voltea el estado de un qubit auxiliar si los otros qubits satisfacen la condición. Sin embargo, para el algoritmo de Grover, requerimos de un oráculo phase-flip. Para convertir el oráculo bit-flip a un oráculo phase-flip hacemos sándwich a las compuertas controlled-NOT by :math:`X` y :math:`H`, como se puede ver en el circuito de arriba.
id_id: Itu karena ``LogicalExpressionOracle`` bukan sebuah oracle pembalik fase (yang membalik fase state yang dicari) melainkan sebuah oracle pembalik bit. Ini berarti itu membalik state dari qubit tambahan jika qubit lain memenuhi kondisi. Untuk algoritma Grover, walau begitu, kita memerlukan sebuah oracle pembalik fase. Untuk mengkonversi oracle pembalik bit ke sebuah oracle pembalik fase kita mengapit Kontrol-NOT dengan :math:`X` dan :math:`H`, seperti yang dapat Anda lihat di sirkuit di atas.
ja_jp: これは、 ``LogicalExpressionOracle`` が位相反転オラクル (所望の状態の位相を判定させる) ではなく、ビット反転オラクルだからです。これは他のビットが条件を満たしていれば、補助ビットの状態を反転させることというを意味しています。しかし、 Grover のアルゴリズムでは、位相反転オラクルが必要です。ビット反転オラクルを位相反転オラクルに変換するために、上記の回路で見られるように、 :math:`X` ゲートと :math:`H` ゲートでCNOT ゲートを挟みます。
pt_br: Isso porque o ``LogicalExpressionOracle`` não é um oráculo inversor de fase (que inverte a fase do estado bom) mas um oráculo inversor de bit. Isso significa que ele inverte o estado de um qubit auxiliar se os outros qubits satisfazem a condição. Para o algoritmo de Grover, no entanto, exigimos um oráculo de inversão de fase. Para converter o oráculo de inversão de bits para um oráculo de inversão de fase nós envolvemos o NOT-controlado por portas :math:`X` e :math:`H`, como você pode ver no circuito acima.
vi_vn: Điều này là do ``LogicalExpressionOracle`` không phải là một công cụ đối xứng lật pha (lật pha của trạng thái tốt) mà là một tiên tri lật bit. Nó đồng nghĩa với việc lật trạng thái của một qubit phụ trợ nếu các qubit khác thỏa mãn điều kiện. Tuy nhiên riêng với thuật toán Grover, chúng ta cần một công cụ đối xứng lật pha. Để biến đổi công cụ đối xứng lật bit thành công cụ đối xứng lật pha ta sẽ kẹp cổng NOT được điều khiển giữa các cổng :math:`X` và :math:`H`, như bạn có thể thấy ở mạch phía trên.

source: **Note:** This transformation from a bit-flip to a phase-flip oracle holds generally and you can use this to convert your oracle to the right representation.
es_un: ** Nota:** Esta transformación de oráculo bit-flip a phase-flip es correcta generalmente y puedes usarla para convertir tu oráculo a la representación correcta.
id_id: ** Note:** Transformasi dari pembalik bit ke sebuah oracle pembalik fase berlaku secara umum dan Anda dapat menggunakan ini untuk mengubah oracle Anda ke representasi yang tepat.
ja_jp: **注: ** このビット反転から位相反転への変換は一般的なものであり、これを用いてオラクルを正しい表現に変換することができます。
ko_kr: **참고:** 비트-플립에서 위상-플립 오라클로의 이러한 변환은 일반적으로 유지되며, 이를 사용하여 오라클을 올바른 표현으로 변환할 수 있다.
pt_br: **Nota:** Esta transformação de um oráculo de inversão de bit para um de inversão de fase é geral e você pode usar isso para converter seu oráculo para a representação correta.
vi_vn: **Lưu ý:** Việc chuyển đổi từ tiên tri lật bit sang lật pha này có thể được áp dụng một cách nói chung và có thể được dùng để biến đổi tiên tri sang loại đúng.

source: Amplitude amplification
es_un: Amplificación de amplitud
id_id: Amplifikasi Amplitudo
ja_jp: 振幅増幅
ko_kr: 진폭 증폭
pt_br: Amplificação de amplitude
vi_vn: Khuếch đại biên độ

source: Grover’s algorithm uses Hadamard gates to create the uniform superposition of all the states at the beginning of the Grover operator :math:`\mathcal{Q}`. If some information on the good states is available, it might be useful to not start in a uniform superposition but only initialize specific states. This, generalized, version of Grover’s algorithm is referred to *Amplitude Amplification*.
es_un: El algoritmo de Grover usa compuertas Hadamard para crear una superposición uniforme de todos los estados al principio del operador Grover :math:`\mathcal{Q}`. Si alguna información de los estados deseados está disponible, puede ser útil no empezar en una superposición uniforme, sino solo inicializar los estados específicos. Esta versión generalizada del algoritmo de Grover es conocida como *Amplificación de Amplitud*.
id_id: Algoritma Grover menggunakan gate Hadamard untuk membuat superposisi seragam semua state di awal operator Grover :math:`\mathcal{Q}`. Jika informasi mengenai state yang dicari tersedia, mungkin akan berguna untuk tidak memulai dari superposisi yang seragam tetapi dari inisialisasi keadaan tertentu. Generalisasi ini merupaka versi dari algoritma Grover yang disebut *Amplifikasi Amplitudo*.
ja_jp: Grover のアルゴリズムでは、 Grover 演算子 :math:`\mathcal{Q}` の最初において、全ての状態の一様な重ね合わせをアダマールゲートによって用意します。所望の状態に関する情報がある際には、一様な重ね合わせから始めるのではなく、特定の状態だけを初期化する方が便利な場合があります。 Grover のアルゴリズムがこのように一般化されたものは、 *振幅増幅(Amplitude Amplification)* と呼ばれています。
pt_br: O algoritmo de Grover usa portas Hadamard para criar a superposição uniforme de todos os estados no início do operador de Grover :math:`\mathcal{Q}`. Se alguma informação sobre os estados bons estiver disponível, poderá ser útil não começar com uma superposição uniforme, mas apenas inicializar os estados específicos. Esta versão generalizada do algoritmo de Grover se refere à *Amplificação de Amplitude*.
vi_vn: Thuật toán Grover sử dụng cổng Hadamard để tạo sự chồng chập các trạng thái lúc khai triển toán tử Grover :math:`\mathcal{Q}`. Nếu tồn tại thông tin về các trạng thái tốt, ta có thể chỉ khai triển một số trạng thái nhất định. Phiên bản tổng quát này của thuật toán Grover được gọi là *Khuếch đại biên độ*.

source: In Qiskit, the initial superposition state can easily be adjusted by setting the ``state_preparation`` argument.
es_un: En Qiskit, el estado de superposición inicial puede ajustado fácilmente configurando el argumento ``state_preparation``.
id_id: Di Qiskit, keadaan superposisi awal dapat dengan mudah disesuaikan dengan pengaturan argumen ``state_preparation``.
ja_jp: Qiskit では ``state_preparation`` 引数を設定することで、重ね合わせの初期状態を簡単に調整することができます。
ko_kr: 키스킷에서 초기 중첩 상태는 ``state_preparation`` 인수를 설정하여 쉽게 조정할 수 있다.
pt_br: No Qiskit, o estado inicial de superposição pode facilmente ser ajustado definindo o argumento ``state_preparation``.
vi_vn: Trong Qiskit, trạng thái chồng chập ban đầu có thể được điều chỉnh bằng cách thay đổi tham số ``state_preparation``.

source: State preparation
es_un: Preparación de estado
id_id: Persiapan state
ja_jp: 状態の準備
ko_kr: 상태 준비
pt_br: Preparação do Estado
vi_vn: Chuẩn bị trạng thái

source: A ``state_preparation`` argument is used to specify a quantum circuit that prepares a quantum state for the start point of the amplitude amplification. By default, a circuit with $H^{:nbsphinx-math:`\otimes `n} $ is used to prepare uniform superposition (so it will be Grover’s search). The diffusion circuit of the amplitude amplification reflects ``state_preparation`` automatically.
id_id: Argumen ``state_preparation`` digunakan untuk menentukan sebuah sirkuit kuantum yang menyiapkan keadaan kuantum sebagai titik awal dari amplifikasi amplitudo. Secara default, sebuah sirkuit dengan $H^{:nbsphinx-math:` \otimes ` n} $ digunakan untuk menyiapkan superposisi seragam (sehingga merupakan Grover search). Sirkuit difusi dari amplitudo amplifikasi merupakan ``state_preparation`` secara otomatis.
ko_kr: 진폭 증폭의 시작점에 대해 양자 상태를 준비하는 양자 회로를 지정하기 위해 ``state_preparation`` 인수를 사용한다. 기본적으로 $H^{:nbsphinx-math:`\otimes `n} $ 를 사용하는 회로는 중첩상태 준비하는 데 사용된다 (그로버의 검색이 됨). 진폭 증폭의 확산 회로는 ``state_preparation`` 를 자동적으로 반영한다.
vi_vn: Tham số ``state_preparation`` được sử dụng để xác định một mạch lượng tử, mạch này chuẩn bị một trạng thái lượng tử cho điểm bắt đầu của việc khuếch đại biên độ. Ở trạng thái mặc định, một mạch với $H^{:nbsphinx-math:`\otimes `n} $ được dùng để chuẩn bị chồng chập đồng bộ (để nó là tìm kiếm Grover). Mạch khuếch tán của bộ khuếch đại biên độ tự động phản chiếu ``state_preparation``.

source: Full flexibility
es_un: Flexibilidad total
id_id: Fleksibilitas penuh
ja_jp: 完全な柔軟性
ko_kr: 유연성
pt_br: Flexibilidade total
vi_vn: Linh động tuyệt đối

source: For more advanced use, it is also possible to specify the entire Grover operator by setting the ``grover_operator`` argument. This might be useful if you know more efficient implementation for :math:`\mathcal{Q}` than the default construction via zero reflection, oracle and state preparation.
es_un: Para un uso más avanzado, es posible especificar el operador de Grover completo configurando el argumento ``grover_operator``. Esto puede ser útil si conoces una implementación más eficiente para :math:`\mathcal{Q}` que la construcción predeterminada mediante reflexión con cero, oráculo y preparación de estado.
id_id: Untuk penggunaan lanjutan, juga dimungkinkan untuk menentukan seluruh operator Grover dengan menetapkan argumen ``grover_operator``. Ini mungkin berguna jika Anda tahu implementasi yang lebih efisien untuk :math:` \mathcal{Q}` daripada konstruksi standar melalui refleksi nol, oracle dan persiapan state.
ja_jp: より高度な使用法としては、 ``grover_operator`` 引数を設定することで、 Grover 演算子全体を指定することもできます。これはゼロ状態まわりの反転、オラクル、状態準備を介したデフォルトの構成よりも、 :math:`\mathcal{Q}` のより効率的な実装がわかっている場合に便利かもしれません。
ko_kr: 고급 사용을 위해서는``grover_operator`` 인수를 설정하여 전체 Grover 연산자를 지정할 수도 있다. 이는 0을 기준으로 한 반사, oracle및 상태 준비를 통해 기본 구성보다 :math:`\mathcal{Q}` 의 효율적인 구현을 알고 있는 경우에 유용할 수 있습니다.
pt_br: Para uso mais avançado, também é possível especificar o operador de Grover inteiro, configurando o argumento ``grover_operator``. Isso pode ser útil se você souber uma implementação mais eficiente para :math:` \mathcal{Q}` do que a construção padrão via reflexão em zero, oráculo e preparação de estado.
vi_vn: Với các công việc phức tạp hơn, ta cũng có thể xác định toán tử Grover bằng cách thay đổi tham số ``grover_operator``. Việc này có thể hữu dụng nếu bạn biết các cách áp dụng :math:`\mathcal{Q}` hiệu quả hơn cách mặc định thông qua phản chiếu qua gốc, công cụ đối xứng và chuẩn bị trạng thái.

source: The ``qiskit.circuit.library.GroverOperator`` can be a good starting point and offers more options for an automated construction of the Grover operator. You can for instance \* set the ``mcx_mode`` \* ignore qubits in the zero reflection by setting ``reflection_qubits`` \* explicitly exchange the :math:`\mathcal{S_f}, \mathcal{S_0}` and :math:`\mathcal{A}` operations using the ``oracle``, ``zero_reflection`` and ``state_preparation`` arguments
id_id: ``qiskit.circuit.library.GroverOperator`` dapat menjadi titik awal yang baik dan menawarkan banyak pilihan untuk konstruksi otomatis operator Grover. Anda dapat sebagai contoh \* mengatur ``mcx_mode`` \* mengabaikan qubit dalam refleksi nol dengan mengatur ``reflection_qubits`` \* secara eksplisit menukar operasi :math:`\mathcal{S_f}, \mathcal{S_0}` dan :math:`\mathcal{A}` dengan menggunakan argumen ``oracle``, ``zero_reflection`` dan ``state_preparation``
vi_vn: ``qiskit.circuit.library.GroverOperator`` là một điểm khởi đầu tốt và đưa ra nhiều lựa chọn cho việc xây dựng tự động của một toán tử Grover. Ví dụ: bạn có thể \* đặt ``mcx_mode \* bỏ quá các qubit trong phản xạ qua gốc bằng cách thay đổi ``reflection_qubits \* tráo đổi các toán tử :math:`\mathcal{S_f}, \mathcal{S_0}` và :math:`\mathcal{A}` bằng các tham số ``oracle``, ``zero_reflection`` và ``state_preparation``

source: For instance, imagine the good state is a three qubit state :math:`|111\rangle` but we used 2 additional qubits as auxiliary qubits.
es_un: Por ejemplo, imagina que el estado deseado es el estado de tres qubits :math:`|111\rangle` pero usamos 2 qubits adicionales cómo qubits auxiliares.
id_id: Sebagai contoh, bayangkan state yang dicari adalah state tiga qubit :math:`|111\rangle` tapi kami menggunakan 2 qubit tambahan sebagai qubit pembantu.
ja_jp: 例えば、所望の状態は三量子ビットの :math:`|111\rangle` ですが、補助量子ビットとして二量子ビットを追加するとします。
ko_kr: 예를 들어, 좋은 상태는 3개의 큐비트 상태 ( :math:`|111\rangle`) 이지만, 2개의 추가적인 큐비트를 사용했다고 가정하자.
pt_br: Por exemplo, imagine que o estado bom é um estado de três qubit :math:`|111\rangle` mas utilizamos 2 qubits adicionais como qubits auxiliares.
vi_vn: Ví dụ, tưởng tượng trạng thái tốt và trạng thái có 3 qubit :math:`|111\rangle` nhưng ta sử dụng thêm 2 qubit làm qubit phụ trợ.

source: Then, per default, the Grover operator implements the zero reflection on all five qubits.
es_un: Entonces, por defecto, el operador de Grover implementa la reflexión con cero en los cinco qubits.
id_id: Kemudian, per standar, operator Grover mengimplementasikan refleksi nol pada semua lima qubit.
ja_jp: デフォルトでは、 Grover 演算子は五つの量子ビット全てにゼロ状態まわりの反射を実装します。
ko_kr: 그 다음, 기본적으로, Grover 연산자는 5개의 모든 큐비트에 대해 0반사를 구현한다.
pt_br: Em seguida, por padrão, o operador de Grover implementa a reflexão sobre zero em todos os cinco qubits.
vi_vn: Sau đó, như mặc định, toán tử Grover thực hiện phản chiếu gốc trên cả năm qubit.

source: But we know that we only need to consider the first three:
es_un: Pero sabemos que solo necesitamos considerar los primeros tres:
id_id: Tapi kita tahu bahwa hanya perlu mempertimbangkan tiga hal pertama:
ja_jp: しかし、最初の三つだけを考えればよいということがわかっています。
ko_kr: 하지만 우리는 처음 세 가지를 고려해야 한다는 것을 알고 있다.
pt_br: Mas sabemos que só precisamos considerar os três primeiros:
vi_vn: Nhưng chúng ta biết rằng chỉ cần xem xét 3 cái đầu tiên:

source: Dive into other arguments of ``Grover``
es_un: Sumérgete en otros argumentos de ``Grover``
id_id: Mendalami argumen lain dari ``Grover``
ja_jp: ``Grover`` の他の引数について
ko_kr: ``Grover`` 의 여러 인수들에 대하여 알아보기
pt_br: Mergulhando em outros argumentos de ``Grover``
vi_vn: Đi sâu vào các tham số khác của ``Grover``

source: ``Grover`` has arguments other than ``oracle`` and ``state_preparation``. We will explain them in this section.
es_un: ``Grover`` tiene más argumentos además de ``oracle`` y``state_preparation``. Los explicaremos en esta sección.
id_id: ``Grover`` memiliki argumen selain ``oracle`` dan ``state_preparation``. Kami akan menjelaskan mereka dalam bagian ini.
ja_jp: ``Grover`` には ``oracle`` と ``state_prepartion`` 以外にも引数があります。このセクションでは、それらについて説明します。
ko_kr: ``Grover`` 는 ``oracle`` 와 ``state_preparation`` 이외에도 여러 인수들을 가지고 있다. 이 섹션에서는 이에 대하여 설명할 것이다.
pt_br: ``Grover`` tem outros argumentos além de ``oracle`` e ``state_preparation``. Explicaremos eles nesta seção.
vi_vn: ``Grover`` có các tham số khác ngoài ``oracle`` và ``state_preparation``. Chúng ta sẽ giải thích chúng trong phần này.

source: Specifying ``good_state``
es_un: Especificando ``good_state``
id_id: Menspesifikasikan ``good_state``
ja_jp: ``good_state`` の指定
ko_kr: ``good_state`` 를 지정하기
pt_br: Especificando ``good_state``
vi_vn: Xác định ``good_state``

source: ``good_state`` is used to check whether the measurement result is correct or not internally. It can be a list of binary strings, a list of integer, ``Statevector``, and Callable. If the input is a list of bitstrings, each bitstrings in the list represents a good state. If the input is a list of integer, each integer represent the index of the good state to be :math:`|1\rangle`. If it is a ``Statevector``, it represents a superposition of all good states.
es_un: ``good_state`` es usado para revisar si la medición es correcta, o no, de manera interna. Puede ser una lista de strings binarios, una lista de enteros, ``Statevector``, y Callable. Si la entrada es una lista de strings de bits, cada string de bits en la lista representa un estado deseado. Si la entrada es una lista de enteros, cada entero representa el índice del estado deseado como :math:`|1\rangle`. Si es un ``Statevector``, lo representa como una superposición de todos los estados deseados.
id_id: ``good_state`` digunakan untuk memeriksa apakah hasil pengukuran benar atau tidak secara internal. Ini dapat berupa daftar string biner, daftar bilangan bulat, ``Statevector``, dan Callable. Jika input adalah daftar bitstring, setiap bitstring dalam daftar mewakili state yang dicari. Jika input adalah daftar bilangan bulat, setiap bilangan bulat mewakili indeks dari state yang dicari menjadi :math:` | 1\rangle`. Jika itu adalah ``Statevector``, itu mewakili superposisi dari semua state yang dicari.
ja_jp: ``good_state`` は測定結果が正しいかどうかを内部的にチェックするために使用します。これは、バイナリ文字列のリスト、整数のリスト、 ``Statevector`` 、 Callable のいずれかになります。入力がビット列のリストの場合、リスト内の各ビット列が所望の状態を表します。入力が整数のリストならば、それぞれの整数は所望の状態で :math:`|1\rangle` となる桁のインデックスを表します。 ``Statevector`` の場合は、全ての所望の状態の重ね合わせを表します。
pt_br: ``good_state`` é usado para verificar se o resultado da medição está correto ou não internamente. Ele pode ser uma lista de strings binárias, uma lista de inteiros, ``Statevector`` e Callable. Se o input for uma lista de bitstrings, cada bitstring na lista representa um estado bom. Se a entrada for uma lista de inteiros, cada inteiro representa o índice do estado bom como :math:`|1\rangle`. Se for um ``Statevector``, representa uma superposição de todos os estados bons.
vi_vn: ``good_state`` được dùng để kiểm tra nội bộ xem kết quả đo là đúng hay không. Nó có thể là một danh sách các chuỗi nhị phân, một dãy số nguyên, ``Statevector``, và Callable. Nếu đầu vào là một chuỗi xâu bit, mỗi chuỗi bit trong dãy biểu diễn một trạng thái tốt. Nếu đầu vào là một dãy số nguyên, mỗi số nguyên biểu diễn cho vị trí của trạng thái tốt là :math:`|1\rangle`. Nếu đầu vào lại là một ``Statevector``, nó biểu diễn cho sự chồng chập của tất cả các trạng thái tốt.

source: The number of ``iterations``
es_un: El número de ``iterations``
id_id: Jumlah ``iterasi``
ja_jp: ``iterations`` の数
ko_kr: ``iterations`` 의 횟수
pt_br: O número de ``iterações``
vi_vn: Số lượng ``iterations``
