Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/07_grover.po
Languages: es_un, id_id, ja_jp, ko_kr, pt_br, vi_vn

source: The number of repetition of applying the Grover operator is important to obtain the correct result with Grover’s algorithm. The number of iteration can be set by the ``iteration`` argument of ``Grover``. The following inputs are supported: \* an integer to specify a single power of the Grover operator that’s applied \* or a list of integers, in which all these different powers of the Grover operator are run consecutively and after each time we check if a correct solution has been found
es_un: El número de repeticiones de la aplicación del operador de Grover es importante para obtener el resultado correcto con el algoritmo de Grover. El número de iteraciones puede ser configurado con el argumento ``iteration`` de ``Grover``. Las siguientes entradas son: \* un entero para especificar un solo exponente del operador de Grover que es aplicado \* una lista de enteros, en la cual todos estos diferentes exponentes del operador de Grover son ejecutados consecutivamente y cada vez revisamos si la solución correcta fue encontrada
id_id: Jumlah pengulangan penerapan operator Grover sangat penting untuk mendapatkan hasil yang benar dengan algoritma Grover. Jumlah iterasi dapat diatur oleh argumen ``iteration`` dari ``Grover``. Input berikut didukung: \* integer untuk menentukan frequensi dari operator Grover yang diterapkan \* atau daftar bilangan bulat, di mana semua frequensi yang berbeda dari operator Grover dijalankan berurutan dan setelahnya diperiksa apakah solusi yang yang dicari telah ditemukan
ja_jp: Grover 演算子のアルゴリズムで正しい結果を得るためには、 Grover 演算子を適用する際の繰り返し回数が重要です。繰り返し回数は ``Grover`` の引数 ``iterations`` で設定することができます。次の入力がサポートされています。入力が整数ならば、適用される Grover 演算子 の指数を表します。入力が整数のリストならば、 Grover 演算子がそれらの回数だけ連続して適用され、各回の実行後に正しい解が見つかったかどうかチェックされます。
pt_br: O número de repetições da aplicação do operador de Grover é importante para obter o resultado correto com o algoritmo de Grover. O número de iterações pode ser configurado pelo argumento ``iteration`` do ``Grover``. As entradas a seguir são suportadas: \* um inteiro para especificar uma única potência do operador de Grover que é aplicada \ * ou uma lista de inteiros, na qual todas estas diferentes potências do operador de Grover são executadas consecutivamente e depois de cada vez verificamos se uma solução correta foi encontrada
vi_vn: Số lần lặp lại việc áp dụng các toán tử Grover là rất quan trọng trong việc thu được kết quả đúng đối với thuật toán Grover. Số lần lặp lại có thể được đặt bởi tham số ``iteration`` của ``Grover``. Các đầu vào sau được hỗ trợ: \* một số nguyên để xác định một số mũ duy nhất được áp dụng của toán tử Grover \* hoặc một dãy số nguyên, trong đó các số mũ khác nhau của toán tử Grover được chạy liên tiếp nhau và sau mỗi lần chạy ta kiểm tra xem có tìm ra giải pháp đúng hay không

source: Additionally there is the ``sample_from_iterations`` argument. When it is ``True``, instead of the specific power in ``iterations``, a random integer between 0 and the value in ``iteration`` is used as the power Grover’s operator. This approach is useful when we don’t even know the number of solution.
es_un: Adicionalmente existe el argumento ``sample_from_iterations``. Cuando es ``True``, en vez del exponente especifico en ``iterations``, un entero aleatorio entre 0 y el valor en ``iteration``es usado como el exponente en el operador de Grover. Este acercamiento es útil cuando no sabemos ni siquiera el número de la solución.
id_id: Selain itu ada argumen ``sample_from_iterations``. Ketika diset ``True``, bukan frekuensi dalam ``iterations``, sebuah bilangan bulat acak antara 0 dan nilai ``iteration`` digunakan sebagai frekuensi operator Grover. Pendekatan ini berguna bahka ketika kita tidak tahu jumlah solusi.
ja_jp: これらに加えて、 ``sample_from_iterations`` という引数もあります。これが ``True`` になっている場合、 ``iterations`` で指定された指数の代わりに、 0 と ``iterations`` の間のランダムな整数を Grover 演算子の指数として用いることができます。この方法は、解の個数すら分からない場合に有用です。
pt_br: Adicionalmente há o argumento ``sample_from_iterations``. Quando ele for ``True``, em vez de uma potência específica em ``iterations``, um inteiro aleatório entre 0 e o valor em ``iteration`` é usado como operador de potência de Grover. Essa abordagem é útil quando nem sequer conhecemos o número de soluções.
vi_vn: Ngoài ra còn có tham số ``sample_from_iterations``. Khi nó là ``True``, một số nguyên bất kì từ 0 đến giá trị ở trong ``iteration`` được dùng làm số mũ của toán tử Grover thay cho chức năng cụ thể ở trong ``iterations``. Cách làm này khá hữu ích nếu chúng ta không biết số lượng giải pháp.

source: For more details of the algorithm using ``sample_from_iterations``, see [4].
es_un: Para más detalles acerca del uso de ``sample_from_iterations`` en el algoritmo, consulte [4].
id_id: Untuk detail lebih lanjut tentang algoritma menggunakan ``sample_from_iterations``, lihat [4].
ja_jp: ``sample_from_iterations`` を用いたアルゴリズムの詳細は [4] を参照してください。
ko_kr: ``sample_from_iterations`` 를 사용하는 알고리즘에 대한 자세한 내용은 [4] 를 참조하시오.
pt_br: Para mais detalhes do algoritmo usando ``sample_from_iterations``, consulte [4].
vi_vn: Để biết thêm chi tiết về thuật toán sử dụng ``sample_from_iterations`` xem [4].

source: [4]: Boyer et al., Tight bounds on quantum searching `arxiv:quant-ph/9605034 <https://arxiv.org/abs/quant-ph/9605034>`__
vi_vn: [4]: Boyer et al., Giới hạn chặt chẽ đối với tìm kiếm lượng tử `arxiv:quant-ph/9605034 <https://arxiv.org/abs/quant-ph/9605034>`__

source: When the number of solutions is known, we can also use a static method ``optimal_num_iterations`` to find the optimal number of iterations. Note that the output iterations is an approximate value. When the number of qubits is small, the output iterations may not be optimal.
es_un: Cuando el número de soluciones es conocido, podemos usar el método estático ``optimal_num_iterations`` para encontrar el número óptimo de iteraciones. Tome en cuenta que la salida de este método es un valor aproximado. Cuando el numero de qubits es pequeño, el valor de iteraciones devuelto puede que no sea óptimo.
id_id: Ketika jumlah solusi sudah diketahui, kita juga dapat menggunakan metode statis ``optimal_num_iterations`` untuk menemukan jumlah iterasi yang optimal. Perhatikan bahwa output iterasi adalah nilai perkiraan. Ketika jumlah qubit masih kecil, output iterasi mungkin tidak optimal.
ja_jp: 解の個数がわかっている場合には、静的メソッド ``optimal_num_iterations`` を用いて最適な反復回数を求めることもできます。出力される反復回数は、近似値であることに注意してください。量子ビット数が少ない場合には、出力される反復回数が最適でない可能性があります。
pt_br: Quando o número de soluções é conhecido, podemos também utilizar um método estático ``optimal_num_iterations`` para encontrar o número ideal de iterações. Observe que as iterações da saída são um valor aproximado. Quando o número de qubits é pequeno, as iterações da saída podem não ser ótimas.
vi_vn: Khi chúng ta biết số lượng giải pháp, ta có thể sự dụng phương pháp tĩnh ``optimal_num_operations`` để tìm số lần lặp lại tối ưu. Lưu ý rằng các đầu ra là một giá trị xấp xỉ. Khi số lượng qubit bé, các lần lặp lại đầu ra có thể không tối ưu.

source: Applying ``post_processing``
es_un: Aplicando ``post_processing``
id_id: Menerapkan ``post_processing``
ja_jp: ``post_processing`` の適用
ko_kr: ``post_processing`` 적용하기
pt_br: Aplicando ``post_processing``
vi_vn: Áp dụng ``post_processing``

source: We can apply an optional post processing to the top measurement for ease of readability. It can be used e.g. to convert from the bit-representation of the measurement ``[1, 0, 1]`` to a DIMACS CNF format ``[1, -2, 3]``.
es_un: Podemos aplicar un post-procesamiento opcional a la mejor medición para facilitar la legibilidad. Puede ser usado para, por ejemplo, convertir una representación de bits de la medición cómo ``[1, 0, 1]`` a su forma en formato DIMACS CNF ``[1, -2, 3]``.
id_id: Kita dapat menerapkan proses akhiran opsional ke pengukuran diatas untuk mempermudah pembacaan. Hal ini dapat digunakan misalnya untuk konversi dari bit-representasi pengukuran ``[1, 0, 1]`` ke format DIMACS CNF ``[1, -2, 3]``.
ja_jp: 読みやすさのために、最も多く得られた測定値に後処理を適用することができます。これは例えば、測定値のビット表現 ``[1, 0, 1]`` を DIMACS CNF 形式 ``[1, -2, 3]`` に変換するために使用可能です。
pt_br: Podemos aplicar um processamento posterior opcional para a melhor medição para facilitar a legibilidade. Pode ser utilizado, por exemplo, para converter da representação em bits da medição ``[1, 0, 1]`` para um formato de DIMACS CNF ``[1, -2, 3]``.
vi_vn: Ta có thể tùy chọn áp dụng việc xử lý sau vào phép đo hàng đầu để tăng sự dễ đọc. Nó có thể được dùng, ví dụ, để chuyển đổi từ biểu diễn bit của phép đo ``[1, 0, 1]`` sang dạng DIMACS CNF ``[1, -2, 3]``.

source: |x\rangle \mapsto \begin{cases} -|x\rangle, &x \neq 0 \\ |x\rangle, &x = 0\end{cases}
pt_br: |x\rangle \mapsto \begin{cases} -|x\rângulo, &x \neq 0 \\ |x\rângulo, &x = 0 \end{cases}

source: Note that the oracle for ``Grover`` mush be a *phase-flip* oracle. That is, it multiplies the amplitudes of the of “good states” by a factor of :math:`-1`. We explain later how to convert a *bit-flip* oracle to a phase-flip oracle.
ko_kr: ``Grover`` 오라클에는 *phase-flip* oracle이 있다는 것을 주목하라. 즉, “좋은 상태“ 의 진폭을 :math:`-1` 로 곱하는 것이다. 우리는 나중에 다시 한 번 *비트-플립* oracle을 위상-플립으로 변환하는 방법을 설명한다.
