Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/07_grover.po
Languages: es_un, id_id, ja_jp, ko_kr, pt_br, vi_vn

source: This page was generated from `tutorials/algorithms/07_grover.ipynb`__.
es_un: Esta página fue generada a partir de `tutorials/algorithms/07_grover.ipynb`__.
id_id: Halaman ini dibuat dari ` tutorials/algoritms/07_grover.ipynb ` __.
ja_jp: このページは `tutorials/algorithms/07_grover.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/algorithms/07_grover.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada, a partir do `tutorials/algorithms/07_grover.ipynb`__.
vi_vn: Trang này được tạo từ `tutorials/algorithms/06_qaoa.ipynb`__.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/07_grover.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/07_grover.ipynb>`_.
id_id: Jalankan secara interaktif di ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/07_grover.ipynb>` _.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/07_grover.ipynb>`_ でインタラクティブに実行します。
ko_kr: `IBM 퀀텀 랩 <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/07_grover.ipynb>`_ 에서 대화식으로 실행하시오.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/07_grover.ipynb>`_.
vi_vn: Chạy tương tác trực tiếp trong `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/02_vqe_convergence.ipynb>`_.

source: Grover’s Algorithm and Amplitude Amplification
es_un: Algoritmo de Grover y Amplificación de Amplitud
id_id: Algorithma Grover dan Amplifikasi Amplitudo
ja_jp: Grover のアルゴリズムと振幅増幅
ko_kr: Grover 알고리즘 및 확률진폭 증폭
pt_br: Algoritmo de Grover e Amplificação De Amplitude
vi_vn: Thuật toán và Khuếch đại biên độ Grover

source: Grover’s algorithm is one of the most famous quantum algorithms introduced by Lov Grover in 1996 [1]. It has initially been proposed for unstructured search problems, i.e. for finding a marked element in a unstructured database. However, Grover’s algorithm is now a subroutine to several other algorithms, such as Grover Adaptive Search [2]. For the details of Grover’s algorithm, please see `Grover’s Algorithm <https://qiskit.org/textbook/ch-algorithms/grover.html>`__ in the Qiskit textbook.
es_un: El algoritmo de Grover es uno de los algoritmos cuánticos más famosos, introducido por Lov Grover en 1996 [1]. Fue propuesto inicialmente para problemas de búsqueda no estructurados, es decir para encontrar un elemento marcado en una base de datos no estructurada. Sin embargo, el algoritmo de Grover ahora es una subrutina para muchos otros algoritmos, cómo el Grover Adaptive Search [2]. Para ver los detalles del algoritmo de Grover, revise `Algoritmo de Grover <https://qiskit.org/textbook/ch-algorithms/grover.html>`__ en el libro de texto de Qiskit.
id_id: Algoritma Grover adalah salah satu algoritma kuantum paling terkenal yang ditemukan oleh Lov Grover tahun 1996 [1]. Algorithma ini awalnya digunakan untuk pencarian dari data yang tidak terstruktur, yaitu untuk menemukan elemen yang ditandai dari database yang tidak terstruktur. Namun, algoritma Grover kini menjadi subrutin untuk beberapa algoritme lainnya, seperti Grover Adaptive Search [2]. Untuk rincian dari algoritma Grover, silakan lihat ` Grover's Algorithm <https://qiskit.org/textbook/ch-algorithms/grover.html>` __ dalam buku teks Qiskit.
ja_jp: Grover のアルゴリズムは、 1996 年に Lov Grover によって提案された、最も有名な量子アルゴリズムの一つです [1] 。最初は非構造検索問題、すなわち非構造化データベース内のマークされた要素を見つける問題のために提案されました。しかし Grover のアルゴリズムは、現在 Grover Adaptive Search [2] のような他のいくつかのアルゴリズムのサブルーチンとなっています。 Grover のアルゴリズムの詳細については、 Qiskit textbook の `Grover's Algorithm <https://qiskit.org/textbook/ch-algorithms/grover.html>`__ を参照してください。
ko_kr: Grover의 알고리즘은 1996년 [1]에서 Lov Grover가 도입한 가장 유명한 양자 알고리즘 중 하나이다. 구조화되지 않은 데이터베이스에서 표시된 요소를 찾기 위해 구조화되지 않은 검색 문제점에 대해 처음에 제안되었다. 하지만 Grover의 알고리즘은 이제 Grover Adaptive Search [2]와 같은 여러 다른 알고리즘의 서브루틴이다. Grover의 알고리즘에 대한 자세한 내용은 Qiskit 교재에서 `Grover's Algorithm <https://qiskit.org/textbook/ch-algorithms/grover.html>`__ 을 참조하기 바란다.
pt_br: O algoritmo de Grover é um dos algoritmos quânticos mais famosos apresentado por Lov Grover em 1996 [1]. Inicialmente foi proposto para problemas de busca não estruturada, ou seja, para encontrar um elemento marcado em um banco de dados não estruturado. No entanto, o algoritmo de Grover é agora uma subrotina para vários outros algoritmos, como a Busca Adaptativa de Grover [2]. Para detalhes do algoritmo de Grover, por favor, consulte `Algoritmo de Grover <https://qiskit.org/textbook/ch-algorithms/grover.html>`__ no Qiskit textbook.
vi_vn: Thuật toán của Grover là một trong những thuật toán lượng tử nổi tiếng nhất được tạo ra bởi Lov Grover năm 1996 [1]. Mục đích ban đầu của nó là dành cho các vấn đề tìm kiếm không sắp xếp, ví dụ như tìm một phần tử dược đánh dấu trong một cơ sở dữ liệu không được sắp xếp. Tuy nhiên, thuật toán của Grover giờ đóng vai trò chương trình con cho các thuật toán khác, điển hình là thuật toán tìm kiếm thích ứng Grover [2]. Để biết thêm chi tiết về thuật toán của Grover, xin hãy truy cập `Grover’s Algorithm <https://qiskit.org/textbook/ch-algorithms/grover.html>`__ ở trong sách giáo khoa Qiskit.

source: Qiskit implements Grover’s algorithm in the ``Grover`` class. This class also includes the generalized version, Amplitude Amplification [3], and allows setting individual iterations and other meta-settings to Grover’s algorithm.
es_un: Qiskit implementa el algoritmo de Grover en la clase ``Grover``. Esta clase también incluye una versión generalizada, la Amplificación de Amplitud [3] y permite establecer iteraciones individuales y otras meta-configuraciones al algoritmo de Grover.
id_id: Qiskit mengimplementasikan algoritma Grover di kelas ` ` Grover ` `. Kelas ini juga termasuk versi generalisasinya, Amplifikasi Amplitudo [3], dan memungkinkan pengaturan iterasi individual dan pengaturan meta-setting lainnya di algoritma Grover.
ja_jp: Qiskitは、 ``Grover`` クラスにGroverのアルゴリズムを実装します。 このクラスには、一般化されたバージョンである振幅増幅 [3] も含まれており、個々の反復やその他のメタ設定をグローバーのアルゴリズムに設定できます。
ko_kr: Qiskit은 ``Grover`` 클래스에서 Grover의 알고리즘을 구현한다. 이 클래스에는 일반화된 버전인 확률진폭 증폭 [3] 이 포함되며, 개별 반복 및 기타 메타 설정을 Grover의 알고리즘으로 설정할 수 있다.
pt_br: Qiskit implementa o algoritmo de Grover na classe ``Grover``. Esta classe também inclui a versão generalizada, a Amplificação de Amplitude [3], e permite a configuração de iterações individuais e outras meta-configurações do algoritmo de Grover.
vi_vn: Qiskit thực hiện thuật toán Grover trong class ``Grover``. Class này còn bao gồm phiên bản tổng quát, khuếch đại biên độ [3], và cho phép thiết lập các lần chạy riêng lẻ và các thiết lập meta khác của thuật toán Grover.

source: **References:**
es_un: ** Referencias:**
id_id: ** Referensi:**
ja_jp: **参考文献: **
ko_kr: **참조:**
pt_br: **Referências:**
vi_vn: **Tài liệu tham khảo:**

source: [1]: L. K. Grover, A fast quantum mechanical algorithm for database search. Proceedings 28th Annual Symposium on the Theory of Computing (STOC) 1996, pp. 212-219. https://arxiv.org/abs/quant-ph/9605043
pt_br: [1]: L. K. Grover, Um algoritmo quântico mecânico rápido para pesquisa em banco de dados. Processos do 28° Simpósio Anual em Teoria da Computação (STOC) 1996, págs. 212-219. https://arxiv.org/abs/quant-ph/9605043
vi_vn: [1]: L. K. Grover, môt thuật toán cơ học lương tử để tìm kiếm cơ sở dữ liệu. Kết quả của hội thảo học thuật hằng năm về nguyên lí điện toán lần thứ 28 (STOC) 1996, trang 212-219. https://arxiv.org/abs/quant-ph/9605043

source: [2]: A. Gilliam, S. Woerner, C. Gonciulea, Grover Adaptive Search for Constrained Polynomial Binary Optimization. https://arxiv.org/abs/1912.04088
vi_vn: [2] A. Gilliam, S. Woerner, C. Gonciulea, thuật toán tìm kiếm thích ứng Grover dành cho Tối ưu hóa nhị phân có ràng buộc. https://arxiv.org/abs/1912/04088

source: [3]: Brassard, G., Hoyer, P., Mosca, M., & Tapp, A. (2000). Quantum Amplitude Amplification and Estimation. http://arxiv.org/abs/quant-ph/0005055
vi_vn: [3]: Brassard, G., Hoyer, P., Mosca, M., & Tappm A. (2000). Khuếch đại biên độ lượng tử và Ước tính. http://arxiv.org/abs/quant-ph/0005055

source: Grover’s algorithm
es_un: Algoritmo de Grover
id_id: Algoritma Grover
ja_jp: Grover のアルゴリズム
ko_kr: 그로버 알고리즘
pt_br: Algoritmo de Grover
vi_vn: Thuật toán Grover

source: Grover’s algorithm uses the Grover operator :math:`\mathcal{Q}` to amplify the amplitudes of the good states:
es_un: El algoritmo de Grover usa el operador :math:`\mathcal{Q}` para amplificar las amplitudes de los estados deseados:
id_id: Algoritma Grover menggunakan operator Grover :math:` \mathcal{Q}` untuk amplifikasi amplitudo state yang dicari:
ja_jp: Grover のアルゴリズムは、 Grover 演算子 :math:`\mathcal{Q}` を用いて、所望の状態の振幅を増幅します。
ko_kr: Grover의 알고리즘은 Grover 연산자 :math:`\mathcal{Q}` 를 사용하여 우수한 상태의 진폭을 확대한다.
pt_br: O algoritmo de Grover usa o operador de Grover :math:` \mathcal{Q}` para amplificar as amplitudes dos estados:
vi_vn: Thuật toán Grover sử dụng toán tử :math:`\mathcal{Q}` để khuếch đại biên độ của các trạng thái tốt:

source: Here, \* :math:`\mathcal{A}` is the initial search state for the algorithm, which is just Hadamards, :math:`H^{\otimes n}` for the textbook Grover search, but can be more elaborate for Amplitude Amplification \* :math:`\mathcal{S_0}` is the reflection about the all 0 state
es_un: Aquí, \* :math:`\mathcal{A}` es el estado inicial de búsqueda para el algoritmo, el cual es solo Hadamards :math:`H^{\otimes n}` en la búsqueda de Grover convencional, pero puede ser mas elaborada ya que la amplificación de amplitudes \* :math:`\mathcal{S_0}` es la reflexión respecto a estado 0
id_id: Di sini, \ * :math:` \mathcal{A}` adalah state awal algoritma pencarian, yang hanya gate Hadamard, :math:` H ^ {\otimes n} ` untuk algorithma Grover di buku teks, tetapi dapat lebih rumit untuk Amplifikasi Amplitudo \ * :math:` \mathcal{S_0}` adalah refleksi seputar state semua 0
ja_jp: ここで \* :math:`\mathcal{A}` はアルゴリズムの初期探索状態であり、教科書的な Grover 探索におけるアダマール :math:`H^{\otimes n}` に同じですが、 振幅増幅のためにはより複雑なものとすることができます。 \* :math:`\mathcal{S_0}` は ゼロ状態に関する反転です。
pt_br: Aqui, \* :math:`\mathcal{A}` é o estado de busca inicial para o algoritmo, que é apenas Hadamards, :math:`H^{\otimes n}` no documento de Busca de Grover, mas pode ser mais elaborado para Amplificação de Amplitude \* :math:`\mathcal{S_0}` é a reflexão sobre o estado só de 0s
vi_vn: Ở đây, \* :math:`\mathcal{A}` là trạng thái tìm kiếm ban đầu của thuật toán, mà căn bản chỉ là Hadamards, :math:`H^{\otimes n}`đối với tìm kiếm Grover đơn thuần, nhưng có thể chi tiết hơn đối với Khuếch đại Biên độ \* :math:`\mathcal{S_0}` là việc đối xứng qua tất cả trạng thái 0

source: \* :math:`\mathcal{S_f}` is the oracle that applies
es_un: \* :math:`\mathcal{S_f}` es el oráculo que aplica
id_id: \ * :math:` \mathcal{S_f}` adalah oracle yang melakukan
ja_jp: \* :math:`\mathcal{S_f}` は適用するオラクルです。
ko_kr: \* :math:`\mathcal{S_f}` 는 적용될 오라클을 의미하고
pt_br: \* :math:`\mathcal{S_f}` é o oráculo que aplica
vi_vn: \* :math:`\mathcal{S_f}` là phép tiên đoán được áp dụng

source: where :math:`f(x)` is 1 if :math:`x` is a good state and otherwise 0.
es_un: donde :math:`f(x)` es 1 si :math:`x` es un estado deseado y de lo contrario es 0.
id_id: dimana :math:` f (x) ` adalah 1 jika :math:` x ` adalah state yang dicari dan sebaliknya 0.
ja_jp: :math:`f(x)` は :math:`x` が所望の状態の場合 1 となり、それ以外の場合は 0 になります。
ko_kr: 여기서 :math:`x` 가 바람직한 상태일 때, :math:`f(x)` 는 1이고, 그렇지 않으면 0이다.
pt_br: onde :math:`f(x)` é 1 se :math:`x` é um estado e 0 caso contrário.
vi_vn: khi :math:`f(x)` bằng 1 nếu :math:`x` là một trạng thái tốt còn ngược lại thì bằng 0.

source: In a nutshell, Grover’s algorithm applies different powers of :math:`\mathcal{Q}` and after each execution checks whether a good solution has been found.
es_un: En pocas palabras, el algoritmo de Grover aplica diferentes exponentes de :math:`\mathcal{Q}` y después de cada ejecución comprueba si se ha encontrado una solución deseada.
id_id: Dalam ringkasnya, algoritma Grover menerapkan :math:` \mathcal{Q}` dengan frekuensi eksekusi yang berbeda dan setelah setiap eksekusi memeriksa apakah solusi yang dicari telah ditemukan.
ja_jp: 一言で言えば、グローバーのアルゴリズムは異なる :math:`\mathcal{Q}` の累乗を適用し、各実行後に適切な解が見つかったかどうかをチェックします。
ko_kr: 간단히 말해서, 그로버 알고리즘은 :math:`\mathcal{Q}` 에 다양한 지수(power)를 적용하여 실행 후, 각 실행에서 좋은 솔루션이 있는지를 확인한다.
pt_br: Em poucas palavras, o algoritmo de Grover aplica diferentes potências de :math:`\mathcal{Q}` e depois de cada execução verifica se uma boa solução foi encontrada.
vi_vn: Nói tóm lại, thuật toán Grover sử dụng nhiều chức năng của :math:`\mathcal{Q}` và sau mỗi lần chạy kiểm tra xem một phương án tốt đã được tìm ra hay chưa.

source: Running Grover’s algorithm
es_un: Ejecutando el algoritmo de Grover
id_id: Menjalankan algoritma Grover
ja_jp: Grover のアルゴリズムの実行
ko_kr: 그로버 알고리즘 실행하기
pt_br: Executando o algoritmo de Grover
vi_vn: Chạy thuật toán Grover

source: To run Grover’s algorithm with the ``Grover`` class, firstly, we need to specify an oracle for the circuit of Grover’s algorithm. In the following example, we use ``QuantumCircuit`` as the oracle of Grover’s algorithm. However, there are several other class that we can use as the oracle of Grover’s algorithm. We talk about them later in this tutorial.
es_un: Para ejecutar el algoritmo de Grover con la clase ``Grover``, primeramente tenemos que especificar un oráculo para el circuito del algoritmo. En el siguiente ejemplo, usamos ``QuantumCircuit`` como el oráculo para el algoritmo de Grover. Sin embargo, hay varias otras clases que podemos usar como el oráculo para el algoritmo. Las vamos a discutir más adelante en este tutorial.
id_id: Untuk menjalankan algoritma Grover dengan kelas ``Grover``, pertama, kita perlu menentukan oracle untuk sirkuit algoritma Grover. Dalam contoh berikut, kita menggunakan ``QuantumCircuit`` sebagai oracle dari algoritma Grover. Namun, ada beberapa kelas lain yang dapat kita gunakan sebagai oracle dari algoritma Grover. Kita akan menyebutkan tentang mereka nanti di tutorial ini.
ja_jp: ``Grover`` クラスでGroverのアルゴリズムを実行するには、まず、Groverのアルゴリズムの回路にオラクルを指定する必要があります。次の例では、グローバーのアルゴリズムのオラクルとして ``QuantumCircuit`` を使用しています。 ただし、グローバーのアルゴリズムのオラクルとして使用できるクラスは他にもいくつかあります。 これらについては、このチュートリアルの後半で説明します。
ko_kr: Grover의 알고리즘을 ``Grover`` 클래스로 실행하려면 먼저 Grover의 알고리즘 회로에 oracle을 지정해야 한다. 다음 예에서 우리는 ``QuantumCircuit`` 를 Grover의 알고리즘의 장으로 사용한다. 하지만, 우리가 Grover의 알고리즘의 oracle로 사용할 수 있는 몇 가지 다른 클래스가 있다. 이 튜토리얼에서 나중에 설명한다.
pt_br: Para executar o algoritmo de Grover com a classe ``Grover``, primeiramente precisamos especificar um oráculo para o circuito do algoritmo de Grover. No exemplo a seguir, utilizamos ``QuantumCircuit`` como o oráculo do algoritmo de Grover. No entanto, existem diversas outras classe que podemos usar como oráculo do algoritmo de Grover. Falamos sobre eles mais tarde neste tutorial.
vi_vn: Để chạy thuật toán Grover cùng với lớp ``Grover``, trước tiên, chúng ta cần xác định một công cụ đối xứng cho mạch lượng tử của thuật toán Grover. Trong ví dụ dưới đây, ta sử dụng ``QuantumCircuit`` làm công cụ đối xứng cho thuật toán Grover. Tuy nhiên, có nhiều lớp khác có thể được sử dụng làm công cụ đối xứng của thuật toán Grover. Chúng ta sẽ đề cập đến chúng trong hướng dẫn này.

source: Note that the oracle for ``Grover`` must be a *phase-flip* oracle. That is, it multiplies the amplitudes of the of “good states” by a factor of :math:`-1`. We explain later how to convert a *bit-flip* oracle to a phase-flip oracle.
es_un: Tenga en cuenta que el oráculo para ``Grover`` deber ser un oráculo *phase-flip*. Esto significa que multiplica las amplitudes de los estados viables por un factor de :math:`-1`. Más adelante explicaremos como convertir un oráculo *bit-flip* a un oráculo phase-flip.
id_id: Perhatikan bahwa oracle untuk ``Grover`` harus merupakan oracle *pembalik fase*. Artinya, ia mengalikan amplitudo dari "state yang dicari" dengan faktor :math:`-1`. Akan dijelaskan nanti bagaimana mengkonversi sebuah oracle *pembalik bit* ke oracle pembalik fase.
ja_jp: ``Grover`` のアルゴリズムのためのオラクルは、 *位相反転* オラクルであることに注意してください。つまり 「所望の状態」 の振幅に :math:`-1` の係数を乗じています。 *ビット反転* オラクルを位相反転オラクルに変換する方法については後述します。
pt_br: Observe que o oráculo para ``Grover`` precisa ser um oráculo de *inversão de fase*. Ou seja, ele multiplica as amplitudes dos "estados bons" por um fator de :math:`-1`. Explicamos mais tarde como converter um oráculo de *inversão de bit* para um oráculo de inversão de fase.
vi_vn: Lưu ý rằng tiên tri cho ``Grover`` phải là một công cụ đối xứng *lật pha*. Nó nhân biên độ của các "trạng thái tốt" với :math:`-1`. Chúng ta sẽ giải thích cách để biến một công cụ đối xứng *lật bit* thành một công cụ đối xứng *lật pha* sau .

source: Then, we specify a backend and call the ``run`` method of ``Grover`` with a backend to execute the circuits. The returned result type is a ``GroverResult``.
es_un: Luego, especificamos un backend para llamar al método ``run`` del objeto ``Grover`` con un backend para ejecutar los circuitos. El tipo del resultado devuelto es ``GroverResult``.
id_id: Kemudian, kita menentukan sebuah backend dan memanggil metoda ``run`` dari ``Grover`` dengan sebuah backend untuk mengeksekusi sirkuit. Tipe hasil yang dikembalikan adalah ``GroverResult``.
ja_jp: 次にバックエンドを指定し、 ``Grover`` の ``run`` メソッドを呼び出して回路を実行します。返される結果の型は ``GroverResult`` です。
ko_kr: 다음으로, 백엔드를 지정하고 ``Grover`` 의 ``run`` 메서드를 백엔드와 함께 호출하여 회로를 실행한다. 반환된 결과 유형은 ``GroverResult`` 이다.
pt_br: Em seguida, especificamos um backend e chamamos o método ``run`` de ``Grover`` com um backend para executar os circuitos. O tipo de resultado retornado é um ``GroverResult``.
vi_vn: Sau đấy, chúng ta xác định một backend và thực hiện phương pháp ``run`` của ``Grover`` trên một backend để chạy các mạch. Kết quả được trả về dưới loại ``GroverResult``.

source: If the search was successful, the ``oracle_evaluation`` attribute of the result will be ``True``. In this case, the most sampled measurement, ``top_measurement``, is one of the “good states”. Otherwise, ``oracle_evaluation`` will be False.
es_un: Si la búsqueda fue exitosa, el atributo ``oracle_evaluation`` del resultado va a ser ``True``. En este caso, la medición más muestreada, ``top_measurement``, es uno de los estados deseados. De otra manera ``oracle_evaluation`` va a ser False.
id_id: Jika pencarian berhasil, atribut ``oracle_evaluation`` dari hasil akan menjadi ``True``. Dalam hal ini, pengukuran yang paling banyak dihasilkan, ``top_measurement``, adalah salah satu "state yang dicari". Jika tidak, ``oracle_evaluation`` akan menjadi False.
ja_jp: 探索が成功した場合は、 ``oracle_evaluation`` 属性が ``True`` となります。この場合、最も多くサンプリングされた測定値である ``top_measurement`` が「所望の状態」の一つであることを示します。そうでなければ、 ``oracle_evaluation`` は False となります。
ko_kr: 만약 검색이 성공하면 도출된 결과의 ``oracle_evaluation`` 속성은 ``True`` 가 될 것이다. 이 경우에는, 가장 샘플화된 측정인 ``top_measurement`` 는 “좋은 상태” 중 하나이다. 그렇지 않으면 ``oracle_evaluation`` 은 거짓이 될 것이다.
pt_br: Se a busca foi bem-sucedida, o resultado do atributo ``oracle_evaluation`` será ``True``. Neste caso, a medição mais amostrada, ``top_measurement``, é um dos "estados bons". Caso contrário, ``oracle_evaluation`` será False.
vi_vn: Nếu việc tìm kiếm thành công, thuộc tính ``oracle_evaluation`` của kết quả sẽ là ``True``. Trong trường hợp này, phép đo được lấy mẫu nhiều nhất, ``top_measurement``, là một trong những "trạng thái tốt". Nếu không, ``oracle_evaluation sẽ là False.

source: In the example, the result of ``top_measurement`` is ``11`` which is one of “good state”. Thus, we succeeded to find the answer by using ``Grover``.
es_un: En el ejemplo, el resultado de ``top_measurement`` es ``11`` el cual es uno de los estados viables. Así, logramos encontrar la respuesta usando ``Grover``.
id_id: Dalam contoh, hasil dari ``top_measurement`` adalah ``11`` yang merupakan salah satu dari "state yang dicari". Dengan demikian, kita berhasil menemukan jawabannya dengan menggunakan ``Grover``.
ja_jp: この例では、 ``top_measurement`` の結果が ``11`` となっており、これは「所望の状態」の一つとなっています。このように、 ``Grover`` を用いて解を見つけることに成功しました。
ko_kr: 예를 들어,``top_measurement`` 의 결과는``11`` 입니다.``11`` 은 좋은 상태 중 하나입니다. 그래서 우리는 ``Grover`` 를 이용해 답을 찾는 데 성공했다.
pt_br: No exemplo, o resultado de ``top_measurement`` é ``11`` que é um "estado bom". Assim, nós tivemos sucesso em encontrar a resposta utilizando ``Grover``.
vi_vn: Trong ví dụ này, kết quả ``11`` của ``top_measurement`` là một trong những "trạng thái tốt". Vì vậy, ta đã thành công trong việc tìm đáp án bằng cách sử dụng ``Grover``.

source: Using the different types of classes as the oracle of ``Grover``
es_un: Usando los diferentes tipos de clases para el oráculo de ``Grover``
id_id: Menggunakan bermacam tipe kelas berbeda sebagai oracle ``Grover``
ja_jp: ``Grover`` オラクルとしての様々なクラスの使用
ko_kr: 다양한 유형의 클래스를 ``Grover`` 의 오라클로 사용하기
pt_br: Utilizando os diferentes tipos de classes como oráculo de ``Grover``
vi_vn: Sử dụng cái kiểu lớp khác nhau làm công cụ đối xứng của ``Grover``

source: In the above example, we used ``QuantumCircuit`` as the oracle of ``Grover``. However, we can also use ``qiskit.aqua.components.oracles.Oracle``, and ``qiskit.quantum_info.Statevector`` as oracles. All the following examples are when :math:`|11\rangle` is “good state”
es_un: En el ejemplo anterior, usamos ``QuantumCircuit`` como el oráculo para ``Grover``. Sin embargo, también podemos usar ``qiskit.aqua.components.oracles.Oracle`` y ``qiskit.quantum_info.Statevector`` como oráculos. Todos los siguientes ejemplos son cuando :math:`|11\rangle` es un estado deseado
id_id: Pada contoh di atas, kita menggunakan ``QuantumCircuit`` sebagai oracle ``Grover``. Namun, kita juga dapat menggunakan ``qiskit.aqua.components.oracles.Oracle``, dan ``qiskit.quantum_info.Statevector`` sebagai oracle. Semua contoh berikut adalah ketika :math:`|11\rangle` adalah "state yang dicari"
ja_jp: 上の例では、 ``Grover`` のオラクルとして ``QuantumCircuit`` を用いました。しかし、 ``qiskit.aqua.components.oracles.Oracle`` や ``qiskit.quantum_info.Statevector`` をオラクルとして用いることも可能です。以下の例は全て、:math:`|11\rangle` が「所望の状態」である場合です。
ko_kr: 위의 예에서 우리는 ``QuantumCircuit`` 를 ``Grover`` 의 오라클로 사용했다. 그러나 우리는 또한 ``qiskit.aqua.components.oracles.Oracle`` , 과 ``qiskit.quantum_info.Statevector`` 를 오라클로 사용할 수도 있다. 다음의 예제들은 모두 :math:`|11\rangle` 가 “좋은 상태” 인 예제들이다.
pt_br: No exemplo acima, utilizamos ``QuantumCircuit`` como o oráculo de ``Grover``. No entanto, podemos também utilizar ``qiskit.aqua.components.oracles.Oracle``, e ``qiskit.quantum_info.Statevector`` como oráculos. Todos os exemplos a seguir são quando :math:`|11\rangle` é um "estado bom"
vi_vn: Trong ví dụ trên, chúng ta đã sử dụng ``QuantumCircuit`` làm tiên tri của ``Grover``. Tuy nhiên, ta cũng có thể sử dụng ``qiskit.aqua.components.oracles.Oracle``, và ``qiskit.quantum_info.Statevector`` làm công cụ đối xứng. Tất cả các ví dụ sau đều trong trường hợp :math:`|11\rangle` là "trạng thái tốt"

source: Internally, the statevector is mapped to a quantum circuit:
es_un: Internamente, para el vector de estado es mapeado a un circuito cuántico:
id_id: Secara internal, statevector dipetakan ke sirkuit kuantum:
ja_jp: 内部的には、状態ベクトルが量子回路にマッピングされています。
ko_kr: 내부적으로 상태 벡터는 다음과 같이 퀀텀 회로에 나타낸다.
pt_br: Internamente, o vetor de estados é mapeado para um circuito quântico:
vi_vn: Ở bên trong, vector trạng thái được biểu diễn trên một mạch lượng tử:
