Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/08_grover_examples.po
Languages: es_un, fr_fr, ja_jp, ko_kr, pt_br, vi_vn

source: Next, we can setup the ``Oracle`` and ``Grover`` objects to perform Quantum Search as usual.
es_un: A continuación, podemos configurar los objetos ``Oracle`` y ``Grover`` para realizar la Búsqueda Cuántica como de costumbre.
fr_fr: Ensuite, nous pouvons configurer les objets ``Oracle`` et ``Grover`` pour effectuer l'algorithme de recherche quantique.
ja_jp: 次に ``Oracle`` と ``Grover`` オブジェクトを設定して、従来通りに量子探索を実行します。
ko_kr: 다음으로 ``Oracle`` 와 ``Grover`` 객체를 설정하여 평소와 같이 Quantum Search를 수행할 수 있다.
pt_br: Em seguida, podemos configurar os objetos ``Oracle`` e ``Grover`` para executar a Busca Quântica como de costume.
vi_vn: Tiếp theo, ta có thể thiết lập các đối tượng ``Oracle`` và ``Grover`` để thực hiện tìm kiếm lượng tử như thông thường.

source: As seen in the above plot the search result coincides with our expectation.
es_un: Como se ve en la gráfica anterior el resultado de la búsqueda coincide con nuestra expectativa.
fr_fr: Comme nous l'avons vu dans le graphique ci-dessus, le résultat de la recherche coïncide avec nos attentes.
ja_jp: 上のプロットに見られるように、探索結果は予想と一致しています。
ko_kr: 위에서 볼 수 있는 바와 같이, 검색 결과는 우리의 기대와 일치한다.
pt_br: Como visto no gráfico acima, o resultado da pesquisa coincide com nossas expectativas.
vi_vn: Như đã thấy trong đồ thị trên, kết quả tìm kiếm trùng với kỳ vọng của chúng ta.

source: Let’s look at an example 3-Satisfiability (3-SAT) problem and walk-through how we can use Quantum Search to find its satisfying solutions. 3-SAT problems are usually expressed in `Conjunctive Normal Forms (CNF) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__ and written in the `DIMACS-CNF <https://www.satcompetition.org/2009/format-benchmarks2009.html>`__ format. For example:
ja_jp: 3-Satisfiability (3-SAT) 問題の例を取り上げ、量子探索を用いて充足解を見つける方法を説明します。 3-SAT 問題は通常 `Conjunctive Normal Forms (CNF) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__ で表現され、 `DIMACS-CNF <https://www.satcompetition.org/2009/format-benchmarks2009.html>`__ 形式で書かれています。例えば、以下のようになります。
ko_kr: 3-SAT (3-Satisfiability) 문제의 예를 살펴보고 Quantum Search를 사용하여 만족스러운 솔루션을 찾는 방법을 살펴보겠다. 3-SAT 문제는 일반적으로 `Conjunctive Normal Forms (CNF) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__ 로 표현되고 `DIMACS-CNF <https://www.satcompetition.org/2009/format-benchmarks2009.html>`__ 형식으로 작성된다. 예를 들면:
