Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/08_grover_examples.po
Languages: es_un, fr_fr, ja_jp, ko_kr, pt_br, vi_vn

source: This page was generated from `tutorials/algorithms/08_grover_examples.ipynb`__.
es_un: Esta página fue generada a partir de `tutorials/algorithms/08_grover_examples.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/algorithms/08_grover_examples.ipynb`__.
ja_jp: このページは `tutorials/algorithms/08_grover_examples.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/algorithms/08_grover_examples.ipynb`__ 로부터 생성되었다.
pt_br: Esta página foi gerada, a partir do `tutorials/algorithms/08_grover_examples.ipynb`__.
vi_vn: Trang này được tạo từ `tutorials/algorithms/08_grover_examples.ipynb`__.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/08_grover_examples.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/08_grover_examples.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/08_grover_examples.ipynb>`_.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/08_grover_examples.ipynb>`_ でインタラクティブに実行します。
ko_kr: `IBM 퀀텀 랩 <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/08_grover_examples.ipynb>`_ 에서 대화식으로 실행하시오.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/08_grover_examples.ipynb>`_.
vi_vn: Chạy tương tác trực tiếp trong `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/08_grover_examples.ipynb>`_.

source: Grover’s algorithm examples
es_un: Ejemplos de algoritmos de Grover
fr_fr: Exemples avec l'algorithme de Grover
ja_jp: Grover のアルゴリズムの例
ko_kr: 그로버 알고리즘 예제들
pt_br: Exemplos do algoritmo de Grover
vi_vn: Ví dụ về thuật toán Grover

source: This notebook has examples demonstrating how to use the Qiskit `Grover <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Grover.html>`__ search algorithm, with different oracles.
es_un: Este cuaderno tiene ejemplos que demuestran cómo utilizar el algoritmo de búsqueda `Grover <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Grover.html>`__ de Qiskit, con distintos oráculos.
fr_fr: Ce bloc-notes présente des exemples montrant comment utiliser l'algorithme de recherche Qiskit `Grover <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Grover.html>'__, en utilisant différents oracles.
ja_jp: このノートブックでは、 Qiskit の `Grover <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Grover.html>`__ 探索アルゴリズムを様々なオラクルで使用する方法を示しています。
ko_kr: 본 노트북에는 `Grover <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Grover.html>`__ 검색 알고리즘을 다양한 오라클과 함께 사용하는 방법을 설명하는 예제가 있다.
pt_br: Este notebook tem exemplos demonstrando como usar o algoritmo de busca de `Grover <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Grover.html>`__ do Qiskit com diferentes oráculos.
vi_vn: Notebook này có chứa ví dụ miêu tả cách sử dụng thuật toán tìm kiếm `Grover <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Grover.html>`__ trong Qiskit, với nhiều oracle khác nhau.

source: Finding solutions to 3-SAT problems
es_un: Encontrando soluciones a problemas 3-SAT
fr_fr: Trouver des solutions aux problèmes 3-SAT
ja_jp: 3-SAT 問題の求解
ko_kr: 3-SAT 문제에 대한 해결책 찾기
pt_br: Encontrando soluções para problemas de 3-SAT
vi_vn: Tìm giải pháp cho bài toán 3-SAT

source: Let’s look at an example 3-Satisfiability (3-SAT) problem and walk-through how we can use Quantum Search to find its satisfying solutions. 3-SAT problems are usually expressed in `Conjunctive Normal Forms (CNF) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__ and written in the `DIMACS-CNF <http://www.satcompetition.org/2009/format-benchmarks2009.html>`__ format. For example:
es_un: Echemos un vistazo a un ejemplo de problema Satisfacibilidad con 3 variables (3-SAT) y descubramos cómo podemos utilizar la Búsqueda Cuántica para encontrar sus soluciones satisfactorias. Los problemas 3-SAT generalmente se expresan en `Formularios Normales Conjuntivos (Conjunctive Normal Forms, CNF) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__ y están escritos en el formato `DIMACS-CNF <http://www.satcompetition.org/2009/format-benchmarks2009.html>`__. Por ejemplo:
fr_fr: Examinons un exemple de probleme de satisfaction 3-SAT et la façon dont nous pouvons utiliser l'algorithme de recherche quantique pour trouver ses solutions. Les problèmes 3-SAT sont habituellement exprimés dans le format `Conjonctive Normal Forms (CNF) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__ et écrit dans le format `DIMACS-CNF <http://www.satcompetition.org/2009/format-benchmarks2009.html>` __. Par exemple :
pt_br: Vamos olhar um exemplo de problema de 3-Satisfiability (3-SAT) e avançar em como podemos usar a Busca Quântica para encontrar as soluções satisfatórias. Problemas de 3-SAT geralmente são expressos em `Formulários Normais Conjuntivos (CNF) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__ e escritos no formato `DIMACS-CNF <http://www.satcompetition.org/2009/format-benchmarks2009.html>`__. Por exemplo:
vi_vn: Hãy quan sát ví dụ về một vấn đề 3-Satisfiability (3-SAT) và hướng dẫn ta cách sử dụng tìm kiếm lượng tử để tìm các giải pháp thỏa mãn. Các vấn đề 3-SAT thường được biểu diễn dưới dạng `Conjuctive Normal Forms (CNF) <https://en.wikipedia.org/wiki/Conjunctive_normal_form>`__ và viết dưới format `DIMACS-CNF <http://www.satcompetition.org/2009/format-benchmarks2009.html>`__. Ví dụ:

source: The CNF of this 3-SAT instance contains 3 variables and 5 clauses:
es_un: El CNF de esta instancia 3-SAT contiene 3 variables y 5 cláusulas:
fr_fr: Le CNF de cette instance 3-SAT contient 3 variables et 5 clauses :
ja_jp: この 3-SAT インスタンスの CNF には、 3 つの変数と 5 つの節が含まれています。
ko_kr: 이 3-SAT 인스턴스의 CNF는 3개의 변수와 5개의 절을 포함한다:
pt_br: O CNF desta instância de 3-SAT contém 3 variáveis e 5 cláusulas:
vi_vn: CNF của trường hợp 3-SAT này bao gồm 3 biến số và 5 mệnh đề:

source: It can be verified that this 3-SAT problem instance has three satisfying solutions:
es_un: Se puede verificar que esta instancia de problema 3-SAT tiene tres soluciones satisfactorias:
fr_fr: On peut vérifier que l'instance 3-SAT présente trois solutions satisfaisantes :
ja_jp: この 3-SAT 問題のインスタンスには、以下の 3 つの充足解があることが確認できます。
ko_kr: 이 3-SAT 문제 인스턴스는 다음과 같은 세 가지 해결책을 갖고 있다는 것을 확인할 수 있다.
pt_br: Pode-se verificar que esta instância do problema de 3-SAT tem três soluções satisfatórias:
vi_vn: Có thể xác minh việc ví dụ vấn đề 3-SAT này có ba giải pháp thỏa mãn:

source: Or, expressed using the DIMACS notation:
es_un: O, expresado usando la notación DIMACS:
fr_fr: Ou, exprimée à l'aide de la notation DIMACS :
ja_jp: あるいは、 DIMACS 表記を用いて表現すれば、以下のようになります。
ko_kr: 또는 DIMACS 표기법을 사용하여 표현하시오.
pt_br: Ou, expresso usando a notação DIMACS:
vi_vn: Hoặc, biểu diễn dưới ký hiệu DIMACS:

source: ``1 -2 3``, or ``-1 -2 -3``, or ``1 2 -3``.
fr_fr: ``1 -2 3``, ou ``-1 -2 -3``, ou ``1 2 -3``.
ko_kr: ``1 -2 3`` 혹은 ``-1 -2 -3`` 혹은 ``1 2 -3``.

source: With this example problem input, we then create the corresponding ``oracle`` for our ``Grover`` search. In particular, we use the ``LogicalExpressionOracle`` component, which supports parsing DIMACS-CNF format strings and constructing the corresponding oracle circuit.
es_un: Con esta entrada de problema de ejemplo, creamos el ``oracle`` correspondiente para nuestra búsqueda ``Grover``. En particular, utilizamos el componente ``LogicalExpressionOracle``, que soporta analizar cadenas con formato DIMACS-CNF y construir el correspondiente circuito del oráculo.
fr_fr: Avec cet exemple d'entrée de problème, nous créons ensuite l'``oracle`` correspondant pour notre recherche ``Grover``. En particulier, nous utilisons le composant ``LogicalExpressionOracle``, qui prend en charge l'analyse syntaxique des chaînes de format DIMACS-CNF et la construction du circuit oracle correspondant.
ja_jp: この例題を入力として、 ``Grover`` 探索に対応する ``oracle`` を作成します。特に DIMACS-CNF 形式の文字列を解析し、対応するオラクル回路を構築するために、 ``LogicalExpressionOracle`` コンポーネントを用います。
ko_kr: 이 예제 문제 입력을 통해 우리는 ``Grover`` 검색을 위해 해당 ``oracle`` 을 작성한다. 특히, 여기에는 ``LogicalExpressionOracle`` 성분을 사용하는데, 이는 DIMACS-CNF 포맷 문자열의 파싱 및 대응하는 oracle 회로를 구성하는 것을 지원한다.
pt_br: Com este exemplo de entrada do problema, criamos então o ``oracle`` correspondente para a nossa busca de ``Grover``. Em particular, utilizamos a componente ``LogicalExpressionOracle``, que suporta a interpretação de strings no formato DIMACS-CNF e a construção do circuito do oráculo correspondente.
vi_vn: Với ví dụ vấn đề đầu vào này, ta có thể tạo ``oracle`` tương ứng cho tìm kiếm ``Grover``. Cụ thể hơn, ta sử dụng phần tử ``LogicalExpressionOracle`` có hỗ trợ phân tích các xâu format DIMACS-CNF và xây dựng mạch đối xứng tương ứng.

source: The ``oracle`` can now be used to create an Grover instance:
es_un: El ``oracle`` ahora se puede utilizar para crear una instancia de Grover:
fr_fr: L'``oracle`` peut désormais être utilisé pour créer une instance de Grover:
ja_jp: これで ``oracle`` を用い、 Grover のインスタンスを作成できるようになりました。
ko_kr: 이제 Grover 인스턴스를 생성하는 데 ``oracle`` 을 사용할 수 있다.
pt_br: O ``oracle`` agora pode ser usado para criar uma instância de Grover:
vi_vn: ``Oracle`` giờ có thể được dùng để tạo một instance Grover:

source: We can then configure the backend and run the Grover instance to get the result:
es_un: Entonces podemos configurar el backend y ejecutar la instancia de Grover para obtener el resultado:
fr_fr: Nous pouvons alors configurer le backend et exécuter l'instance de Grover pour obtenir le résultat :
ja_jp: そしてバックエンドを設定し、 Grover インスタンスを実行して結果を得ることができます。
ko_kr: 그런 다음 백엔드를 구성하고 Grover 인스턴스를 실행하여 결과를 얻을 수 있다.
pt_br: Podemos, então, configurar o backend e executar a instância de Grover para obter o resultado:
vi_vn: Sau đó ta có thể thiết lập backend và chạy thực thể Grover để thu về kết quả:

source: As seen above, a satisfying solution to the specified 3-SAT problem is obtained. And it is indeed one of the three satisfying solutions.
es_un: Como se vio anteriormente, se obtiene una solución satisfactoria al problema 3-SAT especificado. Y ciertamente, sí es una de las tres soluciones satisfactorias.
fr_fr: Comme on l'a vu ci-dessus, une solution satisfaisante au problème du 3-SAT est obtenue, et c'est en effet l'une des trois solutions satisfaisantes.
ja_jp: 上記のように、与えられた 3-SAT 問題の充足解が得られています。そして、それは確かに三つある充足解のうちの一つとなっています。
ko_kr: 위에서 볼 수 있듯이 지정된 3-SAT 문제에 대한 만족스러운 솔루션을 얻는다. 그리고 획득한 솔루션은 실제로 세 가지 만족스러운 솔루션 중 하나이다.
pt_br: Como visto acima, uma solução satisfatória para o problema de 3-SAT especificado é obtida. E é de fato uma das três soluções satisfatórias.
vi_vn: Như đã thấy ở trên, ta đã thu được một giải pháp thỏa mãn cho vấn đề 3-SAT được nhắc tới. Và nó đúng là một trong ba giải pháp thỏa mãn.

source: Since we used the ``'qasm_simulator'``, the complete measurement result is also returned, as shown in the plot below, where it can be seen that the binary strings ``000``, ``011``, and ``101`` (note the bit order in each string), corresponding to the three satisfying solutions all have high probabilities associated with them.
es_un: Dado que usamos el ``'qasm_simulator'``, también es devuelto el resultado completo de la medición, como se muestra en la gráfica siguiente, donde se puede ver que las cadenas binarias `000``, ``011``, y ``101`` (observa el orden de los bits en cada cadena), correspondientes a las tres soluciones satisfactorias, tienen todas altas probabilidades asociadas.
fr_fr: Puisque nous avons utilisé le ``'qasm_simulator'``, le résultat de la mesure est également retourné, comme indiqué dans le graphique ci-dessous, où il peut être vu que les chaînes binaires ``000``, ``011``, et ``101`` (notez l'ordre des bits dans chaque chaîne), correspondant aux trois solutions satisfaisantes ont toutes des probabilités élevées associées avec elles.
ja_jp: ``qasm_simulator`` を用いたので、以下に示すように完全な測定結果も返されます。三つの解に対応するバイナリ文字列 ``000``, ``011``, ``101`` (それぞれの文字列のビット順に注意してください) は、全て高い確率ももっていることがわかります。
ko_kr: ``'qasm_simulator'`` 를 사용했기 때문에, 아래의 플롯과 같이 전체 측정 결과도 반환된다. 여기서 바이너리 문자열 ``000``과 ``011``과 ``101`` (각 문자열의 비트 순서에 주의) 들은 모두 이에 대응되는 높은 확률을 갖는 3 개의 만족하는 솔루션에 대응한다.
pt_br: Como usamos o ``'qasm_simulator'``, o resultado completo da medição também é retornado, como mostrado no gráfico abaixo, onde pode ser visto que as strings binárias ``000``, ``011``, e ``101`` (note a ordem dos bits em cada string) correspondetes às três soluções satisfatórias têm todas altas probabilidades associadas a elas.
vi_vn: Vì chúng ta đã sử dụng ``qasm_simulator``, kết quả số đo hoàn chỉnh cũng được trả lại, như đã thấy ở đồ thị bên dưới. Các xâu nhị phân ``000``, ``011``, và ``101`` (lưu ý trật tự bit ở mỗi xâu) tương ứng với 3 giải pháp thỏa mãn đều có xác suất cao liên quan tới chúng.

source: Boolean Logical Expressions
es_un: Expresiones lógicas booleanas
fr_fr: Expressions Logiques Booléennes
ja_jp: ブール論理表現
ko_kr: 불리언(Boolean) 논리 표현식
pt_br: Expressões Lógicas Booleanas
vi_vn: Biểu thức logic (Boolean)

source: Qiskit’s ``Grover`` can also be used to perform Quantum Search on an ``Oracle`` constructed from other means, in addition to DIMACS. For example, the ``LogicalExpressionOracle`` can actually be configured using arbitrary Boolean logical expressions, as demonstrated below.
es_un: El algoritmo de ``Grover`` de Qiskit también se puede utilizar para realizar una Búsqueda Cuántica en un ``Oracle`` construido de otros medios, además de DIMACS. Por ejemplo, el ``LogicalExpressionOracle`` puede ser configurado usando expresiones lógicas booleanas arbitrarias, como se demuestra a continuación.
fr_fr: ``Grover`` peut également être utilisé pour effectuer une recherche quantique sur un ``Oracle`` construit à partir d'autres moyens, en plus de DIMACS. Par exemple, ``LogicalExpressionOracle`` peut en fait être configuré à l'aide d'expressions logiques booléennes arbitraires, comme indiqué ci-dessous.
ja_jp: Qiskit の ``Grover`` は DIMACS 以外にも、他の手段で構築された ``oracle`` に基づいた量子探索を実行することが可能です。例えば ``LogicalExpressionOracle`` は、以下に示すように、任意のブール論理表現を用いて実際に設定することができます。
ko_kr: 키스킷의 ``Grover`` 는 또한 DIMM외에 다른 방법으로 구성된 ``Oracle`` 에서 퀀텀 서치(Quantum Search) 를 수행하는 데 사용될 수 있다. 예를 들어, ``LogicalExpressionOracle`` 은 실제로 임의의 불리언 논리식을 사용하여 구성할 수 있다.
pt_br: O ``Grover`` do Qiskit também pode ser usado para executar a Busca Quântica em um ``Oracle`` construído a partir de outros meios, além de DIMACS. Por exemplo, o ``LogicalExpressionOracle`` pode na verdade ser configurado usando expressões lógicas Booleanas arbitrárias, como demonstrado abaixo.
vi_vn: ``Grover`` của Qiskit cũng có thể được sử dụng để thực hiện tìm kiếm lượng tử trên ``Oracle`` được xây dựng bằng cách khác ngoài DIMACS. Ví dụ, ``LogicalExpressionOracle`` có thể được cấu hình bằng các biểu thức logic Boolean tùy ý, được minh họa ở dưới.

source: In the example above, the input Boolean logical expression ``'(w ^ x) & ~(y ^ z) & (x & y & z)'`` should be quite self-explanatory, where ``^``, ``~``, and ``&`` represent the Boolean logical XOR, NOT, and AND operators, respectively. It should be quite easy to figure out the satisfying solution by examining its parts: ``w ^ x`` calls for ``w`` and ``x`` taking different values; ``~(y ^ z)`` requires ``y`` and ``z`` be the same; ``x & y & z`` dictates all three to be ``True``. Putting these together, we get the satisfying solution ``(w, x, y, z) = (False, True, True, True)``, which our ``Grover``\ ’s result agrees with.
es_un: En el ejemplo anterior, la expresión lógica booleana de entrada ``'(w ^ x) & ~(y ^ z) & (x & y & z)'`` debe ser bastante autoexplicativa, donde ``^``, ``~``, y ``&`` representan los operadores lógicos booleanos XOR, NOT, y AND, respectivamente. Debería ser bastante fácil averiguar la solución satisfactoria examinando sus partes: ``w ^ x`` llama para ``w`` y ``x`` tomando diferentes valores; ``~(y ^ z)`` requiere que ``y`` y ``z`` sean iguales; ``x & y & z`` dicta que los tres sean ``True``. Colocando esto junto, obtenemos la solución satisfactoria ``(w, x, y, z) = (False, True, True, True)``, con la que el resultado de nuestro objeto ``Grover`` concuerda.
fr_fr: Dans l'exemple ci-dessus, l'expression logique en entrée Booléenne ``'(w ^ x) & ~(y ^ z) & (x & y & z)'`` devrait être assez explicite, où les opérateurs ``^``, ``~`` et ``&`` représentent respectivement les opérateurs Boolean logical XOR, NOT et AND. Il devrait être assez facile de trouver la solution satisfaisante en examinant ses composantes : ``w ^ x`` nécéssite que ``w`` et ``x`` aient des valeurs différents ; ``~(y ^ z)`` impose que que ``y`` et ``z`` aient la même valeur; ``x & y & z`` impose que les trois valeurs soient à ``True``. En combinant ces trois contraintes nous obtenons la solution satisfaisante ``(w, x, y, z) = (False, True, True, True)``, an accord avec notre résultat obtenu avec ``Grover``.
ja_jp: 上の例では、``^``, ``~``, ``&`` がそれぞれブール論理における XOR, NOT, AND 演算を表しており、入力されたブール論理表現 ``'(w ^ x) & ~(y ^ z) & (x & y & z)'`` は非常にわかりやすいはずです。それぞれの部分を調べることで、充足解を見つけるのはとても簡単なはずです。 ``w ^ x`` は ``w`` と ``x`` が異なる値を取ることを、 ``~(y ^ z)`` は ``y`` と ``z`` が同じであることを、``x & y & z`` は三つが全て ``True`` であることをそれぞれ必要とします。これらを組み合わせると、充足解 ``(w, x, y, z) = (False, True, True, True)`` が得られ、これは ``Grover`` の結果と一致しています。
ko_kr: 위의 예에서, 입련된 불리언 논리 표현식 ``'(w ^ x) & ~(y ^ z) & (x & y & z)'`` 은 상당히 스스로 설명가능(self-explanatory) 해야 하는데, ``^``, ``~``, ``&`` 는 각각 불리언 논리 XOR, NOT, AND 오퍼레이터를 나타낸다. 각 요소들을 살펴보면 만족스러운 솔루션을 쉽게 찾을 수 있다: ``w ^ x`` 는 ``w`` 와 ``x`` 가 서로 다른 값을 갖도록; ``~(y ^ z)`` 는 ``y`` 와 ``z`` 가 같은 값을 갖도록; ``x & y & z`` 는 모든 세 값이 반드시 ``True`` 가 되도록 호출한다. 이를 종합해보면, ``Grover`` 들의 결과와 일치하는 만족스러운 솔루션 ``(w, x, y, z) = (False, True, True, True)`` 를 얻는다.
pt_br: No exemplo acima, a expressão lógica booleana de entrada ``'(w ^ x) & ~(y ^ z) & (x & y & z)'`` deve ser bastante auto-explicativa, onde ``^``, ``~`` e ``&`` representam os operadores booleanos XOR, NOT e AND respectivamente. Deve ser relativamente fácil descobrir a solução satisfatória examinando as suas partes: ``w ^ x`` resulta em ``w`` e ``x`` tomando valores diferentes; ``~(y ^ z)`` requer que ``y`` e ``z`` sejam o mesmo; ``x & y & z`` dita que todos os três sejam ``True``. Juntando isso, obtemos a solução satisfatória ``(w, x, y, z) = (False, True, True, True)``, que concorda com o resultado do nosso ``Grover``.
vi_vn: Ở ví dụ trên, đầu vào biểu thức logic bool ``'(w ^ x) & ~(y ^ z) & (x & y & z)'`` khá là dễ hiểu, với ``^``, ``~``, và ``&`` tương ứng với lần lượt các toán tử logic bool XOR, NOT và AND. Chúng ta có thể thu được giải pháp thỏa mãn thông qua việc xem xét các thành phần của nó: ``w ^ x`` yêu cầu ``w`` và ``x`` có giá tị khác nhau; ``~(y ^ z)`` yêu cầu ``y`` và ``z`` giống nhau; ``x & y & z`` yêu cầu cả ba là ``True``. Kết hợp chúng với nhau, ta thu được giải pháp thỏa mãn ``(w, x, y, z) = (False, True, True, True)``, giống với kết quả của ``Grover``\.

source: TruthTable Oracles
es_un: Oráculos a partir de Tablas de Verdad
fr_fr: Oracles à Table de Vérité
ja_jp: TruthTable オラクル
ko_kr: 오라클의 진리표
pt_br: Oráculos TruthTable
vi_vn: Công cụ đối xứng bảng chân trị

source: With Qiskit, ``Oracle``\ s can also be constructed from truth tables, meaning we can also perform Quantum Search on truth tables. Even though this might seem like a moot point as we would be essentially searching for entries of a truth table with the :math:`1` value, it’s a good example for demonstrative purpose.
es_un: Con Qiskit, el objeto ``Oracle`` también puede ser construido a partir de tablas de la verdad, lo que significa que también podemos realizar la Búsqueda Cuántica sobre tablas de la verdad. Aunque esto pueda parecer un punto de discusión, ya que estaríamos buscando esencialmente entradas de una tabla de verdad con el valor :math:`1`. es un buen ejemplo para propósitos demostrativos.
fr_fr: Avec Qiskit, les `` Oracle``\ s peuvent également être construit à partir de tables de vérité, ce qui signifie que nous pouvons également effectuer des recherches quantiques sur les tables de vérité. Même si cela peut sembler un point sans objet puisque nous rechererions essentiellement des entrées d'une table de vérité avec la valeur :math:`1`, c'est un bon exemple à des fins de démonstration.
ja_jp: Qiskit を用いると、 ``Oracle`` は真理値表からも構築することができ、言い換えると真理値表に基づいて量子探索を実行することができます。これは本質的には、 :math:`1` の値をもつ真理値表のエントリーを検索することになるので、意味がないように思えるかもしれませんが、実演のためには良い例となっています。
ko_kr: 키스킷을 사용하면 ``Oracle`` 들 또한 진리표에서 구성될 수 있으며, 이는 또한 진리표에서 Quantum Search를 수행할 수 있다는 것을 의미한다. 진리표에서 :math:`1` 값을 탐색하는 것이 논점(moot point)처럼 보여질 수 있지만, 이는 여전히 설명을 위한 좋은 예이다.
pt_br: Com Qiskit, ``Oracle`` \ s também podem ser construídos a partir de tabelas verdade, significando que também podemos realizar a Busca Quântica em tabelas verdade. Ainda que isso possa parecer um ponto discutível já que nós estaremos essencialmente buscando entradas de uma tabela verdade com o valor :math:`1`, é um bom exemplo para fins demonstrativos.
vi_vn: Trong Qiskit, ``Oracle``\ còn có thể được xây dựng từ các bảng chân trị, nghĩa là ta có thể thực hiện tìm kiếm lượng tử trên các bảng chân trị. Mặc dù điều này có vẻ giống như một điều hiển nhiên vì chúng ta căn bản là đang tìm các phần tử của bảng chân trị với giá trị :math:`1`, nó vẫn là một ví dụ minh họa tốt.

source: As shown, the ``truthtable`` is specified with a bitstring containing values of all entries in the table. It has length :math:`16`, so the corresponding truth table is of :math:`4` input bits. Since the very first and last values are :math:`1`, the corresponding truth table target entries are ``0000`` and ``1111``.
es_un: Como se muestra, la variable ``truthtable`` se especifica con una cadena de bits que contiene valores de todas las entradas en la tabla. Tiene longitud :math:`16`, así que la tabla de verdad correspondiente es de :math:`4` bits de entrada. Dado que el primer y último valor son :math:`1`, las entradas de destino correspondientes de la tabla de verdad son ``0000`` y ``1111``.
fr_fr: Comme indiqué, la valeur ``truthtable`` est spécifiée avec une chaîne de bits contenant les valeurs de toutes les entrées de la table. Il a une longueur de :math:`16`, donc la table de vérité correspondante a :math:`4` bits en entrée. Etant donné que les toutes premières et dernières valeurs sont :math:`1`, les entrées de la table de vérité correspondante sont ``0000`` et ``1111``.
ja_jp: このように ``truthtable`` は表内の全てのエントリーの値を含むビット列で指定されます。この長さは :math:`16` であるので、対応する真理値表は :math:`4` の入力ビットで構成されます。最初と最後の値が :math:`1` であるため、対応する真理値表のエントリは ``0000``` と ``1111`` です。
ko_kr: 표시된 바와 같이, ``truthtable`` 은 테이블에 있는 모든 항목의 값을 포함하는 비트 문자열로 지정된다. 길이는 :math:`16`이므로 해당 진리표`는 :math:`4` 입력 비트이다. 첫 번째 값과 마지막 값은 :math:`1` 이므로 해당하는 진리표 목표 항목은 ``0000`` 와 ``1111`` 이다.
pt_br: Como mostrado, a ``truthtable`` é especificada com uma bitstring contendo valores de todas as entradas na tabela. Ela tem tamanho :math:`16`, então a tabela de verdade correspondente tem :math:`4` bits de entrada. Como o primeiro e o último valor são :math:`1`, as entradas alvo da tabela verdade são ``0000`` e ``1111``.
vi_vn: Như ta đã thấy, ``truthtable`` được xác định bởi một chuỗi bit bao gồm giá trị của tất cả các phần tử trong bảng. Nó có chiều dài :math:`16`, cho nên bảng chân trị tương ứng có :math:`4` bit đầu vào. Vì giá trị đầu và cuối là :math:`1`, bảng chân trị tương ứng có các giá trị được nhắm tới là ``0000`` và ``1111``.
