Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/09_IQPE.po
Languages: bn_bn, fr_fr, ja_jp, ko, pt_un, ru_ru, ta_in, te, tr

source: As seen in the theory, in order to extract the phase bit :math:`\varphi_{1}`, we perform a phase correction of :math:`-\pi\varphi_2/2`. Of course, we need to apply the phase correction in the circuit only if the phase bit :math:`\varphi_2=1`, i.e. we have to apply the phase correction of :math:`-\pi/2` only if the classical bit :math:`c_0` is 1.
te: సిద్ధాంతంలో చూసినట్లుగా, దశ బిట్‌ను సంగ్రహించడానికి :math:`\varphi_{1}`, మేము :math:`-\pi\varphi_2/2` యొక్క దశ సవరణను చేస్తాము. వాస్తవానికి, ఫేజ్ బిట్ :math:`\varphi_2=1`, అయితే మనం సర్క్యూట్‌లో దశ సవరణను వర్తింపజేయాలి, అంటే క్లాసికల్ బిట్ :math:`c_0` 1 అయితే మాత్రమే మనం :math:`-\pi/2` దశ దిద్దుబాటును వర్తింపజేయాలి.

source: Application of the Control-:math:`U` gates and x-measurement (for step 2)
te: నియంత్రణ యొక్క అప్లికేషన్-:math:`U` గేట్‌లు మరియు x-మెజర్‌మెంట్ (దశ 2 కోసం)
tr: Kontrollü-:math:`U` kapıları ve x-ölçümünün uygulanması (2. adım için)

source: We apply the :math:`CU` operations as we did in the first step. For the second step we have :math:`t=m-2`, hence :math:`2^t=1`. So we apply :math:`\text{CP}(\pi/2)` once. And then we perform the X-measurement of the qubit :math:`q_0`, storing the result, the phase bit :math:`\varphi_1`, in the bit :math:`c_1` of classical register.
te: మేము మొదటి దశలో చేసినట్లుగా :math:`CU` కార్యకలాపాలను వర్తింపజేస్తాము. రెండవ దశ కోసం మనకు :math:`t=m-2`, అందుకే :math:`2^t=1`. కాబట్టి మనం :math:`\text{CP}(\pi/2)`ని ఒకసారి వర్తింపజేస్తాము. ఆపై మేము క్విట్ :math:`q_0` యొక్క X-మెజర్‌మెంట్‌ను నిర్వహిస్తాము, ఫలితాన్ని, దశ బిట్:math:`\varphi_1`ని, క్లాసికల్ రిజిస్టర్‌లోని బిట్:math:`c_1`లో నిల్వ చేస్తాము.
tr: İlk adımda yaptığımız gibi :math:`CU` işlemini uygularız. İkinci adımda :math:`2^t=1` olduğundan dolayı :math:`t=m-2`'ye sahibiz. Böylece bir kere :math:`\text{CP}(\pi/2)` uygularız ve sonra kübit :math:`q_0`ın X-ölçümünü gerçekleştiririz ardından sonucunda faz bitini :math:`\varphi_1` klasik yazmacın :math:`c_1` biti içinde saklarız.

source: Let's sample the circuit with Qiskit Aer's ``Sampler`` primitive, a local simulator without noise that runs locally.
te: Qiskit Aer యొక్క ``Sampler`` ఆదిమ, శబ్దం లేకుండా స్థానికంగా నడిచే స్థానిక సిమ్యులేటర్‌తో సర్క్యూట్‌ను శాంపిల్ చేద్దాం.

source: Now, we want to apply the IPE algorithm to estimate the phase for a 2-qubit gate :math:`U`. For this example, let's consider the controlled version of the :math:`T` gate, i.e. the gate :math:`U=\textrm{Controlled-}T` (that from now we will express more compactly with :math:`CT`). Its matrix is
te: ఇప్పుడు, మేము 2-క్విట్ గేట్ కోసం దశను అంచనా వేయడానికి IPE అల్గారిథమ్‌ను వర్తింపజేయాలనుకుంటున్నాము :math:`U`. ఈ ఉదాహరణ కోసం, :math:`T` గేట్ యొక్క నియంత్రిత సంస్కరణను పరిశీలిద్దాం,అంటే గేట్ :math:`U=\textrm{Controlled-}T` (ఇప్పటి నుండి మనం :math:`CT`తో మరింత సంక్షిప్తంగా వ్యక్తపరుస్తాము). దీని మాతృక

source: Let's consider to estimate the phase :math:`\phi=\pi/4` for the eigenstate :math:`|11\rangle`, we should find :math:`\varphi=1/8`, since :math:`\phi = 2 \pi \varphi`. Therefore to estimate the phase we need exactly 3 classical bits, i.e. :math:`m=3`, since :math:`1/2^3=1/8`. So :math:`\varphi=0.\varphi_1\varphi_2\varphi_3`.
te: ఈజెన్‌స్టేట్ :math:`|11\rangle` కోసం దశ :math:`\phi=\pi/4` అంచనా వేయడానికి పరిశీలిద్దాం, మనం :math:`\varphi=1/8` కనుక్కోవాలి, ఎందుకంటే :math: `\phi = 2 \pi \varphi`. కాబట్టి దశను అంచనా వేయడానికి మనకు ఖచ్చితంగా 3 క్లాసికల్ బిట్‌లు అవసరం, అనగా :math:`m=3`, నుండి :math:`1/2^3=1/8`. కాబట్టి :math:`\varphi=0.\varphi_1\varphi_2\varphi_3`.

source: Then we have to apply multiple times the :math:`CU` operator, that, in this example, is the Controlled-:math:`CT` gate (:math:`CCT` for short).
ko: 그런 다음 :math:`CU` 연산자를 여러 번 적용해야 한다. 이 예에서는 Controlled-:math:`CT` 게이트(줄여서 :math:`CCT`) 이다.
te: అప్పుడు మనం :math:`CU` ఆపరేటర్‌ని అనేకసార్లు వర్తింపజేయాలి, ఈ ఉదాహరణలో, కంట్రోల్డ్-:math:`CT` గేట్ (:math:`CCT` సంక్షిప్తంగా).
tr: Bundan sonra :math:`CU` operatörünü birden fazla uygulamamız gerekiyor. Bu da, bu örnekte, Kontrollü-:math:`CT` kapısıdır (kısaca :math:`CCT`).

source: Let's apply :math:`2^t` times :math:`\text{MCP}(\pi/4)`. Since for the first step :math:`t=m-1` and :math:`m=3`, we have :math:`2^t=4`.
te: దరఖాస్తు చేద్దాం :math:`2^t` సార్లు :math:`\text{MCP}(\pi/4)`. మొదటి దశ కోసం :math:`t=m-1` మరియు :math:`m=3`, మేము :math:`2^t=4`ని కలిగి ఉన్నాము.

source: Finally, we perform the measurement of the auxiliary qubit in X-basis. We can use the ``x_measurement`` function defined above in the example for 1-qubit gate. In this way we have obtained the phase bit :math:`\varphi_3` and stored it in the classical bit :math:`c_0`.
te: చివరగా, మేము X- బేసిస్‌లో సహాయక క్విట్ యొక్క కొలతను చేస్తాము. మేము 1-క్విట్ గేట్ కోసం ఉదాహరణలో పైన నిర్వచించిన ``x_measurement`` ఫంక్షన్‌ని ఉపయోగించవచ్చు. ఈ విధంగా మనం ఫేజ్ బిట్ :math:`\varphi_3`ని పొందాము మరియు దానిని క్లాసికల్ బిట్ :math:`c_0`లో నిల్వ చేసాము.
tr: Son olarak yardımcı kübitin ölçümünü X-bazında gerçekleştiriyoruz. 1-kübitlik kapı için örnekte yukarıda tanımlanan ``x_measurement`` fonksiyonunu kullanabiliriz. Bu şekilde :math:`\varphi_3` faz bitini elde ettik ve onu klasik :math:`c_0` bitinde sakladık.

source: We apply the :math:`CU` operations as we did in the first step. For the second step we have :math:`t=m-2`, hence :math:`2^t=2`. So we apply :math:`\text{MCP}(\pi/4)` :math:`2` times. And then we perform the X-measurement of the qubit :math:`q_0`, storing the phase bit :math:`\varphi_2` in the bit :math:`c_1`.
te: మేము మొదటి దశలో చేసినట్లుగా :math:`CU` కార్యకలాపాలను వర్తింపజేస్తాము. రెండవ దశ కోసం మనకు :math:`t=m-2`, అందుకే :math:`2^t=2`. కాబట్టి మేము :math:`\text{MCP}(\pi/4)` :math:`2` సార్లు వర్తింపజేస్తాము. ఆపై మేము క్విట్ :math:`q_0` యొక్క X-మెజర్‌మెంట్‌ను నిర్వహిస్తాము, ఫేజ్ బిట్ :math:`\varphi_2`ని బిట్‌లో నిల్వ చేస్తాము :math:`c_1`.
tr: İlk adımda yaptığımız gibi yine :math:`CU` işlemlerini uyguluyoruz. İkinci adım için elimizde :math:`t=m-2` var, dolayısıyla :math:`2^t=2`. Yani, :math:`2` kere :math:`\text{MCP}(\pi/4)` uyguluyoruz. Ve sonra, :math:`q_0` kübitinin X-ölçümünü gerçekleştiriyoruz ve :math:`\varphi_2` faz bitini :math:`c_1` bitinde depoluyoruz.

source: Then at the 3rd step we have to perform the phase correction of :math:`-2\pi 0.0\varphi_{2}\varphi_{3}= -2\pi \left(\frac{\varphi_2}{4}+\frac{\varphi_3}{8}\right)=-\frac{\varphi_2\pi}{2}-\frac{ \varphi_3\pi}{4}`, thus we have to apply 2 conditioned phase corrections, one conditioned by :math:`\varphi_3` (:math:`=c_0`) and the other by :math:`\varphi_2`\ (:math:`=c_1`). To do this we have to apply the following: - gate :math:`P(-\pi/4)` conditioned by :math:`c_0=1`, that is, by :math:`c=001` (``c_if`` with value :math:`1`) - gate :math:`P(-\pi/2)` conditioned by :math:`c_1=1`, that is, the gate is applied when :math:`c=010` (``c_if`` with values :math:`2`) - gate :math:`P(-3\pi/4)` conditioned by :math:`c_1=1` and :math:`c_0=1` that is, the gate is applied when :math:`c=011` (``c_if`` with values :math:`3`)
te: తర్వాత 3వ దశలో మనం :math:`-2\pi 0.0\varphi_{2}\varphi_{3}= -2\pi \left(\frac{\varphi_2}{4}+ దశల సవరణను చేయాలి \frac{\varphi_3}{8}\right)=-\frac{\varphi_2\pi}{2}-\frac{ \varphi_3\pi}{4}`, కాబట్టి మనం 2 షరతులతో కూడిన దశ సవరణలను వర్తింపజేయాలి, ఒకటి :math:`\varphi_3` (:math:`=c_0`) మరియు మరొకటి :math:`\varphi_2`\ (:math:`=c_1`) ద్వారా కండిషన్ చేయబడింది. దీన్ని చేయడానికి మనం ఈ క్రింది వాటిని వర్తింపజేయాలి: - గేట్ :math:`P(-\pi/4)` ద్వారా కండిషన్ చేయబడింది :math:`c_0=1`, అంటే :math:`c=001` (` ద్వారా `c_if`` విలువతో :math:`1`) - గేట్ :math:`P(-\pi/2)` ద్వారా కండిషన్ చేయబడింది :math:`c_1=1`, అంటే గేట్ ఎప్పుడు వర్తింపజేయబడుతుంది :math: `c=010` (``c_if`` విలువలతో :math:`2`) - గేట్ :math:`P(-3\pi/4)` ద్వారా కండిషన్ చేయబడింది :math:`c_1=1` మరియు :math: `c_0=1` అంటే, గేట్ వర్తించబడినప్పుడు :math:`c=011` (``c_if`` విలువలతో :math:`3`)
tr: Ardından, üçüncü adımda :math:`-2\pi 0.0\varphi_{2}\varphi_{3}= -2\pi \left(\frac{\varphi_2}{4}+\frac{\varphi_3}{8}\right)=-\frac{\varphi_2\pi}{2}-\frac{ \varphi_3\pi}{4}` faz düzeltmesini uygulamamız gerekiyor, dolayısıyla, biri :math:`\varphi_3` (:math:`=c_0`) ile ve diğeri :math:`\varphi_2`\ (:math:`=c_1`) ile koşullandırılmış olan 2 koşullandırılmış faz düzeltmesi uygulamamız gerekiyor. Bunu yapmak için şunu uygulamamız gerekir: - :math:`c_0=1` ile, yani :math:`c=001` ile (:math:`1` değeriyle ``c_if``) koşullandırılmış :math:`P(-\pi/4)` kapısı - :math:`c_1=1` ile, yani :math:`c=010` (:math:`2` değerleriyle ``c_if``) iken uygulanacak şekilde koşullandırılmış :math:`P(-\pi/2)` kapısı - :math:`c_1=1` ve :math:`c_0=1` ile koşullandırılmış, yani :math:`c=011` (:math:`3` değerleriyle ``c_if``) iken uygulanacak şekilde koşullandırılmış :math:`P(-3\pi/4)` kapısı

source: IPE
bn_bn: আইপিই (IPE)

source: Let’s consider to estimate the phase :math:`\phi=\frac{\pi}{2}` for the eigenstate :math:`|1\rangle`, we should find :math:`\varphi=\frac{1}{4}` (where :math:`\phi = 2 \pi \varphi`). Therefore to estimate the phase we need exactly 2 phase bits, i.e. :math:`m=2`, since :math:`1/2^2=1/4`. So :math:`\varphi=0.\varphi_1\varphi_2`.
ko: 고유상태 :math:`|1\rangle` 의 위상 :math:`\phi=\frac{\pi}{2}` 을 추정하려면, :math:`\varphi=\frac{1}{4}` (여기서 :math:`\phi = 2 \pi \varphi` 이다) 를 찾아야 한다. 그러므로 위상 추정에는 두 위상 비트 (2 phase bits) 가 필요하다. 다시 말해, :math:`1/2^2=1/4` 이므로 :math:`m=2` 이다. 그러므로 :math:`\varphi=0.\varphi_1\varphi_2` 이다.

source: Let’s consider to estimate the phase :math:`\phi=\pi/4` for the eigenstate :math:`|11\rangle`, we should find :math:`\varphi=1/8`, since :math:`\phi = 2 \pi \varphi`. Therefore to estimate the phase we need exactly 3 classical bits, i.e. :math:`m=3`, since :math:`1/2^3=1/8`. So :math:`\varphi=0.\varphi_1\varphi_2\varphi_3`.
ko: 고유 상태 :math:`|11\rangle` 에 대한 위상 :math:`\phi=\pi/4` 를 추정해 보자. :math:`\phi = 2 \pi \varphi` 이므로 :math:`\varphi=1/8` 를 찾아야 한다. 따라서 위상을 추정하려면 :math:`1/2^3=1/8` 이므로 정확히 3개 (:math:`m=3`) 의 고전적 비트가 필요하다. 그러므로 :math:`\varphi=0.\varphi_1\varphi_2\varphi_3` 이다.
