Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/09_IQPE.po
Languages: bn_bn, fr_fr, ja_jp, ko, pt_un, ru_ru, ta_in, te, tr

source: To implement :math:`CS` in the circuit, since :math:`S` is a phase gate, we can use the controlled phase gate :math:`\text{CP}(\theta)`, with :math:`\theta=\pi/2`.
bn_bn: বর্তনীতে (সার্কিট) :math:`CS` বাস্তবায়নের জন্য আমরা :math:`\theta=\pi/2` -এর সাথে নিয়ন্ত্রিত দশা যুক্তিবর্তনী (গেইট) :math:`\text{CP}(\theta)` ব্যবহার করতে পারি, যেহেতু :math:`S` একটা দশা গেট।
fr_fr: Pour implémenter :math:`CS`, nous pouvons utiliser le fait que :math:`S` soit une porte de phase. Nous pouvons donc utiliser la porte de phase contrôlée :math:`\text{CP}(\theta)`, avec :math:`\theta=\frac{\pi}{2}`.
ja_jp: 回路に :math:`CS` を実装するため、 :math:`S` は位相ゲートなので制御位相ゲート :math:`\text{CP}(\theta)` が使えます。ここで :math:`\theta=\pi/2` です。
ko: :math:`CS` 를 회로에 구현할 때, :math:`S` 가 위상 게이트이므로 제어 위상 게이트 :math:`\text{CP}(\theta)` 와 :math:`\theta=\pi/2` 를 사용한다.
pt_un: Para implementar :math:`CS`, uma vez que :math:`S` é um portão de fase, podemos usar o portão de fase controlada :math:`\text{CP}(\theta)`, com :math:`\theta=\pi/2`.
ru_ru: Поскольку :math:`S` влияет на фазу, для реализации :math:`CS` в цепи используем контролируемый фазовый гейт :math:`\text{CP}(\theta)` с :math:`\theta=\pi/2`.
ta_in: செயல்படுத்த :math:`CS` சுற்றுவட்டத்தில், என்பதால் :math:`S` என்பது ஒரு கட்ட வாயில், நாம் கட்டுப்படுத்தப்பட்ட கட்ட வாயிலைப் பயன்படுத்தலாம் :math:`\text{CP}(\theta)`, உடன் :math:`\theta=\pi/2`.
te: సర్క్యూట్‌లో :math:`CS`ని అమలు చేయడానికి, :math:`S` ఒక ఫేజ్ గేట్ కాబట్టి, మేము నియంత్రిత ఫేజ్ గేట్:math:`\text{CP}(\theta)`ని:math:తో ఉపయోగించవచ్చు `\theta=\pi/2`.
tr: Devrede :math:`CS` uygulamak için, :math:`S` bir faz geçiti olduğundan, kontrollü faz geçiti :math:`\text{CP}(\theta)` kullanabiliriz, :math: `\theta=\pi/2`.

source: Let’s apply :math:`2^t` times :math:`\text{CP}(\pi/2)`. Since for the first step :math:`t=m-1`, and :math:`m=2`, we have :math:`2^t=2`.
bn_bn: :math:`2^t` বার :math:`\text{CP}(\pi/2)` প্রয়োগ করা যাক। যেহেতু প্রথম ধাপে :math:`t=m-1` ও :math:`m=2`, আমরা বলতে পারি :math:`2^t=2`।
fr_fr: Appliquons alors :math:`2^t` fois :math:`\text{CP}\left(\frac{\pi}{2}\right)`. Puisque pour la première étape on a :math:`t=m-1` et que l'on a :math:`m=2`, on en déduit :math:`2^t=2`.
ja_jp: それでは :math:`\text{CP}(\pi/2)` を :math:`2^t` 回適用しましょう。最初のステップは :math:`t=m-1`、そして :math:`m=2` なので、 :math:`2^t=2` です。
ko: :math:`\text{CP}(\pi/2)` 를 :math:`2^t` 번 적용해 보자. 첫 번째 단계에서는 :math:`t=m-1` 과 :math:`m=2` 이므로, :math:`2^t=2` 를 얻을 수 있다.
pt_un: Vamos aplicar :math:`2^t` vezes :math:`\text{CP}(\pi/2)`. Dado que para o primeiro passo :math:`t=m-1`, e :math:`m=2`, temos que :math:`2^t=2`.
ru_ru: Теперь повторим :math:`2^t` число раз :math:`\text{CP}(\pi/2)`. Так как для первого шага :math:`t=m-1` и :math:`m=2`, то :math:`2^t=2`.
ta_in: நாம் :math:`2^t`` முறை :math:`\text{CP}(\pi/2)`. முதல் படி :math:`t=m-1`, மற்றும் :math:`m=2`, எங்களிடம் :math:`2^t=2`.

source: Measure in x-basis
bn_bn: x -ভিত্তিতে পরিমাপ
fr_fr: Mesure dans la base :math:`X`
ja_jp: X 基底の測定
pt_un: Medida na base-x
ru_ru: Измерение в x-базисе
ta_in: X- அடிப்படையில் அளவிடவும்

source: Finally, we perform the measurement of the auxiliary qubit in x-basis. So we will define a function to perform the x_measure and then apply it.
bn_bn: অবশেষে আমরা x-ভিত্তিতে সহায়ক কিউবিট পরিমাপ করব। এজন্য আমরা একটা x_measure -এর ফাংশন লিখবো এবং প্রয়োগ করব।
fr_fr: Enfin, nous effectuons la mesure du qubit auxiliaire dans la base :math:`X`. Nous allons donc définir une fonction pour effectuer la mesure-:math:`X`, puis l'appliquer.
ja_jp: 最後に、補助量子ビットをX基底で測定します。 そのため、X測定を実行する関数を定義し、それを適用します。
pt_un: Finalmente, procedemos com a medição do qubit auxiliar na base-x. Então definiremos uma função para realizar a medida_x e então aplicá-la.
ru_ru: Наконец, переходим к измерению служебного кубита в x-базисе. Определим отдельно функцию x_measure, а затем применим ее.

source: In this way we obtain the phase bit :math:`\varphi_2` and store it in the classical bit :math:`c_0`.
bn_bn: এভাবে আমরা দশা বিট :math:`\varphi_2` পাবো এবং সেটা প্রথাগত (ক্লাসিক্যাল) বিট :math:`c_0` -এ সঞ্চয় করি।
fr_fr: Ainsi, nous obtenons le bit de phase :math:`\varphi_2` et le stockons dans le bit classique :math:`c_0`.
ja_jp: この方法で位相ビット :math:`\varphi_2` を取得し、古典ビット :math:`c_0` に保存します。
ko: 이 방법으로 위상 비트 :math:`\varphi_2` 를 구하고 이를 고전 비트 :math:`c_0` 에 저장할 수 있다.
pt_un: Desta forma obtemos o bit de fase :math:`\varphi_2` e armazená-lo na bit clássico :math:`c_0`.
ru_ru: Таким образом, мы получаем младший фазовый бит :math:` \varphe_2 ` и сохраняем ее в младшем классическом бите :math:`c_0`.
ta_in: இந்த வழியில் நாம் கட்டம் பிட் :math:`\varphi_2` ஐப் பெற்று கிளாசிக்கல் பிட்டில் சேமிக்கிறோம் :math:`c_0`.
te: ఈ విధంగా మనం ఫేజ్ బిట్ :math:`\varphi_2`ని పొందుతాము మరియు దానిని క్లాసికల్ బిట్ :math:`c_0`లో నిల్వ చేస్తాము.
tr: Bu şekilde :math:`\varphi_2` faz bitini elde ederiz ve onu klasik bit :math:`c_0` içinde saklarız.

source: Subsequent steps (2nd step)
bn_bn: ক্রমানুসারে (২য় ধাপ)
fr_fr: Étapes suivantes (deuxième étape)
ja_jp: 次のステップ (第２ステップ)
ko: 후속 단계 (두 번째 단계)
pt_un: Passos subsequentes (segundo passo)
ru_ru: Дальнейшие итерации (вторая итерация)
ta_in: அடுத்தடுத்த படிகள் (2 வது படி)
te: తదుపరి దశలు (2వ దశ)
tr: Sonraki adımlar (2. adım)

source: Now we build the quantum circuit for the other remaining steps, in this example, only the second one. In these steps we have 4 sub-steps: the 3 sub-steps as in the first step and, in the middle, the additional step of the phase correction - initialization with reset - phase correction - application of the Control-\ :math:`U` gates - measure of the auxiliary qubit in x-basis
bn_bn: এবার অবশিষ্ট ধাপের জন্য আমরা কোয়ান্টাম বর্তনী বানাবো, এই উদাহরণে দ্বিতীয় ধাপের জন্য। এই ধাপ আরো চারটে ধাপে বিভক্ত: প্রথম ধাপের তিনটে ধাপ এবং মাঝখানে দশা সংশোধনের একটা ধাপ- অর্থাৎ পুনঃস্থাপন (রিসেট) দিয়ে আরম্ভ - দশা সংশোধন - নিয়ন্ত্রিত-\ :math:`U` গেটের প্রয়োগ - x-ভিত্তিতে সহায়ক কিউবিটের পরিমাপ
fr_fr: Nous construisons maintenant le circuit quantique pour les étapes restantes. On ne montrera dans cet exemple que la seconde. Dans ces étapes, nous avons 4 sous-étapes : les 3 sous-étapes identiques à la première étape et, au milieu, l'étape supplémentaire de la correction de phase - initialisation avec réinitialisation - correction de phase - application des portes contrôle-\ :math:`U` - mesure du qubit auxiliaire en base :math:`X`
ja_jp: 次に、残りのステップの量子回路を構築します。この例では 第２ステップのみです。 このステップには、4つのサブステップがあります。3サブステップは最初のステップと同じですが、その途中に位相補正の追加ステップがあります。 - リセットと初期化 - 位相補正 - 制御 :math:`U` ゲート適用 - X基底での補助量子ビット測定
pt_un: Agora construímos o circuito quântico para os outros passos remanescentes, neste exemplo, apenas o segundo passo. Nestes passos temos 4 sub-passos: os 3 sub-passos assim como no primeiro passo e, no meio, o passo adicional da correção de fase - inicialização com reset - correção de fase - aplicação dos portões Control-\ :math:`U` - medida do qubit auxiliar na base-x
ru_ru: Теперь мы построим квантовую цепь для последующих итераций. В данном примере, для оставшейся второй итерации. Теперь к рассмотренным ранее трем этапам добавляется еще один: - инициализация со сбросом - поправка фазы - применение условного гейта :math:`U` - измерение служебного кубита в x-базисе
ta_in: இப்போது நாம் மீதமுள்ள மற்ற படிகளுக்கு குவாண்டம் சுற்று உருவாக்குகிறோம், இந்த எடுத்துக்காட்டில், இரண்டாவது ஒரு. இந்த படிகளில் நமக்கு 4 துணை படிகள் உள்ளன: முதல் படியில் உள்ள 3 துணை படிகள் மற்றும், நடுவில், கட்ட திருத்தத்தின் கூடுதல் படி - மீட்டமைப்போடு துவக்கம் - கட்ட திருத்தம் - கட்டுப்பாட்டின் பயன்பாடு- :math:`U` வாயில்கள் x- அடிப்படையில் துணை குவிட்டின் அளவு

source: Initialization with reset
bn_bn: পুনঃস্থাপন (রিসেট) দিয়ে আরম্ভ
fr_fr: Initialisation avec réinitialisation
ja_jp: リセットによる初期化
ko: 재설정을 통한 초기화
pt_un: Inicialização com reset
ru_ru: Инициализация со сбросом
ta_in: மீட்டமைப்போடு துவக்கம்
te: రీసెట్‌తో ప్రారంభించడం
tr: Sıfırlayarak başlatma

source: As we want to perform an iterative algorithm in the same circuit, we need to reset the auxiliary qubit :math:`q0` after the measument gate and initialize it again as before to recycle the qubit.
bn_bn: যেহেতু আমরা এই বর্তনীতেই (সার্কিট)একটা পুনরাবৃত্তিকারী ধারাক্রম (ইটারেটিভ এলগোরিদম) চালাবো, গেট পরিমাপের পর কিউবিট পুনর্ব্যবহারের জন্য সহায়ক কিউবিট :math:`q0` আমাদের পুনঃস্থাপন (রিসেট) করতে হবে।
fr_fr: Puisque nous voulons réaliser un algorithme itératif en utilisant le même circuit, nous devons réinitialiser le qubit auxiliaire :math:`q_0` après la mesure et l'initialiser à nouveau comme précédemment afin de pouvoir réutiliser le qubit.
ja_jp: 反復アルゴリズムを同じ回路で実行したいので、補助量子ビット :math:`q0` をリサイクルする前に、測定の後でにリセットして初期化する必要があります。
pt_un: Como queremos realizar um algoritmo iterativo no mesmo circuito, precisamos reiniciar o qubit auxiliar :math: `q0` após o portão de medição e inicializá-lo novamente como antes para reciclar o qubit.
ru_ru: Поскольку мы продолжаем выполнение итеративного алгоритма в той же самой цепи, нам нужно сбросить состояние служебного кубита :math:`q0` после измерения и инициализировать его заново для повторного использования.
ta_in: அதே சுற்றில் ஒரு செயல்பாட்டு வழிமுறையைச் செய்ய நாங்கள் விரும்புவதால், துணை குவிட்டை மீட்டமைக்க வேண்டும் அளவீட்டு வாயிலுக்குப் பிறகு :math:`q0` மற்றும் குவிட்டை மறுசுழற்சி செய்வதற்கு முன்பு மீண்டும் துவக்க வேண்டும்.

source: Phase correction (for step 2)
bn_bn: দ্বিতীয় ধাপের জন্য দশা সংশোধন
fr_fr: Correction de phase (pour l'étape 2)
ja_jp: 位相補正 (ステップ 2 の場合)
ko: 위상 보정(2단계)
pt_un: Correção de fase (para o passo 2)
ru_ru: Поправка фазы (для второй итерации)
ta_in: கட்ட திருத்தம் (படி 2 க்கு)
te: ఫేస్ దిద్దుబాటు (దశ 2 కోసం)
tr: Faz düzeltme (2. adım için)

source: As seen in the theory, in order to extract the phase bit :math:`\varphi_{1}`, we perform a phase correction of :math:`-\pi\varphi_2/2`. Of course, we need to apply the phase correction in the circuit only if the phase bit :math:`\varphi_2=1`, i.e. we have to apply the phase correction of :math:`-\pi/2` only if the classical bit :math:`c_0` is 1.
bn_bn: তত্ত্বানুসারে দশা বিট :math:`\varphi_{1}` বের করার জন্য আমরা :math:`-\pi\varphi_2/2` -এর দশা সংশোধন করব, যখন দশা বিট :math:`\varphi_2=1`। অর্থাৎ আমরা :math:`-\pi/2` দশা সংশোধন করব যদি প্রথাগত (ক্লাসিক্যাল) বিট :math:`c_0` এর মান ১ হয়।
fr_fr: Comme vu dans la théorie, afin d'extraire le bit de phase :math:`\varphi_{1}`, nous effectuons une correction de phase de :math:`-\varphi_2\frac{\pi}{2}`. Évidemment, nous devons appliquer la correction de phase dans le circuit seulement si le bit de phase :math:` \varphi_2=1`, c'est-à-dire que nous devons appliquer la correction de phase de :math:`-\frac{\pi}{2}` seulement si le bit classique :math:`c_0` est égal à 1.
ja_jp: 理論で見てきたように、位相ビット :math:`\varphi_{1}` を展開するために :math:`-\pi\varphi_2/2` の位相補正をします。もちろん位相ビットが :math:`\varphi_2=1` の場合だけ、位相補正が必要です。すなわち、古典ビット :math:`c_0` が 1 の場合のみ、位相補正 :math:`-\pi/2` を実行します。
ko: 이론에서 볼 수 있듯이 위상 비트 :math:`\varphi_{1}` 를 추출하기 위해 :math:`-\pi\varphi_2/2` 의 위상 보정을 수행한다. 물론 위상 비트가 :math:`\varphi_2=1` 인 경우에만 회로에 위상 보정을 적용해야 한다. 즉, 고전 비트 :math:`c_0` 가 1인 경우에만 :math:`-\pi/2` 의 위상 보정을 적용해야 한다.
pt_un: Claro, precisamos aplicar a correção de fase no circuito apenas se o bit de fase :math:`\ varphi_{1}`, ou seja, temos que aplicar a correção de fase de :math:`-\pi\varphi_2/2`. apenas se o bit clássico :math:`c_0` é 1.
ru_ru: Как следует из теории, вычисляя :math:`\varphi_{1}`, нужно помнить о предварительной поправке фазы на :math:`-\pi\varphi_2/2`. Разумеется, нам нужно применять фазовую коррекцию в цепи только в том случае, если фазовый бит :math:`\varphi_2=1`, то есть мы должны применять фазовую коррекцию :math:`-\pi/2` только в том случае, если классический бит :math:`c_0` равен 1.
ta_in: கோட்பாட்டில் காணப்படுவது போல், கட்டம் பிட் :math:`\varphi_{1}` பிரித்தெடுப்பதற்காக, :math:`-\pi\varphi_2/2` இன் ஒரு கட்ட திருத்தம் செய்கிறோம். நிச்சயமாக, கட்ட பிட் :math:`\varphi_2=1`, அதாவது கட்ட திருத்தம் :math:`-\pi/2` என்றால் மட்டுமே நாம் சுற்றில் கட்ட திருத்தம் பயன்படுத்த வேண்டும். கிளாசிக்கல் பிட் :math:`c_0` என்பது 1 ஆகும்.

source: So, after the reset we apply the phase gate :math:`P(\theta)` with phase :math:`\theta=-\pi/2` conditioned by the classical bit :math:`c_0` (:math:`=\varphi_2`) using the ``c_if`` method. So as we saw in the first part of this tutorial, we have to use the ``c_if`` method with a value of 1, as :math:`1_{10} = 001_{2}` (the subscripts :math:`_{10}` and :math:`_2` indicate the decimal and binary representations).
bn_bn: সেজন্য পুনঃস্থাপনের (রিসেট) পর ``c_if`` পদ্ধতি ব্যবহার করে প্রথাগত (ক্লাসিক্যাল) বিট :math:`c_0` (:math:`=\varphi_2`) -এর শর্তাধীনে :math:`\theta=-\pi/2` দশাসহ :math:`P(\theta)` দশা গেট প্রয়োগ করব। এই পাঠসমূহের (টিউটোরিয়াল) শুরুতে দেখানো ১ মান নিয়ে ``c_if`` পদ্ধতি ব্যবহার করব, যেহেতু :math:`1_{10} = 001_{2}` (সাবস্ক্রিপ্ট :math:`_{10}` and :math:`_2` দশমিক ও দ্বিমিক (বাইনারি) রূপ চিহ্নিত করে)।
fr_fr: Ainsi, après la réinitialisation, nous appliquons la porte de phase :math:`\text{P}(\theta)` avec la phase :math:`\theta=-\frac{\pi}{2}` conditionnée par le bit classique :math:`c_0` (:math:`=\varphi_2`) en utilisant la méthode ``c_if``. Ainsi, comme nous l'avons vu dans la première partie de ce tutoriel, nous devons utiliser la méthode ``c_if`` avec une valeur de 1, comme :math:` 1_{10} = 001 _{2}` (les indices :math:`_{10}` et :math:`_2 ` indiquent respectivement les représentations décimales et binaires).
ja_jp: そのため、リセット後に位相ゲート :math:`P(\theta)` を位相 :math:`\theta=-\pi/2` で条件付きで適用します。古典ビット :math:`c_0` (:math:`=\varphi_2`) を ``c_if`` メソッドを使って条件付けます。このチュートリアルの最初の部分で見たように、:math:`1_{10} = 001_{2}` なので値が 1 の ``c_if`` メソッドを使用します(下付き :math:`_{10}` と :math:`_2` は10進数表現と2進数表現を示します)。
ko: 따라서 초기화 후에는 ``c_if`` 매서드를 사용하여 고전 비트 :math:`c_0` (:math:`=\varphi_2`) 로 조절된 위상 :math:`\theta=-\pi/2` 를 사용하여 위상 게이트 :math:`P(\theta)` 를 적용한다. 이 튜토리얼의 첫 번째 부분에서 확인한 것처럼, 값이 1인 ``c_if`` 매서드를 :math:`1_{10} = 001_{2}` 로 사용해야 한다(아래에 기입한 :math:`_{10}` 및 :math:`_2` 은 십진수 및 이진수를 나타냄).
pt_un: Então, após o reset aplicamos o portão de fase :math:`P(\theta)` com fase :math:`\theta=-\pi/2` condicionada pelo bit clássico :math:`c_0` (:math:`=\varphi_2`) usando o método ``c_if``. Então, como vimos na primeira parte deste tutorial, temos que usar o método ``c_if`` com um valor de 1, como em :math:`1_{10} = 001_{2}` (os subscritos :math:`_{10}` e :math:`_2` indicam representações decimais e binárias).
ru_ru: Поэтому после сброса мы применяем фазовый вентиль :math:`P(\theta)` с фазой :math:`\theta=-\pi/2`, обусловленной классическим битом :math:`c_0` (:math:`=\varphi_2`), используя метод `c_if``. Итак, как мы видели в первой части этого руководства, мы должны использовать метод ``c_if`` со значением 1, так как :math:`1_{10} = 001_{2}` (подписи :math:`_{10}` и :math:`_2`` указывают на десятичное и двоичное представления).
ta_in: எனவே, மீட்டமைத்த பின் கட்டம் :math:`P(\theta)` கட்டம் :math:`\theta=-\pi/2`` கிளாசிக்கல் பிட் :math:`c_0` (:math:`=\varphi_2`) ``c_if`` முறையைப் பயன்படுத்துகிறது. இந்த டுடோரியலின் முதல் பகுதியில் நாம் பார்த்தது போல், 1 மதிப்புடன் ``c_if`` முறையைப் பயன்படுத்த வேண்டும் :math:`1_{10} = 001_{2}` (சந்தாக்கள் :math:`_{10}` மற்றும் :math:`_2` என்பது தசம மற்றும் பைனரி பிரதிநிதித்துவங்களைக் குறிக்கிறது).
te: కాబట్టి, రీసెట్ చేసిన తర్వాత మనం దశ గేట్ :math:`P(\theta)`ని ఫేజ్ :math:`\theta=-\pi/2`తో క్లాసికల్ బిట్ :math:`c_0` ద్వారా కండిషన్ చేయబడుతుంది (:math: `=\varphi_2`) ``c_if`` పద్ధతిని ఉపయోగిస్తోంది. కాబట్టి ఈ ట్యుటోరియల్ మొదటి భాగంలో మనం చూసినట్లుగా, మనం 1 విలువతో ``c_if`` పద్ధతిని ఉపయోగించాలి, :math:`1_{10} = 001_{2}` (సబ్‌స్క్రిప్ట్‌లు :math: `_{10}` మరియు :math:`_2` దశాంశ మరియు బైనరీ ప్రాతినిధ్యాలను సూచిస్తాయి).
tr: Böylelikle, sıfırlamadan sonra, :math:`P(\theta)` faz kapısını klasik bit :math:`c_0` (:math:`=\varphi_2`) tarafından koşullandırılan :math:`\theta=-\pi/2` fazı ile ``c_if`` metodunu kullanarak çalıştırıyoruz. Bu öğreticinin ilk bölümünde gördüğümüz gibi, ``c_if`` metodunu 1 değerinde :math:`1_{10} = 001_{2}` olarak kullanmamız gerekiyor (alt simgeler :math:`_{10}` ve :math:`_2` ondalık ve ikili temsilleri gösterir).

source: Application of the Control-\ :math:`U` gates and x-measurement (for step 2)
bn_bn: নিয়ন্ত্রিত-\ :math:`U` গেটের প্রয়োগ এবং x-পরিমাপ (২য় ধাপ)
fr_fr: Application des portes contrôle-\ :math:`U` et mesure dans la base :math:`X` (pour l'étape 2)
ja_jp: 制御 :math:`U` ゲートとx-基底測定の適用 (ステップ 2 の場合)
pt_un: Aplicação dos portões Control-\ :math:`U` e x-medições (para o passo 2)
ru_ru: Применение операции Control-\ :math:`U` и измерение в x-базисе (для 2й итерации)
ta_in: கட்டுப்பாடு பயன்பாடு-\ :math:`U` வாயில்கள் மற்றும் எக்ஸ்-அளவீட்டு (படி 2 க்கு)

source: We apply the :math:`CU` operations as we did in the first step. For the second step we have :math:`t=m-2`, hence :math:`2^t=1`. So we apply :math:`\text{CP}(\pi/2)` once. And then we perform the x-measurment of the qubit :math:`q_0`, storing the result, the phase bit :math:`\varphi_1`, in the bit :math:`c_1` of classical register.
bn_bn: প্রথম ধাপের মতো আমরা :math:`CU` ক্রিয়াকলাপ (অপারেশন) করব। দ্বিতীয় ধাপে আমরা জানি :math:`t=m-2` যা থেকে পাওয়া যায় :math:`2^t=1`। সেজন্য আমরা একবার :math:`\text{CP}(\pi/2)` প্রয়োগ করবো এবং :math:`q_0` কিউবিটের x-পরিমাপ করবো ও :math:`\varphi_1` দশা বিটের মান :math:`c_1` বিটে সঞ্চয় করবো।
fr_fr: Nous appliquons alors les portes :math:"CU" comme nous l'avons fait lors de la première étape. Pour la deuxième étape, nous avons :math:`t=m-2`, donc :math:`2^t=1`. Nous appliquons donc :math:`\text{CP}\left(\frac{\pi}{2}\right)` une seule fois. Ensuite, nous réalisons la mesure dans la base :math:`X` du qubit :math:`q_0`, stockant le résultat, à savoir le bit de phase :math:`\varphi_1`, dans le bit :math:`c_1` du registre classique.
ja_jp: :math:`CU` 演算子を最初のステップでやったように適用します。第2ステップでは :math:`t=m-2` のため :math:`2^t=1` です。そのため、 :math:`\text{CP}(\pi/2)` を一回適用します。そして量子ビット :math:`q_0` の X基底測定をして、位相ビット :math:`\varphi_1` を古典レジスター :math:`c_1` に格納します。
pt_un: Aplicamos as operações :math:`CU` assim como fizemos no primeiro passo. Para o segundo passo temos :math:`t=m-2`, daí :math:`2^t=1`. Então aplicamos :math:`\text{CP}(\pi/2)` uma vez. E então realizamos a x-medição do qubit :math:`q_0`, armazenando o resultado, o bit de phase :math:`\varphi_1`, no bit :math:`c_1` do registrador clássico.
ru_ru: Применим оператор :math:`CU` так же, как и в первой итерации. Однако теперь :math:`t=m-2`, значит :math:`2^t=1`. Поэтому :math:`\text{CP}(\pi/2)` используется один раз. Далее, опять измеряем в x-базисе кубит :math:`q_0`, записывая результат фазового бита :math:`\varphi_1` в бит :math:`c_1` классического регистра.
ta_in: நாங்கள் முதல் கட்டத்தில் செய்ததைப் போல :math:`CU` செயல்பாடுகளைப் பயன்படுத்துகிறோம். இரண்டாவது படிக்கு :math:`t=m-2`, எனவே :math:`2^t=1`. எனவே நாங்கள் விண்ணப்பிக்கிறோம் :math:`\text{CP}(\pi/2)` ஒரு முறை. பின்னர் நாம் குவிட்டின் x-அளவீட்டைச் செய்கிறோம் :math:`q_0`, முடிவைச் சேமித்தல், கட்ட பிட் :math:`\varphi_1`, பிட் கிளாசிக்கல் பதிவின் :math:`c_1`.

source: Et voilà, we have our final circuit
bn_bn: আমরা অন্তিম বর্তনীটা (সার্কিট) পেলাম
fr_fr: Et voilà, nous avons notre circuit final
ja_jp: ついに、最終的な回路が得られました。
ko: 마침내! 최종회로가 완성되었다.
pt_un: Et voilà, temos nosso circuito final
ru_ru: И вуаля, получаем итоговую цепь
ta_in: Et voilà, எங்கள் இறுதி சுற்று உள்ளது
te: ఇంకా, మా చివరి సర్క్యూట్ ఉంది
tr: Ve buyrun! Artık nihai devremiz elimizde

source: Let’s execute the circuit with the ``qasm_simulator``, the simulator without noise that run locally.
bn_bn: ``qasm_simulator`` এ বর্তনী (সার্কিট) চালিয়ে দেখা যাক যেটা স্থানীয় ও ত্রুটিহীনভাবে চলে।
fr_fr: Exécutons le circuit avec le ``qasm_simulator``, le simulateur sans bruit qui s'exécute localement.
ja_jp: ``qasm_simulator`` を使って回路を実行しましょう。これはローカルで動作するノイズのないシミュレータです。
pt_un: Vamos executar o circuito com o `qasm_simulator``, o simulador sem ruído que funciona localmente.
ru_ru: Запустим цепь на локальном симуляторе ``qasm_simulator``, не содержащем шумовых помех.
ta_in: உள்நாட்டில் இயங்கும் சத்தம் இல்லாமல் சிமுலேட்டரான ``qasm_simulator`` உடன் சுற்று இயக்கலாம்.

source: In the picture we have the same histograms but on the left we have on the x-axis the string with phase bits :math:`\varphi_1`, :math:`\varphi_2` and on the right the actual phase :math:`\varphi` in decimal representation.
bn_bn: এই ছবিতে একই হিস্টোগ্রাম পেলেও লক্ষ্য করো বাঁদিকে x-অক্ষে :math:`\varphi_1`, :math:`\varphi_2` দশা বিটদুটো এবং ডানদিকে আসল দশা :math:`\varphi` দশমিকরূপে আছে।
fr_fr: Sur cette image, nous avons les mêmes histogrammes, à l'exception du fait que sur l'axe X de celui de gauche se trouve la représentation binaire de :math:`\varphi`, c'est-à-dire les valeurs de :math:`\varphi_1` et de :math:`\varphi_2` tandis que se trouve sur celui de droite sa représentation décimale.
ja_jp: 図のヒストグラムは同じものですが、左側は x軸に位相ビットが :math:`\varphi_1`、 :math:`\varphi_2` の文字列で、右側は実際の位相 :math:`\varphi` が10 進数表記になっています。
ko: 그림에서 히스토그램은 동일하지만 왼쪽에는 X축에 위상 비트 :math:`\varphi_1` , :math:`\varphi_2` 가 있는 문자열이 있고 오른쪽에는 10진수 표시의 실제 위상 :math:`\varphi` 가 있다.
pt_un: Na imagem temos os mesmos histogramas mas à esquerda temos no eixo x a string com bits de fase :math:`\varphi_1`,:math:`\varphi_2` e à direita a fase real :math:`\varphi` em representação decimal.
ru_ru: На рисунке мы имеем одинаковые гистограммы, однако на левой абсцисса представлена строкой фазовых битов :math:`\varphi_1`, :math:`\varphi_2`, а справа -- фактической фазой :math:`\varphi` в десятичном представлении.
ta_in: படத்தில் எங்களிடம் ஒரே ஹிஸ்டோகிராம்கள் உள்ளன, ஆனால் இடதுபுறத்தில் x-அச்சில் கட்ட பிட்கள் கொண்ட சரம் உள்ளது :math:`\varphi_1`, :math:`\varphi_2` மற்றும் வலதுபுறத்தில் உண்மையான கட்டம் தசம பிரதிநிதித்துவத்தில் :math:`\varphi`.
te: చిత్రంలో మనకు అదే హిస్టోగ్రాం ఉంది కానీ ఎడమ వైపున x-యాక్సిస్‌పై దశ బిట్‌లతో స్ట్రింగ్‌ని కలిగి ఉన్నాము :math:`\varphi 1`,:math:`\varphi 2` మరియు కుడివైపు వాస్తవ దశ :math:`\varphi` దశాంశ ప్రాతినిధ్యంలో.
tr: Resimde aynı histogramlara sahibiz ama solda x ekseninde :math:`\varphi_1`, :math:`\varphi_2` faz bitlerine sahip dize ve sağda ondalık gösterimde gerçek faz :math:`\varphi` var.

source: As we expected we have found :math:`\varphi=\frac{1}{4}=0.25` with a :math:`100\%` probability.
bn_bn: আশানুরূপভাবে আমরা :math:`100\%` সম্ভাবনায় :math:`\varphi=\frac{1}{4}=0.25` পেয়েছি।
fr_fr: Comme nous nous y attendions, nous trouvons :math:`\varphi=\frac{1}{4}=0,25` avec une probabilité de :math:`100\%`.
ja_jp: 予想通り :math:`\varphi=\frac{1}{4}=0.25` が確率 :math:`100\%` になっています。
ko: 예상했던 대로 :math:`100\%` 확률을 가진 :math:`\varphi=\frac{1}{4}=0.25` 를 찾았다.
pt_un: Como esperávamos encontramos :math:`\varphi=\frac{1}{4}=0.25` com uma probabilidade de :math:`100\%`.
ru_ru: Как и ожидалось, значение :math:`\varphi=\frac{1}{4}=0.25` с вероятностью :math:`100\%`.
ta_in: நாங்கள் எதிர்பார்த்தபடி :math:`\varphi=\frac{1}{4}=0.25` உடன் :math:`100\%` நிகழ்தகவு.
te: మేము ఊహించినట్లుగానే :math:`\varphi=\frac{1}{4}=0.25`ని :math:`100\%` సంభావ్యతతో కనుగొన్నాము.
tr: Beklediğimiz gibi :math:`\varphi=\frac{1}{4}=0.25` değerini :math:`100\%` olasılıkla bulduk.

source: IPE example with a 2-qubit gate
bn_bn: ২-কিউবিট যুক্তিবর্তনী (গেইট) সম্পন্ন আইপিই এর উদাহরণ
fr_fr: Exemple d'IPE avec une porte à deux qubits
ja_jp: 2量子ビットゲートの IPE の例
ko: 2-큐비트 게이트의 IPE 예제
pt_un: Exemplo de IPE com um portão de 2-qubit
ru_ru: Использование IPE для двухкубитного гейта
ta_in: IPE உதாரணம் 2-கிபிட் வாயில்
te: 2-క్విట్ గేట్‌తో IPE ఉదాహరణ
tr: 2 kübit geçitli IPE örneği
