Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/09_IQPE.po
Languages: bn_bn, fr_fr, ja_jp, ko, pt_un, ru_ru, ta_in, te, tr

source: Now, we want to apply the IPE algorithm to estimate the phase for a 2-qubit gate :math:`U`. For this example, let’s consider the controlled version of the :math:`T` gate, i.e. the gate :math:`U=\textrm{Controlled-}T` (that from now we will express more complactly with :math:`CT`). Its matrix is
bn_bn: আমরা আইপিই ধারাক্রম (অ্যালোগরিদম) প্রয়োগ করে ২-কিউবিট গেট :math:`U` দশা অনুমান করব। উদাহরণরূপে এখানে আমরা :math:`T` -গেটের নিয়ন্ত্রিত রূপ (:math:`U=\textrm{Controlled-}T` যাকে সংক্ষিপ্ত করে আমরা :math:`CT` বলব) ব্যবহার করব।
fr_fr: Maintenant, nous voulons appliquer l'algorithme IPE pour estimer la phase d'une valeur propre d'une porte :math:`U` s'appliquant sur 2 qubits. Pour cet exemple, considérons la version contrôlée de la porte :math:`T`, que l'on notera :math:`CT`. Sa matrice est
pt_un: Agora, queremos aplicar o algoritmo IPE para estimar a fase de um portão de 2-qubit :math:`U`. Para este exemplo, vamos considerar a versão controlada do portão :math:`T`, ou seja o portão :math:`U=\textrm{Controlled-}T`(que a partir de agora iremos expressar de forma mais complacente com :math:`CT`). Sua matriz é
ru_ru: Теперь мы хотим применить алгоритм IPE для оценки фазы двухкубитного гейта :math:`U`. Рассмотрим к примеру управляемую версию гейта :math:`T`, то есть :math:`U=\textrm{Controlled-}T` (который для краткости будем называть :math:`CT`). Его матрица имеет вид
ta_in: இப்போது, 2-குவிட் வாயிலுக்கான கட்டத்தை மதிப்பிடுவதற்கு ஐபிஇ வழிமுறையைப் பயன்படுத்த விரும்புகிறோம் :math:`U`. இந்த எடுத்துக்காட்டுக்கு, கணிதத்தின் கட்டுப்படுத்தப்பட்ட பதிப்பைக் கருத்தில் கொள்வோம் :math:`T` கேட், அதாவது கேட் :math:`U=\textrm{Controlled-}T` (இனிமேல் நாம் கணிதத்துடன்: CT). அதன் அணி

source: That is, the :math:`CT` gate adds a phase :math:`\pi/4` to the state :math:`|11\rangle`, leaving unchanged the phase of the other computational basis states :math:`|00\rangle`, :math:`|01\rangle`, :math:`|10\rangle`.
bn_bn: অর্থাৎ :math:`CT` গেট :math:`|11\rangle` অবস্থায় :math:`\pi/4` দশা যোগ করে। এই অবস্থায় অন্যান্য গণনার ভিত্তি অবস্থা :math:`|00\rangle`, :math:`|01\rangle`, :math:`|10\rangle` -এর দশা অপরিবর্তিত থাকে।
fr_fr: Ainsi, la porte :math:`CT` ajoute une phase de :math:`\frac{\pi}{4}` à l'état :math:`|11\rangle`, et laisse inchangées les phases des autres états de base, à savoir :math:`|00\rangle`, :math:`|01\rangle` et :math:`|10\rangle`.
ja_jp: これは、:math:`CT` ゲートが状態 :math:`|11\rangle` に位相 :math:`\pi/4` を加え、その他の計算基底状態 :math:`|00\rangle`, :math:`|01\rangle`, :math:`|10\rangle` はそのままにする、ということです。
ko: 즉, :math:`CT` 게이트는 상태 :math:`|11\rangle` 에 위상 :math:`\pi/4` 를 추가하며, 다른 계산 기저 상태 :math:`|00\rangle`, :math:`|01\rangle`, :math:`|10\rangle` 의 위상은 변경되지 않는다.
pt_un: Isto é, o portão :math:`CT` adiciona a fase :math:`\pi/4` para o estado :math:`|11\rangle`, deixando inalterada a fase dos outros estados de base computacional :math:`|00\rangle`, :math:`|01\rangle`, :math:`|10\rangle`.
ru_ru: Гейт :math:`CT` прибавляет фазу :math:`\pi/4` состоянию :math:`|11\rangle`, не меняя ее для остальных базисных состояний :math:`|00\rangle`, :math:`|01\rangle`, :math:`|10\rangle`.
ta_in: அதாவது, :math:`CT` கேட் :math:`\pi/4` என கட்டத்தை :math:`|11\rangle` உடன் சேர்க்கிறது, அதை போல :math:`|00\rangle`, :math:`|01\rangle`, :math:`|10\rangle` என பிற கணக்கீட்டு அடிப்படை நிலைகளின் கட்டம் மாறாமல் விடுகிறது.
te: అంటే, :math:`CT` గేట్ స్థితి :math:`|11\rangle`కి దశ :math:`\pi/4`ని జోడిస్తుంది, ఇతర గణన ప్రాతిపదికన దశలను మార్చకుండా ఉంటుంది :math:` |00\rangle`, :math:`|01\rangle`, :math:`|10\rangle`.
tr: Yani, :math:`CT` kapısı, :math:`|11\rangle` durumuna bir faz :math:`\pi/4` ekler ve diğer hesaplama temelli durumların fazını değiştirmeden bırakır :math:` |00\rangle`, :math:`|01\rangle`, :math:`|10\rangle`.

source: Let’s consider to estimate the phase :math:`\phi=\pi/4` for the eigenstate :math:`|11\rangle`, we should find :math:`\varphi=1/8`, since :math:`\phi = 2 \pi \varphi`. Therefore to estimate the phase we need exactly 3 classical bits, i.e. \ :math:`m=3`, since :math:`1/2^3=1/8`. So :math:`\varphi=0.\varphi_1\varphi_2\varphi_3`.
bn_bn: :math:`|11\rangle` আইজেনস্টেটের :math:`\phi=\pi/4` দশা অনুমান করার জন্য আমাদের :math:`\varphi=1/8` -এর মান নির্ণয় করতে হবে, যেহেতু :math:`\phi = 2 \pi \varphi`। এরফলে দশা অনুমানের জন্য আমাদের ৩টি দশা বিট লাগবে, অর্থাৎ \ :math:`m=3`, যেহেতু :math:`1/2^3=1/8`। সেজন্য :math:`\varphi=0.\varphi_1\varphi_2\varphi_3`।
fr_fr: On veut alors estimer la phase :math:`\phi=\frac{\pi}{4}` de la valeur propre associée au vecteur propre :math:`|11\rangle`. Nous devrions trouver :math:`\varphi=\frac{1}{8}`, puisque :math:`\phi=2\pi\varphi`. Par conséquent, pour estimer la phase, nous avons besoin d'exactement 3 bits classique, c'est-à-dire \ :math:`m=3`, puisque l'on peut représenter exactement :math:`\varphi` en utilisant trois bits, comme :math:`\frac{1}{2^3} = \frac{1}{8}`. On écrira :math:`\varphi=0.\varphi_1\varphi_2\varphi_3`.
ja_jp: 固有状態 :math:`|11\rangle` の位相 :math:`\phi=\pi/4` の位相推定を考えましょう。 :math:`\phi = 2 \pi \varphi` なので :math:`\varphi=1/8` を得るはずです。そのため位相推定に、ちょうど３つの古典ビットが必要です。つまり :math:`1/2^3=1/8` なので :math:`m=3`。従って :math:`\varphi=0.\varphi_1\varphi_2\varphi_3` となります。
pt_un: Vamos considerar a estimativa da fase :math:`\phi=\pi/4` para o autoestado :math:`|11\rangle`, devemos descobrir :math:`\varphi=1/8`, uma vez que :math:`\phi = 2 \pi \varphi`. Desta forma para estimar a fase precisamos de exatamente 3 bits clássicos, ou seja, \ :math:`m=3`, já que :math:`1/2^3=1/8`. Então :math:`\varphi=0.\varphi_1\varphi_2\varphi_3`.
ru_ru: Рассмотрим оценку фазы :math:`\phi=\pi/4` состояния :math:`|11\rangle`, соответствующую :math:`\varphi=1/8`, поскольку :math:`\phi = 2 \pi \varphi`. Для этого нам нужно необходимо 3 классических бита, то есть :math:`m=3`, так как :math:`1/2^3=1/8`. При этом :math:`\varphi=0.\varphi_1\varphi_2\varphi_3`.

source: As done with the example for the 1-qubit :math:`U` operator we will go through the same steps but this time we will have :math:`3` steps since :math:`m=3`, and we will not repeat all the explanations. So for details see the above example for 1-qubit :math:`U` gate.
bn_bn: ১-কিউবিট :math:`U` অপারেটরের উদাহরণের মতো আমরা একই ধাপ অনুসরণ করব কিন্তু এবার আমাদের :math:`3` গুলো ধাপ করবো কারণ :math:`m=3`। এই ব্যাপারে বিশদে জানতে ১-কিউবিট :math:`U` গেটের উদাহরণ দেখো।
fr_fr: Comme cela a été fait dans l'exemple pour un opérateur à un qubit, nous allons passer par les mêmes étapes, bien que nous aurons cette fois :math:`3` étapes, étant donné que :math:`m=3` et nous ne répéterons pas toutes les explications. Donc pour plus de détails, nous conseillons de se référer à l'exemple ci-dessus portant sur un opérateur à un qubit.
ja_jp: 1量子ビット :math:`U` 演算子の例でみたように、同じステップを実行します。しかし今回は :math:`m=3` なので :math:`3` ステップありますが、同じ説明は繰り返しません。そのため詳細は上記1量子ビット :math:`U` ゲートの例を参照してください。
ko: 1큐비트 :math:`U` 연산자의 예와 마찬가지로 동일한 단계를 거치지만 :math:`m=3` 로 인한 :math:`3` 단계를 거치게 되며 모든 설명을 반복하지는 않을 것이다. 자세한 내용은 위의 1큐비트 :math:`U` 게이트 예를 참조하자.
pt_un: Como feito com o exemplo para o operador de 1-qubit :math:`U`, seguiremos os mesmos passos, mas desta vez teremos passos :math:`3` uma vez que :math:`m=3`, e não vamos repetir todas as explicações. Portanto, para obter detalhes, consulte o exemplo acima para o portão :math:`U`.
ru_ru: Выполняем те же действия, что и при работе с однокубитным гейтом :math:`U`, но на этот раз у нас будет :math:`3` итерации, так как :math:`m=3`, и мы не будем повторять приведенные выше объяснения. Для получения более подробной информации смотрите вышеприведенный пример для 1-кубитного вентиля :math:`U`.
ta_in: 1-குவிட் எடுத்துக்காட்டுடன் செய்யப்பட்டுள்ளபடி :math:`U` ஆபரேட்டர் நாங்கள் அதே படிகளைச் செல்வோம், ஆனால் இந்த முறை நமக்கு இருக்கும் :math:`3` படிகள் :math:`m=3`, மற்றும் நாங்கள் எல்லா விளக்கங்களையும் மீண்டும் செய்ய வேண்டாம். எனவே விவரங்களுக்கு 1-குவிட் :math:`U` கேட் மேலே உள்ள உதாரணத்தைக் காண்க.
te: 1-క్విట్ :math:`U` ఆపరేటర్‌కి ఉదాహరణతో పూర్తి చేసినట్లుగా, మేము అదే దశల ద్వారా వెళ్తాము కానీ ఈసారి మనకు :math:`m=3` నుండి :math:`3` దశలు ఉంటాయి మరియు మేము చేస్తాము అన్ని వివరణలను పునరావృతం చేయవద్దు. కాబట్టి వివరాల కోసం 1-క్విట్ :math:`U` గేట్ కోసం పై ఉదాహరణను చూడండి.
tr: 1 kübitli :math:`U` operatörün örneğinde yapıldığı gibi aynı adımları izleyeceğiz ama bu sefer :math:`m=3` :math:`3` adım olacak, açıklamaları tekrar etmeyeceğiz. Detaylar için 1 kübitli :math:`U` kapısının örneğine bakınız.

source: First, we initialize the circuit with 3 qubits, 1 for the auxiliary qubit and 2 for the 2-qubit gate, and 3 classical bits to store the phase bits :math:`\varphi_1`, :math:`\varphi_2`, :math:`\varphi_3`.
bn_bn: প্রথমে আমরা ৩টি কিউবিট নিয়ে বর্তনী (সার্কিট) চালু করবো, ১টা সহায়ক কিউবিট, ২-কিউবিট গেটের জন্য ২টো। এছাড়াও আমরা ৩টি প্রথাগত (ক্লাসিক্যাল) বিট নেবো যাতে :math:`\varphi_1`, :math:`\varphi_2`, :math:`\varphi_3` দশা বিটের মান সঞ্চয় হবে।
fr_fr: Tout d'abord, nous initialisons le circuit avec 3 qubits, 1 pour le qubit auxiliaire et 2 sur lesquels on appliquera notre opérateur, ainsi qu'avec 3 bits classiques pour stocker les bits de phase :math:`\varphi_1`, :math:`\varphi_2` et :math:`\varphi_3`.
ja_jp: 最初に、３つの量子ビットの回路を初期化します。１つは補助量子ビット、２つは２量子ビットゲートのものです。そして位相ビット :math:`\varphi_1`, :math:`\varphi_2`, :math:`\varphi_3` を格納する３つの古典ビットを初期化します。
ko: 먼저, 3개의 큐비트 (보조 큐비트용 1개 및 2-큐비트 게이트용 2개)와 위상 비트 :math:`\varphi_1`, :math:`\varphi_2`, :math:`\varphi_3` 를 저장하는 3개의 고전 비트로 회로를 초기화한다.
pt_un: Primeiro, inicializamos o circuito com 3 qubits, 1 para o qubit auxiliar e 2 para o portão de 2-qubit, e 3 bits clássicos para armazenar os bits de fase :math:`\varphi_1`, :math:`\varphi_2`, :math:`\varphi_3`.
ru_ru: Сначала мы инициализируем схему с 3 кубитами: 1 для вспомогательного кубита и 2 для 2-х кубитного гейта, и 3 классическими битами для хранения фазовых битов :math:`\varphi_1`, :math:`\varphi_2`, :math:`\varphi_3`.
te: ముందుగా, మేము సర్క్యూట్‌ను 3 క్విట్‌లతో ప్రారంభించాము, సహాయక క్విట్‌కు 1 మరియు 2-క్విట్ గేట్ కోసం 2 మరియు దశ బిట్‌లను నిల్వ చేయడానికి 3 క్లాసికల్ బిట్‌లు :math:`\varphi_1`, :math:`\varphi_2`, :math:`\varphi_3`.
tr: Öncelikle devreyi, yardımcı kübit için 1 tane ve iki kübitli kapılar için 2 tane olmak üzere toplamda 3 kübitle ve :math:`\varphi_1`, :math:`\varphi_2`, :math:`\varphi_3` faz bitlerini depolamak için 3 klasik bitle ilklendiriyoruz.

source: Now we build the quantum circuit for the first step, to estimate the least significant phase bit :math:`\varphi_m=\varphi_3`.
bn_bn: এবার আমরা কম তাৎপর্যপূর্ণ দশা বিট :math:`\varphi_m=\varphi_3` অনুমানের জন্য আমরা কোয়ান্টাম বর্তনী (সার্কিট) বানাবো।
fr_fr: Nous construisons alors le circuit quantique pour la première étape, afin d'estimer le bit de phase le moins significatif :math:`\varphi_m = \varphi_3`.
ja_jp: ここでは最初のステップの量子回路を構築し、位相ビットの最下位ビット :math:`\varphi_m=\varphi_3` を推定します。
ko: 이제 가장 중요하지 않은 위상 비트 :math:`\varphi_m=\varphi_3` 를 예측하기 위해 첫 번째 단계로 양자 회로를 구축한다.
pt_un: Agora nós construímos o circuito quântico para a primeira etapa, para estimar o bit de fase menos significativo :math:`\varphi_m=\varphi_3`.
ru_ru: Теперь строим квантовую цепь для первой итерации алгоритма, которая даст младший бит фазы :math:`\varphi_3`.
ta_in: குறைந்த பட்ச குறிப்பிடத்தக்க கட்ட பிட்டை மதிப்பிடுவதற்கு இப்போது முதல் படிக்கு குவாண்டம் சுற்று உருவாக்குகிறோம் :math:`\varphi_m=\varphi_3`.
te: ఇప్పుడు మనం మొదటి దశ కోసం క్వాంటం సర్క్యూట్‌ను రూపొందించాము, అతి తక్కువ ముఖ్యమైన ఫేజ్ బిట్:math:`\varphi_ m=\varphi 3` అంచనా వేయడానికి.
tr: Şimdi en az anlamlı faz bitini tahmin etmek için ilk adım için kuantum devresini oluşturuyoruz :math:`\varphi_m=\varphi_3`.

source: We initialize the auxiliary qubit and the other qubits with the eigenstate :math:`|11\rangle`.
bn_bn: আমরা সহায়ক কিউবিট ও অনান্য কিউবিট :math:`|11\rangle` আইজেনস্টেট দিয়ে শুরু করি।
fr_fr: Nous initialisons le qubit auxiliaire en appliquant une porte d'Hadamard dessus et les deux autres qubits en les mettant dans l'état propre :math:`|11\rangle`.
ja_jp: 補助量子ビットを初期化し、その他の量子ビットを固有状態 :math:`|11\rangle` で初期化します。
ko: 고유 상태 :math:`|11\rangle` 로 보조 큐비트와 다른 큐비트들을 초기화한다.
pt_un: Nós inicializamos o qubit auxiliar e os outros qubits com o eigenstate (autoestado / estado inerente) :math:`|11\rangle`.
ru_ru: Мы подготавливаем служебный кубит, используя гейт Адамара, и переводим остальные в состояние :math:`|11\rangle`.
te: మేము eigenstate :math:`|11\rangle`తో సహాయక క్విట్ మరియు ఇతర క్విట్‌లను ప్రారంభిస్తాము.
tr: Yardımcı kübiti ve diğer kübitleri :math:`|11\rangle` özdurumuyla ilklendiriyoruz.

source: Then we have to apply multiple times the :math:`CU` operator, that, in this example, is the Controlled-\ :math:`CT` gate (:math:`CCT` for short).
bn_bn: এরপর আমাদের একাধিকবার :math:`CU` অপারেটর প্রয়োগ করতে হবে, এই উদাহরণে যা নিয়ন্ত্রিত-\ :math:`CT` গেট (সংক্ষেপে :math:`CCT`)।
fr_fr: Ensuite, nous devons appliquer plusieurs fois l'opérateur :math:`CU`, qui, dans cet exemple, est la porte contrôle-\ :math:`CT'(que l'on abrégera en :math:`CCT`).
ja_jp: この場合、 :math:`CU` 演算子を複数回適用する必要があります。この例では、制御 :math:`CT` ゲート (短縮して :math:`CCT`) です。
pt_un: Temos então que aplicar várias vezes o operador :math:`CU` , o qual, neste exemplo, é o portão Controlled-\ :math:`CT` (resumidamente :math:`CCT`).
ru_ru: Затем несколько раз применяем оператор :math:`CU`, которым в нашем примере является контролируемый гейт :math:`CT` (:math:`CCT` для краткости).
ta_in: பின்னர் நாம் பல முறை விண்ணப்பிக்க வேண்டும் :math:`CU` ஆபரேட்டர், இந்த எடுத்துக்காட்டில், கட்டுப்படுத்தப்பட்ட- \ :math:`CT` வாயில் (:math:`CCT` சுருக்கமாக).

source: To implement :math:`CCT` in the circuit, since :math:`T` is a phase gate, we can use the multi-controlled phase gate :math:`\text{MCP}(\theta)`, with :math:`\theta=\pi/4`.
bn_bn: বর্তনীতে (সার্কিট) :math:`CCT` বাস্তবায়নের জন্য আমরা :math:`\theta=\pi/4` -এর সাথে বহুদ্বারা নিয়ন্ত্রিত দশা গেট :math:`\text{MCP}(\theta)` ব্যবহার করতে পারি, যেহেতু :math:`T` একটা দশা গেট।
fr_fr: Afin d'implémenter :math:`CCT`, nous pouvons utiliser le fait que :math:`CT` soit une porte de phase. Nous pouvons donc utiliser la porte de phase contrôlée de façon multiple :math:`\text{MCP}(\theta)`, avec :math:`\theta=\frac{\pi}{4}`.
ja_jp: :math:`CCT` を回路に実装するには、 :math:`T` は位相ゲートなので、マルチ制御位相ゲート :math:`\text{MCP}(\theta)` を :math:`\theta=\pi/4` で使用できます。
ko: :math:`CCT` 를 회로에 구현할 때, :math:`T` 가 위상 게이트이므로 다중 제어 위상 게이트 :math:`\text{MCP}(\theta)` 와 :math:`\theta=\pi/4` 를 함께 사용한다.
pt_un: Para implementar :math:`CCT` no circuito, dado que :math:`T` é um portão de fase, podemos usar o portão de fase multi-controlado :math:`\text{MCP}(\theta)`, com :math:`\theta=\pi/4`.
ru_ru: Так как :math:`T` действует на фазу, для реализации :math:`CCT` в цепи можно использовать многоконтрольный фазовый гейт (multi-controlled phase gate) :math:`\text{MCP}(\theta)` с :math:`\theta=\pi/4`.
ta_in: செயல்படுத்த :math:`CCT` சுற்று, என்பதால் :math:`T` என்பது ஒரு கட்ட வாயில், நாம் பல கட்டுப்பாட்டு கட்ட வாயிலைப் பயன்படுத்தலாம் :math:`\text{MCP}(\theta)`, உடன் :math:`\theta=\pi/4`.
te: సర్క్యూట్‌లో :math:`CCT`ని అమలు చేయడానికి, :math:`T` ఒక ఫేజ్ గేట్ కాబట్టి, మేము బహుళ-నియంత్రిత ఫేజ్ గేట్:math:`\text{MCP}(\theta)`ని ఉపయోగించవచ్చు :math:`\theta=\pi/4`.
tr: Devrede :math:`CCT`yi yürütmek için, mademki :math:`T` bir faz kapısıdır, çok-kontrollü faz geçidi olan :math:`\text{MCP}(\theta)`ı :math:`\theta=\pi/4` ile kullanabiliriz.

source: Let’s apply :math:`2^t` times :math:`\text{MCP}(\pi/4)`. Since for the first step :math:`t=m-1` and :math:`m=3`, we have :math:`2^t=4`.
bn_bn: :math:`2^t` বার :math:`\text{MCP}(\pi/4)` প্রয়োগ করা যাক। যেহেতু প্রথম ধাপে :math:`t=m-1` ও :math:`m=3`, আমরা বলতে পারি :math:`2^t=4`।
fr_fr: Appliquons alors :math:`2^t` fois :math:`\text{MCP}\left(\frac{\pi}{4}\right)`. Puisque pour la première étape on a :math:`t=m-1` et que l'on a :math:`m=3`, on en déduit :math:`2^t=4`.
ja_jp: それでは :math:`\text{MCP}(\pi/4)` を :math:`2^t` 回適用しましょう。最初のステップは :math:`t=m-1`、そして :math:`m=3` なので、 :math:`2^t=4` です。
ko: :math:`\text{MCP}(\pi/4)` 를 :math:`2^t` 번 적용해 보자. 첫 번째 단계에서는 :math:`t=m-1` 과 :math:`m=3` 이므로, :math:`2^t=4` 를 얻을 수 있다.
pt_un: Vamos aplicar :math:`2^t` vezes :math:`\text{MCP}(\pi/4)`. Uma vez que para o primeiro passo :math:`t=m-1` e :math:`m=3`, temos :math:`2^t=4`.
ru_ru: Применим :math:`2^t` раз :math:`\text{MCP}(\pi/4)`. Первая итерация соответствует :math:`t=m-1` и :math:`m=3`, так что :math:`2^t=4`.
ta_in: நாம் :math:`2^t` முறை :math:`\text{MCP}(\pi/4)`. முதல் படி :math:`t=m-1` மற்றும் :math:`m=3`, எங்களிடம் :math:`2^t=4`.

source: Finally, we perform the measurenment of the auxiliary qubit in x-basis. We can use the ``x_measurement`` function defined above in the example for 1-qubit gate. In this way we have obtained the phase bit :math:`\varphi_3` and stored it in the classical bit :math:`c_0`.
bn_bn: অবশেষে আমরা x-ভিত্তিতে সহায়ক কিউবিট পরিমাপ করব। এজন্য আমরা আগে ১-কিউবিট গেটের উদাহরণে লেখা ``x_measurement`` -এর ফাংশন ব্যবহার করব। এভাবে আমরা :math:`\varphi_3` দশা বিট পাবো এবং তা :math:`c_0` প্রথাগত (ক্লাসিক্যাল) বিটে সঞ্চয় করব।
fr_fr: Enfin, nous réalisons la mesure du qubit auxiliaire dans la base :math:`X`. Nous pouvons utiliser la fonction ``x_mesure`` définie précédemment dans l'exemple d'un opérateur à 1 qubit. Ainsi, nous obtenons le bit de phase :math:`\varphi_3` et le stockons dans le bit classique :math:`c_0`.
ja_jp: 最後に、補助量子ビットをX基底で測定します。上の1量子ビットの例で定義した ``x_measurement`` 関数が使えます。この方法で位相ビット :math:`\varphi_3` を古典ビット :math:`c_0` に取得することができます。
pt_un: Finalmente, realizamos a medida do qubit auxiliar na base x. Podemos usar a função ``x_measurement`` definida acima, no exemplo de uma porta de 1 qubit. Dessa forma, obtemos o bit de fase :math:`\varphi_3` e podemos guardá-lo no bit clássico :math:`c_0`.
ru_ru: Наконец переходим к измерению служебного кубита в x-базисе. Для этого можно использовать функцию ``x_measurement``, заданную выше в примере с однокубитным гейтом. Таким образом мы получаем фазовый бит :math:`\varphi_3` и сохраняем его в классическом бите :math:`c_0`.
ta_in: இறுதியாக, துணை குவிட்டின் அளவை x- அடிப்படையில் செய்கிறோம். 1-குவிட் கேட்டுக்கான எடுத்துக்காட்டில் மேலே வரையறுக்கப்பட்ட ``x_measurement`` செயல்பாட்டைப் பயன்படுத்தலாம். இந்த வழியில் நாம் கட்டம் பிட் :math:`\varphi_3` ஐப் பெற்று கிளாசிக்கல் பிட் :math:`c_0` இல் சேமித்துள்ளோம்.

source: Subsequent steps (2nd, 3rd)
bn_bn: ক্রমানুসারে (২য় ও ৩য় ধাপ)
fr_fr: Étapes suivantes (deuxième et troisième étapes)
ja_jp: 次のステップ (第２、第３)
ko: 후속 단계 (2차, 3차)
pt_un: Passos subsequentes (segundo, terceiro)
ru_ru: Дальнейшие итерации (вторая и третья)
ta_in: அடுத்தடுத்த படிகள் (2 வது, 3 வது)
te: తదుపరి దశలు (2వ, 3వ)
tr: Sonraki adımlar (2., 3.)

source: Now we build the quantum circuit for the other remaining steps, the second and the third ones. As said in the first example, in these steps we have the additional sub-step of the phase correction.
bn_bn: এখন বাকি ধাপের (২য় ও ৩য়) জন্য কোয়ান্টাম বর্তনী (সার্কিট) বানাবো। প্রথম উদাহরণের মতো এখানেও দশা সংশোধনের অতিরিক্ত ধাপ আছে।
fr_fr: Nous construisons alors le circuit quantique pour les étapes restantes, la seconde et la troisième. Comme expliqué dans le premier exemple, dans ces étapes, nous avons la sous-étape supplémentaire de la correction de la phase.
ja_jp: さて、残りの第２と第３のステップのために量子回路を作ります。最初の例で述べたように、ここでは位相補正のサブステップの追加があります。
ko: 이제 나머지 단계, 즉 두 번째 단계와 세 번째 단계를 위한 양자 회로를 구축한다. 첫 번째 예에서 말했듯이 이 단계에는 위상 보정의 추가 하위 단계가 있다.
pt_un: Agora, construímos o circuito quântico para os outros passos restantes - o segundo e o terceiro. Como dito no primeiro exemplo, nesses passos temos um "sub-passo" adicional de correção de fase.
ru_ru: Продолжаем строить квантовую цепь для второй и третьей итераций. Как отмечалось ранее, здесь требуется дополнительный этап поправки фазы.
te: ఇప్పుడు మేము మిగిలిన మిగిలిన దశలు, రెండవ మరియు మూడవ వాటి కోసం క్వాంటం సర్క్యూట్‌ను నిర్మిస్తాము. మొదటి ఉదాహరణలో చెప్పినట్లుగా, ఈ దశల్లో మనకు దశ దిద్దుబాటు యొక్క అదనపు ఉప-దశ ఉంటుంది.
tr: Şimdi diğer kalan ikinci ve üçüncü adımlar için kuantum devresini oluşturuyoruz. İlk örnekte de söylendiği gibi, bu adımlarda, faz düzeltmesinin ek alt adımı mevcut.

source: In order to extract the phase bit :math:`\varphi_{2}`, we perform a phase correction of :math:`-\pi\varphi_3/2`.
bn_bn: দশা বিট :math:`\varphi_{2}` নিষ্কাশনের জন্য আমরা :math:`-\pi\varphi_3/2` -এর ত্রুটি সংশোধন করব।
fr_fr: Afin d'extraire le bit de phase :math:`\varphi_{2}`, nous effectuons une correction de phase de :math:`-\varphi_3\frac{\pi}{2}`.
ja_jp: 位相ビット :math:`\varphi_{2}` を抽出するために、 :math:`-\pi\varphi_3/2` の位相補正を行います。
ko: 위상 비트 :math:`\varphi_{2}` 를 추출하기 위해 :math:`-\pi\varphi_3/2` 의 위상 보정을 실시한다.
pt_un: Para extrair o bit de fase :math:`\varphi_{2}`, fazemos uma correção de fase de :math:`-\pi\varphi_3/2`.
ru_ru: Перед вычислением :math:`\varphi_{2}` делаем поправку на :math:`-\pi\varphi_3/2`.
ta_in: கட்ட பிட் பிரித்தெடுப்பதற்காக :math:`\varphi_{2}`, :math:`-\pi\varphi_3/2` இன் ஒரு கட்ட திருத்தம் செய்கிறோம்.
te: దశ బిట్‌ను సంగ్రహించడానికి :math:`\varphi_{2}`, మేము :math:`-\pi\varphi_3/2` యొక్క దశ సవరణను చేస్తాము.
tr: :math:`\varphi_{2}` faz bitini çıkarmak için, :math:`-\pi\varphi_3/2` faz düzeltmesini yapıyoruz.

source: So, after the reset we apply the phase gate :math:`P(\theta)` with phase :math:`\theta=-\pi/2` conditioned by the classical bit :math:`c_0` (:math:`=\varphi_3`).
bn_bn: পুনঃস্থাপনের (রিসেট) পর আমরা :math:`\theta=-\pi/2` দশা সম্পন্ন দশা গেট :math:`P(\theta)` প্রয়োগ করবো, শর্ত হিসেবে প্রথাগত (ক্লাসিক্যাল) বিট :math:`c_0` (:math:`=\varphi_3`)।
fr_fr: Ainsi, après la réinitialisation, nous appliquons la porte de phase :math:`\text{P}(\theta)` avec la phase :math:`\theta=-\frac{\pi}{2}` conditionnée par le bit classique :math:`c_0` (:math:`=\varphi_3`).
ja_jp: したがって、リセット後に古典ビット :math:`c_0` (:math:`=\varphi_3`)を条件として、ゲート :math:`P(\theta)` を位相 :math:`\theta=-\pi/2` で適用します。
ko: 따라서 재설정 후 고전 비트 :math:`c_0` (:math:`=\varphi_3`) 로 조절된 위상 :math:`\theta=-\pi/2` 를 사용하여 위상 게이트 :math:`P(\theta)` 를 적용한다.
pt_un: Então, após fazer o reset, aplicamos a porta de fase :math:`P(\theta)` com fase de valor :math:`\theta=-\pi/2`, condicionada no bit clássico :math:`c_0` (:math:`=\varphi_3`).
ru_ru: Таким образом, после сброса мы применяем фазовый гейт :math:`P(\theta)` с :math:`\theta=-\pi/2`, зависящий от значения классического бита :math:`c_0` (:math:`=\varphi_3`).
ta_in: எனவே, மீட்டமைத்த பின் கட்டம் :math:`P(\theta)` கட்டம் :math:`\theta=-\pi/2` கிளாசிக்கல் பிட் :math:`c_0` (:math:`=\varphi_3`).
te: కాబట్టి, రీసెట్ చేసిన తర్వాత మనం దశ గేట్ :math:`P(\theta)`ని ఫేజ్ :math:`\theta=-\pi/2`తో క్లాసికల్ బిట్ :math:`c_0` (:math: `=\varphi_3`) ద్వారా కండిషన్ చేయబడుతుంది.
tr: O zaman bu sıfırlamadan sonra, :math:`c_0` (:math:`=\varphi_3`) klasik bitiyle şartlandırılmış :math:`\theta=-\pi/2` fazına sahip :math:`P(\theta)` faz kapısını uygularız.
