Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/09_IQPE.po
Languages: bn_bn, fr_fr, ja_jp, ko, pt_un, ru_ru, ta_in, te, tr

source: The detailed explanation of how the algorithm works can be found in `Iterative Phase Estimation (IPE) Algorithm <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__. To understand QPE in depth, you can see also `Ch.3.6 Quantum Phase Estimation <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__.
bn_bn: ধারাক্রম (অ্যালোগরিদম) কিভাবে কাজ করে বিস্তারিত জানতে `Iterative Phase Estimation (IPE) Algorithm <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__ দেখো। কিউপিই (QPE) ব্যাপারে জানতে `Ch.3.6 Quantum Phase Estimation <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__ দেখো।
fr_fr: L'explication détaillée du fonctionnement de l'algorithme peut être trouvée sur la page `Iterative Phase Estimation (IPE) Algorithm <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__. Pour comprendre l'algorithme QPE en profondeur, vous pouvez également voir `Ch.3.6 Quantum Phase Estimation <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__.
ja_jp: アルゴリズムがどのように動作するかについての詳細な説明は、「 `反復位相推定 (IPE) アルゴリズム <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__ 」にあります。より深く QPE を理解するには、「 `Ch.3.6 量子位相推定 <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__」も参照してください。
ko: 알고리즘이 어떻게 동작하는지에 대한 자세한 설명은 `Iterative Phase Estimation (IPE, 반복 위상 추정) 알고리즘 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__ 에서 찾을 수 있다. QPE를 심도 있게 이해하려면 `Ch.3.6 Quantum Phase Estimation (양자 위상 추정) <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__ 에서 볼 수 있다.
pt_un: A explicação detalhada de como o algoritmo funciona pode ser encontrada em ` Algoritmo Iterativo de Estimação de Fase (IPE) <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>` __. Para entender o QPE em profundidade, você pode ver também `Ch.3.6 Quantum Phase Estimation <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>` __.
ru_ru: Подробное объяснение работы алгоритмов можно найти по ссылкам `Итерационный алгоритм оценки фазы (Iterative Phase Estimation Algorithm, IPE) <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__ и `Глава 3.6 Квантовая оценка фазы (Quantum Phase Estimation. QPE) <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__.
ta_in: வழிமுறை எவ்வாறு செயல்படுகிறது என்பதற்கான விரிவான விளக்கத்தை `Iterative Phase Estimation (IPE) Algorithm <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__. QPE ஐ ஆழமாக புரிந்து கொள்ள, நீங்கள் `Ch.3.6 Quantum Phase Estimation <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__ ஐயும் காணலாம்.
te: అల్గోరిథం ఎలా పనిచేస్తుందనే వివరణాత్మక వివరణను `ఇటరేటివ్ ఫేజ్ ఎస్టిమేషన్ (IPE) అల్గారిథమ్‌లో కనుగొనవచ్చు <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithme >`__. QPEని లోతుగా అర్థం చేసుకోవడానికి, మీరు `Ch.3.6 క్వాంటం ఫేజ్ అంచనా <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__ని కూడా చూడవచ్చు.
tr: Algoritmanın nasıl çalıştığına ilişkin ayrıntılı açıklama, `Iterative Phase Estimation (IPE) Algorithm <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__. QPE'yi derinlemesine anlamak için, ayrıca `Ch.3.6 Quantum Phase Estimation <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__ bölümünü de inceleyebilirsiniz.

source: IPE example with a 1-qubit gate for :math:`U`
bn_bn: :math:`U` -এর জন্য ১-কিউবিট যুক্তিবর্তনী (গেইট) সম্পন্ন আইপিই এর উদাহরণ
fr_fr: Exemple d'IPE avec une porte :math:`U` s'appliquant sur un unique qubit
ja_jp: :math:`U` の1量子ビットゲートでの IPE の例
ko: :math:`U` 에 대한 1-큐비트 게이트의 IPE 예제
pt_un: Exemplo do IPE com uma porta de 1 bit para :math:`U`
ru_ru: Пример работы IPE с однокубитным вентилем :math:`U`
ta_in: IPE உதாரணம் :math:` U ` க்கு 1-qubit வாய்ப்பாடு
te: :math:`U` కోసం 1-క్విట్ గేట్‌తో IPE ఉదాహరణ
tr: :math:`U` için 1 kübit geçitli IPE örneği

source: We want to apply the IPE algorithm to estimate the phase for a 1-qubit operator :math:`U`. For example, here we use the :math:`S`-gate.
bn_bn: আমরা আইপিই ধারাক্রম (অ্যালোগরিদম) প্রয়োগ করে ১-কিউবিট অপারেটরের :math:`U` দশা অনুমান করব। উদাহরণরূপে এখানে আমরা :math:`S` -গেট ব্যবহার করব।
fr_fr: Nous voulons appliquer l'algorithme IPE pour estimer la phase d'une valeur propre d'un opérateur :math:`U` s'appliquant sur un unique qubit. Par exemple, nous utilisons ici la porte :math:`S`.
ja_jp: 1量子ビット演算子 :math:`U` の位相を推定するために、IPEアルゴリズムを適用したいとします。例えば、 :math:`S`-ゲートを使用します。
ko: 1-큐비트 연산자 :math:`U` 의 위상을 추정하고자 IPE 알고리즘을 적용하고자 한다. 예를 들어, 여기서는 :math:`S`-게이트를 사용한다.
pt_un: Queremos aplicar o algoritmo do IPE para estimar a fase para um operador de 1-qubit :math:` U `. Por exemplo, aqui utilizamos a porta :math:`S`.
ru_ru: Используем алгоритм IPE для оценки фазы однокубитного оператора :math:`U`, например гейта :math:`S`.
ta_in: 1-குவிட் ஆபரேட்டருக்கான கட்டத்தை மதிப்பிடுவதற்கு IPE வழிமுறையைப் பயன்படுத்த விரும்புகிறோம் :math:`U` எடுத்துக்காட்டாக, இங்கே நாம் :math:`S`-கேட் பயன்படுத்துகிறோம்.
te: మేము 1-క్విట్ ఆపరేటర్ కోసం దశను అంచనా వేయడానికి IPE అల్గారిథమ్‌ను వర్తింపజేయాలనుకుంటున్నాము :math:`U`. ఉదాహరణకు, ఇక్కడ మనం :math:`S`-gateని ఉపయోగిస్తాము.
tr: 1 kübitlik bir operatör :math:`U` için fazı tahmin etmek için IPE algoritmasını uygulamak istiyoruz. Örneğin, burada :math:`S`-kapısını kullanıyoruz.

source: Let’s apply the IPE algorithm to estimate the phase for :math:`S`-gate. Its matrix is
bn_bn: :math:`S`-গেটের দশা অনুমানের জন্য আইপিই ধারাক্রম (অ্যালোগরিদম) প্রয়োগ করা যাক। এর ম্যাট্রিক্সটি হল
fr_fr: Appliquons donc l'algorithme IPE pour estimer la phase d'une valeur propre de la porte :math:`S`. Sa matrice est
ja_jp: :math:`S` ゲートの位相を推定するために、IPE アルゴリズムを適用しましょう。その行列は
ko: :math:`S`-게이트의 위상을 추정하고자 IPE 알고리즘을 적용하자. 이때 행렬은 다음과 같다
pt_un: Vamos aplicar o algoritmo do IPE para estimar a fase para a porta :math:` S `. Sua matriz é
ru_ru: Применим IPE для оценки фазы гейта :math:`S`, матрица которого имеет вид
ta_in: இதற்கான கட்டத்தை மதிப்பிடுவதற்கு IPE வழிமுறையைப் பயன்படுத்துவோம் :math:`S`-கேட். அதன் அணி

source: That is, the :math:`S`-gate adds a phase :math:`\pi/2` to the state :math:`|1\rangle`, leaving unchanged the phase of the state :math:`|0\rangle`
bn_bn: অর্থাৎ :math:`|0\rangle অবস্থার দশা অপরিবর্তিত রেখে :math:`S`-গেট, :math:`|1\rangle` অবস্থায় :math:`\pi/2` দশা যোগ করা হল।
fr_fr: Ainsi, la porte :math:`S` ajoute une phase :math:`\frac{\pi}{2}` à l'état :math:`|1\rangle` et laisse inchangée la phase de l'état :math:`|0\rangle`
ja_jp: つまり、 :math:`S`-ゲートは :math:`|0\rangle` 状態の位相はそのままにし、 :math:`|1\rangle` 状態に位相 :math:`\pi/2` を加えます。
ko: 이 말은 :math:`S`-게이트는 :math:`|1\rangle` 상태에 위상 :math:`\pi/2` 을 더하고, :math:`|0\rangle` 상태의 위상은 변하지 않게 내버려 둔다
pt_un: Ou seja, a porta :math:` S ` adiciona uma fase :math:` \pi/2 ` ao estado :math:` | 1\rangle`, deixando inalterada a fase do estado :math:` | 0\rangle `
ru_ru: Это означает, что гейт :math:`S` добавляет фазу :math:`\pi/2` у состояния :math:`|1\rangle`, а состояние :math:`|0\rangle` оставляет неизменным
ta_in: அதாவது, :math:`S`-கேட் ஒரு கட்டத்தை சேர்க்கிறது :math:`\pi/2` மாநிலத்திற்கு :math:`|1\rangle`, மாநிலத்தின் கட்டத்தை மாற்றாமல் விட்டுவிடுகிறது :math:`|0\rangle
te: అంటే, :math:`S`-గేట్ రాష్ట్రం :math:`|1\rangle`కి దశ :math:`\pi/2`ని జోడిస్తుంది, రాష్ట్ర దశ :math:`|0\rangle` మారదు
tr: Yani, :math:`S` geçiti, :math:`\pi/2` durumuna bir faz ekler ve :math:`|1\rangle` durumunun fazını değiştirmeden bırakır :math:`|0 \rangle`

source: In the following, we will use the notation and terms used in `Section 2 of lab 4 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__.
bn_bn: নিচে আমরা `অংশ ২ পরীক্ষা ৪ <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__ এর নামকরণ ও পদ ব্যবহার করব।
fr_fr: Dans ce qui suit, nous utiliserons la notation et les termes utilisés dans `la section 2 du Lab 4 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__.
ja_jp: 以下では、 `Section 2 of lab 4 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__ と同じ表記と用語を使用します。
ko: 다음부터는 `랩 4의 2절 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__ 의 표기 및 용법을 사용한다.
pt_un: No seguinte, utilizaremos a notação e os termos utilizados em `Seção 2 do laboratório 4 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>` __.
ru_ru: Далее мы используем обозначения и термины из `Раздела 2 Лабораторной работы 4 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__.
ta_in: பின்வருவனவற்றில், `Section 2 of lab 4 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__ இல் பயன்படுத்தப்படும் குறியீடு மற்றும் சொற்களைப் பயன்படுத்துவோம்.
te: కింది వాటిలో, మేము `ల్యాబ్ 4లోని సెక్షన్ 2 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__లో ఉపయోగించిన సంజ్ఞామానం మరియు నిబంధనలను ఉపయోగిస్తాము.
tr: Aşağıda, `Section 2 of lab 4 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__ kullanılan gösterim ve terimleri kullanacağız.

source: Let’s consider to estimate the phase :math:`\phi=\frac{\pi}{2}` for the eigenstate :math:`|1\rangle`, we should find :math:`\varphi=\frac{1}{4}` (where :math:`\phi = 2 \pi \varphi`). Therefore to estimate the phase we need exactly 2 phase bits, i.e. \ :math:`m=2`, since :math:`1/2^2=1/4`. So :math:`\varphi=0.\varphi_1\varphi_2`.
bn_bn: :math:`|1\rangle` আইজেনস্টেটের :math:`\phi=\frac{\pi}{2}` দশা অনুমান করার জন্য আমাদের :math:`\varphi=\frac{1}{4}` -এর মান নির্ণয় করতে হবে, যখন :math:`\phi = 2 \pi \varphi`। এরফলে দশা অনুমানের জন্য আমাদের ২টি দশা বিট লাগবে, অর্থাৎ \ :math:`m=2`, যেহেতু :math:`1/2^2=1/4`। সেজন্য :math:`\varphi=0.\varphi_1\varphi_2`।
fr_fr: On veut alors estimer la phase :math:`\phi=\frac{\pi}{2}` de la valeur propre associée au vecteur propre :math:`|1\rangle`. Nous devrions trouver :math:`\varphi=\frac{1}{4}` (où :math:`\phi=2\pi\varphi`). Par conséquent, pour estimer la phase, nous avons besoin d'exactement 2 bits de phase, c'est-à-dire \ :math:`m=2`, puisque l'on peut représenter exactement :math:`\varphi` en utilisant deux bits, comme :math:`\frac{1}{2^2} = \frac{1}{4}`. On écrira :math:`\varphi=0.\varphi_1\varphi_2`.
ja_jp: 固有状態 :math:`|1\rangle` の位相 :math:`\phi=\frac{\pi}{2}` の位相推定を考えましょう。 :math:`\varphi=\frac{1}{4}` を得るはずです ( :math:`\phi = 2 \pi \varphi` のため) 。:math:`1/2^2=1/4` なので位相推定のためにちょうど 2 つの位相ビット、すなわち \ :math:`m=2` が必要になります。 そして :math:`\varphi=0.\varphi_1\varphi_2` です。
pt_un: Vamos considerar estimar a fase :math:`\phi=\frac{\pi}{2}` para o autoestado :math:`|1\rangle`, nós devemos encontrar :math:`\varphi=\frac{1}{4}` (where :math:`\phi = 2 \pi \varphi`). Desta forma para estimar a fase precisamos de exatamente 2 bits de fase, ou seja, \ :math:`m=2`, uma vez que :math:`1/2^2=1/4`. Então :math:`\varphi=0.\varphi_1\varphi_2`.
ru_ru: Попробуем оценить фазу :math:`\phi=\frac{\pi}{2}` собственного вектора :math:`|1\rangle`. Мы должны получить :math:`\varphi=\frac{1}{4}` (если :math:`\phi=2\pi \varphi`). Поэтому для решения задачи нам требуется в точности 2 фазовых бита, т.е. \ :math:`m=2`, поскольку :math:`1/2^2 = 1/4 `. Тогда :math:`\varphi=0.\varphi_1\varphi_2`.

source: Remember from the theory that for the IPE algorithm, :math:`m` is also the number of iterations, so we need only :math:`2` iterations or steps.
bn_bn: আইপিই ধারাক্রম (অ্যালোগরিদম) এর থেকে মনে থাকবে, :math:`m` হলো পুনরাবৃত্তির সংখ্যা, অর্থাৎ আমাদের :math:`2` বার পুনরাবৃত্তি করতে হবে।
fr_fr: On rappelle que pour l'algorithme IPE, :math:`m` est aussi le nombre d'itérations, donc nous n'avons besoin que de :math:`2` itérations ou étapes.
ja_jp: IPEアルゴリズムの理論を思い出してください。 :math:`m` は繰り返し数でもありますので、 :math:`2`の繰り返し数またはステップだけが必要です。
ko: IPE 알고리즘에서 :math:`m` 는 반복 회수이기도 한 점을 기억하라. 따라서 :math:`2` 번의 반복 또는 단계가 필요하다.
pt_un: Lembre-se da teoria de que para o algoritmo do IPE, :math:` m ` é também o número de iterações, portanto, precisamos de apenas :math:` 2 ` iterações ou etapas.
ru_ru: Вспомним, что в алгоритме IPE :math:`m` также определяет количество итераций, поэтому в данном случае нам нужно всего лишь :math:`2` шага или итерации.
ta_in: IPE வழிமுறையைப் பொறுத்தவரை, :math:`m` என்பது மறு செய்கைகளின் எண்ணிக்கையாகும், எனவே நமக்கு மட்டும் தேவை :math:`2` மறு செய்கைகள் அல்லது படிகள்.
te: IPE అల్గోరిథం కోసం, :math:`m` అనేది పునరావృతాల సంఖ్య అని సిద్ధాంతం నుండి గుర్తుంచుకోండి, కాబట్టి మనకు :math:`2` పునరావృత్తులు లేదా దశలు మాత్రమే అవసరం.
tr: Teoriden hatırlayın ki, IPE algoritması için :math:`m` aynı zamanda yinelemelerin sayısıdır, bu nedenle yalnızca :math:`2` yinelemelere veya adımlara ihtiyacımız var.

source: First, we initialize the circuit. IPE works with only 1 auxiliary qubit, instead of :math:`m` counting qubits of the QPE algorithm. Therefore, we need 2 qubits, 1 auxiliary qubit and 1 for the eigenstate of :math:`U`-gate, and a classical register of 2 bits, for the phase bits :math:`\varphi_1`, :math:`\varphi_2`.
bn_bn: প্রথমে আমরা বর্তনী (সার্কিট) চালু করব। আইপিই কেবল একটা সহায়ক কিউবিট নিয়ে কাজ করে, যেখানে কিউপিই ধারাক্রম (অ্যালোগরিদম) :math:`m` গুলো গণনাকারী কিউবিট ব্যবহার করে। সেজন্য আমাদের ২টি কিউবিট, ১ টা সহায়ক কিউবিট, :math:`U` -গেটের আইজেনস্টেটের জন্য ১ টা কিউবিট এবং ২ বিটের একটা প্রথাগত (ক্লাসিক্যাল) রেজিস্টার (দশা বিট :math:`\varphi_1`, :math:`\varphi_2` -এর জন্য) লাগবে।
fr_fr: Tout d'abord, il nous faut initialiser le circuit. L'algorithme IPE fonctionne avec seulement un qubit auxiliaire, au lieu des :math:`m` qubits à mesurer de l'algorithme QPE. Nous avons donc besoin de 2 qubits, 1 qubit auxiliaire et 1 pour l'état propre de la porte :math:`U`, ainsi que d'un registre classique de 2 bits, pour les bits de phase :math:`\varphi_1` et :math:`\varphi_2`.
ja_jp: 最初に回路を初期化します。 IPE は、 QPE アルゴリズムでの量子ビット数 :math:`m` ではなく、たった1 つの補助量子ビットを使用します。 そのため補助量子ビットに１、 :math:`U` -ゲート の固有状態に１、合計２量子ビットを必要とします。そして位相ビット :math:`\varphi_1`, :math:`\varphi_2` のために、古典レジスタが２ビット必要です。
ko: 먼저 회로를 초기화한다. IPE는 QPE 알고리즘에서 :math:`m` 개의 카운팅 큐비트 (counting qubit) 대신, 1개의 보조 큐비트로 동작한다. 그러므로 1개의 보조 큐비트와 1개의 :math:`U`-게이트의 고유 상태인 총 2개의 큐비트와 페이즈 비트 :math:`\varphi_1`, :math:`\varphi_2`를 위한 고전 레지스터 2 비트가 필요하다.
pt_un: Primeiro, inicializamos o circuito. O IPE trabalha com apenas 1 qubit auxiliar, em vez de :math:` m ` contagem de qubits do algoritmo QPE. Por isso, precisamos de 2 qubits, 1 qubit auxiliar e 1 para o autoestado de :math:` U `-gate, e um registrador clássico de 2 bits, para os bits de fase :math:` \varphi_1 `, :math:` \varphi_2 `.
ru_ru: Сначала мы инициализируем цепь. IPE требуется только 1 вспомогательный кубит в отличие от :math:`m` считающих кубитов алгоритма QPE. Поэтому нам нужны 2 кубита, 1 вспомогательный и 1 для собственного состояния оператора :math:`U`, и классический регистр из 2 бит для хранения значений :math:`\varphi_1`, :math:`\varphi_2`.
ta_in: முதலில், நாங்கள் சுற்று துவக்குகிறோம். IPE வழிமுறையின் :math:`m` எண்ணும் குவிட்களுக்குப் பதிலாக, 1 துணை துணைக் கருவியுடன் மட்டுமே IPE செயல்படுகிறது. ஆகையால், கட்டத்தின் பிட்களுக்கு :math:`\varphi_1` , :math:`U`- கேட் மற்றும் 2 பிட்களின் கிளாசிக்கல் பதிவு :math:`\varphi_2`.
te: మొదట, మేము సర్క్యూట్ను ప్రారంభించాము. QPE అల్గోరిథం యొక్క :math:`m` కౌంటింగ్ క్విట్‌లకు బదులుగా IPE కేవలం 1 సహాయక క్విట్‌తో పని చేస్తుంది. కాబట్టి, మనకు :math:`U`-గేట్ యొక్క ఈజెన్‌స్టేట్ కోసం 2 క్విట్‌లు, 1 సహాయక క్విట్ మరియు 1 మరియు దశ బిట్‌ల కోసం 2 బిట్‌ల క్లాసికల్ రిజిస్టర్ అవసరం :math:`\varphi_1`, :math:`\varphi_2`.
tr: İlk olarak devreyi başlatıyoruz. IPE, QPE algoritmasının :math:`m` kübitlerini saymak yerine yalnızca 1 yardımcı kübit ile çalışır. Bu nedenle, :math:`U`-geçişinin öz durumu için 2 kübit, 1 yardımcı kübit ve 1'e ve faz bitleri :math:`\varphi_1`, :math:`\varphi_2` için 2 bitlik klasik bir kayıta ihtiyacımız var.

source: First step
bn_bn: প্রথম ধাপ
fr_fr: Première étape
ja_jp: 第１ステップ
ko: 첫 번째 단계
pt_un: Primeiro passo
ru_ru: Первая итерация
ta_in: முதல் படி
te: మొదటి అడుగు
tr: Birinci Adım

source: Now we build the quantum circuit for the first step, that is, the first iteration of the algorithm, to estimate the least significant phase bit :math:`\varphi_m`, in this case :math:`\varphi_2`. For the first step we have 3 sub-steps: - initialization - application of the Controlled-\ :math:`U` gates - measure of the auxiliary qubit in x-basis
bn_bn: এবার আমরা প্রথম ধাপের জন্য কোয়ান্টাম বর্তনী (সার্কিট) বানাব। এটা ধারাক্রমের (অ্যালোগরিদম) প্রথম পুনরাবৃত্তি যেখানে সবচেয়ে কম তাৎপর্যপূর্ণ দশা বিট :math:`\varphi_m` এর মান অনুমান করা হবে, এক্ষেত্রে :math:`\varphi_2`। প্রথম ধাপের আরো ৩টি অংশ আছে:- আরম্ভ - নিয়ন্ত্রিত-\ :math:`U` গেটের প্রয়োগ - x-ভিত্তিতে সহায়ক কিউবিটের পরিমাপ।
fr_fr: Nous construisons maintenant le circuit quantique pour la première étape, c'est-à-dire la première itération de l'algorithme, afin d'estimer le bit de phase le moins significatif :math:` \varphi_m`, soit dans ce cas :math:`\varphi_2`. Pour la première étape, nous avons 3 sous-étapes: - initialisation - application de la porte contrôle-\ :math:`U` - mesure du qubit auxiliaire dans la base :math:`X`
ja_jp: さて、最初のステップの量子回路を構築します。つまりアルゴリズムの最初の反復として、位相ビットの最下位ビット :math:`\varphi_m` 、今の場合 :math:`\varphi_2` を推定します。最初のステップには３つのサブステップがあります: - 初期化 - 制御-\ :math:`U` ゲート適用 - x 基底での補助量子ビットの測定。
pt_un: Agora construímos o circuito quântico para a primeira etapa, ou seja, a primeira iteração do algoritmo, para estimar a fase menos significativa bit :math:` \varphi_m `, neste caso :math:` \varphi_2 `. Para o primeiro passo temos 3 sub-etapas:-inicialização-aplicação das portas Controlled-\ :math:` U `-medida do qubit auxiliar na base X
ru_ru: Теперь построим квантовую цепь для первой итерации алгоритма, которая в итоге даст младший бит фазы :math:`\varphi_m`, в данном случае :math:`\varphi_2`. Разделим эту задачу на три части: - инициализация - применение управляемого гейта \ :math:`U` - измерение служебного кубита в x-базисе
ta_in: இப்போது நாம் முதல் கட்டத்திற்கான குவாண்டம் சுற்றுவட்டத்தை உருவாக்குகிறோம், அதாவது, வழிமுறையின் முதல் மறு செய்கை, குறைந்த குறிப்பிடத்தக்க கட்ட பிட்டை மதிப்பிடுவதற்கு :math:`\varphi_m`, இந்த விஷயத்தில் :math:`\varphi_2`. முதல் கட்டத்திற்கு எங்களிடம் 3 துணை படிகள் உள்ளன: - துவக்கம் - கட்டுப்படுத்தப்பட்ட பயன்பாடு-\ :math:`U` வாயில்கள் - எக்ஸ்-அடிப்படையில் துணை குவிட்டின் அளவு

source: Initialization
bn_bn: আরম্ভ
fr_fr: Initialisation
ja_jp: 初期化
ko: 초기화
pt_un: Inicialização
ru_ru: Инициализация
ta_in: துவக்கம்
te: ప్రారంభించడం
tr: Başlatma

source: The initialization consists of application the Hadamard gate to the auxiliary qubit and the preparation of the eigenstate :math:`|1\rangle`.
bn_bn: আরম্ভের জন্য আমরা আইজেনস্টেট :math:`|1\rangle` -এর প্রস্তুতি ও সহায়ক কিউবিটে হ্যাডামার্ড যুক্তিবর্তনী প্রয়োগ করতে হবে।
fr_fr: L'initialisation consiste à appliquer une porte d'Hadamard au qubit auxiliaire et à préparer l'état propre :math:`|1\rangle`.
ja_jp: 初期化は、補助量子ビットへのアダマールゲートの適用と、固有状態 :math:`|1\rangle` の準備から構成されます。
ko: 초기화는 Hadamard 게이트를 보조 큐비트에 적용하는 것과 고유 상태 :math:`|1\rangle` 를 준비하는 것으로 구성되어 있다.
pt_un: A inicialização consiste na aplicação do portão Hadamard no qubit auxiliar e da preparação do autoestado :math:`|1\rangle`.
ru_ru: Инициализация заключается в применении вентиля Адамара к вспомогательному кубиту и приготовлении второго кубита в состоянии :math:`|1\rangle`.
ta_in: துவக்கத்தில் ஹடமார்ட் வாயிலை துணை குவிட்டிற்குப் பயன்படுத்துவதும், ஐஜென்ஸ்டேட் தயாரிப்பதும் அடங்கும் :math:`|1\rangle`.
te: ప్రారంభీకరణలో హడమార్డ్ గేట్‌ను సహాయక క్విట్‌కి వర్తింపజేయడం మరియు ఈజెన్‌స్టేట్:math:`|1\rangle` తయారీని కలిగి ఉంటుంది.
tr: Başlatma, Hadamard kapısının yardımcı kübite uygulanmasından ve özdurumun :math:`|1\rangle` hazırlanmasından oluşur.

source: Application of the Controlled-\ :math:`U` gates
bn_bn: Controlled-\ :math:`U` গেটের প্রয়োগ
fr_fr: Application des portes contrôle-\ :math:`U`
ja_jp: 制御 :math:`U` ゲートの適用
pt_un: Aplicação dos portões Controlled-\ :math:`U`
ru_ru: Применение управляемого гейта :math:`U`
ta_in: கட்டுப்படுத்தப்பட்ட பயன்பாடு- :math:`U` வாயில்கள்

source: Then we have to apply :math:`2^t` times the Controlled-\ :math:`U` operators (see also in the docs `Two qubit gates <https://qiskit.org/documentation/tutorials/circuits/3_summary_of_quantum_operations.html#Two-qubit-gates>`__), that, in this example, is the Controlled-\ :math:`S` gate (:math:`CS` for short).
bn_bn: এরপর আমাদের :math:`2^t` বার নিয়ন্ত্রিত-\ :math:`U` অপারেটর প্রয়োগ করতে হবে (বিঃ দ্রঃ `দুই কিউবিট যুক্তিবর্তনী <https://qiskit.org/documentation/tutorials/circuits/3_summary_of_quantum_operations.html#Two-qubit-gates>`__) যা এই উদাহরণে নিয়ন্ত্রিত-\ :math:`S` গেট (ছোট করে :math:`CS`)।
fr_fr: Nous devons ensuite appliquer :math:`2^t` fois les portes contrôle-\ :math:`U` (voir la documentation relatives aux `portes à deux qubits <https://qiskit.org/documentation/tutorials/circuits/3_summary_of_quantum_operations.html#Two-qubit-gates>`__), qui, dans cet exemple, est la porte contrôle-\ :math:`S` (:math:`CS` en abrégé).
ja_jp: 次に制御 :math:`U` 演算子を :math:`2^t` 回適用しなければなりません( `２量子ビットゲート <https://qiskit.org/documentation/tutorials/circuits/3_summary_of_quantum_operations.html#Two-qubit-gates>`__ も参照)。 今回の例では制御 :math:`S` ゲート (略して :math:`CS`)です。
pt_un: Então, temos que aplicar :math:`2^t` vezes os operadores controlados -\ :math:`U` (veja também nas documentações `Duas portas qubit <https://qiskit.org/documentation/tutorials/circuits/3_summary_of_quantum_operations.html#Two-qubit-gates>`__), que, neste exemplo, é a porta controlada-\ :math:`S`(:math:`CS` abreviado).
ru_ru: Теперь применим :math:`2^t` раз подряд условный оператор :math:`U' (подробное описание можно найти в руководстве `Двухкубитные гейты<https://qiskit.org/documentation/tutorials/circuits/3_summary_of_quantum_operations.html#Two-qubit-gates>` __), который в данном примере представляет собой управляемый гейт \:math:`S` (кратко :math:` CS `).
ta_in: பின்னர் நாம் விண்ணப்பிக்க வேண்டும் :math:`2^t` முறை கட்டுப்படுத்தப்பட்ட- \ :math:`U` ஆபரேட்டர்கள் (டாக்ஸிலும் காண்க `Two qubit gates <https://qiskit.org/documentation/tutorials/circuits/3_summary_of_quantum_operations.html#Two-qubit-gates>`__), இது, இந்த எடுத்துக்காட்டில், கட்டுப்படுத்தப்பட்ட- \ :math:`S` கேட் ( :math:`CS` சுருக்கமாக).
