Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/09_IQPE.po
Languages: bn_bn, fr_fr, ja_jp, ko, pt_un, ru_ru, ta_in, te, tr

source: This page was generated from `tutorials/algorithms/09_IQPE.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/algorithms/08_factorizers.ipynb`__ থেকে নেয়া হয়েছে।
fr_fr: Cette page a été générée et traduite à partir de `tutorials/algorithms/09_IQPE.ipynb`__.
ja_jp: このページは `tutorials/algorithms/09_IQPE.ipynb`__. から生成されました。
ko: 이 페이지는 `tutorials/algorithms/09_IQPE.ipynb`__ 로부터 생성되었다.
pt_un: Esta página foi gerada, a partir do `tutorials/algorithms/09_qaoa.ipynb`__.
ru_ru: Страница создана на основе `tutorials/algorithms/09_IQPE.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/algorithms/09_IQPE.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
te: ఈ పేజీ `tutorials/algorithms/09_IQPE.ipynb`__ నుండి రూపొందించబడింది.
tr: Bu sayfa, `tutorials/algorithms/09_IQPE.ipynb`__ adresinden oluşturulmuştur.

source: Iterative Quantum Phase Estimation Algorithm
bn_bn: ধাপে ধাপে কোয়ান্টাম দশা অনুমানকারী ধারাক্রম (অ্যালোগরিদম)
fr_fr: Algorithme itératif d'estimation de phase quantique
ja_jp: 反復量子相推定アルゴリズム
ko: Iterative Quantum Phase Estimation (반복 양자 위상 추정) 알고리즘
pt_un: Algoritmo De Estimação De Fase Quântica Iterativa
ru_ru: Итерационный квантовый алгоритм оценки фазы
ta_in: மறுபயன்பாட்டு குவாண்டம் கட்ட மதிப்பீடு அல்காரிதம்
te: పునరావృత క్వాంటం దశ అంచనా అల్గోరిథం
tr: Yinelemeli Kuantum Faz Tahmini Algoritması

source: The goal of this tutorial is to understand how the Iterative Phase Estimation (IPE) algorithm works, why would we use the IPE algorithm instead of the QPE (Quantum Phase Estimation) algorithm and how to build it with Qiskit using the same circuit exploiting reset gate and the ``c_if`` method that allows to apply gates conditioned by the values stored in a classical register, resulting from previous measurements.
bn_bn: এই টিউটোরিয়ালের উদ্দেশ্য হলো, কিভাবে ইটারেটিভ ফেজ এস্টিমেশন (IPE) অ্যালোগরিদম কাজ করে, কেন আমরা কোয়ান্টাম ফেজ এস্টিমেশন (QPE) অ্যালোগরিদমের বদলে (IPE) অ্যালোগরিদম ব্যবহার করব এবং কিভাবে Qiskit এর সাহায্যে একই বর্তনীতে সার্কিট রিসেট যুক্তিবর্তনী গেইট দিয়ে একে তৈরি করা যায় তা জানা, এবং এরপরেও ``c_if`` পদ্ধতি এর সাহায্যে কিভাবে ক্লাসিক্যাল রেজিস্টারে থাকা আগের মেজারমেন্টের মান শর্ত হিসেবে নিয়ে গেট প্রয়োগ করে আইপিই নির্মাণ (বিল্ড) করা যায় তা জানা।
fr_fr: L'objectif de ce tutoriel est de comprendre comment fonctionne l'algorithme itératif d'estimation de phase quantique (IPE en anglais), pourquoi utiliser cet algorithme au lieu de l'algorithme QPE (Quantum Phase Estimation) et comment le construire avec Qiskit en utilisant le même circuit exploitant la porte de réinitialisation et la méthode ``c_if`` qui permet d'appliquer des portes conditionnées par les valeurs stockées dans un registre classique, résultant de mesures antérieures.
ja_jp: このチュートリアルの目的は、反復位相推定 (IPE) アルゴリズムがどのように機能するか、なぜQPE (Quantum Phase Estimation) アルゴリズムではなくIPEアルゴリズムを使うのか、そしてどうやって Qiskit で構築するか、を理解することです。リセットゲートと ``c_i f`` メソッドは、古典レジスタに格納した前回の測定結果の値で、条件付きゲートを適用することができます。
ko: 이 튜토리얼의 목표는 Iterative Phase Estimation (IPE, 반복 위상 추정) 알고리즘이 어떻게 작동되는지, 왜 우리가 QPE (Quantum Phase Estimation) 가 아니라 IPE 알고리즘을 사용해야 하는지, 그리고 어떻게 Qiskit을 사용해서 이 알고리즘을 생성할 수 있는지를 이해하는 것이다. 이 알고리즘을 생성할 때에는 초기화 게이트와 ``c_if`` 메서드를 포함한 회로를 사용하면 되는데, 이 ``c_if`` 메서드는 이전의 측정들에서 비롯된 고전 레지스터에 저장된 값들로 조절된 게이트들을 적용할 수 있게 한다.
pt_un: O objetivo desse tutorial é explicar como o algoritmo do Processo Iterativo de Fases (IPE) funciona, porque usaríamos o algoritmo IPE ao invés do QPE (Estimativa de Fase Quântica) e como compilá-lo com o Qiskit usando a porta lógica de reset do circuito exploratório e o método "c_if" que permite aplicar portas lógicas resultantes dos valores armazenados em um registrador clássico, obtidos de medições anteriores.
ru_ru: Цель этого урока - понять, как работает алгоритм итеративной оценки фазы (ИОФ), почему мы используем алгоритм ИОФ вместо алгоритма КОФ (квантовой оценки фазы) и как реализовать его с помощью Qiskit, используя одну и ту же схему с использованием операции сброса кубита и метода ``c_if``, который позволяет применять вентили, зависящие от значений, полученных в результате предыдущих измерений и хранящихся в классическом регистре.
te: పునరుక్తి దశ అంచనా (IPE) అల్గోరిథం ఎలా పనిచేస్తుందో అర్థం చేసుకోవడం ఈ ట్యుటోరియల్ యొక్క లక్ష్యం, QPE (క్వాంటం ఫేజ్ ఎస్టిమేషన్) అల్గారిథమ్‌కు బదులుగా IPE అల్గారిథమ్‌ను ఎందుకు ఉపయోగిస్తాము మరియు అదే సర్క్యూట్‌ని ఉపయోగించి రీసెట్ గేట్‌ని ఉపయోగించి Qiskitతో దీన్ని ఎలా నిర్మించాలో అర్థం చేసుకోవడం. మరియు మునుపటి కొలతల ఫలితంగా క్లాసిక్ రిజిస్టర్‌లో నిల్వ చేయబడిన విలువల ద్వారా కండిషన్ చేయబడిన గేట్‌లను వర్తింపజేయడానికి అనుమతించే ``c_if`` పద్ధతి.
tr: Bu eğitimin hedefi, Yinelemeli Faz Tahmini (IPE) algoritmasının nasıl çalıştığını, neden QPE (Kuantum Faz Tahmini) algoritması yerine IPE algoritmasını kullanabileceğimizi ve onu, sıfırlama kapısından ve bir klasik yazmaçta daha önceki ölçümlerden elde edilip depolanmış değerler ile şartlandırılmış kapılar uygulamamızı sağlayan``c_if`` metodundan faydalanan aynı devreyi kullanarak Qiskit ile nasıl derlendiğini anlamak.

source: **References**
bn_bn: **রেফারেন্স সমূহ:**
fr_fr: **Références :**
ja_jp: **参考文献**
ko: **참조**
pt_un: **Referências:**
ru_ru: Дополнительные материалы
ta_in: ** குறிப்புகள் **
te: **ప్రస్తావనలు:**
tr: **Kaynaklar**

source: `Section 2 of Lab 4: Iterative Phase Estimation (IPE) Algorithm <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__
fr_fr: `Section 2 du Lab 4 : Algorithme itératif d'estimation de phase (IPE) <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__
ja_jp: `Section 2 of Lab 4: 反復位相推定 (IPE) アルゴリズム <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__
ko: `랩 4의 2절: Iterative Phase Estimation (IPE, 반복 위상 추정) 알고리즘 <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__
pt_un: Sessão 2 do Laboratório 4: Algoritmo de Estimativa De Fase Iterativa (IPE) Algoritmo <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>` __
ru_ru: `Раздел 2 Лабораторной работы 4: Итерационный алгоритм оценки фазы (Iterative Phase Estimation Algorithm, IPE) <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__
te: `ల్యాబ్ 4లోని సెక్షన్ 2: పునరావృత దశ అంచనా (IPE) అల్గోరిథం <https://qiskit.org/textbook/ch-labs/Lab04_IterativePhaseEstimation.html#2-iterative-phase-estimation-ipe-algorithm>`__

source: `Ch.3.6 Quantum Phase Estimation <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__
fr_fr: `Ch. 3.6 Estimation de phase quantique <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__
ja_jp: `Ch.3.6 量子位相推定 <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__
ko: `Ch.3.6 Quantum Phase Estimation (양자 위상 추정) <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__
pt_un: `Ch.3.6 Estimativa De Fase Quântica <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>` __
ru_ru: `Глава 3.6 Квантовая оценка фазы (Quantum Phase Estimation, QPE) <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__
te: `Ch.3.6 క్వాంటం దశ అంచనా <https://qiskit.org/textbook/ch-algorithms/quantum-phase-estimation.html>`__

source: Conditioned gates: the c_if method
bn_bn: শর্তাধীন গেট: c_if পদ্ধতি
fr_fr: Portes conditionnées : la méthode ``c_if``
ja_jp: 条件付きゲート: c_if メソッド
pt_un: Portões condicionados: o método c_if
ru_ru: Условные вентили: метод c_if

source: Before starting the IPE algorithm, we will give a brief tutorial about the Qiskit conditional method, c_if, as it goes into building the IPE circuit.
bn_bn: আইপিই অ্যালোগরিদম বোঝার আগে আমাদের Qiskit -এর শর্তসাপেক্ষ পদ্ধতি c_if এর ব্যাপারে জানতে হবে, কারণ আইপিই বর্তনী বানাতে এটা কাজে লাগবে।
fr_fr: Avant de s'attaquer à l'algorithme IPE, nous allons effectuer un bref rappel sur la méthode Qiskit conditionnelle, ``c_if``, étant donné qu'elle intervient dans la construction du circuit de l'IPE.
ja_jp: IPEアルゴリズムを始める前に、Qiskitの条件付きメソッドである c_if について、IPE回路を構築するための簡単なチュートリアルをおこないます。
pt_un: Antes de iniciar o algoritmo do IPE, daremos um breve tutorial sobre o método condicional Qiskit, c_if, conforme ele vai para a construção do circuito IPE.
ru_ru: Прежде чем приступить к алгоритму IPE, мы дадим краткое руководство по условному методу Qiskit, c_if, поскольку он используется для построения схемы IPE.
ta_in: IPE வழிமுறையைத் தொடங்குவதற்கு முன், Qiskit நிபந்தனை முறை, c_if பற்றி ஒரு சுருக்கமான டுடோரியலைக் கொடுப்போம், இது IPE சுற்று கட்டமைக்கும்போது.

source: ``c_if`` is a function (actually a method of the gate class) to perform conditioned operations based on the value stored previously in a classical register. With this feature you can apply gates after a measurement in the same circuit conditioned by the measurement outcome.
bn_bn: ``c_if`` হল gate ক্লাসের একটা মেথড, যা পূর্বে ক্লাসিক্যাল রেজিস্টারে সঞ্চিত মানের উপর নির্ভর করে শর্তাধীন ক্রিয়াকলাপ সম্পন্ন করে। এর সাহায্যে আনপারা একই সার্কিটের মধ্যে ফলাফল দ্বারা সীমাবদ্ধ মেজারমেন্টের পর গেটসমূহ ব্যবহার করতে পারেন।
fr_fr: ``c_if`` est une fonction (ou plus exactement une méthode de la classe ``Gate``) pour effectuer des opérations conditionnées par la valeur stockée précédemment dans un registre classique. Avec cette fonctionnalité, il est possible d'appliquer des portes après une mesure dans le même circuit conditionnées par le résultat de ladite mesure.
ja_jp: ``c_if`` は、古典レジスタに以前格納された値に基づいて条件付きの演算を行う関数（実際にはゲートクラスのメソッド）です。この機能を使えば測定後に測定結果を条件にしたゲートを、同じ回路に適用することができます。
ko: (사실상 게이트 클래스의 메서드인) ``c_if`` 는 고전 레지스터에 저장된 값을 기반으로 조건부 연산을 하는 함수이다. 이 기능으로 회로의 측정 이후에 측정 결과를 조건부로 가지는 게이트를 적용할 수 있다.
pt_un: ``c_if``é uma função (na verdade um método da classe Portão) para realizar operações condicionadas baseadas no valor anteriormente armazenado em um registrador clássico. Com esta funcionalidade você pode aplicar portões após uma medição no mesmo circuito, condicionado pelo resultado da medição.
ru_ru: ``c_if`` является функцией (а точнее методом класса Gate) для выполнения условных операций, зависящих от значения классического регистра. Это дает возможность управления гейтами, используя данные предыдущих измерений в этой же цепи.
te: ``c_if`` అనేది క్లాసికల్ రిజిస్టర్‌లో గతంలో నిల్వ చేసిన విలువ ఆధారంగా కండిషన్డ్ ఆపరేషన్‌లను నిర్వహించడానికి ఒక ఫంక్షన్ (వాస్తవానికి గేట్ క్లాస్ యొక్క పద్ధతి). ఈ ఫీచర్‌తో మీరు కొలత ఫలితం ద్వారా కండిషన్ చేయబడిన అదే సర్క్యూట్‌లో కొలత తర్వాత గేట్‌లను వర్తింపజేయవచ్చు.
tr: ``c_if`` bir klasik bitte daha önceden depolanmış değere dayanarak şartlandırılmış işlemler uygulamayı sağlayan bir fonksiyondur (aslında, kapı sınıfının bir metodu). Bu özellik sayesinde, aynı devrede bir ölçümden sonra ölçüm sonuçlarıyla şartlandırılmış kapılar uygulayabilirsiniz.

source: For example, the following code will execute the :math:`X` gate if the value of the classical register is :math:`0`.
bn_bn: উদাহরণস্বরূপ, ক্লাসিকাল রেজিস্টার যদি :math:`0` হয় তাহলে নিম্নলিখিত কোড :math:`X` গেট চালাবে।
fr_fr: Par exemple, le code suivant exécutera la porte :math:`X` si la valeur du registre classique est :math:`0`.
ja_jp: 例えば次のコードでは、古典レジスターの値が :math:`0` の場合 :math:`X` ゲートが実行されます。
ko: 예를 들어, 다음의 코드는 고전 레지스터의 값이 :math:`0` 인 경우에 :math:`X` 게이트를 실행한다.
pt_un: Por exemplo, o código a seguir executará a porta :math:` X ` se o valor do registro clássico for de :math:` 0 `.
ru_ru: Например, следующий код применит вентиль :math:'X'__, только если значение классического регистра равно :math:`0`.
ta_in: எடுத்துக்காட்டாக, பின்வரும் code கிளாசிக்கல் பதிவின் மதிப்பு என்றால் :math:`X` கேட் :math:`0`.
te: ఉదాహరణకు, క్లాసిక్ రిజిస్టర్ విలువ :math:`0` అయితే కింది కోడ్ :math:`X` గేట్‌ని అమలు చేస్తుంది.
tr: Örneğin, klasik kaydın değeri :math:`0` ise, aşağıdaki kod :math:`X` kapısını çalıştıracaktır.

source: We highlight that the method c_if expects as the first argument a whole classical register, not a single classical bit (or a list of classical bits), and as the second argument a value in decimal representation (a non-negative integer), not the value of a single bit, 0, or 1 (or a list/string of binary digits).
bn_bn: উল্লেখ্য: c_if পদ্ধতি কোনো একক ক্লাসিকাল বিট বা ক্লাসিকাল বিট এর লিস্টকে নয় বরং একটি সম্পূর্ণ ক্লাসিক্যাল রেজিস্টারকে প্রথম আর্গুমেন্ট হিসেবে বিবেচনা করে। এবং দ্বিতীয় আর্গুমেন্ট হিসেবে কোনো এক বিট, 0 বা 1, (অথবা লিস্ট বা বিটের তালিকা) নয় বরং (অঋণাত্মক পূর্ণসংখ্যার মত) ডেসিমাল রিপ্রেজেন্টেশনের একটা মান বিবেচনা করবে।
fr_fr: On remarquera que la méthode ``c_if`` attend comme premier argument un registre classique entier, et non pas un unique bit classique (ou une liste de bits classiques), tandis qu'elle s'attend à recevoir comme second argument une valeur en représentation décimale (un entier non négatif), et non pas la valeur d'un bit simple, 0, ou 1 (ni une liste/chaîne de bits).
ja_jp: 強調しておきたいことは、メソッド c_if がとる第1引数は、古典レジスタ全体であり、単一の古典ビット (または古典ビットのリスト) ではないことです。また第2引数は、十進数の値 (非負の整数) であり、単一ビットの 0、1の値 (または2進数のリスト/文字列) ではありません。
pt_un: Destacamos que o método c_if espera como o primeiro argumento todo um registro clássico, não um único bit clássico (ou uma lista de bits clássicos), e como o segundo argumento um valor na representação decimal (um inteiro não negativo), não o valor de um único bit, 0 ou 1 (ou uma lista / cadeia de dígitos binários).
ru_ru: Подчеркнем, что первым аргументом метода c_if является классический регистр в целом, а не одиночный бит (или их список); в качестве второго аргумента выступает десятичное число (неотрицательное целое), но не значение отдельного бита (в виде списка/строки бинарных чисел).
ta_in: C_if முறை முதல் கிளாசிக்கல் பதிவேடு, ஒரு கிளாசிக்கல் பிட் (அல்லது கிளாசிக்கல் பிட்களின் பட்டியல்) அல்ல, இரண்டாவது வாதமாக தசம பிரதிநிதித்துவத்தில் ஒரு மதிப்பு (எதிர்மறை அல்லாத முழு எண்) எதிர்பார்க்கிறது என்பதை நாங்கள் முன்னிலைப்படுத்துகிறோம். ஒற்றை பிட், 0, அல்லது 1 (அல்லது பைனரி இலக்கங்களின் பட்டியல் / சரம்) மதிப்பு.

source: Let’s make another example. Consider that we want to perform a bit flip on the third qubit after the measurements in the following circuit, when the results of the measurement of :math:`q_0` and :math:`q_1` are both :math:`1`.
bn_bn: চলুন আরেকটা উদাহরণ দেখা যাক। ধরুন, নিচের সার্কিট পরিমাপের পর যখন :math:`q_0` এবং :math:`q_1` উভয়ই :math:`1` , তখন তৃতীয় কিউবিটে বিট ফ্লিপ করতে হবে।
fr_fr: Prenons un autre exemple. Supposons que nous souhaitions réaliser un bit flip sur le troisième qubit après les mesures dans le circuit représenté ci-dessous lorsque les résultats de la mesure de :math:`q_0` et :math:`q_1` sont tous les deux :math:`1`.
ja_jp: 別の例を見てみましょう。次の回路の測定後、 :math:`q_0` と :math:`q_1` の測定結果が両方とも :math:`1` の時 3番目の量子ビットにビットフリップを実行したいとします。
ko: 다른 예제를 보자. 아래의 회로를 측정하여 :math:`q_0` 와 :math:`q_1` 의 측정 값이 모두 :math:`1` 일 때, 세 번째 큐비트를 비트 플립 (bit flip) 을 수행하는 경우를 생각해 본다.
pt_un: Vamos fazer outro exemplo. Considere que queremos executar um bit flip no terceiro qubit após as medições no circuito a seguir, quando os resultados da medição de :math:` q_0 ` e :math:` q_1 ` são ambos de :math:` 1 `.
ru_ru: Приведем другой пример. Допустим мы хотим выполнить операцию отрицания на третьем кубите, если измерение первых двух :math:`q_0` и :math:`q_1` дает :math:`1`.
ta_in: மற்றொரு உதாரணத்தை உருவாக்குவோம், பின்வரும் :math:`q_0` மற்றும் :math:`q_1` இரண்டும் :math:`1` என சுற்றுவட்டத்தின் அளவீடுகளுக்குப் பிறகு, மூன்றாவது குவிட்டில் ஒரு பிட் புரட்டலைச் செய்ய விரும்புகிறோம் என்பதைக் கவனியுங்கள்.

source: We want to apply the :math:`X` gate, only if both the results of the measurement of :math:`q_1` and :math:`q_2` are :math:`1`. We can do this using the c_if method, conditioning the application of :math:`X` depending on the value passed as argument to c_if.
bn_bn: যদি :math:`q_1` এবং :math:`q_2` এর মেজারমেন্টের ফলাফল :math:`1` হয়, তখন আমরা :math:`X` গেট ব্যবহার করব। এর জন্য আমরা c_if পদ্ধতি কাজে লাগাতে পারি, শর্ত হিসেবে :math:`X` প্রয়োগ হবে যা c_if এ পাঠানো আর্গুমেন্টের মানের উপর নির্ভরশীল।
fr_fr: Nous voulons alors appliquer la porte :math:`X' seulement si les deux résultats de la mesure de :math:`q_0` et :math:`q_1` sont :math:`1`. Nous pouvons le faire en utilisant la méthode ``c_if``, conditionnant l'application de :math:`X` selon la valeur transmise comme argument à ``c_if``.
pt_un: Queremos aplicar a porta :math:"X", apenas se ambos os resultados da medição de :math:` q_1 ` e de :math:` q_2 ` forem :math:` 1 `. Podemos fazer isso usando o método c_if, condicionando a aplicação de :math:` X ` dependendo do valor passado como argumento para c_if.
ru_ru: Другими словами мы применяем вентиль :math:`X`, только если результаты измерения и :math:`q_1`, и :math:`q_2` равны :math:`1`. Это можно сделать с помощью c_if, сделав запуск :math:`X` зависимым от передаваемых методу аргументов.
ta_in: :math:`q_1` மற்றும் :math:`q_2` :math:`1` என்ற அளவீட்டின் முடிவுகள் இரண்டுமே இருந்தால் மட்டுமே :math:`X` வாயிலைப் பயன்படுத்த விரும்புகிறோம். c_if முறையைப் பயன்படுத்தி இதை நாம் செய்யலாம்: கணிதத்தின் பயன்பாட்டை சீராக்குகிறது c_if க்கு வாதமாக அனுப்பப்பட்ட மதிப்பைப் பொறுத்து :math:`X`.

source: We will have to encode the value to pass to the c_if method such that it will check the values 011 and 111 (in binary representation), since it does not matter what is in the rightmost position.
bn_bn: আমাদের মান গুলো এনকোড করে c_if পদ্ধতিতে পাঠাতে হবে যাতে এটা ০১১ ও ১১১ (বাইনারি রিপ্রেজেন্টেশনের মধ্যে) পরীক্ষা করে, কারণ সবচেয়ে ডানদিকের সংখ্যা অর্থহীন।
fr_fr: Nous allons devoir encoder la valeur à passer à la méthode ``c_if`` pour qu'elle soit conditionnée par les valeurs 011 et 111 (en représentation binaire), puisque la valeur du bit le plus à gauche, à savoir celle de :math:`q_2`, n'importe pas.
ja_jp: c_if メソッドに渡す値はエンコードしなければなりません。右端の位置に何があるかには無関係のため、値 011 および 111 (バイナリ表現で) を使用します。
pt_un: Teremos que codificar o valor para passar para o método c_if tal que ele verificará os valores 011 e 111 (em representação binária), uma vez que não importa o que está na posição mais à direita.
ru_ru: В данном случае ими выступят значения классического регистра 011 и 111 (в двоичном представлении), так как крайний правый бит не представляет интереса по условиям задачи.
ta_in: C_if முறைக்கு அனுப்ப மதிப்பை நாம் குறியாக்கம் செய்ய வேண்டும், இது 011 மற்றும் 111 மதிப்புகளை (பைனரி பிரதிநிதித்துவத்தில்) சரிபார்க்கும், ஏனெனில் இது சரியான நிலையில் இருப்பதைப் பொருட்படுத்தாது.

source: The 2 integer values in decimal representation:
bn_bn: ডেসিমাল রিপ্রেজেন্টেশনে দুটি পূর্ণসংখ্যার মান:
fr_fr: On peut calculer les valeurs décimales de ces deux nombres binaires comme suit :
ja_jp: 2つの整数の10 進数表記は以下:
ko: 두 정숫값의 십진수 표현은 다음과 같다:
pt_un: Os 2 valores inteiros em representação decimal:
ru_ru: Переведем эти числа в десятичный вид:
ta_in: தசம பிரதிநிதித்துவத்தில் 2 முழு எண் மதிப்புகள்:
te: దశాంశ ప్రాతినిధ్యంలో 2 పూర్ణాంకాల విలువలు:
tr: Ondalık gösterimde 2 tam sayı değeri:

source: We can check the solutions using the bin() method in python (the prefix ``0b`` indicates the binary format).
bn_bn: পাইথনের bin() মেথড ব্যবহার করে আমরা সমাধানগুলোকে যাচাই করি (``0b`` উপসর্গটি বাইনারি ফরম্যাট বোঝায়)।
fr_fr: Il est possible de vérifier ces calculs en utilisant la fonction ``bin()`` de Python (le préfixe ``0b`` indique que le résultat est une chaîne binaire).
ja_jp: python の bin() メソッドを使って結果を確認することができます (prefix ``0b`` はバイナリフォーマットを示します)。
pt_un: Nós podemos verificar as soluções usando o método bin() em python (o prefixo ` ` 0b ` ` indica o formato binário).
ru_ru: Проверим ответ с помощью метода bin(), входящего в python (префикс ``0b`` обозначает бинарный формат).
ta_in: Python bin() முறையைப் பயன்படுத்தி தீர்வுகளை நாம் சரிபார்க்கலாம் (``0b`` முன்னொட்டு பைனரி வடிவமைப்பைக் குறிக்கிறது).

source: So we have to apply :math:`X` to :math:`q_2` using c_if two times, one for each value corresponding to 011 and 111.
bn_bn: সেজন্য আমরা দুইবার c_if ব্যবহার করে :math:`q_2` এর উপর 011 এবং 111 প্রত্যেক মানের জন্য একবার করে :math:`X` প্রয়োগ করবো।
fr_fr: Nous devons donc appliquer :math:`X` à :math:`q_2` en utilisant ``c_if`` deux fois, une pour chaque valeur correspondant à 011 et 111.
ja_jp: そのため、011と111 に対して :math:`X` を :math:`q_2` に c_if で 2 回適用しなければなりません。
pt_un: Por isso, temos que aplicar :math:` X ` a :math:` q_2 ` utilizando c_if duas vezes, uma para cada valor correspondente a 011 e 111.
ru_ru: Итак, нам нужно применить :math:`X` к :math:`q_2`, используя c_if для каждого из значений регистра 011 и 111 по очереди.
ta_in: எனவே நாம் விண்ணப்பிக்க வேண்டும் :math:`X`` முதல் :math:`q_2` இரண்டு முறை c_if பயன்படுத்துகிறது, 011 மற்றும் 111 உடன் தொடர்புடைய ஒவ்வொரு மதிப்புக்கும் ஒன்று.

source: The motivation for using the IPE algorithm is that QPE algorithm works fine for short depth circuits but when the circuit starts to grow, it doesn’t work properly due to gate noise and decoherence times.
bn_bn: কিউপিই ধারাক্রম (অ্যালোগরিদম) এর জায়গায় আইপিই ধারাক্রম (অ্যালোগরিদম) ব্যবহারের কারণ ছোট বর্তনীতে (সার্কিট) কিউপিই কাজ করলেও বড় বর্তনীতে (সার্কিট) গেট ত্রুটি ও অসমদশার (ডিকোহেরেন্স) জন্য ঠিকঠাক কাজ করে না।
fr_fr: Ce qui motive l'utilisation de l'algorithme IPE, c'est que si l'algorithme QPE fonctionne bien pour des circuits de faible profondeur, ce n'est plus le cas lorsque ces circuits grandissent, ce à cause du bruit inhérent à l'application de portes et au temps de décohérence.
ja_jp: IPE アルゴリズムを使用する動機は QPE アルゴリズムが、短い回路ではうまく動作するが、大きくなるとゲートノイズやデコヒーレンス時間のためにちゃんと動作しなくなることです。
ko: IPE 알고리즘을 사용하는 동기는 QPE 알고리즘이 짧은 회로에는 잘 동작하나 회로가 커지기 시작하면서 게이트 잡음과 결깨짐 시간 때문에 올바르게 동작하지 않는데 있다.
pt_un: A motivação para usar o algoritmo do IPE é que o algoritmo QPE funciona bem para circuitos de profundidade curtos mas quando o circuito começa a crescer, ele não funciona adequadamente devido aos tempos de ruído e decoerência da porta.
ru_ru: Мотивацией для использования алгоритма IPE является то, что алгоритм QPE отлично работает для схем малой глубины, но когда цепь начинает расти, он не работает должным образом из-за ошибок в квантовых вентилях и времени декогеренции.
ta_in: IPE வழிமுறையைப் பயன்படுத்துவதற்கான உந்துதல் என்னவென்றால், குறுகிய ஆழம் சுற்றுகளுக்கு QPE வழிமுறை நன்றாக வேலை செய்கிறது, ஆனால் சுற்று வளரத் தொடங்கும் போது, கேட் சத்தம் மற்றும் டிகோஹரன்ஸ் நேரங்கள் காரணமாக அது சரியாக வேலை செய்யாது.
