Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/09_IQPE.po
Languages: bn_bn, fr_fr, ja_jp, ko, pt_un, ru_ru, ta_in, te, tr

source: We apply the :math:`CU` operations as we did in the first step. For the second step we have :math:`t=m-2`, hence :math:`2^t=2`. So we apply :math:`\text{MCP}(\pi/4)` :math:`2` times. And then we perform the x-measurement of the qubit :math:`q_0`, storing the phase bit :math:`\varphi_2` in the bit :math:`c_1`.
bn_bn: প্রথম ধাপের মতো আমরা :math:`CU` ক্রিয়াকলাপ (অপারেশন) করব। দ্বিতীয় ধাপে আমরা জানি :math:`t=m-2` যা থেকে পাওয়া যায় :math:`2^t=2`। সেজন্য আমরা :math:`2` বার :math:`\text{MCP}(\pi/4)` প্রয়োগ করবো এবং :math:`q_0` কিউবিটের x-পরিমাপ করবো ও :math:`\varphi_2` দশা বিটের মান :math:`c_1` বিটে সঞ্চয় করবো।
fr_fr: Nous appliquons alors les portes :math:"CU" comme nous l'avons fait lors de la première étape. Pour la deuxième étape, nous avons :math:`t=m-2`, donc :math:`2^t=2`. Nous appliquons donc :math:`\text{MCP}\left(\frac{\pi}{4}\right)` deux fois. Ensuite, nous réalisons la mesure dans la base :math:`X` du qubit :math:`q_0`, stockant le résultat, à savoir le bit de phase :math:`\varphi_2`, dans le bit :math:`c_1` du registre classique.
ja_jp: :math:`CU` 演算子を最初のステップでやったように適用します。第２ステップでは :math:`t=m-2` のため :math:`2^t=2` です。そのため、 :math:`\text{MCP}(\pi/2)` を :math:`2` 回適用します。そして量子ビット :math:`q_0` の X基底測定をして、位相ビット :math:`\varphi_2` を古典レジスター :math:`c_1` に格納します。
pt_un: Nós aplicamos as operações :math:`CU` como no primeiro passo. Já no segundo passo, temos :math:`t=m-2`, de modo que :math:`2^t=2`. Então aplicamos :math:`\text{MCP}(\pi/4)` :math:`2` vezes. E então realizamos a medida em x do qubit :math:`q_0`, guardando o bit de fase :math:`\varphi_2` no bit :math:`c_1`.
ru_ru: Применим оператор :math:`CU` так же, как и в первой итерации. Однако теперь :math:`t=m-2`, значит :math:`2^t=2`. Поэтому :math:`\text{MCP}(\pi/4)` используется дважды. Далее измеряем в x-базисе кубит :math:`q_0`, записывая часть информации о фазе :math:`\varphi_2` в бит :math:`c_1`.

source: All substeps of the 3rd step
bn_bn: তৃতীয় ধাপের সব আংশিক ধাপ
fr_fr: Les sous-étapes de la troisième étape
ja_jp: 第３ステップの全てのサブステップ
ko: 3단계의 모든 하위 단계
pt_un: Todos os sub-passos do terceiro passo
ru_ru: Этапы третьей итерации
ta_in: 3 வது படியின் அனைத்து மாற்றுகளும்
te: 3వ దశ యొక్క అన్ని ఉప దశలు
tr: 3. adımın tüm alt adımları

source: For the 3rd and last step, we perform the reset and initialization of the auxiliary qubit as done in the second step.
bn_bn: ৩য় এবং শেষ ধাপের জন্য আমরা ২য় ধাপের মতো করে সহায়ক কিউবিট পুনঃস্থাপন (রিসেট) এবং আরম্ভ করব।
fr_fr: Pour la troisième et dernière étape, nous effectuons la réinitialisation et l'initialisation du qubit auxiliaire, comme nous l'avons fait lors de la deuxième étape.
ja_jp: 第３と最後のステップでは、補助量子ビットのリセットと初期化を、第２ステップと同じようにします。
ko: 세 번째 및 마지막 단계에서는 두 번째 단계와 같이 보조 큐비트의 재설정 및 초기화를 수행한다.
pt_un: Para o terceiro e último passo, realizamos o reset e a inicialização do qubit auxiliar como feito no segundo passo.
ru_ru: Третья и последняя итерация начинается, как и ранее, со сброса и инициализации служебного кубита.
ta_in: 3 வது மற்றும் கடைசி கட்டத்திற்கு, இரண்டாவது கட்டத்தில் செய்ததைப் போல துணை குவிட்டின் மீட்டமைப்பு மற்றும் துவக்கத்தை நாங்கள் செய்கிறோம்.
te: 3వ మరియు చివరి దశ కోసం, మేము రెండవ దశలో చేసినట్లుగా సహాయక క్విట్‌ని రీసెట్ చేయడం మరియు ప్రారంభించడం చేస్తాము.
tr: 3. ve son adım için ikinci adımda yaptığımız gibi yardımcı kübitin resetlenmesi ve başlatılmasını gerçekleştiriyoruz.

source: Then at the 3rd step we have to perform the phase correction of :math:`-2\pi 0.0\varphi_{2}\varphi_{3}= -2\pi \left(\frac{\varphi_2}{4}+\frac{\varphi_3}{8}\right)=-\frac{\varphi_2\pi}{2}-\frac{ \varphi_3\pi}{4}`, thus we have to apply 2 conditioned phase corrections, one conditioned by :math:`\varphi_3` (:math:`=c_0`) and the other by :math:`\varphi_2`\ (:math:`=c_1`). To do this we have to apply the following: - gate :math:`P(-\pi/4)` conditioned by :math:`c_0=1`, that is, by :math:`c=001` (c_if with value 1) - gate :math:`P(-\pi/2)` conditioned by :math:`c_1=1`, that is, the gate is applied when :math:`c=010` (c_if with values :math:`2`) - gate :math:`P(-3\pi/4)` conditioned by :math:`c_1=1` and :math:`c_0=1` that is, the gate is applied when :math:`c=011` (c_if with values :math:`3`)
bn_bn: তৃতীয় ধাপে :math:`-2\pi 0.0\varphi_{2}\varphi_{3}= -2\pi \left(\frac{\varphi_2}{4}+\frac{\varphi_3}{8}\right)=-\frac{\varphi_2\pi}{2}-\frac{ \varphi_3\pi}{4}` -এর দশা সংশোধন করতে হবে। এভাবে আমাদের দুটো শর্তাধীন দশা সংশোধন করতে হবে, একটা :math:`\varphi_3` (:math:`=c_0`) শর্তে এবং অন্যটা :math:`\varphi_2`\ (:math:`=c_1`)। এর জন্য করণীয় হলো:- gate :math:`P(-\pi/4)` conditioned by :math:`c_0=1`, that is, by :math:`c=001` (c_if with value 1) - gate :math:`P(-\pi/2)` conditioned by :math:`c_1=1`, that is, the gate is applied when :math:`c=010` (c_if with values :math:`2`) - gate :math:`P(-3\pi/4)` conditioned by :math:`c_1=1` and :math:`c_0=1` that is, the gate is applied when :math:`c=011` (c_if with values :math:`3`)
fr_fr: Puis à la 3ème étape, nous devons effectuer la correction de phase de :math:`-2\pi 0, 0\varphi_{2}\varphi_{3}= -2\pi \left(\frac{\varphi_2}{4}+\frac{\varphi_3}{8}\right)=-\frac{\varphi_2\pi}{2}-\frac{\varphi_3\pi}{4}`. De fait, nous devons appliquer 2 corrections de phase conditionnées, l'une conditionné par :math:`\varphi_3` (:math:`=c_0`) et l'autre par :math:`\varphi_2`\ (:math:`=c_1`). Pour cela, nous devons appliquer : - une porte :math:`\text{P}\left(-\frac{\pi}{4}\right)` conditionnée par :math:`c_0=1`, c'est-à-dire par :math:`c=001` (``c_if`` avec la valeur 1) - une porte :math:`\text{P}\left(-\frac{\pi}{2}\right)` conditionnée par :math:`c_1=1`, c'est-à-dire par :math:`c=010` (``c_if`` avec la valeur :math:`2`) - une porte :math:`\text{P}\left(-\frac{3\pi}{4}\right)` conditionnée par :math:`c_1=1` et :math:`c_0=1` c'est-à-dire par :math:`c=011` (``c_if`` avec la valeur :math:`3`)
ja_jp: 第3のステップでは、 :math:`-2\pi 0.0\varphi_{2}\varphi_{3}= -2\pi \left(\frac{\varphi_2}{4}+\frac{\varphi_3}{8}\right)=-\frac{\varphi_2\pi}{2}-\frac{ \varphi_3\pi}{4}` の位相補正を行う必要があります。これには２つの条件付き位相補正が必要です。一つは :math:`\varphi_3` (:math:`=c_0`) 、もう一つは :math:`\varphi_2`\ (:math:`=c_1`) による条件です。これを行うには次のように適用する必要があります。 :math:`c_0=1` による条件付きゲート :math:`P(-\pi/4)` すなわち :math:`c=001` (値 1 の c_if) による条件、 :math:`c_1=1` による条件付きゲート :math:`P(-\pi/2)` すなわち :math:`c=010` (値 :math:`2` の c_if) の時ゲートが適用、 :math:`c_1=1` と :math:`c_0=1` での条件付きゲート :math:`P(-3\pi/4)` すなわち :math:`c=011` (値 :math:`3` の c_if) の時ゲートが適用されるようにします。
pt_un: Então, no terceiro passo, realizamos uma correção de fase de :math:`-2\pi 0.0\varphi_{2}\varphi_{3}= -2\pi \left(\frac{\varphi_2}{4}+\frac{\varphi_3}{8}\right)=-\frac{\varphi_2\pi}{2}-\frac{ \varphi_3\pi}{4}`, então precisamos aplicar 2 correções de fase condicionadas, uma por :math:`\varphi_3` (:math:`=c_0`) e a outra por :math:`\varphi_2`\ (:math:`=c_1`). Para fazer isso, precisamos aplicar a seguinte: - porta :math:`P(-\pi/4)` condicionada por :math:`c_0=1`, ou seja, por :math:`c=001` (c_if com valor 1) - porta :math:`P(-\pi/2)` condicionada por :math:`c_1=1`, isto é, a porta é aplicada quando :math:`c=010` (c_if com valores :math:`2`) - porta :math:`P(-3\pi/4)` condicionada por :math:`c_1=1` e :math:`c_0=1` ou seja, a porta é aplicada quando :math:`c=011` (c_if com valores :math:`3`)
ru_ru: Затем выполняем поправку фазы :math:`-2\pi 0.0\varphi_{2}\varphi_{3}= -2\pi \left(\frac{\varphi_2}{4}+\frac{\varphi_3}{8}\right)=-\frac{\varphi_2\pi}{2}-\frac{ \varphi_3\pi}{4}` в два этапа, один из которых обусловлен :math:`\varphi_3` (:math:`=c_0`), а другой соответствует :math:`\varphi_2`\ (:math:`=c_1`). Для этого используем: - гейт :math:`P(-\pi/4)` при :math:`c_0=1`, то есть :math:`c=001` (c_if с аргументом 1) - gate :math:`P(-\pi/2)` при :math:`c_1=1`, то есть :math:`c=010` (c_if с аргументом :math:`2`) - gate :math:`P(-3\pi/4)` при :math:`c_1=1` и :math:`c_0=1` то есть :math:`c=011` (c_if с аргументом :math:`3`)

source: Next, the :math:`CU` operations: we apply :math:`2^t` times the :math:`\text{MCP}(\pi/4)` gate and since at the 3rd step :math:`t=m-3=0`, we apply the gate only once.
bn_bn: এরপর, :math:`CU` ক্রিয়াকলাপ (অপারেশন): আমরা :math:`2^t` বার :math:`\text{MCP}(\pi/4)` গেট প্রয়োগ করব এবং যেহেতু ৩য় ধাপে :math:`t=m-3=0`, আমরা গেটটা একবার প্রয়োগ করতে পারবো।
fr_fr: Ensuite, pour ce qui est des portes :math:`CU`, nous appliquons :math:`2^t` fois la porte :math:`\text{MCP}\left(\frac{\pi}{4}\right)`et puisque à la troisième étape :math:` t=m-3 = 0`, nous n'appliquons cette porte qu'une seule fois.
ja_jp: 次に、 :math:`CU` 演算: :math:`\text{MCP}(\pi/4)` ゲートを :math:`2^t` 回適用します。第3のステップでは :math:`t=m-3=0` のため、ゲートを適用するのは一度だけです。
ko: 다음으로 :math:`CU` 연산자: :math:`\text{MCP}(\pi/4)`게이트에 :math:`2^t` 번 적용하고 3단계 :math:`t=m-3=0` 에서는 게이트를 한 번만 적용한다.
pt_un: Em seguida, as operações :math:`CU`: aplicamos :math:`2^t` vezes a porta :math:`\text{MCP}(\pi/4)` e desde o terceiro passo :math:`t=m-3=0`, nós aplicamos a porta apenas uma vez.
ru_ru: Далее следует непосредственное применение :math:`2^t` раз оператора :math:`CU`, для третьей итерации :math:`t=m-3=0`, поэтому гейт :math:`\text{MCP}(\pi/4)` использован однократно.
ta_in: அடுத்து, :math:`CU` செயல்பாடுகள்: நாங்கள் விண்ணப்பிக்கிறோம் :math:`2^t` மடங்கு :math:`\text{MCP}(\pi/4)` கேட் மற்றும் 3 வது கட்டத்தில் இருந்து :math:`t=m-3=0` , நாங்கள் ஒரு முறை மட்டுமே கேட்டைப் பயன்படுத்துகிறோம்.
te: తర్వాత, :math:`CU` కార్యకలాపాలు: మేము :math:`2^t` సార్లు :math:`\text{MCP}(\pi/4)` గేట్ మరియు 3వ దశలో వర్తిస్తాము :math:` t=m-3=0`, మేము గేట్‌ను ఒకసారి మాత్రమే వర్తింపజేస్తాము.
tr: Sonra, :math:`CU` işlemleri: :math:`2^t` çarpı :math:`\text{MCP}(\pi/4)` geçitini uygularız ve 3. adımdan itibaren :math:` t=m-3=0`, geçidi sadece bir kez uyguluyoruz.

source: Now, we execute the circuit with the simulator without noise.
bn_bn: এবার আমরা ত্রুটি ছাড়া বর্তনীটা (সার্কিট) সিমুলেটরে চালাবো।
fr_fr: Nous exécutons ensuite ce circuit avec le simulateur sans bruit.
ja_jp: では、ノイズのないシミュレータで回路を実行します。
ko: 이제 잡음 없이 시뮬레이터로 회로를 실행한다.
pt_un: Agora, executamos o circuito com o simulador sem ruído.
ru_ru: Теперь мы запустим цепь на симуляторе без шума.
ta_in: இப்போது, சத்தம் இல்லாமல் சிமுலேட்டருடன் சுற்று இயக்குகிறோம்.
te: ఇప్పుడు, మేము శబ్దం లేకుండా సిమ్యులేటర్‌తో సర్క్యూట్‌ను అమలు చేస్తాము.
tr: Şimdi, devreyi simülatörle gürültüsüz olarak çalıştırıyoruz.

source: We have obtained :math:`100\%` probability to find :math:`\varphi=0.125`, that is, :math:`1/8`, as expected.
bn_bn: আমরা অনুমানমতো :math:`\varphi=0.125` (বা :math:`1/8`) পাওয়ার সম্ভাবনা :math:`100\%` পেয়েছি।
fr_fr: Nous avons obtenu :math:`100\%` probabilité de trouver :math:`\varphi=0.125`, c'est-à-dire :math:`1/8`, comme nous nous y attendions.
ja_jp: :math:`100\%` の確率で :math:`\varphi=0.125` 、つまり期待通り :math:`1/8` を取得することができました。
ko: 예상대로 :math:`\varphi=0.125`, 즉 :math:`1/8` 를 찾을 수 있는 :math:`100\%` 확률을 얻었다.
pt_un: Nós obtivemos probabilidade :math:`100\%` de encontrar :math:`\varphi=0.125`, isto é, :math:`1/8`, como esperado.
ru_ru: Как и ожидалось, получаем :math:`100\%` вероятность значения :math:`\varphi=0.125` или :math:`1/8`.
ta_in: நாங்கள் பெற்றுள்ளோம் :math:`100\%` கண்டுபிடிக்க நிகழ்தகவு :math:`\varphi=0.125`, அதாவது, :math:`1/8`, எதிர்பார்த்தபடி.
te: మేము ఊహించిన విధంగా :math:`100\%` సంభావ్యతను పొందాము :math:`\varphi=0.125`, అంటే :math:`1/8`.
tr: Beklendiği gibi :math:`\varphi=0.125` yani :math:`1/8` bulmak için :math:`100\%` olasılığını elde ettik.

source: We want to apply the :math:`X` gate, only if both the results of the measurement of :math:`q_0` and :math:`q_1` are :math:`1`. We can do this using the c_if method, conditioning the application of :math:`X` depending on the value passed as argument to c_if.
ja_jp: :math:`q_0` と :math:`q_1` の測定結果が両方とも :math:`1` である場合にのみ、 :math:`X` ゲートを適用します。 これは、c_ifメソッドを使用して、c_ifに引数として渡された値に応じて :math:`X` のアプリケーションを条件付けて行うことができます。

source: Now, we want to apply the IPE algorithm to estimate the phase for a 2-qubit gate :math:`U`. For this example, let’s consider the controlled version of the :math:`T` gate, i.e. the gate :math:`U=\textrm{Controlled-}T` (that from now we will express more compactly with :math:`CT`). Its matrix is
ja_jp: さて、IPE アルゴリズムを 2 量子ビットゲート :math:`U` を位相推定するために適用してみたいと思います。この例では、 :math:`T` ゲートの制御バージョン :math:`U=\textrm{Controlled-}T` を考えましょう (以降簡潔に :math:`CT` と表現します)。その行列は以下のようになります。
ko: 이제 IPE 알고리즘을 적용하여 2-큐비트 게이트 :math:`U` 의 위상을 추정하고자 한다. 이 예시 에서는 :math:`T` 게이트의 제어된 버전인 :math:`U=\textrm{Controlled-}T` (지금부터는 더 정확하게 :math:`CT` 로 표현)를 살펴보겠다. 이 행렬은 다음과 같다.

source: Conditioned gates: the ``c_if`` method
ko: 조건부 게이트: ``c_if`` 메서드
te: కండిషన్డ్ గేట్లు: ``c_if`` పద్ధతి
tr: Koşullandırılmış kapılar: ``c_if`` metodu

source: Before starting the IPE algorithm, we will give a brief tutorial about the Qiskit conditional method, ``c_if``, as it goes into building the IPE circuit.
ko: IPE 알고리즘을 시작하기 전에, IPE 회로를 만들어 내는 Qiskit 조건부 메서드 ``c_if`` 에 관한 간단한 튜토리얼을 제공할 것이다.
te: IPE అల్గారిథమ్‌ను ప్రారంభించే ముందు, మేము Qiskit షరతులతో కూడిన పద్ధతి గురించి క్లుప్త ట్యుటోరియల్ ఇస్తాము, ఇది IPE సర్క్యూట్‌ను రూపొందించడానికి వెళుతున్నందున, ``c_if``.
tr: IPE algoritmasına başlamadan önce, IPE devresini kurarken Qiskit koşullu metodu ``c_if`` hakkında kısa bir eğitim vereceğiz.

source: We highlight that the method ``c_if`` expects as the first argument a whole classical register, not a single classical bit (or a list of classical bits), and as the second argument a value in decimal representation (a non-negative integer), not the value of a single bit, 0, or 1 (or a list/string of binary digits).
ko: 강조할만한 것은 메서드 ``c_if`` 는 하나의 고전 비트 (또는 고전 비트의 리스트) 가 아닌, 전체 고전 레지스터를 첫 번째 인수로 가지고, 하나의 비트값 0 또는 1 (또는 이진수 리스트/문자열) 이 아닌 (음수가 아닌) 십진수 표현 값을 두 번째 인수로 가질 것으로 기대한다는 것이다.
te: ``c_if`` పద్ధతి మొదటి ఆర్గ్యుమెంట్‌గా ఒక క్లాసికల్ బిట్ (లేదా క్లాసికల్ బిట్‌ల జాబితా) కాదు, మరియు రెండవ ఆర్గ్యుమెంట్‌గా దశాంశ ప్రాతినిధ్యంలో విలువ (ప్రతికూల రహిత పూర్ణాంకం) అని హైలైట్ చేస్తుంది, ఒక బిట్, 0 లేదా 1 (లేదా బైనరీ అంకెల జాబితా/స్ట్రింగ్) విలువ కాదు.
tr: ``c_if`` metodunun ilk argüman olarak tek bir klasik bit (veya bir klasik bit listesi) değil, bütün bir klasik yazmaç beklediğini ve ikinci argüman olarak ondalık gösterimde bir değer (negatif olmayan bir tam sayı) beklediğini vurguluyoruz. tek bir bitin değeri, 0 veya 1 (veya ikili rakamlar listesi/dizisi).

source: Let's make another example. Consider that we want to perform a bit flip on the third qubit after the measurements in the following circuit, when the results of the measurement of :math:`q_0` and :math:`q_1` are both :math:`1`.
te: మరొక ఉదాహరణ చేద్దాం. :math:`q_0` మరియు :math:`q_1` యొక్క కొలత ఫలితాలు రెండూ :math:`1` అయినప్పుడు, కింది సర్క్యూట్‌లోని కొలతల తర్వాత మేము మూడవ క్విట్‌పై బిట్ ఫ్లిప్ చేయాలనుకుంటున్నామని పరిగణించండి.

source: We want to apply the :math:`X` gate, only if both the results of the measurement of :math:`q_0` and :math:`q_1` are :math:`1`. We can do this using the ``c_if`` method, conditioning the application of :math:`X` depending on the value passed as argument to ``c_if``.
ko: :math:`q_0` 와 :math:`q_1`의 측정값이 모두 :math:`1` 인 경우에만 :math:`X` 게이트를 적용할 것이다. 이것은 ``c_if`` 메서드를 이용하여 ``c_if`` 에 전달되는 인자 값에 따라 조건부로 :math:`X` 를 적용하도록 할 수 있다.
te: :math:`q_0` మరియు :math:`q_1` యొక్క కొలత ఫలితాలు రెండూ :math:`1` అయితే మాత్రమే మేము :math:`X` గేట్‌ని వర్తింపజేయాలనుకుంటున్నాము. ఆర్గ్యుమెంట్‌గా ``c_if``కి పంపబడిన విలువపై ఆధారపడి :math:`X` అనువర్తనాన్ని కండిషన్ చేస్తూ, ``c_if`` పద్ధతిని ఉపయోగించి మనం దీన్ని చేయవచ్చు.
tr: Yalnızca :math:`q_0` ve :math:`q_1` ölçümünün sonuçları :math:`1` ise :math:`X` kapısını uygulamak istiyoruz. Bunu ``c_if`` metodunu kullanarak, ``c_if``'e bağımsız değişken olarak iletilen değere bağlı olarak :math:`X` uygulamasını koşullandırarak yapabiliriz.

source: We will have to encode the value to pass to the ``c_if`` method such that it will check the values 011 and 111 (in binary representation), since it does not matter what :math:`q_2` is measured as.
ko: :math:`q_2` 가 무엇으로 측정되는지는 중요하지 않기 때문에 (이진 표현에서) 011 및 111의 값을 확인하도록 ``c_if`` 메서드에 전달될 값을 암호화해야 한다.
te: మనం ``c_if`` పద్ధతికి పాస్ చేయడానికి విలువను ఎన్‌కోడ్ చేయాలి, అంటే అది 011 మరియు 111 (బైనరీ ప్రాతినిధ్యంలో) విలువలను తనిఖీ చేస్తుంది, ఎందుకంటే ఇది :math:`q_2`ని ఏ విధంగా కొలిచినప్పటికీ అది పట్టింపు లేదు.
tr: ``c_if`` metoduna geçirmek için değeri 011 ve 111 değerlerini (ikili gösterimde) kontrol edecek şekilde kodlamamız gerekecek, çünkü :math:`q_2`'nin ne ölçüldüğü önemli değil.

source: We can check the solutions using the ``bin()`` method in python (the prefix ``0b`` indicates the binary format).
ko: Python의 ``bin()`` 메서드를 통해 답을 확인할 수 있다 (접두어 ``0b`` 는 이진수 형식을 나타낸다).
te: పైథాన్‌లోని ``బిన్()`` పద్ధతిని ఉపయోగించి మనం పరిష్కారాలను తనిఖీ చేయవచ్చు (``0b`` ఉపసర్గ బైనరీ ఆకృతిని సూచిస్తుంది).
tr: Python'da ``bin()`` metodunu kullanarak çözümleri kontrol edebiliriz ( ``0b`` ön takısı ikili formatı belirtir).

source: So we have to apply :math:`X` to :math:`q_2` using ``c_if`` two times, one for each value corresponding to 011 and 111.
te: కాబట్టి మనం 011 మరియు 111కి సంబంధించిన ప్రతి విలువకు ఒకటి చొప్పున ``c_if``ని రెండుసార్లు ఉపయోగించి :math:`X` నుండి :math:`q_2`ని వర్తింపజేయాలి.
tr: Bu yüzden :math:`X` ile :math:`q_2` arasında ``c_if`` kullanarak 011 ve 111'e karşılık gelen her değer için bir tane olmak üzere iki kez uygulamamız gerekir.

source: The motivation for using the IPE algorithm is that QPE algorithm works fine for short depth circuits but when the circuit starts to grow, it doesn't work properly due to gate noise and decoherence times.
te: IPE అల్గారిథమ్‌ను ఉపయోగించడం కోసం ప్రేరణ ఏమిటంటే, QPE అల్గోరిథం షార్ట్ డెప్త్ సర్క్యూట్‌లకు బాగా పని చేస్తుంది, అయితే సర్క్యూట్ పెరగడం ప్రారంభించినప్పుడు, గేట్ శబ్దం మరియు డీకోహెరెన్స్ సమయాల కారణంగా ఇది సరిగ్గా పని చేయదు.

source: Let's apply the IPE algorithm to estimate the phase for :math:`S`-gate. Its matrix is
te: :math:`S`-gate కోసం దశను అంచనా వేయడానికి IPE అల్గారిథమ్‌ని వర్తింపజేద్దాం. దీని మాతృక

source: Let's consider to estimate the phase :math:`\phi=\frac{\pi}{2}` for the eigenstate :math:`|1\rangle`, we should find :math:`\varphi=\frac{1}{4}` (where :math:`\phi = 2 \pi \varphi`). Therefore to estimate the phase we need exactly 2 phase bits, i.e. :math:`m=2`, since :math:`1/2^2=1/4`. So :math:`\varphi=0.\varphi_1\varphi_2`.
te: ఈజెన్‌స్టేట్ :math:`|1\rangle` కోసం దశ :math:`\phi=\frac{\pi}{2}`ని అంచనా వేయడానికి పరిశీలిద్దాం, మనం కనుగొనాలి :math:`\varphi=\frac{1}{4}` (ఎక్కడ :math:`\phi = 2 \pi \varphi`). కాబట్టి దశను అంచనా వేయడానికి మనకు ఖచ్చితంగా 2 దశ బిట్‌లు అవసరం, అనగా :math:`m=2`, నుండి :math:`1/2^2=1/4`. కాబట్టి :math:`\varphi=0.\varphi_1\varphi_2`.

source: Now we build the quantum circuit for the first step, that is, the first iteration of the algorithm, to estimate the least significant phase bit :math:`\varphi_m`, in this case :math:`\varphi_2`. For the first step we have 3 sub-steps: - initialization - application of the Controlled-:math:`U` gates - measure of the auxiliary qubit in X-basis
te: ఇప్పుడు మనం మొదటి దశ కోసం క్వాంటం సర్క్యూట్‌ను నిర్మిస్తాము, అంటే అల్గోరిథం యొక్క మొదటి పునరావృతం, ఈ సందర్భంలో :math:`\varphi_2` అతి తక్కువ ముఖ్యమైన దశ బిట్:math:`\varphi_m`ని అంచనా వేయడానికి. మొదటి దశ కోసం మనకు 3 ఉప-దశలు ఉన్నాయి: - ప్రారంభించడం - నియంత్రిత-:math:`U` గేట్ల అప్లికేషన్ - X-బేసిస్‌లో సహాయక క్విట్ యొక్క కొలత
tr: Şimdi, en az anlamlı faz bitini :math:`\varphi_m` tahmin etmek için ilk adım, yani algoritmanın ilk yinelemesi için kuantum devresini oluşturuyoruz, bu durumda :math:`\varphi_2`. İlk adım için 3 alt adımımız var: - başlatma - Kontrollü-:math:`U` kapılarının uygulanması - X-bazında yardımcı kübitin ölçümü

source: Application of the Controlled-:math:`U` gates
ko: Controlled-:math:`U` 게이트의 적용
te: నియంత్రిత-:math:`U` గేట్ల అప్లికేషన్
tr: Kontrollü-:math:`U` kapılarının uygulanması

source: Then we have to apply :math:`2^t` times the Controlled-:math:`U` operators (see also in the docs `Two qubit gates <https://qiskit.org/documentation/tutorials/circuits/3_summary_of_quantum_operations.html#Two-qubit-gates>`__), that, in this example, is the Controlled-:math:`S` gate (:math:`CS` for short).
ko: 그러면 Controlled-:math:`U` 연산자들을 :math:`2^t` 번 적용해야 한다 (문서 `두 큐비트 게이트 <https://qiskit.org/documentation/tutorials/circuits/3_summary_of_quantum_operations.html#Two-qubit-gates>`__ 를 참조하라). 여기서는 Controlled-:math:`S` 게이트 (줄여서 :math:`CS`) 를 적용한다.
te: అప్పుడు మనం :math:`2^t` రెట్లు నియంత్రించబడిన-:math:`U` ఆపరేటర్‌లను వర్తింపజేయాలి (డాక్స్ `రెండు క్విట్ గేట్‌లు <https://qiskit.org/documentation/tutorials/circuits/3_summary_of_quantum_operations.html#Two-qubit-gates>`__), లో కూడా చూడండి అంటే, ఈ ఉదాహరణలో, కంట్రోల్డ్-:math:`S` గేట్ (:math:`CS` సంక్షిప్తంగా).
tr: Bundan sonra biz :math:`2^t` kez kontrollü-:math:`U` operatörü uygulamalıyız (`İki kübitlik kapılar <https://qiskit.org/documentation/tutorials/circuits/3_summary_of_quantum_operations.html#Two-qubit-gates>`__ ayrıca bu belgelere bakın), bu örnekte, kontrollü-:math:`S` (kısaca :math:`CS`) kapısıdır.

source: Let's apply :math:`2^t` times :math:`\text{CP}(\pi/2)`. Since for the first step :math:`t=m-1`, and :math:`m=2`, we have :math:`2^t=2`.
te: దరఖాస్తు చేద్దాం :math:`2^t` సార్లు :math:`\text{CP}(\pi/2)`. మొదటి దశ కోసం :math:`t=m-1`, మరియు :math:`m=2`, మేము :math:`2^t=2`ని కలిగి ఉన్నాము.

source: Measure in X-basis
te: X- ఆధారంగా కొలత
tr: X-Bazında Ölçüm

source: Finally, we perform the measurement of the auxiliary qubit in X-basis. So we will define a function to perform the ``x_measurement`` and then apply it.
te: చివరగా, మేము X- బేసిస్‌లో సహాయక క్విట్ యొక్క కొలతను చేస్తాము. కాబట్టి మేము ``x_measurement``ని నిర్వహించడానికి ఒక ఫంక్షన్‌ని నిర్వచించి, ఆపై దానిని వర్తింపజేస్తాము.
tr: Son olarak, X-bazında yardımcı kübitin ölçümünü gerçekleştiriyoruz. Yani ``x_measurement`` gerçekleştirecek bir fonksiyon tanımlayacak ve sonra onu uygulayacağız.

source: Now we build the quantum circuit for the other remaining steps, in this example, only the second one. In these steps we have 4 sub-steps: the 3 sub-steps as in the first step and, in the middle, the additional step of the phase correction - initialization with reset - phase correction - application of the Control-:math:`U` gates - measure of the auxiliary qubit in X-basis
te: ఇప్పుడు మనం మిగిలిన మిగిలిన దశల కోసం క్వాంటం సర్క్యూట్‌ను నిర్మిస్తాము, ఈ ఉదాహరణలో, రెండవది మాత్రమే. ఈ దశల్లో మనకు 4 ఉప-దశలు ఉన్నాయి: మొదటి దశలో వలె 3 ఉప-దశలు మరియు మధ్యలో, దశ దిద్దుబాటు యొక్క అదనపు దశ - రీసెట్‌తో ప్రారంభించడం - దశ సవరణ - నియంత్రణ యొక్క అప్లికేషన్-:math:` U` గేట్‌లు - ఎక్స్-బేసిస్‌లో సహాయక క్విట్ యొక్క కొలత
tr: Şimdi kalan diğer adımlar için kuantum devresini oluşturuyoruz, bu örnek sadece ikincisi için. Bu adımlarda 4 alt adımımız var: ilk adımdaki gibi 3 alt adım ve ortada, faz düzeltmenin ek adımı - sıfırlama ile başlatma - faz düzeltme - Kontrollü-:math:`U` kapılarının uygulanması - X-bazında yardımcı kübitin ölçümü

source: As we want to perform an iterative algorithm in the same circuit, we need to reset the auxiliary qubit :math:`q_0` after the measument gate and initialize it again as before to recycle the qubit.
te: మేము అదే సర్క్యూట్‌లో పునరుక్తి అల్గారిథమ్‌ను అమలు చేయాలనుకుంటున్నందున, మేము సహాయక క్విట్‌ని రీసెట్ చేయాలి :math:`q_0` కొలత గేట్ తర్వాత మరియు క్విట్‌ను రీసైకిల్ చేయడానికి మునుపటిలా మళ్లీ ప్రారంభించాలి.
tr: Aynı devrede yinelemeli bir algoritma gerçekleştirmek istediğimiz için, yardımcı kübiti :math:`q_0` ölçüm kapısından sonra sıfırlamamız ve kübiti geri dönüştürmek için eskisi gibi yeniden başlatmamız gerekiyor.
