Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/09_textbook_algorithms.po
Languages: es_un, fr_fr, id_id, ja_jp, ko_kr, pt_br, ta_in, vi_vn

source: `Shor’s Factoring algorithm <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Shor.html>`__ is one of the most well-known quantum algorithms and finds the prime factors for input integer :math:`N` in polynomial time. The algorithm implementation in Qiskit is simply provided a target integer to be factored and run, as follows:
es_un: El `Algoritmo de Factorización de Shor <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Shor.html>`__ es uno de los algoritmos cuánticos más conocidos, este busca encontrar los factores primos de un entero de entrada :math:`N` en tiempo polinomial. A la implementación del algoritmo en Qiskit simplemente se le provee un entero objetivo que va a ser factorizado y se ejecuta de la siguiente manera:
fr_fr: `L'algorithme de factorisation de Shor <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Shor.html>`__ est l'un des algorithmes quantiques les plus connus et permet de trouver les facteurs premiers d'un entier :math:`N` en temps polynomial. L'implémentation de l'algorithme dans Qiskit n'a besoin que d'un entier cible à factoriser et s'exécute comme suit:
id_id: ` Algoritma Faktorisasi Shor <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Shor.html>` __ adalah salah satu algoritma kuantum yang paling terkenal dan menemukan faktor prima dari input integer :math:` N ` dalam waktu polinomial. Implementasi algoritma di Qiskit hanya perlu target integer untuk difaktorkan dan dijalankan, sebagai berikut:
ja_jp: `Shor の素因数分解アルゴリズム <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Shor.html>`__ は最もよく知られた量子アルゴリズムの一つであり、入力された整数 :math:`N` の素因数を多項式時間で求めます。 Qiskit でのアルゴリズムの実装では、以下のように素因数分解する整数を与えるだけで実行できます。
ko_kr: `Shor’s Factoring algorithm <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Shor.html>`__ 은 가장 잘 알려진 양자 알고리즘 중 하나로 다항식 시간 내에 입력된 정수 :math:`N` 의 소인수(prime factor)를 찾는다. 키스킷에서 구현된 알고리즘은 단순히 목표 정수를 입력받아 실행하는데, 다음과 같이:
pt_br: `Algoritmo de Fatoração de Shor <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Shor.html>`__ é um dos algoritmos quânticos mais conhecidos e encontra os fatores primos para o valor inteiro de entrada :math:`N` em tempo polinomial. A implementação do algoritmo no Qiskit é simplesmente fornecer um inteiro alvo a ser fatorado e executar, da seguinte forma:
ta_in: `Shor’s Factoring algorithm <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Shor.html>`__ என்பது மிகவும் அறியப்பட்ட குவாண்டம் வழிமுறைகளில் ஒன்றாகும் மற்றும் உள்ளீட்டு முழு எண் :math:`N` இன் பல்லுறுப்புக்கோவைக்கான பிரதான காரணிகளைக் காண்கிறது. Qiskit-ல் அல்காரிதம் செயல்படுத்தல் வெறுமனே பின்வருமாறு காரணி மற்றும் இயங்குவதற்கான இலக்கு முழு எண் வழங்கப்படுகிறது:
vi_vn: `Thuật toán tìm ước của Shor <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Shor.html>`__ là một trong những thuật toán lượng tử nổi tiếng nhất để tìm ước nguyên tố của số nguyên đầu vào :math:`N` trong thời gian đa thức. Thuật toán được ứng dụng trong Qiskit thông qua việc cung cấp một số nguyên cần tìm ước và chạy như sau:

source: Note: this implementation of Shor’s algorithm uses :math:`4n + 2` qubits, where :math:`n` is the number of bits representing the integer in binary. So in practice, for now, this implementation is restricted to factorizing small integers. Given the above value of N we compute :math:`4n +2` below and confirm the size from the actual circuit.
es_un: Nota: esta implementación del algoritmo de Shor usa :math:`4n + 2` qubits, donde :math:`n` es el número de bits que representan el entero en binario. Así que en la práctica, por ahora, esta implementación esta restringida a factorizar números enteros pequeños. Dado el valor anterior de N calculamos :math:`4n +2` a continuación y confirmamos el tamaño de circuito.
fr_fr: Note: cette implémentation de l'algorithme de Shor’s utilise :math:`4n + 2`qubits, où :math:`n` est le nombre de bits représentant l'entier à factoriser lorsqu'il est écrit en binaire. Donc, dans la pratique, pour l'instant, cette implémentation est limitée à la factorisation de petits entiers. Étant donné la valeur ci-dessus de N, nous pouvons calculer :math:`4n +2` comme ci-dessous et confirmer le calcul à partir du circuit généré.
id_id: Catatan: implementasi algoritma Shor ini menggunakan :math:` 4n + 2 ` qubit, di mana :math:` n ` adalah jumlah bit yang mewakili bilangan bulat dalam biner. Jadi dalam prakteknya, untuk saat ini, implementasi ini terbatas untuk faktorisasi integer kecil. Dari nilai N di atas kita menghitung :math:` 4n + 2 ` seperti di bawah dan mengkonfirmasi ukuran dari sirkuit yang sebenarnya.
ja_jp: 注: Shor のアルゴリズムのこの実装は、:math:`n` を二進表示された入力整数のビット数として、 :math:`4n + 2` 量子ビット用いています。したがって実際には今のところ、小さな整数の素因数分解に限定されています。上記の N の値があたえられているので、以下に :math:`4n +2` を計算し、実際の回路サイズを確認します。
ko_kr: 참고: 쇼어의 알고리즘 구현은 :math:`4n + 2` 큐비트를 사용하며 여기서 :math:`n` 은 정수의 바이너리 비트 개수이다. 따라서 실제로 현재 이 구현은 크기가 작은 정수를 소인수 분해하는 것으로 제한된다. 위의 N 값이 주어지면 :math:`4n +2` 를 계산하고 실제 회로에서 크기를 확인한다.
pt_br: Nota: essa implementação do algoritmo de Shor usa :math:`4n + 2` qubits, onde :math:`n` é o número de bits representando o inteiro em binário. Por conseguinte, na prática, por enquanto, esta implementação limita-se a fatorar inteiros pequenos. Dado o valor acima de N calculamos :math:`4n +2` abaixo e confirmamos o tamanho do circuito real.
ta_in: குறிப்பு: ஷோரின் வழிமுறையின் இந்த செயல்படுத்தல் பின்வருமாறு :math:`4n + 2` qubits, இங்கே :math:`n` என்பது பைனரியில் உள்ள முழு எண்ணைக் குறிக்கும் பிட்களின் எண்ணிக்கை. எனவே நடைமுறையில், இப்போதைக்கு, இந்த செயல்படுத்தல் சிறிய முழு எண்களைக் காரணியாக்குவதற்கு மட்டுப்படுத்தப்பட்டுள்ளது. மேலே உள்ள N இன் மதிப்பைக் கணக்கிடுகிறோம் :math:`4n +2` கீழே மற்றும் உண்மையான சர்க்யூட்டிலிருந்து அளவை உறுதிப்படுத்தவும்.
vi_vn: Lưu ý: việc ứng dụng thuật toán Shor sử dụng :math:`4n+2` qubit, với :math:`n` là số lượng bit biểu diễn số nguyên dưới dạng nhị phân. Cho nên trong thực tế, ứng dụng này bị giới hạn chỉ tìm ước của các số nguyên bé. Với giá trị được cho của N ta tính :math:`4n+2` như bên dưới và xác minh kích thước của mạch.

source: It might seem like a moot point running Deutsch-Jozsa on a truthtable as the function outputs are literally listed as the truthtable’s values. The intention is to create an oracle circuit whose groundtruth information is readily available to us but obviously not to the quantum Deutsch-Jozsa algorithm that is to act upon the oracle circuit. In more realistic situations, the oracle circuit would be provided as a blackbox to the algorihtm.
ko_kr: 함수 출력이 문자 그대로 트루 테이블의 값으로 나열되어 있기 때문에 트루 테이블에 있는 Deutsch-Jozsa를 실행하는 것처럼 보일 수도 있다. 그 의도는, 그 근거의 진실 정보가 우리에게 쉽게 이용가능하지만, oracle 회로에 작용하는 quantum Deutsch-Jozsa 알고리즘에는 명백하지 않은 oracle 회로를 생성하기 위한 것이다. 보다 현실적인 상황에서, oracle 회로는 알고리즘에 대한 블랙박스로서 제공될 것이다.
ta_in: செயல்பாட்டு வெளியீடுகள் உண்மையில் சத்தியத்தின் மதிப்புகளாக பட்டியலிடப்பட்டிருப்பதால், இது ஒரு சத்தியத்தில் Deutsch-Jozsa ஐ இயக்கும் ஒரு முக்கிய புள்ளியாகத் தோன்றலாம். ஆரக்கிள் சர்க்யூட்டை உருவாக்குவதே இதன் நோக்கம், அதன் அடிப்படை உண்மைத் தகவல் எங்களுக்கு உடனடியாகக் கிடைக்கிறது, ஆனால் வெளிப்படையாக ஆரக்கிள் சர்க்யூட்டில் செயல்பட வேண்டிய குவாண்டம் Deutsch-Jozsa வழிமுறைக்கு அல்ல. மிகவும் யதார்த்தமான சூழ்நிலைகளில், ஆரக்கிள் சர்யூட் வழிமுறைக்கு ஒரு கரும்பெட்டியாக வழங்கப்படும்.
