Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/09_textbook_algorithms.po
Languages: es_un, fr_fr, id_id, ja_jp, ko_kr, pt_br, ta_in, vi_vn

source: Next the `Bernstein-Vazirani algorithm <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.BernsteinVazirani.html>`__ which tries to find a hidden string. Again, for the example, we create a TruthTableOracle instance.
es_un: A continuación el `algoritmo Bernstein-Vazirani <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.BernsteinVazirani.html>` __ que intenta encontrar un string oculto. De nuevo, para el ejemplo, creamos una instancia de TruthTableOracle.
fr_fr: Ensuite, l'algorithme de `Bernstein-Vazirani <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.BernsteinVazirani.html>`__ qui essaie de trouver une chaîne cachée. Encore une fois, pour les besoins de l'exemple, nous créons une instance de ``TruthTableOracle``.
id_id: Selanjutnya algoritma ` Bernstein-Vazirani <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.BernsteinVazirani.html>` __ yang mencoba untuk menemukan string tersembunyi. Sekali lagi, sebagai contoh, kita membuat instans TruthTableOracle.
ja_jp: 次に `Bernstein-Vazirani のアルゴリズム<https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.BernsteinVazirani.html>`__ を用いて、隠された文字列の発見を試みます。ここでも例のために TruthTableOracle インスタンスを作成します。
ko_kr: 다음으로 숨겨둔 문자열을 찾는 `Bernstein-Vazirani algorithm <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.BernsteinVazirani.html>`__ 이 있다. 이 예제에서는 다시 한번 TruthTableOracle 인스턴스를 작성한다.
pt_br: Em seguida, o `algoritmo de Bernstein-Vazirani <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.BernsteinVazirani.html>`__, que tenta encontrar uma string oculta. Novamente, para o exemplo, criamos uma instância TruthTableOracle.
ta_in: அடுத்து `Bernstein-Vazirani algorithm <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.BernsteinVazirani.html>`__ இது ஒரு மறைக்கப்பட்ட ஸ்ட்ரிங்கைக் கண்டுபிடிக்க முயற்சிக்கிறது. மீண்டும், எடுத்துக்காட்டாக, நாங்கள் ஒரு TruthTableOracle உதாரணத்தை உருவாக்குகிறோம்.
vi_vn: Thuật toán `Bernstein-Vazirani algorithm <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.BernsteinVazirani.html>`__ cố để tìm một xâu ẩn. Một lần nữa, ta lại tạo một instance TruthTableOracle.

source: As shown, the truthtable is specified with the ``bitstr`` containing values of all entries in the table. It has length :math:`8`, so the corresponding truth table is of :math:`3` input bits. The truthtable represents the function mappings as follows:
es_un: Como se muestra, la tabla de verdad es especificada con el ``bitstr`` que contiene todos los valores de las entradas en la tabla. Tiene un tamaño de :math:`8`, entonces la tabla de verdad correspondiente es de :math:`3` bits de entrada. La tabla de verdad representa las correlaciones de las funciones de la siguiente manera:
fr_fr: Comme indiqué, la table de vérité est spécifiée avec les valeurs ``bitstr`` contenant toutes les entrées. La table de vérité a une longueur de :math:`8`, donc elle correspond à :math:`3` bits d'entrée. La table de vérité représente la fonction comme suit:
id_id: Seperti telah dilihat, truthtable dispesifikasikan dengan nilai ` ` bitstr ` ` yang berisi semua entri dalam tabel. Ia memiliki panjang :math:` 8 `, sehingga truthtable yang berkaitan adalah dari input :math:` 3 ` bit. Truthtable mewakili fungsi pemetaan sebagai berikut:
ja_jp: このように、真理値表は表内の全てのエントリーの値を含む ``bitstr`` で指定されます。長さは :math:`8` となっているので、対応する真理値表は :math:`3` ビットの入力から構成されています。真理値表は以下のように関数のマッピングを表しています。
ko_kr: 보여지는 바와 같이, 진리표는 테이블의 모든 항목 값을 포함하는 ``bitstr`` 로 지정된다. 길이가 :math:`8` 이므로 해당 진리표는 :math:`3` 입력 비트이다. 진리표는 다음과 같이 함수 매핑을 나타낸다:
pt_br: Como mostrado, a tabela verdade é especificada com a ``bitstr`` contendo valores de todas as entradas na tabela. Ela tem tamanho :math:`8`, então a tabela verdade correspondente é de :math:`3` bits de entrada. A tabela verdade representa o mapeamento da função do seguinte modo:
ta_in: காட்டப்பட்டுள்ளபடி, அட்டவணையில் உள்ள அனைத்து உள்ளீடுகளின் மதிப்புகளைக் கொண்ட ``bitstr`` உடன் உண்மை அட்டவணை குறிப்பிடப்பட்டுள்ளது. இதன் நீளம் :math:`8`, எனவே அதனுடன் தொடர்புடைய உண்மை அட்டவணை :math:`3` உள்ளீட்டு பிட்கள். உண்மைத்தொகை பின்வருமாறு செயல்பாட்டு வரைபடங்களைக் குறிக்கிறது:
vi_vn: Như ta đã thấy, bảng chân trị được xác định bởi một ``bitstr`` bao gồm giá trị của tất cả phần tử trong bảng. Nó có chiều dài :math:`8`, bảng chân trị tương ứng có :math:`3` bit đầu vào. Bảng chân trị biểu diễn cho hàm ánh xạ như sau:

source: And obviously the goal is to find the bitstring :math:`\mathbf{a}` that satisfies all the inner product equations.
es_un: Y obviamente el objetivo es encontrar la cadena de bits :math:`\mathbf{a}` que satisface todas las ecuaciones de producto interno.
fr_fr: Et bien sûr, l'objectif est de trouver le bitstring :math:`\mathbf{a}` qui satisfait toutes les équations du produit scalaire.
id_id: Dan tujuannya adalah mencari bitstring :math:` \mathbf{a}` yang memenuhi semua persamaan inner produk.
ja_jp: 目標は、全ての内積方程式を満たすビット列 :math:`\mathbf{a}` を見つけることです。
ko_kr: 그리고 목표는 모든 내부 제품 방정식을 만족시키는 비트스트링 :math:`\mathbf{a}` 를 찾는 것이다.
pt_br: E obviamente o objetivo é encontrar a bitstring :math:`\mathbf{a}` que satisfaz todas as equações de produto interno.
ta_in: பிட்ஸ்ட்ரிங்கைக் கண்டுபிடிப்பதே குறிக்கோள் :math:`\mathbf{a}`` இது அனைத்து உள் தயாரிப்பு சமன்பாடுகளையும் திருப்திப்படுத்துகிறது.
vi_vn: Và rõ ràng mục đích là để tìm xâu bit :math:`\mathbf{a}` thỏa mãn tất cả các phương trình kết quả nội bộ.

source: Lets again look at the oracle circuit, that now corresponds to the binary function encoded in the ``TruthTableOracle`` instance.
es_un: Volvamos a ver el circuito del oráculo, que ahora corresponde a la función binaria codificada en la instancia ``TruthTableOracle``.
fr_fr: Revoyons le circuit de l'oracle, qui correspond maintenant à la fonction binaire encodée dans l'instance ``TruthTableOracle``.
id_id: Mari lihat lagi di sirkuit oracle, yang sekarang sesuai dengan fungsi biner yang dikodekan instans ` ` TruthTableOracle ` `.
ja_jp: もう一度 ``TruthTableOracle`` インスタンスでエンコードされたバイナリ関数に対応するオラクル回路を見てみましょう。
ko_kr: Oracle 회로를 다시 살펴보면, 이제 ``TruthTableOracle`` 인스턴스에 인코딩된 바이너리 함수에 해당한다.
pt_br: Vamos olhar novamente para o circuito do oráculo, que agora corresponde à função binária codificada na instância ``TruthTableOracle``.
ta_in: ஆரக்கிள் சர்க்யூட்டை மீண்டும் பார்ப்போம், இது இப்போது ``TruthTableOracle`` நிகழ்வில் குறியிடப்பட்ட பைனரி செயல்பாட்டிற்கு ஒத்திருக்கிறது.
vi_vn: Một lần nữa hãy nhìn vào mạch đối xứng, mà giờ tương ứng với hàm nhị phân được mã hóa trong instance ``TruthTableOracle``.

source: Again the :math:`v_i`\ ’s correspond to the 3 input bits; the :math:`o_0` is the oracle’s output qubit; the :math:`a_0` is an ancilla qubit.
es_un: De nuevo, las :math:`v_i`\ corresponden a los tres bits de entrada; el :math:`o_0` es el qubit de salida del oráculo; el :math:`a_0` es un qubit ancilla.
fr_fr: De nouveau, les :math:`v_i` correspondent aux 3 bits d'entrée ; le :math:`o_0` est le qubit de sortie de l'oracle ; le :math:`a_0` est un qubit ancillaire.
id_id: Sekali lagi, :math:` v_i ` adalah input 3 bit; :math:` o_0 ` adalah output qubit dari oracle; :math:` a_0 ` adalah qubit pembantu.
ja_jp: ここでも :math:`v_i` は三つの入力ビットに、 :math:`o_0` はオラクルの出力ビットに、 :math:`a_0` は補助ビットにそれぞれ対応しています。
ko_kr: 마찬가지로, :math:`v_i` 는 3 개의 입력 비트에 대응하며; :math:`o_0` 는 오라클의 출력 큐비트이고, :math:`a_0` 는 보조 큐비트(ancilla qubit)이다.
pt_br: Novamente, os :math:`v_i`\s correspondem aos 3 bits de entrada; o :math:`o_0` é o qubit de saída do oráculo; o :math:`a_0` é um qubit auxiliar.
ta_in: மீண்டும் :math:`v_i`\ ’s கள் 3 உள்ளீட்டு பிட்களுடன் ஒத்திருக்கும்; :math:`o_0` என்பது ஆரக்கிளின் வெளியீட்டு qubit; :math:`a_0` என்பது ஒரு ancilla qubit.
vi_vn: Một lần nữa, :math:`v_i`\ tương ứng với 3 bit đầu vào, :math:`o_0` là qubit đầu ra của công cụ đối xứng, :math:`a_0` là qubit ancilla.

source: Let us first compute the groundtruth :math:`\mathbf{a}` classically:
es_un: Calculemos primero el groundthruth :math:`\mathbf{a}` clásicamente:
fr_fr: Calculons d'abord la vraie valeur de :math:`\mathbf{a}` de façon classique:
id_id: Mari lebih dahulu hitung nilai sebenarnya dari :math:` \mathbf{a}` secara klasik:
ja_jp: まず 正解 :math:`\mathbf{a}` を古典的に計算してみましょう。
ko_kr: 먼저 groundtruth :math:`\mathbf{a}` 를 고전적으로 계산해보자:
pt_br: Primeiro, vamos calcular a verdade base :math:`\mathbf{a}` classicamente:
ta_in: முதலில் பாரம்பரியமாக அடிப்படை உண்மையை கணக்கிடுவோம் :math:`\mathbf{a}`:
vi_vn: Trước hết ta hãy tính :math:`\mathbf{a}` một cách cổ điển:

source: Next we can create a ``BernsteinVazirani`` instance using the oracle, and run it to check the result against the groundtruth.
es_un: Ahora podemos crear una instancia de ``BernsteinVazirani`` usando el oráculo, y lo ejecutamos para comparar el resultado con el groundthruth.
fr_fr: Ensuite, nous pouvons créer une instance ``BernsteinVazirani`` en utilisant l'oracle, et l'exécuter pour comparer le résultat obtenu avec le résultat attendu.
id_id: Selanjutnya kita bisa membuat instans ` ` BernsteinVazirani ` ` menggunakan oracle, dan menjalankannya untuk memeriksa hasilnya dibandingkan dengan nilai yang benar.
ja_jp: 次に、オラクルを使って ``BernsteinVazirani`` インスタンスを作成し、それを実行して結果を正解と照合します。
ko_kr: 다음으로 오라클을 사용하여 ``BernsteinVazirani`` 인스턴스를 생성하고 이를 실행하여 groundtruth에 대한 결과를 확인할 수 있다.
pt_br: Em seguida, podemos criar uma instância ``BernsteinVazirani`` usando o oráculo e executá-la para verificar o resultado contra a verdade base.
ta_in: அடுத்து நாம் ஆரக்கிளைப் பயன்படுத்தி ஒரு ``BernsteinVazirani`` உதாரணத்தை உருவாக்கலாம், மேலும் அடிப்படை உண்மைக்கு எதிரான முடிவைச் சரிபார்க்க அதை இயக்கவும்.
vi_vn: Tiếp theo ta tạo một instance ``BernsteinVazirani`` sử dụng công cụ đối xứng, và chạy nó để kiểm tra kết quả với những gì ta đã tính được.

source: Simon’s algorithm
es_un: Algoritmo de Simon
fr_fr: Algorithme de Simon
id_id: Algoritma Simon
ja_jp: Simon のアルゴリズム
ko_kr: 사이먼의 알고리즘
pt_br: Algoritmo de Simon
ta_in: Simon’s வழிமுறை
vi_vn: Thuật toán Simon

source: `Simon’s algorithm <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Simon.html>`__ is used to solve `Simon’s problem <https://en.wikipedia.org/wiki/Simon's_problem>`__. Once again, for the example, we create a TruthTableOracle instance, where the construction shows a different form.
es_un: El `Algoritmo de Simon <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Simon.html>`__ es usado para resolver `Problema de Simon <https://en.wikipedia.org/wiki/Simon's_problem>`__. De nuevo, por ejemplo, podemos crear una instancia de TruthTableOracle donde la construcción muestra una forma diferente.
fr_fr: `L'algorithme de Simon <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Simon.html>` __ est utilisé pour résoudre le problème de `Simon <https://en.wikipedia.org/wiki/Simon's_problem>` __. Encore une fois, pour l'exemple, nous créons une instance de ``TruthTableOracle``, où la construction présente une forme différente.
id_id: Algoritma ` Simon <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Simon.html>` __ digunakan untuk memecahkan ` masalah Simon <https://en.wikipedia.org/wiki/Simon's_problem>` __. Sekali lagi, untuk contoh, kita membuat sebuah instans TruthTableOracle, di mana konstruksinya berbeda dari sebelumnya.
ja_jp: `Simon のアルゴリズム <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Simon.html>`__ によって、 `Simon の問題 <https://en.wikipedia.org/wiki/Simon's_problem>`__ を解いてみましょう。改めて例のために TruthTableOracle インスタンスを作成していますが、ここでの構造は異なる形式を取っています。
ko_kr: `Simon’s algorithm <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Simon.html>`__ 은 `Simon’s problem <https://en.wikipedia.org/wiki/Simon's_problem>`__ 를 해결하는 데 사용된다. 이 예제에서는 다시 한번 TruthTableOracle 인스턴스를 작성하며, 여기서는 다른 형태의 구성을 보여준다.
pt_br: O `algoritmo de Simon <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Simon.html>`__ é usado para resolver o `problema de Simon <https://en.wikipedia.org/wiki/Simon's_problem>`__. Mais uma vez, para o exemplo, criamos uma instância TruthTableOracle, na qual a construção possui uma forma diferente.
ta_in: `Simon’s algorithm <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Simon.html>` __ ஆனது `Simon’s problem <https://en.wikipedia.org/wiki/Simon's_problem>`__ ஐ தீர்க்கப் பயன்படுகிறது. மீண்டும், எடுத்துக்காட்டாக, நாங்கள் ஒரு TruthTableOracle உதாரணத்தை உருவாக்குகிறோம், அங்கு கட்டுமானம் வேறு வடிவத்தைக் காட்டுகிறது.
vi_vn: `Thuật toán Simon <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.Simon.html>`__ được sử dụng để giải quyết `Vấn đề Simon <https://en.wikipedia.org/wiki/Simon's_problem>`__. Lại một lần nữa, ta lại tạo một instance TruthTableOracle, nhưng việc xây dựng tạo ra một hình thái khác.

source: As shown, the truthtable is specified with three length-8 bitstrings, each containing the values of all entries for a particular output column in the table. Each bitstring has length :math:`8`, so the truthtable has :math:`3` input bits; There are :math:`3` bitstrings, so the truthtable has :math:`3` output bits.
es_un: Como se muestra, la tabla de verdad es especificada con tres cadenas de 8 bits, cada una conteniendo los valores de todas las entradas de una columna de salida especifica de la tabla. Cada cadena tiene longitud :math:`8`, entonces la tabla de verdad va a tener :math:`3` bits de entrada; Hay :math:`3` cadenas de bits, entonces tiene :math:`3` bits de salida.
fr_fr: Comme on l'a montré, la table de vérité est spécifiée avec trois chaînes de caractères de longueur 8 qui contiennent chacune les valeurs de toutes les entrées pour une colonne de sortie particulière dans la table. Chaque chaîne de caractères a une longueur :math:`8`, donc la table de vérité a :math:`3` bits d'entrée; Il y a :math:`3` chaînes de caractères, donc la table de vérité a :math:`3` bits de sortie.
id_id: Seperti telah dilihat, truthtable ditentukan dengan tiga bitstring panjang 8, yang masing-masing berisi nilai dari semua entri dari kolom output tertentu di tabel. Setiap bitstring memiliki panjang :math:` 8 `, sehingga truthtable memiliki input :math:` 3 ` bit; Ada :math:` 3 ` bitstring, sehingga truthtable memiliki output :math:` 3 ` bit.
ja_jp: このように、真理値表は長さ 8 のビット列 3 つによって指定されており、それぞれが表の出力列に対する全てのエントリーの値を含んでいます。各ビット列の長さは :math:`8` なので、真理値表は :math:`3` ビットの入力をもちます。また :math:`3` つのビット列があるので、真理値表は :math:`3` ビットの出力をもちます。
ko_kr: 보여지는 대로, 진리표는 3 개의 길이-8 비트 문자열로 지정되며, 각각은 테이블에서 특정 출력 열에 대한 모든 항목의 값을 포함한다. 각 비트 문자열의 길이는 :math:`8` 이므로, 진리표에는 :math:`3` 입력 비트가 있으며; :math:`3` 비트 문자열이 있으므로 진리표에는 :math:`3` 출력 비트가 있다.
pt_br: Como mostrado, a tabela verdade é especificada com três strings com comprimento de 8 bits, cada uma contendo os valores de todas as entradas para uma coluna específica da saída na tabela. Cada bitstring tem comprimento :math:`8`, então a tabela verdade tem :math:`3` bits de entrada; Há :math:`3` bitstrings, então a tabela verdade tem :math:`3` bits de saída.
ta_in: காட்டப்பட்டுள்ளபடி, உண்மை அட்டவனை மூன்று நீளம் -8 பிட்ஸ்ட்ரிங்ஸுடன் குறிப்பிடப்பட்டுள்ளது, ஒவ்வொன்றும் அட்டவணையில் ஒரு குறிப்பிட்ட வெளியீட்டு நெடுவரிசைக்கான அனைத்து உள்ளீடுகளின் மதிப்புகளைக் கொண்டுள்ளது. ஒவ்வொரு பிட்ஸ்ட்ரிங்கிற்கும் நீளம் உள்ளது :math:`8`, எனவே உண்மை அட்டவனையில் :math:`3` உள்ளீட்டு பிட்கள்; உள்ளன :math:`3` பிட்ஸ்ட்ரிங்ஸ், எனவே உண்மையுள்ளவர் :math:`3` வெளியீட்டு பிட்கள்.
vi_vn: Như đã thấy, bảng chân trị được xác định bởi ba xâu bit có độ dài là 8, mỗi xâu chứa giá trị của tất cả các phần tử của một cột đầu ra cụ thể trong bảng. Mỗi chuỗi bit có độ dài :math:`8`, bảng chân trị có :math:`3` bit đầu vào; Có :math:`3` chuỗi bit, nên bảng chân trị có :math:`3` bit đầu ra.

source: The function :math:`f` represented by the truthtable is promised to be either 1-to-1 or 2-to-1. Our goal is to determine which. For the case of 2-to-1, we also need to compute the mask :math:`\mathbf{s}`, which satisfies :math:`\forall \mathbf{x},\mathbf{y}`: :math:`\mathbf{x} \oplus \mathbf{y} = \mathbf{s}` iff :math:`f(\mathbf{x}) = f(\mathbf{y})`. Apparently, if :math:`f` is 1-to-1, the corresponding mask :math:`\mathbf{s} = \mathbf{0}`.
es_un: La función :math:`f` representada por la tabla de verdad promete tener un valor de 1-a-1 o 2-a-1. Nuestro objetivo es determinar cual es. Para el caso de 2-a-1, también tenemos que calcular la máscara :math:`\mathbf{s}`, que satisface :math:`\forall \mathbf{x},\mathbf{y}`: :math:`\mathbf{x} \oplus \mathbf{y} = \mathbf{s}` si :math:`f(\mathbf{x}) = f(\mathbf{y})`. Aparentemente, si :math:`f` es 1-a-1, la máscara correspondiente es :math:`\mathbf{s} = \mathbf{0}`.
fr_fr: La fonction :math:`f` représentée par la table de vérité est garantie d'être soit 1-à-1 ou 2-à-1. Notre objectif est de déterminer lequel de ces 2 choix est vérifié. Pour le cas de 2-à-1, nous devons également calculer le masque :math:`\mathbf{s}`, qui satisfait :math:`\forall \mathbf{x}, mathbf{y}`: :math:`\mathbf{x} \oplus \mathbf{y} = \mathbf{s}` si et seulement si :math:`f(\mathbf{x}) = f(\mathbf{y})`. De façon apparente, si :math:`f` est 1-à-1, le masque correspondant est :math:`\mathbf{s} = \mathbf{0}`.
id_id: Fungsi :math:`f` yang direpresentasi oleh truthtable dijamin adalah fungsi 1-ke-1 atau 2-ke-1. Tujuan kita adalah menentukan yang mana dari dua. Ketika fungsi 2-ke-1, kita harus menghitung penyelubung :math:`\mathbf{s}`, yang memenuhi :math:`\forall \mathbf{x},\mathbf{y}`: :math:`\mathbf{x} \oplus \mathbf{y} = \mathbf{s}` jika dan hanya jika :math:`f(\mathbf{x}) = f(\mathbf{y})`. Dan, ketika :math:`f` adalah 1-ke-1, penyelubungnya :math:`\mathbf{s} = \mathbf{0}`.
ja_jp: 真理値で表される関数 :math:`f` は、1 対 1 か 2 対 1 のどちらかであることが保証されています。我々の目的は、そのどちらであるかを決定することです。 2 対 1 の場合には、 :math:`\forall \mathbf{x},\mathbf{y}`: :math:`\mathbf{x} \oplus \mathbf{y} = \mathbf{s}` iff :math:`f(\mathbf{x}) = f(\mathbf{y})` を満たすマスク :math:`\mathbf{s}` を計算する必要があります。 :math:`f` が 1 対 1 ならば、明らかに対応するマスクは :math:`\mathbf{s} = \mathbf{0}` となります。
ko_kr: 진리표로 표현되는 함수 :math:`f` 는 1대1 또는 2대1로 약속된다. 우리의 목표는 주어진 함수가 둘 중 무엇인지를 결정하는 것이다. 주어진 함수가 2대1인 경우, 마스크 :math:`\mathbf{s}` 도 계산해야 하는데, 이는 :math:`\forall \mathbf{x},\mathbf{y}`: :math:`\mathbf{x} \oplus \mathbf{y} = \mathbf{s}` iff :math:`f(\mathbf{x}) = f(\mathbf{y})` 를 만족한다. 명백하게도, 만약 :math:`f` 가 1대1이면, 이에 해당하는 마스크는 :math:`\mathbf{s} = \mathbf{0}` 이다.
pt_br: A função :math:`f` representada pela tabela verdade é prometida a ser 1 para 1 (injetora) ou 2 para 1. Nosso objetivo é determinar qual. Para o caso de 2 para 1, também precisamos calcular a máscara :math:`\mathbf{s}`, que satisfaz :math:`\forall \mathbf{x}, mathbf{y}`: :math:`\mathbf{x} \oplus \mathbf{y} = \mathbf{s}` iff :math:`f(\mathbf{x}) = f(\mathbf{y})`. Aparentemente, se :math:`f` for 1 para 1, a máscara correspondente :math:`\mathbf{s} = \mathbf{0}`.
ta_in: உண்மை அட்டவணையில் குறிப்பிடப்படும் :math:`f` செயல்பாடு 1-to-1 வரை அல்லது 2-to-1 என உறுதியளிக்கப்படுகிறது. எது என்பதை தீர்மானிப்பதே எங்கள் குறிக்கோள். 2-to-1 ஐப் பொறுத்தவரை, முகமூடியையும் கணக்கிட வேண்டும் :math:`\mathbf{s}`, which satisfies :math:`\forall \mathbf{x},\mathbf{y}`: :math:`\mathbf{x} \oplus \mathbf{y} = \mathbf{s}` iff :math:`f(\mathbf{x}) = f(\mathbf{y})`. வெளிப்படையாக, :math:`f` 1-to-1 வரை இருந்தால், அதனுடன் தொடர்புடைய முகமூடி :math:`\mathbf{s} = \mathbf{0}`.
vi_vn: Hàm :math:`f` được biểu diễn bởi bảng chân tri sẽ là 1-to-1 hoặc 2-to-1. Mục đích của chúng ta là để phân biệt chúng. Trong trường hợp 2-to-1, ta cần tính mask :math:`\mathbf{s}` thỏa mãn :math:`\forall \mathbf{x},\mathbf{y}`: :math:`\mathbf{x} \oplus \mathbf{y} = \mathbf{s}` nếu :math:`f(\mathbf{x}) = f(\mathbf{y})`. Rõ ràn :math:`f` là 1-to-1, mask tương ứng :math:`\mathbf{s} = \mathbf{0}`.

source: Let us first compute the groundtruth mask :math:`\mathbf{s}` classically:
es_un: Calculemos primero la máscara del groundthruth :math:`\mathbf{s}` clásicamente:
fr_fr: Calculons d'abord la vraie valeur du masque :math:`\mathbf{s}` de façon classique:
id_id: Mari kita hitung dulu penyelubung benar :math:` \mathbf{s}` secara klasik:
ja_jp: まず 正解のマスク :math:`\mathbf{s}` を古典的に計算してみましょう。
ko_kr: 먼저 groundtruth mask :math:`\mathbf{s}` 를 고전적으로 계산해보자:
pt_br: Primeiro, vamos calcular a máscara de verdade fundamental :math:`\mathbf{s}` classicamente:
ta_in: முதலில் பாரம்பரியமாக அடிப்படை உண்மை முகமூடியைக் கணக்கிடுவோம்: :math:`\mathbf{s}`:
vi_vn: Trước hết ta sẽ tính mask :math:`\mathbf{s}` một cách cổ điển:

source: We can also quickly try a truthtable that represents a 1-to-1 function (i.e., the corresponding mask is :math:`\mathbf{0}`), as follows.
es_un: También podemos probar rápidamente una tabla de verdad que represente a una función 1-a-1 (es decir, la máscara correspondiente es :math:`\mathbf{0}`), de la siguiente manera.
fr_fr: Nous pouvons également essayer rapidement une table de vérité qui représente une fonction de 1-à-1 (c'est-à-dire que le masque correspondant est :math:`\mathbf{0}`), comme suit.
id_id: Kita juga dapat dengan cepat mencoba sebuah truthtable yang mewakili fungsi 1-ke-1 (yaitu, penyelubungnya adalah :math:` \mathbf{0}`), sebagai berikut.
ja_jp: また 1 対 1 関数を表す真理値表 (対応するマスクは :math:`\mathbf{0}` ) は、以下のように手軽に試すこともできます。
ko_kr: 또한 다음과 같이 일대일 함수 (즉, :math:`\mathbf{0}` mask에 대응하는) 를 나타내는 진리표를 빠르게 시도해볼 수 있다.
pt_br: Também podemos tentar rapidamente uma tabela verdade que representa uma função de 1 para 1 (ou seja, a máscara correspondente é :math:`\mathbf{0}`), da seguinte maneira.
ta_in: 1-to-1 செயல்பாட்டைக் குறிக்கும் ஒரு உண்மையை நாம் விரைவாக முயற்சி செய்யலாம் (அதாவது, தொடர்புடைய முகமூடி :math:`\mathbf{0}`), பின்வருமாறு.
vi_vn: Chúng ta cũng có thể thử dùng một bảng chân trị biểu diễn một hàm 1-to-1 (tức là, mask tương ứng là :math:`\mathbf{0}`) như sau.

source: Shor’s Factoring algorithm
es_un: Algoritmo de Factorización de Shor
fr_fr: L'algorithme de factorisation de Shor
id_id: Algoritma Faktorisasi Shor
ja_jp: Shor の素因数分解アルゴリズム
ko_kr: 쇼어의 소인수분해 알고리즘
pt_br: Algoritmo de Fatoração de Shor
ta_in: Shor’s காரணி வழிமுறை
vi_vn: Thuật toán tìm ước của Shor
