Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/algorithms/09_textbook_algorithms.po
Languages: es_un, fr_fr, id_id, ja_jp, ko_kr, pt_br, ta_in, vi_vn

source: This page was generated from `tutorials/algorithms/09_textbook_algorithms.ipynb`__.
es_un: Esta página fue generada desde `tutorials/algorithms/09_textbook_algorithms.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/algorithms/09_textbook_algorithms.ipynb`__.
id_id: Halaman ini dibuat dari ` tutorials/algoritms/09_textbook_algoritms.ipynb ` __.
ja_jp: このページは `tutorials/algorithms/09_textbook_algorithms.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/algorithms/09_textbook_algorithms.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada, a partir do `tutorials/algorithms/09_textbook_algorithms.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/algorithms/09_textbook_algorithms.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
vi_vn: Trang này được tạo ra từ `tutorials/algorithms/09_textbook_algorithms.ipynb`__.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/09_textbook_algorithms.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/09_textbook_algorithms.ipynb>`__.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/09_textbook_algorithms.ipynb>`_.
id_id: Jalankan secara interaktif di ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/09_textbook_algorithms.ipynb>` _.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/09_textbook_algorithms.ipynb>`_ でインタラクティブに実行します。
ko_kr: `IBM 퀀텀 랩 <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/09_textbook_algorithms.ipynb>`_ 에서 대화식으로 실행하시오.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/09_textbook_algorithms.ipynb>`_.
ta_in: ஊடாடும் வகையில் `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/09_textbook_algorithms.ipynb>`_ இயக்கவும்.
vi_vn: Chạy tương tác trực tiếp tại `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/09_textbook_algorithms.ipynb>`_.

source: Textbook and Shor’s algorithms
es_un: Libro de texto y algoritmos de Shor
fr_fr: L'algorithme de Shor dans le manuel qiskit
id_id: Buku Teks dan Algoritma Shor
ja_jp: 教科書的なアルゴリズムと Shor のアルゴリズム
ko_kr: 사용 지침서와 쇼어 알고리즘
pt_br: Algoritmos de Shor e de livros didáticos
ta_in: பாடநூல் மற்றும் ஷோரின் வழிமுறைகள்
vi_vn: Thuật toán căn bản và thuật toán Shor

source: Qiskit contains implementations of the well known textbook quantum algorithms such as the `Deutsch-Jozsa algorithm <https://qiskit.org/textbook/ch-algorithms/deutsch-jozsa.html>`__, the `Bernstein-Vazirani algorithm <https://qiskit.org/textbook/ch-algorithms/bernstein-vazirani.html>`__ and `Simon’s algorithm <https://qiskit.org/textbook/ch-algorithms/simon.html>`__.
es_un: Qiskit contiene implementaciones de los algoritmos más conocidos encontrados en los libros de texto como el `Algoritmo de Deutsch-Jozsa <https://qiskit.org/textbook/ch-algorithms/deutsch-jozsa.html>`__, el `Algoritmo de Bernstein-Vazirani <https://qiskit.org/textbook/ch-algorithms/bernstein-vazirani.html>`__ y el `Algoritmo de Simon <https://qiskit.org/textbook/ch-algorithms/simon.html>`__.
fr_fr: Qiskit contient des implémentations des algorithmes quantiques connus tels que l'algorithme "Deutsch-Jozsa <https://qiskit.org/textbook/ch-algorithms/deutsch-jozsa.html>` __, l'algorithme" Bernstein-Vazirani <https://qiskit.org/textbook/ch-algorithms/bernstein-vazirani.html>` __ et l'algorithme de Simon <https://qiskit.org/textbook/ch-algorithms/simon.html>` __.
id_id: Qiskit berisi implementasi algoritma terkenal yang ada di buku teks seperti algoritma ` Deutsch-Jozsa ' <https://qiskit.org/textbook/ch-algorithms/deutsch-jozsa.html>` __, algoritma ` Bernstein-Vazirani <https://qiskit.org/textbook/ch-algorithms/bernstein-vazirani.html>` __ dan algoritma ` Simon <https://qiskit.org/textbook/ch-algorithms/simon.html>` __.
ja_jp: Qiskit には `Deutsch-Jozsa のアルゴリズム <https://qiskit.org/textbook/ch-algorithms/deutsch-jozsa.html>`__, `Bernstein-Vazirani のアルゴリズム <https://qiskit.org/textbook/ch-algorithms/bernstein-vazirani.html>`__, `Simon のアルゴリズム <https://qiskit.org/textbook/ch-algorithms/simon.html>`__ などの、よく知られている教科書的な量子アルゴリズムの実装が含まれています。
ko_kr: 키스킷에서는 `Deutsch-Jozsa algorithm <https://qiskit.org/textbook/ch-algorithms/deutsch-jozsa.html>`__, `Bernstein-Vazirani algorithm <https://qiskit.org/textbook/ch-algorithms/bernstein-vazirani.html>`__ 및 `Simon’s algorithm <https://qiskit.org/textbook/ch-algorithms/simon.html>`__ 과 같이 잘 알려진 양자 알고리즘들을 구현해두어 포함하고 있다.
pt_br: Qiskit contém implementações dos algoritmos quânticos bem conhecidos da literatura como o `algoritmo de Deutsch-Jozsa <https://qiskit.org/textbook/ch-algorithms/deutsch-jozsa.html>`__, o `algoritmo de Bernstein-Vazirani <https://qiskit.org/textbook/ch-algorithms/bernstein-vazirani.html>`__ e o `algoritmo de Simon <https://qiskit.org/textbook/ch-algorithms/simon.html>`__.
ta_in: Qiskit-ல் நன்கு அறியப்பட்ட பாடநூல் குவாண்டம் வழிமுறைகளின் செயல்பாடுகள் உள்ளன `Deutsch-Jozsa algorithm <https://qiskit.org/textbook/ch-algorithms/deutsch-jozsa.html>`__, `Bernstein-Vazirani algorithm <https://qiskit.org/textbook/ch-algorithms/bernstein-vazirani.html>`__ மற்றும் `Simon’s algorithm <https://qiskit.org/textbook/ch-algorithms/simon.html>`__.
vi_vn: Qiskit bao gồm các thuật toán lượng tử căn bản nổi tiếng như `thuật toán Deutsch-Jozsa` <https://qiskit.org/textbook/ch-algorithms/deutsch-jozsa.html>`__, `thuật toán Bernstein-Vazirani algorithm <https://qiskit.org/textbook/ch-algorithms/bernstein-vazirani.html>`__ và `thuật toán Simon <https://qiskit.org/textbook/ch-algorithms/simon.html>`__.

source: Qiskit also has an implementation of `Shor’s algorithm <https://qiskit.org/textbook/ch-algorithms/shor.html>`__.
es_un: Qiskit también tiene una implementación del `algoritmo de Shor <https://qiskit.org/textbook/ch-algorithms/shor.html>`__.
fr_fr: Qiskit dispose également d'une implémentation de l'algorithme de `Shor <https://qiskit.org/textbook/ch-algorithms/shor.html>`__.
id_id: Qiskit juga memiliki implementasi algoritma ` Shor ' <https://qiskit.org/textbook/ch-algorithms/shor.html>` __.
ja_jp: Qiskit には `Shor のアルゴリズム <https://qiskit.org/textbook/ch-algorithms/shor.html>`__ の実装があります。
ko_kr: 키스킷에는 `Shor’s algorithm <https://qiskit.org/textbook/ch-algorithms/shor.html>`__ 이 구현되어 있다.
pt_br: Qiskit tem também uma implementação do `algoritmo de Shor <https://qiskit.org/textbook/ch-algorithms/shor.html>`__.
ta_in: Qiskit-ல் `Shor’s algorithm <https://qiskit.org/textbook/ch-algorithms/shor.html>`__ இன் செயல்பாடும் உள்ளது.
vi_vn: Qiskit cũng có ứng dụng của `Thuật toán Shor <https://qiskit.org/textbook/ch-algorithms/shor.html>`__.

source: The preceding references have detailed explanations and build-out of circuits whereas this notebook has examples with the pre-built algorithms in Qiskit that you can use for experimentation and education purposes.
es_un: Las siguientes referencias tienen explicaciones detalladas y representaciones de circuitos mientras que este cuaderno tiene ejemplos de los algoritmos pre-construidos en Qiskit que puedes usar para experimentar y para otros propósitos didácticos.
fr_fr: Les références précédentes ont des explications détaillées et une construction de circuits tandis que ce bloc-note a des exemples avec les algorithmes préconfigurés de Qiskit que vous pouvez utiliser à des fins d'expérimentation et de formation.
id_id: Referensi sebelumnya memiliki penjelasan rinci dan konstruksi siap-saji dari sirkuit sedangkan notebook ini memiliki contoh algoritma siap saji di Qiskit yang dapat Anda gunakan untuk eksperimen dan pendidikan.
ja_jp: 上記の参照先では回路の配置と詳細な説明を行っていますが、このノートブックでは Qiskit であらかじめ構築されたアルゴリズムの例を示しているので、実験や教育の目的で用いることができます。
ko_kr: 이전 참조들은 회로들의 상세한 설명들 및 build-out of circuits를 가지는 반면, 이 노트북은 실험 및 교육 목적으로 사용할 수 있는 키스킷에서 사전에 구현된 알고리즘들을 예로 들어 설명한다.
pt_br: As referências anteriores têm explicações detalhadas e a construção de circuitos, enquanto este notebook tem exemplos com os algoritmos pré-construídos no Qiskit que você pode usar para fins educativos e de experimentação.
ta_in: முந்தைய குறிப்புகள் விரிவான விளக்கங்கள் மற்றும் சர்க்யூட்களை உருவாக்குதல் ஆகியவற்றைக் கொண்டுள்ளன, அதேசமயம் இந்த நோட்புக்கில் Qiskit-ல் முன்பே கட்டப்பட்ட வழிமுறைகளுடன் எடுத்துக்காட்டுகள் உள்ளன, அவை நீங்கள் சோதனை மற்றும் கல்வி நோக்கங்களுக்காகப் பயன்படுத்தலாம்.
vi_vn: Các nguồn tham khảo phía trên đã có giải thích chi tiết và xây dựng từ mạch trong khi tài liệu này có ví dụ với các thuật toán được xây dựng sẵn trong Qiskit mà bạn có thể dùng vào mục đích thí nghiệm và giáo dục.

source: Deutsch-Jozsa algorithm
es_un: Algoritmo de Deutsch-Jozsa
fr_fr: Algorithme de Deutsch-Jozsa
id_id: Algoritma Deutsch-Jozsa
ja_jp: Deutsch-Jozsa のアルゴリズム
ko_kr: 도이체-조자 (Deutsch-Jozsa) 알고리즘
pt_br: Algoritmo de Deutsch-Jozsa
ta_in: Deutsch-Jozsa வழிமுறை
vi_vn: Thuật toán Deutsch-Jozsa

source: Lets start with the `Deutsch-Jozsa algorithm <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.DeutschJozsa.html>`__ which can determine if a function is ``'balanced'`` or ``'constant'`` given such a function as input. We can experiment with it in Qiskit using an oracles created from a truth tables. So for example, we can create a ``TruthTableOracle`` instance as follows.
es_un: Empecemos con el algoritmo de `Deutsch-Jozsa <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.DeutschJozsa.html>`__ que puede determinar si una función es ``'balanceada'`` o ``'constante'` dada una función como entrada. Podemos experimentar con él en Qiskit usando oráculos creados a partir de tablas de verdad. Así que, por ejemplo, podemos crear una instancia de ``TruthTableOracle`` de la siguiente manera.
fr_fr: Commençons par l'algorithme `Deutsch-Jozsa <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.DeutschJozsa.html>`__ qui peut déterminer si une fonction est ``'équilibrée'`` ou ``'constante'``. Nous pouvons l’expérimenter dans Qiskit en utilisant un oracle créé à partir d’une table de vérité. Ainsi, par exemple, nous pouvons créer une instance ``TruthTableOracle`` comme suit.
id_id: Mari mulai dengan algoritma ` Deutsch-Jozsa <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.DeutschJozsa.html>` __ yang dapat menentukan apakah suatu fungsi adalah ` ` ` seimbang '` ` atau ` ` ` konstan' ` ` ketika fungsi diberikan sebagai input. Kita bisa bereksperimen dengannya di Qiskit menggunakan oracle yang dibuat dari truth table. Misalnya, kita dapat membuat instans ` ` TruthTableOracle ` ` sebagai berikut.
ja_jp: まず `Deutsch-Jozsa のアルゴリズム <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.DeutschJozsa.html>`__ から始めてみましょう。これは関数が入力として与えられたときに、その関数が ``balanced`` なのか ``constant`` なのかの判定ができるものとなっています。 Qiskit では、真理値表から作成したオラクルを用いてその実験を行うことが可能です。例えば以下のように、 ``TruthTableOracle`` インスタンスを作成することができます。
ko_kr: 입력과 같은 함수가 주어졌을때, 함수가 ``'balanced'`` 인지 ``'constant'`` 인지를 결정할 수 있는`Deutsch-Jozsa algorithm <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.DeutschJozsa.html>`__ 알고리즘 부터 시작해 보자. 진리표에서 생성된 오라클을 사용하여 키스킷에서 실험할 수 있다. 예를 들어, 다음과 같이 ``TruthTableOracle`` 인스턴스를 만들 수 있다.
pt_br: Vamos começar com o `algoritmo de Deutsch-Jozsa <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.DeutschJozsa.html>`__ que pode determinar se uma função é ``'balanceada'`` ou ``'constante'`` dada tal função como entrada. Nós podemos experimentar isso no Qiskit usando um oráculo criado a partir de tabelas verdade. Então, por exemplo, podemos criar uma instância ``TruthTableOracle`` da seguinte forma.
ta_in: `Deutsch-Jozsa algorithm <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.DeutschJozsa.html>`__ உடன் தொடங்கலாம், இது ஒரு செயல்பாடு ``'balanced'`` அல்லது ``'constant'`` என்பது உள்ளீடு போன்ற ஒரு செயல்பாட்டைக் கொடுக்கும். ஒரு உண்மை அட்டவணையில் இருந்து உருவாக்கப்பட்ட ஆரக்கிள்களைப் பயன்படுத்தி Qiskit அதைப் பரிசோதிக்கலாம். எனவே எடுத்துக்காட்டாக, `` TruthTableOracle`` உதாரணத்தை பின்வருமாறு உருவாக்கலாம்.
vi_vn: Hãy bắt đầu với `thuật toán Deutsch-Jozsa <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.DeutschJozsa.html>`__ có thể xác định xem một hàm là ``balanced`` hay ``constant`` khi có đầu vào là hàm đấy. Ta có thể thí nghiệm với chúng trong Qiskit sử dụng công cụ đối xứng tạo ra từ bảng chân trị. Ví dụ, ta có thể tạo ra một instance ``TruthTableOracle`` như sau.

source: As shown, the truthtable is specified with the ``bitstr`` containing values of all entries in the table. It has length :math:`8`, so the corresponding truth table is of :math:`3` input bits. We can of course see that this truth table represents a ``'balanced'`` function as half of values are :math:`1` and the other half :math:`0`.
es_un: Como se muestra, la tabla de verdad se especifica con el ``bitstr`` que contiene los valores de todas las entradas en la tabla. Tiene longitud :math:`8`, así que la tabla de verdad correspondiente es de :math:`3` bits de entrada. Por supuesto, podemos ver que esta tabla de verdad representa una función ``'balanceada'`` ya que la mitad de los valores son :math:`1` y la otra mitad :math:`0`.
fr_fr: Comme indiqué, la table de vérité est spécifiée avec les valeurs ``bitstr`` contenant toutes les entrées. La table de vérité a une longueur de :math:`8`, donc elle correspond à :math:`3` bits d'entrée. Nous pouvons bien sûr constater que cette table de vérité représente une fonction ``'équilibrée'`` car la moitié des valeurs sont :math:`1` et l'autre moitié :math:`0`.
id_id: Seperti telah dilihat, truth table dispesifikasikan dengan nilai ` ` bitstr ` ` yang berisi semua entri dalam tabel. Ia memiliki panjang :math:` 8 `, sehingga truthtable yang berkaitan adalah input dari :math:` 3 ` bit. Kita tentu saja bisa melihat bahwa truthtable ini adalah fungsi ` ` 'seimbang ' ` ` jika setengah dari nilai adalah :math:` 1 ` dan setengah lainnya :math:` 0 `.
ja_jp: このように、真理値表は表内の全てのエントリーの値を含む ``bitstr`` で指定されます。長さは :math:`8` となっているので、対応する真理値表は :math:`3` ビットの入力から構成されています。もちろんこの真理値表は、値の半分が :math:`1` 、 残りの半分は :math:`0` であることから、 ``balanced`` 関数を表していることがわかります。
ko_kr: 보여지는 바와 같이, 진리표는 테이블의 모든 항목 값을 포함하는 ``bitstr`` 로 지정된다. 길이가 :math:`8` 이므로 해당 진리표는 :math:`3` 입력 비트이다. 물론 값의 절반은 :math:`1` 이고 나머지 절반은 :math:`0` 이므로 이 진리표가 ``'balanced'`` 함수를 나타냄을 알 수 있다.
pt_br: Como mostrado, a tabela verdade é especificada com a ``bitstr`` contendo valores de todas as entradas na tabela. Ela tem tamanho :math:`8`, então a tabela verdade correspondente é de :math:`3` bits de entrada. Claro que podemos ver que esta tabela verdade representa uma função ``'balanceada'`` já que metade dos valores são :math:`1` e a outra metade :math:`0`.
ta_in: காட்டப்பட்டுள்ளபடி, அட்டவணையில் உள்ள அனைத்து உள்ளீடுகளின் மதிப்புகளைக் கொண்ட ``bitstr`` உடன் உண்மைத்தொகை குறிப்பிடப்பட்டுள்ளது. இதன் நீளம் :math:`8`, எனவே அதனுடன் தொடர்புடைய உண்மை அட்டவணை :math:`3` உள்ளீட்டு பிட்கள். மதிப்புகளின் பாதி :math:`1` மற்றும் மற்ற பாதி :math:`0` என இந்த உண்மை அட்டவணை ஒரு `` 'balanced'` செயல்பாட்டைக் குறிக்கிறது என்பதை நாம் நிச்சயமாகக் காணலாம்.
vi_vn: Như ta đã thấy, bảng chân trị được xác định bởi ``bitstr`` bao gồm giá trị của tất cả các phần tử trong bảng. Nó có chiều dài :math:`8`, nên bảng chân trị đầu vào tương ứng có :math:`3` bit đầu vào. Ta có thể thấy rằng bảng chân trị này biểu diễn một hàm ``balanced`` vì một nửa giá trị của nó là :math:`1` còn nửa còn lại là :math:`0`.

source: It might seem like a moot point running Deutsch-Jozsa on a truthtable as the function outputs are literally listed as the truthtable’s values. The intention is to create an oracle circuit whose groundtruth information is readily available to us but obviously not to the quantum Deutsch-Jozsa algorithm that is to act upon the oracle circuit. In more realistic situations, the oracle circuit would be provided as a blackbox to the algorithm.
es_un: Puede parecer un punto discutible ejecutar Deutsch-Jozsa en una tabla de verdad, ya que las salidas de la función se enumeran literalmente como los valores de la tabla de verdad. La intención es crear un circuito del oráculo cuya información fundamental esté disponible para nosotros, pero obviamente no para el algoritmo cuántico Deutsch-Jozsa que actuará sobre el circuito del oráculo. En situaciones más realistas, el circuito del oráculo se proporcionaría como una caja negra para el algoritmo.
ja_jp: 関数の出力が真理値表の値としてリスト化されているので、真理値表に対して Deutsch-Jozsa のアルゴリズムを実行することは無意味に思えるかもしれません。その目的は、正解の情報に我々は容易にアクセスできるが、 Deutsch-Jozsa のアルゴリズムは容易にアクセスできないようなオラクル回路を作成することです。より現実的な状況では、オラクル回路はアルゴリズムのブラックボックスとして与えられます。
pt_br: Pode parecer algo discutível executar o Deutsch-Jozsa em uma tabela verdade, já que os resultados da função são literalmente listados como valores da tabela verdade. Pretende-se criar um circuito oráculo cuja informação base verdadeira esteja prontamente disponível para nós, mas obviamente não para o algoritmo quântico de Deutsch-Jozsa que deverá atuar sobre o circuito do oráculo. Em situações mais realistas, o circuito do oráculo seria fornecido como uma caixa-preta ao algoritmo.

source: Above said, we can inspect the circuit corresponding to the function encoded in the ``TruthTableOracle`` instance.
es_un: Y como se mencionó arriba, podemos inspeccionar el circuito correspondiente a la función codificada en la instancia ``TruthTableOracle``.
fr_fr: Comme dit ci-dessus, nous pouvons inspecter le circuit correspondant à la fonction codée dans l'instance de ``TruthTableOracle``.
id_id: Seperti telah disebutkan, kita dapat inspeksi sirkuit yang berkaitan dengan fungsi yang dikodekan dalam instans ` ` TruthTableOracle ` `.
ja_jp: ``TruthTableOracle`` インスタンスでエンコードされた関数に対応する回路を調べることができます。
ko_kr: 위에서는 `TruthTableOracle`` 인스턴스에서 인코딩된 기능에 해당하는 회로를 검사할 수 있다.
pt_br: Como mencionado anteriormente, podemos inspecionar o circuito correspondente à função codificada na instância ``TruthTableOracle``.
ta_in: மேலே சொன்னது போல, `` TruthTableOracle`` நிகழ்வில் குறியிடப்பட்ட செயல்பாட்டுடன் தொடர்புடைய சர்க்யூட்களை நாம் ஆய்வு செய்யலாம்.
vi_vn: Như đã nói, ta có thể kiểm tra mạch tương ứng với hàm được mã hóa trong instance ``TruthTableOracle``.

source: As seen, the :math:`v_i`\ ’s correspond to the 3 input bits; the :math:`o_0` is the oracle’s output qubit; the :math:`a_0` is an ancilla qubit.
es_un: Como se puede ver, :math:`v_i`\ corresponde a los 3 bits de entrada; :math:`o_0` es el qubit de salida del oráculo; :math:`a_0` es un qubit ancilla.
fr_fr: Comme on l'a vu, les :math:`v_i` correspondent aux 3 bits d'entrée ; le :math:`o_0` est le qubit de sortie de l'oracle ; le :math:`a_0` est un qubit ancillaire.
id_id: Seperti yang terlihat, :math:` v_i ` terkait dengan input 3 bit; :math:` o_0 ` adalah output dari oracle qubit; :math:` a_0 ` adalah qubit pembantu.
ja_jp: 見ての通り、 :math:`v_i` は三つの入力ビットに、 :math:`o_0` はオラクルの出力ビットに、 :math:`a_0` は補助ビットにそれぞれ対応しています。
ko_kr: 보여지는 바와 같이, :math:`v_i` 는 3 개의 입력 비트에 대응하며; :math:`o_0` 는 오라클의 출력 큐비트이고, :math:`a_0` 는 보조 큐비트(ancilla qubit)이다.
pt_br: Como se vê, os :math:`v_i`\s correspondem aos 3 bits de entrada; o :math:`o_0` é o qubit de saída do oráculo; o :math:`a_0` é um qubit auxiliar.
ta_in: பார்த்தபடி :math:`v_i`\ ’s கள் 3 உள்ளீட்டு பிட்களுடன் ஒத்திருக்கும்; :math:`o_0` என்பது ஆரக்கிளின் வெளியீட்டு qubit; :math:`a_0` என்பது ஒரு ancilla qubit.
vi_vn: Như đã thấy, :math:`v_i`\ tương ứng với 3 bit đầu vào, :math:`o_0` là qubit đầu ra của công cụ đối xứng, :math:`a_0` là qubit ancilla.

source: Next we can simply create a ``DeutschJozsa`` instance using the oracle, and run it to check the result.
es_un: A continuación podemos crear una instancia ``DeutschJozsa`` usando el oráculo y correrlo para revisar el resultado.
fr_fr: Ensuite nous pouvons simplement créer une instance de ``DeutschJozsa`` en utilisant l'oracle, et l'exécuter pour vérifier le résultat.
id_id: Selanjutnya kita bisa membuat sebuah instans ` ` DeutschJozsa ` ` menggunakan oracle, dan menjalankannya untuk memeriksa hasil.
ja_jp: 次に、オラクルを用いて ``DeutschJozsa`` インスタンスを作成し、実行して結果を確認します。
ko_kr: 다음으로, 우리는 단순히 oracle을 생성하여 ``DeutschJozsa`` 인스턴스를 생성하고, 이를 실행하여 결과를 확인할 수 있다.
pt_br: Em seguida, podemos simplesmente criar uma instância ``DeutschJozsa`` usando o oráculo e executá-la para verificar o resultado.
ta_in: அடுத்து, ஆரக்கிளைப் பயன்படுத்தி ``DeutschJozsa`` உதாரணத்தை உருவாக்கி, முடிவைச் சரிபார்க்க அதை இயக்கலாம்.
vi_vn: Tiếp theo ta có thể tạo một instance ``DeutschJozsa`` sử dụng công cụ đối xứng, và chạy nó để kiểm tra kết quả.

source: We can of course quickly put together another example for a ``'constant'`` function, as follows.
es_un: Por supuesto, podemos establecer rápidamente otro ejemplo para una función ``'constant'``, de la siguiente manera.
fr_fr: Nous pouvons bien sûr rapidement rassembler un autre exemple pour une fonction ``'constante'`` comme suit.
id_id: Kita tentu saja dapat dengan cepat mengumpulkan contoh lain untuk fungsi ` ` 'konstan' ` `, sebagai berikut.
ja_jp: もちろん、以下のように定数関数の例を用意することもできます。
ko_kr: 우리는 물론 빠르게 다음과 같이 ``'constant'`` 기능에 대한 또 다른 예를 들 수 있다.
pt_br: Nós podemos, é claro, rapidamente montar outro exemplo para uma função ``'constante'``, da seguinte forma.
ta_in: பின்வருமாறு, `` 'constant'`` செயல்பாட்டிற்கான மற்றொரு உதாரணத்தை விரைவாக ஒன்றிணைக்கலாம்.
vi_vn: Tất nhiên ta có thể dễ dàng đưa ra một ví dụ khác cho một hàm ``constant`` như sau.

source: Bernstein-Vazirani algorithm
es_un: Algoritmo Bernstein-Vazirani
fr_fr: Algorithme de Bernstein-Vazirani
id_id: Algoritma Bernstein-Vazirani
ja_jp: Bernstein-Vazirani のアルゴリズム
ko_kr: 번스타인-바조니 (Bernstein-Vazirani) 알고리즘
pt_br: Algoritmo de Bernstein-Vazirani
ta_in: Bernstein-Vazirani வழிமுறை
vi_vn: Thuật toán Bernstein-Vazirani
