Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/howtos/adapt_vqe.po
Languages: es_un, ja

source: Find ground state energy using AdaptVQE
es_un: Encontrar la energía del estado fundamental usando AdaptVQE
ja: AdaptVQE を使用して基底状態エネルギーを見つける

source: As of Qiskit Nature v0.5, the :class:`~qiskit.algorithms.minimum_eigensolvers.AdaptVQE` algorithm has been migrated to Qiskit Terra (released in v0.22).
es_un: A partir de Qiskit Nature v0.5, el algoritmo :class:`~qiskit.algorithms.minimum_eigensolvers.AdaptVQE` se ha migrado a Qiskit Terra (liberado en v0.22).
ja: Qiskit Nature v0.5 以降、 :class:`~qiskit.algorithms.minimum_eigensolvers.AdaptVQE` アルゴリズムは Qiskit Terra (v0.22 でのリリース) に移行されました。

source: This tutorial outlines how the algorithm can be used.
es_un: Este tutorial describe cómo se puede utilizar el algoritmo.
ja: このチュートリアルでは、アルゴリズムの使用方法について概説します。

source: We ensure the use of :class:`~qiskit.opflow.primitive_ops.PauliSumOp` (this is the default value of this setting for now but we enforce it here to ensure stability of this guide as long as the :class:`~qiskit.algorithms.minimum_eigensolvers.AdaptVQE` class is not yet guaranteed to handle the :class:`~qiskit.quantum_info.SparsePauliOp` successor properly):
es_un: Aseguramos el uso de :class:`~qiskit.opflow.primitive_ops.PauliSumOp` (este es el valor predeterminado de esta configuración por ahora, pero lo aplicamos aquí para garantizar la estabilidad de esta guía siempre que la clase :class:`~qiskit.algorithms.minimum_eigensolvers.AdaptVQE` aún no tenga la garantía de manejar el sucesor de :class:`~qiskit.quantum_info.SparsePauliOp` correctamente):
ja: :class:`~qiskit.opflow.primitive_ops.PauliSumOp` クラス を使用します (今のところ、この設定のデフォルトですが、:class:`~qiskit.algorithms.minimum_eigensolvers.AdaptVQE` クラスが :class:`~qiskit.quantum_info.SparsePauliOp` 後継を継承を適切に処理することがまだ保証されていない以上、安定性を確保するためここでは使用を強制します) ：

source: We obtain an :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem` which we want to solve:
es_un: Obtenemos un :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem` que queremos resolver:
ja: 解決したい :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem` クラスを取得します。

source: We setup our :class:`~qiskit_nature.second_q.mappers.QubitMapper`:
es_un: Configuramos nuestro :class:`~qiskit_nature.second_q.mappers.QubitMapper`:
ja: :class:`~qiskit_nature.second_q.mappers.QubitMapper` を設定します：

source: We setup our ansatz:
es_un: Configuramos nuestro ansatz:
ja: Ansatz をセットアップします:

source: We setup a :class:`~qiskit.algorithms.minimum_eigensolvers.VQE`:
es_un: Configuramos un :class:`~qiskit.algorithms.minimum_eigensolvers.VQE`:
ja: :class:`~qiskit.algorithms.minimum_eigensolvers.VQE` を設定します。

source: We setup the :class:`~qiskit.algorithms.minimum_eigensolvers.AdaptVQE`:
es_un: Configuramos el :class:`~qiskit.algorithms.minimum_eigensolvers.AdaptVQE`:
ja: :class:`~qiskit.algorithms.minimum_eigensolvers.AdaptVQE` を設定します。

source: We wrap everything in a :class:`~qiskit_nature.second_q.algorithms.GroundStateEigensolver`:
es_un: Encapsulamos todo en un :class:`~qiskit_nature.second_q.algorithms.GroundStateEigensolver`:
ja: :class:`~qiskit_nature.second_q.algorithms.GroundStateEigensolver` ですべてをラップします。

source: We solve the problem:
es_un: Resolvemos el problema:
ja: 問題を解きます:
