Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/howtos/vqe_ucc.po
Languages: es_un, ja

source: Use a UCC-like ansatz with a VQE
es_un: Usar un ansatz similar a UCC con un VQE
ja: VQEにおけるUCCのようなansatzの使用

source: When using a :class:`~qiskit_nature.second_q.circuit.library.UCC`-style ansatz with a :class:`~qiskit.algorithms.minimum_eigensolvers.VQE` one needs to pay particular attention to the :attr:`~qiskit.algorithms.minimum_eigensolvers.VQE.initial_point` attribute which indicates from which set of initial parameters the optimization routine should start. By default, VQE will start from a *random* initial point. In this how to we show how one can set a custom initial point instead (for example to guarantee that one starts from the Hartree-Fock state).
es_un: Cuando se utiliza un ansatz de estilo :class:`~qiskit_nature.second_q.circuit.library.UCC` con un :class:`~qiskit.algorithms.minimum_eigensolvers.VQE`, se debe prestar especial atención al atributo :attr:`~qiskit.algorithms.minimum_eigensolvers.VQE.initial_point` que indica a partir de qué conjunto de parámetros iniciales debe comenzar la rutina de optimización. Por defecto, VQE comenzará desde un punto inicial *aleatorio*. En este tutorial, mostramos cómo se puede establecer un punto inicial personalizado (por ejemplo, para garantizar que uno comience desde el estado Hartree-Fock).
ja: :class:`~qiskit.algorithms.minimum_eigensolvers.VQE` クラスで :class:`~qiskit_nature.second_q.circuit.library.UCC` スタイルのansatzを使用する場合、最適化ルーチンをどの初期パラメータセットから開始するかを示す :attr:`~qiskit.algorithms.minimum_eigensolvers.VQE.initial_point` 属性に特に注意する必要があります。デフォルトでは、VQEは *ランダム* な初期点からスタートします。このHow toでは、カスタム初期点を設定する方法を紹介します (例えば、Hartree-Fock状態から開始することを保証する場合など)。

source: We obtain an :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem` which we want to solve:
es_un: Obtenemos un :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem` que queremos resolver:
ja: 解決したい :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem` クラスを取得します。

source: We setup our :class:`~qiskit_nature.second_q.mappers.QubitMapper`:
es_un: Configuramos nuestro :class:`~qiskit_nature.second_q.mappers.QubitMapper`:
ja: :class:`~qiskit_nature.second_q.mappers.QubitMapper` を設定します：

source: We setup our ansatz:
es_un: Configuramos nuestro ansatz:
ja: Ansatz をセットアップします:

source: We setup a :class:`~qiskit.algorithms.minimum_eigensolvers.VQE`:
es_un: Configuramos un :class:`~qiskit.algorithms.minimum_eigensolvers.VQE`:
ja: :class:`~qiskit.algorithms.minimum_eigensolvers.VQE` を設定します。

source: Now comes the key step: choosing the initial point. Since we picked the :class:`~qiskit_nature.second_q.circuit.library.HartreeFock` initial state before, in order to ensure we start from that, we need to initialize our ``initial_point`` with all-zero parameters. One way to do that is like so:
es_un: Ahora viene el paso clave: elegir el punto inicial. Ya que elegimos el estado inicial de :class:`~qiskit_nature.second_q.circuit.library.HartreeFock` antes, para asegurarnos de que comenzamos desde eso, necesitamos inicializar nuestro ``initial_point`` con todos los parámetros todo en cero. Una forma de hacerlo es así:
ja: ここで重要なのが、初期点の選択です。:class:`~qiskit_nature.second_q.circuit.library.HartreeFock` を初期点に選んだので、それを確実にするためには、 `` initial_point`` をすべてゼロのパラメーターで初期化する必要があります。 その一つの方法は以下の通りです：

source: Alternatively, one can also use :class:`~qiskit_nature.second_q.algorithms.initial_points.HFInitialPoint` like so:
es_un: Alternativamente, también se puede usar :class:`~qiskit_nature.second_q.algorithms.initial_points.HFInitialPoint` así:
ja: また、次のように :class:`~qiskit_nature.second_q.algorithms.initial_points.HFInitialPoint` を使用することもできます：

source: This may seem like it is not adding a lot of benefit, but the key aspect here is that you can build your code on top of the :class:`~qiskit_nature.second_q.algorithms.initial_points.InitialPoint` interface based on which we also have the :class:`~qiskit_nature.second_q.algorithms.initial_points.MP2InitialPoint` which allows you to start from an MP2 starting point like so:
es_un: Puede parecer que esto no agrega muchos beneficios, pero el aspecto clave aquí es que puedes construir tu código sobre la interfaz :class:`~qiskit_nature.second_q.algorithms.initial_points.InitialPoint` en la que también tengamos el :class:`~qiskit_nature.second_q.algorithms.initial_points.MP2InitialPoint` que te permite comenzar desde un punto de inicio de MP2 así:
ja: 一見、あまり利点がないように見えるかもしれませんが、ここで重要なのは、 :class:`~qiskit_nature.second_q.algorithms.initial_points.InitialPoint` インターフェイスの上にコードを構築できることです。このベースは、 :class:`~qiskit_nature.second_q.algorithms.initial_points.MP2InitialPoint` クラスで、MP2スタート地点から以下のように始めることができます：

source: Finally, we can now actually solve our problem:
es_un: Finalmente, ahora podemos resolver nuestro problema:
ja: 最終的に、私たちの問題を解決できるようになりました。
