Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/apidocs.po
Languages: es_un

source: Qiskit Finance API Reference
es_un: Referencia de la API de Qiskit Finance

source: Qiskit's finance module (:mod:`qiskit_finance`)
es_un: Módulo de finanzas de Qiskit (:mod:` qiskit_finance `)

source: This is the Qiskit`s finance module. There is an initial set of function here that will be built out over time. At present it has applications in the form of Ising Hamiltonians and data providers which supply a source of financial data.
es_un: Este es el módulo de finanzas de Qiskit. Aquí hay un conjunto inicial de funciones que se irán ampliando con el tiempo. Actualmente tiene aplicaciones en forma de Hamiltonianos de Ising y proveedores de datos que suministran una fuente de datos financieros.

source: Class for errors returned by Qiskit's finance module.
es_un: Clase para errores devueltos por el módulo de finanzas de Qiskit.

source: In addition to standard Python errors Qiskit's finance module will raise this error if circumstances are that it cannot proceed to completion.
es_un: Además de los errores estándar de Python, el módulo de finanzas de Qiskit lanzará este error si las circunstancias son que no puede proceder a la finalización.

source: Submodules
es_un: Submódulos

source: Finance applications (:mod:`qiskit_finance.applications`)
es_un: Aplicaciones financieras (:mod:`qiskit_finance.applications`)

source: Data Providers (:mod:`qiskit_finance.data_providers`)
es_un: Proveedores de Datos (:mod:`qiskit_finance.data_providers`)

source: Applications for Qiskit's finance module.
es_un: Aplicaciones para el módulo de finanzas de Qiskit.

source: Optimization Applications
es_un: Aplicaciones de Optimización

source: Optimization application for the "portfolio optimization" [1] problem.
es_un: Aplicación de optimización para el problema de "optimización de cartera" [1].

source: Optimization application for the "portfolio diversification" problem introduced in [1].
es_un: Aplicación de optimización para el problema de "diversificación de cartera" introducido en [1].

source: Estimation Applications
es_un: Aplicaciones de Estimación

source: Estimation application for the European Call Option Delta.
es_un: Aplicación de estimación para la Opción de Compra Europea Delta.

source: Estimation application for the European Call Option Expected Value.
es_un: Aplicación de estimación para el Valor Esperado de la Opción de Compra Europea.

source: An estimation application for the fixed income pricing problem.
es_un: Una aplicación de estimación para el problema de los precios de renta fija.

source: A selection of providers for financial data. These may be backed by an external service that sources the actual data; please refer to the specific provider class below, for more information in that regard.
es_un: Una selección de proveedores de datos financieros. Estos pueden estar respaldados por servicios externos que proporcione los datos reales; por favor consulte la clase de proveedor específica a continuación para obtener más información al respecto.

source: Data Provider Base Class
es_un: Clase Base de Proveedores de Datos

source: The abstract base class for data_provider modules within Qiskit's finance module.
es_un: La clase base abstracta para módulos data_provider dentro del módulo de finanzas de Qiskit.

source: Data Provider Types
es_un: Tipos de Proveedores de Datos

source: Stock Market enum
es_un: enum del Mercado de Valores

source: Data Providers
es_un: Proveedores de Datos

source: NASDAQ Data on Demand data provider.
es_un: Proveedor de datos NASDAQ bajo demanda.

source: Exchange data provider.
es_un: Proveedor de datos cambiarios.

source: Wikipedia data provider.
es_un: Proveedor de datos de Wikipedia.

source: Yahoo data provider.
es_un: Proveedor de datos de Yahoo.

source: Pseudo-randomly generated mock stock-market data provider.
es_un: Proveedor de datos de mercado de valores simulado generado pseudoaleatoriamente.
