Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/getting_started.po
Languages: bn_bn, es_un, fr_fr, ja_jp, ko_kr, pt_un, ta_in, tr_tr, vi_vn

source: Getting started
bn_bn: শুরুর নির্দেশনা
es_un: Primeros Pasos
fr_fr: Premiers Pas
ja_jp: はじめに
ko_kr: 시작하기
pt_un: Primeiros passos
ta_in: தொடங்குதல்
tr_tr: Başlarken
vi_vn: Bắt đầu

source: Installation
bn_bn: স্থাপন (ইনস্টলেশন)
es_un: Instalación
ja_jp: インストール
ko_kr: 설치
pt_un: Instalação
ta_in: நிறுவல்
tr_tr: Kurulum
vi_vn: Cài đặt

source: Qiskit Finance depends on the main Qiskit package which has its own `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ detailing the installation options for Qiskit and its supported environments/platforms. You should refer to that first. Then the information here can be followed which focuses on the additional installation specific to Qiskit Finance.
bn_bn: Qiskit Finance মূল Qiskit প্যাকেজের উপর নির্ভর করে যার নিজস্ব `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ Qiskit এবং এর সমর্থিত পরিবেশ/প্ল্যাটফর্মগুলির জন্য ইনস্টলেশন বিকল্পগুলি বিশদ বর্ণনা করে। আপনার প্রথমে উল্লেখ করা উচিত। তারপরে এখানকার তথ্য অনুসরণ করা যেতে পারে যা Qiskit Finance এর সাথে সম্পর্কিত অতিরিক্ত ইনস্টলেশনকে কেন্দ্র করে।
es_un: Qiskit Finance depende del paquete principal de Qiskit, que tiene su propio `Qiskit Primeros Pasos <https://qiskit.org/documentation/getting_started.html>`__ que detalla las opciones de instalación de Qiskit y sus entornos/plataformas compatibles. Deberías referirte a eso primero. Luego, se puede seguir la información que está aquí, la cual se centra en la instalación adicional específica de Qiskit Finance.
fr_fr: Qiskit Finance dépend du paquet principal Qiskit qui a son propre `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ détaillant les options d'installation pour Qiskit et ses environnements/plates-formes pris en charge. Vous devriez d'abord y faire référence, puis vous pouvez suivre les informations ici qui se concentrent sur l'installation supplémentaire spécifique à Qiskit Finance.
ja_jp: Qiskit Financeは、Qiskit のインストール・オプションとそのサポート環境/プラットフォームを詳述した「`Qiskit はじめに <https://qiskit.org/documentation/getting_started.html>`__ 」にて説明された主要 Qiskit パッケージに依存しています。 まずそれを参照してください。次に、ここで説明する情報に従って、Qiskit Financeに固有の追加インストールをしましょう。
ko_kr: Qiskit Finance는 Qiskit및 지원되는 환경/플랫폼의 설치 옵션을 자세히 설명하는 `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ 를 가지고 있는 기본 Qiskit 패키지에 의존한다. 먼저 그것을 참고해야 한다. 그 후 Qiskit Finance의 추가 설치에 초점을 맞추는 이 내용을 따라라.
pt_un: O Qiskit Finance depende do pacote Qiskit principal que tem seu próprio `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ detalhando as opções de instalação para Qiskit e seus ambientes/plataformas suportados. Você deve se referir a isso primeiro. Em seguida, as informações aqui podem ser seguidas, as quais se concentram na instalação adicional específica para Qiskit Finance.
ta_in: Qiskit நிதி அதன் சொந்த Qiskit தொகுப்பைப் பொறுத்தது `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ Qiskit மற்றும் அதன் ஆதரவு சூழல்கள்/தளங்களுக்கான நிறுவல் விருப்பங்களை விவரித்தல். நீங்கள் அதை முதலில் குறிப்பிட வேண்டும்.Qiskit ஃபைனான்ஸுக்கு குறிப்பிட்ட கூடுதல் நிறுவலில் கவனம் செலுத்தும் தகவல்களை இங்கே பின்பற்றலாம்.
tr_tr: Qiskit Nature; Qiskit için kurulum seçeneklerini ve onun desteklenen ortam/platformlarını detaylandıran `Qiskit Başlarken <https://qiskit.org/documentation/getting_started.html>`__ adındaki kendi ana Qiskit paketine bağlıdır. Öncelikle buna bakmalısınız. Sonrasında, burada yer alan Qiskit Nature'a özgü ek kuruluma ilişkin bilgiler takip edilebilir.
vi_vn: Qiskit Finance phụ thuộc vào gói Qiskit chính sở hữu ' Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>` __ riêng, trình bày các lựa chọn cài đặt cho Qiskit và các môi trường/nền tảng được hỗ trợ của nó. Bạn nên tham khảo mục đó trước. Tiếp đó, các thông tin tập trung vào những cài đặt bổ sung cụ thể cho Qiskit Finance có thể được xem thêm tại đây.

source: Start locally
bn_bn: স্থানীয়ভাবে শুরু করা
es_un: Comenzar localmente
fr_fr: Démarrer localement
ja_jp: ローカルからの開始
ko_kr: 로컬에서 시작
pt_un: Iniciar localmente
ta_in: உள்ளூரில் தொடங்கவும்
tr_tr: Yerel Olarak Başlatmak
vi_vn: Bắt đầu cục bộ

source: The simplest way to get started is to follow the getting started 'Start locally' for Qiskit here `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
bn_bn: সহজ করে শুরু করার উপায় হল 'Start locally' থেকে শুরু করুন, `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
es_un: La forma más sencilla de empezar es seguir la introducción 'Comenzar localmente' para Qiskit que se encuentra aquí `Qiskit Primeros Pasos <https://qiskit.org/documentation/getting_started.html>`__
ko_kr: 시작할 수 있는 가장 간단한 방법은 Qiskit 에서 '로컬로 시작하기' `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__를 따르는 것이다.
pt_un: A maneira mais simples de começar é seguir o guia 'Iniciar localmente' para o Qiskit aqui `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
ta_in: தொடங்குவதற்கான எளிய வழி இங்கே கிஸ்கிட்டிற்கான 'உள்ளூரில் தொடங்கு' என்பதைப் பின்பற்றுவது `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
tr_tr: Başlamanın en kolay yolu, Qiskit için 'Yerel Olarak Başlatma' bölümünü buradan takip ederek başlamaktır: `Qiskit Başlarken <https://qiskit.org/documentation/getting_started.html>`__
vi_vn: Cách dễ nhất để bắt đầu là làm theo hướng dẫn mở đầu của "Bắt đầu cục bộ" dành cho Qiskit tại `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__

source: In your virtual environment where you installed Qiskit simply add ``finance`` to the extra list in a similar manner to how the extra ``visualization`` support is installed for Qiskit, i.e:
bn_bn: আপনার ভার্চুয়াল পরিবেশে যেখানে আপনি Qiskit ইনস্টল করেছেন, কিস্কিটের জন্য কীভাবে অতিরিক্ত ``visualization`` সাহায্যকারীটি ইনস্টল করা হয়েছে তার সাথে একইভাবে অতিরিক্ত তালিকায় ``finance`` যুক্ত করুন:
es_un: En tu entorno virtual donde instalaste Qiskit, simplemente agrega ``finance`` a la lista adicional de manera similar a cómo se instala el soporte adicional de ``visualization`` para Qiskit, es decir:
fr_fr: Dans votre environnement virtuel où vous avez installé Qiskit ajoutez simplement ``nature`` à la liste de dépendances optionnelles, de manière similaire à la façon dont le support de ``visualization`` est exprimé pour Qiskit, i.e :
ja_jp: Qiskit をインストールした仮想環境で、 Qiskit に追加の ``visualization`` サポートをインストールした方法と同様の方法で、以下のようにして追加リストに ``finance`` を追加してください:
ko_kr: Qiskit을 설치한 가상 환경에서 추가적인 ``visualization`` 지원을 설치한 방법과 마찬가지로 ``finance`` 를 단순히 추가 리스트에 추가한다.
pt_un: Em seu ambiente virtual onde você instalou o Qiskit, simplesmente adicione ``finance`` à lista extra de maneira semelhante a como o suporte extra ``visualization`` é instalado para o Qiskit, ou seja:
ta_in: நீங்கள் Qiskit டை நிறுவிய உங்கள் மெய்நிகர் சூழலில் ``finance`` ஐ கூடுதல் பட்டியலில் கூடுதல் ``visualization`` ஆதரவு எப்படி Qiskit காக நிறுவப்பட்டுள்ளது என்பதைப் போன்றது, அதாவது:
tr_tr: Qiskit'i kurduğunuz sanal ortamınızda, Qiskit için ekstra "görselleştirme" desteğinin nasıl kurulduğuna benzer şekilde, "finance"ı ekstra listeye eklemeniz yeterlidir, yani:
vi_vn: Trong môi trường ảo mà bạn đã cài đặt Qiskit, chỉ cần thêm ``finance`` vào danh sách bổ sung tương tự như cách cài đặt hỗ trợ bổ sung ``visualization`` cho Qiskit, nghĩa là:

source: It is worth pointing out that if you're a zsh user (which is the default shell on newer versions of macOS), you'll need to put ``qiskit[finance]`` in quotes:
bn_bn: মনে করিয়ে দেয়া প্রয়োজন, আপনি যদি zsh (macOS এর নতুনতর সংস্করণগুলোতে এটি পূর্বনির্ধারিত (ডিফল্ট) শেল) ব্যবহারকারী হয়ে থাকেন তাহলে আপনাকে উদ্ধৃতির মধ্যে ``qiskit[finance]`` লিখতে হবে:
es_un: Vale la pena señalar que si eres usuario de zsh (que es el shell predeterminado en las versiones más recientes de macOS), deberás poner ``qiskit[finance]`` entre comillas:
fr_fr: Il est utile de signaler que si vous êtes un utilisateur de zsh (qui est le shell par défaut sur les nouvelles versions de macOS), vous aurez besoin de mettre ``qiskit[finance]`` entre guillemets:
ja_jp: Zshユーザー（新しいバージョンのmacOSのデフォルトシェル）の場合は、 ``qiskit[finance]`` を引用符で囲む必要があります。
ko_kr: Zsh 사용자 (최신 버전의 macOS 기본 shell) 인 경우 ``qiskit[finance]`` 을 따옴표로 묶어야 한다:
pt_un: Vale a pena ressaltar que se você for um usuário zsh (que é o shell padrão nas versões mais recentes do macOS), você precisará usar ``qiskit[finance]`` entre aspas:
ta_in: நீங்கள் ஒரு zsh பயனராக இருந்தால் (இது MacOS இன் புதிய பதிப்புகளில் இயல்புநிலை ஷெல்) என்பதை நீங்கள் சுட்டிக்காட்ட வேண்டும் ``qiskit[finance]`` மேற்கோள்களில்:
tr_tr: Bir zsh kullanıcısıysanız (macOS'un daha yeni sürümlerinde varsayılan kabuktur), ``qiskit[finance]``ı tırnak içine koymanız gerekeceğini belirtmekte fayda var:
vi_vn: Một điều đáng lưu ý là nếu bạn là một người sử dụng zsh (shell mặc định trên các phiên bản mới hơn của macOS), bạn sẽ cần phải đặt ``qiskit[finance]`` vào trong dấu nháy đơn:

source: Install from source
bn_bn: উৎস থেকে স্থাপন
es_un: Instalar desde el código fuente
fr_fr: Installation à partir du code source
ja_jp: ソースからのインストール
ko_kr: 소스로부터 설치하기
pt_un: Instalando da Fonte
ta_in: மூலத்திலிருந்து நிறுவவும்
tr_tr: Kaynaktan Kurulum
vi_vn: Cài đặt từ nguồn

source: Installing Qiskit Finance from source allows you to access the most recently updated version under development instead of using the version in the Python Package Index (PyPI) repository. This will give you the ability to inspect and extend the latest version of the Qiskit Finance code more efficiently.
bn_bn: উৎস থেকে Qiskit Finance ইনস্টল করলে আপনি Qiskit এর উন্নয়নের অধীনে অতি সম্প্রতি আপডেট হওয়া সংস্করণটি ব্যবহার করতে পারবেন Python Package Index (PyPI) রিপোজিটরি থেকে ইনস্টল করার পরিবর্তে। এটি আপনাকে Qiskit Finance কোডের সর্বশেষ সংস্করণটি আরও নিখুঁত ভাবে পরিদর্শন করার এবং প্রসারিত করার দক্ষতা দেবে।.
es_un: La instalación de Qiskit Finance desde el código fuente te permite acceder a la versión actualizada más recientemente en desarrollo en lugar de usar la versión en el repositorio Python Package Index (PyPI). Esto te dará la capacidad de inspeccionar y ampliar la última versión del código de Finance de manera más eficiente.
fr_fr: L'installation de Qiskit Finance à partir des sources vous permet d'accéder à la dernière version mise à jour en cours de développement au lieu d'utiliser la version dans le dépôt Python Package Index (PyPI). Cela vous permettra d'inspecter et d'étendre plus efficacement la dernière version du code de Qiskit Finance.
ja_jp: ソースから Qiskit Financeをインストールすることにより、Python Package Index (PyPI) リポジトリーのバージョンを使う代わりに、最新の Qiskit バージョンにアクセスすることができます。これにより、Qiskit Financeコードの最新版を調査したり、拡張することがより効果的にできるようになります。
ko_kr: 소스 코드로부터 Qiskit Finance를 설치하는 것은 Python Package Index (PyPI) repository로 부터 설치하는 것 대신에 가장 최신에 업데이트된 버전을 사용하도록 해준다. 이를 통해 손쉽게 Qiskit Finance의 최신 코드를 들여다 보고 확장할 수 있다.
pt_un: A instalação do Qiskit Finance da fonte permite que você acesse a versão atualizada mais recentemente em desenvolvimento, em vez de usar a versão no repositório Python Package Index (PyPI). Isso lhe dará a capacidade de inspecionar e estender a versão mais recente do código Qiskit Finance com mais eficiência.
ta_in: மூலத்திலிருந்து Qiskit ஃபைனான்ஸை நிறுவுவது பைதான் பேக்கேஜ் இன்டெக்ஸ் (பைபிஐ) களஞ்சியத்தில் பதிப்பைப் பயன்படுத்துவதற்குப் பதிலாக, மேம்பாட்டில் உள்ள மிகச் சமீபத்திய மேம்படுத்தப்பட்ட பதிப்பை அணுக அனுமதிக்கிறது. இது Qiskit ஃபைனான்ஸ் குறியீட்டின் சமீபத்திய பதிப்பை மிகவும் திறமையாக ஆய்வு செய்து நீட்டிக்கும் திறனை உங்களுக்கு வழங்கும்.
tr_tr: Qiskit Finance'ı kaynaktan yüklemek, Python Paket Dizini (PyPI) deposundaki sürümü kullanmak yerine, geliştirilmekte olan en son güncellenen sürüme erişmenizi sağlar. Bu size Qiskit Finance kodunun en son sürümünü daha verimli bir şekilde inceleme ve genişletme kabiliyeti verecektir.
vi_vn: Cài đặt Qiskit Finance từ nguồn cho phép bạn truy cập phiên bản đang phát triển được cập nhật gần nhất thay vì sử dụng phiên bản trong kho lưu trữ Python Package Index (PyPI). Điều này sẽ giúp bạn kiểm tra và mở rộng code của phiên bản Qiskit Finance mới nhất một cách hiệu quả hơn.

source: Since Qiskit Finance depends on Qiskit, and its latest changes may require new or changed features of Qiskit, you should first follow Qiskit's `"Install from source"` instructions here `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
bn_bn: যেহেতু Qiskit Finance কিস্কিটের উপর নির্ভর করে, এবং এর সর্বশেষ পরিবর্তনগুলির জন্য কিস্কিটের নতুন বা পরিবর্তিত বৈশিষ্ট্যগুলির প্রয়োজন হতে পারে, তাই আপনাকে প্রথমে কিস্কিটের `"Install from source"` নির্দেশাবলী `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ এ অনুসরণ করতে হবে
es_un: Dado que Qiskit Finance depende de Qiskit, y sus últimos cambios pueden requerir funciones nuevas o modificadas de Qiskit, primero debes seguir las instrucciones de "Instalar desde el código fuente" de Qiskit aquí `Qiskit Primeros Pasos <https://qiskit.org/documentation/getting_started.html>`__
fr_fr: Étant donné que Qiskit Finance dépend de Qiskit, et que ses derniers changements peuvent nécessiter des fonctionnalités nouvelles ou modifiées de Qiskit, vous devriez d'abord suivre les instructions de Qiskit `"Installer à partir de la source"` ici `Qiskit pour commencer <https://qiskit.org/documentation/getting_started.html>`__
ja_jp: Qiskit Financeは Qiskit に依存しており、最新の変更が Qiskit の新規機能または変更された機能を必要とする場合があるので、まず「 `Qiskit はじめに <https://qiskit.org/documentation/getting_started.html>`__ 」の `「ソースからのインストール」` の指示に従ってください。
ko_kr: Qiskit Finance는 Qiskit에 의존하므로 최신 변경 사항에는 Qiskit의 새로운 기능이나 변경된 기능이 필요할 수 있다. 따라서 다음 문서에 있는 Qiskit의 `"Install from source"` 의 지시사항을 먼저 수행해야 한다: `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
pt_un: Uma vez que o Qiskit Finance depende do Qiskit, e suas últimas mudanças podem exigir recursos novos ou modificados do Qiskit, você deve primeiro seguir as instruções `"Install from source"` do Qiskit aqui `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
ta_in: Qiskit ஃபைனான்ஸ் Qiskit டைப் பொறுத்தது, மேலும் அதன் சமீபத்திய மாற்றங்களுக்கு Qiskit டின் புதிய அல்லது மாற்றப்பட்ட அம்சங்கள் தேவைப்படலாம், நீங்கள் முதலில் Qiskit டைப் பின்பற்ற வேண்டும் `"Install from source"`வழிமுறைகள் இங்கே `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
tr_tr: Qiskit Finance, Qiskit'e bağlı olduğundan ve onun son değişiklikleri Qiakit'in yeni ya da değiştirilmiş özelliklerini gerektirebileceğinden, ilk olarak burayı takip etmeniz gerekmektedir: `"Install from source"` instructions here `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
vi_vn: Do Qiskit Finance phụ thuộc vào Qiskit, và những thay đổi mới nhất của nó có thể sẽ yêu cầu các tính năng mới hoặc chỉnh sửa các tính năng của Qiskit, nên trước tiên bạn cần làm theo hướng dẫn `"Install from source"` của Qiskit tại `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__

source: Using the same development environment that you installed Qiskit in you are ready to install Qiskit Finance.
bn_bn: আপনি যেই কিস্কিট ইনস্টল করেছেন সেই একই কর্মপরিবেশ ব্যবহার করে আপনি Qiskit Finance ইনস্টল করতে প্রস্তুত।
es_un: Con el mismo entorno de desarrollo en el que instalaste Qiskit, estás listo para instalar Qiskit Finance.
fr_fr: En utilisant le même environnement de développement que celui où vous avez installé Qiskit, vous êtes prêt à installer Qiskit Finance.
ja_jp: Qiskit をインストールしたものと同じ開発環境を使用して、 Qiskit Financeをインストールすることができます。
ko_kr: Qiskit을 설치한 동일한 개발 환경을 사용하여 Qiskit Finance를 설치할 준비가 되었다.
pt_un: Usando o mesmo ambiente de desenvolvimento em que instalou o Qiskit, você está pronto para instalar o Qiskit Finance.
ta_in: நீங்கள் Qiskit டை நிறுவிய அதே மேம்பாட்டு சூழலைப் பயன்படுத்தி, Qiskit ஃபைனான்ஸை நிறுவத் தயாராக உள்ளீர்கள்.
tr_tr: Qiskit'i kurduğunuz aynı geliştirme ortamını kullanarak Qiskit Finance'ı kurmaya hazırsınız.
vi_vn: Bây giờ bạn đã sẵn sàng để cài đặt Qiskit Finance trên cùng môi trường phát triển mà bạn đã cài đặt Qiskit trước đó.

source: Clone the Qiskit Finance repository.
bn_bn: Qiskit Finance রিপোজিটরি প্রতিলিপি করুন।
es_un: Clonar el repositorio de Qiskit Finance.
fr_fr: Cloner le dépôt de Qiskit Finance.
ja_jp: Qiskit Financeリポジトリーをクローンします。
ko_kr: Qiskit Finance repository 복제하라.
pt_un: Clone o repositório Qiskit Finance.
ta_in: குளோன் தி Qiskit நிதி களஞ்சியம்.
tr_tr: Qiskit Finance deposunu klonla.
vi_vn: Nhân bản kho lưu trữ của Qiskit Finance.

source: Cloning the repository creates a local folder called ``qiskit-finance``.
bn_bn: রিপোজিটোরিটি ক্লোন করলে ``qiskit-finance`` নামক একটি স্থানীয় ফোল্ডার তৈরী হবে।
es_un: La clonación del repositorio crea un folder local llamado ``qiskit-finance``.
fr_fr: Cloner le dépôt crée un dossier local appelé ``qiskit-finance``.
ja_jp: リポジトリーをクローンすると、``qiskit-finance``という名前のローカル・フォルダが作成されます。
ko_kr: Repository 복제는 ``qiskit-finance`` 라는 이름의 로컬 폴더를 생성한다.
pt_un: Clonando o repositório cria-se um diretório local nomeado ``qiskit-finance``.
ta_in: களஞ்சியத்தை குளோனிங் செய்வது ``qiskit-finance`` என்ற உள்ளூர் கோப்புறையை உருவாக்குகிறது.
tr_tr: Depoyu klonlamak, ``qiskit-nature`` adında yerel bir klasör oluşturur.
vi_vn: Nhân bản kho lưu trữ sẽ tạo ra một thư mục cục bộ có tên ``qiskit-finance``.

source: If you want to run tests or linting checks, install the developer requirements.
bn_bn: টেস্ট রান করানোর জন্য বা লিনটিং চেক করার জন্য, ডেভেলাপারের রিকোয়ারমেন্টগুলি ইনস্টল করুন।
es_un: Si deseas ejecutar pruebas o verificaciones linting, instala los requerimientos del desarrollador.
fr_fr: Si vous souhaitez réaliser des tests ou faire de l'analyse de code source (linting), installez les pré-requis développeur.
ja_jp: もし、テストを実行したり文法をチェックしたい場合は、開発者向けライブラリーをインストールします。
ko_kr: 만약 테스트 코드를 실행하거나 철자법 검사를 하고자 한다면, 개발자 요구사항 라이브러리를 설치하라.
pt_un: Se você quiser executar testes ou análise de código, instale os requisitos de desenvolvedor.
ta_in: நீங்கள் சோதனைகளை இயக்க விரும்பினால் அல்லது சோதனைகள் நீக்கனால், உருவாக்குபவர் தேவைகளை நிறுவவும்.
tr_tr: Test veya linting (tiftikleme) kontrolleri yapmak istiyorsanız, geliştirici gereksinimlerini yükleyin.
vi_vn: Nếu bạn muốn chạy test hoặc linting, hãy cài đặt các yêu cầu dành cho nhà phát triển.

source: Install ``qiskit-finance``.
bn_bn: ``qiskit-finance`` ইনস্টল করুন।
es_un: Instalar ``qiskit-finance``.
fr_fr: Installez ``qiskit-finance``.
ja_jp: ``qiskit-finance`` をインストールします。
ko_kr: ``qiskit-finance`` 를 설치하라.
pt_un: Instale ``qiskit-finance``.
ta_in: ``qiskit-finance`` ஐ நிறுவவும்.
tr_tr: ``qiskit-finance`` yükleyin.
vi_vn: Cài đặt ``qiskit-finance``.

source: If you want to install it in editable mode, meaning that code changes to the project don't require a reinstall to be applied, you can do this with:
bn_bn: আপনি যদি এটিকে সম্পাদনযোগ্য মোডে ইনস্টল করতে চান, মানে এই প্রকল্পের কোড পরিবর্তনের জন্য প্রয়োগ করার জন্য পুনরায় ইনস্টল করা প্রয়োজন না, আপনি এটি করতে পারেন:
es_un: Si deseas instalarlo en modo editable, es decir que los cambios en el código del proyecto no requieran ser instalados de nuevo, puedes hacerlo con:
fr_fr: Pour une installation en mode éditable (les changements dans le code sont alors pris en compte sans besoin de réinstaller le projet), vous pouvez choisir cette commande :
ja_jp: 編集可能モード(プロジェクトのコードを変更しても再インストールする必要なし) でインストールする場合は、次の手順を実行します:
ko_kr: 만약, 프로젝트에 코드가 변화하였을 때 재설치가 필요하지 않는, 수정 가능한 모드로 설치하고자 한다면, 다음의 명령어를 사용하라.
pt_un: Se você quiser instalá-lo em modo editável, o que significa que as alterações de código no projeto não requerem que uma reinstalação seja aplicada, você pode fazer isso com:
ta_in: நீங்கள் அதை திருத்தக்கூடிய முறையில் நிறுவ விரும்பினால், அதாவது திட்டத்தில் குறியீடு மாற்றங்களை மீண்டும் நிறுவுதல் தேவையில்லை, நீங்கள் இதைச் செய்யலாம்:
tr_tr: Düzenlenebilir modda yüklemek istiyorsanız, yani projedeki kod değişikliklerinin yeniden yüklenmesi gerekmiyorsa, bunu şu şekilde yapabilirsiniz:
vi_vn: Nếu bạn muốn cài đặt ở chế độ có thể chỉnh sửa được, nghĩa là khi bạn thay đổi code trong project thì bạn không cần phải cài đặt lại, làm điều này bằng cách:

source: Ready to get going?...
bn_bn: আরো এগোতে প্রস্তুত?...
es_un: ¿Listo para empezar?...
fr_fr: Prêt à partir?...
ja_jp: 準備はいいですか？...
ko_kr: 시작할 준비가 다 되었다면...
pt_un: Pronto para começar?...
ta_in: செல்ல தயாரா?...
tr_tr: Başlamaya hazır mısınız?...
vi_vn: Bạn đã sẵn sàng khởi hành?...

source: The simplest way to get started is to follow the `getting started 'Start locally' guide for Qiskit <https://qiskit.org/documentation/getting_started.html>`__
ja_jp: 最も簡単な方法は「 `Qiskit はじめに <https://qiskit.org/documentation/getting_started.html>`__ 」の「ローカルで始める」のガイドを参照して開始することです。
