Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/tutorials.po
Languages: tr_tr

source: In addition, we add another ancilla variable for each time step and use additional comparators to check whether :math:`S_1`, respectively :math:`S_2`, exceed the barrier threshold :math:`B`. The payoff function is only applied if :math:`S_1, S_2 \leq B`.
tr_tr: Buna ek olarak, her bir zaman adımı için başka bir yardımcı değişken ekliyoruz ve sırasıyla :math:`S_1`, :math:`S_2`'in bariyer eşiği :math:`B`'yi geçip geçmediğini kontrol etmek için ek karşılaştırıcılar kullanıyoruz. Getiri fonksiyonu yalnızca :math:`S_1, S_2 \leq B` ise uygulanır.

source: The linear part itself is approximated as follows. We exploit the fact that :math:`\sin^2(y + \pi/4) \approx y + 1/2` for small :math:`|y|`. Thus, for a given approximation scaling factor :math:`c_\text{approx} \in [0, 1]` and :math:`x \in [0, 1]` we consider
tr_tr: Doğrusal kısma şu şekilde bir yaklaşımda bulunabiliriz. Küçük :math:`|y|` için :math:`\sin^2(y + \pi/4) \approx y + 1/2` durumundan faydalanabiliriz. Böylece, verilen yaklaştırım ölçeklendirme katsayısı :math:`c_\text{approx} \in [0, 1]` ve :math:`x \in [0, 1]` için aşağıdakini dikkate alırız

source: Next we use amplitude estimation to estimate the expected payoff. Note that this can take a while since we are simulating a large number of qubits. The way we designed the operator (asian_barrier_spread) implies that the number of actual state qubits is significantly smaller, thus, helping to reduce the overall simulation time a bit.
tr_tr: Ardından genlik tahminini kullanarak getiri fonksiyonunu tahmin ediyoruz. Çok sayıda kübiti simüle ettiğimiz için bunun biraz zaman alabileceğini unutmayın. Operatörü (asian_barrier_spread) tasarlama şeklimiz, gerçek durum kübitlerinin sayısının önemli ölçüde daha küçük olduğunu belirtir. Bu da toplam simülasyon süresini bir miktar azaltmaya yardımcı olur.

source: We seek to price a fixed-income asset knowing the distributions describing the relevant interest rates. The cash flows :math:`c_t` of the asset and the dates at which they occur are known. The total value :math:`V` of the asset is thus the expectation value of:
tr_tr: İlgili faiz oranlarını tanımlayan dağılımları bilerek sabit getirili bir varlığı fiyatlandırmaya çalışıyoruz. Varlığın nakit akışları :math:`c_t` ve bunların oluştuğu tarihler bilinmektedir. Varlığın toplam değeri :math:`V` bu nedenle aşağıdakilerin beklenen değeridir:

source: We construct a circuit factory to load a multivariate normal random distribution in :math:`d` dimensions into a quantum state. The distribution is truncated to a given box :math:`\otimes_{i=1}^d [low_i, high_i]` and discretized using :math:`2^{n_i}` grid points, where :math:`n_i` denotes the number of qubits used for dimension :math:`i = 1,\ldots, d`. The unitary operator corresponding to the circuit factory implements the following:
tr_tr: Bir kuantum durumuna :math:`d` boyutlarında çok değişkenli log-normal rastgele dağılımı yüklemek için bir devre fabrikası oluşturuyoruz. Dağılım, verilen bir :math:`\otimes_{i=1}^d [low_i, high_i]` kutuya indirgenir ve :math:`2^{n_i}` ızgara noktası kullanılarak ayrıştırılır. Burada :math:`n_i`, :math:`i = 1,\ldots, d` boyutunu temsil etmek için kulanılan kübit sayısını belirtir. Devre fabrikasına karşılık gelen üniter operatör aşağıdakini uygular:

source: where :math:`p_{i_1, ..., i_d}` denote the probabilities corresponding to the truncated and discretized distribution and where :math:`i_j` is mapped to the right interval :math:`[low_j, high_j]` using the affine map:
tr_tr: burada :math:`p_{i_1, ..., i_d}` indirgenmiş ve ayrıştırılmış dağılıma karşılık gelen olasılıkları belirtmektedir ve :math:`i_j` afin harita kullanılarak :math:`[low_j, high_j]` doğru aralığına eşlenmektedir:

source: In addition to the uncertainty model, we can also apply an affine map, e.g. resulting from a principal component analysis. The interest rates used are then given by:
tr_tr: Belirsizlik modeline ek olarak, bir afin harita da uygulayabiliriz (örneğin, temel bileşen analizinden elde edilir). Kullanılan faiz oranları daha sonra şu şekilde verilir:

source: where :math:`\vec{x} \in \otimes_{i=1}^d [low_i, high_i]` follows the given random distribution.
tr_tr: :math:`\vec{x} \in \otimes_{i=1}^d [low_i, high_i]` verilen rasgele dağılımı izler.

source: Cash flow, payoff function, and exact expected value
tr_tr: Nakit akışı, getiri fonksiyonu ve tam beklenen değer

source: In the following we define the cash flow per period, the resulting payoff function and evaluate the exact expected value.
tr_tr: Aşağıda dönem başına nakit akışını, sonuçta ortaya çıkan getiri fonksiyonunu tanımlıyor ve tam beklenen değeri değerlendiriyoruz.

source: For the payoff function we first use a first order approximation and then apply the same approximation technique as for the linear part of the payoff function of the `European Call Option <03_european_call_option_pricing.ipynb>`__.
tr_tr: Getiri fonksiyonu için, ilk olarak birinci dereceden bir yaklaşım kullanırız ve daha sonra, `European Call Option <03_european_call_option_pricing.ipynb>`__ 'in getiri fonksiyonunun doğrusal kısmı için olduğu gibi aynı yaklaşım tekniğini uygularız.

source: This tutorial shows how quantum algorithms can be used for credit risk analysis. More precisely, how Quantum Amplitude Estimation (QAE) can be used to estimate risk measures with a quadratic speed-up over classical Monte Carlo simulation. The tutorial is based on the following papers:
tr_tr: Bu eğitim belgesi, kuantum algoritmalarının kredi risk analizi için nasıl kullanılabileceğini gösterir. Daha iyi anlatmak gerekirse, klasik Monte Carlo simülasyonlarına karşılık kuadratik bir hızlanma ile risk ölçümlerini tahmin etmek için Kuantum Genlik Tahmini (QAE)'nin nasıl kullanılabileceğini gösterir. Eğitsel aşağıdaki makalelere dayanmaktadır:

source: A general introduction to QAE can be found in the following paper:
tr_tr: QAE'ye genel bir giriş şu makalede bulunabilir:

source: The structure of the tutorial is as follows:
tr_tr: Dersin yapısı şu şekildedir:

source: Problem Definition
tr_tr: Problem Tanımı

source: In this tutorial we want to analyze the credit risk of a portfolio of :math:`K` assets. The default probability of every asset :math:`k` follows a *Gaussian Conditional Independence* model, i.e., given a value :math:`z` sampled from a latent random variable :math:`Z` following a standard normal distribution, the default probability of asset :math:`k` is given by
tr_tr: Bu eğitim belgesinde, :math:`K` varlıktan oluşan bir portföyün kredi riskini analiz etmek istiyoruz. Her varlığın varsayılan olasılığı :math:`k`, bir *Gauss Koşullu Bağımsızlık* modelini takip eder, yani standart bir normal dağılımın ardından gizli bir rastgele değişken :math:`Z`den örneklenen bir :math:`z` değeri verildiğinde, varlığın varsayılan olasılığı :math:`k` aşağıdaki gibi verilir

source: where :math:`F` denotes the cumulative distribution function of :math:`Z`, :math:`p_k^0` is the default probability of asset :math:`k` for :math:`z=0` and :math:`\rho_k` is the sensitivity of the default probability of asset :math:`k` with respect to :math:`Z`. Thus, given a concrete realization of :math:`Z` the individual default events are assumed to be independent from each other.
tr_tr: burada :math:`F`, :math:`Z`nin kümülatif dağılım fonksiyonunu belirtir, :math:`p_k^0`, :math:`z=0` için :math:`k` varlığının varsayılan olasılığıdır ve :math:`\rho_k`, :math:`k` öğesinin varsayılan olasılığının :math:`Z`ye göre duyarlılığıdır. Böylece, :math:`Z`nin somut bir şekilde gerçekleşmesi göz önüne alındığında, her bir varsayılan olayın birbirinden bağımsız olduğu varsayılır.

source: We are interested in analyzing risk measures of the total loss
tr_tr: Toplam kaybın risk ölçümlerini analiz etmekle ilgileniyoruz

source: where :math:`\lambda_k` denotes the *loss given default* of asset :math:`k`, and given :math:`Z`, :math:`X_k(Z)` denotes a Bernoulli variable representing the default event of asset :math:`k`. More precisely, we are interested in the expected value :math:`\mathbb{E}[L]`, the Value at Risk (VaR) of :math:`L` and the Conditional Value at Risk of :math:`L` (also called Expected Shortfall). Where VaR and CVaR are defined as
tr_tr: burada :math:`\lambda_k`, :math:`k` öğesinin *temerrüt halinde kaybını* belirtir ve :math:`Z` verildiğinde, :math:`X_k(Z)` :math:`k`nin varsayılan olayını temsil eden bir Bernoulli değişkenini belirtir. Daha doğrusu, beklenen değer :math:`\mathbb{E}[L]`, :math:`L`nin Riske Maruz Değeri (VaR) ve :math:`L`nin Koşullu Riske Maruz Değeri (Beklenen Kayıp olarak da adlandırılır) ile ilgileniyoruz. VaR ve CVaR şu şekilde tanımlanır

source: with confidence level :math:`\alpha \in [0, 1]`, and
tr_tr: güven düzeyiyle :math:`\alpha \in [0, 1]`, and

source: The problem is defined by the following parameters: - number of qubits used to represent :math:`Z`, denoted by :math:`n_z` - truncation value for :math:`Z`, denoted by :math:`z_{\text{max}}`, i.e., Z is assumed to take :math:`2^{n_z}` equidistant values in :math:`\{-z_{max}, ..., +z_{max}\}` - the base default probabilities for each asset :math:`p_0^k \in (0, 1)`, :math:`k=1, ..., K` - sensitivities of the default probabilities with respect to :math:`Z`, denoted by :math:`\rho_k \in [0, 1)` - loss given default for asset :math:`k`, denoted by :math:`\lambda_k` - confidence level for VaR / CVaR :math:`\alpha \in [0, 1]`.
tr_tr: Sorun aşağıdaki parametrelerle tanımlanır: - :math:`Z`yi temsil etmek için kullanılan kübit sayısı, :math:`n_z` ile gösterilir - :math:`Z` için kesme değeri, :math:`z_{\text{max}}` ile gösterilir, yani Z'nin :math:`2^{n_z}` :math:`\{-z_{max}, ..., +z_{max}\ içinde eşit uzaklık değerleri aldığı varsayılır }` - her varlık için temel varsayılan olasılıklar :math:`p_0^k \in (0, 1)`, :math:`k=1, ..., K` - varsayılan olasılıkların : math:`Z`, :math:`\rho_k \in [0, 1)` ile gösterilir - varlık :math:`k` için varsayılan olarak verilen kayıp, :math:`\lambda_k` ile gösterilir - VaR için güven seviyesi / CVaR :math:`\alpha \in [0, 1]`.

source: We now construct a circuit that loads the uncertainty model. This can be achieved by creating a quantum state in a register of :math:`n_z` qubits that represents :math:`Z` following a standard normal distribution. This state is then used to control single qubit Y-rotations on a second qubit register of :math:`K` qubits, where a :math:`|1\rangle` state of qubit :math:`k` represents the default event of asset :math:`k`. The resulting quantum state can be written as
tr_tr: Şimdi belirsizlik modelini yükleyen bir devre oluşturuyoruz. Bu, standart bir normal dağılımın ardından :math:`Z`yi temsil eden :math:`n_z` kübitlerinin bir kaydında bir kuantum durumu yaratılarak başarılabilir. Bu durum daha sonra :math:`K` kübitlerinin ikinci bir kübit kaydındaki tek kübit Y-dönüşlerini kontrol etmek için kullanılır; burada :math:`|1\rangle` qubit :math:`k` durumu varsayılan olayı temsil eder varlığın :math:`k`. Ortaya çıkan kuantum durumu şu şekilde yazılabilir

source: where we denote by :math:`z_i` the :math:`i`-th value of the discretized and truncated :math:`Z` [Egger2019].
tr_tr: burada ayrıklaştırılmış ve kesilmiş :math:`Z` [Egger2019] öğesinin :math:`i`-ci değerini :math:`z_i` ile belirtiriz.

source: We now use the simulator to validate the circuit that constructs :math:`|\Psi\rangle` and compute the corresponding exact values for - expected loss :math:`\mathbb{E}[L]` - PDF and CDF of :math:`L` - value at risk :math:`VaR(L)` and corresponding probability - conditional value at risk :math:`CVaR(L)`
tr_tr: Şimdi, :math:`|\Psi\rangle` açısını oluşturan devreyi doğrulamak ve karşılık gelen tam değerleri hesaplamak için simülatörü kullanıyoruz - beklenen kayıp :math:`\mathbb{E}`\mathbb {E}[L]` - :math:`L`-değeri risk :math:` VaR(L)` ve karşılık gelen olasılık-koşullu değer risk :math:`CVaR(L)`

source: Expected Loss
tr_tr: Beklenen Kayıp

source: To estimate the expected loss, we first apply a weighted sum operator to sum up individual losses to total loss:
tr_tr: Beklenen kaybı tahmin etmek için, önce bireysel kayıpları toplam kayıpla toplamak için ağırlıklı bir toplam operatörü uygularız:

source: The required number of qubits to represent the result is given by
tr_tr: Sonucu temsil etmek için gereken kübit sayısı şu şekilde verilmektedir

source: Once we have the total loss distribution in a quantum register, we can use the techniques described in [Woerner2019] to map a total loss :math:`L \in \{0, ..., 2^{n_s}-1\}` to the amplitude of an objective qubit by an operator
tr_tr: Bir kuantum kaydındaki toplam kayıp dağılımını elde ettiğimiz zaman, [Woerner2019] 'de açıklanan teknikleri, toplam kaybı :math:`L \in \{ 0, ..., 2^{n_s}-1\}`i bir operatör tarafından yapılan bir amacın genleşmesine eşleştirmek için kullanabiliriz

source: which allows to run amplitude estimation to evaluate the expected loss.
tr_tr: beklenen kaybı değerlendirmek için genlik tahminini çalıştırmaya izin verir.

source: Create the state preparation circuit:
tr_tr: Durumu hazırlama devresini oluşturun:

source: Before we use QAE to estimate the expected loss, we validate the quantum circuit representing the objective function by just simulating it directly and analyzing the probability of the objective qubit being in the :math:`|1\rangle` state, i.e., the value QAE will eventually approximate.
tr_tr: Beklenen kaybı tahmin etmek için QAE'yi kullanmadan önce, sadece doğrudan simüle ederek ve objektif kübitin :math:`|1\rangle` durumunda, yani değerde olma olasılığını analiz ederek, amaç fonksiyonunu temsil eden kuantum devresini doğrularız. QAE sonunda yaklaşık olacaktır.

source: Next we run QAE to estimate the expected loss with a quadratic speed-up over classical Monte Carlo simulation.
tr_tr: Ardından, klasik Monte Carlo simülasyonu üzerinde ikinci dereceden bir hızlanma ile beklenen kaybı tahmin etmek için QAE'yi çalıştırıyoruz.

source: Cumulative Distribution Function
tr_tr: Kümülatif Dağılım Fonksiyonu

source: Instead of the expected loss (which could also be estimated efficiently using classical techniques) we now estimate the cumulative distribution function (CDF) of the loss. Classically, this either involves evaluating all the possible combinations of defaulting assets, or many classical samples in a Monte Carlo simulation. Algorithms based on QAE have the potential to significantly speed up this analysis in the future.
tr_tr: Beklenen kayıp yerine (klasik teknikler kullanılarak verimli bir şekilde tahmin edilebilir), şimdi kaybın kümülatif dağılım fonksiyonunu (CDF) tahmin ediyoruz. Klasik olarak, bu ya temerrüde düşen varlıkların tüm olası kombinasyonlarının ya da bir Monte Carlo simülasyonunda birçok klasik örneğin değerlendirilmesini içerir. QAE'ye dayalı algoritmalar, gelecekte bu analizi önemli ölçüde hızlandırma potansiyeline sahiptir.

source: To estimate the CDF, i.e., the probability :math:`\mathbb{P}[L \leq x]`, we again apply :math:`\mathcal{S}` to compute the total loss, and then apply a comparator that for a given value :math:`x` acts as
tr_tr: CDF'yi, yani :math:`\mathbb{P}[L \leq x]` ​​olasılığını tahmin etmek için, toplam kaybı hesaplamak için tekrar :math:`\mathcal{S}` uygularız ve ardından bir karşılaştırıcı uygularız belirli bir değer için :math:`x` şu işlevi görür

source: The resulting quantum state can be written as
tr_tr: Elde edilen kuantum durumu şu şekilde yazılabilir

source: where we directly assume the summed up loss values and corresponding probabilities instead of presenting the details of the uncertainty model.
tr_tr: burada belirsizlik modelinin ayrıntılarını sunmak yerine, özetlenen kayıp değerlerini ve karşılık gelen olasılıkları doğrudan varsayıyoruz.

source: The CDF(\ :math:`x`) equals the probability of measuring :math:`|1\rangle` in the objective qubit and QAE can be directly used to estimate it.
tr_tr: CDF(\ :math:`x`), objektif kübitte :math:`|1\rangle` ölçme olasılığına eşittir ve QAE bunu tahmin etmek için doğrudan kullanılabilir.

source: Again, we first use quantum simulation to validate the quantum circuit.
tr_tr: Yine, kuantum devresini doğrulamak için önce kuantum simülasyonunu kullanıyoruz.

source: Next we run QAE to estimate the CDF for a given :math:`x`.
tr_tr: Ardından, verilen bir : :math:`x` için CDF'yi tahmin etmek üzere QAE'yi çalıştırırız.

source: Value at Risk
tr_tr: Riske Maruz Değer

source: In the following we use a bisection search and QAE to efficiently evaluate the CDF to estimate the value at risk.
tr_tr: Aşağıda, risk altındaki değeri tahmin etmek için CDF'yi verimli bir şekilde değerlendirmek için bir ikiye bölme araması ve QAE kullanıyoruz.

source: Conditional Value at Risk
tr_tr: Risk Altındaki Koşullu Değer

source: Last, we compute the CVaR, i.e. the expected value of the loss conditional to it being larger than or equal to the VaR. To do so, we evaluate a piecewise linear objective function :math:`f(L)`, dependent on the total loss :math:`L`, that is given by
tr_tr: Son olarak, CVaR'yi hesaplıyoruz, yani VaR'den büyük veya ona eşit olmasına bağlı olarak kaybın beklenen değeri.Bunu yapmak için, toplam kayba bağlı olarak :math:`f(L)` parçalı doğrusal bir amaç fonksiyonunu değerlendiririz :math:`L` , tarafından verilen

source: To normalize, we have to divide the resulting expected value by the VaR-probability, i.e. \ :math:`\mathbb{P}[L \leq VaR]`.
tr_tr: Normalleştirmek için, elde edilen beklenen değeri VaR olasılığına bölmemiz gerekir, yani \ :math:`\mathbb{P}[L \leq VaR]`.

source: Next we run QAE to estimate the CVaR.
tr_tr: Ardından CVaR'ı tahmin etmek için QAE'yi çalıştırırız.

source: The Black-Scholes model assumes that the spot price at maturity :math:`S_T` for a European call option is log-normally distributed. Thus, we can train a qGAN on samples from a log-normal distribution and use the result as an uncertainty model underlying the option. In the following, we construct a quantum circuit that loads the uncertainty model. The circuit output reads
tr_tr: Black-Scholes modeli, bir Avrupa alım opsiyonu için vade sonundaki spot fiyatın :math:`S_T` log-normal olarak dağıldığını varsayar. Böylece, bir log-normal dağılımdan alınan örnekler üzerinde bir qGAN eğitebilir ve sonucu, seçeneğin altında yatan bir belirsizlik modeli olarak kullanabiliriz. Aşağıda, belirsizlik modelini yükleyen bir kuantum devresi oluşturuyoruz. Devre çıkışı okur

source: where the probabilities :math:`p_{\theta}^{j}`, for :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, represent a model of the target distribution.
tr_tr: burada :math:`p_{\theta}^{j}`, for :math:`j\in \left\{0, \ldots, {2^n-1} \right\}` olasılıkları, hedef dağılımın bir modelini temsil eder.

source: Now, the trained uncertainty model can be used to evaluate the expectation value of the option’s payoff function with Quantum Amplitude Estimation.
tr_tr: Şimdi, eğitimli belirsizlik modeli, opsiyonun getiri fonksiyonunun beklenti değerini Kuantum Genlik Tahmini ile ölçmek için kullanılabilir.

source: Plot the probability distribution
tr_tr: Olasılık dağılımını çizin

source: Next, we plot the trained probability distribution and, for reasons of comparison, also the target probability distribution.
tr_tr: Sonra, eğitilmiş olasılık dağılımını ve karşılaştırma amacıyla hedef olasılık dağılımını çiziyoruz.

source: Now, the trained uncertainty model can be used to evaluate the expectation value of the option’s payoff function analytically and with Quantum Amplitude Estimation.
tr_tr: Şimdi, eğitimli belirsizlik modeli, opsiyonun getiri fonksiyonunun beklenti değerini analitik olarak ve Kuantum Genlik Tahmini ile birlikte ölçmek için kullanılabilir.

source: Across many problems in finance, one starts with time series. Here, we showcase how to generate pseudo-random time-series, download actual stock-market time series from a number of common providers, and how to compute time-series similarity measures.
tr_tr: Finanstaki birçok problemlerin karşısında, birine zaman serileri ile başlanır. Burada, sahte rasgele zaman serilerinin nasıl oluşturulacağını, bir dizi ortak sağlayıcıdan gerçek borsa zaman serilerinin nasıl indirileceğini ve zaman serisi benzerlik ölçülerinin nasıl hesaplanacağını gösteriyoruz.

source: If you wish, you can look into the underlying pseudo-random time-series using. Please note that the private class members (starting with underscore) may change in future releases of Qiskit.
tr_tr: Dilerseniz altta yatan sahte-rastgele zaman serilerini kullanarak inceleyebilirsiniz. Özel sınıf üyelerinin (alt çizgi ile başlayan) Qiskit'in gelecek sürümlerinde değişebileceğini lütfen unutmayın.

source: Clearly, you can adapt the number and names of tickers and the range of dates:
tr_tr: Açıkça, kayıtların sayısını ve adlarını ve tarih aralığını uyarlayabilirsiniz:

source: Access to closing-price time-series
tr_tr: Kapanış fiyatı zaman serisine erişim

source: While the access to real-time data usually requires a payment, it is possible to access historical (adjusted) closing prices via Wikipedia and Quandl free of charge, following registration at: https://www.quandl.com/?modal=register In the code below, one needs to specify actual tickers of actual NASDAQ issues and the access token you obtain from Quandl; by running the code below, you agree to the Quandl terms and conditions, including a liability waiver. Notice that at least two tickers are required for the computation of covariance and time-series matrices, but hundreds of tickers may go beyond the fair usage limits of Quandl.
tr_tr: Gerçek zamanlı verilere erişim genellikle bir ödeme gerektirirken, https://www.quandl.com/?modal=register adresinden kayıt olduktan sonra, Wikipedia ve Quandl aracılığıyla tarihsel (düzeltilmiş) kapanış fiyatlarına ücretsiz olarak erişmek mümkündür: Aşağıdaki kodda, gerçek NASDAQ sorunlarının gerçek kayıtlarını ve Quandl'dan elde ettiğiniz erişim jetonunuzu belirtmeniz gerekir; Aşağıdaki kodu çalıştırarak, sorumluluktan feragat dahil Quandl hüküm ve koşullarını kabul etmiş olursunuz. Kovaryans ve zaman serisi matrislerinin hesaplanması için en az iki etiketin gerekli olduğuna dikkat edin, ancak yüzlerce etiketler Quandl'ın adil kullanım sınırlarının ötesine geçebilir.

source: Once the data are loaded, you can again compute the covariance matrix or its DTW variants.
tr_tr: Veriler yüklendikten sonra kovaryans matrisini veya onun DTW türevlerini tekrar hesaplayabilirsiniz.

source: If you wish, you can look into the underlying time-series using:
tr_tr: İsterseniz, aşağıdakileri kullanarak temel zaman serisine bakabilirsiniz:

source: [Optional] Setup token to access recent, fine-grained time-series
tr_tr: [Optional] En son, ayrıntılı zaman serilerine erişmek için kurulum belirteci

source: If you would like to download professional data, you will have to set-up a token with one of the major providers. Let us now illustrate the data with NASDAQ Data on Demand, which can supply bid and ask prices in arbitrary resolution, as well as aggregates such as daily adjusted closing prices, for NASDAQ and NYSE issues.
tr_tr: Eğer profesyonel verileri indirmek istiyorsanız, büyük sağlayıcılardan biriyle bir jeton ayarlamanız gerekecektir. Şimdi verileri, NASDAQ ve NYSE ihraçları için günlük olarak ayarlanmış kapanış fiyatları gibi toplamların yanı sıra, isteğe bağlı çözünürlükte alış ve satış fiyatları sağlayabilen NASDAQ talep üzerine verileri ile gösterelim.

source: If you don’t have NASDAQ Data on Demand license, you can contact NASDAQ (cf. https://business.nasdaq.com/intel/GIS/Nasdaq-Data-on-Demand.html) to obtain a trial or paid license.
tr_tr: NASDAQ Data on Demand lisansına sahip değilseniz, bir deneme veya ücretli lisans almak için NASDAQ (bkz. https://business.nasdaq.com/intel/GIS/Nasdaq-Data-on-Demand.html) ile iletişime geçebilirsiniz.
