Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/tutorials.po
Languages: tr_tr

source: If and when you have access to NASDAQ Data on Demand using your own token, you should replace REPLACE-ME below with the token. To assure the security of the connection, you should also have your own means of validating NASDAQ’s certificates. The DataOnDemandProvider constructor has an optional argument ``verify``, which can be ``None`` or a string or a boolean. If it is ``None``, certify certificates will be used (default). If verify is a string, it should be pointing to a certificate for the HTTPS connection to NASDAQ (dataondemand.nasdaq.com), either in the form of a CA_BUNDLE file or a directory wherein to look.
tr_tr: Eğer kendi jetonunuzu kullanarak NASDAQ Talep Üzerine Verilerine erişiminiz varsa, aşağıdaki REPLACE-ME'yi jetonuyla değiştirmelisiniz. Bağlantının güvenliğini sağlamak için NASDAQ sertifikalarını doğrulamak için kendi yöntemleriniz de olmalıdır. DataOnDemandProvider yapıcısı, ``None`` veya bir dize ya da boolean olabilen isteğe bağlı bir ``verify`` bağımsız değişkenine sahiptir. ``None`` ise, sertifika sertifikaları kullanılacaktır (varsayılan). Doğrulama bir dizeyse, NASDAQ'a (dataondemand.nasdaq.com) HTTPS bağlantısı için bir CA_BUNDLE dosyası veya aranacak bir dizin biçiminde bir sertifikaya işaret ediyor olmalıdır.

source: Another major vendor of stock market data is Exchange Data International (EDI), whose API can be used to query over 100 emerging and frontier markets that are Africa, Asia, Far East, Latin America and Middle East, as well as the more established ones. See: https://www.exchange-data.com/pricing-data/adjusted-prices.php#exchange-coverage for an overview of the coverage.
tr_tr: Borsa verilerinin bir başka önemli satıcısı, API'si Afrika, Asya, Uzak Doğu, Latin Amerika ve Orta Doğu'nun yanı sıra daha yerleşik 100'den fazla gelişmekte olan ve sınır pazarını sorgulamak için kullanılabilen Exchange Data International'dır (EDI). Kapsama genel bir bakış için bkz: https://www.exchange-data.com/pricing-data/adjusted-prices.php#exchange-coverage.

source: The access again requires a valid access token to replace REPLACE-ME below. The token can be obtained on a trial or paid-for basis at: https://www.quandl.com/
tr_tr: Erişim, aşağıdaki REPLACE-ME'yi değiştirmek için tekrar geçerli bir erişim işareti gerektirir. Erişim deneme amaçlı veya ücretli olarak şu adresten edinilebilir: https://www.quandl.com/

source: One can also access Yahoo Finance Data, no token needed, from Yahoo! Finance.
tr_tr: Ayrıca Yahoo Finans Verilerine, belirteç gerekmeden erişebilirsiniz, Yahoo! Finans.

source: For the actual use of the data, please see the portfolio_optimization or portfolio_diversification notebooks.
tr_tr: Verilerin fiili kullanımı için lütfen portfolio_optimization veya portfolio_diversification not defterlerine bakın.

source: Finance Tutorials
tr_tr: Finans Öğreticileri
