Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/tutorials.po
Languages: tr_tr

source: Step 1
tr_tr: 1. Adım

source: Instantiate the quantum optimizer class with parameters: - the similarity matrix ``rho``; - the number of assets and clusters ``n`` and ``q``;
tr_tr: Kuantum en iyileştirici sınıfını şu parametrelerle örnekleyin: - benzerlik matrisi ``rho``; - varlıkların ve kümelerin sayısı ``n`` ve ``q``;

source: Step 2
tr_tr: 2. Adım

source: Encode the problem as a binary formulation (IH-QP).
tr_tr: Problemi ikili formülasyon (IH-QP) olarak kodlayın.

source: Sanity check: make sure that the binary formulation in the quantum optimizer is correct (i.e., yields the same cost given the same solution).
tr_tr: Sağlama: kuantum en iyileyicideki ikili formülasyonun doğru olduğundan emin olun (yani, aynı çözüm verildiğinde aynı maliyet sonucunu vermeli).

source: Step 3
tr_tr: 3. Adım

source: Encode the problem as an Ising Hamiltonian in the Z basis.
tr_tr: Problemi Z bazında Ising Hamiltonyen olarak kodlayın.

source: Sanity check: make sure that the formulation is correct (i.e., yields the same cost given the same solution)
tr_tr: Sağlama: formülasyonun doğru olduğundan emin olun (yani, aynı çözüm verildiğinde aynı maliyeti sağlamalı)

source: Step 4
tr_tr: 4. Adım

source: Solve the problem via VQE. Notice that depending on the number of qubits, this can take a while: for 6 qubits it takes 15 minutes on a 2015 Macbook Pro, for 12 qubits it takes more than 12 hours. For longer runs, logging may be useful to observe the workings; otherwise, you just have to wait until the solution is printed.
tr_tr: Problemi VQE ile çözün. Kübit sayısına bağlı olarak bunun biraz zaman alabileceğine dikkat etmelisiniz: 6 kübit için 2015 Macbook Pro'da 15 dakika, 12 kübit için 12 saatten fazla sürer. Daha uzun süreli çalıştırmalarda, çalışmaları gözlemlemek için kayıt tutmak yararlı olabilir; aksi takdirde, çözüm yazdırılana kadar beklemeniz gerekir.

source: Step 5
tr_tr: 5. Adım

source: Visualize the solution
tr_tr: Çözümü görselleştirme

source: Solution shows the selected stocks via the stars and in green the links (via similarities) with other stocks that are represented in the fund by the linked stock. Keep in mind that VQE is a heuristic working on the QP formulation of the Ising Hamiltonian, though. For suitable choices of A, local optima of the QP formulation will be feasible solutions to the ILP. While for some small instances, as above, we can find optimal solutions of the QP formulation which coincide with optima of the ILP, finding optimal solutions of the ILP is harder than finding local optima of the QP formulation, in general. Even within the VQE, one may provide stronger guarantees, for specific variational forms (trial wave functions).
tr_tr: Çözüm, seçilen hisse senetlerini yıldızlarla ve bağlı hisse senedi ile fonda temsil edilen diğer hisse senetleriyle bağlantılarını (benzerlikler yoluyla) yeşil renkte gösterir. Yine de, VQE'nin Ising Hamiltonyen'in QP formülasyonunda buluşsal bir çalışma olduğunu unutmayınız. Uygun A seçimleri için, QP formülasyonunun yerel optimumları, ILP'ye yönelik uygun çözümler olacaktır. Yukarıdaki gibi bazı küçük örnekler için, ILP'nin optimumları ile örtüşen QP formülasyonunun optimal çözümlerini bulabilsek de, genel olarak, ILP'nin optimal çözümlerinin bulunması QP formülasyonunun optimal çözümlerinin bulunmasından daha zordur. VQE içinde bile, belirli değişimsel formlar için (deneme dalga fonksiyonları) daha güçlü güvenceler sağlanabilir.

source: Suppose a European call option with strike price :math:`K` and an underlying asset whose spot price at maturity :math:`S_T` follows a given random distribution. The corresponding payoff function is defined as:
tr_tr: Kullanım fiyatı :math:`K` olan bir Avrupa alım opsiyonu ve :math:`S_T` vadesindeki spot fiyatı belirli bir rasgele dağılımı izleyen bir dayanak varlık varsayalım. Karşılık gelen getiri fonksiyonu şu şekilde tanımlanır:

source: In the following, a quantum algorithm based on amplitude estimation is used to estimate the expected payoff, i.e., the fair price before discounting, for the option:
tr_tr: Aşağıda, beklenen getiriyi, yani indirimden önceki adil fiyatı tahmin etmek için genlik tahminine dayalı bir kuantum algoritması kullanılmaktadır:

source: as well as the corresponding :math:`\Delta`, i.e., the derivative of the option price with respect to the spot price, defined as:
tr_tr: ve karşılık gelen :math:`\Delta` da, yani opsiyon fiyatının spot fiyata göre türevi de, şöyle tanımlanır:

source: The approximation of the objective function and a general introduction to option pricing and risk analysis on quantum computers are given in the following papers:
tr_tr: Amaç fonksiyonun yaklaştırımı ve kuantum bilgisayarlarda opsiyon fiyatlamasına ve risk analizine genel bir giriş aşağıdaki makalelerde verilmiştir:

source: Uncertainty Model
tr_tr: Belirsizlik Modeli

source: We construct a circuit factory to load a log-normal random distribution into a quantum state. The distribution is truncated to a given interval :math:`[\text{low}, \text{high}]` and discretized using :math:`2^n` grid points, where :math:`n` denotes the number of qubits used. The unitary operator corresponding to the circuit factory implements the following:
tr_tr: Log-normal rasgele dağılımı bir kuantum durumuna yüklemek için bir devre fabrikası oluşturuyoruz. Dağılım, verilen bir :math:`[\text{low}, \text{high}]` aralığına indirgenir ve :math:`2^n` ızgara noktası kullanılarak ayıştırılır. Burada :math:`n` kulanılan kübit sayısını belirtir. Devre fabrikasına karşılık gelen üniter operatör aşağıdakini uygular:

source: where :math:`p_i` denote the probabilities corresponding to the truncated and discretized distribution and where :math:`i` is mapped to the right interval using the affine map:
tr_tr: burada :math:`p_i` indirgenmiş ve ayrıştırılmış dağılıma karşılık gelen olasılıkları belirtmektedir ve :math:`i` afin harita kullanılarak doğru aralık ile eşlenmektedir:

source: Payoff Function
tr_tr: Getiri Fonksiyonu

source: The payoff function equals zero as long as the spot price at maturity :math:`S_T` is less than the strike price :math:`K` and then increases linearly. The implementation uses a comparator, that flips an ancilla qubit from :math:`\big|0\rangle` to :math:`\big|1\rangle` if :math:`S_T \geq K`, and this ancilla is used to control the linear part of the payoff function.
tr_tr: :math:`S_T` vadesindeki spot fiyat, kullanım fiyatı :math:`K`'dan düşük olduğu sürece, getiri fonksiyonu sıfıra eşittir. Sonrasında da doğrusal olarak artış gösterir. Uygulama, :math:`S_T \geq K` ise bir yardımcı kübiti :math:`\big|0\rangle`'dan :math:`\big|1\rangle`'e çeviren bir karşılaştırıcı kullanır ve bu yardımcı, getiri fonksiyonunun doğrusal kısmını kontrol etmek için kullanılır.

source: The linear part itself is then approximated as follows. We exploit the fact that :math:`\sin^2(y + \pi/4) \approx y + 1/2` for small :math:`|y|`. Thus, for a given approximation rescaling factor :math:`c_\text{approx} \in [0, 1]` and :math:`x \in [0, 1]` we consider
tr_tr: Doğrusal kısma şu şekilde bir yaklaşımda bulunabiliriz. Küçük :math:`|y|` için :math:`\sin^2(y + \pi/4) \approx y + 1/2` durumundan faydalanabiliriz. Böylece, verilen yaklaştırım ölçeklendirme katsayısı :math:`c_\text{approx} \in [0, 1]` ve :math:`x \in [0, 1]` için aşağıdakini dikkate alırız

source: We can easily construct an operator that acts as
tr_tr: Şu şekilde davranan bir operatörü kolayca oluşturabiliriz

source: using controlled Y-rotations.
tr_tr: kontrollü Y-rotasyonları kullanarak.

source: Eventually, we are interested in the probability of measuring :math:`\big|1\rangle` in the last qubit, which corresponds to :math:`\sin^2(a*x+b)`. Together with the approximation above, this allows to approximate the values of interest. The smaller we choose :math:`c_\text{approx}`, the better the approximation. However, since we are then estimating a property scaled by :math:`c_\text{approx}`, the number of evaluation qubits :math:`m` needs to be adjusted accordingly.
tr_tr: Sonunda, :math:`\sin^2(a*x+b)`ye karşılık gelen son kübitte :math:`\big|1\rangle`yi ölçme olasılığıyla ilgileniyoruz. Yukarıdaki yaklaştırımla birlikte, bu, ilgilenilen değerlerin yaklaşık olarak tahmin edilmesine izin vermektedir. :math:`c_\text{approx}`u ne kadar küçük seçersek, yaklaşım o kadar iyi olur. Bununla birlikte, daha sonra :math:`c_\text{approx}` ile ölçeklenen bir özelliği tahmin ettiğimiz için, değerlendirme kübit sayısı :math:`m`nin buna göre ayarlanması gerekir.

source: Evaluate Expected Payoff
tr_tr: Beklenen Getirileri Değerlendir

source: Instead of constructing these circuits manually, Qiskit’s finance module offers the ``EuropeanCallPricing`` circuit, which already implements this functionality as building block.
tr_tr: Bu devreleri manuel olarak oluşturmak yerine, Qiskit'in finans modülü bu işlevi hali hazırda yapı taşı olarak uygulayan ``EuropeanCallPricing`` devresini sunmaktadır.

source: Evaluate Delta
tr_tr: Delta'yı Değerlendir

source: The Delta is a bit simpler to evaluate than the expected payoff. Similarly to the expected payoff, we use a comparator circuit and an ancilla qubit to identify the cases where :math:`S_T > K`. However, since we are only interested in the probability of this condition being true, we can directly use this ancilla qubit as the objective qubit in amplitude estimation without any further approximation.
tr_tr: Delta'yı değerlendirmek, beklenen getiriden biraz daha basittir. Beklenen getiriye benzer şekilde, :math:`S_T > K`'nın bulunduğu durumları tanımlamak için bir karşılaştırıcı devre ve bir yardımcı kübit kullanıyoruz. Bununla birlikte, sadece bu koşulun doğru olma olasılığıyla ilgilendiğimiz için, bu yardımcı kübiti, daha fazla yaklaşıma gerek olmadan, genlik tahmininde hedef kübit olarak doğrudan kullanabiliriz.

source: Suppose a European put option with strike price :math:`K` and an underlying asset whose spot price at maturity :math:`S_T` follows a given random distribution. The corresponding payoff function is defined as:
tr_tr: Kullanım fiyatı :math:`K` olan bir Avrupa satım opsiyonu ve :math:`S_T` vadesindeki spot fiyatı belirli bir rasgele dağılımı izleyen bir dayanak varlık varsayalım. Karşılık gelen getiri fonksiyonu şu şekilde tanımlanır:

source: The payoff function decreases linearly with an increasing spot price at maturity :math:`S_T` until it reaches zero for a spot price equal to the strike price :math:`K`, it stays constant to zero for larger spot prices. The implementation uses a comparator, that flips an ancilla qubit from :math:`\big|0\rangle` to :math:`\big|1\rangle` if :math:`S_T \leq K`, and this ancilla is used to control the linear part of the payoff function.
tr_tr: Getiri fonksiyonu, :math:`S_T` vadesinde artan bir spot fiyatla, kullanım fiyatı :math:`K`'ya eşit bir spot fiyat için sıfıra ulaşana kadar doğrusal olarak azalır, daha büyük spot fiyatlar için sıfıra sabit kalır. Uygulama, :math:`S_T \leq K` ise bir yardımcı kübiti :math:`\big|0\rangle`'dan :math:`\big|1\rangle`'e çeviren bir karşılaştırıcı kullanır ve bu yardımcı, getiri fonksiyonunun doğrusal kısmını kontrol etmek için kullanılır.

source: The linear part itself is then approximated as follows. We exploit the fact that :math:`\sin^2(y + \pi/4) \approx y + 1/2` for small :math:`|y|`. Thus, for a given approximation rescaling scaling factor :math:`c_\text{approx} \in [0, 1]` and :math:`x \in [0, 1]` we consider
tr_tr: Doğrusal kısma şu şekilde bir yaklaşımda bulunabiliriz. Küçük :math:`|y|` için :math:`\sin^2(y + \pi/4) \approx y + 1/2` durumundan faydalanabiliriz. Böylece, verilen ölçeklendirme katsayısı :math:`c_\text{approx} \in [0, 1]` ve :math:`x \in [0, 1]` için aşağıdakini dikkate alırız

source: The Delta is a bit simpler to evaluate than the expected payoff. Similarly to the expected payoff, we use a comparator circuit and an ancilla qubit to identify the cases where :math:`S_T \leq K`. However, since we are only interested in the (negative) probability of this condition being true, we can directly use this ancilla qubit as the objective qubit in amplitude estimation without any further approximation.
tr_tr: Delta'yı değerlendirmek, beklenen getiriden biraz daha basittir. Beklenen getiriye benzer şekilde, :math:`S_T \leq K`'nın bulunduğu durumları tanımlamak için bir karşılaştırıcı devre ve bir yardımcı kübit kullanıyoruz. Bununla birlikte, sadece bu koşulun doğru olma olasılığıyla (negatif) ilgilendiğimiz için, bu yardımcı kübiti, daha fazla yaklaşıma gerek olmadan, genlik tahmininde hedef kübit olarak doğrudan kullanabiliriz.

source: The payoff function equals zero as long as the spot price at maturity :math:`S_T` is less than the strike price :math:`K_1`, then increases linearly, and is bounded by :math:`K_2`. The implementation uses two comparators, that flip an ancilla qubit each from :math:`\big|0\rangle` to :math:`\big|1\rangle` if :math:`S_T \geq K_1` and :math:`S_T \leq K_2`, and these ancillas are used to control the linear part of the payoff function.
tr_tr: :math:`S_T` vadesindeki spot fiyat, kullanım fiyatı :math:`K_1`den düşük olduğu sürece, getiri fonksiyonu sıfıra eşittir. Sonrasında da doğrusal olarak artış gösterir ve :math:`K_2` ile sınırlıdır. Uygulama, eğer :math:`S_T \geq K_1` ve :math:`S_T \leq K_2` ise, her biri için bir yardımcı kübiti :math:`\big|0\rangle`dan :math:`\big|1\rangle`e çeviren iki karşılaştırıcı kullanır ve bu yardımcılar, getiri fonksiyonunun doğrusal kısmını kontrol etmek için kullanılır.

source: for small :math:`c_\text{approx}`.
tr_tr: küçük :math:`c_\text{approx}` için.

source: The Delta is a bit simpler to evaluate than the expected payoff. Similarly to the expected payoff, we use comparator circuits and ancilla qubits to identify the cases where :math:`K_1 \leq S_T \leq K_2`. However, since we are only interested in the probability of this condition being true, we can directly use an ancilla qubit as the objective qubit in amplitude estimation without any further approximation.
tr_tr: Delta'yı değerlendirmek, beklenen getiriden biraz daha basittir. Beklenen getiriye benzer şekilde, :math:`K_1 \leq S_T \leq K_2`'nın bulunduğu durumları tanımlamak için karşılaştırıcı devreler ve yardımcı kübitler kullanıyoruz. Bununla birlikte, sadece bu koşulun doğru olma olasılığıyla ilgilendiğimiz için, bu yardımcı kübiti, daha fazla yaklaşıma gerek olmadan, genlik tahmininde hedef kübit olarak doğrudan kullanabiliriz.

source: Suppose a basket option with strike price :math:`K` and two underlying assets whose spot price at maturity :math:`S_T^1`, :math:`S_T^2` follow given random distributions. The corresponding payoff function is defined as:
tr_tr: Kullanım fiyatı :math:`K` olan bir sepet opsiyonu ve :math:`S_T^1`, :math:`S_T^2` vadelerindeki spot fiyatları belirli bir rasgele dağılımı izleyen iki dayanak varlık varsayalım. Karşılık gelen getiri fonksiyonu şu şekilde tanımlanır:

source: We construct a circuit factory to load a multivariate log-normal random distribution into a quantum state on :math:`n` qubits. For every dimension :math:`j = 1,\ldots,d`, the distribution is truncated to a given interval :math:`[\text{low}_j, \text{high}_j]` and discretized using :math:`2^{n_j}` grid points, where :math:`n_j` denotes the number of qubits used to represent dimension :math:`j`, i.e., :math:`n_1+\ldots+n_d = n`. The unitary operator corresponding to the circuit factory implements the following:
tr_tr: :math:`n` kübitlik bir kuantum durumuna çok değişkenli log-normal rastgele dağılımı yüklemek için bir devre fabrikası oluşturuyoruz. Her bir :math:`j = 1,\ldots,d` boyutu için dağılım, verilen bir :math:`[\text{low}_j, \text{high}_j]` aralığına indirgenir ve :math:`2^{n_j}` ızgara noktası kullanılarak ayıştırılır. Burada :math:`n_j`, :math:`j`, yani, :math:`n_1+\ldots+n_d = n` boyutunu temsil etmek için kulanılan kübit sayısını belirtir. Devre fabrikasına karşılık gelen üniter operatör aşağıdakini uygular:

source: where :math:`p_{i_1\ldots i_d}` denote the probabilities corresponding to the truncated and discretized distribution and where :math:`i_j` is mapped to the right interval using the affine map:
tr_tr: burada :math:`p_{i_1\ldots i_d}` indirgenmiş ve ayrıştırılmış dağılıma karşılık gelen olasılıkları belirtmektedir ve :math:`i_j` afin harita kullanılarak doğru aralık ile eşlenmektedir:

source: For simplicity, we assume both stock prices are independent and identically distributed. This assumption just simplifies the parametrization below and can be easily relaxed to more complex and also correlated multivariate distributions. The only important assumption for the current implementation is that the discretization grid of the different dimensions has the same step size.
tr_tr: Basitleştirmek adına, her iki hisse senedi fiyatının da bağımsız ve aynı şekilde dağılmış olduğunu varsayıyoruz. Bu varsayım, aşağıdaki parametrik hale getirme işlemini basitleştirmektedir ve daha karmaşık ve aynı zamanda birbiriyle ilişkili çok değişkenli dağılımlara kolayca esnetilebilmektedir. Mevcut uygulama için tek önemli varsayım, farklı boyutların ayrıştırma ızgarasının aynı adım büyüklüğüne sahip olmasıdır.

source: The payoff function equals zero as long as the sum of the spot prices at maturity :math:`(S_T^1 + S_T^2)` is less than the strike price :math:`K` and then increases linearly. The implementation first uses a weighted sum operator to compute the sum of the spot prices into an ancilla register, and then uses a comparator, that flips an ancilla qubit from :math:`\big|0\rangle` to :math:`\big|1\rangle` if :math:`(S_T^1 + S_T^2) \geq K`. This ancilla is used to control the linear part of the payoff function.
tr_tr: :math:`(S_T^1 + S_T^2)` vadesindeki spot fiyatların toplamı, kullanım fiyatı :math:`K`den düşük olduğu sürece, getiri fonksiyonu sıfıra eşittir. Sonrasında da doğrusal olarak artış gösterir. Uygulama ilk önce spot fiyatların toplamını yardımcı bir yazmaçta hesaplamak için ağırlıklı toplam operatörü kullanır. Ardından, :math:`(S_T^1 + S_T^2) \geq K` ise, yardımcı bir kübiti :math:`\big|0\rangle`dan :math:`\big|1\rangle`e çeviren bir karşılaştırıcı kullanır. Bu yardımcı, getiri fonksiyonunun doğrusal kısmını kontrol etmek için kullanılır.

source: The linear part itself is approximated as follows. We exploit the fact that :math:`\sin^2(y + \pi/4) \approx y + 1/2` for small :math:`|y|`. Thus, for a given approximation rescaling factor :math:`c_\text{approx} \in [0, 1]` and :math:`x \in [0, 1]` we consider
tr_tr: Doğrusal kısma şu şekilde bir yaklaşımda bulunabiliriz. Küçük :math:`|y|` için :math:`\sin^2(y + \pi/4) \approx y + 1/2` durumundan faydalanabiliriz. Böylece, verilen yaklaştırım ölçeklendirme katsayısı :math:`c_\text{approx} \in [0, 1]` ve :math:`x \in [0, 1]` için aşağıdakini dikkate alırız

source: Since the weighted sum operator (in its current implementation) can only sum up integers, we need to map from the original ranges to the representable range to estimate the result, and reverse this mapping before interpreting the result. The mapping essentially corresponds to the affine mapping described in the context of the uncertainty model above.
tr_tr: Ağırlıklı toplam operatörü (mevcut uygulamasında olan) yalnızca tam sayıları toplayabileceğinden, sonucu tahmin etmek için orijinal aralıklardan temsil edilebilir aralığa eşleştirmemiz ve sonucu yorumlamadan önce bu eşleştirmeyi tersine çevirmemiz gerekmektedir. Eşleme, esasen, yukarıdaki belirsizlik modeli bağlamında açıklanan afin eşlemeye karşılık gelir.

source: We first verify the quantum circuit by simulating it and analyzing the resulting probability to measure the :math:`|1\rangle` state in the objective qubit.
tr_tr: Kuantum devresini simüle edip ortaya çıkan nesnel kübitteki :math:`|1\rangle` durumunun ölçülme olasılığını analiz ederek önce devreyi doğrularız.

source: Next we use amplitude estimation to estimate the expected payoff.
tr_tr: Ardından genlik tahminini kullanarak getiri fonksiyonunu tahmin ederiz.

source: An Asian barrier spread is a combination of 3 different option types, and as such, combines multiple possible features that the Qiskit Finance option pricing framework supports:
tr_tr: Bir Asya bariyer yayılımı 3 farklı opsiyon tipinin birleşimidir. Bu bakımdan Qiskit Finance opsiyon fiyatlaması çerçevesinin desteklediği birçok olası özelliği birleştirir:

source: Suppose strike prices :math:`K_1 < K_2` and time periods :math:`t=1,2`, with corresponding spot prices :math:`(S_1, S_2)` following a given multivariate distribution (e.g. generated by some stochastic process), and a barrier threshold :math:`B>0`. The corresponding payoff function is defined as
tr_tr: Kullanım fiyatlarını :math:`K_1 < K_2` ve zaman periyotlarını :math:`t=1,2`, bunlara karşılık gelen, verilen çok değişkenli bir dağılımını izleyen spot fiyatlarını :math:`(S_1, S_2)` (örneğin herhangi bir stokastik süreç tarafından üretilen) ve bariyer eşiğini :math:`B>0` varsayalım. Karşılık gelen getiri fonksiyonu şu şekilde tanımlanır

source: In the following, a quantum algorithm based on amplitude estimation is used to estimate the expected payoff, i.e., the fair price before discounting, for the option
tr_tr: Aşağıda, beklenen getiriyi, yani indirimden önceki adil fiyatı tahmin etmek için genlik tahminine dayalı bir kuantum algoritması kullanılmaktadır

source: For simplicity, we consider the sum of the spot prices instead of their average. The result can be transformed to the average by just dividing it by 2.
tr_tr: Basitleştirmek adına, ortalamaları yerine spot fiyatların toplamını dikkate alıyoruz. Sonuç sadece 2'ye bölünerek ortalamaya dönüştürülebilir.

source: The payoff function equals zero as long as the sum of the spot prices :math:`(S_1 + S_2)` is less than the strike price :math:`K_1` and then increases linearly until the sum of the spot prices reaches :math:`K_2`. Then payoff stays constant to :math:`K_2 - K_1` unless any of the two spot prices exceeds the barrier threshold :math:`B`, then the payoff goes immediately down to zero. The implementation first uses a weighted sum operator to compute the sum of the spot prices into an ancilla register, and then uses a comparator, that flips an ancilla qubit from :math:`\big|0\rangle` to :math:`\big|1\rangle` if :math:`(S_1 + S_2) \geq K_1` and another comparator/ancilla to capture the case that :math:`(S_1 + S_2) \geq K_2`. These ancillas are used to control the linear part of the payoff function.
tr_tr: :math:`(S_1 + S_2)` spot fiyatların toplamı, kullanım fiyatı :math:`K_1`den düşük olduğu sürece, getiri fonksiyonu sıfıra eşittir. Sonrasında da spot fiyatların toplamı :math:`K_2` ulaşana kadar doğrusal olarak artış gösterir. Daha sonra iki spot fiyattan biri :math:`B` bariyer eşiğini geçmediği sürece getiri, :math:`K_2 - K_1`e sabit kalır, ardından getiri hemen sıfıra düşer. Uygulama ilk önce spot fiyatların toplamını yardımcı bir yazmaçta hesaplamak için ağırlıklı toplam operatörü kullanır. Ardından, :math:`(S_1 + S_2) \geq K_1` ise, yardımcı bir kübiti :math:`\big|0\rangle`'dan :math:`\big|1\rangle`e çeviren bir karşılaştırıcı kullanır. :math:`(S_1 + S_2) \geq K_2` durumunu tutmak için de başka bir karşılaştırıcı/yardımcı kullanır. Bu yardımcılar, getiri fonksiyonunun doğrusal kısmını kontrol etmek için kullanılır.
