Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/tutorials.po
Languages: tr_tr

source: Run interactively in jupyter notebook.
tr_tr: Jupyter not defterinde interaktif olarak çalıştırın.

source: Introduction
tr_tr: Giriş

source: This tutorial shows how to solve the following mean-variance portfolio optimization problem for :math:`n` assets:
tr_tr: Bu eğitici belge, :math:`n` varlıkları için aşağıdaki ortalama varyans portföy optimizasyon probleminin nasıl çözüleceğini gösterir:

source: where we use the following notation:
tr_tr: burada aşağıdaki gösterimi kullanırız:

source: :math:`x \in \{0, 1\}^n` denotes the vector of binary decision variables, which indicate which assets to pick (:math:`x[i] = 1`) and which not to pick (:math:`x[i] = 0`),
tr_tr: :math:`x \in \{0, 1\}^n` ikili karar değişkenlerin vektörünü temsil eder, hangi varlıkların seçileceğini (:math:`x[i] = 1`) ve hangilerinin seçilmeyeceğini (:math:`x[i] = 0`) gösterir,

source: :math:`\mu \in \mathbb{R}^n` defines the expected returns for the assets,
tr_tr: :math:`\mu \in \mathbb{R}^ n` varlıkları için beklenen geri dönüşü tanımlar,

source: :math:`\Sigma \in \mathbb{R}^{n \times n}` specifies the covariances between the assets,
tr_tr: :math:`\Sigma \in \mathbb{R}^{n \times n}` varlıklar arasındaki kovaryansı belirler,

source: :math:`q > 0` controls the risk appetite of the decision maker,
tr_tr: :math:`q > 0` karar vericinin risk isteğini kontrol eder,

source: and :math:`B` denotes the budget, i.e. the number of assets to be selected out of :math:`n`.
tr_tr: ve :math:`B`, bütçeyi, yani :math:`n` dışında seçilecek varlıkların sayısını belirtir.

source: We assume the following simplifications: - all assets have the same price (normalized to 1), - the full budget :math:`B` has to be spent, i.e. one has to select exactly :math:`B` assets.
tr_tr: Şu sadeleştirmelerin geçerli olduğunu varsayarız: - tüm varlıklar aynı fiyata sahiptir (1’e normalize edilmiştir), - bütçenin tamamı :math:`B` harcanmalıdır, yani tam olarak :math:`B` varlık seçilmesi gerekir.

source: The equality constraint :math:`1^T x = B` is mapped to a penalty term :math:`(1^T x - B)^2` which is scaled by a parameter and subtracted from the objective function. The resulting problem can be mapped to a Hamiltonian whose ground state corresponds to the optimal solution. This notebook shows how to use the Variational Quantum Eigensolver (VQE) or the Quantum Approximate Optimization Algorithm (QAOA) to find the optimal solution for a given set of parameters.
tr_tr: Eşitlik kısıtı :math:`1^T x = B`, bir parametre ile ölçeklenip amaç fonksiyonundan çıkartılan ceza terimi :math:`(1^T x-B)^2` ile eşlenir. Sonuçta ortaya çıkan problem, taban enerji seviyesi optimal çözüme denk gelen bir Hamiltonian ile eşlenebilir. Bu not defteri, verilen parametrelerle optimal çözümü bulmak için Variational Quantum Eigensolver (VQE)’ın ya da Kuantum Yaklaşık Optimizasyon Algoritması (QAOA)’ın nasıl kullanılacağını gösterir.

source: [Optional] Setup token to run the experiment on a real device
tr_tr: [Optional] Denemeyi gerçek bir cihazda çalıştırmak için kurulum erişim-anahtarı

source: If you would like to run the experiment on a real device, you need to setup your account first.
tr_tr: Denemeyi gerçek bir cihazda çalıştırmak istiyorsanız, önce hesabınızı ayarlamanız gerekir.

source: Note: If you do not store your token yet, use ``IBMQ.save_account('MY_API_TOKEN')`` to store it first.
tr_tr: Not: Erişim anahtarını henüz kaydetmediyseniz, önce kaydetmek için ``IBMQ.save_account('MY_API_TOKEN')`` kullanın.

source: Define problem instance
tr_tr: Sorun örneğini tanımlayın

source: Here an Operator instance is created for our Hamiltonian. In this case the paulis are from an Ising Hamiltonian translated from the portfolio problem. We use a random portfolio problem for this notebook. It is straight-forward to extend this to using real financial data as illustrated here: `Loading and Processing Stock-Market Time-Series Data <11_time_series.ipynb>`__
tr_tr: Burada Hamiltonian’ımız için bir Operator örneği oluşturulmuştur. Bu durumda, pauliler portföy probleminden çevrilen Ising Hamiltonian’ından gelir. Bu not defteri için rastgele bir portföy problemi kullanıyoruz. `Loading and Processing Stock-Market Time-Series Data <11_time_series.ipynb>`__‘da gösterildiği gibi gerçek finansal veriyle genişletilebilir

source: We define some utility methods to print the results in a nice format.
tr_tr: Sonuçları güzel bir formatta yazdırmak için bazı yardımcı yöntemler tanımlarız.

source: NumPyMinimumEigensolver (as a classical reference)
tr_tr: NumPyMinimumEigensolver (klasik bir referans olarak)

source: Lets solve the problem. First classically…
tr_tr: Sorunu çözelim. Önce klasik olarak…

source: We can now use the Operator we built above without regard to the specifics of how it was created. We set the algorithm for the NumPyMinimumEigensolver so we can have a classical reference. The problem is set for ‘ising’. Backend is not required since this is computed classically not using quantum computation. The result is returned as a dictionary.
tr_tr: Artık yukarıda oluşturduğumuz Operatörü nasıl oluşturulduğuna bakmadan kullanabiliriz. NumPyMinimumEigensolver algoritmasını klasik bir referansa sahip olabilmemiz için ayarladık. Sorun ‘ising için ayarlandı. Bu, klasik olarak kuantum hesaplama kullanılmadan hesaplandığından arka uç gerekli değildir. Sonuç bir sözlük olarak döndürülür.

source: Solution using VQE
tr_tr: VQE kullanarak çözüm

source: We can now use the Variational Quantum Eigensolver (VQE) to solve the problem. We will specify the optimizer and variational form to be used.
tr_tr: Problemi çözmek için şimdi Variational Quantum Eigensolver (VQE)'ı kullanabiliriz. Kullanılacak optimize ediciyi ve değişimsel yapıyı belirleyeceğiz.

source: Note: You can switch to different backends by providing the name of backend.
tr_tr: Not: Arkayüz adını vererek farklı arkayüzlere geçiş yapabilirsiniz.

source: Solution using QAOA
tr_tr: QAOA kullanarak çözüm

source: We also show here a result using the Quantum Approximate Optimization Algorithm (QAOA). This is another variational algorithm and it uses an internal variational form that is created based on the problem.
tr_tr: Burada ayrıca, Kuantum Yaklaşık Optimizasyon Algoritması (QAOA) kullanılarak elde edilmiş bir sonuç da gösterilmektedir. Bu, başka bir değişimsel algoritmadır ve probleme dayanarak geliştirilmiş dahili bir değişimsel yapı kullanır.

source: In asset management, there are broadly two approaches: active and passive investment management. Within passive investment management, there are index-tracking funds and there are approaches based on portfolio diversification, which aim at representing a portfolio with a large number of assets by a smaller number of representative stocks. This notebook illustrates a portfolio diversification problem, which has recently become popular for two reasons: 1. it makes it possible to mimic the performance of an index (or a similarly large set of assets) with a limited budget, at limited transaction costs. That is: traditional index-tracking may purchase all assets in the index, ideally with the same weights as in the index. This may be impractical for a number of reasons: the total of even a single round lot per asset may amount to more than the assets under management, the large scale of the index-tracking problem with integrality constraints may render the optimization problem difficult, and the transaction costs of the frequent rebalancing to adjust the positions to the weights in the index may render the approach expensive. Thus, a popular approach is to select a portfolio of :math:`q` assets that represent the market with :math:`n` assets, where :math:`q` is significantly smaller than :math:`n`, but where the portfolio replicates the behavior of the underlying market. To determine how to group assets into :math:`q` clusters and how to determine which :math:`q` assets should represent the :math:`q` clusters amounts to solving a large-scale optimization problem. In the following we describe the mathematical model for the portfolio diversification problem as introduced in [Cornuejols & Tutuncu, 2006] 2. it allows for similarity measures between time-series beyond the covariance matrix. Notice that traditionally, modern portfolio theory considers the covariance matrix as a measure of similarity between the assets. As such, however, the covariance matrix is imperfect. Consider, for instance, a company listed both in London and New York. Although both listings should be very similar, only parts of the time series of the prices of the two listings will overlap, because of the partial overlap of the times the markets open. Instead of covariance, one can consider, for example, dynamic time warping of [Berndt and Clifford, 1994] as a measure of similarity between two time series, which allows for the fact that for some time periods, the data are captured by only one of the time series, while for others, both time series exhibit the similarity due to the parallel evolution of the stock price.
tr_tr: Varlık yönteminde, genellikle iki yaklaşım vardır. Bunlar: aktif ve pasif yatırım yönetimi. Pasif yatırım yönetiminde, endeks takip fonları ve portföy çeşitlendirmesine dayalı yaklaşımlar bulunmaktadır. Bu yaklaşımlar, çok sayıda varlığa sahip bir portföyü daha az sayıda temsili hisse senedi ile temsil etmeyi amaçlamaktadır. Bu not defteri, son zamanlarda iki nedenden dolayı popüler hale gelen bir portföy çeşitlendirme sorununu örneklerle açıklamaktadır: 1. bir endeksin (veya benzer şekilde büyük bir varlık grubunun) performansını sınırlı bir bütçeyle, sınırlı işlem maliyetleriyle taklit etmeyi mümkün kılar. Yani: geleneksel endeks takibi, endeksteki tüm varlıkları, ideal olarak endeksteki aynı ağırlıklarda satın alabilir. Bu, birkaç nedenden ötürü pratik olmayabilir: varlık başına tek bir yuvarlak lotun toplamı, yönetilen varlıklardan daha fazlasına ulaşabilir, tümlevsel koşulları olan indeks takibi probleminin büyüklüğü optimizasyon problemini zorlaştırabilir ve pozisyonları endeksteki ağırlıklara göre ayarlamak için sık sık yeniden dengelemenin işlem maliyetleri, yaklaşımı pahalı hale getirebilir. Bu nedenle, :math:`q`'nun :math:`n`'den önemli ölçüde küçük olduğu ancak portföyün, piyasanın davranışını kopyaladığı, :math:`n` varlıkla pazarı temsil eden :math:`q` varlık portföyü seçmek popüler bir yaklaşımdır. Varlıkların :math:`q` kümelerine nasıl gruplanacağını belirlemek ve hangi :math:`q` varlıklarının :math:`q` kümelerini temsil edeceğini nasıl belirleneceğini belirlemek büyük ölçekli bir optimizasyon problemini çözmek demektir. Aşağıda, [Cornuejols ve Tutuncu, 2006] 'da gösterilen portföy çeşitlendirme problemi için matematiksel modeli açıklıyoruz. 2. Bu, kovaryans matrisinin ötesinde zaman serileri arasında benzerlik ölçümlerine izin verir. Geleneksel olarak, modern portföy teorisi, kovaryans matrisi, varlıklar arasındaki benzerliğin ölçüsü olarak değerlendirmektedir. Bununla birlikte, kovaryans matrisi eksiktir. Örneğin, bir şirketin hem Londra'da hem de New York'da listelendiğini düşünün. İkisinin de çok benzer olması gerekmesine rağmen, piyasaların açılma zamanlarının kısmi olarak örtüşmesi sebebiyle, fiyatlarının zaman serilerinin sadece bazı kısımları örtüşecektir. Kovaryans yerine, örneğin [Berndt ve Clifford, 1994] 'ün dinamik zaman atlaması iki zaman serisi arasındaki benzerliğin bir ölçüsü olarak değerlendirilebilir. Bu, bazı zaman aralıkları için verinin sadece tek bir zaman serisi tarafından yakalanmasını sağlar, diğerleri içinse, hisse senedi fiyatının paralel olarak ilerlemesinden dolayı her iki zaman serisi benzerlik göstermektedir.

source: The overall workflow we demonstrate comprises:
tr_tr: Gösterdiğimiz genel iş akışı şunları içerir:

source: pick the ground set of assets. In our case, this is a small number of US stocks.
tr_tr: temel varlık kümesini seçin. Bizim durumumuzda, bu az sayıda ABD hisse senedidir.

source: load the time series capturing the evolution of the prices of assets. In our case, this is a simplistic load of adjusted daily closing price data from Wikipedia or Nasdaq or LSE or EuroNext, whereas in a real asset management, a much higher frequency may be considered.
tr_tr: varlık fiyatlarının değişimini gösteren zaman serilerini yükleyin. Bizim örneğimizde bu, Wikipedia, Nasdaq, LSE veya EuroNext’ten alınan ayarlanmış günlük kapanış fiyat verilerinin basit bir yüklemesidir, oysa gerçek bir varlık yönetiminde, çok daha yüksek bir frekans değerlendirilebilir.

source: compute the pair-wise similarity among the time series. In our case, we run a linear-time approximation of the dynamic time warping, still on the classical computer.
tr_tr: zaman serileri arasındaki ikili benzerliği hesaplayın. Bizim durumumuzda, dinamik zaman atlamasının doğrusal zaman yaklaştırımını hala klasik bilgisayarda çalıştırıyoruz.

source: compute the actual portfolio of :math:`q` representative assets, based on the similarity measure. This step is run twice, actually. First, we obtain a reference value by a run of an IBM solver (IBM ILOG CPLEX or the Exact Eigensolver) on the classical computer. Second, we run an alternative, hybrid algorithm partly on the quantum computer.
tr_tr: benzerlik ölçüsüne göre temsil edecek nitelikteki :math:`q` varlığının gerçek portföyünü hesaplayın. Bu adım aslında iki kez çalıştırılır. İlk olarak, klasik bilgisayarda bir IBM çözüm aracının (IBM ILOG CPLEX veya Exact Eigensolver) çalıştırılmasıyla bir referans değeri elde ederiz. İkinci olarak, kuantum bilgisayarda alternatif, hibrit bir algoritmayı kısmen çalıştırırız.

source: visualization of the results. In our case, this is again a simplistic plot.
tr_tr: sonuçların görselleştirilmesi. Bizim durumumuzda, bu yine basit bir çizim.

source: In the following, we first explain the model used in (4) above, before we proceed with the installation of the pre-requisites and the data loading.
tr_tr: Aşağıda, ön koşulların kurulumu ve veri yükleme işlemine geçmeden önce yukarıda (4)‘te kullanılan modeli açıklıyoruz.

source: The Model
tr_tr: Model

source: As discussed in [Cornuejols & Tutuncu, 2006], we describe a mathematical model that clusters assets into groups of similar ones and selects one representative asset from each group to be included in the index fund portfolio. The model is based on the following data, which we will discuss in more detail later:
tr_tr: [Cornuejols & Tutuncu, 2006]‘da ele alındığı gibi, varlıkları benzer gruplar halinde kümeleyen ve her gruptan endeks fon portföyüne dahil edilecek temsili bir varlık seçen matematiksel bir model tanımlıyoruz. Model, daha sonra ayrıntılı olarak ele alacağımız aşağıdaki verilere dayanmaktadır:

source: For example, :math:`\rho_{ii} = 1`, :math:`\rho_{ij} \leq 1` for :math:`i \neq j` and :math:`\rho_{ij}` is larger for more similar stocks. An example of this is the correlation between the returns of stocks :math:`i` and :math:`j`. But one could choose other similarity indices :math:`\rho_{ij}`.
tr_tr: Örneğin, :math:`i \neq j` ve :math:`\rho_{ij}` için :math:`\rho_{ii} = 1`, :math:`\rho_{ij} \leq 1` daha benzer hisse senetleri için daha büyüktür. Hisse senedi getirileri :math:`i` ve :math:`j` arasındaki korelasyon bunun bir örneğidir. Fakat diğer benzerlik indeksleri :math:`\rho_{ij}` seçilebilir.

source: The problem that we are interested in solving is:
tr_tr: Çözmeye çalıştığımız problem şudur:

source: subject to the clustering constraint:
tr_tr: kümeleme kısıtlamasına tabi:

source: to consistency constraints:
tr_tr: tutarlılık koşullarına:

source: and integral constraints:
tr_tr: ve integral kısıtlamaları:

source: The variables :math:`y_j` describe which stocks :math:`j` are in the index fund (:math:`y_j = 1` if :math:`j` is selected in the fund, :math:`0` otherwise). For each stock :math:`i = 1,\dots,n`, the variable :math:`x_{ij}` indicates which stock :math:`j` in the index fund is most similar to :math:`i` (:math:`x_{ij} = 1` if :math:`j` is the most similar stock in the index fund, :math:`0` otherwise).
tr_tr: :math:`y_j` değişkenleri hangi :math:`j` hisse senetlerinin endeks fonunda olduğunu ifade eder (eğer :math:`j` fonda seçildiyse :math:`y_j = 1`, seçilmediyse :math:`0`). Her bir :math:`i = 1,\dots,n` hisse senedi için, :math:`x_{ij}` değişkeni endeks fonundaki hangi :math:`j` hisse senedinin :math:`i`'ye en çok benzediğini gösterir (fondaki en benzer hisse senedi :math:`j` ise :math:`x_{ij} = 1`, değilse :math:`0`).

source: The first constraint selects :math:`q` stocks in the fund. The second constraint imposes that each stock :math:`i` has exactly one representative stock :math:`j` in the fund. The third and fourth constraints guarantee that stock :math:`i` can be represented by stock :math:`j` only if :math:`j` is in the fund. The objective of the model maximizes the similarity between the :math:`n` stocks and their representatives in the fund. Different cost functions can also be considered.
tr_tr: Birinci koşul, fondaki :math:`q` hisse senedini seçer. İkinci koşul, her :math:`i` hisse senedinin fonda tam olarak bir temsili :math:`j` hisse senedine sahip olduğunu belirtir. Üçüncü ve dördüncü koşullar, :math:`i` hisse senedinin yalnızca :math:`j`’nin fonda olması durumunda :math:`j` hisse senedi ile temsil edilebileceğini garanti etmektedir. Modelin amacı, :math:`n` hisse senetleri ile fondaki temsilcileri arasındaki benzerliği maksimuma çıkarmaktır. Farklı maliyet fonksiyonları da düşünülebilir.

source: Let us concatenate the decision variables in one vector
tr_tr: Karar değişkenlerini bir vektörde birleştirelim

source: whose dimension is :math:`{\bf z} \in \{0,1\}^N`, with :math:`N = n (n+1)` and denote the optimal solution with :math:`{\bf z}^*`, and the optimal cost :math:`f^*`.
tr_tr: boyutu :math:`N = n (n+1)` olacak şekilde :math:`{\bf z} \in \{0,1\}^N`‘dir ve :math:`{\bf z}^*` ile en uygunu çözümü ve en uygun maliyet :math:`f^*`’i göstermektedir.

source: A Hybrid Approach
tr_tr: Hibrit Bir Yaklaşım

source: Here, we demonstrate an approach that combines classical and quantum computing steps, following the quantum approximate optimization approach of Farhi, Goldstone, and Gutmann (2014).
tr_tr: Burada, Farhi, Goldstone ve Gutman'ın (2014) kuantum yaklaşık optimizasyon yöntemini izleyerek klasik ve kuantum hesaplama adımlarını birleştiren bir yöntemi gösteriyoruz.

source: Construct a binary polynomial optimization
tr_tr: İkili bir polinom optimizasyonu oluşturun

source: From :math:`(M)` one can construct a binary polynomial optimization with equality constraints only, by substituting the :math:`x_{ij} \leq y_j` inequality constraints with the equivalent equality constraints :math:`x_{ij} (1- y_j) = 0`. Then the problem becomes:
tr_tr: :math:`x_{ij} \leq y_j` eşitsizlik koşulları, eşdeğer eşitlik koşulları :math:`x_{ij} (1- y_j) = 0` ile değiştirilerek sadece eşitlik koşulları ile :math:`(M)`‘den ikili bir polinom optimizasyonu oluşturulabilmektedir. O zaman problem şuna dönüşür:

source: subject to the clustering constraint, the integral constraints, and the following modified consistency constraints:
tr_tr: kümeleme kısıtlamasına, integral kısıtlamalarına ve aşağıdaki değiştirilmiş tutarlılık kısıtlamalarına tabidir:

source: Construct the Ising Hamiltonian
tr_tr: Ising Hamilton’u Oluşturun

source: We can now construct the Ising Hamiltonian (QUBO) by penalty methods (introducing a penalty coefficient :math:`A` for each equality constraint) as
tr_tr: Artık Ising Hamiltonian’ı (QUBO) ceza yöntemleriyle (her bir eşitlik kısıtı için bir ceza katsayısı :math:`A` ekleyerek) şu şekilde oluşturabiliriz

source: From Hamiltonian to Quadratic Programming (QP) formulation
tr_tr: Hamiltonyen'den Kuadratik Programlama (KP) formülasyonuna

source: In the vector :math:`{\bf z}`, the Ising Hamiltonian elements can be rewritten as follows,
tr_tr: :math:`{\bf z}` vektöründe, Ising Hamiltonyen öğeleri aşağıdaki gibi yazılabilir,

source: First term:
tr_tr: İlk terim:

source: \sum_{i=1}^n \sum_{j=1}^n \rho_{ij} x_{ij} = [\rho_{11},\rho_{12},\ldots,\rho_{1n}, \rho_{22},\ldots,\rho_{nn}|{\bf 0}_n ]{\bf z} =: {\bf c}_0^T {\bf z}
tr_tr: \sum_{i=1}^n \sum_{j=1}^n \rho_{ij} x_{ij} = [\rho_{11},\rho_{12},\ldots,\rho_{11}, \rho_{22},\ldots,\rho_{nn}|{\bf 0}_n ]{\bf z} =: {\bf c}_0^T {\bf z}

source: Second term:
tr_tr: İkinci terim:

source: Third term:
tr_tr: Üçüncü terim:

source: which is equivalent to:
tr_tr: bu da aşağıdakine eşittir:

source: Fourth term:
tr_tr: Dördüncü terim:

source: Fifth term:
tr_tr: Beşinci terim:

source: Therefore, the formulation becomes,
tr_tr: Böylece, formülasyon şu hale gelir,

source: which can be passed to the variational quantum eigensolver.
tr_tr: variational quantum eigensolver‘a geçirilebilir.

source: References
tr_tr: Kaynaklar

source: The Implementation
tr_tr: Uygulama

source: First, we import the requisite modules.
tr_tr: İlk olarak, gerekli modülleri içe aktarıyoruz.

source: Now we decide on the number of clusters. This has to be smaller than the number of stocks we have loaded.
tr_tr: Şimdi küme sayılarına karar veriyoruz. Bu, yüklediğimiz hisse senetlerinin sayısından daha küçük olmalı.

source: Classical solution using IBM ILOG CPLEX
tr_tr: IBM ILOG CPLEX kullanılarak klasik çözüm

source: For a classical solution, we use IBM CPLEX. CPLEX is able to find the exact solution of this problem. We first define a ClassicalOptimizer class that encodes the problem in a way that CPLEX can solve, and then instantiate the class and solve it.
tr_tr: Klasik bir çözüm için IBM CPLEX kullanırız. CPLEX, bu sorunun tam çözümünü bulabilmektedir. Önce, problemi CPLEX'in çözebileceği şekilde kodlayan bir ClassicalOptimizer sınıfı tanımlıyoruz ve ardından sınıfı örnekleyerek çözüyoruz.

source: Solution shows the selected stocks via the stars and in green the links (via similarities) with other stocks that are represented in the fund by the linked stock.
tr_tr: Çözüm, seçilen hisse senetlerini yıldızlarla ve bağlı hisse senetleri ile fonda temsil edilen diğer hisse senetleriyle olan bağlantıları (benzerlikler yoluyla) yeşil renkte gösterir.

source: Quantum Computing with IBM Q
tr_tr: IBM Q ile Kuantum Hesaplama

source: For the quantum solution, we use Qiskit. We first define a class QuantumOptimizer that encodes the quantum approach to solve the problem and then we instantiate it and solve it. We define the following methods inside the class:
tr_tr: Kuantum çözümü için Qiskit’i kullanıyoruz. Problemi çözmek için önce, kuantum yaklaşımını kodlayan bir QuantumOptimizer sınıfı tanımlıyoruz ve sonra onu örnekleyip çözüyoruz. Aşağıdaki metotları sınıf içinde tanımlıyoruz:

source: ``exact_solution`` : to make sure that the Ising Hamiltonian is correctly encoded in the :math:`Z` basis, we can compute its eigendecomposition classically, i.e., considering a symmetric matrix of dimension :math:`2^N \times 2^N`. For the problem at hand :math:`n=3`, that is :math:`N = 12`, seems to be the limit for many laptops;
tr_tr: ``exact_solution``: Ising Hamiltonyen'in :math:`Z` bazında doğru kodlandığından emin olmak için, :math:`2^N \times 2^N` boyutunun simetrik bir matrisini dikkate alarak, özdeğerlerine ve özvektörlerine ayırmasını klasik olarak hesaplayabiliriz. Elimizdeki problem için :math:`n=3`, yani :math:`N = 12`, birçok dizüstü bilgisayar için sınır olarak görünüyor;

source: ``vqe_solution`` : solves the problem :math:`(M)` via the variational quantum eigensolver (VQE);
tr_tr: ``vqe_solution`` : :math:`(M)` problemini variational quantum eigensolver (VQE) aracılığıyla çözer;

source: ``qaoa_solution`` : solves the problem :math:`(M)` via a Quantum Approximate Optimization Algorithm (QAOA).
tr_tr: ``qaoa_solution`` : :math:`(M)` problemini bir Kuantum Yaklaşık Optimizasyon Algoritması (QAOA) aracılığıyla çözer.
