Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/sample_vqe_program/qiskit_runtime_vqe_program.po
Languages: es_un, ja_jp, ko_kr, pt_un, ta_in

source: Here we code a simple simultaneous perturbation stochastic approximation (SPSA) optimizer for use on noisy quantum systems. Most optimizers do not handle fluctuating cost functions well, so this is a needed addition for executing on real quantum hardware.
es_un: Aquí codificamos un optimizador simple de aproximación estocástica de perturbaciones simultáneas (simultaneous perturbation stochastic approximation, SPSA) para su uso en sistemas cuánticos ruidosos. La mayoría de los optimizadores no manejan bien las funciones de costos fluctuantes, por lo que esta es una adición necesaria para ejecutar en hardware cuántico real.
ja_jp: ここでは、ノイズの多い量子システムで使用するための簡単な同時摂動確率近似(simultaneous perturbation stochastic approximation、SPSA)オプティマイザをコード化します。 ほとんどのオプティマイザは変動するコスト関数をうまく扱えないため、これは実際の量子ハードウェア上で実行するために必要な追加です。
ko_kr: 여기서는 노이즈가 있는 양자 시스템에 사용하기 위한 간단한 SPSA (Simultaneous Perturbation Stochastic Approximation) 최적화 프로그램(optimizer) 코드를 작성한다. 대부분의 최적화 프로그램은 변동하는 비용 함수를 잘 처리하지 않으므로 이것은 실제 양자 하드웨어에서 실행하는 데 필요한 추가 기능이다.
pt_un: Aqui nós codificamos um otimizador de aproximação estocástica de perturbação simultânea (SPSA) simples para uso em sistemas quânticos ruidosos. A maioria dos otimizadores não lida bem com funções de custo flutuantes, portanto, essa é uma adição necessária para executar em um hardware quântico real.
ta_in: சத்தமில்லாத குவாண்டம் அமைப்புகளில் பயன்படுத்த ஒரு எளிய ஒரே நேரத்தில் இடையூறு ஸ்டோகாஸ்டிக் தோராய (SPSA) உகப்பாக்கியை இங்கே குறியீடு செய்கிறோம். பெரும்பாலான உகப்பாக்கிகள் ஏற்ற இறக்கமான செலவுச் செயல்பாடுகளைச் சரியாகக் கையாளவில்லை, எனவே இது உண்மையான குவாண்டம் வன்பொருளை இயக்குவதற்குத் தேவையான கூடுதலாகும்.

source: Appendix B
es_un: Apéndice B
ja_jp: 付録 B
pt_un: Apêndice B
ta_in: பின் இணைப்பு B

source: This is a helper function that converts the Pauli operators in the strings that define the Hamiltonian operators into the appropriate measurements at the end of the circuits. For :math:`X` operators this involves adding an :math:`H` gate to the qubits to be measured, whereas a :math:`Y` operator needs :math:`S^{+}` followed by a :math:`H`. Other choices of Pauli operators require no additional gates prior to measurement.
es_un: Esta es una función auxiliar que convierte los operadores de Pauli en las cadenas que definen los operadores Hamiltonianos en las mediciones apropiadas al final de los circuitos. Para los operadores :math:`X`, esto implica agregar una compuerta :math:`H` a los qubits que se van a medir, mientras que un operador :math:`Y` necesita un :math:`S^{+}` seguido de una :math:`H`. Otras opciones de operadores de Pauli no requieren compuertas adicionales antes de la medición.
ja_jp: これは、ハミルトニアン演算子を定義する文字列内のパウリ演算子を回路の最後で適切な測定値に変換するヘルパー関数です。 :math:`X` 演算子の場合、これには測定する量子ビットに :math:`H` ゲートを追加する必要があり、 :math:`Y` 演算子には :math:`S^{+}` の後に :math:`H` が必要です 。パウリ演算子の他の選択肢では、測定前に追加のゲートは必要ありません。
ko_kr: 이것은 해밀토니안을 정의하는 문자열의 파울리 연산자를 회로 끝에서 적절한 측정으로 변환하는 헬퍼 함수다. :math:`X` 연산자의 경우 측정할 큐비트에 :math:`H` 게이트를 추가하는 것을 포함하는 반면, :math:`Y` 연산자는 :math:`S^{+}` 다음에 :math:`H` 가 필요하다. 파울리 연산자의 다른 선택은 측정 전에 추가적인 게이트를 필요로 하지 않는다.
pt_un: Esta é uma função auxiliar que converte os operadores de Pauli nas strings que definem os operadores hamiltonianos nas medidas apropriadas no final dos circuitos. Para operadores :math:`X` isso envolve adicionar uma porta :math:`H` aos qubits a serem medidos, enquanto um operador :math:`Y` precisa de :math:`S^{+}` seguido por um :math: `H`. Outras opções dos operadores Pauli não requerem portas adicionais antes da medida.
ta_in: இது ஹாமில்டோனியன் ஆபரேட்டர்களை வரையறுக்கும் சரங்களில் உள்ள பாலி ஆபரேட்டர்களை சுற்றுகளின் முடிவில் பொருத்தமான அளவீடுகளாக மாற்றும் ஒரு உதவி செயல்பாடாகும். :math:`X` ஆபரேட்டர்களுக்கு, அளவிடப்பட வேண்டிய குவிட்களில் :math:`H` கேட் சேர்ப்பது இதில் அடங்கும், அதேசமயம் :math:`Y` ஆபரேட்டருக்கு :math:`S^{+}` தேவை :math:`H`. பாலி ஆபரேட்டர்களின் மற்ற தேர்வுகளுக்கு அளவீட்டுக்கு முன் கூடுதல் வாயில்கள் தேவையில்லை.

source: Paul Nation
ja_jp: ポール・ネーション(Paul Nation)
ta_in: பால் நேஷன்
