Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/sample_vqe_program/qiskit_runtime_vqe_program.po
Languages: es_un, ja_jp, ko_kr, pt_un, ta_in

source: This page was generated from `docs/tutorials/sample_vqe_program/qiskit_runtime_vqe_program.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/sample_vqe_program/qiskit_runtime_vqe_program.ipynb`__.
ja_jp: このページは、 `docs/tutorials/sample_vqe_program/qiskit_runtime_vqe_program.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/sample_vqe_program/qiskit_runtime_vqe_program.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/sample_vqe_program/qiskit_runtime_vqe_program.ipynb`__.
ta_in: இந்தப் பக்கம் `docs/tutorials/sample_vqe_program/qiskit_runtime_vqe_program.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Creating Custom Programs for Qiskit Runtime
es_un: Creación de Programas Personalizados para Qiskit Runtime
ja_jp: Qiskit Runtime 用カスタム・プログラムの作成
ko_kr: Qiskit Runtime을 위한 사용자 정의 프로그램 작성하기
pt_un: Criando programas personalizados para o Qiskit Runtime
ta_in: Qiskit இயக்க நேரத்திற்கான தனிப்பயன் நிரல்களை உருவாக்குதல்

source: IBM Quantum Partners Technical Enablement Team
es_un: Equipo de Habilitación Técnica de IBM Quantum Partners
ja_jp: IBM Quantum Partners テクニカル・イネーブルメント・チーム
ko_kr: IBM Quantum 파트너 기술 지원 팀
pt_un: IBM Quantum Partners Technical Enablement Team (Equipe de capacitação técnica do IBM Quantum Partners)
ta_in: IBM குவாண்டம் பங்குதாரர்களின் தொழில்நுட்ப செயலாக்கக் குழு

source: Here we will demonstrate how to create, upload, and use a custom Program for Qiskit Runtime. As the utility of the Runtime execution engine lies in its ability to execute many quantum circuits with low latencies, this tutorial will show how to create your own Variational Quantum Eigensolver (VQE) program from scratch.
es_un: Aquí demostraremos cómo crear, cargar y usar un programa personalizado para Qiskit Runtime. Como la utilidad del motor de ejecución Runtime radica en su capacidad para ejecutar muchos circuitos cuánticos con latencias bajas, este tutorial te mostrará cómo crear tu propio programa Solucionador Propio Variacional Cuántico (Variational Quantum Eigensolver, VQE) desde cero.
ja_jp: ここでは、 Qiskit Runtime 用のカスタム・プログラムの作成、アップロード、およびカスタム・プログラムの使用方法を説明します。Runtime 実行エンジンのユーティリティーは、待ち時間が少ない多くの量子回路を実行する能力を持っているため、このチュートリアルでは、独自の変分量子固有値ソルバー（Variational Quantum Eigensolver、VQE) プログラムを最初から作成する方法を示します。
ko_kr: 여기는 Qiskit Runtime을 위한 사용자 정의 프로그램을 작성, 업로드 및 사용하는 방법을 설명한다. 런타임 실행 엔진의 유틸리티는 많은 양자 회로를 낮은 대기 시간으로 실행시키는 데 있으므로, 이 튜토리얼은 자체적인 변분화된 양자 고윳값 해석기(VQE, Variational Quantum Eigensolver)를 처음부터 생성하는 방법을 보여줄 것이다.
pt_un: Aqui vamos demonstrar como criar, carregar e usar um programa personalizado para o Qiskit Runtime. Como a utilidade do mecanismo de execução do Runtime está em sua capacidade de executar muitos circuitos quânticos com baixas latências, este tutorial mostrará como criar seu próprio programa Variational Quantum Eigensolver (VQE) do zero.
ta_in: Qiskit இயக்க நேரத்திற்கான தனிப்பயன் நிரலை எவ்வாறு உருவாக்குவது, பதிவேற்றுவது மற்றும் பயன்படுத்துவது என்பதை இங்கே காண்போம். இயக்க நேர செயலாக்க இயந்திரம் குறைந்த தாமதத்துடன் பல குவாண்டம் சுற்றுகளை இயக்கும் திறனில் உள்ளது, புதிதாக உங்கள் சொந்த மாறுபட்ட குவாண்டம் ஈஜென்சோல்வர் (VQE) நிரலை எவ்வாறு உருவாக்குவது என்பதை இந்த பயிற்ச்சியில் காண்பிக்கும்.

source: Prerequisites
es_un: Requisitos previos
ja_jp: 前提条件
ko_kr: 전제 조건
pt_un: Pré-requisitos
ta_in: முன்நிபந்தனைகள்

source: You must have the latest Qiskit installed.
es_un: Debes tener instalado el último Qiskit.
ja_jp: 最新の Qiskit がインストールされている必要があります。
ko_kr: 최신 Qiskit이 설치되어 있어야 한다.
pt_un: O Qiskit mais recente instalado.
ta_in: நீங்கள் சமீபத்திய Qiskit நிறுவியிருக்க வேண்டும்.

source: You must have either an IBM Cloud or an IBM Quantum account that can access Qiskit Runtime.
es_un: Debes tener una cuenta de IBM Cloud o IBM Quantum que pueda acceder a Qiskit Runtime.
ja_jp: Qiskit Runtime にアクセスできる IBM Cloud または IBM Quantum アカウントのいずれかを持っている必要があります。
ko_kr: Qiskit Runtime에 접근할 수 있는 IBM Cloud 또는 IBM Quantum 계정이 있어야 한다.
pt_un: Uma conta do IBM Cloud ou do IBM Quantum que possa acessar o Qiskit Runtime.
ta_in: Qiskit இயக்க நேரத்தை அணுகக்கூடிய IBM கிளவுட் அல்லது IBM குவாண்டம் கணக்கு உங்களிடம் இருக்க வேண்டும்.

source: Current limitations
es_un: Limitaciones actuales
ja_jp: 現在の制限
ko_kr: 현제 제한사항
pt_un: Limitações atuais
ta_in: தற்போதைய வரம்புகள்

source: The runtime execution engine currently has the following limitations that must be kept in mind:
es_un: El motor de ejecución de runtime actualmente tiene las siguientes limitaciones que deben tenerse en cuenta:
ja_jp: Runtime 実行エンジンには、現在以下のような制限があります。
ko_kr: 런타임 실행 엔진은 현재 다음과 같이 고려해야 할 제한사항을 가지고 있다:
pt_un: O mecanismo de runtime atualmente tem as seguintes limitações que devem ser lembradas:
ta_in: இயக்க நேர செயலாக்க இயந்திரம் தற்போது மனதில் கொள்ள வேண்டிய பின்வரும் வரம்புகளைக் கொண்டுள்ளது:

source: The Docker images used by the runtime include only Qiskit and its dependencies, with few exceptions. One exception is the inclusion of the ``mthree`` measurement mitigation package.
es_un: Las imágenes de Docker utilizadas por el runtime incluyen solo Qiskit y sus dependencias, con pocas excepciones. Una excepción es la inclusión del paquete de mitigación de medición ``mthree``.
ja_jp: Runtime で使用される Docker イメージには、Qiskit とその依存関係のみが含まれており、例外はほとんどありません。 例外として、``mthree`` 測定エラー軽減パッケージが含まれています。
ko_kr: 런타임에 사용되는 도커 이미지는 몇 가지 예외가 있지만 오직 Qiskit과 그 종속성만을 포함한다. 예외 하나는 ``mthree`` 측정 완화 패키지가 포함되어 있다는 것이다.
pt_un: As imagens do Docker usadas pelo runtime incluem apenas o Qiskit e suas dependências, com poucas exceções. Uma exceção é a inclusão do pacote de mitigação de medição ``mthree``.
ta_in: இயக்க நேரத்தால் பயன்படுத்தப்படும் டோக்கர் படங்களில் சில விதிவிலக்குகளுடன், Qiskit மற்றும் அதன் சார்புகள் மட்டுமே அடங்கும். ஒரு விதிவிலக்கு ``mthree`` அளவீட்டுத் தணிப்புத் தொகுப்பைச் சேர்ப்பதாகும்.

source: For security reasons, the runtime cannot make internet calls outside of the environment.
es_un: Por motivos de seguridad, el runtime no puede realizar llamadas de Internet fuera del entorno.
ja_jp: セキュリティ上の理由から、runtime は環境外でインターネットコールを行うことはできません。
ko_kr: 보안상의 이유로, 런타임은 환경 외부의 인터넷 호출을 할 수 없다.
pt_un: Por motivos de segurança, o runtime não pode fazer chamadas de internet fora do ambiente.
ta_in: பாதுகாப்பு காரணங்களுக்காக, இயக்க நேரம் சுற்றுச்சூழலுக்கு வெளியே இணைய அழைப்புகளைச் செய்ய முடியாது.

source: As Qiskit Runtime matures, these limitations will be removed.
es_un: A medida que madure Qiskit Runtime, se eliminarán estas limitaciones.
ja_jp: Qiskit Runtime が成熟するにつれて、これらの制限はなくなります。
ko_kr: Qiskit Runtime이 완전해질수록 이러한 제한사항은 사라질 것이다.
pt_un: À medida que o Qiskit Runtime amadurece, essas limitações serão removidas.
ta_in: Qiskit இயக்க நேரம் முதிர்ச்சியடையும்போது, இந்த வரம்புகள் அகற்றப்படும்.

source: Simple VQE
es_un: VQE simple
ja_jp: シンプルなVQE
ko_kr: 단순한 VQE
pt_un: VQE Simples
ta_in: எளிய VQE

source: VQE is an hybrid quantum-classical optimization procedure that finds the lowest eigenstate and eigenenergy of a linear system defined by a given Hamiltonian of Pauli operators. For example, consider the following two-qubit Hamiltonian:
es_un: VQE es un procedimiento híbrido cuántico-clásico de optimización que encuentra el estado propio y la energía propia más bajos de un sistema lineal definido por un operador Hamiltoniano de Pauli dado. Por ejemplo, considera el siguiente Hamiltoniano de dos qubits:
ja_jp: VQEは、パウリ演算子のハミルトニアンによって定義された線形システムの最小固有状態と固有エネルギーを見つけるハイブリッド量子古典最適化手順です。 たとえば、次の2量子ビットハミルトニアンについて考えてみます。
ko_kr: VQE는 주어진 파울리 연산자의 해밀토니안에 의해 정의된 선형 시스템의 최저 고유상태와 고유에너지를 찾아내는 하이브리드 양자-고전 최적화 방법이다. 예를 들어, 다음과 같은 2-큐비트 해밀토니안을 고려한다:
pt_un: VQE é um procedimento de otimização híbrido quântico-clássico que encontra o menor eigenstate e eigenenergy de um sistema linear definido por um determinado Hamiltoniano de operadores de Pauli. Por exemplo, considere o seguinte hamiltoniano de dois qubits:
ta_in: VQE என்பது ஒரு கலப்பின குவாண்டம்-கிளாசிக்கல் உகப்பாக்கம் செயல்முறையாகும், இது பாலி ஆபரேட்டர்களின் கொடுக்கப்பட்ட ஹாமில்டோனியனால் வரையறுக்கப்பட்ட நேரியல் அமைப்பின் குறைந்த ஈஜென்ஸ்டேட் மற்றும் ஈஜெனெர்ஜியைக் கண்டறியும். எடுத்துக்காட்டாக, பின்வரும் இரண்டு-க்யூபிட் ஹாமில்டோனியனைக் கவனியுங்கள்:

source: where :math:`A` is numerical coefficient and the subscripts label the qubits on which the operators act. The zero index being farthest right is the ordering used in Qiskit. The Pauli operators tell us which measurement basis to to use when measuring each of the qubits.
es_un: donde :math:`A` es el coeficiente numérico y los subíndices etiquetan los qubits sobre los que actúan los operadores. El índice cero que está más a la derecha es el orden utilizado en Qiskit. Los operadores de Pauli nos dicen qué base de medición utilizar a la hora de medir cada uno de los qubits.
ja_jp: :math:`A` は数値係数であり、下付き添え字は演算子が作用する量子ビットを表します。 ゼロインデックスが最も右にあるのは、Qiskitで使用される順番です。 パウリ演算子は、各量子ビットを測定するときにどの測定基底を使うかを教えてくれます。
ko_kr: 여기서 :math:`A` 는 숫자 계수고, 아래 첨자는 연산자가 동작하는 큐비트를 지정한다. 0 인덱스가 가장 오른쪽에 오는 것은 Qiskit에서 사용되는 순서다. 파울리 연산자는 각 큐비트를 측정할 때 어떤 측정 기준을 사용해야 할지 알려준다.
pt_un: onde :math:`A` é o coeficiente numérico e os subscritos rotulam os qubits nos quais os operadores atuam. O índice zero mais à direita é a ordenação usada no Qiskit. Os operadores de Pauli nos dizem qual base de medida usar ao medir cada um dos qubits.
ta_in: இங்கு :math:`A` என்பது எண் குணகம் மற்றும் துணை ஸ்கிரிப்டுகள் ஆபரேட்டர்கள் செயல்படும் க்யூபிட்களை லேபிளிடுகின்றன. பூஜ்ஜிய குறியீடு மிகவும் வலதுபுறமாக இருப்பது Qiskit பயன்படுத்தப்படும் வரிசைப்படுத்தல் ஆகும். ஒவ்வொரு க்யூபிட்களையும் அளவிடும் போது எந்த அளவீட்டு அடிப்படையை பயன்படுத்த வேண்டும் என்பதை பாலி ஆபரேட்டர்கள் எங்களிடம் கூறுகிறார்கள்.

source: We want to find the ground state (lowest energy state) of this Hamiltonian, and the associated eigenvector. To do this we must start at a given initial state and iteratively vary the parameters that define this state using a classical optimizer, such that the computed energies of subsequent steps are nominally lower than those previously. The parameterized state of the system is defined by an ansatz quantum circuit that should have non-zero support in the direction of the ground state. Because in general we do not know the solution, the choice of ansatz circuit can be highly problem-specific with a form dictated by additional information. For further information about variational algorithms, we point the reader to `Nature Reviews Physics volume 3, 625 (2021) <https://doi.org/10.1038/s42254-021-00348-9>`__.
es_un: Queremos encontrar el estado fundamental (estado de energía más bajo) de este Hamiltoniano y el vector propio asociado. Para hacer esto, debemos comenzar en un estado inicial dado y variar iterativamente los parámetros que definen este estado utilizando un optimizador clásico, de modo que las energías calculadas de los pasos posteriores sean nominalmente más bajas que las anteriores. El estado parametrizado del sistema está definido por un circuito cuántico ansatz que debe tener un soporte distinto de cero en la dirección del estado fundamental. Debido a que, en general, no conocemos la solución, la elección del circuito ansatz puede ser muy específica del problema con una forma dictada por información adicional. Para obtener más información sobre los algoritmos variacionales, remitimos al lector a `Nature Reviews Physics volume 3, 625 (2021) <https://doi.org/10.1038/s42254-021-00348-9>`__.
ja_jp: 私たちは、このハミルトニアンの基底状態(最低エネルギー状態)と関連する固有ベクトルを見つけたいと考えています。 これを行うには、与えられた初期状態から開始し、古典的なオプティマイザを使用してこの状態を定義するパラメーターを繰り返し変更する必要があります。 その後のステップの計算エネルギーは以前より低くなるようにする必要があります。システムのパラメータ化された状態は、ansatz量子回路によって定義されます。この量子回路は、基底状態の方向に非ゼロのサポートを持つ必要があります。 一般的に、我々は解を知らないため、ansatz回路の選択は、追加情報によって決定されるフォームで非常に問題に特化したものになります。 変動アルゴリズムの詳細については、`Nature Reviews Physics volume 3, 625 (2021) <https://doi.org/10.1038/s42254-021-00348-9>`__ を参照してください。
ko_kr: 이 해밀토니안의 바닥 상태 (즉, 최저 에너지 상태), 그리고 연관된 고유벡터를 찾고자 한다. 이를 위해 주어진 초기 상태에서 시작해 고전적인 최적화기를 통해 이 상태를 정의하는 매개변수를 반복적으로 변경하여, 후속 단계의 계산된 에너지가 이전의 것보다 명목상 더 낮아지게 해야 한다. 시스템의 매개변수화된 상태는 바닥 상태의 방향에서 0이 아닌 지원을 받아야 하는 ansatz 양자 회로에 의해 정의된다. 일반적으로 우리는 해결책을 알지 못하므로, ansatz 회로의 선택은 추가적인 정보에 의해 지시되는 형태로 문제에 따른 차이가 클 수 있다. 변이 알고리즘에 대한 추가적인 정보는 `Nature Reviews Physics volume 3, 625 (2021) <https://doi.org/10.1038/s42254-021-00348-9>`__ 를 참조하라.
pt_un: Queremos encontrar o estado fundamental (estado de menor energia) deste hamiltoniano e o eigenvector associado. Para fazer isso, devemos começar em um determinado estado inicial e variar iterativamente os parâmetros que definem esse estado usando um otimizador clássico, de modo que as energias calculadas das etapas subsequentes sejam nominalmente menores do que as anteriores. O estado parametrizado do sistema é definido por um circuito quântico ansatz que deve ter suporte não-zero na direção do estado fundamental. Como em geral não conhecemos a solução, a escolha do circuito ansatz pode ser altamente específica do problema com uma forma ditada por informações adicionais. Para mais informações sobre algoritmos variacionais, indicamos ao leitor `Nature Reviews Physics volume 3, 625 (2021) <https://doi.org/10.1038/s42254-021-00348-9>`__.
ta_in: இந்த ஹாமில்டோனியனின் தரை நிலை (குறைந்த ஆற்றல் நிலை) மற்றும் அதனுடன் தொடர்புடைய ஈஜென்வெக்டரைக் கண்டறிய விரும்புகிறோம்.இதைச் செய்ய, நாம் கொடுக்கப்பட்ட ஆரம்ப நிலையில் தொடங்கி, கிளாசிக்கல் ஆப்டிமைசரைப் பயன்படுத்தி இந்த நிலையை வரையறுக்கும் அளவுருக்களை மீண்டும் மீண்டும் மாற்ற வேண்டும், அதாவது அடுத்தடுத்த படிகளின் கணக்கிடப்பட்ட ஆற்றல்கள் முந்தையதை விட பெயரளவில் குறைவாக இருக்கும்.அமைப்பின் அளவுரு நிலை ஒரு அன்சாட்ஸ் குவாண்டம் சர்க்யூட் மூலம் வரையறுக்கப்படுகிறது, இது தரை நிலையின் திசையில் பூஜ்ஜியமற்ற ஆதரவைக் கொண்டிருக்க வேண்டும்.பொதுவாக எங்களுக்கு தீர்வு தெரியாது என்பதால், கூடுதல் தகவலால் கட்டளையிடப்பட்ட படிவத்துடன் அன்சட்ஸ் சர்க்யூட் தேர்வு மிகவும் சிக்கல் சார்ந்ததாக இருக்கும். மாறுபாடு அல்காரிதம்கள் பற்றிய கூடுதல் தகவலுக்கு, வாசகரை `நேச்சர் ரிவியூஸ் இயற்பியல் தொகுதி 3, 625 (2021) <https://doi.org/10.1038/s42254-021-00348-9>`__ க்கு சுட்டிக்காட்டுகிறோம்.

source: Thus we need at least the following inputs to create our VQE quantum program:
es_un: Por lo tanto, necesitamos al menos las siguientes entradas para crear nuestro programa cuántico VQE:
ja_jp: したがって、VQE量子プログラムを作成するには、少なくとも以下の入力が必要です。
ko_kr: 따라서 VQE 양자 프로그램을 생성하려면 적어도 다음의 입력이 필요하다.
pt_un: Assim, precisamos de pelo menos as seguintes entradas para criar nosso programa quântico VQE:
ta_in: எனவே, எங்கள் VQE குவாண்டம் நிரலை உருவாக்கக் குறைந்தபட்சம் பின்வரும் உள்ளீடுகள் தேவை:

source: A representation of the Hamiltonian that specifies the problem.
es_un: Una representación del Hamiltoniano que especifica el problema.
ja_jp: 問題を指定するハミルトニアンの表現。
ko_kr: 문제를 지정하는 해밀토니안의 표현.
pt_un: Uma representação do Hamiltoniano que especifica o problema.
ta_in: சிக்கலைக் குறிப்பிடும் ஹாமில்டோனியனின் பிரதிநிதித்துவம்.

source: A choice of parameterized ansatz circuit, and the ability to pass configuration options, if any.
es_un: Una opción de circuito ansatz parametrizado y la capacidad de pasar opciones de configuración, si las hay.
ja_jp: パラメーター化された ansatz 回路の選択と、構成オプションを渡す機能 ( 存在する場合 ) 。
ko_kr: 매개변수화된 ansatz 회로의 선택, 그리고 구성 옵션이 있을 경우 이를 전달하는 기능.
pt_un: Uma escolha de circuito ansatz parametrizado e a capacidade de passar opções de configuração, se houver.
ta_in: அளவுருவாக்கப்பட்ட அன்சட்ஸ் சர்க்யூட்டின் தேர்வு மற்றும் உள்ளமைவு விருப்பங்கள் ஏதேனும் இருந்தால் அனுப்பும் திறன்.

source: However, the following are also beneficial inputs that users might want to have:
es_un: Sin embargo, las siguientes también son entradas beneficiosas que los usuarios podrían querer tener:
ja_jp: ただし、以下のものも、ユーザーにとって有益な入力となります。
ko_kr: 그러나 다음 또한 사용자가 원할 수도 있는 유익한 입력이다:
pt_un: No entanto, a seguir também são entradas benéficas que os usuários podem querer ter:
ta_in: இருப்பினும், பின்வருபவை பயனர்கள் விரும்பக்கூடிய பயனுள்ள உள்ளீடுகள்:

source: Add the ability to pass an initial state.
es_un: Agregar la capacidad de pasar un estado inicial.
ja_jp: 初期状態を渡す機能を追加する。
ko_kr: 초기 상태를 전달할 수 있는 기능 추가.
pt_un: Adicionar a capacidade de passar um estado inicial.
ta_in: ஆரம்ப நிலையைக் கடக்கும் திறனைச் சேர்க்கவும்.

source: Vary the number of shots that are taken.
es_un: Variar el número de iteraciones que son tomadas.
ja_jp: 得られたショットの数を変更する。
ko_kr: 사용하는 샷의 개수 변경.
pt_un: Variar o número de tentativas que são feitas.
ta_in: எடுக்கப்பட்ட ஷாட்களின் எண்ணிக்கையை மாற்றவும்.

source: Ability to select which classical optimizer is used, and set configuraton values, if any.
es_un: Capacidad para seleccionar qué optimizador clásico se usa y establecer valores de configuración, si hay alguna.
ja_jp: どの古典的オプティマイザーが使用されるかを選択し、構成値を設定する機能 ( ある場合 ) 。
ko_kr: 어떤 고전적인 최적화기를 사용할지 선택하고, 있는 경우 구성 값을 설정할 수 있는 기능.
pt_un: Capacidade de selecionar qual otimizador clássico é usado e definir valores de configuração, se houver.
ta_in: எந்தக் கிளாசிக்கல் ஆப்டிமைசர் பயன்படுத்தப்படுகிறது என்பதைத் தேர்ந்தெடுக்கும் திறன் மற்றும் கட்டமைப்பு மதிப்புகள் ஏதேனும் இருந்தால் அமைக்கவும்.

source: Ability to turn on and off measurement mitigation.
es_un: Capacidad para activar y desactivar la mitigación de medición.
ja_jp: 測定エラーの軽減をオンまたはオフにする機能。
ko_kr: 측정 완화를 켜고 끄는 기능.
pt_un: Capacidade de ativar e desativar a mitigação de medida.
ta_in: அளவீட்டுத் தணிப்பை ஆன் மற்றும் ஆஃப் செய்யும் திறன்.

source: Specifying the form of the input values
es_un: Especificación de la forma de los valores de entrada
ja_jp: 入力値の形式の指定
ko_kr: 입력 값의 형태 지정하기
pt_un: Especificando a forma dos valores de entrada
ta_in: உள்ளீட்டு மதிப்புகளின் படிவத்தைக் குறிப்பிடுதல்

source: All inputs to runtime programs must be serializable objects. That is to say, whatever you pass into a runtime program must be able to be converted to JSON format. It is thus beneficial to keep inputs limited to basic data types and structures unless you have experience with custom object serialization, or they are common Qiskit types such as ``QuantumCircuit`` etc that the built-in ``RuntimeEncoder`` can handle. Fortunately, the VQE program described above can be made out of simple Python components.
es_un: Todas las entradas a los programas runtime deben ser objetos serializables. Es decir, todo lo que pases a un programa runtime debe poder convertirse al formato JSON. Por lo tanto, es beneficioso mantener las entradas limitadas a estructuras y tipos de datos básicos, a menos que tengas experiencia con la serialización de objetos personalizados, o que sean tipos comunes de Qiskit, como ``QuantumCircuit``, etc., que el ``RuntimeEncoder`` integrado pueda manejar. Afortunadamente, el programa VQE descrito anteriormente se puede hacer con componentes simples de Python.
ja_jp: Runtime プログラムへのすべての入力は、シリアライズ可能なオブジェクトである必要があります。 つまり、runtime プログラムに渡すものはすべて、JSON形式に変換できる必要があります。 したがって、カスタムオブジェクトのシリアライズ化の経験があるか、または組み込みの ``RuntimeEncoder`` で処理できる ``QuantumCircuit`` などの一般的なQiskitタイプでない限り、入力を基本的なデータ型と構造に限定しておくと便利です。 幸い、上記のVQEプログラムは、単純なPythonコンポーネントで作成できます。
ko_kr: 런타임 프로그램을 위한 모든 입력은 직렬화 가능한 객체여야 한다. 즉, 런타임 프로그램에 전달하는 모든 것은 JSON 형식으로 변환할 수 있어야 한다. 사용자 정의 객체 직렬화 경험이 있거나 그것이 내장된 ``RuntimeEncoder`` 가 처리할 수 있는 ``QuantumCircuit`` 등의 일반적인 Qiskit 유형이 아닌 한, 이와 같이 입력을 기본 자료형과 구조로 제한하는 것이 유용하다. 다행스럽게도 위에서 설명한 VQE 프로그램은 간단한 파이썬 구성 요소로 만들 수 있다.
pt_un: Todas as entradas para programas de runtime devem ser objetos serializáveis. Ou seja, tudo o que você passa para um programa de runtime deve poder ser convertido para o formato JSON. Portanto, é benéfico manter as entradas limitadas a tipos e estruturas de dados básicos, a menos que você tenha experiência com serialização de objetos personalizados, ou são tipos comuns ao Qiskit, como ``QuantumCircuit`` etc, que o ``RuntimeEncoder`` integrado pode manipular. Felizmente, o programa VQE descrito acima pode ser feito de componentes simples de Python.
ta_in: இயக்க நேர நிரல்களுக்கான அனைத்து உள்ளீடுகளும் வரிசைப்படுத்தக்கூடிய பொருள்களாக இருக்க வேண்டும். அதாவது, நீங்கள் இயக்க நேர நிரலில் எதைக் கடந்து சென்றாலும் அதை JSON வடிவத்திற்கு மாற்ற முடியும். தனிப்பயன் பொருள் வரிசையாக்கத்தில் அனுபவம் இல்லாவிட்டால் உள்ளீடுகளை அடிப்படை தரவு வகைகள் மற்றும் கட்டமைப்புகளுக்கு மட்டுப்படுத்துவது நன்மை பயக்கும், அல்லது அவை உள்ளமைக்கப்பட்ட ``இயக்க நேர குறியாக்கி`` கையாளக்கூடிய ``குவாண்டம் சர்க்யூட்`` போன்ற பொதுவான Qiskit வகைகளாகும். அதிர்ஷ்டவசமாக, மேலே விவரிக்கப்பட்ட VQE நிரல் எளிய பைதான் கூறுகளிலிருந்து உருவாக்கப்படலாம்.

source: First, it is possible to represent any Hamiltonian using a list of values with each containing the numerical coefficeint for each term and the string representation for the Pauli operators. For the above example, the ground state energy with :math:`A=1` is :math:`-3` and we can write it as:
es_un: Primero, es posible representar cualquier Hamiltoniano utilizando una lista de valores, cada uno de los cuales contiene el coeficiente numérico para cada término y la representación de cadena para los operadores de Pauli. Para el ejemplo anterior, la energía del estado fundamental con :math:`A=1` es :math:`-3` y podemos escribirla como:
ja_jp: まず、各項の数値係数とパウリ演算子の文字列表現を含む値のリストを使用して、任意のハミルトニアンを表すことができます。 上記の例では、:math:`A=1` の基底状態エネルギーは :math:`-3` であり、次のように記述できます。
ko_kr: 첫째로, 각 용어에 대한 숫자 계수와 파울리 연산자에 대한 문자열 표현을 각각 포함한 값의 목록을 이용하여 임의의 해밀토니안을 나타낼 수 있다. 위의 예시에서 :math:`A=1` 을 갖는 바닥 상태 에너지는 :math:`-3` 이며, 다음과 같이 작성할 수 있다:
pt_un: Primeiro, é possível representar qualquer Hamiltoniano usando uma lista de valores com cada um contendo o coeficiente numérico para cada termo e a representação em string para os operadores de Pauli. Para o exemplo acima, a energia do estado fundamental com :math:`A=1` é :math:`-3` e podemos escrevê-la como:
ta_in: முதலாவதாக, எந்தவொரு ஹாமில்டோனியனையும் பிரதிநிதித்துவப்படுத்துவது, மதிப்புகளின் பட்டியலைப் பயன்படுத்தி, ஒவ்வொன்றும் ஒவ்வொரு காலத்திற்கான எண்ணியல் கூட்டுத்தொகை மற்றும் பாலி ஆபரேட்டர்களுக்கான சரம் பிரதிநிதித்துவம் ஆகியவற்றைக் கொண்டிருக்கும். மேலே உள்ள எடுத்துக்காட்டிற்கு, :math:`A=1` உடன் நில நிலை ஆற்றல் :math:`-3` மற்றும் நாம் இதை இவ்வாறு எழுதலாம்:

source: Next we have to provide the ability to specify the parameterized Ansatz circuit. Here we will take advantage of the fact that many ansatz circuits are pre-defined in the Qiskit Circuit Library. Examples can be found in the `N-local circuits section <https://qiskit.org/documentation/apidoc/circuit_library.html#n-local-circuits>`__.
es_un: A continuación, debemos proporcionar la capacidad de especificar el circuito Ansatz parametrizado. Aquí aprovecharemos el hecho de que muchos circuitos ansatz están predefinidos en la Biblioteca de Circuitos de Qiskit. Se pueden encontrar ejemplos en la `sección de circuitos N-local <https://qiskit.org/documentation/apidoc/circuit_library.html#n-local-circuits>`__.
