Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/sample_vqe_program/qiskit_runtime_vqe_program.po
Languages: es_un, ja_jp, ko_kr, pt_un, ta_in

source: We would like the user to be able to select between ansatz options such as: ``NLocal``, ``TwoLocal``, and ``EfficientSU2``. We could have the user pass the whole ansatz circuit to the program; however, in order to reduce the size of the upload we will pass the ansatz by name. In the runtime program, we can take this name and get the class that it corresponds to from the library using, for example,
es_un: Nos gustaría que el usuario pudiera seleccionar entre las opciones de ansatz como: ``NLocal``, ``TwoLocal``, y ``EfficientSU2``. Podríamos hacer que el usuario pase todo el circuito ansatz al programa; sin embargo, para reducir el tamaño de la carga, pasaremos el ansatz por nombre. En el programa runtime, podemos tomar este nombre y obtener la clase a la que corresponde de la biblioteca usando, por ejemplo,
ja_jp: ユーザーが ``NLocal`` 、``TwoLocal`` および ``EfficientSU2`` などの ansatz オプションから選択できるようにしたいと考えています。 ユーザーに ansatz 回路全体をプログラムに渡してもらうこともできますが、アップロードのサイズを小さくするために、ansatz を名前で渡すことにします。 Runtime プログラムでは、この名前を取得し、たとえば、次のようにしてライブラリから対応するクラスを取得できます。
ko_kr: 사용자가 ``NLocal``, ``TwoLocal`` 및 ``EfficientSU2`` 와 같은 ansatz 옵션 중에서 선택할 수 있길 바란다. 사용자가 전체 ansatz 회로를 프로그램에 전달하도록 할 수도 있지만, 업로드 크기를 줄이기 위해 이름을 통해 ansatz를 전달하도록 한다. 런타임 프로그램에서 이 이름을 사용하여 라이브러리에서 해당하는 클래스를 얻을 수 있다. 예를 들면,
pt_un: Gostaríamos que o usuário pudesse selecionar entre opções ansatz como: ``NLocal``, ``TwoLocal`` e ``EfficientSU2``. Poderíamos fazer com que o usuário passasse todo o circuito ansatz para o programa; no entanto, para reduzir o tamanho do upload, passaremos o ansatz pelo nome. No programa runtime, podemos pegar esse nome e pegar a classe que ele corresponde da biblioteca usando, por exemplo,
ta_in: ``NLocal``, ``TwoLocal`` மற்றும் ``EfficientSU2`` போன்ற ansatz விருப்பங்களுக்கு இடையே பயனர் தேர்ந்தெடுக்க வேண்டும் என்று நாங்கள் விரும்புகிறோம். பயனர் முழு அன்சட்ஸ் சர்க்யூட்டையும் நிரலுக்கு அனுப்பலாம்; இருப்பினும், பதிவேற்றத்தின் அளவைக் குறைப்பதற்காக நாம் அன்சட்ஸ் பெயரால் அனுப்புவோம். இயக்க நேர நிரலில், நாம் இந்தப் பெயரை எடுத்து, நூலகத்தில் இருந்து அது ஒத்த வகுப்பைப் பெறலாம், எடுத்துக்காட்டாக,

source: For the ansatz configuration, we will pass a simple ``dict`` of values.
es_un: Para la configuración de ansatz, pasaremos un simple ``dict`` de valores.
ja_jp: ansatz 構成では、単純な ``dict`` の値を入力します。
ko_kr: ansatz의 구성을 위해 우리는 단순한 값의 ``dict`` 를 전달할 것이다.
pt_un: Para a configuração do ansatz, passaremos um simples ``dict`` de valores.
ta_in: அன்சட்ஸ் உள்ளமைவுக்கு, நாம் ஒரு எளிய ``டிக்ட்`` மதிப்புகளை அனுப்புவோம்.

source: Optionals
es_un: Opcionales
ja_jp: オプション
ko_kr: 선택 사항
pt_un: Opcionais
ta_in: விருப்பங்கள்

source: If we want to add the ability to pass an initial state, then we will need to add the ability to pass a 1D list/ NumPy array. Because the number of parameters depends on the ansatz and its configuration, the user would have to know what ansatz they are doing ahead of time.
es_un: Si queremos agregar la capacidad de pasar un estado inicial, necesitaremos agregar la capacidad de pasar una lista 1D / arreglo NumPy. Debido a que la cantidad de parámetros depende del ansatz y su configuración, el usuario debería saber qué ansatz está usando con anticipación.
ja_jp: 初期状態を渡す機能を追加したい場合は、一次元リスト/ NumPy 配列を渡す機能を追加する必要があります。 パラメーターの数は、 ansatz とその構成に依存しているため、ユーザーは、前もって何をしているかを知る必要があります。
ko_kr: 초기 상태를 전달하는 기능을 추가하고자 한다면, 1D list/ NumPy 배열을 전달하는 기능을 추가해야 한다. 매개변수의 개수는 ansatz와 그것의 구성에 따라 달라지므로, 사용자는 자신이 어떤 ansatz를 수행하는지 미리 알아야 한다.
pt_un: Se quisermos adicionar a capacidade de passar um estado inicial, precisaremos adicionar a capacidade de passar uma lista 1D/array NumPy. Como o número de parâmetros depende do ansatz e de sua configuração, o usuário precisa saber com antecedência qual ansatz está fazendo.
ta_in: ஆரம்ப நிலையைக் கடந்து செல்லும் திறனை நாம் சேர்க்க விரும்பினால், 1D பட்டியல்/ NumPy வரிசையைக் கடந்து செல்லும் திறனை நாம் சேர்க்க வேண்டும். அளவுருக்களின் எண்ணிக்கை அன்சட்ஸ் மற்றும் அதன் உள்ளமைவைப் பொறுத்தது என்பதால், பயனர் அவர்கள் என்ன அன்சட்ஸ் செய்கிறார்கள் என்பதை முன்கூட்டியே தெரிந்து கொள்ள வேண்டும்.

source: Selecting a number of shots requires simply passing an integer value.
es_un: Seleccionar un número de iteraciones requiere simplemente pasar un valor entero.
ja_jp: ショットの数を選択するには、単純に整数値を渡す必要があります。
ko_kr: 다수의 샷을 선택하고자 한다면 단순히 정수 값을 전달해야 한다.
pt_un: Selecionar um número de tentativas requer simplesmente passar um valor inteiro.
ta_in: பல காட்சிகளைத் தேர்ந்தெடுப்பதற்கு ஒரு முழு எண் மதிப்பைக் கடக்க வேண்டும்.

source: Here we will allow selecting a classical optimizer by name from those in SciPy, and a ``dict`` of configuration parameters. Note that for execution on an actual system, the noise inherent in today’s quantum systems makes having a stochastic optimizer crucial to success. SciPy does not have such a choice, and the one built into Qiskit is wrapped in such a manner as to make it difficult to use elsewhere. As such, here we will use an SPSA optimizer written to match the style of those in SciPy. This function is given in `Appendix A <#Appendix-A>`__.
es_un: Aquí permitiremos seleccionar un optimizador clásico por su nombre entre SciPy, y un ``dict`` de parámetros de configuración. Ten en cuenta que para la ejecución en un sistema real, el ruido inherente a los sistemas cuánticos actuales hace que tener un optimizador estocástico sea crucial para tener éxito. SciPy no tiene esa opción, y el integrado en Qiskit está envuelto de tal manera que dificulta su uso en otros lugares. Como tal, aquí usaremos un optimizador SPSA escrito para que coincida con el estilo de los de SciPy. Esta función se proporciona en el `Apéndice A <#Appendix-A>`__.
ja_jp: ここでは、SciPyに名前を付け、構成パラメータの ``dict`` を使用することで、古典的な最適化プログラムを選択することができます。 実際のシステムで実行するためには、今日の量子システムのもつノイズのために、成功するためには、確率的な最適化プログラムが不可欠なものであることに注意してください。 SciPy はこのような選択肢はなく、 Qiskit に組み込まれたものは、他の場所での使用を困難にするような方法でラップされています。 したがって、ここでは、 SciPyのものと同じようなスタイルで書かれたSPSA 最適化プログラムを使用して、 この関数は、 `Appendix A <#Appendix-A>`__ に記載されています。
ko_kr: 여기에서는 SciPy에 있는 이름을 통해 고전적인 최적화기를 선택하고 구성 매개변수의 ``dict`` 를 선택할 수 있게 할 것이다. 실제 시스템에서 사용하려면 오늘날의 양자 시스템에 내재된 노이즈로 인해 확률적 최적화기가 성공에 결정적으로 중요하다는 것을 참고하라. SciPy에는 그러한 선택지가 없으며, Qiskit에 내장되어 있는 것은 다른 곳에서 사용하기 어렵게 포장되어 있다. 따라서 여기서는 SciPy의 스타일과 일치하도록 작성된 SPSA 최적화기를 사용할 것이다. 이 함수는 `부록 A <#Appendix-A>`__ 에 제공된다.
pt_un: Aqui permitiremos selecionar um otimizador clássico por nome daqueles disponíveis no SciPy, e um ``dict`` de parâmetros de configuração. Observe que, para execução em um sistema real, o ruído inerente aos sistemas quânticos de hoje faz com que um otimizador estocástico seja crucial para o sucesso. O SciPy não tem essa escolha, e o embutido no Qiskit é encapsulado de forma a dificultar o uso em outro lugar. Como tal, aqui usaremos um otimizador SPSA escrito para combinar com o estilo daqueles no SciPy. Esta função é fornecida em `Apêndice A <#Appendix-A>`__.
ta_in: SciPy இல் உள்ளவற்றிலிருந்து பெயரின் அடிப்படையில் ஒரு கிளாசிக்கல் ஆப்டிமைசரைத் தேர்ந்தெடுப்பதையும், உள்ளமைவு அளவுருக்களின் ``டிக்ட்`` ஐயும் இங்கே நாம் அனுமதிப்போம். ஒரு உண்மையான கணினியில் செயல்படுத்துவதற்கு, இன்றைய குவாண்டம் அமைப்புகளில் உள்ளார்ந்த சத்தம், ஒரு சீரான உகப்பாக்கியைக் கொண்டிருப்பது வெற்றிக்கு முக்கியமானது என்பதை நினைவில் கொள்க. SciPy அத்தகைய தேர்வு இல்லை, மேலும் Qiskit இல் கட்டமைக்கப்பட்ட ஒன்று மற்ற இடங்களில் பயன்படுத்துவதை கடினமாக்கும் வகையில் மூடப்பட்டிருக்கும். எனவே, SciPy இல் உள்ளவர்களின் பாணியைப் பொருத்த எழுதப்பட்ட SPSA ஆப்டிமைசரை இங்கே பயன்படுத்துவோம். இந்த செயல்பாடு `இணைப்பு A <#இணைப்பு-A>`__ இல் கொடுக்கப்பட்டுள்ளது.

source: Finally, for measurement error mitigation we can simply pass a boolean (True/False) value.
es_un: Finalmente, para la mitigación de errores de medición, simplemente podemos pasar un valor booleano (True/False).
ja_jp: 最後に、測定誤差軽減のために、単にブール値 (True/False) の値を渡すことができます。
ko_kr: 마지막으로, 측정 오류 완화를 위해 단순히 불 (참/거짓) 값을 전달할 수 있다.
pt_un: Finalmente, para mitigação de erros de medida, podemos simplesmente passar um valor booleano (True/False).
ta_in: இறுதியாக, அளவீட்டுப் பிழையைத் தணிக்க நாம் ஒரு பூலியன் (உண்மை/தவறு) மதிப்பை அனுப்பலாம்.

source: Main program
es_un: Programa principal
ja_jp: メイン・プログラム
ko_kr: 메인 프로그램
pt_un: Programa principal
ta_in: முக்கிய நிரல்

source: We are now in a position to start building our main program. However, before doing so we point out that it makes the code cleaner to make a separate function that takes strings of Pauli operators that define our Hamiltonian and convert them to a list of circuits with single-qubit gates that change the measurement basis for each qubit, if needed. This function is given in `Appendix B <#Appendix-B>`__.
es_un: Ahora estamos en condiciones de comenzar a construir nuestro programa principal. Sin embargo, antes de hacerlo, señalamos que hace que el código sea más limpio al crear una función separada que toma cadenas de operadores de Pauli que definen nuestro Hamiltoniano y las convierte en una lista de circuitos con compuertas de un solo qubit que cambian la base de medición para cada qubit, si es necesario. Esta función se proporciona en el `Apéndice B <#Appendix-B>`__.
ja_jp: これで、メインプログラムの構築を開始できるようになりました。 しかし、これを行う前に、ハミルトニアンを定義するパウリ演算子の文字列を分離し、必要に応じて各量子ビットの測定基準を変更するシングル量子ビット・ゲートを持つ回路のリストに変換する関数を別に作っておくと、コードがすっきりします。この関数は、 `Appendix B <#Appendix-B>`__ に記載されています。
ko_kr: 이제 메인 프로그램을 구축하기 시작할 위치에 있다. 그러나 그 전에, 파울리 (Pauli) 연산자의 문자열을 취하여 우리의 해밀토니안을 정의하고 필요시 각 큐비트에 대한 측정 기준을 변경하는 단일 큐비트 게이트가 있는 회로의 목록으로 변환하는 분리된 함수를 만드는 것이 코드를 더 깔끔하게 만든다는 점을 유의하라. 이 함수는 `Appendix B <#Appendix-B>`__ 에서 제공된다.
ta_in: நாங்கள் இப்போது எங்கள் முக்கிய திட்டத்தை உருவாக்கத் தொடங்கும் நிலையில் இருக்கிறோம். எவ்வாறாயினும், அவ்வாறு செய்வதற்கு முன், எங்கள் ஹாமில்டோனியனை வரையறுக்கும் பாலி ஆபரேட்டர்களின் சரங்களை எடுத்து, ஒவ்வொரு குவிட்டின் அளவீட்டு அடிப்படையை மாற்றும் ஒற்றை-குபிட் கேட்கள் கொண்ட சுற்றுகளின் பட்டியலுக்கு மாற்றும் ஒரு தனி செயல்பாட்டைச் செய்வது குறியீட்டை சுத்தப்படுத்துகிறது என்பதை நாங்கள் சுட்டிக்காட்டுகிறோம்., தேவைப்பட்டால். இந்த செயல்பாடு `இணைப்பு B <#Appendix-B>`__ இல் கொடுக்கப்பட்டுள்ளது.

source: Required signature
es_un: Firma requerida
ja_jp: 必要な署名
ko_kr: 필수 시그니처
pt_un: Assinatura necessária
ta_in: கையொப்பம் தேவை

source: Every runtime program is defined via the ``main`` function, and must have the following input signature:
es_un: Cada programa runtime se define a través de la función ``main`` y debe tener la siguiente firma de entrada:
ja_jp: すべての runtime プログラムは ``main`` 関数を介して定義され、以下の入力署名を持っている必要があります。
ko_kr: 모든 런타임 프로그램은 ``main`` 함수를 통해 정의되며, 다음과 같은 입력 시그니처를 가져야 한다.
pt_un: Todo programa de runtime é definido através da função ``main``, e deve ter a seguinte assinatura de entrada:
ta_in: ஒவ்வொரு இயக்க நேர நிரலும் ``முதன்மை`` செயல்பாட்டின் மூலம் வரையறுக்கப்படுகிறது, மேலும் பின்வரும் உள்ளீட்டு கையொப்பம் இருக்க வேண்டும்:

source: where ``backend`` is the backend that the program is to be executed on, and ``user_message`` is the class by which interim (and possibly final) results are communicated back to the user. After these two items, we add our program-specific arguments and keyword arguments.
es_un: donde ``backend`` es el backend en el que se ejecutará el programa, y ``user_message`` es la clase mediante la cual los resultados provisionales (y posiblemente finales) se comunican al usuario. Después de estos dos elementos, agregamos nuestros argumentos específicos del programa y argumentos de palabras clave.
ja_jp: ``backend`` は、プログラムが実行されるバックエンドであり、 ``user_message`` は、中間結果 (最終結果もあり得る) をユーザーに伝えるためのクラスです。 これらの 2 つの項目の後に、プログラム固有の引数およびキーワード引数を追加します。
ko_kr: 여기서, ``backend`` 는 프로그램이 실행되는 백엔드고, ``user_message`` 는 임시 (그리고 어쩌면 최종) 결과가 사용자에게 다시 전달되는 클래스다. 이 두 항목 뒤에는 프로그램에 따른 전달인자 및 키워드 전달인자를 추가한다.
pt_un: onde ``backend`` é o backend no qual o programa deve ser executado, e ``user_message`` é a classe pela qual os resultados provisórios (e possivelmente finais) são comunicados de volta ao usuário. Após esses dois itens, adicionamos nossos argumentos específicos do programa e argumentos de palavras-chave.
ta_in: இதில் ``பேக்கெண்ட்`` என்பது நிரல் செயல்படுத்தப்பட வேண்டிய பின்தளமாகும், மேலும் ``பயனர்_செய்தி`` என்பது இடைக்கால (மற்றும் இறுதியான) முடிவுகள் பயனருக்குத் தெரிவிக்கப்படும் வகுப்பாகும். இந்த இரண்டு உருப்படிகளுக்குப் பிறகு, எங்கள் நிரல் சார்ந்த வாதங்கள் மற்றும் முக்கிய வாதங்களைச் சேர்க்கிறோம்.

source: The main VQE program
es_un: El programa VQE principal
ja_jp: メイン VQE プログラム
ko_kr: 메인 VQE 프로그램
pt_un: O programa VQE principal
ta_in: முக்கிய VQE திட்டம்

source: Here is the main program for our sample VQE. What each element of the function does is written in the comments before the element appears.
es_un: Aquí está el programa principal para nuestro VQE de muestra. Lo que hace cada elemento de la función está escrito en los comentarios antes de que aparezca el elemento.
ja_jp: ここでは、サンプル VQEのメインプログラムを示します。 関数の各要素が何をするものかは、その要素が現れる前のコメントに書いてあります。
ko_kr: 이것은 우리의 샘플 VQE의 메인 프로그램이다. 함수의 각 구성요소가 무엇을 하는지는 그 구성요소가 나타나기 전에 주석으로 적혀 있다.
pt_un: Aqui está o programa principal para nosso exemplo de VQE. O que cada elemento da função faz é escrito nos comentários antes que o elemento apareça.
ta_in: எங்கள் மாதிரி VQE க்கான முக்கிய நிரல் இங்கே. செயல்பாட்டின் ஒவ்வொரு உறுப்பு என்ன செய்கிறது என்பது உறுப்பு தோன்றும் முன் கருத்துகளில் எழுதப்பட்டுள்ளது.

source: This program uses the ``mthree`` measurement mitigation package. You can install the package via ``pip install mthree``.
es_un: Este programa utiliza el paquete de mitigación de mediciones ``mthree``. Puedes instalar el paquete a través de ``pip install mthree``.
ja_jp: このプログラムは、 ``mthree`` の測定エラー緩和パッケージを使用します。 このパッケージは ``pip install mthree`` でインストールできます。
ko_kr: 이 프로그램은 ``mthree`` 측정 완화 패키지를 사용한다. ``pip install mthree`` 를 통해 패키지를 설치할 수 있다.
pt_un: Este programa usa o pacote de mitigação de medida ``mthree``. Você pode instalar o pacote via ``pip install mthree``.
ta_in: இந்த நிரல் ``mthree`` அளவீட்டுத் தணிப்பு தொகுப்பைப் பயன்படுத்துகிறது. நீங்கள் தொகுப்பை ``pip install mthree`` மூலம் நிறுவலாம்.

source: Local testing
es_un: Pruebas locales
ja_jp: ローカル・テスト
ko_kr: 로컬 테스트
pt_un: Testando localmente
ta_in: உள்ளூர் சோதனை

source: Important: You need to execute the code blocks in Appendices A and B before continuing.
es_un: Importante: Debes ejecutar los bloques de código en los Apéndices A y B antes de continuar.
ja_jp: 重要: 続行する前に、付録 A および B 内のコード・ブロックを実行する必要があります。
ko_kr: 중요: 계속하기 전에 부록 A와 B의 코드 블록을 실행해야 한다.
pt_un: Importante: Você precisa executar os blocos de código nos Apêndices A e B antes de continuar.
ta_in: முக்கியமானது: தொடர்வதற்கு முன் பின் இணைப்புகள் A மற்றும் B இல் உள்ள குறியீடு தொகுதிகளை இயக்க வேண்டும்.

source: We can test whether our routine works by simply calling the ``main`` function with a backend instance, a ``UserMessenger``, and sample arguments.
es_un: Podemos probar si nuestra rutina funciona simplemente llamando a la función ``main`` con una instancia de backend, un ``UserMessenger`` y argumentos de muestra.
ja_jp: 私たちは、バックエンドのインスタンスと ``UserMessenger`` 、サンプルの引数を指定して ``main`` 関数を呼び出すだけで、このルーチンが動作するかどうかをテストすることができます。
ko_kr: 백엔드 인스턴스, ``UserMessenger``, 그리고 샘플 전달인자를 사용하여 ``main`` 함수를 단순히 호출함으로써 루틴이 작동하는지 여부를 테스트할 수 있다.
pt_un: Podemos testar se nossa rotina funciona simplesmente chamando a função ``main`` com uma instância de backend, um ``UserMessenger`` e argumentos de amostra.
ta_in: ஒரு பின்னணி நிகழ்வு, ``பயனர்-செய்தி`` மற்றும் மாதிரி வாதங்கள்மூலம் ``முதன்மை`` செயல்பாட்டை அழைப்பதன் மூலம் எங்கள் வழக்கம் செயல்படுகிறதா என்பதைச் சோதிக்கலாம்.

source: Having executed the above, we see that there are 5 parameter arrays returned, one for each callback, along with the final optimization result. The parameter arrays are the interim results, and the ``UserMessenger`` object prints these values to the cell output. The output itself is the answer we obtained, expressed as a SciPy ``OptimizerResult`` object.
es_un: Habiendo ejecutado lo anterior, vemos que se devuelven 5 arreglos de parámetros, una para cada devolución de llamada, junto con el resultado final de la optimización. Los arreglos de parámetros son los resultados provisionales, y el objeto ``UserMessenger`` imprime estos valores en la salida de la celda. El resultado en sí es la respuesta que obtuvimos, expresada como un objeto SciPy ``OptimizerResult``.
ja_jp: 上記を実行すると、最終的な最適化結果とともに、コールバックごとに1つずつ、合計5つのパラメーター配列が返されることがわかります。 パラメーター配列は中間結果であり、 ``UserMessenger`` オブジェクトはこれらの値をセル出力に出力します。 出力自体は、SciPy ``OptimizerResult`` オブジェクトとして表現された私たちが得た答えです。
ko_kr: 위에서 실행한 결과, 최종 최적화 결과와 함께 각 콜백에 대해 하나씩, 다섯개의 매개변수 배열이 반환되는 것을 볼 수 있다. 매개변수 배열은 중간 결과이며, ``UserMessenger`` 객체는 이 값을 셀 출력에 출력한다. 출력 그 자체는 우리가 얻은 답으로, SciPy ``OptimizerResult`` 객체로 표현된다.
pt_un: Tendo executado o acima, vemos que há 5 arrays de parâmetros retornados, um para cada callback, junto com o resultado final da otimização. Os arrays de parâmetros são os resultados provisórios, e o objeto ``UserMessenger`` imprime esses valores na saída da célula. A saída em si é a resposta que obtivemos, expressa como um objeto SciPy ``OptimizerResult``.
ta_in: மேலே உள்ளவற்றைச் செயல்படுத்திய பிறகு, 5 அளவுரு வரிசைகள் திரும்பியிருப்பதைக் காண்கிறோம், ஒவ்வொரு அழைப்புக்கும் ஒன்று, இறுதி தேர்வுமுறை முடிவுடன். அளவுரு வரிசைகள் இடைக்கால முடிவுகளாகும், மேலும் ``பயனர்-செய்தி`` ஆப்ஜெக்ட் இந்த மதிப்புகளை செல் வெளியீட்டில் அச்சிடுகிறது. வெளியீடு என்பது நாம் பெற்ற பதில், SciPy ``ஆப்டிமைசர் முடிவு`` பொருளாக வெளிப்படுத்தப்படுகிறது.

source: Program metadata
es_un: Metadatos del programa
ja_jp: プログラムのメタデータ
ko_kr: 프로그램 메타데이터
pt_un: Metadados do programa
ta_in: நிரல் மெட்டாடேட்டா

source: Program metadata is essentially the docstring for a runtime program. It describes overall program information such as the program ``name``, ``description``, and the ``max_execution_time`` the program is allowed to run, as well as details the inputs and the outputs the program expects. At a bare minimum the values described above are required
es_un: Los metadatos del programa son esencialmente la docstring para un programa runtime. Describe la información general del programa, como el ``name``, ``description``, y el ``max_execution_time`` en el que el programa se puede ejecutar, así como los detalles de las entradas y las salidas que espera el programa. Como mínimo, se requieren los valores descritos anteriormente
ja_jp: プログラムのメタデータは、基本的に runtime プログラムの docstring です。 プログラムの ``name``, ``description``, および ``max_execution_time`` などのプログラム全体の情報と、プログラムが期待する入力と出力の詳細を説明します。 最低限、上記の値が必要です
ko_kr: 프로그램 메타데이터는 본질적으로 런타임 프로그램의 독스트링이다. 그것은 프로그램이 기대하는 입력과 출력을 자세히 설명할 뿐만 아니라, 프로그램의 ``name``, ``description``, 그리고 그 프로그램이 실행할 수 있는 ``max_execution_time`` 과 같은 프로그램 전반적인 정보를 설명한다. 최소한 위에서 설명한 값은 필수적이다.
pt_un: Os metadados do programa são essencialmente a docstring para um programa de runtime. Eles descrevem informações gerais do programa, como ``name``, ``description``, e o ``max_execution_time`` que o programa pode executar, bem como detalha as entradas e saídas que o programa espera. No mínimo, os valores descritos acima são necessários
ta_in: நிரல் மெட்டாடேட்டா என்பது இயக்க நேர நிரலுக்கான டாக்ஸ்ட்ரிங் ஆகும். நிரல் ``பெயர்``, ``விளக்கம்``, மற்றும் ``அதிகபட்ச_செயல்படுத்தல்_நேரம்`` போன்ற நிரல்களின் ஒட்டுமொத்தத் தகவலை இது விவரிக்கிறது, அத்துடன் நிரல் எதிர்பார்க்கும் உள்ளீடுகள் மற்றும் வெளியீடுகளின் விவரங்களையும் விவரிக்கிறது. குறைந்தபட்சம் மேலே விவரிக்கப்பட்ட மதிப்புகள் தேவை

source: It is important to set the ``max_execution_time`` high enough so that your program does not get terminated unexpectedly. Additionally, one should make sure that interim results are sent back to the user so that, if something does happen, the user can start where they left off.
es_un: Es importante configurar el ``max_execution_time`` lo suficientemente alto para que tu programa no termine inesperadamente. Además, uno debe asegurarse de que los resultados intermedios se envíen de vuelta al usuario para que, si sucede algo, el usuario pueda comenzar donde lo dejó.
ja_jp: プログラムが予期せず終了しないように、``max_execution_time`` を十分に高く設定することが重要です。 さらに、中間結果がユーザーに返送されることを確認して、何かが発生した場合に、ユーザーが中断したところから開始できるようにする必要があります。
ko_kr: ``max_execution_time`` 을 충분히 높게 설정하여 프로그램이 예기치 않게 종료되지 않도록 하는 것이 중요하다. 또한, 어떤 일이 발생하면 사용자가 중단된 위치에서 시작할 수 있도록 중간 결과를 사용자에게 다시 전송되도록 확실히 전송해야 한다.
pt_un: É importante definir o ``max_execution_time`` alto o suficiente para que seu programa não seja encerrado inesperadamente. Além disso, deve-se garantir que os resultados provisórios sejam enviados de volta ao usuário para que, se algo acontecer, o usuário possa começar de onde parou.
ta_in: ``அதிகபட்ச_செயல்படுத்தல்_நேரம்`` ஐ போதுமான அளவு அதிகமாக அமைப்பது முக்கியம், இதனால் உங்கள் நிரல் எதிர்பாராதவிதமாக நிறுத்தப்படாது. கூடுதலாக, இடைக்கால முடிவுகள் பயனருக்குத் திருப்பி அனுப்பப்படுவதை உறுதிசெய்ய வேண்டும், இதனால் ஏதாவது நடந்தால், பயனர் அவர்கள் விட்ட இடத்திலிருந்து தொடங்கலாம்.

source: It is, however, good form to detail the parameters and return types, as well as interim results. That being said, if making a runtime intended to be used by others, this information would also likely be mirrored in the signature of a function or class that the user would interact with directly; end users should not directly call runtime programs. We will see why below. Nevertheless, let us add to our metadata. First, the ``parameters`` section details the inputs the user is able to pass:
es_un: Sin embargo, es una buena forma detallar los parámetros y los tipos de devolución, así como los resultados intermedios. Dicho esto, si se crea un runtime destinado a ser utilizado por otros, es probable que esta información también se refleje en la firma de una función o clase con la que el usuario interactuaría directamente; los usuarios finales no deben llamar directamente a los programas runtime. Veremos por qué a continuación. Sin embargo, agreguemos a nuestros metadatos. Primero, la sección ``parameters`` detalla las entradas que el usuario puede pasar:
ja_jp: ただし、中間結果だけでなく、パラメーターと戻りの型を詳述するのは良いフォームです。 この情報は、他のユーザーが使うことを意図した runtime を作る場合、この情報は、ユーザーが直接操作する関数やクラスのシグニチャーにも反映されことが多いでしょう。エンド・ユーザーは、runtime プログラムを直接呼び出すべきではありません。 理由について以下に説明します。 それでも、メタデータに追加することはできます。 まず、 ``parameters`` セクションで、ユーザーが渡すことができる入力について詳しく説明します。
ko_kr: 그러나 중간 결과뿐만 아니라 매개변수와 변환 자료형을 자세히 설명하는 것이 좋은 양식이다. 말하자면, 런타임을 다른 사람이 사용하도록 만드는 경우, 이 정보는 사용자가 직접 상호작용할 함수나 클래스의 시그니처에도 반영될 수 있다. 최종 사용자는 런타임 프로그램을 직접 호출하지 않아야 한다. 아래서 그 이유를 살펴볼 것이다. 그럼에도 불구하고 메타데이터를 추가하도록 하자. 먼저, ``parameters`` 섹션은 사용자가 전달할 수 있는 입력에 대해 자세히 설명한다.
pt_un: No entanto, é conveniente detalhar os parâmetros e os tipos de retorno, bem como os resultados provisórios. Dito isto, se estiver fazendo um runtime destinado a ser usado por outros, essa informação provavelmente também seria espelhada na assinatura de uma função ou classe com a qual o usuário interagiria diretamente; os usuários finais não devem chamar diretamente os programas de runtime. Veremos o porquê abaixo. No entanto, vamos adicionar aos nossos metadados. Primeiro, a seção ``parameters`` detalha as entradas que o usuário pode passar:
ta_in: இருப்பினும், அளவுருக்கள் மற்றும் திரும்புதல் வகைகள், அத்துடன் இடைக்கால முடிவுகள் ஆகியவற்றை விவரிப்பது நல்ல வடிவம். மற்றவர்கள் பயன்படுத்த விரும்பும் ஒரு இயக்க நேரத்தை உருவாக்கினால், இந்த தகவல் பயனர் நேரடியாக தொடர்பு கொள்ளும் ஒரு செயல்பாடு அல்லது வகுப்பின் கையொப்பத்தில் பிரதிபலிக்கும்: இறுதி பயனர்கள் இயக்க நேர நிரல்களை நேரடியாக அழைக்கக்கூடாது. நமது மெட்டாடேட்டாவை கூட்டுவோம். முதலில், ``அளவுருக்கள்`` பகுதி பயனர் கடந்து செல்லக்கூடிய உள்ளீடுகளை விவரிக்கிறது:

source: Next, the ``return_values`` section tells about the return types:
es_un: A continuación, la sección ``return_values`` informa sobre los tipos de devolución:
ja_jp: 次に、 ``return_values`` セクションは、戻りの型について次のように指定します。
ko_kr: 다음으로, ``return_values`` 섹션은 반환 타입에 대해 설명한다.
pt_un: Em seguida, a seção ``return_values`` informa sobre os tipos de retorno:
ta_in: அடுத்து, ``திரும்ப_மதிப்புகள்`` பிரிவு திரும்பும் வகைகளைப் பற்றிக் கூறுகிறது:
