Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/sample_vqe_program/qiskit_runtime_vqe_program.po
Languages: es_un, ja_jp, ko_kr, pt_un, ta_in

source: and finally let us specify what comes back when an interim result is returned:
es_un: y finalmente, especifiquemos qué regresa cuando se devuelve un resultado provisional:
ja_jp: 最後に、中間結果が返されたときに何が返されるかを指定しましょう。
ko_kr: 그리고 마지막으로 임시 결과가 반환될 때 돌아오는 내용을 명시한다:
pt_un: e, finalmente, vamos especificar o que volta quando um resultado provisório é retornado:
ta_in: இறுதியாக ஒரு இடைக்கால முடிவு திரும்பும்போது என்ன திரும்ப வருகிறது என்பதை குறிப்பிடுவோம்:

source: Uploading the program
es_un: Cargar el programa
ja_jp: プログラムのアップロード
ko_kr: 프로그램 업로드하기
pt_un: Fazendo o upload do programa
ta_in: நிரலைப் பதிவேற்றுகிறது

source: We now have all the ingredients needed to upload our program. To do so we need to collect all of our code in one file, here called ``sample_vqe.py`` for uploading. This limitation will be removed in later versions of Qiskit Runtime. Alternatively, if the entire code is contained within a single Jupyter notebook cell, this can be done using the magic function
es_un: Ahora tenemos todos los ingredientes necesarios para cargar nuestro programa. Para hacerlo, necesitamos recopilar todo nuestro código en un archivo, aquí llamado ``sample_vqe.py`` para ser cargado. Esta limitación se eliminará en versiones posteriores de Qiskit Runtime. Alternativamente, si el código completo está contenido dentro de una sola celda del cuaderno de Jupyter, esto se puede hacer usando la función mágica
ja_jp: これで、プログラムをアップロードするために必要なすべての要素が揃いました。 そのためには、アップロード用に ``sample_vqe.py`` と呼ばれる1つのファイルにすべてのコードを収集する必要があります。 この制限は、Qiskit Runtime の新しいバージョンで取り除かれる予定です。 または、コード全体が単一のJupyterノートブックのセルに含まれている場合、これはマジック関数を使用して実行できます。
ko_kr: 우리는 이제 프로그램을 업로드하는 데 필요한 모든 재료를 가지고 있다. 프로그램을 업로드 하려면 ``sample_vqe.py`` 라는 하나의 파일에 모든 코드를 모아야 한다. 이 제한사항은 추후 버전의 Qiskit 런타임에서 없어질 것이다. 대안으로, 전체 코드가 하나의 Jupyter 노트북 셀 안에 포함되어 있는 경우, 이를 매직 함수를 사용하여 수행할 수 있다.
pt_un: Agora temos todos os ingredientes necessários para fazer o upload do nosso programa. Para fazer isso, precisamos coletar todo o nosso código em um arquivo, aqui chamado ``sample_vqe.py`` para upload. Essa limitação será removida em versões posteriores do Qiskit Runtime. Alternativamente, se todo o código estiver contido em uma única célula do notebook Jupyter, isso pode ser feito usando a função mágica
ta_in: எங்கள் நிரலைப் பதிவேற்ற தேவையான அனைத்து பொருட்களும் இப்போது எங்களிடம் உள்ளன. அவ்வாறு செய்ய, பதிவேற்றுவதற்கு ``மாதிரி_vqe.py`` ரிக்க வேண்டும். இந்த வரம்பு Qiskit இயக்க நேரத்தின் பிந்தைய பதிப்புகளில் அகற்றப்படும். மாற்றாக, முழு குறியீடும் ஒரு ஜூபிட்டர் நோட்புக் கலத்திற்குள் இருந்தால், மேஜிக் செயல்பாட்டைப் பயன்படுத்தி இதைச் செய்யலாம்

source: To actually upload the program we need to initialize a Qiskit Runtime service:
es_un: Para cargar realmente el programa, necesitamos inicializar un servicio Qiskit Runtime:
ja_jp: 実際にプログラムをアップロードするには、 Qiskit Runtime サービスを初期化する必要があります。
ko_kr: 실제로 프로그램을 업로드하려면 Qiskit Runtime 서비스를 초기화해야 한다:
pt_un: Para realmente fazer o upload do programa, precisamos inicializar um serviço Qiskit Runtime:
ta_in: நிரலை உண்மையில் பதிவேற்ற, நாம் Qiskit இயக்க நேர சேவையைத் துவக்க வேண்டும்:

source: Program upload
es_un: Carga del programa
ja_jp: アップロードされたプログラム
ko_kr: 프로그램 업로드
pt_un: Upload do programa
ta_in: நிரல் பதிவேற்றம்

source: The call to ``program_upload`` takes the target Python file as ``data`` and the metadata as inputs.
es_un: La llamada a ``program_upload`` toma el archivo de Python objetivo como ``data`` y los metadatos como entradas.
ja_jp: ``program_upload`` に対する呼び出しは、ターゲットの Python ファイルを ``data`` として、メタデータを入力として使用します。
ko_kr: ``program_upload`` 에 대한 호출은 대상 Python 파일을 ``data`` 로, 메타데이터를 입력으로 사용한다.
pt_un: A chamada para ``program_upload`` recebe o arquivo Python como ``data`` e os metadados como entradas.
ta_in: ``நிரல்_ பதிவேற்றம்`` க்கு அழைப்பு, இலக்கு பைத்தான் கோப்பினை ``டேட்டா`` ஆகவும், மெட்டாடேட்டாவை உள்ளீடுகளாகவும் எடுக்கும்.

source: Here the ``upload_program()`` method returns a ``program_id``, which is how you should reference your program.
es_un: Aquí el método ``upload_program()`` devuelve un ``program_id``, que es como debes hacer referencia a tu programa.
ja_jp: ここで ``upload_program()`` メソッドは ``program_id`` を戻します。これは、ユーザーのプログラムを参照する方法です。
ko_kr: 여기서 ``upload_program()`` 메서드는 프로그램을 참조하는 방법인 ``program_id`` 를 반환한다.
pt_un: Aqui o método ``upload_program()`` retorna um ``program_id``, que é como você deve referenciar seu programa.
ta_in: இங்கே ``பதிவேற்ற_நிரல்()`` முறையானது ``நிரல்_ ஐடி`` ஐ வழங்குகிறது, இதுவே உங்கள் நிரலைக் குறிப்பிட வேண்டும்.

source: Program information
es_un: Información del programa
ja_jp: プログラム情報
ko_kr: 프로그램 정보
pt_un: Informação do programa
ta_in: நிரல் தகவல்

source: We can query the program for information and see that our metadata is correctly being attached:
es_un: Podemos consultar el programa para obtener información y ver que nuestros metadatos se adjuntan correctamente:
ja_jp: プログラムで情報を照会し、メタデータが正しく接続されていることを確認することができます。
ko_kr: 정보를 얻기 위해 프로그램을 조회(query) 하고 메타데이터가 올바르게 첨부되고 있는지 확인할 수 있다.
pt_un: Podemos consultar o programa para obter informações e ver que nossos metadados estão sendo anexados corretamente:
ta_in: தகவலுக்காக நிரலை வினவலாம் மற்றும் எங்கள் மெட்டாடேட்டா சரியாக இணைக்கப்பட்டுள்ளதைக் காணலாம்:

source: Deleting a program
es_un: Eliminar un programa
ja_jp: プログラムの削除
ko_kr: 프로그램 삭제하기
pt_un: Deletando um programa
ta_in: ஒரு நிரலை நீக்குதல்

source: If you make a mistake and need to delete and/or re-upload the program, you can run the following, passing the ``program_id``:
es_un: Si cometes un error y necesitas eliminar y/o volver a cargar el programa, puedes ejecutar lo siguiente, pasando el ``program_id``:
ja_jp: プログラムを誤って削除または再アップロードする必要がある場合は、 ``program_id`` を渡すことにより、以下のことを実行できます。
ko_kr: 실수를 해서 프로그램을 삭제 및/또는 다시 업로드해야 하는 경우 다음을 실행하여 ``program_id`` 를 전달할 수 있다.
pt_un: Se cometermos um erro e precisarmos deletar e/ou reenviar o programa, podemos executar o seguinte, passando o ``program_id``:
ta_in: நீங்கள் தவறு செய்து, நிரலை நீக்கி/அல்லது மீண்டும் பதிவேற்ற வேண்டும் என்றால், ``நிரல்_ஐடி`` ஐக் கடந்து பின்வருவனவற்றை இயக்கலாம்:

source: Running the program
es_un: Ejecutar el programa
ja_jp: プログラムの実行
ko_kr: 프로그램 작동시키기
pt_un: Executando o programa
ta_in: நிரலை இயக்குகிறது

source: Specify parameters
es_un: Especificar parámetros
ja_jp: パラメーターの指定
ko_kr: 매개변수 지정하기
pt_un: Especifique os parâmetros
ta_in: அளவுருக்களைக் குறிப்பிடவும்

source: To run the program we need to specify the ``options`` that are used in the runtime environment (not the program variables). The target backend is defined via the ``backend_name`` field.
es_un: Para ejecutar el programa necesitamos especificar las ``options`` que se utilizan en el entorno de runtime (no las variables del programa). El backend de destino se define a través del campo ``backend_name``.
ja_jp: プログラムを実行するためには、ランタイム環境で使用される ``options`` を指定する必要があります ( プログラム変数ではありません )。 対象となるバックエンドは、 ``backend_name`` フィールドを介して定義されます。
ko_kr: 프로그램을 실행하려면 (프로그램 변수가 아니라) 런타임 환경에서 사용되는 ``options`` 을 지정해야 한다. 표적 백엔드는 ``backend_name`` 필드를 통해 정의된다.
pt_un: Para executar o programa precisamos especificar as ``options`` que são usadas no ambiente de execução (não as variáveis do programa). O backend usado é definido através do campo ``backend_name``.
ta_in: நிரலை இயக்க, இயக்க நேர சூழலில் பயன்படுத்தப்படும் ``விருப்பங்கள்`` (நிரல் மாறிகள் அல்ல) குறிப்பிட வேண்டும். இலக்கு பின்தளமானது ``பின்புறம்_பெயர்`` புலம் வழியாக வரையறுக்கப்படுகிறது.

source: The ``inputs`` dictionary is used to pass arguments to the ``main`` function itself. For example:
es_un: El diccionario ``inputs`` se utiliza para pasar argumentos a la propia función ``main``. Por ejemplo:
ja_jp: ``inputs`` 辞書は、 ``main`` 関数自体に引数を渡すために使用されます。 例えば、
ko_kr: ``inputs`` 딕셔너리는 ``main`` 함수 그 자체에 대해 인자(arguments) 를 전달하기 위해 사용된다. 예를 들어:
pt_un: O dicionário ``inputs`` é usado para passar argumentos para a própria função ``main``. Por exemplo:
ta_in: ``உள்ளீடுகள்`` அகராதியானது ``முதன்மை`` செயல்பாட்டிற்கு வாதங்களை அனுப்ப பயன்படுகிறது. உதாரணத்திற்கு:

source: Execute the program
es_un: Ejecutar el programa
ja_jp: プログラムの実行
ko_kr: 프로그램 실행하기
pt_un: Execute o programa
ta_in: திட்டத்தைச் செயல்படுத்தவும்

source: We now can execute the program and grab the result.
es_un: Ahora podemos ejecutar el programa y tomar el resultado.
ja_jp: プログラムを実行して結果を取得することができます。
ko_kr: 이제 프로그램을 실행하고 결과를 가져올 수 있다.
pt_un: Agora podemos executar o programa e obter o resultado.
ta_in: நாம் இப்போது நிரலை இயக்கலாம் மற்றும் முடிவைப் பெறலாம்.

source: A few things need to be pointed out. First, we did not get back any interim results, and second, the return object is a plain dictionary. This is because we did not listen for the return results, and we did not tell the job how to format the return result.
es_un: Es necesario señalar algunas cosas. En primer lugar, no obtuvimos ningún resultado provisional y, en segundo lugar, el objeto de retorno es un diccionario simple. Esto se debe a que no escuchamos los resultados devueltos y no le dijimos al trabajo cómo formatear el resultado devuelto.
ja_jp: いくつかの点を指摘する必要があります。 まず、中間結果が返されませんでした。次に、返されるオブジェクトは単純な辞書です。 これは、返される結果をリスニングせず、返される結果をフォーマットする方法をジョブに指示しなかったためです。
ko_kr: 몇 가지를 강조하고 싶다. 첫 번째로, 어떠한 중간 결과도 얻지 못했고, 두 번째로, 반환 객체는 일반적인(plain) 딕셔너리이다. 이는 리턴 결과를 수신하지 않았기 때문이며 리턴 결과를 형식화 하는 방법을 작업에 지시하지 않았기 때문이다.
pt_un: Algumas coisas precisam ser apontadas. Primeiro, não recebemos nenhum resultado provisório e, segundo, o objeto de retorno é um dicionário simples. Isso ocorre porque não escutamos os resultados de retorno e não informamos ao trabalho como formatar o resultado de retorno.
ta_in: சில விஷயங்களைச் சுட்டிக்காட்ட வேண்டும். முதலில், நாங்கள் எந்த இடைக்கால முடிவுகளையும் பெறவில்லை, இரண்டாவதாக, திரும்பப் பெறும் பொருள் ஒரு எளிய அகராதி. முடிவுகளின் ரிசல்ட்களை நாங்கள் கேட்காமல், முடிவுகளின் ரிசல்ட்களை எப்படி பார்மட் செய்வது என்று வேலையைச் சொல்லாமல் இருந்ததே இதற்குக் காரணம்.

source: Listening for interim results and final result
es_un: Escuchar los resultados intermedios y el resultado final
ja_jp: 中間結果と最終結果のリスニング
ko_kr: 임시 결과 및 최종 결과를 수신하기
pt_un: Escutando os resultados provisórios e o resultado final
ta_in: இடைக்கால முடிவுகளையும் இறுதி முடிவுகளையும் கேட்பது

source: To listen for interim results and final result we need to pass a callback function to ``service.run`` that stores the results. The callback takes two arguments ``job_id`` and the returned data:
es_un: Para escuchar los resultados provisionales y el resultado final, necesitamos pasar una función de devolución de llamada a ``service.run`` que almacena los resultados. La devolución de llamada toma dos argumentos ``job_id`` y los datos devueltos:
ja_jp: 中間結果と最終結果をリスニングするには、結果を格納する ``service.run`` にコールバック関数を渡す必要があります。 コールバックは、2つの引数 ``job_id`` と返されたデータを受け取ります。
ko_kr: 중간 결과와 최종 결과를 수신하기 위해 결과를 저장하는 ``service.run`` 에 콜백 함수를 전달해야 한다. 콜백은 두 개의 인자 ``job_id`` 와 반환된 데이터를 사용한다:
pt_un: Para escutar os resultados provisórios e o resultado final, precisamos passar uma função de callback para ``service.run`` que armazena os resultados. O callback recebe dois argumentos ``job_id`` e os dados retornados:
ta_in: இடைக்கால முடிவுகள் மற்றும் இறுதி முடிவுகளுக்காகக் கேட்க நாம் முடிவுகளைச் சேமிக்கும் ``service.run`` க்கு ஒரு அழைப்புப் பின்னூட்டத்தை அனுப்ப வேண்டும். அழைப்பிதழ் ``வேலை_ஐடி`` என்ற இரு வகைகளையும், தரவையும் எடுக்கும்:

source: Executing again we get:
es_un: Ejecutando de nuevo obtenemos:
ja_jp: もう一度実行します :
ko_kr: 다시 실행하면 다음과 같다:
pt_un: Executando novamente temos:
ta_in: மீண்டும் செயல்படுத்தினால் நாம் பெறுவோம்:

source: Formatting the returned results
es_un: Formatear los resultados devueltos
ja_jp: 返された結果のフォーマット
ko_kr: 반환된 결과 형식화하기
pt_un: Formatando os resultados retornados
ta_in: திரும்பிய முடிவுகளை வடிவமைத்தல்

source: In order to format the return results into the desired format, we need to specify a decoder. This decoder must have a ``decode`` method that gets called to do the actual conversion. In our case ``OptimizeResult`` is a simple sub-class of ``dict`` so the formatting is simple.
es_un: Para formatear los resultados devueltos en el formato deseado, necesitamos especificar un decodificador. Este decodificador debe tener un método ``decode`` que sea llamado para realizar la conversión real. En nuestro caso, ``OptimizeResult`` es una subclase simple de ``dict``, por lo que el formato es sencillo.
ja_jp: 戻り結果を目的の形式にフォーマットするには、デコーダーを指定する必要があります。 このデコーダーには、実際の変換を行うために呼び出される ``decode`` メソッドが必要です。 この場合、 ``OptimizeResult`` は ``dict`` の単純なサブクラスであるため、フォーマットは単純です。
ko_kr: 반환된 결과를 원하는 형식으로 형식화하기 위해, 디코더를 지정해야 한다. 이 디코더는 실제 변환을 수행하기 위해 호출되는 ``decode`` 메서드를 가지고 있어야 한다. 지금의 경우에는 ``OptimizeResult`` 는 ``dict`` 의 간단한 하위 클래스이므로 형식화는 간단하다.
pt_un: Para formatar os resultados de retorno no formato desejado, precisamos especificar um decodificador. Este decodificador deve ter um método ``decode`` que seja chamado para fazer a conversão. No nosso caso ``OptimizeResult`` é uma subclasse simples de ``dict`` então a formatação é simples.
ta_in: திரும்பும் முடிவுகளை விரும்பிய வடிவத்தில் வடிவமைக்க, ஒரு குறிவிலக்கியைக் குறிப்பிட வேண்டும். இந்த டிகோடரில் ``டிகோட்`` முறை இருக்க வேண்டும், அது உண்மையான மாற்றத்தைச் செய்ய அழைக்கப்படும். எங்கள் விஷயத்தில் ``OptimizeResult`` என்பது ``டிக்ட்`` ன் ஒரு எளிய துணை வகுப்பாகும், எனவே வடிவமைத்தல் எளிது.

source: We can then use this when returning the job result:
es_un: Luego podemos usar esto al devolver el resultado del trabajo:
ja_jp: 次に、ジョブの結果を戻すときに、これを使用できます。
ko_kr: 그런 다음 작업 결과를 반환할 때 이를 사용할 수 있다:
pt_un: Podemos usar isso ao retornar o resultado do job:
ta_in: வேலை முடிவைத் திரும்பப் பெறும்போது இதைப் பயன்படுத்தலாம்:

source: Simplifying program execution with wrapping functions
es_un: Simplificación de la ejecución del programa con funciones contenedoras
ja_jp: ラッピング関数によるプログラム実行の簡素化
ko_kr: 랩핑 (wrapping) 함수를 이용하여 프로그램 실행을 단순하게 만들기
pt_un: Simplificando a execução do programa com funções de encapsulamento
ta_in: நிரல் செயலாக்கத்தை மடிப்பு செயல்பாடுகளுடன் எளிதாக்குகிறது

source: While runtime programs are powerful and flexible, they are not the most friendly things to interact with. Therefore, if your program is intended to be used by others, it is best to make wrapper functions and/or classes that simplify the user experience. Moreover, such wrappers allow for validation of user inputs on the client side, which can quickly find errors that would otherwise be raised later during the execution process - something that might have taken hours waiting in queue to get to.
es_un: Mientras que los programas runtime son poderosos y flexibles, no son las cosas más amigables para interactuar. Por lo tanto, si tu programa está destinado a ser utilizado por otros, es mejor crear funciones y/o clases contenedoras que simplifiquen la experiencia del usuario. Además, estos contenedores permiten la validación de las entradas del usuario en el lado del cliente, lo que puede encontrar rápidamente errores que, de otro modo, se generarían más tarde durante el proceso de ejecución, algo que podría haber llevado horas esperando en la cola para llegar.
ja_jp: Runtime プログラムは強力で柔軟性がありますが、使い勝手が良いとは言えません。したがって、プログラムが他のユーザーによって使用されるように意図されている場合は、ユーザー・エクスペリエンスを単純化するラッパー関数またはクラス ( あるいはその両方 ) を作成するのが最適です。 さらに、そのようなラッパーを使用すると、クライアント側でのユーザー入力の検証が可能になります。これにより、実行プロセス中に後で発生する可能性のあるエラーを素早く検出できます。これは、キュー内で待機する時間を待機していた可能性があるものです。
ko_kr: 런타임 프로그램은 강력하고 유연성 있지만, 상호작용 하기 가장 친숙한 것은 아니다. 따라서 당신의 프로그램을 다른 사람이 사용하도록 할 경우, 그것은 사용자 경험을 단순화하는 래퍼 함수 및/또는 클래스를 만드는 것이 좋다. 또한 이러한 래퍼는 클라이언트 측에서의 사용자 입력의 유효성 검증을 허용하며, 이로서 그러지 않으면 실행 프로세스 도중 나중에 발견했을, 대기열에서 기다리는 데 몇 시간이 소요되었을 수 있는 오류를 빠르게 발견할 수 있다.
pt_un: Embora os programas de runtime sejam poderosos e flexíveis, eles não são muito amigáveis de interagir. Portanto, se seu programa se destina a ser usado por outras pessoas, é melhor criar funções de encapsulamento e/ou classes que simplifiquem a experiência do usuário. Além disso, esses encapsuladores permitem a validação das entradas do usuário no lado do cliente, que podem encontrar rapidamente erros que, de outra forma, seriam gerados posteriormente durante o processo de execução - algo que poderia gastar horas esperando na fila.
ta_in: இயக்க நேர நிரல்கள் சக்திவாய்ந்தவை மற்றும் நெகிழ்வானவை என்றாலும், அவை தொடர்புகொள்வதற்கு மிகவும் நட்பான விஷயங்கள் அல்ல. எனவே, உங்கள் நிரல் பிறரால் பயன்படுத்தப்பட வேண்டும் எனில், பயனர் அனுபவத்தை எளிதாக்கும் ரேப்பர் செயல்பாடுகள் மற்றும்/அல்லது வகுப்புகளை உருவாக்குவது சிறந்தது. மேலும், இது போன்ற ரேப்பர்கள் கிளையன்ட் பக்கத்தில் உள்ள பயனர் உள்ளீடுகளை சரிபார்ப்பதற்கு அனுமதிக்கின்றன, இது செயல்பாட்டின் போது பின்னர் எழுப்பப்படும் பிழைகளை விரைவாகக் கண்டறியலாம் - இது பெறுவதற்கு வரிசையில் பல மணிநேரம் காத்திருந்திருக்கலாம்.

source: Here we will make two helper routines. First, a job wrapper that allows us to attach and retrieve the interim results directly from the job object itself, as well as decodes for us so that the end user need not worry about formatting the results themselves.
es_un: Aquí haremos dos rutinas auxiliares. En primer lugar, un contenedor de trabajo que nos permite adjuntar y recuperar los resultados provisionales directamente desde el objeto de trabajo en sí, así como decodificar para nosotros, de modo que el usuario final no tenga que preocuparse por formatear los resultados.
ja_jp: ここで、ヘルパー・ルーチンを 2 つ作成します。 まず、ジョブ・ラッパーを使用することにより、ジョブ・オブジェクト自体から直接中間結果を直接添付および取得することができます。また、エンド・ユーザーが結果自体をフォーマット設定することについて心配する必要がないようにするために、デコードも行います。
ko_kr: 여기에서는 두 개의 헬퍼 루틴을 작성한다. 먼저, 작업 오브젝트 자체에서 직접 임시 결과를 첨부하고 검색할 수 있는 작업 랩퍼(wrapper)이며 일반 사용자(end user)가 스스로 결과를 형식화하는 것에 대해 걱정하지 않도록 우리를 위해 복호화를 해주는 작업 랩퍼이다.
pt_un: Aqui faremos duas rotinas auxiliares. Primeiro, um encapsulador de jobs que nos permite anexar e recuperar os resultados provisórios diretamente do próprio objeto de job, bem como decodificar para nós para que o usuário final não precise se preocupar com a formatação dos próprios resultados.
ta_in: இங்கே நாம் இரண்டு உதவி நடைமுறைகளைச் செய்வோம். முதலாவதாக, வேலைப் பொருளில் இருந்தே இடைக்கால முடிவுகளை நேரடியாக இணைக்கவும் மீட்டெடுக்கவும் அனுமதிக்கும் ஒரு வேலை ரேப்பர், அதே போல் எங்களுக்காக டிகோட் செய்கிறது, இதனால் இறுதிப் பயனர் முடிவுகளைத் தாங்களே வடிவமைப்பது பற்றிக் கவலைப்படத் தேவையில்லை.

source: Next, we create the actual function we want users to call to execute our program. To this function we will add a series of simple validation checks (not all checks will be done for simplicity), as well as use the job wrapper defined above to simplify the output.
es_un: A continuación, creamos la función en sí que queremos que los usuarios llamen para ejecutar nuestro programa. A esta función, le agregaremos una serie de comprobaciones de validación sencillas (no todas las comprobaciones se realizarán por simplicidad), así como también usaremos el contenedor de trabajo definido anteriormente para simplificar la salida.
ja_jp: 次に、ユーザーがプログラムを実行するために呼び出す実際の関数を作成します。 この関数には、一連の簡単な検証チェック ( 簡単のためすべてのチェックが行われるわけではない ) を追加し、同様に出力を単純化するために上記で定義されたジョブ・ラッパーを使用します。
ko_kr: 다음으로, 사용자가 프로그램을 실행하기 위해 호출할 실제 함수를 작성한다. 이 함수에 일련의 단순한 검증 확인을 추가할 것이며 (단순함을 위해 모든 확인을 하지 않는다) 출력을 단순화하기 위해 위에 정의된 작업 래퍼 (wrapper)를 이용할 것이다.
ta_in: அடுத்து, எங்கள் நிரலை இயக்க பயனர்கள் அழைக்க விரும்பும் உண்மையான செயல்பாட்டை நாங்கள் உருவாக்குகிறோம். இந்தச் செயல்பாட்டிற்கு, எளிமையான சரிபார்ப்புச் சரிபார்ப்புகளின் வரிசையைச் சேர்ப்போம் (எல்லாச் சரிபார்ப்புகளும் எளிமைக்காகச் செய்யப்படாது), அத்துடன் வெளியீட்டை எளிதாக்க மேலே வரையறுக்கப்பட்ட வேலை ரேப்பரைப் பயன்படுத்துவோம்.

source: We can now execute our runtime program via this runner function:
es_un: Ahora podemos ejecutar nuestro programa runtime a través de esta función ejecutora:
ja_jp: 以下の runner 関数を介して、runtime プログラムを実行できるようになりました。
ko_kr: 이제 이 러너 (runner) 함수를 통해 런타임 프로그램을 실행할 수 있다.
pt_un: Agora podemos executar nosso programa de runtime por meio desta função runner:
ta_in: இந்த ரன்னர் செயல்பாட்டின் மூலம் நமது இயக்க நேர நிரலை இப்போது இயக்கலாம்:

source: The interim results are now attached to the job ``interim_results`` attribute and, as expected, we see that the length matches the number of iterations performed.
es_un: Los resultados provisionales ahora se adjuntan al atributo ``interim_results`` del trabajo y, como era de esperar, vemos que la longitud coincide con el número de iteraciones realizadas.
ja_jp: 中間結果は ``interim_results`` 属性に追加され、予想通り、長さが実行される反復の数と一致することがわかります。
ko_kr: 이제 중간 결과가 ``interim_results`` 작업(job) 의 속성에 첨부되고 예상대로 길이가 수행된 반복 수와 일치함을 알 수 있다.
pt_un: Os resultados provisórios agora estão anexados ao atributo ``interim_results`` do job e, como esperado, vemos que o comprimento corresponde ao número de iterações realizadas.
ta_in: இடைக்கால முடிவுகள் இப்போது வேலை ``இடைநிலை_முடிவுகள்`` பண்புடன் இணைக்கப்பட்டுள்ளன, எதிர்பார்த்தபடி, நிகழ்த்தப்பட்ட மறு செய்கைகளின் எண்ணிக்கையுடன் நீளம் பொருந்துவதைக் காண்கிறோம்.

source: Conclusion
es_un: Conclusión
ja_jp: 結論
ko_kr: 결론
pt_un: Conclusão
ta_in: முடிவுரை

source: We have demonstrated how to create, upload, and use a custom Qiskit Runtime by creating our own VQE solver from scratch. This tutorial was meant to touch upon every aspect of the process for a real-world example. Within the current limitations of the runtime environment, this example should enable readers to develop their own single-file runtime program. This program is also a good starting point for exploring additional flavors of VQE runtime. For example, it is straightforward to vary the number of shots per iteration, increasing shots as the number of iterations increases. Those looking to go deeper can consider implementing an `adaptive VQE <https://doi.org/10.1038/s41467-019-10988-2>`__, where the ansatz is not fixed at initialization.
es_un: Hemos demostrado cómo crear, cargar y usar un Qiskit Runtime personalizado al crear nuestro propio solucionador VQE desde cero. Este tutorial estaba destinado a tocar todos los aspectos del proceso para un ejemplo del mundo real. Dentro de las limitaciones actuales del entorno de runtime, este ejemplo debería permitir a los lectores desarrollar su propio programa runtime de un solo archivo. Este programa también es un buen punto de partida para explorar versiones adicionales del runtime de VQE. Por ejemplo, es sencillo variar el número de iteraciones por repetición, aumentando las iteraciones a medida que aumenta el número de repeticiones. Aquellos que buscan profundizar pueden considerar implementar un `VQE adaptativo <https://doi.org/10.1038/s41467-019-10988-2>`__, donde el ansatz no se fija en la inicialización.

source: Appendix A
es_un: Apéndice A
ja_jp: 付録 A
pt_un: Apêndice A
ta_in: பின் இணைப்பு A
