Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/simulators/1_aer_provider.po
Languages: bn_bn, es_mx, es_un, fr_fr, id_id, it_it, ja_jp, ko, pt_br, ta, tr, zh_tw

source: We may also set an initial state for the ``UnitarySimulator``, however this state is an initial *unitary matrix* :math:`U_i`, not a statevector. In this case the returned unitary will be :math:`U \cdot U_i` given by applying the circuit unitary to the initial unitary matrix.
es_mx: También podemos establecer un estado inicial para el ``UnitarySimulator``, sin embargo, este estado es una *matriz unitaria* :math:`U_i`, no un vector de estado. En este caso, el unitario devuelto será :math:`U \cdot U_i` dado aplicando el circuito unitario a la matriz unitaria inicial.
id_id: Kita juga dapat mengatur sebuah state awal untuk ` ` ` UnitarySimulator ` `, namun keadaan ini adalah matrik awal * :math:` U_i `, bukan suatu statevector. Dalam kasus ini, unitary yang dikembalikan akan menjadi :math:` U \cdot U_i ` yang dihasilkan dari penerapan sirkuit unitary ke matrik unitary awal.
it_it: È possibile impostare uno stato iniziale anche nel caso di ``UnitarySimulator``, con la differenza che adesso è una *matrice unitaria* :math:`U_i`, non un vettore di stato. In questo caso l'unitaria risultante sarà :math:`U \cdot U_i` ottenuta applicando l'unitaria del circuito alla matrice unitaria iniziale.

source: **Note:** \* The initial unitary must be a valid unitary matrix :math:`U^\dagger \cdot U =\mathbb{1}`. If not, an exception will be raised. \* If a ``Qobj`` contains multiple experiments, the initial unitary must be the correct size for *all* experiments in the ``Qobj``, otherwise an exception will be raised.
es_mx: **Nota:** \* La unidad inicial debe ser una matriz unitaria válida :math:`U^\dagger \cdot U =\mathbb{1}`. De lo contrario, se arrojará una excepción. \* Si un ``Qobj`` contiene múltiples experimentos, el unitario inicial debe ser del tamaño correcto para *todos* los experimentos en el ``Qobj``, de lo contrario se arrojará una excepción.
id_id: ** Catatan:** \ * Unitary awal harus berupa sebuah matrik unitary yang valid :math:` U ^ \dagger \cdot U = \mathbb{1}`. Jika tidak, suatu pengecualian akan dinaikkan. \ * Jika sebuah ` ` ` Qobj ` ` berisi beberapa percobaan, unitary awal harus memiliki ukuran yang benar untuk * semua * percobaan dalam ` ` Qobj ` `, jika tidak, suatu pengecualian akan dinaikkan.
it_it: **Nota:** \* L'unitaria iniziale deve essere una matrice unitaria valida :math:`U^\dagger \cdot U =\mathbb{1}`. Se così non fosse, verrà lanciata un'eccezione. Se un ``Qobj`` contiene molteplici esperimenti, la matrice unitaria iniziale deve avere dimensioni corrette rispetto a *tutti* gli esperimenti nel ``Qobj``, altrimenti verrà lanciata un'eccezione.

source: Let us consider preparing the output unitary of the previous circuit as the initial state for the simulator:
es_mx: Consideremos la preparación de la salida unitaria del circuito anterior como estado inicial para el simulador:
id_id: Mari kita lihat contoh mempersiapkan output unitary dari sirkuit sebelumnya sebagai state awal untuk simulator:
it_it: Utilizziamo l'unitaria risultante dal circuito precedente come stato iniziale del simulatore:
