Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/simulators/1_aer_provider.po
Languages: bn_bn, es_mx, es_un, fr_fr, id_id, it_it, ja_jp, ko, pt_br, ta, tr, zh_tw

source: This page was generated from `tutorials/simulators/1_aer_provider.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/simulators/1_aer_provider.ipynb`__ -থেকে বানানো হয়েছে।
es_mx: Esta página ha sido generada a partir de `tutorials/simulators/1_aer_provider.ipynb`__.
es_un: Esta página fue generada a partir de `tutorials/simulators/1_aer_provider.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/simulators/1_aer_provider.ipynb`__.
id_id: Halaman ini dibuat dari ` tutorials/algoritms/01_grover.ipynb ` __.
it_it: Questa pagina è stata generata da `tutorials/simulators/1_aer_provider.ipynb`__.
ja_jp: このページは `tutorials/simulators/1_aer_provider.ipynb`__ から生成されました。
ko: 이 페이지는 `tutorials/simulators/1_aer_provider.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada, a partir do `tutorials/simulators/1_aer_provider.ipynb`__.
ta: இந்த பக்கம் `tutorials/simulators/1_aer_provider.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
tr: Bu sayfa `tutorials/simulators/1_aer_provider.ipynb`__ adresinden oluşturulmuştur.
zh_tw: 此頁面是從 `tutorials/simulators/1_aer_provider.ipynb`__ 產生的。

source: Simulators
bn_bn: সিমুলেটর (মহড়াকারি)
es_mx: Simuladores
es_un: Simuladores
fr_fr: Simulateurs
id_id: Simulator
it_it: Simulatori
ja_jp: シミュレーター
ko: 시뮬레이터
pt_br: Simuladores
ta: சிமுலேட்டர்கள்
tr: Simülatörler
zh_tw: 模擬器

source: Introduction
bn_bn: ভূমিকা
es_mx: Introducción
es_un: Introducción
id_id: Pengantar
it_it: Introduzione
ja_jp: はじめに
ko: 소개
pt_br: Introdução
ta: முன்னுரை
tr: Giriş
zh_tw: 簡介

source: This notebook shows how to import the *Qiskit Aer* simulator backend and use it to run ideal (noise free) Qiskit Terra circuits.
bn_bn: এই নোটবুকে দেখানো হয়েছে কিভাবে *Qiskit Aer* সিমুলেটর ব্যাকএন্ড ইম্পোর্ট করে সেগুলোতে আদর্শ (ত্রুটিহীন) Qiskit টেরা বর্তনী (সার্কিট) চালাতে হয়।
es_un: Este cuaderno muestra cómo importar el simulador de backend de *Qiskit Aer* y usarlo para ejecutar circuitos Qiskit Terra ideales (sin ruido).
fr_fr: Ce bloc-notes montre comment importer le simulateur *Qiskit Aer* et l'utiliser pour exécuter les circuits Terra idéaux (sans bruit) Qiskit.
ja_jp: このノートブックでは、*Qiskit Aer* シミュレーターのバックエンドをインポートし、理想的な(ノイズフリーの) Qiskit Terra回路を実行する方法を説明します。
ko: 이 노트북은 *Qiskit Aer* 시뮬레이터 백엔드를 어떻게 가져오고, 이상적인 (잡음이 없는) Qiskit Terra 회로를 실행하는 데 사용할 수 있는지 보여준다.
pt_br: Este notebook mostra como importar o serviço do simulador *Qiskit Aer* e usá-lo para executar circuitos Qiskit Terra ideais (livre de ruído).
ta: இந்த குறிப்பேடு *Qiskit Aer* simulator பின்புலத்தை எப்படி இறக்குமதி செய்கிறது என்பதை காட்டுகிறது மற்றும் அதை இயக்க (சத்தம் இல்லாத) Qiskit Terra சுற்றுகளைப் பயன்படுத்துவது எப்படி என்பதைக் காட்டுகிறது.
tr: Bu not defteri *Qiskit Aer* simülasyon arkayüzünün nasıl içe aktarılacağını ve ideal (gürültüsüz) Qiskit Terra devrelerini çalıştırmak için nasıl kullanılacağını gösterir.
zh_tw: 此筆記本會演示如何匯入 *Qiskit Aer* 模擬器後台，並使用它來執行理想的(無雜訊) Qiskit Terra 電路。

source: The Aer Provider
bn_bn: এয়ার প্রোভাইডার
es_un: El Proveedor Aer
fr_fr: Fournisseur Aer
ja_jp: Aerプロバイダー
ko: Aer 공급자
pt_br: O Provedor Aer
ta: ஏர் வழங்குநர்
tr: Aer Sağlayıcısı
zh_tw: Aer Provider

source: The ``Aer`` provider contains a variety of high performance simulator backends for a variety of simulation methods. The available backends on the current system can be viewed using ``Aer.backends``
bn_bn: ``Aer`` প্রদানকারীর বিভিন্ন ধরণের সিমুলেশন পদ্ধতির জন্য বিভিন্ন ধরণের উচ্চ পারফরম্যান্স সিমুলেটর ব্যাকএন্ড রয়েছে। বর্তমান সিস্টেমে উপলব্ধ ব্যাকএন্ডগুলি ``Aer.backends`` ব্যবহার করে দেখা যেতে পারে
es_un: El proveedor ``Aer`` contiene una variedad de simuladores de backend de alto rendimiento para una variedad de métodos de simulación. Los backends disponibles en el sistema actual se pueden ver usando ``Aer.backends``
fr_fr: Le fournisseur ``Aer`` contient une variété de plateformes de simulation à hautes performances fournissant différentes méthodes de simulation. Les plateformes disponibles sur le système utilisé peuvent être visualisées en utilisant ``Aer.backends``
ja_jp: ``Aer`` プロバイダには、さまざまなシミュレーション方法に対応するさまざまな高性能シミュレーターバックエンドが含まれています。 現在のシステムで利用可能なバックエンドは ``Aer.backends`` を使用して表示できます。
ko: ``Aer`` 공급자는 각종 시뮬레이터 방법들을 위한 다양한 고성능 시뮬레이터 백엔드들을 포함한다. 현재 시스템에 사용 가능한 백엔드들은 ``Aer.backends`` 를 사용하여 볼 수 있다.
pt_br: O provedor ``Aer`` contém uma variedade de backends de simuladores de alta performance para vários métodos de simulação. Os serviços disponíveis no sistema atual podem ser visualizados usando ``Aer.backends``
ta: ``Aer`` வழங்குநர் பலவிதமான உருவகப்படுத்துதல் முறைகளுக்கான உயர் செயல்திறன் சிமுலேட்டர் பின்தளத்தில் உள்ளது. தற்போதைய கணினியில் கிடைக்கக்கூடிய பின்தளத்தில் ``Aer.backends`` ஐப் பயன்படுத்தி பார்க்க முடியும்
tr: ``Aer`` sağlayıcısı, çeşitli benzetim yöntemleri için çeşitli yüksek performanslı simülatör arka uçlar içerir. Mevcut sistemde varolan arka uçlar, ``Aer.backends`` kullanılarak görüntülenebilir
zh_tw: ``Aer` ` provider包含各種高效能模擬器後台，用於各種模擬方法。 您可以使用 ``Aer.backends`` 來檢視現行系統上的可用後台

source: The Aer Simulator
bn_bn: এয়ার সিমুলেটর
es_un: El Simulador Aer
fr_fr: Le simulateur Aer
ja_jp: Aer シミュレーター
ko: Aer 시뮬레이터
pt_br: O Simulador Aer
ta: ஏர் சிமுலேட்டர்
tr: Aer Simülatörü
zh_tw: Aer 模擬器

source: The main simulator backend of the Aer provider is the ``AerSimulator`` backend. A new simulator backend can be created using ``Aer.get_backend('aer_simulator')``.
bn_bn: Aer প্রদানকারীর প্রধান সিমুলেটর ব্যাকএন্ড হল ``AerSimulator`` ব্যাকএন্ড। একটি নতুন সিমুলেটর ব্যাকএন্ড ``Aer.get_backend ('aer_simulator')`` ব্যবহার করে তৈরি করা যেতে পারে।
es_un: El simulador de backend principal del proveedor Aer es el backend ``AerSimulator``. Se puede crear un nuevo simulador de backend usando ``Aer.get_backend('aer_simulator')``.
fr_fr: L'environnement principal du simulateur Aer est le ``AerSimulator``. Un nouvel environnement de simulateur peut être créé en utilisant ``Aer.get_backend('aer_simulator')``.
ja_jp: Aer プロバイダのメインシミュレーターバックエンドは ``AerSimulator`` バックエンドです。新しいシミュレータバックエンドは ``Aer.get_backend('aer_simulator')`` を使用して作成できます。
ko: Aer 공급자의 주 시뮬레이터 백엔드는 ``AerSimulator`` 백엔드이다. 새로운 시뮬레이터 백엔드는 ``Aer.get_backend('aer_simulator')`` 를 사용하여 만들 수 있다.
pt_br: O principal simulador de serviço do provedor Aer é o backend ``AerSimulator``. Um backend de simulador novo pode ser criado usando ``Aer.get_backend('aer_simulator')``.
ta: ஏர் வழங்குநரின் முக்கிய சிமுலேட்டர் ``AerSimulator`` பின்தளத்தில் உள்ளது. ``Aer.get_backend ('aer_simulator')`` ஐப் பயன்படுத்தி புதிய சிமுலேட்டர் பின்தளத்தில் உருவாக்க முடியும்.
tr: Aer sağlayıcısının ana simülatör arkayüzünü ``AerSimulator`` arkayüzüdür. Yeni bir simülatör arkayüzünü ``Aer.get_backend('aer_simulator')`` kullanılarak oluşturulabilir.
zh_tw: Aer provider 的主要模擬器後台是 ``AerSimulator`` 後台。 我們可以使用 ` ```Aer.get_backend('aer_simulator')`` 建立一個新的模擬器後台。

source: The default behavior of the ``AerSimulator`` backend is to mimic the execution of an actual device. If a ``QuantumCircuit`` containing measurements is run it will return a count dictionary containing the final values of any classical registers in the circuit. The circuit may contain gates, measurements, resets, conditionals, and other custom simulator instructions that will be discussed in another notebook.
bn_bn: স্বতঃসিদ্ধ নিয়মানুসারে ``AerSimulator`` ব্যাকএন্ডের কাজ একটা বাস্তব যন্ত্রের অনুকরণ করা। যদি একটি ``QuantumCircuit`` পরিমাপ চালানো হয় তবে এটি সার্কিটের যে কোনও ধ্রুপদী (ক্লাসিক্যাল) নিবন্ধকের চূড়ান্ত মান সম্বলিত একটি গণনা অভিধান ফিরিয়ে দেবে। সার্কিটে গেট, পরিমাপ, রিসেট, কন্ডিশনাল এবং অন্যান্য কাস্টম সিমুলেটর নির্দেশনা থাকতে পারে যা অন্য নোটবুকে আলোচনা করা হবে।
es_un: El comportamiento predeterminado del backend ``AerSimulator`` es imitar la ejecución de un dispositivo real. Si se ejecuta un ``QuantumCircuit`` que contiene mediciones, devolverá un diccionario de conteos que contiene los valores finales de cualquier registro clásico del circuito. El circuito puede contener compuertas, mediciones, restablecimientos, condicionales y otras instrucciones personalizadas del simulador que se discutirán en otro cuaderno.
fr_fr: Le comportement par défaut de l'environnement ``AerSimulator`` est d'imiter l'exécution d'un périphérique réel. Si un ``QuantumCircuit`` contenant des mesures est exécuté, il retournera un dictionnaire associant les valeurs finales des registres classiques dans le circuit au nombre de fois qu'elles ont été mesurées. Le circuit peut contenir des portes, des mesures, des réinitialisations, des conditions et d'autres instructions de simulateur personnalisées qui seront discutées dans un autre notebook.
ja_jp: ``AerSimulator`` バックエンドのデフォルトの動作は実際のデバイスを模倣することです。もし 測定を含む ``QuantumCircuit`` が実行されたら、回路内のすべての古典レジスタの最終値を含むカウント辞書を返します。回路にはゲート、測定、リセット、条件、および別のノートブックで説明される、その他の高度なシミュレーター命令を含むことができます。
ko: ``AerSimulator`` 백엔드의 기본 행동 방식은 실제 장치의 실행 과정을 모방하는 것이다. 만약 측정이 포함된 ``QuantumCircuit`` 이 실행된다면 회로의 고전 레지스터들의 최종값들을 포함한 카운트 딕셔너리가 출력될 것이다. 회로는 게이트, 측정, 초기화, 조건, 그리고 다른 맞춤형 시뮬레이터 명령들을 포함할 수 있는데, 이에 관한 더 자세한 내용은 다른 노트북에서 설명될 것이다.
pt_br: O comportamento padrão do serviço ``AerSimulator`` é simular a execução de um dispositivo real. Se um ``QuantumCircuit`` contendo medições for executado ele retornará um dicionário de contagem contendo os valores finais de quaisquer registradores clássicos no circuito. O circuito pode conter portas, medições, resets, condicionais e outras instruções personalizadas do simulador que serão discutidas em outro notebook.
ta: உண்மையான சாதனத்தின் செயல்பாட்டைப் பிரதிபலிப்பதே ``AerSimulator`` பின்தளத்தில் இயல்புநிலை நடத்தை. அளவீடுகளைக் கொண்ட ``QuantumCircuit`` இயங்கினால், அது சுற்றுவட்டத்தில் உள்ள எந்தவொரு கிளாசிக்கல் பதிவுகளின் இறுதி மதிப்புகளைக் கொண்ட ஒரு எண்ணிக்கை அகராதியைத் தரும். சுற்றுக்கு வாயில்கள், அளவீடுகள், மீட்டமைப்புகள், நிபந்தனைகள் மற்றும் பிற விருப்ப சிமுலேட்டர் வழிமுறைகள் இருக்கலாம், அவை மற்றொரு நோட்புக்கில் விவாதிக்கப்படும்.
tr: ``AerSimulator`` arkayüzünün varsayılan davranışı, gerçek bir cihazın çalışmasını taklit etmektir. Ölçümleri içeren bir ``QuantumCircuit`` çalıştırılırsa, devredeki her bir klasik yazmacın son değerlerini içeren bir sayım sözlüğü döndürür. Devre; kapılar, ölçümler, koşullar ve başka bir not defterinde ele alınacak diğer özel simülasyon komutları içerebilir.
zh_tw: ``AerSimulator`` 後台的預設行為是用來模擬實際器件的執行情況。 如果一個包含測量的``QuantumCircuit `` 被執行，它將會傳回一個包含在其電路中所有經典暫存器最終數值的計數字典。而該電路可以包括閘、測量、重設、條件和其它自訂的模擬器指令，這些指令我們將在另一個筆記本中討論。

source: Simulating a quantum circuit
bn_bn: কোয়ান্টাম বর্তনী (সার্কিট) সিমুলেট করা
es_mx: Simulando un circuito cuántico
es_un: Simular un circuito cuántico
fr_fr: Simulation d'un circuit quantique
id_id: Simulasikan sirkuit kuantum
it_it: Simulare un circuito quantistico
ja_jp: 量子回路のシミュレーション
ko: 양자 회로 시뮬레이션하기
pt_br: Simulando um circuito quântico
ta: ஒரு குவாண்டம் சுற்று உருவகப்படுத்துதல்
tr: Bir kuantum devresini simüle etme
zh_tw: 模擬量子電路

source: The basic operation runs a quantum circuit and returns a counts dictionary of measurement outcomes. Here we run a simple circuit that prepares a 2-qubit Bell-state :math:`\left|\psi\right\rangle = \frac{1}{\sqrt{2}}\left(\left|0,0\right\rangle + \left|1,1 \right\rangle\right)` and measures both qubits.
es_un: La operación básica ejecuta un circuito cuántico y devuelve un diccionario de conteos de resultados de medición. Aquí ejecutamos un circuito simple que prepara un estado de Bell de 2 qubits :math:`\left|\psi\right\rangle = \frac{1}{\sqrt{2}}\left(\left|0,0\right\rangle + \left|1,1 \right\rangle\right)` y mide ambos qubits.
ja_jp: 基本操作は、量子回路を実行し測定結果のカウント・ディクショナリを返却することです。ここでは、2量子ビットのベル状態 :math:`\left|\psi\right\rangle = \frac{1}{\sqrt{2}}\left(\left|0,0\right\rangle + \left|1,1 \right\rangle\right)` を作成する簡単な回路を実行し、両方の量子ビットを測定します。
ko: 기본 연산은 양자 회로를 실행하고 측정 결과의 카운트를 딕셔너리 형식으로 출력한다. 여기서는 2-큐비트 벨 상태 :math:`\left|\psi\right\rangle = \frac{1}{\sqrt{2}}\left(\left|0,0\right\rangle + \left|1,1 \right\rangle\right)` 를 준비하고 두 큐비트를 다 측정하는 간단한 회로를 실행한다.
ta: அடிப்படை செயல்பாடு ஒரு குவாண்டம் சுற்று இயங்குகிறது மற்றும் அளவீட்டு விளைவுகளின் எண்ணிக்கையிலான அகராதியை வழங்குகிறது. 2-குவிட் பெல்-நிலையைத் தயாரிக்கும் எளிய சுற்று ஒன்றை இங்கே இயக்குகிறோம்:math:`\left|\psi\right\rangle = \frac{1}{2}\left(\left|0,0\right\rangle + \left|1,1 \right\rangle\right)` மற்றும் இரண்டு குவிட்களையும் அளவிடும்.
tr: Temel işlem, bir kuantum devresini çalıştırır ve ölçüm sonuçlarının sayım sözlüğünü döndürür. Burada, 2 kübitlik bir Bell durumu :math:`\left|\psi\right\rangle = \frac{1}{\sqrt{2}}\left(\left|0,0\right\rangle + \left|1,1 \right\rangle\right)` hazırlayıp her iki kübiti de ölçen basit bir devre çalıştırıyoruz.

source: Returning measurement outcomes for each shot
bn_bn: প্রত্যেকটা শটের ফলাফলের পরিমাপ ফেরত দেওয়া
es_mx: Devolviendo los resultados de medición por cada disparo
es_un: Devolver los resultados de medición para cada iteración
fr_fr: Renvoi des résultats de la mesure pour chaque tir
id_id: Mengembalikan hasil pengukuran untuk setiap shot
it_it: Ottenere i risultati delle misurazioni per ogni shot
ja_jp: 各ショットの測定結果を返します
ko: 매 시행마다 측정의 결과를 반환하기
pt_br: Retornando resultados de medição para cada repetição (shot)
ta: ஒவ்வொரு ஷாட்டுக்கும் அளவீட்டு விளைவுகளைத் தருகிறது
tr: Her deneme için ölçüm sonuçlarını geri döndürme
zh_tw: 回傳每一次實驗的測量結果

source: The ``QasmSimulator`` also supports returning a list of measurement outcomes for each individual shot. This is enabled by setting the keyword argument ``memory=True`` in the ``run``.
bn_bn: ``QasmSimulator`` দ্বারা প্রত্যেক শটের ফলাফলের পরিমাপের তালিকা বানানো যায়। এর জন্য ``run```` ফাংশনে ``memory=True`` আর্গুমেন্টটি দিতে হয়।
es_un: El ``QasmSimulator`` también admite la devolución de una lista de resultados de medición para cada iteración individual. Esto se habilita configurando el argumento ``memory=True`` en el método ``run``.
fr_fr: Le ``QasmSimulator`` supporte également de retourner une liste de résultats de mesure pour chaque tir individuel. Ceci est activé en définissant le mot-clé argument ``memory=True`` dans le ``run``.
ja_jp: ``QasmSimulator`` では、各個別のショットの測定結果リストの返却もサポートしています。 ``run`` に ``memory=True`` のキーワード引数を設定することで有効になります。
ko: ``QasmSimulator`` 도 개별 샷에 대한 측정 결과 목록의 반환을 지원한다. 이는 ``run`` 에 키워드 인수 ``memory=True`` 를 설정하여 활성화시킬 수 있다.
pt_br: O ``QasmSimulator`` também suporta retornar uma lista de resultados de medição para cada disparo individual. Isto é habilitado configurando o argumento de ``memory=True`` em ``run``.
ta: ஒவ்வொரு தனிப்பட்ட ஷாட்டுக்கும் அளவீட்டு விளைவுகளின் பட்டியலைத் திருப்பித் தர ``QasmSimulator`` ஆதரிக்கிறது. ``run`` இல் ``memory=True`` என்ற முக்கிய வாதத்தை அமைப்பதன் மூலம் இது இயக்கப்படுகிறது.
tr: ``QasmSimulator``, her bir ayrı deneme için ölçüm listesini döndürmeyi de destekler. Bu, ``run`` içerisindeki anahtar kelime argümanının ``memory=True`` olarak ayarlanmasıyla etkinleştirilir.
zh_tw: 此``QasmSimulator`` 也支援回傳每一次實驗的測量結果清單。 在 ``run`` 中，設定關鍵字選項 ``memory=True`` ，會啟用這個功能。

source: Aer Simulator Options
bn_bn: এয়ার সিমুলেটরের বিকল্পসমূহ
es_un: Opciones del Simulador Aer
fr_fr: Options du simulateur Aer
ja_jp: Aer シミュレーター・オプション
ko: Aer 시뮬레이터 속 옵션
pt_br: Opções do Simulador Aer
ta: ஏர் சிமுலேட்டர் விருப்பங்கள்
tr: Aer Simülatör Opsiyonları
zh_tw: Aer 模擬器選項

source: The ``AerSimulator`` backend supports a variety of configurable options which can be updated using the ``set_options`` method. See the ``AerSimulator`` API documentation for additional details.
bn_bn: ``AerSimulator`` ব্যাকএন্ড বিভিন্ন ধরনের কনফিগারযোগ্য বিকল্প সমর্থন করে যা ``set_options`` পদ্ধতি ব্যবহার করে হালনাগাদ করা যায়। অতিরিক্ত তথ্যের জন্য ``AerSimulator`` এপিআই (API) বিবরণী দেখুন।
es_un: El backend ``AerSimulator`` admite una variedad de opciones configurables que se pueden actualizar utilizando el método ``set_options``. Consulta la documentación de la API de ``AerSimulator`` para obtener detalles adicionales.
fr_fr: L'environnement ``AerSimulator`` supporte une variété d'options qui peuvent être coonfigurées en utilisant la méthode ``set_options``. Voir la documentation de l'API ``AerSimulator`` pour plus de détails.
ja_jp: ``AerSimulator`` バックエンドは、``set_options`` メソッドを使用して更新できる様々なオプションをサポートしています。詳細については ``AerSimulator`` API ドキュメントを参照してください。
ko: ``AerSimulator`` 백엔드는 ``set_options`` 메서드를 사용하여 업데이트할 수 있는 다양한 설정들을 지원한다. 자세한 내용은 ``AerSimulator`` API 문서에서 확인할 수 있다.
pt_br: O serviço ``AerSimulator`` suporta uma variedade de opções configuráveis que podem ser atualizadas usando o método ``set_options``. Veja a documentação da API do ``AerSimulator`` para mais detalhes.
ta: ``AerSimulator`` பின்தளத்தில் பல்வேறு கட்டமைக்கக்கூடிய விருப்பங்களை ஆதரிக்கிறது, அவை ``set_options`` முறையைப் பயன்படுத்தி புதுப்பிக்கப்படலாம். கூடுதல் விவரங்களுக்கு ``AerSimulator`` API ஆவணங்களைக் காண்க.
tr: ``AerSimulator`` arkayüzeyi, ``set_options`` metodu kullanılarak güncellenebilen çeşitli yapılandırılabilir opsiyonları destekler. İlave detaylar için ``AerSimulator`` API dokümantasyonuna bakınız.
zh_tw: ``AerSimulator`` 後台支援各種可配置的選項，可使用 ``set_options`` 方法來更新。 如需其他詳細資料，請參閱 ``AerSimulator``的 API 文件。

source: Simulation Method
bn_bn: সিমুলেশন(মহড়া) পদ্ধতি সমূহ
es_un: Método de Simulación
fr_fr: Méthode de simulation
ja_jp: シミュレーション方法
ko: 시뮬레이션 방법
pt_br: Método de Simulação
ta: உருவகப்படுத்துதல் முறை
tr: Simülasyon Metodu
zh_tw: 模擬方法

source: The ``AerSimulator`` supports a variety of simulation methods, each of which supports a different set of instructions. The method can be set manually using ``simulator.set_option(method=value)`` option, or a simulator backend with a preconfigured method can be obtained directly from the ``Aer`` provider using ``Aer.get_backend``.
bn_bn: ``AerSimulator`` বিভিন্ন সিমুলেশন পদ্ধতি সমর্থন করে, যার প্রতিটি নির্দেশনার একটি ভিন্ন সেট সমর্থন করে। পদ্ধতিটি ``simulator.set_option(method=value)`` বিকল্প ব্যবহার করে ম্যানুয়ালি সেট করা যেতে পারে, অথবা একটি পূর্বনির্ধারিত পদ্ধতি সহ একটি সিমুলেটর ব্যাকএন্ড ``Aer.get_backend`` ব্যবহার করে সরাসরি ``Aer`` প্রোভাইডার এর কাছ থেকে পাওয়া যেতে পারে।
es_un: El ``AerSimulator`` admite una variedad de métodos de simulación, cada uno de los cuales admite un conjunto diferente de instrucciones. El método se puede configurar manualmente usando la opción ``simulator.set_option(method=value)``, o se puede obtener un simulador de backend con un método preconfigurado directamente del proveedor ``Aer`` usando ``Aer.get_backend``.
fr_fr: Le ``AerSimulator`` supporte une variété de méthodes de simulation, chacune d'entre elles supporte un ensemble d'instructions différent. La méthode peut être définie manuellement en utilisant ``simulator.set_option(method=value)`` ou un environnement de simulation avec une méthode préconfigurée peuvent être obtenus directement à partir du fournisseur de ``Aer`` en utilisant ``Aer.get_backend``.
ja_jp: ``AerSimulator`` は、さまざまなシミュレーションメソッドをサポートしており、それぞれ異なる命令セットをサポートしています。このメソッドは ``simulator.set_option(method=value)`` オプションを使用するか、``Aer`` プロバイダから ``Aer_get_backend`` を使用して直接取得できる事前設定されたメソッドを持つシミュレーターバックエンドを使って、マニュアルで設定することができます。
ko: ``AerSimulator`` 는 각각 다른 목록의 명령어들을 지원하는 다양한 시뮬레이션 방법들을 지원한다. 이 방법을 ``simulator.set_option(method=value)`` 옵션을 통해 수동으로 설정하거나 ``Aer.get_backend`` 를 사용해 ``Aer`` 제공자에서 바로 시뮬레이션 방법이 다 구성된 시뮬레이터 백엔드를 얻을 수 있다.
pt_br: O ``AerSimulator`` suporta uma variedade de métodos de simulação, dos quais cada um contempla um conjunto diferente de instruções. O método pode ser definido manualmente utilizando a opção ``simulator.set_option(method=value)``, ou um serviço simulador com um método pré-configurado pode ser obtido diretamente do provedor ``Aer`` utilizando ``Aer.get_backend``.
ta: ``AerSimulator`` பலவிதமான உருவகப்படுத்துதல் முறைகளை ஆதரிக்கிறது, அவை ஒவ்வொன்றும் வெவ்வேறு வழிமுறைகளை ஆதரிக்கின்றன. ``simulator.set_option(method=value)`` விருப்பத்தைப் பயன்படுத்தி இந்த முறையை கைமுறையாக அமைக்கலாம், அல்லது முன்பே கட்டமைக்கப்பட்ட முறையுடன் கூடிய சிமுலேட்டர் பின்தளத்தில் ``Aer`` வழங்குநரிடமிருந்து ``Aer.get_backend`` ஐப் பயன்படுத்தி நேரடியாகப் பெறலாம்.
tr: ``AerSimulator``, her biri farklı bir komut setini destekleyen çeşitli simülasyon metotlarını destekler. Metot, ``simulator.set_option(method=value)`` opsiyonu kullanılarak manuel olarak ayarlanabilir veya önceden yapılandırılmış metotlu bir simülatör arkayüzü, ``Aer.get_backend`` kullanılarak doğrudan ``Aer`` sağlayıcısından alınabilir.
zh_tw: ``AerSimulator`` 支援各種模擬方法，每種模擬方法都支援不同的指令集。 我們可以使用 ``simulator.set_option(method=value)`` 選項來手動設定使用哪種模擬方法，或使用``Aer.get_backend`` 直接從 ``Aer`` provider 取得已預設模擬方法的模擬器後台。

source: When simulating ideal circuits, changing the method between the exact simulation methods ``stabilizer``, ``statevector``, ``density_matrix`` and ``matrix_product_state`` should not change the simulation result (other than usual variations from sampling probabilities for measurement outcomes)
bn_bn: আদর্শ বর্তনী (সার্কিট) অনুকরণ করার সময়, সঠিক সিমুলেশন পদ্ধতি ``stabilizer``, ``statevector``, ``density_matrix`` এবং ``matrix_product_state`` এর মধ্যে পদ্ধতি পরিবর্তন করলে সিমুলেশন ফলাফল পরিবর্তন করা উচিত নয় (নমুনা সম্ভাব্যতার স্বাভাবিক বৈচিত্র্য ছাড়া অন্য পরিমাপের ফলাফলের জন্য)
es_un: Cuando se simulan circuitos ideales, al cambiar el método entre los de simulación exactos ``stabilizer``, ``statevector``, ``density_matrix`` y ``matrix_product_state`` no debería cambiar el resultado de la simulación (aparte de las variaciones habituales de las probabilidades de muestreo para los resultados de medición)
fr_fr: Lors de la simulation de circuits idéaux, changer la méthode entre les méthodes de simulation exactes ``stabilisateur``, ``statevector``, ``density_matrix`` et ``matrix_product_state`` ne doivent pas changer le résultat de la simulation (autres que les variations habituelles des probabilités d'échantillonnage pour les résultats de mesure)
ja_jp: 理想的な回路をシミュレートする場合、厳密なシミュレーションメソッド ``stabilizer``, ``statevector``, ``density_matrix`` と ``matrix_product_state`` の間のメソッドを変えても、シミュレーション結果は変わりません (測定結果のサンプリング確率による変動以外)。
ko: 이상적인 회로를 시뮬레이션할 때 시뮬레이션 방법을 정확도가 높은 방법들인 ``stabilizer``, ``statevector``, ``density_matrix``, 그리고 ``matrix_product_state`` 사이에서 바꾼다면 시뮬레이션 결과는 바뀌지 않을 것이다. (측정 결과에 대한 표본 추출 확률들의 일반적인 변형을 제외한다면)
pt_br: Ao simular circuitos ideais, mudar o método dentre os de simulação exata ``stabilizer``, ``statevector``, ``density_matrix`` e ``matrix_product_state`` não deve alterar o resultado da simulação (a não ser que ocorra variações, às vezes comuns, de probabilidades de amostragem para resultados de medições)
ta: இலட்சிய சுற்றுகளை உருவகப்படுத்தும்போது, ​​சரியான உருவகப்படுத்துதல் முறைகளுக்கு இடையில் முறையை மாற்றுவது ``stabilizer``, ``statevector``, ``density_matrix`` மற்றும் ``matrix_product_state`` ஆகியவை உருவகப்படுத்துதல் முடிவை மாற்றக்கூடாது (மாதிரி நிகழ்தகவுகளிலிருந்து வழக்கமான வேறுபாடுகள் தவிர அளவீட்டு விளைவுகளுக்கு)
tr: İdeal devreleri simüle ederken, ``stabilizer``, ``statevector``, ``density_matrix`` ve ``matrix_product_state`` simülasyon metotları arasında değişiklik yapılması simülasyon sonucunu değiştirmemelidir (ölçüm sonuçları için örnekleme olasılıklarından gelen olağan varyasyonlar dışında)
zh_tw: 在模擬理想電路時，選擇使用不同的精確模擬方法如 ``stabilizer``, ``statevector``, ``density_matrix`` 或者是 ``matrix_product_state``，在取樣機率造成的測量結果的變化之外，模擬結果應相同。

source: Automatic Simulation Method
bn_bn: স্বয়ংক্রিয় সিমুলেশন পদ্ধতি
es_un: Método de Simulación Automática
fr_fr: Méthode de simulation automatique
ja_jp: 自動シミュレーションメソッド
ko: 자동 시뮬레이션 방법
pt_br: Método de Simulação Automática
ta: தானியங்கி உருவகப்படுத்துதல் முறை
tr: Otomatik Simülasyon Metodu
zh_tw: 自動模擬方法
