Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/simulators/1_aer_provider.po
Languages: bn_bn, es_mx, es_un, fr_fr, id_id, it_it, ja_jp, ko, pt_br, ta, tr, zh_tw

source: The default simulation method is ``automatic`` which will automatically select a one of the other simulation methods for each circuit based on the instructions in those circuits. A fixed simulation method can be specified by by adding the method name when getting the backend, or by setting the ``method`` option on the backend.
bn_bn: স্বতঃসিদ্ধ নিয়মানুসারে সিমুলেশন পদ্ধতি হল ``automatic`` যা স্বয়ংক্রিয়ভাবে সেই সার্কিটের নির্দেশনাবলীর উপর ভিত্তি করে প্রতিটি বর্তনীর জন্য অন্য একটি সিমুলেশন পদ্ধতি বেছে নেবে। ব্যাকএন্ড পাওয়ার সময় পদ্ধতির নাম যোগ করে অথবা ব্যাকএন্ডে ``method`` বিকল্পটি সেট করে একটি নির্দিষ্ট সিমুলেশন পদ্ধতি ধার্য করা যেতে পারে।
es_un: El método de simulación predeterminado es ``automatic`` que seleccionará automáticamente uno de los otros métodos de simulación para cada circuito según las instrucciones de esos circuitos. Se puede especificar un método de simulación fijo agregando el nombre del método al obtener el backend o configurando la opción ``method`` en el backend.
fr_fr: La méthode de simulation par défaut est ``automatic`` qui sélectionnera automatiquement une des autres méthodes pour chaque circuit en fonction de leurs instructions. Une méthode de simulation fixe peut être spécifiée en ajoutant le nom de ladite méthode lors de la récupération de l'environnement, ou en définissant l'option ``method`` sur le backend.
ja_jp: デフォルトのシミュレーションメソッドは ``automatic`` で、回路の命令に基づいて回路ごとにシミュレーションメソッドを自動的に選択します。固定のシミュレーションメソッドを指定することもできます。バックエンドを取得するときにメソッド名を追加するか、バックエンドに ``method`` オプションを設定することで指定します。
ko: 기본 시뮬레이션 방법은 회로 속 명령어들에 따라 자동으로 시뮬레이션 방법을 선택하는 ``automatic`` 이다. 고정 시뮬레이션 방법은 백엔드를 가져올 때 방법 이름을 추가하거나 백엔드에서 ``method`` 옵션을 설정하여 지정할 수 있다.
pt_br: O método padrão de simulação é o ``automatic`` que selecionará automaticamente um dos outros métodos de simulação para cada circuito baseado nas instruções desses circuitos. Um método de simulação fixo pode ser especificado adicionando o nome do método ao obter o serviço, ou definindo a opção ``method`` no serviço.
ta: இயல்புநிலை உருவகப்படுத்துதல் முறை ``automatic`` என்பது அந்த சுற்றுகளில் உள்ள வழிமுறைகளின் அடிப்படையில் ஒவ்வொரு சுற்றுக்கும் பிற உருவகப்படுத்துதல் முறைகளில் ஒன்றை தானாகத் தேர்ந்தெடுக்கும். பின்தளத்தில் பெறும்போது முறையின் பெயரைச் சேர்ப்பதன் மூலமாகவோ அல்லது பின்தளத்தில் ``method`` விருப்பத்தை அமைப்பதன் மூலமாகவோ ஒரு நிலையான சிமுலேஷன் முறையைக் குறிப்பிடலாம்.
tr: Varsayılan simülasyon metodu ``automatic``, devrelerdeki komutlara göre her devre için diğer simülasyon metotlarından birini otomatik olarak seçecektir. Backend alınırken metot adı eklenerek veya backend'deki ``method`` opsiyonu ayarlanarak sabit bir simülasyon metodu belirtilebilir.
zh_tw: 其模擬方法預設為 ` ` automatic` ` ，此選項會根據那些電路中的指令，從其他的模擬方法中自動為每一個電路選擇一個要使用的模擬方法。若要指定固定的模擬方法，可透過在取得後台時新增該方法名稱，或者透過在後台設定其``method``選項。

source: GPU Simulation
bn_bn: জিপিইউ মহড়া (সিমুলেশন)
es_un: Simulación en GPU
fr_fr: Simulation GPU
ja_jp: GPU シミュレーション
ko: GPU 시뮬레이션
pt_br: Simulação de GPU
ta: GPU உருவகப்படுத்துதல்
tr: GPU Simülasyonu
zh_tw: GPU 模擬

source: The ``statevector``, ``density_matrix`` and ``unitary`` simulators support running on a NVidia GPUs. For these methods the simulation device can also be manually set to CPU or GPU using ``simulator.set_options(device='GPU')`` backend option. If a GPU device is not available setting this option will raise an exception.
bn_bn: ``statevector``, ``density_matrix`` এবং ``unitary`` সিমুলেটরগুলি NVidia জিপিইউতে চলমান সমর্থন করে। এই পদ্ধতির জন্য সিমুলেশন ডিভাইসটি ``simulator.set_options (device = 'GPU")`` ব্যাকএন্ড বিকল্প ব্যবহার করে ম্যানুয়ালি CPU বা GPU তে সেট করা যেতে পারে। যদি জিপিইউ ডিভাইস না পাওয়া যায় তবে এই বিকল্পটি একটি ব্যতিক্রম তৈরি করবে।
es_un: Los simuladores ``statevector``, ``density_matrix`` y ``unitary`` admiten la ejecución en una GPU NVidia. Para estos métodos, el dispositivo de simulación también se puede configurar manualmente en CPU o GPU usando la opción de backend ``simulator.set_options(device='GPU')``. Si un dispositivo GPU no está disponible, esta opción generará una excepción.
fr_fr: Les simulateurs ``statevector``, ``density_matrix`` et ``unitary`` supportent l'exécution sur un GPU NVidia. Pour ces méthodes, le périphérique de simulation peut également être configuré manuellement sur CPU ou GPU à l'aide de l'option```simulator.set_options(device='GPU')``. Si un périphérique GPU n'est pas disponible, définir cette option déclenchera une exception.
ja_jp: ``statevector``, ``density_matrix`` と ``unitary`` シミュレータは NVidia GPU 上で動作します。 これらのメソッドのために、シミュレーションデバイスは ``simulator.set_options(device='GPU')`` バックエンドオプションを設定してマニュアルで CPU または GPU を設定することができます。もし GPU デバイスが利用できない場合には、この設定は例外をあげます。
ko: ``statevector``, ``density_matrix`` 그리고 ``unitary`` 시뮬레이터들은 엔비디아 GPU에서 실행될 수 있다. 이 메서들에 대한 시뮬레이션 장치는 ``simulator.set_options(device='GPU')`` 백엔드 옵션을 활용하여 수동으로 CPU나 GPU로 설정할 수 있다. 만약 GPU 장치를 사용할 수 없다면 이러한 옵션은 예외를 발생시킬 것이다.
pt_br: Os simuladores ``statevector``, ``density_matrix`` e ``unitary`` suportam execução em GPUs da NVidia. Para estes métodos, o dispositivo de simulação também pode ser configurado manualmente para CPU ou GPU usando a opção ``simulator.set_options(device='GPU')`` do serviço. Se uma GPU não estiver disponível, esta opção gerará uma exceção (ao executar o código envolvendo o simulador).
ta: என்விடியா ஜி.பீ.யுகளில் இயங்குவதற்கு ``statevector``, ``density_matrix`` மற்றும் ``unitary`` சிமுலேட்டர்கள் துணைபுரிகின்றன. இந்த முறைகளுக்கு, ``simulator.set_options (device = 'GPU')`` பின்தளத்தில் விருப்பத்தைப் பயன்படுத்தி உருவகப்படுத்துதல் சாதனத்தை கைமுறையாக CPU அல்லது GPU க்கு அமைக்கலாம். ஒரு GPU சாதனம் கிடைக்கவில்லை என்றால் இந்த விருப்பம் விதிவிலக்கை எழுப்புகிறது.
tr: ``statevector``, ``density_matrix`` ve ``unitary`` simülatörleri, NVIDIA GPU'ları üzerinde çalıştırılmayı desteklerler. Bu metotlar için simülasyon cihazı, ``simulator.set_options(device='GPU')`` backend opsiyonu kullanılarak CPU'ya veya GPU'ya manuel olarak ayarlanabilir. GPU cihazı mevcut değilse, bu opsiyonu ayarlamak hata verecektir.
zh_tw: ``statevector``， ` ` density_matrix`` 和 ``unitary` ` 這些模擬器支援在 NVidia GPUs 上執行。 對於這些方法，我們透過使用`simulator.set_options(device='GPU')`` 後台選項來手動設定為 CPU 或 GPU 。如果目前沒有 GPU 元件可供使用，則設定選用 GPU 會引發異常狀況。

source: The ``Aer`` provider will also contain preconfigured GPU simulator backends if Qiskit Aer was installed with GPU support on a compatible system:
bn_bn: যদি Qiskit এয়ার একটি সামঞ্জস্যপূর্ণ সিস্টেমে জিপিইউ সাপোর্টের সাথে ইনস্টল করা থাকে তবে ``Aer`` প্রদানকারীর পূর্বনির্ধারিত জিপিইউ সিমুলেটর ব্যাকএন্ডগুলিও থাকবে:
es_un: El proveedor ``Aer`` también contendrá backends de simulador de GPU preconfigurados si Qiskit Aer se instaló con soporte de GPU en un sistema compatible:
fr_fr: Le fournisseur ``Aer`` contiendra également des environnements de simulateurs GPU préconfigurés si Qiskit Aer a été installé avec le support GPU sur un système compatible :
ja_jp: もし Qiskit Aer が GPU をサポートする互換性のあるシステムにインストールされた場合、``Aer`` プロバイダーはまた事前設定された GPU シミュレーターバックエンドを含んでいます。すなわち：
ko: 만약 Qiskit Aer가 호환 가능한 시스템에서 GPU 지원이 가능하게 설치된 경우에는 ``Aer`` 공급자에 미리 구성된 GPU 시뮬레이터 백엔드들이 포함되어 있을 것이다.
pt_br: O provedor ``Aer`` também conterá serviços de simuladores GPU pré-configurados se o Qiskit Aer foi instalado com suporte à GPU em um sistema compatível:
ta: இணக்கமான கணினியில் GPU ஆதரவுடன் Qiskit ஏர் நிறுவப்பட்டிருந்தால், ``Aer`` வழங்குநர் முன்பே கட்டமைக்கப்பட்ட GPU சிமுலேட்டர் பின்தளத்தில் இருக்கும்:
tr: Qiskit Aer GPU desteği olan uyumlu bir sisteme yüklendiyse, ``Aer`` sağlayıcısı, önceden yapılandırılmış GPU simülatör backend'lerini de içerecektir:
zh_tw: 如果 Qiskit Aer被安裝在相容系統上且有 GPU 支援，則 ``Aer`` provider也將包含預先配置的 GPU 模擬器後台：

source: *Note: The GPU version of Aer can be installed using* ``pip install qiskit-aer-gpu``.
es_un: *Nota: La versión GPU de Aer se puede instalar usando* ``pip install qiskit-aer-gpu``.
fr_fr: *Note: La version GPU d'Aer peut être installée en utilisant* ``pip install qiskit-aer-gpu``.
ja_jp: *注: Aer の GPU バージョンは、* ``pip install qiskit-aer-gpu`` *を使用してインストールできます。*
ko: *참고: Aer의 GPU 버전은 ``pip install qiskit-aer-gpu`` 를 사용하여 설치할 수 있다.*
ta: *குறிப்பு: ஏரின் GPU பதிப்பை ``pip install qiskit-aer-gpu`` ஐப் பயன்படுத்தி நிறுவ முடியும்*.
tr: *Not: Aer'in GPU versiyonu,* ``pip install qiskit-aer-gpu`` *kullanılarak yüklenebilir.*

source: Simulation Precision
bn_bn: সিমুলেশন নির্ভুলতা
es_un: Precisión de la Simulación
fr_fr: Précision de simulation
ja_jp: シミュレーションの精度
ko: 시뮬레이션 정밀도
pt_br: Precisão da Simulação
ta: உருவகப்படுத்துதல் துல்லியம்
tr: Simülasyon Duyarlığı
zh_tw: 模擬精準度

source: One of the available simulator options allows setting the float precision for the ``statevector``, ``density_matrix``, ``unitary`` and ``superop`` methods. This is done using the ``set_precision="single"`` or ``precision="double"`` (default) option:
es_un: Una de las opciones disponibles del simulador permite configurar la precisión de punto flotante para los métodos ``statevector``, ``density_matrix``, ``unitary`` y ``superop``. Esto se hace usando la opción ``set_precision="single"`` o ``precision="double"`` (predeterminada):
fr_fr: Une des options disponibles du simulateur permet de définir la précision des nombres décimaux pour les méthodes ``statevector``, ``density_matrix``, ``unitary`` et ``superop``. Ceci est fait en utilisant l'option ``set_precision="single"`` ou ``precision="double"`` (par défaut) :
ja_jp: ``statevector``、``density_matrix`` ``unitary`` および ``superop`` メソッドのシミュレーターオプションの中に、浮動小数点精度を設定可能なものがあります。``set_precision="single"`` または ``precision="double"`` (デフォルト) オプションです：
ko: ``statevector``, ``density_matrix``, ``unitary`` 그리고 ``superop`` 방법에 대한 정밀도를 float로 설정하는 옵션도 사용할 수 있다. 이는 ``set_precision="single"`` 또는 ``precision="double"`` (기본값) 옵션을 이용해 수행된다:
ta: கிடைக்கக்கூடிய சிமுலேட்டர் விருப்பங்களில் ஒன்று, ``ஸ்டேவெக்டர்``, ``டென்சிட்டி_மேட்ரிக்ஸ்``, ``ஒனிட்டரி`` மற்றும் ``சூப்பராப்`` முறைகளுக்கான மிதவைத் துல்லியத்தை அமைக்க அனுமதிக்கிறது. இது ``set_precision="single"`` அல்லது ``precision="double"`` (default) விருப்பத்தைப் பயன்படுத்தி செய்யப்படுகிறது:
tr: Mevcut simülatör seçeneklerinden biri ``statevector``, ``density_matrix``, ``unitary`` ve ``superop`` metodları için kayan nokta duyarlığını ayarlamaya izin verir. Bu, ``set_precision="single"`` veya ``precision="double"`` (varsayılan) seçeneği kullanılarak yapılır:

source: Setting the simulation precision applies to both CPU and GPU simulation devices. Single precision will halve the required memory and may provide performance improvements on certain systems.
bn_bn: সিমুলেশন স্পষ্টতা সেট করা উভয় CPU এবং GPU সিমুলেশন ডিভাইসের ক্ষেত্রে প্রযোজ্য। একক স্পষ্টতা প্রয়োজনীয় মেমোরি অর্ধেক করে দেবে এবং নির্দিষ্ট সিস্টেমে কর্মক্ষমতা উন্নতি করতে পারে।
es_un: La configuración de la precisión de la simulación se aplica a los dispositivos de simulación de CPU y GPU. La precisión simple reducirá a la mitad la memoria requerida y puede proporcionar mejoras de rendimiento en ciertos sistemas.
fr_fr: Le réglage de la précision de la simulation s'applique à la fois aux périphériques de simulation CPU et GPU. Une précision unique réduira de moitié la quantité de mémoire requise et permettra d'améliorer les performances de certains systèmes.
ja_jp: シミュレーション精度の設定は、CPU と GPU シミュレーションデバイスの両方に適用されます。 単精度は必要なメモリを半分にし、システムによっては性能を向上させる可能性があります。
ko: 시뮬레이션 정밀도를 설정하는 것은 CPU 와 GPU 시뮬레이션 장치 둘 다에 적용된다. 단일 정밀도는 필요한 메모리를 절반으로 줄이고 특정 시스템에 대해 성능을 향상시킬 수 있다.
pt_br: Definir a precisão da simulação aplica-se tanto a dispositivos de simulação para CPU quanto para GPU. Uma precisão única reduzirá pela metade a memória requerida e poderá proporcionar melhorias de desempenho em certos sistemas.
ta: உருவகப்படுத்துதல் முன்னுரிமையை அமைப்பது CPU மற்றும் GPU உருவகப்படுத்துதல் சாதனங்களுக்கு பொருந்தும். ஒற்றை துல்லியம் தேவைப்படும் நினைவகத்தை பாதியாகக் குறைக்கும் மற்றும் சில கணினிகளில் செயல்திறன் மேம்பாடுகளை வழங்கக்கூடும்.
tr: Simülasyon duyarlığının ayarlanması hem CPU hem de GPU simülasyon cihazları için geçerlidir. Tek duyarlık, gerekli belleği yarıya indirecektir ve belirli sistemlerde performans iyileştirmeleri sağlayabilir.
zh_tw: 設定模擬精準度適用於 CPU 和 GPU 模擬元件。 單一精準度會使所須的記憶體減半，並可能在某些系統上提供效能改進。

source: Custom Simulator Instructions
bn_bn: বিশেষায়িত (কাস্টম) সিমুলেটরের নির্দেশনা সমূহ
es_un: Instrucciones Personalizadas del Simulador
fr_fr: Instructions du simulateur personnalisé
ja_jp: カスタムシミュレーター命令
ko: 맞춤형 시뮬레이터 명령들
pt_br: Instruções de Simulador Personalizadas
ta: தனிப்பயன் சிமுலேட்டர் வழிமுறைகள்
tr: Özel Simülasyon Komutları
zh_tw: 自訂模擬器指示

source: Saving the simulator state
bn_bn: সিমুলেটরের মান বা অবস্থা সংরক্ষণ করা
es_un: Guardar el estado del simulador
fr_fr: Enregistrement de l'état du simulateur
ja_jp: シミュレーター状態の保存
ko: 시뮬레이터 상태 저장하기
pt_br: Salvando o estado do simulador
ta: சிமுலேட்டர் நிலையைச் சேமிக்கிறது
tr: Simülatör durumunu kaydetme
zh_tw: 儲存模擬器狀態

source: The state of the simulator can be saved in a variety of formats using custom simulator instructions.
bn_bn: সিমুলেটরের অবস্থা বিশেষায়িত (কাস্টম) সিমুলেটর নির্দেশনাবলী ব্যবহার করে বিভিন্ন ফরম্যাটে সংরক্ষণ করা যায়।
es_un: El estado del simulador se puede guardar en una variedad de formatos usando instrucciones personalizadas del simulador.
fr_fr: L'état du simulateur peut être sauvegardé dans différents formats en utilisant des instructions de simulateur personnalisées.
ja_jp: シミュレータの状態は、カスタムシミュレーターの命令を使用してさまざまな形式で保存できます。
ko: 시뮬레이터의 상태는 맞춤형 시뮬레이터 명령들을 사용해 다양한 형식으로 저장될 수 있다.
pt_br: O estado do simulador pode ser salvo em uma variedade de formatos usando instruções do simulador personalizadas.
ta: தனிப்பயன் சிமுலேட்டர் வழிமுறைகளைப் பயன்படுத்தி சிமுலேட்டரின் நிலையை பல்வேறு வடிவங்களில் சேமிக்க முடியும்.
tr: Simülatörün durumu, özel simülatör komutları kullanılarak çeşitli biçimlerde kaydedilebilir.
zh_tw: 通過使用自訂模擬指令，模擬器的狀態可以各種格式被儲存。

source: Circuit method
bn_bn: বর্তনী (সার্কিট) পদ্ধতি
es_un: Método de circuito
fr_fr: Méthode de circuit
ja_jp: Circuit メソッド
ko: 회로 메서드
pt_br: Método de Circuito
ta: மின்சுற்று முறை
tr: Devre yöntemi
zh_tw: 電路方法

source: Description
bn_bn: বিবরণ
es_un: Descripción
ja_jp: 概要
ko: 설명
pt_br: Descrição
ta: விளக்கம்
tr: Açıklama
zh_tw: 說明

source: Supported Methods
bn_bn: সাহায্যকারী পদ্ধতিসমূহ
es_un: Métodos Soportados
fr_fr: Méthodes prises en charge
ja_jp: サポートされているメソッド
ko: 지원되는 메서드들
pt_br: Métodos Suportados
ta: ஆதரிக்கப்படும் முறைகள்
tr: Desteklenen Yöntemler
zh_tw: 支援的方法

source: Save the simulator state in the native format for the simulation method
bn_bn: সিমুলেশন পদ্ধতির জন্য সহজাত বিন্যাসে সিমুলেটর অবস্থা সংরক্ষণ করুন
es_un: Guarda el estado del simulador en el formato nativo para el método de simulación
fr_fr: Enregistrer l'état du simulateur dans le format natif pour la méthode de simulation
ja_jp: シミュレーターの状態をシミュレーションメソッドのネイティブ形式で保存します。
ko: 시뮬레이터 상태를 시뮬레이션 방법의 기본 형식으로 저장한다
pt_br: Salve o estado do simulador no formato nativo para o método de simulação
ta: உருவகப்படுத்துதல் முறைக்கு சிமுலேட்டர் நிலையை சொந்த வடிவத்தில் சேமிக்கவும்
tr: Simülasyon metodu için simülatör durumunu yerel biçimde kaydeder
zh_tw: 對於此模擬方法，以原生格式儲存模擬器狀態

source: All
bn_bn: সমস্ত
es_un: Todos
fr_fr: Tout
ja_jp: すべて
ko: 전부
pt_br: Todos
ta: அனைத்தும்
tr: Tümü
zh_tw: 全部

source: Save the simulator state as a statevector
bn_bn: সিমুলেটর স্টেটকে স্টেটভেক্টর হিসেবে সংরক্ষণ করুন
es_un: Guarda el estado del simulador como un vector de estado
fr_fr: Enregistrer l'état du simulateur en tant que vecteur d'état
ja_jp: シミュレーターの状態を状態ベクトルとして保存
ko: 시뮬레이터 상태를 상태 벡터로 저장한다
pt_br: Salve o estado do simulador como um vetor de estados
ta: சிமுலேட்டர் நிலையை ஒரு ஸ்டேட்வெக்டராக சேமிக்கவும்
tr: Simülatör durumunu durum vektörü olarak kaydeder
zh_tw: 將模擬器狀態儲存為狀態向量

source: Save the simulator state as a Clifford stabilizer
bn_bn: একটি ক্লিফোর্ড স্টেবিলাইজার হিসাবে সিমুলেটর অবস্থা সংরক্ষণ করুন
es_un: Guarda el estado del simulador como un estabilizador Clifford
fr_fr: Enregistrer l'état du simulateur en tant que stabilisateur Clifford
ja_jp: Cliffordスタビライザーとしてシミュレーターの状態を保存
ko: 시뮬레이터 상태를 Clifford stabilizer로 저장한다
pt_br: Salve o estado do simulador como um estabilizador Clifford
ta: சிமுலேட்டர் நிலையை கிளிஃபோர்ட் நிலைப்படுத்தியாக சேமிக்கவும்
tr: Simülatör durumunu Clifford sabitleyicisi olarak kaydeder
zh_tw: 將此模擬器狀態儲存為一個 Clifford 穩定器

source: Save the simulator state as a density matrix
bn_bn: একটি ঘনত্ব ম্যাট্রিক্স হিসাবে সিমুলেটর অবস্থা সংরক্ষণ করুন
es_un: Guarda el estado del simulador como una matriz de densidad
fr_fr: Enregistrer l'état du simulateur comme une matrice de densité
ja_jp: シミュレーターの状態を密度行列として保存
ko: 시뮬레이터 상태를 밀도 행렬로 저장한다
pt_br: Salve o estado do simulador como uma matriz de densidade
ta: சிமுலேட்டர் நிலையை அடர்த்தி மேட்ரிக்ஸாக சேமிக்கவும்
tr: Simülatör durumunu yoğunluk matrisi olarak kaydeder
zh_tw: 將模擬器狀態儲存為密度矩陣

source: Save the simulator state as a a matrix product state tensor
bn_bn: সিমুলেটর স্টেটকে ম্যাট্রিক্স গুণন অবস্থা টেন্সর হিসেবে সংরক্ষণ করুন
es_un: Guarda el estado del simulador como un tensor de estado del producto matricial
fr_fr: Enregistrer l'état du simulateur comme tenseur d'état du produit de la matrice
ja_jp: シミュレーターの状態を行列積状態のテンソルとして保存
ko: 시뮬레이터 상태를 행렬 곱 상태 텐서로 저장한다
pt_br: Salve o estado do simulador como uma matriz de estado do produto tensor
ta: சிமுலேட்டர் நிலையை மேட்ரிக்ஸ் தயாரிப்பு நிலை டென்சராக சேமிக்கவும்
tr: Simülatör durumunu, bir matris çarpım durum tensörü olarak kaydedin
zh_tw: 將模擬器狀態儲存為矩陣乘積狀態張量

source: Save the simulator state as unitary matrix of the run circuit
bn_bn: রান সার্কিটের ঐকিক (ইউনিটারি) ম্যাট্রিক্স হিসাবে সিমুলেটর অবস্থা সংরক্ষণ করুন
es_un: Guarda el estado del simulador como matriz unitaria del circuito de ejecución
fr_fr: Enregistrer l'état du simulateur sous forme de matrice unitaire du circuit d'exécution
ja_jp: シミュレーターの状態を実行回路のユニタリー行列として保存
ko: 시뮬레이터 상태를 실행된 회로의 단일 행렬로 저장한다
pt_br: Salvar o estado do simulador como matriz unitária do circuito executado
ta: சிமுலேட்டர் நிலையை ரன் சர்க்யூட்டின் ஒற்றையாட்சி மேட்ரிக்ஸாக சேமிக்கவும்
tr: Simülator durumunu çalıştırma devresinin üniter matrisi olarak kaydeder
zh_tw: 將模擬器狀態儲存為執行電路的么正矩陣

source: Save the simulator state as superoperator matrix of the run circuit
bn_bn: সিমুলেটর স্টেটকে রান সার্কিটের সুপারঅপারেটর ম্যাট্রিক্স হিসেবে সংরক্ষণ করুন
es_un: Guarda el estado del simulador como matriz de superoperador del circuito de ejecución
fr_fr: Enregistrer l'état du simulateur sous forme de super-opérateur du circuit d'exécution
ja_jp: シミュレーターの状態を実行回路の超演算子行列として保存
ko: 시뮬레이터 상태를 실행된 회로의 superoperator 행렬로 저장한다
pt_br: Salvar o estado do simulador como matriz superoperadora do circuito executado
ta: சிமுலேட்டர் நிலையை ரன் சர்க்யூட்டின் சூப்பர் ஆபரேட்டர் மேட்ரிக்ஸாக சேமிக்கவும்
tr: Simülatör durumunu, çalışma devresinin süperoperatör matrisi olarak kaydedin
zh_tw: 將模擬器狀態儲存為執行電路的超算運算子矩陣

source: Note that these instructions are only supported by the Aer simulator and will result in an error if a circuit containing them is run on a non-simulator backend such as an IBM Quantum device.
bn_bn: মনে রাখবেন যে এই নির্দেশনাবলী শুধুমাত্র এয়ার সিমুলেটর দ্বারা সমর্থিত এবং যদি একটি সার্কিট একটি IBM কোয়ান্টাম ডিভাইসের মত একটি নন-সিমুলেটর ব্যাকএন্ডে চালিত হয় তবে এটি একটি ত্রুটি সৃষ্টি করবে।
es_un: Ten en cuenta que estas instrucciones solo son compatibles con el simulador Aer y darán lugar a un error si un circuito que las contiene se ejecuta en un backend que no es un simulador, como un dispositivo IBM Quantum.
fr_fr: Notez que ces instructions ne sont prises en charge que par le simulateur Aer. Vous obtiendrez une erreur si vous exécutez un circuit avec ces instructions sur un backend non simulateur tel qu'un périphérique IBM Quantum.
ja_jp: これらの命令は Aer シミュレーターでのみサポートされ、これらの命令を含む回路がもし IBM Quantum デバイスなどの非シミュレーターバックエンドで実行されると、エラーになります。
ko: 이러한 명령어들은 Aer 시뮬레이터에서만 지원되고, IBM 양자 장치와 같은 시뮬레이터가 아닌 백엔드에서 이러한 명령어들을 포함한 회로가 실행될 경우 오류가 발생할 것임에 주의하라.
pt_br: Observe que essas instruções somente são suportadas pelo simulador Aer e resultarão em um erro se um circuito que as contenha for executado em um serviço não-simulador, como um dispositivo IBM Quantum.
ta: இந்த வழிமுறைகள் ஏர் சிமுலேட்டரால் மட்டுமே ஆதரிக்கப்படுகின்றன என்பதையும், அவற்றைக் கொண்ட ஒரு சுற்று IBM குவாண்டம் சாதனம் போன்ற சிமுலேட்டர் அல்லாத பின்தளத்தில் இயங்கினால் பிழை ஏற்படும் என்பதையும் நினைவில் கொள்க.
tr: Bu komutların yalnızca Aer simülatörü tarafından desteklendiğini ve bunları içeren bir devrenin IBM Quantum cihazı gibi simülatör olmayan bir backendde çalıştırılması durumunda hata vereceğini unutmayın.
zh_tw: 請注意，這些指令僅由 Aer 模擬器支援，如果包含它們的電路是在非模擬器後台（例如 IBM Quantum 裝置）上執行，則會導致誤差。

source: Saving the final statevector
bn_bn: চূড়ান্ত স্টেটভেক্টর সংরক্ষণ করা
es_un: Guardar el vector de estado final
fr_fr: Enregistrement du vecteur d'état final
ja_jp: 最終状態ベクトルの保存
ko: 최종 상태 벡터 저장하기
pt_br: Salvando o statevector final
ta: இறுதி நிலை திசைனயச் சேமிக்கிறது
tr: Son durum vektörünün kaydedilmesi
zh_tw: 儲存最終狀態向量

source: To save the final statevector of the simulation we can append the circuit with the ``save_statevector`` instruction. Note that this instruction should be applied *before* any measurements if we do not want to save the collapsed post-measurement state
bn_bn: সিমুলেশনের চূড়ান্ত স্টেটভেক্টর সংরক্ষণ করার জন্য আমরা ``save_statevector`` নির্দেশ দিয়ে সার্কিট যুক্ত করতে পারি। মনে রাখবেন যে এই নির্দেশনা যেকোনো পরিমাপের *আগে* প্রয়োগ করা উচিত যদি আমরা পরিমাপের পরে পতিত অবস্থায় সংরক্ষণ করতে না চাই
es_un: Para guardar el vector de estado final de la simulación, podemos agregar al circuito la instrucción ``save_statevector``. Ten en cuenta que esta instrucción debe aplicarse *antes* de cualquier medición si no queremos guardar el estado de post-medición colapsado
fr_fr: Pour sauver l'état final de la simulation, nous pouvons ajouter le circuit à l'instruction ``save_statevector``. Notez que cette instruction doit être appliquée *avant* toutes les mesures si nous ne voulons pas sauvegarder l'état après la mesure et la réduction du paquet d'onde
ja_jp: シミュレーションの最終的な状態ベクトルを保存するには、回路に ``save_statevector`` 命令を追加します。もし測定後の崩壊した状態を保存したいのでなければ、この命令は測定 *前* に適用する必要があることに注意してください。
ko: 시뮬레이션의 최종 상태 벡터를 저장하기 위해서는 회로에 ``save_statevector`` 명령어를 추가하면 된다. 측정 후에 붕괴된 상태를 저장하지 않기 위해서는 이 명령어를 꼭 어떠한 측정 *전에* 적용해야 한다.
pt_br: Para salvar o vetor de estado final da simulação podemos anexar o circuito com a instrução ``save_statevector``. Observe que esta instrução deve ser aplicada *antes* de quaisquer medições caso não desejemos salvar o estado colapsado pós-medição
ta: உருவகப்படுத்துதலின் இறுதி நிலைமாற்றியைச் சேமிக்க, ``save_statevector`` அறிவுறுத்தலுடன் சுற்று சேர்க்கலாம். சரிந்த பிந்தைய அளவீட்டு நிலையை நாம் சேமிக்க விரும்பவில்லை என்றால், இந்த வழிமுறைகள் எந்த அளவீடுகளுக்கும் *before * பயன்படுத்தப்பட வேண்டும் என்பதை நினைவில் கொள்க
tr: Simülasyonun son durum vektörünü kaydetmek için devreye ``save_statevector`` komutuyla ekleme yapabiliriz. Ölçüm sonrası çökmüş durumu kaydetmek istemiyorsak, bu komutun herhangi bir ölçümden *önce* uygulanması gerektiğini unutmayın
zh_tw: 要儲存模擬的最終狀態向量，我們可以將“save_statevector”指令添加到電路中。 請注意，如果我們不想儲存測量後坍縮的狀態，我們就必須在任何測量之前使用此指令。

source: Saving the circuit unitary
bn_bn: সার্কিট একক সংরক্ষণ
es_un: Guardar el circuito unitario
fr_fr: Sauvegarde du circuit unitaire
ja_jp: 回路をユニタリーで保存
ko: 회로의 단일 행렬 저장하기
pt_br: Salvando a unidade do circuito
ta: சுற்று ஒற்றுமையாக சேமிக்கப்படுகிறது
tr: Devre üniterini kaydetme
zh_tw: 存儲電路么正矩陣
