Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/simulators/1_aer_provider.po
Languages: bn_bn, es_mx, es_un, fr_fr, id_id, it_it, ja_jp, ko, pt_br, ta, tr, zh_tw

source: **Notes:** \* These instructions must be applied to all qubits in a circuit, otherwise an exception will be raised. \* The input state must also be a valid state (statevector, density matrix, unitary etc) otherwise an exception will be raised. \* These instructions can be applied at any location in a circuit and will override the current state with the specified one. Any classical register values (e.g. from preceding measurements) will be unaffected \* Set state instructions are only supported by the Aer simulator and will result in an error if a circuit containing them is run on a non-simulator backend such as an IBM Quantum device.
fr_fr: ** Notes:** \ * Ces instructions doivent être appliquées à tous les qubits d'un circuit, sinon une exception sera produite. \ * L'état d'entrée doit également être un état valide (état, matrice de densité, unitaire, etc.), sinon une exception sera produite. \ * Ces instructions peuvent être appliquées à n'importe quel emplacement d'un circuit et remplacer l'état en cours par celui indiqué. Toute valeur de registre classique (par exemple, des mesures précédentes) n'est pas affectée \ * Les instructions definissant un état (set_) sont prises en charge uniquement par le simulateur Aer et entraînent une erreur si un circuit contenant ces instructions est exécuté sur un système dorsal non-simulateur tel qu'une unité IBM Quantum.
ja_jp: **注意:** \* これらの命令は回路内のすべての量子ビットに適用されなければなりません。そうしないと例外が発生します。 \* 入力状態は、有効な状態 (状態ベクトル、密度行列、ユニタリーなど) でなければなりません。そうしないと例外が発生します。 \* これらの命令は、回路内の任意の場所に適用することができ、現在の状態を指定した状態で上書きします。 すべての古典レジスタ値 (例: 以前の測定値から) は影響を受けません。\* 状態設定命令は Aer シミュレーターでのみサポートされており、それらを含む回路が IBM 量子デバイスなどの非シミュレーター・バックエンドで実行されるとエラーになります。
pt_br: **Notas:** \* Estas instruções devem ser aplicadas a todos os qubits de um circuito, caso contrário uma exceção será gerada. \* O estado de entrada também deve ser um estado válido (vetor de estado, matriz de densidade, unitária, etc) caso contrário, uma exceção será gerada. \* Estas instruções podem ser aplicadas em qualquer local de um circuito e irão substituir o estado atual pelo especificado. Quaisquer valores de registradores clássicos (por exemplo, de medições anteriores) não serão afetados. \* Instruções de definição de estado só são suportadas pelo simulador Aer e resultarão em um erro se um circuito que as contêm for executado em um backend não-simulador, como um dispositivo IBM Quantum, por exemplo.
ta: ** குறிப்புகள்: ** \* இந்த வழிமுறைகள் ஒரு சுற்றுவட்டாரத்தில் உள்ள அனைத்து குவிட்டுகளுக்கும் பயன்படுத்தப்பட வேண்டும், இல்லையெனில் விதிவிலக்கு எழுப்பப்படும். \* உள்ளீட்டு நிலை சரியான மாநிலமாக இருக்க வேண்டும் (ஸ்டேட்வெக்டர், டெனிஸ்டி மேட்ரிக்ஸ், யூனிட்டரி போன்றவை) இல்லையெனில் விதிவிலக்கு எழுப்பப்படும். \* இந்த வழிமுறைகள் ஒரு சுற்றுவட்டத்தின் எந்த இடத்திலும் பயன்படுத்தப்படலாம், மேலும் தற்போதைய நிலையை குறிப்பிட்டவற்றுடன் மேலெழுதும். எந்தவொரு கிளாசிக்கல் பதிவு மதிப்புகளும் (எ. கா. முந்தைய அளவீடுகளிலிருந்து) பாதிக்கப்படாது \* செட் நிலை அறிவுறுத்தல்கள் ஏர் சிமுலேட்டரால் மட்டுமே ஆதரிக்கப்படுகின்றன, மேலும் அவை கொண்ட ஒரு சுற்று IBM குவாண்டம் சாதனம் போன்ற சிமுலேட்டர் அல்லாத பின்தளத்தில் இயங்கினால் பிழை ஏற்படும்.
zh_tw: **Notes：** \* 這些指令必須套用到一個電路中的所有量子位元上 ，否則將會產生異常狀況。 \* 輸入狀態也必須是有效的狀態(狀態向量、密度矩陣、么正矩陣等)，否則將會產生異常狀況。 \* 這些指令可以套用至一個電路中的任何位置，並會以指定的狀態置換現行狀態。 任何古典的暫存器數值(例如來自之前的測量值)都不會受到影響 \* 設定狀態指令僅由 Aer 模擬器支援，如果包含它們的電路在非模擬器後台(例如 IBM Quantum 裝置)上執行，則會導致誤差。

source: The basic operation runs a quantum circuit and returns a counts dictionary of measurement outcomes. Here we run a simple circuit that prepares a 2-qubit Bell-state :math:`\left|\psi\right\rangle = \frac{1}{2}\left(\left|0,0\right\rangle + \left|1,1 \right\rangle\right)` and measures both qubits.
pt_br: A operação básica executa um circuito quântico e retorna um dicionário de contagem dos resultados das medições. Aqui nós executaremos um circuito simples que prepara um estado de Bell de 2 qubits :math:`\left|\psi\right\rangle = \frac{1}{2}\left(\left|0,0\right\rangle + \left|1,1 \right\rangle\right)` e mede ambos os qubits.
zh_tw: 基本的操作就是，執行一個量子電路並回傳一個包含測量結果的計數字典。在此，我們執行一個簡單電路，此電路會準備2量子位元貝爾態 :math:`\left|\psi\right\rangle = \frac{1}{2}\left(\left|0,0\right\rangle + \left|1,1 \right\rangle\right)` ，並對兩個量子位元都做測量。

source: *Note: The GPU version of Aer can be installed using ``pip install qiskit-aer-gpu``.*
pt_br: *Nota: A versão para GPU do Aer pode ser instalada usando ``pip install qiskit-aer-gpu``.*

source: One of the available simulator options allows setting the float precision for the ``statevector``, ``density_matrix`` ``unitary`` and ``superop`` methods. This is done using the ``set_precision="single"`` or ``precision="double"`` (default) option:
pt_br: Uma das opções de simuladores disponíveis permite definir a precisão de ponto flutuante para os métodos ``statevector``, ``density_matrix`` ``unitary`` e ``superop``. Isso é feito utilizando a opção ``set_precision="single"`` ou ``precision="double"`` (padrão):

source: ``"automatic"``, ``"superop"``
zh_tw: ``"automatic"``, ``"unitary"``

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/simulators/1_aer_provider.ipynb>`_.
es_mx: Ejecuta interactivamente en `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/simulators/1_aer_provider.ipynb>`_.
id_id: Jalankan secara interaktif dalam ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/simulators/1_aer_provider.ipynb>` _.
it_it: Esegui interattivamente in `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/simulators/1_aer_provider.ipynb>`_.

source: This notebook shows how to import *Qiskit Aer* simulator backends and use them to execute ideal (noise free) Qiskit Terra circuits.
es_mx: Este cuaderno muestra cómo importar los backends del simulador *Qiskit Aer* y utilizarlos para ejecutar circuitos Qiskit Terra ideales (libres de ruido).
id_id: Notebook ini menunjukkan cara mengimpor simulator backend *Qiskit Aer * dan menggunakannya untuk mengeksekusi sirkuit dari Qiskit Terra yang ideal (tanpa derau).
it_it: Questo notebook mostra come importare i backend di simulazione di *Qiskit Aer* e come utilizzarli per eseguire circuiti ideali (senza rumore) scritti in Qiskit Terra.

source: Qiskit Aer simulator backends
es_mx: Simuladores de backends de Qiskit Aer
id_id: Simulator backend Qiskit Aer
it_it: Backend di simulazione di Qiskit Aer

source: Qiskit Aer currently includes three high performance simulator backends: \* ``QasmSimulator``: Allows ideal and noisy multi-shot execution of qiskit circuits and returns counts or memory \* ``StatevectorSimulator``: Allows ideal single-shot execution of qiskit circuits and returns the final statevector of the simulator after application \* ``UnitarySimulator``: Allows ideal single-shot execution of qiskit circuits and returns the final unitary matrix of the circuit itself. Note that the circuit cannot contain measure or reset operations for this backend
es_mx: Actualmente Qiskit Aer incluye tres simuladores de backend de alto desempeño: \* ``QasmSimulator``: Permite la ejecución ideal y ruidosa multi-shot de los circuitos qiskit y devuelve las cuentas o memoria \* ``StatevectorSimulator``: Permite la ejecución ideal de un solo disparo de los circuitos qiskit y devuelve el statevector final del simulador después de aplicarlo \* ``UnitarySimulator``: Permite la ejecución ideal de los circuitos qiskit y devuelve la matriz unitaria final del propio circuito. Ten en cuenta que el circuito no puede contener operaciones de medición o restablecimiento para este backend
id_id: Qiskit Aer merangkup tiga simulator backend berkinerja tinggi: \ * ` ` QasmSimulator ` `: untuk simulasi ideal dan eksekusi sirkuit qiskit dengan noise dan menghasilkan perhitungan atau memori \ * ` ` StatevectorSimulator ` `: untuk simulasi ideal sekali tembak eksekusi sirkuit qiskit dan mengembalikan statevektor final dari simulator \ * ` ` ` UnitarySimulator ` `: untuk simulasi ideal eksekusi sirkuit qiskit sekali tembak dan mengembalikan matrik unitary final dari sirkuit itu sendiri. Perhatikan bahwa sirkuit tidak bisa memiliki pengukuran atau operasi reset operasi di backend ini
it_it: Qiskit Aer al momento include tre backend di simulazione ad alte prestazioni: \* ``QasmSimulator``: Consente l'esecuzione a più shot di circuiti qiskit ideali o in presenza di rumore, restituendo i conteggi o la memoria \* ``StatevectorSimulator``: Consente l'esecuzione a singolo shot di circuiti qiskit ideali e restituisce il vettore di stato finale della simulazione \* ``UnitarySimulator``: Consente l'esecuzione a singolo shot di circuiti qiskit ideali e restituisce la matrice unitaria finale del circuito. Da notare che il circuito non può contenere operazioni di misura o reset quando si utilizza questo backend

source: These backends are found in the ``Aer`` provider with the names ``qasm_simulator``, ``statevector_simulator`` and ``unitary_simulator``, respectively.
es_mx: Estos backends se encuentran en el proveedor ``Aer`` con los nombres ``qasm_simulator``, ``statevector_simulator`` y ``unitary_simulator``, respectivamente.
id_id: Backends ini ditemukan di ` ` Aer ` ` provider dengan nama ` ` qasm_simulator ` `, ` ` statevector_simulator ` ` dan ` ` unitary_simulator ` `.
it_it: Questi backend si possono trovare nel provider ``Aer``, sotto i nomi ``qasm_simulator``, ``statevector_simulator`` e ``unitary_simulator``, rispettivamente.

source: The simulator backends can also be directly imported from ``qiskit.providers.aer``
es_mx: Los simuladores de backend también pueden ser importados directamente desde ``qiskit.providers.aer``
id_id: Backend Simulator juga dapat langsung diimpor dari ` `qiskit.providers.aer ` `
it_it: I backend di simulazione possono anche essere importati direttamente da ``qiskit.providers.aer``

source: The ``QasmSimulator`` backend is designed to mimic an actual device. It executes a Qiskit ``QuantumCircuit`` and returns a count dictionary containing the final values of any classical registers in the circuit. The circuit may contain *gates*, *measurements*, *resets*, *conditionals*, and other advanced simulator options that will be discussed in another notebook.
es_mx: El backend ``QasmSimulator`` está diseñado para simular un dispositivo real. Ejecuta un ``QuantumCircuit`` de Qiskit y devuelve un diccionario con las cuentas que contiene los valores finales de cualquier registro clásico en el circuito. El circuito puede contener *compuertas*, *mediciones*, *resets*, *condicionales*, y otras opciones avanzadas de simulador que serán discutidas en otro cuaderno.
id_id: Backend ` ` QasmSimulator ` ` ` dirancang untuk meniru perangkat yang sebenarnya. Dia mengeksekusi sebuah ` ` QuantumCircuit ` ` Qiskit dan mengembalikan satu dictionary hitungan yang berisi nilai akhir dari setiap register klasik dalam sirkuit. Sirkuit ini mungkin berisi * gates*, * pengukuran *, * reset*, * konditional*, dan pilihan simulator canggih lainnya yang akan dibahas di notebook lain.
it_it: Il backend ``QasmSimulator`` è progettato per simulare un dispositivo reale. Esso esegue un circuito quantistico Qiskit ``QuantumCircuit`` e restituisce un dizionario di conteggi contenente i valori finali di tutti i registri classici nel circuito. Il circuito può contenere *gate*, *misure*, *reset*, operazioni *condizionali*, ed altre opzioni di simulazione avanzata che saranno discusse in un altro notebook.

source: The basic operation executes a quantum circuit and returns a counts dictionary of measurement outcomes. Here we execute a simple circuit that prepares a 2-qubit Bell-state :math:`|\psi\rangle = \frac{1}{2}(|0,0\rangle + |1,1 \rangle)` and measures both qubits.
es_mx: La operación básica ejecuta un circuito cuántico y devuelve un diccionario con las cuentas de resultados de medición. Aquí ejecutamos un circuito simple que prepara un estado de Bell de 2-qubit :math:`|\psi\rangle = \frac{1}{2}(|0,0\rangle + |1,1 \rangle)` y mide ambos qubits.
id_id: Operasi dasar menjalankan sebuah sirkuit kuantum dan mengembalikan sebuah dictionary hitungan hasil pengukuran. Di sini kita jalankan sebuah sirkuit sederhana yang mempersiapkan sebuah 2-qubit Bell-state :math:`| \psi\rangle = \frac{1}{2}(| 0,0\rangle + | 1,1 \rangle) ` dan mengukur kedua qubit.
it_it: L'operazione di base esegue un circuito quantistico e restituisce un dizionario di conteggi contenente gli esiti delle misurazioni. Qui eseguiamo un semplice circuito che prepara uno stato di bell a 2 qubit :math:`|\psi\rangle = \frac{1}{2}(|0,0\rangle + |1,1 \rangle)` e misura entrambi i qubit.

source: The ``QasmSimulator`` also supports returning a list of measurement outcomes for each individual shot. This is enabled by setting the keyword argument ``memory=True`` in the ``assemble`` or ``execute`` function.
es_mx: El ``QasmSimulator`` también puede devolver una lista de resultados de medición para cada disparo individual. Esto se activa poniendo el keyword ``memory=True`` en la función ``assemble`` o ``execute``.
id_id: ` ` QasmSimulator ` ` juga mendukung pengembalian hasil pengukuran untuk setiap shot individual. Ini diaktifkan dengan mengatur argumen kata kunci ` ` memory=True ` ` dalam fungsi ` ` assemble ` ` atau ` ` execute` `.
it_it: Il ``QasmSimulator`` può anche restituire una lista contenente i risultati delle misurazioni di ogni singolo shot. Questa funzionalità può essere abilitata impostando la parola chiave ``memory=True`` nell'argomento delle funzioni ``assemble`` o ``execute``.

source: Starting simulation with a custom initial state
es_mx: Inicio de la simulación con un estado inicial personalizado
id_id: Memulai simulasi dari state awal kustom
it_it: Avviare la simulazione con uno stato iniziale personalizzato

source: The ``QasmSimulator`` allows setting a custom initial statevector for the simulation. This means that all experiments in a Qobj will be executed starting in a state :math:`|\psi\rangle` rather than the all zero state :math:`|0,0,..0\rangle`. The custom state may be set in the circuit using the ``initialize`` method.
es_mx: El ``QasmSimulator`` permite establecer un vector de estado inicial para la simulación. Esto significa que todos los experimentos en un Qobj serán ejecutados comenzando en un estado :math:`|\psi\rangle` en lugar del estado cero :math:`|0,0,. 0\rangle`. El estado puede establecerse en el circuito utilizando el método ``initialize``.
id_id: ` ` ` QasmSimulator ` ` memungkinkan pengaturan kustom awal statevector untuk simulasi. Ini berarti bahwa semua percobaan dalam sebuah Qobj akan dijalankan mulai dari state :math:` | \psi\rangle ` dan bukan dari state semual nol :math:` | 0,0, .. 0\rangle `. State kustom dapat diatur di sirkuit dengan menggunakan metode ` ` initialize ` `.
it_it: Il ``QasmSimulator`` consente di specificare uno determinato vettore di stato di partenza nella simulazione. Questo vuol dire che tutti gli esperimenti in un Qobj saranno eseguiti partendo da uno stato :math:`|\psi\rangle` piuttosto che dallo stato :math:`|0,0,..0\rangle`. Lo stato personalizzato può essere impostato nel circuito utilizzando il metodo ``initialize``.

source: **Note:** \* The initial statevector must be a valid quantum state :math:`|\langle\psi|\psi\rangle|=1`. If not, an exception will be raised. \* The simulator supports this option directly for efficiency, but it can also be unrolled to standard gates for execution on actual devices.
es_mx: **Nota:** \* El vector de estado inicial debe ser un estado cuántico válido :math:`|\langle\psi|\psi\rangle|=1`. Si no, una excepción será arrojada. \* El simulador tiene esta opción por default por eficiencia, pero también puede ser regresado a compuertas estándar para la ejecución en dispositivos reales.
id_id: ** Catatan:** \ * Statevector awal harus berupa state kuantum yang valid :math:` | \langle\psi | \psi\rangle | =1 `. Jika tidak, suatu pengecualian akan dikeluarkan. \ * Simulator mendukung opsi ini secara langsung untuk efisiensi, tetapi juga dapat diterjemahkan ke gate standar untuk eksekusi pada perangkat yang sebenarnya.
it_it: **Nota:**\* Il vettore di stato iniziale deve essere uno stato quantistico valido :math:`|\langle\psi|\psi\rangle|=1`. Nel caso in cui non lo sia, verrà sollevata un'eccezione. \* Il simulatore supporta questa opzione direttamente per questioni di efficienza, ma può anche essere scomposta in gate standard nel caso di esecuzione su dispositivi reali.

source: We now demonstrate this functionality by setting the simulator to be initialized in the final Bell-state of the previous example:
es_mx: Ahora demostramos esta funcionalidad inicializando el simulador en el estado de Bell final del ejemplo anterior:
id_id: Kami sekarang menunjukkan fungsi ini dengan setting simulator yang diinisialisasi dengan Bell-state dari contoh sebelumnya:
it_it: Andiamo ora a dimostrare questa funzionalità inizializzando il simulatore nello stato di Bell finale dell'esempio precedente:

source: The ``StatevectorSimulator`` executes a single shot of a Qiskit ``QuantumCircuit`` and returns the final quantum statevector of the simulation. The circuit may contain *gates*, and also *measurements*, *resets*, and *conditional* operations.
es_mx: El ``StatevectorSimulator`` ejecuta un solo disparo de un ``QuantumCircuit`` de Qiskit y devuelve el vector de estado cuántico final de la simulación. El circuito puede contener *compuertas*, y también operaciones de *medición*, *resets*, y *condicionales*.
id_id: ` ` StatevectorSimulator ` ` mengeksekusi satu shot dari sebuah ` ` QuantumCircuit ` ` Qiskit dan mengembalikan statevector kuantum akhir dari simulasi. Sirkuit ini mungkin berisi operasi * gates*, dan juga * measurements (pengukuran), * resets*, dan * kondisional *.
it_it: Il backend ``StatevectorSimulator`` esegue una sola volta un ``QuantumCircuit`` Qiskit e restituisce il vettore di stato finale della simulazione. Il circuito può contenere *gate*, e anche *misure*, *reset*, e operazioni *condizionali*.

source: Simulating a quantum circuit with measurement
es_mx: Simulación de un circuito cuántico con medición
id_id: Simulasi sebuah sirkuit kuantum dengan measurement
it_it: Simulare un circuito quantistico contenente misurazioni

source: Note that if a circuit contains *measure* or *reset* the final statevector will be a conditional statevector *after* simulating wave-function collapse to the outcome of a measure or reset. For the Bell-state circuit this means the final statevector will be *either* :math:`|0,0\rangle` *or* :math:`|1, 1\rangle`.
es_mx: Ten en cuenta que si un circuito contiene una *medición* o un *reset* el vector de estado final será uno condicional *después* de simular el colapso de la función de onda al resultado de la medida o el reset. Para el circuito de estado de Bell, esto significa que el vector de estado final será *cualquiera* :math:`|0,0\rangle` *or* :math:`|1, 1\rangle`.
id_id: Perhatikan bahwa jika sebuah sirkuit berisi * measure * atau * reset * statevector akhir akan menjadi statevector kondisional * setelah * mensimulasikan fungsi gelombang yang kolaps ke hasil dari ukuran atau reset. Untuk sirkuit Bell-state ini berarti statevector akhir akan * satu dari * :math:` | 0,0\rangle ` * atau * :math:` | 1, 1\rangle `.
it_it: Da notare che se un circuito contiene una *misurazione* o un *reset*, il vettore di stato finale sarà un vettore di stato condizionato *dopo* che la funzione d'onda simulata avrà collassato nell'esito della misurazione o del reset. Nel caso del circuito per lo stato di Bell, questo significa che il vettore di stato finale sarà :math:`|0,0\rangle` *oppure* :math:`|1, 1\rangle`.

source: Like the ``QasmSimulator``, the ``StatevectorSimulator`` also allows setting a custom initial statevector for the simulation. Here we run the previous initial statevector example on the ``StatevectorSimulator`` and initialize it to the Bell state.
es_mx: Al igual que el ``QasmSimulator``, el ``StatevectorSimulator`` también permite establecer un vector de estado inicial personalizado para la simulación. Aquí ejecutamos el vector de estado inicial del ejemplo anterior en el ``StatevectorSimulator`` y lo inicializamod al estado de Bell.
id_id: Seperti ` ` ` QasmSimulator ` `, ` ` StatevectorSimulator ` ` juga memungkinkan pengaturan kustom awal statevector untuk simulasi. Di sini kita menjalankan contoh tadi di ` ` StatevectorSimulator ` ` dan menginisialisasinya dengan Bell state.
it_it: Come per il ``QasmSimulator``, anche lo ``StatevectorSimulator`` consente di scegliere un vettore di stato iniziale personalizzato per la simulazione. Qui utilizziamo il precedente esempio di vettore di stato iniziale sul backend ``StatevectorSimulator``, inizializzandolo allo stato di Bell.

source: Unitary Simulator
es_mx: Simulador Unitario
id_id: Simulator Unitary
it_it: Simulatore Unitario

source: The ``UnitarySimulator`` constructs the unitary matrix for a Qiskit ``QuantumCircuit`` by applying each gate matrix to an identity matrix. The circuit may only contain *gates*, if it contains *resets* or *measure* operations an exception will be raised.
es_mx: El ``UnitarySimulator`` construye la matriz unitaria para un ``QuantumCircuit`` de Qiskit aplicando cada matriz de compuerta a una matriz identidad. El circuito sólo puede contener *compuertas*, si contiene operaciones de *medición* o *resets* se arrojará una excepción.
id_id: ` ` UnitarySimulator ` ` menbuat matrik unitary dari ` ` QuantumCircuit ` ` Qiskit dengan menerapkan setiap matrik gate ke matriks identitas. Sirkuit ini hanya bisa berisi * gates*, jika berisi operasi * reset * atau * measure * pengecualian akan dikeluarkan.
it_it: Il backend ``UnitarySimulator`` costruisce la matrice unitaria di un Qiskit ``QuantumCircuit`` applicando ognuna delle matrici rappresentanti i gate ad una matrice identità. Il circuito può contenere solo *gate*, se dovesse contenere anche operazioni di *reset* o *misurazioni*, verrà sollevata un'eccezione.

source: Simulating a quantum circuit unitary
es_mx: Simulación de un circuito cuántico unitario
id_id: Mensimulasikan sebuah sirkuit kuantum unitary
it_it: Simulare una matrice unitaria di un circuito quantistico

source: For this example we will return the unitary matrix corresponding to the previous examples circuit which prepares a bell state.
es_mx: Para este ejemplo vamos a devolver la matriz unitaria correspondiente al circuito anterior de ejemplo que prepara un estado de Bell.
id_id: Untuk contoh ini kita akan menghitung matrik unitary yang sesuai dengan sirkuit pada contoh sebelumnya yang menyiapkan sebuah Bell state.
it_it: In questo esempio, andremo ad ottenere come risultato la matrice unitaria corrispondente al circuito che prepara uno stato di Bell utilizzato negli esempi precedenti.

source: Setting a custom initial unitary
es_mx: Configuración de una matriz unitaria inicial
id_id: Mengatur sebuah kustom awal unitary
it_it: Definizione di una matrice unitaria iniziale personalizzata
