Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/simulators/1_aer_provider.po
Languages: bn_bn, es_mx, es_un, fr_fr, id_id, it_it, ja_jp, ko, pt_br, ta, tr, zh_tw

source: To save the unitary matrix for a ``QuantumCircuit`` we can append the circuit with the ``save_unitary`` instruction. Note that this circuit cannot contain any measurements or resets since these instructions are not supported on for the ``"unitary"`` simulation method
bn_bn: ``QuantumCircuit`` এর জন্য ঐকিক (ইউনিটারি) ম্যাট্রিক্স সংরক্ষণ করতে আমরা ``save_unitary`` নির্দেশ দিয়ে সার্কিট যুক্ত করতে পারি। মনে রাখবেন যে এই সার্কিটটিতে কোন পরিমাপ বা রিসেট থাকতে পারে না কারণ এই নির্দেশগুলি ``"unitary"`` সিমুলেশন পদ্ধতিতে সমর্থিত নয়
es_un: Para guardar la matriz unitaria para un ``QuantumCircuit``, podemos concatenar el circuito con la instrucción ``save_unitary``. Ten en cuenta que este circuito no puede contener mediciones ni restablecimientos, ya que estas instrucciones no son compatibles con el método de simulación ``"unitary"``
fr_fr: Pour sauver la matrice unitaire d'un ``QuantumCircuit``, nous pouvons ajouter le circuit à l'instruction ``save_unitary``. Notez que ce circuit ne peut pas contenir de mesures ni de réinitialisations car ces instructions ne sont pas prises en charge pour la méthode de simulation ``"unitary"``
ja_jp: ``QuantumCircuit`` のユニタリー行列を保存するには、回路に ``save_unitary`` 命令を追加します。これらの命令は、``"unitary"`` シミュレーション・メソッドではサポートされていないため、この回路に測定やリセットを含めることはできません。
ko: ``QuantumCircuit`` 에 대한 유니터리 행렬을 저장하고 싶다면 회로에 ``save_unitary`` 명령어를 추가하면 된다. 다만 이 명령어가 추가된 회로에는 어떠한 측정이나 초기화가 포함될 수 없는데, 이 명령어들은 ``"unitary"`` 시뮬레이션 방법에서 지원되지 않기 때문이다.
pt_br: Para salvar a matriz unitária de um ``QuantumCircuit``, podemos acrescentar no circuito a instrução ``save_unitary``. Observe que este circuito não pode conter medições ou resets, já que estas instruções não são suportadas pelo método de simulação ``"unitary"``
ta: ``QuantumCircuit`` க்கான ஒற்றையாட்சி மேட்ரிக்ஸைச் சேமிக்க, `` save_unitary`` அறிவுறுத்தலுடன் சுற்று சேர்க்கலாம். `` "unitary" `` உருவகப்படுத்துதல் முறைக்கு இந்த வழிமுறைகள் வழங்கப்படாததால், இந்த சுற்று எந்த அளவீடுகளையும் மீட்டமைப்புகளையும் கொண்டிருக்க முடியாது என்பதை நினைவில் கொள்க
tr: Bir ``QuantumCircuit`` için üniter matrisi kaydetmek için devreye ``save_unitary`` komutuyla ekleme yapabiliriz. ``"unitary"`` simülasyon yöntemi için desteklenmediğinden, bu devrenin herhangi bir ölçüm veya sıfırlama içeremeyeceğini unutmayın
zh_tw: 如果要儲存 ``QuantumCircuit`` 的么正矩陣，我們可以將電路附加``save_unitary`` 指令。 請注意，此電路不能包含任何測量或重設，因為在 ``"unitary"``模擬方法中，不支援這些指令。

source: Saving multiple states
bn_bn: একাধিক মান বা অবস্থা সংরক্ষণ করা
es_un: Guardar múltiples estados
fr_fr: Enregistrement de plusieurs états
ja_jp: 複数の状態の保存
ko: 여러 상태 저장하기
pt_br: Salvando multiplos estados
ta: பல நிலை களைச் சேமிக்கிறது
tr: Birden çok durumu kaydetme
zh_tw: 儲存多個狀態

source: We can also apply save instructions at multiple locations in a circuit. Note that when doing this we must provide a unique label for each instruction to retrieve them from the results
bn_bn: আমরা একটি সার্কিটে একাধিক স্থানে সংরক্ষণ নির্দেশনাবলী প্রয়োগ করতে পারি। লক্ষ্য করুন যে এটি করার সময় আমাদের অবশ্যই প্রতিটি নির্দেশের জন্য একটি অনন্য নাম (লেবেল) প্রদান করতে হবে যাতে সেগুলি ফলাফল থেকে পুনরুদ্ধার করা যায়
es_un: También podemos aplicar instrucciones de guardado en varias ubicaciones de un circuito. Ten en cuenta que al hacer esto, debemos proporcionar una etiqueta única para cada instrucción para recuperarlas de los resultados
fr_fr: Nous pouvons également appliquer des instructions de sauvegarde à plusieurs endroits dans un circuit. Notez que lorsque vous faites cela, nous devons fournir une étiquette unique pour chaque instruction pour récupérer les résultats
ja_jp: また、回路内の複数の場所にセーブ命令を適用することもできます。 これを行う際には、結果から取得する各命令に固有のラベルを指定する必要があることに注意してください。
ko: 또한, 명령어 저장은 회로의 여러 장소에 적용될 수 있다. 이렇게 여러 장소에 명령어 저장을 적용할 때에는 각 명령어에 고유한 라벨을 추가해야 결과에서 검색할 수 있다.
pt_br: Também, podemos aplicar instruções de salvar em vários locais de um circuito. Note que ao fazer isso, nós precisamos fornecer um rótulo único para cada instrução a fim de recuperá-la nos resultados
ta: ஒரு சுற்றுவட்டத்தில் பல இடங்களில் சேமிக்கும் வழிமுறைகளையும் நாங்கள் பயன்படுத்தலாம். இதைச் செய்யும்போது, ​​ஒவ்வொரு அறிவுறுத்தலுக்கும் ஒரு தனித்துவமான லேபிளை வழங்க வேண்டும்
tr: Bir devrede birden fazla yerde de kaydetme komutlarını uygulayabiliriz. Sonuçlardan bunları almak için her komut için farklı etiketlemeler yapmak gerektiğini unutmayın
zh_tw: 我們也可以將指令儲存及作用於一個電路中的多個位置。 請注意，像這樣在多個地方作用和儲存指令時，我們必須為每個指令提供一個獨特的標籤，以便從之後的結果中檢索它。

source: Setting the simulator to a custom state
bn_bn: একটি বিশেষায়িত (কাস্টম) অবস্থায় সিমুলেটর সেট করা
es_un: Configurar el simulador a un estado personalizado
fr_fr: Définition du simulateur à un état personnalisé
ja_jp: シミュレーターのカスタム状態への設定
ko: 맞춤형 상태로 시뮬레이터 설정하기
pt_br: Configurar o simulador para um estado personalizado
ta: தனிப்பயன் நிலைக்கு சிமுலேட்டரை அமைத்தல்
tr: Simülatörün özel bir duruma ayarlanması
zh_tw: 將此模擬器設定至一個自訂狀態

source: The ``AerSimulator`` allows setting a custom simulator state for several of its simulation methods using custom simulator instructions
bn_bn: ``AerSimulator`` বিশেষায়িত (কাস্টম) সিমুলেটর নির্দেশনাবলী ব্যবহার করে তার সিমুলেশন পদ্ধতিগুলির জন্য একটি বিশেষায়িত (কাস্টম) সিমুলেটর অবস্থা সেট করার অনুমতি দেয়
es_un: El ``AerSimulator`` permite configurar un estado de simulador personalizado para varios de sus métodos de simulación utilizando instrucciones personalizadas del simulador
fr_fr: ``AerSimulator`` permet de définir un état de simulateur personnalisé pour plusieurs de ses méthodes de simulation à l'aide d'instructions de simulation personnalisées
ja_jp: ``AerSimulator`` では、カスタム・シミュレーターの命令を使用して、いくつかのシミュレーション・メソッドのカスタム・シミュレーター状態を設定できます。
ko: ``AerSimulator`` 는 몇몇 시뮬레이션 방법을 활용할 때 맞춤 시뮬레이터 명령어를 사용해 맞춤 시뮬레이터 상태를 설정할 수 있게 도와준다.
pt_br: O ``AerSimulator`` permite definir um estado personalizado do simulador para vários de seus métodos de simulação, usando instruções personalizadas do simulador
ta: தனிப்பயன் சிமுலேட்டர் வழிமுறைகளைப் பயன்படுத்தி அதன் பல உருவகப்படுத்துதல் முறைகளுக்கு தனிப்பயன் சிமுலேட்டர் நிலையை அமைக்க ``AerSimulator`` அனுமதிக்கிறது
tr: ``AerSimulator``, özel simülatör komutları kullanılarak çeşitli simülasyon metotları için özel bir simülatör durumu ayarlanmasını sağlar
zh_tw: ``AerSimulator`` 允許我們使用自訂模擬器指令來設定幾個模擬方法的自訂模擬器狀態。

source: Set the simulator state to the specified statevector
bn_bn: সিমুলেটর স্টেটকে নির্দিষ্ট স্টেটভেক্টরে সেট করুন
es_un: Establece el estado del simulador en el vector de estado especificado
fr_fr: Définit l'état du simulateur au vecteur d'état spécifié
ja_jp: シミュレーターの状態を指定した状態ベクトルに設定
ko: 시뮬레이터 상태를 지정된 상태 벡터로 설정한다
pt_br: Definir o estado do simulador para o vetor de estado especificado
ta: சிமுலேட்டர் நிலையை குறிப்பிட்ட ஸ்டேட்வெக்டருக்கு அமைக்கவும்
tr: Simülatör durumunu belirtilen durum vektörüne ayarlar
zh_tw: 將模擬器狀態設置為指定的狀態向量

source: Set the simulator state to the specified Clifford stabilizer
bn_bn: নির্দিষ্ট ক্লিফোর্ড স্টেবিলাইজারে সিমুলেটর মান বা অবস্থা সেট করুন
es_un: Establece el estado del simulador en el estabilizador Clifford especificado
fr_fr: Définit l'état du simulateur au stabilisateur de Clifford spécifié
ja_jp: シミュレーターの状態を指定したクリフォード・スタビライザー状態に設定
ko: 시뮬레이터 상태를 지정된 Clifford stabilizer로 설정한다
pt_br: Definir o estado do simulador para o estabilizador Clifford especificado
ta: சிமுலேட்டர் நிலையை குறிப்பிட்ட கிளிஃபோர்ட் நிலைப்படுத்திக்கு அமைக்கவும்
tr: Simülatör durumunu belirtilen Clifford sabitleyicisine ayarlar
zh_tw: 將模擬器狀態設置為指定的 Clifford stabilizer。

source: Set the simulator state to the specified density matrix
bn_bn: নির্দিষ্ট ঘনত্বের ম্যাট্রিক্সে সিমুলেটর অবস্থা সেট করুন
es_un: Establece el estado del simulador en la matriz de densidad especificada
fr_fr: Définit l'état du simulateur à la matrice densité spécifiée
ja_jp: シミュレーターの状態を指定した密度行列に設定
ko: 시뮬레이터 상태를 지정된 밀도 행렬로 설정한다
pt_br: Definir o estado do simulador para a matriz de densidade especificada
ta: சிமுலேட்டர் நிலையை குறிப்பிட்ட அடர்த்தி அணிக்கு அமைக்கவும்
tr: Simülatör durumunu belirtilen yoğunluk matrisine ayarlar
zh_tw: 將模擬器狀態設定為指定的密度矩陣

source: Set the simulator state to the specified unitary matrix
bn_bn: নির্দিষ্ট ঐকিক (ইউনিটারি) ম্যাট্রিক্সে সিমুলেটর অবস্থা সেট করুন
es_un: Establece el estado del simulador en la matriz unitaria especificada
fr_fr: Définit l'état du simulateur à la matrice unitaire spécifiée
ja_jp: シミュレーターの状態を指定したユニタリー行列に設定
ko: 시뮬레이터 상태를 지정된 단일 행렬로 설정한다
pt_br: Definir o estado do simulador para a matriz unitária especificada
ta: சிமுலேட்டர் நிலையை குறிப்பிட்ட யூனிட்டரி மேட்ரிக்ஸுக்கு அமைக்கவும்
tr: Simülatör durumunu belirtilen üniter matrise ayarlar
zh_tw: 將模擬器狀態設定為指定的么正矩陣

source: Set the simulator state to the specified superoperator matrix
bn_bn: নির্দিষ্ট সুপার অপারেটর ম্যাট্রিক্সে সিমুলেটর স্টেট সেট করুন
es_un: Establece el estado del simulador en la matriz de superoperador especificada
fr_fr: Définit l'état du simulateur au super-opérateur spécifié
ja_jp: シミュレーターの状態を指定した超演算子行列に設定
ko: 시뮬레이터 상태를 지정된 superoperator 행렬로 설정한다
pt_br: Definir o estado do simulador para a matriz de super-operador especificada
ta: சிமுலேட்டர் நிலையை குறிப்பிட்ட சூப்பர் ஆபரேட்டர் மேட்ரிக்ஸுக்கு அமைக்கவும்
tr: Simülatör durumunu, belirtilen süperoperatör matrisine ayarlayın
zh_tw: 將模擬器狀態設定為指定的超算運算子矩陣

source: **Notes:** \* These instructions must be applied to all qubits in a circuit, otherwise an exception will be raised. \* The input state must also be a valid state (statevector, density matrix, unitary etc) otherwise an exception will be raised. \* These instructions can be applied at any location in a circuit and will override the current state with the specified one. Any classical register values (e.g. from preceding measurements) will be unaffected \* Set state instructions are only supported by the Aer simulator and will result in an error if a circuit containing them is run on a non-simulator backend such as an IBM Quantum device.
es_un: **Notas:** \* Estas instrucciones deben aplicarse a todos los qubits en un circuito, de lo contrario se generará una excepción. \* El estado de entrada también debe ser un estado válido (vector de estado, matriz de densidad, unitario, etc.); de lo contrario, se generará una excepción. \* Estas instrucciones se pueden aplicar en cualquier lugar de un circuito y anularán el estado actual con el especificado. Cualquier valor de registro clásico (por ejemplo, de mediciones anteriores) no se verá afectado \* Las instrucciones de estado establecidas solo son compatibles con el simulador Aer y darán lugar a un error si un circuito que los contiene se ejecuta en un backend que no es un simulador, como un dispositivo Cuántico de IBM.

source: Setting a custom statevector
bn_bn: একটি বিশেষায়িত (কাস্টম) স্টেটভেক্টর সেট করা
es_un: Configurar un vector de estado personalizado
fr_fr: Définition d'un vecteur d'état personnalisé
ja_jp: カスタム状態ベクトルの設定
ko: 맞춤형 상태 벡터 설정하기
pt_br: Configurando um vetor de estados personalizado
ta: தனிப்பயன் நிலைதிசையினை அமைத்தல்
tr: Özel durum vektörü ayarlama
zh_tw: 設定自訂狀態向量

source: The ``set_statevector`` instruction can be used to set a custom ``Statevector`` state. The input statevector must be valid (:math:`|\langle\psi|\psi\rangle|=1`)
bn_bn: ``Set_statevector`` নির্দেশনা একটি বিশেষায়িত (কাস্টম) ``Statevector`` মান বা অবস্থা সেট করতে ব্যবহার করা যেতে পারে। ইনপুট স্টেটভেক্টর অবশ্যই বৈধ হতে হবে (:math:`|\langle\psi|\psi\rangle|=1`)
es_un: La instrucción ``set_statevector`` se puede utilizar para establecer un estado personalizado ``Statevector``. El vector de estado de entrada debe ser válido (:math:`|\langle\psi|\psi\rangle|=1`)
fr_fr: L'instruction ``set_statevector`` peut être utilisée pour définir un état ``Statevector`` personnalisé. L'état d'entrée doit être valide (:math:`|\langle\psi |\psi\rangle| =1`)
ja_jp: ``set_statevector`` 命令はカスタムの ``Statevector`` 状態を設定するために使用できます。入力状態ベクトルは有効でなければなりません (:math:`|\langle\psi|\psi\rangle|=1`)。
ko: ``set_statevector`` 명령어는 맞춤 ``Statevector`` 상태를 설정하기 위해 사용된다. 입력 상태 벡터는 꼭 유효해야 한다 (:math:`|\langle\psi|\psi\rangle|=1`).
pt_br: A instrução ``set_statevector`` pode ser usada para configurar um estado personalizado ``Statevector``. Porém, o vetor de estado de entrada deve ser válido (:math:`|\langle\psi|\psi\rangle|=1`)
ta: தனிப்பயன் ``Statevector`` நிலையை அமைக்க `` set_statevector`` அறிவுறுத்தலைப் பயன்படுத்தலாம். உள்ளீட்டு நிலைவெக்டர் செல்லுபடியாகும் (:math: `|\langle\psi|\psi\rangle|=1`)
tr: ``set_statevector`` komutu, özel bir ``Statevector`` durumu ayarlamak için kullanılabilir. Girdi durum vektörü geçerli olmalıdır (:math:`|\langle\psi|\psi\rangle|=1`)
zh_tw: ``set_statevector`` 指令可用來設定自訂義 ``Statevector`` 狀態。 輸入狀態向量必須是有效的(:math:`|\langle\psi|\psi\rangle|=1`)

source: Using the initialize instruction
bn_bn: প্রাথমিক নির্দেশনাবলী ব্যবহার করা
es_un: Utilizar la instrucción de inicialización
fr_fr: Utilisation de l'instruction initialize
ja_jp: 初期化命令の使用
ko: 초기화 명령어 사용하기
pt_br: Usar a instrução de inicialização
ta: துவக்க வழிமுறைகளைப் பயன்படுத்துதல்
tr: Başlatma talimatını kullanma
zh_tw: 使用 initialize 指令

source: It is also possible to initialize the simulator to a custom statevector using the ``initialize`` instruction. Unlike the ``set_statevector`` instruction this instruction is also supported on real device backends by unrolling to reset and standard gate instructions.
bn_bn: ``initialize`` নির্দেশনা ব্যবহার করে একটি বিশেষায়িত (কাস্টম) স্টেটভেক্টরে সিমুলেটর আরম্ভ করাও সম্ভব। ``Set_statevector`` নির্দেশের বিপরীতে এই নির্দেশনাটি রিসেট এবং স্ট্যান্ডার্ড গেট নির্দেশনাবলীর আনরোলিং করে বাস্তব ডিভাইসের ব্যাকএন্ডেও সমর্থিত।
es_un: También es posible inicializar el simulador a un vector de estado personalizado usando la instrucción ``initialize``. A diferencia de la instrucción ``set_statevector``, esta instrucción también es compatible con backends de dispositivos reales al descomponerse en instrucciones de compuertas estándar y de reestablecimiento.
fr_fr: Il est également possible d'initialiser le simulateur vers un vecteur d'état personnalisé à l'aide de l'instruction ``initialize``. Contrairement à l'instruction ``set_statevector``, cette instruction est également prise en charge sur les backends réels, ceci est fait en décrivant l'instruction par des portes standards.
ja_jp: ``initialize`` 命令を使用して、シミュレーターをカスタム状態ベクトルに初期化することもできます。 ``set_statevector`` 命令とは異なり、この命令はリセットと標準ゲート命令のアンロールにより、実デバイス・バックエンドでもサポートされます。
ko: ``initialize`` 명령어를 활용하여 시뮬레이터를 맞춤 상태 벡터로 초기화할 수도 있다. ``set_statevector`` 명령어와는 다르게 이 명령어는 초기화와 기본 게이트 명령어들에 전개되어 적용되기 때문에 실제 장치 백엔드에서도 지원된다.
pt_br: Também, é possível inicializar o simulador em um vetor de estado personalizado, usando a instrução ``initialize``; ao contrário da instrução ``set_statevector``, que também é suportada por backends em dispositivos reais, porém é composta por instruções de reset e de portas padrão.
ta: ``initialize`` வழிமுறையைப் பயன்படுத்தி தனிப்பயன் நிலைமாற்றிக்கு சிமுலேட்டரைத் தொடங்கவும் முடியும். ``Set_statevector`` அறிவுறுத்தலைப் போலன்றி, மீட்டமைக்க மற்றும் நிலையான கேட் வழிமுறைகளை நீக்குவதன் மூலம் உண்மையான சாதன பின்தளத்தில் இந்த அறிவுறுத்தலும் துணைபுரிகிறது.
tr: ``initialize`` komutunu kullanarak simülatörü özel bir durum vektörüne başlatmak da mümkündür. ``set_statevector`` talimatından farklı olarak, bu talimat, sıfırlama ve standart kapı talimatlarının açılmasıyla gerçek cihaz arka uçlarında da desteklenir.
zh_tw: 您也可以使用 ` `initialize`` 指令，將模擬器起始設定為自訂狀態向量， 與“set_statevector”指令不同的是，此指令被擴展並應用於初始化和基本門命令，因此在實際設備後台中也支持它。

source: Setting a custom density matrix
bn_bn: একটি বিশেষায়িত (কাস্টম) ঘনত্ব ম্যাট্রিক্স সেট করা
es_un: Configurar una matriz de densidad personalizada
fr_fr: Définition d'une matrice de densité personnalisée
ja_jp: カスタム密度行列の設定
ko: 맞춤형 밀도 행렬 설정하기
pt_br: Definindo uma matriz de densidade personalizada
ta: தனிப்பயன் அடர்த்தி மேட்ரிக்ஸை அமைத்தல்
tr: Özel bir yoğunluk matrisi ayarlama
zh_tw: 設置自訂密度矩陣

source: The ``set_density_matrix`` instruction can be used to set a custom ``DensityMatrix`` state. The input density matrix must be valid (:math:`Tr[\rho]=1, \rho \ge 0`)
bn_bn: ``Set_density_matrix`` নির্দেশনা একটি বিশেষায়িত (কাস্টম) ``DensityMatrix`` অবস্থা সেট করতে ব্যবহার করা যেতে পারে। ইনপুট ঘনত্ব ম্যাট্রিক্স অবশ্যই বৈধ হতে হবে (:math:`Tr[\rho]=1, \rho \ge 0`)
es_un: La instrucción ``set_density_matrix`` se puede utilizar para establecer un estado personalizado ``DensityMatrix``. La matriz de densidad de entrada debe ser válida (:math:`Tr[\rho]=1, \rho \ge 0`)
fr_fr: L'instruction ``set_density_matrix`` peut être utilisée pour définir un état ``DensityMatrix``personnalisé. La matrice de densité d'entrée doit être valide (:math:` Tr [\rho ] = 1, \rho \ge 0`)
ja_jp: ``set_density_matrix`` 命令を使用して、カスタム ``DensityMatrix`` 状態を設定できます。 入力密度行列は有効でなければなりません (:math:`Tr[\rho]=1, \rho \ge 0`)
ko: ``set_density_matrix`` 명령어는 맞춤 ``DensityMatrix`` 상태를 설정하기 위해 사용된다. 입력 밀도 행렬은 꼭 유효해야 한다 (:math:`Tr[\rho]=1, \rho \ge 0`).
pt_br: A instrução ``set_density_matrix`` pode ser usada para definir um estado personalizado de ``DensityMatrix``. A matriz de densidade de entrada deve ser válida (:math:`Tr[\rho]=1, \rho \ge 0`)
ta: தனிப்பயன் ``DensityMatrix`` நிலையை அமைக்க ``set_density_matrix`` அறிவுறுத்தலைப் பயன்படுத்தலாம். உள்ளீட்டு அடர்த்தி அணி செல்லுபடியாகும் (:math: `Tr [\rho]=1, \rho \ge 0`)
tr: ``set_density_matrix`` komutu, özel bir ``DensityMatrix`` durumu ayarlamak için kullanılabilir. Girdi yoğunluk matrisi geçerli olmalıdır (:math:`Tr[\rho]=1, \rho \ge 0`)
zh_tw: ``set_density_matrix`` 指令可用來設置一個自訂的 ``DenityMatrix`` 狀態。 其輸入密度矩陣必須是有效的(:math:`Tr[\rho]=1, \rho \ge 0`)

source: Setting a custom stabilizer state
bn_bn: একটি বিশেষায়িত (কাস্টম) স্টেবিলাইজার অবস্থা সেট করা
es_un: Configurar un estado de estabilizador personalizado
fr_fr: Définir un état de stabilisateur personnalisé
ja_jp: カスタム・スタビライザーの状態の設定
ko: 맞춤형 stabilizer 상태 설정하기
pt_br: Configurando um estado estabilizador personalizado
ta: தனிப்பயன் நிலைப்படுத்தி நிலையை அமைத்தல்
tr: Özel bir sabitleyici durumu ayarlama
zh_tw: 設置一個自訂的穩定器狀態

source: The ``set_stabilizer`` instruction can be used to set a custom ``Clifford`` stabilizer state. The input stabilizer must be a valid ``Clifford``.
bn_bn: ``Set_stabilizer`` নির্দেশনা একটি বিশেষায়িত (কাস্টম) ``Clifford`` স্টেবিলাইজার অবস্থা সেট করতে ব্যবহার করা যেতে পারে। ইনপুট স্টেবিলাইজার অবশ্যই একটি বৈধ ``Clifford`` হতে হবে।
es_un: La instrucción ``set_stabilizer`` se puede utilizar para establecer un estado de estabilizador ``Clifford`` personalizado. El estabilizador de entrada debe ser un ``Clifford`` válido.
fr_fr: L'instruction ``set_stabilizer`` peut être utilisée pour définir un état de stabilisateur personnalisé ``Clifford``. Le stabilisateur d'entrée doit être un ``Clifford`` valide.
ja_jp: ``set_stabilizer`` 命令を使用してカスタムの ``Clifford`` スタビライザ状態を設定できます。入力スタビライザは有効な ``Clifford`` でなければなりません。
ko: ``set_stabilizer`` 명령어는 맞춤 ``Clifford`` stabilizer 상태를 설정하기 위해 사용된다. 입력 stabilizer는 꼭 유효한 ``Clifford`` 여야 한다.
pt_br: A instrução ``set_stabilizer`` pode ser usada para definir um estado de estabilizador ``Clifford`` personalizado. O estabilizador de entrada deve ser um ``Clifford`` válido.
ta: தனிப்பயன் ``Clifford`` நிலைப்படுத்தி நிலையை அமைக்க ``set_stabilizer`` அறிவுறுத்தலைப் பயன்படுத்தலாம். உள்ளீட்டு நிலைப்படுத்தி செல்லுபடியாகும் ``Clifford`` ஆக இருக்க வேண்டும்.
tr: ``set_stabilizer`` komutu, özel bir ``Clifford`` sabitleyici durumu ayarlanması için kullanılabilir. Girdi sabitleyicisi geçerli bir ``Clifford`` olmalıdır.
zh_tw: ``set_stabilizer`` 指令可用來設置自訂的 ``Clifford`` 穩定器狀態。 而輸入的穩定器必須是一個有效的“Clifford”。

source: Setting a custom unitary
bn_bn: একটা বিশেষায়িত (কাস্টম) ঐকিক (ইউনিটারি) সেট করা
es_un: Configurar un unitario personalizado
fr_fr: Définition d'un unitaire initial personnalisé
ja_jp: カスタムユニタリーの設定
ko: 맞춤형 유니터리 설정하기
pt_br: Definindo uma unidade personalizada
ta: தனிப்பயன் ஒற்றையினை அமைத்தல்
tr: Özel bir üniter ayarlama
zh_tw: 設置一個自訂的么正矩陣

source: The ``set_unitary`` instruction can be used to set a custom unitary ``Operator`` state. The input unitary matrix must be valid (:math:`U^\dagger U=\mathbb{1}`)
bn_bn: ``Set_unitary`` নির্দেশনা একটি বিশেষায়িত (কাস্টম) ঐকিক (ইউনিটারি) ``Operator`` অবস্থা সেট করতে ব্যবহার করা যেতে পারে। ইনপুট ঐকিক (ইউনিটারি) ম্যাট্রিক্স ম্যাট্রিক্স অবশ্যই বৈধ হতে হবে (:math:`U^\dagger U=\mathbb{1}`)
es_un: La instrucción ``set_unitary`` se puede utilizar para establecer un estado unitario personalizado ``Operator``. La matriz unitaria de entrada debe ser válida (:math:`U^\dagger U=\mathbb{1}`)
fr_fr: L'instruction ``set_unitary`` peut être utilisée pour définir un état unitaire ``Operator`` personnalisé. La matrice unitaire d'entrée doit être valide (:math:` U ^ \dagger U = \mathbb{1}`)
ja_jp: ``set_unitary`` 命令を使用して、カスタムの ``Operator`` 状態を設定できます。 入力ユニタリー行列は有効でなければなりません (:math:`U^\dagger U=\mathbb{1}`)
ko: ``set_unitary`` 명령어는 맞춤 유니터리 ``Operator`` 상태를 설정하기 위해 사용된다. 입력 유니터리 행렬은 꼭 유효해야 한다 (:math:`U^\dagger U=\mathbb{1}`).
pt_br: A instrução ``set_unitary`` pode ser usada para definir um estado ``Operator`` unitário personalizado. A matriz unitária de entrada deve ser válida (:math:`U^\dagger U=\mathbb{1}`)
ta: தனிப்பயன் ஒற்றையாட்சி ``Operator`` நிலையை அமைக்க ``set_unitary`` அறிவுறுத்தலைப் பயன்படுத்தலாம். உள்ளீட்டு ஒற்றுமை அணி செல்லுபடியாகும் (:math: `U ^ ag டாகர் U =\mathbb {1}`)
tr: ``set_unitary`` komutu, özel bir üniter ``Operator`` durum ayarlanması için kullanılabilir. Girdi üniter matrisi geçerli olmalıdır (:math:`U^\dagger U=\mathbb{1}`)
zh_tw: ``set_unitary`` 指令可用來設定一個自訂么正 ``Operator`` 的狀態。 而輸入的么正矩陣必須是有效的 (:math:`U^\dagger U=\mathbb{1}`)。
