Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/simulators/2_device_noise_simulation.po
Languages: bn_bn, es_un, fr, id_id, it_it, ja, ko_kr, pt_br, pt_un, ta, tr, zh_tw

source: This page was generated from `tutorials/simulators/2_device_noise_simulation.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/simulators/2_device_noise_simulation.ipynb`__ থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/simulators/2_device_noise_simulation.ipynb`__.
fr: Cette page a été générée à partir de `tutorials/simulators/2_device_noise_simulation.ipynb`__.
id_id: Halaman ini dibuat dari ` tutorials/algoritms/01_grover.ipynb ` __.
it_it: Questa pagina è stata generata da `tutorials/simulators/2_device_noise_simulation.ipynb`__.
ja: このページは `tutorials/simulators/2_device_noise_simulation.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/simulators/2_device_noise_simulation.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada, a partir do 'tutorials/simulators/2_device_noise_simulation.ipynb'__.
pt_un: Esta página foi gerada, a partir do `tutorials/simulators/2_device_noise_simulation.ipynb`__.
ta: இந்த பக்கம் `tutorials/simulators/2_device_noise_simulation.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
tr: Bu sayfa `tutorials/simulators/2_device_noise_simulation.ipynb`__ adresinden oluşturulmuştur.
zh_tw: 此教程是從 `tutorials/simulators/2_device_noise_simulation.ipynb`__ 產生的。

source: Device backend noise model simulations
bn_bn: যন্ত্রের ব্যাকেণ্ডের নয়েজ মডেল সিমুলেশন
es_un: Simulaciones en un backend con modelo de ruido
fr: Simulations du modèle de bruit du backend réel
id_id: Simulasi model derau perangkat backend
it_it: Backend di simulazione di un modello di rumore di un dispositivo
ja: デバイスバックエンドを用いたノイズモデルのシミュレーション
ko_kr: 장치 백엔드 잡음 모델 시뮬레이션
pt_br: Simulações do modelo de ruído de serviço do dispositivo
pt_un: Simulações do modelo de ruído de serviço do dispositivo
ta: சாதன பின்தளத்தில் இரைச்சல் மாதிரி உருவகப்படுத்துதல்கள்
tr: Cihaz arkayüzey gürültü modeli simülasyonları
zh_tw: 後端設備噪音模型模擬

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
id_id: Pengantar
it_it: Introduzione
ja: はじめに
ko_kr: 소개
pt_br: Introdução
pt_un: Introdução
ta: முன்னுரை
tr: Giriş
zh_tw: 簡介

source: This notebook shows how to use the Qiskit Aer ``noise`` module to automatically generate a basic noise model for an IBMQ hardware device, and use this model to do noisy simulations of ``QuantumCircuits`` to study the effects of errors which occur on real devices.
bn_bn: এই নোটবুকে দেখানো হয়েছে কিভাবে Qiskit এয়ার এর ``noise`` মডিউল ব্যবহার করে স্বয়ংক্রিয়ভাবে IBMQ hardware যন্ত্রের জন্য একটা সাধারণ নয়েজ নকশা বানানো যায়। বাস্তব যন্ত্রের ভুলের প্রভাব বোঝার জন্য এই নকশা ব্যবহার করে ``QuantumCircuits`` -এর ত্রুটিপূর্ণ সিমুলেশন করা হয়।
es_un: Este cuaderno muestra cómo usar el módulo ``noise`` de Qiskit Aer para generar automáticamente un modelo de ruido básico de un dispositivo de hardware de IBMQ, y utilizar este modelo para realizar simulaciones ruidosas de ``QuantumCircuits`` para estudiar los efectos de errores que ocurren en dispositivos reales.
fr: Ce bloc-notes montre comment utiliser le module Qiskit Aer ``noise`` pour générer automatiquement un modèle de bruit basique pour une unité matérielle IBMQ, et utiliser ce modèle pour effectuer des simulations bruitées sur des ``QuantumCircuits`` pour étudier les effets des erreurs qui se produisent sur des appareils réels.
id_id: Notebook ini menunjukkan cara menggunakan modul Qiskit Aer ` ` noise ` ` ` untuk otomatis menghasilkan model noise dasar untuk perangkat keras IBMQ, dan cara menggunakan model ini untuk melakukan simulasi noise dari ` ` QuantumCircuits ` ` untuk mempelajari efek dari error di perangkat nyata.
it_it: Questo notebook mostra come utilizzare il modulo ``noise`` di Qiskit Aer per generare automaticamente un modello di rumore di base per un dispositivo hardware IBMQ, e come utilizzare questo modello per effettuarer simulazioni rumorose di ``QuantumCircuits`` per studiare gli effetti degli errori che si verificano sui dispositivi reali.
ja: このノートブックは、Qiskit Aer ``noise`` モジュールを使用して、IBMQハードウェアデバイスの基本的なノイズモデルを自動的に生成する方法を示します。 このモデルを使用して、実際のデバイスで発生するエラーの影響を調べるために、``QuantumCircuits`` のノイズのあるシミュレーションを行います。
ko_kr: 이 노트북은 Qiskit Aer ``noise`` 모듈을 사용하여 IBMQ 하드웨어 장치에 대한 기본 잡음 모델을 자동으로 생성하는 방법을 설명하고, 이 모델을 사용하여 실제 장치에서 발생하는 오류의 효과를 연구하기 위해 ``QuantumCircuits`` 의 소음 시뮬레이션을 수행한다.
pt_br: Este notebook mostra como utilizar o módulo ``noise`` do Qiskit Aer para gerar, automaticamente, um modelo de ruído básico para um dispositivo de hardware IBMQ, e como utilizar este modelo para fazer simulações ruidosas de ``QuantumCircuits`` para estudar os efeitos de erros, que ocorrem em dispositivos reais.
pt_un: Este notebook mostra como utilizar o módulo ``noise`` do Qiskit Aer para gerar, automaticamente, um modelo de ruído básico para um dispositivo de hardware IBMQ, e como utilizar este modelo para fazer simulações ruidosas de ``QuantumCircuits`` para estudar os efeitos de erros, que ocorrem em dispositivos reais.
ta: IBMQ வன்பொருள் சாதனத்திற்கான அடிப்படை இரைச்சல் மாதிரியை தானாக உருவாக்க Qiskit ஏர் ``noise`` தொகுதியை எவ்வாறு பயன்படுத்துவது என்பதை இந்த நோட்புக் காட்டுகிறது, மேலும் ஏற்படும் பிழைகளின் விளைவுகளை ஆய்வு செய்ய ``QuantumCircuits`` இன் சத்தமான உருவகப்படுத்துதல்களைச் செய்ய இந்த மாதிரியை உண்மையான சாதனங்களில் பயன்படுத்தவும்.
tr: Bu defter, bir IBMQ donanım aygıtı için otomatik olarak temel bir gürültü modeli oluşturmak için Qiskit Aer ``noise`` modülünün nasıl kullanılacağını ve bu modeli, gerçek cihazlarda oluşan hataların etkilerini incelemek için ``QuantumCircuits`` 'in gürültülü simülasyonlarını yapmak için nasıl kullanacağınızı gösterir.
zh_tw: 此筆記本說明如何使用 Qiskit Aer``noise`` 模組自動生成 IBMQ 硬體裝置的基本噪聲模型，並使用此模型對 ``QuantumCircuits``進行噪音模擬，以研究在真實裝置上發生的錯誤的影響。

source: Note, that these automatic models are only an *approximation* of the real errors that occur on actual devices, due to the fact that they must be build from a limited set of input parameters related to *average error rates* on gates. The study of quantum errors on real devices is an active area of research and we discuss the Qiskit Aer tools for configuring more detailed noise models in another notebook.
bn_bn: মনে রাখবে, এই স্বয়ংক্রিয় নকশাগুলো বাস্তব যন্ত্রে হওয়া আসল ভুলের আসন্ন মান মাত্র। কারণ এগুলোকে ইনপুট প্যারামিটারের একটা সীমিত সেট থেকে বানানো, যা যুক্তিবর্তনীর (গেইট) *গড় ত্রুটিহার* -এর সাথে সম্পর্কিত। বাস্তব যন্ত্রের উপর কোয়ান্টাম ত্রুটি সম্পর্কিত আলোচনা এখনো একটা ভালো গবেষণার কাজ। Qiskit এয়ার -এর নয়েজ মডেল সম্পর্কিত অন্যান্য যন্ত্র আমরা পরে বিশদে আলোচনা করবো।
es_un: Ten en cuenta que estos modelos automáticos son sólo una *aproximación* de los errores reales que ocurren en los dispositivos reales, debido al hecho de que deben ser construidos a partir de un conjunto limitado de parámetros de entrada relacionados con *tasas de error promedio* en las compuertas. El estudio de errores cuánticos en dispositivos reales es un área activa de investigación y discutiremos sobre las herramientas de Qiskit Aer para configurar modelos de ruido más detallados en otro cuaderno.
fr: Notez que ces modèles automatiques ne sont qu'une *approximation* des erreurs réelles qui se produisent sur les périphériques réels, en raison du fait qu'ils doivent être construits à partir d'un ensemble limité de paramètres d'entrée liés aux *taux d'erreur moyens* sur les portes quantiques. L'étude des erreurs quantiques sur les appareils réels est un domaine de recherche actif et nous discutons des outils Qiskit Aer pour configurer des modèles de bruit plus détaillés dans un autre bloc-notes.
id_id: Perhatikan, bahwa model otomatis ini hanya sebuah * perkiraan * dari error nyata di perangkat aktual, karena model itu harus dibangun dari set input parameter terbatas yang terkait dengan * error rate rata-rata* di gate. Studi tentang error kuantum pada perangkat real adalah area penelitian aktif dan kita akan membahas Qiskit Aer untuk mengkonfigurasi lebih rinci noise model di notebook lain.
it_it: Da notare che questi modelli automatici sono solo una *approssimazione* degli errori reali che si verificano sui dispositivi reali, questo perchè devono essere costruiti utilizzando un set di parametri limitati legati a *rate di errori medi* dei gate. Lo studio degli errori quantistici su dispositivi reali è un'attiva area di ricerca, e discuteremo in un altro notebook gli strumenti di Qiskit Aer che permettono di configurare modelli di rumore più specifici.
ja: これらの自動モデルは、実際のデバイスで発生する実際の誤差の *近似* に過ぎないことに注意してください。 これは、ゲート上の *平均誤差率* に関連する限られた入力パラメータのセットからビルドされなければならないという事実によるものです。 実機上の量子エラーの研究は活発な研究分野であり、他のノートブックでより詳細なノイズモデルを設定するための Qiskit Aer ツールについて議論します。
ko_kr: 이러한 자동 모델은 실제 디바이스에서 발생하는 실제 오류의 *근사치* 입니다. 이는 게이트에 *평균 오류 비율* 와 관련된 제한된 입력 매개변수 세트에서 빌드해야 하므로 실제 디바이스에서 발생하는 실제 오류의 근사치이다. 실제 장치에서의 양자 오류에 대한 연구는 활발한 연구 영역이며, 다른 노트북에서 보다 자세한 소음 모델을 구성하는 Qiskit Aer 도구에 대해 설명한다.
pt_br: Observe que estes modelos automáticos são, apenas, uma *aproximação* dos erros reais, que ocorrem em dispositivos reais, devido ao fato de que eles devem ser construídos, a partir de um conjunto limitado de parâmetros de entrada relacionados a *taxas de erro médias* nas portas. O estudo de erros quânticos em dispositivos reais é uma área ativa de pesquisa e discutimos as ferramentas do Qiskit Aer para a configuração de modelos de ruído mais detalhados em outro notebook.
pt_un: Observe que estes modelos automáticos são, apenas, uma *aproximação* dos erros reais, que ocorrem em dispositivos reais, devido ao fato de que eles devem ser construídos, a partir de um conjunto limitado de parâmetros de entrada relacionados a *taxas de erro médias* nas portas. O estudo de erros quânticos em dispositivos reais é uma área ativa de pesquisa e discutimos as ferramentas do Qiskit Aer para a configuração de modelos de ruído mais detalhados em outro notebook.
ta: குறிப்பு, இந்த தானியங்கி மாதிரிகள் உண்மையான சாதனங்களில் நிகழும் உண்மையான பிழைகளின் * approximation *, அவை வாயில்களில் *average error rates * தொடர்பான வரையறுக்கப்பட்ட உள்ளீட்டு அளவுருக்களிலிருந்து உருவாக்கப்பட வேண்டும் என்பதன் காரணமாக. உண்மையான சாதனங்களில் குவாண்டம் பிழைகள் பற்றிய ஆய்வு ஆராய்ச்சியின் செயலில் உள்ள பகுதியாகும், மேலும் விரிவான இரைச்சல் மாதிரிகளை மற்றொரு நோட்புக்கில் உள்ளமைப்பதற்கான Qiskit ஏர் கருவிகளைப் பற்றி விவாதிக்கிறோம்.
tr: Bu otomatik modellerin, kapılardaki *ortalama hata oranları* ile ilgili sınırlı bir girdi parametresi kümesinden oluşturulmaları gerektiğinden, gerçek cihazlarda meydana gelen gerçek hataların yalnızca bir *yaklaştırımı* olduğunu unutmayın. Gerçek cihazlarda kuantum hatalarının incelenmesi aktif bir araştırma alanıdır ve başka bir not defterinde daha ayrıntılı gürültü modellerini yapılandırmak için Qiskit Aer araçlarını tartışıyoruz.
zh_tw: 請注意，這些自動模型僅是在實際裝置上發生的實際錯誤的 *近似值 * ，因為它們必須從與閘上 *平均錯誤率相關的有限輸入參數建置。 關於真實裝置上的量子錯誤的研究是一個活躍的研究領域，我們討論了 Qiskit Aer 工具，用於在另一個筆記本中配置更詳細的雜訊模型。

source: Device Backend Noise Model
bn_bn: যন্ত্রের ব্যাকএন্ডের নয়েজ মডেল
es_un: Modelo de Ruido del Backend de Dispositivo
fr: Modèle de bruit du backend
id_id: Model Noise Perangkat Backend
it_it: Backend modello di rumore di un dispositivo
ja: デバイスバックエンドノイズモデル
ko_kr: 디바이스 백엔드 소음 모델
pt_br: Modelo de Ruído de serviço do Dispositivo
pt_un: Modelo de Ruído de serviço do Dispositivo
ta: சாதன பின்தளத்தில் சத்தம் மாதிரி
tr: Cihaz Arkayüzey Gürültü Modeli
zh_tw: 裝置後端雜訊模型

source: The *Qiskit Aer* device noise model automatically generates a simplified noise model for a real device. This model is generated using the calibration information reported in the ``BackendProperties`` of a device and takes into account
bn_bn: *Qiskit এয়ার* -এর ত্রুটি নকশা স্বয়ংক্রিয়ভাবে বাস্তব যন্ত্রের জন্য একটা সহজ ত্রুটি নকশা বানিয়ে দেয়। যন্ত্রের ``BackendProperties`` -এ পাওয়া ক্রমাঙ্কন (ক্যালিব্রেশন) তথ্যের উপর নির্ভর করে এই নকশা বানানো হয়।
es_un: El modelo de ruido de dispositivo de *Qiskit Aer* automáticamente genera un modelo de ruido simplificado para un dispositivo real. Este modelo es generado usando la información de calibración reportada en las ``BackendProperties`` de un dispositivo y toma en cuenta
fr: Le modèle de bruit de périphérique *Qiskit Aer * génère automatiquement un modèle de bruit simplifié pour un périphérique réel. Ce modèle est généré à l'aide des informations de calibrage rapportées dans ``BackendProperties`` d'un système donné et prend en compte
id_id: Model noise *Qiskit Aer * secara otomatis menghasilkan model noise sederhana untuk perangkat nyata. Model ini dihasilkan dengan menggunakan informasi kalibrasi yang dilaporkan di ` ` BackendProperties ` ` dari suatu perangkat dan memperhitungkan
it_it: Il modello di rumore di *Qiskit Aer* genera automaticamente un modello di rumore semplificato per un dispositivo reale. Questo modello è generato utilizzando le informazioni di calibrazione riportate nel ``BackendProperties`` di un dispositivo e tiene conto
ja: *Qiskit Aer* デバイスノイズモデルは、実際のデバイスの簡素化されたノイズモデルを自動的に生成します。 このモデルは、デバイスの ``BackendProperties`` で報告されたキャリブレーション情報を使用して生成され、考慮されます。
ko_kr: *Qiskit Aer* 장치 잡음 모델은 실제 장치를 위한 단순화된 노이즈 모델을 자동으로 생성한다. 이 모델은 기기의 ``BackendProperties`` 에 보고된 교정 정보를 사용하여 생성되며 이를 고려한다.
pt_br: O modelo de ruído de dispositivo do *Qiskit Aer* gera, automaticamente, um modelo de ruído simplificado para um dispositivo real. Este modelo é gerado usando as informações de calibração relatadas no``BackendProperties`` de um dispositivo e leva em conta
pt_un: O modelo de ruído de dispositivo do *Qiskit Aer* gera, automaticamente, um modelo de ruído simplificado para um dispositivo real. Este modelo é gerado usando as informações de calibração relatadas no ``BackendProperties`` de um dispositivo e leva em conta
ta: *Qiskit Aer* சாதன சத்தம் மாதிரி தானாகவே ஒரு உண்மையான சாதனத்திற்கான எளிமைப்படுத்தப்பட்ட சத்தம் மாதிரியை உருவாக்குகிறது. இந்த மாதிரி ஒரு சாதனத்தின் ``BackendProperties`` இல் புகாரளிக்கப்பட்ட அளவுத்திருத்த தகவல்களைப் பயன்படுத்தி உருவாக்கப்படுகிறது மற்றும் கணக்கில் எடுத்துக்கொள்ளப்படுகிறது
tr: *Qiskit Aer* cihaz gürültü modeli, gerçek bir cihaz için otomatik olarak basitleştirilmiş bir gürültü modeli oluşturur. Bu model, bir cihazın ``BackendProperties`` bölümünde bildirilen kalibrasyon bilgileri kullanılarak oluşturulur ve şunu hesaba katar
zh_tw: *Qiskit Aer* 元件雜訊模型會自動為真實元件生成簡化的雜訊模型。 此模型是使用在元件的 ``BackendProperties`` 中報告的校正資訊所產生的，且此模型考慮到

source: The *gate\_error* probability of each basis gate on each qubit.
pt_br: A probabilidade de * gate\_error * (erro da porta) de cada porta base em cada qubit.

source: The *gate\_length* of each basis gate on each qubit.
pt_br: O * gate\_length * (comprimento da porta) de cada porta base em cada qubit.

source: The :math:`T_1`, :math:`T_2` relaxation time constants of each qubit.
bn_bn: :math:`T_1`, :math:`T_2` হলো প্রত্যেক কিউবিটের শিথিলকরণ (রিলাক্সেশন) সময় ধ্রুবক।
es_un: Las constantes de tiempo de relajación :math:`T_1`, :math:`T_2` de cada qubit.
fr: Les constantes de temps de relaxation :math:` T_1 `, :math:` T_2 ` de chaque qubit.
id_id: Konstanta relaksasi waktu :math:` T_1 `, :math:` T_2 ` dari setiap qubit.
it_it: Le :math:`T_1`, :math:`T_2` costanti di rilassamento temporale per ogni qubit.
ja: 各量子ビットの :math:`T_1` 、 :math:`T_2` リラクゼーション時間定数。
ko_kr: 각 큐비트의 :math:`T_1`, :math:`T_2` 완화 시간 상수이다.
pt_br: As constantes de tempo de relaxamento :math:` T_1 `, :math:` T_2 ` de cada qubit.
pt_un: As constantes de tempo de relaxamento :math:`T_1`, :math:`T_2` de cada qubit.
ta: தி :math:`T_1`, :math:`T_2` ஒவ்வொரு குவிட்டின் தளர்வு நேர மாறிலிகள்.
tr: :math:`T_1`, :math:`T_2` her kübit için gevşeme süresi sabitleridir.
zh_tw: 各量子位元的 :math:`T_1`，:math:`T_2` 弛緩時間常數。

source: The readout error probabilies of each qubit.
pt_br: As probabilidades de erro de leitura de cada qubit.

source: Terra Mock Backends
bn_bn: টেরার ছদ্ম ব্যাকএন্ড
id_id: Backend Sederhana Terra
pt_br: Serviços Terra simulados
zh_tw: Terra 模擬後台

source: We will use real noise data for an IBM Quantum device using the date stored in Qiskit Terra
pt_br: Usaremos dados de ruído real para um dispositivo IBM Quantum, usando os dados armazenados no Qiskit Terra

source: We will use the ``ibmq_vigo`` device for this tutorial. We will also want to get the ``coupling_map`` for the device from its ``configuration`` to use when compiling circuits for simulation to most closely mimic the gates that will be executed on a real device.
pt_br: Utilizaremos o dispositivo ``ibmq_vigo`` para este tutorial. Também vamos querer obter o ``coupling_map`` para o dispositivo, a partir de sua ``configuration`` para utilizar ao compilar circuitos, para simulação, para mais, fielmente, mimetizar as portas, que serão executadas em um dispositivo real.

source: Test circuit for device and simulation comparison
bn_bn: যন্ত্র ও সিমুলেশনের তুলনার জন্য বর্তনী (সার্কিট) পরীক্ষা
es_un: Circuito de prueba para comparación entre dispositivo y simulación
fr: Circuit de test pour la comparaison des appareils et des simulations
id_id: Uji sirkuit untuk perbandingan perangkat dan simulasi
it_it: Circuito di prova per il confronto tra dispositivo reale e simulazione
ja: デバイスとシミュレーション比較のためのテスト回路
ko_kr: 디바이스 및 시뮬레이션 비교를 위한 테스트 회로
pt_br: Circuito de teste para comparação de dispositivo e simulação
pt_un: Circuito de teste para comparação de dispositivo e simulação
ta: சாதனம் மற்றும் உருவகப்படுத்துதல் ஒப்பீட்டுக்கான சோதனை சுற்று
tr: Cihaz ve simülasyon karşılaştırması için test devresi
zh_tw: 用於元件和模擬比較的測試電路

source: Now we construct a test circuit to compare the output of the real device with the noisy output simulated on the Qiskit Aer ``QasmSimulator``. We will prepare a 3-qubit GHZ state :math:`\frac{1}{2}(|0,0,0\rangle + |1,1,1\rangle)` on qubits 0, 1 and 2. Before running with noise or on the device we show the ideal expected output with no noise.
pt_br: Agora, construímos um circuito de teste para comparar a saída do dispositivo real com a saída ruidosa simulada no Qiskit Aer ``QasmSimulator``. Vamos preparar um estado GHZ de 3 qubits :math:`\frac{1}{2}(|0,0,0\rangle + |1,1,1\rangle)` nos qubits 0, 1 e 2. Antes de executar com ruído ou no dispositivo, mostramos a saída ideal esperada sem ruído.

source: Generating a device backend noise model
pt_br: Gerando um modelo de ruído de serviço do dispositivo

source: Noise models in Qiskit Aer are presented using the ``NoiseModel`` object from the ``noise`` module. The ``NoiseModel`` class has a ``from_backend`` method which will return a basic approximate ``NoiseModel`` object configured from a devices ``BackendProperties``.
pt_br: Os modelos de ruído no Qiskit Aer são apresentados utilizando o objeto ``NoiseModel``, do módulo ``noise``. A classe ``NoiseModel`` tem um método ``from_backend`` que retornará um objeto ``NoiseModel`` aproximado básico configurado, a partir das ``BackendProperties`` de um dispositivo.

source: Backend noise model
pt_br: Serviço de modelo de ruído

source: The ``NoiseModel.from_backend`` method constructs an approximate noise model consisting of:
pt_br: O método ``NoiseModel.from_backend`` constrói um modelo de ruído aproximado, que consiste em:

source: **Single-qubit gate errors** consisting of a single qubit depolarizing error followed by a single qubit thermal relaxation error.
bn_bn: **একক কিউবিটসম্পন্ন যুক্তিবর্তনীর (গেইট) ভুল** -তে একটা কিউবিটের ডি-পোলারাইজিং ভুল ও একক কিউবিট তাপীয় শিথিলকরণ (রিলাক্সেশন) ভুল থাকে।
es_un: **Errores de compuertas de un qubit** que consisten de un error despolarizante de un solo qubit seguido por un error de relajación térmica de un qubit.
fr: ** Erreurs de porte sur un qubit** consistant en une erreur de dépolarisation d'un seul qubit suivie d'une erreur de relaxation thermique du qubit.
id_id: ** Single-qubit gate error * * terdiri dari error depolarisasi qubit tunggal diikuti oleh error relaksasi termal qubit tunggal.
it_it: **Errori dei gate a singolo qubit** composto da un errore di depolarizzazione a singolo qubit seguito da un errore di rilassamento termico a singolo qubit.
ja: **単一量子ビットゲートエラー** 。単一量子ビットの脱分極(depolarizing)エラーと単一量子ビットの熱緩和(thermal relaxation)エラーで構成されています。
ko_kr: **단일 큐비트 게이트 오류** 는 단일 큐비트 편극 소거화 오류와 단일 큐비트 열 이완 오류로 구성된다.
pt_br: **Erros de portas de um único qubit** consistindo de um erro de despolarização de um único qubit, seguido de um erro de relaxação térmica de um único qubit.
pt_un: **Erros de portas de um único qubit** consistindo de um erro de despolarização de um único qubit, seguido de um erro de relaxação térmica de um único qubit.
ta: **Single-qubit gate errors** ஒற்றை குவிட் டிப்போலரைசிங் பிழையைக் கொண்டுள்ளது, அதைத் தொடர்ந்து ஒற்றை குவிட் வெப்ப தளர்வு பிழை உள்ளது.
tr: **Tek kübitlik kapı hataları** tek bir kübitlik depolarizasyon hatası ve takip eden tek kübitlik bir termal gevşeme hatasından oluşur.
zh_tw: **單量子位元閘誤差 ** 由單量子位元的去極化誤差和接續的單量子位元的熱弛緩誤差所組成。

source: **Two-qubit gate errors** consisting of a two-qubit depolarizing error followed by single-qubit thermal relaxation errors on both qubits in the gate.
bn_bn: **২-কিউবিটসম্পন্ন যুক্তিবর্তনীর (গেইট) ভুল** -তে দুটি কিউবিটের ডি-পোলারাইজিং ভুল ও যুক্তিবর্তনীর (গেইট) প্রতিটি কিউবিটের একক কিউবিট তাপীয় শিথিলকরণ (রিলাক্সেশন) ভুল থাকে।
es_un: **Errores de compuertas de dos qubits** que consisten en un error de despolarización de dos qubits seguido de errores de relajación térmica de un solo qubit en ambos qubits en la compuerta.
fr: **Les erreurs de portes quantiques à deux bits** se composent d'une erreur dépolarisante à deux qubits, suivie d'erreurs de relaxation thermique mono-qubit sur chacun des deux qubits de la porte.
id_id: ** Two-qubit gate error * * terdiri dari error depolarisasi dua-qubit diikuti oleh error relaksasi termal qubit tunggal pada kedua qubits di gate.
it_it: **Errori dei gate a due qubit** composto da un errore di depolarizzazione a due qubit seguito da errori di rilassamento termico su entrambi i qubit.
ja: **２量子ビットゲートエラー**。２量子ビットの脱分極エラーと、ゲートの両量子ビットでの単一量子ビット熱緩和エラーで構成されています。
ko_kr: **2-큐비트 게이트 오류** 는 2-큐비트 편극 소거(depolarizing) 오류로 구성되며, 그 다음 게이트의 두 큐비트 모두 단일 큐비트 열 완화 오류로 구성된다.
pt_br: **Erros de portas de dois qubits** consistindo de um erro de despolarização de dois qubits, seguido de um erro de relaxação térmica de um único qubit, em ambos os qubits na porta.
pt_un: **Erros de portas de dois qubits** consistindo de um erro de despolarização de dois qubits, seguido de um erro de relaxação térmica de um único qubit, em ambos os qubits na porta.
ta: **Two-qubit gate errors** இரண்டு-குவிட் டிப்போலரைசிங் பிழையைக் கொண்டிருக்கிறது, அதைத் தொடர்ந்து வாயிலில் உள்ள இரண்டு குவிட்களிலும் ஒற்றை-குவிட் வெப்ப தளர்வு பிழைகள் உள்ளன.
tr: **İki kübitlik geçit hataları**, iki kübitlik depolarizasyon hatası ve takip eden her iki kübitte tek kübitlik termal gevşeme hatalarından oluşur.
zh_tw: **雙量子位元閘誤差** 由一個雙量子位元去極化誤差，和接續發生在兩個量子位元上的閘中單量子位元熱弛緩誤差組成。
