Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/simulators/2_device_noise_simulation.po
Languages: bn_bn, es_un, fr, id_id, it_it, ja, ko_kr, pt_br, pt_un, ta, tr, zh_tw

source: By storing the device properties in ``vigo_simulator``, we ensure that the appropriate basis gates and coupling map are used when compiling circuits for simulation, thereby most closely mimicking the gates that will be executed on a real device. In addition ``vigo_simulator`` contains an approximate noise model consisting of:
bn_bn: আসল যন্ত্রে ব্যবহৃত যুক্তিবর্তনীগুলোর (গেইট) সঠিকভাবে অনুকরণের জন্য আমরা ``vigo_simulator`` -এর মধ্যে যন্ত্রের বৈশিষ্ট্যগুলো রেখে দিই। এতে সিমুলেশনের সময় যখন বর্তনীর কম্পাইলেশন হয়, তখন যাতে সঠিক ভিত্তি (বেসিস) যুক্তিবর্তনী (গেইট) এবং কাপলিং ম্যাপ ব্যবহার হয় তা নিশ্চিত করা যায়। এছাড়াও ``vigo_simulator`` -এ একটা আনুমানিক নয়েজ মডেল আছে। এই মডেলে আছে:
es_un: Al almacenar las propiedades del dispositivo en ``vigo_simulator``, nos aseguramos de que las compuertas base y el mapa de acoplamiento adecuados son utilizados al compilar circuitos para la simulación, con lo que se imitan más cercanamente las compuertas que se ejecutarán en un dispositivo real. Además, ``vigo_simulator`` contiene un modelo de ruido aproximado que está formado por:
fr: En stockant les propriétés de l'appareil dans ``vigo_simulator``, nous nous assurons que les portes de base et la carte de couplage correspondantes sont utilisées lors de la compilation des circuits de simulation, de manière à imiter le plus fidèlement les portes qui seront exécutées sur un véritable appareil. De plus, ``vigo_simulator`` contient un modèle de bruit approximatif consistant en:
id_id: Dengan menyimpan properti perangkat di ` ` vigo_simulator ` `, kita memastikan bahwa gate dasar yang sesuai dan coupling map digunakan ketika kompilasi sirkuit untuk simulasi, sehingga makin dekat meniru gate yang akan dijalankan di perangkat yang sebenarnya. Selain itu ` ` vigo_simulator ` ` berisi perkiraan model noise yang terdiri dari:
it_it: Memorizzando le proprietà del dispositivo in ``vigo_simulator``, ci assicuriamo che, nel momento della compilazione del circuito per la simulazione, vengano utilizzati gli appropriati gate di base e coupling map, in modo da imitare il più fedelmente possibile la sequenza di gate che verranno eseguiti sul dispositivo reale. Inoltre ``vigo_simulator`` contiene un modello di rumore approssimato composto da:
ja: デバイスのプロパティを ``vigo_simulator`` に保存することで、シミュレーション用の回路をコンパイルするときに適切な基底ゲートとカップリングマップが使用されるようにし、実際のデバイスで実行されるゲートを最も厳密に模倣します。 さらに、 ``vigo_simulator`` には、次のもので構成される近似ノイズモデルが含まれています。
ko_kr: 디바이스 속성들을 ``vigo_simulator`` 에 저장함으로써, 우리는 시뮬레이션을 위한 회로들을 컴파일링할 때 적절한 기준 게이트들 및 커플링 맵이 사용되는 것을 보장하며, 이에 의해 실제 디바이스 상에서 실행될 게이트들을 가장 가깝게 모방한다. 이밖에 ``vigo_simulator`` 에는 다음으로 구성된 대략적인 소음 모델이 포함되어 있다.
pt_un: Ao armazenar as propriedades do dispositivo em ``vigo_simulator``, garantimos que as portas base apropriadas e o mapa de acoplamento sejam utilizados ao compilar circuitos para simulação, imitando, assim, mais proximamente as portas que serão executadas em um dispositivo real. Além disso, o ``vigo_simulator`` contém um modelo de ruído aproximado que consiste de:
ta: சாதன பண்புகளை ``vigo_simulator`` சேமிப்பதன் மூலம், உருவகப்படுத்துதலுக்கான சுற்றுகளை தொகுக்கும்போது பொருத்தமான அடிப்படை கேட்கள் மற்றும் இணைப்பு வரைபடம் பயன்படுத்தப்படுவதை நாங்கள் உறுதிசெய்கிறோம், இதன் மூலம் உண்மையான சாதனத்தில் செயல்படுத்தப்படும் கேட்களை மிக நெருக்கமாகப் பிரதிபலிக்கிறோம். கூடுதலாக ``vigo_simulator`` இதில் தோராயமான இரைச்சல் மாதிரியைக் கொண்டுள்ளது:
tr: Cihaz özelliklerini ``vigo_simulator`` içinde saklayarak, simülasyon için devreler derlenirken uygun temel geçitlerin ve kuplaj haritasının kullanılmasını sağlıyoruz, böylece gerçek bir cihazda yürütülecek kapıları en yakın şekilde taklit ediyoruz. Ayrıca ``vigo_simulator`` aşağıdakilerden oluşan yaklaşık bir gürültü modeli içerir:
zh_tw: 通過在 ``vigo_simulator`` 中儲存元件的特性，我們可以確保在編譯用於模擬的電路時，我們使用的基底閘和耦合映射是適當的，從而最仿真地模擬將在真實元件上執行的閘。此外 ``vigo_simulator`` 包含一個近似雜訊模型，此模型由以下三者構成：

source: Running a noise simulation
bn_bn: একটি নয়েজ সিমুলেশন চালানো
es_un: Ejecutar una simulación de ruido
fr: Exécution d'une simulation avec du bruit
ja: ノイズ・シミュレーションの実行
ko_kr: 잡음 시뮬레이션 실행하기
pt_un: Executar uma simulação de ruído
ta: இரைச்சல் உருவகப்படுத்துதலை இயக்குகிறது
tr: Gürültü simülasyonu çalıştırma
zh_tw: 執行雜訊模擬

source: Once we have created a noisy simulator backend based on a real device we can use it to run noisy simulations.
bn_bn: একবার আমরা একটি বাস্তব ডিভাইসের উপর ভিত্তি করে একটি নয়েজী সিমুলেটর ব্যাকএন্ড তৈরি করলে আমরা নয়েজী সিমুলেশন চালানোর জন্য এটি ব্যবহার করতে পারি।
es_un: Una vez que hemos creado un simulador de backend ruidoso basado en un dispositivo real, podemos usarlo para ejecutar simulaciones ruidosas.
fr: Une fois que nous avons créé un système de backend bruité basé sur un appareil réel, nous pouvons l'utiliser pour exécuter des simulations avec du bruit.
ja: 実際のデバイスをベースにしたノイズ・シミュレーターのバックエンドを作成したら、ノイズのあるシミュレーションを実行することができます。
ko_kr: 실제 장치를 기반으로 하는 노이즈를 포함한 시뮬레이터 백엔드를 생성하면 이를 사용하여 노이즈를 포함한 시뮬레이션을 실행할 수 있다.
pt_un: Uma vez criado um serviço simulador de ruído baseado em um dispositivo real, podemos usá-lo para executar simulações com ruídos.
ta: ஒரு உண்மையான சாதனத்தின் அடிப்படையில் சத்தமில்லாத சிமுலேட்டர் பின்தளத்தில் உருவாக்கியவுடன், சத்தமான உருவகப்படுத்துதல்களை இயக்க அதைப் பயன்படுத்தலாம்.
tr: Gerçek bir cihaza dayalı gürültülü bir simülatör arkayüzeyi oluşturduğumuzda, gürültülü simülasyonları çalıştırmak için kullanabiliriz.
zh_tw: 一旦我們基於真實的元件建立了具有雜訊的模擬器後台，我們就可以使用它來執行具有雜訊的模擬。

source: **Important:** When running noisy simulations it is *critical* to ``transpile`` the circuit for the backend so that the circuit is transpiled to the correct noisy basis gate set for the backend.
bn_bn: **গুরুত্বপূর্ণ** নয়েজী সিমুলেশন চালানোর সময় ব্যাকএন্ডের জন্য সার্কিটটি ``ট্রান্সপাইল`` করাটি সংকটপূর্ণ যাতে সার্কিটটি ব্যাকএন্ডের জন্য সঠিক নয়েজ বেস গেটে সেট করা হয়।
es_un: **Importante:** Cuando se ejecutan simulaciones ruidosas, es *crítico* ejecutar ``transpile`` en el circuito para el backend, para que el circuito sea transpilado a la compuerta base ruidosa correcta configurada para el backend.
fr: ** Important:** Lorsque vous exécutez des simulations avec du bruit, il est *critique* de ``transpiler`` le circuit pour le système d'execution choisi de façon à ce que le circuit soit transpilé selon le jeu de portes natives correspondant à ce système.
ja: **重要:** ノイズ・シミュレーションを実行する際には、そのバックエンド用に回路を ``transpile`` することが *重要* です。これによって回路は、バックエンドに対して正しいノイズ・ベース・ゲート・セットに変換されます。
ko_kr: **중요 사항:** 노이즈를 포함한 시뮬레이션을 실행하는 경우 백엔드에 대한 회로를 ``transpile`` 하여 백엔드에 대해 올바른 노이즈 기저 게이트 셋로 전송하는 것이 중요하다.
pt_un: **Importante:** Quando se executa simulações com ruído é *essencial* ``transpilar``o circuito para o serviço, ou seja, o circuito deve ser ``transpilado`` para a porta base de ruído correta, configurando-a no serviço.
ta: **Important:** சத்தமில்லாத உருவகப்படுத்துதல்களை இயக்கும் போது, ​​பின்தளத்தில் சுற்று ``transpile`` செய்ய *critical*, இதன் மூலம் சுற்று பின்தளத்தில் அமைக்கப்பட்ட சரியான சத்தமான அடிப்படை வாயிலுக்கு அனுப்பப்படுகிறது.
tr: **Önemli:** Gürültülü simülasyonlar çalıştırırken, devrenin arkayüzeyi için ayarlanmış doğru gürültülü temel geçite aktarılması için arkayüzey için devreyi ``transpile`` *kritiktir*.
zh_tw: **重要:** 執行具有雜訊的模擬時，幫後台 ``transpile`` 電路*非常重要*。電路必須被轉譯為該後台可以執行的基底閘的集合。

source: If transpilation is skipped noise from the device noise model will not be applied to gates in the circuit that are supported by the simulator, but not supported by the mimicked backend.
bn_bn: যদি transpilation বাদ দেওয়া হয়, তাহলে ডিভাইস নয়েজ মডেল থেকে নয়েজটি সার্কিটের গেটগুলিতে প্রয়োগ করা হবে না যা সিমুলেটর দ্বারা সমর্থিত, কিন্তু নকল করা ব্যাকএন্ড দ্বারা সমর্থিত নয়।
es_un: Si se omite la transpilación, el ruido del modelo de ruido del dispositivo no se aplicará a las compuertas del circuito que sean compatibles con el simulador, pero que no sean compatibles con el backend imitado.
fr: Si la transpilation n'est pas executée le modèle de bruit de l'appareil ne sera pas appliqué aux portes du circuit qui sont prises en charge par le simulateur, mais pas supportées par la machine imitée.
ja: もしトランスパイルがスキップされると、デバイス・ノイズ・モデルからのノイズは回路のゲートに適用されません。これはシミュレーターではサポートされますが、擬似バックエンドではサポートされません。
ko_kr: 장치 노이즈 모델의 트랜스파일링을 건너뛰면 시뮬이터가 지원하는 회로의 게이트에는 노이즈가 적용되지 않지만 모방된 백엔드가 지원되지 않는다.
pt_un: Se a transpilação for ignorada, o modelo de ruído do dispositivo não será aplicado mesmo nas portas que são suportadas pelo simulador, pois as mesmas não são suportadas pelo serviço imitado (adaptado).
ta: டிரான்ஸ்பைலேஷன் தவிர்க்கப்பட்டால், சாதன இரைச்சல் மாதிரியிலிருந்து வரும் சத்தம் சிமுலேட்டரால் ஆதரிக்கப்படும் சுற்றுகளில் உள்ள கேட்களுக்குப் பயன்படுத்தப்படாது, ஆனால் பிரதிபலித்த பின்தளத்தில் ஆதரிக்கப்படாது.
tr: Aktarım atlanırsa, cihaz gürültü modeli devredeki simülatör tarafından desteklenen ancak taklit edilen arka uç tarafından desteklenmeyen kapılara uygulanmaz.
zh_tw: 如果我們跳過了轉譯這個步驟，來自元件雜訊模型的雜訊將不會被套用於在此電路中的閘。此電路被該模擬器支援，但並不被仿真後台支援。

source: Fake Provider Backends
es_un: Backends de Proveedores Falsos
fr: Backend de faux fournisseur
ja: フェイク・プロバイダー・バックエンド
ta: போலி வழங்குநர் பின்னணிகள்
