Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/simulators/2_device_noise_simulation.po
Languages: bn_bn, es_un, fr, id_id, it_it, ja, ko_kr, pt_br, pt_un, ta, tr, zh_tw

source: **Single-qubit readout errors** on the classical bit value obtained from measurements on individual qubits.
bn_bn: **একক কিউবিট রিডআউট ভুল** হলো প্রত্যেক কিউবিটের পরিমাপের পর প্রথাগত (ক্লাসিক্যাল) বিটের প্রাপ্ত মানের ভুল।
es_un: **Errores de lectura de salida de un qubit** en el valor del bit clásico obtenido a partir de mediciones en qubits individuales.
fr: **Erreurs de lecture sur un qubit** sur la valeur du bit classique obtenue pour des qubits individuels.
id_id: ** Single-qubit readout errors * * pada nilai bit klasik yang didapat dari pengukuran pada tiap-tiap qubit.
it_it: **Errori di lettura sul singolo qubit** sul valore del bit classico ottenuto da misurazioni sui singoli qubit.
ja: **単一量子ビット読み出しエラー** は、個々の量子ビットの測定から得られる古典ビット値です。
ko_kr: 개별 큐비트의 측정에서 얻은 클래식 비트에 대한 **단일 큐비트 읽기 오류** 이다.
pt_br: **Erros de leitura de um único qubit** sobre o valor clássico do bit obtido, a partir de medições em qubits individuais.
pt_un: **Erros de leitura de um único qubit** sobre o valor clássico do bit obtido, a partir de medições em qubits individuais.
ta: **Single-qubit readout errors** தனிப்பட்ட குவிட்களின் அளவீடுகளிலிருந்து பெறப்பட்ட கிளாசிக்கல் பிட் மதிப்பில்.
tr: Tek kübitlerde yapılan ölçümlerden elde edilen klasik bit değerindeki **tek kübit okuma hataları**.
zh_tw: 個別量子位元測量所獲得的古典位元數值的**單量子位元讀出誤差**。

source: For the gate errors the error parameter of the thermal relaxation errors is derived using the ``thermal_relaxation_error`` function from ``aer.noise.errors`` module, along with the individual qubit :math:`T_1` and :math:`T_2` parameters, and the ``gate_time`` parameter from the device backend properties. The probability of the depolarizing error is then set so that the combined average gate infidelity from the depolarizing error followed by the thermal relaxation is equal to the ``gate_error`` value from the backend properties.
bn_bn: যুক্তিবর্তনী (গেইট) ত্রুটির জন্য তাপীয় শিথিলকরণ (রিলাক্সেশন) ত্রুটির ত্রুটি প্যারামিটারটা ``aer.noise.errors`` মডিউলের ``thermal_relaxation_error`` ব্যবহার করে গণনা করা হয়। একইসঙ্গে প্রত্যেক কিউবিটের :math:`T_1` ও :math:`T_2` প্যারামিটার এবং যন্ত্রের ব্যাকেণ্ডের বৈশিষ্ট্য থেকে ``gate_time`` প্যারামিটার আনা হয়। ডি-পোলারাইজিঙ ত্রুটির গড় যুক্তিবর্তনীর ইনফিডেলিটি ও তাপীয় শিথিলকরণ (রিলাক্সেশন) -এর মিলিত গড় হল ডি-পোলারাইজিঙ ত্রুটির সম্ভাবনা যা ব্যাকএন্ড থেকে পাওয়া ``gate_error`` -এর মানের সমান।
es_un: Para los errores de compuertas, el parámetro de error de los errores de relajación térmica se deriva usando la función ``thermal_relaxation_error`` del módulo ``aer.noise.errors``, junto con los parámetros de qubits individuales :math:`T_1` y :math:`T_2`, y el parámetro ``gate_time`` de las propiedades del backend de dispositivo. Luego, la probabilidad del error de despolarización se establece de tal manera que la infidelidad de la compuerta promedio combinada con el error de despolarización, seguido de la relajación térmica, sea igual al valor de ``gate_error`` de las propiedades del backend.
fr: Pour les erreurs sur les portes quantiques, le paramètre d'erreur lié à la relaxation thermique est dérivé à l'aide de la fonction ``thermal_relaxation_error`` du module ``aer.noise.errors``, ainsi que des paramètres individuels :math:`T_1` et :math:`T_2`, et du paramètre ``gate_time`` à partir des propriétés du backend. La probabilité de l'erreur de dépolarisation est alors définie de façon à ce que la non fidélité moyenne de la porte combinée à l'erreur de dépolarisation suivie par la relaxation thermique soit égale à la valeur ``gate_error`` des propriétés du backend.
id_id: Untuk error gate, parameter dari error relaksasi termal adalah menggunakan fungsi ` ` thermal_relaxation_error ` ` dari modul ` `aer.noise.errors ` ` `, bersama dengan parameter dari tiap-tiap qubit :math:` T_1 ` dan :math:` T_2 `, dan parameter ` ` ` gate_time ` ` dari properti backend perangkat. Probabilitas error depolarisasi kemudian diatur sehingga gabungan rata-rata dari gate infidelity dari error depolarisasi yang diikuti oleh relaksasi termal sama dengan nilai ` ` gate_error ` ` ` dari properti backend.
it_it: Per gli errori sui gate, il parametro degli errori di rilassamento termico è ricavato utilizzando la funzione ``thermal_rilassation_error`` dal modulo ``aer.noise.errors`, insieme ai parametri di singolo qubit :math:`T_1` e :math:`T_2`, mentre il parametro ``gate_time`` è ricavato dalle proprietà del backend del dispositivo. La probabilità di avere un errore di depolarizzazione viene quindi impostata in modo che l'infedelity media combinata relativa ad un gate ottenuta da un errore di depolarizzazione seguito da rilassamento termico sia uguale al valore del ``gate_error`` ottenuto dalle proprietà del backend.
ja: ゲートエラーの場合、熱緩和エラーのエラーパラメータは、個々の量子ビット :math:`T_1` と :math:`T_2` パラメータ、およびデバイスバックエンドプロパティの ``gate_time`` パラメータとともに、``aer.noise.errors`` モジュールの ``thermal_relaxation_error`` 関数を使用して生成されます。 次に、脱分極誤差の確率が設定されます。脱分極エラーからの平均ゲート忠実度と、それに続く熱緩和が、バックエンドプロパティからの ``gate_error`` 値に等しくなります。
ko_kr: 게이트 오류의 경우 열 완화 오류의 오류 매개변수는 개별 큐비트 :math:`T_1` 및 :math:`T_2` 매개 변수와 함께 ``aer.noise.errors`` 모듈의 ``thermal_relaxation_error`` 함수를 사용하여 도출되고 장치 백엔드 속성에서 ``gate_time`` 매개 변수를 사용한다. 그런 다음 편극 소거 오류의 확률은 편극 소거 오류와 열 완화에 따른 결합된 평균 게이트 부정행위가 백엔드 속성의 ``gate_error`` 값가 동일하도록 설정된다.
pt_br: Para os erros de porta, o parâmetro de erro dos erros de relaxação térmica é derivado usando a função ``thermal_relaxation_error``, do módulo ``aer.noise.errors``, juntamente com os parâmetros de qubit individual :math:`T_1` e :math:`T_2`, e o parâmetro ``gate_time`` das propriedades do backend do dispositivo. A probabilidade do erro de despolarização é, então, configurada de modo que a infidelidade média de porta combinada do erro de despolarização seguido do relaxamento térmico, seja igual ao valor ``gate_error`` das propriedades do backend.
pt_un: Para os erros de porta, o parâmetro de erro dos erros de relaxação térmica é derivado usando a função ``thermal_relaxation_error``, do módulo ``aer.noise.errors``, juntamente com os parâmetros de qubit individual :math:`T_1` e :math:`T_2`, e o parâmetro ``gate_time`` das propriedades do backend do dispositivo. A probabilidade do erro de despolarização é, então, configurada de modo que a infidelidade média de porta combinada do erro de despolarização seguido do relaxamento térmico, seja igual ao valor ``gate_error`` das propriedades do backend.
ta: கேட் பிழைகளுக்கு, வெப்ப தளர்வு பிழைகளின் பிழை அளவுரு ``aer.noise.errors`` தொகுதியிலிருந்து ``thermal_relaxation_error`` செயல்பாட்டைப் பயன்படுத்தி பெறப்படுகிறது, தனித்தனி குவிட் :math:`T_1` மற்றும் :math:`T_2` அளவுருக்கள் மற்றும் சாதன பின்தளத்தில் பண்புகளிலிருந்து ``gate_time`` அளவுரு. டிப்போலரைசிங் பிழையின் நிகழ்தகவு பின்னர் அமைக்கப்படுகிறது, இதனால் வெப்ப தளர்த்தலைத் தொடர்ந்து டிப்போலரைசிங் பிழையிலிருந்து ஒருங்கிணைந்த சராசரி கேட் துரோகம் பின்தளத்தில் பண்புகளிலிருந்து ``gate_error`` மதிப்புக்கு சமமாக இருக்கும்.
tr: Kapı hataları için, termal durulma hatalarının hata parametresi, tek kübit :math:`T_1` ve :math:`T_2` parametreleri ve cihaz arka uç özelliklerinden ``gate_time`` parametresi ile birlikte, ``aer.noise.errors`` modülünden ``thermal_relaxation_error`` fonksiyonu kullanılarak türetilir. Depolarizasyon hatasının olasılığı daha sonra, termal gevşemenin ardından depolarizasyon hatasından kaynaklanan birleşik ortalama kapı yanıltıcılığı arka uç özelliklerinden ``gate_error`` değerine eşit olacak şekilde ayarlanır.
zh_tw: 對於閘的誤差，通過使用來自 ``aer.noise.errors`` 模組中的 ``thermal_relaxation_error`` 函數以及其個別量子位元的 :math:`T_1` and :math:`T_2` 參數，以及來自元件後台特性的 ``gate_time`` 參數，我們可以推導出該熱弛緩的誤差參數。接著，我們可以設定去極化誤差的機率，使得來自去極化誤差和接續的熱弛緩的加總平均閘不保真度(combined average gate infidelity) 等同於來自其後台特性的 ``gate_error`` 值。

source: For the readout errors the probability that the recorded classical bit value will be flipped from the true outcome after a measurement is given by the qubit ``readout_errors``.
bn_bn: রিডআউট ত্রুটির জন্য সম্ভাব্য যে রেকর্ড করা ক্লাসিক্যাল বিট মানটি কিউবিট "readout_errors" দ্বারা একটি পরিমাপ দেওয়ার পরে প্রকৃত ফলাফল থেকে উল্টে যাবে।
es_un: Para los errores de lectura, la probabilidad de que el valor del bit clásico registrado se desvíe del resultado real después de una medición viene dada por ``readout_errors`` del qubit.
fr: Pour les erreurs de lecture, la probabilité que la valeur de bit classique enregistrée soit erronée après une mesure est donnée par ``readout_errors``.
id_id: Untuk error readout probabilitas bahwa nilai bit klasik yang direkam akan berbeda dari hasil yang benar setelah pengukuran yang diberikan oleh ` ` readout_errors ` ` dari tiap-tiap qubbit.
it_it: Per gli errori di lettura la probabilità che il valore del bit classico registrato venga capovolto rispetto al risultato vero dopo una misurazione è data da ``readout_errors`` del qubit.
ja: 読み出しエラーの場合、量子ビット ``readout_errors`` によって測定後に記録された古典ビット値が真の結果から反転される確率を返します。
ko_kr: 판독 오류의 경우 큐비트 ``readout_errors`` 가 측정을 제공한 후 기록된 클래식 비트 값이 참 결과에서 플립될 확률이다.
pt_br: Para os erros de leitura, a probabilidade de que o valor do bit clássico gravado será o inverso do resultado verdadeiro, após uma medição, é dada pelo ``readout_errors`` do qubit.
pt_un: Para os erros de leitura, a probabilidade de que o valor do bit clássico gravado será o inverso do resultado verdadeiro, após uma medição, é dada pelo ``readout_errors`` do qubit.
ta: ரீட்அவுட் பிழைகளுக்கு, `` readout_errors`` என்ற குவிட் மூலம் ஒரு அளவீட்டு வழங்கப்பட்ட பின்னர் பதிவுசெய்யப்பட்ட கிளாசிக்கல் பிட் மதிப்பு உண்மையான முடிவிலிருந்து புரட்டப்படும்.
tr: Okuma hataları için, kaydedilen klasik bit değerinin, kübit ``okuma hatası`` ile bir ölçüm verildikten sonra gerçek sonuçtan çevrilmesi olasılığı.
zh_tw: 至於讀出誤差，量子位元的``readout_errors`` 會告訴我們測量之後得到的古典位元值，有多大的機率會翻轉成和真實結果相反。

source: Let us construct the device noise model.
pt_br: Vamos construir o modelo de ruído do dispositivo.

source: Simulating a quantum circuit with noise
pt_br: Simulando um circuito quântico com ruído

source: To use this noise model we must make use of several keyword arguments in the ``execute`` function. These are:
pt_br: Para utilizar este modelo de ruído, devemos fazer uso de vários argumentos de palavra-chave na função ``execute``. Estes são:

source: ``noise_model``: This passes the noise model to the ``QasmSimulator.run`` method for noisy simulation.
pt_br: ``noise_model``: Isso passa o modelo de ruído para o método ``QasmSimulator.run`` para simulação com ruído.

source: ``basis_gates``: A noise model is defined with respect to specific gates, we must pass these basis gates to the Qiskit compiler so that it compiles the circuit to the correct gates for the noise model. The basis gates of a noise model may be obtained from the ``NoiseModel.basis_gates`` property.
pt_br: ``basis_gates``: Um modelo de ruído é definido em relação a portas específicas. Temos de passar estas portas base para o compilador Qiskit, de modo que ele compile o circuito para as portas corretas para o modelo de ruído. As portas base de um modelo de ruído podem ser obtidas da propriedade ``NoiseModel.basis_gates``.

source: ``coupling_map``: We also must make sure we provide the ``coupling_map`` for the real device so that the compiler will produce a ``Qobj`` for the simulator that will match the compiled experiment that can be executed on the real device.
pt_br: ``coupling_map``: Também devemos ter certeza de que fornecemos o ``coupling_map`` para o dispositivo real, de modo que o compilador produza um ``Qobj`` para o simulador, que corresponderá ao experimento compilado, que pode ser executado no dispositivo real.

source: Local Simulator
pt_br: Simulador Local

source: The *gate_error* probability of each basis gate on each qubit.
bn_bn: *gate_error* সম্ভাব্যতা হল প্রত্যেকটা কিউবিটের প্রত্যেক ভিত্তি যুক্তিবর্তনীর (গেইট)।
es_un: Las probabilidades de *gate_error* de cada una de las compuertas base en cada qubit.
fr: La probabilité *gate_error* de chaque porte de base sur chaque qubit.
id_id: Probabilitas * gate_error * dari masing-masing gate dasar pada setiap qubit.
it_it: La probabilità *gate_error* di errore per ogni gate di base su ogni qubit.
ja: 各量子ビットの各基底ゲートの *gate_error* 確率。
ko_kr: 각 큐비트의 기본 게이트들의 *gate_error* 확률.
pt_un: A probabilidade de *gate_error* (erro da porta) de cada porta base em cada qubit.
ta: ஒவ்வொரு குவிட்டிலும் ஒவ்வொரு அடிப்படை கேட்டின் *gate-error * நிகழ்தகவு.
tr: Her kübit üzerindeki her temel geçidin *geçit_hatası* olasılığı.
zh_tw: 每一個量子位元上的每個基底閘的*gatew_error* 機率。

source: The *gate_length* of each basis gate on each qubit.
bn_bn: *gate_length* হল প্রত্যেকটা কিউবিটের প্রত্যেক ভিত্তি যুক্তিবর্তনীর (গেইট)।
es_un: El *gate_length* de cada una de las compuertas base en cada qubit.
fr: La valeur *gate_length* de chaque porte de base sur chaque qubit.
id_id: * gate_length * dari masing-masing gate dasar pada setiap qubit.
it_it: La *gate_length* di ogni gate di base su ogni qubit.
ja: 各量子ビットの各基底ゲートの *gate_length* 。
ko_kr: 각 큐비트에 있는 각 기본 게이트의 *gate_length*.
pt_un: O *gate_length* (comprimento da porta) de cada porta base em cada qubit.
ta: ஒவ்வொரு குவிட்டிலும் ஒவ்வொரு அடிப்படை கேட்டின் *gate_length*.
tr: Her kübit üzerindeki her temel geçidin *geçit_uzunluğu*.
zh_tw: 每一個量子位元上每一個基底閘的 *gate_length* 。

source: The readout error probability of each qubit.
bn_bn: প্রত্যেক কিউবিটের রিডআউট ভুলের সম্ভাবনা।
es_un: La probabilidad de error de lectura de cada qubit.
fr: La probabilité d'erreur de lecture sur chaque qubit.
ja: 各量子ビットの読み出しエラーの確率。
ko_kr: 각 비트의 읽기 오류 확률이다.
pt_un: A probabilidade de erro de leitura de cada qubit.
ta: ஒவ்வொரு குவிட்டின் வாசிப்பு பிழை நிகழ்தகவுகள்.
tr: Her bir kübitin okuma hatası olasılığı.
zh_tw: 每一個量子位元的讀出誤差機率。

source: We will use real noise data for an IBM Quantum device using the data stored in Qiskit Terra. Specifically, in this tutorial, the device is ``ibmq_vigo``.
bn_bn: আমরা Qiskit টেরায় সংরক্ষিত ডেটা ব্যবহার করে আইবিএম কোয়ান্টাম ডিভাইসের জন্য বাস্তব ত্রুটি তথ্য কাজে লাগাবো। বিশেষ করে, এই টিউটোরিয়ালে, ডিভাইসটি ``ibmq_vigo``।
es_un: Usaremos datos de ruido real para un dispositivo IBM Quantum utilizando los datos almacenados en Qiskit Terra. Específicamente, en este tutorial, el dispositivo es ``ibmq_vigo``.
fr: Nous utiliserons des données de bruit réel d'un ordinateur quantique d'IBM en utilisant les données enregistrées dans Qiskit Terra. Plus précisément, dans ce tutoriel, la machine est ``ibmq_vigo``.
ja: Qiskit Terra に保存されているデータを使用して、IBMQuantumデバイスの実際のノイズデータを使用します。 具体的には、このチュートリアルでのデバイスは ``ibmq_vigo`` です。
ko_kr: Qiskit Terra에 저장된 데이터를 사용하여 IBM 양자 장치의 실제 노이즈 데이터를 사용한다. 구체적으로 본 지침서에서 사용된 장치는 ``ibmq_vigo`` 이다.
pt_un: Utilizaremos dados reais de ruído de um dispositivo IBM Quantum usando os dados armazenados no Qiskit Terra. Especificamente, neste tutorial, o dispositivo é o ``ibmq_vigo``.
ta: Qiskit Terra வில் சேமிக்கப்பட்ட தரவைப் பயன்படுத்தி ஒரு IBM குவாண்டம் சாதனத்திற்கு உண்மையான இரைச்சல் தரவைப் பயன்படுத்துவோம். குறிப்பாக, இந்த பயிற்சிகளில், சாதனம் ``ibmq_vigo``.
tr: Qiskit Terra içerisinde depolanan veriyi kullanarak bir IBM Kuantum cihazının gürültüsünü içeren veriyi kullanacağız. Özellikle, bu eğitimdeki cihaz ``ibmq_vigo``'dur.
zh_tw: 我們會使用 Qiskit Terra 裡儲存的 IBM 量子裝置之真實雜訊數據，而此教程中我們用的是 ``ibmq_vigo`` 這個元件。

source: Now we construct a test circuit to compare the output of the real device with the noisy output simulated on the Qiskit Aer ``AerSimulator``. We will prepare a 3-qubit GHZ state :math:`\frac{1}{\sqrt2}(|0,0,0\rangle + |1,1,1\rangle)` on qubits 0, 1 and 2. Before running with noise or on the device we show the ideal expected output with no noise.
bn_bn: Qiskit এয়ারের ``AerSimulator`` -এর নয়েজপূর্ণ ফলাফল ও একটা বাস্তব যন্ত্রের ফলাফলের তুলনা করার জন্য আমরা একটা পরীক্ষা বর্তনী (সার্কিট) বানাবো। আমরা ০,১,২ কিউবিটের উপর একটা ৩-কিউবিটসম্পন্ন GHZ অবস্থা :math:`\frac{1}{\sqrt2}(|0,0,0\rangle + |1,1,1\rangle)` বানাবো। যন্ত্রের উপর চালানোর আগে বা নয়েজপূর্ণ সিমুলেশনের আগে আমাদের নয়েজহীন ফলাফলটা জানতে হবে।
es_un: Ahora construimos un circuito de prueba para comparar la salida del dispositivo real con la salida ruidosa simulada en el ``AerSimulator`` de Qiskit Aer. Prepararemos un estado GHZ de 3 qubits :math:`\frac{1}{\sqrt2}(|0,0,0\rangle + |1,1,1\rangle)` en los qubits 0, 1 y 2. Antes de ejecutar con ruido o en el dispositivo, mostramos la salida ideal esperada sin ruido.
fr: Maintenant nous construisons un circuit de test pour comparer la sortie de l'appareil réel avec la sortie bruitée simulée sur le ``AerSimulator`` de Qiskit Aer. Nous allons préparer un état GHZ de trois qubits :math:`\frac{1}{\sqrt{2}}(|0,0,0\rangle + |1,1,1\rangle)` sur les qubits 0, 1 et 2. Avant de lancer l'execution sur simulateur avec le bruit ou sur le système réel, nous montrons la sortie attendue idéale sans bruit.
ja: それでは、実機の測定出力と Qiskit Aerの ``AerSimulator`` でシミュレートしたノイズがある場合の測定出力を比較する量子回路を作りましょう。量子ビット0,1,2に、3量子ビットのGHZ状態 :math:`\frac{1}{\sqrt2}(|0,0,0\rangle + |1,1,1\rangle)` を準備するとします。ノイズがある場合や実機上で実行する前に、ノイズのない理想的な場合の測定出力を示しておきます。
ko_kr: 이제 실제 장치의 출력과 Qiskit Aer의 ``AerSimulator`` 에서 시뮬레이션한 잡음을 포함한 출력을 비교하기 위한 테스트 회로를 생성하였다. 3-큐비트 GHZ 상태 :math:`\frac{1}{\sqrt22}(|0,0,0\rangle + |1,1,1\rangle)` 를 큐비트 0, 1, 2에 준비할 것이다. 비교 실험을 수행하기 전, 잡음이 포함되지 않은 이상적인 출력을 확인할 수 있다.
pt_un: Agora, construiremos um circuito de teste para comparar a saída do dispositivo real com a saída com ruído simulada no Qiskit Aer ``AerSimulator``. Vamos considerar um estado GHZ de 3 qubits :math:`\frac{1}{\sqrt2}(|0,0,0\rangle + |1,1,1\rangle)` nos qubits 0, 1 e 2. Antes de executar com ruído ou no dispositivo, mostraremos a saída ideal esperada sem ruído.
ta: இப்போது நாம் ஒரு சோதனை சுற்று உருவாக்க உண்மையான சாதனத்தின் வெளியீட்டை Qiskit Aer உருவகப்படுத்தப்பட்ட இரைச்சல் வெளியீடுடன் ஒப்பிடுகிறோம் ``AerSimulator`` .நாம் ஒரு 3-க்யூபிட் GHZ நிலை :math:`\frac{1}{\sqrt2}(|0,0,0\rangle + |1,1,1\rangle)` க்யூபிட்கள் 0, 1 மற்றும் 2.இரைச்சலுடன் இயங்கும் முன் அல்லது சாதனத்தில் எந்த சத்தமும் இல்லாமல் சிறந்த எதிர்பார்க்கப்படும் வெளியீட்டை நாங்கள் காண்பிக்கிறோம்.
tr: Şimdi gerçek cihazdan elde edilen çıktı ile Qiskit Aer ``AerSimulator`` üzerinde simüle edilen gürültülü çıktıyı karşılaştırmak için bir test devresi kuruyoruz. 0, 1 ve 2 kübitlerinde 3 kübitlik bir GHZ durumu :math:`\frac{1}{\sqrt2}(|0,0,0\rangle + |1,1,1\rangle)` hazırlayacağız. Burada, gürültülü çıktıyı veya cihaz çıktısını almadan önce ideal beklenen, gürültüsüz çıktıyı gösteriyoruz.
zh_tw: 現在，我們建構一個測試電路來比較真實器件的輸出與 Qiskit Aer ``AerSimulator``上模擬出的具有雜訊的輸出。我們將在量子位元 0、 1 和 2上製備 3量子位元 GHZ 狀態 :math:`\frac{1}{\sqrt2}(|0,0,0\rangle + |1,1,1\rangle)` 。在執行有雜訊的模擬或在真實裝置上運行之前，我們先顯示出沒有雜訊的理想預期輸出。

source: Generating a simulator that mimics a device
bn_bn: একটি সিমুলেটর বানানো যেটা একটা যন্ত্রের অনুকরণ করে।
es_un: Generar una simulación que imita a un dispositivo
fr: Génération d'un simulateur qui imite un ordinateur quantique
id_id: Membuat simulator yang menirukan sebuah perangkat
it_it: Generare un simulatore che imita un dispositivo
ja: デバイスを模倣するシミュレーターの生成
ko_kr: 장치를 모방하는 시뮬레이터 생성하기
pt_un: Gerando um simulador que imita um dispositivo
ta: சாதனத்தைப் பிரதிபலிக்கும் சிமுலேட்டரை உருவாக்குகிறது
tr: Bir cihazı taklit eden bir simülatör oluşturma
zh_tw: 產生模擬真實裝置的模擬器

source: We call ``from_backend`` to create a simulator for ``ibmq_vigo``:
bn_bn: ``ibmq_vigo`` -এর একটা সিমুলেটর বানানোর জন্য আমরা ``from_backend`` ব্যবহার করি:
es_un: Llamamos a ``from_backend`` para crear un simulador para ``ibmq_vigo``:
fr: Nous utilisons ``from_backend`` pour créer un simulateur pour ``ibmq_vigo``:
id_id: Kita memanggil ` ` from_backend ` ` untuk membuat sebuah simulator untuk ` ` ibmq_vigo ` `:
it_it: Utilizziamo ``from_backend`` per creare un simulatore per ``ibmq_vigo``:
ja: ``from_backend`` を呼び出して、 ``ibmq_vigo`` のシミュレーターを作成します。
ko_kr: 우리는 ``ibmq_vigo`` 시뮬레이터를 생성하기 위하여 ``from_backend`` 를 호출하고자:
pt_un: Chamamos ``from_backend`` para criar um simulador para o ``ibmq_vigo``:
ta: ``Ibmq_vigo`` க்கு ஒரு சிமுலேட்டரை உருவாக்க ``from_backend`` ஐ அழைக்கிறோம்:
tr: ``ibmq_vigo`` ile bir simülatör oluşturmak için ``from_backend``i çağırıyoruz:
zh_tw: 我們呼叫 ``from_backend`` ，以建立 ` ` ibmq_vigo``的模擬器：
