Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/simulators/3_building_noise_models.po
Languages: bn_bn, es_un, fr, id_id, ja, ko_kr, pt_un, ta_in, tr, zh

source: A single-qubit generalized amplitude damping error channel given by an amplitude damping parameter :math:`\lambda`, and an excited state thermal population :math:`p_1`.
bn_bn: একটা একক কিউবিট সাধারণ বিস্তার অবনমনকারী (ড্যাম্পিং) ত্রুটি চ্যানেল বানাতে হলে একটা বিস্তার অবনমন (ড্যাম্পিং) প্যারামিটার :math:`\lambda` এবং একটা উত্তেজিত দশা তাপীয় সংখ্যা বা সংখ্যাবিন্যাস (থার্মাল পপুলেশন) :math:`p_1` প্রয়োজন।
es_un: Un canal de error de amortiguación de amplitud generalizada de un solo qubit dado por un parámetro de amortiguamiento de amplitud :math:`\lambda`, y una población térmica de estado excitado :math:`p_1`.
fr: Un canal d'amortissement d'erreur sur un seul qubit généralisé donné par un paramètre d'amortissement d'amplitude :math:`\lambda`, et une population dans l'état d'excitation thermique :math:`p_1`.
id_id: Sebuah channel amplitude damping error qubit tunggal yang diberikan oleh parameter amplitudo damping :math:` \lambda `, dan populasi termal keadaan tereksitasi :math:` p_1 `.
ja: 振幅減衰パラメータ :math:`\lambda` および励起状態の熱集団である :math:`p_1` によって与えられる単一量子ビット一般化された振幅減衰誤差チャネル。
ko_kr: 진폭 감쇠 매개 변수 :math:`\lambda` 및 여기 상태 열의 집단 :math:`p_1` 이 제공하는 단일 큐비트 일반화 진폭 감쇠 오류 채널.
pt_un: Um canal de erro de amortecimento de amplitude generalizada de um único qubit dado por um parâmetro de amortecimento de amplitude :math:`\lambda`, e uma população térmica de estado excitado :math:`p_1`.
ta_in: ஒற்றை-குவிட் பொதுமைப்படுத்தப்பட்ட அலைவீச்சு தணிக்கும் பிழை சேனல் ஒரு வீச்சு அடர்த்தியான அளவுரு: கணிதம் :math:`\lambda`, மற்றும் ஒரு உற்சாகமான மாநில வெப்ப மக்கள் தொகை :math:`p_1`.
tr: Genlik sönümleme parametresi :math:`\lambda` ve uyarılmış durum termal popülasyonu :math:`p_1` tarafından verilen tek kübitlik genelleştirilmiş bir genlik sönümleme hata kanalı.
zh: 一個由振幅阻尼參數 :math:`\lambda` 和激發態熱分佈數量 :math:`p_1` 表示的單量子位元廣義化的振幅阻尼誤差通道。

source: A single-qubit phase damping error channel given by a phase damping parameter :math:`\gamma`
bn_bn: একটা একক কিউবিট দশা অবনমনকারী (ড্যাম্পিং) ত্রুটি চ্যানেল বানাতে হলে দশা অবনমন (ড্যাম্পিং) প্যারামিটার :math:`\gamma` দিতে হবে
es_un: Un canal de error de amortiguamiento de fase de un solo qubit dado por un parámetro de amortiguamiento de fase :math:`\gamma`
fr: Un canal d'erreur d'amortissement de phase d'un seul qubit donné par un paramètre d'amortissement de phase :math:`\gamma`
id_id: Sebuah channel phase damping error qubit tunggal yang diberikan oleh parameter phase damping :math:` \gamma `
ja: :math:`\gamma` によって与えられた単一量子ビットの位相減衰誤差チャネル
ko_kr: 위상 감쇠 매개 변수 :math:`\gamma` 이 제공하는 단일 큐비트 위상 감쇠 오류 채널
pt_un: Um canal de erro de amortecimento de fase de um único qubit, dado por um parâmetro de amortecimento de fase :math:`\gamma`
ta_in: ஒரு கட்டம் அடர்த்தியான அளவுரு வழங்கிய ஒற்றை-குவிட் கட்டம் தணிக்கும் பிழை சேனல் :math:`\gamma`
tr: Bir faz sönümleme parametresi tarafından verilen tek kübitlik bir faz sönümleme hata kanalı :math:`\gamma`
zh: 一個由相位阻尼參數 :math:`\gamma` 表示的單量子位元相位阻尼誤差通道。

source: Combining quantum errors
bn_bn: কোয়ান্টাম ত্রুটির সংমিশ্রণ
es_un: Combinando errores cuánticos
fr: Combinaison d'erreurs quantiques
id_id: Menggabungkan kuantum error
ja: 量子エラーを結合する
ko_kr: 양자 오류 결합하기
pt_un: Combinando erros quânticos
ta_in: குவாண்ட் பிழையை சேமி
tr: Kuantum hataları birleştirme
zh: 結合量子誤差

source: ``QuantumError`` instances can be combined by using composition, tensor product, and tensor expansion (reversed order tensor product) to produce new ``QuantumErrors`` as:
bn_bn: ``QuantumError`` দৃষ্টান্তগুলোর (ইনস্ট্যান্স) উপর কম্পোসিশন, টেনসর গুনফল (প্রোডাক্ট) এবং টেনসর বিস্তৃতি (এক্সপ্যানশন) (বিপরীত ক্রমের টেনসর গুনফল (প্রোডাক্ট)) করে নতুন ``QuantumErrors`` তৈরী করা যায়। উদাহরণস্বরূপ:
es_un: Las instancias de ``QuantumError`` se pueden combinar utilizando composición, producto tensorial, y expansión tensorial (producto tensorial en orden invertido) para producir nuevos ``QuantumErrors`` como:
fr: Les instances de ``QuantumError`` peuvent être combinées en utilisant la composition, le produit tensoriel et l'expansion tensorielle (produit tenseur dans l'ordre inverse) pour produire de nouvelles ``QuantumErrors`` comme :
id_id: Instans ` ` QuantumError ` ` ` dapat dikombinasikan dengan menggunakan komposisi, produk tensor, dan ekspansi tensor (kebalikan dari produk tensor) untuk menghasilkan ` ` QuantumErrors ` ` baru ` seperti:
ja: ``QuantumError`` インスタンスは、コンポジション、テンソル積、テンソル拡張(逆順テンソル積) を使用して結合することで、新しい ``QuantumErrors`` を生成できます。
ko_kr: ``QuantumError`` 인스턴스는 다음과 같이 새로운 ``QuantumErrors`` 를 생성하기 위해 구성, 텐서 곱 및 텐서 확장(반전 명령 텐서 곱) 을 사용하여 결합할 수 있다.
pt_un: As instâncias de ``QuantumError`` podem ser combinadas usando a composição, o produto tensorial e a expansão tensorial (produto tensorial de ordem inversa) para produzir o novos ``QuantumErrors`` como:
ta_in: புதிய ``QuantumError`` உருவாக்க, கலவை, டென்சர் தயாரிப்பு மற்றும் டென்சர் விரிவாக்கம் (தலைகீழ் ஆர்டர் டென்சர் தயாரிப்பு) ஆகியவற்றைப் பயன்படுத்துவதன் மூலம் ``QuantumError`` நிகழ்வுகளை இணைக்கலாம்:
tr: ``QuantumError`` örnekleri, yeni ``QuantumErrors`` oluşturmak için bileşim, tensör çarpımı ve tensör genişletmesi (ters sıralı tensör çarpımı) kullanılarak birleştirilebilir:
zh: ``QuantumError`` 實例可使用組合、張量積和張量展開（反序張量積）組合產生新的 ``QuantumErrors`` ，如下所示：

source: Composition: :math:`\cal{E}(\rho)=\cal{E_2}(\cal{E_1}(\rho))` as ``error = error1.compose(error2)``
bn_bn: গঠন: :math:`\cal{E}(\rho)=\cal{E_2}(\cal{E_1}(\rho))` যেখানে ``error = error1.compose(error2)``
es_un: Composición: :math:`\cal{E}(\rho)=\cal{E_2}(\cal{E_1}(\rho))` como ``error = error1.compose(error2)``
fr: Composition : :math:`\cal{E}(\rho)=\cal{E_2}(\cal{E_1}(\rho))` comme ``error = error1.compose(error2)``
id_id: Komposisi: :math:` \cal{E}(\rho) = \cal{E_2}(\cal{E_1}(\rho)) ` sebagai ` ` ` error = error1.compose(error2) ` `
ja: 合成: :math:`\cal{E}(\rho)=\cal{E_2}(\cal{E_1}(\rho))` を ``error = error1.compose(error2)`` とする
ko_kr: 구성: :math:`\cal{E}(\rho)=\cal{E_2}(\cal{E_1}(\rho))` 을 ``error = error1.compose(error2)`` 처럼
pt_un: Composição: :math:`\cal{E}(\rho)=\cal{E_2}(\cal{E_1}(\rho))` como ``error = error1.compose(error2)``
ta_in: கலவை: :math:`\cal{E}(\rho)=\cal{E_2}(\cal{E_1}(\rho))` என ``error = error1.compose(error2)``
tr: Bileşim: :math:`\cal{E}(\rho)=\cal{E_2}(\cal{E_1}(\rho))` ``error = error1.compose(error2)`` olarak
zh: 張量積： :math:`\cal{E}（\rho） =（\cal{E_1}\otimes\cal{E_2}）（\rho）` 如同 ``error error1.tensor（error2）``

source: Tensor product: :math:`\cal{E}(\rho) =(\cal{E_1}\otimes\cal{E_2})(\rho)` as ``error error1.tensor(error2)``
bn_bn: টেনসর গুণফল (প্রোডাক্ট): :math:`\cal{E}(\rho) =(\cal{E_1}\otimes\cal{E_2})(\rho)` যেখানে ``error error1.tensor(error2)``
es_un: Producto tensorial: :math:`\cal{E}(\rho) =(\cal{E_1}\otimes\cal{E_2})(\rho)` como ``error error1.tensor(error2)``
fr: Produit tensoriel : :math:`\cal{E}(\rho) =(\cal{E_1}\otimes\cal{E_2})(\rho)` en tant que ``error error1.tensor(error2)``
id_id: Produk tensor: :math:` \cal{E}(\rho) = (\cal{E_1}\otimes\cal{E_2}) (\rho) ` sebagai ` ` ` error error1.tensor (error2) ` `
ja: テンソル積: :math:`\cal{E}(\rho) =(\cal{E_1}\otimes\cal{E_2})(\rho)` を ``error error1.tensor(error2)`` とする
ko_kr: 텐서 곱: :math:`\cal{E}(\rho) =(\cal{E_1}\otimes\cal{E_2})(\rho)` 을 ``error error1.tensor(error2)`` 처럼
pt_un: Produto tensorial: :math:`\cal{E}(\rho) =(\cal{E_1}\otimes\cal{E_2})(\rho)` como ``error error1.tensor(error2)``
ta_in: டென்சர் தயாரிப்பு: :math:`\cal{E}(\rho) =(\cal{E_1}\otimes\cal{E_2})(\rho)` என ``error error1.tensor(error2)``
tr: Tensör çarpımı: :math:`\cal{E}(\rho) =(\cal{E_1}\otimes\cal{E_2})(\rho)` ``error error1.tensor(error2)`` olarak
zh: 張量積： :math:`\cal{E}(\rho) =(\cal{E_1}\otimes\cal{E_2})(\rho)`，程式碼為 ``error error1.tensor(error2)``

source: Expand product: :math:`\cal{E}(\rho) =(\cal{E_2}\otimes\cal{E_1})(\rho)` as ``error error1.expand(error2)``
bn_bn: গুনফলের প্রসারণ: :math:`\cal{E}(\rho) =(\cal{E_2}\otimes\cal{E_1})(\rho)` যেখানে ``error error1.expand(error2)``
es_un: Producto de expansión: :math:`\cal{E}(\rho) =(\cal{E_2}\otimes\cal{E_1})(\rho)` como ``error error1.expand(error2)``
fr: Développer le produit: :math:`\cal{E}(\rho) =(\cal{E_2}\otimes\cal{E_1})(\rho)` comme ``error error1.expand(error2)``
id_id: Produk Expand: :math:` \cal{E}(\rho) = (\cal{E_2}\otimes\cal{E_1}) (\rho) ` sebagai ` ` error error1.expand (error2) ` `
ja: 逆順テンソル積: :math:`\cal{E}(\rho) =(\cal{E_2}\otimes\cal{E_1})(\rho)` を ``error 1.expand(error2)`` とする
ko_kr: 확장 곱: :math:`\cal{E}(\rho) =(\cal{E_2}\otimes\cal{E_1})(\rho)` 을 ``error error1.expand(error2)`` 처럼
pt_un: Produto de expansão: :math:`\cal{E}(\rho) =(\cal{E_2}\otimes\cal{E_1})(\rho)` as ``error error1.expand(error2)``
ta_in: தயாரிப்பு விரிவாக்கு: :math:`\cal{E}(\rho) =(\cal{E_2}\otimes\cal{E_1})(\rho)` என ``error error1.expand(error2)``
tr: Çarpımı genişlet: :math:`\cal{E}(\rho) =(\cal{E_2}\otimes\cal{E_1})(\rho)`, ``error error1.expand(error2)`` olarak
zh: 展開乘積： :math:`\cal{E}(\rho) =(\cal{E_2}\otimes\cal{E_1})(\rho)` ，程式碼為 ``error error1.expand(error2)``

source: Example
bn_bn: উদাহরণ
es_un: Ejemplo
fr: Exemple
id_id: Contoh
ja: 例
ko_kr: 예제
pt_un: Exemplo
ta_in: எடுத்துக்காட்டுகள்
tr: Örnek
zh: 範例

source: For example to construct a 5% single-qubit Bit-flip error:
bn_bn: উদাহরণস্বরূপ একটা ৫% একক কিউবিট বিট-ফ্লিপ বা মান পরিবর্তন ত্রুটি বানানো হল:
es_un: Por ejemplo para construir un error Bit-flip de 5% de un solo qubit:
fr: Par exemple, pour construire une erreur Bit-flip de 5% :
id_id: Sebagai contoh untuk membangun bit-flip error qubit tunggal 5%:
ja: 例えば、5%の単一量子ビットのビットフリップエラーを構築するには、次のようにします。
ko_kr: 예를 들어 5% 단일 큐비트 비트 플립 (Bit-flip) 오류를 구성하는 경우:
pt_un: Por exemplo para construir um erro de inversão de bit de um único qubit de 5%:
ta_in: உதாரணமாக 5 % ஒற்றை-குவிட் பிட்-புரட்டு பிழை உருவாக்க:
tr: Örneğin,%5 tek kübitlik Bit çevirme hatası oluşturmak için:
zh: 例如，若要建構 5% 的單量子位元翻轉誤差：

source: Converting to and from QuantumChannel operators
bn_bn: QuantumChannel অপারেটরে এবং অপারেটর থেকে রূপান্তর
es_un: Convertir a y desde operadores QuantumChannel
fr: Conversion vers et depuis les opérateurs QuantumChannel
id_id: Mengkonversi ke dan dari operator QuantumChannel
ja: QuantumChannel 演算子との変換
ko_kr: QuantumChannel 연산자로 (부터) 변환하기
pt_un: Convertendo para e, a partir de operadores QuantumChannel
ta_in: குவாண்டம் சேனல் ஆபரேட்டர்களிடமிருந்து மாற்றுவது
tr: QuantumChannel operatörlerine ve bu operatörlerden dönüştürme
zh: 與 QuantumChannel 運算子之間的相互轉換

source: We can also convert back and forth between ``QuantumError`` objects in Qiskit Aer and ``QuantumChannel`` objects in Qiskit Terra.
bn_bn: আমরা প্রয়োজনমতো Qiskit এয়ারের ``QuantumError`` অবজেক্ট ও Qiskit টেরার ``QuantumChannel`` অবজেক্ট রূপান্তর করতে পারি।
es_un: También podemos hacer la conversión ida y vuelta entre los objetos ``QuantumError`` en Qiskit Aer y los objetos ``QuantumChannel`` en Qiskit Terra.
fr: Nous pouvons également convertir entre les objets ``QuantumError`` dans Qiskit Aer et ``QuantumChannel`` dans Qiskit Terra.
id_id: Kita juga dapat mengkonversi bolak-balik antara objek ` ` QuantumError ` ` di Qiskit Aer dan objek ` ` QuantumChannel ` ` di Qiskit Terra.
ja: Qiskit Aer の ``QuantumError`` オブジェクトと Qiskit Terra の ``QuantumChannel`` オブジェクトの間でも行ったり来たりすることができます。
ko_kr: 우리는 또한 Qiskit Aer의 ``QuantumError`` 객체와 Qiskit Terra의 ``QuantumChannel`` 객체를 서로 전환할 수 있다.
pt_un: Podemos, também, converter em ambas as direções entre objetos ``QuantumError`` no Qiskit Aer e objetos ``QuantumChannel`` no Qiskit Terra.
ta_in: கிஸ்கிட் ஏரில் உள்ள ``QuantumError`` மற்றும் Qiskit டெர்ராவில் உள்ள ``QuantumChannel`` பொருட்களுக்கும் இடையில் நாம் முன்னும் பின்னுமாக மாற்றலாம்.
tr: Ayrıca Qiskit Aer'deki ``QuantumError`` nesneleri ile Qiskit Terra'daki ``QuantumChannel`` nesneleri arasında ileri geri dönüşüm yapabiliriz.
zh: 我們也可以在 Qiskit Aer 的 ``QuantumError`` 物件和 Qiskit Terra 的 ``QuantumChannel`` 物件之間來回轉換。

source: Readout Error
bn_bn: রিডআউট ত্রুটি
es_un: Error de lectura de salida
fr: Erreur de lecture (readout)
id_id: Error readout
ja: 読み出しエラー
ko_kr: 해독오류
pt_un: Erro de Leitura
ta_in: மறுபடியும் பிழை
tr: Okuma Hatası
zh: 讀取誤差

source: Classical readout errors are specified by a list of assignment probabilities vectors :math:`P(A|B)`:
bn_bn: ধ্রুপদী রিডআউট ত্রুটি হলো একটা মমান বন্টনের সম্ভাবনা তালিকা :math:`P(A|B)`:
es_un: Los errores de lectura clásicos se especifican con una lista de vectores de probabilidades de asignación :math:`P(A|B)`:
fr: Les erreurs de lecture classiques sont spécifiées par une liste de vecteurs de probabilités d'affectation :math:`P(A|B)` :
id_id: Error readout klasik dispesifikasikan oleh sebuah list vektor probabilitas penempatan :math:` P (A | B) `:
ja: 古典的な読み出しエラーは、代入ベクトル :math:`P(A|B)` のリストで指定されます。
ko_kr: 기존 해독 오류는 할당 확률 벡터 :math:`P(A|B)` 목록으로 지정된다.
pt_un: Erros de leitura clássicos são especificados por uma lista de vetores de probabilidade de atribuição :math:`P(A|B)`:
ta_in: ஒதுக்கீட்டு நிகழ்தகவு திசையன்களின் பட்டியலால் கிளாசிக்கல் ரீட்அவுட் பிழைகள் குறிப்பிடப்படுகின்றன :math:`P(A|B)`:
tr: Klasik okuma hataları, atama olasılıkları vektörlerinin bir listesiyle belirtilir :math:`P(A|B)`:
zh: 古典讀取誤差由一個指派機率向量 :math:`P(A|B)` 的清單給出：

source: :math:`A` is the *recorded* classical bit value
bn_bn: :math:`A` হলো ধ্রুপদী বিটের *সঞ্চিত* মান
es_un: :math:`A` es el valor de bit clásico *registrado*
fr: :math:`A` est la valeur de bit classique *enregistrée*
id_id: :math:` A ` adalah nilai bit klasik * yang direkam *
ja: :math:`A` は *記録された* 古典ビット値です。
ko_kr: :math:`A` 는 *기록된* 고전적 비트 값이다.
pt_un: :math:`A` é o valor do bit clássico *gravado*
ta_in: :math:`A` என்பது *recorded* கிளாசிக்கல் பிட் மதிப்பு
tr: :math:`A` *kaydedilen* klasik bit değeridir
zh: :math:`A` 是其 *被記錄的* 古典位元值

source: :math:`B` is the *true* bit value returned from the measurement
bn_bn: :math:`B` হলো পরিমাপ থেকে পাওয়া বিটের *আসল* মান
es_un: :math:`B` es el valor de bit *verdadero* devuelto por la medición
fr: :math:` B ` est la valeur du bit *réellement* renvoyée par la mesure
id_id: :math:` B ` adalah nilai bit * yang benar * dikembalikan dari pengukuran
ja: :math:`B` は、測定から返される *true* ビット値です。
ko_kr: :math:`B` 는 측정으로부터 반환되는 *참* 비트 값이다.
pt_un: :math:`B` é o valor *verdadeiro* do bit retornado da medição
ta_in: :math:`B` என்பது அளவீட்டிலிருந்து திரும்பிய *true* பிட் மதிப்பு
tr: :math:` B ` ölçümden döndürülen * gerçek * bit değeridir
zh: :math:`B` 是測量傳回的 *真實的* 位元值

source: E.g. for 1 qubits: $ P(A|B) = [P(A|0), P(A|1)]$.
bn_bn: উদাহরণস্বরূপ একটা কিউবিটের ক্ষেত্রে: $ P(A|B) = [P(A|0), P(A|1)]$।
es_un: Por ejemplo para 1 qubit: $ P(A|B) = [P(A|0), P(A|1)]$.
fr: Par exemple, pour 1 qubit : $ P(A|B) = [P(A|0), P(A|1)]$.
id_id: Misalnya untuk 1 qubit: $P (A | B) = [P (A | 0), P (A | 1)] $.
ja: 例えば 1 量子ビットの場合: $ P(A\|B) = [P(A\|0), P(A\|1)]$
ko_kr: 예를 들어, 1 큐비트는: $ P(A|B) = [P(A|0), P(A|1)]$.
pt_un: Por exemplo, para 1 qubit: $ P(A|B) = [P(A|0), P(A|1)]$.
ta_in: எ.கா. 1 குவிட்டுகளுக்கு: $ P (A | B) = [P (A | 0), P (A | 1)] $.
tr: Örneğin 1 kübit için: $ P(A|B) = [P(A|0), P(A|1)]$.
zh: 例如，對於 1 量子位元: $ P(A|B) = [P(A|0), P(A|1)]$。

source: Readout errors may also be combined using ``compose``, ``tensor`` and ``expand`` like with quantum errors.
bn_bn: রিডআউট ত্রুটিও কোয়ান্টাম ত্রুটির মতো ``compose``, ``tensor`` এবং ``expand`` ব্যবহার করে একত্রিত করা যায়।
es_un: Los errores de lectura también se pueden combinar utilizando ``compose``, ``tensor`` y ``expand`` como con los errores cuánticos.
fr: Les erreurs de lecture peuvent également être combinées en utilisant ``compose``, ``tensor`` et ``expand`` comme avec des erreurs quantiques.
id_id: Error readout juga dapat dikombinasikan dengan menggunakan ` ` compose ` `, ` ` tensor ` ` dan ` ` expand ` ` sama dengan error kuantum.
ja: 読み出しエラーは ``compose``, ``tensor`` と ``expand`` を量子エラーと同様に組み合わせることもできます。
ko_kr: 해독 오류들은 양자 오류와 마찬가지로 ``compose``, ``tensor`` 및 ``expand`` 을 사용하여 결합 될 수 있다.
pt_un: Erros de leitura também podem ser combinados usando: ``compose``, ``tensor`` e ``expand``, como com os erros quânticos.
ta_in: குவாண்டம் பிழைகள் போன்ற ``compose``, ``tensor`` மற்றும் ``expand`` ஆகியவற்றைப் பயன்படுத்தி வாசிப்பு பிழைகள் இணைக்கப்படலாம்.
tr: Okuma hataları, kuantum hatalarında olduğu gibi ``compose``, ``tensor`` ve ``expand``kullanılarak da birleştirilebilir.
zh: 如同處理量子誤差一樣，通過使用 ``compose``、``tensor``，以及 ``expand``，我們也可以組合讀取誤差。

source: Adding errors to a Noise Model
bn_bn: ত্রুটি নকশায় ত্রুটি যোগ করা
es_un: Agregar errores a un Modelo de Ruido
fr: Ajouter des erreurs à un modèle de bruit
id_id: Menambahkan error pada satu Model Noise
ja: ノイズモデルにエラーを追加する
ko_kr: 잡음 모델에 오류 추가하기
pt_un: Adicionando erros a um modelo de ruído
ta_in: சத்தம் மாதிரியில் பிழைகளைச் சேர்த்தல்
tr: Gürültü Modeline hata ekleme
zh: 新增誤差至雜訊模型

source: When adding a quantum error to a noise model we must specify the type of *instruction* that it acts on, and what qubits to apply it to. There are three cases for Quantum Errors:
es_un: Cuando agregamos un error cuántico a un modelo de ruido, debemos especificar el tipo de *instrucción* en el que actúa, y a qué qubits va a aplicarlo. Hay tres casos para Errores Cuánticos:
id_id: Ketika menambahkan error kuantum pada model noise kita harus menentukan tipe dari * instruksi * yang bertindak pada, dan qubit apa yang dipengaruhi. Ada tiga kasus untuk Quantum Errors:
ko_kr: 노이즈 모델에 양자 오류를 추가할 때, 우리는 그것이 작용하는 *명령어* 의 유형과 그것을 적용할 큐비트를 지정해야 한다. 양자 오류에는 세 가지 경우가 있다.
ta_in: இரைச்சல் மாதிரியில் ஒரு குவாண்டம் பிழையைச் சேர்க்கும்போது, அது செயல்படும் * அறிவுறுத்தல் * வகையையும், அதைப் பயன்படுத்துவதற்கு என்ன வினவல்களையும் குறிப்பிட வேண்டும். குவாண்டம் பிழைகளுக்கு மூன்று வழக்குகள் உள்ளன:

source: All-qubit quantum error
bn_bn: সমস্ত কিউবিট কোয়ান্টাম ত্রুটি
es_un: Error cuántico de todos los qubits
fr: Erreur quantique tout-qubit
id_id: Error kuantum semua-qubit
ja: すべての量子ビットが量子エラー
ko_kr: 모든 큐비트 양자 오류
pt_un: Erro quântico em todos qubits
ta_in: அனைத்து-விகிதமான குவாண்ட் பிழை
tr: Tüm-kübit kuantum hatası
zh: 全量子位元的量子誤差

source: Specific qubit quantum error
bn_bn: নির্দিষ্ট কিউবিট কোয়ান্টাম ত্রুটি
es_un: Error cuántico de qubit específico
fr: Erreur quantique spécifique par qubit
id_id: Error kuantum qubit spesifik
ja: 特定量子ビットが量子エラー
ko_kr: 특정 큐비트 양자 오류
pt_un: Erro quântico de qubit específico
ta_in: குறிப்பிட்ட குறும்பட குவாண்ட் பிழை
tr: Belirli kübit kuantum hatası
zh: 特定量子位元的量子誤差

source: Non-local quantum error
es_un: Error cuántico no local
id_id: Error kuantum non-lokal
ko_kr: 비국소적 양자 오류
ta_in: உள்ளூர் அல்லாத குவாண்டம் பிழை

source: This applies the same error to any occurrence of an instruction, regardless of which qubits it acts on.
bn_bn: এটা একই ত্রুটি একটা নির্দিষ্ট নির্দেশের সব ক্ষেত্রে সব কিউবিটের উপর কাজ করবে।
es_un: Esto aplica el mismo error a cualquier ocurrencia de una instrucción, independientemente de los qubits en los que actúa.
fr: Cela applique la même erreur à toute occurrence d'une instruction, indépendamment du qubits sur lequel elle agit.
id_id: Ini mengaplikasikan error yang sama untuk setiap instruksi, terlepas dari qubit mana itu diaplikasikan.
ja: これは、どの量子ビットに作用するかにかかわらず、どのような命令の発生にも同じエラーを適用します。
ko_kr: 이는 어떠한 명령어의 발생에 어떤 큐비트에 동작하는것과 관계없이 동일한 오류를 적용한다.
pt_un: Isto aplica o mesmo erro, para qualquer ocorrência de uma instrução, independentemente, de quais qubits ele atua.
ta_in: ஒரு அறிவுறுத்தலின் எந்தவொரு நிகழ்விற்கும் இது அதே பிழையைப் பொருத்துகிறது, இது எந்த வினாடிகளில் செயல்படுகிறது என்பதைப் பொருட்படுத்தாமல்.
tr: Bu, aynı hatayı, hangi kübitlere etki ettiğinden bağımsız olarak bir talimatın herhangi bir oluşumuna uygular.
zh: 這會對任何有指令的地方套用相同的誤差，不管作用在哪一個量子位元上。

source: It is added as ``noise_model.add_all_qubit_quantum_error(error, instructions)``:
bn_bn: এটা যোগ করতে হলে ``noise_model.add_all_qubit_quantum_error(error, instructions)``:
es_un: Se agrega como ``noise_model.add_all_qubit_quantum_error(error, instructions)``:
fr: Il est ajouté sous la forme ``noise_model.add_all_qubit_quantum_error(erreo, instructions) ``:
id_id: Ini ditambahkan sebagai ` `noise_model.add_all_qubit_quantum_error (error, instructions) ` `:
ja: ``noise_model.add_all_qubit_quantum_error(error, instructions)`` として追加されます。
ko_kr: 이것은 ``noise_model.add_all_qubit_quantum_error(error, instructions)`` 로 추가된다.
pt_un: Ele é adicionado como ``noise_model.add_all_qubit_quantum_error(error, instructions)``:
ta_in: இது ``noise_model.add_all_qubit_quantum_error(error, instructions)``:
tr: ``noise_model.add_all_qubit_quantum_error(error, instructions)`` olarak eklenir:
zh: 可用 ``noise_model.add_all_qubit_quantum_error(error, instructions)``將它加入程式:

source: This applies the error to any occurrence of an instruction acting on a specified list of qubits. Note that the order of the qubit matters: For a 2-qubit gate an error applied to qubits [0, 1] is different to one applied to qubits [1, 0] for example.
bn_bn: এটা কোনো নির্দেশনার সকল ক্ষেত্রে কাজ করে, কিন্তু কোন কোন কিউবিটের উপর কাজ করবে সেটা প্রদত্ত কিউবিটের তালিকার উপর নির্ভর করে। মনে রাখতে হবে কিউবিটের ক্রম ঠিক রাখতে হবে, অর্থাৎ একটা ২-কিউবিট যুক্তিবর্তনীতে (গেইট) [০, ১] কিউবিটে ত্রুটি যোগ করা এবং [১, ০] কিউবিটে ত্রুটি যোগ করা এক নয়। উদাহরণস্বরূপ:
es_un: Esto aplica el error a cualquier ocurrencia de una instrucción que actúe en una lista específica de qubits. Nota que el orden de los qubits importa: Para una compuerta de 2 qubits, un error aplicado a los qubits [0, 1] es diferente a uno aplicado a los qubits [1, 0], por ejemplo.
fr: Ceci applique l'erreur à toute occurrence d'une instruction agissant sur une liste de qubits spécifiée. Notez que l'ordre des qubits a une importance : pour une grille 2-qubits, une erreur appliquée aux qubits [0, 1] est différente de celle appliquée aux qubits [1, 0] par exemple.
id_id: Ini menerapkan error pada setiap instruksi yang bertindak pada daftar qubits yang telah ditentukan. Perhatikan bahwa urutan qubit penting: Untuk sebuah gate 2-qubit sebuah error diterapkan untuk qubits [0, 1] berbeda dengan yang diterapkan untuk qubits [1, 0] misalnya.
ja: これは、指定された量子ビットのリスト上で動作する命令の発生にエラーが適用されます。 量子ビットの順序が重要であることに注意してください: 2 量子ビットゲートの場合、量子ビット [0, 1] に適用されるエラーは量子ビット [1, 0] に適用されるものとは異なります。
ko_kr: 이 오류는 지정된 큐비트 목록에 작용하는 명령어의 발생에 적용된다. 큐비트 순서가 중요하다. 2-큐비트 게이트의 경우, 큐비트 [0, 1] 에 적용되는 오류는 예를 들어 큐비트 [1, 0] 에 적용되는 오류와는 다르다.
pt_un: Isto aplica o erro, a qualquer ocorrência de uma instrução atuando em uma lista especificada de qubits. Observe que a ordem dos qubits importa: Para uma porta de 2 qubits um erro aplicado aos qubits [0, 1] é diferente de um aplicado aos qubits [1 0] por exemplo.
ta_in: குறிப்பிட்ட வினாடிகளின் பட்டியலில் செயல்படும் அறிவுறுத்தலின் ஏதேனும் நிகழ்வுக்கு இது பிழையைப் பொருத்துகிறது. குவிட்டின் வரிசை முக்கியமானது என்பதை நினைவில் கொள்க: 2-குவிட் வாயிலுக்கு குவிட்ஸ் [0, 1] இல் பயன்படுத்தப்படும் பிழை, எடுத்துக்காட்டாக, குவிட்ஸ் [1, 0] க்கு பயன்படுத்தப்படும் ஒன்றுக்கு வேறுபட்டது.
tr: Bu, belirli bir kübit listesindeki yönergelerin herhangi bir oluşumuna ilişkin hatayı uygular. Kübitlerin sırasının önemli olduğunu unutmayın: 2 kübitlik bir geçit için [ 0, 1] kübitlerine uygulanacak bir hatanın, örneğin [ 1, 0] kübitlerine uygulanacak bir hatadan farklı olacağını unutmayın.
zh: 這會將誤差套用至每個在指定的量子位元清單上執行的指令發生的當下。 請注意， 量子位元的排序很重要：對於一個二量子位元閘 ，套用至量子位元 [0, 1] 的誤差，與套用至量子位元 [1, 0] 的誤差不同。
