Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/simulators/3_building_noise_models.po
Languages: bn_bn, es_un, fr, id_id, ja, ko_kr, pt_un, ta_in, tr, zh

source: It is added as ``noise_model.add_quantum_error(error, instructions, qubits)``:
bn_bn: এটা যোগ করতে হলে ``noise_model.add_quantum_error(error, instructions, qubits)``:
es_un: Se agrega como ``noise_model.add_quantum_error(error, instructions, qubits)``:
fr: Il est ajouté sous la forme ``noise_model.add_quantum_error (error, instructions, qubits)``:
id_id: Ini ditambahkan sebagai ` `noise_model.add_quantum_error (error, instructions, qubits) ` `:
ja: ``noise_model.add_quantum_error(error, instructions, qubits)`` として追加されます。
ko_kr: 이것은 ``noise_model.add_quantum_error(error, instructions, qubits)`` 로 추가된다.
pt_un: É adicionado como ``noise_model.add_quantum_error(error, instructions, qubits)``:
ta_in: இது ``noise_model.add_quantum_error(error, instructions, qubits)``:
tr: ``noise_model.add_quantum_error(error, instructions, qubits)`` olarak eklenir:
zh: 可用 ``noise_model.add_quantum_error(error, instructions, qubits)``將它加入程式:

source: Non-local qubit quantum error
es_un: Error cuántico de qubit no local
id_id: Error kuantum qubit non-lokal
ko_kr: 비국소적 큐비트 양자 오류
ta_in: உள்ளூர் அல்லாத குவிட் குவாண்டம் பிழை

source: This applies an error to a specific set of noise qubits after any occurrence of an instruction acting on a specific of gate qubits.
es_un: Esto aplica un error a un conjunto específico de qubits de ruido después de cualquier ocurrencia de una instrucción que actúa sobre qubits específicos de compuerta.
id_id: Ini menerapkan error pada satu set tertentu dari noise qubits setelah aplikasi suatu instruksi yang bertindak pada gate qubits spesifik.
ko_kr: 이는 특정 게이트 큐비트에 작동하는 모든 명령어 이후에 특정 잡음 큐비트에 오류를 적용한다.
ta_in: ஒரு குறிப்பிட்ட கேட் குவிட்களில் செயல்படும் ஒரு அறிவுறுத்தலின் ஏதேனும் நிகழ்வுக்குப் பிறகு இது ஒரு குறிப்பிட்ட சத்தம் குவிட்டுகளுக்கு ஒரு பிழையைப் பொருத்துகிறது.

source: It is added as ``noise_model.add_nonlocal_quantum_error(error, instructions, instr_qubits, error_qubits)``:
es_un: Se agrega como ``noise_model.add_nonlocal_quantum_error(error, instructions, instr_qubits, error_qubits)``:
ko_kr: ``noise_model.add_nonlocal_quantum_error(error, instructions, instr_qubits, error_qubits)`` 로 더해진다:
ta_in: இது ``noise_model.add_quantum_error(error, instructions, instr_qubits, error_qubits)`` என்று சேர்க்கப்பட்டுள்ளது:

source: Executing a noisy simulation with a noise model
bn_bn: একটা ত্রুটিপূর্ণ সিমুলেশন একটা ত্রুটি নকশার সাথে চালানো
es_un: Ejecutar una simulación ruidosa con un modelo de ruido
fr: Exécution d'une simulation bruitée avec un modèle de bruit
id_id: Melakukan simulasi noise dengan model noise
ja: ノイズモデルでノイズがあるシミュレーションを実行する
ko_kr: 잡음을 포함한 노이즈 모델 시뮬이션 실행하기
pt_un: Executando uma simulação ruidosa com um modelo de ruído
ta_in: சத்தம் மாதிரியுடன் சத்தமில்லாத உருவகப்படுத்துதலை செயல்படுத்துகிறது
tr: Bir gürültü modeli ile gürültülü bir simülasyon yürütmek
zh: 使用雜訊模型執行雜訊模擬

source: The command ``AerSimulator(noise_model=noise_model)`` returns a simulator configured to the given noise model. In addition to setting the simulator’s noise model, it also overrides the simulator’s basis gates, according to the gates of the noise model.
es_un: El comando ``AerSimulator(noise_model=noise_model)`` devuelve un simulador configurado para el modelo de ruido dado. Además de configurar el modelo de ruido del simulador, también anula las compuertas base del simulador, de acuerdo con las compuertas del modelo de ruido.
fr: La commande ``AerSimulator(noise_model=noise_model)`` renvoie un simulateur configuré pour le modèle de bruit donné. En plus de définir le modèle de bruit du simulateur, il remplace également les portes de base du simulateur, en fonction des portes du modèle de bruit.
ko_kr: ``Aer Simulator(noise_model=noise_model)`` 명령은 지정된 노이즈 모델에 구성된 시뮬레이터를 반환한다. 잡음 모델의 게이트에 따라 시뮬레이터의 기본 게이트를 대체할 뿐만 아니라 잡음 모델의 게이트에 따라 잡음 모델의 기본 게이트도 무시된다.
ta_in: ``AerSimulator(noise_model=noise_model)`` கட்டளை கொடுக்கப்பட்ட இரைச்சல் மாதிரியில் கட்டமைக்கப்பட்ட ஒரு சிமுலேட்டரை வழங்குகிறது. சிமுலேட்டரின் இரைச்சல் மாதிரியை அமைப்பதோடு மட்டுமல்லாமல், இரைச்சல் மாதிரியின் வாயில்களின்படி, இது சிமுலேட்டரின் அடிப்படை வாயில்களையும் மீறுகிறது.

source: Noise Model Examples
bn_bn: ত্রুটি নকশার উদাহরণ
es_un: Ejemplos de Modelos de Ruido
fr: Exemples de modèles de bruit
id_id: Contoh Model Noise
ja: ノイズモデルの例
ko_kr: 노이즈 모델 실시예
pt_un: Exemplos de Modelo de Ruído
ta_in: சத்தம் மாதிரி எடுத்துக்காட்டுகள்
tr: Gürültü Modeli Örnekleri
zh: 雜訊模型範例

source: We will now give some examples of noise models. For our demonstrations we will use a simple test circuit generating a n-qubit GHZ state:
bn_bn: আমরা এবার কিছু ত্রুটি নকশার উদাহরণ দেব। প্রদর্শনের জন্য আমরা একটা বর্তনী নেবো যেটা একটা n-কিউবিট GHZ অবস্থা বানাবে:
es_un: Ahora daremos algunos ejemplos de modelos de ruido. Para nuestras demostraciones utilizaremos un circuito de prueba simple que genera un estado GHZ de n qubits:
fr: Nous allons maintenant donner quelques exemples de modèles de bruit. Pour nos démonstrations, nous utiliserons un circuit de test simple générant un état GHZ à n-qubits :
id_id: Kita sekarang akan memberikan beberapa contoh model noise. Untuk demonstrasi, kita akan menggunakan sebuah sirkuit uji sederhana yang menghasilkan sebuah state n-qubit GHZ:
ja: ここでは、ノイズモデルの例をいくつか紹介します。デモでは、n量子GHZ状態を生成する単純なテスト回路を使用します。
ko_kr: 이제 소음 모델의 몇 가지 예를 들어 보겠다. 시연을 위해 큐비트 GHZ 상태를 생성하는 간단한 테스트 회로를 사용할 것이다.
pt_un: Vamos, agora, dar alguns exemplos de modelos de ruído. Para as nossas demonstrações, utilizaremos um circuito de teste simples, gerando um estado GHZ de n qubits:
ta_in: இரைச்சல் மாதிரிகளின் சில எடுத்துக்காட்டுகளை இப்போது தருவோம். எங்கள் ஆர்ப்பாட்டங்களுக்கு, n-qubit GHZ நிலையை உருவாக்கும் எளிய சோதனை சுற்றுகளைப் பயன்படுத்துவோம்:
tr: Şimdi gürültü modellerine birkaç örnek vereceğiz. Gösterimlerimiz için n-kübitlik GHZ durumu üreten basit bir test devresi kullanacağız:
zh: 我們現在會舉出一些雜訊模型的例子。 我們將使用一個可以產生一個 n 個量子位元 GHZ 狀態的簡單測試電路來演示:

source: Ideal Simulation
bn_bn: আদর্শ সিমুলেশন
es_un: Simulación Ideal
fr: Simulation idéale
id_id: Simulasi Ideal
ja: 理想的なシミュレーション
ko_kr: 적합한 시뮬레이션
pt_un: Simulação Ideal
ta_in: சிறந்த உருவகப்படுத்துதல்
tr: İdeal Simülasyon
zh: 理想模擬

source: Noise Example 1: Basic bit-flip error noise model
bn_bn: উদাহরণ ১: সাধারণ বিট অদলবদল ত্রুটি নকশা
es_un: Ejemplo de Ruido 1: Modelo básico de ruido de error de cambio de bit
fr: Exemple de bruit 1 : modèle basique de bruit pour des erreurs de type bit-flip
id_id: Contoh Noise 1: Bit-flip error noise model dasar
ja: ノイズの例1: 基本ビットフリップエラーノイズモデル
ko_kr: 노이즈 예 1: 기본 비트-플립 오류 노이즈 모델
pt_un: Exemplo de Ruído 1: Modelo básico de ruído de erro de inversão de bit
ta_in: சத்தம் எடுத்துக்காட்டு 1: அடிப்படை பிட்-ஃபிளிப் பிழை சத்தம் மாதிரி
tr: Gürültü Örneği 1: Temel bit-çevirme hatası gürültü modeli
zh: 雜訊範例 1：基本位元翻轉誤差雜訊模型

source: Lets consider a simple toy noise model example common in quantum information theory research:
bn_bn: কোয়ান্টাম তথ্য তত্ত্ব গবেষণার একটা সাধারণ ত্রুটি নকশাকে উদাহরণরূপে নেওয়া যাক:
es_un: Consideremos un modelo de ruido de juguete simple común en investigación de teoría de información cuántica:
fr: Considérons un exemple simple de modèle réduit de bruit habituellement rencontré dans la recherche de la théorie de l'information quantique :
id_id: Mari lihat contoh model noise mainan sederhana yang populer di penelitian teori informasi kuantum:
ja: 量子情報理論の研究で一般的なおもちゃノイズモデルの例を考えてみましょう。
ko_kr: 양자 정보 이론 연구에서 흔히 볼 수 있는 간단한 장난감 소음 모델 예를 생각해 보자.
pt_un: Vamos considerar um simples exemplo de modelo de ruído de brinquedo comum na pesquisa de teoria da informação quântica:
ta_in: குவாண்டம் தகவல் கோட்பாடு ஆராய்ச்சியில் பொதுவான ஒரு எளிய பொம்மை சத்தம் மாதிரி உதாரணத்தைக் கருத்தில் கொள்வோம்:
tr: Kuantum bilgi teorisi araştırmalarında yaygın olan basit bir canlandırma gürültü modeli örneğini ele alalım:
zh: 讓我們考慮一個在量子信息理論研究中常見的簡單玩具雜訊模型示例：

source: When applying a single qubit gate, flip the state of the qubit with probability ``p_gate1``.
bn_bn: যখন একক কিউবিট যুক্তিবর্তনীতে (গেইট) ব্যবহার হয়, কিউবিটের মান বদলের সম্ভাবনা ``p_gate1``।
es_un: Al aplicar una compuerta de un solo qubit, invierte el estado del qubit con probabilidad ``p_gate1``.
fr: Lors de l'application d'une porte sur un seul qubit, l'état du qubit a une probabilité ``p_gate1`` de flipper.
id_id: Ketika menerapkan sebuah gate qubit tunggal, flip state dari qubit dengan probabilitas ` ` p_gate1 ` `.
ja: 単一量子ビットゲートを適用する場合は、確率 ``p_gate1`` で 量子ビットの状態を反転します。
ko_kr: 단일 큐비트 게이트를 적용할 때 큐비트 상태를 확률 ``p_gate1`` 로 뒤집는다.
pt_un: Ao aplicar uma porta de um único qubit, inverte o estado do qubit com probabilidade ``p_gate1``.
ta_in: ஒற்றை குவிட் வாயிலைப் பயன்படுத்தும்போது, `` p_gate1`` நிகழ்தகவுடன் குவிட்டின் நிலையை புரட்டவும்.
tr: Tek bir kübit kapısı uygularken, kübitin durumunu ``p_gate1`` olasılığıyla çevirin.
zh: 套用單一量子位元閘時， 其量子位元的狀態被翻轉的機率為 ``p_gatew1``。

source: When applying a 2-qubit gate apply single-qubit errors to each qubit.
bn_bn: ২-কিউবিটসম্পন্ন যুক্তিবর্তনীতে (গেইট) প্রয়োগের সময় প্রত্যেক কিউবিটে একক কিউবিট ত্রুটি প্রয়োগ করা হয়।
es_un: Al aplicar una compuerta de 2 qubits aplica los errores de un solo qubit a cada qubit.
fr: Lors de l'application d'une porte à 2 qubits, les erreurs de type qubit seul s'appliquent à chaque qubit.
id_id: Ketika menerapkan sebuah gate 2-qubit terapkan error satu qubit untuk setiap qubit.
ja: 2量子ビットゲートを適用する場合、各量子ビットに単一量子ビットエラーを適用します。
ko_kr: 2-큐비트 게이트를 적용하는 것이 단일 큐비트 오류를 각 큐비트에 적용하는 경우.
pt_un: Ao aplicar uma porta de 2 qubits, aplica erros de um único qubit para cada qubit.
ta_in: 2-குவிட் வாயிலைப் பயன்படுத்தும்போது ஒவ்வொரு குவிட்டிற்கும் ஒற்றை-குவிட் பிழைகளைப் பயன்படுத்துங்கள்.
tr: 2 kübitlik bir kapı uygularken, her kübite tek-kübitlik hatalar uygulayın.
zh: 當套用二量子位元閘時，將單一量子位元誤差套用至每一個量子位元。

source: When resetting a qubit reset to 1 instead of 0 with probability ``p_reset``.
bn_bn: যখন একটা কিউবিট ``p_reset`` সম্ভাবনায় ০ এর বদলে ১ এ রিসেট বা পুনঃস্থাপন করতে হয়।
es_un: Al restablecer un qubit este se reinicia a 1 en lugar de 0 con probabilidad ``p_reset``.
fr: Lors de la réinitialisation d'un qubit, il a la probabilité de se trouver dans l'état 1au lieu de 0 avec la probabilité ``p_reset``.
id_id: Ketika mereset, reset qubit ke 1 bukan 0 dengan probabilitas ` ` ` p_reset ` `.
ja: 量子ビットを確率 ``p_reset`` で0ではなく1にリセットする場合。
ko_kr: 큐비트 재설정을 0이 아닌 1로 확률 ``p_reset`` 로 재설정하는 경우.
pt_un: Ao resetar um qubit, faça-o para 1 em vez de 0 com probabilidade ``p_reset``.
ta_in: நிகழ்தகவு `` p_reset`` உடன் 0 க்கு பதிலாக 1 க்கு ஒரு குவிட் மீட்டமைப்பை மீட்டமைக்கும்போது.
tr: Bir kübit sıfırlanırken ``p_reset`` olasılığı ile 0 yerine 1'e sıfırlanır.
zh: 當重設量子位元為 1 而非 0 時，發生機率為 `` p_reset``。

source: When measuring a qubit, flip the state of the qubit with probability ``p_meas``.
bn_bn: কিউবিট পরিমাপকালীন কিউবিটের অবস্থা ``p_meas`` সম্ভাবনায় পরিবর্তন করা হয়।
es_un: Al medir un qubit, invierte el estado del qubit con probabilidad ``p_meas``.
fr: Lors de la mesure d'un qubit, l'état du qubit flippe avec la probabilité ``p_meas``.
id_id: Ketika mengukur sebuah qubit, flip state dari qubit dengan probabilitas ` ` p_meas ` `.
ja: 量子ビットを測定する時に、確率 ``p_meas`` で量子ビットの状態を反転させます。
ko_kr: 큐비트를 측정할때 큐비트의 상태를 확률 ``p_meas`` 로 뒤집는다.
pt_un: Ao medir um qubit, inverte o estado do qubit com probabilidade ``p_meas``.
ta_in: ஒரு குவிட்டை அளவிடும்போது, `` p_meas`` நிகழ்தகவுடன் குவிட்டின் நிலையை புரட்டவும்.
tr: Bir kübiti ölçerken, kübitin durumunu ``p_meas`` olasılığıyla çevirin.
zh: 套用單一量子門時，將位元的狀態翻轉為機率為 ``p_gatew1``的狀態。

source: Executing the noisy simulation
bn_bn: ত্রুটিপূর্ণ সিমুলেশন চালানো
es_un: Ejecutar la simulación ruidosa
fr: Exécution de la simulation bruitée
id_id: Mengeksekusi simulasi bernoise
ja: ノイズがあるシミュレーションの実行
ko_kr: 노이즈 시뮬레이션 실행하기
pt_un: Executando a simulação de ruído
ta_in: சத்தமில்லாத உருவகப்படுத்துதலை செயல்படுத்துகிறது
tr: Gürültülü simülasyonu yürütme
zh: 執行具有雜訊的模擬

source: Example 2: T1/T2 thermal relaxation
bn_bn: উদাহরণ ২: T1/T2 তাপীয় শিথিলকরণ (রিলাক্সেশন)
es_un: Ejemplo 2: Relajación térmica T1/T2
fr: Exemple 2 : relaxation thermique T1/T2
id_id: Contoh 2: Relaksasi Termal T1/T2
ja: 例2: T1/T2 熱緩和
ko_kr: 실시예 2: T1/T2열 완화
pt_un: Exemplo 2: relaxamento térmico T1/T2
ta_in: எடுத்துக்காட்டு 2: T1/T2 வெப்ப தளர்வு
tr: Örnek 2: T1/T2 ısıl gevşeme
zh: 範例 2： T1/T2 熱弛緩

source: Now consider a more realistic error model based on thermal relaxation with the qubit environment: \* Each qubit is parameterized by a thermal relaxation time constant :math:`T_1` and a dephasing time constant :math:`T_2`. \* Note that we must have :math:`T_2 \le 2 T_1`. \* Error rates on instructions are determined by gate times and qubit :math:`T_1`, :math:`T_2` values.
bn_bn: এবার তাপীয় শিথিলকরণ (রিলাক্সেশন) উপর নির্ভর করে কিউবিট কর্মপরিবেশে একটা বাস্তব ত্রুটি নকশা নিয়ে ভাবা যাক: \* প্রত্যেক কিউবিটে প্যারামিটাররূপে একটা তাপীয় শিথিলকরণ (রিলাক্সেশন) সময় ধ্রুবক :math:`T_1` এবং একটা অবসন্ন সময় ধ্রুবক :math:`T_2` দিতে হবে। \* মনে রাখতে হবে :math:`T_2 \le 2 T_1`। \* নির্দেশনায় ত্রুটির হার যুক্তিবর্তনী (গেইট) সময় ও কিউবিট :math:`T_1`, :math:`T_2` মানের উপর নির্ভরশীল।
es_un: Ahora considera un modelo de error más realista basado en la relajación térmica con el entorno de qubit: \* Cada qubit está parametrizado por una constante de tiempo de relajación térmica :math:`T_1` y una constante de tiempo de desfase :math:`T_2`. \* Ten en cuenta que debemos tener :math:`T_2 \le 2 T_1`. \* Las tasas de error en las instrucciones están determinadas por los tiempos de compuerta y los valores de qubit :math:`T_1`, :math:`T_2`.
fr: Maintenant, considérez un modèle d'erreur plus réaliste basé sur la relaxation thermique avec l'environnement qubit: \* Chaque qubit est paramétré par une constante de temps de relaxation thermique :math:`T_1` et une constante de temps de déphasage :math:`T_2`. \* Notez que nous devons avoir :math:`T_2 \le 2 T_1`. \* Les taux d'erreur sur les instructions sont déterminés par les temps de portail et les valeurs de qubit :math:`T_1`, :math:`T_2`.
id_id: Sekarang pertimbangkan sebuah model error yang lebih realistis berdasarkan pada relaksasi termal dengan lingkungan qubit: \ * Setiap qubit dapat diparameterisasi oleh konstanta waktu relaksasi termal :math:` T_1 ` dan konstanta waktu dephasing :math:` T_2 `. \ * Perhatikan bahwa kita harus memiliki :math:` T_2 \le 2 T_1 `. \ * Tingkat error pada instruksi ditentukan oleh waktu gate dan nilai :math:` T_1 `, :math:` T_2 ` dari qubit.
ja: 熱緩和ベースのより現実的なエラーモデルを考えてみます。次の量子ビット環境を考えます: \* 各量子ビットが熱緩和時間定数 :math:`T_1` と脱位相(dephasing) 時間定数 :math:`T_2` でパラメータ化されるとします。 \* :math:`T_2 \le 2 T_1` である必要があることに注意してください。 \* 命令のエラー率はゲート時間と量子ビットの :math:`T_1`, :math:`T_2` の値によって決められます。
ko_kr: 이제 큐비트 환경에서 열 완화를 기반으로 한 보다 현실적인 오류 모델을 생각해 보자. \* 각 큐비트는 열 완화 시간 상수 :math:`T_1` 와 위상이완 시간 상수 :math:`T_2` 에 의해 매개 변수화된다. \* 우리는 :math:`T_2 \le 2 T_1` 를 가지고 있어야만 한다. \* 명령어의 착오율은 게이트 시간과 큐비트인 :math:`T_1`, :math:`T_2` 값에 의해 결정된다.
pt_un: Agora, considere um modelo de erro mais realista, baseado na relaxação térmica com o ambiente do qubit: \* Cada qubit é parametrizado por uma constante de tempo de relaxação térmica :math:`T_1` e uma constante de tempo de desfasagem :math:`T_2`. \* Observe que devemos ter :math:`T_2 \le 2 T_1`. \* As taxas de erro nas instruções são determinadas pelos tempos de porta e pelos valores :math:`T_1`, :math:`T_2` do qubit.
ta_in: இப்போது குவிட் சூழலுடன் வெப்ப தளர்த்தலை அடிப்படையாகக் கொண்ட மிகவும் யதார்த்தமான பிழை மாதிரியைக் கவனியுங்கள்: \ * ஒவ்வொரு குவிட்டும் வெப்ப தளர்வு நேர மாறிலி மூலம் அளவுருவாக்கப்படுகிறது :math:`T_1` மற்றும் ஒரு குறைக்கும் நேர மாறிலி :math:` T_2`. \ * நம்மிடம் இருக்க வேண்டும் என்பதை நினைவில் கொள்க :math:`T_2 \ le 2 T_1`. Instructions * அறிவுறுத்தல்களின் பிழை விகிதங்கள் கேட் நேரங்கள் மற்றும் குவிட் ஆகியவற்றால் தீர்மானிக்கப்படுகின்றன :math:`T_1` ,:math:` T_2` மதிப்புகள்.
tr: Şimdi, kübit ortamıyla termal gevşemeye dayalı daha gerçekçi bir hata modeli düşünün: \* Her kübit, bir termal gevşeme zaman sabiti :math:`T_1` ve bir defazing zaman sabiti :math:`T_2` ile parametrelendirilir. \* :math:`T_2 \le 2 T_1` olması gerektiğine dikkat edin. \* Komutlardaki hata oranları geçit süreleri ve kübit :math:`T_1`, :math:`T_2` değerleri ile belirlenir.
zh: 現在，請根據與位元環境的熱放鬆來考量更真實的錯誤模型： \* 每一個位元都是由熱放鬆時間常數 :math:`T_1` 和解除階段時間常數 :math:`T_2`。 \ * 請注意，我們必須具有 :math:`T_2 \le 2 T_1`。 \* 指示的錯誤率是由閘時間及位元 :math:`T_1`， :math:`T_2` 值決定。

source: When adding a quantum error to a noise model we must specify the type of *instruction* that it acts on, and what qubits to apply it to. There are two cases for Quantum Errors:
fr: Lors de l'ajout d'une erreur quantique à un modèle de bruit, nous devons spécifier le type d'*instruction* sur lequel il agit, et à quels qubits l'appliquer. Il y a deux cas pour les erreurs quantiques :
ja: ノイズモデルに量子エラーを追加する場合、作用させる *命令* のタイプとどの量子ビットに適用するのかを指定する必要があります。量子エラーには2つのケースがあります:
tr: Bir gürültü modeline kuantum hatası eklerken, üzerinde etki ettiği *talimatın* türünü ve onu hangi kübitlere uygulayacağımızı belirtmeliyiz. Kuantum Hataları için iki durum vardır:

source: 1. All-qubit quantum error
fr: 1. Erreur quantique tout-qubit
ja: 1. すべての量子ビットが量子エラー

source: 2. Specific qubit quantum error
fr: 2. Erreur quantique spécifique par qubit
ja: 2. 特定量子ビットが量子エラー

source: Note on non-local qubit quantum error
fr: Note sur l'erreur quantique non locale sur des qubits
ja: 非ローカル量子ビット量子エラーに関する注意

source: ``NoiseModel`` does not support addition of non-local qubit quantum errors. They should be handled outside of ``NoiseModel``. That suggests you should write your own transpiler pass (``TransformationPass``) and run the pass just before running the simulator if you need to insert your quantum errors into your circuit under your own conditions. See ``noise.passes.LocalNoisePass`` for example of how to implement such a transpiler pass.
fr: ``NoiseModel`` ne prend pas en charge l'ajout d'erreurs quantiques de qubit non locales. Ceux-ci doivent être gérés en dehors du ``NoiseModel``. Cela signifie que si vous avez besoin d'injecter des erreurs quantiques dans votre circuit dans vos propres conditions, vous devez créer votre propre passe de transpileur (``TransformationPass``) et exécuter le pass juste avant d'exécuter le simulateur. Voir ``noise.passes.LocalNoisePass`` pour un exemple d'implémentation d'une tel transpiler pass.
ja: ``NoiseModel`` は、追加された非ローカル量子ビット量子エラーをサポートしていません。これらは ``NoiseModel`` の外部で処理する必要があります。これは、独自の条件下で回路に量子エラーを挿入する必要がある場合、独自のトランスパイラー・パス (``TransformationPass``) を作成し、シミュレーターを実行する直前に、パスを実行する必要があることを示しています。 このようなトランスパイラー・パスの実装方法の例については、 ``noise.passes.LocalNoisePass`` を参照してください。

source: an n-qubit Pauli error channel (mixed unitary) given as a list of Pauli's and probabilities :math:`[(P_0, p_0),...]`
ja: Pauli行列と確率のリスト :math:`[(P_0, p_0),...]` で与えられた n 量子ビット Pauli エラー (混合ユニタリー) チャネル

source: The command ``AerSimulator(noise_model=noise_model)`` returns a simulator configured to the given noise model. In addition to setting the simulator's noise model, it also overrides the simulator's basis gates, according to the gates of the noise model.
ja: コマンド ``AerSimulator(noise_model=noise_model)`` は、指定されたノイズ・モデルに構成されたシミュレーターを返します。 シミュレーターのノイズ・モデルを設定するだけでなく、ノイズ・モデルのゲートに従って、シミュレーターの基底ゲートもオーバーライドします。

source: an n-qubit Pauli error channel (mixed unitary) given as a list of Pauliâ€™s and probabilities :math:`[(P_0, p_0),...]`
id_id: sebuah channel n-qubit Pauli error (campuran unitary) diberikan sebagai list Pauli dan probabilitas :math:` [(P_0, p_ 0), ...] `
