Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/simulators/3_building_noise_models.po
Languages: bn_bn, es_un, fr, id_id, ja, ko_kr, pt_un, ta_in, tr, zh

source: This page was generated from `tutorials/simulators/3_building_noise_models.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/simulators/3_building_noise_models.ipynb`__ -থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/simulators/3_building_noise_models.ipynb`__.
fr: Cette page a été générée à partir de `tutorials/simulators/3_building_noise_models.ipynb`__.
id_id: Halaman ini dibuat dari ` tutorials/algoritms/01_grover.ipynb ` __.
ja: このページは `tutorials/simulators/3_building_noise_models.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/simulators/3_building_noise_models.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada, a partir do `tutorials/simulators/3_building_noise_models.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/simulators/3_building_noise_models.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
tr: Bu sayfa `tutorials/simulators/3_building_noise_models.ipynb`__ adresinden oluşturulmuştur.
zh: 此頁面是從 "tutorials/simulators/3_building_noise_models.ipynb`__ 產生的。

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/simulators/3_building_noise_models.ipynb>`_.
ta_in: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/simulators/3_building_noise_models.ipynb>`_ இல் ஊடாடும் வகையில் இயக்கவும்.

source: Building Noise Models
bn_bn: ত্রুটি নকশা নির্মাণ
es_un: Construcción de Modelos de Ruido
fr: Construction de modèles de bruit
id_id: Membangun Model Derau
ja: ノイズモデルの構築
ko_kr: 잡음 모델 구축
pt_un: Construindo Modelos de Ruído
ta_in: கட்டிடம் சத்தம் மாதிரிகள்
tr: Gürültü Modelleri Oluşturma
zh: 建構雜訊模型

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
id_id: Pengantar
ja: はじめに
ko_kr: 소개
pt_un: Introdução
ta_in: அறிமுகம்
tr: Giriş
zh: 簡介

source: This notebook introduces how to use the Qiskit Aer ``noise`` module to build custom noise models for noisy simulations.
bn_bn: এই নোটবুকে দেখানো হয়েছে কিভাবে Qiskit এয়ারের ``noise`` মডিউল ব্যবহার করে ত্রুটিপূর্ণ সিমুলেশনের জন্য বিশেষায়িত (কাস্টম) ত্রুটি নকশা বানাতে হয়।
es_un: Este cuaderno presenta cómo usar el módulo ``noise`` de Qiskit Aer para construir modelos de ruido personalizados para simulaciones ruidosas.
fr: Ce bloc-notes explique comment utiliser le module Qiskit Aer ``noise`` pour construire des modèles de bruit personnalisés pour des simulations bruitées.
id_id: Notebook ini memperkenalkan cara penggunaan ` ` noise ` ` modul Qiskit Aer untuk membangun kustom noise model untuk simulasi derau.
ja: このノートブックでは、ノイズがあるシミュレーション用にカスタムノイズモデルを構築するための Qiskit Aer ``noise`` モジュールの使用方法をご紹介します。
ko_kr: 이 노트북은 Qiskit Aer ``noise`` 모듈을 사용하여 노이즈 시뮬레이션을 위한 사용자 잡음 모델을 만드는 방법을 소개한다.
pt_un: Este notebook apresenta como utilizar o módulo ``noise`` do Qiskit Aer, para construir modelos de ruído personalizados para simulações ruidosas.
ta_in: சத்தமில்லாத உருவகப்படுத்துதல்களுக்கு தனிப்பயன் இரைச்சல் மாதிரிகளை உருவாக்க Qiskitசத்தம் ஏர் ``Qiskit`` தொகுதியை எவ்வாறு பயன்படுத்துவது என்பதை இந்த நோட்புக் அறிமுகப்படுத்துகிறது.
tr: Bu not defteri, gürültülü simülasyonlar için özel gürültü modelleri oluşturmak için Qiskit Aer ``noise`` modülünün nasıl kullanılacağını açıklar.
zh: 此筆記本介紹如何使用 Qiskit Aer ``noise`` 模組，以建立用於具有雜訊模擬的自訂雜訊模型。

source: Qiskit Aer Noise Module
bn_bn: Qiskit এয়ার ত্রুটি নকশা
es_un: Módulo de Ruido de Qiskit Aer
fr: Module de bruit Aer Qiskit
id_id: Modul Derau Qiskit Aer
ko_kr: Qiskit Aer Noise 모듈
pt_un: Módulo de Ruído do Qiskit Aer
ta_in: Qiskit ஏர் சத்தம் தொகுதி
tr: Qiskit Aer Gürültü Modülü
zh: Qiskit Aer 雜訊模組

source: The Qiskit Aer ``noise`` module contains Python classes to build customized noise models for simulation. There are three key classes:
bn_bn: Qiskit এয়ারের ``noise`` মডিউলে Python -এর বিভিন্ন ক্লাস বানানো আছে যেগুলো ব্যবহার করে সিমুলেশনের জন্য প্রয়োজনমতো ত্রুটি নকশা বানানো হয়। এদের মধ্যে প্রধান তিনটি ক্লাস হল:
es_un: El módulo ``noise`` de Qiskit Aer contiene clases de Python para construir modelos de ruido personalizados para simulación. Hay tres clases clave:
fr: Le module Qiskit Aer ``noise`` contient des classes Python permettant de construire des modèles de bruit personnalisés pour la simulation. Il existe trois classes principales:
id_id: Modul Qiskit Aer ` ` noise ` ` berisi kelas-kelas Python untuk membangun model noise yang sesuai untuk simulasi. Ada tiga kelas kunci:
ja: Qiskit Aer ``noise`` モジュールには、シミュレーション用にカスタマイズされたノイズモデルを構築する Python クラスが含まれています。3 つのキークラスがあります。
ko_kr: Qiskit Aer ``noise`` 모듈에는 시뮬레이션을 위한 맞춤형 노이즈 모델을 만들기 위한 Python 클래스가 포함되어 있다. 다음과 같은 세 가지 주요 클래스가 있다.
pt_un: O módulo ``noise`` do Qiskit Aer contém classes Python para a construção de modelos de ruído personalizados para simulação. Há três classes principais:
ta_in: உருவகப்படுத்துதலுக்கான தனிப்பயனாக்கப்பட்ட இரைச்சல் மாதிரிகளை உருவாக்க Qiskit சத்தம்ஏர் ``Qiskit `` தொகுதி பைதான் வகுப்புகளைக் கொண்டுள்ளது. மூன்று முக்கிய வகுப்புகள் உள்ளன:
tr: Qiskit Aer ``noise`` modülü, simülasyon için özelleştirilmiş gürültü modelleri oluşturmak için Python sınıflarını içerir. Üç anahtar sınıf vardır:
zh: Qiskit Aer ``雜訊 (noise)`` 模組包含用於建立用於模擬的自訂雜訊模型的Python類別。 有三種主要類別：

source: The ``NoiseModel`` class which stores a noise model used for noisy simulation.
bn_bn: ``NoiseModel`` ক্লাসে ত্রুটিপূর্ণ সিমুলেশনের জন্য একটা ত্রুটি নকশা সঞ্চয় করে রাখে।
es_un: La clase ``NoiseModel`` que almacena un modelo de ruido utilizado para la simulación ruidosa.
fr: La classe ``NoiseModel`` qui stocke un modèle de bruit utilisé pour la simulation bruitée.
id_id: Kelas ` ` NoiseModel ` ` yang menyimpan model noise digunakan untuk simulasi bernoise.
ja: ノイズがあるシミュレーションで使用されるノイズモデルを格納する ``NoiseModel`` クラス。
ko_kr: ``NoiseModel`` 클래스는 잡음이 많은 시뮬레이션에 사용되는 잡음 모델을 저장한다.
pt_un: A classe ``NoiseModel`` que armazena um modelo de ruído usado para simulação ruidosa.
ta_in: சத்தம் உருவகப்படுத்துதலுக்குப் பயன்படுத்தப்படும் சத்தம் மாதிரியைச் சேமிக்கும் ``NoiseModel`` வகுப்பு.
tr: Gürültülü simülasyon için kullanılan gürültü modelini saklayan ``NoiseModel`` sınıfı.
zh: ``NoiseModel`` 類別是用來儲存具有雜訊模擬的雜訊模型。

source: The ``QuantumError`` class which describes CPTP gate errors. These can be applied:
bn_bn: ``QuantumError`` ক্লাসে সিপিটিপি (CPTP) যুক্তিবর্তনী (গেইট) ত্রুটির বিবরণ দেয়। এগুলো নিম্নলিখিত ক্ষেত্রে ব্যবহার করা যায়:
es_un: La clase ``QuantumError`` que describe errores de compuerta CPTP. Estos pueden ser aplicados:
fr: La classe ``QuantumError`` qui décrit les erreurs CPTP des portes. Celles-ci peuvent être appliquées :
id_id: Kelas ` ` QuantumError ` ` ` yang menggambarkan kesalahan gate CPTP. Ini dapat diterapkan:
ja: CPTP ゲートエラーを記述する ``QuantumError`` クラス。以下のように適用できます。
ko_kr: ``QuantumError`` 클래스는 CPTP 게이트 오류를 나타내는 클래스다. 다음과 같은 경우에 적용될 수 있다.
pt_un: A classe ``QuantumError``, que descreve os erros de porta CPTP. Esses podem ser aplicados:
ta_in: சிபிடிபி கேட் பிழைகளை விவரிக்கும் ``QuantumError`` வகுப்பு. இவற்றைப் பயன்படுத்தலாம்:
tr: CPTP kapı hatalarını tanımlayan ``QuantumError`` sınıfı. Şunlar uygulanabilir:
zh: ```QuantumError`` 類別用於描述 CPTP 閘誤差。 可套用以下項目：

source: After *gate* or *reset* instructions
bn_bn: *gate* বা *reset* নির্দেশনার পর
es_un: Después de las instrucciones de *compuerta* o de *restablecimiento*
fr: Après les instructions de *gate* ou *reset*
id_id: Setelah instruksi * gate * atau * reset *
ja: *gate* または *reset* の命令の後
ko_kr: *게이트* 혹은 *초기화* 명령어 이후
pt_un: Depois de instruções *gate* ou *reset*
ta_in: *gate* அல்லது *reset* வழிமுறைகளுக்குப் பிறகு
tr: *Kapı* veya *sıfırlama* talimatlarından sonra
zh: 在 *閘 (gate)* 或 * 重設 (reset)* 指令之後

source: Before *measure* instructions.
bn_bn: *পরিমাপের* আগের নির্দেশনা।
es_un: Antes de las instrucciones de *medición*.
fr: Avant les instructions de *mesure*.
id_id: Sebelum instruksi * measure *.
ja: *measure* 命令の前に。
ko_kr: 사전 *측정하기 전에* 지시사항.
pt_un: Antes de instruções *measure*.
ta_in: முன் *measure* ஆணைகள்.
tr: *Ölçme* talimatlarından önce.
zh: 在 *測量 (measure)* 指令之前。

source: The ``ReadoutError`` class which describes classical readout errors.
bn_bn: ``ReadoutError`` ক্লাস ধ্রুপদী রিডআউট ত্রুটির বিবরণ দেয়।
es_un: La clase ``ReadoutError`` que describe los errores de lectura clásicos.
fr: La classe ``ReadoutError`` qui décrit les erreurs de lecture classiques.
id_id: Kelas ` ` ReadoutError ` ` ` yang menggambarkan kesalahan readout klasik.
ja: 古典的な読み出しエラーを記述する ``ReadoutError`` クラス。
ko_kr: ``ReadoutError`` 클래스는 전통적인 해독 오류를 나타낸다.
pt_un: A classe ``ReadoutError`` que descreve erros de leitura clássicos.
ta_in: கிளாசிக்கல் ரீட்அவுட் பிழைகளை விவரிக்கும் ``ReadoutError`` வகுப்பு.
tr: ``ReadoutError`` sınıfı, klasik okuma hatalarını tanımlayan sınıftır.
zh: 描述古典讀取誤差的 ``ReadoutError`` 類別 。

source: Quantum Errors
bn_bn: কোয়ান্টাম ত্রুটি
es_un: Errores Cuánticos
fr: Erreurs quantiques
id_id: Kuantum Error
ko_kr: 양자 오류
pt_un: Erros Quânticos
ta_in: குவாண்டம் பிழைகள்
tr: Kuantum Hatalar
zh: 量子誤差

source: Rather than deal with the ``QuantumError`` object directly, many helper functions exist to automatically generate a specific type of parameterized quantum error. These are contained in the ``noise`` module and include functions for many common errors types used in quantum computing research. The function names and the type of error they return are:
bn_bn: ``QuantumError`` অবজেক্ট এ সরাসরি হাত না দেওয়ার বদলে আমরা অন্য সাহায্যকারী ফাংশন ব্যবহার করতে পারি যাতে স্বয়ংক্রিয়ভাবে একটা নির্দিষ্ট রকমের পরামিতিক (প্যারামিটারাইজড) কোয়ান্টাম ত্রুটি তৈরী হয়। এগুলো ``noise`` মডিউলে পাওয়া যায় এবং কোয়ান্টাম কম্পিউটিং গবেষণার বহুরকমের ত্রুটির ফাংশন এখানে বানানো আছে। ফাংশন এর নাম ও তাদের ব্যবহৃত ত্রুটির নাম হলো:
es_un: En lugar de tratar con el objeto ``QuantumError`` directamente, existen muchas funciones auxiliares para generar automáticamente un tipo específico de error cuántico parametrizado. Estos están contenidos en el módulo ``noise`` e incluye funciones para muchos tipos de errores comunes utilizados en investigación de computación cuántica. Los nombres de función y el tipo de error que devuelven son:
fr: Plutôt que d'utiliser directement l'objet ``QuantumError``, de nombreuses fonctions d'aide existent pour générer automatiquement les paramètres spécifiques des erreurs quantiques. Elles sont contenues dans le module ``noise`` et comprennent des fonctions pour de nombreux types d'erreurs courantes utilisées dans la recherche informatique quantique. Les noms de fonction et le type d'erreur renvoyé sont les suivants:
id_id: Daripada langsung operasi dengan objek ` ` QuantumError ` ` secara langsung, banyak fungsi pembantu untuk secara otomatis menghasilkan jenis tertentu dari parameter error kuantum. Ini ada di dalam modul ` ` noise ` ` dan mencakup fungsi untuk banyak jenis error umum yang digunakan dalam penelitian komputasi kuantum. Nama fungsi dan tipe error yang mereka hasilkan adalah:
ja: ``QuantumError`` オブジェクトを直接扱うのではなく、特定のパラメータ化された量子エラーを自動的に生成する多くのヘルパー関数が存在します。 これらは ``noise`` モジュールに含まれており、量子コンピューティング研究で使用される多くの一般的なエラータイプの関数を含んでいます。 関数名と返すエラーの種類は以下のとおりです。
ko_kr: ``QuantumError`` 객체를 직접 처리하는 대신, 보조 함수가 존재하여 매개 변수화된 양자 오류의 특정 유형을 자동으로 생성한다. 이것들은 ``noise`` 모듈에 포함되어 있으며 양자 컴퓨팅 연구에 사용되는 많은 일반적인 오류 유형을 위한 함수를 포함한다. 함수 이름과 반환되는 오류 유형은 다음과 같다.
pt_un: Em vez de lidar com o objeto ``QuantumError``, diretamente, muitas funções auxiliares existem para gerar, automaticamente, um tipo específico de erro quântico parametrizado. Estes estão contidos no módulo ``noise`` e incluem funções para muitos tipos de erros comuns utilizados na pesquisa de computação quântica. Os nomes das funções e o tipo de erro que elas retornam são:
ta_in: ``QuantumError`` பொருளை நேரடியாகக் கையாள்வதற்குப் பதிலாக, ஒரு குறிப்பிட்ட வகை அளவுரு குவாண்டம் பிழையை தானாக உருவாக்க பல உதவி செயல்பாடுகள் உள்ளன. இவை `` noise`` தொகுதியில் உள்ளன மற்றும் குவாண்டம் கம்ப்யூட்டிங் ஆராய்ச்சியில் பயன்படுத்தப்படும் பல பொதுவான பிழைகள் வகைகளுக்கான செயல்பாடுகளையும் உள்ளடக்கியது. செயல்பாட்டு பெயர்கள் மற்றும் அவை தரும் பிழையின் வகை:
tr: Doğrudan ``QuantumError`` nesnesiyle uğraşmak yerine, belirli bir tür parametreleştirilmiş kuantum hatasını otomatik olarak üretmek için birçok yardımcı işlev vardır. Bunlar ``noise`` modülünde bulunur ve kuantum hesaplama araştırmalarında kullanılan birçok yaygın hata türü için işlevleri içerir. İşlev adları ve döndürdükleri hata türü şunlardır:
zh: 與其直接處理 ``QuantumError`` 物件，其實有許多輔助函數可以用來自動產生特定類型的參數化量子誤差。 這些都包含在 "雜訊 (noise)" 模組中，這模組中包括許多用於量子計算研究的常見誤差類型的函數。 函數名稱及傳回的誤差類型為：

source: Standard error function
bn_bn: সাধারণ ত্রুটি ফাংশন
es_un: Función de error estándar
fr: Fonction d'erreur standard
id_id: Fungsi error standar
ja: 標準エラー関数
ko_kr: 표준 오차 함수
pt_un: Função de erro padrão
ta_in: நிலையான பிழை செயல்கூறு
tr: Standart hata fonksiyonu
zh: 標準誤差函數

source: Details
bn_bn: বিবরণ
es_un: Detalles
fr: Plus d'informations
id_id: Rincian
ja: 詳細
ko_kr: 세부 사항
pt_un: Detalhes
ta_in: விவரங்கள்
tr: Ayrıntılar
zh: 詳細資訊

source: a general n-qubit CPTP error channel given as a list of Kraus matrices :math:`[K_0, ...]`.
bn_bn: একটা সাধারণ n-কিউবিটসম্পন্ন সিপিটিপি (CPTP) ত্রুটি চ্যানেল আমাদের একটা ক্রাউস ম্যাট্রিক্সের :math:`[K_0, ...]` তালিকা দেয়।
es_un: un canal de error CPTP general de n qubits dado como una lista de matrices de Kraus :math:`[K_0, ...]`.
fr: un canal d'erreur CPTP général à n-qubit donné en tant que liste des matrices Kraus :math:` [ K_0, ... ] `.
id_id: sebuah channel error umum CPTP untuk n-qubit diberikan sebagai list dari matriks Kraus :math:` [K_0, ...] `.
ja: Kraus matrices :math:`[K_0, ...]` のリストとして与えられた一般的な n-qubit CPTP エラーチャネル。
ko_kr: 크라우스(Kraus) 행렬 :math:`[K_0, ...]` 목록으로 제공된 일반적인 n-큐비트 CPTP 오류 채널
pt_un: um canal de erro CPTP de n qubits geral dado como uma lista de matrizes de Kraus :math:`[K_0, ...]`.
ta_in: க்ராஸ் மெட்ரிக்ஸின் பட்டியலாக வழங்கப்பட்ட ஒரு பொதுவான n-qubit CPTP பிழை சேனல் :math:`[K_0, ...]`.
tr: Kraus matrislerinin bir listesi olarak verilen genel bir n-kübit CPTP hata kanalı :math:`[K_0, ...]`.
zh: 廣泛型的 n 量子位元 CPTP 誤差通道，以 Kraus 矩陣 :math:`[K_0, ...]` 的清單呈現

source: an n-qubit mixed unitary error given as a list of unitary matrices and probabilities :math:`[(U_0, p_0),...]`.
bn_bn: একটা n-কিউবিটসম্পন্ন মিশ্র ঐকিক (ইউনিটারি) ত্রুটি একটা ঐকিক (ইউনিটারি) ম্যাট্রিক্স ও সম্ভাবনার :math:`[(U_0, p_0),...]` তালিকা রূপে দেওয়া হয়।
es_un: un error unitario mixto de n qubits dado como una lista de matrices unitarias y probabilidades :math:`[(U_0, p_0),...]`.
fr: une erreur unitaire mixte n-qubit est sous la forme d'une liste de matrices unitaires et de probabilités :math:` [ (U_0, p_ 0), ... ] `.
id_id: satu n-qubit mixed unitary error yang diberikan sebagai list dari matriks unitary dan probabilitas :math:` [(U_0, p_ 0), ...] `.
ja: ユニタリー行列と確率のリスト :math:`[(U_0, p_0),...]` で与えられた n 量子ビットのユニタリーエラー。
ko_kr: n-큐비트 혼합하는 통합 오류 한개로 구성된 매트릭스와 확률 :math:`[(U_0, p_0),...]` 들의 목록으로 주어진다.
pt_un: um erro unitário misto de n qubits dado como uma lista de matrizes unitárias e probabilidades :math:`[(U_0, p_0),...]`.
ta_in: ஒற்றையாட்சி மெட்ரிக்குகள் மற்றும் நிகழ்தகவுகளின் பட்டியலாக கொடுக்கப்பட்ட ஒரு n-qubit கலப்பு ஒற்றையாட்சி பிழை :math:`[(U_0, p_0),...]`.
tr: üniter matrislerin ve olasılıkların bir listesi olarak verilen n-kübit karışık üniter hata :math:`[(U_0, p_0),...]`.
zh: n 量子位元的混合么正誤差，以一個么正矩陣和機率 :math:`[(U_0, p_0),...]` 的清單呈現。

source: an n-qubit coherent unitary error given as a single unitary matrix :math:`U`.
bn_bn: একটা n-কিউবিট সুসংহত ঐকিক (ইউনিটারি) ত্রুটি একটা ঐকিক (ইউনিটারি) ম্যাট্রিক্স :math:`U` রূপে দেওয়া হয়।
es_un: un error unitario coherente de n qubits dado como una única matriz unitaria :math:`U`.
fr: une erreur cohérente unitaire sur n-qubit est représentée par une seule matrice unitaire :math:` U `.
id_id: sebuah n-qubit koheren unitary error yang diberikan sebagai unitary matrix tunggal :math:` U `.
ja: 1つのユニタリー行列 :math:`U` として与えられたn量子ビットのコヒーレントなユニタリーエラー。
ko_kr: n-큐비트 일관성 있는 단위 오차는 단일 단위 행렬 :math:`U` 로 주어진다.
pt_un: um erro unitário coerente de n qubits dado como uma única matriz unitária :math:`U`.
ta_in: ஒரு ஒரே தனிப்பட்ட மாட்ரிக்ஸ் :math:`U` என்று கொடுக்கப்பட்ட ஒரு n-qubit coherent unitary பிழை.
tr: tek bir üniter matris olarak verilen bir n-kübit tutarlı üniter hata :math:`U`.
zh: n 量子位元的相干么正誤差，以一個么正矩陣 :math:`U` 呈現。

source: an n-qubit Pauli error channel (mixed unitary) given as a list of Pauli’s and probabilities :math:`[(P_0, p_0),...]`
es_un: un canal de error de Pauli de n qubits (unitario mixto) dado como una lista de matrices de Pauli y probabilidades :math:`[(P_0, p_0),...]`
fr: un canal d'erreur de Pauli sur n-qubit (unitaire mixte) est donné comme une liste de Pauli's et de probabilités :math:` [ (P_0, p_ 0), ... ] `
ko_kr: 파울리 상태와 확률의 목록 :math:`[(P_0, p_0),...]` 으로 주어진 n-큐비트 파울리 오류 채널 (혼합된 단위 상태).
ta_in: பவுலியின் மற்றும் நிகழ்தகவுகளின் பட்டியலாக வழங்கப்பட்ட ஒரு n-qubit பவுலி பிழை சேனல் (கலப்பு ஒற்றுமை) :math:`[(P_0, p_0),...]`

source: an n-qubit depolarizing error channel parameterized by a depolarization probability :math:`p`.
bn_bn: একটা n-কিউবিট ডি-পোলারাইজিঙ ত্রুটি চ্যানেল যার প্যারামিটার হল একটা ডি-পোলারাইজেশন সম্ভাবনা :math:`p`।
es_un: un canal de error despolarizante de n qubits parametrizado por una probabilidad de despolarización :math:`p`.
fr: un canal d'erreur de dépolarisation n-qubit est paramétré par une probabilité de dépolarisation :math:`p`.
id_id: sebuah n-qubit channel depolarizing error berparameter dengan probabilitas depolarisasi :math:` p `.
ja: depolarizing 確率が :math:`p` の n量子ビット depolarizing エラーチャネル。
ko_kr: 탈분극 확률 :math:`p` 로 매개변수를 가진 n-큐비트 탈분극 오류 채널.
pt_un: um canal de erro de despolarização de n qubits parametrizado por uma probabilidade de despolarização :math:`p`.
ta_in: டிப்போலரைசேஷன் நிகழ்தகவு மூலம் அளவுருவாக்கப்பட்ட ஒரு n-qubit டிப்போலரைசிங் பிழை சேனல் :math:`p`.
tr: bir :math:`p` depolarizasyon olasılığı ile parametrelendirilmiş n-kübitlik depolarizasyon hata kanalı.
zh: 被去極化機率 :math:`p` 參數化的 n 量子位元去極化誤差通道

source: a single-qubit reset error parameterized by a probabilities :math:`p_0, p_1` of resetting to the :math:`|0\rangle`, :math:`|1\rangle` state.
bn_bn: একটা একক কিউবিট রিসেট বা পুনঃস্থাপন ত্রুটি যার প্যারামিটার হলো :math:`|0\rangle`, :math:`|1\rangle` অবস্থায় রিসেট বা পুনঃস্থাপন হওয়ার সম্ভাবনা :math:`p_0, p_1`।
es_un: un error de restablecimiento de un solo qubit parametrizado por las probabilidades :math:`p_0, p_1` de reiniciar al estado :math:`|0\rangle`, :math:`|1\rangle`.
fr: une erreur de réinitialisation mono-qubit paramétrée par une probabilité :math:`p_0, p_1` de réinitialisation à l'état :math:`|0\rangle`, :math:`|1\rangle`.
ja: :math:`|0\rangle`, :math:`|1\rangle` 状態にリセットする確率 :math:`p_0, p_1` によりパラメーター化された、単一量子ビットのリセット・エラー
ko_kr: 단일 큐비트 초기화 에러는 :math:`|0\rangle`, :math:`|1\rangle` 상태로 초기화할 확률 :math:`p_0, p_1` 로 매개화된다.
pt_un: Erro de reset de um qubit-único (um estado) parametrizado por probabilidades :math:`p_0, p_1` de resetar para o estado :math:`|0\rangle`, :math:`|1\rangle`.
ta_in: நிகழ்தகவுகளால் அளவுருவாக்கப்பட்ட ஒற்றை-குவிட் மீட்டமைப்பு பிழை :math:`p_0, p_1`: மீட்டமைத்தல்:math:`|0\rangle`, :math:`|1\rangle` நிலை.
tr: :math:`|0\rangle`, :math:`|1\rangle` durumuna sıfırlama olasılıkları :math:`p_0, p_1` tarafından parametrelendirilen tek-kübit sıfırlama hatası.
zh: 被重新設定至 :math:`|0\rangle`, :math:`|1\rangle` 狀態的去極化機率 :math:`p_0, p_1` 參數化的單量子位元重設誤差。

source: a single qubit thermal relaxation channel parameterized by relaxation time constants :math:`T_1`, :math:`T_2`, gate time :math:`t`, and excited state thermal population :math:`p_1`.
bn_bn: একটা একক কিউবিট তাপীয় শিথিলকরণ (রিলাক্সেশন) চ্যানেল যার প্যারামিটার হল শিথিলকরণ (রিলাক্সেশন) সময় ধ্রুবক :math:`T_1`, :math:`T_2`, যুক্তিবর্তনী (গেইট) সময় :math:`t` এবং উত্তেজিত দশা তাপীয় সংখ্যাবিন্যাস (থার্মাল পপুলেশন) :math:`p_1`।
es_un: un canal de relajación térmica de un solo qubit parametrizado por las constantes de tiempo de relajación :math:`T_1`, :math:`T_2`, tiempo de compuerta :math:`t`, y la población térmica del estado excitado :math:`p_1`.
fr: un canal de relaxation thermique à un seul qubit paramétré par les constantes de temps de relaxation :math:` T_1`, :math:` T_2`, la durée de porte :math:`t`, et la population thermique de l'état excité :math:`p_1`.
id_id: sebuah channel relaksasi termal qubit tunggal yang diparameterisasi oleh konstanta waktu relaksasi :math:` T_1 `, :math:` T_2 `, waktu gate :math:` t `, dan populasi termal keadaan tereksitasi :math:` p_1 `.
ja: 緩和時間 :math:`T_1` , :math:`T_2` と ゲート操作時間 :math:`t` と 励起状態の熱占有率 :math:`p_1` で特徴付けられる1量子ビット熱緩和チャネル
ko_kr: 완화 시간 상수 :math:"T_1", :math:"T_2", 게이트 시간 :math:` t `, 및 여기된 상태 열 집단 ( :math:' p_1) 에 의해 파라미터화된 단일의 1비트 열 완화 채널을 포함한다.
pt_un: um canal de relaxação térmica de um único qubit parametrizado por constantes de tempo de relaxação :math:`T_1`, :math:`T_2`, tempo de porta :math:`t`, e população térmica do estado excitado :math:`p_1`.
ta_in: தளர்வு நேர மாறிலிகளால் அளவுருவாக்கப்பட்ட ஒற்றை குவிட் வெப்ப தளர்வு சேனல் :math:`T_1`, :math:`T_2`, வாயில் நேரம் :math:`t`, மற்றும் உற்சாகமான மாநில வெப்ப மக்கள் தொகை :math:`p_1`.
tr: gevşeme süresi sabitleri :math:`T_1`, :math:`T_2`, geçit süresi :math:`t` ve uyarılmış durum termal popülasyonu :math:`p_1` tarafından parametrelendirilen tek bir kübit termal gevşeme kanalı.
zh: 一個被弛緩時間常數 :math:`T_1`、 :math:`T_2` 、閘時間 :math:`t`，以及激發態熱分佈數量 :math:`p_1 參數化的單量子位元的熱弛緩通道。

source: A single-qubit generalized combined phase and amplitude damping error channel given by an amplitude damping parameter :math:`\lambda`, a phase damping parameter :math:`\gamma`, and an excited state thermal population :math:`p_1`.
bn_bn: একটা একক কিউবিট সাধারণ মিলিত দশা এবং বিস্তার অবনমনকারী (ড্যাম্পিং) ত্রুটি চ্যানেল বানাতে হলে একটা বিস্তার অবনমন (ড্যাম্পিং) প্যারামিটার :math:`\lambda`, একটা দশা অবনমন (ড্যাম্পিং) প্যারামিটার :math:`\gamma` এবং একটা উত্তেজিত দশা তাপীয় সংখ্যা বা সংখ্যাবিন্যাস (থার্মাল পপুলেশন) :math:`p_1` প্রয়োজন।
es_un: Un canal de error de amortiguación de amplitud y fase combinada generalizada de un solo qubit dado por un parámetro de amortiguación de amplitud :math:`\lambda`, un parámetro de amortiguación de fase :math:`\gamma`, y una población térmica de estado excitado :math:`p_1`.
fr: Un canal d'amortissement d'erreur sur un seul qubit généralisé combinant un paramètre d'amortissement de phase :math:`\lambda`, un paramètre d'amoortissement de phase :math:`\gamma`, et une population dans l'état d'excitation thermique :math:`p_1`.
id_id: Sebuah channel fase gabungan umum qubit tunggal dan error amplitudo damping yang diberikan oleh amplitudo damping parameter :math:` \lambda `, sebuah fase parameter damping :math:` \gamma `, dan populasi termal keadaan tereksitasi :math:` p_1 `.
ja: 振幅dampingパラメーター :math:`\lambda`、位相dampingパラメーター :math:`\gamma`、 励起状態熱占有率 :math:`p_1` で与えられる1量子ビットの一般化された位相と振幅を結合したdamping エラーチャネル
ko_kr: 진폭 감쇠 매개 변수 :math:`\lambda`, 위상 감쇠 매개 변수 :math:`\gamma` 및 여기 상태 열의 집단 :math:`p_1` 가 제공하는 단일 큐비트 일반화 위상 및 진폭 감쇠 오류 채널이다.
pt_un: Um canal de erro de amortecimento de fase combinada e amplitude generalizada de um único qubit dado por um parâmetro de amortecimento de amplitude :math:`\lambda`, um parâmetro de amortecimento de fase :math:`\gamma`, e uma população térmica do estado excitado :math:`p_1`.
ta_in: ஒரு ஒற்றை-குவிட் பொதுமைப்படுத்தப்பட்ட ஒருங்கிணைந்த கட்டம் மற்றும் அலைவீச்சு தணிக்கும் அளவுரு வழங்கிய கணிதம் :math:`\lambda`, ஒரு கட்டத்தைத் தணிக்கும் அளவுரு :math:`\gamma`, மற்றும் ஒரு உற்சாகமான மாநில வெப்ப மக்கள் தொகை :math:`p_1`.
tr: Bir genlik sönümleme parametresi :math:`\lambda`, bir faz sönümleme parametresi :math:`\gamma` ve uyarılmış durum termal popülasyonu :math:`p_1` tarafından verilen tek kübitlik genelleştirilmiş bir birleşik faz ve genlik sönümleme hata kanalı.
zh: 一個以振幅阻尼參數 :math:`\lambda`、相位阻尼參數 :math:`\gamma`，和激發態熱分佈數量 :math:`p_1` 表示的單量子位元廣義化的組合相位和振幅阻尼誤差通道。
