Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/simulators/4_custom_gate_noise.po
Languages: bn_bn, es_un, fr, id_id, ja_jp, ko, pt_br, ta_in, tr_tr, zh

source: Note that when we add an error to a custom label such as ``"iswap"`` the ``NoiseModel`` does not know what gate this label is supposed to apply to, so we must manually add the desired gate string to the noise model ``basis_gates``. This ensures that the compiler will unroll to the correct basis gates for the noise model simulation. This can done using the ``NoiseModel.add_basis_gates`` function:
bn_bn: লক্ষ্য করো যখন আমরা একটা ত্রুটি একটা বিশেষায়িত (কাস্টম) নাম (লেবেল) এ যোগ করি (যেমন ``"iswap"``), ``NoiseModel`` জানে না কোন যুক্তিবর্তনীতে (গেইট) এই নামটা (লেবেল) যোগ হবে, সেজন্য আমাদের আলাদা করে ``basis_gates`` -এর মাধ্যমে যুক্তিবর্তনীর (গেইট) নামটা ত্রুটি নকশায় দিতে হবে। এতে নিশ্চিত হওয়া যায় যে কম্পাইলার সঠিক বেসিস যুক্তিবর্তনীকেই ত্রুটি নকশা সিমুলেশনের জন্য আনরোল করবে। এটা করতে হলে ``NoiseModel.add_basis_gates`` ফাংশন ব্যবহার করতে হবে:
es_un: Ten en cuenta que cuando añadimos un error a una etiqueta personalizada como ``"iswap"``, el ``NoiseModel`` no sabe a qué compuerta se supone que va a aplicar esta etiqueta, así que debemos añadir manualmente la cadena de compuerta deseada al modelo de ruido ``basis_gates``. Esto asegura que el compilador se descompondrá a las compuertas base correctas para la simulación del modelo de ruido. Esto se puede hacer utilizando la función ``NoiseModel.add_basis_gates``:
fr: Notez que lorsque nous ajoutons une erreur à un label personnalisé tel que ``"iswap"``, le ``NoiseModel`` ne sait pas à quelle porte ce label est censé s'appliquer, donc nous devons ajouter manuellement la chaîne de porte désirée au modèle de bruit ``basis_gates``. Cela garantit que le compilateur se déplace vers les portes de base correctes pour la simulation du modèle de bruit. Cela peut être fait en utilisant la fonction ``NoiseModel.add_basis_gates`` :
id_id: Perhatikan bahwa ketika kita menambahkan error pada label kustom seperti ` ` "iswap" ` ` ` ` NoiseModel ` ` tidak tahu gate apa yang berlaku untuk label ini. Jadi kita harus secara manual menambahkan string gate yang diinginkan ke model noise ` ` basis_gates ` `. Hal ini memastikan bahwa kompiler akan melepas ke gate dasar yang benar untuk simulasi noise model. Hal ini dapat dilakukan dengan menggunakan fungsi ` `NoiseModel.add_basis_gates ` ` `:
ja_jp: ``"iswap"`` のようなカスタムラベルにエラーを追加すると、``NoiseModel`` はこのラベルが適用されるべきゲートを知らないことに注意してください。 ですから、ノイズモデルの ``basis_gates`` に手動でゲート文字列を追加する必要があります。 これにより、コンパイラーはノイズモデルシミュレーションの正しいベース・ゲートにアンロールします。これは ``NoiseModel.add_basis_gates`` 関数を使用して行うことができます。
ko: 참고로 ``"iswap"`` 과 같은 사용자 정의 레이블에 오류를 추가할 때 ``Noise Model`` 은 이 레이블이 적용되는 게이트를 모르므로 원하는 게이트 문자열을 노이즈 모델 ``basis_gates`` 에 수동으로 추가해야 한다. 이를 통해 컴파일러가 노이즈 모델 시뮬레이션을 위한 올바른 기본 게이트로 롤아웃할 수 있다. 이 작업은 '``NoiseModel.add_basis_gates``' 함수를 사용하여 수행할 수 있다.
pt_br: Note que quando adicionamos um erro a um rótulo personalizado como ``"iswap"`` o ``NoiseModel`` não sabe a que porta este rótulo se deve aplicar, então devemos adicionar manualmente a sequência de caracteres da porta desejada, ao modelo de ruído ``basis_gates``. Isto garante que o compilador irá rolar para as portas corretas, para a simulação do modelo com ruído. Isto pode ser feito usando a função ``NoiseModel.add_basis_gates``:
ta_in: `` "iswap" போன்ற தனிப்பயன் லேபிளில் பிழையைச் சேர்க்கும்போது, ​​`` NoiseModel`` இந்த லேபிள் எந்த வாயிலுக்குப் பொருந்தும் என்று தெரியவில்லை, எனவே நாம் விரும்பிய கேட் சரத்தை கைமுறையாக சேர்க்க வேண்டும் சத்தம் மாதிரி ``basis_gates``. இரைச்சல் மாதிரி உருவகப்படுத்துதலுக்கான சரியான அடிப்படை வாயில்களுக்கு கம்பைலர் அவிழும் என்பதை இது உறுதி செய்கிறது. `` NoiseModel.add_basis_gates`` செயல்பாட்டைப் பயன்படுத்தி இதைச் செய்யலாம்:
tr_tr: ``"iswap"`` gibi özel bir etikete bir hata eklediğimizde, ``NoiseModel`` bu etiketin hangi geçite uygulanacağını bilmediğini unutmayın, bu nedenle istenen geçit dizesini ``basis_gates`` gürültü modeline manuel olarak eklememiz gerekir. Bu, derleyicinin gürültü modeli simülasyonu için doğru temel geçitlere açılmasını sağlar. Bu, ``NoiseModel.add_basis_gates`` işlevi kullanılarak yapılabilir:
zh: 請注意，當我們將誤差新增至自訂標籤(例如 ``"iswap"``)時，``NoiseModel`` 不知道此標籤應該套用到的閘，因此我們必須手動將想要的套用的閘的字串新增至該雜訊模型 ``basis_gates``。 這可確保該編譯器將回歸到該雜訊模型模擬的正確基底閘。 這可以使用 ``NoiseModel.add_basis_gates`` 函數來完成：

source: By default the basis gates of a noise model are ``['cx','id','u3']`` plus any standard ``QasmSimulator`` basis gates that are added to the noise model.
id_id: Secara default gate dasar dari sebuah model noise adalah ` ` ['cx ',' id ',' u3 '] ` ` plus setiap gate standar ` ` QasmSimulator ` ` ` yang ditambahkan ke model noise.
ja_jp: デフォルトでは、ノイズモデルの基底ゲートは ``['cx','id','u3']`` に加えて、ノイズモデルに追加される標準の ``QasmSimulator`` ベースゲートがあります。
pt_br: Por padrão, as portas de base de um modelo com ruído são ``['cx','id','u3']`` mais quaisquer portas de base padrão ``QasmSimulator``, que são adicionadas ao modelo com ruído.

source: Simulating a custom unitary noise model
bn_bn: একটা বিশেষায়িত (কাস্টম) ঐকিক (ইউনিটারি) ত্রুটি নকশা সিমুলেট করা
es_un: Simulación de un modelo de ruido unitario personalizado
fr: Simuler un modèle de bruit unitaire personnalisé
id_id: Mensimulasikan kustom model noise unitary
ja_jp: カスタムユニタリーノイズモデルのシミュレーション
ko: 맞춤 유니터리 노이즈 모델의 시뮬레이션
pt_br: Simulando um modelo com ruído unitário personalizado
ta_in: தனிப்பயன் ஒற்றுமை இரைச்சல் மாதிரியை உருவகப்படுத்துதல்
tr_tr: Özel bir üniter gürültü modelini simüle etme
zh: 模擬一個自訂的么正雜訊模型

source: Let us first take our previous CX circuit and add an initial Hadamard gate and final measurement to create a Bell-state preparation circuit that we may simulator on the ``QasmSimulator`` both for the ideal and noisy case:
id_id: Pertama-tama mari kita menggunakan sirkuit CX dan menambahkan di awal gate Hadamard dan terakhir pengukuran untuk membuat sebuah sirkuit persiapan Bell-state yang dapat kita simulasi dengan ` ` QasmSimulator ` ` baik untuk kasus yang ideal dan bernoise:
ja_jp: 以前のCX回路を取り上げて、最初のアダマールゲートと最後の測定を追加して、理想的な場合とノイズがある場合について ``QasmSimulator`` 上でシミュレートできるベル状態準備回路を作成しましょう。
pt_br: Primeiro, vamos pegar o nosso circuito CX anterior e adicionar uma porta Hadamard inicial e uma medição final para criar um circuito de preparação Bel-state que poderemos simular no ``QasmSimulator``, tanto para o caso ideal e com ruído:

source: Ideal output
bn_bn: আদর্শ ফলাফল
es_un: Salida ideal
fr: Sortie idéale
id_id: Output ideal
ja_jp: 理想的な出力
ko: 이상적인 출력
pt_br: Saída ideal
ta_in: சிறந்த வெளியீடு
tr_tr: İdeal çıktı
zh: 理想輸出

source: Let’s first see the ideal output. Since this generates a Bell-state we expect two peaks for 00 and 11.
bn_bn: প্রথমে আদর্শ ফলটা দেখা যাক। যেহেতু এটা একটা বেল স্টেট আমরা ০০ ও ১১ দুটো শীর্ষ আশা করছি।
id_id: Mari kita lihat output yang ideal. Karena sirkuti ini menghasilkan sebuah Bell-state kita mengharapkan dua puncak di 00 dan 11.
ta_in: முதலில் சிறந்த வெளியீட்டைப் பார்ப்போம். இது ஒரு பெல்-நிலையை உருவாக்குவதால், 00 மற்றும் 11 க்கு இரண்டு சிகரங்களை எதிர்பார்க்கிறோம்.
tr_tr: Önce ideal çıktıyı görelim. Bu bir Bell-durumu oluşturduğundan 00 ve 11 için iki tepe noktası bekliyoruz.
zh: 讓我們先看看理想的輸出。 因為這會產生 Bell 狀態，我們預期在 00 和 11會有兩個峰。

source: Noisy circuit execution
bn_bn: ত্রুটিপূর্ণ বর্তনী চালানো
es_un: Ejecución del circuito ruidoso
fr: Exécution du circuit bruité
id_id: Eksekusi sirkuit yang bernoise
ja_jp: ノイズがある回路の実行
ko: 노이즈가 있는 회로의 실행
pt_br: Execução do circuito com ruído
ta_in: சத்தம் சுற்று செயல்படுத்தல்
tr_tr: Gürültülü devre yürütme
zh: 執行雜訊電路

source: Finally, let’s now simulate it with our custom noise model. Since there is a small amplitude damping error on the two-qubit gates we expect small additional peaks for the 01 and 10 outcome probabilities.
bn_bn: সবশেষে, এবার আমরা এটাকে আমাদের বিশেষায়িত (কাস্টম) ত্রুটি নকশা দিয়ে সিমুলেট করবো। যেহেতু ২-কিউবিট যুক্তিবর্তনীতে (গেইট) অল্প বিস্তার অবনমন (ড্যাম্পিং) ত্রুটি আছে আমরা আশা করছি ০১ ও ১০ ফলাফলের সম্ভাবনাতেও অতিরিক্ত শীর্ষ আসবে।
id_id: Akhirnya, mari kita simulasikan sirkuit itu dengan model kustom noise. Karena ada amplitudo kecil damping error pada gate dua qubit kita mengharapkan puncak kecil tambahan di probabilitas 01 dan 10.
ta_in: இறுதியாக, இப்போது அதை எங்கள் தனிப்பயன் இரைச்சல் மாதிரியுடன் உருவகப்படுத்தலாம். இரண்டு-குவிட் வாயில்களில் ஒரு சிறிய வீச்சு தணிக்கும் பிழை இருப்பதால், 01 மற்றும் 10 விளைவு நிகழ்தகவுகளுக்கு சிறிய கூடுதல் சிகரங்களை எதிர்பார்க்கிறோம்.
tr_tr: Son olarak, şimdi özel gürültü modelimiz ile simüle edelim. İki kübitlik kapılarda küçük bir genlik sönümleme hatası olduğundan, 01 ve 10 sonuç olasılıkları için küçük ek tepeler bekliyoruz.
zh: 最後，讓我們現在用我們的自訂噪音模型來模擬它。 由於雙量子位元閘的振幅衰減很小，所以我們預期 01 和 10 的結果機率會有小的額外峰值。

source: The Qiskit Aer ``AerSimulator`` supports simulation of arbitrary unitary operators directly as specified by the ``"unitary"`` in the basis gates.
bn_bn: কিস্কিট (Qiskit) এয়ারের ``AerSimulator`` -এ বেসিস যুক্তিবর্তনীর (গেইট) ``"unitary"`` দ্বারা নির্দেশিত সকল ঐকিক (ইউনিটারি) অপারেটর ইচ্ছামতো সিমুলেট করা যায়।
es_un: El ``AerSimulator`` de Qiskit Aer admite la simulación de operadores unitarios arbitrarios directamente según lo especificado por la ``"unitary"`` en las compuertas base.
fr: Le Qiskit Aer ``AerSimulator`` supporte la simulation d'opérateurs unitaires arbitraires directement comme spécifié par le ``"unitary"`` dans les portes de base.
ko: Qiskit Aer의 ``AerSimulator`` 는 기저 게이트에서 ``"unitary"`` 로 지정된 임의의 단위 상태 연산자의 시뮬레이션을 직접 지원한다.
ta_in: Qiskit ஏர் ``AerSimulator`` தன்னிச்சையான ஒற்றையாட்சி ஆபரேட்டர்களை உருவகப்படுத்துவதை ஆதரிக்கிறது.
tr_tr: Qiskit Aer ``AerSimulator`, temel kapılarda ``"unitary"`` tarafından belirtildiği gibi doğrudan rastgele üniter operatörlerin simülasyonunu destekler.
zh: Qiskit Aer ``AerSimulator`` 支援由基底閘中的 ``"unitary"`` 直接指定的對任意么正運算子的模擬。

source: By default the basis gates of a noise model are ``['cx','id','u3']`` plus any standard ``AerSimulator`` basis gates that are added to the noise model.
bn_bn: স্বতঃসিদ্ধ নিয়মানুসারে দূষণ বা ত্রুটি মডেলের বেসিস বা ভিত্তি যুক্তিবর্তনীগুলি (গেইট) হলো ``['cx','id','u3']`` এবং যেকোনো সাধারণ ``AerSimulator`` বেসিস বা ভিত্তি যুক্তিবর্তনীগুলি (গেইট) যা দূষণ বা ত্রুটি মডেলের সাথে যোগ করা হয়েছে।
es_un: Por defecto, las compuertas base de un modelo de ruido son ``['cx','id','u3']`` más cualquier compuerta base estándar ``AerSimulator`` que se agregue al modelo de ruido.
fr: Par défaut, les portes de base d'un modèle de bruit sont ``['cx','id','u3']`` plus toutes les portes de base standard ``AerSimulator`` qui sont ajoutées au modèle de bruit.
ko: 기본적으로 노이즈 모델의 기저 게이트는 ``['cx','id','u3']`` 과 노이즈 모델에 추가된 기본 ``AerSimulator`` 기저 게이트이다.
ta_in: இயல்பாகவே ஒரு சத்தம் மாதிரியின் அடிப்படை வாயில்கள் `` ['cx', 'id', 'u3'] `` மற்றும் சத்தம் மாதிரியில் சேர்க்கப்படும் எந்தவொரு நிலையான ``AerSimulator`` அடிப்படை வாயில்கள்.
tr_tr: Varsayılan olarak bir gürültü modelinin temel geçitleri ``['cx','id','u3']`` artı gürültü modeline eklenen herhangi bir standart ``AerSimulator`` temel geçitleridir.
zh: 依預設，雜訊模型的基底閘為 ``['cx','id','u3']`` 加上任何新增至該雜訊模型的標準 ``AerSimulator`` 基底閘。

source: Let us first take our previous CX circuit and add an initial Hadamard gate and final measurement to create a Bell-state preparation circuit that we may simulator on the ``AerSimulator`` both for the ideal and noisy case:
bn_bn: প্রথমে আমরা আগের CX বর্তনী (সার্কিট) নিই এবং একটা প্রাথমিক হ্যাডামার্ড যুক্তিবর্তনী ও চূড়ান্ত পরিমাপ যোগ করি। এতে একটা বর্তনী (সার্কিট) তৈরী হবে যেটা একটা বেল স্টেট বানাবে। এটাকে আমরা ``AerSimulator`` -এ আদর্শ ও ত্রুটিপূর্ণ (নয়েজী) উভয়ক্ষেত্রের জন্য সিমুলেট করবো।
es_un: Primero tomemos nuestro circuito CX anterior y agreguemos una compuerta Hadamard inicial y una medición final para crear un circuito de preparación de estado de Bell que podemos simular en el ``AerSimulator`` tanto para el caso ideal como para el ruidoso:
fr: Commençons par prendre notre circuit CX précédent et ajouter une porte Hadamard initiale et une mesure finale pour créer un circuit de préparation d'état Bell-que nous pouvons simuler sur le ``AerSimulator`` pour le cas idéal et bruyant:
ko: 먼저 이전 CX 회로를 사용하고 초기 하다마드 게이트와 최종 측정을 추가하여 이상적인 경우와 시끄러운 경우 모두를 ``Aer Simulator`` 에서 시뮬레이터로 사용할 수 있는 벨 상태 준비 회로를 만들자.
ta_in: முதலில் எங்கள் முந்தைய சிஎக்ஸ் சுற்று எடுத்து, ஒரு ஆரம்ப ஹடாமார்ட் கேட் மற்றும் இறுதி அளவீட்டைச் சேர்ப்போம், பெல்-ஸ்டேட் தயாரிப்பு சுற்று ஒன்றை உருவாக்கலாம், இது சிறந்த மற்றும் சத்தமில்லாத வழக்குக்கு ``AerSimulator`` சிமுலேட்டராக இருக்கலாம்:
tr_tr: İlk olarak önceki CX devremizi alalım ve hem ideal hem de gürültülü durum için ``AerSimulator`` üzerinde simüle edebileceğimiz bir Bell-durumu hazırlık devresi oluşturmak için bir başlangıç Hadamard geçidi ve son ölçümü ekleyelim:
zh: 讓我們先取得先前的 CX 電路，並新增起始 Hadamard 閘和最終測量，以建立 Bell 狀態準備電路，我們可以在 " ` AerSimulator`` 上模擬出理想和雜訊的情況：

source: Let's first see the ideal output. Since this generates a Bell-state we expect two peaks for 00 and 11.
es_un: Primero veamos la salida ideal. Dado que esto genera un estado de Bell, esperamos dos picos para 00 y 11.
fr: Voyons d'abord la sortie idéale, puisque cela génère un état de Bell, nous attendons deux pics pour 00 et 11.
ja_jp: 最初に理想的な出力を見てみましょう。これがBell-stateを生成するので、00と11の2つのピークを期待します。
pt_br: Primeiro, vamos ver o resultado ideal. Como isso gera um Bell-state, esperamos dois picos para 00 e 11.

source: Finally, let's now simulate it with our custom noise model. Since there is a small amplitude damping error on the two-qubit gates we expect small additional peaks for the 01 and 10 outcome probabilities.
es_un: Finalmente, vamos ahora a simularlo con nuestro modelo de ruido personalizado. Dado que hay un pequeño error de amortiguamiento de amplitud en las compuertas de dos qubits, esperamos pequeños picos adicionales para las probabilidades de salida 01 y 10.
fr: Enfin, nous allons maintenant le simuler avec notre modèle de bruit personnalisé. Comme il y a une petite erreur d'amortissement d'amplitude sur les portes à deux qubits, nous nous attendons à de petits pics supplémentaires pour les probabilités de résultat 01 et 10.
ja_jp: 最後に、カスタムノイズモデルでシミュレートしましょう。 2量子ビットゲートには小さな振幅減衰誤差があるので、01および10の結果の可能性については、小さなピークが追加されることが予想されます。
pt_br: Finalmente, vamos simulá-lo com nosso modelo com ruído personalizado. Uma vez que há um pequeno erro de amortecimento de amplitude nas portas de 2-qubits, esperamos pequenos picos adicionais para as probabilidades de resultado de 01 e 10.
