Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/simulators/4_custom_gate_noise.po
Languages: bn_bn, es_un, fr, id_id, ja_jp, ko, pt_br, ta_in, tr_tr, zh

source: This page was generated from `tutorials/simulators/4_custom_gate_noise.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/simulators/4_custom_gate_noise.ipynb`__ -থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/simulators/4_custom_gate_noise.ipynb`__.
fr: Cette page a été générée à partir de `tutorials/simulators/4_custom_gate_noise.ipynb`__.
id_id: Halaman ini dibuat dari ` tutorials/algoritms/01_grover.ipynb ` __.
ja_jp: このページは `tutorials/simulators/4_custom_gate_noise.ipynb`__ から生成されました。
ko: 이 페이지는 `tutorials/simulators/4_custom_gate_noise.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada a partir do `tutorials/simulators/4_custom_gate_noise.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/simulators/4_custom_gate_noise.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
tr_tr: Bu sayfa `tutorials/simulators/4_custom_gate_noise.ipynb`__ adresinden oluşturulmuştur.
zh: 此頁面是從 `tutorials/simulators/4_custom_gate_noise.ipynb`__產生的。

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/simulators/4_custom_gate_noise.ipynb>`_.
id_id: Jalankan secara interaktif di ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/simulators/4_custom_gate_noise.ipynb>` _.

source: Applying noise to custom unitary gates
bn_bn: বিশেষায়িত (কাস্টম) ঐকিক (ইউনিটারি) যুক্তিবর্তনীতে (গেইট) ত্রুটি ব্যবহার করা
es_un: Aplicar ruido a compuertas unitarias personalizadas
fr: Application du bruit aux portes unitaires personnalisées
id_id: Menerapkan derau pada kustom gate
ja_jp: カスタムユニタリーゲートにノイズを適用する
ko: 맞춤 유니터리 게이트를 노이즈로 적용하기
pt_br: Aplicando ruído às portas unitárias personalizadas
ta_in: வழக்கமான யூனிடேரி கேட்களுக்கு சத்தம் பயன்படுத்துதல்
tr_tr: Özel üniter kapılara gürültü uygulanması
zh: 將雜訊作用於自定義的么正閘

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
id_id: Pengantar
ja_jp: はじめに
ko: 소개
pt_br: Introdução
ta_in: முன்னுரை
tr_tr: Giriş
zh: 簡介

source: This notebook shows how to add custom unitary gates to a quantum circuit, and use them for noise simulations in Qiskit Aer.
bn_bn: এই নোটবুকে দেখানো হয়েছে কিভাবে একটা কোয়ান্টাম বর্তনীতে বিশেষায়িত (কাস্টম) ঐকিক (ইউনিটারি) যুক্তিবর্তনী (গেইট) যোগ করতে হয় এবং Qiskit এয়ারের ত্রুটি সিমুলেশনে ব্যবহার করতে হয়।
es_un: Este cuaderno muestra cómo añadir compuertas unitarias personalizadas a un circuito cuántico, y utilizarlas para simulaciones de ruido en Qiskit Aer.
fr: Ce bloc-notes montre comment ajouter des portes unitaires personnalisées à un circuit quantique et les utiliser pour des simulations de bruit dans Qiskit Aer.
id_id: Notebook ini menunjukkan bagaimana untuk menambahkan gate kustom unitary untuk sirkuit kuantum, dan menggunakannya untuk simulasi derau di Qiskit Aer.
ja_jp: このノートブックでは、量子回路にカスタムのユニタリーゲートを追加し、Qiskit Aer でノイズシミュレーションに使用する方法を説明します。
ko: 이 노트북에서는 양자 회로에 맞춤 유니터리 게이트를 추가하는 방법을 살펴보고 이를 Qiskit Aer의 노이즈 시뮬레이션에 사용해 본다.
pt_br: Este notebook mostra como adicionar portas unitárias customizadas a um circuito quântico, e usá-las para simulações de ruído no Qiskit Aer.
ta_in: இந்த நோட்புக் ஒரு குவாண்டம் சுற்றுக்கு வழக்கமான யூனிடேரி கேட்களை எவ்வாறு சேர்ப்பது என்பதைக் காட்டுகிறது, மேலும் அவற்றை Qiskit ஏரில் சத்தம் உருவகப்படுத்துதல்களுக்குப் பயன்படுத்தலாம்.
tr_tr: Bu not defteri, bir kuantum devresine özel üniter kapıların nasıl ekleneceğini ve bunların Qiskit Aer'de gürültü simülasyonları için nasıl kullanılacağını gösterir.
zh: 此筆記本會顯示如何將自定義么正閘新增至量子電路，並在 Qiskit Aer 中使用它們進行雜訊模擬。

source: Creating matrix operators
bn_bn: ম্যাট্রিক্স অপারেটর বানানো
es_un: Creación de operadores de matriz
fr: Création d'opérateurs de matrice
id_id: Membuat operator matriks
ja_jp: 行列演算子の作成
ko: 행렬 연산자 만들기
pt_br: Criando operadores de matriz
ta_in: மேட்ரிக்ஸ் ஆபரேட்டர்களை உருவாக்குதல்
tr_tr: Matris operatörleri oluşturma
zh: 建立矩陣算子

source: We can use the ``Operator`` class in ``qiskit.quantum_info`` to represent arbitrary matrix operators. If the operator is unitary it can then be added to a quantum circuit and used for simulation on Qiskit Aer.
bn_bn: আমরা ``qiskit.quantum_info`` -এর ``Operator`` ক্লাস ব্যবহার করে ইচ্ছামতো ম্যাট্রিক্স অপারেটর বানাতে পারি। অপারেটরটি ঐকিক (ইউনিটারি) হলে সেটাকে কোয়ান্টাম বর্তনীতে (সার্কিট) যোগ করে Qiskit এয়ারে সিমুলেশনের কাজে ব্যবহার করা যায়।
es_un: Podemos utilizar la clase ``Operator`` en ``qiskit.quantum_info`` para representar operadores de matriz arbitrarios. Si el operador es unitario, entonces puede ser añadido a un circuito cuántico y utilizado para simulación en Qiskit Aer.
fr: Nous pouvons utiliser la classe ``Operator`` dans ``qiskit.quantum_info`` pour représenter arbitrairement des opérateurs de tableau. Si l'opérateur est unitaire, il peut être ajouté à un circuit quantique et utilisé pour la simulation dans Qiskit Aer.
id_id: Kita dapat menggunakan class ` ` Operator ` ` ` di ` `qiskit.quantum_info ` ` untuk mewakili berbagai operator matriks. Jika operator adalah unitary ia dapat ditambahkan ke sebuah sirkuit kuantum dan digunakan untuk simulasi dengan Qiskit Aer.
ja_jp: ``qiskit.quantum_info`` の ``Operator`` クラスを使用して、任意の行列演算子を表現できます。 演算子がユニタリーの場合、量子回路に追加し、Qiskit Aer でのシミュレーションに使用することができます。
ko: 우리는 임의의 행렬 연산자를 사용할 때 ``qiskit.quantum_info`` 안의 ``Operator`` 클래스를 사용할 수 있다. 그 연산자가 유니터리이면 양자 회로에 추가하여 Qiskit Aer의 시뮬레이션에 사용할 수 있다.
pt_br: Podemos utilizar a classe ``Operator`` no ``qiskit.quantum_info`` para representar operadores de matriz arbitrários. Se o operador for unitário, pode ser adicionado a um circuito quântico e usado para simulação no Qiskit Aer.
ta_in: தன்னிச்சையான மேட்ரிக்ஸ் ஆபரேட்டர்களைக் குறிக்க ``qiskit.quantum_info`` இல் ``Operator`` வகுப்பைப் பயன்படுத்தலாம். ஆபரேட்டர் யூனிடேரியாக இருந்தால், அதை ஒரு குவாண்டம் சுற்றுக்குச் சேர்த்து Qiskit ஏரில் உருவகப்படுத்துவதற்குப் பயன்படுத்தலாம்.
tr_tr: Rastgele matris operatörlerini temsil etmek için ``qiskit.quantum_info`` içindeki ``Operator`` sınıfını kullanabiliriz. Eğer operatör üniter ise, bir kuantum devresine eklenebilir ve Qiskit Aer'de simülasyon için kullanılabilir.
zh: 我們可以使用 ``qiskit.quantum_info`` 中的 `Operator`` 類別來代表任意矩陣算子。 如果該算子是么正算子就可被新增至量子電路中，並被用在 Qiskit Aer 上進行模擬。

source: Lets create two operators below for a CNOT gate and an iSWAP gate:
bn_bn: CNOT ও iSWAP যুক্তিবর্তনীর (গেইট) জন্য দুটো অপারেটর বানানো যাক:
es_un: Vamos a crear dos operadores a continuación para una compuerta CNOT y una compuerta iSWAP:
fr: Créons deux opérateurs ci-dessous pour une porte CNOT et une porte iSWAP :
id_id: Mari kita buat dua operator di bawah untuk gate CNOT dan gate iSWAP:
ja_jp: CNOTゲートとiSWAPゲート用の2つの演算子を以下で作成してみましょう。
ko: 다음과 같은 CNOT 게이트와 iSWAP 게이트를 만들어 보자.
pt_br: Vamos criar dois operadores para uma porta CNOT e uma porta iSWAP:
ta_in: ஒரு CNOT கேட் மற்றும் iSWAP கேட் ஆகியவற்றிற்காக கீழே இரண்டு ஆபரேட்டர்களை உருவாக்கலாம்:
tr_tr: Bir CNOT geçidi ve bir iSWAP geçidi için aşağıda iki operatör oluşturalım:
zh: 讓我們為 CNOT 閘和 iSWAP 閘建立以下兩個算子：

source: **Note:** The matrix is specified with respect to the tensor product :math:`U_{b}\otimes U_{a}` for qubits specified by list ``[a, b]``.
bn_bn: **বিঃ দ্রঃ** ``[a, b]`` তালিকার কিউবিটের ক্ষেত্রে ম্যাট্রিক্স টা হবে একটা টেনসর গুনফল :math:`U_{b}\o * U_{a}`
es_un: **Nota:** La matriz está especificada con respecto al producto tensorial: :math:`U_{b}\otimes U_{a}` para los qubits especificados por la lista ``[a, b]``.
fr: **Remarque :** La matrice est spécifiée par rapport au produit tensoriel :math:`U_{b}\otimes U_{a}` pour les qubits spécifiés par la liste ``[a,b]``.
id_id: ** Note:** Matrik dispesifikasikan dengan produk tensor :math:` U_{b}\otimes U_{a}` pada qubits yang dispesifikasikan oleh list ` ` [a, b] ` `.
ja_jp: **注意:** 行列はリスト ``[a, b]`` で指定された量子ビットに対して、テンソル積 :math:`U_{b}\otimes U_{a}` として指定されます。
ko: **참고:** 행렬은 목록 ``[a, b]`` 에 의해 지정된 큐비트에 대한 텐서 곱 :math:`U_{b}\otimes U_{a}` 과 관련하여 지정된다.
pt_br: **Nota:** A matriz é especificada em relação ao tensor :math:`U_{b}\otimes U_{a}` para qubits especificados pela lista ``[a, b]``.
ta_in: **குறிப்பு:** டென்சர் தயாரிப்பு தொடர்பாக மேட்ரிக்ஸ் :math:`U_{b}\otimes U_{a}` கியூபிட்களுக்கு ``[a, b]`` பட்டியலால் குறிப்பிடப்பட்டுள்ளது.
tr_tr: **Not:** Matris ``[a, b]`` listesinde belirtilen kübitler için :math:`U_{b}\otimes U_{a}` tensör çarpımına göre belirtilir.
zh: **Note：** 針對張量積 :math:`U_{b}\otimes U_{a}` 代表清單 ``[a， b]`` 中的 quits 指定矩陣。

source: Using operators in circuits
bn_bn: বর্তনীতে (সার্কিট) অপারেটরের ব্যবহার
es_un: Uso de operadores en circuitos
fr: Utilisation d'opérateurs dans les circuits
id_id: Menggunakan operator dalam sirkuit
ja_jp: 回路で演算子を使用する
ko: 회로에서 연산자 사용하기
pt_br: Usando operadores nos circuitos
ta_in: சுற்றுகளில் ஆபரேட்டர்களைப் பயன்படுத்துதல்
tr_tr: Devrelerde operatörlerin kullanılması
zh: 在電路中使用算符

source: Let us demonstrate how these can be used in a circuit. We will consider an example of implementing a CNOT gate decomposed in terms of single-qubit gates and the iSWAP gate as follows.
bn_bn: বর্তনীতে (সার্কিট) কিভাবে এটা ব্যবহার করতে হয় তা দেখা যাক। উদাহরণরূপে আমরা একটা CNOT যুক্তিবর্তনীকে (গেইট) এবং একটা iSWAP যুক্তিবর্তনীকে (গেইট) একক কিউবিট যুক্তিবর্তনীতে (গেইট) ভাঙলাম।
es_un: Vamos a demostrar cómo se pueden utilizar estos en un circuito. Consideraremos un ejemplo de implementación de una compuerta CNOT descompuesta en términos de compuertas de un solo qubit y la compuerta iSWAP de la siguiente manera.
fr: Montrons comment ceux-ci peuvent être utilisés dans un circuit. Nous allons considérer un exemple d'implémentation d'une porte CNOT décomposée en termes de portes à un seul qubit et de la porte iSWAP comme suit.
id_id: Mari kita demonstrasikan bagaimana itu dapat digunakan pada sebuah sirkuit. Kita akan melihat contoh penerapan gate CNOT terurai dalam gate qubit tunggal dan gate iSWAP sebagai berikut.
ja_jp: これらを回路でどのように使用できるかを示しましょう。 ここでは、単一量子ビットゲートとiSWAPゲートで分解されたCNOTゲートの実装例を次のように検討します。
ko: 회로에서 이러한 기능을 사용할 수 있는 방법을 시연해 보겠다. 우리는 단일 쿼비트 게이트와 iSWAP 게이트 측면에서 분해된 CNOT 게이트를 구현하는 예를 다음과 같이 고려할 것이다.
pt_br: Demonstraremos como eles podem ser utilizados num circuito. Vamos considerar um exemplo de implementação de uma porta CNOT decomposta em termos de portas de qubit únicos e da porta iSWAP, da seguinte forma.
ta_in: ஒரு சுற்றில் இவை எவ்வாறு பயன்படுத்தப்படலாம் என்பதை நிரூபிப்போம். நாம் உதாரணமாக ஒற்றை-கியூபிட் கேட்கள் மற்றும் iSWAP கேட்கள் ஆகிய கூறுகளாக பிரிக்கப்பட்ட CNOT கேட்டை செயற்படுத்த பின்வருவனவற்றை நாம் கருத்தில் கொள்வோம்.
tr_tr: Haydi bunların bir devrede nasıl kullanılabileceğini gösterelim. Tek kübitli kapılar ve iSWAP kapısı açısından ayrıştırılmış bir CNOT kapısının uygulanışının bir örneğini aşağıdaki gibi ele alacağız.
zh: 讓我們示範如何在電路中使用這些方法。 我們將考慮實施一個 CNOT 閘的例子，以單量子位元閘和 iSWAP 閘的方式分解，如下所示。

source: Note that we have assigned an optional *label* of ``"iswap"`` to the unitary when it is inserted. This allows us to identify this unitary in a Qiskit Aer ``NoiseModel`` so that we can add errors to these custom unitary gates in noisy circuit simulations.
bn_bn: মনে রাখতে হবে আমরা ঐকিকে ``"iswap"`` যোগ করার সময় একটা ঐচ্ছিক *নাম (লেবেল)* দিয়েছিলাম। এতে Qiskit এয়ারের ``NoiseModel`` এর মধ্যে এই ঐকিকটাকে চিহ্নিত করতে সাহায্য করবে যাতে আমরা ত্রুটিপূর্ণ বর্তনী (সার্কিট) সিমুলেশনের এই বিশেষায়িত (কাস্টম) ঐকিক (ইউনিটারি) যুক্তিবর্তনীতে (গেইট) ত্রুটি যোগ করতে পারি।
es_un: Ten en cuenta que hemos asignado una *etiqueta* opcional de ``"iswap"`` al unitario cuando es insertado. Esto nos permite identificar este unitario en un ``NoiseModel`` de Qiskit Aer para que podamos añadir errores a estas compuertas unitarias personalizadas en simulaciones de circuito ruidosas.
fr: Notez que nous avons attribué un *label* optionnel de ``"iswap"`` à l'unité lorsqu'il est inséré. Cela nous permet d'identifier cet unitaire dans un Qiskit Aer ``NoiseModel`` afin que nous puissions ajouter des erreurs à ces portes unitaires personnalisées dans les simulations de circuits bruités.
id_id: Perhatikan bahwa kita telah menggunakan sebuah *label* opsional dari ` ` ' "iswap" ` ` ke unitary ketika dimasukkan. Hal ini memungkinkan kita untuk mengidentifikasi unitary ini di ``Noise Model`` Qiskit Aer ` sehingga kita dapat menambahkan noise ke gate unitary kustom ini pada simulasi sirkuit yang bernoise.
ja_jp: ユニタリーを追加した際に、オプションの *label* に ``"iswap"`` を指定したことに着目してください。これにより、Qiskit Aer ``NoiseModel`` でこのユニタリーを識別することができ、ノイズがある回路シミュレーションでこれらのカスタムユニタリーゲートにエラーを追加することができます。
ko: 단위가 삽입될 때 ``iswap`` 의 선택적인 *레이블* 을 유니테리에 할당했다는 점에 유의한다. 이를 통해 우리는 Qiskit Air ``Noise Model`` 에서 이 유니테리를 식별하여 소음 회로 시뮬레이션에서 이러한 맞춤형 유니터리 게이트에 오류를 추가할 수 있다.
pt_br: Note que atribuímos uma *etiqueta* opcional de ``"iswap"`` para a unidade quando ela for inserida. Isto nos permite identificar esta unidade em um Qiskit Aer ``NoiseModel`` para que possamos adicionar erros a estas portas unitárias personalizadas, em simulações de circuitos com ruído.
ta_in: யூனிட்டரி செருகப்படும்போது ``"iswap"`` இன் விருப்பமான *label* ஒதுக்கியுள்ளோம் என்பதை நினைவில் கொள்க. Qiskit ஏர் ``NoiseModel`` இந்த யூனிடேரியை அடையாளம் காண இது நம்மை அனுமதிக்கிறது, இதன்மூலம் நாம் இரைச்சல் மிக்க சுற்று உருவகப்படுத்துதல்களில் இந்த வழக்கமான யூனிடேரி கேட்ககளுக்குப் பிழைகளைச் சேர்க்கலாம்.
tr_tr: Eklendiğinde üniteye ``"iswap"``ın isteğe bağlı bir *etiket* atadığımızı unutmayın. Bu bir Qiskit Aer ``NoiseModel`` içinde bu üniteyi tanımlamamıza izin verir böylece gürültülü devre simülasyonlarında bu özel üniter kapılara hatalar ekleyebiliriz.
zh: 請注意，在插入這個么正矩陣時，我們已為它加上一個可選的標籤 ``"iswap"``。這讓我們能在 Qiskit Aer ``NoiseModel`` 中識別這個么正矩陣，這樣一來，我們就可以在具有雜訊的電路模擬中為自訂的么正閘新增誤差。

source: We can confirm this circuit returns the correct output using the ``Operator`` class as a simulator for the circuit:
bn_bn: এই বর্তনী (সার্কিট) যে সঠিক ফলাফল দিচ্ছে তা যাচাইয়ের জন্য আমরা ``Operator`` ক্লাসটাকে বর্তনীর (সার্কিট) জন্য সিমুলেটররূপে ব্যবহার করতে পারি:
es_un: Podemos confirmar que este circuito devuelve la salida correcta utilizando la clase ``Operator`` como un simulador para el circuito:
fr: Nous pouvons confirmer que ce circuit retourne la sortie correcte en utilisant la classe ``Operator`` en tant que simulateur pour le circuit :
id_id: Kita dapat mengkonfirmasi sirkuit ini menghasilkan output yang benar dengan menggunakan class ` ` Operator ` ` sebagai simulator untuk sirkuit:
ja_jp: 回路のシミュレーターとして、 ``Operator`` クラスを使用して正しい出力を返すことを確認できます：
ko: ``Operator`` 클래스를 회로의 시뮬레이터로 사용하여 이 회로가 올바른 출력을 반환하는지 확인한다.
pt_br: Podemos confirmar que este circuito retorna a saída correta usando a classe ``Operator`` como um simulador para o circuito:
ta_in: இந்த சுற்று சுற்றுக்கான சிமுலேட்டராக ``Operator`` வகுப்பைப் பயன்படுத்தி சரியான வெளியீட்டை அளிக்கிறது என்பதை நாங்கள் உறுதிப்படுத்த முடியும்:
tr_tr: Devre için bir simulatör olarak ``Operator``sınıfını kullanarak bu devrenin doğru çıktıyı döndürdüğünü onaylayabiliriz:
zh: 我們可以確認，作為該電路的模擬器，此電路使用 ``Operator`` 類別傳回正確的輸出：

source: And to confirm the output is correct we can compute the average gate fidelity:
bn_bn: ফলাফল যাচাইয়ের জন্য আমরা যুক্তিবর্তনী (গেইট) বিশ্বস্ততার গড় গণনা করতে পারি:
es_un: Y para confirmar que la salida es correcta, podemos calcular la fidelidad promedio de la compuerta:
fr: Et pour confirmer que la sortie est correcte, on peut calculer la fidélité moyenne de la porte :
id_id: Dan untuk mengkonfirmasi output yang benar kita dapat menghitung rata-rata gate fidelity:
ja_jp: 出力が正しいことを確認するために、平均ゲート忠実度を計算することができます。
ko: 또한 출력이 올바른지 확인하기 위해 평균 게이트 신뢰도를 계산할 수 있다.
pt_br: E para confirmar que a saída está correta, podemos calcular a fidelidade média da porta:
ta_in: வெளியீடு சரியானது என்பதை உறுதிப்படுத்த, சராசரி வாயில் நம்பகத்தன்மையை நாம் கணக்கிடலாம்:
tr_tr: Ve çıktının doğru olduğunu onaylamak için ortalama kapının aslına uygunluğunu hesaplayabiliriz:
zh: 要確認該輸出是正確的，我們可以計算其平均閘保真度：

source: Creating a custom unitary in a noise model
bn_bn: একটা ত্রুটি নকশায় বিশেষায়িত (কাস্টম) ঐকিক (ইউনিটারি) বানানো
es_un: Creación de un unitario personalizado en un modelo de ruido
fr: Création d'une unité personnalisée dans un modèle de bruit
id_id: Membuat suatu kustom unitary dalam sebuah model noise
ja_jp: ノイズモデルでカスタムユニタリーを作成する
ko: 노이즈 모델에서 맞춤 유니터리 만들기
pt_br: Criando um unitário personalizado em um modelo com ruído
ta_in: இரைச்சல் மாதிரியில் தனிப்பயன் ஒற்றுமையை உருவாக்குதல்
tr_tr: Gürültü modelinde özel bir üniter oluşturma
zh: 在雜訊模型中建立一個自訂的么正矩陣

source: The Qiskit Aer ``QasmSimulator`` supports simulation of arbitrary unitary operators directly as specified by the ``"unitary"`` in the basis gates.
id_id: Qiskit Aer ` ` QasmSimulator ` ` mensupport simulasi berbagai operator unitary secara langsung seperti yang ditentukan oleh ` ` "unitary" ` ` di gate dasar.
ja_jp: Qiskit Aer ``QasmSimulator`` は、ベースゲート内の ``"unitary"`` で指定された任意のユニタリー演算子のシミュレーションを直接サポートします。
pt_br: O Qiskit Aer ``QasmSimulator`` suporta a simulação de operadores unitários arbitrários, diretamente como especificado pelo ``"unitário"`` nas portas da base.

source: This allows us to add noise models to arbitrary unitaries in our simulation when we identify them using the optional ``label`` argument of ``QuantumCircuit.unitary``.
bn_bn: এর দ্বারা আমাদের সিমুলেশনের বিভিন্ন ঐকিককে ``QuantumCircuit.unitary`` এর ``label`` আর্গুমেন্ট(ঐচ্ছিক) দিয়ে চিহ্নিত করে তাতে ত্রুটি নকশা যোগ করতে পারি।
es_un: Esto nos permite añadir modelos de ruido a unitarios arbitrarios en nuestra simulación cuando los identificamos utilizando el argumento opcional ``label`` de ``QuantumCircuit.unitary``.
fr: Cela nous permet d'ajouter des modèles de bruit à des unités arbitraires dans notre simulation lorsque nous les identifions en utilisant l'argument optionnel ``label`` de ``QuantumCircuit.unitary``.
id_id: Hal ini memungkinkan kita untuk menambahkan model noise ke berbagai unitary dalam simulasi dengan mengidentifikasi mereka menggunakan argument opsional ` ` ` label ` ` dari ` `QuantumCircuit.unitary ` `.
ja_jp: これにより、オプションの ``QuantumCircuit.unitary`` の ``label`` 引数を使用して、シミュレーション内の任意のユニタリーにノイズモデルを追加することができます。
ko: 이를 통해 ``QuantumCircuit.unitary`` 의 선택적인 ``label`` 인수를 사용하여 이를 식별할 때 시뮬레이션에서 임의 유니터리에 노이즈 모델을 추가할 수 있다.
pt_br: Isso nos permite adicionar modelos com ruído às unidades arbitrárias em nossa simulação, quando as identificamos usando o argumento opcional ``label`` do ``QuantumCircuit.unitary``.
ta_in: ``QuantumCircuit.unitary`` இன் விருப்பமான `` label`` வாதத்தைப் பயன்படுத்தி அடையாளம் காணும்போது, ​​எங்கள் உருவகப்படுத்துதலில் தன்னிச்சையான யூனிடரிகளுக்கு சத்தம் மாதிரிகள் சேர்க்க இது நம்மை அனுமதிக்கிறது.
tr_tr: Bu, ``QuantumCircuit.unitary``nin isteğe bağlı ``label`` argümanını kullanarak onları tanımladığımızda, simülasyonumuzdaki rastgele ünitelere gürültü modelleri eklememize izin verir.
zh: 當我們使用 ``QuantumCircuit.unitary`` 的可選 ``label`` 引數識別它們時，這允許我們將雜訊模型添加到我們的模擬中的任意么正閘。

source: We will now do this by creating a ``NoiseModel`` that includes a quantum error channel on our custom iSWAP gate. For our example we will create a 2-qubit error consisting of two single-qubit amplitude damping channels with different damping parameters. For now we will assume all the other circuit instructions are ideal.
bn_bn: এটা করার জন্য আমরা একটা ``NoiseModel`` বানাবো যাতে আমাদের বিশেষায়িত (কাস্টম) iSWAP যুক্তিবর্তনীর (গেইট) উপর একটা কোয়ান্টাম ত্রুটি চ্যানেল থাকবে। আমাদের উদাহরণের জন্য আমরা একটা ২-কিউবিট ত্রুটি বানাবো যার মধ্যে দুটো আলাদা অবনমন (ড্যাম্পিং) প্যারামিটারসম্পন্ন এক-কিউবিট বিস্তার অবনমন (ড্যাম্পিং) চ্যানেল থাকবে। এখনকার মতো আমরা ধরে নেবো বর্তনীর বাকি সব নির্দেশনা আদর্শ।
es_un: Ahora haremos esto creando un ``NoiseModel`` que incluye un canal de error cuántico en nuestra compuerta iSWAP personalizada. Para nuestro ejemplo crearemos un error de 2 qubits que consiste de dos canales de amortiguamiento de amplitud de un solo bit con diferentes parámetros de amortiguamiento. Por ahora supondremos que todas las otras instrucciones del circuito son ideales.
fr: Nous allons maintenant le faire en créant un ``NoiseModel`` qui inclut un canal d'erreur quantique sur notre portail iSWAP personnalisé. Pour notre exemple, nous allons créer une erreur 2-qubit composée de deux canaux d'amortissement d'amplitude simple avec des paramètres d'amortissement différents. Pour l'instant, nous supposons que toutes les autres instructions de circuit sont idéales.
id_id: Kita sekarang akan melakukan hal ini dengan membuat ` ` NoiseModel ` ` yang mencakup channel error kuantum pada gerbang kustom iSWAP. Sebagai contoh kita akan membuat 2-qubit error yang terdiri dari dua single-qubit amplitude damping channel dengan parameter damping yang berbeda. Untuk saat ini kita mengasumsikan semua instruksi sirkuit yang lain adalah ideal.
ja_jp: これを行うには、カスタムiSWAPゲートに量子エラーチャネルを含む ``NoiseModel`` を作成します。 この例では、異なる減衰パラメータを持つ2つの単一量子ビット振幅減衰チャネルからなる2量子ビット誤差を作成します。 今のところ、他のすべての回路命令が理想的であると仮定します。
ko: 이제 사용자 지정 iSWAP 게이트에 양자 오류 채널이 포함된 ``NoiseModel`` 을 만들어 이를 수행할 것이다. 이 예에서는 서로 다른 감폭 매개 변수를 가진 2개의 단일 큐비트 진폭 감폭 채널로 구성된 2-큐비트 오류를 생성한다. 지금은 다른 모든 회로 지침 이상적인 것으로 가정한다.
pt_br: Agora vamos fazer isso criando um ``NoiseModel`` que inclui um canal de erro quântico na nossa porta personalizada para iSWAP. Para nosso exemplo, vamos criar um erro 2-qubit, composto por dois canais com amortecimento com amplitude de um single-qubit e parâmetros de amortecimento distintos. Por agora, partiremos do princípio de que todas as outras instruções são ideais.
ta_in: எங்கள் தனிப்பயன் iSWAP வாயிலில் குவாண்டம் பிழை சேனலை உள்ளடக்கிய `` NoiseModel`` ஐ உருவாக்குவதன் மூலம் இதை இப்போது செய்வோம். எங்கள் எடுத்துக்காட்டுக்கு, இரண்டு ஒற்றை-குவிட் அலைவீச்சு அடர்த்தியான சேனல்களைக் கொண்ட 2-குவிட் பிழையை வெவ்வேறு தணிக்கும் அளவுருக்களுடன் உருவாக்குவோம். இப்போதைக்கு மற்ற அனைத்து சுற்று வழிமுறைகளும் சிறந்தவை என்று கருதுவோம்.
tr_tr: Şimdi bunu, özel iSWAP geçidimizde bir kuantum hata kanalı içeren bir ``NoiseModel`` oluşturarak yapacağız. Örneğimiz için, farklı sönümleme parametrelerine sahip iki adet tek kübit genlikli sönümleme kanalından oluşan 2 kübitlik bir hata oluşturacağız. Şimdilik diğer tüm devre talimatlarının ideal olduğunu varsayacağız.
zh: 現在我們將建立一個 ``NoiseModel`` ，其中包括在我們自訂 iSWAP 閘上的一個量子誤差通道。 舉例，我們將會建立一個雙量子位元誤差，此誤差由兩個具有不同阻尼參數的單量子位元振幅阻尼通道組成。 目前我們將假設除此之外的所有電路指令都是理想的。
