Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/simulators/6_extended_stabilizer_tutorial.po
Languages: bn_bn, es_un, id_id, ja_jp, ko_kr, pt_un, ta, tr, zh

source: This page was generated from `tutorials/simulators/6_extended_stabilizer_tutorial.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/simulators/6_extended_stabilizer_tutorial.ipynb`__ -থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/simulators/6_extended_stabilizer_tutorial.ipynb`__.
id_id: Halaman ini dibuat dari ` tutorials/algoritms/01_grover.ipynb ` __.
ja_jp: このページは `tutorials/simulators/6_extended_stabilizer_tutorial.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/simulators/6_extended_stabilizer_tutorial.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir do `tutoriais/simuladores/6_tutorial_estabilizador_extendido.ipynb`__.
ta: இந்த பக்கம் `tutorials/simulators/6_extended_stabilizer_tutorial.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
tr: Bu sayfa `tutorials/simulators/6_extended_stabilizer_tutorial.ipynb`__ adresinden oluşturulmuştur.
zh: 此頁面是從 "tutorials/simulators/6_extended_penizer_tutorial.ipynb`__ 產生。

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/simulators/6_extended_stabilizer_tutorial.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/simulators/6_extended_stabilizer_tutorial.ipynb>`_.

source: The Extended Stabilizer Simulator
bn_bn: সম্প্রসারিত সুস্থিতিকারী সিমুলেটর
es_un: El Simulador de Estabilizador Extendido
id_id: Perluasan Simulator Stabilizer
ja_jp: 拡張スタビライザーシミュレーション
ko_kr: 확장된 스테빌라이저 시뮬레이터
pt_un: O Simulador de Estabilizador Estendido
ta: நீட்டிக்கப்பட்ட நிலைப்படுத்தி சிமுலேட்டர்
tr: Genişletilmiş Dengeleyici Simülatörü
zh: 擴展穩定模擬器

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
id_id: Pengantar
ja_jp: はじめに
ko_kr: 소개
pt_un: Introdução
ta: முன்னுரை
tr: Giriş
zh: 簡介

source: The Extended Simulator is a new method for classically simulating quantum circuits available in the latest release of `Qiskit-Aer <https://github.com/qiskit/qiskit-aer>`__.
bn_bn: কোয়ান্টাম বর্তনীকে (সার্কিট) ধ্রুপদীভাবে সিমুলেট করার জন্য সম্প্রসারিত সিমুলেটর ব্যবহার করা যায়। এটা `Qiskit-Aer <https://github.com/qiskit/qiskit-aer>`__ -এর নতুন প্রকাশে (রিলিজ) পাওয়া যাবে।
es_un: El Simulador Extendido es un nuevo método para la simulación clásica de circuitos cuánticos disponible en la última versión de `Qiskit-Aer <https://github.com/qiskit/qiskit-aer>`__.
id_id: Extended Simulator adalah metode baru untuk simulasi sirkuit kuantum secara klasik yang tersedia dalam rilis terbaru dari ` Qiskit-Aer <https://github.com/qiskit/qiskit-aer>` __.
ja_jp: Extended Simulatorは、`Qiskit-Aer <https://github.com/qiskit/qiskit-aer>`__ の最新リリースで利用可能な量子回路を古典的にシミュレートするための新しいメソッドです。
ko_kr: 확장 시뮬레이터는 Qiskit-Aer <https://github.com/qiskit/qiskit-aer>" 의 최신 릴리스에서 사용할 수 있는 양자 회로를 고전적으로 시뮬레이트하는 새로운 방법이다.
pt_un: O Simulador Estendido é um novo método para simular classicamente circuitos quânticos disponíveis no lançamento mais recente do `Qiskit-Aer <https://github.com/qiskit/qiskit-aer>`__.
ta: விரிவாக்கப்பட்ட சிமுலேட்டர் என்பது சமீபத்திய வெளியீடு `Qiskit-Aer <https://github.com/qiskit/qiskit-aer>`__ கிடைக்கும். இது குவாண்டம் சர்க்யூட்களை கிளாசிக்கலாக உருவகப்படுத்துவதற்கான ஒரு புதிய முறையாகும்.
tr: Genişletilmiş Simülatör, `Qiskit-Aer <https://github.com/qiskit/qiskit-aer>`__'nin en son sürümünde bulunan kuantum devrelerini klasik olarak simüle etmek için yeni bir yöntemdir.
zh: 擴展穩定模擬器是一種經典地模擬量子電路的新方法。在 `Qiskit-Aer <https://github.com/qiskit/qiskit-aer>`__ 的最新版本中可以找到。

source: This method is an implementation of the ideas published in the paper *Simulation of quantum circuits by low-rank stabilizer decompositions* by Bravyi, Browne, Calpin, Campbell, Gosset & Howard, 2018, `arXiv:1808.00128 <https://arxiv.org/abs/1808.00128>`__.
bn_bn: এই পদ্ধতিটা একটা গবেষণাপত্র থেকে পাওয়া *Simulation of quantum circuits by low-rank stabilizer decompositions* by Bravyi, Browne, Calpin, Campbell, Gosset & Howard, 2018, `arXiv:1808.00128 <https://arxiv.org/abs/1808.00128>`__।
es_un: Este método es una implementación de las ideas publicadas en el artículo *Simulation of quantum circuits by low-rank stabilizer decompositions* de Bravyi, Browne, Calpin, Campbell, Gosset & Howard, 2018, `arXiv:1808.00128 <https://arxiv.org/abs/1808.00128>`__.
id_id: Metode ini merupakan implementasi dari ide-ide yang dipublikasikan dalam makalah *Simulation of quantum circuits by low-rank stabilizer decompositions* oleh Bravyi, Browne, Calpin, Campbell, Gosset & Howard, 2018, ` arXiv: 1808.00128 <https://arxiv.org/abs/1808.00128>` __.
ko_kr: 이 방법은 논문에 발표된 아이디어를 구현한 것이다. *Simulation of quantum circuits by low-rank stabilizer decompositions* by Bravyi, Browne, Calpin, Campbell, Gosset & Howard, 2018, `arXiv:1808.00128 <https://arxiv.org/abs/1808.00128>`__.
pt_un: Este método é uma implementação das ideias publicadas no artigo *Simulation of quantum circuits by low-rank stabilizer decompositions* por Bravyi, Browne, Calpin, Campbell, Gosset & Howard, 2018, `arXiv:1808.00128 <https://arxiv.org/abs/1808.00128>`__.
ta: இந்த முறை இத்தாளில் வெளியிடப்பட்ட யோசனைகளின் செயல்பாடாகும், *Simulation of quantum circuits by low-rank stabilizer decompositions* by Bravyi, Browne, Calpin, Campbell, Gosset & Howard, 2018, `arXiv:1808.00128 <https://arxiv.org/abs/1808.00128>`__.
tr: Bu yöntem, Bravyi'nin *Simulation of quantum circuits by low-rank stabilizer decompositions* adlı makalede yayınlanan fikirlerin bir uygulamasıdır, Browne, Calpin, Campbell, Gosset & Howard, 2018, `arXiv:1808.00128 <https://arxiv.org/abs/1808.00128>`__.
zh: 此方法實踐了 *Simulation of quantum circuits by low-rank stabilizer decompositions* by Bravyi, Browne, Calpin, Campbell, Gosset & Howard, 2018, `arXiv:1808.00128 <https://arxiv.org/abs/1808.00128>`__這篇論文的想法。

source: It uses a different representation of a quantum circuit, that gives it some unique capabilities. This notebook will give some examples of what the extended stabilizer method can do.
bn_bn: এটা কোয়ান্টাম বর্তনীর (সার্কিট) একটা আলাদা উপস্থাপন কাজে লাগায় যার জন্য এর কিছু অতিরিক্ত ক্ষমতা আছে। এই নোটবুকে সম্প্রসারিত সুস্থিতিকারক পদ্ধতির কিছু কাজের নমুনা দেখা যাবে।
es_un: Utiliza una representación diferente de un circuito cuántico, que le da algunas capacidades únicas. Este cuaderno te dará algunos ejemplos de lo que puede hacer el método de estabilizador extendido.
id_id: Simulasi ini menggunakan representasi sirkuit kuantum yang berbeda, dan yang memberikan beberapa kemampuan unik. Notebook ini akan memberikan beberapa contoh dari apa yang dapat dilakukan dengan metode extended stabilizer.
ja_jp: それは量子回路の異なる表現を使用し、それはいくつかのユニークな機能を与えます。 このノートブックは、拡張スタビライザ方式ができることのいくつかの例を示します。
ko_kr: 양자 회로의 다른 표현을 사용하여 고유한 기능을 제공한다. 이 노트북은 확장된 스태빌라이저 메서드가 할 수 있는 몇 가지 예를 제공한다.
pt_un: Ele usa uma representação diferente de um circuito quântico, que lhe dá algumas capacidades únicas. Este notebook vai dar alguns exemplos do que o método de estabilizador estendido pode fazer.
ta: இது ஒரு குவாண்டம் சுற்றுக்கு வேறுபட்ட பிரதிநிதித்துவத்தைப் பயன்படுத்துகிறது, அது இதற்கு சில தனிப்பட்ட திறன்களைத் தருகிறது. நீட்டிக்கப்பட்ட நிலைப்படுத்தி முறை என்ன செய்ய முடியும் என்பதற்கு இந்த புத்தகம் சில எடுத்துக்காட்டுகளைத் தரும்.
tr: Bir kuantum devresinin farklı bir temsilini kullanır, bu da ona bazı benzersiz yetenekler verir. Bu defter, genişletilmiş sabitleyici yönteminin neler yapabileceğine dair bazı örnekler verecektir.
zh: 它用不同的方式來表示同一個量子電路，這就給了它一些獨特的功能。 此筆記本會展示一些範例，來說明擴展穩定器方法可以做什麼。

source: For example:
bn_bn: উদাহরণরূপ:
es_un: Por ejemplo:
id_id: Sebagai contoh:
ja_jp: 例:
ko_kr: 예를 들어:
pt_un: Por exemplo:
ta: உதாரணத்திற்கு:
tr: Örneğin:
zh: 例如:

source: We’ve created a random circuit with just 60 gates, that acts on 40 qubits. But, because of the number of qubits, if we wanted to run this with say the statevector simulator then I hope you have access to terabytes of RAM!
bn_bn: আমরা ৬০টা যুক্তিবর্তনী (গেইট) দিয়ে একটা বর্তনী বানিয়েছি যেটা ৪০টা কিউবিটের উপর কাজ করে। কিন্তু যদি অবস্থা ভেক্টর বা দিকরাশি সিমুলেটরে আমরা এটা চালানোর চেষ্টা করি, রাম টেরাবাইটে এক্সেস করতে হবে!
es_un: Creamos un circuito aleatorio con solo 60 compuertas, que actúa en 40 qubits. Pero, debido a la cantidad de qubits, si quisiéramos ejecutar esto, por ejemplo, con el simulador de statevector, entonces ¡espero que tengas acceso a terabytes de RAM!
id_id: Kita telah menciptakan sirkuit acak dengan hanya 60 gate, yang bertindak pada 40 qubits. Tapi, karena banyaknya jumlah qubits, jika kita ingin menjalankan ini dengan mengatakan simulator statevector maka kita harus memiliki akses ke terabyte RAM!
ko_kr: 우리는 단지 60개의 게이트를 가지고 있고 40개의 큐비트로 동작하는 랜덤 회로를 만들었다. 하지만, 큐비트의 수 때문에, 만약 우리가 이것을 상태벡터 시뮬레이터로 실행하고 싶다면, 여러분이 테라바이트의 RAM을 가지고 있기를 바란다.
tr: Sadece 60 kapılı, 40 kübit üzerinde çalışan rastgele bir devre oluşturduk. Ancak, kübit sayısı nedeniyle, bunu diyelim ki durum vektörü simülatörü ile çalıştırmak istersek, umarım terabaytlarca RAM'e erişiminiz olur!
zh: 我們創建了一個只有 60 個閘的隨機電路，此電路作用在 40 個量子位元上。 但是由於該量子位元的數量，如果我們想在狀態向量等模擬器中執行此操作，我希望您擁有太字節 (terabytes) 這麼大的記憶體！

source: The Extended Stabilizer method, in contrast, handles this circuit just fine. (Though it needs a couple of minutes!)
bn_bn: অন্যদিকে সম্প্রসারিত সুস্থিতিকারক পদ্ধতিতে এই বর্তনী সহজেই চালানো যাবে। (যদিও এতে কয়েক মিনিট সময় নেবে)
es_un: El método de estabilizador extendido, por el contrario, maneja este circuito muy bien. (¡Aunque necesita un par de minutos!)
id_id: Metode Extended Stabilizer, sebaliknya, bisa menangani sirkuit ini dengan baik. (Meskipun butuh beberapa menit!)
ja_jp: 対照的に、Extended Stabilizerメソッドはこの回路をうまく処理します(数分かかりますが)。
ko_kr: 확장된 스태빌라이저 매서드는 이 회로를 (2분이 걸리긴 하지만!) 잘 처리한다.
pt_un: O método de Estabilizador Estendido, em contraste, lida bem com este circuito. (Embora precise de alguns minutos!)
ta: நீட்டிக்கப்பட்ட நிலைப்படுத்தி முறை, இதற்கு மாறாக, இந்த சர்க்யூட்டை நன்றாக கையாளுகிறது.(அதற்கு ஓரிரு நிமிடங்கள் தேவை என்றாலும்!)
tr: Genişletilmiş Sabitleyici yöntemi, aksine, bu devreyi gayet iyi idare eder. (Birkaç dakikaya ihtiyacı olmasına rağmen!)
zh: 相比之下，該擴展穩定器方法可以很好地處理這個電路（儘管需要幾分鐘）。

source: How does this work?
bn_bn: কিভাবে এটা কাজ করে?
es_un: ¿Cómo funciona?
id_id: Bagaimana cara kerjanya?
ja_jp: これはどのように動作しているのでしょうか？
ko_kr: 이게 어떻게 작동하지?
pt_un: Como isto funciona?
ta: இது எப்படி வேலை செய்கிறது?
tr: Bu nasıl çalışıyor?
zh: 這是怎麼運作的？

source: If you’re interested in how exactly we can handle such large circuits, then for a detailed explanation you can `read the paper! <https://arxiv.org/abs/1808.00128>`__
bn_bn: এতো বড়ো বর্তনী কিভাবে কাজে লাগানো হচ্ছে তা বিশদে জানতে `read the paper! <https://arxiv.org/abs/1808.00128>`__
es_un: Si estás interesado en cómo exactamente podemos manejar circuitos tan grandes, entonces para obtener una explicación detallada, puedes `¡leer el documento! <https://arxiv.org/abs/1808.00128>`__
id_id: Jika Anda tertarik pada bagaimana tepatnya kita dapat menangani sirkuit besar seperti itu, maka untuk penjelasan rinci Anda dapat baca makalah ` <https://arxiv.org/abs/1808.00128>` __
ko_kr: 이러한 대형 회로를 정확하게 처리할 수 있는 방법에 관심이 있다면, 자세한 설명을 위해 `논문을 읽을 수 있다! <https://arxiv.org/abs/1808.00128>`__
tr: Bu kadar büyük devrelerle tam olarak nasıl başa çıkabileceğimizle ilgileniyorsanız, ayrıntılı bir açıklama için makaleyi okuyabilirsiniz! <https://arxiv.org/abs/1808.00128>`__
zh: 如果您對我們如何處理這麼大的電路有興趣，您可以 `查看這篇論文！ <https://arxiv.org/abs/1808.00128>`__ 以獲得詳細的解釋。

source: For running circuits, however, it’s important to just understand the basics.
bn_bn: বর্তনী চালানোর জন্য শুধু প্রাথমিকটা বুঝলেই হবে।
es_un: Sin embargo, para ejecutar circuitos, es importante comprender los conceptos básicos.
id_id: Untuk menjalankan sirkuit, walau begitu, penting untuk hanya memahami dasar-dasarnya.
ko_kr: 그러나 실행 회로의 경우에는 기본적인 사항을 이해하는 것이 중요하다.
tr: Ama devreleri çalıştırmak için, sadece temelleri anlamak önemlidir.
zh: 然而，在執行電路前，重要的是要了解基礎知識。

source: The Extended Stabilizer method is made up of two parts. The first is a method of decomposing quantum circuits into *stabilizer circuits*, a special class of circuit that can be efficiently simulated classically. The second is then a way of combining these circuits to perform measurements.
bn_bn: সম্প্রসারিত সুস্থিতিকারক পদ্ধতির দুটো অংশ আছে। প্রথমে কোয়ান্টাম বর্তনীগুলো (সার্কিট) *সুস্থিতিকারী বর্তনী (সার্কিট)* -তে ভাঙতে হয়। এই বর্তনীগুলো বিশেষ রকমের, যাতে সহজেই ধ্রুপদীভাবে সিমুলেট করা যায়। দ্বিতীয়ে এই বর্তনীগুলো যোগ করে পরিমাপ করা হয়।
es_un: El método de estabilizador extendido consta de dos partes. El primero es un método para descomponer circuitos cuánticos en *circuitos estabilizadores*, una clase especial de circuito que puede simularse de manera clásica de manera eficiente. El segundo es entonces una forma de combinar estos circuitos para realizar mediciones.
id_id: Metode Extended Stabilizer terdiri dari dua bagian. Yang pertama adalah metode dekomposisi sirkuit kuantum ke * stabilizer circuit*, satu class sirkuit khusus yang dapat secara efisien disimulasikan secara klasik. Yang kedua adalah cara menggabungkan sirkuit ini untuk melakukan pengukuran.
ja_jp: Extended Stabilizerメソッドは2つの部分から構成されています。 1つ目は、量子回路を*スタビライザ回路*に分解する方法で、古典的に効率的にシミュレーションできる特別なクラスの回路です。 次に、これらの回路を組み合わせて測定を行う方法です。
ko_kr: 확작된 스태빌라이저 매서드는 두 부분으로 구성된다. 첫 번째는 양자 회로를 *stabilizer 회로* 로 분해하는 방법인데, 고전적으로 효율적으로 시뮬레이션할 수 있는 회로의 특별한 클래스이다. 두 번째는 이러한 회로를 결합하여 측정을 수행하는 방법이다.
pt_un: O método de Estabilizador Estendido é composto por duas partes. A primeira é um método de decomposição de circuitos quânticos em *circuitos estabilizadores*, uma classe especial de circuito que pode ser eficientemente simulada classicamente. A segunda é então uma maneira de combinar esses circuitos para realizar medições.
ta: விரிவாக்கப்பட்ட நிலைப்படுத்தி முறை இரண்டு பகுதிகளால் ஆனது. முதலாவது குவாண்டம் சர்க்யூட்களை *நிலைப்படுத்தி சர்க்யூட்கள்* சிதைக்கும் ஒரு முறையாகும், இது ஒரு சிறப்பு வகுப்பு சர்க்யூட் ஆகும், இது கிளாசிக்கலாக திறமையாக உருவகப்படுத்தப்படலாம். இரண்டாவதாக, இந்த சர்க்யூட்களை ஒன்றிணைத்து அளவீடுகளைச் செய்வதற்கான ஒரு வழியாகும்.
tr: Genişletilmiş Sabitleyici yöntemi iki bölümden oluşur. Birincisi, kuantum devrelerini, klasik olarak verimli bir şekilde simüle edilebilen özel bir devre sınıfı olan *dengeleyici devrelere* ayrıştırma yöntemidir. İkincisi, ölçüm yapmak için bu devreleri birleştirmenin bir yoludur.
zh: 此擴展穩定器方法由兩個部分組成。 第一是一種將量子電路分解為 *stabilizer circuits* 的方法，這是一種可以被有效率地,，古典地模擬的特殊電路類別。 第二是如何組合這些電路從而進行測量。

source: The number of terms you need scales with the number of what we call *non-Clifford Gates*. At the moment, the method knows how to handle the following methods:
bn_bn: কটা পরিভাষা আমাদের লাগবে তা *নন-ক্লিফোর্ড যুক্তিবর্তনীর (গেট)* সংখ্যার উপর নির্ভরশীল। আপাতত এই পদ্ধতিতে নিম্নলিখিত কাজগুলো করা যায়:
es_un: El número de términos que necesita se escala con el número de lo que llamamos *non-Clifford Gates* (computertas no de tipo Clifford). Por el momento, el método sabe cómo manejar los siguientes métodos:
id_id: Jumlah terms yang kita butuhkan berbanding dengan jumlah apa yang kita sebut * non-Clifford Gates *. Pada saat ini, metode ini tahu bagaimana menangani metode-metode berikut:
ja_jp: あなたが必要とする項目数は、私たちが *非Clifford Gate* と呼ぶものの数に比例します。 現時点では、メソッドは次のメソッドを処理する方法を知っています。
ko_kr: 필요한 항 수는 우리가 비클리퍼드(non-Clifford) 게이츠라고 부르는 수의 척도에 따라 조정된다. 현재 이 방법은 다음과 같은 방법을 어떻게 처리하는지 알고 있다.
pt_un: O número de termos que você precisa escala com o número do que chamamos *Portas não Clifford*. No momento, o método sabe lidar com os seguintes métodos:
ta: *கிளிஃபோர்ட் அல்லாத கேட்ஸ்* என்று நாங்கள் அழைக்கும் எண்ணிக்கையுடன் உங்களுக்கு அளவுகள் தேவைப்படும் சொற்களின் எண்ணிக்கை. இந்த நேரத்தில், பின்வரும் முறைகளை எவ்வாறு கையாள்வது என்பது முறைக்குத் தெரியும்:
tr: İhtiyacınız olan terim sayısı, bizim *Clifford Gates dışı* dediğimiz terimlerin sayısıyla orantılıdır. Şu anda, yöntem aşağıdaki yöntemlerin nasıl ele alınacağını bilir:
zh: 您需要的數學項的數量與我們所說的*non-Clifford 閘*的數量有關。 目前，該方法知道如何處理以下方法：

source: The simulator is also able to handle circuits of up to 63 qubits.
bn_bn: এই সিমুলেটরে সর্বাধিক ৬৩টা কিউবিটসম্পন্ন বর্তনীর উপর কাজ করা যায়।
es_un: El simulador también puede manejar circuitos de hasta 63 qubits.
id_id: Simulator ini juga mampu menangani sirkuit hingga 63 qubits.
ja_jp: シミュレータは最大63量子ビットの回路を処理することもできます。
ko_kr: 또한 시뮬레이터는 최대 63큐비트의 회로를 다룰 수 있다.
pt_un: O simulador também é capaz de manipular circuitos de até 63 qubits.
ta: ஒப்புருவாக்கியால் 63 கியூபிட்ஸ் வரை சர்க்யூட்களை கையாள முடியும்.
tr: Simülatör ayrıca 63 kübit'e kadar olan devreleri de işleyebilir.
zh: 該模擬器也能夠處理多達 63 個量子位元的電路。

source: One thing that’s important to note is these decompositions are approximate. This means that the results aren’t exactly the same as with the State Vector simulator.
bn_bn: মনে রাখতে হবে এই বিশ্লেষণগুলো আনুমানিক। অর্থাৎ অবস্থা নির্ণায়ক দিকরাশি (স্টেট ভেক্টর) সিমুলেটরের ফলের সাথে এই ফল পুরোপুরি মিলবে না।
es_un: Una cosa que es importante tener en cuenta es que estas descomposiciones son aproximadas. Esto significa que los resultados no son exactamente los mismos que con el simulador de Vector de Estado.
id_id: Satu hal yang penting untuk dicatat adalah dekomposisi ini adalah aproksimasi. Ini berarti bahwa hasilnya tidak persis sama seperti dengan simulator State Vector.
ko_kr: 주목해야 할 중요한 것 중 하나는 이러한 분해가 대략적인 것이다. 이것은 결과가 상태 벡터 시뮬레이터와 정확히 동일하지 않다는 것을 의미한다.
tr: Unutulmaması gereken önemli bir şey, bu ayrıştırmaların yaklaşık olmasıdır. Bu, sonuçların Durum Vektörü simülatörü ile tam olarak aynı olmadığı anlamına gelir.
zh: 值得注意的重點是這些只是近似的分解。 也就是說其結果與狀態向量模擬器 ( State Vector simulator) 產生的結果將不完全相同。

source: You can control this approximation error using the ``extended_stabilizer_approximation_error`` in Qiskit Aer. The default error is 0.05. The smaller the error, the more precise the results, but also the longer your simulation will take and the more memory it will require.
bn_bn: এই অনুমান ত্রুটি নিয়ন্ত্রণ করতে হলে Qiskit এয়ারে ``extended_stabilizer_approximation_error`` এর সাহায্য নিতে হয়। সাধারণত এর মান ০.০৫। এটা যত কম হবে ফল তত ভালো হবে, কিন্তু সিমুলেশনে সময় এবং মেমরিও বেশি লাগবে।
es_un: Puedes controlar este error de aproximación utilizando el ``extended_stabilizer_approximation_error`` en Qiskit Aer. El error predeterminado es 0.05. Cuanto menor sea el error, más precisos serán los resultados, pero también más tiempo llevará su simulación y más memoria requerirá.
id_id: Anda dapat mengontrol error aproksimasi dengan menggunakan ` ` extended_stabilizer_approximation_error ` ` di Qiskit Aer. Default error adalah 0.05. Semakin kecil error, semakin tepat hasilnya, tetapi juga semakin lama simulasi memakan waktu dan semakin banyak memori yang dibutuhkan.
ko_kr: Qiskit Aer에서 ``extended_stabilizer_approximation_error`` 를 사용하여 위와 같은 근사 오류를 제어할 수 있다. 초기 설정된 오류 값은 0.05 이다. 오류가 작을수록 결과는 더 정확하지만, 시뮬레이션을 수행하는데 더 오랜 시간이 걸리기 때문에 더 많은 메모리가 필요할 것이다.
pt_un: Você pode controlar este erro de aproximação usando o ``extended_stabilizer_approximation_error`` no Qiskit Aer. O erro padrão é 0,05. Quanto menor o erro, mais precisos serão os resultados, mas também mais tempo sua simulação irá demorar e mais memória ela exigirá.
ta: Qiskit ஏரில் ``extended_stabilizer_approximation_error`` ஐப் பயன்படுத்தி இந்த தோராய பிழையை நீங்கள் கட்டுப்படுத்தலாம். இயல்புநிலை பிழை 0.05 ஆகும். சிறிய பிழை, மிகவும் துல்லியமான முடிவுகள், ஆனால் உங்கள் உருவகப்படுத்துதலுக்கு அதிக நேரம் எடுக்கும், மேலும் அதிக நினைவகம் தேவைப்படும்.
tr: Bu yaklaşım hatasını, Qiskit Aer'deki ``extended_stabilizer_approximation_error`` kullanarak kontrol edebilirsiniz. Varsayılan hata 0.05'tir. Hata ne kadar küçük olursa, sonuçlar o kadar kesin olur, ancak aynı zamanda simülasyonunuz o kadar uzun sürer ve o kadar fazla bellek gerektirir.
zh: 您可以使用 Qiskit Aer 的 ``extended_stabilizer_approximation_error`` 來控制這個近似誤差。 默認誤差為 0.05。 誤差越小，結果越準確，但模擬所需的時間越長，需要的記憶體就越多。

source: Simulator Options
bn_bn: সিমুলেটরের বিকল্প
es_un: Opciones del Simulador
id_id: Opsi Simulator
ja_jp: シミュレーターオプション
ko_kr: 시뮬레이터 옵션
pt_un: Opções do Simulador
ta: சிமுலேட்டர் விருப்பங்கள்
tr: Simülatör Seçenekleri
zh: 模擬器選項

source: There are several other options you can tweak to control how the extended stabilizer method performs. What these options are and their explanation can all be found in the Qiskit Aer documentation. However, I want to highlight two important ones that can help to optimize your simulations.
bn_bn: সম্প্রসারিত সুস্থিতিকারক পদ্ধতি নিয়ন্ত্রণের জন্য আরো অনেক পথ আছে। এগুলোর নাম ও কাজ জানতে Qiskit এয়ারের নথি পড়তে হবে। কিন্তু এদের মধ্যে সবচেয়ে গুরুত্বপূর্ণ দুটো পথের ব্যাপারে জেনে রাখা দরকার যেগুলো সিমুলেশনের অনুকূলিতকরণে (অপ্টিমাইজেসন) কাজে লাগবে।
es_un: Hay varias otras opciones que puedes modificar para controlar cómo funciona el método de estabilizador extendido. Cuáles son estas opciones y su explicación se pueden encontrar en la documentación de Qiskit Aer. Sin embargo, quiero destacar dos importantes que pueden ayudar a optimizar tus simulaciones.
id_id: Ada beberapa opsi lain yang dapat kita cocokkan untuk mengontrol bagaimana metode extended stabilizer dijalankan. Apa pilihan ini dan penjelasan mereka semua dapat ditemukan di dokumentasi Qiskit Aer. Namun, sekarang hanya menyoroti dua hal penting yang dapat membantu mengoptimalkan simulasi.
ja_jp: 拡張スタビライザメソッドがどのように機能するかを制御するために微調整することができるいくつかの他のオプションがあります。 これらのオプションとその説明はすべて、Qiskit Aer のドキュメントに記載されています。 しかし、シミュレーションを最適化するのに役立つ2つの重要なものを強調したいと思います。
ko_kr: 확장된 스태빌라이저 방법이 작동하는 방식을 제어하기 위해 조정할 수 있는 몇 가지 다른 옵션이 있다. 이러한 옵션과 그에 대한 설명은 모두 Qiskit Aer 문서에서 확인할 수 있다. 그러나 시뮬레이션을 최적화하는 데 도움이 될 수 있는 두 가지 중요한 사항을 강조하고자 한다.
pt_un: Existem várias outras opções que você pode ajustar para controlar como o método de estabilizador estendido executa. O que essas opções são e suas explicações podem ser encontradas todas na documentação do Qiskit Aer. No entanto, quero destacar duas importantes que podem ajudar a otimizar suas simulações.
ta: நீட்டிக்கப்பட்ட நிலைப்படுத்தி முறை எவ்வாறு செயல்படுகிறது என்பதைக் கட்டுப்படுத்த நீங்கள் மாற்றக்கூடிய பல விருப்பங்கள் உள்ளன. இந்த விருப்பங்கள் என்ன, அவற்றின் விளக்கம் அனைத்தும் Qiskit ஏர் ஆவணத்தில் காணலாம். இருப்பினும், உங்கள் உருவகப்படுத்துதல்களை மேம்படுத்த உதவும் இரண்டு முக்கியமானவற்றை நான் முன்னிலைப்படுத்த விரும்புகிறேன்.
tr: Genişletilmiş sabitleyici yönteminin nasıl performans gösterdiğini kontrol etmek için ince ayar yapabileceğiniz birkaç seçenek daha vardır. Bu seçeneklerin neler olduğu ve açıklamalarının tümü Qiskit Aer belgelerinde bulunabilir. Ancak, simülasyonlarınızı optimize etmenize yardımcı olabilecek iki önemli noktayı vurgulamak istiyorum.
zh: 您可以調整其他幾個選項來控制擴展穩定器的工作方式。 所有這些選項及其說明都可以在 Qiskit Aer 文檔中找到。 但是，我們想強調兩個有助於優化模擬的重要事項。
