Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/simulators/6_extended_stabilizer_tutorial.po
Languages: bn_bn, es_un, id_id, ja_jp, ko_kr, pt_un, ta, tr, zh

source: To perform measurements, the extended stabilizer method uses a Markov chain method to sample outcomes at random. This Markov chain has to be run for some time we call the ‘mixing time’ before it will start sampling, and has to be re-mixed for every circuit shot.
bn_bn: পরিমাপ করাকালীন সম্প্রসারিত সুস্থিতিকারক পদ্ধতি, মার্কভ চেন পদ্ধতি কাজে লাগিয়ে যত্রতত্র ফলাফল নমুনা করে। প্রত্যেক বর্তনী (সার্কিট) শটের জন্য মিক্সিং (মার্কভ চেন নমুনা নেওয়ার আগে কিছুক্ষন চালাতে হয়, একেই ‘মিক্সিং সময়’ বলে) করে তারপর নমুনা নিতে হয়।
es_un: Para realizar mediciones, el método de estabilizador extendido utiliza un método de cadena de Markov para muestrear resultados al azar. Esta cadena de Markov debe ejecutarse durante un tiempo que llamamos ‘tiempo de mezclado‘ antes de que comience a muestrear, y debe volver a mezclarse para cada iteración del circuito.
id_id: Untuk melakukan pengukuran, metode extended stabilizer menggunakan metode Markov chain untuk sampling hasil secara acak. Markov chain ini harus dijalankan selama beberapa waktu yang kita sebut 'mixing time' sebelum mulai sampling, dan harus kembali di mixing untuk setiap shot dari sirkuit.
ko_kr: 측정을 수행하기 위해, 확장된 스테빌라이저 방법은 무작위로 결과를 샘플링하기 위해 마르코프 체인 (Markov chain) 방법을 사용한다. 이 마르코프 체인은 샘플링을 시작하기 전에 '믹싱 시간' 이라고 부르기도 하고 모든 회로 샷에 대해 다시 혼합해야 한다.
tr: Ölçümleri gerçekleştirmek için genişletilmiş sabitleyici yöntemi, sonuçları rastgele örneklemek için bir Markov zincir yöntemi kullanır. Bu Markov zinciri, örneklemeye başlamadan önce 'mixing time' dediğimiz bir sürede çalıştırılmalı ve her devre atışı için yeniden karıştırılmalıdır.
zh: 為了進行測量，擴展穩定器方法使用馬爾可夫鏈隨機採樣結果。 在採樣開始之前，這個馬爾可夫鏈需要運行一段時間，稱為“混合時間”。 必須在每次電路執行後重新混合。

source: If you expect your circuit output to be concentrated on just a few output states, then you can likely optimize your simulations by reducing the ``extended_stabilizer_mixing_time`` option.
bn_bn: যদি বর্তনী (সার্কিট) ফলাফল শুধু কয়েকটা ফলাফল অবস্থার উপর লক্ষ্য রেখে বানাতে হয়, তাহলে ``extended_stabilizer_mixing_time`` কাজে লাগিয়ে মিক্সিং সময় কমিয়ে সিমুলেশন অনুকূলিত (অপ্টিমাইজ) করা যায়।
es_un: Si esperas que la salida de tu circuito se concentre en solo unos pocos estados de salida, entonces probablemente puedas optimizar tus simulaciones reduciendo la opción ``extended_stabilizer_mixing_time``.
id_id: Jika kita mengharapkan output sirkuit yang terkonsentrasi pada hanya beberapa output state, maka kita mungkin dapat mengoptimalkan simulasi dengan mengurangi opsi ` ` extended_stabilizer_mixing_time ` `.
ja_jp: 回路出力がわずか数個の出力状態に集中することを期待している場合、``extended_stabilizer_mixing_time`` オプションを減らすことでシミュレーションを最適化できます。
ko_kr: 회로 출력이 몇 가지 출력 상태에만 집중될 것으로 예상하는 경우 ``extended_stabilizer_mixing_time`` 옵션을 줄임으로써 시뮬레이션을 최적화할 수 있다.
pt_un: Se você espera que a saída do seu circuito esteja concentrada em apenas alguns estados de saída, então você pode provavelmente otimizar suas simulações, reduzindo a opção ``extended_stabilizer_mixing_time``.
ta: உங்கள் சர்க்யூட்டின் வெளியீடு ஒரு சில வெளியீட்டு நிலைகளில் குவிந்திருக்கும் என்று நீங்கள் எதிர்பார்க்கிறீர்கள் என்றால், ``extended_stabilizer_mixing_time`` விருப்பத்தைக் குறைப்பதன் மூலம் உங்கள் உருவகப்படுத்துதல்களை மேம்படுத்தலாம்.
tr: Devre çıktınızın sadece birkaç çıktı durumuna konsantre olmasını bekliyorsanız, o zaman ``extended_stabilizer_mixing_time`` seçeneğini azaltarak simülasyonlarınızı optimize edebilirsiniz.
zh: 如果您希望電路輸出僅集中在幾個輸出狀態，您可以通過減少 ``extended_stabilizer_mixing_time`` 選項來優化模擬。

source: Similarly, if your circuit has some non-zero probability on all amplitudes (e.g. if it’s a random circuit), then you can avoid this expensive re-mixing step to take multiple shots from the output at once. This can be enabled by setting ``extended_stabilizer_measure_sampling=True``.
bn_bn: একইভাবে যদি বর্তনীতে (সার্কিট) সব শীর্ষের উপর কোনো অশূন্য সম্ভাবনা থাকে (যেমন - কোনো যথেচ্ছ বর্তনী (সার্কিট)), তাহলে এই সময়সাপেক্ষ মিক্সিং ধাপটা (ফলাফল থেকে অনেকগুলো শট নেওয়ার জন্য) আমরা বাদ দিতে পারি। এর জন্য ``extended_stabilizer_measure_sampling=True`` করতে হবে।
es_un: De manera similar, si tu circuito tiene alguna probabilidad distinta de cero en todas las amplitudes (por ejemplo, si es un circuito aleatorio), entonces puedes evitar este costoso paso de volver a mezclar para tomando varias iteraciones de la salida a la vez. Esto se puede habilitar configurando ``extended_stabilizer_measure_sampling=True``.
id_id: Demikian pula, jika sirkuit memiliki beberapa probabilitas, yang tidak nol, pada semua amplitudo (misalnya jika itu adalah sirkuit acak), maka langkah pencampuran ulang yang mahal ini dapat dihindari untuk mengambil beberapa hasil shot sekaligus. Ini dapat diaktifkan dengan setting ` ` extended_stabilizer_measure_sampling=True ` `.
ko_kr: 마찬가지로, 회로가 모든 진폭에 대해 0이 아닌 확률을 갖는 경우 (예를 들어, 이것이 랜덤 회로인 경우), 이 값비싼 재혼합 단계를 회피하여 한 번에 출력으로부터 다수의 샷을 취하는 것을 피할 수 있다. 이는 ``extended_stabilizer_measure_sampling=True`` 를 설정함으로써 가능하게 될 수 있다.
tr: Benzer şekilde, devreniz tüm genliklerde sıfır olmayan bir olasılığa sahipse (örneğin, rastgele bir devreyse), çıktıdan aynı anda birden fazla deneme yapmak için, masraflı olan yeniden karıştırma adımından kaçınabilirsiniz. Bu, ``extended_stabilizer_measure_sampling=True`` ayarlanarak etkinleştirilebilir.
zh: 類似地，如果電路中的所有幅度都存在非零機率(例如，在隨機電路的情況下)，則可以避免這種複雜的重新混合步驟，以避免一次從輸出中執行多次電路。 這可以通過設置``extended_stabilizer_measure_sampling=True``來啟用。

source: For example, let’s look again at the random circuit from the start of the tutorial, running for 100 shots:
bn_bn: উদাহরণস্বরূপ, পাঠসমূহ (টিউটোরিয়াল) বা টিউটোরিয়ালের শুরু থেকে ১০০টি শটের জন্য চলতে থাকা বর্তনীটিকে (সার্কিট) আবার দেখা যাক:
es_un: Por ejemplo, veamos nuevamente el circuito aleatorio desde el comienzo del tutorial, que se ejecuta durante 100 iteraciones:
id_id: Sebagai contoh, mari kita lihat lagi di sirkuit acak dari awal tutorial, dijalankan dengan 100 shot:
ko_kr: 예를 들어, 튜토리얼의 시작부터 다음과 같이 100개의 샷을 실행하는 랜덤 회로를 다시 한번 살펴보자.
tr: Örneğin, öğreticinin başlangıcından itibaren 100 deneme için çalışan rastgele devreye tekrar bakalım:
zh: 例如，讓我們從頭開始從指導教學開始的隨機電路中，執行 100 次電路:

source: When shall I use it?
bn_bn: কখন এটা ব্যবহার করা উচিত?
es_un: ¿Cuándo debo utilizarlo?
id_id: Kapan saya harus menggunakannya?
ko_kr: 언제 사용해야 할까?
pt_un: Quando devo usar?
ta: நான் எப்போது அதைப் பயன்படுத்த வேண்டும்?
tr: Ne zaman kullanmalıyım?
zh: 什麼時候使用？

source: If you have smaller circuits with lots of non-Clifford gates, then the statevector method will likely perform better than the extended stabilizer. If however you want to look at circuits on many qubits, without needing access to high performance computation, then give this method a try!
bn_bn: যদি আপনার অনেক গুলো নন-ক্লিফোরড বিশিষ্ট বর্তনী (সার্কিট) থাকে, তাহলে এক্সটেন্ডেড স্ট্যাবিলাইযার অপেক্ষা অবস্থা ভেক্টর বা দিকরাশি পদ্ধতি অধিক ভালো কাজ করবে। যদি আপনি উচ্চ কর্মদক্ষতাসম্পন্ন গননাকারী ব্যবহার না করে অনেকগুলো কিউবিট বিশিষ্ট বর্তনী(সার্কিট) পরীক্ষা করে দেখতে চান, তাহলে এই পদ্ধতিটি ব্যবহার করে দেখুন!
es_un: Si tienes circuitos más pequeños con muchas compuertas que no son de Clifford, es probable que el método de vector de estado funcione mejor que el estabilizador extendido. Sin embargo, si deseas ver circuitos en muchos qubits, sin necesidad de acceder a cálculos de alto rendimiento, ¡prueba este método!
id_id: Jika sirkuitnya kecil dengan banyak gate non-Clifford, maka metode statevector mungkin akan lebih baik dari extended stabilizer. Namun, jika sirkuit punya banyak qubits, tanpa perlu akses ke komputasi berperforma tinggi, metoda ini bisa dicoba!
pt_un: Se você tem circuitos menores com muitas portas não-Clifford, então o método de vetor de estado provavelmente irá ter um desempenho melhor do que o estabilizador estendido. Se no entanto você quiser olhar para circuitos com muitos qubits, sem precisar de acesso a computações de alto desempenho, então dê uma chance a este método!
ta: Non-கிளிஃபோர்டு கேட் கொண்ட சிறிய சர்க்யூட்கள் உங்களிடம் இருந்தால், நீட்டிக்கப்பட்ட நிலைப்படுத்தியை விட ஸ்டேட்வெக்டர் முறை சிறப்பாக செயல்படும். இருப்பினும், அதிக செயல்திறன் கணக்கீட்டிற்கான அணுகல் தேவையில்லாமல், பல கியூபிட்ஸ்களில் சர்க்யூட்களைப் பார்க்க விரும்பினால், இந்த முறையை முயற்சிக்கவும்!
tr: Çok sayıda Clifford kapısı olmayan daha küçük kapılı olan devreleriniz varsa, durum vektörü yöntemi muhtemelen genişletilmiş dengeleyiciden daha iyi performans gösterecektir. Bununla birlikte, yüksek performanslı hesaplamaya erişime ihtiyaç duymadan birçok kübit üzerindeki devrelere bakmak istiyorsanız, bu yöntemi deneyin!
zh: 如果您的電路較少，且具有許多非 Clifford 閘，則 statevector 方法可能表現得比擴展穩定器好。 如果您想要在許多量子位元上查看電路，而不需要存取高效能運算，則請嘗試使用此方法！

source: This method is an implementation of the ideas published in the paper *Simulation of quantum circuits by low-rank stabilizer decompositions* by Bravyi, Browne, Calpin, Campbell, Gosset & Howard, 2018, `**arXiv:1808.00128** <https://arxiv.org/abs/1808.00128>`__.
ja_jp: 本手法は、Bravyi, Browne, Calpin, Campbell, Gosset & Howard 2018 らによる *Simulation of quantum circuits by low-rank stabilizer decompositions* `arXiv:1808. 0128** <https://arxiv.org/abs/1808.00128>`__ 論文に掲載されたアイデアを実装したものです。

source: We've created a random circuit with just 60 gates, that acts on 40 qubits. But, because of the number of qubits, if we wanted to run this with say the statevector simulator then I hope you have access to terabytes of RAM!
ja_jp: 私たちは、わずか60ゲートのランダム回路を作成し、40量子ビットに対して動作します。 しかし、量子ビットの数のために。 状態ベクトルシミュレーターなどでこれを実行したい場合は、テラバイトのRAMにアクセスできることを期待しています!

source: If you're interested in how exactly we can handle such large circuits, then for a detailed explanation you can `read the paper! <https://arxiv.org/abs/1808.00128>`__
ja_jp: このような大きな回路をどのように正確に扱えるか興味があるなら、詳細な説明をするために`論文を読むことができます！ <https://arxiv.org/abs/1808.00128>`__

source: For running circuits, however, it's important to just understand the basics.
ja_jp: しかし、回路を動かすためには、基本を理解することが重要です。

source: One thing that's important to note is these decompositions are approximate. This means that the results aren't exactly the same as with the State Vector simulator.
ja_jp: 注意すべき重要なことは、これらの分解は近似であることです。 これは、状態ベクトルシミュレータと同じ結果ではないことを意味します。

source: You can control this approximation error using the ``backend_options`` in Qiskit Aer. The default error is 0.05. The smaller the error, the more precise the results, but also the longer your simulation will take and the more memory it will require.
ja_jp: Qiskit Aer の ``backend_options`` を使用してこの近似エラーを制御できます。デフォルトエラーは 0.05 です。 エラーが小さいほど結果が正確になりますが、シミュレーションに時間がかかり、より多くのメモリが必要になります。

source: To perform measurements, the extended stabilizer method uses a Markov chain method to sample outcomes at random. This Markov chain has to be run for some time we call the 'mixing time' before it will start sampling, and has to be re-mixed for every circuit shot.
ja_jp: 測定を行うために、拡張スタビライザ法はマルコフ連鎖法を使用してランダムに結果をサンプルします。 このマルコフチェーンは、サンプリングが開始される前に「混合時間」と呼ばれるしばらくの間実行する必要があります。 回路ショットごとに再混合する必要があります

source: Similarly, if your circuit has some non-zero probability on all amplitudes (e.g. if it's a random circuit), then you can avoid this expensive re-mixing step to take multiple shots from the output at once. This can be enabled by setting ``extended_stabilizer_measure_sampling=True`` in the ``backend_options``.
ja_jp: 同様に、すべての振幅にゼロ以外の確率がある場合(例: ランダムな回路など) であれば、この高価な再混合ステップを避けて、出力から複数のショットを一度に取ることができます。 これは、 ``backend_options`` に ``extended_stabilizer_measure_samping=True`` を設定することで有効にできます。

source: For example, let's look again at the random circuit from the start of the tutorial, running for 100 shots:
ja_jp: 例えば、チュートリアルの最初にあるランダムな回路をもう一度見てみましょう。100回実行されています。

source: How can I use it?
ja_jp: どのように使用できますか?

source: In the latest release of Qiskit Aer, if you try to run a circuit on more qubits than can be handled by the state vector simulator, then Aer will automatically switch to using the extended stabilizer method. You can also force circuits to run on this method using the ``backend_options`` keyword argument to ``QasmSimulator().run``.
ja_jp: Qiskit Aer の最新リリースでは、状態ベクトルシミュレーターで処理できるより多くの量子ビットで回路を実行しようとする場合、Aerは自動的に拡張スタビライザー方式に切り替わります。 ``backend_options`` キーワード引数を使用して ``QasmSimulator().run`` に回路を強制的にこの方式で実行させることもできます。

source: It's worth bearing in mind: if you have smaller circuits with lots of non-Clifford gates, then the statevector method will likely perform better than the extended stabilizer. If however you want to look at circuits on many qubits, without needing access to high performance computation, then give this method a try!
ja_jp: それは念頭に置いておく価値があります: もしあなたがたくさんの非Cliffordゲートを備えた小さな回路を持っているなら。 スタビライザーよりも優れた性能を発揮します しかし、高性能計算へのアクセスを必要とせず、多くの量子ビットの回路を見たい場合は、このメソッドを試してみてください!
