Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/simulators/7_matrix_product_state_method.po
Languages: bn_bn, es_un, fr, id_id, ja, ko_kr, pt_un, ta_in, tr_tr, zh_tw

source: This page was generated from `tutorials/simulators/7_matrix_product_state_method.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/simulators/7_matrix_product_state_method.ipynb`__ -থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `tutorials/simulators/7_matrix_product_state_method.ipynb`__.
fr: Cette page a été générée à partir de `tutorials/simulators/7_matrix_product_state_method.ipynb`__.
id_id: Halaman ini dibuat dari ` tutorials/algoritms/01_grover.ipynb ` __.
ja: このページは `tutorials/simulators/7_matrix_product_state_method.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/simulators/7_matrix_product_state_method.ipynb`_ 에서 생성되었다.
pt_un: Esta página foi gerada a partir do `tutoriais/simuladores/7_metodo_matriz_de_estado_do_produto.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/simulators/7_matrix_product_state_method.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
tr_tr: Bu sayfa `tutorials/simulators/7_matrix_product_state_method.ipynb`__ adresinden oluşturulmuştur.
zh_tw: 此頁面是從 `tutorials/simulators/1_aer_provider.ipynb`__ 產生的。

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/simulators/7_matrix_product_state_method.ipynb>`_.
ko_kr: `IBM 퀀텀 랩 <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/01_grover.ipynb>`_ 에서 대화식으로 실행하십시오.
ta_in: ஊடாடும் வகையில் இயக்கவும் `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/simulators/7_matrix_product_state_method.ipynb>`_பயன்படுத்தலாம்.

source: Matrix product state simulation method
bn_bn: ম্যাট্রিক্স গুণফলের অবস্থা সিমুলেশন পদ্ধতি
es_un: Método de simulación de estado del producto de matriz
fr: Méthode de simulation d'état du produit de la matrice
id_id: Metode simulasi state produk matriks
ja: 行列積状態を用いたシミュレーション法
ko_kr: 행렬 곱 상태 시뮬레이션 방법
pt_un: Método de simulação de estado do produto matricial
ta_in: மேட்ரிக்ஸ் தயாரிப்பு நிலை உருவகப்படுத்துதல் முறை
tr_tr: Matris çarpım durumu simülasyon yöntemi
zh_tw: Matrix product state 的模擬方法

source: Simulation methods
bn_bn: সিমুলেশন(মহড়া) পদ্ধতি সমূহ
es_un: Métodos de simulación
fr: Méthodes de simulation
id_id: Metode simulasi
ja: シミュレーション方法
ko_kr: 시뮬레이션 방법
pt_un: Métodos de simulação
ta_in: உருவகப்படுத்துதல் முறைகள்
tr_tr: Simülasyon yöntemleri
zh_tw: 模擬方法

source: The ``QasmSimulator`` has several simulation methods including ``statevector``, ``stabilizer``, ``extended_stabilizer`` and ``matrix_product_state``. Each of these determines the internal representation of the quantum circuit and the algorithms used to process the quantum operations. They each have advantages and disadvantages, and choosing the best method is a matter of investigation. In this tutorial, we focus on the ``matrix product state simulation method``.
ko_kr: ``QasmSimulator``에는 ``statevector``, ``stabilizer``, ``extended_stabilizer``, ``matrix_product_state``를 포함하는 다양한 시뮬레이션 방법들이 준비되어 있다. 이는 양자 연산들을 처리할 양자 회로나 알고리즘을 나타내는 다양한 방법을 기반으로 한다. 어떤 방법을 사용하는가에는 각각 장단점이 있으며 가장 좋은 방법은 문제에 따라 다르다. 이번 튜토리얼에서는 ``행렬곱 상태 시뮬레이션 방법``을 알아본다.

source: This simulation method is based on the concept of ``matrix product states``. This structure was initially proposed in the paper *Efficient classical simulation of slightly entangled quantum computations* by Vidal in https://arxiv.org/abs/quant-ph/0301063. There are additional papers that describe the structure in more detail, for example *The density-matrix renormalization group in the age of matrix product states* by Schollwoeck https://arxiv.org/abs/1008.3477.
bn_bn: এই সিমুলেশন ``ম্যাট্রিক্স গুনফল অবস্থা`` ধারণার উপর ভিত্তি করে বানানো। এই কাঠামো প্রথম আলোচনা হয়েছিল *Efficient classical simulation of slightly entangled quantum computations* by Vidal in https://arxiv.org/abs/quant-ph/0301063। বিশদে জানার জন্য আরো গবেষণাপত্র আছে, যেমন - *The density-matrix renormalization group in the age of matrix product states* by Schollwoeck https://arxiv.org/abs/1008.3477।
es_un: Este método de simulación se basa en el concepto de ``estados de producto de matriz``. Esta estructura se propuso inicialmente en el artículo *Efficient classical simulation of slightly entangled quantum computations* de Vidal en https://arxiv.org/abs/quant-ph/0301063. Hay artículos adicionales que describen la estructura con más detalle, por ejemplo *The density-matrix renormalization group in the age of matrix product states* de Schollwoeck https://arxiv.org/abs/1008.3477.
fr: Cette méthode de simulation est basée sur le concept de ``produits matriciels``. Cette structure a d'abord été proposée dans le document *Efficient classical simulation of slightly entangled quantum computations* par Vidal dans https://arxiv.org/abs/quant-ph/0301063. Il existe des documents additionnels qui décrivent la structure de façon plus détaillée, par exemple *Le groupe de renormalisation de la matrice de densité à l'ère des produits matriciels d'états* par Schollwoeck https://arxiv.org/abs/1008.3477.
id_id: Metode simulasi ini didasarkan pada konsep ` ` matrix product states ` `. Struktur ini awalnya diusulkan dalam makalah *Efficient classical simulation of slightly entangled quantum computations* oleh Vidal in https://arxiv.org/abs/quant-ph/0301063. Ada makalah tambahan yang menjelaskan struktur ini secara lebih rinci, misalnya *The density-matrix renormalization group in the age of matrix product states* oleh Schollwoeck https://arxiv.org/abs/1008.3477.
ja: このシミュレーション方法は ``matrix product states`` の概念に基づいています。 この構造は、最初に Vidal の *Efficient classical simulation of slightly entangled quantum computations*(https://arxiv.org/abs/quant-ph/0301063) で提案されました。構造をより詳細に説明する論文として、例えば Schollwoeck の *The density-matrix renormalization group in the age of matrix product states* (https://arxiv.org/abs/1008.3477) があります。
ko_kr: 이 시뮬레이션 방법은 ``행렬 곱 상태`` 개념을 기반으로 하고 있다. 이 구조를 처음에 제안한 논문은 Vidal의 *Efficient classical simulation of slightly entangled quantum computations*이며 https://arxiv.org/abs/quant-ph/0301063에서 볼 수 있다. 그 구조를 더 세부적으로 설명한 추가 논문은 Schollwoeck의 *The density-matrix renormalization group in the age of matrix product states*로 https://arxiv.org/abs/1008.3477에서 볼 수 있다.
pt_un: Este método de simulação baseia-se no conceito de ``estados de produto de matriz``. Esta estrutura foi inicialmente proposta no artigo *Efficient classical simulation of slightly entangled quantum computations* por Vidal em https://arxiv.org/abs/quant-ph/0301063. Há artigos adicionais que descrevem a estrutura em mais detalhes, por exemplo *The density-matrix renormalization group in the age of matrix product states* por Schollwoeck https://arxiv.org/abs/1008.3477.
ta_in: இந்த உருவகப்படுத்துதல் முறை ``matrix product states``என்ற கருத்தை அடிப்படையாகக் கொண்டது. இந்த கட்டமைப்பை ஆரம்பத்தில் தாளில் முன்மொழியப்பட்டது * https://arxiv.org/abs/quant-ph/0301063 இல் விடால் எழுதிய * சற்று சிக்கலான குவாண்டம் கணக்கீடுகளின் திறமையான கிளாசிக்கல் உருவகப்படுத்துதல் *. ஷோல்வொக்கின் https://arxiv.org/abs/1008.3477 வழங்கிய மேட்ரிக்ஸ் தயாரிப்பு நிலைகளின் வயதில் அடர்த்தி-மேட்ரிக்ஸ் மறுசீரமைத்தல் குழு * எடுத்துக்காட்டாக, கட்டமைப்பை இன்னும் விரிவாக விவரிக்கும் கூடுதல் ஆவணங்கள் உள்ளன.
tr_tr: Bu simülasyon yöntemi ``matrix product states`` kavramına dayanır. Bu yapı ilk olarak Vidal tarafından yazılan *Az dolaşık kuantum hesaplamalarının verimli klasik simülasyonu* (https://arxiv.org/abs/quant-ph/0301063) makalesinde ortaya atılmıştır. Yapıyı daha detaylı açıklayan ek makaleler bulunmaktadır, örneğin Schollwoeck tarafından yazılan *Matris çarpım durumu çağında yoğunluk matrisi renormalizasyon grubu* (https://arxiv.org/abs/1008.3477) makalesi.
zh_tw: 此模擬方法以 " ` matrix product states`` `為基礎。 這種概念最初在 Vidal的*Efficient classical simulation of slightly entangled quantum computations* 這篇論文中被提出(連結:https://arxiv.org/abs/quant-ph/0301063)。 還有其他論文對此概念有更深入的描述，如 Scholwoeck 的*The density-matrix renormalization group in the age of matrix product states*(連結:https://arxiv.org/abs/1008.3477)。

source: A pure quantum state is usually described as a state vector, by the expression :math:`|\psi\rangle = \sum_{i_1=0}^1 {\ldots} \sum_{i_n=0}^1 c_{i_1 \ldots i_n} |i_i\rangle {\otimes} {\ldots} {\otimes} |i_n\rangle`.
bn_bn: একটা বিশুদ্ধ কোয়ান্টাম অবস্থা একটা অবস্থা নির্ণায়ক দিকরাশি (স্টেট ভেক্টর) দিয়ে সূচিত হয়। এর গাণিতিক রূপ হলো :math:`|\psi\rangle = \sum_{i_1=0}^1 {\ldots} \sum_{i_n=0}^1 c_{i_1 \ldots i_n} |i_i\rangle {\otimes} {\ldots} {\otimes} |i_n\rangle`।
es_un: Un estado cuántico puro generalmente se describe como un vector de estado, mediante la expresión :math:`|\psi\rangle = \sum_{i_1=0}^1 {\ldots} \sum_{i_n=0}^1 c_{i_1 \ldots i_n} |i_i\rangle {\otimes} {\ldots} {\otimes} |i_n\rangle`.
fr: Un état quantique pur est généralement décrit comme un vecteur d'état, par l'expression :math:`|\psi\rangle = \sum_{i_1=0}^1 {\ldots} \sum_ {i_n= 0}^1 c_{i_1 \ldots i_n } |i_i\rangle {\otimes} {\ldots} {\otimes} |i_n\rangle`.
id_id: Suatu state kuantum murni biasanya digambarkan sebagai state vector, dengan ekspresi :math:` | \psi\rangle = \sum_ {i_1 = 0} ^ 1 {\ldots} \sum_ {i_n= 0} ^ 1 c_{i_1 \ldots i_n} |i_i\rangle {\otimes} {\ldots} {\otimes} |i_n\rangle `.
ja: 純粋な量子状態は通常、状態ベクトルとして記述されます。 式で書くと、 :math:`|\psi\rangle = \sum_{i_1=0}^1 {\ldots} \sum_{i_n=0}^1 c_{i_1 \ldots i_n} |i_i\rangle {\otimes} {\ldots} |i_n\rangle` です。
ko_kr: Pure 양자 상태는 주로 :math:`|\psi\rangle = \sum_{i_1=0}^1 {\ldots} \sum_{i_n=0}^1 c_{i_1 \ldots i_n} |i_i\rangle {\otimes} {\ldots} {\otimes} |i_n\rangle`와 같이 상태 벡터로 묘사된다.
pt_un: Um estado quântico puro é geralmente descrito como um vetor de estado, pela expressão :math:`|\psi\rangle = \sum_{i_1=0}^1 {\ldots} \sum_{i_n=0}^1 c_{i_1 \ldots i_n} |i_i\rangle {\otimes} {\ldots} {\otimes} |i_n\rangle`.
ta_in: தூய்மையான குவாண்டம் நிலை பொதுவாக ஒரு மாநில திசையன் என விவரிக்கப்படுகிறது:math: `|\psi\rangle= \sum_ {i_1=0}^1 {\ldots}\sum_ {i_n = 0}^1 c_ {i_1 \ldots i_n} |i_i\rangle{\ otimes} {\ldots} {\otimes} |i_n\rangle`.
tr_tr: Saf bir kuantum durumu, genellikle, :math:`|\psi\rangle = \sum_{i_1=0}^1 {\ldots} \sum_{i_n=0}^1 c_{i_1 \ldots i_n} |i_i\rangle {\otimes} {\ldots} {\otimes} |i_n\rangle` ifadesiyle bir durum vektörü olarak tanımlanır.
zh_tw: 通常我們會以狀態向量描述量子態，其表示式為 :math:`|\psi\r角度 = \sum_{i_1=0}^1 {\lds} \sum_{i_n=0}^1 cc_{i_i\r角度 {\owtimes } { \otimes } |i_n\r角`。

source: The state vector representation implies an exponential size representation, regardless of the actual circuit. Every quantum gate operating on this representation requires exponential time and memory.
bn_bn: অবস্থা নির্ণায়ক দিকরাশি (স্টেট ভেক্টর) উপস্থাপনা একটা বড় আকারের উপস্থাপনা বোঝায় যা আসল বর্তনীর (সার্কিট) আকারের উপর নির্ভরশীল নয়। এই উপস্থাপনার প্রত্যেক কোয়ান্টাম যুক্তিবর্তনী (গেইট) গণনাকালীন প্রচুর সময় ও মেমরি নেয়।
es_un: La representación del vector de estado implica una representación de tamaño exponencial, independientemente del circuito en sí. Cada compuerta cuántica que opera en esta representación requiere tiempo y memoria exponenciales.
fr: La représentation du vecteur d'état implique une représentation de taille exponentielle, quel que soit le circuit réel. Chaque porte quantique fonctionnant sur cette représentation nécessite un temps et une mémoire exponentiels.
id_id: Representasi state vector adalah representasi berukuran eksponensial, terlepas dari sirkuit aktual. Setiap gate kuantum yang beroperasi pada representasi ini membutuhkan waktu dan memori eksponensial.
ja: 状態ベクトル表現は、実際の回路に関係なく、指数サイズ表現を伴います。 この表現で動作するすべての量子ゲートには、指数時間と指数メモリが必要です。
ko_kr: 이러한 상태 벡터 표현은 이를 묘사하는데 있어 필요한 수가 기하급수적으로 증가한다. 이는 실제 회로와는 무관하다. 이 방법으로 모든 양자 게이트들의 작동을 표현하면 기하급수적 시간과 메모리가 필요하다.
pt_un: A representação do vetor de estado implica em uma representação de tamanho exponencial, independentemente do circuito real. Toda porta quântica que opera nessa representação requer tempo e memória exponenciais.
ta_in: மாநில திசையன் பிரதிநிதித்துவம் உண்மையான சுற்றுகளைப் பொருட்படுத்தாமல் ஒரு அதிவேக அளவு பிரதிநிதித்துவத்தைக் குறிக்கிறது. இந்த பிரதிநிதித்துவத்தில் இயங்கும் ஒவ்வொரு குவாண்டம் வாயிலுக்கும் அதிவேக நேரம் மற்றும் நினைவகம் தேவைப்படுகிறது.
tr_tr: Durum vektörü gösterimi, esas devreye bakılmaksızın, üstel bir büyüklük gösterimini işaret eder. Bu gösterimin üzerine işleyen her kuantum kapısı, üstel zaman ve bellek gerektirir.

source: The matrix product state (MPS) representation offers a local representation, in the form: :math:`\Gamma^{[1]} \lambda^{[1]} \Gamma^{[2]} \lambda^{[2]}\ldots \Gamma^{[1]} \lambda^{[n-1]} \Gamma^{[n]}`, such that all the information contained in the :math:`c_{i_1 \ldots i_n}`, can be generated out of the MPS representation.
bn_bn: ম্যাট্রিক্স গুনফল অবস্থা (এমপিএস) নিম্নলিখিত রূপে একটা স্থানীয় উপস্থাপনা দেয়: :math:`\Gamma^{[1]} \lambda^{[1]} \Gamma^{[2]} \lambda^{[2]}\ldots \Gamma^{[1]} \lambda^{[n-1]} \Gamma^{[n]}`, যাতে :math:`c_{i_1 \ldots i_n}` -এর মধ্যে থাকা সব তথ্য এমপিএস উপস্থাপনা থেকে পাওয়া যায়।
es_un: La representación de estado del producto de matriz (matrix product state, MPS) ofrece una representación local, en la forma: :math:`\Gamma^{[1]} \lambda^{[1]} \Gamma^{[2]} \lambda^{[2]}\ldots \Gamma^{[1]} \lambda^{[n-1]} \Gamma^{[n]}`, de modo que toda la información contenida en :math:`c_{i_1 \ldots i_n}`, se puede generar a partir de la representación MPS.
fr: La représentation de l'état du produit matriciel (MPS) offre une représentation locale, sous la forme : :math:`\Gamma^{[1]} \lambda^{[1]} \Gamma^{[2]} \lambda^{[2]} \ldots \Gamma^{[1]} \lambda^{[n-1]} \Gamma^{[n]}`, de sorte que toutes les informations contenues dans :math:`c_{i_1 \ldots i_n }` peuvent être générées à partir de la représentation MPS.
id_id: Representasi Matrix Product State (MPS) adalah representasi lokal, berbentuk: :math:`\Gamma^{[1]} \lambda^{[1]} \Gamma^{[2]} \lambda^{[2]}\ldots \Gamma^{[1]} \lambda^{[n-1]} \Gamma^{[n]}`, sehingga semua informasi ada di dalam :math:`c_{i_1 \ldots i_n}`, dan dapat dibuat dari representasi MPS.
ja: 行列積状態（Matrix Product State、MPS）表示は、形式: :math:`\Gamma^{[1]} \lambda^{[1]} \Gamma^{[2]} \lambda^{[2]}\ldots \Gamma^{[1]} \lambda^{[n-1]} \Gamma^{[n]}` にてローカル表示を提供します。 :math:`c_{i_1 \ldots i_n}` に含まれるすべての情報を、MPS表現から生成できるようにします。
ko_kr: 행렬 곱 상태 (MPS) 표현은 다음과 같이 국소적 표현을 가능하게 한다.: :math:`\Gamma^{[1]} \lambda^{[1]} \Gamma^{[2]} \lambda^{[2]}\ldots \Gamma^{[1]} \lambda^{[n-1]} \Gamma^{[n]}` 즉 :math:`c_{i_1 \ldots i_n}`에 담긴 모든 정보들은 MPS 표현으로 적을 수 있다.
pt_un: A representação do estado de produto de matriz (MPS) oferece uma representação local, na forma: :math:`\Gamma^{[1]} \lambda^{[1]} \Gamma^{[2]} \lambda^{[2]}\ldots \Gamma^{[1]} \lambda^{[n-1]} \Gamma^{[n]}`, tal que todas as informações contidas nos :math:`c_{i_1 \ldots i_n}`, podem ser geradas fora da representação do MPS.
ta_in: மேட்ரிக்ஸ் தயாரிப்பு நிலை (எம்.பி.எஸ்) பிரதிநிதித்துவம் ஒரு உள்ளூர் பிரதிநிதித்துவத்தை வழங்குகிறது, வடிவத்தில்:math: `\Gamma^{[1]} \lambda^{[1]} \Gamma^{[2]} \lambda^{[2]}\ldots \Gamma^{[1]} \lambda^{[n-1]} \Gamma^{[n]}`,அதுபோல் :math:`c_{i_1 \ldots i_n}` இல் உள்ள அனைத்து தகவல்களும் MPS பிரதிநிதித்துவத்திலிருந்து உருவாக்கப்படலாம்.
tr_tr: Matris çarpım durumu (MPS) gösterimi, yerel bir gösterim sunar ve bu gösterimin biçimi şöyledir: :math:`\Gamma^{[1]} \lambda^{[1]} \Gamma^{[2]} \lambda^{[2]}\ldots \Gamma^{[1]} \lambda^{[n-1]} \Gamma^{[n]}`, öyle ki :math:`c_{i_1 \ldots i_n}` ifadesinde bulunan bütün bilgiler Matris çarpım durumu gösteriminden oluşturulabilir.
zh_tw: Matrix product state (MPS) 表示法提供了一種局部表示方式 :math:`\Gamma^{[1]} \lambda^{[1]} \Gamma^{[2]} \lambda^{[2]}\ldots \Gamma^{[1]} \lambda^{[n-1]} \Gamma^{[n]}`，因此包含在 :math:`c_{i_1 \ldots i_n}` 中的所有資訊都可以從 MPS 表示法中得出。

source: Every :math:`\Gamma^{[i]}` is a tensor of complex numbers that represents qubit :math:`i`. Every :math:`\lambda^{[i]}` is a matrix of real numbers that is used to normalize the amplitudes of qubits :math:`i` and :math:`i+1`. Single-qubit gates operate only on the relevant tensor.
bn_bn: প্রত্যেক :math:`\Gamma^{[i]}` হলো জটিল রাশির দিকরাশি (টেন্সর) যেটা একটা কিউবিট :math:`i` কে চিহ্নিত করে। প্রত্যেক :math:`\lambda^{[i]}` হলো বাস্তব সংখ্যার ম্যাট্রিক্স যার সাহায্যে :math:`i` ও :math:`i+1` কিউবিটের বিস্তার শমিত করা যায়। একক কিউবিট যুক্তিবর্তনী (গেট) কেবল প্রাসঙ্গিক দিকরাশির (টেন্সর) উপর কাজ করে:
es_un: Cada :math:`\Gamma^{[i]}` es un tensor de números complejos que representa al qubit :math:`i`. Cada :math:`\lambda^{[i]}` es una matriz de números reales que se utiliza para normalizar las amplitudes de los qubits :math:`i` e :math:`i+1`. Las compuertas de un solo qubit operan solo en el tensor relevante.
fr: Chaque :math:`\Gamma^{[i]}` est un tenseur de nombres complexes qui représente le qubit :math:`i`. Chaque :math:`\lambda^{[i]}` est une matrice de nombres réels qui est utilisée pour normaliser les amplitudes des qubits :math:`i` et :math:`i+1`. Les portes mono-qubit fonctionnent uniquement sur le tenseur approprié.
id_id: Setiap :math:` \Gamma ^ {[i]} ` adalah sebuah tensor dari bilangan kompleks yang mewakili qubit :math:` i `. Setiap :math:` \lambda ^ {[i]} ` adalah sebuah matriks bilangan real yang digunakan untuk menormalkan amplitudo qubits :math:` i ` dan :math:` i + 1 `. Gate qubit tunggal hanya beroperasi pada tensor yang relevan.
ja: すべての :math:`\Gamma^{[i]}` は qubit :math:`i` を表す複素数のテンソルです。 :math:`\lambda^{[i]}` は実数の行列で、量子ビット :math:`i` と :math:`i+1` の振幅を正規化するために使用されます。 単一量子ビットゲートは、該当するテンソルでのみ動作します。
ko_kr: 모든 :math:`\Gamma^{[i]}`는 :math:`i`번째 큐비트를 나타내는 복소 텐서이다. 모든 :math:`\lambda^{[i]}`는 :math:`i` 번째 큐비트와 :math:`i+1` 번째 큐비트들의 진폭을 정규화하고자 사용하는 실수로 이뤄진 행렬이다. 단일 큐비트 게이트는 특정 관련된 텐서에만 영향을 준다.
pt_un: Cada :math:`\Gamma^{[i]}` é um tensor de números complexos que representa o qubit :math:`i`. Cada :math:`\lambda^{[i]}` é uma matriz de números reais que é usada para normalizar as amplitudes dos qubits :math:`i` e :math:`i+1`. Portas de um único qubit operam apenas no tensor relevante.
ta_in: ஒவ்வொன்றும்:math:`\Gamma^{[i]}` என்பது சிக்கலான எண்களின் டென்சர் ஆகும், இது குவிட்:math:`i`. ஒவ்வொன்றும்:math:`\ lambda^{[i]}` என்பது உண்மையான எண்களின் அணி, இது வினாடிகளின் வீச்சுகளை இயல்பாக்குவதற்குப் பயன்படுகிறது:math:`i` மற்றும்:math:`i +1`. ஒற்றை-குவிட் வாயில்கள் தொடர்புடைய டென்சரில் மட்டுமே இயங்குகின்றன.
tr_tr: Her :math:`\Gamma^{[i]}`, :math:`i` kübitini temsil eden karmaşık sayıların tensörüdür. Her :math:`\lambda^{[i]}`, :math:`i` and :math:`i+1` kübitlerinin genliklerinin normalize edilmesinde kullanılan ve gerçek sayılardan oluşan bir matristir.
zh_tw: 每個 :math:`\Gamma^{[i]}` 是表示量子位元 :math:`i` 的複數張量，每個 :math:`\lambda^{[i]}` 是一個實數矩陣，用於對量子位元閘 :math:`i` 和 :math:`i+1` 的幅度進行歸一化，其中單量子位元閘僅在相關張量上作用。
