Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/simulators/7_matrix_product_state_method.po
Languages: bn_bn, es_un, fr, id_id, ja, ko_kr, pt_un, ta_in, tr_tr, zh_tw

source: The matrix product state simulation method is invoked in the ``AerSimulator`` by setting the simulation method. Other than that, all operations are controlled by the ``AerSimulator`` itself, as in the following example:
bn_bn: ম্যাট্রিক্স গুণফল অবস্থা সিমুলেশন পদ্ধতি চালু করতে হলে ``AerSimulator`` -এ সিমুলেশন পদ্ধতি নির্বাচন করতে হবে। এছাড়া বাকি সব ক্রিয়াকলাপ (অপারেশন) ``AerSimulator`` নিজে নিয়ন্ত্রণ করে। নিচের উদাহরণে ব্যাপারটা দেখা যাক:
es_un: El método de simulación del estado del producto de matriz se invoca en el ``AerSimulator`` configurando el método de simulación. Aparte de eso, todas las operaciones están controladas por el propio ``AerSimulator``, como en el siguiente ejemplo:
fr: La méthode de simulation de l'état du produit matriciel est appelée dans ``AerSimulator`` en définissant la méthode de simulation. En dehors de cela, toutes les opérations sont contrôlées par le `` AerSimulator`` lui-même, comme dans l'exemple suivant:
ja: 行列積状態シミュレーション・メソッドは、シミュレーション・メソッドを設定することによって ``AerSimulator`` 内で呼び出されます。 それ以外のすべての操作は、次の例のように、 ``AerSimulator`` 自体によって制御されます。
pt_un: O método de simulação da matriz estado produto é invocado no ``AerSimulator``, configurando o método de simulação. Fora isso, todas as operações são controladas pelo própria ``AerSimulator``, como no exemplo a seguir:
ta_in: உருவகப்படுத்துதல் முறையை அமைப்பதன் மூலம் மேட்ரிக்ஸ் தயாரிப்பு நிலை உருவகப்படுத்துதல் முறை ``AerSimulator`` பயன்படுத்தப்படுகிறது. இது தவிர, அனைத்து செயல்பாடுகளும் பின்வரும் எடுத்துக்காட்டில் உள்ளதைப் போலவே ``AerSimulator` 'கட்டுப்படுத்தப்படுகின்றன:
tr_tr: Simülasyon yöntemi ayarlanarak ``AerSimulator``'daki matris çarpım durumu simülasyon metodu çağrılır. Bunun dışında, aşağıdaki örnekte olduğu gibi, tüm işlemler ``AerSimulator`` tarafından kontrol edilir:
zh_tw: 透過設定模擬方法，我們可以在 ``AerSimulator`` 中使用matrix product state模擬方法。 除此之外，所有作業都由 ``AerSimulator`` 本身控制，如下列範例所示：

source: To see the internal state vector of the circuit we can use the ``save_statevector`` instruction. To return the full interal MPS structure we can also use the ``save_matrix_product_state`` instruction.
ta_in: சுற்றுகளின் உள் நிலை திசையனைக் காண நாம் ``save_statevector`` அறிவுறுத்தலைப் பயன்படுத்தலாம். முழு ஒருங்கிணைந்த MPS கட்டமைப்பை திருப்பித் தர நாம் `` save_matrix_product_state`` அறிவுறுத்தலையும் பயன்படுத்தலாம்.

source: To see the internal state vector of the circuit we can use the ``save_statevector`` instruction. To return the full internal MPS structure we can also use the ``save_matrix_product_state`` instruction.
bn_bn: বর্তনীর (সার্কিট) অভ্যন্তরীন অবস্থা নির্ণায়ক দিকরাশি (স্টেট ভেক্টর) দেখতে হলে ``save_statevector`` নির্দেশনা কাজে লাগাতে হবে। সম্পূর্ণ অভ্যন্তরীন এমপিএস গঠন পাওয়ার জন্য আমরা ``save_matrix_product_state`` নির্দেশনা ব্যবহার করতে পারি।
es_un: Para ver el vector de estado interno del circuito, podemos usar la instrucción ``save_statevector``. Para devolver la estructura MPS interna completa, también podemos usar la instrucción ``save_matrix_product_state``.
fr: Pour voir le vecteur d'état interne du circuit, nous pouvons utiliser l'instruction ``save_statevecteur``. Pour retourner la structure interne du MPS, nous pouvons également utiliser l'instruction ``save_matrix_product_state``.
ja: 回路内部の状態ベクトルを見るには、``save_statevector`` 命令を使います。完全な内部のMPS構造を返すには、``save_matrix_product_state`` 命令も使用できます。
pt_un: Para ver o vetor de estado interno do circuito, podemos usar a instrução ``save_statevector``. Para retornar a estrutura MPS interna completa, também podemos usar a instrução ``save_matrix_product_state``.
tr_tr: Devrenin iç durum vektörünü görmek için ``save_statevector`` talimatını kullanabiliriz. Tam iç MPS (matris çarpım durumu) yapısını döndürmek için ``save_matrix_product_state`` talimatını da kullanabiliriz.
zh_tw: 如果要查看電路的狀態向量，我們可以使用 ``save_statevector``這個指令 ， 如果要得到完整的內部 MPS 結構，我們也可以使用 ``save_matrix_product_state`` 的指令。
