Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/simulators/7_matrix_product_state_method.po
Languages: bn_bn, es_un, fr, id_id, ja, ko_kr, pt_un, ta_in, tr_tr, zh_tw

source: Two-qubit gates operate on consecutive qubits :math:`i` and :math:`i+1`. This involves a tensor-contract operation over :math:`\lambda^{[i-1]}`, :math:`\Gamma^{[i-1]}`, :math:`\lambda^{[i]}`, :math:`\Gamma^{[i+1]}` and :math:`\lambda^{[i+1]}`, that creates a single tensor. We apply the gate to this tensor, and then decompose back to the original structure. This operation may increase the size of the respective tensors. Gates that involve two qubits that are not consecutive, require a series of swap gates to bring the two qubits next to each other and then the reverse swaps.
bn_bn: ২-কিউবিট যুক্তিবর্তনী (গেইট) পরপর কিউবিটের :math:`i` এবং :math:`i+1` উপর কাজ করে। এর মধ্যে :math:`\lambda^{[i-1]}`, :math:`\Gamma^{[i-1]}`, :math:`\lambda^{[i]}`, :math:`\Gamma^{[i+1]}` ও :math:`\lambda^{[i+1]}` -এর উপর একটা টেন্সর-কন্ট্রাক্ট ক্রিয়াকলাপ (অপারেশন) হয় যেটা একটা দিকরাশি (টেন্সর) বানায়। আমরা যুক্তিবর্তনীকে (গেইট) এই দিকরাশির (টেন্সর) উপর প্রায় করি এবং তারপর প্রাথমিক কাঠামোয় ভেঙে যায়। এর ক্রিয়াকলাপ (অপারেশন) দিকরাশির (টেন্সর) আকার বাড়াতে পারে। যেসব যুক্তিবর্তনীতে (গেট) দুটো কিউবিট পরপর না তাদের ক্ষেত্রে কিছু সোয়াপ যুক্তিবর্তনী (গেইট) ব্যবহার করে কিউবিটগুলো প্রথমে পরপর আনা হয় এবং কাজের পর বিপরীত সোয়াপ যুক্তিবর্তনী (গেইট) ব্যবহার করতে হয়।
es_un: Las compuertas de dos qubits operan en qubits consecutivos :math:`i` e :math:`i+1`. Esto implica una operación de contracción de tensor sobre :math:`\lambda^{[i-1]}`, :math:`\Gamma^{[i-1]}`, :math:`\lambda^{[i]}`, :math:`\Gamma^{[i+1]}` y :math:`\lambda^{[i+1]}`, que crea un solo tensor. Aplicamos la compuerta a este tensor y luego descomponemos de nuevo a la estructura original. Esta operación puede incrementar el tamaño de los respectivos tensores. Las compuertas que involucran dos qubits que no son consecutivos, requieren una serie de compuertas de intercambio para poner los dos qubits uno al lado del otro y luego los intercambios inversos.
fr: Les portes deux qubit fonctionnent sur des qubits consécutifs :math:`i` et :math:`i+1`. Il s'agit d'une opération de tenseur sur :math:`\lambda^{[i-1]}`, :math:`\Gamma^{[i-1]}`, :math:` \lambda ^ {[i]} `, :math:`\Gamma^{[i+1]}` et :math:`\lambda^{[i+1]}`, qui crée un tenseur unique. Nous appliquons la porte à ce tenseur, puis nous décomposons à la structure originale. Cette opération peut augmenter la taille des tenseurs respectifs. Les portes qui impliquent deux qubits qui ne sont pas consécutifs, nécessitent une série de portes d'échange pour amener les deux qubits les uns à côté des autres, puis les swaps inverse.
id_id: Gate dua-qubit beroperasi pada qubit :math:` i ` dan :math:` i + 1 `. Ini melibatkan operasi tensor-kontrak di atas :math:` \lambda ^ ^ {[i-1]} `, :math:` \Gamma ^ {[i-1]} `, :math:` \lambda ^ {[i]} `, :math:` \Gamma ^ {[i + 1]} ` dan :math:` \lambda ^ {[i + 1]} `, yang menciptakan tensor tunggal. Kita menerapkan gerbang ke tensor ini, dan kemudian menguraikan kembali ke struktur asli. Operasi ini dapat meningkatkan ukuran masing-masing tensor. Gate yang melibatkan dua qubit yang tidak berurutan, membutuhkan serangkaian gate swap untuk membawa dua qubit berdekatan satu sama lain dan mengembalikannya ke posisi semula.
ja: ２量子ビットゲートは連続した量子ビット :math:`i` and :math:`i+1` に作用します。これには :math:`\lambda^{[i-1]}`, :math:`\Gamma^{[i-1]}`, :math:`\lambda^{[i]}`, :math:`\Gamma^{[i+1]}` および :math:`\lambda^{[i+1]}` のテンソル縮約が含まれ、単一のテンソルが作成されます。ゲートにはこのテンソルが適用され、次に元の構造にデコンポーズ(decompose) されます。この操作は各テンソルの大きさを増やすかも知れません。２つの量子ビットが連続していない場合には、swap ゲートをいくつか適用し２量子ビットが連続するようにし、再び swap を適応して元に戻します。
ko_kr: 2-큐비트 게이트들은 연속한 두 개의 큐비트 :math:`i`와 :math:`i+1`에 동작한다. 이는 :math:`\lambda^{[i-1]}`, :math:`\Gamma^{[i-1]}`, :math:`\lambda^{[i]}`, :math:`\Gamma^{[i+1]}`, 및 :math:`\lambda^{[i+1]}`에 대한 텐서 계약 조작을 포함하며 이는 단일 텐서를 작성한다. 우리는 게이트를 이 텐서에 적용한 다음 원래의 구조로 다시 분해한다. 이러한 동작은 각각의 텐서들의 크기를 증가시킬 수 있다. 연속적이지 않은 2개의 큐비트를 포함하는 게이트는 서로의 옆에 2개의 큐비트를 가져오고 그 다음에 리버스 스왑 (reverse swaps) 을 가져오기 위해 일련의 스왑 게이트 (swap gate) 를 필요로 한다.
pt_un: Portas de dois qubits operam em qubits consecutivos :math:`i` e :math:`i+1`. Isso envolve uma operação de contração tensorial sobre :math:`\lambda^{[i-1]}`, :math:`\Gamma^{[i-1]}`, :math:`\lambda^{[i]}`, :math:`\Gamma^{[i+1]}` e :math:`\lambda^{[i+1]}`, que cria um tensor único. Aplicamos a porta a este tensor e, em seguida, decompomos ele para a estrutura original. Esta operação pode aumentar o tamanho dos respectivos tensores. Portas que envolvem dois qubits que não são consecutivos exigem uma série de portas de troca para aproximar os dois qubits um do outro e depois as trocas inversas.
ta_in: இரண்டு-குவிட் வாயில்கள் தொடர்ச்சியான குவிட்களில் இயங்குகின்றன:math:`i` மற்றும்:math:` i +1`. இது ஒரு டென்சர்-ஒப்பந்த செயல்பாட்டை உள்ளடக்கியது:math:`\ lambda^{[i-1]}`, :math: `\Gamma^{[i-1]}`, :math:`\lambda^{[i]}`, :math:`\Gamma^{[i+1]}` and :math:`\lambda^{[i+1]}`, இது ஒற்றை டென்சரை உருவாக்குகிறது. இந்த டென்சருக்கு நாங்கள் வாயிலைப் பயன்படுத்துகிறோம், பின்னர் அசல் கட்டமைப்பிற்கு சிதைக்கிறோம். இந்த செயல்பாடு அந்தந்த டென்சர்களின் அளவை அதிகரிக்கக்கூடும். தொடர்ச்சியாக இல்லாத இரண்டு குவிட்களை உள்ளடக்கிய வாயில்கள், இரண்டு குவிட்களையும் ஒருவருக்கொருவர் கொண்டு வர தொடர்ச்சியான இடமாற்று வாயில்கள் தேவை, பின்னர் தலைகீழ் இடமாற்றங்கள்.
tr_tr: İki-kübit kapıları ardışık olan :math:`i` and :math:`i+1` kübitleri üzerine işler. Bu, :math:`\lambda^{[i-1]}`, :math:`\Gamma^{[i-1]}`, :math:`\lambda^{[i]}`, :math:`\Gamma^{[i+1]}` ve :math:`\lambda^{[i+1]}` üzerinde, tek bir tensör oluşturan bir tensör kasılması işlemi içerir. Kapıyı bu tensöre uygular, ardından asıl yapıya geri döneriz. Bu işlem ilgili tensörlerin boyutlarını artırabilir. Ardışık olmayan iki kübit içeren kapılar, bu iki kübiti yan yana getirebilmek için bir dizi takas (swap) kapısı gerektirir ve sonra bu takas işlemlerini ters çevirir.
zh_tw: 雙量子位元閘對連續的量子位:math:`i` 和 :math:`i+1` 進行操作時，包括:math:`\lambda^{[i-1]}`, :math:`\Gamma^{[i-1]}`, :math:`\lambda^{[i]}`, :math:`\Gamma^{[i+1]}` and :math:`\lambda^{[i+1]}`,以創建單個張量，我們將閘作用於這個張量後，然後分解回原始結構，這個操作可能會增加每個張量的大小，包含兩個非連續量子位的門需要一系列交換門來使兩個量子位元彼此相鄰，然後反向交換。

source: In the worst case, the tensors may grow exponentially. However, the size of the overall structure remains ‘small’ for circuits that do not have ‘many’ two-qubit gates. This allows much more efficient operations in circuits with relatively ‘low’ entanglement. Characterizing when to use this method over other methods is a subject of current research.
bn_bn: সবচেয়ে খারাপ ক্ষেত্রে, দিকরাশিগুলো (টেন্সর) ঘাতের হারে বৃদ্ধি পেতে পারে। কিন্তু যেসব বর্তনীতে (সার্কিট) ‘বেশি’ ২-কিউবিট যুক্তিবর্তনী (গেইট) থাকে না সেক্ষেত্রে সামগ্রিক কাঠামো ‘ছোট’ ই হয়। এর ফলে যেসব বর্তনীতে (সার্কিট) আপেক্ষিকভাবে ‘কম’ এনট্যাঙ্গেলমেন্ট থাকে তাদের ক্ষেত্রে দ্রুততর ক্রিয়াকলাপ (অপারেশন) হয়। কখন এই পদ্ধতি কাজে লাগানো উচিত সেটা এখনো পরীক্ষাধীন।
es_un: En el peor de los casos, los tensores pueden crecer exponencialmente. Sin embargo, el tamaño de la estructura general sigue siendo ‘pequeño’ para los circuitos que no tienen ‘muchas’ compuertas de dos qubits. Esto permite operaciones mucho más eficientes en circuitos con un entrelazamiento relativamente ‘bajo’. Caracterizar cuándo utilizar este método sobre otros métodos es un tema de investigación actual.
fr: Dans le pire des cas, les tenseurs peuvent croître de manière exponentielle. Cependant, la taille de la structure globale reste ‘petite’ pour les circuits qui n’ont pas de ‘nombreuses’ portes à deux qubits. Cela permet des opérations beaucoup plus efficaces dans les circuits avec une intrication relativement «faible». Caractériser quand utiliser cette méthode par rapport aux autres méthodes est un sujet de recherche en cours.
id_id: Dalam kasus terburuk, tensor dapat tumbuh secara eksponensial. Namun, ukuran struktur keseluruhan tetap 'kecil' untuk sirkuit yang tidak memiliki 'banyak' gate dua qubit. Hal ini memungkinkan operasi yang jauh lebih efisien di sirkuit dengan tingkat entanglement yang relatif 'rendah'. Karakterisasi untuk kapan menggunakan metode ini dan bukan metode lain adalah masih menjadi subjek penelitian.
ja: 最悪の場合、テンソルは指数関数的に成長する可能性があります。 しかし、構造全体の大きさは、 ‘多くの’ 2量子ビットゲートを持たない回路では ‘小さい’ ままです。これにより、比較的 ‘低い’ もつれの回路では、はるかに効率的な演算が可能になります。 他の方法ではなく、この方法を使うタイミングを特徴づけることは、現在の研究の対象です。
ko_kr: 최악의 경우, 텐서들은 기하급수적으로 성장할 수 있다. 그러나, 전체 구조의 크기는 '많은' 2개의 게이트 게이트들을 갖지 않는 회로들에 대해 '작은' 으로 남아 있다. 이는 상대적으로 '낮은' 얽힘 (entanglement) 을 갖는 회로들에서 훨씬 더 효율적인 동작들을 허용한다. 다른 방법에 비해 이 방법을 사용하는 것을 특성화하는 것은 현재의 연구의 대상이다.
pt_un: No pior dos casos, os tensores podem crescer exponencialmente. No entanto, o tamanho da estrutura geral permanece ‘pequeno’ para circuitos que não possuem ‘muitas’ portas de dois qubits. Isso permite operações muito mais eficientes em circuitos com um entrelaçamento relativamente ‘baixo’. Caracterizar quando utilizar este método sobre outros métodos é um assunto de pesquisa atual.
ta_in: மோசமான நிலையில், டென்சர்கள் அதிவேகமாக வளரக்கூடும். இருப்பினும், ஒட்டுமொத்த கட்டமைப்பின் அளவு ‘பல’ இரண்டு-குவிட் வாயில்கள் இல்லாத சுற்றுகளுக்கு ‘சிறியதாக’ உள்ளது. இது ஒப்பீட்டளவில் ‘குறைந்த’ சிக்கலுடன் சுற்றுகளில் மிகவும் திறமையான செயல்பாடுகளை அனுமதிக்கிறது. மற்ற முறைகளில் இந்த முறையை எப்போது பயன்படுத்த வேண்டும் என்பதைக் குறிப்பிடுவது தற்போதைய ஆராய்ச்சியின் ஒரு விடயமாகும்.
tr_tr: En kötü ihtimalle, tensörler üstel olarak büyüyebilir. Ancak, toplam yapının büyüklüğü, 'çok' iki-kübit kapısı içermeyen devreler için 'küçük' olmaya devam eder. Bu, devrelerde görece 'düşük' dolanıklık ile çok daha verimli işlem sağlar. Bu yöntemin hangi durumlarda diğer yöntemlere tercih edileceğinin ayırt edilmesi, güncel araştırmaların bir konusudur.
zh_tw: 在最壞的情況下，張量可能呈指數增長，然而，在沒有“很多”雙量子位元閘的電路中，結構的整體尺寸仍然算是“小”的， 這允許在相對“低”糾纏的電路中進行更有效的操作，而什麼時候要使用這種方法則是目前研究的主題。

source: Using the matrix product state simulation method
bn_bn: ম্যাট্রিক্স গুণফলের অবস্থা সিমুলেশন পদ্ধতির ব্যবহার
es_un: Usar el método de simulación de estado del producto de matriz
fr: Utilisation de la méthode de simulation d'état du produit matriciel
id_id: Menggunakan metode simulasi matrix product state
ja: 行列積状態シミュレーション方法を利用する
ko_kr: 행렬 곱 상태 시뮬레이션 방법을 사용하기
pt_un: Usando o método de simulação do estado de produto de matriz
ta_in: மேட்ரிக்ஸ் தயாரிப்பு நிலை உருவகப்படுத்துதல் முறையைப் பயன்படுத்துதல்
tr_tr: Matris çarpım durumu simülasyon yönteminin kullanılması
zh_tw: 使用Matrix product state 的模擬方法

source: The matrix product state simulation method is invoked in the ``QasmSimulator`` by setting the simulation method. Other than that, all operations are controlled by the ``QasmSimulator`` itself, as in the following example:
ko_kr: 매트릭스 프로덕트 상태 시뮬레이션 메소드는 시뮬레이션 메소드를 설정하여 ``QasmSimulator``에서 호출된다. 그 외의 모든 작업은 다음 예제와 같이 ``QasmSimulator`` 자체에 의해 제어된다.

source: To see the internal state vector of the circuit, we can import the snapshot files:
ko_kr: 이 회로 내부의 상태 벡터를 보려면 스냅샷 파일을 import하면 된다.

source: Running circuits using the matrix product state simulation method can be fast, relative to other methods. However, if we generate the state vector during the execution, then the conversion to state vector is, of course, exponential in memory and time, and therefore we don’t benefit from using this method. We can benefit if we only do operations that don’t require printing the full state vector. For example, if we run a circuit and then take measurement. The circuit below has 200 qubits. We create an ``EPR state`` involving all these qubits. Although this state is highly entangled, it is handled well by the matrix product state method, because there are effectively only two states.
bn_bn: অন্য পদ্ধতির তুলনায় ম্যাট্রিক্স গুণফল অবস্থা সিমুলেশন পদ্ধতিতে বর্তনী (সার্কিট) দ্রুত চালানো যায়। কিন্তু যদি আমরা গণনা চলাকালীন অবস্থা নির্ণায়ক দিকরাশি (স্টেট ভেক্টর) বানাই তাহলে এই পরিবর্তনের জন্য প্রচুর সময় ও মেমরি লাগবে এবং এই পদ্ধতি তখন অর্থহীন হয়ে যাবে। যেসব ক্রিয়াকলাপে (অপারেশন) পুরো অবস্থা নির্ণায়ক দিকরাশি (স্টেট ভেক্টর) দেখার প্রয়োজন নেই আমরা কেবল সেসব ক্রিয়াকলাপ (অপারেশন) এই পদ্ধতিতে করতে পারি। উদাহরণরূপে, যদি আমরা একটা বর্তনী (সার্কিট) চালাই ও পরিমাপ করি। নিচের বর্তনীতে (সার্কিট) ২০০টি কিউবিট আছে। আমরা সমস্ত কিউবিট নিয়ে একটা ``EPR state`` বানাতে পারি। যদিও এই অবস্থা খুবই পরিসাংখ্যিক বিজড়িত, ম্যাট্রিক্স গুনফল অবস্থা পদ্ধতি সহজেই এটা সামলাতে পারবে কারণ কার্যকরভাবে এটা কেবল ২টি অবস্থা।
es_un: La ejecución de circuitos que utilizan el método de simulación de estado del producto de matriz puede ser rápida, en comparación con otros métodos. Sin embargo, si generamos el vector de estado durante la ejecución, entonces la conversión a vector de estado es, por supuesto, exponencial en memoria y tiempo y, por lo tanto, no nos beneficiamos con el uso de este método. Podemos beneficiarnos si solo realizamos operaciones que no requieran imprimir el vector de estado completo. Por ejemplo, si ejecutamos un circuito y luego tomamos mediciones. El circuito de abajo tiene 200 qubits. Creamos un ``estado EPR`` que involucra a todos estos qubits. Aunque este estado está muy entrelazado, se maneja bien con el método de estado del producto de matriz, porque efectivamente solo hay dos estados.
fr: L'execution de circuits utilisant la méthode de simulation d'état du produit de la matrice peut être rapide, par rapport aux autres méthodes. Cependant, si nous générons le vecteur d'état pendant l'exécution, alors la conversion en vecteur d'état est, bien sûr, exponentielle en mémoire et en temps, et par conséquent, nous ne bénéficions pas de cette méthode. Nous pouvons en bénéficier si nous ne faisons que des opérations qui ne nécessitent pas d’imprimer la totalité du vecteur d’état. Par exemple, si nous exécutons un circuit et que nous prenons ensuite des mesures, le circuit ci-dessous a 200 qubits. Nous créons un état ``EPR`` impliquant tous ces qubits. Bien que cet état soit fortement intriqué, il est bien géré par la méthode d'état du produit de la matrice, car il n'y a effectivement que deux états.
id_id: Sirkuit dapat dieksekusi dengan cepat dengan menggunakan metode simulasi matrix product state, relatif terhadap metode lain. Namun, jika kita menghasilkan state vector selama eksekusi, maka konversi ke state vector adalah, tentu saja, eksponensial dalam memori dan waktu, dan karena itu kita tidak mendapatkan manfaat dari menggunakan metode ini. Kita dapat manfaat jika hanya melakukan operasi yang tidak memerlukan pencetakan state vector penuh. Sebagai contoh, jika kita menjalankan sebuah sirkuit dan kemudian melakukan pengukuran. Sirkuit di bawah ini memiliki 200 qubit. Kita membuat sebuah ` ` EPR state ` ` melibatkan semua qubit. Meskipun state ini sangat entangled, hal ini ditangani dengan baik oleh metode matrix product state, karena secara efektif hanya ada dua state.
ja: 行列積状態シミュレーション方法を使用した実行回路は、他の方法と比較して高速である可能性があります。 しかし、実行中に状態ベクトルを生成した場合、状態ベクトルへの変換は もちろんメモリーと時間の指数関数的なものです したがって我々はこの方法を使う恩恵を受けることはできません。 完全な状態ベクトルを出力する必要のない操作のみを行うことで利益を得ることができます。 例えば、回路を動かしてから測定する場合があげられます。以下の回路は200量子ビットです。 これらすべての量子ビットを含む ``EPR 状態`` を作成します。 この状態は非常にエンタングルしていますが、実質的には2つの状態しか存在しないため、行列積状態法によってうまく処理されます。
ko_kr: 매트릭스 제품 상태 시뮬레이션 방법을 사용하여 회로를 실행하는 것은 다른 방법에 비해 빠른 것일 수 있다. 그러나, 만약 우리가 실행 동안 상태 벡터를 생성한다면, 상태 벡터로의 변환은 당연히, 메모리와 시간에서 기하급수적으로 증가한다. 따라서 우리는 이 방법을 사용하는 것이 이득이 되지 않는다. 전체 상태 벡터를 인쇄할 필요가 없는 조작만 수행하면 이점을 얻을 수 있다. 예를 들어, 회로를 실행한 후 측정을 수행합다. 아래 회로에는 200개의 비트가 있습니다. 우리는 이 모든 쿼트를 포함한 ``EPR 상태 `` 를 만든다. 이 상태는 매우 복잡하지만 효과적으로 두 개의 상태만 있기 때문에 매트릭스곱으로 잘 처리된다.
pt_un: Executar circuitos usando o método de simulação de estado de produto de matriz pode ser rápido em relação a outros métodos. No entanto, se nós geramos o vetor de estado durante a execução, então a conversão para vetor de estado é, claro, exponencial na memória e no tempo, e por isso não nos beneficiamos com a utilização deste método. Podemos nos beneficiar se fizermos apenas operações que não exijam imprimir o vetor de estado completo. Por exemplo, se executamos um circuito e depois tomamos a medição. O circuito abaixo tem 200 qubits. Criamos um ``estado EPR`` que envolve todos esses qubits. Embora este estado seja altamente emaranhado, é bem gerido pelo método do estado de produto de matriz, porque na realidade só existem dois estados.
ta_in: மேட்ரிக்ஸ் தயாரிப்பு நிலை உருவகப்படுத்துதல் முறையைப் பயன்படுத்தி சுற்றுகளை இயக்குவது மற்ற முறைகளுடன் ஒப்பிடும்போது வேகமாக இருக்கும். எவ்வாறாயினும், மரணதண்டனையின் போது நாம் மாநில திசையனை உருவாக்கினால், மாநில திசையனுக்கான மாற்றம் நிச்சயமாக நினைவகத்திலும் நேரத்திலும் அதிவேகமானது, எனவே இந்த முறையைப் பயன்படுத்துவதால் நாங்கள் பயனடைய மாட்டோம். முழு மாநில திசையனை அச்சிடத் தேவையில்லாத செயல்பாடுகளை மட்டுமே செய்தால் நாங்கள் பயனடையலாம். உதாரணமாக, நாம் ஒரு சுற்று இயக்கி பின்னர் அளவீடு எடுத்தால். கீழே உள்ள சுற்று 200 குவிட்களைக் கொண்டுள்ளது. இந்த வினாக்கள் அனைத்தையும் உள்ளடக்கிய ஒரு ``EPR state`` ஐ உருவாக்குகிறோம். இந்த நிலை மிகவும் சிக்கலாக இருந்தாலும், மேட்ரிக்ஸ் தயாரிப்பு நிலை முறையால் இது நன்கு கையாளப்படுகிறது, ஏனெனில் திறம்பட இரண்டு மாநிலங்கள் மட்டுமே உள்ளன.
tr_tr: Devreleri matris çarpım durumu simülasyon yöntemini kullanarak çalıştırmak, diğer yöntemlere kıyasla hızlı olabilir. Ancak, durum vektörünü yürütme esnasında oluşturursak durum vektörüne dönüşüm, şüphesiz, bellekte ve zamanda üstel olacaktır. Bu yüzden, bu yöntemi kullanmaktan fayda sağlamıyoruz. Eğer sadece tam durum vektörünü yazdırması gerekmeyen işlemler yaparsak fayda sağlayabiliriz. Örneğin, bir devreyi çalıştırır ve sonra ölçüm yaparsak. Aşağıdaki devrede 200 kübit bulunuyor. Tüm bu kübitleri içerek bir ``EPR state`` oluşturuyoruz. Bu durumun büyük ölçüde dolanık olmasına rağmen, matris çarpım durumu yöntemi ile iyi ele alınabilmektedir çünkü burada sadece iki verimli durum bulunur.
zh_tw: 相對於其他方法，使用matrix product state 的模擬方法執行電路可以非常快速， 然而，如果在執行過程中產生狀態向量，則轉換到狀態向量所花的記憶體和時間當然會呈指數成長，因此這種方法較適用於不會把狀態向量完整印出的操作。 例如執行電路並進行測量。 下面這個電路有 200 個量子位元。 我們建立了一個包含所有量子位元的 " EPR state " ，但因為實際上只有兩個狀態 ，因此就算這個狀態糾纏的強度高，用matrix product state處理它的效率仍高。

source: We can handle more qubits than this, but execution may take a few minutes. Try running a similar circuit with 500 qubits! Or maybe even 1000 (you can get a cup of coffee while waiting).
bn_bn: আমরা এর থেকেও অধিক কিউবিট সামলে নিতে পারি, কিন্তু এক্সেকিউট বা সম্পাদন হতে মিনিট খানেক সময় নিতে পারে। একই বর্তনী (সার্কিট) আপনি ৫০০টি কিউবিট দিয়ে চালানোর চেষ্টা করে দেখুন! অথবা হতে পারে 1000(অপেক্ষা করবার সময় আপনি এক কাপ কফি নিয়ে আসতে পারেন)।
es_un: Podemos manejar más qubits que esto, pero la ejecución puede tardar unos minutos. ¡Intenta ejecutar un circuito similar con 500 qubits! O tal vez incluso 1000 (puedes tomar una taza de café mientras esperas).
fr: Nous pouvons gérer plus de qubits que cela, mais l'exécution peut prendre quelques minutes. Essayez de faire tourner un circuit similaire avec 500 qubits ! Ou peut-être même 1000 (vous pouvez prendre une tasse de café en attendant).
id_id: Kita dapat menangani lebih banyak qubit daripada ini, tapi eksekusi mungkin memakan waktu beberapa menit. Coba jalankan sirkuit yang sama dengan 500 qubit! Atau mungkin bahkan 1000 (Anda bisa menikmati secangkir kopi sambil menunggu).
ja: これよりも多くの量子ビットを扱うことができますが、実行には数分かかる場合があります。 500量子ビットで同じような回路を実行してみてください! または、1000など (待っている間にコーヒーを1杯飲むことができます)。
ko_kr: 우리는 이를 이용하여 더 많은 큐비트을 처리할 수 있지만 실행에는 몇 분이 더 소요될 것이다. 500 큐비트이나 1000 큐비트에서 비슷한 회로를 커피 한 잔을 마시면서 실행해 보라.
pt_un: Podemos lidar com mais qubits do que isso, mas a execução pode levar alguns minutos. Tente executar um circuito similar com 500 qubits! Ou talvez até 1000 (você pode tomar uma xícara de café enquanto espera).
ta_in: இதை விட அதிகமான வினாடிகளை நாம் கையாள முடியும், ஆனால் செயல்படுத்த சில நிமிடங்கள் ஆகலாம். இதேபோன்ற சுற்று 500 குவிட்டுகளுடன் இயக்க முயற்சிக்கவும்! அல்லது 1000 கூட இருக்கலாம் (காத்திருக்கும்போது ஒரு கப் காபி பெறலாம்).
tr_tr: Bundan daha fazla kübiti işleyebiliriz, ancak bunu yürütmek birkaç dakika sürebilir. 500 kübit ile benzer bir devre çalıştırmayı deneyin! Ya da belki 1000 (beklerken bir fincan kahve alabilirsiniz).
zh_tw: 我們可以處理更多的量子位元，但可能需要花幾分鐘來執行。試試用 500 個量子位元執行一個類似的電路！ 或者甚至 1000 個位元（你可以在等待的時候弄杯咖啡來喝)。

source: The ``AerSimulator`` has several simulation methods including ``statevector``, ``stabilizer``, ``extended_stabilizer`` and ``matrix_product_state``. Each of these determines the internal representation of the quantum circuit and the algorithms used to process the quantum operations. They each have advantages and disadvantages, and choosing the best method is a matter of investigation. In this tutorial, we focus on the ``matrix product state simulation method``.
bn_bn: ``AerSimulator`` -এ অনেক সিমুলেশন পদ্ধতি আছে, যেমন - ``statevector``, ``stabilizer``, ``extended_stabilizer`` ও ``matrix_product_state``। এদের প্রত্যেকটা কোয়ান্টাম বর্তনীর (সার্কিট) অভ্যন্তরীন গঠন এবং কোয়ান্টাম ক্রিয়াসমূহর সমাধানপদ্ধতি নির্ধারণ করে। প্রত্যেকের কিছু সুবিধা-অসুবিধা আছে এবং কাজের জন্য কোনটা ভালো সেটা খুঁজে নিতে হয়। এই পাঠসমূহে (টিউটোরিয়াল) আমরা ``ম্যাট্রিক্স গুনফল অবস্থা সিমুলেশন পদ্ধতি`` ব্যাপারে আলোচনা করবো।
es_un: El ``AerSimulator`` tiene varios métodos de simulación que incluyen ``statevector``, ``stabilizer``, ``extended_stabilizer`` y ``matrix_product_state``. Cada uno de estos determina la representación interna del circuito cuántico y los algoritmos utilizados para procesar las operaciones cuánticas. Cada uno tiene ventajas y desventajas, y elegir el mejor método es una cuestión de investigación. En este tutorial, nos enfocamos en el ``método de simulación del estado del producto de matriz``.
fr: ``AerSimulator``dispose de plusieurs méthodes de simulation, dont ``stateVector``, ``stabilizer``, ``extended_stabilizer`` et ``matrix_product_state``. Chacune de ces méthodes détermine la représentation interne du circuit quantique et les algorithmes utilisés pour traiter les opérations quantiques. Ils ont chacun des avantages et des inconvénients, et le choix de la meilleure méthode est une question d'expérience. Dans ce tutoriel, nous nous concentrons sur la "méthode de simulation par produit de matrices``.
ja: ``AerSimulator`` には、``statevector`` 、 ``stabilizer`` 、 ``extended_stabilizer`` 、 ``matrix_product_state`` などのいくつかのシミュレーション・メソッドがあります。 それぞれが量子回路の内部表現と、量子演算を処理するために使用されるアルゴリズムを決定します。 それぞれに長所と短所があり、最良の方法を選ぶには調査が必要です。 このチュートリアルでは、``行列積状態を用いたシミュレーション・メソッド`` に焦点を当てます。
pt_un: O ``AerSimulator`` possui vários métodos de simulação incluindo ``statevector``, ``stabilizer``, ``extended_stabilizer`` e ``matrix_product_state``. Cada um destes determina a representação interna do circuito quântico e os algoritmos utilizados para processar as operações quânticas. Cada um tem vantagens e desvantagens, e escolher o melhor método é uma questão de estudo e investigação. Neste tutorial, nos concentraremos no ``método de simulação do estado do produto matricial``.
ta_in: ``AerSimulator`` இல் `` statevector``, `` stabilizer``, `` நீட்டிக்கப்பட்ட_நிலையாக்கி`` மற்றும் `` matrix_product_state`` உள்ளிட்ட பல உருவகப்படுத்துதல் முறைகள் உள்ளன. இவை ஒவ்வொன்றும் குவாண்டம் சுற்றுகளின் உள் பிரதிநிதித்துவத்தையும், குவாண்டம் செயல்பாடுகளை செயலாக்கப் பயன்படுத்தப்படும் வழிமுறைகளையும் தீர்மானிக்கிறது. அவை ஒவ்வொன்றும் நன்மைகள் மற்றும் தீமைகள் உள்ளன, மேலும் சிறந்த முறையைத் தேர்ந்தெடுப்பது விசாரணைக்குரிய விஷயம். இந்த டுடோரியலில், `` மேட்ரிக்ஸ் தயாரிப்பு நிலை உருவகப்படுத்துதல் முறை`` இல் கவனம் செலுத்துகிறோம்.
tr_tr: ``AerSimulator``; ``statevector``, ``stabilizer``, ``extended_stabilizer`` ve ``matrix_product_state`` gibi birçok simülasyon yöntemi içerir. Bunların her biri, kuantum devresinin iç temsilini ve kuantum işlemlerinin işlenmesinde kullanılan algoritmaları belirler. Her birinin avantajları ve dezavantajları vardır. En iyi yöntemi bulmak ise araştırma meselesidir. Bu eğitsel bölümde ``matrix product state simulation method`` konusuna odaklanacağız.
zh_tw: ` ` AerSimulator`` 有數個模擬方法，包括 ``statevector``, ``stabilizer``，``extended_stabilizer`` 和``matrix_product_state``，其中的每一個都決定了量子電路的內部不同表示法和用於處理量子操作的演算法。 每個方法都有優缺點，如何選擇最好的方法，是我們需要關注的問題。 在本指導教學中，我們將重點放在 ``matrix product state simulation method``中。
