Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/migrate/migrate-estimator.po
Languages: es_un, ja

source: Calculate expectation values in an algorithm
es_un: Calcular los valores esperados en un algoritmo
ja: アルゴリズムにおける期待値の計算

source: The Estimator primitive is used to design an algorithm that calculates expectation values.
es_un: La primitiva Estimator se usa para diseñar un algoritmo que calcula los valores esperados.
ja: Estimator プリミティブは、期待値を計算するアルゴリズムを設計するために使用されます。

source: Background
es_un: Antecedentes
ja: 背景

source: The role of the ``Estimator`` primitive is two-fold: it acts as an **entry point** to quantum devices or simulators, replacing the ``Backend`` interface (commonly referred to as ``backend.run()``). Additionally, it is an **algorithmic abstraction** for expectation value calculations, so you don't have to manually construct the final expectation circuit. This results in a considerable reduction of the code complexity and a more compact algorithm design.
es_un: El rol de la primitiva ``Estimator`` es doble: actúa como un **punto de entrada** a los dispositivos cuánticos o simuladores, reemplazando la interfaz ``Backend`` (comúnmente conocida como ``backend.run()``). Además, es una **abstracción algorítmica** para los cálculos del valor esperado, por lo que no tienes que construir manualmente el circuito final de valor esperado. Esto da como resultado una reducción considerable de la complejidad del código y un diseño de algoritmo más compacto.
ja: ``Estimator`` プリミティブの役割は 2 つあります: 量子デバイスまたはシミュレータへの **エントリーポイント** として機能し、``Backend`` インターフェイス (一般に ``backend.run( )`` )を置き換えます。さらに、これは期待値計算の **アルゴリズムによる抽象化** であるため、最終的な期待値回路を手動で構築する必要はありません。 これにより、コードの複雑さが大幅に軽減され、アルゴリズム設計がよりコンパクトになります。

source: **Backend.run() model:** In this model, you accessed real backends and remote simulators using the ``qiskit-ibmq-provider`` module (now migrated to ``qiskit-ibm-provider``). To run **local** simulations, you could import a specific backend from ``qiskit-aer``. All of them followed the ``backend.run()`` interface.
es_un: **Modelo del backend.run():** En este modelo, accediste a backends reales y simuladores remotos utilizando el módulo ``qiskit-ibmq-provider`` (ahora migrado a ``qiskit-ibm-provider``). Para ejecutar simulaciones **locales**, puedes importar un backend específico de ``qiskit-aer``. Todos ellos siguieron la interfaz ``backend.run()``.
ja: **Backend.run() モデル:** このモデルでは、 ``qiskit-ibmq-provider`` モジュール (現在は ``qiskit-ibm-provider`` に移行されています) を使用して、実際のバックエンドとリモートシミュレーターにアクセスします。 **ローカル** シミュレーションを実行するには、 ``qiskit-aer`` から特定のバックエンドをインポートできます。 それらはすべて ``backend.run()`` インターフェイスに従います。

source: **Primitives model:** Access real backends and remote simulators through the ``qiskit-ibm-runtime`` **primitives** (``Sampler`` and ``Estimator``). To run **local** simulations, you can import specific `local` primitives from |qiskit_aer.primitives|_ and |qiskit.primitives|_. All of them follow the |BaseSampler|_ and |BaseEstimator|_ interfaces, but **only the Runtime primitives offer access to the Runtime service, sessions, and built-in error mitigation**.
es_un: **Modelo de primitivas:** Accede a backends reales y simuladores remotos a través de las **primitivas** de ``qiskit-ibm-runtime`` (``Sampler`` y ``Estimator``). Para ejecutar simulaciones **locales**, puedes importar primitivas `local` específicas de |qiskit_aer.primitives|_ y |qiskit.primitives|_. Todas siguen las interfaces |BaseSampler|_ y |BaseEstimator|_, pero **solo las primitivas Runtime ofrecen acceso al servicio Runtime, las sesiones y la mitigación de errores integrada**.
ja: **プリミティブ・モデル:** ``qiskit-ibm-runtime`` プリミティブ ( ``Sampler`` と ``Estimator`` ) を介して実際のバックエンドとリモート シミュレーターにアクセスします。 **ローカル** シミュレーションを実行するには、 |qiskit_aer.primitives|_ および |qiskit.primitives|_ から特定の `ローカル` プリミティブをインポートできます。 それらはすべて |BaseSampler|_ および |BaseEstimator|_ インターフェースに従いますが、 **Runtime プリミティブのみが、Runtime サービス、セッション、および組み込みのエラー軽減策へのアクセスを提供します** 。

source: If your code previously calculated expectation values using ``backend.run()``, you most likely used the |qiskit.opflow|_ module to handle operators and state functions. To support this scenario, the following migration example shows how to replace the (|qiskit.opflow|_ & ``backend.run()``) workflow with an ``Estimator``-based workflow.
es_un: Si tu código calculaba previamente los valores esperados usando ``backend.run()``, lo más probable es que hayas usado el módulo |qiskit.opflow|_ para manejar operadores y funciones de estado. Para admitir este escenario, el siguiente ejemplo de migración muestra cómo reemplazar el flujo de trabajo (|qiskit.opflow|_ y ``backend.run()``) con un flujo de trabajo basado en ``Estimator``.
ja: あなたのコードが以前に ``backend.run()`` を使って期待値を計算した場合、オペレータと状態関数を処理するために |qiskit.opflow|_ モジュールを使用した可能性が最も高いでしょう。 このシナリオをサポートするために、次の移行例は (|qiskit.opflow|_ と ``backend.run()``) ワークフローを ``Estimator`` ベースのワークフローに置き換える方法を示しています。

source: End-to-end example
es_un: Ejemplo de principio a fin
ja: エンド・ツー・エンドの例

source: 1. Problem definition
es_un: 1. Definición del problema
ja: 1. 問題定義

source: We want to compute the expectation value of a quantum state (circuit) with respect to a certain operator. In this example, we are using the H2 molecule and an arbitrary circuit as the quantum state:
es_un: Queremos calcular el valor esperado de un estado cuántico (circuito) con respecto a un determinado operador. En este ejemplo, estamos usando la molécula de H2 y un circuito arbitrario como estado cuántico:
ja: ある演算子に対する量子状態（回路）の期待値を計算したい。 この例では、H2 分子と任意の回路を量子状態として使用しています。

source: 1.a. [Legacy] Convert problem to ``opflow``
es_un: 1.a. [Anterior] Convertir el problema a ``opflow``
ja: 1.a. [Legacy] 問題を ``opflow`` に変換

source: |qiskit.opflow|_ provided its own classes to represent both operators and quantum states, so the problem defined above would be wrapped as:
es_un: |qiskit.opflow|_ proporcionaba sus propias clases para representar tanto a los operadores como a los estados cuánticos, por lo que el problema definido anteriormente se encapsularía como:
ja: |qiskit.opflow|_ は演算子と量子状態の両方を表す独自のクラスを提供したため、上で定義した問題は次のようにラップされます。

source: This step is no longer necessary when using the primitives.
es_un: Este paso ya no es necesario cuando se utilizan las primitivas.
ja: Primitive を使用する場合、この手順は不要になります。

source: For instructions to migrate from |qiskit.opflow|_, see the `opflow migration guide <qisk.it/opflow_migration>`_ .
es_un: Para obtener instrucciones sobre cómo migrar desde |qiskit.opflow|_, consulta la `guía de migración de opflow <qisk.it/opflow_migration>`_.
ja: |qiskit.opflow|_ から移行する手順については、`opflow 移行ガイド <qisk.it/opflow_migration>`_ を参照してください。

source: 2. Calculate expectation values on real device or cloud simulator
es_un: 2. Calcular los valores esperados en un dispositivo real o simulador en la nube
ja: 2. 実デバイスまたはクラウドシミュレーターで期待値を計算する

source: 2.a. [Legacy] Use ``opflow`` & ``backend.run()``
es_un: 2.a. [Anterior] Usar ``opflow`` y ``backend.run()``
ja: 2.a. [Legacy] ``opflow`` と ``backend.run()`` を使用する

source: The legacy workflow required many steps to compute an expectation value:
es_un: El flujo de trabajo anterior requería muchos pasos para calcular un valor esperado:
ja: 従来のワークフローでは、期待値を計算するために多くのステップが必要でした:

source: Replace ``ibmq_qasm_simulator`` with your device name to see the complete workflow for a real device.
es_un: Reemplaza ``ibmq_qasm_simulator`` con el nombre de tu dispositivo para ver el flujo de trabajo completo para un dispositivo real.
ja: ``ibmq_qasm_simulator`` をデバイス名に置き換えて、実際のデバイスの完全なワークフローを確認してください。

source: 2.b. [New] Use the ``Estimator`` Runtime primitive
es_un: 2.b. [Nuevo] Usar la primitiva ``Estimator`` de Runtime
ja: 2.b [New] ``Estimator`` Runtime primitiveを使用する

source: The ``Estimator`` simplifies the user-side syntax, making it a more convenient tool for algorithm design.
es_un: El ``Estimator`` simplifica la sintaxis del lado del usuario, convirtiéndolo en una herramienta más conveniente para el diseño de algoritmos.
ja: ``Estimator`` はユーザーサイドの構文を簡素化し、アルゴリズム設計に便利なツールです。

source: Note that the Estimator returns a list of values, as it can perform batched evaluations.
es_un: Ten en cuenta que el Estimator devuelve una lista de valores, ya que puede realizar evaluaciones por lotes.
ja: Estimator はバッチによる評価を行うことができるため、値のリストを返すことに注意してください。

source: The ``Estimator`` Runtime primitive offers a series of features and tuning options that do not have a legacy alternative to migrate from, but can help improve your performance and results. For more information, refer to the following:
es_un: La primitiva ``Estimator`` de Runtime ofrece una serie de características y opciones de ajuste que no tienen una alternativa en el modo anterior a ser migrada, pero pueden ayudar a mejorar tu rendimiento y resultados. Para obtener más información, consulta lo siguiente:
ja: ``Estimator`` Runtime プリミティブは一連の機能とチューニング・オプションを提供します。これらのオプションには移行元のレガシーな代替手段はありませんが、パフォーマンスと結果を改善するのに役立ちます。 詳細については、次を参照してください。

source: `Error mitigation tutorial <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/Error-Suppression-and-Error-Mitigation.html>`_
es_un: `Tutorial de mitigación de errores <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/Error-Suppression-and-Error-Mitigation.html>`_
ja: `エラー緩和チュートリアル <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/Error-Suppression-and-Error-Mitigation.html>`_

source: `Setting execution options topic <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/options.html>`_
es_un: `Configuración de las opciones de ejecución <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/options.html>`_
ja: `実行オプション・トピックの設定 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/options.html>`_

source: `Primitive execution options API reference <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`_
es_un: `Referencia de la API de opciones de ejecución de primitivas <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`_
ja: `Primitive 実行オプション APIリファレンス <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`_

source: `How to run a session topic <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/run_session.html>`_
es_un: `Cómo ejecutar una sesión <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/run_session.html>`_
ja: `セッション・トピックの実行方法 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/run_session.html>`_

source: 3. Other execution alternatives (non-Runtime)
es_un: 3. Otras alternativas de ejecución (no Runtime)
ja: 3. その他の実行代替 ( 実行時以外 )

source: This section describes how to use non-Runtime primitives to test an algorithm using local simulation. Let's assume that we want to solve the problem defined above with a local statevector simulation.
es_un: Esta sección describe cómo usar primitivas que no son de Runtime para probar un algoritmo usando simulación local. Supongamos que queremos resolver el problema definido anteriormente con una simulación de vector de estado local.

source: 3.a. [Legacy] Using the Qiskit Aer simulator
es_un: 3.a. [Anterior] Usar el simulador Qiskit Aer
ja: 3.a [Legacy] Qiskit Aer シミュレーターの使用

source: 3.b. [New] Use the Reference ``Estimator`` or Aer ``Estimator`` primitive
es_un: 3.b. [Nuevo] Usar la primitiva ``Estimator`` de referencia o el ``Estimator`` de Aer
ja: 3. b . [New] 参照 ``Estimator` ` または Aer ``Estimator`` プリミティブの使用

source: The Reference ``Estimator`` lets you perform either an exact or a shot-based noisy simulation based on the ``Statevector`` class in the ``qiskit.quantum_info`` module.
es_un: El ``Estimator`` de referencia te permite realizar una simulación exacta o ruidosa basada en iteraciones de la clase ``Statevector`` en el módulo ``qiskit.quantum_info``.
ja: Reference ``Estimator`` は、 ``qiskit.quantum_info`` モジュール内の ``Statevector`` クラスに基づいて、正確またはショット・ベースのノイズ・シミュレーションを実行することができます。

source: You can still access the Aer Simulator through its dedicated ``Estimator``. This can be handy for performing simulations with noise models. In this example, the simulation method has been updated to match the result from 3.a.
es_un: Todavía puedes acceder al Simulador Aer a través de su ``Estimator`` dedicado. Esto puede ser útil para realizar simulaciones con modelos de ruido. En este ejemplo, el método de simulación se ha actualizado para que coincida con el resultado de 3.a.
ja: 専用の ``Estimator`` を介して Aer Simulator に引き続きアクセスできます。 これは、ノイズ モデルでシミュレーションを実行する場合に便利です。 この例では、3.a の結果と一致するようにシミュレーション メソッドが更新されています。

source: For more information on using the Aer primitives, see the `VQE tutorial <https://qiskit.org/documentation/tutorials/algorithms/03_vqe_simulation_with_noise.html>`_ .
es_un: Para obtener más información sobre el uso de las primitivas Aer, consulta el `tutorial de VQE <https://qiskit.org/documentation/tutorials/algorithms/03_vqe_simulation_with_noise.html>`_ .
ja: Aer プリミティブの使用に関する詳細については、 `VQEチュートリアル <https://qiskit.org/documentation/tutorials/algorithms/03_vqe_simulation_with_noise.html>`_ を参照してください。

source: For more information about running noisy simulations with the **Runtime primitives**, see this `topic <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/noisy_simulators.html>`_.
es_un: Para obtener más información sobre cómo ejecutar simulaciones ruidosas con las **primitivas de Runtime**, consulta este `tema <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/noisy_simulators.html>`_.
ja: **ランタイム・プリミティブ** を使用してノイズの多いシミュレーションを実行する方法の詳細については、この `トピック <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/noisy_simulators.html>`_ を参照してください。

source: This section describes how to use non-Runtime primitives to test an algorithm using local simulation. Let's assume that we want to solve the problem defined above with a local state vector simulation.
ja: このセクションでは、非Runtimeプリミティブを使用し、ローカル シミュレーションを使用してアルゴリズムをテストする方法について説明します。 上で定義した問題をローカル状態ベクトル・シミュレーションで解決するとします。
