Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/migrate/migrate-qiskit-alg.po
Languages: es_un, ja

source: Work with updated Qiskit algorithms
es_un: Trabajar con algoritmos de Qiskit actualizados
ja: 更新された Qiskit アルゴリズムの操作

source: The |qiskit.algorithms|_ module has been updated to leverage the primitives in all of its classes. In practice, this means that:
es_un: El módulo |qiskit.algorithms|_ se ha actualizado para aprovechar las primitivas en todas sus clases. En la práctica, esto significa que:
ja: |qiskit.algorithms|_ モジュールは、そのすべてのクラスで primitive を活用するように更新されました。実際のところ、これは次のことを意味します：

source: All algorithms now take in a primitive instead of a ``Backend`` or |QuantumInstance|_
es_un: Todos los algoritmos ahora aceptan una primitiva en lugar de un ``Backend`` o |QuantumInstance|_
ja: すべてのアルゴリズムが、 ``Backend`` や |QuantumInstance|_ の代わりに、primitiveを取り込むようになりました。

source: Some algorithms now have a new import path
es_un: Algunos algoritmos ahora tienen una nueva ruta de importación
ja: 一部のアルゴリズムに新しいインポートパスが追加されました

source: New primitive-specific algorithms have been introduced
es_un: Se han introducido nuevos algoritmos específicos de primitivas
ja: Primitive に特化した新しいアルゴリズムが導入されました

source: As a side effect of the primitives refactoring, |qiskit.algorithms|_ no longer use |qiskit.opflow|_
es_un: Como efecto secundario de la refactorización de primitivas, |qiskit.algorithms|_ ya no usa |qiskit.opflow|_
ja: Primitive のリファクタリングの副作用として、 |qiskit.opflow|_ を使用しない |qiskit.algorithms|_ がとなりました。

source: Using **Runtime Sessions** can be particularly advantageous when working with variational algorithms, as they present iterative workloads that can submit multiple jobs per iteration. On top of this, the runtime primitives allow to try out different error mitigation techniques with no changes to the algorithm, just a simple option configuration.
es_un: El uso de las **Sesiones de Runtime** puede ser particularmente ventajoso cuando se trabaja con algoritmos variacionales, ya que presentan cargas de trabajo iterativas que pueden enviar varios trabajos por iteración. Además de esto, las primitivas de runtime permiten probar diferentes técnicas de mitigación de errores sin cambios en el algoritmo, solo una opción de configuración simple.
ja: **Runtime Sessions** の使用は、変分アルゴリズムを扱う場合に特に有利です。変分アルゴリズムは、反復ごとに複数のジョブを投入するため、反復作業負荷が発生します。さらに、 runtime primitives を使用することで、アルゴリズムに変更を加えることなく、簡単なオプション設定だけで、さまざまなエラー緩和技術を試すことができます。

source: The following end-to-end example illustrates how to use one of the refactored algorithms from |qiskit.algorithms|_ with the **Qiskit Runtime primitives**. For a detailed explanation of other algorithm migration scenarios, see the `Qiskit algorithms migration guide <https://qisk.it/algo_migration>`_.
es_un: El siguiente ejemplo completo ilustra cómo usar uno de los algoritmos refactorizados de |qiskit.algorithms|_ con las **primitivas de Runtime de Qiskit**. Para obtener una explicación detallada de otros escenarios de migración de algoritmos, consulta la `guía de migración de algoritmos de Qiskit <https://qisk.it/algo_migration>`_.
ja: 次のエンドツーエンドの例は、 |qiskit.algorithms|_ からリファクタリングされたアルゴリズムの1つをQiskit Runtime primitive で使用する方法を示しています。他のアルゴリズム移行シナリオの詳細な説明については、 `Qiskitアルゴリズム移行ガイド <https://qisk.it/algo_migration>`_ を参照してください。

source: Example: VQE
es_un: Ejemplo: VQE
ja: 例：VQE

source: The legacy ``VQE`` algorithm has been split into two new implementations:
es_un: El algoritmo de ``VQE`` anterior se ha dividido en dos nuevas implementaciones:
ja: 以前の``VQE`` アルゴリズムは、2つの新しい実装に分割されました：

source: ``VQE`` : Based on the Estimator
es_un: ``VQE`` : Basado en el Estimator
ja: ``VQE`` : Estimatorに基づくもの

source: ``SamplingVQE`` : For diagonal operators, based on the Sampler
es_un: ``SamplingVQE`` : Para operadores diagonales, basados en el Sampler
ja: ``SamplingVQE`` : Samplerをベースとした対角演算子用

source: The choice of implementation depends on the use case — whether you are interested in accessing the probability distribution corresponding to a quantum state (``SamplingVQE``) or an estimation of the ground state energy which might require, for example, measurements in multiple bases (``VQE``).
es_un: La elección de la implementación depende del caso de uso, ya sea que estés interesado en acceder a la distribución de probabilidad correspondiente a un estado cuántico (``SamplingVQE``) o una estimación de la energía del estado fundamental que podría requerir, por ejemplo, mediciones en múltiples bases (``VQE``).
ja: 量子状態に対応する確率分布にアクセスしたいのか (``SamplingVQE``) 、基底状態のエネルギーを推定し、例えば複数基底での測定が必要なのか (``VQE``) など、使用ケースによって実装を選択する必要があります。

source: Let's see the workflow changes for the Estimator-based VQE implementation:
es_un: Veamos los cambios en el flujo de trabajo para la implementación de VQE basada en Estimator:
ja: それでは、EstimatorベースのVQEを実現するためのワークフローの変更点を見てみましょう：

source: Step 1: Problem definition
es_un: Paso 1: Definición del problema
ja: ステップ 1: 問題の定義

source: The problem definition step is common to the old and new workflow: defining the Hamiltonian, ansatz, optimizer and initial point.
es_un: El paso de definición del problema es común al antiguo y al nuevo flujo de trabajo: definir el Hamiltoniano, el ansatz, el optimizador y el punto inicial.
ja: 問題定義ステップは、ハミルトニアン、ansatz、オプティマイザー、初期点の定義という新旧のワークフローに共通するものです。

source: The only difference is that the operator definition now relies on |qiskit.quantum_info|_ instead of |qiskit.opflow|_ . In practice, this means that all ``PauliSumOp`` dependencies should be replaced by ``SparsePauliOp``.
es_un: La única diferencia es que la definición del operador ahora se basa en |qiskit.quantum_info|_ en lugar de |qiskit.opflow|_ . En la práctica, esto significa que todas las dependencias de ``PauliSumOp`` deben ser reemplazadas por ``SparsePauliOp``.
ja: 唯一の違いは、演算子の定義が |qiskit.opflow|_ の代わりに |qiskit.quantum_info|_ に依存するようになったことです。 実際には、これはすべての ``PauliSumOp`` 依存性を ``SparsePauliOp`` で置き換える必要があることを意味しています。

source: All of the refactored classes in |qiskit.algorithms|_ now take in operators as instances of ``SparsePauliOp`` instead of ``PauliSumOp``.
es_un: Todas las clases refactorizadas en |qiskit.algorithms|_ ahora aceptan operadores como instancias de ``SparsePauliOp`` en lugar de ``PauliSumOp``.
ja: |qiskit.algorithms|_ のリファクタリングされたクラスはすべて、 ``PauliSumOp`` の代わりに``SparsePauliOp`` のインスタンスとして演算子を取り込むようになりました。

source: The ansatz, optimizer and initial point are defined identically:
es_un: El ansatz, el optimizador y el punto inicial se definen de forma idéntica:
ja: Ansatz、オプティマイザー、初期点は同じように定義されています。

source: The operator definition changes
es_un: La definición del operador cambia
ja: 演算子の定義が変わります

source: Step 2: Backend setup
es_un: Paso 2: Configuración del backend
ja: ステップ2: バックエンドの設定

source: Let's say that you want to run VQE on the ``ibmq_qasm_simulator`` in the cloud. Before you would load you IBMQ account, get the corresponding backend from the provider, and use it to set up a |QuantumInstance|_. Now, you need to initialize a ``QiskitRuntimeService``, open a `session`_ and use it to instantiate your :class:`.Estimator`.
es_un: Supongamos que deseas ejecutar VQE en ``ibmq_qasm_simulator`` en la nube. Antes de cargar tu cuenta de IBMQ, obtén el backend correspondiente del proveedor y utilízalo para configurar una |QuantumInstance|_. Ahora, necesitas inicializar un ``QiskitRuntimeService``, abrir una `session`_ y usarla para instanciar tu :class:`.Estimator`.
ja: 例えば、クラウド上の ``ibmq_qasm_simulator`` 上でVQEを実行したいとします。以前は、IBMQアカウントをロードし、プロバイダーから対応するバックエンドを取得し、それを使って |QuantumInstance|_ をセットアップしていました。今は、 ``QiskitRuntimeService`` を初期化して `session`_ を開き、それを使って :class:`.Estimator` をインスタンス化する必要があります。

source: Step 3: Run VQE
es_un: Paso 3: Ejecutar VQE
ja: ステップ3: VQEの実行

source: Now that both the problem and the execution path have been set up, you can instantiate and run VQE. Close the session only if all jobs are finished and you don't need to run more jobs in the session.
es_un: Ahora que se han configurado tanto el problema como la ruta de ejecución, puedes crear instancias y ejecutar VQE. Cierra la sesión solo si todos los trabajos han terminado y no necesitas ejecutar más trabajos en la sesión.
ja: これで問題と実行パスの両方が設定されたので、VQEをインスタンス化して実行することができます。すべてのジョブが終了し、セッション内でこれ以上ジョブを実行する必要がない場合にのみ、セッションを終了してください。

source: ``VQE`` is one of the algorithms with a changed import path. If you do not specify the full path during the import, you might run into conflicts with the legacy code.
es_un: ``VQE`` es uno de los algoritmos con una ruta de importación modificada. Si no especificas la ruta completa durante la importación, es posible que tengas conflictos con el código antiguo.
ja: ``VQE`` は、インポートパスが変更されたアルゴリズムの1つです。インポート時にフルパスを指定しないと、レガシーコードとのコンフリクトに遭遇する可能性があります。

source: Using context managers
es_un: Uso de administradores de contexto
ja: コンテキストマネージャーを使う

source: We recommend that you initialize your primitive and run your algorithm using a context manager. The code for steps 2 and 3 would then look like:
es_un: Te recomendamos que inicialices tu primitiva y ejecutes tu algoritmo usando un administrador de contexto. El código para los pasos 2 y 3 se verían así:
ja: Primitive を初期化し、コンテキストマネージャーを使ってアルゴリズムを実行することをお勧めします。そうすると、ステップ2とステップ3のコードは次のようになります：

source: Related links
es_un: Enlaces relacionados
ja: 関連リンク

source: See the `Session documentation <./how_to/run_session.html>` for further information about the Qiskit Runtime sessions.
es_un: Consulta la `documentación de Session <./how_to/run_session.html>` para obtener más información sobre las sesiones de Qiskit Runtime.
ja: Qiskit Runtimeのセッションに関する詳しい情報は、 `セッションの実行 <./how_to/run_session.html>` を参照してください。

source: See the `How to run a primitive in a session <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/run_session.html>`__ topic for detailed code examples.
es_un: Consulta el tema `Cómo ejecutar una primitiva en una sesión <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/run_session.html>`__ para obtener ejemplos de código detallados.
ja: 詳細なコード例については、 `セッションの実行 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/run_session.html>`__ のトピックを参照してください。

source: See the `Qiskit algorithm documentation <https://qiskit.org/documentation/apidoc/algorithms.html>`__ for details about each algorithm.
es_un: Consulta la `documentación de los algoritmos de Qiskit <https://qiskit.org/documentation/apidoc/algorithms.html>`__ para obtener detalles sobre cada algoritmo.
ja: 各アルゴリズムの詳細については、 `Qiskitアルゴリズムドキュメント <https://qiskit.org/documentation/apidoc/algorithms.html>`__ を参照してください。

source: See the `Qiskit algorithm tutorials <https://qiskit.org/documentation/tutorials/algorithms/index.html>`__ for examples of how to use algorithms.
es_un: Consulta los `tutoriales de algoritmos de Qiskit <https://qiskit.org/documentation/tutorials/algorithms/index.html>`__ para ver ejemplos de cómo utilizar los algoritmos.
ja: アルゴリズムの使用方法の例については、 `Qiskitアルゴリズムチュートリアル <https://qiskit.org/documentation/tutorials/algorithms/index.html>`__ を参照してください。

source: Read the blog `Introducing Qiskit Algorithms With Qiskit Primitives! <https://medium.com/qiskit/introducing-qiskit-algorithms-with-qiskit-runtime-primitives-d89703ecfca3>`__ for an introduction to using the updated algorithms.
es_un: Lee el blog `Introducing Qiskit Algorithms With Qiskit Primitives! <https://medium.com/qiskit/introducing-qiskit-algorithms-with-qiskit-runtime-primitives-d89703ecfca3>`__ para obtener una introducción al uso de los algoritmos actualizados.
ja: 更新されたアルゴリズムの使い方の紹介は、ブログ `Introducing Qiskit Algorithms With Qiskit Primitives! <https://medium.com/qiskit/introducing-qiskit-algorithms-with-qiskit-runtime-primitives-d89703ecfca3>`__ をお読みください。
