Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/migrate/migrate-update-parm.po
Languages: es_un

source: Parametrized circuits are a commonly used tool for quantum algorithm design. Because `backend.run()` did not accept parametrized circuits, the parameter binding step had to be integrated in the algorithm workflow. The primitives can perform the parameter binding step internally, which results in a simplification of the algorithm-side logic.
es_un: Los circuitos parametrizados son una herramienta de uso común para el diseño de algoritmos cuánticos. Debido a que `backend.run()` no aceptaba circuitos parametrizados, el paso de vinculación de parámetros tenía que integrarse en el flujo de trabajo del algoritmo. Las primitivas pueden realizar el paso de vinculación de parámetros internamente, lo que resulta en una simplificación de la lógica del lado del algoritmo.

source: The following example summarizes the new workflow for managing parametrized circuits.
es_un: El siguiente ejemplo resume el nuevo flujo de trabajo para la gestión de circuitos parametrizados.

source: Example
es_un: Ejemplo

source: Let's define a parametrized circuit:
es_un: Definamos un circuito parametrizado:

source: We want to assign the following parameter values to the circuit:
es_un: Queremos asignar los siguientes valores de parámetros al circuito:

source: Legacy
es_un: Previamente

source: Previously, the parameter values had to be bound to their respective circuit parameters prior to calling `backend.run()`.
es_un: Anteriormente, los valores de los parámetros tenían que vincularse a sus respectivos parámetros de circuito antes de llamar a `backend.run()`.

source: Primitives
es_un: Primitivas

source: Now, the primitives take in parametrized circuits directly, together with the parameter values, and the parameter assignment operation can be performed more efficiently on the server side of the primitive.
es_un: Ahora, las primitivas toman los circuitos parametrizados directamente, junto con los valores de los parámetros, y la operación de asignación de parámetros se puede realizar de manera más eficiente en el lado del servidor de la primitiva.

source: This feature is particularly interesting when working with iterative algorithms because the parametrized circuit remains unchanged between calls while the parameter values change. The primitives can transpile once and then cache the unbound circuit, using classical resources more efficiently. Moreover, only the updated parameters are transferred to the cloud, saving additional bandwidth.
es_un: Esta característica es particularmente interesante cuando se trabaja con algoritmos iterativos porque el circuito parametrizado permanece sin cambios entre llamadas mientras cambian los valores de los parámetros. Las primitivas pueden transpilar una vez y luego almacenar en caché el circuito no vinculado, utilizando los recursos clásicos de manera más eficiente. Además, solo los parámetros actualizados se transfieren a la nube, lo que ahorra ancho de banda adicional.
