Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/migrate/migrate-sampler.po
Languages: es_un, ja

source: Circuit sampling in an algorithm
es_un: Muestreo de circuito en un algoritmo
ja: アルゴリズムにおける回路のサンプリング

source: The Sampler primitive is used to design an algorithm that samples circuits and extracts probability distributions.
es_un: La primitiva Sampler se usa para diseñar un algoritmo que muestrea circuitos y extrae distribuciones de probabilidad.
ja: Sampler primitive は、回路をサンプリングして確率分布を抽出するアルゴリズムを設計するために使用します。

source: Background
es_un: Antecedentes
ja: 背景

source: The role of the ``Sampler`` primitive is two-fold: it acts as an **entry point** to quantum devices or simulators, replacing ``backend.run()``. Additionally, it is an **algorithmic abstraction** to extract probability distributions from measurement counts.
es_un: El rol de la primitiva ``Sampler`` es doble: actúa como un **punto de entrada** a dispositivos cuánticos o simuladores, reemplazando ``backend.run()``. Además, es una **abstracción algorítmica** para extraer distribuciones de probabilidad a partir de conteos de mediciones.
ja: ``Sampler`` primitive の役割は2つあり、 ``backend.run()`` の代わりに量子デバイスやシミュレーターへの **エントリーポイント** として機能すること。さらに、測定回数から確率分布を抽出するための **アルゴリズム的な抽象化** としての機能もあります。

source: Both ``Sampler`` and ``backend.run()`` take in circuits as inputs. The main difference is the format of the output: ``backend.run()`` outputs **counts**, while ``Sampler`` processes those counts and outputs the **quasi-probability distribution** associated with them.
es_un: Tanto ``Sampler`` como ``backend.run()`` toman circuitos como entradas. La principal diferencia es el formato de la salida: ``backend.run()`` genera **conteos**, mientras que ``Sampler`` procesa esos conteos y genera la **distribución de cuasi-probabilidad** asociada con ellos.
ja: ``Sampler`` と ``backend.run()`` は、どちらも回路を入力として取り込みます。主な違いは出力の形式です。``backend.run()`` は **カウント** を出力しますが、 ``Sampler`` はそのカウントを処理し、それに関連する **準確率分布** を出力します。

source: **Backend.run() model:** In this model, you used the ``qiskit-ibmq-provider`` (now migrated to ``qiskit-ibm-provider``) module to access real backends and remote simulators. To run **local** simulations, you could import a specific backend from ``qiskit-aer``. All of them followed the ``backend.run()`` interface.
es_un: **Modelo del backend.run():** En este modelo, usaste el módulo ``qiskit-ibmq-provider`` (ahora migrado a ``qiskit-ibm-provider``) para acceder a backends reales y simuladores remotos. Para ejecutar simulaciones **locales**, puedes importar un backend específico de ``qiskit-aer``. Todos ellos siguieron la interfaz ``backend.run()``.
ja: **Backend.run() model:** このモデルでは、 ``qiskit-ibmq-provider`` （現在は ``qiskit-ibm-provider`` に移行）モジュールを使用して、実際のバックエンドとリモートシミュレータにアクセスしました。 **ローカル** シミュレーションを実行するには、 ``qiskit-aer`` から特定のバックエンドをインポートすることができます。これらはすべて ``backend.run()`` というインターフェースに従っています。

source: **Primitives model:** Access real backends and remote simulators through the `qiskit-ibm-runtime` **primitives** (`Sampler` and `Estimator`). To run **local** simulations, import specific `local` primitives from |qiskit_aer.primitives|_ and |qiskit.primitives|_. All of them follow the |BaseSampler|_ and |BaseEstimator|_ interfaces, but **only the Runtime primitives offer access to the Runtime service, sessions, and built-in error mitigation**.
es_un: **Modelo de primitivas:** Accede a backends reales y simuladores remotos a través de las **primitivas** de `qiskit-ibm-runtime` (`Sampler` y `Estimator`). Para ejecutar simulaciones **locales**, importa primitivas `local` específicas de |qiskit_aer.primitives|_ y |qiskit.primitives|_. Todas siguen las interfaces |BaseSampler|_ y |BaseEstimator|_, pero **solo las primitivas Runtime ofrecen acceso al servicio Runtime, las sesiones y la mitigación de errores integrada**.
ja: **Primitive モデル:** `qiskit-ibm-runtime` **primitives** ( `Sampler` と `Estimator`) を介して実際のバックエンドとリモート シミュレーターにアクセスします。 **ローカル** シミュレーションを実行するには、 |qiskit_aer.primitives|_ および |qiskit.primitives|_ から特定の `ローカル` プリミティブをインポートできます。 それらはすべて |BaseSampler|_ および |BaseEstimator|_ インターフェースに従いますが、 **Runtime プリミティブのみが、Runtime サービス、セッション、および組み込みのエラー軽減策へのアクセスを提供します** 。

source: Next, we will show an end-to-end example of sampling a circuit: first, with ``backend.run()``, then by using the ``Sampler``.
es_un: A continuación, mostraremos un ejemplo completo de muestreo de un circuito: primero, con ``backend.run()``, luego usando ``Sampler``.
ja: 次に、まず、回路をサンプリングするエンドツーエンドの例を示します。まず、 ``backend.run()`` を使用し、次に ``Sampler`` を使用してサンプリングします。

source: End-to-end example
es_un: Ejemplo de principio a fin
ja: エンド・ツー・エンドの例

source: 1. Problem definition
es_un: 1. Definición del problema
ja: 1. 問題定義

source: We want to find the probability (or quasi-probability) distribution associated with a quantum state:
es_un: Queremos encontrar la distribución de probabilidad (o cuasi-probabilidad) asociada con un estado cuántico:
ja: ある量子状態に関連する確率（または準確率）分布を求めます：

source: Important: If you want to use the ``Sampler`` primitive, the circuit **must contain measurements**.
es_un: Importante: Si deseas utilizar la primitiva ``Sampler``, el circuito **debe contener mediciones**.
ja: 重要： ``Sampler`` primitive を使用したい場合、回路は **測定を含んでいなければなりません** 。

source: 2. Calculate probability distribution on a real device or cloud simulator
es_un: 2. Calcular la distribución de probabilidad en un dispositivo real o simulador en la nube
ja: 2. 実機またはクラウドシミュレーター上で確率分布を計算

source: 2.a. [Legacy] Use ``backend.run()``
es_un: 2.a. [Anterior] Usar ``backend.run()``
ja: 2.a. [Legacy] ``backend.run()`` を使用する

source: The required steps to reach our goal with ``backend.run()`` are:
es_un: Los pasos necesarios para alcanzar nuestro objetivo con ``backend.run()`` son:
ja: ``backend.run()`` でゴールに到達するために必要なステップは以下の通りです：

source: Run circuits
es_un: Ejecuta los circuitos
ja: 回路の実行

source: Get counts from the result object
es_un: Obtén los conteos del objeto de resultado
ja: 結果オブジェクトからカウントを取得

source: Use the counts and shots to calculate the probability distribution
es_un: Usa los conteos y las iteraciones (shots) para calcular la distribución de probabilidad
ja: カウントとショットを使用して確率分布を計算する

source: First, we run the circuit in a cloud simulator and output the result object:
es_un: Primero, ejecutamos el circuito en un simulador de la nube y generamos el objeto de resultado:
ja: まず、回路をクラウドシミュレーターで実行し、結果オブジェクトを出力します。

source: Replace ``ibmq_qasm_simulator`` with your device name to see the complete workflow for a real device.
es_un: Reemplaza ``ibmq_qasm_simulator`` con el nombre de tu dispositivo para ver el flujo de trabajo completo para un dispositivo real.
ja: ``ibmq_qasm_simulator`` をデバイス名に置き換えて、実際のデバイスの完全なワークフローを確認してください。

source: Now we get the probability distribution from the output:
es_un: Ahora obtenemos la distribución de probabilidad de la salida:
ja: 次に、出力から確率分布を求めます。

source: 2.b. [New] Use the ``Sampler`` Runtime primitive
es_un: 2.b. [Nuevo] Usar la primitiva ``Sampler`` de Runtime
ja: 2.b [New] ``Sampler`` Runtime primitiveを使用する

source: While the user-side syntax of the ``Sampler`` is very similar to ``backend.run()``, notice that the workflow is now simplified, as the quasi-probability distribution is returned **directly** (no need to perform post-processing), together with some key metadata.
es_un: Si bien la sintaxis del lado del usuario de ``Sampler`` es muy similar a ``backend.run()``, observa que el flujo de trabajo ahora está simplificado, ya que la distribución de cuasi-probabilidad se devuelve **directamente** (no necesita realizar un procesamiento posterior), junto con algunos metadatos clave.
ja: ``Sampler`` のユーザー側の構文は ``backend.run()`` と非常に似ていますが、準確率分布を **直接** (後処理は不要) に、いくつかの重要なメタデータと共に返すので、ワークフローが簡素化されていることに注意してください。

source: Be careful with the output format. With ``Sampler``, the states are no longer represented by bitstrings, for example, ``"11"``, but by integers, for example, ``3``. To convert the ``Sampler`` output to bitstrings, you can use the |QuasiDistribution.binary_probabilities|_ method, as shown below.
es_un: Ten cuidado con el formato de salida. Con ``Sampler``, los estados ya no se representan por cadenas de bits, por ejemplo, ``"11"``, sino por números enteros, por ejemplo, ``3``. Para convertir la salida de ``Sampler`` a cadenas de bits, puedes usar el método |QuasiDistribution.binary_probabilities|_, como se muestra a continuación.

source: The ``Sampler`` Runtime primitive offers several features and tuning options that do not have a legacy alternative to migrate from, but can help improve your performance and results. For more information, refer to the following:
es_un: La primitiva ``Sampler`` de Runtime ofrece varias características y opciones de ajuste que no tienen una alternativa en el modo anterior a ser migrada, pero pueden ayudar a mejorar tu rendimiento y resultados. Para obtener más información, consulta lo siguiente:
ja: ``Sampler`` Runtime primitive はいくつかの機能とチューニング・オプションを提供します。これらのオプションには移行元のレガシーな代替手段はありませんが、パフォーマンスと結果を改善するのに役立ちます。 詳細については、次を参照してください。

source: `Error mitigation tutorial <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/Error-Suppression-and-Error-Mitigation.html>`_
es_un: `Tutorial de mitigación de errores <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/Error-Suppression-and-Error-Mitigation.html>`_
ja: `エラー緩和チュートリアル <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/Error-Suppression-and-Error-Mitigation.html>`_

source: `Setting execution options topic <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/options.html>`_
es_un: `Configuración de las opciones de ejecución <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/options.html>`_
ja: `実行オプション・トピックの設定 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/options.html>`_

source: `How to run a session topic <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/run_session.html>`_
es_un: `Cómo ejecutar una sesión <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/run_session.html>`_
ja: `セッション・トピックの実行方法 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/run_session.html>`_

source: 3. Other execution alternatives (non-Runtime)
es_un: 3. Otras alternativas de ejecución (no Runtime)
ja: 3. その他の実行代替 ( 実行時以外)

source: The following migration paths use non-Runtime primitives to use local simulation to test an algorithm. Let's assume that we want to use a local statevector simulation to solve the problem defined above.
es_un: Las siguientes rutas de migración usan primitivas que no son de Runtime para usar la simulación local para probar un algoritmo. Supongamos que queremos usar una simulación local de vector de estado para resolver el problema definido anteriormente.

source: 3.a. [Legacy] Use the Qiskit Aer simulator
es_un: 3.a. [Anterior] Usar el simulador Qiskit Aer
ja: 3.a [Legacy] Qiskit Aer シミュレーターの使用

source: Now let's get the probability distribution from the output:
es_un: Ahora obtengamos la distribución de probabilidad de la salida:
ja: 次に、出力から確率分布を求めます。

source: 3.b. [New] Use the Reference ``Sampler`` or Aer ``Sampler`` primitive
es_un: 3.b. [Nuevo] Usar la primitiva ``Sampler`` de referencia o el ``Sampler`` de Aer
ja: 3. b. [New] 参照 ``Sampler`` または Aer ``Sampler`` primitiveの使用

source: The Reference ``Sampler`` lets you perform an exact or a shot-based noisy simulation based on the ``Statevector`` class in the ``qiskit.quantum_info`` module.
es_un: El ``Sampler`` de referencia te permite realizar una simulación exacta o ruidosa basada en iteraciones de la clase ``Statevector`` en el módulo ``qiskit.quantum_info``.
ja: リファレンスの ``Sampler`` は、 ``qiskit.quantum_info`` モジュール内の ``Statevector`` クラスに基づいて、厳密シミュレーションまたはショット・ベースのノイズ・シミュレーションを実行することができます。

source: If shots are specified, this primitive outputs a shot-based simulation (no longer exact):
es_un: Si se especifican iteraciones (shots), esta primitiva genera una simulación basada en iteraciones (ya no es exacta):
ja: ショットが指定された場合は、ショットに基づくシミュレーションを出力します（厳密ではなくなります）：

source: You can still access the Aer simulator through its dedicated ``Sampler``. This can be handy for performing simulations with noise models. In this example, the simulation method has been updated to match the result from 3.a.
es_un: Todavía puedes acceder al simulador Aer a través de su ``Sampler`` dedicado. Esto puede ser útil para realizar simulaciones con modelos de ruido. En este ejemplo, el método de simulación se ha actualizado para que coincida con el resultado de 3.a.
ja: 専用の ``Sampler`` を介して Aer simulator に引き続きアクセスできます。 これは、ノイズ モデルでシミュレーションを実行する場合に便利です。 この例では、3.a の結果と一致するようにシミュレーション メソッドが更新されています。

source: For information about running noisy simulations with the **Runtime primitives**, see `this topic <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/noisy_simulators.html>`_.
es_un: Para obtener información sobre cómo ejecutar simulaciones ruidosas con las **primitivas de Runtime**, consulta `este tema <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/noisy_simulators.html>`_.

source: Be careful with the output format. With ``Sampler``, the states are no longer represented by bit strings, for example, ``"11"``, but by integers, for example, ``3``. To convert the ``Sampler`` output to bit strings, you can use the |QuasiDistribution.binary_probabilities|_ method, as shown below.
ja: 出力形式には注意が必要です。 ``Sampler`` では、状態はもはやビット列、例えば ``"11"`` ではなく、整数、例えば ``3`` で表されます。 ``Sampler`` の出力をビット列に変換するには、以下のように |QuasiDistribution.binary_probabilities|_ メソッドを使用します。

source: The following migration paths use non-Runtime primitives to use local simulation to test an algorithm. Let's assume that we want to use a local state vector simulation to solve the problem defined above.
ja: 以下の移行経路は、非Runtime Primitive を使用して、アルゴリズムをテストするためにローカルシミュレーションを使用します。上で定義した問題を解決するために、ローカルな状態ベクトルシミュレーションを使いたいと仮定します。

source: For information, see `Noisy simulators in Qiskit Runtime <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/noisy_simulators.html>`_.
ja: 詳細については、 `Qiskit Runtimeでノイズシミュレーションを実行 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/noisy_simulators.html>`_ を参照してください。
