Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/migrate/migrate-guide.po
Languages: es_un, ja

source: Migrate to using Qiskit Runtime primitives
ja: Qiskit Runtime primitives を使用するためのマイグレーション

source: This guide describes key patterns of behavior and use cases with code examples to help you migrate code from the legacy ``qiskit-ibmq-provider`` package to use the Qiskit Runtime primitives.
es_un: Esta guía describe patrones clave de comportamiento y casos de uso con ejemplos de código para ayudarte a migrar el código del paquete anterior ``qiskit-ibmq-provider`` para usar las primitivas de Qiskit Runtime.
ja: このガイドでは、QisKit Runtime primitive を使用するために、従来の ``qiskit-ibmq-provider`` パッケージからコードを移行するのに役立つコード例と使用例について説明します。

source: Primitives are the recommended tool to write quantum algorithms, as they encapsulate common device queries seen in application packages and allow for managed performance through the Qiskit Runtime service. However, if your algorithm requires more granular information, such as pre-shot measurements, the primitives might not provide the desired abstraction level.
ja: Primitive は、アプリケーションパッケージで見られる一般的なデバイスクエリーをカプセル化し、Qiskit Runtimeサービスを通じてパフォーマンスを管理できるため、量子アルゴリズムを書くための推奨ツールです。しかし、アルゴリズムがプリショット測定など、より詳細な情報を必要とする場合、Primitive は望ましい抽象化レベルを提供しないかもしれません。

source: The Qiskit Runtime primitives implement the reference ``Sampler`` and ``Estimator`` interfaces found in `qiskit.primitives <https://qiskit.org/documentation/apidoc/primitives.html>`_. These interfaces let you switch between primitive implementations with minimal code changes. Different primitive implementations can be found in the ``qiskit``, ``qiskit_aer``, and ``qiskit_ibm_runtime`` libraries. Each implementation serves a specific purpose:
ja: Qiskit RuntimeのPrimitiveは、 `qiskit.primitives <https://qiskit.org/documentation/apidoc/primitives.html>`_ にある参照用の ``Sampler`` と ``Estimator`` インターフェイスを実装します。これらのインターフェースにより、最小限のコード変更でPrimitive の実装を切り替えることができます。異なるPrimitive の実装は ``qiskit``, ``qiskit_aer``, ``qiskit_ibm_runtime`` ライブラリーで見つけることができます。それぞれの実装は特定の目的を果たすものです：

source: The primitives in ``qiskit`` can perform local state vector simulations - useful for quickly prototyping algorithms.
ja: ``qiskit`` の Primitive は、ローカルな状態ベクトルのシミュレーションを行うことができ、アルゴリズムの迅速なプロトタイピングに有用です。

source: The primitives in ``qiskit_aer`` give access to the local Aer simulators for tasks such as noisy simulation.
es_un: Las primitivas en ``qiskit_aer`` dan acceso a los simuladores Aer locales para tareas como simulación ruidosa.
ja: ``qiskit_aer`` の Primitive は、ノイジーシミュレーションなどのタスクのために、ローカルAerシミュレーターへのアクセスを提供します。

source: The primitives in ``qiskit_ibm_runtime`` provide access to cloud simulators and real hardware through the Qiskit Runtime service. They include exclusive features such as built-in circuit optimization and error mitigation support.
es_un: Las primitivas en ``qiskit_ibm_runtime`` brindan acceso a simuladores en la nube y hardware real a través del servicio Qiskit Runtime. Incluyen funciones exclusivas, como la optimización de circuitos integrados y la compatibilidad con la mitigación de errores.
ja: ``qiskit_ibm_runtime`` の Primitive は、Qiskit Runtimeサービスを通じて、クラウドシミュレーターや実際のハードウェアにアクセスすることができます。回路最適化やエラー軽減のサポートなど、独自の機能を内蔵しています。

source: The **only primitives that provide access to the Qiskit Runtime service** are those imported from ``qiskit_ibm_runtime`` (Qiskit Runtime Primitives).
es_un: Las **únicas primitivas que brindan acceso al servicio Qiskit Runtime** son las importadas de ``qiskit_ibm_runtime`` (Qiskit Runtime Primitives).
ja: **Qiskit Runtimeサービスへのアクセスを提供するPrimitive** は、 ``qiskit_ibm_runtime`` （Qiskit Runtime Primitives）からインポートしたものだけです。

source: When migrating, the key to writing an equivalent algorithm using primitives is to first identify what is the minimal unit of information your algorithm is based on:
es_un: Al migrar, la clave para escribir un algoritmo equivalente utilizando primitivas es identificar primero cuál es la unidad mínima de información en la que se basa tu algoritmo:
ja: 移行する際、Primitive を使って同等のアルゴリズムを書くには、まずアルゴリズムが基づいている情報の最小単位が何であるかを特定することが重要です：

source: If it uses an **expectation value**, you will need an ``Estimator``.
es_un: Si usas un **valor esperado**, necesitarás un ``Estimator``.
ja: **期待値** を使用する場合は、 ``Estimator`` が必要です。

source: If it uses a **probability distribution** (from sampling the device), you will need a ``Sampler``.
es_un: Si usa una **distribución de probabilidad** (del muestreo del dispositivo), necesitarás un ``Sampler``.
ja: もし（デバイスのサンプリングによる） **確率分布** を使用する場合は、 ``Sampler`` が必要です。

source: After determining which primitive to use, identify where the algorithm accesses the backend. Look for the call to ``backend.run()``. Next, you will replace this call with the respective primitive call, as shown in the following examples.
es_un: Después de determinar qué primitiva usar, identifica dónde accede el algoritmo al backend. Busca la llamada a ``backend.run()``. A continuación, reemplazarás esta llamada con la llamada primitiva respectiva, como se muestra en los siguientes ejemplos.
ja: どの Primitive を使うかを決めたら、アルゴリズムがバックエンドにアクセスする箇所を特定します。 ``backend.run()`` という呼び出しを探します。次に、この呼び出しを、以下の例のように、それぞれの Primitive の呼び出しに置き換えます。

source: Algorithm developers who need to refactor algorithms to use primitives instead of `backend.run` should refer to these topics:
es_un: Los desarrolladores de algoritmos que necesitan refactorizar algoritmos para usar primitivas en lugar de `backend.run` deben consultar estos temas:
ja: アルゴリズムをリファクタリングして `backend.run` の代わりに Primitive を使用する必要があるアルゴリズム開発者は、これらのトピックを参照する必要があります：

source: `Update code that performs circuit sampling <migrate-sampler.html>`__
es_un: `Actualizar el código que realiza el muestreo del circuito <migrate-sampler.html>`__
ja: `Sampler の使用によるアルゴリズムの設計 <migrate-sampler.html>`__

source: `Update code that calculates expectation values <migrate-estimator.html>`__
es_un: `Actualizar el código que calcula valores esperados <migrate-estimator.html>`__
ja: `Estimator の使用によるアルゴリズムの設計 <migrate-estimator.html>`__

source: The following topics are use cases with code migration examples:
es_un: Los siguientes temas son casos de uso con ejemplos de migración de código:
ja: 以下のトピックは、コードの移行例のユースケースです：

source: `Update parameter values while running <migrate-update-parm.html>`__
es_un: `Actualizar los valores de los parámetros mientras se está ejecutando <migrate-update-parm.html>`__
ja: `実行中のパラメーター値の更新 <migrate-update-parm.html>`__

source: `Algorithm tuning options (shots, transpilation, error mitigation) <migrate-tuning.html>`__
ja: `アルゴリズム・チューニング・オプション (ショット、トランスパイル、エラー緩和) <migrate-tuning.html>`__

source: Why use Qiskit Runtime?
es_un: ¿Por qué usar Qiskit Runtime?
ja: QisKit Runtime を使う理由

source: Function
ja: 機能

source: Simplified algorithm building blocks
ja: 単純化されたアルゴリズム構築ブロック

source: Flexible interface
ja: 柔軟なインターフェース

source: Elastic compute integration
ja: 柔軟な計算の統合

source: Queuing efficiency
ja: キューの効率化

source: Data caching
ja: データ キャッシング

source: Error mitigation support
ja: エラー緩和のサポート

source: SAAS enablement
ja: SAAS 有効化

source: Key:
ja: キー:

source: :octicon:`x` Not supported
ja: :octicon:`x` はサポートされていません

source: :octicon:`check` Full support
ja: :octicon:`check` フル・サポート

source: :octicon:`clock` Future support
ja: :octicon:`clock` 将来のサポート

source: **Benefits of using Qiskit Runtime**:
es_un: **Beneficios de usar Qiskit Runtime**:
ja: **Qiskit Runtimeを使うメリット**:

source: Simplify algorithm design and optimization.
es_un: Simplifica el diseño y la optimización de algoritmos.
ja: アルゴリズムの設計と最適化を簡素化

source: Run circuits faster by using sessions - a context manager designed to efficiently manage iterative workloads and minimize artificial latency between quantum and classical sub-components.
es_un: Ejecuta circuitos más rápido mediante el uso de sesiones: un administrador de contexto diseñado para administrar de manera eficiente las cargas de trabajo iterativas y minimizar la latencia artificial entre los subcomponentes cuánticos y clásicos.
ja: 量子サブコンポーネントと古典サブコンポーネントの間の人工的なレイテンシーを最小化し、反復作業負荷を効率的に管理するように設計されたコンテキストマネージャーであるセッションを使用して、回路をより速く実行します。

source: Access our most powerful quantum systems with our latest performance and hardware optimization, including capabilities like error suppression and mitigation.
es_un: Accede a nuestros sistemas cuánticos más potentes con nuestro último rendimiento y optimización de hardware, incluidas las capacidades como la supresión y mitigación de errores.
ja: エラーの抑制や軽減などの機能を含む、最新のパフォーマンスとハードウェアの最適化により、最も強力な量子システムにアクセスできます。

source: Easily integrate Qiskit Runtime with your cloud or on-premise classical compute resources by using the quantum serverless toolkit.
es_un: Integra fácilmente Qiskit Runtime con tu nube o recursos computacionales clásicos locales mediante el uso del kit de herramientas sin servidor cuántico.
ja: 量子サーバーレス・ツールキットを使用することで、Qiskit Runtimeをクラウドまたはオンプレミスの古典的な計算リソースと簡単に統合することができます。

source: **Simplified interface**:
es_un: **Interfaz simplificada**:
ja: **簡易化されたインタフェース**:

source: Use primitives to write code more efficiently. For details, see the examples topics, such as `Using Estimator to design an algorithm <migrate-estimator.html>`__.
ja: Primitive を使って、より効率的にコードを書くことができます。 詳しくは、 `Estimator の使用によるアルゴリズムの設計 <migrate-estimator.html>`__ などのサンプルトピックを参照してください。<migrate-estimator.html>

source: Code without primitives, and the same code after being rewritten to use primitives.
es_un: Código sin primitivas, y el mismo código después de ser reescrito para usar primitivas.
ja: Primitive を使用しないコードと、Primitive を使用するように書き直した後の同じコード。

source: FAQs
es_un: Preguntas Frecuentes
ja: FAQ

source: Users might have the following questions when planning to migrate their code to Qiskit Runtime:
es_un: Los usuarios pueden tener las siguientes preguntas cuando planean migrar su código a Qiskit Runtime:
ja: ユーザーは、コードを Qiskit Runtime に移行する際に、以下の質問を持つ場合があります。

source: After deciding to use Qiskit Runtime primitives, the user must determine whether to access Qiskit Runtime through IBM Cloud or IBM Quantum Platform. Some information that might help you decide includes:
es_un: Después de decidir utilizar las primitivas de Qiskit Runtime, el usuario debe determinar si accederá a Qiskit Runtime a través de IBM Cloud o IBM Quantum Platform. Alguna información que podría ayudarte a decidir incluye:
ja: Qiskit Runtime primitive を使用することを決定した後、ユーザーはIBM CloudまたはIBM Quantum PlatformのどちらでQiskit Runtimeにアクセスするかを決める必要があります。 その判断に役立つ情報としては、以下のようなものがあります：

source: The available plans:
es_un: Los planes disponibles:
ja: 利用可能なプラン:

source: Qiskit Runtime is available in both the Open (free access) or Premium (contract-based paid access) plan on IBM Quantum Platform. See `IBM Quantum access plans <https://www.ibm.com/quantum/access-plans>`__ for details.
es_un: Qiskit Runtime está disponible en el plan Open (acceso gratuito) o Premium (acceso pagado basado en contrato) en IBM Quantum Platform. Consulta `Planes de acceso de IBM Quantum <https://www.ibm.com/quantum/access-plans>`__ para obtener detalles.
ja: Qiskit Runtime は、 IBM Quantum Platformでのオープン (無料アクセス) またはプレミアム (契約ベースの有料アクセス) プランの両方で使用可能です。 詳しくは、`IBM Quantumアクセスプラン <https://www.ibm.com/quantum/access-plans>`__ を参照してください。

source: Qiskit Runtime is accessible through the Lite (free access) or Standard (pay-as-you-go access) plan in IBM Cloud. See `Plans <../cloud/plans.html>`__ for details.
es_un: Se puede acceder a Qiskit Runtime a través del plan Lite (acceso gratuito) o Estándar (acceso de pago por uso) en IBM Cloud. Consulta `Planes <../cloud/plans.html>`__ para obtener detalles.
ja: Qiskit Runtimeは、 IBM クラウドで ライトプラン (無料アクセス) またはスタンダードプラン (お客様へのお支払いによるアクセス) を介してアクセスが可能です。 詳細については、 `プラン <../cloud/plans.html>`__ を参照してください。

source: The use case requirements:
es_un: Los requerimientos de caso de uso:
ja: ユース・ケース要件:

source: IBM Quantum Platform offers a visual circuit composer (Quantum Composer) and a Jupyter Notebook environment (Quantum Lab).
es_un: IBM Quantum Platform ofrece un compositor visual de circuitos (Quantum Composer) y un entorno de Jupyter Notebook (Quantum Lab).
ja: IBM Quantum Platform は、ビジュアルなサーキット・コンポーザー (Quantum Composer) とJupyter Notebook 環境 (Quantum Lab) を提供しています。

source: IBM Cloud offers a cloud native service that is ideal if users need to integrate quantum capabilities with other cloud services.
es_un: IBM Cloud ofrece un servicio nativo en la nube que es ideal si los usuarios necesitan integrar capacidades cuánticas con otros servicios en la nube.
ja: IBM クラウド は、他のクラウドサービスと量子機能を統合する必要がある場合に理想的なクラウドネイティブサービスを提供します。

source: After deciding which channel to use to interact with Qiskit Runtime, you can get set up on either platform using the instructions below:
es_un: Después de decidir qué canal usar para interactuar con Qiskit Runtime, puedes configurar cualquiera de las plataformas siguiendo las instrucciones a continuación:
ja: QisKit Runtime とのやり取りに使用するチャンネルを決定した後、以下の手順を使用して、いずれかのプラットフォームで設定できます。

source: To get started with Qiskit Runtime on IBM Quantum Platform, see `Experiment with Qiskit Runtime <https://quantum-computing.ibm.com/services/resources/docs/resources/runtime/start>`__.
es_un: Para comenzar con Qiskit Runtime en IBM Quantum Platform, consulta `Experimentar con Qiskit Runtime <https://quantum-computing.ibm.com/services/resources/docs/resources/runtime/start>`__.
ja: IBM Quantum Platform 上の Qiskit Runtime を開始するには、 `Experiment with Qiskit Runtime <https://quantum-computing.ibm.com/services/resources/docs/resources/runtime/start>`__ を参照してください。

source: To get started with Qiskit Runtime on IBM Cloud, see the `Getting Started guide <../cloud/get-started.html>`__.
es_un: Para comenzar con Qiskit Runtime en IBM Cloud, consulta la `guía de Primeros Pasos <../cloud/get-started.html>`__.
ja: IBM クラウド上で Qiskit Runtimeを開始するには、`Getting Started guide <../cloud/get-started.html>`__ を参照してください。

source: As of v0.22, `Qiskit Terra algorithms <https://github.com/Qiskit/qiskit-terra/tree/main/qiskit/algorithms>`__ use Qiskit Runtime primitives. Thus, there is no need for users to modify amplitude estimators or any other Qiskit Terra algorithms.
es_un: A partir de la v0.22, los `algoritmos de Qiskit Terra <https://github.com/Qiskit/qiskit-terra/tree/main/qiskit/algorithms>`__ usan primitivas de Qiskit Runtime. Por lo tanto, no es necesario que los usuarios modifiquen los estimadores de amplitud o cualquier otro algoritmo de Qiskit Terra.
ja: V0.22 以降では、 `Qiskit Terra アルゴリズム <https://github.com/Qiskit/qiskit-terra/tree/main/qiskit/algorithms>`__ は Qiskit Runtime primitive を使用します。 したがって、振幅推定値や他のQisKit Terraアルゴリズムを変更する必要はありません。

source: When choosing which primitive to use, you first need to understand whether the algorithm uses a **quasi-probability distribution** sampled from a quantum state (a list of quasi-probabilities), or an **expectation value** of a certain observable with respect to a quantum state (a real number).
ja: どちらのPrimitive を使用するかを選択する際には、まず、アルゴリズムが量子状態 ( 準確率のリスト) から抽出された **準確率分布** を使用するか、または量子状態 ( 実数) に関して、ある特定の観測値の **期待値** を使用するかを理解する必要があります。

source: A probability distribution is often of interest in optimization problems that return a classical bit string, encoding a certain solution to a problem at hand. In these cases, you might be interested in finding a bit string that corresponds to a ket value with the largest probability of being measured from a quantum state, for example.
es_un: Una distribución de probabilidad suele ser de interés en los problemas de optimización que devuelven una cadena de bits clásica, codificando una determinada solución para un problema en cuestión. En estos casos, podrías estar interesado en encontrar una cadena de bits que corresponda a un valor ket con la mayor probabilidad de ser medido desde un estado cuántico, por ejemplo.
ja: 確率分布は、目の前の問題に対する特定の解を符号化した古典的なビット列を返す最適化問題で、しばしば関心を持たれます。このような場合、例えば、量子状態から測定される確率が最も大きいケット値に対応するビット列を見つけることに興味があるかもしれません。

source: An expectation value of an observable could be the target quantity in scenarios where knowing a quantum state is not relevant. This often occurs in optimization problems or chemistry applications. For example, when trying to discover the extremal energy of a system.
es_un: Un valor esperado de un observable podría ser la cantidad objetivo en escenarios donde conocer un estado cuántico no es relevante. Esto ocurre a menudo en problemas de optimización o aplicaciones químicas. Por ejemplo, cuando se trata de descubrir la energía extrema de un sistema.
ja: 量子状態を知ることが重要でないシナリオでは、観測値の期待値を目標量とすることができます。これは、最適化問題や化学の応用でよく起こることです。 例えば、あるシステムの極限エネルギーを発見しようとする場合などです。

source: Related links
es_un: Enlaces relacionados
ja: 関連リンク

source: `Get started with Estimator <../tutorials/how-to-getting-started-with-estimator.ipynb>`__
ja: `Estimator入門 <../tutorials/how-to-getting-started-with-estimator.ipynb>`__

source: `Get started with Sampler <../tutorials/how-to-getting-started-with-sampler.ipynb>`__
ja: `Sampler入門 <../tutorials/how-to-getting-started-with-sampler.ipynb>`__

source: `Tutorial: Migrate from qiskit-ibmq-provider to qiskit-ibm-provider <https://qiskit.org/documentation/partners/qiskit_ibm_provider/tutorials/Migration_Guide_from_qiskit-ibmq-provider.html>`__
ja: `チュートリアル: qiskit-ibmq-provider から qiskit-ibm-provider への移行 <https://qiskit.org/documentation/partners/qiskit_ibm_provider/tutorials/Migration_Guide_from_qiskit-ibmq-provider.html>`__

source: Migration guide
es_un: Guía de migración

source: The primitives are the recommended tool to write quantum algorithms, as they encapsulate common device queries seen in application packages, and allow for managed performance through the Qiskit Runtime service. However, if your algorithm requires more granular information, such as pre-shot measurements, the primitives might not provide the desired abstraction level. You can refer to the restructured ``qiskit-ibm-provider`` package, and its corresponding `migration guide <https://qiskit.org/documentation/partners/qiskit_ibm_provider/tutorials/Migration_Guide_from_qiskit-ibmq-provider.html>`_ for further information on alternatives to the Qiskit Runtime primitives.
es_un: Las primitivas son la herramienta recomendada para escribir algoritmos cuánticos, ya que encapsulan las consultas de dispositivos comunes que se ven en los paquetes de aplicaciones y permiten el rendimiento administrado a través del servicio Qiskit Runtime. Sin embargo, si tu algoritmo requiere información más granular, como mediciones previas al una iteración, es posible que las primitivas no proporcionen el nivel de abstracción deseado. Puedes consultar el paquete ``qiskit-ibm-provider`` reestructurado y su correspondiente `guía de migración <https://qiskit.org/documentation/partners/qiskit_ibm_provider/tutorials/Migration_Guide_from_qiskit-ibmq-provider.html>`_ para obtener más información sobre alternativas a las primitivas de Qiskit Runtime.

source: The Qiskit Runtime primitives implement the reference ``Sampler`` and ``Estimator`` interfaces found in `qiskit.primitives <https://qiskit.org/documentation/apidoc/primitives.html>`_. These interfaces let you switch between primitive implementations with minimal code changes. Different primitive implementations can be found in the ``qiskit``, ``qiskit_aer``, and ``qiskit_ibm_runtime`` library. Each implementation serves a specific purpose:
es_un: Las primitivas de Qiskit Runtime implementan las interfaces de referencia ``Sampler`` y ``Estimator`` que se encuentran en `qiskit.primitives <https://qiskit.org/documentation/apidoc/primitives.html>`_. Estas interfaces te permiten cambiar entre implementaciones primitivas con cambios de código mínimos. Se pueden encontrar diferentes implementaciones primitivas en las bibliotecas ``qiskit``, ``qiskit_aer``, y ``qiskit_ibm_runtime``. Cada implementación tiene un propósito específico:

source: The primitives in ``qiskit`` can perform local statevector simulations - useful for quickly prototying algorithms.
es_un: Las primitivas en ``qiskit`` pueden realizar simulaciones de vectores de estado locales, útiles para crear prototipos de algoritmos rápidamente.

source: Some qiskit libraries provide their own ``backend.run()`` wrappers, for example: ``QuantumInstance``, formerly used in ``qiskit.algorithms``. To migrate code that has such dependencies, replace the execution method with the corresponding primitive.
es_un: Algunas bibliotecas de qiskit proporcionan sus propios encapsulamientos de ``backend.run()``, por ejemplo: ``QuantumInstance``, anteriormente utilizada en ``qiskit.algorithms``. Para migrar código que tiene tales dependencias, reemplaza el método de ejecución con la primitiva correspondiente.

source: This guide has examples for two basic types of users:
es_un: Esta guía tiene ejemplos para dos tipos básicos de usuarios:

source: Algorithm users that refer to Qiskit algorithms but do not directly use primitives. These users now need to pass in a primitive instead of a backend to the updated Qiskit algorithms. Refer to this topic for details:
es_un: Usuarios de algoritmos que utilizan los algoritmos de Qiskit, pero que no usan primitivas directamente. Estos usuarios ahora necesitan pasar una primitiva en lugar de un backend a los algoritmos de Qiskit actualizados. Consulta este tema para obtener más detalles:

source: `Work with updated Qiskit algorithms <migrate-qiskit-alg.html>`__
es_un: `Trabajar con los algoritmos de Qiskit actualizados <migrate-qiskit-alg.html>`__

source: `Algorithm tuning options (shots, transpilation, error mitigation) <migrate-e2e.html>`__
es_un: `Opciones de ajuste de algoritmos (iteraciones, transpilación, mitigación de errores) <migrate-e2e.html>`__

source: table comparing backend.run to Qiskit Runtime primitives
es_un: tabla que compara backend.run con las primitivas Qiskit Runtime

source: Use primitive programs to write code more efficiently. For details, see the examples topics, such as `Using Estimator to design an algorithm <migrate-estimator>`__.
es_un: Usa programas primitivos para escribir código de manera más eficiente. Para obtener detalles, consulta los temas de ejemplos, como el `Uso de Estimator para diseñar un algoritmo <migrate-estimator>`__.

source: Two code snippets, side by side
es_un: Dos fragmentos de código, uno al lado del otro

source: When choosing which primitive to use, you first need to understand whether the algorithm uses a **quasi-probability distribution** sampled from a quantum state (a list of quasi-probabilities), or an **expectation value*** of a certain observable with respect to a quantum state (a real number).
es_un: Al elegir qué primitiva usar, primero debes comprender si el algoritmo usa una **distribución de cuasi-probabilidad** muestreada de un estado cuántico (una lista de cuasi-probabilidades) o un **valor esperado*** de un cierto observable con respecto a un estado cuántico (un número real).

source: Replace all dependencies on ``QuantumInstance`` and ``Backend`` with the implementation of the ``Estimator``, ``Sampler``, or both primitives from the ``qiskit_ibm_runtime`` library.
es_un: Reemplaza todas las dependencias en ``QuantumInstance`` y ``Backend`` con la implementación de ``Estimator``, ``Sampler``, o ambas primitivas de la biblioteca ``qiskit_ibm_runtime``.

source: It is also possible to use local implementations, as shown in the `Amplitude estimation use case <migrate-e2e#amplitude>`__.
es_un: También es posible usar implementaciones locales, como se muestra en el `Caso de uso de estimación de amplitud <migrate-e2e#amplitude>`__.

source: `Get started with Estimator <../tutorials/how-to-getting-started-with-estimator>`__
es_un: `Primeros pasos con Estimator <../tutorials/how-to-getting-started-with-estimator>`__

source: `Get started with Sampler <../tutorials/how-to-getting-started-with-sampler>`__
es_un: `Primeros pasos con Sampler <../tutorials/how-to-getting-started-with-sampler>`__
