Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/migrate/migrate-tuning.po
Languages: es_un, ja

source: Guide on algorithm tuning options
es_un: Guía sobre opciones de ajuste de algoritmos
ja: アルゴリズムのチューニングオプションのガイド

source: One of the advantages of the primitives is that they abstract away the circuit execution setup so that algorithm developers can focus on the pure algorithmic components. However, sometimes, to get the most out of an algorithm, you might want to tune certain primitive options. This section describes some of the common settings you might need.
es_un: Una de las ventajas de las primitivas es que abstraen la configuración de ejecución del circuito para que los desarrolladores de algoritmos puedan concentrarse en los componentes algorítmicos puros. Sin embargo, a veces, para aprovechar al máximo un algoritmo, es posible que desees ajustar ciertas opciones de las primitivas. Esta sección describe algunas de las configuraciones comunes que podrías necesitar.
ja: Primitive の利点の一つは、アルゴリズム開発者が純粋なアルゴリズムコンポーネントに集中できるように、回路実行の設定を抽象化することです。しかし、アルゴリズムを最大限に活用するために、特定のprimitiveのオプションを調整したい場合があります。このセクションでは、一般的に必要とされる設定について説明します。

source: This section focuses on Qiskit Runtime primitive :class:`.Options` (imported from ``qiskit_ibm_runtime``). While most of the `primitives` interface is common across implementations, most :class:`.Options` are not. Consult the corresponding API references for information about the |qiskit.primitives|_ and |qiskit_aer.primitives|_ options.
es_un: Esta sección se centra en la primitiva :class:`.Options` de Qiskit Runtime (importada de ``qiskit_ibm_runtime``). Si bien la mayor parte de la interfaz `primitives` es común en todas las implementaciones, la mayoría de las :class:`.Options` no lo son. Consulta las referencias de API correspondientes para obtener información sobre las opciones de las |qiskit.primitives|_ y |qiskit_aer.primitives|_.
ja: このセクションでは、Qiskit Runtime の Primitive :class:`.Options` （ ``qiskit_ibm_runtime`` からインポートする）に焦点を当てます。 `primitives` インターフェイスのほとんどは実装間で共通ですが、 :class:`.Options` のほとんどはそうではありません。 |qiskit.primitives|_ および |qiskit_aer.primitives|_ オプションに関する情報については、対応するAPIリファレンスを参照してください。

source: 1. Shots
es_un: 1. Iteraciones
ja: 1. ショット

source: For some algorithms, setting a specific number of shots is a core part of their routines. Previously, shots could be set during the call to `backend.run()`. For example, ``backend.run(shots=1024)``. Now, that setting is part of the execution options ("second level option"). This can be done during the primitive setup:
es_un: Para algunos algoritmos, establecer un número específico de iteraciones (shots) es una parte central de sus rutinas. Anteriormente, las iteraciones se podían establecer durante la llamada a `backend.run()`. Por ejemplo, ``backend.run(shots=1024)``. Ahora, esa configuración es parte de las opciones de ejecución ("opción de segundo nivel"). Esto se puede hacer durante la configuración de la primitiva:
ja: アルゴリズムによっては、特定のショット数を設定することがルーチンの中核をなすものがあります。以前は、 `backend.run()` を呼び出す際に shots を設定することができました。例えば、 ``backend.run(shots=1024)`` といった具合です。現在では、その設定は実行オプション（ "second level option" ）の一部となっています。これは、Primitive のセットアップ中に行うことができます：

source: If you need to modify the number of shots set between iterations (primitive calls), you can set the shots directly in the ``run()`` method. This overwrites the initial ``shots`` setting.
es_un: Si necesitas modificar el número de iteraciones (shots) establecidas entre repeticiones (llamadas a las primitivas), puedes configurar las iteraciones directamente en el método ``run()``. Esto sobrescribe la configuración inicial de ``shots``.
ja: 反復処理（プリミティブコール）の間に設定したショット数を変更する必要がある場合は、 ``run()`` メソッドで直接ショット数を設定することができます。これにより、最初の ``shots`` 設定が上書きされます。

source: For more information about the primitive options, refer to the `Options class API reference <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`_.
es_un: Para obtener más información sobre las opciones de las primitivas, consulta la `referencia de API de la clase Options <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`_.
ja: Primitive オプションの詳細については、 `OptionsクラスのAPIリファレンス <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`_ を参照してください。

source: 2. Transpilation
es_un: 2. Transpilación

source: By default, the Qiskit Runtime primitives perform circuit transpilation. There are several optimization levels you can choose from. These levels affect the transpilation strategy and might include additional error suppression mechanisms. Level 0 only involves basic transpilation. To learn about each optimization level, view the Optimization level table in the `Error suppression topic <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/locale/es_UN/how_to/error-suppression.html#setting-the-optimization-level>`_.
es_un: De forma predeterminada, las primitivas de Qiskit Runtime realizan la transpilación de circuitos. Hay varios niveles de optimización entre los que puedes elegir. Estos niveles afectan la estrategia de transpilación y pueden incluir mecanismos adicionales de supresión de errores. El nivel 0 solo implica la transpilación básica. Para obtener información sobre cada nivel de optimización, consulta la tabla de niveles de optimización en el tema de `Supresión de errores <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/locale/es_UN/how_to/error-suppression.html#setting-the-optimization-level>`_.

source: The optimization level option is a "first level option", and can be set as follows:
es_un: La opción de nivel de optimización es una "opción de primer nivel" y se puede configurar de la siguiente manera:
ja: 最適化レベルオプションは「第1レベルのオプション」であり、次のように設定することができます：

source: You might want to configure your transpilation strategy further, and for this, there are advanced transpilation options you can set up. These are "second level options", and can be set as follows:
es_un: Es posible que desees configurar aún más tu estrategia de transpilación y, para ello, existen opciones de transpilación avanzadas que puedes configurar. Estas son "opciones de segundo nivel" y se pueden configurar de la siguiente manera:
ja: トランスパイル戦略をさらに設定したい場合があります。そのために、高度なトランスパイルオプションを設定することができます。これは「セカンドレベルオプション」と呼ばれるもので、以下のように設定することができます：

source: For more information, and a complete list of advanced transpilation options, see the Advanced transpilation options table in the `Error supppression topic <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/locale/es_UN/how_to/error-suppression.html#advanced-transpilation-options>`_.
es_un: Para obtener más información y una lista completa de las opciones de transpilación avanzada, consulta la tabla de Opciones de transpilación avanzada en el tema `Supresión de errores <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/locale/es_UN/how_to/error-suppression.html#advanced-transpilation-options>`_.

source: Finally, you might want to specify settings that are not available through the primitives interface, or use custom transpiler passes. In these cases, you can set ``skip_transpilation=True`` to submit user-transpiled circuits. To learn how this is done, refer to the `Submitting user-transpiled circuits using primitives tutorial <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/user-transpiled-circuits.html>`_.
es_un: Finalmente, es posible que desees especificar configuraciones que no están disponibles a través de la interfaz de las primitivas, o usar pases de transpiladores personalizados. En estos casos, puedes establecer ``skip_transpilation=True`` para enviar circuitos transpilados por el usuario. Para saber cómo se hace esto, consulta el tutorial `Envío de circuitos transpilados por el usuario usando primitivas <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/user-transpiled-circuits.html>`_.
ja: 最後に、Primitive インターフェイスで利用できない設定を指定したり、カスタム・トランスパイラー・パスを使用したい場合があります。このような場合、 ``skip_transpilation=True`` を設定して、ユーザーがトランスパイルした回路を送信することができます。この方法については、 `Primitive を使用したユーザー・トランスパイル回路の送信のチュートリアル <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/user-transpiled-circuits.html>`_ を参照してください。

source: The ``skip_transpilation`` option is an advanced transpilation option, set as follows:
es_un: La opción ``skip_transpilation`` es una opción de transpilación avanzada, configurada de la siguiente manera:
ja: ``skip_transpilation`` オプションは、高度なトランスパイルオプションであり、以下のように設定します：

source: 3. Error mitigation
es_un: 3. Mitigación de errores
ja: 3. エラー緩和

source: You might want to leverage different error mitigation methods and see how these affect the performance of your algorithm. These can also be set through the ``resilience_level`` option. The method selected for each level is different for ``Sampler`` and ``Estimator``. You can find more information in the `Configure error mitigation topic <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/error-mitigation.html>`_.
es_un: Es posible que desees aprovechar diferentes métodos de mitigación de errores y ver cómo estos afectan el rendimiento de tu algoritmo. Estos también se pueden configurar a través de la opción ``resilience_level``. El método seleccionado para cada nivel es diferente para ``Sampler`` y ``Estimator``. Puedes encontrar más información en el tema `Configurar mitigación de errores <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/error-mitigation.html>`_.

source: The configuration is similar to the other options:
es_un: La configuración es similar a las otras opciones:
ja: 設定方法は、他のオプションと同様です：

source: By default, the Qiskit Runtime primitives perform circuit transpilation. There are several optimization levels you can choose from. These levels affect the transpilation strategy and might include additional error suppression mechanisms. Level 0 only involves basic transpilation. To learn about each optimization level, view the Optimization level table in the `Error suppression topic <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/error-suppression.html#setting-the-optimization-level>`__.
ja: デフォルトでは、 Qiskit Runtime primitive は回路のトランスパイルを実行します。最適化レベルはいくつかあり、選択することができます。これらのレベルはトランスパイルの戦略に影響し、追加のエラー抑制メカニズムを含むかもしれません。レベル0は、基本的なトランスパイルのみを行います。各最適化レベルについては、 `エラー抑制のトピック <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/error-suppression.html#setting-the-optimization-level>`__ にある最適化レベルのテーブルを参照してください。

source: For more information, and a complete list of advanced transpilation options, see the Advanced transpilation options table in the `Error suppression topic <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/error-suppression.html#advanced-transpilation-options>`__.
ja: 詳細と高度なトランスパイルオプションの完全なリストについては、`エラー抑制トピック <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/error-suppression.html#advanced-transpilation-options>`__ の高度なトランスパイルオプションのテーブルを参照してください。

source: You might want to use different error mitigation methods and see how these affect the performance of your algorithm. These can also be set through the ``resilience_level`` option. The method selected for each level is different for ``Sampler`` and ``Estimator``. You can find more information in the `Configure error mitigation topic <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/error-mitigation.html>`_.
ja: さまざまなエラー緩和方法を活用し、アルゴリズムの性能にどのような影響を与えるかを確認したい場合があります。これらは ``resilience_level`` オプションで設定することも可能です。各レベルで選択される方法は、 ``Sampler`` と``Estimator`` で異なります。詳細は、 `Error mitigation optionの設定のトピック <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/error-mitigation.html>`_ に記載されています。
