Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/migration/0.5_a_intro.po
Languages: es_un, ja, ta

source: This page was generated from `docs/migration/0.5_a_intro.ipynb`__.
es_un: Esta página fue generada a partir de `docs/migration/0.5_a_intro.ipynb`__.
ja: このページは `docs/migration/0.5_a_intro.ipynb`__ から生成されました。
ta: இந்தப் பக்கம் `docs/migration/0.5_a_intro.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Qiskit Nature v0.5 Migration Guide
es_un: Guía de Migración de Qiskit Nature v0.5
ja: Qiskit Nature v0.5 移行ガイド
ta: கிஸ்கிட் நேச்சர் v0.5 இடம்பெயர்வு வழிகாட்டி

source: This tutorial will guide you through the process of migrating your code from Qiskit Nature v0.4 to v0.5
es_un: Este tutorial te guiará a través del proceso de migración de tu código de Qiskit Nature v0.4 a v0.5
ja: このチュートリアルでは、コードを Qiskit Nature v0.4 から v0.5 へマイグレーションするプロセスをガイドします。
ta: உங்கள் குறியீட்டை Qiskit Nature v0.4 இலிருந்து v0.5க்கு மாற்றும் செயல்முறையின் மூலம் இந்தப் பயிற்சி உங்களுக்கு வழிகாட்டும்

source: Overview
es_un: Descripción General
ja: 概要
ta: கண்ணோட்டம்

source: Let us begin with an overview of the refactored design. A major motivator for the refactoring of Qiskit Nature was the goal of readying Qiskit Nature for more and tighter integrations with other classical-computational codes. In order to achieve this in the most modular and maintainable manner, we had to decouple the representation of our ``BaseProblem`` from our ``BaseDriver`` classes.
es_un: Comencemos con una descripción general del diseño refactorizado. Un motivador importante para la refactorización de Qiskit Nature fue el objetivo de preparar a Qiskit Nature para más y más estrechas integraciones con otros códigos computacionales clásicos. Para lograr esto de la manera más modular y mantenible, tuvimos que desacoplar la representación de nuestro ``BaseProblem`` de nuestras clases ``BaseDriver``.
ja: まず、リファクタリングされた設計の概要について説明します。 Qiskit Natureのリファクタリングの主要な動機は、 Qiskit Natureを他の古典的な計算コードとより厳密に統合するために準備することでした。最もモジュラー的でかつ保守性の高い方法でこれを実現するには、``BaseDriver`` クラスから ``BaseProblem`` という表現を切り離す必要がありました。
ta: மறுசீரமைக்கப்பட்ட வடிவமைப்பின் கண்ணோட்டத்துடன் தொடங்குவோம். கிஸ்கிட் நேச்சரை மறுசீரமைப்பதற்கான ஒரு முக்கிய உந்துதலாக கிஸ்கிட் நேச்சரை மற்ற கிளாசிக்கல்-கணிப்பீட்டுக் குறியீடுகளுடன் மேலும் இறுக்கமான ஒருங்கிணைப்புகளுக்குத் தயார்படுத்துவதாகும். இதை மிகவும் மட்டு மற்றும் பராமரிக்கக்கூடிய முறையில் அடைய, எங்கள் ``BaseDriver`` வகுப்புகளிலிருந்து எங்கள் ``BaseProblem`` பிரதிநிதித்துவத்தை துண்டிக்க வேண்டும்.

source: This led to the following abstract design of the Qiskit Nature package: |Qiskit Nature 0.5|
es_un: Esto condujo al siguiente diseño abstracto del paquete Qiskit Nature: |Qiskit Nature 0.5|
ja: これにより、 Qiskit ネイチャー・パッケージの抽象的な設計は以下のようになりました： |Qiskit Nature 0.5|
ta: இது கிஸ்கிட் இயல்பு தொகுப்பின் பின்வரும் சுருக்க வடிவமைப்பிற்கு வழிவகுத்தது: |Qiskit Nature 0.5|

source: As you can see, the package is logically divided into two concepts:
es_un: Como puedes ver, el paquete se divide lógicamente en dos conceptos:
ja: ご覧のとおり、パッケージは論理的に2つの概念に分かれています：
ta: எனவே, தொகுப்பு தர்க்கரீதியாக இரண்டு கருத்துகளாகப் பிரிக்கப்பட்டுள்ளது:

source: **problems**: which are representations of scientific problems to which one seeks a solution
es_un: **problemas**: los cuales son representaciones de problemas científicos a los que uno busca una solución
ja: **問題**: 解を求める科学的な問題の表現
ta: **problems**: இவை அறிவியல் சிக்கல்களின் பிரதிநிதித்துவம் ஆகும், அதற்கு ஒருவர் தீர்வு தேடுகிறார்

source: **algorithms**: which provide the means to find solutions to said problems
es_un: **algoritmos**: lo cuales proporcionan los medios para encontrar soluciones a dichos problemas
ja: **アルゴリズム**: この問題に対する解決策を見つける手段を提供する
ta: **algorithms**: இது கூறப்பட்ட பிரச்சனைகளுக்குத் தீர்வு காண வழிகளை வழங்குகிறது

source: In each of these cases, Qiskit Nature has three pillars:
es_un: En cada uno de estos casos, Qiskit Nature tiene tres pilares:
ja: それぞれの場合に、Qiskit Natureには以下の3本の柱があります:
ta: இந்த ஒவ்வொரு சந்தர்ப்பத்திலும், கிஸ்கிட் இயற்கை மூன்று தூண்களைக் கொண்டுள்ளது:

source: **problems**:
es_un: **problemas**:
ja: **問題**:

source: *Electronic Structure Problem*: representing the problem of the electronic Schrödinger equation of molecular systems
es_un: *Problema de Estructura Electrónica*: representa el problema de la ecuación electrónica de Schrödinger de sistemas moleculares
ja: *電子構造の問題*: 分子系の電子のシュレーディンガー方程式の問題を表す
ta: *Electronic Structure Problem*: மூலக்கூறு அமைப்புகளின் மின்னணு ஷ்ரோடிங்கர் சமன்பாட்டின் சிக்கலைக் குறிக்கிறது

source: *Vibrational Structure Problem*: representing the problem posed by the Watson Hamiltonian of molecular systems
es_un: *Problema de Estructura Vibracional*: representando el problema planteado por el Hamiltoniano de Watson de los sistemas moleculares
ja: *振動構造問題*: 分子系のワトソン・ハミルトニアンによって引き起こされる問題を表す
ta: *Vibrational Structure Problem*: மூலக்கூறு அமைப்புகளின் வாட்சன் ஹாமில்டோனியனால் முன்வைக்கப்பட்ட சிக்கலைக் குறிக்கிறது

source: *Lattice Model Problem*: representing problems defined on lattices
es_un: *Problema del Modelo de Retícula*: representación de problemas definidos en retículas
ja: *格子モデル問題*: 格子で定義された問題を表す
ta: *Lattice Model Problem*: லட்டீஸ் வரையறுக்கப்பட்ட சிக்கல்களைக் குறிக்கிறது

source: **algorithms**:
es_un: **algoritmos**:
ja: **アルゴリズム**

source: *Ground State Solver*: for finding the ground state of a problem
es_un: *Solucionador de Estado Fundamental*: para encontrar el estado fundamental de un problema
ja: *基底状態ソルバー*：問題の基底状態を見つける
ta: *Ground State Solver*: ஒரு பிரச்சனையின் அடிப்படை நிலையைக் கண்டறிவதற்காக

source: *Excited States Solver*: for finding excited states of a problem
es_un: *Solucionador de Estados Excitados*: para encontrar estados excitados de un problema
ja: *励起状態ソルバー*: 問題の励起状態を見つける
ta: *Excited States Solver*: ஒரு பிரச்சனையின் உற்சாகமான நிலைகளைக் கண்டறிவதற்காக

source: *Hamiltonian Simulation*: to simulate dynamics of a problem (*planned for v0.6*)
es_un: *Simulación Hamiltoniana*: para simular la dinámica de un problema (*planeado para v0.6*)
ja: *ハミルトニアン・シミュレーション*: 問題のダイナミクスをシミュレートする (*v0.6 で計画されています*)
ta: *Hamiltonian Simulation*: ஒரு சிக்கலின் இயக்கவியலை உருவகப்படுத்த (*planned for v0.6*)

source: Some of these concepts have already been present in earlier versions of Qiskit Nature, but were not as clearly separated. Furthermore, the integration with classical codes has been very restrictive in older versions, limiting not only the potential applications of such integrations, but also the capabilities of our ``BaseProblem`` representation, and its usage in the remainder of the package.
es_un: Algunos de estos conceptos ya estaban presentes en versiones anteriores de Qiskit Nature, pero no estaban tan claramente separados. Además, la integración con códigos clásicos ha sido muy restrictiva en versiones anteriores, limitando no solo las aplicaciones potenciales de dichas integraciones, sino también las capacidades de nuestra representación ``BaseProblem`` y su uso en el resto del paquete.
ja: これらのコンセプトのいくつかは、Qiskit Natureの以前のバージョンでもすでに存在していましたが、それほど明確に分離されてはいませんでした。さらに、古いバージョンでは古典的なコードとの統合が非常に制限されており、そのような統合の潜在的なアプリケーションだけでなく、我々の ``BaseProblem`` 表現の能力や、パッケージの残りの部分でのその使用法も制限されています。
ta: இவற்றில் சில கருத்துக்கள் கிஸ்கிட் நேச்சரின் முந்தைய பதிப்புகளில் ஏற்கனவே உள்ளன, ஆனால் அவை தெளிவாகப் பிரிக்கப்படவில்லை. மேலும், பழைய பதிப்புகளில் கிளாசிக்கல் குறியீடுகளுடனான ஒருங்கிணைப்பு மிகவும் கட்டுப்படுத்தப்பட்டுள்ளது, இது போன்ற ஒருங்கிணைப்புகளின் சாத்தியமான பயன்பாடுகள் மட்டுமின்றி, எங்களின் ``BaseProblem`` பிரதிநிதித்துவத்தின் திறன்கள் மற்றும் தொகுப்பின் எஞ்சிய பகுதிகளில் அதன் பயன்பாடு ஆகியவற்றைக் கட்டுப்படுத்துகிறது.

source: How to use this guide
es_un: Cómo usar esta guía
ja: このガイドの使い方
ta: இந்த வழிகாட்டியை எவ்வாறு பயன்படுத்துவது

source: This guide is split across multiple files allowing you to discover the changes between v0.4 and v0.5 to each submodule as you find the need. That means, you do not need to read all of the details at once and jumping around is highly encouraged.
es_un: Esta guía se divide en varios archivos, lo que te permiten descubrir los cambios entre v0.4 y v0.5 en cada submódulo a medida que encuentres la necesidad. Eso significa que no necesitas leer todos los detalles a la vez y se recomienda encarecidamente saltarse los innecesarios.
ja: このガイドは複数のファイルに分かれており、v0.4 と v0.5 の間の各サブモジュールの変更点を、必要なときに確認することができます。つまり、一度にすべての詳細を読む必要はなく、あちこちに飛ぶことを強く推奨します。
ta: இந்த வழிகாட்டி பல கோப்புகளில் பிரிக்கப்பட்டுள்ளது, இதன் மூலம் ஒவ்வொரு துணைத் தொகுதிக்கும் v0.4 மற்றும் v0.5 ஆகியவற்றுக்கு இடையேயான மாற்றங்களை நீங்கள் கண்டறிவதன் மூலம் நீங்கள் தேவைப்படுகிறீர்கள். அதாவது, நீங்கள் அனைத்து விவரங்களையும் ஒரே நேரத்தில் படிக்கத் தேவையில்லை, மேலும் குதிப்பது மிகவும் ஊக்குவிக்கப்படுகிறது.

source: Generally speaking the refactoring largely relocated any code from ``qiskit_nature.X.second_quantization`` to ``qiskit_nature.second_q.X``. This should help you navigate the source code for most cases. However, in some specific cases we have re-categorized specific modules/classes, so be advised to look into the guides for more details below.
es_un: En términos generales, la refactorización reubicó en gran medida cualquier código de ``qiskit_nature.X.second_quantization`` a ``qiskit_nature.second_q.X``. Esto debería ayudarte a navegar por el código fuente en la mayoría de los casos. Sin embargo, en algunos casos específicos, hemos recategorizado módulos/clases específicos, por lo que te recomendamos que consultes las guías para obtener más detalles a continuación.
ja: 一般的には、リファクタリングによって ``qiskit_nature.X.second_quantization`` から ``qiskit_nature.second_q.X`` へとコードが大きく再配置されました。これは、ほとんどの場合において、ソースコードをナビゲートするのに役立つはずです。しかし、いくつかのケースでは、特定のモジュールやクラスを再分類しているので、詳細については以下のガイドを参照してください。
ta: பொதுவாக மறுசீரமைப்பு எந்தக் குறியீட்டையும் ``qiskit_nature.X.second_quantization`` இலிருந்து ``qiskit_nature.second_q.X``க்கு இடமாற்றம் செய்தது. பெரும்பாலான சந்தர்ப்பங்களில் மூலக் குறியீட்டை வழிசெலுத்த இது உங்களுக்கு உதவும். இருப்பினும், சில குறிப்பிட்ட சந்தர்ப்பங்களில் குறிப்பிட்ட தொகுதிகள்/வகுப்புகளை நாங்கள் மீண்டும் வகைப்படுத்தியுள்ளோம், எனவே கீழே உள்ள மேலும் விவரங்களுக்கு வழிகாட்டிகளைப் பார்க்குமாறு அறிவுறுத்தப்படுகிறோம்.

source: To understand what files you need to pay attention to, please carefully review the following list of topics:
es_un: Para comprender a qué archivos debes prestar atención, revisa detenidamente la siguiente lista de temas:
ja: どのようなファイルに注意を払う必要があるのかを理解するために、以下のトピックのリストをよく確認してください：
ta: நீங்கள் கவனம் செலுத்த வேண்டிய கோப்புகளைப் புரிந்து கொள்ள, பின்வரும் தலைப்புகளின் பட்டியலைக் கவனமாக மதிப்பாய்வு செய்யவும்:

source: `Solving any problem <./0.5_b_solving_problems.ipynb>`__
es_un: `Resolver cualquier problema <./0.5_b_solving_problems.ipynb>`__
ja: `あらゆる問題を解決する <./0.5_b_solving_problems.ipynb>`__

source: `Electronic Structure Problems <./0.5_c_electronic_structure.ipynb>`__
es_un: `Problemas de Estructura Electrónica <./0.5_c_electronic_structure.ipynb>`__
ja: `電子構造の問題 <./0.5_c_electronic_structure.ipynb>`__

source: `Vibrational Structure Problems <./0.5_d_vibrational_structure.ipynb>`__
es_un: `Problemas de Estructura Vibracional <./0.5_d_vibrational_structure.ipynb>`__
ja: `振動構造の問題 <./0.5_d_vibrational_structure.ipynb>`__

source: `Lattice Model Problems <./0.5_e_lattice_models.ipynb>`__
es_un: `Problemas del Modelo de Retícula <./0.5_e_lattice_models.ipynb>`__
ja: `格子モデル問題 <./0.5_e_lattice_models.ipynb>`__

source: `Protein Folding <./0.5_f_protein_folding.ipynb>`__
es_un: `Plegamiento de Proteínas <./0.5_f_protein_folding.ipynb>`__
ja: `タンパク質の折り畳み <./0.5_f_protein_folding.ipynb>`__

source: Some important general notes
es_un: Algunas notas generales importantes
ja: 重要な一般的な注意事項
ta: சில முக்கியமான பொது குறிப்புகள்

source: Too many positional arguments
es_un: Demasiados argumentos posicionales
ja: 多すぎる位置指定引数について
ta: பல நிலை வாதங்கள்

source: With Qiskit Nature v0.5 we have started to require certain arguments in the public API to be **keyword-only** arguments. This change was motivated by the following advantages:
es_un: Con Qiskit Nature v0.5, comenzamos a requerir que ciertos argumentos en la API pública sean argumentos **solo de palabras clave**. Este cambio estuvo motivado por las siguientes ventajas:
ja: Qiskit Nature v0.5では、公開APIの特定の引数を **キーワード専用** の引数にすることを義務付けるようになりました。この変更は、以下の利点が動機となっています。
ta: Qiskit Nature v0.5 உடன், பொது API இல் சில வாதங்கள் **keyword-only** வாதங்களாக இருக்க வேண்டும். இந்த மாற்றம் பின்வரும் நன்மைகளால் தூண்டப்பட்டது:

source: improved readability: in the example given below, it is immediately clear what a given argument does
es_un: legibilidad mejorada: en el ejemplo dado a continuación, queda inmediatamente claro lo que hace un argumento dado
ja: 可読性の向上: 以下の例では、与えられた引数が何をするのかがすぐにわかります。
ta: மேம்படுத்தப்பட்ட வாசிப்புத்திறன்: கீழே கொடுக்கப்பட்டுள்ள எடுத்துக்காட்டில், கொடுக்கப்பட்ட வாதம் என்ன செய்கிறது என்பது உடனடியாகத் தெளிவாகிறது

source: improved forwards compatibility: adding more arguments in the future will be a lot simpler because keyword arguments are not order-dependent
es_un: compatibilidad hacia adelante mejorada: agregar más argumentos en el futuro será mucho más simple porque los argumentos de palabras clave no dependen del orden
ja: 前方互換性の向上: キーワード引数は順序に依存しないため、将来的に引数を追加することが非常に簡単になります。
ta: மேம்படுத்தப்பட்ட முன்னோக்கு இணக்கத்தன்மை: எதிர்காலத்தில் கூடுதல் வாதங்களைச் சேர்ப்பது மிகவும் எளிமையானதாக இருக்கும், ஏனெனில் முக்கிய வாதங்கள் வரிசையைச் சார்ந்து இல்லை

source: That means, even if you only need to update the import path during your migration process, you may run into errors like the following:
es_un: Eso significa que, incluso si solo necesitas actualizar la ruta de importación durante tu proceso de migración, puedes encontrar errores como los siguientes:
ja: つまり、移行作業中にインポートパスを更新するだけであっても、以下のようなエラーに遭遇する可能性があるということです：
ta: அதாவது, உங்கள் இடம்பெயர்வு செயல்பாட்டின்போது நீங்கள் இறக்குமதி பாதையை மட்டும் புதுப்பிக்க வேண்டும் என்றால், பின்வருபவை போன்ற பிழைகளை நீங்கள் சந்திக்கலாம்:

source: Previously
es_un: Previamente
ja: 以前
ta: முன்பு

source: Now we update the import path to the new location and obtain an error:
es_un: Ahora actualizamos la ruta de importación a la nueva ubicación y obtenemos un error:
ja: ここで、インポートパスを新しい場所に更新すると、エラーが発生します：
ta: இப்போது இறக்குமதி பாதையைப் புதிய இடத்திற்கு புதுப்பித்துப் பிழையைப் பெறுகிறோம்:

source: If this happens to you, we suggest that you simply check the documentation of the class which you are trying to use. It is very likely that only need to change from using an argument *positionally* to using it with a **keyword**. For example like so:
es_un: Si esto te sucede, te sugerimos que simplemente consultes la documentación de la clase que estás tratando de usar. Es muy probable que solo sea necesario cambiar de usar un argumento *posicionalmente* a usarlo con una **palabra clave**. Por ejemplo así:
ja: このような場合は、使用しようとしているクラスのドキュメントを確認することをお勧めします。それは、引数を *位置的* な使用から、キーワードでの使用に変更する必要がある可能性が非常に高いです。例えば、以下のような感じです：
ta: இது உங்களுக்கு நேர்ந்தால், நீங்கள் பயன்படுத்த முயற்சிக்கும் வகுப்பின் ஆவணங்களைச் சரிபார்க்குமாறு பரிந்துரைக்கிறோம். ஒரு வாதத்தை *positionally* பயன்படுத்துவதிலிருந்து **keyword** உடன் பயன்படுத்துவதற்கு மட்டுமே இது மாற வேண்டும். உதாரணமாக இது போன்றது:

source: New
es_un: Nuevo
ja: 新規
ta: புதியது

source: Unexpected number of orbitals or qubits
es_un: Número inesperado de orbitales o qubits
ja: 予期しない軌道または量子ビットの数
ta: எதிர்பாராத எண்ணிக்கையிலான சுற்றுப்பாதைகள் அல்லது குபிட்கள்

source: With Qiskit Nature v0.5 we have switched the entire stack over from using ``num_spin_orbitals`` to instead use ``num_spatial_orbitals``. The motivation behind this, was that the behavior when specifying an odd number of spin orbitals was ill-defined and not guarded against, potentially causing surprising results. By switching to the number of spatial orbitals (which then get multiplied by 2 to yield the total number of spin orbitals), this problem can no longer arise.
es_un: Con Qiskit Nature v0.5, hemos cambiado toda la pila de usar ``num_spin_orbitals`` a usar ``num_spatial_orbitals``. La motivación detrás de esto fue que el comportamiento al especificar un número impar de orbitales de espín estaba mal definido y no estaba protegido, lo que podría causar resultados sorpresivos. Al cambiar a la cantidad de orbitales espaciales (que luego se multiplican por 2 para obtener la cantidad total de orbitales de espín), este problema ya no puede surgir.
ja: Qiskit Nature v0.5では、スタック全体を ``num_spin_orbitals`` の使用から ``num_spatial_orbitals`` の使用へと変更しました。この背景には、奇数のスピン軌道を指定した場合の動作が未定義であり、ガードされていないため、驚くべき結果を引き起こす可能性があるということがあります。空間軌道の数に切り替えることで、 (スピン軌道の合計数を得るために2倍される) この問題はもはや発生することはありません。
ta: Qiskit Nature v0.5 மூலம், ``num_spin_orbitals`` ஐப் பயன்படுத்துவதற்குப் பதிலாக ``num_spatial_orbitals`` ஐப் பயன்படுத்துவதற்கு முழு அடுக்கையும் மாற்றியுள்ளோம். இதற்குப் பின்னால் உள்ள உந்துதல் என்னவென்றால், ஒற்றைப்படை எண்ணிக்கையிலான சுழல் சுற்றுப்பாதைகளைக் குறிப்பிடும் போது நடத்தை தவறாக வரையறுக்கப்பட்டது மற்றும் பாதுகாக்கப்படவில்லை, இது ஆச்சரியமான முடிவுகளை ஏற்படுத்தும். இடஞ்சார்ந்த சுற்றுப்பாதைகளின் எண்ணிக்கைக்கு மாறுவதன் மூலம் (பின்னர் இது 2 ஆல் பெருக்கினால் மொத்த சுழல் சுற்றுப்பாதைகளின் எண்ணிக்கை கிடைக்கும்), இந்தப் பிரச்சனை இனி எழாது.

source: So if you do encounter some unexpected number of orbitals and/or qubits in your results, be sure to check whether you need to update your input. For example like shown below:
es_un: Entonces, si encuentras una cantidad inesperada de orbitales y/o qubits en tus resultados, asegúrate de verificar si necesitas actualizar tu entrada. Por ejemplo, como se muestra a continuación:
ja: もし、予期しない軌道や量子ビットの数に遭遇した場合、入力を更新する必要があるかどうか確認してください。例えば、以下のような場合です：
ta: உங்கள் முடிவுகளில் எதிர்பாராத எண்ணிக்கையிலான சுற்றுப்பாதைகள் மற்றும்/அல்லது குவிட்களை நீங்கள் சந்தித்தால், உங்கள் உள்ளீட்டைப் புதுப்பிக்க வேண்டுமா என்பதைச் சரிபார்க்கவும். உதாரணமாகக் கீழே காட்டப்பட்டுள்ளதைப் போல:

source: Qiskit Nature 0.5
ta: கிஸ்கிட் நேச்சர் 0.5
