Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/migration/0.5_b_solving_problems.po
Languages: ta

source: Solving Problems with v0.5
ta: v0.5 உடன் சிக்கல்களைத் தீர்ப்பது

source: Overview
ta: கண்ணோட்டம்

source: Further Resources
ta: மேலும் வளங்கள்

source: For more details, please refer to the corresponding tutorials:
ta: மேலும் விவரங்களுக்கு, தொடர்புடைய பயிற்சிகளைப் பார்க்கவும்:

source: This module contained a single component: ``QubitConverter``. This has been moved to ``qiskit_nature.second_q.mappers.QubitConverter`` so you can simply update your import path.
ta: இந்தத் தொகுதியில் ஒரு கூறு உள்ளது: ``QubitConverter``. இது ``qiskit_nature.second_q.mappers.QubitConverter`` க்கு நகர்த்தப்பட்டது, எனவே உங்கள் இறக்குமதி பாதையை நீங்கள் எளிமையாகப் புதுப்பிக்கலாம்.

source: API changes were again minimal but the operators being translated by this class are no longer the legacy ``SecondQuantizedOp`` but rather the new ``SparseLabelOp`` objects.
ta: ஏபிஐ மாற்றங்கள் மீண்டும் குறைவாகவே இருந்தன, ஆனால் இந்த வகுப்பால் மொழிபெயர்க்கப்படும் ஆபரேட்டர்கள் இனி ``SecondQuantizedOp`` அல்ல, மாறாகப் புதிய ``SparseLabelOp`` ஆப்ஜெக்ட்கள்.

source: The entire ``qiskit_nature.circuit`` module was relocated to ``qiskit_nature.second_q.circuit``. The reason for this, is that the existing circuit were actually only applicable to second-quantized applications, but the API did not reflect this. Updating your imports should fix *most* issues.
ta: முழு ``qiskit_nature.circuit`` தொகுதியும் ``qiskit_nature.second_q.circuit``க்கு இடமாற்றம் செய்யப்பட்டது. இதற்குக் காரணம், தற்போதுள்ள சர்க்யூட் உண்மையில் இரண்டாவது அளவுள்ள பயன்பாடுகளுக்கு மட்டுமே பொருந்தும், ஆனால் API இதைப் பிரதிபலிக்கவில்லை. உங்கள் இறக்குமதிகளைப் புதுப்பிப்பதன் மூலம் *பெரும்பாலான* சிக்கல்களைச் சரிசெய்ய வேண்டும்.

source: However, there are two more details to take note of, detailed below.
ta: இருப்பினும், கவனத்தில் கொள்ள இன்னும் இரண்டு விவரங்கள் உள்ளன, கீழே விவரிக்கப்பட்டுள்ளன.

source: Number of Orbitals
ta: சுற்றுப்பாதைகளின் எண்ணிக்கை

source: We have been consistently describing the number of orbitals via ``num_spin_orbitals`` throughout the package. However, what this oftentimes implied (without rigorous checks) was that an **even** number was supplied, since the number of spin orbitals was assumed to equal twice the number of **spatial** orbitals.
ta: தொகுப்பு முழுவதும் ``num_spin_orbitals`` வழியாக சுற்றுப்பாதைகளின் எண்ணிக்கையை நாங்கள் தொடர்ந்து விவரித்து வருகிறோம். இருப்பினும், இது அடிக்கடி குறிப்பிடுவது (கடுமையான சோதனைகள் இல்லாமல்) ஒரு **சமமான** எண் வழங்கப்பட்டது, ஏனெனில் சுழல் சுற்றுப்பாதைகளின் எண்ணிக்கையானது **இடஞ்சார்ந்த** சுற்றுப்பாதைகளின் எண்ணிக்கையை விட இரண்டு மடங்கு சமமாக கருதப்படுகிறது.

source: To be more rigorous and avoid the ill-defined behavior when providing *odd* numbers for ``num_spin_orbitals``, we have switched the entire stack to use ``num_spatial_orbitals`` instead. This is well defined for any positive integer value (and negative values are guarded against).
ta: ``num_spin_orbitals`` க்கு *ஒற்றைப்படை* எண்களை வழங்கும்போது மிகவும் கடுமையாகவும், தவறாக வரையறுக்கப்பட்ட நடத்தையைத் தவிர்க்கவும், அதற்குப் பதிலாக ``num_spin_orbitals`` என்பதைப் பயன்படுத்த முழு அடுக்கையும் மாற்றியுள்ளோம். எந்த நேர்மறை முழு மதிப்புக்கும் இது நன்கு வரையறுக்கப்படுகிறது (மற்றும் எதிர்மறை மதிப்புகள் பாதுகாக்கப்படும்).

source: What this means for you in practice, is that whenever you supply the ``num_spin_orbitals`` manually in the past, you now need to supply **half the value** to represent the ``num_spatial_orbitals``.
ta: நடைமுறையில் இது உங்களுக்கு என்ன அர்த்தம் என்றால், கடந்த காலத்தில் நீங்கள் ``num_spin_orbitals`` ஐ கைமுறையாக வழங்கும்போது, ​​இப்போது ``num_spatial_orbitals`` ஐக் குறிக்க **பாதி மதிப்பை** வழங்க வேண்டும்.

source: Previously
ta: முன்பு

source: New
ta: புதியது

source: UCC/UVCC ``__init__`` arguments
ta: UCC/UVCC ``__init__`` வாதங்கள்

source: The ``UCC`` and ``UVCC`` subclasses used to take the following arguments for their ``__init__``:
ta: ``UCC` மற்றும் ``UVCC`` துணைப்பிரிவுகள் அவற்றின் ``__init__``க்கு பின்வரும் வாதங்களை எடுக்கப் பயன்படுத்தப்படுகின்றன:

source: This was mismatching the API of the ``HartreeFock`` and ``VSCF`` initial states. We have aligned these APIs to look like in the following:
ta: இது ``HartreeFock`` மற்றும் ``VSCF`` ஆரம்ப நிலைகளின் API உடன் பொருந்தவில்லை. இந்த APIகளை பின்வருவனவற்றைப் போல் சீரமைத்துள்ளோம்:

source: HartreeFock/VSCF initial states
ta: HartreeFock/VSCF ஆரம்ப நிலைகள்

source: The ``HartreeFock`` and ``VSCF`` initial state circuits are now implemented as ``BlueprintCircuit``. That means, that you can initialize them without any arguments and supply the information later as shown below:
ta: ``HartreeFock`` மற்றும் ``VSCF`` ஆரம்ப நிலை சுற்றுகள் இப்போது ``BlueprintCircuit`` ஆகச் செயல்படுத்தப்படுகின்றன. அதாவது, நீங்கள் எந்த வாதங்களும் இல்லாமல் அவற்றைத் தொடங்கலாம் மற்றும் கீழே காட்டப்பட்டுள்ளபடி தகவலைப் பின்னர் வழங்கலாம்:

source: The algorithms in Qiskit Nature have been updated to use the new ``qiskit.algorithms`` components which are based on the ``qiskit.primitives`` as of Qiskit Terra 0.22.
ta: Qiskit Nature இல் உள்ள அல்காரிதம்கள் புதிய ``qiskit.algorithms`` கூறுகளைப் பயன்படுத்த மேம்படுத்தப்பட்டுள்ளன, அவை Qiskit Terra 0.22 இன் படி ``qiskit.primitives`` அடிப்படையிலானது.

source: For most changes to take effect, you can once again simply update your import paths from ``qiskit_nature.algorithms`` to ``qiskit_nature.second_q.algorithms``. However, there are some details which you need to pay attention to, due to the change to the primitive-based algorithms of Qiskit Terra being used under the hood. These details are explained below.
ta: பெரும்பாலான மாற்றங்கள் நடைமுறைக்கு வர, நீங்கள் மீண்டும் உங்கள் இறக்குமதி பாதைகளை ``qiskit_nature.algorithms`` இலிருந்து ``qiskit_nature.second_q.algorithms`` க்கு புதுப்பிக்கலாம். இருப்பினும், ஹூட்டின் கீழ் பயன்படுத்தப்படும் கிஸ்கிட் டெர்ராவின் பழமையான அடிப்படையிலான அல்காரிதங்களில் நீங்கள் கவனம் செலுத்த வேண்டிய சில விவரங்கள் உள்ளன. இந்த விவரங்கள் கீழே விளக்கப்பட்டுள்ளன.

source: This module was moved to ``qiskit_nature.second_q.algorithms.initial_points``. All you need to do is update your imports.
ta: இந்தத் தொகுதி ``qiskit_nature.second_q.algorithms.initial_points``க்கு நகர்த்தப்பட்டது. நீங்கள் செய்ய வேண்டியது எல்லாம் உங்கள் இறக்குமதிகளைப் புதுப்பிக்க வேண்டும்.

source: This module was **removed** without a replacement. The reason for that, is that we are working towards a driver-less design of Qiskit Nature, in which case the sampling of the potential energy surface becomes the responsibility of the classical code rather than Qiskit Nature.
ta: இந்தத் தொகுதி மாற்று இல்லாமல் **அகற்றப்பட்டது**. அதற்கான காரணம், கிஸ்கிட் நேச்சரின் டிரைவர்-குறைவான வடிவமைப்பை நோக்கி நாங்கள் பணியாற்றி வருகிறோம், இதில் சாத்தியமான ஆற்றல் மேற்பரப்பின் மாதிரியானது கிஸ்கிட் நேச்சரை விடக் கிளாசிக்கல் குறியீட்டின் பொறுப்பாகிறது.

source: This module was moved to ``qiskit_nature.second_q.algorithms.ground_state_solvers``. Besides updating your imports, you need to pay attention to the following:
ta: இந்தத் தொகுதி ``qiskit_nature.second_q.algorithms.ground_state_solvers``க்கு நகர்த்தப்பட்டது. உங்கள் இறக்குமதிகளைப் புதுப்பிப்பதைத் தவிர, பின்வருவனவற்றில் நீங்கள் கவனம் செலுத்த வேண்டும்:

source: This module was moved to ``qiskit_nature.second_q.algorithms.excited_states_solvers``. Besides updating your imports, you need to pay attention to the following:
ta: இந்தத் தொகுதி ``qiskit_nature.second_q.algorithms.excited_states_solvers``க்கு நகர்த்தப்பட்டது. உங்கள் இறக்குமதிகளைப் புதுப்பிப்பதைத் தவிர, பின்வருவனவற்றில் நீங்கள் கவனம் செலுத்த வேண்டும்:
