Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/migration/0.6_b_mes_factory.po
Languages: es_un, ja, te

source: The (Minimum)EigensolverFactory Migration Guide
es_un: La Guía de Migración de (Minimum)EigensolverFactory
ja: (最小) EigensolverFactory マイグレーション・ガイド
te: `(Minimum)EigensolverFactory మైగ్రేషన్ గైడ్`_

source: All the factory classes which could be used to construct :class:`~qiskit.algorithms.minimum_eigensolvers.MinimumEigensolver` or :class:`~qiskit.algorithms.eigensolvers.Eigensolver` objects have been deprecated as part of version 0.6 of Qiskit Nature.
es_un: Todas las clases de fábrica que podrían usarse para construir objetos :class:`~qiskit.algorithms.minimum_eigensolvers.MinimumEigensolver` o :class:`~qiskit.algorithms.eigensolvers.Eigensolver` han quedado obsoletas como parte de la versión 0.6 de Qiskit Nature.
ja: :class:`~qiskit.algorithms.minimum_eigensolvers.MinimumEigensolver` や :class:`~qiskit.algorithms.eigensolvers.Eigensolver` オブジェクトの構築に使われるすべてのファクトリー・クラスは、Qiskit Nature バージョン0.6で非推奨になりました。
te: :class:`~qiskit.algorithms.minimum_eigensolvers.MinimumEigensolver` లేదా :class:`~qiskit.algorithms.eigensolvers.Eigensolver` ఒబ్జెచ్త్స్ నిర్మించడానికి ఉపయోగించబడే అన్ని ఫ్యాక్టరీ క్లాస్లు Qiskit Nature వెర్షన్ 0.6లో భాగంగా తిరస్కరించబడ్డాయి.

source: Their benefit over an improved documentation on how to properly set these algorithms up for use with Qiskit Nature has diminished over time. Thus, you can now find proper **How-to guides**, as listed below, detailing how you can achieve the same functionality which used to be provided by these classes. The table below summarizes where you need to look for the steps to replace a factory class:
es_un: Su ventaja sobre una documentación mejorada sobre cómo configurar correctamente estos algoritmos para su uso con Qiskit Nature ha disminuido con el tiempo. Por lo tanto, ahora puedes encontrar **Guías prácticas** adecuadas, como se indica a continuación, que detallan cómo puedes lograr la misma funcionalidad que solían proporcionar estas clases. La siguiente tabla resume dónde debes buscar los pasos para reemplazar una clase de fábrica:
ja: QisKit Natureでこれらのアルゴリズムを適切にセットアップする方法に関する改善されたドキュメンテーションの利点は、時間の経過とともに減少しています。 これらのクラスで提供されていたものと同じ機能を実現する方法を詳述した適切な **ハウツーガイド** を以下に見つけることができます。以下の表は、ファクトリー・クラスを置き換えるステップを探す必要がある場所をまとめています。
te: Qiskit Natureతో ఉపయోగం కోసం ఈ అల్గారిథమ్‌లను ఎలా సరిగ్గా సెటప్ చేయాలనే దానిపై మెరుగైన డాక్యుమెంటేషన్‌పై వారి ప్రయోజనం కాలక్రమేణా తగ్గిపోయింది. ఈ విధంగా, మీరు ఇప్పుడు సరైన **ఎలా-చేయాలి గైడ్‌లను** కనుగొనవచ్చు, దిగువ జాబితా చేయబడినట్లుగా, ఈ క్లాస్ ల ద్వారా అందించబడిన అదే కార్యాచరణను మీరు ఎలా సాధించవచ్చో వివరిస్తారు. ఫ్యాక్టరీ క్లాస్ ని భర్తీ చేయడానికి మీరు దశల కోసం ఎక్కడ వెతకాలి అని దిగువ పట్టిక సంగ్రహిస్తుంది:

source: (Minimum)EigensolverFactory Replacements
es_un: Reemplazos de (Minimum)EigensolverFactory
ja: (最小) EigensolverFactory の代替
te: (Minimum)EigensolverFactory ప్రత్యామ్నాయాలు

source: Legacy class
es_un: Clase anterior
ja: レガシー・クラス
te: లెగసీ క్లాస్

source: How-to guide
es_un: Guía práctica
ja: ハウツーガイド
te: ఎలా-మార్గనిర్దేశం చేయాలి

source: :ref:`Finding excited state energies with a NumPyEigensolver <how-to-numpy>`
es_un: :ref:`Encontrar energías de estado excitado con un NumPyEigensolver <how-to-numpy>`
ja: :ref:`NumPyEigensolverで励起状態エネルギーを見つける <how-to-numpy>`
te: :ref:` NumPyEigensolverతో ఎక్ససీటెడ్ స్టేట్ ఎనర్జీలను కనుగొనడం <how-to-numpy>`

source: :ref:`Finding the ground state energy with a NumPyMinimumEigensolver <how-to-numpy-min>`
es_un: :ref:`Encontrar la energía del estado fundamental con un NumPyMinimumEigensolver <how-to-numpy-min>`
ja: :ref:`NumPyMinimumEigensolverで基底状態エネルギーを見つける <how-to-numpy-min>`
te: :ref:` NumPyMinimumEigensolverతో గ్రౌండ్ స్టేట్ ఎనర్జీని కనుగొనడం <how-to-numpy-min>`

source: :ref:`Using a UCC-like ansatz with a VQE <how-to-vqe-ucc>`
es_un: :ref:`Usar un ansatz similar a UCC con un VQE <how-to-vqe-ucc>`
ja: :ref:`VQEとUCCのようなansatzを使用する <how-to-vqe-ucc>`
te: :ref:`VQEతో UCC లాంటి అన్సట్జ్ని ఉపయోగించడం <how-to-vqe-ucc>`

source: :ref:`Using a UVCC-like ansatz with a VQE <how-to-vqe-uvcc>`
es_un: :ref:`Usar un ansatz similar a UVCC con un VQE <how-to-vqe-uvcc>`
ja: :ref:`VQEとUVCCのようなansatzを使用する <how-to-vqe-uvcc>`
te: :ref:`VQEతో UVCC లాంటి అన్సట్జ్ని ఉపయోగించడం<how-to-vqe-uvcc>`

source: To make the transition to these guides easier, we provide one example for the :class:`~qiskit_nature.second_q.algorithms.VQEUCCFactory` and one for the :class:`~qiskit_nature.second_q.algorithms.NumPyEigensolverFactory` below.
es_un: Para facilitar la transición a estas guías, proporcionamos un ejemplo para :class:`~qiskit_nature.second_q.algorithms.VQEUCCFactory` y otro para :class:`~qiskit_nature.second_q.algorithms.NumPyEigensolverFactory` a continuación.
ja: これらのガイドへの移行を容易にするために、 :class:`~qiskit_nature.second_q.algorithms.VQEUCCFactory` の例と、 :class:`~qiskit_nature.second_q.algorithms.NumPyEigensolverFactory` の例を以下に示します。
te: ఈ గైడ్‌లకు బదిలీని సులభతరం చేయడానికి, మేము దీనికి ఒక ఉదాహరణను అందిస్తాము :class:` ~ qiskit_nature.second_q.algorithms.VQEUCCFactory ` మరియు :class:` ~ qiskit_nature.second_q.algorithms.NumPyEigensolverFactory ` కోసం ఒకటి.

source: Setup
es_un: Configuración
ja: セットアップ
te: సెట్ అప్

source: For the following examples, we need a simple :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem` which we can obtain from a :class:`~qiskit_nature.second_q.drivers.PySCFDriver` like so:
es_un: Para los siguientes ejemplos, necesitamos un :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem` simple que podemos obtener de un :class:`~qiskit_nature.second_q.drivers.PySCFDriver` así:
ja: 以下の例では、 :class:`~qiskit_nature.second_q.drivers.PySCFDriver` から取得できる単純な :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem` が必要です：
te: కింది ఉదాహరణల కోసం, మనకు సాధారణ :class:` ~ qiskit_nature.second_q.problems.ElectronicStructureProblem` అవసరం` ఇది మనం :class:`~ qiskit_nature.second_q.drivers.PySCFDriver ` వంటి క్లాస్ నుండి పొందవచ్చు :

source: The old way:
es_un: La manera anterior:
ja: 古い方法：
te: పాత పద్ధతి:

source: And the corresponding new way:
es_un: Y la nueva manera correspondiente:
ja: 対応する新しい方法：
te: మరియు సంబంధిత కొత్త పద్దతి:
