Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/migration/0.6_a_intro.po
Languages: es_un, ja, te

source: Qiskit Nature v0.6 Migration Guide
es_un: Guía de Migración de Qiskit Nature v0.6
ja: Qiskit Nature v0.6 移行ガイド
te: Qiskit Nature v0.6 మైగ్రేషన్ గైడ్

source: This document will guide you through the process of migrating your code from Qiskit Nature v0.5 to v0.6
es_un: Este documento te guiará a través del proceso de migración de tu código de Qiskit Nature v0.5 a v0.6
ja: この文書では、コードを Qiskit Nature v0.5 から v0.6 へマイグレーションするプロセスをガイドします。
te: ఈ పత్రం మీ కోడ్‌ని Qiskit Nature v0.5 నుండి v0.6కి మార్చే ప్రక్రియ ద్వారా మీకు మార్గనిర్దేశం చేస్తుంది

source: Overview
es_un: Descripción General
ja: 概要
te: ఓవర్వ్యూ

source: Version 0.6 of Qiskit Nature comes with two major deprecations:
es_un: La versión 0.6 de Qiskit Nature viene con dos principales obsolescencias:
ja: Qiskit Natureのバージョン 0.6 には、次の 2 つの主な非推奨があります。
te: Qiskit Nature యొక్క వెర్షన్ 0.6 రెండు ప్రధాన నిరాకరణలతో వస్తుంది:

source: the ``(Minimum)EigensolverFactory`` utilities
es_un: las utilidades ``(Minimum)EigensolverFactory``
ja: ``(Minimum)EigensolverFactory`` ユーティリティー
te: ``(Minimum)EigensolverFactory`` యుటిలిటీలు

source: the ``QubitConverter`` class
es_un: la clase ``QubitConverter``
ja: ``QubitConverter`` クラス
te: ` ` QubitConverter ` క్లాస్

source: Both of these deprecations and explanations on how to update your code are provided in more detail on the following pages:
es_un: Tanto estas obsolescencias como las explicaciones sobre cómo actualizar tu código se proporcionan con más detalle en las siguientes páginas:
ja: これらの非推奨とコードの更新方法に関する説明は、以下のページで詳細に提供されています。
te: మీ కోడ్‌ని ఎలా అప్‌డేట్ చేయాలనే దానిపై ఈ రెండు నిరాకరణలు మరియు వివరణలు క్రింది పేజీలలో మరింత వివరంగా అందించబడ్డాయి:

source: `(Minimum)EigensolverFactory migration guide`_
es_un: `Guía de migración de (Minimum)EigensolverFactory`_
ja: `(最小) EigensolverFactory マイグレーション・ガイド`_
te: `(Minimum)EigensolverFactory మైగ్రేషన్ గైడ్`_

source: `QubitConverter migration guide`_
es_un: `Guía de migración de QubitConverter`_
ja: `QubitConverter マイグレーション・ガイド`_
te: ` QubitConverter మైగ్రేషన్ గైడ్ ` _

source: Other notable deprecations
es_un: Otros casos de obsolescencia notables
ja: その他の注意すべき非推奨事項
te: ఇతర ప్రఖ్యాత నిరాకరణలు

source: Here are a few other noteworthy minor changes which you should be aware of:
es_un: Aquí hay algunos otros cambios menores dignos de mención que debes tener en cuenta:
ja: 他の注意すべきマイナーな変更を紹介します：
te: మీరు తెలుసుకోవలసిన కొన్ని ఇతర గుర్తించదగిన చిన్న మార్పులు ఇక్కడ ఉన్నాయి:

source: The :meth:`~qiskit_nature.second_q.problems.BaseProblem.symmetry_sector_locator` method is no longer needed in the new workflow around the :class:`~qiskit_nature.second_q.mappers.QubitMapper` classes. Instead, you should now use the new :meth:`~qiskit_nature.second_q.problems.BaseProblem.get_tapered_mapper` method. For more details, please refer to the `QubitConverter migration guide`_.
es_un: El método :meth:`~qiskit_nature.second_q.problems.BaseProblem.symmetry_sector_locator` ya no es necesario en el nuevo flujo de trabajo en torno a las clases :class:`~qiskit_nature.second_q.mappers.QubitMapper`. En su lugar, ahora debes usar el nuevo método :meth:`~qiskit_nature.second_q.problems.BaseProblem.get_tapered_mapper`. Para obtener más detalles, consulta la `guía de migración de QubitConverter`_.
ja: :meth:`~qiskit_nature.second_q.problems.BaseProblem.symmetry_sector_locator` メソッドは、:class:`~qiskit_nature.second_q.mappers.QubitMapper` クラス周りの新しいワークフローでは必要なくなりました。 代わりに、新しい :meth:`~qiskit_nature.second_q.problems.BaseProblem.get_tapered_mapper` メソッドを使用する必要があります。 詳細については、`QubitConverter マイグレーション・ガイド`_ を参照してください。
te: :meth:`~qiskit_nature.second_q.problems.BaseProblem.symmetry_sector_locator` పద్ధతి ఇకపై కొత్త వర్క్‌ఫ్లోలో :class:`~qiskit_nature.second_q.mappers.QubitMapper` క్లాస్లకు అవసరం లేదు. బదులుగా, మీరు ఇప్పుడు కొత్త :meth:`~qiskit_nature.second_q.problems.BaseProblem.get_tapered_mapper` పద్ధతిని ఉపయోగించాలి. మరిన్ని వివరాల కోసం, దయచేసి `QubitConverter మైగ్రేషన్ గైడ్`_ని చూడండి.

source: The new :class:`.Tensor` class has been introduced which will become the default return type of objects stored in a :class:`.PolynomialTensor` instance. You can already switch to this by setting :attr:`~qiskit_nature.settings.tensor_unwrapping` to ``False``.
es_un: Se ha introducido la nueva clase :class:`.Tensor`, que se convertirá en el tipo de retorno predeterminado de los objetos almacenados en una instancia de :class:`.PolynomialTensor`. Ya puedes cambiar a esto configurando :attr:`~qiskit_nature.settings.tensor_unwrapping` en ``False``.
ja: 新しい :class:`.Tensor` クラスが導入され、 :class:`.PolynomialTensor' インスタンスに保管されているオブジェクトのデフォルトの戻りの型になります。 :attr:`~qiskit_nature.settings.tensor_unwrapping` を ``False`` に設定することにより、切り替えることができます。
te: కొత్త :class:` .Tensor ` క్లాస్ ప్రవేశపెట్టబడింది, ఇది :class:` .PolynomialTensor ` ఇనిస్టాన్స్లో నిల్వ చేయబడిన వస్తువుల యొక్క డిఫాల్ట్ రిటర్న్ టైపు అవుతుంది. మీరు ఇప్పటికే సెట్ చేయడం ద్వారా దీనిని మారవచ్చు :attr:` ~ qiskit_nature.settings.tensor_unwrapping ` to ` False `.
