Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/migration/0.6_c_qubit_converter.po
Languages: es_un, ja

source: The QubitConverter Migration Guide
es_un: Guía de Migración del QubitConverter
ja: QubitConverter 移行ガイド

source: The :class:`~qiskit_nature.second_q.mappers.QubitConverter` class has been deprecated as part of version 0.6 of Qiskit Nature. Instead of wrapping this class around one of the available :class:`~qiskit_nature.second_q.mappers.QubitMapper` classes, the latter can now instead be used directly. To support this, the mappers have been improved and now ship with more advanced functionality out of the box.
es_un: La clase :class:`~qiskit_nature.second_q.mappers.QubitConverter` ha quedado obsoleta como parte de la versión 0.6 de Qiskit Nature. En lugar de encapsular esta clase alrededor de una de las clases :class:`~qiskit_nature.second_q.mappers.QubitMapper` disponibles, esta última ahora se puede usar directamente. Para soportar esto, los mapeadores se han mejorado y ahora se entregan con una funcionalidad más avanzada lista para usar.
ja: :class:`~qiskit_nature.second_q.mappers.QubitConverter` クラスは、Qiskit Nature バージョン 0.6で非推奨になりました。 :class:`~qiskit_nature.second_q.mappers.QubitMapper` クラスをラップする代わりに、このクラスを直接使用できるようになります。 これをサポートするために、マッパーが改良され、さらなる拡張機能が使用できるようになっています。

source: To keep this guide simple, we will focus on examples on how to replace specific use cases of the :class:`~qiskit_nature.second_q.mappers.QubitConverter`. For more details on the mappers we suggest you check out the `tutorial on qubit mappers <../tutorials/06_qubit_mappers.ipynb>`_.
es_un: Para simplificar esta guía, nos centraremos en ejemplos sobre cómo reemplazar casos de uso específicos de :class:`~qiskit_nature.second_q.mappers.QubitConverter`. Para obtener más detalles sobre los mapeadores, te sugerimos que consultes el `tutorial sobre mapeadores de qubits <../tutorials/06_qubit_mappers.ipynb>`_.
ja: このガイドをシンプルにするために、:class:`~qiskit_nature.second_q.mappers.QubitConverter` の特定のユースケースを置き換える方法例に焦点を当てます。 マッパーの詳細については、 `量子ビット・マッパーのチュートリアル <../tutorials/06_qubit_mappers.ipynb>`_ を参照してください。

source: Setup
es_un: Configuración
ja: セットアップ

source: For the examples in this guide, we will always be using the following :class:`~qiskit_nature.second_q.operators.FermionicOp`:
es_un: Para los ejemplos de esta guía, siempre usaremos el siguiente :class:`~qiskit_nature.second_q.operators.FermionicOp`:
ja: このガイドの例では、常に次の :class:`~qiskit_nature.second_q.operators.FermionicOp` を使用します。

source: PauliSumOp vs. SparsePauliOp
ja: PauliSumOp 対 SparsePauliOp

source: One more note: the :mod:`qiskit.opflow` module is going to be deprecated in the future. In order to transition from the :class:`~qiskit.opflow.primitive_ops.PauliSumOp` class and its widespread use to the :mod:`qiskit.quantum_info` module and its :class:`~qiskit.quantum_info.SparsePauliOp` class, you can now set the value of :attr:`~qiskit_nature.settings.QiskitNatureSettings.use_pauli_sum_op` to ``False``. This will become the default in a later release.
es_un: Una nota más: el módulo :mod:`qiskit.opflow` quedará obsoleto en el futuro. Para pasar de la clase :class:`~qiskit.opflow.primitive_ops.PauliSumOp` y su uso generalizado al módulo :mod:`qiskit.quantum_info` y su clase :class:`~qiskit.quantum_info.SparsePauliOp`, ahora puedes establecer el valor de :attr:`~qiskit_nature.settings.QiskitNatureSettings.use_pauli_sum_op` en ``False``. Esto se convertirá en el valor predeterminado en una versión posterior.
ja: もう 1 つの注記 : :mod:`qiskit.opflow` モジュールは、将来非推奨になる予定です。 :class:`~qiskit.opflow.primitive_ops.PauliSumOp` クラスと、広範囲に使用されている :mod:`qiskit.quantum_info` モジュールと :class:`~qiskit.quantum_info.SparsePauliOp` から移行するために、 :attr:`~qiskit_nature.settings.QiskitNatureSettings.use_pauli_sum_op` の値を ``False`` に設定することができます。 これは後のリリースではデフォルトになる予定です。

source: To ensure that we can consistently rely on using the :class:`~qiskit.quantum_info.SparsePauliOp` in the following parts of this guide, we are applying this setting here:
es_un: Para asegurarnos de que podemos confiar consistentemente en el uso del :class:`~qiskit.quantum_info.SparsePauliOp` en las siguientes partes de esta guía, estamos aplicando esta configuración aquí:
ja: :class:`~qiskit.quantum_info.SparsePauliOp` をこのガイドの以降の部分で一貫して使用できるようにするために、以下の設定を適用します:

source: As a consequence of this upcoming deprecation, Qiskit Nature now fully supports the use :class:`~qiskit.quantum_info.SparsePauliOp` instances in all places which previously allowed :class:`~qiskit.opflow.primitive_ops.PauliSumOp` objects. In order to leverage this, it is **not** required to change the setting above. Thus, it is recommended that you switch to using :class:`~qiskit.quantum_info.SparsePauliOp`.
es_un: Como consecuencia de esta próxima obsoletización, Qiskit Nature ahora es totalmente compatible con el uso de instancias :class:`~qiskit.quantum_info.SparsePauliOp` en todos los lugares que anteriormente permitían objetos :class:`~qiskit.opflow.primitive_ops.PauliSumOp`. Para aprovechar esto, **no** es necesario cambiar la configuración anterior. Por lo tanto, se recomienda que cambies a usar :class:`~qiskit.quantum_info.SparsePauliOp`.
ja: 今後非推奨となるため、Qiskit Natureは以前 :class:`~qiskit.opflow.primitive_ops.PauliSumOp` オブジェクトが許されていたすべての場所で :class:`~qiskit.quantum_info.SparsePauliOp` インスタンスの使用をサポートしています。これを活用するため、上記の設定を変えることは必要では **ありません** 。 :class:`~qiskit.quantum_info.SparsePauliOp` を使うよう変更することを推奨しています。

source: For more in-depth information about the :mod:`qiskit.opflow` deprecation please refer to its `migration guide`_.
es_un: Para obtener información más detallada sobre la obsoletización de :mod:`qiskit.opflow`, consulta su `guía de migración`_.
ja: :mod:`qiskit.opflow` 非推奨の詳細については、 `マイグレーション・ガイド`_ を参照してください。

source: Simplest cases
es_un: Casos más simples
ja: 最も簡単なケース

source: In the simplest cases, all you did was pass a :class:`~qiskit_nature.second_q.mappers.QubitMapper` object into the :class:`~qiskit_nature.second_q.mappers.QubitConverter`. For example, somewhat like this:
es_un: En los casos más simples, todo lo que hiciste fue pasar un objeto :class:`~qiskit_nature.second_q.mappers.QubitMapper` al :class:`~qiskit_nature.second_q.mappers.QubitConverter`. Por ejemplo, algo así:
ja: 最も簡単なケースでは、 :class:`~qiskit_nature.second_q.mappers.QubitMapper` オブジェクトを :class:`~qiskit_nature.second_q.mappers.QubitConverter` に渡しました。例えば、次のようになります。

source: All you need to do in order to update your code, is stop doing that and simply pass the ``mapper`` object from the example above into whichever place you were using it before.
es_un: Todo lo que necesitas hacer para actualizar tu código es dejar de hacerlo y simplemente pasar el objeto ``mapper`` del ejemplo anterior al lugar donde lo estabas usando antes.
ja: コードを更新するために必要なことは、それをやめ、単に上記の例の ``mapper`` オブジェクトを以前使用していたどちらかの場所に渡すことです。

source: If you were working directly with some :class:`~qiskit_nature.second_q.operators.SparseLabelOp` like so:
es_un: Si estuvieras trabajando directamente con algún :class:`~qiskit_nature.second_q.operators.SparseLabelOp` así:
ja: :class:`~qiskit_nature.second_q.operators.SparseLabelOp` を直接使用している場合は以下のようにします：

source: You should now directly use the ``mapper`` again, but its method is called ``.map``:
es_un: Ahora deberías usar directamente el ``mapper`` de nuevo, pero su método se llama ``.map``:
ja: ここでもう一度 ``mapper`` を使用する必要がありますが、そのメソッドは ``.map`` と呼ばれます。

source: This is likely what you were doing when you were working with any of the following mappers:
es_un: Esto es probablemente lo que estabas haciendo cuando trabajabas con cualquiera de los siguientes mapeadores:
ja: これは、以下のマッパーのいずれかを使用して作業していたときに、実行していたことです。

source: The ParityMapper
es_un: El ParityMapper
ja: パリティ・マッピング

source: However, when you were using the :class:`~qiskit_nature.second_q.mappers.ParityMapper`, you were able to use the ``two_qubit_reduction=True`` option of the :class:`~qiskit_nature.second_q.mappers.QubitConverter`. This ability, which has always been unique to the :class:`~qiskit_nature.second_q.mappers.ParityMapper`, is now directly built into said mapper. So if you were doing something along these lines:
es_un: Sin embargo, cuando estabas usando el :class:`~qiskit_nature.second_q.mappers.ParityMapper`, podías usar la opción ``two_qubit_reduction=True`` del :class:`~qiskit_nature.second_q.mappers.QubitConverter`. Esta capacidad, que siempre ha sido exclusiva del :class:`~qiskit_nature.second_q.mappers.ParityMapper`, ahora está integrada directamente en dicho mapeador. Entonces, si estuvieras haciendo algo en este sentido:
ja: しかし、 :class:`~qiskit_nature.second_q.mappers.ParityMapper` を使用している場合は、 :class:`~qiskit_nature.second_q.mappers.QubitConverter` の ``two_qubit_reduction=True`` オプションを使用することができました。 :class:`~qiskit_nature.second_q.mappers.ParityMapper` にユニークなこの機能は、現在直接マッパーに組み込まれています。 もしあなたがこれらの方法に沿って何かをしている場合は：

source: The equivalent code now looks like the following:
es_un: El código equivalente ahora tiene el siguiente aspecto:
ja: 同等のコードは次のようになります。

source: Finally, the :class:`~qiskit_nature.second_q.mappers.QubitConverter` class also supported further reduction of qubit resources by exploiting the :class:`~qiskit.opflow.primitive_ops.Z2Symmetries` implemented in the :mod:`qiskit.opflow` module. Although we did extend the deprecated class to also support the updated implementation in the :mod:`qiskit.quantum_info` module (which has the same name: :class:`~qiskit.quantum_info.analysis.z2_symmetries.Z2Symmetries`), you should now use the new :class:`~qiskit_nature.second_q.mappers.TaperedQubitMapper` instead.
es_un: Finalmente, la clase :class:`~qiskit_nature.second_q.mappers.QubitConverter` también soportó una mayor reducción de los recursos de qubit al explotar las :class:`~qiskit.opflow.primitive_ops.Z2Symmetries` implementada en el módulo :mod:`qiskit.opflow`. Aunque extendimos la clase obsoleta para soportar también la implementación actualizada en el módulo :mod:`qiskit.quantum_info` (que tiene el mismo nombre: :class:`~qiskit.quantum_info.analysis.z2_symmetries.Z2Symmetries`), deberías ahora usar el nuevo :class:`~qiskit_nature.second_q.mappers.TaperedQubitMapper` en su lugar.
ja: ついに :class:`~qiskit_nature.second_q.mappers.QubitConverter` クラスも、 :mod:`qiskit.opflow` モジュール内に実装された :class:`~qiskit.opflow.primitive_ops.Z2Symmetries` を利用することで、量子ビット・リソースのさらなる削減をサポートしました。 :mod:`qiskit.quantum_info` モジュール ( :class:`~qiskit.quantum_info.analysis.z2_symmetries.Z2Symmetries` と同じ名前を持ちます) の更新された実装をサポートするため非推奨クラスを拡張しましたが、今は新しい :class:`~qiskit_nature.second_q.mappers.TaperedQubitMapper` クラスを代わりに使用すべきです。

source: In the past, you would have enabled this like so:
es_un: En el pasado, habrías habilitado esto así:
ja: 以前は、以下のように有効化にしていました：

source: which would then later use :meth:`~qiskit_nature.second_q.problems.BaseProblem.symmetry_sector_locator` to find the symmetry sector of the Hilbert space in which the solution of your problem lies. This was only supported by the :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem`. Below is a quick example:
es_un: lo que luego usaría :meth:`~qiskit_nature.second_q.problems.BaseProblem.symmetry_sector_locator` para encontrar el sector de simetría del espacio de Hilbert en el que se encuentra la solución de tu problema. Esto solo fue soportado por el :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem`. A continuación se muestra un ejemplo rápido:
ja: 後に :meth:`~qiskit_nature.second_q.problems.BaseProblem.symmetry_sector_locator`を使用して、問題の解があるヒルベルト空間の対称性セクターを見つけます。 これは、 :class:`~qiskit_nature.second_q.problems.ElectronicStructureProblem` クラスでのみサポートされています。以下に、簡単な例を示します：

source: Now, all you need to do is the use the :meth:`~qiskit_nature.second_q.problems.BaseProblem.get_tapered_mapper` method and provide the original mapper which you would like to wrap:
es_un: Ahora, todo lo que necesitas hacer es usar el método :meth:`~qiskit_nature.second_q.problems.BaseProblem.get_tapered_mapper` y proporcionar el mapeador original que te gustaría encapsular:
ja: 次に必要なのは、 :meth:`~qiskit_nature.second_q.problems.BaseProblem.get_tapered_mapper` メソッドを使用し、ラップしたい元のマッパーを提供することだけです：

source: If you were not using the automatic symmetry detection but instead provided a custom symmetry sector, you can construct your :class:`~qiskit_nature.second_q.mappers.TaperedQubitMapper` instance directly. Be sure to check out its documentation for more details.
es_un: Si no estabas utilizando la detección automática de simetría, sino que proporcionabas un sector de simetría personalizado, puedes construir tu instancia de :class:`~qiskit_nature.second_q.mappers.TaperedQubitMapper` directamente. Asegúrate de consultar su documentación para obtener más detalles.
ja: 自動対称性検出を使用しておらず、代わりにカスタム対称性セクターを指定した場合は、 :class:`~qiskit_nature.second_q.mappers.TaperedQubitMapper` をインスタンスを直接構築できます。 詳細については、必ずそのドキュメンテーションを確認してください。
