Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/migration/00_Migration_Guide_to_v0.5.po
Languages: ko, ta

source: This page was generated from `docs/migration/00_Migration_Guide_to_v0.5.ipynb`__.
ko: 이 페이지는 `docs/migration/01_migration_guide_0.5.ipynb`__ 에서 생성되었다.
ta: இந்தப் பக்கம் `docs/migration/00_Migration_Guide_to_v0.5.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Qiskit Nature v0.5 Migration Guide
ko: Qiskit Nature v0.5 마이그레이션 가이드
ta: கிஸ்கிட் நேச்சர் v0.5 இடம்பெயர்வு வழிகாட்டி

source: This tutorial will guide you through the process of migrating your code from Qiskit Nature v0.4 to v0.5
ko: 이 튜토리얼은 Qiskit Nature v0.4에서 v0.5로 코드를 마이그레이션하는 과정 안내이다.
ta: உங்கள் குறியீட்டை Qiskit Nature v0.4 இலிருந்து v0.5க்கு மாற்றும் செயல்முறையின் மூலம் இந்தப் பயிற்சி உங்களுக்கு வழிகாட்டும்

source: Overview
ko: 개요
ta: கண்ணோட்டம்

source: Let us begin with an overview of the refactored design. A major motivator for the refactoring of Qiskit Nature was the goal of readying Qiskit Nature for more and tighter integrations with other classical-computational codes. In order to achieve this in the most modular and maintainable manner, we had to decouple the representation of our ``BaseProblem`` from our ``BaseDriver`` classes.
ko: 리팩터링된 디자인에 대한 개요부터 살펴보자. Qiskit Nature 리팩터링의 주요 이유는 Qiskit Nature가 다른 고전적인 계산 코드와 더욱 긴밀하게 통합될 수 있도록 준비하려는 목표이다. 이를 가장 모듈화되고 유지보수 가능한 방식으로 달성하기 위해, 우리는 ``BaseProblem``의 표현을 ``BaseDriver`` 클래스에서 분리해야 했다.
ta: மறுசீரமைக்கப்பட்ட வடிவமைப்பின் கண்ணோட்டத்துடன் தொடங்குவோம். கிஸ்கிட் நேச்சரை மறுசீரமைப்பதற்கான ஒரு முக்கிய உந்துதலாக, கிஸ்கிட் நேச்சரை மற்ற கிளாசிக்கல்-கணிப்பீட்டுக் குறியீடுகளுடன் மேலும் இறுக்கமான ஒருங்கிணைப்புகளுக்குத் தயார்படுத்துவதாகும். இதை மிகவும் மட்டு மற்றும் பராமரிக்கக்கூடிய முறையில் அடைய, எங்கள் ``பேஸ் ட்ரைவர்`` வகுப்புகளில் இருந்து எங்கள் ``பேஸ்பிராப்ளம்`` பிரதிநிதித்துவத்தை துண்டிக்க வேண்டும்.

source: This led to the following abstract design of the Qiskit Nature package: |Qiskit Nature 0.5|
ko: 이로인해 Qiskit Nature 패키지는 다음과 같이 추상적으로 디자인되었다: | Qiskit Nature 0.5 |
ta: இது Qiskit Nature தொகுப்பின் பின்வரும் சுருக்க வடிவமைப்பிற்கு வழிவகுத்தது: |Qiskit Nature 0.5|

source: As you can see, the package is logically divided into two concepts:
ko: 보는 바와 같이 패키지는 논리적으로 다음 두 가지 개념으로 나뉜다.
ta: நீங்கள் பார்க்க முடியும் என, தொகுப்பு தர்க்கரீதியாக இரண்டு கருத்துகளாக பிரிக்கப்பட்டுள்ளது:

source: **problems**: which are representations of scientific problems to which one seeks a solution
ko: **문제**: 해결책을 찾고자 하는 과학적 문제의 표현이다.
ta: **பிரச்சினைகள்**: இவை அறிவியல் சிக்கல்களின் பிரதிநிதித்துவம் ஆகும், அதற்கு ஒருவர் தீர்வு தேடுகிறார்

source: **algorithms**: which provide the means to find solutions to said problems
ko: **알고리즘**: 해당 문제에 대한 해결책을 찾을 수 있는 수단을 제공한다.
ta: **அல்காரிதம்கள்**: இது கூறப்பட்ட பிரச்சனைகளுக்கு தீர்வு காண வழிகளை வழங்குகிறது

source: In each of these cases, Qiskit Nature has three pillars:
ko: 각각의 경우, Qiskit Nature는 세 개의 기반이 있다.
ta: இந்த ஒவ்வொரு சந்தர்ப்பத்திலும், கிஸ்கிட் இயற்கை மூன்று தூண்களைக் கொண்டுள்ளது:

source: **problems**:
ko: **문제점**:
ta: **சிக்கல்கள்**:

source: *Electronic Structure Problem*: representing the problem of the electronic Schrödinger equation of molecular systems
ko: *전자 구조 문제*: 분자 시스템의 전자식 슈뢰딩거 방정식의 문제점을 나타내는 것.
ta: *மின்னணு கட்டமைப்புச் சிக்கல்*: மூலக்கூறு அமைப்புகளின் மின்னணு ஷ்ரோடிங்கர் சமன்பாட்டின் சிக்கலைக் குறிக்கிறது

source: *Vibrational Structure Problem*: representing the problem posed by the Watson Hamiltonian of molecular systems
ko: *Vibrational Structure 문제점*: 분자 시스템의 Watson Hamiltonian이 제기한 문제를 나타냄.
ta: *அதிர்வு கட்டமைப்பு சிக்கல்*: மூலக்கூறு அமைப்புகளின் வாட்சன் ஹாமில்டோனியனால் முன்வைக்கப்பட்ட சிக்கலைக் குறிக்கிறது

source: *Lattice Model Problem*: representing problems defined on lattices
ko: *Lattice Model Problem*: 격자에 정의된 문제들을 나타낸다.
ta: *லட்டு மாதிரி சிக்கல்*: லட்டுகளில் வரையறுக்கப்பட்ட சிக்கல்களைக் குறிக்கிறது

source: **algorithms**:
ko: **알고리즘**:
ta: **அல்காரிதம்**:

source: *Ground State Solver*: for finding the ground state of a problem
ko: *바닥 상태 솔버*: 문제의 바닥 상태를 찾을 수 있다.
ta: *கிரவுண்ட் ஸ்டேட் சால்வர்*: ஒரு சிக்கலின் தரை நிலையை கண்டறிவதற்காக

source: *Excited States Solver*: for finding excited states of a problem
ko: *Excited States Solver*: 문제의 여기 상태를 찾는다.
ta: *உற்சாகமான மாநிலங்கள் தீர்வு*: ஒரு பிரச்சனையின் உற்சாகமான நிலைகளைக் கண்டறிய

source: *Hamiltonian Simulation*: to simulate dynamics of a problem (*planned for v0.6*)
ko: *Hamiltonian Simulation*: 문제점의 역학 시뮬레이션 (*v0.6 에 대한 계획*)
ta: *ஹாமில்டோனியன் சிமுலேஷன்*: ஒரு சிக்கலின் இயக்கவியலை உருவகப்படுத்த (*v0.6 க்கு திட்டமிடப்பட்டது*)

source: Some of these concepts have already been present in earlier versions of Qiskit Nature, but were not as clearly separated. Furthermore, the integration with classical codes has been very restrictive in older versions, limiting not only the potential applications of such integrations, but also the capabilities of our ``BaseProblem`` representation, and its usage in the remainder of the package.
ko: 이러한 개념 중 일부는 이전 버전의 Qiskit Nature에 이미 존재했지만 명확하게 분리되지는 않았다. 또한, 이전 버전에서는 클래식 코드와의 통합이 매우 제한적이었기 때문에 이러한 통합의 잠재적 적용뿐만 아니라 ``BaseProblem`` 표현의 기능 및 나머지 패키지에서의 사용도 제한적이었다.
ta: இவற்றில் சில கருத்துக்கள் கிஸ்கிட் நேச்சரின் முந்தைய பதிப்புகளில் ஏற்கனவே உள்ளன, ஆனால் அவை தெளிவாகப் பிரிக்கப்படவில்லை. மேலும், பழைய பதிப்புகளில் கிளாசிக்கல் குறியீடுகளுடனான ஒருங்கிணைப்பு மிகவும் கட்டுப்படுத்தப்பட்டுள்ளது, இது போன்ற ஒருங்கிணைப்புகளின் சாத்தியமான பயன்பாடுகள் மட்டுமின்றி, எங்களின் ``BaseProblem`` பிரதிநிதித்துவத்தின் திறன்கள் மற்றும் தொகுப்பின் எஞ்சிய பகுதிகளில் அதன் பயன்பாடு ஆகியவற்றைக் கட்டுப்படுத்துகிறது.

source: How to use this guide
ko: 이 안내서를 사용하는 방법
ta: இந்த வழிகாட்டியை எவ்வாறு பயன்படுத்துவது

source: This guide is split across multiple files allowing you to discover the changes between v0.4 and v0.5 to each submodule as you find the need. That means, you do not need to read all of the details at once and jumping around is highly encouraged.
ko: 이 가이드는 여러 파일로 나누어져 있어 필요에 따라 각 하위모듈의 v0.4와 v0.5 사이의 변경 사항을 확인할 수 있다. 즉, 모든 세부 사항을 한 번에 읽을 필요는 없으며 이리저리 훑어보는 것을 적극 권장한다.
ta: இந்த வழிகாட்டி பல கோப்புகளில் பிரிக்கப்பட்டுள்ளது, இதன் மூலம் ஒவ்வொரு துணைத் தொகுதிக்கும் v0.4 மற்றும் v0.5 ஆகியவற்றுக்கு இடையேயான மாற்றங்களை நீங்கள் கண்டறிவதன் மூலம் நீங்கள் தேவைப்படுகிறீர்கள். அதாவது, நீங்கள் அனைத்து விவரங்களையும் ஒரே நேரத்தில் படிக்கத் தேவையில்லை, மேலும் குதிப்பது மிகவும் ஊக்குவிக்கப்படுகிறது.

source: Generally speaking the refactoring largely relocated any code from ``qiskit_nature.X.second_quantization`` to ``qiskit_nature.second_q.X``. This should help you navigate the source code for most cases. However, in some specific cases we have re-categorized specific modules/classes, so be advised to look into the guides for more details below.
ko: 일반적으로 리팩토링은 주로 ``qiskit_nature.X.second_quantization`` 의 모든 코드를 ``qiskit_nature.second_q.X`` 로 옮긴 것이다. 이는 대부분의 경우 소스 코드를 탐색하는 데 도움이 된다. 그러나 일부 특정한 경우에는 특정 모듈/클래스를 다시 분류했으므로 아래에 자세한 내용은 안내서를 참조하라.
ta: பொதுவாக மறுசீரமைப்பு எந்தக் குறியீட்டையும் ``qiskit_nature.X.second_quantization`` இலிருந்து ``qiskit_nature.second_q.X``க்கு இடமாற்றம் செய்தது. பெரும்பாலான சந்தர்ப்பங்களில் மூலக் குறியீட்டை வழிசெலுத்த இது உங்களுக்கு உதவும். இருப்பினும், சில குறிப்பிட்ட சந்தர்ப்பங்களில் குறிப்பிட்ட தொகுதிகள்/வகுப்புகளை நாங்கள் மீண்டும் வகைப்படுத்தியுள்ளோம், எனவே கீழே உள்ள மேலும் விவரங்களுக்கு வழிகாட்டிகளைப் பார்க்குமாறு அறிவுறுத்தப்படுகிறோம்.

source: To understand what files you need to pay attention to, please carefully review the following list of topics:
ko: 어떤 파일에 주의해야 하는지 이해하려면 다음 주제 목록을 주의 깊게 검토하라:
ta: நீங்கள் கவனம் செலுத்த வேண்டிய கோப்புகளைப் புரிந்து கொள்ள, பின்வரும் தலைப்புகளின் பட்டியலைக் கவனமாக மதிப்பாய்வு செய்யவும்:

source: `Solving any problem <./00a_Solving_problems_with_v0.5.ipynb>`__
ko: `문제점 해결 <./00a_Solving_problems_with_v0.5.ipynb>`__
ta: `எந்தச் சிக்கலையும் தீர்க்கிறது <./00a_Solving_problems_with_v0.5.ipynb>`__

source: `Electronic Structure Problems <./00b_Electronic_structure_with_v0.5.ipynb>`__
ko: `전자 구조 문제 <./00b_Electronic_structure_with_v0.5.ipynb>`__
ta: `எலக்ட்ரானிக் கட்டமைப்பு சிக்கல்கள் <./00b_Electronic_structure_with_v0.5.ipynb>`__

source: `Vibrational Structure Problems <./00c_Vibrational_structure_with_v0.5.ipynb>`__
ko: `Vibrational Structure 문제 <./00c_Vibrational_structure_with_v0.5.ipynb>`__
ta: `அதிர்வுக் கட்டமைப்பு சிக்கல்கள் <./00c_Vibrational_structure_with_v0.5.ipynb>`__

source: `Lattice Model Problems <./00d_Lattice_models_with_v0.5.ipynb>`__
ko: `격자 모델 문제 (Lattice Model Problems) <./00d_Lattice_models_with_v0.5.ipynb>`__
ta: `லேட்டிஸ் மாடல் சிக்கல்கள் <./00d_Lattice_models_with_v0.5.ipynb>`__

source: `Protein Folding <./00e_Protein_folding_with_v0.5.ipynb>`__
ko: `단백질 접힘 (Protein Folding) <./00e_Protein_folding_with_v0.5.ipynb>`__
ta: `புரத மடிப்பு <./00e_Protein_folding_with_v0.5.ipynb>`__

source: Some important general notes
ko: 몇 가지 중요한 사항
ta: சில முக்கியமான பொது குறிப்புகள்

source: Too many positional arguments
ko: 위치 인자가 너무 많음
ta: பல நிலை வாதங்கள்

source: With Qiskit Nature v0.5 we have started to require certain arguments in the public API to be **keyword-only** arguments. This change was motivated by the following advantages:
ko: Qiskit Nature v0.5를 사용하여 공용 API의 특정 인자는 **keyword-only** 인자가 되도록 하였다. 이 변경은 다음과 같은 장점이 있다.
ta: Qiskit Nature v0.5 உடன், பொது API இல் சில வாதங்கள் **கீவேர்ட்-மட்டும்** வாதங்களாக இருக்க வேண்டும். இந்த மாற்றம் பின்வரும் நன்மைகளால் தூண்டப்பட்டது:

source: improved readability: in the example given below, it is immediately clear what a given argument does
ko: 향상된 가독성: 아래에 제공된 예제에서는 주어진 인자가 무엇을 하는지 바로 알 수 있다.
ta: மேம்படுத்தப்பட்ட வாசிப்புத்திறன்: கீழே கொடுக்கப்பட்டுள்ள எடுத்துக்காட்டில், கொடுக்கப்பட்ட வாதம் என்ன செய்கிறது என்பது உடனடியாகத் தெளிவாகிறது

source: improved forwards compatibility: adding more arguments in the future will be a lot simpler because keyword arguments are not order-dependent
ko: 향상된 전달 호환성: 키워드 인자가 순서에 종속되지 않으므로 향후 더 많은 인자를 추가하는 것이 훨씬 간단해진다.
ta: மேம்படுத்தப்பட்ட முன்னோக்கு இணக்கத்தன்மை: எதிர்காலத்தில் கூடுதல் வாதங்களைச் சேர்ப்பது மிகவும் எளிமையானதாக இருக்கும், ஏனெனில் முக்கிய வாதங்கள் வரிசையைச் சார்ந்து இல்லை

source: That means, even if you only need to update the import path during your migration process, you may run into errors like the following:
ko: 즉, 마이그레이션 프로세스 중에 가져오기 경로만 업데이트해야 하는 경우에도 다음과 같은 오류가 발생할 수 있다.
ta: அதாவது, உங்கள் இடம்பெயர்வு செயல்பாட்டின்போது நீங்கள் இறக்குமதி பாதையை மட்டும் புதுப்பிக்க வேண்டும் என்றால், பின்வருபவை போன்ற பிழைகளை நீங்கள் சந்திக்கலாம்:

source: Previously
ko: 이전
ta: முன்பு

source: Now we update the import path to the new location and obtain an error:
ko: 이제 가져오기 경로를 새 위치로 업데이트하고 오류를 얻는다.
ta: இப்போது இறக்குமதி பாதையைப் புதிய இடத்திற்கு புதுப்பித்துப் பிழையைப் பெறுகிறோம்:

source: If this happens to you, we suggest that you simply check the documentation of the class which you are trying to use. It is very likely that only need to change from using an argument *positionally* to using it with a **keyword**. For example like so:
ko: 이런 문제가 발생하면 사용하려는 클래스의 문서를 확인하는 것이 좋다. 인자를 *positionally*로 사용하는 것에서 **keyword**로 사용하는 것으로만 변경하면 될 가능성이 높다. 예를 들면 다음과 같다:
ta: இது உங்களுக்கு நேர்ந்தால், நீங்கள் பயன்படுத்த முயற்சிக்கும் வகுப்பின் ஆவணங்களைச் சரிபார்க்குமாறு பரிந்துரைக்கிறோம். ஒரு வாதத்தை *நிலையாக* பயன்படுத்துவதிலிருந்து **திறவுச்சொல்** உடன் பயன்படுத்துவதற்கு மட்டுமே இது மாற வேண்டும். உதாரணமாக இது போன்றது:

source: New
ko: 신규
ta: புதியது

source: Unexpected number of orbitals or qubits
ko: 예기치 않은 수의 오비탈 또는 큐비트
ta: எதிர்பாராத எண்ணிக்கையிலான சுற்றுப்பாதைகள் அல்லது குவிட்கள்

source: With Qiskit Nature v0.5 we have switched the entire stack over from using ``num_spin_orbitals`` to instead use ``num_spatial_orbitals``. The motivation behind this, was that the behavior when specifying an odd number of spin orbitals was ill-defined and not guarded against, potentially causing surprising results. By switching to the number of spatial orbitals (which then get multiplied by 2 to yield the total number of spin orbitals), this problem can no longer arise.
ko: Qiskit Nature v0.5에서는 전체 스택이 ``num_spin_orbitals``를 사용하지 않고 대신 ``num_spatial_orbitals``를 사용하도록 전환했다. 그 이유는 홀수 개의 스핀 궤도를 지정할 때 동작이 잘못 정의되고 보호되지 않아 잠재적으로 예상치 못한 결과를 초래할 수 있었기 때문이다. 공간 궤도 수로 전환하면(그런 다음 2를 곱하여 총 스핀 궤도 수가 산출됨) 더 이상 이 문제가 발생하지 않는다.
ta: Qiskit Nature v0.5 மூலம், ``num_spin_orbitals`` ஐப் பயன்படுத்துவதற்குப் பதிலாக ``num_spatial_orbitals`` ஐப் பயன்படுத்துவதற்கு முழு அடுக்கையும் மாற்றியுள்ளோம். இதற்குப் பின்னால் உள்ள உந்துதல் என்னவென்றால், ஒற்றைப்படை எண்ணிக்கையிலான சுழல் சுற்றுப்பாதைகளைக் குறிப்பிடும் போது நடத்தை தவறாக வரையறுக்கப்பட்டது மற்றும் பாதுகாக்கப்படவில்லை, இது ஆச்சரியமான முடிவுகளை ஏற்படுத்தும். இடஞ்சார்ந்த சுற்றுப்பாதைகளின் எண்ணிக்கைக்கு மாறுவதன் மூலம் (பின்னர் இது 2 ஆல் பெருக்கினால் மொத்த சுழல் சுற்றுப்பாதைகளின் எண்ணிக்கை கிடைக்கும்), இந்தப் பிரச்சனை இனி எழாது.

source: So if you do encounter some unexpected number of orbitals and/or qubits in your results, be sure to check whether you need to update your input. For example like shown below:
ko: 따라서 결과에서 예상치 못한 궤도 및/또는 큐비트 수가 발생하면 입력을 업데이트해야 하는지 확인해야 한다. 예를 들면 아래와 같다:
ta: உங்கள் முடிவுகளில் எதிர்பாராத எண்ணிக்கையிலான சுற்றுப்பாதைகள் மற்றும்/அல்லது குவிட்களை நீங்கள் சந்தித்தால், உங்கள் உள்ளீட்டைப் புதுப்பிக்க வேண்டுமா என்பதைச் சரிபார்க்கவும். உதாரணமாக கீழே காட்டப்பட்டுள்ளதைப் போல:
