Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/migration/00a_Solving_problems_with_v0.5.po
Languages: es_un, ja

source: This page was generated from `docs/migration/00a_Solving_problems_with_v0.5.ipynb`__.
es_un: Esta página fue generada a partir de `docs/migration/00a_Solving_problems_with_v0.5.ipynb`__.
ja: このページは `docs/migration/00a_Solving_problems_with_v0.5.ipynb`__ から生成されました。

source: Solving Problems with v0.5
es_un: Resolución de Problemas con v0.5
ja: V0.5 で問題を解決

source: Overview
es_un: Descripción General
ja: 概要

source: The major focus of the Qiskit Nature v0.5 refactoring was the description and representation of second-quantized operators and problems. Nonetheless, the ``algorithms`` module and supporting modules did also receive significant updates. Most importantly all algorithms In Nature are now dependent on the new Qiskit Terra algorithms, and these are now based on `Qiskit Primitives <https://qiskit.org/documentation/apidoc/primitives.html>`__ and were added in Qiskit Terra 0.22. It is not the intention to provide detailed explanations of the primitives in this migration guide. We suggest that you read the `corresponding resources <https://qiskit.org/documentation/apidoc/primitives.html>`__ of the Qiskit Terra documentation instead.
es_un: El enfoque principal de la refactorización de Qiskit Nature v0.5 fue la descripción y representación de operadores y problemas de segunda cuantización. No obstante, el módulo ``algorithms`` y los módulos de soporte también recibieron actualizaciones significativas. Lo más importante es que todos los algoritmos en Nature ahora dependen de los nuevos algoritmos de Qiskit Terra, y estos ahora se basan en `Primitivas de Qiskit <https://qiskit.org/documentation/apidoc/primitives.html>`__ y se agregaron en Qiskit Terra 0.22. No es la intención proporcionar explicaciones detalladas de las primitivas en esta guía de migración. Te sugerimos que leas los `recursos correspondientes <https://qiskit.org/documentation/apidoc/primitives.html>`__ de la documentación de Qiskit Terra en su lugar.
ja: Qiskit Nature v0.5のリファクタリングの主な焦点は、第二量子化された演算子と問題の記述と表現でした。しかしながら、``algorithms`` モジュールとそれをサポートするモジュールもまた、重要なアップデートを受けました。最も重要なことは、Natureのすべてのアルゴリズムが新しいQiskit Terraアルゴリズムに依存するようになったことです。これらは現在、`Qiskit Primitives <https://qiskit.org/documentation/apidoc/primitives.html>`__ に基づいており、Qiskit Terra 0.22 で追加されたものです。この移行ガイドでPrimitive の詳細な説明を提供することは意図していません。代わりにQiskit Terraドキュメントの `対応するリソース <https://qiskit.org/documentation/apidoc/primitives.html>`__ を読むことをお勧めします。

source: Table of Contents
es_un: Tabla de Contenido
ja: 目次

source: In this document, we will provide an overview of the API changes alongside with some minimal explanations:
es_un: En este documento, proporcionaremos una descripción general de los cambios de la API junto con algunas explicaciones mínimas:
ja: このドキュメントでは、API変更の概要と最低限の解説を行います。

source: Further Resources
es_un: Más Recursos
ja: その他のリソース

source: For more details, please refer to the corresponding tutorials:
es_un: Para obtener más detalles, consulta los tutoriales correspondientes:
ja: 詳細は、対応するチュートリアルを参照してください。

source: `Ground State Solvers <../tutorials/03_ground_state_solvers.ipynb>`__
es_un: `Solucionadores de Estado Fundamental <../tutorials/03_ground_state_solvers.ipynb>`__

source: `Excited States Solvers <../tutorials/04_excited_states_solvers.ipynb>`__
es_un: `Solucionadores de Estados Excitados <../tutorials/04_excited_states_solvers.ipynb>`__

source: `Qubit Mappers <../tutorials/06_qubit_mappers.ipynb>`__
es_un: `Mapeadores de Qubit <../tutorials/06_qubit_mappers.ipynb>`__

source: The mappers of Qiskit Nature did **not** receive any API changes (other than potentially requiring certain arguments to be keywords; see also the `“Too many positional arguments” section <./00_Migration_Guide_to_v0.5.ipynb>`__). However, the entire module ``qiskit_nature.mappers.second_quantization`` has been moved to ``qiskit_nature.second_q.mappers``. So updating your import is all you need to do here.
es_un: Los mapeadores de Qiskit Nature **no** recibieron ningún cambio en la API (aparte de requerir potencialmente que ciertos argumentos sean palabras clave; consulta también la sección `“Demasiados argumentos posicionales” <./00_Migration_Guide_to_v0.5.ipynb>`__). Sin embargo, todo el módulo ``qiskit_nature.mappers.second_quantization`` se ha movido a ``qiskit_nature.second_q.mappers``. Entonces, actualizar tu importación es todo lo que necesitas hacer aquí.
ja: Qiskit Nature のマッパーは、API の変更を **受け取りませんでした** (特定の引数をキーワードにする必要がある可能性を除いて。: `「多すぎる位置指定引数」セクション <./00_Migration_Guide_to_v0.5.ipynb>`__も参照してください)。 しかし、モジュール ``qiskit_nature.mappers.second_quantization`` はすべて ``qiskit_nature.second_q.mappers`` に移動されました。そのため、インポートを更新するだけでよいのです。

source: This module contained a single component: ``QubitConverter``. This has been moved to ``qiskit_nature.second_q.mappers.QubitConverter`` so you can simply update your import path.
es_un: Este módulo contenía un único componente: ``QubitConverter``. Esto se ha movido a ``qiskit_nature.second_q.mappers.QubitConverter`` para que simplemente puedas actualizar tu ruta de importación.
ja: このモジュールには、``QubitConverter`` というコンポーネントが1つだけ含まれていました。これは ``qiskit_nature.second_q.mappers.QubitConverter`` に移動されたので、インポートパスを更新するだけでよいでしょう。

source: API changes were again minimal but the operators being translated by this class are no longer the legacy ``SecondQuantizedOp`` but rather the new ``SparseLabelOp`` objects.
es_un: Los cambios en la API fueron nuevamente mínimos, pero los operadores que esta clase está traduciendo ya no son los ``SecondQuantizedOp`` heredados, sino los nuevos objetos ``SparseLabelOp``.
ja: API の変更は最小限に抑えられましたが、このクラスによって変換される演算子は、従来の ``SecondQuantizedOp`` ではなく、新しい ``SparseLabelOp`` オブジェクトに変更されました。

source: The entire ``qiskit_nature.circuit`` module was relocated to ``qiskit_nature.second_q.circuit``. The reason for this, is that the existing circuit were actually only applicable to second-quantized applications, but the API did not reflect this. Updating your imports should fix *most* issues.
es_un: Todo el módulo ``qiskit_nature.circuit`` se reubicó en ``qiskit_nature.second_q.circuit``. La razón de esto es que el circuito existente en realidad solo era atribuible a aplicaciones de segunda cuantización, pero la API no reflejaba esto. Actualizar tus importaciones debería solucionar *la mayoría* de los problemas.
ja: ``qiskit_nature.circuit`` モジュール全体が ``qiskit_nature.second_q.circuit`` に移行されました。その理由は、既存の回路は実際には第2量子化アプリケーションにしか適用できないのに、APIにそれが反映されていなかったからです。インポートを更新することで、 *ほとんど* の問題を解決できるはずです。

source: However, there are two more details to take note of, detailed below.
es_un: Sin embargo, hay dos detalles más a tener en cuenta, que se indican a continuación.
ja: しかし、もう2つ注意すべき点があります。

source: Number of Orbitals
es_un: Número de Orbitales
ja: 軌道の数

source: We have been consistently describing the number of orbitals via ``num_spin_orbitals`` throughout the package. However, what this oftentimes implied (without rigorous checks) was that an **even** number was supplied, since the number of spin orbitals was assumed to equal twice the number of **spatial** orbitals.
es_un: Hemos estado describiendo constantemente el número de orbitales a través de ``num_spin_orbitals`` en todo el paquete. Sin embargo, lo que esto implicaba a menudo (sin comprobaciones rigurosas) era que se proporcionaba un número **par**, ya que se suponía que el número de orbitales de espín era igual al doble del número de orbitales **espaciales**.
ja: 我々は、パッケージ全体を通して、一貫して ``num_spin_orbitals`` を介して軌道の数を記述してきました。しかし、スピン軌道の数は **空間** 軌道の数の2倍と仮定されているため、（厳密なチェックなしで）しばしば **偶数** の数が供給されることを意味します。

source: To be more rigorous and avoid the ill-defined behavior when providing *odd* numbers for ``num_spin_orbitals``, we have switched the entire stack to use ``num_spatial_orbitals`` instead. This is well defined for any positive integer value (and negative values are guarded against).
es_un: Para ser más rigurosos y evitar el comportamiento mal definido al proporcionar números *impares* para ``num_spin_orbitals``, hemos cambiado toda la pila para usar ``num_spatial_orbitals`` en su lugar. Esto está bien definido para cualquier valor entero positivo (y los valores negativos están protegidos).
ja: より厳密に、そして ``num_spin_orbitals`` に *奇数* を指定した場合の非定義な動作を避けるために、代わりに ``num_spatial_orbitals`` を使用するようにスタック全体を切り替えたのです。これは、任意の正の整数値に対してうまく定義されています（負の値もガードされています）。

source: What this means for you in practice, is that whenever you supply the ``num_spin_orbitals`` manually in the past, you now need to supply **half the value** to represent the ``num_spatial_orbitals``.
es_un: Lo que esto significa para ti en la práctica es que cada vez que proporcionabas ``num_spin_orbitals`` manualmente en el pasado, ahora necesitas proporcionar **la mitad del valor** para representar ``num_spatial_orbitals``.
ja: このことが実際に何を意味するかというと、これまで ``num_spin_orbitals`` を手動で指定していた場合は、``num_spatial_orbitals`` を表すために **半分の値** を指定する必要がある、ということです。

source: Previously
es_un: Previamente
ja: 以前

source: New
es_un: Nuevo

source: UCC/UVCC ``__init__`` arguments
es_un: argumentos UCC/UVCC ``__init__``
ja: UCC/UVCC ``__init__`` 引数

source: The ``UCC`` and ``UVCC`` subclasses used to take the following arguments for their ``__init__``:
es_un: Las subclases ``UCC`` y ``UVCC`` solían tomar los siguientes argumentos para su ``__init__``:
ja: ``UCC`` と ``UVCC`` のサブクラスは、これまで ``__init__`` に次のような引数を取っていました。

source: This was mismatching the API of the ``HartreeFock`` and ``VSCF`` initial states. We have aligned these APIs to look like in the following:
es_un: Esto no coincidía con la API de los estados iniciales ``HartreeFock`` y ``VSCF``. Hemos alineado estas API para que se parezcan a lo siguiente:
ja: これは ``HartreeFock`` と ``VSCF`` の初期状態のAPIをミスマッチさせていました。これらのAPIを以下のように揃えました。

source: HartreeFock/VSCF initial states
es_un: Estados iniciales de HartreeFock/VSCF
ja: HartreeFock/VSCF 初期状態

source: The ``HartreeFock`` and ``VSCF`` initial state circuits are now implemented as ``BlueprintCircuit``. That means, that you can initialize them without any arguments and supply the information later as shown below:
es_un: Los circuitos de estado inicial ``HartreeFock`` y ``VSCF`` ahora se implementan como ``BlueprintCircuit``. Eso significa que puedes inicializarlos sin ningún argumento y proporcionar la información más adelante como se muestra a continuación:
ja: ``HartreeFock`` と ``VSCF`` の初期状態回路は、 ``BlueprintCircuit`` として実装されました。つまり、以下のように引数なしで初期化し、後で情報を与えることができます。

source: The algorithms in Qiskit Nature have been updated to use the new ``qiskit.algorithms`` components which are based on the ``qiskit.primitives`` as of Qiskit Terra 0.22.
es_un: Los algoritmos en Qiskit Nature se han actualizado para usar los nuevos componentes ``qiskit.algorithms`` que se basan en ``qiskit.primitives`` a partir de Qiskit Terra 0.22.
ja: Qiskit Natureのアルゴリズムは、Qiskit Terra 0.22から ``qiskit.primitives`` をベースにした新しいコンポーネント ``qiskit.algorithms`` を使用するように更新されました。

source: For most changes to take effect, you can once again simply update your import paths from ``qiskit_nature.algorithms`` to ``qiskit_nature.second_q.algorithms``. However, there are some details which you need to pay attention to, due to the change to the primitive-based algorithms of Qiskit Terra being used under the hood. These details are explained below.
es_un: Para que la mayoría de los cambios surtan efecto, puedes volver a actualizar tus rutas de importación de ``qiskit_nature.algorithms`` a ``qiskit_nature.second_q.algorithms``. Sin embargo, hay algunos detalles a los que debes prestar atención, debido al cambio en los algoritmos basados en primitivas de Qiskit Terra que se utilizan tras bambalinas. Estos detalles se explican a continuación.
ja: ほとんどの変更は、インポートパスを ``qiskit_nature.algorithms`` から ``qiskit_nature.second_q.algorithms`` に更新するだけで適用されます。しかし、Qiskit Terraのprimitiveアルゴリズムが変更されたため、注意しなければならない点がいくつかあります。これらの詳細については、以下で説明します。

source: This module was moved to ``qiskit_nature.second_q.algorithms.initial_points``. All you need to do is update your imports.
es_un: Este módulo se movió a ``qiskit_nature.second_q.algorithms.initial_points``. Todo lo que necesitas hacer es actualizar tus importaciones.
ja: このモジュールは ``qiskit_nature.second_q.algorithms.initial_points`` へと移動しました。必要なことは、インポートを更新することだけです。

source: This module was **removed** without a replacement. The reason for that, is that we are working towards a driver-less design of Qiskit Nature, in which case the sampling of the potential energy surface becomes the responsibility of the classical code rather than Qiskit Nature.
es_un: Este módulo se **eliminó** sin reemplazarlo. La razón de esto es que estamos trabajando hacia un diseño sin controlador (driver) de Qiskit Nature, en cuyo caso el muestreo de la superficie de energía potencial se convierte en responsabilidad del código clásico en lugar de Qiskit Nature.
ja: このモジュールは置き換えられることなく、 **削除** されました。その理由は、私達はQiskit Natureのドライバーレス設計に取り組んでいるため、ポテンシャルエネルギー面のサンプリングはQiskit Natureではなく、古典的なコードの責任となるためです。

source: This module was moved to ``qiskit_nature.second_q.algorithms.ground_state_solvers``. Besides updating your imports, you need to pay attention to the following:
es_un: Este módulo se movió a ``qiskit_nature.second_q.algorithms.ground_state_solvers``. Además de actualizar tus importaciones, debes prestar atención a lo siguiente:
ja: このモジュールは ``qiskit_nature.second_q.algorithms.ground_state_solvers`` へと移動しました。インポートの更新の他に、以下のことに注意する必要があります。

source: ``AdaptVQE`` was migrated to Qiskit Terra: ``qiskit.algorithms.minimum_eigensolver.AdaptVQE``. In doing so, this is no longer a ``GroundStateSolver`` but rather became a ``MinimumEigensolver`` which means that you would use it like any other ``VQE`` and inject it **into** a ``GroundStateSolver`` of Qiskit Nature. To see the new ``AdaptVQE`` in action, check out the `How to use the AdaptVQE <../howtos/adapt_vqe.rst>`__.
es_un: ``AdaptVQE`` se migró a Qiskit Terra: ``qiskit.algorithms.minimum_eigensolver.AdaptVQE``. Al hacerlo, ya no es un ``GroundStateSolver`` sino que se convirtió en un ``MinimumEigensolver``, lo que significa que lo usarías como cualquier otro ``VQE`` y lo inyectarías **dentro** de un ``GroundStateSolver`` de Qiskit Nature. Para ver el nuevo ``AdaptVQE`` en acción, consulta `Cómo usar el AdaptVQE <../howtos/adapt_vqe.rst>`__.
ja: ``AdaptVQE`` は Qiskit Terra: ``qiskit.algorithms.minimum_eigensolver.AdaptVQE`` に移行されました。つまり、他の ``VQE`` と同様に使用し、Qiskit Nature の ``GroundStateSolver`` **に** インジェクションできるようになりました。新しい ``AdaptVQE`` の動作を見るには、``AdaptVQEの使用方法 <../howtos/adapt_vqe.rst>`__ をチェックしてください。

source: the API of the ``VQEUCCFactory`` and ``VQEUVCCFactory`` has been matched with the new primitive-based ``VQE`` API
es_un: la API de ``VQEUCCFactory`` y ``VQEUVCCFactory`` se ha emparejado con la nueva API de ``VQE`` basada en primitivas
ja: ``VQEUCCFactory`` と ``VQEUVCCFactory`` の API は、新しいprimitiveベースの ``VQE`` API と一致するようになりました。

source: This module was moved to ``qiskit_nature.second_q.algorithms.excited_states_solvers``. Besides updating your imports, you need to pay attention to the following:
es_un: Este módulo se movió a ``qiskit_nature.second_q.algorithms.excited_states_solvers``. Además de actualizar tus importaciones, debes prestar atención a lo siguiente:
ja: このモジュールは ``qiskit_nature.second_q.algorithms.excited_states_solvers`` へと移動しました。インポートの更新の他に、以下のことに注意する必要があります。

source: the ``QEOM`` API now also requires an `Estimator primitiver <https://qiskit.org/documentation/stubs/qiskit.primitives.BaseEstimator.html>`__ to be provided
es_un: la API de ``QEOM`` ahora también requiere que se proporcione una `primitiva Estimator <https://qiskit.org/documentation/stubs/qiskit.primitives.BaseEstimator.html>`__
ja: ``QEOM`` API は、提供される `Estimator primitiver <https://qiskit.org/documentation/stubs/qiskit.primitives.BaseEstimator.html>`__ が必要です。
