Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/migration/00c_Vibrational_structure_with_v0.5.po
Languages: ta

source: This page was generated from `docs/migration/00c_Vibrational_structure_with_v0.5.ipynb`__.
ta: இந்தப் பக்கம் `docs/migration/00c_Vibrational_structure_with_v0.5.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Vibrational Structure Problems with v0.5
ta: V0.5 உடன் அதிர்வு கட்டமைப்பு சிக்கல்கள்

source: Table of Contents
ta: பொருளடக்கம்

source: The vibrational structure stack has also received significant updates between Qiskit Nature v0.4 and v0.5. Thus, this file is split into multiple sections that go into various amounts of details. Here is a table of contents to help you navigate:
ta: அதிர்வு கட்டமைப்பு அடுக்கு Qiskit Nature v0.4 மற்றும் v0.5 இடையே குறிப்பிடத்தக்க புதுப்பிப்புகளையும் பெற்றுள்ளது. எனவே, இந்தக் கோப்பு பல பிரிவுகளாகப் பிரிக்கப்பட்டுள்ளது, அவை பல்வேறு அளவு விவரங்களுக்குச் செல்கின்றன. வழிசெலுத்த உதவும் உள்ளடக்க அட்டவணை இங்கே:

source: `The VibrationalStructureProblem (qiskit_nature.problems) <#The-VibrationalStructureProblem-(qiskit_nature.problems)>`__
ta: `அதிர்வுக் கட்டமைப்பு பிரச்சனை (qiskit_nature.problems) <#The-VibrationalStructureProblem-(qiskit_nature.problems)>`__

source: Further resources
ta: மேலும் வளங்கள்

source: Be sure to check out the `vibrational structure tutorial <../tutorials/02_vibrational_structure.ipynb>`__ for more details on how to use the new code.
ta: புதிய குறியீட்டை எவ்வாறு பயன்படுத்துவது என்பது பற்றிய கூடுதல் விவரங்களுக்கு `அதிர்வுக் கட்டமைப்பு பயிற்சி <../tutorials/02_vibrational_structure.ipynb>`__ ஐப் பார்க்கவும்.

source: This section gives you one cell with a v0.4 code followed by one cell with v0.5 code doing the same things. Hopefully this already gives you all the information which you were looking for.
ta: இந்தப் பிரிவு உங்களுக்கு v0.4 குறியீட்டைக் கொண்ட ஒரு கலத்தையும், அதைத் தொடர்ந்து v0.5 குறியீட்டைக் கொண்ட ஒரு கலத்தையும் வழங்குகிறது. நீங்கள் தேடும் அனைத்து தகவல்களையும் இது ஏற்கனவே உங்களுக்கு வழங்கும் என்று நம்புகிறேன்.

source: Previously
ta: முன்பு

source: New
ta: புதியது

source: This section deals exclusively with the migration of the vibrational structure-related drivers.
ta: இந்தப் பிரிவு அதிர்வுக் கட்டமைப்பு தொடர்பான இயக்கிகளின் இடம்பெயர்வு பற்றி பிரத்தியேகமாகக் கையாள்கிறது.

source: The table below summarizes where each of the vibrational structure components of ``qiskit_nature.drivers.second_quantization`` has ended up.
ta: ``qiskit_nature.drivers.second_quantization`` இன் அதிர்வு கட்டமைப்பு கூறுகள் ஒவ்வொன்றும் எங்கு முடிந்தது என்பதை கீழே உள்ள அட்டவணை சுருக்கமாகக் கூறுகிறது.

source: Legacy component
ta: மரபு கூறு

source: New location
ta: புதிய இடம்

source: BaseDriver
ta: அடிப்படை இயக்கி

source: VibrationalStructureDriver
ta: அதிர்வு கட்டமைப்பு இயக்கி

source: VibrationalStructureDriverType
ta: அதிர்வு கட்டமைப்பு இயக்கி வகை

source: **removed**
ta: **அகற்றப்பட்டது**

source: VibrationalStructureMoleculeDriver
ta: அதிர்வு கட்டமைப்பு மூலக்கூறு இயக்கி

source: GaussianForcesDriver
ta: காஸியன்ஃபோர்சஸ் டிரைவர்

source: GaussianLogDriver
ta: காஸியன்பதிவுஇயக்கி

source: GaussianLogResult
ta: காஸியன்பதிவுமுடிவு

source: Furthermore, the two components from ``qiskit_nature.drivers`` were moved like so:
ta: மேலும், ``qiskit_nature.drivers`` இலிருந்து இரண்டு கூறுகளும் இவ்வாறு நகர்த்தப்பட்டன:

source: Molecule
ta: மூலக்கூறு

source: UnitsType
ta: யூனிட்ஸ் வகை

source: A few notes are worth adding:
ta: சில குறிப்புகளைச் சேர்ப்பது மதிப்பு:

source: The ``VibrationalStructureMoleculeDriver`` was removed because we are steering towards a future with tighter, plugin-like integration with classical codes, making the concept of drivers where Qiskit starts a classical simulation outdated. You can still use the ``.from_molecule(...)`` methods of the remaining drivers in combination with the ``MoleculeInfo`` class.
ta: ``VibrationalStructureMoleculeDriver` அகற்றப்பட்டது, ஏனெனில் நாங்கள் இறுக்கமான, செருகுநிரல் போன்ற கிளாசிக்கல் குறியீடுகளுடன் ஒரு எதிர்காலத்தை நோக்கிச் செல்கிறோம், இதனால் Qiskit கிளாசிக்கல் சிமுலேஷனைத் தொடங்கும் இயக்கிகளின் கருத்து காலாவதியானது. மீதமுள்ள இயக்கிகளின் ``.from_molecule(...)`` முறைகளை ``MoleculeInfo`` வகுப்போடு சேர்த்து நீங்கள் இன்னும் பயன்படுத்தலாம்.

source: The ``MoleculeInfo`` has become a pure data container and no longer supports *degrees of freedom*.
ta: ``MoleculeInfo`` ஒரு தூய தரவுக் கொள்கலனாக மாறியுள்ளது மேலும் இனி *சுதந்திரத்தின் அளவுகளை* ஆதரிக்காது.

source: Vibrational Structure Drivers
ta: அதிர்வு கட்டமைப்பு இயக்கிகள்

source: Vibrational structure drivers work slightly differently than their electronic structure counterparts, because you must supply a **basis** upon running the driver, which maps the real-space Watson hamiltonian into second-quantized space. This was treated inconsistently in Qiskit Nature v0.4 as explained below.
ta: அதிர்வு கட்டமைப்பு இயக்கிகள் அவற்றின் மின்னணு கட்டமைப்பை விட சற்றே வித்தியாசமாக வேலை செய்கின்றன, ஏனெனில் இயக்கியை இயக்கும்போது நீங்கள் **அடிப்படை** வழங்க வேண்டும், இது நிஜ-வெளியான வாட்சன் ஹாமில்டோனியனை இரண்டாவது-அளவிடப்பட்ட இடத்திற்கு வரைபடமாக்குகிறது. இது கீழே விளக்கப்பட்டுள்ளபடி Qiskit Nature v0.4 இல் சீரற்ற முறையில் கையாளப்பட்டது.

source: In Qiskit Nature v0.4 the stack implementation was actually inconsistent because the ``VibrationalIntegrals`` (which were part of the ``second_quantization`` stack) were actually storing the coefficients of the real-space Watson hamiltonian. Only later would these get mapped to a specified basis:
ta: கிஸ்கிட் நேச்சர் v0.4 இல், ஸ்டேக் செயலாக்கம் உண்மையில் சீரற்றதாக இருந்தது, ஏனெனில் ``அதிர்வு ஒருங்கிணைப்புகள்`` (`இரண்டாவது_குவாண்டிசேஷன்`` அடுக்கின் ஒரு பகுதியாக இருந்தது) உண்மையில் உண்மையான விண்வெளி வாட்சன் ஹாமில்டோனியனின் குணகங்களைச் சேமித்து வைத்திருந்தது. பின்னர் மட்டுமே இவை ஒரு குறிப்பிட்ட அடிப்படையில் வரைபடமாக்கப்படும்:

source: As of Qiskit Nature v0.5 the design is now consistently separating the treatment of the real-space Watson hamiltonian from the second-quantized coefficients. This is achieved by introducing a dedicated dataclass storing a ``WatsonHamiltonian``:
ta: Qiskit Nature v0.5 இன் படி, வடிவமைப்பு இப்போது ரியல்-ஸ்பேஸ் வாட்சன் ஹாமில்டோனியனின் சிகிச்சையை இரண்டாவது-அளவிடப்பட்ட குணகங்களிலிருந்து தொடர்ந்து பிரிக்கிறது. இது ஒரு ``வாட்சன் ஹாமில்டோனியன்`` சேமிக்கும் பிரத்யேக தரவு வகுப்பை அறிமுகப்படுத்துவதன் மூலம் அடையப்படுகிறது:

source: The ``VibrationalStructureProblem`` (``qiskit_nature.problems``)
ta: ``அதிர்வு கட்டமைப்புப் பிரச்சனை`` (``qiskit_nature.problems``)

source: This section details all the changes around the ``VibrationalStructureProblem``.
ta: இந்தப் பிரிவு ``அதிர்வு கட்டமைப்புப் பிரச்சனை``யைச் சுற்றியுள்ள அனைத்து மாற்றங்களையும் விவரிக்கிறது.

source: The table below summarizes the vibrational components of the **new** ``qiskit_nature.second_q.problems`` module, and shows from where these parts originated in the old code:
ta: கீழே உள்ள அட்டவணையானது **புதிய** ``qiskit_nature.second_q.problems`` தொகுதியின் அதிர்வு கூறுகளை சுருக்கி, பழைய குறியீட்டில் இந்தப் பகுதிகள் எங்கிருந்து உருவானது என்பதைக் காட்டுகிறது:

source: New component
ta: புதிய கூறு

source: Legacy location
ta: மரபு சார்ந்த இடம்

source: ``BaseProblem``
ta: ``அடிப்படைப் பிரச்சனை``

source: ``PropertiesContainer``
ta: ``பண்புகள் கொள்கலன்``

source: similar to ``qiskit_nature.properties.GroupedProperty``
ta: ``qiskit_nature.properties.GroupedProperty`` போன்றது

source: ``VibrationalBasis``
ta: ``அதிர்வு அடிப்படை``

source: ``HarmonicBasis``
ta: ``ஹார்மோனிக் அடிப்படை``

source: ``VibrationalStructureProblem``
ta: ``அதிர்வு கட்டமைப்புப் பிரச்சனை``

source: ``VibrationalPropertiesContainer``
ta: ``அதிர்வு பண்புகள் கொள்கலன்``

source: *did not exist yet*
ta: *இன்னும் இல்லை*

source: ``VibrationalStructureResult``
ta: ``அதிர்வு கட்டமைப்பு முடிவு``

source: For more information on the new and improved ``VibrationalStructureProblem``, please refer to the `vibrational structure tutorial <../tutorials/02_vibrational_structure.ipynb>`__.
ta: புதிய மற்றும் மேம்படுத்தப்பட்ட ``அதிர்வு கட்டமைப்புப் பிரச்சனை`` பற்றிய கூடுதல் தகவலுக்கு, `அதிர்வு கட்டமைப்பு பயிற்சி <../tutorials/02_vibrational_structure.ipynb>`__ ஐப் பார்க்கவும்.

source: The properties module has been refactored and split into multiple locations. In this section, we will only be focusing on its *vibrational* components.
ta: பண்புகள் தொகுதி மறுவடிவமைக்கப்பட்டு பல இடங்களில் பிரிக்கப்பட்டுள்ளது. இந்த பிரிவில், நாம் அதன் *அதிர்வு* கூறுகளில் மட்டுமே கவனம் செலுத்துவோம்.

source: The following table lists where each component of ``qiskit_nature.properties`` has been moved to.
ta: ``qiskit_nature.properties`` இன் ஒவ்வொரு கூறுகளும் எங்கு நகர்த்தப்பட்டுள்ளன என்பதை பின்வரும் அட்டவணை பட்டியலிடுகிறது.

source: ``Property``
ta: "பண்பு"

source: succeeded by ``qiskit_nature.second_q.operators.VibrationalIntegrals``
ta: ``qiskit_nature.second_q.operators.VibrationalIntegrals`` மூலம் வெற்றி பெற்றது

source: We suggest that you look at the `vibrational structure tutorial <../tutorials/02_vibrational_structure.ipynb>`__ for more in-depth explanations, but we will leave a few comments here:
ta: மேலும் ஆழமான விளக்கங்களுக்கு `அதிர்வு கட்டமைப்பு பயிற்சி <../tutorials/02_vibrational_structure.ipynb>`__ ஐப் பார்க்குமாறு நாங்கள் பரிந்துரைக்கிறோம், ஆனால் நாங்கள் சில கருத்துகளை இங்கே விடுவோம்:

source: the ``VibrationalBasis`` is now only tracked on the ``VibrationalStructureProblem`` and not for each operator individually
ta: ``அதிர்வு அடிப்படை`` இப்போது ``அதிர்வு கட்டமைப்புப் பிரச்சனை`` இல் மட்டுமே கண்காணிக்கப்படுகிறது, ஒவ்வொரு ஆபரேட்டருக்கும் தனித்தனியாக அல்ல

source: the ``VibrationalEnergy`` (which has always been a_special\_ ``Property``) is in the new ``second_q.hamiltonians`` module to highlight this special role
ta: இந்த சிறப்புப் பாத்திரத்தை முன்னிலைப்படுத்த ``அதிர்வு ஆற்றல்`` (இது எப்போதும் ஒரு_சிறப்பு\_ ``சொத்து``) புதிய ``second_q.hamiltonians`` தொகுதியில் உள்ளது
