Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/faqs/max_execution_time.po
Languages: es_un, fr, ja, ko, pt_un

source: What is the maximum execution time for a Qiskit Runtime job or session?
ja: Qiskit Runtime ジョブの最大実行時間はどれくらいですか？

source: Job maximum execution time
ja: ジョブの最大実行時間

source: To ensure fairness, and as a way to help control cost, there is a maximum execution time for each Qiskit Runtime job. If a job exceeds this time limit, it is forcibly cancelled and a ``RuntimeJobMaxTimeoutError`` exception is raised.
ja: 公平性を確保し、コストを管理する方法として、Qiskit Runtime ジョブごとに最大の実行時間があります。 ジョブがこの時間制限を超えた場合、強制的にキャンセルされ、 ``RuntimeJobMaxTimeoutError`` 例外が発生します。

source: As of August 7, 2023, the ``max_execution_time`` value is based on system execution time, which is the time that the QPU complex (including control software, control electronics, QPU, and so on) is engaged in processing the job, instead of wall clock time.
ja: 2023年8月7日現在、 ``max_execution_time`` 値は、壁の時計の時間ではなく、QPUコンプレックス（制御ソフトウェア、制御電子機器、QPUなどを含む）がジョブ処理に従事している時間であるシステム実行時間に基づいています。

source: Simulator jobs continue to use wall clock time.
ja: シミュレータージョブは壁の時計の時間を引き続き使用します。

source: You can set the maximum execution time (in seconds) on the job options by using one of the following methods:
ja: ジョブオプションでは、次のいずれかのメソッドを使用して、最大実行時間(秒単位) を設定できます：

source: You can also find the system execution time for previously completed jobs by using:
ja: また、以前に完了したジョブのシステム実行時間を以下のように確認できます。

source: In addition, the system calculates an appropriate job timeout value based on the input circuits and options. This system-calculated timeout is currently capped at 3 hours to ensure fair device usage. If a ``max_execution_time`` is also specified for the job, the lesser of the two values is used.
ja: さらに、システムは入力回路とオプションに基づいて、適切なジョブタイムアウト値を計算します。このシステムによって計算されたタイムアウト時間は、公平なデバイスの使用を保証するために、現在3時間が上限とされています。ジョブに ``max_execution_time`` も指定されている場合は、2つの値のうち小さい方が使用されます。

source: For example, if you specify ``max_execution_time=5000``, but the system determines it should not take more than 5 minutes (300 seconds) to execute the job, then the job will be cancelled after 5 minutes.
ja: 例えば、 ``max_execution_time=5000`` を指定したとします。しかし、ジョブの実行に5分（300秒）以上かかってはならないとシステムが判断した場合、ジョブは5分後にキャンセルされます。

source: Session time limits
ja: Session の制限時間

source: When a session is started, it is assigned a maximum session timeout value. After this timeout is reached, the session is terminated, any jobs that are already running continue running, and any queued jobs that remain in the session are put into a ``failed`` state. You can set the maximum session timeout value using the ``max_time`` parameter:
ja: Session が開始されると、session のタイムアウトの最大値が割り当てられれます。このタイムアウトに達すると、session は終了し、すでに実行されているジョブ は実行を継続し、session に残っているキューに入れられたジョブは ``failed`` 状態になります。Session タイムアウトの最大値は ``max_time`` パラメーターで設定することができます：

source: If you don't specify a session ``max_time``, the system defaults are used (see table below).
ja: Session ``max_time`` を指定しない場合、システムのデフォルト値が使用されます (下の表を参照)。

source: Additionally, there is an *interactive* timeout value. If there are no session jobs queued within that window, the session is temporarily deactivated and normal job selection resumes. During job selection, if the job scheduler gets a new job from the session and its maximum timeout value has not been reached, the session is reactivated until its maximum timeout value is reached. The interactive timeout value is based on the plan type:
ja: さらに、 *インタラクティブ* タイムアウト値もあります。そのウィンドウ内にキューに入れられたsession ジョブがない場合、session は一時的に非アクティブになり、通常のジョブ選択が再開されます。ジョブ選択中、ジョブスケジューラが session から新しいジョブを取得し、その最大タイムアウト値に達していない場合、その session は最大タイムアウト値に達するまで再活性化されます。インタラクティブ・タイムアウト値は、プランのタイプに基づきます：

source: The timer for the session's ``max_time`` is not paused during any temporary deactivation periods.
ja: Session の ``max_time`` のタイマーは一時的な非アクティブ化期間中は一時停止されません。

source: Primitive programs
ja: Primitive プログラム

source: Private programs
ja: プライベート・プログラム

source: Premium or Cloud user
ja: プレミアムまたはクラウドユーザー

source: Open user
ja: オープン・ユーザー

source: Premium user
ja: プレミアムユーザー

source: Max time defaults
ja: 最大時間のデフォルト

source: 8h
ja: 8時間
ko: 8시간

source: 15m
ja: 15分

source: Interactive timeout
ja: インタラクティブ・タイムアウト

source: 5m
ja: 5分

source: 2s
ja: 2秒

source: Note that a *premium user* here means an IBM Quantum channel user who has access to backends in instances other than ``ibm-q/open/main``. A *Cloud user* here means an IBM Qiskit Runtime Cloud Standard plan user.
ja: *プレミアムユーザー* は、 ``ibm-q/open/main`` 以外のインスタンスでバックエンドにアクセスできる IBM Quantum チャネルユーザーを意味します。 *クラウドユーザー* とは、IBM Qiskit Runtime Cloud Standardプランユーザーを意味します。

source: Session ``max_time`` is based on wall clock time.
ja: Session ``max_time`` は壁の時計の時間に基づいています。

source: Other limitations
es_un: Otras limitaciones
ja: その他の制限事項

source: Programs cannot exceed 750KB in size.
es_un: Los programas no pueden superar los 750 KB de tamaño.
fr: Les programmes ne peuvent pas dépasser 750Ko de taille.
ja: プログラムのサイズは 750KB を超えてはなりません
ko: 프로그램의 크기는 750 KB를 초과할 수 없다.
pt_un: Programas não podem exceder 750KB em tamanho.

source: Inputs to jobs cannot exceed 64MB in size.
es_un: Las entradas a los trabajos no pueden exceder los 64 MB de tamaño.
fr: Les entrées sur les jobs ne peuvent pas dépasser 64 Mo.
ja: ジョブへの入力のサイズは64MBを超えることはできません。
ko: 작업에 대한 입력의 크기는 64 MB를 초과할 수 없다.
pt_un: Entradas para jobs não podem exceder 64MB em tamanho.

source: Open plan users can use up to 10 minutes of system execution time per month (resets at 00:00 UTC on the first of each month). System execution time is the amount of time that the system is dedicated to processing your job. You can track your monthly usage on the `Platform dashboard, <https://quantum-computing.ibm.com/>`__ `Jobs, <https://quantum-computing.ibm.com/jobs>`__ and `Account <https://quantum-computing.ibm.com/account>`__ pages.
ja: オープンプランのユーザーは、毎月10分までのシステム実行時間を使用できます（毎月1日のUTC 00:00にリセットされます）。システム実行時間とは、システムがジョブの処理に専念している時間のことです。 `Platform dashboard, <https://quantum-computing.ibm.com/>`__ `Jobs, <https://quantum-computing.ibm.com/jobs>`__ 、 `Account <https://quantum-computing.ibm.com/account>`__ ページで、毎月の使用量を確認することができます。

source: What is the maximum execution time for a Qiskit Runtime job?
es_un: ¿Cuál es el tiempo máximo de ejecución para un trabajo de Qiskit Runtime?
fr: Quel est le temps d'exécution maximum pour une tâche Qiskit Runtime?
ko: Qiskit Runtime 작업의 최대 실행 시간은 얼마인가?
pt_un: Qual o tempo máximo de execução para um job do Qiskit Runtime?

source: To ensure fairness, there is a maximum execution time for each Qiskit Runtime job. If a job exceeds this time limit, it is forcibly cancelled. This is represented in the job status as `Cancelled - Ran too long`. The maximum execution time is the smaller of 1) the system limit and 2) the ``max_execution_time`` defined by the program. The system limit is defined below:
ko: 공정성을 보장하기 위해 Qiskit Runtime 작업에 대한 최대 실행 시간이 있다. 작업이 이 시간 제한을 초과하면 강제로 취소된다. 이것은 작업 상태에서 `Cancelled - Ran too long` 으로 표시된다. 최대 실행 시간은 1) 시스템 제한과 2) 프로그램에 의해 정의된 ``max_execution_time`` 보다 작다. 시스템 제한은 아래에 정의되어 있다:
pt_un: Para garantir a imparcialidade, há um tempo máximo de execução para cada job do Qiskit Runtime. Se um job exceder esse limite de tempo, ele será cancelado à força. Isso é representado no status do trabalho como 'Cancelado - Executado por muito tempo'. O tempo máximo de execução é o menor entre 1) o limite do sistema e 2) o ``max_execution_time`` definido pelo programa. O limite do sistema é definido abaixo:

source: Qiskit Runtime on IBM Cloud
es_un: Qiskit Runtime en IBM Cloud
fr: Qiskit Runtime sur IBM Cloud
ko: IBM Cloud의 Qiskit Runtime
pt_un: Qiskit Runtime na IBM Cloud

source: The system limit on the job execution time is 3 hours for a job running on a simulator and 8 hours for a job running on a physical system.
es_un: El límite del sistema del tiempo de ejecución del trabajo es de 3 horas para un trabajo que se ejecuta en un simulador y de 8 horas para un trabajo que se ejecuta en un sistema físico.
fr: La limite du temps d'exécution de la tâche du système est de 3 heures pour une tâche fonctionnant sur un simulateur et de 8 heures pour une tâche fonctionnant sur un système physique.
ko: 작업 실행 시간의 시스템 제한은 시뮬레이터에서 수행되는 작업의 경우 3시간이고, 실제 시스템에서 수행되는 작업의 경우 8시간이다.
pt_un: O limite de tempo de execução do job no sistema é de 3 horas para um job executado em um simulador e 8 horas para um job executado em um sistema físico.

source: Qiskit Runtime on IBM Quantum
es_un: Qiskit Runtime en IBM Quantum
fr: Qiskit Runtime sur IBM Quantum
ko: IBM Quantum에서 Qiskit Runtime
pt_un: Qiskit Runtime no IBM Quantum

source: The system limit on the job execution time is
es_un: El límite del sistema del tiempo de ejecución del trabajo es
fr: La limite du système sur le temps d'exécution du travail est
ko: 작업 실행 시간의 시스템 제한은 다음과 같다.
pt_un: O limite do sistema no tempo de execução do job é

source: Public Program
es_un: Programa Público
fr: Programme public
ko: 공개 프로그램
pt_un: Programa Público

source: Private Program
es_un: Programa Privado
fr: Programme privé
ko: 비공개 프로그램
pt_un: Programa Privado

source: Premium User
es_un: Usuario Premium
fr: Utilisateur Premium
ko: 프리미엄 사용자
pt_un: Usuário Premium

source: Open User
es_un: Usuario Libre
fr: Utilisateur Open
ko: 일반 사용자
pt_un: Usuário Aberto

source: Simulated Device
es_un: Dispositivo Simulado
fr: Appareil simulé
ko: 시뮬레이터
pt_un: Dispositivo Simulado

source: 3h
ko: 3시간

source: 1h
ko: 1시간

source: Real Device
es_un: Dispositivo Real
fr: Appareil réel
ko: 실제 장치
pt_un: Dispositivo Real

source: 4h
ko: 4시간

source: 2h
ko: 2시간

source: Note that a *premium user* here means a user who has access to backends in providers other than ibm-q/open/main.
es_un: Ten en cuenta que un *usuario premium* aquí significa un usuario que tiene acceso a backends en proveedores que no estén en ibm-q/open/main.
fr: Notez qu'un *utilisateur premium* signifie ici un utilisateur qui a accès aux backends de fournisseurs autres que ibm-q/open/main.
ko: 여기서 *프리미엄 사용자* 는 ibm-q/open/main 이외의 백엔드에 액세스 권한을 가진 사용자이다.
pt_un: Observe que um *usuário premium* aqui significa um usuário que tem acesso a backends em provedores diferentes de ibm-q/open/main.

source: Other Limitations
ko: 기타 제한 사항
pt_un: Outras Limitações

source: To ensure fairness, there is a maximum execution time for each Qiskit Runtime job. If a job exceeds this time limit, it is forcibly cancelled. This is represented in the job status as `Cancelled - Ran too long`. The maximum execution time is the smaller of 1) the system limit and 2) the ``max_execution_time`` defined by the program. The system limit is defined as follows:
es_un: Para garantizar la equidad, existe un tiempo máximo de ejecución para cada trabajo (job) de Qiskit Runtime. Si un trabajo excede este límite de tiempo, se cancela a la fuerza. Esto se representa en el estado del trabajo como `Cancelado: se ejecutó por demasiado tiempo` (`Cancelled - Ran too long`). El tiempo máximo de ejecución es el menor de 1) el límite del sistema y 2) el ``max_execution_time`` definido por el programa. El límite del sistema se define de la siguiente manera:
