Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/pulse/1_getting_started_with_pulse.po
Languages: fr_fr, ja_jp, ko_kr, pt_br

source: There are multiple ways to build pulses, which you can learn about on later pages. This time, we've simply passed the exact amplitudes of the pulse envelope we want to play as an array. The array above is a Gaussian function evaluated at 64 points, with an amplitude of 1 and a standard deviation of 8. The (zero-indexed) :math:`i^{th}` sample will play from time ``i*dt`` up to ``(i + 1)*dt``, modulated by the qubit frequency. Think of this like an arbitrary waveform generator (AWG), playing the samples you give to the ``SamplePulse``, mixed with a continuous sine wave generator outputting a tone at the qubit frequency.
ja_jp: パルスを構築する方法は複数あり、後のページで学習することができます。今回は単に、実行したいパルスエンベロープの正確な振幅を、配列として渡しました。上記の配列は、64ポイントで評価されたガウス関数で、振幅は1、標準偏差は8です。（ゼロからインデックス付けされた） :math:`i^{th}` 番目のサンプルは、時間 ``i*dt`` から ``(i + 1)*dt`` まで実行され、量子ビット周波数により変調されます。これを任意波形発生器（arbitrary waveform generator、AWG）と考えて、 ``SamplePulse`` に与えたサンプルを実行し、量子ビット周波数でトーンを出力する連続正弦波発生器と混合します。
