Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/pulse/1_getting_started_with_pulse.po
Languages: fr_fr, ja_jp, ko_kr, pt_br

source: This page was generated from `tutorials/pulse/1_getting_started_with_pulse.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/pulse/1_getting_started_with_pulse.ipynb`__.
ja_jp: 当ページは `tutorials/pulse/1_getting_started_with_pulse.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/pulse/1_getting_started_pulse.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada, a partir do `tutorials/circuits/1_getting_started_with_qiskit.ipynb`__.

source: Getting Started with OpenPulse
fr_fr: Démarrer avec OpenPulse
ja_jp: OpenPulse入門
ko_kr: OpenPulse 시작하기
pt_br: Primeiros passos com OpenPulse

source: Qiskit Pulse programs give you more control than ``QuantumCircuit``. At this level, you can specify the exact time dynamics of the input signals across all input channels. Most quantum algorithm can be described with circuits alone using gate operations -- typically, it's when you want to apply error mitigation techniques or characterize a time-dependent quality of a quantum system that pulse-level control becomes useful.
fr_fr: Les programmes Qiskit Pulse vous donnent plus de contrôle que ` ` QuantumCircuit ` `. A ce niveau, vous pouvez spécifier la dynamique de temps exacte des signaux d'entrée sur tous les canaux d'entrée. La plupart des algorithmes quantiques peuvent être généralement décrits avec des circuits qui utilisent seulement des portes (opérations). C'est lorsque vous voulez appliquer des techniques d'atténuation d'erreurs ou caractériser une qualité dépendante du temps d'un système quantique, que le contrôle au niveau des pulses devient utile.
ja_jp: Qiskit Pulse プログラムは ``QuantumCircuit`` よりも多くのコントロールを提供します。このレベルでは、すべての入力チャンネルで入力信号の正確な時間ダイナミクスを指定できます。ほとんどの量子アルゴリズムは、ゲート操作を使った回路だけで記述することができます。－通常、パルスレベル制御が役立つのは、誤り軽減技術を適用するとき、または量子系の時間依存品質を特徴付けるときです。
ko_kr: Qiskit Pulse 프로그램은 ``QuantumCircuit`` 보다 더 많은 제어권을 제공한다. 이 수준에서 모든 입력 채널에 걸쳐 입력 신호의 정확한 시간 역학을 지정할 수 있다. 대부분의 양자 알고리즘은 게이트 연산을 사용하여 회로만으로 설명할 수 있지만 -- 특별히 에러 완화 기법을 적용하거나 양자 시스템의 시간 의존적 특성을 알고 싶을 때 펄스 수준 제어가 유용해진다.
pt_br: O Programa Qiskit Pulse oferece mais controle do que ``QuantumCircuit``. Neste nível, você pode especificar a dinâmica de tempo exato dos sinais de entrada, em todos os canais de entrada. Grande parte do algoritmo quântico pode ser descrito com circuitos sozinhos usando operações de portão -- geralmente é, quando você quer aplicar técnicas de mitigação de erros, ou, quando se torna útil usar o controle pulse-level para caracterizar uma qualidade de time-dependent de um sistema quântico.

source: On this page, we will discover how to build and execute a very basic Pulse program, which is called a schedule.
fr_fr: Sur cette page, nous allons découvrir comment construire et exécuter un programme Pulse très basique, qui est appelé un ``schedule`` (horaire d'exécution).
ja_jp: このページでは、スケジュールと呼ばれる、とても基本的な Pulse プログラムを構築して実行する方法を説明します。
ko_kr: 이 페이지에서는 스케줄이라고 하는 매우 기본적인 펄스 프로그램을 구축하고 실행하는 방법을 알아본다.
pt_br: Nesta página, vamos descobrir como construir e executar um programa Pulse básico que é chamado de schedule.

source: Initialize
fr_fr: Initialiser
ja_jp: 初期化
ko_kr: 초기화
pt_br: Inicializar

source: We import the ``Schedule`` class from the ``qiskit.pulse`` module. To start, we are going to initialize a ``Schedule`` with the name ``"getting_started"``.
fr_fr: Nous importons la classe ` ` Schedule ` ` à partir du module ` `qiskit.pulse ` `. Pour commencer, nous allons initialiser un ` ` Schedule` ` avec le nom ` ` getting_started'` `.
ja_jp: ``qiskit.pulse`` モジュールから、 ``Schedule`` クラスをインポートします。そして、 ``"getting_started"`` という名前で ``Schedule`` を初期化します。
ko_kr: ``qiskit.pulse``모듈에서 ``Schedule`` 클래스를 불러온다. 우선 ``getting_start``라는 이름으로 ``Schedule``을 초기화한다.
pt_br: Importamos a classe ``Schedule``, a partir do módulo ``qiskit.pulse``. Para começar, vamos inicializar uma ``Schedule`` com o nome ``"getting_started"``.

source: Easy! We have an empty schedule now.
fr_fr: Facile ! Nous avons maintenant un horaire (``schedule``) vide.
ja_jp: 簡単でしょ！これで空のスケジュールが得られました。
ko_kr: 내용이 비어있는 스케쥴을 쉽게 만들었다.
pt_br: Fácil! Temos uma schedule vazia agora.

source: Build instructions
fr_fr: Instructions de construction
ja_jp: ビルド手順
ko_kr: 명령어(instruction) 만들기
pt_br: Instruções de compilação

source: The next thing we will want to do is create some instructions to add to our schedule.
fr_fr: Ensuite nous voulons créer quelques instructions à ajouter à notre horaire (´´schedule´´).
ja_jp: 次にやりたいことは、スケジュールに追加するための命令を作ることです。
ko_kr: 다음으로 스케쥴에 추가할 명령어(Instruction) 를 만든다.
pt_br: A próxima coisa que vamos querer fazer é criar algumas instruções para adicionar a nossa schedule.

source: Perhaps the most central instruction for building schedules is the ``Waveform``. It is a pulse signal specified as an array of time-ordered complex amplitudes, or *samples*. Each sample is played for one cycle, a timestep ``dt``, determined by the backend. If we want to know the real-time dynamics of our program, we need to know the value of ``dt``. For now, let's focus on how to build the instruction.
fr_fr: L'instruction la plus centrale pour construire des horaires (``schedules``), est probalement le ` ` Waveform` `. Il s'agit d'un signal de pulse spécifié sous la forme d'une rangée d'amplitudes complexes ordonnées par le temps, ou * échantillons *. Chaque échantillon est appliqué pour un seul cycle, un intervalle de temps ` ` dt ` `, déterminée par le backend. Si nous voulons connaître la dynamique en temps réel de notre programme, nous devons connaître la valeur de ` ` dt ` `. Pour l'instant, concentrons-nous sur la façon de construire l'instruction.
pt_br: Talvez, a instrução mais central para a construção de schedules seja a ``Waveform``. É um sinal de pulso especificado como uma matriz de amplitudes complexas ordenadas ou *amostras*. Cada amostra é executada para um ciclo, um timestep ``dt``, determinado pelo backend. Se quisermos saber a dinâmica em tempo real do nosso programa, precisamos saber o valor de ``dt``. Por enquanto, vamos nos concentrar em como construir a instrução.

source: There are multiple ways to build pulses, which you can learn about on later pages. This time, we've simply passed the exact amplitudes of the pulse envelope we want to play as an array. The array above is a Gaussian function evaluated at 64 points, with an amplitude of 1 and a standard deviation of 8. The (zero-indexed) :math:`i^{th}` sample will play from time ``i*dt`` up to ``(i + 1)*dt``, modulated by the qubit frequency. Think of this like an arbitrary waveform generator (AWG), playing the samples you give to the ``Waveform``, mixed with a continuous sine wave generator outputting a tone at the qubit frequency.
fr_fr: Il y a plusieurs façons de construire des impulsions, comme vous pouvez apprendre sur les pages suivantes. Cette fois, nous avons simplement passé les amplitudes exactes de l'enveloppe d'impulsions, que nous voulons exécuter en tant que rangée (``array``). La rangée ci-dessus est une fonction Gaussienne évaluée à 64 points, avec une amplitude de 1 et une déviation standard de 8. L'échantillon :math:`i^{th}` (indexé à zéro) jouera de temps ``i*dt`` jusqu'à temps ``(i + 1)*dt``, modulé par la fréquence du qubit. Pensez à cela comme un générateur de signaux arbitraire (arbitrary waveform generator ou AWG), jouant les échantillons que vous donnez au ``Waveform``, mélangé à un générateur d'ondes sinusoïdales continu qui donne un ton à la fréquence du qubit.
pt_br: Existem diversas maneiras de construir pulsos, sobre as quais você pode aprender em páginas posteriores. Desta vez, nós simplesmente passamos as amplitudes exatas do envelope de pulso que queremos executar como uma matriz. A matriz acima é uma função gaussiana avaliada em 64 pontos, com uma amplitude de 1 e um desvio-padrão de 8. A amostra (zero-indexed) :math:`i^{th}` vai executar, a partir do tempo ``i*dt`` até ``(i + 1)*dt``, modulada pela frequência do qubit. Pense nisso como um arbitrary waveform generator (AWG), executando as amostras fornecidas para o ``Waveform``, misturado com um gerador de onda senoidal contínua produzindo um tom na frequência do qubit.

source: The values above happen to be real, but they can also be complex. The amplitude norm of any pulse signal is arbitrarily limited to 1. Each backend system may also impose further constraints -- for instance, a minimum pulse size of 64. Learn more about getting information from the backend `here <5_gathering_system_information.ipynb>`__.
fr_fr: Les valeurs ci-dessus sont réelles, mais elles peuvent aussi être complexes. La norme d'amplitude de n'importe quel pulse est arbitrairement limitée à 1. Chaque système dorsal peut également imposer des contraintes supplémentaires -- par exemple, une taille de pulse minimale de 64. Pour en savoir plus sur l'obtention d'informations depuis du système dorsal (``backend``), consultez <5_gathering_system_information.ipynb> ` __.
ja_jp: 上記は実数ですが、複素数になる場合もあります。パルス信号の振幅ノルムは任意の1に制限されます。各バックエンドシステムは、さらに制約を課す場合があります。たとえば、最小パルスサイズは64です。バックエンドから情報を取得する方法の詳細については、 `こちら <5_gathering_system_information.ipynb>`__ をご覧ください 。
ko_kr: 위의 값은 실제로 발생하지만 복잡할 수도 있다. 임의의 펄스 신호의 진폭은 표준 1로 제한된다. 각 백엔드 시스템은 또한 추가적인 제약들 (예를 들어, 64의 최소 펄스 크기) 을 부과할 수 있다. 여기에서는 백엔드에서 정보를 얻는 것에 대해 자세히 알아본다.
pt_br: Os valores acima são reais, mas também podem ser complexos. A norma de amplitude de qualquer sinal de pulso está, arbitrariamente, limitada a 1. Cada sistema de backend, também pode impor mais restrições -- por exemplo, um tamanho de pulso mínimo de 64. Saiba mais sobre como obter informações do backend `,aqui <5_gathering_system_information.ipynb>`__.

source: Schedule instructions
fr_fr: Ordonnancer des instructions
ja_jp: スケジュール命令
ko_kr: 스케쥴 명령어
pt_br: Instruções de schedule

source: Next, we have to add an instruction to execute the pulse signal we just built. This means specifying not only the *time* that the pulse should be played, but also *where* it should be played. When we build circuits, we specify which qubit a gate operation should be applied to. In Pulse, every qubit has multiple *channels*.
fr_fr: Ensuite, nous devons ajouter une instruction pour exécuter le signal de pulse que nous venons de construire. Cela signifie que vous devez spécifier non seulement le *moment de temps* que le pulse doit être effectué, mais aussi * où * il doit être executé. Lorsque nous construisons des circuits, nous spécifions à quel moment une opération de porte doit être appliquée. Dans Pulse, chaque qubit a plusieurs *canaux * (´´channels´´).
ja_jp: 次に、先ほど作ったパルス信号を実行する命令を追加しなければなりません。これは、パルスが再生される *時間* だけでなく、 *どこで* 再生されるべきかということを意味します。 回路を構築するときには、ゲート操作を適用する必要のある量子ビットを指定します。Pulseでは、すべての量子ビットに複数の *チャンネル* があります。
ko_kr: 다음으로, 방금 만든 펄스 신호를 실행하기 위한 명령어를 추가 한다. 이는 펄스가 재생되어야 하는 *time*을 지정하는 것뿐만 아니라, 펄스가 *where*에서 재생되어야 하는지를 지정하는 것을 의미한다. 우리는 회로를 만들 때 어떤 큐빗에 게이트를 적용해야 하는지를 지정한다. 펄스에서, 모든 큐비트는 다수의 *channels*들을 갖는다.
pt_br: Em seguida, temos que adicionar uma instrução para executar o sinal de pulso, que acabamos de construir. Isto significa especificar não, apenas o *tempo* que o pulso deve ser executado, mas também *onde* deve ser executado. Quando criamos circuitos, especificamos para qual qubit uma operação de portão deve ser aplicada. No Pulso, todo qubit tem múltiplos *canais*.

source: We will *play* our pulse on the *drive* channel of qubit 0. The drive channel lets us enact single qubit operations.
fr_fr: Nous allons * jouer * ou exécuter notre impulsion sur le canal * drive * du qubit 0. Le canal ´´drive´´ permet de mettre en oeuvre des opérations de qubits individuels.
ja_jp: 量子ビット0の *ドライブ* チャンネル上でパルスを *プレイ* します。ドライブチャンネルでは単一量子ビット演算が実行できます。
ko_kr: * drive* 채널로 큐비트0을 재생한다. 드라이브 채널을 사용하여 단일 큐비트 연산을 실행할 수 있다.
pt_br: Vamos *executar* o nosso pulso no canal de *unidade* do qubit 0. O canal de unidade nos permite realizar operações individuais de qubit.

source: Note that the pulse we defined operates on the ``DriveChannel``, which in turn is initialized with the qubit index. We use ``Schedule.insert`` to play the pulse at timestep ``t = 0``.
fr_fr: Notez que l'e pulse que nous avons défini opère sur le ``DriveChannel``, qui à son tour est initialisé avec l'index qubit. Nous utilisons ``Schedule.insert`` pour exécuter l'impulsion au moment ``t = 0``.
ja_jp: 私たちが定義したパルスは ``DriveChannel`` で動作し、順番に量子ビットインデックスで初期化されることに注意してください。 ``Schedule.insert`` を使用して、タイムステップ ``t = 0`` でパルスを再生します。
ko_kr: ``DriveChannel``에서 동작하도록 정의한 펄스는, 큐비트 인덱스를 사용해 초기화 된다. 시간 단계가 ``t = 0``일 때 펄스를 재생하기 위해 ``Schedule.insert``를 사용한다.
pt_br: Observe que o pulso que definimos opera no ``DriveChannel``, que por sua vez é inicializado com o índice de qubit. Utilizamos ``Schedule.insert`` para iniciar o pulso no tempo ``t = 0``.

source: Let's review what we've done, using ``Schedule.draw``:
fr_fr: Examinons ce que nous avons fait en utilisant ` `Schedule.draw ` `:
ja_jp: ``Schedule.draw`` を使用して、実行した内容を確認します。
ko_kr: 지금까지 ``Schedule.draw``를 사용해 작업한 것을 검토한다:
pt_br: Vamos rever o que fizemos, usando ``Schedule.draw``:

source: The ways in which schedules can be composed is covered in detail on `this page <3_building_pulse_schedules.ipynb>`__.
fr_fr: La façon dont les horaires (` ` schedules` ` ) peuvent être composés est décrite en détail sur `cette page <3_building_pulse_schedules.ipynb>`__.
ja_jp: スケジュールを作成する方法については、 `このページ <3_building_pulse_schedules.ipynb>`__ で詳しく説明します。
ko_kr: 스케줄을 작성하는 더 자세한 방법은 이 페이지에서<3_building_pulse_schedules.ipynb>`__ 다루고 있다.
pt_br: As formas em que as schedules podem ser compostas são detalhadas nesta `página <3_building_pulse_schedules.ipynb>`__.

source: This pulse will drive qubit 0. It is modulated at qubit 0's resonant frequency, so it will drive the :math:`|0\rangle` to :math:`|1\rangle` transition. It is not calibrated to stop at a particular state, so we won't know what state we've prepared until we look at the results. For our purposes, we don't mind what state we end up in.
fr_fr: Cette impulsion va actionner le qubit 0. Il est modulé à la fréquence de résonance du qubit 0, donc il va piloter le transition :math:` | 0\rangle ` à :math:` | 1\rangle ` . Il n'est pas calibré pour s'arrêter à un état particulier, donc nous ne saurons pas quel état nous avons préparé jusqu'à ce que nous examinions les résultats. À nos fins, nous ne nous soucions pas de l'état dans lequel nous finisssons.
ja_jp: このパルスは量子ビット0を駆動します。量子ビット0の共振周波数で変調されるため、 :math:`|0\rangle` から :math:`|1\rangle` への遷移を駆動します。特定の状態で停止するようにキャリブレーションされていないため、結果を見るまでどの状態を準備したかは分かりません。 私たちの目的においては、最終的にどのような状態になるかは問題ではありません。
ko_kr: 이 펄스는 큐비트0을 구동시킬 것이다. 이것은 큐비트 0의 공진 주파수에 맞춰 변조되었으므로 :math:`|0\rangle` to :math:`|1\rangle` 전이를 일으킬 것이다. 어떤 상태에서 멈추도록 조정되지 않았기 때문에 결과를 보기 전에는 중간 과정은 알 수 없다. 실험의 목적상, 어떤 상태에서 실험이 마치는지는 신경쓰지 않기로 한다.
pt_br: Este pulso dirigirá qubit 0. É modulado na freqüência ressonante do qubit 0, então conduzirá a transição do :math:`|0\rangle` para o :math:`|1\rangle`. Não é calibrado para parar em um determinado estado, então, não saberemos que estado foi preparado, até olharmos para os resultados. Para nossa finalidade, não nos importamos com o estado que se apresenta.

source: All that's left to do is to add a measurement. There is a convenient utility function for adding measurements, but it requires data from the backend system that the program will be running on. We will also need the backend to execute the program.
fr_fr: Tout ce qui reste à faire est d'ajouter une mesure. Il existe une fonction utilitaire pratique pour l'ajout de mesures, mais elle nécessite des données du système dorsal (´´backend´´) sur lequel le programme s'exécutera. Nous aurons aussi besoin du système dorsal pour exécuter le programme.
ja_jp: あとは、測定値を追加するだけです。測定値を追加するための便利なユーティリティ関数がありますが、プログラムを実行するバックエンドシステムからのデータが必要です。プログラムを実行するには、バックエンドも必要です。
ko_kr: 남은 것은 측정을 더하는 것뿐이다. 측정을 추가할 수 있는 편리한 유틸리티 기능이 있지만 프로그램이 실행될 백엔드 시스템의 데이터가 필요하다. 우리는 또한 프로그램을 실행하기 위해 백엔드가 필요할 것이다.
pt_br: O que falta fazer é adicionar uma medida. Existe uma função de utilidade conveniente para adicionar medições, mas requer dados do sistema de backend em que o programa será executado. Também precisaremos do backend para executar o programa.

source: Grab a backend
fr_fr: Mettre la main sur un backend (système dorsal)
ja_jp: バックエンドを取得する
ko_kr: 백엔드 선택
pt_br: Selecione um serviço

source: Add measurements
fr_fr: Ajouter des mesures
ja_jp: 測定の追加
ko_kr: 측정 추가
pt_br: Adicione medições

source: Now we can use this backend to add the measurement instructions for us.
fr_fr: Maintenant nous pouvons utiliser ce système dorsal (backend) pour ajouter les instructions de mesure pour nous.
ja_jp: これで、このバックエンドを使用して測定命令を追加できます。
ko_kr: 이제 이 백엔드를 사용하여 측정 명령을 추가할 수 있다.
pt_br: Agora, podemos usar este serviço para adicionar as instruções de medição para nós.

source: Let's see what the convenience function has added for us, using draw again. The acquisition and measurement pulses are very long compared to our initial pulse, so we can use the ``plot_range`` argument to clip the schedule.
fr_fr: Voyons ce que la fonction pratique a ajouté pour nous, en utilisant à nouveau le tirage. Les impulsions d'acquisition et de mesure sont très longues par rapport à notre impulsion initiale, donc nous pouvons utiliser l'argument ` ` plot_range ` ` pour découper le planning.
ja_jp: もう一度 draw を使用して、便利な関数が追加したものを見てみましょう。取得パルスと測定パルスは最初のパルスと比べて非常に長いため、 ``plot_range`` 引数を使用してスケジュールをクリップできます。
ko_kr: "draw"에 어떤 편리한 기능이 추가되어있는지 보자. 획득 및 측정 펄스들은 우리의 초기 펄스에 비해 매우 길기 때문에 ``plot_range`` 의 인수를 이용하여 스케줄의 일부를 선택할 수 있다.
pt_br: Vamos ver o que a função de conveniência adicionou, para nós, usando o desenho, novamente. Os pulsos de aquisição e medição são muito longos se comparados com nosso pulso inicial, então podemos usar o argumento `plot_range`` para prender a schedule.

source: There is a new pulse on ``MeasureChannel`` ``m0``, a shorthand name for ``MeasureChannel(0)``. This channel stimulates readout on qubit 0. Likewise, ``a0`` is shorthand for ``AcquireChannel(0)``. The ``Acquire`` instruction on ``a0`` tells the measurement devices when to begin collecting data on their analog-to-digital converters (ADC), and for how long. It is drawn as an amplitude 1 constant pulse.
fr_fr: Il y a une nouvelle impulsion sur ` ` MeasureChannel ` ` ` ` m0 ` `, un nom abrégé pour ` ` MeasureChannel (0) ` `. Ce canal stimule la lecture sur le qubit 0. De même, ` ` a0 ` ` est le nom abrégé pour ` ` AcquireChannel (0) ` `. L'instruction ` ` Acquire ` ` sur ` ` a0 ` ` indique aux appareils de mesure quand ils doivent commencer à collecter des données sur leurs convertisseurs analogique-vers-numérique (analog-to-digital ou ADC), et pendant combien de temps. Il est tiré comme un pulse constant d'amplitude 1.
ja_jp: ``MeasureChannel(0)`` の略称である ``MeasureChannel`` ``m0`` に新しいパルスがあります。このチャンネルは、量子ビット0での読み出しを促します。同様に、 ``a0`` は ``AcquireChannel(0)`` の省略形です。 ``a0`` の ``Acquire`` 命令は、測定デバイスに、A / Dコンバーター（ADC）で、データの収集を開始するタイミングと期間を通知します。振幅1の一定パルスとして描画されます。
ko_kr: ``MeasureChannel`` ``m0``(``MeasureChannel(0)``) 에 새로운 펄스가 추가되어 있다. 이 채널은 큐비트 0을 읽거나 쓰게 설정되었다. ``a0``(``AcquireChannel(0)``) 도 마찬가지이다. ``a0``의 ``Acquire`` 명령어는 측정 장치의 ADC(아날로그 대 디지털 컨버터) 에 언제 데이터 수집을 시작할지 알려준다. 이것은 크기 1의 상수 펄스로 나타난다.
pt_br: Há um novo pulso no ``MeasureChannel`` ``m0``, nome abreviado para ``MeasureChannel(0)``. Este canal estimula leitura no qubit 0. Da mesma forma, ``a0`` é a abreviação para ``AcquireChannel(0)``. A instrução ``Acquire`` no ``a0`` indica, aos dispositivos de medição, quando começar a coletar dados de seus analog-to-digital converters (ADC) e por quanto tempo. Ele está configurado como um pulso de amplitude constante 1.

source: Execute
fr_fr: Exécution
ja_jp: 実行
ko_kr: 실행

source: Our schedule is done! We can't use our mocked backend to execute programs, but if you have an IBM Quantum account, you could use ``backend = IBMQ.load_account().get_backend(open_pulse=True)`` to see if you have an OpenPulse enabled backend. Once you have such a backend, we can execute it the same way we execute circuits:
fr_fr: Notre horaire (schedule) est terminé ! Nous ne pouvons pas utiliser notre backend simulé pour exécuter des programmes, mais si vous avez un compte IBM Quantum, vous pouvez utiliser ` ` backend = IBMQ.load_account ().get_backend (open_pulse=True) ` ` pour voir si vous avez un backend ouvert à OpenPulse. Une fois que vous avez un tel backend, nous pouvons l'exécuter de la même façon que nous exécutons des circuits:
ja_jp: スケジュールが完了しました。モックのバックエンドを使用してプログラムを実行することはできませんが、IBM Quantumアカウントを持っている場合は、 ``backend = IBMQ.load_account().get_backend(open_pulse=True)`` を使用して、OpenPulse が有効になっているかどうかを確認できます。このようなバックエンドがあれば、回路を実行するのと同じように実行できます。
ko_kr: 스케쥴이 완성되었다. 가상의 백엔드로는 이 프로그램은 실행할 수 없다. IBM Quantum 계정이 있다면 ``backend = IBMQ.load_account().get_backend(open_pulse=True)`` 명령어를 사용해서 OpenPulse를 사용할 수 있는, 가용 백엔드가 있는지 확인할 수 있다. 조건에 맞는 백엔드를 찾았다면, 회로를 실행하는 것과 같은 방법으로 펄스 프로그램을 실행할 수 있다.
pt_br: Nosso programa foi concluído! Não podemos usar nossa simulação de backend para executar programas, mas se você tiver uma conta IBM Quantum, você pode usar ``backend = IBMQ.load_account().get_backend(open_pulse=True)`` para ver se você tem um backend do OpenPulse ativado. Uma vez que você tenha um backend, podemos executá-lo da mesma forma que executamos circuitos:

source: That's it! To get the results, use ``result = job.result()``. You've created a Pulse program schedule, containing an operation on qubit 0 followed by a measurement, executed the experiment on the backend and retrieved the results. Next, we will cover in detail the `different instructions which can be used in Pulse programs <2_building_pulse_instructions.ipynb>`__.
fr_fr: C'est tout ! Pour obtenir les résultats, utilisez ``result = job.result()``. Vous avez créé un programme Pulse, contenant une opération sur qubit 0 suivie d'une mesure, vous avez exécuté l'expérience (experiment) sur le système d'exécution (` ` backend` ` ) et récupéré les résultats. Ensuite, nous couvrirons en détail les `différentes instructions qui peuvent être utilisées dans les programmes Pulse <2_building_pulse_instructions.ipynb>`__.
ja_jp: これでおしまいです！ 結果を取得するには、 ``result = job.result()`` を使用します。量子ビット0での操作とそれに続く測定を含むPulseプログラムスケジュールを作成し、バックエンドで実験を実行して結果を取得しました。次に、 `Pulseプログラムで使用できるさまざまな命令 <2_building_pulse_instructions.ipynb>`__ について詳しく説明します。
ko_kr: 다 되었다. 결과를 얻기 위해서 ``result = job.result()``를 사용한다. 여러분은 큐비트 0에 작용하는 실험을 포함하는 작업이 포함된 펄스 프로그램 스케쥴을 작성했으며 백엔드에 이 실험을 실행하고 결과를 받았다. 다음으로, `펄스 프로그램에서 사용할 수 있는 다양한 명령어 <2_building_pulse_instructions.ipynb>`__를 다룰 것이다.
pt_br: É isso! Para obter os resultados, use ``result = job.result()``. Você criou uma schedule do Pulso, contendo uma operação em qubit 0 seguida de uma medição, executou o experimento no backend e recuperou os resultados. Em seguida, cobriremos em detalhes as `instruções diferentes que podem ser usadas em programas Pulse <2_building_pulse_instructions.ipynb>`__.

source: Perhaps the most central instruction for building schedules is the ``SamplePulse``. It is a pulse signal specified as an array of time-ordered complex amplitudes, or *samples*. Each sample is played for one cycle, a timestep ``dt``, determined by the backend. If we want to know the real-time dynamics of our program, we need to know the value of ``dt``. For now, let's focus on how to build the instruction.
ja_jp: おそらく、スケジュール構築における最も中心的な命令は ``SamplePulse`` です。これは、時間順の複素振幅の配列、あるいは *サンプル* として指定されたパルス信号です。各サンプルは、バックエンドにより決められるタイムステップ ``dt`` のサイクルにより再生されます。もし、プログラムのリアルタイムダイナミクスが知りたい場合は、 ``dt`` の値を知る必要があります。ここからは、命令の構築方法を見ていきましょう。
