Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/pulse/3_building_pulse_schedules.po
Languages: ko_kr, pt_br

source: This page was generated from `tutorials/pulse/3_building_pulse_schedules.ipynb`__.
ko_kr: 이 페이지는 `tutorials/pulse/3_building_pulse_schedules.ipynb`__에서 생성되었다.
pt_br: Esta página foi gerada, a partir do `tutorials/pulse/3_building_pulse_schedules.ipynb`__.

source: Building Pulse Schedules
ko_kr: 펄스 스케쥴 구성하기
pt_br: Construindo Schedules de Pulso

source: Building ``Schedule``\ s is very straightforward, yet there are a few ways to compose them. We're going to explore these different methods here.
ko_kr: ``Schedule``은 간단하게 작성할 수 있고, 몇가지 방법이 있다. 이 다양한 방법들을 알아보자.
pt_br: Construir ``Schedule``\ s é bastante simples, mas há algumas formas de compô-los. Vamos explorar estes diferentes métodos, aqui.

source: In this tutorial we use the ``Play`` instruction, with a ``ConstantPulse`` pulse argument. To learn about these and other ``Instruction``\ s, first check out `this page <2_building_pulse_instructions.ipynb>`__.
ko_kr: 이 튜토리얼에서는``ConstantPulse`` 펄스 인수와 함께 ``Play``명령어를 사용한다. 이들 및 기타 ``Instruction``들에 대해 알아 보려면 다음의 페이지를 참고한다. <2_building_pulse_instructions.ipynb>`__
pt_br: Neste tutorial, usamos a instrução ``Play``, com um argumento pulso ``ConstantPulse``. Para aprender sobre estes e outras ``Instruction``\ s, primeiro confira `esta página <2_building_pulse_instructions.ipynb>`__.

source: Tip: ``Instruction``\ s can be treated just like ``Schedule``\ s -- that means all the methods we use here work equally well for composing ``Schedule``\ s with ``Schedule``\ s, ``Instruction``\ s with ``Instruction``\ s, or between the two.
ko_kr: 팁: ``Instruction``들은 ``Schedule``들처럼 취급될 수 있다. 즉, 여기에서 사용하는 모든 방법은 ``Schedule``들과 ``Schedule``들, ``Instruction``들과 ``Instruction``들 간에도 동일하게 사용할 수 있다.
pt_br: Dica: ``Instruction``\ s pode ser tratado como ``Schedule``\ s -- isto significa que todos os métodos que usamos, aqui, trabalham igualmente bem para compor ``Schedule``\ s com ``Schedule``\ s, ``Instruction``\ s com ``Instruction``\ s, ou entre as duas.

source: As the basis for trying out the composition methods, let's initialize a couple dummy ``Schedule``\ s.
ko_kr: 스케쥴을 구성해보기 위한 기초 단계로 몇 쌍의 연습용 ``Schedule``들을 초기화 해보자.
pt_br: Como base para testar os métodos de composição, vamos inicializar um par fictício ``Schedule``\ s.

source: ``insert`` or ``|``
ko_kr: ``insert`` 혹은 ``|``
pt_br: ``insert`` ou ``|``

source: The ``insert`` method schedules an ``Instruction`` or ``Schedule`` at a particular time. Let's use it to give each of our schedules a different instruction.
ko_kr: ``insert`` 방식은 특정 시기에 ``Instruction`` 또는 ``Schedule``을 계획한다. 그것을 이용해서 각자의 스케줄에 서로 다른 명령어를 내려본다.
pt_br: O método ``insert`` agenda uma ``Instruction`` ou ``Schedule``, em um determinado momento. Vamos usá-lo para dar uma instrução diferente a cada um dos nossos agendamentos.

source: The insert schedule method overloads the ``|`` (or) operator for ``Schedule``\ s, so we will use this special syntax on schedule ``B``. When using this syntactic sugar, the ``time`` argument is implicitly zero.
ko_kr: 스케쥴 삽입 방식은 ``Schedule``들의 ``|`` 또는 오퍼레이터에 과부하가 걸리게하기 때문에, 이 특별한 구문을 ``B`` 스케줄에 사용할 것이다. 이 매력적인 구문을 사용할때, ``B``인수는 무조건 0이다.
pt_br: O método de inserir um agendamento sobrecarrega o operador ``|`` (ou) para a ``Schedule``\ s, então usaremos esta sintaxe especial na programação `` B``. Ao usar este adoçante sintático, o argumento ``time`` é implicitamente zero.

source: ``shift`` or ``<<``
ko_kr: ``shift`` 혹은 ``<<``
pt_br: ``shift`` ou ``<<``

source: Sometimes we need to offset one schedule from ``time=0``. For instance, when using ``|``, we use ``shift`` to add an instruction at a time besides zero.
ko_kr: 때로는 일정 하나를 ``time=0``의 값을 offset으로 설정해 상쇄해야 할 때도 있습니다. 예를 들어, ``|``를 사용할 때 ``shift``를 시간 0 근방의 명령어에 추가한다.
pt_br: Às vezes, precisamos deslocar uma schedule de ``time=0``. Por exemplo, ao usar ``|``, usamos ``shift`` para adicionar uma instrução por vez, além de zero.

source: Let's see how we can use ``insert`` to compose schedules ``A`` and ``B`` together.
ko_kr: 스케쥴 ``A``와 ``B``를 함께 작성할 때 ``insert``를 어떻게 사용하는지 살펴 본다.
pt_br: Vamos ver como podemos usar ``insert`` para definir schedules ``A`` e ``B`` juntos.

source: ``append`` or ``+``
ko_kr: ``append`` 혹은 ``+``
pt_br: ``append`` ou ``+``

source: The ``append`` method is like ``insert``, but the insertion time is determined for us. The ``Instruction`` or ``Schedule`` being added will begin when all the channels common to the two become free. If they contain no common channels, then the ``Schedule`` will be appended at ``time=0``. In pseudocode:
pt_br: O método ``append`` é como ``insert``, mas o tempo de inserção é determinado para nós. A ``Instruction`` ou ``Schedule`` começarão, quando todos os canais comuns aos dois se tornarem livres. Se eles não contêm canais comuns, então o ``Schedule`` será anexado em ``time=0``. Em pseudocódigo:

source: The append schedule method overloads the ``+`` (add) operator for Schedules.
ko_kr: 스케쥴 첨부(append) 방법은 스케줄의 ``+``(add) 오퍼레이터에 과부하된다.
pt_br: O método de append schedule sobrecarrega o operador ``+`` (add) para as Schedules.

source: Let's continue with schedule ``A`` and schedule ``B``. Remember that they both have instructions scheduled on the same channel, ``DriveChannel(0)``. Schedule ``A`` contains positive amplitude pulses, and schedule ``B`` contains negative amplitude pulses.
ko_kr: 스케줄 ``A``와 ``B``에 대해서 계속 이야기 해보자. 둘 다 동일한 채널 ``DriveChannel(0)``에 예약된 명령어가 있다. 스케쥴 ``A``는 양의 진폭 펄스가 포함되어 있고, 스케쥴 ``A``에는 음의 진폭 펄스가 포함되어 있다.
pt_br: Vamos continuar com a schedule ``A`` e schedule ``B``. Lembre-se de que ambos têm instruções em schedule no mesmo canal, ``DriveChannel(0)``. Schedule ``A`` contém pulsos de amplitude positiva, e cronograma ``B`` contém pulsos de amplitude negativa.

source: Let's see what happens when there are no common channels.
ko_kr: 공통 채널이 없을 때 어떤 일이 일어나는지 지켜보자.
pt_br: Vamos ver o que acontece, quando não há canais comuns.

source: Warning: Common channels is not the same as common qubits. Measurements require different channels than gate operations, even on one qubit. If you simply append a measurement to a schedule, you'll likely schedule your measurement at ``time=0``, not what you were expecting! Instead, use the shift operation, with ``schedule.duration`` as the time argument.
ko_kr: 경고 : 공통 채널은 공통 큐비트와 동일하지 않다. 측정에는 심지어 단 큐비트에 대한 것이더라도, 게이트 오퍼레이션들과 다른 채널들이 필요하다. 단순히 스케쥴에 측정을 추가하면, 예상했던 시간이 아닌 ``time=0``에 측정 스케쥴이 잡힐 것이다. 대신 시간 인수로 ``schedule.duration``과 함께 시프트 연산을 사용한다.
pt_br: Aviso: Os canais comuns não são o mesmo que os qubits comuns. As medições exigem canais diferentes das operações de portão, mesmo em um único qubit. Se você simplesmente fizer o append de uma medição a uma schedule, provavelmente, programará sua medição a ``time=0``, o que não é esperado por você! Ao invés disto, use a operação de turno, com ``schedule.duration`` como argumento de tempo.

source: This time, the new instruction being appended was added at ``time=0``, because it did not have any instructions on ``DriveChannel(0)``.
ko_kr: 이번에는 ``DriveChannel(0)``에 명령어가 없었기 때문에 ``time=0``으로 새로운 명령어가 첨부(append) 되었다.
pt_br: Desta vez, a nova instrução a ser adicionada foi adicionada em ``time=0``, porque não tinha nenhuma instrução em ``DriveChannel(0)``.

source: Be wary: ``append`` only "slides" the appended schedule into the original around channels that are not common between them. The following example demonstrates this point.
ko_kr: 주의: ``append``는 첨부된 된 일정을 그들 사이에 공통이지 않은 주변의 원본 채널로 "미끄러지듯 집어 넣는다(slide)". 다음 예제는이 점을 보여준다.
pt_br: Cuidado: ``append``, apenas "liga" a schedule anexada ao original, ao redor dos canais que não são comuns entre si. O exemplo, a seguir, demonstra este ponto.

source: Congrats, you've mastered schedule composition!
ko_kr: 축하한다, 당신은 스케줄 작성을 마스터했다.
pt_br: Parabéns, você dominou a composição de schedule!

source: On the next page, we will see how to `add measurements to your schedule <4_adding_measurements.ipynb>`__.
ko_kr: 다음 페이지에서는 스케줄에 측정을 추가하는 방법을 확인한다 `add measurements to your schedule <4_adding_measurements.ipynb>`__.
pt_br: Na próxima página, veremos como `adicionar medições a sua schedule <4_adding_measurements.ipynb>`__.
