Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/pulse/4_adding_measurements.po
Languages: fr_fr, ko_kr, pt_br

source: This page was generated from `tutorials/pulse/4_adding_measurements.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/pulse/4_adding_measurements.ipynb`__.
ko_kr: 이 페이지는 `tutorials/pulse/4_adding_measurements.ipynb`__에서 생성되었다.
pt_br: Esta página foi gerada a partir de `tutorials/pulse/4_adding_measurements.ipynb`__.

source: Adding measurements to ``Schedule``\ s
fr_fr: Ajout de mesures aux ``Schedule``\ s
ko_kr: ``Schedule``에 측정을 추가하기
pt_br: Adicionando medições a ``Schedule``\ s

source: Measurement is clearly a very important part of building a Pulse schedule -- this is required to get the results of our program execution! The powerful low-level control we are granted by Pulse gives us more freedom than ``QuantumCircuit``\ s in specifying how the measurement should be done, enabling you to explore readout error mitigation. This power of course comes with responsibility: we have to understand how measurement works, and accommodate certain hardware constraints.
fr_fr: La mesure est clairement une partie très importante de la construction d'un horaire (``Schedule``) Pulse -- c'est nécessaire pour obtenir les résultats de l'exécution de notre programme ! Le puissant contrôle de bas niveau qui nous est accordé par Pulse nous donne plus de liberté que les ``QuantumCircuit``\ s en spécifiant comment la mesure doit être faite, vous permettant d'explorer l'atténuation des erreurs de lecture. Ce contrôle est bien entendu lié à une responsabilité: nous devons comprendre comment fonctionne la mesure et répondre à certaines contraintes au niveau du hardware.
pt_br: A medição é claramente uma parte muito importante da construção de uma Pulse Schedule - isso é necessário para obter os resultados da execução do nosso programa! O poderoso controle de baixo nível que recebemos pela Pulse nos dá mais liberdade do que ``QuantumCircuit``\ s ao especificar como a medição deve ser feita, possibilitando que você explore a mitigação de erros de leitura. Esse poder obviamente vem com uma responsabilidade: temos que entender como funciona a medição, e acomodar certas restrições de hardware.

source: On this page, we will explore in depth how to create measurements, using several different approaches of increasing complexity.
fr_fr: Sur cette page, nous allons explorer en profondeur comment créer des mesures, en utilisant plusieurs approches différentes de complexité croissante.
ko_kr: 이 페이지에서는 복잡성이 증가하는 여러 가지 접근 방식을 사용하여 측정을 생성하는 방법을 심층적으로 살펴보기로 한다.
pt_br: Nesta página, exploraremos a fundo como criar medições, utilizando várias abordagens diferentes de complexidade crescente.

source: \*\*Note: Pulse allows you to receive raw, kerneled, and discriminated readout data (whereas circuits will only return discriminated data).
fr_fr: \*\*Note : Pulse vous permet de recevoir des données de lecture brutes, creusées (ou ``kernelées``) et discriminées (alors que les circuits ne retourneront que des données discriminées).
pt_br: \*\*Nota: Pulse permite que você receba dados de leitura não tratados, processados e discriminados (enquanto que os circuitos só retornarão dados discriminados).

source: Adding a backend-default measurement with ``measure``
fr_fr: Ajout d'une mesure par défaut du backend avec ``measure``
ko_kr: "측정값" 을 사용하여 백엔드 기본 측정값을 추가한다.
pt_br: Adicionando uma medição backend-padrão com ``measure``

source: To add measurements as easily to ``Schedule``\ s as to ``QuantumCircuit``\ s, you just have to know which qubits you want to measure (below, qubits 0 and 1) and have an OpenPulse-enabled ``backend``:
fr_fr: Pour ajouter des mesures aussi facilement à ` ` Schedule ` \ s que pour ` ` QuantumCircuit ` ` \ s, il suffit de savoir quels qubits vous voulez mesurer (en dessous, qubits 0 et 1) et avoir un ` ` backend ` ` d'OpenPulse'`:
pt_br: Para adicionar medições tão facilmente quanto ``Schedule``\ s aos ``QuantumCircuit``\ s, você só precisa saber quais qubits você deseja medir (abaixo, qubits 0 e 1) e ter um ``backend`` OpenPulse habilitado:

source: The ``backend`` contains a default definition for measurement, which is tailored to the qubits you are measuring.
fr_fr: Le ``backend`` contient une définition par défaut pour la mesure, qui est adaptée aux qubits que vous mesurez.
ko_kr: ``backend`` 에는 측정에 대한 기본 설정들이 있으며, 측정하는 큐비트에 맞게 조정할 수 있다.
pt_br: O ``backend`` contém uma definição padrão para medição, a qual é personalizada de acordo com os qubits que você está medindo.

source: Basic measurement pattern and ``measure_all``
fr_fr: Modèle de mesure de base et ` ` mesures_all ` `
ko_kr: 기본적인 측정 패턴과 ``measure_all``
pt_br: Padrão de medição básico e ``measure_all``

source: Let's use the default measurement feature to inspect a measurement and learn what each pulse does. Below, we use ``measure_all``, which measures all the qubits on the backend.
fr_fr: Utilisons la fonction de mesure par défaut pour inspecter une mesure et apprendre ce que fait chaque impulsion. Ci-dessous, nous utilisons ``measure_all``, qui mesure tous les qubits du backend.
ko_kr: 기본 측정 기능을 사용하여 측정을 점검하고 각 펄스가 수행하는 작업에 대해 알아본다. 아래에서는 백엔드의 모든 큐비트를 측정하는 `measure_all``을 사용합다.
pt_br: Vamos usar o recurso de medição padrão para inspecionar uma medição e aprender o que cada pulso faz. Abaixo, utilizamos ``measure_all``, o qual mede todos os qubits no backend.

source: Each qubit has two channels related to readout, as we see above. These are the readout transmit ``MeasureChannel``\ s, and the readout receive ``AcquireChannel``\ s. In superconducting qubit architectures, qubits are coupled to readout resonators. The ``MeasureChannel`` and ``AcquireChannel``\ s label signal lines which connect to the readout resonator. The coupling between the qubit and the readout resonator hybridizes their state, so when a stimulus pulse is sent to the readout resonator, the reflected pulse is dependent on the state of the qubit. The acquisition "pulse" is truly a trigger specifying to the analog-to-digital converter (ADC) to begin collecting data, and for how long. That data is used to classify the qubit state.
fr_fr: Chaque qubit a deux canaux liés à la lecture, comme nous le voyons ci-dessus. Il s'agit de la lecture transmettant des ``MeasureChannel``\ s et la lecture reçoit des ``AcquireChannel``\ s. Dans les architectures ``Superconducting`` (architectures superconduites) des qubits, les qubits sont couplés à des résonateurs de lecture. Les lignes d'étiquettes ``MeasureChannel`` et ``AcquireChannel``\ s se connectent au résonateur de lecture. Le couplage entre le qubit et le résonateur de lecture s'hybride leur état, donc quand une impulsion de stimulus est envoyée au résonateur de lecture, l'impulsion réfléchie dépend de l'état du qubit. L'acquisition "Pulse" est vraiment un déclencheur spécifiant au convertisseur analogique-vers-numérique (``analog-to-digital converter ou ADC``) pour commencer à collecter des données, et pour combien de temps. Ces données sont utilisées pour classer l'état du qubit.
pt_br: Cada qubit tem dois canais relacionados à leitura, como vemos acima. Estas são, as leituras de transmissão ``MeasureChannel``\ s, e a leitura de recepção ``AcquireChannel``\ s. Em arquiteturas de qubit supercondutores, os qubits são acoplados a ressonadores de leitura. As etiquetas ``MeasureChannel`` e ``AcquireChannel``\ s sinalizam linhas que se conectam ao ressonador de leitura. O acoplamento entre o qubit e o ressonador de leitura hibridiza o seu estado, portanto, quando um pulso de estímulo é enviado para o ressonante de leitura, o pulso refletido é dependente do estado do qubit. A aquisição "pulse" é verdadeiramente um gatilho especificando para o conversor analógico-digital (ADC) para começar a coletar dados e por quanto tempo. Esses dados são usados para classificar o estado do qubit.

source: Specifying classical memory slots
fr_fr: Spécification des slots de mémoire classique
ko_kr: 클래식 메모리 슬롯 지정
pt_br: Especificando slots de memória clássicos

source: If you would like to specify where your measurement results go, there is an option for that in ``measure``, called ``qubit_mem_slots``. It takes a dictionary mapping qubit indices to classical memory slots. For example, if you want to measure qubit 0 into memory slot 1, you would do this:
fr_fr: Si vous souhaitez spécifier l'emplacement de vos résultats de mesure, il existe une option pour la ` ` mesure ` `, appelée ` ` qubit_mem_slots ` `. Il faut un dictionnaire pour mapper (``dictionary for mapping``) des index de qubits aux slots de mémoire classique. Par exemple, si vous voulez mesurer le qubit 0 dans l'emplacement mémoire (``slot``) 1, procédez comme suit:
ko_kr: 측정 결과가 어디로 가는지를 지정하고자 하는 경우에는 ``qubit_mem_slots`` 이라고 하는 ``measure`` 값에 대한 옵션을 사용한다. 예를 들어, 메모리 슬롯 1에 큐비트 0의 측정 값을 삽입하려는 경우 다음을 수행한다.
pt_br: Se você quiser especificar onde os seus resultados de medição vão, há uma opção para isso em ``measure``, chamada ``qubit_mem_slots``. É preciso um dicionário mapeando índices de qubit para os slots de memória clássicos. Por exemplo, se você quiser medir o qubit 0 no slot de memória 1, você faria isso:

source: This would be equivalent to the circuit measurement ``circuit.measure(qubit_reg[0], classical_reg[1])``.
fr_fr: Cela serait équivalent à la mesure du circuit ``circuit.measure(qubit_reg[0], classical_reg[1])``.
ko_kr: 이는 양자 회로 측정 ``circuit.measure(qubit_reg[0], classical_reg[1])``과 동일한 결과를 보인다.
pt_br: Isso seria equivalente à medição do circuito ``circuit.measure(qubit_reg[0], classical_reg[1])``.

source: Build a measurement sequence from pulses
fr_fr: Construire une séquence de mesure à partir d'impulsions
ko_kr: 펄스들로부터 측정 시퀀스 만들기
pt_br: Construa uma sequência de medição a partir de pulsos

source: Rather than use the default measurements provided by the backend, we can also build the measurement sequence up as a basic Pulse schedule. The example below is similar to a typical measurement on IBM systems.
fr_fr: Plutôt que d'utiliser les mesures par défaut fournies par le système d'exécution (``backend``), nous pouvons également construire la séquence de mesure en tant qu'ordonnancement (``schedule``) des impulsions de base. L'exemple ci-dessous est similaire à une mesure standard sur les systèmes IBM.
ko_kr: 백엔드에서 제공되는 기본 측정만 사용하기 보다 기본 펄스 스케줄로부터 측정 시퀀스를 만들 수 있다. 아래의 예제는 IBM 시스템에서 일반적으로 사용되는 측정과 비슷하다.
pt_br: Ai invés de usar as medições padrão fornecidas pelo backend, também podemos construir a sequência de medição como um Pulse schedule básico. O exemplo abaixo é semelhante a uma medição típica em sistemas IBM.

source: First, we'll build the measurement stimulus pulses for each of the qubits we want to measure. Below, we use a Gaussian square parametric pulse.
fr_fr: D'abord, nous construirons les impulsions de stimulation de la mesure pour chacune des qubits que nous voulons mesurer. Ci-dessous, nous utilisons une impulsion paramétrique carrée Gaussienne.
ko_kr: 첫째로 측정하고자 하는 각각의 큐비트의 측정 자극 펄스를 만들어야 한다. 아래에는 가우시안(Gaussian) 사각 파라메트릭 펄스를 사용하였다.
pt_br: Primeiro, construiremos os pulsos de estímulo de medição para cada um dos qubits que queremos medir. Abaixo, utilizamos um pulso paramétrico quadrado Gaussiano.

source: Before we build the acquisition pulses, we need to understand the measurement map.
fr_fr: Avant de construire les impulsions d'acquisition, nous devons comprendre la carte (``map``) de mesure.
ko_kr: 획득(acquisition) 펄스를 만들기 전에 측정 맵을 이해해야 한다.
pt_br: Antes de construirmos os pulsos de aquisição, precisamos entender o mapa de medição.

source: Acquiring qubits: the measurement map ``meas_map``
fr_fr: Acquisition de qubits : la carte de mesure ``meas_map``
ko_kr: 획득 큐비트: 측정 맵 ``meas_map``
pt_br: Obtendo qubits: o mapa de medição ``meas_map``

source: Due to control rack hardware constraints, some qubits may need to be acquired together. This can be the case for qubits whose readout channels are multiplexed. Any OpenPulse-enabled backend will provide a ``meas_map`` to notify the user of this.
fr_fr: En raison des contraintes matérielles de l'armoire de contrôle, il peut être nécessaire d'acquérir ensemble des éléments qubits. Cela peut être le cas pour les qubits dont les canaux de lecture sont multiplexés. Tout backend ouvert à OpenPulse fournira une ` ` feuille de mesure ` ` pour en informer l'utilisateur.
ko_kr: 제어 랙 하드웨어 제약으로 인해 일부 큐비트를 함께 획득해야 할 수도 있다. 판독 채널이 멀티플렉스되는 큐비트의 경우가 이에 해당한다. OpenPulse를 지원하는 백엔드는 무엇이든 이를 사용자에게 알리기 위해 ``meas_map``을 제공한다.
pt_br: Devido às restrições de hardware do rack de controle, alguns qubits podem requerer ser obtidos em conjunto. Este pode ser o caso dos qubits cujos canais de leitura são multiplexados. Qualquer backend ativado pelo OpenPulse fornecerá um ``meas_map`` para notificar o usuário sobre isto.

source: For instance, if we see this for a 5-qubit ``backend``
fr_fr: Par exemple, si nous voyons cela pour un "backend" de 5 qubit.
ko_kr: 예를 들어, 5-큐비트 ``backend``의 경우에 다음을 본다면,
pt_br: Por exemplo, se vermos isso para um ``backend`` de 5 qubit

source: then we know that all the qubits on this device must be acquired together. On the other hand, this output
fr_fr: alors nous savons que tous les qubits sur cet appareil (``device``) doivent être acquis ensemble. Par contre, cette sortie
ko_kr: 그렇다면, 이 장치에 있는 모든 큐비트들이 한꺼번에 수집되어야 함을 알 수 있다. 반면에 다음의 결과는
pt_br: então sabemos que todos os qubits deste dispositivo devem ser obtidos em conjunto. Por outro lado, esse resultado

source: tells us that qubits 0, 1 and 2 can be acquired independently, but qubits 3 and 4 must be acquired together.
fr_fr: En raison des contraintes matérielles de l'armoire de contrôle, il peut être nécessaire d'acquérir ensemble des éléments qubits. Cela peut être le cas pour les qubits dont les canaux de lecture sont multiplexés. Tout backend ouvert à OpenPulse fournira une ` ` feuille de mesure ` ` pour en informer l'utilisateur.
ko_kr: 큐비트 0, 1, 2는 독립적으로 수집될 수 있지만 큐비트 3 과 4는 반드시 함께 수집되어야 한다는 것을 말해 준다.
pt_br: nos diz que os qubits 0, 1 e 2 podem ser obtidos de forma independente, mas os qubits 3 e 4 devem ser obtidos em conjunto.

source: When building up a pulse schedule, be sure to add all the acquire pulses required by the backend you plan to run on. This is validated at assemble time.
fr_fr: Lors de la génération d'une ordonnance (``schedule``) d'impulsions, veillez à ajouter toutes les impulsions d'acquisition requises par le système d'exécution (``backend``) que vous prévoyez d'exécuter. Ceci est validé au moment de l'assemblage.
ko_kr: 펄스 스케줄을 작성할 때에는, 실행하려는 백엔드에서 요구하는 필요한 모든 획득 펄스를 추가해야 한다. 이것은 어셈블 단계에서 검증된다.
pt_br: Ao construir um pulse schedule, certifique-se de adicionar todos os pulsos obtidos exigidos pelo backend que você planeja executar. Isso é validado no momento da montagem.

source: Getting back to our example, let's imagine we plan to run on a backend with this measurement map: ``[[0, 1, 2]]``. Now we can build the acquisition pulses. This is done with the ``Acquire`` command, which takes only a duration. We specify the channels and memory slots to acquire on.
fr_fr: Pour revenir à notre exemple, imaginons que nous planifiions de fonctionner sur un backend avec cette carte de mesure : ``[[0, 1, 2]]``. Maintenant nous pouvons construire les impulsions d'acquisition. Ceci est fait avec la commande ``Acquire``, qui ne prend qu'une durée. Nous spécifions les canaux et les slots de mémoire à obtenir.
ko_kr: 예제로 다시 돌아가서, 다음의 측정 맵 ``[[0, 1, 2]]``을 가진 벡엔드를 실행하려고 한다고 가정하자. 이제 획득 펄스를 생성해야 한다. 이것은 지속 시간 값만을 가지는 ``Acquire`` 명령으로 행해진다. 여기에 수집에 쓰일 채널들과 메모리 슬롯을 설정해 준다.
pt_br: Voltando ao nosso exemplo, vamos imaginar que planejamos executar em um backend com este mapa de medição: ``[[0, 1, 2]]``. Agora podemos construir os pulsos de aquisição. Isso é feito com o comando ``Acquire``, o qual leva apenas uma duração. Especificamos os canais e os slots de memória aos quais adquirir.

source: Finally, we just combine the two parts together. Every instruction is on a different channel, so appending schedules the instructions at time 0. The ``measure_schedule`` can then be added to the end of any Pulse schedule to measure qubits 0 and 1 into classical memory slots 0 and 1.
fr_fr: Enfin, nous combinons simplement les deux parties ensemble. Chaque instruction est sur un canal différent, de sorte que l’ajout planifie les instructions au moment 0. Le ``measure_schedule`` peut alors être ajouté à la fin de n'importe quel planning (ordonnance, ``schedule``) Pulse pour mesurer les qubits 0 et 1 dans les slots de mémoire classiques 0 et 1.
ko_kr: 마지막으로 두 가지 부분을 합친다. 모든 명령어들은 각각의 다른 채널에 있으므로 시간 0에 실행될 명령어 스케줄을 추가한다. 그런 다음 큐비트 0과 1을 고전적인 메모리 슬롯 0과 1에 측정하기 위해 각각의 펄스 스케줄러의 끝부분에 ``measure_schedule``을 추가한다.
pt_br: Por fim, apenas combinamos as duas partes. Cada instrução está em um canal diferente, então a combinação programa as instruções no tempo 0. O ``measure_schedule`` pode, assim, ser adicionado ao final de qualquer Pulse schedule para medir os qubits 0 e 1 nos slots de memória clássicos 0 e 1.

source: Next, check out how to `get system information from the backends <5_gathering_system_information.ipynb>`__.
fr_fr: Ensuite, vérifiez comment ` obtenir des informations système depuis les systèmes d'exécution (``backends``) <5_gathering_system_information.ipynb> ` __.
ko_kr: 다음으로 `get system information from the backends <5_gathering_system_information.ipynb>`__를 통해 시스템 정보를 얻는 방법을 확인한다.
pt_br: A seguir, confira como `obter informações do sistema a partir dos backends <5_gathering_system_information.ipynb>`__.

source: Measurement is clearly a very important part of building a Pulse schedule -- this is required to get the results of our program execution! The powerful low-level control we are granted by Pulse gives us more freedom than ``QuantumCircuit``\ s in specifying how the measurement should be done, enabling you to explore readout error mitigation. This power of course comes with responsibility: we have to understand how measurement works, and accomodate certain hardware constraints.
ko_kr: 측정은 명백히 펄스 스케줄을 작성하는 데 매우 중요한 부분이다 - 이것은 프로그램의 실행 결과를 얻기 위해 필요하다! 펄스가 부여한 강력한 저수준 제어는 우리에게 측정 방법을 구체화하는 데 있어서 ``QuantumCircuit` 보다 더 많은 자유를 주어 당신이 판독 에러 완화를 검토할 수 있게 해준다. 물론 이러한 권한은 책임을 동반한다: 우리는 측정이 어떻게 작동하는지 이해해야 하고 특정 하드웨어 제약조건을 수용해야 한다.

source: \*\*Note: Pulse allows you to receive raw, kerneled, and disciminated readout data (whereas circuits will only return discriminated data).
ko_kr: \*\*Note: Pulse를 사용하면 원시, 커널 및 식별 된 판독 데이터를 수신 할 수 있다 (반면 회로는 식별 된 데이터만 반환한다).

source: To add measurements as easily to ``Schedule``\ s as to ``QuantumCircuit``\ s, you just have to know which qubits you want to measure (below, qubits 0 and 1) and have a OpenPulse-enabled ``backend``:
ko_kr: ``Schedule``에 ``QuantumCircuit``만큼 쉽게 측정을 추가하려면, 측정하려는 큐비트 (아래, 큐비트0 과 큐비트1) 와 OpenPulse가 활성화 된`` 백엔드 ''를 알아야한다:

source: Each qubit has two channels related to readout, as we see above. These are the readout transmit ``MeasureChannel``\ s, and the readout receive ``AcquireChannel``\ s. In superconducting qubit architectures, qubits are coupled to readout resonators. The ``MeasureChannel`` and ``AcquireChannel``\ s label signal lines which connect to the readout resonator. The coupling between the qubit and the readout resonator hybridizes their state, so when a stimulus pulse is sent to the readout resonantor, the reflected pulse is dependent on the state of the qubit. The acquisition "pulse" is truly a trigger specifying to the analog-to-digital converter (ADC) to begin collecting data, and for how long. That data is used to classify the qubit state.
ko_kr: 각 큐비트에는 위에서 보는 바와 같이 판독(읽고 쓰기) 와 관련된 두 개의 채널이 있다. 이들은 판독 요청 채널인 ``MeasureChannel``과, 판독을 수신하는 채널인``AcquireChannel``이다. 초전도 큐비트 아키텍처에서 큐비트는 판독 공명기에 결합된다. ``MeasureChannel``과 ``AcquireChannel`` 라벨 신호 라인은 판독 공명기에 연결된다. 큐비트와 판독 공명기의 결합은 그들의 상태를 혼합하므로, 자극 펄스가 판독 공진기로 전송될 때 반사 펄스는 큐비트의 상태에 따라 달라진다. 수집 "pulse"는 실제로 데이터 수집을 시작하기 위해 ADC(Analog-to-Digital Converter) 에 전달하는 트리거다. 그 데이터는 큐비트의 상태를 분류하는 데 사용된다.
