Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/pulse/5_gathering_system_information.po
Languages: pt_br

source: This page was generated from `tutorials/pulse/5_gathering_system_information.ipynb`__.
pt_br: Esta página foi gerada a partir de `tutorials/pulse/5_gathering_system_information.ipynb`__.

source: Obtaining information about your ``backend``
pt_br: Obtendo informações sobre o seu ``backend``

source: *Note: All the attributes of the backend are described in detail in the `Qiskit Backend Specifications <https://arxiv.org/pdf/1809.03452.pdf>`__. This page reviews a subset of the spec.*
pt_br: *Nota: Todos os atributos do backend estão descritos em detalhes na `Especificações do Backend do Qiskit <https://arxiv.org/pdf/1809.03452.pdf>`__. Esta página revisa um subconjunto da especificação.*

source: Programming a quantum computer at the microwave pulse level requires more information about the device than is required at the circuit level. A quantum circuit is built for an abstract quantum computer -- it will yield the same quantum state on any quantum computer (except for varying performance levels). A pulse schedule, on the other hand, is so specific to the device, that running one program on two different backends is not expected to have the same result, even on perfectly noiseless systems.
pt_br: Programar um computador quântico no nível de pulso de micro-ondas requer mais informações sobre o dispositivo do que as necessárias no nível do circuito. Um circuito quântico é construído para um computador quântico abstrato -- ele irá produzir o mesmo estado quântico em qualquer computador quântico (exceto para níveis variados de desempenho). Por outro lado, um schedule de pulso é tão específico ao dispositivo, que ao rodar um programa em dois backends diferentes não se espera ter o mesmo resultado, mesmo em sistemas perfeitamente sem ruído.

source: As a basic example, imagine a drive pulse ``q0_X180`` calibrated on qubit 0 to enact an :math:`X180` pulse, which flips the state of qubit 0. If we use the samples from that pulse on qubit 1 on the same device, or qubit 0 on another device, we do not know what the resulting state will be -- but we can be pretty sure it won't be an :math:`X180` operation. The qubits are each unique, with various drive coupling strengths. If we have specified a frequency for the drive pulse, it's very probable that pulse would have little effect on another qubit, which has its own resonant frequency.
pt_br: Como exemplo básico, imagine uma pulsação ``q0_X180`` calibrada no qubit 0 para ativar um pulso :math:`X180`, que muda o estado do qubit 0. Se usarmos as amostras desse pulso no qubit 1 no mesmo dispositivo, ou qubit 0 em outro dispositivo, não sabemos qual será o estado resultante -- mas podemos ter certeza que não será uma operação de :math:`X180`. Os qubits são únicos, com várias forças de acoplamento na unidade. Se nós especificamos uma frequência para a pulsação é muito provável que o pulso teria pouco efeito em outro qubit, que tem a sua própria frequência de ressonância.

source: With that, we have motivated why information from the backend may be very useful at times for building Pulse schedules. The information included in a ``backend`` is broken into three main parts:
pt_br: Com isso, motivamos a razão pela qual as informações do backend podem ser às vezes muito úteis para a construção de schedules do Pulso. A informação incluída em um ``backend`` é dividida em três partes principais:

source: `**Configuration** <#Configuration>`__: static backend features
pt_br: `**Configuração** <#Configuração>`__: recursos de backend estáticos

source: `**Properties** <#Properties>`__: measured and reported backend characteristics
pt_br: `**Propriedades** <#Propriedades>`__: características de backend avaliadas e relatadas

source: `**Defaults** <#Defaults>`__: default settings for the OpenPulse-enabled backend
pt_br: `**Padrões** <#Defaults>`__: configurações padrão para o backend habilitado pelo OpenPulse

source: which are each covered in the following sections. While all three of these contain interesting data for Pulse users, the defaults are *only* provided for backends enabled with OpenPulse.
pt_br: que são abordadas cada uma nas seguintes seções. Embora todos estas três partes contenham dados interessantes para usuários do Pulso, os padrões são fornecidos *apenas* para backends habilitados com OpenPulse.

source: The first thing you'll need to do is grab a backend to inspect. Here we use a mocked backend that contains a snapshot of data from the real OpenPulse-enabled backend.
pt_br: A primeira coisa que você precisa fazer é acessar um backend para inspecionar. Aqui usamos um backend simulado (mocked, em inglês) que contém um instantâneo do dado de um backend habilitado por um OpenPulse real.

source: Configuration
pt_br: Configuração

source: The configuration is where you'll find data about the static setup of the device, such as its name, version, the number of qubits, and the types of features it supports.
pt_br: A configuração é onde você encontrará dados sobre a configuração estática do dispositivo, como o seu nome, versão, o número de qubits e os tipos de recursos que ele suporta.

source: Let's build a description of our backend using information from the ``backend``'s config.
pt_br: Vamos construir uma descrição do nosso backend usando as informações da configuração de ``backend``.

source: Neat! All of the above configuration is available for any backend, whether enabled with OpenPulse or not, although it is not an exhaustive list. There are additional attributes available on Pulse backends. Let's go into a bit more detail with those.
pt_br: Legal! Toda a configuração acima está disponível para qualquer backend, seja ativada com OpenPulse ou não, embora não seja uma lista exaustiva. Existem atributos adicionais disponíveis no backend do Pulso. Vamos entrar um pouco mais em detalhes destes.

source: The **timescale**, ``dt``, is backend dependent. Think of this as the inverse sampling rate of the control rack's arbitrary waveform generators. Each sample point and duration in a Pulse ``Schedule`` is given in units of this timescale.
pt_br: O **intervalo de tempo**, ``dt`` é dependente do backend. Pense nisso como a taxa inversa da amostragem dos geradores de onda arbitrária da bolsa de controle. Cada ponto e duração amostrais em um Pulso ``Schedule`` é fornecido em unidades deste intervalo de tempo.

source: The configuration also provides information that is useful for building measurements. Pulse supports three measurement levels: ``0: RAW``, ``1: KERNELED``, and ``2: DISCRIMINATED``. The ``meas_levels`` attribute tells us which of those are supported by this backend. To learn how to execute programs with these different levels, see this page -- COMING SOON.
pt_br: A configuração também fornece informações que são úteis para a construção de medições. Pulso suporta três níveis de medição: `0: RAW``, ``1: KERNELED``, and ``2: DISCRIMINATED``. O atributo ``meas_levels`` nos diz qual daqueles é suportado por este backend. Para saber como executar programas com esses níveis diferentes, consulte esta página -- EM BREVE.

source: For backends which support measurement level 0, the sampling rate of the control rack's analog-to-digital converters (ADCs) also becomes relevant. The configuration also has this info, where ``dtm`` is the time per sample returned:
pt_br: Para os backends com suporte de medida do nível 0, a taxa de amostragem da plataforma de controle dos conversores analíticos a digitais (ADCs) também se torna relevante. A configuração também possui essa informação, onde ``dtm`` é o tempo por amostra retornada:

source: The measurement map, explained in detail on [this page COMING SOON], is also found here.
pt_br: O mapa de medição, explicado em detalhes na [esta página EM BREVE], também é encontrado aqui.

source: The configuration also supplies convenient methods for getting channels for your schedule programs. For instance:
pt_br: A configuração também fornece métodos convenientes para obter canais para seus programas schedule. Por exemplo:

source: It is a matter of style and personal preference whether you use ``config.drive(0)`` or ``DriveChannel(0)``.
pt_br: É uma questão de estilo e preferência pessoal se você usa ``config.drive(0)`` ou ``DriveChannel(0)``.

source: Properties
pt_br: Propriedades

source: The ``backend`` properties contain data that was measured and optionally reported by the provider. Let's see what kind of information is reported for qubit 0.
pt_br: As propriedades ``backend`` contêm dados que foram medidos e opcionalmente relatados pelo provedor. Vamos ver que tipo de informação é reportada para o qubit 0.

source: Properties are not guaranteed to be reported, but backends without Pulse access typically also provide this data.
pt_br: As propriedades não têm a garantia de serem relatadas, mas os backends sem acesso ao Pulso normalmente também fornecem esses dados.

source: Defaults
pt_br: Padrões

source: Unlike the other two sections, ``PulseDefaults`` are only available for Pulse-enabled backends. It contains the default program settings run on the device.
pt_br: Ao contrário das outras duas seções, o ``PulseDefaults`` está disponível apenas para backends habilitados por Pulso. Ele contém as configurações padrão do programa que são executadas no dispositivo.

source: Drive frequencies
pt_br: Frequências do drive

source: Defaults contains the default frequency settings for the drive and measurement signal channels:
pt_br: Os padrões contém as configurações de frequência padrão para o drive e canais de medição de sinal:

source: Pulse Schedule definitions for QuantumCircuit instructions
pt_br: Definições de Schedule de Pulso para instruções QuantumCircuit

source: Finally, one of the most important aspects of the ``backend`` for ``Schedule`` building is the ``InstructionScheduleMap``. This is a basic mapping from a circuit operation's name and qubit to the default pulse-level implementation of that instruction.
pt_br: Por fim, um dos aspectos mais importantes para a construção da ``Schedule`` do ``backend`` é o ``InstructionScheduleMap``. Este é um mapeamento básico a partir do nome de um circuito de operação e qubit para a implementação padrão do pulse-level dessa instrução.

source: Rather than build a measurement schedule from scratch, let's see what was calibrated by the backend to measure the qubits on this device:
pt_br: Ao invés de criar uma schedule de medição a partir do zero, vamos ver o que foi calibrado pelo backend para medir os qubits neste dispositivo:

source: This can easily be appended to your own Pulse ``Schedule`` (``sched += calibrations.get('measure', <qubits>) << sched.duration``)!
pt_br: Isto pode facilmente ser adicionado a sua própria ``Schedule`` Pulso (``sched += calibrations.get('measure', <qubits>) << sched.duration``)!

source: Likewise, each qubit will have a ``Schedule`` defined for each basis gate, and they can be appended directly to any ``Schedule`` you build.
pt_br: Da mesma forma, cada qubit terá uma ``Schedule`` definida para cada porta base e eles podem ser anexados diretamente a qualquer ``Schedule`` que você construir.

source: While building your schedule, you can also use ``calibrations.add(name, qubits, schedule)`` to store useful ``Schedule``\ s that you've made yourself.
pt_br: Ao criar sua schedule, você também pode usar ``calibrations.add(name, qubits, schedule)`` para armazenar ``Schedule``\ s úteis que você mesmo preparou.

source: On the `next page <6_pulse_scheduler.ipynb>`__, we'll show how to schedule ``QuantumCircuit``\ s into Pulse ``Schedule``\ s.
pt_br: Na `próxima página <6_pulse_scheduler.ipynb>`__, vamos mostrar como agendar ``QuantumCircuit``\ s em Pulso ``Schedule``.
