Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/pulse/6_pulse_scheduler.po
Languages: fr_fr, pt_br

source: This page was generated from `tutorials/pulse/6_pulse_scheduler.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/pulse/6_pulse_scheduler.ipynb`__.
pt_br: Esta página foi gerada a partir do `tutorials/pulse/6_pulse_scheduler.ipynb`__.

source: Using the Scheduler
fr_fr: Utiliser le Scheduler
pt_br: Usando o Scheduler

source: The scheduler will translate a ``QuantumCircuit`` into a Pulse ``Schedule``, using gate and measurement *calibrations*: an optimized pulse-level description of an operation on particular qubits.
fr_fr: L'ordonnanceur (``Scheduler``) va traduire un ``QuantumCircuit`` en une Pulse ``Schedule``, en utilisant des *calibrations* des ´´gates´´ et des mesures: une description optimisée au niveau d'impulsion d'une opération sur des qubits particuliers.
pt_br: O scheduler irá traduzir um ``QuantumCircuit`` em um Pulso ``Schedule``, usando o portão e a medida de *calibrações*: uma descrição otimizada de nível-pulso de uma operação em determinados qubits.

source: Backends that are OpenPulse enabled will typically have calibrations defined for measurements and for each of its basis gates. Calibrations can also be defined or updated by the user.
fr_fr: Les systèmes d'exécution (``Backends``) qui sont activés avec OpenPulse auront généralement des calibrations définis pour des mesures et pour chacune de ses portes (``gates``) de base. Les calibrations peuvent également être définis ou mis à jour par l'utilisateur.
pt_br: Backends que são OpenPulse ativados geralmente terão calibrações definidas para medições e para cada um dos seus portões base. As calibrações também podem ser definidas ou atualizadas pelo usuário.

source: Basic usage
fr_fr: Utilisation de base
pt_br: Uso básico

source: To start, build a quantum circuit as you would normally. For our example below, we create a simple Bell state.
fr_fr: Pour commencer, construisez un circuit quantique comme vous le feriez normalement. Pour notre exemple ci-dessous, nous créons un simple état de Bell.
pt_br: Para começar, construa um circuito quântico como você normalmente faria. Para o nosso exemplo abaixo, criamos um simples estado de Bell.

source: We'll use the mocked backend, ``FakeAlmaden``, to demonstrate how to use the scheduler. It contains default calibrations for measurement and for its basis gates. The Hadamard operation is not one of those basis gates, so we use the transpiler to compile our input circuit to an equivalent circuit in terms of the basis gates of the device.
fr_fr: Nous allons utiliser le backend moqué, ` ` FakeAlmaden ` `, pour montrer comment utiliser l'ordonnanceur (``Scheduler``). Il contient des calibrations par défaut pour la mesure et pour ses portes (``gates``) de base. L'opération Hadamard n'est pas une de ces portes de base, donc nous utilisons le transpiler pour compiler notre circuit d'entrée pour générer un circuit équivalent en termes de portes de base de l'appareil.
pt_br: Vamos usar o backend simulado, ``FakeAlmaden``, para demonstrar como usar o scheduler. Ele contém calibrações padrão para medida e para as suas portas base. A operação Hadamard não é uma dessas portas base, então usamos o transpiler para compilar nosso circuito de entrada para um circuito equivalente em termos das portas base do dispositivo.

source: Let's see how our schedule ``schedule`` built from the circuit ``transpiled_circ`` looks. (We select a range to plot because the measurement and acquire pulses are long.)
fr_fr: Voyons comment ressemble notre planning ``schedule`` construit à partir du circuit ``transpiled_circ``. (Nous sélectionnons une éventail à tracer car la mesure et l'acquisition des impulsions sont longues.)
pt_br: Vamos ver como está o nosso cronograma ``schedule`` construído a partir do circuito ``transpiled_circ``. (Nós selecionamos um intervalo para plotar porque a medição e pulsos adquiridos são longos.)

source: That covers the basics! We used the transpiler to rewrite the circuit in terms of the basis gates, and then used the backend's default calibrations to schedule the transpiled circuit. Next we will go through scheduling with calibrations we will build ourselves.
fr_fr: Cela couvre les éléments de base ! Nous avons utilisé le transpiler pour réécrire le circuit en termes de portes (´´gates´´) de base, puis utilisé les calibrations par défaut de backend pour programmer le circuit ´´transpiled´´. Ensuite, nous allons passer à l'ordonnancement avec des calibrations que nous construirons nous-mêmes.
pt_br: Isso cobre o básico! Utilizamos o transpiler para reescrever o circuito nos termos dos portões base e, em seguida, utilizamos as calibrações padrão do backend para programar o circuito transpilado. A seguir vamos passar pelo agendamento com calibrações que nós mesmos construiremos.

source: Scheduling with custom gate definitions
fr_fr: Ordonnance avec des définitions de porte customisées
pt_br: Agendamento com definições personalizadas de portão

source: Using the scheduler with Pulse, we are not restrained by the basis gates of the device. For instance, we can define a calibration for the Hadamard gate on qubit 0, which is used by our Bell state circuit. Our Hadamard will be a Gaussian pulse. In practice, the pulse shape and its parameters would be optimized through a series of Rabi experiments (see the `Qiskit Textbook <https://qiskit.org/textbook/ch-quantum-hardware/calibrating-qubits-openpulse.html>`__ for a walk through).
fr_fr: En utilisant le planificateur avec Pulse, nous ne sommes pas limités par les portes de base de l'appareil. Par exemple, nous pouvons définir un calibrage pour la porte d'Hadamard sur le qubit 0, qui est utilisé par notre circuit d'état Bell. Notre Hadamard sera une impulsion gaussienne. En pratique, la forme de l'impulsion et ses paramètres seraient optimisés grâce à une série d'expériences Rabi (voir le manuel " Qiskit Textbook <https://qiskit.org/textbook/ch-quantum-hardware/calibrating-qubits-openpulse.html>` __ pour un aperçu).
pt_br: Usando o scheduler com Pulse, não ficamos limitados pelos portões base do dispositivo. Por exemplo, podemos definir uma calibração para o portão de Hadamard no qubit 0, que é usado pelo nosso circuito de estado Bell. Nosso Hadamard será um pulso Gaussiano. Na prática, o formato de pulso e seus parâmetros seriam otimizados através de uma série de experimentos Rabi (veja o ` Qiskit Textbook <https://qiskit.org/textbook/ch-quantum-hardware/calibrating-qubits-openpulse.html>` __ para uma visão geral).

source: We add the ``h_q0`` calibration to the backend's existing ``InstructionScheduleMap`` containing the instruction calibration lookup. It has to be added by gate name -- here we use the standard gate name ``'h'`` -- and by qubit. **Remember that a gate calibrated on one qubit will not enact the same gate on another qubit.**
fr_fr: Nous ajoutons la calibration ``h_q0`` à la ``InstructionScheduleMap`` existante du backend contenant la recherche de calibration d'instructions. Il doit être ajouté par le nom de la porte -- ici nous utilisons le nom de la porte standard ``'h'`` -- et par qubit. **Rappelez-vous qu'une porte calibrée sur un qubit n'effectuera pas la même porte sur un autre qubit.**
pt_br: Adicionamos a calibração ``h_q0`` para o ``InstructionScheduleMap`` existente do backend contendo a pesquisa de calibração de instrução. Ele tem que ser adicionado pelo nome do portão -- aqui nós usamos o nome padrão do portão ``'h'`` -- e por qubit. **Lembre-se de que um portão calibrado em um qubit não irá executar o mesmo portão em outro qubit.**

source: Notice how this time, we were able to schedule ``circ``, which hasn't been transpiled, so it still has the Hadamard gate. The new ``h_q0`` calibration we added was used to schedule ``circ``.
fr_fr: Remarquez comment cette fois-ci, nous avons pu ordonnancer ` ` circ ` `, ce qui n'a pas été transpilé (``transpiled``), donc il a toujours la porte d'Hadamard. La nouvelle calibration ` ` h_q0`` 'a été utilisé pour ordonnancer ` ` circ ` `.
pt_br: Observe como dessa vez fomos capazes de agendar o ``circ``, o qual não foi transpilado, então ele ainda tem o portão Hadamard. A nova calibração ``h_q0`` que adicionamos foi usada para agendar ``circ``.

source: Building circuits with non-standard gates
fr_fr: Construction de circuits avec des portes non standard
pt_br: Construir circuitos com portões não-padrão

source: In the previous section, we added a native definition for a standard gate. In this section, we build a totally novel gate.
fr_fr: Dans la section précédente, nous avons ajouté une définition native pour une porte (``gate``) standard. Dans cette section, nous construisons une porte entièrement nouvelle.
pt_br: Na seção anterior, adicionamos uma definição nativa para um portão padrão. Nesta seção, construímos um portão totalmente novo.

source: The first step is to create a definition for it as a Pulse ``Schedule``. Below, we also demonstrate how these schedules can be built to accept parameters.
fr_fr: La première étape est de créer une définition pour cela en tant qu'Impulsion ``Schedule``. Ci-dessous, nous démontrons également comment ces ordonnanes (``Schdeules``) peuvent être construits pour accepter des paramètres.
pt_br: O primeiro passo é criar uma definição para ela como um Pulso ``Schedule``. Abaixo, também demonstramos como estas agendas podem ser construídas para aceitar parâmetros.

source: We call our schedule operation ``'my_2q'``, and define it over qubits 0 and 1 as we add it to our calibrations.
fr_fr: Nous appelons notre opération d'ordonnance ``'my_2q'``, et la définissons sur qubits 0 et 1 alors que nous l'ajoutons à nos calibrations.
pt_br: Chamamos a nossa operação de agendamento ``'my_2q'`` e a definimos a partir dos qubits 0 e 1 conforme a adicionamos às calibrações.

source: To prepare our circuit to use this definition, we need to create a new ``Gate`` with the same name that we defined above, ``'my_2q'``.
fr_fr: Pour préparer notre circuit à utiliser cette définition, nous devons créer une nouvelle ``Gate`` avec le même nom que celui que nous avons défini ci-dessus, ``'my_2q'``.
pt_br: Para preparar nosso circuito para usar esta definição, precisamos criar um novo ``Portão`` com o mesmo nome que definimos acima, ``'my_2q'``.

source: Now, we can build our circuit. When we use the new gate, ``my_2q``, we ``append`` it to our circuit, and otherwise build the circuit normally.
fr_fr: Maintenant, nous pouvons construire notre circuit. Lorsque nous utilisons la nouvelle porte, ` ` my_2q ` `, nous ` ` ajoutons ` ` (``append``) cela à notre circuit, et autrement construisons le circuit normalement.
pt_br: Agora, podemos construir nosso circuito. Quando usamos o novo portão, ``my_2q``, nós o adicionamos ao circuito e, de outra forma, construímos o circuito normalmente.

source: All of the operations in ``circ`` are defined in our ``cals``, so we could schedule it directly, but let's remove our qubit 0 Hadamard calibration so we can demonstrate how to use the transpiler with our novel 2Q gate.
fr_fr: Toutes les opérations dans ``circ`` sont définies dans nos ``cals``, donc nous pourrions les planifier (``schedule``) directement, mais nous allons supprimer notre calibration de Hadamard qubit 0 afin que nous puissions démontrer comment utiliser le transpiler avec notre nouvelle porte (``gate``) 2Q.
pt_br: Todas as operações no ``circ`` são definidas em nosso ``cals``, então poderíamos agendá-lo diretamente, mas vamos remover a calibração Hadamard do qubit 0 para demonstrarmos como usar o transpiler com o novo portão 2Q.

source: Now, we can schedule our ``transpiled_circ`` as we did before.
fr_fr: Maintenant, nous pouvons ordonnancer notre ``transpiled_circ`` comme nous l'avons fait auparavant.
pt_br: Agora, podemos agendar nosso ``transpiled_circ`` como fizemos antes.

source: Scheduler methods
fr_fr: Méthode d'ordonnance (``scheduler``)
pt_br: Métodos do Scheduler

source: The scheduler can follow multiple routines. By default, it follows an *as late as possible* (ALAP) rule. Another scheduling method is *as soon as possible*, (ASAP). For both methods, the output schedule is minimal: in the longest-duration operation path of the input circuit, the start time of each operation is the end time of the proceeding operation. The methods determine how to schedule operations outside that longest path.
fr_fr: L'ordonnanceur peut suivre plusieurs routines. Par défaut, il suit une règle * aussi tard que possible * (ALAP, as late as possible). Une autre méthode d'ordonnance est * dès que possible * (ASAP, as soon as possible). Pour les deux méthodes, le planning de sortie est minimal: dans le chemin d'opération de durée la plus longue du circuit d'entrée, le moment de début de chaque opération correspond au moment de fin de l'opération procédédente. Les méthodes déterminent comment planifier (``schedule``) des opérations en dehors de ce chemin le plus long.
pt_br: O scheduler pode seguir várias rotinas. Por padrão, segue uma regra *o mais tarde possível* (ALAP). Outro método de agendamento é *o mais rápido possível*, (ASAP). Para ambos os métodos, a schedule de saída é mínima: no caminho da operação de duração mais longa do circuito de entrada, o horário de início de cada operação é o momento final da operação seguinte. Os métodos determinam como agendar operações fora do caminho mais longo.

source: This is made clear through an example:
fr_fr: Ceci devient clair à travers un exemple:
pt_br: Isto fica claro através de um exemplo:

source: For our mocked backend, these :math:`X` gate operations are each the same duration (``duration = 160 dt``). For the schedule to be minimal, the two :math:`X` operations on qubit 0 will be scheduled back-to-back, and the measurement pulse will immediately follow the second of those pulses.
fr_fr: Pour notre backend simulé, ces opérations de :math:` X sont toutes de la même durée (` ` durée = 160 dt ` `). Pour que le planning (``schedule``) soit minimal, les deux opérations :math:` X'sur le qubit 0 seront planifiées consécutives (``back-to-back``), et l'impulsion de mesure suivra immédiatement la seconde de ces impulsions.
pt_br: Para nosso backend simulado, essas operações :math: do portão `X` tem a mesma duração cada (``duração = 160 dt``). Para o agendamento ser mínimo, as duas operações :math: de `X` no qubit 0 serão agendadas back-to-back e o pulso de medição seguirá imediatamente o segundo desses pulsos.

source: ALAP will choose the latest valid time to schedule lesser-constrained operations, so the :math:`X` gate on qubit 1 will play in sync with the second :math:`X` gate on qubit 0.
fr_fr: ALAP choisira le dernier moment valide pour ordonnancer des opérations moins restreintes, de sorte que la porte :math:` X'sur le qubit 1 exécutera en synchronisation avec la deuxième porte :math:` X'sur le qubit 0.
pt_br: ALAP irá escolher o último horário válido para agendar operações menos restritas, para que o :math: do portão `X` no qubit 1 execute em sincronia com o segundo :math: do portão `X` no bit 0.

source: On the other hand, as the name suggests, ASAP will schedule operations as soon as its resources are free. Thus, the :math:`X` gate on qubit 1 will be scheduled at ``time=0``, in sync with the first :math:`X` gate on qubit 0.
fr_fr: D'autre part, comme son nom l'indique, ASAP ordonnancera des opérations dès que ses ressources seront libres. Ainsi, la porte :math:` X'sur le qubit 1 sera programmée à ` ` time=0 ` `, en synchronisation avec la première porte :math:` X'sur le qubit 0.
pt_br: Por outro lado, como o nome sugere, o ASAP irá agendar as operações assim que seus recursos estiverem livres. Assim, :math: no portão `X` no qubit 1 será agendado em ``time=0``, em sincronia com o primeiro :math: do portão `X` no qubit 0.

source: ALAP is the default because it allows qubits to remain idle as long as possible. In this case, the difference between ALAP and ASAP may be negligible, but in ALAP, qubit 0 has *no* time to decay from the excited state before measurement.
fr_fr: ALAP est la valeur par défaut car elle permet aux qubits de rester inactifs aussi longtemps que possible. Dans ce cas, la différence entre ALAP et ASAP peut être négligeable, mais dans ALAP, le qubit 0 a * pas de temps * de décomposition (``decay``) à partir de l'état excité avant la mesure.
pt_br: ALAP é o padrão porque permite que qubits permaneçam inativos durante o maior tempo possível. Neste caso, a diferença entre ALAP e ASAP pode ser negligenciável, mas no ALAP, o qubit 0 *não* tem tempo para decair do estado excitado antes da medição.
