Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/pulse/7_pulse_simulator_duffing_model.po
Languages: pt_br

source: This page was generated from `tutorials/pulse/7_pulse_simulator_duffing_model.ipynb`__.
pt_br: Esta página foi gerada a partir de `tutorials/pulse/7_pulse_simulator_duffing_model.ipynb`__.

source: Qiskit Aer: Pulse simulation of two qubits using a Duffing oscillator model
pt_br: Qiskit Aer: Simulação de pulso de dois qubits usando um modelo de oscilador de Duffing

source: This notebook shows how to use the Qiskit Aer pulse simulator, which simulates experiments specified as pulse ``Schedule`` objects at the Hamiltonian level. The simulator solves the Schrodinger equation for a specified Hamiltonian model and pulse ``Schedule`` in the frame of the drift Hamiltonian.
pt_br: Este notebook mostra como usar o simulador de pulso Qiskit Aer, que simula experimentos especificados como objetos pulso ``Schedule`` ao nível Hamiltoniano. O simulador resolve a equação Schrodinger para um modelo Hamiltoniano e pulso ``Schedule`` especificados no quadro Hamiltoniano derivado.

source: In particular, in this tutorial we will: - Construct a model of a two qubit superconducting system. - Calibrate :math:`\pi` pulses on each qubit in the simulated system. - Observe cross-resonance oscillations when driving qubit 1 with target qubit 0.
pt_br: Em particular, neste tutorial, nós vamos: - Construir um modelo de sistema supercondutor de dois qubits. - Calibrar os pulsos :math:`\pi` em cada qubit do sistema simulado. - Observar as oscilações de ressonância cruzada ao verificar o qubit 1 com o qubit 0 de destino.

source: The Introduction outlines the concepts and flow of this notebook.
pt_br: A Introdução descreve os conceitos e o fluxo deste notebook.

source: 1. Introduction
pt_br: 1. Introdução

source: The main sections proceed as follows.
pt_br: As principais seções seguem-se da seguinte maneira.

source: Section 3: Duffing oscillator model
pt_br: Seção 3: Modelo de oscilador de Duffing

source: To simulate a physical system, it is necessary to specify a model. In this notebook, we will model superconducting qubits as a collection of *Duffing oscillators*. The model is specified in terms of the following parameters:
pt_br: Para simular um sistema físico é necessário especificar um modelo. Neste notebook, iremos modelar qubits supercondutores como uma coleção de *osciladores de Duffing*. O modelo é especificado em termos dos seguintes parâmetros:

source: Each Duffing oscillator is specified by a frequency :math:`\nu`, anharmonicity :math:`\alpha`, and drive strength :math:`r`, which result in the Hamiltonian terms:
pt_br: Cada oscilador de Duffing é especificado por uma frequência :math:`\nu`, anarmonicidade :math:`\alpha` e força :math:`r`, que resultam nos termos Hamiltonianos:

source: where :math:`D(t)` is the signal on the drive channel for the qubit, and :math:`a^\dagger` and :math:`a` are, respectively, the creation and annihilation operators for the qubit. Note that the drive strength :math:`r` sets the scaling of the control term, with :math:`D(t)` assumed to be a complex and unitless number satisfying :math:`|D(t)| \leq 1`. - A coupling between a pair of oscillators :math:`(l,k)` is specified by the coupling strength :math:`J`, resulting in an exchange coupling term:
pt_br: onde :math:`D(t)` é o sinal no canal de unidade do qubit, e :math:`a^\dagger` e :math:`a` são, respectivamente, os operadores de criação e aniquilação do qubit. Observe que a força de unidade :math:`r` define o tamanho do termo de controle, com :math:`D(t)` assumido por ser um número complexo e sem unidade satisfatória com :math:`|D(t)| \leq 1`. - Um acoplamento entre um par de osciladores :math:`(l,k)` é especificado pela força de acoplamento :math:`J`, resultando em um termo de acoplamento das trocas:

source: where the subscript denotes which qubit the operators act on. - Additionally, for numerical simulation, it is necessary to specify a cutoff dimension; the Duffing oscillator model is *infinite dimensional*, and computer simulation requires restriction of the operators to a finite dimensional subspace.
pt_br: onde o subscript denota em qual qubit os operadores atuam. - Além disso, para simulação numérica é necessário especificar uma dimensão de corte; o modelo do oscilador de Duffing é de *infinito dimensional* e a simulação do computador requer restrição dos operadores a um subespaço dimensional finito.

source: **In the code:** We will define a model of the above form for two coupled qubits using the helper function ``duffing_system_model``.
pt_br: **No código:** Definiremos um modelo do formato acima para dois qubits acoplados usando a função auxiliar ``duffing_system_model``.

source: Section 4: :math:`\pi`-pulse calibration using Ignis
pt_br: Seção 4: Usando Ignis para a calibração :math:`\pi`-pulse

source: Once the model is defined, we will calibrate :math:`\pi`-pulses on each qubit. A :math:`\pi`-pulse is defined as a pulse on the drive channel of a qubit that "flips" the qubit; i.e. that takes the ground state to the first excited state, and the first excited state to the ground state.
pt_br: Uma vez que o modelo é definido, calibraremos :math:`\pi`-pulsos em cada qubit. Um :math:`\pi`-pulso é definido como um pulso no canal de unidade de um qubit que "inverte" o qubit; i. Isso leva o estado neutro ao primeiro estado excitado, e o primeiro estado excitado até o estado neutro.

source: We will experimentally find a :math:`\pi`-pulse for each qubit using the following procedure: - A fixed pulse shape is set - in this case it will be a Gaussian pulse. - A sequence of experiments is run, each consisting of a Gaussian pulse on the qubit, followed by a measurement, with each experiment in the sequence having a subsequently larger amplitude for the Gaussian pulse. - The measurement data is fit, and the pulse amplitude that completely flips the qubit is found (i.e. the :math:`\pi`-pulse amplitude).
pt_br: Vamos experimentalmente encontrar um :math:`\pi`-pulso para cada pacote utilizando o seguinte procedimento: - Foi definida uma forma fixa de pulso - neste caso, será um pulso Gaussiano. - Uma sequência de experimentos é executada, cada um consistindo de um pulso Gaussiano no qubit, seguido de uma medida, com cada experimento na sequência tendo uma amplitude maior para o pulso Gaussiano. - Os dados de medição são ajustados e a amplitude de pulso que transforma completamente o qubit é encontrada (por exemplo, a amplitude :math:`\pi`-pulso).

source: **In the code:** Using Ignis we will construct ``Schedule`` objects for the above experiments, then fit the data to find the :math:`\pi`-pulse amplitudes.
pt_br: **No código:** usando Ignis, vamos construir objetos ``Schedule`` para os experimentos acima e ajustar os dados para encontrar as amplitudes :math:`\pi`-pulso.

source: Section 5: Cross-resonance oscillations
pt_br: Seção 5: Oscilações de ressonância cruzada

source: Once the :math:`\pi`-pulses are calibrated, we will simulate the effects of cross-resonance driving on qubit :math:`1` with target qubit :math:`0`. This means that we will drive qubit :math:`1` at the frequency of qubit :math:`0`, with the goal of observing that the trajectory and oscillations of qubit :math:`0` *depends* on the state of qubit :math:`1`. This phenomenon provides a basis for creating two-qubit *controlled* gates. Note: This section requires the calibration of the :math:`\pi`-pulse in Section 4.
pt_br: Uma vez que o :math:`\pi`-pulsos estiverem calibrados, vamos simular os efeitos da ressonância cruzada no qubit :math:`1` com alvo no qubit :math:`0`. Isso significa que vamos dirigir o qubit :math:`1` na frequência do qubit :math:`0`, com o objetivo de observar que as trajetórias e oscilações do qubit :math:`0` *dependem* do estado do qubit :math:`1`. Este fenômeno fornece uma base para a criação de portões *controlados* de dois-qubits. Nota: Esta seção requer a calibração do ` :math:`\pi`-pulso na Seção 4.

source: To observe cross-resonance driving, we will use experiments very similar to the :math:`\pi`-pulse calibration case: - Initially, qubit :math:`1` is either left in the ground state, or is driven to its first excited state using the :math:`\pi`-pulse found in Section 4. - A sequence of experiments is run, each consisting of a Gaussian pulse on qubit :math:`1` driven at the frequency of qubit :math:`0`, followed by a measurement of both qubits, with each experiment of the sequence having a subsequently larger amplitude for the Gaussian pulse.
pt_br: Para observar o direcionamento de ressonância cruzada, usaremos experimentos muito semelhantes aos do caso de calibração de :math:`\pi`-pulso: - Inicialmente, o qubit :math:`1` é deixado no estado neutro, ou é levado para o primeiro estado excitado usando o :math:`\pi`-pulso encontrado na Seção 4. - Uma sequência de experimentos é executada, cada um consistindo em um pulso Gaussiano no qubit :math:`1` impulsionado na frequência do qubit :math:`0` e seguido por uma medida de ambos os qubits, tendo cada experiência da sequência uma amplitude subsequentemente maior para o pulso Gaussiano.

source: **In the code:** Functions for defining the experiments and visualizing the data are constructed, including a visualization of the trajectory of the target qubit on the Bloch sphere.
pt_br: **No código:** Funções são construídas para definir os experimentos e visualizar os dados, incluindo a visualização da trajetória do qubit alvo na esfera de Bloch.

source: 2. Imports
pt_br: 2. Importações

source: This notebook makes use of the following imports.
pt_br: Este notebook faz uso das importações a seguir.

source: Import qiskit libraries for working with ``pulse`` and calibration:
pt_br: Importar bibliotecas do qiskit para trabalhar com ``pulso`` e calibração:

source: Imports for qiskit pulse simulator:
pt_br: Importações para simulador de pulso qiskit:

source: 3. Duffing oscillator system model
pt_br: 3. Modelo de sistema de oscilator de Duffing

source: An object representing a model for a collection of Duffing oscillators can be constructed using the ``duffing_system_model`` function. Here we construct a :math:`2` Duffing oscillator model with cutoff dimension :math:`3`.
pt_br: Um objeto representando um modelo para uma coleção de osciladores de Duffing pode ser construído utilizando a função ``duffing_system_model``. Aqui nós construímos um modelo de oscilador de Duffing :math:`2` com a dimensão de corte :math:`3`.

source: The function ``duffing_system_model`` returns a ``PulseSystemModel`` object, which is a general object for storing model information required for simulation with the ``PulseSimulator``.
pt_br: A função ``duffing_system_model`` retorna um objeto ``PulseSystemModel``, que é um objeto geral para armazenar informações de modelo necessárias para simulação com o ``PulseSimulator``.

source: 4 Calibrating :math:`\pi` pulses on each qubit using Ignis
pt_br: 4 Usando Ignis em cada qubit para calibrar pulsos :math:`\pi`

source: As described in the introduction, we now calibrate :math:`\pi` pulses on each qubit in ``two_qubit_model``. The experiments in this calibration procedure are known as *Rabi experiments*, and the data we will observe are known as *Rabi oscillations*.
pt_br: Como descrito na introdução, agora calibramos as pulsos :math:`\pi` em cada qubit em ``two_qubit_model``. Os experimentos neste procedimento de calibração são conhecidos como *experimentos Rabi* e os dados a que iremos observar são conhecidos como *oscilações Rabi *.

source: 4.1 Constructing the schedules
pt_br: 4.1 - Construindo os schedules

source: We construct the schedules using the ``rabi_schedules`` function in Ignis. To do this, we need to supply an ``InstructionScheduleMap`` containing a measurement schedule.
pt_br: Nós construímos os schedules utilizando a função ``rabi_schedules`` no Ignis. Para fazer isso, precisamos fornecer um ``InstructionScheduleMap`` que contém um agendamento da medição.

source: Next, construct the Rabi schedules.
pt_br: Em seguida, construa os Rabi schedules.

source: The ``Schedule``\ s in ``rabi_schedules`` correspond to experiments to generate Rabi oscillations on both qubits in parallel. Each experiment consists of a Gaussian pulse on the qubits of a given magnitude, followed by measurement.
pt_br: A ``Schedule``\ s em ``rabi_schedules`` corresponde a experimentos para gerar oscilações Rabi em ambos os qubits em paralelo. Cada experimento consiste em um pulso Gaussiano nos qubits em uma determinada magnitude, seguido de medição.

source: For example:
pt_br: Por exemplo:

source: 4.2 Simulate the Rabi experiments
pt_br: 4.2 Simule os experimentos Rabi

source: To simulate the Rabi experiments, assemble the ``Schedule`` list into a qobj. When assembling, pass the ``PulseSimulator`` as the backend.
pt_br: Para simular os experimentos Rabi, monte a lista ``Schedule`` em um qobj. Quando estiver montando, passe o ``PulseSimulator`` como backend.

source: Here, we want to use local oscillators with frequencies automatically computed from Duffing model Hamiltonian.
pt_br: Aqui, queremos utilizar osciladores locais com frequências calculadas automaticamente a partir do modelo de Duffing Hamiltoniano.

source: Run the simulation using the simulator backend.
pt_br: Execute a simulação usando o backend do simulador.

source: 4.3 Fit and plot the data
pt_br: 4.3 Ajustar e plotar os dados

source: Next, we use ``RabiFitter`` in Ignis to fit the data, extract the :math:`\pi`-pulse amplitude, and then plot the data.
pt_br: Em seguida, utilizamos ``RabiFitter`` no Ignis para ajustar os dados, extrair a amplitude de :math:` \pi `-pulso e em seguida, plotar os dados.

source: Plotted is the averaged IQ data for observing each qubit. Observe that here, each qubit oscillates between the 0 and 1 state. The amplitude at which a given qubit reaches the peak of the oscillation is the desired :math:`\pi`-pulse amplitude.
pt_br: Plotados são os dados de IQ averiguados para observar cada qubit. Observe que aqui, cada qubit oscila entre o estado de 0 e 1. A amplitude em que um dado qubit atinge o pico da oscilação é a amplitude desejada de :math:` \pi `-pulso.

source: 5. Oscillations from cross-resonance drive
pt_br: 5. Oscilações da unidade de ressonância cruzada

source: Next, we simulate the effects of a cross-resonance drive on qubit :math:`1` with target qubit :math:`0`, observing that the trajectory and oscillations of qubit :math:`0` *depends* on the state of qubit :math:`1`.
pt_br: Em seguida, simulamos os efeitos de uma unidade de ressonância cruzada no qubit :math:`1` com alvo no qubit :math:`0`, observando que a trajetória e oscilações do qubit :math:`0` *dependem* do estado do qubit :math:`1`.

source: **Note:** This section depends on the :math:`\pi`-pulse calibrations of Section 2.
pt_br: **Nota:** Esta seção depende das calibrações do :math:`\pi`-pulso da Seção 2.

source: 5.1 Cross-resonance ``ControlChannel`` indices
pt_br: 5.1 Índices de ressonância cruzada ``ControlChannel``

source: Driving qubit :math:`1` at the frequency of qubit :math:`0` requires use of a pulse ``ControlChannel``. The model generating function ``duffing_system_model``, automatically sets up ``ControlChannels`` for performing cross-resonance drives between pairs of coupled qubits. The index of the ``ControlChannel`` for performing a particular cross-resonance drive is retrievable using the class method ``control_channel_index`` on the returned ``PulseSystemModel``. For example, to get the ``ControlChannel`` index corresponding to a CR drive on qubit 1 with target 0, call the function ``control_channel_index`` with the tuple ``(1,0)``:
pt_br: Direcionando o qubit :math:`1` na frequência do qubit :math:`0` requer o uso de um pulso ``ControlChannel``. O modelo que gera a função ``duffing_system_model``, configura automaticamente ``ControlChannels`` para a execução de unidades de ressonância cruzada entre pares de qubits acoplados. O índice do ``ControlChannel`` para executar uma ressonância cruzada específica é recuperável utilizando o método de classe ``control_channel_index`` no ``PulseSystemModel`` retornado. Por exemplo, para obter o índice de ``ControlChannel`` correspondente a uma unidade CR no qubit 1 com alvo 0, chame a função ``control_channel_index`` com a tupla ``(1,0)``:

source: Hence, to perform a cross-resonance drive on qubit :math:`1` with target qubit :math:`0`, use ``ControlChannel(1)``. This will be made use of when constructing ``Schedule`` objects in this section.
pt_br: Portanto, para realizar uma unidade de ressonância cruzada no qubit :math:`1` com alvo no qubit :math:`0`, use ``ControlChannel(1)``. Isto fará uso dos objetos ``Schedule`` desta seção.

source: 5.2 Functions to generate the experiment list, and analyze the output
pt_br: 5.2 Funções para gerar a lista de experimentos e analisar a saída

source: First, we define a function ``cr_drive_experiments``, which, given the drive and target indices, and the option to either start with the drive qubit in the ground or excited state, returns a list of experiments for observing the oscillations.
pt_br: Primeiro, definimos uma função ``cr_drive_experiments``, que, dada a unidade e os índices alvo e a opção de começar com o qubit em estado neutro ou excitado, retorna uma lista de experimentos de observação das oscilações.

source: Next we create two functions for observing the data: - ``plot_cr_pop_data`` - for plotting the oscillations between the ground state and the first excited state - ``plot_bloch_sphere`` - for viewing the trajectory of the target qubit on the bloch sphere
pt_br: A seguir, criamos duas funções para observar os dados: - ``plot_cr_pop_data`` - para traçar as oscilações entre o estado neutro e o primeiro estado excitado - ``plot_bloch_sphere`` - para visualizar a trajetória do qubit alvo na esfera Bloch

source: 5.3 Drive qubit 1 to observe CR oscillations on qubit 0
pt_br: 5.3 Direcione o qubit 1 para observar oscilações CR no qubit 0

source: Qubit 1 in the ground state
pt_br: Qubit 1 em estado neutro

source: First, we drive with both qubit 0 and qubit 1 in the ground state.
pt_br: Primeiro, orientamos o "qubit 0" e "qubit 1" para o estado neutro.

source: Run the simulation:
pt_br: Execute a simulação:

source: Observe that qubit 1 remains in the ground state, while excitations are driven in qubit 0.
pt_br: Observe que o qubit 1 permanece no estado neutro, enquanto as excitações são conduzidas no qubit 0.

source: We may also observe the trajectory of qubit 0 on the Bloch sphere:
pt_br: Também podemos observar a trajetória do qubit 0 na esfera Bloch:

source: Qubit 1 in the first excited state
pt_br: Qubit 1 no primeiro estado excitado

source: Next, we again perform a CR drive qubit 1 with qubit 0 as the target, but now we start each experiment by flipping qubit 1 into the first excited state.
pt_br: Em seguida, voltamos a executar o direcionamento CR no qubit 1 com alvo no qubit 0, mas agora começamos cada experimento invertendo o qubit 1 ao primeiro estado excitado.

source: Observe that now qubit 1 is in the excited state, while oscillations are again being driven on qubit 0, now at a different rate as before.
pt_br: Observe que agora o qubit 1 está no estado excitado, enquanto oscilações voltam a ser conduzidas no qubit 0, agora em uma taxa diferente como antes.

source: Again, observe the trajectory of qubit 0 on the Bloch sphere:
pt_br: Novamente, observe a trajetória do qubit 0 na esfera Bloch:

source: Here we see that qubit 0 takes a *different* trajectory on the Bloch sphere when qubit 1 is in the excited state. This is what enables controlled operations between two qubits.
pt_br: Aqui vemos que o qubit 0 seguiu uma trajetória *diferente* na esfera Bloch quando o qubit 1 está no estado excitado. Isso é o que possibilita operações controladas entre dois qubits.
