Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/configuration.po
Languages: bn_bn, de_de, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_un, ta_in, tr_tr

source: ``transpile_optimization_level``: This takes an integer between 0-3 and is used to change the default optimization level for :func:`~qiskit.compiler.transpile` and :func:`~qiskit.execute.execute`.
bn_bn: ``transpile_optimization_level``: এটি ০-৩ এর মাঝে একটি পূর্ণসংখ্যা নেয় এবং ডিফল্ট অপটিমাইজেশন লেভেল পরিবর্তনের জন্য ব্যবহার করে :func:`~qiskit.compiler.transpile` এবং :func:`~qiskit.execute.execute`।
de_de: ``transpile_optimization_level``: Dies verlangt einen Integer zwischen 0-3 und wird verwendet, um die Standardoptimierungsstufe für :func:`~qiskit.compiler.transpile` und :func:`~qiskit.execute.execute` zu ändern.
es_un: ``transpile_optimization_level``: Esto toma un número entero entre 0-3 y se usa para cambiar el nivel de optimización predeterminado para :func:`~qiskit.compiler.transpile` y :func:`~qiskit.execute.execute`.
fr_fr: ``transpile_optimization_level``: admet une valeur entière comprise entre 0 et 3 et est utilisé pour modifier le niveau d'optimisation par défaut pour :func:`~qiskit.compiler.transpile` et :func:`~qiskit.execute.execute`.
id_id: ` ` transpile_optimization_level ` ` `: Ini mengambil bilangan bulat antara 0-3 dan digunakan untuk mengubah level optimisasi default untuk :func:` ~qiskit.compiler.transpile ` dan :func:` ~qiskit.execute.execute `.
it_it: ``transpile_optimization_level``: Il parametro accetta integer tra 0-3 ed è utilizzato per modificare l'optimization level di default per :func:`~qiskit.compiler.transpile` e :func:`~qiskit.execute.execute`.
ja_jp: ``transpile_optimization_level`` ：これは0〜3の整数を取り、 :func:`~qiskit.compiler.transpile` および :func:`~qiskit.execute.execute` のデフォルトの最適化レベルを変更するために使用されます。
ko_kr: ``transpile_optimization_level``: 이는 0-3사이의 정수를 취하고 :func:`~qiskit.compiler.transpile` 과 :func:`~qiskit.execute.execute` 을 위한 기본 최적화 레벨을 변경하는 데 사용된다.
pt_un: ``transpile_optimization_level``: Isso recebe um inteiro entre 0 e 3 e é usado para mudar o nível de otimização padrão para :func:`~qiskit.compiler.transpile` e :func:`~qiskit.execute.execute`.
ta_in: ``transpile_optimization_level``: இது 0-3 க்கு இடையில் ஒரு முழு எண்ணை எடுக்கும் மற்றும் இயல்புநிலை தேர்வுமுறை அளவை மாற்ற இவை பயன்படுகிறது, :func:`~ qiskit.compiler.transpile` மற்றும் :func:`~qiskit.execute.execute`.
tr_tr: ``transpile_optimization_level``: Bu, 0-3 arasında bir sayı alır ve bunu :func:`~qiskit.compiler.transpile` ve :func:`~qiskit.execute.execute için varsayılan optimizasyon seviyelerini değiştirmek için kullanır.

source: ``parallel``: This option takes a boolean value (either ``True`` or ``False``) and is used to configure whether `Python multiprocessing <https://docs.python.org/3/library/multiprocessing.html>`__ is enabled for operations that support running in parallel (for example transpilation of multiple :class:`~qiskit.circuit.QuantumCircuit` objects). The default setting in the user config file can be overriden by the ``QISKIT_PARALLEL`` environment variable.
bn_bn: ``parallel``: এই অপশনটি একটি বুলিয়ান মান নেয় (হয় ``True`` অথবা ``False``) এবং `Python multiprocessing <https://docs.python.org/3/library/multiprocessing.html>`__ ক্রিয়াকলাপ (অপারেশন) জন্য চালু/বন্ধ করার জন্য ব্যবহৃত হয় (উদাহরণস্বরূপ ট্রান্সপাইলেশন অব মাল্টিপল :class:`~qiskit.circuit.QuantumCircuit` objects). ইউজার কনফিগ ফাইলের ডিফল্ট সেটিং কর্মপরিবেশের চল রাশির ``QISKIT_PARALLEL`` দিয়ে পরিবর্তন করে দেয়া সম্ভব।
de_de: ` ` parallel ` `: Diese Option verwendet einen booleschen Wert (entweder ` ` True ` ` oder ` ` False ` `) und wird verwendet, um zu konfigurieren, ob ` Python multiprocessing <https://docs.python.org/3/library/multiprocessing.html>` __ für parallele Operationen aktiviert ist (z. B. die Übertragung von mehreren :class:` ~qiskit.circuit.QuantumCircuit ` -Objekten). Die Standardeinstellung in der Benutzerkonfigurationsdatei kann durch die Umgebungsvariable ` ` QISKIT_PARALLEL ` ` überschrieben werden.
es_un: ``parallel``: Esta opción toma un valor booleano (ya sea ``True`` o ``False``) y se usa para configurar si el `multiprocesamiento de Python <https://docs.python.org/3/library/multiprocessing.html>`__ está habilitado para operaciones que admiten la ejecución en paralelo (por ejemplo, la transpilación de varios objetos :class:`~qiskit.circuit.QuantumCircuit`). La configuración predeterminada en el archivo de configuración del usuario puede ser anulada por la variable de entorno ``QISKIT_PARALLEL``.
fr_fr: ``parallel`` : Cette option prend une valeur booléenne (soit ``True`` soit ``False``) et est utilisée pour configurer si `Python multiprocessing <https://docs.python.org/3/library/multiprocessing.html>`__ est activé pour les opérations qui prennent en charge l'exécution en parallèle (par exemple la transpilation de plusieurs instances de :class:`~qiskit.circuit.QuantumCircuit`). Le paramètre par défaut dans le fichier de configuration de l'utilisateur peut être remplacé par la variable d'environnement ``QISKIT_PARALLEL``.
ja_jp: ``parallel``: このオプションは (``True`` または ``False``) のブール値をとり、`Python multiprocessing <https://docs.python.org/3/library/multiprocessing.html>`__ が並列実行をサポートするオペレーションが有効かどうかを設定するのに使われます(例えば複数 :class:`~qiskit.circuit.QuantumCircuit` オブジェクトのトランスパイル)。 デフォルトはユーザー構成ファイルに設定されており、``QISKIT_PARALLEL`` 環境変数で上書きできます。
ko_kr: ``parallel``: 이 옵션은 boolean 값 ( ``True`` 또는 ``False``) 을 받아 `Python 멀티프로세싱 <https://docs.python.org/3/library/multiprocessing.html>` __이 병렬로 실행되는 것을 지원하는 작업에 대해 사용 가능한지 여부를 설정하는 데 사용된다 (예를 들어, 여러 :class:`~qiskit.circuit.QuantumCircuit` 오브젝트의 transpilation). 사용자 구성 파일의 기본 설정은 ``QISKIT_PARALLEL`` 환경 변수에 의해 대체될 수 있다.
pt_un: ``parallel``: Esta opção recebe um valor booleano (``True`` ou ``False``) e é usada para configurar se `Python multiprocessing <https://docs.python.org/3/library/multiprocessing.html>`__ está habilitado para operações que suportam executação em paralelo (por exemplo, a transpilação de múltiplos objetos :class:`~qiskit.circuit.QuantumCircuit`). A configuração padrão no arquivo de configuração do usuário pode ser sobreposta pela variável de ambiente ``QISKIT_PARALLEL``.
ta_in: ``parallel``: இந்த விருப்பம் பூலியன் மதிப்பை எடுக்கும் (``True`` அல்லது ``False``) மற்றும் `Python multiprocessing <https://docs.python.org/3/library/multiprocessing.html>`__ இணையாக இயங்குவதை ஆதரிக்கும் செயல்பாடுகளுக்கு இயக்கப்பட்டது (எடுத்துக்காட்டாக பலவற்றின் இடமாற்றம் :class:`~qiskit.circuit.QuantumCircuit` ஆப்ஜெக்ட்கள்). பயனர் உள்ளமைவு கோப்பில் இயல்புநிலை அமைப்பை ``QISKIT_PARALLEL`` சூழல் மாறி மூலம் மீறலாம்.
tr_tr: ``parallel``: Bu seçenek bir boole değeri alır ("Doğru" veya "Yanlış") ve paralel çalışmayı destekleyen işlemler için `Python multiprocessing <https://docs.python.org/3/library/multiprocessing.html>`__'nin etkinleştirilip etkinleştirilmediğini yapılandırmak için kullanılır (örneğin, birden fazla :class:`~qiskit.circuit.QuantumCircuit` nesnesi). Kullanıcı yapılandırma dosyasındaki varsayılan ayar, ``QISKIT_PARALLEL`` ortam değişkeni tarafından geçersiz kılınabilir.

source: ``num_processes``: This option takes an integer value (> 0) that is used to specify the maximum number of parallel processes to launch for parallel operations if parallel execution is enabled. The default setting in the user config file can be overriden by the ``QISKIT_NUM_PROCS`` environment variable.
bn_bn: ``num_processes``: এই অপশনটি একটি পূর্ণসংখ্যা (>০) নেয় যা সমান্তরাল এক্সিকিউশন যদি সক্রিয় করা থাকে তবে সমান্তরাল প্রসেসের সর্বোচ্চ সংখ্যা নির্ধারণ করে দেয়। ব্যবহারকারি কনফিগ নথি বা ফাইলে যে ডিফল্ট সেটিংস আছে তা ``QISKIT_NUM_PROCS`` কর্মপরিবেশ চল রাশি দিয়ে পরিবর্তন করা সম্ভব।
de_de: ` ` num_processes ` `: Diese Option verwendet ein Integer (> 0), um die maximale Anzahl paralleler Prozesse anzugeben, die für parallele Operationen gestartet werden sollen, wenn die parallele Ausführung aktiviert ist. Die Standardeinstellung in der Benutzerkonfigurationsdatei kann durch die Umgebungsvariable ` ` QISKIT_NUM_PROCS ` ` überschrieben werden.
es_un: ``num_processes``: Esta opción toma un valor entero (> 0) que se utiliza para especificar el número máximo de procesos paralelos a iniciar para operaciones paralelas si la ejecución paralela está habilitada. La configuración predeterminada en el archivo de configuración del usuario puede ser anulada por la variable de entorno ``QISKIT_NUM_PROCS``.
fr_fr: ``num_processes`` : Cette option prend une valeur entière (> 0) qui est utilisée pour spécifier le nombre maximum de processus parallèles à lancer pour les opérations parallèles si l'exécution parallèle est activée. La configuration par défaut dans le fichier de configuration de l'utilisateur peut être remplacée par la variable d'environnement ``QISKIT_NUM_PROCS``.
ja_jp: ``num_processes``: このオプションは整数値 (> 0) をとり、並列実行が有効である時の並列プロセッサの最大数を指定します。デフォルトはユーザー構成ファイルにあり、``QISKIT_NUM_PROCS`` 環境変数で上書きできます。
ko_kr: ``num_processes``: 이 옵션은 병렬 실행이 사용 가능한 경우 병렬 연산에 대해 실행할 최대 병렬 프로세스 수를 지정하는 데 사용되는 정수 값 (> 0) 을 사용한다. 사용자 구성 파일의 기본 설정은 ``QISKIT_NUM_PROCS`` 환경 변수로 대체할 수 있다.
pt_un: ``num_processes``: Esta opção recebe um valor inteiro (> 0) que é usado para especificar o número máximo de processos paralelos a serem iniciados para operações paralelas se a execução paralela estiver ativada. A configuração padrão no arquivo de configuração do usuário pode ser sobreposta pela variável de ambiente ``QISKIT_NUM_PROCS``.
ta_in: ``num_processes``: இந்த விருப்பம் ஒரு முழு எண் மதிப்பை (> 0) எடுக்கும், இது இணையான செயலாக்கம் இயக்கப்பட்டால் இணையான செயல்பாடுகளுக்குத் தொடங்க அதிகபட்ச இணையான செயல்முறைகளைக் குறிப்பிட பயன்படுகிறது. பயனர் உள்ளமைவு கோப்பில் இயல்புநிலை அமைப்பை ``QISKIT_NUM_PROCS`` சூழல் மாறி மூலம் மீறலாம்.
tr_tr: ``num_processes``: Bu seçenek, paralel yürütme etkinleştirilmişse, paralel işlemler için başlatılacak maksimum paralel işlem sayısını belirtmek için kullanılan bir tamsayı değeri (> 0) alır. Kullanıcı yapılandırma dosyasındaki varsayılan ayar, ``QISKIT_NUM_PROCS`` ortam değişkeni tarafından geçersiz kılınabilir.

source: Environment Variables
bn_bn: কর্মপরিবেশের চলরাশিসমূহ
de_de: Umgebungsvariablen
es_un: Variables de Entorno
fr_fr: Variables d'environnement
id_id: Variabel lingkungan
it_it: Variabili di Ambiente
ja_jp: 環境変数
ko_kr: 환경 변수
pt_un: Variáveis de Ambiente
ta_in: சுற்றுச்சூழல் மாறிகள்
tr_tr: Ortam Değişkenleri

source: There are also a few environment variables that can be set to alter the default behavior of Qiskit.
bn_bn: কর্মপরিবেশের কিছু চল রাশি পরিবর্তন করে Qiskit - এর ডিফল্ট আচরণ পরিবর্তন করা যায়।
de_de: Es gibt auch ein paar Umgebungsvariablen, die gesetzt werden können, um das Standardverhalten von Qiskit zu ändern.
es_un: También hay algunas variables de entorno que se pueden configurar para alterar el comportamiento predeterminado de Qiskit.
fr_fr: Il y a aussi quelques variables d'environnement qui peuvent être définies pour modifier le comportement par défaut de Qiskit.
id_id: Ada juga beberapa variabel lingkungan yang dapat diatur untuk mengubah perilaku default dari Qiskit.
it_it: Ci sono anche alcune variabili di ambiente che possono essere impostate per modificare il comportamento predefinito di Qiskit.
ja_jp: Qiskitのデフォルトの動作を変更するために設定できる環境変数もいくつかあります。
ko_kr: Qiskit의 기본 동작을 변경하기 위해 설정할 수 있는 몇 가지 환경 변수도 있다.
pt_un: Há também algumas variáveis de ambiente que podem ser definidas para alterar o comportamento padrão do Qiskit.
ta_in: Qiskit இயல்புநிலை நடத்தையை மாற்ற சில சூழல் மாறிகள் அமைக்கப்படலாம்.
tr_tr: Qiskit'in varsayılan davranışını değiştirmek için ayarlanabilen birkaç ortam değişkeni de vardır.

source: ``QISKIT_PARALLEL``: if this variable is set to ``TRUE`` it will enable the use of `Python multiprocessing <https://docs.python.org/3/library/multiprocessing.html>`__ to parallelize certain operations (for example transpilation over multiple circuits) in Qiskit Terra.
bn_bn: ``QISKIT_PARALLEL``: এই চলরাশির মান যদি ``TRUE`` করে দেয়া হয় তবে এটি সমান্তরালভাবে কিছু ক্রিয়াকলাপ (অপারেশন) করার জন্য Qiskit টেরাতে `Python multiprocessing <https://docs.python.org/3/library/multiprocessing.html>`__ এর ব্যবহারকে সক্রিয় করবে (উদাহরণস্বরূপ ট্রান্সপাইল ওভার মাল্টিপল বর্তনী)।
de_de: ` ` QISKIT_PARALLEL ` `: Wenn diese Variable auf ` ` TRUE ` ` gesetzt ist, wird sie die Verwendung von ` Python multiprocessing <https://docs.python.org/3/library/multiprocessing.html>` __ einschalten, um bestimmte Operationen (z. B. die Traspilation für Schaltkreise) in Qiskit Terra zu parallelisieren.
es_un: ``QISKIT_PARALLEL``: si esta variable se establece en ``TRUE``, permitirá el uso del `multiprocesamiento Python <https://docs.python.org/3/library/multiprocessing.html>`__ para paralelizar ciertas operaciones (por ejemplo, transpilación sobre múltiples circuitos) en Qiskit Terra.
fr_fr: ``QISKIT_PARALLEL`` : si cette variable est définie à ``TRUE``, elle activera l'utilisation de `Python multiprocessing <https://docs.python.org/3/library/multiprocessing.html>`__ pour paralléliser certaines opérations (par exemple la transpilation sur plusieurs circuits) dans Qiskit Terra.
ja_jp: ``QISKIT_IN_PARALLEL`` ：この変数が ``TRUE`` に設定されている場合、Qiskit Terra のいくつかの操作 (例えば複数回路のトランスパイル) を並列化するために `Python multiprocessing <https://docs.python.org/3/library/multiprocessing.html>`__ の使用が有効になります。
ko_kr: ``QISKIT_PARALLEL``: 이 변수의 값이 ``TRUE`` 가 되면, Qiskit Terra의 특정 동작 (예를 들어 여러 회로에 걸친 트랜스파일(transpilation)) 을 병렬화하기 위한 `Python 다중처리 <https://docs.python.org/3/library/multiprocessing.html>`__ 기능을 사용할 수 있다.
pt_un: ``QISKIT_PARALLEL``: se essa variável estiver definida como ``TRUE``, ela permitirá o uso de `Python multiprocessing <https://docs.python.org/3/library/multiprocessing.html>`__ para paralelizar certas operações (por exemplo, a transpilação de vários circuitos) no Qiskit Terra.
ta_in: ``QISKIT_PARALLEL``: இந்த மாறி ``TRUE`` என அமைக்கப்பட்டால், அது `Python multiprocessing <https://docs.python.org/3/library/multiprocessing.html>`__ Qiskit டெர்ராவில் செயல்பாடுகளை இணைக்க பயன்படுத்தப்படலாம் (எடுத்துக்காட்டாக பல சர்க்யூட்களுக்கு மேல் இடமாற்றம்).
tr_tr: ``QISKIT_PARALLEL``: eğer bu değişken ``TRUE`` olarak ayarlanırsa, belirli paralelleştirmeler için `Python multiprocessing <https://docs.python.org/3/library/multiprocessing.html>`__ kullanımına izin verir. Qiskit Terra'daki işlemler (örneğin çoklu devreler üzerinden aktarma).

source: ``QISKIT_NUM_PROCS``: Specifies the maximum number of parallel processes to launch for parallel operations if parallel execution is enabled. It takes an integer > 0 as the expected value.
bn_bn: ``QISKIT_NUM_PROCS``: যদি সমান্তরাল ক্রিয়াকলাপ (অপারেশন) এক্সিকিউশন সক্রিয় করা থাকে তবে সমান্তরাল প্রসেসের সর্বোচ্চ সংখ্যা নির্ধারণ করে দেয়। প্রত্যাশিত মান হিসাবে এটি একটি পূর্ণসংখ্যা নেয় যা > ০।
de_de: ` ` QISKIT_NUM_PROCS ` `: Gibt die maximale Anzahl paralleler Prozesse an, die für parallele Operationen gestartet werden sollen, wenn die parallele Ausführung aktiviert ist. Es erwartet einen Integer > 0.
es_un: ``QISKIT_NUM_PROCS``: Especifica el número máximo de procesos paralelos que se iniciarán para operaciones paralelas si la ejecución paralela está habilitada. Toma un número entero > 0 como valor esperado.
fr_fr: ``QISKIT_NUM_PROCS`` : Spécifie le nombre maximum de processus parallèles à lancer pour les opérations parallèles si l'exécution parallèle est activée. Prend un entier > 0 comme valeur attendue.
ja_jp: ``QISKIT_NUM_PROCS``: 並列実行が有効になっている場合、並列処理を起動するための並列プロセッサの最大数を指定します。これは整数 > 0 を取ります。
ko_kr: ``QISKIT_NUM_PROC``: 병렬 실행이 활성화된 경우 병렬 연산에 대해 실행할 최대 병렬 프로세스 수를 지정한다. 기대값으로 양의 정수를 사용한다.
pt_un: ``QISKIT_NUM_PROCS``: Especifica o número máximo de processos paralelos a serem iniciados para operações paralelas se a execução paralela estiver habilitada. Ele recebe um inteiro > 0 como o valor esperado.
ta_in: ``QISKIT_NUM_PROCS``: இணையான செயலாக்கம் இயக்கப்பட்டால், இணையான செயல்பாடுகளுக்குத் தொடங்க அதிகபட்ச இணையான செயல்முறைகளைக் குறிப்பிடுகிறது. இணையான செயலாக்கம் இயக்கப்பட்டிருந்தால். இது ஒரு முழு எண்> 0 ஐ எதிர்பார்க்கும் மதிப்பாக எடுக்கும்.
tr_tr: ``QISKIT_NUM_PROCS``: Paralel yürütme etkinleştirilmişse, paralel işlemler için başlatılacak maksimum paralel işlem sayısını belirtir. Beklenen değer olarak > 0 bir tamsayı alır.

source: ``RAYON_NUM_THREADS``: Specifies the number of threads to run multithreaded operations in Qiskit Terra. By default this multithreaded code will launch a thread for each logical CPU, if you'd like to adjust the number of threads Qiskit will use you can set this to an integer value. For example, setting ``RAYON_NUM_THREADS=4`` will only launch 4 threads for multithreaded functions.
de_de: ` ` RAYON_NUM_THREADS ` `: Gibt die Anzahl der Threads an, die Multithread-Operationen in Qiskit Terra ausführen sollen. Standardmäßig wird dieser Multithread-Code einen Thread für jede logische CPU starten, wenn Sie die Anzahl der Threads anpassen möchten, die Qiskit verwenden wird, können Sie diesen auf einen ganzzahligen Wert setzen. Wenn Sie z. B. ` ` RAYON_NUM_THREADS=4 ` ` festlegen, werden nur 4 Threads für Multithread-Funktionen gestartet.
es_un: ``RAYON_NUM_THREADS``: Especifica el número de subprocesos para ejecutar operaciones multiproceso en Qiskit Terra. De forma predeterminada, este código de múltiples subprocesos iniciará un hilo para cada CPU lógica; si deseas ajustar la cantidad de subprocesos que usará Qiskit, puedes establecerlo en un valor entero. Por ejemplo, configurar ``RAYON_NUM_THREADS=4`` solo lanzará 4 subprocesos para funciones multiproceso.
fr_fr: ` ` RAYON_NUM_THREADS ` `: Indique le nombre d'unités d'exécution pour exécuter des opérations multiprocessus dans Qiskit Terra. Par défaut, ce code à unités d'exécution multiples lance une unité d'exécution pour chaque unité centrale logique, si vous souhaitez ajuster le nombre d'unités d'exécution Qiskit, vous pouvez définir cette valeur à un entier. Par exemple, le paramètre ``RAYON_NUM_THREADS=4`` ne lance que 4 unités d'exécution pour les fonctions à unités d'exécution multiples.
ja_jp: ``RAYON_NUM_THREADS`` : Qiskit Terraでマルチスレッド操作を実行するスレッドの数を指定します。デフォルトでは、このマルチスレッド・コードは論理 CPU ごとにスレッドを起動します。スレッド数を調整する必要がある場合は、この値を整数値に設定できます。例えば、 ``RAYON_NUM_THREADS=4`` を設定すると、マルチスレッド関数用に4つのスレッドのみが起動されます。
ko_kr: ``RAYON_NUM_THREADS``: Qiskit Terra에서 다중 스레드 작업을 실행할 스레드 수를 지정한다. 기본적으로 이 다중 스레드 코드는 각 논리적 CPU에 대한 스레드를 시작한다. Qiskit이 사용할 스레드 수를 조정하려면 이것을 정수 값으로 설정한다. 예를 들어 ``RAYON_NUM_THREADS=4`` 를 설정하면 다중 스레드 기능에 대해 4개의 스레드만 실행된다.
pt_un: ``RAYON_NUM_THREADS``: Especifica o número de threads para executar operações multithread no Qiskit Terra. Por padrão, este código multithread iniciará um thread para cada CPU lógica, se você quiser ajustar o número de threads que o Qiskit usará, você pode definir isso para um valor inteiro. Por exemplo, a configuração de ``RAYON_NUM_THREADS=4`` lançará apenas 4 threads para funções multithread.
ta_in: ``RAYON_NUM_THREADS``: Qiskit Terra இல் மல்டித்ரெட் செயல்பாடுகளை இயக்குவதற்கான நூல்களின் எண்ணிக்கையைக் குறிப்பிடுகிறது. முன்னிருப்பாக இந்த மல்டித்ரெட் குறியீடு ஒவ்வொரு தருக்க CPU க்கும் ஒரு நூலைத் தொடங்கும், Qiskit பயன்படுத்தும் நூல்களின் எண்ணிக்கையை நீங்கள் சரிசெய்ய விரும்பினால், இதை முழு எண் மதிப்பாக அமைக்கலாம். எடுத்துக்காட்டாக, ``RAYON_NUM_THREADS=4`` அமைப்பது மல்டித்ரெட் செயல்பாடுகளுக்கு 4 த்ரெட்களை மட்டுமே துவக்கும்.
tr_tr: ``RAYON_NUM_THREADS``: Qiskit Terra'da çok iş parçacıklı işlemleri çalıştırmak için iş parçacığı sayısını belirtir. Varsayılan olarak bu çok iş parçacıklı kod, her bir mantıksal CPU için bir iş parçacığı başlatır, Qiskit'in kullanacağı iş parçacığı sayısını ayarlamak isterseniz, bunu bir tamsayı değerine ayarlayabilirsiniz. Örneğin, ``RAYON_NUM_THREADS=4`` ayarı çok iş parçacıklı işlevler için yalnızca 4 iş parçacığı başlatır.
