Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/configuration.po
Languages: bn_bn, de_de, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_un, ta_in, tr_tr

source: Local Configuration
bn_bn: লোকাল কনফিগারেশন
de_de: Lokale Konfiguration
es_un: Configuración Local
fr_fr: Configuration locale
id_id: Konfigurasi Lokal
it_it: Configurazione Locale
ja_jp: ローカル構成
ko_kr: 로컬 설정
pt_un: Configuração local
ta_in: லோக்கல் உள்ளமைவு
tr_tr: Yerel Yapılandırma

source: Once you have Qiskit installed and running there are some optional configuration steps you can take to change the default behavior of Qiskit for your specific use case.
bn_bn: একবার যখন আপনি Qiskt ইনস্টল করে চালিয়ে ফেলেছেন, কিছু অপশনাল কনফিগারেশন পদক্ষেপ নিয়ে আপনি Qiksit এর মূলত ব্যবহার নিজের মতন use case সাজিয়ে নিতে পারেন।
de_de: Sobald Sie Qiskit installiert und ausgeführt haben, können Sie einige optionale Konfigurationsschritte vornehmen, um das Standardverhalten von Qiskit für Ihren speziellen Anwendungsfall zu ändern.
es_un: Una vez que tengas Qiskit instalado y ejecutándose hay algunos pasos de configuración opcionales que puedes tomar para cambiar el comportamiento predeterminado de Qiskit para el uso específico que le vayas a dar.
fr_fr: Une fois que vous avez installé Qiskit et qu'il fonctionne, il y a quelques étapes optionnelles de configuration que vous pouvez effectuer pour modifier le comportement par défaut de Qiskit afin de l'adapter à votre profil d'utilisation spécifique.
id_id: Setelah Anda menginstall Qiskit, ada beberapa konfigurasi opsional yang dapat Anda ambil untuk mengubah perilaku default dari Qiskit khusus untuk penggunaan spesifik Anda.
it_it: Una volta che Qiskit è stato installato ed è funzionante, è possibile seguire alcuni passaggi di configurazione opzionali per modificare alcune impostazioni di default di Qiskit, in modo da adattarlo a casi d'uso specifici.
ja_jp: Qiskitをインストールし実行できるようになった後で、特定のユースケースに合わせてQiskitのデフォルトの動作を変更するためのオプション構成手順がいくつかあります。
ko_kr: Qiskit을 설치하고 실행하면, 선택 구성 단계가 있어 특정한 사용 목적에 맞도록 Qiskit의 기본 설정을 변경 할 수 있다.
pt_un: Uma vez que você tenha Qiskit instalado e em execução, existem algumas etapas de configuração opcionais que você pode tomar para alterar o comportamento padrão do Qiskit para o seu caso de uso específico.
ta_in: நீங்கள் Qiskit நிறுவப்பட்டதும் இயங்கினதும் உங்கள் குறிப்பிட்ட பயன்பாட்டு வழக்கில் Qiskit இயல்புநிலை நடத்தையை மாற்ற சில விருப்ப உள்ளமைவு படிகள் உள்ளன.
tr_tr: Qiskit'i bir kez kurup çalıştırdıktan sonra özel kullanım alanınız için Qiskit'in varsayılan davranımını değiştirmek için izleyebileceğiniz bazı opsiyonel adımlar vardır.

source: User Config File
bn_bn: ব্যবহারকরি কনফিগ ফাইল
de_de: Benutzerkonfigurationsdatei
es_un: Archivo de Configuración de Usuario
fr_fr: Fichier de configuration utilisateur
it_it: File User Config
ja_jp: ユーザー構成ファイル
ko_kr: 사용자 구성 파일
pt_un: Arquivo de Configuração do Usuário
ta_in: பயனர் கட்டமைப்பு கோப்பு
tr_tr: Kullanıcı Yapılandırma Dosyası

source: The main location for local configuration of Qiskit is the user config file. This is an `ini <https://en.wikipedia.org/wiki/INI_file>`__ format file that can be used to change defaults in Qiskit.
bn_bn: Qiskit - এর স্থানীয় যান্ত্রিক বিন্যাস (কনফিগারেশন) মূলত ইউজার কনফিগ নথিতে থাকে। `ini <https://en.wikipedia.org/wiki/INI_file>`__ এই ফরম্যাট ফাইলটি Qiskit - এর ডিফল্ট বিন্যাস পরিবর্তন করার জন্য ব্যবহৃত হয়।
de_de: Der Hauptort für die lokale Konfiguration von Qiskit ist die Konfigurationsdatei des Benutzers (user config file). Dies ist eine `ini <https://en.wikipedia.org/wiki/INI_file>`__ Formatdatei, die verwendet werden kann, um die Standardwerte in Qiskit zu ändern.
es_un: La ubicación principal para la configuración local de Qiskit es el archivo de configuración de usuario. Este es un archivo en formato `ini <https://en.wikipedia.org/wiki/INI_file>`__ que puede ser usado para cambiar los valores predeterminados en Qiskit.
fr_fr: L'emplacement principal de la configuration locale de Qiskit est le fichier de configuration de l'utilisateur. Il s'agit d'un fichier de format `ini <https://en.wikipedia.org/wiki/INI_file>` __ qui peut être utilisé pour modifier les valeurs par défaut de Qiskit.
id_id: Lokasi utama untuk konfigurasi lokal dari Qiskit adalah user config file. Ini adalah file format ` ini <https://en.wikipedia.org/wiki/INI_file>` __ yang dapat digunakan untuk mengubah konfigurasi default Qiskit.
it_it: La maggior parte delle configurazioni locali di Qiskit si trovano nel file user config. Il file, in formato `ini <https://en.wikipedia.org/wiki/INI_file>`__, può essere utilizzato per modificare le impostazioni di defalt in Qiskit.
ja_jp: Qiskitのローカル設定の主なロケーションはユーザー設定ファイルです。 これは、Qiskitのデフォルトを変更するために使用できる `ini <https://en.wikipedia.org/wiki/INI_file>`__ 形式のファイルです。
ko_kr: Qiskit의 로컬 구성을 위한 기본 위치는 사용자 구성 파일이다. 이는 Qiskit 기본값을 변경할 수 있는 `ini <https://en.wikipedia.org/wiki/INI_file>`__ 형식 파일이다.
pt_un: O local principal para configuração local do Qiskit é o arquivo configuração do usuário. Este é um arquivo de formato `ini <https://en.wikipedia.org/wiki/INI_file>`__ que pode ser usado para alterar padrões no Qiskit.
ta_in: Qiskit லோக்கல் உள்ளமைவுக்கான முக்கிய இடம் பயனர் கட்டமைப்பு கோப்பு. இது ஒரு `ini <https://en.wikipedia.org/wiki/INI_file>`__ வடிவமைப்பு கோப்பு, இது Qiskit இயல்புநிலைகளை மாற்ற பயன்படுகிறது.
tr_tr: Qiskit yerel yapılandırmasının ana konumu, kullanıcı yapılandırma dosyasıdır. Bu, Qiskit'te varsayılanları değiştirmek için kullanılabilecek bir `ini <https://en.wikipedia.org/wiki/INI_file>`__ format dosyasıdır.

source: For example:
bn_bn: উদাহরণস্বরূপঃ
de_de: Zum Beispiel:
es_un: Por ejemplo:
fr_fr: Par exemple :
id_id: Sebagai contoh:
it_it: Ad esempio:
ja_jp: 例:
ko_kr: 예시:
pt_un: Por exemplo:
ta_in: உதாரணத்திற்கு:
tr_tr: Örneğin:

source: By default this file lives in ``~/.qiskit/settings.conf`` but the path used can be overriden with the ``QISKIT_SETTINGS`` environment variable. If ``QISKIT_SETTINGS`` is set its value will used as the path to the user config file.
bn_bn: এই ফাইলটি ``~/.qiskit/settings.conf`` এখানে ডিফল্টভাবে থাকলেও পাথ ``QISKIT_SETTINGS`` কর্মপরিবেশ চল রাশি দিয়ে পরিবর্তনযোগ্য। যদি ``QISKIT_SETTINGS`` এর মান বসানো হয়ে থাকে তবে সেই মান ইউজার কনফিগ ফাইলের পাথ হিসাবে ব্যবহৃত হবে।
de_de: Standardmäßig befindet sich diese Datei in ``~/.qiskit/settings.conf``, aber der verwendete Pfad kann mit der ``QISKIT_SETTINGS`` Umgebungsvariable überschrieben werden. Wenn ``QISKIT_SETTINGS`` gesetzt wird, wird dieser Wert als Pfad zur Benutzerkonfigurationsdatei verwendet.
es_un: Por defecto, este archivo se encuentra en ``~/.qiskit/settings.conf`` pero la ruta utilizada puede ser ignorada con la variable de entorno ``QISKIT_SETTINGS``. Si ``QISKIT_SETTINGS`` esta siendo utilizada, su valor será usado como la ruta al archivo de configuración de usuario.
fr_fr: Par défaut, ce fichier réside dans ``~/.qiskit/settings.conf`` mais le chemin utilisé peut être remplacé en utilisant la variable d'environnement ``QISKIT_SETTINGS``. Si ``QISKIT_SETTINGS`` est défini, sa valeur sera utilisée comme chemin d'accès au fichier de configuration de l'utilisateur.
id_id: Secara default file ini tinggal di ` `~/.qiskit/settings.conf ` ` tapi path yang digunakan dapat diganti dengan variabel ` ` QISKIT_SETTINGS ` ` ` variabel lingkungan. Jika ` ` ` QISKIT_SETTINGS ` ` ` sudah ditetapkan, nilainya akan digunakan sebagai path ke berkas konfigurasi pengguna.
it_it: La posizione predefinita di questo file è ``~/.qiskit/settings.conf``, ma il path può essere modificato utilizzando la variabile di ambiente ``QISKIT_SETTINGS``. Se a ``QISKIT_SETTINGS`` viene dato un valore, questo verrà utilizzato come path del file user config.
ja_jp: デフォルトでは、このファイルは ``~/.qiskit/settings.conf`` にありますが、使用されるパスは ``QISKIT_SETTINGS`` 環境変数でオーバーライドできます。 ``QISKIT_SETTINGS`` が設定されている場合、その値はユーザー構成ファイルへのパスとして使用されます。
ko_kr: 기본적으로 이 파일은 ``~/.qiskit/settings.conf`` 에 있지만 사용되는 경로는 ``QISKIT_SETTINGS`` 환경 변수로 대체될 수 있다. ``QISKIT_SETTINGS`` 값이 설정되면 사용자 구성 파일에 대한 경로로 사용된다
pt_un: Por padrão, esse arquivo se encontra em ``~/.qiskit/settings.conf`` mas o caminho usado pode ser alterado a variável de ambiente ``QISKIT_SETTINGS``. Se ela estiver definida, seu valor será usado como caminho para o arquivo de configurações do usuário.
ta_in: இயல்பாக இந்த கோப்பு ``~ /.qiskit/settings.conf`` இல் வாழ்கிறது, ஆனால் பயன்படுத்தப்படும் பாதையை ``QISKIT_SETTINGS`` சூழல் மாறி மூலம் மீறலாம். ``QISKIT_SETTINGS`` அமைக்கப்பட்டால், அதன் மதிப்பு பயனர் கட்டமைப்பு கோப்பிற்கான பாதையாக பயன்படுத்தப்படும்.
tr_tr: Varsayılan olarak bu dosya ``~/.qiskit/settings.conf`` içerisindedir ancak kullanılan yol ``QISKIT_SETTINGS`` ortam değişkeni ile geçersiz olabilir. Eğer ``QISKIT_SETTINGS`` kurulu ise, değeri kullanıcı yapılandırma dosyasına giden yol olarak kullanılacaktır.

source: Available options:
bn_bn: বিকল্প সমূহঃ
de_de: Mögliche Optionen:
es_un: Opciones disponibles:
fr_fr: Options disponibles :
id_id: Pilihan yang tersedia:
it_it: Opzioni disponibili:
ja_jp: 利用可能なオプション：
ko_kr: 사용 가능한 옵션
pt_un: Opções disponíveis:
ta_in: கிடைக்கும் விருப்பங்கள்:
tr_tr: Mevcut Seçenekler:

source: ``circuit_drawer``: This is used to change the default backend for the circuit drawer :meth:`qiskit.circuit.QuantumCircuit.draw` and :func:`qiskit.visualization.circuit_drawer`. It can be set to ``latex``, ``mpl``, ``text``, or ``latex_source`` and when the ``ouptut`` kwarg is not explicitly set that drawer backend will be used.
bn_bn: ``circuit_drawer``: এটি বর্তনী (সার্কিট) অঙ্কনের ডিফল্ট ব্যাকএন্ড পরিবর্তন করার জন্য ব্যবহার করা হয়ে থাকে। :meth:`qiskit.circuit.QuantumCircuit.draw` এবং :func:`qiskit.visualization.circuit_drawer`. এটার মান হতে পারে ``latex``, ``mpl``, ``text``, অথবা ``latex_source`` এবং যখন ``ouptut`` কীওয়ার্ড আর্গুমেন্ট ঠিক করে দেয়া নেই তখন ড্রয়ার ব্যাকএন্ড ব্যবহৃত হবে।
de_de: ` ` circuit_Schublade ` `: Wird verwendet, um das Standard-Backend für den Schaltkreis-Zeichner :meth:` qiskit.circuit.QuantumCircuit.draw ` und :func:` qiskit.visualization.circuit_drawer ` zu ändern. Es kann auf ` ` latex ` `, ` ` mpl ` `, ` ` text ` `, oder ` ` latex_source ` ` gesetzt werden und wenn ` ` ouptut ` ` kwarg nicht explizit gesetzt ist, wird das Zeichner-Backend verwendet.
es_un: ``circuit_drawer``: Este se usa para cambiar el backend predeterminado para el dibujador de circuitos :meth:`qiskit.circuit.QuantumCircuit.draw` y :func:`qiskit.visualization.circuit_drawer`. Se puede configurar en ``latex``, ``mpl``, ``text``, o ``latex_source`` y cuando el argumento kwarg ``ouptut`` no está configurado explícitamente, se utilizará el backend del dibujador.
fr_fr: ``circuit_drawer``: Ceci est utilisé pour modifier le système par défaut pour le dessin des circuits :meth:`qiskit.circuit.QuantumCircuit.draw` et :func:`qiskit.visualization.circuit_drawer`. Il peut être défini sur ``latex``, ``mpl``, ``text`` ou ``latex_source`` et lorsque l'argument de mot clef ``ouptut`` n'est pas explicitement défini ce style de dessin sera utilisé.
id_id: ` ` ` circuit_drawer ` `: Ini digunakan untuk mengubah backend default bagi penggambar sirkuit :meth:` qiskit.circuit.QuantumCircuit.draw ` dan :func:` qiskit.visualization.circuit_drawer `. Hal ini dapat diatur ke ` ` latex ` `, ` ` mpl ` `, ` ` text ` `, atau ` ` latex_source ` ` dan ketika ` ` ouptut ` ` kwarg tidak secara eksplisit diatur, maka backend drawer yang akan digunakan.
it_it: ``circuit_drawer``: Viene utilizzato per modificare il backend di default del circuit drawer :meth:`qiskit.circuit.QuantumCircuit.draw` e :func:`qiskit.visualization.circuit_drawer`. Può essere impostato su ``latex``, ``mpl``, ``text`` o ``latex_source``, e quando il kwarg ``output`` non è esplicitamente indicato verrà utilizzato il backend qui impostato.
ja_jp: ``circuit_drawer`` ：これは、回路ドロワー :meth:`qiskit.circuit.QuantumCircuit.draw` および :func:`qiskit.visualization.circuit_drawer` のデフォルトのバックエンドを変更するために使用されます。 これは、 ``latex`` 、 ``mpl`` 、 ``text`` または ``latex_source`` に設定でき、 ``ouptut`` kwargが明示的に設定されていない場合は、ドロワー・バックエンドが使用されます。
ko_kr: 이는 회로 드로잉 :meth:`qiskit.circuit.QuantumCircuit.draw` 및 :func:`qiskit.visualization.circuit_drawer` 의 기본 백엔드를 변경하는 데 사용된다. 이는 ``latex``, ``mpl``, ``text`` 또는 ``latex_source`` 로 설정될 수 있으며 ``ouptut`` kwarg가 명시적으로 설정되지 않은 경우 드로잉 백엔드를 사용하게 될 것이다.
pt_un: ``circuit_drawer``: Usada para mudar o backend padrão para o drawer de circuitos :meth:`qiskit.circuit.QuantumCircuit.draw` e :func:`qiskit.visualization.circuit_drawer`. Ele pode ser definido como ``latex``, ``mpl``, ``text``, ou ``latex_source`` e quando o kwarg ``ouptut`` não for definido explicitamente esse backend de drawer será usado.
ta_in: ``circuit_drawer``: இது சர்க்யூட் டிராயருக்கான இயல்புநிலை பின்தளத்தில் மாற்ற பயன்படுகிறது :meth:`qiskit.circuit.QuantumCircuit.draw` மற்றும் :func:`qiskit.visualization.circuit_drawer`. இதை ``latex``, ``mpl``, ``text``,அல்லது ``latex_source`` என அமைக்கலாம், மேலும் ``output`` kwarg வெளிப்படையாக அமைக்கப்படாதபோது, அந்த டிராயர் பின்தளத்தில் பயன்படுத்தப்படும்.
tr_tr: ``circuit_drawer``: Bu devre çiziciye :meth:`qiskit.circuit.QuantumCircuit.draw` ve :func:`qiskit.visualization.circuit_drawer` uygun varsayılan backendi değiştirmek için kullanılır. ``latex``, ``mpl´´, ``text´´ veya ``lateks kaynağı´´ olarak ayarlanabilir ve ``çıktı´´ anahtar kelime argümanı açıkça çiziciyi ayarlanmadığında backend kullanılacaktır.

source: ``circuit_mpl_style``: This is the default style sheet used for the ``mpl`` output backend for the circuit drawer :meth:`qiskit.circuit.QuantumCircuit.draw` and :func:`qiskit.visualization.circuit_drawer`. It can be set to ``default`` or ``bw``.
bn_bn: ``circuit_mpl_style``: এটা বর্তনী (সার্কিট) অঙ্কনের ``mpl`` ফলাফলের ব্যাকএন্ডের ডিফল্ট স্টাইল শিট হিসাবে ব্যবহৃত হয়। :meth:`qiskit.circuit.QuantumCircuit.draw` এবং :func:`qiskit.visualization.circuit_drawer` । এটা ``default`` অথবা ``bw`` হিসেবে সেট করা সম্ভব।
de_de: ``circuit_mpl_style``: Dies ist die Standardeinstellung für das ``mpl`` Ausgabe-Backend für die Schaltungszeichner :meth:`qiskit. ircuit.QuantumCircuit.draw` und :func:`qiskit.visualization.circuit_drawer`. Es kann auf ``default`` oder ``bw`` gesetzt werden.
es_un: ``circuit_mpl_style``: Esta es la hoja de estilo predeterminada utilizada para el backend de salida ``mpl`` para el dibujador de circuitos :meth:`qiskit.circuit.QuantumCircuit.draw` y :func:`qiskit.visualization.circuit_drawer`. Se puede configurar como ``default`` o ``bw``.
fr_fr: ``circuit_mpl_style`` : Il s'agit du style par défaut utilisé pour la sortie de type ``mpl`` pour le dessin de circuit :meth:`qiskit.circuit.QuantumCircuit.draw` et :func:`qiskit.visualization.circuit_drawer`. Il peut être défini sur ``default`` ou ``bw``.
id_id: ` ` ` circuit_mpl_style ` `: Ini adalah lembar style default yang digunakan untuk ` ` ` mpl ` ` output backend untuk penggambar sirkuit :meth:` qiskit.circuit.QuantumCircuit.draw ` dan :func:` qiskit.visualization.circuit_laci `. Hal ini dapat diatur ke ` ` default ` ` ` atau ` ` bw ` `.
it_it: ``circuit_mpl_style``: Indica lo stile di default utilizzato per il backend di output ``mpl`` del circuit drawer :meth:`qiskit.circuit.QuantumCircuit.draw` e :func:`qiskit.visualization.circuit_drawer`. Può essere impostato a ``default`` o ``bw``.
ja_jp: ``circuit_mpl_style`` ：これは、回路ドロワー :meth:`qiskit.circuit.QuantumCircuit.draw` および :func:`qiskit.visualization.circuit_drawer` の ``mpl`` 出力バックエンドに使用されるデフォルトのスタイルシートです。 ``default`` または ``bw`` に設定できます。
ko_kr: 이는 회로 드로잉 :meth:`qiskit.circuit.QuantumCircuit.draw` 및 :func:`qiskit.visualization.circuit_drawer` 에 사용되는 ``mpl`` 아웃풋 백엔드에 사용되는 기본 스타일 시트이다. 이는 ``default`` 또는 ``bw`` 로 설정할 수 있다.
pt_un: ``circuit_mpl_style``: Essa é a folha de estilo padrão usada no backend de saída ``mpl`` para o drawer de circuitos :meth:`qiskit.circuit.QuantumCircuit.draw` e :func:`qiskit.visualization.circuit_drawer`. Ela pode ser definida como ``default`` ou ``bw``.
ta_in: ``circuit_mpl_style``: சர்க்யூட் டிராயருக்கான ``mpl`` வெளியீட்டு பின்தளத்தில் பயன்படுத்தப்படும் இயல்புநிலை ஸ்டைல் ஷீட் இதுவாகும் :meth:`qiskit.circuit.QuantumCircuit.draw` மற்றும் :func:`qiskit.visualization.circuit_drawer`. இதை ``default`` அல்லது ``bw`` என அமைக்கலாம்.
tr_tr: ``circuit_mpl_style``: Bu, :meth:`qiskit.circuit.QuantumCircuit.draw` ve :func:`qiskit.visualization.circuit_drawer` çizicilerine uygun `` mpl '' çıktı backendi için kullanılan varsayılan stil sayfasıdır. ``default`` (varsayılan) ya da ``bw`` olarak ayarlanabilir.

source: ``circuit_mpl_style_path``: This can be used to set the path(s) to have the circuit drawer, :meth:`qiskit.circuit.QuantumCircuit.draw` or :func:`qiskit.visualization.circuit_drawer`, use to look for json style sheets when using the ``mpl`` output mode.
bn_bn: ``circuit_mpl_style_path``: বর্তনী (সার্কিট) ড্রয়ার পাওয়ার জন্য পাথ সেট করতে এটা ব্যবহার করা যেতে পারে, :meth:`qiskit.circuit.QuantumCircuit.draw` অথবা :func:`qiskit.visualization.circuit_drawer`, ``mpl`` আউটপুট মোড ব্যবহার করার সময় জেসন স্টাইল শিট দেখতে ব্যবহৃত হয়।
de_de: ` ` circuit_mpl_style_path ` `: Mit diesem Befehl können Sie den/die Pfad(e) einzustellen, in denen der Schaltkreiszeichner, :meth:` qiskit.circuit.QuantumCircuit.draw ` oder :func:` qiskit.visualization.circuit_drawer ` nach Json-Style-Sheets sucht, wenn Sie den ` ` mpl ` ` -Ausgabemodus verwenden.
es_un: ``circuit_mpl_style_path``: Esto se puede usar para establecer la(s) ruta(s) para tener el dibujador de circuitos, :meth:`qiskit.circuit.QuantumCircuit.draw` o :func:`qiskit.visualization.circuit_drawer`, usado para buscar hojas de estilo json cuando uses el modo de salida ``mpl``.
fr_fr: ``circuit_mpl_style_path`` : Ceci peut être utilisé pour définir le(s) chemin(s) où le visualiseur de circuits, :meth:`qiskit.circuit.QuantumCircuit.draw` ou :func:`qiskit.visualization.circuit_drawer`, ira chercher des feuilles de style au format json lorsque le mode de sortie ``mpl`` est utilisé.
ja_jp: ``circuit_mpl_style_path``: これを使用して回路ドロワー :meth:`qiskit.circuit.QuantumCircuit.draw` または :func:`qiskit.visualization.circuit_drawer` のパスを設定できます。``mpl`` 出力モードの時には json スタイルシートのために使用できます。
ko_kr: ``circuit_mpl_style_path``: 이는 회로 드로잉, :meth:`qiskit.circuit.QuantumCircuit.draw` 또는 :func:`qiskit.visualization.circuit_drawer` 이 있는 경로(들)을 설정하는 데 사용할 수 있고 ``mpl`` 출력 모드를 사용할 때 json 스타일 시트를 찾는 데 사용된다.
pt_un: ``circuit_mpl_style_path``: Isso pode ser usado para definir o(s) caminho(s) para o drawer de circuitos, :meth:`qiskit.circuit.QuantumCircuit.draw` ou :func:`qiskit.visualization.circuit_drawer`, usar para buscar por folhas de estilo json quando utilizando o modo de saída ``mpl``.
ta_in: ``circuit_mpl_style_path``: சர்க்யூட் டிராயரை வைத்திருக்க பாதை(களை) அமைக்க இதைப் பயன்படுத்தலாம் :meth:`qiskit.circuit.QuantumCircuit.draw` அல்லது :func:`qiskit.visualization.circuit_drawer`, பார்க்க பயன்படுத்தவும் ``mpl`` வெளியீட்டு பயன்முறையைப் பயன்படுத்தும் போது json நடை தாள்களுக்கு.
tr_tr: ``circuit_mpl_style_path``: Bu, devre çekmecesine sahip yol(lar)ı ayarlamak için kullanılabilir, :meth:`qiskit.circuit.QuantumCircuit.draw` veya :func:`qiskit.visualization.circuit_drawer`, bakmak için kullanın ``mpl`` çıkış modunu kullanırken json stil sayfalarını aramak için kullanın.

source: ``state_drawer``: This is used to change the default backend for the state visualization draw methods :meth:`qiskit.quantum_info.Statevector.draw` and :meth:`qiskit.quantum_info.DensityMatrix.draw`. It can be set to ``repr``, ``text``', ``latex``, ``latex_source``, ``qsphere``, ``hinton``, or bloch ``bloch`` and when the ``output`` kwarg is not explicitly set on the :meth:`~qiskit.quantum_info.DensityMatrix.draw` method that output method will be used.
bn_bn: ``state_drawer``: এটা অবস্থা দৃশ্যায়ন (স্টেট ভিজ্যুয়ালাইজেশন) এর অঙ্কন ফাংশনের ডিফল্ট ব্যাকএন্ড পরিবর্তন করার জন্য ব্যবহৃত হয়। :meth:`qiskit.quantum_info.Statevector.draw` এবং :meth:`qiskit.quantum_info.DensityMatrix.draw`. এটা ``repr``, ``text``', ``latex``, ``latex_source``, ``qsphere``, ``hinton``, অথবা ব্লক ``bloch`` হিসাবে সেট করা এবন যখন ``output`` কীওয়ার্ড আর্গুমেন্ট নির্দিষ্টভাবে :meth:`~qiskit.quantum_info.DensityMatrix.draw` মেথডে সেট করা নেই তখন আউটপুট মেথড ব্যবহৃত হবে।
de_de: ``state_drawer``: Dies wird verwendet, um das Standard-Backend für die Zustands-Visualisierung-Zeichenmethoden zu ändern :meth:`qiskit.quantum_info.Statevector.draw` und :meth:`qiskit.quantum_info.DensityMatrix.draw` zu ändern. Es kann auf ``repr``, ``text``', ``latex``, ``latex_source``, ``qsphere``, ``hinton``, oder bloch ``bloch`` gesetzt werden. Wenn das ``output`` kwarg nicht explizit auf die :meth:`~qiskit.quantum_info. DensityMatrix.draw` gesetzt wurde, wird diese Ausgabemethode verwendet.
es_un: ``state_drawer``: Esto se usa para cambiar el backend predeterminado para los métodos de dibujo de visualización de estado :meth:`qiskit.quantum_info.Statevector.draw` y :meth:`qiskit.quantum_info.DensityMatrix.draw`. Se puede configurar en ``repr``, ``text``, ``latex``, ``latex_source``, ``qsphere``, ``hinton``, o bloch ``bloch`` y cuando el ``output`` kwarg no se establezca explícitamente en el método :meth:`~qiskit.quantum_info.DensityMatrix.draw`, ese método de salida será utilizado.
fr_fr: ``state_drawer`` : Ceci est utilisé pour changer le backend par défaut pour les méthodes de visualisation d'état quantique :meth:`qiskit.quantum_info.Statevector.draw` et :meth:`qiskit.quantum_info.DensityMatrix.draw`. Il peut être défini à ``repr``, ``text``, ``latex``, ``latex_source``, ``qsphere``, ``hinton``, ou ``bloch`` et quand l'argument ``output`` n'est pas explicitement défini sur :meth:`~qiskit.quantum_info.DensityMatrix.draw`, la méthode de sortie choisie sera utilisée.
ja_jp: ``state_drawer``: これは状態可視化の描画メソッド :meth:`qiskit.quantum_info.Statevector.draw` と :meth:`qiskit.quantum_info.DensityMatrix.draw` のためのデフォルト・バックエンドを変更するために使えます。``repr``, ``text``', ``latex``, ``latex_source``, ``qsphere``, ``hinton``, または ``bloch`` に設定でき、``output`` kwargが :meth:`~qiskit.quantum_info.DensityMatrix.draw` に明示的にセットされていない時に出力に使われます。
ko_kr: ``state_drawer``: 이는 :meth:`qiskit.quantum_info.Statevector.draw` 및 :meth:`qiskit.quantum_info.DensityMatrix.draw` 와 같은 상태 시각화를 그리는 방법의 기본 백엔드를 변경하는데 사용된다. 이는 ``repr``, ``text``', ``latex``, ``latex_source``, ``qsphere``, ``hinton``, 또는 블로흐 ``bloch`` 으로 설정될 수 있으며 ``output`` kwarg가 :meth:`~qiskit.quantum_info.DensityMatrix.draw` 방식에 따라 명시적으로 설정되어 있지 않을 때 출력 방식이 사용될 것이다.
pt_un: ``state_drawer``: Isso é usado para mudar o backend padrão dos métodos de desenho de visualização de estados, :meth:`qiskit.quantum_info.Statevector.draw` e :meth:`qiskit.quantum_info.DensityMatrix.draw`. Ele pode ser definido como ``repr``, ``text``', ``latex``, ``latex_source``, ``qsphere``, ``hinton``, ou bloch ``bloch`` e quando o kwarg ``output`` não está definido explicitamente no método :meth:`~qiskit.quantum_info.DensityMatrix.draw` aquele método de saída será usado.
ta_in: ``state_drawer``: நிலை காட்சிப்படுத்தல் வரைபடுத்தல் முறைகளுக்கான இயல்புநிலை பின்தளத்தில் மாற்ற இது பயன்படுகிறது :meth:`qiskit.quantum_info.Statevector.draw` மற்றும் :meth:`qiskit.quantum_info.DensityMatrix.draw`. இதை ``repr``, ``text``, ``latex``, ``latex_source``, ``qsphere``, ``hinton``, அல்லது ``bloch`` மற்றும் ``output`` kwarg வெளிப்படையாக அமைக்கப்படாதபோது :meth:`~ qiskit.quantum_info.DensityMatrix.draw` வெளியீட்டு முறை பயன்படுத்தப்படும்.
tr_tr: ``state_drawer``: Bu, durum görselleştirme çizim yöntemleri için varsayılan arkayüzeyi değiştirmek için kullanılır :meth:`qiskit.quantum_info.Statevector.draw` ve :meth:`qiskit.quantum_info.DensityMatrix.draw`. ``repr``, ``text``', ``latex``, ``latex_source``, ``qsphere``, ``hinton`` veya bloch ``bloch`` olarak ayarlanabilir ve ``output``` kwarg :meth:`~qiskit.quantum_info.DensityMatrix.draw` yönteminde açıkça ayarlanmadığında, bu çıktı yöntemi kullanılacaktır.
