Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/configuration.po
Languages: bn_bn, de_de, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pt_un, ta_in, tr_tr

source: ``QISKIT_FORCE_THREADS``: Specify that multithreaded code should always execute in multiple threads. By default if you're running multithreaded code in a section of Qiskit that is already running in parallel processes Qiskit will not launch multiple threads and instead execute that function serially. This is done to avoid potentially overloading limited CPU resources. However, if you would like to force the use of multiple threads even when in a multiprocess context you can set ``QISKIT_FORCE_THREADS=TRUE`` to do this.
de_de: ``QISKIT_FORCE_THREADS``: Legt fest, dass Multithread-Code immer in mehreren Threads ausgeführt werden soll. Standardmäßig wird Qiskit nicht mehrere Threads starten, sondern diese Funktion seriell ausführen. Dies wird getan, um zu vermeiden, dass möglicherweise begrenzte CPU-Ressourcen überlastet werden. Wenn jedoch die Verwendung von mehreren Threads erzwungen werden soll, kann ``QISKIT_FORCE_THREADS=TRUE`` gesetzt werden, um dies zu tun.
es_un: ``QISKIT_FORCE_THREADS``: Especifica que el código de multiprocesos siempre debe ejecutarse en subprocesos múltiples. De forma predeterminada, si estás ejecutando código de múltiples subprocesos en una sección de Qiskit que ya se está ejecutando en procesos paralelos, Qiskit no iniciará varios subprocesos y, en su lugar, ejecutará esa función en serie. Esto se hace para evitar la posible sobrecarga de los recursos limitados de la CPU. Sin embargo, si deseas forzar el uso de múltiples subprocesos, incluso en un contexto de multiproceso, puedes configurar ``QISKIT_FORCE_THREADS=TRUE`` para hacer esto.
fr_fr: ``QISKIT_FORCE_THREADS `` : Indique que le code à unités d'exécution multiples doit toujours être exécuté dans plusieurs unités d'exécution. Par défaut, si vous exécutez du code à unités d'exécution multiples dans une section de Qiskit qui est déjà en cours d'exécution dans des processus parallèles, Qiskit ne lancera pas plusieurs unités d'exécution et exécutera cette fonction en série. Cela permet d'éviter de surcharger les ressources CPU limitées. Toutefois, si vous souhaitez forcer l'utilisation de plusieurs unités d'exécution, même si dans un contexte multiprocessus, vous pouvez définir ``QISKIT_FORCE_THREADS = TRUE`` pour le faire.
ja_jp: ``QISKIT_FORCE_THREADS``：マルチスレッドコードが常に複数のスレッドで実行されるように指定します。デフォルトでは、すでに並列プロセスで実行されている Qiskit のセクションでマルチスレッドコードを実行している場合、Qiskit は複数のスレッドを起動せず、代わりにその関数をシリアルに実行します。これは、限られたCPUリソースが過負荷になる可能性を回避するために行われます。 ただし、マルチプロセスコンテキストでも複数のスレッドの使用を強制したい場合は、これを行うために ``QISKIT_FORCE_THREADS=TRUE`` を設定できます。
ko_kr: ``QISKIT_FORCE_THREADS``: 다중 스레드 코드가 항상 다중 스레드에서 실행되어야 함을 지정한다. 기본적으로 병렬 프로세스에서 이미 실행 중인 Qiskit 섹션에서 다중 스레드 코드를 실행하는 경우 Qiskit은 다중 스레드를 시작하지 않고 대신 해당 기능을 직렬로 실행한다. 이는 제한된 CPU 리소스에 잠재적으로 과부하가 걸리는 것을 방지하기 위함이다. 하지만 다중 프로세스 컨텍스트에서도 다중 스레드를 강제로 사용하려면 ``QISKIT_FORCE_THREADS=TRUE`` 로 설정한다.
pt_un: ``QISKIT_FORCE_THREADS``: Especifica que o código multithread deve sempre ser executado em vários threads. Por padrão, se você estiver executando código multithread em uma seção do Qiskit que já está sendo executada em processos paralelos, o Qiskit não iniciará vários threads e, em vez disso, executará essa função em série. Isso é feito para evitar a sobrecarga de recursos limitados da CPU. No entanto, se você quiser forçar o uso de várias threads mesmo quando em um contexto multiprocesso, você pode definir ``QISKIT_FORCE_THREADS=TRUE`` para fazer isso.
ta_in: ``QISKIT_FORCE_THREADS``: மல்டித்ரெட் குறியீடு எப்பொழுதும் பல திரிகளில் இயக்கப்பட வேண்டும் என்பதைக் குறிப்பிடவும். முன்னிருப்பாக நீங்கள் Qiskit இன் ஒரு பிரிவில் மல்டித்ரெட் குறியீட்டை இயக்கினால், அது ஏற்கனவே இணையான செயல்முறைகளில் இயங்குகிறது Qiskit பல தொடரிழைகளைத் தொடங்காது, அதற்குப் பதிலாக அந்தச் செயல்பாட்டைத் தொடராகச் செயல்படுத்தும். வரம்புக்குட்பட்ட CPU ஆதாரங்களை ஓவர்லோட் செய்வதைத் தவிர்க்க இது செய்யப்படுகிறது. இருப்பினும், மல்டிபிராசஸ் சூழலில் இருக்கும்போதும் பல நூல்களைப் பயன்படுத்துவதை நீங்கள் கட்டாயப்படுத்த விரும்பினால், இதைச் செய்ய ``QISKIT_FORCE_THREADS=TRUE`` அமைக்கலாம்.
tr_tr: ``QISKIT_FORCE_THREADS``: Çok iş parçacıklı kodun her zaman birden çok iş parçacığında yürütülmesi gerektiğini belirtir. Varsayılan olarak, Qiskit'in zaten paralel işlemlerde çalışan bir bölümünde çok iş parçacıklı kod çalıştırıyorsanız, Qiskit birden çok iş parçacığı başlatmaz ve bunun yerine bu işlevi seri olarak yürütür. Bu, sınırlı CPU kaynaklarının potansiyel olarak aşırı yüklenmesini önlemek için yapılır. Ancak, çok işlemli bir bağlamda birden çok iş parçacığının kullanımını zorlamak isterseniz, bunu yapmak için ``QISKIT_FORCE_THREADS=TRUE`` ayarını yapabilirsiniz.

source: ``QISKIT_IBMQ_PROVIDER_LOG_LEVEL``: Specifies the log level to use, for the ``qiskit-ibmq-provider`` modules. If an invalid level is set, the log level defaults to WARNING. The valid log levels are ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR``, and ``CRITICAL`` (case-insensitive). If the environment variable is not set, then the parent logger’s level is used, which also defaults to ``WARNING``.
bn_bn: ``QISKIT_IBMQ_PROVIDER_LOG_LEVEL``: ``qiskit-ibmq-provider`` মডিউলের জন্য ব্যবহৃত লগ লেভেল নির্ধারণ করে। যদি একটি ত্রুটিপূর্ণ লেভেল সেট করা থাকে তবে লগ লেভেল সতর্কবার্তা দেখাবে। সঠিক লগ লেভেলগুলো হচ্ছে ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR``, এবং ``CRITICAL`` (ছোট-বড় হাতের অক্ষরের ব্যাপারে স্পর্শকাতর)। যদি কর্মপরিবেশের চল রাশি ঠিক করা না থাকে তবে পূর্বতন লগার লেভেল ব্যবহৃত হবে যা ডিফল্ট হচ্ছে ``WARNING``।
de_de: ` ` QISKIT_IBMQ_PROVIDER_LOG_LEVEL ` `: Gibt das zu verwendende Protokoll-Level für die Module ` ` qiskit-ibmq-provider ` ` an. Wenn ein ungültiges Level festgelegt ist, wird standardmäßig die Protokollstufe "WARNING" verwendet. Die gültigen Protokollstufen sind ` ` DEBUG ` `, ` ` INFO ` `, ` ` WARNING ` `, ` ` ERROR ` ` und ` ` CRITICAL ` ` (Groß-/Kleinschreibung muss nicht beachtet werden). Wenn die Umgebungsvariable nicht gesetzt ist, wird das Level der übergeordneten Protokollfunktion verwendet, die ebenfalls den Standardwert ` ` WARNING ` ` hat.
es_un: ``QISKIT_IBMQ_PROVIDER_LOG_LEVEL``: Especifica el nivel de registro que se utilizará para los módulos ``qiskit-ibmq-provider``. Si se establece un nivel no válido, el nivel de registro predeterminado es WARNING. Los niveles de registro válidos son ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR``, y ``CRITICAL`` (no distingue entre mayúsculas y minúsculas). Si la variable de entorno no está configurada, entonces se usa el nivel del registrador principal, que también está predeterminado en ``WARNING``.
fr_fr: ``QISKIT_IBMQ_PROVIDER_LOG_LEVEL`` : Spécifie le niveau de log (journalisation) à utiliser pour les modules ``qiskit-ibmq-provider``. Si un niveau invalide est défini, le niveau de log par défaut est WARNING. Les niveaux de log valides sont ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR`` et ``CRITICAL`` (insensible à la casse). Si la variable d'environnement n'est pas définie, alors le niveau du logger parent est utilisé, qui vaut aussi ``WARNING``.
it_it: ``QISKIT_IBMQ_PROVIDER_LOG_LEVEL``: Indica il livello di log da utilizzare per il modulo ``qiskit-ibmq-provider``. Se viene impostato un livello non valido, viene utilizzato quello di default che è WARNING. I possibili valori per i livello di log sono ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR``, e ``CRITICAL`` (case-insensitive). Se la variabile di ambiente non viene valorizzata, allora viene utilizzato il livello di log del parent logger, il cui default è sempre ``WARNING``.
ja_jp: ``QISKIT_IBMQ_PROVIDER_LOG_LEVEL`` ： ``qiskit-ibmq-provider`` モジュールに使用するログレベルを指定します。 無効なレベルが設定されている場合、ログレベルはデフォルトでWARNINGになります。 有効なログレベルは、 ``DEBUG`` 、 ``INFO`` 、 ``WARNING`` 、 ``ERROR`` および ``CRITICAL`` （大文字と小文字を区別しない）です。 環境変数が設定されていない場合は、親ロガーのレベルが使用されます。これもデフォルトで ``WARNING`` になります。
ko_kr: ``QISKIT_IBMQ_PROVIDER_LOG_LEVEL``: ``qiskit-ibmq-provider`` 모듈에 사용할 로그 레벨을 지정한다. 유효하지 않은 레벨이 설정된 경우 로그 레벨은 기본적으로 경고로 설정됩니다. 유효한 로그 수준은 ``DEBUG`` ``INFO``, ``WARNING``, ``ERROR`` 및 ``CRITICAL`` (대소문자를 구분하지 않음) 이다. 환경 변수가 설정되지 않은 경우 상위 로거 레벨이 사용되며 이는 기본값으로 ``WARNING`` 로 설정됩니다.
pt_un: ``QISKIT_IBMQ_PROVIDER_LOG_LEVEL``: Especifica o nível de log a ser usado, para os módulos ``qiskit-ibmq-provider``. Se um nível inválido é configurado, o nível de log será WARNING por padrão. Os níveis de log válidos são ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR``, e ``CRITICAL`` (não diferencia maiúsculas de minúsculas). Se a variável de ambiente não for definida, então o nível de log do pai é utilizado, que também é ``WARNING`` por padrão.
ta_in: ``QISKIT_IBMQ_PROVIDER_LOG_LEVEL``: ``qiskit-ibmq-provider`` தொகுதிகளுக்குப் பயன்படுத்த வேண்டிய பதிவு அளவைக் குறிப்பிடுகிறது. தவறான நிலை அமைக்கப்பட்டால், பதிவு நிலை இயல்புநிலையாக எச்சரிக்கையாக இருக்கும். செல்லுபடியாகும் பதிவு நிலைகள் ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR``, மற்றும் ``CRITICAL`` (case-insensitive). சூழல் மாறி அமைக்கப்படவில்லை எனில், parent logger-ன் நிலை பயன்படுத்தப்படுகிறது, இது இயல்புநிலையாக ``WARNING`` ஆகவும் இருக்கும்.
tr_tr: ``QISKIT_IBMQ_PROVIDER_LOG_LEVEL``: ``qiskit-ibmq-provider`` modülleri için kullanılacak oturum açma düzeyini (log level) belirler. Geçersiz bir düzey ayarlandıysa oturum açma düzeyi varsayılan değer olarak UYARI (Warning) olarak ayarlanır. Geçerli oturum açma düzeyleri ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR`` ve ``CRITICAL`` (büyük/küçük harf duyarsız) düzeyleridir. Eğer ortam değişkeni ayarlanmadıysa üst düzey kaydedicinin düzeyi kullanılır ve bu da varsayılan olarak `WARNING`` olur.

source: ``QISKIT_IBMQ_PROVIDER_LOG_FILE``: Specifies the name of the log file to use from log messages originating from ``qiskit-ibmq-provider``. If specified, messages will be logged to the file only. Otherwise messages will be logged to the standard error (usually the screen).
bn_bn: ``QISKIT_IBMQ_PROVIDER_LOG_FILE``: ``qiskit-ibmq-provider`` থেকে উৎপন্ন লগ বার্তা থেকে লগ নথি (ফাইলের) নাম নির্ধারণ করে। যদি উল্লেখ করে দেয়া থাকে তবে বার্তাটি শুধুমাত্র ফাইলে লিখে রাখা হবে। নতুবা, বার্তাটি একটি আদর্শ ত্রুটি হিসাবে লিখিত হবে (সাধারণত স্ক্রিনে বা পর্দায়)।
de_de: ` ` QISKIT_IBMQ_PROVIDER_LOG_FILE ` `: Gibt den Namen der Protokolldatei an, die aus Log-Nachrichten mit dem Ursprung ` ` qiskit-ibmq-provider ` ` verwendet werden soll. Wenn diese Variable gesetzt ist, werden Nachrichten nur in dieser Datei protokolliert. Andernfalls werden Nachrichten in standard error (in der Regel dem Bildschirm) protokolliert.
es_un: ``QISKIT_IBMQ_PROVIDER_LOG_FILE``: Especifica el nombre del archivo de registro que se utilizará de los mensajes de registro que se originan en ``qiskit-ibmq-provider``. Si se especifica, los mensajes se registrarán solo en el archivo. De lo contrario, los mensajes se registrarán en la salida de error estándar (generalmente la pantalla).
fr_fr: ``QISKIT_IBMQ_PROVIDER_LOG_FILE`` : spécifie le nom du fichier journal à utiliser à partir des messages de log provenant de ``qiskit-ibmq-provider``. Si ce nom est spécifié alors les messages seront enregistrés dans le fichier correspondant. Sinon, les messages seront envoyés vers le fichier d'erreur standard (généralement l'écran).
id_id: ` ` ` QISKIT_IBMQ_PROVIDER_LOG_FILE ` `: Spesifikasi nama dari berkas log untuk digunakan dari pesan log yang berasal dari ` ` qiskit-ibmq-provider ` `. Jika dispesifikasikan, pesan akan masuk ke berkas saja. Jika tidak, pesan akan login ke kesalahan standar (biasanya layar).
it_it: ``QISKIT_IBMQ_PROVIDER_LOG_FILE``: Indica il nome del file di log da utilizzare per i messaggi di log originati da ``qiskit-ibmq-provider``. Se specificato, i messaggi verranno indirizzati solo nel file. Altrimenti i messaggi di log saranno indirizzati nello standard error (in genere a schermo).
ja_jp: ``QISKIT_IBMQ_PROVIDER_LOG_FILE`` ： ``qiskit-ibmq-provider`` から発信されたログメッセージから使用するログファイルの名前を指定します。 指定した場合、メッセージはファイルにのみ記録されます。 それ以外の場合、メッセージは標準エラー（通常は画面）に記録されます。
ko_kr: ``QISKIT_IBMQ_PROVIDER_LOG_FILE``: ``qiskit-ibmq-provider`` 에서 시작한 로그 메시지에서 사용할 로그 파일의 이름을 지정한다. 그렇지 않으면 메시지는 표준 오류 (일반적으로 화면) 에 로그 됩니다.
pt_un: ``QISKIT_IBMQ_PROVIDER_LOG_FILE``: Especifica o nome do arquivo de log usado a partir de mensagens de log provenientes do ``qiskit-ibmq-provider``. Se especificado, as mensagens serão registradas apenas no arquivo. Caso contrário, as mensagens serão registradas na saída de erro padrão (geralmente a tela).
ta_in: ``QISKIT_IBMQ_PROVIDER_LOG_FILE``: ``qiskit-ibmq-provider`` -இலிருந்து தோன்றும் பதிவு செய்திகளிலிருந்து பயன்படுத்த பதிவு கோப்பின் பெயரைக் குறிப்பிடுகிறது. அவ்வாறு குறிப்பிடப்பட்டால், செய்திகள் கோப்பில் மட்டுமே உள்நுழைகின்றன. இல்லையெனில் செய்திகள் நிலையான பிழையில் (பொதுவாக திரை) உள்நுழைகின்றன.
tr_tr: ``QISKIT_IBMQ_PROVIDER_LOG_FILE``: ``Qiskit-ibmq-provider`` kaynaklı log mesajlarında kullanılacak log dosyasının adını belirtir. Belirtilirse, mesajlar yalnızca dosyaya kaydedilir. Aksi takdirde mesajlar standart hataya (genellikle ekrana) kaydedilir.

source: ``QISKIT_AQUA_MAX_GATES_PER_JOB``: An optional parameter to set a threshold for splitting Aqua generated circuits up into multiple jobs submitted to a backend based on the number of gates.
bn_bn: ``QISKIT_AQUA_MAX_GATES_PER_JOB``: ব্যাকএন্ডে সাবমিট করা অ্যাকোয়াতে উৎপন্ন বর্তনী (সার্কিট) যুক্তিবর্তনীর (গেইট) সংখ্যার উপর নির্ভর করে বিভাজিত করার থ্রেসহোল্ড ঠিক করার একটি ঐচ্ছিক চলরাশি।
de_de: ` ` QISKIT_AQUA_MAX_GATES_PER_JOB ` `: Ein optionaler Parameter zum Festlegen eines Grenzwerts für die Aufteilung von Aqua-generierten Schaltungen in mehrere Jobs, die basierend auf der der Anzahl der Gates an ein Backend übergeben werden.
es_un: ``QISKIT_AQUA_MAX_GATES_PER_JOB``: Un parámetro opcional para establecer un umbral para dividir los circuitos generados por Aqua en varios trabajos enviados a un backend en función del número de compuertas.
fr_fr: ``QISKIT_AQUA_MAX_GATES_PER_JOB``: un paramètre optionnel pour définir un seuil pour séparer les circuits générés par Aqua en plusieurs tâches soumises à un backend en fonction du nombre de portes.
id_id: ` ` ` QISKIT_AQUA_MAX_GATES_PER_JOB ` `: Sebuah parameter opsional untuk mengatur ambang batas untuk membagi sirkuit yang dihasilkan Aqua ke dalam beberapa pekerjaan yang diserahkan ke sebuah backend berdasarkan jumlah gates.
it_it: ``QISKIT_AQUA_MAX_GATES_PER_JOB``: Un parametro opzionale che serve ad impostare una soglia utilizzata per suddividere i diversi circuiti generati da Aqua in più job sottomessi ad un backend, in base al numero di gate utilizzati.
ja_jp: ``QISKIT_AQUA_MAX_GATES_PER_JOB`` ：ゲートの数に基づいて、Aquaで生成された回路を、バックエンドに送信される複数のジョブに分割するためのしきい値を設定するオプションのパラメーター。
ko_kr: ``QISKIT_AQUA_MAX_GATES_PER_JOB``: Aqua 생성된 회로들을 게이트들의 수에 기초하여 백엔드에 제출된 다수의 작업들로 분할하기 위한 임계치를 설정하기 위한 선택적 파라미터.
pt_un: ``QISKIT_AQUA_MAX_GATES_PER_JOB``: Um parâmetro opcional para definir um limiar para dividir os circuitos gerados pelo Aqua em múltiplas tarefas enviadas a um serviço baseado no número de portas.
ta_in: ``QISKIT_AQUA_MAX_GATES_PER_JOB``: அக்வா உருவாக்கிய சர்க்யூட்களை பல வேலைகளாகப் பிரிப்பதற்கான கேட்டை அமைப்பதற்கான ஒரு விருப்ப அளவுரு, கேட்களின் எண்ணிக்கையின் அடிப்படையில் ஒரு பின்தளத்தில் சமர்ப்பிக்கப்படுகிறது.
tr_tr: ``QISKIT_AQUA_MAX_GATES_PER_JOB``: Aqua tarafından üretilen devreleri, kapıların sayısına bağlı olarak bir backende gönderilen birden fazla işe bölmek için bir eşik ayarlamak için isteğe bağlı bir parametredir.

source: ``QISKIT_IBMQ_PROVIDER_LOG_LEVEL``: Specifies the log level to use, for the ``qiskit-ibmq-provider`` modules. If an invalid level is set, the log level defaults to WARNING. The valid log levels are ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR``, and ``CRITICAL`` (case-insensitive). If the environment variable is not set, then the parent loggerâ€™s level is used, which also defaults to ``WARNING``.
id_id: ` ` ` QISKIT_IBMQ_PROVIDER_LOG_LEVEL ` `: Spesifikasi level log yang akan digunakan, untuk modul ` ` qiskit-ibmq-provider ` `. Jika tingkat yang tidak valid ditetapkan, tingkat log kembali ke default WARNING. Level log yang valid adalah ` ` DEBUG ` `, ` ` INFO ` `, ` ` WARNING ` `, ` ` ERROR ` `, dan ` ` CRITICAL ` ` (huruf kapital tidak penting). Jika variabel lingkungan tidak diatur, maka tingkat logger induk yang digunakan, yang juga memiliki default ` ` WARNING ` `.
