Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: The documentation is built from the master branch of `Qiskit/qiskit/docs <https://github.com/Qiskit/qiskit/tree/master/docs>`__ using `Sphinx <http://www.sphinx-doc.org/en/master/>`__. The majority of documentation, under `API Reference <https://qiskit.org/documentation/apidoc/qiskit.html>`__, is drawn from code comments in the repositories listed in :ref:`where_things_are`.
bn_bn: এই ডকুমেন্টেশনটি মাস্টার ব্রাঞ্চ এর `Qiskit/qiskit/docs <https://github.com/Qiskit/qiskit/tree/master/docs>`__ এর সঙ্গে `Sphinx <http://www.sphinx-doc.org/en/master/>`__ ব্যবহার করে তৈরী করা হয়েছে। এর বেশিরভাগ `API Reference <https://qiskit.org/documentation/apidoc/qiskit.html>`__ এর মধ্যে, `where_things_are`:ref: এর কোড কমেন্ট রিপোসিটোরি থেকে নেয়া হয়েছে।
de_de: Die Dokumentation wird mit `Sphinx <http://www.sphinx-doc.org/en/master/>`__ aus dem Master-Branch von `Qiskit/qiskit/docs <https://github.com/Qiskit/qiskit/tree/master/docs>`__ generiert. Der Großteil der Dokumentation, unter `API-Referenz <https://qiskit.org/documentation/apidoc/qiskit.html>`__, speist sich aus Quelltextkommentaren der in :ref:`where_things_are` aufgeführten Repositories.
el_gr: Η τεκμηρίωση είναι χτισμένη από τον κύριο κλάδο του ` Qiskit/qiskit/docs <https://github.com/Qiskit/qiskit/tree/master/docs>` __ χρησιμοποιώντας ` Sphinx <http://www.sphinx-doc.org/en/master/>` __. Το μεγαλύτερο μέρος της τεκμηρίωσης, με το "API αναφοράς <https://qiskit.org/documentation/apidoc/qiskit.html>` __, προέρχεται από σχόλια κώδικα στους χώρους αποθήκευσης που αναφέρονται στο :ref:" όπου βρίσκονται ".
es_mx: La documentación se construye desde la rama master de `Qiskit/qiskit/docs <https://github.com/Qiskit/qiskit/tree/master/docs>`__ usando `Sphinx <http://www.sphinx-doc.org/en/master/>`__. La mayoría de la documentación, bajo `Referencias de la API <https://qiskit.org/documentation/apidoc/qiskit.html>`__, se toma de los comentarios del código en los repositorios indicados en :ref:`where_things_are`.
es_un: La documentación se construye desde la rama master de `Qiskit/qiskit/docs <https://github.com/Qiskit/qiskit/tree/master/docs>`__ usando `Sphinx <http://www.sphinx-doc.org/en/master/>`__. La mayoría de la documentación, bajo `Referencias de la API <https://qiskit.org/documentation/apidoc/qiskit.html>`__, se toma de los comentarios del código en los repositorios indicados en :ref:`where_things_are`.
fr_fr: La documentation est produite à partir de la branche de `Qiskit/qiskit/docs <https://github.com/Qiskit/qiskit/tree/master/docs>`__ et repose sur `Sphinx <http://www.sphinx-doc.org/en/master/>`__. L'essentiel de la documentation, décrite ici `API Reference <https://qiskit.org/documentation/apidoc/qiskit.html>`__, est issue des commentaires de code des répertoires listés dans :ref:`where_things_are`.
id_id: Dokumentasi ini dibangun dari cabang master dari `Qiskit/qiskit/docs <https://github.com/Qiskit/qiskit/tree/master/docs>`__ menggunakan `Sphinx <http://www.sphinx-doc.org/en/master/>`__. Sebagian besar dokumentasi, berdasarkan `API Reference <https://qiskit.org/documentation/apidoc/qiskit.html>`__, diambil dari kode-kode komentar dalam repositori yang tercantum dalam :ref:`where_things_are`.
it_it: La documentazione è costruita a partire dal master branch di `Qiskit/qiskit/docs <https://github.com/Qiskit/qiskit/tree/master/docs>`__ usando `Sphinx <http://www.sphinx-doc.org/en/master/>`__. La maggior parte della documentazione, che si trova in `API Reference <https://qiskit.org/documentation/apidoc/qiskit.html>`__, è costruita a partire dai commenti al codice nelle repository elencate in :ref:`where_things_are`.
pt_un: A documentação é construída a partir da master branch `Qiskit/qiskit/docs <https://github.com/Qiskit/qiskit/tree/master/docs>`__ usando `Sphinx <http://www.sphinx-doc.org/en/master/>`__. A maioria da documentação, em `API Reference <https://qiskit.org/documentation/apidoc/qiskit.html>`__, é desenhada a partir de comentários de código nos repositórios listados em :ref:`where_things_are`.
ru_ru: Актуальная документация собирается из master-ветки `Qiskit/qiskit/docs <https://github.com/Qiskit/qiskit/tree/master/docs>`__ при помощи `Sphinx <http://www.sphinx-doc.org/en/master/>`__. Большая часть документации из раздела `API Reference <https://qiskit.org/documentation/apidoc/qiskit.html>`__ взята из комментариев кода в репозиториях, перечисленных в :ref:`where_things_are`.
sw_ke: Waraka umeundwa kutoka tawi la master la `Qiskit/qiskit/docs <https://github.com/Qiskit/qiskit/tree/master/docs>`__ kutumia `Sphinx <http://www.sphinx-doc.org/en/master/>`__. Nyaraka nyingi chini ya `API Reference <https://qiskit.org/documentation/apidoc/qiskit.html>`__, zimetolewa kutoka kwa maoni ya misimbo katika repo zilizoorodheshwa kwenye :ref:`where_things_are`.
ta_in: ஆவணங்கள் `Qiskit/qiskit/docs <https://github.com/Qiskit/qiskit/tree/master/docs>`_ முதன்மை கிளையிலிருந்து `Sphinx <http://www.sphinx-doc.org/en/master/>`__ ஐப் பயன்படுத்தி கட்டப்பட்டுள்ளன. பெரும்பாலான ஆவணங்கள், `API Reference <https://qiskit.org/documentation/apidoc/qiskit.html>`__, கீழ் :ref:`where_things_are` இல் பட்டியலிடப்பட்டுள்ளது.
tr_tr: Dokümantasyon, `Sphinx <http://www.sphinx-doc.org/en/master/>`__ kullanılarak `Qiskit/qiskit/docs <https://github.com/Qiskit/qiskit/tree/master/docs>`__ ana dalından (master branch) oluşturulmuştur. `API Reference <https://qiskit.org/documentation/apidoc/qiskit.html>`__ altındaki dokümantasyonun büyük bir kısmı :ref:`where_things_are` içerisinde listelenen repolardaki kod yorumlarından çekilmiştir.
vi_vn: Tài liệu được xây dưng từ nhánh chính (master) của `Qiskit/qiskit/docs <https://github.com/Qiskit/qiskit/tree/master/docs>`__ sử dụng `Sphinx <http://www.sphinx-doc.org/en/master/>`__. Phần lớn của tài liệu, ở trong `API Reference <https://qiskit.org/documentation/apidoc/qiskit.html>`__ được tạo ra bởi các bình luận ở trong các repository liệt kê tại :ref: `where_things_are`.

source: Documentation Structure
bn_bn: ডকুমেন্টেশন কাঠামো
de_de: Aufbau der Dokumentation
el_gr: Δομή τεκμηρίωσης
es_mx: Estructura de la Documentación
es_un: Estructura de la Documentación
fr_fr: Structure de la Documentation
id_id: Struktur Dokumentasi
it_it: Struttura della Documentazione
pt_un: Estrutura de Documentação
ru_ru: Структура документации
sw_ke: Muundo wa Nyaraka
ta_in: ஆவண அமைப்பு
tr_tr: Belgeleme yapısı
vi_vn: Cấu trúc của tài liệu

source: The way documentation is structured in Qiskit is to push as much of the actual documentation into the docstrings as possible. This makes it easier for additions and corrections to be made during development, because the majority of the documentation lives near the code being changed. There are three levels in the normal documentation structure in Terra:
bn_bn: Qiskit এর বিবরণী (ডকুমেন্টেশন) গঠন করার সময় যতটা সম্ভব প্রকৃত বিবরনীগুলো ডকস্ট্রিং এ রাখা হয়েছে। এর ফলে ডেভেলাপমেন্টের সময় সংযোজন ও সংশোধন সহজতর হয়েছে কারণ বেশিরভাগ বিবরণী কোডের সাথে অবস্থান করে। টেরায় সাধারণত তিন ধাপে বিবরণী (ডকুমেন্টেশন) গঠিতঃ
de_de: Die Dokumentation in Qiskit ist so aufgebaut, so viel wie möglich der eigentlichen Dokumentation über Docstrings abzubilden. Das macht das Ergänzen und Korrigieren der Dokumentation während der Entwicklung einfacher, da die Dokumentation nahe am betroffenen Code ist. Im Aufbau der Dokumentation von Terra gibt es drei Ebenen:
el_gr: Ο τρόπος με τον οποίο η τεκμηρίωση είναι δομημένη στο Qiskit είναι να ωθήσει όσο το δυνατόν περισσότερα από τα πραγματικά έγγραφα στα docstrings. Αυτό διευκολύνει τις προσθήκες και τις διορθώσεις κατά τη διάρκεια της ανάπτυξης, διότι η πλειονότητα των εγγράφων ζει κοντά στον κώδικα που αλλάζει. Υπάρχουν τρία επίπεδα στην κανονική δομή τεκμηρίωσης στο Terra:
es_mx: La documentación de Qiskit está estructurada para tener la mayor cantidad posible de documentación en como docstring. Esto facilita adiciones y correcciones durante el desarrollo, ya que la mayoría de la documentación se encuentra en el código que se está cambiando. Hay tres niveles en la estructura de documentación normal en Terra:
es_un: La forma en que la documentación está estructurada en Qiskit es buscar tener la mayor cantidad de la documentación en docstrings como sea posible. Esto facilita que se realicen adiciones y correcciones durante el desarrollo, porque la mayoría de la documentación se encuentra cerca del código que se cambia. Hay tres niveles en la estructura de documentación normal en Terra:
fr_fr: La documentation de Qiskit est autant que possible intégrée dans les docstrings. Cela rend les ajouts et corrections plus faciles pendant le développement. La document vit avec les changements de code. Il y a trois niveaux de documentation dans Terra :
id_id: Dokumentasi di dalam Qiskit terstruktur dengan cara yang akan mendorong sebanyak mungkin dokumentasi yang sebenarnya ke dalam docstrings. Hal ini mempermudah pengguna untuk melakukan penambahan dan koreksi saat pengembangan, karena mayoritas dokumentasi bersifat dekat dengan kode yang sedang diubah. Ada tiga tingkatan dalam struktur dokumentasi normal di Terra:
it_it: La documentazione in Qiskit è strutturata in modo da effettuare il più possibile la push della reale documentazione nelle docstring. Questo rende più facile fare aggiunte e correzioni durante lo sviluppo, perché la maggior parte della documentazione è vicina al codice che si sta modificando. Ci sono tre livelli nella struttura normale della documentazione in Terra:
pt_un: A forma como a documentação é estruturada no Qiskit é para disponibilizar a maior parte da documentação atual possível para as docstrings. Isto facilita a introdução de adições e correções durante o desenvolvimento, uma vez que a maior parte da documentação está próxima ao código sendo alterado. Existem três níveis na estrutura normal de documentação no Terra:
ru_ru: Метод структурирования документации в Qiskit заключается в том, чтобы задокументировать как можно больше. Это облегчает внесение дополнений и исправлений во время разработки, так как большинство документации находится рядом с изменяемым кодом. В структуре документации проекта Terra есть три уровня:
sw_ke: Jinsi ambavyo nyaraka zimeundwa katika Qiskit ni kusukuma wingi wa nyaraka zenyewe katika docstrings iwezekanavyo. Huku kunarahishisha nyongeza na marekebisho kufanywa wakati wa maendeleo, kwani wingi wa nyaraka huwa karibu na msimbo unaobadilishwa. Kuna viwango vitatu katika muundo wa kawaida wa nyaraka huko Terra:
ta_in: Qiskit யில் ஆவணங்கள் கட்டமைக்கப்பட்ட வழி, உண்மையான ஆவணங்களை முடிந்தவரை டாக்ஸ்ட்ரிங்ஸில் தள்ளுவதாகும். இது வளர்ச்சியின் போது சேர்த்தல் மற்றும் திருத்தங்களைச் செய்வதை எளிதாக்குகிறது, ஏனென்றால் பெரும்பாலான ஆவணங்கள் code மாற்றப்படுவதற்கு அருகில் வாழ்கின்றன. டெர்ராவில் இயல்பான ஆவணமாக்கல் கட்டமைப்பில் மூன்று நிலைகள் உள்ளன:
tr_tr: Qiskit'te belgenin yapılandırılma şekli, asıl belgenin mümkün olduğunca belge dizgisine aktarılmasıdır. Bu, belgelerin çoğu değiştirilen kodun yanında bulunduğu için geliştirme sürecinde ekleme ve düzeltmeler yapılmasını kolaylaştırır. Terra'nın normal belge yapısında üç seviye vardır:
vi_vn: Cách mà tài liệu được cấu thành trong Qiskit là đẩy càng nhiều tài liệu vào docstrings có thể. Việc này tạo điều kiện cho việc thêm bớt và sửa tài liệu trong khi phát triển, vì phần lớn tài liệu ở bên cạnh phần code được thay đổi. Có ba mức mà một tài liệu thông thường được cấu thành trong Terra:

source: The ``.rst`` files in the ``docs/apidocs``
bn_bn: ``docs/apidocs`` এর মধ্যে ``.rst`` ফাইলসমূহ
de_de: Die ``.rst`` Dateien in ``docs/apidocs``
el_gr: Τα αρχεία `.rst`` στα ``docs/apidocs``
es_mx: Los archivos ``.rst`` en ``docs/apidocs``
es_un: Los archivos ``.rst`` en ``docs/apidocs``
fr_fr: Les fichiers ``.rst``dans le répertoire ``docs/apidocs``
id_id: File ``.rst`` di dalam ``docs/apidocs``
it_it: I file ``.rst`` in ``docs/apidocs``
pt_un: Os arquivos ``.rst`` na pasta ``docs/apidocs``
ru_ru: ``.rst`` файлы в ``docs/apidocs``
sw_ke: Faili za ``.rst`` katika ``docs/apidocs``
ta_in: ``docs / apidocs`` இல் உள்ள ``.rst`` கோப்புகள்
tr_tr: "docs/apidocs" içindeki ".rst" dosyaları
vi_vn: Tệp ``.rst`` ở trong ``docs/apidocs``

source: These files are used to tell Sphinx which modules to include in the rendered documentation. This contains two pieces of information: an `internal reference <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`__ or `cross reference <https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`__ to the module, which can be used for internal links inside the documentation, and an `automodule directive <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ used to parse the module docstrings from a specified import path. For example, the dagcircuit.rst file contains::
bn_bn: প্রদত্ত বিবরণীর মধ্যে কোন মডিউলগুলো অন্তর্ভুক্ত করা প্রয়োজন স্ফিংক্স তা এই ফাইলগুলোর মাধ্যমে জানতে পারে । এটি দুটি ভাগে তথ্য ধারণ করে থাকে যথা - মডিউলের 'internal reference <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`__ অথবা 'cross reference <https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`__ যেগুলো বিবরণীর ভেতরে অভ্যন্তরীণ লিঙ্ক হিসাবে ব্যবহার করা যেতে পারে এবং একটি নির্ধারিত ইম্পোর্ট করা পথ থেকে মডিউল ডকস্ট্রিংগুলো বিশ্লেষণ করার জন্য একটি 'automodule directive <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ ব্যবহার করা হয়ে থাকে । উদাহরণস্বরূপ, dagcircuit.rst ফাইলটির মধ্যে থাকে::
es_mx: Estos archivos son utilizados por Sphinx para seleccionar qué módulos incluir en la documentación generada. Esta contiene dos partes: una `internal reference <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`__ (referencia interna) o una `cross reference <https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`__ (referencia cruzada respecto al módulo), que pueden ser utilizadas para enlaces internos dentro de la documentación, y una `automodule directive <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ (directiva de automódulo) utilizada para analizar el docstring del módulo desde una ruta de importación especificada. Por ejemplo, el archivo dagcircuit.rst contiene::
id_id: File-file ini digunakan untuk memberitahu Sphinx modul manakah yang perlu diikutsertakan dalam dokumentasi yang dirender. Di dalamnya terdapat dua informasi: `internal reference <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`__ atau `cross reference <https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`__ kepada modul, yang dapat digunakan untuk sambungan internal di dalam dokumentasi, dan `automodule directive <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ yang digunakan untuk menguraikan modul docstrings dari path import tertentu. Contohnya, file dagcircuit.rst mengandung::
sw_ke: Faili hizi zinatumiwa kuambia Sphinx ni moduli zipi zitajumuishwa kwenye waraka uliotolewa. Hii ina vipande viwili vya habari: `rejeleo la ndani <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`__ au `rejeleo husishi <https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`__ kwa moduli, ambayo inaweza kutumiwa kwa viunga vya ndani, ndani ya nyaraka na `automodule directive <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ inayotumika kuchanganua docstrings za moduli kutoka kwa njia maalum ya kuagiza. Kwa mfano, faili ya dagcircuit.rst in::
ta_in: காண்பிக்கப்பட்ட ஆவணத்தில் எந்த தொகுதிகள் சேர்க்கப்பட வேண்டும் என்பதை ஸ்பின்க்ஸிடம் சொல்ல இந்த கோப்புகள் பயன்படுத்தப்படுகின்றன. இதில் இரண்டு தகவல்கள் உள்ளன: ஒரு `internal reference <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`_ அல்லது `cross reference <https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`_ தொகுதிக்கு, இது ஆவணத்தின் உள் இணைப்புகளுக்குப் பயன்படுத்தப்படலாம், மற்றும் ஒரு `automodule directive <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`_ ஒரு குறிப்பிட்ட இறக்குமதி பாதையிலிருந்து தொகுதி டாக்ஸ்ட்ரிங்ஸை அலச பயன்படுத்தப்படுகிறது. எடுத்துக்காட்டாக, எடுத்துக்காட்டாக, dagcircuit.rst கோப்பில் உள்ளது::
vi_vn: Các tệp đó cho Sphinx biết được mô-đun nào để kèm theo trong tài liệu được xuất ra, bao gồm 2 phần thông tin: `internal reference <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`__ hoặc `cross reference <https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`__ ở trong mô-đun mà có thể được dùng như một đường dẫn nội bộ ở trong tài liệu, và `automodule directive <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ dùng để phân tích cú pháp của mô-đun docstrings từ một đường dẫn được xác định trước. Ví dụ, tệp dagcircuit.rst chứa::

source: The only ``.rst`` file outside of this is ``qiskit.rst``, which contains the table of contents. If you're adding a new ``.rst`` file for a new module's documentation, make sure to add it to the `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__ in that file.
bn_bn: ``qiskit.rst`` এর বাইরে একমাত্র ``.rst`` ফাইলটি সূচিপত্র নির্দেশ করে। যদি আপনি কোনো মডিউলের বিবরণী তৈরির সময় একটি নতুন ``.rst`` ফাইল তৈরি করেন, তাহলে সেটি ওই ফাইলের `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__ তে যোগ করবেন।
de_de: Die einzige außerhalb liegende ``.rst``-Datei ist ``qiskit.rst``. Sie enthält das Inhaltsverzeichnis. Wenn man eine neue ``.rst``-Datei für die Dokumentation eines neuen Moduls anlegt, muss diese dort unter `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__ hinzugefügt werden.
es_mx: El único archivo ``.rst`` fuera de este es ``qiskit.rst``, que contiene las tablas de contenido. Si estás añadiendo un nuevo archivo ``.rst`` para un módulo nuevo de la documentación, asegúrate de añadirlo también al `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__ en ese archivo.
es_un: El único archivo ``.rst`` fuera de este es ``qiskit.rst``, que contiene la tabla de contenido. Si estás agregando un nuevo archivo ``.rst`` para la documentación de un nuevo módulo, asegúrate de agregarlo al `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__ en ese archivo.
fr_fr: Le fichier ``qiskit.rst`` est différent et contient la table des matières. Si vous créez un fichier ``.rst`` pour documenter un nouveau module, assurez-vous de l'ajouter au fichier `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__.
id_id: Satu-satunya file ``.rst`` yang ada di luarnya adalah ``qiskit.rst``, yang berisi daftar isi. Jika Anda menambahkan file ``.rst`` baru untuk dokumentasi modul baru, pastikan untuk menambahkannya ke `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__ di dalam file tersebut.
it_it: Il file ``qiskit.rst`` è a parte e contiene la tabella dei contenuti. Se stai aggiungendo un nuovo file ``.rst`` per la documentazione di un nuovo modulo, assicurati di aggiungerlo al file `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__.
pt_un: O único arquivo ``.rst`` fora deste é ``qiskit.rst``, que contém a tabela de conteúdo. Se você está adicionando um novo arquivo ``.srt`` para a documentação de um novo módulo, não deixe de adicioná-lo ao `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__ desse arquivo.
ru_ru: Единственный ``.rst`` файл вне данной папки - это ``qiskit.rst``, который содержит оглавление (table of contents). Если Вы добавляете новый ``.rst`` файл для документирования нового модуля, не забудьте добавить его в `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__ в этом файле.
sw_ke: Faili pekee aina ya ``.rst`` iliyo njee ya hii ni ``qiskit.rst``, ambayo ina jedwali la yaliyomo. Ikiwa unaongeza faili mpya ya aina ya ``.rst`` kwa nyaraka mpya ya moduli, hakikisha kuiongeza kwenye `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__ katika faili hiyo.
ta_in: இதற்கு வெளியே உள்ள ஒரே ``.rst`` கோப்பு ``qiskit.rst``, இதில் உள்ளடக்க அட்டவணை உள்ளது. புதிய தொகுதியின் ஆவணங்களுக்காக நீங்கள் ஒரு புதிய ``.rst`` கோப்பைச் சேர்த்தால், சேர்ப்பதை உறுதிசெய்ய, `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__ அந்த கோப்பில்.
tr_tr: Bunun dışındaki tek ``.rst`` dosyası, içindekiler tablosunu içeren ``qiskit.rst`` dosyasıdır. Eğer yeni bir modülün dokümantasyonu için yeni bir ``.rst`` dosyası ekliyorsanız onu bu klasördeki toctree `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__ 'ye eklediğinizden emin olun.
vi_vn: Tệp ``.rst`` ngoại lệ duy nhất tên là ``qiskit.rst`, nó chứa mục lục. Nếu bạn thêm một tệp ``.rst`` cho một tài liệu của một mô-đun mới, chắc chắn thêm nó vào `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__ ở trong tệp đó.

source: The module-level docstring
bn_bn: মডিউল-লেভেল ডকস্ট্রিং
de_de: Der Docstring auf Modul-Ebene
el_gr: Το docstring επιπέδου λειτουργικής μονάδας
es_mx: Docstring a nivel de módulo
es_un: La docstring a nivel de módulo
fr_fr: Le module docstring
id_id: Docstring pada tingkatan modul
it_it: La docstring a livello modulo
pt_un: A docstring a nível de módulo
ru_ru: Документация на уровне модуля
sw_ke: Docstring ya kiwango cha moduli
ta_in: தொகுதி-நிலை டாக்ஸ்ட்ரிங்
tr_tr: Modül düzeyinde docstring
vi_vn: Chuỗi ký tự cấp mô-đun
