Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: Each Qiskit package has its own set of Contributing Guidelines (kept in the ``CONTRIBUTING.md`` file) which details specific information on contributing to that repository. Make sure you read through the repo-specific Contributing Guidelines prior to making your contribution to a specific repo as each project may have slightly different requirements and processes.
ko_kr: 각 Qiskit 배키지는 해당 저장소에 기여하는 것에 대한 고유의 정보를 자세히 설명하고 있는 (``CONTRIBUTING.md`` 파일 안에 저장된) 고유의 기여 지침을 가지고 있다. 각 프로젝트마다 요구 사항 및 과정에 약간의 차이가 있을 수 있으므로 특정 저장소에 기여하기 전에 그 저장소 고유의 기여 지침을 읽어보도록 하자.
pl_pl: Każdy pakiet Qiskit ma swój własny zestaw wytycznych dotyczących współtworzenia (przechowywany w pliku ``CONTRIBUTING.md````), który zawiera szczegółowe informacje o pracy nad tym repozytorium. Zanim przystąpisz do pracy, przeczytaj wytyczne dla konkretnego repozytorium, ponieważ każdy projekt może mieć nieco inne wymagania i procesy.

source: Repo
ko_kr: 저장소
pl_pl: Repozytorium

source: Contributing Guidelines
ko_kr: 기여 지침
pl_pl: Wytyczne dot. współtworzenia

source: Set up Your Development Environment
ko_kr: 개발 환경 설정하기
pl_pl: Skonfiguruj środowisko programistyczne
te_in: మీ డెవలప్మెంట్ పర్యావరణాన్ని సెటప్ చేయండి
zh_tw: 設定您的開發環境

source: To get started contributing to the Python-based Qiskit repos you will need to set up a Python Virtual Development Environment and install the appropriate package **from source**.
ko_kr: Python 기반 Qiskit 저장소에 기여를 시작하기 위해서는 Python 가상 개발 환경을 설치하고 **소스로부터** 적절한 패키지를 설치해야 한다.
pl_pl: Aby rozpocząć współtworzenie repozytoriów Qiskit opartych na języku Python, konieczne będzie skonfigurowanie środowiska programowania wirtualnego Python i zainstalowanie odpowiedniego pakietu **ze źródła**.
te_in: పైథాన్-ఆధారిత క్విస్కిట్ రెపోలకు సహకారం అందించడం ప్రారంభించడానికి మీరు పైథాన్ వర్చువల్ డెవలప్‌మెంట్ ఎన్విరాన్‌మెంట్‌ను సెటప్ చేయాలి మరియు తగిన ప్యాకేజీని **మూలం నుండి** ఇన్‌స్టాల్ చేయాలి.
zh_tw: 在開始為 Python 為基礎的 Qiskit 儲存庫做貢獻前，您需要設定 Python 的虛擬開發環境，並**從來源安裝適當的套件**。

source: For a quick guide on how to do this for qiskit-terra take a look at the `How to Install Qiskit - Contributors <https://www.youtube.com/watch?v=Pix2MFCtiOo>`__ YouTube video.
ko_kr: qiskit-terra 를 위해 이를 수행하는 빠른 안내를 위해서는 `How to Install Qiskit - Contributors <https://www.youtube.com/watch?v=Pix2MFCtiOo>`__ 유투브 영상을 보도록 하자.
pl_pl: Krótki poradnik dla zrobienia tego w qiskit-terra można znaleźć w filmiku YouTube `How to Install Qiskit - Contributors <https://www.youtube.com/watch?v=Pix2MFCtiOo>` __.
te_in: క్విస్కిట్-టెర్రా కోసం దీన్ని ఎలా చేయాలో శీఘ్ర గైడ్ కోసం చూడండి ` How to Install Qiskit-Contributors <https://www.youtube.com/watch?v=Pix2MFCtiOo>` __ YouTube వీడియో.

source: You can learn how to install different Qiskit packages from source in the :ref:`install-from-source`.
ko_kr: 소스로부터 다른 Qiskit 패키지를 설치하는 방법은 :ref:`소스로부터 설치하기` 에서 배울 수 있다.

source: For non-python packages you should check the CONTRIBUTING.md file for specific details on setting up your dev environment.
ko_kr: Python이 아닌 패키지의 경우, CONTRIBUTING.md 를 통해 개발 환경을 설정하기 위한 세부 정보를 확인해야 한다.
pl_pl: W przypadku pakietów innych niż python należy sprawdzić plik CONTRIBUTING.md, aby uzyskać szczegółowe informacje na temat konfigurowania środowiska dev.
te_in: పైతాన్ లో లేని ప్యాకేజి వాడాలి అనుకుంటే CONTRIBUTING.md ఫైలులో ఉన్న దేవ్ వాతావరణం ను సంప్రదించగలరు.
zh_tw: 對於非 python 套件，請查詢 CONTRIBUTING.md 檔案以取得關於如何設定您的開發環境的詳細資料。

source: Set up Python Virtual Development Environment
ko_kr: Python 가상 개발 환경 설정하기
pl_pl: Skonfiguruj wirtualne środowisko programistyczne Pythona
te_in: Python వర్చువల్ డెవలప్‌మెంట్ ఎన్విరాన్‌మెంట్‌ని సెటప్ చేయండి
zh_tw: 設定 Python 虛擬開發環境

source: If you've written some code but need help finishing it, want to get initial feedback on it prior to finishing it, or want to share it and discuss prior to finishing the implementation, you can open a *Draft* pull request and prepend the title with the **\[WIP\]** tag (for Work In Progress). This will indicate to reviewers that the code in the PR isn't in its final state and will change. It also means that we will not merge the commit until it is finished. You or a reviewer can remove the [WIP] tag when the code is ready to be fully reviewed for merging.
ko_kr: 코드를 일부 작성하였으나 마무리하는 데 도움이 필요하거나, 마무리하기 전에 초기 피드백을 받고 싶거나, 또는 구현을 완료하기 전에 그것을 공유하고 논의하고 싶다면, *초안* 풀 리퀘스트를 열고 제목 앞에 **\[WIP\]** 태그(Work In Progress; 진행 중을 의미)를 붙일 수 있다. 이는 검토자에게 이 PR의 코드가 최종 상태가 아니며 변경될 것임을 암시한다. 또한 그것이 완료될 때까지 커밋을 병합하지 않을 것임을 의미하기도 한다. 코드가 병합될 만큼 충분히 검토되었을 때 당신이나 다른 리뷰어가 [WIP] 태그를 제거할 수 있다.
pl_pl: Jeśli po napisaniu kodu chcesz uzyskać pomoc w jego ukończeniu, wstępną informację zwrotną przed jego ukończeniem lub chcesz się nim podzielić i skonsultować przed zakończeniem implementacji, otwórz *Wersję roboczą* żądania pull request i poprzedź tytuł tagiem **\[WIP\]** (czyli Work In Progress, pol. praca w toku). Wskaże to recenzentom, że kod w PR nie jest ukończony i zmieni się. Oznacza to również, że nie scalimy zatwierdzenia, dopóki nie zostanie ono zakończone. Ty lub recenzent możecie usunąć tag [WIP], gdy kod będzie gotowy do pełnej recenzji do połączenia.
zh_tw: 如果您已撰寫一些程式碼，但需要協助完成它，並想在完成之前取得意見回饋，或想在完成前進行討論，那麼您可以開啟 *Draft * 合併請求，並在標題前加上 **\[WIP\]** 標籤（顯示「正在進行中」）。 這將示意審閱人員， PR 中的程式碼尚未完成，且會有更動。 這也代表我們將不會合併提交，直到程式碼完成為止。 當程式碼已完成審閱準備並可合併時，您或審閱人員可移除 [WIP] 標籤。

source: Before marking your Pull Request as "ready for review" make sure you have followed the PR Checklist below. PRs that adhere to this list are more likely to get reviewed and merged in a timely manner.
ko_kr: 풀 리퀘스트를 "검토 준비"로 표시하기 전에, 아래의 PR 체크리스트를 따랐는지 확인하라. 이 목록을 준수하는 PR은 시기 적절하게 검토되고 병합될 가능성이 높다.
pl_pl: Przed oznaczeniem żądania Pull Request jako "gotowe do sprawdzenia" upewnij się, że spełniłeś poniższe kryteria PR. Żądania PR, które przestrzegają tej listy, mają większe szanse, by zostać poddanymi przeglądowi i scalonymi w odpowiednim czasie.

source: **Pull Request Checklist:**
ko_kr: **풀 리퀘스트 체크리스트**
pl_pl: **Kryteria Pull Request:**
te_in: **Pull Request - చెక్ జాబితా: **
zh_tw: **合併請求注意清單：**

source: You have followed the requirements in the CONTRIBUTING.md file for the specific repo you are contributing to.
ko_kr: 기여하고 있는 특정 저장소의 CONTRIBUTING.md 파일의 요구 사항을 따랐다.
pl_pl: Spełniłeś wymagania w pliku CONTRIBUTING.md dla konkretnego repozytorium, które współtworzysz.
te_in: మీరు కంట్రిబ్యూట్ చేస్తున్న నిర్దిష్ట రెపో కోసం CONTRIBUTING.md ఫైల్ లో అవసరాలను అనుసరించారు.
zh_tw: 您已遵循 CONTRIBUTING.md 檔中的需求，以取得您所在的特定儲存庫資訊。

source: All CI checks pass (it's recommended to run tests and lint checks locally before pushing).
ko_kr: 모든 CI 검사가 통과되었다(푸시하기 전에 로컬에서 테스트와 린트를 수행하는 것을 권장한다).
pl_pl: Przejście kontroli CI (zaleca się przeprowadzenie testów i kontrolę kodu lokalnie przed przesłaniem go do zdalnego repozytorium).
te_in: అన్ని CI తనిఖీలు ఉత్తీర్ణత సాధించాయి (పుష్ చేయడానికి ముందు స్థానికంగా పరీక్షలు మరియు లింట్ చెక్‌లను అమలు చేయాలని సిఫార్సు చేయబడింది).
zh_tw: 通過所有CI 測試（建議在推送之前，在本端執行測試和程式檢查）。

source: New tests have for any new functionality that has been introduced.
ko_kr: 도입된 모든 새로운 기능에 대해 새로운 테스트가 존재한다.

source: The documentation has been updated accordingly for any new/modified functionality.
ko_kr: 문서가 모든 새로운/수정된 기능에 따라 갱신되었다.
pl_pl: Dokumentacja została odpowiednio zaktualizowana w odniesieniu do każdej nowej/zmodyfikowanej funkcjonalności.
te_in: ఏదైనా కొత్త/సవరించిన కార్యాచరణకు అనుగుణంగా డాక్యుమెంటేషన్ నవీకరించబడింది.
zh_tw: 文件已針對任何新增/修改過的功能，相對應地進行更新。

source: A release note has been added if the change has a user-facing impact.
ko_kr: 변경 사항이 사용자에게 영향을 미칠 경우 릴리즈 정보가 추가되었다.
pl_pl: Notka informacyjna została dodana, jeśli zmiana ma wpływ na użytkownika.
te_in: మార్పు వినియోగదారుని ఎదుర్కొనే ప్రభావాన్ని కలిగి ఉంటే విడుదల గమనిక జోడించబడింది.
zh_tw: 如果變更會影響使用者，那麼會增加版本附註。

source: Any superfluous comments or print statements have been removed.
ko_kr: 불필요한 주석 또는 출력 명령문이 제거되었다.
te_in: ఏదైనా నిరుపయోగమైన వ్యాఖ్యలు లేదా ప్రింట్ స్టేట్‌మెంట్‌లు తీసివేయబడ్డాయి.
zh_tw: 任何多餘的註解或列印陳述都已移除。

source: All contributors have signed the :ref:`cla`.
ko_kr: 모든 기여자는 :ref:`cla` 에 서명하였다.
pl_pl: Wszyscy współtwórcy podpisali :ref:`cla`.
te_in: సహకారులందరూ :ref:`cla` పై సంతకం చేసారు.
zh_tw: 所有貢獻者已簽署 :ref:`cla`。

source: The PR has a concise and explanatory title (e.g. ``Fixes Issue1234`` is a bad title!).
ko_kr: PR은 간결하고 설명적인 제목을 갖는다 (예시. ``이슈1234 해결`` 은 나쁜 제목이다!).
pl_pl: PR ma krótki i jasny tytuł (np. ``Fixes Issue1234`` jest złym tytułem!).
te_in: PR సంక్షిప్త మరియు వివరణాత్మక శీర్షికను కలిగి ఉంది (ఉదా. ``ఫిక్సెస్ ఇష్యూ1234`` ఒక చెడ్డ శీర్షిక!).
zh_tw: PR 的標題必須簡明扼要（例如` ` Fixes Issue1234`` 是錯誤示範！）。

source: If the PR addresses an open issue the PR description includes the ``fixes #issue-number`` syntax to link the PR to that issue (**you must use the exact phrasing in order for GitHub to automatically close the issue when the PR merges**)
ko_kr: PR에서 공개된 이슈에 대해 다루는 경우, ``fixes #issue-number`` 구문이 포함된다. (**PR이 병합되었을 때 GitHub에서 이슈를 자동으로 닫히도록 하려면 정확한 구문을 사용해야 한다.**)
pl_pl: Jeśli PR dotyczy otwartego zgłoszenia, opis PR zawiera składnię ``fixes #issue-number`` aby połączyć PR z tym zgłoszeniem (**musisz użyć dokładnego sformułowania, aby GitHub automatycznie zamknął problem podczas połączenia PR**)
zh_tw: 如果 PR 顯示一個未完成的項目，那麼 PR 的說明須包括 ``修正 #issue-number` ` ，以將PR連結至該項目（** 您必須使用精準的句子，以便 GitHub 在合併後自動關閉問題 * * ）

source: Code review is done in the open and is open to anyone. While only maintainers have access to merge commits, community feedback on pull requests is extremely valuable. It is also a good mechanism to learn about the code base.
ko_kr: 코드 리뷰는 공개적으로 이루어지며 누구에게나 열려 있다. 관리자만 커밋 병합에 접근할 수 있지만, 풀 리퀘스트에 대한 커뮤니티 피드백은 매우 중요하다. 또한 그것은 코드 기반에 대해 배울 수 있는 좋은 메커니즘이기도 하다.
pl_pl: Weryfikacja kodu jest otwarta i dostępna dla każdego. Pomimo że tylko opiekunowie mają możliwość scalania zmian, opinie społeczności na temat pull requestów są niezwykle cenne. Jest to również dobry sposób na zapoznanie się z kodem.
te_in: కోడ్ సమీక్ష బహిరంగంగా చేయబడుతుంది మరియు ఎవరికైనా అందుబాటులో ఉంటుంది. కేవలం మెయింటెయినర్‌లకు మాత్రమే విలీన కమిట్‌లకు ప్రాప్తి ఉండగా, పుల్ రిక్వెస్ట్‌లపై కమ్యూనిటీ ఫీడ్‌బ్యాక్ చాలా విలువైనది. కోడ్ బేస్ గురించి తెలుసుకోవడానికి ఇది మంచి మెకానిజం కూడా.
zh_tw: 開放式地進行程式碼審閱，並開放於任何人。 雖然只有維護人員有權存取合併確定，但社群對於合併請求的意見回饋是極為寶貴。 透過回饋，讓我們對代碼庫有更好的了解。

source: Response times may vary for your PR, it is not unusual to wait a few weeks for a maintainer to review your work, due to other internal commitments. If you have been waiting over a week for a review on your PR feel free to tag the relevant maintainer in a comment to politely remind them to review your work.
ko_kr: 응답 시간은 PR에 따라 다를 수 있는데, 내부적인 다른 약속으로 인해 관리자가 당신의 작업을 검토하기를 몇 주 동안 기다리는 일은 드문 일이 아니다. 당신의 PR이 검토되기를 1주일 넘게 기다리고 있다면, 부담 갖지 말고 관련 관리자를 댓글에서 태그하여 작업을 검토해줄 것을 정중히 상기시키도록 하자.
pl_pl: Czasy odpowiedzi mogą być różne dla każdego PR. Oczekiwanie kilku tygodni na dokonanie przez opiekuna recenzji twojej pracy nie jest nietypowe. Wynika to z innych wewnętrznych zobowiązań. Jeśli czekasz od ponad tygodnia na recenzję PR, możesz oznaczyć odpowiedniego opiekuna w komentarzu, aby uprzejmie przypomnieć o wykonaniu recenzji.
te_in: మీ PR యొక్క స్పందనా సమయం మారుతూ ఉండవచ్చు, ఇతర అంతర్గత కట్టుబాట్లు కారణంగా, మీ పని సమీక్షించడానికి ఒక నిర్వహణ కొరకు కొన్ని వారాలు వేచి ఉండటం అసాధారణం కాదు. మీరు మీ PR పై ఒక సమీక్ష కోసం ఒక వారం వేచి ఉంటే, ఒక వ్యాఖ్యలో సంప్రదాయ నిర్వహణను ట్యాగ్ చేయడానికి సంకోచించకండి.
zh_tw: 回應時間可能因您的合併請求而有所不同，維護人員因內部工作無法及時審閱您的合併請求，造成等待數週的情形，並不罕見。 如果您已等待您的合併請求審閱超過一周，請在評論中標記相關維護人員，以禮貌地提醒他們檢閱您的工作。

source: Please be patient! Maintainers have a number of other priorities to focus on and so it may take some time for your work to get reviewed and merged. PRs that are in a good shape (i.e. following the :ref:`pr-checklist`) are easier for maintainers to review and more likely to get merged in a timely manner. Please also make sure to always be kind and respectful in your interactions with maintainers and other contributors, you can read `the Qiskit Code of Conduct <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__.
ko_kr: 잠깐! 관리자는 집중해야 할 다른 우선 순위가 많이 있어 작업을 검토하고 병합하는 데 시간이 걸릴 수 있다. (가령, :ref:`pr-checklist` 를 따르는) 좋은 형태의 PR은 관리자가 검토하기 쉽고 시기 적절하게 병합될 가능성이 높다. 또한 관리자 및 다른 기여자와의 상호작용에서 항상 친절하고 정중하게 행동하라. `Qiskit 행동 강령 <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__ 을 읽어볼 수 있다.
pl_pl: Zachowaj cierpliwość. Opiekunowie mają wiele innych projektów, które wymagają ich uwagi. Może minąć trochę czasu zanim sprawdzą i połączą twoje zgłoszenie. Dobrze sformułowane PR (tj. zgodne z :ref:`kryteriami Pull Request`) są łatwiejsze dla opiekunów do sprawdzenia, dlatego mogą zostać szybciej połączone. Upewnij się również, że twoja wiadomość utrzymana jest w uprzejmym tonie (więcej wskazówek znajdziesz w `Kodeksie postępowania Qiskit <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__).
te_in: దయచేసి ఓపికపట్టండి! నిర్వాహకులకు ఇతర ప్రాముఖ్యతలు ఉండటం వలన మీ పనిని సమీక్షించి విలీనం చేయడానికి సమయం పడుతుంది. సరైన PRs (అనగా :ref:` pr-చెక్ జాబితా ` ను అనుసరించే) నిర్వహణకు మరింత సులభంగా సమీక్షించడానికి మరియు సామాన్య పద్ధతుల్లో కలిపే అవకాశం ఉంది. దయచేసి కోడ్ సమీక్షకులు మరియు ఇతర సహాయకులతో మీ సంభాషణలో ఎల్లప్పుడూ జాగ్రత్తగా మరియు గౌరవంగా ఉండండి, మీరు ` Qiskit Code of Conduct <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>` __ చదవగలరు.
zh_tw: 請有點耐心！ 維護人員有許多其他優先順序需處理，因此您的工作可能需要一些時間，才能開始進行檢閱和合併。 良好的 PRs （例如，在 :ref:`pr-核對清單` ），讓維護人員更容易檢閱，且更可能及時合併。 在與維護人員及其他貢獻者的互動中，請務必保持友善且尊重，您可以閱讀 `Qiskit Code of Conduct <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__。

source: Familiarize yourself with the Qiskit community (via `Slack <https://qisk.it/join-slack>`__, `Stack Exchange <https://quantumcomputing.stackexchange.com/>`__, `GitHub <https://github.com/qiskit-community/feedback/discussions>`__ etc.)
pl_pl: Zapoznaj się ze społecznością Qiskit (poprzez `Slack <https://ibm.co/joinqiskitslack>`__, `Stack Exchange <https://quantumcomputing.stackexchange.com/>`__, `GitHub <https://github.com/qiskit-community/feedback/discussions>`__ itp.)
te_in: Qiskit కమ్యూనిటీతో మిమ్మల్ని మీరు పరిచయం చేసుకోండి (`Slack <https://qisk.it/join-slack>`__, `స్టాక్ ఎక్స్చేంజి<https://quantumcomputing.stackexchange.com/>`__, `GitHub <https://github.com/qiskit-community/feedback/discussions>`__ మొదలైనవాటి ద్వారా)
zh_tw: 熟悉 Qiskit 社群(透過 `Slack <https://qisk.it/join-slack>`__， `Stack Exchange <https://quantumcomputing.stackexchange.com/>`__， `GitHub <https://github.com/qiskit-community/feedback/discussions>`__ 等)

source: https://github.com/Qiskit/qiskit-machine-learning/blob/main/CONTRIBUTING.md
pl_pl: https://github.com/Qiskit/qiskit-finance/blob/main/CONTRIBUTING.md

source: Qiskit Optimization
pl_pl: Optymalizacja Qiskit

source: https://github.com/Qiskit/qiskit-metal/blob/main/CONTRIBUTING.md
pl_pl: https://github.com/Qiskit/qiskit-aer/blob/main/CONTRIBUTING.md

source: Qiskit Textbook (legacy)
pl_pl: Qiskit Textbook (poprzednia wersja)

source: If you are new to Qiskit contributing we recommend you do the following before diving into the code:
te_in: మీరు కిస్కెట్ కు కొత్త అయితే, కోడ్ లోకి వెళ్ళే ముందు ఈ క్రింది సూచనలు పాటించవలసినదిగా మేము సలహా ఇస్తున్నాము:
zh_tw: 如果您是 Qiskit 的新貢獻者，我們建議您在深入程式碼之前先執行下列工作：

source: Each Qiskit package has its own set of Contributing Guidelines (kept in the ``CONTRIBUTING.md`` file) which details specific information on contributing to that repository. Make sure you read through the repo-specific Contributing Guidelines prior to making your contribution to a specific repo as each project may have slightly different requirements and processes. For Qiskit Terra, the main repository, the contributing guidelines may be be found `here <https://github.com/Qiskit/qiskit-terra/blob/main/CONTRIBUTING.md>`__. Other Qiskit packages that are able to receive contributions may be found as seperate repositories in the official `Qiskit Github <https://github.com/Qiskit>`__.
te_in: ప్రతి Qiskit ప్యాకేజీ దాని స్వంత సహకార మార్గదర్శకాల సెట్‌ను కలిగి ఉంటుంది (`CONTRIBUTING.md`` ఫైల్‌లో ఉంచబడింది), ఇది ఆ రిపోజిటరీకి సహకరించే నిర్దిష్ట సమాచారాన్ని వివరిస్తుంది. ప్రతి ప్రాజెక్ట్‌కి కొద్దిగా భిన్నమైన అవసరాలు మరియు ప్రక్రియలు ఉండవచ్చు కాబట్టి మీరు నిర్దిష్ట రెపోకు మీ సహకారాన్ని అందించడానికి ముందు రెపో-నిర్దిష్ట సహకార మార్గదర్శకాలను చదివారని నిర్ధారించుకోండి. ప్రధాన రిపోజిటరీ అయిన Qiskit Terra కోసం, సహకార మార్గదర్శకాలు `ఇక్కడ <https://github.com/Qiskit/qiskit-terra/blob/main/CONTRIBUTING.md>`__ కనుగొనబడవచ్చు. సహకారాలను స్వీకరించగలిగే ఇతర Qiskit ప్యాకేజీలను అధికారిక `Qiskit Github <https://github.com/Qiskit>`__లో ప్రత్యేక రిపోజిటరీలుగా కనుగొనవచ్చు.
zh_tw: 每一個 Qiskit 套件都有它自己的「投稿準則」(保留在 ` `CONTRIBUTING.md`` 檔案中)，其詳細資料會提供給該儲存庫的特定資訊。 在對特定儲存庫做出貢獻之前，請務必先閱讀特定儲存庫的「投稿準則」，因為每個專案可能有稍微不同的需求和處理程序。 對於主要儲存庫 Qiskit Terra，提供的準則在 `這裏 <https://github.com/Qiskit/qiskit-terra/blob/main/CONTRIBUTING.md>`__。在官方的 `Qiskit Github <https://github.com/Qiskit>`__ 中可以找到作為獨立存儲庫的其他能夠接收貢獻的 Qiskit 套件。

source: Python venv
te_in: పైథాన్ వి ఇ ఎన్ వి

source: Conda
te_in: కొండ(Conda)

source: New tests have been added for any new functionality that has been introduced.
te_in: పరిచయం చేయబడిన ఏదైనా కొత్త కార్యాచరణ కోసం కొత్త పరీక్షలు జోడించబడ్డాయి.
zh_tw: 您已為引入的任何新功能添加了新的測試。
