Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: The stable branch is intended to be a safe source of fixes for high-impact bugs and security issues that have been fixed on master since a release. When reviewing a stable branch PR, we must balance the risk of any given patch with the value that it will provide to users of the stable branch. Only a limited class of changes are appropriate for inclusion on the stable branch. A large, risky patch for a major issue might make sense, as might a trivial fix for a fairly obscure error-handling case. A number of factors must be weighed when considering a change:
bn_bn: স্থিতিশীল শাখাটিকে মাস্টার রিলিজে সংশোধিত গুরুত্বপূর্ণ কিছু ভুল এবং নিরাপত্তা ইস্যুর নিরাপদ উৎস হিসেবে গণ্য করা হয়। স্থিতিশীল শাখার পুল রিকোয়েস্ট বিবেচনা করার সময় আমাদের অবশ্যই মান সহ কোনো প্যাচের ঝুঁকি নির্ণয় করতে হবে যা সে শাখা ব্যবহারকারীদের সরবরাহ করবে। শুধুমাত্র সীমিত সংখ্যক পরিবর্তন শাখায় অন্তর্ভুক্ত করার উপযুক্ত। কোনো বড় ঝুঁকিপূর্ণ প্যাচ হয়তো ছোটোখাটো সংশোধনীর ক্ষেত্রে কাজ করতে পারে। পরিবর্তন করার সময় কিছু জিনিস লক্ষ্য রাখতে হবেঃ
de_de: Der Stable-Branch soll eine sichere Quelle für Fixes weitreichenden Bugs und Sicherheitsproblemen sein, die seit einem Release auf dem Master behoben wurden. Bei der Überprüfung eines PR für den Stable-Branch müssen wir das Risiko eines bestimmten Patches mit dem Mehrwehrt rechtfertigen, den es Benutzern des Stable-Branch bieten wird. Nur eine begrenzte Klasse von Änderungen ist für die Aufnahme in den Stable-Branch geeignet. Ein großer, riskanter Patch für ein großes Problem könnte Sinn machen, ebenso wie ein trivialer Fix eines Code-Zweigs zur Behandlung von relativ selten eintretenden Fehlern. Bei einer Änderung muss eine Reihe von Faktoren abgewogen werden:
es_mx: La rama estable está destinada a ser una fuente segura de soluciones para errores de alto impacto y problemas de seguridad que se han solucionado en el master desde su lanzamiento. Al revisar un PR de rama estable, debemos equilibrar el riesgo de cualquier parche dado con el valor que proporcionará a los usuarios de la rama estable. Solo una clase limitada de cambios son apropiados para su inclusión en la rama estable. Un parche grande y arriesgado para un problema importante podría tener sentido, al igual que una solución trivial para un caso bastante oscuro de manejo de errores. Se debe tomar en cuenta un numero de factores cuanto se esté considerando un cambio:
es_un: La rama estable está destinada a ser una fuente segura de correcciones para errores de alto impacto y problemas de seguridad que se han solucionado en master desde su lanzamiento. Al revisar un PR de rama estable, debemos equilibrar el riesgo de cualquier parche dado con el valor que proporcionará a los usuarios de la rama estable. Solo una clase limitada de cambios es apropiada para su inclusión en la rama estable. Un parche grande y arriesgado para un problema importante podría tener sentido, al igual que una solución trivial para un caso de manejo de errores bastante oscuro. Se deben tomar en cuenta varios factores al considerar un cambio:
fr_fr: La branche dite stable est la source saine des différentes corrections des anomalies majeures identifies et corrigées dans le master depuis la dernière version. Toute modification de cette branche stable doit se faire en évaluant en premier le risque lié à la modification et en le comparant au bénéfices obtenus. Seuls quelques changements bien identifiés doivent être inclus dans cette branche stable. Une correction majeure mais adressant une anomalie critique ou bien une correction triviale pour une fonctionnalité très mineure peuvent être considérées. Dans tous les cas, il est bon de considérer les points suivants :
id_id: Cabang yang stabil dimaksudkan untuk menjadi sumber aman untuk perbaikan bagi bug dampak tinggi dan masalah keamanan yang telah diperbaiki pada master sejak rilisnya. Ketika meninjau PR cabang stabil, kita harus menyeimbangkan risiko dari setiap patch yang diberikan dengan nilai yang akan diberikan nya kepada pengguna dari cabang stabil. Hanya beberapa kelas tertentu dari perubahan yang sesuai untuk dimasukkan pada cabang stabil. Sebuah patch yang besar dan berisiko untuk isu yang besar mungkin masuk akal, juga perbaikan sepele untuk kasus penanganan error yang kurang diketahui. Sejumlah faktor harus dipertimbangkan ketika ingin mengajukan perubahan:
it_it: Lo stable branch è pensato per essere una fonte sicura delle correzioni per bug ad alto impatto e per problemi di sicurezza che sono stati risolti sul master a valle di un rilascio. Quando controlliamo una richiesta di pull sullo stable branch, dobbiamo bilanciare il rischio associato a ciascuna patch con il valore che apporta agli utilizzatori dello stable branch stesso. Solo poche modifiche sono adatte ad essere incluse nello stable branch. Una patch estesa e rischiosa per un problema importante può avere senso, così come può averlo una banale modifica per un caso raro di gestione degli errori. Vari fattori vanno presi in considerazione quando si valuta una modifica:
pt_un: O branch estável se destina a ser uma fonte segura de correções para bugs de alto impacto e problemas de segurança que foram corrigidos no master desde um lançamento. Ao revisar uma PR de branch estável, temos que balancear o risco de qualquer correção com o valor que ela proporcionará aos usuários da branch estável. Apenas uma classe de alterações limitada é apropriada para a inclusão na branch estável. Uma atualização grande e arriscada para um problema importante pode fazer sentido, assim como uma correção trivial para um caso de de erros obscuros. Vários fatores devem ser ponderados ao considerar uma mudança:
ru_ru: Стабильная ветка призвана быть безопасным источником исходного кода, содержащего исправления серьезных ошибок и проблем с безопасностью, которые были исправлены в master-ветке с момента релиза. При просмотре PR с целевой стабильной веткой, мы обязаны держать баланс между риском, который могут принести изменения, и пользой, которую данные изменения несут пользователям. Только ограниченный класс изменений подходит для включения в стабильную ветку. Например, большое изменение для серьезной проблемы, или же простое исправление для сложновоспроизводимой проблемы. При рассмотрении изменения следует учесть ряд факторов:
sw_ke: Tawi imara limepangwa kuwa chanzo salama cha marekebisho ya kasoro zenye athari kubwa pamoja na masuala ya usalama ambayo yametatuliwa katika master tangu kutolewa. Wakati wa kukagua PR ya tawi imara, sharti tusawazishe hatari ya kisasisho chochote kile na thamani ambayo itatoa kwa watumiaji wa tawi imara. Aina ndogo ya mabadiliko ndiyo inayofaa kujumuishwa kwenye tawi thabiti. Kisasisho kikubwa hatari kwa suala kuu kinaweza kuwa na maana, sawa na urekebishaji mdogo kwa kesi inayoshughulikia makosa. Sababu kadhaa lazima zipimwe wakati wa kuzingatia mabadiliko:
ta_in: நிலையான கிளை வெளியீட்டிலிருந்து மாஸ்டரில் சரி செய்யப்பட்ட உயர்-தாக்க பிழைகள் மற்றும் பாதுகாப்பு சிக்கல்களுக்கான தீர்வுகளின் பாதுகாப்பான ஆதாரமாக கருதப்படுகிறது. ஒரு நிலையான கிளை PR ஐ மறுபரிசீலனை செய்யும் போது, எந்தவொரு பேட்சின் ஆபத்தையும் நிலையான கிளையின் பயனர்களுக்கு வழங்கும் மதிப்புடன் சமப்படுத்த வேண்டும். நிலையான கிளையில் சேர்க்க ஒரு குறிப்பிட்ட வகை மாற்றங்கள் மட்டுமே பொருத்தமானவை. ஒரு பெரிய சிக்கலுக்கான ஒரு பெரிய, ஆபத்தான இணைப்பு அர்த்தமுள்ளதாக இருக்கலாம், இது மிகவும் தெளிவற்ற பிழை-கையாளுதல் வழக்கிற்கான ஒரு சிறிய தீர்வாக இருக்கலாம். மாற்றத்தைக் கருத்தில் கொள்ளும்போது பல காரணிகளை எடைபோட வேண்டும்:
tr_tr: Kararlı dallanmada yüksek etkili hatalara ve yayınlandığından beri temel üzerinde düzeltilen güvenlik sorunlarına uygun güvenli bir onarımlar kaynağı olması istenir. Bir kararlı dal PR'ini görüntülediğimizde, kararlı şubelerin kullanıcılarına yarar sağlayacak değerle birlikte her verilen yamanın riskini dengelemeliyiz. Sadece sınırlı bir değişiklikler sınıfının kararlı dallanmaya alınması uygundur. Büyük bir sorun için büyük riskli bir yama, belli belirsiz bir hata için ufak bir onarımın uygulanması mantıklı olabilir. Bir değişikliğe karar verirken bir dizi etken dikkate alınmalıdır:
vi_vn: Nhánh ổn định được sinh ra với mục đích là một nguồn sửa chữa an toàn cho các lỗi có mức tác động lớn và các vấn đề an ninh đã được sửa trên nhánh master kể từ khi phát hành. Khi xem xét một PR của nhánh ổn định, chúng ta phải cân bằng rủi ro của bản vá nào với giá trị mà nó đem lại cho người dùng nhánh ổn định. Chỉ có một lớp thay đổi giới hạn là thích hợp để đưa vào nhánh ổn định. Một bản vá lỗi lớn và rủi ro cho một vấn đề lớn có thể hợp lý, cũng như một sửa chữa nhỏ đối với một trường hợp xử lý lỗi khó thấy. Một số yếu tố phải được cân nhắc khi xem xét mỗi sự thay đổi:

source: The risk of regression: even the tiniest changes carry some risk of breaking something, and we really want to avoid regressions on the stable branch.
bn_bn: রিগ্রেশনের (প্রত্যাবৃত্তি) ঝুঁকিঃ সামান্যতম পরিবর্তনও অন্য কোনো অংশে ব্যাঘাত সৃষ্টি করতে পারে এবং আমরা এ ধরনের ঝুঁকিগুলো পরিহার করতে চাই।
de_de: Das Risiko einer Regression: Selbst die kleinsten Veränderungen bergen ein gewisses Risiko, etwas kaputt zu machen, und wir wollen Regressionen auf dem stabilen Zweig auf jeden Fall vermeiden.
es_mx: El riesgo de la regresión: hasta los cambios más pequeños conllevan cierto riesgo de romper algo, por eso queremos evitar a toda costa cualquier regresión en la rama estable.
es_un: El riesgo de regresión: incluso los cambios más pequeños conllevan algún riesgo de romper algo, y realmente queremos evitar regresiones en la rama estable.
fr_fr: Le risque de régression: même la plus petite des modifications peut avoir un impact sur la stabilité du code. Et l'objectif est bien entendu de garder la branche stable la plus sûre possible.
id_id: Risiko regresi: perubahan terkecil sekalipun berisiko merusak sesuatu, dan kita benar-benar ingin menghindari regresi pada cabang stabil.
it_it: Il rischio di regressione: anche nella più piccola modifica c'è il rischio di rompere qualcosa, e noi vogliamo davvero evitare di fare regressioni sullo stable branch.
pt_un: O risco de regressão: mesmo as menores alterações correm o risco de quebrar algo, e queremos realmente evitar regressões na branch estável.
ru_ru: Риск регрессии: даже самые мелкие изменения сопряжены с определенным риском того, что что-то перестанет работать, и мы хотим избегать таких регрессий на стабильной ветке.
sw_ke: Hatari ya regression: hata mabadiliko madogo kabisa yana hatari ya kuvunja kitu, na tunataka sana kuzuia regressions kwenye tawi imara.
ta_in: பின்னடைவின் ஆபத்து: மிகச்சிறிய மாற்றங்கள் கூட எதையாவது உடைக்கும் அபாயத்தைக் கொண்டுள்ளன, மேலும் நிலையான கிளையில் பின்னடைவைத் தவிர்க்க விரும்புகிறோம்.
tr_tr: Gerileme riski: en zayıf değişiklikler bile bir şeyleri biraz bozma riski taşır ve biz kararlı dalda gerilemeden gerçekten kaçınmak isteriz.
vi_vn: Nguy cơ hồi quy: ngay cả những thay đổi nhỏ nhất cũng có một số nguy cơ phá vỡ thứ gì đó khác, và chúng ta thực sự cần tránh vấn đề hồi quy trên nhánh ổn định.

source: The user visibility benefit: are we fixing something that users might actually notice, and if so, how important is it?
bn_bn: ব্যবহারকারীর সুবিধাঃ খেয়াল রাখতে হবে আমরা যেটা সংশোধন করছি সেটা আসলেই ব্যবহারকারীর নজরে আসবে কিনা বা যদিও আসেও সেটা কতটা গুরুত্বপূর্ণ।
de_de: Der Vorteil verbesserter Sichtbarkeit für Benutzer: Beheben wir etwas, was die Benutzer tatsächlich bemerken werden, und wenn ja, wie wichtig ist es?
es_mx: El beneficio de visibilidad para el usuario: ¿estamos arreglando algo que los usuarios podrían notar? y, de ser así, ¿qué tan importante es?
es_un: El beneficio de visibilidad para el usuario: ¿estamos arreglando algo que los usuarios podrían notar? y, de ser así, ¿qué tan importante es?
fr_fr: Le bénéfice utilisateur : sommes-nous en train de corriger quelque chose constaté par les utilisateurs? Cela apporte t'il un réel gain pour eux?
id_id: Manfaat visibilitas pengguna: apakah kita memperbaiki sesuatu yang benar-benar pengguna sadari, dan apabila iya, seberapa penting hal itu?
it_it: Il vantaggio osservabile dall'utente: stiamo correggendo qualcosa che gli utenti noteranno, e, se sì, quanto è importante?
pt_un: O benefício da visibilidade do usuário: estamos corrigindo algo que os usuários podem notar, nesse caso, o quão importante é essa modificação?
ru_ru: Видимость для пользователя: исправляем ли мы то, что пользователи могут на самом деле заметить, и если да, то насколько это важно?
sw_ke: Faida ya kujulikana kwa mtumiaji: je, tunarekebisha kitu ambacho watumiaji wanaweza kugundua, na ikiwa ni hivyo, kina umuhimu kivipi?
ta_in: பயனர் தெரிவுநிலை நன்மை: பயனர்கள் உண்மையில் கவனிக்கக்கூடிய ஒன்றை நாம் சரிசெய்கிறோமா, அப்படியானால், அது எவ்வளவு முக்கியம்?
tr_tr: Kullanıcı görünürlük yararı: onardığımız şeyler aslında kullanıcıların farkına varabildiği şeyler mi, öyle olsa bile ne kadar önemli?
vi_vn: Lợi ích người dùng nhìn thấy: có phải chúng ta đang sửa cái gì đó mà người dùng có thể thấy, và nếu vậy nó quan trọng như thế nào?

source: How self-contained the fix is: if it fixes a significant issue but also refactors a lot of code, it's probably worth thinking about what a less risky fix might look like.
bn_bn: সংশোধনী কতটা স্বনির্ভরঃ অর্থাৎ এটা কোনো গুরুত্বপূর্ণ ইস্যু সংশোধন করা সত্ত্বেও যদি অনেক বেশি কোড রিফ্যাক্টর বা পরিবর্তন করতে হয়, তাহলে এর চেয়ে কম ঝুকিপূর্ণ কোনো সংশোধনীর উপায় ভেবে দেখা প্রয়োজন।
de_de: Wie autark ist die Änderung: Wenn eine Änderung ein wichtiges Problem löst aber auch jede Menge Code überarbeitet, sollte man wahrscheinlich darüber nachdenken, wie ein weniger riskanter Fix aussehen könnte.
es_mx: Cuán autónoma es la solución: si soluciona un problema importante, pero también transforma mucho contenido del código, probablemente valga la pena pensar en cómo podría ser una solución menos riesgosa.
es_un: Qué tan autónoma es la solución: si soluciona un problema importante, pero también refactoriza una gran cantidad de código, probablemente valga la pena pensar en cómo se vería una solución menos riesgosa.
fr_fr: La portée de la correction : si cette correction règle un problème important mais qu'elle engendre des modifications fortes du code, imaginer une correction plus légère doit être envisagé.
id_id: Seberapa self-contained perbaikan tersebut: jika ia memperbaiki isu signifikan tetapi juga melakukan refaktor untuk banyak kode, mungkin perlu dipikirkan kembali apa perbaikan yang lebih tidak berisiko.
it_it: Quanto è auto-contenuta la correzione: se corregge una issue importante, ma modifica anche molto codice, probabilmente conviene pensare a come potrebbe essere implementata una correzione meno rischiosa.
pt_un: O quão auto-contida a correção é: se ela corrige um problema significativo, mas também refatora muitos códigos, provavelmente vale a pena pensar sobre como um conserto menos arriscado poderia ser escrito.
ru_ru: Насколько самодостаточны исправления: если они исправляют значительную проблему, а также требуют рефакторинга крупных частей кодовой базы, то возможно стоит подумать о том, как можно сделать исправление менее рискованным.
sw_ke: Vipi marekebisho hayo yamejitegemea yenyewe: ikiwa inatatua suala muhimu lakini pia inarekebisha misimbo mingi, pengine yafaa kufikiria juu ya suluhisho lisilo la hatari.
ta_in: பிழைத்திருத்தம் எவ்வாறு தன்னியக்கமானது: இது ஒரு குறிப்பிடத்தக்க சிக்கலை சரிசெய்தாலும், நிறைய குறியீட்டை மாற்றியமைத்தால், குறைவான ஆபத்தான பிழைத்திருத்தம் எப்படி இருக்கும் என்பதைப் பற்றி சிந்திக்க வேண்டியது அவசியம்.
tr_tr: Onarım ne kadar kendi kendine yeterli: eğer belirli bir sorunu onarıyor fakat bütün kodu yeniden etkiliyorsa, daha az riskli bir onarımın nasıl olacağı üzerinde düşünmeye muhtemelen değer.
vi_vn: Bản sửa lỗi tự khép kín như thế nào: nếu nó sửa chữa một vấn đề quan trọng nhưng cũng cấu trúc lại rất nhiều mã lệnh, có lẽ đáng suy nghĩ về một cách sửa chữa ít rủi ro hơn sẽ trông như thế nào.

source: Whether the fix is already on master: a change must be a backport of a change already merged onto master, unless the change simply does not make sense on master.
bn_bn: সংশোধনী ইতিমধ্যে প্রধান (মাস্টার) শাখায় আছেঃ সংশোধনীটির ব্যাকপোর্ট প্রধান শাখায় ইতিমধ্যে সংযোজিত হতে হবে যদিনা প্রধান শাখায় তা একেবারেই অকার্যকর হয়।
de_de: Ob der Fix bereits auf Master gesetzt ist: Eine Änderung muss der Backport einer bereits mit dem Master zusammengeführten Änderung sein, es sei denn, die Änderung macht auf Master grundsätzlich keinen Sinn.
es_mx: Si el arreglo está ya en la rama master: un cambio debe ser un backport de un cambio ya fusionado en la master, a no ser que simplemente el cambio no tenga sentido en la master.
es_un: Si la corrección ya está en master: un cambio debe ser un backport de un cambio ya fusionado en master, a menos que el cambio simplemente no tenga sentido en master.
fr_fr: La correction est-elle déjà dans le Master? Une modification peut être le backport d'une correction déjà présente dans le Master, ou bien la correction n'a peut-être aucun sens dans le Master.
id_id: Apakah perbaikan sudah ada pada master: perubahan harus menjadi backport dari perubahan yang sudah digabungkan ke master, kecuali perubahan pada master tidak masuk akal.
it_it: Se la correzione è già nel master: una modifica deve essere un backport di una modifica già unita al master, a meno che la modifica semplicemente non abbia senso sul master.
pt_un: Se a correção já está na master: uma mudança deve ser uma backport de uma mudança já combinada com a master, a não ser que a mudança simplesmente não faça sentido na master.
ru_ru: Наличие исправления в мастер-ветке: если изменение не имеет значения для основной ветки (master), это изменение должно быть резервным портом того, которое уже было объединено с master.
sw_ke: Ikiwa marekebisho tayari yapo katika master: mabadiliko sharti yakuwe backport ya mabadiliko ambayo tayari yameunganishwa kwenye master, isipokuwa mabadiliko hayana maana kwa master.
ta_in: பிழைத்திருத்தம் ஏற்கனவே மாஸ்டரில் உள்ளதா என்பது: மாற்றம் மாஸ்டருக்கு வெறுமனே புரியவில்லை என்றால், ஒரு மாற்றம் ஏற்கனவே மாஸ்டரில் இணைக்கப்பட்ட மாற்றத்தின் பின்னிணைப்பாக இருக்க வேண்டும்.
tr_tr: Düzeltme zaten ana kodlarda olsun ya da olmasın: değişiklik basitçe ana kodlar üzerinde bir anlam ifade etmediği sürece, bir değişiklik ana birimle zaten birleştirilmiş olan bir değişikliğin önceki versiyonuna taşınmalıdır.
vi_vn: Nếu bản sửa chữa có sẵn trên nhánh master: một sự thay đổi phải là một backport của một sự thay đổi đã được sáp nhập vào nhánh master, trừ khi sự thay đổi đơn giản là không có ý nghĩa gì trên nhánh master.

source: Backporting procedure:
bn_bn: Backporting পদ্ধতি:
de_de: Rückportierungsverfahren:
es_mx: Procedimiento de backporting:
es_un: Procedimiento de adaptación a versiones anteriores (backporting):
fr_fr: Procédure de rétroportage (Backporting):
id_id: Prosedur backporting:
it_it: Procedura di backporting:
pt_un: Processo de Backport:
ru_ru: Процедура бэкпорта (Backporting):
sw_ke: Utaratibu wa backporting:
ta_in: பின்னணி செயல்முறை:
tr_tr: Backport(Eski versiyona güncel özellik taşıma) prosedürü:
vi_vn: Quy trình backporting:

source: When backporting a patch from master to stable, we want to keep a reference to the change on master. When you create the branch for the stable PR, use::
bn_bn: যখন একটি পাচকে মাস্টার থেকে স্টেবলে বাকপোর্ট করবেন, সেখানে আমরা মাস্টারের পরিবর্তনের একটা রেফারেন্স রাখব । যখন আপনি একটি নতুন ব্রাঞ্চ তৈরী করবেন তখন স্ট্যাবল PR এর জন্যে ন্মিম্নলিখিত কোড ব্যবহার করুন::
de_de: Bei der Rückportierung einer Änderung vom Master in den Stable-Branch, wollen wir eine Referenz auf die Änderung im Master-Branch behalten. Beim Erstellen des Branches für den Pull-Request verwendet man::
es_mx: Al hacer backporting de un parche desde la master a la rama estable, queremos mantener una referencia del cambio en la master. Al crear la rama para el PR estable, utilice::
es_un: Al adaptar un parche de la rama master a una rama estable, queremos mantener una referencia del cambio en master. Cuando crees la rama para el PR estable, usa::
fr_fr: Lorsqu'une correction est réalisée du Master vers la branche stable, il est important d'en garder la trace dans le Master. Lorsque vous créez la branche recevant la PR stable, utilisez la commande::
id_id: Ketika meng-backport patch dari master ke stabil, kita ingin menyimpan referensi dari perubahan pada master. Ketika Anda membuat branch untuk PR stabil, gunakan::
it_it: Quando si fa backporting di una patch dal master allo stable branch, è bene mantenere una referenza alla modifica sul master. Quando si crea il branch per la richiesta di pull sullo stable, si deve usare::
pt_un: Ao realizar uma backporting de um patch de master para estável, queremos manter uma referência às mudanças na master. Ao criar a branch para a versão PR, use::
ru_ru: При бэкпортинге (применении изменений, предназначенных для основной, развивающейся в данный момент версии программы, к более старым версиям) из master-ветки в stable-ветку, мы хотим сохранять ссылку на изменение в master. При создании ветки для запроса на слияние (Pull request) в stable-ветку используйте:
sw_ke: Wakati wa backporting kisasisho kutoka master hadi imara, tunataka kuweka kumbukumbu ya mabadiliko kwenye master. Unapounda tawi la PR imara, tumia::
ta_in: ஒரு பேட்சை மாஸ்டரிலிருந்து நிலையானதாக மாற்றும்போது, ​​மாஸ்டரின் மாற்றத்தைப் பற்றிய குறிப்பை வைத்திருக்க விரும்புகிறோம். நிலையான PR க்காக நீங்கள் கிளையை உருவாக்கும்போது,:: ஐப் பயன்படுத்தவும்
tr_tr: Bir yamayı master'dan kararlı eski sürüme eklerken, master'daki değişikliğe dair bir referans tutmak istiyoruz. Kararlı PR (Pull Request) için dallanma oluşturduğunuzda, şunu kullanın::
vi_vn: Khi backport một bản vá từ nhánh master đến nhánh ổn định, chúng tôi muốn giữ một tham chiếu đến sự thay đổi trên nhánh master. Mỗi khi tạo nhánh cho PR ổn định, hãy sử dụng::
