Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: For the rest of this guide the standard Semantic Versioning nomenclature will be used of: ``Major.Minor.Patch`` to refer to the different components of a version number. For example, if the version number was ``0.7.1``, then the major version is ``0``, the minor version ``7``, and the patch version ``1``.
bn_bn: এই গাইডের বাকি অংশের জন্য স্ট্যান্ডার্ড শব্দার্থিক সংস্করণ নামকরণ ব্যবহার করা হবে: ``Major.Minor.Patch`` একটি সংস্করণ সংখ্যার বিভিন্ন উপাদানগুলি উল্লেখ করতে। উদাহরণস্বরূপ, যদি সংস্করণ নম্বরটি ``0.7.1`` হয়, তবে মেজর সংস্করণটি ``0``, মাইনর সংস্করণ ``7`` এবং প্যাচ সংস্করণ ``1``।
es_un: Para el resto de esta guía, se utilizará la nomenclatura estándar de versiones semánticas de: ``Major.Minor.Patch`` para hacer referencia a los diferentes componentes de un número de versión. Por ejemplo, si el número de versión es ``0.7.1``, entonces la versión principal es ``0``, la versión secundaria ``7`` y la versión del parche ``1``.
fr_fr: Pour la suite de ce guide, la nomenclature standard de la gestion de version est la suivante ``Majeure.Mineure.Correctif`` pour référencer les différentes composantes du numéro de version. Par exemple si le numéro de version est ``0.7.1``, alors la version majeure est ``0``, la version mineure est ``7``, et le niveau de correctif est ``1``.
pt_un: Para o restante deste guia, o padrão de nomenclatura do Controle de Versionamento Semântico a ser utilizado será: `Major.Minor.Patch`` para se referir aos diferentes componentes de um número de versão. Por exemplo, se o número da versão era ``0.7.1``, então a versão principal é ``0``, a versão secundária é ``7`` e a versão da correção é ``1``.
ru_ru: Для остальной части этого руководства используется стандартная номенклатура Semantic Versioning из: ``Major. inor.Patch`` для того, чтобы ссылаться на отдельные компоненты номера версии. Например, если номер версии был ``0.7.1``, то мажорной версией является ``0``, минорная версия ``7`` и патч ``1``.

source: Meta-package Version
bn_bn: মেটা-প্যাকেজ সংস্করণ
es_un: Versión del Metapaquete
fr_fr: Version du Meta-package
pt_un: Versão do pacote-Meta
ru_ru: Версия метапакета

source: The Qiskit meta-package version is an independent value that is determined by the releases of each of the elements being tracked. Each time we push a release to a tracked component (or add an element) the meta-package requirements, and version will need to be updated and a new release published. The timing should be coordinated with the release of elements to ensure that the meta-package releases track with element releases.
bn_bn: Qiskit মেটা-প্যাকেজ সংস্করণটি একটি স্বাধীন মান যা ট্র্যাক করা প্রতিটি উপাদানের রিলিজ দ্বারা নির্ধারিত হয়। প্রতিবার যখন আমরা একটি রিলিজকে একটি ট্র্যাক করা উপাদান (বা একটি উপাদান যুক্ত) মেটা-প্যাকেজ প্রয়োজনীয়তাগুলিতে পুশ করি, এবং সংস্করণটি আপডেট করতে হবে এবং একটি নতুন প্রকাশ প্রকাশিত হবে। এলিমেন্ট রিলিজের সাথে মেটা-প্যাকেজ ট্র্যাক রিলিজ পুশ করে তা নিশ্চিত করার জন্য উপাদানের মুক্তির সাথে সময় সমন্বয় করা উচিত।
es_un: La versión del metapaquete de Qiskit es un valor independiente que está determinado por las versiones de cada uno de los elementos que está siendo rastreado. Cada vez que enviamos una versión a un componente rastreado (o agregamos un elemento), los requisitos del metapaquete y la versión deberán actualizarse y publicarse una nueva versión. El tiempo debe coordinarse con el lanzamiento de elementos para garantizar que los lanzamientos de metapaquetes se realicen con los lanzamientos de elementos.
fr_fr: La version du meta-package de Qiskit est une valeur indépendante qui est déterminée par les versions de chacun des éléments qui le constituent. A chaque fois que la mise mise à jour d'un élément est publiée (ou qu'un élément est ajouté), la définition du contenu du méta-package sera mise à jour et sa version sera changée. Les calendriers de mise à jours seront coordonnés pour s'assurer que les publications du méta-package sont consistantes avec la mise à jour des éléments.
pt_un: A versão do meta-pacote no Qiskit tem um valor independente, que é determinado pelos releases de cada um dos elementos que estão sendo rastreados. A cada vez que lançamos uma versão para um componente rastreado (ou adicionamos um elemento), os requisitos e a versão do meta-pacote precisam ser atualizados, e uma nova versão publicada. Este tempo deve ser coordenado juntamente com o release dos elementos para garantir que o release do meta-pacote os acompanhem.
ru_ru: Версия Qiskit meta-package - это независимое значение, определяемое выпуском каждого элемента в нем. Каждый раз, когда мы отправляем релиз компонента (или добавляем элемент) версия метапакета повышается и публикуется новая версия. Сроки координируются с выпуском элементов для обеспечения синхронизации релизов метапакета и элементов.

source: Adding New Tracked Elements
bn_bn: নতুন উপাদান যোগ করা
es_un: Adición de Nuevos Elementos Rastreados
fr_fr: Ajout de nouveaux éléments suivis
pt_un: Adicionando Novos Elementos Rastreados
ru_ru: Добавление новых отслеживаемых элементов

source: When a new Qiskit element is being added to the meta-package requirements, we need to increase the **Minor** version of the meta-package.
bn_bn: যখন মেটা-প্যাকেজের প্রয়োজনীয়তার সাথে একটি নতুন Qiskit উপাদান যোগ করা হচ্ছে, তখন আমাদের মেটা-প্যাকেজের **Minor** সংস্করণ বাড়াতে হবে।
es_un: Cuando se agrega un nuevo elemento Qiskit a los requisitos del metapaquete, necesitamos aumentar la versión **Minor** del metapaquete.
fr_fr: Lorsqu'un élément de Qiskit est mis à jour ou ajouté et qu'il modifie les dépendances, nous augmentons la version **Mineure** du meta-package.
pt_un: Quando um novo elemento do Qiskit está sendo adicionado aos requisitos de um meta-pacote, nós precisamos incrementar a versão **Secundária** do meta-pacote.
ru_ru: При добавлении нового элемента Qiskit в мета-пакет, мы повышаем **Минорную** версию метапакета.

source: For example, if the meta-package is tracking 2 elements ``qiskit-aer`` and ``qiskit-terra`` and it's version is ``0.7.4``. Then we release a new element ``qiskit-ignis`` that we intend to also have included in the meta-package. When we add the new element to the meta-package we increase the version to ``0.8.0``.
bn_bn: উদাহরণস্বরূপ, যদি মেটা-প্যাকেজ 2 টি উপাদান ``qiskit-aer`` এবং ``qiskit-terra`` ট্র্যাক করে এবং এর সংস্করণটি ``0.7.4``। তারপরে আমরা একটি নতুন উপাদান ``qiskit-ignis`` করি যা আমরা মেটা-প্যাকেজে অন্তর্ভুক্ত করার ইচ্ছা করি। যখন আমরা মেটা-প্যাকেজে নতুন উপাদান যোগ করি তখন আমরা সংস্করণটি ``0.8.0`` তে নিয়ে যাই ।

source: Patch Version Increases
bn_bn: প্যাচ সংস্করণ বৃদ্ধি পায়
es_un: Incremento de la Versión del Parche
fr_fr: Incrément des version de correction
pt_un: Incremento de Versão
ru_ru: Повышение версий патчей

source: When any Qiskit element that is being already tracked by the meta-package releases a patch version to fix bugs in a release we need also bump the requirement in the setup.py and then increase the patch version of the meta-package.
bn_bn: মেটা-প্যাকেজ দ্বারা ইতিমধ্যেই ট্র্যাক করা কোন Qiskit উপাদান যখন একটি রিলিজে বাগ ফিক্স করার জন্য একটি প্যাচ সংস্করণ প্রকাশ করে তখন আমাদের setup.py-তে প্রয়োজনীয়তাকে বাধা দিতে হবে এবং তারপর মেটা-প্যাকেজের প্যাচ সংস্করণ বাড়িয়ে দিতে হবে।

source: For example, if the meta-package is tracking 3 elements ``qiskit-terra==0.8.1``, ``qiskit-aer==0.2.1``, and ``qiskit-ignis==0.1.4`` with the current version ``0.9.6``. When qiskit-terra release a new patch version to fix a bug ``0.8.2`` the meta-package will also need to increase it's patch version and release, becoming ``0.9.7``.
bn_bn: উদাহরণস্বরূপ, যদি মেটা-প্যাকেজ 3 টি উপাদান ``qiskit-terra==0.8.1``, ``qiskit-aer==0.2.1``, এবং ``qiskit-ignis==0.1.4`` বর্তমান সংস্করণ ``0.9.6`` এর সাথে ট্র্যাক করছে। যখন qiskit-টেরা একটি বাগ ``0.8.2`` ঠিক করার জন্য একটি নতুন প্যাচ সংস্করণ প্রকাশ করে তখন মেটা-প্যাকেজটি এর প্যাচ সংস্করণ এবং রিলিজ বাড়ানোর প্রয়োজন হবে, যা ``0.9.7`` হয়ে যাবে।

source: Additionally, there are occasionally packaging or other bugs in the meta-package itself that need to be fixed by pushing new releases. When those are encountered we should increase the patch version to differentiate it from the broken release. Do **not** delete the broken or any old releases from pypi in any situation, instead just increase the patch version and upload a new release.
bn_bn: অতিরিক্তভাবে, মেটা-প্যাকেজে নিজেই মাঝে মাঝে প্যাকেজিং বা অন্যান্য ত্রুটিসমূহ (বাগ) রয়েছে যা নতুন রিলিজগুলি পুশ করে ঠিক করা দরকার। যখন সেগুলি সম্মুখীন হয় তখন আমাদের প্যাচ সংস্করণটি ভাঙা (ব্রোকেন) রিলিজ থেকে আলাদা করার জন্য বাড়ানো উচিত। pypi থেকে ভাঙা (ব্রোকেন) বা পুরানো রিলিজগুলি যে কোনও পরিস্থিতিতে মুছে ফেলবেন না, পরিবর্তে কেবল প্যাচ সংস্করণ বাড়ান এবং একটি নতুন রিলিজ আপলোড করুন।
es_un: Además, ocasionalmente hay empaquetados u otros errores en el metapaquete en sí que deben corregirse provocando nuevas versiones. Cuando se encuentren, deberíamos aumentar la versión del parche para diferenciarla de la liberación rota. **No** elimines las versiones rotas o antiguas de pypi en cualquier situación, en su lugar, simplemente aumenta la versión del parche y carga una nueva versión.
fr_fr: De plus, il peut arriver de manière occasionnelle qu'il soit nécéssaire de changer le méta-package lui même pour corriger des problèmes. Quand cette situation survient nous changeons sa version pour pouvoir la différencier de celle qui a des problèmes même si les niveaux des composants n'ont pas changé. Les anciens niveaux ne sont pas supprimés de pypi, il suffit de recharger la nouvelle version.
pt_un: Além disso, ocasionalmente pode ocorrer um enpacotamento ou outros bugs dentro do próprio meta-pacote que precisam ser corrigidos por meio de novas releases. Quando encontrados, nós precisamos aumentar a versão do patch para diferenciá-lo da versão problemática. ** Não ** exclua as versões com problemas ou antigas do pypi sob nenhuma circunstância; ao invés disso, apenas aumente a versão do patch e carregue uma nova release.
ru_ru: Кроме того, иногда в самом метапакете есть ошибки, которые необходимо исправить, создав новые релизы. В этом случае также повышается версия патча, чтобы отличить новую версию от старой, нерабочей. **Не удаляйте** ошибочные или старые релизы из pypi в любой ситуации, вместо этого просто повысьте версию патча и выпустите новый релиз.

source: Minor Version Increases
bn_bn: গৌণ সংস্করণ বৃদ্ধি
es_un: Incrementos de la Versión Menor
fr_fr: Incrément des version Mineures
pt_un: Incremento da Versão Secundária
ru_ru: Повышение минорных версий

source: Besides adding a new element to the meta-package the minor version of the meta-package should also be increased anytime a minor version is increased in a tracked element.
bn_bn: মেটা-প্যাকেজে একটি নতুন উপাদান যুক্ত করার পাশাপাশি মেটা-প্যাকেজের গৌণ সংস্করণটি যে কোনও সময় ট্র্যাক করা উপাদানটিতে একটি ছোট সংস্করণ বাড়ানো উচিত।

source: For example, if the meta-package is tracking 2 elements ``qiskit-terra==0.7.0`` and ``qiskit-aer==0.1.1`` and the current version is ``0.7.5``. When the ``qiskit-aer`` element releases ``0.2.0`` then we need to increase the meta-package version to be ``0.8.0`` to correspond to the new release.
bn_bn: উদাহরণস্বরূপ, যদি মেটা-প্যাকেজ 2 টি উপাদান ``qiskit-terra==0.7.0`` এবং ``qiskit-aer==0.1.1`` এবং বর্তমান সংস্করণটি ``0.7.5`` ট্র্যাক করছে। যখন ``qiskit-aer`` উপাদানটি ``0.2.0`` রিলিজ করে তখন নতুন রিলিজের সাথে সামঞ্জস্য করতে আমাদের মেটা-প্যাকেজ সংস্করণটিকে ``0.8.0`` করতে হবে।
es_un: Por ejemplo, si el metapaquete está rastreando los 2 elementos ``qiskit-terra==0.7.0`` y ``qiskit-aer==0.1.1`` y la versión actual es ``0.7.5``. Cuando el elemento ``qiskit-aer`` libere ``0.2.0``, entonces necesitamos aumentar la versión del metapaquete para que sea ``0.8.0`` para que corresponda con la nueva versión.
fr_fr: Par exemple supposons que le meta-package suit les deux éléments ``qiskit-terra==0.7.0`` et ``qiskit-aer==0.1.1``, et que sa version courante est ``0.7.5``. Lorsque la version de ``qiskit-aer`` passe à ``0.2.0`` alors la version du méta-package va passer à ``0.8.0``.
pt_un: Neste exemplo o meta-pacote está rastreando dois elementos: `` qiskit-terra == 0.7.0`` e `` qiskit-aer == 0.1.1``, onde a versão atual é `` 0.7.5``. Quando o elemento `` qiskit-aer`` for lançado na versão `` 0.2.0``, então nós precisamos aumentar a versão do meta-pacote para `` 0.8.0``, de forma a corresponder com a nova release.
ru_ru: Например, если метапакет содержит 2 элемента: ``qiskit-terra==0.7.0`` и ``qiskit-aer==0.1.1`` и его текущая версия ``0.7.5``. То когда элемент ``qiskit-aer`` выпускает версию ``0.2.0``, версия метапакета повышается до``0.8.0``, чтобы соответствовать новому выпуску.

source: Major Version Increases
bn_bn: প্রধান (মেজর) সংস্করণ বৃদ্ধি
es_un: Incrementos de la Versión Mayor
fr_fr: Incrément des version majeures
pt_un: Incremento da Versão Principal
ru_ru: Повышение мажорных версий

source: The major version is different from the other version number components. Unlike the other version number components, which are updated in lock step with each tracked element, the major version is only increased when all tracked versions are bumped (at least before ``1.0.0``). Right now all the elements still have a major version number component of ``0`` and until each tracked element in the meta-repository is marked as stable by bumping the major version to be ``>=1`` then the meta-package version should not increase the major version.
bn_bn: প্রধান সংস্করণ অন্যান্য সংস্করণ সংখ্যা উপাদান থেকে ভিন্ন। অন্যান্য সংস্করণ নম্বর উপাদানগুলি প্রতিটি ট্র্যাক করা উপাদানগুলির সাথে লক ধাপে আপডেট করা হয়, কিন্তু প্রধান সংস্করণটি কেবল তখনই বৃদ্ধি পায় যখন সমস্ত ট্র্যাক করা সংস্করণগুলি বাম্প করা হয় (কমপক্ষে ``1.0.0`` এর আগে)। এই মুহুর্তে সমস্ত উপাদানগুলির এখনও ``0`` এর একটি প্রধান সংস্করণ নম্বর উপাদান রয়েছে এবং মেটা-রিপোজিটরির প্রতিটি ট্র্যাক করা উপাদানটি প্রধান সংস্করণটিকে ``>=1`` হওয়ার জন্য স্থিতিশীল হিসাবে চিহ্নিত করা হয়, তারপর মেটা- প্যাকেজ সংস্করণ প্রধান সংস্করণ বৃদ্ধি করা উচিত নয়।

source: The behavior of the major version number component tracking after when all the elements are at >=1.0.0 has not been decided yet.
bn_bn: যখন সমস্ত উপাদান >=1.0.0 এ থাকে, তখন প্রধান সংস্করণ নম্বর উপাদান ট্র্যাকিংয়ের আচরণ সম্বন্ধে এখনও সিদ্ধান্ত নেওয়া হয়নি।
es_un: Aún no se ha decidido el comportamiento del seguimiento del componente del número de versión principal después de que todos los elementos sean >=1.0.0.
fr_fr: La règle de changement de version majeure du meta-package après que tous les composants soient à une version >=1.0.0 n'est pas encore déterminée.
pt_un: O comportamento do rastreamento de componente no número de versão principal após todos os elementos atingirem > = 1.0.0 ainda não foi decidido.
ru_ru: Правила повышения мажорных версий после того, как все элементы получат версию >=1.0.0, еще не определено.

source: Optional Extras
bn_bn: ঐচ্ছিক অতিরিক্ত
es_un: Extras Opcionales
fr_fr: Options supplémentaires
pt_un: Extras Opcionais
ru_ru: Опциональные дополнения

source: In addition to the tracked elements there are additional packages built on top of Qiskit which are developed in tandem with Qiskit for example the application repositories like qiskit-optimization. For convienence these packages are tracked by the Qiskit metapackage as optional extras that can be installed with Qiskit. Releases of these optional downstream projects do not trigger a metapackage release as they are unpinned and do not effect the metapackage version. If there is a compatibility issue between Qiskit and these downstream optional dependencies and the minimum version needs to be adjusted in a standalone release this will only be done as a patch version release as it's a packaging bugfix.
bn_bn: ট্র্যাক করা উপাদানগুলির পাশাপাশি Qiskit এর উপরে নির্মিত অতিরিক্ত প্যাকেজ রয়েছে যা Qiskit এর সাথে মিলিয়ে তৈরি করা হয়েছে উদাহরণস্বরূপ Qiskit-অপ্টিমাইজেশনের মতো অ্যাপ্লিকেশন সংগ্রহস্থল। সুবিধার জন্য এই প্যাকেজগুলি Qiskit মেটাপ্যাকেজ দ্বারা ট্র্যাক করা হয় ঐচ্ছিক অতিরিক্ত হিসাবে যা Qiskit এর সাথে ইনস্টল করা যায়। এই ঐচ্ছিক ডাউনস্ট্রিম প্রজেক্টের রিলিজগুলি মেটাপ্যাকেজ রিলিজ ট্রিগার করে না কারণ সেগুলি আন-পিন করা থাকে এবং মেটাপ্যাকেজ সংস্করণকে প্রভাবিত করে না। যদি Qiskit এবং এই ডাউনস্ট্রিম ঐচ্ছিক নির্ভরতাগুলির মধ্যে একটি সামঞ্জস্যের সমস্যা থাকে এবং সর্বনিম্ন সংস্করণটি একটি স্বতন্ত্র রিলিজের মধ্যে সামঞ্জস্য করা প্রয়োজন তবে এটি কেবল প্যাচ সংস্করণ রিলিজ হিসাবে করা হবে কারণ এটি একটি প্যাকেজিং বাগফিক্স।

source: Qiskit Element Requirement Tracking
bn_bn: Qiskit উপাদান প্রয়োজনীয়তা অনুসরণ (ট্র্যাকিং)
es_un: Seguimiento de Requerimientos de Elementos de Qiskit
fr_fr: Suivi des exigences des éléments Qiskit
pt_un: Rastreamento de Requisito de Elemento do Qiskit
ru_ru: Отслеживание требований к элементу Qiskit

source: While not strictly related to the meta-package and Qiskit versioning how we track the element versions in the meta-package's requirements list is important. Each element listed in the setup.py should be pinned to a single version. This means that each version of Qiskit should only install a single version for each tracked element. For example, the requirements list at any given point should look something like::
bn_bn: মেটা-প্যাকেজ এবং Qiskit সংস্করণের সাথে কঠোরভাবে সম্পর্কিত না হলেও আমরা কীভাবে মেটা-প্যাকেজের প্রয়োজনীয়তার তালিকায় উপাদান সংস্করণগুলি ট্র্যাক করি তা গুরুত্বপূর্ণ। Setup.py এ তালিকাভুক্ত প্রতিটি উপাদান একটি একক সংস্করণে পিন করা উচিত। এর মানে হল যে কিস্কিটের প্রতিটি সংস্করণ প্রতিটি ট্র্যাক করা উপাদানগুলির জন্য শুধুমাত্র একটি সংস্করণ ইনস্টল করা উচিত। উদাহরণস্বরূপ, যে কোন নির্দিষ্ট পয়েন্টে প্রয়োজনীয়তার তালিকা এমন কিছু দেখতে হবে::

source: This is to aid in debugging, but also make tracking the versions across multiple elements more transparent.
bn_bn: এটি ডিবাগিংয়ে সহায়তা করার জন্য, তবে একাধিক উপাদান জুড়ে সংস্করণগুলি ট্র্যাকিংকে আরও স্বচ্ছ করে তোলে।
es_un: Esto es para ayudar en la depuración, pero también hace que el seguimiento de las versiones en varios elementos sea más transparente.
fr_fr: Ceci est conçu de manière à aider au déboggage, mais aussi pour faciliter le suivi des versions pour l'ensemble des éléments.
pt_un: Isso é para ajudar na depuração e também para tornar o rastreamento sobre as múltiplas versões de elementos mais transparente.
ru_ru: Это помогает в отладке, а также делает отслеживание версий по нескольким элементам более прозрачными.

source: To enforce a consistent code style in the project, we use `Pylint <https://www.pylint.org>`__ and `pycodestyle <https://pycodestyle.readthedocs.io/en/latest/>`__ to verify that code contributions conform to and respect the project's style guide. To verify that your changes conform to the style guide, run: ``tox -elint``
es_un: Para hacer cumplir un estilo de código consistente en el proyecto, usamos `Pylint <https://www.pylint.org>`__ y `pycodestyle <https://pycodestyle.readthedocs.io/en/latest/>`__ para verificar que las contribuciones de código se ajusten y respeten la guía de estilo del proyecto. Para verificar que tus cambios se ajustan a la guía de estilo, ejecuta: ``tox -elint``
fr_fr: Pour assurer une manière de coder cohérente et consistante sur l'ensemble du projet, nous utilisons `Pylint <https://www.pylint.org>`__ et `pycodesytle <https://pycodestyle.readthedocs.io/en/latest/>`__ . Afin de vérifier que les différentes contributions respectent le style de codage du projet, exécutez la commande: ``tox -elint``
pt_un: Para garantir um estilo de código consistente no projeto, nós usamos `Pylint <https://www.pylint.org>`__ e `pycodestyle <https://pycodestyle.readthedocs.io/en/latest/>`__ para verificar se as contribuições de código estão de acordo e respeitam o guia de estilos do projeto. Para verificar se suas mudanças estão de acordo com o guia de estilo, execute: ``tox -elint``
ru_ru: Для обеспечения единого согласованного стиля кода в проекте, мы используем `Pylint <https://www.pylint.org>`__ и `pycodesytle <https://pycodestyle.readthedocs.io/en/latest/>`__ чтобы убедиться, что Ваш вклад соответствует установленному стилю проекта. Для того, чтобы проверить Ваши изменения на соответствие стилю, выполните команду: ``tox -elint``

source: When reading an issue, after a number of back & forth comments, it is often clear what the root cause problem is. The commit message should have a clear statement as to what the original problem is. The bug is merely interesting for historical background on *how* the problem was identified. It should be possible to review a proposed patch for correctness from the commit message, without needing to read the bug ticket.
es_un: Cuando leas una incidencia, después de intercambiar algunos comentarios, por lo general queda claro cuál es la causa del problema. El mensaje de commit debe expresar claramente cuál es el problema original. El error es simplemente interesante por antecedentes históricos sobre *cómo* se identificó el problema. Debería ser posible revisar la corrección de un parche propuesto a partir del mensaje de commit, sin tener que leer el ticket del error.
fr_fr: Il est vrai que, dans la majorité des cas, lire un ticket d'anomalie permet de comprendre l'origine de cette anomalie et comment elle a été identifiée. Cela ne dispense pas le Commit Message de décrire clairement l'origine de l'anomalie, comment elle a été détectée et corrigée. Il doit être possible de retrouver cette information sans devoir retourner au ticket associé à l'anomalie.
pt_un: Ao ler um problema, depois de uma série de troca de comentários, muitas vezes é possível perceber qual a raiz do problema. A mensagem de commit deve ter uma declaração clara sobre qual é o problema original. O bug é apenas interessante para antecedentes históricos sobre *como* o problema foi identificado. Deve ser possível analisar uma atualização proposta para correção a partir da mensagem de commit, sem a necessidade de ler o ticket de bug.
ru_ru: При чтении содержания задачи, после ряда комментариев, часто становится ясно, что является причиной проблемы. В комментарии к коммиту должно быть четкое отражение того, в чем состоит первоначальная проблема. При исправлении ошибки часто интересна историческая информация о том, *как* выявлена проблема. Должно быть возможно проверить предложенное изменение кода с помощью комментария к коммиту, без необходимости читать все комментарии к задаче.
