Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: The major version is different from the other version number components. Unlike the other version number components, which are updated in lock step with each tracked element, the major version is only increased when all tracked versions are bumped (at least before ``1.0.0``). Right now, all the elements still have a major version number component of ``0``, and until each tracked element in the meta-repository is marked as stable by bumping the major version to be ``>=1``, then the meta-package version should not increase the major version.
es_un: La versión principal (o mayor) es diferente del número de versión de los demás componentes. A diferencia de los números de versión de los otros componentes, que son actualizados al mismo tiempo con cada elemento rastreado, la versión principal solo aumenta cuando se modifican todas las versiones rastreadas (al menos antes de ``1.0.0``). En este momento, todos los elementos todavía tienen un número de versión principal de componente ``0`` y hasta que cada elemento rastreado en el meta-repositorio sea marcado como estable, al hacer que la versión principal sea ``>=1``, entonces la versión del metapaquete no debería aumentar la versión principal (o mayor).
fr_fr: La version majeure est gérée de manière un peu différente des autres composants concernés par la gestion des versions, lesquelles sont modifiées selon les changement de version des composants. La version majeure n'est changée que lors d'un changement de version de tous les composants (du moins avant la version 1.0.0). Actuellement tous les composants on un niveau de majeur ``0``et tant qu'ils ne seront pas tous marqués comme ayant atteint une version stable (donc a une version majeure ``>=1``) alors le méta-package ne peut pas passer à la version majeure suivante.
pt_un: A versão principal é diferente do versionamento de outros componentes. Ao contrário da versão dos outros componentes, que são atualizados em sintonia com cada elemento rastreado, a versão principal só é incrementada quando todas as versões rastreadas são alteradas (ao menos antes de `` 1.0.0``). Até aqui, todos os elementos ainda têm um componente de número da versão principal em ``0``, até que cada elemento rastreado no meta-repositório seja marcado como estável alterando a versão principal para ``> = 1``, então a versão do meta-pacote não deve incrementar o valor da versão principal.
ru_ru: Мажорная версия отличается от други компонентов номера версии. В отличие от других компонентов, которые обновляются следом за каждым обновлением входящих в состав пакета элементов, мажорная версия повышается только тогда, когда все версии входящих пакетов обновляются (по крайней мере до версии ``1.0.0``). Сейчас все элементы имеют мажорную версию ``0`` и пока каждый элемент из метапакета не будет маркирован как стабильный путем повышения его мажорной версии до ``>=1``, мажорная версия метапакета также не должна быть повышена.

source: In addition to the tracked elements, there are additional packages built on top of Qiskit which are developed in tandem with Qiskit, for example, the application repositories like qiskit-optimization. For convienence these packages are tracked by the Qiskit metapackage as optional extras that can be installed with Qiskit. Releases of these optional downstream projects do not trigger a metapackage release as they are unpinned and do not affect the metapackage version. If there is a compatibility issue between Qiskit and these downstream optional dependencies and the minimum version needs to be adjusted in a standalone release, this will only be done as a patch version release as it's a packaging bugfix.
es_un: Además de los elementos rastreados, hay paquetes adicionales construidos sobre Qiskit que se desarrollan en conjunto con Qiskit, por ejemplo, los repositorios de aplicaciones como qiskit-optimization. Para mayor comodidad, el metapaquete Qiskit realiza un seguimiento de estos paquetes como extras opcionales que se pueden instalar con Qiskit. Las versiones de estos proyectos downstream opcionales no provocan una liberación del metapaquete, ya que no están fijadas y no afectan a la versión del metapaquete. Si hay un problema de compatibilidad entre Qiskit y estas dependencias downstream opcionales, la versión mínima debe ajustarse en una liberación independiente, esto solo se hará como una liberación de parche, ya que es una corrección de errores de empaquetamiento.
fr_fr: En plus des éléments suivis, il y a des paquets supplémentaires construits au dessus de Qiskit et qui sont développés en marge de Qiskit par exemple les référentiels d'application comme qiskit-optimization. Pour des raisons pratiques ces paquets sont suivis par le métapaquet Qiskit comme des suppléments facultatifs pouvant être installés avec Qiskit. Les versions de ces projets facultatifs n'ont pas d'effet sur le métapackage car elles n'y sont pas liées. S'il y a un problème de compatibilité entre Qiskit et ces dépendances optionnelles et que la version minimale doit être ajustée par une version autonome, cela sera fait par la publication d'un fix.
pt_un: Além dos elementos rastreados, existem pacotes adicionais criados sobre o Qiskit que são desenvolvidos em conjunto com este, tais como os repositórios de aplicativo - por exemplo, o qiskit-optimization. Por conveniência, esses pacotes são rastreados pelo meta-pacote Qiskit como extras opcionais, que podem ser instalados juntamente com o Qiskit. Os lançamentos mais recentes desses projetos opcionais não geram uma release nova de meta-pacote, uma vez que são independentes e não afetam a sua versão. Se houver um problema de compatibilidade entre o Qiskit e essas dependências opcionais mais recentes e a versão mínima precisar ser ajustada em uma release separada, isto somente será feito em uma release de versão de patch, já que é um pacote de correção de bug.
ru_ru: В дополнение к входящим в метапакет элементам есть дополнительные пакеты, разрабатывающиеся вместе с Qiskit, например репозитории приложений, такие как qiskit-optimization. Для удобства эти пакеты маркируются Qiskit метапакетом как необязательные дополнения, которые могут быть установлены с помощью Qiskit. Релизы этих проектов не создают отдельной версии метапакета, так как они откреплены и не влияют на нее. Если существует проблема совместимости между Qiskit и этими опциональными зависимостями, то минимальная версия будет скорректирована в отдельном релизе. Будет выпущен патч с повышением соответствующего компонента номера версии, поскольку это исправление ошибки с пакетами.

source: While not strictly related to the meta-package and Qiskit versioning, how we track the element versions in the meta-package's requirements list is important. Each element listed in the ``setup.py`` should be pinned to a single version. This means that each version of Qiskit should only install a single version for each tracked element. For example, the requirements list at any given point should look something like::
es_un: Si bien no está estrictamente relacionado con el metapaquete y el control de versiones de Qiskit, la forma en que rastreamos las versiones de los elementos en la lista de requerimientos del metapaquete es importante. Cada elemento enumerado en el archivo ``setup.py`` debe estar fijado a una única versión. Esto significa que cada versión de Qiskit solo debe instalar una única versión para cada elemento rastreado. Por ejemplo, la lista de requerimientos en un punto dado debería tener un aspecto similar a:
fr_fr: Bien que ce ne soit pas strictement relié à la gestion des versions du méta-package et de Qiskit, la manière dont nous suivons les versions des éléments dans les exigences du méta-package est importante. Chacun des éléments listés dans setup.py devrait correspondre à une version unique. Ceci signifie que chaque version de Qiskit ne définit qu'une seule version de chacun de ses éléments. Par exemple, la liste des exigences devrait toujours être de la forme ::
pt_un: Embora não esteja estritamente relacionado ao versionamento do meta-pacote e do Qiskit, a maneira como rastreamos as versões do elemento na lista de requisitos do meta-pacote é importante. Cada elemento listado no ``setup.py`` deve estar atrelado a uma única versão. Isso significa que cada versão do Qiskit deve instalar uma versão única para cada elemento rastreado. Por exemplo, a lista de requisitos em determinado momento deve se parecer como algo assim::
ru_ru: Хотя это не связано с версией метапакета Qiskit как мы отслеживаем версии элементов, список требований к метапакету очень важен. Каждый элемент, указанный в файле ``setup.py`` должен быть закреплен за одной версией. Это означает, что каждая версия Qiskit должна устанавливать только одну версию каждого элемента метапакета. Например, список требований должен выглядеть подобным образом::

source: To enforce a consistent code style in the project, we use `Pylint <https://www.pylint.org>`__ and `pycodesytle <https://pycodestyle.readthedocs.io/en/latest/>`__ to verify that code contributions conform to and respect the project's style guide. To verify that your changes conform to the style guide, run: ``tox -elint``
es_mx: Empleamos la herramienta `Pylint <https://www.pylint.org>`__ para mantener un estilo de código consistente en el proyecto y `pycodesytle <https://pycodestyle.readthedocs.io/en/latest/>`__ para verificar que las contribuciones de código se ajustan y respetan la guía de estilo del proyecto. Para verificar que tus modificaciones se ajustan a la guía de estilo ejecuta: ``tox -elint``
id_id: Untuk memastikan langgam kode yang konsisten dalam proyek, kami menggunakan `Pylint <https://www.pylint.org>`__ dan `pycodesytle <https://pycodestyle.readthedocs.io/en/latest/>`__ untuk memverifikasi bahwa kontribusi kode sudah sesuai dan menghormati panduan langgam proyek. Untuk memverifikasi bahwa perubahan Anda sudah sesuai dengan panduan langgam, mohon jalankan: ``tox -elint``
sw_ke: Ili kusisitiza mtindo wa msimbo thabiti katika mradi huu, tunatumia `Pylint <https://www.pylint.org>`__ na `pycodesytle <https://pycodestyle.readthedocs.io/en/latest/>`__ ili kuthibitisha kuwa michango ya misimbo inalingana na inafuata mwongozo wa mtindo wa mradi huu. Ili kuthibitisha kuwa mabadiliko yako yanafuata mwongozo wa mtindo, tumia: ``tox -elint``
ta_in: ஒரு செயல்திட்டத்தில் சீரான நடைமுறையில் code எழுத, நாம் `Pylint <https://www.pylint.org>`__ பயன்படுத்தலாம் மற்றும் அந்த code செயல்திட்டத்தின் நடைமுறை வழிகாட்டிக்கு இணங்க உள்ளதா என்பதை சரிபார்க்க `pycodesytle <https://pycodestyle.readthedocs.io/en/latest/>`__ பயன்படுத்தலாம். நீங்கள் செய்த மாற்றங்கள் நடைமுறை வழிகாட்டிக்கு இணங்க உள்ளதா என்பதை சரிபார்க்க, உபயோகியுங்கள்: ``tox -elint``
vi_vn: Để tuân theo một phong cách thống nhất trong dự án, chúng tôi dùng `Pylint' <https://www.pylint.org>`__ và `pycodesytle <https://pycodestyle.readthedocs.io/en/latest/>`__ để đảm bảo việc đóng góp code của bạn tôn trong và phù hợp với phong cách code của dự án. Để xác nhận xem sự đóng góp của bạn có phù hợp với hướng dẫn định dạng không, chạy ``tox -elint``

source: When reading an issue, after a number of back & forth comments, it is often clear what the root cause problem is. The commit message should have a clear statement as to what the original problem is. The bug is merely interesting historical background on *how* the problem was identified. It should be possible to review a proposed patch for correctness from the commit message, without needing to read the bug ticket.
es_mx: Al leer un problema, después de intercambiar comentarios, a menudo está claro cuál es la raíz del problema. El mensaje de confirmación debería decir claramente cuál es el origen del problema. El error es meramente para fines históricos sobre *cómo* se identificó el problema. Debería ser posible revisar que un parche propuesto es correcto desde el mensaje de confirmación, sin necesidad de leer el error.
id_id: Ketika membaca suatu isu, setelah sejumlah komentar bolak-balik, sering kali jelas apa yang menjadi akar permasalahan. Pesan komit harus memiliki pernyataan yang jelas mengenai apa yang menjadi masalah aslinya. Bug-nya hanyalah sekedar latar belakang sejarah yang menarik pada * bagaimana * masalah teridentifikasi. Haruslah memungkinkan untuk meninjau tambalan kode yang diusulkan hanya dari pesan komit, tanpa perlu membaca tiket bug-nya.
sw_ke: Unapopitia suala, baada ya maoni kadhaa, asili ya tatizo aghalabu huwa wazi. Ujumbe wa kuwekeza unafaa uwe na kauli bainifu inayoeleza tatizo asili. Kasoro yenyewe ni maelezo tu ya kihistoria yanayoeleza namna tatizo lilivyogunduliwa. Yastahili iwezekane kukagua usawa wa pendekezo la urekebishaji kutokana na ujumbe wa kuwekeza, pasi na kusoma cheti cha kasoro.
ta_in: ஒரு வெளியீட்டின் சில பல கருத்துக்களைப் படிக்கும் போதே, அப்பிரச்சனையின் மூலக்காரணம் என்ன என்பது தெளிவாகத் தெரிந்துவிடும். கமிட் தகவலில் உண்மையான பிரச்சனையின் தெளிவான அறிக்கை அமைந்திருக்க வேண்டும். அந்தப் பிழை அப்பிரச்சனை *எவ்வாறு* கண்டறியப்பட்டது என்பதைக் குறிக்கும் சுவாரஸ்யமான பின்னணியாகவே இருக்கும். பிழைச் சீட்டைப் படிக்காமலேயே, கமிட் தகவலில் முன்மொழியப்பட்ட சரியான பதிவுகளைக் கொண்டு விமர்சனம் செய்வது சாத்தியமாகவே இருக்கும்.
vi_vn: Khi nhìn nhận một vấn đề, sau khi đọc các bình luận nhiều lần thì vấn đề gốc sẽ rõ ràng hơn. Thông điệp commit nên có một bản tường trình rõ ràng về vấn đề ban đầu bạn gặp phải. Bug chỉ đơn thuần là về bối cảnh mà nó được xác định. Bug nên được đề xuất vá qua việc đọc thông điệp commit, mà không cần đọc bug ticket.

source: The hosted documentation at https://qiskit.org/documentation/ covers the entire Qiskit project; Terra is just one component of that. As such, the documentation builds for the hosted version are built by the Qiskit meta-package repository https://github.com/Qiskit/qiskit. When commits are merged to that repo, the output of Sphinx builds are uploaded to the qiskit.org website. Those Sphinx builds are configured to pull in the documentation from the version of the Qiskit elements installed by the meta-package at that point. For example, if the meta-package version is currently 0.13.0, then that will copy the documentation from Terra's 0.10.0 release. When the meta-package's requirements are bumped, then it will start pulling documentation from the new version. This means that fixes for incorrect API documentation will need to be included in a new release. Documentation fixes are valid backports for a stable patch release per the stable branch policy (see that section below).
es_mx: La documentación alojada en https://qiskit.org/documentation/ cubre el proyecto Qiskit por completo; Terra es solamente un componente de este. Como tal, la documentación generada para la versión alojada está construida usando el repositorio de meta paquetes de Qiskit https://github.com/Qiskit/qiskit. Cuando los commits se mezclan en el repositorio, la salida de Sphinx generada se sube al sitio web qiskit.org. La salida generada por Sphinx está configurada para encajar con la documentación de las versiones de los elementos de Qiskit instalados en el meta-paquete en ese momento. Por ejemplo, si la versión del meta-paquete es la 0.13.0, entonces se copiará la documentación de la versión 0.10.0 de Terra. Cuando los requisitos del meta-paquete son modificados, entonces empezará a extraer documentación de la nueva versión. Esto significa que se necesitarán arreglos para la documentación incorrecta de la API en la nueva versión. Los arreglos a la documentación son backports válidos para un versión estable según la política de la rama estable (vea esta sección abajo).
id_id: Dokumentasi yang tersimpan pada https://qiskit.org/documentation/ mencakup seluruh proyek Qiskit; Terra merupakan salah satu komponen tersebut. Dengan demikian, rangka (build) dokumentasi untuk versi yang disimpan dibangun oleh repositori meta-paket Qiskit https://github.com/Qiskit/qiskit. Ketika pengerjaan (commit) digabungkan ke repositori tersebut, keluaran rangka Sphinx diunggah ke website qiskit.org. Rangka-rangka Sphinx tersebut dikonfigurasikan untuk menarik dokumentasi dari versi elemen Qiskit yang diinstal oleh meta-paket pada saat itu. Sebagai contoh, jika versi meta-paket saat ini adalah 0.13.0, maka itu akan menyalin dokumentasi dari keluaran Terra 0.10.0. Ketika persyaratan meta-paket dinaikkan, maka itu akan mulai menarik dokumentasi dari versi yang baru. Hal ini berarti perbaikan untuk dokumentasi API yang salah akan perlu diikutsertakan dalam rilis baru. Perbaikan dokumentasi adalah backport yang valid untuk rilis patch yang stabil mengikuti kebijakan cabang stabil (lihat bagian tersebut di bawah).
sw_ke: Nyaraka zilizohifadhiwa kwenye https://qiskit.org/documentation/ zinashughulikia mradi mzima wa Qiskit; Terra ni sehemu moja tu ya hiyo. Kwa hivyo, nyaraka za toleo linalopangishwa kujengwa na repo ya kufurushi-meta cha Qiskit https://github.com/Qiskit/qiskit. Wakati mabadiliko yanaunganishwa katika repo hiyo, pato la ujenzi wa Sphinx hupakiwa kwenye wavuti wa qiskit.org. Jenzi hizo za Sphinx zimeundwa kuvuta nyaraka kutoka kwa toleo la vipengee vya Qiskit vilivoysakinishwa na kifurushi-meta wakati huo. Kwa mfano, ikiwa toleo la kifurushi-meta kwa sasa ni 0.13.0, basi hiyo itanakili nyaraka kutoka kwa toleo la Terra la 0.10.0. Mahitaji ya kifurushi-meta yanapojazana, basi itaanza kuvuta nyaraka kutoka kwa toleo jipya. Hii inamaanisha kuwa marekebisho ya nyaraka za API zisizo sahihi zitahutaji kujumuishwa katiak toleo jipya. Marekebisho ya nyaraka ni backports halali kwa toleo la kisasisho thabiti kwa sera thabiti ya tawi (angalia sehemu hiyo hapa chini).
ta_in: The hosted documentation at https://qiskit.org/documentation/ முழு Qiskit project; Terra அதன் ஒரு கூறு மட்டுமே. அப்படியே, நடைபெற்ற பதிப்புக்களுக்கான ஆவணத் தளங்கள் Qiskit meta-package repository https://github.com/Qiskit/qiskit. ஒழுங்குபடுத்தப்பட்ட பொழுது அந்த மறுபடியும், Sphinx builds (Sphinx builds) வெளியீடு qiskit.org இணையத்தளத்தில் ஏற்றுக்கொள்ளப்படுகின்றன. அந்த Sphinx கட்டளைகள் அந்த புள்ளியில் மெட்டா-தொகுப்பு நிறுவப்பட்ட Qiskit தனிமங்களின் பதிப்பிலிருந்து ஆவணத்தில் இழுக்க வடிவமைக்கப்பட்டுள்ளன. உதாரணமாக, மெட்டா-தொகுப்பு பதிப்பு தற்போது 0.13.0 என்றால், பின்னர் டெர்ரா 0.10.0 விடுதலிலிருந்து ஆவணத்தை நகலெடுக்கும். மெட்டா-தொகுப்பின் தேவைகள் bumped போதும், பின்னர் அது புதிய பதிப்பிலிருந்து ஆவணத்தை ஆரம்பிக்கும். This means that fixes for incorrect API documentation will be included in a new release. ஒரு நிலையான கிளை கொள்கைக்கு ஒரு நிலையான பக்க விடுதலை (கீழே அந்த பகுதியை பார்க்கவும்).
vi_vn: Phần tài liệu được lưu trữ tại https://qiskit.org/documentation/ chứa toàn bộ các dự án Qiskit; Terra chỉ là một phần trong đó. Do vậy, tài liệu được lưu trữ được xây dựng bằng Qiskit meta-package repository https://github.com/Qiskit/qiskit. Khi một commit được merge vào repo đó, phần đầu ra được Sphinx dựng sẽ được tải trực tiếp lên website qiskit.org. Các bản dụng đó được cấu hình để kéo phiên bản mới nhất của các tài liệu của các thành phần Qiskit được cài đặt bởi meta-package về. Ví dụ, nếu phiên bản hiện tại của meta-package là 0.13.0, thì nó sẽ sao chép tài liệu của bản phát hành Terra 0.10.0. Nếu các điều kiện của meta-package bị thay đổi, thì nó sẽ kéo về tài liệu của phiên bản mới hơn. Điều này có nghĩa các bản sửa đổi cho các sai phạm trong tài liệu API sẽ cần được kèm theo trong phát hành mới. Tài liệu cho các sửa đổi là các backport cho các bản vá ổn định cho chính sách bản vá ổn định(xem thêm phía dưới).

source: Automake
ta_in: தானாகவே
vi_vn: Tự động hóa

source: :ref:`qiskit-aer <install-qiskit-aer>`
el_gr: :ref:"qiskit-terra <install-qiskit-terra>"

source: :ref:`qiskit-ignis <install-qiskit-ignis>`
el_gr: :ref:"qiskit-terra <install-qiskit-terra>"

source: Before You Start
ko_kr: 시작하기 전에
pl_pl: Zanim zaczniesz
te_in: మీరు మొదలుపెట్టే ముందు
zh_tw: 在開始之前

source: If you are new to Qiskit contributing we recommend before diving in to the code you should do the following:
ko_kr: Qiskit에 기여하는 것이 처음이라면 코드에 뛰어들기 전에 다음과 같은 작업을 수행할 것을 권장한다.
pl_pl: Jeśli dopiero zaczynasz rozwijać z nami Qiskit, polecamy wykonanie następujących kroków przed przystąpieniem do kodowania:

source: Read the `Code of Conduct <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__
ko_kr: `행동 강령 <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__ 읽기
pl_pl: Przeczytaj `Kodeks postępowania <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__
te_in: `కోడ్ అఫ్ కాండక్ట్ <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>` __ ను చదవండి
zh_tw: 請閱讀 ` 程式編寫指南 <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__

source: :ref:`Decide what to work on <decide-what-to-work-on>`
ko_kr: :ref:`작업할 대상 선택하기 <decide-what-to-work-on>`
pl_pl: :ref:` Wybierz, nad czym chcesz pracować <decide-what-to-work-on>`
te_in: :ref:` 'దేనిపై పని చేయాలో నిర్ణయించుకోండి <decide-what-to-work-on>`
zh_tw: :ref:`決定進行哪項工作 <decide-what-to-work-on> "

source: Read the repo-specific :ref:`Contributing Guidelines <contributing_links>` for the repo you have decided to contribute to.
ko_kr: 기여하기로 결정한 저장소의 고유한 :ref:`기여 지침<contributing_links>` 읽기
pl_pl: Przeczytaj szczegółowe :ref:`Contributing Guidelines <contributing_links>` dla repozytorium, do którego chcesz wprowadzić zmiany.
te_in: నిర్దేశించిన రిపో ను చదవండి :ref:` మీరు సహకరించాలని నిర్ణయించుకున్న రెపో కోసం సహకార మార్గదర్శకాలు <contributing_links>.
zh_tw: 在貢獻您的一己之力前，請參閱各儲存庫專屬的 :ref:`貢獻指引 <contributing_links>` 。

source: :ref:`Set up your development environment <dev-env-setup>`
ko_kr: :ref:`개발 환경 설정하기 <dev-env-setup>`
pl_pl: :ref:`Skonfiguruj środowisko programistyczne <dev-env-setup>`
te_in: :ref:` మీ డెవలప్మెంట్ ఎన్విరాన్మెంట్ని ఏర్పాటు చేయండి <dev-env-setup>`
zh_tw: :ref:`設定您的開發環境 <dev-env-setup>`

source: Familiarize yourself with the Qiskit community (via `Slack <https://ibm.co/joinqiskitslack>`__, `Stack Exchange <https://quantumcomputing.stackexchange.com/>`__, `GitHub <https://github.com/qiskit-community/feedback/discussions>`__ etc.)
ko_kr: Qiskit 커뮤니티와 친해지기 (`Slack <https://ibm.co/joinqiskitslack>`__, `Stack Exchange <https://quantumcomputing.stackexchange.com/>`__, `GitHub <https://github.com/qiskit-community/feedback/discussions>`__ 등을 통해)

source: Decide What to Work on
ko_kr: 작업할 대상 선택하기
pl_pl: Zdecyduj, nad czym chcesz pracować
te_in: ఏ పని చేయాలనుకుంటున్నారో నిర్ణయించుకోండి
zh_tw: 決定進行哪項工作

source: If you're not sure what type of contribution is right for you, take a look at the following flowchart to help you:
ko_kr: 어떤 기여를 하는 게 적합한지 확신이 서지 않는다면, 다음 순서도를 참조하는 것이 도움이 될 것이다.
pl_pl: Jeśli nie jesteś pewien, jak możesz nam pomóc, to kieruj się poniższym schematem:
te_in: మీకు ఏ రకమైన సహకారం సరైనదో మీకు ఖచ్చితంగా తెలియకపోతే, మీకు సహాయం చేయడానికి క్రింది ఫ్లోచార్ట్‌ను చూడండి:
zh_tw: 如果您不確定以何種方式貢獻您的一己之力，請參閱以下流程圖以協助您：

source: Contributing to a Specific Repo
ko_kr: 특정 저장소에 기여하기
pl_pl: Twój wkład do konkretnego repozytorium
te_in: ఒక ప్రత్యేకమైన రిపో కు సహకరిస్తున్నప్పుడు
zh_tw: 貢獻至特定儲存庫
