Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: Alternatively, if you have a newer pip installed, or have some custom requirement, you can build a Python wheel manually.
bn_bn: অথবা আপনার যদি pip এর নতুন সংস্করণ ইন্সটল করা থাকে অথবা কিছু কাস্টম রিকোয়ারমেন্ট থেকে থাকে, তাহলে আপনি ম্যানুয়ালি একটি Python হুইল তৈরি (বিল্ড) করতে পারেন।
de_de: Alternativ, wenn man eine neuere Version von pip verwendet oder eine spezielle Konfiguration benötigt, kann man das Python-Wheel von Hand erstellen.
el_gr: Εναλλακτικά, αν έχετε ένα νεότερο pip εγκατεστημένο ή αν έχετε κάποια προσαρμοσμένη απαίτηση, μπορείτε να φτιάξετε έναν Python wheel χειροκίνητα.
es_mx: De manera alternativa, si tiene instalado un pip más reciente, o tienes algún requerimiento específico, puedes hacer un paquete Python Wheel manualmente.
es_un: Alternativamente, si tienes instalado un pip más nuevo o tienes algún requerimiento personalizado, puedes construir una Python wheel manualmente.
fr_fr: Alternativement, si vous avez installé un pip plus récent ou si vous avez des exigences personnalisées, vous pouvez construire un "wheel" Python manuellement.
id_id: Sebagai alternatif, jika Anda memiliki pip versi yang lebih baru, atau memiliki persyaratan khusus (custom), Anda dapat mem-build Python wheel secara manual.
it_it: In alternativa, se si dispone di una versione di pip più recente o si hanno delle esigenze specifiche, è possibile costruire manualmente una distribuzione binaria Python chiamata Wheel.
pt_un: Alternativamente, se você tiver uma versão do pip mais recente instalado ou tiver um requisito personalizado, você pode fazer a criação dos pacotes do Python wheel manualmente.
ru_ru: В качестве альтернативы, если у Вас установлен новый pip или у Вас есть особые требования, Вы можете создать Python wheel вручную.
sw_ke: Vinginevyo, ikiwa una pip mpya iliyosanikishwa, au una mahitaji fulani maalum, unaweza kujenga Python wheel kwa mikono.
ta_in: மாற்றாக, நீங்கள் ஒரு புதிய பிப் நிறுவப்பட்டால், அல்லது சில தனிப்பயன் தேவை கொண்டால், நீங்கள் ஒரு பைதான் வீலை கைமுறையாக உருவாக்க முடியும்.
tr_tr: Alternatif olarak, daha yeni bir pip'iniz varsa veya bazı özel gereksinimleriniz varsa, manuel olarak bir Python çarkı oluşturabilirsiniz.
vi_vn: Bên cạnh đó, nếu bạn có phiên bản pip mới hơn, hoặc có một vài yêu cầu đặc biệt, bạn có thể tự dựng một bản Python wheel theo yêu cầu.

source: If you need to set a custom option during the wheel build, refer to :ref:`aer_wheel_build_options`.
bn_bn: হুইল বিল্ডের সময় কাস্টম অপশন নির্ধারণ করে থাকলে :ref:`aer_wheel_build_options` এ নির্দেশ করুন।
de_de: Wenn Sie während der Wheel-Erstellung eine benutzerdefinierte Option setzen müssen, finden Sie Informationen dazu unter :ref:`aer_wheel_build_options`.
el_gr: Αν χρειαστεί να ορίσετε μια προσαρμοσμένη επιλογή κατά τη διάρκεια της κατασκευής του wheel, ανατρέξτε στο :ref:`aer_wheel_build_options`.
es_mx: Si necesita establecer una opción personalizada durante la construcción del paquete wheel, consulte :ref:`aer_wheel_build_options`.
es_un: Si necesitas configurar una opción personalizada durante la construcción de la wheel, consulta :ref:`aer_wheel_build_options`.
fr_fr: Si vous avez besoin de définir une option personnalisée pendant la construction du fichier "wheel", reportez-vous à :ref:`aer_wheel_build_options`.
id_id: Jika Anda perlu menetapkan opsi khusus selama wheel build, harap mengacu pada :ref:`aer_wheel_build_options`.
it_it: Se si ha l'esigenza di impostare un'opzione personalizzata durante la build della distribuzione binaria, fare riferimento a :ref:`aer_wheel_build_options`.
pt_un: Se você precisar definir uma opção personalizada durante a criação dos pacotes da wheel, consulte :ref:`aer_wheel_build_options`.
ru_ru: Если Вам нужно установить пользовательский параметр во время сборки, обратитесь к :ref:`aer_wheel_build_options`.
sw_ke: Iwapo unahitaji chaguo la kibinafsi wakati wa kujenga wheel, rejelea :ref:`aer_wheel_build_options`.
ta_in: சக்கர கட்டத்தின் போது ஒரு தனிப்பயன் விருப்பத்தை அமைக்க வேண்டும் என்றால், :ref:`aer_wheel_build_options`.
tr_tr: Çark oluşturma sırasında özel bir seçenek ayarlamanız gerekirse, buraya bakınız :ref:`aer_wheel_build_options`.
vi_vn: Nếu bạn cần thiết lập tùy chọn tùy chỉnh trong khi wheel, hãy tham khảo :ref:` `aer_wheel_build_options`.

source: After you build the Python wheel, it will be stored in the ``dist/`` dir in the Aer repository. The exact version will depend
bn_bn: Python হুইল গঠন করার পর এটি এয়ার রিপোজিটরির ``dist/`` ডিরেক্টরিতে সংরক্ষিত থাকবে। যথাযথ সংস্করণটির জন্য প্রয়োজন হবে
de_de: Nachdem das Python-Wheel erstellt wurde, wird es im ``dist/`` Verzeichnis des Aer Repositorys gespeichert. Die genaue Version hängt davon ab
el_gr: Μετά την κατασκευή του Python wheel, θα αποθηκευτεί στον φάκελο ``dist/`` στο αποθετήριο Aer. Η ακριβής έκδοση θα εξαρτηθεί
es_mx: Después de construir el Python wheel, éste será guardado en la carpeta ``dist/`` del repositorio Aer. La versión exacta dependerá
es_un: Después de construir la Python wheel, se almacenará en el directorio ``dist/`` en el repositorio de Aer. La versión exacta dependerá
fr_fr: Après avoir construit le "wheel" Python, il sera stockée dans le répertoire ``dist/`` dans le dépôt Aer. La version exacte dépendra
id_id: Setelah Anda membangun Python wheel, maka akan disimpan dalam ``dist/`` dir di repository Aer. Versi yang tepat akan tergantung
it_it: Dopo aver effettuato la build di Python wheel, sarà salvata nella cartella ``dist/`` nella repository di Aer. La versione esatta dipenderà
pt_un: Depois de feito a criação dos pacotes do Python wheel, ela será armazenada no diretório ``dist/`` no repositório Aer. A versão exata dependerá
ru_ru: Результат сборки будет храниться в каталоге ``dist/`` репозитория Aer. Точная версия зависит от используемой
sw_ke: Baada ya kujenga wheel ya Python, itahifadhiwa katika folda ya ``dist/`` katika repo ya Aer. Toleo halisi litategemea
ta_in: நீங்கள் பைதான் சுவையை உருவாக்கும் பிறகு, அது Aer களஞ்சியத்தில் ``dist/`` dir இல் சேமிக்கப்படும். சரியான பதிப்பு சார்ந்திருக்கும்
tr_tr: Python çarkını oluşturduktan sonra, Aer deposundaki ``dist/`` dizininde saklanacaktır. Tam sürümü şuna bağlıdır,
vi_vn: Sau khi bạn dựng Python wheel, nó sẽ được lưu tại thư mục ``dist/`` ở trong repo Aer. Phiên bản chính xác sẽ còn tùy thuộc vào

source: The exact filename of the output wheel file depends on the current version of Aer under development.
bn_bn: আউটপুট হুইল ফাইলের নামটি নির্ভর করে ডেভেলাপমেন্টে বা অগ্রগতি চলতে থাকা এয়ারের বর্তমান সংস্করণের ওপর।
de_de: Der genaue Dateiname der ausgegebenen Wheel-Datei hängt von der aktuellen Version von Aer ab.
el_gr: Το ακριβές όνομα του αρχείου του wheel εξόδου εξαρτάται από την τρέχουσα υπό ανάπτυξη έκδοση του Aer.
es_mx: El nombre exacto del archivo wheel de salida depende de la versión actual de Aer que en desarrollo.
es_un: El nombre exacto del archivo wheel de salida depende de la versión actual de Aer que está en desarrollo.
fr_fr: Le nom exact du fichier "wheel" en sortie dépend de la version d'Aer en cours de développement.
id_id: Nama lengkap dari file output wheel tergantung dari versi Aer terbaru.
it_it: Il nome esatto del file wheel di output dipende dalla versione corrente di Aer che si sta sviluppando.
pt_un: O nome exato do arquivo da wheel de saída depende da versão atual do Aer em desenvolvimento.
ru_ru: Точное название файла зависит от текущей версии Aer.
sw_ke: Jina halisi la faili ya wheel iliyozalishwa inategemea toleo la sasa la Aer lililo chini ya maendeleo.
ta_in: வெளியீட்டு சக்கர கோப்பின் சரியான கோப்பு பெயர் வளர்ச்சியின் கீழ் உள்ள Aer இன் தற்போதைய பதிப்பைப் பொறுத்தது.
tr_tr: Çıktı çarkı dosyasının tam dosya adı, geliştirilmekte olan Aer'in geçerli sürümüne bağlıdır.
vi_vn: Tên tệp chính xác của đầu ra của tệp wheel sẽ tùy thuộc vào phiên bản đang phát triển của Aer.

source: Custom options during wheel builds
bn_bn: নিজের মতো বিকল্প হুইল বিল্ড এর সময়
de_de: Benutzerdefinierte Wheel-Konfiguration
el_gr: Προσαρμοσμένες επιλογές κατά την κατασκευή του wheel
es_mx: Opciones personalizadas durante la construcción del wheel
es_un: Opciones personalizadas durante la construcción de la wheel
fr_fr: Options personnalisées lors de la construction de "wheel"
id_id: Opsi khusus selama pengaktifan wheel
it_it: Opzioni personalizzate durante le build wheel
pt_un: Opções customizadas durante os builds da wheel
ru_ru: Пользовательские параметры во время сборки
sw_ke: Chaguo za kibinafsi wakati wa kujenga wheel
ta_in: வீல் உருவாக்கங்களின் போது தனிப்பட்ட விருப்பங்கள்
tr_tr: Çark oluşturma sırasında özel seçenekler
vi_vn: Các tùy chọn khi dựng các bản wheel

source: The Aer build system uses `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ to run the compilation when building it with the Python interface. It acts as an interface for `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ to call `CMake <https://cmake.org/>`__ and compile the binaries for your local system.
bn_bn: এয়ার কম্পাইলেশনের জন্য পাইথন ইন্টারফেসের সাথে `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ ব্যবহার করে। এটি `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ এর জন্য একটি ইন্টারফেস হিসেবে কাজ করে যাতে `CMake <https://cmake.org/>`__ কল হয় এবং স্থানীয় ব্যবস্থায় বাইনারিগুলি কম্পাইল হয়।
de_de: Das Aer-Build-System verwendet `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ für die Kompilierung, wenn man die Python-Schnittstelle verwendet. Es fungiert dabei als Schnittstelle zu `setuptools <https://setuptools.readthedocs.io/en/latest/>`__, um `CMake <https://cmake.org/>`__ aufzurufen und die Binärdateien für das lokale System zu kompilieren.
el_gr: Το σύστημα κατασκευής Aer χρησιμοποιεί `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ για να εκτελέσει τη μεταγλώττιση κατά τη δημιουργία του με τη διεπαφή Python. Δρα ως διεπαφή για τα `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ για να καλέσετε `CMake <https://cmake.org/>`__ και να μεταγλωττίσετε τις εφαρμογές για το τοπικό σας σύστημα.
es_mx: El sistema de compilación Aer utiliza `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ para ejecutar la compilación cuando se construye usando la interfaz de Python. Esta actúa como interfaz para que las `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ hagan una llamada a `CMake <https://cmake.org/>`__ y compilen los binarios para tu sistema local.
es_un: El sistema de compilación Aer utiliza `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ para ejecutar la compilación cuando se construye usando la interfaz de Python. Esta actúa como interfaz para que las `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ hagan una llamada a `CMake <https://cmake.org/>`__ y compilen los binarios para tu sistema local.
fr_fr: Le système de construction Aer utilise `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>` __ pour exécuter la compilation lors de sa création avec l'interface Python. Il agit comme une interface pour `setuptools <https://setuptools.readthedocs.io/en/latest/>` __ pour appeler `CMake <https://cmake.org/>` __ et compiler les binaires pour votre système local.
id_id: Aer build system menggunakan `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ untuk menjalankan kompilasi ketika membangunnya dengan antarmuka Python. Ini bertindak sebagai antarmuka untuk `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ untuk memanggil `CMake <https://cmake.org/>`__ dan compile biner untuk sistem lokal Anda.
it_it: Il sistema di build di Aer utilizza `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ per eseguire la compilazione quando se ne realizza la build con l'interfaccia Python. Agisce come una interfaccia per `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ per chiamare `CMake <https://cmake.org/>`__ e compilare i binari per il proprio sistema locale.
pt_un: O sistema do Aer build usa `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ para executar a compilação ao construí-la com a interface Python. Ele atua como uma interface de `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ para chamar `CMake <https://cmake.org/>`__ e compilar os binários no seu sistema local.
ru_ru: Система сборки Aer использует `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ для запуска компиляции при сборке с помощью Python интерфейса. Он выступает в качестве интерфейса `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ для вызова `CMake <https://cmake.org/>`__ и компиляции бинарных файлов для Вашей системы.
sw_ke: Mfumo wa kujenga Aer unatumia `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ kutekeleza mkusanyiko wakati wa kuijenga kutumia kiolesura cha Python. Inafanya kazi kama kiolesura cha `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ kuagiza `CMake <https://cmake.org/>`__ na kukusanya jozi zitakazotumiwa na tarakilishi yako.
ta_in: பைதான் இடைமுகத்துடன் தொகுப்பை உருவாக்கும்போது அதை இயக்க Aer பில்ட் சிஸ்டம் `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ ஐப் பயன்படுத்துகிறது. `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ `CMake <https://cmake.org/>`__ ஐ அழைப்பதற்கும் உங்கள் உள்ளூர் கணினிக்கான பைனரிகளை தொகுப்பதற்கும் இது ஒரு இடைமுகமாக செயல்படுகிறது.
tr_tr: Aer derleme sistemi derlemeyi Python arabirimi ile derlerken çalıştırmak için `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ kullanır. `CMake <https://cmake.org/>`__ 'i çağırma ve yerel sisteminiz için ikili dosyaları derlemede `kurulum araçları <https://setuptools.readthedocs.io/en/latest/>__ için bir arayüz görevi görür.
vi_vn: Các bản dựng Aer sử dụng `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ để chạy các biên dịch khi dựng nó bằng giao diện Python. Nó hoạt động như một giao diện cho `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ để có thể gọi `CMake <https://cmake.org/>`__ và dựng mã nhị phân cho hệ thống của bạn.

source: Due to the complexity of compiling the binaries, you may need to pass options to a certain part of the build process. The way to pass variables is:
bn_bn: বাইনারিগুলি সংকলনের জটিলতার কারণে আপনার বিল্ড প্রক্রিয়াটির একটি নির্দিষ্ট অংশে বিকল্পগুলি পাস করতে হতে পারে। চল রাশিগুলি পাস করার উপায়টি হল:
de_de: Durch die Komplexität, die mit dem Kompilieren von Binärdateien einhergeht, kann es sein, dass man für einen bestimmten Teil des Prozesses benutzerdefinierte Optionen angeben muss. Dies kann man mit:
el_gr: Λόγω της πολυπλοκότητας της κατάρτισης των εφαρμογών, μπορεί να χρειαστεί να περάσετε τις επιλογές σε ένα ορισμένο μέρος της διαδικασίας κατασκευής. Ο τρόπος για να περάσετε μεταβλητές είναι:
es_mx: Debido a la complejidad de la compilación de binarios es posible que tenga que pasar opciones a ciertas partes del proceso de construcción. La forma de pasar variables es:
es_un: Debido a la complejidad de la compilación de binarios es posible que tengas que pasar opciones a ciertas partes del proceso de construcción. La forma de pasar variables es:
fr_fr: En raison de la complexité de la compilation des fichiers binaires, vous devrez peut-être passer des options à une certaine partie du processus de génération. Pour passer des variables, procédez comme suit :
id_id: Karena kompleksitas compiler biner, Anda mungkin perlu melewatkan pilihan pada bagian tertentu dari proses pembuatan. Cara untuk melewati variabel adalah:
it_it: A causa della complessità di compilazione dei binari, potrebbe essere necessario passare alcune opzioni ad un certo punto del processo di build. Il modo per passare le variabili è:
pt_un: Devido à complexidade de compilar os binários, você pode precisar passar opções para uma determinada parte do processo de build. A maneira de passar variáveis é:
ru_ru: Из-за сложности компиляции бинарных файлов Вам может потребоваться передать параметры определенной части процесса сборки. Способ их передачи:
sw_ke: Kwa sababu ya ugumu wa kukusanya binaries, itakubidi upitishe chaguzi katika sehemu fulani ya mchakato wa ujenzi. Jinsi ya kupitisha vigezo ni:
ta_in: பைனரிகளை தொகுப்பதில் உள்ள சிக்கலான தன்மை காரணமாக, நீங்கள் உருவாக்க செயல்முறையின் ஒரு குறிப்பிட்ட பகுதிக்கு விருப்பங்களை அனுப்ப வேண்டியிருக்கும். தேர்ச்சி மாறிகள் அனுப்ப வழி:
tr_tr: İkili dosyaları derlemenin karmaşıklığı nedeniyle, seçenekleri derleme sürecinin belirli bir bölümüne geçirmeniz gerekebilir. Değişkenleri geçirmenin yolu şudur:
vi_vn: Vì sự phức tạp để biên dịch mã nhị phân, có thể bạn sẽ cần truyền một vài lựa chọn vào một vài phần trong quá trình dựng. Cách để có thể truyền tham số là:

source: where the elements within square brackets `[]` are optional, and ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` are to be replaced by flags of your choice. A list of *CMake* options is available here: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. For example, you could run something like:
bn_bn: যেখানে `[]` ৩য় বন্ধনী ঐচ্ছিক এবং ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` কে আপনার পছন্দের ফ্ল্যাগ দিয়ে পুনঃস্থাপন করতে পারবেন। *CMake* অপশনের একটি তালিকা এখানে পাওয়া যাবেঃ https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options। যেমন, আপনি যদি এমন কিছু কার্যকর করতে চানঃ
de_de: wobei die Optionen in eckigen Klammern `[]` optional sind und ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` durch benutzerdefinierte Konfigurationen ersetzt werden. Eine Liste für *CMake* Optionen findet man unter: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. Beispielsweise kann man folgenden Befehl verwenden:
el_gr: όπου τα στοιχεία μέσα στις αγκύλες `[]` είναι προαιρετικά και ``skbuild_opts``, ``cmake_opts```, ``build_tool_opts`` πρέπει να αντικατασταθούν από σημαίες της επιλογής σας. Μια λίστα επιλογών *CMake* είναι διαθέσιμη εδώ: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. Για παράδειγμα, θα μπορούσατε να εκτελέσετε κάτι όπως:
es_mx: donde los elementos dentro de corchetes `[]` son opcionales, y ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` deben ser reemplazados por banderas de tu elección. Una lista de opciones de *CMake* está disponible aquí: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. Por ejemplo, puede ejecutar algo como esto:
es_un: donde los elementos dentro de corchetes `[]` son opcionales, y ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` deben ser reemplazados por banderas de tu elección. Una lista de opciones de *CMake* está disponible aquí: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. Por ejemplo, puedes ejecutar algo como esto:
fr_fr: où les éléments entre crochets `[]` sont optionnels et ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` doivent être remplacés par des options de votre choix. Une liste des options *CMake* est disponible ici: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. Par exemple, vous pouvez exécuter quelque chose comme :
id_id: dimana elemen dalam kurung persegi `[]` adalah opsional, dan ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` akan digantikan oleh bendera dari pilihan Anda. Daftar opsi *CMake* tersedia di sini: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. Sebagai contoh, Anda dapat menjalankan sesuatu seperti:
it_it: dove gli elementi tra parentesi quadre `[]` sono opzionali, e ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` devono essere sostituiti con valori a propria scelta. Un elenco delle opzioni *CMake* è disponibile al seguente link: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. Ad esempio, è possible eseguire un comando del tipo:
pt_un: onde os elementos dentro de colchetes `[]` são opcionais, e ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` serão substituídos por flags de sua escolha. Uma lista das opções *CMake* está disponível aqui: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. Por exemplo, você pode executar algo como:
ru_ru: где элементы в квадратных скобках `[]` необязательны, и ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` должны будут быть заменены на флаги на Ваш выбор. Список опций *CMake* доступен здесь: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. Например, Вы можете запустить следующее:
sw_ke: pale ambapo kipengele killicho ndani ya mabano ya mraba `[]` ni hiari na ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` zitabadilishwa na vigezo vya chaguo lako. Orodha ya chaguzi za *CMake* inapatikana hapa: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. Kwa mfano unzaweza kuendesha kitu kama:
ta_in: சதுர அடைப்புக்குறிக்குள் உள்ள கூறுகள் விருப்பமானவை, மற்றும் ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` ஆகியவை உங்களுக்கு விருப்பமான கொடிகளால் மாற்றப்பட வேண்டும். *CMake* விருப்பங்களின் பட்டியல் இங்கே கிடைக்கிறது: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. எடுத்துக்காட்டாக, நீங்கள் இதைப் போன்றவற்றை இயக்கலாம்:
tr_tr: köşeli parantez `[]` içindeki öğeler isteğe bağlıdır ve ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts``, seçtiğiniz bayraklarla değiştirilir. *CMake * seçeneklerinin bir listesini burada bulabilirsiniz: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. Örneğin, şöyle bir şey çalıştırabilirsiniz:
vi_vn: các thành phần ở trong ngoặc [] là tùy chọn, ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` có thể được thay đổi bởi các lựa chọn của bạn. Một danh sách các tùy chọn *CMake* có thể tham khảo ở đây: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options.Ví dụ, bạn có thể chạy gì đó như:
