Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: 2a. The migration path must have existed in a least a prior release before the new feature can be deprecated. For example, if you have a function ``foo()`` which is going to be replaced with ``bar()`` you can't deprecate the ``foo()`` function in the same release that introduces ``bar()``. The ``bar()`` function needs to be available in a release prior to the deprecation of ``foo()``. This is necessary to enable downstream consumers of Qiskit that maintain their own libraries to write code that works with > 1 release at a time, which is important for the entire ecosystem. If you would like to indicate that a deprecation will be coming in a future release you can use the ``PendingDeprecationWarning`` warning to signal this. But, the deprecation period only begins after a ``DeprecationWarning`` is being emitted.
es_un: 2a. La ruta de migración debe haber existido al menos en una liberación anterior antes de que la nueva función pueda quedar obsoleta. Por ejemplo, si tienes una función ``foo()`` que va a ser reemplazada por ``bar()``, no puedes hacer obsoleta la función ``foo()`` en la misma versión que introduces ``bar()``. La función ``bar()`` debe estar disponible en una versión antes de que ``foo()`` quede obsoleto. Esto es necesario para permitir que los consumidores intermedios (downstream) de Qiskit que mantienen sus propias librerías escriban código que funcione con más de 1 liberación a la vez, lo cual es importante para todo el ecosistema. Si deseas indicar que se producirá una obsolescencia en una versión futura, puedes usar la advertencia ``PendingDeprecationWarning`` para señalar esto. Sin embargo, el periodo de obsolescencia solo comienza después de que se emite una ``DeprecationWarning``.
fr_fr: 2a. Le chemin de migration doit avoir existé dans une version antérieure au moins avant que la nouvelle fonctionnalité ne puisse être dépréciée. Par exemple, si vous avez une fonction ``foo()`` qui va être remplacée par ``bar()`` vous ne pouvez pas déprécier la fonction ``foo()`` dans la même version que celle qui introduit ``bar()``. La fonction ``bar()`` doit être disponible dans une version avant la dépréciation de ``foo()``. Ceci est nécessaire pour permettre aux utilisateurs de Qiskit qui maintiennent leurs propres bibliothèques d'écrire du code qui fonctionne avec plus d'une version à la fois, ceci est important pour l'ensemble de l'écosystème. Si vous voulez indiquer qu'une dépréciation est prévue dans une prochaine version, vous pouvez utiliser l'avertissement ``PendingDeprecationWarning`` pour signaler cela. Mais, la période de dépréciation ne commence qu'après qu'un ``DeprecationWarning`` est en cours d'émission.
pt_un: 2a. A rota de migração deve ter existido em pelo menos uma release anterior antes que a nova funcionalidade possa ser descontinuada. Por exemplo, se você tiver uma função ``foo()``que será substituída por ``bar()``, você não pode depreciar a função ``foo()`` na mesma versão que introduz ``bar()``. A função ``bar()``precisa estar disponível na versão anterior à descontinuação de ``foo()``. Isso é necessário para permitir que os consumidores downstream do Qiskit que mantêm suas próprias bibliotecas escrevam código que funcione com > 1 versão por vez, o que é importante para todo o ecossistema. Se você gostaria de indicar que uma descontinuação virá em uma versão futura, você pode usar o aviso ``PendingDeprecationWarning`` para sinalizar isso. Mas, o período de depreciação só inicia após um ``DeprecationWarning`` ser emitido.
ru_ru: 2a. Путь миграции должен существовать как минимум перед тем, как новый компонент может быть объявлен устаревшим. Например, если у вас есть функция ``foo()``, которая будет заменена на ``bar()``, Вы не можете объявить ``foo()`` функцию устаревшей в том же выпуске, в котором вводится функция ``bar()``. Функция ``bar()`` должна быть доступна в новом выпуске до объявления ``foo()`` устаревшей. Это необходимо для того, чтобы позволить конечным потребителям Qiskit, которые поддерживают собственные библиотеки, писать код, который работает с > 1 выпуском за раз, что важно для всей экосистемы. Если Вы хотите указать, что в будущем выпуске появится устаревший код, то Вы можете воспользоваться предупреждением ``PendingDependationWarning``. Однако устаревший период начинается только после того, как издается ``DeprecationWarning``.

source: 3. An obsolescence date for the feature will be set. The feature must remain intact and working (although with the proper warning being emitted) in all releases pushed until after that obsolescence date. At the very minimum, the feature (or API, or configuration option) should be marked as deprecated (and continue to be supported) for at least three months of linear time from the release date of the first release to include the deprecation warning. For example, if a feature were deprecated in the 0.9.0 release of Terra, which was released on August 22, 2019, then that feature should still appear in all releases until at least November 22, 2019.
es_un: 3. Se establecerá una fecha de obsolescencia para la característica. La característica debe permanecer intacta y en funcionamiento (aunque se emita la advertencia adecuada) en todas las liberaciones que se publiquen hasta después de esa fecha de obsolescencia. Como mínimo, la función (o API, u opción de configuración) debe marcarse como obsoleta (y seguir siendo compatible) durante al menos tres meses de tiempo lineal a partir de la fecha de lanzamiento de la primera versión para incluir la advertencia de obsolescencia. Por ejemplo, si una función quedó obsoleta en la versión 0.9.0 de Terra, que se lanzó el 22 de agosto de 2019, esa función aún debería aparecer en todas las versiones hasta al menos el 22 de noviembre de 2019.
fr_fr: 3. Une date d'obsolescence de la fonction est définie. La fonction reste intacte et opérationnelle (avec émission d'un warning) dans toutes les versions produites avant la date d'obsolescence. La fonction (ou l'API) est signalée dépréciée (Deprecated) pendant au moins trois mois suivants la première version incluant l'avertissement de dépréciation. Par exemple, si une fonction est signalée dépréciée dans la version 0.9.0 de Terra, qui fut produite le 22 août 2019, elle reste disponible dans toutes les versions produites avant (minimum) le 22 novembre 2019. Il est cependant possible qu'un avertissement de dépréciation ne soit finalement émis que dans une seule version avant la suppression.
pt_un: 3. Uma data de obsolescência para o recurso será definida. O recurso deve permanecer intacto e funcionando (embora com o aviso adequado sendo emitido) em todas as releases liberadas até a data de obsolescência. No mínimo, o recurso (ou API, ou opção de configuração) deve ser marcada como obsoleta (e continuar a ser suportada) por pelo menos três meses desde a data de lançamento da primeira release a incluir o aviso de depreciação. Por exemplo, se uma funcionalidade foi descontinuada na versão 0.9.0 lançamento do Terra, lançado em 22 de agosto de 2019, então esse recurso ainda deverá aparecer em todos os lançamentos até pelo menos 22 de novembro de 2019.
ru_ru: 3. Устанавливается дата выведения функции из эксплуатации. Функция должна оставаться рабочей (с соответствующим предупреждением) во всех релизах до даты выведения из эксплуатации. Функция (или API, или опция конфигурации) должны быть помечены как устаревшие (но по-прежнему поддерживаемые) как минимум в течение трех месяцев с даты выпуска первого релиза с предупреждением о скором выводе из эксплуатации. Например, если функция устарела в версии 0.9. Qiskit Terra, которая была выпущена 22 августа 2019 года, то эта функция должна работать во всех версиях хотя бы до 22 ноября 2019 года.

source: 3a. A deprecated feature can not be removed unless it is deprecated in more than one release even if the minimum deprecation period has elapsed. For example, if a feature is deprecated in 0.20.0 which is released on January 20, 2022 and the next minor version release 0.21.0 is released on June 16, 2022 the deprecated feature can't be removed until the 0.22.0 release, even though 0.21.0 was more than three months after the 0.20.0 release. This is important because the point of the deprecation warnings are to inform users that a potentially breaking API change is coming and to give them a chance to adapt their code. However, many users skip versions (especially if there are a large numbers of changes in each release) and don't upgrade to every release, so might miss the warning if it's only present for a single minor version release.
es_un: 3a. Una característica obsoleta no se puede eliminar a menos que esté en desuso en más de una liberación, incluso si ha transcurrido el período mínimo de obsolescencia. Por ejemplo, si una función está obsoleta en 0.20.0 que se lanzó el 20 de enero de 2022 y la próxima versión secundaria 0.21.0 se lanzó el 16 de junio de 2022, la función obsoleta no se puede eliminar hasta la versión 0.22.0, a pesar de que 0.21.0 se generó a más de tres meses después del lanzamiento de 0.20.0. Esto es importante porque el objetivo de las advertencias de obsoletización es informar a los usuarios que se avecina un cambio de API potencialmente importante y darles la oportunidad de adaptar su código. Sin embargo, muchos usuarios se saltan las versiones (especialmente si hay una gran cantidad de cambios en cada versión) y no actualizan a cada versión, por lo que es posible que se pierda la advertencia si solo está presente en una versión menor.
fr_fr: 3a. Une fonction obsolète ne peut être supprimée que si elle est obsolète dans plusieurs versions, même si la période d'obsolescence minimale s'est écoulée. Par exemple, si une fonction est obsolète dans la version 0.20.0 qui est publiée le 20 janvier 2022 et que la prochaine version mineure 0.21.0 est publiée le 16 juin 2022, la fonction obsolète ne peut pas être supprimée avant la version 0.22.0, même si 0.21.0 est plus de trois mois après la version 0.20.0. Ceci est important parce que le but des avertissements d'obsolescence est d'informer les utilisateurs qu'un changement de l'API potentiellement révolutionnaire arrive et de leur donner une chance d'adapter leur code. Cependant, de nombreux utilisateurs ignortent les versions (surtout s'il y a un grand nombre de changements dans chaque version) et ne mettent pas à jour toutes les versions, de sorte que l'avertissement risque de ne pas être mis en garde s'il est présent uniquement pour une version de version mineure.
pt_un: 3a. Uma funcionalidade descontinuada não pode ser removida, a menos que esteja depreciada em mais de uma release, mesmo que o período de depreciação mínimo tenha decorrido. Por exemplo, se uma funcionalidade é descontinuada na 0.20.0, que foi lançada em 20 de janeiro de 2022, e a próxima versão menor 0.21.0 é lançada em 16 de junho de 2022, a funcionalidade depreciada não pode ser removida até a versão 0.22.0, ainda que a 0.21.0 tenha sido lançada mais de três meses após a versão 0.20.0. Isso é importante porque o propósito dos avisos de descontinuação são de informar os usuários que uma possível mudança incompatível na API está vindo e dar a eles uma chance de adaptar seus códigos. No entanto, muitos usuários pulam versões (especialmente se houver uma grande quantidade de mudanças em cada release) e não atualizam para cada versão, então podem perder o aviso se ele estiver presente apenas para uma única versão menor.
ru_ru: 3a. Устаревший компонент нельзя удалить, если он не объявлен устаревшим в нескольких выпусках, даже если истек минимальный срок устаревания. Например, если компонент был объявлен устаревшим в версии 0.20.0, который был выпущен 20 января 2022 года, а следующий выпуск 0.21.0 был выпущен 16 июня 2022, устаревшую функцию нельзя удалить до выпуска 0.22.0, несмотря на то, что 0.21.0 был выпущен более чем через три месяца после выпуска 0.20.0. Это важно, поскольку предупреждение об устаревании заключается в том, чтобы информировать пользователей о том, что происходит потенциальное изменение API, и дать им возможность адаптировать свой код. Однако многие пользователи пропускают версии (особенно при большом количестве изменений в каждом выпуске) и не обновляются с выходом каждого выпуска, поэтому могут пропустить предупреждение о выводе функции из строя, если оно присутствует только для одного выпуска версии.

source: These files are used to tell Sphinx which modules to include in the rendered documentation. This contains two pieces of information: an `internal reference <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`__ or `cross reference <https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`__ to the module, which can be used for internal links inside the documentation, and an `automodule directive <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ used to parse the module docstrings from a specified import path. For example, the ``dagcircuit.rst`` file contains::
es_un: Estos archivos se utilizan para decirle a Sphinx qué módulos incluir en la documentación renderizada. Esto contiene dos piezas de información: una `referencia interna <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`__ o una `referencia cruzada <https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`__ al módulo, que se puede usar para enlaces internos dentro de la documentación, y una `directiva automódulo <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ que se utiliza para analizar las docstrings del módulo desde una ruta de importación especificada. Por ejemplo, el archivo ``dagcircuit.rst`` contiene:
fr_fr: Ces fichiers permettent de préciser à Sphinx quels modules sont à intégrer dans la documentation finale. Ils contiennent deux types d'information : une `référence interne <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`__ ou `une référence croisée <https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`__ à un autre module, utilisé comme lien interne à l'intérieur de la documentation, et une `directive automodule <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ utilisée pour détailler les docstrings via un chemin d'import (import path). Par exemple, le fichier dagcircuit.rst contient::
pt_un: Estes arquivos são utilizados para dizer ao Sphinx quais módulos incluir na documentação renderizada. Isto contém dois elementos de informação: uma `referência interna <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`__ ou `referência cruzada <https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`__ para o módulo, que pode ser usado para links internos dentro da documentação, e uma `diretiva automodule <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ usada para analisar as docstrings do módulo de um path de importação especificado. Por exemplo, o arquivo ``dagcircuit.rst`` contém::
ru_ru: Эти файлы используются, чтобы указать Sphinx, какие модули следует включать в формирование документации. Они содержат два вида информации: `внутренние ссылки <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`__ или `перекрестные ссылки <https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`__ к модулю, который может использоваться для внутренних ссылок внутри документации, а также директива `automodule <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__, которая используется для парсинга модулей из указанного пути их импорта. Например, файл ``dagcircuit.rst`` содержит:

source: The hosted documentation at https://qiskit.org/documentation/ covers the entire Qiskit project; Terra is just one component of that. As such, the documentation builds for the hosted version are built by the Qiskit meta-package repository https://github.com/Qiskit/qiskit. When commits are merged to that repo, the output of Sphinx builds are uploaded to the qiskit.org website. Those Sphinx builds are configured to pull in the documentation from the version of the Qiskit elements installed by the meta-package at that point. For example, if the meta-package version is currently 0.13.0, then that will copy the documentation from Terra's 0.10.0 release. When the meta-package's requirements are bumped, then it will start pulling documentation from the new version. This means that fixes for incorrect API documentation will need to be included in a new release. Documentation fixes are valid backports for a stable patch release per the stable branch policy (see :ref:`stable_branch_policy`).
es_un: La documentación alojada en https://qiskit.org/documentation/ cubre todo el proyecto Qiskit; Terra es solo un componente de eso. Como tal, la documentación generada para la versión alojada está construida desde el repositorio de meta paquetes de Qiskit https://github.com/Qiskit/qiskit. Cuando los commits son mezclados con ese repositorio, la salida de las compilaciones de Sphinx se carga en el sitio web qiskit.org. Esas construcciones de Sphinx están configuradas para extraer la documentación de la versión de los elementos Qiskit instalados por el meta paquete en ese momento. Por ejemplo, si la versión del meta paquete es actualmente 0.13.0, entonces se copiará la documentación de la versión 0.10.0 de Terra. Cuando los requisitos del meta paquete son incrementados, entonces comenzará a extraer documentación de la nueva versión. Esto significa que las correcciones para la documentación incorrecta de la API deberán incluirse en una nueva versión. Las correcciones de documentación son backports válidos para una versión de parche estable según la política de rama estable (consulta :ref:`stable_branch_policy`).
fr_fr: La documentation dans https://qiskit.org/documentation/ couvre l'intégralité du projet Qiskit. Terra n'est qu'une partie de ce projet. Les builds de cette documentation sont produits par le meta-package Qiskit https://github.com/Qiskit/qiskit. Lorsque les Commits sont rassemblés dans ce répertoire, les builds Sphinx sont chargés dans le site web qiskit.org. Ces builds Sphinx sont configurés pour pousser la documentation dans la version définie dans les meta-packages. Par exemple, si la version des meta-packages est toujours la 0.13.0, la documentation est issue de la version 0.10.0 de Terra. La documentation est poussée depuis la nouvelle version lorsque les meta-packages évoluent. Cela implique que les corrections faites à la documentation d'une API doivent être incluses dans une nouvelle version. Ces corrections sont des backports d'une version stable, conforme à la politique de branche stable (voir ci-dessous :ref:`stable_branch_policy`).
pt_un: A documentação hospedada em https://qiskit.org/documentation/ abrange todo o projeto Qiskit; Terra é apenas um componente. Como tal, as compilações de documentação para a versão hospedada são criadas pelo repositório Qiskit meta-package https://github.com/Qiskit/qiskit. Quando submissões (commits) são mesclados no repositório, a saída das compilações Sphinx são enviadas para o site qiskit.org. Essas compilações Sphinx estão configuradas para puxar a documentação da versão dos elementos Qiskit instalados pelo meta-package nesse ponto. Por exemplo, se a versão do meta-package é atualmente 0.13.0, então isso irá copiar a documentação da versão 0.10.0 do Terra. Quando os requisitos do meta-package são preenchidos, então ele vai começar a puxar a documentação a partir da nova versão. Isto significa que as correções para documentação de API incorretas terão de ser incluídas em uma nova versão. Correções de documentação são backports válidas para um lançamento de patch estável por uma política de ramificação (branch) estável (veja esta seção abaixo).
ru_ru: Размещенная на сайте https://qiskit.org/documentation/ документация охватывает весь проект Qiskit; Terra является всего лишь одним из его компонентов. Сборки документации для актуальной версии фреймворка собраны репозиторием Qiskit meta-package https://github.com/Qiskit/qiskit. Когда коммиты попадают в данный репозиторий, сборки Sphinx загружаются на сайт qiskit.org. Эти сборки сконфигурированы так, чтобы получать документацию тех версий элементов Qiskit, которые установлены мета-пакетом. Например, если текущая версия meta-пакета 0.13.0, то будет скопирована документация из релиза Terra 0.10.0. Когда требования метапакета изменяются, начинает подгружаться документация уже новой версии. Это означает, что исправления ошибочной документации API должны также быть включены в новый релиз. Исправления документации - это допустимые бэкпорты для выпуска патча в stable-ветку соответствии с политикой стабильной ветки (см. :ref:`stable_branch_policy`).
