Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: Qiskit users need to know if a feature or an API they rely upon will continue to be supported by the software tomorrow. Knowing under which conditions the project can remove (or change in a backwards-incompatible manner) a feature or API is important to the user. To manage expectations, the following policy is how API and feature deprecation/removal is handled by Qiskit:
bn_bn: Qiskit ব্যবহারকারীদের জানা প্রয়োজন যে, তারা যে ফিচার বা এপিআই (API) ব্যবহার করছেন, সেটি এই সফটওয়্যার দ্বারা সবসময় নিয়ন্ত্রিত থাকবে। কখন বা কোন শর্তের অধীনে প্রকল্পটি (প্রজেক্ট) একটি ফিচার বা এপিআই (API) বাদ দিতে পারবে (অথবা পরিবর্তন করতে পারবে) সে সম্পর্কে ধারণা রাখা ব্যবহারকারীর জন্য গুরুত্বপূর্ণ। Qiskit এর ফিচার এবং এপিআই (API) অপসারণ নীতি নিচে দেয়া হলোঃ
de_de: Qiskit-Benutzer müssen wissen, ob ein Feature oder eine API, auf die sie sich verlassen, auch morgen noch von der Software unterstützt werden. Das Wissen, unter welchen Bedingungen das Projekt ein Feature oder eine API entfernen (oder auf eine nicht rückwärtskompatible Art ändern) kann, ist für den Benutzer wichtig. Um die richtigen Erwartungen zu vermitteln, gilt folgende Richtlinie für die API- bzw. Feature-DepreKation/-Entfernung bei Qiskit:
es_mx: Los usuarios de Qiskit necesitan saber si alguna funcionalidad o una API que utilizan se mantendrá habilitada por el software el día de mañana. Para el usuario es importante saber bajo que condiciones el proyecto puede eliminar (o modificar de forma irreversible) una funcionalidad o API. Para gestionar anticipaciones, la siguiente política describe la forma en la que Qiskit maneja la obsolesencia/eliminación de una API o funcionalidad:
es_un: Los usuarios de Qiskit necesitan saber si una funcionalidad o una API en la que confían continuará siendo compatible con el software el día de mañana. Es importante para el usuario saber en qué condiciones el proyecto puede eliminar (o cambiar de manera incompatible con versiones anteriores) una funcionalidad o API. Para gestionar las expectativas, la siguiente política es cómo Qiskit maneja la desactivación/eliminación de una API o funcionalidad:
fr_fr: Les utilisateurs de Qiskit doivent pouvoir savoir si les fonctions ou les APIs qu'ils utilisent seront toujours supportées demain. Savoir sous quelles conditions un projet peut supprimer (ou modifier sans compatibilité ascendante) une fonctionnalité, est très important pour les développeurs. La politique décrite ci-dessous explique comment les APIs et le fonctionnalités sont dépréciées ou supprimées dans Qiskit :
id_id: Pengguna Qiskit perlu mengetahui apakah sebuah fitur atau API yang mereka andalkan akan terus didukung oleh perangkat lunak di masa depan. Penting bagi pengguna untuk dapat mengetahui di bawah kondisi apa proyek dapat menghapus (atau mengubah secara permanen) fitur atau API. Untuk membatasi ekspektasi, kebijakan berikut ini adalah bagaimana API dan fitur depekkrasi/penghapusan ditangani oleh Qiskit:
it_it: Gli utenti di Qiskit devono sapere se una funzionalità o un'API che utilizzano continuerà ad essere supportata dal software anche in futuro. Sapere in quali condizioni il progetto può rimuovere (o modificare in modo non retro compatibile) una funzionalità o un'API è importante per l'utente. Per gestire le aspettative, la seguente politica descrive come vengono gestite da Qiskit la deprecazione/rimozione di API e funzionalità:
pt_un: Os usuários do Qiskit precisam saber se um recurso ou uma API com a qual eles dependem continuarão a ser suportados pelo software amanhã. Saber em que condições o projeto pode remover (ou alterar versões anteriores incompatíveis) uma funcionalidade ou API é importante para o usuário. Para gerenciar isso, a seguinte política descreve como a API e a depreciação/remoção de funcionalidades são tratadas pelo Qiskit:
ru_ru: Пользователи Qiskit должны знать, будет ли поддерживаться та или иная функция или API в ближайшем будущем. Также важно для пользователя и знание, при каких условиях в проекте может удаляться (или изменять обратную совместимость) функция или API. Чтобы вы могли это понимать, следующая политика отражает, как происходит работа при устаревании/удалении компонентов в Qiskit:
sw_ke: Watumiaji wa Qiskit wanahitaji kujua iwapo kipengele au API wanayotegemea itaendelea kuungwa mkono na programu hiyo keshoye. Kujua ni kwa hali gani mradi unaweza kuondoa (au kubadilisha kwa njia ya kurudi nyuma isiyotangamana) kipengele au API ni muhimu kwa mtumiaji. Kusimamia matarajio, sera ifuatayo ni jinsi API na ukataliwa/uondoaji wa kipengele unavyoshughulikiwa na Qiskit:
ta_in: Qiskit பயனர்கள் ஒரு வசதி அல்லது ஒரு API இல்லையென்றால் நாளை மென்பொருட்களால் ஆதரிக்கப்படும். பின்புறம் (அல்லது ஒரு பின்னணி-பொருத்தமான முறையில் மாறுபடும்) ஒரு வசதி அல்லது API பயனருக்கு முக்கியமானதாகும். எதிர்பார்ப்பை நிர்ணயிக்கவும், பின்வரும் கொள்கை எப்படி API மற்றும் வசதி மறுபடியும் Qiskit மூலம் கையாளப்படுகிறது:
tr_tr: Qiskit kullanıcıları güvendikleri bir özellik ya da API'ın yarın yazılım tarafından desteklenip desteklenmeyeceğini bilmelidir. Hangi koşullar altında projenin bir özellik ya da API'ı kaldırabileceğini (ya da geriye dönük uyumsuz bir şekilde değiştirebileceğini) bilmek kullanıcı için önemlidir. Aşağıdaki bildiri beklentileri idare etmek için API'ın ve özelliğin kullanım dışı bırakılmasının/kaldırılmasının Qiskit tarafından nasıl yürütüldüğüdür:
vi_vn: Người dùng Qiskit nên biết rằng một tính năng hoặc một API họ sử dụng có tiếp tục được hỗ trợ sau này không. Biết rằng dưới điều kiện nào dự án có thể loại bỏ (hoặc thay đổi để có thể tương tích ngược) một tính năng hay API là quan trọng đối với người dùng. Để quán lý sự kỳ vọng, chính sách sau đây là cách mà Qiskit xử lý về sự hết hạn hoặc loại bỏ các API và tính năng:

source: 1. Features, APIs, or configuration options are marked deprecated in the code. Appropriate ``DeprecationWarning`` class warnings will be sent to the user. The deprecated code will be frozen and receive only minimal maintenance (just so that it continues to work as-is).
bn_bn: ১। ফিচার, এপিআই (API) অথবা কনফিগারেশনের অপশনগুলো অপসারণযোগ্য হিসেবে কোডে চিহ্নিত থাকবে। যথাযথ ``DeprecationWarning`` শ্রেনির সতর্কতাবার্তা পৌঁছে যাবে ব্যবহারকারীর কাছে। অপসারণকৃত কোড সরিয়ে রাখা হবে এবং সেটির ন্যূনতম রক্ষণাবেক্ষণ করা হবে যাতে স্বাভাবিক কাজ চালানো যায়।
de_de: 1. Funktionen, APIs oder Konfigurationsoptionen sind im Code veraltet. Angemessene ``DeprecationWarning``-Klassenwarnungen werden an den Benutzer gesendet. Der veraltete Code wird eingefroren und erhält nur minimale Wartungsarbeiten (nur damit er weiterhin funktioniert).
es_mx: 1. Funcionalidades, APIs u opciones de configuración se marcan como obsoletas en el código. Se enviarán al usuario advertencias de clase ``DeprecationWarning`` apropiadas. El código obsoleto será congelado y recibirá mantenimiento mínimo (el necesario para permitir su funcionamiento tal y como está).
es_un: 1. Características, API u opciones de configuración están marcadas como obsoletas en el código. Se enviarán al usuario las advertencias apropiadas con la clase ``DeprecationWarning``. El código obsoleto será congelado y recibirá solo un mantenimiento mínimo (solo para que continúe funcionando como está).
fr_fr: 1. Les fonctionnalités, APIs ou options de configuration sont signalés dépréciées dans le code. Des alertes (``DeprecationWarning`` class warnings) seront envoyées aux utilisateurs. Le code déprécié sera gelé et recevra une maintenance minimale (fonctionnement en l'état).
id_id: 1. Fitur, API, atau opsi konfigurasi ditandai tidak berlaku (atau terdepekrasi) lagi dalam kode. Peringatan ``DeprecationWarning`` yang tepat akan dikirim ke pengguna. Kode yang sudah terdepekrasi akan dibekukan dan hanya menerima pemeliharaan minimal (hanya supaya dapat terus berfungsi).
it_it: 1. Le funzionalità, le API o le opzioni di configurazione sono contrassegnate nel codice come deprecate. Opportuni avvisi di classe ``DeprecationWarning`` saranno inviati all'utente. Il codice deprecato sarà congelato e riceverà solo una manutenzione minima (per permettergli di continuare a funzionare così com'è).
pt_un: 1. Recursos, APIs, ou opções de configuração estão marcados como descontinuados no código. ``DeprecationWarning`` apropriadas serão enviados para o usuário. O código obsoleto será congelado e receberá apenas uma manutenção mínima (apenas para que continue funcionando como está).
ru_ru: 1. Функции, API или параметры конфигурации помечены как устаревшие в коде. Соответствующие предупреждения класса ``DeprecationWarning`` будут отправлены пользователю. Устаревший код будет заморожен и получит минимальный уровень поддержки (просто продолжит работать как есть).
sw_ke: 1. Vipengele, APIs au chaguzi za usanidi zimewekwa alama ya ukataliwa katika msimbo. Maonyo yafaayo ya ``DeprecationWarning`` yatatumwa kwa mtumiaji. Msimbo uliokataliwa utagandishwa na kupokea matengenezo kidogo tu (ili tu iendelee kufanya kazi kama ilivyo).
ta_in: 1. அம்சங்கள், API கள் அல்லது உள்ளமைவு விருப்பங்கள் குறியீட்டில் நீக்கப்பட்டன. பொருத்தமான ``DeprecationWarning`` வகுப்பு எச்சரிக்கைகள் பயனருக்கு அனுப்பப்படும். நீக்கப்பட்ட குறியீடு உறைந்து, குறைந்தபட்ச பராமரிப்பை மட்டுமே பெறும் (அது தொடர்ந்து செயல்படுவதால்).
tr_tr: 1. Özellikler, API'lar ya da konfigürasyon seçenekleri kodda kullanım dışı olarak işaretlenir. Uygun ``DeprecationWarning`` (Kullanım Dışı) sınıf uyarıları kullanıcıya gönderilecektir. Kullanım dışı kod dondurulacak ve sadece en küçük gereksinimi (sadece çalışmaya devam edebileceği şekliyle) alınacaktır.
vi_vn: 1. Các tính năng, API hoặc các tùy chọn cấu hình được đánh dấu hết hạn ở trong code. Một cảnh báo ``DeprecationWarning`` sẽ được gửi đến người dùng. Code không còn được sử dụng sẽ được đóng băng và chỉ được nhận duy trì tối thiểu (chỉ để có thể làm việc với nó).

source: 2. A migration path will be documented for current users of the feature. This will be outlined in the both the release notes adding the deprecation, and the release notes removing the feature at the completion of the deprecation cycle. If feasible, the warning message will also include the migration path. A migration path might be "stop using that feature", but in such cases it is necessary to first judge how widely used and/or important the feature is to users, in order to determine a reasonable obsolescence date.
bn_bn: ২। ফিচারের বর্তমান ব্যবহারকারীদের জন্য একটি স্থানান্তরকরণের উপায় বিবরণীতে দেয়া থাকবে। এটি ডেপ্রিকেশনের রিলিজ নোট এবং ডেপ্রিকেশন বা অপসারণের শেষে ফিচার বাদ দেয়ার রিলিজ নোটে উল্লেখ করা থাকবে। সম্ভব হলে, একটি সতর্কতামূলক বার্তাও স্থানান্তরকরণের উপায়ে দেয়া হবে। এটি হতে পারে এরকম "এই ফিচারটি ব্যবহার করা বন্ধ করুন"। কিন্তু এসব ক্ষেত্রে ফিচারটি বহুল ব্যবহৃত কিনা বা ব্যবহারকারীদের জন্য কতটা গুরুত্বপূর্ণ সেটি বিবেচনা করে এর বিলুপ্তির তারিখ নির্ধারণ করতে হয়।
de_de: 2. Es wird eine Anleitung zur Migration für bestehende Nutzer des Features dokumentiert. Diese wird sowohl in den Release-Notes der Version, in der die Deprecation hinzufügt wurde, als auch in den Release-Notes der Version, in der das Feature final entfernt wurde, aufgeführt. Falls möglich, sollte die Warnmeldung auch eine Anleitung zur Migration enthalten. Eine solche Anleitung kann bspw. "stop using that feature" sein. In solchen Fällen ist es aber nötig zuerst abzuwägen, wie wichtig das Feature für Nutzer ist, oder wie oft es verwendet wird, um ein geeignetes Auslaufdatum festzulegen.
es_mx: 2. Una ruta de migración será documentada para usuarios que utilicen la funcionalidad actualmente. Esto se resaltará en las notas de lanzamiento que notifiquen la obsolesencia al igual que las notas de lanzamiento que notifiquen la eliminación de la funcionalidad al completar el ciclo de obsolesencia. Si es posible, el mensaje de advertencia también incluirá la ruta de migración. Una ruta de migración quizás sea "dejar de utilicar dicha funcionalidad", en esos casos es necesario considerar que tan utilizada o importante es dicha funcionalidad para los usuarios, para poder determinar una fecha de obsolesencia razonable.
es_un: 2. Se documentará una ruta de migración para los usuarios actuales de la característica. Esto se describirá tanto en las notas de la versión que agregan la obsolescencia como en las notas de la versión que eliminan la característica al finalizar el ciclo de obsolescencia. Si es posible, el mensaje de advertencia también incluirá la ruta de migración. Una ruta de migración podría ser "dejar de usar esa característica", pero en tales casos es necesario juzgar primero qué tan ampliamente utilizada y/o importante es la característica para los usuarios, a fin de determinar una fecha de obsolescencia razonable.
fr_fr: 2. Un chemin de migration sera documenté pour les utilisateurs de la fonctionnalité. Ce chemin sera décrit dans les release notes associées à la dépréciation et dans celles associées à la suppression de la fonction à la fin du cycle de dépréciation. Si cela est possible, le message d'avertissement décrira lui-aussi le chemin de migration. Un chemin de migration peut se résumer à "N'utilisez plus cette fonction", mais dans ce cas, il est important d'évaluer l'impact de la modification et d'envisager une date d'obsolescence raisonnable, qui tienne compte de l'importance de la fonctionnalité concernée.
id_id: 2. Sebuah jalur migrasi akan didokumentasikan untuk para pengguna dari fitur. Ini akan dijabarkan di kedua catatan rilis tentang menambahkan deprekasi, dan catatan rilis tentang menghapus fitur tersebut setiap penyelesaian siklus deprekasi. Jika memungkinkan, pesan peringatan juga akan mencakup jalur migrasi. Sebuah jalur migrasi bisa jadi berisi "berhenti menggunakan fitur itu", tetapi dalam kasus seperti itu diperlukan untuk sebelumnya menilai seberapa banyak digunakan dan/atau penting fitur ini kepada pengguna, dalam rangka menentukan tanggal kadaluarsa yang wajar.
it_it: 2. Un percorso di migrazione sarà documentato per gli attuali utenti della funzionalità. Questo sarà descritto sia nelle note di rilascio aggiungendo la deprecazione, sia nelle note di rilascio che rimuovono la funzionalità al completamento del ciclo di deprecazione. Se possibile, il messaggio di avviso includerà anche il percorso di migrazione. Un percorso di migrazione potrebbe essere "smettere di usare quella funzionalità", ma in questi casi è necessario prima giudicare quanto diffusamente la funzionalità sia utilizzata e/o quanto importante sia per gli utenti, al fine di determinare una data di obsolescenza ragionevole.
pt_un: 2. Um caminho para migração será documentado para os usuários atuais da funcionalidade. Isto será delineado em ambas as notas de lançamento, adicionando a depreciação, e as notas de lançamento removendo a funcionalidade na conclusão do ciclo de depreciação. Se possível, a mensagem de aviso incluirá também o caminho para migração. Um caminho para migração pode ser "parar de usar esse recurso", mas em tais casos é necessário primeiro avaliar o quão amplamente usado e/ou importante o recurso é para os usuários, a fim de determinar uma data razoável de obsolescência.
ru_ru: 2. Способ миграции будет задокументирован для текущих пользователей функции. Это будет описано в примечаниях к релизу, в котором функция будет помечена как устаревшая (deprecated), а также в примечании к релизу, в котором эта функция будет окончательно удалена в конце цикла устаревания. Если это возможно, предупреждение будет также описывать способ миграции. Миграция может состоять и в том, чтобы «прекратить использование этой функции», однако, в таких случаях необходимо сначала понять, насколько широко используются и/или насколько важна функция для пользователей, чтобы определить приемлемую дату выведения функции из эксплуатации.
sw_ke: 2. Njia ya uhamiaji itawekwa kumbukumbu kwa watumiaji wa sasa wa kipengee hicho. Hii itaainishwa katika noti za toleo zinazoongeza ukataliwa na noti za toleo zinazoondoa kipengee hicho wakati wa kumaliza mzunguko wa ukataliwa. Ikiwezekana, ujumbe wa onyo utajumuisha pia njia ya uhamiaji. Njia ya uhamiaji inaweza kuwa "wacha kutumia huduma hiyo", lakini katika hali kama hizo ni muhimu kwanza kutathmini upana wa utumizi wa kipengee hicho na/au umuhimu wake kwa watumiaji, ili kutathmini tarehe itakayofaa ya kupitwa na wakati.
ta_in: 2. அம்சத்தின் தற்போதைய பயனர்களுக்கு இடம்பெயர்வு பாதை ஆவணப்படுத்தப்படும். தேய்மானம் சேர்க்கும் வெளியீட்டுக் குறிப்புகள் மற்றும் தேய்மான சுழற்சியின் முடிவில் அம்சத்தை அகற்றும் வெளியீட்டுக் குறிப்புகள் இரண்டிலும் இது கோடிட்டுக் காட்டப்படும். சாத்தியமானால், எச்சரிக்கை செய்தியில் இடம்பெயர்வு பாதையும் இருக்கும். ஒரு இடம்பெயர்வு பாதை "stop using that feature" ஆக இருக்கலாம், ஆனால் இதுபோன்ற சந்தர்ப்பங்களில் பயனர்கள் ஒரு நியாயமான வழக்கற்றுத் தேதியைத் தீர்மானிக்க, அந்த அம்சம் பயனர்களுக்கு எவ்வளவு பரவலாகப் பயன்படுத்தப்படுகிறது மற்றும் / அல்லது முக்கியமானது என்பதை முதலில் தீர்மானிக்க வேண்டும்.
tr_tr: 2. Geçiş yolu, özelliğin mevcut kullanıcıları için belgelenecektir. Bu kullanım dışı döngüsünün tamamlanmasında hem kullanım dışına eklenen sürüm notlarını hem de kaldırılan özelliğin sürüm notlarını özetleyecektir. Eğer uygulanabilme durumu olursa, uyarı mesajı ayrıca geçiş yolunu içerecektir. Bir geçiş yolu "stop using that feature" (bu özelliğin kullanımını durdur) olabilir fakat bazı durumlarda kabul edilebilir tükenme tarihini belirlemek için önce özelliğin nasıl geniş çapta kullanılır olduğuna ve/veya kullanıcılar için nasıl önemli olduğuna karar vermek gerekir.
vi_vn: 2. Sẽ có một chỉ dẫn trong tài liệu cho người dùng về sự di chuyển. Điều này sẽ được nêu ở trong release notes đề cập đến sự hết hạn cũng như về sự loại bỏ code ở cuối quá trình thay đổi. Nếu có thể, thông điệp cảnh báo cũng sẽ kèm theo chỉ dẫn. Một chỉ dẫn có thể chỉ là 'dừng dùng tính năng này', tuy nhiên trong trường hợp đó, việc xem xét độ phổ biến/quan trọng của tính năng đó với người dùng là cần thiết, để có thể xác định xem thời điểm lỗi thời hợp lý.

source: 3. An obsolescence date for the feature will be set. The feature must remain intact and working (although with the proper warning being emitted) in all releases pushed until after that obsolescence date. At the very minimum, the feature (or API, or configuration option) should be marked as deprecated (and continue to be supported) for at least three months of linear time from the release date of the first release to include the deprecation warning. For example, if a feature were deprecated in the 0.9.0 release of Terra, which was released on August 22, 2019, then that feature should still appear in all releases until at least November 22, 2019. Since releases do not occur at fixed time intervals, a deprecation warning may only occur in one release prior to removal.
bn_bn: ৩। ফিচার অকার্যকারিতার একটি দিন নির্ধারণ করা হবে। নির্ধারিত দিন আসার পূর্ব পর্যন্ত ফিচারটি অবশ্যই অক্ষত এবং সব রিলিজে ক্রিয়াশীল হতে হবে। ডেপ্রিকেশন বার্তাসম্বলিত প্রথম রিলিজ থেকে অন্তত টানা তিন মাস ফিচারটিকে (বা এপিআই অথবা কনফিগারেশন অপশন)ডেপ্রিকেটেড বা অপসারণযোগ্য (সাপোর্ট সহ) হিসেবে চিহ্নিত রাখা হবে। উদাহরণস্বরূপ, যদি কোনো ফিচার টেরার ০.৯.০ রিলিজে অপসারণ করা হয়, যেটি কিনা ২২ আগস্ট ২০১৯ এ রিলিজ করা হয়েছিলো, উক্ত ফিচারটি অন্তত ২২ নভেম্বর ২০১৯ পর্যন্ত সকল রিলিজে বহাল থাকবে। যেহেতু রিলিজগুলো নির্দিষ্ট সময় ব্যবধানে হয় না, ডেপ্রিকেশন বা অপসারণের সতর্কতা বার্তা হয়তো একটি রিলিজে একবারই দৃশ্যমান হবে।
es_mx: 3. Se establecerá una fecha de obsolescencia para la característica en cuestión. Esta, debe permanecer intacta y funcional (pero mostrando la advertencia apropiada) en todas las actualizaciones hasta después de la fecha de obsolescencia. Como mínimo, la funcionalidad (o API, u opción de configuración) deberá ser marcada como obsoleta (y seguir estando habilitada) por lo menos tres meses después de haberse lanzado la primera actualización que incluye el aviso de obsolescencia. Por ejemplo, si una funcionalidad quedara obsoleta en la versión 0.9.0 de Terra, lanzada el 22 de agosto de 2019, entonces esa funcionalidad debería estar presente en todas las versiones al menos hasta el 22 de noviembre de 2019. Dado que las versiones no se lanzan en intervalos de tiempo fijos, es posible que sólo se produzca una advertencia de obsolescencia en una versión anterior a su eliminación.
id_id: 3. Tanggal kadaluarsa untuk fitur akan diatur. Fitur tersebut harus tetap utuh dan bekerja (meskipun dengan peringatan yang tepat) dalam semua rilis yang diekluarkan sampai setelah tanggal kadaluarsa tersebut. Setidaknya, fitur (atau API, atau pilihan konfigurasi) harus ditandai sebagai sudah tidak berlaku lagi (namun terus didukung) selama setidaknya tiga bulan sejak tanggal rilis dari rilis pertama yang menyertakan peringatan deprekasi. Sebagai contoh, jika sebuah fitur terdeprekasi dalam rilis 0.9.0 dari Terra yang dirilis pada 22 Agustus 2019, maka fitur tersebut masih harus muncul di semua rilis sampai setidaknya 22 November 2019. Karena rilis tidak terjadi pada rentang waktu yang pasti, peringatan deprekasi mungkin hanya diumumkan pada satu rilis sebelum penghapusan.
sw_ke: 3. Tarehe ya kupitwa na wakati ya kipengee hicho itawekwa. Kipengee hicho sharti kibaki sawa na kikifanya kazi (ingawa onyo linalofaa likitolewa) katika matoleo yote yaliyosukumwa hadi baada ya tarehe hiyo ya kupitwa na wakati. Kwa kiwango cha chini kabisa, kipengee hicho (au API au chaguo la usanidi) inafaa kutiliwa alama kuwa imekataliwa (na iendelee kuungwa mkono) kwa angalau miezi mitatu ya wakati wa kimstari kutoka tarehe ya kutolewa kwa toleo la kwanza kujumuisha onyo la kukataliwa. Kwa mfano, ikiwa kipengee kilikataliwa katika toleo la Terra la 0.9.0, ambalo lilitolewa mnamo Agosti 22, 2019, basi kipengee hicho kinapaswa bado kuonekana katika matoleo yote hadi angalau Novemba 22, 2019. Kwa kuwa matoleo hayatokei kwa vipindi vya muda uliowekwa, onyo la kukataliwa linaweza kutokea tu katika toleo moja kabla ya kuondolewa.
ta_in: 3. அம்சத்திற்கான வழக்கற்றுப்போன தேதி அமைக்கப்படும். எல்லா வழக்குகளிலும் அந்த அம்சம் அப்படியே இருக்க வேண்டும் மற்றும் செயல்பட வேண்டும் (சரியான எச்சரிக்கை உமிழப்பட்டாலும்) அந்த வழக்கற்றுப் போன தேதிக்குப் பிறகு தள்ளப்படும். குறைந்தபட்சம், அம்சம் (அல்லது API, அல்லது உள்ளமைவு விருப்பம்) முதல் வெளியீட்டின் வெளியீட்டு தேதியிலிருந்து குறைந்தபட்சம் மூன்று மாதங்களுக்கு நேரியல் நேரத்திற்கு நீக்கப்பட்டதாக குறிக்கப்பட வேண்டும் (மற்றும் தொடர்ந்து ஆதரிக்கப்படுகிறது). எடுத்துக்காட்டாக, ஆகஸ்ட் 22, 2019 அன்று வெளியிடப்பட்ட டெர்ராவின் 0.9.0 வெளியீட்டில் ஒரு அம்சம் நீக்கப்பட்டிருந்தால், அந்த அம்சம் குறைந்தபட்சம் நவம்பர் 22, 2019 வரை அனைத்து வெளியீடுகளிலும் தோன்ற வேண்டும். வெளியீடுகள் நிலையான நிலையில் ஏற்படாது என்பதால் நேர இடைவெளியில், நீக்குவதற்கு முன் ஒரு வெளியீட்டில் மட்டுமே நீக்குதல் எச்சரிக்கை ஏற்படலாம்.
vi_vn: 3. Một ngày hết hạn cho tính năng sẽ được chọn. Tính năng này phải được giữ nguyên và hoạt động được (mặc dù có thể phát ra cảnh báo thích hợp) trong tất cả các bản phát hành cho đến ngày hết hạn. Ở mức tối thiểu, tính năng (hoặc API, hoặc tùy chọn cấu hình) nên được đánh dấu là không khuyên dùng (và tiếp tục được hỗ trợ) cho ít nhất ba tháng tính từ ngày phát hành của bản phát hành đầu tiên có bao gồm cảnh báo ngừng hỗ trợ. Ví dụ, nếu một tính năng bị cảnh báo ngừng hỗ trợ trong bản phát hành 0.9.0 của Terra được phát hành vào ngày 22 tháng 8 năm 2019, thì tính năng đó sẽ vẫn xuất hiện trong tất cả các bản phát hành cho đến ít nhất là ngày 22 tháng 11 năm 2019. Vì các phát hành không cập nhật trong khoảng thời gian cố định, một cảnh báo ngừng hỗ trợ có thể chỉ xuất hiện trong một bản phát hành trước khi loại bỏ.
