Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: Virtual environments are used for Qiskit development to isolate the development environment from system-wide packages. This way, we avoid inadvertently becoming dependent on a particular system configuration. For developers, this also makes it easy to maintain multiple environments (e.g. one per supported Python version, for older versions of Qiskit, etc.).
es_un: Los entornos virtuales (virtual environments) son usados en el desarrollo en Qiskit para aislar el ambiente de desarrollo de los paquetes del sistema en general. De esta manera podemos evitar ser dependientes de que nuestro sistema tenga una configuración específica. Para desarrolladores, esto también hace que sea fácil mantener múltiples entornos (por ejemplo, uno por cada versión compatible de Python, para versiones anteriores de Qiskit, etc.).
fr_fr: Les environnements virtuels sont utilisés pour le développement de Qiskit ainf d'isoler l'environnement de développement des paquets à l'échelle du système. De cette façon, nous évitons par inadvertance de devenir dépendants d'une configuration système particulière. Pour les développeurs, cela facilite également la maintenance de plusieurs environnements (par exemple, un par version Python supportée, pour les anciennes versions de Qiskit, etc.).
ko_kr: 가상 환경은 Qiskit 개발에서 개발 환경을 시스템 전반의 패키지에서 분리하기 위해 사용된다. 이렇게 하면 실수로 특정 시스템 구성에 종속되는 것을 방지할 수 있다. 개발자들에게는 다양한 환경을 쉽게 유지할 수 있도록 해 준다 (예: 지원되는 Python 버전 당 하나, Qiskit의 이전 버전들 등).
pl_pl: Środowiska wirtualne są używane do programowania w Qiskit w celu odizolowania środowiska programistycznego od pakietów systemowych. W ten sposób unikamy nieumyślnego uzależnienia się od konkretnej konfiguracji systemu. Programistom ułatwia to też utrzymanie wielu środowisk (np. jedno na obsługiwaną wersję Pythona, inne dla starszych wersji Qiskit, itp.).
pt_un: Os ambientes virtuais são usados para desenvolvimento com o Qiskit para isolar o ambiente de desenvolvimento dos pacotes de todo o sistema. Desta forma, evitamos nos tornar inadvertidamente dependentes de uma configuração de sistema específica. Para desenvolvedores, isso também facilita a manutenção de vários ambientes (por exemplo, um por versão do Python suportada, para versões mais antigas do Qiskit, etc.).
ru_ru: Виртуальные среды используются при разработке в Qiskit для изоляции среды от других системных пакетов. Таким образом избегается зависимость от конфигурации системы. Разработчикам это также упрощает поддержку нескольких сред (например, для каждой версии Python, среда для более старых версий Qiskit и т.д.).
te_in: సిస్టమ్-వైడ్ ప్యాకేజీల నుండి డెవలప్‌మెంట్ ఎన్విరాన్‌మెంట్‌ను వేరుచేయడానికి Qiskit అభివృద్ధి కోసం వర్చువల్ ఎన్విరాన్‌మెంట్‌లు ఉపయోగించబడతాయి. ఈ విధంగా, మేము అనుకోకుండా నిర్దిష్ట సిస్టమ్ కాన్ఫిగరేషన్‌పై ఆధారపడకుండా ఉంటాము. డెవలపర్‌ల కోసం, ఇది బహుళ వాతావరణాలను నిర్వహించడాన్ని కూడా సులభతరం చేస్తుంది (ఉదా. మద్దతు ఉన్న పైథాన్ వెర్షన్‌కు ఒకటి, Qiskit యొక్క పాత వెర్షన్‌లు మొదలైనవి).

source: **M1 Mac users:** Some Qiskit dependencies may not yet be available in PyPI. Until they are, Conda is recommended.
es_un: **Usuarios de M1 Mac:** Puede que algunas dependencias de Qiskit no estén disponibles en PyPI todavía. Hasta que no lo estén, se recomienda usar Conda.
fr_fr: **Utilisateurs Mac M1 :** Certaines dépendances Qiskit ne sont peut-être pas encore disponibles avec PyPI. Tant qu'elles ne le sont pas, Conda est recommandé.
ru_ru: **Для пользователей Mac с процессорами M1:** Некоторые зависимости пакета Qiskit пока не доступны в PyPI. До их появления рекомендуется использовать Conda.

source: All Python versions supported by Qiskit include built-in virtual environment module `venv <https://docs.python.org/3/tutorial/venv.html>`__.
es_un: Todas las versiones de Python compatibles con Qiskit incluyen el módulo de entorno virtual incorporado `venv <https://docs.python.org/3/tutorial/venv.html>`__.
fr_fr: Toutes les versions de Python prises en charge par Qiskit incluent le module d'environnement virtuel intégré `venv <https://docs.python.org/3/tutorial/venv.html>`__.
ko_kr: Qiskit 에서 지원하는 모든 Python 버전에는 내장 가상 환경 모듈 'venv <https://docs.python.org/3/tutorial/venv.html>' __가 있다.
pl_pl: Wszystkie wersje Pythona obsługiwane przez Qiskit zawierają wbudowany moduł wirtualnego środowiska `venv <https://docs.python.org/3/tutorial/venv.html>`__.
pt_un: Todas as versões do Python suportadas pelo Qiskit incluem o módulo de ambiente virtual integrado `venv <https://docs.python.org/3/tutorial/venv.html>`__.
ru_ru: Все поддерживаемые Qiskit версии Python включают в себя встроенный модуль виртуальной среды `venv <https://docs.python.org/3/tutorial/venv.html>`__.
te_in: Qiskit చే సమర్పించిన అన్ని Python వెర్షన్లు బల్ట్-ఇన్ వర్చ్యువల్ వాతావరణ మాడ్యూల్ ` venv <https://docs.python.org/3/tutorial/venv.html>` __.
zh_tw: Qiskit 支援的所有 Python 版本包括內建虛擬環境模組 `venv <https://docs.python.org/3/tutorial/venv.html>`__。

source: Start by creating a new virtual environment with ``venv``. The resulting environment will use the same version of Python that created it and will not inherit installed system-wide packages by default. The specified folder will be created and is used to hold the environment's installation. It can be placed anywhere. For more detail, see the official Python documentation, `Creation of virtual environments <https://docs.python.org/3/library/venv.html>`__.
es_un: Comienza creando un nuevo entorno virtual con ``venv``. El entorno resultante utilizará la misma versión de Python que lo creó y no heredará los paquetes instalados para todo el sistema por defecto. La carpeta especificada se creará y se utilizará para contener la instalación del entorno. Se puede colocar en cualquier lugar. Para más detalles, consulta la documentación oficial de Python, `Creación de entornos virtuales <https://docs.python.org/es/3.8/library/venv.html>`__.
fr_fr: Commencez par créer un nouvel environnement virtuel avec ``venv``. L'environnement résultant utilisera la même version de Python qui l'a créée et n'héritera pas des paquets installés à l'échelle du système par défaut. Le dossier spécifié est créé et est utilisé pour contenir l'installation de l'environnement. Il peut être placée à n'importe quel endroit. Pour plus de détails, consultez la documentation officielle de Python, ` Creation of virtual environments <https://docs.python.org/3/library/venv.html>` __.
ko_kr: 먼저 "venv" 로 새 가상 환경을 생성하는 것부터 시작한다. 생성된 환경에서는 이를 생성한 것과 동일한 버전의 Python을 사용하며 기본적으로 설치된 시스템 전체 패키지를 상속하지 않는다. 가상 환경이 생성되면 특정한 폴더가 생성되며 이 폴더는 가상 환경 설치를 보유하는 데 사용된다. 이 폴더는 어디에나 배치될 수 있다. 자세한 내용은 공식 Python 문서, '가상 환경의 작성' ( <https://docs.python.org/3/library/venv.html>) 을 참조하라.
pl_pl: Zacznij od stworzenia nowego wirtualnego środowiska z ``venv``. Powstałe środowisko będzie korzystać z tej samej wersji Pythona, której użyto do jego stworzenia, i nie będzie domyślnie dziedziczyć zainstalowanych pakietów systemowych. Zostanie utworzony folder do przechowywania zainstalowanego środowiska. Można go umieścić w dowolnym miejscu. W calu uzyskania dalszych informacji, zapoznaj się z oficjalną dokumentacją Pythona, `Tworzenie wirtualnych środowisk <https://docs.python.org/3/library/venv.html>`__.
pt_un: Inicie criando um novo ambiente virtual com o ``venv``. O ambiente resultante usará a mesma versão do Python que o criou e não herdará pacotes instalados em todo o sistema por padrão. A pasta especificada será criada e é usada para manter a instalação do ambiente. Ela pode ser colocada em qualquer lugar. Para obter mais detalhes, consulte a documentação oficial do Python, `Criação de ambientes virtuais <https://docs.python.org/pt-br/3/library/venv.html>`__.
ru_ru: Начните с создания нового виртуального окружения ``venv``. Созданная среда будет использовать ту же версию Python, в которой она была создана, и по умолчанию не будет устанавливать общие системные пакеты. Указанная папка будет создана и использоваться вдальнейшем для установки окружения. Она может быть размещена в любом месте на компьютере. Для получения более подробной информации см. документацию Python `Creation of virtual environments <https://docs.python.org/3/library/venv.html>`__.
zh_tw: 透過 ``venv`` 開始建立新虛擬環境，建立好的環境將繼續使用原版本的Python ，新環境的初始設定不會保有已安裝於系統的套件。 指定的資料夾將被建立，並用來保存環境的安裝，可以放置於任何地方。 如需詳細資料，請參閱正式 Python 說明文件， `建立虛擬環境 <https://docs.python.org/3/library/venv.html>`__。

source: Activate the environment by invoking the appropriate activation script for your system, which can be found within the environment folder. For example, for bash/zsh:
es_un: Active el entorno invocando el script de activación correspondiente a tu sistema, encontrado en la carpeta del entorno. Por ejemplo, para bash/zsh:
fr_fr: Activez l'environnement en appelant le script d'activation approprié pour votre système, qui se trouve dans le dossier de l'environnement. Par exemple, pour bash/zsh:
ko_kr: 사용자 시스템에 적합한 활성화 스크립트를 호출하여 가상 환경을 활성화하라. 이 스크립트는 가상 환경 폴더 내에서 찾을 수 있다. 예를 들어, bash/zsh의 경우:
pl_pl: Aktywuj środowisko poprzez uruchomienie odpowiedniego dla swojego systemu skryptu, który znajdziesz w folderze środowiska. Na przykład dla bash/zsh:
pt_un: Ative o ambiente invocando o script de ativação apropriado para o seu sistema, que pode ser encontrado na pasta do ambiente. Por exemplo, para bash/zsh:
ru_ru: Активируйте окружение, вызвав соответствующий Вашей системе скрипт, который находится в папке окружения. Например, bash/zsh:
te_in: ఎన్విరాన్మెంట్ ఫోల్డర్‌లో కనుగొనగలిగే మీ సిస్టమ్ కోసం తగిన యాక్టివేషన్ స్క్రిప్ట్‌ను ప్రారంభించడం ద్వారా పర్యావరణాన్ని సక్రియం చేయండి. ఉదాహరణకు, bash/zsh కోసం:

source: Upgrade pip within the environment to ensure Qiskit dependencies installed in the subsequent sections can be located for your system.
es_un: Actualiza pip dentro del entorno para asegurarte de que las dependencias de Qiskit instaladas en las siguientes secciones puedan ser ubicadas en tu sistema.
fr_fr: Mettez à niveau le pip dans l'environnement pour vous assurer que les dépendances Qiskit installées dans les sections suivantes peuvent être localisées pour votre système.
ko_kr: 가상 환경 내에서 pip을 업그레이드하여 후속 섹션에 설치된 Qiskit 라이브러리를 시스템에 맞게 확인할 수 있다.
pl_pl: Uaktualnij pip w środowisku, aby upewnić się, że zależności Qiskit zainstalowane w kolejnych sekcjach są dostępne dla twojego systemu.
pt_un: Atualize o pip dentro do ambiente para garantir que as dependências do Qiskit instaladas nas seções subsequentes possam ser localizadas para o seu sistema.
ru_ru: Обновите pip в среде, чтобы убедиться в том, что зависимости Qiskit установлены и могут быть обнаружены системой.
te_in: మీ సిస్టమ్ కోసం తదుపరి విభాగాలలో ఇన్‌స్టాల్ చేయబడిన Qiskit డిపెండెన్సీలను నిర్ధారించడానికి పర్యావరణంలో పిప్‌ను అప్‌గ్రేడ్ చేయండి.
zh_tw: 在建構好的環境內升級 pip 套件 ，以確保在後續章節中安裝的 Qiskit 依賴項可以在您的系統中找到。

source: For Conda users, a new environment can be created as follows.
es_un: Para los usuarios de Conda, se puede crear un nuevo entorno de la siguiente manera.
fr_fr: Pour les utilisateurs Conda, un nouvel environnement peut être créé comme suit.
ko_kr: Conda 사용자의 경우, 다음과 같이 새 가상 환경을 작성할 수 있다.
pl_pl: Użytkownicy Conda mogą utworzyć nowe środowisko w następujący sposób.
pt_un: Para usuários do Conda, um novo ambiente pode ser criado da seguinte forma.
ru_ru: Пользователи Conda могут создать новую виртуальную среду следующим образом.
te_in: కొండ వినియోగదారులకు, ఒక కొత్త వాతావరణాన్ని ఇలా సృష్టించవచ్చు.
zh_tw: 對於 Conda 使用者，可以如下創建新環境。

source: **Mac M1 Users:** There are ongoing issues with building Aer for AArch64 macOS. See `#1286 <https://github.com/Qiskit/qiskit-aer/issues/1286>`__ for discussion and workarounds before continuing.
es_un: **Usuarios de Mac M1:** Hay problemas con la construcción de Aer para macOS AArch64. Consulta `#1286 <https://github.com/Qiskit/qiskit-aer/issues/1286>`__ para discusiones y alternativas antes de continuar.
fr_fr: ** Utilisateurs de Mac M1: ** Il y a des problèmes en cours avec le build Aer pour AArch64 macOS. Voir `#1286 <https://github.com/Qiskit/qiskit-aer/issues/1286>` __ pour trouver les discussion et les solutions avant de continuer.
ru_ru: **Пользователям Mac с процессорами M1:** Существуют проблемы со сборкой Aer для AArch64 macOS. Посетите `#1286 <https://github.com/Qiskit/qiskit-aer/issues/1286>`__ перед продолжением.

source: The Qiskit project is made up of several elements each performing different functionality. Each is independently useful and can be used on their own, but for convenience we provide this repository and meta-package to provide a single entrypoint to install all the elements at once. This is to simplify the install process and provide a unified interface to end users. However, because each Qiskit element has its own releases and versions, some care is needed when dealing with versions between the different repositories. This document outlines the guidelines for dealing with versions and releases of both Qiskit elements and the meta-package.
es_un: El proyecto Qiskit se compone de varios elementos, cada uno de los cuales realiza una funcionalidad diferente. Cada uno es útil de forma independiente y se puede utilizar por sí solo, pero para mayor comodidad proporcionamos este repositorio y metapaquete para proporcionar un único punto de entrada para instalar todos los elementos a la vez. Esto es para simplificar el proceso de instalación y proporcionar una interfaz unificada a los usuarios finales. Sin embargo, debido a que cada elemento de Qiskit tiene sus propias liberaciones y versiones, es necesario tener cuidado al tratar con versiones entre los diferentes repositorios. Este documento describe las pautas para tratar con versiones y liberaciones tanto de los elementos de Qiskit como del metapaquete.
fr_fr: Le projet Qiskit est constitué de plusieurs éléments couvrant différentes fonctionnalités. Chacun des éléments a son utilité et peut être utilisé de manière indépendante, mais pour faciliter les choses nous fournissons une source et un meta-package servant de point d'entrée et permettant d'installer tous les éléments en une seule fois. Il s'agit de simplifier le processus d'installation et d'offrir une interface unique aux utilisateurs. Cependant dans la mesure ou chacun des éléments a ses propres versions, il faut apporter un minimum d'attention lorsque l'on gère les différentes versions de chacun des éléments. Ce document souligne les lignes directrices à observer pour gérer les différentes versions des éléments, et le meta-package.
pt_un: O projeto Qiskit é composto de vários elementos, onde cada um executa uma funcionalidade diferente. Cada elemento é independentemente útil e pode ser usado por conta própria, mas por conveniência nós fornecemos este repositório e um meta-pacote, de modo a proporcionar um único ponto de entrada para a instalação de todos os elementos, em uma só vez. Isto simplifica o processo de instalação e fornece uma interface unificada aos usuários finais. No entanto, como cada elemento no Qiskit tem seus próprios releases e versões, alguns cuidados são necessários ao lidar com as versões dentre os diferentes repositórios. Este documento descreve as diretrizes para lidar com versões e releases para ambos os elementos Qiskit e meta-pacote.
ru_ru: Проект Qiskit состоит из нескольких элементов, каждый из которых выполняет свои функции. Каждый из них полезен и может быть использован отдельно, но для удобства мы предоставляем данный репозиторий и мета-пакет, для обеспечения единой точки входа для установки всех элементов. Это упрощает процесс установки и предоставляет простой интерфейс пользователям. Однако, поскольку каждый элемент Qiskit имеет отдельные циклы релизов, версии требуют особого внимания при работе между различными репозиториями. В данном документе излагаются руководящие принципы по работе с версиями отдельных элементов Qiskit и единого метапакета.

source: For example, if the meta-package is tracking 2 elements ``qiskit-aer`` and ``qiskit-terra`` and its version is ``0.7.4``. Then we release a new element ``qiskit-ignis`` that we intend to also have included in the meta-package. When we add the new element to the meta-package we increase the version to ``0.8.0``.
es_un: Por ejemplo, si el metapaquete está rastreando los 2 elementos ``qiskit-aer`` y ``qiskit-terra`` y su versión es ``0.7.4``. Luego liberamos un nuevo elemento ``qiskit-ignis`` que pretendemos incluir también en el metapaquete. Entonces cuando agregamos el nuevo elemento al metapaquete, aumentamos la versión a ``0.8.0``.
fr_fr: Par exemple supposons que le meta-package suit deux éléments ``qiskit-aer``et ``qiskit-terra`` et que sa version est ``0.7.4``. Ensuite nous publions le nouvel élément ``qiskit-ignis`` que nous voulons aussi suivre dans le meta-package, alors nous passons la version du meta-package à ``0.8.0``.
pt_un: Neste exemplo, o meta-pacote está rastreando os dois elementos `` qiskit-aer`` e `` qiskit-terra``, na versão `` 0.7.4``. Então em seguida lançamos um novo elemento, o `` qiskit-ignis``, que também pretendemos incluir neste meta-pacote. Assim, quando adicionamos este novo elemento ao meta-pacote, incrementamos a versão para `` 0.8.0``.
ru_ru: Например, мета-пакет отслеживает 2 элемента ``qiskit-aer`` и ``qiskit-terra`` и его версия ``0.7.4``. Затем выпускается новый элемент ``qiskit-ignis``, который будет включен в мета-пакет. Тогда, при добавлении нового элемента в мета-пакет, его версия повышается до ``0.8.0``.

source: When any Qiskit element that is being already tracked by the meta-package releases a patch version to fix bugs in a release, we need also bump the requirement in the ``setup.py`` and then increase the patch version of the meta-package.
es_un: Cuando cualquier elemento de Qiskit que ya está siendo rastreado por el metapaquete lanza una versión de parche para corregir errores en una liberación, también necesitamos aumentar el requerimiento en ``setup.py`` y luego aumentar la versión del parche del metapaquete.
fr_fr: Lorsqu'un élément de Qiskit déjà suivi dans le méta-package fait l'objet d'une modification pour corriger des problèmes, alors les exigences doivent apparaître dans le fichier setup.py et cela va incrémenter la version du méta-package.
pt_un: Quando qualquer elemento Qiskit, que já está sendo rastreado pelo meta-pacote, lança uma versão de patch para corrigir bugs em uma versão, nós também precisamos eliminar o requisito no ``setup.py`` e, em seguida, incrementar a versão de patch do meta-pacote.
ru_ru: Когда для любого элемента Qiskit, который уже находится в метапакете, выпускается патч с целью исправления ошибок, выполняется требование из ``setup.py``, а затем увеличивается версия патча мета-пакета.

source: For example, if the meta-package is tracking 3 elements ``qiskit-terra==0.8.1``, ``qiskit-aer==0.2.1``, and ``qiskit-ignis==0.1.4`` with the current version ``0.9.6``. When qiskit-terra release a new patch version to fix a bug ``0.8.2`` the meta-package will also need to increase its patch version and release, becoming ``0.9.7``.
es_un: Por ejemplo, si el metapaquete está rastreando los 3 elementos ``qiskit-terra==0.8.1``, ``qiskit-aer==0.2.1``, y ``qiskit-ignis==0.1.4`` con la versión actual ``0.9.6``. Cuando qiskit-terra lance una nueva versión de parche para corregir un error ``0.8.2``, el metapaquete también deberá aumentar su versión de parche y su liberación, convirtiéndose en ``0.9.7``.
fr_fr: Par exemple, supposons que le méta-package suit 3 éléments ``qiskit-terra==0.8.1``, ``qiskit-aer==0.2.1``, et ``qiskit-ignis==0.1.4`` à la version ``0.9.6``. Lorsque qu'une correction sera apportée à qiskit-terra pour corriger un problème, ce dernier passera à la version ``0.8.2``, le méta-package sera également incrémenté et son niveau deviendra ``0.9.7``.
pt_un: Por exemplo, um meta-pacote está rastreando três elementos: `` qiskit-terra == 0.8.1``, `` qiskit-aer == 0.2.1``, e `` qiskit-ignis == 0.1.4 ``, na versão atual `` 0.9.6``,. Quando o qiskit-terra lançar uma nova versão de patch para corrigir o bug `` 0.8.2``, o meta-pacote também precisará incrementar a sua versão de patch e de release, subindo para `` 0.9.7``.
ru_ru: Например, если метапакет содержит 3 элемента: ``qiskit-terra==0.8.1``, ``qiskit-aer==0.2.1``, и ``qiskit-ignis==0.1.4`` с текущей версией ``0.9.6``. То, когда qiskit-terra выпускает новую версию патча ``0.8.2``, чтобы исправить ошибку, метапакет также повышает версию патча при релизе, ставясь ``0.9.7``.

source: Besides when adding a new element to the meta-package, the minor version of the meta-package should also be increased anytime a minor version is increased in a tracked element.
es_un: Además, cuando se agrega un nuevo elemento al metapaquete, la versión menor del metapaquete también debe aumentarse cada vez que se aumente una versión menor en un elemento rastreado.
fr_fr: De plus lorsqu'un nouvel élément est ajouté au meta-package , la version mineure du méta-paquage devrait également être augmentée chaque fois qu'une version mineure est augmentée parmi les éléments suivis.
pt_un: Além disso, ao adicionar um novo elemento ao meta-pacote, a sua versão secundária também deve ser incrementada toda vez que uma versão secundária aumenta em um elemento rastreado.
ru_ru: Кроме когда добавляется новый элемент в метапакет, минорная версия повышается всякий раз, когда повышается минорная версия у входящего в состав метапакета элемента.
