Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: You can build a local copy of the documentation from your local clone of the `Qiskit/qiskit` repository as follows:
bn_bn: আপনি আপনার স্থানীয় `Qiskit/qiskit` ক্লোন রিপোজিটরিটি থেকে এভাবে একটি স্থানীয় বিবরণী (ডকুমেন্টেশন) তৈরি করতে পারেনঃ
de_de: Sie können eine lokale Kopie der Dokumentation aus Ihrem lokalen Klon des `Qiskit/qiskit`-Repository wie folgt erstellen:
el_gr: Μπορείτε να δομήσετε ένα τοπικό αντίγραφο της τεκμηρίωσης από τον τοπικό κλώνο του αποθετηρίου `Qiskit/qiskit` όπως ακολουθεί:
es_mx: Puedes construir una copia local de la documentación desde tu clonación local del repositorio `Qiskit/qiskit` de la siguiente manera:
es_un: Puedes construir una copia local de la documentación desde tu clonación local del repositorio `Qiskit/qiskit` de la siguiente manera:
fr_fr: Voici comment produire une version locale de la documentation dans votre clone du répertoire `Qiskit/qiskit`:
id_id: Anda dapat membuat salinan lokal dokumentasi ini dari kloningan lokal milik Anda untuk repositori `Qiskit/qiskit` sebagai berikut:
it_it: E' possibile creare una copia locale della documentazione dal proprio clone locale della repository `Qiskit/qiskit` nel modo seguente:
pt_un: Você pode fazer o build de uma cópia local da documentação a partir do seu clone local do repositório `Qiskit/qiskit` da seguinte forma:
ru_ru: Вы можете создать локальную копию документации из своей копии репозитория `Qiskit/qiskit` следующим образом:
sw_ke: Unaweza kujenga nakala ya kienyeji ya nyaraka kutoka kwa pacha lako kienyeji la repo ya `Qiskit/qiskit` kama ifuatavyo:
ta_in: `Qiskit/qiskit` களஞ்சியத்தின் உங்கள் உள்ளூர் குளோனிலிருந்து ஆவணங்களின் உள்ளூர் நகலை பின்வருமாறு உருவாக்கலாம்:
tr_tr: `Qiskit/qiskit` havuzunda yer alan, yerel kopyanızdan belgelerin yerel bir kopyasını aşağıdaki gibi oluşturabilirsiniz:
vi_vn: Bạn có thể dựng một bản tài liệu của bạn từ bản clone của `Qiskit/qiskit` trong máy của bạn theo huống dẫn dưới đây:

source: Clone the Qiskit repository.
bn_bn: Qiskit রিপোজিটরিটির ক্লোন বা প্রতিলিপি করুন।
de_de: Klonen Sie das Qiskit-Repository.
el_gr: Κλωνοποιήστε το αποθετήριο του Qiskit.
es_mx: Clonar el repositorio de Qiskit.
es_un: Clonar el repositorio de Qiskit.
fr_fr: Clonez le dépôt Qiskit.
id_id: Kloning repositori Qiskit.
it_it: Clonare la repository di Qiskit.
pt_un: Clone o repositório Qiskit.
ru_ru: Склонируйте репозиторий Qiskit.
sw_ke: Tengeneza pacha wa repo ya Qiskit.
ta_in: Qiskit களஞ்சியத்தை குளோன் செய்யவும்.
tr_tr: Qiskit deposunu klonla.
vi_vn: Nhân bản lại Qiskit.

source: Cloning the repository creates a local folder called ``qiskit``.
bn_bn: রিপোজিটিরিটির ক্লোন বা প্রতিলিপি করায় ``qiskit`` নামে একটি স্থানীয় ডিরেক্টরি তৈরি হবে।
de_de: Klonen des Repository erzeugt einen lokalen Ordner namens ``qiskit``.
el_gr: Η κλωνοποίηση του αποθετήριου δημιουργεί ένα τοπικό φάκελο με το όνομα ``qiskit``.
es_mx: La clonación crea un folder local llamado ``qiskit``.
es_un: La clonación crea un folder local llamado ``qiskit``.
fr_fr: Un répertoire local appelé ``qiskit`` est créé automatiquement.
id_id: Mengkloning repositori akan membuat sebuah folder lokal bernama ``qiskit``.
it_it: La clonazione della repository crea una cartella locale denominata ``qiskit``.
pt_un: Clonar o repositório cria uma pasta local chamada ``qiskit``.
ru_ru: Клонирование репозитория создает локальную папку с названием``qiskit``.
sw_ke: Kutengeneza pacha wa repo huunda folda ya kienyeji inayoitwa ``qiskit``.
ta_in: ``qiskit`` களஞ்சியத்தை குளோன் செய்வது உள்ளூர் கோப்புறையை உருவாக்குகிறது.
tr_tr: Depoyu klonlamak, ``qiskit`` adında yerel bir dosya oluşturur.
vi_vn: Nhân bản repo vào trong một thư mục tên ``qiskit``.

source: Build the documentation by navigating to your local clone of `Qiskit/qiskit` and running the following command in a terminal window.
bn_bn: `Qiskit/qiskit` এর স্থানীয় ক্লোন বা প্রতিলিপিতে নেভিগেশন এবং নিচের নির্দেশনাগুলি একটি টার্মিনাল উইন্ডোতে রান করার মাধ্যমে বিবরণীটি (ডকুমেন্টেশন) তৈরি করুন।
de_de: Erstellen Sie die Dokumentation, indem Sie zu Ihrem lokalen Klon `Qiskit/qiskit` navigieren und den folgenden Befehl in einem Terminal-Fenster ausführen.
el_gr: Φτιάξτε την τεκμηρίωση μεταβαίνοντας στον τοπικό σας κλώνο του `Qiskit/qiskit` και εκτελώντας την ακόλουθη εντολή σε ένα παράθυρο τερματικού.
es_mx: Genere la documentación navegando a tu copia local de `Qiskit/qiskit` y ejecutando el siguiente comando en una ventana de terminal.
es_un: Genera la documentación navegando a tu copia local de `Qiskit/qiskit` y ejecutando el siguiente comando en una ventana de terminal.
fr_fr: Produisez la documentation associée à votre clone local de `Qiskit/qiskit` en exécutant la commande suivante dans une fenêtre Terminal.
id_id: Bangun dokumentasi dengan menuju ke klon lokal `Qiskit/qiskit` Anda dan jalankan perintah berikut dalam sebuah jendela terminal.
it_it: La documentazione si costruisce ponendosi nella cartella locale di `Qiskit/qiskit` e lanciando il seguente comando dal terminale.
pt_un: Faça o build da documentação navegando até seu clone local `Qiskit/qiskit` e executando o seguinte comando em uma janela do terminal.
ru_ru: Создайте документацию, открыв Вашу локальную копию `Qiskit/qiskit` в терминале и выполнив следующую команду.
sw_ke: Jenga nyaraka kwa kwenda kwa pacha lako la kienyeji la `Qiskit/qiskit` na kutekeleza amri ifuatayo kwenye terminal.
ta_in: `Qiskit/qiskit` யின் உள்ளார்ந்த குழுவுக்கு வழிபாடு மற்றும் முனைய சாளரத்தில் கீழ்காணும் கட்டளையை இயக்குகிறது.
tr_tr: `Qiskit/qiskit` yerel kopyanıza giderek dokümantasyonu oluşturun ve terminal penceresinde aşağıdaki komutu çalıştırıp oluşturun.
vi_vn: Dựng tài liệu của bạn bằng cách vào bản `Qiskit/qiskit` đã nhân bản về máy bạn và chạy dòng lệnh dưới đây trong cửa sổ terminal.

source: If you do not already have the `tox <https://tox.readthedocs.io/en/latest/>`_ command installed, install it by running:
bn_bn: যদি আপনি ইতিমধ্যে `tox <https://tox.readthedocs.io/en/latest/>`_ নির্দেশনাটি ইন্সটল না করে থাকেন, তবে প্রথমে নিচের নির্দেশনাটি রান করুনঃ
de_de: Wenn Sie das Programm 'tox <https://tox.readthedocs.io/en/latest/>` _ nicht bereits installiert haben, installieren Sie es, indem Sie Folgendes ausführen:
el_gr: Αν δεν έχετε ήδη εγκαταστήσει την εντολή 'tox <https://tox.readthedocs.io/en/latest/>', εγκαταστήστε την εκτελώντας:
es_mx: Si todavía no tienes instalado el comando `tox <https://tox.readthedocs.io/en/latest/>`_, instálalo ejecutando:
es_un: Si todavía no tienes instalado el comando `tox <https://tox.readthedocs.io/en/latest/>`_, instálalo ejecutando:
fr_fr: Si la commande `tox <https://tox.readthedocs.io/en/latest/>`_ n'est pas encore installée, exécutez :
id_id: Jika Anda belum menginstal perintah `tox <https://tox.readthedocs.io/en/latest/>`_, instal dengan menjalankan:
it_it: Se non è stato già installato il comando `tox <https://tox.readthedocs.io/en/latest/>`_, installarlo eseguendo:
pt_un: Se você ainda não tiver o comando `tox <https://tox.readthedocs.io/en/latest/>`_ instalado, instale-o executando:
ru_ru: Если у Вас еще не установлен инструмент для выполнения команды `tox <https://tox.readthedocs.io/en/latest/>`_, установите его, выполнив команду:
sw_ke: Ikiwa bado huna amri la `tox <https://tox.readthedocs.io/en/latest/>`_ lililosakinishwa, sakinisha kwa kuendesha:
ta_in: நீங்கள் ஏற்கெனவே `tox <https://tox.readthedocs.io/en/latest/>`_ கட்டளை நிறுவப்பட்டிருந்தால், இயங்கும் மூலம் நிறுவவும்:
tr_tr: Eğer hali hazırda `tox <https://tox.readthedocs.io/en/latest/>`_ komutu yüklenmemişse, şununla kurulumu yapın:
vi_vn: Nếu bạn chưa có câu lệnh `tox <https://tox.readthedocs.io/en/latest/>`_ cài đặt, bạn có thể cài bằng cách chạy câu lệnh sau đây:

source: As you make changes to your local RST files, you can update your HTML files by navigating to `/doc/` and running the following in a terminal window:
bn_bn: যেহেতু আপনি স্থানীয় RST ফাইলগুলি পরিবর্তন করছেন, আপনার HTML ফাইলগুলি `/doc/` এ নেভিগেশনের পর নিচের নির্দেশনাগুলো একটি টার্মিনাল উইন্ডোতে রান করে হাল নাগাদ করতে পারবেনঃ
de_de: Wenn Sie Änderungen an den lokalen RST-Dateien vornehmen, können Sie Ihre HTML-Dateien aktualisieren, indem Sie in einem Terminal-Fenster nach `/doc/` navigieren und die folgenden Schritte ausführen:
el_gr: Καθώς κάνετε αλλαγές στα τοπικά σας αρχεία RST, μπορείτε να ενημερώσετε τα αρχεία HTML σας μεταβαίνοντας σε `/doc/` και εκτελώντας τα παρακάτω σε ένα παράθυρο τερματικού:
es_mx: Mientras haces cambios a tus archivos RST locales, puedes actualizar tus archivos HTML navegando a `/doc/` y ejecutando lo siguiente en una terminal:
es_un: Mientras haces cambios a tus archivos RST locales, puedes actualizar tus archivos HTML navegando a `/doc/` y ejecutando lo siguiente en una terminal:
fr_fr: En même temps que vous modifiez vos fichiers RST locaux, Vous pouvez mettre à jour les fichiers HTML correspondant en allant dans le répertoire `/doc/` et en exécutant la commande :
id_id: Saat Anda membuat perubahan pada file RST lokal Anda, Anda dapat memperbarui file HTML Anda dengan menuju ke `/doc/` dan menjalankan dalam jendela terminal seperti berikut:
it_it: Man mano che si apportano modifiche ai file RST locali, è possibile aggiornare i file HTML navigando su `/doc/` ed eseguendo il seguente comando:
pt_un: À medida que você faz alterações nos seus arquivos RST locais você pode atualizar seus arquivos HTML navegando até `/doc/` e executando o seguinte comando em uma janela do terminal:
ru_ru: При внесении изменений в локальные файлы RST, Вы можете обновить Ваши HTML-файлы, перейдя в директорию `/doc/` и выполнив команду в терминале:
sw_ke: Unapofanya mabadiliko kwenye faili zako za RST, unaweza kusasisha faili zako za HTML kwa kuenda kwa `/doc/` na kutekeleza yafuatayo kwenye terminal:
ta_in: நீங்கள் உங்கள் உள்ளார்ந்த RST கோப்புகளுக்கு மாற்றங்களை செய்ய, `/doc/` க்குச் சென்று, பின்வருவனவற்றை முனைய சாளரத்தில் இயக்குவதன் மூலம் உங்கள் HTML கோப்புகளைப் புதுப்பிக்கலாம்:
tr_tr: Eğer yerel RST dosyalarınızda değişiklik yaparsanız, `/doc/` adresine giderek ve bir terminal penceresinde aşağıdakileri çalıştırarak HTML dosyalarınızı güncelleyebilirsiniz:
vi_vn: Cùng với việc bạn thay đổi tệp RST thì bạn cũng có thể cập nhật tệp HTML bằng cách điều hướng đến `/doc/` và chạy dòng lệnh dưới đây trong cửa sổ terminal:

source: This will build a styled, HTML version of your local documentation repository in the subdirectory `/docs/_build/html/`.
bn_bn: এর ফলে আপনার স্থানীয় বিবরণীর (ডকুমেন্টেশন) একটি গোছানো HTML সংস্করণ তৈরি হবে `/docs/_build/html/` সাবডিরেক্টরিতে।
de_de: Dies erzeugt eine formatierte HTML-Version des lokalen Dokumentations-Repository im Unterverzeichnis `/docs/_build/html`.
el_gr: Αυτό θα δημιουργήσει μια προσαρμοσμένη έκδοση HTML του τοπικού αποθετηρίου τεκμηρίωσης στον υποκατάλογο `/docs/_build/html/`.
es_mx: Esto construirá una nueva versión de HTML con estilos de tu documentación local en el subdirectorio `/docs/_build/html/`.
es_un: Esto construirá una nueva versión de HTML con estilos de tu documentación local en el subdirectorio `/docs/_build/html/`.
fr_fr: Les pages HTML ainsi produites sont automatiquement stockées dans le répertoire : `/docs/_build/html/`.
id_id: Ini akan membangun sebuah versi HTML dari repositori dokumentasi lokal Anda dalam subdirektori `/docs/_build/html/`.
it_it: In questo modo verrà generata una versione HTML stilizzata della propria documentazione locale nella sottodirectory `/docs/_build/html/`.
pt_un: Isto irá fazer o build de uma versão HTML estilizada do seu repositório de documentação local no subdiretório `/docs/_build/html/`.
ru_ru: Она создаст стилизованную HTML-версию Вашего локального репозитория документации в каталоге `/docs/_build/html/`.
sw_ke: Hii itaunda toleo la mtindo la HTML la repo lako la nyaraka za kienyeji kwenye kijifolda cha `/docs/_build/html/`.
ta_in: இது உங்கள் உள்ளூர் ஆவணக் களஞ்சியத்தின் பாணியிலான, HTML பதிப்பை `/docs/_build/html/` என்ற துணை அடைவில் உருவாக்கும்.
tr_tr: Bu işlem, `/docs/_build/html/` altdizininde yerel belge repository/deponuzun şekillendirilmiş bir HTML sürümünü oluşturacaktır.
vi_vn: Điều này sẽ dựng một phiên bản HTML của tài liệu của bạn ở trong thư mục con `/docs/_build/html/`.

source: Installing from Source
bn_bn: উৎস থেকে স্থাপন
de_de: Installieren aus Quelltext
el_gr: Εγκατάσταση από την πηγή
es_mx: Instalando con Código Fuente
es_un: Instalación a partir del Código Fuente
fr_fr: Installation à partir du code source
id_id: Memasang dari sumber
it_it: Installazione da codice sorgente
pt_un: Instalando da Fonte
ru_ru: Установка из исходного кода
sw_ke: Kusakinisha Kutoka Chanzo
ta_in: மூலத்திலிருந்து நிறுவப்படுகிறது
tr_tr: Kaynaktan Kurulum
vi_vn: Cài đặt từ nguồn

source: Installing the elements from source allows you to access the most recently updated version of Qiskit instead of using the version in the Python Package Index (PyPI) repository. This will give you the ability to inspect and extend the latest version of the Qiskit code more efficiently.
bn_bn: উত্স থেকে উপাদানগুলি ইনস্টল করলে আপনি Qiskit সর্বাধিক আপডেট হওয়া সংস্করণটি আপনি ব্যবহার করতে পারবেন Python Package Index (PyPI) রিপোসিটোরি থেকে ইনস্টল করার তুলনায়। এটি আপনাকে Qiskit কোডের সর্বশেষ সংস্করণটি আরও নিখুঁত ভাবে পরিদর্শন করার এবং প্রসারিত করার দক্ষতা দেবে।.
de_de: Die Elemente aus dem Quelltext zu installieren, ermöglicht es auf die aktuellste Version von Qiskit zuzugreifen anstatt der Version, welche im Python-Package-Index (PyPI) veröffentlicht ist. Damit hat man die Möglichkeit, sich effizienter die neueste Version von Qiskit zu betrachten und zu erweitern.
el_gr: Η εγκατάσταση των στοιχείων από την πηγή, σας επιτρέπει να αποκτήσετε πρόσβαση στην πιο πρόσφατη έκδοση του Qiskit αντί να χρησιμοποιήσετε την έκδοση στο αποθετήριο Python Package Index (PyPI). Αυτό θα σας δώσει τη δυνατότητα να επιθεωρήσετε και να επεκτείνετε την τελευταία έκδοση του κώδικα Qiskit πιο αποτελεσματικά.
es_mx: Instalando los elementos usando el código fuente te permite acceder a la última versión de Qiskit en lugar de la versión del repositorio de Python Package Index (PyPl). Esto te da la capacidad de inspeccionar y extender la última versión del código de Qiskit más eficientemente.
es_un: Instalar los elementos usando el código fuente te permite acceder a la última versión de Qiskit en lugar de la versión del repositorio de Python Package Index (PyPl). Esto te da la capacidad de inspeccionar y extender la última versión del código de Qiskit más eficientemente.
fr_fr: Installer des éléments depuis la source vous permet d'utiliser la version la plus à jour de Qiskit, plutôt que d'utiliser la version du dépôt de PyPI (Python Package Index). Ceci vous donnera la possibilité d'inspecter et d'étendre plus efficacement la dernière version du code Qiskit.
id_id: Menginstal elemen dari sumber memungkinkan Anda untuk mengakses versi Qiskit terbaru alih-alih menggunakan versi yang terdapat dalam repositori Python Package Index (PyPI). Ini akan memampukan Anda untuk memeriksa dan memperpanjang versi terkini dari kode Qiskit secara lebih efisien.
it_it: L'installazione degli elementi dalla sorgente consente di accedere alla versione più recente di Qiskit invece di utilizzare la versione presente nel repository Python Package Index (PyPI). In questo modo si avrà la possibilità di ispezionare ed estendere in modo più efficiente l'ultima versione del codice Qiskit.
pt_un: A instalação dos elementos do código fonte permite que você acesse a versão mais recente do Qiskit em vez de usar a versão do repositório Python Package Index (PyPI). Isso lhe dará a capacidade de inspecionar e estender a versão mais recente do código Qiskit de forma mais eficiente.
ru_ru: Установка элементов из исходного кода позволит Вам получить доступ к последней обновленной версии Qiskit вместо использования версии из репозитория Python Package Index (PyPI). Это даст Вам возможность более эффективно изучить и улучшить последнюю версию Qiskit кода.
sw_ke: Kusakinisha vipengee kutoka chanzo hukuruhusu kupata toleo lililosasishwa la hivi karibuni la Qiskit badala ya kutumia toleo lilio kwenye repo ya Python Package Index (PyPI). Hii itakupa uwezo wa kukagua na kupanua toleo la hivi karibuni la msimbo wa Qiskit kwa ufanisi zaidi.
ta_in: மூலத்திலிருந்து கூறுகளை நிறுவுவது பைதான் தொகுப்பு அட்டவணை (PyPI) களஞ்சியத்தில் பதிப்பைப் பயன்படுத்துவதற்குப் பதிலாக Qiskit ன் மிக சமீபத்தில் புதுப்பிக்கப்பட்ட பதிப்பை அணுக உங்களை அனுமதிக்கிறது. இது Qiskit குறியீட்டின் சமீபத்திய பதிப்பை மிகவும் திறமையாக ஆய்வு செய்து நீட்டிக்கும் திறனை உங்களுக்கு வழங்கும்.
tr_tr: Öğeleri kaynaktan yüklemek, Python Paket Dizini (PyPI) deposundaki sürümü kullanmak yerine Qiskit'in en son güncellenen sürümüne erişmenizi sağlar. Bu size Qiskit kodunun en son sürümünü daha verimli bir şekilde inceleme ve genişletme olanağı verecektir.
vi_vn: Cài đặt các phần tử từ nguồn cho phép bạn có thể truy cập phiên bản Qiskit mới nhất thay cho phiên bản ở trong kho Python Package Index (PyPI). Điều này sẽ giúp bạn có thể xem và mở rộng phiên bản mới nhất của Qiskit một cách hiệu quả hơn.
