Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: You should strive to document thoroughly all the public interfaces exposed using examples when necessary. For docstrings, `Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__ are used. This is parsed using the `napoleon sphinx extension <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__. The `napoleon documentation <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ contains a good example of how docstrings should be formatted.
bn_bn: প্রয়োজনানুসারে যথাযথভাবে সকল পাবলিক ইন্টারফেসগুলির বিবরণী তৈরি করতে হবে। `Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__ ব্যবহৃত হয় ডকস্ট্রিং তৈরি করার জন্য। `napoleon sphinx extension <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__ দ্বারা এটির প্রকারভেদ বা বিশ্লেষণ করা হয়। `napoleon documentation <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ তে ডকস্ট্রিংগুলো কীভাবে বিন্যাস করা উচিত তার একটি ভালো উদাহরণ দেয়া আছে।
de_de: Alle öffentlichen Schnittstellen sollten nach Möglichkeit mit Beispielen dokumentiert sein. Für Docstrings werden dabei `Google-Python-Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__ verwendet. Diese werden mit der `Napoleon Sphinx-Erweiterung <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__ verarbeitet. Die `Napoleon Dokumentation <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ enthält gute Beispiele, wie Docstrings formatiert werden sollten.
el_gr: Θα πρέπει να προσπαθήσετε να τεκμηριώσετε λεπτομερώς όλες τις δημόσιες διεπαφές που εκτίθενται χρησιμοποιώντας παραδείγματα, όταν είναι απαραίτητο. Για docstrings, χρησιμοποιούνται `Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__. Αυτό αναλύεται με την επέκταση `napoleon sphinx <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__. Το `napoleon documentation <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ περιέχει ένα καλό παράδειγμα για το πώς θα πρέπει να διαμορφώνονται οι docstrings.
es_mx: Debería esforzarse en documentar detalladamente todas las interfaces públicas expuestas usando ejemplos cuando sea necesario. Para docstrings se usa `Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__. Esto se analiza usando la extensión `napoleon sphinx<https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__. La documentación de `napoleon <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ contiene un buen ejemplo sobre cómo debe de ser el formato de la docstring.
es_un: Deberías esforzarte por documentar a fondo todas las interfaces públicas expuestas utilizando ejemplos cuando sea necesario. Para las cadenas de documentos, se utilizan `Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__. Esto se analiza utilizando la extensión `napoleon sphinx <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__. La `documentación de napoleon <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ contiene un buen ejemplo de cómo deben formatearse las cadenas de documentos.
fr_fr: Vous devez absolument documenter toutes les interfaces publiques, en utilisant des exemples si nécessaire. Pour les docstrings, sont utilisés les `Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__ Le parsing est réalisé par la `napoleon sphinx extension <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__. L`extension sphinx napoleon <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ contient de bons exemples de docstrings correctement formatés.
id_id: Anda harus berusaha untuk mendokumentasikan secara menyeluruh semua tampilan antarmuka publik yang terekspos menggunakan contoh ketika diperlukan. Untuk docstrings, `Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__ sudah digunakan. Hal ini diurai menggunakan ekstensi `napoleon sphinx <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__. `dokumentasi napoleon <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ memuat contoh yang benar tentang bagaimana docstrings harus diformat.
it_it: Bisogna sforzarsi di documentare accuratamente tutte le interfacce pubbliche esposte usando esempi laddove necessario. Per le docstring, viene usata la `Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__. Questo è interpretato usando `napoleon sphinx extension <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__. La `documentazione napoleon <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ contiene un buon esempio di come dovrebbero essere formattate le docstring.
pt_un: Você deve se esforçar para documentar minuciosamente todas as interfaces públicas expostas usando exemplos quando necessário. Para docstrings, o `Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__ é utilizado. Isto é analisado usando a extensão `napoleon sphinx <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__. A `documentação napoleon <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ contém um bom exemplo de como os docstrings devem ser formatados.
ru_ru: Необходимо тщательно документировать все публичные интерфейсы, приводя при необходимости примеры использования. Для документации используется стиль `Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__. Парсинг производится при помощи расширения `napoleon sphinx <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__. Документация `napoleon sphinx <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ содержит хорошие примеры того, как должна быть сформирована документация.
sw_ke: Unapaswa kujitahidi kuweka kumbukumbu kamili ya violesura vya umma vilivyo wazi ukitumia mifano ikihitajika. Kwa docstrings, `Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__ hutumiwa. Hii inachanganuliwa kutumia `napoleon sphinx extension <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__. `napoleon documentation <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ ina mfano mzuri wa jinsi docstrings zinapaswa kupangiliwa.
ta_in: தேவைப்படும்போது எடுத்துக்காட்டுகளைப் பயன்படுத்தி வெளிப்படும் அனைத்து பொது இடைமுகங்களையும் முழுமையாக ஆவணப்படுத்த நீங்கள் முயற்சிக்க வேண்டும். டாக்ஸ்ட்ரிங்குகளுக்கு, `Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__ பயன்படுத்தப்படுகின்றன. இது `napoleon sphinx extension <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__ ஐப் பயன்படுத்தி பாகுபடுத்தப்படுகிறது. `napoleon documentation <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ டாக்ஸ்ட்ரிங்ஸ் எவ்வாறு வடிவமைக்கப்பட வேண்டும் என்பதற்கு ஒரு சிறந்த எடுத்துக்காட்டு உள்ளது.
tr_tr: Gerektiğinde örnekler kullanarak ortaya çıkarılan bütün genel arayüzleri (public interfaces) tamamen belgelemek için çabalamalısınız. Doctringler için `Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__ kullanılmaktadır. Bu, `napoleon sphinx extension <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__ kullanılarak ayrılır. Napoleon dokümantasyonu `napoleon documentation <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ "Docstringler nasıl biçimlendirilmelidir?" in güzel bir örneğini içermektedir.
vi_vn: Bạn nên cố gắng ghi chú lại tất cả các giao diện được công khai thông qua việc sử dụng các ví dụ khi có thể. `Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__ sẽ được sử dụng đối với các docstring. Các cú pháp sẽ được phân tích sử dụng `napoleon sphinx extension <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__. `Napoleon documentation <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ chứa nhiều ví dụ về việc định dạng các docstring.

source: You can use any Sphinx directive or rst formatting in a docstring as it makes sense. For example, one common extension used is the ``jupyter-execute`` directive, which is used to execute a code block in Jupyter and display both the code and output. This is particularly useful for visualizations.
bn_bn: আপনি যে কোনও স্পিঙ্কস নির্দেশনা বা আর এস টি ফর্ম্যাটিংটি ডকাস্ট্রিংয়ে এটি বোধগম্য হিসাবে ব্যবহার করতে পারেন। উদাহরণস্বরূপ, ব্যবহৃত একটি সাধারণ এক্সটেনশন হ'ল ``jupyter-execute`` নির্দেশিকা, যা জুপিটারে একটি কোড ব্লক নির্বাহ করতে এবং কোড এবং আউটপুট উভয়ই প্রদর্শন করতে ব্যবহৃত হয়। এটি ভিজ্যুয়ালাইজেশনের জন্য বিশেষভাবে কার্যকর।.
de_de: Jede Sphinx-Direktive und jede rst-Formatierung kann in Docstrings verwendet werden, soweit dies sinnvoll ist. Eine oft genutzte Erweiterung ist z. B. die ``jupyter-execute`` Direktive. Mit ihr kann man einen Code-Block in Jupyter ausführen und sowohl den Code als auch dessen Ausgabe anzeigen. Das ist gerade für Visualisierungen sehr hilfreich.
es_mx: Puedes usar cualquier directiva de Sphinx o del formato rst en una docstring mientras sea razonable. Por ejemplo, una extensión comúnmente usada es la directiva ``jupyter-execute``, que se utiliza para ejecutar un bloque de código en Jupyter y mostrar tanto el código como su salida. Esto es particularmente útil para las visualizaciones.
es_un: Puedes usar cualquier directiva de Sphinx o del formato rst en una docstring mientras sea razonable. Por ejemplo, una extensión comúnmente usada es la directiva ``jupyter-execute``, que se utiliza para ejecutar un bloque de código en Jupyter y mostrar tanto el código como su salida. Esto es particularmente útil para las visualizaciones.
fr_fr: Vous pouvez utiliser toute directive Sphinx ou formatting rst si cela a du sens. Par exemple, une extension couramment utilisée est la directive ``jupyter-execute`` employée pour executer un bloc de code Jupyter et afficher à la fois le code et le résultat.
id_id: Anda dapat menggunakan direktif Sphinx atau format rst dalam sebuah docstring apa saja selama masuk akal. Sebagai contoh, sebuah ekstensi yang umum digunakan adalah direktif ``jupyter-execute``, yang digunakan untuk menjalankan sebuah blok kode di Jupyter dan menampilkan kode dan keluaran. Hal ini sangat berguna untuk visualisasi.
it_it: È possibile utilizzare qualsiasi direttiva Sphinx o formattazione rst in una docstring se essa ha senso. Ad esempio, un'estensione comunemente utilizzata è la direttiva ``jupyter-execute``, utilizzata per eseguire un blocco di codice in Jupyter e visualizzare sia il codice che l'output. Ciò è particolarmente utile per le visualizzazioni.
pt_un: Você pode usar qualquer diretiva Sphinx ou a formatação rst em uma docstring desde que faça sentido. Por exemplo, uma extensão comum utilizada é a directiva ``jupyter-execute``. que é usada para executar um bloco de código no Jupyter e exibir o código e a saída. Isso é particularmente útil para visualizações.
ru_ru: Вы можете использовать любую из директив Sphinx или rst форматирование в документации. Например, одно из распространенных расширений — ``jupyter-execute``, которое используется для выполнения блока кода в Jupyter и отображения кода, вместе с результатом его исполнения. Это особенно полезно для визуализации результатов.
sw_ke: Unaweza kutumia maagizo yoyote ya Sphinx au fomati ya rst katika docstring kama inavyofaa. Kwa mfano, kiendelezi kimoja cha kawaida kinachotumiwa ni agizo la ``jupyter-execute``, ambayo hutumiwa kutekeleza kipande cha msimbo katika Jupiter na kuonyesha msimbo na pato. Hii ni muhimu sanasana katika kutengenezea taswira.
ta_in: நீங்கள் எந்த Sphinx directive அல்லது rst வடிவமைப்பில் வடிவமைக்கலாம். உதாரணமாக, ஒரு பொதுவான விரிவாக்கம் பயன்படுத்தப்படும் ``jupyter-execute`` திசை, இது ஜூபெட்டில் ஒரு குறியீட்டு தொகுதியை இயக்க பயன்படுகிறது மற்றும் குறியீடு மற்றும் வெளியீட்டை இரண்டையும் காட்டுகிறது. இது குறிப்பாக விசாரிகளுக்காக பயன்படுகிறது.
tr_tr: Mantıklı olması için bir docstringde herhangi bir Sphinx direktifi ya da rst biçimlendirmesi kullanabilirsiniz. Örneğin, kullanılan yaygın bir uzantı, Jupyter'de bir kod blogu çalıştırıp hem kodu hem de çıktıyı ekrana yazdırmak için kullanılan ``jupyter-execute`` direktifidir. Bu özellikle görselleştirme için kullanışlıdır.
vi_vn: Bạn có thể sử dụng Sphinx hoặc định dạng rst ở trong một docstring nếu nó nghĩa. Ví dụ, một tiện ích mở rộng khá phố biến có tên là ``jupyter-execute``. Nó được sử dụng để thực thi các khối code ở trong Jupyter và hiện thị cả phần code lẫn đầu ra. Điều này sẽ đặc biệt hữu dụng trong việc trực quan hóa.

source: Documentation Integration
bn_bn: বিবরণী (ডকুমেন্টেশন) সংযোজন
de_de: Integration der Dokumentation
el_gr: Ενσωμάτωση Τεκμηρίωσης
es_mx: Integración de la Documentación
es_un: Integración de la Documentación
fr_fr: Intégrer la documentation
id_id: Integrasi dokumentasi
it_it: Integrazione della Documentazione
pt_un: Integração da Documentação
ru_ru: Интеграция документации
sw_ke: Ujumuishaji wa Nyaraka
ta_in: ஆவண ஒருங்கிணைப்பு
tr_tr: Dokümantasyon Entegrasyonu
vi_vn: Tài liệu tích hợp

source: During the build process, the contents of each element's ``docs/apidocs/`` are recursively copied into a shared copy of ``doc/apidocs/`` in the meta-package repository along with all the other elements. This means that what is in the root of docs/apidocs on each element at a release will end up on the root of https://qiskit.org/documentation/apidoc/.
bn_bn: সব উপাদানগুলোর ``docs/apidocs/`` গঠনের সময় মেটা প্যাকেজ রিপোজিটরিতে অন্য সব উপাদানের সাথে বারবার প্রতিলিপি তৈরি হয়। অর্থাৎ docs/apidocs এর রুট বা মূলে যে সংস্করণটি আছে তা https://qiskit.org/documentation/apidoc/ এর রুট বা মূলে সংযোজিত হবে।
de_de: Während des Build-Prozesses werden die Inhalte aus ``docs/apidocs/`` aller Module rekursiv in eine Kopie von ``doc/apidocs/`` im Meta-Paket-Repository kopiert, inklusive aller anderen Elemente. Das bedeutet, dass was direkt unter docs/apidocs eines Elements liegt, bei einem Release auch direkt unter https://qiskit.org/documentation/apidoc/ liegt.
el_gr: Κατά τη διάρκεια της διαδικασίας κατασκευής, τα περιεχόμενα του ``docs/apidocs/`` του κάθε στοιχείου αντιγράφονται αναδρομικά σε ένα κοινόχρηστο αντίγραφο του ``doc/apidocs/`` στο αποθετήριο μετα-πακέτου μαζί με όλα τα άλλα στοιχεία. Αυτό σημαίνει ότι αυτό που βρίσκεται στη ρίζα των docs/apidocs σε κάθε στοιχείο σε μια έκδοση θα καταλήξει στη ρίζα του https://qiskit.org/documentation/apidoc/.
es_mx: Durante el proceso de generación, los contenidos de cada elemento de ``docs/apidocs/`` son recursivamente duplicados en una copia compartida de ``doc/apidocs/`` en el repositorio del meta paquete junto con todos los otros elementos. Esto significa que lo que haya en esta raíz docs/apidocs de cada elemento en una versión acabará estando en la raíz de https://qiskit.org/documentation/apidoc/.
es_un: Durante el proceso de generación, los contenidos de cada elemento de ``docs/apidocs/`` son recursivamente duplicados en una copia compartida de ``doc/apidocs/`` en el repositorio del meta paquete junto con todos los otros elementos. Esto significa que lo que haya en esta raíz docs/apidocs de cada elemento en una versión acabará estando en la raíz de https://qiskit.org/documentation/apidoc/.
fr_fr: Pendant le processus de build, le contenu de ``docs/apidocs/`` est copié dans une version partagée de ``doc/apidocs/`` dans le répertoire du meta-package, en même temps que tous les autres éléments. Le contenu intégral de docs/apidocs se retrouvera donc à la racine de https://qiskit.org/documentation/apidoc/.
id_id: Selama proses pembuatan rangka (build), isi masing-masing elemen ``docs/apidocs/`` secara rekursif disalin ke dalam sebuah salinan bersama dari ``doc/apidocs/`` dalam repositori meta-paket bersama dengan semua elemen lainnya. Hal ini berarti apa yang berada dalam akar docs/apidocs masing-masing elemen pada sebuah keluaran akan berakhir pada akar dari https://qiskit.org/documentation/apidoc/.
it_it: Durante il processo di build, il contenuto di ciascun elemento ``docs/apidocs/`` è copiato ricorsivamente in una copia condivisa di ``doc/apidocs/`` nel repository dei meta-package insieme a tutti gli altri elementi. Ciò significa che il contenuto della cartella docs/apidocs finirà nella root di https://qiskit.org/documentation/apidoc/.
pt_un: Durante o processo de construção, o conteúdo de ``docs/apidocs/`` de cada elemento são recursivamente copiados em uma cópia compartilhada de ``doc/apidocs/`` no repositório meta-package, juntamente com todos os outros elementos. Isso significa que o que estiver na raiz de docs/apidocs em cada elemento em um lançamento terminará na raiz de https://qiskit.org/documentation/apidoc/.
ru_ru: В процессе сборки, содержимое каждого элемента в ``docs/apidocs/`` рекурсивно копируется в общедоступную копию ``doc/apidocs/`` в репозиторий мета-пакетов вместе со всеми остальными элементами. Это означает, что все, что находится в корне docs/apidocs каждого элемента в релизе будет в корне https://qiskit.org/documentation/apidoc/.
sw_ke: Wakati wa mchakato wa kujenga, yaliyomo katika kila sehemu ya ``docs/apidocs/`` yananakiliwa mara kwa mara kwenye nakala ya pamoja ya ``doc/apidocs/`` katika repo ya kifurushi-meta pamoja na visehemu vingine vyote. Hii inamaanicha kuwa kile kilicho kwenye mzizi wa docs/apidocs katika kila kipengee wakati wa kutolewa kitaishia kwenye mzizi wa https://qiskit.org/documentation/apidoc/.
ta_in: உருவாக்க செயல்பாட்டின் போது, ஒவ்வொரு உறுப்புகளின் ``docs/apidocs/`` உள்ளடக்கங்கள் மெட்டா-தொகுப்பு களஞ்சியத்தில் உள்ள மற்ற அனைத்து உறுப்புகளுடன் ``doc/apidocs/`` இன் பகிரப்பட்ட நகலில் மீண்டும் மீண்டும் நகலெடுக்கப்படுகின்றன. இதன் பொருள், ஒரு வெளியீட்டில் ஒவ்வொரு உறுப்புக்கும் docs /apidocs மூலத்தில் உள்ளவை https://qiskit.org/documentation/apidoc/ இன் மூலத்தில் முடிவடையும்.
tr_tr: İnşa sürecisi boyunca, her elementin içeriği ``docs/apidocs/`` tekrarlı bir şekilde diğer tüm elementlerle birlikte meta-paket reposundaki ``doc/apidocs/`` un paylaşılan bir kopyasına kopyalanır. Bu bir sürümdeki her elementte docs/apidocs un kökünde bulunanların https://qiskit.org/documentation/apidoc/ kökünde sonlanacağı anlamına gelir.
vi_vn: Trong quá trình dựng, nội dung của mỗi thành phần ``docs/apidocs/`` sẽ liên tục được sao chép vào một bản sao chép chung của ``doc/apidocs/`` ở trong repo meta-package với các thành phần khác. Điều này có nghĩa là thành phần gốc ở trong docs/apidocs của mỗi bản phát hành của mỗi thành phần sẽ có mặt ở trong https://qiskit.org/documentation/apidoc/.

source: Translating Documentation
bn_bn: ডকুমেন্টেশন অনুবাদ
de_de: Übersetzen der Dokumentation
el_gr: Μεταφράζοντας την τεκμηρίωση
es_mx: Traduciendo la Documentación
es_un: Traducir la Documentación
fr_fr: Traduction de la documentation
id_id: Menerjemahkan Dokumentasi
it_it: Tradurre la Documentazione
pt_un: Traduzindo a Documentação
ru_ru: Перевод документации
sw_ke: Kutafsiri Nyaraka
ta_in: ஆவணங்களை மொழிபெயர்த்தல்
tr_tr: Belgelerin Çevrilmesi
vi_vn: Dịch tài liệu
