Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: If you make a change to an element, make sure you update the associated *docstrings* and parts of the documentation under ``docs/apidocs`` in the corresponding repo. To locally build the element-specific documentation, run ``tox -edocs`` to compile and build the documentation locally and save the output to ``docs/_build/html``. Additionally, the Docs CI job on azure pipelines will run this and host a zip file of the output that you can download and view locally.
bn_bn: যদি আপনি কোনো উপাদানে পরিবর্তন আনেন, তবে এর সম্পর্কিত *docstrings* এবং সংশ্লিষ্ট রিপোজিটরির ``docs/apidocs`` এর অধীনস্থ বিবরণীটি (ডকুমেন্টেশন) যাতে হালনাগাদ করা থাকে তা নিশ্চিত করুন। স্থানীয়ভাবে নির্দিষ্ট উপাদানের বিবরণীটি (ডকুমেন্টেশন) গঠন করতে ``tox -edocs`` কার্যকর বা রান করুন এবং আউটপুটটি ``docs/_build/html`` এ সংরক্ষণ করুন। অধিকন্তু, অ্যাযিউর পাইপলাইনের Docs CI এটি কার্যকর করবে এবং আউটপুটের একটি যিপ ফাইল সংরক্ষণ করবে যেটি আপনি পরবর্তীতে ডাউনলোড এবং স্থানীয়ভাবে দেখতে পারবেন।
de_de: Bei Änderungen an einem Element sollte man stets die zugehörigen *Docstrings* und die Dokumentation unter ``docs/apidocs`` im Repository des jeweiligen Elements entsprechend aktualisieren. Um die Dokumentation eines Elements lokal zu generieren, führt man ``tox -edocs`` aus, um die Dokumentation zu kompilieren und die Ausgabe in ``docs/_build/html`` zu speichern. Dies führt auch der Docs-CI-Job auf Azure-Pipelines aus und stellt ein Zip-Archiv mit der Ausgabe zur Verfügung, welches man herunterladen und lokal ansehen kann.
el_gr: Αν κάνετε μια αλλαγή σε ένα στοιχείο, βεβαιωθείτε ότι ενημερώνετε τα σχετιζόμενα * docstrings * και τα τμήματα της τεκμηρίωσης στο ` ` docs/apidocs ` ` στην αντίστοιχη έκθεση. Για να φτιάξετε τοπικά την τεκμηρίωση, που αφορά το συγκεκριμένο στοιχείο, εκτελέστε ` ` tox -edocs ` ' για να μεταγλωττίσετε και να κατασκευάσετε την τεκμηρίωση σε τοπικό επίπεδο και αποθηκεύστε την έξοδο σε ` ` docs/_build/html ` `. Επιπλέον, η εργασία Docs CI στα azure pipelines θα τρέξει αυτό και θα φιλοξενήσει ένα συμπιεσμένο zip αρχείο της εξόδου, το οποίο μπορείτε να κατεβάσετε και να δείτε τοπικά.
es_mx: Si modificas un elemento, asegurate de actualizar las *docstrings* asociadas al igual que las partes de la documentación ubicadas en el folder ``docs/apidocs`` del repositorio correspondiente. Para compilar localmente la documentación específica de un elemento, ejecuta ``tox -edocs``, esto compila localmente la documentación y guarda el resultado en ``docs/_build/html``. Además, la tarea Docs CI en el procesamiento segmentado de Azure ejecutará esto y generará un archivo zip con la salida, el cual puedes descargar y ver de manera local.
es_un: Si modificas un elemento, asegúrate de actualizar las *docstrings* asociadas al igual que las partes de la documentación ubicadas en el folder ``docs/apidocs`` del repositorio correspondiente. Para compilar localmente la documentación específica de un elemento, ejecuta ``tox -edocs``, para compilar localmente la documentación y guardar el resultado en ``docs/_build/html``. Además, el trabajo de Docs CI en azure pipelines ejecutará esto y alojará un archivo zip con la salida que puedes descargar y ver localmente.
fr_fr: Si vous modifiez un élément, prenez soin de mettre à jour les *docstrings* et la documentation associée dans le répertoire ``docs/apidocs``. Pour produire, localement la documentation, exécutez la commande ``tox -edocs`` pour compiler et construire la documentation et sauvegardez le résultat dans ``docs/_build/html``.
id_id: Jika Anda membuat perubahan pada sebuah elemen, pastikan Anda memperbarui *docstrings* yang terkait dan bagian-bagian dari dokumentasi pada ``docs/apidocs`` di repo yang sesuai. Untuk membangun secara lokal dokumentasi yang spesifik untuk setiap elemen, jalankan ``tox -edocs`` untuk mengkompilasi dan membangun dokumentasi secara lokal dan simpan keluaran ke ``docs/_build/html``. Selain itu, pekerjaan CI Docs pada azure pipelines akan menjalankan ini dan meng-host sebuah file zip dari keluaran yang dapat Anda unduh dan lihat secara lokal.
it_it: Se si effettua una modifica ad un elemento, assicurarsi di aggiornare le *docstrings* associate e le parti della documentazione sotto ``docs/apidocs`` nella repository corrispondente. Per costruire localmente la documentazione specifica dell'elemento, si esegua ``tox -edocs`` per compilare e costruire la documentazione localmente e salvare l'output in ``docs/_build/html``. In aggiunta, il comando eseguito dal job Docs CI sulla pipeline azure creerà un file zip dell'output che si potrà scaricare e visualizzare localmente.
pt_un: Se você fizer uma alteração para um elemento, certifique-se de atualizar as *docstrings* associadas e partes da documentação em ``docs/apidocs`` no repositório correspondente. Para build local da documentação específica dos elementos, execute ``tox -edocs`` para compilar e fazer o build da documentação localmente e salve o destino para ``docs/_build/html``. Adicionalmente, o trabalho Docs CI no azure pipelines será executado e hospedará um arquivo zip da saída que você poderá baixar e ver localmente.
ru_ru: При изменении элемента необходимо обновить связанную с ним *документацию* и ее части из раздела ``docs/apidocs`` в соответствующем репозитории. Для того, чтобы создать документацию локально, выполните команду ``tox -edocs``, которая создаст и скомпонует документацию локально, а затем сохранит результат в ``docs/_build/html``. Дополнительно Docs CI также запустит эту команду и сохранит zip-файл с сгенерированной документацией, который можно будет позже загрузить и просмотреть локально.
sw_ke: Ukifanya mabadiliko kwa kipengee, hakikisha unasasisha *docstrings* yake pamoja na sehemu za nyaraka zilizo chini ya ``docs/apidocs`` kwenye repo inayoafikiana. Ili kujenga nyaraka maalum za vipengele, tumia ``tox -edocs`` kukusanya na kujenga nyaraka kienyeji na kuhifadhi pato katika ``docs/_build/html``. Zaidi ya hayo, kazi ya Docs CI kwenye bomba za azure itaendesha hii na kuandaa faili ya zip ya pato ambalo unaweza kupakua na kutazama kienyenji.
ta_in: நீங்கள் ஒரு உறுப்பு க்கு ஒரு மாற்றத்தை செய்தால், தொடர்புடைய *docstrings* மற்றும் ஆவணத்தின் பகுதிகளை தொடர்புடைய ரெப்போவில் ``docs/apidocs`` இன் கீழ் புதுப்பிக்கிறீர்கள் என்பதை உறுதி செய்யவும். உறுப்பு-குறிப்பிட்ட ஆவணங்களை உள்நாட்டில் உருவாக்க, உள்நாட்டில் ஆவணமாக்கத்தை தொகுக்கமற்றும் உருவாக்க ``tox -edocs`` ஐ இயக்கவும் மற்றும் வெளியீட்டை ``docs/_build/html`` ஆக சேமிக்கவும். கூடுதலாக, அஸூர் பைப்லைன்களில் உள்ள டாக்ஸ் CI வேலை இதை இயக்கும் மற்றும் நீங்கள் உள்நாட்டில் பதிவிறக்கமற்றும் பார்க்க க்கூடிய வெளியீட்டின் ஜிப் கோப்பை ஹோஸ்ட் செய்யும்.
tr_tr: Eğer bir ögeye değişiklik yapmak istiyorsanız uyumlu repoda ``docs/apidocs`` altındaki dokümantasyonun parçalarını ve ilişkilendirilmiş *docstrings*i güncellediğinizden emin olun. Yerel olarak dokümantasyona özel öge oluşturmak, yerel olarak dokümantasyon inşa edip derlemek ve çıktıyı ``docs/_build/html`` a kaydetmek için ``tox -edocs`` u çalıştır. Ek olarak, Docs Cl işi azure pipelineları üzerinde bunu çalıştıracak ve yerel olarak yükleyip görüntüleyebileceğiniz çıktının zip dosyasını barındıracaktır.
vi_vn: Nếu bạn thay đổi một thành phần, hãy chắc chắn rằng bạn cập nhật các *docstrings* liên quan và các phần của tài liệu trong ``docs/apidocs`` trong các repo tương ứng. Để có thể dựng (build) một phần xác định nào đó trong tài liệu, chạy ``tox -edocs`` để biên dịch và dựng tài liệu cục bộ và lưu sản phẩm đầu ra tại ``docs/_build/html``. Thêm vào đó, Docs CI trên Azure pipelines sẽ chạy và lưu sản phẩm đầu ra và bạn có thể lưu trữ và xem cục bộ.

source: If you have an issue with the `combined documentation <https://qiskit.org/documentation/>`__ that is maintained in the `Qiskit/qiskit repo <https://github.com/Qiskit/qiskit>`__, you can open a `documentation issue <https://github.com/Qiskit/qiskit/issues/new/choose>`__ if you see doc bugs, have a new feature that needs to be documented, or think that material could be added to the existing docs.
bn_bn: `combined documentation <https://qiskit.org/documentation/>`__ যা কিনা `Qiskit/qiskit repo <https://github.com/Qiskit/qiskit>`__ রক্ষণাবেক্ষণ করে, এর সম্পর্কিত কোনো সমস্যার জন্য আপনি একটি `documentation issue<https://github.com/Qiskit/qiskit/issues/new/choose>`__ খুলতে পারেন, যদি আপনি বিবরণীতে ভুল দেখেন, নতুন কোনো ফিচারের বিবরণী তৈরি করতে চান অথবা বর্তমান বিবরণীতে নতুন কোনো তথ্য সংযোজন করতে চান।
de_de: Bei Fehlern, Wünschen oder Vorschlägen zur `Gesamtdokumentation <https://qiskit.org/documentation/>`__, welche im `Qiskit/qiskit Repository <https://github.com/Qiskit/qiskit>`__ verwaltet wird, öffnet man ein `documentation issue <https://github.com/Qiskit/qiskit/issues/new/choose>`__.
es_mx: Si tienes algún problema con la `documentación común <https://qiskit.org/documentation/>`__ que se encuentra en el `repositorio Qiskit/qiskit <https://github.com/Qiskit/qiskit>`__, puedes abrir un `documentation issue <https://github.com/Qiskit/qiskit/issues/new/choose>`__ si encuentras algún error, tienes alguna nueva funcionalidad por documentar o crees que se puede agregar material a los documentos existentes.
es_un: Si tienes algún problema con la `documentación integrada <https://qiskit.org/documentation/>`__ que se encuentra en el `repositorio Qiskit/qiskit <https://github.com/Qiskit/qiskit>`__, puedes abrir un `documentation issue <https://github.com/Qiskit/qiskit/issues/new/choose>`__ si encuentras algún error, tienes alguna nueva funcionalidad por documentar o crees que se puede agregar material a los documentos existentes.
fr_fr: Si vous avez un problème avec la `documentation <https://qiskit.org/documentation/>`__ qui se trouve dans le répertoire `Qiskit/qiskit <https://github.com/Qiskit/qiskit>`__,, vous pouvez ouvrir un ticket `documentation <https://github.com/Qiskit/qiskit/issues/new/choose>`__. Procédez ainsi si vous constatez une anomalie dans la doc, si vous souhaitez documenter une nouvelle fonctionnalité ou si vous estimez que de nouvelles informations doivent compléter la documentation existante.
id_id: Jika Anda memiliki masalah dengan `kombinasi dokumentasi <https://qiskit.org/documentation/>`__ yang dikelola di `Qiskit/qiskit repo <https://github.com/Qiskit/qiskit>`__, Anda dapat membuka `dokumentasi edisi <https://github.com/Qiskit/qiskit/issues/new/choose>`__ jika Anda melihat bug pada doc, atau menemukan fitur baru yang perlu didokumentasikan, atau berpikir bahwa materi bisa ditambahkan ke docs yang ada.
it_it: Se si ha una issue con la `documentazione combinata <https://qiskit.org/documentation/>`__ che è manutenuta nel `Qiskit/qiskit repo <https://github.com/Qiskit/qiskit>`__, è possibile aprire una `issue di documentazione <https://github.com/Qiskit/qiskit/issues/new/choose>`__ nel caso in cui si individuano bug di documentazione, se una nuova funzionalità deve essere documentata, o se si pensa che si possa aggiungere del materiale ai documenti esistenti.
pt_un: Se você encontrar um problema com a `documentação <https://qiskit.org/documentation/>`__ que é mantida no `repositório Qiskit/qiskit <https://github.com/Qiskit/qiskit>`__, você pode abrir uma `issue de documentação <https://github.com/Qiskit/qiskit/issues/new/choose>`__ se você encontrar bugs na documentação, se houver um novo recurso que precisa ser documentado, ou acredita que adições podem ser feitas à documentação existente.
ru_ru: Если у Вас есть проблема с `документацией <https://qiskit.org/documentation/>`__, которая поддерживается в `репозитории Qiskit/qiskit <https://github.com/Qiskit/qiskit>`__, то Вы можете открыть `задачу с типом Documentation <https://github.com/Qiskit/qiskit/issues/new/choose>`__. Например, Вы заметили баг, или у Вас есть новая функция, которую нужно задокументировать, или же у Вас есть материал, который можно добавить в существующие документы.
sw_ke: Ikiwa una suala na `nyaraka zilizojumuishwa <https://qiskit.org/documentation/>`__ ambazo zinatunzwa katika `repo ya Qiskit/qiskit <https://github.com/Qiskit/qiskit>`__, unaweza kufungua `suala la nyaraka <https://github.com/Qiskit/qiskit/issues/new/choose>`__ ukiona kasoro kwenye nyaraka, ukiwa na kipengele kipya kinachohitaji kunakiliwa au unafikiria kuwa kuna nyenzo zinaweza kuongezwa kwenye hati zilizopo.
ta_in: `Qiskit/qiskit repo <https://github.com/Qiskit/qiskit>`__ இல் பராமரிக்கப்படும் `combined documentation <https://qiskit.org/documentation/>`__ இல் சிக்கல் இருந்தால், நீங்கள் ஒரு `documentation issue <https://github.com/Qiskit/qiskit/issues/new/choose>`__ திறக்கலாம், ஆவணப் பிழைகள் இருந்தால், ஆவணமாக்கப்பட வேண்டிய ஒரு புதிய அம்சத்தை கொண்டிருக்க வேண்டும், அல்லது ஏற்கனவே உள்ள ஆவணங்களில் உள்ளடக்கத்தை சேர்க்க முடியும் என்று நீங்கள் நினைத்தால்.
tr_tr: Eğer `Qiskit/qiskit repo <https://github.com/Qiskit/qiskit>`__'de tutulan `combined documentation <https://qiskit.org/documentation/>`__ (birleştirilmiş dokümantasyon) ile bir sorununuz varsa, belge hataları görüyorsanız, belgelenmesi gereken yeni bir özellik varsa ya da bu materyalin var olan dosyalara eklenmesi gerektiğini düşünüyorsanız yeni bir dokümantasyon sorunu açabilirsiniz <https://github.com/Qiskit/qiskit/issues/new/choose>`__.
vi_vn: Nếu bạn có vấn đề với phần `combined documentation <https://qiskit.org/documentation/>`__, được lưu trữ tại `Qiskit/qiskit repo <https://github.com/Qiskit/qiskit>`__, hoặc nếu bạn thấy có vấn đề với tài liệu, có tính năng mới cần ghi chú lại hoặc nghĩ rằng có thể thêm vào tài liệu sẵn có bạn có thể mở một `documentation issue <https://github.com/Qiskit/qiskit/issues/new/choose>`__.

source: Good First Contributions
bn_bn: ভাল প্রথম অবদান (Good First Contributions)
de_de: Gute erste Beiträge
el_gr: Καλές αρχικές συνεισφορές
es_mx: Primeras Contribuciones Recomendadas
es_un: Primeras Contribuciones Recomendadas
fr_fr: Choisir ses premières contributions
id_id: Kontribusi pertama yang baik
it_it: Primi Validi Contributi
pt_un: Boas Primeiras Contribuições
ru_ru: Первый вклад
sw_ke: Michango Nzuri ya Kwanza
ta_in: நல்ல முதல் பங்களிப்புகள்
tr_tr: İlk Yararlı Katkılar
vi_vn: Đóng góp tốt lần đầu

source: If you would like to contribute to Qiskit, but aren't sure where to get started, the ``good first issue`` label on issues for a project highlights items appropriate for people new to the project. These are all issues that have been reviewed and tagged by contributors as something a new contributor should be able to work on. In other words, intimate familiarity with Qiskit is not a requirement to develop a fix for the issue.
bn_bn: আপনি যদি Qiskit এ অবদান রাখতে চান, তবে কোথা থেকে শুরু করবেন তা নিশ্চিত নন, সেক্ষেত্রে ``good first issue`` লেবেল করা প্রকল্পের ইস্যুগুলি নতুন পাঠকদের জন্যে উপযুক্ত। এই ইস্যুগুলি এমনভাবে পর্যালোচনা এবং ট্যাগ করা হয়েছে যাতে নতুন সদস্যরা সেগুলিতে কাজ করতে পারে। অন্য কথায়, আপনাকে ইস্যুটি ঠিক করার জন্যে Qiskit নিখুঁত ভাবে জানতে হবে না।
de_de: Wenn Sie einen Beitrag zu Qiskit leisten möchten, sich aber nicht sicher sind, womit Sie anfangen wollen, werden für Einsteiger geeignete Aufgaben durch die Kennzeichnung "good first issue" hervorgehoben. Diese Aufgaben wurden durch Mitwirkende danach geprüft und gekennzeichnet, ob ein Einsteiger in der Lage sein sollte, sie zu lösen. Mit anderen Worten: Detaillierte Kenntnisse von Qiskit sind keine Voraussetzung, um einen Fix für solche Problem zu entwickeln.
el_gr: Αν επιθυμείτε να συνεισφέρετε στο Qiskit, αλλά δεν είστε σίγουροι από που να ξεκινήσετε, η ετικέτα ``good first issue`` σε θέματα για ένα έργο αναδεικνύει κατάλληλα αντικείμενα για ανθρώπους νέους στο έργο. Όλα αυτά είναι θέματα, τα οποία έχουν αναθεωρηθεί και επισημανθεί από τους συνεισφέροντες ως κάτι πάνω στο οποίο ένας νέος συνεισφέρων θα πρέπει να μπορεί να δουλέψει. Με άλλα λόγια, η στενή εξοιξείωση με το Qiskit δεν είναι απαιτούμενη για να αναπτυχθεί κάποια επίλυση για το θέμα.
es_mx: Si quieres contribuir a Qiskit pero no estás seguro de cómo empezar a hacerlo, la etiqueta de ``good first issue``en la lista de problemas de un proyecto destaca aquellos problemas apropiados para quienes se inician en el proyecto. Otros contribuidores han revisado y marcados estos problemas como algo en lo que un nuevo contribuidor puede trabajar sin problemas. En otras palabras, no se requiere un conocimiento profundo de Qiskit para solucionar estos problemas.
es_un: Si quieres contribuir a Qiskit pero no estás seguro por dónde comenzar, la etiqueta ``good first issue``en la lista de problemas de un proyecto destaca aquellos problemas apropiados para quienes se inician en el proyecto. Otros contribuidores han revisado y marcados estos problemas como algo en lo que un nuevo contribuidor debería poder trabajar. En otras palabras, conocimiento profundo de Qiskit no es un requisito para desarrollar una solución para el problema.
fr_fr: Si vous souhaitez contribuer à Qiskit mais que vous ne savez pas par où commencer, le marquage (label) ``good first issue`` posé sur certains tickets, vous indique les sujets particulièrement appropriés aux nouveaux contributeurs. En d'autres termes, il n'est pas besoin d'être un spécialiste de Qiskit pour participer au développement du projet.
id_id: Jika Anda ingin berkontribusi pada Qiskit, namun tidak yakin di mana harus memulai, label ``good first issue`` pada isu untuk sebuah proyek menandakan isu-isu yang sesuai untuk kontributor baru. Ini adalah isu-isu yang telah ditinjau dan ditandai oleh para kontributor sebagai isu yang dapat diselesaikan kontributor baru. Dengan kata lain, pengetahuan mendalam mengenai Qiskit tidaklah diperlukan untuk menyelesaikan masalah tersebut.
it_it: Se si vuole contribuire a Qiskit, ma non si è sicuri di dove iniziare, l'etichetta "good first issue" sulle issue di un progetto mette in evidenza gli elementi appropriati per le persone nuove al progetto. Queste sono tutte issue che sono state esaminate ed etichettate dai collaboratori come qualcosa su cui un nuovo collaboratore dovrebbe essere in grado di lavorare. In altre parole, l'intima familiarità con Qiskit non è un requisito per sviluppare una soluzione per tali issue.
pt_un: Se você quer contribuir com o Qiskit, mas não sabe por onde começar, a label ``good first issue`` em issues para um projeto destaca itens adequados para pessoas novas no projeto. Todos estes são issues que foram revisados e marcados pelos contribuidores como algo que um novo colaborador pode trabalhar. Em outras palavras, familiaridade com Qiskit não é uma exigência para desenvolver uma correção para um problema.
ru_ru: Если вы хотите внести свой вклад в Qiskit, но не уверены, с чего начать, метка «good first issue» ставится на задачи, подходящие для новых людей на проекте. Эти задачи были рассмотрены и отмечены другими участниками как задачи, над которыми сможет работать новый участник. Другими словами, близкое знакомство с Qiskit не является необходимым условием для решения таких задач.
sw_ke: Ikiwa ungependa kuchangia katika Qiskit lakini hauna uhakika pale utakapoanzia, lebo ya ``good first issue`` katika masuala ya mradi huangazia vifaa vinavyowafaa watu wapya katika mradi huo. Haya ni maswala ambayo yamekaguliwa na kutambulishwa na wafadhili kama kitu ambacho mchangiaji mpya anaweza kufanyia kazi. Kwa maneno mengine, uzoevu na Qiskit sio hitaji la kutengeneza suluhisho kwa suala hilo.
ta_in: நீங்கள் Qiskit-ல் பங்களிக்க விரும்பினால், ஆனால் எங்கு தொடங்குவது என்று உறுதியாக தெரியவில்லை என்றால், ஒரு திட்டத்திற்கான சிக்கல்கள் குறித்த ``good first issue`` லேபிள் திட்டத்திற்கு புதிய நபர்களுக்கு பொருத்தமான உருப்படிகளை எடுத்துக்காட்டுகிறது. இவை அனைத்தும் ஒரு புதிய பங்களிப்பாளருக்கு வேலை செய்யக்கூடியதாக இருப்பதால் பங்களிப்பாளர்களால் மதிப்பாய்வு செய்யப்பட்டு குறிக்கப்பட்ட சிக்கல்கள். வேறு வார்த்தைகளில் கூறுவதானால், Qiskit உடனான நெருக்கமான பரிச்சயம் பிரச்சினைக்கு ஒரு தீர்வை உருவாக்குவதற்கான தேவை அல்ல.
tr_tr: Qiskit'e katkı sağlamak istiyorsanız fakat nereden başlayacağınıza emin değilseniz projeyle ilgili konulardaki ``good first issue`` (ilk yararlı konu) etiketi projeye yeni katılan kişiler için uygun ögeleri vurgular. Bunlar katkıda bulunanlar tarafından incelenmiş ve etiketlenmiş yeni katkı sağlayanın üzerine çalışabilir olması gereken bütün konulardır. Diğer kelimelerde, soruna uygun bir düzeltme geliştirmek için Qiskit ile samimi aşinalık gerekli değildir.
vi_vn: Nếu bạn muốn đóng góp cho Qiskit, nhưng không chắc bắt đầu tại đâu, bạn có thể tham khảo ``Đóng góp lần đầu?`` được ghi chú ở trong phần các điểm nổi bật của dự án nằm trong mục issues(những vấn đề), chúng được thiết kế phù hợp với những người mới đến với dự án. Chúng là tất cả những cấn vấn đề đã được đánh giá và gắn thẻ bới những ngườ đóng góp như một thứ mà người mới có thể làm việc cùng. Hoặc nói cách khác, quen thuộc với Qiskit không phải là một yêu cầu để phát triển những sửa đổi cho vấn đề.

source: Deprecation Policy
bn_bn: ডেপ্রিকেশন (অপসারণ) নীতি
el_gr: Πολιτική κατάργησης
es_mx: Política de Obsolesencia
es_un: Política de Obsolescencia
fr_fr: Politique de dépréciation
id_id: Kebijakan Deprekasi
it_it: Politica di deprecazione
pt_un: Política de Descontinuação
ru_ru: Политика устаревания
sw_ke: Sera ya Ukataa
ta_in: நீக்குதல் கொள்கை
tr_tr: Kullanım Dışı Bırakma Bildirimi
vi_vn: Chính sách về sự hết hạn
