Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: However, this only works for small self-contained patches from master. If you need to backport a subset of a larger commit (from a squashed PR, for example) from master, do this manually. In these cases, add::
bn_bn: যদিও, এটি শুধুমাত্র মাস্টার এর ছোট স্বনির্ভর (self-contained) প্যাচ এ কাজ করে। যদি আপনার মাস্টার থেকে একটি বড় কমিটের (উদাহরণস্বরূপ একটি সংকোচাত PR) উপসেট বাকপোর্ট করা প্রয়োজন হয়, তা নিজে হাতে করে নিন। এক্ষেত্রে নিম্নলিখিত কোডটি যোগ করুন::
de_de: Das funktioniert jedoch nur für kleine, in sich geschlossene Änderungen vom Master-Branch. Wenn man einen Teil eines größeren Commits (z. B. eines zusammengefassten Pull-Requests) vom Master rückportieren möchte, macht man dies manuell. In solchen Fällen fügt man dies hinzu:
es_mx: No obstante, esto solo funciona para pequeños parches autocontenidos en el master. Si necesita hacer backport de un subconjunto de un commit mayor (de un PR aplastado, por ejemplo) en el master, hágalo manualmente. En estos casos, añada::
es_un: Sin embargo, esto solo funciona para pequeños parches autónomos de master. Si necesitas exportar un subconjunto de un commit más grande (de un PR compactado, por ejemplo) de master, hazlo manualmente. En estos casos, agrega::
fr_fr: Bien entendu, cette méthode ne fonctionne que pour les patches simples issus du Master. Si vous devez retroporter (backport) un ensemble conséquent de modifications (commits), issues du Master, faite le manuellement. Dans ce cas, ajoutez ::
id_id: Namun, ini hanya bekerja untuk patch mandiri yang kecil dari master. Jika Anda perlu melakukan backport sebuah subset dari komit yang lebih besar (dari sebuah PR yang tertindih, misalnya) dari master, lakukan ini secara manual. Dalam kasus-kasus seperti ini, tambahkan::
it_it: Tuttavia, questo funziona solo per patch dal master piccole ed auto-contenute. Se serve fare backport dal master di una parte di una commit più grande (da una richiesta di pull squashed, ad esempio), va fatto manualmente. In questi casi va aggiunto::
pt_un: No entanto, isto só funciona para pequenos patches da master. Se você precisar enviar um subconjunto de um commit maior (de um PR, por exemplo) da master, faça isso manualmente. Nestes casos, adicione::
ru_ru: Однако это работает только для небольших патчей от master-ветки. Если Вам нужно выполнить обратное портирование нескольких более крупных коммитов (например, из PR со слитыми (squashed) коммитами) от master-ветки, сделайте это вручную. В этих случаях следует добавить:
sw_ke: Walakini, hii inafanya kazi tu kwa visasisho vidogo vinavyojitegemea kutoka master. Ukihitaji kurudisha nyuma seti ya mabadiliko makubwa (kutoka kwa PR iliyopondwa, kwa mfano) kutoka master, fanya hivi kwa mikono. Katika visa hivi, ongeza::
ta_in: இருப்பினும், இது மாஸ்டரிடமிருந்து சிறிய தன்னிறைவான பேட்ச்களுக்கு மட்டுமே வேலை செய்கிறது. மாஸ்டரிடமிருந்து ஒரு பெரிய கமிட்டின் துணைக்குழுவை (எடுத்துக்காட்டாக, ஸ்குவாஷ் செய்யப்பட்ட ஒரு PR ) மாஸ்டரிடமிருந்து இதை கைமுறையாக செய்யுங்கள். இந்த சந்தர்ப்பங்களில், :: ஐ சேர்க்கவும்.
tr_tr: Ancak, bu sadece master'ın kendi kendine yeten küçük yamaları için çalışır. Daha büyük değişikliğin bir alt kümesini (örneğin ezilmiş bir PR'dan) master'dan aktarmanız gerekiyorsa, bunu elle (manuel olarak) yapınız. Bu durumlarda şunu ekleyin::
vi_vn: Tuy nhiên, điều này chỉ phù hợp cho các bản vá nhỏ khép kín từ nhánh master. Nếu bạn cần backport một tập hợp con của một commit lớn hơn (ví dụ từ một PR bị dồn lại) từ nhánh master, hãy làm điều này thủ công. Trong những trường hợp này, thêm::

source: so that we can track the source of the change subset, even if a strict cherry-pick doesn\'t make sense.
bn_bn: যদিও কড়া বাছাইয়ের কোন মানে হয় না, আমরা উপসেতে পরিবর্তনের উৎস নজর রাখতে পারি।
de_de: um die Quelle der Änderungen nachvollziehen zu können - selbst wenn ein cherry-pick nicht sinnvoll wäre.
es_mx: de esta manera podemos rastrear el origen del subconjunto de cambios, incluso si un cherry-pick estricto no tiene sentido.
es_un: para que podamos rastrear la fuente del subconjunto de cambios, incluso si una selección puntual (cherry-pick) no tiene sentido.
fr_fr: pour conserver l'origine de la modification.
id_id: sehingga kita dapat melacak sumber dari subset perubahan, bahkan jika pemilihan yang ketat tidak masuk akal.
it_it: cosicchè è possibile tracciare la sorgente di quella parte di modifica, anche se un rigoroso cherry-pick non dà risultati utili.
pt_un: para que possamos rastrear a fonte do subconjunto da mudança, mesmo que uma rigorosa escolha a dedo não faça sentido.
ru_ru: так мы можем отслеживать источник изменений, даже если cherry-pick не даст приемлемых результатов.
sw_ke: ili tuweze kufuatilia chanzo cha mabadiliko, hata ikiwa cherry-pick kali haina maana.
ta_in: எனவே, கண்டிப்பான செர்ரி-தேர்வுக்கு \' அர்த்தமில்லை என்றாலும், மாற்றத்தின் துணைக்குழுவின் மூலத்தைக் கண்காணிக்க முடியும்.
tr_tr: böylece, sıkı bir cımbızlama mantıklı olmasa bile, değişiklik alt kümesinin kaynağını takip edebiliriz.
vi_vn: để chúng ta có thể theo dõi nguồn gốc của phần thay đổi, ngay cả khi một cherry-pick nghiêm ngặt không có ý nghĩa.

source: If the patch you're proposing will not cherry-pick cleanly, you can help by resolving the conflicts yourself and proposing the resulting patch. Please keep Conflicts lines in the commit message to help review of the stable patch.
bn_bn: যেই প্যাচটি আপনি প্রস্তাব করলেন সেটি বাছাই না হলে, আপনি নিজেই সমস্যা সমাধান করতে নিজেকে সাহায্য করতে পারেন এবং ফলাফলের প্যাচটি প্রস্তাব করতে পারেন। দয়াকরে সমস্যার লাইনগুলো কমিট মেসেজে রাখুন যাতে স্ট্যাবল প্যাচটি পর্যালোচনা করতে সাহায্য হয়।
de_de: Wenn ein Cherry-Pick des Patches, den man vorschlägt, nicht ohne Konflikte verläuft, kann man diese selbst beheben und dann den resultierenden Patch vorschlagen. Um die Prüfung des Stable-Branch zu vereinfachen, belässt man dabei die Conflicts-Zeilen in der Commit-Nachricht.
es_mx: Si el parche no está proponiendo un cherry-pick limpio, puede ayudar resolviendo los conflictos usted mismo y proponiendo un parche resultante. Mantenga las líneas de conflictos en el mensaje de confirmación para ayudar a revisar el parche estable.
es_un: Si el parche que estás proponiendo no se puede seleccionar puntualmente (cherry-pick) de manera limpia, puedes ayudar resolviendo los conflictos tu mismo y proponiendo el parche resultante. Mantén las líneas de Conflictos en el mensaje de confirmación (commit) para ayudar a revisar el parche estable.
fr_fr: Quoi qu'il en soit, toute modification dans être documentée dans le message de Commit. Cela facilitera la revue de code.
id_id: Jika patch yang anda ajukan tidak memilih yang sesuai secara bersih/keseluruhan, anda dapat membantu dengan menyelesaikan masalah anda sendiri dan mengajukan patch yang dihasilkan. Harap menjaga baris konflik pada pesan komit untuk membantu meninjau dari patch yang stabil.
it_it: Se sulla patch che si propone il cherry-pick non risulta pulito, si può dare supporto risolvendo i conflitti e proponendo la patch risultante. E' utile mantenere le linee relative al conflitto nel messaggio di commit in modo da aiutare durante la revisione della patch dello stable.
pt_un: Se a atualização que você está propondo não faz cherry-pick corretamente, você pode ajudar resolvendo os conflitos por conta própria e propondo a atualização resultante. Por favor, mantenha linhas de conflito na mensagem do commit para ajudar a rever a atualização estável.
ru_ru: Если предложенные Вами изменения не будут проходить cherry-pick автоматически, Вы можете помочь, разрешив конфликты самостоятельно и предложив результирующие изменения. Пожалуйста, оставляйте конфликтные строки в комментарии к коммиту, чтобы помочь проверить стабильный результирующий патч.
sw_ke: Ikiwa kisasisho unachopendekeza hakitafanya cherry-pick vizuri, unaweza kusaidia kwa kusuluhisha mizozo mwenyewe na kupendekeza kisasisho kinachotokana. Tafadhali weka mistari ya Migogoro katika ujumbe wa kuwekeza ili kusaidia kukagua kisasisho thabiti.
ta_in: நீங்கள் முன்மொழிகின்ற இணைப்பு செர்ரி-பிக் சுத்தமாக இருக்காது என்றால், மோதல்களை நீங்களே தீர்த்துக் கொண்டு, அதன் விளைவாக வரும் பேட்சை முன்மொழியலாம். நிலையான இணைப்பை மதிப்பாய்வு செய்ய உதவுவதற்கு தயவுசெய்து மோதல் வரிகளை உறுதி செய்தியில் வைக்கவும்.
tr_tr: Önerdiğiniz yama temiz bir şekilde cımbızlanmazsa, çatışmaları kendiniz çözerek ve ortaya çıkan yamayı önererek yardımcı olabilirsiniz. Kararlı yamanın incelenmesine yardımcı olmak için lütfen Çakışma satırlarını taahhüt mesajında tutun.
vi_vn: Nếu bản vá mà bạn đang đề nghị sẽ không cherry-pick gọn gàng, bạn có thể giúp đỡ bằng cách giải quyết những xung đột và đề xuất bản vá kết quả. Vui lòng giữ lại những dòng Xung đột trong thông báo commit để giúp đánh giá bản vá ổn định.

source: Backport labels
bn_bn: Backport লেবেল
el_gr: Ετικέτες Υποστήριξης-Ανανέωσης
es_mx: Etiquetas de backport
es_un: Etiquetas de backport
fr_fr: Étiquettes de rétroport
id_id: Label backport
it_it: Etichette di backport
pt_un: Rótulos de backport
ru_ru: Лэйблы бэкпортов
sw_ke: Lebo za backport
ta_in: பின்னணிஅடையாளக் குறியீடு
tr_tr: Backport etiketleri
vi_vn: Dán nhãn các backport

source: Bugs or PRs tagged with ``stable backport potential`` are bugs that apply to the stable release too and may be suitable for backporting once a fix lands in master. Once the backport has been proposed, the tag should be removed.
bn_bn: ``stable backport potential`` ট্যাগ সম্বলিত বাগ অথবা পুল রিকোয়েস্ট হল সেইধরনের বাগ যেগুলো স্টেবল রিলিজেও থাকে, সেগুলো মাস্টার (প্রধান) শাখায় সংশোধনের পর ব্যাকপোর্টের জন্য উপযুক্ত হয়। ব্যাকপোর্ট করা হয়ে গেলে ট্যাগ অপসারণ করা উচিত।
de_de: Bugs oder Pull-Requests, welche mit dem Label ``stable backport potential`` gekennzeichnet wurden, kommen für eine Rückportierung in den Stable-Branch in Frage, sobald dafür ein Patch im Master-Branch ist. Sobald die Rückportierung geplant ist, sollte das Tag entfernt werden.
el_gr: Σφάλματα ή PRs με ετικέτα ``stable backport potential`` είναι σφάλματα που ισχύουν και για τη σταθερή απελευθέρωση και μπορεί να είναι κατάλληλα για backporting μόλις προσγειωθεί μια επιδιόρθωση στον Κύριο. Μόλις προταθεί το backport, η ετικέτα θα πρέπει να αφαιρεθεί.
es_mx: Bugs o PRs etiquetados con ``stable backport potential`` son bugs que también afectan a la versión estable y pueden ser adecuados para hacer backport sólo cuando hayan solucionados en el master. Una vez que se ha propuesto el backport, se debe eliminar la etiqueta.
es_un: Los errores o PRs etiquetados con ``stable backport potential`` son errores que también se aplican a la versión estable y pueden ser adecuados para el backporting una vez que una corrección llega a master. Una vez que se ha propuesto el backport, se debe quitar la etiqueta.
fr_fr: Les anomalies ou PR avec l'étiquette ``stable backport potential`` sont celles candidates à un backportage dans le Master. Une fois l'intégration réalisée, le tag doit être supprimé.
id_id: Bug-bug atau PR- PR yang ditandai dengan ``stable backport potential`` adalah bug-bug yang digunakan juga untuk pelepasan yang stabil dan mungkin cocok untuk pengimporan kembali setelah perbaikan berada di master. Setelah backport telah diusulkan, tanda yang ada harus dihapus.
it_it: Bug o richieste di pull etichettate come ``stable backport potential`` sono bug che interessano anche lo stable e che potrebbero essere idonei al backport una volta che una correzione viene unita nel master. Una volta proposto il backport, l'etichetta deve essere rimossa.
pt_un: Bugs ou PRs marcados com ``estável potencial de backport`` são bugs que se aplicam ao lançamento estável também e podem ser adequados para backporting uma vez que uma correção chegue na master. Depois que o backport for proposto, a tag deverá ser removida.
ru_ru: Ошибки или PR, помеченные ``stable backport potential``, — это ошибки, которые также применяются к стабильному выпуску и могут быть пригодны для бэкпортинга после исправления их в master-ветке. Как только бэкпорт будет предложен, этот тэг должен быть удален.
sw_ke: Kasoro au PR zilizobandikwa ``stable backport potential`` ni kasoro zinazotumika kwa toleo imara pia na zinaweza kufaa kwa backporting punde rekebisho likitolewa katika master. Punde backport ikipendekezwa, bandiko linastahili kutolewa.
ta_in: ``stable backport potential`` உடன் குறிக்கப்பட்ட பிழைகள் அல்லது PR கள் நிலையான வெளியீட்டிற்கும் பொருந்தும் பிழைகள் மற்றும் மாஸ்டரில் ஒரு பிழைத்திருத்தம் வந்தவுடன் பின்செலுத்தலுக்கு ஏற்றதாக இருக்கலாம். பேக்போர்ட் முன்மொழியப்பட்டவுடன், குறிச்சொல் அகற்றப்பட வேண்டும்.
tr_tr: ``kararlı backport potansiyeli`` ile etiketlenmiş hatalar veya PR'lar, kararlı sürüm için de geçerli olan hatalardır ve bir master'a sabitlendikten sonra backporting için uygun olabilirler. Backport önerildikten sonra etiket kaldırılmalıdır.
vi_vn: Lỗi hoặc các pull request được gắn thẻ ``stable backport potential`` cũng là các lỗi đối với bản phát hành ổn định và có thể phù hợp để backport khi có bản sửa lỗi ở nhánh chính (master). Khi một backport được đề xuất, thẻ ``stable backport potential`` nên được loại bỏ.

source: Include ``[Stable]`` in the title of the PR against the stable branch, as a sign that setting the target branch as stable was not a mistake. Also, reference to the PR number in master that you are porting.
bn_bn: স্টেবল শাখায় পুল রিকোয়েস্টের শিরোনামে ``[Stable]`` যুক্ত করবেন, যাতে বোঝা যায় যে টারগেট শাখাকে স্টেবল হিসেবে চিহ্নিত করা ভুল হয়নি। এবং ব্যাকপোর্ট করা পুল রিকোয়েস্টের নম্বর মাস্টার (প্রধান) শাখায় রেফারেন্স হিসেবে দিতে হবে।
de_de: Um zu zeigen, dass die Auswahl des Stable-Branch als Ziel eines Pull-Requests kein Fehler war, verwenden Sie ``[Stable]`` im Titel. Zusätzlich geben Sie eine Referenz zum Pull-Request der Änderung im Master-Branch an, welche Sie rückportieren.
el_gr: Συμπεριλάβετε ``[Stable]`` στον τίτλο του PR ενάντια στον σταθερό κλάδο, ως σημάδι ότι ο ορισμός του κλάδου-στόχου ως σταθερού δεν ήταν λάθος. Επίσης, αναφορά στον αριθμό PR στον πλοίαρχο που μεταφέρετε.
es_mx: Incluya``[Stable]``en el título de los PR hacia la rama estable, como señal de que no es un error haber seleccionado esa rama. También haga referencia al número del PR de la rama master del que se está transfiriendo.
es_un: Incluye ``[Stable]`` en el título del PR hacia la rama estable, como una señal de que establecer la rama objetivo como estable no fue un error. Además, haz referencia al número del PR en master del que se está transfiriendo.
fr_fr: Ajoutez ``[Stable]`` dans le titre de la PR envoyée à la branche stable pour confirmer la pertinence de cette PR. N'oubliez pas d'ajouter le numéro de la PR dans le Master.
id_id: Gunakan ``[Stable]`` di dalam judul PR terhadap cabang yang stabil, sebagai penanda bahwa menetapkan cabang target sebagai stabil bukan merupakan suatu kesalahan. Cantumkan juga referensi nomor PR di bagian master yang Anda sedang porting.
it_it: Si deve includere [Stable] nel titolo della richiesta di pull verso lo stable branch, come indicazione che la scelta dello stable come branch di arrivo non è un errore. Inoltre, va referenziato il numero della richiesta di pull del master che si sta portando.
pt_un: Inclua ``[Stable]`` no título do PR contra a branch estável, como sinal de que a definição da branch alvo como estável não foi um erro. Além disso, referêncie o número do PR na master que você está portando.
ru_ru: Добавляйте ``[Stable]`` в заголовок PR с целевой stable-веткой, как знак того, что установка этой ветки в качестве целевой не была ошибкой. Также, добавьте ссылку на номер PR с целевой master-веткой, которую Вы портируете.
sw_ke: Jumuisha ``[Stable]`` katika kichwa cha PR dhidi ya tawi imara kama ishara kuwa kuweka tawi lengwa kuwa thabiti halikuwa kosa. Pia, rejelea nambari ya PR kwa master unayoifanyia porting.
ta_in: இலக்கு கிளையை நிலையானதாக அமைப்பது தவறு அல்ல என்பதற்கான அடையாளமாக, நிலையான கிளைக்கு எதிராக PR இன் தலைப்பில் ``[Stable]`` சேர்க்கவும். மேலும், நீங்கள் போர்ட்டிங் செய்யும் மாஸ்டரில் உள்ள PR எண்ணைக் குறிப்பிடவும்.
tr_tr: Hedef dalın kararlı olarak ayarlanmasının bir hata olmadığını gösteren bir işaret olarak kararlı dalda PR başlığına ``[Stable]`` ekleyin. Ayrıca, taşıdığınız masterdaki PR numarasını referans alın.
vi_vn: Kèm theo [Stable] ở trong tiêu đề của pull request đối với nhánh ổn định là một dấu hiệu đánh dấu nhánh mục tiêu là ổn định không phải là nhầm lẫn. Cùng với đó, hãy nhớ kèm theo số của pull request trong nhánh chính khi bạn port gì đó.

source: Contributing to Documentation
bn_bn: ডকুমেন্টেশনে কন্ট্রিবিউট করা
de_de: Zur Dokumentation beitragen
el_gr: Συμβάλλοντας στην τεκμηρίωση
es_mx: Contribuir a la Documentación
es_un: Contribuir a la Documentación
fr_fr: Contribuer à la documentation
id_id: Berkontribusi Pada Dokumentasi
it_it: Contribuire alla Documentazione
pt_un: Contribuindo para a Documentação
ru_ru: Участие в работе над документацией
sw_ke: Kuchangia Kwenye Nyaraka
ta_in: ஆவணத்தில் பங்களிப்பு
tr_tr: Belgelemeye katkı sağlamak
vi_vn: Đóng góp vào tài liệu

source: Qiskit documentation is shaped by the `docs as code <https://www.writethedocs.org/guide/docs-as-code/>`__ philosophy, primarily drawn from Qiskit code comments in the `style of API documentation <https://alistapart.com/article/the-ten-essentials-for-good-api-documentation/>`__.
bn_bn: Qiskit ডকুমেন্টেশনটি মূলত `docs as code <https://www.writethedocs.org/guide/docs-as-code/>`__ এর মত হয়ে থাকে, যা Qiskit কোডের কমেন্ট `style of API documentation <https://alistapart.com/article/the-ten-essentials-for-good-api-documentation/>``__ হতে অনুপ্রেরণীত।
de_de: Die Qiskit-Dokumentation gestaltet sich nach der `Docs-as-Code<https://www.writethedocs.org/guide/docs-as-code/>`__-Philosophie, primär wird sie aus Qiskit-Quelltextkommentaren im `Stil einer API-Dokumentation <https://alistapart.com/article/the-ten-essentials-for-good-api-documentation/>`__ generiert.
el_gr: Η τεκμηρίωση του Qiskit διαμορφώνεται από το `docs ως κώδικα <https://www.writethedocs.org/guide/docs-as-code/>`__ φιλοσοφία, κυρίως από τα σχόλια κώδικα Qiskit στο `στυλ τεκμηρίωσης API <https://alistapart.com/article/the-ten-essentials-for-good-api-documentation/>`__.
es_mx: La documentación de Qiskit sigue la filosofía `documentación como código <https://www.writethedocs.org/guide/docs-as-code/>`__, principalmente recogida del código de Qiskit usando el `estilo de documentación para APIs <https://alistapart.com/article/the-ten-essentials-for-good-api-documentation/>`__.
es_un: La documentación de Qiskit está conformada por la filosofía `documentación como código <https://www.writethedocs.org/guide/docs-as-code/>`__, extraída principalmente de los comentarios del código de Qiskit que está en el `estilo de documentación para APIs <https://alistapart.com/article/the-ten-essentials-for-good-api-documentation/>`__.
fr_fr: La documentation Qiskit est conforme aux principes de `docs as code <https://www.writethedocs.org/guide/docs-as-code/>`__ , issus des commentaires du code Qiskit et prenant exemple sur `style of API documentation <https://alistapart.com/article/the-ten-essentials-for-good-api-documentation/>`__.
id_id: Dokumentasi Qiskit dibentuk oleh filosofi `docs sebagai kode <https://www.writethedocs.org/guide/docs-as-code/>`__, yang utamanya ditarik dari kode komentar Qiskit di dalam `gaya dokumentasi API <https://alistapart.com/article/the-ten-essentials-for-good-api-documentation/>`__.
it_it: La documentazione di Qiskit è conforme alla filosofia di `docs as code <https://www.writethedocs.org/guide/docs-as-code/>`__, principalmente rielaborata a partire dai commenti al codice di Qiskit seguendo `style of API documentation <https://alistapart.com/article/the-ten-essentials-for-good-api-documentation/>`__.
pt_un: A documentação do Qiskit é moldada pela filosofia do `docs as code <https://www.writethedocs.org/guide/docs-as-code/>`__ desenhada principalmente a partir de comentários de código Qiskit na `style of API documentation <https://alistapart.com/article/the-ten-essentials-for-good-api-documentation/>`__.
ru_ru: Документация Qiskit формируется в философии `docs as code <https://www.writethedocs.org/guide/docs-as-code/>`__, и составляется прежде всего из комментариев кода Qiskit в стиле `документации к API <https://alistapart.com/article/the-ten-essentials-for-good-api-documentation/>`__.
sw_ke: Nyaraka za Qiskit zimeundwa na falsafa ya `docs as code <https://www.writethedocs.org/guide/docs-as-code/>`__ inayotolewa kutoka kwa maoni ya misimbo ya Qiskit kwa `style of API documentation <https://alistapart.com/article/the-ten-essentials-for-good-api-documentation/>`__.
ta_in: Qiskit ஆவணம் வடிவமைக்கப்பட்ட `docs as code <https://www.writethedocs.org/guide/docs-as-code/>`__ தத்துவம், முனைவர் Qiskit குறியீட்டு கருத்துக்களில் இருந்து வரையப்பட்டுள்ளது `API ஆவணம் <https://alistapart.com/article/the-ten-essentials-for-good-api-documentation/>`_.
tr_tr: Qiskit dokümantasyonu, ağırlıklı olarak `style of API documentation <https://alistapart.com/article/the-ten-essentials-for-good-api-documentation/>`__ (API dokümantasyon stili)'ndeki Qiskit kod yorumlarından çekilen `docs as code <https://www.writethedocs.org/guide/docs-as-code/>`__ (kod olarak dokümanlar) felsefesi ile şekillendirilmektedir.
vi_vn: Tài liệu Qiskit được hình thành bởi triết lý ' ghi chú như code <https://www.writethedocs.org/guide/docs-as-code/>'__, chủ yếu từ các bình luận theo `phong cách của một tài liệu API <https://alistapart.com/article/the-ten-essentials-for-good-api-documentation/>`__.
