Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: This docstring is at the module level for the module specified in the ``automodule`` directive in the rst file. If the module specified is a directory/namespace, the docstring should be specified in the ``__init__.py`` file for that directory. This module-level docstring contains more details about the module being documented. The normal structure to this docstring is to outline all the classes and functions of the public API that are contained in that module. This is typically done using the `autosummary directive <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>`__ (or `autodoc directives <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ directly if the module is simple, such as in the case of ``qiskit.execute``). The autosummary directive is used to autodoc a list of different Python elements (classes, functions, etc.) directly without having to manually call out the autodoc directives for each one. The module-level docstring is where to provide a high-level overview of what functionality the module provides. This is normally done by grouping the different components of the public API together into multiple subsections.
bn_bn: এই ডকস্ট্রিংটি আরএসটি (rst) ফাইলের ``automodule`` এর মডিউল লেভেলে আছে। যদি মডিউলটি কোনো ডিরেক্টরি/নেমস্পেসে নির্দিষ্ট করা থাকে তবে ডকস্ট্রিংটি ওই ডিরেক্টরির ``__init__.py`` ফাইলে থাকবে। এই মডিউল-লেভেল ডকস্ট্রিং এ মডিউলের বিবরণী (ডকুমেন্টেশন) সম্পর্কিত বিশদ বিবরণ থাকে। মডিউলের সব পাবলিক এপিআই (API) এর ক্লাস এবং ফাংশনগুলোর বিবরণ এই ডকস্ট্রিং এ থাকে। এটা সাধারণত `autosummary directive <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>`__ (অথবা যদি সাধারণ মডিউল হয়, যেমন ``qiskit.execute`` এর ক্ষেত্রে সরাসরি `autodoc directives <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ ) এ করা হয়ে থাকে। অটোসামারি ডিরেক্টিভে বিভিন্ন Python (পাইথন) উপাদান যেমন ক্লাস, ফাংশন ইত্যাদির একটি তালিকা (লিস্ট) থাকে যাতে ম্যানুয়ালি প্রত্যেকটি আলাদাভাবে লিখতে না হয়। কোনো মডিউল কী কাজ করে সে সংক্রান্ত বিবরণ মডিউল-লেভেল ডকস্ট্রিং এ থাকে। এটা সাধারণত পাবলিক এপিআই (API) এর বিভিন্ন অংশ একত্রীত করে কয়েকটি উপ শাখায় বিভক্ত করে করা হয়।
de_de: Dieser Docstring befindet sich auf der Modulebene für das Modul, welches in der Anweisung ``automodule`` in der rst-Datei angegeben ist. Wenn es sich bei dem angegebenen Modul um ein Verzeichnis/Namespace handelt, sollte der Docstring in der Datei ``__init__.py`` für dieses Verzeichnis angegeben werden. Dieser Docstring auf Modulebene enthält weitere Details zu dem Modul, das dokumentiert wird. Die normale Struktur zu dieses Docstrings ist eine Beschreibung aller Klassen und Funktionen der öffentlichen API, die in diesem Modul enthalten sind. Dies geschieht in der Regel mit der ` autosummary Direktive <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>` __ (oder ` autodoc Direktiven <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>` __ direkt, falls das Modul einfach ist, wie zum Beispiel im Fall ` `qiskit.execute ` `). Die Autosummary-Direktive wird verwendet, um eine Liste mit verschiedenen Python-Elementen (Klassen, Funktionen, etc.) direkt automatisch zu dokumentieren, ohne die Autodoc-Anweisungen für die einzelnen Elemente manuell aufrufen zu müssen. Der Modulebene Docstring gibt einen Überblick über die Funktionalität, die das Modul bereitstellt. Dies geschieht normalerweise, indem die verschiedenen Komponenten der öffentlichen API in mehrere Unterabschnitte gruppiert werden.
es_mx: Esta docstring está en el nivel de módulo para el módulo especificado en la carpeta `` automodule`` en el archivo rst. Si el módulo especificado es un directorio / namespace, la docstring se debe especificarse en el archivo ``__init__.py`` para ese directorio. Esta docstring a nivel de módulo contiene más detalles sobre el módulo que se está documentando. La estructura normal de esta docstring es describir todas las clases y funciones de la API pública contenida en ese módulo. Esto normalmente se hace usando la directiva `autosummary <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>`__ (o directivas `autodoc <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>` __ directamente si el módulo es simple, como en el caso de `` qiskit.execute``). La directiva autosummary se usa para auto-documentar una lista de diferentes elementos de Python (clases, funciones, etc.) directamente sin tener e invocar manualmente las directivas de auto-documentación para cada uno. La docstring de nivel de módulo es donde puede proporcionar una descripción general de alto nivel de la funcionalidad que proporciona el módulo. Esto normalmente se hace agrupando los diferentes componentes de la API pública en múltiples subsecciones.
es_un: Esta cadena de documentos (docstring) está a nivel de módulo para el módulo especificado en la directiva ``automodule`` en el primer archivo. Si el módulo especificado es un directorio/espacio de nombres (namespace), la docstring debe especificarse en el archivo ``__init__.py`` para ese directorio. Esta docstring a nivel de módulo contiene más detalles sobre el módulo que se está documentando. La estructura normal de esta docstring es describir todas las clases y funciones de la API pública contenidas en ese módulo. Esto se hace típicamente usando la `directiva autosummary <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>`__ (o `directivas autodoc <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ directamente si el módulo es simple, como en el caso de ``qiskit.execute``). La directiva autosummary se usa para autodocumentar (autodoc) una lista de diferentes elementos de Python (clases, funciones, etc.) directamente sin tener que llamar manualmente las directivas autodoc para cada uno. La cadena de documentación a nivel de módulo es donde se proporciona una descripción general de alto nivel de las funciones que proporciona el módulo. Esto se hace normalmente agrupando los diferentes componentes de la API pública en múltiples subsecciones.
fr_fr: Le docstring se trouve au niveau module, tel que défini dans la directive ``automodule`` du fichier rst. Si le module spécifié est un directory/namespace, le docstring doit être défini dans le fichier ``__init__.py``de ce répertoire. Ce docstring contient plus de détails sur le module documenté. Le docstring permet de préciser toutes les classes et fonctions des APIs publiques contenues dans ce module. Ceci est de fait réalisé via les directives `autosummary directive <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>`__ (ou directement dans `autodoc directives <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ si le module est simple, comme c'est le cas pour ``qiskit.execute``). La directive autosummary est utilisée pour documenter automatiquement une liste d'éléments Python (classes, fonctions, etc.) sans avoir à appeler manuellement des directives autodoc pour chacun d'eux Le docstring permet de fournir une vue haut-niveau des fonctionnalités du module. Il est recommandé de grouper les différents composants des APIs publiques de ce module dans des sous-sections.
id_id: Docstring ini berada pada tingkat modul untuk modul yang dinyatakan dalam direktif ``automodule`` dalam file rst. Jika modul tersebut adalah sebuah direktori/ruangnama, docstring tersebut perlu dirincikan dalah file ``__init__.py`` untuk direktori tersebut. Docstring tingkat modul ini mengandung lebih banyak detil mengenai modul yang sedang didokumentasikan. Struktur normal docstring ini adalah untuk menjabarkan seluruh kelas dan fungsi API publik yang terkandung dalam modul tersebut. Hal ini biasa dilakukan dengan menggunakan `autosummary directive <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>`__ (atau `autodoc directives <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ secara langsung jika modul tersebut sederhana, seperti pada kasus ``qiskit.execute``). Direktif autosummary tersebut digunakan untuk mendokumentasikan otomatis sebuah daftar berisi elemen Python yang berbeda (kelas, fungsi, dll.) secara langsung tanpa perlu memanggil direktif autodoc masing-masing secara manual. Docstring tingkat modul adalah tempat untuk memberikan gambaran tingkat tinggi mengenai fungsionalitas yang disediakan modul tersebut. Hal ini biasa dilakukan dengan mengelompokkan komponen-komponen yang berbeda dari API publik ke dalam beberapa subbagian.
it_it: Questa docstring è a livello modulo per il modulo specificato nell'istruzione ``automodule`` all'interno del file rst. Se il modulo specificato è una cartella/namespace, la docstring deve essere specificata nel file ``__init__.py`` di quella cartella. Questa doctring a livello modulo contiene più dettagli sul modulo che si sta documentando. La struttura normale per questa docstring serve a delineare tutte le classi e le funzioni dell'API pubblica che sono contenute nel modulo. Questo viene fatto generalmente usando `l'istruzione autosummary <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>`__ (o direttamente `autodoc directives <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ se il modulo è semplice, come nel caso di ``qiskit.execute``). L'istruzione autosummary è utilizzata per auto-documentare direttamente una lista di elementi di Python (classi, funzioni, etc..) senza dover chiamare manualmente l'autodoc per ciascuno. La docstring a livello modulo è il luogo adatto per inserire una visione ad alto livello delle funzionalità che il modulo fornisce. Questo viene fatto generalmente raggruppando le diverse componenti dell'API pubblica insieme in varie sottosezioni.
pt_un: Esta docstring está no nível de módulo para o módulo especificado na diretiva ``automodule`` no arquivo rst. Se o módulo especificado é um diretório/namespace, a docstring deve ser especificada no arquivo ``__init__.py`` para esse diretório. Esta docstring de nível de módulo contém mais detalhes sobre o módulo sendo documentado. A estrutura normal para esta docstring é definir todas as classes e funções da API pública que estão contidas nesse módulo. Isso é normalmente feito usando a `autosummary directive <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>`__ (ou `autodoc directiva <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ diretamente se o módulo for simples, tal como no caso de ``qiskit.execute``). A diretiva de autosummary é usada para auto-documentar uma lista de diferentes elementos Python (classes, funções, etc.) diretamente sem precisar chamar manualmente as diretivas autodoc para cada uma delas. A docstring do módulo é o local para fornecer uma visão de alto nível de qual funcionalidade o módulo fornece. Isso normalmente é feito agrupando os diferentes componentes da API pública em múltiplas subseções.
ru_ru: Эта документация находится на уровне того модуля, который указан в директиве ``automodule`` rst файла. Если указанный модуль является каталогом/пространством имен (namespace), то документация для этого каталога должна находиться в файле ``__init__.py``. Документация на уровне модуля содержит подробную информацию о нем. Обычно в данном виде документации описываются все классы и функции API, содержащиеся в этом модуле. Это делается с помощью `autosummary directive <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>`__ (или `autodoc directives <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ напрямую, если модуль простой, например, в случае ``qiskit.execute``). Директива autosummary предназначена для автоматического документирования нескольких различных элементов Python (классы, функции и т.д.) без необходимости вручную вызывать инструменты автодокументирования для каждого из них. Документация на уровне модуля является высокоуровневым обзором функциональности, которую предоставляет модуль вцелом. Обычно это делается путем группировки различных компонентов API в несколько подразделов.
sw_ke: Docstring hii iko katika kiwango cha moduli kwa moduli iliyotajwa katika maagizo ya ``automodule`` katika faili ya rst. Ikiwa moduli iliyotajwa ni folda/namespace, docstring inapaswa kutajwa kwenye faili ya ``__init__.py`` katika folda hiyo. Docstring hii ya kiwango cha moduli ina maelezo zaidi kuhusu moduli ambayo nyaraka yake inaandikwa. Muundo wa kawaida wa docstring hii ni kuainisha madarasa na functions zote za API ya umma ambazo ziko kwenye moduli hiyo. Kwa kawaida hii inafanyika kutumia `agizo la autosummary <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>`__ (or `maagizo ya autodoc <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ moja kwa moja ikiwa moduli ni rahisi, kama ilivyo kwa ``qiskit.execute``). Agizo la autosummary linatumika kufanya autodoc ya orodha ya vipengee tofauti vya Python (madarasa, functions n.k.) moja kwa moja bila kuita maagizo ya autodoc kwa kila mmoja. Docstring ya kiwango cha moduli ni mahali pa kutoa muhtasari wa kiwango cha juu wa utendaji unaotolewa na moduli. Hii kawaida hufanywa kwa kupanga sehemu tofauti za API ya umma pamoja katika vifungu vingi.
ta_in: இந்த நுழைவு ``automodule`` திசை கோப்பு ' இல் குறிப்பிடப்பட்ட கூற்றுக்கான கூறு மட்டத்தில் உள்ளது. If the module specified is a directory/namespace, the docstring should be specified in the ``__init__.py`` அந்த கோப்பகத்திற்கான கோப்பு. இந்த தொகுதி-நிலை டாக்ஸ்ட்ரிங் ஆவணப்படுத்தப்பட்ட தொகுதி பற்றிய கூடுதல் விவரங்களைக் கொண்டுள்ளது. இந்த நுழைவுக்கு சாதாரண கட்டமைப்பு அனைத்து வகுப்புகளையும், பொது API, அந்த கூற்றில் உள்ள அனைத்து வகுப்புகளையும் மற்றும் செயல்பாடுகளையும் வெளிப்பட உள்ளது. இந்த டாக்ஸ்ட்ரிங்கின் இயல்பான கட்டமைப்பு, அந்த தொகுதியில் உள்ள பொது API இன் அனைத்து வகுப்புகள் மற்றும் செயல்பாடுகளை கோடிட்டுக் காட்டுவதாகும். இது பொதுவாக `தன்னியக்க உத்தரவு <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>` __ (அல்லது `தானியங்கு வழிமுறைகள் <http: //www.sphinx- doc.org/en/master/usage/extensions/autodoc.html> `__ நேரடியாக தொகுதி எளிமையானதாக இருந்தால், ``qiskit.execute`` போன்றவை). ஒவ்வொன்றிற்கும் ஆட்டோடாக் கட்டளைகளை கைமுறையாக அழைக்காமல் நேரடியாக வெவ்வேறு பைதான் கூறுகளின் (வகுப்புகள், செயல்பாடுகள் போன்றவை) பட்டியலை ஆட்டோடாக் செய்ய ஆட்டோசம்மரி உத்தரவு பயன்படுத்தப்படுகிறது. தொகுதி-நிலை டாக்ஸ்ட்ரிங் என்பது தொகுதி என்ன செயல்பாட்டை வழங்குகிறது என்பதற்கான உயர் மட்ட கண்ணோட்டத்தை வழங்குவதாகும். இது பொதுவாக பொது API இன் வெவ்வேறு கூறுகளை ஒன்றாக பல துணைப்பிரிவுகளாக தொகுப்பதன் மூலம் செய்யப்படுகிறது.
tr_tr: Bu docstring rst dosyasındaki ``automodule`` direktifinde belirtilen modüle uygun modül düzeyindedir. Eğer modül dizin/namespace olarak belirtilmişse o dizin için docstring ``__init__.py`` içerisinde belirtilmelidir. Bu modül düzeyindeki docstring belgenen modülün hakkında daha fazla detay içermektedir. Bu docstring için normal yapı, o modülün içerdiği genel (public) API'ın bütün sınıflarını ve fonksiyonlarını çerçevelemektir. Bu, genel olarak eğer modül bu ``qiskit.execute`` olayındaki gibi basitse (otomatik özet direktifi) `autosummary directive <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>`__ ya da (otomatik belge direktifleri) `autodoc directives <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ kullanarak doğrudan yapılır. Otomatik özet direktifi her biri için elle (manuel olarak) autodoc direktifi çağırmaya gerek kalmadan doğrudan farklı Python birimlerinin (sınıflar, fonksiyonlar, vb.) listesini autodoc için kullanılmaktadır. Modül düzeyinde docstring, modülün hangi fonksiyonelliği sağladığı konusunda üst düzey bir bakış sağladığı yerdir. Bu normalde genel (public) API'nın farklı bileşenlerini birden fazla alt bölüme gruplayarak yapılır.
vi_vn: Phần docstrings này nằm tại bậc mô-đun đặt tại phần ``automodule`` ở trong tệp rst. Nếu mô-đun được xác định ở trong directory/namespace, phần docstring nên được xác định ở tệp ``__init__.py`` ở trong danh mục tương ứng. Bậc mô-đun doctring này chứa nhiều thông tin chi tiết hơn về mô-đun đang được viết. Cấu trúc thông thường của docstring này thường tóm tắt lại về thông tin các class, function của API chứa trong mô-đun đó. Việc này thường được hoàn thành thông qua việc dùng trực tiếp `autosummary directive <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>`__ (hoặc `autodoc directives <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ nếu mô-đun đó đơn giản, ví dụ như trong trường hợp ``qiskit.execute``). Việc tự động tóm tắt này để trực tiếp tạo ra một danh sách các thành phần trong Python (ví dụ như các class, function) mà không cần phải gọi ra từng autodoc một cách thủ công. Docstring gồm nhiều thứ bậc là nơi để cung cấp tổng quát thông tin về chức năng của mỗi mô-đun. Thông thường việc này được hoàn thành bằng việc nhóm các API công khai vào nhiều nhiều tập con.

source: For example, as in the previous dagcircuit module example, the contents of the module docstring for ``qiskit/dagcircuit/__init__.py`` would be::
bn_bn: উদাহরণস্বরূপ, ড্যাগসার্কিট (dagcircuit) মডিউলের মত, ``qiskit/dagcircuit/__init__.py`` মডিউলের বিষয়বস্তুর ডকস্ট্রিং হবেঃ
de_de: Anhand des vorherigen Beispiels zum dagcircuit-Modul könnte der Inhalt des Modul-Docstrings in ``qiskit/dagcircuit/__init__.py`` etwa so aussehen::
el_gr: Για παράδειγμα, όπως στην προηγούμενη ενότητα dagcircuit module, τα περιεχόμενα της ενότητας docstring για το ```qiskit/dagcircuit/__init__.py`` θα είναι::
es_mx: Por ejemplo, como en el ejemplo anterior del módulo dagcircuit, los contenidos de la docstring del módulo para ``qiskit/dagcircuit/__init__.py`` serían::
es_un: Por ejemplo, como en el ejemplo anterior del módulo dagcircuit, los contenidos de la docstring del módulo para ``qiskit/dagcircuit/__init__.py`` serían::
fr_fr: Par exemple, pour le module dagcircuit déjà évoqué, le contenu du docstring dans ``qiskit/dagcircuit/__init__.py`` serait ::
id_id: Sebagai contoh, seperti pada contoh modul dagsirkuit sebelumnya, isi dari modul docstring untuk ``qiskit/dagcircuit/__init__.py`` akan::
it_it: Ad esempio, nel modulo dagcircuit precedentemente descritto, il contenuto del modulo docstring per ``qiskit/dagcircuit/__init__.py`` sarebbe::
pt_un: Por exemplo, como no módulo-exemplo anterior, o conteúdo do módulo docstring para ``qiskit/dagcircuit/__init__.py`` seria::
ru_ru: Например, документация модуля dagcircuit в ``qiskit/dagcircuit/__init__.py`` будет содержать следующее:
sw_ke: Kwa mfano, kama katika mfano wa moduli ya dagcircuit iliyopita, yaliyomo katika docstring ya moduli ya ``qiskit/dagcircuit/__init__.py`` yatakuwa::
ta_in: எடுத்துக்காட்டாக, முந்தைய டாக்சர்க்யூட் தொகுதி உதாரணத்தைப் போலவே, டாக்ஸ்ட்ரிங் தொகுதியின் உள்ளடக்கங்களும் ``qiskit/dagcircuit/__init__.py`` இருக்கலாம்::
tr_tr: Örneğin, önceki dagcircuit modülü örneğinde olduğu gibi ``qiskit/dagcircuit/__init__.py`` için modül docstringinin içeriği aşağıdaki gibi olmalıdır::
vi_vn: Ví dụ, ở trong mô-đun dagcircuit trước, nội dung của mô-đun docstring cho ``qiskit/dagcircuit/__init__.py`` sẽ là::

source: This is just an example and the actual module docstring for the dagcircuit module might diverge from this.
bn_bn: এটি শুধুমাত্র একটি উদাহরণ এবং ড্যাগসার্কিট (dagcircuit) মডিউলের আসল মডিউল ডকস্ট্রিংটি এর থেকে ভিন্ন হতে পারে।
de_de: Dies ist nur ein Beispiel und der tatsächliche Docstring des dagcircuit-Moduls kann abweichen.
es_mx: Esto es solamente un ejemplo y la docstring real para el módulo dagcircuit podría diferir.
es_un: Esto es solamente un ejemplo y la docstring real para el módulo dagcircuit podría diferir.
fr_fr: Ce n'est qu'un exemple et le module docstring pour le module dagcircuit peut se différencier de cela.
id_id: Ini hanyalah sebuah contoh dan modul docstring yang sebenarnya untuk modul dagsirkuit mungkin menyimpang dari ini.
it_it: Questo è solo un esempio e il modulo docstring reale per il modulo del dagcircuit potrebbe essere differente.
pt_un: Este é apenas um exemplo e o verdadeiro módulo docstring para o módulo dagcircuit pode divergir disto.
ru_ru: Данный пример может отличаться от той документации, которую фактически содержит модуль dagcircuit.
sw_ke: Huu ni mfano tu na moduli halisi ya docstring ya moduli ya dagcircuit inaweza kutofautiana na hii.
ta_in: இது ஒரு எடுத்துக்காட்டு மற்றும் டாக்சர்க்யூட் தொகுதிக்கான உண்மையான தொகுதி டாக்ஸ்ட்ரிங் இதிலிருந்து வேறுபடக்கூடும்.
tr_tr: Bu sadece bir örnektir ve dagcicuit modülü için asıl modül docstringi bundan farklı olabilir.
vi_vn: Đây chỉ là một ví dụ về cách một mô-đun docstring cho mô-đun dagcircuit có thể được phân chia.

source: The actual docstring for the elements listed in the module docstring
bn_bn: মডিউল ডকস্ট্রিং এ তালিকাভুক্ত উপাদানগুলির প্রকৃত ডকস্ট্রিং
de_de: Der eigentliche Docstring der Objekte, die im Modul-Docstring aufgeführt sind
es_mx: La docstring real para los elementos listados en la docstring del módulo
es_un: La docstring real para los elementos listados en la docstring del módulo
fr_fr: La chaîne de docstring réelle des éléments répertoriés dans la docstring du module
id_id: Docstring yang sebenarnya untuk elemen tercantum dalam modul docstring
it_it: La docstring effettiva per gli elementi elencati nella docstring del modulo
pt_un: O docstring real para os elementos listados no módulo docstring
ru_ru: Настоящая документация для перечисленных элементов представлена в модуле docstring
sw_ke: Kukodolea halisi kwa vipengee vilivyoorodheshwa kwenye moduli ya docstring
ta_in: தொகுதி டாக்ஸ்ட்ரிங்கில் பட்டியலிடப்பட்டுள்ள உறுப்புகளுக்கான உண்மையான டாக்ஸ்ட்ரிங்
tr_tr: Elementler için asıl docstring, modül docstringi içerisinde listelenir
vi_vn: Một docstring liệt kê các phần tử trong mô-đun docstring trong thực tế
