Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: A common mistake is only to document how the code has been written, without describing *why* the developer chose to do it that way. Certainly, you should describe the overall code structure, particularly for large changes, but more importantly, be sure to describe the intent/motivation behind the changes.
bn_bn: একটি সাধারণ ভুল হলো, শুধু কোড কীভাবে করা হয়েছে তার বিবরণ লেখা এবং *কেন* ডেভেলাপার ওই পদ্ধতিটি বেছে নিলেন সে সম্পর্কে বর্ণনা না দেয়া। অবশ্যই আপনি কোডের সম্পূর্ণ গঠন এবং বড় কোনো পরিবর্তন সম্পর্কে ভালোভাবে বর্ণনা করবেন, কিন্তু পরিবর্তনের পেছনে উদ্দেশ্য/প্রয়োজন ব্যাখ্যা করাটাও সমান জরুরি।
de_de: Ein verbreiteter Fehler ist es nur zu dokumentieren wie ein Code geschrieben wurde, ohne zu erklären *warum* der Entwickler den Code so geschrieben hat. Natürlich sollte die Code-Struktur beschrieben werden; dies gilt insbesondere bei größeren Änderungen. Jedoch sollte man ebenso die Motivation für die Änderungen dokumentieren.
el_gr: Ένα κοινό λάθος είναι να καταγράψετε μόνο τον τρόπο που γράφτηκε ο κώδικας, χωρίς να περιγράψετε *γιατί* ο developer επέλεξε να το κάνει με το συγκεκριμένο τρόπο. Σίγουρα, θα πρέπει να περιγράψετε τη συνολική δομή του κώδικα, ιδιαιτέρως για μεγάλες αλλαγής, αλλά κυρίως, να είστε σίγουροι να περιγράψετε την πρόθεση/το κίνητρο πίσω από τις αλλαγές.
es_mx: Un error común es sólo documentar cómo se ha escrito el código, sin describir * por qué * el desarrollador eligió hacerlo de esa manera. Se debe describir la estructura general del código, particularmente para los cambios grandes, pero lo más importante es describir la intención/motivación detrás de los cambios.
es_un: Un error común es solo documentar cómo se ha escrito el código, sin describir *por qué* el desarrollador eligió hacerlo de esa manera. Se debe describir la estructura general del código, particularmente para los cambios grandes, pero lo más importante es describir la intención/motivación detrás de los cambios.
fr_fr: Il est important de documenter comment le code a été écrit. Mais on oublie souvent de décrire pourquoi on a choisi cette option plutôt qu'une autre pour résoudre le problème. Bien entendu, il faut décrire la structure du code produit. Mais il faut aussi documenter les intensions, les motivations qui sous-tendent ces changements.
id_id: Hanya mendokumentasikan bagaimana kode ditulis tanpa menjelaskan *mengapa* pengembang memilih untuk melakukannya dengan cara tersebut adalah sebuah kesalahan umum. Tentu saja, Anda harus mendeskripsikan struktur kode secara keseluruhan, terutama untuk perubahan besar, tetapi yang lebih penting, pastikan untuk mendeskripsikan maksud/motivasi di balik perubahan tersebut.
it_it: Un errore comune è quello di documentare solo come il codice è stato scritto, senza descrivere *perché* lo sviluppatore ha scelto di farlo in questo modo. É sicuramente importante descrivere la struttura generale del codice, in particolare se si tratta di grandi modifiche, ma è ancora più importante descrivere l'intento/motivazione dietro le modifiche.
pt_un: Um erro comum é apenas documentar como o código foi escrito, sem descrever o *por que* o desenvolvedor escolheu fazer isso dessa maneira. Você deve descrever a estrutura geral do código, particularmente para grandes mudanças, porém, mais importante, certifique-se de descrever a intenção/motivação por trás das mudanças.
ru_ru: Распространенная ошибка - задокументировать написанный код решения, не описав, *почему* разработчик решил это сделать. Разумеется Вы должны описать общую структуру кода, особенно для больших изменений, но, что более важно, не забудьте описать что побудило Вас сделать эти изменения.
sw_ke: Kosa la kawaida ni kueleza tu jinsi msimbo ulivyoandikwa, bila kueleza *kwa nini* msanidi programu alichagua mwelekeo huo. Bila shaka, unapaswa kueleza ujumla wa muundo wa msimbo, hususan katika mabadiliko makubwa. Jambo kuu ni kuhakikisha umeeleza nia iliyochangia kufanya mabadiliko.
ta_in: ஆவணப்படுத்தலின் போது செய்யும் பொதுவான தவறு, அந்த கோடு எவ்வாறு எழுதப்பட்டது என்பதை *ஏன்* அந்த டெவலப்பர் அவ்வழியைத் தேர்வு செய்தார் என்பதைக் குறிப்பிடாமல் எழுதுவது. நிச்சயமாக நீங்கள் உங்கள் ஒட்டுமொத்த கோட்டின் அமைப்பினை விவரிக்க வேண்டும், அதிலும் பெரிய மாற்றங்கள் ஏதாவது செய்திருந்தால் கட்டாயம் விவரிக்கவும். அதைவிட முக்கியம் அந்த மாற்றங்களைச் செய்வதற்கான நோக்கம் என்ன என்பதனையும் விவரிக்க வேண்டும்.
tr_tr: Yaygın bir hata, *neden* geliştiricinin o şekilde yapmayı seçtiğini tanımlamadan sadece kodun nasıl yazıldığını belgelemektir. Kesinlikle, özellikle büyük değişiklikler için bütün kod yapısını tanımlamalısınız fakat daha da önemlisi, değişikliklerin arkasındaki maksadı/niyeti tanımladığınıza emin olmalısınız.
vi_vn: Một lỗi thường gặp là chỉ ghi chú cách mà code được viết mà quên đi miêu tả *vì sao* lập trình viên lại làm như thế. Tất nhiên bạn nên giải thích cấu trúc code, đặc biệt cho những thay đổi lớn, và đặc biệt hơn là mô tả ý định hoặc động lực đằng sau những thay đổi.

source: Read the commit message to see if it hints at improved code structure.
bn_bn: কমিট মেসেজটি (বার্তা) ভালোভাবে পড়ে দেখতে হবে সেটি পুনর্গঠন জরুরি কিনা।
de_de: Lesen Sie die Commit-Nachricht, um zu sehen, ob sie Hinweise auf eine verbesserte Codestruktur liefert.
el_gr: Διαβάστε το μήνυμα υποβολής για να δείτε αν περιέχει την βελτιωμένη δομή του κώδικα.
es_mx: Lee el mensaje de confirmación para ver si sugiere una estructura de código mejorada.
es_un: Lee el mensaje de confirmación para ver si sugiere una estructura de código mejorada.
fr_fr: Lisez le Commit message pour vérifier s'il fait référence à l'amélioration de la structure générale du code.
id_id: Baca pesan komit untuk melihat apakah pesan tersebut menunjukkan peningkatan struktur kode.
it_it: Leggi il messaggio di commit per vedere se accenna a una struttura del codice migliorata.
pt_un: Leia a mensagem de commit para ver se ele mostra a estrutura de código melhorada.
ru_ru: Перечитайте комментарий к коммиту, чтобы проверить, помогает ли он понять улучшения структуры кода.
sw_ke: Soma ujumbe wa kuwekeza kutathmini iwapo inadokeza uboreshaji wa muundo wa msimbo.
ta_in: மேம்படுத்தப்பட்ட குறியீடு அமைப்பு உள்ளதா என்பதைக் கமிட் தகவலைப் படித்துத் தெரிந்து கொள்ளுங்கள்.
tr_tr: Gelişmiş kod yapısının ima edilip edilmediğini anlamak için commit mesajını okuyun.
vi_vn: Đọc thôngđiệp commit để xem nó có ở cấu trúc code nào được cải thiện không.

source: Often when describing a large commit message, it becomes obvious that a commit should have been split into two or more parts. Don't be afraid to go back and rebase the change to split it up into separate pull requests.
bn_bn: কখনো বড় কোনো কমিট মেসেজ (বার্তা) বর্ণনা করার সময় সেটিকে দুইটি বা আরো ভিন্ন অংশে বিভক্ত করার প্রয়োজন হতে পারে। এক্ষেত্রে সেটিকে বিভক্ত করে আলাদা আলাদা পুল রিকোয়েস্ট দিতে হবে।
de_de: Bei grösseren Commit-Nachrichten wird es oft deutlich, dass ein Commit in mehrere Teile hätte aufgeteilt werden sollen. Man sollte nicht davor zurück schrecken die Änderung entsprechend anzupassen und in mehrere Pull-Requests zu splitten.
el_gr: Συχνά όταν περιγράφουμε ένα μεγάλο μήνυμα υποβολής, γίνεται φανερό ότι μια υποβολή θα έπρεπε να χωριστεί σε δύο ή περισσότερα μέρη. Μην φοβάστε να πάτε πίσω και να επανατοποθετήσετε την αλλαγή για να την χωρίσετε σε ξεχωριστά αιτήματα λήψης.
es_mx: A veces, al revisar un mensaje de confirmación grande, resulta obvio que el cambio debería haberse dividido en dos o más partes. No tengas miedo de volver atrás y dividir el cambio en Pull Request diferentes.
es_un: A veces, al revisar un mensaje de confirmación grande, resulta obvio que el cambio debería haberse dividido en dos o más partes. No tengas miedo de volver atrás y dividir el cambio en Pull Requests diferentes.
fr_fr: Souvent, lors de la rédaction du Commit message, il apparait évident que le changement en cours aurait dû être divisé en plusieurs changements plus ciblés. N'hésitez pas à faire machine arrière et à découper vos modifications en plusieurs, plus restreintes et à faire autant de Commit que nécessaires.
id_id: Seringkali ketika mendeskripsikan pesan komit yang besar, terlihat jelas bahwa komit seharusnya dipecah menjadi dua bagian atau lebih. Jangan takut untuk kembali dan menerapkan kembali (rebase) perubahan tersebut untuk membaginya menjadi pull request terpisah.
it_it: Spesso quando si descrive un messaggio di commit molto corposo, ci si potrebbe rendere conto che sarebbe stato più opportuno suddividere la commit in due o più parti. Non aver paura di tornare indietro e riorganizzare la modifica per suddividerla in richieste di pull separate.
pt_un: Muitas vezes, ao descrever uma grande mensagem de commit, torna-se óbvio que o commit deveria ter sido dividido em duas ou mais partes. Não tenha medo de voltar e reestruturar a mudança para dividi-la em pull requests separados.
ru_ru: Часто при написании большого комментария к коммиту становится очевидно, что он должен быть разделен на два или более. Не бойтесь возвращаться назад и разделять изменения, чтобы включить их в разные Pull request.
sw_ke: Mara nyingi unapoeleza ujumbe wa kuwekeza ulio mkubwa, itakuwa dhahiri kuwa uwekezaji huo ungeweza kugawanywa mara mbili au zaidi. Usihofie kufuta na kurekebisha uwekezaji ili kuugawanya katika maombi ya mvuto tofauti.
ta_in: எப்போதும், ஒரு பெரிய கமிட் தகவலை விவரிக்கையில், அது இரண்டு அல்லது மூன்று பாகங்களாகப் பிரிக்கப் படவேண்டும் என்பது தெளிவாகத் தெரிந்துவிடும். அதனால், பின்னோக்கிச் சென்று அதனை தனித்தனி புல் ரெக்யூஸ்ட்-களாக பிரித்துப் போட அச்சம் கொள்ளவேண்டாம்.
tr_tr: Genellikle büyük bir commit mesajını tanımlarken commitin iki ya da daha fazla parçaya ayrılması aşikar olur. Değişikliğin özel pull requestlerin içine bölünmesi için geri dönmekten ve değişikliği rebase (bir referanstan diğerine dayalı olarak verileri değiştirmek) etmekten korkmayın.
vi_vn: Thông thường khi miêu tả một thông điệp commit lớn, nó khá hiển nhiên khi chia commit thành hai hoặc nhiều lần khác nhau. Đừng ngại để quay lại trước để xem rebase được chia thành nhiều đợt trong các pull request khác nhau.

source: Ensure sufficient information to decide whether to review.
bn_bn: রিভিউ (পর্যালোচনা) করা হবে কিনা তা নির্ধারিত হবে পর্যাপ্ত তথ্য দেয়া হয়েছে কিনা তার উপর ভিত্তি করে।
de_de: Bevor man ein Review durchführt sollte sichergestellt werden, dass genügend Informationen vorliegen.
el_gr: Εξασφαλίστε επαρκείς πληροφορίες για να αποφασίσετε αν θα γίνει αναθεώρηση.
es_mx: Asegúrese de que la información suficiente para decidir si se debe revisar.
es_un: Asegúrate de que haya información suficiente para decidir si se debe revisar.
fr_fr: Assurez-vous de la complétude de l'information en cas de revue ultérieure.
id_id: Pastikan bahwa informasi memadai untuk ditinjau.
it_it: Assicurare informazioni sufficienti per decidere se procedere alla revisione.
pt_un: Garanta informações suficientes para decidir se deve revisar.
ru_ru: Убедитесь, что информации достаточно, чтобы решить, следует ли проверять код.
sw_ke: Hakikisha una ujumbe wa kutosha kabla kuamua kufanya ukaguzi.
ta_in: விமர்சனத்துக்காக போதிய தகவல்கள் உள்ளதா என்பதை உறுதி செய்து கொள்ளுங்கள்.
tr_tr: Gözden geçirip geçirmemeye karar vermek için yeterli bilgi sağlayın.
vi_vn: Ðảm bảo đủ thông tin để quyết định đánh giá hay không.

source: When GitHub sends out email alerts for new pull request submissions, there is minimal information included - usually just the commit message and the list of files changes. Because of the high volume of patches, a commit message must contain sufficient information for potential reviewers to find the patch that they need to review.
bn_bn: গিটহাব যখন নতুন পুল রিকোয়েস্ট সাবমিশনের ইমেইল বার্তা পাঠায়, সাধারণত সেখানে কমিট বার্তা এবং পরিবর্তিত ফাইলগুলির তালিকা সম্বলিত তথ্য সংযুক্ত থাকে। প্রচুর পরিমাণ প্যাচ (patches) হবার কারণে, কমিট বার্তাটি যাতে প্রয়োজনীয় সব তথ্য সম্বলিত হয়, তাতে সম্ভাব্য রিভিউয়ার (পর্যালোচকদের) তাঁদের সুবিধামত সমস্যাটি খুঁজে পেতে সুবিধা হবে।
de_de: Wenn GitHub eine Email bzgl. eines neuen Pull-Requests versendet, ist darin nur minimale Information enthalten - in der Regel die Commit-Nachricht und eine Liste der Dateien, die von einer Änderung betroffen sind. Aufgrund der hohen Patchanzahl, muss eine Commit-Nachricht ausreichend Informationen für potentielle Reviewer enthalten.
el_gr: Όταν το GitHub στέλνει ειδοποιήσεις μέσω email για νέες υποβολές pull requests, υπάρχουν ελάχιστες πληροφορίες που συμπεριλαμβάνονται - συνήθως μόνο το μήνυμα υποβολής και η λίστα των αλλαγών των αρχείων. Εξαιτίας του μεγάλου όγκου πακέτων, ένα μήνυμα υποβολής πρέπει να περιέχει επαρκείς πληροφορίες για έναν πιθανό κριτικό, ώστε να μπορεί να βρει το πακέτο που πρέπει να αναθεωρήσει.
es_mx: Cuando GitHub envía un correo electrónico alertando de una nueva solicitud de Pull Request, solamente se incluye un mínimo de información - usualmente sólo el mensaje de commit y la lista de cambios en los archivos. Debido al alto volumen de parches, un mensaje de commit debe contener suficiente información para que quien la revise pueda encontrar el parche a revisar.
es_un: Cuando GitHub envía un correo electrónico alertando de una nueva solicitud de Pull Request, solamente se incluye un mínimo de información - usualmente sólo el mensaje de commit y la lista de cambios en los archivos. Debido al alto volumen de parches, un mensaje de commit debe contener suficiente información para que quien la revise pueda encontrar el parche a revisar.
fr_fr: Lorsque Github envoie des emails d'alertes pour les soumissions de nouvelles pull requests, ces emails contiennent (le plus souvent) uniquement le Commit message et la liste des fichiers modifiés. Le Commit message doit donc contenir suffisamment d'informations pour qu'un re-lecteur retrouve facilement, dans l'immense volume de changements composant un projet, la modification qu'il souhaite revoir.
id_id: Ketika GitHub mengirimkan notifikasi email untuk pengajuan permintaan tarik (pull request) baru, ada sebagian informasi yang disertakan - biasanya hanya pesan komit (commit) dan daftar file yang termodifikasi. Karena volume perubahan (patch) yang tinggi, sebuah pesan komit harus mengandung informasi yang cukup untuk para pengulas untuk menemukan perubahan yang perlu mereka tinjau.
it_it: Quando GitHub invia gli avvisi per email sull'apertura di nuove richieste di pull, le informazioni incluse sono minime - di solito solo il messaggio di commit e la lista delle modifiche nei file. A causa dell'alto volume di patch, un messaggio di commit deve contenere informazioni sufficienti per permettere ai potenziali revisori di trovare la patch da revisionare.
pt_un: Quando o GitHub envia alertas de e-mail para novas submissões de pull request há informações mínimas incluídas - geralmente apenas a mensagem de commit e a lista de alterações de arquivos. Por causa do alto volume de patches, uma mensagem de commit deve conter informações suficientes para potenciais revisores conseguirem encontrar a atualização que eles precisam revisar.
ru_ru: Когда GitHub отправляет оповещения по электронной почте о новых Pull request, в них содержится минимальная информация - обычно только комментарий к коммиту и список изменений в файлах. Из-за большого объема, комментарий должен содержать достаточную информацию, чтобы потенциальные проверяющие смогли найти правку, которую им нужно рассмотреть.
sw_ke: Wakati Github inapotuma arifa za barua pepe kwa uwasilishaji mpya wa ombi la kuvuta, kuna habari ndogo tu inajumuishwa - kwa kawaida huwa ni ujumbe wa kuwekeza na orodha ya mabadiliko ya faili. Kutokana na kiwango cha juu cha visasisho, ujumbe wa kuwekeza sharti uwe na habari ya kutosha kwa wakaguzi watarajiwa kupata kisasisho ambacho wanahitaji kukagua.
ta_in: புதிய புல் ரிக்வெஸ்ட் சமர்ப்பிப்புகளுக்கு GitHub மின்னஞ்சல் விழிப்பூட்டல்களை அனுப்பும்போது, குறைந்தபட்ச தகவல்களும் சேர்க்கப்பட்டுள்ளன - வழக்கமாக உறுதி செய்தி மற்றும் கோப்புகளின் பட்டியல் மாற்றங்கள். திட்டுகளின் அதிக அளவு இருப்பதால், ஒரு கமிட் தகவல்கள் விமர்சகர்கள் மீளாய்வு செய்ய வேண்டிய இணைப்பைக் கண்டுபிடிக்க போதுமான தகவல்களைக் கொண்டிருக்க வேண்டும்.
tr_tr: GitHub yeni pull request teklifleri için e-mail uyarıları gönderdiğinde, genellikle sadece commit mesajını ve değişen dosyaların listesini içeren küçük bir bilgilendirme vardır. Yüksek hacimli yamalar yüzünden, potansiyel reviewerların görüntülemeleri gereken yamayı bulmaları için bir commit mesajı yeterli bilgiyi içermelidir.
vi_vn: Khi Github gửi email thông báo một đề trình một pull request mới, có khá ít thông tin được kèm theo, thông thường chỉ có thông điệp commit và danh sách các thay đổi trong các file. Vì khối lượng bản vá cao, nên một thông điệp commit phải có đủ thông tin cần thiết để các người đánh giá tiềm năng có thể tìm bản vá họ cần để đánh giá.

source: The first commit line is the most important.
bn_bn: কমিটের প্রথম বাক্যটি সবচেয়ে গুরুত্বপূর্ণ।
de_de: Die erste Commit-Zeile ist am wichtigsten.
el_gr: Η πρώτη γραμμή της υποβολής είναι η σημαντικότερη.
es_mx: La primera linea del mensaje de commit es la más importante.
es_un: La primera línea del mensaje de commit es la más importante.
fr_fr: La première ligne du commentaire est la plus importante.
id_id: Baris komit pertama adalah yang paling penting.
it_it: La prima riga di commit è la più importante.
pt_un: A primeira linha do commit é a mais importante.
ru_ru: Первая строка комментария к коммиту - самая важная.
sw_ke: Mstari wa kwanza wa uwekezaji ndio muhimu zaidi.
ta_in: முதல் கமிட் வரி மிக முக்கியமானது.
tr_tr: İlk commit satırı en önemlisidir.
vi_vn: Dòng commit đầu tiên là dòng commit quan trọng nhất.
