Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: Code review is done in the open and is open to anyone. While only maintainers have access to merge commits, community feedback on pull requests is extremely valuable. It is also a good mechanism to learn about the code base. You can view a list of all open pull requests here:
bn_bn: কোড রিভিউ বা পর্যালোচনা খোলাখুলিভাবে করা হয় এবং সবার জন্য উন্মুক্ত। কমিট মার্জ বা সংযোজন করা, পুল রিকোয়েস্টে সদস্যদের মতামত দেয়া ইত্যাদি কিছু গুরুত্বপূর্ণ কাজের ভার শুধু রক্ষণাবেক্ষণকারীদের আওতাধীন। কোড বেইজ বা ভিত্তি সম্পর্কে জানা একটি ভালো প্রক্রিয়া। এখানে আপনি সব ওপেন বা উন্মুক্ত পুল রিকোয়েস্টের একটি তালিকা দেখতে পাবেনঃ
de_de: Ein Code-Review ist öffentlich und kann von jedem ausgeführt werden. Nur "Maintainer" haben Zugriff zu Merge-Commits, jedoch ist das Feedback der Community zu Pull-Requests sehr nützlich. Es hilft zusätzlich mehr über den Code zu lernen. Die Liste aller offenen Pull-Requests findet sich hier:
el_gr: Η αναθεώρηση του κώδικα γίνεται δημόσια και είναι ανοιχτή σε όλους. Ενώ μόνο οι συντηρητές έχουν πρόσβαση για να ενσωματώσουν υποβολές, η ανατροφοδότηση της κοινότητας σε αιτήματα λήψης είναι αρκετά πολύτιμη. Επίσης, είναι ένας καλός μηχανισμός για να μάθετε για την βάση του κώδικα. Μπορείτε να δείτε μία λίστα με όλα τα ανοιχτά αιτήματα λήψης εδώ:
es_mx: La revisión de código se hace de forma abierta y es visible para cualquier persona. Aunque sólo los/las responsables tienen acceso a hacer integrar código, es extremadamente importante que la comunidad dé su opinión sobre los Pull Requests. También es un buen mecanismo para aprender sobre la base de código. Puedes ver una lista de todos los Pull Requests abiertos aquí:
es_un: La revisión de código se hace de forma abierta y es visible para cualquier persona. Aunque solo los encargados tienen acceso para integrar código, es extremadamente importante que la comunidad dé su opinión sobre los Pull Requests. También es un buen mecanismo para aprender sobre el código base. Puedes ver una lista de todos los Pull Requests abiertos aquí:
fr_fr: La revue de code est faite librement et est accessible à tous. Même si l'intégration d'un code final est réservée à un sous ensemble d'utilisateurs (maintainers), les commentaires de toute la communauté sont extrêmement profitables au projet. C'est aussi un excellent moyen d'apprendre. Vous pouvez accéder à l'ensemble des pull requests ouvertes ici:
id_id: Peninjauan kode dilakukan secara terbuka dan terbuka bagi siapa saja. Meskipun hanya pengelola yang memiliki akses untuk menggabungkan komit, umpan balik dari komunitas pada permintaan tarik sangat berharga. Hal ini juga merupakan mekanisme yang baik untuk belajar tentang basis kode di Qiskit. Anda dapat melihat daftar semua permintaan tarik terbuka di sini:
it_it: La revisione del codice viene effettuata pubblicamente ed è aperta a tutti. Il feedback della comunità sulle richieste di pull è estremamente prezioso, mentre solo i manutentori hanno accesso ai merge commit. Contribuire è anche un buon modo per imparare le basi del codice. La lista di tutte le richieste di pull aperte è disponibile qui:
pt_un: A revisão de código é feita de forma aberta e está aberta a qualquer pessoa. Enquanto apenas os mantenedores têm acesso para mesclar commits, o feedback da comunidade sobre os pull requests é extremamente valioso. É também um bom mecanismo para aprender sobre o código base. Você pode visualizar uma lista de todos os pedidos de pull abertos aqui:
ru_ru: Проверка кода открыта для каждого. И хотя только пользователи с ролью Maintainer имеют возможность слияния коммитов, обратная связь от сообщества очень ценна. Также это хороший механизм, чтобы узнать больше о кодовой базе. Вы можете просмотреть список всех открытых запросов на слияние (Pull request) здесь:
sw_ke: Ukaguzi wa msimbo unafanywa kwa wazi na uko wazi kwa yeyote. Ingawa watunzaji tu ndio wanaoweza kuunganisha mabadiliko, maoni ya jamii kuhusu maombi ya kuvuta ni muhimu sana. Pia ni utaratibu mzuri wa kujifunza kuhusu msingi wa msimbo. Unaweza tazama orodha ya maombi yote ya wazi ya kuvuta hapa:
ta_in: Code விமர்சனம் அனைவர் முன்பும் அனைவரால் பார்க்கும் வகையிலும் இருக்கும். பராமரிப்பாளர்களுக்கு மட்டுமே கமிட்-களை ஒன்றிணைக்க அனுமதி உள்ள நிலையில், புல் ரிக்வெஸ்ட்-களுக்கு சமூகம் அளிக்கும் பின்னூட்டம் மிகவும் மதிப்பு மிக்கது. Code-ன் அடித்தளத்தை கற்றுக்கொள்வது மிகச் சிறந்த பொறிமுறை ஆகும். நீங்கள் பதிவு செய்த அணைத்து புல் ரிக்வெஸ்ட்களையும் இங்கு காணலாம்:
tr_tr: Kod gözden geçirme açık bir şekilde tamamlanır ve herkese açıktır. Önerileri birleştirmeye sadece sorumluların erişimi varken pull requestler üzerinde topluluk feedbackleri oldukça değerlidir. Feedback vermek ayrıca kod temelini öğrenmek için iyi bir mekanizmadır. Açık pull requestlerin tamamının listesini buradan görüntüleyebilirsiniz:
vi_vn: Việc đánh giá code được hoàn thành công khai với tất cả mọi người. Mặc dù chỉ những người bảo trì code mới có quyền commit, tuy nhiên đánh giá của cộng đồng về pull request là rất đáng giá. Nó cũng là một cơ chế tốt để biết thêm về code base. Bạn có thể xem thêm về các pull request mở tại đây:

source: Commit Messages
bn_bn: মেসেজ (বার্তা) কমিট করা
de_de: Commit-Nachricht
el_gr: Υποβολή Μηνυμάτων
es_mx: Mensajes de commit
es_un: Mensajes de commit
fr_fr: Les Messages de Commit
id_id: Pesan Komit
it_it: Messaggi di Commit
pt_un: Mensagens de Commit
ru_ru: Комментарии к коммитам
sw_ke: Ujumbe wa Kuwekeza
ta_in: கமிட் தகவல்கள்
tr_tr: Commit Mesajları
vi_vn: Các thông điệp khi commit

source: The content of the commit message describing a change is just as important as the change itself. The commit message provides the context for not only code review but also the change history in the git log. A detailed commit message will make it easier for your code to be reviewed, and will also provide context to the change when someone looks at it in the future. When writing a commit message, remember these important details:
bn_bn: কমিট মেসেজে (বার্তা) সংশোধন বা পরিবর্তনের বর্ণনা দেয়াটা কোডের মূল পরিবর্তনের মতই গুরুত্বপূর্ণ। কমিট বার্তাটি কেবল কোড রিভিউ (পর্যালোচনা) এর নয়, গিট লগের পরিবর্তনের ইতিবৃত্তও তুলে ধরে। কমিট মেসেজের (বার্তা) সবিশেষ বর্ণনা যেমন কোড রিভিউকে (পর্যালোচনা) সহজতর করে, তেমনই পরে যখন কেউ পরিবর্তনগুলি লক্ষ্য করবে তখন স্পষ্টতই এর প্রয়োজনীয়তা বা উদ্দেশ্য সহজে বুঝতে পারবে। কমিট মেসেজ (বার্তা) লেখার সময় নিচের বিষয়গুলি মনে রাখা জরুরিঃ
de_de: Der Inhalt einer Commit-Nachricht beschreibt die Änderung und ist genauso wichtig wie die Änderung selbst. Die Commit-Nachricht liefert den Kontext nicht nur für den Code-Review, sondern auch für den Verlauf der Änderungen im Git-Log. Eine detaillierte Commit-Nachricht erleichtert den Code-Review und liefert den Kontext, falls jemand die Änderung in der Zukunft nachvollziehen möchte. Für eine Commit-Nachricht sollten folgende Dinge beachtet werden:
el_gr: Το περιεχόμενο του μηνύματος υποβολών, που περιγράφει την αλλαγή είναι εξίσου σημαντικό με την αλλαγή την ίδια. Το μήνυμα υποβολής παρέχει το υπόβαθρο όχι μόνο για την αναθεώρηση του κώδικα, αλλά και για το ιστορικό των αλλαγών στο αρχείο καταγραφής git. Ένα λεπτομερές μήνυμα υποβολής θα διευκολύνει την αναθεώρηση του κώδικά σας, και επίσης θα παρέχει επεξήγηση για την αλλαγή, όταν κάποιος θα το κοιτάξει στο μέλλον. Όταν γράφετε ένα μήνυμα υποβολής, να θυμάστε αυτές τις σημαντικές λεπτομέρειες:
es_mx: El contenido del mensaje de confirmación que describe un cambio es tan importante como el propio cambio. El mensaje proporciona el contexto no sólo para la revisión del código, sino también el historial de cambios en el registro de Git. Un mensaje detallado hará que sea más fácil revisar tu código, y también proporcionará contexto cuando alguien revise el cambio en el futuro. Cuando escribas un mensaje de confirmación, recuerda estos detalles importantes:
es_un: El contenido del mensaje de confirmación que describe un cambio es tan importante como el propio cambio. El mensaje proporciona el contexto no sólo para la revisión del código, sino también el historial de cambios en el registro de Git. Un mensaje detallado hará que sea más fácil revisar tu código, y también proporcionará contexto cuando alguien revise el cambio en el futuro. Cuando escribas un mensaje de confirmación, recuerda estos detalles importantes:
fr_fr: Tout changement doit être documenté et expliqué dans le "Commit message". Documenter une modification est aussi importante que la modification elle-même. Cette documentation, non seulement, aide pendant la revue de code mais permet de garder l'historique des modifications dans le référentiel git. Un Commit message détaillé rendra la revue de code plus simple et fournira un contexte au futur lecteur du code correspondant. Lorsque vous documentez un Commit, gardez en mémoire les points suivants :
id_id: Isi dari pesan komit yang mendeskripsikan perubahan sama pentingnya dengan perubahan itu sendiri. Pesan komit memberikan konteks tidak hanya untuk peninjauan kode tetapi juga riwayat perubahan dalam log git. Sebuah pesan yang rinci akan membuat kode Anda lebih mudah untuk ditinjau, dan juga akan memberikan konteks atas perubahan tersebut ketika seseorang melihatnya di masa depan. Ketika menulis pesan komit, ingat detail penting ini:
it_it: Il contenuto del messaggio di commit che descrive una modifica è importante tanto quanto la modifica stessa. Il messaggio di commit fornisce informazioni utili non solo alla revisione del codice ma anche al tracciamento delle modifiche nel git log. Un messaggio di commit dettagliato renderà più facile la revisione del codice e fornirà anche il contesto della modifica quando qualcuno la guarderà in futuro. Quando si scrive un messaggio di commit, è importante ricordare questi importanti dettagli:
pt_un: O conteúdo da mensagem de commit que descreve uma mudança é tão importante quanto a própria mudança. A mensagem de commit fornece o contexto não só para revisão de código mas também para o histórico de alterações no log do git. Uma mensagem detalhada do commit facilitará a revisão do seu código, e também fornecerá contexto para a mudança quando alguém olhar para ela no futuro. Ao escrever uma mensagem de commit, lembre-se destes detalhes importantes:
ru_ru: Содержание комментария в коммите, описывающего изменения, так же важно, как и само изменение. Комментарий коммита предоставляет контекст не только для проверки кода, но и для истории изменений в git. Подробный комментарий к коммиту сделает его проще для проверки, а также предоставит контекст сделанных Вами изменений, когда кто-то смотрит на них в будущем. При написании комментарию к коммиту, помните следующие важные детали:
sw_ke: Maudhui ya ujumbe wa kuwekeza yanayofafanua mabadiliko yana umuhimu kama tu mabadiliko yenyewe. Ujumbe wa kuwekeza hupeana maudhui sio tu ya ukaguzi wa msimbo, bali pia historia ya mabadiliko kwenye batli ya git. Ujumbe wa kuwekeza uliofafanuliwa vilivyo utarahisisha msimbo wako kukaguliwa. Pia, itampa muktadha wa mabadiliko kwa atakayeipitia. Unapoandika ujumbe wa kuwekeza, kumbukua maelezeo kuu yafuatayo:
ta_in: கமிட் தகவலில் உள்ள மாற்றங்களைக் குறிக்கும் உள்ளடக்கங்கள் அந்த மாற்றத்தைப் போலவே முக்கியமானதாகக் கருதப்படுகிறது. கமிட் தகவல் கோடு -ன் விமர்சனம் மட்டுமல்லாது கிட் பதிவில் உண்டான மாற்றத்தின் சரித்திரத்தின் சூழலையும் அளிக்கும். ஒரு விரிவான கமிட் தகவல் கோடு -ஐ எளிதாக விமர்சிக்க உதவும் மற்றும் பிற்காலத்தில் ஒருவர் அதனைப் பார்க்கும் போது, எந்தச் சூழலில் அம்மாற்றங்கள் செய்யப்பட்டன என்பதனையும் விவரிக்கும். ஒரு கமிட் தகவலை எழுதும் போது, இந்த முக்கியமான விவரங்களை மனதில் கொள்ள வேண்டும்:
tr_tr: Bir değişikliği açıklayan öneri mesajının içeriği, değişikliğin kendisi kadar önemlidir. Öneri mesajı sadece kodu gözden geçirmeye değil ayrıca git logdaki değişiklik geçmişine de yarar sağlar. Detaylı bir öneri mesajı kodunuzun gözden geçirilmesini daha kolay hale getirecek ve gelecekte birisi koda baktığında değişim ortamına yarar sağlayacaktır. Bir öneri mesajı yazarken şu önemli detayları aklınızda tutun:
vi_vn: Nội dung của thông điệp khi commit miêu tả bất kì sự thay đổi nào cũng quan trong tương đương sự thay đổi đó. Thông điệp khi commit cung cấp ngữ cảnh không chỉ cho việc đánh giá code mà còn về lịch sử thay đổi trong git log. Một thông điệp commit chi tiết sẽ giúp code có thể được đánh giá dễ dàng hơn, và đồng thời cũng cung cấp ngữ cảnh cho người khác khi họ xem chúng trong tương lai. Khi viết thông điệp commit, hãy nhớ những điều quan trọng sau:

source: Do not assume the reviewer understands what the original problem was.
bn_bn: রিভিউয়ার (পর্যালোচক) জানেন না প্রকৃত সমস্যাটি কী ছিলো।
de_de: Man sollte nicht annehmen, dass der Reviewer versteht, was das ursprüngliche Problem war.
el_gr: Μην υποθέτετε ότι ο κριτής κατανοεί ποίο ήταν το αρχικό πρόβλημα.
es_mx: No supongas que quien revisa entiende cual era el problema original.
es_un: No supongas que quien revisa entiende cual era el problema original.
fr_fr: Ne supposez pas que le re-lecteur comprend le problème initial.
id_id: Jangan menganggap peninjau mengerti apa masalah aslinya.
it_it: Non dare per scontato che il recensore capisca quale fosse il problema originale.
pt_un: Não suponha que o revisor entenda qual era o problema original.
ru_ru: Не предполагайте, что проверяющий понимает, какая была исходная проблема.
sw_ke: Usidhanie ya kwamba mkaguzi anaelewa tatizo asili.
ta_in: தங்களின் உண்மையான பிரச்சனை என்ன என்பதை விமர்சகர் சரியாக புரிந்து கொண்டார் எனக் கருதக்கூடாது.
tr_tr: Görüntüleyenin asıl sorunun ne olduğunu bildiğini varsaymayın.
vi_vn: Không được giả định rằng người đánh giá hiểu rõ vấn đề ban đầu.

source: Do not assume the code is self-evident/self-documenting.
bn_bn: কোডের পরিবর্তন বা সংশোধন কেবল স্বতঃসিদ্ধ (সেল্ফ এভিডেন্ট) হওয়া যাবেনা।
de_de: Gehen Sie nicht davon aus, dass der Code selbsterklärend/selbstdokumentierend ist.
el_gr: Μην θεωρείτε ότι ο κώδικας αυτοτεκμηριώνεται.
es_mx: No suponga que el código es obvio o auto-documentado.
es_un: No supongas que el código es evidente/autodocumentado.
fr_fr: Ne supposez pas que le code soit évident ou auto-documenté.
id_id: Jangan menganggap bahwa kode itu sendiri sudah cukup jelas tanpa perlu adanya dokumentasi.
it_it: Non dare per scontato che il codice sia ovvio o auto-esplicativo.
pt_un: Não suponha que o código seja auto-evidente/auto-documentado.
ru_ru: Не предполагайте, что код является очевидным/авто-документированным.
sw_ke: Usidhanie msimbo wenyewe unavyofanya kazi ni dhahiri kwa wengine.
ta_in: உங்களின் கோடு சுய-வெளிப்படையானது/சுய-ஆவணபடுத்தல் வகையில் உள்ளது எனக் கருதக்கூடாது.
tr_tr: Kodun aşikar/kendini belgeleyen olduğunu düşünmeyin.
vi_vn: Không được giả định rằng code có thể tự giải thích cho chính nó.

source: What is self-evident to one person, might not be clear to another person. Always document what the original problem was and how it is being fixed, for any change except the most obvious typos, or whitespace-only commits.
bn_bn: কোনো কোড একজনের জন্য স্বতঃসিদ্ধ হলেও অন্যজনের নিকট তা স্পষ্ট নাও হতে পারে। সবসময় মূল সমস্যা, সেটি কীভাবে সংশোধন করা হয়েছে এসবের বিবরণী (ডকুমেন্টেশন) লিপিবদ্ধ করতে হবে, এক্ষেত্রে সাধারণ কিছু বানান ভুল বা স্পেসজনিত কমিট ব্যতিক্রম হতে পারে।
de_de: Was für eine Person selbsterklärend ist, ist möglicherweise nicht verständlich für jemand anders. Man sollte immer dokumentieren, was das ursprüngliche Problem war und wie man es löst. Dies gilt für jede Änderung mit Ausnahme von offensichtlichen Tippfehlern.
el_gr: Αυτό που είναι αυτονόητο σε ένα άτομο, μπορεί να μην είναι σαφές σε κάποιον άλλο. Να τεκμηριώνετε πάντα ποιό ήταν το αρχικό πρόβλημα και πώς καθορίζεται, για οποιαδήποτε αλλαγή, εκτός από τα πιο προφανή τυπογραφικά λάθη ή κενά διαστήματα.
es_mx: Lo que es evidente para una persona, podría no serlo para otra. Siempre documenta cuál era el problema original y cómo se está arreglando. Esto aplica para todos los cambios excepto errores de dedo o modificaciones al espacio en blanco.
es_un: Lo que es evidente para una persona, podría no serlo para otra. Siempre documenta cuál era el problema original y cómo se está arreglando. Esto aplica para todos los cambios excepto errores de dedo o modificaciones de solo espacios en blanco.
fr_fr: Ce qui est évident pour une personne ne l'est sans doute pas pour une autre. Documentez toujours l'origine du problème et comment il a été corrigé. Expliquez votre code.
id_id: Apa yang terlihat jelas bagi satu orang, mungkin tidak jelas bagi orang lain. Selalu dokumentasikan apa masalah aslinya dan bagaimana masalah itu diperbaiki, untuk setiap perubahan kecuali kesalahan ketik yang paling jelas terlihat, atau komit yang hanya whitespace.
it_it: Ciò che è ovvio per una persona, potrebbe non essere chiaro per un'altra. É opportuno documentare qual è stato il problema originale e come è stato risolto, includendo qualsiasi modifica effettuata, a parte gli errori di battitura più evidenti o le commit che contengono solo spazi bianchi.
pt_un: O que é óbvio para uma pessoa pode não ser para outra. Sempre documente qual foi o problema original e como ele está sendo corrigido. Para qualquer alteração, evite erros de digitação óbvios ou commits contendo apenas espaços em branco.
ru_ru: Что очевидно для одного человека, может быть непонятным для другого. Всегда документируйте то, в чем состояла изначальная проблема и как она исправлена. Делайте это для любых изменений, за исключением наиболее очевидных, таких как опечатки.
sw_ke: Yoyote yaliodhahiri kwa mtu mmoja, sio lazima yawe dhahiri kwa mwingine. Unapawsa kupeana maelezo ya tatizo asili na jinsi lilivyotatuliwa, kwa mabadiliko yoyote isipokuwa mategu ya kawaida au uwekezaji wa mabadiliko ya nafasi pekee.
ta_in: ஒருவருக்கு சுய-வெளிப்படையானதாகத் தெரியும் ஒரு பொருள் மற்றவருக்கு புரியாமல் போகலாம். அதனால், எப்போதும் உண்மையான பிரச்சனை என்ன என்பதனையும் அது எவ்வாறு சரி செய்யப்பட்டது என்பதனையும் குறிப்பிட வேண்டும், அது ஒரு சாதாரண எழுத்துப் பிழை அல்லது எழுத்திர்கிடையில் உள்ள இடைவெளி பிழையாக அல்லாதவரை.
tr_tr: Bir kişi için apaçık olan, başka bir kişi için açık olmayabilir. En bariz yazım hataları veya sadece boşluklarla ilgili işlemler dışındaki tüm değişiklikler için her zaman orijinal sorunun ne olduğunu ve nasıl düzeltildiğini belgeleyin.
vi_vn: Một điều hiển nhiên với một người có thể không rõ ràng với một người khác. Luôn luôn ghi chú lại vấn đề ban đầu là gì và cách nó được sửa, cho bất kì thay đổi nào trừ những lỗi đánh máy hiển nhiên hoặc những commit chỉ bao gồm các đấu cách.

source: Describe why a change is being made.
bn_bn: পরিবর্তনের কারণ বিশদ বর্ণনা করুন।
de_de: Beschreiben Sie, warum eine Änderung vorgenommen wird.
el_gr: Περιγράψτε γιατί γίνεται μια αλλαγή.
es_mx: Describe por qué se está realizando un cambio.
es_un: Describe por qué se está realizando un cambio.
fr_fr: Décrivez pourquoi une modification est réalisée.
id_id: Deskripsikan mengapa sebuah perubahan dibuat.
it_it: Descrivere perché si sta apportando la modifica.
pt_un: Descreva por que uma mudança está sendo feita.
ru_ru: Описывайте, почему сделаны данные изменения.
sw_ke: Eleza ni kwa nini mabadiliko yanafanywa.
ta_in: ஏன் அந்த மாற்றங்கள் செய்யப்பட்டன என்பதை விவரிக்கவும்.
tr_tr: Neden bir değişiklik yapıldığını ifade et.
vi_vn: Miêu tả vì sao mà một thay đổi được thực hiện.
