Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: If you have an idea for a new feature, please open an **Enhancement** issue in the appropriate element's issue tracker. Opening an issue starts a discussion with the team about your idea, how it fits in with the project, how it can be implemented, etc.
bn_bn: আপনার যদি নতুন বৈশিষ্ট্যর (ফিচার) কোনো চিন্তাভাবনা থেকে থাকে, তবে যথাযথ উপাদানের সমস্যা (ইস্যু) অনুসরকে (ট্র্যাকার) **Enhancement** (এনহ্যান্সমেন্ট) সমস্যা (ইস্যু) খুলুন। নতুন সমস্যা (ইস্যু) খোলার মাধ্যমে আপনি আপনার চিন্তাভাবনা আদান প্রদান করতে পারবেন, যেমন- নতুন ফিচারটি কীভাবে প্রকল্পে (প্রজেক্টে) মানানসই (ফিট) হবে, কীভাবে বাস্তবায়ন করা যাবে ইত্যাদি।
de_de: Falls man eine Idee für ein neues Funktion hat, sollte ein **Enhancement**-Issue im entsprechenden Issue-Tracker eröffnet werden. Wenn ein neues Issue eröffnet wird, wird eine Diskussion gestartet ob diese Idee in das Projekt passt, wie sie implementiert werden kann, etc.
el_gr: Εάν έχετε μια ιδέα για μια νέα λειτουργία, παρακαλώ ανοίξτε ένα ζήτημα ** Enhancement** στο κατάλληλο στοιχείο καταγραφής προβλημάτων. Το άνοιγμα ενός ζητήματος ξεκινά μια συζήτηση με την ομάδα σχετικά με την ιδέα σας, πώς ταιριάζει με το έργο, πώς μπορεί να εφαρμοστεί, κλπ.
es_mx: Si se te ocurre una nueva funcionalidad, por favor, abre una incidencia de **Enhancement** en el gestor de incidencias del elemento apropiado. Al abrir una incidencia toda la comunidad de Qiskit puede comenzar a discutir sobre tu propuesta: cómo encaja en el proyecto, formas de implementarla, etc.
es_un: Si se te ocurre una nueva funcionalidad, por favor, abre una incidencia de tipo **Enhancement** en el rastreador de incidencias del elemento apropiado. Al abrir una incidencia, se inicia una discusión con el equipo sobre tu idea, cómo encaja con el proyecto, cómo se puede implementar, etc.
fr_fr: Si vous avez l'idée d'une nouvelle fonctionnalité, ouvrez un ticket d'amélioration (**Enhancement** issue) dans l'outil de suivi approprié. Créer un ticket entraine automatiquement l'ouverture d'une discussion avec l'équipe autour de cette idée : comment elle s'intègre au projet, comment elle peut être implémentée, etc.
id_id: Jika Anda memiliki ide untuk fitur baru, silahkan membuat isu **Enhancement** baru pada pelacak isu dengan bidang yang sesuai. Membuat sebuah isu akan memulai diskusi dengan tim tentang ide Anda, bagaimana ide itu dapat cocok dengan proyek, bagaimana ide itu dapat diimplementasikan, dll.
it_it: Se hai un'idea per una nuova funzionalità, apri una issue di **Enhancement** nell'appropriato tracciatore di issue dell'elemento in oggetto. Aprendo una issue, ci si potrà confrontare con tutto il gruppo sulla tua idea, e capire per esempio se è adatta al progetto, come può essere implementata, etc.
pt_un: Se você tiver uma ideia para um novo recurso, por favor, abra um issue de **Melhoria** na ferramenta de issue do elemento apropriado. Abrir um issue inicia uma discussão com a equipe sobre a sua ideia, como ela se encaixa no projeto, como ela pode ser implementada, etc.
ru_ru: Если у Вас есть идея для новой функции, пожалуйста, откройте задачу с пометкой **Улучшение** в соответствующем трекере задач. Открытие задачи начинается с обсуждения с командой Вашей идеи, соответствует ли она проекту, как она может быть реализована и т.д.
sw_ke: Iwapo una wazo la kipengele kipya, tafadhali fungua suala la **Enhancement** katika kipengee kinachofaa cha kifuatilio suala. Ufunguzi wa suala huanzisha majadiliano na timu husika kuhusu wazo lako, jinsi linavypatana na mradi huu, jinsi linavyoweza kutekelezwa, nk.
ta_in: தற்போது உங்களுக்கு ஒரு புதிய அம்சதிர்க்கான யோசனை தோன்றினால், தயவு செய்து element's issue tracker-வில் புதிதாக ஒரு **Enhancement** issue-வை பதிவு செய்யவும். அவ்வாறு ஒரு issue-வை திறக்கும் பட்சத்தில், நீங்கள் உங்கள் குழுவுடன் தங்களின் யோசனையைப் பற்றி கலந்துரையாடலாம், எவ்வாறு அது அந்த செயல்திட்டத்தில் பொருந்தும், அதை எவ்வாறு செயல்படுத்துவது மற்றும் பல.
tr_tr: Yeni bir özellik için fikriniz varsa, lütfen ilgili ögenin sorun izleyicisinde bir **Enhancement(Geliştirme)** konusu açın. Bir konu açmak, takımla birlikte fikriniz hakkında bir tartışma başlatır, projeye nasıl uyar, nasıl uygulanabilir, vb.
vi_vn: Nếu bạn có ý tưởng cho một tính năng mới, hãy mở một phiếu **Enhancement** mới trong mục theo dõi tương ứng. Mở một phiếu mới sẽ bắt đầu một cuộc thảo luận với các thành viên trong nhóm về ý tưởng của bạn, nó tương thích như thế nào với cả dự án, làm thế nào để thực hiện,v...v...

source: Contributing Code
bn_bn: কোড করার মাধ্যমে অংশগ্রহণ
de_de: Code Beisteuern
el_gr: Συνεισφέροντας κώδικα
es_mx: Código de Contribución
es_un: Contribuir con el Código
fr_fr: Contribuer au Code
id_id: Kontribusi Kode
it_it: Contribuire al Codice
pt_un: Código Contribuinte
ru_ru: Участие в работе над кодом
sw_ke: Kuchangia Kwenye Msimbo
ta_in: Code பங்களிப்பு
tr_tr: Koda Katkı Sağlama
vi_vn: Đóng góp code

source: Style Guide
bn_bn: শৈলী নির্দেশিকা (স্টাইল গাইড)
el_gr: Οδηγός στυλ
es_mx: Guía de estilo
es_un: Guía de Estilo
fr_fr: Guide pour le style de code
id_id: Panduan Langgam
it_it: Guida allo Stile
pt_un: Guia de Estilos
ru_ru: Руководство по стилю
sw_ke: Mwongozo wa Mtindo
ta_in: நடைமுறை வழிகாட்டி
tr_tr: Stil Rehberi
vi_vn: Hướng dẫn định dạng

source: Contributor License Agreement
bn_bn: অংশগ্রহণকারীর চুক্তিপত্র (কন্ট্রিবিউটর লাইসেন্স এগ্রিমেন্ট)
de_de: Contributor License Agreement (Mitwirkenden-Lizenzvereinbarung)
el_gr: Σύμβαση άδειας χρήσης του Συνεισφερόμενου
es_mx: Acuerdo de Licencia del Contribuidor
es_un: Acuerdo de Licencia del Contribuidor
fr_fr: Accord de licence Contributeur (Cla)
id_id: Perjanjian Lisensi Kontributor
ko_kr: 기여자 라이센스 계약(CLA)
pl_pl: Umowa licencyjna współtwórców (CLA)
pt_un: Acordo de Licença do Contribuidor
ru_ru: Лицензионное соглашение участника
sw_ke: Mkataba wa Leseni ya Mchangiaji
ta_in: பங்களிப்பாளர் உரிம ஒப்பந்தம்
te_in: కంట్రిబ్యూటర్ లైసెన్స్ అగ్రిమెంట్
tr_tr: Katılımcı Lisans Sözleşmesi
vi_vn: Thỏa thuận đóng góp dành cho cộng tác viên (CLA)
zh_tw: 貢獻者授權合約

source: Before you can submit any code, all contributors must sign a contributor license agreement (CLA). By signing a CLA, you're attesting that you are the author of the contribution, and that you're freely contributing it under the terms of the Apache-2.0 license.
bn_bn: প্রকল্পে কোনো কোড প্রেরণ বা অংশগ্রহণ করার আগে, সকল অংশগ্রহণকারীকে একটি অংশগ্রহণকারীর চুক্তিপত্র (CLA) স্বাক্ষর করতে হবে। CLA স্বাক্ষর করার মাধ্যমে আপনি প্রত্যয়ন করবেন যে, আপনার সব কোড বা অবদানের রচয়িতা কেবল আপনি এবং আপনি Apache-2.0 চুক্তির শর্তসাপেক্ষে স্বাধীনভাবে অংশগ্রহন করছেন।
de_de: Bevor neuer Code beigesteuert werden kann müssen alle Mitwirkenden die "Contributer License Agreement" (CLA) (Mitwirkenden-Lizenvereinbarung) unterscheiben. Mit dem Unterzeichnen der CLA bestätigt man, dass man Autor des Code-Beitrags ist, und dass man diesen unentgeltlich entsprechend der Apache-2.0 Lizenz beisteuert.
el_gr: Για να μπορέσετε να υποβάλετε οποιοδήποτε κώδικα, όλοι οι συνεισφέροντες πρέπει να υπογράψουν μια σύμβαση άδειας χρήσης συνεισφοράς (CLA). Υπογράφοντας μια CLA, βεβαιώνετε ότι είστε ο συντάκτης της συνεισφοράς, και ότι συνεισφέρετε ελεύθερα βάσει των όρων της άδειας χρήσης Apache-2.0.
es_mx: Antes de que puedas enviar cualquier contribución a la comunidad, es necesario que firmes un acuerdo de licencia del contribuidor (conocido por sus siglas en inglés, CLA). Al firmar el CLA, afirmas ser el autor de la contribución y que tu contribución se ajusta a los términos de la licencia Apache-2.0.
es_un: Antes de que puedas enviar cualquier código, todos los colaboradores deben firmar un acuerdo de licencia de contribuidor (contributor license agreement, CLA). Al firmar un CLA, atestiguas que eres el autor de la contribución y que estás contribuyendo libremente bajo los términos de la licencia Apache-2.0.
fr_fr: Avant de soumettre un nouveau code, tous les contributeurs doivent signer un Accord de Licence (contributor license agreement -CLA-). En signant ce CLA, vous attestez que vous êtes l'auteur de la contribution et que vous contribuez de manière gratuite, en suivant les termes de la licence Apache-2.0.
id_id: Sebelum Anda dapat menyerahkan kode apa pun, semua kontributor harus menandatangani perjanjian lisensi kontributor (CLA). Dengan menandatangani CLA, Anda menegaskan bahwa Anda adalah penulis dari kontribusi, dan bahwa Anda mengkontribusikannya secara bebas di bawah persyaratan lisensi Apache-2.0.
it_it: Prima di poter sottomettere qualsiasi codice, ogni contributore deve firmare un contributor license agreement (CLA). Con la sottoscrizione del CLA, si dichiara di essere l'autore del codice e che si sta contribuendo liberamente sotto i termini della licenza Apache-2.0.
ko_kr: 코드를 제출할 수 있기 전에 모든 코드 기여자는 기여자 라이센스 계약에 (CLA) 서명해야만 한다. 기여자 라이센스 계약에 서명함으로써 본인이 기여 코드의 작성자이며, 아파치-2.0 라이센스의 조건 하에서 자유롭게 기여를 함을 인증한다.
pl_pl: Przed przesłaniem jakiegokolwiek kodu, wszyscy współtwórcy zobowiązani są podpisać umowę licencyjną współtwórców (CLA). Podpisując CLA, oświadczasz, że jesteś autorem wkładu (kodu) i że dobrowolnie go przekazujesz na warunkach licencji Apache-2.0.
pt_un: Antes de poder enviar qualquer código, todos os colaboradores devem assinar o acordo de licença do contribuidor (contributor license agreement - CLA). Ao assinar um CLA, você está atestando que é o autor da contribuição, e que está contribuindo livremente nos termos da licença Apache-2.0.
ru_ru: Прежде чем Вы сможете добавить новый код, Вы, как участник, должны подписать лицензионное соглашение (CLA). Подписав CLA, Вы подтверждаете, что являетесь автором данного кода и свободно вносите свой вклад в соответствии с условиями Apache-2.0 лицензии.
sw_ke: Kabla hujawasilisha msimbo wowote, wachangiaji wote sharti watie sahihi makubaliano ya leseni ya wachangiaji (CLA). Kwa kutia sahihi CLA, unathibitisha kuwa wewe ndiwe mwandishi wa mchango huo, na kwamba unachangia kwa uhuru chini ya masharti ya leseni ya Apache-2.0.
ta_in: நீங்கள் உங்கள் code-ஐ சமர்ப்பிக்கும் முன், அணைத்து பங்களிப்பாளர்களும் contributor license agreement (CLA)-வில் கையெழுத்திட வேண்டும். அவ்வாறு கையெழுத்திடுவதால், நீங்கள் உங்களின் பங்களிப்பின் எழுத்தாளராக சான்றளிக்கப் படுகிறீர்கள் மற்றும் அதை நீங்கள் Apache-2.0 உரிமத்தின் விதிமுறையின் கிழ் இலவசமாக பங்களிக்கிரீர்கள்.
te_in: మీరు కోడ్ సమర్పించే ముందు, అందరు సహకారులు ఒక కంట్రిబ్యూటర్ లైసెన్స్ అగ్రిమెంట్ (CLA) సంతకం చేయాలి. ఒక CLA సంతకం చేయడం ద్వారా, మీరు ప్రత్యాసనం యొక్క రచయిత, మరియు మీరు ఉచితంగా, Apache-2.0 లైసెన్సు యొక్క పరికరాల క్రింద భాగంగా ప్రదానం చేస్తున్నారు.
tr_tr: Herhangi bir kod göndermeden önce, bütün katılımcılar Katılımcı Lisans Sözleşmesi(CLA)'ni imzalamak zorunda. Bir CLA imzalayarak, katkının yazarının siz olduğunuzu ve Apache-2.0 lisansının koşullarına göre özgür bir şekilde katkı sağladığınızı tasdik edersiniz.
vi_vn: Trước khi bạn có thể đệ trình code, TẤT CẢ các người đóng góp phải kí thỏa thuận đóng góp dành cho cộng tác viên (CLA). Khi kí CLA, bạn chứng thực rằng bạn là tác giả của đóng góp, và bạn có thể tự do đóng góp chúng theo các điều khoản giấy phép Apache-2.0.
zh_tw: 在提交任何程式碼之前，所有貢獻者都必須簽署投稿者授權合約(CLA)。 透過簽署 CLA，您會證明自己是投稿的作者，並且根據 Apache-2.0 授權的條款，您可以自由地投稿。

source: When you contribute to the Qiskit project with a new pull request, a bot will evaluate whether you have signed the CLA. If required, the bot will comment on the pull request, including a link to accept the agreement. The `individual CLA <https://qiskit.org/license/qiskit-cla.pdf>`__ document is available for review as a PDF.
bn_bn: আপনি যখন Qiskit প্রকল্পে একটি নতুন পুল রিকোয়েস্ট তৈরি করবেন, তখন আপনি CLA স্বাক্ষর করেছেন কিনা তা স্বয়ংক্রিয়ভাবে নির্ণীত হবে। প্রয়োজন অনুসারে স্বয়ংক্রিয়ভাবে পুল রিকোয়েস্টে চুক্তি স্বাক্ষর করার জন্য একটি লিঙ্ক কমেন্ট বা মন্তব্য করা হবে। `individual CLA <https://qiskit.org/license/qiskit-cla.pdf>`__ বিবরণীটি (ডকুমেন্টেশন) পর্যালোচনা করার জন্য পিডিএফ আকারে দেয়া হলো।
de_de: Wenn man an einem Qiskit-Projekt mit einem Pull-Request mitwirkt prüft ein Bot ob die CLA unterzeichnet wurde. Falls nötig wird der Bot den Pull-Request kommentieren - inklusive eines Links zum Akzeptieren der Vereinbarung. Die `CLA für natürliche Personen <https://qiskit.org/license/qiskit-cla.pdf>`__ ist zur Überprüfung als PDF-Datei verfügbar.
el_gr: Όταν συνεισφέρετε στο έργο Qiskit με μια νέα αίτηση λήψης, ένα bot θα αξιολογήσει αν έχετε υπογράψει την CLA. Αν απαιτείται, το bot θα σχολιάσει την αίτηση έλξης, συμπεριλαμβανομένης μιας σύνδεσης για την αποδοχή της συμφωνίας. Το ατομικό CLA έγγραφο "<https://qiskit.org/license/qiskit-cla.pdf>" __ είναι διαθέσιμο για αξιολόγηση ως PDF.
es_mx: Cuando contribuyes al proyecto de Qiskit con un pull request, un bot evaluará si has firmado el CLA. Si se requiere, el bot comentará sobre el pull request, incluyendo una liga para aceptar el acuerdo. El `CLA individual <https://qiskit.org/license/qiskit-cla.pdf>`__ está disponible para revisar como PDF.
es_un: Cuando contribuyas al proyecto de Qiskit con un nuevo Pull Request, un bot evaluará si has firmado el CLA. Si es necesario, el bot comentará sobre el Pull Request, incluyendo un enlace para aceptar el acuerdo. El documento `CLA individual <https://qiskit.org/license/qiskit-cla.pdf>`__ está disponible para su revisión en formato PDF.
fr_fr: Lorsque vous contribuez au projet Qiskit via une nouvelle demande d'ajout, un robot vérifie si vous avez signé le CLA. Si ce n'est pas le cas, vous serez invité à signer cet accord, via un lien généré automatiquement. Le document `individual CLA <https://qiskit.org/license/qiskit-cla.pdf>`__ est disponible au format PDF.
id_id: Ketika Anda berkontribusi pada proyek Qiskit dengan permintaan tarik (*pull request*) baru, bot akan mengevaluasi apakah Anda telah menandatangani CLA tersebut. Jika diperlukan, bot akan memberi komentar pada permintaan tarik tersebut, beserta sebuah link untuk menerima perjanjian tersebut. Dokumen `CLA individu <https://qiskit.org/license/qiskit-cla.pdf>`__ tersedia jika Anda ingin meninjaunya (dalam format PDF).
it_it: Quando si contribuisce al Qiskit con una nuova richiesta di pull, un bot verificherà che sia stato firmato o meno il CLA. Se necessario, il bot lascerà un commento sulla richiesta di pull, contenente un link per accettare le condizioni. Il documento `individual CLA <https://qiskit.org/license/qiskit-cla.pdf>`__ è disponibile per visione in formato PDF.
ko_kr: Qiskit 프로젝트에 새로운 풀 리퀘스트를 기여할 때, 봇이 기여자 사용 계약에 서명을 했는지 자동으로 확인한다. 서명이 필요한 경우, 봇은 풀 리퀘스트에 계약에 사인할 수 있는 링크를 포함한 코멘트를 자동으로 생성한다. `개인 기여자 사용 계약 <https://qiskit.org/license/qiskit-cla.pdf>`__ 문서는 PDF로 확인할 수 있다.
pl_pl: Podczas zgłaszania nowego PR, następuje weryfikacja podpisania CLA. W przypadku, gdy umowa nie została podpisana, pod PR pojawi się komentarz bota zawierający link do jej zaakceptowania. Dokument `individual CLA <https://qiskit.org/license/qiskit-cla.pdf>` __ można przejrzeć w wersji PDF.
pt_un: Quando você contribuir para o projeto Qiskit com uma nova solicitação de pull, um bot irá avaliar se você assinou o CLA. Se necessário, o bot irá se pronunciar sobre a solicitação de pull, incluindo um link para aceite o acordo. O documento `individual CLA <https://qiskit.org/license/qiskit-cla.pdf>`__ está disponível para revisão como PDF.
ru_ru: Когда Вы вносите свой вклад в любой из проектов Qiskit и создаете новый запрос на слияние (Pull Request), бот проверяет, подписали ли Вы CLA. При необходимости бот оставит комментарий и предоставит ссылку для принятия соглашения. Также `CLA <https://qiskit.org/license/qiskit-cla.pdf>`__ доступен для просмотра в формате PDF.
sw_ke: Unapochangia katika mradi wa Qiskit na ombi mpya la kuvuta, boti itatathmini ikiwa umetia sahihi CLA. Itakapohitajika, boti itatoa maoni kuhusu ombi la kuvuta, pamoja na kiungo cha kukubali makubaliano. `Waraka mmoja wa CLA <https://qiskit.org/license/qiskit-cla.pdf>`__ unawezapatikana kwa ajili ya ukaguzi kama faili ya PDF.
ta_in: நீங்கள் Qiskit செயல்திட்டத்திற்கு ஒரு புதிய புல் ரிக்வெஸ்ட் மூலம் பங்களிக்கிரீர்கள் என்றால், ஒரு bot உருவாகி, உங்குளின் CLA கையெழுத்திடப் பட்டதா என்பதை சரிபார்க்கும். தேவைப்பட்டால், அந்த bot உங்கள் புல் ரிக்வெஸ்ட்-ல் கருத்து தெரிவிப்பதோடு நீங்கள் ஒப்பந்தத்தில் கையெழுத்திட தொடர்புகளையும் பதிவு செய்யும். `individual CLA <https://qiskit.org/license/qiskit-cla.pdf>`__ ஆவணம் விமர்சனத்துக்காக PDF ஆக இருக்கும்.
te_in: మీరు కొత్త పుల్ రిక్వెస్ట్ తో Qiskit ప్రాజెక్ట్‌కు సహకరించినప్పుడు, మీరు CLAపై సంతకం చేశారా లేదా అని బోట్ మూల్యాంకనం చేస్తుంది. అవసరమైతే, ఈ ఒప్పందం అంగీకరించడానికి ఒక లింకుతో సహా, పుల్ రిక్వెస్ట్ పై బోట్ వ్యాఖ్యానం చేస్తుంది. `వ్యక్తిగత CLA <https://qiskit.org/license/qiskit-cla.pdf>` _ పత్రం PDFగా సమీక్ష కోసం అందుబాటులో ఉంది.
tr_tr: Yeni bir pull request ile Qiskit projesine katkı sağladığınızda, bir bot CLA'yı imzalayıp imzalamadığınızı değerlendirecek. Eğer gerekirse, bot anlaşmayı kabul etmek için bir link de dahil olmak üzere pull request hakkında yorum yapacak. `Bireysel CLA <https://qiskit.org/license/qiskit-cla.pdf>`__ belgesi PDF olarak incelenmeye uygundur.
vi_vn: Khi bạn đóng góp vào dự án Qiskit với một pull request mới, một con bot sẽ kiểm tra xem bạn đã kí CLA chưa. Nếu bạn chưa kí và được yêu cầu, con bot sẽ bình luận ở trong pull request của bạn, kèm theo đường dẫn để kí thỏa thuận. Bản 'CLA cá nhân<https://qiskit.org/license/qiskit-cla.pdf>' có thể xem dưới dạng pdf.
zh_tw: 當您透過新的拉取請求以貢獻 Qiskit 專案， bot 會檢視您是否已簽署 CLA。 如有需要， bot 將會在拉取請求中提供包含同意書連結的建議。 單獨的 `CLA <https://qiskit.org/license/qiskit-cla.pdf>`__ 檔案以PDF格式提供參閱。

source: If your contribution is part of your employment or your contribution is the property of your employer, then you will more than likely need to sign a `corporate CLA <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ too and email it to us at <qiskit@us.ibm.com>.
bn_bn: যদি আপনার অংশগ্রহণ আপনার চাকরির অন্তর্ভুক্ত বা আপনার চাকরিদাতার মালিকানাভুক্ত হয় তবে আপনাকে একটি `corporate CLA <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ ও স্বাক্ষর করতে হবে এবং আমাদের কাছে এই <qiskit@us.ibm.com> ঠিকানায় ইমেইল করতে হবে।
de_de: Falls ein Beitrag einem Beschäftigungsverhältnis entstammt oder Eigentum des Arbeitgebers ist, ist es sehr wahrscheinlich, daß eine `CLA für Unternehmen <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ unterzeichnet werden muss, und per E-Mail an <qiskit@us.ibm.com> geschickt werden muss.
el_gr: Εάν η συνεισφορά σας είναι μέρος της απασχόλησηςσας ή η συνεισφορά σας είναι ιδιοκτησία του εργοδότη σας, τότε θα πρέπει να υπογράψετε ένα εταιρικό CLA έγγραφο " <https://qiskit.org/license/qiskit-corporate-cla.pdf>` __ και να το στείλετε στο <qiskit@us.ibm.com>.
es_mx: Si tu contribución es parte de tu empleo o tu contribución es propiedad de tu empleador, entonces seguramente necesitas firmar también un `CLA corporativo <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ y enviarlo al correo <qiskit@us.ibm.com>.
es_un: Si tu contribución es parte de tu empleo o tu contribución es propiedad de tu empleador, entonces seguramente necesitas firmar también un `CLA corporativo <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ y enviarlo al correo <qiskit@us.ibm.com>.
fr_fr: Si votre contribution est liée à votre emploi ou qu'elle est la propriété de votre employeur, vous devrez très probablement signer en plus l'accord suivant: `corporate CLA <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ et envoyer cet accord par eMail à: <qiskit@us.ibm.com>.
id_id: Jika kontribusi Anda adalah bagian dari pekerjaan Anda atau kontribusi Anda adalah properti dari atasan Anda, maka Anda kemungkinan besar perlu untuk menandatangani `CLA perusahaan <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ juga dan mengirimkannya kepada kami melalui surel di <qiskit@us.ibm.com>.
it_it: Se il tuo contributo è parte del tuo lavoro o di proprietà del tuo datore di lavoro, allora dovresti firmare anche la `corporate CLA <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ ed inviarla al seguente indirizzo <qiskit@us.ibm.com>.
ko_kr: 당신의 기여가 고용을 통해 이뤄진 활동이거나, 고용자의 자산이라면, `기업 기여자 사용 계약 <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ 에 서명한 후, <qiskit@us.ibm.com>에 이메일로 발송한다.
pl_pl: W przypadku, gdy twój wkład (kod) stanowi część twojej pracy lub własność twojego pracodawcy, podpisz ` korporacyjną umowę licencyjną współtwórców <https://qiskit.org/license/qiskit-corporate-cla.pdf>` __ i prześlij ją do nas mailem na adres <qiskit@us.ibm.com>.
pt_un: Se a sua contribuição faz parte do seu emprego ou a sua contribuição é propriedade do seu empregador, então é muito provável que você precise assinar também um `CLA corporativo <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ e o envie para nós em <qiskit@us.ibm.com>.
ru_ru: Если Ваш вклад является частью Вашей трудовой деятельности или Ваш код является собственностью Вашего работодателя, то скорее всего Вам также нужно будет подписать `корпоративный вариант CLA <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ и отправить нам его на почту <qiskit@us.ibm.com>.
sw_ke: Ikiwa mchango wako ni sehemu ya ajira yako au mchango wako ni mali ya mwajiri wako, basi utahitaji pia kutia sahihi `CLA ya ushirika <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ na kutuma barua pepe kwa <qiskit@us.ibm.com>.
ta_in: உங்களின் பங்களிப்பு உங்கள் வேலையின் ஒரு பகுதியாகவோ அல்லது உங்கள் முதலாளிக்கு சொந்தமானதில் ஒரு பகுதியாகவோ இருந்தால், நீங்கள் கட்டாயமாக `corporate CLA <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ விலும் சேர்த்து கையெழுத்திட வேண்டும் மற்றும் அதனை எங்களுக்கு இம்மின்னஞ்சல் <qiskit@us.ibm.com> மூலம் தெரிவிக்கவும்.
te_in: మీ సహకారం మీ ఉపాధిలో భాగమైతే లేదా మీ సహకారం మీ యజమాని ఆస్తి అయితే, మీరు `కార్పొరేట్ CLA <https://qiskit.org/license/qiskit-corporate-cla.pdf>పై సంతకం చేయాల్సి ఉంటుంది. `__ మరియు <qiskit@us.ibm.com>లో మాకు ఇమెయిల్ చేయండి.
tr_tr: Eğer katkınız işinizin parçası ya da işvereninizin mülkiyeti ise, o zaman büyük ihtimalle `Kurumsal CLA <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ de imzalamanız ve onu <qiskit@us.ibm.com> üzerinden bize email ile göndermeniz gerekecektir.
vi_vn: Nếu bản đóng góp của bạn là một phần của công việc hoặc quyền sở hữu thuộc về người lãnh đạo của bạn, bạn sẽ phải kí thỏa thuận hợp tác CLA<https://qiskit.org/license/qiskit-corporate-cla.pdf> và gửi bản thỏa thuận của bạn đến email <qiskit@us.ibm.com>.
zh_tw: 如果您的貢獻是就業的一部分，或您的投稿是您雇主的財產，那麼您將有可能需要簽署 `公司的 CLA <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ ，並在 <qiskit@us.ibm.com> 傳送電子郵件給我們。

source: Pull Requests
bn_bn: পুল রিকোয়েস্ট
el_gr: Αιτήσεις Λήψης
id_id: Permintaan Tarik (*Pull Requests*)
it_it: Richieste di Pull
ko_kr: Pull Request
ru_ru: Запросы на слияние (Pull Request)
sw_ke: Maombi ya Kuvuta
ta_in: புல் ரிக்வெஸ்ட் -கள்
te_in: పుల్ రిక్వెస్ట్
tr_tr: Pull Requestler
zh_tw: 拉取請求
