Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: After this, the steps to install Aer depend on which operating system you are using. Since Aer is a compiled C++ program with a Python interface, there are non-Python dependencies for building the Aer binary which can't be installed universally depending on operating system.
bn_bn: পরের ধাপগুলো নির্ভর করে আপনি কোন অপারেটিং সিস্টেম ব্যবহার করছেন তার ওপর। যেহেতু এয়ার Python ইন্টারফেসযুক্ত সি++ এ কম্পাইল করা ফ্রেমওয়ার্ক, তাই এয়ার বাইনারি ফাইলগুলো গঠন করতে কিছু Python-নয় এমন ডিপেন্ডেন্সি বা শর্ত প্রয়োজন হয় যেগুলো সব অপারেটিং সিস্টেমে সার্বজনীনভাবে ইন্সটল করা যায় না।
de_de: Ab hier ist die Installation von Aer abhängig vom verwendeten Betriebssystem. Da Aer ein kompiliertes C++ Programm mit einer Python-Schnittstelle ist, gibt es Nicht-Python Abhängigkeiten, um Aer zu kompilieren, welche spezifisch für das verwendete Betriebssystem sind.
el_gr: Στη συνέχεια, τα βήματα για την εγκατάσταση Aer εξαρτώνται από το λειτουργικό σύστημα που χρησιμοποιείτε. Δεδομένου ότι Aer είναι ένα μεταγλωττισμένο πρόγραμμα C++ με διεπαφή Python, υπάρχουν μη-Python εξαρτήσεις για την κατασκευή του Aer binary, το οποίο δεν μπορεί να εγκατασταθεί καθολικά ανάλογα με το λειτουργικό σύστημα.
es_mx: Después de esto, los pasos para instalar Aer dependerán del sistema operativo que estés usando. Dado que Aer es un programa compilado en C++ con una interfaz de Python, hay dependencias necesarias para construir Aer que no son de Python y que no se pueden instalar de manera universal en todos los sistemas operativos.
es_un: Después de esto, los pasos para instalar Aer dependerán del sistema operativo que estés usando. Dado que Aer es un programa compilado en C++ con una interfaz de Python, hay dependencias necesarias para construir Aer que no son de Python y que no se pueden instalar de manera universal en todos los sistemas operativos.
fr_fr: Ensuite, les étapes d'installation de Aer dépendent du système d'exploitation que vous utilisez. Comme Aer est un programme C++ compilé avec une interface Python, il ya des dépendances non-Python pour construire le binaire Aer qui ne peut pas être installé universellement en fonction du système d'exploitation.
id_id: Setelah ini, langkah-langkah untuk menginstal Aer bergantung pada sistem operasi yang Anda gunakan. Karena Aer adalah sebuah program C++ kompilasi dengan antarmuka Python, ada ketergantungan non-Python untuk membangun biner Aer yang tidak dapat diinstal secara universal bergantung pada sistem operasi.
it_it: A questo punto, i passi per installare Aer dipendono da quale sistema operativo si sta utilizzando. Poiché Aer è un programma C++ compilato con interfaccia Python, ci sono dipendenze non-Python per la costruzione del binario Aer che non può essere installato universalmente a seconda del sistema operativo.
pt_un: Depois disso, os passos para instalar Aer dependem de qual sistema operacional você está usando. Uma vez que Aer é um programa compilado em C++ com uma interface em Python, existem dependências não-Python para construir o binário Aer, que não podem ser instaladas universalmente, dependendo do sistema operacional.
ru_ru: После этого шаги по установке Aer зависят от используемой Вами операционной системы. Поскольку Aer является скомпилированной программой C++ с интерфейсом на Python, существуют другие зависимости помимо Python для построения бинарного файла Aer, который не может быть установлен без зависимости от операционной системы.
sw_ke: Baada ya haya, hatua za kusakinisha Aer hutegemea mfumo endeshi wa tarakilishi unayotumia. Kwa kuwa Aer ni programu iliyokusanywa ya C++ yenye kiolesura cha Python, kuna utegemezi usio wa Python wa kujenga jozi ya Aer ambayo haiwezi kusakinishwa ulimwenguni kulingana na mfumo endeshi wa tarakilishi.
ta_in: இதற்குப் பிறகு, Aer நிறுவும் படிகள் நீங்கள் எந்த இயக்க முறைமையைப் பயன்படுத்துகிறீர்கள் என்பதைப் பொறுத்தது. Aer என்பது பைதான் இடைமுகத்துடன் தொகுக்கப்பட்ட C++ நிரல் என்பதால், Aer பைனரியை உருவாக்குவதற்கு பைதான் அல்லாத சார்புகள் உள்ளன, அவை இயக்க முறைமையைப் பொறுத்து உலகளவில் நிறுவ முடியாது.
tr_tr: Bundan sonra, Aer'i yükleme adımları kullandığınız işletim sistemine bağlıdır. Aer, Python arabirimine sahip derlenmiş bir C++ programı olduğundan, işletim sistemine bağlı olarak evrensel olarak yüklenemeyen Aer ikili dosyasını oluşturmak için Python olmayan bağımlılıklar vardır.
vi_vn: Sau bước này, các bước để cài Aer tùy thuộc vào hệ điều hành bạn đang dùng. Vì Aer được biên dịch sử dụng C++ với giao diện Python, nên sẽ có các gói phụ thuộc không phải Python để xây dựng mã nhị phân của Aer mà không thể cài đặt tổng quát tùy thuộc vào hệ điều hành.

source: Linux
bn_bn: লিনাক্স

source: Install compiler requirements.
bn_bn: কম্পাইলার ব্যবহারের শর্তগুলো (রিকোয়ারমেন্ট) ইন্সটল করুন।
de_de: Compiler-Abhängigkeiten installieren.
el_gr: Εγκατάσταση απαιτήσεων μεταγλωττιστή.
es_mx: Instalar los requerimientos de compilación.
es_un: Instalar requerimientos del compilador.
fr_fr: Installez les pré-requis du compilateur.
it_it: Installare i requisiti del compilatore.
pt_un: Instalar requisitos do compilador.
ru_ru: Установите требуемые компилятору компоненты.
sw_ke: Sakinisha mahitaji ya compiler.
ta_in: தொகு தேவைகளை நிறுவவும்.
tr_tr: Derleyici gereksinimlerini yükleyin.
vi_vn: Cài đặt phần mềm cần thiết.

source: Building Aer requires a C++ compiler and development headers.
bn_bn: এয়ার বিল্ড বা গঠনের জন্য সি++ কম্পাইলার এবং ডেভেলপমেন্ট হেডার প্রয়োজন।
de_de: Die Kompilation von Aer benötigt einen C++-Compiler und entsprechende Header-Dateien.
el_gr: Η εγκαταστάστη του Aer απαιτεί έναν μεταγλωττιστή C++ και επικεφαλίδες ανάπτυξης.
es_mx: Aer requiere un compilador C++ y los headers de desarrollo para construir desde el código fuente.
es_un: Construir Aer requiere un compilador de C++ y las cabeceras de desarrollo.
fr_fr: Le build d'Aer nécessite un compilateur C++ et les en-têtes de développement.
it_it: Per effettuare la build di Aer è necessario un compilatore C++ ed i development header.
pt_un: Fazer o build do Aer requer cabeçalhos de desenvolvimento e compilador C++.
ru_ru: Для сборки Aer требуется C++ компилятор и заголовки разработки (development headers).
sw_ke: Ujenzi wa Aer huhitaji compiler ya C++ na development headers.
ta_in: Aer உருவாக்க ஒரு C++ தொகு மற்றும் டெவலப்மெண்ட் ஹெட்டர்கள் தேவைப்படுகிறது.
tr_tr: Aer'i kurmak bir C++ derleyicisi ve geliştirme başlıklarını gerektirir.

source: If you're using Fedora or an equivalent Linux distribution, install using:
bn_bn: ফেডোরা বা সমপর্যায়ের লিনাক্স ডিস্ট্রিবিউশন ব্যবহারকারীদের জন্যঃ
de_de: Wenn Sie Fedora oder eine gleichwertige Linux-Distribution verwenden, installieren Sie dies:
el_gr: Εάν χρησιμοποιείτε το Fedora ή μια αντίστοιχη διανομή Linux, εγκαταστήστε χρησιμοποιώντας:
es_mx: Si está usando Fedora o una distribución de Linux equivalente, instale usando:
es_un: Si estas usando Fedora o una distribución de Linux equivalente, instala usando:
fr_fr: Si vous utilisez Fedora ou une distribution Linux équivalente, installez à l'aide de:
it_it: Se si utilizza Fedora o una distribuzione Linux equivalente, eseguire l'installazione usando:
pt_un: Se você estiver usando o Fedora ou uma distribuição Linux equivalente, instale usando:
ru_ru: Если Вы используете Fedora или аналогичный дистрибутив Linux, используйте для установки:
sw_ke: Ikiwa unatumia Fedora au usambazaji sawa wa Linux, sakinisha kwa kutumia:
ta_in: நீங்கள் Fedora அல்லது அதற்கு சமமான Linux விநியோகத்தை பயன்படுத்தினால், பின்வரும் பயன்படுத்தி நிறுவவும்:
tr_tr: Fedora veya ona eşdeğer bir Linux dağıtımı kullanıyorsanız aşağıdakileri özellikleri kullanarak yükleyin:

source: For Ubuntu/Debian install it using:
bn_bn: উবুন্টু/ডেবিয়ান সিস্টেম ব্যবহারকারীদের জন্যঃ
de_de: Für Ubuntu/Debian installieren Sie es per:
el_gr: Για Ubuntu/Debian εγκαταστήστε το χρησιμοποιώντας:
es_mx: Para Ubuntu/Debian instálelo usando:
es_un: Para Ubuntu/Debian instala usando:
fr_fr: Pour Ubuntu/Debian, installez-le en utilisant :
it_it: Per Ubuntu/Debian procedere con l'installazione usando:
pt_un: Para o Ubuntu/Debian instale usando:
ru_ru: Для Ubuntu/Debian, используйте:
sw_ke: Kwa Ubuntu/Debian sakinisha kwa kutumia:
ta_in: உபுண்டு / டெபியன் அதை நிறுவ:
tr_tr: Ubuntu/Debian için şunu kullanarak kurun:

source: Install OpenBLAS development headers.
bn_bn: OpenBLAS ডেভেলপমেন্ট হেডারগুলো ইন্সটল করুন।
de_de: Installieren Sie die OpenBLAS-Header.
el_gr: Εγκαταστήστε τις κεφαλίδες ανάπτυξης OpenBLAS.
es_mx: Instale los headers de desarrollo OpenBLAS.
es_un: Instala las cabeceras de desarrollo OpenBLAS.
fr_fr: Installez les en-têtes de développement OpenBLAS.
it_it: Installare gli OpenBLAS development header.
pt_un: Instale cabeçalhos de desenvolvimento OpenBLAS.
ru_ru: Установите заголовки разработки (development headers) OpenBLAS.
sw_ke: Sakinisha OpenBLAS development headers.
ta_in: OpenBLAS மேம்பாட்டு தலைப்புகளை நிறுவு.
tr_tr: OpenBLAS geliştirme üstbilgilerini kurun.

source: macOS
bn_bn: ম্যাকওএস

source: Install dependencies.
bn_bn: ডিপেন্ডেন্সি বা শর্তগুলো ইন্সটল করুন।
de_de: Abhängigkeiten installieren.
el_gr: Εγκαταστήστε τις εξαρτήσεις.
es_mx: Instalar dependencias.
es_un: Instalar dependencias.
fr_fr: Installez les dépendances.
it_it: Installare le dipendenze.
pt_un: Instalar dependências.
ru_ru: Установите зависимости.
sw_ke: Sakinisha vitegemezi.
ta_in: சார்புகளை நிறுவவும்.
tr_tr: Bağımlılıkları kurun.

source: To use the `Clang <https://clang.llvm.org/>`__ compiler on macOS, you need to install an extra library for supporting `OpenMP <https://www.openmp.org/>`__. You can use `brew <https://brew.sh/>`__ to install this and other dependencies.
bn_bn: ম্যাকওএস এ `Clang <https://clang.llvm.org/>`__ব্যবহার করতে `OpenMP <https://www.openmp.org/>`__ সমর্থিত একটি অতিরিক্ত লাইব্রেরি ইন্সটল করতে হবে। আপনি `brew <https://brew.sh/>`__ ব্যবহার করে এটি এবং অন্যান্য ডিপেন্ডেন্সি বা শর্তগুলো ইন্সটল করতে পারেন।
de_de: Um den `Clang <https://clang.llvm.org/>`__ Compiler auf macOS zu verwenden, müssen Sie eine zusätzliche Bibliothek installieren, die `OpenMP <https://www.openmp.org/>`__ unterstützt. Sie können `brew <https://brew.sh/>`__ verwenden, um diese und andere Abhängigkeiten zu installieren.
el_gr: Για να χρησιμοποιήσετε τον μεταγλωττιστή 'Clang <https://clang.llvm.org/>' σε macOS, θα πρέπει να εγκαταστήσετε μία επιπρόσθετη βιβλιοθήκη για την υποστήριξη του 'OpenMP <https://www.openmp.org/>'. Μπορείτε να χρησιμοποιήσετε το 'brew<https://brew.sh/>' για να εγκαταστήσετε αυτό και άλλες εξαρτήσεις.
es_mx: Para usar el compilador `Clang <https://clang.llvm.org/>`__ en macOS, necesita instalar una biblioteca adicional para `OpenMP <https://www.openmp.org/>`__. Puede usar `brew <https://brew.sh/>`__ para instalar esta y otras dependencias.
es_un: Para usar el compilador `Clang <https://clang.llvm.org/>`__ en macOS, necesitas instalar una librería adicional para soportar `OpenMP <https://www.openmp.org/>`__. Puedes usar `brew <https://brew.sh/>`__ para instalar esta y otras dependencias.
fr_fr: Pour utiliser le compilateur `Clang <https://clang.llvm.org/>` __ sur macOS, vous devez installer une bibliothèque supplémentaire pour le support `OpenMP <https://www.openmp.org/>` __. Vous pouvez utiliser `brew <https://brew.sh/>` __ pour installer cette dépendance et d'autres dépendances.
it_it: Per utilizzare il compilatore `Clang <https://clang.llvm.org/>`__ su macOS, è necessario installare una libreria extra che permette di usare `OpenMP <https://www.openmp.org/>`__. Si può usare il comando `brew <https://brew.sh/>`__ per installare queste dipendenze.
pt_un: Para usar o compilador `Clang <https://clang.llvm.org/>`__ no macOS, você precisa instalar uma biblioteca extra para ter suporte a `OpenMP <https://www.openmp.org/>`__. Você pode usar o `brew <https://brew.sh/>`__ para instalar esta e outras dependências.
ru_ru: Чтобы использовать `Clang <https://clang.llvm.org/>`__ компилятор в macOS, Вам нужно установить дополнительную библиотеку поддержки `OpenMP <https://www.openmp.org/>`__. Вы можете использовать `brew <https://brew.sh/>`__ для установки этой и других зависимостей.
sw_ke: Ili kutumia copmiler ya `Clang <https://clang.llvm.org/>`__ katika macOS, unahitaji kusakinisha faili ya maktaba ya kuunga mkono `OpenMP <https://www.openmp.org/>`__. Unaweza tumia `brew <https://brew.sh/>`__ kusakinisha vitegemezi vingine.
ta_in: MacOS இல் `Clang <https://clang.llvm.org/>`__ தொகு பயன்படுத்த, `OpenMP <https://www.openmp.org/>`_ ஐ ஆதரிக்க நீங்கள் ஒரு கூடுதல் நூலகத்தை நிறுவ வேண்டும். இதையும் மற்ற சார்புகளையும் நிறுவ நீங்கள் `brew <https://brew.sh/>`__ ஐ பயன்படுத்தலாம்.
tr_tr: MacOS'ta `Clang <https://clang.llvm.org/>`__ derleyicisini kullanmak için `OpenMP <https://www.openmp.org/>`__ 'i destekleyen fazladan bir kitaplık yüklemeniz gerekir. Bunu ve diğer bağımlılıkları yüklemek için `brew <https://brew.sh/>`__ kullanabilirsiniz.

source: Then install a BLAS implementation; `OpenBLAS <https://www.openblas.net/>`__ is the default choice.
bn_bn: তারপর BLAS ইন্সটল করুন; `OpenBLAS <https://www.openblas.net/>`__ স্বতঃসিদ্ধ নিয়মানুসারে নির্বাচিত থাকে।
de_de: Installieren Sie dann eine BLAS-Implementierung; `OpenBLAS <https://www.openblas.net/>`__ ist die Standardauswahl.
el_gr: Στη συνέχεια εγκαταστήστε μια υλοποίηση BLAS. Το ' OpenBLAS <https://www.openblas.net/>` __ είναι η προεπιλεγμένη επιλογή.
es_mx: A continuación, instale una implementación de BLAS; ` OpenBLAS <https://www.openblas.net/>` __ es la opción predeterminada.
es_un: En seguida, instala una implementación de BLAS; `OpenBLAS <https://www.openblas.net/>`__ es la opción por defecto.
fr_fr: Installez ensuite une implémentation BLAS ; `OpenBLAS <https://www.openblas.net/>` __ est le choix par défaut.
it_it: Dopodiché installare un'implementazione di BLAS; `OpenBLAS <https://www.openblas.net/>`__ è la scelta di default.
pt_un: Em seguida, instale uma implementação do BLAS; `OpenBLAS <https://www.openblas.net/>`__ é a escolha padrão.
ru_ru: Затем установите BLAS; по умолчанию используется `OpenBLAS <https://www.openblas.net/>`__.
sw_ke: Kisha sakinisha tekelezo la BLAS; `OpenBLAS <https://www.openblas.net/>`__ ndio chaguo msingi.
ta_in: பின்னர் ஒரு BLAS செயல்படுத்தலை நிறுவவும்; `OpenBLAS <https://www.openblas.net/>`__ இயல்புநிலை தேர்வு.
tr_tr: Sonra bir BLAS uygulaması yükleyin; `OpenBLAS <https://www.openblas.net/>` __ varsayılan seçimdir.

source: Next, install ``Xcode Command Line Tools``.
bn_bn: শেষে ``Xcode Command Line Tools`` ইন্সটল করুন।
de_de: Als nächstes installiert man die ``Xcode Command Line Tools``.
el_gr: Στη συνέχεια, εγκαταστήστε τα ``Xcode Command Line Tools``.
es_mx: Después, instale ``Xcode Command Line Tools``.
es_un: Después, instala ``Xcode Command Line Tools``.
fr_fr: Ensuite, installez ``Xcode Command Line Tools``.
it_it: Successivamente, installare ``Xcode Command Line Tools``.
pt_un: Em seguida, instalar ``Xcode Command Line Tools``.
ru_ru: Далее, установите ``Xcode Command Line Tools``.
sw_ke: Ifuatayo, sakinisha ``Xcode Command Line Tools``.
ta_in: அடுத்து, ``Xcode Command Line Tools`` ஐ நிறுவவும்.
tr_tr: Daha sonra, ``Xcode Command Line Tools`` programını yükleyin.

source: Windows
bn_bn: উইন্ডোজ

source: On Windows you need to use `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ or `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ to install all the dependencies.
bn_bn: উইন্ডোজে ডিপেন্ডেন্সি বা শর্তগুলো ইন্সটল করতে `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ অথবা `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ ব্যবহার করতে হবে।
de_de: In Windows benötigt man `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ oder `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ um alle Abhängigkeiten installieren zu können.
el_gr: Στα Windows θα πρέπει να χρησιμοποιήσετε `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ ή `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ για να εγκαταστήσετε όλες τις εξαρτήσεις.
es_mx: En Windows necesita `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ o `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ para instalar todas las dependencias.
es_un: En Windows debes usar `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ o `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ para instalar todas las dependencias.
fr_fr: Sous Windows, vous devez utiliser `Anaconda3 <https://www.anaconda.com/distribution/#windows>` __ ou ` Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>` __ pour installer toutes les dépendances.
it_it: Su Windows è necessario utilizzare `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ o `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ per installare tutte le dipendenze.
pt_un: No Windows você precisa usar o `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ ou o `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ para instalar todas as dependências.
ru_ru: В Windows необходимо использовать `Anaconda3 <https://www.anaconda.com/distribution/#windows>` __ или `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>` __ для установки всех зависимостей.
sw_ke: Katika Windows utahitaji kutumia `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ au `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ ili kusakinisha vitegemezi vyote.
ta_in: Windows இல் நீங்கள் பயன்படுத்த வேண்டும் `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ அல்லது `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ அனைத்து சார்புகளையும் நிறுவ.
tr_tr: Windows'ta tüm bağımlılıkları yüklemek için `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ veya `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ kullamanız gerekir.

source: Install binary and build dependencies.
bn_bn: বাইনারি এবং বিল্ড ডিপেন্ডেন্সি বা শর্তগুলো ইন্সটল করুন।
de_de: Installieren Sie binäre und Build-Abhängigkeiten.
el_gr: Εγκαταστήστε το δυαδικό αρχείο και δημιουργήστε τις εξαρτήσεις.
es_mx: Instalar el archivo binario y construir dependencias.
es_un: Instalación de las dependencias binarias y de construcción.
fr_fr: Installez le binaire et les dépendances de build.
it_it: Installare il binario ed effettuare la build delle dipendenze.
pt_un: Instalar as dependências dos binários e do build.
ru_ru: Установите бинарные зависимости и зависимости для сборки.
sw_ke: Sakinisha jozi na vitegemezi vya ujenzi.
ta_in: பைனரி நிறுவவும் மற்றும் சார்புகளை உருவாக்கு.
tr_tr: Kurulum ve derleme için gereklilikleri yükleyiniz.

source: Build and install qiskit-aer directly
bn_bn: qiskit-এয়ার সরাসরি গঠন (বিল্ড) এবং ইন্সটল করুন
de_de: qiskit-aer direkt kompilieren und installieren
el_gr: Κατασκευάστε και εγκαταστήστε απευθείας το qiskit-aer
es_mx: Construir e instalar qiskit-aer directamente
es_un: Construir e instalar qiskit-aer directamente
fr_fr: Construire et installer qiskit-aer directement
id_id: Build dan install qiskit-aer secara langsung
it_it: Effettuare la build ed installare direttamente qiskit-aer
pt_un: Faça a criação dos pacotes e instale o qiskit-aer diretamente
ru_ru: Постройте и установите qiskit-aer.
sw_ke: Jenga na usakinishe qiskit-aer moja kwa moja
ta_in: நேரடியாக Qiskit-aer ஐ உருவாக்கி நிறுவவும்
tr_tr: Doğrudan qiskit-aer derle ve kur
vi_vn: Trực tiếp dựng và cài đặt qiskit-aer

source: If you have pip <19.0.0 installed and your environment doesn't require a custom build, run:
bn_bn: যদি আপনার pip <19.0.0 ইন্সটল করা থাকে এবং এনভায়রনমেন্টে কাস্টম বিল্ড প্রয়োজন না হয় তবে নিচের নির্দেশনাগুলো কার্যকর করুনঃ
de_de: Hat man pip < 19.0.0 installiert und benötigt keine benutzerdefinierte Konfiguration, kann man folgenden Befehl verwenden:
el_gr: Εάν έχετε εγκαταστήσει το pip <19.0.0 και το περιβάλλον σας δεν απαιτεί προσαρμοσμένη κατασκευή, εκτελέστε:
es_mx: Si tiene pip<19.0.0 instalado y tu ambiente no requiere una compilación personalizada, ejecuta:
es_un: Si tienes pip<19.0.0 instalado y tu ambiente no requiere una compilación personalizada, ejecuta:
fr_fr: Si pip <19.0.0 est installé et que votre environnement n'a pas besoin d'une génération personnalisée, exécutez:
id_id: Jika Anda telah menginstal pip <19.0.0 dan environment Anda tidak membutuhkan build khusus (custom), jalankan:
it_it: Se si ha installato pip <19.0.0 ed il proprio ambiente non richiede una build personalizzata, eseguire:
pt_un: Se você tiver o pip <19.0.0 instalado e seu ambiente não requer um build personalizado, execute:
ru_ru: Если у Вас установлен pip <19.0.0 и Ваша среда не требует пользовательской сборки, запустите:
sw_ke: Iwapo una pip <19.0.0 iliyosakinishwa na mazingira yako hayahitaji ujenzi maalum, endesha:
ta_in: உங்களிடம் pip <19.0.0 நிறுவப்பட்டிருந்தால், உங்கள் சூழலுக்கு தனிப்பயன் உருவாக்க தேவையில்லை, இயக்கவும்:
tr_tr: Sisteminizde pip < 19.0.0 kuruluysa ve ortamınız özel bir oluşturma gerektirmiyorsa, şu işlemi çalıştırın:
vi_vn: Nếu bạn có phiên bản pip <19.0.0 và môi trường của bạn không yêu cầu một bản dưng tùy chỉnh, chạy:

source: This will both build the binaries and install Aer.
bn_bn: এর ফলে বাইনারি বিল্ডের সাথে এয়ারও ইন্সটল হবে।
de_de: Damit kompiliert und installiert man Aer.
el_gr: Αυτό θα κατασκευάσει τα δυαδικά αρχεία και θα εγκαταστήσει το Aer.
es_mx: Esto ejecutará la construcción de binarios e instalará Aer.
es_un: Esto construirá los binarios e instalará Aer.
fr_fr: Cela compilera les binaires et installera Aer.
id_id: Hal ini akan mem-build binaries dan meng-install Aer.
it_it: In questo modo si effettuerà sia la build dei binari che l'installazione di Aer.
pt_un: Isto irá fazer o build dos binários e instalar o Aer.
ru_ru: Это запустит сборку бинарных файлов и установит Aer.
sw_ke: Huku kutajenga jozi hizo na kusakinisha Aer.
ta_in: இது இரண்டும் பைனரிகளை உருவாக்கி Aer நிறுவும்.
tr_tr: Bu, ikili dosyaları oluşturur ve Aer 'i kurar.
vi_vn: Điều này sẽ dựng cả mã nhị phân cũng như cài đặt Aer cùng lúc.
