Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: Cloning the repository creates a local folder called ``qiskit-terra``.
bn_bn: রিপোসিটোরিটিকে ক্লোন করলে ``qiskit-terra``` নামক একটি স্থানীয় ফোল্ডার তৈরী হবে।
de_de: Klonen des Repository erzeugt einen lokalen Ordner namens ``qiskit-terra``.
el_gr: Η κλωνοποίηση του αποθετηρίου δημιουργεί έναν τοπικό φάκελο που ονομάζεται ``qiskit-terra``.
es_mx: La clonación del repositorio crea un folder local llamado ``qiskit-terra``.
es_un: La clonación del repositorio crea un folder local llamado ``qiskit-terra``.
fr_fr: Un répertoire local ``qiskit-terra`` est créé.
id_id: Mengkloning repositori akan membuat sebuah folder lokal bernama ``qiskit-terra``.
it_it: La clonazione del repository crea una cartella locale denominata``qiskit-terra``.
pt_un: Clonar o repositório criará uma pasta local chamada ``qiskit-terra``.
ru_ru: Клонирование репозитория создает локальную папку с названием ``qiskit-terra``.
sw_ke: Kutengeneza pacha wa repo huunda folda ya kienyeji inayoitwa ``qiskit-terra``.
ta_in: களஞ்சியத்தை குளோன் செய்வது ``qiskit-terra`` என்ற உள்ளூர் கோப்புறையை உருவாக்குகிறது.
tr_tr: Depoyu klonlamak ``qiskit-terra`` adında yerel bir dosya oluşturur.
vi_vn: Việc clone repository sẽ tạo nên một thư mục có tên ``qiskit-terra``.

source: Install the Python requirements libraries from your ``qiskit-terra`` directory.
bn_bn: ``qiskit-terra`` ডিরেক্টরি থেকে Python এর যাবতীয় দরকারি লাইব্রেরি ইনস্টল করুন।
de_de: Installieren Sie die erforderlichen Python-Pakete aus dem ``qiskit-terra`` Verzeichnis.
el_gr: Εγκαταστήστε τις βιβλιοθήκες απαιτήσεων Python από τον κατάλογο ``qiskit-terra``.
es_mx: Instalar los requerimientos de librerías de Python desde tu directorio ``qiskit-terra``.
es_un: Instala los requerimientos de librerías de Python desde tu directorio ``qiskit-terra``.
fr_fr: Installez les librairies Python nécessaires depuis le répertoire ``qiskit-terra``.
id_id: Instal pustaka Python yang dibutuhkan dari direktori ``qiskit-terra`` Anda.
it_it: Installare le librerie dei requisiti Python dalla propria cartella ``qiskit-terra``.
ru_ru: Установите необходимые библиотеки Python из Вашей папки ``qiskit-terra``.
sw_ke: Sakinisha faili za maktaba zinazohitajika na Python kutoka folda yako ya "qiskit-terra".
ta_in: உங்கள் ``qiskit-terra`` கோப்பகத்திலிருந்து பைதான் தேவைகள் நூலகங்களை நிறுவவும்.
tr_tr: Python gereksinim kütüphanelerini ``qiskit-terra`` dizininizden kurun.
vi_vn: Cài đặt các thư viện Python cần thiết từ đường dẫn ``qiskit-terra``.

source: If you want to run tests or linting checks, install the developer requirements.
bn_bn: টেস্ট রান করানোর জন্য বা লিনটিং চেক করার জন্য, ডেভেলপারের রিকোয়ারমেন্টগুলি ইনস্টল করুন।
de_de: Falls Tests oder Linting-Checks durchgeführt werden sollen, muss man zusätzlich die Entwicklungsabhängigkeiten installieren.
el_gr: Αν θέλετε να εκτελέσετε δοκιμές ή να επιβάλετε ελέγχους, εγκαταστήστε τις απαιτήσεις ανάπτυξης.
es_mx: Si quieres ejecutar pruebas o verificaciones de lint, instala los requerimientos de desarrollador.
es_un: Si quieres ejecutar pruebas o verificaciones de lint, instala los requerimientos de desarrollador.
fr_fr: Si vous souhaitez réaliser des tests ou faire du linting, installez les pré-requis Developeur.
id_id: Jika Anda ingin menjalankan tes atau melakukan pengecekan dengan linter, instal persyaratan pengembang.
it_it: Nel caso in cui si voglia effettuare dei test o controlli di linting, installare le dipendenze per lo sviluppo.
pt_un: Se você quiser executar testes ou análise de código, instale os requisitos de desenvolvedor.
ru_ru: Если Вы хотите запустить тесты, установите необходимые инструменты для разработчика.
sw_ke: Ikiwa unataka kufanya majaribio au ukaguzi wa msimbo wa programu, sakinisha mahitaji ya msanidi programu.
ta_in: நீங்கள் சோதனைகளை இயக்க விரும்பினால் அல்லது சோதனைகள் நீக்கனால், உருவாக்குபவர் தேவைகளை நிறுவவும்.
tr_tr: Test veya linting (tiftikleme) kontrolleri yapmak istiyorsanız, geliştirici gereksinimlerini yükleyin.
vi_vn: Nếu bạn muốn chạy các bài kiểm tra hoặc kiểm tra liên kết, cài đặt các yêu cầu cho nhà phát triển.

source: Install ``qiskit-terra``.
bn_bn: ``qiskit-terra`` ইনস্টল করুন।
de_de: Installieren Sie ``qiskit-terra``.
el_gr: Εγκατάσταση ` ` qiskit-terra ` `.
es_mx: Instalar ``qiskit-terra``.
es_un: Instalar ``qiskit-terra``.
fr_fr: Installez ``qiskit-terra``.
id_id: Instal ``qiskit-terra``.
it_it: Installare ``qiskit-terra``.
pt_un: Instale o ``qiskit-terra``.
ru_ru: Установите ``qiskit-terra``.
sw_ke: Sakinisha ``qiskit-terra``.
ta_in: நிறுவப்பட்ட ``qiskit-terra``.
tr_tr: ``qiskit-terra`` yükleyin.
vi_vn: Cài đặt ``qiskit-terra``.

source: If you want to install it in editable mode, meaning that code changes to the project don't require a reinstall to be applied, you can do this with:
bn_bn: আপনি যদি এটিকে সম্পাদনযোগ্য মোডে ইনস্টল করতে চান, মানে এই প্রকল্পের কোড পরিবর্তনের জন্য প্রয়োগ করার জন্য পুনরায় ইনস্টল করা প্রয়োজন না, আপনি এটি করতে পারেন:
de_de: Möchte man eine Installation im editierbaren Modus vornehmen - in dem Code-Änderungen im Projekt keine Neuinstallation erfordern - kann man das wie folgt machen:
el_gr: Αν θέλετε να το εγκαταστήσετε σε επεξεργάσιμη μορφή, που σημαίνει ότι οι αλλαγές κώδικα στο έργο δεν απαιτούν την εφαρμογή επανεγκατάστασης, μπορείτε να το κάνετε με:
es_mx: Si desea instalarlo en modo editable, es decir que los cambios en el código del proyecto no requieran ser instalados de nuevo, puede hacerlo con:
es_un: Si deseas instalarlo en modo editable, es decir que los cambios en el código del proyecto no requieran ser instalados de nuevo, puedes hacerlo con:
fr_fr: Pour une installation en mode Editable (les changements dans le code sont alors pris en compte sans besoin de réinstaller le projet), vous pouvez choisir cette commande :
id_id: Jika Anda ingin memasangnya pada mode pengeditan, itu berarti perubahan kode pada proyek tidak memerlukan instalasi ulang:
it_it: Se si vuole installarle in modalità modificabile, ovvero in modo che le modifiche al codice del progetto non richiedano una nuova installazione per essere applicate, bisogna farlo attraverso:
pt_un: Se você quiser instalá-lo em modo editável, o que significa que as alterações de código no projeto não requerem que uma reinstalação seja aplicada, você pode fazer isso com:
ru_ru: Если Вы хотите установить пакет в редактируемом режиме, который позволяет не переустанавливать пакет в случае изменения кода в проекте, Вы можете сделать это с помощью:
sw_ke: Ikiwa unataka kuisakinisha katika hali inayoweza kuhaririwa, kumaanisha kuwa mabadiliko ya misimbo ya mradi hayahitaji usakinishaji mpya utumike, unaweza fanya hivyo kutumia:
ta_in: தேவையான முறையில் அதை நிறுத்த விரும்பினால், அந்த நிரலுக்கு code மாற்றங்கள் மீண்டும் நிறுத்தப்பட தேவையில்லையென்றால், நீங்கள் இதனை செய்ய முடியும்:
tr_tr: Düzenlenebilir modda yüklemek istiyorsanız, yani projedeki kod değişikliklerinin yeniden yüklenmesi gerekmiyorsa, bunu şu şekilde yapabilirsiniz:
vi_vn: Nếu bạn muốn cài đặt nó ở chế độ chỉnh sửa, nghĩa là việc thay đổi code trong project không yêu cầu cài đặt lại để áp dụng, bạn có thể làm được với:

source: You can then run the code examples after installing Terra. You can run the example with the following command.
bn_bn: টেরা ইনস্টল করার পরে আপনি কোডের উদাহরণগুলি চালাতে পারেন। আপনি নিম্নলিখিত কমান্ড দিয়ে উদাহরণ চালাতে পারেন।
de_de: Nachdem Terra installiert ist, kann man mit dem folgenden Befehl die Code-Beispiele ausführen.
el_gr: Στη συνέχεια μπορείτε να εκτελέσετε τα παραδείγματα κώδικα μετά την εγκατάσταση του Terra. Μπορείτε να εκτελέσετε το παράδειγμα με την ακόλουθη εντολή.
es_mx: Puede ejecutar los ejemplos de código después de instalar Terra. Puede ejecutar el ejemplo con el siguiente comando.
es_un: Puedes ejecutar los ejemplos de código después de instalar Terra. Puedes ejecutar el ejemplo con el siguiente comando.
fr_fr: Une fois l'installation terminée, vous pouvez exécuter un premier exemple de code.
id_id: Anda kemudian dapat menjalankan contoh kode setelah menginstal Terra. Anda dapat menjalankan contoh dengan perintah berikut.
it_it: È quindi possibile eseguire gli esempi di codice dopo l'installazione di Terra. È possibile eseguire l'esempio con il seguente comando.
ru_ru: После установки Terra, Вы можете запустить примеры работы с кодом. Запуск примера производится следующей командой.
sw_ke: Basi unaweza kutekeleza mifano ya misimbo baada ya kisakinisha Terra. Unaweza kutekeleza mifano kwa kutumia amri ifuatayo.
ta_in: பின்னர் டெரா நிறுவுவதற்கு பிறகு code உதாரணங்கள் இயக்கலாம். நீங்கள் பின்வரும் கட்டளையுடன் உதாரணத்தை இயக்க முடியும்.
tr_tr: Terra kurulumundan sonra kod örneklerini çalıştırabilirsiniz. Örneği aşağıdaki komutla çalıştırabilirsiniz.
vi_vn: Sau đó bạn có thể chạy các ví dụ code sau khi cài đặt Terra. Bạn có thể chạy ví dụ với command sau.

source: If you do not intend to install any other components, qiskit-terra will emit a ``RuntimeWarning`` warning that both qiskit-aer and qiskit-ibmq-provider are not installed. This is done because users commonly intend to use the additional elements, but do not realize they are not installed, or that the installation of either Aer or the IBM Quantum Provider failed for some reason. If you wish to suppress these warnings, add::
bn_bn: আপনি যদি আর কোনো উপাদান ইনস্টল না করে থাকেন তবে কিস্কিট-টেরা একটি ``RuntimeWarning`` সতর্কীকরণ দেবে যে কিস্কিট-এয়ার এবং কিস্কিট-আইবিএমকিউ-প্রোভাইডার কোনোটিই ইনস্টল করা নেই। এটি ঘটে থাকে কারণ সাধারণত ব্যবহারকারীরা অতিরিক্ত উপাদান ব্যবহার করতে চাইলেও উপলব্ধি করতে পারেননা যে হয় কোনোটিই ইনস্টল করা নেই অথবা এয়ার (Aer) বা আইবিএম কোয়ান্টাম প্রোভাইডার এর ইনস্টলেশন কোনোকারণে ব্যর্থ হয়েছে। আপনি যদি এইরূপ সতর্কীকরণ দমিত করতে চান, যুক্ত করুন::
de_de: Beabsichtigt man keine Installation von weiteren Komponenten, wird qiskit-terra eine ``RuntimeWarning`` ausgeben, dass qiskit-aer und qiskit-ibmq-provider nicht installiert sind. Dies ist beabsichtigt, da Benutzer normalerweise diese zusätzlichen Elemente verwenden wollen und nicht realisieren, dass diese noch nicht installiert sind, oder dass die Installation von Aer oder dem IBM Quantum Provider nicht funktioniert hat. Möchte man diese Warnung unterdrücken, fügt man Folgendes hinzu:
el_gr: Αν δεν σκοπεύετε να εγκαταστήσετε άλλα στοιχεία, το qiskit-terra θα εκπέμπει μια προειδοποίηση ``RuntimeWarning`` καθώς το qiskit-aer και qiskit-ibmq-δεν είναι εγκατεστημένα. Αυτό γίνεται επειδή οι χρήστες συνήθως προτίθενται να χρησιμοποιήσουν τα πρόσθετα στοιχεία, αλλά δεν συνειδητοποιούν ότι δεν έχουν εγκατασταθεί, ή ότι η εγκατάσταση είτε της Aer είτε του IBM Quantum Provider απέτυχε για κάποιο λόγο. Αν θέλετε να καταργήσετε αυτές τις προειδοποιήσεις, προσθέστε::
es_mx: Si no planea instalar algún otro componente, qiskit-terra emitirá un ``RuntimeWarning`` advirtiendo que qiskit-aer y qiskit-ibmq-provider no están instalados. Esto se hace porque los usuarios suelen utilizar ambos elementos adicionales, pero no se dan cuenta de que no están instalados o de que la instalación Aer o IBM Quantum Provider no se realizó con éxito por alguna razon. Si quiere desactivar estas advertencias, añada::
es_un: Si no planeas instalar algún otro componente, qiskit-terra emitirá un ``RuntimeWarning`` advirtiendo que qiskit-aer y qiskit-ibmq-provider no están instalados. Esto se hace porque los usuarios suelen utilizar ambos elementos adicionales, pero no se dan cuenta de que no están instalados o de que la instalación Aer o IBM Quantum Provider no se realizó con éxito por alguna razón. Si quieres desactivar estas advertencias, añade::
fr_fr: Si vous n'installez aucun composant supplémentaire, qiskit-terra émettra un avertissement (``RuntimeWarning``) vous informant que qiskit-aer et qiskit-ibmq-provider ne sont pas installés. Ceci est fait car il est fréquent que les utilisateurs souhaitent utiliser des éléments additionnels, sans réaliser qu'ils ne sont pas installés, ou que les installations de Aer ou de IBM Quantum Provider ont échoué . Si vous souhaitez ne plus avoir ce warning, ajoutez::
id_id: Jika Anda tidak menginginkan untuk menginstall komponen lain, qiskit-terra akan mengeluarkan peringatan ``RuntimeWarning`` yang menyatakan bahwa qiskit-aer dan qiskit-ibmq-provider tidak terinstall. Peringatan ini muncul karena biasanya pengguna berniat untuk menggunakan elemen-elemen tambahan, namun tidak menyadari bahwa elemen-elemen tersebut belum terinstall, atau instalasi Aer atau IBM Quantum Provider ternyata gagal. Jika Anda ingin menghilangkan peringatan ini, tambahkan::
it_it: Se non si intende installare altri componenti, qiskit-terra emetterà un avviso di ``RuntimeWarning`` per indicare che sia qiskit-aer che qiskit-ibmq-provider non sono installati. Questo avviene perché gli utenti hanno comunemente intenzione di utilizzare elementi aggiuntivi, ma non si rendono conto che questi non sono installati, o che l'installazione di Aer o dell'IBM Quantum Provider è fallita per qualche motivo. Se si desidera disabilitare questi avvisi, aggiungere::
ru_ru: Если Вы не хотите устанавливать какие-либо другие компоненты, qiskit-terra выведет ``RuntimeWarning`` - предупреждение о том, что qiskit-aer и qiskit-ibmq-provider не установлены. Это делается потому, что пользователи обычно намерены использовать дополнительные элементы, но не осознают, что они не установлены, или что установка Aer или IBM Quantum Provider завершилась ошибкой по какой-то причине. Если Вы хотите скрыть эти предупреждения, добавьте:
sw_ke: Ikiwa hautakusudia kusakinisha vifaa vingine, qiskit-terra itatoa onyo la ``RuntimeWarning`` kwamba qiskit-aer na qiskit-ibmq-provider hazijasakinishwa. Hii imefanywa kwa sababu watumiaji kwa kawaida hukusudia kutumia vifaa hivyo vya ziada lakini hawatambui kuwa havijasakinishwa au usakinishaji wa aidha Aer au IBM Quantum Provider haukufaulu kwa sababu fulani. Ukitaka kuzuia maonyo haya, ongeza::
ta_in: நீங்கள் வேறு எந்த கூறுகளையும் நிறுவுவதற்கு இல்லையென்றால், qiskit-terra ஒரு ``RuntimeWarning`` எச்சரிக்கை மற்றும் qiskit-aer மற்றும் qiskit-ibmq-வழங்குபவர் நிறுவப்படவில்லை. பயனர்கள் பொதுவாக கூடுதல் கூறுகளைப் பயன்படுத்த விரும்புவதால் இது செய்யப்படுகிறது, ஆனால் அவை நிறுவப்படவில்லை என்பதை உணரவில்லை, அல்லது Aer அல்லது IBM Quantum வழங்குநரின் நிறுவல் சில காரணங்களால் தோல்வியடைந்தது. இந்த எச்சரிகளை அழுத்தப்பட விரும்பினால், சேர்க்க::
tr_tr: Başka bir bileşen kurmak istemiyorsanız, qiskit-terra, hem qiskit-aer hem de qiskit-ibmq sağlayıcı yüklü olmadığı konusunda bir ``RunTimeWarning`` (Çalışma Zamanı Uyarısı) uyarısı verecektir. Bu, kullanıcılar genellikle ek öğeleri kullanmayı düşündükleri, ancak yüklü olmadıklarının farkında olmadıkları veya Aer veya IBM Kuantum Sağlayıcısı'nın kurulumunun bir nedenden dolayı başarısız olduğu için yapılır. Bu uyarıları gizlemek istiyorsanız, kodunuza şunu ekleyin::
vi_vn: Nếu không có ý định cài đặt bất kỳ thành phần nào khác, qiskit-terra hiện ra ``RuntimeWarning`` để cảnh báo rằng cả qiskit-aer lẫn qiskit-ibmq-provider không được cài đặt. Điều này được thực hiện bởi vì người dùng thường có ý định sử dụng thêm các elements, nhưng không nhận ra chúng không được cài đặt, hoặc việc cài đặt Aer hay IBM Quantum Provider đã thất bại vì một số lý do. Nếu bạn muốn bỏ qua những cảnh báo này, thêm::

source: before any ``qiskit`` imports in your code. This will suppress the warning about the missing qiskit-aer and qiskit-ibmq-provider, but will continue to display any other warnings from qiskit or other packages.
bn_bn: আপনার কোডে কোনোরকম ``Qiskit`` ইম্পর্টের পূর্বে। এটি অনুপস্থিত Qiskit-aer এবং Qiskit-আইবিএমকিউ-প্রোভাইডার এর সতর্কীকরণ কে দমিত করলেও Qiskit বা অন্যান্য প্যাকেজ এর সতর্কীকরণ দেখাবে।
de_de: im Code vor allen ``qiskit``-Imports hinzu. Dies unterdrückt nur die Warnung der fehlenden Pakete qiskit-aer und qiskit-ibmq-provider. Andere Warnungen von qiskit oder sonstigen Paketen erscheinen weiterhin.
el_gr: πριν από οποιαδήποτε εισαγωγή ``qiskit`` στον κώδικά σας. Αυτό θα καταστείλει την προειδοποίηση για την απουσία των qiskit-aer και qiskit-ibmq-provider, αλλά θα συνεχίσει να εμφανίζει οποιεσδήποτε άλλες προειδοποιήσεις από το qiskit ή άλλα πακέτα.
es_mx: antes de cualquier importación de paquetes ``qiskit`` en tu código. Eso suprimirá la advertencia sobre los componentes qiskit-aer y qiskit-ibmq-provider faltantes, pero seguirán mostrándose otras advertencias de qiskit u otros paquetes.
es_un: antes de cualquier importación de paquetes ``qiskit`` en tu código. Eso suprimirá la advertencia sobre los componentes qiskit-aer y qiskit-ibmq-provider faltantes, pero seguirán mostrándose otras advertencias de qiskit u otros paquetes.
fr_fr: avant chaque import ``qiskit`` dans votre code. Cela permettra de ne plus recevoir les warnings concernant qiskit-aer et qiskit-ibmq-provider, mais vous recevrez toujours les autres warnings venant de qiskit ou des autres packages.
id_id: sebelum meng-import ``qiskit`` di dalam kode Anda. Hal tersebut akan menghilangkan peringatan tentang qiskit-aer dan qiskit-ibmq-provider yang tidak tersedia, namun akan tetap menampilkan peringatan-peringatan lain dari qiskit atau paket lainnya.
it_it: prima di un qualsiasi import ``qiskit`` nel proprio codice. Questo disabiliterà gli avvisi circa i qiskit-aer e qiskit-ibmq-provider mancanti, ma continuerà a mostrare ogni altro avviso da qiskit o altri pacchetti.
ru_ru: перед тем как импортировать компоненты ``qiskit`` в код. Это скроет предупреждение об отсутствии qiskit-aer и qiskit-ibmq-provider, а другие предупреждения из qiskit или других пакетов продолжат отображаться.
sw_ke: kabla ya agiza zozote za ``qiskit`` katika msimbo wako. Huku kutazuia onyo kuhusu ukosefu wa qiskit-aer au qiskit-ibmq-provider lakini itaendelea kuonyesha maonyo mengine kutoka kwa qiskit au vifurushi vingine.
ta_in: எந்த ``qiskit`` இறக்குமதி உங்கள் குறியீட்டில். இது காணாமல் qiskit-aer மற்றும் qiskit-ibmq-வழங்குபவைப் பற்றிய எச்சரிக்கை அழுத்தி, ஆனால் qiskit அல்லது பிற தொகுப்புகளிலிருந்து வேறு எந்த எச்சரிக்கைகளையும் காட்டும்.
tr_tr: bunu kodunuza herhangi bir ``qiskit`` aktarmadan önce yapın. Bu, eksik qiskit-aer ve qiskit-ibmq sağlayıcısı hakkındaki uyarıyı bastırır, ancak qiskit veya diğer paketlerden gelen diğer uyarıları göstermeye devam eder.
vi_vn: trược khi bất cứ điều gì liên quan đến ``qiskit`` được import vào code của bạn. Điều này sẽ ngăn chặn cảnh báo về việc thiếu qiskit-aer và qiskit-ibmq-provider, nhưng vẫn sẽ các cảnh báo nào khác từ qiskit hay các package khác.

source: Installing Aer from Source
bn_bn: উৎস থেকে এয়ার ইনস্টল করুন
de_de: Installieren von Aer aus dem Quelltext
el_gr: Εγκατάσταση του Aqua από την πηγή
es_mx: Instalar Aer a partir del código fuente
es_un: Instalar Aer a partir del Código Fuente
fr_fr: Installation d'Aer à partir du code source
id_id: Menginstal Aer dari Sumber
it_it: Installare Aer dal codice sorgente
pt_un: Instalando Aer do Código Fonte
ru_ru: Установка Aer из исходного кода
sw_ke: Kusakinisha Aer Kutoka Chanzo
ta_in: மூலத்திலிருந்து Aer நிறுவப்படுகிறது
tr_tr: Kaynaktan Aer Kurulumu
vi_vn: Cài đặt Aer từ source

source: Clone the Aer repository.
bn_bn: এয়ার রিপোজিটরিটির ক্লোন বা প্রতিলিপি করুন।
de_de: Klonen Sie das Aer-Repository.
el_gr: Κλωνοποίηση του αποθετηρίου Aer.
es_mx: Clona el repositorio Aer.
es_un: Clona el repositorio Aer.
fr_fr: Cloner le dépôt Aer.
id_id: Mengkloning repositori Aer.
it_it: Effettuare la clone del repository Aer.
pt_un: Clone o repositório Aer.
ru_ru: Склонируйте репозиторий Aer.
sw_ke: Tengeneza pacha wa repo ya Aer.
ta_in: Aer களஞ்சியத்தை குளோன் செய்யுங்கள்.
tr_tr: Aer deposunu klonla.
vi_vn: Clone Aer repository.

source: Install build requirements.
bn_bn: বিল্ড করার শর্তগুলো (রিকোয়ারমেন্ট) ইন্সটল করুন।
de_de: Installieren Sie die Abhängigkeiten.
el_gr: Εγκατάσταση απαιτήσεων κατασκευής.
es_mx: Instalar los requerimientos del construcción.
es_un: Instalar los requerimientos para la construcción.
fr_fr: Installez les Pré-requis .
id_id: Instal compiler yang dibutuhkan.
it_it: Installare i requisiti di build.
pt_un: Instalar requisitos de build.
ru_ru: Установите требования для сборки.
sw_ke: Sakinisha mahitaji ya ujenzi.
ta_in: உருவாக்க தேவைகள் நிறுவவும்.
tr_tr: Oluşturma gereksinimlerini kur.
vi_vn: Cài các bản dựng cần thiết.
