Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: A minimum of **three contributors** per language are necessary for any new languages to be added, to receive official support from the administrators of the localization project.
bn_bn: নতুন ভাষা সংযুক্তিকরণের সময় কোনো আঞ্চলিক প্রকল্পের পরিচালকের থেকে অফিসিয়াল সমর্থনের জন্য, ভাষাপ্রতি অন্তত **তিনজন অবদানকারী** প্রয়োজন।
de_de: Drei Mitwirkende pro Sprache sind mindestens erforderlich, dass diese hinzugefügt wird und offizielle Unterstützung von den Administratoren des Projekts erhält.
el_gr: Απαιτούνται τουλάχιστον ** τρεις συνεισφέροντες** ανά γλώσσα για την προσθήκη οποιασδήποτε νέας γλώσσας, για να λαμβάνετε επίσημη υποστήριξη από τους διαχειριστές του έργου εντοπισμού.
es_mx: Un mínimo de **3 contribuidores** por idioma es necesario, para que el idioma sea agregado y reciba el soporte oficial de los administradores del proyecto de localización.
es_un: Un mínimo de **tres contribuidores** por idioma es necesario, para que el idioma sea agregado y reciba el soporte oficial de los administradores del proyecto de localización.
fr_fr: Un minimum de **trois contributeurs** par langue sont nécessaires pour ajouter de nouvelles langues, pour recevoir un support officiel de la part des administrateurs du projet de localisation.
id_id: Minimal **tiga kontributor** per bahasa diperlukan untuk setiap bahasa baru yang akan ditambahkan, untuk menerima dukungan resmi dari pengurus proyek lokalisasi.
it_it: Affinché un nuovo linguaggio venga aggiunto ed ottenga il supporto ufficiale da parte degli amministratori del progetto di localizzazione, è necessario un minimo di **tre collaboratori**.
pt_un: Um mínimo de **três contribuidores** por idioma são necessários para que quaisquer novos idiomas sejam adicionados e para receber o apoio oficial dos administradores do projeto de localização.
ru_ru: Для новых языков необходимо как минимум **три участника** для того, чтобы он получил официальную поддержку от администраторов проекта локализации и был добавлен.
sw_ke: Chini ya **wachangiaji watatu** kwa kila lugha wanahitajika ili lugha mpya iongezwe na kupata kuungwa mkono rasmi kutoka kwa wasimamizi wa mradi wa ujanibishaji.
ta_in: ஒரு குறைந்தபட்சம் **மூன்று பங்களிப்புக்கள்** ஒன்று ஒரு மொழி தேவைப்படும் எந்த புதிய மொழிகளுக்கு சேர்க்கப்படுவதற்கு தேவையிட, உளவியல் திட்டத்தின் நிர்வாகிகள் இருந்து அதிகாரப்பூர்வு ஆதரவு பெறவும்.
tr_tr: Herhangi bir yeni dilin eklenmesinde, yerelleştirme projesinin yöneticilerinden resmi destek alabilmesi için bir dile en az **katkıda bulunan üç kişi** gereklidir.
vi_vn: Mỗi ngôn ngữ mới cần tối thiểu ** ba người đóng góp** để có thể được thêm vào danh sách và nhận hỗ trợ chính thức từ các quản trị viên của dự án dịch.

source: Among the group of contributors, a translation lead must be identified to serve as a liaison with the administrators of the localization project. The lead must contact: Yuri Kobayashi (yurik@jp.ibm.com) by email.
bn_bn: অবদানকারীদের গোষ্ঠীর মধ্যে, স্থানীয়করণ প্রকল্পের প্রশাসকদের সাথে যোগাযোগ হিসাবে কাজ করার জন্য একটি অনুবাদ নেতৃত্বকে চিহ্নিত করতে হবে। নেতা অবশ্যোযই যোগাযোগ করবে: Yuri Kobayashi (yurik@jp.ibm.com) কে, ইমেইল এর সাহায্যে।
de_de: Unter den Mitwirkenden muss ein Übersetzungsleiter identifiziert werden, der als Verbindung zu den Administratoren des localization projects dient. Dieser muss zu Yuri Kobayashi (yurik@jp.ibm.com) per E-Mail Kontakt aufnehmen.
el_gr: Μεταξύ της ομάδας των συνεισφερόντων, ένας μεταφραστικός υπεύθνυος πρέπει να αναγνωρίζεται ως σύνδεσμος με τους διαχειριστές του έργου μετάφρασης. Ο υπεύθυνος πρέπει να έρθει σε επαφή: Γιούρι Κομπαγιάσι (yurik@jp.ibm.com) μέσω email.
es_mx: Entre el grupo de contribuyentes, se debe identificar un líder de traducción para que sirva de enlace con los administradores del proyecto de localización. El líder debe contactar a: Yuri Kobayashi (yurik@jp.ibm.com) por correo electrónico.
es_un: Entre el grupo de contribuyentes, se debe identificar un líder de traducción para que sirva de enlace con los administradores del proyecto de localización. El líder debe contactar a: Yuri Kobayashi (yurik@jp.ibm.com) por correo electrónico.
fr_fr: Au sein du groupe de contributeurs, un responsable de la traduction doit être identifié pour servir de liaison avec les administrateurs du projet de localisation. Le responsable doit contacter: Yuri Kobayashi (yurik@jp.ibm.com) par courriel.
id_id: Di antara kelompok kontributor, pemimpin penerjemah harus diidentifikasi yang berfungsi sebagai penghubung dengan para pengurus proyek setempat. Pemimpin ini harus menghubungi: Yuri Kobayashi (yurik@jp.ibm.com) melalui email.
it_it: All'interno del gruppo di collaboratori, dovrà essere identificato un responsabile di traduzione che funga da intermediario con gli amministratori del progetto di localizzazione. Il responsabile dovrà contattare: Yuri Kobayashi (yurik@jp.ibm.com) via email.
pt_un: Entre o grupo de contribuidores, um líder de tradução deve ser identificado para servir como uma ligação com os administradores do projeto de localização. O líder deve contatar: Yuri Kobayashi (yurik@jp.ibm.com) por e-mail.
ru_ru: Среди участников проекта следует выделить руководителя перевода, который будет служить связующим звеном с администраторами проекта локализации. Руководитель должен связаться с Yuri Kobayashi (yurik@jp.ibm.com) по электронной почте.
sw_ke: Kati ya kundi la wachangiaji, kiongozi wa utafsiri lazima atambulike ili kutumika kama kiunganishi na wasimamizi wa mradi wa ujanibishaji. Kiongozi lazima awasiliane na: Yuri Kobayashi (yurik@jp.ibm.com) kwa barua pepe.
ta_in: பங்களிப்பாளர்களின் குழுவில், உள்ளூர்மயமாக்கல் திட்டத்தின் நிர்வாகிகளுடன் தொடர்பு கொள்ள ஒரு மொழிபெயர்ப்பு முன்னணி அடையாளம் காணப்பட வேண்டும். முன்னணி தொடர்பு கொள்ள வேண்டும்: Yuri Kobayashi (yurik@jp.ibm.com) மின்னஞ்சல் மூலம்.
tr_tr: Katkıda bulunan kişilerin grubu arasında, yerelleştirme projesinin yöneticileriyle irtibatta olacak kişi olarak hizmet edecek bir tercüman liderinin tanımlanması gerekir. Liderin email yolu ile iletişime geçmesi gereklidir: Yuri Kobayashi (yurik@jp.ibm.com).
vi_vn: Trong nhóm dịch, cần phải xác định được một người quản lý để có thể liên lạc với quản trị viên của nhóm dịch. người quản lý phải liên lạc với: Yuri Kobayashi (yurik@jp.ibm.com) bằng email.

source: In the `Qiskit-Docs <https://crowdin.com/project/qiskit-docs>`__ Crowdin project, choose the language that you want to contribute to.
bn_bn: `Qiskit-Docs <https://crowdin.com/project/qiskit-docs>`__ ক্রাউডিন প্রকল্পে বেছে নিন কোন ভাষায় আপনি অবদান করবেন।
de_de: Wählen Sie im Projekt "Qiskit-Docs <https://crowdin.com/project/qiskit-docs>` __ Crowdin" die Sprache aus, zu der Sie einen Beitrag leisten möchten.
el_gr: Στο έργο " Qiskit-Docs <https://crowdin.com/project/qiskit-docs>` __ Crowdin, επιλέξτε τη γλώσσα στην οποία θέλετε να συνεισφέρετε.
es_mx: En el proyecto `Qiskit-Docs <https://crowdin.com/project/qiskit-docs>`__ Crowdin, elija el idioma al que desea contribuir.
es_un: En el proyecto `Qiskit-Docs <https://crowdin.com/project/qiskit-docs>`__ Crowdin, elige el idioma al que deseas contribuir.
fr_fr: Dans le projet Qiskit-Docs <https://crowdin.com/project/qiskit-docs>` __ Crowdin, choisissez la langue à laquelle vous souhaitez contribuer.
id_id: Dalam proyek `Qiskit-Docs <https://crowdin.com/project/qiskit-docs>`__ Crowdin, pilih bahasa yang ingin Anda kontribusikan.
it_it: All'interno del progetto `Qiskit-Docs <https://crowdin.com/project/qiskit-docs>`__, scegliere il linguaggio al quale si vuole contribuire.
pt_un: No projeto `Qiskit-Docs <https://crowdin.com/project/qiskit-docs>` __ Crowdin, escolha o idioma para qual você deseja contribuir.
ru_ru: В Crowdin проекте `Qiskit-Docs <https://crowdin.com/project/qiskit-docs>`__ выберете язык, с переводом на который Вы хотите работать.
sw_ke: Katika mradi wa Crowdin wa `Qiskit-Docs <https://crowdin.com/project/qiskit-docs>`__, chagua lugha ambayo ungependa kuchangia kwake.
ta_in: `Qiskit-Docs <https://crowdin.com/project/qiskit-docs>`_ Crowdin திட்டத்தில், நீங்கள் பங்களிப்பதற்கு விரும்பும் மொழியை தேர்ந்தெடுக்கவும்.
tr_tr: `Qiskit-Docs <https://crowdin.com/project/qiskit-docs>` __ Crowdin projesi içinde katkı sağlamak istediğiniz dili seçiniz.
vi_vn: Ở trong dự án Crowdin `Qiskit-Docs <https://crowdin.com/project/qiskit-docs>`__, hãy chọn ngôn ngữ bạn muốn đóng góp.

source: As mentioned in the blog post, `Qiskit in my language is Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>`__, we want to make sure that translated languages have enough community support to build a translation team with translators, proofreaders, and translation leads. If you want to be a translation lead or would be willing to join a new translation project team, you can open a `GitHub issue <https://github.com/qiskit-community/qiskit-translations/issues/new/choose>`__ to start a discussion with the Qiskit team and recruit translation project members.
bn_bn: `Qiskit in my language is Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>`__ ব্লগপোস্ট অনুযায়ী, অনুবাদকৃত ভাষাগুলোর জন্য যাতে পর্যাপ্ত পরিমাণ অনুবাদক, সংশোধক এবং অনুবাদ পরিচালক থাকেন তা নিশ্চিত করতে হবে। আপনি যদি অনুবাদ পরিচালনা করতে চান বা কোনো নতুন অনুবাদ প্রকল্পে যুক্ত হতে চান তবে Qiskit টিমের সাথে আলোচনা ও নতুন সদস্য নিয়োগ করার জন্য একটি `GitHub issue <https://github.com/qiskit-community/qiskit-translations/issues/new/choose>`__ খুলতে পারেন।
de_de: Wie im Blogbeitrag `Qiskit in my language is Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>`__ beschrieben, möchte man sicherstellen, dass eine übersetzte Sprache genug Unterstützung aus der Community hat, um ein Team aus Übersetzern, Korrekturlesern und Übersetzungsleitern zusammenzustellen. Als potentieller Übersetzungsleiter einer Sprache, oder Freiwilliger für ein neues Übersetzungsteam, öffnet man dazu einen Github Issue <https://github.com/Qiskit/qiskit/issues>`__ um eine Diskussion mit dem Qiskit Team zu starten und Mitwirkende für das Übersetzungsprojekt zu gewinnen.
el_gr: Όπως αναφέρθηκε στο blog post, " Qiskit στη γλώσσα μου είναι Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>` __, θέλουμε να βεβαιωθείτε ότι οι μεταφρασμένες γλώσσες έχουν αρκετή κοινοτική υποστήριξη για να οικοδομήσουμε μια ομάδα μεταφράσεων με μεταφραστές, διορθωτές, και μετάφραση οδηγεί. Αν θέλετε να είστε ένα μεταφραστικό στοιχείο ή θα ήταν πρόθυμοι να ενταχθούν σε μια νέα ομάδα έργου μετάφραση, μπορείτε να ανοίξετε ένα ` GitHub έκδοση <https://github.com/qiskit-community/qiskit-translations/issues/new/choose>` __ για να ξεκινήσετε μια συζήτηση με την ομάδα Qiskit και να προσλάβουν τα μέλη του έργου μεταφράσεων.
es_mx: Como es mencionado en la publicación del post, '`Qiskit in my language is Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>`__, debemos asegurarnos que los idiomas traducidos tienen la comunidad suficiente de soporte para construir un equipo de traducción, correctores, y líderes de traducción. Si desea ser un líder de traducción o está interesado en unirse a un nuevo equipo de proyecto de traducción, puede abrir un `GitHub issue <https://github.com/qiskit-community/qiskit-translations/issues/new/choose>`__ para empezar un debate con el equipo de Qiskit y reclutar miembros del proyecto de traducción.
es_un: Como es mencionado en la publicación del post, '`Qiskit in my language is Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>`__, debemos asegurarnos que los idiomas traducidos tienen la comunidad suficiente de soporte para construir un equipo de traducción, correctores, y líderes de traducción. Si deseas ser un líder de traducción o está interesado en unirse a un nuevo equipo de proyecto de traducción, puedes abrir un `GitHub issue <https://github.com/qiskit-community/qiskit-translations/issues/new/choose>`__ para empezar un debate con el equipo de Qiskit y reclutar miembros del proyecto de traducción.
fr_fr: Comme il est précisé dans `Qiskit in my language is Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>`__, nous souhaitons nous assurer que les langages ajoutés disposent d'un support fort de la communauté, avec des traducteurs, des correcteurs et des responsables de traduction. Si vous souhaitez devenir responsable de traduction (lead) ou si vous souhaitez vous joindre à une équipe de traduction, ouvrez un `ticket Github <https://github.com/Qiskit/qiskit-translations/issues/new/choose>`__ pour initier une discussion et recruter de nouveaux participants.
id_id: Seperti yang disebutkan dalam pos blog `Qiskit dalam bahasa saya adalah Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>`__, kami ingin memastikan bahwa bahasa terjemahan memiliki dukungan komunitas yang cukup untuk membangun sebuah tim penerjemah dengan penerjemah, korektor, dan pimpinan terjemahan. Jika Anda ingin menjadi seorang pimpinan terjemahan atau bersedia untuk bergabung dengan sebuah tim proyek penerjemahan baru, Anda dapat membuka sebuah `isu GitHub <https://github.com/qiskit-community/qiskit-translations/issues/new/choose>`__ untuk memulai sebuah diskusi dengan tim Qiskit dan merekrut anggota proyek penerjemahan.
it_it: Come indicato nel post del blog `Qiskit in My Language is Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>`__, ci si vuole assicurare che i linguaggi tradotti abbiano sufficiente supporto della comunità per costruire un team di traduzione composto da traduttori, correttori, e responsabili di traduzione. Per diventare un responsabile di traduzione o se si desidera partecipare ad un nuovo team di un progetto di traduzione, è possibile aprire una `GitHub issue <https://github.com/qiskit-community/qiskit-translations/issues/new/choose>`__ per avviare una discussione con il team Qiskit e reclutare membri del progetto di traduzione.
pt_un: Como mencionado no post do blog, `Qiskit no meu idioma é Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>`__, queremos ter certeza de que os idiomas traduzidos têm suporte comunitário suficiente para construir uma equipe de tradução com tradutores, revisores e líderes de tradução. Se você quiser ser um líder de tradução ou estiver disposto a se juntar a uma nova equipe de projeto de tradução, você pode abrir uma `Issue GitHub <https://github.com/qiskit-community/qiskit-translations/issues/new/choose>`__ para começar uma discussão com a equipe do Qiskit e recrutar membros do projeto de tradução.
ru_ru: Как уже упоминалось в блог посте `Qiskit in my language is Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>`__, мы хотим убедиться, что языки имеют достаточную поддержку для создания команды переводчиков, корректоров и руководителей команд. Если Вы хотите быть руководителем команды переводчиков или же хотите вступить в команду, Вы можете открыть `задачу на GitHub <https://github.com/qiskit-community/qiskit-translations/issues/new/choose>`__, чтобы начать обсуждение с командой Qiskit и найти участников для работы над переводом.
sw_ke: Kama ilivyoelezwa katika chapisho la blogi la `Qiskit in my language is Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>`__, tunataka kuhakikisha kuwa lugha zilizotafsiriwa zina msaada wa jamii wa kutosha kujenga timu ya watafsiri, wasomaji uthibitishaji na viongozi wa utafsiri. Ikiwa unataka kuwa kiongozi wa utafsiri au ungependa kujiunga na timu mpya ya mradi wa kutafsiri, unaweza kufungua `suala la GitHub <https://github.com/qiskit-community/qiskit-translations/issues/new/choose>`__ ili kuanza majadiliano na timu ya Qiskit na kusajili wanachama wa mradi wa kutafsiri.
ta_in: வலைப்பதிவு இடுகையில் குறிப்பிட்டுள்ளபடி, `எனது மொழியில் Qiskit என்பது Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>`__, மொழிபெயர்க்கப்பட்ட மொழிகள் என்பதை உறுதிப்படுத்த விரும்புகிறோம் மொழிபெயர்ப்பாளர்கள், ப்ரூஃப் ரீடர்கள் மற்றும் மொழிபெயர்ப்பு வழிவகைகளுடன் மொழிபெயர்ப்புக் குழுவை உருவாக்க போதுமான சமூக ஆதரவு உள்ளது. நீங்கள் ஒரு மொழிபெயர்ப்புத் தலைவராக இருக்க விரும்பினால் அல்லது புதிய மொழிபெயர்ப்பு திட்டக் குழுவில் சேர விரும்பினால், நீங்கள் ஒரு `GitHub சிக்கலைத் திறக்கலாம் <https://github.com/qiskit-community/qiskit-translations/issues/new/choose>`__ Qiskit குழுவுடன் கலந்துரையாடலைத் தொடங்கவும், மொழிபெயர்ப்பு திட்ட உறுப்பினர்களை நியமிக்கவும்.
tr_tr: Blog gönderisinde belirtildiği gibi, (Qiskit, Benim Dilimde de Qiskit) `Qiskit in my language is Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>`__, Çevrilen dillerin tercümanlar, düzeltmenler ve tercüman liderleri ile birlikte bir çeviri ekibi oluşturmak için yeterli topluluk desteğine sahip olduğundan emin olmak istiyoruz. Eğer bir tercüman lideri olmak istiyorsanız ya da yeni bir çeviri ekibine katılmaya istekli olacaksınız, Qiskit ekibi ile görüşme başlatmak ve çeviri ekibi üyelerini güçlendirmek için bir `GitHub issue <https://github.com/qiskit-community/qiskit-translations/issues/new/choose>`__ açabilirsiniz.
vi_vn: Như đã được đề cập đến bài đăng ở blog,, `Qiskit in my language is Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>`__, chúng tối muốn chắc chắn rằng mỗi ngôn ngữ có đủ sự đóng góp của cộng đồng để có thể xây dựng một đội dịch với người dịch, người hiệu đính và người quản lý. Nếu bạn muốn trở thành người quản lý hoặc muốn gia nhập một đội dịch mới, bạn có thể mở một `GitHub issue <https://github.com/qiskit-community/qiskit-translations/issues/new/choose>`__ để có thể thảo luận với nhóm Qiskit và tuyển các thành viên cho dự án dịch.

source: Click the **Join** button and **paste the URL of your PR** in the dialog box where you are asked why you want to join the Crowdin project.
bn_bn: **জয়েন** বোতামটি টিপুন এবং যেখানে আপনি কেন ক্রাউডিন প্রকল্পে অংশগ্রহণ করতে চাইছেন জানতে চাওয়ার ডায়লগ বক্সটি আসবে তার ভিতরে **আপনার PR এর ইউ আর এল (URL) টি পেস্ট করেন**।
de_de: Nachdem **Join** angeklickt wurde **kopiert man die Pull-Request-URL** in das Nachrichtenfeld, in dem man gefragt wird, warum man dem Crowdin Projekt beitreten möchte.
el_gr: Πατήστε το κουμπί **Join** και **επικόλληση του URL του PR σας** στο παράθυρο διαλόγου, όπου θα ερωτηθείτε γιατί επιθυμείτε να συμμετάσχετε στο έργο του Crowdin.
es_mx: Haz click en el botón **Unirse** (Join) y **pega la URL de tu PR** en el cuadro de diálogo en el que se te pregunta por qué quieres unirte al proyecto de Crowdin.
es_un: Haz click en el botón **Unirse** (Join) y **pega la URL de tu PR** en el cuadro de diálogo en el que se te pregunta por qué quieres unirte al proyecto de Crowdin.
fr_fr: Cliquez sur **Join** et **copiez l'URL de votre PR** dans la boite de dialogue apparaissant pour vous demander les raisons de votre contribution au projet Crowdin.
id_id: Klik tombol **Join** dan **paste URL dari PR** Anda di kotak dialog di mana Anda ditanya mengapa Anda ingin bergabung dengan proyek Crowdin.
it_it: Cliccare il pulsante **Join** e **copiare la URL della richiesta di pull** nella finestra di dialogo in cui viene richiesto il motivo per cui si desidera partecipare al progetto Crowdin.
pt_un: Clique no botão **Join** e **cole a URL do seu PR** na caixa de diálogo em que você é perguntado por que você quer se juntar ao projeto Crowdin.
ru_ru: Нажмите на кнопку **Join** и **paste the URL of your PR** в диалоговом окне, где Вас спросят, почему Вы хотите присоединиться к проекту Crowdin.
sw_ke: Bonyeza kitufe cha **Jiunge** na **bandika URL ya PR yako** kwenye kisanduku cha mazungumzo ambapo unaulizwa mbona unataka kujiunga na mradi wa Crowdin.
ta_in: Crowdin திட்டத்தில் நீங்கள் ஏன் சேர விரும்புகிறீர்கள் என்று கேட்கப்படும் உரையாடல் பெட்டியில் **Join** button னைக் கிளிக் செய்து **paste the URL of your PR**.
tr_tr: **Join(Katıl)** butonuna tıklayın ve neden Crowdin projesine katılmak istediğinizin sorulduğu yerdeki diyalog kutusuna **PR'inizin URL'sini yapıştırın**.
vi_vn: Ấn nút **Join** và dán đường dẫn (URL) pull request (PR) của bạn ở trong hộp thoại hỏi lí do bạn muốn tham gia dự án Crowdin.

source: The administrators of the Crowdin project will review your request and give you access as quickly as they can.
bn_bn: ক্রাউডিন প্রকল্পের প্রশাসকরা আপনার অনুরোধটি পর্যালোচনা করবে এবং যত তাড়াতাড়ি সম্ভব আপনাকে অ্যাক্সেস দেবে।
de_de: Die Administratoren des Crowddin-Projekts werden Ihre Anfrage überprüfen und Ihnen so schnell wie möglich Zugriff ermöglichen.
el_gr: Οι διαχειριστές του έργου του Crowdin θα αναθεωρήσουν τα αιτήματα και θα σας δώσουν πρόσβαση το ταχύτερο δυνατόν.
es_mx: Los administradores del proyecto Crowdin revisarán su solicitud y le darán acceso tan pronto como sea posible.
es_un: Los administradores del proyecto Crowdin revisarán tu solicitud y te darán acceso tan pronto como sea posible.
fr_fr: Les administrateurs du projet Crowdin examineront votre demande et vous donneront accès aussi rapidement que possible.
id_id: Para administrator proyek Crowdin akan meninjau permintaan Anda dan memberi Anda akses secepat yang mereka bisa.
it_it: Gli amministratori del progetto Crowdin esamineranno la richiesta e forniranno l'accesso il più rapidamente possibile.
pt_un: Os administradores do projeto Crowdin revisarão sua solicitação e concederão acesso o mais rápido possível.
ru_ru: Администраторы проекта Crowdin рассмотрят Ваш запрос и предоставят Вам доступ как можно скорее.
sw_ke: Wasimamizi wa mradi wa Crowdin watakagua ombi lako na kukupa ufikiaji haraka iwezekanavyo.
ta_in: Crowdin திட்டத்தின் நிர்வாகிகள் உங்கள் கோரிக்கையை சரிபார்த்து விரைவில் விரைவாக அணுக முடியும்.
tr_tr: Crowdin projesi yöneticileri sizin isteğinizi gözden geçirecek ve size verebildikleri kadar çabuk bir şekilde erişim verecekler.
vi_vn: Các quản trị viên của dự án Crowdin sẽ đánh giá và duyệt yêu cầu của bạn nhanh nhất có thể.

source: Building from Source
bn_bn: সোর্স বা উৎস থেকে গঠন করা
de_de: Aus Quellcode kompilieren
el_gr: Χτίζοντας από την πηγή
es_mx: Construyendo con Código Fuente
es_un: Construcción a partir del Código Fuente
fr_fr: Traduire depuis la documentation source
id_id: Membangun dari Sumber
it_it: Effettuare la build dal codice sorgente
pt_un: Build a partir do código-fonte
ru_ru: Сборка из исходного кода
sw_ke: Kujenga Kutoka Chanzo
ta_in: ஆதாரத்திலிருந்து உருவாக்குவது
tr_tr: Kaynaktan oluşturma
vi_vn: Xây dựng từ nguồn
