Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: Some of these options are not platform-specific. These particular platforms are listed because they are commonly used in the environment. Refer to the tool documentation for more information.
bn_bn: এর মধ্যে কয়েকটি বিকল্প প্ল্যাটফর্ম-নির্দিষ্ট নয়। এই নির্দিষ্ট প্ল্যাটফর্মগুলি তালিকাভুক্ত করা হয় কারণ এগুলি সাধারণত কর্মপরিবেশে (এনভায়রনমেন্ট) ব্যবহৃত হয়। আরও তথ্যের জন্য সরঞ্জাম (টুল) ডকুমেন্টেশন দেখুন।
de_de: Manche dieser Optionen sind nicht plattformspezifisch. Die entsprechenden Plattformen sind aufgeführt, weil sie meistens dort genutzt werden. In der jeweiligen Dokumentation des Tools findet man bei Bedarf weitere Informationen.
el_gr: Κάποιες από αυτές τις επιλογές δεν είναι συγκεκριμένα για την πλατφόρμα. Αυτές οι συγκεκριμένες πλατφόρμες αναφέρονται επειδή συνήθως χρησιμοποιούνται στο περιβάλλον. Ανατρέξτε στο εγχειρίδιο του εργαλείου για περισσότερες πληροφορίες.
es_mx: Algunas de estas opciones no son específicas de la plataforma. Estas plataformas particulares están enumeradas porque son comúnmente usadas en el entorno. Consulte la documentación de la herramienta para obtener más información.
es_un: Algunas de estas opciones no son específicas de la plataforma. Estas plataformas particulares están enumeradas porque son comúnmente usadas en el entorno. Consulte la documentación de la herramienta para obtener más información.
fr_fr: Certaines de ces options ne sont pas spécifiques à une plateforme. Ces plateformes spécifiques sont répertoriées parce qu'elles sont couramment utilisées dans l'environnement. Pour plus d'informations, reportez-vous à la documentation de l'outil.
id_id: Beberapa pilihan ini tidak spesifik terhadap platform yang digunakan. Platform-platform tertentu ini terdaftar karena mereka biasa digunakan pada environment. Silahkan mengacu kepada dokumentasi tool untuk informasi lebih lanjut.
it_it: Alcune di queste opzioni non sono specifiche per una sola piattaforma. Inoltre, sono state elencate queste piattaforme perché tra le più comunemente utilizzate. Per ulteriori informazioni, fare riferimento alla documentazione dello specifico strumento.
pt_un: Algumas dessas opções não são específicas da plataforma. Essas plataformas em particular são listadas porque são comumente usadas no ambiente. Consulte a documentação da ferramenta para obter mais informações.
ru_ru: Некоторые из этих опций не зависят от платформы. Эти платформы перечислены, потому что они часто используются. Обратитесь к документации конкретного инструмента для получения дополнительной информации.
sw_ke: Baadhi ya chaguzi hizi sio maalum kwa platform. Platform hizi zimeorodheshwa kwa kuwa zinatumiwa kwa kawaida katika mazingira haya. Rejelea nyaraka kwa habari zaidi.
ta_in: இந்த விருப்பங்களில் சில மேடையில் குறிப்பிட்டவை அல்ல. இந்த குறிப்பிட்ட தளங்கள் பட்டியலிடப்பட்டுள்ளன, ஏனெனில் அவை பொதுவாக சூழலில் பயன்படுத்தப்படுகின்றன. மேலும் தகவலுக்கு கருவி ஆவணங்களைப் பார்க்கவும்.
tr_tr: Bu seçeneklerin bazıları platforma özgü değildir. Bu özel platformlar, ortamda yaygın olarak kullanıldığı için listelenmiştir. Daha fazla bilgi için araç belgelendirmelerine bakınız.
vi_vn: Một vài tùy chọn trên không thuộc về nên tảng nào cả. Các nền tảng trên được liệt kê vì chúng được sử dụng phổ biến. Tham khảo tài liệu để biết thêm thông tin.

source: Installing Ignis from Source
bn_bn: সোর্স বা উৎস থেকে ইগ্নিস ইন্সটলকরণ
de_de: Installieren von Ignis aus dem Quelltext
el_gr: Εγκατάσταση του Ignis από την πηγή
es_mx: Instalar Ignis desde código fuente
es_un: Instalar Ignis a partir del Código Fuente
fr_fr: Installation d'Ignis à partir du code source
id_id: Memasang Ignis dari Sumber
it_it: Installare Ignis dal codice sorgente
pt_un: Instalando Ignis a partir do Código Fonte
ru_ru: Установка Ignis из исходного кода
sw_ke: Kusakinisha Ignis Kutoka Chanzo
ta_in: மூலத்திலிருந்து Ignis நிறுவப்படுகிறது
tr_tr: Kaynaktan Ignis Kurulumu
vi_vn: Cài đặt Ignis từ nguồn

source: Clone the Ignis repository.
bn_bn: ইগ্নিস রিপোজিটরিটির ক্লোন বা প্রতিলিপি করুন।
de_de: Klonen Sie das Ignis-Repository.
el_gr: Κλωνοποιήστε το αποθετήριο του Ignis.
es_mx: Clonar el repositorio de Ignis.
es_un: Clonar el repositorio de Ignis.
fr_fr: Clonez le dépôt Ignis.
id_id: Kloning repositori Ignis.
it_it: Clonare il repository Ignis.
pt_un: Clone o repositório Ignis.
ru_ru: Клонируйте репозиторий Ignis.
sw_ke: Tengeneza pacha wa repo ya Ignis.
ta_in: Ignis களஞ்சியத்தை க்ளோன் செய்யுங்கள்.
tr_tr: Ignis deposunu klonla.
vi_vn: Clone Ignis repository.

source: Cloning the repository creates a local directory called ``qiskit-ignis``.
bn_bn: রিপোজিটিরিটি ক্লোন বা প্রতিলিপি করায় ``qiskit-ignis`` নামে একটি স্থানীয় ডিরেক্টরি তৈরি হবে।
de_de: Klonen des Repository erzeugt einen lokalen Ordner namens ``qiskit-ignis``.
el_gr: Η κλωνοποίηση του αποθετήριου δημιουργεί ένα τοπικό φάκελο με το όνομα ``qiskit-ignis``.
es_mx: Clonar el repositorio crea un directorio local llamado ``qiskit-ignis``.
es_un: Clonar el repositorio crea un directorio local llamado ``qiskit-ignis``.
fr_fr: Cloner le dépôt crée un répertoire local appelé ``qiskit-ignis``.
id_id: Mengkloning repositori akan membuat sebuah folder lokal bernama ``qiskit-ignis``.
it_it: La clonazione del repository crea una cartella locale denominata ``qiskit-ignis``.
pt_un: O clone do repositório cria uma pasta local chamada ``qiskit-ignis``.
ru_ru: Клонирование репозитория создает локальную папку с названием ``qiskit-ignis``.
sw_ke: Kutengeneza pacha wa repo huunda folda ya kienyeji inayoitwa ``qiskit-ignis``.
ta_in: களஞ்சியத்தை குளோன் செய்வது ``qiskit-ignis`` என்ற உள்ளூர் கோப்பகத்தை உருவாக்குகிறது.
tr_tr: Deponun klonlanması, ``qiskit-ignis`` adlı yerel bir dizin oluşturur.
vi_vn: Việc clone repository sẽ tạo nên một thư mục có tên ``qiskit-ignis``.

source: If you want to run tests or linting checks, install the developer requirements. This is not required to install or use the qiskit-ignis package when installing from source.
bn_bn: যদি আপনি পরীক্ষা চালাতে চান তাহলে ডেভেলাপার রিকোয়ারমেন্টস বা আবশ্যিক শর্তসমূহ ইন্সটল করবেন। উৎস থেকে qiskit-ignis প্যাকেজ ইন্সটল বা ব্যবহার করতে এর প্রয়োজন নেই।
de_de: Wenn Sie Tests oder Linting-Prüfungen durchführen wollen, installieren Sie die Entwicklungsabhängigkeiten. Dies ist nicht erforderlich, um das qiskit-ignis-Paket zu installieren oder zu verwenden, wenn es aus dem Quellcode installiert wird.
el_gr: Αν θέλετε να εκτελέσετε δοκιμές ή linting ελέγχους, εγκαταστήστε τις απαιτήσεις του προγραμματιστή. Αυτό δεν απαιτείται για την εγκατάσταση ή τη χρήση του πακέτου qiskit-ignis κατά την εγκατάσταση από την πηγή.
es_mx: Si quieres ejecutar las pruebas o las revisiones de lint, instala los requerimientos de desarrollador. Esto no es requerido para instalar o usar el paquete qiskit-ignis cuando se instala usando código fuente.
es_un: Si quieres ejecutar las pruebas o las revisiones de lint, instala los requerimientos de desarrollador. Esto no es requerido para instalar o usar el paquete qiskit-ignis cuando se instala a partir del código fuente.
fr_fr: Si vous souhaitez exécuter des tests ou du linting (vérification de votre code), installez les outils développeur. Il n'est pas nécessaire d'installer ou d'utiliser le package qiskit-ignis lors de l'installation à partir du code source.
id_id: Jika Anda ingin menjalankan tes atau melakukan pengecekan, instal persyaratan pengembang. Hal ini tidak diperlukan untuk menginstall atau menggunakan paket qiskit-ignis ketika menginstal dari sumber.
it_it: Se si desidera eseguire dei test o verificare la qualità del codice sorgente (tramite un linter), bisogna installare gli strumenti da sviluppatore. Questo processo non è tuttavia richiesto per installare o utilizzare il pacchetto qiskit-ignis durante l'installazione del codice sorgente.
pt_un: Se você quiser executar testes ou análise de código, instale os requisitos de desenvolvedor. Isso não é necessário para instalar ou usar o pacote qiskit-aqua quando efetuado a instalação a partir do código fonte.
ru_ru: Если Вы хотите запустить тесты, установите необходимые инструменты для разработчика. Необязательно использовать пакет qiskit-ignis при установке из исходного кода.
sw_ke: Ikiwa unataka kufanya majaribio au ukaguzi wa msimbo wa programu, sakinisha mahitaji ya msanidi programu. Hii haihitajiki kusanikisha au kutumia kifurushi cha qiskit-ignis wakati wa kusanikisha kutoka kwa chanzo.
ta_in: நீங்கள் சோதனைகளை இயக்க விரும்பினால், அல்லது நீக்க சோதனைகள், உருவாக்குபவர் தேவைகளை நிறுவவும். மூலத்திலிருந்து நிறுவும்போது qiskit-ignis தொகுப்பை நிறுவவும் அல்லது பயன்படுத்துவதற்கு இது தேவைப்படுகிறது.
tr_tr: Test veya programlama hataları için kontroller yürütmek istiyorsanız, geliştirici gereksinimlerini yükleyin. Kaynaktan kurulum yaparken qiskit-ignis paketini kurmak veya kullanmak için bu gerekli değildir.
vi_vn: Nếu bạn muốn thử chạy kiểm tra hoặc linting, hãy cài đặt các yêu cầu của nhà phát triển. Các yêu cầu này không nhất thiết phải cài đặt hoặc bạn hãy sử dụng gói qiskit-ignis khi cài đặt từ nguồn.

source: Install Ignis.
bn_bn: ইগ্নিস ইন্সটল করুন।
de_de: Installieren Sie Ignis.
el_gr: Εγκαταστήστε το Ignis.
es_mx: Instalar Ignis.
es_un: Instalar Ignis.
fr_fr: Installer Ignis.
id_id: Memasang Ignis.
it_it: Installare Ignis.
pt_un: Instale o Ignis.
ru_ru: Установите Ignis.
sw_ke: Sakinisha Ignis.
ta_in: Ignis ஸை நிறுவவும்.
tr_tr: Ignis'i yükle.
vi_vn: Cài đặt Ignis.

source: If you want to install it in editable mode, meaning that code changes to the project don't require a reinstall to be applied:
bn_bn: যদি আপনি এটি সম্পাদনযোগ্য মোডে ইন্সটল করতে চান, অর্থাৎ প্রকল্পে কোড পরিবর্তন হলে যেন নতুন করে ইন্সটল করতে না হয় :
de_de: Falls Sie es im editierbaren Modus - in welchem Quelltextänderungen im Projekt keine Reinstallation erfordern - installieren möchten, können Sie das mit diesem Befehl tun:
el_gr: Αν θέλετε να το εγκαταστήσετε σε τροποποιήσιμη μορφή, η οποία σημαίνει ότι οι αλλαγές του κώδικα στο έργο δεν απαιτούν να εφαρμοστεί κάποια επανεγκατάσταση:
es_mx: Si quieres instalarlo en modo editable, es decir que los cambios en el código del proyecto no necesitarán reinstalarse para ser aplicados, puedes hacerlo con:
es_un: Si quieres instalarlo en modo editable, es decir que los cambios en el código del proyecto no necesitarán reinstalarse para ser aplicados, puedes hacerlo con:
fr_fr: Si vous souhaitez l'installer en mode modifiable, ce qui signifie que les modifications de programme apportées au projet ne nécessitent pas une réinstallation:
id_id: Jika Anda ingin memasangnya pada mode pengeditan, berarti perubahan kode pada proyek tidak memerlukan instalasi ulang:
it_it: Se si desidera installarlo in modalità modificabile, il che significa che le modifiche del codice al progetto non richiedono una reinstallazione per essere applicate:
pt_un: Se você quiser, pode instalá-lo em modo editável, o que significa que as alterações no código do projeto não requerem uma reinstalação para serem aplicadas:
ru_ru: Если Вы хотите установить пакет в редактируемом режиме, который позволяет не переустанавливать пакет в случае изменения кода в проекте, Вы можете сделать это с помощью:
sw_ke: Ikiwa unataka kuisakinisha katika hali inayoweza kuhaririwa, kumaanisha kuwa mabadiliko ya misimbo ya mradi hayahitaji usakinishaji mpya utumike:
ta_in: நீங்கள் திருத்தி முறையில் நிறுத்தவேண்டுமென்றால், அந்த code மாற்றங்கள் திட்டப்பணியினை மாற்றியமைக்க தேவையிட வேண்டாம்:
tr_tr: Düzenlenebilir modda kurulum gerçekleştirmek istiyorsanız, projedeki kod değişikliklerinin yeniden yüklenmesi gerekmez:
vi_vn: Nếu bạn muốn cài đặt nó ở chế độ chỉnh sửa, nghĩa là việc thay đổi code trong dự án không yêu cầu việc cài đặt lại để áp dụng:

source: Installing Aqua from Source
bn_bn: উৎস থেকে একোয়া ইন্সটল করুন
es_mx: Instalar Aqua a partir del código fuente
id_id: Memasang Aqua dari Sumber
sw_ke: Kusakinisha Aqua Kutoka Chanzo
ta_in: மூலத்திலிருந்து Aqua நிறுவப்படுகிறது
vi_vn: Cài đặt Aqua từ nguồn

source: Clone the Aqua repository.
bn_bn: এয়ার রিপোজিটরিটির ক্লোন বা প্রতিলিপি করুন।
es_mx: Clona el repositorio de Aqua.
id_id: Lakukan kloning tempat penyimpanan Aqua.
sw_ke: Tengeneza pacha wa repo ya Aqua.
ta_in: Aqua களஞ்சியத்தை க்ளோன் செய்யுங்கள்.
vi_vn: Clone Aqua repository.

source: Cloning the repository creates a local directory called ``qiskit-aqua``.
bn_bn: রিপোজিটিরিটি ক্লোন বা প্রতিলিপি করায় ``qiskit-aqua`` নামে একটি স্থানীয় ডিরেক্টরি তৈরি হবে।
es_mx: Al clonar el repositorio se crea un directorio local llamado ``qiskit-aqua``.
id_id: Mengkloning repositori akan membuat sebuah folder lokal bernama ``qiskit-aqua``.
sw_ke: Kutengeneza pacha wa repo huunda folda ya kienyeji inayoitwa ``qiskit-aqua``.
ta_in: மறுபடியும் க்ளோனிங் ``qiskit-aqua`` எனப்படும் ஒரு உள்ளூர் அடைவை உருவாக்குகிறது.
vi_vn: Việc clone repository sẽ tạo nên một thư mục có tên ``qiskit-aqua``.

source: If you want to run tests or linting checks, install the developer requirements. This is not required to install or use the qiskit-aqua package when installing from source.
bn_bn: যদি আপনি পরীক্ষা চালাতে চান তাহলে ডেভেলাপার রিকোয়ারমেন্টস বা আবশ্যিক শর্তসমূহ ইন্সটল করবেন। উৎস থেকে qiskit-aqua প্যাকেজ ইন্সটল বা ব্যবহার করতে এর প্রয়োজন নেই।
es_mx: Si quieres ejecutar las pruebas o las revisiones de lint, instala los requerimientos de desarrollador. Esto no es requerido para instalar o usar el paquete qiskit-aqua cuando se instala usando código fuente.
id_id: Jika Anda ingin menjalankan tes atau melakukan pengecekan, instal persyaratan pengembang. Hal ini tidak diperlukan untuk menginstall atau menggunakan paket qiskit-ignis ketika menginstal dari sumber.
sw_ke: Ikiwa unataka kufanya majaribio au ukaguzi wa msimbo wa programu, sakinisha mahitaji ya msanidi programu. Hii haihitajiki kusanikisha au kutumia kifurushi cha qiskit-aqua wakati wa kusanikisha kutoka kwa chanzo.
ta_in: நீங்கள் சோதனைகளை இயக்க விரும்பினால், அல்லது நீக்க சோதனைகள், உருவாக்குபவர் தேவைகளை நிறுவவும். இது மூலத்திலிருந்து நிறுவும்போது qiskit-aqua தொகுப்பை நிறுத்தவும் அல்லது பயன்படுத்த தேவையில்லையென்றால் தேவைப்படுகிறது.
vi_vn: Nếu bạn muốn thử chạy kiểm tra hoặc linting, hãy cài đặt các yêu cầu của nhà phát triển. Các yêu cầu này không nhất thiết phải cài đặt hoặc bạn hãy sử dụng gói qiskit-aqua khi cài đặt từ nguồn.

source: Install Aqua.
bn_bn: একোয়া ইন্স্টল্ করুন.
es_mx: Instalar Aqua.
id_id: Memasang Aqua.
sw_ke: Sakinisha Aqua.
ta_in: Aqua நிறுவவும்.
vi_vn: Cài đặt Aqua.

source: Installing IBM Quantum Provider from Source
bn_bn: সোর্স বা উৎস থেকে আইবিএম কোয়ান্টাম প্রোভাইডার ইন্সটলকরণ
de_de: Installieren des IBM Quantum Provider aus dem Quelltext
el_gr: Εγκατάσταση του IBM Quantum Provider από την πηγή
es_mx: Instalar IBM Quantum Provider a partir del código fuente
es_un: Instalar IBM Quantum Provider a partir del Código Fuente
fr_fr: Installation d'IBM Quantum Provider à partir du code source
id_id: Meng-install IBM Quantum Provider dari Source
it_it: Installare l'IBM Quantum Provider da codice sorgente
pt_un: Instalando o IBM Quantum Provider a partir do Código Fonte
ru_ru: Установка IBM Quantum Provider из исходного кода
sw_ke: Kusakinisha IBM Quantum Provider Kutoka Chanzo
ta_in: மூலத்திலிருந்து IBM குவாண்டம் வழங்கியை நிறுவுகிறது
tr_tr: IBM Quantum Provider'ı Kaynaktan Yükleme
vi_vn: Cài đặt IBM Quantum Provider từ nguồn

source: Clone the qiskit-ibmq-provider repository.
bn_bn: qiskit-ibmq-provider রিপোজিটরিটির ক্লোন বা প্রতিলিপি করুন।
de_de: Klonen Sie das Repository 'qiskit-ibmq-provider'.
el_gr: Κλωνοποιήστε το αποθετήριο του qiskit-ibmq-provider.
es_mx: Clonar el repositorio qiskit-ibmq-provider.
es_un: Clonar el repositorio qiskit-ibmq-provider.
fr_fr: Cloner le dépôt qiskit-ibmq-provider .
id_id: Lakukan kloning tempat penyimpanan qiskit-ibmq-provider.
it_it: Effettuare la clone del repository qiskit-ibmq-provider.
pt_un: Clone o repositório qiskit-ibmq-provider.
ru_ru: Клонируйте репозиторий qiskit-ibmq-provider.
sw_ke: Kutengeneza pacha wa repo ya qiskit-ibmq-provider.
ta_in: Qiskit-ibmq-வழங்குபவர் களஞ்சியத்தை க்ளோன் செயப்படுகிறது.
tr_tr: Qiskit-ibmq sağlayıcı deposunu klonla.
vi_vn: Clone qiskit-ibmq-provider repository.

source: Cloning the repository creates a local directory called ``qiskit-ibmq-provider``.
bn_bn: রিপোজিটিরিটি ক্লোন বা প্রতিলিপি করায় ``qiskit-ibmq-provider`` নামে একটি স্থানীয় ডিরেক্টরি তৈরি হবে।
de_de: Klonen des Repository erzeugt einen lokalen Ordner namens ``qiskit-ibmq-provider``.
el_gr: Η κλωνοποίηση του αποθετήριου δημιουργεί ένα τοπικό φάκελο με το όνομα `` qiskit-ibmq-provider ``.
es_mx: Clonar el repositorio crea un directorio local llamado ``qiskit-ibmq-provider``.
es_un: Clonar el repositorio crea un directorio local llamado ``qiskit-ibmq-provider``.
fr_fr: Cloner le dépôt crée un répertoire local appelé ``qiskit-ibmq-provider``.
id_id: Mengkloning repositori akan membuat sebuah folder lokal bernama ``qiskit-ibmq-provider``.
it_it: Effettuando la clone del repository, si crea una cartella locale denominata ``qiskit-ibmq-provider``.
pt_un: O clone do repositório cria um diretório local chamado ``qiskit-ibmq-provider``.
ru_ru: Клонирование репозитория создает локальную папку с названием ``qiskit-ibmq-provider``.
sw_ke: Kutengeneza pacha wa repo huunda folda ya kienyeji inayoitwa ``qiskit-ibmq-provider``.
ta_in: களஞ்சியத்தை க்ளோனிங், ``qiskit-ibmq-provider`` என்று அழைக்கப்படும் ஒரு உள்ளூர் அடைவை உருவாக்குகிறது.
tr_tr: Deponun klonlanması, ``qiskit-ibmq-provider`` adlı yerel bir dizin oluşturur.
vi_vn: Nhân bản repo vào trong một thư mục tên ``qiskit-ibmq-provider``.

source: If you want to run tests or linting checks, install the developer requirements. This is not required to install or use the qiskit-ibmq-provider package when installing from source.
bn_bn: আপনি যদি পরীক্ষা চালাতে চান বা লিনটিং চেক করতে চান তাহলে ডেভেলাপার রিকোয়ারমেন্টস বা আবশ্যিক শর্তসমূহ ইন্সটল করবেন। উৎস থেকে qiskit-ibmq-provider ইন্সটল বা ব্যবহার করতে এর প্রয়োজন নেই।
de_de: Wenn Sie Tests oder Linting-Checks durchführen wollen, installieren Sie die Entwicklungsabhängigkeiten. Dies ist nicht erforderlich, um das qiskit-ibmq-Provider-Paket zu installieren oder zu verwenden, falls es aus dem Quellcode installiert wird.
el_gr: Αν θέλετε να εκτελέσετε δοκιμές ή linting ελέγχους, εγκαταστήστε τις απαιτήσεις του προγραμματιστή. Αυτό δεν απαιτείται για την εγκατάσταση ή χρήση του πακέτου qiskit-ibmq-provider κατά την εγκατάσταση από την πηγή.
es_mx: Si quieres ejecutar las pruebas o las revisiones de lint, instala los requerimientos de desarrollador. Esto no es requerido para instalar o usar el paquete qiskit-ibmq-provider cuando se instala usando código fuente.
es_un: Si quieres ejecutar las pruebas o las revisiones de lint, instala los requerimientos de desarrollador. Esto no es requerido para instalar o usar el paquete qiskit-ibmq-provider cuando se instala a partir del código fuente.
fr_fr: Si vous souhaitez exécuter des tests ou du linting (vérification de votre code), installez les outils développeur. Il n'est pas nécessaire d'installer ou d'utiliser le package qiskit-ibmq-provider lors de l'installation à partir du code source.
id_id: Jika Anda ingin menjalankan tes atau melakukan pengecekan, instal persyaratan pengembang. Hal ini tidak diperlukan untuk menginstall atau menggunakan paket qiskit-ignis ketika menginstal dari sumber.
it_it: Se si desidera eseguire dei test o verificare la qualità del codice sorgente (tramite un linter), bisogna installare gli strumenti da sviluppatore. Questo processo non è tuttavia richiesto per installare o utilizzare il pacchetto qiskit-ibmq-provider durante l'installazione del codice sorgente.
pt_un: Se você quiser executar testes ou análise de código, instale os requisitos de desenvolvedor. Isso não é necessário para instalar ou usar o pacote qiskit-ibmq-provider quando efetuado a instalação a partir do código fonte.
ru_ru: Если Вы хотите запустить тесты, установите необходимые инструменты для разработчика. Необязательно использовать пакет qiskit-ibmq-provider при установке из исходного кода.
sw_ke: Ikiwa unataka kufanya majaribio au ukaguzi wa msimbo wa programu, sakinisha mahitaji ya msanidi programu. Hii haihitajiki kusanikisha au kutumia kifurushi cha qiskit-ibmq-provider wakati wa kusanikisha kutoka kwa chanzo.
ta_in: நீங்கள் சோதனைகளை இயக்க விரும்பினால், அல்லது சோதனைகளை நீக்க, உருவாக்குபவர் தேவைகளை நிறுவவும். இது மூலத்திலிருந்து நிறுவும்போது qiskit-ibmq-வழங்குபவர் தொகுப்பை நிறுத்தவும் அல்லது பயன்படுத்த தேவையில்லையென்றால் தேவைப்படுகிறது.
tr_tr: Test veya programlama hataları için kontroller yürütmek istiyorsanız, geliştirici gereksinimlerini yükleyin. Kaynaktan kurulum yaparken qiskit-ibmq-provider paketini kurmak veya kullanmak için bu gerekli değildir.
vi_vn: Nếu bạn muốn thử chạy kiểm tra hoặc linting, hãy cài đặt các yêu cầu của nhà phát triển. Các yêu cầu này không nhất thiết phải cài đặt hoặc bạn hãy sử dụng gói qiskit-ibmq-provider khi cài đặt từ nguồn.

source: Install qiskit-ibmq-provider.
bn_bn: Qiskit-ibmq-provider ইন্সটল করুন।
de_de: Installieren Sie qiskit-ibmq-provider.
el_gr: Εγκαταστήστε το qiskit-ibmq-provider.
es_mx: Instalar qiskit-ibmq-provider.
es_un: Instalar qiskit-ibmq-provider.
fr_fr: Installez qiskit-ibmq-provider.
id_id: Instal qiskit-ibmq-provider.
it_it: Installare qiskit-ibmq-provider.
pt_un: Instalar o qiskit-ibmq-provider.
ru_ru: Установите qiskit-ibmq-provider.
sw_ke: Kusakinisha qiskit-ibmq-provider.
ta_in: Qiskit-ibmq-provider நிறுவப்பட்டது.
tr_tr: Qiskit-ibmq-provider'ı yükle.
vi_vn: Cài đặt qiskit-ibmq-provider.

source: Qiskit Versioning
bn_bn: Qiskit সংস্করণ
es_un: Control de versiones de Qiskit
fr_fr: Gestion des versions de Qiskit
pt_un: Versionamento do Qiskit
ru_ru: Поддержка версий Qiskit

source: The Qiskit project is made up of several elements each performing different functionality. Each is independently useful and can be used on their own, but for convenience we provide this repository and meta-package to provide a single entrypoint to install all the elements at once. This is to simplify the install process and provide a unified interface to end users. However, because each Qiskit element has it's own releases and versions some care is needed when dealing with versions between the different repositories. This document outlines the guidelines for dealing with versions and releases of both Qiskit elements and the meta-package.
bn_bn: Qiskit প্রকল্পটি বিভিন্ন উপাদানের সমন্বয়ে গঠিত যার প্রত্যেকটি উপাদান বিভিন্ন কার্যকারিতা সম্পাদন করে। প্রতিটি স্বাধীনভাবে দরকারী এবং তাদের নিজস্ব ব্যবহার করা যেতে পারে, কিন্তু সুবিধার জন্য আমরা এই সংগ্রহস্থল (রিপোজিটরি) এবং মেটা-প্যাকেজ প্রদান করি যাতে একসঙ্গে সমস্ত উপাদান ইনস্টল করার জন্য একটি একক এনট্রি পয়েন্ট প্রদান করা যায়। এটি ইনস্টল প্রক্রিয়াটি সহজ করা এবং শেষ ব্যবহারকারীদের জন্য একটি ইউনিফাইড ইন্টারফেস প্রদান করা। যাইহোক, প্রতিটি Qiskit উপাদানটির নিজস্ব রিলিজ এবং সংস্করণ রয়েছে, তাই বিভিন্ন সংগ্রহস্থলের মধ্যে সংস্করণগুলির সাথে কাজ করার সময় কিছু যত্ন প্রয়োজন। এই নথিপত্রটি Qiskit উপাদান এবং মেটা-প্যাকেজ উভয় সংস্করণ এবং রিলিজের সাথে মোকাবিলা করার জন্য নির্দেশিকাগুলি রূপরেখা করে।
