Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: Contributing to Qiskit
bn_bn: Qiskit এ অবদান
de_de: An Qiskit mitwirken
el_gr: Συνεισφορά στο Qiskit
es_mx: Contribuir a Qiskit
es_un: Contribuir a Qiskit
fr_fr: Contribuer à Qiskit
id_id: Kontribusi untuk Qiskit
it_it: Contribuire a Qiskit
ko_kr: Qiskit 에 기여하기
pl_pl: Twój wkład do Qiskit
pt_un: Contribuindo para o Qiskit
ru_ru: Участие в разработке Qiskit
sw_ke: Kuchangia katika Qiskit
ta_in: Qiskit-ட்டில் பங்களிப்பு
te_in: Qiskit కు సహకరిస్తున్నా
tr_tr: Qiskit'e katkıda bulunmak
vi_vn: Đóng góp vào Qiskit
zh_tw: 如何為 Qiskit 做出貢獻

source: Qiskit is an open-source project committed to bringing quantum computing to people of all backgrounds. This page describes how you can join the Qiskit community in this goal.
bn_bn: Qiskit হলো একটি মুক্ত উৎসের প্রকল্প (ওপেন সোর্স প্রজেক্ট) যা সর্বস্তরের মানুষের মাঝে কোয়ান্টাম কম্পিউটিংকে ছড়িয়ে দিতে আগ্রহী। এই পাতাটি বর্ণনা করে আপনি কিভাবে Qiskit কমিউনিটির (সংগঠন) অংশ হতে পারেন।
de_de: Qiskit ist ein Open-Source-Projekt mit dem Ziel Menschen aller Alters- und Berufsgruppen die Nutzung von Quanteninformationstechnologien zu ermöglichen. Diese Seite beschreibt wie man sich der Qiskit-Gemeinschaft anschließen kann.
el_gr: Το Qiskit είναι ένα έργο ανοιχτού κώδικα που έχει δεσμευτεί να φέρει κβαντικούς υπολογιστές σε ανθρώπους όλων των υποβάθρων. Αυτή η σελίδα περιγράφει πώς μπορείτε να συμμετάσχετε στην κοινότητα Qiskit σε αυτόν τον σκοπό.
es_mx: Qiskit es un proyecto de código abierto comprometido a hacer la computación cuántica disponible a personas de cualquier perfil de conocimiento. Esta página describe cómo puedes unirte a la comunidad de Qiskit para lograr este objetivo.
es_un: Qiskit es un proyecto de código abierto comprometido a llevar la computación cuántica a personas de cualquier perfil de conocimiento. Esta página describe cómo puedes unirte a la comunidad de Qiskit para lograr este objetivo.
fr_fr: Qiskit est un projet open-source dont l'objectif est de donner accès à l'informatique quantique à tous. Cette page décrit comment vous pouvez rejoindre la communauté Qiskit.
id_id: Qiskit adalah sebuah proyek sumber terbuka yang berkomitmen untuk membawakan komputasi kuantum kepada orang-orang dengan latar belakang apapun. Halaman ini menjelaskan bagaimana cara agar Anda dapat bergabung dengan komunitas Qiskit dalam menyukseskan tujuan ini.
it_it: Qiskit è un progetto open-source il cui obiettivo è quello di rendere accessibile la computazione quantistica a persone con background differenti. Questa pagina descrive come puoi aiutare la comunità di Qiskit a raggiungere questo obiettivo.
ko_kr: Qiskit은 다양한 배경지식을 가진 사람들이 양자 컴퓨팅을 사용할 수 있게 하는 오픈소스 프로젝트다. 이 페이지는 Qiskit 커뮤니티에 참여할 수 있는 방법을 설명한다.
pl_pl: Qiskit jest projektem typu open-source, który popularyzuje informatykę kwantową wśród ludzi z różnych środowisk. Ta strona opisuje, jak możesz dołączyć do społeczności Qiskit.
pt_un: O Qiskit é um projeto de código aberto comprometido em introduzir a computação quântica para pessoas com qualquer tipo de experiência e conhecimento em TI. Esta página descreve como você pode se juntar à comunidade Qiskit neste objetivo.
ru_ru: Qiskit - проект с открытым исходным кодом цель которого - дать людям возможность использовать квантовые вычисления. На этой странице Вы найдете информацию о том, как присоединиться к сообществу Qiskit, чтобы помочь достижению этой цели.
sw_ke: Qiskit ni mradi wa chanzo wazi unaojitolea kuleta ujuzi wa tarakilishi za kwanta kwa watu wa asili zote. Ukurasa huu unaeleza jinsi ya kujiunga na jamii ya Qiskit katika lengo hili.
ta_in: Qiskit என்பது குவாண்டம் கம்ப்யூட்டிங்-இல் எவ்வித முன் அனுபவம் இல்லா மக்களுக்கும் கொண்டு சேர்க்க உருவாக்கப்பட்ட ஒரு ஓபென்-சோர்ஸ் ப்ராஜெக்ட் ஆகும். இப்பகுதி நீங்கள் எவ்வாறு qiskit குழு -இன் மூலம் இவ்விலக்கில் சேர முடியும் என்பதை விவரிக்கும்.
te_in: Qiskit అన్ని వర్గాల జనాలకు క్వాంటమ్ కంప్యూటింగ్ అందించడానికి తోడ్పడుతున్నా ఒక ఓపెన్-సోర్స్ ప్రాజెక్ట్. ఈ లక్ష్యంలో పాలు పంచుకోవడానికి కిస్కెట్ కమ్యూనిటీలో ఎలా చేరవచ్చు అని ఈ పేజీ వర్ణిస్తుంది.
tr_tr: Qiskit, kuantum hesaplamayı her arkaplandan insana ulaştırmayı taahhüt etmiş bir açık kaynak projedir. Bu sayfa, Qiskit topluluğuna bu hedefte nasıl katılabileceğinizi tanımlar.
vi_vn: Qiskit là một dự án mã nguồn mở cam kết đưa điện toán lượng tử cho mọi người thuộc mọi nền tảng. Trang này mô tả cách bạn có thể tham gia cộng đồng Qiskit trong mục tiêu này.
zh_tw: Qiskit 是一個開源專案，致力於將量子計算帶給所有人。 此頁面說明如何加入 Qiskit 社群。

source: Where Things Are
bn_bn: সূচিপত্র
de_de: Wo sich die Qiskit-Bestandteile befinden
el_gr: Που Βρίσκονται τα Πράγματα
es_mx: Dónde encontrar el código
es_un: Dónde está el código
fr_fr: Tout est là
id_id: Tempat Menemukan Kode
it_it: Dove Sono Le Cose
pt_un: Onde as coisas estão
ru_ru: Исходный код
sw_ke: Pahali pa kupata msimbo
ta_in: பதிவுகள் எங்கே உள்ளன
tr_tr: Kodlar Nerede
vi_vn: Link quan trọng

source: The code for Qiskit is located in the `Qiskit GitHub organization <https://github.com/Qiskit>`__, where you can find the individual projects that make up Qiskit, including
bn_bn: Qiskit এর সমস্ত কোড `Qiskit GitHub organization <https://github.com/Qiskit>`__ এর সংগ্রহে রাখা আছে, যেখানে আপনি Qiskit এর প্রত্যেকটি প্রকল্প (প্রজেক্ট) পাবেন। এর সাথে আছে,
de_de: Der Qiskit Quellcode befindet sich in dem `Qiskit-Github-Repository <https://github.com/Qiskit>`__. Dort können die einzelnen Bestandteile die Qiskit ausmachen gefunden werden. Unter anderem sind dies
el_gr: Ο κώδικας για το Qiskit βρίσκεται στον οργανισμό `Qiskit GitHub <https://github.com/Qiskit>__, όπου μπορείτε να βρείτε τα μεμονωμένα έργα που συνθέτουν το Qiskit, συμπεριλαμβανομένων των
es_mx: El código Qiskit se ubica en el `repositorio GitHub de Qiskit <https://github.com/Qiskit>`__, donde puedes encontrar los proyectos individuales que conforman Qiskit, incluyendo
es_un: El código Qiskit se ubica en el `repositorio GitHub de Qiskit <https://github.com/Qiskit>`__, donde puedes encontrar los proyectos individuales que conforman Qiskit, incluyendo
fr_fr: Le code de Qiskit se trouve dans ce dépôt : `Qiskit GitHub organization <https://github.com/Qiskit>`__. Il regroupe les projets composant Qiskit, et en particulier
id_id: Kode sumber untuk Qiskit ada di `GitHub organisasi Qiskit <https://github.com/Qiskit>`__, dimana Anda dapat menemukan proyek-proyek individu yang membentuk Qiskit, termasuk
it_it: Il codice di Qiskit è disponibile alla pagina `GitHub Qiskit <https://github.com/Qiskit>`__, dove si possono trovare i progetti individuali che lo compongono, inclusi
pt_un: O código fonte para o Qiskit está localizado no site `Qiskit GitHub organization <https://github.com/Qiskit>`__, onde você pode encontrar os projetos individuais que compõem o Qiskit, incluindo
ru_ru: Исходный код Qiskit находится в `репозиториях Qiskit на GitHub <https://github.com/Qiskit>`__, где Вы найдете отдельные проекты, из которых состоит Qiskit:
sw_ke: Msimbo wa Qiskit unapatikana katika `shirika la Qiskit GitHub <https://github.com/Qiskit>`__, ambapo unaweza kupata miradi ya kibinafsi inayounda Qiskit. Miradi hiyo ni pamoja na
ta_in: Qiskit-ற்கான code Qiskit அமைப்பின் `Qiskit GitHub organization <https://github.com/Qiskit>`__, அங்கே நீங்கள் Qiskit உருவாவதர்க்கான தனித்தனி செயல்திட்டங்களை கண்டறியலாம், அதனுடன் சேர்த்து
tr_tr: Qiskit'e uygun olan kod, aşağıda yer alanlar da dahil olmak üzere Qiskit'i oluşturan bireysel projeleri bulabileceğiniz `Qiskit GitHub organization <https://github.com/Qiskit>`__ (Qiskit Github Organizasyonu)'nda yer alır
vi_vn: Code cho Qiskit nằm trong `Qiskit GitHub organization <https://github.com/Qiskit>`__, nơi bạn có thể tìm thấy các dự án cá nhân tạo nên Qiskit, bao gồm

source: `Qiskit Terra <https://github.com/Qiskit/qiskit-terra>`__
bn_bn: `Qiskit টেরা <https://github.com/Qiskit/qiskit-terra>`__

source: `Qiskit Aer <https://github.com/Qiskit/qiskit-aer>`__
bn_bn: `Qiskit এয়ার <https://github.com/Qiskit/qiskit-aer>`__

source: `Qiskit Ignis <https://github.com/Qiskit/qiskit-ignis>`__
bn_bn: `Qiskit ইগ্নিস <https://github.com/Qiskit/qiskit-ignis>`__

source: `Qiskit Aqua <https://github.com/Qiskit/qiskit-aqua>`__
bn_bn: `Qiskit অ্যাকোয়া <https://github.com/Qiskit/qiskit-aqua>`__

source: `Qiskit IBMQ Provider <https://github.com/Qiskit/qiskit-ibmq-provider>`__
bn_bn: `Qiskit IBMQ প্রোভাইডার <https://github.com/Qiskit/qiskit-ibmq-provider>`__
id_id: `Layanan IBMQ Qiskit (IBMQ Provider) <https://github.com/Qiskit/qiskit-ibmq-provider>`__
tr_tr: `Qiskit IBMQ Provider <https://github.com/Qiskit/qiskit-ibmq-provider>`__ (Qiskit IBMQ Sağlayıcısı)

source: `Qiskit Tutorials <https://github.com/Qiskit/qiskit-tutorials>`__
bn_bn: `Qiskit টিউটোরিয়ালসমূহ <https://github.com/Qiskit/qiskit-tutorials>`__
es_mx: `Tutoriales de Qiskit <https://github.com/Qiskit/qiskit-tutorials>`__
es_un: `Tutoriales de Qiskit <https://github.com/Qiskit/qiskit-tutorials>`__
fr_fr: `Tutoriels Qiskit <https://github.com/Qiskit/qiskit-tutorials>`__
id_id: `Tutorial Qiskit <https://github.com/Qiskit/qiskit-tutorials>`__
it_it: `Tutorial sul Qiskit <https://github.com/Qiskit/qiskit-tutorials>`__
ru_ru: `Руководства по Qiskit <https://github.com/Qiskit/qiskit-tutorials>`__
tr_tr: `Qiskit Tutorials <https://github.com/Qiskit/qiskit-tutorials>`__ (Qiskit Öğreticileri)

source: `Qiskit API Documentation <https://github.com/Qiskit/qiskit/tree/master/docs>`__
bn_bn: `Qiskit API বিবরণী <https://github.com/Qiskit/qiskit/tree/master/docs>`__
de_de: `Qiskit API-Dokumentation <https://github.com/Qiskit/qiskit/tree/master/docs>`__
es_mx: `Documentación de la API de Qiskit <https://github.com/Qiskit/qiskit/tree/master/docs>`__
es_un: `Documentación de la API de Qiskit <https://github.com/Qiskit/qiskit/tree/master/docs>`__
fr_fr: `La Documentation des APIs Qiskit <https://github.com/Qiskit/qiskit/tree/master/docs>`__
id_id: `Dokumentasi Antarmuka Pemrograman Aplikasi (API) Qiskit <https://github.com/Qiskit/qiskit/tree/master/docs>`__
it_it: `Documentazione delle API di Qiskit <https://github.com/Qiskit/qiskit/tree/master/docs>`__
ru_ru: `Документация по Qiskit API <https://github.com/Qiskit/qiskit/tree/master/docs>`__
tr_tr: `Qiskit API Documentation <https://github.com/Qiskit/qiskit/tree/master/docs>`__ (Qiskit API Dokümantasyonu)

source: Getting Started
bn_bn: শুরুর নির্দেশনা
de_de: Erste Schritte
el_gr: Ξεκινώντας
es_mx: Primeros pasos
es_un: Primeros Pasos
fr_fr: Comment démarrer
id_id: Memulai
it_it: Per Iniziare
pt_un: Primeiros Passos
ru_ru: С чего начать
sw_ke: Jinsi ya Kuanzia
ta_in: தொடங்குதல்
tr_tr: Başlarken
vi_vn: Bắt đầu

source: Learn how members of the Qiskit community
bn_bn: কীভাবে Qiskit ব্যবহারকারী সদস্যরা
de_de: Erfahren wie Mitglieder der Qiskit-Gemeinschaft
el_gr: Μάθετε πώς τα μέλη της κοινότητας του Qiskit
es_mx: Aprende cómo los miembros de la comunidad de Qiskit
es_un: Aprende cómo los miembros de la comunidad de Qiskit
fr_fr: Découvrez comment les membres de la communauté Qiskit
id_id: Cari tahu bagaimana para anggota komunitas Qiskit
it_it: Impara come i membri della comunità Qiskit
pt_un: Aprenda com os membros da comunidade Qiskit
ru_ru: Узнайте, как члены сообщества Qiskit
sw_ke: Jifunze jinsi washiriki wa jamii ya Qiskit wanavyo
ta_in: கற்றுக்கொள்ளுங்கள் Qiskit community உறுப்பினர்கள் எவ்வாறு
tr_tr: Qiskit topluluğunun aşağıdakileri nasıl yaptığını öğrenin
vi_vn: Tìm hiểu cách các thành viên của cộng đồng Qiskit

source: `Relate to one another <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__
bn_bn: `নিজেদের পরিচিত করবেন <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__
de_de: Verhaltensregeln <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__
el_gr: `Σχετίζονται το ένα με το άλλο <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__
es_mx: `Se relacionan entre sí <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__
es_un: `Se relacionan entre sí <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__
fr_fr: `se mettent en relation <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__
id_id: `Hubungan antar satu sama lain <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__
it_it: `Interagiscono tra loro <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__
pt_un: `Relacionando-se com a comunidade <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__
ru_ru: `Связаны друг с другом <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__
sw_ke: `Wanavyohusiana <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`
tr_tr: `Birbirlerine nasıl davranırlar <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__
vi_vn: `Liên hệ với một người khác <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__

source: `Discuss ideas <https://qiskit.slack.com/>`__
bn_bn: `নিজের ধারণা বা চিন্তাভাবনা আলোচনা করবেন <https://qiskit.slack.com/>`__
de_de: `Ideen diskutieren <https://qiskit.slack.com/>`__
el_gr: `Συζητούν ιδέες <https://qiskit.slack.com/>`__
es_mx: `Discuten ideas <https://qiskit.slack.com/>`__
es_un: `Discuten ideas <https://qiskit.slack.com/>`__
fr_fr: `échangent des idées <https://qiskit.slack.com/>`__
id_id: `Mendiskusikan ide <https://qiskit.slack.com/>`__
it_it: `Discutono idee <https://qiskit.slack.com/>`__
pt_un: `Discuta ideias <https://qiskit.slack.com/>`__
ru_ru: `Обсуждают идеи <https://qiskit.slack.com/>`__
sw_ke: `Wanavyojadili mawazo <https://qiskit.slack.com/>`__
tr_tr: `Fikirlerini nasıl tartışırlar <https://qiskit.slack.com/>`__
vi_vn: `Thảo luận về các ý tưởng<https://qiskit.slack.com/>`__

source: `Get help when we're stuck <https://quantumcomputing.stackexchange.com/questions/tagged/qiskit>`__
bn_bn: `সমস্যায় পড়লে সাহায্য পাবেন <https://quantumcomputing.stackexchange.com/questions/tagged/qiskit>`__
de_de: `Hilfe erhalten wenn man nicht weiterkommt <https://quantumcomputing.stackexchange.com/questions/tagged/qiskit>`__
el_gr: `Παίρνουν βοήθεια όταν έχουν κολλήσει <https://quantumcomputing.stackexchange.com/questions/tagged/qiskit>`__
es_mx: `Buscan ayuda cuando se atoran <https://quantumcomputing.stackexchange.com/questions/tagged/qiskit>`__
es_un: `Obtienen ayuda cuando están atascados <https://quantumcomputing.stackexchange.com/questions/tagged/qiskit>`__
fr_fr: `obtiennent de l'aide <https://quantumcomputing.stackexchange.com/questions/tagged/qiskit>`__
id_id: `Mencari bantuan ketika menemukan masalah <https://quantumcomputing.stackexchange.com/questions/tagged/qiskit>`__
it_it: `Cercano aiuto quando non riescono ad andare avanti <https://quantumcomputing.stackexchange.com/questions/tagged/qiskit>`__
pt_un: `Obtenha ajuda <https://quantumcomputing.stackexchange.com/questions/tagged/qiskit>`__
ru_ru: `Помогают друг другу решать проблемы <https://quantumcomputing.stackexchange.com/questions/tagged/qiskit>`__
sw_ke: `Pata msaada wanapolemewa <https://quantumcomputing.stackexchange.com/questions/tagged/qiskit>`
tr_tr: `Takılınca yardım almak için: <https://quantumcomputing.stackexchange.com/questions/tagged/qiskit>`__
vi_vn: `Tìm kiếm sự hỗ trợ khi gặp khó khăn<https://quantumcomputing.stackexchange.com/questions/tagged/qiskit>`__

source: `Stay informed of news in the community <https://medium.com/qiskit>`__
bn_bn: `কমিউনিটি বা সংগঠন সম্পর্কে খবরাখবর রাখবেন <https://medium.com/qiskit>`__
de_de: `Sich über Neuigkeiten in der Gemeinschaft auf dem Laufenden halten <https://medium.com/qiskit>`__
el_gr: `Μένουν ενημερωμένα για τα νέα στην κοινότητα <https://medium.com/qiskit>`__
es_mx: `Se mantienen informados con noticias de la comunidad <https://medium.com/qiskit>`__
es_un: `Se mantienen informados con las noticias de la comunidad <https://medium.com/qiskit>`__
fr_fr: `restent informés des nouveautés de la communauté <https://medium.com/qiskit>`__
id_id: `Mengikuti berita terbaru di komunitas <https://medium.com/qiskit>`__
it_it: `Si tengono informati sulle novità nella comunità <https://medium.com/qiskit>`__
pt_un: `Mantenha-se informado sobre notícias da comunidade <https://medium.com/qiskit>`__
ru_ru: `Остаются в курсе новостей сообщества <https://medium.com/qiskit>`__
sw_ke: Wanavyojijulisha kuhusu habari zinazoendelea kwenye jamii <https://medium.com/qiskit>__
tr_tr: `Topluluktaki yeniliklerden haberdar olmak için: <https://medium.com/qiskit>`__
vi_vn: `Nhận cập nhật về các thông tin mới nhất trong cộng đồng<https://medium.com/qiskit>`__

source: `Keep a consistent style <https://www.python.org/dev/peps/pep-0008>`__
bn_bn: `গুছিয়ে কোড লিখবেন <https://www.python.org/dev/peps/pep-0008>`__
de_de: `Einen einheitlichen Stil bewahren <https://www.python.org/dev/peps/pep-0008>`__
el_gr: `Κρατούν ένα σταθερό στυλ <https://www.python.org/dev/peps/pep-0008>`__
es_mx: `Matienen un estilo consistente <https://www.python.org/dev/peps/pep-0008>`__
es_un: `Mantienen un estilo consistente <https://www.python.org/dev/peps/pep-0008>`__
fr_fr: `conservent un style cohérent <https://www.python.org/dev/peps/pep-0008>`__
id_id: `Menjaga konsistensi langgam kode <https://www.python.org/dev/peps/pep-0008>`__
it_it: `Mantengono uno stile coerente <https://www.python.org/dev/peps/pep-0008>`__
pt_un: `Mantenha um estilo consistente <https://www.python.org/dev/peps/pep-0008>`__
ru_ru: `Cохраняют единый согласованный стиль кода <https://www.python.org/dev/peps/pep-0008>`__
sw_ke: Wanavyodumisha mtindo thabiti <https://www.python.org/dev/peps/pep-0008>`
tr_tr: `Tutarlı bir biçimde kod yazmak için: <https://www.python.org/dev/peps/pep-0008>`__
vi_vn: `Giữ một phong cách nhất quán<https://www.python.org/dev/peps/pep-0008>`__

source: :ref:`Build Qiskit packages from source <install_install_from_source_label>`
bn_bn: :ref:`উৎস থেকে Qiskit প্যাকেজসমূহ ইন্সটল করবেন <install_install_from_source_label>`
de_de: :ref:`Qiskit-Pakete aus dem Quelltext erzeugen <install_install_from_source_label>`
el_gr: :ref:`Κτύζουν πακέτα του Qiskit από την πηγή <install_install_from_source_label>`
es_mx: :ref:`Construyen paquetes de Qiskit desde el código fuente <install_install_from_source_label>`
es_un: :ref:`Construyen paquetes de Qiskit desde el código fuente <install_install_from_source_label>`
fr_fr: :ref:`Construisent des packages Qiskit depuis des fichiers source <install_install_from_source_label>`
id_id: :ref:`Membuat paket kode Qiskit dari sumber <install_install_from_source_label>`
it_it: :ref:`Compilano i pacchetti Qiskit dal sorgente <install_install_from_source_label>`
pt_un: :ref:`Construa pacotes Qiskit do início <install_install_from_source_label>`
ru_ru: :ref:`Устанавливают пакеты Qiskit из исходного кода <install_install_from_source_label>`
sw_ke: :ref:`Jenga vifurushi vya Qiskit kutoka chanzo <install_install_from_source_label>`
tr_tr: :ref:`Build Qiskit packages from source <install_install_from_source_label>` (Kaynaktan Qiskit paketleri oluştur.)
vi_vn: :ref: `Cài các gói Qiskit từ nguồn <install_install_from_source_label>`

source: Reporting Bugs and Requesting Enhancements
bn_bn: ত্রুটি রিপোর্ট করা এবং প্রসারণের (এনহ্যান্সমেন্ট) জন্য অনুরোধ
de_de: Bugs melden und Verbesserungen vorschlagen
el_gr: Αναφέρουν σφαλμάτων και αιτούνται για βελτιώσεις
es_mx: Informar de Errores y Proponer Mejoras
es_un: Informar de Errores y Solicitar Mejoras
fr_fr: Signaler des anomalies et faire des demandes d'amélioration
id_id: Pelaporan Bug dan Memohon Peningkatan
it_it: Riportare bug e richiedere miglioramenti
pt_un: Reportar erros e solicitar melhorias
ru_ru: Сообщить об ошибках и предложить усовершенствования
sw_ke: Kuripoti Kasoro na Kuagiza Viboreshaji
ta_in: பிழைகளைப் பற்றி புகாரளிப்பது மற்றும் விரிவாக்கத்திற்கான கோரிக்கைகளை விதிப்பது
tr_tr: Hataları Bildirme ve Geliştirme Talep Etme
vi_vn: Báo cáo bugs và yêu cầu cải tiến

source: When you encounter a problem, please open an issue in the appropriate element's issue tracker:
bn_bn: যখন আপনি সমস্যায় পড়বেন, দয়া করে যথাযথ উপাদানের ইস্যু (সমস্যা) অনুসরণ করে নতুন ইস্যু খুলুনঃ
de_de: Falls ein Problem auftritt, sollte ein Issue im entsprechenden Issue-Tracker eröffnet werden:
el_gr: Όταν αντιμετωπίζετε ένα πρόβλημα, παρακαλώ ανοίξτε ένα θέμα στο κατάλληλο στοιχείο εντοπισμού προβλημάτων:
es_mx: Si encuentras algún problema, por favor, abre un nuevo asunto en la herramienta de gestión de incidencias del elemento de Qiskit correspondiente:
es_un: Cuando encuentres un problema, abre una propuesta en el rastreador de incidencias del elemento de Qiskit correspondiente:
fr_fr: Lorsque vous rencontrez une anomalie, ouvrez un ticket (issue) dans l'outil de suivi approprié :
id_id: Ketika Anda menemukan masalah, silahkan buat laporan pada pelacak isu bidang masing-masing yang sesuai:
it_it: Quando si verifica un problema, per favore aprite una issue nel tracciatore di issue del relativo elemento:
pt_un: Ao encontrar um problema, por favor, abra um chamado na ferramenta de ticket:
ru_ru: Когда Вы столкнетесь с ошибкой, пожалуйста, создайте задачу в соответствующем трекере:
sw_ke: Unapokumbwa na tatizo, tafadhali fungua suala katika kipengee kinachofaa cha ufuatiliaji suala:
ta_in: உங்களுக்கு எப்பொழுதாவது சிக்கல்கள் எழுந்தால், தயவுசெய்து அதற்கேற்ற element's issue tracker-ல் ஒரு issue-வை உருவாக்குங்கள்:
tr_tr: Bir sorunla karşılaştığınızda, lütfen ilgili ögenin sorun izleyicisinde bir konu açın:
vi_vn: Khi bạn gặp một vấn đề, hãy mở một issue ở phần theo dõi thích hợp dưới đây:

source: Element
bn_bn: উপাদান
el_gr: Στοιχεία
es_mx: Elemento
es_un: Elemento
fr_fr: Elément
id_id: Bidang
it_it: Elemento
pt_un: Elemento
ru_ru: Пакет
sw_ke: Kipengee
ta_in: உறுப்பு
tr_tr: Öge
vi_vn: Danh mục

source: Issue Tracker
bn_bn: ইস্যু (সমস্যা) অনুসরণ
el_gr: Καταγραφές προβλημάτων
es_mx: Gestor de Incidencias
es_un: Rastreador de Incidencias
fr_fr: Outil de suivi des anomalies
id_id: Pelacak Masalah
it_it: Tracciatore di Issue
pt_un: Rastreador de Issues
ru_ru: Трекер задач
sw_ke: Kifuatilio suala
ta_in: வெளியீட்டு கண்காணிப்பு
tr_tr: Sorun İzleyici

source: qiskit-terra
bn_bn: qiskit-টেরা
vi_vn: Về qiskit-terra

source: qiskit-aer
bn_bn: qiskit-এয়ার

source: qiskit-ignis
bn_bn: qiskit-ইগ্নিস

source: qiskit-aqua
bn_bn: qiskit-অ্যাকোয়া

source: Docs or Qiskit Meta-package
bn_bn: ডকুমেন্টেশন (বিবরণী) অথবা Qiskit মেটা প্যাকেজ
de_de: Dokumente oder Qiskit Meta-Pakete
el_gr: Docs ή Qiskit Meta-package
es_mx: Documentación o Metapaquetes de Qiskit
es_un: Documentación o Metapaquetes de Qiskit
fr_fr: Documentations ou meta-package de Qiskit
id_id: Dokumentasi atau Meta-paket Qiskit
it_it: Documentazione o Qiskit Meta-package
pt_un: Docs ou Qiskit Meta-package
ru_ru: Документация или мета-пакет Qiskit
sw_ke: Nyaraka ama kifurushi cha meta cha Qiskit
ta_in: ஆவணம் அல்லது Qiskit மெட்டா தொகுப்பு
tr_tr: Belgeler ya da Qiskit Meta Paketi
vi_vn: Về tài liệu hoặc các gói Qiskit Meta
