Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: Note that this delay is a minimum. For significant features, it is recommended that the deprecated feature appears for at least double that time. Also, per the stable branch policy, deprecation removals can only occur during minor version releases; they are not appropriate for backporting.
bn_bn: উল্লেখ্য যে, এই বিরতির সময়টি অল্প। নির্দিষ্ট ফিচারের জন্য, অপসারণকৃত ফিচারটিকে এর দ্বিগুণ সময় বহাল রাখা প্রয়োজন। স্টেবল ব্রাঞ্চ পলিসি বা স্থিতিশীল শাখা নীতি অনুযায়ী, যদিও ব্যাকপোর্টিংয়ের জন্য উপযুক্ত নয়, ডেপ্রিকেশন (অপসারণ) বাদ দেয়া কেবল গৌণ সংস্করণের সময় ঘটতে পারে।
de_de: Dieser Zeitraum ist jedoch nur ein Minimum. Für wichtige Features sollte es mindestens der doppelte Zeitraum sein. Außerdem können Deprecated-Features nach dem Stable-Branch-Prinzip nur bei Minor-Version-Releases entfernt werden; sie sind nicht zur Rückportierung geeignet.
es_mx: Es importante destacar que este plazo es mínimo. Para funcionalidades importantes es recomendable que la funcionalidad obsoleta se mantenga habilitada al menos el doble de tiempo. Además, gracias a la política de ramificación estable, la eliminación de funcionalidades obsoletas sólo se puede producir durante el lanzamiento de versiones menores; no son apropiadas para tenerlas en una nueva versión.
es_un: Ten en cuenta que este retraso es mínimo. Para características importantes, se recomienda que la característica obsoleta aparezca al menos el doble de ese tiempo. Además, según la política de rama (branch) estable, las eliminaciones de obsolescencia solo pueden ocurrir durante las versiones menores; no son apropiados para backporting (adaptación a versiones anteriores).
fr_fr: Notez que ce délai est un minimum. Pour des fonctions majeures, il est recommandé que la fonction reste disponible encore au moins six mois. La stabilité d'une branche de version implique que les suppressions de fonctions n'interviennent que dans des versions mineures.
id_id: Perhatikan bahwa keterlambatan ini adalah minimum. Untuk fitur yang signifikan, disarankan bahwa fitur terdeprekasi muncul untuk setidaknya dua kali lipat waktu itu. Selain itu, per kebijakan cabang yang stabil, penghapusan deprekasi hanya dapat untuk rilis versi minor; mereka tidak cocok untuk backporting.
it_it: Si noti che questo ritardo è minimo. Per le funzionalità significative, si raccomanda che la funzione deprecata appaia almeno per il doppio del tempo. Inoltre, secondo la politica di "stable branch", la rimozione della deprecazione può avvenire solo durante i rilasci di versioni minori; non è appropriata per il backporting.
pt_un: Note que este atraso é um mínimo. Para features significativas, é recomendado que o recurso depreciado esteja presente por pelo menos o dobro desse tempo. Além disso, de acordo com a política da ramificação estável, as remoções de depreciação só podem ocorrer durante releases de versão menor; elas não são apropriadas para backporting.
ru_ru: Стоит отметить, что этот интервал является минимальным. Для более значительных функций рекомендуется хотя бы удвоить это время. Также, согласно политике стабильности ветки, удаление устаревших функций может происходить только в минорных версиях (версии без значительных изменений). Также, они не могут использоваться при портировании новых функций для поддержки в более старых версиях (backporting).
sw_ke: Kumbuka kuwa ucheleweshaji huu ni kiwango cha chini. Kwa vipengee muhimu, inashauriwa kwamba kipengee kilichokataliwa kionekane angalau mara mbili ya wakati huo. Pia, kupitia sera ya tawi imara, uondoaji wa ukataliwa unaweza kutokea tu wakati wa matoleo madogo; sio sahihi kwa backporting.
ta_in: இந்த தாமதம் குறைந்தபட்சம் என்பதை நினைவில் கொள்க. குறிப்பிடத்தக்க அம்சங்களுக்கு, நீக்கப்பட்ட அம்சம் அந்த நேரத்தில் குறைந்தது இருமடங்கு தோன்றும் என்று பரிந்துரைக்கப்படுகிறது. மேலும், நிலையான கிளைக் கொள்கையின்படி, நீக்குதல் நீக்குதல்கள் சிறிய பதிப்பு வெளியீடுகளின் போது மட்டுமே நிகழும்; அவை பின்செலுத்தலுக்கு பொருத்தமானவை அல்ல.
tr_tr: Bu gecikmenin en az olduğunu not edin. Önemli özellikler için, kullanım dışı özelliğin en az bu gecikme zamanının iki katı için görünmesi tavsiye edilir. Ayrıca kararlı dallanma politikası gereğince, kullanımdan kaldırma sadece daha küçük sürümlerde olabilir; backporting (bir yazılımda daha yeni versiyonda geliştirilmiş olan bir özelliğin eski versiyonlara taşınması) için uygun değillerdir.
vi_vn: Lưu ý rằng mức trì hoãn này là tối thiểu. Đối với các tính năng quan trọng, tính năng bị cảnh báo ngừng hỗ trợ được khuyến cáo duy trì trong ít nhất thời gian gấp đôi. Ngoài ra, vì chính sách ổn định nhánh cập nhật, việc loại bỏ các phần quá hạn chỉ có thể thực hiện trong một phiên bản phát hành phụ; chúng không thích hợp cho backport.

source: Deprecation Warnings
bn_bn: ডেপ্রিকেশন (অপসারণ) সতর্কবার্তা
de_de: Deprecation-Warnungen
es_mx: Advertencias de Obsolesencia
es_un: Advertencias de Obsolescencia
fr_fr: Avertissements de dépréciation
id_id: Peringatan Deprecation
it_it: Avvisi di deprecazione
pt_un: Avisos de Descontinuação
ru_ru: Предупреждения об устаревании (Deprecation Warnings)
sw_ke: Onyo za Ukataa
ta_in: நீக்குதல் எச்சரிக்கைகள்
tr_tr: Kullanımdan Kaldırma Uyarıları
vi_vn: Cảnh báo ngừng hỗ trợ

source: The proper way to raise a deprecation warning is to use the ``warn`` function from the `warnings module <https://docs.python.org/3/library/warnings.html>`__ in the Python standard library. The warning category class should be a ``DeprecationWarning``. An example would be::
bn_bn: একটি ডেপ্রিকেশন বার্তা সৃষ্টি করার সঠিক উপায় হল ``warn`` ব্যবহার করা, যেটি পাইথন স্ট্যান্ডার্ড লাইব্রেরির `warnings module <https://docs.python.org/3/library/warnings.html>`__ উপস্থিত। সতর্কবার্তাটির শ্রেণী ``DeprecationWarning`` হতে হবে। যেমন::
de_de: Der korrekte Weg, Deprecation-Warnungen auszugeben, ist die ``warn`` Funktion des `warnings module <https://docs.python.org/3/library/warnings.html>`__ der Python-Standardbibliothek zu nutzen. Die Warnungs-Klasse sollte eine ``DeprecationWarning`` sein. Ein Beispiel dafür wäre::
es_mx: La manera apropiada de crear una advertencia de obsolesencia es utilizando la función ``warn``del `modulo warnings <https://docs.python.org/3/library/warnings.html>`__ en la biblioteca estándar de Python. La categoría de advertencia debe ser de la clase ``Deprecation Warning``. Un ejemplo de esto sería::
es_un: La forma correcta de generar una advertencia de obsolescencia es usar la función ``warn`` del `módulo de advertencias <https://docs.python.org/3/library/warnings.html>`__ en la biblioteca estándar de Python. La clase de categoría de advertencia debe ser una ``DeprecationWarning``. Un ejemplo sería::
fr_fr: La façon correcte de lever un warning de dépréciation est d'utiliser la fonction ``warn`` du module `warnings module <https://docs.python.org/3/library/warnings.html>`__ disponible dans la librairie standard de Python. La classe warning est ``DeprecationWarning``. Voici un exemple d'appel ::
id_id: Cara yang tepat untuk menaikkan peringatan deprecation adalah dengan menggunakan fungsi ``warn`` dari modul `warning module <https://docs.python.org/3/library/warnings.html>`__ di pustaka standar Python. Kelas kategori peringatan harus berupa ``DeprecationWarning``. Contohnya::
it_it: Il modo corretto per segnalare un avviso di deprecazione è quello di utilizzare la funzione ``warn`` dal modulo `warnings <https://docs.python.org/3/library/warnings.html>`__ nella libreria standard Python. La classe della categoria di avviso dovrebbe essere un ``DeprecationWarning``. Un esempio sarebbe::
pt_un: A maneira adequada de gerar um aviso de descontinuação é usar a função ``warn`` do `warnings module <https://docs.python.org/3/library/warnings.html>`__ na biblioteca padrão do Python. A classe de advertência deve ser um ``DeprecationWarning``. Um exemplo seria::
ru_ru: Корректным способом предупредить об устаревании является использование функции ``warn`` из `модуля предупреждений (warnings module) <https://docs.python.org/3/library/warnings.html>`__ в стандартной библиотеке Python. В качестве категории предупреждения следует использовать класс ``DeprecationWarning``. Пример использования:
sw_ke: Njia sahihi ya kuibua onyo la ukataa ni kwa kutumia fomula ya ``warn`` kutoka `moduli ya onyo <https://docs.python.org/3/library/warnings.html>`__ katika maktaba ya wastani ya Python. Kitengo cha darasa la onyo kinapaswa kuwa ``DeprecationWarning``. Mfano ni kama::
ta_in: நீக்குதல் எச்சரிக்கையை எழுப்புவதற்கான சரியான வழி, பைத்தான் நிலையான நூலகத்தில் `warnings module <https://docs.python.org/3/library/warnings.html>`__ இலிருந்து ``warn`` செயல்பாட்டைப் பயன்படுத்துவது. எச்சரிக்கை வகை வகுப்பு ``DeprecationWarning`` ஆக இருக்க வேண்டும். ஒரு உதாரணம்::
tr_tr: Kullanımdan kaldırma uyarısı vermenin uygun yolu, Python standart kütüphanesinde `warnings modülünden <https://docs.python.org/3/library/warnings.html>`__ `` warn`` işlevini kullanmaktır. Uyarı kategorisi sınıfı bir ``DeprecationWarning`` olmalıdır. Örnek olarak şu verilebilir::
vi_vn: Cách thích hợp để đưa ra cảnh báo ngừng hỗ trợ là sử dụng chức năng ``warn`` từ `warnings module <https://docs.python.org/3/library/warnings.html>`__ trong thư viện chuẩn Python. Loại cảnh báo phải là một ``DeprecationWarning``. Lấy ví dụ như sau::

source: One thing to note here is the ``stack_level`` kwarg on the warn() call. This argument is used to specify which level in the call stack will be used as the line initiating the warning. Typically, ``stack_level`` should be set to 2, as this will show the line calling the context where the warning was raised. In the above example, it would be the caller of ``foo()``. If you did not set this, the warning would show that it was caused by the line in the foo() function, which is not helpful for users trying to determine the origin of a deprecated call. However, this value may be adjusted, depending on the call stack and where ``warn()`` gets called from. For example, if the warning is always raised by a private method that only has one caller, ``stack_level=3`` might be appropriate.
bn_bn: ``stack_level`` কীওয়ার্ড আর্গুমেন্ট ( kwarg) warn() এর ডাক, সেইটি এইখানে উল্লেখ্য। এই আর্গুমেন্টটি নির্দিষ্ট করে কোন স্তরের কল স্ট্যাক ব্যাবহার হবে পংক্তিতে সতর্কবার্তা শুরু করার জন্যে। সাধারণত ``stack_level`` ২ এ স্থির করা থাকে, কারণ এটি সেই পংক্তিটিকে দেখাবে যেটির প্রসঙ্গে সতর্কবার্তাটি তৈরী হয়েছিল। আগের উদাহরণটিতে এটি ``foo()`` কে ডাকতো। আপনি যদি এটি স্থির না করেন তাহলে সতর্কবার্তাটি সেই পংক্তিটি দেখাবে foo() ফাঙ্কশনে যার জন্যে হল, যেইটা ব্যবহারকারীদের ডিপ্রেকেটেড কলের উৎস খুঁজে পাওয়ার জন্যে। একদমই উপকারী নয় যদিও এর মান নিয়ন্ত্রণীও, কিন্তু সেটি নির্ভর করছে কল স্টেকের এবং কোথা থেকে ``warn()`` কল হচ্ছে তার ওপর।. উদাহরণ, যদি একটি সতর্কবার্তা সৃষ্টি হয় একটি প্রাইভেট মেথডের দ্বারা যার একটি কলার, ``stack_level=3`` তাহলে সেটা হয়তো উপযুক্ত।
de_de: Erwähnenswert ist hierbei das ``stack_level`` kwarg im warn() Aufruf. Dieses Argument definiert, welches Level im Call-Stack als die Zeile verwendet wird, welche die Warnung ausgelöst hat. Normalerweise sollte ``stack_level`` auf 2 gesetzt sein, da dies die Zeile zeigt, welche den die Warnung auslösenden Kontext aufgerufen hat. Im obigen Beispiel wäre das der Aufrufer von ``foo()``. Definiert man dies nicht, würde die Warnung anzeigen, dass die Zeile in der foo() Funktion die Warnung ausgelöst hat, was für Nutzer, die den Ursprung einer Deprecation Warnung suchen, nicht sinnvoll ist. Der Wert kann jedoch angepasst werden, je nachdem, von wo ``warn()`` aufgerufen wird. Wenn zum Beispiel die Warnung immer durch eine private Methode ausgelöst wird, die nur von einer einzigen Stelle aus aufgerufen wird, könnte ``stack_level=3`` besser geeignet sein.
es_mx: Una cosa a tener en cuenta es el argumento kwarg "stack_level" en la llamada de warn(). Este argumento es usado para especificar qué nivel en el stack de llamada será usado como la línea que inicia la advertencia. Normalmente, "stack_level" debería tener valor 2, ya que ésto mostrará la linea llamando al contexto donde apareció la advertencia. En el ejemplo que aparece arriba, sería el que llama a "foo()". Si no has establecido esto, la advertencia mostraría que fue causada por la línea en la función foo(), que no es muy útil para usuarios que intentan determinar el origen de la llamada obsoleta. Sin embargo, este valor puede ser ajustado, dependiendo del stack de llamada y de donde "warn()" sea llamado. Por ejemplo, si la advertencia siempre aparece por culpa de un método privado que solo es llamado en un lugar, "stack_level=3" podría ser adecuado.
es_un: Una cosa a tener en cuenta aquí es el kwarg ``stack_level`` en la llamada a warn(). Este argumento se utiliza para especificar qué nivel de la pila de llamadas se utilizará como línea que inicia la advertencia. Por lo general, ``stack_level`` debe establecerse en 2, ya que esto mostrará la línea que llama al contexto donde se generó la advertencia. En el ejemplo anterior, sería el llamador de ``foo()``. Si no configuraste esto, la advertencia mostraría que fue causada por la línea en la función foo(), lo cual no es útil para los usuarios que intentan determinar el origen de una llamada obsoleta. Sin embargo, este valor puede ajustarse, dependiendo de la pila de llamadas y de dónde se llama a ``warn()``. Por ejemplo, si la advertencia siempre se genera mediante un método privado que solo se llama desde un solo lugar, ``stack_level=3`` podría ser apropiado.
fr_fr: Notez l'argument de mot clef (kwarg) ``stack_level`` dans la fonction warn(). Le plus souvent, ``stack_level`` devrait être positionné à 2, indiquant que l'on souhaite montrer l'appelant conduisant au warning. Dans l'exemple ci-dessus, ce contexte serait l'appelant de la fonction ``foo()``. Si vous ne positionnez pas cet argument de cette façon, le warning indiquera qu'il est engendré par la ligne dans la fonction foo(), ce qui est peu intéressant pour celui qui souhaite comprendre l'origine du warning. Cependant, cette valeur peut être différente de deux, en fonction de l'origine de l'appel à ``warn()``. Par exemple, si le warning est toujours appelé d'une méthode privée avec un seul appelant, il est bon de poser ``stack_level=3``.
id_id: Satu hal yang perlu diperhatikan di sini adalah kwarg ``stack_level`` pada panggilan warn(). Argumen ini digunakan untuk menentukan level mana pada stack call yangakan digunakan sebagai baris yang menginisiasi peringatan. Biasanya, ``stack_level`` harus ditetapkan pada angka 2, karena ini akan menunjukkan garis yang memanggil konteks di mana peringatan diberikan. Dalam contoh di atas, terjadi pada pemanggil ``foo()``. Jika Anda tidak mengatur hal ini, peringatan akan menunjukkan bahwa hal itu disebabkan oleh baris dalam fungsi foo(), yang tidak berguna bagi pengguna yang mencoba untuk menentukan asal dari panggilan yang terdeprekasi. Namun, nilai ini dapat disesuaikan, tergantung pada panggilan stack dan dari mana ``warn()`` akan dipanggil. Sebagai contoh, jika peringatan selalu dinaikkan dengan metode pribadi yang hanya memiliki satu pemanggil, ``stack_level=3`` mungkin tepat.
it_it: Una cosa da notare qui è il kwarg ``stack_level`` sulla chiamata warn(). Questo argomento è usato per specificare quale livello nello stack di chiamate sarà indicato come linea di avvio dell'avviso. Tipicamente, ``stack_level`` dovrebbe essere impostato a 2, in quanto questo mostrerà la linea che chiama il contesto dove è stato generato l'avviso. Nell'esempio precedente, sarebbe il chiamante di ``foo()``. Se non lo si imposta, l'avviso mostrerebbe che è stato causato dalla linea nella funzione foo(), il che non è utile per gli utenti che cercano di determinare l'origine di una chiamata deprecata. Tuttavia, questo valore può essere regolato, a seconda dello stack di chiamate e da dove ``warn()`` viene chiamato. Per esempio, se l'avviso è sempre generato da un metodo privato che ha un solo chiamante, potrebbe essere appropriato ``stack_level=3``.
pt_un: Uma coisa a observar aqui é a chamada ``stack_level`` kwarg on the warn(). Esse argumento é usado para especificar qual nível na pilha de chamadas será usado como a linha que inicia o aviso. Normalmente, ``stack_level`` deve ser definido como 2, pois isto irá mostrar a linha que chama o contexto em que o aviso foi gerado. No exemplo acima, seria o autor da chamada de ``foo()``. Se você não definir isso, o aviso mostrará que ele foi causado pela função na linha foo(), o que não é útil para usuários que tentam determinar a origem de uma chamada obsoleta. No entanto, este valor pode ser ajustado, dependendo da pilha de chamadas e de onde o ``warn()`` é chamado. Por exemplo, se o aviso é sempre criado por um método privado que tem apenas um chamador, pode ser apropriado usar ``stack_level=3``.
ru_ru: Также необходимо пояснить использование параметра ``stack_level`` при вызове функции warn(). Этот аргумент используется для указания, какой уровень в стеке вызовов будет использоваться в качестве инициализации предупреждения. Обычно значение ``stack_level`` должно быть равно 2, так как в этом случае будет отображена строка вызова контекста, в котором было вызвано предупреждение. В приведенном выше примере это будет объект, вызвавший метод ``foo()``. Если же такое значение не будет установлено, то причиной отображения предупреждения будет строка внутри функции foo(), что не сможет помочь пользователю, пытающемуся определить, откуда производится вызов устаревшего метода. Однако, это значение может быть изменено, в зависимости от стека вызовов и места, откуда вызывается функция ``warn()``. Например, если функция предупреждения всегда вызывается приватным методом, который может вызвать только экземпляр одного класса, то целесообразно выбрать ``stack_level=3``.
sw_ke: Jambo moja la kukumbuka hapa ni ``stack_level`` kwarg kwenye mwito wa warn(). Kigezo hicho hutumiwa kubainisha kiwango kipi katika call stack kitatumiwa kama mstari wa kuanzisha onyo. Kwa kawaida, ``stack_level`` inapaswa kuwekwa kama 2, kwani hii itaonyesha mstari unaoita muktadha ambapo onyo lilitolewa. Katika mfano hapo juu, itakuwa mwitaji wa ``foo()``. Usipoweka hiyo, onyo litaonyesha kuwa lilisababishwa na mstari katika fomula ya foo(). Huku hakuwasaidii watumiaji wanaojaribu kutathmini asili ya mwito wa ukataliwa. Walakini, nambari hiyo inaweza kubadilishwa kulingana na call stack na pahali ``warn()`` imeitwa kutoka. Kwa mfano, ikiwa onyo huibuliwa na private method yenye mwitaji mmoja tu, ``stack_level=3`` yaweza kufaa.
ta_in: ஒரு விஷயம் இங்கே குறிப்பிடும் ``stack_level`` ''kwarg on the warn()'' அழைப்பு. அழைப்பு அடுக்கில் எந்த நிலை எச்சரிக்கையைத் தொடங்கும் வரியாகப் பயன்படுத்தப்படும் என்பதைக் குறிப்பிட இந்த வாதம் பயன்படுத்தப்படுகிறது. பொதுவாக, ``stack_level`` ஐ 2 ஆக அமைக்க வேண்டும், ஏனெனில் இது எச்சரிக்கை எழுப்பப்பட்ட சூழலை அழைக்கும் வரியைக் காண்பிக்கும். மேலே உதாரணமாக, ``foo()``. நீங்கள் இதை அமைக்கவில்லை எனில், இது foo() செயல்பாட்டில் உள்ள வரியால் ஏற்பட்டது என்பதை எச்சரிக்கை காண்பிக்கும், இது நீக்கப்பட்ட அழைப்பின் தோற்றத்தை தீர்மானிக்க முயற்சிக்கும் பயனர்களுக்கு உதவாது. இருப்பினும், இந்த மதிப்பு சரிசெய்யப்படலாம், இது அழைப்பு அடுக்கைப் பொறுத்து, ``warn()`` எங்கிருந்து அழைக்கப்படுகிறது என்பதைப் பொறுத்து. எடுத்துக்காட்டாக, ஒரு அழைப்பாளரை மட்டுமே கொண்ட ஒரு தனிப்பட்ட முறையால் எச்சரிக்கை எப்போதும் எழுப்பப்பட்டால், ``stack_level = 3`` பொருத்தமானதாக இருக்கலாம்.
tr_tr: Burada dikkat edilmesi gereken şey, warn() çağrısında ``stack_level`` anahtar kelime argümanıdır. Bu argüman, uyarıyı başlatan satır olarak çağrı yığınında hangi seviyenin kullanılacağını belirlemek için kullanılır. Genellikle, ``stack_level``, 2 olarak ayarlanmalıdır, çünkü bu, uyarının oluşturulduğu içeriği çağıran satırı gösterecektir. Yukarıdaki örnekte, bu ``foo()`` 'nun çağırıcısı olacaktır. Bunu ayarlamadıysanız, uyarı foo() işlevindeki satırdan kaynaklandığını gösterir; bu, kullanımdan kaldırılmış bir çağrının kaynağını belirlemeye çalışan kullanıcılar için yararlı değildir. Bununla birlikte, bu değer, çağrı yığınına ve ``warn()`` öğesinin nereden çağrıldığına bağlı olarak ayarlanabilir. Örneğin, uyarı her zaman yalnızca bir çağıranı olan bir özel metod ile verilirse, ``stack_level = 3`` uygun olabilir.
vi_vn: Một điều cần lưu ý ở đây là biến ``stack_level`` kwarg khi gọi hàm warm(). Đối số này được dùng để xác định mức độ nào trong ngăn xếp cuộc gọi sẽ được dùng để bắt đầu cảnh báo. Thông thường ``stack_level`` phải được đặt là 2, vì nó sẽ cho thấy dòng lệnh gọi ngữ cảnh đã nêu ra cảnh báo. Trong ví dụ trên, nó sẽ là nơi gọi hàm ``foo()``. Nếu bạn không cài nó, cảnh báo sẽ hiển thị rằng nó được gây ra bởi dòng lệnh trong hàm foo(), vốn không có ích cho người dùng cố gắng xác định nguồn gốc của một lệnh gọi ngưng hỗ trợ. Tuy nhiên, giá trị này có thể được điều chỉnh, tùy thuộc vào ngăn xếp cuộc gọi và nơi ``warn()`` được gọi. Ví dụ, nếu cảnh báo luôn được đưa ra bởi một phương thức riêng mà chỉ có một nơi gọi, ``stack_level=3`` có thể thích hợp.

source: Stable Branch Policy
bn_bn: স্থিতিশীল (স্টেবল) শাখা নীতি
es_mx: Política de Ramificación Estable
es_un: Política de Ramificación Estable
fr_fr: Politique de la branche stable
id_id: Kebijakan Cabang Stabil
it_it: Linea di condotta sullo Stable Branch
pt_un: Política de Branch Estável
ru_ru: Политика стабильной ветки
sw_ke: Sera ya Tawi Imara
ta_in: நிலையான கிளை கொள்கை
tr_tr: Kararlı Dallanma Politikası
vi_vn: Chính sách dành cho Nhánh ổn định
