Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: Due to the use of namespace packaging in Python, care must be taken in how you install packages. If you're planning to install any element from source, do not use the ``qiskit`` meta-package. Also, follow this guide and use a separate virtual environment for development. If you do choose to mix an existing installation with your development, refer to https://github.com/pypa/sample-namespace-packages/blob/master/table.md for the set of combinations of installation methods that work together.
bn_bn: Python এর নেমস্পেস প্যাকেজিংয়ের কারণে প্যাকেজ ইন্সটল (স্থাপন) করার সময় সতর্ক হতে হবে। উৎস থেকে ইন্সটল (স্থাপন) করার সময় ``qiskit`` মেটা প্যাকেজ ব্যবহার করবেন না। এই নির্দেশিকাটি অনুসরণ করুন এবং একটি পৃথক কৃত্রিম কর্মপরিবেশ তৈরি করুন। আপনি যদি ইন্সটল করা বিদ্যমান কোনো প্যাকেজ সংযুক্ত করতে চান তবে একসাথে কাজ করে এমন উপযুক্ত কম্বিনেশনের জন্য https://github.com/pypa/sample-namespace-packages/blob/master/table.md অনুসরণ করুন।
de_de: Aufgrund der Verwendung von Namespaces in Python muss darauf geachtet werden, wie Pakete installiert werden. Wenn Sie ein Element aus dem Quelltext installieren möchten, verwenden Sie nicht das ``qiskit``-Meta-Paket. Folgen Sie diesem Handbuch und verwenden Sie eine separate virtuelle Umgebung für die Entwicklung. Wenn Sie vorhaben, eine vorhandene Installation mit Ihrer Entwicklung zu mischen, lesen Sie die Informationen unter https://github.com/pypa/sample-namespace-packages/blob/master/table.md für eine Liste der funktionierenden Kombinationen von Installationsmethoden.
el_gr: Λόγω της χρήσης της συσκευασίας namespace στην Python, πρέπει να ληφθεί μέριμνα για τον τρόπο εγκατάστασης των πακέτων. Αν σχεδιάζετε να εγκαταστήσετε οποιοδήποτε στοιχείο από την πηγή, μην χρησιμοποιήσετε το μετα-πακέτο ``qiskit``. Επίσης, ακολουθήστε αυτόν τον οδηγό και χρησιμοποιήστε ένα ξεχωριστό εικονικό περιβάλλον για ανάπτυξη. Αν επιλέξετε να αναμίξετε μια υπάρχουσα εγκατάσταση με την ανάπτυξή σας, ανατρέξτε στο https://github. om/pypa/sample-namespace-packages/blob/master/table.md για το σύνολο των συνδυασμών μεθόδων εγκατάστασης που λειτουργούν μαζί.
es_mx: Debido al uso de namespaces en los paquetes de Python, se debe tener cuidado al instalar los paquetes. Si planea instalar cualquier elemento desde la fuente, no use el meta paquete `` qiskit``. Además, siga esta guía y use un entorno virtual separado para el desarrollo. Si elige mezclar una instalación existente con su desarrollo, consulte https://github.com/pypa/sample-namespace-packages/blob/master/table.md para conocer las combinaciones de métodos de instalación que funcionan juntas sin problema.
es_un: Debido al uso del nombre de espacio (namespace) en los paquetes de Python, se debe tener cuidado al instalar los paquetes. Si planeas instalar cualquier elemento desde el código fuente, no uses el metapaquete ``qiskit``. Además, sigue esta guía y utiliza un entorno virtual independiente para el desarrollo. Si eliges mezclar una instalación existente con su desarrollo, consulta https://github.com/pypa/sample-namespace-packages/blob/master/table.md para ver el conjunto de combinaciones de métodos de instalación que funcionan juntos.
fr_fr: Faites attention lorsque vous installez des packages (en raison des namespaces dans le packaging Python). Si vous souhaitez installer depuis la source, n'utilisez pas le meta-package ``qiskit``. Suivez ce guide et utilisez un environnement de développement à part. Si vous choisissez de mélanger une installation existante avec votre propre installation, lisez https://github.com/pypa/sample-namespace-packages/blob/master/table.md pour découvrir les différentes combinaisons d'installations compatibles.
id_id: Penggunaan packaging namespace di Python menyebabkan perlunya perhatian terhadap bagaimana cara Anda menginstall packages. Jika Anda berencana untuk menginstall elemen manapun melalui sumber, jangan gunakan meta-package ``qiskit``. Selain itu, ikuti petunjuk ini dan gunakan lingkungan virtual yang terpisah untuk melakukan pengembangan. Jika Anda memilih untuk menggabungkan instalasi yang telah ada dengan pengembangan Anda, silahkan lihat https://github.com/pypa/sample-namespace-packages/blob/master/table.md untuk serangkaian langkah instalasi yang tepat.
it_it: A causa dei namespace package in Python, è necessario prestare attenzione al modo in cui si installano i pacchetti. Se si ha intenzione di installare qualsiasi elemento dalla sorgente, non utilizzare il meta-package ``qiskit``. Inoltre, seguendo questa guida è possibile utilizzare un ambiente virtuale separato per lo sviluppo. Se si sceglie di unire un'installazione esistente con il proprio sviluppo, far riferimento a https://github.com/pypa/sample-namespace-packages/blob/master/table.md per le diverse combinazioni di installazione compatibili.
pt_un: Devido ao uso de pacotes de namespace em Python, é preciso ter cuidado com a forma como você instala os pacotes. Se você está planejando instalar algum elemento desde a fonte, não use o meta-package ``qiskit``. Além disso, siga este guia e use um ambiente virtual separado para desenvolvimento. Se você optar por misturar uma instalação existente com o seu desenvolvimento, consulte https://github.com/pypa/sample-namespace-packages/blob/master/table.md para o conjunto de combinações de métodos de instalação que funcionam juntos.
ru_ru: Из-за использования пространства имен в Python, необходимо следить за тем, как устанавливаются пакеты. Не используйте метапакет ``qiskit``, если Вы планируете установить какой-либо элемент из исходного кода. Также следуйте данному руководству и используйте отдельную виртуальную среду (virtual environment) для разработки. Если Вы хотите смешать существующие установленные пакеты с Вашими пакетами для разработки, перейдите на страницу https://github.com/pypa/sample-namespace-packages/blob/master/table.md, чтобы найти рабочие комбинации.
sw_ke: Kutokana na utumizi wa Python wa namespace packaging, tahadhari sharti ichukuliwe katika kusakinisha vifurushi. Iwapo unakusudia kusakinisha vipengele kutoka chanzo, usitumie kifurushi cha meta cha ``qiskit``. Pia, fuata mwongozo huu na utumie mazingira tofauti ya maendeleo. Ukichagua kuchanganya sakinisho lililopo na maendeleo yako, rejelea https://github.com/pypa/sample-namespace-packages/blob/master/table.md kwa seti ya muunganisho wa njia za usakinishaji zinazofanya kazi pamoja.
ta_in: பைதான் (Python) இல் நன்ஸ்பேஸ் தொகுப்பின் பயன்பாடு காரணமாக, நீங்கள் தொகுப்புகளை நிறுவுவது எப்படி கவனிக்கவும். நீங்கள் மூலத்திலிருந்து எந்த உறுப்பை நிறுவுவதற்கு திட்டமிடப்பட்டிருந்தால் ``qiskit`` meta-package ஐ பயன்படுத்தாது. மேலும், இந்த வழிகாட்டியை பின்பற்றவும், வளர்ச்சிக்கு ஒரு தனிப்பட்ட மெய்நிகர் சூழல் பயன்படுத்தவும். உங்கள் வளர்ச்சியுடன் ஏற்கனவே உள்ள நிறுவனத்தை தேர்ந்தெடுக்க தேர்வு செய்தால், நிறுவன முறைகளின் கூட்டமைப்பின் அமைப்புகளாக https://github.com/pypa/sample-namespace-packages/blob/master/table.md என்று குறிக்கவும்.
tr_tr: Python'da ad alanı paketlemesi kullanılması nedeniyle, paketleri nasıl kuracağınıza dikkat edilmelidir. Kaynaktan herhangi bir öğe kurmayı planlıyorsanız, ``qiskit`` meta paketini kullanmayın. Ayrıca, bu kılavuzu izleyin ve geliştirme için ayrı bir sanal ortam kullanın. Mevcut bir kurulumu gelişiminizle karıştırmayı seçerseniz, birlikte çalışan kurulum yöntemleri kombinasyonu için https://github.com/pypa/sample-namespace-packages/blob/master/table.md adresine bakın.
vi_vn: Vì việc dùng các namespace của các gói trong Python, bạn cần phải cẩn thận trong việc cài các gói. Nếu bạn có kế hoạch cài bất cứ phần tử nào từ nguồn, không sử dụng ``qiskit`` meta-package. Bên cạnh đó, làm theo hướng dẫn và sử dụng môi trường ảo (virtual environment) cho việc phát triển của bạn. Nếu bạn muốn kết hợp những gói đã cài đặt với việc phát triển của bạn, hãy tham khảo https://github.com/pypa/sample-namespace-packages/blob/master/table.md cho việc kết hợp các bản cài đặt để chúng có thể làm việc cùng nhau.

source: Set up the Virtual Development Environment
bn_bn: ভার্চুয়াল ডেভেলাপমেন্টের এনভায়রনমেন্ট বা পরিবেশ তৈরি করুন
de_de: Einrichten der virtuellen Entwicklungsumgebung
el_gr: Ρύθμιση του περιβάλλοντος εικονικής ανάπτυξης
es_mx: Configurar el Ambiente de Desarrollo Virtual
es_un: Configurar el Ambiente de Desarrollo Virtual
fr_fr: Installez l'environnement virtuel de développement
id_id: Mengatur Lingkungan Pengembangan Virtual (Virtual Development Environment)
it_it: Configurare l'ambiente di sviluppo virtuale
pt_un: Configurar o Ambiente de Desenvolvimento Virtual
ru_ru: Настройка виртуальной среды разработки
sw_ke: Kuanzisha mazingira ya virtual ya ustawishaji
ta_in: மெய்நிகர் மேம்பாட்டு சூழலை அமைக்கவும்
tr_tr: Sanal Geliştirme Ortamını Kurun
vi_vn: Thiết lập môi trường ảo

source: Installing Terra from Source
bn_bn: উৎস থেকে টেরা স্থাপন করুন
de_de: Installieren von Terra aus dem Quelltext
el_gr: Εγκατάσταση του Aqua από την πηγή
es_mx: Instalar Terra a partir del código fuente
es_un: Instalar Terra a partir del Código Fuente
fr_fr: Installation de Terra depuis la Source
id_id: Menginstal Terra dari Sumber
it_it: Installazione di Terra dal codice sorgente
pt_un: Instalando Terra a partir do Código Fonte
ru_ru: Установка пакета Terra из исходного кода
sw_ke: Kusakinisha Terra Kutoka Chanzo
ta_in: மூலத்திலிருந்து Terra நிறுவப்படுகிறது
tr_tr: Kaynaktan Terra Kurulumu
vi_vn: Cài đặt Terra từ nguồn

source: Installing from source requires that you have a C++ compiler on your system that supports C++11.
bn_bn: উত্স থেকে ইনস্টল করার জন্য আপনার সিস্টেমে আপনার C++ কম্পাইলার থাকা দরকার যা C++ 11 সমর্থন করে।
de_de: Eine Installation aus dem Quelltext erfordert einen C++-Compiler mit C++11-Unterstützung.
el_gr: Η εγκατάσταση από την πηγή απαιτεί να έχετε ένα μεταγλωττιστή C++ στο σύστημά σας που υποστηρίζει C++11.
es_mx: Para instalar a partir del código fuente es necesario que tenga un compilador de C++ en tu ordenador que soporte C++11.
es_un: Para instalar a partir del código fuente es necesario que tengas un compilador de C++ en tu computadora que soporte C++11.
fr_fr: Cette installation nécessite un compilateur C++ supportant C++-11.
id_id: Menginstal dari sumber mensyaratkan bahwa Anda memiliki C++ compiler pada sistem Anda yang mendukung C + + 11.
it_it: L'installazione da codice sorgente richiede di disporre di un compilatore C++ sul sistema che supporti C++11.
ru_ru: Установка из исходного кода требует наличия компилятора C++ в системе, поддерживающей C++11.
sw_ke: Kusakinisha kutoka chanzo kunahitaji uwe na compiler ya C++ inayounga mkono C++11 kwenye tarakilishi yako.
ta_in: மூலத்திலிருந்து நிறுவப்படுகிறது நீங்கள் C + + 11 ஆதரிக்கிறது உங்கள் கணினியில் C + + compiler வேண்டும்.
tr_tr: Bu kaynaktan kurulum yapılabilmesi için sisteminiz C++11'i destekleyen bir C++ derleyicisi olması gerekmektedir.
vi_vn: Cài đặt từ nguồn yêu cầu một trình biên dịch C++ trong hệ thống của bạn và phải hỗ trợ C++11.

source: Compiler for Linux
bn_bn: লিনাক্স এর কম্পাইলার
de_de: Compiler für Linux
el_gr: Μεταγλωττιστής για Linux
es_mx: Compilador para Linux
es_un: Compilador para Linux
fr_fr: Compilateur pour Linux
id_id: Compiler untuk Linux
it_it: Compilatore per Linux
ru_ru: Компилятор для Linux
sw_ke: Compiler kwa Linux
ta_in: Linux க்கான மொழிமாற்றி
tr_tr: Linux Derleyicisi
vi_vn: Trình biên dịch cho Linux

source: On most Linux platforms, the necessary GCC compiler is already installed.
bn_bn: বেশিরভাগ লিনাক্স প্ল্যাটফর্মে, প্রয়োজনীয় জিসিসি কম্পাইলার ইতিমধ্যে ইনস্টল করা থাকে।
de_de: Auf den meisten Linux-Plattformen ist der erforderliche GCC-Compiler bereits installiert.
el_gr: Στις περισσότερες πλατφόρμες Linux, ο απαραίτητος μεταγλωττιστής GCC έχει ήδη εγκατασταθεί.
es_mx: En la mayoría de las plataformas Linux, el compilador necesario GCC está ya instalado.
es_un: En la mayoría de las plataformas Linux, el compilador necesario GCC está ya instalado.
fr_fr: Sur la plupart des plateformes Linux, le compilateur GCC nécessaire est déjà installé.
id_id: Pada sebagian besar platform Linux, GCC compiler yang diperlukan sudah terinstal.
it_it: Sulla maggior parte delle piattaforme Linux, il compilatore GCC necessario è già installato.
ru_ru: На большинстве Linux-платформ уже установлен необходимый компилятор GCC.
sw_ke: Kwenye majukwaa mengi ya Linux, compiler inayohitajika ya GCC tayari imewekwa.
ta_in: பெரும்பாலான லினக்ஸ் இயங்குதளங்களில், தேவையான GCC தொகு ஏற்கனவே நிறுவப்பட்டுள்ளது.
tr_tr: Çoğu Linux platformunda gerekli GCC derleyicisi zaten kuruludur.
vi_vn: Trên hầu hết các nền tảng Linux, các trình biên dịch GCC thường sẽ được cài sẵn.

source: Compiler for macOS
bn_bn: ম্যাক ও এস এর কম্পাইলার
de_de: Compiler für macOS
el_gr: Μεταγλωττιστής για macOS
es_mx: Compilador para macOS
es_un: Compilador para macOS
fr_fr: Compilateur pour macOS
id_id: Compiler untuk macOS
it_it: Compilatore per macOS
ru_ru: Компилятор для macOS
sw_ke: Compiler kwa macOS
ta_in: MacOS க்கான மொழிமாற்றி
tr_tr: macOS için derleyici
vi_vn: Trình biên dịch cho macOS

source: If you use macOS, you can install the Clang compiler by installing XCode. Check if you have XCode and Clang installed by opening a terminal window and entering the following.
bn_bn: আপনি যদি ম্যাক ও.এস. ব্যবহার করেন তাহলে আপনি ক্ল্যাঙ( Clang) ইনস্টল করতে পারেন Xcode ইনস্টল করার পর। দেখেনিন আপনার XCode এবং Clang একটি টার্মিনাল এর সাহায্যে ইনস্টল করা আছে কিনা ।
de_de: Wenn Sie macOS verwenden, können Sie den Clang-Compiler durch die Installation von XCode installieren. Überprüfen Sie, ob XCode und Clang installiert sind, indem Sie ein Terminal-Fenster öffnen und das Folgende eingeben.
el_gr: Αν χρησιμοποιείτε macOS, μπορείτε να εγκαταστήσετε τον μεταγλωττιστή Clang εγκαθιστώντας το XCode. Ελέγξτε αν έχετε εγκαταστήσει το XCode και το Clang, ανοίγοντας το τερματικό παράθυρο και εισάγοντας τα ακόλουθα.
es_mx: Si utilizas macOS, puedes instalar el compilador Clang al instalar XCode. Comprueba si tienes XCode y Clang instalados abriendo una ventana de terminal y ejecutando los siguientes comandos.
es_un: Si utilizas macOS, puedes instalar el compilador Clang al instalar XCode. Comprueba si tienes XCode y Clang instalados abriendo una ventana de terminal y ejecutando los siguientes comandos.
fr_fr: Si vous utilisez macOS, installez XCode et Clang. Depuis une fenêtre Terminal, vérifiez si XCode et Clang sont bien installés de cette façon.
id_id: Jika Anda menggunakan macOS, Anda dapat menginstal Compiler Clang dengan menginstal XCode. Periksa apakah Anda memiliki XCode dan Clang yang terinstal dengan membuka jendela terminal dan masukkan perintah berikut.
it_it: Se si utilizza macOS, è possibile installare il compilatore Clang installando XCode. Da terminale, eseguire i seguenti comandi per verificare se XCode e Clang sono effettivamente presenti.
ru_ru: Если Вы используете macOS, то можно установить компилятор Clang, предварительно установив XCode. Проверьте, установлены ли XCode и Clang на Вашей системе, открыв окно терминала и введя следующее.
sw_ke: Ikiwa unatumia macOS, unaweza kusakinisha compiler ya Clang kwa kusakinisha XCode. Angalia iwapo umesakinisha XCode na Clang kwa kufungua taminali na kutia yafuatayo.
ta_in: நீங்கள் MacOS யை பயன்படுத்தினால், நீங்கள் XCode நிறுவி க்ளாங் (Clang compiler) நிறுவலாம். ஒரு முனைய சாளரத்தை திறந்து மற்றும் கீழே நுழைக்க நீங்கள் XCode மற்றும் Clang நிறுவப்பட்டுள்ளதா என்று சரிபார்க்கவும்.
tr_tr: MacOS kullanıyorsanız, XCode kurarak Clang derleyicisini kurabilirsiniz. Bir uçbirim penceresi açarak XCode ve Clang in kurulu olup olmadığını denetlemek için aşağıdakini giriniz.
vi_vn: Nếu sử dụng macOS, bạn có thể cài đặt Trình biên dịch Clang bằng cách cài đặt XCode. Kiểm tra nếu bạn đã cài đặt XCode và Clang bằng cách mở terminal và nhập vào.

source: Install XCode and Clang by using the following command.
bn_bn: নিম্নোক্ত কম্যান্ড(আদেশ) অনুসারে এক্সকোড (XCode) এবং ক্ল্যাঙ (Clang) ইনস্টল করুন।
de_de: Installieren Sie XCode und Clang mit dem folgenden Befehl.
el_gr: Εγκαταστήστε το XCode και Clang χρησιμοποιώντας την ακόλουθη εντολή.
es_mx: Instala XCode y Clang usando los siguientes comandos.
es_un: Instala XCode y Clang usando los siguientes comandos.
fr_fr: Installez XCode et Clang via les commandes suivantes.
id_id: Instal XCode dan Clang dengan menggunakan perintah berikut.
it_it: Installare XCode e Clang eseguendo il seguente comando.
ru_ru: Установите XCode и Clang с помощью следующей команды.
sw_ke: Sakinisha XCode na Clang kwa kutumia amri ifuatayo.
ta_in: பின்வரும் கட்டளையை பயன்படுத்தி XCode மற்றும் Clang நிறுத்தவும்.
tr_tr: Takip eden komutu kullanarak XCode ve Clang'ı kurun.
vi_vn: Cài đặt XCode và Clang bằng câu lệnh sau.

source: Compiler for Windows
bn_bn: উইন্ডোস এর কম্পাইলার
de_de: Compiler für Windows
el_gr: Μεταγλωττιστής για Windows
es_mx: Compilador para Windows
es_un: Compilador para Windows
fr_fr: Compilateur pour Windows
id_id: Compiler untuk Windows
it_it: Compilatore per Windows
ru_ru: Компилятор для Windows
sw_ke: Compiler kwa Windows
ta_in: Windows மொழிமாற்றி
tr_tr: Windows için derleyici
vi_vn: Trình biên dịch cho Windows

source: On Windows, it is easiest to install the Visual C++ compiler from the `Build Tools for Visual Studio 2017 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2017>`__. You can instead install Visual Studio version 2015 or 2017, making sure to select the options for installing the C++ compiler.
bn_bn: উইন্ডোজে `Build Tools for Visual Studio 2017 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2017>`__ থেকে ভিজ্যুয়াল সি++(C++) ইনস্টল করা সহজতম।এছাড়াও আপনি সি++(C++) কম্পাইলার ইনস্টল করার বিকল্প নির্বাচন সুনিশ্চিত করে ভিজ্যুয়াল স্টুডিওর ২০১৫ অথবা ২০১৭ সংস্করণ ইনস্টল করতে পারেন।
de_de: In Windows ist es am einfachsten den Visual C++-Compiler aus den `Build Tools for Visual Studio 2017 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2017>`__ zu installieren. Man kann stattdessen auch Visual Studio in der Version 2015 oder 2017 installieren, falls bei diesen während des Installationsvorgangs die Installation des C++-Compilers ausgewählt wird.
el_gr: Στα Windows, είναι ευκολότερο να εγκαταστήσετε τον μεταγλωττιστή Visual C++ από τα `Εργαλεία Κατασκευής για το Visual Studio 2017 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2017>`__. Αντ 'αυτού μπορείτε να εγκαταστήσετε το Visual Studio έκδοση 2015 ή 2017, φροντίζοντας να επιλέξετε τις επιλογές για την εγκατάσταση του μεταγλωττιστή C++.
es_mx: En Windows, lo más fácil de instalar es el compilador Visual C++ desde `Build Tools for Visual Studio 2017 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2017>`__. Por otro lado puedes instalar Visual Studio versión 2015 o 2017, asegurándote de seleccionar las opciones para instalar el compilador C++.
es_un: En Windows, lo más fácil de instalar es el compilador Visual C++ desde `Build Tools for Visual Studio 2017 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2017>`__. Por otro lado puedes instalar Visual Studio versión 2015 o 2017, asegurándote de seleccionar las opciones para instalar el compilador C++.
fr_fr: Sur Windows, le plus simple est d'installer le compilateur Visual C++ depuis `Build Tools for Visual Studio 2017 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2017>`__. Vous pouvez choisir Visual Studio version 2015 ou 2017, en prenant soin de valider les options pour installer le compilateur C++.
id_id: Pada Windows, paling mudah untuk menginstal Visual C++ compiler dari `Build Tools for Visual Studio 2017 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2017>`__. Anda dapat menginstal Visual Studio versi 2015 atau 2017, pastikan untuk memilih pilihan untuk menginstal C++ compiler.
it_it: Su Windows, è più facile installare il compilatore Visual C++ da `Build Tools per Visual Studio 2017 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2017>`__. È possibile altrimenti installare Visual Studio versione 2015 o 2017, assicurandosi di selezionare le opzioni per l'installazione del compilatore C++.
ru_ru: В Windows проще всего установить компилятор Visual C++ из `Build Tools for Visual Studio 2017 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2017>`__. Также Вы можете установить Visual Studio версий 2015 или 2017, выбрав в параметрах установки компилятор С++.
sw_ke: Katika Windows, ni rahisi kusakinisha compiler ya Visual C++ kutoka `Build Tools for Visual Studio 2017 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2017>`__. Badala yake unaweza kusakinisha Visual Studio toleo la 2015 au 2017, ukihakikisha kuchagua chaguo la kusakinisha compiler ya C++.
ta_in: Windows, இது `Build Tools for Visual Studio 2017 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2017>`_. நீங்கள் Visual Studio பதிப்பு 2015 அல்லது 2017 வை நிறுவலாம், C++ compiler ஐ நிறுவுவதற்கு விருப்பத்தேர்வுகள் தேர்வு செய்யவும்.
tr_tr: Windows'ta, Visual C++ derleyicisini `Visual Studio 2017 için Derleme Araçları <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2017>`__. Bunun yerine C++ derleyicisini yükleme seçeneklerini belirlediğinizden emin olarak Visual Studio sürüm 2015 veya 2017'yi yükleyebilirsiniz.
vi_vn: Đối với Windows, cách dễ nhất là cài đặt Visual C++ compiler từ mục `Build Tools for Visual Studio 2017 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2017>`__. Thay vào đó, bạn cũng có thể cài đặt Visual Studio version 2015 hoặc 2017, lưu ý hãy chọn vào tùy chọn cài đặt trình biên dịch C++.

source: Once the compilers are installed, you are ready to install Qiskit Terra.
bn_bn: কম্পাইলার ইনস্টল হয়ে যাওয়ার পর আপনি Qiskit টেরা ইনস্টল করার জন্যে তৈরী।
de_de: Sind die Compiler installiert, kann man mit der Installation von Qiskit Terra fortfahren.
el_gr: Μόλις εγκατασταθούν οι μεταγλωττιστές, είστε έτοιμοι να εγκαταστήσετε το Qiskit Terra.
es_mx: Una vez que los compiladores estén instalados, todo está listo para instalar Qiskit Terra.
es_un: Una vez que los compiladores estén instalados, todo está listo para instalar Qiskit Terra.
fr_fr: Une fois le compilateur installé, vous pouvez installer Qiskit Terra.
id_id: Setelah Compiler diinstal, Anda siap untuk menginstal Qiskit Terra.
it_it: Una volta installati i compilatori, si è pronti per installare Qiskit Terra.
ru_ru: После установки компилятора все готово для установки Qiskit Terra.
sw_ke: Punde compiler zikisakinishwa, u tayari kusakinisha Qiskit Terra.
ta_in: ஒருமுறை தொகு நிறுவப்பட்டால், நீங்கள் Qiskit டெரா நிறுவுவதற்கு தயார்.
tr_tr: Derleyicileri kurulduktan sonra, Qiskit Terra'yı kurmaya hazırsınız.
vi_vn: Khi trình biên dịch được cài đặt, bạn đã sẵn sàng để cài đặt Qiskit Terra.

source: Clone the Terra repository.
bn_bn: টেরা রিপোজিটরিটির ক্লোন বা প্রতিলিপি করুন।
de_de: Klonen Sie das Terra-Repository.
el_gr: Κλωνοποιήστε το αποθετήριο Terra.
es_mx: Clonar el repositorio de Terra.
es_un: Clonar el repositorio de Terra.
fr_fr: Clonez the répertoire Terra.
id_id: Mengkloning repositori Terra.
it_it: Clonare il repository Terra.
pt_un: Clone o repositório Terra.
ru_ru: Склонируйте репозиторий Terra.
sw_ke: Tengeneza pacha wa repo ya Terra.
ta_in: டெர்ரா களஞ்சியத்தை குளோன் செய்யுங்கள்.
tr_tr: Terra deposunu klonlayın.
vi_vn: Clone Terra repository.
