Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: Qiskit documentation is translated (localized) using Crowdin, a software and web localization platform that allows organizations to coordinate translation projects and collaborate with communities to translate materials. Crowdin allows our community of translators to amplify their impact by automatically reusing the work invested translating one sentence to translate other, similar sentences. Crowdin also makes translations resilient to many types of changes to the original material, such as moving sentences around, even across files.
bn_bn: Qiskit ডকুমেন্টেশন অনুবাদ করা হয় (স্থানীয়করণ করা হয়) ক্রাউডিন ব্যবহার করে, একটি সফটওয়্যার এবং ওয়েব লোকালাইজেশন প্ল্যাটফর্ম যা সংস্থাগুলিকে অনুবাদ প্রকল্পগুলিকে সমন্বয় করতে এবং উপকরণগুলি অনুবাদ করতে সম্প্রদায়ের সাথে সহযোগিতা করতে দেয়। ক্রাউডিন আমাদের অনুবাদকদের সম্প্রদায়কে একটি বাক্য অনুবাদ করে অন্য, অনুরূপ বাক্য অনুবাদ করার জন্য বিনিয়োগকৃত কাজের স্বয়ংক্রিয়ভাবে পুনঃব্যবহারের মাধ্যমে তাদের প্রভাব বৃদ্ধি করতে দেয়। ক্রাউডিন অনুবাদকে মূল উপাদানে অনেক ধরনের পরিবর্তনের জন্য স্থিতিস্থাপক করে তোলে, যেমন বাক্যগুলি ঘুরে বেড়ানো, এমনকি ফাইল জুড়েও।
de_de: Die Qiskit-Dokumentation wird übersetzt (lokalisiert) mittels Crowdin, einer Software- und Web-Lokalisierungsplatform, die es Unternehmen ermöglicht Übersetzungsprojekte zu koordinieren und mit Gemeinschaften für Übersetzungen zu kollaborieren. Crowdin ermöglicht es unserer Gemeinschaft von Übersetzern, ihre Leistung zu steigern, indem die Arbeit die in die Übersetzung eines Satzes investiert wurde, automatisch wieder verwendet wird, um andere, ähnliche Sätze zu übersetzen. Crowdin macht Übersetzungen auch widerstandsfähig gegen viele Arten von Änderungen am Originalmaterial, bspw. das Verschieben von Sätzen sogar zwischen Dateien.
es_mx: La documentación de Qiskit se traduce (localiza) usando Crowdin, una plataforma web para localización de software que permite organizar y coordinar proyectos de traducción así como colaborar con comunidades para traducir materiales. Crowdin permite que nuestra comunidad de traductores amplifique su impacto reutilizando automáticamente el trabajo invertido en la traducción de una oración para traducir oraciones similares. Crowdin también hace que las traducciones sean resilientes a diferentes tipos de cambios del material original, como mover las oraciones de lugar, incluso entre archivos.
es_un: La documentación de Qiskit se traduce (se localiza) utilizando Crowdin, un software y una plataforma de localización web que permite a las organizaciones coordinar proyectos de traducción y colaborar con las comunidades para traducir materiales. Crowdin permite que nuestra comunidad de traductores amplifique su impacto al reutilizar automáticamente el trabajo invertido en la traducción de una oración para traducir otras oraciones similares. Crowdin también hace que las traducciones sean resistentes a muchos tipos de cambios en el material original, como mover oraciones, incluso entre archivos.
fr_fr: Les différentes traductions de la documentation Qiskit sont réalisées via l'outil Crowdin. Cette plateforme Web permet aux organisations de coordonner la traduction, facilite la collaboration et permet de ré-utiliser du matériel déjà traduit. Crowdin aide à la stabilité de la documentation traduite en assurant la mise à jour de phrases équivalentes présents dans différents fichiers.
id_id: Dokumentasi Qiskit diterjemahkan (terlokalisasi) menggunakan Crowdin, sebuah perangkat lunak dan platform lokalisasi web yang memungkinkan organisasi untuk mengoordinasikan proyek penerjemahan dan berkolaborasi dengan komunitas untuk menerjemahkan materi. Crowdin memungkinkan komunitas para penerjemah kita untuk memperkuat dampak mereka dengan secara otomatis menggunakan kembali karya yang diinvestasikan untuk menerjemahkan satu kalimat untuk menerjemahkan kalimat lain yang serupa. Crowdin juga membuat ketahanan terjemahan terhadap banyak jenis perubahan pada material aslinya, seperti memindahkan kalimat ke sekitarnya, bahkan dapat melintasi antar berkas.
it_it: La documentazione di Qiskit è tradotta (localizzata) usando Crowdin, una piattaforma software e web di localizzazione che consente alle organizzazioni di coordinare progetti di traduzione e collaborare con le comunità per la traduzione dei materiali. Crowdin permette alla nostra comunità di traduttori di amplificare il loro impatto riutilizzando automaticamente il lavoro investito nella traduzione di una frase per tradurre altre frasi simili. Crowdin rende inoltre le traduzioni flessibili a più tipi di modifiche al materiale originale, come lo spostamento di frasi, anche tra file.
pt_un: A documentação do Qiskit é traduzida (localizada) usando Crowdin, uma plataforma de tradução de software e web que permite às organizações coordenar projetos de tradução e colaborar com as comunidades para traduzir materiais. O Crowdin permite que nossa comunidade de tradutores amplie seu impacto reutilizando automaticamente o trabalho investido traduzindo uma frase para traduzir outras frases similares. Também permite flexibilizar as traduções diante de mudanças nos arquivos do projeto, como mover frases de uma parte para outra ou até mesmo entre arquivos.
ru_ru: Документация по Qiskit переведена с помощью платформы Crowdin - веб-платформы локализации, которая позволяет организациям координировать работу над переводами и сотрудничать с сообществами с целью перевода материалов. Crowdin позволяет нашему сообществу переводчиков увеличивать их вклад, автоматически переиспользуя уже сделанную работу, используя ранее переведенные предложения для помощи с переводом других похожих предложений. Crowdin также делает переводы устойчивыми ко многим типам изменений оригинального материала, таким как перемещение предложений, даже между разными файлами.
sw_ke: Nyaraka za Qiskit zinatafsiriwa (zilizowekwa ndani) kwa kutumia Crowdin, programu na jukwaa la ujanibishaji wa wavuti ambalo linaruhusu mashirika kuratibu miradi ya kutafsiri na kushirikiana na jamii kutafsiri vifaa. Crowdin inaruhusu jamii yetu ya watafsiri kukuza athari zao kwa kutumia tena kazi iliyowekezwa kutafsiri sentensi moja kutafsiri sentensi zingine zinazofanana. Crowdin pia hufanya tafsiri ziwe na kinga dhidi ya aina nyingi za mabadiliko kwa nyenzo asili, kama vile kubadilisha nafasi za sentensi, hata kutoka faili moja hadi faili nyingine.
ta_in: மொழிபெயர்ப்பு திட்டங்களை ஒருங்கிணைக்கவும், பொருட்களை மொழிபெயர்க்க சமூகங்களுடன் ஒத்துழைக்கவும் நிறுவனங்களை அனுமதிக்கும் ஒரு மென்பொருள் மற்றும் வலை உள்ளூர்மயமாக்கல் தளமான Crowdin னைப் பயன்படுத்தி Qiskit ஆவணங்கள் மொழிபெயர்க்கப்பட்டுள்ளன (localized). Crowdin எங்கள் மொழிபெயர்ப்பாளர்களின் சமூகம் ஒரு வாக்கியத்தை மொழிபெயர்க்க முதலீடு செய்த வேலையை தானாக மீண்டும் பயன்படுத்துவதன் மூலம் அவற்றின் தாக்கத்தை அதிகரிக்க அனுமதிக்கிறது. கோப்புகளின் குறுக்கே கூட வாக்கியங்களை நகர்த்துவது போன்ற அசல் பொருளின் பல வகையான மாற்றங்களுக்கு Crowdin மொழிபெயர்ப்புகளை நெகிழ வைக்கிறது.
tr_tr: Qiskit dokümantasyonu, organizasyonların çeviri projeleri koordine etmesini ve materyalleri çevirmek için topluluklarla iş birliği yapmasını sağlayan bir yazılım ve web yerelleştirme platformu olan Crowdin kulllanılarak çevrilir (yerelleştirilir). Crowdin tercümanlar topluluğu tarafından oluşturulan bir cümle çevirisi işini diğer benzer cümleleri çevirmek için otomatik olarak tekrar kullanarak tercümanlarımızın etkisini güçlendirmek için olanak sağlamaktadır. Crowdin ayrıca çevirilerde dosyalar arasında cümleleri hareket ettirmek gibi orijinal materyalde yapılan birçok türde değişikliğe dayanıklı hale getirir.
vi_vn: Tài liệu Qiskit được dịch sử dụng Crowdin, một phần mềm, nền tảng web cho phép các tổ chức có thể quản lý các dự án dịch và cộng tác với cộng đồng để có thể dịch các tài liệu. Crowdin cho phép các dịch giả có thể nâng cao khả năng của họ bằng việc tự động tái sử dụng các phần đã được dịch để có thể dịch các câu tương tự khác. Crowdin cũng khiến các bản dịch có thể thay đổi dễ dàng đối với những thay đổi trong tài liệu gốc, ví dụ như dịch chuyển các câu trong đoạn, thậm chí trong các tệp với nhau.

source: Qiskit localization requests are handled in `Qiskit Translations <https://github.com/Qiskit/qiskit-translations>`__ repository. To contribute to Qiskit localization, please follow these steps:
bn_bn: Qiksit স্থানীয়করণের অনুরোধগুলি হ্যান্ডেল করা হয় `Qiskit অনুবাদ <https://github.com/Qiskit/qiskit-translations>`__রিপোসিটরিতে। Qiksit স্থানীয়করণে অবদান করার জন্যে এই পদ্দক্ষেপ গুলো করুন:
de_de: Anfragen zur Qiskit-Übersetzung werden im `Qiskit Translations <https://github.com/Qiskit/qiskit-translations>` Repository bearbeitet. Um bei der Qiskit-Übersetzung zu helfen, ist wie folgt vorzugehen:
el_gr: Τα αιτήματα μετάφρασης του Qiskit διεκπεραιώνονται στο αρχείο `Qiskit Translations <https://github.com/Qiskit/qiskit-translations>`__ repository. Για να συμβάλετε στον εντοπισμό του Qiskit, ακολουθήστε τα παρακάτω βήματα:
es_mx: Las solicitudes de localización de Qiskit se gestionan en el repositorio `Qiskit Translations <https://github.com/Qiskit/qiskit-translations>`__. Para contribuir a la localización de Qiskit, siga estos pasos:
es_un: Las solicitudes de localización de Qiskit se gestionan en el repositorio `Qiskit Translations <https://github.com/Qiskit/qiskit-translations>`__. Para contribuir a la localización de Qiskit, sigue estos pasos:
fr_fr: Les demandes de traductions de Qiskit sont faites dans le répertoire `Qiskit Translations <https://github.com/Qiskit/qiskit-translations>`__. Pour participer à la traduction de Qiskit, suivez les étapes suivantes :
id_id: Permintaan lokalisasi Qiskit ditangani dalam repositori `Qiskit Translations <https://github.com/Qiskit/qiskit-translations>`__. Untuk berkontribusi pada lokalisasi Qiskit, harap ikuti langkah-langkah berikut ini:
it_it: Le richieste di localizzazione di Qiskit sono gesite nel repository `Qiskit Translations <https://github.com/Qiskit/qiskit-translations>`__. Per contribuire alla localizzazione di Qiskit, si prega di seguire i seguenti passaggi:
pt_un: Os pedidos de localização do Qiskit são tratados no repositório `Qiskit Translations <https://github.com/Qiskit/qiskit-translations>`__. Para contribuir com a localização do Qiskit, por favor, siga estas etapas:
ru_ru: Запросы на перевод материалов Qiskit обрабатываются в репозитории ` Qiskit Translations <https://github.com/Qiskit/qiskit-translations>` __. Для того, чтобы внести вклад в локализацию Qiskit, Вам нужно сделать следующее:
sw_ke: Agizo za ujanibishaji wa Qiskit zinashughulikiwa katika repo ya `Qiskit Translations <https://github.com/Qiskit/qiskit-translations>`__. Ili kuchangia katika ujanibishaji wa Qiskit, tafadhali fuata hatua zifuatazo:
ta_in: Qiskit localization கோரிக்கைகள் `Qiskit Translations <https://github.com/Qiskit/qiskit-translations>`__ repository. Qiskit localization பங்களிப்பதற்கு, தயவு செய்து இந்த படிப்பை பின்பற்றவும்:
tr_tr: Qiskit yerelleştirme istekleri `Qiskit Translations <https://github.com/Qiskit/qiskit-translations>`__ repository/deposuna işlenir. Qiskit yerelleştirmesine katkı sağlamak için, lütfen bu adımları takip edin:
vi_vn: Các yêu cầu dịch tài liệu được lưu ở `Qiskit Translations <https://github.com/Qiskit/qiskit-translations>`. Để có thể bắt đầu dịch các tài liệu, hãy làm theo các bước sau:

source: Add your name (or ID) to the `LOCALIZATION_CONTRIBUTORS <https://github.com/qiskit-community/qiskit-translations/blob/master/LOCALIZATION_CONTRIBUTORS>`__ file.
bn_bn: নিজের নাম (অথবা আই ডি) `LOCALIZATION_CONTRIBUTORS <https://github.com/qiskit-community/qiskit-translations/blob/master/LOCALIZATION_CONTRIBUTORS>`__ নথিভুক্ত করুন।.
de_de: Füge den Namen (oder die ID) zu der Datei `LOCALIZATION_CONTRIBUTORS <https://github.com/Qiskit/qiskit/blob/master/docs/ LOCALIZATION_CONTRIBUTORS>`__ hinzu.
el_gr: Προσθέστε το όνομά σας (ή ID) στο αρχείο `LOCALIZATION_CONTRIBUTORS <https://github.com/qiskit-community/qiskit-translations/blob/master/LOCALIZATION_CONTRIBUTORS>`__.
es_mx: Añada su nombre (o ID) al archivo `LOCALIZATION_CONTRIBUTORS <https://github.com/qiskit-community/qiskit-translations/blob/master/LOCALIZATION_CONTRIBUTORS>`__.
es_un: Añade tu nombre (o ID) al archivo `LOCALIZATION_CONTRIBUTORS <https://github.com/qiskit-community/qiskit-translations/blob/master/LOCALIZATION_CONTRIBUTORS>`__.
fr_fr: Ajoutez votre nom (ou ID) au fichier `LOCALIZATION_CONTRIBUTORS <https://github.com/Qiskit/qiskit-translations/blob/master/LOCALIZATION_CONTRIBUTORS>`__ .
id_id: Tambahkan nama Anda (atau ID) ke `LOCALIZATION_KONTRIBUTOR <https://github.com/qiskit-community/qiskit-translations/blob/master/LOCALIZATION_CONTRIBUTORS>`__ file.
it_it: Aggiungere il proprio nome (o ID) al file `LOCALIZATION_CONTRIBUTORS <https://github.com/qiskit-community/qiskit-translations/blob/master/LOCALIZATION_CONTRIBUTORS>`__.
pt_un: Inclua seu nome (ou ID) no arquivo `LOCALIZATION_CONTRIBUTORS <https://github.com/qiskit-community/qiskit-translations/blob/master/LOCALIZATION_CONTRIBUTORS>`__.
ru_ru: Добавить свое имя (или ID) в файл `LOCALIZATION_CONTRIBUTORS <https://github.com/qiskit-community/qiskit-translations/blob/master/LOCALIZATION_CONTRIBUTORS>`__.
sw_ke: Ongeza jina lako (au ID) katika faili ya `LOCALIZATION_CONTRIBUTORS <https://github.com/qiskit-community/qiskit-translations/blob/master/LOCALIZATION_CONTRIBUTORS>`__.
ta_in: உங்கள் பெயர் (அல்லது அடையாளம்) `LOCALIZATION_CONTRIBUTORS <https://github.com/qiskit-community/qiskit-translations/blob/master/LOCALIZATION_CONTRIBUTORS>`_ கோப்புக்கு சேர்.
tr_tr: İsminizi ya da (ID) `LOCALIZATION_CONTRIBUTORS <https://github.com/qiskit-community/qiskit-translations/blob/master/LOCALIZATION_CONTRIBUTORS>`__ dosyasına ekleyin.
vi_vn: Thêm tên (hoặc mã định danh) vào tệp `LOCALIZATION_CONTRIBUTORS <https://github.com/qiskit-community/qiskit-translations/blob/master/LOCALIZATION_CONTRIBUTORS>`__.

source: Create a pull request (PR) to merge your change. Make sure to follow the template to open a Pull Request.
bn_bn: একটি পুল রিকোয়েস্ট (পি আর) তৈরী করুন নিজের পরিবর্তন মার্জ করার জন্যে। নিশ্চিত করুন যে পুল রেকুএস্টটি টেম্পলেট অনুসারে তৈরী।
de_de: Erstelle einen Pull-Request (PR), um Änderungen zu mergen. Achte darauf, der Vorlage für Pull-Anforderung zu folgen.
el_gr: Δημιουργήστε μια αίτηση λήψης (PR) για να συγχωνεύσετε τις αλλαγές σας. Ακολουθήστε το πρότυπο για να ανοίξετε μια αίτηση πρόσβασης.
es_mx: Realice un pull request (PR) para incluir el cambio. Asegúrese de seguir la plantilla para abrir una pull request.
es_un: Crea un pull request (PR) para incluir el cambio. Asegúrate de seguir la plantilla para abrir un pull request.
fr_fr: Créez une pull request (PR) pour remonter les modifications. Suivez l'exemple suivant pour ouvrir une Pull Request.
id_id: Buat pull request (PR) untuk menggabungkan perubahan Anda. Pastikan untuk mengikuti contoh untuk membuka Pull request.
it_it: Creare una Richiesta di Pull per effettuare la merge delle modifiche apportate. Assicurarsi di seguire il modello presente per aprire una Richiesta di Pull.
pt_un: Crie um pull request (PR) para fazer merge da sua alteração. Certifique-se de seguir o modelo para abrir um Pull Request.
ru_ru: Создать Pull request (PR) для слияния изменений. Убедитесь, что ваш Pull request соответствует шаблону.
sw_ke: Tengenza ombi la kuvuta (PR) ili kuunganisha mabadiliko yako. Hakikisha unafuata kiolezo kufungua Pull Request.
ta_in: உங்கள் மாறுபாட்டை ஒன்றுசேர் கொண்டு ஒரு புல் ரிக்வெஸ்ட்(PR) உருவாக்குக. புல் ரிக்வெஸ்ட் திறக்க வார்ப்புருவை பின்பற்றவும்.
tr_tr: Değişikliğinizi birleştirmek için bir pull request (PR) oluşturun. Bir pull request açmak için şablonu takip ettiğinizden emin olun.
vi_vn: Tạo một pull request(PR) để merge thay đổi của bạn. Hãy chắc chắn pull request của bạn được tạo theo bản mẫu.

source: Each contributor has to create their own PR and sign the CLA.
bn_bn: প্রত্যেকটি অবদানকারীদের একটি পি আর তৈরী করতে হবে এবং সি এল এ স্বাক্ষর করতে হবে.
de_de: Jeder Mitwirkende muss seinen eigenen Pull-Request erstellen und die Mitwirkenden-Lizenzvereinbarung - Contributors License Agreement (CLA) - unterschreiben.
el_gr: Κάθε συνεισφέρων πρέπει να δημιουργήσει το δικό τους PR και να υπογράψει το CLA.
es_mx: Cada colaborador debe crear su propio PR y firmar el acuerdo de licencia de colaborador (CLA).
es_un: Cada colaborador debe crear su propio PR y firmar el acuerdo de licencia de colaborador (CLA).
fr_fr: Chaque contributeur doit créer sa propre PR et signer le CLA.
id_id: Setiap kontributor harus membuat PR mereka sendiri dan menyetujui CLA.
it_it: Ogni collaboratore deve creare la propria richiesta di pull e firmare il CLA.
pt_un: Cada contribuinte deve criar o seu próprio PR e assinar o CLA.
ru_ru: Каждый участник должен создать свой собственный PR и подписать CLA.
sw_ke: Kila mchangiaji anapaswa kuunda PR yake mwenyewe na kutia sahihi CLA.
ta_in: ஒவ்வொரு பங்களிப்பும் தங்களது PR உருவாக்க மற்றும் CLA கையெழுத்தைக் குறி.
tr_tr: Her katkıda bulunan kişi kendi PR'ini oluşturmak ve CLA'yı imzalamak zorundadır.
vi_vn: Mỗi người đóng góp phải tạo pull request (PR) của riêng họ và kí CLA.

source: Please mention the language that you'd like to contribute to in the PR summary.
bn_bn: PR সংক্ষিপ্তসারে আপনি যে ভাষায় অবদান রাখতে চান দয়া করে উল্লেখ করুন।
de_de: Die Pull-Request Zusammenfassung sollte die Sprache beinhalten, an der man mitwirken möchte.
el_gr: Παρακαλείστε να αναφέρετε τη γλώσσα στην οποία θα θέλατε να συνεισφέρετε στην περίληψη των PR.
es_mx: Por favor, indique en el resumen del PR el idioma al que desea contribuir.
es_un: Por favor, indica en el resumen del PR el idioma al que deseas contribuir.
fr_fr: Précisez la langue pour laquelle vous souhaitez contribuer dans le résumé de la PR.
id_id: Harap menyebutkan bahasa yang anda inginkan untuk berkontribusi di dalam ringkasan PR.
it_it: Si prega di menzionare la lingua a cui si desidera contribuire nel sommario della richiesta di pull.
pt_un: Por favor, mencione o idioma para o qual você gostaria de contribuir no sumário da PR.
ru_ru: Пожалуйста, укажите в PR язык, на котором Вы хотели бы внести свой вклад.
sw_ke: Tafadhali taja lugha ambayo ungependa kuchangia katika muhtasari wa PR.
ta_in: தயவு செய்து PR சுருக்கத்தில் பங்களிப்பதற்கு விரும்பும் மொழியை குறிப்பிடுக.
tr_tr: Lütfen PR özetinde katkı sağlamak istediğiniz dili belirtin.
vi_vn: Hãy đề cập đến ngôn ngữ mà bạn muốn đóng góp ở trong phần tóm tắt của pull request (PR).

source: If you have an open issue for a language request, **add the issue link to the PR**.
bn_bn: যদি আপনার একটা ভাষার ইসু খোলা থাকে **add the issue link to the PR**.
de_de: Falls es ein offenes Issue für eine Sprachanfrage gibt, **füge den Link zum Thema PR hinzu**.
el_gr: Εάν έχετε ένα ανοικτό ζήτημα για ένα αίτημα γλώσσας, **προσθέστε τον σύνδεσμο ζητήματος στο PR**.
es_mx: Si tienes un issue abierto en el que se solicita un idioma, **agrega el link del issue al Pull Request**.
es_un: Si tienes un issue abierto en el que se solicita un idioma, **agrega el vínculo del issue al PR**.
fr_fr: Si vous devez ouvrir un ticket pour cette demande, **ajoutez, dans la PR, le lien vers le ticket **.
id_id: Jika Anda memiliki masalah terkait permintaan bahasa, **tambahkan tautan masalah ke PR**.
it_it: Se ci sono issue aperte per una richiesta di localizzazione, **aggiungere il link della issue alla richiesta di pull**.
pt_un: Se você tem uma issue aberta para uma solicitação de idioma, **adicione o link da issue ao PR**.
ru_ru: Если есть открытая задача по добавлению языка в проект, **добавьте ссылку на нее в PR**.
sw_ke: Iwapo una suala wazi la agizo la lugha, **ongeza kiunga cha suala kwa PR**.
ta_in: ஒரு மொழி கோரிக்கைக்கு ஒரு திறந்த பிரச்சினை உண்டு என்றால், **PR க்கு இணைப்பு இணைப்பை சேர்க்கவும்**.
tr_tr: Eğer bir dil isteği için açık bir sorununuz varsa, **PR'e sorun bağlantısını ekleyin**.
vi_vn: Nếu bạn có vấn đề (issue) đối với yêu cầu của bạn, **thêm đường dẫn đến vấn đề (issue) của bạn ở trong PR**.

source: You will be asked to sign the Qiskit Contributors License Agreement (CLA); please do so.
bn_bn: আপনাকে Qiskit কন্ট্রিবিউটর্স (অবদানকারী) License এগ্রিমেন্ট (চুক্তি) স্বাক্ষর করার জন্য বলা হবে; অনুগ্রহপূর্বক সেটি করুন।
de_de: Sie werden aufgefordert, das Qiskit-Zahler License Agreement (CLA) zu unterzeichnen; bitte tun Sie das.
el_gr: Θα σας ζητηθεί να υπογράψετε το συμφωνητικό άδειας χρήσης (CLA) για τους συνεισφέροντες στο Qiskit; Παρακαλείστε να το κάνετε.
es_mx: Se le pedirá que firme el Acuerdo de Licencia de Contribuidor (CLA); por favor, hágalo.
es_un: Se te pedirá que firmes el Acuerdo de Licencia de Contribuidor (CLA); por favor, házlo.
fr_fr: Il vous sera demandé de signer le Qiskit Contributors License Agreement (CLA).
id_id: Anda akan diminta untuk menandatangani Perjanjian Lisensi Kontributor Qiskit (Qiskit Contributor License Agreement-"CLA"); harap lakukan hal tersebut.
it_it: Verrà richiesto di firmare il Qiskit Contributors License Agreement (CLA); si prega di farlo.
pt_un: Você será solicitado a assinar o Contrato de Licença dos Colaboradores de Qiskit (CLA); por favor, faça.
ru_ru: Вам будет предложено подписать Лицензионное соглашение участников проекта Qiskit Contributors (CLA); пожалуйста, сделайте это.
sw_ke: Utaagizwa utie sahihi Qiskit Contributors License Agreement (CLA); tafadhali fanya hivyo.
ta_in: Qiskit Contributors License Agreement (CLA); கையெழுத்திடுமாறு கேட்கப்படுவீர்கள்; தயவுசெய்து அவ்வாறு செய்யுங்கள்.
tr_tr: Qiskit Katkı Sağlayan Lisans Sözleşmesi'ni (CLA) imzalamanız istenecektir; lütfen bunu yapın.
vi_vn: Bạn sẽ được yêu cầu kí Qiskit Contributors License Agreement (CLA); hãy làm theo.
