Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: We use `GitHub pull requests <https://help.github.com/articles/about-pull-requests>`__ to accept contributions.
bn_bn: আমরা কারো অংশগ্রহণ নিশ্চিত করার জন্য `GitHub pull requests <https://help.github.com/articles/about-pull-requests>`__ ব্যবহার করি।
de_de: Wir verwenden `GitHub Pull-Requests <https://help.github.com/articles/about-pull-requests>`__ um Beiträge zu akzeptieren.
el_gr: Χρησιμοποιούμε τα `GitHub pull requests <https://help.github.com/articles/about-pull-requests>`__ για να δεχτούμε συνεισφορές.
es_mx: Utilizamos `pull requests de Github <https://help.github.com/articles/about-pull-requests>`__ para aceptar las contribuciones.
es_un: Utilizamos `pull requests de Github <https://help.github.com/articles/about-pull-requests>`__ para aceptar las contribuciones.
fr_fr: Nous utilisons la fonctionalité `pull request de GitHub <https://help.github.com/articles/about-pull-requests>`__ pour accepter de nouvelles contributions.
id_id: Kami menggunakan `permintaan tarik (pull request) GitHub <https://help.github.com/articles/about-pull-requests>`__ untuk menerima kontribusi.
it_it: Utilizziamo `GitHub pull requests <https://help.github.com/articles/about-pull-requests>`__ per accettare contributi.
ko_kr: 커뮤니티는 `Github pull request <https://help.github.com/articles/about-pull-requests>`__ 을 통해 여러분의 기여를 받는다.
pl_pl: Funkcja `GitHub pull requests <https://help.github.com/articles/about-pull-requests>`__ służy do wysyłania i akceptacji próśb o dostęp do współtworzenia witryny.
pt_un: Utilizamos `GitHub pull requests <https://help.github.com/articles/about-pull-requests>`__ para aceitar contribuições.
ru_ru: Мы используем ` GitHub pull requests <https://help.github.com/articles/about-pull-requests>` __ для приема вкладов.
sw_ke: Tunatumia `GitHub pull requests <https://help.github.com/articles/about-pull-requests>`__ ili kukubali michango.
ta_in: நாம் நம் பங்களிப்பை ஏற்றுக்கொள்ள `GitHub pull requests <https://help.github.com/articles/about-pull-requests>`__ பயன்படுத்துவோம்.
te_in: మేము సహకారాలను ఆమోదించడానికి ` GitHub పుల్ రిక్వెస్ట్లను <https://help.github.com/articles/about-pull-requests>` ఉపయోగిస్తాము.
vi_vn: Chúng tôi sử dụng GitHub pull requests <https://help.github.com/articles/about-pull-requests>`__ để chấp nhận các sự đóng góp.
zh_tw: 我們使用 `GitHub 拉取請求 <https://help.github.com/articles/about-pull-requests>`__ 以接受貢獻。

source: While not required, opening a new issue about the bug you're fixing or the feature you're working on before you open a pull request is an important step in starting a discussion with the community about your work. The issue gives us a place to talk about the idea and how we can work together to implement it in the code. It also lets the community know what you're working on, and if you need help, you can reference the issue when discussing it with other community and team members.
bn_bn: সাধারণত প্রয়োজন না হলেও পুল রিকোয়েস্ট দেয়ার পূর্বে, আপনি যে ত্রুটি সংশোধন করছেন বা যে ফিচারটি নিয়ে কাজ করছেন সে সম্পর্কিত একটি নতুন ইস্যু খোলার মাধ্যমে কমিউনিটির সাথে একটি আলোচনায় অংশ নিতে পারেন। এর মাধ্যমে হয়তো আপনি নতুন কোনো ধারণা পেতে পারেন এবং সবাই মিলে ইস্যুটি কীভাবে কোডে বাস্তবায়ন করা যায় সে সম্পর্কে বিশদ আলোচনা করতে পারেন। এছাড়াও এর মাধ্যমে কমিউনিটি জানতে পারবে আপনি কী নিয়ে কাজ করছেন এবং প্রয়োজন হলে আপনার উল্লেখিত ইস্যু নম্বর থেকে অন্যান্য কমিউনিটি বা তার সদস্যদের কাছ থেকে আপনি সাহায্যও পেতে পারেন।
de_de: Obwohl nicht zwingend benötigt sollte ein Issue bzgl. dem Bug oder dem Feature an welchem man arbeitet vor dem Pull Request geöffnet werden. Dies ist ein wichtiger Schritt um die Diksussion mit der Community bzgl. der Änderungen zu beginnen. Mit einem Issue wird es ermöglicht die Idee zu besprechen und zu erörtern wie entsprechender Code implementiert werden muss. Des Weiteren kann so die Community erfahren an was man gerade arbeitet, ob Hilfe benötigt wird, und zusätzlich kann man auf das Issue in Diskussionen referenzieren.
el_gr: Αν και δεν απαιτείται, ανοίγοντας ένα νέο ζήτημα σχετικά με το σφάλμα που διορθώνετε ή τη λειτουργία που εργάζεστε πριν ανοίξετε ένα αίτημα λήψης είναι ένα σημαντικό βήμα στην έναρξη μιας συζήτησης με την κοινότητα σχετικά με την εργασία σας. Το θέμα μας δίνει τη δυνατότητα να μιλήσουμε για την ιδέα και τον τρόπο με τον οποίο μπορούμε να συνεργαστούμε για την εφαρμογή της στον κώδικα. Επιτρέπει επίσης στην κοινότητα να γνωρίζει τι εργάζεστε, και αν χρειάζεστε βοήθεια, μπορείτε να αναφέρετε το θέμα όταν το συζητάτε με άλλα μέλη της κοινότητας και της ομάδας.
es_mx: Aunque no es obligatorio, abrir un nuevo asunto sobre un error que estás tratando de arreglar o una nueva funcionalidad en la que estás trabajando antes de hacer un pull request es importante, de cara a poder discutir con la comunidad de Qiskit tu trabajo. Este asunto genera un espacio de diálogo para hablar sobre la idea y sobre cómo la comunidad puede trabajar conjuntamente para implementarlo en código. Además, esto permite conocer a la comunidad que estás trabajando en un asunto particular y, si necesitas ayuda, siempre puedes hacer referencia al asunto abierto para discutir la idea con otros miembros del equipo y la comunidad.
es_un: Aunque no es obligatorio, abrir una nueva incidencia sobre el error que estás arreglando o la funcionalidad en la que estás trabajando antes de abrir un Pull Request, es un paso importante para iniciar una discusión con la comunidad sobre tu trabajo. La incidencia nos da un lugar para hablar sobre la idea y cómo podemos trabajar juntos para implementarla en el código. También le permite a la comunidad saber en qué estás trabajando y, si necesitas ayuda, puedes hacer referencia a la incidencia cuando lo discutas con otros miembros de la comunidad y del equipo.
fr_fr: Même si cela n'est pas obligatoire, ouvrir un ticket (issue) est une étape importante pour initier une discussion avec la communauté sur votre travail lorsque vous corrigez une anomalie ou développez une nouvelle fonctionnalité . Le ticket est un endroit partagé pour réfléchir sur l'idée et voir comment travailler ensemble. Si vous avez besoin d'aide, que vous souhaitez discuter avec d'autres membres de l'équipe, vous pourrez aussi faire référence à ce ticket.
id_id: Walaupun tidak diwajibkan, membuka isu baru tentang bug yang sedang Anda perbaiki atau fitur yang sedang Anda kerjakan sebelum Anda membuka permintaan tarik (pull request) adalah langkah penting dalam memulai diskusi dengan komunitas tentang pekerjaan Anda. Isu ini memberi kita tempat untuk berbicara tentang ide dan bagaimana kita dapat bekerja sama untuk menerapkannya dalam kode. Hal ini juga memungkinkan komunitas mengetahui apa yang sedang Anda kerjakan, dan jika Anda membutuhkan bantuan, Anda dapat mengacu pada isu tersebut ketika mendiskusikannya dengan komunitas dan anggota tim lainnya.
it_it: Anche se non è richiesto, aprire una nuova issue sul bug che stai correggendo o sulla funzionalità su cui stai lavorando prima di aprire una richiesta di pull è un passo importante per iniziare una discussione con la comunità sul tuo lavoro. Aprire una issue ci dà la possibilità di poter parlare dell'idea e di come si può lavorare insieme per implementarla nel codice. Inoltre, consente alla comunità di sapere su cosa stai lavorando e, se hai bisogno di aiuto, puoi fare riferimento all'issue quando ne discuti con altri membri della comunità e del team.
ko_kr: 필수는 아니지만 풀 리퀘스트를 제출하기 전 본인이 수정 중인 버그나 개발 중인 기능에 대한 커뮤니티에서 논의를 시작하기 위해 새로운 이슈(Issue)를 제출하는 것은 중요하다. 이슈는 아이디어를 어떻게 코드로 구현을 할 수 있을지 함께 논의하는 공간을 제공한다. 아울러 여러분이 하는 일을 커뮤니티가 알 게하고, 도움이 필요한 경우에 다른 커뮤니티와 팀 멤버들이 이슈를 통해 확인할 수 있게 돕는다.
pl_pl: Chociaż nie jest to wymagane, utworzenie nowego problemu dotyczącego błędu, który naprawiasz lub funkcji, nad którą pracujesz, przed wysłaniem Pull Requestu, jest ważnym krokiem w rozpoczęciu dyskusji ze społecznością na temat twojej pracy. Daje to pole do rozmowy o twoim pomyśle i o tym, co możemy zrobić, aby uwzględnić go w kodzie. Pozwala to także społeczności zapoznać się z materiałem, nad którym pracujesz, a jeśli potrzebujesz pomocy, możesz odnieść się do problemu podczas omawiania go z społecznością i członkami zespołu.
pt_un: Embora não seja obrigatório, é recomendável abrir uma nova issue sobre o bug que você está consertando, ou o recurso em que está trabalhando antes de abrir um pull request. A issue nos proporciona um espaço para iniciar uma discussão com a comunidade sobre o seu trabalho, falar sobre a ideia e como podemos trabalhar juntos para implementá-la no código. Também permite a comunidade saber no que você está trabalhando, e se precisar de ajuda, é possível referencia-lá ao discutir com outros membros da comunidade e da equipe.
ru_ru: Хотя это и не обязательно, но открытие новой задачи (issue) с сообщением о том, что вы исправляете ошибку или разрабатываете новую функцию, прежде чем вы откроете pull request, является важным шагом для начала обсуждения своей работы с сообществом. Открытая задача предоставляет пространство для обсуждения идеи и возможностей совместной работы по ее реализации в коде. Она также позволяет сообществу понять, над чем вы работаете, и дает возможность ссылаться на нее при обсуждении с другими членами сообщества и команды.
sw_ke: Ingawa haihitajiki, kufungua suala jipya kuhusu kasoro unayorekebisha au kipengele unachokifanyia kazi kabla ya kufungua ombi la kuvuta ni hatua muhimu katika kuanzisha majadiliano na jamii kuhusu kazi yako. Suala hilo linatupa nafasi ya kuzungumzia wazo hilo na jinsi tunavyoweza kufanya kazi pamoja kutekeleza kama msimbo. Pia inaipa fursa jamii kujua unachofanya kazi, na iwapo unahitaji msaada, unaweza kutaja suala hilo wakati wa majadiliano na wanajamii na wahusika katika timu.
ta_in: தேவையற்ற போது புதிதாக ஒரு புல் ரிக்வெஸ்ட் -ஐ உருவாக்குவதற்கு முன்பு, ஒரு புதிய இஸ்சு -வை உருவாக்குவது நீங்கள் சரிபார்க்கும் பிழை அல்லது வேலை பார்க்கும் அம்சத்தைப் பற்றி சமூகத்தில் கலந்துரையாடலைத் தேவைப்படும் ஒரு முக்கியப் படியாகும். நீங்கள் உருவாக்கும் இஸ்சு, நீங்கள் உங்களின் யோசனையைப் பற்றிப் பேசுவதற்கான இடத்தை கொடுக்கிறது மற்றும் அதை உங்கள் செயல்திட்டத்தின் கோடு -உடன் எவ்வாறு ஒன்றிணைத்து செயல்படுத்துவது என்பதையும் கலந்துரையாட வழிவகுக்கிறது. அது மட்டுமல்லாது, நீங்கள் என்ன வேலை செய்கிறீர்கள் என்பதையும் சமூகத்தினரால் அறிய முடியும் மற்றும் உங்களுக்கு ஏதாவது உதவி தேவைப்பட்டால், அந்த இஸ்சு -வை குறிப்பிட்டு உங்கள் குழுவிடமோ அல்லது சமூகத்திடமோ கேட்டுத் தெரிந்து கொள்ளலாம்.
tr_tr: Pull request'i açmadan önce üzerinde çalıştığınız özellik veya çözdüğünüz hata hakkında gerekli olmasa da yeni bir sorun açmak, çalışmanız hakkında topluluk ile bir tartışma başlatmada önemli bir adımdır. Sorun fikir ve onu koda uygulamak için birlikte nasıl çalışacağımız hakkında konuşmamız için bize bir yer verir. Ayrıca topluluğun sizin ne üzerine çalıştığınızı bilmesine izin verir ve eğer yardıma ihtiyacınız olursa diğer topluluk ve takım üyeleri ile tartışırken sorunu kaynak gösterebilirsiniz.
vi_vn: Mặc dù không được yêu cầu, tuy nhiên mở một issue về lỗi bạn đang sửa hoặc tính năng bạn đang hoàn thành trước khi mở một pull request là một bước quan trọng khi bắt đầu thảo luận với cộng đồng về công việc bạn đang làm. Issue bạn mở là một nơi chúng ta có thể thảo luận về ý tưởng và cách chúng có thể triển khai. Nó cũng cho cộng đồng thấy việc bạn đang làm, nếu bạn cần sự hỗ trợ, bạn có thể trích dẫn lại lá issue đó khi thảo luận nó với các cộng đồng khác và thành viên trong nhóm bạn.

source: If you've written some code but need help finishing it, want to get initial feedback on it prior to finishing it, or want to share it and discuss prior to finishing the implementation, you can open a *Work in Progress* pull request. When you create the pull request, prepend the title with the **\[WIP\]** tag (for Work In Progress). This will indicate to reviewers that the code in the PR isn't in its final state and will change. It also means that we will not merge the commit until it is finished. You or a reviewer can remove the [WIP] tag when the code is ready to be fully reviewed for merging.
bn_bn: যদি আপনি কোনো কোড লিখে থাকেন এবং সেটা সম্পূর্ণ করতে সাহায্য দরকার, অথবা শেষ করার আগে কোডের প্রাথমিক পর্যালোচনা করার প্রয়োজন, অথবা কোডের বাস্তবায়ন শেষ করার আগে কোনো পরামর্শ দরকার তাহলে আপনি একটি *Work in Progress* পুল রিকোয়েস্ট খুলতে পারেন। যখন আপনি পুল রিকোয়েস্টটি তৈরী করবেন, তখন শিরোনামে **\[WIP\]** ট্যাগ টি যোগ করবেন (ওয়ার্ক ইন প্রগ্রেস এর জন্যে)। এটি পর্যালোচকদের নির্দেশ করবে যে পুল রিকোয়েস্টের কোডটি তার চূড়ান্ত অবস্থায় নেই এবং পরিবর্তিত হবে। এর অর্থ হল আমরা কমিটটিকে সংযোজন (মার্জ) করব না যতক্ষণ না এটি শেষ হয়। আপনি বা একজন পর্যালোচক [WIP] ট্যাগটি সরাতে পারেন যখন কোডটি সম্পূর্ণ পর্যালোচনার তৈরি মার্জ হওয়ার পূর্বে।
de_de: Falls Code geschrieben wurde und man Hilfe benötigt diesen fertig zu stellen, man Feedback vor der Fertigstellung erwünscht, oder den Code vor der Implementierung diskutieren möchte, so kann man einen "Work In Progress" Pull-Request eröffnen. Wenn man einen Pull-Request erstellt, muss dem Titel der Tag **\[WIP\]** (Work In Progress) vorangestellt werden. Dies gibt an, dass der Code im Pull-Request nicht final ist und sich ändern wird. Des Weiteren wird der entsprechende Commit nicht übernommen ("merged") bis die Änderung final ist. Der [WIP] Tag kann von einem selbst oder einem Reviewer entfernt werden, sobald der Code fertig ist und die Änderung übernommen werden kann ("merged").
el_gr: Εάν έχετε γράψει κάποιο κώδικα, αλλά πρέπει να σας βοηθήσει να τον τελειώσετε, θέλετε να πάρετε την αρχική ανατροφοδότηση σε αυτό πριν από την ολοκλήρωσή του, ή θέλετε να το μοιραστείτε και να συζητήσετε πριν από την ολοκλήρωση της εφαρμογής, μπορείτε να ανοίξετε ένα * Εργασία σε Πρόοδο* pull request. Όταν δημιουργείτε το αίτημα λήψης, ετοιμάστε τον τίτλο με την ετικέτα **\[WIP\]** (για εργασία σε εξέλιξη). Αυτό θα υποδηλώνει στους εξεταστές ότι ο κώδικας στο PR δεν είναι στην τελική του κατάσταση και θα αλλάξει. Σημαίνει επίσης ότι δεν θα συγχωνεύσουμε την υποβολή μέχρι να ολοκληρωθεί. Εσείς ή ένας κριτής μπορείτε να αφαιρέσετε την ετικέτα [WIP] όταν ο κώδικας είναι έτοιμος να αναθεωρηθεί πλήρως για συγχώνευση.
es_mx: Si has escrito algo de código pero necesitas ayuda, quieres obtener retroalimentación antes de terminarlo, o quieres compartirlo y discutir antes de finalizar la implementación, puedes abrir un Pull Request de tipo *Work in Progress*. Cuando crees el PR, inicia el título con la etiqueta **\[WIP\]** (para Work in Progress). Quien revise el código podrá ver que el PR no está en su estado final y cambiará. También significa que no se integrará el código hasta que esté listo. Tú o un supervisor pueden eliminar la etiqueta [WIP] cuando el código esté listo para ser revisado completamente para su integración.
es_un: Si has escrito algo de código, pero necesitas ayuda para terminarlo, o deseas obtener comentarios iniciales sobre él antes de finalizarlo, o deseas compartirlo y discutirlo antes de concluir la implementación, puedes abrir un Pull Request como *Work in Progress* (Trabajo en Progreso). Cuando crees el Pull Request, inicia el título con la etiqueta **\[WIP\]** (para Work In Progress). Esto indicará a los revisores que el código en el PR (Pull Request) no está en su estado final y cambiará. También significa que no se integrará el código hasta que esté finalizado. Tú o un revisor pueden eliminar la etiqueta [WIP] cuando el código esté listo para ser revisado por completo para su integración.
fr_fr: Si vous écrivez du code et que vous avez besoin d'aide pour le terminer ou que vous souhaitez le partager en cours de développement, vous pouvez ouvrir une requête de type *Work in Progress*. Lorsque vous créez une demande de fusion (ou pull request), ajoutez en tête du titre les caractères **\[WIP\]** (pour Work In Progress). Cela indiquera aux re-lecteurs que le code n'est pas terminé et qu'il est sujet à changements. Cela signifie aussi que vous n'intègrerez pas ce nouveau code tant qu'il n'est pas terminé. Vous, ou un re-lecteur, pouvez supprimer le tag [WIP] lorsque le code est prêt à être revu et intégré.
id_id: Jika Anda telah menulis sebagian kode tetapi perlu bantuan menyelesaikannya, ingin mendapatkan umpan balik dulu sebelum menyelesaikannya, atau ingin berbagi dan mendiskusikan terlebih dahulu sebelum menyelesaikan implementasinya, Anda dapat membuat sebuah permintaan tarik (pull request) *Work in Progress*. Ketika Anda membuat permintaan tarik, tambahkan judul dengan tag **\[WIP\]** (singkatan *Work In Progress* atau Pekerjaan Dalam Proses). Ini akan menunjukkan kepada peninjau kode bahwa kode dalam permintaan tarik belum dalam keadaan akhir dan masih akan berubah. Ini juga berarti bahwa kami tidak akan menggabungkan komit tersebut sampai kode tersebut selesai. Anda atau seorang peninjau dapat menghapus tag [WIP] ketika kode siap untuk ditinjau penuh untuk penggabungan.
it_it: Se hai scritto del codice ma hai bisogno di aiuto per finirlo, vuoi avere un feedback iniziale su di esso prima di finirlo, o vuoi condividerlo e discuterne prima di completare l'implementazione, puoi aprire una richiesta di pull *Work in Progress*. Quando crei la richiesta di pull, inserisci in testa al titolo il tag **\[WIP\]** (per Work In Progress). Questo indicherà ai revisori che il codice nella richiesta di pull non è nel suo stato finale e verrà modificato. Significa anche che non faremo il merge del commit fino a quando non sarà terminato. Tu o un revisore potete rimuovere il tag [WIP] quando il codice è pronto per essere completamente revisionato per il suo inserimento.
pt_un: Se você já escreveu algum código mas precisa de ajuda para finalizá-lo, se deseja obter feedback inicial sobre ele antes de terminá-lo, ou se deseja compartilhá-lo e discutir antes de finalizar a implementação, você pode abrir um pull request em *Work in Progress*. Ao criar a solicitação de pull, preceda o título com a tag **\[WIP\]** (para Work In Progress). Isso indicará para os revisores que o código no PR não está em seu estado final e vai mudar. Significa também que não vamos executar o commit até que ele esteja concluído. Você ou um revisor podem remover a tag [WIP] quando o código estiver pronto para ser totalmente revisado para o merge.
ru_ru: Если вы написали часть решения, но вам нужна помощь в его завершении, или вам нужно получить обратную связь перед окончанием разработки, или же вы просто хотите поделиться им и обсудить, вы можете открыть Pull request с пометкой *В работе*. При создании Pull Request необходимо добавить в заголовок тег **\[WIP\]** (Work in Progress). Он укажет, что код в Pull request не закончен и может измениться. Также он означает то, что коммиты не будут объединены с целевой веткой до тех пор, пока работа не будет завершена. После того, как код полностью готов к проверке для и слиянию, можно удалить тег [WIP].
sw_ke: Iwapo umeandika misimbo kadhaa lakini unahitaji msaada kumalizia, au unataka kupata maoni ya awali juu yake kabla ya kumalizia, au unataka kuishirikisha na kuijadili kabla ya kumaliza utekelezaji, unaweza kufungua ombi la kuvuta *Work in Progress*. Unapounda ombi la kuvuta, tanguliza kichwa na kitambulisho cha ** \ [WIP \] ** (cha Kazi Katika Maendeleo). Hii itaonyesha kwa wakaguzi kwamba msimbo katika PR haiko katika hali yake ya mwisho na itabadilika. Inamaanisha pia kwamba hatutaunganisha ahadi hiyo hadi imalize. Wewe au mkaguzi unaweza kuondoa lebo ya [WIP] wakati nambari iko tayari kukaguliwa kikamilifu kwa kuunganishwa.
ta_in: நீங்கள் சில code எழுதி இருந்தாலோ அதை முடிக்க உதவி வேண்டுமானாலோ அல்லது அதை முழுமையாக முடிப்பதற்கு முன்பு முன்னூட்டம் பெற வேண்டுமானாலோ அல்லது முழுவதுமாக செயல்படுத்தும் முன்பு பிறருடன் பகிர்ந்து கலந்துரையாடல் நடத்த வேண்டுமானாலோ, நீங்கள் புதிதாக ஒரு *Work in Progress* புல் ரிக்வெஸ்ட்-ஐ உருவாக்கலாம். நீங்கள் புதிதாக ஒரு pull request உருவாக்கும் போது, தலைப்பில் **\[WIP\]** tag (for Work In Progress) போட வேண்டும். அவ்வாறு செய்வதனால், விமர்சகர்களுக்கு தங்களின் PR-ல் உள்ள code இறுதிக் கட்டத்தை எட்டவில்லை என்பதையும் பின்னால் மாற்றப்படும் எனபதையும் அறிய முடியும். அது மட்டுமல்லாது அந்த code முழுமையடையும் வரை செயல்திட்டத்தோடு ஒன்றிணைக்கப்படாது. Code முழுமையாக முடிக்கப்பட்ட பின்னர், நீங்களோ அல்லது விமர்சகரோ அந்த [WIP] tag-ஐ அகற்றி செயல்திட்டத்தோடு ஒன்றிணைத்துக் கொள்ளலாம்.
tr_tr: Eğer biraz kod yazdıysanız fakat bitirmede yardıma ihtiyacınız varsa, bitirmeden önce başlangıç feedback i almak veya kodu paylaşmak ve uygulamayı tamamlamadan tartışmak istiyorsanız, *Devam Eden Çalışma* (Work in Progress) pull request'i açabilirsiniz. Pull request'i oluştururken başlığı başına **\[WIP\]** (Work In Progress için) etiketi ile ekleyin. Bu görüntüleyenlere(reviewers), PR'teki kodun son halinde olmadığını ve değişeceğini gösterecektir. Bu ayrıca tamamlanana dek öneriyi birleştirmeyeceğimiz anlamına gelir. Kod birleştirmek için tamamen görüntülenmeye hazır olduğunda siz ya da bir görüntüleyen(reviewer) [WIP] etiketini kaldırabilir.
vi_vn: Nếu bạn đã viết một số code nhưng cần giúp đỡ trong việc hoàn thành, muốn có phản hồi trước khi hoàn thành hoặc muốn chia sẻ và thảo luận trước khi hoàn thành việc thực hiện nó, bạn có thể mở một *Work in Progress*(công việc đang thực hiện) pull request. Khi bạn mở một pull request, hãy viết tiêu đề kèm theo tag *\[WIP\]** (công việc đang thực hiện). Điều này sẽ cho người đánh giá biết được code ở trong pull request (PR) không phải là code cuối cùng và sẽ thay đổi trong tương lai. Nó cũng có nghĩa rằng chúng tôi sẽ không merge bản commit của bạn cho đến khi nó được hoàn thành. Bạn hoặc người đánh giá code có thể xóa tag [WIP] khi code có thể được đánh giá đầy đủ và sẵn sàng để merge.

source: Code Review
bn_bn: কোড পর্যালোচনা (রিভিউ)
el_gr: Αναθεώρηση κώδικα
es_mx: Revisión de código
es_un: Revisión de Código
fr_fr: Revue de code
id_id: Peninjauan Kode
it_it: Revisione del codice
ko_kr: 코드 검토
pl_pl: Weryfikacja kodu
pt_un: Revisão de Código
ru_ru: Проверка кода
sw_ke: Ukaguzi wa Msimbo
ta_in: Code விமர்சனம்
te_in: కోడ్ సమీక్ష
tr_tr: Kodu Gözden Geçirme
vi_vn: Đánh giá code
zh_tw: 程式碼複查
