Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: In Git commits, the first line of the commit message has special significance. It is used as the default pull request title, email notification subject line, git annotate messages, gitk viewer annotations, merge commit messages, and many more places where space is at a premium. As well as summarizing the change itself, it should take care to detail what part of the code is affected.
bn_bn: গিট কমিট মেসেজের (বার্তা) প্রথম বাক্যটি বিশেষ তাৎপর্য বহন করে। এটি পুল রিকোয়েস্টের শিরোনাম, ইমেইল বার্তার বিষয়বস্তু, গিটের নির্দেশনা বার্তা, গিটকে দর্শকদের জন্য মন্তব্য, মার্জ (সংযোজনের) বার্তা হিসেবে এবং আরো নানা জায়গায় প্রদর্শিত হয়। একই সাথে কোডের পরিবর্তনের বিশদ বর্ণনা কমিটের সারাংশে ব্যাখ্যা করতে হবে।
de_de: In Git-Commits hat die erste Zeile der Commit-Nachricht eine besondere Bedeutung. Sie wird als Standardtitel für Pull-Request, Betreffzeile von E-Mail-Benachrichtigungen, Annotationsnachrichten in Git, gitk-Viewer-Anmerkungen, Merge-Commit-Nachrichten und an vielen weiteren Stellen verwendet, in denen es auf Platz ankommt. Neben der Zusammenfassung der Änderung selbst sollte es genau mitteilen, welche Teile des Codes betroffen sind.
el_gr: Στις Git υποβολές, η πρώτη γραμμή του μηνύματος δέσμευσης έχει ιδιαίτερη σημασία. Χρησιμοποιείται ως ο προεπιλεγός τίτλος της αίτησης έλξης, η γραμμή θέματος ειδοποίησης μέσω email, τα μηνύματα σχολιασμού git, οι σημειώσεις της λειτουργίας προβολής gitk, η συγχώνευση μηνυμάτων δέσμευσης και πολλά άλλα σημεία όπου ο χώρος βρίσκεται σε ένα ασφάλιστρο. Καθώς και συνοψίζοντας την ίδια την αλλαγή, θα πρέπει να φροντίσει να λεπτομέρεια ποιο μέρος του κώδικα επηρεάζεται.
es_mx: En los commits de Git, la primera línea del mensaje del commit tiene particular importancia. Esta es usada por defecto como el título de la Pull Request, asunto de la notificación por correo electrónico, mensajes de anotación de git, anotación del visualizador gitk, mensajes de commit para merge y muchos otros lugares donde el espacio es limitado. Además de resumir el cambio, debe explicar detalladamente qué parte del código es afectada por este.
es_un: En los commits de Git, la primera línea del mensaje del commit tiene particular importancia. Esta es usada por defecto como el título de la Pull Request, asunto de la notificación por correo electrónico, mensajes de anotación de git, anotación del visualizador gitk, mensajes de commit para merge y muchos otros lugares donde el espacio es limitado. Además de resumir el cambio, debe explicar detalladamente qué parte del código es afectada por este.
fr_fr: Dans les commits Git, la première ligne du Commit message a une signification particulière. Cette première ligne sert de titre par défaut à la pull request, de sujet aux emails de notification, aux messages d'annotation git, aux messages d'intégration (merge) et dans bien d'autres endroits. Elle doit donc à la fois résumer le changement lui-même mais aussi indiquer quelle partie du code est affectée.
id_id: Dalam komit Git, baris pertama dari pesan komit memiliki signifikansi khusus. Baris ini digunakan sebagai judul pull request lazim, baris subjek pada notifikasi surel, anotasi pesan git, anotasi penampil gitk, menggabungkan pesan komit, dan di banyak tempat lainnya yang ruangnya terbatas. Baris ini juga meringkas perubahan itu sendiri, baris ini harus mampu menjelaskan detail dari bagian kode mana yang terpengaruh.
it_it: Nelle commit di Git, la prima riga del messaggio ha un significato speciale. Viene infatti utilizzata come titolo predefinito della richiesta di pull, riga dell'oggetto dell'email di notifica, messaggi di annotazione di git, annotazioni di gitk viewer, messaggi di merge di commit, ed in molti altri posti dove lo spazio è prezioso. Oltre a riassumere la modifica stessa, si dovrebbe fare attenzione a dettagliare quale parte del codice è interessata.
pt_un: Nos commits do Git, a primeira linha da mensagem de submissão tem um significado especial. É usada como título padrão do pull request, título do assunto da notificação por e-mail, mensagem de anotação do Git, comentários de revisores gitk, merge de mensagens de commit, e muitos outros lugares. Além de resumir a alteração em si, deve especificar a parte do código que é afetada.
ru_ru: В коммитах Git особое значение имеет первая строка комментария. Она по умолчанию используется в качестве заголовка Pull Request, темы письма в email уведомлениях, git-аннотациях, а также в качестве комментария к коммиту слияния (merge commit) и много других мест, где краткость имеет большое значение. Помимо обобщения самих изменений, она должна отражать, какую часть кодовой базы затрагивают изменения.
sw_ke: Katika uwekezaji wa Git, mstari wa kwanza wa ujumbe wa kuwekeza una umuhimu maalum. Unatumiwa kama chaguo-msingi wa kichwa cha ombi la kuvuta, mstari wa mada wa arifa ya barua-pepe, ujumbe wa ufafanuzi wa git, ufafanuzi wa mtazamaji wa gitk, ujumbe wa kuwekeza wa unganisho, na maeneo mengi zaidi ambapo nafasi ni ya malipo. Pamoja na kufupisha mabadiliko yenyewe, inapaswa kueleza kwa undani ni sehemu gani ya msimbo imeathiriwa.
ta_in: கிட் கமிட்ஸ் இல், கமிட் செய்தியின் முதல் வரி சிறப்பு முக்கியத்துவம் வாய்ந்தது. இது இயல்புநிலை புல் ரெக்யூஸ்ட் தலைப்பு, மின்னஞ்சல் அறிவிப்பு பொருள்ளின் வரி, கிட் அன்னோட்டட் செய்திகள், கிட்கெ பார்வையாளர் அன்னோடேஷன்ஸ், கமிட் செய்திகளின் இணைப்பு, மேலும் பல இடங்கள் ஒரு பிரீமியத்தில் இருப்பது. அதே போல் சுருக்கமாக தன்னை மாற்றும் தன்மை, code-ன் எந்த பகுதி பாதிக்கப்படுகிறது என்பதையும் விரிவாக கவனித்துக்கொள்ள வேண்டும்.
tr_tr: Git commitlerinde, commit mesajının ilk satırının özel değeri vardır. Önerilen pull request etiketi, e-mail bildirimi konu satırı, git açıklayıcı mesajları, gitk görüntüleyici ek açıklamaları, merge commit mesajları ve alanın gözde olduğu birçok yer olarak kullanılır. Değişim kendisini özetleyebildiği kadar kodun hangi kısmının etkilendiğinin detaylandırılmasına da önem vermelidir.
vi_vn: Trong các Git commit, dòng đầu tiên của một thông điệp commit có một ý nghĩa trọng yếu. Nó được sử dụng như tiêu đề mặc định của một pull request, tiêu đề thông báo email, chú thích trong thông báo của git, chú thích cho người xem gitk, thông điệp merge commit, và nhiều nơi khác mà chỗ trống cực kì đáng giá. Cũng như tóm tắt các thay đổi, thì dòng đầu tiên nên chỉ rõ phần nào của code bị ảnh hưởng.

source: In addition, the first line of the commit message becomes an entry in the generated changelog if the PR is tagged as being included in the changelog. It is critically important that you write clear and succinct summary lines.
bn_bn: অধিকন্তু, পুল রিকোয়েস্টটি যদি চেঞ্জলগের অন্তর্ভুক্ত হয়, তাহলে এর প্রথম বাক্যটি চেঞ্জলগের এন্ট্রি হিসেবে লিপিবদ্ধ হয়। স্পষ্ট এবং সংক্ষিপ্ত আকারে সারাংশ (সামারি) লেখা অত্যন্ত জরুরি।
de_de: Darüber hinaus wird die erste Zeile der Commit-Nachricht der Eintrag im generierten Changelog, sobald der PR im Changelog als hinzugefügt markiert ist. Es ist von entscheidender Bedeutung, dass Sie klare und prägnante zusammenfassende Zeilen verfassen.
es_mx: Además, la primera línea del mensaje de commit se convierte en una entrada en el registro de cambios si el PR está etiquetado para incluirse en el changelog. Es crítico que escribas un resumen claro y conciso.
es_un: Además, la primera línea del mensaje de commit se convierte en una entrada en el registro de cambios si el PR está etiquetado para incluirse en el changelog. Es crítico que escribas un resumen claro y conciso.
fr_fr: De plus, cette première ligne devient une entrée dans le référentiel de changements (changelog), à condition que la PR soit incluse dans le changelog. Il est essentiel que vous écriviez des commentaires clairs et succints.
id_id: Selain itu, baris pertama dari pesan komit menjadi entri dalam changelog yang dihasilkan jika PR ditandai untuk dimasukkan ke dalam changelog. Sangat penting bagi Anda untuk menulis baris ini dengan jelas dan ringkas.
it_it: Inoltre, la prima riga del messaggio di commit diventa una voce nel changelog generato se la PR è etichettata come inclusa nel changelog. È di fondamentale importanza scrivere righe di riepilogo chiare e succinte.
pt_un: Além disso, a primeira linha da mensagem de commit se torna uma entrada no log de mudanças, caso o pull request seja marcado para ser incluído. É muito importante que as linhas sejam claras e sucintas.
ru_ru: Кроме того, первая строка комментария к коммиту становится записью в автоматически генерируемом журнале изменений, если Pull request отмечен как включаемый в него. Критически важно, чтобы Вы писали четкие и емкие комментарии.
sw_ke: Kuongezea, mstari wa kwanza wa ujumbe wa kuwekeza unakuwa kiingilio kwenye mabadiliko (changelog) yaliyotengenezwa ikiwa PR imebandikwa kama iliyojumuishwa kwenye mabadiliko. Ni muhimu sana uandike mistari ya muhtasari kwa uwazi na ufupi.
ta_in: கூடுதலாக, சேஞ்ச்லாக்-கில் கமிட் தகவல் செய்தியின் முதல் வரி சேர்க்கப்பட்டுள்ளதாக PR டெக் குறிக்கப்பட்டால், உறுதிப்படுத்தப்பட்ட செய்தியி சேஞ்ச்லாக்யில் சேர்க்கப்படும். நீங்கள் தெளிவான மற்றும் சுருக்கமான வரிகளை எழுதுவது மிகவும் முக்கியமானதாகும்.
tr_tr: Ek olarak, eğer PR changelogun içerisine dahil edilerek etiketlendiyse commit mesajının ilk satırı, üretilen changelog içerisinde bir giriş haline gelir. Açık, kısa ve öz özet satırları yazmanız son derece önemlidir.
vi_vn: Thêm vào đó, nếu một pull request được gắn thẻ rằng nó được bao gồm trong changelog thì dòng đầu tiên của thông điệp commit sẽ trở thành sự bắt đầu của một changelog khi nó được tạo ra. Rất quan trọng khi bạn viết tóm tắt một cách cô đọng và rõ ràng.

source: Describe any limitations of the current code.
bn_bn: বর্তমান কোডের সীমাবদ্ধতাগুলি বর্ণনা করতে হবে।
de_de: Beschreiben Sie alle Einschränkungen des aktuellen Codes.
es_mx: Describa las limitaciones del código actual.
es_un: Describe las limitaciones del código actual.
fr_fr: Décrivez les limitations de votre code.
id_id: Deskripsikan batasan dari kode yang ada saat ini.
it_it: Descrivere le possibili limitazioni del codice attuale.
pt_un: Descreva quaisquer limitações do código atual.
ru_ru: Опишите любые ограничения текущего кода.
sw_ke: Eleza upungufu wowote wa msimbo wa sasa.
ta_in: தற்போதைய code ஏதேனும் வரம்புகளை விவரிக்கவும்.
tr_tr: Geçerli kodun her sınırlandırmasını tanımlayın.
vi_vn: Miêu tả tất cả các hạn chế của code.

source: If the code being changed still has future scope for improvements, or any known limitations, mention these in the commit message. This demonstrates to the reviewer that the broader picture has been considered, and what tradeoffs have been done in terms of short-term goals versus long-term wishes.
bn_bn: যে কোডটি পরিবর্তন করা হচ্ছে, যদি তা ভবিষ্যতে আরো পরিবর্তনের সুযোগ থাকে অথবা কোনো জানা সীমাবদ্ধতা থেকে থাকে তবে সেগুলো কমিট মেসেজে (বার্তা) উল্লেখ করতে হবে। এর মাধ্যমে রিভিউয়ার (পর্যালোচক) বুঝবেন যে, বড় পরিসরে কোডের পরিবর্তনটি বিবেচনা করা হয়েছে এবং দীর্ঘমেয়াদী পরিকল্পনা ও স্বল্পমেয়াদী লক্ষ্য পূরণের ক্ষেত্রে কী কী ব্যাপার খেয়াল করতে হবে।
de_de: Wenn der Code, an dem man gearbeitet hat, noch Spielraum für künftige Verbesserungen lässt oder bestimmte Einschränkungen hat, sollte man das in seiner Commit-Nachricht vermerken. Dies zeigt dem Reviewer, dass das Problem umfassend betrachtet wurde und welche Kompromisse zugunsten kurzfristiger Zielen gegenüber langfristiger Absichten eingegangen wurden.
es_mx: Si el código que está siendo modificado aún tiene potencial para mejoras posteriores, o alguna limitación, menciónalo en el mensaje de commit. Esto demuestra a quien revisa que se ha considerado un panorama más amplio, y qué compensaciones se han echo en cuanto a objetivos de corto plazo contra deseos de largo plazo.
es_un: Si el código que está siendo modificado aún tiene potencial para mejoras posteriores, o alguna limitación, menciónalo en el mensaje de commit. Esto demuestra a quien revisa que se ha considerado un panorama más amplio, y qué compensaciones se han echo en cuanto a objetivos de corto plazo contra deseos de largo plazo.
fr_fr: Si le code en cours de changement nécessite de futures améliorations ou présente des limitations identifiées, mentionnez le dans le Commit message. Cela montrera au re-lecteur qu'une vision plus large des besoins est prise en considération. Le court terme et le moyen terme seront ainsi clairement exprimés.
id_id: Jika kode yang sedang diubah masih bisa dikembangkan, atau masih ada batasan tertentu yang diketahui, sebutkan ini dalam pesan commit. Hal ini menunjukkan kepada peninjau bahwa gambaran umum telah dipertimbangkan, dan apa tradeoff yang telah dilakukan dengan mempertimbangkan tujuan jangka pendek dan keinginan jangka panjang.
it_it: Se il codice che viene modificato ha ancora margini di miglioramento futuri, o eventuali limitazioni note, menzionarle nel messaggio di commit. Questo dimostra al revisore che il quadro più ampio è stato preso in considerazione, e quali compromessi sono stati fatti in termini di obiettivi a breve termine rispetto ai piani a lungo termine.
pt_un: Se o código a ser alterado ainda tiver oportunidades para melhorias futuras, ou quaisquer limitações conhecidas, mencione-as na mensagem de commit. Isto demonstra ao revisor que um escopo mais amplo foi considerado, e que alterações que foram escolhidas levam em conta objetivos conflitantes de curto e longo prazo.
ru_ru: Если измененный код имеет задачи для будущих улучшений или известные ограничения - упоминайте их в комментарии к коммиту. Это демонстрирует проверяющему то, что была рассмотрена широкая картина, а также компромиссы, на которые пришлось пойти для достижения краткосрочных целей и долгосрочные возможностей для улучшения.
sw_ke: Ikiwa msimbo unaobadilishwa bado una wigo wa uboreshaji wa siku za baadaye au mapungufu yoyote yanayojulikana, yataje katikwa ujumbe ya kuwekeza. Huku kunadhihirisha kwa mkaguzi kuwa mtazamo pana imezingatiwa na ni masilahi gani yamefanywa kulingana na malengo ya muda mfupi dhidi ya matakwa ya muda mrefu.
ta_in: மாற்றப்படும் code-களில் இன்னும் மேம்பாடுகளுக்கான எதிர்கால நோக்கம் அல்லது அறியப்பட்ட லிமிடேஷன்ஸ் இருந்தால், கமிட் மெசேஜ்யில் குறிப்பிடவும். இது விரிவான விளக்கத்தை பரிசீலிக்கப்பட்டுள்ளது என்பதையும், நீண்ட கால விருப்பங்களுக்கு எதிராக குறுகிய கால இலக்குகளின் அடிப்படையில் என்ன பரிமாற்றங்கள் செய்யப்பட்டுள்ளன என்பதையும் இது மதிப்பாய்வாளருக்கு நிரூபிக்கிறது.
tr_tr: Eğer değiştirilen kod gelişimler ya da bilinen herhangi bir sınırlandırma için hala gelecek faaliyet alanlarına sahipse, bunları commit mesajında belirtin. Bu reviewerın daha kapsamlı bir resim belirlemesini sağlar ve uzun zamanlı isteklerle kısa zamanlı istekleri kıyaslandığında hangi takasların yapılacağını gösterir.
vi_vn: Nếu code được thay đổi mà vẫn có thể cái tiến trong tương lai, hoặc có bất kì hạn chế nào đã biết, bạn nên đề cập đến chúng trong thông điệp commit. Điều này minh chứng cho người đánh giá thấy được một viễn cảnh tốt hơn đã được tính đến, và có những đánh đổi nào đã được thực hiện để có được những mục tiêu ngắn hạn và so chúng với nhũng mục tiêu dài hạn.

source: Include references to issues.
bn_bn: ইস্যুতে রেফারেন্স উল্লেখ করুন।
de_de: Referenzen zu Issues hinzufügen.
el_gr: Συμπεριλάβετε αναφορές σε θέματα.
es_mx: Incluye referencias a los problemas.
es_un: Incluye referencias a los problemas.
fr_fr: Faites référence aux tickets d'incidents (issue).
id_id: Sertakan referensi untuk masalahnya.
it_it: Includere riferimenti alle issue.
pt_un: Incluir referências para issues.
ru_ru: Включайте ссылки на задачи.
sw_ke: Ongezea marejeo ya masuala.
ta_in: சிக்கல்களுக்கான குறிப்புகளைச் சேர்க்கவும்.
tr_tr: Sorunlara referanslar ekleyin.
vi_vn: Kèm theo dẫn chứng tới vấn đề.

source: If the commit fixes are related to an issue, make sure you annotate that in the commit message. Use the syntax::
bn_bn: কমিটের সংশোধনীগুলো যদি কোনো ইস্যু সম্পর্কিত হয় তবে সেটি কমিট মেসেজে (বার্তা) নির্দেশ করা হয়েছে কিনা তা নিশ্চিত করতে হবে। নিচের সিনট্যাক্স ব্যবহার করতে হবেঃ
de_de: Wenn der Commit ein Issue löst, sollte man diesen Issue in der Commit-Nachricht referenzieren. Benutzen Sie diese Syntax::
es_mx: Si las modificaciones del commit están relacionadas con algún problema, asegúrate de anotarlo en el mensaje del commit. Usa la sintaxis::
es_un: Si las modificaciones del commit están relacionadas con algún problema, asegúrate de anotarlo en el mensaje del commit. Usa la sintaxis::
fr_fr: Si les modifications sont liées à un incident, n'oubliez pas de le préciser dans le Commit message. Utilisez la syntaxe suivante :
id_id: Jika perbaikan commit berhubungan dengan suatu masalah, pastikan Anda menganotasinya dalam pesan commit. Gunakan sintaks::
it_it: Se le correzioni del commit sono relative ad una issue, assicurarsi di annotarla nel messaggio di commit. Usare la sintassi::
pt_un: Se as correções do commit estiverem relacionadas a uma issue, certifique-se de anotá-la na mensagem de commit. Use a sintaxe::
ru_ru: Если исправления в коммите связаны с задачей (issue), убедитесь, что Вы упомянули ее в комментарии к коммиту. Используйте синтаксис:
sw_ke: Ikiwa marekebisho katika uwekezaji yanahusiana na suala, hakikisha unayafafanua katika ujumbe wa kuwekeza. Tumia sintaksia::
ta_in: Commit fixes issue தொடர்பானதாக இருந்தால், கமிட் தகவலில் உள்ள தை குறிப்பிடுவதை உறுதி செய்யவும். தொடரியல் பயன்படுத்து::
tr_tr: Eğer commit onarımları bir sorun ile ilişkiliyse, bunu commit mesajında ek olarak açıkladığınızdan emin oldun. Bu sintaksı kullanın::
vi_vn: Nếu commit dùng để sửa một vấn đề, chắc chắn rằng bạn chú thích nó trong thông điệp commit Dùng cú pháp sau::

source: if it fixes the issue (GitHub will close the issue when the PR merges).
bn_bn: যদি এটি সমস্যার সমাধান করে (পুল রিকোয়েস্ট মার্জ (সংযোজন) এর সময় গিটহাব ইস্যুটি বন্ধ করবে)।
de_de: falls es das Issue behebt (GitHub schließt das Issue automatisch, wenn der Pull-Request gemerged wird).
el_gr: αν διορθώνει το πρόβλημα (το GitHub θα κλείσει το θέμα όταν συγχωνεύεται το PR).
es_mx: si soluciona el problema (GitHub cerrará el problema cuando se haga merge del Pull Request).
es_un: si soluciona el problema (GitHub cerrará el problema cuando se haga merge del Pull Request).
fr_fr: si votre code corrige l'anomalie (GitHub fermera le ticket lorsque la PR sera intégrée).
id_id: jika ini memperbaiki masalah (GitHub akan menutup masalah ketika PR digabungkan).
it_it: se risolve la issue (GitHub chiuderà la issue dopo il merge della PR).
pt_un: se ele corrigir o problema (o GitHub irá fechar o problema quando o PR mesclar).
ru_ru: если они закрывают задачу (GitHub закроет ее, когда Pull request будет одобрен и изменение добавлено в целевую ветку).
sw_ke: ikiwa inarekebisha suala hilo (GitHub itafunga suala hilo wakati PR itaunganishwa).
ta_in: அது சிக்கலை சரிசெய்தால் (PR ஒன்றிணைக்கும் போது கிட்ஹப் சிக்கலை மூடும்).
tr_tr: eğer sorunu çözerse (PR birleştirildiğinde GitHub sorunu kapatacak).
vi_vn: nếu nó sửa được vấn đề (Github sẽ đóng issue lại khi merge pull request).

source: The main rule to follow is:
bn_bn: তাহলে মূল নিয়মটি হলোঃ
de_de: Grundsätzlich sollte man folgendes beherzigen:
el_gr: Ο κύριος κανόνας που πρέπει να ακολουθήσετε είναι:
es_mx: La principal regla a seguir es:
es_un: La principal regla a seguir es:
fr_fr: La règle principale est :
id_id: Aturan utama yang harus diikuti adalah:
it_it: La regola principale da seguire è:
pt_un: A regra principal a seguir é:
ru_ru: Основное правило, которому стоит следовать:
sw_ke: Kanuni kuu ya kufuata ni:
ta_in: பின்பற்ற வேண்டிய முக்கிய விதி:
tr_tr: Takip edilecek temel kural:
vi_vn: Luật chính để đi theo là:

source: The commit message must contain all the information required to fully understand and review the patch for correctness. Less is not more.
bn_bn: কমিট মেসেজ বা বার্তাটিতে প্যাচ বা সমাধানটি বোঝার এবং রিভিউ (পর্যালোচনা) করার জন্য সমস্ত তথ্য থাকতে হবে। স্বল্পভাষীতা সবসময় উত্তম নয়।
de_de: Die Commit-Nachricht muss alle Informationen enthalten, welche benötigt werden um die Änderung komplett zu verstehen und auf Korrektheit prüfen zu können. Weniger ist nicht mehr.
el_gr: Το μήνυμα υποβολής πρέπει να περιέχει όλες τις πληροφορίες που απαιτούνται για την πλήρη κατανόηση και την εξέταση του επιθέματος για διόρθωση. Τα λιγότερα δεν είναι πολλά.
es_mx: El mensaje de commit debe contener toda la información necesaria para entender en su totalidad y revisar si el parche es apropiado. Menos no es más.
es_un: El mensaje de commit debe contener toda la información necesaria para entender en su totalidad y revisar si el parche es apropiado. Menos no es más.
fr_fr: Le Commit message doit contenir toutes les informations requises pour comprendre et vérifier les corrections associées.
id_id: Pesan commit harus berisi semua informasi yang diperlukan untuk sepenuhnya memahami dan meninjau kebenaran dari patch. Kurang bukan berarti lebih.
it_it: Il messaggio di commit deve contenere tutte le informazioni necessarie per comprendere appieno la patch e verificarne la correttezza. Essere eccessivamente sintetici non è la scelta migliore.
pt_un: A mensagem de commit deve conter todas as informações necessárias para entender completamente e revisar o patch para correção. Menos não é mais.
ru_ru: Комментарий к коммиту должен содержать всю информацию, необходимую для полного понимания и проверки изменений на корректность.
sw_ke: Ujumbe wa kuwekeza sharti uwe na habari yote inayohitajika kuelewa na kukagua kisasisho kwa usahihi. Pungufu sio zaidi.
ta_in: கமிட் செய்தியில், சரியாக இருக்கும் போது ஒட்டு முழுமையாக புரிந்து கொள்ள மற்றும் மதிப்பாய்வு செய்ய தேவையான அனைத்து தகவல்களும் இருக்க வேண்டும். குறைவாக இல்லை.
tr_tr: Commit mesajı doğruluğa uygun yamayı tamamen anlamak ve gözden geçirmek için gerekli tüm bilgiyi içermelidir. Daha azı iyi değildir.
vi_vn: Thông điệp commit phải chứa tất cả các thông tin cần thiết để hiểu và đánh giá bản vá chính xác. Thông điệp 'Less is more' không đúng trong trường hợp này.

source: Documenting Your Code
bn_bn: কোডের বিবরণী তৈরি বা ডকুমেন্টেশনকরণ
de_de: Dokumentieren Sie Ihren Code
el_gr: Τεκμηριώστε τον κώδικά σας
es_mx: Documentando Tu Código
es_un: Documentando Tu Código
fr_fr: Documenter votre code
id_id: Mendokumentasikan Kode Anda
it_it: Documenta il Tuo Codice
pt_un: Documentando Seu Código
ru_ru: Документирование кода
sw_ke: Kunakili msimbo wako
ta_in: உங்கள் Code-டை ஆவணப்படுத்துதல்
tr_tr: Kodunuzu Belgelemek
vi_vn: Ghi chú code của bạn
