Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: This is passing the flag `-j8` to the underlying build system (which in this case is `Automake <https://www.gnu.org/software/automake/>`__), telling it that you want to build in parallel using 8 processes.
bn_bn: এটি গঠন ব্যবস্থায় `-j8` চিহ্ন (ফ্ল্যাগ) (যেটি এক্ষেত্রে `Automake <https://www.gnu.org/software/automake/>`__) পাঠায় যাতে আপনি আটটি প্রসেস সমান্তরালে গঠন করেন।
de_de: Dadurch wird das Flag `-j8` an das Build-System durchgereicht (in diesem Fall `Automake <https://www.gnu.org/software/automake/>`__), wodurch diesem mitgeteilt wird, dass man mit 8 parallelen Prozessen kompilieren möchte.
el_gr: Αυτό περνάει τη σημαία `-j8` στο υποκείμενο σύστημα κατασκευής (το οποίο σε αυτή την περίπτωση είναι `Automake <https://www.gnu.org/software/automake/>`__), λέγοντάς του ότι θέλετε να οικοδομήσουμε παράλληλα χρησιμοποιώντας 8 διαδιακασίες.
es_mx: Esto es pasar el flag `-j8`al sistema de compilación base (que en este caso es `Automake <https://www.gnu.org/software/automake/>`__), indicando que quieres compilar en paralelo utilizando 8 procesos.
es_un: Esto es pasar la bandera `-j8` al sistema de compilación subyacente (que en este caso es `Automake <https://www.gnu.org/software/automake/>`__), indicándole que deseas compilar en paralelo usando 8 procesos.
fr_fr: Ceci passe le commutateur `-j8 ` au système de construction sous-jacent (qui dans ce cas est `Automake <https://www.gnu.org/software/automake/>` __), en indiquant que vous voulez construire en parallèle à l'aide de 8 processus.
id_id: Hal ini melewati bendera `-j8` ke sistem build yang mendasari (yang dalam hal ini adalah `Automake <https://www.gnu.org/software/automake/>`__), mengatakan bahwa Anda ingin membangun secara paralel dengan menggunakan 8 proses.
it_it: Questo passa il flag `-j8` al sistema di build sottostante (che in questo caso è `Automake <https://www.gnu.org/software/automake/>`__), indicando che si desidera realizzare la build in parallelo usando 8 processi.
pt_un: Isso está passando a flag `-j8` para o sistema de empacotamento subjacente (que neste caso é `Automake <https://www.gnu.org/software/automake/>`__), dizendo que você deseja fazer o empacotamento em paralelo usando 8 processos.
ru_ru: Это передает флаг `-j8` базовой системе сборки (что в данном случае является `Automake <https://www.gnu.org/software/automake/>`__), говоря ей о том, что Вы хотите использовать 8 процессов для параллельной сборки.
sw_ke: Huku ni kupitisha kigezo `-j8` kwa mfumo wa msingi wa ujenzi (ambao sasa hivi ni `Automake <https://www.gnu.org/software/automake/>`__), ukiiambia kwamba unataka kujenga sambamba ukitumia michakato 8.
ta_in: இது கொடி `- j8` செல்லும் கட்டிடக் கட்டமைப்பை கடந்து (இது இந்த வழக்கில் `Automake <https://www.gnu.org/software/automake/>`__), 8 பணிகளை பயன்படுத்தி இணையாக உருவாக்க விரும்பும் என்று சொல்லப்படுகிறது.
tr_tr: Bu, `-j8` bayrağını alttaki oluşturma sistemine geçirir (bu durumda `Automake <https://www.gnu.org/software/automake/>`__), 8 işlem kullanarak paralel olarak oluşturmak istediğinizi söyler.
vi_vn: Ở đây, flag `-j8` được truyền vào việc dựng(trong trường hợp này là `Automake <https://www.gnu.org/software/automake/>`__), nó dùng để chỉ cho máy rằng bạn muốn dựng song song với 8 quy trình (process).

source: For example, a common use case for these flags on linux is to specify a specific version of the C++ compiler to use (normally if the default is too old):
bn_bn: উদাহরণস্বরূপ, লিনাক্স মেশিনে C++ কম্পাইলারের নির্দিষ্ট সংস্করণ নির্দেশিত করা (সাধারণত যদি ডিফল্ট সংস্করণটি খুব পুরোনো হয়) এই নিশানগুলোর (ফ্ল্যাগ) একটি পরিচিত ব্যাবহারক্ষেত্র।
de_de: Ein typischer Fall für diese Optionen ist, beispielsweise in Linux, eine spezifische Version des C++-Compilers anzugeben (meistens, wenn die Standardversion zu alt ist):
el_gr: Για παράδειγμα, μια κοινή περίπτωση χρήσης για αυτές τις σημαίες στο linux είναι να καθορίσετε μια συγκεκριμένη έκδοση του μεταγλωττιστή C++ που θα χρησιμοποιηθεί (κανονικά αν η προεπιλογή είναι πολύ παλιά):
es_mx: Por ejemplo, un caso de uso común de estas banderas (flags) en Linux es para indicar una versión específica del compilador de C++ a usar (normalmente se utiliza si el compilador por defecto es uno antiguo):
es_un: Por ejemplo, un caso de uso común de estas banderas (flags) en Linux es para indicar una versión específica del compilador de C++ a usar (normalmente se utiliza si el compilador por defecto es uno antiguo):
fr_fr: Par exemple, un cas d'utilisation commun pour ces indicateurs sur linux est de spécifier une version spécifique du compilateur C++ à utiliser (normalement si la valeur par défaut est trop ancienne) :
id_id: Sebagai contoh, kasus penggunaan umum untuk flag ini pada linux adalah untuk menentukan versi spesifik dari compiler C++ untuk digunakan (biasanya jika default nya terlalu tua):
it_it: Ad esempio, su linux è possibile indicare una versione specifica del compilatore C++ da utilizzare (di solito usato se la versione di default è troppo vecchia):
pt_un: Por exemplo, um caso de uso comum para essas flags no Linux é definir uma versão específica do compilador C++ para usar (normalmente se o padrão for muito antigo):
ru_ru: Например, общий вариант использования этих флагов в Linux - указать конкретную версию компилятора C++ (если использующийся по умолчанию слишком старый):
sw_ke: Kwa mfano, matumizi ya kawaida ya vigezo hivi katika Linux huwa ni kutaja toleo maalum la compiler ya C++ litakalotumiwa (hususan iwapo la chaguo-msingi ni la kale sana):
ta_in: எடுத்துக்காட்டாக, Linux இல் இந்த கொடிகளுக்கு ஒரு பொதுவான பயன்பாடு வழக்கமாக C++ தொகுப்பின் ஒரு குறிப்பிட்ட பதிப்பு குறிப்பிடவும் (சாதாரணமாக முன்னிருப்பு மிகவும் பழமையானால்):
tr_tr: Örneğin, linux üzerindeki bu bayraklar için yaygın bir kullanım durumu, kullanılacak C++ derleyicisinin belirli bir sürümünü belirtmektir (normalde varsayılan çok eski ise):
vi_vn: Ví dụ, một flag thường gặp trên Linux để xác định xem phiên bản nào của trình biên dịch C++ được dùng (thông thường trong trường hợp trình biên dịch mặc định quá cũ):

source: which will tell CMake to use the g++-7 command instead of the default g++ when compiling Aer.
bn_bn: যেটি Aer কম্পাইল করার সময় সিমেক (CMake) কে চিরাচরিত g++ কমান্ডের পরিবর্তে g++-7 কম্যান্ড ব্যবহার করার নির্দেশ দিবে।
de_de: dies teilt CMake mit, den Befehl g++-7, statt dem standardmäßigen g++, bei der Kompilation von Aer zu verwenden.
el_gr: που θα πει στο CMake να χρησιμοποιεί την εντολή g++-7 αντί της προκαθορισμένης g++ κατά την μεταγλώττιση του Aer.
es_mx: el cuál comunicará a CMake que use el comando g++-7 en vez del predeterminado g++ al compliar Aer.
es_un: el cuál comunicará a CMake que use el comando g++-7 en vez del predeterminado g++ al compilar Aer.
fr_fr: qui indiquera à CMake d'utiliser la commande g++-7 au lieu de la commande g++ par défaut lors de la compilation de Aer.
id_id: yang akan memberitahu CMake untuk menggunakan perintah g + + -7 bukan default g + + saat melakukan compile Aer.
it_it: che dirà a CMake di usare il comando g++-7 invece di quello predefinito g++ durante la compilazione di Aer.
pt_un: que dirá ao CMake para usar o comando g++-7 em vez do g++ padrão ao compilar o Aer.
ru_ru: что даст инструкцию CMake использовать команду g++-7 вместо g++ по умолчанию при компиляции Aer.
sw_ke: itakayoambia CMake kutumia amri ya g++-7 badala ya chaguo-msingi la g++ wakati wa kukusanya Aer.
ta_in: இது Aer ஐ தொகுக்கும்போது இயல்புநிலை g ++ க்கு பதிலாக g ++ - 7 கட்டளையைப் பயன்படுத்த CMake க்குச் சொல்லும்.
tr_tr: bu da CMake'e Aer derlenirken varsayılan g++ yerine g++-7 komutunu kullanmasını söyleyecektir.
vi_vn: nói với CMake dùng trình biên dịch g++-7 thay vì trình mặc định g++ khi biên dịch Aer.

source: Another common use case for this, depending on your environment, is that you may need to specify your platform name and turn off static linking.
bn_bn: এটির আর একটি পরিচিত ব্যবহারিক ক্ষেত্র হলো আপনাকে নিজস্ব প্লাটফর্মের নাম নির্দিষ্ট করতে হবে এবং স্থায়ী (স্ট্যাটিক) লিঙ্কিং বন্ধ করে রাখতে হবে, আপনার কম্পিউটারের কর্মপরিবেশ (এনভায়রনমেন্ট) অনুযায়ী।
de_de: Ein weiterer typischer Fall ist, in bestimmten Umgebungen einen Plattformnamen anzugeben und das statische Linken zu deaktivieren.
el_gr: Μια άλλη συνηθισμένη περίπτωση χρήσης για αυτό, ανάλογα με το περιβάλλον σας, είναι ότι μπορεί να χρειαστεί να καθορίσετε το όνομα της πλατφόρμας σας και να απενεργοποιήσετε τη στατική σύνδεση.
es_mx: Otro uso común para esto, dependiendo de tu entorno, es para cuando debas especificar el nombre de la plataforma y apagar las ligas estáticas.
es_un: Otro caso de uso común para esto, dependiendo de tu entorno, es que es posible que debas especificar el nombre de tu plataforma y desactivar el enlazamiento estático.
fr_fr: Un autre cas d'utilisation courant pour ceci, en fonction de votre environnement, est que vous devrez peut-être spécifier le nom de votre plate-forme et désactiver la liaison statique.
id_id: Kasus penggunaan lain yang umum untuk ini, tergantung pada lingkungan Anda, adalah bahwa Anda mungkin perlu untuk menentukan nama platform Anda dan mematikan penghubung statis.
it_it: Un altro caso d'uso comune per questo, a seconda del proprio ambiente, è che potrebbe essere necessario specificare il nome della propria piattaforma e disattivare il collegamento statico.
pt_un: Outro caso de uso comum para isso, dependendo do seu ambiente, é que você pode precisar especificar o nome da sua plataforma e desativar a linkagem estática.
ru_ru: Другим распространенным вариантом использования, в зависимости от среды - указать название Вашей платформы и отключить статическую связь (static linking).
sw_ke: Matumizi mengine ya kawaida ya hii, kulingana na mazingira yako, ni kwamba unaweza kuhitaji kutaja jina la platform yako na kusitisha uunganisho tuli (static linking).
ta_in: இதற்கான மற்றொரு பொதுவான பயன்பாட்டு வழக்கு, உங்கள் சூழலைப் பொறுத்து, உங்கள் தளத்தின் பெயரைக் குறிப்பிட வேண்டும் மற்றும் நிலையான இணைப்பை அணைக்க வேண்டும்.
tr_tr: Bunun için bir diğer yaygın kullanım durumu da, ortamınıza bağlı olarak platform adınızı belirtmeniz ve statik bağlantıyı kapatmanız gerekebileceğidir.
vi_vn: Dưới đây là một trường hợp sử dụng phổ biến khác, tùy thuộc vào môi trường của bạn, bạn có thể cần xác định tên nền tảng mà bạn sử dụng và tắt liên kết tĩnh.

source: Here ``--plat-name`` is a flag to setuptools, to specify the platform name to use in the package metadata, ``-DSTATIC_LINKING`` is a flag for using CMake to disable static linking, and ``-j8`` is a flag for using Automake to use 8 processes for compilation.
bn_bn: এখানে ``--plat-name`` ফ্ল্যাগটি একটি সেটআপ টুল যা প্যাকেজ মেটাডাটায় প্লাটফর্মের নাম ঠিক করতে ব্যবহৃত হয়, ``-DSTATIC_LINKING`` ফ্ল্যাগটি CMake ব্যবহার করে স্ট্যাটিক লিঙ্কিং বিচ্ছিন্ন করা এবং ``-j8`` ফ্ল্যাগ ব্যবহার করে Automake এর সাহায্যে আটটি প্রসেস কার্যকর করা হয়।
de_de: Hierbei ist ``--plat-name`` ein Flag für setuptools, um den in den Paket-Metadaten zu verwendenden Plattform-Namen anzugeben. ``-DSTATIC_LINKING`` ist ein Flag für CMake, um das statische Linken zu deaktivieren und ``-j8`` ist ein Flag für Automake, um 8 Prozesse bei der Kompilierung zu verwenden.
el_gr: Εδώ το ``--plat-name`` είναι μια σημαία στο setuptools, για να καθορίσετε το όνομα της πλατφόρμας που θα χρησιμοποιηθεί στα μεταδεδομένα του πακέτου, ``-DSTATIC_LINKING`` είναι μια σημαία για τη χρήση CMake για την απενεργοποίηση στατικής σύνδεσης, και ``-j8`` είναι μια σημαία για τη χρήση του Automake για τη χρήση 8 διαδικασιών για μεταγλώττιση.
es_mx: Aquí ``--plat-name`` es la bandera para las setuptools que especifica el nombre de plataforma a utilizar en los metadatos del paquete, ``-DSTATIC_LINKING`` es la bandera para hacer que CMake deshabilite el enlazado estático, y ``-j8`` es la bandera para hacer que Automake utilice 8 procesos para la compilación.
es_un: Aquí ``--plat-name`` es la bandera para las setuptools que especifica el nombre de la plataforma a utilizar en los metadatos del paquete, ``-DSTATIC_LINKING`` es la bandera para hacer que CMake deshabilite el enlazamiento estático, y ``-j8`` es la bandera para hacer que Automake utilice 8 procesos para la compilación.
fr_fr: Ici, ``--plat-name`` est un commutateur pour setuptools, pour spécifier le nom de la plate-forme à utiliser dans les métadonnées du paquet, ``-DSTATIC_LINKING`` est un commutateur pour utiliser CMake pour désactiver les liens statiques, et ``-j8`` est un commutateur pour Automake afin d'utiliser 8 processus pour la compilation.
id_id: ``--plat-name`` di sini adalah penanda bagi setuptools, untuk memberikan nama platform untuk digunakan pada metadata package, ``-DSTATIC_LINKING`` adalah penanda untuk menggunakan CMake untuk menonaktifkan static linking, dan ``-j8`` adalah penanda untuk menggunakan Automake untuk menggunakan 8 proses untuk kompilasi.
it_it: Qui ``--plat-name`` è un flag per setuptools, per specificare il nome della piattaforma da usare nei metadati del pacchetto, ``-DSTATIC_LINKING``è un flag per far disabilitare il collegamento statico usando CMake, e ``-j8`` è un flag per far utilizzare ad Automake 8 processi nella compilazione.
pt_un: Aqui ``--plat-name`` é uma flag de ferramentas de configuração, para especificar o nome da plataforma a utilizar nos metadados do pacote; ``-DSTATIC_LINKING`` é uma flag para usar o CMake e desabilitar links estáticos, e ``-j8`` é uma flag para fazer o Automake usar 8 processos para a compilação.
ru_ru: Здесь ``-- plat-name`` - флаг setuptools для указания названия платформы для использования в метаданных пакета; ``-DSTATIC_LINKING`` - флаг CMake для отключения статического связывания, а ``-j8`` - флаг Automake для использования 8 процессов для компиляции.
sw_ke: Hapa, ``--plat-name`` ni kigezo kwa setuptools, cha kutajia jina la platform litakalotumiwa katika kifurushi cha metadata, ``-DSTATIC_LINKING`` ni kigezo cha kutumia CMake kusitisha uunganisho tuli, na ``-j8`` ni kigezo cha kutumia Automake kutumia michakato 8 katika mkusanyiko.
ta_in: இங்கே ``--plat-name`` என்பது செட்அப்டூல்களுக்கு ஒரு கொடி, தொகுப்பு மெட்டாடேட்டாவில் பயன்படுத்த வேண்டிய தளத்தின் பெயரைக் குறிப்பிட, ``-DSTATIC_LINKING`` என்பது நிலையான இணைப்பை முடக்க CMake ஐப் பயன்படுத்துவதற்கான ஒரு கொடி, மற்றும் ``-j8`` தொகுப்பிற்கு 8 செயல்முறைகளைப் பயன்படுத்த ஆட்டோமேக்கைப் பயன்படுத்துவதற்கான ஒரு கொடி.
tr_tr: Burada ``--plat-name``, paket meta verilerinde kullanılacak platform adını belirtmek için, kurulum araçlarına bir bayraktır, ``-DSTATIC_LINKING``, CMake'i statik bağlantıyı devre dışı bırakmada kullanmak için bir bayrak ve ``-j8`` Automake'in derlemede 8 işlem kullanması için kullanılan bir bayraktır.
vi_vn: Tại đây, ``--plat-name`` là một flag cho setuptools, để xác định tên nền tảng được sử dụng trong gói metadata (gói siêu dữ liệu), ``-DSTATIC_LINKING`` là một flag dùng CMake để tắt liên kết tĩnh và ``-j8`` là một flag để chỉ dẫn Automake dùng 8 quy trình trong việc biên dịch.

source: A list of common options depending on platform are:
bn_bn: প্ল্যাটফর্মের উপর নির্ভর করে সাধারণ বিকল্পগুলির একটি তালিকা:
de_de: Eine Liste der gängigen Optionen je nach Plattform ist:
el_gr: Μια λίστα κοινών επιλογών ανάλογα με την πλατφόρμα είναι:
es_mx: Una lista de opciones comunes dependiendo de la plataforma es:
es_un: Una lista de opciones comunes dependiendo de la plataforma es:
fr_fr: Voici une liste des options courantes en fonction de la plateforme :
id_id: Daftar opsi umum yang tergantung pada platform adalah:
it_it: Un elenco di opzioni comunemente usati a seconda della piattaforma sono:
pt_un: Uma lista de opções comuns dependendo da plataforma é:
ru_ru: Список общих параметров в зависимости от платформы:
sw_ke: Orodha ya chaguzi za kawaida kulingana na platform ni:
ta_in: தளத்தைப் பொறுத்து பொதுவான விருப்பங்களின் பட்டியல்:
tr_tr: Platforma bağlı olarak, sık kullanılan seçeneklerin listesi şöyledir:
vi_vn: Danh sách các tùy chọn phổ biến phụ thuộc vào nền tảng:

source: Platform
bn_bn: প্ল্যাটফর্ম
de_de: Plattform
el_gr: Πλατφόρμα
es_mx: Plataforma
es_un: Plataforma
fr_fr: Plateforme
it_it: Piattaforma
pt_un: Plataforma
ru_ru: Платформа
sw_ke: Jukwaa
ta_in: பணித்தளம்
vi_vn: Nền tảng

source: Tool
bn_bn: টুল বা যন্ত্র
el_gr: Εργαλείο
es_mx: Herramienta
es_un: Herramienta
fr_fr: Outil
id_id: Alat
it_it: Strumento
pt_un: Ferramenta
ru_ru: Инструмент
sw_ke: Chombo
ta_in: கருவி
tr_tr: Araç
vi_vn: Công cụ

source: Option
bn_bn: বিকল্প বা অপশন
el_gr: Επιλογή
es_mx: Opción
es_un: Opción
id_id: Opsi
it_it: Opzione
pt_un: Opção
ru_ru: Параметр
sw_ke: Chaguo
ta_in: விருப்பம்
tr_tr: Seçenek
vi_vn: Tùy chọn

source: Use Case
bn_bn: ব্যবহারিক ক্ষেত্র
el_gr: Περίπτωση Χρήσης
es_mx: Caso de uso
es_un: Caso de Uso
fr_fr: Cas d’utilisation
it_it: Caso d'uso
pt_un: Caso de Uso
ru_ru: Вариант использования
sw_ke: Matumizi
ta_in: பயன்பாடு வழக்குகள்
tr_tr: Kullanım Örneği
vi_vn: Ứng dụng

source: All
bn_bn: সমস্ত
el_gr: Όλα
es_mx: Todas
es_un: Todas
fr_fr: Tous
id_id: Semua
it_it: Tutte
pt_un: Todos
ru_ru: Все
sw_ke: Zote
ta_in: அனைத்தும்
tr_tr: Tümü
vi_vn: Tất cả

source: Followed by a number, sets the number of processes to use for compilation.
bn_bn: সংখ্যার পরে সংকলনের জন্য প্রসেসের সংখ্যা নির্ধারণ করে।
de_de: Gefolgt von einer Zahl, legt die Anzahl der Prozesse fest, die für die Kompilierung verwendet werden sollen.
el_gr: Ακολουθούμενο από έναν αριθμό, ορίζει τον αριθμό των διαδικασιών που θα χρησιμοποιηθούν για τη μεταγλώττιση.
es_mx: Seguido de un número, indica la cantidad de procesos a utilizar para la compilación.
es_un: Seguido de un número, indica la cantidad de procesos a utilizar para la compilación.
fr_fr: Suivi d'un nombre qui définit le nombre de processus à utiliser pour la compilation.
id_id: Diikuti dengan angka, atur jumlah proses yang akan digunakan untuk melakukan kompilasi.
it_it: Seguito da un numero, imposta il numero di processi da utilizzare per la compilazione.
pt_un: Seguido por um número, define o número de processos a serem usados para compilação.
ru_ru: После параметра необходимо указать число, которые будет являться количеством процессов, используемых для компиляции.
sw_ke: Ikifuatiwa na idadi, huweka idadi ya michakato ya kutumia katika mkusanyiko.
ta_in: ஒரு எண்ணைத் தொடர்ந்து, தொகுப்பிற்குப் பயன்படுத்த வேண்டிய செயல்முறைகளின் எண்ணிக்கையை அமைக்கிறது.
tr_tr: Ardından gelecek bir sayı, derleme için kullanılacak işlem sayısını belirler.
vi_vn: Theo sau bởi một số, cụm số quy trình dùng để biên dịch.

source: Used to specify a specific C++ compiler; this is often needed if your default g++ is too old.
bn_bn: একটি নির্দিষ্ট C++ সম্পাদক (কম্পাইলার) নির্দিষ্ট করতে ব্যবহৃত হয়; আপনার ডিফল্ট g++ খুব বেশি পুরাতন হলে এটি প্রায়শই প্রয়োজন।
de_de: Wird verwendet, um einen bestimmten C++ -Compiler anzugeben. Dies ist häufig erforderlich, wenn der standardmäßig verwendete g++ zu alt ist.
el_gr: Χρησιμοποιούνταν για τον καθορισμό ενός συγκεκριμένου μεταγλωττιστή C++. Αυτό απαιτείται συχνά αν το προκαθορισμένο σας g++ είναι πολύ παλιό.
es_mx: Se utiliza para especificar un compilador específico de C++; esto se necesita a menudo si el g++ que tienes es antiguo.
es_un: Se utiliza para especificar un compilador específico de C++; esto se necesita a menudo si el g++ que tienes es antiguo.
fr_fr: Utilisé pour spécifier un compilateur C++ spécifique; c'est souvent nécessaire si votre g++ par défaut est trop ancien.
id_id: Digunakan untuk mendefinisikan kompiler C++ tertentu; hal ini sering dibutuhkan jika g++ bawaan yang Anda miliki terlalu tua.
it_it: Utilizzato per specificare un determinato compilatore C++; è spesso richiesto se c'è anche il g++ predefinito.
pt_un: Usado para definir um compilador C++ específico; isso é geralmente necessário se seu g++ padrão for muito antigo.
ru_ru: Используется для указания конкретного компилятора C++, что часто необходимо, если Ваш g++ слишком старый.
sw_ke: Inatumika kutaja compiler maalum ya C++; hii inahitajika sanasana ikiwa g++ ya chaguo-msingi imezeeka sana.
ta_in: குறிப்பிட்ட C++ தொகுப்பை குறிப்பிடும்; உங்கள் முன்னிருப்பு g++ மிகவும் பழமையானால் இது அடிக்கடி தேவைப்படுகிறது.
tr_tr: Belirli bir C++ derleyicisini belirtmek için kullanılır; varsayılan g++'ınız çok eskiyse bu genellikle gereklidir.
vi_vn: Dùng để xác định trình biên dịch C++, điều này thường cân thiết nếu trình biên dịch g++ của bạn quá cũ.

source: setuptools
bn_bn: সেটআপটুলস
pt_un: Ferramentas de configuração
ta_in: அமைப்புகருவிகள்
tr_tr: kurulum araçları
vi_vn: công cụ thiết lập

source: Used to specify the platform name in the output Python package.
bn_bn: Python প্যাকেজ আউটপুটটিতে প্ল্যাটফর্মের নাম নির্দিষ্ট করতে ব্যবহৃত হয়।
de_de: Wird verwendet, um den Plattformnamen im ausgegebenen Python-Paket anzugeben.
el_gr: Χρησιμοποιούνταν για τον καθορισμό του ονόματος της πλατφόρμας στο πακέτο εξόδου της Python.
es_mx: Usado para especificar el nombre de la plataforma en el paquete de salida de Python.
es_un: Usado para especificar el nombre de la plataforma en el paquete de salida de Python.
fr_fr: Utilisé pour spécifier le nom de la plateforme dans le package Python de sortie.
id_id: Digunakan untuk menentukan nama platform dalam paket keluaran Python.
it_it: Utilizzato per specificare il nome della piattaforma nel pacchetto Python di output.
pt_un: Usado para especificar o nome da plataforma no pacote de saída Python.
ru_ru: Используется для указания названия платформы в выходном Python пакете.
sw_ke: Inatumika kutajia jina la platform katika kifurushi cha pato la Python.
ta_in: வெளியீட்டு Python தொகுப்பில் வலைப்பதிவொன்றை குறிப்பிட பயன்படுத்தப்பட்டது.
tr_tr: Python paketindeki çıktının platform adını belirtmek için kullanılır.
vi_vn: Dùng để xác định tên nền tảng trong đầu ra của các gói Python.

source: Used to specify whether or not static linking should be used.
bn_bn: স্থির (স্ট্যাটিক) লিঙ্ক ব্যবহার করা উচিত কিনা তা নির্দিষ্ট করতে ব্যবহৃত হয়।
de_de: Wird verwendet um anzugeben, ob statisch gelinkt werden soll oder nicht.
el_gr: Χρησιμοποιούταν για να προσδιοριστεί αν θα πρέπει να χρησιμοποιηθεί στατική διασύνδεση.
es_mx: Utilizado para especificar si se usará enlazado estático o no.
es_un: Utilizado para especificar si se usará enlazado estático o no.
fr_fr: Utilisé pour indiquer si un lien statique doit être utilisé ou non.
id_id: Digunakan untuk menentukan apakah linking statis perlu dipakai.
it_it: Utilizzato per specificare se deve essere utilizzato o meno un collegamento statico.
pt_un: Usado para especificar se deve ou não ser utilizada a linkagem estática.
ru_ru: Используется для указания того, следует ли использовать статическое связывание (static linking).
sw_ke: Inatumika kutajia iwapo uunganisho tuli utumike au la.
ta_in: நிலையான இணைப்பு பயன்படுத்தப்பட வேண்டுமா இல்லையா என்பதைக் குறிப்பிட பயன்படுகிறது.
tr_tr: Statik bağlantının kullanılıp kullanılmayacağını belirtmek için kullanılır.
vi_vn: Dùng để định rõ có nên sử dụng liên kết tĩnh hay không.
