Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_tw

source: When installing the elements and components from source, by default their ``development`` version (which corresponds to the ``master`` git branch) will be used, as opposed to the ``stable`` version (which contains the same codebase as the published ``pip`` packages). Since the ``development`` versions of an element or component usually include new features and changes, they generally require using the ``development`` version of the rest of the items as well.
bn_bn: উৎস থেকে উপাদানগুলো ইন্সটল করার সময় ``stable`` সংস্করণের (যার কিনা ``pip`` প্যাকেজের সমতুল্য কোডবেজ আছে) বিপরীতে ডিফল্ট হিসেবে ``development`` সংস্করণ (``master`` গিট শাখার) ব্যবহৃত হয়। ``development`` সংস্করণে নতুন ফিচার এবং পরিবর্তন অন্তর্ভুক্ত থাকায় সাধারণত অন্য সব উপাদানের জন্যও ``development`` সংস্করণ ব্যবহৃত হয়।
de_de: Wenn Elemente und Komponenten aus dem Quelltext installiert werden, ist es Voreinstellung, dass die ``development``-Version (welche mit dem git-master-Branch übereinstimmt) benutzt wird, und nicht die ``stable``-Version (welche die Quelltextbasis der veröffentlichten ``pip``-Pakete enthält). Weil die ``development``-Versionen eines Elements oder einer Komponente üblicherweise die neuesten Funktionen und Änderungen beinhalten, erfordern diese in der Regel die Verwendung der ``development``-Versionen aller übrigen Objekte.
el_gr: Κατά την εγκατάσταση των στοιχείων και των συστατικών στοιχείων από την πηγή, από προεπιλογή θα χρησιμοποιηθεί η έκδοση ``development`` (η οποία αντιστοιχεί στο ``master`` git branch), σε αντίθεση με την έκδοση `stable`` (η οποία περιέχει την ίδια βάση κώδικα με τα δημοσιευμένα πακέτα ``pip``). Από τις εκδόσεις ``development`` ενός στοιχείου ή συστατικού στοιχείου συνήθως περιλαμβάνουν νέα χαρακτηριστικά και αλλαγές, απαιτούν γενικά τη χρήση της έκδοσης ``development`` και των υπόλοιπων αντικειμένων.
es_mx: Al instalar los elementos y componentes a partir de la fuente, por defecto se usará su versión marcada como ``development`` (que corresponde a la rama git ``master``), y no la versión ``stable`` (que contiene la misma base de código que la publicada en los paquetes ``pip``). Dado que la versiones ``development`` de cada elemento o componente normalmente incluyen nuevas funcionalidades y cambios, generalmente será necesario también instalar las versiones ``development`` del resto del módulo.
es_un: Al instalar los elementos y componentes a partir del código fuente, por defecto se usará su versión marcada como ``development`` (que corresponde a la rama git ``master``), y no la versión ``stable`` (que contiene la misma base de código que la publicada en los paquetes ``pip``). Dado que las versiones ``development`` de cada elemento o componente normalmente incluyen nuevas funcionalidades y cambios, generalmente será necesario también instalar las versiones ``development`` del resto de los elementos.
fr_fr: Lorsqu'une installation depuis la source est réalisée, par défaut, la version ``development``(correspondant à la branche ``master`` de git) sera utilisée, et non la version ``stable`` (qui contient le code des packages ``pip`` publiés). Puisque la version ``development``d'un composant inclut les toutes nouvelles modifications, il est nécessaire alors d'utiliser cette même version pour les autres éléments.
id_id: Saat menginstal elemen dan komponen dari sumber, secara default versi ``pengembangan`` (yang sesuai dengan cabang git ``master``) akan digunakan, sebagai ganti versi ``stabil`` (yang mengandung dasarkode (codebase) yang sama dengan paket ``pip`` yang terpublikasi). Karena versi ``pengembangan`` dari sebuah elemen atau komponen biasanya mengandung fitur dan perubahan baru, mereka umumnya juga memerlukan penggunaan versi ``pengembangan`` pada hal-hal sisanya.
it_it: Quando si installano gli elementi ed i componenti dal codice sorgente, di default viene utilizzata la loro versione ``development`` (che corrisponde al branch ``master`` di git), invece della versione ``stable`` (che contiene il codice pubblicato nei pacchetti ``pip``). Poiché la versione ``development`` di un elemento o componente solitamente include nuove funzionalità e modifiche, generalmente si rende necessario usare la versione ``development`` anche per il resto dei componenti.
pt_un: Ao instalar os elementos e componentes da fonte, por padrão sua versão ``development`` (que corresponde a ``master`` git branch) será usada, ao contrário da versão ``stable`` (que contém a mesma base de código que os pacotes ``pip`` publicados). Uma vez que as versões ``development`` de um elemento ou componente geralmente incluem novas características e mudanças, geralmente eles exigem usar a versão ``development`` ao resto dos itens também.
ru_ru: При установке компонентов из исходного кода, по умолчанию будет использоваться их ``development`` версия (которая соответствует ``master`` ветке в git), а не ``stable`` версия (которая содержит тот же код, что и опубликованные пакеты ``pip``). Поскольку ``development`` версии элемента или компонента обычно включают в себя новые функции и последние изменения, они обычно требуют использования ``development`` версии и остальных компонентов.
sw_ke: Wakati unasakinisha vipengee na visehemu kutoka kwa chanzo, kwa chaguo-msingi toleo la ``maendeleo`` (ambayo inalingana na tawi la git la ``master``) litatumika, kinyume na toleo la ``thabiti`` (ambalo lina codebase sawa kama vifurushi vilivyochapishwa vya ``pip``). Kwa kuwa matoleo ya ``maendeleo`` ya kifurushi au sehemu kawaida hujumuisha vipengee vipya na mabadiliko, kwa jumla zinahitaji kutumia toleo la ``maendeleo`` la vitu vingine pia.
ta_in: மூலத்திலிருந்து கூறுகள் மற்றும் கூறுகளை நிறுவும் போது, இயல்பாகவே அவற்றின் ``development`` பதிப்பு (இது ``மாஸ்டர்`` கிட் கிளைக்கு ஒத்திருக்கிறது), ``stable`` பதிப்பிற்கு (இது வெளியிடப்பட்ட ``pip`` 'தொகுப்புகளின் அதே கோட்பேஸைக் கொண்டுள்ளது). ஒரு உறுப்பு அல்லது கூறுகளின் ``development`` பதிப்புகள் வழக்கமாக புதிய அம்சங்கள் மற்றும் மாற்றங்களைக் கொண்டிருப்பதால், அவை பொதுவாக மீதமுள்ள பொருட்களின் ``development`` பதிப்பையும் பயன்படுத்த வேண்டும்.
tr_tr: Elemanları ve bileşenleri kaynaktan kurarken, ``kararlı`` sürümün aksine (yayınlanan ``pip`` paketleri gibi aynı kod tabanını içerir), varsayılan olarak ``geliştirme`` sürümü (``master`` git dalına karşılık gelir) kullanılacak. Bir öğenin veya bileşenin ``geliştirme`` sürümleri genellikle yeni özellikler ve değişiklikler içerdiğinden, genellikle öğelerin geri kalanının ``geliştirme`` sürümünü kullanmayı gerektirirler.
vi_vn: Khi cài các thành phần và phần tử từ nguồn, mặc định phiên bản ``phát triển``(tương ứng với nhánh master) sẽ được sử dụng, trái ngược với phiên bản ``ổn định`` (chứa codebase y nguyên với gói cài từ ``pip``). Vì phiên bản ``phát triển`` của các thành phần thường chứa những tính năng mới và thay đổi, nên chúng sẽ yêu cầu sử dụng phiên bản ``phát triển`` cho tất cả mục về sau.

source: The Terra and Aer packages both require a compiler to build from source before you can install. Ignis, Aqua, and the IBM Quantum Provider backend do not require a compiler.
bn_bn: টেরা এবং এয়ার প্যাকেজ উভয়েরই উত্স থেকে ইনস্টল করার আগে কম্পাইলার প্রয়োজন। ইগনিস, একোয়া, এবং আই বি এম কোয়ান্টাম প্রোভাইডার ব্যাকএন্ড এর জন্যে কম্পাইলার প্রয়োজন নয়।
de_de: Die Terra- und Aer-Pakete benötigen beide zum Kompilieren aus dem Quelltext einen Compiler bevor man diese installieren kann. Ignis, Aqua und das "IBM Quantum Provider"-Backend benötigen keinen Compiler.
el_gr: Τα πακέτα Terra και Aer απαιτούν και τα δύο έναν μεταγλωττιστή να χτιστούν από την πηγή πριν να μπορέσετε να τα εγκαταστήσετε. Τα Ignis, Aqua, και το σύστημα υποστήριξης της IBM Quantum Provider δεν απαιτούν μεταγλωττιστή.
es_mx: Los paquetes de Terra y Aer requieren un compilador para construirse a partir del código fuente antes de poder instalarlos. Ignis, Aqua y el backend de IBM Quantum Provider no necesitan un compilador.
es_un: Los paquetes de Terra y Aer requieren un compilador para construirse a partir del código fuente antes de poder instalarlos. Ignis, Aqua y el backend de IBM Quantum Provider no necesitan un compilador.
fr_fr: Les packages Terra et Aer nécessitent un compilateur pour être construits depuis la source avant installation. Ignis, Aqua, et IBM Quantum Provider backend ne nécessitent pas de compilateur.
id_id: Paket Terra dan Aer membutuhkan kompiler untuk membangun dari sumber sebelum Anda dapat melakukan instalasi. Ignis, Aqua, dan backend Penyedia Kuantum IBM tidak memerlukan kompiler.
it_it: I pacchetti Terra e Aer richiedono entrambi un compilatore per eseguire la build del codice sorgente prima di poter essere installati. Ignis, Aqua ed il backend IBM Quantum Provider non richiedono invece nessun compilatore.
pt_un: Ambos os pacotes Terra e Aer requerem um compilador para construir a partir da fonte antes da instalação. Ignis, Aqua e o provedor IBM Quantum não exigem um compilador.
ru_ru: Пакеты Terra и Aer требуют компилятор для сборки из исходного кода перед установкой. Ignis, Aqua и IBM Quantum Provider не требуют компилятора.
sw_ke: Vifurushi vya Terra na Aer vinahitaji compiler ili kujenga kutoka kwa chanzo kabla ya kusakinisha. Ignis, Aqua na IBM Quantum Provider backend havihitaji compiler.
ta_in: டெரா மற்றும் ஆர் தொகுப்புகள் இரண்டுமே நீங்கள் நிறுவுவதற்கு முன் மூலத்தில் இருந்து உருவாக்க ஒரு தொகுப்பி தேவை. Ignis, Aqua, மற்றும் IBM Quantum வழங்குபவர் பின்னணி ஒரு கணினி தேவை இல்லை.
tr_tr: Terra ve Aer paketlerinin her ikisi de, yüklemeden önce kaynak derleyici oluşturmak için bir derleyici gerektirir. Ignis, Aqua ve IBM Quantum Provider arka ucu bir derleyici gerektirmez.
vi_vn: Gói Terra và Aer đều yêu cầu trình biên dịch dựng từ gốc trước khi bạn có thể cài đặt chúng. Trái ngược với Terra và Aer thì gói Ignis, Aqua, và IBM Quantum Provider backend không yêu cầu trình biên dịch.

source: Installing elements from source requires the following order of installation to prevent installing versions of elements that may be lower than those desired if the ``pip`` version is behind the source versions:
bn_bn: যদি ``pip`` এর সংস্করণ উৎসের সংস্করণের চেয়ে পুরোনো হয় তবে উপাদানগুলির নিম্নতর সংস্করণ ইনস্টল করা থেকে বিরত থাকার জন্য উৎস থেকে উপাদানগুলি ইনস্টল করার নিম্নলিখিত ক্রম অনুসরণ করা প্রয়োজন ।
de_de: Das Installieren von Elementen aus dem Quellcode erfordert die folgende Reihenfolge, um die Installation von Elementen mit niedrigerer Version als der gewünschten zu vermeiden, falls die ``pip`` Versionen älter als die Quellversionen ist:
el_gr: Η εγκατάσταση στοιχείων από την πηγή απαιτεί την ακόλουθη σειρά εγκατάστασης για να αποτραπεί η εγκατάσταση εκδόσεων στοιχείων που μπορεί να είναι μικρότερες από τις επιθυμητές, εάν η έκδοση `pip`είναι πίσω από τις εκδόσεις πηγής:
es_mx: La instalación de los elementos a partir del código fuente requiere que se respete el siguiente orden de instalación para evitar que se instalen versiones inferiores de elementos si la versión en ``pip`` es inferior a la de las versiones fuentes:
es_un: La instalación de los elementos a partir del código fuente requiere que se respete el siguiente orden de instalación para evitar que se instalen versiones inferiores de elementos si la versión en ``pip`` es inferior a la de las versiones del código fuente:
fr_fr: Installer depuis la source requière de respecter l'ordre d'installation suivant :
id_id: Memasang elemen dari sumber membutuhkan urutan instalasi yang diperintahkan untuk mencegah pemasangan dari versi elemen yang mungkin lebih rendah dari yang diinginkan jika versi ``pip`` merupakan versi sebelum versi sumber:
it_it: L'installazione di elementi da codice sorgente richiede il seguente ordine di installazione per impedire che vegano installate versioni di elementi che possono essere inferiori a quelle desiderate, se la versione di ``pip`` è precedente alle versioni del sorgente:
pt_un: Instalar elementos da fonte requer a seguinte ordem de instalação para evitar a instalação de versões de elementos que podem ser menores do que as desejadas se a versão ``pip`` estiver atrás das versões fonte:
ru_ru: Установка элементов из исходного кода требует следующего порядка установки. Это нужно для предотвращения использования версий, которые могут быть ниже желаемых, если ``pip`` версия старее, чем версия из исходного кода:
sw_ke: Kusakinisha vipengee kutoka kwa chanzo kunahitaji utaratibu ufuatao wa usakinishaji kuzuia kusakinisha matoleo ya vipengee ambavyo vinaweza kuwa chini kuliko inavyotakikana ikiwa toleo la ``pip`` liko nyuma ya matoleo ya chanzo:
ta_in: மூலத்திலிருந்து உறுப்புகளை நிறுவுவதற்கு, ``pip`` பதிப்பு மூல பதிப்புகளுக்குப் பின்னால் இருந்தால், விரும்பியதை விடக் குறைவாக இருக்கும் உறுப்புகளின் பதிப்புகளை நிறுவுவதைத் தடுக்க பின்வரும் நிறுவலின் வரிசை தேவைப்படுகிறது:
tr_tr: Yüklü ``pip`` sürümü kaynaktaki sürümünden eski ise, öğelerin kaynağından kurulması, öğelerin sürümlerinden daha eski olabilecek sürümlerin yüklenmesini önlemek için aşağıdaki kurulum sırasını gerektirir:
vi_vn: Cài đặt các thành phần từ gốc yêu cầu việc cài đặt theo đúng trình tự để ngăn ngừa việc cài đặt các phiên bản thấp hơn của các thành phần bạn cần nếu phiên bản ``pip`` vẫn ở phía sau phiên bản gốc:

source: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (if you want to connect to the IBM Quantum devices or online simulator)
bn_bn: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (আপনি যদি আই বি এম কোয়ান্টামযন্ত্র বা অনলাইন সিমুলেটরের সাথে যুক্ত হতে চান)
de_de: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (wenn man auf einen IBM Quantum-Device oder einen Online-Simulator zugreifen will)
el_gr: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (αν θέλετε να συνδεθείτε με τις συσκευές IBM Quantum ή τον online προσομοιωτή)
es_mx: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (si quieres conectarte a los dispositivos de IBM Quantum o al simulador online)
es_un: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (si quieres conectarte a los dispositivos de IBM Quantum o al simulador online)
fr_fr: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (si vous souhaitez pouvoir vous connecter à des devices IBM Quantum ou accéder au simulateur en ligne)
id_id: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (jika Anda ingin terhubung dengan perangkat Kuantum atau simulator online IBM)
it_it: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (se ci si vuole collegare ai dispositivi IBM Quantum o online)
pt_un: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (se você quiser conectar aos dispositivos IBM Quantum ou o simulador online)
ru_ru: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (если вы хотите подключаться к устройствам IBM Quantum или онлайн-симулятору)
sw_ke: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (ikiwa unataka kuunganishwa na vifaa vya IBM Quantum au mtambo ya kuiga wa mtandaoni)
ta_in: :ref:`qiskit-ibmq-வழங்குபவர் <install-qiskit-ibmq-provider>` (நீங்கள் IBM Quantum சாதனங்கள் அல்லது ஆன்லைன் சிமுலேட்டருடன் இணைக்க விரும்பினால்)
tr_tr: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (IBM Kuantum aygıtlarına ya da çevrimiçi simülatöre bağlanmak istiyorsanız)
vi_vn: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (Nếu bạn muốn kết nối đến các thiết bị lượng tử của IBM hoặc trình giả lập online)

source: To work with several components and elements simultaneously, use the following steps for each element.
bn_bn: একসাথে বেশ কয়েকটি উপাদানের সাথে কাজ করতে প্রতিটি উপাদানের জন্য নিম্নলিখিত পদক্ষেপগুলি ব্যবহার করুন।
de_de: Um gleichzeitig mit mehreren Komponenten und Elementen zu arbeiten, verwenden Sie für jedes Element die folgenden Schritte.
el_gr: Για να εργαστείτε με διάφορα συστατικά και στοιχεία ταυτόχρονα, χρησιμοποιήστε τα ακόλουθα βήματα για κάθε στοιχείο.
es_mx: Para trabajar en varios components y elementos simultáneamente, sigue los siguientes pasos para cada elemento.
es_un: Para trabajar en varios componentes y elementos simultáneamente, sigue los siguientes pasos para cada elemento.
fr_fr: Pour travailler avec plusieurs composants et éléments en même temps, suivez l'ordre ci-dessous pour chaque composant.
id_id: Untuk bekerja dengan beberapa komponen dan elemen secara bersamaan, gunakan langkah-langkah berikut untuk setiap elemen.
it_it: Per lavorare contemporaneamente con più componenti ed elementi, seguire i seguenti passaggi per ogni elemento.
pt_un: Para trabalhar com vários componentes e elementos simultaneamente, use as seguintes etapas para cada elemento.
ru_ru: Для одновременной работы с несколькими компонентами используйте следующие шаги для каждого элемента.
sw_ke: Kufanya kazi na vifaa kadhaa na vipengele kwa wakati mmoja, tumia hatua zifuatazo kwa kila kipengele.
ta_in: பல கூறுகள் மற்றும் தனிமங்களுடன் ஒரே நேரத்தில் வேலை செய்யவும், ஒவ்வொரு உறுப்புகளுக்கான பின்வரும் படிவங்களைப் பயன்படுத்தவும்.
tr_tr: Aynı anda birden çok bileşen ve öğeyle çalışmak istiyorsanız, her bir öğe için aşağıdaki adımları kullanın.
vi_vn: Để có thể làm việc với các thành phần và phần tử cùng lúc, hãy làm theo các bước sau cho mỗi thành phần.
