Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/deprecation_policy.po
Languages: de_de, es_un, fr_fr, ja_jp, ko_kr, pt_un, ru_ru, ta_in, te_in, tr_tr

source: After the alternative path has been in place for at least one minor version, :ref:`issue the deprecation warnings <issuing-deprecation-warnings>`. Add a release note with a ``deprecations`` section listing all deprecated paths, their alternatives, and the reason for deprecation. :ref:`Update the tests to test the warnings <testing-deprecated-functionality>`.
de_de: Nachdem der alternative Pfad für mindestens eine kleine Version vorhanden ist, gibt :ref:`die Deprecation Warnungen <issuing-deprecation-warnings>` aus. Füge eine Versionsnotiz mit einem ``deprecations`` Hinweis hinzu, die alle veralteten Pfade, ihre Alternativen und den Grund für die Deprecation auflistet. :ref:`Aktualisiere die Tests, um die Warnungen <testing-deprecated-functionality> ` zu testen.
es_un: Después de que la ruta alternativa haya estado presente en al menos una versión menor, se deben :ref:`emitir las advertencias de desaprobación <issuing-deprecation-warnings>`. Agrega una nota de la versión con una sección de ``deprecations`` que enumere todas las rutas obsoletas, sus alternativas y el motivo de la obsolescencia. :ref:`Actualiza las pruebas para probar las advertencias <testing-deprecated-functionality>`.
fr_fr: Une fois que le chemin alternatif a été en place pour au moins une version mineure, :ref:` émission des avertissements d'obsolescence <issuing-deprecation-warnings>`. Ajoutez une note d'édition avec une section ``dépréciations``qui répertorie tous les chemins obsolètes, leurs alternatives et la raison de l'obsolescence. :ref:`Mise à jour des tests pour tester les avertissements <testing-deprecated-functionality>`.
ja_jp: 少なくとも 1 つのマイナー バージョンの代替パスが設定されたら、 :ref:`非推奨の警告を発行 <issuing-deprecation-warnings>` します。 非推奨のすべてのパス、代替パス、および非推奨の理由を記載した ``deprecations`` セクションを含むリリース ノートを追加します。 :ref:`テストを更新して、警告をテスト <testing-deprecated-functionality>` します。
ko_kr: 최소한 하나의 마이너 버전에 대한 대체 경로가 설정되면 :ref:`issue the deprecation warnings <issuing-deprecation-warnings>` 를 발행한다. 더 이상 사용되지 않는 경로, 해당 대안 및 사용 중단 이유를 나열하는 ``deprecations`` 섹션이 있는 릴리스 노트를 추가한다. :ref:`Update the tests to test the warnings <testing-deprecated-functionality>` 경고를 테스트하기 위해 테스트를 업데이트 한다.
pt_un: Depois que o caminho alternativo estiver em vigor para pelo menos uma versão secundária, :ref:`emita os avisos de descontinuação <issuing-deprecation-warnings>`. Adicione uma nota de lançamento com uma seção ``deprecations`` listando todos os caminhos obsoletos, suas alternativas e o motivo da descontinuação. :ref:`Atualize os testes para testar os avisos <testing-deprecated-functionality>`.
ru_ru: После того, как альтернативный способ предложен как минимум в одной младшей версии, :ref:`добавляется предупреждение об устаревании <issuing-deprecation-warnings>`. Добавьте примечание в разделе ``deprecations``, где перечислены все устаревшие способы, их альтернативы и причина устаревания. :ref:`Обновите тесты для проверки предупреждений <testing-deprecated-functionality>`.
ta_in: குறைந்தபட்சம் ஒரு சிறிய பதிப்பிற்கு மாற்று பாதை அமைக்கப்பட்ட பிறகு, :ref:`தேக்கநிலை எச்சரிக்கைகளை <issuing-deprecation-warnings>` வழங்கவும். அனைத்து நீக்கப்பட்ட பாதைகள், அவற்றின் மாற்றுகள் மற்றும் தேய்மானத்திற்கான காரணத்தை பட்டியலிடும் ``தேக்கங்கள்`` பிரிவுடன் வெளியீட்டுக் குறிப்பைச் சேர்க்கவும். :ref:`<testing-deprecated-functionality>` எச்சரிக்கைகளைச் சோதிக்க சோதனைகளைப் புதுப்பிக்கவும்.
te_in: కనీసం ఒక మైనర్ వెర్షన్ కోసం ప్రత్యామ్నాయ మార్గం ఏర్పడిన తర్వాత, :ref:` నిలిపివేయబడిన హెచ్చరికలను <issuing-deprecation-warnings>` జారీ చేయండి. అన్ని నిలిపివేయబడిన పాత్‌లు, వాటి ప్రత్యామ్నాయాలు మరియు నిరాకరణకు కారణాన్ని జాబితా చేసే ``నిరాకరణలు`` విభాగంతో విడుదల గమనికను జోడించండి. :ref:`<testing-deprecated-functionality>` హెచ్చరికలను పరీక్షించడానికి పరీక్షలను నవీకరించండి.
tr_tr: En az bir alt sürüm için alternatif yol uygulandıktan sonra, :ref:`kullanımdan kaldırma uyarılarını yayınlayın <issuing-deprecation-warnings>`. Kullanımdan kaldırılan tüm yolları, bunların alternatiflerini ve kullanımdan kaldırma nedenini listeleyen bir ``deprecations`` bölümü içeren bir sürüm notu ekleyin. :ref:`Uyarılarını test etmek için testleri güncelleyin <testing-deprecated-functionality>`.

source: *Reason*: removals must be highly visible for at least one version, to minimize the surprise to users when they actually go.
de_de: *Grund*: Entfernungen müssen für mindestens eine Version sehr sichtbar sein, um die Überraschung für Benutzer zu minimieren, wenn die Entfernungen dann tatsächlich durchgeführt wurden.
es_un: *Motivo*: las eliminaciones deben ser muy visibles en al menos una versión, a fin de minimizar la sorpresa de los usuarios cuando realmente se vayan.
fr_fr: *Raison*: les suppressions doivent être très visibles pour au moins une version, afin de minimiser la surprise pour les utilisateurs lorsqu'elles seront effectivement supprimées.
ja_jp: *理由* : ユーザーが実際に行ったときの驚きを最小限に抑えるために、削除は少なくとも 1 つのバージョンで目立つようにする必要があります。
ko_kr: *이유*: 버젼 이동이 발생했을 때 사용자의 충격을 최고화 하기 위해 제거는 최소한 하나의 버전에서 잘 공지되고 사용자에게 알려져야 한다.
pt_un: *Razão*: as remoções devem ser altamente visíveis para pelo menos uma versão, para minimizar a surpresa dos usuários quando eles realmente forem.
ru_ru: *Причина*: удаление должно быть заметно хотя бы в одной версии, чтобы пользователи не удивлялись, что этот элемент исчез.
ta_in: *காரணம்*: பயனர்கள் உண்மையில் செல்லும்போது ஆச்சரியப்படுவதைக் குறைக்க, குறைந்தபட்சம் ஒரு பதிப்பிலாவது அகற்றுதல்கள் அதிகமாகத் தெரியும்.
te_in: *కారణం*: వినియోగదారులు నిజంగా వెళ్లినప్పుడు ఆశ్చర్యాన్ని తగ్గించడానికి, కనీసం ఒక వెర్షన్కు తీసివేతలు ఎక్కువగా కనిపించాలి.
tr_tr: *Sebep*: Kaldırma işlemleri, gerçekten gittiklerinde kullanıcıların karşılaşacağı sürprizi en aza indirmek için en az bir sürümde oldukça görünür olmalıdır.

source: Set a removal date for the old feature, and remove it (and the warnings) when reached. This must be at least three months after the version with the warnings was first released, and cannot be the minor version immediately after the warnings. Add an ``upgrade`` release note that lists all the removals. For example, if the alternative path was provided in ``0.19.0`` and the warnings were added in ``0.20.0``, the earliest version for removal is ``0.22.0``, even if ``0.21.0`` was released more than three months after ``0.20.0``.
de_de: Legen Sie ein Entfernungsdatum für das alte Feature fest und entfernen Sie es (und die Warnungen), wenn das Datum erreicht ist. Dies muss mindestens drei Monate nach der ersten Veröffentlichung der Version mit den Warnungen geschehen und kann nicht die untergeordnete Version nach den Warnungen sein. Füge eine ``Upgrade`` Release Notiz hinzu, die alle Entfernungen auflistet. Wenn zum Beispiel der alternative Pfad in ``0.19.0`` angegeben wurde und die Warnungen in ``0.20.0`` hinzugefügt wurden. 0.0``, dann ist die früheste Version für das Entfernen die Version ``0.22.0``, auch wenn ``0.21.0`` mehr als drei Monate nach ``0.20.0`` veröffentlicht wurde.
es_un: Establece una fecha de eliminación para la función anterior y elimínala (junto con las advertencias) cuando suceda. Esto debe ser al menos tres meses después de que se lanzó por primera vez la versión con las advertencias, y no puede ser la versión secundaria inmediatamente después de las advertencias. Agrega una nota de lanzamiento de ``upgrade`` que enumere todas las eliminaciones. Por ejemplo, si la ruta alternativa se proporcionó en ``0.19.0`` y las advertencias se agregaron en ``0.20.0``, la primera versión para la remoción es ``0.22.0``, incluso si ``0.21.0`` se lanzó más de tres meses después de ``0.20.0``.
fr_fr: Définissez une date de suppression pour l'ancienne fonction et supprimez-la (ainsi que les avertissements) lorsque cette date est atteinte. Cela doit être au moins trois mois après que la version avec les avertissements a été publiée pour la première fois, et ne peut pas être la version mineure immédiatement après les avertissements. Ajoutez une note de mise à niveau ``upgrade`` qui répertorie toutes les suppressions. Par exemple, si le chemin alternatif a été fourni dans ``0.19.0`` et que les avertissements ont été ajoutés dans ``0.20.0``, la version la plus ancienne pour le retrait est ``0.22.0``, même si ``0.21.0`` a été publié plus de trois mois après ``0.20.0``.
ja_jp: 古い機能の削除日を設定し、到達したらそれ (および警告) を削除します。 これは、警告のあるバージョンが最初にリリースされてから 3 か月以上経過している必要があり、警告の直後のマイナー バージョンであってはなりません。 すべての削除を一覧表示する ``upgrade`` リリースノートを追加します。 たとえば、代替パスが ``0.19.0`` で提供され、警告が ``0.20.0`` で追加された場合、 ``0.20.0`` から 3 か月以上後に ``0.21.0`` がリリースされたとしても、削除される最も古いバージョンは ``0.22.0`` です。
ko_kr: 이전 기능의 제거 날짜를 설정하고 도달하면 제거(및 경고)한다. 제거 날짜는 경고가 있는 버전이 처음 릴리스된 후 최소 3개월 이후이어야 하며 경고 직후의 마이너 버전이 될 수 없다. 모든 제거를 나열하는 ``upgrade`` 릴리스 노트를 한다. 예를 들어, 대체 경로가 ``0.19.0`` 에 제공되고 경고가 ``0.20.0`` 에 추가된 경우, ``0.21.0`` 이 ``0.20.0`` 이 발표된 후 3개월 이후에 발표 되었다고 하더라도, 대상이 실질적으로 제거될 가장 빠른 버전은 ``0.22.0`` 이 된다.
pt_un: Defina uma data de remoção para o recurso antigo e remova-o (e os avisos) quando atingido. Isso deve ocorrer pelo menos três meses após o primeiro lançamento da versão com os avisos e não pode ser a versão secundária imediatamente após os avisos. Adicione uma nota de versão ``upgrade`` que lista todas as remoções. Por exemplo, se o caminho alternativo foi fornecido em ``0.19.0`` e os avisos foram adicionados em ``0.20.0``, a versão mais antiga para remoção é ``0.22.0``, mesmo se ``0.21.0`` foi lançado mais de três meses após ``0.20.0``.
ru_ru: Установите дату удаления старого элемента и уберите его (как и предупреждение) в этот день. Это должно быть произойти не ранее, чем через три месяца после выпуска первой версии с предупреждениями, и минимум через одну младшую версию. Добавьте примечание к выпуску ``upgrade``, в котором перечислены все удаления. Например, если альтернативный способ был предоставлен в ``0.19.0``, а предупреждения были добавлены в ``0.20.0``, самой ранней версией для удаления является ``0.22.0``, даже если ``0.21.0`` выпускается через три месяца после ``0.20.0`` или позднее.
ta_in: பழைய அம்சத்திற்கு அகற்றும் தேதியை அமைத்து, அதை (மற்றும் எச்சரிக்கைகள்) அடைந்ததும் அகற்றவும். எச்சரிக்கையுடன் கூடிய பதிப்பு முதலில் வெளியிடப்பட்டு குறைந்தது மூன்று மாதங்களுக்குப் பிறகு இது இருக்க வேண்டும், மேலும் எச்சரிக்கைகளுக்குப் பிறகு உடனடியாக சிறிய பதிப்பாக இருக்க முடியாது. அனைத்து நீக்குதல்களையும் பட்டியலிடும் ``மேம்படுத்து`` வெளியீட்டுக் குறிப்பைச் சேர்க்கவும். எடுத்துக்காட்டாக, ``0.19.0`` இல் மாற்றுப் பாதை வழங்கப்பட்டு, எச்சரிக்கைகள் ``0.20.0`` இல் சேர்க்கப்பட்டால், ``0.21 ஆக இருந்தாலும், அகற்றுவதற்கான முந்தைய பதிப்பு ``0.22.0`` ஆகும். ``0.20.0``க்குப் பிறகு மூன்று மாதங்களுக்கும் மேலாக. 0`` வெளியிடப்பட்டது.
te_in: పాత ఫీచర్ కోసం తీసివేత తేదీని సెట్ చేయండి మరియు చేరుకున్నప్పుడు దాన్ని (మరియు హెచ్చరికలు) తీసివేయండి. హెచ్చరికలతో కూడిన వెర్షన్ మొదట విడుదలైన తర్వాత ఇది తప్పనిసరిగా కనీసం మూడు నెలలు అయి ఉండాలి మరియు హెచ్చరికలు వచ్చిన వెంటనే మైనర్ వెర్షన్ కాకూడదు. అన్ని తీసివేతలను జాబితా చేసే ``అప్‌గ్రేడ్`` విడుదల గమనికను జోడించండి. ఉదాహరణకు, ప్రత్యామ్నాయ మార్గం ``0.19.0``లో అందించబడి, హెచ్చరికలు ``0.20.0``లో జోడించబడితే, ``0.20.0`` తర్వాత మూడు నెలల తర్వాత ``0.21.0` విడుదల చేయబడినప్పటికీ, తీసివేయడానికి తొలి వెర్షన్ ``0.22.0``.
tr_tr: Eski özellik için bir kaldırma tarihi belirleyin ve ulaşıldığında onu (ve uyarıları) kaldırın. Bu, uyarıların bulunduğu sürümün ilk yayınlanmasından en az üç ay sonra olmalıdır ve uyarılardan hemen sonraki alt sürüm olamaz. Tüm kaldırmaları listeleyen bir ``upgrade`` sürüm notu ekleyin. Örneğin, ``0.19.0``'da alternatif yol sağlandıysa ve ``0.20.0``'da uyarılar eklendiyse, ``0.21.0`` sürümü ``0.20.0``dan üç aydan fazla bir süre sonra yayınlanmış olsa bile, kaldırma için en erken sürüm ``0.22.0`` olur.

source: These are *minimum* requirements. For removal of significant or core features, give users at least an extra minor version if not longer.
de_de: Dies sind *Mindest* Anforderungen. Um signifikante oder Kernfunktionen zu entfernen, geben Sie den Benutzern mindestens eine zusätzliche untergeordnete Version Zeit, oder sogar länger.
es_un: Estos son requisitos *mínimos*. Para la eliminación de funciones importantes o principales, proporciona a los usuarios al menos una versión menor adicional, si no es que más.
fr_fr: Ces exigences sont le *minimum*. Pour retirer des fonctions importantes ou de base, accordez aux utilisateurs au moins une version secondaire supplémentaire si ce n'est plus.
ja_jp: これらは最小要件です。 重要な機能またはコア機能を削除する場合は、少なくとも追加のマイナー バージョンをユーザーに提供してください。
ko_kr: 이것은 *최소* 요구사항 이다. 중요하거나 핵심적인 기능을 제거하려면, 제공이 중단되기 전 사용자에게 최소한 추가적인 마이너 버전을 제공한다.
pt_un: Estes são requisitos *mínimos*. Para a remoção de recursos significativos ou principais, forneça aos usuários pelo menos uma versão secundária extra, se esta não estiver disponivel.
ru_ru: Это *минимальные* требования. При удалении важных или основных деталей лучше растянуть процесс еще на одну или несколько дополнительных младших версий.
ta_in: இவை *குறைந்தபட்ச* தேவைகள். குறிப்பிடத் தக்க அல்லது முக்கிய அம்சங்களை அகற்ற, பயனர்களுக்குக் குறைந்தபட்சம் கூடுதல் சிறிய பதிப்பை வழங்கவும்.
te_in: ఇవి *కనీస* అవసరాలు. ముఖ్యమైన లేదా ప్రధాన ఫీచర్‌ల తొలగింపు కోసం, వినియోగదారులకు ఎక్కువ కాలం కాకపోతే కనీసం అదనపు మైనర్ వెర్షన్‌ను ఇవ్వండి.
tr_tr: Bunlar *minimum* gereksinimlerdir. Önemli veya temel özelliklerin kaldırılması için, kullanıcılara en azından ekstra küçük bir sürüm verin.

source: *Reason*: there needs to be time for users to see these messages, and to give them time to adjust. Not all users will update their version of Qiskit immediately, and some may skip minor versions.
de_de: *Grund*: Es muss Zeit für die Benutzer geben, diese Nachrichten zu sehen und ihnen Zeit für die Anpassung zu geben. Nicht alle Benutzer werden ihre Version von Qiskit sofort aktualisieren, und einige könnten kleinere Versionen überspringen.
es_un: *Motivo*: debe haber tiempo para que los usuarios vean estos mensajes y darles tiempo para adaptarse. No todos los usuarios actualizarán su versión de Qiskit inmediatamente y algunos pueden omitir versiones menores.
fr_fr: *Raison* : il faut du temps pour que les utilisateurs puissent voir ces messages et leur donner le temps de s'ajuster. Tous les utilisateurs ne mettent pas à jour leur version de Qiskit immédiatement, et certains peuvent laisser passer des versions mineures.
ja_jp: *理由* : ユーザーがこれらのメッセージを見て、調整する時間が必要です。 すべてのユーザーが Qiskit のバージョンをすぐに更新するわけではなく、一部のユーザーはマイナー バージョンをスキップする場合があります。
ko_kr: *이유* : 사용자에게 경고를 확인 한 후 적응할 시간을 제공한다. 모든 사용자가 Qiskit 버전을 최신으로 유지하는 것은 아니며 일부는 마이너 버젼들을 건너뛰기도 한다.
pt_un: *Motivo*: é preciso haver tempo para os usuários verem essas mensagens e dar-lhes tempo para se ajustarem. Nem todos os usuários atualizarão sua versão do Qiskit imediatamente e alguns podem pular versões secundárias.
ru_ru: *Причина*: пользователям нужно время, чтобы увидеть эти сообщения и изменить код. Не все пользователи сразу обновляют Qiskit, некоторые могут пропускать младшие версии.
ta_in: *காரணம்*: பயனர்கள் இந்தச் செய்திகளைப் பார்ப்பதற்கும், அவற்றைச் சரிசெய்ய அவர்களுக்கு நேரம் ஒதுக்குவதற்கும் நேரம் இருக்க வேண்டும். அனைத்து பயனர்களும் தங்கள் Qiskit பதிப்பை உடனடியாகப் புதுப்பிக்கமாட்டார்கள், மேலும் சிலர் சிறிய பதிப்புகளைத் தவிர்க்கலாம்.
te_in: *కారణం*: వినియోగదారులు ఈ సందేశాలను చూడడానికి మరియు సర్దుబాటు చేయడానికి వారికి సమయం కావాలి. వినియోగదారులందరూ తమ Qiskit వెర్షన్ను వెంటనే అప్‌డేట్ చేయరు మరియు కొందరు చిన్న వెర్షన్లను దాటవేయవచ్చు.
tr_tr: *Sebep*: Kullanıcıların bu mesajları görmesi ve uyum sağlaması için onlara zaman tanınması gerekir. Tüm kullanıcılar Qiskit sürümlerini hemen güncellemeyecek ve bazıları küçük sürümleri atlayabilir.

source: When a feature is marked as deprecated it is slated for removal, but users should still be able to rely on it to work correctly. We consider a feature marked "deprecated" as frozen; we commit to maintaining it with critical bug fixes until it is removed, but we won't merge new functionality to it.
de_de: Wenn eine Funktion als veraltet markiert wird, ist sie zur Entfernung vorgemerkt, aber die Benutzer sollten sich trotzdem darauf verlassen können, dass sie noch korrekt funktioniert. Wir betrachten eine mit "veraltet" markierte Funktion als eingefroren. Wir verpflichten uns, weiterhin kritische Fehlerkorrekturen für die Funktion durchzuführen, bis sie entfernt wird. Wir werden aber keine neuen Funktionen mit ihr zusammenführen.
es_un: Cuando una función se marca como obsoleta, está programada para su eliminación, pero los usuarios aún deberían poder confiar en que funcionará correctamente. Consideramos una característica marcada como "obsoleta" como congelada; nos comprometemos a mantenerlo con correcciones de errores críticos hasta que sea eliminada, pero no le agregaremos nueva funcionalidad.
fr_fr: Lorsqu'une fonctionnalité est marquée comme obsolète, elle est destinée à être supprimée, mais les utilisateurs devraient pouvoir compter sur elle pour fonctionner correctement. Nous considérons une fonctionnalité marquée "dépréciée" comme gelée ; nous nous engageons à le maintenir avec des corrections de bogues critiques jusqu'à ce qu'il soit supprimé, mais nous ne fusionnerons pas de nouvelles fonctionnalités.
ja_jp: 機能が非推奨としてマークされている場合、その機能は削除される予定ですが、ユーザーは引き続き正しく機能するために信頼できるはずです。 「非推奨」とマークされた機能は凍結されていると見なされます。 削除されるまで重要なバグ修正を維持することを約束しますが、新しい機能をマージすることはありません。
ko_kr: 특정 기능이 사용 중지로 표기되면 제거 준비가 진행되지만, 사용자는 여전히 이 기능을 사용해 작업할 수 있어야 한다. "deprecated"로 표시된 기능은 더이상 업데이트되지 않고 고정된 것으로 간주한다. 따라서 제거될 때까지는 기능을 유지하기 위해 치명적인 버그 수정등은 유지하지만, 기능에 새로운 기능을 추가하지는 않는다.
pt_un: Quando um recurso é marcado como obsoleto, ele está programado para remoção, mas os usuários ainda devem poder confiar que ele funcionará corretamente. Consideramos um recurso marcado como "obsoleto" como congelado; comprometemo-nos a mantê-lo com correções de bugs críticos até que seja removido, mas não vamos mesclar novas funcionalidades a ele.
ru_ru: Если элемент отмечен как устаревший, он будет удален позднее, но пока еще пользователи могут рассчитывать на его корректную работу. "Устаревший" элемент считается замороженным; его поддержка с необходимыми исправлениями осуществляется вплоть до момента удаления, но он не участвует в дальнейшем развитии кода.
ta_in: *காரணம்*: பயனர்கள் இந்தச் செய்திகளைப் பார்ப்பதற்கு, அவற்றைச் சரிசெய்ய அவர்களுக்கு நேரம் ஒதுக்குவதற்கு நேரம் இருக்க வேண்டும். அனைத்து பயனர்களும் Qiskit பதிப்பை உடனடியாகப் புதுப்பிக்கமாட்டார்கள், மேலும் சிலர் சிறிய பதிப்புகளைத் தவிர்க்கலாம்.
te_in: ఫీచర్ నిలిపివేయబడినట్లు గుర్తించబడినప్పుడు అది తీసివేయడానికి నిర్ణయించబడుతుంది, అయితే వినియోగదారులు సరిగ్గా పని చేయడానికి దానిపై ఆధారపడవలసి ఉంటుంది. మేము "తిరస్కరించబడిన" లక్షణాన్ని స్తంభింపచేసినట్లుగా పరిగణించాము; మేము దానిని తొలగించే వరకు క్లిష్టమైన బగ్ పరిష్కారాలతో నిర్వహించడానికి కమ్మిట్ ఉంటాము, కానీ మేము దానికి కొత్త కార్యాచరణను మెర్జ్ చేయము.
tr_tr: Bir özellik kullanımdan kaldırıldı olarak işaretlendiğinde, kaldırılması planlanır, ancak kullanıcılar yine de düzgün çalışacağına güvenebilmelidir. "deprecated" olarak işaretlenen bir özelliği donmuş olarak kabul ediyoruz; kaldırılana kadar kritik hataları düzelterek sürdürmeyi taahhüt ediyoruz, ancak yeni fonksiyonları onunla birleştirmeyeceğiz.

source: Changing behavior
de_de: Verhaltensweise
es_un: Cambio de comportamiento
fr_fr: Changement de comportement
ja_jp: 動作の変更
ko_kr: 변경 작업
pt_un: Mudança de comportamento
ru_ru: Изменение поведения
ta_in: நடத்தையை மாற்றுதல்
te_in: ప్రవర్తనను మార్చడం
tr_tr: Davranışı değiştirme

source: Changing behavior without a removal is particularly difficult to manage, because we need to have both options available for two versions, and be able to issue warnings. For example, changing the type of the return value from a function will almost invariably involve making an API break, which is frustrating for users and makes it difficult for them to use Qiskit.
de_de: Eine Verhaltensweise ohne Entfernung ist besonders schwer zu handhaben, weil wir beide Optionen für zwei Versionen haben und in der Lage sein müssen, Warnungen auszusprechen. Zum Beispiel bedeutet das Ändern des Typs des Rückgabewerts von einer Funktion fast ausnahmslos einen API-Bruch, was für Benutzer frustrierend ist und es ihnen erschwert, Qiskit zu verwenden.
es_un: Cambiar el comportamiento sin una eliminación es particularmente difícil de administrar, porque necesitamos tener ambas opciones disponibles para dos versiones y poder emitir advertencias. Por ejemplo, cambiar el tipo de valor de retorno de una función implicará casi invariablemente hacer un rompimiento de la API, lo que es frustrante para los usuarios y les dificulta el uso de Qiskit.
fr_fr: Changer le comportement sans retrait est particulièrement difficile à gérer, car nous avons besoin des deux options disponibles pour deux versions, et être en mesure d'émettre des avertissements. Par exemple, changer le type de la valeur de retour d'une fonction implique presque invariablement de faire une pause d'API, ce qui est frustrant pour les utilisateurs et rend difficile l'utilisation de Qiskit.
ja_jp: 2 つのバージョンで両方のオプションを利用可能にし、警告を発行できるようにする必要があるため、削除せずに動作を変更することは特に管理が困難です。 たとえば、関数からの戻り値の型を変更すると、ほとんどの場合、API が中断されます。これは、ユーザーにとってイライラし、Qiskit の使用を困難にします。
ko_kr: 제거하지 않고 작동 방식을 변경하는 것은 특히 관리하기 어려운데, 두 가지 버전에 대해 두 가지 옵션을 모두 사용할 수 있어야 하고 경고를 발행시켜야 하기 때문이다. 예를 들어, 함수에서 반환 값의 유형을 변경하는 것은 거의 예외 없이 API 중단을 동반하게 되며, 이는 사용자들이 Qiskit을 사용하기 어렵게 만들고 곤란함을 겪에 만든다.
pt_un: Alterar o comportamento sem uma remoção é particularmente difícil de gerenciar, porque precisamos ter as duas opções disponíveis por duas versões e poder emitir avisos. Por exemplo, alterar o tipo do valor de retorno de uma função quase invariavelmente envolve fazer uma quebra de API, o que é frustrante para os usuários e dificulta o uso do Qiskit.
ru_ru: Сложнее всего изменять поведение без удаления, так как при этом должны быть сразу два варианта для различных версий и соответствующие предупреждения. Например, изменение типа значения, возвращаемого функцией, почти всегда приводит к нарушению работы API, что раздражает пользователей и затрудняет использование Qiskit.
ta_in: அகற்றப்படாமல் நடத்தையை மாற்றுவது நிர்வகிப்பது மிகவும் கடினம், ஏனென்றால் இரண்டு பதிப்புகளுக்கு இரண்டு விருப்பங்களும் இருக்க வேண்டும், மேலும் எச்சரிக்கைகளை வழங்க முடியும். எடுத்துக்காட்டாக, ஒரு செயல்பாட்டிலிருந்து திரும்பும் மதிப்பின் வகையை மாற்றுவது ஏறக்குறைய ஒரு API இடைவேளையை உள்ளடக்கும், இது பயனர்களுக்கு வெறுப்பை ஏற்படுத்துகிறது மற்றும் அவர்கள் Qiskit ஐப் பயன்படுத்துவதை கடினமாக்குகிறது.
te_in: తీసివేయకుండా ప్రవర్తనను మార్చడం అనేది నిర్వహించడం చాలా కష్టం, ఎందుకంటే మనకు రెండు వెర్షన్‌ల కోసం రెండు ఎంపికలను అందుబాటులో ఉంచాలి మరియు హెచ్చరికలను జారీ చేయగలగాలి. ఉదాహరణకు, ఒక ఫంక్షన్ నుండి రిటర్న్ వాల్యూ యొక్క టైపు మార్చడం అనేది దాదాపుగా API బ్రేక్ చేయడంలో భాగంగా ఉంటుంది, ఇది వినియోగదారులకు నిరాశ కలిగిస్తుంది మరియు Qiskitని ఉపయోగించడం వారికి కష్టతరం చేస్తుంది.
tr_tr: Kaldırma olmadan davranışı değiştirmeyi yönetmek özellikle zordur, çünkü iki sürüm için her iki seçeneğe de sahip olmamız ve uyarılar verebilmemiz gerekir. Örneğin, bir fonksiyonun dönüş değerinin türünü değiştirmek, neredeyse her zaman, kullanıcılar için sinir bozucu olan ve Qiskit'i kullanmalarını zorlaştıran bir API kesintisi yapmayı içerecektir.
