Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/deprecation_policy.po
Languages: de_de, es_un, fr_fr, ja_jp, ko_kr, pt_un, ru_ru, ta_in, te_in, tr_tr

source: Deprecation Policy
de_de: Deprecation-Richtlinie
es_un: Política de Obsolescencia
fr_fr: Politique de dépréciation
ja_jp: 非推奨に関する方針
ko_kr: 지원 중단 정책
pt_un: Política de Descontinuação
ru_ru: Политика устаревания
ta_in: நிராகரிப்பு கொள்கை
te_in: నిరాకరణ విధానం
tr_tr: Kullanımdan Kaldırma Politikası

source: Many users and other packages depend on different parts of Qiskit. We must make sure that whenever we make changes to the code, we give users ample time to adjust without breaking code that they have already written.
de_de: Viele Benutzer und andere Pakete hängen von verschiedenen Teilen von Qiskit ab. Wir müssen daher sicherstellen, dass wir den Benutzern bei jeder Änderung des Codes ausreichend Zeit geben, notwendige Anpassungen durchzuführen, damit ihr bereits geschriebener Code weiter funktioniert.
es_un: Muchos usuarios y otros paquetes dependen de diferentes partes de Qiskit. Debemos asegurarnos de que cada vez que hagamos cambios en el código, demos a los usuarios tiempo suficiente para ajustarse sin romper el código que ya han escrito.
fr_fr: De nombreux utilisateurs et les autres paquets dépendent de différentes parties de Qiskit. Nous devons veiller à ce que chaque fois que nous apportons des modifications au code, nous donnons aux utilisateurs le temps d'ajuster sans casser le code qu'ils ont déjà écrit.
ja_jp: 多くのユーザーやその他のパッケージは、Qiskit のさまざまな部分に依存しています。 コードに変更を加えるときはいつでも、ユーザーがすでに作成したコードを壊すことなく調整するための十分な時間をユーザーに与えるようにする必要があります。
ko_kr: 많은 사용자 및 기타 패키지들은 Qiskit의 다른 부분에 의존한다. 따라서 코드를 변경할 때마다 사용자가 이미 작성한 코드를 손상시키지 않고 수정할 수 있는 충분한 시간을 제공해야 한다.
pt_un: Muitos usuários e outros pacotes dependem de diferentes partes do Qiskit. Devemos garantir que, sempre que fizermos alterações no código, daremos aos usuários tempo suficiente para ajustar sem quebrar o código que já escreveram.
ru_ru: Многие пользовательские и прочие пакеты зависят от разных компонентов Qiskit. Необходимо сделать так, чтобы при любом обновлении пользователям хватало времени для корректировки своего кода, не нарушая его работу полностью.
ta_in: பல பயனர்கள் மற்றும் பிற தொகுப்புகள் Qiskit இன் வெவ்வேறு பகுதிகளைச் சார்ந்துள்ளது. குறியீட்டில் மாற்றங்களைச் செய்யும்போதெல்லாம், பயனர்கள் ஏற்கனவே எழுதிய குறியீட்டை உடைக்காமல் சரிசெய்ய போதுமான நேரத்தை வழங்குகிறோம் என்பதை உறுதிசெய்ய வேண்டும்.
te_in: చాలా మంది వినియోగదారులు మరియు ఇతర ప్యాకేజీలు Qiskit యొక్క వివిధ భాగాలపై ఆధారపడి ఉంటాయి. మేము కోడ్‌లో మార్పులు చేసినప్పుడల్లా, వినియోగదారులు ఇప్పటికే వ్రాసిన కోడ్‌ను విచ్ఛిన్నం చేయకుండా సర్దుబాటు చేయడానికి మేము తగినంత సమయాన్ని అందిస్తాము.
tr_tr: Birçok kullanıcı ve diğer paketler, Qiskit'in farklı bölümlerine bağlımdır. Kodda her değişiklik yaptığımızda, kullanıcılara zaten yazdıkları kodu bozmadan ayarlamaları için yeterli zaman verdiğimizden emin olmalıyız.

source: Most importantly: *do not* change any interface that is public-facing unless we absolutely have to. Adding things is ok, taking things away is annoying for users but can be handled reasonably with plenty notice, but changing behavior generally means users cannot write code that will work with two subsequent versions of Qiskit, which is not acceptable.
de_de: Wichtig ist: Ändern Sie *keine* Schnittstelle, die öffentlich zugänglich ist, es sei denn, wir müssen es unbedingt tun. Hinzufügen ist in Ordnung, Dinge wegnehmen ist lästig für Benutzer, kann aber mit viel Vorsicht gehandhabt werden. Aber das Ändern des Verhaltens einer Schnittstelle bedeutet in der Regel, dass Benutzer keinen Code schreiben können, der mit zwei späteren Versionen von Qiskit funktioniert, was nicht akzeptabel ist.
es_un: Lo más importante: *no* cambies ninguna interfaz pública a menos que sea absolutamente necesario. Agregar cosas está bien, quitar cosas es molesto para los usuarios, pero se puede manejar razonablemente con mucha anticipación, pero cambiar el comportamiento generalmente significa que los usuarios no pueden escribir código que funcione con dos versiones posteriores de Qiskit, lo cual no es aceptable.
fr_fr: Plus important : *ne modifiez aucune* interface publique à moins que ce soit absolument nécéssaire. Ajouter des choses ne pose pas de problème, mais en enlever est ennuyeux pour les utilisateurs, mais peut être géré raisonnablement avec beaucoup de préavis, le changement de comportement signifie généralement que les utilisateurs ne peuvent pas écrire de code qui fonctionnera avec deux versions ultérieures de Qiskit, ce qui n'est pas acceptable.
ja_jp: 最も重要なことは、どうしても必要な場合を除いて、公開されているインターフェースを *変更しない* ことです。 物事を追加することは問題ありません。物事を取り除くことはユーザーにとって迷惑ですが、十分な注意を払って合理的に処理できます。動作を変更すると一般的に、ユーザーはQiskitの後続の2つのバージョンで動作するコードを記述できなくなり、これは受け入れられません。
ko_kr: 가장 중요한 것: 피할 수 없는 경우가 아니면 공개 인터페이스를 변경하지 *않는다*. 간단한 아이템을 추가하는 것은 괜찮지만, 아이템을 삭제하는 것은 사용자에게 번거로운 일이지만 충분히 공지하여 합리적으로 처리할 수 있다. 하지만 일반적으로 코드가 작동하는 방식을 변경하면 사용자가 두 가지 후속 버전의 Qiskit에서 작동하는 코드를 작성할 수 없으므로 허용되지 않는다.
pt_un: Mais importante: *não* altere nenhuma interface voltada para o público, a menos que seja absolutamente necessário. Adicionar coisas é bom, tirar coisas é irritante para os usuários, mas pode ser tratado razoavelmente com bastante antecedência, mas mudar o comportamento geralmente significa que os usuários não podem escrever código que funcionará com duas versões subsequentes do Qiskit, o que não é aceitável.
ru_ru: Самое важное: любой общедоступный интерфейс лучше *не менять*, если без этого можно обойтись. Добавление каких-то деталей воспринимается в целом нормально, их удаление обычно раздражает пользователей, хотя и может быть отчасти сбалансировано грамотными уведомлениями, однако нестабильное поведение означает, что пользовательский код не сможет корректно работать в соседних версиях Qiskit и это неприемлемо.
ta_in: மிக முக்கியமாக: பொது முகமாக இருக்கும் எந்த இடைமுகத்தையும் நாம் கண்டிப்பாக மாற்ற வேண்டியதில்லை. விஷயங்களைச் சேர்ப்பது பரவாயில்லை, பொருட்களை எடுத்துச் செல்வது பயனர்களுக்கு எரிச்சலூட்டும், ஆனால் பல அறிவிப்புகளுடன் நியாயமான முறையில் கையாளப்படலாம், ஆனால் நடத்தையை மாற்றுவது பொதுவாக Qiskit இன் இரண்டு அடுத்தடுத்த பதிப்புகளுடன் செயல்படும் குறியீட்டை எழுத முடியாது, இது ஏற்றுக்கொள்ள முடியாதது.
te_in: ముఖ్యమైనది: మనం ఖచ్చితంగా చేయవలసి వస్తే తప్ప పబ్లిక్ ఫేసింగ్ ఏ ఇంటర్‌ఫేస్‌ను మార్చవద్దు. వస్తువులను జోడించడం సరికాదు, వస్తువులను తీసివేయడం వినియోగదారులకు చికాకు కలిగించేది, కానీ చాలా నోటీసుతో సహేతుకంగా నిర్వహించవచ్చు, కానీ ప్రవర్తనను మార్చడం అంటే సాధారణంగా వినియోగదారులు Qiskit యొక్క రెండు తదుపరి వెర్షన్లతో పని చేసే కోడ్‌ను వ్రాయలేరు, ఇది ఆమోదయోగ్యం కాదు.
tr_tr: En önemlisi: Kesinlikle mecbur kalmadıkça halka açık herhangi bir arayüzü *değiştirmeyin*. Bir şeyler eklemek sorun değil, bir şeyleri çıkarmak kullanıcılar için can sıkıcıdır, ancak çok fazla uyarı ile makul bir şekilde ele alınabilir, ancak davranışı değiştirmek genellikle kullanıcıların Qiskit'in sonraki iki sürümüyle çalışacak kod yazamayacağı anlamına gelir ki bu kabul edilemez.

source: Beware that users will often be using functions, classes and methods that we, the Qiskit developers, may consider internal or not widely used. Do not make assumptions that "this is buried, so nobody will be using it"; if it is public, it is subject to the policy. The only exceptions here are functions and modules that are explicitly internal, *i.e.* those whose names begin with a leading underscore (``_``).
de_de: Beachten Sie, dass Benutzer häufig Funktionen, Klassen und Methoden verwenden werden, die wir, die Qiskit-Entwickler, als intern oder nicht weit verbreitet ansehen. Gehen Sie nicht davon aus, dass diese Funktionen etc so versteckt sind, dass sie niemand verwenden wird; wenn sie öffentlich sind, unterliegen sie den üblichen Regeln. Die einzigen Ausnahmen sind hier Funktionen und Module, die explizit intern sind, d. h. diejenigen, deren Namen mit einem führenden Unterstrich beginnen (``_``).
es_un: Ten en cuenta que los usuarios a menudo utilizarán funciones, clases y métodos que nosotros, los desarrolladores de Qiskit, podemos considerar internos o no muy utilizados. No hagas suposiciones de que "esto está enterrado, por lo que nadie lo usará"; si es público, está sujeto a la política. Las únicas excepciones aquí son funciones y módulos que son explícitamente internos, *es decir*, aquellos cuyos nombres comienzan con un guion bajo (``_``).
fr_fr: Soyez conscients du fait que les utilisateurs utiliseront souvent des fonctions, des classes et des méthodes que nous, les développeurs de Qiskit, pouvons considérer comme internes ou peu utilisées. Ne faites pas d'hypothèses selon lesquelles « ceci est enterré, donc personne ne l'utilisera » ; si un élément est public, il est soumis à la politique. Les seules exceptions ici sont les fonctions et les modules qui sont explicitement internes, *i.e.* ceux dont le nom commence par un underscore (``_``).
ja_jp: ユーザーは、Qiskit 開発者が内部または広く使用されていないと見なす関数、クラス、およびメソッドを使用することが多いことに注意してください。 「これは埋もれているので、誰も使用しないだろう」と思い込まないでください。 公開されている場合は、ポリシーに従います。 ここでの唯一の例外は、明示的に内部的な関数とモジュールです。つまり、名前の先頭がアンダースコア (_) で始まるものです。
ko_kr: 사용자들이 종종 Qiskit 코드 개발자들이 내부적이거나, 널리 사용되지 않는 기능이라 생각하는 클래스 및 메소드를 사용한다는 점에 주의한다. "이것은 잘 보이지 않으니 사용자가 없을 것이다"라고 가정하면 안된다. 코드나 함수가 공개된 경우는 모두 정책의 적용 대상이 된다. 유일한 예외는 명시적으로 내부에 있는 함수와 모듈로, *즉* 이름이 밑줄로 시작하는 것(``_``)들 이다.
pt_un: Esteja ciente de que os usuários frequentemente usarão funções, classes e métodos que nós, os desenvolvedores do Qiskit, podemos considerar internos ou não amplamente utilizados. Não faça suposições de que "isso está enterrado, então ninguém o usará"; se for público, está sujeito à política. As únicas exceções aqui são funções e módulos que são explicitamente internos, *ou seja,* aqueles cujos nomes começam com um sublinhado à esquerda (``_``).
ru_ru: Помните, что пользователи часто будут использовать функции, классы и методы, которые мы, разработчики Qiskit, можем считать внутренними или редко используемыми. Не делайте предположений об "ископаемом, которое никто не будет его использовать"; если что-то общедоступно, то на него распространяется эта же политика. Единственными исключениями будут функции и модули, которые точно являются внутренними, их названия начинаются с подчеркивания (``_``).
ta_in: பயனர்கள் பெரும்பாலும் செயல்பாடுகள், வகுப்புகள் மற்றும் முறைகளைப் பயன்படுத்துவார்கள் என்பதில் கவனமாக இருங்கள் "இது புதைக்கப்பட்டுள்ளது, எனவே யாரும் இதைப் பயன்படுத்த மாட்டார்கள்" என்று அனுமானங்களைச் செய்ய வேண்டாம்; பொது என்றால் அது கொள்கைக்கு உட்பட்டது. இங்குள்ள ஒரே விதிவிலக்குகள் செயல்பாடுகள் மற்றும் தொகுதிகள் வெளிப்படையாக உள், *அதாவது* முன்னணி அடிக்கோடிடுடன் தொடங்கும் பெயர்கள் (``_``).
te_in: Qiskit డెవలపర్‌లమైన మేము అంతర్గతంగా పరిగణించే లేదా విస్తృతంగా ఉపయోగించని ఫంక్షన్‌లు, క్లాస్లు మరియు పద్ధతులను వినియోగదారులు తరచుగా ఉపయోగిస్తున్నారని జాగ్రత్త వహించండి. "ఇది పాతిపెట్టబడింది, కాబట్టి ఎవరూ దీనిని ఉపయోగించరు" అని ఊహలు చేయవద్దు; అది పబ్లిక్ అయితే, అది విధానానికి లోబడి ఉంటుంది. ఇక్కడ మాత్రమే మినహాయింపులు స్పష్టంగా అంతర్గతంగా ఉండే ఫంక్షన్‌లు మరియు మాడ్యూల్‌లు, *అంటే* ప్రముఖ అండర్‌స్కోర్‌తో ప్రారంభమయ్యే పేర్లు (``_``).
tr_tr: Kullanıcıların, Qiskit geliştiricileri olarak bizlerin dahili veya yaygın olarak kullanılmadığını düşünebileceğimiz fonksiyonları, sınıfları ve metodları sık sık kullanıyor olacaklarına dikkat edin. "Bu gömülü, yani kimse kullanmayacak" gibi varsayımlarda bulunmayın; halka açıksa, bu politikaya tabidir. Buradaki tek istisna, açıkça dahili olan fonksiyonlar ve modüllerdir, *yani* adları önde bir alt çizgi (``_``) ile başlayanlar.

source: The guiding principles are:
de_de: Die Leitprinzipien sind:
es_un: Los principios rectores son:
fr_fr: Les principes directeurs sont les suivants:
ja_jp: 指針は次のとおりです。
ko_kr: 지침은 다음과 같다.
pt_un: Os princípios orientadores são:
ru_ru: Основными принципами являются:
ta_in: வழிகாட்டும் கொள்கைகள்:
te_in: మార్గదర్శక సూత్రములు:
tr_tr: Yol gösterici prensipler şunlardır:

source: we must not remove or change code without active warnings for least three months or two complete version cycles;
de_de: wir dürfen mindestens drei Monate oder zwei vollständige Versionszyklen lang keinen Code ohne aktive Warnungen entfernen oder ändern;
es_un: no debemos eliminar ni cambiar el código sin advertencias activas durante al menos tres meses o dos ciclos de versión completos;
fr_fr: nous ne devons pas supprimer ou modifier le code sans avertissement actif pendant au moins trois mois ou deux cycles de version complets ;
ja_jp: 少なくとも3か月または2つの完全なバージョンサイクルの間、有効な警告なしにコードを削除または変更してはなりません。
ko_kr: 최소 3개월 또는 2회의 완전한 버전 주기 동안 적극적으로 경고한 후 코드를 제거하거나 변경한다.
pt_un: não devemos remover ou alterar o código sem avisos ativos por pelo menos três meses ou dois ciclos completos de versão;
ru_ru: мы не должны удалять или изменять код без активных предупреждений в течение трех месяцев или двух полных версий;
ta_in: குறைந்தது மூன்று மாதங்கள் அல்லது இரண்டு முழுமையான பதிப்பு சுழற்சிகளுக்குச் செயலில் உள்ள எச்சரிக்கைகள் இல்லாமல் குறியீட்டை அகற்றவோ மாற்றவோ கூடாது;
te_in: కనీసం మూడు నెలలు లేదా రెండు పూర్తి వెర్షన్ సైకిల్స్ వరకు క్రియాశీల హెచ్చరికలు లేకుండా కోడ్‌ను తీసివేయకూడదు లేదా మార్చకూడదు;
tr_tr: en az üç ay veya iki tam sürüm döngüsü boyunca etkin uyarılar olmadan kodu kaldırmamalı veya değiştirmemeliyiz;

source: there must always be a way to achieve valid goals that does not issue any warnings;
de_de: es muss immer eine Möglichkeit geben, gültige Ziele zu erreichen, die keine Warnungen auslösen;
es_un: siempre debe haber una forma de lograr objetivos válidos que no emita advertencias;
fr_fr: il doit toujours y avoir un moyen d'atteindre des objectifs valables qui n'émettent aucun avertissement;
ja_jp: 警告を出さない有効な目標を達成する方法が常になければなりません。
ko_kr: 경고를 발생시키지 않고 원하는 기능을 구현하기 위한 방법을 항상 마련되어야 한다.
pt_un: deve haver sempre uma maneira de atingir metas válidas que não emita nenhum aviso;
ru_ru: всегда должен существовать способ добиться нужного результата без всплывающих предупреждений;
ta_in: எந்த எச்சரிக்கையையும் வெளியிடாத சரியான இலக்குகளை அடைய எப்போதும் ஒரு வழி இருக்க வேண்டும்;
te_in: ఎటువంటి హెచ్చరికలను జారీ చేయని సరైన లక్ష్యాలను సాధించడానికి ఎల్లప్పుడూ ఒక మార్గం ఉండాలి;
tr_tr: her zaman herhangi bir uyarı vermeyen geçerli hedeflere ulaşmanın bir yolu olmalıdır;

source: never assume that a function that isn't explicitly internal isn't in use;
de_de: gehen Sie nicht davon aus, dass eine Funktion, die nicht ausdrücklich intern ist, nicht verwendet wird;
es_un: nunca asumas que una función que no es explícitamente interna no está en uso;
fr_fr: ne suppose jamais qu'une fonction qui n'est pas explicitement interne n'est pas utilisée ;
ja_jp: 明示的に内部に存在しない関数が使用されていないと思い込まないでください。
ko_kr: 명시적으로 내부적이지 않은 함수들도 사용되고 있을 수 있음을 가정한다.
pt_un: nunca assuma que uma função que não é explicitamente interna não está em uso;
ru_ru: не стоит думать, что функция, которая не является очевидно внутренней, не будет использована;
ta_in: வெளிப்படையாக உள்நாட்டில் இல்லாத ஒரு செயல்பாடு பயன்பாட்டில் இல்லை என்று ஒருபோதும் கருத வேண்டாம்;
te_in: స్పష్టంగా అంతర్గతంగా లేని ఫంక్షన్ ఉపయోగంలో లేదని ఎప్పుడూ అనుకోకండి;
tr_tr: açıkça iç işlev görmeyen bir fonksiyonuın kullanımda olmadığını asla varsaymayın;

source: all deprecations, changes and removals are considered API changes, and can only occur in minor releases not patch releases, per the :ref:`stable branch policy <stable_branch_policy>`.
de_de: alle Abkündigungen, Änderungen und Entfernungen werden als API-Änderungen betrachtet und können nur in untergeordneten Versionen, nicht in Patch-Versionen auftreten, gemäß der :ref:` stable branch policy <stable_branch_policy>`.
es_un: todas las obsolescencias, cambios y eliminaciones se consideran cambios de API y solo pueden ocurrir en versiones menores, no en versiones de parches, según la :ref:`política de rama estable <stable_branch_policy>`.
fr_fr: toutes les dépréciations, les changements et les suppressions sont considérés comme des changements de l'API et ne peuvent se produire que dans des versions mineures et non des versions de correctifs, par :ref:` politique de branche stable <stable_branch_policy>`.
ja_jp: すべての非推奨、変更、および削除は API の変更と見なされ、 :ref:`安定版ブランチポリシー <stable_branch_policy>` に従って、パッチ リリースではなくマイナー リリースでのみ発生する可能性があります。
ko_kr: 모든 사용 중단, 변경 및 제거는 API 변경으로 간주되며 :ref:`안정적인 브랜치 정책 <stable_branch_policy>` 에 따라 패치 릴리스가 아닌 마이너 릴리스에서만 발생할 수 있다.
pt_un: todas as reprovações, alterações e remoções são consideradas alterações de API e só podem ocorrer em versões secundárias, não em versões de patch, de acordo com a :ref:`política de ramificação estável <stable_branch_policy>`.
ru_ru: все устаревания, изменения и удаления считаются изменениями API, и может произойти только в небольших релизах, а не в патчах, в соответствии со :ref:`stable branch policy <stable_branch_policy>`.
ta_in: அனைத்து நீக்குதல்கள், மாற்றங்கள் மற்றும் அகற்றுதல்கள் API மாற்றங்களாகக் கருதப்படுகின்றன, மேலும் சிறு வெளியீடுகளில் மட்டுமே நிகழலாம், பேட்ச் வெளியீடுகள் அல்ல, :ref:`stable கிளைக் கொள்கை <stable_branch_policy>`.
te_in: అన్ని నిరాకరణలు, మార్పులు మరియు తీసివేతలు API మార్పులుగా పరిగణించబడతాయి మరియు :ref:`స్టేబిల్ బ్రాంచ్ విధానం <stable_branch_policy>` ప్రకారం ప్యాచ్ విడుదలలు కాకుండా చిన్న విడుదలలలో మాత్రమే సంభవించవచ్చు.
tr_tr: tüm kullanımdan kaldırmalar, değişiklikler ve kaldırmalar API değişiklikleri olarak kabul edilir ve :ref:`kararlı dal politikası <stable_branch_policy>` uyarınca yalnızca küçük sürümlerde gerçekleşebilir, yama sürümlerinde değil.

source: Removing a feature
de_de: Eine Funktion entfernen
es_un: Eliminación de una característica
fr_fr: Suppression d'une fonctionnalité
ja_jp: 機能の削除
ko_kr: 기능의 제거
pt_un: Removendo um recurso
ru_ru: Удаление элемента
ta_in: ஒரு அம்சத்தை நீக்குகிறது
te_in: లక్షణాన్ని తీసివేయడం
tr_tr: Özelliğin kaldırılması

source: When removing a feature (for example a class, function or function parameter), we will follow this procedure:
de_de: Beim Entfernen einer Funktion (z. B. einer Klasse, einer Funktion oder eines Funktionsparameters) folgen wir dieser Prozedur:
es_un: Al eliminar una característica (por ejemplo, una clase, función o parámetro de función), seguiremos este procedimiento:
fr_fr: Lors de la suppression d'une fonctionnalité (par exemple une classe, une fonction ou un paramètre de fonction), nous suivrons cette procédure :
ja_jp: 機能 (クラス、関数、関数パラメーターなど) を削除する場合は、次の手順に従います。
ko_kr: 기능(예: 클래스, 함수 또는 함수 매개변수) 을 제거할 때에는 다음의 절차를 따른다.
pt_un: Ao remover um recurso (por exemplo, uma classe, função ou parâmetro de função), seguiremos este procedimento:
ru_ru: При удалении какой-либо части (например, класса, функции или ее параметр) выполните следующие действия:
ta_in: ஒரு அம்சத்தை அகற்றும்போது (உதாரணமாக ஒரு வகுப்பு, செயல்பாடு அல்லது செயல்பாட்டு அளவுரு), நாங்கள் இந்த நடைமுறையைப் பின்பற்றுவோம்:
te_in: లక్షణాన్ని తీసివేసేటప్పుడు (ఉదాహరణకు క్లాస్, ఫంక్షన్ లేదా ఫంక్షన్ పరామితి), మేము ఈ విధానాన్ని అనుసరిస్తాము:
tr_tr: Bir özelliği (örneğin bir sınıf, fonksiyon veya fonksiyon parametresi) kaldırırken şu prosedürü izleyeceğiz:

source: The alternative path must be in place for one minor version before any warnings are issued. For example, if we want to replace the function ``foo()`` with ``bar()``, we must make at least one release with both functions before issuing any warnings within ``foo()``. You may issue ``PendingDeprecationWarning``\ s from the old paths immediately.
de_de: Der alternative Pfad muss für eine untergeordnetete Version vorhanden sein, bevor Warnungen ausgegeben werden. Zum Beispiel, wenn wir die Funktion ``foo()`` durch ``bar()`` ersetzen wollen, müssen wir mindestens eine Version mit beiden Funktionen veröffentlichen, bevor wir in ``foo()`` Warnungen ausgeben. Du kannst ``PendingDeprecationWarning``\ s von den alten Pfaden auch sofort anzeigen lassen.
es_un: La ruta alternativa debe estar en su lugar para una versión secundaria antes de que se emitan advertencias. Por ejemplo, si queremos reemplazar la función ``foo()`` con ``bar()``, debemos hacer al menos una liberación con ambas funciones antes de emitir cualquier advertencia dentro de ``foo()``. Puedes emitir ``PendingDeprecationWarning``\ s desde las rutas inmediatamente anteriores.
fr_fr: Le chemin alternatif doit être en place pour une version mineure avant que des avertissements ne soient émis. Par exemple, si nous voulons remplacer la fonction ``foo()`` par la fonction ``bar()``, nous devons faire au moins une version avec les deux fonctions avant d'émettre des avertissements dans ``foo()``. Vous pouvez émettre des ``PendingDeprecationWarning`` dans les anciens chemins immédiatement.
ja_jp: 警告が発行される前に、1 つのマイナー バージョンに対して代替パスを設定する必要があります。 たとえば、関数 ``foo()`` を ``bar()`` に置き換えたい場合、 ``foo()`` 内で警告を発行する前に、両方の関数を少なくとも 1 回リリースする必要があります。 古いパスからすぐに ``PendingDeprecationWarning`` を発行できます。
ko_kr: 경고를 이슈로 발행하기 전에 하나의 마이너 버전에 대한 대체 경로가 있어야 한다 . 예를 들어, ``foo()`` 함수를 ``bar()`` 로 교체하려면 ``foo()`` 내에서 경고를 발생시키기 전에 두 함수 모두를 사용하여 최소한 한 번 릴리스해야 한다. 이전 브랜치에서 즉시 ``PendingDeprecationWarning``\ 을 실행시킨다.
pt_un: O caminho alternativo deve estar em vigor para uma versão secundária antes que qualquer aviso seja emitido. Por exemplo, se quisermos substituir a função ``foo()`` por ``bar()``, devemos fazer pelo menos um lançamento com ambas as funções antes de emitir qualquer aviso dentro de ``foo()``. Você pode emitir ``PendingDeprecationWarning``\ s dos caminhos antigos imediatamente.
ru_ru: Альтернативный способ должен появиться как минимум в одной младшей версии еще до добавления каких-либо предупреждений. Например, при замене функции ``foo()`` на ``bar()`` нужно сделать хотя бы один релиз с обеими функциями без предупреждений для ``foo()``. Вы можете сразу отметить ``PendingDeprecationWarning`` для старого пути.
ta_in: ஏதேனும் எச்சரிக்கைகள் வழங்கப்படுவதற்கு முன், ஒரு சிறிய பதிப்பிற்கான மாற்று பாதை இருக்க வேண்டும். எடுத்துக்காட்டாக, ``foo()`` செயல்பாட்டை ``bar()`` உடன் மாற்ற விரும்பினால், ``foo()`` க்குள் ஏதேனும் எச்சரிக்கைகளை வழங்குவதற்கு முன், இரண்டு செயல்பாடுகளுடன் குறைந்தபட்சம் ஒரு வெளியீட்டையாவது செய்ய வேண்டும். பழைய பாதைகளில் இருந்து ``நிலுவையில் உள்ள தேய்மான எச்சரிக்கை```களை உடனடியாக வழங்கலாம்.
te_in: ఏదైనా హెచ్చరికలు జారీ చేయబడే ముందు ఒక చిన్న వెర్షన్ కోసం ప్రత్యామ్నాయ మార్గం తప్పనిసరిగా ఉండాలి. ఉదాహరణకు, మనం ``foo()`` ఫంక్షన్‌ని ``bar()``తో భర్తీ చేయాలనుకుంటే, ``foo()``లో ఏవైనా హెచ్చరికలను జారీ చేయడానికి ముందు మనం తప్పనిసరిగా రెండు ఫంక్షన్‌లతో కనీసం ఒక విడుదల చేయాలి. మీరు వెంటనే పాత మార్గాల నుండి ``PendingDeprecationWarning``\ లను జారీ చేయవచ్చు.
tr_tr: Herhangi bir uyarı verilmeden önce bir alt sürüm için alternatif yol mevcut olmalıdır. Örneğin, ``foo()`` fonksiyonunu ``bar()`` ile değiştirmek istiyorsak, ``foo()`` içinde herhangi bir uyarı vermeden önce her iki işlevle en az bir sürüm yapmalıyız. Eski yollardan hemen ``PendingDeprecationWarning``\ ler verebilirsiniz.

source: *Reason*: we need to give people time to swap over without breaking their code as soon as they upgrade.
de_de: *Grund*: Wir müssen den Benutzern Zeit zum Anpassen geben, ohne ihren Code unbrauchbar zu machen, sobald sie aktualisieren.
es_un: *Motivo*: necesitamos darles a las personas tiempo para cambiar sin romper su código tan pronto como actualicen.
fr_fr: *Raison* : nous devons donner aux utilisateurs le temps d'adapter leur code pour le mettre à jour facilement lors des mise à niveau.
ja_jp: *理由* : アップグレードしたらすぐに、コードを壊さずにスワップする時間を与える必要があります。
ko_kr: *이유*: 사용자들에게 버젼이 업그레이드된 직 후, 코드를 훼손하지 않고 교체할 시간을 줄 필요가 있다.
pt_un: *Razão*: precisamos dar às pessoas tempo para trocar sem quebrar o código assim que atualizarem.
ru_ru: *Причина*: нужно дать пользователям время для замены, не нарушая их код сразу же после обновления.
ta_in: *காரணம்*: மக்கள் மேம்படுத்தியவுடன் அவர்களின் குறியீட்டை உடைக்காமல் மாற்றிக்கொள்ள அவர்களுக்கு நேரம் கொடுக்க வேண்டும்.
te_in: *కారణం*: వ్యక్తులు అప్‌గ్రేడ్ చేసిన వెంటనే వారి కోడ్‌ను విచ్ఛిన్నం చేయకుండా మార్పిడి చేసుకోవడానికి వారికి సమయం ఇవ్వాలి.
tr_tr: *Sebep*: İnsanlara yükseltme yaptıkları anda kodlarını bozmadan geçiş yapmaları için zaman vermemiz gerekiyor.
