Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/deprecation_policy.po
Languages: de_de, es_un, fr_fr, ja_jp, ko_kr, pt_un, ru_ru, ta_in, te_in, tr_tr

source: The best solution here is often to make a new function, and then use :ref:`the procedures for removal <removing-features>` above.
de_de: Die beste Lösung ist hier oftmals, eine neue Funktion zu erstellen und dann :ref:`die Prozeduren für das Entfernen von Funktionen <removing-features>` zu verwenden.
es_un: La mejor solución aquí es a menudo hacer una nueva función y luego usar :ref:`los procedimientos para la eliminación <removing-features>` anteriores.
fr_fr: La meilleure solution ici est souvent de faire une nouvelle fonction, puis d'utiliser :ref:` les procédures de retrait <removing-features>` ci-dessus.
ja_jp: ここでの最善の解決策は、多くの場合、新しい関数を作成してから、上記の :ref:`削除手順 <removing-features>` を使用することです。
ko_kr: 가장 좋은 해결책은 종종 새로운 기능을 만든 다음 위의 :ref:`the procedures for removal <removing-features>` 를 따르는 것이다.
pt_un: A melhor solução aqui é criar uma nova função e então usar :ref:`os procedimentos para remoção <removing-features>` acima.
ru_ru: Наилучшим решением будет создание нового элемента и последующее :ref:`удаление <removing-features>` старого, описанное выше.
ta_in: இங்கே சிறந்த தீர்வாகப் பெரும்பாலும் ஒரு புதிய செயல்பாட்டை உருவாக்கி, பின்னர் :ref: மேலே உள்ள <removing-features>` அகற்றுவதற்கான நடைமுறைகளைப் பயன்படுத்தவும்.
te_in: ఇక్కడ ఉత్తమ పరిష్కారం కొత్త ఫంక్షన్‌ని తయారు చేయుట, ఆపై పైన ఉన్న తీసివేయడానికి విధానాలు` :ref:` <removing-features>ను ఉపయోగించడం.
tr_tr: Buradaki en iyi çözüm genellikle yeni bir fonksiyon oluşturmak ve ardından yukarıdaki :ref:`kaldırma prosedürlerini <removing-features>` kullanmaktır.

source: If you absolutely must change the behavior of existing code (other than fixing bugs), you will need to use your best judgment to apply the guiding principles at the top of this document. The most appropriate warning for behavioral changes is usually ``FutureWarning``. Some possibilities for how to effect a change:
de_de: Wenn Sie unbedingt das Verhalten von existierendem Code ändern müssen (abgesehen von der Beseitigung von Fehlern), müssen Sie nach bestem Wissen und Gewissen vorgehen, um die Richtlinien vom Anfang dieses Dokuments anzuwenden. Die am besten geeignete Warnung für Veränderungen der Funktionsweise ist normalerweise ``FutureWarning``. Einige Möglichkeiten, wie man eine Änderung durchführen kann:
es_un: Si es absolutamente necesario cambiar el comportamiento del código existente (aparte de corregir errores), deberás usar tu mejor criterio para aplicar los principios rectores que se encuentran en la parte superior de este documento. La advertencia más adecuada para los cambios de comportamiento suele ser ``FutureWarning``. Algunas posibilidades de cómo efectuar un cambio:
fr_fr: Si vous devez absolument changer le comportement du code existant (autre que la correction des bogues), vous devrez utiliser votre meilleur jugement pour appliquer les principes directeurs en haut de ce document. L'avertissement le plus approprié pour les changements de comportement est généralement ``FutureWarning``. Quelques possibilités pour effectuer un changement:
ja_jp: 既存のコードの動作を絶対に変更する必要がある場合 (バグの修正以外) は、このドキュメントの上部にある指針を適用するために最善の判断を下す必要があります。 通常、動作の変化に対する最も適切な警告は ``FutureWarning`` です。 変更を行う方法のいくつかの可能性:
ko_kr: 기존 코드의 동작을 절대적으로 변경해야 하는 경우(버그 수정 제외) 이 문서의 맨 위에 있는 지침 원칙을 적용하기 위해 최선의 판단을 내려야 한다. 작동 방식의 변화에 대한 가장 적절한 경고는 일반적으로 ``FutureWarning`` 이다. 변경을 적용하는 방법에 대한 몇 가지 가능성은 다음과 같다:
pt_un: Se for absolutamente necessário alterar o comportamento do código existente (além de corrigir bugs), você precisará usar seu bom senso para aplicar os princípios orientadores no início deste documento. O aviso mais apropriado para mudanças de comportamento geralmente é ``FutureWarning``. Algumas possibilidades de como efetuar uma mudança:
ru_ru: Если же необходимо именно изменить поведение существующего кода (и речь не об исправлении ошибок), нужно обязательно следовать приницпам, упомянутым в самом начале документа. Наиболее подходящим предупреждением для этого обычно является ``FutureWarning``. Изменения можно сделать так:
ta_in: ஏற்கனவே உள்ள குறியீட்டின் நடத்தையை நீங்கள் முற்றிலும் மாற்ற வேண்டும் என்றால் (பிழைகளை சரிசெய்வதைத் தவிர), இந்த ஆவணத்தின் மேலே உள்ள வழிகாட்டும் கொள்கைகளைப் பயன்படுத்த உங்கள் சிறந்த தீர்ப்பைப் பயன்படுத்த வேண்டும். நடத்தை மாற்றங்களுக்கு மிகவும் பொருத்தமான எச்சரிக்கை பொதுவாக ``FutureWarning`` ஆகும். மாற்றத்தை எவ்வாறு செயல்படுத்துவது என்பதற்கான சில சாத்தியங்கள்:
te_in: మీరు ఇప్పటికే ఉన్న కోడ్ యొక్క ప్రవర్తనను ఖచ్చితంగా మార్చవలసి వస్తే (బగ్‌లను పరిష్కరించడం కాకుండా), ఈ పత్రం ఎగువన ఉన్న మార్గదర్శక సూత్రాలను వర్తింపజేయడానికి మీరు మీ ఉత్తమ తీర్పును ఉపయోగించాల్సి ఉంటుంది. సాధారణంగా ప్రవర్తనా మార్పులకు అత్యంత సముచితమైన హెచ్చరిక ``FutureWarning``. మార్పును ఎలా ప్రభావితం చేయాలో కొన్ని అవకాశాలు:
tr_tr: Mevcut kodun davranışını (hataları düzeltmek dışında) kesinlikle değiştirmeniz gerekiyorsa, bu belgenin başındaki yol gösterici ilkeleri uygulamak için sağduyunuzu kullanmanız gerekecektir. Davranış değişiklikleri için en uygun uyarı genellikle ``FutureWarning``dir. Bir değişikliğin nasıl gerçekleştirileceğine ilişkin bazı olasılıklar:

source: If you are changing the default behavior of a function, consider adding a keyword argument to select between old and new behaviors. When it comes time, you can issue a ``FutureWarning`` if the keyword argument is not given (*e.g.* if it is ``None``), saying that the new value will soon become the default. You will need to go through the normal deprecation period for removing this keyword argument after you have made the behavior change. This will take at least six months to go through both cycles.
de_de: Wenn Sie das Standardverhalten einer Funktion ändern, sollten Sie ein Keyword-Argument hinzufügen, um zwischen altem und neuem Verhalten zu wählen. Beim Aufruf der Funktion kann eine ``FutureWarning`` ausgegeben, werden, wenn das Keyword-Argument nicht angegeben wird (z.B. wenn es ``None`` ist) mit dem Hinweis, dass der neue Wert bald zur Standardeinstellung wird. Sie müssen die normale Deprecation Periode durchlaufen, um das Keyword-Argument zu entfernen, nachdem Sie die Änderung der Funktionsweise vorgenommen haben. Dies wird mindestens sechs Monate dauern, bis beide Zyklen durchlaufen sind.
es_un: Si estás cambiando el comportamiento predeterminado de una función, considera agregar un argumento de palabra clave para seleccionar entre comportamientos antiguos y nuevos. Cuando llegue el momento, puedes emitir una ``FutureWarning`` si no se proporciona el argumento de palabra clave (*por ejemplo* si es ``None``), diciendo que el nuevo valor pronto se convertirá en el valor predeterminado. Deberás pasar por el período normal de desuso para eliminar este argumento de palabra clave después de haber realizado el cambio de comportamiento. Esto llevará al menos seis meses para pasar por ambos ciclos.
fr_fr: Si vous modifiez le comportement par défaut d'une fonction, pensez à ajouter un argument de mot clé pour sélectionner entre les anciens et les nouveaux comportements. Quand vient le temps, vous pouvez émettre un ``FutureWarning`` si l'argument du mot clé n'est pas donné (*c'est à dire* s'il est à ``None``), en disant que la nouvelle valeur deviendra bientôt la valeur par défaut. Vous devrez passer par la période d'obsolescence normale pour supprimer cet argument de mot clé une fois que vous avez effectué le changement de comportement. Cela prendra au moins six mois pour traverser les deux cycles.
ja_jp: 関数のデフォルトの動作を変更する場合は、キーワード引数を追加して、古い動作と新しい動作を選択することを検討してください。 時が来たら、キーワード引数が指定されていない場合 (たとえば、 ``None`` の場合)、新しい値がすぐにデフォルトになることを示す ``FutureWarning`` を発行できます。 動作を変更した後、このキーワード引数を削除するには、通常の非推奨期間を経過する必要があります。 これには、両方のサイクルを完了するのに少なくとも 6 か月かかります。
ko_kr: 함수의 기본 동작을 변경하는 경우 키워드 인수를 추가하여 이전 동작과 새 동작 중에서 선택하는 것이 좋다. 배포할 시기가 다가왔을 때, 키워드 인수가 지정되지 않은 경우(*예:* ``None`` 인 경우) ``FutureWarning`` 을 발행하여 새 값이 곧 기본값이 되도록 설정할 수 있다. 동작을 변경한 후 이 키워드 인수를 제거하려면 일반적인 사용 중단 기간을 거쳐야 한다. 두 주기를 모두 거치는 데 최소 6개월이 소요된다.
pt_un: Se você estiver alterando o comportamento padrão de uma função, considere adicionar um argumento de palavra-chave para selecionar entre comportamentos novos e antigos. Quando chegar a hora, você pode emitir um ``FutureWarning`` se o argumento da palavra-chave não for fornecido (*por exemplo* se for ``None``), dizendo que o novo valor logo se tornará o padrão. Você precisará passar pelo período de descontinuação normal para remover esse argumento de palavra-chave depois de fazer a alteração de comportamento. Isso levará pelo menos seis meses para passar por ambos os ciclos.
ru_ru: Если вы меняете поведение функции по умолчанию, попробуйте добавить именованный аргумент для выбора между старым и новым поведением. В нужный момент добавляете ``FutureWarning`` при отсутствии значения аргумента (или ``None``) с упоминанием того, что новое значение скоро станет значением по умолчанию. После изменения поведения запускается обычный цикл устаревания для удаления этого аргумента. Это потребует минимум шесть месяцев на оба цикла.
ta_in: செயல்பாட்டின் இயல்புநிலை நடத்தையை நீங்கள் மாற்றினால், பழைய மற்றும் புதிய நடத்தைகளுக்கு இடையே தேர்ந்தெடுக்க ஒரு முக்கிய வாதத்தைச் சேர்ப்பதைக் கவனியுங்கள். நேரம் வரும்போது, புதிய மதிப்பு விரைவில் இயல்புநிலையாக மாறும் என்று கூறி, முக்கிய வாதம் வழங்கப்படாவிட்டால் (*எ.கா.* அது ``None``) எனில், நீங்கள் ``FutureWarning`` வழங்கலாம். நீங்கள் நடத்தை மாற்றத்தை செய்த பிறகு, இந்த முக்கிய வார்த்தை வாதத்தை அகற்ற, நீங்கள் சாதாரண தேய்மான காலத்தை கடக்க வேண்டும். இரண்டு சுழற்சிகளையும் கடந்து செல்ல குறைந்தது ஆறு மாதங்கள் ஆகும்.
te_in: మీరు ఫంక్షన్ యొక్క డిఫాల్ట్ ప్రవర్తనను మారుస్తుంటే, పాత మరియు కొత్త ప్రవర్తనల మధ్య ఎంచుకోవడానికి కీవర్డ్ ఆర్గ్యుమెంట్‌ని జోడించడాన్ని పరిగణించండి. సమయం వచ్చినప్పుడు, మీరు కీవర్డ్ ఆర్గ్యుమెంట్ ఇవ్వకపోతే ``FutureWarning``ని జారీ చేయవచ్చు (*ఉదా.* అది ``None`` అయితే), కొత్త విలువ త్వరలో డిఫాల్ట్ అవుతుంది. మీరు ప్రవర్తనను మార్చిన తర్వాత ఈ కీవర్డ్ ఆర్గ్యుమెంట్‌ని తీసివేయడానికి మీరు సాధారణ డిప్రికేషన్ వ్యవధిని గడపవలసి ఉంటుంది. ఇది రెండు చక్రాల ద్వారా వెళ్ళడానికి కనీసం ఆరు నెలలు పడుతుంది.
tr_tr: Bir fonksiyonun varsayılan davranışını değiştiriyorsanız, eski ve yeni davranışlar arasında seçim yapmak için bir anahtar sözcük bağımsız değişkeni eklemeyi düşünün. Zamanı geldiğinde, anahtar sözcük bağımsız değişkeni verilmezse (*örn.* ``None`` ise), yeni değerin yakında varsayılan olacağını söyleyerek bir ``FutureWarning`` yayınlayabilirsiniz. Davranış değişikliğini yaptıktan sonra bu anahtar sözcük argümanını kaldırmak için normal kullanımdan kaldırma sürecinden geçmeniz gerekecek. Bu, her iki döngüden geçmek için en az altı ay sürecektir.

source: If you need to change the return type of a function, consider adding a new function that returns the new type, and then follow the procedures for deprecating the old function.
de_de: Wenn Sie den Rückgabetyp einer Funktion ändern möchten, sollten Sie eine neue Funktion hinzufügen, die den neuen Typ zurückgibt, und folgen Sie dann den Prozeduren für das Entfernen der alten Funktion.
es_un: Si necesitas cambiar el tipo de devolución de una función, considera agregar una nueva función que devuelva el nuevo tipo y luego sigue los procedimientos para obsoletar la función anterior.
fr_fr: Si vous devez modifier le type de retour d'une fonction, envisagez d'ajouter une nouvelle fonction qui renvoie le nouveau type, puis suivez les procédures d'obsolescence de l'ancienne fonction.
ja_jp: 関数の戻り値の型を変更する必要がある場合は、新しい型を返す新しい関数を追加することを検討してから、古い関数を非推奨にする手順に従ってください。
ko_kr: 함수의 반환 유형을 변경해야 하는 경우 새 유형을 반환하는 새 함수를 추가한 다음 이전 함수 사용 중단 절차를 따른다.
pt_un: Se você precisar alterar o tipo de retorno de uma função, considere adicionar uma nova função que retorne o novo tipo e siga os procedimentos para substituir a função antiga.
ru_ru: Если нужно изменить тип, который возвращает функция, добавьте новую функцию, возвращающую новый тип, а затем следуйте алгоритму устаревания для старой функции.
ta_in: நீங்கள் செயல்பாட்டின் திரும்பும் வகையை மாற்ற வேண்டும் என்றால், புதிய வகையை வழங்கும் புதிய செயல்பாட்டைச் சேர்ப்பதைக் கருத்தில் கொள்ளவும், பின்னர் பழைய செயல்பாட்டை நிறுத்துவதற்கான நடைமுறைகளைப் பின்பற்றவும்.
te_in: మీరు ఫంక్షన్ యొక్క రిటర్న్ రకాన్ని మార్చాలనుకుంటే, కొత్త రకాన్ని తిరిగి ఇచ్చే కొత్త ఫంక్షన్‌ను జోడించడాన్ని పరిగణించండి, ఆపై పాత ఫంక్షన్‌ను తీసివేయడానికి విధానాలను అనుసరించండి.
tr_tr: Bir fonksiyonun döndürme türünü değiştirmeniz gerekirse, yeni türü döndüren yeni bir fonksiyon eklemeyi düşünün ve ardından eski fonksiyonu kullanımdan kaldırma prosedürlerini izleyin.

source: If you need to accept a new input that you cannot distinguish from an existing possibility because of its type, consider letting it be passed by a different keyword argument, or add a second function that only accepts the new form.
de_de: Wenn Sie eine neue Eingabe akzeptieren müssen, die Sie wegen ihres Typs nicht von einer bestehenden Möglichkeit unterscheiden können, sollten Sie die Eingabe durch ein anderes Keyword-Argument erwägen oder eine zweite Funktion hinzuzufügen, die nur das neue Formular akzeptiert.
es_un: Si necesitas aceptar una nueva entrada que no puedes distinguir de una posibilidad existente debido a su tipo, considera dejar que se pase por un argumento de palabra clave diferente o agrega una segunda función que solo acepte la nueva forma.
fr_fr: Si vous devez accepter une nouvelle entrée que vous ne pouvez pas distinguer d'une possibilité existante en raison de son type, pensez à le laisser passer par un autre argument de mot clé ou à ajouter une seconde fonction qui n'accepte que le nouveau formulaire.
ja_jp: タイプが原因で既存の可能性と区別できない新しい入力を受け入れる必要がある場合は、別のキーワード引数で渡すことを検討するか、新しい形式のみを受け入れる 2 番目の関数を追加します。
ko_kr: 유형 때문에 이미 존재할 확률이 있는 입력과 구별할 수 없는 새 입력을 받아 들여야 하는 경우 다른 키워드 인수로 전달되도록 하거나 새 형식만 수락하는 두 번째 함수를 추가한다.
pt_un: Se você precisar aceitar uma nova entrada que não pode distinguir de uma possibilidade existente por causa de seu tipo, considere deixá-la ser passada por um argumento de palavra-chave diferente ou adicione uma segunda função que aceite apenas a nova forma.
ru_ru: Если вам нужно добавить входные данные того же типа, что и уже имеющиеся, попробуйте создать дополнительный именованный аргумент или функцию для новых данных.
ta_in: புதிய உள்ளீட்டை அதன் வகையின் காரணமாக வேறுபடுத்திப் பார்க்க முடியாத ஒரு புதிய உள்ளீட்டை நீங்கள் ஏற்க வேண்டும் என்றால், அதை வேறு முக்கிய வாதத்தின் மூலம் அனுப்ப அனுமதிக்கவும் அல்லது புதிய படிவத்தை மட்டுமே ஏற்கும் இரண்டாவது செயல்பாட்டைச் சேர்க்கவும்.
tr_tr: Türü nedeniyle mevcut bir olasılıktan ayırt edemediğiniz yeni bir girdiyi kabul etmeniz gerekiyorsa, bunun farklı bir anahtar sözcük bağımsız değişkeni tarafından geçirilmesine izin verin veya yalnızca yeni biçimi kabul eden ikinci bir fonksiyon ekleyin.

source: Issuing deprecation warnings
de_de: Ausgabe von Warnhinweisen zur Abkündigung
es_un: Emisión de advertencias de obsolescencia
fr_fr: Emission d'avertissements d'obsolescence
ja_jp: 非推奨警告の発行
ko_kr: 사용 중단 경고 발생
pt_un: Emitir avisos de descontinuação
ru_ru: Выпуск предупреждений о устаревании
ta_in: பணிநீக்கம் எச்சரிக்கைகளை வழங்குதல்
te_in: నిరాకరణ హెచ్చరికలను జారీ చేస్తోంది
tr_tr: Kullanımdan kaldırma uyarıları yayınlama

source: The proper way to raise a deprecation warning is to use the decorators ``@deprecate_arg`` and ``@deprecate_func`` from ``qiskit.utils.deprecation``. These will generate a standardized message and and add the deprecation to that function's docstring so that it shows up in the docs.
pt_un: A maneira correta de emitir um aviso de descontinuação é usar os decoradores ``@deprecate_arg`` e ``@deprecate_func`` de ``qiskit.utils.deprecation``. Isso gerará uma mensagem padronizada e adicionará a descontinuação à docstring dessa função para que ela apareça na documentção.
ru_ru: Правильным способом предупреждения об устаревании является использование декораторов ` `@deprecate_arg` ` и ` ` `@deprecate_func` ` из ` `qiskit.utils.deprecation ` `. Они генерируют стандартизованные сообщения и добавляют устаревшие в docstring этой функции так, чтобы она была показана в docs.

source: Usually, you should set ``additional_msg: str `` with the format ``"Instead, use ..."`` so that people know how to migrate. Read those functions' docstrings for additional arguments like ``pending: bool`` and ``predicate``.
pt_un: Normalmente, você deve definir ``additional_msg: str `` com o formato ``"Em vez disso, use ..."`` para que as pessoas saibam como migrar. Leia as docstrings dessas funções para obter argumentos adicionais como ``pending: bool`` e ``predicate``.
ru_ru: Обычно следует задать ` ` additional_msg: str ` ` с форматом ` ` "Вместо этого используйте ..." ` ` чтобы люди знали, как перенастроить. Прочитай эти функции ' docstrings for дополнительных аргументов как ` ` pending: bool ` ` и ` ` predicate ` `.

source: If you are deprecating in a non-Terra repo, set ``package_name``, e.g. to ``qiskit-nature``. Alternatively, if you prefer to use your own decorator helpers, then have them call ``add_deprecation_to_docstring`` from ``qiskit.utils.deprecation``.
pt_un: Se você estiver descontinuando um repositório não-Terra, defina ``package_name``, por exemplo para ``qiskit-nature``. Alternativamente, se você preferir usar seus próprios decoradores, faça com que eles chamem ``add_deprecation_to_docstring`` de ``qiskit.utils.deprecation``.

source: If ``@deprecate_func`` and ``@deprecate_arg`` cannot handle your use case, consider improving them. Otherwise, you can directly call the ``warn`` function from the `warnings module in the Python standard library <https://docs.python.org/3/library/warnings.html>`__, using the category ``DeprecationWarning``. For example:
pt_un: Se ``@deprecate_func`` e ``@deprecate_arg`` não puderem lidar com seu caso de uso, considere melhorá-los. Caso contrário, você pode chamar diretamente a função ``warn`` do módulo `warnings na biblioteca padrão do Python <https://docs.python.org/3/library/warnings.html>`__, usando a categoria `` DeprecationWarning``. Por exemplo:

source: Make sure you include the version of the package that introduced the deprecation warning (so maintainers can easily see when it is valid to remove it), and what the alternative path is.
de_de: Vergewissern Sie sich, dass Sie die Version des Pakets mit einbeziehen, die die Deprecation-Warnung einführte (damit die Betreuer leichter sehen können, wann es möglich ist, das Paket zu entfernen) und was der alternative Pfad ist.
es_un: Asegúrate de incluir la versión del paquete que introdujo la advertencia de obsolescencia (para que los mantenedores puedan ver fácilmente cuándo es válido eliminarlo) y cuál es la ruta alternativa.
fr_fr: Assurez-vous d'inclure la version du paquet qui a introduit l'avertissement de dépréciation (pour que les responsables puissent facilement voir quand le moment est venu pour le supprimer), et quel est le chemin alternatif.
ja_jp: 非推奨の警告を導入したパッケージのバージョンを必ず含めてください (メンテナーがそれを削除することが有効な時期を簡単に確認できるようにするため)、および代替パスが何であるかを確認してください。
ko_kr: 사용 중단 경고를 도입한 패키지 버전(유지 관리자가 유효한 제거 시기를 쉽게 확인할 수 있도록)과 대체 경로를 포함해야 한다.
pt_un: Certifique-se de incluir a versão do pacote que introduziu o aviso de descontinuação (para que os mantenedores possam ver facilmente quando é válido removê-lo) e qual é o caminho alternativo.
ru_ru: Убедитесь, что вы упомянули версию пакета с предупреждением об устаревании (чтобы поддержка знала, когда следует удалить) и альтернативный способ.
ta_in: தேய்மான எச்சரிக்கையை அறிமுகப்படுத்திய தொகுப்பின் பதிப்பை நீங்கள் சேர்த்துள்ளீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் (எனவே, அதை அகற்றுவது எப்போது செல்லுபடியாகும் என்பதை பராமரிப்பாளர்கள் எளிதாகக் காணலாம்), மற்றும் மாற்று வழி என்ன.
te_in: మీరు నిరాకరణ హెచ్చరికను పరిచయం చేసిన ప్యాకేజీ వెర్షన్ను చేర్చారని నిర్ధారించుకోండి (అందువలన నిర్వహణదారులు దానిని తీసివేయడం చెల్లుబాటు అయినప్పుడు సులభంగా చూడగలరు), మరియు ప్రత్యామ్నాయ మార్గం ఏమిటి చూడగలరు.
tr_tr: Kullanımdan kaldırma uyarısını getiren paketin sürümünü ve alternatif yolun ne olduğunu eklediğinizden emin olun (böylece sürdürücüler paketi kaldırmanın ne zaman geçerli olduğunu kolayca görebilirler).
