Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/deprecation_policy.po
Languages: de_de, es_un, fr_fr, ja_jp, ko_kr, pt_un, ru_ru, ta_in, te_in, tr_tr

source: Take note of the ``stacklevel`` argument. This controls which function is accused of being deprecated. Setting ``stacklevel=1`` (the default) means the warning will blame the ``warn`` function itself, while ``stacklevel=2`` will correctly blame the containing function. It is unusual to set this to anything other than ``2``, but can be useful if you use a helper function to issue the same warning in multiple places.
de_de: Beachten Sie das ``stacklevel`` Argument. Damit wird gesteuert, welche Funktion abgekündigt wird. ``stacklevel=1`` (der Standard) bedeutet, dass die Warnung die ``warn`` Funktion selbst betrifft, während ``stacklevel=2`` die enthaltene Funktion korrekt angibt. Es ist ungewöhnlich, den Wert auf etwas anderes als ``2`` zu setzen, kann aber nützlich sein, wenn Sie eine Helfer-Funktion verwenden, um die gleiche Warnung an mehreren Orten auszulösen.
es_un: Toma nota del argumento ``stacklevel``. Esto controla qué función se acusa de estar en desuso. Establecer ``stacklevel=1`` (predeterminado) significa que la advertencia responsabilizará a la función ``warn`` en sí misma, mientras que ``stacklevel=2`` responsabilizará correctamente a la función contenedora. Es inusual establecer esto en algo que no sea ``2``, pero puede ser útil si usas una función auxiliar para emitir la misma advertencia en varios lugares.
fr_fr: Prenez note de l'argument ``stacklevel``. Il permet de gérer les fonctions pointées comme obsolète. En définissant ``stacklevel=1`` (la valeur par défaut), l'avertissement est responsable de la fonction ``warn`` elle-même, tandis que ``stacklevel=2`` va à juste titre désigner la fonction contenant. Il est inhabituel de la définir à autre chose que `` 2``, mais peut être utile si vous utilisez une fonction d'aide pour émettre le même avertissement dans plusieurs endroits.
ja_jp: ``stacklevel`` 引数に注意してください。 これは、非推奨であると非難される関数を制御します。 ``stacklevel=1`` (デフォルト) を設定すると、警告は ``warn`` 関数自体を非難し、``stacklevel=2`` はそれを含む関数を正しく非難することを意味します。 これを ``2`` 以外に設定することはまれですが、ヘルパー関数を使用して複数の場所で同じ警告を発行する場合に役立ちます。
ko_kr: ``stacklevel`` 인수에 주의하라. 이것은 더 이상 사용되지 않는 것으로 예상되는 기능을 제거한다. ``stacklevel=1`` (기본값)을 설정하면 경고가 ``warn`` 함수 자체를 지우는 반면, ``stacklevel=2`` 는 포함하는 함수를 올바르게 지워진다는 것을 의미 한다. 이것을 ``2`` 이외의 값으로 설정하는 것은 드문 일이지만 도우미 기능을 사용하여 여러 위치에서 동일한 경고를 발행하는 경우 유용할 수 있다.
pt_un: Tome nota do argumento ``stacklevel``. Isso controla qual função é acusada de ser obsoleta. Definir ``stacklevel=1`` (o padrão) significa que o aviso culpará a própria função ``warn``, enquanto ``stacklevel=2`` culpará corretamente a função que o contém. É incomum definir isso como algo diferente de ``2``, mas pode ser útil se você usar uma função auxiliar para emitir o mesmo aviso em vários lugares.
ru_ru: Обратите внимание на аргумент ``stacklevel``. Он отвечает за то, какая функция будет упомянута как устаревшая. Значение ``stacklevel=1`` (по умолчанию) приведет к тому, что предупреждение будет отсылать к самой функцию ``warn``, а ``stacklevel=2`` — к ее содержимому. Обычно аргументу присваивают значение ``2``, но другой вариант тоже может быть полезен при использовании вспомогательной функции для выпуска одного и того же предупреждения в нескольких местах.
ta_in: ``ஸ்டாக்லெவல்`` வாதத்தை கவனத்தில் கொள்ளவும். எந்த செயல்பாடு தடுக்கப்பட்டது என்று குற்றம் சாட்டப்படுவதை இது கட்டுப்படுத்துகிறது. ``stacklevel=1`` (இயல்புநிலை) அமைப்பதன் அர்த்தம், எச்சரிக்கையானது ``warn`` செயல்பாட்டையே குற்றம் சாட்டும், அதேசமயம் `stacklevel=2`` சரியாகக் கொண்டிருக்கும் செயல்பாட்டைக் குற்றம்சாட்டும். இதை ``2`` என்பதைத் தவிர வேறு எதற்கும் அமைப்பது வழக்கத்திற்கு மாறானது, ஆனால் பல இடங்களில் ஒரே எச்சரிக்கையை வழங்குவதற்கு உதவி செயல்பாட்டைப் பயன்படுத்தினால் பயனுள்ளதாக இருக்கும்.
te_in: ``stacklevel`` వాదనను గమనించండి. ఇది ఏ ఫంక్షన్ నిలిపివేయబడిందని ఆరోపించబడుతుందో నియంత్రిస్తుంది. ``stacklevel=1`` (డిఫాల్ట్) సెట్ చేయడం అంటే హెచ్చరిక ``warn`` ఫంక్షన్‌పైనే నిందిస్తుంది, అయితే ``stacklevel=2`` కలిగి ఉన్న ఫంక్షన్‌ను సరిగ్గా నిందిస్తుంది. దీన్ని ``2`` కాకుండా మరేదైనా సెట్ చేయడం అసాధారణం, కానీ మీరు అనేక ప్రదేశాల్లో ఒకే హెచ్చరికను జారీ చేయడానికి సహాయక ఫంక్షన్‌ని ఉపయోగిస్తే ఉపయోగకరంగా ఉంటుంది.
tr_tr: ``stacklevel`` bağımsız değişkenine dikkat edin. Bu, hangi fonksiyonun kullanımdan kaldırılıyor gösterileceğini kontrol eder. ``stacklevel=1`` (varsayılan) ayarı, uyarının ``warn`` fonksiyonunun kendisini gösterir, ``stacklevel=2`` ise doğru şekilde kapsayan fonksiyonu göstereceği anlamına gelir. Bunu ``2`` dışında bir değere ayarlamak alışılmadık bir durumdur, ancak aynı uyarıyı birden fazla yerde yayınlamak için bir yardımcı fonksiyon kullanırsanız yararlı olabilir.

source: Testing deprecated functionality
de_de: Testen veralteter Funktionen
es_un: Prueba de funcionalidad obsoleta
fr_fr: Test des fonctionnalités obsolètes
ja_jp: 非推奨機能のテスト
ko_kr: 사용 중지된 기능의 테스트
pt_un: Testando funcionalidade obsoleta
ru_ru: Тестирование устаревших элементов
ta_in: நிறுத்தப்பட்ட செயல்பாட்டைச் சோதிக்கிறது
te_in: తిరస్కరించబడిన కార్యాచరణను పరీక్షిస్తోంది
tr_tr: Kullanımdan kaldırılan işlevselliği test etme

source: Whenever you add deprecation warnings, you will need to update tests involving the functionality. The test suite should fail otherwise, because of the new warnings. We must continue to test deprecated functionality throughout the deprecation period, to ensure that it still works.
de_de: Immer wenn Sie Warnhinweise auf Abkündigung einer Funktion hinzufügen, müssen Sie die Tests aktualisieren, die die Funktionalität betreffen. Die Testsuite sollte andernfalls wegen der neuen Warnungen fehlschlagen. Die veraltete Funktionalität muss auch während der Abkündigungsperiode getestet werden, um sicherzustellen, dass sie weiterhin funktioniert.
es_un: Cada vez que agregues advertencias de obsolescencia, deberás actualizar las pruebas relacionadas con la funcionalidad. De lo contrario, el conjunto de pruebas debería fallar debido a las nuevas advertencias. Debemos continuar probando la funcionalidad en desuso durante el período de desuso, para asegurarnos de que aún funcione.
fr_fr: Chaque fois que vous ajoutez des avertissements de dépréciation, vous devrez mettre à jour les tests impliquant la fonctionnalité. La suite de tests devrait échouer autrement, en raison des nouveaux avertissements. Nous devons continuer à tester les fonctionnalités obsolètes tout au long de la période de dépréciation pour nous assurer que cela fonctionne toujours.
ja_jp: 非推奨の警告を追加するたびに、機能に関連するテストを更新する必要があります。 それ以外の場合、新しい警告により、テスト スイートは失敗するはずです。 廃止された機能が引き続き機能することを確認するために、廃止期間を通じて廃止された機能を引き続きテストする必要があります。
ko_kr: 사용 중단 경고를 추가할 때마다 기능과 관련된 테스트를 업데이트해야 한다. 그렇지 않으면 새로운 경고 때문에 일련의 테스트 들이 실패하게 된다. 사용 중단 기간 동안 사용 중단된 기능을 계속 테스트하여 여전히 작동하는지 확인해야 한다.
pt_un: Sempre que adicionar avisos de descontinuação, você precisará atualizar os testes envolvendo a funcionalidade. Caso contrário, o conjunto de testes deve falhar devido aos novos avisos. Devemos continuar a testar a funcionalidade obsoleta durante o período de descontinuação, para garantir que ela ainda funcione.
ru_ru: При добавлении предупреждений об устаревании необходимо обновить тесты, связанные с функциональностью. Иначе тестовый набор будет работать некорректно из-за новых предупреждений. Тестировать устаревшие элементы придется на протяжении всего периода устаревания для проверки их работоспособности.
ta_in: நீக்குதல் எச்சரிக்கைகளைச் சேர்க்கும் போதெல்லாம், செயல்பாடு சம்பந்தப்பட்ட சோதனைகளை நீங்கள் புதுப்பிக்க வேண்டும். புதிய எச்சரிக்கைகள் காரணமாக சோதனைத் தொகுப்பு இல்லையெனில் தோல்வியடையும். அது இன்னும் செயல்படுகிறதா என்பதை உறுதிசெய்ய, தேய்மானக் காலம் முழுவதும் நிறுத்தப்பட்ட செயல்பாட்டை நாங்கள் தொடர்ந்து சோதிக்க வேண்டும்.
te_in: మీరు నిరాకరణ హెచ్చరికలను జోడించినప్పుడల్లా, మీరు ఫంక్షనాలిటీతో కూడిన పరీక్షలను అప్‌డేట్ చేయాలి. కొత్త హెచ్చరికల కారణంగా పరీక్ష సూట్ లేకపోతే విఫలమవుతుంది. ఇది ఇప్పటికీ పని చేస్తుందో లేదో నిర్ధారించడానికి, నిరాకరించబడిన వ్యవధి అంతటా మనం నిలిపివేయబడిన కార్యాచరణను పరీక్షించడం కొనసాగించాలి.
tr_tr: Kullanımdan kaldırma uyarıları eklediğinizde, işlevselliği içeren testleri güncellemeniz gerekecektir. Aksi takdirde, yeni uyarılar nedeniyle test paketi başarısız olacaktır. Hâlâ çalıştığından emin olmak için kullanımdan kaldırılan işlevselliği kullanımdan kaldırma süresi boyunca test etmeye devam etmeliyiz.

source: To update the tests, you need to wrap each call of deprecated behavior in its own assertion block. For subclasses of ``unittest.TestCase`` (which all Qiskit test cases are), this is done by:
de_de: Um die Tests zu aktualisieren, müssen Sie jeden Aufruf veralteter Funktionsverhalten in einen eigenen "assertion"-Block platzieren. Für Unterklassen von ``unittest.TestCase`` (was alle Qiskit-Testfälle sind), geschieht dies durch:
es_un: Para actualizar las pruebas, debes envolver cada llamada de comportamiento obsoleto en su propio bloque de aserción. Para las subclases de ``unittest.TestCase`` (que son todos los casos de prueba de Qiskit), esto se hace de la siguiente manera:
fr_fr: Pour mettre à jour les tests, vous devez encapsuler chaque appel de comportement obsolète dans son propre bloc d'assertion. Pour les sous-classes de ``unittest.TestCase`` (que sont tous les scénarios de test Qiskit), ceci est effectué par:
ja_jp: テストを更新するには、非推奨の動作の各呼び出しを独自のアサーション ブロックでラップする必要があります。 ``unittest.TestCase`` (すべての Qiskit テスト ケース) のサブクラスの場合、これは次のように行われます。
ko_kr: 테스트를 업데이트하려면 더 이상 사용되지 않는 동작의 각 호출을 자체 가정 설정문 블록(assertion block)으로 래핑해야 한다. ``unittest.TestCase`` 의 서브클래스(모든 Qiskit 테스트 케이스가 있음)의 경우 다음과 같이 수행 된다.
pt_un: Para atualizar os testes, você precisa agrupar cada chamada de comportamento obsoleto em seu próprio bloco de asserção. Para subclasses de ``unittest.TestCase`` (que são todos os casos de teste do Qiskit), isso é feito por:
ru_ru: Для обновления тестов нужно обернуть каждый вызов устаревшего поведения в собственный блок утверждений. Для подклассов ``unittest.TestCase`` (которые находятся во всех тестированиях Qiskit), это делается так:
ta_in: சோதனைகளைப் புதுப்பிக்க, நிராகரிக்கப்பட்ட நடத்தையின் ஒவ்வொரு அழைப்பையும் அதன் சொந்த வலியுறுத்தல் தொகுதியில் மடிக்க வேண்டும். துணைப்பிரிவுகளுக்கு ``unittest.TestCase`` (அனைத்து Qiskit சோதனை நிகழ்வுகளும்), இது இவர்களால் செய்யப்படுகிறது:
te_in: పరీక్షలను అప్‌డేట్ చేయడానికి, మీరు విస్మరించబడిన ప్రవర్తన యొక్క ప్రతి కాల్‌ను దాని స్వంత అసెర్షన్ బ్లాక్‌లో వ్రాప్ చేయాలి. ``unittest.TestCase`` (అన్ని Qiskit పరీక్ష కేసులు) యొక్క ఉపవర్గాల కోసం, ఇది వీరిచే చేయబడుతుంది:
tr_tr: Testleri güncellemek için, kullanımdan kaldırılan her davranış çağrısını kendi onaylama bloğuna sarmanız gerekir. ``unittest.TestCase`` alt sınıfları için (ki bunlar tüm Qiskit test senaryolarıdır), bu şu şekilde yapılır:

source: Documenting deprecations and breaking changes
de_de: Dokumentation von Abkündigungen und grundlegenden Änderungen
es_un: Documentación de obsolescencias y cambios importantes
ja_jp: 非推奨および破壊的変更の文書化
pt_un: Documentando depreciações e alterações importantes
ru_ru: Документация о устаревании и важных изменениях
ta_in: நிராகரிப்பு மற்றும் மாற்றங்களை உடைத்தல் ஆகியவற்றை ஆவணப்படுத்துதல்
te_in: నిరాకరణలను డాక్యుమెంట్ చేయడం మరియు మార్పులను విచ్ఛిన్నం చేయడం

source: It is important to warn the user when your breaking changes are coming.
pt_un: É importante avisar o usuário quando suas alterações importantes estiverem chegando.

source: ``@deprecate_arg`` and ``@deprecate_func`` will automatically add the deprecation to the docstring for the function so that it shows up in docs.
pt_un: ``@deprecate_arg`` e ``@deprecate_func`` irão adicionar automaticamente a depreciação à docstring para a função para que ela apareça nos documentos.

source: If you are not using those decorators, you should directly add a `Sphinx deprecated directive <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#directive-deprecated>`__ ::
pt_un: Se você não estiver usando esses decoradores, você deve adicionar diretamente uma `diretiva obsoleta do Sphinx <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#directive-deprecated>`__ ::

source: """ Short description of the deprecated function.
pt_un: """ Curta descrição da função descontinuada.

source: The function qiskit.deprecated_function() is deprecated since Qiskit Terra 0.20.0, and will be removed 3 months or more later. Instead, you should use qiskit.other_function().
pt_un: A função qiskit.deprecated_function() está descontinuada desde o Qiskit Terra 0.20.0 e será removida 3 meses ou mais depois. Em vez disso, você deve usar qiskit.other_function().

source: <rest of the docstring> """ # ... the rest of the function ...
pt_un: <rest of the docstring> """ # ... o resto da função ...

source: You should also document the deprecation in the changelog by using Reno. Explain the deprecation and how to migrate.
pt_un: Você também deve documentar a descontinuação no changelog usando Reno. Explique a descontinuação e como migrar.

source: In particular situations where a deprecation or change might be a major disruptor for users, a *migration guide* might be needed. Once the migration guide is written and published, deprecation messages and documentation should link to it (use the ``additional_msg: str`` argument for ``@deprecate_arg`` and ``@deprecate_func``).
pt_un: Em situações específicas em que uma substituição ou alteração pode ser um grande obstáculo para os usuários, um *guia de migração* pode ser necessário. Depois que o guia de migração for escrito e publicado, as mensagens de descontinuação e a documentação devem ser vinculadas a ele (use o argumento ``additional_msg: str`` para ``@deprecate_arg`` e ``@deprecate_func``).

source: The proper way to raise a deprecation warning is to use the ``warn`` function from the `warnings module in the Python standard library <https://docs.python.org/3/library/warnings.html>`__, using the category ``DeprecationWarning``. For example::
fr_fr: La façon correcte de lever un avertissement de dépréciation est d'utiliser la fonction ``warn`` du module `warnings module <https://docs.python.org/3/library/warnings.html>`__ disponible dans la librairie standard de Pythonn en utilisant la catégorie ``DeprecationWarning``. Voici un exemple d'appel ::
ja_jp: 非推奨の警告を発生させる適切な方法は、カテゴリ ``DeprecationWarning`` を使用して、 `Python 標準ライブラリの warnings モジュール <https://docs.python.org/3/library/warnings.html>`__ の ``warn`` 関数を使用することです。 例えば：
ta_in: பைதான் நிலையான நூலகத்தில் உள்ள `எச்சரிக்கை தொகுதியிலிருந்து ``warn`` செயல்பாட்டைப் பயன்படுத்துவதே தேய்மான எச்சரிக்கையை உயர்த்துவதற்கான சரியான வழி <https://docs.python.org/3/library/warnings.html>`__, ``DeprecationWarning`` வகையைப் பயன்படுத்துகிறது. உதாரணத்திற்கு::
tr_tr: Kullanımdan kaldırma uyarısı vermenin uygun yolu, ``DeprecationWarning`` kategorisini kullanarak Python standart kütüphanesinde `warnings modülünden <https://docs.python.org/3/library/warnings.html>`__ `` warn`` fonksiyonunu kullanmaktır. Örnek olarak şu verilebilir::

source: It is important to warn the user when your breaking changes are coming. This can be done in the docstring for the function, method, or class that is being deprecated, by adding a `deprecated note <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#directive-deprecated>`__ :
ja_jp: 重大な変更が行われるときにユーザーに警告することが重要です。 これは、非推奨の関数、メソッド、またはクラスの docstring で`deprecated note <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#directive-deprecated>`__ を追加することで実行できます：
ta_in: உங்கள் பிரேக்கிங் மாற்றங்கள் வரும்போது பயனரை எச்சரிப்பது முக்கியம். <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html என்ற குறிப்பைச் சேர்ப்பதன் மூலம், தடுக்கப்படும் செயல்பாடு, முறை அல்லது வகுப்புக்கான டாக்ஸ்ட்ரிங்கில் இதைச் செய்யலாம். #ஆணை-நிறுத்தப்பட்டது>`__ :

source: In particularly situation where a deprecation or change might be a major disruptor for users, a *migration guide* might be needed. Once the migration guide is written and published, deprecation messages and documentation can link to it.
ja_jp: 特に、非推奨や変更がユーザーにとって大きな混乱となりそうな状況では、 *移行ガイド* が必要かもしれません。移行ガイドが作成され、公開されると、非推奨のメッセージやドキュメントがそれにリンクすることができます。
ta_in: குறிப்பாக ஒரு தேய்மானம் அல்லது மாற்றம் பயனர்களுக்குப் பெரும் இடையூறாக இருக்கும் சூழ்நிலையில், *இடம்பெயர்வு வழிகாட்டி* தேவைப்படலாம். இடம்பெயர்வு வழிகாட்டி எழுதப்பட்டு வெளியிடப்பட்டதும், நீக்குதல் செய்திகளும் ஆவணங்களும் அதனுடன் இணைக்கப்படலாம்.
