Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: bn_bn, de_de, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pt_br, ta_in, tr_tr, zh_tw

source: The error is caused when trying to import the Qiskit package in an environment where Qiskit is not installed. If you launched Jupyter Notebook from the Anaconda-Navigator, it is possible that Jupyter Notebook is running in the base (root) environment, instead of in your virtual environment. Choose a virtual environment in the Anaconda-Navigator from the **Applications on** dropdown menu. In this menu, you can see all of the virtual environments within Anaconda, and you can select the environment where you have Qiskit installed to launch Jupyter Notebook.
bn_bn: এই ত্রুটি হয় তখন, যখন কর্মপরিবেশে Qiskit ইন্সটল না থাকার পরেও Qiskit প্যাকেজ ইম্পোর্ট করার চেষ্টা করা হয়। আপনি যদি জুপিটার নোটবুক অ্যানাকোন্ডা-নেভিগেটর থেকে শুরু করে থাকেন তবে এরকম হতে পারে যে জুপিটার নোটবুক আপনার কৃত্রিম কর্মপরিবেশের পরিবর্তে মূল (বেইস) কর্মপরিবেশ থেকে রান হচ্ছে। একটি কৃত্রিম কর্মপরিবেশ বাছাই করুন **Applications on** ড্রপডাউন তালিকা থেকে। এই তালিকায় আপনি অ্যানাকোন্ডার সকল কৃত্রিম কর্মপরিবেশসমূহ দেখতে পাবেন এবং আপনি এমন একটি কর্মপরিবেশ বাছাই করতে পারবেন যেখানে Qiskit ইন্সটল করা আছে।
de_de: Der Fehler wird verursacht, wenn versucht wird, das Qiskit-Paket in einer Umgebung zu importieren, in der Qiskit nicht installiert ist. Wenn Sie Jupyter Notebook über den Anaconda-Navigator gestartet haben, wird es möglicherweise nicht in Ihrer virtuellen Umgebung, sondern in der Basisumgebung (Root) ausgeführt. Wählen Sie im Anaconda-Navigator eine virtuelle Umgebung aus dem Dropdown-Menü ** Applications on**. In diesem Menü können Sie alle virtuellen Umgebungen in Anaconda anzeigen und die Umgebung auswählen, in der Qiskit installiert ist, um Jupyter Notebook zu starten.
es_mx: Este error es causado cuando se intenta importar el paquete Qiskit en un entorno donde Qiskit no ha sido instalado. Si usted inició Jupyter Notebook desde el navegador de Anaconda, es posible que el Notebook se esté ejecutando en el entorno base (root) en lugar de su entorno virtual. Elija un entorno virtual en el navegador de Anaconda desde **Aplicaciones** en la lista desplegable del menú. En este menú puedes ver todos los entornos virtuales de Anaconda y puede seleccionar el entorno donde tiene Qiskit instalado para iniciar Jupyter Notebook.
es_un: El error se produce al intentar importar el paquete Qiskit en un entorno donde Qiskit no está instalado. Si iniciaste Jupyter Notebook desde Anaconda-Navigator, es posible que el cuaderno de Jupyter se esté ejecutando en el entorno base (root), en lugar de en tu entorno virtual. Elige un entorno virtual en el Anaconda-Navigator desde el menú desplegable **Applications on**. En este menú, puedes ver todos los entornos virtuales dentro de Anaconda y puedes seleccionar el entorno en el que tienes instalado Qiskit para iniciar el Jupyter Notebook.
fr_fr: L'erreur est provoquée lors de la tentative d'importation du package Qiskit dans un environnement où Qiskit n'est pas installé. Si vous avez lancé Jupyter Notebook à partir d'Anaconda-Navigator, il est possible que Jupyter Notebook s'exécute dans l'environnement de base (root), au lieu de dans votre environnement virtuel. Choisissez un environnement virtuel dans Anaconda-Navigator à partir du menu déroulant ** Applications on * *. Dans ce menu, vous pouvez voir tous les environnements virtuels d'Anaconda, et vous pouvez sélectionner l'environnement où vous avez Qiskit installé pour lancer Jupyter Notebook.
id_id: Error ini terjadi ketika mencoba meng-*import package* Qiskit di lingkungan yang tidak ter-*install* Qiskit. Jika Anda menjalankan Jupyter Notebook dari Anaconda-Navigator, terdapat kemungkinan bahwa Jupyter Notebook berjalan pada lingkungan *base* (*root*), bukan di lingkungan virtual Anda. Pilih sebuah lingkungan virtual pada Anaconda-Navigator dari menu dropdown **Applications on**. Di menu ini, Anda dapat melihat semua lingkungan virtual Anda di dalam Anaconda. Anda juga bisa memilih lingkungan yang telah ter-*install* Qiskit dan menjalankan Jupyter Notebook di lingkungan tersebut.
it_it: L'errore è causato dall'aver provato ad importare il pacchetto Qiskit in un ambiente dove Qiskit non è installato. Se hai lanciato il notebook Jupyter da Anaconda-Navigator, è possibile che Jupyter sia stato eseguito nell'ambiente di base (root), invece che nel tuo ambiente virtuale. In Anaconda-Navigator, dal menù a tendina **Applications on**, scegli un ambiente virtuale. Nel menù puoi visualizzare tutti gli ambienti virtuali presenti in Anaconda e puoi selezionare quello in cui hai installato Qiskit per poi eseguire i notebook Jupyter.
ko_kr: 키스킷이 설치되지 않은 환경에서 키스킷 패키지를 임포트 하려고하면 오류가 발생한다. 아나콘다 네비게이터 에서 주피터노트북 을 시작한 경우 주피터 노트북이 가상 환경이 아닌 기본 (루트) 환경에서 실행될 수 있기 때문이다. 아나콘다 네비게이터 에서 ** Application on ** 드롭다운 메뉴의 가상 환경을 선택하라. 이 메뉴에서 아나콘다 내의 모든 가상 환경을 볼 수 있으며 주피터 노트북을 시작하기 위해 키스킷이 설치된 환경을 선택할 수 있다.
pt_br: O erro é causado ao tentar importar o pacote Qiskit em um ambiente onde o Qiskit não está instalado. Se você rodou o Jupyter Notebook de um navegador Anaconda, é possível que o Jupyter Notebook esteja rodando no ambiente base (raiz), em vez de em seu ambiente virtual. Escolha um ambiente virtual no navegador Anaconda a partir do menu suspenso **Aplicativos em**. Neste menu, você pode ver todos os ambientes virtuais dentro da Anaconda, e você pode selecionar o ambiente onde você tem Qiskit instalado para rodar o Jupyter Notebook.
ta_in: Qiskit நிறுவப்படாத சூழலில் Qiskit தொகுப்பை இறக்குமதி செய்ய முயற்சிக்கும்போது பிழை ஏற்படுகிறது. நீங்கள் அனகொண்டா-நேவிகேட்டர் இடமிருந்து ஜுப்ய்ட்டர் நோட்புக்கை அறிமுகப்படுத்தினால், உங்கள் மெய்நிகர் சூழலுக்குப் பதிலாக, ஜுப்ய்ட்டர் நோட்புக் அடிப்படை (ரூட்) சூழலில் இயங்குகிறது. கீழ்தோன்றும் மெனுவில் உள்ள பயன்பாடுகளிலிருந்து **அனகொண்டா-நேவிகேட்டர்** ஒரு மெய்நிகர் சூழலைத் தேர்வுசெய்கிறது. இந்த மெனுவில், அனகொண்டா விற்குள் உள்ள அனைத்து மெய்நிகர் சூழல்களையும் நீங்கள் காணலாம், மேலும் ஜுப்ய்ட்டர் நோட்புக் தொடங்க நீங்கள் Qiskit நிறுவியிருக்கும் சூழலைத் தேர்ந்தெடுக்கலாம்.
tr_tr: Hata, Qiskit'in yüklü olmadığı bir ortamda Qiskit paketini içe aktarmaya çalışırken ortaya çıkar. Jupyter Notebook'u Anaconda-Navigator'dan başlattıysanız, Jupyter Notebook'un sanal ortamınız yerine temel (kök) ortamda çalışıyor olması mümkündür. **Applications on** açılır menüsünden Anaconda-Navigator'da bir sanal ortam seçin. Bu menüde, Anaconda içindeki tüm sanal ortamları görebilir ve Jupyter Notebook'u başlatmak için Qiskit'in yüklü olduğu ortamı seçebilirsiniz.
zh_tw: 在未安裝 Qiskit 的環境中導入 Qiskit 包時將會出現此錯誤。 如果您從 Anaconda-Navigator 啟動 Jupyter Notebook，則 Jupyter Notebook 可能運行在基本（root）環境中，而不是您設置的虛擬環境中。 從 Anaconda-Navigator 的 ** Applications on ** 下拉菜單中選擇一個虛擬環境。 此菜單包含 Anaconda 中的所有虛擬環境。 在啟動 Jupyter Notebook 之前，選擇有安裝 Qiskit 的環境。

source: **Q: Why am I getting a compilation error while installing ``qiskit``?**
bn_bn: ** প্রশ্নঃ ``qiskit`` ইন্সটল করার সময় আমি কেন কম্পাইলেশন ত্রুটি দেখতে পাচ্ছি? **
de_de: ** F: Warum erhalte ich bei der Installation von "qiskit" einen Kompilierungsfehler? **
es_mx: **P: ¿Por qué aparece un error de compilación cuando instalo ``qiskit``?**
es_un: **P: ¿Por qué aparece un error de compilación al instalar** ``qiskit`` **?**
fr_fr: **Q: Pourquoi j'ai une erreur de compilation lors de l'installation de ` ` qiskit ` ` ?**
id_id: **Mengapa saya mendapatkan *compilation error* ketika meng-*install* ``qiskit``?**
it_it: **Q: Perchè ricevo un errore di compilazione durante l'installazione di ``qiskit``?**
ko_kr: **질문: 키스킷을 설치할때 컴파일 에러가 나는 이유는 무엇인가?**
pt_br: **P: Por que estou recebendo um erro de compilação ao instalar ``qiskit``?**
ta_in: **Q: ``Qiskit``-ஐ நிறுவும் போது நான் ஏன் தொகுப்பு பிழை பெறுகிறேன்?**
tr_tr: **S: ``qiskit``'i kurarken neden bir derleme hatası alıyorum?**
zh_tw: **Q：安裝 ``qiskit``時，為何發生編譯錯誤? **

source: **A:** Qiskit depends on a number of other open source Python packages, which are automatically installed when doing ``pip install qiskit``. Depending on your system's platform and Python version, is it possible that a particular package does not provide a pre-built binary wheel for your system, and in those cases ``pip`` will attempt to compile the package from source, which in turn might require some extra dependencies that need to be installed manually.
bn_bn: ** উত্তরঃ ** Qiskit অনেকগুলো অন্যান্য মুক্ত উৎস পাইথন প্যাকেজসমূহের উপর নির্ভর করে থাকে, যা স্বয়ংক্রিয়ভাবে ইন্সটল হয় ``pip install qiskit`` কমান্ড রান করলে। আপনার সিস্টেমের প্ল্যাটফর্ম এবং পাইথন সংস্করণের উপর নির্ভর করে, এটা হতে পারে যে একটি নির্দিষ্ট প্যাকেজ পূর্বপ্রস্তুতকৃত দ্বিমিক চক্র (বাইনারি হুইল) প্রদান করেনা। সেক্ষেত্র ``pip`` এই প্যাকেজ উৎস থেকে কম্পাইল করার চেষ্টা করবে। যার জন্য অতিরিক্ত কিছু শর্তসমূহ (ডিপেন্ডেন্সি) প্রয়োজন হতে পারে যা হাতে করে ইন্সটল করা লাগতে পারে।
es_mx: **R:** Qiskit depende de varios paquetes de código abierto de Python los cuales son automáticamente instalados cuando se ejecuta ``pip install qiskit``. Dependiendo de la plataforma de tu computadora y de la versión de Python, es posible que un paquete en particular no se provea como un binario preconstruido para tu sistema y en esos casos ``pip`` intentará compilar el paquete desde el código fuente, que a su vez, requerirá algunas dependencias adicionales que deben ser instaladas manualmente.
fr_fr: **R:** Qiskit dépend de plusieurs autres paquets Python open source, qui sont automatiquement installés lors du lancement de la commande ``pip install qiskit``. Selon la plate-forme de votre système et la version de Python, il est possible qu'un paquet particulier ne fournisse pas de binaire pré-construit pour votre système, et, dans ce cas, ``pip`` tentera de compiler le paquet depuis la source, qui à son tour peut nécessiter des dépendances supplémentaires -et qui doivent être installées manuellement-.
id_id: **A:** Qiskit memiliki dependensi terhadap sejumlah *package open-source* Python lainnya yang akan secara otomatis ter-*install* ketika melakukan ``pip install qiskit``. Tergantung pada platform dan versi Python di sistem Anda, terdapat kemungkinan bahwa tidak tersedia *pre-built binary wheel* dari suatu *package* untuk sistem Anda. Dalam kasus ini ``pip`` akan mencoba membangun *package* tersebut dari sumbernya, yang mungkin memerlukan dependensi tambahan yang perlu di-*install* secara manual.
it_it: **A:** Qiskit dipende da una serie di altri pacchetti Python open source, che vengono installati automaticamente quando si lancia il comando ``pip install qiskit``. A seconda del sistema operativo e della versione di Python, è possibile che un particolare pacchetto non fornisca una wheel binaria pre-costruita per quel sistema, ed in questi casi ``pip`` cercherà di compilare il pacchetto dal sorgente, che a sua volta potrebbe richiedere dipendenze aggiuntive che devono essere installate manualmente.
ko_kr: ** 답변: ** 키스킷은 ``pip install qiskit ''을 수행 할 때 자동으로 설치되는 다른 여러 오픈 소스 파이선 패키지에 의존한다. 시스템의 플랫폼과 파이선 버전에 따라 특정 패키지가 시스템에 사전 빌드된 바이너리 휠을 제공하지 않을 수 있으며, pip는 소스에서 패키지를 컴파일하려고 시도하기 때문에 수동으로 설치해야하는 추가 종속 프로그램이 필요할 수 있다.
pt_br: **R:** O Qiskit depende de vários outros pacotes de código aberto do Python, que são instalados automaticamente ao fazer ``pip install qiskit``. Dependendo da plataforma do seu sistema e da versão do Python, é possível que um determinado pacote não forneça um módulo binária pré-construído para seu sistema, e nesses casos ``pip`` tentará compilar o pacote da fonte, o que, por sua vez, pode exigir algumas dependências extras que precisam ser instaladas manualmente.
ta_in: **A:** Qiskit பல ஓபன் சௌர்ஸ் பைதான் தொகுப்புகளைப் பொறுத்தது, அவை ``pip install qiskit`` செய்யும் போது தானாக நிறுவப்படும். உங்கள் கணினியின் இயங்குதளம் மற்றும் பைதான் பதிப்பைப் பொறுத்து, ஒரு குறிப்பிட்ட தொகுப்பு உங்கள் கணினிக்கு முன்பே புய்ல்டு பைனரி அமைப்பு வழங்காமல் இருக்காது, மேலும் அந்த சந்தர்ப்பங்களில் ``pip`` மூலத்திலிருந்து தொகுப்பை தொகுக்க முயற்சிக்கும், இது கையால் முறையாக நிறுவ வேண்டிய சில கூடுதல் சார்புநிலைகள் தேவைப்படலாம்.
tr_tr: **C:** Qiskit, ``pip install qiskit`` yaparken otomatik olarak kurulan bir dizi diğer açık kaynaklı Python paketine bağlıdır. Sisteminizin platformuna ve Python sürümüne bağlı olarak, belirli bir paketin sisteminiz için önceden oluşturulmuş bir ikili çark sağlamaması ve bu durumlarda ``pip`` paketi kaynaktan derlemeye çalışacaktır. Bu durum manuel olarak yüklenmesi gereken bazı ek bağımlılıklar gerektirebilir.
zh_tw: ** A: ** Qiskit 依賴於許多其他開源 Python 包，這些安裝包會在您運行 ``pip install qiskit`` 時自動安裝。 根據您的系統平台和 Python 版本，某些軟件包可能沒有為您的系統預預先構建的二進製文件， 在這種情況下，``pip`` 將嘗試從源代碼編譯包，因此，您需要手動安裝一些額外的套件。

source: If the output of ``pip install qiskit`` contains similar lines to:
bn_bn: যদি ``pip install qiskit`` কমান্ডের আউটপুটে একই ধরণের লাইন থাকে তবেঃ
de_de: Wenn das Ergebnis von `` pip install qiskit`` ähnliche Zeilen enthält wie:
es_mx: Si la salida de ``pip install qiskit`` contiene líneas similares a:
es_un: Si la salida de ``pip install qiskit`` contiene líneas similares a:
fr_fr: Si la sortie de ``pip install qiskit`` contient des lignes similaires à:
id_id: Jika keluaran ``pip install qiskit`` berisi baris yang mirip dengan:
it_it: Se il messaggio di ``pip install qiskit`` contiene linee come le seguenti:
ko_kr: 만일 ``pip install qiskit`` 이 다음과 비슷한 문자열을 가지고 있으면:
pt_br: Se a saída do ``pip install qiskit`` contém linhas semelhantes a:
ta_in: ``pip install qiskit`` இன் ரிசல்ட் இதற்கு ஒத்த வரிகளைக் கொண்டிருந்தால்:
tr_tr: ``pip install qiskit`` çıktısı şunlara benzer satırlar içeriyorsa:
zh_tw: 如果 pip install qiskit 的輸出類似於以下行：

source: please check the documentation of the package that failed to install (in the example code, ``SOME_PACKAGE``) for information on how to install the libraries needed for compiling from source. For example:
bn_bn: যেসব প্যাকেজ ইন্সটল হয়নি সেগুলোর লাইব্রেরি ইন্সটল করে কিভাবে কম্পাইল করতে হয় তা জানতে দয়া করে সেগুলোর নথি (ডকুমেন্টেশন) (উদাহরণস্বরূপ, ``SOME_PACKAGE``) দেখুন।
es_mx: por favor revisa la documentación del paquete que no se pudo instalar (en el código ejemplo, ``SOME_PACKAGE``) y busca información de cómo instalar las librerías necesarias para compilar desde el código fuente. Por ejemplo:
fr_fr: consultez la documentation du package qui n'a pas réussi à être installé (dans l'exemple, ` ` SOME_PACKAGE ` `) pour plus d'informations sur l'installation des bibliothèques nécessaires à la compilation à partir du source. Par exemple:
id_id: silakan baca dokumentasi *package* yang gagal di-*install* (dalam contoh kode, ``SOME_PACKAGE``) untuk informasi mengenai cara meng-*install* pustaka-pustaka (*libraries*) yang dibutuhkan untuk kompilasi dari sumber. Sebagai contoh:
it_it: si consiglia di far riferimento alla documentazione del pacchetto la cui installazione non è andata a buon fine (nel codice di esempio, ``SOME_PACKAGE``) per ottenere informazioni su come installare le librerie necessarie per poter compilare dal sorgente. Per esempio:
ko_kr: 소스에서 컴파일하는 데 필요한 라이브러리를 설치하는 방법에 대한 정보는 설치에 실패한 패키지의 문서 (예제 코드``SOME_PACKAGE``) 를 확인하라. 예를 들면 다음과 같다.
pt_br: por favor verifique a documentação do pacote que não conseguiu instalar (no código de exemplo, ``SOME_PACKAGE``) para informações sobre como instalar as bibliotecas necessárias para compilar a partir da fonte. Por exemplo:
ta_in: தயவு செய்து நிறுவத் தவறிய தொகுப்பின் ஆவணங்களை சரிபார்க்கவும் (எடுத்துக்காட்டு code -டில், `` SOME_PACKAGE``) ஆரம்பத்திலிருந்து தொகுக்கத் தேவையான லைப்ரரிகளை எவ்வாறு நிறுவுவது என்பது குறித்த தகவலுக்கு. உதாரணத்திற்கு:
tr_tr: kaynaktan derlemek için gereken kitaplıkların nasıl kurulacağı hakkında bilgi için lütfen yüklenemeyen paketin belgelerine bakın (örnek kodda, ``SOME_PACKAGE``). Örneğin:
zh_tw: 請檢查是否無法安裝套件的文檔（在程式碼範例中， ``SOME_PACKAGE`` ），以取得如何安裝從來源編譯所需的程式庫的相關資訊。 例如：

source: ``cryptography``: https://cryptography.io/en/latest/installation/#building-cryptography-on-linux
es_mx: ``criptografía``: https://cryptography.io/en/latest/installation/#building-cryptography-on-linux
it_it: ``crittografia``: https://cryptography.io/en/latest/installation/#building-cryptography-on-linux
ko_kr: ``암호법``: https://cryptography.io/en/latest/installation/#building-cryptography-on-linux
pt_br: ``criptografia``: https://cryptography.io/en/latest/installation/#building-cryptography-on-linux
tr_tr: ``kriptografi``: https://cryptography.io/en/latest/installation/#building-cryptography-on-linux

source: **Q: Why do I receive the error message** ``AttributeError: QuantumCircuit object has no attribute save_state`` **when using ``save_*``method on a circuit?**
de_de: **F: Warum erhalte ich die Fehlermeldung** ``AttributeError: QuantumCircuit Objekt hat kein Attribut save_state`` **wenn ich ``save_*``method auf einem Schaltkreis verwende?**
es_un: **P: ¿Por qué recibo el mensaje de error** ``AttributeError: QuantumCircuit object has no attribute save_state`` **al usar el método ``save_*`` en un circuito?**

source: **A:** The ``save_*`` instructions are part of Qiskit Aer project, a high performance simulator for quantum circuits. These instructions do not exist outside of Qiskit Aer and are added dynamically to the :class:`~.QuantumCircuit` class by Qiskit Aer on import. If you would like to use these instructions you must first ensure that you have imported ``qiskit_aer`` in your program before trying to call these methods. You can refer to :mod:`qiskit_aer.library` for the details of these custom instructions included with Qiskit Aer.
de_de: **A:** Die ``save_*`` Anweisungen sind Teil des Qiskit Aer Projektes, eines Hochleistungssimulators für Quantenkreise. Diese Anweisungen existieren nicht außerhalb von Qiskit Aer und werden beim Import dynamisch zur :class:`~.QuantumCircuit` Klasse von Qiskit Aer hinzugefügt. Wenn du diese Anweisungen verwenden möchtest, musst du zuerst sicherstellen, dass du ``qiskit_aer`` in dein Programm importiert hast, bevor du versuchst, diese Methoden aufzurufen. Du kannst dich auf :mod:`qiskit_aer.library` für die Details dieser benutzerdefinierten Anweisungen beziehen, die Qiskit Aer enthält.
es_un: **R:** Las instrucciones ``save_*`` son parte del proyecto Qiskit Aer, un simulador de alto rendimiento para circuitos cuánticos. Estas instrucciones no existen fuera de Qiskit Aer y son agregadas dinámicamente a la clase :class:`~.QuantumCircuit` por Qiskit Aer al importarlo. Si deseas utilizar estas instrucciones, primero debe asegurarse de haber importado ``qiskit_aer`` en tu programa antes de intentar llamar a estos métodos. Puedes consultar :mod:`qiskit_aer.library` para conocer los detalles de estas instrucciones personalizadas incluidas con Qiskit Aer.

source: **A:** If you used ``pip install qiskit`` and set up your virtual environment in Anaconda, then you may experience this error when you run a tutorial in Jupyter Notebook. If you have not installed Qiskit or set up your virtual environment, you can follow the :ref:`installation` steps.
de_de: ** A: ** Wenn Sie ``pip install qiskit`` verwendet und Ihre virtuelle Umgebung in Anaconda eingerichtet haben, kann dieser Fehler auftreten, falls Sie ein Tutorial in Jupyter-Notebook ausführen. Wenn Sie Qiskit nicht installiert oder Ihre virtuelle Umgebung nicht eingerichtet haben, können Sie die Installationsschritte <https://qiskit.org/documentation/install.html#install> ausführen.
es_un: **R:** Si usaste ``pip install qiskit`` y preparaste tu entorno virtual en Anaconda, entonces puedes encontrar este error cuando ejecutas un tutorial en Jupyter Notebook. Si no has instalado Qiskit o no has configurado tu entorno virtual, puedes seguir los pasos de :ref:`installation`.

source: **A:** Qiskit depends on a number of other open source Python packages, which are automatically installed when doing ``pip install qiskit``. Depending on your system's platform and Python version, is it possible that a particular package does not provide pre-built binaries for your system. You can refer to :ref:`platform_support` for a list of platforms supported by Qiskit, some of which may need an extra compiler. In cases where there are no precompiled binaries available ``pip`` will attempt to compile the package from source, which in turn might require some extra dependencies that need to be installed manually.
de_de: ** A: ** Qiskit ist von einer Reihe anderer Open-Source-Python-Pakete abhängig, die automatisch installiert werden, wenn ``pip install qiskit`` ausgeführt wird. Abhängig von der Plattform Ihres Systems und der Python-Version ist es möglich, dass ein bestimmtes Paket kein vorgefertigtes Binär Image für Ihr System bereitstellt. Unter :ref:`platform_support` finden Sie eine Liste der von Qiskit unterstützten Plattformen, von denen einige möglicherweise einen zusätzlichen Compiler benötigen. In Fällen, in denen keine vorkompilierten Binärdateien verfügbar sind versucht ``pip``, das Paket aus dem Quellcode zu kompilieren. In diesem Fall sind möglicherweise einige zusätzliche Abhängigkeiten erforderlich, die manuell installiert werden müssen.

source: please check the documentation of the package that failed to install (in the example code, ``SOME_PACKAGE``) for information on how to install the libraries needed for compiling from source.
de_de: bitte überprüfen Sie die Dokumentation des Pakets, das nicht installiert wurde (im Beispiel-Code, ``SOME_PACKAGE``) um Informationen darüber zu erhalten, wie die Bibliotheken installiert werden können, die zum Kompilieren aus dem Quellcode benötigt werden.
es_un: por favor revisa la documentación del paquete que no se pudo instalar (en el código ejemplo, ``SOME_PACKAGE``) y busca información de cómo instalar las librerías necesarias para compilar desde el código fuente.

source: **A:** Qiskit depends on a number of other open source Python packages, which are automatically installed when doing ``pip install qiskit``. Depending on your system's platform and Python version, it is possible that a particular package does not provide pre-built binaries for your system. You can refer to :ref:`platform_support` for a list of platforms supported by Qiskit, some of which may need an extra compiler. In cases where there are no precompiled binaries available ``pip`` will attempt to compile the package from source, which in turn might require some extra dependencies that need to be installed manually.
es_un: **R:** Qiskit depende de varios paquetes de código abierto de Python, los cuales son instalados automáticamente cuando se ejecuta ``pip install qiskit``. Dependiendo de la plataforma de tu sistema y de la versión de Python, es posible que un paquete en particular no proporcione binarios preconstruidos para tu sistema. Puedes consultar :ref:`platform_support` para obtener una lista de plataformas compatibles con Qiskit, algunas de las cuales pueden necesitar un compilador adicional. En los casos en los que no haya binarios precompilados disponibles, ``pip`` intentará compilar el paquete desde la fuente, lo que a su vez puede requerir algunas dependencias adicionales que deben instalarse manualmente.
