Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: bn_bn, de_de, es_mx, es_un, fr_fr, id_id, it_it, ko_kr, pt_br, ta_in, tr_tr, zh_tw

source: Frequently Asked Questions
bn_bn: সচরাচর জানতে চাওয়া প্রশ্ন
de_de: Häufig gestellte Fragen
es_mx: Preguntas frecuentes
es_un: Preguntas Frecuentes
fr_fr: Questions fréquentes
id_id: Pertanyaan yang Sering Ditanyakan
it_it: Domande Frequenti
ko_kr: 자주 묻는 질문
pt_br: Perguntas Frequentes
ta_in: அடிக்கடி கேட்கப்படும் கேள்விகள்
tr_tr: Sıkça Sorulan Sorular
zh_tw: 常見問答

source: **Q: How should I cite Qiskit in my research?**
bn_bn: ** প্রশ্নঃ আমার গবেষণায় আমি কিভাবে Qiskit উদ্ধৃত করব? **
de_de: **Frage: Wie zitiere ich Qiskit in wissenschaftlichen Arbeiten?**
es_mx: **P: ¿Cómo debo citar Qiskit en mi investigación?**
es_un: **P: ¿Cómo debo citar Qiskit en mi investigación?**
fr_fr: **Q: Comment citer Qiskit dans mes recherches ?**
id_id: **Q: Bagaimana saya harus mengutip Qiskit dalam penelitian saya?**
it_it: **Q: Come dovrei citare Qiskit nel mio lavoro di ricerca?**
ko_kr: **질문: 연구에서 키스킷을 어떻게 인용 해야 합니까?**
pt_br: **P: Como devo citar Qiskit na minha pesquisa?**
ta_in: **Q: எனது ஆராய்ச்சியில் Qiskit-டை எவ்வாறு மேற்கோள் காட்ட வேண்டும்?**
tr_tr: **S: Qiskit'e araştırmalarımda nasıl alıntı yapmalıyım?**
zh_tw: **Q：我的研究中該如何引用 Qiskit ？**

source: **A:** Please cite Qiskit by using the included `BibTeX file <https://raw.githubusercontent.com/Qiskit/qiskit/master/Qiskit.bib>`__.
bn_bn: ** উত্তরঃ ** দয়া করে সংযুক্ত `BibTeX file <https://raw.githubusercontent.com/Qiskit/qiskit/master/Qiskit.bib>`__ ব্যবহার করে Qiskit উদ্ধৃত করুন।
de_de: **Antwort:** Zum Zitieren von Qiskit verwenden Sie bitte die angegebene `BibTeX-Datei <https://raw.githubusercontent.com/Qiskit/qiskit/master/Qiskit.bib>`__.
es_mx: **R:** Por favor citar Qiskit usando el archivo `BibTeX <https://raw.githubusercontent.com/Qiskit/qiskit/master/Qiskit.bib>`__.
es_un: **R:** Por favor cita Qiskit usando el `archivo BibTeX <https://raw.githubusercontent.com/Qiskit/qiskit/master/Qiskit.bib>`__.
fr_fr: **A:** Citez Qiskit en incluant ceci `BibTeX file <https://raw.githubusercontent.com/Qiskit/qiskit/master/Qiskit.bib>`__.
id_id: **A:** Silakan mengutip Qiskit menggunakan `berkas BibTeX <https://raw.githubusercontent.com/Qiskit/qiskit/master/Qiskit.bib>`__ yang disertakan.
it_it: **A:** Per favore, puoi citare Qiskit utilizzando `BibTeX file <https://raw.githubusercontent.com/Qiskit/qiskit/master/Qiskit.bib>`__.
ko_kr: **답변:** 여기 있는파일을 사용하여 Qiskit을 인용하십시오`BibTeX file <https://raw.githubusercontent.com/Qiskit/qiskit/master/Qiskit.bib>`__.
pt_br: **R:** Por favor, cite o Qiskit usando o `arquivo BibTeX <https://raw.githubusercontent.com/Qiskit/qiskit/master/Qiskit.bib>`__.
ta_in: **A:** தயவு செய்து இந்த இணைப்பை `BibTeX file <https://raw.githubusercontent.com/Qiskit/qiskit/master/Qiskit.bib>` __ ஐப் பயன்படுத்தி Qiskit-டை மேற்கோள் காட்டுங்கள்.
tr_tr: **C:** Qiskit'e lütfen ekli olan `BibTeX dosyasını <https://raw.githubusercontent.com/Qiskit/qiskit/master/Qiskit.bib>`__ kullanarak alıntı yapın.
zh_tw: **A：** 請使用包含的 `BibTeX 檔 <https://raw.githubusercontent.com/Qiskit/qiskit/master/Qiskit.bib>`__ 來列舉 Qiskit 。

source: **Q: Why do I receive the error message** ``Error: Instance of QuantumCircuit has no member`` **when adding gates to a circuit?**
bn_bn: ** প্রশ্নঃ বর্তনীতে (সার্কিটে) যুক্তিদ্বার (গেইট) সংযুক্ত করার সময় আমাকে কেন এই ** ``Error: Instance of QuantumCircuit has no member`` ** ত্রুটি দেখাচ্ছে? **
es_mx: **P: ¿Por qué aparece el mensaje de error** ``Error: Instance of QuantumCircuit has no member`` **cuando agrego compuertas a un circuito?**
fr_fr: **Q: Pourquoi ai-je ce message d'erreur :** ``Error: Instance of QuantumCircuit has no member`` **lorsque je rajoute des portes à un circuit ?**
id_id: **Q: Mengapa saya mendapat pesan error** ``Error: Instance of QuantumCircuit has no member`` **ketika menambahkan gerbang ke sebuah sirkuit?**
it_it: **Q: Perchè ho ricevuto il messaggio di errore** ``Error: Instance of QuantumCircuit has no member`` **aggiungendo i gate al circuito?**
ko_kr: **질문: 게이트를 회로에 추가할때 ** ``에러: 양자회로에 인스턴스 멤버가 없다.`` **같은 에러 메세지를 받나요? **
pt_br: **P: Por que recebo a mensagem de erro** ``Erro: Instance of QuantumCircuit has no member`` **quando adiciono portões a um circuito?**
ta_in: ** Q: ஒரு circuit-இல் gate-களைச் சேர்க்கும்போது, நான் ஏன் பிழை செய்தியைப் பெறுகிறேன்? **``Error: Instance of QuantumCircuit has no member``**
tr_tr: **S: Neden bir devreye kapı eklerken ``Error: Instance of QuantumCircuit has no member`` hata mesajını alıyorum?**
zh_tw: **問：為什麼在向電路添加門時會收到錯誤消息** ``Error: Instance of QuantumCircuit has no member`` **？

source: **A:** This is a pylint error, which is a Linter for Python. Linters analyze code for potential errors, and they throw errors when they find potentially erroneous code. However, this error should not prevent your code from compiling or running, so there is no need to worry. The error message can be disabled by adding the following line above the code that is causing the error:
bn_bn: ** উত্তরঃ ** এটি একটি pylint ত্রুটি, যা পাইথনের একটি লিন্টার। লিন্টার সম্ভাব্য ত্রুটি বের করার জন্য কোড পর্যালোচনা করে, এবং ত্রুটি সংবাদ দেখায় যখন সম্ভাব্য কিছু খুঁজে পায়। যাহোক, এই ত্রুটি আপনার কোড কম্পাইল বা রান করতে বাধা দিবেনা, তাই চিন্তার কোনো কারণ নেই। এই ত্রুটি সংবাদটি নিচে উল্লিখিত লাইনগুলো কোডে সংযুক্ত করে বন্ধ করে রাখা যেতে পারে।
es_mx: **R:** Este es un error de pylint, el cual es un Linter para Python. Los Linters analizan código buscando errores potenciales y muestran errores cuando encuentran código potencialmente erróneo. Sin embargo, este error no previene que tu código se compile o ejecute, así que no debes preocuparte. El mensaje se puede desactivar agregando la siguiente línea de código arriba del código que causó el error:
fr_fr: **A:** Il s'agit d'une erreur 'pylint', c'est à dire un 'Linter' pour 'Python'. Les 'Linters' analysent lee programmes pour trouver des erreurs potentielles, et ils générent des erreurs lorsqu'ils trouvent un programme potentiellement incorrect. Cependant, cette erreur ne devrait pas enpècher votre programme d'être compilé et de fonctionner, donc il n'y a pas de raison de vous inquiéter. Le message d'erreur peut être désactivé en rajoutant la ligne suivante juste avant le programme/code qui génère l'erreur:
id_id: **A:** Ini adalah error dari Pylint yang merupakan sebuah Linter untuk Python. Linter menganalisis kode untuk mencari kemungkinan kesalahan, dan akan melemparkan sebuah error ketika menemukan kode yang berpotensi menimbulkan kesalahan. Namun, error tersebut seharusnya tidak membuat kode Anda tidak dapat dikompilasi atau dijalankan, sehingga tidak ada yang perlu dikhawatirkan. Pesan error tersebut dapat dinonaktifkan dengan menambahkan baris berikut di atas kode yang menimbulkan error:
it_it: **A:** Questo è un errore di pylint, che è un Linter di Python. I linter cercano potenziali errori nel codice e generano un messaggio di errore quando trovano del codice potenzialmente errato. Tuttavia, questo errore non dovrebbe impedire la compilazione o l'esecuzione del codice, quindi non c'è bisogno di preoccuparsi. Il messaggio di errore può essere disabilitato aggiungendo la seguente riga sopra il codice che sta causando l'errore:
ko_kr: **답변:** 이것은 pylint (파이선 입력 에러 보정툴) 에러이다. Linter는 잠재적 오류에 대한 코드를 분석하고 잠재적으로 잘못된 코드를 발견하면 오류를 발생시킨다. 그러나 이 오류로 인해 코드가 컴파일되거나 실행되지 않는 일은 없으니 걱정할 필요가 없다. 오류를 일으키는 코드 위에 다음 줄을 추가하여 오류 메시지를 비활성화 할 수 있다.
pt_br: **R:** Este é um erro de pylint, que é um Linter para Python. Os Linters analisam o código para possíveis erros e retornam erros quando eles encontram códigos potencialmente errados. No entanto, esse erro não deve impedir que seu código seja compilado ou executado, então não há necessidade de se preocupar. A mensagem de erro pode ser desativada adicionando a seguinte linha acima o código que está causando o erro:
ta_in: **A:** இது ஒரு பிளின்ட் பிழை, இது பைதான்-யின் ஒரு லின்டர். சாத்தியமான பிழைகளுக்கான code-டை லிண்டர்கள் பகுப்பாய்வு செய்கின்றன, தவறான code -டை கண்டு பிடிக்கும் போது பிழையைச் சுட்டிக்காட்டும். எனினும், இந்த பிழை உங்கள் code -டை கம்பிளிங் அல்லது இயங்குதலிலிருந்து தடுக்க இயலாது, அதனால் கவலைப்பட வேண்டிய தேவை இல்லை. பிழை ஏற்படும் code -டை மேலே உள்ள பின்வரும் code -யில் சேர்த்தால் முடக்கப்படலாம்:
tr_tr: **C:** Bu bir Python Linteri olan pylint hatasıdır. Linterler potansiyel hatalar için kodu inceler ve hatalı olma ihtimali olan kod buldukları zaman hata verirler. Fakat endişelenmenize gerek yok, çünkü bu verdiği hata sizin kodunuzun derlenmesini veya çalışmasını engellemez. Aşağıdaki satırı hataya sebep olan kodun üstüne ekleyerek hata mesajını kapatabilirsiniz:
zh_tw: **A：** 這是一個pylint的錯誤，意指Linter for Python。Linters 分析潛在錯誤的程式碼，並在發現可能錯誤的程式碼時擲出錯誤。 不過，此錯誤不應阻止您的程式碼編譯或執行，因此不需要擔心。 您可以在造成錯誤的程式碼上方新增下列行，以停用錯誤訊息：

source: **Q: Why do my results from real devices differ from my results from the simulator?**
bn_bn: ** প্রশ্নঃ আসল কোয়ান্টাম যন্ত্রের সাথে আমার সিমুলেটরেরে ফলাফলে কেন পার্থক্য দেখা যাচ্ছে? **
de_de: ** F: Warum unterscheiden sich meine Ergebnisse auf einem echten Quanten-Gerät von den auf dem Simulator? **
es_mx: **P: ¿Por qué mis resultados de dispositivos reales difieren de los que entrega el simulador?**
es_un: **P: ¿Por qué mis resultados de dispositivos reales difieren de los que entrega el simulador?**
fr_fr: **Q: Pourquoi est-ce que mes résultats sur des systèmes réèls diffèrent de ceux du simulateur ?**
id_id: **Q: Mengapa hasil saya pada perangkat nyata berbeda dengan hasil saya pada simulator?**
it_it: **Q: Perchè i risultati che ottengo dai dispositivi reali sono differenti da quelli che ottengo utilizzando il simulatore?**
ko_kr: **질문: 실제 장치의 결과가 시뮬레이터의 결과와 다른 이유는 무엇인가?**
pt_br: **P: Por que meus resultados de dispositivos reais diferem dos meus resultados do simulador?**
ta_in: **Q: ஏன் உண்மையான சாதனங்களிலிருந்து வரும் எனது முடிவுகளானது சிமுலேட்டரிலிருந்து வரும் எனது முடிவுகளிலிருந்து வேறுபடுகின்றன?**
tr_tr: **S: Neden gerçek cihazlardan aldığım sonuçlar simülatördeki sonuçlarımdan farklı?**
zh_tw: **問：為什麼我的實際裝置的結果與模擬器的結果不同？**

source: **A:** The simulator runs jobs as though is was in an ideal environment; one without noise or decoherence. However, when jobs are run on the real devices there is noise from the environment and decoherence, which causes the qubits to behave differently than what is intended.
bn_bn: ** উত্তরঃ ** সিমুলেটর এমনভাবে কাজ (টাস্ক/ জব) রান করে যেন এটি সত্যিকার আদর্শ কোয়ান্টাম পরিবেশে চলছে; কোনো ধরণের দূষণ বা ত্রুটি এবং অসমদশা (ডিকোহেরেন্স) ছাড়াই। যাহোক, এইসব কাজ (টাস্ক/ জব) যখন সত্যিকার মেশিনে চালানো হয় তখন কর্মপরিবেশ থেকে দূষণ বা ত্রুটি এবং অসমদশা (ডিকোহেরেন্স) যুক্ত হয়, যে কারণে কিউবিটগুলো আদর্শ দশা থেকে ভিন্নভাবে কাজ করে।
de_de: ** A: ** Der Simulator führt Jobs so aus als ob er sich in einer idealen Umgebung befindet, ohne Rauschen oder Dekohärenz. Wenn Jobs jedoch auf den realen Geräten ausgeführt werden, treten Rauschen durch den Versuchsaufbau und Dekohärenz auf, was dazu führt, dass sich die Qubits anders verhalten als beabsichtigt.
es_mx: **R:** El simulador ejecuta tareas asumiendo un entorno ideal: sin ruido y coherente. Sin embargo, cuando las tareas se ejecutan en dispositivos reales existe ruido del ambiente y decoherencia que causa que los qubits se comporten diferentemente al la forma esperada.
es_un: **R:** El simulador ejecuta trabajos (jobs) como si estuviera en un entorno ideal; uno sin ruido ni decoherencia. Sin embargo, cuando los trabajos se ejecutan en los dispositivos reales, hay ruido del entorno y decoherencia, lo que hace que los qubits se comporten de manera diferente a la prevista.
fr_fr: **A:** Le simulateur effectue les calculs dans un environnement idéal; sans bruit ni décohérence. Cependant, lorsque les taches sont exécutées sur de véritables systèmes, il y a du bruit provenant de l'environnement et une décohérence, qui font que les qbits se comportent différemment par rapport à ce qui était prévu.
id_id: **A:** Simulator menjalankan pekerjaan dengan seolah-olah pada lingkungan yang ideal; tidak terdapat derau (*noise*) atau dekoherensi. Namun, ketiak pekerjaan dijalankan pada perangkat nyata, terdapat derau dan dekoherensi yang menyebabkan perilaku qubit berbeda dari apa yang diinginkan.
it_it: **A:** Il simulatore esegue i job come se fosse un ambiente ideale; un ambiente senza rumore o decoerenza. Tuttavia, quando i job vengono eseguiti sui dispositivi reali sono presenti sia il rumore dell'ambiente che la decoerenza, che fanno sì che i qubit si comportino in modo diverso da quanto previsto.
ko_kr: **답변:** 시뮬레이터는 노이즈가 없고 결잃음이 없는 이상적인 환경에 있는 것처럼 작업을 실행한다. 그러나 실제 장치에서 작업을 실행할 때는 환경 및 결잃음으로 노이즈가 발생하여 큐비트가 의도한 것과 다르게 동작한다. The simulator runs jobs as though is was in an ideal environment; one without noise or decoherence. However, when jobs are run on the real devices there is noise from the environment and decoherence, which causes the qubits to behave differently than what is intended.
pt_br: **R:** O simulador executa trabalhos como se estivesse em um ambiente ideal; sem ruído ou decoerência. No entanto, quando se geram tarefas em aparelhos reais, há ruído proveniente do ambiente e da decoerência, que faz com que os qubits se comportem de modo diferente do pretendido.
ta_in: **A:** ஒரு சிறந்த சூழலில் இருப்பதைப் போல சிமுலேட்டர் வேலைகளை இயக்குகிறது; அதுவும் சத்தம் அல்லது டிகோஹரன்ஸ் இல்லாமல் இருக்கிறது. இருப்பினும், உண்மையான சாதனங்களில் வேலைகள் இயங்கும் போது சுற்றுச்சூழல் இருந்து சத்தம் மற்றும் டிகோஹெரன்ஸ் ஏற்படுகிறது, இது க்யூபிட்ஸ்கள் நோக்கத்தை விட வித்தியாசமாக நடந்து கொள்ள காரணமாகிறது.
tr_tr: **C:** Simülator işleri gürültü veya eşevresizlik olmayan, ideal bir ortamdaymış gibi çalıştırır. Fakat işler gerçek cihazlarda çalıştırıldığı zaman ortamdan kaynaklanan gürültü ve eşevresizlik bulunur, bu da kübitlerin istenenden daha farklı davranmasına sebep olur.
zh_tw: **A：** 這個模擬器在執行工作猶如它在一個理想環境中；此不含雜訊或退相干。 然而，當工作在實際裝置上執行時，會有來自環境和 退相干的雜訊，這會導致量子位元的行為方式與預期的不同。

source: **Q: Why do I receive the error message,** ``No Module 'qiskit'`` **when using Jupyter Notebook?**
bn_bn: ** প্রশ্নঃ আমি কেন জুপিটার নোটবুক ব্যবহার করার সময় এই ** ``No Module 'qiskit'`` ** ত্রুটি দেখতে পাচ্ছি? **
de_de: ** F: Warum erhalte ich bei Verwendung von Jupyter-Notebook die Fehlermeldung ** `` No Module 'qiskit'`` **? **
es_mx: **P: ¿Por qué recibo el mensaje de error,** ``No Module 'qiskit'`` **cuando uso un Jupyter Notebook?**
es_un: **P: ¿Por qué recibo el mensaje de error,** ``No Module 'qiskit'`` **cuando uso un Jupyter Notebook?**
fr_fr: **Q : Pourquoi est-ce que je reçois le message d'erreur,** ``No Module 'qiskit'`` **en utilisant Jupyter Notebook ?**
id_id: **Q: Mengapa saya mendapat pesan error,** ``No Module 'qiskit'`` **ketika menggunakan Jupyter Notebook?**
it_it: **Q: Perchè ricevo il messaggio di errore,** ``No Module 'qiskit'`` **quando utilizzo il Jupyter notebook?**
ko_kr: **질문: 주피터 노트북을 사용할때** ``키스킷 모듈이 없다.'`` ** 같은 에러 메시지를 받는 이유는? **
pt_br: **P: Por que recebo a mensagem de erro,** ``No Moduloe'qiskit'`` **quando uso o Notebook do Jupyter?**
ta_in: **Q: பிழை செய்தியை நான் ஏன் பெறுகிறேன்,** ``No Module 'qiskit'`` **ஜூபிட்டர் நோட்புக்கைப் பயன்படுத்தும் போது**
tr_tr: **S: Neden Jupyter Notebook kullanırken** ``No Module 'qiskit'`` **hata mesajını alıyorum?**
zh_tw: **Q：為什麼在使用 Jupyter Notebook時，我收到錯誤訊息 ** ` ` ` No Module 'qiskit'` ` `

source: **A:** If you used ``pip install qiskit`` and set up your virtual environment in Anaconda, then you may experience this error when you run a tutorial in Jupyter Notebook. If you have not installed Qiskit or set up your virtual environment, you can follow the `installation steps <https://qiskit.org/documentation/install.html#install>`__.
bn_bn: ** উত্তরঃ ** আপনি যদি ``pip install qiskit`` ব্যবহার করে থাকেন এবং আপনার অ্যানাকোন্ডার কৃত্রিম কর্মপরিবেশসমূহ তৈরি করে থাকেন তবে আপনি জুপিটার নোটবুকে পাঠসমূহ (টিউটোরিয়াল) বা টিউটোরিয়ালসমূহ রান করার সময় এই ত্রুটি প্রত্যক্ষ করবেন। আর আপনি যদি তা না করে থাকেন, তবে আপনি এটা অনুসরণ করতে পারেন `installation steps <https://qiskit.org/documentation/install.html#install>`__.
es_mx: **R:** Si usaste ``pip install qiskit`` y preparaste tu entorno virtual en Anaconda, entonces puedes encontrar este error cuando ejecutas un tutorial en Jupyter Notebook. Si no has instalado Qiskit o no has configurado tu entorno virtual puedes seguir los `pasos de instalación <https://qiskit.org/documentation/install.html#install>`__.
fr_fr: **A: ** Si vous avez utilisé ` ` pip install qiskit ` ` et configuré votre environnement virtuel dans Anaconda, alors vous pouvez rencontrer cette erreur lorsque vous exécutez un tutoriel dans le bloc-notes Jupyter. Si vous n'avez pas installé Qiskit ou configuré votre environnement virtuel, vous pouvez suivre les étapes d'installation <https://qiskit.org/documentation/install.html#install>` __.
id_id: **A:** Jika Anda menggunakan ``pip install qiskit`` dan mengatur lingkungan virtual Anda di Anaconda, Anda mungkin akan mendapatkan error ini ketika menjalankan tutorial di Jupyter Notebook. Jika Anda belum menginstall Qiskit atau mengatur lingkungan virtual Anda, Anda dapat mengikuti `langkah-langkah instalasi <https://qiskit.org/documentation/install.html#install>`__.
it_it: **A:** Se hai utilizzato ``pip install qiskit`` e configurato il tuo ambiente virtuale in Anaconda, allora potresti ricevere questo errore quando esegui un tutorial in notebook Jupyter. Se non hai installato Qiskit o configurato il tuo ambiente virtuale, puoi seguire i `passi di installazione <https://qiskit.org/documentation/install.html#install>`__.
ko_kr: **답변:** 만일 당신이 아나콘다를 통해 ``pip install qiskit`` 을 사용하여 가상 환경을 설정하고 주피터 노트북으로 사용지침서를 실행할때 다음과 같은 에러를 만날 수 있다. 만일 당신이 키스킷을 설치하지 않았거나 가상환경을 설정하지 않았다면 `설치 순서<https://qiskit.org/documentation/install.html#install>`__를 따라가라.
pt_br: **R:** Se você usou ``pip install qiskit`` e configurou seu ambiente virtual na Anaconda, então você pode experimentar este erro quando executar um tutorial no Notebook do Jupyter. Se você não instalou o Qiskit ou configurou seu ambiente virtual, você pode seguir o `passos de instalação <https://qiskit.org/documentation/install.html#install>`__.
ta_in: **A:** நீங்கள் ``pip install qiskit``-ஐப் பயன்படுத்தி, உங்கள் மெய்நிகர் சூழலை அனகோண்டாவில் அமைத்து, ஜூபிட்டர் நோட்புக்கில் ஒரு டுடோரியலை இயக்கும்போது அ ந்த பிழையை நீங்கள் சரிபார்த்தல் மற்றும் இயக்கும் அனுபவத்தை பெறலாம். நீங்கள் Qiskit -டை நிறுவவில்லை அல்லது உங்கள் மெய்நிகர் சூழலை அமைக்கவில்லை என்றால், நீங்கள் `இன்ஸ்டால்லட்டின் முறைகளை பின்பற்றலாம் <https://qiskit.org/documentation/install.html#install>`__.
tr_tr: **C:** Eğer ``pip install qiskit`` komutunu kullandıysanız ve sanal ortamınızı Anaconda üzerinde kurduysanız, bir eğitim dosyasını Jupyter Notebook'ta çalıştırırken bu hatayı alabilirsiniz. Eğer Qiskit'i yüklemediyseniz veya sanal ortam oluşturmadıysanız `yükleme adımlarını <https://qiskit.org/documentation/install.html#install>`__ takip edebilirsiniz.
zh_tw: **A：** 如果您使用 ``pip install qiskit`` ，並在 Anaconda 中設定您的虛擬環境，則在 Jupyter Notebook 中執行指導教學時，您可能會遇到此錯誤。 如果您尚未安裝 Qiskit 或設定虛擬環境，則可以遵循 `安裝步驟 <https://qiskit.org/documentation/install.html#install>`__。
