Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/getting_started.po
Languages: de_de, es_mx, es_un, fr_fr, id_id, it_it, ja_jp, pl_pl, ta_in, te_in, tr_tr, vi_vn, zh_cn

source: After this, the steps to install Aer depend on which operating system you are using. Since Aer is a compiled C++ program with a Python interface, there are non-Python dependencies for building the Aer binary which can't be installed universally depending on operating system.
es_un: Después de esto, los pasos para instalar Aer dependen del sistema operativo que estés utilizando. Dado que Aer es un programa en C++ compilado con una interfaz en Python, existen dependencias externas a Python para construir el binario de Aer que no se pueden instalar universalmente dependiendo del sistema operativo.
ja_jp: この後、Aerをインストールする手順は、使用しているオペレーティングシステムによって異なります。 AerはPythonインターフェイスを備えたコンパイル済みのC++プログラムであるため、オペレーティングシステムによっては、普遍的にインストールできないAerバイナリを構築するためのPython以外の依存関係があります。
ta_in: இதன் பிறகு, Aer ஐ நிறுவுவதற்கான படிகள் நீங்கள் எந்த இயங்கு தளத்தைப் பயன்படுத்துகிறீர்கள் என்பதைப் பொறுத்தது. Aer ஒரு பைத்தான் இடைமுகம் கொண்ட ஒரு தொகுக்கப்பட்ட C ++ நிரல் என்பதால், இயக்க முறைமையை சார்ந்து உலகளாவிய அளவில் நிறுவ முடியாது Aer பைனரி யை உருவாக்குதலுக்கான பைத்தான் அல்லாத சார்புகள் உள்ளன.

source: Install compiler requirements.
de_de: Compiler-Anforderungen installieren.
es_un: Instala los requerimientos del compilador.
fr_fr: Installez les pré-requis du compilateur.
ja_jp: コンパイラーの要件をインストールします。
pl_pl: Zainstaluj wymagania kompilatora.
ta_in: தொகு தேவைகளை நிறுவவும்.
te_in: కంపైలర్ అవసరాలను ఇన్‌స్టాల్ చేయండి.
tr_tr: Derleyici gereksinimlerini yükleyin.
vi_vn: Cài đặt các yêu cầu của trình biên dịch.

source: Building Aer requires a C++ compiler and development headers.
de_de: Das Kompilieren von Aer benötigt einen C++-Compiler und entsprechende Header-Dateien.
es_un: Construir Aer requiere un compilador de C++ y las cabeceras de desarrollo.
fr_fr: Le build d'Aer nécessite un compilateur C++ et les en-têtes de développement.
ja_jp: Aerの構築には、C++コンパイラーと開発ヘッダーが必要です。
pl_pl: Kompilacja Aer wymaga kompilatora języka C++ i nagłówków programistycznych.
ta_in: Aer ஐ உருவாக்க ஒரு C++ compiler மற்றும் development headers தேவைப்படுகிறது.
te_in: Aerని నిర్మించడానికి C++ కంపైలర్ మరియు డెవలప్‌మెంట్ హెడర్‌లు అవసరం.
tr_tr: Aer'i derlemek için bir C++ derleyicisi ve geliştirme başlıkları gerekir.

source: If you're using Fedora or an equivalent Linux distribution, install using:
de_de: Wenn Sie Fedora oder eine gleichwertige Linux-Distribution verwenden, installieren Sie mit:
es_un: Si estas usando Fedora o una distribución de Linux equivalente, instala usando:
fr_fr: Si vous utilisez Fedora ou une distribution Linux équivalente, installez à l'aide de :
ja_jp: Fedoraまたは同等のLinuxディストリビューションを使用している場合は、以下の方法でインストールします。
pl_pl: Jeśli używasz systemu Fedora lub równoważnej dystrybucji Linux, zainstaluj przy użyciu:
ta_in: நீங்கள் Fedora அல்லது அதற்கு சமமான லினக்ஸ் விநியோகத்தை பயன்படுத்தினால், பின்வரும் பயன்படுத்தி நிறுவவும்:
te_in: మీరు Fedora లేదా దానికి సమానమైన Linux పంపిణీని ఉపయోగిస్తుంటే, దీన్ని ఉపయోగించి ఇన్‌స్టాల్ చేయండి:
tr_tr: Fedora veya ona eşdeğer bir Linux dağıtımı kullanıyorsanız aşağıdakileri kullanarak yükleyin:
vi_vn: Nếu bạn đang sử dụng Fedora hoặc một bản Linux tương đương, cài đặt bằng cách sử dụng:

source: For Ubuntu/Debian install it using:
de_de: Für Ubuntu/Debian installieren Sie es mit:
es_un: Para Ubuntu/Debian instálalo usando:
fr_fr: Pour Ubuntu/Debian, installez-le en utilisant :
ja_jp: Ubuntu/Debianの場合は、以下の方法でインストールします。
pl_pl: Dla systemu Ubuntu/Debian zainstaluj przy użyciu:
ta_in: உபுண்டு / டெபியன் அதை நிறுவ:
te_in: Ubuntu/Debian కోసం దీన్ని ఉపయోగించి ఇన్‌స్టాల్ చేయండి:
tr_tr: Ubuntu/Debian için şunu kullanarak kurun:
vi_vn: Cho Ubuntu/Debian, cài đặt bằng cách sử dụng:

source: Install OpenBLAS development headers.
de_de: Installieren Sie OpenBLAS Entwicklungs-Header.
es_un: Instala las cabeceras de desarrollo de OpenBLAS.
fr_fr: Installez les en-têtes de développement OpenBLAS.
ja_jp: OpenBLASの開発ヘッダーをインストールします。
pl_pl: Zainstaluj nagłówki programistyczne OpenBLAS.
ta_in: OpenBLAS மேம்பாட்டு தலைப்புகளை நிறுவு.
te_in: OpenBLAS డెవలప్‌మెంట్ హెడర్‌లను ఇన్‌స్టాల్ చేయండి.
tr_tr: OpenBLAS geliştirme başlıklarını kurun.

source: Install dependencies.
de_de: Abhängigkeiten installieren.
es_un: Instala las dependencias.
fr_fr: Installez les dépendances.
ja_jp: 依存関係をインストールします。
pl_pl: Zainstaluj zależności.
ta_in: சார்புகளை நிறுவவும்.
te_in: డిపెండెన్సీలను ఇన్‌స్టాల్ చేయండి.
tr_tr: Bağımlılıkları kurun.

source: To use the `Clang <https://clang.llvm.org/>`__ compiler on macOS, you need to install an extra library for supporting `OpenMP <https://www.openmp.org/>`__. You can use `brew <https://brew.sh/>`__ to install this and other dependencies.
de_de: Um den `Clang <https://clang.llvm.org/>`__ Compiler auf macOS zu verwenden, benötigt man eine separate Bibliothek, welche `OpenMP <https://www.openmp.org/>`__ unterstützt. Diese und andere Abhängigkeiten kann man mit `brew <https://brew.sh/>`__ installieren.
es_un: Para usar el compilador `Clang <https://clang.llvm.org/>`__ en macOS, necesitas instalar una librería adicional para soportar `OpenMP <https://www.openmp.org/>`__. Puedes usar `brew <https://brew.sh/>`__ para instalar esta y otras dependencias.
fr_fr: Pour utiliser le compilateur `Clang <https://clang.llvm.org/>` __ sur macOS, vous devez installer une bibliothèque supplémentaire pour le support `OpenMP <https://www.openmp.org/>` __. Vous pouvez utiliser `brew <https://brew.sh/>` __ pour installer cette dépendance et d'autres dépendances.
ja_jp: macOSで `Clang <https://clang.llvm.org/>`__ コンパイラーを使用するには、`OpenMP <https://www.openmp.org/>`__ をサポートするための追加ライブラリーをインストールする必要があります。`brew <https://brew.sh/>`__ を使って、このライブラリーとその他の依存関係をインストールすることができます。
pl_pl: Aby użyć kompilatora `Clang <https://clang.llvm.org/>`__ na macOS, zainstaluj dodatkową bibliotekę do obsługi `OpenMP <https://www.openmp.org/>`__. Możesz użyć `brew <https://brew.sh/>`__ do zainstalowania tej i innych zależności.
ta_in: MacOS இல் `Clang <https://clang.llvm.org/>`__ கம்பைலரை பயன்படுத்த, `OpenMP <https://www.openmp.org/>`__ ஐ ஆதரிக்க நீங்கள் ஒரு கூடுதல் நூலகத்தை நிறுவ வேண்டும். இதையும் மற்ற சார்புகளையும் நிறுவ நீங்கள் `brew <https://brew.sh/>`__ ஐ பயன்படுத்தலாம்.
te_in: MacOSలో `Clang <https://clang.llvm.org/>`__ కంపైలర్‌ని ఉపయోగించడానికి, మీరు `OpenMP <https://www.openmp.org/>`__కి మద్దతు ఇవ్వడానికి అదనపు లైబ్రరీని ఇన్‌స్టాల్ చేయాలి. దీన్ని మరియు ఇతర డిపెండెన్సీలను ఇన్‌స్టాల్ చేయడానికి మీరు `brew <https://brew.sh/>`__ని ఉపయోగించవచ్చు.
tr_tr: MacOS üzerinde `Clang <https://clang.llvm.org/>`__ derleyicisini kullanmak için `OpenMP <https://www.openmp.org/>`__'yi destekleyen fazladan bir kitaplık yüklemeniz gerekir. Bunu ve diğer bağımlılıkları yüklemek için `brew <https://brew.sh/>`__ kullanabilirsiniz.
vi_vn: Để sử dụng `Clang <https://clang.llvm.org/>`__ trình biên dịch trên macOS, bạn cần phải tải thêm thư viện hỗ trợ `OpenMP <https://www.openmp.org/>`__. Bạn có thể sử dụng `brew <https://brew.sh/>`__ để tải nó và các dependencies khác.

source: Then install a BLAS implementation; `OpenBLAS <https://www.openblas.net/>`__ is the default choice.
de_de: Installieren Sie dann eine BLAS-Implementierung; `OpenBLAS <https://www.openblas.net/>`__ ist die Standardauswahl.
es_un: En seguida, instala una implementación de BLAS; `OpenBLAS <https://www.openblas.net/>`__ es la opción por defecto.
fr_fr: Installez ensuite une implémentation BLAS ; `OpenBLAS <https://www.openblas.net/>` __ est le choix par défaut.
ja_jp: そして、BLASの実装をインストールします。`OpenBLAS <https://www.openblas.net/>`__ がデフォルトの選択です。
pl_pl: Następnie zainstaluj implementację BLAS; domyślną jest `OpenBLAS <https://www.openblas.net/>` __.
ta_in: பின்னர் ஒரு BLAS செயல்படுத்தலை நிறுவவும்; `OpenBLAS <https://www.openblas.net/>`__ இயல்புநிலை தேர்வு.
te_in: ఆపై BLAS అమలును ఇన్‌స్టాల్ చేయండి; `OpenBLAS <https://www.openblas.net/>`__ అనేది డిఫాల్ట్ ఎంపిక.
tr_tr: Sonra bir BLAS uygulaması yükleyin; `OpenBLAS <https://www.openblas.net/>` __ varsayılan seçimdir.
vi_vn: Sau đó cài đặt một ứng dụng của BLAS; `OpenBLAS <https://www.openblas.net/>`__ là lựa chọn mặc định.

source: Next, install ``Xcode Command Line Tools``.
de_de: Als nächstes installiert man die ``Xcode Command Line Tools``.
es_un: Después, instala ``Xcode Command Line Tools``.
fr_fr: Ensuite, installez ``Xcode Command Line Tools``.
ja_jp: 次に、``Xcode Command Line Tools`` をインストールします。
pl_pl: Następnie zainstaluj ``Xcode Command Line Tools``.
ta_in: அடுத்து, ``Xcode Command Line Tools`` ஐ நிறுவவும்.
te_in: తర్వాత, ``Xcode Command Line Tools``ని ఇన్‌స్టాల్ చేయండి.
tr_tr: Daha sonra, ``Xcode Command Line Tools`` programını yükleyin.
vi_vn: Tiếp theo, cài đặt ``Xcode Command Line Tools``.

source: On Windows you need to use `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ or `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ to install all the dependencies.
es_un: En Windows debes usar `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ o `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ para instalar todas las dependencias.
ja_jp: Windowsでは、`Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ または `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ を使用して、すべての依存関係をインストールする必要があります。
ta_in: Windows இல் நீங்கள் பயன்படுத்த வேண்டும் `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ அல்லது `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ அனைத்து சார்புகளையும் நிறுவ.
vi_vn: Trên Windows bạn cần sử dụng `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ hoặc `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ để tải tất cả dependencies.

source: Qiskit Aer is a high performance simulator framework for quantum circuits. It provides `several backends <apidoc/aer_provider.html#simulator-backends>`__ to achieve different simulation goals.
de_de: Qiskit Aer ist ein Hochleistungs-Simulator-Framework für Quantenschaltkreise. Es bietet ` mehrere Backends <apidoc/aer_provider.html#simulator-backends>` __, um verschiedene Simulationsziele zu erreichen.
es_un: Qiskit Aer es un framework de simulación de alto rendimiento para circuitos cuánticos. Proporciona `distintos backends <apidoc/aer_provider.html#simulator-backends>`__ para lograr diferentes objetivos de simulación.
fr_fr: Qiskit Aer est un environnement de simulation haute performance pour les circuits quantiques. Il fournit `plusieurs backends <apidoc/aer_provider.html#simulator-backends>` __ pour atteindre différents objectifs de simulation.
ja_jp: Qiskit Aerは、量子回路のための高性能なシミュレータフレームワークです。様々なシミュレーションの目的を達成するために、いくつかの `バックエンド <apidoc/aer_provider.html#simulator-backends>`__ を提供しています。
pl_pl: Qiskit Aer jest wysokowydajnym środowiskiem symulatorów dla obwodów kwantowych. Wspiera `kilka platform <apidoc/aer_provider.html#simulator-backends>`__, umożliwiające budowanie różnych symulacji.
ta_in: Qiskit ஏர் குவாண்டம் சுற்றுகள் ஒரு உயர் செயல்திறன் சிமுலேட்டர் கட்டமைப்பு ஆகும். இது பல்வேறு `பல பின்நிலைகளை <apidoc/aer_provider.html#simulator-backends>`__ உருவகப்படுத்துதல் இலக்குகளை அடைய வழங்குகிறது.
te_in: Qiskit Aer అనేది క్వాంటం సర్క్యూట్‌ల కోసం అధిక పనితీరు గల సిమ్యులేటర్ ఫ్రేమ్‌వర్క్. ఇది విభిన్న సిములేషన్ లక్ష్యాలను సాధించడానికి `అనేక బ్యాకెండ్‌లను <apidoc/aer_provider.html#simulator-backends>`__ అందిస్తుంది.
tr_tr: Qiskit Aer kuantum devreleri için yüksek performanslı bir simülatör sistemidir ve farklı simülasyon hedeflerini başarıyla gerçekleştirmek için `birçok arka uç <apidoc/aer_provider.html#simulator-backends>`__ sağlar.

source: Build and install qiskit-aer directly
de_de: Qiskit-aer direkt erstellen und installieren
es_un: Construye e instala qiskit-aer directamente
fr_fr: Construire et installer qiskit-aer directement
ja_jp: qiskit-aerを直接ビルドしてインストールする
pl_pl: Bezpośrednia kompilacja i instalacja qiskit-aer
ta_in: நேரடியாக Qiskit-aer ஐ உருவாக்கி நிறுவவும்
te_in: qiskit-aerని నేరుగా నిర్మించి, ఇన్‌స్టాల్ చేయండి
tr_tr: Doğrudan qiskit-aer'i derle ve kur
vi_vn: Trực tiếp dựng và cài đặt qiskit-aer

source: If you have pip <19.0.0 installed and your environment doesn't require a custom build, run:
de_de: Hat man pip < 19.0.0 installiert und es wird keine benutzerdefinierte Konfiguration benötigt, kann man folgenden Befehl verwenden:
es_un: Si tienes pip <19.0.0 instalado y tu entorno no requiere una compilación personalizada, ejecuta:
fr_fr: Si pip <19.0.0 est installé et que votre environnement n'a pas besoin d'une génération personnalisée, exécutez:
ja_jp: pip <19.0.0がインストールされていて、カスタムビルドを必要としない環境であれば、以下を実行してください。
pl_pl: Jeśli masz zainstalowany pip wersję <19.0.0 a twoje środowisko nie wymaga niestandardowych elementów, uruchom:
ta_in: நீங்கள் பிப் <19.0.0 நிறுவப்பட்டிருந்தால், உங்கள் சூழலில் தனிப்பயன் உருவாக்கதேவையில்லை என்றால், இயக்கவும்:
te_in: మీరు pip <19.0.0 ఇన్‌స్టాల్ చేసి ఉంటే మరియు మీ పర్యావరణానికి అనుకూల బిల్డ్ అవసరం లేకుంటే, రన్ చేయండి:
tr_tr: Sisteminizde pip <19.0.0 kuruluysa ve ortamınız özel bir derleme gerektirmiyorsa, şunları çalıştırın:
vi_vn: Nếu bạn có phiên bản pip <19.0.0 và môi trường của bạn không yêu cầu một bản dưng tùy chỉnh, chạy:

source: This will both build the binaries and install Aer.
de_de: Dies wird sowohl die Binärdateien erstellen als auch Aer installieren.
es_un: Esto construirá los binarios e instalará Aer.
fr_fr: Ceci permettra de construire les binaires et d'installer Aer.
ja_jp: これにより、バイナリーのビルドとAerのインストールが行われます。
pl_pl: Spowoduje to zarówno zbudowanie plików binarnych, jak i zainstalowanie środowiska Aer.
ta_in: இது பைனரிகளை உருவாக்கி, Aer ஐ நிறுவும்.
te_in: ఇది బైనరీలను నిర్మిస్తుంది మరియు Aerని ఇన్‌స్టాల్ చేస్తుంది.
tr_tr: Bu, ikili dosyaları oluşturur ve Aer'i kurar.
vi_vn: Điều này sẽ dựng cả mã nhị phân cũng như cài đặt Aer cùng lúc.

source: Alternatively, if you have a newer pip installed, or have some custom requirement, you can build a Python wheel manually.
de_de: Alternativ, wenn Sie eine neuere Version von pip installiert haben oder eine spezielle Konfiguration benötigen, können Sie das Python-Wheel manuell erstellen.
es_un: Alternativamente, si tienes instalado un pip más nuevo o tienes algún requerimiento personalizado, puedes construir una Python wheel manualmente.
fr_fr: Autrement, si vous avez installé un pip plus récent ou si vous avez des exigences personnalisées, vous pouvez construire un "wheel" Python manuellement.
ja_jp: また、より新しいpipがインストールされている場合や、何らかのカスタム要件がある場合には、手動でPythonホイールを構築することもできます。
pl_pl: Alternatywnie, jeśli masz nowszy pakiet pip lub jakieś niestandardowe wymagania, możesz zbudować Python wheel ręcznie.
ta_in: மாற்றாக, நீங்கள் ஒரு புதிய பிப் நிறுவப்பட்ட இருந்தால், அல்லது சில விருப்ப தேவை இருந்தால், நீங்கள் கைமுறையாக ஒரு பைத்தான் சக்கரம் உருவாக்க முடியும்.
te_in: ప్రత్యామ్నాయంగా, మీరు కొత్త pipని ఇన్‌స్టాల్ చేసి ఉంటే లేదా కొంత అనుకూల అవసరాలను కలిగి ఉంటే, మీరు python wheelను మాన్యువల్‌గా నిర్మించవచ్చు.
tr_tr: Alternatif olarak, daha yeni bir pip'e sahipseniz veya bazı özel gereksinimleriniz varsa, manuel olarak bir Python çarkı oluşturabilirsiniz.
vi_vn: Bên cạnh đó, nếu bạn có một phiên bản pip mới hơn được cài đặt, hoặc có một vài yêu cầu tùy chỉnh, bạn có thể tự dựng thủ công một bản Python wheel.

source: If you need to set a custom option during the wheel build, refer to :ref:`aer_wheel_build_options`.
de_de: Wenn Sie während der Wheel-Erstellung eine benutzerdefinierte Option einzusetzen brauchen, finden Sie Informationen dazu unter :ref:`aer_wheel_build_options`.
es_un: Si necesitas configurar una opción personalizada durante la construcción de la Python wheel, consulta :ref:`aer_wheel_build_options`.
fr_fr: Si vous avez besoin de définir une option personnalisée pendant la construction du fichier "wheel", reportez-vous à :ref:`aer_wheel_build_options`.
ja_jp: ホイールビルド中にカスタムオプションを設定する必要がある場合は、 :ref:`aer_wheel_build_options` を参照してください。
pl_pl: Jeśli chcesz ustawić opcję niestandardową w trakcie budowy koła (wheel), zapoznaj się z :ref:` aer_wheel_build_options `.
ta_in: நீங்கள் சக்கர கட்டபோது ஒரு விருப்ப விருப்பத்தை அமைக்க வேண்டும் என்றால், பார்க்கவும் :ref:`aer_wheel_build_options`.
tr_tr: Çark oluşturma sırasında özel bir seçenek ayarlamanız gerekirse, buraya bakınız :ref:`aer_wheel_build_options`.
vi_vn: Nếu bạn cần thiết lập một tùy chọn tùy chỉnh trong quá trình dựng wheel, hãy tham khảo :ref:` `aer_wheel_build_options`.

source: After you build the Python wheel, it will be stored in the ``dist/`` dir in the Aer repository. The exact version will depend
de_de: Nachdem das Python-Wheel erstellt wurde, wird es im ``dist/`` Verzeichnis des Aer Repositorys gespeichert. Die genaue Version is abhängig von
es_un: Después de que construyas la Python wheel, se almacenará en el directorio ``dist/`` en el repositorio de Aer. La versión exacta dependerá
fr_fr: Après avoir construit le "wheel" Python, il sera stockée dans le répertoire ``dist/`` dans le dépôt Aer. La version exacte dépendra
ja_jp: Python ホイールをビルドすると、Aer リポジトリの dist/ dir に格納されます。正確なバージョンは、以下に依存します。
ta_in: நீங்கள் பைத்தான் சக்கரத்தை உருவாக்கிய பிறகு, அது ஏர் களஞ்சியத்தில் உள்ள ``dist/`` dir இல் சேமிக்கப்படும். சரியான பதிப்பு சார்ந்திருக்கும்
te_in: మీరు పైథాన్ వీల్‌ను రూపొందించిన తర్వాత, అది ఏర్ రిపోజిటరీలోని ``dist/`` dirలో నిల్వ చేయబడుతుంది. ఖచ్చితమైన సంస్కరణ ఆధారపడి ఉంటుంది
tr_tr: Python çarkını oluşturduktan sonra, Aer deposundaki ``dist/`` dizininde saklanacaktır. Tam sürümü şuna bağlıdır,

source: The exact filename of the output wheel file depends on the current version of Aer under development.
de_de: Der genaue Dateiname der ausgegebenen Wheel-Datei hängt von der aktuellen Version von Aer ab.
es_un: El nombre exacto del archivo de salida de la Python wheel depende de la versión actual de Aer en desarrollo.
fr_fr: Le nom exact du fichier "wheel" en sortie dépend de la version d'Aer en cours de développement.
ja_jp: 出力されるホイールファイルの正確なファイル名は、現在開発中のAerのバージョンによって異なります。
pl_pl: Dokładna nazwa pliku wyjściowego (wheel) zależy od aktualnie tworzonej wersji Aer.
ta_in: வெளியீட்டு ச்வீல் கோப்பின் சரியான கோப்புபெயர் அபிவிருத்திகீழ் ஏர் தற்போதைய பதிப்பை சார்ந்துள்ளது.
te_in: అవుట్‌పుట్ వీల్ ఫైల్ యొక్క ఖచ్చితమైన ఫైల్ పేరు అభివృద్ధిలో ఉన్న Aer యొక్క ప్రస్తుత వెర్షన్‌పై ఆధారపడి ఉంటుంది.
tr_tr: Çıktı çarkı dosyasının tam dosya adı, geliştirilmekte olan Aer'in geçerli sürümüne bağlıdır.
vi_vn: Tên chính xác của đầu ra của tệp wheel sẽ tùy thuộc vào phiên bản đang phát triển của Aer.

source: The Aer build system uses `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ to run the compilation when building it with the Python interface. It acts as an interface for `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ to call `CMake <https://cmake.org/>`__ and compile the binaries for your local system.
de_de: Das Aer-Build-System verwendet `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ um die Kompilierung auszuführen, wenn es mit der Python-Schnittstelle erstellt wird. Es fungiert als Schnittstelle für `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ um `CMake <https://cmake.org/>`__ aufzurufen und die Binärdateien für das lokales System zu kompilieren.
es_un: El sistema de construcción de Aer usa `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ para ejecutar la compilación cuando lo construye con la interfaz de Python. Actúa como una interfaz para `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ para llamar a `CMake <https://cmake.org/>`__ y compilar los binarios para tu sistema local.
fr_fr: Le système de construction Aer utilise `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>` __ pour exécuter la compilation lors de sa création avec l'interface Python. Il agit comme une interface pour `setuptools <https://setuptools.readthedocs.io/en/latest/>` __ pour appeler `CMake <https://cmake.org/>` __ et compiler les binaires pour votre système local.
ja_jp: Aerのビルドシステムは、Pythonインターフェイスでビルドする際に、 `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ を使用してコンパイルを実行します。これは、 `CMakeCMake`setuptools <https://setuptools.readthedocs.io/en/latest/>`__ が `CMake <https://cmake.org/>`__ を呼び出し、ローカルシステム用にバイナリーをコンパイルするためのインターフェースとして機能します。
pl_pl: System kompilacji Aer używa `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ do uruchomienia kompilacji przy budowaniu go z interfejsem Pythona. Działa jako interfejs dla `setuptool <https://setuptools.readthedocs.io/en/latest/>`__ do wywołania `CMake <https://cmake.org/>`__ i kompilacji plików binarnych dla twojego systemu lokalnego.
ta_in: பைதான் இடைமுகத்துடன் தொகுப்பை உருவாக்கும்போது அதை இயக்க ஏர் `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ ஐப் பயன்படுத்துகிறது. `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ ஐ அழைக்கவும், `CMake <https://cmake.org/>`__ உங்கள் உள்ளூர் கணினிக்கான பைனரிகளை தொகுக்கவும் இது ஒரு இடைமுகமாக செயல்படுகிறது.
te_in: Aer బిల్డ్ సిస్టమ్ python ఇంటర్‌ఫేస్‌తో కంపైలేషన్‌ను రూపొందించేటప్పుడు దాన్ని అమలు చేయడానికి `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ని ఉపయోగిస్తుంది. ఇది `CMake <https://cmake.org/>`__కి కాల్ చేయడానికి మరియు మీ స్థానిక సిస్టమ్ కోసం బైనరీలను కంపైల్ చేయడానికి `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ కోసం ఇంటర్‌ఫేస్‌గా పనిచేస్తుంది.
tr_tr: Aer derleme sistemi, derlemeyi Python arayüzüyle oluştururken çalıştırmak için `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ kullanmaktadır. `CMake <https://cmake.org/>`__ çağırma ve yerel sisteminiz için ikili dosyaları derlemede `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ için bir arayüz görevi görür.
vi_vn: Các bản dựng Aer sử dụng `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ để chạy các biên dịch khi dựng nó bằng giao diện Python. Nó hoạt động như một giao diện cho `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ để gọi `CMake <https://cmake.org/>`__ và biên dịch mã nhị phân cho hệ thống của bạn.

source: Due to the complexity of compiling the binaries, you may need to pass options to a certain part of the build process. The way to pass variables is:
de_de: Durch die Komplexität, die mit dem Kompilieren von Binärdateien einhergeht, kann es sein, dass man für einen bestimmten Teil des Prozesses benutzerdefinierte Optionen angeben muss. Wie man Variablen übergibt, ist wie folgt beschrieben:
es_un: Debido a la complejidad de compilar los binarios, es posible que tengas que pasar opciones a ciertas partes del proceso de construcción. La forma de pasar variables es:
fr_fr: En raison de la complexité de la compilation des fichiers binaires, vous devrez peut-être passer des options à certains moments du processus de génération. Pour passer des variables, procédez comme suit :
ja_jp: バイナリーのコンパイルが複雑なため、ビルドプロセスの特定の部分にオプションを渡す必要がある場合があります。変数を渡す方法は、
ta_in: பைனரிகளை தொகுப்பதில் உள்ள சிக்கலான தன்மை காரணமாக, நீங்கள் உருவாக்க செயல்முறையின் ஒரு குறிப்பிட்ட பகுதிக்கு விருப்பங்களை அனுப்ப வேண்டியிருக்கும். மாறிகள் அனுப்ப வழி:
te_in: బైనరీలను కంపైల్ చేయడంలో సంక్లిష్టత కారణంగా, మీరు బిల్డ్ ప్రాసెస్‌లో కొంత భాగానికి ఎంపికలను పాస్ చేయాల్సి రావచ్చు. వేరియబుల్స్ పాస్ మార్గం:
tr_tr: İkili dosyaları derlemenin karmaşıklığı nedeniyle, seçenekleri derleme sürecinin belirli bir bölümüne geçirmeniz gerekebilir. Değişkenleri geçirmenin yolu şudur:
vi_vn: Vì sự phức tạp để biên dịch mã nhị phân, bạn có thể sẽ cần truyền một vài lựa chọn vào một vài phần trong quá trình dựng. Cách để có thể truyền tham số là:
