Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/getting_started.po
Languages: de_de, es_mx, es_un, fr_fr, id_id, it_it, ja_jp, pl_pl, ta_in, te_in, tr_tr, vi_vn, zh_cn

source: Getting started
de_de: Erste Schritte
es_un: Primeros Pasos
fr_fr: Mise en route
ja_jp: はじめに
pl_pl: Wprowadzenie
ta_in: தொடங்குதல்
te_in: ప్రారంభించండి
tr_tr: Başlarken
vi_vn: Bắt đầu
zh_cn: 入门指南

source: Installation
es_un: Instalación
ja_jp: インストール
pl_pl: Instalacja
ta_in: நிறுவல்
tr_tr: Kurulum
vi_vn: Cài đặt
zh_cn: 安装

source: Start locally
de_de: Lokal starten
es_un: Comenzar localmente
fr_fr: Démarrer localement
ja_jp: ローカルで始める
pl_pl: Zacznij lokalnie
ta_in: உள்ளூரில் தொடங்கு
te_in: స్థానికంగా ప్రారంభించండి
tr_tr: Yerel olarak başlat
vi_vn: Bắt đầu cục bộ

source: Qiskit supports Python 3.6 or later. However, both Python and Qiskit are evolving ecosystems, and sometimes when new releases occur in one or the other, there can be problems with compatibility.
ja_jp: QiskitはPython3.6以降をサポートしています。 ただし、PythonとQiskitはどちらもエコシステムを進化させており、どちらか一方で新しいリリースが発生すると、互換性に問題が生じる場合があります。
ta_in: Qiskit Python 3.6 அல்லது பின்னர் ஆதரிக்கிறது. இருப்பினும், Python மற்றும் Qiskit ஆகிய இரண்டும் சூழல் அமைப்புகளாக உள்ளன, மேலும் சில நேரங்களில் புதிய வெளியீடுகள் ஒன்று அல்லது மற்றொன்றில் ஏற்படும் போது, பொருந்தக்கூடிய சிக்கல்கள் இருக்கலாம்.
vi_vn: Qiskit hỗ trợ Python từ phiên bản 3.6 trở lên. Tuy nhiên, Python và Qiskit là những hệ thống cập nhật liên tục, và đôi khi giữa các phiên bản của chúng, sẽ có những điểm không tương thích với nhau.

source: We recommend installing `Anaconda <https://www.anaconda.com/download/>`__, a cross-platform Python distribution for scientific computing. Jupyter, included in Anaconda, is recommended for interacting with Qiskit.
es_un: Recomendamos instalar `Anaconda <https://www.anaconda.com/download/>`__, una distribución de Python multiplataforma para computación científica. Se recomienda Jupyter, incluido en Anaconda, para interactuar con Qiskit.
ja_jp: 科学技術計算用クロスプラットフォームのPythonディストリビューションである `Anaconda <https://www.anaconda.com/download/>`__ をインストールすることをおすすめします。`Qiskit tutorials <https://github.com/Qiskit/qiskit-tutorial>`__ とのやり取りには、Anacondaに含まれるJupyter Notebookをおすすめします。
ta_in: நாம் `Anaconda <https://www.anaconda.com/download/>`__, அறிவியல் கணினி ஒரு பல் இயங்குதளம் Python விநியோகம் நிறுவபரிந்துரைக்கிறோம். அனகோண்டாவில் சேர்க்கப்பட்டுள்ள Jupyter, Qiskit உடன் தொடர்பு கொள்ள பரிந்துரைக்கப்படுகிறது.
vi_vn: Chúng tôi gợi ý bạn nên cài đặt `Anaconda <https://www.anaconda.com/download/>`__, một phiên bản Python đa nền tảng cho các tính toán khoa học. Jupyter Notebook được gợi ý nên dùng để tương tác với Qiskit đã tích hợp sẵn trên Anaconda.

source: We recommend using Python virtual environments to cleanly separate Qiskit from other applications and improve your experience.
es_un: Recomendamos utilizar entornos virtuales de Python para separar claramente Qiskit de otras aplicaciones y mejorar tu experiencia.
ja_jp: Qiskitを他のアプリケーションから明確に分離して、経験をよりよいものにするため、Python仮想環境を使用することをおすすめします。
ta_in: பைத்தான் மெய்நிகர் சூழல்களைப் பயன்படுத்தி மற்ற பயன்பாடுகளில் இருந்து Qiskit ஐ சுத்தமாக பிரித்து உங்கள் அனுபவத்தை மேம்படுத்த பரிந்துரைக்கிறோம்.
vi_vn: Chúng tôi đề nghị sử dụng môi trường ảo Python để tách rời Qiskit khỏi các ứng dụng khác và cải thiện trải nghiệm sử dụng của bạn.

source: The simplest way to use environments is by using the ``conda`` command, included with Anaconda. A Conda environment allows you to specify a specific version of Python and set of libraries. Open a terminal window in the directory where you want to work.
es_un: La forma más sencilla de utilizar los entornos es mediante el comando ``conda``, incluido con Anaconda. Un entorno de Conda te permite especificar una versión particular de Python y un conjunto de bibliotecas. Abre una ventana de terminal en el directorio donde deseas trabajar.
ja_jp: 環境を使用するもっともシンプルな方法は、Anacondaに含まれている ``conda`` コマンドを使う方法です。Conda環境では、Pythonの特定のバージョンおよびライブラリを指定することができます。作業したいディレクトリでターミナルウィンドウを開きます。
ta_in: சூழல்களைப் பயன்படுத்த எளிய வழி அனகோண்டாவுடன் சேர்க்கப்பட்டுள்ள ``conda`` கட்டளையைப் பயன்படுத்துவதாகும். ஒரு கோண்டா சூழல் பைதான் மற்றும் நூலகங்களின் தொகுப்பை குறிப்பிட அனுமதிக்கிறது. நீங்கள் வேலை செய்ய விரும்பும் கோப்பகத்தில் ஒரு முனைய சாளரத்தைத் திறக்கவும்.
vi_vn: Cách đơn giản nhất để sử dụng các môi trường là sử dụng lệnh ``conda``, được bao gồm trong Anaconda. Một môi trường Conda cho phép bạn sử dụng một phiên bản Python bất kỳ và các thư viện mong muốn. Mở một terminal (chương trình giao diện cửa sổ dòng lệnh) trong thư mục mà bạn muốn làm việc.

source: It is preferred that you use Anaconda prompt installed with the Anaconda. All you have to do is create a virtual environment inside Anaconda and activate the environment. These commands can be run in Anaconda prompt irrespective of Windows or Linux machine.
ja_jp: Anaconda に同梱されているAnaconda プロンプトを使用することをお勧めします。 ユーザーはAnaconda 内に仮想環境を構築して、その環境をアクティベートする必要があります。 これらのコマンドは、 Windows または linux マシンに関係なく、 Anaconda プロンプトで実行できます。
ta_in: அனகோண்டாவுடன் நிறுவப்பட்டஅனகோண்டா பிரொம்ப்ட் ஐ நீங்கள் பயன்படுத்த வேண்டும். நீங்கள் செய்ய வேண்டியது அனகோண்டாவிற்குள் ஒரு மெய்நிகர் சூழலை உருவாக்கி, சூழலை செயல்படுத்தவேண்டும். இந்த கட்டளைகளை விண்டோஸ் அல்லது லினக்ஸ் இயந்திரம் எதுவாக அனகோண்டா பிரொம்ப்ட் இயக்க முடியும்.
vi_vn: Các bạn nên sử dụng Anaconda Prompt được cài đặt chung với Anaconda. Tất cả những gì bạn phải làm là tạo một môi trường ảo bên trong Anaconda và kích hoạt nó. Các lệnh này có thể chạy trong Anaconda Prompt bất kể Windows hoặc Linux.

source: Create a minimal environment with only Python installed in it.
de_de: Erstellen Sie eine minimale Umgebung, in der nur Python installiert ist.
es_un: Crea un entorno mínimo con solo Python instalado en él.
fr_fr: Créez un environnement minimal avec seulement Python installé.
ja_jp: Pythonのみをインストールした最小環境を作ります。
pl_pl: Utwórz minimalne środowisko tylko z zainstalowanym w nim Pythonem.
ta_in: Python மட்டுமே நிறுவப்பட்டுள்ள குறைந்தபட்ச சூழலை உருவாக்கவும்.
te_in: పైథాన్ మాత్రమే ఇన్‌స్టాల్ చేసి కనీస వాతావరణాన్ని సృష్టించండి.
tr_tr: Yalnızca üzerinde Python kurulu olan minimal bir ortam oluşturun.
vi_vn: Tạo một môi trường tối giản với chỉ có Python được cài đặt.

source: Activate your new environment.
de_de: Aktivieren Sie Ihre neue Umgebung.
es_un: Activa tu nuevo entorno.
fr_fr: Activez votre nouvel environnement.
ja_jp: 新しい環境をアクティブにします。
pl_pl: Aktywuj nowe środowisko.
ta_in: உங்கள் புதிய சூழலை செயல்படுத்துங்கள்.
te_in: మీ కొత్త వాతావరణాన్ని యాక్టివేట్ చేయండి.
tr_tr: Yeni ortamınızı etkinleştirin.
vi_vn: Kích hoạt môi trường mới của bạn.

source: Next, install the Qiskit package.
de_de: Installieren Sie als Nächstes das Qiskit Paket.
es_un: A continuación, instala el paquete Qiskit.
fr_fr: Ensuite, installez le package Qiskit.
ja_jp: 次に、 Qiskit パッケージをインストールします。
pl_pl: Następnie zainstaluj pakiet Qiskit.
ta_in: அடுத்து, Qiskit தொகுப்பை நிறுவவும்.
te_in: తరువాత, Qiskit ప్యాకేజీని ఇన్‌స్టాల్ చేయండి.
tr_tr: Daha sonra, Qiskit paketini kurun.
vi_vn: Tiếp theo, cài đặt Qiskit.

source: If the packages were installed correctly, you can run ``conda list`` to see the active packages in your virtual environment.
es_un: Si los paquetes se instalaron correctamente, puedes ejecutar ``conda list`` para ver los paquetes activos en tu entorno virtual.
ja_jp: パッケージが正しくインストールされている場合は、 ``conda list`` を実行して、仮想環境でアクティブなパッケージを確認できます。
ta_in: தொகுப்புகள் சரியாக நிறுவப்பட்டிருந்தால், உங்கள் மெய்நிகர் சூழலில் நடப்பு தொகுப்புகளை காண நீங்கள் ``conda list`` ஐ இயக்கலாம்.
vi_vn: Nếu các package đã được cài đặt đúng, bạn có thể chạy ``conda list`` để xem các package đang được kích hoạt trong môi trường ảo của bạn.

source: If you intend to use visualization functionality or Jupyter notebooks it is recommended to install Qiskit with the extra ``visualization`` support:
de_de: Wenn Sie beabsichtigen, Visualisierungsfunktionen oder Jupyter-Notebooks zu verwenden, wird empfohlen, Qiskit mit der zusätzlichen ``Visualisierungs``-Unterstützung zu installieren:
es_un: Si tienes la intención de utilizar la funcionalidad de visualización o los cuadernos de Jupyter, se recomienda instalar Qiskit con el soporte adicional de ``visualization``:
fr_fr: Si vous prévoyez d'utiliser la fonctionnalité de visualisation ou Jupyter notebooks il est recommandé d'installer qiskit avec les options supplémentaires de visualisation :
ja_jp: 可視化機能やJupyter notebookを使用する場合は、Qiskitに ``visualization`` 機能を追加してインストールすることをお勧めします。
pl_pl: Jeśli zamierzasz korzystać z funkcji wizualizacji lub plików Jupyter notebook, zaleca się instalację pakietu Qiskit z dodatkowym wsparciem w ``wizualizacji``:
ta_in: நீங்கள் காட்சிப்படுத்தல் செயல்பாடு அல்லது ஜூபிட்டர் நோட்புக் பயன்படுத்த விரும்பினால் அது கூடுதல் ``visualization`` ஆதரவுடன் Qiskit நிறுவ பரிந்துரைக்கப்படுகிறது:
te_in: మీరు విజువలైజేషన్ ఫంక్షనాలిటీ లేదా జూపిటర్ నోట్‌బుక్‌లను ఉపయోగించాలనుకుంటే అదనపు ``visualization`` మద్దతుతో Qiskitని ఇన్‌స్టాల్ చేయాలని సిఫార్సు చేస్తున్నాము:
tr_tr: Görselleştirme işlevini veya Jupyter not defterlerini kullanmayı planlıyorsanız, ek ``görselleştirme`` desteği ile Qiskit'i kurmanız önerilir:
vi_vn: Nếu bạn có ý định sử dụng thêm chức năng hiển thị đồ họa hoặc Jupyter Notebooks, bạn cần cần cài đặt Qiskit với các tính năng hỗ trợ ``visualization``:

source: It is worth pointing out that if you're a zsh user (which is the default shell on newer versions of macOS), you'll need to put ``qiskit[visualization]`` in quotes:
de_de: Als ein Benutzer von zsh (was die Standard-Shell für neuere Versionen von macOS ist) muss ``qiskit[visualization]`` in Anführungszeichen gesetzt werden:
es_un: Vale la pena señalar que si eres usuario de zsh (que es el shell predeterminado en las versiones más recientes de macOS), deberás poner ``qiskit[visualization]`` entre comillas:
fr_fr: Il est utile de préciser que si vous êtes un utilisateur de zsh (qui est le shell par défaut dans les nouvelles versions de macOS) que vous devrez mettre ``qiskit[visualization]`` entre guillemets :
ja_jp: zshユーザー（新しいバージョンのmacOSのデフォルトシェル）の場合は、 ``qiskit[visualization]`` を引用符で囲む必要があります。
pl_pl: Warto zaznaczyć, że jeśli używasz użytkownika zsh (który jest domyślną powłoką na nowszych wersjach macOS), musisz umieścić ``qiskit[visualization]`` w cudzysłowie:
ta_in: நீங்கள் ஒரு zsh பயனர் என்றால் (இது MacOS இன் புதிய பதிப்புகளில் இயல்புநிலை ஷெல் ஆகும்), நீங்கள் மேற்கோள் களில் ``qiskit[visualization]`` வைக்க வேண்டும்:
te_in: మీరు zsh వినియోగదారు అయితే (ఇది macOS యొక్క కొత్త వెర్షన్‌లలో డిఫాల్ట్ షెల్), మీరు కోట్స్‌లో ``qiskit[visualization]``ని ఉంచాలి:
tr_tr: Bir zsh kullanıcısıysanız (bu, macOS'un daha yeni sürümlerinde varsayılan kabuktur), tırnak işaretleri arasına ``qiskit[visualization]`` eklemeniz gerekeceğini belirtmekte fayda var:
vi_vn: Ngoài ra, nếu bạn là một người sử dụng zsh (shell mặc định trên những phiên bản mới hơncủa macOS), bạn cần đặt ``qiskit[visualization]`` trong dấu nháy đơn:

source: Start on the cloud
de_de: In der Cloud starten
es_un: Comenzar en la nube
fr_fr: Démarrer sur le cloud
ja_jp: クラウドで始める
pl_pl: Zacznij od chmury
ta_in: கிளவுடில் தொடங்கவும்
te_in: క్లౌడ్‌లో ప్రారంభించండి
tr_tr: Bulut üzerinde başlatma
vi_vn: Bắt đầu bằng cloud

source: The following cloud vendors have Qiskit pre-installed in their environments:
de_de: Folgende Cloud-Anbieter haben Qiskit in ihrer Umgebung vorinstalliert:
es_un: Los siguientes proveedores de nube tienen Qiskit preinstalado en sus entornos:
fr_fr: Les fournisseurs de cloud suivants disposent de Qiskit préinstallé dans leur environnement :
ja_jp: 以下のクラウドベンダーの環境では、Qiskitがプレインストールされています。
pl_pl: Następujący dostawcy chmury mają preinstalowany pakiet Qiskit w swoich środowiskach:
ta_in: பின்வரும் கிளவுட் விற்பனையாளர்கள் தங்கள் சூழலில் முன்பே நிறுவப்பட்ட Qiskit வேண்டும்:
te_in: కింది క్లౌడ్ విక్రేతలు తమ పరిసరాలలో క్విస్కిట్‌ని ముందే ఇన్‌స్టాల్ చేసారు:
tr_tr: Aşağıdaki bulut sağlayıcılarının ortamlarında, önceden kurulmuş Qiskit bulunmaktadır:
vi_vn: Những nhà cung cấp dịch vụ điện toán đám mây sau đã có Qiskit cài đặt sẵn trong môi trường của họ:

source: Install from source
de_de: Installieren aus dem Quellcode
es_un: Instalar desde el código fuente
fr_fr: Installation à partir de la source
ja_jp: ソースからインストールする
pl_pl: Instalacja ze źródła
ta_in: மூலத்திலிருந்து நிறுவு
te_in: సోర్స్ నుండి ఇన్‌స్టాల్ చేయండి
tr_tr: Kaynaktan kurulum
vi_vn: Cài đặt từ nguồn

source: Installing the elements from source allows you to access the most recently updated version of Qiskit instead of using the version in the Python Package Index (PyPI) repository. This will give you the ability to inspect and extend the latest version of the Qiskit code more efficiently.
de_de: Eine Installation aus dem Quellcode bietet den Zugriff auf die aktuellste Version von Qiskit, statt auf die Version im Python Package Index (PyPI). Damit hat man die Möglichkeit, sich leichter die neueste Version von Qiskit anzusehen und zu erweitern.
es_un: La instalación de los elementos desde el código fuente te permite acceder a la versión actualizada más recientemente de Qiskit en lugar de usar la versión en el repositorio del índice de paquetes de Python (Python Package Index, PyPI). Esto te dará la capacidad de inspeccionar y ampliar la última versión del código Qiskit de manera más eficiente.
fr_fr: Installer des éléments depuis la source vous permet d'utiliser la version la plus à jour de Qiskit, plutôt que d'utiliser la version du dépôt de PyPI (Python Package Index). Ceci vous donnera la possibilité d'inspecter et d'étendre plus efficacement la dernière version du code Qiskit.
ja_jp: ソースからエレメントをインストールすることにより、Python Package Index (PyPI) リポジトリのバージョンを使う代わりに、最新のQiskitバージョンにアクセスすることが出来ます。これにより、Qiskit コードの最新版を調査したり、拡張することがより効果的にできるようになります。
pl_pl: Instalacja elementów ze źródła pozwala na dostęp do najnowszej wersji Qiskit zamiast korzystania z wersji w repozytorium Python Package Index (PyPI). Umożliwi to sprawniejsze sprawdzanie i rozszerzanie najnowszych wersji kodu Qiskit.
ta_in: மூலத்திலிருந்து உறுப்புகளை நிறுவுவது பைத்தான் தொகுப்பு அட்டவணை (PyPI) களஞ்சியத்தில் பதிப்பைப் பயன்படுத்துவதற்குபதிலாக Qiskit இன் மிக சமீபத்தில் புதுப்பிக்கப்பட்ட பதிப்பை அணுக அனுமதிக்கிறது. இது Qiskit குறியீட்டின் சமீபத்திய பதிப்பை இன்னும் திறமையாக ஆய்வு செய்து விரிவாக்கும் திறனை உங்களுக்கு வழங்கும்.
te_in: మూలాధారం నుండి మూలకాలను ఇన్‌స్టాల్ చేయడం వలన Python Package Index (PyPI) రిపోజిటరీలో సంస్కరణను ఉపయోగించకుండా Qiskit యొక్క అత్యంత ఇటీవల నవీకరించబడిన సంస్కరణను యాక్సెస్ చేయడానికి మిమ్మల్ని అనుమతిస్తుంది. ఇది Qiskit కోడ్ యొక్క తాజా వెర్షన్‌ను మరింత సమర్ధవంతంగా తనిఖీ చేసే మరియు పొడిగించే సామర్థ్యాన్ని మీకు అందిస్తుంది.
tr_tr: Öğelerin kaynaktan kurulması, Python Package Index (PyPI) havuzundaki sürümü kullanmak yerine en son güncellenen Qiskit sürümüne erişmenizi sağlamaktadır. Bu da size Qiskit kodunun en son sürümünü daha verimli bir şekilde inceleme ve genişletme olanağı sağlar.
vi_vn: Cài đặt các thành phần nguyên tố từ nguồn cho phép bạn truy cập phiên bản mới nhất của Qiskit thay vì phiên bản ở trong kho Python Package Index (PyPI). Điều này sẽ giúp bạn có thể xem và mở rộng phiên bản mới nhất của Qiskit code một cách hiệu quả hơn.

source: When installing the elements and components from source, by default their ``development`` version (which corresponds to the ``master`` git branch) will be used, as opposed to the ``stable`` version (which contains the same codebase as the published ``pip`` packages). Since the ``development`` versions of an element or component usually include new features and changes, they generally require using the ``development`` version of the rest of the items as well.
de_de: Wenn Elemente und Komponenten aus dem Quelltext installiert werden, ist die Voreinstellung, dass die ``development``-Version (welche mit dem git-master-Branch übereinstimmt) verwendet wird, und nicht die ``stable``-Version (welche die Quelltextbasis der veröffentlichten ``pip``-Pakete enthält). Weil die ``development``-Versionen eines Elements oder einer Komponente üblicherweise die neuesten Funktionen und Änderungen beinhalten, erfordern diese in der Regel die Verwendung der ``development``-Versionen aller übrigen Objekte.
es_un: Al instalar los elementos y componentes desde el código fuente, por defecto se usará su versión de ``development`` (que corresponde a la rama de git ``master``), a diferencia de la versión ``stable`` (que contiene la misma base de código como los paquetes ``pip`` publicados). Dado que las versiones de ``development`` de un elemento o componente suelen incluir nuevas características y cambios, generalmente requieren el uso de la versión de ``development`` del resto de los elementos también.
fr_fr: Lorsqu'une installation depuis la source est réalisée, par défaut, la version ``development``(correspondant à la branche ``master`` de git) sera utilisée, et non la version ``stable`` (qui contient le code des packages ``pip`` publiés). Puisque la version ``development`` d'un composant inclut les toutes nouvelles modifications, il est nécessaire alors d'utiliser cette même version pour les autres éléments.
ja_jp: ソースからエレメントやコンポーネントをインストールする時には、デフォルトでは、``stable`` バージョン( ``pip`` パッケージとして公開されているコードベースと同じもの) ではなく、 ``development`` バージョン( ``master`` git ブランチに該当) が使われます。 エレメントやコンポーネントの ``development`` バージョンは通常新しい機能や変更が含まれているため、一般的には他の項目についても ``development`` バージョンを利用することが求められています。
pl_pl: Podczas instalowania elementów i komponentów ze źródła, domyślnie zostanie użyta ich wersja ``development`` (co odpowiada gałęzi ``master`` w systemie git), w odróżnieniu od wersji ``stable`` (która zawiera tę samą bazę kodową co opublikowane pakiety ``pip`````). Ponieważ wersje ``development`` elementu lub komponentu zazwyczaj zawierają nowe funkcje i zmiany, generalnie wymagają użycia wersji ``development`` również pozostałych elementów.
ta_in: மூலத்திலிருந்து உறுப்புகள் மற்றும் கூறுகளை நிறுவும் போது, முன்னிருப்பாக அவற்றின் development பதிப்பு (இது master git கிளையுடன் ஒத்துள்ளது) பயன்படுத்தப்படும், இது ``stable`` பதிப்பு க்கு எதிராக (வெளியிடப்பட்ட ``pip`` தொகுப்புகளின் அதே codebase கொண்டிருக்கும்). ஒரு உறுப்பு அல்லது உறுப்பின் development பதிப்புகள் பொதுவாக புதிய அம்சங்கள் மற்றும் மாற்றங்களைஉள்ளடக்குவதால், அவை பொதுவாக மற்ற உருப்படிகளின் development பதிப்பைப் பயன்படுத்த வேண்டும்.
te_in: మూలం నుండి మూలకాలు మరియు భాగాలను ఇన్‌స్టాల్ చేస్తున్నప్పుడు, డిఫాల్ట్‌గా వాటి ``development`` వెర్షన్ (`master`` git బ్రాంచ్‌కు అనుగుణంగా ఉంటుంది) ఉపయోగించబడుతుంది, ఇది ``stable`` వెర్షన్‌కి విరుద్ధంగా (కోడ్‌బేస్ ప్రచురించబడిన ``pip`` ప్యాకేజీల వలె దీనిని కలిగి ఉంటుంది). ఎలిమెంట్ లేదా కాంపోనెంట్ యొక్క ``development`` వెర్షన్‌లు సాధారణంగా కొత్త ఫీచర్‌లు మరియు మార్పులను కలిగి ఉంటాయి కాబట్టి, వాటికి సాధారణంగా మిగిలిన ఐటెమ్‌ల ``development`` వెర్షన్‌ని ఉపయోగించడం అవసరం.
tr_tr: Ögeleri ve bileşenleri kaynaktan yüklerken, varsayılan olarak ``stable`` sürümün (yayınlanan ``pip`` paketleri ile aynı kod tabanı sürümü içeren) aksine, ``development`` sürümü (``master`` git dallanmasına karşılık gelen) kullanılacaktır. Bir ögenin veya bileşenin ``development`` sürümleri yeni özellikler ve değişiklikler içerdiğinden, genellikle aynı şekilde geri kalan ögelerin ``development`` sürümünün kullanılmasını gerektirirler.

source: The Terra and Aer packages both require a compiler to build from source before you can install. Ignis, Aqua, and the IBM Quantum Provider backend do not require a compiler.
de_de: Die Terra- und Aer-Pakete benötigen beide zum Kompilieren aus dem Quelltext einen Compiler, bevor man diese installieren kann. Ignis, Aqua und das "IBM Quantum Provider"-Backend benötigen keinen Compiler.
es_un: Los paquetes Terra y Aer requieren un compilador para construirlos desde el código fuente antes de que puedas instalarlos. Ignis, Aqua y el backend de IBM Quantum Provider no requieren un compilador.
fr_fr: Les packages Terra et Aer nécessitent un compilateur pour être construits depuis la source avant installation. Ignis, Aqua, et IBM Quantum Provider backend ne nécessitent pas de compilateur.
ja_jp: TerraとAerのパッケージは、インストールする前にソースからビルドするためのコンパイラーが必要です。Ignis、Aqua、および IBM Quantum Provider バックエンドは、コンパイラーを必要としません。
pl_pl: Pakiety Terra i Aer wymagają kompilatora do zbudowania ze źródła przed instalacją. Ignis, Aqua i IBM Quantum Provider nie wymagają kompilatora.
ta_in: டெர்ரா மற்றும் ஏயர் தொகுப்புகள் இரண்டும் நீங்கள் நிறுவுவதற்கு முன் மூலத்திலிருந்து உருவாக்க ஒரு கம்பைலர் தேவைப்படுகிறது. பற்றவைப்பு, அக்வா, மற்றும் IBM குவாண்டம் வழங்குநர் பின்எண்ட் ஒரு தொகுப்பி தேவையில்லை.
te_in: Terra మరియు Aer ప్యాకేజీలు రెండింటికి మీరు ఇన్‌స్టాల్ చేయడానికి ముందు సోర్స్ నుండి నిర్మించడానికి కంపైలర్ అవసరం. Ignis, Aqua మరియు IBM Quantum Provider backendకు కంపైలర్ అవసరం లేదు.
tr_tr: Kurmadan önce kaynaktan derlemek için Terra ve Aer paketlerinin ikisi de bir derleyici gerektirir. Ignis, Aqua ve IBM Quantum Provider arka ucu bir derleyici gerektirmez.
vi_vn: Gói Terra và Aer đều yêu cầu trình biên dịch để xây dựng từ nguồn trước khi bạn có thể cài đặt. Ignis, Aqua, và IBM Quantum Provider backend không yêu cầu một trình biên dịch.

source: Installing elements from source requires the following order of installation to prevent installing versions of elements that may be lower than those desired if the ``pip`` version is behind the source versions:
de_de: Das Installieren von Elementen aus dem Quellcode erfordert die folgende Reihenfolge, um die Installation von Elementen aus einer älteren als der gewünschten Version zu vermeiden, falls die ``pip`` Versionen älter als die Quellversionen ist:
es_un: La instalación de los elementos desde el código fuente requiere el siguiente orden de instalación para evitar la instalación de versiones de elementos que puedan ser inferiores a las deseadas si la versión ``pip`` es inferior a la de las versiones del código fuente:
fr_fr: L'installation d'éléments à partir du source nécessite l'ordre d'installation suivant pour empêcher l'installation de versions d'éléments qui peuvent être inférieures à celles désirées si la version ``pip`` est derrière les versions sources:
ja_jp: ``pip`` のバージョンがソースバージョンより古い場合に、要求するものよりも古いバージョンをインストールしてしまうことを防ぐため、ソースからエレメントをインストールするには以下の順番で実施します：
pl_pl: Instalacja elementów ze źródła powinna byc wykonana w określonej kolejności, aby zapobiec instalowaniu starszych wersji poszczególnych elementów, gdy wersja ``pip`` jest starsza od kodu źródłowego:
ta_in: மூலத்திலிருந்து உறுப்புகளை நிறுவுவதற்கு மூல பதிப்புகளுக்கு பின்னால் உள்ள ``pip`` பதிப்பு கள் இருந்தால், விரும்பிய உறுப்புகளை விட குறைவாக இருக்கும் உறுப்புகளின் பதிப்புகளை நிறுவுவதைத் தடுக்க பின்வரும் வரிசை நிறுவல் தேவைப்படுகிறது:
te_in: సోర్స్ నుండి మూలకాలను ఇన్‌స్టాల్ చేయడానికి మూలకాల సంస్కరణల వెనుక ``pip`` సంస్కరణ ఉన్నట్లయితే కావలసిన వాటి కంటే తక్కువగా ఉండే మూలకాల సంస్కరణలను ఇన్‌స్టాల్ చేయకుండా నిరోధించడానికి క్రింది ఇన్‌స్టాలేషన్ క్రమం అవసరం:
tr_tr: Ögelerin kaynaktan kurulması, eğer ``pip`` versiyonu kaynak sürümlerin gerisindeyse, istenenden daha düşük olabilecek öge sürümlerinin kurulmasını önlemek için aşağıdaki kurulum sırasını gerektirir:
