Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/getting_started.po
Languages: de_de, es_mx, es_un, fr_fr, id_id, it_it, ja_jp, pl_pl, ta_in, te_in, tr_tr, vi_vn, zh_cn

source: If you want to run tests or linting checks, install the developer requirements. This is not required to install or use the qiskit-ibmq-provider package when installing from source.
de_de: Falls Tests oder Linting-Checks durchgeführt werden sollen, müssen zusätzlich die Entwicklungs-Abhängigkeiten installiert werden. Für den Fall, dass das qiskit-ibmq-provider Paket vom Quelltext installiert oder genutzt wird, ist dies nicht notwendig.
es_un: Si quieres ejecutar pruebas o verificaciones de linting, instala los requerimientos de desarrollador. Esto no es requerido para instalar o usar el paquete qiskit-ibmq-provider cuando se instala a partir del código fuente.
fr_fr: Si vous souhaitez exécuter des tests ou du linting (vérification de votre code), installez les outils développeur. Il n'est pas nécessaire d'installer ou d'utiliser le package qiskit-ibmq-provider lors de l'installation à partir du code source.
ja_jp: テストやリンティングチェックを実行したい場合は、開発者向けの要件をインストールしてください。ソースからインストールする場合、qiskit-ibmq-providerパッケージのインストールおよび使用の際には必要ありません。
pl_pl: Jeśli chcesz przeprowadzić testy lub sprawdzić składnię, zainstaluj wymagane pakiety deweloperskie. Nie jest to wymagane do instalacji lub korzystania z pakietu qiskit-aqua, jeśli instalujemy ze źródła.
ta_in: நீங்கள் சோதனைகள் அல்லது மெல்லிய காசோலைகளை இயக்க விரும்பினால், டெவலப்பர் தேவைகளை நிறுவவும். மூலத்திலிருந்து நிறுவும் போது qiskit-ibmq-provider தொகுப்பை நிறுவவோ பயன்படுத்தவோ இது தேவையில்லை.
tr_tr: Test veya programlama hataları için kontroller yürütmek istiyorsanız, geliştirici gereksinimlerini yükleyin. Kaynaktan kurulum yaparken qiskit-ibmq-provider paketini kurmak veya kullanmak için bu gerekli değildir.

source: Install qiskit-ibmq-provider.
de_de: qiskit-ibmq-provider installieren.
es_un: Instala qiskit-ibmq-provider.
fr_fr: Installez qiskit-ibmq-provider.
ja_jp: qiskit-ibmq-providerをインストールします。
pl_pl: Zainstaluj qiskit-ibmq-provider.
ta_in: Qiskit-ibmq-provider நிறுவவும்.
tr_tr: qiskit-ibmq-provider'ı yükle.
vi_vn: Cài đặt qiskit-ibmq-provider.

source: Platform Support
de_de: Plattformunterstützung
es_un: Soporte de la Plataforma
fr_fr: Plateformes prises en charge
ja_jp: プラットフォーム・サポート
pl_pl: Wspierane platformy
ta_in: இயங்குதள ஆதரவு
te_in: ప్లాట్‌ఫారమ్ మద్దతు
tr_tr: Platform Desteği
zh_cn: 平台支持

source: Qiskit strives to support as many platforms as possible, but due to limitations in available testing resources and platform availability, not all platforms can be supported. Platform support for Qiskit is broken into 3 tiers with different levels of support for each tier. For platforms outside these, Qiskit is probably still installable, but it's not tested and you will have to build Qiskit (and likely Qiskit's dependencies) from source.
de_de: Qiskit bemüht sich, so viele Plattformen wie möglich zu unterstützen, aber aufgrund von Einschränkungen bei verfügbaren Testressourcen und Plattformverfügbarkeit können nicht alle Plattformen unterstützt werden. Die Plattformunterstützung für Qiskit ist in 3 Stufen mit unterschiedlichen Unterstützungsstufen für jede Schicht unterteilt. Für Plattformen außerhalb dieser Systeme ist Qiskit wahrscheinlich noch installierbar, aber es ist nicht getestet und Sie müssen Qiskit (und wahrscheinlich Qiskit-Abhängigkeiten) von der Quelle aus erstellen.
es_un: Qiskit se esfuerza por admitir tantas plataformas como sea posible, pero debido a las limitaciones en los recursos de prueba disponibles y la disponibilidad de la plataforma, no todas las plataformas son compatibles. El soporte de plataforma para Qiskit se divide en 3 niveles con diferentes grados de soporte para cada nivel. Para plataformas fuera de estas, es probable que Qiskit todavía se pueda instalar, pero no se ha probado y tendrás que compilar Qiskit (y probablemente las dependencias de Qiskit) desde la fuente.
fr_fr: Qiskit s'efforce de prendre en charge autant de plateformes que possible, mais en raison des limitations des ressources de test disponibles et de la disponibilité de la plateforme, toutes les plateformes ne peuvent pas être prises en charge. Le support de plateforme pour Qiskit est divisé en 3 niveaux avec différents niveaux de support pour chaque niveau. Pour les plateformes en dehors de celles-ci, Qiskit est probablement toujours installable, mais il n'est pas testé et vous aurez à construire Qiskit (et probablement les dépendances de Qiskit) à partir de la source.
ja_jp: Qiskit は可能な限り多くのプラットフォームをサポートするよう努めていますが、利用可能なテストリソースとプラットフォームの可用性に制限があるため、すべてのプラットフォームをサポートできるわけではありません。Qiskit のプラットフォーム・サポートは3つの層に分かれており、各層のサポートレベルは異なります。これら以外のプラットフォームの場合、Qiskit はおそらくまだインストール可能ですが、テストされていないため、ソースから Qiskit（およびおそらく Qiskit の依存関係）を構築する必要があります。
pl_pl: Qiskit stara się wspierać jak największą liczbę platform, ale ze względu na ograniczenia w dostępnych zasobach testowych i dostępności platform, nie jest to możliwe dla wszystkich platform. Wsparcie platform dla Qiskit dzieli się na trzy rodzaje wsparcia dla każdego poziomu. W przypadku innych platform instalacja Qiskit jest prawdopodobnie nadal możliwa, ale nie zostało to przetestowane i będzie trzeba skompilować Qiskit (i prawdopodobnie też jego zależności) ze źródła.
ta_in: Qiskit முடிந்தவரை பல இயங்குதளங்களை ஆதரிக்க முயற்சிக்கிறது, ஆனால் கிடைக்கக்கூடிய சோதனை ஆதாரங்கள் மற்றும் இயங்குதளம் கிடைப்பதில் உள்ள வரம்புகள் காரணமாக, எல்லா இயங்குதளங்களையும் ஆதரிக்க முடியாது. Qiskit-க்கான இயங்குதள ஆதரவு ஒவ்வொரு அடுக்குக்கும் வெவ்வேறு நிலைகளில் ஆதரவுடன் 3 அடுக்குகளாக பிரிக்கப்பட்டுள்ளது. இவற்றுக்கு வெளியே உள்ள இயங்குதளங்களுக்கு, Qiskit இன்னும் நிறுவக்கூடியதாக இருக்கலாம், ஆனால் அது சோதிக்கப்படவில்லை மேலும் நீங்கள் Qiskit (மற்றும் Qiskit-இன் சார்புகளை) மூலத்திலிருந்து உருவாக்க வேண்டும்.
te_in: Qiskit వీలైనన్ని ప్లాట్‌ఫారమ్‌లకు మద్దతు ఇవ్వడానికి ప్రయత్నిస్తుంది, అయితే అందుబాటులో ఉన్న టెస్ట్ వనరులు మరియు ప్లాట్‌ఫారమ్ లభ్యతలో పరిమితుల కారణంగా, అన్ని ప్లాట్‌ఫారమ్‌లకు మద్దతు ఇవ్వబడదు. Qiskit కోసం ప్లాట్‌ఫారమ్ మద్దతు ప్రతి శ్రేణికి వివిధ స్థాయిల మద్దతుతో 3 శ్రేణులుగా విభజించబడింది. వీటి వెలుపలి ప్లాట్‌ఫారమ్‌ల కోసం, Qiskit బహుశా ఇప్పటికీ ఇన్‌స్టాల్ చేయబడవచ్చు, కానీ ఇది పరీక్షించబడలేదు మరియు మీరు సోర్స్ నుండి Qiskit (మరియు బహుశా Qiskit యొక్క డిపెండెన్సీలను) నిర్మించవలసి ఉంటుంది.
tr_tr: Qiskit mümkün olduğu kadar çok platformu desteklemeye çalışır, ancak mevcut test kaynaklarındaki sınırlamalar ve platform kullanılabilirliği nedeniyle tüm platformlar desteklenemez. Qiskit için platform desteği, her katman için farklı destek seviyeleri ile 3 seviyeye ayrılmıştır. Bunların dışındaki platformlar için, Qiskit muhtemelen hala kurulabilir, ancak test edilmedi ve Qiskit'i (ve muhtemelen Qiskit'in bağımlılıklarını) kaynaktan derlemeniz gerekecek.
zh_cn: Qiskit 力求支持尽可能多的平台，但由于可用的测试资源及平台可用性的限制，并非所有平台都可以支持。 对 Qiskit 的平台支持分为 3 层，每层的支持级别各有不同。 对于这些平台之外的平台， Qiskit 可能仍可安装，但未经过测试，您将不得不从源代码构建 Qiskit (和可能的 Qiskit 相关依赖) 。

source: Additionally, Qiskit only supports CPython. Running with other Python interpreters isn't currently supported.
de_de: Darüber hinaus unterstützt Qiskit nur CPython. Die Ausführung mit anderen Python-Interpreten wird derzeit nicht unterstützt.
es_un: Además, Qiskit solo es compatible con CPython. Actualmente, no se admite la ejecución con otros intérpretes de Python.
fr_fr: De plus, Qiskit ne prend en charge que CPython. L'exécution avec d'autres interprèteur Python n'est pas prise en charge actuellement.
ja_jp: さらに、 Qiskit は CPython のみをサポートします。他の Python インタプリタとの実行は現在サポートされていません。
pl_pl: Ponadto Qiskit obsługuje tylko CPython. Uruchamianie z innymi interpreterami Pythona nie jest obecnie obsługiwane.
ta_in: கூடுதலாக, Qiskit CPython ஐ மட்டுமே ஆதரிக்கிறது. பிற Python மொழிபெயர்ப்பாளர்களுடன் இயங்குவது தற்போது ஆதரிக்கப்படவில்லை.
te_in: అదనంగా, Qiskit CPythonకు మాత్రమే మద్దతు ఇస్తుంది. ఇతర python ఇంటర్ప్రెటర్లతో నడుపుటకు ప్రస్తుతం మద్దతు లేదు.
tr_tr: Ek olarak, Qiskit yalnızca CPython'u destekler. Diğer Python yorumlayıcılarıyla çalıştırma şu anda desteklenmemektedir.
zh_cn: 此外， Qiskit 仅支持 CPython。 当前不支持使用其他 Python 解释器。

source: Tier 1
de_de: Tier 1 (Stufe 1)
es_un: Nivel 1
fr_fr: Niveau 1
ja_jp: ティア 1
pl_pl: Poziom 1
ta_in: அடுக்கு 1
tr_tr: Seviye 1
zh_cn: 第 1 层

source: Tier 1 supported platforms are fully tested upstream as part of the development processes to ensure any proposed change will function correctly. Pre-compiled binaries are built, tested, and published to PyPI as part of the release process. These platforms are expected to be installable with just a functioning Python environment as all dependencies are available on these platforms.
de_de: Auf Tier 1 (Stufe 1) unterstützte Plattformen werden im Rahmen der Entwicklungsprozesse vollständig getestet, um sicherzustellen, dass eine vorgeschlagene Änderung ordnungsgemäß funktioniert. Vorkompilierte Binärdateien werden als Teil des Releaseprozesses erstellt, getestet und für PyPI veröffentlicht. Diese Plattformen werden voraussichtlich mit nur einer funktionierenden Python-Umgebung installierbar sein, da alle Abhängigkeiten auf diesen Plattformen verfügbar sind.
es_un: Las plataformas compatibles con el nivel 1 se prueban completamente en upstream como parte de los procesos de desarrollo para garantizar que cualquier cambio propuesto funcione correctamente. Los binarios precompilados se construyen, prueban y publican en PyPI como parte del proceso de lanzamiento. Se espera que estas plataformas se puedan instalar con solo un entorno de Python en funcionamiento, ya que todas las dependencias están disponibles en estas plataformas.
fr_fr: Les plates-formes prises en charge par le niveau 1 sont entièrement testées en amont dans le cadre des processus de développement pour s'assurer que tout changement proposé fonctionnera correctement. Les binaires pré-compilés sont construits, testés et publiés dans PyPI dans le cadre du processus de publication. Ces plates-formes sont censées être installables avec un environnement Python fonctionnel, car toutes les dépendances sont disponibles sur ces plates-formes.
ja_jp: ティア１がサポートするプラットフォームは、開発プロセスの一環としてアップストリームで完全にテストされ、提案された変更が正しく機能することを確認します。コンパイル済みのバイナリは、リリースプロセスの一部としてビルド、テスト、および PyPI に公開されます。これらのプラットフォームではすべての依存関係が利用可能であるため、これらのプラットフォームは、機能している Python環境だけでインストール可能であることが期待されます。
pl_pl: Platformy obsługiwane na poziomie 1 są w pełni przetestowane nadrzędnie w ramach procesów projektowania w celu zapewnienia prawidłowego funkcjonowania proponowanych zmian. Wstępnie skompilowane pliki binarne są budowane, testowane i publikowane w PyPI w ramach procesu wydania. Oczekuje się, że platformy te będzie można zainstalować jedynie przy użyciu działającego środowiska Python, ponieważ wszystkie zależności są dostępne na tych platformach.
ta_in: எந்த முன்மொழியப்பட்ட மாற்றமும் சரியாகச் செயல்படுவதை உறுதிசெய்ய, டெவலப்மெண்ட் செயல்முறைகளின் ஒரு பகுதியாக, அடுக்கு 1 ஆதரிக்கப்படும் இயங்குதளங்கள் முழுவதுமாக அப்ஸ்ட்ரீமில் சோதிக்கப்படுகின்றன. முன்-தொகுக்கப்பட்ட பைனரிகள் கட்டமைக்கப்பட்டு, சோதனை செய்யப்பட்டு, வெளியீட்டுச் செயல்பாட்டின் ஒரு பகுதியாக PyPI இல் வெளியிடப்படுகின்றன. இந்த இயங்குதளங்களில் அனைத்து சார்புகளும் இருப்பதால், செயல்பாட்டில் உள்ள Python சுற்றுசூழலுடன் இந்த இயங்குதளங்கள் நிறுவப்படும் என எதிர்பார்க்கப்படுகிறது.
te_in: ఏదైనా ప్రతిపాదిత మార్పు సరిగ్గా పనిచేస్తుందని నిర్ధారించడానికి డెవలప్‌మెంట్ ప్రాసెస్‌లలో భాగంగా టైర్ 1 మద్దతు ఉన్న ప్లాట్‌ఫారమ్‌లు పూర్తిగా అప్‌స్ట్రీమ్‌లో పరీక్షించబడతాయి. విడుదల ప్రక్రియలో భాగంగా ముందుగా కంపైల్ చేయబడిన బైనరీలు నిర్మించబడ్డాయి, పరీక్షించబడతాయి మరియు PyPIకి ప్రచురించబడతాయి. ఈ ప్లాట్‌ఫారమ్‌లలో అన్ని డిపెండెన్సీలు అందుబాటులో ఉన్నందున ఈ ప్లాట్‌ఫారమ్‌లు కేవలం పనిచేసే python వాతావరణంతో ఇన్‌స్టాల్ చేయగలవని భావిస్తున్నారు.
tr_tr: Seviye 1 destekli platformlar, önerilen herhangi bir değişikliğin doğru şekilde çalışacağından emin olmak için geliştirme süreçlerinin bir parçası olarak tamamen test edilmiş üst yapılardır. Önceden derlenmiş ikili dosyalar, yayın sürecinin bir parçası olarak oluşturulur, test edilir ve PyPI'ya yayınlanır. Tüm bağımlılıklar bu platformlarda mevcut olduğundan, bu platformların yalnızca işleyen bir Python ortamıyla kurulabilmesi beklenir.
zh_cn: 第 1 层支持的平台在开发过程的上游经过完全的测试，以确保任何提议的改变都能正常运行。 预编译的二进制文件被构建、测试和发布到 PyPI 作为发布过程的一部分。 由于所有依赖关系都在这些平台上可用，因此这些平台只需要一个可以正常运行的 Python 环境就可以安装。

source: Tier 1 platforms are currently:
de_de: Tier 1 (Stufe 1) -Plattformen sind derzeit:
es_un: Las plataformas de nivel 1 actualmente son:
fr_fr: Les plateformes de niveau 1 sont actuellement:
ja_jp: ティア１プラットフォームの現在：
pl_pl: Platformy w ramach poziomu 1 to obecnie:
ta_in: தற்போது உள்ள அடுக்கு 1 இயங்குதளங்கள்:
te_in: ప్రస్తుతం ఉన్న టైర్ 1 ప్లాట్‌ఫారమ్‌లు:
tr_tr: Seviye 1 platformları şu anda:
zh_cn: 第 1 层平台当前为:

source: Linux x86_64 (distributions compatible with the `manylinux 2010 <https://www.python.org/dev/peps/pep-0571/>`__ packaging specification for Python < 3.10 and `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ for Python >= 3.10)
ta_in: Linux x86_64 (Python >= 3.10 -க்கு `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ மற்றும் Python < 3.10 -க்கு `manylinux 2010 <https://www.python.org/dev/peps/pep-0571/>`__ பேக்கேஜிங் விவரக்குறிப்புடன் இணக்கமான விநியோகங்கள்)

source: macOS x86_64 (10.9 or newer)
de_de: macOS x86_64 (10.9 oder neuer)
es_un: macOS x86_64 (10.9 o superior)
fr_fr: macOS x86_64 (10.9 ou plus récent)
ja_jp: macOS x86_64 (10.9 以降 )
pl_pl: macOS x86_64 (10.9 lub nowszy)
ta_in: macOS x86_64 (10.9 அல்லது புதியது)
te_in: MacOS x86_64 (10.9 లేదా న్యూయర్)
tr_tr: macOS x86_64 (10.9 veya daha yenisi)
zh_cn: macOS x86_64 (10.9 或更高版本)

source: Tier 2
de_de: Tier 2 (Stufe 2)
es_un: Nivel 2
fr_fr: Niveau 2
ja_jp: ティア２
pl_pl: Poziom 2
ta_in: அடுக்கு 2
tr_tr: Seviye 2
zh_cn: 第 2 层

source: Tier 2 platforms are not tested upstream as part of development process. However, pre-compiled binaries are built, tested, and published to PyPI as part of the release process and these packages can be expected to be installed with just a functioning Python environment.
de_de: Tier 2 (Stufe-2)-Plattformen werden nicht im Vorfeld als Teil des Entwicklungsprozesses getestet. Vorkompilierte Binärdateien werden jedoch als Teil des Releaseprozesses erstellt, getestet und für PyPI veröffentlicht, und diese Pakete können mit nur einer funktionierenden Python-Umgebung installiert werden.
es_un: Las plataformas de nivel 2 no se prueban en upstream como parte del proceso de desarrollo. Sin embargo, los binarios precompilados se construyen, prueban y publican en PyPI como parte del proceso de lanzamiento y se puede esperar que estos paquetes se instalen solo con un entorno de Python en funcionamiento.
fr_fr: Les plateformes de niveau 2 ne sont pas testées en amont dans le cadre du processus de développement. Cependant, les binaires pré-compilés sont construits, testés et publiés dans PyPI dans le cadre du processus de libération et ces paquets peuvent être installés avec un environnement Python fonctionnel.
ja_jp: ティア２プラットフォームは、開発プロセスの一部としてアップストリームでテストされていません。ただし、プリコンパイルされたバイナリは、リリースプロセスの一部としてビルド、テスト、および PyPI に公開され、これらのパッケージは、機能している Python環境のみでインストールされることが期待できます。
pl_pl: Platformy obsługiwane na poziomie 2 nie są w pełni przetestowane nadrzędnie w ramach procesów projektowania. Jednak, wstępnie skompilowane pliki binarne są budowane, testowane i publikowane w PyPI w ramach procesu wydania. Oczekuje się, że będzie można zainstalować te pakiety jedynie przy użyciu działającego środowiska Python.
ta_in: அடுக்கு 2 இயங்குதளங்கள் மேம்பாட்டின் ஒரு பகுதியாக அப்ஸ்ட்ரீமில் சோதனை செய்யப்படவில்லை. இருப்பினும், முன்-தொகுக்கப்பட்ட பைனரிகள் கட்டமைக்கப்பட்டு, சோதனை செய்யப்பட்டு, வெளியீட்டு செயல்முறையின் ஒரு பகுதியாக PyPI இல் வெளியிடப்படுகின்றன, மேலும் இந்த தொகுப்புகள் செயல்பாட்டில் உள்ள Python சுற்றுசூழலுடன் நிறுவப்படும் என்று எதிர்பார்க்கலாம்.
te_in: అభివృద్ధి ప్రక్రియలో భాగంగా టైర్ 2 ప్లాట్‌ఫారమ్‌లు అప్‌స్ట్రీమ్‌లో పరీక్షించబడవు. అయినప్పటికీ, విడుదల ప్రక్రియలో భాగంగా ముందుగా కంపైల్ చేయబడిన బైనరీలు నిర్మించబడతాయి, పరీక్షించబడతాయి మరియు PyPIకి ప్రచురించబడతాయి మరియు ఈ ప్యాకేజీలు కేవలం పనిచేసే python వాతావరణంతో ఇన్‌స్టాల్ చేయబడతాయని ఆశించవచ్చు.
tr_tr: Seviye 2 platformları, geliştirme sürecinin bir parçası olarak test edilmeyen üst yapılardır. Ancak, önceden derlenmiş ikili dosyalar, yayın sürecinin bir parçası olarak oluşturulur, test edilir ve PyPI'ya yayınlanır ve bu paketlerin yalnızca işleyen bir Python ortamıyla yüklenmesi beklenebilir.
zh_cn: 在开发过程中，第 2 层平台不会在上游进行测试。 但是，预先编译的二进制文件将作为发行版过程的一部分构建，测试并发布到 PyPI ，并且这些包可以仅使用一个正常运行的Python环境安装。

source: Tier 2 platforms are currently:
de_de: Tier 2 (Stufe 2) Plattformen sind derzeit:
es_un: Las plataformas de nivel 2 actualmente son:
fr_fr: Les plateformes de niveau 2 sont actuellement:
ja_jp: ティア２プラットフォームの現在：
pl_pl: Platformy poziomu 2 to obecnie:
ta_in: தற்போது உள்ள அடுக்கு 2 இயங்குதளங்கள்:
te_in: ప్రస్తుతం ఉన్న టైర్ 2 ప్లాట్‌ఫారమ్‌లు:
tr_tr: Seviye 2 platformları şu anda:
zh_cn: 第 2 层平台当前为:

source: Linux i686 (distributions compatible with the `manylinux 2010 <https://www.python.org/dev/peps/pep-0571/>`__ packaging specification) for Python < 3.10
ja_jp: Python < 3.10 向けの Linux i686 （ `manylinux 2010 <https://www.python.org/dev/peps/pep-0571/>`__ パッケージ仕様と互換性のあるディストリビューション）
ta_in: Linux i686 (`manylinux 2010 <https://www.python.org/dev/peps/pep-0571/>`__ பேக்கேஜிங் விவரக்குறிப்புடன் இணக்கமான விநியோகங்கள்) for Python < 3.10

source: Linux aarch64 (distributions compatible with the `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ packaging specification)
de_de: Linux aarch64 (Distributionen kompatibel mit der `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ Paketspezifikation)
es_un: Linux aarch64 (distribuciones compatibles con la especificación de empaquetado `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__)
fr_fr: Linux aarch64 (distributions compatibles avec la spécification `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__)
ja_jp: Linux aarch64（ `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ パッケージ仕様と互換性のあるディストリビューション）
pl_pl: Linux aarch64 (dystrybucje zgodne ze specyfikacją pakietu `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__)
ta_in: Linux aarch64 (`manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ பேக்கேஜிங் விவரக்குறிப்புடன் இணக்கமான விநியோகங்கள்)
te_in: Linux aarch64(`manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ ప్యాకేజింగ్ స్పెసిఫికేషన్‌కు అనుకూలంగా ఉన్న పంపిణీలు)
tr_tr: Linux aarch64 (`manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ paketleme özellikleri ile uyumlu dağıtımlar)
zh_cn: Linux aarch64 (Python的发行版本与 `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ 打包规范兼容的分发版)

source: Tier 3
de_de: Stufe 3
es_un: Nivel 3
fr_fr: Niveau 3
ja_jp: ティア３
pl_pl: Poziom 3
ta_in: அடுக்கு 3
tr_tr: Seviye 3
zh_cn: 第 3 层

source: Tier 3 platforms are not tested upstream as part of the development process. Pre-compiled binaries are built and published to PyPI as part of the release process, with no testing at all. They may not be installable with just a functioning Python environment and may require a C/C++ compiler or additional programs to build dependencies from source as part of the installation process. Support for these platforms are best effort only.
de_de: Stufe-3-Plattformen werden nicht als Teil des Entwicklungsprozesses getestet. Vorkompilierte Binärdateien werden in PyPI als Teil des Release-Prozesses erstellt und veröffentlicht, ohne dass es überhaupt zu Testen kommt. Möglicherweise sind sie nicht nur mit einer funktionierenden Python-Umgebung installierbar und benötigen möglicherweise einen C/C++-Compiler oder zusätzliche Programme, um Abhängigkeiten aus dem Quellcode als Teil des Installationsprozesses zu erstellen. Diese Plattformen werden nur auf der Grundlage von "best effort support" unterstützt.
es_un: Las plataformas de nivel 3 no se prueban en upstream como parte del proceso de desarrollo. Los binarios precompilados se construyen y publican en PyPI como parte del proceso de lanzamiento, sin ninguna prueba. Es posible que no se puedan instalar solo con un entorno de Python en funcionamiento y pueden requerir un compilador C/C++ o programas adicionales para crear dependencias desde el origen como parte del proceso de instalación. El soporte para estas plataformas es únicamente de mejores intenciones.
fr_fr: Les plateformes de niveau 3 ne sont pas testées en amont dans le cadre du processus de développement. Les binaires pré-compilés sont construits et publiés dans PyPI dans le cadre du processus de publication, sans aucun test du tout. Ils peuvent ne pas être installables uniquement avec un environnement Python fonctionnel et peuvent nécessiter un compilateur C/C++ ou des programmes supplémentaires pour construire des dépendances à partir des sources dans le cadre du processus d'installation. La prise en charge de ces plates-formes est le meilleur effort possible.
ja_jp: ティア３プラットフォームは、開発プロセスの一部としてアップストリームでテストされていません。コンパイル済みのバイナリは、リリースプロセスの一部としてビルドされ、PyPI に公開されます。テストはまったく行われません。Python環境が機能しているだけではインストールできない場合があり、インストールプロセスの一部としてソースから依存関係を構築するためにC / C ++コンパイラまたは追加のプログラムが必要になる場合があります。これらのプラットフォームのサポートは最善の努力のみです。
pl_pl: Platformy poziomu 3 nie są testowane na wcześniejszych etapach projektowania. Wstępnie skompilowane pliki binarne są budowane i publikowane w PyPI jako część procesu wydania bez żadnych testów. Nie da się ich instalować tylko w działającym środowisku Pythona i mogą wymagać kompilatora C/C++ lub dodatkowych programów do budowania zależności ze źródła jako części procesu instalacji. Wspieranie tych platform opiera się na zasadzie "best effort".
ta_in: டெவலப்மென்ட் செயல்பாட்டின் ஒரு பகுதியாக அடுக்கு 3 இயங்குதளங்கள் அப்ஸ்ட்ரீமில் சோதிக்கப்படவில்லை. முன்-தொகுக்கப்பட்ட பைனரிகள் எந்த சோதனையும் இல்லாமல், வெளியீட்டு செயல்முறையின் ஒரு பகுதியாக PyPI இல் கட்டமைக்கப்பட்டு வெளியிடப்படுகின்றன. அவை செயல்பாட்டில் உள்ள Python சுற்றுசூழலில் மட்டுமே நிறுவப்பட முடியாமல் இருக்கலாம் மற்றும் நிறுவல் செயல்முறையின் ஒரு பகுதியாக மூலத்திலிருந்து சார்புகளை உருவாக்குவதற்கு C/C++ கம்பைலர் அல்லது கூடுதல் நிரல்கள் தேவைப்படலாம். இந்த இயங்குதளங்களுக்கான ஆதரவு சிறந்த முயற்சி மட்டுமே.
te_in: అభివృద్ధి ప్రక్రియలో భాగంగా టైర్ 3 ప్లాట్‌ఫారమ్‌లు అప్‌స్ట్రీమ్‌లో పరీక్షించబడవు. ముందుగా సంకలనం చేయబడిన బైనరీలు ఎటువంటి పరీక్ష లేకుండా, విడుదల ప్రక్రియలో భాగంగా PyPIకి నిర్మించబడతాయి మరియు ప్రచురించబడతాయి. అవి కేవలం పనిచేసే పైథాన్ ఎన్విరాన్‌మెంట్‌తో ఇన్‌స్టాల్ చేయలేకపోవచ్చు మరియు ఇన్‌స్టాలేషన్ ప్రాసెస్‌లో భాగంగా సోర్స్ నుండి డిపెండెన్సీలను రూపొందించడానికి C/C++ కంపైలర్ లేదా అదనపు ప్రోగ్రామ్‌లు అవసరం కావచ్చు. ఈ ప్లాట్‌ఫారమ్‌లకు మద్దతు ఉత్తమ ప్రయత్నం మాత్రమే.
tr_tr: Seviye 3 platformları, geliştirme sürecinin bir parçası olarak test edilmeyen üst yapılardır. Önceden derlenmiş ikili dosyalar, hiçbir test yapılmadan yayın sürecinin bir parçası olarak oluşturulur ve PyPI'ya yayınlanır. Yalnızca işleyen bir Python ortamıyla yüklenemeyebilirler ve yükleme işleminin bir parçası olarak kaynaktan bağımlılıklar oluşturmak için bir C/C++ derleyicisi veya ek programlar gerektirebilir. Bu platformlar için destek daha arka plandadır.
zh_cn: 在开发过程中，第 3 层平台不会在上游进行测试。 预编译二进制文件构建并发布到 PyPI 作为释放过程的一部分，完全没有测试。 仅使用一个正常运行的Python环境可能无法安装它们，可能还需要 C/C++ 编译器或其他程序作为安装过程的一部分从源代码构建依赖关系。 对这些平台的支持只尽了最大的努力。

source: Tier 3 platforms are currently:
de_de: Stufe 3 Plattformen sind derzeit:
es_un: Las plataformas de nivel 3 actualmente son:
fr_fr: Les plateformes de niveau 3 sont actuellement:
ja_jp: ティア３プラットフォームの現在：
pl_pl: Platformy poziomu 3 to obecnie:
ta_in: தற்போது உள்ள அடுக்கு 3 இயங்குதளங்கள்:
te_in: ప్రస్తుతం ఉన్న టైర్ 3 ప్లాట్‌ఫారమ్‌లు:
tr_tr: Seviye 3 platformları şu anda:
zh_cn: 第 3 层平台当前为:
