Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/getting_started.po
Languages: de_de, es_mx, es_un, fr_fr, id_id, it_it, ja_jp, pl_pl, ta_in, te_in, tr_tr, vi_vn, zh_cn

source: Now that you have learnt the basics, consider these learning resources:
es_mx: Ya que aprendimos los conceptos básicos, los siguientes recursos de aprendizaje pueden ser de gran utilidad:
id_id: Sekarang Anda telah mempelajari dasar-dasarnya, silahkan akses sumber belajar lainnya dibawah ini:
it_it: Ora che conosci i concetti di base, considera le seguenti risorse di approfondimento:

source: `About the Qiskit framework <the_elements.html>`__
es_mx: `Acerca del entorno Qiskit <the_elements.html>`__
id_id: `Tentang kerangka Qiskit <the_elements.html>`__
it_it: `La struttura di Qiskit <the_elements.html>`__

source: `Qiskit documentation <apidoc/qiskit.html>`__
es_mx: `Documentación de Qiskit <apidoc/qiskit.html>`__
it_it: `la documentazione di Qiskit <apidoc/qiskit.html>`__

source: `Qiskit tutorials <https://nbviewer.jupyter.org/github/Qiskit/qiskit-tutorials/blob/master/qiskit/1_start_here.ipynb>`__
es_mx: `Tutoriales para Qiskit <https://nbviewer.jupyter.org/github/Qiskit/qiskit-tutorials/blob/master/qiskit/1_start_here.ipynb>`__
it_it: `I tutorial di Qiskit <https://nbviewer.jupyter.org/github/Qiskit/qiskit-tutorials/blob/master/qiskit/1_start_here.ipynb>`__

source: `Textbook: Learn Quantum Computing using Qiskit <https://community.qiskit.org/textbook/preface>`__
es_mx: `Libro: Learn Quantum Computing using Qiskit <https://community.qiskit.org/textbook/preface>`__
id_id: `Buku teks: Learn Quantum Computing using Qiskit <https://community.qiskit.org/textbook/preface>`__

source: `Video series: Coding with Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`__
es_mx: `Serie de Videos: Coding with Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`__
id_id: `Kumpulan seri video: Coding dengan Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`__
it_it: `Serie di video: Coding with Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`__

source: ``QuantumCircuit.measure([0,1], [0,1])``: if you pass the entire quantum and classical registers to ``measure``, the ith qubitâ€™s measurement result will be stored in the ith classical bit.
id_id: ``QuantumCircuit.measure([0, 1], [0, 1])``: jika Anda melewati seluruh register kuantum dan klasik untuk ``mengukur``, hasil pengukuran qubit ke i akan disimpan dalam bit klasik ke i.

source: `Qiskit tutorials <tutorials/circuits/index.rst>`__
id_id: `Tutorial Qiskit <tutorials/circuits/index.rst>`__
