Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/getting_started.po
Languages: de_de, es_mx, es_un, fr_fr, id_id, it_it, ja_jp, pl_pl, ta_in, te_in, tr_tr, vi_vn, zh_cn

source: To install Aer depend on which operating system you are using. Since Aer is a compiled C++ program with a Python interface, there are non-Python dependencies for building the Aer binary which can't be installed universally depending on operating system.
de_de: Die Installation von Aer ist abhängig vom verwendeten Betriebssystem. Da Aer ein kompiliertes C++ Programm mit Python-Schnittstelle ist, gibt es noch Nicht-Python-Abhängigkeiten für die Erstellung der Aer Binärdatei. Diese können je nach Betriebssystem nicht universell installiert werden.
fr_fr: L'installation d'Aer dépend du système d'exploitation que vous utilisez. Comme Aer est un programme C++ compilé avec une interface Python, il y a des dépendances non-Python pour construire le binaire Aer qui ne peut pas être installé universellement en fonction du système d'exploitation.
pl_pl: Instalacja repozytorium Aer zależy od tego, którego systemu operacyjnego używasz. Jako że Aer to skompilowany program C++ z interfejsem Pythona, istnieją zależności spoza Pythona do stworzenia pliku binarnego Aer, których nie można zainstalować tak samo, w zależności od systemu operacyjnego.
te_in: Aerని ఇన్‌స్టాల్ చేయడానికి మీరు ఉపయోగిస్తున్న ఆపరేటింగ్ సిస్టమ్‌పై ఆధారపడి ఉంటుంది. Aer అనేది Python ఇంటర్‌ఫేస్‌తో సంకలనం చేయబడిన C++ ప్రోగ్రామ్ కాబట్టి, Aer బైనరీని నిర్మించడానికి non-Python డిపెండెన్సీలు ఉన్నాయి, ఇవి ఆపరేటింగ్ సిస్టమ్‌పై ఆధారపడి విశ్వవ్యాప్తంగా ఇన్‌స్టాల్ చేయబడవు.
tr_tr: Kullandığınız işletim sistemine bağlı olarak Aer'i yükledik. Aer, Python arayüzüyle derlenmiş bir C++ programı olduğundan, işletim sistemine bağlı olarak evrensel olarak yüklenemeyen Aer ikili dosyasını oluşturmak için Python dışı bağımlılıklar mevcuttur.

source: All dependencies are added as part of the Visual C++ compiler installed above, so no additional setup is needed.
de_de: Alle Abhängigkeiten werden als Teil des oben installierten Visual C + + -Compilers hinzugefügt, so dass keine zusätzliche Konfiguration erforderlich ist.
fr_fr: Toutes les dépendances sont ajoutées dans le compilateur Visual C++ installé ci-dessus, donc aucune installation supplémentaire n'est nécessaire.
pl_pl: Dodatkowa konfiguracja nie jest wymagana, ponieważ wszystkie zależności są częścią wcześniej zainstalowanego kompilatora Visual C++.
te_in: పైన ఇన్‌స్టాల్ చేయబడిన విజువల్ C++ కంపైలర్‌లో భాగంగా అన్ని డిపెండెన్సీలు జోడించబడ్డాయి, కాబట్టి అదనపు సెటప్ అవసరం లేదు.
tr_tr: Tüm bağımlılıklar, yukarıda kurulu Visual C++ derleyicisinin bir parçası olarak eklenir, bu nedenle ek kurulum gerekmez.

source: setuptools
fr_fr: outils d'installation (setuptools)
pl_pl: narzędzia setuptools

source: Windows
te_in: విండోస్

source: If you need to set a custom option during the wheel build, refer to :ref:`Custom options <aer_wheel_build_options>`.
te_in: మీరు వీల్ బిల్డ్ సమయంలో అనుకూల ఎంపికను సెట్ చేయాలనుకుంటే, :ref:`అనుకూల ఎంపికలు <aer_wheel_build_options>`ని చూడండి.

source: Linux x86_64 (distributions compatible with the `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ packaging specification).
te_in: Linux x86_64 (పంపిణీలు `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ ప్యాకేజింగ్ స్పెసిఫికేషన్‌కు అనుకూలంగా ఉంటాయి).

source: Getting Started with Qiskit
es_mx: Primeros Pasos con Qiskit
id_id: Mulai Bekerja dengan Qiskit
it_it: Come Iniziare con Qiskit

source: The workflow of using Qiskit consists of three high-level steps:
es_mx: El flujo de trabajo con Qiskit consiste de 3 pasos principales:
id_id: Alur kerja dalam menggunakan Qiskit terdiri dari tiga langkah umum:
it_it: Il flusso di lavoro per l'utilizzo di Qiskit consiste in tre fasi di alto livello:

source: **Build**: design a quantum circuit that represents the problem you are considering.
es_mx: **Construcción**: diseñar un circuito cuántico que represente el problema que está siendo considerando.
id_id: **Membuat**: mendesain sebuah sirkuit kuantum yang merepresentasikan masalah yang sedang Anda tinjau.
it_it: **Costruire**: disegna un circuito quantistico che rappresenta il problema preso in considerazione.

source: **Execute**: run experiments on different backends (*which include both systems and simulators*).
es_mx: **Ejecución**: ejecutar experimentos en diferentes backends (*los cuales incluyen tanto sistemas como simuladores*).
id_id: **Eksekusi**: menjalankan eksperimen pada backends yang berbeda (*yang mencakup sistem dan simulator*).
it_it: **Eseguire**: esegui esperimenti su diversi backend (*che includono sia sistemi reali che simulatori*).

source: **Analyze**: calculate summary statistics and visualize the results of experiments.
es_mx: **Análisis**: calcular resúmenes de estadísticas y visualizar resultados de los experimentos.
id_id: **Analisa**: menghitung ringkasan statistik dan memvisualisasikan hasil eksperimen.
it_it: **Analizzare**: calcola statistiche riassuntive e visualizzare i risultati degli esperimenti.

source: Here is an example of the entire workflow, with each step explained in detail in subsequent sections:
es_mx: He aquí un ejemplo de todo el flujo de trabajo. Cada paso es explicado en detalle en las secciones subsecuentes:
id_id: Berikut ini adalah contoh dari keseluruhan alur kerja, dengan setiap langkah akan dijelaskan secara rinci pada bagian berikutnya:
it_it: Ecco un esempio dell'intero flusso di lavoro, dove ogni passaggio sarà dettagliato nelle sezione successive:

source: Workflow Step--by--Step
es_mx: Flujo de trabajo paso a paso
id_id: Langkah Alur Kerja
it_it: Flusso di Lavoro Passo dopo Passo

source: The program above can be broken down into six steps:
es_mx: El programa presentado anteriormente puede ser dividido en seis pasos:
id_id: Program di atas dapat dibagi menjadi enam langkah:
it_it: Il programma sopra riportato può essere suddiviso in sei passaggi:

source: Import packages
es_mx: Importar paquetes
id_id: Impor paket
it_it: Importare i pacchetti

source: Initialize variables
es_mx: Inicializar variables
id_id: Menginisialisasi variabel
it_it: Inizializzare le variabili

source: Add gates
es_mx: Agregar compuertas
id_id: Menambah gerbang (kuantum)
it_it: Aggiungere i gate

source: Visualize the circuit
es_mx: Visualización del circuito
id_id: Visualisasi rangkaian sirkuit
it_it: Visualizzare il circuito

source: Simulate the experiment
es_mx: Simular el experimento
id_id: Mensimulasikan eksperimen
it_it: Simulare l'esperimento

source: Visualize the results
es_mx: Visualizar los resultados
id_id: Memvisualisasikan hasil
it_it: Visualizzare i risultati

source: Step 1 : Import Packages
es_mx: Paso 1: Importar paquetes
id_id: Langkah 1: Impor Paket
it_it: Passo 1: Importare i Pacchetti

source: The basic elements needed for your program are imported as follows:
es_mx: Los elementos básicos necesarios para el programa son importados como se muestra a continuación:
id_id: Elemen dasar yang dibutuhkan untuk program Anda dapat diimpor sebagai berikut:
it_it: Gli elementi di base necessari per il tuo programma si importano nel modo seguente:

source: In more detail, the imports are
es_mx: Con más detalle, las importaciones son
id_id: Secara lebih rinci, yang diimpor adalah
it_it: Più in dettaglio, le istruzioni di import sono

source: ``QuantumCircuit``: can be thought as the instructions of the quantum system. It holds all your quantum operations.
es_mx: ``QuantumCircuit``: puede ser interpretado como las instrucciones del sistema cuántico. Contiene todas las operaciones cuánticas.
id_id: ``QuantumCircuit``: dapat dianggap sebagai instruksi dari sistem kuantum. Ini yang menampung semua operasi kuantum Anda.
it_it: ``QuantumCircuit``: può essere considerato l'insieme delle istruzioni del sistema quantistico. Contiene tutte le operazioni quantistiche.

source: ``execute``: runs your circuit / experiment.
es_mx: ``execute``: Ejecuta el circuito / experimento.
id_id: ``execute``: menjalankan/mengeksekusi rangkaian sirkuit/eksperimen Anda.
it_it: ``execute``: esegue il tuo circuito / esperimento.

source: ``Aer``: handles simulator backends.
es_mx: ``Aer``: Maneja los backends de simulación.
id_id: ``Aer``: menangani backend simulator.
it_it: ``Aer``: si occupa dei backend per le simulazioni.

source: ``plot_histogram``: creates histograms.
es_mx: ``plot_histogram``: crea histogramas.
id_id: ``plot_histogram``: membuat histogram.
it_it: ``plot_histogram``: crea istogrammi.

source: Step 2 : Initialize Variables
es_mx: Paso 2: Inicializar Variables
id_id: Langkah 2: Menginisialisasi Variabel
it_it: Passo 2 : Inizializzare le variabili

source: Consider the next line of code
es_mx: Consideremos la siguiente linea de código
id_id: Perhatikan baris kode berikut
it_it: Considera la seguente linea di codice

source: Here, you are initializing with 2 qubits in the zero state; with 2 classical bits set to zero; and ``circuit`` is the quantum circuit.
es_mx: Aquí, estamos inicializando un circuito con 2 qubits en el estado cero; 2 bits clásicos con valor cero; y ``circuit`` es el circuito cuántico.
id_id: Di sini, anda melakukan inisialisasi dengan 2 qubit dalam keadaan nol; dengan 2 bit klasik yang diatur ke nilai nol dan ``circuit`` adalah sirkuit kuantum.
it_it: Qui si stanno inizializzando 2 qubit nello stato zero; con 2 bit classici impostati a zero; e ``circuit`` è il circuito quantistico.

source: Syntax:
es_mx: Sintaxis:
id_id: Sintaksis:
it_it: Sintassi:

source: Step 3 : Add Gates
es_mx: Paso 3: Agregar Compuertas
id_id: Langkah 3: Menambahkan Gerbang (Kuantum)
it_it: Passo 3: Aggiungere i Gate

source: You can add gates (operations) to manipulate the registers of your circuit.
es_mx: Podemos agregar compuertas (operaciones) para manipular los registros del circuito.
id_id: Anda dapat menambahkan gerbang (operasi) untuk memanipulasi register dari sirkuit Anda.
it_it: Puoi aggiungere gate (operazioni) per manipolare i registri del tuo circuito.

source: Consider the following three lines of code:
es_mx: Consideremos las siguientes tres líneas de código:
id_id: Perhatikan tiga baris kode berikut:
it_it: Considera le seguenti tre linee di codice:

source: The gates are added to the circuit one-by-one to form the Bell state
es_mx: Las compuertas son agregadas al circuito una por una para formar el siguiente "Bell state"
id_id: Gerbang ditambahkan ke sirkuit secara satu-per-satu untuk membentuk keadaan Bell
it_it: I gate sono aggiunti al circuito uno ad uno per formare lo stato di Bell

source: The code above applies the following gates:
es_mx: El código mostrado anteriormente utiliza las siguientes compuertas:
id_id: Kode di atas menerapkan gerbang berikut:
it_it: Il codice sopra riportato applica i seguenti gate:

source: ``QuantumCircuit.h(0)``: A Hadamard gate :math:`H` on qubit 0, which puts it into a **superposition state**.
es_mx: ``QuantumCircuit.h(0)``: Una compuerta "Hadamard" :math: 'H' en el qubit 0, que pone al qubit en un **estado de superposición**.
id_id: ``QuantumCircuit.h(0)``: Sebuah gerbang Hadamard :math:`H` pada qubit 0, menempatkan qubit ini ke dalam **keadaan superposisi**.
it_it: ``QuantumCircuit.h(0)``: Un gate Hadamard :math:`H` sul qubit 0, che lo pone in uno **stato di sovrapposizione**.

source: ``QuantumCircuit.cx(0, 1)``: A controlled-Not operation (:math:`C_{X}`) on control qubit 0 and target qubit 1, putting the qubits in an **entangled state**.
es_mx: "QuantumCircuit.cx(0,1)": Una operacion controlled-Not (:math:'C_{X}') en el qubit de control 0 y el qubit objetivo 1, poniendo a los qubits en un **estado de entrelazamiento**.
id_id: ``QuantumCircuit.cx(0, 1)``: Sebuah operasi Not terkontrol (:math:`C_{X}`) pada qubit kontrol 0 dan qubit target 1, menempatkan kedua qubit dalam keadaan **Keadaan terkait**.
it_it: ``QuantumCircuit.cx(0, 1)``: Un'operazione di Not controllata (:math:`C_{X}`) sul qubit di controllo 0 e qubit target 1, che pone i qubit in uno **stato di entanglement**.

source: ``QuantumCircuit.measure([0,1], [0,1])``: if you pass the entire quantum and classical registers to ``measure``, the ith qubit’s measurement result will be stored in the ith classical bit.
es_mx: ``QuantumCircuit.measure([0,1],[0,1])``: Si pasamos los registros cuánticos y clásicos a la instrucción ``measure``, el resultado de la medición sobre el i-ésimo qubit sera almacenado en el i-ésimo bit clásico.
it_it: ``QuantumCircuit.measure([0,1], [0,1])``: quando si passa il registro quantistico ed il registro classico a ``measure``, il risultato della misurazione del qubit nella posizione i verrà salvato nel bit classico in posizione i.

source: Step 4 : Visualize the Circuit
es_mx: Paso 4: Visualizando el Circuito
id_id: Langkah 4: Visualisasi Sirkuit
it_it: Passo 4 : Visualizzare il Circuito

source: You can use ``QuantumCircuit.draw()`` to view the circuit that you have designed in the `various forms <api/qiskit.circuit.QuantumCircuit.html#qiskit.circuit.QuantumCircuit.draw>`__ used in many textbooks and research articles.
es_mx: Podemos usar ``QuantumCircuit.draw()`` para ver el circuito que hemos diseñado en los `diferentes formatos <api/qiskit.circuit.QuantumCircuit.html#qiskit.circuit.QuantumCircuit.draw>`__ usados en libros y artículos de investigación.
id_id: Anda dapat menggunakan ``QuantumCircuit.draw()`` untuk melihat sirkuit yang telah Anda rancang dalam `berbagai bentuk <api/qiskit.circuit.QuantumCircuit.html#qiskit.circuit.QuantumCircuit.draw>`__ yang telah digunakan dalam banyak buku teks dan artikel penelitian.
it_it: Puoi usare ``QuantumCircuit.draw()`` per visualizzare il circuito che hai disegnato nelle `varie forme <api/qiskit.circuit.QuantumCircuit.html#qiskit.circuit.QuantumCircuit.draw>`__ utilizzate in molti testi ed articoli di ricerca.

source: In this circuit, the qubits are ordered with qubit zero at the top and qubit one at the bottom. The circuit is read left-to-right, meaning that gates which are applied earlier in the circuit show up farther to the left.
es_mx: En este circuito, los qubits son ordenados con el qubit cero en la parte superior y el qubit uno en la parte inferior. Este circuito se lee de izquierda a derecha, lo que quiere decir que, las compuertas se aplican de izquierda a derecha.
id_id: Dalam sirkuit ini, qubit-qubit disusun dengan qubit nol di bagian atas dan qubit satu di bagian bawah. Sirkuit ini dibaca dari kiri ke kanan, yang berarti bahwa gerbang yang diterapkan terlebih dahulu muncul lebih ke kiri.
it_it: In questo circuito, i qubit sono ordinati con il qubit zero nella parte alta del circuito ed il qubit uno in basso. Il circuito si legge da sinistra verso destra, ovvero i gate che vengono applicati prima nel circuito appaiono più a sinistra.

source: The default backend for ``QuantumCircuit.draw()`` or ``qiskit.visualization.circuit_drawer()`` is the text backend. However, depending on your local environment you may want to change these defaults to something better suited for your use case. This is done with the user config file. By default the user config file should be located in ``~/.qiskit/settings.conf`` and is a ``.ini`` file.
es_mx: El "backend" que Qiskit usa por defecto para ``QuantumCircuit.draw()`` o ``qiskit.visualization.circuit_drawer()`` es el backend de texto. Sin embargo, dependiendo de nuestro entorno local, es posible cambiar estos valores predeterminados por otros más adecuados. Esto se hace con el archivo de configuración de usuario. Por defecto, el archivo de configuración de usuario se encuentra ubicado en ``~/.qiskit/settings.conf`` y es un archivo ``.ini``.
id_id: Backend lazim untuk ``QuantumCircuit.draw()`` atau ``qiskit.visualization.circuit_drawer()`` adalah backend teks. Namun, tergantung pada environment lokal yang digunakan, Anda mungkin ingin mengubah ini menjadi sesuatu yang lebih cocok untuk kasus Anda. Hal ini dapat dilakukan dengan file konfigurasi pengguna. File konfigurasi pengguna ini seharusnya ada di dalam ``~/.qiskit/settings.conf`` dan merupakan file ``.ini``.
it_it: Il backend predefinito per ``QuantumCircuit.draw()`` o ``qiskit.visualization.circuit_drawer()`` è il backend text. Tuttavia, a seconda del tuo ambiente locale potresti voler modificare il default in qualcosa di più adatto ad un caso d'uso specifico. È possibile farlo modificando il file di configurazione utente. Il percorso predefinito del file di configurazione è ``~/qiskit/settings.conf`` ed è un file di tipo ``.ini``.

source: For example, a ``settings.conf`` file for setting a Matplotlib drawer is:
es_mx: Por ejemplo, un archivo ``settings.conf`` para ajustar un Matplotlib "drawer" es:
id_id: Sebagai contoh, sebuah ``settings.conf`` untuk pengaturan Matplotlib drawer adalah:
it_it: Un esempio di file ``settings.conf`` per impostare un drawer Matplotlib è:

source: You can use any of the valid circuit drawer backends as the value for this config, this includes text, mpl, latex, and latex_source.
es_mx: Podemos usar cualquiera de los "backends" de visualización de circuitos válidos para esta configuración, esto incluye: text, mpl, latex, y latex_source.
id_id: Anda dapat menggunakan salah satu dari backend pemvisualisasi sirkuit yang valid sebagai nilai untuk konfigurasi ini, ini termasuk text, mpl, latex, dan latex_source.
it_it: Puoi usare qualsiasi backend drawer valido come valore per questa impostazione, come text, mpl, latex, e latex_source.

source: Step 5 : Simulate the Experiment
es_mx: Paso 5: Simular el Experimento
id_id: Langkah 5: Simulasi Eksperimen
it_it: Passo 5: Simulare l'Esperimento

source: Qiskit Aer is a high performance simulator framework for quantum circuits. It provides `several backends <apidoc/providers/aer/aer_backends.html>`__ to achieve different simulation goals.
es_mx: Qiskit Aer es un sistema de simulaciones de alto desempeño para circuitos cuánticos. Aer provee `varios backends <apidoc/providers/aer/aer_backends.html>`__ para obtener diferentes objetivos en las simulaciones.
id_id: Qiskit Aer adalah sebuah kerangka simulator performa tinggi untuk sirkuit kuantum. Qiskit Aer menyediakan `beberapa backend <apidoc/providers/aer/aer_backends.html>`__ untuk mencapai tujuan simulasi yang berbeda.
it_it: Qiskit Aer è un framework di simulazione per circuiti quantistici ad alta prestazione. Mette a disposizione `diversi backend <apidoc/providers/aer/aer_backends.html>`__ che permettono di effettuare simulazioni per diversi scopi.

source: If you have issues installing Aer, you can alternatively use the Basic Aer provider by replacing `Aer` with `BasicAer`. Basic Aer is included in Qiskit Terra.
es_mx: Si encontramos problemas instalando Aer, podemos utilizar alternativamente el proveedor Basic Aer sustituyendo `Aer` con `BasicAer`. Basic Aer está incluido en Qiskit Terra.
id_id: Jika Anda mendapati masalah dalam menginstal Aer, Anda dapat menggunakan penyedia Basic Aer sebagai alternatif dengan mengganti `Aer` dengan `BasicAer`. Basic Aer sudah termasuk dalam Qiskit Terra.
it_it: Se si incontrano problemi nell'installazione di Aer, in alternativa si può utilizzare il provider Basic Aer semplicemente sostituendo `Aer` con `BasicAer`. Basic Aer è incluso in Qiskit Terra.

source: To simulate this circuit, you will use the ``qasm_simulator``. Each run of this circuit will yield either the bit string 00 or 11.
es_mx: Para simular este circuito, usaremos ``qasm_simulator``. Cada ejecución del este circuito producirá la cadena de bits 00 o 11.
id_id: Untuk mensimulasikan sirkuit ini, Anda akan menggunakan ``qasm_simulator``. Setiap kali menjalankan sirkuit, sirkuit ini akan menghasilkan antara string bit 00 atau 11.
it_it: Per simulare questo circuito, userai il ``qasm_simulator``. Ogni esecuzione di questo circuito produrrà come risultato la stringa di bit 00 o 11.

source: As expected, the output bit string is 00 approximately 50 percent of the time. The number of times the circuit is run can be specified via the ``shots`` argument of the ``execute`` method. The number of shots of the simulation was set to be 1000 (the default is 1024).
es_mx: Tal y como lo esperábamos, la cadena de bits obtenida es 00 aproximadamente el 50 por ciento de las veces. El número de veces que el circuito es ejecutado puede especificarse a través del argumento ``shots`` del método ``execute``. El número de "shots" de la simulación anterior fue 1000 (el valor por defecto es 1024).
id_id: Seperti yang diharapkan, keluaran string bit adalah 00 kira-kira 50 persen dari total. Jumlah berapa kali sirkuit dijalankan dapat dispesifikasikan melalui argumen ``shots`` dari metode ``execute``. Jumlah tembakan/shots dari simulasi ini diatur menjadi 1000 (pengaturan awalnya adalah 1024).
it_it: Come previsto, la stringa di bit risultante è 00 per circa il 50 percento delle volte. Il numero di volte che il circuito viene eseguito può essere specificato utilizzando l'argomento ``shots`` del metodo ``execute``. Il numero di shot della simulazione era impostato su 1000 (il valore predefinito è 1024).

source: Once you have a ``result`` object, you can access the counts via the method ``get_counts(circuit)``. This gives you the aggregate outcomes of the experiment you ran.
es_mx: Una vez que obtengamos un objeto de tipo ``result``, podemos acceder a los conteos a través del método ``get_counts(circuit)``. Esto nos da los conjuntos de resultados del experimento que ejecutamos.
id_id: Setelah Anda memiliki objek ``result``, Anda dapat mengakses counts dengan metode ``get_counts(circuit)``. Ini akan memberikan Anda hasil agregat dari percobaan yang Anda jalankan.
it_it: Una volta che hai un oggetto ``result``, puoi accedere ai conteggi utilizzando il metodo ``get_counts(circuit)``. Questo fornirà i risultati aggregati dell'esperimento eseguito.

source: Step 6 : Visualize the Results
es_mx: Paso 6: Visualizar los Resultados
id_id: Langkah 6: Memvisualisasikan Hasil
it_it: Passo 6 : Visualizzare i Risultati

source: Qiskit provides `many visualizations <apidoc/visualization.html>`__,
es_mx: Qiskit proporciona `muchas visualizaciones <apidoc/visualization.html>`__,
id_id: Qiskit menyediakan `berbagai macam visualisasi <apidoc/visualization.html>`__,
it_it: Qiskit fornisce `diverse tipologie di visualizzazione <apidoc/visualization.html>`__,

source: including the function ``plot_histogram``, to view your results.
es_mx: incluyendo la función ``plot_histogram`` para ver los resultados.
id_id: termasuk fungsi ``plot_histogram``, untuk melihat hasil Anda.
it_it: inclusa la funzione ``plot_histogram`` per visualizzare i tuoi risultati.

source: The observed probabilities :math:`Pr(00)` and :math:`Pr(11)` are computed by taking the respective counts and dividing by the total number of shots.
es_mx: Las probabilidades observadas :math:`Pr(00)` y :math:`Pr(11)` se calculan tomando los respectivos conteos y dividiendo por el número total de intentos (shots).
id_id: Probabilitas yang diamati :math:`Pr(00)` dan :math:`Pr(11)` dihitung dengan mengambil counts masing-masing dan dibagi dengan total jumlah tembakan/shots.
it_it: Le probabilità osservate :math:`Pr(00)` and :math:`Pr(11)` sono calcolate dividendo il conteggio rispettivo per il numero totale di shot.

source: Try changing the ``shots`` keyword in the ``execute`` method to see how the estimated probabilities change.
es_mx: Intenta cambiar el número de ``shots`` en el método ``execute`` para ver cómo cambian las probabilidades estimadas.
id_id: Cobalah ubah argumen ``shots`` pada metode ``execute`` untuk melihat bagaimana estimasi probabilitas berubah.
it_it: Prova a modificare il valore la parola chiave ``shots`` nel metodo ``execute`` per vedere come cambiano le probabilità risultanti.

source: Next Steps
es_mx: Siguientes Pasos
id_id: Langkah Selanjutnya
it_it: Prossimi Passi
