Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/getting_started.po
Languages: de_de, es_mx, es_un, fr_fr, id_id, it_it, ja_jp, pl_pl, ta_in, te_in, tr_tr, vi_vn, zh_cn

source: Linux i686 (distributions compatible with the `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ packaging specification) for Python >= 3.10
de_de: Linux i686 (Distributionen kompatibel mit der ` manylinux 2010 <https://www.python.org/dev/peps/pep-0599/>` __ Paketspezifikation) für Python > = 3.10
es_un: Linux i686 (distribuciones compatibles con la especificación de empaquetado `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__) para Python >= 3.10
fr_fr: Linux i686 (distributions compatibles avec les spécifications d'empaquetage `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__) pour Python >= 3.10
pl_pl: Linux i686 (dystrybucje zgodne ze specyfikacją pakietu `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__) dla Pythona >= 3.10
ta_in: Linux i686 (`manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ பேக்கேஜிங் விவரக்குறிப்புடன் இணக்கமான விநியோகங்கள்) for Python >= 3.10
te_in: Linux i686 (`manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ ప్యాకేజింగ్ స్పెసిఫికేషన్‌కు అనుకూలంగా ఉన్న పంపిణీలు) for Python >= 3.10
tr_tr: Python >= 3.10 için Linux i686 (`manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ paketleme özellikleri ile uyumlu dağıtımlar)
zh_cn: Linux i686 (Python的发行版本与 "manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ 打包规范 " 兼容的分发版 ) >= 3.10

source: macOS arm64 (10.15 or newer)
de_de: macOS arm64 (10.15 oder neuer)
es_un: macOS arm64 (10.15 o superior)
fr_fr: macOS arm64 (10.15 ou plus récent)
ja_jp: macOS arm64 (10.15 以降)
pl_pl: macOS arm64 (10.15 lub nowszy)
ta_in: macOS arm64 (10.15 அல்லது புதியது)
te_in: macOS arm64 (10.15 లేదా కొత్తది)
tr_tr: macOS arm64 (10.15 veya daha yenisi)
zh_cn: macOS arm64 (10.15 或更高版本)

source: Ready to get going?...
de_de: Bereit loszulegen?
es_un: ¿Listo para empezar?...
fr_fr: Prêt à y aller ?...
ja_jp: 準備はいいですか？...
pl_pl: Zaczynamy?
ta_in: செல்ல தயாரா?...
te_in: వెళ్ళడానికి సిద్ధంగా ఉన్నారా?...
tr_tr: Başlamaya hazır mısınız?...
vi_vn: Bạn đã sẵn sàng khởi hành?...
zh_cn: 准备好开始了吗？

source: Let's get started using Qiskit! The first thing to do is choose how you're going to run and install the packages. There are three main ways to do this:
de_de: Lassen Sie uns mit Qiskit beginnen! Als Erstes wählen Sie, wie Sie die Pakete ausführen und installieren. Hierzu gibt es drei verschiedene Möglichkeiten:
es_un: ¡Comencemos a usar Qiskit! Lo primero que debes hacer es elegir cómo vas a ejecutar e instalar los paquetes. Hay tres formas principales de hacer esto:
fr_fr: Commençons à utiliser Qiskit ! La première chose à faire est de choisir comment vous allez exécuter et installer les paquets. Il y a trois façons principales de le faire:
pl_pl: Zacznij korzystać z Qiskit! Najpierw wybierz sposób, w jaki będziesz uruchamiać i instalować pakiety. Są na to trzy sposoby:
te_in: Qiskit ఉపయోగించడం ప్రారంభించండి! మీరు ప్యాకేజీలను ఎలా అమలు చేయబోతున్నారు మరియు ఇన్‌స్టాల్ చేయబోతున్నారో ఎంచుకోవడం మొదటి విషయం. దీన్ని చేయడానికి మూడు ప్రధాన మార్గాలు ఉన్నాయి:
tr_tr: Hadi Qiskit'i kullanmaya başlayalım! Yapılacak ilk şey, paketleri nasıl çalıştıracağını ve nasıl kuracağını seçmek. Bunu yapmak için üç ana yol vardır:

source: Qiskit supports Python 3.7 or later. However, both Python and Qiskit are evolving ecosystems, and sometimes when new releases occur in one or the other, there can be problems with compatibility.
de_de: Qiskit unterstützt Python 3.7 oder neuere Versionen. Allerdings entwickeln sich sowohl Python als auch Qiskit weiter, so daß es Probleme mit der Kompatibilität geben kann, wenn es neue Versionen in dem einen oder anderen gibt.
es_un: Qiskit es compatible con Python 3.7 o posterior. Sin embargo, tanto Python como Qiskit son ecosistemas en evolución y, a veces, cuando se producen nuevas versiones en uno u otro, puede haber problemas de compatibilidad.
fr_fr: Qiskit supporte Python 3.7 ou une version supérieure. Cependant, Python et Qiskit sont des écosystèmes évolutifs, et parfois quand de nouvelles versions sont disponibles pour l'un ou l'autre, il peut y avoir des problèmes de compatibilité.
pl_pl: Qiskit obsługuje Pythona w wersji 3.7 lub nowszej. Jednak zarówno Python, jak i Qiskit to zmieniające się ekosystemy, a zdarza się, że w przypadku pojawienia się nowszych wersji, mogą pojawić się w nich problemy z kompatybilnością.
te_in: Qiskit python 3.7 లేదా తరువాతి వాటికి మద్దతు ఇస్తుంది. అయినప్పటికీ, python మరియు qiskit రెండూ పర్యావరణ వ్యవస్థలను అభివృద్ధి చేస్తున్నాయి మరియు కొన్నిసార్లు కొత్త విడుదలలు ఒకటి లేదా మరొకటి సంభవించినప్పుడు, అనుకూలతతో సమస్యలు ఉండవచ్చు.
tr_tr: Qiskit, Python 3.7 veya daha üst sürümleri desteklemektedir. Fakat, hem Python hem de Qiskit devamlı evrilen ekosistemler olduğu için herhangi birinin yeni sürümünün çıkması durumunda uyumluluk problemleri ortaya çıkabilir.

source: It is preferred that you use the Anaconda prompt installed with Anaconda. All you have to do is create a virtual environment inside Anaconda and activate the environment. These commands can be run in the Anaconda prompt irrespective of Windows or Linux machine.
es_un: Es preferible que utilices el prompt de Anaconda instalado con Anaconda. Todo lo que tienes que hacer es crear un entorno virtual dentro de Anaconda y activar el entorno. Estos comandos se pueden ejecutar en el prompt de Anaconda independientemente de la máquina con Windows o Linux.

source: Linux x86_64 (distributions compatible with the `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ packaging specification.
de_de: Linux x86_64 (Distributionen, kompatibel mit der `manylinux 2010 <https://www.python.org/dev/peps/pep-0571/>`__ Package-Spezifikation).
es_un: Linux x86_64 (distribuciones compatibles con la especificación de empaquetado `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__).
fr_fr: Linux x86_64 (distributions compatibles avec les spécifications d'empaquetage `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__).
pl_pl: Linux x86_64 (dystrybucje zgodne ze specyfikacją pakietu `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__).
tr_tr: Linux x86_64 (`manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ paketleme özellikleri ile uyumlu dağıtımlar)
zh_cn: Linux x86_64 (Python的发行版本与 "manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ 打包规范 " 兼容的分发版)

source: Linux i686 (distributions compatible with the `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ packaging specification) for Python < 3.10
de_de: Linux i686 (Distributionen kompatibel mit der ` manylinux 2010 <https://www.python.org/dev/peps/pep-0599/>` __ Paketspezifikation) für Python < 3.10
es_un: Linux i686 (distribuciones compatibles con la especificación de empaquetado `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__) para Python < 3.10
fr_fr: Linux i686 (distributions compatibles avec les spécifications d'empaquetage `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__) pour Python < 3.10
pl_pl: Linux i686 (dystrybucje zgodne z `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ specyfikacja opakowań) dla Pythona < 3.10
te_in: Linux i686 (`manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ ప్యాకేజింగ్ స్పెసిఫికేషన్‌కు అనుకూలంగా ఉన్న పంపిణీలు) for Python < 3.10
tr_tr: Python < 3.10 için Linux i686 (`manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ paketleme özellikleri ile uyumlu dağıtımlar)
zh_cn: Linux i686 (Python的发行版本与 "manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ 打包规范 " 兼容的分发版 ) < 3.10

source: Windows 32 bit for Python < 3.10
de_de: Windows 32-Bit für Python < 3.10
es_un: Windows 32 bit para Python < 3.10
fr_fr: Windows 32 bits pour Python < 3.10
ja_jp: Python < 3.10 向けの Windows 32ビット
pl_pl: 32-bitowy system Windows dla Pythona < 3.10
tr_tr: Python < 3.10 için Windows 32 bit
zh_cn: Windows 32 位的 Python < 3.10

source: Linux ppc64le (distributions compatible with the `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ packaging specification)
de_de: Linux aarch64 (Distributionen kompatibel mit der `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ Paketspezifikation)
es_un: Linux ppc64le (distribuciones compatibles con la especificación de empaquetado `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__)
fr_fr: Linux ppc64le (distributions compatibles avec la spécification `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__)
pl_pl: Linux ppc64le (dystrybucje zgodne ze specyfikacją pakietu `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__)
te_in: Linux ppc64le(`manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ ప్యాకేజింగ్ స్పెసిఫికేషన్‌కు అనుకూలంగా ఉన్న పంపిణీలు)
tr_tr: Linux ppc64le (`manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ paketleme özellikleri ile uyumlu dağıtımlar)

source: Linux s390x (distributions compatible with the `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ packaging specification)
de_de: Linux aarch64 (Distributionen kompatibel mit der `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ Paketspezifikation)
es_un: Linux s390x (distribuciones compatibles con la especificación de empaquetado `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__)
fr_fr: Linux s390x (distributions compatibles avec la spécification `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__)
pl_pl: Linux s390x (dystrybucje zgodne ze specyfikacją pakietu `manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__)
te_in: Linux s390x(`manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ ప్యాకేజింగ్ స్పెసిఫికేషన్‌కు అనుకూలంగా ఉన్న పంపిణీలు)
tr_tr: Linux s390x (`manylinux 2014 <https://www.python.org/dev/peps/pep-0599/>`__ paketleme özellikleri ile uyumlu dağıtımlar)

source: Windows 32 bit for Python >= 3.10
de_de: Windows 32bit für Python > = 3.10
es_un: Windows 32 bit para Python >= 3.10
fr_fr: Windows 32 bits pour Python > = 3.10
pl_pl: 32-bitowy system Windows dla Pythona >= 3.10
tr_tr: Python >= 3.10 için Windows 32 bit
zh_cn: Windows 32 位的 Python >= 3.10

source: Windows 64 bit
fr_fr: Windows 64 bits
ja_jp: Windows 64ビット
pl_pl: 64-bitowy system Windows
zh_cn: Windows 64 位

source: Windows 32bit for Python >= 3.10
ja_jp: Python >= 3.10 向けの Windows 32ビット

source: You will need to `download Python <https://wiki.python.org/moin/BeginnersGuide/Download>`__ on your local system to get started. `Jupyter <https://jupyter.org/install>`__ is recommended for interacting with Qiskit.
de_de: Sie müssen ` Python <https://wiki.python.org/moin/BeginnersGuide/Download>` __ auf Ihr lokales System herunterladen, um beginnen zu können. ` Jupyter <https://jupyter.org/install>` __ wird für die Interaktion mit Qiskit empfohlen.
fr_fr: Vous aurez besoin de ` télécharger Python <https://wiki.python.org/moin/BeginnersGuide/Download>` __ sur votre système local pour commencer. ` Jupyter <https://jupyter.org/install>` __ est recommandé pour interagir avec Qiskit.
pl_pl: Aby rozpocząć, musisz `pobrać Python <https://wiki.python.org/moin/BeginnersGuide/Download>`__ na swoim lokalnym systemie. `Jupyter <https://jupyter.org/install>`__ jest zalecany do interakcji z Qiskit.
te_in: మీరు ప్రారంభించడానికి మీ స్థానిక సిస్టమ్‌లో python <https://wiki.python.org/moin/BeginnersGuide/Download>`__ని డౌన్‌లోడ్ చేయాలి. `Jupyter <https://jupyter.org/install>`__ Qiskitతో పరస్పర చర్య చేయడానికి సిఫార్సు చేయబడింది.
tr_tr: Başlamak için yerel sisteminize `Python <https://wiki.python.org/moin/BeginnersGuide/Download>'__ indirmeniz gerekecek. Qiskit ile etkileşim için `Jupyter <https://jupyter.org/install>`__ önerilir.

source: We recommend using `Python virtual environments <https://docs.python.org/3.10/tutorial/venv.html>`__ to cleanly separate Qiskit from other applications and improve your experience.
de_de: Um Qiskit sauber von anderen Anwendungen zu trennen und die Nutzung zu vereinfachen, wird die Verwendung einer `virtuellen Python Umgebung <https://docs.python.org/3.10/tutorial/venv.html>`__ empfohlen.
fr_fr: Nous recommandons d'utiliser des environnements virtuels `Python <https://docs.python.org/3.10/tutorial/venv.html>` __ pour séparer correctement Qiskit d'autres applications et améliorer votre expérience.
pl_pl: Zalecamy używanie `wirtualnych środowisk Pythona <https://docs.python.org/3.10/tutorial/venv.html>`__ do jasnego oddzielenia Qiskit od innych aplikacji i poprawy komfortu korzystania.
te_in: Qiskitని ఇతర అప్లికేషన్‌ల నుండి క్లీన్‌గా వేరు చేయడానికి మరియు మీ అనుభవాన్ని మెరుగుపరచడానికి `Python virtual ఎన్విరాన్‌మెంట్లు <https://docs.python.org/3.10/tutorial/venv.html>`__ని ఉపయోగించమని మేము సిఫార్సు చేస్తున్నాము.
tr_tr: Qiskit'i diğer uygulamalardan net bir şekilde ayırabilmek ve deneyiminizi geliştirmek için `Python sanal ortamlarını <https://docs.python.org/3.10/tutorial/venv.html>`__ kullanmanızı tavsiye ederiz.

source: Note: if you are using Windows, use the following commands in PowerShell.
de_de: Hinweis: Wenn Sie Windows verwenden, verwenden Sie die folgenden Befehle in PowerShell.
fr_fr: Remarque : si vous utilisez Windows, utilisez les commandes suivantes dans PowerShell.
pl_pl: Uwaga: Jeśli używasz systemu Windows, użyj następujących komend w PowerShell.
te_in: గమనిక: మీరు Windows ఉపయోగిస్తుంటే, PowerShellలో కింది ఆదేశాలను ఉపయోగించండి.
tr_tr: Not: Windows işletim sistemi kullanıyorsanız, PowerShell'de aşağıdaki komutları kullanın.

source: If the packages were installed correctly, you can run ``pip list`` to see the active packages in your virtual environment.
de_de: Wenn die Pakete korrekt installiert wurden, können Sie ``pip list`` ausführen, um die aktiven Pakete in Ihrer virtuellen Umgebung zu sehen.
fr_fr: Si les paquets se sont installés correctement, vous pouvez lancer la commande ``pip list`` pour voir les paquets actifs de votre environnement virtuel.
pl_pl: Jeśli pakiety zainstalowano poprawnie, wykonaj komendę ``conda list`` aby zobaczyć aktywne pakiety w twoim wirtualnym środowisku.
te_in: ప్యాకేజీలు సరిగ్గా ఇన్‌స్టాల్ చేయబడితే, మీ వర్చువల్ ఎన్విరాన్‌మెంట్‌లో సక్రియ ప్యాకేజీలను చూడటానికి మీరు ``pip list``ని అమలు చేయవచ్చు.
tr_tr: Paketler doğru kurulmuşsa sanal ortamınızdaki aktif paketleri görmek için ``pip list``'i çalıştırabilirsiniz.

source: Installing from source requires that you have the Rust compiler on your system. To install the Rust compiler the recommended path is to use rustup, which is a cross-platform Rust installer. To use rustup you can go to:
de_de: Die Installation aus dem Quellcode erfordert, dass der Rust Compiler auf dem System installiert ist. Um den Rust Compiler zu installieren, empfehlen wir rustup zu nutzen, welches ein plattformübergreifender Rust Installer ist. Für die Verwendung von rustup kann der folgende Link verwendet werden:
fr_fr: L'installation à partir de la source nécessite que vous disposiez du compilateur Rust sur votre système. Pour installer le compilateur Rust, il est recommandé d'utiliser rustup, qui est un programme d'installation de Rust. Pour ce faire, vous pouvez aller à :
pl_pl: Instalacja ze źródła wymaga zainstalowania w systemie kompilatora Rust. Aby zainstalować kompilator Rust, zalecaną ścieżką jest użycie rustup, który jest wieloplatformowym instalatorem Rust. Aby korzystać z rustup przejdź do:
te_in: సోర్స్ నుండి ఇన్‌స్టాల్ చేయడానికి మీరు మీ సిస్టమ్‌లో Rust కంపైలర్‌ని కలిగి ఉండాలి. Rust కంపైలర్‌ను ఇన్‌స్టాల్ చేయడానికి సిఫార్సు చేయబడిన మార్గం rustupని ఉపయోగించడం, ఇది క్రాస్-ప్లాట్‌ఫారమ్ Rust ఇన్‌స్టాలర్. rustupని ఉపయోగించడానికి మీరు దీనికి వెళ్లవచ్చు:
tr_tr: Kaynaktan kurulum yapılması, sisteminizde Rust derleyicisine sahip olmanızı gerektirir. Rust derleyicisini kurmak için önerilen yol, çapraz platform Rust kuruluş programı olan rustup kullanılmasıdır. Rustup kullanmak için şu adresi kullanabilirsiniz:

source: which will provide instructions for how to install rust on your platform. Besides rustup there are `other installation methods <https://forge.rust-lang.org/infra/other-installation-methods.html>`__ available too.
de_de: , welcher die Anweisungen zur Installation von Rust auf Ihrer Plattform zur Verfügung stellt. Neben rustup sind auch `andere Installationsmethoden <https://forge.rust-lang.org/infra/other-installation-methods.html>`__ verfügbar.
fr_fr: qui fournira des instructions pour installer rust sur votre plate-forme. En plus de rustup, il y a `d'autres méthodes d'installation <https://forge.rust-lang.org/infra/other-installation-methods.html>`__ également disponibles.
pl_pl: gdzie znajdziesz instrukcje dotyczące sposobu instalacji rust na Twojej platformie. Oprócz rustup są też dostępne `inne metody instalacji <https://forge.rust-lang.org/infra/other-installation-methods.html>` __.
te_in: ఇది మీ ప్లాట్‌ఫారమ్‌లో Rustను ఎలా ఇన్‌స్టాల్ చేయాలో సూచనలను అందిస్తుంది. rustupతో పాటు `ఇతర ఇన్‌స్టాలేషన్ పద్ధతులు <https://forge.rust-lang.org/infra/other-installation-methods.html>`__ కూడా అందుబాటులో ఉన్నాయి.
tr_tr: bu da platformunuza rust nasıl kurulacağı ile ilgili talimatları sağlayacak. Ayrıca, Rustup'ın yanında `diğer kurulum yöntemleri <https://forge.rust-lang.org/infra/other-installation-methods.html>` __ de mevcuttur.

source: Once the Rust compiler is installed, you are ready to install Qiskit Terra.
de_de: Sobald der Rust-Compiler installiert ist, kann man mit der Installation von Qiskit Terra fortfahren.
fr_fr: Une fois le compilateur Rust installé, vous pouvez installer Qiskit Terra.
pl_pl: Po zainstalowaniu kompilatora Rust możesz zainstalować Qiskit Terra.
te_in: Rust కంపైలర్ ఇన్‌స్టాల్ చేయబడిన తర్వాత, మీరు Qiskit Terraని ఇన్‌స్టాల్ చేయడానికి సిద్ధంగా ఉన్నారు.
tr_tr: Rust derleyicisi kurulduktan sonra Qiskit Terra'yı kurmaya hazırsınız.

source: Installing in editable mode will build the compiled extensions in debug mode without optimizations. This will affect the runtime performance of the compiled code. If you'd like to use editable mode and build the compiled code in release with optimizations enabled you can run:
de_de: Bei der Installation im editierbaren Modus werden die kompilierten Erweiterungen im Debugmodus ohne Optimierungen erstellt. Dies wirkt sich auf die Laufzeitleistung des kompilierten Codes aus. Wenn Sie den editierbaren Modus verwenden und den kompilierten Code in der Version mit aktivierten Optimierungen erstellen möchten, können Sie Folgendes ausführen:
fr_fr: L'installation en mode modifiable construira les extensions compilées en mode débogage et sans optimisation. Cela affectera les performances d'exécution du code compilé. Si vous souhaitez utiliser le mode modifiable et construire le code compilé avec des optimisations activées, vous pouvez exécuter :
pl_pl: Instalacja w trybie edytowalnym zbuduje skompilowane rozszerzenia w trybie debugowania bez optymalizacji. Będzie to miało wpływ na wydajność środowiska wykonawczego skompilowanego kodu. Jeśli chcesz użyć trybu edytowalnego i zbudować skompilowany kod w wersji z włączoną optymalizacją, możesz uruchomić:
te_in: ఎడిటెబుల్ మోడ్‌లో ఇన్‌స్టాల్ చేయడం వల్ల కంపైల్ చేసిన ఎక్స్‌టెన్షన్‌లు ఆప్టిమైజేషన్‌లు లేకుండా డీబగ్ మోడ్‌లో నిర్మించబడతాయి. ఇది కంపైల్డ్ కోడ్ యొక్క రన్‌టైమ్ పనితీరును ప్రభావితం చేస్తుంది. మీరు ఎడిటెబుల్ మోడ్‌ను ఉపయోగించాలనుకుంటే మరియు ఆప్టిమైజేషన్‌లను ప్రారంభించి విడుదలలో కంపైల్ చేసిన కోడ్‌ను రూపొందించాలనుకుంటే మీరు ఇవి అమలు చేయవచ్చు:
tr_tr: Düzenlenebilir modda kurulum, derlenen uzantıları optimizasyon olmaksızın hata ayıklama modunda oluşturur. Bu, derlenmiş kodun çalışma zamanı performansını etkiler. Düzenlenebilir modu kullanmak ve sürümdeki derlenmiş kodu optimizasyonlar etkinken oluşturmak istiyorsanız şunları çalıştırabilirsiniz:

source: after you run pip and that will rebuild the binary in release mode. If you are working on Rust code in Qiskit you will need to rebuild the extension code every time you make a local change. ``pip install -e .`` will only build the Rust extension when it's called, so any local changes you make to the Rust code after running pip will not be reflected in the installed package unless you rebuild the extension. You can leverage the above ``build_rust`` command to do this (with or without ``--release`` based on whether you want to build in debug mode or release mode).
de_de: nach dem Ausführen von pip wird die Binärdatei im Release-Modus erneut erstellt. Wenn Sie an Rust Code in Qiskit arbeiten, müssen Sie den Erweiterungscode jedes Mal neu erstellen, wenn Sie eine lokale Änderung vornehmen. ``pip install -e .`` wird die Rust-Erweiterung nur dann erstellen, wenn sie aufgerufen wird. Daher werden alle lokalen Änderungen, die Sie nach dem Ausführen von pip an den Rust-Code vornehmen, nicht im installierten Paket wiedergegeben, sofern Sie die Erweiterung nicht erneut erstellen. Sie können den obigen ``build_rust`` -Befehl nutzen, um dies zu tun (mit oder ohne ``--release`` basierend darauf, ob Sie im Debug-Modus oder im Release-Modus bauen wollen).
fr_fr: après avoir exécuté pip et qui reconstruira le binaire en mode release. Si vous travaillez sur le code Rust dans Qiskit, vous devrez recompiler le code d'extension chaque fois que vous faites un changement local. ``pip install -e . ` ne construira l'extension Rust que lorsqu'il sera appelé, donc toutes les modifications locales que vous apportez au code Rust après l'exécution de pip ne seront pas reflétées dans le paquet installé, à moins que vous ne reconstruisiez l'extension. Vous pouvez utiliser la commande ``build_rust`` ci-dessus pour faire cela (avec ou sans ``--release`` selon que vous voulez construire en mode débogage ou en mode release).
pl_pl: po uruchomieniu pip, co odbuduje plik binarny w trybie wydania. Jeśli pracujesz nad kodem Rust w Qiskit, musisz odbudować kod rozszerzenia za każdym razem, gdy dokonasz zmiany lokalnej. ``pip install -e.`` utworzy rozszerzenie Rust jedynie po wywołaniu, więc lokalne zmiany kodzie Rust po uruchomieniu pip nie będą miały odzwierciedlenia w zainstalowanym pakiecie, chyba że odbudujesz rozszerzenie. Aby to zrobić, możesz wykorzystać powyższe polecenie ``build_rust`` (z lub bez ``-- release`` w zależności od tego, czy chcesz budować w trybie debugowania czy w trybie wydania).
te_in: మీరు pipని అమలు చేసిన తర్వాత మరియు అది బైనరీని విడుదల మోడ్‌లో పునర్నిర్మిస్తుంది. మీరు Qiskitలో Rust కోడ్‌పై పని చేస్తున్నట్లయితే, మీరు స్థానికంగా మార్పు చేసిన ప్రతిసారీ ఎక్స్టెన్షన్ కోడ్‌ను పునర్నిర్మించవలసి ఉంటుంది. ``pip install -e .`` Rust ఎక్స్‌టెన్షన్‌ని పిలిచినప్పుడు మాత్రమే నిర్మిస్తుంది, కాబట్టి మీరు పిప్‌ని అమలు చేసిన తర్వాత రస్ట్ కోడ్‌కి చేసే ఏవైనా స్థానిక మార్పులు మీరు పొడిగింపును పునర్నిర్మించకపోతే ఇన్‌స్టాల్ చేసిన ప్యాకేజీలో ప్రతిబింబించవు. మీరు దీన్ని చేయడానికి ఎగువ ``build_rust`` ఆదేశాన్ని ప్రభావితం చేయవచ్చు (మీరు డీబగ్ మోడ్‌లో లేదా విడుదల మోడ్‌లో నిర్మించాలనుకుంటున్నారా అనే దాని ఆధారంగా ``--release``తో లేదా లేకుండా).
tr_tr: pip'i çalıştırdıktan sonra bu, ikiliyi yayın modunda yeniden derleyecektir. Qiskit'te Rust kodu üzerinde çalışıyorsanız, her yerel değişiklik yaptığınızda uzantı kodunu yeniden derlemeniz gerekir. ``pip install -e .`` Rust uzantısını yalnızca çağrıldığında oluşturur, bu nedenle pip'i çalıştırdıktan sonra Rust kodunda yaptığınız herhangi bir yerel değişiklik, uzantıyı yeniden derlemediğiniz sürece kurulu pakete yansıtılmaz. Bunu yapmak için yukarıdaki ``build_rust`` komutundan yararlanabilirsiniz (debug modunda mı yoksa yayın modunda mı derlemek istediğinize bağlı olarak ``--release`` ile veya olmadan).
