Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/getting_started.po
Languages: de_de, es_mx, es_un, fr_fr, id_id, it_it, ja_jp, pl_pl, ta_in, te_in, tr_tr, vi_vn, zh_cn

source: where the elements within square brackets `[]` are optional, and ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` are to be replaced by flags of your choice. A list of *CMake* options is available here: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. For example, you could run something like:
de_de: wobei die Elemente in eckigen Klammern `[]` optional sind und ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` durch ausgewählte Flags ersetzt werden. Eine Liste der *CMake* Optionen ist hier verfügbar: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#Optionen. Beispielsweise kann man folgenden Befehl verwenden:
es_un: donde los elementos entre corchetes `[]` son opcionales, y ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` deben ser reemplazados por banderas de tu elección. Una lista de opciones de *CMake* está disponible aquí: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. Por ejemplo, podrías ejecutar algo como:
fr_fr: où les éléments entre crochets `[]` sont optionnels et ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` doivent être remplacés par des options de votre choix. Une liste des options *CMake* est disponible ici: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. Par exemple, vous pouvez exécuter quelque chose comme :
ja_jp: ここで、角括弧 [] 内の要素はオプションであり、 ``skbuild_opts`` 、 ``cmake_opts`` 、 ``build_tool_opts`` は任意のフラグに置き換えられます。 *CMake* のオプションのリストは https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options にあります。例えば、次のように実行することができます。
pl_pl: gdzie elementy w nawiasach kwadratowych `[]` są opcjonalne, oraz ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` mają być zastąpione wybranymi flagami. Lista opcji *CMake* jest dostępna tutaj: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. Na przykład możesz uruchomić coś takiego:
ta_in: சதுர அடைப்புக்குறிக்குள் உள்ள கூறுகள் `[]` விருப்பத்தேர்வு, மற்றும் ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` உங்களுக்கு விருப்பமான கொடிகளால் மாற்றப்பட வேண்டும். *CMake* விருப்பங்களின் பட்டியல் இங்கே கிடைக்கிறது:https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. எடுத்துக்காட்டாக, நீங்கள் இதைப் போன்றவற்றை இயக்கலாம்:
te_in: ఇక్కడ చతురస్రాకార బ్రాకెట్లలోని మూలకాలు `[]` ఐచ్ఛికం మరియు ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` మీ ఎంపిక ఫ్లాగ్‌లతో భర్తీ చేయబడతాయి. *CMake* ఎంపికల జాబితా ఇక్కడ అందుబాటులో ఉంది: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. ఉదాహరణకు, మీరు ఇలాంటి వాటిని రన్ చేయవచ్చు:
tr_tr: köşeli parantez `[]` içindeki öğeler isteğe bağlıdır ve ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts``, seçtiğiniz bayraklarla değiştirilir. *CMake * seçeneklerinin bir listesini burada bulabilirsiniz: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. Örneğin, şöyle bir şey çalıştırabilirsiniz:
vi_vn: nơi các thành phần ở trong ngoặc `[]` là tùy chọn, ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` có thể được thay đổi bởi lựa chọn flags của bạn. Một danh sách các tùy chọn *CMake* có thể tham khảo ở đây: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. Ví dụ, bạn có thể chạy gì đó như:

source: This is passing the flag `-j8` to the underlying build system (which in this case is `Automake <https://www.gnu.org/software/automake/>`__), telling it that you want to build in parallel using 8 processes.
de_de: Dadurch wird das Flag `-j8` an das zugrunde liegende Build-System durchgereicht (in diesem Fall `Automake <https://www.gnu.org/software/automake/>`__), wodurch diesem mitgeteilt wird, dass man mit 8 parallelen Prozessen kompilieren möchte.
es_un: Esto es pasar la bandera `-j8` al sistema de compilación subyacente (que en este caso es `Automake <https://www.gnu.org/software/automake/>`__), indicándole que deseas compilar en paralelo usando 8 procesos.
fr_fr: Ceci passe le commutateur `-j8 ` au système de construction sous-jacent (qui dans ce cas est `Automake <https://www.gnu.org/software/automake/>` __), en indiquant que vous voulez construire en parallèle à l'aide de 8 processus.
ja_jp: これは、基礎となるビルドシステム（ここでは `Automake <https://www.gnu.org/software/automake/>`__ ）に `-j8` というフラグを渡し、8つのプロセスを使って並行してビルドしたいことを伝えるものです。
ta_in: இது `-j8` கொடியை அடிப்படை கட்டமைப்பிற்கு அனுப்புகிறது (இந்த விஷயத்தில் `Automake <https://www.gnu.org/software/automake/>`__), நீங்கள் உருவாக்க விரும்புகிறீர்கள் என்று கூறுகிறது 8 செயல்முறைகளைப் பயன்படுத்தி இணையாக.
te_in: ఇది ఫ్లాగ్ `-j8`ని అంతర్లీన బిల్డ్ సిస్టమ్‌కి పంపుతోంది (ఈ సందర్భంలో `Automake<https://www.gnu.org/software/automake/>`__), మీరు దీన్ని 8 ప్రక్రియలను ఉపయోగించి సమాంతరంగా నిర్మించాలనుకుంటున్నారని తెలియజేస్తుంది.
tr_tr: Bu, `-j8` bayrağını alttaki derleme sistemine geçirir (bu durumda `Automake <https://www.gnu.org/software/automake/>`__), 8 işlem kullanarak paralel şekilde oluşturmak istediğinizi söyler.
vi_vn: Việc truyền flag `-j8` vào việc dựng hệ thống (trong trường hợp này là `Automake <https://www.gnu.org/software/automake/>`__), được dùng để nói rằng bạn muốn dựng song song sử dụng 8 quy trình (process).

source: For example, a common use case for these flags on linux is to specify a specific version of the C++ compiler to use (normally if the default is too old):
de_de: Ein typischer Anwendungsfall für solche Flags in Linux ist beispielsweise die Angabe einer bestimmten Version von C++-Compiler, welcher genutzt werden soll (normalerweise wenn der Standard-Version zu alt ist):
es_un: Por ejemplo, un caso de uso común para estas banderas (flags) en Linux es especificar una versión particular del compilador de C++ a ser usado (normalmente si el valor predeterminado es demasiado viejo):
fr_fr: Par exemple, un cas d'utilisation commun pour ces indicateurs sur linux est de spécifier une version spécifique du compilateur C++ à utiliser (normalement si la valeur par défaut est trop ancienne) :
ja_jp: 例えば、LINUXにおけるこれらのフラグの一般的な使用例は、使用するC++コンパイラーの特定のバージョンを指定することです（通常、デフォルトでは古すぎる場合）。
pl_pl: Na przykład częstym przypadkiem użycia flag w systemie Linux jest określenie konkretnej wersji kompilatora C++ do użycia (zwykle, jeśli wartość domyślna jest przestarzała):
ta_in: எடுத்துக்காட்டாக, லினக்ஸில் இந்த கொடிகளுக்கான பொதுவான பயன்பாட்டு வழக்கு, பயன்படுத்த C++ தொகுவின் ஒரு குறிப்பிட்ட பதிப்பைக் குறிப்பிடுவது (பொதுவாக இயல்புநிலை மிகவும் பழையதாக இருந்தால்):
te_in: ఉదాహరణకు, linuxలో ఈ ఫ్లాగ్‌ల కోసం ఒక సాధారణ ఉపయోగ సందర్భం ఏమిటంటే, C++ కంపైలర్ యొక్క నిర్దిష్ట వెర్షన్‌ని పేర్కొనడం (సాధారణంగా డిఫాల్ట్ చాలా పాతది అయితే):
tr_tr: Örneğin, linux üzerindeki bu bayraklar için yaygın bir kullanım durumu, kullanılacak C++ derleyicisinin belirli bir sürümünü belirtmektir (normalde varsayılan çok eski ise):
vi_vn: Ví dụ, một trường hợp sử dụng flag thường gặp trên Linux là để xác định xem phiên bản nào của trình biên dịch C++ để dùng (thông thường trong trường hợp trình biên dịch mặc định quá cũ):

source: which will tell CMake to use the g++-7 command instead of the default g++ when compiling Aer.
de_de: der CMake vorgibt, den Befehl g++-7 anstelle des standardmäßigen g++, beim Kompilieren von Aer zu verwenden.
es_un: el cuál comunicará a CMake que use el comando g++-7 en vez del predeterminado g++ al compilar Aer.
fr_fr: qui indiquera à CMake d'utiliser la commande g++-7 au lieu de la commande g++ par défaut lors de la compilation d'Aer.
ja_jp: これはCMakeに、Aerのコンパイル時にデフォルトのg++ではなくg++-7コマンドを使用するように指示するものです。
pl_pl: co sprawi, że CMake użyje polecenia g++-7 zamiast domyślnego g++ podczas kompilacji Aer.
ta_in: இது Aer ஐ தொகுக்கும்போது இயல்புநிலை g ++ க்கு பதிலாக g ++ - 7 கட்டளையைப் பயன்படுத்த CMake க்குச் சொல்லும்.
te_in: ఇది Aerని కంపైల్ చేసేటప్పుడు డిఫాల్ట్ g++కి బదులుగా g++-7 కమాండ్‌ని ఉపయోగించమని CMakeకి చెబుతుంది.
tr_tr: bu CMake'e Aer derlenirken varsayılan g++ yerine g++-7 komutunu kullanmasını söyleyecektir.
vi_vn: cái mà nói với CMake dùng trình biên dịch g++-7 thay vì sử dụng trình g++ mặc định khi biên dịch Aer.

source: Another common use case for this, depending on your environment, is that you may need to specify your platform name and turn off static linking.
de_de: Ein weiterer typischer Anwendungsfall, abhängig von der Entwicklungsumgebung, is es die Plattform anzugeben und das statische Verlinken zu deaktivieren.
es_un: Otro caso de uso común para esto, dependiendo de tu entorno, es que es posible que debas especificar el nombre de tu plataforma y desactivar el enlazamiento estático.
fr_fr: Un autre cas d'utilisation courant pour ceci, en fonction de votre environnement, est que vous devrez peut-être spécifier le nom de votre plate-forme et désactiver la liaison statique.
ja_jp: また、環境にもよりますが、プラットフォーム名を指定して静的リンクをオフにするというのもよくある使用例です。
pl_pl: Kolejnym częstym przykładem, w zależności od środowiska, jest konieczność określenia nazwy platformy i wyłączenia linków statystycznych.
ta_in: இதற்கான மற்றொரு பொதுவான பயன்பாட்டு வழக்கு, உங்கள் சூழலைப் பொறுத்து, உங்கள் தளத்தின் பெயரைக் குறிப்பிட வேண்டும் மற்றும் நிலையான இணைப்பை அணைக்க வேண்டும்.
te_in: దీని కోసం మరొక సాధారణ ఉపయోగ సందర్భం, మీ పర్యావరణంపై ఆధారపడి, మీరు మీ ప్లాట్‌ఫారమ్ పేరును పేర్కొనవలసి ఉంటుంది మరియు స్టాటిక్ లింకింగ్‌ను ఆఫ్ చేయాలి.
tr_tr: Bunun için bir diğer yaygın kullanım durumu da, ortamınıza bağlı olarak platform adınızı belirtmeniz ve statik bağlantıyı kapatmanız gerekebileceğidir.
vi_vn: Một trường hợp sử dụng phổ biến khác cho điều này, tùy thuộc vào môi trường của bạn, là bạn có thể cần xác định tên nền tảng của bạn và tắt liên kết tĩnh.

source: Here ``--plat-name`` is a flag to setuptools, to specify the platform name to use in the package metadata, ``-DSTATIC_LINKING`` is a flag for using CMake to disable static linking, and ``-j8`` is a flag for using Automake to use 8 processes for compilation.
de_de: Hierbei ist ``--plat-name`` ein Flag für setuptools, um den in den Paket-Metadaten zu verwendenden Plattform-Namen anzugeben. ``-DSTATIC_LINKING`` ist ein Flag für CMake, um das statische Verlinken zu deaktivieren und ``-j8`` ist ein Flag für Automake, um 8 Prozesse bei der Kompilierung zu verwenden.
es_un: Aquí ``--plat-name`` es una bandera para las setuptools para especificar el nombre de la plataforma a utilizar en los metadatos del paquete, ``-DSTATIC_LINKING`` es una bandera para hacer que CMake deshabilite el enlazamiento estático, y ``-j8`` es una bandera para hacer que Automake utilice 8 procesos para la compilación.
fr_fr: Ici, ``--plat-name`` est un commutateur pour setuptools, pour spécifier le nom de la plate-forme à utiliser dans les métadonnées du paquet, ``-DSTATIC_LINKING`` est un commutateur pour utiliser CMake pour désactiver les liens statiques, et ``-j8`` est un commutateur pour Automake afin d'utiliser 8 processus pour la compilation.
ja_jp: ここで ``--plat-name`` は setuptools のフラグで、パッケージのメタデータで使用するプラットフォーム名を指定します。 ``-DSTATIC_LINKING`` は CMake を使用してスタティックリンクを無効にするためのフラグで、 ``-j8`` は Automake を使用してコンパイルに 8 プロセスを使用するためのフラグです。
pl_pl: Tutaj ``--plat-name`` jest flagą do konfiguracji narzędzi setuptools, aby określić nazwę platformy do użycia w metadanych pakietu, ``-DSTATIC_LINKING`` jest flagą do użycia CMake, aby wyłączyć link statyczny, a ``-j8`` jest flagą do użycia Automake, aby dokonać kompilacji przy użyciu 8 procesów.
ta_in: இங்கே ``--plat-name`` என்பது அமைப்புக் கருவிகளுக்கு ஒரு கொடி, தொகுப்பு மெட்டாடேட்டாவில் பயன்படுத்த வேண்டிய தளத்தின் பெயரைக் குறிப்பிட, ``-DSTATIC_LINKING`` என்பது நிலையான இணைப்பை முடக்க CMake ஐப் பயன்படுத்துவதற்கான ஒரு கொடி, மற்றும் ``-j8`` தொகுப்பிற்கு 8 செயல்முறைகளைப் பயன்படுத்த ஆட்டோமேக்கைப் பயன்படுத்துவதற்கான ஒரு கொடி.
te_in: ఇక్కడ ``--plat-name`` అనేది సెటప్‌టూల్స్‌కు ఫ్లాగ్, ప్యాకేజీ మెటాడేటాలో ఉపయోగించాల్సిన ప్లాట్‌ఫారమ్ పేరును పేర్కొనడానికి, ``-DSTATIC_LINKING` అనేది స్టాటిక్ లింకింగ్‌ని నిలిపివేయడానికి CMakeని ఉపయోగించడానికి మరియు ``-j8 `` అనేది కంపైలేషన్ కోసం 8 ప్రక్రియలను ఉపయోగించడానికి Automake కోసం ఉపయోగపడే ఫ్లాగ్.
tr_tr: Burada ``--plat-name``, setuptools için paket meta verilerinde kullanılacak platform adını belirtirken kullanılan bir bayraktır, ``-DSTATIC_LINKING``, CMake'i statik bağlantıyı devre dışı bırakmada kullanmak için bir bayrak ve ``-j8`` Automake'in derlemede 8 işlem kullanması için kullanılan bir bayraktır.

source: A list of common options depending on platform are:
de_de: Eine Liste der gängigen Optionen je nach Plattform sind:
es_un: Una lista de opciones comunes dependiendo de la plataforma es:
fr_fr: Voici une liste des options courantes en fonction de la plateforme :
ja_jp: プラットフォームに応じた一般的なオプションのリストは以下の通りです。
pl_pl: Lista wspólnych opcji w zależności od platformy:
ta_in: தளத்தைப் பொறுத்து பொதுவான விருப்பங்களின் பட்டியல்:
te_in: ప్లాట్‌ఫారమ్ ఆధారంగా సాధారణ ఎంపికల జాబితా:
tr_tr: Platforma bağlı olarak, sık kullanılan seçeneklerin listesi şöyledir:
vi_vn: Danh sách các tùy chọn phổ biến phụ thuộc vào nền tảng:

source: Platform
de_de: Plattform
es_un: Plataforma
fr_fr: Plateforme
ja_jp: プラットフォーム
pl_pl: Platforma
ta_in: நடைமேடை
te_in: ప్లాట్ఫాం
vi_vn: Nền tảng

source: Tool
es_un: Herramienta
fr_fr: Outil
ja_jp: ツール
pl_pl: Narzędzie
ta_in: கருவி
te_in: పరికరం
tr_tr: Araç
vi_vn: Công cụ

source: Option
es_un: Opción
ja_jp: オプション
pl_pl: Opcja
ta_in: விருப்பம்
te_in: ఆప్షన్
tr_tr: Seçenek
vi_vn: Tùy chọn

source: Use Case
es_un: Caso de Uso
fr_fr: Cas d’utilisation
ja_jp: ユースケース
pl_pl: Przykład zastosowania
ta_in: யூஸ் கேஸ்
te_in: యూస్ కేస్
tr_tr: Kullanım Örneği
vi_vn: Ứng dụng

source: All
de_de: Alle
es_un: Todas
fr_fr: Tout
ja_jp: 全て
pl_pl: Wszystkie
ta_in: அனைத்தும்
te_in: అన్ని
tr_tr: Tümü
vi_vn: Tất cả

source: Automake
ta_in: ஆட்டோமேக்
te_in: ఆటోమేక్

source: Followed by a number, sets the number of processes to use for compilation.
de_de: Gefolgt von einer Zahl, setzt diese Option die Anzahl der Prozesse fest, die zur Kompilierung verwendet werden sollen.
es_un: Seguido de un número, establece el número de procesos que se utilizarán para la compilación.
fr_fr: Suivi d'un nombre qui définit le nombre de processus à utiliser pour la compilation.
ja_jp: 後ろに数字が続くこのオプションは、コンパイラが使用するプロセッサの数を指定します。
pl_pl: Wpisane przed liczbą, kontroluje liczbę procesów wykorzystywanych do kompilacji.
ta_in: ஒரு எண்ணைத் தொடர்ந்து, தொகுப்பிற்குப் பயன்படுத்த வேண்டிய செயல்முறைகளின் எண்ணிக்கையை அமைக்கிறது.
te_in: ఒక సంఖ్యను అనుసరించి, కంపైలేషాన్ కోసం ఉపయోగించే ప్రక్రియల సంఖ్యను సెట్ చేస్తుంది.
tr_tr: Ardından gelecek bir sayı, derleme için kullanılacak işlem sayısını belirler.
vi_vn: Theo sau bởi một con số, thiết lập số quá trình sử dụng cho việc biên dịch.

source: Linux
ta_in: லினக்ஸ்

source: Used to specify a specific C++ compiler; this is often needed if your default g++ is too old.
de_de: Wird verwendet, um einen bestimmten C++ -Compiler anzugeben. Dies ist häufig erforderlich, wenn der standardmäßig verwendete g++ zu alt ist.
es_un: Se utiliza para especificar un compilador de C++ particular; esto a menudo es necesario si tu g++ predeterminado es demasiado antiguo.
fr_fr: Utilisé pour désigner un compilateur C++ spécifique; c'est souvent nécessaire si votre g++ par défaut est trop ancien.
ja_jp: 特定のC++コンパイラを指定するときに使用します。デフォルトのg++が古すぎる場合は、しばしば必要になります。
pl_pl: Służy do określania konkretnego kompilatora języka C++. Jest to często potrzebne, jeśli domyślny g++ jest zbyt stary.
ta_in: ஒரு குறிப்பிட்ட சி ++ தொகுப்பியைக் குறிப்பிடப் பயன்படுகிறது; உங்கள் இயல்புநிலை g ++ மிகவும் பழையதாக இருந்தால் இது பெரும்பாலும் தேவைப்படும்.
te_in: నిర్దిష్ట C++ కంపైలర్‌ను పేర్కొనడానికి ఉపయోగించబడుతుంది; మీ డిఫాల్ట్ g++ చాలా పాతది అయితే ఇది తరచుగా అవసరమవుతుంది.
tr_tr: Belirli bir C++ derleyicisini belirtmek için kullanılır; varsayılan g++'ınız çok eskiyse bu genellikle gereklidir.
vi_vn: Dùng để xác định trình biên dịch C++, điều này thường cân thiết nếu trình biên dịch g++ của bạn quá cũ.

source: Used to specify the platform name in the output Python package.
de_de: Wird verwendet, um den Plattformnamen im ausgegebenen Python-Paket anzugeben.
es_un: Se usa para especificar el nombre de la plataforma en el paquete Python de salida.
fr_fr: Utilisé pour spécifier le nom de la plateforme dans le package Python de sortie.
ja_jp: 出力Pythonパッケージ内のプラットフォーム名を指定する時に使用します。
pl_pl: Używane do określenia nazwy platformy w wyjściowych pakietach Pythona.
ta_in: வெளியீடு பைதான் தொகுப்பில் இயங்குதள பெயரைக் குறிப்பிட பயன்படுகிறது.
te_in: అవుట్పుట్ Python ప్యాకేజీలో ప్లాట్ఫార్ పేరు తెలుపుటకు ఉపయోగించబడుతుంది.
tr_tr: Çıktı Python paketindeki platform adını belirtmek için kullanılır.
vi_vn: Dùng để xác định tên nền tảng trong gói đầu ra của Python.

source: Used to specify whether or not static linking should be used.
de_de: Wird verwendet um anzugeben, ob statisch gelinkt werden soll oder nicht.
es_un: Se utiliza para especificar si se debe utilizar o no el enlazado estático.
fr_fr: Utilisé pour indiquer si un lien statique doit être utilisé ou non.
ja_jp: 静的リンクを使用するか否かを指定する時に使用します。
pl_pl: Służy do określenia, czy należy stosować linkowanie statyczne.
ta_in: நிலையான இணைப்பு பயன்படுத்தப்பட வேண்டுமா இல்லையா என்பதைக் குறிப்பிட பயன்படுகிறது.
te_in: స్టాటిక్ లింకింగ్ ఉపయోగించబడిందో లేదో తెలుపుటకు ఉపయోగించబడుతుంది.
tr_tr: Statik bağlantının kullanılıp kullanılmayacağını belirtmek için kullanılır.
vi_vn: Dùng để xác định rõ có nên sử dụng liên kết tĩnh hay không.

source: Some of these options are not platform-specific. These particular platforms are listed because they are commonly used in the environment. Refer to the tool documentation for more information.
de_de: Manche dieser Optionen sind nicht plattformspezifisch. Die entsprechenden Plattformen sind aufgeführt, weil sie meistens dort genutzt werden. In der jeweiligen Dokumentation des Tools findet man bei Bedarf weitere Informationen.
es_un: Algunas de estas opciones no son específicas de la plataforma. Estas plataformas en particular se enumeran porque se usan comúnmente en un entorno local. Consulta la documentación de la herramienta para obtener más información.
fr_fr: Certaines de ces options ne sont pas spécifiques à une plateforme. Ces plateformes spécifiques sont répertoriées parce qu'elles sont couramment utilisées dans l'environnement. Pour plus d'informations, reportez-vous à la documentation de l'outil.
ja_jp: これらのオプションの中には、プラットフォームに依存しないものもあります。これらの特定のプラットフォームがリストアップされているのは、その環境でよく使われているからです。詳細については、ツールのドキュメントを参照してください。
pl_pl: Niektóre z tych opcji nie są powiązane z daną platformą. Te konkretne platformy są wymienione, ponieważ powszechnie wykorzystuje się je w środowisku. Aby uzyskać więcej informacji, należy zapoznać się z dokumentacją narzędzia.
ta_in: இந்த விருப்பங்களில் சில மேடையில் குறிப்பிட்டவை அல்ல. இந்த குறிப்பிட்ட தளங்கள் பட்டியலிடப்பட்டுள்ளன, ஏனெனில் அவை பொதுவாக சூழலில் பயன்படுத்தப்படுகின்றன. மேலும் தகவலுக்கு கருவி ஆவணங்களைப் பார்க்கவும்.
te_in: ఈ ఎంపికలలో కొన్ని ప్లాట్‌ఫారమ్-నిర్దిష్టమైనవి కావు. ఈ ప్రత్యేక ప్లాట్‌ఫారమ్‌లు సాధారణంగా ఎన్విరాన్మెంట్లో ఉపయోగించబడుతున్నందున జాబితా చేయబడ్డాయి. మరింత సమాచారం కోసం టూల్ డాక్యుమెంటేషన్‌ని చూడండి.
tr_tr: Bu seçeneklerin bazıları platforma özgü değildir. Bu özel platformlar, ortamda yaygın olarak kullanıldığı için listelenmiştir. Daha fazla bilgi için araç dokümantasyonuna bakınız.
vi_vn: Một vài tùy chọn trên không thuộc về nên tảng nào. Các nền tảng trên được liệt kê vì chúng được sử dụng phổ biến trong môi trường. Tham khảo tài liệu về công cụ để biết thêm thông tin.

source: Clone the Ignis repository.
ja_jp: Ignisリポジトリーをクローンします。
ta_in: இக்னிஸ் களஞ்சியத்தை குளோன் செய்யுங்கள்.
vi_vn: Nhân bản lại Ignis repository.

source: Cloning the repository creates a local directory called ``qiskit-ignis``.
ja_jp: リポジトリーをクローンすると、 ``qiskit-ignis`` という名前のローカル・フォルダーが作成されます。
ta_in: களஞ்சியத்தை குளோன் செய்வது ``qiskit-ignis``. என்ற உள்ளூர் கோப்பகத்தை உருவாக்குகிறது.
vi_vn: Việc tạo bản sao repository sẽ tạo nên một thư mục trên máy của bạn có tên ``qiskit-ignis``.

source: If you want to run tests or linting checks, install the developer requirements. This is not required to install or use the qiskit-ignis package when installing from source.
ja_jp: テストや文法チェックを実行したい場合は、開発者向けの要件をインストールしてください。ソースからインストールする場合、qiskit-ignisパッケージのインストールおよび使用の際には必要ありません。
ta_in: நீங்கள் சோதனைகள் அல்லது மெல்லிய காசோலைகளை இயக்க விரும்பினால், டெவலப்பர் தேவைகளை நிறுவவும். மூலத்திலிருந்து நிறுவும் போதுqiskit-ignis தொகுப்பை நிறுவ அல்லது பயன்படுத்த இது தேவையில்லை.

source: Install Ignis.
ja_jp: Ignisをインストールします。
ta_in: இக்னிஸை நிறுவவும்.
vi_vn: Cài đặt Ignis.

source: If you want to install it in editable mode, meaning that code changes to the project don't require a reinstall to be applied:
de_de: Falls es im editierbaren Modus installiert werden soll (Quelltextänderungen im Projekt erfordern keine Reinstallation), ist es mit diesem Befehl möglich:
es_un: Si deseas instalarlo en modo editable, es decir, que los cambios en el código del proyecto no requieran una reinstalación para ser aplicados:
fr_fr: Si vous souhaitez l'installer en mode modifiable, ce qui signifie que les modifications de programme apportées au projet ne nécessitent pas une réinstallation :
ja_jp: 編集可能モード(プロジェクトのコードを変更しても再インストールする必要なし) でインストールする場合:
pl_pl: Jeśli chcesz zainstalować go w trybie edytowalnym, co oznacza, że zmiany w kodzie projektu nie będą wymagały ponownego zainstalowania:
ta_in: நீங்கள் இதை திருத்தக்கூடிய பயன்முறையில் நிறுவ விரும்பினால், திட்டத்திற்கான குறியீடு மாற்றங்களுக்கு மீண்டும் நிறுவல் தேவையில்லை:
tr_tr: Düzenlenebilir modda kurulum gerçekleştirmek istiyorsanız, projedeki kod değişikliklerinin yeniden yüklenmesi gerekmez:
vi_vn: Nếu bạn muốn cài đặt nó ở chế độ chỉnh sửa, nghĩa là việc thay đổi code trong dự án không yêu cầu việc cài đặt lại để áp dụng:

source: Clone the qiskit-ibmq-provider repository.
de_de: Das qiskit-ibmq-provider Repository klonen.
es_un: Clona el repositorio qiskit-ibmq-provider.
fr_fr: Cloner le dépôt qiskit-ibmq-provider .
ja_jp: qiskit-ibmq-providerリポジトリーをクローンします。
pl_pl: Sklonuj repozytorium qiskit-ibmq-provider.
ta_in: Qiskit-ibmq-provider களஞ்சியத்தை குளோன் செய்யுங்கள்.
tr_tr: qiskit-ibmq-provider deposunu klonla.
vi_vn: Tạo bản sao qiskit-ibmq-provider repository.

source: Cloning the repository creates a local directory called ``qiskit-ibmq-provider``.
de_de: Das Klonen des Repositorys erstellt ein lokales Verzeichnis mit dem Namen ` ` qiskit-ibmq-provider ` `.
es_un: La clonación del repositorio crea un directorio local llamado ``qiskit-ibmq-provider``.
fr_fr: Cloner le dépôt crée un répertoire local appelé ``qiskit-ibmq-provider``.
ja_jp: リポジトリーをクローンすると、 ``qiskit-ibmq-provider`` という名前のローカル・フォルダーが作成されます。
pl_pl: Klonowanie repozytorium tworzy lokalny katalog o nazwie ``qiskit-ibmq-provider``.
ta_in: களஞ்சியத்தை குளோன் செய்வது ``qiskit-ibmq-provider`` என்ற உள்ளூர் கோப்பகத்தை உருவாக்குகிறது.
tr_tr: Deponun klonlanması, ``qiskit-ibmq-provider`` adlı yerel bir dizin oluşturur.
vi_vn: Việc tạo bản sao repository sẽ tạo nên một thư mục trên máy của bạn có tên ``qiskit-ibmq-provider``.
