Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/getting_started.po
Languages: de_de, es_mx, es_un, fr_fr, id_id, it_it, ja_jp, pl_pl, ta_in, te_in, tr_tr, vi_vn, zh_cn

source: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (if you want to connect to the IBM Quantum devices or online simulator)
de_de: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (wenn man IBM Q-Systeme oder Simulatoren verwenden möchte)
es_un: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (si deseas conectarte a los dispositivos IBM Quantum o al simulador en línea)
fr_fr: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (si vous souhaitez pouvoir vous connecter à des devices IBM Quantum ou accéder au simulateur en ligne)
ja_jp: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (IBM Quantum デバイスやオンライン・シミュレーターに接続する場合)
pl_pl: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (jeśli chcesz połączyć się z urządzeniami IBM Quantum lub symulatorem online)
ta_in: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (நீங்கள் IBM குவாண்டம் சாதனங்கள் அல்லது ஆன்லைன் ஒப்புருவாக்கி இணைக்க விரும்பினால்)
tr_tr: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (IBM Quantum aygıtlarına ya da çevrimiçi simülatöre bağlanmak istiyorsanız)
vi_vn: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (Nếu bạn muốn kết nối đến các thiết bị lượng tử của IBM hoặc giả lập mô phỏng online)

source: To work with several components and elements simultaneously, use the following steps for each element.
de_de: Um mit mehreren Komponenten und Elementen gleichzeitig zu arbeiten, müssen die folgenden Schritte für jedes Element ausgeführt werden.
es_un: Para trabajar con varios componentes y elementos simultáneamente, utiliza los siguientes pasos para cada elemento.
fr_fr: Pour travailler avec plusieurs composants et éléments en même temps, suivez l'ordre ci-dessous pour chaque composant.
ja_jp: いくつかのコンポーネントとエレメントで同時に作業したい場合には、各エレメントに対して以下のステップを踏みます。
pl_pl: Aby pracować jednocześnie z kilkoma składnikami i elementami, dla każdego elementu należy wykonać następujące kroki.
ta_in: ஒரே நேரத்தில் பல கூறுகள் மற்றும் உறுப்புகளுடன் வேலை செய்ய, ஒவ்வொரு உறுப்புக்கும் பின்வரும் படிகளைப் பயன்படுத்தவும்.
te_in: అనేక భాగాలు మరియు మూలకాలతో ఏకకాలంలో పని చేయడానికి, ప్రతి మూలకం కోసం క్రింది దశలను ఉపయోగించండి.
tr_tr: Aynı anda birden çok bileşen ve öğeyle çalışmak istiyorsanız, her bir öğe için aşağıdaki adımları kullanın.
vi_vn: Để có thể làm việc với các thành phần nguyên tố và phần tử cùng lúc, hãy làm theo các bước sau cho mỗi thành phần.

source: Due to the use of namespace packaging in Python, care must be taken in how you install packages. If you're planning to install any element from source, do not use the ``qiskit`` meta-package. Also, follow this guide and use a separate virtual environment for development. If you do choose to mix an existing installation with your development, refer to https://github.com/pypa/sample-namespace-packages/blob/master/table.md for the set of combinations of installation methods that work together.
de_de: Aufgrund der Verwendung von Namespaces in Python muss darauf geachtet werden, wie Pakete installiert werden. Wenn Sie ein Element aus der Quelle installieren möchten, verwenden Sie nicht das ``qiskit`` -Meta-Paket. Folgen Sie diesem Handbuch und verwenden Sie eine separate virtuelle Umgebung für die Entwicklung. Wenn Sie vorhaben, eine vorhandene Installation mit Ihrer Entwicklung zu mischen, lesen Sie die Informationen unter https://github.com/pypa/sample-namespace-packages/blob/master/table.md für die Kombinationen von Installationsmethoden, die zusammen funktionieren.
es_un: Debido al uso del empaquetado de espacios de nombres (namespace) en Python, se debe tener cuidado al instalar los paquetes. Si planeas instalar cualquier elemento desde el código fuente, no uses el metapaquete ``qiskit``. Además, sigue esta guía y utiliza un entorno virtual independiente para el desarrollo. Si eliges mezclar una instalación existente con su desarrollo, consulta https://github.com/pypa/sample-namespace-packages/blob/master/table.md para ver el conjunto de combinaciones de métodos de instalación que funcionan juntos.
fr_fr: Faites attention lorsque vous installez des packages (en raison des espaces de nommage dans le packaging Python). Si vous souhaitez installer depuis la source, n'utilisez pas le meta-package ``qiskit``. Suivez ce guide et utilisez un environnement de développement à part. Si vous choisissez de mélanger une installation existante avec votre propre installation, lisez https://github.com/pypa/sample-namespace-packages/blob/master/table.md pour découvrir les différentes combinaisons d'installations compatibles.
ja_jp: Pythonの名前空間パッケージを使用しているため、パッケージのインストール方法には注意する必要があります。もしソースからエレメントをインストールすることを考えている場合は、``qiskit`` メタパッケージを使用しないでください。また、このガイドに従って、開発用に別の仮想環境を使用してください。もし、既存のインストールと開発環境を混在させる場合は、https://github.com/pypa/sample-namespace-packages/blob/master/table.md を参照して、連携するインストール方法の組み合わせを確認してください。
pl_pl: Ze względu na użycie przestrzeni nazw w Pythonie, należy zachować ostrożność podczas instalacji pakietów. Jeśli planujesz zainstalować dowolny element ze źródła, nie używaj meta-pakietu ``qiskit````. Należy również postępować zgodnie z niniejszym przewodnikiem i korzystać z oddzielnego wirtualnego środowiska. Jeśli zdecydujesz się zmieszać istniejącą instalację z już istniejącą, zapoznaj się z https://github.com/pypa/sample-namespace-packages/blob/master/table.md dla zbioru kombinacji metod instalacji, które współpracują ze sobą.
ta_in: பைத்தானில் namespace பேக்கேஜிங் பயன்படுத்தப்படுவதால், நீங்கள் தொகுப்புகளை எவ்வாறு நிறுவுவது என்பது குறித்து கவனம் செலுத்த வேண்டும். மூலத்திலிருந்து எந்த உறுப்பையும் நிறுவ திட்டமிட்டால், ``qiskit`` மெட்டா-தொகுப்பு பயன்படுத்த வேண்டாம். மேலும், இந்த வழிகாட்டியைப் பின்பற்றி, மேம்பாட்டிற்கான ஒரு தனி மெய்நிகர் சூழலைப் பயன்படுத்தவும். ஏற்கனவே உள்ள நிறுவலை உங்கள் வளர்ச்சியுடன் கலக்க நீங்கள் தேர்வு செய்தால், ஒன்றாக வேலை செய்யும் நிறுவல் முறைகளின் தொகுப்புக்கான https://github.com/pypa/sample-namespace-packages/blob/master/table.md பார்க்கவும்.
te_in: Pythonలో నేమ్‌స్పేస్ ప్యాకేజింగ్ ఉపయోగించడం వల్ల, మీరు ప్యాకేజీలను ఎలా ఇన్‌స్టాల్ చేయడంలో జాగ్రత్త తీసుకోవాలి. మీరు సోర్స్ నుండి ఏదైనా మూలకాన్ని ఇన్‌స్టాల్ చేయాలని ప్లాన్ చేస్తుంటే, ``qiskit`` మెటా-ప్యాకేజీని ఉపయోగించవద్దు. అలాగే, ఈ గైడ్‌ని అనుసరించండి మరియు అభివృద్ధి కోసం ప్రత్యేక వర్చువల్ వాతావరణాన్ని ఉపయోగించండి. మీరు ఇప్పటికే ఉన్న ఇన్‌స్టాలేషన్‌ను మీ డెవలప్‌మెంట్‌తో కలపాలని ఎంచుకుంటే, కలిసి పనిచేసే ఇన్‌స్టాలేషన్ పద్ధతుల కలయికల కోసం https://github.com/pypa/sample-namespace-packages/blob/master/table.mdని చూడండి.
tr_tr: Python'da namespace paketlemesinin kullanılması nedeniyle, paketlerin nasıl kurulduğuna dikkat edilmesi gerekmektedir. Kaynaktan herhangi bir öge yüklemeyi planlıyorsanız, ``qiskit`` meta paketini kullanmayın. Ayrıca, bu kılavuzu takip edin ve geliştirme için ayrı bir sanal ortam kullanın. Mevcut bir kurulumu geliştirmenizle karıştırmak isterseniz, birlikte çalışan kurulum yöntemi kombinasyonları için https://github.com/pypa/sample-namespace-packages/blob/master/table.md adresine bakınız.

source: Installing from source requires that you have a C++ compiler on your system that supports C++11.
es_un: La instalación desde el código fuente requiere que tengas un compilador C ++ en tu sistema que admita C++11.
ja_jp: ソースからインストールするには、お使いのシステム上にC++11をサポートするC++コンパイラが必要です。
ta_in: மூலத்திலிருந்து நிறுவுவதற்கு C++ 11 ஐ ஆதரிக்கும் C++ தொகு உங்கள் கணினியில் இருக்க வேண்டும்.
vi_vn: Cài đặt từ nguồn yêu cầu một trình biên dịch C++ trong hệ thống của bạn và phải hỗ trợ C++11.

source: Compiler for Linux
es_un: Compilador para Linux
ja_jp: Linuxのコンパイラー
ta_in: Linux க்கான மொழிமாற்றி
vi_vn: Trình biên dịch cho Linux

source: On most Linux platforms, the necessary GCC compiler is already installed.
es_un: En la mayoría de las plataformas Linux, el compilador GCC necesario ya está instalado.
ja_jp: ほとんどのLinuxプラットフォームには、必要なGCCコンパイラーがインストール済みです。
ta_in: பெரும்பாலான Linux தளங்களில், தேவையான GCC தொகு ஏற்கனவே நிறுவப்பட்டுள்ளது.
vi_vn: Trên hầu hết các nền tảng Linux, các trình biên dịch GCC thường đã được cài sẵn.

source: Compiler for macOS
es_un: Compilador para macOS
ja_jp: macOSのコンパイラー
ta_in: MacOS க்கான மொழிமாற்றி
vi_vn: Trình biên dịch cho macOS

source: If you use macOS, you can install the Clang compiler by installing XCode. Check if you have XCode and Clang installed by opening a terminal window and entering the following.
es_un: Si usas macOS, puedes instalar el compilador Clang instalando XCode. Verifica si tienes XCode y Clang instalados abriendo una ventana de terminal e ingresando lo siguiente.
ja_jp: macOSを使用している場合は、XCodeをインストールすることで、Clangのコンパイラーをインストールすることができます。ターミナル・ウィンドウを開き以下のコマンドを入力して、XCodeとClangがイントールされていることを確認します。
ta_in: நீங்கள் MacOS ஐப் பயன்படுத்தினால், XCode ஐ நிறுவுவதன் மூலம் Clang தொகு நிறுவலாம். நீங்கள் XCode மற்றும் Clang நிறுவப்பட்டிருந்தால் சரிபார்க்கவும் ஒரு டெர்மினல் விண்டோவைத் திறந்து பின்வருவனவற்றை உள்ளிடவும்.
vi_vn: Nếu bạn sử dụng macOS, bạn có thể cài đặt trình biên dịch Clang bằng cách cài đặt XCode. Kiểm tra bạn đã cài đặt XCode và Clang bằng cách mở terminal và nhập.

source: Install XCode and Clang by using the following command.
es_un: Instala XCode y Clang usando el siguiente comando.
ja_jp: 以下のコマンドでXCodeとClandをインストールします。
ta_in: பின்வரும் கட்டளையைப் பயன்படுத்தி XCode மற்றும் Clang ஐ நிறுவவும்.
vi_vn: Cài đặt XCode và Clang bằng câu lệnh sau.

source: Compiler for Windows
es_un: Compilador para Windows
ja_jp: Windowsのコンパイラー
ta_in: Windows -க்கான மொழிமாற்றி
vi_vn: Trình biên dịch cho Windows

source: On Windows, it is easiest to install the Visual C++ compiler from the `Build Tools for Visual Studio 2019 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2019>`__. You can instead install Visual Studio version 2015 or 2017, making sure to select the options for installing the C++ compiler.
es_un: En Windows, es más fácil instalar el compilador de Visual C++ desde las `Build Tools para Visual Studio 2019 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2019>`__. En su lugar, puedes instalar Visual Studio versión 2015 o 2017, asegurándote de seleccionar las opciones para instalar el compilador de C++.
ja_jp: Windowsでは、Visual C++ Compilerを `Build Tools for Visual Studio 2019 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2019>`__ からインストールする方法が最も簡単です。その他に Visual Studio 2015 あるいは 2017 をインストールする方法もありますが、その際にはインストール・オプションの C++ compiler を選択することを忘れない様にしてください。
ta_in: விண்டோஸ் மீது, `Build Tools for Visual Studio 2019 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2019>`__ இருந்து விஷுவல் சி + + கம்பைலரை நிறுவ எளிதானது. அதற்கு பதிலாக நீங்கள் விஷுவல் ஸ்டூடியோ பதிப்பு 2015 அல்லது 2017 ஐ நிறு__வலாம், சி ++ கம்பைலரை நிறுவுவதற்கான விருப்பங்களைத் தேர்ந்தெடுக்கவும்.
vi_vn: Đối với Windows, cách dễ nhất là cài đặt trình biên dịch Visual C++ từ `Build Tools for Visual Studio 2019 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2019>`__. Ngoài ra, bạn cũng có thể cài đặt Visual Studio phiên bản 2015 hoặc 2017, hãy đảm bảo rằng bạn lựa chọn các tùy chọn cho việc cài đặt trình biên dịch C++.

source: Once the compilers are installed, you are ready to install Qiskit Terra.
es_un: Una vez instalados los compiladores, estás listo para instalar Qiskit Terra.
ja_jp: コンパイラーがインストールされたら、Qiskit Terraのイントール準備完了です。
ta_in: தொகுப்பிகள் நிறுவப்பட்டவுடன், நீங்கள் Qiskit Terra நிறுவ தயாராக உள்ளன.
vi_vn: Khi trình biên dịch đã được cài đặt, bạn đã sẵn sàng để cài đặt Qiskit Terra.

source: Clone the Terra repository.
de_de: Klonen Sie das Terra-Repository.
es_un: Clona el repositorio de Terra.
fr_fr: Clonez the dépôt Terra.
ja_jp: Terraリポジトリーをクローンします。
pl_pl: Sklonuj repozytorium Terra.
ta_in: Terra களஞ்சியத்தை க்ளோன் செய்யுங்கள்.
te_in: Terra రిపోజిటరీని క్లోన్ చేయండి.
tr_tr: Terra deposunu klonlayın.
vi_vn: Tạo ra bản sao của Terra repository.

source: Cloning the repository creates a local folder called ``qiskit-terra``.
de_de: Das Klonen des Repositorys erzeugt einen lokalen Ordner namens ``qiskit-terra``.
es_un: La clonación del repositorio crea una carpeta local llamada ``qiskit-terra``.
fr_fr: Le clonage du dépôt crée un dossier local appelé ``qiskit-terra``.
ja_jp: リポジトリーをクローンすると、``qiskit-terra`` という名前のローカル・フォルダーが作成されます。
pl_pl: Klonowanie repozytorium tworzy lokalny folder o nazwie ``qiskit-terra``.
ta_in: களஞ்சியத்தை க்ளோனிங் செய்வது ``qiskit-terra`` என்று ஒரு உள்ளூர் கோப்புறையை உருவாக்குகிறது.
te_in: రిపోజిటరీని క్లోనింగ్ చేయడం ద్వారా ``qiskit-terra`` అనే స్థానిక ఫోల్డర్‌ని సృష్టిస్తుంది.
tr_tr: Depoyu klonlamak ``qiskit-terra`` adında yerel bir klasör oluşturur.
vi_vn: Việc tạo ra bản sao của repository sẽ tạo nên một thư mục có tên ``qiskit-terra``.

source: Install the Python requirements libraries from your ``qiskit-terra`` directory.
es_un: Instala las bibliotecas de requerimientos de Python desde tu directorio ``qiskit-terra``.
ja_jp: 作成された ``qiskit-terra`` ディレクトリーから、Pythonの必要なライブラリーをインストールします。
ta_in: உங்கள் ``qiskit-terra`` கோப்பகத்தில் இருந்து Python தேவைகள் நூலகங்களை நிறுவவும்.
vi_vn: Cài đặt các thư viện Python cần thiết từ thư mục ``qiskit-terra``.

source: If you want to run tests or linting checks, install the developer requirements.
de_de: Sollen Tests oder Linting Prüfungen durchgeführt werden, müssen die dazu erforderlichen Developer Anforderungen installiert werden.
es_un: Si quieres ejecutar pruebas o verificaciones de linting, instala los requerimientos de desarrollador.
fr_fr: Si vous souhaitez réaliser des tests ou faire de l'analyse de code source (linting), installez les pré-requis du développeur.
ja_jp: もし、テストを実行したり文法をチェックしたい場合は、開発者向けライブラリーをインストールします。
pl_pl: Jeśli chcesz przeprowadzić testy lub sprawdzać składnię (linting), zainstaluj wymagane oprogramowanie (developer requirements).
ta_in: நீங்கள் சோதனைகள் அல்லது லிட்டிங் காசோலைகளை இயக்க விரும்பினால், உருவாக்குபவர் தேவைகளை நிறுவவும்.
te_in: మీరు టెస్ట్స్ లేదా లిన్టింగ్ చెక్స్ను అమలు చేయాలనుకుంటే, డెవలపర్ అవసరాలను ఇన్‌స్టాల్ చేయండి.
tr_tr: Test veya hata tarama kontrolleri yapmak istiyorsanız, geliştirici gereksinimlerini yükleyin.

source: Install ``qiskit-terra``.
es_un: Instalar ``qiskit-terra``.
fr_fr: Installez ``qiskit-terra``.
ja_jp: ``qiskit-terra`` をインストールします。
pl_pl: Zainstaluj ``qiskit-terra``.
ta_in: ``qiskit-terra`` நிறுவவும்.
te_in: ``qiskit-terra``ని ఇన్‌స్టాల్ చేయండి.
tr_tr: ``qiskit-terra``'yı yükleyin.
vi_vn: Cài đặt ``qiskit-terra``.

source: If you want to install it in editable mode, meaning that code changes to the project don't require a reinstall to be applied, you can do this with:
de_de: Möchten Sie eine Installation im editierbaren Modus vornehmen, was bedeutet, dass Codeänderungen am Projekt keine Neuinstallation erfordern, kann man das wie folgt machen:
es_un: Si deseas instalarlo en modo editable, es decir, que los cambios en el código del proyecto no requieran ser instalados de nuevo, puedes hacerlo con:
fr_fr: Pour une installation en mode éditable (les changements dans le code sont alors pris en compte sans besoin de réinstaller le projet), vous pouvez choisir cette commande :
ja_jp: 編集可能モード(プロジェクトのコードを変更しても再インストールする必要なし) でインストールする場合は、次の手順を実行します:
pl_pl: Jeśli chcesz zainstalować ``qiskit-terra`` w trybie edytowalnym, co oznacza, że zmiany kodu w projekcie nie będą wymagały ponownej instalacji, możesz to zrobić za pomocą:
ta_in: திருத்தக்கூடிய பயன்முறையில் அதை நிறுவ விரும்பினால், திட்டத்தில் குறியீடு மாற்றங்கள் ஒரு மறுநிறுவல் தேவையில்லை, நீங்கள் இதை செய்யலாம்:
te_in: మీరు దీన్ని సవరించగలిగే మోడ్‌లో ఇన్‌స్టాల్ చేయాలనుకుంటే, ప్రాజెక్ట్‌కి కోడ్ మార్పులకు మళ్లీ ఇన్‌స్టాల్ చేయాల్సిన అవసరం లేదు, మీరు దీన్ని దీనితో చేయవచ్చు:
tr_tr: Eğer düzenlenebilir modda kurmak istiyorsanız, yani projede yapılan kod değişikliklerinin uygulanması için yeniden yükleme gerekmiyorsa, bu işlemi şununla yapabilirsiniz:
vi_vn: Nếu bạn muốn cài đặt nó ở chế độ chỉnh sửa, nghĩa là việc thay đổi code trong project không yêu cầu cài đặt lại để áp dụng, bạn có thể làm được với:

source: You can then run the code examples after installing Terra. You can run the example with the following command.
de_de: Anschließend können Sie die Codebeispiele nach der Installation von Terra ausführen. Sie können das Beispiel mit dem folgenden Befehl ausführen.
es_un: A continuación, puedes ejecutar los ejemplos de código después de instalar Terra. Puedes ejecutar el ejemplo con el siguiente comando.
fr_fr: Une fois l'installation terminée, vous pouvez exécuter un premier exemple de code.
ja_jp: Terraのインストール後、サンプル・コードを実行することができます。サンプルを実行するには以下のコマンドを使用します:
pl_pl: Po zainstalowaniu Terra możesz uruchomić przykładowy kod za pomocą następującego polecenia.
ta_in: Terra வை நிறுவிய பிறகு நீங்கள் குறியீடு உதாரணங்களை இயக்கலாம். பின்வரும் கட்டளைமூலம் உதாரணத்தை இயக்கலாம்.
te_in: Terraను ఇన్‌స్టాల్ చేసిన తర్వాత మీరు కోడ్ ఉదాహరణలను అమలు చేయవచ్చు. మీరు కింది ఆదేశంతో ఉదాహరణను అమలు చేయవచ్చు.
tr_tr: Terra kurulumundan sonra kod örneklerini çalıştırabilirsiniz. Örneği aşağıdaki komutla çalıştırabilirsiniz.
vi_vn: Bạn có thể chạy các ví dụ code sau khi cài đặt Terra. Bạn có thể chạy ví dụ với những lệnh sau.

source: If you do not intend to install any other components, qiskit-terra will emit a ``RuntimeWarning`` warning that both qiskit-aer and qiskit-ibmq-provider are not installed. This is done because users commonly intend to use the additional elements, but do not realize they are not installed, or that the installation of either Aer or the IBM Quantum Provider failed for some reason. If you wish to suppress these warnings, add::
de_de: Beabsichtigt man keine Installation von weiteren Komponenten, wird qiskit-terra eine ``RuntimeWarning`` ausgeben, dass qiskit-aer und qiskit-ibmq-provider nicht installiert sind. Dies ist beabsichtigt, da Benutzer normalerweise diese zusätzlichen Elemente verwenden wollen und nicht realisieren, dass diese noch nicht installiert sind, oder dass die Installation von Aer oder dem IBM Quantum Provider nicht funktioniert hat. Möchte man diese Warnung unterdrücken, fügt man Folgendes hinzu::
es_un: Si no tienes la intención de instalar ningún otro componente, qiskit-terra emitirá una advertencia ``RuntimeWarning`` debido a que tanto qiskit-aer como qiskit-ibmq-provider no están instalados. Esto se hace porque los usuarios normalmente tienen la intención de utilizar los elementos adicionales, pero no se dan cuenta de que no están instalados o de que la instalación de Aer o IBM Quantum Provider falló por algún motivo. Si deseas suprimir estas advertencias, agrega::
fr_fr: Si vous n'installez aucun composant supplémentaire, qiskit-terra émettra un avertissement (``RuntimeWarning``) vous informant que qiskit-aer et qiskit-ibmq-provider ne sont pas installés. Ceci est fait car il est fréquent que les utilisateurs souhaitent utiliser des éléments additionnels, sans réaliser qu'ils ne sont pas installés, ou que les installations de Aer ou de IBM Quantum Provider ont échoué . Si vous souhaitez ne plus avoir cet avertissement, ajoutez ::
ja_jp: 他のコンポーネントをインストールしない場合、qiskit-terraはqiskit-aerとqiskit-ibmq-providerの両方がインストールされていないことを示す ``RuntimeWarning`` を発します。これは追加要素を使用するつもりだが、インストールされていないことに気づかなかったり、AerやIBM Quantum Providerのインストールが何らかの理由でインストールが失敗しているために警告を発します。これらの警告を抑制したい場合は、以下を追加してください:
pl_pl: Jeśli nie zamierzasz instalować innych składników, qiskit-terra wyświetli ostrzeżenie ``RuntimeWarning`` informujące, że qiskit-aer i qiskit-ibmq-provider nie są zainstalowane. Użytkownicy często planują wykorzystanie składników, nie zdając sobie sprawy, że nie są one zainstalowane, lub że z jakiegoś powodu instalacja Aer lub IBM Quantum nie powiodła się. Aby na stałe wyłaczyć te ostrzeżenia, dodaj::
ta_in: நீங்கள் வேறு எந்த உபகரணங்களையும் நிறுவ விரும்பவில்லை என்றால், Qiskit--aer மற்றும் Qiskit-ibmq-provider இரண்டும் நிறுவப்படவில்லை என்று ஒரு ``RuntimeWarning`` எச்சரிக்கை யை qiskit-terra உமிக்கும். பயனர்கள் பொதுவாக கூடுதல் உறுப்புகளைப் பயன்படுத்த விரும்புவதால் இது செய்யப்படுகிறது, ஆனால் அவை நிறுவப்படவில்லை என்பதை உணரவில்லை, அல்லது ஏர் அல்லது IBM குவாண்டம் வழங்குநரின் நிறுவல் சில காரணங்களால் தோல்வியடைந்தது. இந்த எச்சரிக்கைகளை அடக்க விரும்பினால், சேர்::
tr_tr: Başka bir bileşen kurmak istemiyorsanız eğer, qiskit-terra, hem qiskit-aer hem de qiskit-ibmq-provider yüklü olmadığı konusunda bir ``RuntimeWarning`` uyarısı verecektir. Bu, kullanıcılar genellikle ek öğeleri kullanmayı düşündükleri ancak yüklü olmadıklarının farkında olmadıkları veya Aer veya IBM Quantum Provider'ın kurulumunun bir nedenden dolayı başarısız olduğu için yapılır. Bu uyarıları gizlemek istiyorsanız, kodunuza şunu ekleyin::
vi_vn: Nếu bạn không có ý định cài đặt bất kỳ thành phần nào khác, qiskit-terra sẽ hiện ra ``RuntimeWarning`` để cảnh báo rằng cả qiskit-aer lẫn qiskit-ibmq-provider không được cài đặt. Điều này được thực hiện bởi vì người dùng thường có ý định sử dụng thêm các thành phần nguyên tố khác, nhưng không nhận ra chúng không được cài đặt, hoặc việc cài đặt Aer hay IBM Quantum Provider đã thất bại vì một số lý do nào đó. Nếu bạn muốn bỏ qua những cảnh báo này, thêm::

source: before any ``qiskit`` imports in your code. This will suppress the warning about the missing qiskit-aer and qiskit-ibmq-provider, but will continue to display any other warnings from qiskit or other packages.
de_de: vor jedem ``qiskit``-Import in Ihren Code. Dies unterdrückt nur die Warnungen zu den fehlenden Paketen qiskit-aer und qiskit-ibmq-provider. Andere Warnungen von qiskit oder sonstigen Paketen erscheinen weiterhin.
es_un: antes de cualquier importación de paquetes ``qiskit`` en tu código. Esto suprimirá la advertencia sobre los componentes qiskit-aer y qiskit-ibmq-provider faltantes, pero continuará mostrando cualquier otra advertencia de qiskit u otros paquetes.
fr_fr: avant chaque import ``qiskit`` dans votre code. Cela permettra de ne plus recevoir les messages d'alerte concernant qiskit-aer et qiskit-ibmq-provider, mais vous recevrez toujours les autres avertissements venant de qiskit ou des autres packages.
ja_jp: コード内にて、``qiskit`` をまず最初にインポートするように指定します。 これにより、欠落しているqiskit-aerおよびqiskit-ibmq-providerに関する警告が抑制されますが、qiskitまたは他のパッケージからのその他の警告は継続して表示されます。
pl_pl: przed jakimkolwiek importem ``qiskit`` do twojego kodu. Spowoduje to usunięcie ostrzeżenia o brakującym dostawcy qiskit-aer i qiskit-ibmq, ale inne ostrzeżenia z qiskit lub innych pakietów nadal będą widoczne.
ta_in: உங்கள் குறியீட்டில் எந்த ``qiskit`` இறக்குமதி முன். இது காணாமல் போன qiskit--aer மற்றும் Qiskit-ibmq-provider பற்றிய எச்சரிக்கையை ஒடுக்கும், ஆனால் Qiskit அல்லது பிற தொகுப்புகளில் இருந்து வேறு எந்த எச்சரிக்கைகளையும் தொடர்ந்து காண்பிக்கும்.
tr_tr: bunu kodunuza herhangi bir ``qiskit`` içe aktarması yapmadan önce yapın. Bu, eksik qiskit-aer ve qiskit-ibmq-provider hakkındaki uyarıyı bastırır, ancak qiskit veya diğer paketlerden gelen diğer uyarıları göstermeye devam eder.

source: Clone the Aer repository.
de_de: Klonen Sie das Aer-Repository.
es_un: Clona el repositorio de Aer.
fr_fr: Cloner le dépôt Aer.
ja_jp: Aerリポジトリをクローンします。
pl_pl: Sklonuj repozytorium Aer.
ta_in: Aer களஞ்சியத்தை குளோன் செய்ய வேண்டும்.
te_in: Aer రిపోజిటరీని క్లోన్ చేయండి.
tr_tr: Aer deposunu klonlayın.
vi_vn: Tạo bản sao Aer repository.

source: Install build requirements.
es_un: Instala los requerimientos de construcción.
ja_jp: ビルドの必要要件をインストールします。
ta_in: உருவாக்க தேவைகளை நிறுவவும்.
vi_vn: Cài các bản dựng cần thiết.
