Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, hu_hu, id_id, it_it, ml_in, pl_pl, pt_br, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_cn, zh_tw

source: The central goal of Qiskit is to build a software stack that makes it easy for anyone to use quantum computers, regardless of their skill level or area of interest; Qiskit allows one to easily design experiments and applications and run them on real quantum computers and/or classical simulators. Qiskit is already in use around the world by beginners, hobbyists, educators, researchers, and commercial companies.
el_gr: Ο κεντρικός στόχος του Qiskit είναι να χτίσει μια στοίβα λογισμικού που καθιστά εύκολο για οποιονδήποτε να χρησιμοποιήσει κβαντικούς υπολογιστές, ανεξάρτητα από το επίπεδο δεξιοτήτων ή την περιοχή ενδιαφέροντός τους. Το Qiskit επιτρέπει την εύκολη σχεδίαση πειραμάτων και εφαρμογών και την εκτέλεση τους σε πραγματικούς κβαντικούς υπολογιστές ή/και κλασικούς προσομοιωτές. Το Qiskit χρησιμοποιείται ήδη σε όλο τον κόσμο από αρχάριους, χομπίστες, εκπαιδευτικούς, ερευνητές και εμπορικές εταιρείες.
es_un: El objetivo central de Qiskit es crear un conjunto de software que facilite a cualquier persona el uso de computadoras cuánticas, independientemente de su nivel de habilidad o área de interés; Qiskit permite diseñar fácilmente experimentos y aplicaciones y ejecutarlos en computadoras cuánticas reales y/o simuladores clásicos. Qiskit ya está siendo utilizado en todo el mundo por principiantes, aficionados, educadores, investigadores y empresas comerciales.
hu_hu: A Qiskit célja, hogy olyan szoftvercsomagot építsen fel, melynek segítségével egyszerűen használhatod a kvantumszámítógépeket képzettségi szintedtől és érdeklődésed mélységétől függetlenül; a Qiskittel egyszerűen lehetőséged nyílik kísérletek és alkalmazások tervezésére és ezek futtatására valódi hardveren vagy klasszikus szimulátorokon. Már világszerte kezdők, hobbisták, oktatók, kutatók és vállalkozások sokasága használja a Qiskitet.
pt_un: O objetivo central do Qiskit é construir uma pilha de software que torne fácil para qualquer pessoa utilizar computadores quânticos, independentemente de seu nível de habilidade ou área de interesse; Qiskit permite facilmente projetar experimentos e aplicativos e executá-los em computadores quânticos reais e/ou simuladores clássicos. Qiskit já está em uso em todo o mundo por iniciantes, amadores, educadores, pesquisadores e empresas comerciais.
ru_ru: Главная цель Qiskit - построить программный стек, который облегчает использование квантовых компьютеров, независимо от уровня квалификации или сферы интересов пользователей; Qiskit позволяет легко разрабатывать приложения и эксперименты и запускать их на реальных квантовых компьютерах и/или классических симуляторах. Qiskit уже используется во всем мире начинающими, энтузиастами, преподавателями, исследователями и коммерческими компаниями.
sw_ke: Lengo kuu la Qiskit ni kubuni mfumo wa programu ambao unarahisisha utumizi wa tarakilishi za kwanta kwa yeyote yule pasi na kukadiria ustadi wake au eneo analolienzi na linalomvutia zaidi; Qiskit humwezesha mtu kubuni majaribio ya utafiti wa kisayansi kwa urahisi kisha kuendesha majaribio hayo katika mitambo ya kuiga ya kiklasiki na/au katika tarakilishi halisi za kwanta. Qiskit tayari inatumiwa ulimwenguni na waanzaji wapya, wapenzi wa tarakilishi za kwanta, walimu na wakufunzi, watafiti na makampuni ya kibiashara.
zh_tw: Qiskit 的核心目標是建立一個軟體堆疊，讓任何人都能輕鬆使用量子計算機，不管他們的技能水平或感興趣區域為何； Qiskit 可讓人輕鬆設計實驗和應用，並在真正的量子計算機和/或經典模擬器上執行。 Qiskit 已經由初學者、愛好者、教育者、研究人員和商業公司在世界各地使用。

source: Interested in applications of quantum computing?
es_un: ¿Interesado en aplicaciones de computación cuántica?
pt_un: Interessado em aplicações de computação quântica?
ru_ru: Интересуетесь приложениями квантовых вычислений?
sw_ke: Je! Unavutiwa na matumizi ya utarakilishi wa kwanta?
te_in: క్వాంటం కంప్యూటింగ్ అప్లికేషన్‌లపై ఆసక్తి ఉందా?
zh_cn: 对量子计算的应用感兴趣吗?

source: Interested in running experiments on real qubits?
es_un: ¿Interesado en ejecutar experimentos en qubits reales?
pt_un: Interessado na execução de experimentos em qubits reais?
ru_ru: Заинтересованы в проведении экспериментов на реальных кубитах?
sw_ke: Je! Unavutiwa na kuendesha majaribio ya utafiti wa kisayansi kwenye qubits halisi?
te_in: నిజమైన క్యు బిట్స్ పై ప్రయోగాలు చేయడంలో ఆసక్తి ఉందా?
zh_cn: 有兴趣在真实的量子位上运行实验吗?

source: Interested in quantum hardware design?
el_gr: Ενδιαφέρεστε για τον σχεδιασμό κβαντικού υλικού;
es_un: ¿Interesado en el diseño de hardware cuántico?
hu_hu: Érdekel a kvantum hardver tervezés?
pt_un: Interessado no design de hardware quântico?
ru_ru: Заинтересованы в дизайне квантовых устройств?
sw_ke: Je, unavutiwa na kubuni maunzi ya kwanta?
te_in: క్వాంటం హార్డ్‌వేర్ రూపకల్పనపై ఆసక్తి ఉందా?
zh_cn: 对量子硬件设计感兴趣吗?
zh_tw: 對量子硬體設計有興趣嗎？

source: Documentation homepage
el_gr: Αρχική σελίδα τεκμηρίωσης
hu_hu: Dokumentáció főoldal
zh_tw: 文件首頁

source: Qiskit Simulator (Aer)
el_gr: Προσομοιωτής Qiskit (Aer)
hu_hu: Qiskit Szimulátor (Aer)
zh_tw: Qiskit 模擬（Aer）

source: Qiskit Application Modules (Aqua)
el_gr: Ενότητες εφαρμογής Qiskit (Aqua)
hu_hu: Qiskit Alkalmazás Modulok (Aqua)
zh_tw: Qiskit 應用程式模組（Aqua）

source: Qiskit IBM Quantum (Provider)
el_gr: Qiskit IBM Quantum (Πάροχος)

source: Qiskit Applications (Aqua) Migration Guide
el_gr: Οδηγός Μετάβασης των εφαρμογών Qiskit (Aqua)
hu_hu: Qiskit Applikáció (Aqua) Migrálási Útmutató
zh_tw: Qiskit 應用（Aqua）搬遷指南

source: Qiskit Experiments (Ignis)
hu_hu: Qiskit Kísérletek (Ignis)
zh_tw: Qiskit 實驗（Ignis）

source: Documentation Home
te_in: డాక్యుమెంటేషన్ హోమ్
zh_cn: 文档主页

source: API Reference
te_in: API రిఫరెన్స్
zh_cn: API 参考

source: Migration Guides
te_in: మైగ్రేషన్ గైడ్స్
zh_cn: 迁移指南

source: Contributing
te_in: సహకరిస్తోంది
zh_cn: 参与贡献

source: Qiskit IBM Quantum Provider (deprecated)
te_in: Qiskit IBM Quantum Provider (తిరస్కరించబడింది)
zh_cn: Qiskit IBM Quantum Provider (已废弃)

source: Other API References
te_in: ఇతర API రిఫరెన్సులు
zh_cn: 其他 API 参考

source: Qiskit is open-source software for working with quantum computers at the level of circuits, pulses, and algorithms. Additionally, several domain specific application APIs exist on top of this core module.
te_in: Qiskit అనేది సర్క్యూట్‌లు, పల్స్‌లు మరియు ఆల్గోరిథమ్స్ స్థాయిలో క్వాంటం కంప్యూటర్‌లతో పనిచేయడానికి ఓపెన్ సోర్స్ సాఫ్ట్‌వేర్. అదనంగా, ఈ కోర్ మాడ్యూల్ పైన అనేక డొమైన్ నిర్దిష్ట అప్లికేషన్ APIలు ఉన్నాయి.

source: The central goal of Qiskit is to build a software stack that makes it easy for anyone to use quantum computers, regardless of their skill level or area of interest; Qiskit allows one to easily design experiments and applications and run them on real quantum computers and/or classical simulators. Qiskit is already in use around the world by beginners, hobbyists, educators, researchers, and commercial companies.
te_in: Qiskit యొక్క ప్రధాన లక్ష్యం ఏమిటంటే, ఎవరైనా వారి నైపుణ్యం స్థాయి లేదా ఆసక్తి ఉన్న ప్రాంతంతో సంబంధం లేకుండా క్వాంటం కంప్యూటర్‌లను ఉపయోగించడాన్ని సులభతరం చేసే సాఫ్ట్‌వేర్ స్టాక్‌ను రూపొందించడం; Qiskit సులభంగా ప్రయోగాలు మరియు అప్లికేషన్‌లను రూపొందించడానికి మరియు వాటిని నిజమైన క్వాంటం కంప్యూటర్‌లు మరియు/లేదా క్లాసికల్ సిమ్యులేటర్‌లలో అమలు చేయడానికి అనుమతిస్తుంది. Qiskit ఇప్పటికే ప్రపంచవ్యాప్తంగా ప్రారంభకులు, అభిరుచి గలవారు, విద్యావేత్తలు, పరిశోధకులు మరియు వాణిజ్య సంస్థలచే ఉపయోగించబడుతోంది.

source: :bdg-link-primary-line:`Website <https://qiskit.org/metal>` :bdg-link-primary-line:`Documentation <https://qiskit.org/ecosystem/metal/>`
te_in: :bdg-link-primary-line:`వెబ్సైట్ <https://qiskit.org/metal>` :bdg-link-primary-line:`డాక్యుమెంటేషన్<https://qiskit.org/ecosystem/metal/>`
