Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: bn_bn, de_de, el_gr, es_mx, es_un, fr_fr, hu_hu, id_id, it_it, ml_in, pl_pl, pt_br, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_cn, zh_tw

source: Circuits
bn_bn: সার্কিট (বর্তনী)
de_de: Schaltkreise
es_mx: Circuitos
id_id: Sirkuit
it_it: Circuiti
pl_pl: Obwody
pt_br: Circuitos
tr_tr: Devreler
vi_vn: Mạch lượng tử

source: Advanced Circuits
bn_bn: উন্নত সার্কিট (বর্তনী)
de_de: Fortgeschrittene Schaltkreise
es_mx: Circuitos Avanzados
fr_fr: Circuits avancés
id_id: Sirkuit Lanjutan
it_it: Circuiti Avanzati
pl_pl: Obwody zaawansowane
pt_br: Circuitos Avançados
tr_tr: İleri Seviye Devreler
vi_vn: Mạch lượng tử nâng cao

source: Pulse
bn_bn: তড়িৎস্পন্দন
id_id: Pulsa
pl_pl: Impulsy

source: High-Performance Simulators
bn_bn: উচ্চ-কর্মদক্ষতাসম্পন্ন সিমুলেটর
de_de: High-Performance Simulatoren
es_mx: Simuladores de Alto Desempeño
fr_fr: Simulateurs de haute performance
id_id: Simulator Kinerja Tinggi
it_it: Simulatori ad Alta Prestazione
pl_pl: Symulatory wysokowydajne
pt_br: Simuladores de Alto Desempenho
tr_tr: Yüksek Performanslı Simülatörler
vi_vn: Bộ giả lập hiệu năng cao

source: Quantum System Error Analysis
bn_bn: কোয়ান্টাম সিস্টেমের (তন্ত্র) ত্রুটি বিশ্লেষণ
de_de: Quantensystemfehleranalyse
es_mx: Análisis de Error en Sistemas Cuánticos
fr_fr: Analyse des erreurs des systèmes quantiques
id_id: Analisis Galat Sistem Kuantum
it_it: Analisi degli Errori di un Sistema Quantistico
pl_pl: Analiza błędów systemu kwantowego
pt_br: Análise de Erros do Sistema Quântico
tr_tr: Kuantum Sistem Hata Analizi
vi_vn: Phân tích lỗi hệ thống lượng tử

source: Optimization
bn_bn: অনুকূলকরণ
de_de: Optimierung
es_mx: Optimización
fr_fr: Optimisation
id_id: Optimasi
it_it: Ottimizzazione
pl_pl: Optymalizacja
pt_br: Otimização
ta_in: தேர்வுமுறை
tr_tr: Optimizasyon
vi_vn: Tối ưu hoá

source: Finance
bn_bn: ব্যবস্থাপনাবিদ্যা
de_de: Finanzen
es_mx: Finanzas
id_id: Keuangan
it_it: Finanza
pl_pl: Finanse
pt_br: Finanças
ta_in: நிதி
tr_tr: Finans
vi_vn: Tài chính

source: Chemistry
bn_bn: রসায়ন
de_de: Chemie
es_mx: Química
fr_fr: Chimie
id_id: Kimia
it_it: Chimica
pl_pl: Chemia
pt_br: Química
ta_in: வேதியியல்
tr_tr: Kimya
vi_vn: Hoá học

source: Tutorials
bn_bn: পাঠসমূহ
es_mx: Tutoriales
fr_fr: Tutoriels
id_id: Tutorial
it_it: Tutorial
pl_pl: Poradniki
pt_br: Tutoriais
ta_in: பயிற்சிகள்
tr_tr: Eğitici Belgeler
vi_vn: Hướng dẫn

source: Circuit Library
bn_bn: সার্কিট (বর্তনী) সংক্রান্ত গ্রন্থাগার
de_de: Schaltkreisbibliotheken
el_gr: Βιβλιοθήκη Κυκλωμάτων
es_mx: Biblioteca de Circuitos
es_un: Biblioteca de circuitos
fr_fr: Bibliothèque de circuits
hu_hu: Áramkör könyvtár
id_id: Pustaka Sirkuit
ml_in: സർക്യൂട്ട് ലൈബ്രറി
pl_pl: Biblioteka obwodów
pt_br: Biblioteca de Circuitos
pt_un: Biblioteca referente ao Circuito
ru_ru: Библиотека цепей
sw_ke: Maktaba ya Saketi
ta_in: சுற்று நூலகம்
tr_tr: Devre Kütüphanesi
vi_vn: Thư viện mạch lượng tử
zh_tw: 電路檔案庫

source: Libraries
bn_bn: গ্রন্থাগারসমূহ
de_de: Bibliotheken
el_gr: Βιβλιοθήκες
es_mx: Bibliotecas
es_un: Bibliotecas
fr_fr: Bibliothèques
hu_hu: Könyvtárak
id_id: Pustaka
it_it: Librerie
ml_in: ലൈബ്രറികൾ
pl_pl: Biblioteki
pt_br: Bibliotecas
pt_un: Bibliotecas
ru_ru: Библиотеки
sw_ke: Maktaba
ta_in: நூலகங்கள்
tr_tr: Kütüphaneler
vi_vn: Thư viện
zh_tw: 程式庫

source: Qiskit Terra
bn_bn: Qiskit টেরা (টেরা অর্থ পৃথিবী)
ml_in: ക്വിസ്കിറ്റ് ടെറ
ta_in: கிஸ்கிட் நிலம்

source: Qiskit Aer
bn_bn: Qiskit এয়ার (এয়ার অর্থ বায়ু)
ml_in: ക്വിസ്കിറ്റ് എഇർ
pl_pl: Qiskit Terra
ta_in: கிஸ்கிட்

source: Qiskit Ignis
bn_bn: Qiskit ইগ্নিস (ইগ্নিস অর্থ অগ্নি)
ta_in: கிஸ்கிட் இக்னிஸ்

source: Qiskit Aqua
bn_bn: Qiskit অ্যাকোয়া (অ্যাকোয়া অর্থ জল)
ta_in: கிஸ்கிட் அக்வா

source: Qiskit IBM Quantum Provider
bn_bn: Qiskit IBM কোয়ান্টাম পরিষেবা সরবরাহকারী
es_mx: Proveedor Cuántico IBM Qiskit
es_un: Proveedor Qiskit IBM Quantum
fr_fr: Fournisseur de plateforme IBM
id_id: Qiskit Penyedia IBM Quantum
ml_in: ക്വിസ്കിറ്റ് ഐബിഎം ക്വാണ്ടം പ്രൊവയ്ഡെർ
pt_br: Qiskit IBM Provedor Quântico
pt_un: Provedor Quântico IBM Qiskit
ru_ru: Qiskit IBM Quantum (Провайдер)
ta_in: கிஸ்கிட் ஐபிஎம் குவாண்டம் வழங்குநர்
tr_tr: Qiskit IBM Kuantum Sağlayıcısı
vi_vn: Trình cung cấp lượng tử IBM Qiskit

source: API References
bn_bn: এপিআই (এপ্লিকেশন প্রোগ্রামিং ইন্টারফেস) এর তথ্যসূত্র
de_de: API-Referenzen
el_gr: Παραπομπές API
es_mx: Referencia de la API
es_un: Referencias de la API
fr_fr: Références de l'API
hu_hu: API Hivatkozások
id_id: Referensi API
it_it: Riferimenti API
ml_in: API റഫറൻസുകൾ
pl_pl: Dokumentacja API
pt_br: Referências de API
pt_un: Referências da API
ru_ru: Справочники по API
sw_ke: Kumbukumbu za API
ta_in: API குறிப்புகள்
tr_tr: API Referansları
vi_vn: Tài liệu tham khảo về API

source: Quantum Experience API error codes
bn_bn: কোয়ান্টাম এক্সপেরিয়েন্স এপিআই এর সমস্যা সংকেত
id_id: Pesan error API Quantum Experience
pl_pl: Kody błędów API Quantum Experience
pt_br: Códigos de erro da API do Quantum Experience

source: Troubleshooting
bn_bn: সমস্যা সমাধান
de_de: Problembehandlung
el_gr: Αντιμετώπιση προβλημάτων
es_mx: Solución de Problemas
es_un: Solución de Problemas
fr_fr: Résolution de problème
hu_hu: Hibaelhárítás
id_id: Penyelesaian masalah
it_it: Risoluzione Dei Problemi
pl_pl: Rozwiązywanie problemów
pt_br: Solução de problemas
pt_un: Solução de problemas
ru_ru: Устранение неполадок
sw_ke: Kutafuta Suluhu
ta_in: பழுது இடமறிதல்
tr_tr: Hata Giderme
vi_vn: Xử lí sự cố
zh_tw: 疑難排解

source: Qiskit |version| documentation
bn_bn: Qiskit |সংস্করণ| বিবরণী
de_de: Qiskit |version| Dokumentation
el_gr: Qiskit |version| τεκμηρίωση
es_mx: Qiskit |version| documentación
es_un: Documentación de Qiskit |version|
hu_hu: Qiskit |version| dokumentáció
id_id: Dokumentasi |version| Qiskit
ml_in: ക്വിസ്കിറ്റ് |വേർഷ്യൻ| ഡോക്കുമെന്റെഷൻ
pl_pl: Dokumentacja Qiskit |version|
pt_br: Documentação do Qiskit |version|
pt_un: Qiskit |version| Documentação
ru_ru: Документация Qiskit |version|
sw_ke: Waraka wa Qiskit |version|
ta_in: Qiskit |version | ஆவணம்
te_in: Qiskit |వెర్షన్ | డాక్యుమెంటేషన్
tr_tr: Qiskit |version| dökümentasyonu
zh_cn: Qiskit |version| 文档
zh_tw: Qiskit |version| 文件

source: Qiskit is an open-source framework for working with quantum computers at the level of circuits, pulses, and algorithms.
bn_bn: Qiskit হল প্রাথমিক স্তরে (বর্তনী, তড়িৎস্পন্দন এবং বিভিন্ন অ্যালগোরিদম (ধারাক্রম) ) কোয়ান্টাম কম্পিউটারে কাজ করার উপযুক্ত সবার জন্য উম্মুক্ত একটি ফ্রেমওয়ার্ক।
de_de: Qiskit ist ein Open-Source-Framework für die Arbeit mit Quantencomputern auf der Ebene von Schaltkreisen, Impulsen und Algorithmen.
es_mx: Qiskit es un framework de código abierto para trabajar con computadoras cuánticas a nivel de circuitos, pulsos y algoritmos.
fr_fr: Qiskit est un environnement de travail en open-source qui permet de programmer des ordinateurs quantiques via l'accès à des circuits, des impulsions micro-ondes et via le développement d'algorithmes.
id_id: Qiskit adalah sebuah kerangka sumber terbuka untuk bekerja dengan komputer kuantum pada tingkat sirkuit, pulsa, dan algoritma.
it_it: Qiskit è un framework open-source che permette di lavorare con i computer quantistici a livello di circuiti, impulsi ed algoritmi.
pl_pl: Qiskit jest środowiskiem typu open-source do pracy z komputerami kwantowymi na poziomie obwodów, impulsów sprzętowych i algorytmów.
pt_br: Qiskit é uma estrutura de código aberto para trabalhar com computadores quânticos no nível de circuitos, pulsos e algoritmos.
ta_in: கிஸ்கிட் என்பது சுற்றுகள், பருப்பு வகைகள் மற்றும் வழிமுறைகளின் மட்டத்தில் குவாண்டம் கணினிகளுடன் பணியாற்றுவதற்கான ஒரு திறந்த மூல கட்டமைப்பாகும்.
tr_tr: Qiskit devreler, sinyaller ve algoritmalar düzeyinde kuantum bilgisayarlarla çalışmak için açık kaynak bir çatıdır.
vi_vn: Qiskit là một khung mã nguồn mở cho việc làm việc với các máy tính lượng tử ở cấp độ, xung, và thuật toán.

source: A central goal of Qiskit is to build a software stack that makes it easy for anyone to use quantum computers. However, Qiskit also aims to facilitate research on the most important open issues facing quantum computation today.
bn_bn: Qiskit এর প্রধান উদ্দেশ্য এমন একটা সফটওয়্যার প্যাকেজ বানানো যাতে কোয়ান্টাম কম্পিউটার ব্যবহার সবার কাছে সহজ হয়ে যায়। যদিও, কোয়ান্টাম কম্পিউটেশন সংক্রান্ত গবেষণা সহজতর করাও Qiskit এর লক্ষ্য।
de_de: Ein zentrales Ziel von Qiskit ist es, einen Software-Stack zu schaffen, der die Benutzung von Quantencomputern möglichst einfach macht. Qiskit ist ausserdem bestrebt, die Forschung an den wichtigsten offenen Fragestellungen der Quantencomputing zu unterstützen.
es_mx: Un objetivo de Qiskit es construir un compendio de software que haga fácil para cualquiera el uso de computadoras cuánticas. Sin embargo, Qiskit también apunta a facilitar la investigación de los problemas que enfrenta la computación cuántica actualmente.
fr_fr: Le but principal de Qiskit est de construire une suite logicielle permettant à chacun d'utiliser des ordinateurs quantiques. Qiskit a également vocation à faciliter les progrès de la recherche sur les sujets actuellement déterminants du calcul quantique.
id_id: Tujuan utama dari Qiskit adalah untuk membangun software stack yang memudahkan siapa saja untuk menggunakan komputer kuantum. Qiskit juga bertujuan untuk memfasilitasi penelitian pada isu-isu komputasi kuantum penting yang belum terselesaikan.
it_it: Uno degli obiettivi principali di Qiskit è la creazione di uno stack software che renda semplice a chiunque l'utilizzo dei computer quantistici. Oltre a questo, Qiskit mira anche a facilitare la ricerca sulle più importanti questioni aperte che oggi la computazione quantistica deve affrontare.
pl_pl: Głównym celem Qiskit jest budowa zbioru oprogramowania, który ułatwi każdemu korzystanie z komputerów kwantowych. Niemniej jednak, Qiskit ma również na celu ułatwienie badań nad najważniejszymi zagadnieniami, które dziś stają przed informatyką kwantową.
pt_br: Um objetivo central do Qiskit é construir um software stack que facilite o uso de computadores quânticos. No entanto, o Qiskit também visa facilitar a pesquisa sobre as questões mais importantes que a computação quântica enfrenta, hoje.
ta_in: குவாண்டம் கம்ப்யூட்டர்களை யாரும் பயன்படுத்துவதை எளிதாக்கும் மென்பொருள் அடுக்கை உருவாக்குவதே கிஸ்கிட்டின் மைய குறிக்கோள். இருப்பினும், இன்று குவாண்டம் கணக்கீடு எதிர்கொள்ளும் மிக முக்கியமான திறந்த பிரச்சினைகள் குறித்த ஆராய்ச்சியை எளிதாக்குவதையும் கிஸ்கிட் நோக்கமாகக் கொண்டுள்ளது.
tr_tr: Qiskit'in ana hedefi kuantum bilgisayarları kullanmayı herkes için kolaylaştıran bir yazılım çatısı inşa etmektir. Fakat, Qiskit aynı zamanda kuantum hesaplamanın bugün karşı karşıya kaldığı en önemli açık sorunlar üzerindeki araştırmaları kolaylaştırmayı hedefler.
vi_vn: Mục tiêu trung tâm của Qiskit là xây dựng một ngăn xếp phần mềm làm cho sử dụng máy tính lượng tử dễ dàng với bất kì ai. Tuy nhiên, Qiskit cũng nhằm mục đích tạo điều kiện nghiên cứu về các vấn đề mở quan trọng nhất đối mặt với tính toán lượng tử hiện nay.

source: You can use Qiskit to easily design experiments and run them on simulators and real quantum computers.
bn_bn: Qiskit এর সাহায্যে সহজেই বিভিন্ন কোয়ান্টাম নির্দেশমালা (প্রোগ্রাম) রচনা এবং তা কোয়ান্টাম সিমুলেটরে বা আসল কোয়ান্টাম কম্পিউটারে চালানো যায়।
de_de: Mit Qiskit lassen sich Experimente einfach entwerfen, anschließend simulieren und auf echten Quantencomputern ausführen.
es_mx: Puedes usar Qiskit para facilmente diseñar experimentos y ejecutarlos en simuladores y computadoras cuanticas reales.
fr_fr: Vous pouvez utiliser Qiskit pour mettre facilement au point des programmes élémentaires et les executer à la fois sur des simulateurs et sur de vrais ordinateurs quantiques.
id_id: Anda dapat menggunakan Qiskit untuk dengan mudah merancang eksperimen dan menjalankannya baik pada simulator maupun pada komputer kuantum sungguhan.
it_it: Qiskit può essere utilizzato per disegnare esperimenti ed eseguirli sia su simulatori che su computer quantistici reali.
pl_pl: Możesz użyć Qiskit do łatwego projektowania eksperymentów i prowadzenia ich na symulatorach i prawdziwych komputerach kwantowych.
pt_br: Você pode usar o Qiskit facilmente para projetar experimentos e executá-los em simuladores e computadores quânticos reais.
ta_in: சோதனைகளை எளிதில் வடிவமைத்து அவற்றை சிமுலேட்டர்கள் மற்றும் உண்மையான குவாண்டம் கணினிகளில் இயக்க கிஸ்கிட்டைப் பயன்படுத்தலாம்.
tr_tr: Qiskit'i kolayca deneyler tasarlamak ve onları simülatörler ya da gerçek kuantum bilgisayarlarda çalıştırmak için kullanabilirsiniz.
vi_vn: Bạn có thể sử dụng Qiskit để dễ dàng thiết kế các thí nghiệm và chạy chúng trên các trình mô phỏng và máy tính lượng tử thực sự.

source: Qiskit consists of four foundational elements:
bn_bn: Qiskit চারটে স্তম্ভের উপর দাঁড়িয়ে আছে:
de_de: Qiskit besteht aus vier Basis-Elementen:
es_mx: Qiskit consta de cuatro elementos fundamentales:
fr_fr: Qiskit est constitué de quatre éléments de base :
id_id: Qiskit terdiri dari empat elemen dasar:
it_it: Qiskit è composto da quattro elementi fondamentali:
pl_pl: Qiskit składa się z czterech podstawowych elementów:
pt_br: Qiskit consiste em quatro elementos fundamentais:
ta_in: Qiskit நான்கு பழுப்பு உறுப்புகளைக் கொண்டுள்ளது:
tr_tr: Qiskit dört temel bileşenden oluşmaktadır:
vi_vn: Qiskit bao gồm bốn yếu tố nền tảng:

source: :ref:`Qiskit Terra <Terra>`: Composing quantum programs at the level of circuits and pulses with the code foundation.
bn_bn: :ref:`Qiskit টেরা <Terra>`: এখানে বিশেষ প্রোগ্রামিং ভাষার সাহায্যে একদম প্রাথমিক স্তরে বিভিন্ন বর্তনী এবং তড়িৎস্পন্দন এর মাধ্যমে কোয়ান্টাম প্রোগ্রাম বানানো হয়।
de_de: :ref:`Qiskit Terra <Terra>`: Die Grundlage, um Quantenprogramme aus Schaltkreisen und Impulsen zu entwerfen.
es_mx: :ref:'Qiskit terra <Terra>': Compone programas cuánticos a nivel de circuitos y pulsos con el fundamento del código.
fr_fr: :ref:`Qiskit Terra <Terra>`: Pour construire des programmes à partir de circuits et d'impulsions micro-ondes.
id_id: :ref:`Qiskit Terra <Terra>`: Menyusun program-program kuantum pada tingkat sirkuit dan pulsa dengan fondasi kode.
it_it: :ref:`Qiskit Terra <Terra>`: Per creare programmi quantistici a livello circuitale e di impulsi utilizzando codice a basso livello.
pl_pl: :ref:`Qiskit Terra <Terra>`: Tworzenie programów kwantowych na poziomie obwodów i pulsów za pomocą kodu.
pt_br: :ref:`Qiskit Terra <Terra>`: Compõe programas quânticos no nível de circuitos e pulsos com codificação fundamental.
ta_in: : ref: `கிஸ்கிட் டெர்ரா <டெர்ரா>`: ஃபவுண்டேஷியோ குறியீட்டைக் கொண்டு சுற்றுகள் மற்றும் பருப்புகளின் மட்டத்தில் குவாண்டம் நிரல்களை உருவாக்குதல்.
tr_tr: :ref: `Qiskit Terra <Terra>`: Kod temeliyle devre ve sinyal düzeyinde kuantum programlarının oluşturulması.
vi_vn: :ref:`Qiskit Terra <Terra>`: Soạn chương trình lượng tử ở cấp độ mạch và xung với nền tảng mã.

source: :ref:`Qiskit Aer <Aer>`: Accelerating development via simulators and noise models
bn_bn: :ref:`Qiskit এয়ার <Aer>` : এই অংশে প্রোগ্রাম বানানোর কাজ দ্রুত ও সহজ করার জন্য বিভিন্ন সিমুলেটর ও ত্রুটি নির্ণয়ের পদ্ধতি নির্মিত আছে।
de_de: :ref:`Qiskit Aer <Aer>`: Die Entwicklung mit Hilfe von Simulatoren und Rauschmodellen beschleunigen
es_mx: :ref:`Qiskit Aer <Aer>`: Acelera el desarrollo mediante simuladores y modelos con ruido.
fr_fr: :ref:`Qiskit Aer <Aer>`: Pour permettre d'accélérer le développement en utilisant des simulateurs et des modélisations de bruit
id_id: :ref:`Qiskit Aer <Aer>`: Mempercepat perkembangan melalui simulator dan model derau
it_it: :ref:`Qiskit Aer <Aer>`: Accelera lo sviluppo attraverso simulatori e modelli di rumore
pl_pl: :ref:` Qiskit Aer <Aer>`: Akceleracja rozwoju za pomocą symulatorów i modeli szumów
pt_br: :ref:`Qiskit Aer <Aer>`: Acelera o desenvolvimento, através de simuladores e modelos de ruído
ta_in: கிஸ்கிட் ஏர் <ஏர்> `: சிமுலேட்டர்கள் மற்றும் இரைச்சல் மாதிரிகள் வழியாக வளர்ச்சியை துரிதப்படுத்துகிறது
tr_tr: :ref:`Qiskit Aer <Aer>`: Simülatörler ve gürültü modelleri ile geliştirmeyi hızlandırmak
vi_vn: :ref:`Qiskit Aer <Aer>`: Tăng tốc phát triển thông qua trình mô phỏng và mô hình nhiễu

source: :ref:`Qiskit Ignis <Ignis>`: Addressing noise and errors
bn_bn: :ref:`Qiskit ইগ্নিস <Ignis>`: দূষণ (নয়েজ) এবং ত্রুটি বের করা।
de_de: :ref:`Qiskit Ignis <Ignis>`: Fokus auf Quantenrauschen und Quantenfehler
es_mx: :ref:'Qiskit Ignis <Ignis>': Maneja ruido y errores
fr_fr: :ref:`Qiskit Ignis <Ignis>`: Pour travailler avec le bruit et les erreurs
id_id: :ref:`Qiskit Ignis <Ignis>`: Mengatasi derau dan error
it_it: :ref:`Qiskit Ignis <Ignis>`: Per gestire rumore ed errori
pl_pl: :ref:`Qiskit Ignis <Ignis>`: Rozwiązanie problemu szumów i błędów
pt_br: :ref:`Qiskit Ignis <Ignis>`: Endereça ruídos e erros
ta_in: :ref:` Qiskit Ignis <Ignis>`: ஒலிகள் மற்றும் பிழைகள்
tr_tr: :ref:`Qiskit Ignis <Ignis>`: Gürültü ve hataların adreslemesi
vi_vn: :ref:`Qiskit Ignis <Ignis>`: Giải quyết nhiễu và lỗi

source: :ref:`Qiskit Aqua <Aqua>`: Building algorithms and applications
bn_bn: :ref:`Qiskit অ্যাকোয়া <Aqua>`: এখানে বিভিন্ন অ্যালগোরিদম (ধারাক্রম) এবং এর প্রয়োগ সংক্রান্ত কাজ হয়।
de_de: :ref:`Qiskit Aqua <Aqua>`: Algorithmen und Anwendungen erstellen
es_mx: :ref:'Qiskit Aqua <Aqua>': Construye algoritmos y aplicaciones.
fr_fr: :ref:`Qiskit Aqua <Aqua>`: Pour construire des algorithmes et des applications
id_id: :ref:`Qiskit Aqua <Aqua>`: Membangun algoritma dan aplikasi
it_it: :ref:`Qiskit Aqua <Aqua>`: Per costruire algoritmi ed applicazioni
pl_pl: :ref:`Qiskit Aqua <Aqua>`: Budowanie algorytmów i aplikacji
pt_br: :ref:`Qiskit Aqua <Aqua>`: Constrói algoritmos e aplicações
ta_in: கிஸ்கிட் அக்வா <Aqua> `: வழிமுறைகள் மற்றும் பயன்பாடுகளை உருவாக்குதல்
tr_tr: :ref:`Qiskit Aqua <Aqua>`: Algoritma ve uygulama inşa edilmesi
vi_vn: :ref:`Qiskit Aqua <Aqua>`: Xây dựng thuật toán và ứng dụng

source: Quantum computing in a nutshell
de_de: Quantum Computing auf den Punkt gebracht
es_mx: Computación cuántica en pocas palabras
fr_fr: L'informatique quantique en bref
it_it: Computazione quantistica "in a nutshell"
pt_br: Computação quântica em poucas palavras
tr_tr: Kısaca kuantum hesaplama
vi_vn: Điện toán lượng tử khái quát

source: Algorithms
de_de: Algorithmen
es_mx: Algoritmos
fr_fr: Algorithmes
it_it: Algoritmi
pt_br: Algoritmos
ta_in: வழிமுறைகள்
tr_tr: Algoritmalar
vi_vn: Thuật toán

source: Operators
de_de: Operatoren
es_mx: Operadores
fr_fr: Opérateurs
it_it: Operatori
pt_br: Operadores
ta_in: ஆபரேட்டர்கள்
vi_vn: Toán tử

source: Machine Learning
de_de: Maschinelles Lernen
es_mx: Aprendizaje Automático
fr_fr: Apprentissage Automatique (Machine Learning)
pt_br: Aprendizado de máquina
ta_in: இயந்திர வழி கற்றல்
tr_tr: Makine Öğrenimi

source: IBM Quantum API error codes
de_de: IBM Quantum API Fehlercodes
el_gr: Κωδικοί σφαλμάτων του IBM Quantum API
es_mx: Códigos de error de IBM Quantum API
es_un: Códigos de error de la API de IBM Quantum
fr_fr: Code d'erreur de l'API IBM Quantum
hu_hu: IBM Quantum API hibakódok
it_it: Codici di Errore dell' API IBM Quantum
ml_in: ഐ. ബി. എം. ക്വാണ്ടം API എറർ കോഡുകൾ
pt_un: Códigos de Erros da API IBM Quantum
ru_ru: Коды ошибок IBM Quantum API
sw_ke: Misimbo ya kasoro ya API ya IBM Quantum
ta_in: ஐபிஎம் குவாண்டம் ஏபிஐ பிழைக் குறியீடுகள்
vi_vn: Mã lỗi IBM Quantum API
zh_tw: IBM Quantum API 錯誤碼

source: Interested in Quantum hardware design?
de_de: Haben Sie Interesse an Quantum Hardware Design?

source: Qiskit Metal
de_de: Qiskit-Metall
ml_in: ക്വിസ്കിറ്റ് മെറ്റൽ

source: :link-badge:`https://qiskit.org/metal,"Website",cls=badge-dark text-white` :link-badge:`https://qiskit.org/documentation/metal/,"Documentation",cls=badge-primary text-white`
de_de: :link-badge:` https: //qiskit.org/metal, "Website" ,cls = badge-dark text-white ` :link-badge:` https: //qiskit.org/documentation/metal/, "Dokumentation" ,cls = Badge-primärer Text-weiß `
zh_tw: :link-badge:`https：//qiskit.org/metal，"Website"，cls=bads-n暗 text-white` :link-badge:`https：//qiskit.org/documentation/metal/,"Documentation "，cls=bads- primary text-white`

source: Documentation Homepage
es_un: Página de inicio de la Documentación
ml_in: ഡോക്കുമെന്റെഷൻ ഹോംപേജ്
pt_un: Página de documentação
ru_ru: Главная страница документации
sw_ke: Ukurasa wa Nyumbani wa Nyaraka

source: Frontmatter
el_gr: Πρόσοψη
es_un: Preliminares
hu_hu: Bevezető
ml_in: പ്രധാനപ്പെട്ട ഭാഗങ്ങൾ
pt_un: Índice
ru_ru: Вступление
sw_ke: Jambo la Mbele

source: Qiskit Ignis (deprecated)
es_un: Qiskit Ignis (obsoleto)
ml_in: ക്വിസ്കിറ്റ് ഇഗ്നിസ് (നിർതലാക്കി)
pt_un: Qiskit Ignis (depreciado)
ru_ru: Qiskit Ignis (устарело)
sw_ke: Qiskit Ignis (imekataliwa)

source: Qiskit Aqua (deprecated)
es_un: Qiskit Aqua (obsoleto)
sw_ke: Qiskit Aqua (imekataliwa)

source: Qiskit Aqua Migration Guide
es_un: Guía de Migración de Qiskit Aqua
ru_ru: Руководство по миграции Qiskit Aqua
sw_ke: Mwongozo wa Uhamiaji wa Qiskit Aqua

source: Qiskit is open-source software for working with quantum computers at the level of circuits, pulses, and algorithms. Additionally, several domain specific application API's exist on top of this core module.
el_gr: Το Qiskit είναι λογισμικό ανοικτού κώδικα για την εργασία με κβαντικούς υπολογιστές σε επίπεδο κυκλωμάτων, παλμών και αλγορίθμων. Επιπλέον, υπάρχουν διάφορα εξειδικευμένα API εφαρμογών πάνω από αυτό το βασικό πυρήνα.
es_un: Qiskit es un software de código abierto para trabajar con computadoras cuánticas a nivel de circuitos, pulsos y algoritmos. Además, existen varias API de aplicaciones de dominio específico además de este módulo principal.
ml_in: ക്വാണ്ടം കമ്പ്യൂട്ടിംഗ് സർക്യൂട്ടുകളും അവയുമായി ദന്ദപെട്ടിട്ടുള്ള പൾസും അൽഗോരിതങ്ങളും നിർമിക്കുനതിന്നുള്ള ഒരു ഓപ്പൺ സോഴ്സ് സോഫ്റ്റ്വെയർ ആണ് ക്വിസ്കിറ്റ്. കോർ മൊഡ്യൂൾനുപുറമെ പല​ ഡൊമെയ്ൻ നിർദ്ദിഷ്ട ആപ്ലിക്കേഷൻ API- കൾ ലഭ്യമാണ്.
pt_un: Qiskit é um software livre para trabalhar com computadores quânticos no nível de circuitos, pulsos e algoritmos. Adicionalmente, várias APIs de aplicações específicas de domínio existem em cima deste módulo principal.
ru_ru: Qiskit - это программное обеспечение с открытым исходным кодом для работы с квантовыми компьютерами на уровне схем, импульсов и алгоритмов. Также есть несколько прикладных API поверх этого базового модуля.
sw_ke: Qiskit ni programu ya chanzo wazi inayotumika kufanya kazi na tarakilishi za kwanta katika viwango vya saketi, mapigo ya mikrowevu na kanuni. Aidha, kuna API za programu-tumizi kadhaa za kikoa maalum zinazopatikana juu ya moduli hii ya msingi.
zh_tw: Qiskit 是一個開放原始碼軟體，用於在電路、脈衝和演算法的層次上使用量子計算機。 此外，多個網域特定應用程式 API 也存在於此核心模組的頂端。
