Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/install.po
Languages: bn_bn, es_mx, fr_fr, it_it, pl_pl, pt_br, ta_in, vi_vn

source: Installing Qiskit
bn_bn: Qiskit স্থাপন (ইন্সটল) করুন
es_mx: Instalación de Qiskit
fr_fr: Installation de Qiskit
it_it: Installare Qiskit
pl_pl: Instalacja Qiskit
pt_br: Instalando o Qiskit
ta_in: Qiskit நிறுவப்படுகிறது
vi_vn: Cài đặt Qiskit

source: Requirements
bn_bn: যা যা প্রয়োজন
es_mx: Requisitos
fr_fr: Exigences
it_it: Requisiti
pl_pl: Wymagania
pt_br: Requisitos
ta_in: தேவைகள்
vi_vn: Yêu cầu

source: Qiskit supports Python 3.5 or later. However, both Python and Qiskit are evolving ecosystems, and sometimes when new releases occur in one or the other, there can be problems with compatibility.
bn_bn: Qiskit ফ্রেমওয়ার্ক Python ৩.৫ বা তার পরের সংস্করণগুলোকে অনুমোদন করে। Python এবং Qiskit উভয়েই বিবর্তনশীল ব্যবস্থা। যখন এদের মধ্যে কোনো একটায় নতুন সংস্করণ আসে তখন কিছু অসামঞ্জস্যতা দেখা দিতে পারে।
es_mx: Qiskit es compatible con versiones de Python 3.5 o superior. Sin embargo, tanto Python como Qiskit son sistemas en constante evolución, por lo que cuando se lanzan nuevas actualizaciones en alguno de los dos entornos puede que ocurran problemas de compatibilidad.
fr_fr: Qiskit supporte Pyhton 3.5 ou supérieur. Cependant, Python et Qiskit sont des écosystèmes évolutifs, et parfois quand de nouvelles versions sont disponibles pour l'un ou l'autre, il peut y avoir des problèmes de compatibilité.
it_it: Qiskit richiede Python 3.5 o versioni più recenti. Tuttavia, essendo sia Python che Qiskit ecosistemi in costante evoluzione, in caso di una nuova release di uno dei due potrebbero sorgere problemi di compatibilità.
pl_pl: Qiskit obsługuje Python 3.5 lub nowszy. Zarówno Python, jak i Qiskit są ewoluującymi ekosystemami i czasami, gdy pojawiają się w nich nowe wydania, mogą występować problemy z kompatybilnością.
pt_br: O Qiskit suporta Python 3.5 ou posterior. No entanto, tanto Python, quanto Qiskit são ecossistemas em evolução e, às vezes, quando novos lançamentos ocorrem, em um ou no outro, pode haver problemas com compatibilidade.

source: If you're having trouble installing or using Qiskit after updating Python, check the `Qiskit Package metadata <https://pypi.org/project/qiskit/>`__ for **Programming Language** to see which specific versions of Python are supported.
bn_bn: Python হালনাগাদ করার পরে যদি আপনার Qiskit স্থাপন (ইন্সটল) বা ব্যবহার করতে অসুবিধা হয়, তাহলে `Qiskit প্যাকেজ মেটাডাটা <https://pypi.org/project/qiskit/>`__ -এর **Programming Language** অংশে দেখুন Python-এর কোন কোন সংস্করণ Qiskit অনুমোদন করে।
es_mx: Si tiene problemas al instalar o utilizar Qiskit después de actualizar Python, compruebe los `metadatos del paquete Qiskit <https://pypi.org/project/qiskit/>`__ en la sección de **Programming Language** para ver qué versiones específicas de Python están soportadas.
fr_fr: Si vous rencontrez des problèmes à l'installation ou l'utilisation de Qiskit après une mise à jour de Python, vérifiez les `metadata du paquet Qiskit <https://pypi.org/project/qiskit/>`__ pour **Langage de Programmation** afin de vérifier quelles versions spécifiques de Python sont supportées.
it_it: Se si riscontrano difficoltà durante l'installazione o l'utilizzo di Qiskit a seguito di un aggiornamento di Python, controllare i `metadati del pacchetto Qiskit <https://pypi.org/project/qiskit/>`__ alla voce **Programming Language** per verificare quale specifiche versioni di Python sono supportate.
pl_pl: Jeśli masz problemy z instalacją lub używaniem Qiskit po aktualizacji Pythona, sprawdź `metadane pakietów Qiskit <https://pypi.org/project/qiskit/>`__ dla **języka programowania**, aby zobaczyć, które konkretne wersje Pythona są obsługiwane.
pt_br: Se você está tendo problemas instalando ou usando o Qiskit, após atualizar o Python, verifique os metadados do pacote ` Qiskit <https://pypi.org/project/qiskit/>`__ para ** Linguagem de Programação * * para ver quais versões específicas do Python são suportadas.
ta_in: பைதான் (Python) புதுப்பிக்கப்படுவதற்கு பிறகு Qiskit யை பயன்படுத்துவதற்கு பிரச்சினை வைத்திருந்தால், ` Qiskit Package metadata <https://pypi.org/project/qiskit/>` _ _ (_ for **) நிரலாக்க மொழி * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *.

source: We recommend installing `Anaconda <https://www.anaconda.com/download/>`__, a cross-platform Python distribution for scientific computing. Jupyter, included in Anaconda, is recommended for interacting with Qiskit.
bn_bn: আমরা `অ্যানাকোন্ডা <https://www.anaconda.com/download/>`__, স্থাপন (ইন্সটল) করাকে উৎসাহিত করি যা বৈজ্ঞানিক গণনাকর্মের জন্য বিভিন্ন প্ল্যাটফর্মে ব্যবহৃত Python এর একটি ডিস্ট্রিবিউশন। Qiskit ব্যবহারের জন্য অ্যানাকোন্ডার অন্তর্ভুক্ত জুপিটার প্রস্তাব করা হয়ে থাকে।
es_mx: Recomendamos instalar `Anaconda <https://www.anaconda.com/download/>`__, una distribución de Python multiplataforma para la computación científica. Jupyter, incluido en Anaconda, es recomendado para interactuar con Qiskit.
fr_fr: Nous recommandons l'installation d'Anaconda`<https://www.anaconda.com/download/>`__, une distribution multi-plateformes Python for le calcul scientifique. Jupyter, inclus dans Anaconda, est recommandé pour l'interaction avec Qiskit.
it_it: Suggeriamo di installare `Anaconda <https://www.anaconda.com/download/>`__, una distribuzione multi-piattaforma di Python per il calcolo scientifico. Jupyter, incluso in Anaconda, è consigliato per interagire con Qiskit.
pl_pl: Zaleca się instalację ` Anaconda <https://www.anaconda.com/download/>` __, wieloplatformową dystrybucję Pythona do obliczeń naukowych. Jupyter, zawarty w pakiecie Anaconda, polecany jest do interakcji z Qiskit.
pt_br: Recomendamos a instalação do `Anaconda <https://www.anaconda.com/download/>`__, uma distribuição de Python cross-plataform para computação científica. O Jupyter, incluído no Anaconda, é recomendado para interagir com o Qiskit.
ta_in: விஞ்ஞான கம்ப்யூட்டிங்கிற்கான குறுக்கு-தளம் பைதான் விநியோகமான `அனகோண்டா <https://www.anaconda.com/download/>` __ ஐ நிறுவ பரிந்துரைக்கிறோம். அனகோண்டாவில் சேர்க்கப்பட்ட ஜூபிட்டர், கிஸ்கிட் உடன் தொடர்பு கொள்ள பரிந்துரைக்கப்படுகிறது.
vi_vn: Chúng tôi khuyên bạn nên cài đặt `Anaconda <https://www.anaconda.com/download/>`__, một phiên bản Python đa nền tảng cho các tính toán trong nghiên cứu khoa học. Anaconda đã tích hợp sẵn Jupyter (Notebook), được khuyên nên dùng để tương tác với Qiskit.

source: Qiskit is tested and supported on the following 64-bit systems:
bn_bn: Qiskit নিম্নলিখিত ৬৪ বিট ব্যবস্থাগুলোতে পরীক্ষিত এবং অনুমোদিত:
es_mx: Qiskit está probado y soportado en los siguientes sistemas de 64 bits:
fr_fr: Qiskit est testé et supporté sur les systèmes 64-bit suivants:
it_it: Qiskit è stato testato ed è supportato dai seguenti sistemi a 64-bit:
pl_pl: Qiskit jest testowany i obsługiwany na następujących 64-bitowych systemach:
pt_br: O Qiskit é testado e suportado nos seguintes sistemas 64-bit:
ta_in: பின்வரும் 64-பிட் கணினிகளில் கிஸ்கிட் சோதிக்கப்பட்டு ஆதரிக்கப்படுகிறது:
vi_vn: Qiskit đã được thử nghiệm và hỗ trợ trên các hệ thống 64-bit sau:

source: Ubuntu 16.04 or later
bn_bn: উবুন্টু ১৬.০৪ বা তার পরবর্তী সংস্করণ
es_mx: Ubuntu 16.04 o posterior
fr_fr: Ubuntu 16.04 ou supérieur
it_it: Ubuntu 16.04 o successivi
pl_pl: Ubuntu 12.04 i nowsze
pt_br: Ubuntu 16.04 ou posterior
ta_in: உபுண்டு 16.04 அல்லது பின்னர்
vi_vn: Ubuntu 16.04 trở lên

source: macOS 10.12.6 or later
bn_bn: ম্যাকওএস ১০.১২.৬ বা তার পরবর্তী সংস্করণ
es_mx: macOS 10.12.6 o posterior
fr_fr: macOS 10.12.6 ou supérieur
it_it: macOS 10.12.6 o successivi
pl_pl: macOS 10.12.6 lub nowszy
pt_br: macOS 10.12.6 ou posterior
ta_in: macOS 10.12.6 அல்லது அதற்குப் பிறகு
vi_vn: macOS 10.12.6 hoặc mới hơn

source: Windows 7 or later
bn_bn: উইন্ডোজ ৭ বা তার পরবর্তী সংস্করণ
es_mx: Windows 7 o posterior
fr_fr: Windows 7 ou supérieur
it_it: Windows 7 o successivi
pl_pl: Windows 7 lub nowszy
pt_br: Windows 7 ou superior
ta_in: விண்டோஸ் 7 அல்லது பின்னர்
vi_vn: Windows 7 hoặc mới hơn

source: Install
bn_bn: স্থাপন (ইন্সটল) করুন
es_mx: Instalación
fr_fr: Installation
it_it: Installazione
pl_pl: Instalacja
pt_br: Instalação
ta_in: நிறுவுக
vi_vn: Cài đặt

source: We recommend using Python virtual environments to cleanly separate Qiskit from other applications and improve your experience.
bn_bn: উন্নত অভিজ্ঞতা অর্জনের লক্ষ্যে, Qiskit কে অন্যান্য কার্যক্রম থেকে বিচ্ছিন্ন করে রাখার জন্য আমরা Python এর কৃত্রিম কর্মপরিবেশ (ভার্চুয়াল এনভায়রনমেন্ট) ব্যবহারের পরামর্শ দেই।
es_mx: Recomendamos utilizar entornos virtuales de Python para separar Qiskit de otras aplicaciones y mejorar su experiencia.
fr_fr: Nous recommandons d'utiliser les environnements virtuels Python pour séparer proprement Qiskit des autres applications et améliorer votre expérience.
it_it: Si consiglia di utilizzare gli ambienti virtuali di Python, per separare Qiskit da altre applicazioni e migliorare la propria esperienza di utilizzo.
pl_pl: Zalecamy używanie wirtualnych środowisk Pythona do czystego oddzielenia Qiskit od innych aplikacji.
pt_br: Recomendamos usar os ambientes virtuais do Python para separar o Qiskit de outras aplicações e melhorar sua experiência.
ta_in: பைத்தான் மெய்நிகர் சூழல்களை மற்ற பயன்பாடுகளிலிருந்து சுத்தமான Qiskit பயன்படுத்தி உங்கள் அனுபவத்தை மேம்படுத்துவது பரிந்துரைக்கிறது.
vi_vn: Chúng tôi đề nghị sử dụng môi trường Python ảo để tách Qiskit khỏi các ứng dụng khác và cải thiện trải nghiệm của bạn.

source: The simplest way to use environments is by using the ``conda`` command, included with Anaconda. A Conda environment allows you to specify a specific version of Python and set of libraries. Open a terminal window in the directory where you want to work.
bn_bn: কর্মপরিবেশগুলো (এনভায়রনমেন্ট) ব্যবহারের সবচেয়ে সহজ উপায় হচ্ছে Anaconda এর অন্তর্ভুক্ত ``conda`` নির্দেশনা ব্যবহার করা। কোন্ডার (conda) কর্মপরিবেশ (এনভায়রনমেন্ট) Python (পাইথন ) একটি নির্দিষ্ট সংস্করণ এবং এর অন্তর্ভুক্ত লাইব্রেরিগুলো ব্যবহারের অনুমতি দেয়। আপনি কাজ করতে চান এমন একটি ডিরেক্টরিতে টার্মিনাল উইন্ডো চালু করে সেখানে কাজ করতে পারেন।
es_mx: La forma más sencilla de usar los entornos es usando el comando ``conda``, incluido con Anaconda. Un entorno Conda permite especificar una versión específica de Python y un conjunto de bibliotecas. Abra una ventana de terminal en el directorio donde desea trabajar.
fr_fr: La façon la plus simple d'utiliser les environnement et en utilisant la commande ``conda``, incluse dans Anaconda. Un environnement Conda vous permet de choisir une version spécifique de Python et un jeu de librairies. Ouvrez une fenêtre de terminal dans le répertoire où vous souhaitez travailler.
it_it: Il modo migliore per utilizzare gli ambienti virtuali è tramite il comando ``conda``, incluso in Anaconda. Un ambiente Conda permette di selezionare una specifica versione di Python ed un insieme specifico di librerie. Apri una finestra del terminale nella cartella dove desideri lavorare.
pl_pl: Najprostszym sposobem na korzystanie ze środowisk jest użycie komendy ``conda`` dołączonej do Anaconda. Środowisko Conda pozwala określić konkretną wersję Pythona i zestawu bibliotek. Otwórz okno terminala w katalogu, w którym chcesz pracować.
pt_br: A maneira mais simples de usar os ambientes é usando o comando ``conda`` incluído com a Anaconda. Um ambiente Conda permite que você especifique uma versão específica do Python e conjunto de bibliotecas. Abra uma janela de terminal no diretório, onde você deseja trabalhar.
ta_in: சராசரியாக பயன்படுத்துவதற்கு எளிமையான வழி ` ` conda ` ` கட்டளையைப் பயன்படுத்தி, Anaconda (Anaconda) போன்றவை பயன்படுத்தப்படுகிறது. ஒரு காண்டா சூழல் நீங்கள் பைதான் ஒரு குறிப்பிட்ட பதிப்பு மற்றும் நூலகங்களின் அமைப்பை குறிப்பிடவும் அனுமதிக்கும். நீங்கள் வேலை வேண்டிய அடைவில் ஒரு முனைய சாளரத்தை திற.
vi_vn: Cách đơn giản nhất để sử dụng các môi trường là dụng lệnh ``conda``, nếu cài đặt Anaconda. Một môi trường Conda cho phép bạn sử dụng một phiên bản Python và các thư viện mong muốn. Mở một terminal (màn hình chạy lệnh) trong thư mục mà bạn muốn làm việc.

source: It is preferred that you use Anaconda prompt installed with the Anaconda. All you have to do is create a virtual environment inside Anaconda and activate the environment. These commands can be run in Anaconda prompt irrespective of Windows or Linux machine.
bn_bn: অ্যানাকোন্ডার সাথে যে অ্যানাকোন্ডা প্রম্পট ইন্সটল হয় সেটি ব্যবহার করা শ্রেয়। আপনাকে যা করতে হবে তা হলো, অ্যানাকোন্ডায় একটি কৃত্রিম কর্মপরিবেশ (ভার্চুয়াল এনভায়রনমেন্ট) তৈরি এবং সক্রিয় করতে হবে। উইন্ডোজ বা লিনাক্স যেকোনো অপারেটিং ব্যবস্থায় এই নির্দেশনাসমূহ চালানো যাবে।
es_mx: Es preferible que utilice el prompt de Anaconda instalado con Anaconda. Todo lo que tienes que hacer es crear un entorno virtual dentro de Anaconda y activarlo. Estos comandos se pueden ejecutar en el prompt de Anaconda independientemente de la máquina (Windows o Linux).
fr_fr: Il est préférable d'utiliser l'invite Anaconda installée avec Anaconda. Tout ce que vous avez à faire est de créer un environnement virtuel dans Anaconda et d'activer l'environnement. Ces commandes peuvent être exécutées dans l'invite Anaconda indépendamment du système d'exploitation (Windows ou Linux ou MacOS).
pl_pl: Preferowane jest użycie linii komend Anaconda zainstalowanego z Anaconda. Wszystko, co musisz zrobić, to stworzyć wirtualne środowisko wewnątrz Anaconda i aktywować środowisko. Te polecenia mogą być uruchamiane w wierszu poleceń Anaconda niezależnie od systemu Windows lub Linux.
ta_in: அயனெக்டோண்ட் நிறுவனத்துடன் உங்களிடம் பயன்படுத்த விரும்புவதாகத் தெரிவித்துள்ளது. நீங ் கள ் அனைவரும ் செய ் ய வேண ் டும ் இந்த கட்டளைகள் விண்டோஸ் அல்லது லினக்ஸ் இயந்திரம் போன்றவற்றை ஏற்றுக்கொள்ளலாம்.
vi_vn: Các bạn nên sử dụng màn hình lệnh Anaconda Prompt được cài đặt với Anaconda. Tất cả những gì bạn phải làm là tạo một môi trường ảo bên trong Anaconda và kích hoạt nó. Các lệnh này có thể chạy trong Anaconda Prompt bất kể máy Windows hoặc Linux.

source: Create a minimal environment with only Python installed in it.
bn_bn: শুধুমাত্র Python স্থাপন (install) করে একটি ঊন (minimal) কর্মপরিবেশ (এনভায়রনমেন্ট) তৈরি করুন।
es_mx: Cree un entorno mínimo que sólo tenga Python instalado en él.
fr_fr: Créez un environnement minimal avec seulement Python d'installé dedans.
it_it: Crea un ambiente minimale dove hai installato unicamente Python.
pl_pl: Utwórz minimalne środowisko tylko z zainstalowanym w nim Pythonem.
pt_br: Crie um ambiente mínimo, apenas com o Python instalado nele.
ta_in: குறைந்தபட்ச சூழலை உருவாக்குக.
vi_vn: Tạo môi trường tối giản với chỉ có Python được cài đặt.

source: Activate your new environment.
bn_bn: আপনার নতুন কর্মপরিবেশ (এনভায়রনমেন্ট) সক্রিয় করুন।
es_mx: Active el entorno.
fr_fr: Créer un nouveau environnement.
it_it: Attiva il nuovo ambiente.
pl_pl: Aktywuj nowe środowisko.
pt_br: Ative seu novo ambiente.
ta_in: உங்கள் புதிய சூழலை செயல்படுத்தவும்.
vi_vn: Kích hoạt môi trường mới của bạn.

source: If you are using conda versions prior to 4.6, use: For Linux or macOS: ``source activate name_of_my_env`` For Windows: ``activate name_of_my_env``
bn_bn: আপনি যদি কোন্ডা ৪.৬ এর পূর্ববর্তী সংস্করণ ব্যবহার করেন তাহলে লিনাক্স অথবা ম্যাকওএস ব্যবহারকারী হলে ``source activate name_of_my_env`` এবং উইন্ডোজ ব্যবহারকারী হলে ``activate name_of_my_env`` ব্যবহার করুন।
es_mx: Si está utilizando versiones conda anteriores a la 4.6, use: Para Linux o macOS: ``source activate name_of_my_env``, para Windows: ``activate name_of_my_env``
fr_fr: Si vous utilisez des versions de conda antérieures à 4.6, utilisez: Pour Linux ou macOS: ` ` source activate name_of_my_env ` ` For Windows: ` ` activate name_of_my_env ` `
it_it: Se stai utilizzando versioni di conda precedenti alla 4.6, utilizza: Su Linux o macOS: ``source activate name_of_my_env`` Su Windows: ``activate name_of_my_env``
pl_pl: W przypadku korzystania z wersji conda wcześniejszej niż 4.6, należy użyć: Dla systemu Linux lub macOS: ` ` source activate name_of_my_env ` ` Dla Windows: ` ` activate name_of_my_env ` `
pt_br: Se você está usando versões do conda anteriores a 4.6, use: Para Linux ou macOS: "source activate nome_do_meu_ambiente" Para Windows: "activate nome_do_meu_ambiente"
ta_in: நீங்கள் 4.6 க்கு முந்தைய கான்டா பதிப்புகளைப் பயன்படுத்தினால், பயன்படுத்தவும்: லினக்ஸ் அல்லது MacOS: ` ` விண்டோஸ்: ` ` விண்டோஸ்: ` ` ` ` activate name_of_my_env ` `
vi_vn: Nếu bạn đang sử dụng các phiên bản conda trước 4.6, sử dụng: Đối với Linux hoặc macOS: ``source activate name_of_my_env`` Đối với Windows: ``activate name_of_my_env``

source: Next, install the Qiskit package, which includes Terra, Aer, Ignis, and Aqua.
bn_bn: এখন টেরা, এয়ার, ইগ্নিস এবং অ্যাকোয়া সম্বলিত Qiskit প্যাকেজসমূহ স্থাপন করুন।
es_mx: A continuación, instale el paquete Qiskit, que incluye Terra, Aer, Ignis y Aqua.
fr_fr: Ensuite, installez les paquets Qiskit, qui contiennent Terra, Aer, Ignis, et Aqua.
it_it: Installa poi il pacchetto Qiskit, che include Terra, Aer, Ignis e Aqua.
pl_pl: Następnie zainstaluj pakiet Qiskit, w skład którego wchodzą Terra, Aer, Ignis i Aqua.
pt_br: Em seguida, instale o pacote Qiskit, que inclui: Terra, Aer, Ignis e Aqua.
ta_in: அடுத்து, Qiskit தொகுப்பை நிறுவி, அது டெரா, ஆர், இக்னீஸ், மற்றும் Aqua ஆகியவை அடங்கும்.
vi_vn: Tiếp theo, cài đặt Qiskit, bao gồm Terra, Aer, Ignis, và Aqua.

source: Starting with Qiskit 0.13.0 pip 19 or newer is needed to install qiskit-aer from the precompiled binary on Linux. If you do not have pip 19 installed you can run ``pip install -U pip`` to upgrade it. Without pip 19 or newer this command will attempt to install qiskit-aer from sdist (source distribution) which will try to compile aer locally under the covers.
bn_bn: Qiskit ০.১৩.০ সংস্করণ দিয়ে শুরু করতে লিনাক্স ব্যবস্থায় পূর্ব-সম্পাদিত দ্বিমিক (বাইনারি) থেকে qiskit-এয়ার স্থাপন (ইন্সটল) করার জন্য পিপ ১৯ বা তার নতুনতর সংস্করণ প্রয়োজন। আপনার যদি পিপ ১৯ স্থাপন (ইন্সটল) না করা থাকে তবে আপনি ``pip install -U pip`` নির্দেশনাটি চালিয়ে এটি স্থাপন এবং নতুনতর সংস্করণে উন্নীত করতে পারবেন। পিপ ১৯ বা নতুনতর সংস্করণ ছাড়া এই নির্দেশনাটি qiskit-এয়ার sdist (উৎস সংস্করণ) থেকে স্থাপন করার চেষ্টা করবে যা এয়ারকে আড়ালে স্থানীয়ভাবে সম্পাদন (কম্পাইল) করে।
es_mx: A partir de Qiskit 0.13.0 pip 19 o posterior se necesita para instalar qiskit-aer desde el binario precompilado en Linux. Si no tiene instalado pip 19, puede ejecutar ``pip install -U pip`` para actualizarlo. Sin pip 19 o posterior, este comando intentará instalar qiskit-aer desde sdist (distribución fuente) que intentará compilar un aer localmente de forma oculta.
fr_fr: A partir de Qiskit 0.13.0 la version 19 de pip (ou plus récente) est nécessaire pour installer qiskit-aer à partir du binaire précompilé sur Linux. Si vous n'avez pas installé la version 19 de pip, vous pouvez exécuter ``pip install -U pip`` pour le mettre à jour. Sans pip 19 (ou une version plus récente), cette commande va tenter d'installer qiskit-aer de sdist (distribution source) qui va essayer de compiler aer automatiquement.
pl_pl: Począwszy od Qiskit 0.13.0 pip 19 lub nowszy jest potrzebny, aby zainstalować qiskit-aer z prekompilowanego pliku binarnego w systemie Linux. Jeśli nie masz zainstalowanego pip 19, możesz uruchomić ` ` pip install -U pip ` `, aby go zaktualizować. Bez pip 19 lub nowszego ta komenda będzie próbował zainstalować qiskit-aer z sdist (dystrybucja źródła), które będą próbowały skompilować aer lokalnie.
ta_in: Qiskit (Qiskit) 0.13.0 pip 19 அல்லது நியூசனுடன் தொடங்கி லினக்ஸில் முந்தைய இரும எண்களில் இருந்து qiskit-aer நிறுவுவதற்கு தேவைப்படுகிறது. If you do not have pip 19 installed you can run ` ` pip install -U pip ` ` to upgrade it. பி 19 அல்லது புதியவர் இல்லாமல் இந்த கட்டளையை sdist (மூல விவரம்) இருந்து qiskit-aer நிறுவுவதற்கு முயற்சி செய்யும்.
vi_vn: Từ phiên bản Qiskit 0.13.0, cần có pip 19 hoặc mới hơn để cài đặt qiskit-aer từ file binary trên Linux. Nếu bạn chưa cài đặt pip 19, bạn có thể chạy command ``pip install -U pip`` để cài đặt nó. Nếu không có pip 19 hoặc với bản pip mới hơn, command này sẽ cài đặt qiskit-aer từ sdist (source distribution) và sdist sẽ dịch lại mã nguồn aer trên máy bạn.

source: If the packages were installed correctly, you can run ``conda list`` to see the active packages in your virtual environment.
bn_bn: যদি প্যাকেজগুলো সঠিকভাবে স্থাপন করা হয়ে থাকে তবে কৃত্রিম কর্মপরিবেশে (ভার্চুয়াল এনভায়রনমেন্টে) সক্রিয় প্যাকেজগুলো দেখার জন্য আপনি ``conda list`` নির্দেশনাটি চালাতে পারেন।
ta_in: தொகுப்புகள் சரியாக நிறுவப்பட்டிருந்தால், உங்கள் மெய்நிகர் சூழலில் உள்ள செயலில் உள்ள தொகுப்புகளை பார்க்க ` ` conda list ` ` இயக்க முடியும்.
vi_vn: Nếu các package đã được cài đặt đúng, bạn có thể chạy ``conda list`` để xem các package đang được kích hoạt trong môi trường ảo của bạn.

source: If you intend to use visualization functionality or Jupyter notebooks it is recommended to install qiskit with the visualization extra requirements
bn_bn: আপনি যদি ভিজুয়ালাইজেশন (দৃশ্যায়ন) ফাংশনালিটি অথবা জুপিটার নোটবুক ব্যবহার করতে চান তাহলে ভিজুয়ালাইজেশনের (দৃশ্যায়ন) যথোপযুক্ত শর্তগুলি (রিকোয়ারমেন্টস) সমেত qiskit স্থাপন করুন।
es_mx: Si tiene la intención de utilizar la funcionalidad de visualización o los notebooks de Jupyter, se recomienda instalar qiskit con los requisitos adicionales de visualización
fr_fr: Si vous prévoyez d'utiliser la fonctionnalité de visualisation ou Jupyter notebooks il est recommandé d'installer qiskit avec les options supplémentaires de visualisation
pl_pl: Jeśli zamierzasz korzystać z funkcji wizualizacji lub notebooków Jupyter, zaleca się zainstalować qiskit z dodatkami dla wizualizacji
ta_in: விசைப்புயிர் செயல்திறன் அல்லது ஜூப்டிர் नोட்டுக்குறிகளை பயன்படுத்த முடிவு செய்தால் விசைவு கூடுதல் தேவைகளுடன் qiskit ஐ நிறுவுவதற்கு பரிந்துரைக்கப்படுகிறது
vi_vn: Nếu bạn định sử dụng thêm chức năng hiển thị đồ họa hoặc Jupyter Notebooks, bạn cần cần cài đặt qiskit với các tính năng mở rộng về hiển thị đồ họa

source: It is worth pointing out that if you're a zsh user (which is the default shell on newer versions of macOS), you'll need to put ``qiskit[visualization]`` in quotes:
bn_bn: মনে করিয়ে দেয়া প্রয়োজন, আপনি যদি zsh (ম্যাকওএস এর নতুনতর সংস্করণগুলোতে এটি পূর্বনির্ধারিত (ডিফল্ট) শেল) ব্যবহারকারী হয়ে থাকেন তাহলে আপনাকে উদ্ধৃতির মধ্যে ``qiskit[visualization]`` লিখতে হবে:
ta_in: நீங்கள் ஒரு zsh பயனர் (இது MacOS இன் புதிய பதிப்புகளின் முன்னிருப்பு ஷெல்) என்றால், நீங்கள் ` ` qiskit[visualization]` ` ` கொடிகளில் ` ` ` qiskit [visualization] ` ` செலுத்த வேண்டும்:
vi_vn: Ngoài ra, nếu bạn sử dụng zsh (shell mặc định trên những phiên bản mới hơn của macOS), bạn cần đặt ``qiskit[visualization]`` trong dấu nháy đơn:

source: After you've installed and verified the Qiskit packages you want to use, import them into your environment with Python to begin working.
bn_bn: স্থাপিত এবং অনুমোদিত Qiskit প্যাকেজসমূহ ব্যবহার উপযোগী হওয়ার পর, কাজ শুরু করার জন্য Python কর্মপরিবেশে (এনভায়রনমেন্ট) প্যাকেজগুলো আমদানি করুন।
es_mx: Después de haber instalado y verificado los paquetes de Qiskit que quiera usar, impórtelos a su entorno con Python para comenzar a trabajar.
fr_fr: Après avoir installé et vérifié les paquets Qiskit que vous voulez utiliser, importez les dans votre environnement avec Python pour commencer à travailler.
it_it: Dopo aver installato e verificato i pacchetti di Qiskit che si desidera usare, importali nel tuo ambiente Python per iniziare a lavorare.
pl_pl: Po zainstalowaniu i zweryfikowaniu pakietów Qiskit, które mają być używane, aby rozpocząć pracę, zaimportuj je do środowiska z językiem Python.
pt_br: Depois que você instalou e verificou os pacotes Qiskit que deseja utilizar, importe-os em seu ambiente com Python para começar a trabalhar.
ta_in: நீங்கள் பயன்படுத்த விரும்பும் Qiskit தொகுப்புகளை நிறுவி மற்றும் சரிபார்க்கப்பட்ட பிறகு, பைதான் உன் சூழலுக்குள் இறக்குமதி செய்கிறது.
vi_vn: Sau khi đã cài đặt và kiểm tra đúng các gói Qiskit bạn muốn sử dụng, import (khai báo sử dụng) chúng vào môi trường của bạn với Python để bắt đầu làm việc.
