Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/install.po
Languages: bn_bn, es_mx, fr_fr, it_it, pl_pl, pt_br, ta_in, vi_vn

source: With the release of Qiskit 0.11, if you had previously saved your IBM Quantum credentials locally, you might need to update your IBM Quantum Experience credentials so that you can use the new IBM Quantum Experience V2. See `Updating your IBM Quantum Experience Credentials <https://github.com/Qiskit/qiskit-ibmq-provider/#updating-your-ibm-q-experience-credentials>`__.
pt_br: Com o lançamento do Qiskit 0,11, se você já havia salvado suas credenciais da IBM Quantum, localmente, você pode precisar atualizar suas credenciais do IBM Quantum Experience, para que você possa usar o novo IBM Quantum Experience V2. Consulte ` Atualizando as suas Credenciais do IBM Quantum Experience <https://github.com/Qiskit/qiskit-ibmq-provider/#updating-your-ibm-q-experience-credentials>` __.

source: To configure your account, you create a local configuration file which includes an API key
pt_br: Para configurar sua conta, crie um arquivo de configuração local, que contenha uma chave da API

source: Qiskit supports Python 3.6 or later. However, both Python and Qiskit are evolving ecosystems, and sometimes when new releases occur in one or the other, there can be problems with compatibility.
ta_in: பைதான் (Python) புதுப்பிக்கப்படுவதற்கு பிறகு Qiskit யை பயன்படுத்துவதற்கு பிரச்சினை வைத்திருந்தால், ` Qiskit Package metadata <https://pypi.org/project/qiskit/>` _ _ (_ for **) நிரலாக்க மொழி * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *.
vi_vn: Qiskit hỗ trợ Python từ phiên bản 3.6. Tuy nhiên, cả Python và Qiskit luôn được cập nhật, và đôi khi giữa các phiên bản sẽ có những điểm không tương thích.

source: IBM Quantum offers several real quantum computers and high-performance classical computing simulators through its IBM Quantum Lab. Follow these steps to set up your Qiskit environment to send jobs to IBM Quantum systems.
ta_in: IBM குவாண்டம் பல உண்மையான குவாண்ட்ஸ் கணினிகள் மற்றும் உயர் செயல்திறன் கணினி கணினிகளை அதன் IBM Quantum Lab வழியாக கொடுக்கிறது. IBM Quantum அமைப்புகளுக்கு பணிகளை அனுப்புவதற்கு உங்கள் Qiskit சூழல் அமைக்க இந்த நடவடிக்கையை பின்பற்றவும்.

source: **1.** `Create a free IBM Quantum account <https://quantum-computing.ibm.com/login>`__.
ta_in: ** 1. * * ` வெற்று IBM Quantum கணக்கை <https://quantum-computing.ibm.com/login>` __.
vi_vn: **1.** `Tạo tài khoản IBM Quantum miễn phí <https://quantum-computing.ibm.com/login>`__.

source: **2.** Copy your access token from the IBM Quantum dashboard.
ta_in: ** 2. * * * * படியெடுத்து உங்கள் அணுகல் டெக்டன் IBM Quantum dashboard இருந்து.
vi_vn: **2.** Sao chép token truy cập của bạn từ trang tổng quan của IBM Quantum.

source: **3.** Run the following commands to store your API token locally for later use in a configuration file called ``qiskitrc``. Replace ``MY_API_TOKEN`` with the API token value that you stored in your text editor.
ta_in: ** 3. ** `API qiskitrc`` எனப்படும் உள்ளமைவு கோப்பில் பின்னர் பயன்படுத்த உங்கள் API டோக்கனை உள்நாட்டில் சேமிக்க பின்வரும் கட்டளைகளை இயக்கவும். உங்கள் உரை திருத்தியில் நீங்கள் சேமித்த API டோக்கன் மதிப்புடன் `` MY_API_TOKEN`` ஐ மாற்றவும்.
vi_vn: **3.** Chạy các lệnh sau để lưu API token cục bộ trong tệp cấu hình được đặt tên ``qiskitrc``. Thay thế ``MY_API_TOKEN`` bằng API token mà bạn đã copy ở trên.

source: For more details, such as how to manage multiple IBM Quantum credentials, refer to this tutorial titled `The IBM Quantum Account <https://github.com/Qiskit/qiskit-tutorials/blob/master/qiskit/fundamentals/3_the_ibmq_account.ipynb>`__.
ta_in: மேலும் விவரங்களுக்காக, பல IBM Quantum credentials எப்படி நிர்ணயிக்கப்படாமல், இந்த tutorial शीर्षक ` The IBM Quantum Account <https://github.com/Qiskit/qiskit-tutorials/blob/master/qiskit/fundamentals/3_the_ibmq_account.ipynb>` __.
vi_vn: Để biết thêm chi tiết, như cách quản lí nhiều tài khoản IBM Quantum, hãy tham khảo ở đây `The IBM Quantum Account <https://github.com/Qiskit/qiskit-tutorials/blob/master/qiskit/fundamentals/3_the_ibmq_account.ipynb>`__.
