Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/install.po
Languages: bn_bn, es_mx, fr_fr, it_it, pl_pl, pt_br, ta_in, vi_vn

source: If you want to contribute to the Qiskit community by developing and contributing code with the most recently updated Qiskit code, see :ref:`Build Qiskit packages from source <install_install_from_source_label>`.
bn_bn: আপনি যদি নিয়মিত Qiskit কমিউনিটির (সংগঠন) উন্নয়ন এবং সহযোগী অংশীদার হতে চান তাহলে এটি দেখুন - :ref:`উৎস থেকে Qiskit প্যাকেজসমূহ গঠন <install_install_from_source_label>`।
es_mx: Si desea contribuir a la comunidad Qiskit desarrollando y aportando código con el código Qiskit actualizado más reciente, ver :ref:`Construir paquetes Qiskit desde la fuente <install_install_from_source_label>`.
fr_fr: Si vous voulez partiiper à la communauté Qiskit en développant ou en contribuant au code avec les plus récentes mises à jour du code Qiskit, lisez :ref:`Créer des paquets Qiskit depuis source <install_install_from_source_label>`.
it_it: Se vuoi contribuire alla comunità di Qiskit sviluppando e sottomettendo codice partendo dalla versione più recente del codice di Qiskit, guarda :ref:`Costruire pacchetti Qiskit dal sorgente <install_install_from_source_label>`.
pl_pl: Jeśli chcesz przyczynić się do rozwoju społeczności Qiskit, rozwijając i przyczyniając się do tworzenia najnowszych aktualizacji kodu Qiskit, zapoznaj się z :ref:`Zbuduj pakiety Qiskit ze źródła <install_install_from_source_label>`.
pt_br: Se você deseja contribuir com a comunidade Qiskit desenvolvendo e contribuindo com o código Qiskit mais atualizado, consulte :ref:` Construir pacotes Qiskit da fonte <install_install_from_source_label>`.
ta_in: மிகவும் அண்மையில் புதுப்பிக்கப்பட்ட Qiskit குறியீடு வளர்ச்சி மற்றும் கொள்கை குறியீடு மூலம் Qiskit சமூகத்துக்கு பங்களிப்பு விரும்பினால், :ref:` Build Qiskit தொகுப்புகளை மூலத்திலிருந்து <install_install_from_source_label>`.
vi_vn: Nếu bạn muốn đóng góp vào cộng đồng Qiskit bằng bằng việc phát triển và đưa code của mình vào Qiskit, tham khảo tại :ref:`Build Qiskit packages from source <install_install_from_source_label>`.

source: Access IBM Quantum Systems
bn_bn: আইবিএম কোয়ান্টাম ব্যবস্থায় প্রবেশ
es_mx: Acceso a los Sistemas Cuánticos de IBM
fr_fr: Accéder à des IBM Quantum Systems
it_it: Accesso ai sistemi di IBM Quantum
pl_pl: Dostęp do systemu IBM Quantum
pt_br: Acesso aos Sistemas Quantum IBM
ta_in: அணுகல் IBM Quantum Systems
vi_vn: Truy cập các hệ thống lượng tử của IBM

source: IBM Quantum offers several real quantum computers and high-performance classical computing simulators through its IBM Quantum Experience with Qiskit. Follow these steps to set up your Qiskit environment to send jobs to IBM Quantum systems.
bn_bn: Qiskit প্যাকেজ ও আইবিএম কোয়ান্টাম ব্যবস্থা দ্বারা উচ্চ ক্ষমতাসম্পন্ন ধ্রুপদী (ক্লাসিক্যাল) কম্পিউটারের মহড়া (সিমুলেটর) এবং সত্যিকারের কোয়ান্টাম কম্পিউটারের অভিজ্ঞতা পাওয়া সম্ভব। আইবিএম কোয়ান্টাম ব্যবস্থায় কর্ম (জব) সম্পাদনের জন্য Qiskit সেটআপ করতে নিম্নোক্ত ধাপগুলো অনুসরণ করুন।
es_mx: IBM Q ofrece varias computadoras cuánticas reales y simuladores informáticos clásicos de alto rendimiento a través de IBM Quantum Experience con Qiskit. Siga los siguientes pasos para configurar su entorno Qiskit para enviar trabajos a los sistemas cuánticos de IBM.
fr_fr: IBM Quantum offre l'accés à plusieurs ordinateurs quantiques réels et à des simulateurs tournants sur des ordinateurs classiques à hautes performances au travers de l'Experience IBM Quantum via Qiskit. Suivez ces étapes pour configurer votre environnement Qiskit et lancer vos tâches sur les systèmes IBM Quantum.
it_it: IBM Quantum mette a disposizione di tutti, attraverso la IBM Quantum Experience con Qiskit, sia diversi computer quantistici reali, sia simulatori di calcolo classici ad alta performance. Segui questi passaggi per configurare il tuo ambiente Qiskit e poter inviare job ai sistemi di IBM Quantum.
pt_br: A IBM Quantum oferece vários computadores quânticos e simuladores de computação clássica de alto desempenho, através do IBM Quantum Experience com o Qiskit. Siga estas etapas para configurar o seu ambiente Qiskit para enviar trabalhos para os sistemas Quantum IBM.

source: With the release of Qiskit 0.11, if you had previously saved your IBM Quantum Experience credentials locally, you might need to update them so that you can use the new IBM Quantum Experience V2. See `Updating your IBM Quantum Experience Credentials <https://github.com/Qiskit/qiskit-ibmq-provider/#updating-your-ibm-q-experience-credentials>`__.
bn_bn: আইবিএম কোয়ান্টাম অভিজ্ঞতার ক্রেডেনশিয়ালগুলো যদি আপনি পূর্বে স্থানীয়ভাবে সংরক্ষণ করে থাকেন, তবে Qiskit ০.১১ সংস্করণের ক্ষেত্রে, সেগুলো আপনার হালনাগাদ করা প্রয়োজন হতে পারে যদি আপনি আইবিএম কোয়ান্টাম অভিজ্ঞতা ভি২ (V2) ব্যবহার করতে চান। এজন্য `আইবিএম কোয়ান্টাম অভিজ্ঞতার ক্রেডেনশিয়াল হালনাগাদকরণ <https://github.com/Qiskit/qiskit-ibmq-provider/#updating-your-ibm-q-experience-credentials>`__ দেখুন।
es_mx: Con el lanzamiento de Qiskit 0.11, si previamente has guardado tus credenciales de Experiencia Quantum de IBM localmente, puede necesitar actualizarlos para que pueda utilizar la nueva IBM Quantum Experience V2. Vea `Actualizar sus credenciales de Experiencia Quantum de IBM <https://github.com/Qiskit/qiskit-ibmq-provider/#updating-your-ibm-q-experience-credentials>`__.
fr_fr: Avec la version 0.11 de Qiskit, si vous aviez sauvegardé auparavant vos identifiants IBM Quantum localement, vous pouvez faire une mise à jour de vos identifiants et ainsi les utiliser dans IBM Quantum Experience V2. Référez vous à `Updating your IBM Quantum Experience Credentials (Mise à jour de vos identifiants IBM Quantum Experience)<https://github.com/Qiskit/qiskit-ibmq-provider/#updating-your-ibm-q-experience-credentials>`__.

source: To configure your account, you will create a local configuration file which includes an API key
bn_bn: ব্যক্তিগত বিবরকটি (অ্যাকাউন্ট) কনফিগার করতে, এপিআই সংকেত সম্বলিত একটি স্থানীয় কনফিগারেশন ফাইল তৈরি করতে হবে।
es_mx: Para configurar tu cuenta, crearás un archivo de configuración local que incluye una clave API
fr_fr: Pour configurer votre compte, créez un fichier de configuration local qui contient votre clé API
pl_pl: Aby skonfigurować konto, należy utworzyć lokalny plik konfiguracyjny, który zawiera klucz API
ta_in: உங்கள் கணக்கை வடிவமைக்க, நீங்கள் ஒரு உள்ளமை வடிவமைப்பு கோப்பை உருவாக்கும் ஒரு API விசை உள்ளிடும்
vi_vn: Để cấu hình tài khoản, bạn cần tạo tập tin cấu hình cục bộ có chứa khoá API

source: **1.** `Create a free IBM Quantum Experience account <https://quantum-computing.ibm.com/login>`__.
bn_bn: **১.** `একটি আইবিএম কোয়ান্টাম অভিজ্ঞতা (এক্সপেরিয়েন্স) বিবরক (অ্যাকাউন্ট) তৈরি করুন <https://quantum-computing.ibm.com/login> `__ ।
es_mx: **1.** `Cree una cuenta gratis de IBM Quantum Experience <https://quantum-computing.ibm.com/login>`__.
fr_fr: **1.** `Créer un compte gratuit IBM Quantum Experience <https://quantum-computing.ibm.com/login>`__.
it_it: **1.** `Crea un account gratuito sulla IBM Quantum Experience <https://quantum-computing.ibm.com/login>`__.
pl_pl: **1.** `Utwórz darmowe konto IBM Quantum Experience <https://quantum-computing.ibm.com/login>`__.
pt_br: ** 1. * * ` Crie uma conta gratuita da IBM Quantum Experience <https://quantum-computing.ibm.com/login>` __.

source: **2.** Navigate to **My Account** to view your account settings.
bn_bn: **২.** ব্যক্তিগত বিবরকটি যাচাইয়ের জন্য **আমার অ্যাকাউন্ট** এ যান।
es_mx: **2.** Navegue hasta **Mi Cuenta** para ver la configuración de su cuenta.
fr_fr: **2.** Naviguez dans **Mon compte** pour voir les réglages de votre compte.
it_it: **2.** Naviga fino a **My Account** per vedere le impostazioni del tuo account.
pl_pl: **2.** Przejdź do **Moje konto**, aby zobaczyć ustawienia konta.
pt_br: **2.** Navegue até **Minha conta** para ver suas configurações de conta.

source: **3.** Click on **Copy token** to copy the token to your clipboard. Temporarily paste this API token into your favorite text editor so you can use it later to create an account configuration file.
bn_bn: **৩.** কুপন (টোকেন) অনুলিপির জন্য **Copy token** চাপুন। পরবর্তীতে ব্যক্তিগত বিবরকটি (account) কনফিগারেশনের জন্য অনুলিপিকৃত এপিআই কুপনটি নিজের প্রিয় লিখন সম্পাদকে (টেক্সট এডিটর) সাময়িকভাবে পেস্ট করুন।
es_mx: **3.** Haga clic en **Copy Token** para copiar el token en su portapapeles. Pegue temporalmente este token de la API en su editor de texto favorito para que pueda usarlo más tarde para crear un archivo de configuración de cuenta.
fr_fr: **3.** Cliquez sur **Copier le jeton** pour copier le jeton dans votre presse-papier. Coller temporairement votre jeton API dans votre éditeur de texte favori pour l'utiliser de façon ultérieure pour créer le fichier de configuration de votre compte.
it_it: **3.** Clicca su **Copy token** per copiare il token API nei tuoi appunti. Incollalo temporaneamente nell'editor di testo che usi di solito, sarà necessario utilizzarlo nel passaggio successivo per la creazione del file locale di configurazione relativo al tuo account.
pl_pl: **3.** Kliknij **Skopiuj token** aby skopiować token do schowka. Tymczasowo wklej ten token API do swojego ulubionego edytora tekstu, dzięki czemu możesz go później użyć, aby utworzyć plik konfiguracyjny konta.
pt_br: **3.** Clique em **Copiar token** para copiar o token para a área de transferência. Cole, temporariamente, este token de API no seu editor de texto favorito, para que você possa usá-lo mais tarde, para criar um arquivo de configuração da conta.

source: **4.** Run the following commands to store your API token locally for later use in a configuration file called ``qiskitrc``. Replace ``MY_API_TOKEN`` with the API token value that you stored in your text editor.
bn_bn: **৪.** এপিআই কুপনটি স্থানীয়ভাবে ``qiskitrc`` নামক কনফিগারেশন ফাইলে পরবর্তীতে ব্যবহারের জন্য সংরক্ষণ করতে নিচের নির্দেশনাগুলো কার্যকর করুন। আপনার টেক্সট এডিটরে সংরক্ষিত এপিআই টোকেনটি দিয়ে ``MY_API_TOKEN`` কে প্রতিস্থাপন করে দিন।
es_mx: **4.** Ejecute los siguientes comandos para almacenar su token de API localmente para su uso posterior en un archivo de configuración llamado ``qiskitrc``. Sustituya ``MY_API_TOKEN`` por el valor del token de API que guardó en su editor de texto.
fr_fr: **4.** Lancez les commandes suivantes pour archiver votre jeton API localement pour une utilisation ultérieure dans votre fichier de configuration appelé `qiskitrc``. Remplacez ``MY_API_TOKEN`` par la valeur du jeton API stockée dans votre éditeur de texte.
it_it: **4.** Esegui i seguenti comandi per salvare il tuo token API localmente e poterlo successivamente utilizzare nel file di configurazione chiamato ``qiskitrc``. Sostituisci ``MY_API_TOKEN`` con il token API che hai salvato nel tuo editor di testo.
pl_pl: **4.** Uruchom następujące polecenia, aby przechowywać swój token API lokalnie do późniejszego użycia w pliku konfiguracyjnym o nazwie ``qiskitrc``. Zastąp ``MY_API_TOKEN`` wartością tokenu API, którą zapisałeś w edytorze tekstowym.
pt_br: **4.** Execute os seguintes comandos para armazenar o seu token de API localmente para uso posterior em um arquivo de configuração chamado ``qiskitrc``. Substitua ``MY_API_TOKEN`` pelo valor do token de API que você armazenou no seu editor de texto.

source: For more details, such as how to manage multiple IBM Quantum account credentials, refer to this tutorial titled `The IBM Quantum Account <https://github.com/Qiskit/qiskit-tutorials/blob/master/qiskit/fundamentals/3_the_ibmq_account.ipynb>`__.
bn_bn: আরো তথ্য যেমন কীভাবে একাধিক আইবিএম কোয়ান্টাম বিবরক (অ্যাকাউন্ট) পরিচালনা করা যায়, জানার জন্য `The IBM Quantum Account <https://github.com/Qiskit/qiskit-tutorials/blob/master/qiskit/fundamentals/3_the_ibmq_account.ipynb>`__ শিরোনামের এই নির্দেশিকা অনুসরণ করুন।
es_mx: Para obtener más detalles, como por ejemplo cómo gestionar las credenciales de varias cuentas de IBM Quantum, consulte este tutorial llamado ` La cuenta de IBM Quantum <https://github.com/Qiskit/qiskit-tutorials/blob/master/qiskit/fundamentals/3_the_ibmq_account.ipynb>`__.
fr_fr: Pour plus de détails, tels que comment gérer des identifiants de compte IBM Quantum multiples, référez vous au guide `The IBM Quantum Account (Le compte IBM Quantum)<https://github.com/Qiskit/qiskit-tutorials/blob/master/qiskit/fundamentals/3_the_ibmq_account.ipynb>`__.
it_it: Per maggiori dettagli, ad esempio su come gestire le credenziali di diversi account di IBM Quantum, fare riferimento a questo tutorial chiamato `The IBM Quantum Account <https://github.com/Qiskit/qiskit-tutorials/blob/master/qiskit/fundamentals/3_the_ibmq_account.ipynb>`__.
pt_br: Para mais detalhes, sobre como gerenciar várias credenciais da conta IBM Quantum, consulte o tutorial intitulado `A Conta IBM Quantum <https://github.com/Qiskit/qiskit-tutorials/blob/master/qiskit/fundamentals/3_the_ibmq_account.ipynb>`__.

source: Checking Which Version is Installed
bn_bn: সংস্করণ যাচাইকরণ
es_mx: Verificando la versión instalada
fr_fr: Vérification de la version installée
it_it: Verifica della Versione Installata
pl_pl: Sprawdzenie zainstalowanej wersji
pt_br: Verificando Qual Versão está Instalada
ta_in: எந்த பதிப்பு நிறுவப்பட்டதுName
vi_vn: Kiểm tra phiên bản nào được cài đặt

source: Since the Qiskit package includes a constellation of different elements, simply printing the version by running ``qiskit.__version__`` can be misleading as it returns only the version for the ``qiskit-terra`` package. This is because the ``qiskit`` namespace in Python doesn't come from the Qiskit package, but instead is part of the ``qiskit-terra`` package.
bn_bn: যেহেতু, Qiskit প্যাকেজের মধ্যে বিভিন্নধরণের উপকরণ সন্নিবিষ্ট আছে, সেহেতু, Qiskit-এর সংস্করণ জানার জন্য শুধু ``qiskit.__version__`` নির্দেশনাটি চালানো বিভ্রান্তির সৃষ্টি করতে পারে। কারণ, এটি শুধু ``qiskit-terra`` প্যাকেজের সংস্করণ জানায়। এর কারণ হচ্ছে Python-এ ``qiskit`` নেমস্পেস Qiskit প্যাকেজ থেকে আসেনা, বরং ``qiskit-terra`` প্যাকেজ থেকে আসে।
es_mx: Teniendo en cuenta que el paquete de Qiskit incluye una constelación de diferentes elementos, sólo con imprimir la versión ejecutando ``qiskit.__version__`` puede llevar a confusión porque sólo devuelve la versión del paquete de ``qiskit-terra``. Esto es porque el espacio de nombres de ``qiskit`` en Python no viene del paquete de Qiskit sino que es parte del paquete de ``qiskit-terra``.
fr_fr: Comme le paquet Qiskit contient une myriade de différents élément, afficher simplement la version en lançant la commande ``qiskit.__version__`` peut être déroutant car il retournera seulement la version du paquet ```qiskit-terra``. Ceci parce que le mot ``qiskit`` dans la commande Python ne vient pas du paquet Qiskit mais du paquet ``qiskit-terra``.
it_it: Dato che il pacchetto Qiskit include un insieme di diversi elementi, visualizzare la versione eseguendo il comando ``qiskit.__version__`` può causare confusione, poichè il risultato riporta unicamente la versione del pacchetto ``qiskit-terra``. Questo accade in quanto il namespace ``qiskit`` in Python non deriva dal pacchetto Qiskit, ma fa invece parte del pacchetto ``qiskit-terra``.
pl_pl: Ponieważ pakiet Qiskit składa się z wielu elementów, proste wyświetlenie wersji używając ``qiskit.__version__`` może wprowadzać w błąd, ponieważ instrukcja zwraca tylko wersję pakietu ``qiskit-terra``. Dzieje się tak, ponieważ przestrzeń nazw ``qiskit`` w Pythonie nie pochodzi z pakietu Qiskit, a zamiast tego jest częścią pakietu ``qiskit-terra``.
pt_br: Uma vez que o pacote Qiskit inclui uma constelação de elementos diferentes, simplesmente obtendo a versão executando ``qiskit.__version__`` pode ser enganoso, pois retorna, apenas, a versão do pacote ``qiskit-terra``. Isto porque o namespace ``qiskit`` em Python não vem do pacote Qiskit, mas, em vez disto, faz parte do pacote ``qiskit-terra``.
ta_in: Qiskit தொகுப்பு வெவ்வேறு தனிமங்களின் ஒரு விண்மீன் கூட்டத்தை உள்ளடக்கி ` ` qiskit.__version__` ` ` qiskit-terra ` ` தொகுப்புக்கான பதிப்பை மட்டும் காட்டும் என மதிப்பீடு செய்யலாம். இது ` ` qiskit ` ` namespace in Python இன் Qiskit தொகுப்பில் இருந்து வரவில்லை, ஆனால் அதற்கு பதிலாக ` ` qiskit-terra ` ` தொகுப்பின் ஒரு பகுதியாக உள்ளது.
vi_vn: Vì gói Qiskit chứa nhiều thành phần khác nhau, lệnh in ``qiskit.__version__`` có thể gây hiểu nhầm khi nó chỉ trả về phiên bản cho gói ``qiskit-terra``. Điều này là vì namespace ``qiskit`` trong Python không xuất phát từ gói Qiskit, mà thay vào đó là một phần của gói ``qiskit-terra``.

source: To see the versions of all the Qiskit elements in your environment you can use the ``__qiskit_version__`` attribute. For example, running the following command will return a dictionary that includes the versions for each of the installed Qiskit packages.
bn_bn: আপনার তৈরিকৃত কর্মপরিবেশে সকল Qiskit উপাদানসমূহের সংস্করণ জানতে আপনি ``__qiskit_version__`` এই নির্দেশনাটি ব্যবহার করতে পারেন। উদাহরণসরূপ, নিচের নির্দেশনাটি চালনা করলে এটি আপনাকে একটি অভিধান (ডিকশনারি) ফেরত দিবে যাতে আপনার স্থাপিত (ইন্সটলকৃত) সকল প্যাকেজের সংস্করণ উল্লেখ করা থাকবে।
es_mx: Para ver las versiones de todos los elementos de Qiskit en su entorno puede utilizar el atributo ``__qiskit_version__``. Por ejemplo, al ejecutar el siguiente comando se obtendrá un diccionario que incluye las versiones para cada uno de los paquetes Qiskit instalados.
fr_fr: Pour visualiser les versions de tous les éléments Qiskit de votre environnement, vous pouvez utiliser l'attribut ``__qiskit_version__``. Par exemple, en lançant la commande suivante vous obtiendrez un dictionnaire qui contient les versions de tous les paquets Qiskit installés.
it_it: Per ottenere le versioni di tutti gli elementi di Qiskit installati nel tuo ambiente puoi usare l'attributo ``__qiskit_version__``. Ad esempio, eseguendo il seguente comando si ottiene un dizionario che include le versioni per ciascuno dei pacchetti Qiskit installati.
pl_pl: Aby zobaczyć wersje wszystkich elementów Qiskit w danym środowisku, można użyć atrybutu ` `__qiskit_version__` `. Przykładowo uruchomienie następującej komendy spowoduje wyświetlenie słownika, który zawiera wersje dla każdego z zainstalowanych pakietów Qiskit.
pt_br: Para ver as versões de todos os elementos Qiskit, em seu ambiente, você pode utilizar o atributo ` `__qiskit_version__` ` ` `. Por exemplo, executar o comando, a seguir, retornará um dicionário, que inclui as versões para cada um dos pacotes Qiskit instalados.
ta_in: உங்கள் சூழலின் அனைத்து Qiskit தனிமங்களின் பதிப்புகளை பார்க்க நீங்கள் ` `__qiskit_version__` ` பண்பாடு பயன்படுத்த முடியும். எடுத்துக்காட்டாக, கீழ்காணும் கட்டளையை இயங்கும் ஒரு அகராதியை திரும்ப திரும்ப செய்யும் ஒவ்வொரு நிறுவப்பட்ட Qiskit தொகுப்புகளுக்கான பதிப்புகளையும் உள்ளடக்குகிறது.
vi_vn: Để xem phiên bản của tất cả các thành phần của Qiskit trong môi trường cá nhâ, bạn có thể sử dụng thuộc tính ``__qiskit_version__``. Ví dụ, chạy lệnh sau sẽ trả lại một từ điển bao gồm các phiên bản cho mỗi thành phần đã cài đặt của Qiskit.

source: If you're filing an issue or need to share your installed Qiskit versions for something, use the ``__qiskit_version__`` attribute.
bn_bn: আপনি যদি কোনো সমস্যা লিপিবদ্ধ করতে চান বা স্থাপনকৃত Qiskit এর সংস্করণগুলো কোনো কিছুর জন্য আদানপ্রদান করা প্রয়োজন হয় তবে ``__qiskit_version__`` নির্দেশনাটি ব্যবহার করুন।
es_mx: Si está registrando un problema o necesita compartir sus versiones instaladas de Qiskit para algo, use el atributo ``__qiskit_version__``.
fr_fr: Si vous documentez un problème ou avez besoin de partager les versions de Qiskit pour n'importe quelle raison, utilisez l'attribut ``__qiskit_version__``.
it_it: Se stai riportando una issue o hai bisogno di condividere la versione di Qiskit che hai installato, puoi utilizzare l'attributo ``__qiskit_version__``.
pl_pl: Jeśli zgłaszasz problem lub musisz udostępnić informacje o zainstalowanej wersji Qiskit, użyj atrybutu ``__qiskit_version__```.
pt_br: Se você está registrando um problema ou precisando compartilhar as versões do Qiskit instaladas para algum propósito, use o atributo ``__qiskit_version__``.
ta_in: நீங்கள் ஒரு விஷயத்தை உள்ளிட்டால் அல்லது உங்கள் நிறுவப்பட்ட Qiskit பதிப்புகளை ஏதாவது பகிர்ந்தால், ` `__qiskit_version__` ` குணம் பயன்படுத்தவும்.
vi_vn: Nếu bạn đang phản hồi một vấn đề gặp phải, hoặc cần chia sẻ phiên bản Qiskit đã cài đặt cho một mục đích nào đó, sử dụng thuộc tính ``__qiskit_version__``.

source: If the packages installed correctly, you can run ``conda list`` to see the active packages in your virtual environment.
es_mx: Si los paquetes se han instalado correctamente, puede ejecutar ``conda list``para ver los paquetes que están activos en su entorno virtual.
fr_fr: Si les paquets sont installés correctement, vous pouvez lancer ``conda list`` pour voir les paquets actifs de votre environnement virtuel.
pl_pl: Jeśli pakiety zostały zainstalowane poprawnie, możesz uruchomić ``conda list`` aby zobaczyć listę aktywnych pakietów w Twoim wirtualnym środowisku.
pt_br: Se os pacotes instalaram corretamente, você pode executar ` ` conda list ` ` para ver os pacotes ativos em seu ambiente virtual.

source: It is worth point at if you're a zsh user (which is the default shell on newer versions of macOS) you'll need to put ``qiskit[visualization]`` in quotes:
es_mx: Vale la pena señalar que si eres un usuario zsh (que es el shell predeterminado en nuevas versiones de macOS) necesitará poner ``qiskit[visualization]`` con comillas:
fr_fr: Il est utile de préciser que si vous êtes un utilisateur de zsh (qui est le shell par défaut dans les nouvelles versions de macOS) que vous devrez mettre ``qiskit[visualization]`` entre quotes:
pl_pl: Warto zwrócić uwagę na to, że jeśli jesteś użytkownikiem zsh (który jest domyślną powłoką w nowszych wersjach macOS), musisz umieścić ` ` qiskit[visualization]` ` w cudzysłowach:
pt_br: Vale a pena ressaltar que se você é um usuário zsh (que é o shell padrão em versões mais recentes do macOS), você vai precisar colocar ` ` qiskit[visualization]` ` entre aspas:

source: It is preferred that you use Anaconda prompt installed with the Anaconda. All you have to do is create a virtual environment inside Anaconda and activate the environment. These commands can be run in Anaconda prompt irrespective of Windows or linux machine.
pt_br: É preferível que você use o prompt Anaconda instalado com a Anaconda. Tudo o que você tem que fazer é criar um ambiente virtual, dentro da Anaconda, e ativar esse ambiente. Estes comandos podem ser executados no prompt Anaconda, independentemente, de ser uma máquina Windows ou linux.

source: Starting with Qiskit 0.13.0 pip 19 or newer is needed to install qiskit-aer from precompiled binary on Linux. If you do not have pip 19 installed you can run ``pip install -U pip`` to upgrade it. Without pip 19 or newer this command will attempt to install qiskit-aer from sdist (source distribution) which will try to compile aer locally under the covers.
pt_br: A partir do Qiskit 0.13.0 pip, versão 19 ou mais recente, é necessário instalar o qiskit-aer, a partir do binário pré-compilado no Linux. Se você não tiver o pip 19 instalado, você pode executar ``pip install -U pip`` para atualizá-lo. Sem o pip 19 ou um mais novo, este comando tentará instalar o qiskit-aer do sdist (distribuição de origem), que tentará compilar o aer localmente sem evidenciá-lo.

source: If you intend to use visualization functionality or jupyter notebooks it is recommended to install qiskit with the visualization extra requirements
pt_br: Se você pretende usar funcionalidades de visualização ou notebooks jupyter, é recomendado instalar o qiskit com os requisitos extras de visualização
