Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/intro_tutorial1.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, ja_jp, ko_kr, ml_in, pl_pl, pt_br, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_cn, zh_tw

source: `Textbook: Learn Quantum Computing using Qiskit <https://qiskit.org/textbook>`_
bn_bn: `টেক্সটবুকঃ Qiskit ব্যবহার করে কোয়ান্টাম কম্পিউটিং শেখা <https://qiskit.org/textbook>`__
de_de: `Lehrbuch: Quantumt-Computing mit Qiskit lernen<https://community.qiskit.org/textbook/preface>`__
el_gr: `Βιβλίο: Learn Quantum Computing using Qiskit <https://qiskit.org/textbook>`_
es_un: `Libro de texto: Aprende Computación Cuántica usando Qiskit <https://qiskit.org/textbook>`_
fr_fr: `Le Textbook : Apprendre le Calcul Quantique avec Qiskit<https://qiskit.org/textbook>`__
ja_jp: `Textbook: Qiskit を使った量子計算の学習 <https://community.qiskit.org/textbook/preface>`__
ko_kr: `교과서: Qiskit 으로 양자 컴퓨팅 배우기 <https://qiskit.org/textbook>`_
ml_in: `പാഠപുസ്തകം:ക്വിസ്കിറ്റ് ഉപയോഗിച്ച് ക്വാണ്ടം കമ്പ്യൂട്ടിംഗ് പഠിക്കാം<https://qiskit.org/textbook>`_
pl_pl: ` Podręcznik: Nauka obliczeń kwantowych z wykorzystaniem Qiskit <https://community.qiskit.org/textbook/preface>` __
pt_br: `Livro Didático: Aprenda Computação Quântica usando Qiskit <https://qiskit.org/textbook>`_
pt_un: `Livro-texto: Learn Quantum Computing using Qiskit <https://qiskit.org/textbook>`_
sw_ke: `Kitabu: Jifunze Utarakilishi wa kwanta ukitumia Qiskit <https://qiskit.org/textbook>`_
vi_vn: `Sách: Học Tính toán Lượng tử sử dụng Qiskit <https://qiskit.org/textbook>`_
zh_cn: `官方教程：使用 Qiskit 学习量子计算 <https://qiskit.org/textbook>`_

source: Qiskit Aer is a high performance simulator framework for quantum circuits. It provides `several backends <apidoc/providers/aer/aer_backends.html>`__ to achieve different simulation goals.
fr_fr: Le module Aer de Qiskit fournit un environnement performant pour l'émulation de circuits quantiques. Il fournit la possibilité de travailler avec `plusieurs plateformes <apidoc/providers/aer/aer_backends.html>`__ selon les objectifs poursuivis.
ko_kr: Qiskit Aer 는 양자 회로를 위한 고성능 시뮬레이터 프레임워크이다. 이는 다양한 시뮬레이션 목표를 이루기 위해 `여러 백엔드들을 <apidoc/providers/aer/aer_backends.html>`__ 제공한다.
pt_br: O Qiskit Aer é um framework de simulador de alto desempenho para circuitos quânticos. Ele fornece `vários serviços <apidoc/providers/aer/aer_backends.html>`__ para alcançar diferentes objetivos de simulação.
sw_ke: Qiskit Aer ni mfumo wa utendaji wa juu wa mtambo ya kuiga kwa saketi za kwanta. Inatoa `backends kadhaa <apidoc/providers/aer/aer_backends.html>`__ kufikia malengo tofauti ya uigaji.

source: Try changing the ``shots`` keyword in the ``execute`` method to see how the estimated probabilities change.
ko_kr: ``execute`` 함수의 ``shots`` 인수를 바꿔서 입력해 보면 예측되는 확률들이 어떻게 바뀌는지 알아볼 수 있다.
pt_br: Tente alterar o valor de ``shots`` no método ``execute`` para ver como as probabilidades estimadas mudam.

source: ``QuantumCircuit.measure([0,1], [0,1])``: if you pass the entire quantum and classical registers to ``measure``, the ith qubitâ€™s measurement result will be stored in the ith classical bit.
sw_ke: ``QuantumCircuit.measure([0,1], [0,1])``: ukipitisha rejista zote za kwanta na za kiklasiki kwa ``measure``, matokeo ya qubit ya `i` yatahifadhiwa katika tarakimu jozi ya `i` ya kiklasiki.
