Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/intro_tutorial1.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, ja_jp, ko_kr, ml_in, pl_pl, pt_br, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_cn, zh_tw

source: ``plot_histogram``: creates histograms.
bn_bn: ``plot_histogram``: আয়তলেখ (হিস্টোগ্রাম) তৈরি করে।
de_de: ` ` plot_histogram ` `: erzeugt Histogramme.
el_gr: ``plot_histogram``: δημιουργεί ιστογράμματα.
es_un: ``plot_histogram``: crea histogramas.
fr_fr: ``plot_histogram``: pour créer des histogrammes.
ja_jp: ``plot_histogram`` : ヒストグラムを作成します。
ko_kr: ``plot_histogram``: 히스토그램을 생성한다.
ml_in: ``plot_histogram``: ഹിസ്റ്റോഗ്രാം ഉപയോഗിക്കുന്നതിന് ആവശ്യമായ പാക്കേജ്.
pl_pl: ``plot_histogram``: tworzy histogramy.
pt_br: ``plot_histogram``: cria histogramas.
pt_un: ``plot_histogram``: cria histogramas.
ru_ru: ``plot_histogram`` создает гистограммы.
sw_ke: ``plot_histogram``: hutengeneza histogramu.
ta_in: ``plot_histogram``: ஹிஸ்டோகிராம்களை உருவாக்குகிறது.
te_in: ``plot_histogram``: హిస్టోగ్రామ్‌లను సృష్టిస్తుంది.
tr_tr: ``plot_histogram``: histogramlar oluşturur.
vi_vn: ``plot_histogram``: hiển thị biểu đồ.
zh_cn: ``plot_histogram`` ：创建直方图。
zh_tw: ``plot_histrgram``：建立直方圖。

source: Step 2 : Initialize Variables
bn_bn: দ্বিতীয় ধাপঃ চলরাশির প্রাথমিক মান নিযুক্ত করা
de_de: Schritt 2: Variablen initialisieren
el_gr: Βήμα 2: Αρχικοποίηση Μεταβλητών
es_un: Paso 2 : Inicializar Variables
fr_fr: Etape 2 : Initialisation des Variables
ja_jp: ステップ2：変数の初期化
ko_kr: 2단계: 변수 초기화하기
pl_pl: Krok 2: Inicjalizacja zmiennych
pt_br: Etapa 2: Inicializar Variáveis
pt_un: Passo 2: Inicializar variáveis
ru_ru: Шаг 2: Инициализация переменных
sw_ke: Hatua ya 2 : Anzilisha Vigezo
ta_in: படி 2: மாறிகளை துவக்கவும்
te_in: Step 2: వేరియబుల్స్ తెలియజేయుట
tr_tr: Adım 2: Değişkenlere İlk Değerlerini Atama
vi_vn: Bước 2 : Khởi tạo các biến
zh_cn: 步骤 2 ：初始化变量
zh_tw: 步驟 2 ：起始設定變數

source: Consider the next line of code
bn_bn: কোডের পরবর্তী লাইনটি বিবেচনা করুন
de_de: Betrachten Sie die nächste Codezeile
el_gr: Εξετάστε την επόμενη γραμμή κώδικα
es_un: Considera la siguiente línea de código
fr_fr: La ligne de code suivante
ja_jp: 次のコードを考えてみます。
ko_kr: 다음 코드의 줄을 보자
ml_in: ഉദാഹരണത്തിന്
pt_br: Considere a seguinte linha do código
pt_un: Considere a linha de código a seguir:
ru_ru: Рассмотрим следующую строку кода
sw_ke: Zingatia mstari ufuatao wa msimbo
ta_in: Codeயின் அடுத்த வரியைக் கவனியுங்கள்
te_in: కోడ్ యొక్క తదుపరి లైన్ ని పరిగణించండి
tr_tr: Aşağıdaki kod satırına bakalım
vi_vn: Xem xét dòng code tiếp theo
zh_cn: 仔细观察下面一行代码
zh_tw: 考慮下一行的程式碼

source: Here, you are initializing with 2 qubits in the zero state; with 2 classical bits set to zero; and ``circuit`` is the quantum circuit.
bn_bn: এখানে আপনি ২টি কিউবিটের প্রাথমিক মান শূন্য অবস্থায় নিযুক্ত করছেন; সঙ্গে ২টি ধ্রুপদী (ক্লাসিক্যাল) বিট কে শূন্য দিয়ে নিযুক্ত করছেন; এবং ``circuit`` টি হল কোয়ান্টাম বর্তনী (সার্কিট)।
de_de: Hier wird ein Quantenschaltkreis ``circuit`` definiert, bestehend aus zwei Qubits im Basiszustand 0 und zwei auf 0 gesetzten klassischen Bits.
el_gr: Εδώ, αρχικοποιείτε με 2 qubits σε μηδενική κατάσταση; με 2 κλασικά bits με μηδέν; και ``circuit`` είναι το κβαντικό κύκλωμα.
es_un: Aquí, estás inicializando con 2 qubits en el estado cero; con 2 bits clásicos puestos en cero; y ``circuit`` es el circuito cuántico.
fr_fr: A pour effet d'initialiser le circuit représenté par la variable ``circuit`` avec deux qubits à l'état initial 0, et deux bits classiques avec la valeur 0.
ja_jp: ここでは、二つの量子ビットをゼロの状態に、二つの古典ビットをゼロに初期化し、量子回路 ``circuit`` に代入しています。
ko_kr: 여기 2개의 큐비트를 0 상태로 초기화하고, 2개의 고전적인 비트를 0으로 초기화 하는 경우를 생각해 보자. ``circuit`` 은 양자 회로를 말한다.
ml_in: ഇവിടെ, നിങ്ങൾ 0 സ്റ്റേയ്റ്റ്ലുള്ള​ 2 ക്വിബിറ്റും 2 ക്ലാസിക്കൽ ബിറ്റും അടങ്ങിയിരിക്കുന്ന ഒരു ക്വാണ്ടം സർക്യൂട്ട് ``circuit`` എന്ന പേരിൽ ഇനിഷ്യലയ്സ് ചെയ്യുന്നു.
pl_pl: Inicjalizujemy tu dwa kubity oraz dwa klasyczne bity w stanie zero; a``circuit`` jest obwodem kwantowym.
pt_br: Aqui, você está inicializando com 2 qubits no estado zero; com 2 bits clássicos definidos como zero; e ``circuit`` é o circuito quântico.
pt_un: Aqui, você inicializa com 2 qubits no estado zero; com 2 bits clássicos definidos para zero; e `` circuito`` é o circuito quântico.
ru_ru: Здесь вы запускаете квантовую цепь с 2 кубитами в начальном нулевом состоянии и 2 классическими битами равными нулю; ``circuit`` — квантовая цепь.
sw_ke: Hapa, unaanzilisha na qubits mbili katika hali ya sufuri; ukiwa na tarakimu jozi mbili za kiklasiki zimewekwa sifuri; na ``circuit`` ndio saketi ya kwanta.
ta_in: இங்கே, நீங்கள் பூஜ்ஜிய நிலையில் 2 க்யூபிட்களுடன் துவக்குகிறீர்கள்; 2 கிளாசிக்கல் பிட்கள் பூஜ்ஜியமாக அமைக்கப்பட்டுள்ளது; மற்றும் ``சர்க்யூட்`` என்பது குவாண்டம் சர்க்யூட்கள் ஆகும்.
te_in: ఇక్కడ, మీరు 2 క్కుబిట్లని సున్నా స్టేట్లో ప్రారంభిస్తున్నారు; 2 క్లాసికల్ బిట్‌లు సున్నాకి సెట్ చేయబడతాయి; మరియు ``circuit` అనేది క్వాంటం సర్క్యూట్.
tr_tr: Burada sıfır durumunda 2 kübit ve sıfır atanmış iki klasik bitle başlıyorsunuz; ``circuit`` ise kuantum devreniz.
vi_vn: Ở dòng này, bạn khởi tạo 2 qubit với trạng thái 0; với 2 bit cổ điển cũng đặt giá trị 0; và ``mạch`` có nghĩa là mạch lượng tử.
zh_cn: 在这里，您将在零状态下初始化 2 个量子位; 将 2 个经典位设置为零；``circuit`` 是量子电路。
zh_tw: 在這裡，您正在起始設定2個狀態為零的量子化元 ；其中 2 個經典位元設為零；而 ``circuit`` 則是量子電路。

source: Syntax:
bn_bn: সিনট্যাক্স বা গঠনঃ
el_gr: Σύνταξη:
es_un: Sintaxis:
fr_fr: Syntaxe :
ja_jp: 構文：
ko_kr: 구문:
ml_in: സിന്റാക്സ്:
pl_pl: Składnia:
pt_br: Sintaxe:
pt_un: Sintaxe:
ru_ru: Синтаксис:
sw_ke: Sintaksi:
ta_in: சொற்றொடரியல்:
te_in: సింటాక్స్ (వాక్యనిర్మాణం):
tr_tr: Sözdizimi:
vi_vn: Cú pháp:
zh_cn: 语法：
zh_tw: 語法：

source: Step 3 : Add Gates
bn_bn: তৃতীয় ধাপঃ যুক্তিবর্তনী (গেইট) যুক্ত করা
de_de: Schritt 3 : Gates hinzufügen
el_gr: Βήμα 3: Προσθήκη Πυλών
es_un: Paso 3 : Agregar Compuertas
fr_fr: Etape 3 : Ajout de portes quantiques
ja_jp: ステップ3：ゲートの追加
ko_kr: 3단계: 게이트 추가하기
pl_pl: Krok 3: Dodawanie bramek
pt_br: Etapa 3: Adicionar Portas
pt_un: Passo 3: Adicionar portas
ru_ru: Шаг 3: Применение вентилей
sw_ke: Hatua ya 3 : Ongezea Milango
ta_in: படி 3 : கேட்களை சேர்
te_in: Step 3: గేట్స్ ను జతచేయుట
tr_tr: Adım 3: Kapılar Ekle
vi_vn: Bước 3: Thêm cổng
zh_cn: 步骤 3 ：添加门（操作）
zh_tw: 步驟 3 ：新增閘道

source: You can add gates (operations) to manipulate the registers of your circuit.
bn_bn: বর্তনীর (সার্কিট) রেজিস্টারগুলোকে নিয়ন্ত্রণ বা পরিচালনার জন্য যুক্তিবর্তনী (অপারেশন) যোগ করতে পারেন।
de_de: Sie können Gates (Operationen) hinzufügen, um die Register Ihrer Schaltung zu manipulieren.
el_gr: Μπορείτε να προσθέσετε πύλες (λειτουργίες) για να χειριστείτε τους καταχωρητές του κυκλώματός σας.
es_un: Puedes agregar compuertas (operaciones) para manipular los registros de tu circuito.
fr_fr: Il est possible d'ajouter des portes (qui représentent des opérations) pour manipuler les registres du circuit.
ja_jp: ゲート（演算）を追加することで、回路のレジスタを操作することができます。
ko_kr: 게이트들을 (연산들을) 추가하여 회로의 레지스터들을 조작할 수 있다.
ml_in: സർക്യൂട്ടിൽ ഗേറ്റുകൾ(ഓപ്രേഷന്സ്) ചേർകുനതിലൂടേ രജിസ്റ്ററുകൾ(ക്വിബിറ്റുകൾ) മാനിപുലേറ്റ് ചെയ്യാൻ കഴിയും.
pl_pl: Aby manipulować rejestrem obwodu, dodaj bramki (operacje).
pt_br: Você pode adicionar portas (operações) para manipular os registradores do seu circuito.
pt_un: Você pode adicionar portas (Operações) para manipular os registradores do seu circuito.
ru_ru: Теперь вы можете добавить вентили (операторы) для управления квантовым регистром вашей цепи.
sw_ke: Unaweza kuongeza malango (operesheni) kudhibiti rejista za saketi zako.
ta_in: உங்கள் சர்க்யூட் பதிவேடுகளை கையாள கேட்ஸ்களை (செயல்பாடுகள்) சேர்க்கலாம்.
te_in: మీరు మీ సర్క్యూట్ యొక్క రిజిస్టర్లను మార్చటానికి గేట్లను (ఆపరేషన్లు) జోడించవచ్చు.
tr_tr: Devrenizin yazmaçlarını manipüle etmek için kapılar (işlemler) ekleyebilirsiniz.
vi_vn: Bạn có thể thêm các cổng (thao tác) để điều khiển các thanh ghi trong mạch lượng tử của bạn.
zh_cn: 您可以添加门（操作）来操纵您的电路寄存器。
zh_tw: 您可以新增閘道（操作）來控制電路的暫存器。

source: Consider the following three lines of code:
bn_bn: নিচের তিন লাইনের কোডটি বিবেচনা করুনঃ
de_de: Betrachten Sie die folgenden drei Zeilen Code:
el_gr: Εξετάστε τις ακόλουθες τρεις γραμμές κώδικα:
es_un: Considera las siguientes tres líneas de código:
fr_fr: Par exemple :
ja_jp: 次の3行のコードを考えてみましょう。
ko_kr: 다음 세 줄의 코드를 참고하자:
ml_in: ഉദാഹരണത്തിന്:
pt_br: Considere as três linhas de código a seguir:
pt_un: Considere as três linhas de código seguintes:
ru_ru: Рассмотрим следующие три строки кода:
sw_ke: Zingatia mistari mitatu ifuatayo ya msimbo:
ta_in: பின்வரும் மூன்று code வரிகளைக் கவனியுங்கள்:
te_in: క్రింది మూడు పంక్తుల కోడ్ను పరిగణించండి:
tr_tr: Aşağıdaki üç kod satırına bakalım:
vi_vn: Xem xét ba dòng code sau:
zh_cn: 仔细观察下面三行代码
zh_tw: 請考慮下列三行程式碼：

source: The gates are added to the circuit one-by-one to form the Bell state
bn_bn: এক এক করে যুক্তিবর্তনীগুলো (গেইট) বর্তনীতে (সার্কিট) প্রতিস্থাপন করা হয়েছে যাতে বেল স্টেট গঠন হয়
de_de: Die Gates werden nacheinander hinzugefügt um den Bell-Zustand zu bilden
el_gr: Οι πύλες προστίθενται στο κύκλωμα μία προς μία για να σχηματίσουν την κατάσταση Bell
es_un: Las compuertas se agregan al circuito una por una para formar el estado de Bell
fr_fr: Les portes sont ajoutées au circuit, l'une après l'autre pour produire l'état de Bell
ja_jp: ゲートは1つずつ回路に追加され、ベル状態を形成します。
ko_kr: 게이트들이 회로에 하나씩 추가되어 Bell 상태를 만들고 있다.
pl_pl: Bramki dodaje się do obwodu jedna po drugiej, aby wywołać stan Bella
pt_br: As portas são adicionados uma-a-uma ao circuito para formar o estado de Bell
pt_un: As portas são adicionadas ao circuito uma a uma para formar o estado de Bell
ru_ru: Последовательное применение этих вентилей формирует состояние Белла
sw_ke: Milango inaongezwa kwenye saketi moja kwa moja kuunda hali ya Bell
ta_in: பெல் நிலையை உருவாக்குவதற்கு கேட்கள் ஒவ்வொன்றாக சர்க்யூட்க்கு சேர்க்கப்படுகின்றன
te_in: బెల్ స్టేట్ని రూపొందించడానికి గేట్లు సర్క్యూట్‌కు ఒక్కొక్కటిగా జోడించబడతాయి
tr_tr: Kapılar Bell durumunu oluşturmak için devreye teker teker eklenir
vi_vn: Các cổng lần lượt được thêm vào mạch lượng tử để tạo nên trạng thái Bell
zh_cn: 这些门被逐一添加到电路中形成贝尔状态
zh_tw: 這些閘道被逐個加入到電路中以形成貝爾態

source: The code above applies the following gates:
bn_bn: উপরের কোডে যে যুক্তিবর্তনীগুলো (গেইট) ব্যবহৃত হয়েছে সেগুলি হলোঃ
de_de: Der obige Code verwendet die folgenden Gates:
el_gr: Ο παραπάνω κώδικας εφαρμόζει τις ακόλουθες πύλες:
es_un: El código anterior aplica las siguientes compuertas:
fr_fr: Le code utilise les portes suivantes :
ja_jp: 上記のコードは、以下のゲートを適用しています。
ko_kr: 위의 코드는 다음의 게이트들을 적용한다:
ml_in: മുകളിലുള്ള കോഡ് ഇനിപ്പറയുന്ന ഗേറ്റുകൾ അപ്ലയ് ചെയ്യുന്നു:
pl_pl: Powyższy kod stosuje następujące bramki:
pt_br: O código acima aplica as seguintes portas:
pt_un: O código acima aplica as seguintes portas:
ru_ru: Приведенный выше код содержит следующие вентили:
sw_ke: Msimbo hapo juu unatumia milango ifuatayo:
ta_in: மேலே உள்ள code பின்வரும் கேட்களை பயன்படுத்துகிறது:
te_in: పై కోడ్ క్రింది గేట్‌లకు వర్తిస్తుంది:
tr_tr: Yukarıdaki kod aşağıdaki kapıları uygular:
vi_vn: Đoạn code ở trên áp dụng các cổng sau:
zh_cn: 上面的代码使用到以下门电路：
zh_tw: 上述程式碼會套用到下列閘道：

source: ``QuantumCircuit.h(0)``: A Hadamard gate :math:`H` on qubit 0, which puts it into a **superposition state**.
bn_bn: ``QuantumCircuit.h(0)``: ০ কিউবিটে একটি হ্যাডামার্ড যুক্তিবর্তনী (গেইট) :math:`H` যোগ করা হয়েছে যার ফলে এতে **উপরিপাতন অবস্থা (সুপারপজিশন)** তৈরি হয়েছে।
de_de: ``QuantumCircuit.h(0)``: Ein Hadamard-Gate :math:`H` auf Qubit 0, welches das Qubit in einen **Zustand der Superposition (superposition state)** überführt.
el_gr: ``QuantumCircuit.h(0)``: Μια πύλη Hadamard :math:`H` στο qubit 0, η οποία την βάζει σε **κατάσταση superposition**.
es_un: ``QuantumCircuit.h(0)``: Una compuerta Hadamard :math:`H` en el qubit 0, que lo pone en un **estado de superposición**.
fr_fr: ``QuantumCircuit.h(0)`` : Une porte de Hadamard :math:`H` sur le qubit 0, qui le place en **état de superposition**.
ja_jp: ``QuantumCircuit.h(0)`` : 量子ビット0にアダマールゲート :math:`H` を設定し、 **重ね合わせ状態** にします。
ko_kr: ``QuantumCircuit.h(0)``: 하다마드 게이트 :math:`H`, 큐비트 0을 **중첩 상태** 로 만든다.
ml_in: ``QuantumCircuit.h(0)``: ക്വിബിറ്റ് 0 ൽ ഹഡാമാർഡ് ഗേറ്റ് :math:`H` അപ്ലയ് ചെയുബൊൾ, ക്വിബിറ്റ് **സൂപ്പർ പോസിഷൻ സ്റ്റേറ്റ്ല് ** ആവുന്നു.
pl_pl: ``QuantumCircuit.h(0)``: Bramka Hadamarda :math:`H` dla kubitu 0, która powoduje jego przejście w **stan superpozycji**.
pt_br: ``QuantumCircuit.h(0)``: Uma porta de Hadamard :math:`H` no qubit 0, que o coloca em um **estado de superposição**.
pt_un: ``QuantumCircuit.h(0)``: Uma porta Hadamard :math:`H` no qubit 0, que coloca-o em um **estado de superposição**.
ru_ru: ``QuantumCircuit.h(0)``: вентиль Адамара :math:`H`, приводящий кубит 0 в **состояние суперпозиции**.
sw_ke: ``QuantumCircuit.h(0)``: Lango la Hadamard :math:`H` kwa qubit 0, inayoiweka katika **hali ya superposition**.
ta_in: ``QuantumCircuit.h(0)``:க்யூபிட் 0 இல் ஒரு ஹடமார்ட் கேட் :math:`H`, இது ஒரு **சூப்பர்பொசிஷன் நிலைக்கு** வைக்கிறது.
te_in: ``QuantumCircuit.h(0)``: క్విట్ 0పై హడమార్డ్ గేట్ :math:`H`, ఇది **సూపర్‌పొజిషన్ స్థితి**లో ఉంచుతుంది.
tr_tr: ``QuantumCircuit.h(0)``: Kübit 0'a uygulanıp onu **süperpozisyon durumuna** sokan bir Hadamard kapısı :math:`H`.
vi_vn: ``QuantumCircuit.h(0)``: cổng Hadamard :math:`H` tác động lên qubit số 0, làm nó trở thành trạng thái **chồng chập**.
zh_cn: ``QuantumCircuit.h(0)`` ：一个 Hadamard 门 :math:`H` 处于量子位 $q_{0}$ 上，它会使量子位 $q_{0}$ 变成一个**叠加状态**。
zh_tw: ``QuantumCircuit.h(0)``: Hadamard Gate :math:`H` 作用於 qubit 0，令它進入 **疊加態**。

source: ``QuantumCircuit.cx(0, 1)``: A controlled-Not operation (:math:`CNOT`) on control qubit 0 and target qubit 1, putting the qubits in an **entangled state**.
bn_bn: ``QuantumCircuit.cx(0, 1)``: নিয়ন্ত্রক (কন্ট্রোল) কিউবিট ০ ও লক্ষ্য (টারগেট) কিউবিট ১ এ চালিত কন্ট্রোলড-নট অপারেশন (:math:`CNOT`), কিউবিটগুলোতে একটি **এন্ট্যাঙ্গেলড অবস্থা** তৈরি করে।
de_de: ``QuantumCircuit.cx(0, 1)``: Ein Controlled-Not Operator (:math:`CNOT`) mit Kontroll-Qubit 0 und Ziel-Qubit 1. Damit werden diese Qubits in einen quantenmechanisch **verschränkten Zustand** gebracht.
el_gr: ``QuantumCircuit.cx(0, 1)``: Μια controlled-Not λειτουργία (:math:`CNOT`) στο qubit ελέγχου 0 και στο qubit στόχου 1, τοποθετώντας τα qubits σε **κατάσταση entangled**.
es_un: ``QuantumCircuit.cx(0, 1)``: Una operación NOT controlada (:math:`CNOT`) con el control en el qubit 0 y el objetivo en el qubit 1, colocando los qubits en un **estado entrelazado**.
fr_fr: ``QuantumCircuit.cx(0, 1)``: Une porte Control-Not (:math:`CNOT`) avec le qubit de contrôle 0, agissant sur le qubit cible 1, ce qui a pour effet de mettre les deux qubits dans un **état intriqué**.
ja_jp: ``QuantumCircuit.cx(0, 1)`` : 制御量子ビット0とターゲット量子ビット1に対する制御NOT演算（ :math:`CNOT` ）で、量子ビットを **エンタングル状態** にします。
ko_kr: ``QuantumCircuit.cx(0, 1)``: 제어 반전 게이트 (:math:`CNOT`), 조절 큐비트 0과 표적 큐비트 1을 **얽힘 상태** 로 만든다.
ml_in: ``QuantumCircuit.cx(0, 1)``:ക്വിബിറ്റ് 0(കോൺട്രോൾ) ക്വിബിറ്റ് 1(ടാർഗെറ്റ്) -മേൽ കോൺട്രോൾഡ്-നോട്ട് ഓപ്രേഷൻ(:math:`CNOT`) ചെയുമ്ബൊൾ അവ **എന്ടാങ്ൾ്ഡ് സ്ടേയ്റ്റിൽ** ആവുന്നു. അതായത്, കോൺട്രോൾ ക്വിബിറ്റിന്റെ (ക്വിബിറ്റ് 0) മൂല്യം മാറുമ്പോൾ ടാർഗെറ്റ് ക്വിബിറ്റിന്റെ (ക്വിബിറ്റ് 1) മൂല്യം അതനുസരിച്ച് മാറുന്നു.
pl_pl: ``QuantumCircuit.cx(0, 1)``: bramka kontrolowanej negacji (:math:`CNOT`) na kubicie kontrolnym 0 i kubicie docelowym 1, kubity zostają wprowadzone w **stan splątany**.
pt_br: ``QuantumCircuit.cx(0, 1)``: Uma operação controlled-Not (:math:`CNOT`) sobre o qubit de controle 0 e o qubit de destino 1, deixando os qubits em um **estado de emaranhamento**.
pt_un: ``QuantumCircuit.cx(0, 1)``: Uma operação não controlada (:math:`CNOT`) no qubit de controle 0 e no qubit de destino 1, colocando os quibits em um **estado de emaranhamento**.
ru_ru: ``QuantumCircuit.cx(0, 1)``: оператор контролируемого отрицания (:math:`CNOT`), который создает из управляющего (кубит 0) и управляемого (кубит 1) кубитов **запутанное состояние**.
sw_ke: ``QuantumCircuit.cx(0, 1)``: Operesheni ya Not liyodhibitiwa (:math:`CNOT`) juu ya qubit iliyodhibitiwa ya 0 na qubit iliyolengwa ya 1, inayoweka qubits katika **hali ya entanglement**.
ta_in: ``QuantumCircuit.cx(0, 1)``: கட்டுப்பாட்டு க்யூபிட் 0 மற்றும் இலக்கு க்யூபிட் 1 இல் ஒரு கட்டுப்பாடு-இல்லை செயல்பாடு (:math:`CNOT`) ஒரு **entangled நிலை** இல் க்யூபிட்களை வைக்கிறது.
te_in: ``QuantumCircuit.cx(0, 1)``: నియంత్రణ క్విట్ 0 మరియు టార్గెట్ క్విట్ 1పై నియంత్రిత-కాని ఆపరేషన్ (:math:`CNOT`), క్విట్‌లను ** చిక్కుబడ్డ స్థితి**లో ఉంచుతుంది.
tr_tr: ``QuantumCircuit.cx(0, 1)``: Kübit 0 kontrol ve kübit 1 hedef olacak şekilde uygulanan Kontrollü Not işlemi (:math:`CNOT`) kübitleri **dolanıklık durumu**na getirir.
zh_cn: ``QuantumCircuit.cx(0, 1)``：在控制量子位 0 和目标量子位 1 进行Controlled-NOT操作（:math:`CNOT`），使得它们进入**纠缠态**。
zh_tw: ``QuantumCircuit.cx(0, 1)``: 控制反 (controlled-Not)(:math:`CNOT`)運算作用於控制位元qubit 0及目標位元 qubit 1，讓它們進入 **糾纏態**。

source: ``QuantumCircuit.measure([0,1], [0,1])``: if you pass the entire quantum and classical registers to ``measure``, the ith qubit’s measurement result will be stored in the ith classical bit.
bn_bn: ``QuantumCircuit.measure([0,1], [0,1])``: আপনি যদি সমগ্র কোয়ান্টাম এবং ধ্রুপদী (ক্লাসিক্যাল) রেজিস্টার কে ``measure`` করার জন্য পাঠান, সেক্ষেত্রে i-তম পরিমাপনের ফলাফল i -তম ধ্রুপদী (ক্লাসিক্যাল) বিট এ রাখা হবে।
de_de: ``QuantumCircuit.measure([0,1], [0,1])``: Werden die Quanten- und klassischen Register als Ganzes an ``measure`` übergeben, wird das Messergebnis des i-ten Qubits im i-ten klassischen Bit gespeichert.
el_gr: ``QuantumCircuit. easure([0,1], [0,1])``: αν περάσεις όλα τα κβαντικά και κλασικά registers στο ``measure``, το αποτέλεσμα μέτρησης του x qubit θα αποθηκευτεί στο αντίστοιχο κλασικό x bit.
es_un: ``QuantumCircuit.measure([0,1], [0,1])``: Si pasas todos los registros cuánticos y clásicos a ``measure``, el resultado de la medición del i-ésimo qubit se almacenará en el i-ésimo bit clásico.
fr_fr: ``QuantumCircuit.measure([0,1], [0,1])``: lorsque l'on passe en argument de ``measure`` l'intégralité du registre quantique et du registre classique alors le résultat de la mesure sur le qubit de rang `i` sera stocké dans le bit classique de même rang.
ja_jp: ``QuantumCircuit.measure([0,1], [0,1])`` : 量子レジスタと古典レジスタの全体を ``measure`` に渡すと、i番目の量子ビットの測定結果がi番目の古典ビットに格納されます．
ko_kr: ``QuantumCircuit.measure([0,1], [0,1])``: 모든 양자와 클래식 레지스터들을 ``측정`` 한다면, i 번째 큐비트의 측정 결과는 i 번째 클래식 비트에 저장될 것이다.
pl_pl: ``QuantumCircuit.measure([0,1], [0,1])``: przekazanie rejestru kwantowego i klasycznego do ``measure`` sprawi, że wynik pomiaru i-tego kubitu zapisze się w i-tym klasycznym bicie.
pt_br: ``QuantumCircuit.measure([0,1], [0,1])``: se você passar os registradores quânticos e clássicos inteiros para ``measure``, o resultado da medição do i-ésimo qubit será armazenado no i-ésimo bit clássico.
pt_un: ``QuantumCircuit.measure([0,1], [0,1])``: se você passar todos os registradores quânticos e clássicos para ``measure``, o resultado da medição do i-ésimo qubit será armazenado no i-ésimo bit clássico.
ru_ru: ``QuantumCircuit.measure ([ 0, 1], [ 0, 1])``: проводя измерение ``measure`` квантового регистра, результат измерения каждого кубита будет сохранен в соответствующем классическом бите.
ta_in: ``QuantumCircuit.measure([0,1], [0,1])``: நீங்கள் முழு குவாண்டம் மற்றும் கிளாசிக்கல் பதிவேடுகளை ``அளவிடு`` க்கு அனுப்பினால், ith க்யூபிட்டின் அளவீட்டு முடிவு ith கிளாசிக்கல் பிட்டில் சேமிக்கப்படும்.
te_in: ``QuantumCircuit.measure([0,1], [0,1])``: మీరు మొత్తం క్వాంటం మరియు క్లాసికల్ రిజిస్టర్‌లను ``మెజర్``కి పంపితే, ith క్విట్ యొక్క కొలత ఫలితం ith క్లాసికల్ బిట్‌లో నిల్వ చేయబడుతుంది.
tr_tr: ``QuantumCircuit.measure([0,1], [0,1])``: bütün kuantum ve klasik yazmaçları ``measure``'a geçirirseniz, i'nci kübitin ölçüm sonucu i'nci klasik bite kaydedilir.
vi_vn: ``QuantumCircuit.measure([0,1], [0,1])``: nếu chúng ta tiến hành ``đo`` trên toàn bộ qubits và bit cổ điển, kết quả đo trên qubit thứ i sẽ được lưu vào bit cổ điển thứ i.
zh_cn: ``QuantumCircuit.measure([0,1], [0,1])``：如果将整个量子和经典寄存器传递到 ``measure`` ，那么第 i 个量子位的测量结果将被存储在第 i 个经典位中。
zh_tw: ``QuantumCircuit.measurel（[0,1], [0,1]）``：如果您將整個量子和經典暫存器傳遞給 ``measure`` ` 測量，則第i個量子位元的測量結果將會儲存在第i個經典位元中。

source: Step 4 : Visualize the Circuit
bn_bn: চতুর্থ ধাপঃ বর্তনী (সার্কিট) দৃশ্যায়ন
de_de: Schritt 4 : Den Schaltkreis visualisieren
el_gr: Βήμα 4: Απεικόνιση του κυκλώματος
es_un: Paso 4 : Visualizar el Circuito
fr_fr: Étape 4 : Visualisation du circuit
ja_jp: ステップ４：回路の可視化
ko_kr: 4단계: 회로 시각화하기
pl_pl: Krok 4: Wizualizacja obwodu
pt_br: Etapa 4: Visualizar o Circuito
pt_un: Passo 4: Visualizar o circuito
ru_ru: Шаг 4: Визуализация цепи
sw_ke: Hatua ya 4 : Jenga Taswira ya Saketi
ta_in: படி 4: சர்க்யூட்-ஐ காட்சிப்படுத்துங்கள்
te_in: Step 4: సర్క్యూట్‌ను దృశ్యమానం చేయుట
tr_tr: Adım 4: Devreyi Görselleştir
vi_vn: Bước 4: Hiển thị mạch lượng tử
zh_cn: 步骤 4 ：可视化电路
zh_tw: 步驟 4 ：視覺化電路

source: You can use :meth:`qiskit.circuit.QuantumCircuit.draw` to view the circuit that you have designed in the various forms used in many textbooks and research articles.
bn_bn: :meth:`qiskit.circuit.QuantumCircuit.draw` ব্যবহার করে বর্তনীকে (সার্কিট) বিভিন্ন পাঠ্যবই বা গবেষণাপত্রে ছাপানো বর্তনীর মত দেখা যায়।
de_de: Sie können :meth:` qiskit.circuit.QuantumCircuit.draw ` verwenden, um die von Ihnen entworfenen Schaltung so anzuzeigen, wie sie in vielen Lehrbüchern und Forschungsartikeln dargestellt werden.
el_gr: Μπορείς να χρησιμοποιήσεις το :meth:`qiskit.circuit.QuantumCircuit.draw` για να δεις το κύκλωμα που έχεις σχεδιάσει με τις διάφορες μορφές που χρησιμοποιούνται σε πολλά εγχειρίδια και ερευνητικά άρθρα.
es_un: Puedes usar :meth:`qiskit.circuit.QuantumCircuit.draw` para ver el circuito que has diseñado en las diversas formas utilizadas en muchos libros de texto y artículos de investigación.
fr_fr: Vous pouvez utiliser :meth:`qiskit.circuit.QuantumCircuit.draw` afficher une représentation du circuit que vous avez conçu dans les différentes formes utilisées couramment dans les manuels et articles de recherche.
ja_jp: :meth:`qiskit.circuit.QuantumCircuit.draw` を使用して、多くの教科書や研究記事で使用されているさまざまな形式で設計した回路を表示できます。
ko_kr: 직접 디자인한 회로를 많은 교과서 및 연구 자료에서 사용되는 다양한 형태들로 보기 위해서 :meth:`qiskit.circuit.QuantumCircuit.draw` 를 사용할 수 있다.
pl_pl: Możesz użyć :meth:` qiskit.circuit.QuantumCircuit.draw ` aby zobaczyć zaprojektowany obwód w różnych formach zastosowanych w wielu podręcznikach i artykułach naukowych.
pt_br: Você pode usar :meth:`qiskit.circuit.QuantumCircuit.draw` para ver o circuito que você projetou nas várias formas usadas em muitos livros didáticos e artigos de pesquisa.
pt_un: Você pode utilizar :meth:`qiskit.circuit.QuantumCircuit.draw` para visualizar o circuito que você projetou nas várias formas usadas em muitos livros didáticos e artigos de pesquisa.
ru_ru: Вы можете использовать :meth:`qiskit.circuit.QuantumCircuit.draw` для просмотра созданной вами цепи в различных форматах, используемых во многих учебниках и исследовательских статьях.
sw_ke: Unaweza kutumia :meth:`qiskit.circuit.QuantumCircuit.draw` kutazama saketi ambayo umebuni katika miundo anuwai inayotumiwa katika vitabu vingi na nakala za utafiti.
ta_in: நீங்கள் பயன்படுத்த முடியும் :meth:`qiskit.circuit.QuantumCircuit.draw` நீங்கள் பல பாடப்புத்தகங்கள் மற்றும் ஆராய்ச்சி கட்டுரைகள் பயன்படுத்தப்படும் பல்வேறு வடிவங்களில் வடிவமைக்கப்பட்டுள்ளது என்று சர்க்யூட் பார்க்க.
te_in: మీరు అనేక పాఠ్యపుస్తకాలు మరియు పరిశోధనా వ్యాసాలలో ఉపయోగించిన వివిధ రూపాల్లో రూపొందించిన సర్క్యూట్‌ను వీక్షించడానికి మీరు :meth:`qiskit.circuit.QuantumCircuit.draw`ని ఉపయోగించవచ్చు.
tr_tr: Birçok ders kitabı ve araştırma makalesinde kullanılan çeşitli şekillerde tasarladığınız devreyi görmek için :meth:`qiskit.circuit.QuantumCircuit.draw`'u kullanabilirsiniz.
vi_vn: Bạn có thể sử dụng :meth:`qiskit.circuit. QuantuCircuit.draw` để xem mạch lượng tử bạn đã thiết kế dưới nhiều hình thức khác nhau, được sử dụng trong các tài liệu và nghiên cứu khoa học.
zh_cn: 您可以使用 :meth:`qiskit.circuit.QuantumCircuit.draw` 来查看电路，这些电路在许多教程和科研文章中形态各异。
zh_tw: 您可以使用 :meth:`qiskit.circuit.QuantumCircuit.draw`來檢視您從教科書及研究文章中使用以不同形態所設計的電路。
