Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/intro_tutorial1.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, ja_jp, ko_kr, ml_in, pl_pl, pt_br, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_cn, zh_tw

source: Once you have a ``result`` object, you can access the counts via the method ``get_counts(circuit)``. This gives you the aggregate outcomes of the experiment you ran.
bn_bn: ``result` অবজেক্টটি পাওয়ার পর ফলাফলের কাউন্ট বা গণনা সংখ্যা ``get_counts(circuit)`` মেথডের সাহায্যে পাওয়া যাবে। এটি দিয়ে পরীক্ষাটির মোট ফলাফল পাওয়া যায়।
de_de: Sobald das ``result`` Objekt verfügbar ist, kann man auf das Ergebnis mit der Methode ``get_counts(circuit)`` zugreifen. Dadurch erhält man die zusammengefassten Ergebnisse des Experiments.
el_gr: Μόλις έχεις ένα αντικείμενο ``result``, μπορείς να αποκτήσεις πρόσβαση στις μετρήσεις μέσω της μεθόδου ``get_counts(circuit)``. Αυτό σας δίνει τα συνολικά αποτελέσματα του πειράματος που τρέξατε.
es_un: Una vez que tengas un objeto ``result``, puedes acceder a los conteos a través del método ``get_counts(circuit)``. Esto te brinda los resultados agregados del experimento que ejecutaste.
fr_fr: Une fois que vous disposez de l'objet ``result`, vous pouvez obtenir le comptage des résultats par la méthode ``get_counts(circuit)``, qui renvoie les résultats agrégés du programme que vous avez exécuté.
ja_jp: ``result`` オブジェクトを取得できたら、``get_counts(circuit)`` メソッドを使用して回数を取得することができます。実行した実験の総計を得ることができます。
ko_kr: ``result`` 객체를 얻은 후에는 시뮬레이션 결과값 통계를 ``get_counts(circuit)`` 함수를 통해 얻을 수 있다. 이를 통해 지금까지 실행했던 실험들의 합계된 결과를 확인할 수 있다.
ml_in: ``result``-ന്റെ കൗണ്ട് കിട്ടുനതിനായി `get_counts(circuit)`` ഉപയോഗിക്കാം. ഇങനെ ചെയ്യ്ത് കൊണ്ട് നിങ്ങളുടെ കോഡ്ന്റെ മൊത്തം ഫലങ്ങൾ കരസ്ത്മാകാം.
pl_pl: Dzięki obiektowi ``result``, możemy otrzymać wyniki poprzez funkcję ``get_counts(circuit)``. Zwraca ona zagregowane wyniki dla danego obwodu.
pt_br: Uma vez que você tenha o objeto ``result``, poderá acessar as contagens através do método ``get_counts(circuit)``. Isso fornece os resultados agregados do experimento que você executou.
pt_un: Uma vez que tenha um objeto ``result``, você pode acessar as contagens por meio do método ``get_counts(circuit)``. Isso fornece os resultados agregados do experimento executado.
ru_ru: После получения объекта ``result`` метод ``get_counts(circuit)`` дает доступ к данным счетчика. Это формирует итоговый результат эксперимента, который вы запускали.
sw_ke: Punde tu unapokuwa na kipengee cha ``result``, unaweza kufikia idadi kupitia mbinu ya ``get_counts(circuit)``. Hii inakupa matokeo ya jumla ya jaribio ulilofanya.
ta_in: நீங்கள் ஒரு ``result`` object இருந்தால், நீங்கள் முறை மூலம் எண்ணிக்கைகளை அணுக முடியும் ``get_counts(circuit)``. இது நீங்கள் நடத்திய பரிசோதனையின் ஒட்டுமொத்த விளைவுகளை உங்களுக்கு வழங்குகிறது.
te_in: మీరు ``ఫలితం`` ఆబ్జెక్ట్‌ను కలిగి ఉంటే, మీరు ``get_counts(circuit)`` పద్ధతి ద్వారా గణనలను యాక్సెస్ చేయవచ్చు. ఇది మీరు చేసిన ప్రయోగం యొక్క మొత్తం ఫలితాలను మీకు అందిస్తుంది.
tr_tr: Bir defa ``result`` objesine sahip olmanız durumunda, ``get_counts(circuit)`` metodu aracılığıyla sayılara erişebilirsiniz. Bu size çalıştırdığınız deneyin çıktılarını toplu halde verir.
zh_cn: 当您有 ``result`` 对象之后，您可以通过函数 ``get_counts(circuit)`` 来访问计数。 这是您所做实验的总结果。
zh_tw: 當您有 ``result'` 物件之後，您可以透過方法 ``get_counts(circuit)`` 存取數量。 這會給您所執行實驗的聚集結果。

source: Step 6 : Visualize the Results
bn_bn: পদক্ষেপ ৬ঃ ফলাফল দৃশ্যায়ন
de_de: Schritt 6 : Die Ergebnisse visualisieren
el_gr: Βήμα 6 : Απεικόνιση των αποτελεσμάτων
es_un: Paso 6 : Visualizar los Resultados
fr_fr: Étape 6 : Visualisation des Résultats
ja_jp: ステップ6：結果の可視化
ko_kr: 6단계: 결과 시각화하기
pl_pl: Krok 6: Wizualizacja wyników
pt_br: Etapa 6: Visualizar os Resultados
pt_un: Passo 6: Visualizar os resultados
ru_ru: Шаг 6: Отображение результатов
sw_ke: Hatua ya 6 : Jenga Taswira ya Matokeo
ta_in: படி 6 : முடிவுகளை காட்சிப்படுத்துங்கள்
te_in: Step 6: ఫలితాలను దృశ్యమానం చేయండి
tr_tr: Adım 6: Sonuçları Görselleştir
vi_vn: Bước 6: Hiển thị kết quả
zh_cn: 步骤 6 ：可视化结果
zh_tw: 步驟 6 ：視覺化結果

source: Qiskit provides `many visualizations <apidoc/visualization.html>`__,
bn_bn: Qiskit এ `নানা ধরনের দৃশ্যায়ন পদ্ধতি <apidoc/visualization.html>`__ রয়েছে,
de_de: Qiskit stellt `viele Visualisierungen <apidoc/visualization.html>`__ zur Verfügung,
el_gr: Το Qiskit παρέχει `πολλές απεικονίσεις <apidoc/visualization.html>`__,
es_un: Qiskit proporciona `muchas visualizaciones <apidoc/visualization.html>`__,
fr_fr: Qiskit fournit `de nombreux modes de visualisation <apidoc/visualization.html>`__,
ja_jp: Qiskitは `多くのビジュアライゼーション <apidoc/visualization.html>`__ を提供します。
ko_kr: Qiskit 은 결과를 보여주기 위해 많은 `시각화 방법들을 <apidoc/visualization.html>`__ 제공한다.
ml_in: ക്വിസ്കിറ്റിൽ റിസൽട്ട് നിരവധി 'ദൃശ്യവൽക്കരിക്കാൻ <apidoc/visualization.html>__ നിരവധി രീതികളുണ്ട്
pl_pl: Qiskit zapewnia `wiele form wizualizacji <apidoc/visualization.html>`__,
pt_br: Qiskit fornece `várias visualizações <apidoc/visualization.html>`__,
pt_un: Qiskit fornece `muitas visualizações <apidoc/visualization.html>`__,
ru_ru: Qiskit предоставляет широкие возможности `визуализации <apidoc/visualization.html>` __,
sw_ke: Qiskit hutoa `taswira nyingi <apidoc/visualization.html>`__
ta_in: Qiskit `பல காட்சிப்படுத்தல்களை <apidoc/visualization.html>`__ வழங்குகிறது,
te_in: Qiskit `అనేక విజువలైజేషన్‌లను అందిస్తుంది <apidoc/visualization.html>`__,
tr_tr: Qiskit `many visualizations <apidoc/visualization.html>`__ sağlar,
zh_cn: Qiskit 提供了 `许多可视化 <apidoc/visualization.html>`__ 输出，
zh_tw: Qiskit 提供 `many visualizations <apidoc/visualization.html>`__,

source: including the function ``plot_histogram``, to view your results.
bn_bn: ``plot_histogram`` ফাংশনটি এর মধ্যে একটি।
de_de: inklusive der Funktion ``plot_histogram`` um die Ergebnisse anzuzeigen.
el_gr: συμπεριλαμβανομένης της συνάρτησης ``plot_histogram``, για να δείτε τα αποτελέσματά σας.
es_un: incluyendo la función ``plot_histogram``, para ver tus resultados.
fr_fr: parmi lesquels ``plot_histogram``, pour afficher vos résultats.
ja_jp: その中には結果を表示するための ``plot_histogram`` という関数も含まれます。
ko_kr: 이중에는 ``plot_histogram`` 함수도 포함되어 있다.
ml_in: റിസൽട്ട് കാണുനതിനയി ``plot_histogram`` ഏഡ് ചെയുക​.
pl_pl: w tym funkcję ``plot_histogram`` do wyświetlania wyników.
pt_br: incluindo a função ``plot_histogram``, para visualizar seus resultados.
pt_un: incluindo a função ``plot_histogram``, para visualizar seus resultados.
ru_ru: включая функцию ``plot_histogram`` для просмотра результатов.
sw_ke: ikiwa ni pamoja na fomula saidizi ``plot_histogram``, ya kutizama matokeo yako.
ta_in: உங்கள் முடிவுகளைக் காண, ``plot_histogram`` என்ற செயல்பாடு உட்பட.
te_in: మీ ఫలితాలను వీక్షించడానికి ``plot_histogram`` ఫంక్షన్‌తో సహా.
tr_tr: sonuçları görmek için ``plot_histogram`` fonksiyonu da dahil olmak üzere.
vi_vn: bao gồm hàm ``plot_histogram``, để xem kết quả của bạn.
zh_cn: 其中包括函数 ``plot_histogram`` 可以查看您的输出结果。
zh_tw: 其中包括函數``plot_histogram`` ，以檢視您的結果。

source: (:download:`Source code <_build/gettext/plot_directive/intro_tutorial1-5.py>`)
ta_in: (:download:`மூலக் குறியீடு <_build/gettext/plot_directive/intro_tutorial1-5.py>`)

source: The observed probabilities :math:`Pr(00)` and :math:`Pr(11)` are computed by taking the respective counts and dividing by the total number of shots.
bn_bn: পর্যবেক্ষণকৃত :math:`Pr(00)` ও :math:`Pr(11)` সম্ভাবনাসমূহ এদের সম্পর্কিত কাউন্ট সংখ্যাকে মোট শট শংখ্যা দিয়ে ভাগ করে গণনা করা হয়।
de_de: Die beobachteten Wahrscheinlichkeiten :math:`Pr(00)` and :math:`Pr(11)` ergeben sich aus den jeweiligen Auszählungen geteilt durch die Anzahl der Durchläufe.
el_gr: Οι παρατηρούμενες πιθανότητες :math:`Pr(00)` και :math:`Pr(11)` υπολογίζονται με τη λήψη των αντίστοιχων μετρήσεων και τη διαίρεση με το συνολικό αριθμό των εκτελέσεων.
es_un: Las probabilidades observadas :math:`Pr(00)` y :math:`Pr(11)` se calculan tomando los conteos respectivos y dividiendo por el número total de iteraciones.
fr_fr: Les probabilités observées :math:`Pr(00)` et :math:`Pr(11)` sont calculées en divisant chaque quantité de résultat obtenu pour une valeur donnée du résultat par le nombre de tirs.
ja_jp: 観測された確率 :math:`Pr(00)` と :math:`Pr(11)` は、対応する事象が観測された回数を全実行回数で割った数値です。
ko_kr: 관측된 확률 :math:`Pr(00)` 와 :math:`Pr(11)` 는 각각의 값이 나온 실험의 수를 총 샷 수로 나누어 계산되었다.
ml_in: മൊത്തം ഷോട്ടുകളുടെ എണ്ണത്തെ ഓരൊ ഉതരതിന്റെയും എണ്ണം കൊണ്ട് ഹരിച്ചാണ് പ്രോബബിലിറ്റികൾ :math:`Pr(00)` and :math:`Pr(11)` കണക്കാക്കുന്നത്.
pl_pl: Prawdopodobieństwa :math:`Pr (00)` i :math:`Pr (11)` oblicza się poprzez zliczenie poszczególnych wyników i podzielenie przez całkowitą liczbę prób.
pt_br: As probabilidades observadas :math:`Pr(00)` e :math:`Pr(11)` são calculadas pelas respectivas contagens e dividindo pelo número total de execuções.
pt_un: As probabilidades observadas :math:`Pr(00)` e :math:`Pr(11)` são computadas tomando as respectivas contagens e dividindo pelo número total de execuções.
ru_ru: Наблюдаемые вероятности :math:`Pr(00)` и :math:`Pr(11)` вычисляются путём деления соответствующих данным строкам чисел в счетчике на общее число запусков.
sw_ke: Uwezekano unaozingatiwa :math:`Pr(00)` na :math:`Pr(11)` huhesabiwa kwa kuchukua idadi husika na kuigawanya na jumla ya idadi ya utekelezaji.
ta_in: கவனிக்கப்பட்ட நிகழ்தகவுகள் :math:`Pr(00)` மற்றும் :math:`Pr(11)` ஆகியவை அந்தந்த எண்ணிக்கைகளை எடுத்து மொத்த ஷாட்களின் எண்ணிக்கையால் வகுக்கப்படுகின்றன.
te_in: గమనించిన సంభావ్యతలు :math:`Pr(00)` మరియు :math:`Pr(11)` సంబంధిత గణనలను తీసుకొని మొత్తం షాట్‌ల సంఖ్యతో భాగించడం ద్వారా గణించబడతాయి.
tr_tr: Gözlemlenen :math:`Pr(00)` ve :math:`Pr(11)` olasılıkları, durumların gözlemlenme miktarlarının toplam deneme miktarına bölünmesiyle hesaplanır.
zh_cn: :math:`Pr(00)` 和 :math:`Pr(11)` 的观测概率是通过分别计数并除以总测量次数来计算的。
zh_tw: 觀察概率 :math:`Pr（00）` 和 :math:`Pr（11）` 的計算是通過分別的計數結果並除以計數結果總數來計算。

source: Try changing the ``shots`` keyword in the ``run()`` method to see how the estimated probabilities change.
bn_bn: কীভাবে সম্ভাবনার ফলাফল পরিবর্তন হয় তা ``run()`` মেথডের মধ্যে ``shots`` কীওয়ার্ডটি পরিবর্তন করার চেষ্টা করে দেখুন।
de_de: Versuchen Sie, das Schlüsselwort ``shots`` in der Methode ``run()`` zu ändern, um zu sehen, wie sich die geschätzten Wahrscheinlichkeiten ändern.
es_un: Intenta cambiar la palabra clave ``shots`` en el método ``run()`` para ver cómo cambian las probabilidades estimadas.
fr_fr: Essayez de changer le mot clé ``shots`` dans la méthode ``run()`` pour voir comment les probabilités estimées changent.
ja_jp: ``run()`` メソッドの ``shots`` 引数を変更して、推定される確率がどのように変化するか見てみましょう。
ml_in: ``run()``-ലെ ``shots``-ന്റെ മൂല്യത്തിനു മാറ്റം വരുത്തി അതിനു അനുസരിചു പ്രോബബിലിറ്റിയിൽ വരുന്ന മാറ്റം നോട്ട ചെയുക്ക​.
pl_pl: Zmieniając słowo kluczowe ``shots`` w metodzie ``run()`` można sprawdzić, jak zmieniają się szacowane wartości prawdopodobieństwa.
pt_un: Tente modificar o argumento ``shots`` no método ``run()`` para ver como as probabilidades estimadas mudam.
ru_ru: Попробуйте изменить ключевое слово ``shots`` в методе ``run()``, чтобы увидеть, как изменяется предполагаемая вероятность.
sw_ke: Jaribu kubadilisha neno msingi la ``shots`` katika mbinu ya ``run()`` kuona jinsi uwezekano wa makadirio hubadilika.
ta_in: மதிப்பிடப்பட்ட நிகழ்தகவுகள் எவ்வாறு மாறுகின்றன என்பதைப் பார்க்க, ``run()`` முறையில் ``shots`` முக்கிய வார்த்தையை மாற்ற முயற்சிக்கவும்.
te_in: అంచనా వేయబడిన సంభావ్యతలు ఎలా మారతాయో చూడటానికి ``run()`` పద్ధతిలో ``shots`` కీవర్డ్‌ని మార్చడానికి ప్రయత్నించండి.
tr_tr: Tahmini olasılıkların nasıl değişeceğini görmek için ` ` run () ` ` yöntemindeki ` ` shots ` ` anahtar sözcüğünü değiştirmeyi deneyin.
zh_cn: 尝试修改 ``run()`` 方法中的 ``shots`` 关键字，以了解估计概率的变化。

source: Next Steps
bn_bn: পরবর্তী ধাপগুলো
de_de: Nächste Schritte
el_gr: Επόμενα Βήματα
es_un: Siguientes Pasos
fr_fr: Étapes Suivantes
ja_jp: 次のステップ
ko_kr: 다음 단계
ml_in: അടുത്തത് എന്ത്?
pl_pl: Kolejne kroki
pt_br: Próximos passos
pt_un: Próximos Passos
ru_ru: Далее
sw_ke: Hatua Zifuatazo
ta_in: அடுத்த படிமுறைகள்
te_in: తదుపరి దశలు
tr_tr: Sonraki Adımlar
vi_vn: Các bước tiếp theo
zh_cn: 下一步
zh_tw: 下一個步骤

source: Now that you have learnt the basics, consider these learning resources:
bn_bn: আপনি প্রাথমিক ধারণাটুকু পেয়েছেন, এরপর নিচের উৎসগুলো থেকে শেখার চেষ্টা করতে পারেনঃ
de_de: Jetzt, wo Sie die Grundlagen gelernt haben, betrachten Sie einmal dieses Lernmaterial:
el_gr: Τώρα που μάθατε τα βασικά, εξετάστε αυτούς τους μαθησιακούς πόρους:
es_un: Ahora que has aprendido los conceptos básicos, considera estos recursos de aprendizaje:
fr_fr: Maintenant que vous avez acquis les bases, vous pouvez continuer avec ces contenus :
ja_jp: 基礎の学習が終わりました。次は、以下の学習リソースがあります。
ko_kr: 이제 기본기를 익혔으므로, 다음 학습 자료들을 참고할 수 있다:
ml_in: അടിസ്ഥാന പാഠങ്ങൾ പൂർത്തിയായി, മുന്നോട്ടു നീങ്ങാൻ താഴെ കൊടുത്തിരിക്കുന്ന ലിങ്കുകൾ സന്ദർശിക്കുക:
pl_pl: Po zapoznaniu się z podstawami, przejdź do następujących zasobów:
pt_br: Agora que você aprendeu o básico, considere esses recursos de aprendizagem:
pt_un: Agora que você aprendeu o básico, considere estes recursos de aprendizagem:
ru_ru: Теперь, прочитав об основах, посмотрите другие обучающие ресурсы:
sw_ke: Kwa kuwa umejifunza misingi, nuia nyenzo hizi za kujifunza:
ta_in: இப்போது நீங்கள் அடிப்படைகளை கற்றுக்கொண்டீர்கள், இந்த கற்றல் வளங்களை கருத்தில் கொள்ளுங்கள்:
te_in: ఇప్పుడు మీరు ప్రాథమికాలను నేర్చుకున్నారు, ఈ అభ్యాస వనరులను పరిగణించండి:
tr_tr: Şimdi temel noktaları öğrendiğinize göre şu öğretici kaynakları değerlendirin:
vi_vn: Bây giờ bạn đã hoàn thành việc học phần cơ bản, hãy thử với các tài liệu học tập sau:
zh_cn: 现在您已经学习了基础知识，可以考虑学习这些学习资源了：

source: `Video series: Coding with Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`_
bn_bn: `ভিডিও সিরিজঃ Coding with Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`__
de_de: `Videoserie: Programmieren mit Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`_
el_gr: `Σειρά βίντεο: Coding με Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`_
es_un: `Serie de videos: Codificando con Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`_
fr_fr: `La série de vidéos : Coding with Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`__
ja_jp: `ビデオ・シリーズ: Coding with Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`_
ko_kr: `비디오 시리즈: Qiskit 으로 코딩하기 <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`_
ml_in: `വീഡിയോ പരമ്പര:ക്വിസ്കിറ്റ് കോഡിംഗ് <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`_
pl_pl: `Seria wideo: Programowanie w Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`_
pt_br: `Série de vídeos: Codando com Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`_
pt_un: `Série de vídeo: Coding with Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`_
ru_ru: `Видео плейлист: Coding with Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`_
sw_ke: `Vipindi vya video: Usimbuaji na Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`__
ta_in: `வீடியோ தொடர்: Coding with Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`_
vi_vn: `Chuỗi video: Coding với Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`_
zh_cn: `视频系列：用Qiskit编程 <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`_
zh_tw: `影片系列：使用 Qiskit作編程<https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`_

source: Qiskit Aer is a high performance simulator framework for quantum circuits. It provides `several backends <apidoc/aer_provider.html>`__ to achieve different simulation goals.
de_de: Qiskit Aer ist ein hochperformantes Simulations-Framework für Quantenschaltkreise. Es stellt `diverse Backends <apidoc/providers/aer/aer_backends.html>`__ für verschiedene Simulationszwecke zur Verfügung.
es_un: Qiskit Aer es un framework de simulación de alto rendimiento para circuitos cuánticos. Proporciona `distintos backends <apidoc/aer_provider.html>`__ para lograr diferentes objetivos de simulación.
ja_jp: Qiskit Aerは、量子回路用の高性能シミュレーターフレームワークです。様々なシミュレーションの目標を達成するために `いくつかのバックエンド <apidoc/aer_provider.html>`__ を提供しています。
pt_un: Qiskit Aer é um framework simulador de alto desempenho para circuitos quânticos. Ele fornece `vários backends <apidoc/aer_provider.html>`__ para atingir diferentes objetivos de simulação.
te_in: Qiskit Aer అనేది క్వాంటం సర్క్యూట్‌ల కోసం అధిక పనితీరు గల సిమ్యులేటర్ ఫ్రేమ్‌వర్క్. ఇది విభిన్న అనుకరణ లక్ష్యాలను సాధించడానికి `అనేక బ్యాకెండ్‌లను <apidoc/aer_provider.html>`__ అందిస్తుంది.
tr_tr: Qiskit Aer kuantum devreleri için yüksek performanslı bir simülatör çerçevesidir ve farklı simülasyon hedeflerini başarıyla gerçekleştirmek için `birçok arka uç <apidoc/aer_provider.html>`__ sağlar.
zh_cn: Qiskit Aer 是量子电路的高性能模拟器框架。 它提供 `多种后端 <apidoc/aer_provider.html>`__ ，以实现不同的模拟目标。

source: If you have issues installing Aer, you can alternatively use the Basic Aer provider by replacing `Aer` with `BasicAer`. Basic Aer is included in Qiskit Terra.
bn_bn: এয়ার ইন্সটল করতে সমস্যা হলে, `Aer` কে `BasicAer` দিয়ে প্রতিস্থাপন করে বেসিক এয়ার প্রোভাইডার ব্যবহার করতে পারেন। বেসিক এয়ার Qiskit টেরার অন্তর্ভুক্ত।
de_de: Wenn Sie Probleme mit der Installation von Aer haben, können Sie alternativ den Basic-Aer-Provider verwenden, indem Sie ` Aer ` durch ` BasicAer ` ersetzen. Basic-Aer ist in Qiskit-Terra enthalten.
el_gr: Αν έχετε προβλήματα με την εγκατάσταση του Aer, μπορείτε εναλλακτικά να χρησιμοποιήσετε τον πάροχο Basic Aer αντικαθιστώντας το `Aer` με το `BasicAer`. Το βασικό Aer περιλαμβάνεται στο Qiskit Terra.
es_un: Si tienes problemas para instalar Aer, puedes utilizar alternativamente el proveedor Basic Aer reemplazando `Aer` por `BasicAer`. Basic Aer está incluido en Qiskit Terra.
fr_fr: En cas de difficulté avec l'installation du composant Aer de Qiskit , vous pouvez utiliser la plateforme Basic Aer en subsituant `BasicAer` à `Aer`. En effet, le composant Basic Aer est inclus dans le module Terra de Qiskit.
ja_jp: Aerのインストールに問題がある場合は、`Aer` を `BasicAer` で置き換えることで、代わりにBasic Aerプロバイダーを利用することができます。Basic AerはQiskit Terraに含まれます。
ko_kr: 만약 Aer 설치에 문제가 있으면, 대신 Basic Aer를 사용할 수 있는데 이는 `Aer` 를 `BasicAer` 로 대체함으로써 가능하다. Basic Aer는 Qiskit Terra에 포함되어 있다.
pl_pl: Jeśli masz problemy z instalacją Aer, możesz alternatywnie użyć symulatora Basic Aer, zastępując `Aer` zwrotem `BasicAer`. Basic Aer jest zawarty w Qiskit Terra.
pt_br: Se você tiver problemas ao instalar o Aer, você pode usar alternativamente, o provedor Basic Aer substituindo `Aer` por `BasicAer`. Basic Aer está incluído no Qiskit Terra.
pt_un: Caso tenha problemas ao instalar o Aer, você pode alternativamente utilizar o provedor Basic Aer substituindo `Aer` por `BasicAer`. Basic Aer está incluso no Qiskit Terra.
sw_ke: Ikiwa una shida ya kusanidi Aer, unaweza kutumia mtoaji wa Basic Aer kwa kubadilisha `Aer` na `BasicAer`. Basic Aer imejumuishwa katika Qiskit Terra.
te_in: మీకు Aer ఇన్‌స్టాల్ చేయడంలో సమస్యలు ఉంటే, మీరు ప్రత్యామ్నాయంగా `Aer`ని `BasicAer`తో భర్తీ చేయడం ద్వారా బేసిక్ ఎయిర్ ప్రొవైడర్‌ని ఉపయోగించవచ్చు. క్విస్కిట్ టెర్రాలో బేసిక్ ఏర్ చేర్చబడింది.
tr_tr: Aer'i yüklemekte sorun yaşıyorsanız, `Aer` yerine `BasicAer` koyarak Basic Aer sağlayıcısını kullanabilirsiniz. Basic Aer, Qiskit Terra içerisinde bulunmaktadır.
vi_vn: Nếu bạn có các vấn đề cài đặt Aer, bạn có thể sử dụng Basic Aer bằng cách thay `Aer` bằng `BasicAer`. BasicAer đươc tích hợp trong Qiskit Terra.
zh_cn: 如果您在安装 Aer 时遇到问题，您也可以通过使用 ``BasicAer`` 来替换 ``Aer``。Basic Aer 已经包含在 Qiskit Terra 中。
zh_tw: 如果您有安裝 Aer 的問題，您可以替換 `Aer` with `BasicAer`，替代使用 Basic Aer 提供者。Basic Aer 則包含在 Qiskit Terra中。

source: ``QasmSimulator``: is the Aer high performance circuit simulator.
bn_bn: ``QasmSimulator``: হচ্ছে এয়ার উচ্চ কর্মদক্ষতাসম্পন্ন বর্তনী (সার্কিট) সিমুলেটর ।
de_de: ` ` QasmSimulator ` `: ist der Aer Hochleistungs Schaltungssimulator.
el_gr: ``QasmSimulator``: είναι ο προσομοιωτής κυκλώματος υψηλής απόδοσης Aer.
es_un: ``QasmSimulator``: es el simulador de circuitos Aer de alto rendimiento.
fr_fr: ``QasmSimulator``: est le simulateur de circuit de haute performance Aer.
ja_jp: ``QasmSimulator`` : Aerによる高性能な回路シミュレーターです。
ko_kr: ``QasmSimulator``: Aer 의 고성능 회로 시뮬레이터이다.
pt_br: ``QasmSimulator``: é o simulador de circuito de alto desempenho Aer.
pt_un: ``QasmSimulator``: é o simulador de circuito de alto desempenho Aer.
sw_ke: ``QasmSimulator``: ni mtambo wa kuiga wa saketi wa Aer wa utendaji wa juu.
vi_vn: ` ` QasmSimulator ` `: là trình mô phỏng mạch hiệu suất cao Aer.
zh_cn: ``QasmSimulator``：是 Aer 高性能电路模拟器。

source: To simulate this circuit, you will use the ``qasm_simulator``. Each run of this circuit will yield either the bit string 00 or 11.
bn_bn: বর্তনী (সার্কিট) সিমুলেশনের জন্য ``qasm_simulator`` ব্যবহার করা হয়। বর্তনীটি (সার্কিট) প্রতিবার কার্যকর করার পর ০০ অথবা ১১ বিটস্ট্রিং ফলাফল পাওয়া যাবে।
de_de: Um diese Schaltung zu simulieren soll der ` ` qasm_simulator ` ` verwendet werden. Jeder Durchlauf dieser Schaltung ergibt entweder die Bitfolge 00 oder 11.
el_gr: Για να προσομοιώσετε αυτό το κύκλωμα, θα χρησιμοποιήσετε το ``qasm_simulator``. Κάθε τρέξιμο αυτού του κυκλώματος θα παράξει είτε το bit string 00 ή 11.
es_un: Para simular este circuito, utilizarás el ``qasm_simulator``. Cada ejecución de este circuito producirá la cadena de bits 00 o 11.
fr_fr: Pour émuler l'execution de ce circuit, il faudra utiliser ``qasm_simulator``. Chaque exécution produira le résultat 00 ou 11 sur deux bits.
ja_jp: 回路をシミュレートするためには、``qasm_simulator`` を使用します。回路の実行毎にビット文字列00もしくは11を生成します。
ko_kr: 이 회로를 시뮬레이션하기 위해 ``qasm_simulator`` 를 사용할 것이다. 각 시뮬레이션 결과로 00 혹은 11의 비트 문자열이 나올 것이다.
ml_in: മുകളിലുള്ള സർക്യൂട്ട് ``qasm സിമുലേറ്റർ`` ഉപയോഗിച്ചാണ് സിമുലേറ്റ് ചെയ്തിരികുനത്. ഈ സർക്യൂട്ട് ഓരൊ തവണ എക്സിക്യൂട്ട് ചെയുബോളൂം 00 അഥവാ 11 എന്ന ഉത്തരം ലഭികുനതാണ്.
pt_br: Para simular este circuito, você usará o ``qasm_simulator``. Cada execução deste circuito produzirá uma palavra binária 00 ou 11.
pt_un: Para simular este circuito, você utilizará o ``qasm_simulator``. Cada execução deste circuito produzirá a sequência de bits 00 or 11.
sw_ke: Kuiga saketi hii, utatumia ``qasm_simulator``. Kila utekelezaji wa saketi hii utatoa tarakimu jozi 00 au 11.
vi_vn: Để mô phỏng mạch lượng tử này, bạn sẽ sử dụng ``qasm_simulator``. Mỗi lần chạy mô phỏng mạch này sẽ cho ra kết quả là chuỗi 00 hoặc 11.
zh_cn: 为了模拟此电路，您将使用 ``qasm_simulator``。每次运行此电路都会生成位字符串00或11。

source: :ref:`Qiskit tutorials<tutorials>`
es_un: :ref:`Tutoriales Qiskit <tutorials>`
fr_fr: :ref:`Tutoriels Qiskit<tutorials>`
ko_kr: :ref:`Qiskit 튜토리얼<tutorials>`
ml_in: :ref:`ക്വിസ്കിറ്റ് ട്യൂട്ടോറിയലുകൾ<tutorials>`
pl_pl: :ref:`Samouczki Qiskit<tutorials>`
pt_br: :ref:`Tutoriais Qiskit<tutorials>`
pt_un: :ref:`Tutoriais do Qiskit<tutorials>`
sw_ke: :ref:`Mazoezi ya Qiskit<tutorials>`
vi_vn: :ref:`Hướng dẫn Qiskit<tutorials>`
zh_cn: :ref:`Qiskit 指南<tutorials>`
zh_tw: :ref:`Qiskit 指導教學<tutorials>`
