Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/intro_tutorial1.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, ja_jp, ko_kr, ml_in, pl_pl, pt_br, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_cn, zh_tw

source: (:download:`Source code <_build/gettext/plot_directive/intro_tutorial1-3.py>`)
ta_in: (:download:`மூலக் குறியீடு <_build/gettext/plot_directive/intro_tutorial1-3.py>`)
te_in: (:download:`సోర్స్ కోడ్<_build/gettext/plot_directive/intro_tutorial1-3.py>`)

source: In this circuit, the qubits are ordered with qubit zero at the top and qubit one at the bottom. The circuit is read left-to-right, meaning that gates which are applied earlier in the circuit show up farther to the left.
bn_bn: এই সার্কিটটি তে, qubit গুলি নির্দিষ্ট ক্রমে সজ্জিত যার মধ্যে qubit ০ সবচেয়ে উপরে এবং qubit ১ সবচেয়ে নিচে উপস্থিত। সার্কিটটি বাম থেকে ডানদিকে পড়া হয়, যার অর্থ সার্কিটের আগে যে যুক্তিবর্তনীগুলি (গেইট) প্রয়োগ করা হয়েছে সেগুলো আর ও বামে অবস্থান করবে।
de_de: In diesem Schaltkreis sind die Qubits so angeordnet, dass sich Qubit 0 oben und Qubit 1 unten befindet. Der Schaltkreis wird von links nach rechts gelesen. Gates welche früher hinzugefügt wurden befinden sich also weiter links.
el_gr: Σε αυτό το κύκλωμα, τα qubits ταξινομούνται με το qubit μηδέν στην κορυφή και το qubit ένα στο κάτω μέρος. Το κύκλωμα διαβάζεται αριστερά προς τα δεξιά, πράγμα που σημαίνει ότι οι πύλες που εφαρμόζονται νωρίτερα στο κύκλωμα εμφανίζονται πιο αριστερά.
es_un: En este circuito, los qubits se ordenan con el qubit cero en la parte superior y el qubit uno en la parte inferior. El circuito se lee de izquierda a derecha, lo que significa que las compuertas que se aplicaron primero en el circuito se muestran más a la izquierda.
fr_fr: Dans ce circuit, le qubit 0 se trouve au dessus du qubit 1. Le circuit se lit de la gauche vers la droite, ce qui signifie que les portes qui se situent sur la gauche du circuit seront appliquées en premier.
ja_jp: この回路では、量子ビットは量子ビット0が上、量子ビット1が下に記述されています。回路は左から右に読み、左に表示されているゲートから順に適用されます。
ko_kr: 이 회로에서는 큐비트 0은 위쪽에, 큐비트 1은 아래쪽에 가도록 정렬되어 있다. 회로는 왼쪽에서 오른쪽으로 읽는데, 이것은 가장 왼쪽의 게이트들이 회로에서 먼저 적용된다는 것을 의미한다.
ml_in: മുകളിലുള്ള സർക്യൂട്ടിൽ, ആദ്യം ക്വിബിറ്റും 0-യും തുടർന്ന് ക്വിബിറ്റും 1-യും പ്രിന്റ് ചെയ്തിരിക്കുന്നു. സർക്യൂട്ട് വായികെഡത്ത് ഇടത്തുനിന്ന് വലത്തോട്ടാണ്. അതാത്ത ആദ്യം ഉപയോഗിച്ച ഗേറ്റ് ആദ്യവും പിന്നീട് ഉപയോഗിച്ച ഗേറ്റ് പിന്നീടും പ്രിന്റ് ചെയ്തിരിക്കുന്നു.
pl_pl: W powyższym obwodzie kubity są uporządkowane, kubit 0 na górze oraz kubit 1 na dole. Obwód należy czytać od lewej do prawej, co oznacza, że bramki zastosowane jako pierwsze w obwodzie znajdują się wcześniej z lewej strony.
pt_br: Neste circuito, os qubits são ordenados com qubit zero na parte superior e qubit um na parte inferior. O circuito é lido da esquerda para a direita, significando que portas que são aplicadas antes no circuito aparecem mais para a esquerda.
pt_un: Neste circuito, os qubits são ordenados com qubit zero na parte superior e qubit um na parte inferior. O circuito é lido da esquerda para a direita, o que significa que as portas que são aplicadas anteriormente no circuito aparecem mais à esquerda.
ru_ru: Здесь кубиты нумеруются сверху вниз, начиная с нулевого. Цепь читается слева направо, то есть вентили (гейты), которые применяются раньше других, расположены левее.
sw_ke: Katika saketi hii, qubits zimeorodheshwa hivi kwamba qubit 0 iko juu na qubit 1 iko chini. Saketi inasomwa kushoto kwenda kulia, ikimaanisha kuwa malango yanayotumiwa mapema kwenye saketi hujitokeza mbali zaidi kushoto.
ta_in: இச்சர்க்யூடில், க்யூபிட்கள் மேலே க்யூபிட் பூஜ்ஜியத்துடனும், கீழே உள்ள ஒன்றை க்யூபிட் செய்யவும் உத்தரவிடப்படுகின்றன. சர்க்யூட் இடது-க்கு-வலது படிக்கப்படுகிறது, அதாவது சர்க்யூடில் முன்பு பயன்படுத்தப்படும் கேட்ஸ் இடது புறம் இன்னும் அதிகமாகக் காட்டுகின்றன.
te_in: ఈ సర్క్యూట్‌లో, క్కుబిట్లు ఎగువన క్కుబిట్ జీరోతో మరియు దిగువన క్కుబిట్ ఒకటితో ఆర్డర్ చేయబడతాయి. సర్క్యూట్ ఎడమ నుండి కుడికి చదవబడుతుంది, అంటే సర్క్యూట్‌లో ముందుగా వర్తించే గేట్లు ఎడమ వైపున చూపబడతాయి.
tr_tr: Bu devrede kubitler, üstte kubit sıfır ve altta kubit bir olacak şekilde sıralanmıştır. Devre soldan sağa doğru okunur, yani daha önce uygulanacak kapılar devrenin daha solunda olanlardır.
vi_vn: Trong mạch lượng tử này, các qubit được sắp xếp theo thứ tự với qubit số 0 ở phía trên và qubit số 1 ở phía dưới. Mạch lượng tử được đọc từ trái sang phải, có nghĩa là các cổng được tác động lên các qubits trước hay sau theo thứ tự từ trái sang phải.
zh_cn: 在此电路中，量子位是自上而下按顺序排列的，量子位 $q_{0}$ 在顶端，量子位 $q_{1}$ 在底端。电路是从左至右读取，这意味着在电路中显示在左侧门会先被使用。
zh_tw: 在此電路中，位元的排列會以qubit 0在頂端 ，並qubit 1在底端。 電路是從左到右讀取的，這意味著在電路中較早應用的閘會顯示由左至右。

source: The default backend for ``QuantumCircuit.draw()`` or ``qiskit.visualization.circuit_drawer()`` is the text backend. However, depending on your local environment you may want to change these defaults to something better suited for your use case. This is done with the user config file. By default the user config file should be located in ``~/.qiskit/settings.conf`` and is a ``.ini`` file.
bn_bn: ``QuantumCircuit.draw()`` অথবা ``qiskit.visualization.circuit_drawer()`` এর ডিফল্ট ব্যাকএন্ড হলো টেক্সট ব্যাকএন্ড। তবে আপনার স্থানীয় কর্মপরিবেশের উপর নির্ভর করে আপনি এই ডিফল্টগুলিকে ব্যবহারিক ক্ষেত্রে প্রয়োজনমত পরিবর্তন করতে পারেন। এই কাজটি ইউজার কনফিগ ফাইল ব্যবহার করে করা হয়। ডিফল্ট ইউজা কনফিগ ফাইলটি ``~/.qiskit/settings.conf``এ থাকে এবং এটি একটি ``.ini`` ফাইল।
de_de: Das Standard-Backend für ``QuantumCircuit.draw()`` oder ``qiskit.visualization.circuit_drawer()`` ist das Text-Backend. Dies kann man, abhängig von der lokalen Entwicklungsumgebung, nach Belieben konfigurieren. Die Konfigurationsdatei dafür befindet sich normalerweise in ``~/.qiskit/settings.config``. Dies ist eine ``.ini``-Datei.
el_gr: Το προεπιλεγμένο σύστημα υποστήριξης για το ``QuantumCircuit.draw()`` ή ``qiskit.visualization.circuit_drawer()`` είναι το σύστημα υποστήριξης κειμένου. Ωστόσο, ανάλογα με το τοπικό περιβάλλον σας, μπορεί να θέλετε να αλλάξετε αυτές τις προεπιλογές σε κάτι καταλληλότερο για την περίπτωση χρήσης σας. Αυτό γίνεται με το αρχείο ρύθμισης χρήστη. Από προεπιλογή, το αρχείο ρυθμίσεων χρήστη θα πρέπει να βρίσκεται στο αρχείο ``~/.qiskit/settings.conf`` και είναι ένα αρχείο ``.ini``.
es_un: El backend predeterminado para ``QuantumCircuit.draw()`` o ``qiskit.visualization.circuit_drawer()`` es el backend de texto. Sin embargo, dependiendo de tu entorno local, es posible que desees cambiar estos valores predeterminados a algo más adecuado para tu caso de uso. Esto se hace con el archivo de configuración del usuario. Por defecto, el archivo de configuración del usuario debe estar ubicado en ``~/.qiskit/settings.conf`` y es un archivo ``.ini``.
fr_fr: Par défaut l'affichage issu de ``QuantumCircuit.draw()`` ou de ``qiskit.visualization.circuit_drawer()`` se fait en mode texte. Toutefois, selon l'environnement dans lequel vous opérez vous pourrez changer ce réglage afin d'obtenir un affichage plus adapté à votre besoin. Ceci se fait à l'aide du fichier de configuration utilisateur de type ``.ini`` qui se trouve dans le répertoire : ``~/.qiskit/settings.conf``.
ja_jp: ``QuantumCircuit.draw()`` 又は ``qiskit.visualization.circuit_drawer()`` のデフォルトのバックエンドは text backendです。あなたのローカル環境によっては、より適切なデフォルトの設定を行う必要があるかもしれません。その場合はuser configファイルの設定を行うことで対応できます。user configファイルは通常 ``~/.qiskit/settings.conf`` 下の ``.ini`` ファイルになります。
ko_kr: ``QuantumCircuit.draw()`` 나 ``qiskit.visualization.circuit_drawer()`` 에 사용되는 기본 백엔드는 텍스트 백엔드이다. 하지만 당신의 로컬 환경에 따라 필요에 맞는 좀 더 적절한 백엔드를 사용하고 싶을 수 있다. 이는 사용자 환경 파일을 통해 변경이 가능하다. 기본적으로 사용자 환경 파일은 ``~/.qiskit/settings.conf`` 디렉토리에 저장되어야 하고 ``.ini`` 확장자를 가져야 한다.
ml_in: ``QuantumCircuit.draw()``-ലും``qiskit.visualization.circuit_drawer()``-ലും ഉപയോഗിക്കുന്ന ഡിഫോൾട്ട് ബാക്കെൻഡ് - ടെക്സ്റ്റ് ബാക്കെൻഡ് ആണ്.എന്നിരുന്നാലും, ലോക്കൽ എവിവർമെന്റിൽ കോഡ് ചെയ്യുമ്പോൾ അൽഗോരിതത്തിനു അനുയോജ്യമായ ബാക്കെൻഡ് തിരഞ്ഞെടുക്കാവുന്നതാണ്. `~/.qiskit/settings.conf`` എന്ന ഫയിലിൽ ഉള്ള user config എന്ന ``.ini`ഫയ​ൽ മുഖാന്തരം ഇത ചെയാവുനതാണ്.
pl_pl: Domyślny backend dla ``QuantumCircuit.draw ()`` lub ``qiskit.visualization.circuit_drawer()`` to backend tekstowy. Jednak w zależności od środowiska lokalnego, można zmienić ustawienia domyślne na bardziej odpowiednie dla danej sytuacji. Zmianę można wprowadzić przy użyciu pliku konfiguracyjnego użytkownika. Domyślnie plik konfiguracyjny użytkownika powinien znajdować się w pliku ``~/.qiskit/settings.conf`` i ma format ``.ini``.
pt_br: O serviço padrão para ``QuantumCircuit.draw()`` ou ``qiskit.visualization.circuit_drawer()`` é o serviço de texto. No entanto, é possível alterar esses padrões para algo mais adequado para o seu ambiente e caso de uso. Isso é feito com o arquivo de configuração do usuário. Por padrão este arquivo fica localizado em ``~/.qiskit/settings.conf`` e possui a extensão ``.ini``.
pt_un: O serviço padrão para ``QuantumCircuit.draw()`` ou ``qiskit.visualization.circuit_drawer()`` é o serviço de texto. No entanto, dependendo do seu ambiente local, você pode querer alterar estes padrões para algo mais apropriado ao seu caso de uso. Isso é feito com o arquivo de configuração do usuário. Por padrão, o arquivo de configuração do usuário deve estar localizado em ``~/.qiskit/settings.conf`` e é um arquivo ``.ini``.
ru_ru: Обычно ``QuantumCircuit.draw()`` или ``qiskit.visualization.circuit_drawer()`` использует текстовую графику. Однако можно выбрать более удобный для вас вид, внеся изменения в файл конфигурации. По умолчанию он расположен в ``~/.qiskit/settings.conf`` и имеет разрешение``.ini``.
sw_ke: Backend ya kaida ya ``QuantumCircuit.draw()`` au ``qiskit.visualization.circuit_drawer()`` ni backend ya maandishi. Walakini, kulingana na mazingira yako ya kienyeji, unaweza kubadilisha kaida hizi kuwa vitu vinavyokufaa wewe zaidi katika matumizi. Hii inafanywa kupitia faili ya usanidi ya mtumiaji. Kwa kaida, faili ya usanidi ya mtumiaji inapaswa kuwa iko kwenye ``~/.qiskit/settings.conf`` na ni faili ya aina ya ``.ini``.
ta_in: ``QuantumCircuit.draw()`` அல்லது ``qiskit.visualization.circuit_drawer()`` க்கான முன்னிருப்பு பின்முனை உரை பின்முனையாகும். இருப்பினும், உங்கள் உள்ளூர் சூழலைப் பொறுத்து, இந்த முன்னிருப்புகளை உங்கள் பயன்பாட்டு வழக்குக்கு மிகவும் பொருத்தமானதாக மாற்ற விரும்பலாம். இது பயனர் உள்வடிவமைப்பு கோப்புடன் செய்யப்படுகிறது. முன்னிருப்பாக பயனர் வடிவமைப்பு கோப்பு ``~/.qiskit/settings.conf`` இல் இருக்க வேண்டும் மற்றும் ``.ini`` கோப்பாக இருக்க வேண்டும்.
te_in: ``QuantumCircuit.draw()`` లేదా ``qiskit.visualization.circuit_drawer()`` కోసం డిఫాల్ట్ బ్యాకెండ్ టెక్స్ట్ బ్యాకెండ్. అయితే, మీ స్థానిక ఎన్విరాన్మెంట్ని బట్టి మీరు ఈ డిఫాల్ట్‌లను మీ వినియోగ సందర్భానికి బాగా సరిపోయేలా మార్చాలనుకోవచ్చు. ఇది వినియోగదారు కాన్ఫిగరేషన్ ఫైల్‌తో చేయబడుతుంది. డిఫాల్ట్‌గా వినియోగదారు కాన్ఫిగ్ ఫైల్ ``~/.qiskit/settings.conf``లో ఉండాలి మరియు ఇది ``.ini`` ఫైల్.
tr_tr: ``QuantumCircuit.draw()`` veya ``qiskit.visualization.circuit_drawer()`` için varsayılan backend metin backendidir. Ancak yerel çevrenize bağlı olarak bu varsayılanları sizin kullanımınıza uygun olacak şekilde değiştirmek isteyebilirsiniz. Bu, kullanıcı yapılandırma dosyası (user config file) ile yapılır. Kullanıcı yapılandırma dosyası varsayılan olarak ``~/.qiskit/settings.conf`` içerisinde konumlandırılmıştır ve bir ``.ini`` dosyasıdır.
vi_vn: Phần backend mặc định cho hàm ``QuantumCircuit.draw()`` hoặc ``qiskit.visualization.circuit_drawer()`` là text backend. Tuy nhiên, tùy vào môi trường trên máy của mình bạn có thể thay đổi cấu hình mặc định này cho phù hợp với nhu cầu của bạn hơn. Điều này thể được làm bằng cách thay đổi file config của người dùng. Theo mặc định file này được đặt ở ``~/.qiskit/settings.conf`` và có định dạng ``.ini``.
zh_cn: ``QuantumCircuit.draw()`` 或 ``qiskit.visualization.circuit_drawer()`` 的默认后端是字符画后端。 但是，根据您的本地环境，您可能希望将这些缺省值更改为更适合您用例的配置。 这时您可以通过修改用户配置文件来实现。 默认情况下，用户配置文件将位于 ``~/.qiskit/settings.conf`` ，并且是一个 ``.ini`` 文件。
zh_tw: ``QuantumCircuit.draw()`` or ``qiskit.visualization.circuit_drawer()``的預設後端為文字後端。視乎您的本端環境而定， 您可能想要將這些預設值變更為更適合使用案例的預設值。這會使用user config file來完成。user config file應預設下位於``~/.qiskit/settings.conf`` 而且是``.ini``的檔案。

source: For example, a ``settings.conf`` file for setting a Matplotlib drawer is:
bn_bn: উদাহরণ স্বরূপ, একটি Matplotlib drawer এর জন্য ব্যবহৃত ``settings.conf`` ফাইল হলোঃ
de_de: Zum Beispiel wird eine Datei ` `settings.conf ` ` zum Festlegen einer Matplotlib-Eigenschaft zum Zeichnen verwendet:
el_gr: Για παράδειγμα, ένα αρχείο ``settings.conf`` για τη ρύθμιση ενός Matplotlib drawer είναι:
es_un: Por ejemplo, un archivo ``settings.conf`` para configurar un dibujador Matplotlib es:
fr_fr: Par exemple, pour que les visualisations utilisent un mode Matplotlib, le fichier``setting.conf`` doit contenir :
ja_jp: 例えば, Matplotlib drawer を設定するための ``settings.conf`` ファイルは：
ko_kr: 예를 들어, Matplotlib 그리기 설정을 위한 ``settings.conf`` 파일은 다음과 같다:
ml_in: ഉദാ: Matplotlib എന്ന ബാക്കെൻഡ് സെലെക്റ്റ് ചെയുനതിന്നുള്ള​ ``settings.conf`ഫയ​ൽ താഴെ കൊടുത്തിരിക്കുന്നു.
pl_pl: Na przykład plik ``settings.conf`` służący do ustawień wyjścia Matplotlib to:
pt_br: Por exemplo, um arquivo ``settings.conf`` para configurar um Matplotlib drawer é:
pt_un: Por exemplo, um arquivo ``settings.conf`` para configurar um drawer do Matplotlib é:
ru_ru: Например так должен выглядеть файл ``settings.conf`` при использовании Mathplotlib:
sw_ke: Kwa mfano, faili ya ``settings.conf`` ya kuweka Matplotlib drawer ni:
ta_in: உதாரணமாக, ``settings.conf`` மேட்ப்ளாட்லிப் வரைபடம் அமைப்பதற்கான கோப்பு:
te_in: ఉదాహరణకు, Matplotlib డ్రాయర్‌ని సెట్ చేయడానికి ``settings.conf`` ఫైల్:
tr_tr: Örneğin, bir Matplotlib çizimcisi ayarlamaya yarayan ``settings.conf`` dosyası:
vi_vn: Ví dụ, file ``settings.conf`` để cài đặt công cụ vẽ cho thư viện Matplotlib là:
zh_cn: 例如，用于设置 Matplotlib 绘制器的 ``settings.conf`` 文件为：
zh_tw: 例如，設定 Matplotlib 繪圖的 ``settings.conf`` 檔是：

source: You can use any of the valid circuit drawer backends as the value for this config, this includes text, mpl, latex, and latex_source.
bn_bn: আপনি যেকোনো সঠিক সার্কিট (বর্তনী) ড্রয়ার ব্যাকএন্ড ব্যবহার করতে পারেন, এর মধ্যে text, mpl, latex, আর latex_source অন্তর্ভুক্ত রয়েছে।
de_de: Jedes verfügbare gültige Schaltkreis-Zeichner-Backend kann verwendet werden wie zum Beispiel text, mpl, latex und latex_source.
el_gr: Μπορείτε να χρησιμοποιήσετε οποιοδήποτε από τα έγκυρα συστήματα υποστήριξης σχεδιασμού κυκλωμάτων ως την τιμή για αυτή τη ρύθμιση, αυτό περιλαμβάνει κείμενο, mpl, latex και latex_source.
es_un: Puedes usar cualquiera de los backends de visualización de circuitos válidos para esta configuración, esto incluye text, mpl, latex y latex_source.
fr_fr: Vous pouvez utiliser les modes de visualisation suivants : text, mpl, latex, et latex_source.
ja_jp: このconfigには、有効な circuit drawer バックエンドであればどれでも指定することができます。これらには text, mpl, latex, そして latex_source が含まれます。
ko_kr: 이 설정의 값으로 아무 종류의 유효한 회로 그리기 백엔드를 사용할 수 있는데, text, mpl, latex, 그리고 latex_source 등이 이에 해당된다.
pl_pl: Możesz użyć dowolnego spośród dostępnych formatów wyjściowych jako wartości dla tej konfiguracji, m.in. text, mpl, latex i latex_source.
pt_br: Você pode usar qualquer um dos serviços de desenho de circuitos como valor para esta configuração, o que inclui text, mpl, latex e latex_source.
pt_un: Você pode utilizar qualquer um dos serviços de desenho de circuito válidos como o valor para esta configuração, isso inclui text, mpl, latex, e latex_source.
ru_ru: Вы можете выбрать любой разрешенный стиль, задавая значение переменной одним из вариантов text, mpl, latex или latex_source.
sw_ke: Unaweza kutumia backends zozote za circuit drawer kama kigezo cha usanidi huu, ikiwa ni pamoja na text, mpl, latex, na latex_source.
ta_in: இந்த கட்டமைப்பிற்கான மதிப்பாக நீங்கள் செல்லுபடியாகும் சர்க்யூட் டிராயர் backendல் எதையும் பயன்படுத்தலாம், இதில் உரை, எம்பிஎல், லேடெக்ஸ் மற்றும் லேடெக்ஸ்_சோர்ஸ் ஆகியவை அடங்கும்.
te_in: మీరు ఈ కాన్ఫిగర్ కోసం చెల్లుబాటు అయ్యే సర్క్యూట్ డ్రాయర్ బ్యాకెండ్‌లలో దేనినైనా విలువగా ఉపయోగించవచ్చు, ఇందులో text, mpl, latex మరియు latex_source ఉంటాయి.
tr_tr: Bu yapılandırmanın değeri olarak, text, mpl, latex, ve latex_source dahil tüm geçerli devre çizimci backendlerini kullanabilirsiniz.
vi_vn: Bạn cũng có thể sử dụng bất kì backend vẽ mạch đúng chuẩn như giá trị cho config, nó bao gồm text, mpl, latex và latex_source.
zh_cn: 您可以使用任何有效的电路绘制器后端作为此配置的值，其中包括 text、mpl、latex 和 latex_source。
zh_tw: 您可以使用任何有效的電路繪圖後端作為此配置的值，這包括文字、 mpl、latex和 latex_source。

source: Step 5 : Simulate the Experiment
bn_bn: পদক্ষেপ ৫ঃ পরীক্ষাটি অনুকরণ (সিমুলেট) করুন
de_de: Schritt 5 : Ein Experiment simulieren
el_gr: Βήμα 5: Προσομοίωση του πειράματος
es_un: Paso 5: Simular el Experimento
fr_fr: Étape 5 : Emulation du calcul
ja_jp: ステップ 5 : 実験のシミュレーション
ko_kr: 5단계: 실험 시뮬레이션 하기
ml_in: സ്റ്റെപ്പ് 5: സ്ർക്യൂട്ട് സ്റ്റിമുലേറ്റ് ചെയ്യൽ
pl_pl: Krok 5: Symulacja eksperymentu
pt_br: Etapa 5: Simular o Experimento
pt_un: Passo 5: Simular o experimento
ru_ru: Шаг 5. Симуляция эксперимента
sw_ke: Hatua ya 5 : Igizia majaribio ya utafiti wa kisayansi
ta_in: படி 5 : பரிசோதனையை உருவகப்படுத்தவும்
te_in: Step 5: ప్రయోగాన్ని సిమ్యులేట్ చేయండి
tr_tr: Adım 5: Deneyi Simüle Etmek
vi_vn: Bước 5: Mô phỏng thí nghiệm
zh_cn: 步骤 5 ：模拟实验
zh_tw: 步驟 5 ：模擬實驗

source: To simulate this circuit, you will use the ``AerSimulator``. Each run of this circuit will yield either the bit string 00 or 11.
ta_in: இந்த சுற்று உருவகப்படுத்த, நீங்கள் ``AerSimulator`` ஐப் பயன்படுத்துவீர்கள். இந்த சர்க்யூட்டின் ஒவ்வொரு ஓட்டமும் பிட் சரம் 00 அல்லது 11 ஐக் கொடுக்கும்.
te_in: ఈ సర్క్యూట్‌ను అనుకరించడానికి, మీరు ``AerSimulator``ని ఉపయోగిస్తారు. ఈ సర్క్యూట్ యొక్క ప్రతి పరుగు బిట్ స్ట్రింగ్ 00 లేదా 11ని ఇస్తుంది.
tr_tr: Bu devreyi simüle etmek için ``AerSimulator`` kullanacaksınız. Bu devrenin her çalışması, 00 veya 11 bit dizisini verecektir.

source: (:download:`Source code <_build/gettext/plot_directive/intro_tutorial1-4.py>`)
ta_in: (:download:`மூலக் குறியீடு <_build/gettext/plot_directive/intro_tutorial1-4.py>`)
te_in: (:download:` Source code <_build/gettext /plot_directive/త్మ_tutorial1-4.py>`)

source: As expected, the output bit string is 00 approximately 50 percent of the time. The number of times the circuit is run can be specified via the ``shots`` argument of the ``execute`` method. The number of shots of the simulation was set to be 1000 (the default is 1024).
bn_bn: প্রায় ৫০ শতাংশ সময় আউটপুট বিট স্ট্রিংটি ০০ হয়। ``execute`` মেথডের ``shots`` আর্গুমেন্টটি দিয়ে বর্তনীটি (সার্কিট) কতবার রান (কার্যকর) করা হবে তা ঠিক করা হয়। সিমুলেশনের শট সংখ্যা এক্ষেত্রে ১০০০ (ডিফল্ট হলো ১০২৪)।
de_de: Wie erwartet, wird die Bit-Zeichenkette 00 in ungefähr 50 Prozent der Fälle ausgegeben. Die Anzahl der Fälle, in denen die Schaltung ausgeführt wird, kann über das Argument ``shots`` der Methode``execute`` festgelegt werden. Die Anzahl der Shots der Simulation wurde auf 1000 eingestellt (die Standardeinstellung ist 1024).
el_gr: Όπως αναμένεται, η συμβολοσειρά bit εξόδου είναι 00 περίπου 50 τοις εκατό του χρόνου. Ο αριθμός των φορών που εκτελείται το κύκλωμα μπορεί να καθοριστεί μέσω του ορίσματος ``shots`` της μεθόδου ``execute``. Ο αριθμός εκτελέσεων της προσομοίωσης ορίστηκε να είναι 1000 (η προεπιλογή είναι 1024).
es_un: Como era de esperar, la cadena de bits de salida es 00 aproximadamente el 50 por ciento del tiempo. El número de veces que se ejecuta el circuito se puede especificar mediante el argumento ``shots`` del método ``execute``. El número de iteraciones de la simulación se estableció en 1000 (el valor predeterminado es 1024).
fr_fr: Comme on pouvait s'y attendre, la sortie 00 apparaît approximativement dans 50 pourcent des cas. Le nombre de fois où le circuit doit être exécuté peut être spécifié avec l'argument ``shots`` de la méthode ``execute``. Par défaut cet argument à la valeur 1024, dans cet exemple sa valeur a été réglée à 1000.
ja_jp: 期待通りにビット文字列の出力が00になるのはだいたい50％です。回路の実行回数は ``execute`` メソッドの ``shots`` 引数で指定できます。このシミュレーションの実行回数は1000(デフォルトは1024) に設定されています。
ko_kr: 예상한 대로 출력 비트 문자열 00은 대략 50 퍼센트의 확률로 확인할 수 있었다. 회로가 몇 번 실행될 것인가는 ``execute`` 함수의 ``shots`` 인수로 설정할 수 있다. 이 시뮬레이션의 샷 수는 1000으로 설정되었다 (기본값은 1024이다).
ml_in: പ്രതീക്ഷിച്ച പോലെ, ഏതാണ്ട് പകുതിയോളം ഉത്തരം 00 ആണ്. എത്ര ഉത്തരങ്ങൾ ലഭിക്കണം എന്ന് തീരുമാനിക്കുന്നത്ത് ``shots`` ആണ്. ഇവിടെ ഷോട്സിന്റെ വാല്യു 1000 ആണ്(ഡിഫോൾട്ട് വാല്യു 1024 ആണ് ).
pl_pl: Zgodnie z przewidywaniami wartość wyjściowa dla ciągu bitów jest równa 00 w około 50% przypadków. Liczba uruchomień obwodu może być określona za pomocą argumentu ``shots`` metody ``execute``. Liczba powtórzeń symulacji została ustawiona na 1000 (domyślnie 1024).
pt_br: Como esperado, a palavra binária de saída é igual a 00 aproximadamente 50% das vezes. O número de vezes que o circuito é executado pode ser especificado através do argumento ``shots``, do método ``execute``. O número de repetições da simulação foi configurado como 1000 (o padrão é 1024).
pt_un: Como esperado, a saída da sequência de bits é 00 aproximadamente 50 por cento do tempo. O número de vezes que o circuito é executado pode ser especificado por meio do argumento ``shots`` do método ``execute``. O número de execuções da simulação foi definido como 1000 (o padrão é 1024).
ru_ru: Как и ожидалось, строки 00 и 11 были получены приблизительно равное число раз. Количество запусков можно варьировать с помощью параметра ``shots`` в методе ``execute``. В данном случае оно было установлено равным 1000 (по умолчанию 1024).
sw_ke: Kama inavyotarajiwa, pato la tarakimu jozi ni 00 takriban asilimia 50 kila wakati. Idadi ya nyakati ambazo saketi inatekelezwa zinaweza kutajwa kupitia kigezo cha ``shots`` cha mbinu ya ``execute``. Idadi ya utekelezaji wa uigaji uliwekwa kuwa 1000 (kaida huwa 1024).
ta_in: எதிர்பார்த்தபடி, வெளியீடு பிட் string நேரம் சுமார் 50 சதவீதம் ஆகும். சர்க்யூட் எத்தனை முறை இயங்குகிறது என்பதை ``ஷாட்கள்`` என்ற ``execute`` முறையின் விவாதம் மூலம் குறிப்பிடலாம். உருவகப்படுத்துதல் ஷாட்களின் எண்ணிக்கை 1000 ஆக அமைக்கப்பட்டது (முன்னிருப்பு 1024).
te_in: ఊహించిన విధంగా, అవుట్‌పుట్ బిట్ స్ట్రింగ్ 00 సమయం సుమారు 50 శాతం. ``ఎగ్జిక్యూట్`` పద్ధతి యొక్క ``షాట్స్`` ఆర్గ్యుమెంట్ ద్వారా సర్క్యూట్ ఎన్నిసార్లు అమలు చేయబడుతుందో పేర్కొనవచ్చు. అనుకరణ యొక్క షాట్‌ల సంఖ్య 1000గా సెట్ చేయబడింది (డిఫాల్ట్ 1024).
tr_tr: Beklendiği gibi çıktılarının yaklaşık yarısı 00 bit dizisinden oluşuyor. Devrenin kaç kere çalıştırılacağı ``execute`` metodunun ``shots`` argümanı aracılığıyla belirlenebilir. Simülasyonun deneme sayısı 1000 olarak belirlenmişti (varsayılan 1024).
vi_vn: Như dự kiến, kết chuỗi bit đầu ra 00 là xấp xỉ 50% thời gian. Số lần chạy mạch có thể được xác định thông qua sô ́ ``shots`` thực thi của phương thức ``execute``. Số shots của mô phỏng được đặt là 1000 (mặc định là 1024).
zh_cn: 正如预期的那样，输出位字符串约占总时间的50%。 电路运行的次数可以通过 ``execute`` 方法的 ``shots`` 参数指定。 模拟测量次数设置为 1000 (默认为 1024)。
zh_tw: 如預期一樣，輸出位元字串約為 00 時的 50 % 。 可以透過 ``execute`` 方法的 參數``shots ` 來指定電路執行的次數。 模擬的參數次數設定為 1000（預設值為 1024）。
