Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/intro_tutorial1.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, ja_jp, ko_kr, ml_in, pl_pl, pt_br, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, vi_vn, zh_cn, zh_tw

source: Introduction to Qiskit
bn_bn: Qiskit পরিচিতি
de_de: Einführung in Qiskit
el_gr: Εισαγωγή στο Qiskit
es_un: Introducción a Qiskit
fr_fr: Introduction à Qiskit
ja_jp: Qiskit 入門
ko_kr: Qiskit 소개
ml_in: ക്വിസ്കിറ്റ്നെ പരുജയപെടാം
pl_pl: Wprowadzenie do Qiskit
pt_br: Introdução ao Qiskit
pt_un: Introdução ao Qiskit
ru_ru: Введение в Qiskit
sw_ke: Utangulizi wa Qiskit
ta_in: Qiskit முன்னுரை
te_in: Qiskit కు పరిచయం
tr_tr: Qiskit'e Giriş
vi_vn: Giới thiệu về Qiskit
zh_cn: Qiskit 简介
zh_tw: Qiskit的簡介

source: When using Qiskit a user workflow nominally consists of following four high-level steps:
bn_bn: Qiskit ব্যবহারের কর্মপ্রবাহ​ নিম্নলিখিত চারটি উচ্চ-স্তরের ধাপে গঠিতঃ
de_de: Bei der Verwendung von Qiskit besteht ein Benutzerworkflow nominell aus den folgenden vier high-level Schritten:
el_gr: Όταν χρησιμοποιείτε το Qiskit, μια ροή εργασιών χρήστη αποτελείται από τα ακόλουθα τέσσερα βήματα:
es_un: Cuando se usa Qiskit, el flujo de trabajo de un usuario consiste nominalmente en los siguientes cuatro pasos de alto nivel:
fr_fr: Lors de l'utilisation de Qiskit, on utilise généralement les quatre étapes principales suivantes :
ja_jp: Qiskitを使用する際、ユーザーのワークフローは主に以下4つの大まかなステップから構成されます。
ko_kr: Qiskit을 사용하는 경우 사용자 워크플로우는 다음의 네 가지 상위 레벨 단계로 구성된다.
ml_in: ക്വിസ്കിറ്റ് വ​ർക്ക്ഫ്ലൊയിൽ പ്രധാനമായി താഴെ പറയുന്ന നാല് ഘട്ടങൾ ആണ് ഉള്ളത്:
pl_pl: Schemat pracy z Qiskit zazwyczaj składa się z następujących czterech ogólnych kroków:
pt_un: Ao usar o Qiskit um fluxo de trabalho do usuário nominalmente consiste em seguir quatro etapas de alto nível:
ru_ru: При работе с Qiskit последовательность действий можно формально разбить на четыре основные стадии:
sw_ke: Unapotumia Qiskit mtiririko wa kazi wa mtumiaji hujumuisha hatua nne za kiwango cha juu:
ta_in: Qiskit பயன்படுத்தும் போது ஒரு பயனர் பணிப்பாய்வு பெயரளவில் நான்கு உயர் மட்ட படிகளைப் பின்பற்றுகிறது:
te_in: Qiskitని ఉపయోగిస్తున్నప్పుడు వినియోగదారు వర్క్‌ఫ్లో నామమాత్రంగా కింది నాలుగు ఉన్నత-స్థాయి దశలను కలిగి ఉంటుంది:
tr_tr: Qiskit 'i kullanırken kullanıcı iş akışı, aşağıdaki dört yüksek seviyeli adımdan oluşur:
zh_cn: 用户在使用 Qiskit 时，操作流程通常由以下四个高阶步骤组成：
zh_tw: 在使用 Qiskit 時，使用者工作流程名義上是由下列四個高階步驟組成：

source: **Build**: Design a quantum circuit(s) that represents the problem you are considering.
bn_bn: **Build**: একটি কোয়ান্টাম বর্তনী (সার্কিট) এর পরিকল্পনা যা আপনার বিবেচ্য কোনো সমস্যার প্রতিনিধিত্ব করে।
de_de: **Build**: Entwerfen Sie eine Quantenschaltung(en), die das von Ihnen betrachtete Problem darstellt.
el_gr: **build**: Σχεδιάστε ένα κβαντικό κύκλωμα (ή κυκλώματα) που αντιπροσωπεύει το πρόβλημα που εξετάζετε.
es_un: **Construir**: Diseña uno o varios circuitos cuánticos que representen el problema que estás considerando.
fr_fr: **Construction**: mise au point d'un circuit quantique qui représente le problème à traiter.
ja_jp: **ビルド**：検討している問題を表す量子回路を設計します。
ko_kr: **빌드**: 사용자가 고려하고 있는 문제를 나타내는 양자 회로(들)을 설계한다.
ml_in: **Build**: അനുയോജ്യമായ ക്വാണ്ടം സർക്യൂട്ട് (കൾ) രൂപകൽപ്പന ചെയ്യുക.
pl_pl: **Budowanie**: Zaprojektuj jeden lub więcej obwodów kwantowych, przedstawiających interesujący cię problem.
pt_br: **Construir**: Crie circuito(s) quântico(s) que representem o problema que você está considerando.
pt_un: **Construir**: Projete circuito (s) quântico (s) que represente o problema que você está considerando.
ru_ru: **Создание**: Проектирование квантовой цепи (цепей) для рассматриваемой задачи.
sw_ke: **Jenga**: Buni saketi ya kwanta inayowakilisha tatizo unalozingatia.
ta_in: **கட்டு**: நீங்கள் கருத்தில் கொள்ளும் சிக்கலைக் குறிக்கும் குவாண்டம் சர்க்யூட்(கள்) வடிவமைக்கவும்.
te_in: **నిర్మించు**: మీరు పరిశీలిస్తున్న సమస్యను సూచించే క్వాంటం సర్క్యూట్(ల)ని రూపొందించండి.
tr_tr: **Oluştur**: Üzerine düşündüğün problemi temsil eden bir kuantum devre(ler) tasarla.
vi_vn: **Build**: Thiết kế một hoặc nhiều mạch lượng tử biểu diễn cho vấn đề bạn đang muốn giải quyết.
zh_cn: **Build**：为目标问题设计一个（或多个）量子电路。
zh_tw: **構建**： 設計一個（或多於一個）量子電路即代表您正在考慮的問題。

source: **Compile**: Compile circuits for a specific quantum service, e.g. a quantum system or classical simulator.
bn_bn: **Compile (সংকলন)**: নির্দিষ্ট কোয়ান্টাম পরিষেবার জন্য বর্তনী (সার্কিট) সংকলন, যেমন একটি কোয়ান্টাম ব্যবস্থা বা ধ্রুপদী (ক্লাসিক্যাল) সিমুলেটর।
de_de: ** Compile**: Kompiliert Schaltungen für einen bestimmten Quantendienst, z.B. ein Quantensystem oder einen klassischer Simulator.
el_gr: **Compile**: Μεταγλωττίσετε κυκλώματα για μια συγκεκριμένη κβαντική υπηρεσία, π.χ. ένα κβαντικό σύστημα ή κλασικό προσομοιωτή.
es_un: **Compilar**: Compila circuitos para un servicio cuántico específico, por ejemplo un sistema cuántico o un simulador clásico.
fr_fr: **Compilation** : Compiler des circuits pour un service quantique spécifique, par exemple un système quantique ou un simulateur classique.
ja_jp: **コンパイル**：特定の量子サービス（量子システムや古典シミュレーターなど）のために回路をコンパイルします。
ko_kr: **컴파일**: 특정 양자 서비스를 위한 회로를 컴파일한다 (예: 양자 시스템 또는 고전 시뮬레이터).
ml_in: **Compile**: ക്വാണ്ടം സിസ്റ്റങ്ങൾ അല്ലെങ്കിൽ ക്ലാസിക്കൽ സിമുലേറ്റർ പോലുള്ള ക്വാണ്ടം സേവനങ്ങളിൽ നിന്ന് അനുയോജ്യമായത് ഉപയോഗിച്ച് സർക്യൂട്ട് കംപൈൽ ചെയ്യുക.
pl_pl: **Kompilacja**: Skompiluj obwody dla konkretnego środowiska kwantowego, np. komputera kwantowego lub klasycznego symulatora.
pt_br: **Compilação**: Compile circuitos para um serviço quântico específico, por exemplo, um sistema quântico ou um simulador clássico.
pt_un: **Compilar**: Compila circuitos para um serviço quântico específico, por exemplo, um sistema quântico ou simulador clássico.
ru_ru: **Компиляция**: Перевод на язык конкретного устройства, например квантовой системы или классического симулятора.
sw_ke: **Compile**: Compile saketi kulingana na huduma maalum ya kwanta, kama vile mfumo wa kwanta au mtambo wa kuiga wa kiklasiki.
ta_in: **Compile**: ஒரு குறிப்பிட்ட குவாண்டம் சேவைக்கான சர்க்யூட்களைத் தொகுக்கவும், எ.கா. குவாண்டம் அமைப்பு அல்லது கிளாசிக்கல் சிமுலேட்டர்.
te_in: **కంపైల్**: నిర్దిష్ట క్వాంటం సేవ కోసం సర్క్యూట్‌లను కంపైల్ చేయండి, ఉదా. క్వాంటం సిస్టమ్ లేదా క్లాసికల్ సిమ్యులేటర్.
tr_tr: **Derle**: Devreleri belirli bir kuantum hizmeti için derle, örneğin bir kuantum sistem ya da klasik simülatör için.
vi_vn: ** Compile**: Biên dịch các mạch cho một dịch vụ lượng tử cụ thể, ví dụ như một hệ lượng tử hoặc mô phỏng cổ điển.
zh_cn: **Compile**：为特定的量子服务编译电路。例如：量子系统或经典模拟器。
zh_tw: **編譯**： 為特定的量子服務編譯電路，例如一個量子系統或經典的模擬器。

source: **Run**: Run the compiled circuits on the specified quantum service(s). These services can be cloud-based or local.
bn_bn: **Run (চালানো)**: নির্দিষ্ট কোয়ান্টাম পরিষেবায় সংকলিত বর্তনীগুলি (সার্কিট) রান করা বা চালানো। এই পরিষেবাগুলি ক্লাউড-ভিত্তিক বা স্থানীয় হতে পারে।
de_de: **Run**: Führt die kompilierten Schaltkreise auf dem/den angegebenen Quantendienst(en) aus. Diese Dienste können Cloud-basiert oder lokal sein.
el_gr: **Run**: Εκτελέστε τα μεταγλωττισμένα κυκλώματα στις καθορισμένες κβαντικές υπηρεσία(ες). Αυτές οι υπηρεσίες μπορούν να βασίζονται σε cloud ή τοπικά.
es_un: **Ejecutar**: Ejecuta los circuitos compilados en los servicios cuánticos especificados. Estos servicios pueden estar basados en la nube o ser locales.
fr_fr: **Exécution** : Exécutez les circuits compilés sur le(s) service(s) quantique spécifié(s). Ces services peuvent être obtenus au travers du Cloud ou localement.
ja_jp: **実行**：コンパイルされた回路を、指定された量子サービス上で実行します。これらのサービスは、クラウドベースでもローカルでも構いません。
ko_kr: **실행**: 지정된 양자 서비스에서 컴파일된 회로를 실행한다. 이러한 서비스는 클라우드 기반 또는 로컬일 수 있다.
ml_in: **Run**: കംപൈൽ ചെയ്ത​ സർക്യൂട്ടുകൾ നിർദ്ദിഷ്ട ക്വാണ്ടം സേവനത്തിൽ (കൾ) പ്രവർത്തിപ്പിക്കുക. ഈ സേവനങ്ങൾ ക്ലൗഡ് അധിഷ്ഠിതമോ പ്രാദേശികമോ ആകാം.
pl_pl: **Uruchamianie**: Uruchom skompilowane obwody w wybranym środowisku kwantowym. Środowisko może być lokalne albo znajdować się na chmurze.
pt_br: **Execute**: execute os circuitos compilados no serviço(s) quântico especificado. Esses serviços podem ser na nuvem ou locais.
pt_un: **Execute**: execute os circuitos compilados no serviço(s) quântico especificado. Esses serviços podem ser na nuvem ou locais.
ru_ru: **Запуск**: Запуск на нем полученной собранной цепи. Доступ при этом может осуществляться как облачно, так и локально.
sw_ke: **Tekeleza**: Endesha saketi zilizokusanywa katika huduma ya kwanta iliyonuiwa. Huduma hizi zaweza kuwa zimehifadhiwa kwenye wingu au kikienyeji.
ta_in: **Run**: குறிப்பிட்ட குவாண்டம் சேவையில்(களில்) compile செய்த சர்க்யூட்களை இயக்கவும். இந்த சேவைகள் மேகக்கணி சார்ந்தவை அல்லது உள்ளூர்.
te_in: **రన్**: పేర్కొన్న క్వాంటం సర్వీస్(ల)లో కంపైల్డ్ సర్క్యూట్‌లను రన్ చేయండి. ఈ సేవలు క్లౌడ్ ఆధారితంగా లేదా స్థానికంగా ఉండవచ్చు.
tr_tr: **Çalıştır**: Belirtilen kuantum hizmet(ler)inde derlenen devreleri çalıştırın. Bu hizmetler bulut tabanlı ya da yerel olabilir.
vi_vn: ** Run**: Chạy các mạch đã được biên dịch trên dịch vụ lượng tử đã xác định. Các dịch vụ này có thể là dựa trên đám mây hoặc cục bộ.
zh_cn: **Run**：在指定的一个（或多个）量子服务上运行编译的电路。这些服务可能是基于云端的或本地的。
zh_tw: **執行 **：在指定的量子服務上執行已編譯的電路。 這些服務可以是雲端型或本端服務。

source: **Analyze**: Compute summary statistics and visualize the results of the experiments.
bn_bn: **Analyze (বিশ্লেষণ)**: সংক্ষিপ্তসার পরিসংখ্যান গণনা করা এবং পরীক্ষাগুলির ফলাফলগুলি দৃশ্যায়িত করা।
de_de: **Analyze**: Berechnet zusammenfassende Statistiken und visualisiert die Ergebnisse der Experimente.
el_gr: **Analyze**: Υπολογισμός στατιστικών στιχείων και απεικόνιση των αποτελεσμάτων των πειραμάτων.
es_un: **Analizar**: Calcula estadísticas resumidas y visualiza los resultados de los experimentos.
fr_fr: **Analyse**: calculer les valeurs statistiques et visualiser les résultats de l'exécution.
ja_jp: **分析**：統計情報を計算し、実験結果を可視化します。
ko_kr: **분석**: 요약 통계를 계산하고 실험 결과를 시각화한다.
ml_in: **Analyze**: പരീക്ഷണങ്ങളുടെ ഫലങ്ങൾ ദൃശ്യവൽക്കരിക്കുകയും അവയി​​ൽ നിന്ന സ്റ്റാറ്റിസ്റ്റിക്ക​ൽ നിഘമനങൾ പുറപെടുവികുഖയും ചെയ്യുക.
pl_pl: **Analiza**: Oblicz statystyki podsumowujące i wizualizuj wyniki eksperymentów.
pt_br: **Analisar**: Calcule estatísticas sumarizadas e visualize os resultados dos experimentos.
pt_un: **Analisar**: Calcule estatísticas resumidas e visualize os resultados dos experimentos.
ru_ru: **Анализ**: Сбор статистических данных и визуализация результатов.
sw_ke: **Changanua**: Fanya hesabu ya muhtasari wa takwimu na upige taswira ya matokeo ya majaribio.
ta_in: **Analyze**: சுருக்கமான புள்ளிவிவரங்களைக் கணக்கிட்டு, பரிசோதனைகளின் முடிவுகளைக் காட்சிப்படுத்துங்கள்.
te_in: **విశ్లేషణ**: సారాంశ గణాంకాలను గణించండి మరియు ప్రయోగాల ఫలితాలను దృశ్యమానం చేయండి.
tr_tr: **Analiz Et**: Özet istatistikleri hesapla ve denemelerin sonuçlarını görselleştir.
vi_vn: ** Analyze**: Tính toán các chỉ số thống kê và hiển thị các kết quả thí nghiệm.
zh_cn: **Analyze**：计算汇总统计数据，并将实验结果可视化。
zh_tw: **分析 **：計算摘要統計量，並視覺化實驗的結果。

source: Here is an example of the entire workflow, with each step explained in detail in subsequent sections:
bn_bn: এখানে সম্পূর্ণ ব্যাপারটির একটি উদাহরণ দেওয়া হলো, যার প্রতিটি ধাপ পরবর্তীতে বিশদভাবে ব্যাখ্যা করা হয়েছেঃ
de_de: Hier ist ein Beispiel für den gesamten Workflow, wobei jeder Schritt in folgenden Abschnitten ausführlich erläutert wird:
el_gr: Εδώ είναι ένα παράδειγμα ολόκληρης της ροής εργασίας, με κάθε βήμα να εξηγείται λεπτομερώς στις επόμενες ενότητες:
es_un: A continuación, se muestra un ejemplo de todo el flujo de trabajo, con cada paso explicado en detalle en las secciones siguientes:
fr_fr: Voici un exemple de cette suite d'étapes, chacune sera expliquée en détails dans les sessions suivantes:
ja_jp: 以下にワークフロー全体の例を示します。各ステップの詳細は後のセクションで説明します。
ko_kr: 다음 항목에서 자세한 설명과 함께 각각의 단계와 전체 작업 흐름을 보여주는 예제가 있다.
ml_in: ഒരു ഉദാഹരണം താഴെ കൊടുത്തിരിക്കുന്നു. ഉദാഹരണത്തിലെ ഓരോ ഘട്ടവും തുടർന്നുള്ള വിഭാഗങ്ങളിൽ വിശദമായി വിവരിക്കുന്നു:
pl_pl: Poniżej znajduje się przykład schematu działania, gdzie każdy krok objaśniono szczegółowo w kolejnych sekcjach:
pt_br: Aqui está um exemplo de um fluxo de utilização completo, com explicação detalhada de cada etapa, nas sessões subsequentes:
pt_un: Aqui é exibido um exemplo de todo o workflow, com cada passo explicado em detalhes nas seções subsequentes:
ru_ru: Приведем пример полного рабочего процесса с последующим подробным разбором этапов:
sw_ke: Hapa kuna mfano wa mtiririko mzima wa kazi, na kila hatua imeelezewa kwa undani katika sehemu zinazofuata:
ta_in: ஒவ்வொரு அடியும் அடுத்தடுத்த பிரிவுகளில் விரிவாக விளக்கப்பட்டுள்ள நிலையில், முழு பணிப்பாய்வின் ஒரு உதாரணம் இங்கே:
te_in: మొత్తం వర్క్‌ఫ్లో యొక్క ఉదాహరణ ఇక్కడ ఉంది, ప్రతి దశ తదుపరి విభాగాలలో వివరంగా వివరించబడింది:
tr_tr: Burası sonraki bölümlerde her adımının detaylı şekilde anlatılacağı iş akışının örneğidir:
vi_vn: Đây là một ví dụ của toàn bộ luồng công việc, với mỗi bước được giải thích chi tiết ở các phần sau:
zh_cn: 以下是整个操作流程的示例，每个步骤在后续小节中详细说明：
zh_tw: 以下是整個工作流程的範例，每一個步驟在下一節中詳細說明：

source: (:download:`Source code <_build/gettext/plot_directive/intro_tutorial1-1.py>`)
ta_in: (:download:` மூல குறியீடு <_build/gettext/plot_directive/आत्मा_tutorial1-1.py> `)
te_in: (:download:`సోర్స్ కోడ్ <_build/gettext/plot_directive/intro_tutorial1-1.py>`)

source: (:download:`Source code <_build/gettext/plot_directive/intro_tutorial1-2.py>`)
ta_in: (:download:`மூலக் குறியீடு <_build/gettext/plot_directive/intro_tutorial1-2.py>`)
te_in: (:download:`సోర్స్ కోడ్ <_build/gettext/plot_directive/intro_tutorial1-2.py>`)

source: Workflow Step--by--Step
bn_bn: ধাপে ধাপে Qiskit এর কার্যপ্রণালি
de_de: Workflow Schritt für Schritt
el_gr: Ροής Εργασίας Βήμα-Βήμα
es_un: Flujo de Trabajo Paso a Paso
fr_fr: Étape par étape
ja_jp: ワークフローのステップバイステップ
ko_kr: 순차적 작업 흐름
ml_in: ഉദാഹരണത്തിന്റെ വിശദീകരണം
pl_pl: Działanie krok po kroku
pt_br: Fluxo de trabalho passo-a-passo
pt_un: Fluxo passo-a-passo
ru_ru: Пошаговый алгоритм
sw_ke: Mtiririko wa Kazi Hatua kwa Hatua
ta_in: பணிப்பாய்வு படி படியாக
te_in: వర్క్‌ఫ్లో స్టెప్-బై--స్టెప్
tr_tr: Adım Adım iş akışı
vi_vn: Từng bước của luồng công việc
zh_cn: 操作流程分步讲解
zh_tw: 工作流程逐步簡介

source: The program above can be broken down into six steps:
bn_bn: উপরের প্রোগ্রামটিকে ছয়টি ধাপে বিভক্ত করা যেতে পারেঃ
de_de: Das obige Programm kann in sechs Schritte untergliedert werden:
el_gr: Το παραπάνω πρόγραμμα μπορεί να χωριστεί σε έξι βήματα:
es_un: El programa anterior se puede dividir en seis pasos:
fr_fr: Le programme ci-dessus peut-être découpé en six étapes :
ja_jp: 上のプログラムは6つの手順に分解できます。
ko_kr: 위의 프로그램은 다음의 여섯 단계로 나누어 질 수 있다.
ml_in: മുകളിലുള്ള ഉദാഹരണം ആറ് ഘട്ടങ്ങളായി തിരിക്കാം:
pl_pl: Powyższy program można podzielić na sześć etapów:
pt_br: O programa acima pode ser dividido em seis etapas:
pt_un: O trecho de código apresentado acima é composto de seis passos:
ru_ru: Данную программу можно разбить на шесть блоков:
sw_ke: Programu tuliyoangazia hapo juu inaweza kugawanywa katika hatua sita:
ta_in: மேலே உள்ள நிரலை ஆறு படிகளாக உடைக்கலாம்:
te_in: పైన ఉన్న ప్రోగ్రామ్‌ను ఆరు దశలుగా విభజించవచ్చు:
tr_tr: Yukarıdaki program altı adıma ayrılabilir:
vi_vn: Chương trình trên có thể được chia thành sáu bước:
zh_cn: 上面的程序可以分为六个步骤:
zh_tw: 上面的程式可以拆解成六個步驟：

source: Import packages
bn_bn: প্যাকেজের ইম্পোর্ট (আমদানি) করা
de_de: Pakete importieren
el_gr: Εισαγωγή πακέτων
es_un: Importar paquetes
fr_fr: Importation des bibliothèques
ja_jp: パッケージのインポート
ko_kr: 패키지 가져오기
ml_in: ലൈബ്രറികൾ/പാക്കേജുകൾ ഇമ്ബൊർട്ട് ചെയ്യൽ
pl_pl: Importowanie pakietów
pt_br: Importar pacotes
pt_un: Importar pacotes
ru_ru: Импорт пакетов
sw_ke: Agiza vifurushi
ta_in: இறக்குமதி பேக்கேஜ்கள்
te_in: ప్యాకేజీలను దిగుమతి చేయుట
tr_tr: Paketleri içe aktar
vi_vn: Khai báo sử dụng các gói
zh_cn: 导入包
zh_tw: 匯入套件

source: Initialize variables
bn_bn: চলরাশির প্রাথমিক মান নিযুক্ত করা
de_de: Variablen initialisieren
el_gr: Αρχικοποίηση μεταβλητών
es_un: Inicializar variables
fr_fr: Initialisation des variables
ja_jp: 変数の初期化
ko_kr: 변수 초기화하기
ml_in: വേരിയബിൾസ് അസ്യിൻ ചെയ്യൽ
pl_pl: Inicjalizacja zmiennych
pt_br: Inicializar variáveis
pt_un: Inicializar variáveis
ru_ru: Инициализация переменных
sw_ke: Anzilisha vigezo
ta_in: மாறிகளை துவக்கவும்
te_in: వేరియబుల్స్ తెలుపుము
tr_tr: Değişkenlere İlk Değerlerini Ata
vi_vn: Khởi tạo các biến
zh_cn: 初始化变量
zh_tw: 起始設定變數

source: Add gates
bn_bn: যুক্তিবর্তনী (গেইট) যুক্ত করা
de_de: Gates hinzufügen
el_gr: Προσθήκη πυλών
es_un: Agregar compuertas
fr_fr: Ajout des portes quantiques
ja_jp: ゲートの追加
ko_kr: 게이트 추가하기
ml_in: ഗേറ്റുകൾ ചേർക്കുന്നു
pl_pl: Dodawanie bramek
pt_br: Adicionar portas
pt_un: Adicionar portas
ru_ru: Применение вентилей
sw_ke: Ongezea milango
ta_in: கேட்களைச் சேர்க்கவும்
te_in: గేట్లను జతచేయుము
tr_tr: Kapılar Ekle
vi_vn: Thêm các cổng lượng tử
zh_cn: 添加门（操作）
zh_tw: 新增閘道

source: Visualize the circuit
bn_bn: বর্তনী (সার্কিটটি) দৃশ্যায়িত করা
de_de: Den Schaltkreis visualisieren
el_gr: Απεικόνιση του κυκλώματος
es_un: Visualizar el circuito
fr_fr: Visualisation du circuit
ja_jp: 回路の可視化
ko_kr: 회로 시각화하기
ml_in: സർക്യൂട്ട് പ്രിന്റ ചെയുന്നു
pl_pl: Wizualizacja obwodu
pt_br: Visualizar o circuito
pt_un: Visualizar o circuito
ru_ru: Визуализация цепи
sw_ke: Jenga taswira ya saketi
ta_in: சர்க்யூட் யை காட்சிப்படுத்தவும்
te_in: సర్క్యూట్‌ను దృశ్యమానం చేయుట
tr_tr: Devreyi Görselleştir
vi_vn: Hiển thị mạch lượng tử
zh_cn: 可视化电路
zh_tw: 視覺化電路

source: Simulate the experiment
bn_bn: পরীক্ষাটি সিমুলেট করা
de_de: Das Experiment simulieren
el_gr: Προσομοίωση του πειράματος
es_un: Simular el experimento
fr_fr: Execution du programme
ja_jp: 実験のシミュレーション
ko_kr: 실험 시뮬레이션하기
pl_pl: Symulacja eksperymentu
pt_br: Simular o experimento
pt_un: Simular o experimento
ru_ru: Симуляция эксперимента
sw_ke: Igizia majaribio ya utafiti wa kisayansi
ta_in: பரிசோதனையை உருவகப்படுத்தவும்
te_in: ప్రయోగాన్ని సిములేట్ చేయుట
tr_tr: Deneyi Simüle Et
vi_vn: Mô phỏng thí nghiệm
zh_cn: 模拟实验
zh_tw: 模擬實驗

source: Visualize the results
bn_bn: ফলাফলের দৃশ্যায়ন
de_de: Die Ergebnisse visualisieren
el_gr: Απεικόνιση των αποτελεσμάτων
es_un: Visualizar los resultados
fr_fr: Visualisation des résultats
ja_jp: 結果の可視化
ko_kr: 결과 시각화하기
ml_in: ഗ്രാഫ്/ചാർട്ട് പ്രിന്റ ചെയുന്നു
pl_pl: Wizualizacja wyników
pt_br: Visualizar os resultados
pt_un: Visualizar os resultados
ru_ru: Отображение результатов
sw_ke: Jenga taswira ya matokeo
ta_in: முடிவுகளை காட்சிப்படுத்து
te_in: ఫలితాలను దృశ్యమానం చేయుట
tr_tr: Sonuçları görselleştir
vi_vn: Hiển thị kết quả
zh_cn: 可视化结果
zh_tw: 視覺化結果

source: Step 1 : Import Packages
bn_bn: প্রথম ধাপঃ প্যাকেজ ইম্পোর্ট করা
de_de: Schritt 1 : Pakete importieren
el_gr: Βήμα 1: Εισαγωγή Πακέτων
es_un: Paso 1 : Importar Paquetes
fr_fr: Etape 1 : Importation des bibliothèques
ja_jp: ステップ 1 : パッケージのインポート
ko_kr: 1단계: 패키지 가져오기
pl_pl: Krok 1: Import pakietów
pt_br: Etapa 1: Importar pacotes
pt_un: Passo 1: Importar pacotes
ru_ru: Шаг 1. Импорт пакетов
sw_ke: Hatua ya 1 : Kuagiza Vifurushi
ta_in: படி 1: பேக்கேஜ்களை இறக்குமதி செய்க
te_in: Step 1: ప్యాకేజీలను దిగుమతి చేయుట
tr_tr: Adım 1: Paketleri Yükle
vi_vn: Bước 1: Khai báo sử dụng các gói
zh_cn: 步骤 1 ：导入包
zh_tw: 步驟 1 ：匯入套件

source: The basic elements needed for your program are imported as follows:
bn_bn: আপনার প্রোগ্রামের জন্য ইম্পোর্ট করা মৌলিক কিছু উপাদান হলোঃ
de_de: So werden die Grundbausteine für das Programm importiert:
el_gr: Τα βασικά στοιχεία που απαιτούνται για το πρόγραμμά σας εισάγονται ως εξής:
es_un: Los elementos básicos necesarios para tu programa se importan de la siguiente manera:
fr_fr: Les éléments nécessaires sont importés de cette manière :
ja_jp: プログラムに必要な基本的要素は以下のようにインポートされます。
ko_kr: 프로그램에 필요한 기본적인 요소들은 다음과 같이 가져올 수 있다:
ml_in: നിങ്ങളുടെ പ്രോഗ്രാമിന് ആവശ്യമായ അടിസ്ഥാന ലൈബ്രറികൾ/പാക്കേജുകൾ ചുവടെ കൊടുത്തിരിക്കുന്നതുപോലെ ഇമ്ബൊർട്ട് ചെയാം:
pl_pl: Podstawowe elementy wymagane przez twój program importuje się następująco:
pt_br: Os elementos básicos necessários para o seu programa são importados da seguinte forma:
pt_un: Os elementos básicos necessários para seu programa são importados como segue:
ru_ru: Импорт основных элементов, необходимых для работы программы, задается следующим образом:
sw_ke: Sehemu za msingi zinazohitajika katika programu yako zinaagizwa kama ifuatavyo:
ta_in: உங்கள் திட்டத்திற்கு தேவையான அடிப்படை உறுப்புகளை பின்வருமாறு இறக்குமதி செய்யப்படுகின்றன:
te_in: మీ ప్రోగ్రామ్ కొరకు అవసరమైన ప్రాథమిక అంశాలను ఈ విధంగా దిగుమతి చేయబడతాయి:
tr_tr: Programınız için gerekli olan temel öğeler takip eden şekilde içe aktarılır:
vi_vn: Những gói cơ bản cần thiết cho chương trình của bạn được khai báo sử dụng như sau:
zh_cn: 您的程序所需的基本元素如下导入：
zh_tw: 您的程式所需要的基本元素會被匯入如下：

source: In more detail, the imports are
bn_bn: আরো বিস্তারিত ভাবে, ইম্পোর্ট করা প্যাকেজগুলো হল
de_de: Im Einzelnen sind die Importe
el_gr: Πιο αναλυτικά, οι εισαγωγές είναι
es_un: Más detalladamente, las importaciones son
fr_fr: Plus précisément les imports sont
ja_jp: インポートされるものの詳細は以下の通りです。
ko_kr: 보다 자세히 설명하면, 가져올 패키지들은
ml_in: പാക്കേജുകൾ-കൂടുതൽ വിശദാംശങ്ങൾ
pl_pl: Konkretniej, importowane pakiety to
pt_br: Em maiores detalhes, os elementos importados são
pt_un: Em maiores detalhes, os imports são
ru_ru: Краткое описание каждого пакета
sw_ke: Kwa undani zaidi, vinavyoagizwa ni
ta_in: இன்னும் விரிவாக, இறக்குமதிகள்
te_in: మరింత వివరంగా, ఇంపోర్ట్స్ ఏమిటంటే
tr_tr: Daha ayrıntılı bir şekilde, içe aktarımlar
vi_vn: Chi tiết hơn, những thành phần được khai báo sử dụng gồm
zh_cn: 具体来说，这些导入是
zh_tw: 在更詳細的情況下，匯入為

source: ``QuantumCircuit``: can be thought as the instructions of the quantum system. It holds all your quantum operations.
bn_bn: ``QuantumCircuit``: এটিকে কোয়ান্টাম সিস্টেমের নির্দেশনা হিসাবে বিবেচনা করা যেতে পারে। সমস্ত কোয়ান্টাম অপারেশনগুলো এই প্যাকেজে থাকে।
de_de: ` ` QuantumCircuit ` `: kann als die Befehle des Quantensystems angesehen werden. Er enthält alle Quantenoperationen.
el_gr: ``QuantumCircuit``: μπορεί να θεωρηθεί ως οδηγίες του κβαντικού συστήματος. Κρατάει όλες τις κβαντικές σου λειτουργίες.
es_un: ``QuantumCircuit``: puede pensarse como las instrucciones del sistema cuántico. Contiene todas tus operaciones cuánticas.
fr_fr: ``QuantumCircuit`` : pour contenir les instructions pour le programme quantique. Il va regrouper l'ensemble des instructions quantiques à effectuer.
ja_jp: ``QuantumCircuit`` : 量子システムの命令と考えることができます。すべての量子演算を行うことができます。
ko_kr: ``QuantumCircuit``: 양자 시스템의 설명서로 생각할 수 있다. 여기에는 모든 양자 연산이 포함된다.
ml_in: ``QuantumCircuit``: ക്വാണ്ടം സിസ്റ്റത്തിന് ആവശ്യമായ നിർദ്ദേശങ്ങൾ അടങ്ങിയ പാക്കേജ്. നിങ്ങൾക്ക് ആവശ്യമായ എല്ലാ ക്വാണ്ടം ഓപ്രേഷന്സും ഇതിൽ അടങ്ങിയിരിക്കുന്നു.
pl_pl: ``QuantumCircuit``: można potraktować jako instrukcje do systemu kwantowego. Zawiera wszystkie twoje operacje kwantowe.
pt_br: ``QuantumCircuit``: podem ser entendidos como as instruções do sistema quântico. Contém todas as operações quânticas.
pt_un: ``QuantumCircuit``: pode ser pensado como as instruções do sistema quântico. Ele contém todas as suas operações quânticas.
ru_ru: ``QuantumCircuit`` создает цепь, которая будет содержать все используемые вами операторы.
sw_ke: ``QuantumCircuit``: inaweza kuzingatiwa kama maagizo ya mfumo wa kwanta. Inashikilia operesheni zako za kwanta.
ta_in: ``QuantumCircuit``: குவாண்டம் அமைப்பின் வழிமுறைகளாக கருதலாம். இது உங்கள் அனைத்து குவாண்டம் செயல்பாடுகளையும் கொண்டுள்ளது.
te_in: ``QuantumCircuit``: క్వాంటం సిస్టమ్ యొక్క సూచనలుగా భావించవచ్చు. ఇది మీ అన్ని క్వాంటం ఆపరేషన్లన్ని కలిగి ఉంటుంది.
tr_tr: ``QuantumCircuit``: Kuantum sisteminin talimatları olarak düşünülebilir. Sizin bütün kuantum operatörlerinizi taşır.
vi_vn: ``QuantumCircuit``: có thể được coi như các chỉ dẫn cho hệ thống lượng tử. Nó nắm giữ mọi hoạt động lượng tử.
zh_cn: ``QuantumCircuit`` ：可以被视为量子系统的指令。它包您需要的所有量子操作指令。
zh_tw: " QuantumCircuit``：可以理解為量子系統的指示。 它擁有您所有的量子操作。

source: ``AerSimulator``: is the Aer high performance circuit simulator.
ta_in: ``AerSimulator``: ஏர் உயர் செயல்திறன் சர்க்யூட் சிமுலேட்டர்.
te_in: ``AerSimulator``: ఒక Aer హై పెర్ఫార్మెన్స్ సర్క్యూట్ సిమ్యులేటర్.
tr_tr: ``AerSimulator``: Aer yüksek performanslı devre simülatörüdür.
