Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/maintainers_guide.po
Languages: de_de, ko_kr, ta_in, te_in, tr_tr

source: Maintainers Guide
de_de: Leitfaden für Maintainer
ko_kr: 관리자 가이드
ta_in: பராமரிப்பாளர் வழிகாட்டி
te_in: మెయింటెయినర్స్ గైడ్
tr_tr: Sürdürücü Kılavuzu

source: This document defines a *maintainer* as a contributor with merge privileges. The information detailed here is mostly related to Qiskit releases and other internal processes.
de_de: Dieses Dokument definiert einen *Maintainer* als einen Beitragenden mit Zusammenführungsrechten. Die hier beschriebenen Informationen beziehen sich hauptsächlich auf Qiskit-Releases und andere interne Prozesse.
ko_kr: 이 문서는 *관리자* 를 병합 권한을 가진 기여자로 정의한다. 여기에 자세히 설명된 정보는 주로 Qiskit 배포 및 기타 내부 과정과 관련된 것이다.
ta_in: இந்த ஆவணம் ஒரு * மேம்பாட்டாளர் * கொள்கை சலுகைகளைக் கொண்டு வரையறுக்கிறது. இங்கு விரிவான தகவல்கள் பெரும்பாலும் Qiskit வெளியீடுகள் மற்றும் பிற உள்ளார்ந்த பணிகளைத் தொடர்புபடுத்துகிறது.
te_in: ఈ డాక్యుమెంట్ మెర్జ్ ప్రివిలైజిస్తో కంట్రిబ్యూటర్‌గా *maintainer*ని నిర్వచిస్తుంది. ఇక్కడ వివరించిన సమాచారం ఎక్కువగా Qiskit విడుదలలు మరియు ఇతర అంతర్గత ప్రక్రియలకు సంబంధించినది.
tr_tr: Bu belge bir *sürdürücü*yü birleştirme ayrıcalıklarına sahip bir katkıda bulunan olarak tanımlar. Burada ayrıntıları verilen bilgiler çoğunlukla Qiskit sürümleri ve diğer dahili süreçlerle ilgilidir.

source: Stable Branch Policy
ko_kr: 안정된 브랜치 정책
ta_in: நிலையான கிளை கொள்கை
te_in: స్థిరమైన బ్రాంచ్ పాలసీ
tr_tr: Kararlı Dallanma Politikası

source: The stable branch is intended to be a safe source of fixes for high-impact bugs and security issues that have been fixed on master since a release. When reviewing a stable branch PR, we must balance the risk of any given patch with the value that it will provide to users of the stable branch. Only a limited class of changes are appropriate for inclusion on the stable branch. A large, risky patch for a major issue might make sense, as might a trivial fix for a fairly obscure error-handling case. A number of factors must be weighed when considering a change:
de_de: Der Stable-Branch ist als sichere Quelle für die Behebung von schwerwiegenden Fehlern und Sicherheitsproblemen gedacht, die seit einem Release auf Master-Branch behoben wurden. Bei der Überprüfung eines PRs für den stabilen Branch müssen wir das Risiko eines jeden Patches gegen den Wert abwägen, den er für die Benutzer des stabilen Branchs hat. Nur eine begrenzte Anzahl von Änderungen ist für die Aufnahme in den stabilen Branch geeignet. Ein großer, riskanter Patch für ein großes Problem könnte Sinn machen, ebenso wie ein trivialer Fix eines Code-Branchs zur Behandlung von relativ selten auftretenden Fehlern. Bei einer Änderung muss eine Reihe von Faktoren abgewogen werden:
ko_kr: 안정된 브랜치는 배포 후 마스터에서 수정된 심각한 버그 및 보안 이슈에 대한 안전한 소스를 유지하는 것을 목표로 한다. 안정된 브랜치의 PR을 검토할 땐, 주어진 패치의 위험과 안정된 브랜치의 사용자에게 제공할 가치 사이의 균형을 맞춰야 한다. 안정된 브랜치에는 한정된 클래스의 변경만 포함하는 것이 적절하다. 상당히 모호한 오류 처리 사례에 대한 사소한 수정과 같이, 주요 이슈에 대한 크고 위험한 패치가 유효한 경우도 있다. 변경을 고려할 때, 다음과 같은 여러 요소를 고려해야 한다:
ta_in: நிலையான கிளை வெளியீட்டிலிருந்து மாஸ்டரில் சரி செய்யப்பட்ட உயர்-தாக்க பிழைகள் மற்றும் பாதுகாப்பு சிக்கல்களுக்கான தீர்வுகளின் பாதுகாப்பான ஆதாரமாக கருதப்படுகிறது. ஒரு நிலையான கிளை PR ஐ மறுபரிசீலனை செய்யும் போது, எந்தவொரு பேட்சின் ஆபத்தையும் நிலையான கிளையின் பயனர்களுக்கு வழங்கும் மதிப்புடன் சமப்படுத்த வேண்டும். நிலையான கிளையில் சேர்க்க ஒரு குறிப்பிட்ட வகை மாற்றங்கள் மட்டுமே பொருத்தமானவை. ஒரு பெரிய சிக்கலுக்கான ஒரு பெரிய, ஆபத்தான இணைப்பு அர்த்தமுள்ளதாக இருக்கலாம், இது மிகவும் தெளிவற்ற பிழை-கையாளுதல் வழக்கிற்கான ஒரு சிறிய தீர்வாக இருக்கலாம். மாற்றத்தைக் கருத்தில் கொள்ளும்போது பல காரணிகளை எடைபோட வேண்டும்:
te_in: స్టేబుల్ బ్రాంచ్ అనేది విడుదలైనప్పటి నుండి మాస్టర్‌పై ఫిక్స్ చేయబడిన అధిక-ప్రభావ బగ్‌లు మరియు భద్రతా సమస్యల పరిష్కారాల యొక్క సురక్షిత మూలంగా ఉద్దేశించబడింది. స్థిరమైన బ్రాంచ్ PRని సమీక్షిస్తున్నప్పుడు, స్టేబుల్ బ్రాంచ్ వినియోగదారులకు అందించే విలువతో ఏదైనా ప్యాచ్ రిస్క్‌ని మనం తప్పనిసరిగా బ్యాలెన్స్ చేయాలి. స్టేబుల్ బ్రాంచ్‌లో చేర్చడానికి పరిమిత క్లాస్ మార్పులు మాత్రమే సరిపోతాయి. ఒక మేజర్ ఇష్యూ కోసం పెద్ద, ప్రమాదకర ప్యాచ్ అర్ధవంతంగా ఉండవచ్చు, ఇది చాలా అస్పష్టమైన లోపం-నిర్వహణ కేసు కోసం ఒక చిన్నవిషయం పరిష్కారం కావచ్చు. మార్పును పరిగణనలోకి తీసుకునేటప్పుడు అనేక అంశాలను పరిగణనలోకి తీసుకోవాలి:
tr_tr: Kararlı dallanmada yüksek etkili hatalara ve yayınlandığından beri temel üzerinde düzeltilen güvenlik sorunlarına uygun güvenli bir onarımlar kaynağı olması istenir. Bir kararlı dal PR'ini görüntülediğimizde, kararlı dalların kullanıcılarına yarar sağlayacak değerle birlikte her verilen yamanın riskini dengelemeliyiz. Sadece sınırlı bir değişiklikler sınıfının kararlı dallanmaya alınması uygundur. Büyük bir sorun için büyük riskli bir yama, belli belirsiz bir hata için ufak bir onarımın uygulanması mantıklı olabilir. Bir değişikliğe karar verirken bir dizi etken dikkate alınmalıdır:

source: The risk of regression: even the tiniest changes carry some risk of breaking something, and we really want to avoid regressions on the stable branch.
de_de: Das Risiko des Rückschritts: Selbst die kleinste Änderung bringt das Risiko mit sich, Fehler zu verursachen. Solche Rückschritte wollen wir auf dem Stable-Branch definitiv vermeiden.
ko_kr: 회귀의 위험: 아주 작은 변경도 무언가를 망가트릴 위험이 있으며, 안정된 브랜치에서는 최대한 회귀를 제고하고자 한다.
ta_in: பின்னடைவின் ஆபத்து: மிகச்சிறிய மாற்றங்கள் கூட எதையாவது உடைக்கும் அபாயத்தைக் கொண்டுள்ளன, மேலும் நிலையான கிளையில் பின்னடைவைத் தவிர்க்க விரும்புகிறோம்.
te_in: రిగ్రెశ్శన్ ప్రమాదం: అతిచిన్న మార్పులు కూడా ఏదో ఒకదానిని విచ్ఛిన్నం చేసే ప్రమాదాన్ని కలిగి ఉంటాయి మరియు స్టేబుల్ బ్రాంచ్లో రిగ్రెశ్శన్లను నివారించాలని మనము ఆశిస్తున్నాము.
tr_tr: Gerileme riski: en zayıf değişiklikler bile bir şeyleri biraz bozma riski taşır ve biz kararlı dalda gerilemeden gerçekten kaçınmak isteriz.

source: The user visibility benefit: are we fixing something that users might actually notice, and if so, how important is it?
de_de: Der Vorteil verbesserter Sichtbarkeit für Benutzer: Beheben wir etwas, was die Benutzer tatsächlich bemerken werden, und wenn ja, wie wichtig ist es?
ko_kr: 사용자 가시성 이점: 사용자가 실제로 알아차릴 만한 것을 수정하는가? 그렇다면 그것은 얼마나 중요한가?
ta_in: பயனர் தெரிவுநிலை நன்மை: பயனர்கள் உண்மையில் கவனிக்கக்கூடிய ஒன்றை நாம் சரிசெய்கிறோமா, அப்படியானால், அது எவ்வளவு முக்கியம்?
te_in: వినియోగదారు విజిబిలిటీ ప్రయోజనం: వినియోగదారులు నిజంగా గమనించే విషయాన్ని మనము పరిష్కరిస్తున్నాము మరియు అలా అయితే, అది ఎంత ముఖ్యమైనది?
tr_tr: Kullanıcı görünürlük yararı: onardığımız şeyler aslında kullanıcıların farkına varabildiği şeyler mi, öyle olsa bile ne kadar önemli?

source: How self-contained the fix is: if it fixes a significant issue but also refactors a lot of code, it's probably worth thinking about what a less risky fix might look like.
de_de: Wie autark ist die Änderung: Wenn eine Änderung ein wichtiges Problem löst aber auch jede Menge Code überarbeitet, sollte man wahrscheinlich darüber nachdenken, wie ein weniger riskanter Fix aussehen könnte.
ko_kr: 수정이 얼마나 자립적인가: 중요한 문제를 해결하지만 동시에 많은 코드를 변경하는 경우, 덜 위험한 수정은 어떤 모습일지 생각해볼 가치가 있다.
ta_in: பிழைத்திருத்தம் எவ்வாறு தன்னியக்கமானது: இது ஒரு குறிப்பிடத் தக்க சிக்கலைச் சரிசெய்தாலும், நிறைய குறியீட்டை மாற்றியமைத்தால், குறைவான ஆபத்தான பிழைத்திருத்தம் எப்படி இருக்கும் என்பதைப் பற்றிச் சிந்திக்க வேண்டியது அவசியம்.
te_in: పరిష్కారం ఎలా స్వీయ-నియంత్రణలో ఉంది: ఇది ఒకవేళ ముఖ్యమైన సమస్యను పరిష్కరిస్తే కానీ చాలా కోడ్‌ను రీఫాక్టర్ చేస్తే, తక్కువ ప్రమాదకర పరిష్కారం ఎలా ఉంటుందో ఆలోచించడం విలువైనదే.
tr_tr: Onarım ne kadar kendi kendine yeterli: eğer belirli bir sorunu onarıyor fakat bütün kodu yeniden etkiliyorsa, daha az riskli bir onarımın nasıl olacağı üzerinde düşünmeye muhtemelen değer.

source: Whether the fix is already on master: a change must be a backport of a change already merged onto master, unless the change simply does not make sense on master.
de_de: Gibt es die Korrektur bereits auf dem Master: Eine Änderung muss eine Rückportierung einer Änderung sein, die bereits auf dem Master zusammengeführt wurde, es sei denn, die Änderung ist auf dem Master einfach nicht sinnvoll.
ko_kr: 수정 사항이 이미 마스터 브랜치에 있는가: 수정 사항이 마스터 브랜치에 적합하지 않은 경우가 아니라면, 수정 사항은 이미 마스터 브랜치에 병합된 이전 버전을 수정하는 백포트(backport)여야 한다.
ta_in: பிழைத்திருத்தம் ஏற்கனவே மாஸ்டரில் உள்ளதா என்பது: மாற்றம் மாஸ்டருக்கு வெறுமனே புரியவில்லை என்றால், ஒரு மாற்றம் ஏற்கனவே மாஸ்டரில் இணைக்கப்பட்ட மாற்றத்தின் பின்னிணைப்பாக இருக்க வேண்டும்.
te_in: పరిష్కారం ఇప్పటికే మాస్టర్‌లో ఉందా: మార్పు అనేది మాస్టర్‌లో ఇప్పటికే విలీనమైన మార్పు యొక్క బ్యాక్‌పోర్ట్ అయి ఉండాలి, మార్పు మాస్టర్‌లో అర్థం కానట్లయితే తప్ప.
tr_tr: Düzeltme zaten ana kodlarda olsun ya da olmasın: değişiklik basitçe ana kodlar üzerinde bir anlam ifade etmediği sürece, bir değişiklik ana birimle zaten birleştirilmiş olan bir değişikliğin önceki versiyonuna taşınmalıdır.

source: Backporting procedure:
de_de: Rückportierungsverfahren:
ko_kr: 백포팅 절차:
ta_in: பின்னணி செயல்முறை:
te_in: బ్యాక్పోర్ట్ విధానము:
tr_tr: Backport(Eski versiyona güncel özellik taşıma) prosedürü:

source: When backporting a patch from master to stable, we want to keep a reference to the change on master. When you create the branch for the stable PR, use::
de_de: Bei der Rückportierung einer Änderung vom Master in den Stable-Branch, wollen wir eine Referenz auf die Änderung im Master-Branch behalten. Beim Erstellen des Branches für den Pull-Request verwendet man::
ko_kr: 마스터에서 안정적인 패치로 백포팅할 때 마스터의 변경 사항에 대한 참조를 유지하려고 한다. 브랜치에 안정적인 PR을 만드는 경우 다음 명령어를 사용한다::
ta_in: ஒரு பேட்சை மாஸ்டரிலிருந்து நிலையானதாக மாற்றும்போது, ​​மாஸ்டரின் மாற்றத்தைப் பற்றிய குறிப்பை வைத்திருக்க விரும்புகிறோம். நிலையான PR க்காக நீங்கள் கிளையை உருவாக்கும்போது, :: ஐப் பயன்படுத்தவும்
te_in: మాస్టర్ నుండి స్టేబుల్‌కి ప్యాచ్‌ను బ్యాక్‌పోర్ట్ చేస్తున్నప్పుడు, మేము మాస్టర్‌లో మార్పుకు సూచనగా ఉంచాలనుకుంటున్నాము. మీరు స్థిరమైన PR కోసం బ్రాంచ్ను సృష్టించినప్పుడు, ఉపయోగించండి::
tr_tr: Bir yamayı master'dan kararlı eski sürüme eklerken, master'daki değişikliğe dair bir referans tutmak istiyoruz. Kararlı PR (Pull Request) için dallanma oluşturduğunuzda, şunu kullanın::

source: However, this only works for small self-contained patches from master. If you need to backport a subset of a larger commit (from a squashed PR, for example) from master, do this manually. In these cases, add::
de_de: Das funktioniert jedoch nur für kleine, in sich geschlossene Änderungen vom Master-Branch. Wenn man einen Teil eines größeren Commits (z. B. eines zusammengefassten Pull-Requests) vom Master rückportieren möchte, macht man dies manuell. In solchen Fällen fügt man dies hinzu::
ko_kr: 아지만 이것은 마스터의 작은 자체 포함 패치에만 작동한다. 마스터에서 더 큰 커밋(예: squashed PR에서)의 하위 집합을 백포트해야 하는 경우 수동으로 진행한다. 이러한 경우 다음을 추가 한다.
ta_in: இருப்பினும், இது மாஸ்டரிடமிருந்து சிறிய தன்னிறைவான பேட்ச்களுக்கு மட்டுமே வேலை செய்கிறது. மாஸ்டரிடமிருந்து ஒரு பெரிய கமிட்டின் துணைக்குழுவை (எடுத்துக்காட்டாக, ஸ்குவாஷ் செய்யப்பட்ட ஒரு PR) மாஸ்டரிடமிருந்து இதைக் கைமுறையாகச் செய்யுங்கள். இந்தச் சந்தர்ப்பங்களில், :: ஐ சேர்க்கவும்
te_in: అయితే, ఇది మాస్టర్ నుండి చిన్న స్వీయ-నియంత్రణ ప్యాచ్టెస్ కోసం మాత్రమే పని చేస్తుంది. మీరు మాస్టర్ నుండి పెద్ద కమిట్ (ఉదాహరణకు, స్క్వాష్ చేయబడిన PR నుండి) ఉపసమితిని బ్యాక్‌పోర్ట్ చేయవలసి వస్తే, దీన్ని మాన్యువల్‌గా చేయండి. ఈ సందర్భాలలో, జోడించండి::

source: so that we can track the source of the change subset, even if a strict cherry-pick doesn\'t make sense.
de_de: um die Quelle der Änderungen nachvollziehen zu können - selbst wenn ein cherry-pick nicht sinnvoll wäre.
ko_kr: 특별히 선별된 내용이 의미가 통하지 않더라도 변경된 부분의 원래 소스 코드를 추적할 수 있다.
ta_in: எனவே, கண்டிப்பான செர்ரி-தேர்வுக்கு \' அர்த்தமில்லை என்றாலும், மாற்றத்தின் துணைக்குழுவின் மூலத்தைக் கண்காணிக்க முடியும்.
te_in: తద్వారా కఠినమైన cherry-pick అర్ధవంతం కానప్పటికీ, మార్పు ఉపసమితి యొక్క సోర్స్ని మనం ట్రాక్ చేయవచ్చు.
tr_tr: böylece, sıkı bir cımbızlama mantıklı olmasa bile, değişiklik alt kümesinin kaynağını takip edebiliriz.

source: If the patch you're proposing will not cherry-pick cleanly, you can help by resolving the conflicts yourself and proposing the resulting patch. Please keep Conflicts lines in the commit message to help review of the stable patch.
de_de: Wenn ein Cherry-Pick des Patches, den man vorschlägt, nicht ohne Konflikte verläuft, kann man diese selbst beheben und dann den resultierenden Patch vorschlagen. Um die Prüfung des Stable-Branch zu vereinfachen, belässt man dabei die Conflicts-Zeilen in der Commit-Nachricht.
ko_kr: 새롭게 제안하는 패치가 정확히 선별하지 않더라도 스스로 상충되는 부분을 해결하고, 결과로 초래된 패치를 제안함으로써 도움을 줄 수 있다. 안정된 패치의 검토를 돕기 위해서 커밋 메시지에 상충됨(Conflicts) 을 표시하기 바란다.
ta_in: நீங்கள் முன்மொழிகின்ற இணைப்பு செர்ரி-பிக் சுத்தமாக இருக்காது என்றால், மோதல்களை நீங்களே தீர்த்துக் கொண்டு, அதன் விளைவாக வரும் பேட்சை முன்மொழியலாம். நிலையான இணைப்பை மதிப்பாய்வு செய்ய உதவுவதற்கு தயவுசெய்து மோதல் வரிகளை உறுதி செய்தியில் வைக்கவும்.
te_in: మీరు ప్రతిపాదిస్తున్న ప్యాచ్ క్లీన్గా cherry-pick చేయకపోతే , మీరు స్వయంగా కాంఫ్లిక్ట్లను పరిష్కరించుకుని, ఫలితంగా వచ్చే ప్యాచ్‌ను ప్రతిపాదించడం ద్వారా సహాయం చేయవచ్చు. దయచేసి స్థిరమైన ప్యాచ్‌ను సమీక్షించడంలో సహాయపడటానికి కమిట్ మెసేజ్‌లో వైరుధ్యాల పంక్తులను(Conflicts lines) ఉంచండి.
tr_tr: Önerdiğiniz yama temiz bir şekilde cımbızlanmazsa, çakışmaları kendiniz çözerek ve ortaya çıkan yamayı önererek yardımcı olabilirsiniz. Kararlı yamanın incelenmesine yardımcı olmak için lütfen Çakışma satırlarını değişiklik mesajında tutun.

source: Backport labels
ko_kr: 이전 버전을 수정하는 백포트(backport) 라벨들
ta_in: பின்னணிஅடையாளக் குறியீடு
te_in: బ్యాక్ పోర్ట్ లేబుల్స్
tr_tr: Backport etiketleri

source: Bugs or PRs tagged with ``stable backport potential`` are bugs that apply to the stable release too and may be suitable for backporting once a fix lands in master. Once the backport has been proposed, the tag should be removed.
de_de: Bugs oder Pull-Requests, welche mit dem Label ``stable backport potential`` gekennzeichnet wurden, kommen für eine Rückportierung in den Stable-Branch in Frage, sobald dafür ein Patch im Master-Branch ist. Sobald die Rückportierung geplant ist, sollte das Tag entfernt werden.
ko_kr: ``잠재적인 안정된 백포트(stable backport potential)`` 로 태그된 버그나 풀 리퀘스트는 안정된 릴리즈에 적용되는 버그이며, 마스터 브랜치에 머지되는 순간 이전 버전을 수정하는 백포트(backport) 로써 적합할 수 있다. 백포트가 제안되면, 해당 태그는 제거되어야 한다.
ta_in: ``stable backport potential`` உடன் குறிக்கப்பட்ட பிழைகள் அல்லது PR கள் நிலையான வெளியீட்டிற்கும் பொருந்தும் பிழைகள் மற்றும் மாஸ்டரில் ஒரு பிழைத்திருத்தம் வந்தவுடன் பின்செலுத்தலுக்கு ஏற்றதாக இருக்கலாம். பேக்போர்ட் முன்மொழியப்பட்டவுடன், குறிச்சொல் அகற்றப்பட வேண்டும்.
te_in: ``stable backport potential``తో ట్యాగ్ చేయబడిన బగ్‌లు లేదా PRలు స్థిరమైన విడుదలకు కూడా వర్తించే బగ్‌లు మరియు మాస్టర్‌మాస్టర్ లోకి ఫిక్స్ చేరినతరువాత తర్వాత బ్యాక్‌పోర్టింగ్‌కు అనుకూలంగా ఉండవచ్చు. బ్యాక్‌పోర్ట్ ప్రతిపాదించబడిన తర్వాత, ట్యాగ్ తీసివేయబడాలి.

source: Include ``[Stable]`` in the title of the PR against the stable branch, as a sign that setting the target branch as stable was not a mistake. Also, reference to the PR number in master that you are porting.
de_de: Um zu zeigen, dass die Auswahl des Stable-Branch als Ziel eines Pull-Requests kein Fehler war, verwenden Sie ``[Stable]`` im Titel. Zusätzlich geben Sie eine Referenz zum Pull-Request der Änderung im Master-Branch an, welche Sie rückportieren.
ko_kr: 대상 브랜치를 안정되었다고 설정하는 표시는 실수가 아니기 때문에 안정된 브랜치에 대한 PR의 제목에는 ``[Stable]`` 을 포함시킨다. 또한, 마스터 브랜치에 머지된 PR 참조번호를 추가한다.
ta_in: இலக்குக் கிளையை நிலையானதாக அமைப்பது தவறு அல்ல என்பதற்கான அடையாளமாக, நிலையான கிளைக்கு எதிராக PR இன் தலைப்பில் ``[Stable]`` சேர்க்கவும். மேலும், நீங்கள் போர்ட்டிங் செய்யும் மாஸ்டரில் உள்ள PR எண்ணைக் குறிப்பிடவும்.
te_in: స్టేబుల్ బ్రాంచ్‌కి వ్యతిరేకంగా PR శీర్షికలో ``[Stable]``ని ఇంక్లూడ్ చేయండి, టార్గెట్ బ్రాంచ్‌ను స్టేబుల్గా సెట్ చేయడం పొరపాటు కాదు అనే సంకేతం. అలాగే, మీరు పోర్టింగ్ చేస్తున్న మాస్టర్‌లో PR నంబర్‌ను సూచించండి.
tr_tr: Hedef dalın kararlı olarak ayarlanmasının bir hata olmadığını gösteren bir işaret olarak kararlı dalda PR başlığına ``[Stable]`` ekleyin. Ayrıca, taşıdığınız master'daki PR numarasını referans alın.

source: Qiskit Versioning
de_de: Qiskit-Versionierung
ko_kr: Qiskit 버저닝(Versioning)
ta_in: Qiskit பதிப்பு
te_in: Qiskit వర్షనింగ్
tr_tr: Qiskit Sürüm Oluşturma

source: The Qiskit project is made up of several elements each performing different functionality. Each is independently useful and can be used on their own, but for convenience we provide this repository and meta-package to provide a single entrypoint to install all the elements at once. This is to simplify the install process and provide a unified interface to end users. However, because each Qiskit element has its own releases and versions, some care is needed when dealing with versions between the different repositories. This document outlines the guidelines for dealing with versions and releases of both Qiskit elements and the meta-package.
de_de: Das Qiskit-Projekt setzt sich aus mehreren Elementen zusammen, die jeweils unterschiedliche Funktionen ausführen. Jedes ist unabhängig nutzbar und kann für sich alleine verwendet werden. Dieses Repository und Meta-Paket wird aus Gründen der Vereinfachung zur Verfügung gestellt, um einen einzelnen Startpunkt zur Verfügung zu stellen alle Elemente auf einmal zu installieren. Durch die Bereitstellung einer einheitlichen Schnittstelle für die Endnutzer wird der Installationsvorgang vereinfacht. Da jedes Qiskit-Element seine eigenen Releases und Versionen hat, ist jedoch eine gewisse Pflege erforderlich, wenn es um Versionen zwischen den verschiedenen Repositorys geht. In diesem Dokument werden die Richtlinien für den Umgang mit Versionen und Releases von Qiskit-Elementen und dem Meta-Paket beschrieben.
ko_kr: Qiskit 프로젝트는 각각 다른 기능을 수행하는 여러 요소들로 구성되어 있다. 각각은 독립적으로 유용하고 사용될 수 있으나, 편의상 저장소와 모든 요소를 한 번에 설치할 수 있는 단일 진입점을 제공하는 메타-패키지를 제공한다. 이는 설치 과정을 간소화하고 사용자에게 통일된 인터페이스를 제공하기 위함이다. 하지만 각 Qiskit 요소들은 자신들만의 배포 버전을 가지고 있기 때문에 다른 저장소의 버전을 다룰 때에는 주의가 필요하다. 이 문서는 Qiskit 요소와 메타-패키지의 배포 버전을 다룰 때의 지침을 설명한다.
ta_in: Qiskit திட்டமானது பல கூறுகளால் ஆனது, ஒவ்வொன்றும் வெவ்வேறு செயல்பாடுகளைச் செய்கிறது. ஒவ்வொன்றும் தனித்தனியாகப் பயனுள்ளவை மற்றும் அவற்றின் சொந்தமாகப் பயன்படுத்தப்படலாம், ஆனால் வசதிக்காக இந்தக் களஞ்சியத்தையும் மெட்டா-தொகுப்பையும் ஒரே நேரத்தில் அனைத்து உறுப்புகளையும் நிறுவ ஒரே நுழைவுப் புள்ளியை வழங்குகிறோம். இது நிறுவல் செயல்முறையை எளிதாக்குவது மற்றும் இறுதிப் பயனர்களுக்கு ஒரு ஒருங்கிணைந்த இடைமுகத்தை வழங்குவதாகும். இருப்பினும், ஒவ்வொரு Qiskit உறுப்புக்கும் அதன் சொந்த வெளியீடுகள் மற்றும் பதிப்புகள் இருப்பதால், வெவ்வேறு களஞ்சியங்களுக்கு இடையில் பதிப்புகளைக் கையாளும் போது சில கவனம் தேவை. இந்த ஆவணம் Qiskit உறுப்புகள் மற்றும் மெட்டா-பேக்கேஜ் ஆகிய இரண்டின் பதிப்புகள் மற்றும் வெளியீடுகளைக் கையாள்வதற்கான வழிகாட்டுதல்களை கோடிட்டுக் காட்டுகிறது.
te_in: Qiskit ప్రాజెక్ట్ అనేక ఎలిమెంట్లతో రూపొందించబడింది, ప్రతి ఒక్కటి విభిన్న కార్యాచరణను ప్రదర్శిస్తుంది. ప్రతి ఒక్కటి స్వతంత్రంగా ఉపయోగపడుతుంది మరియు వాటి స్వంతంగా ఉపయోగించవచ్చు, కానీ సౌలభ్యం కోసం మేము అన్ని ఎలిమెంట్‌లను ఒకేసారి ఇన్‌స్టాల్ చేయడానికి ఒకే ఎంట్రీ పాయింట్‌ను అందించడానికి ఈ రిపోజిటరీ మరియు మెటా-ప్యాకేజీని అందిస్తాము. ఇది ఇన్‌స్టాల్ ప్రక్రియను సులభతరం చేయడం మరియు తుది వినియోగదారులకు ఏకీకృత ఇంటర్‌ఫేస్‌ను అందించడం. అయినప్పటికీ, ప్రతి Qiskit ఎలిమెంట్ దాని స్వంత విడుదలలు మరియు సంస్కరణలను కలిగి ఉన్నందున, విభిన్న రిపోజిటరీల మధ్య సంస్కరణలతో వ్యవహరించేటప్పుడు కొంత జాగ్రత్త అవసరం. ఈ పత్రం Qiskit ఎలిమెంట్లు మరియు మెటా-ప్యాకేజీ రెండింటి యొక్క సంస్కరణలు మరియు విడుదలలతో వ్యవహరించడానికి మార్గదర్శకాలను వివరిస్తుంది.
tr_tr: Qiskit projesi, her biri farklı işlevler yerine getiren birçok ögeden oluşur. Her biri bağımsız olarak işlevsel ve kendi başlarına kullanılabilir olan bu ögeleri tek bir seferde kurmak için tek bir giriş noktası sağlayacak bu depoyu ve meta-paketi sağlıyoruz. Bu şekilde dağıtmak kurulum sürecini kolaylaştırıp son kullanıcılara birleşik bir arayüz sağlasa da her Qiskit ögesi kendi sürümüne sahip olduğu için farklı depolar ile çalışırken dikkatli olmak gerekir. Bu belge, farklı Qiskit öğelerinin ve meta-paketin sürüm ve dağıtımlarıyla çalışırken uyulması gereken kuralları özetlemektedir.

source: For the rest of this guide the standard Semantic Versioning nomenclature will be used of: ``Major.Minor.Patch`` to refer to the different components of a version number. For example, if the version number was ``0.7.1``, then the major version is ``0``, the minor version ``7``, and the patch version ``1``.
de_de: Für den Rest dieses Handbuchs wird die Standardnomenklatur Semantic Versioning verwendet werden: ``Major.Minor.Patch``, um auf die verschiedenen Komponenten einer Versionsnummer zu verweisen. Wenn z. B. die Versionsnummer ``0.7.1`` ist, dann ist die Hauptversion ``0``, die Nebenversion ``7`` und die Patch-Version ``1``.
ko_kr: 이 지침의 남은 부분에서 표준 유의적 버전(Semantic Versioning) 명명법은 서로 다른 버전을 ``Major.Minor.Patch`` 으로 표기할 것이다. 예를 들어 버전 번호가 ``0.7.1`` 라면, 주 버전(major version)은 ``0``, 부 버전(minor version)은 ``7``, 그리고 패치 버전(patch version)은 ``1`` 이다.
ta_in: இந்த வழிகாட்டியின் மீதமுள்ள தரநிலை சொற்பொருள் பதிப்பு பெயரிடல் பயன்படுத்தப்படும்: ``Major.Minor.Patch`` பதிப்பு எண்ணின் வெவ்வேறு கூறுகளைக் குறிக்க உதவுகிறது. உதாரணமாக, பதிப்பு எண் ``0.7.1`` என்றால், முக்கிய பதிப்பு ``0``, சிறிய பதிப்பு ``7``, மற்றும் இணைப்புப் பதிப்பு ``1``.
te_in: ఈ గైడ్‌లో మిగిలిన వాటికి ప్రామాణిక సెమాంటిక్ వెర్షన్ నామకరణం:``Major.Minor.Patch``వెర్షన్ నెంబర్ యొక్క విభిన్న భాగాలను సూచించడానికి ఉపయోగించబడుతుంది. ఉదాహరణకు, వెర్షన్ నెంబర్ ``0.7.1`` అయితే, మేజర్ వెర్షన్ ``0``,మైనర్ వెర్షన్ ``7`` మరియు ప్యాచ్ వెర్షన్ ``1``.

source: Meta-package Version
de_de: Meta-Paketversion
ko_kr: 메타-패키지 버전
ta_in: மெட்டா-தொகுப்பு பதிப்பு
te_in: మెటా-ప్యాకేజీ వెర్షన్
tr_tr: Meta-paket Sürümü

source: The Qiskit meta-package version is an independent value that is determined by the releases of each of the elements being tracked. Each time we push a release to a tracked component (or add an element) the meta-package requirements, and version will need to be updated and a new release published. The timing should be coordinated with the release of elements to ensure that the meta-package releases track with element releases.
de_de: Die Metapaket-Version von Qiskit ist eine unabhängigere Einheit, die von den Releases der einzelnen Elemente bestimmt wird. Jedes Mal, wenn wir ein Release zu einer Tracking-Komponente bringen (oder ein Element hinzufügen) müssen die Meta-Paketanforderungen und Version aktualisiert, und ein neues Release veröffentlicht werden. Der Zeitpunkt sollte mit der Veröffentlichung von Elementen koordiniert werden, um sicherzustellen, dass die Meta-Paket-Releases mit den Elementversionen übereinstimmen.
ko_kr: Qiskit 메타-패키지 버전은 독립적인 값으로 각각의 요소들의 배포 버전에 따라 결정된다. 추적되는 요소 (혹은 새로운 요소를 추가하거나) 를 메타-패키지의 필요 항목에 푸시(push)할 때마다 버전은 갱신되어야 하고 새 배포가 발행된다. 메타-패키지 배포가 각 요소의 배포 버전과 일치하도록 발행 일정을 조율한다.
ta_in: Qiskit மெட்டா-தொகுப்பு பதிப்பு என்பது ஒரு சுயாதீன மதிப்பு, இது கண்காணிக்கப்படும் ஒவ்வொரு உறுப்புகளின் வெளியீடுகளால் தீர்மானிக்கப்படுகிறது. ஒவ்வொரு முறையும் மெட்டா-தொகுப்பு தேவைகளுக்கு ஒரு வெளியீட்டை கண்காணிக்கும் கூறுக்கு (அல்லது ஒரு உறுப்பைச் சேர்க்க) தள்ளுகிறோம், மேலும் பதிப்பு புதுப்பிக்கப்பட்டு புதிய வெளியீடு வெளியிடப்பட வேண்டும். உறுப்பு வெளியீடுகளுடன் மெட்டா-தொகுப்பு வெளியீடுகள் கண்காணிக்கப்படுவதை உறுதி செய்ய உறுப்புகளின் வெளியீட்டுடன் நேரத்தை ஒருங்கிணைக்க வேண்டும்.
te_in: Qiskit మెటా-ప్యాకేజీ సంస్కరణ అనేది ఒక స్వతంత్ర విలువ, ఇది ట్రాక్ చేయబడే ప్రతి ఎలిమెంట్ల విడుదలల ద్వారా నిర్ణయించబడుతుంది. మేము విడుదలను ట్రాక్ చేసిన కాంపోనెంట్‌కి (లేదా మూలకాన్ని జోడించే) ప్రతిసారీ మెటా-ప్యాకేజీ అవసరాలు మరియు సంస్కరణను నవీకరించాలి మరియు కొత్త విడుదలను ప్రచురించాలి. మెటా-ప్యాకేజీ ఎలిమెంట్ విడుదలలతో ట్రాక్‌ను విడుదల చేస్తుందని నిర్ధారించుకోవడానికి ఎలిమెంట్ల విడుదలతో సమయాన్ని సమన్వయం చేయాలి.
tr_tr: Qiskit meta paketi sürümü izlenmekte olan ögelerin her birinin sürümleri tarafından belirlenen bağımsız bir değerdir. İzlenen bir bileşene bir sürümü her gönderdiğimizde (veya bir öge eklediğimizde), meta paket gereksinimleri ve sürümün güncellenmesi ve yeni bir sürümün yayınlanması gerekir. Meta paket sürümlerinin, öge sürümleriyle uyumlu olmasını sağlamak için zamanlama, ögelerin yayınlanmasıyla koordine edilmelidir. Meta paket sürümlerinin, öge sürümleriyle uyumlu olmasını sağlamak için zamanlama, ögelerin sürümleriyle koordine edilmelidir.
