Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/maintainers_guide.po
Languages: de_de, ko_kr, ta_in, te_in, tr_tr

source: The way documentation is structured in Qiskit is to push as much of the actual documentation into the docstrings as possible. This makes it easier for additions and corrections to be made during development, because the majority of the documentation lives near the code being changed. There are three levels in the normal documentation structure in Terra:
de_de: Die Dokumentation in Qiskit ist so aufgebaut, so viel wie möglich der eigentlichen Dokumentation über Docstrings abzubilden. Das macht das Ergänzen und Korrigieren der Dokumentation während der Entwicklung einfacher, weil der größte Teil der Dokumentation in der Nähe des zu ändernden Codes liegt.. Im Aufbau der Dokumentation von Terra gibt es drei Ebenen:
ko_kr: Qiskit에서 문서가 조직된 방식은 가능한 많은 문서를 docstring으로 입력하는 것이다. 이 방식은 문서 자체가 코드와 함께 존재하기 때문에 개발 과정에서 문서를 추가하거나, 수정하는 것을 쉽게 만든다. Terra의 일반적인 문서 구조에는 세 개의 레벨이 있다:
ta_in: Qiskit யில் ஆவணங்கள் கட்டமைக்கப்பட்ட வழி, உண்மையான ஆவணங்களை முடிந்தவரை டாக்ஸ்ட்ரிங்ஸில் தள்ளுவதாகும். இது வளர்ச்சியின் போது சேர்த்தல் மற்றும் திருத்தங்களைச் செய்வதை எளிதாக்குகிறது, ஏனென்றால் பெரும்பாலான ஆவணங்கள் code மாற்றப்படுவதற்கு அருகில் வாழ்கின்றன. டெர்ராவில் இயல்பான ஆவணமாக்கல் கட்டமைப்பில் மூன்று நிலைகள் உள்ளன:
tr_tr: Qiskit'te belgenin yapılandırılma şekli, asıl belgenin mümkün olduğunca belge dizgisine aktarılmasıdır. Bu, belgelerin çoğu değiştirilen kodun yanında bulunduğu için geliştirme sürecinde ekleme ve düzeltmeler yapılmasını kolaylaştırır. Terra'nın normal belge yapısında üç seviye vardır:

source: The ``.rst`` files in the ``docs/apidocs``
de_de: Die ``.rst`` Dateien in ``docs/apidocs``
ko_kr: ``docs/apidocs`` 에 위치한 ``.rst`` 파일들
ta_in: ``docs / apidocs`` இல் உள்ள ``.rst`` கோப்புகள்
tr_tr: ``docs/apidocs`` içindeki ``.rst`` dosyaları

source: These files are used to tell Sphinx which modules to include in the rendered documentation. This contains two pieces of information: an `internal reference <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`__ or `cross reference <https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`__ to the module, which can be used for internal links inside the documentation, and an `automodule directive <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ used to parse the module docstrings from a specified import path. For example, the ``dagcircuit.rst`` file contains::
ko_kr: 이 파일들은 Sphinx에게 어떤 모듈이 렌더링된 문서에 포함되는지 알려주는데 사용된다. 이 파일 형식은 두 가지 정보를 가진다: 문서 내에서 내부 링크에 사용될 수 있는 `internal reference (내부 참조) <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`__ 나 `cross reference (교차 참조) <https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`__ 와 명시된 불러오기 경로 위치의 문서화 구문을 분석하는데 사용되는 `automodule directive <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ 이다. 예를 들어, ``dagcircuit.rst`` 파일은 다음을 포함한다:
ta_in: காண்பிக்கப்பட்ட ஆவணத்தில் எந்த தொகுதிகள் சேர்க்கப்பட வேண்டும் என்பதை ஸ்பின்க்ஸிடம் சொல்ல இந்த கோப்புகள் பயன்படுத்தப்படுகின்றன. இதில் இரண்டு தகவல்கள் உள்ளன: ஒரு `internal reference <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`_ அல்லது `cross reference <https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`_ தொகுதிக்கு, இது ஆவணத்தின் உள் இணைப்புகளுக்குப் பயன்படுத்தப்படலாம், மற்றும் ஒரு `automodule directive <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`_ ஒரு குறிப்பிட்ட இறக்குமதி பாதையிலிருந்து தொகுதி டாக்ஸ்ட்ரிங்ஸை அலச பயன்படுத்தப்படுகிறது. எடுத்துக்காட்டாக, எடுத்துக்காட்டாக, dagcircuit.rst கோப்பில் உள்ளது::

source: The only ``.rst`` file outside of this is ``qiskit.rst``, which contains the table of contents. If you're adding a new ``.rst`` file for a new module's documentation, make sure to add it to the `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__ in that file.
de_de: Die einzige außerhalb liegende ``.rst``-Datei ist ``qiskit.rst``. Sie enthält das Inhaltsverzeichnis. Wenn man eine neue ``.rst``-Datei für die Dokumentation eines neuen Moduls anlegt, muss diese dort unter `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__ hinzugefügt werden.
ko_kr: 이런 형식과 다른 유일한 ``.rst`` 파일은 목차를 포함하는 ``qiskit.rst`` 이다. 새로운 모듈의 문서에 대한 ``.rst`` 파일을 추가한다면, 해당 파일에 `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__ 을 추가해야 한다.
ta_in: இதற்கு வெளியே உள்ள ஒரே ``.rst`` கோப்பு ``qiskit.rst``, இதில் உள்ளடக்க அட்டவணை உள்ளது. புதிய தொகுதியின் ஆவணங்களுக்காக நீங்கள் ஒரு புதிய ``.rst`` கோப்பைச் சேர்த்தால், சேர்ப்பதை உறுதிசெய்ய, `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__ அந்த கோப்பில்.

source: The module-level docstring
de_de: Der Docstring auf Modul-Ebene
ko_kr: 모듈-레벨 docstring
ta_in: தொகுதி-நிலை டாக்ஸ்ட்ரிங்

source: This docstring is at the module level for the module specified in the ``automodule`` directive in the rst file. If the module specified is a directory/namespace, the docstring should be specified in the ``__init__.py`` file for that directory. This module-level docstring contains more details about the module being documented. The normal structure to this docstring is to outline all the classes and functions of the public API that are contained in that module. This is typically done using the `autosummary directive <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>`__ (or `autodoc directives <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ directly if the module is simple, such as in the case of ``qiskit.execute``). The autosummary directive is used to autodoc a list of different Python elements (classes, functions, etc.) directly without having to manually call out the autodoc directives for each one. The module-level docstring is where to provide a high-level overview of what functionality the module provides. This is normally done by grouping the different components of the public API together into multiple subsections.
de_de: Dieser Docstring befindet sich auf der Modulebene für das Modul, welches in der Anweisung ``automodule`` in der rst-Datei angegeben ist. Wenn es sich bei dem angegebenen Modul um ein Verzeichnis/Namespace handelt, sollte der Docstring in der Datei ``__init__.py`` für dieses Verzeichnis angegeben werden. Dieser Docstring auf Modulebene enthält weitere Details zu dem Modul, das dokumentiert wird. Die normale Struktur zu diesem Docstrings ist eine Beschreibung aller Klassen und Funktionen der öffentlichen API, die in diesem Modul enthalten ist. Dies geschieht in der Regel mit der `autosummary Direktive <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>` __ (oder `autodoc Direktiven <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>` __ direkt, falls das Modul einfach ist, wie zum Beispiel im Fall ``qiskit.execute ``). Die Autosummary-Direktive wird verwendet, um eine Liste mit verschiedenen Python-Elementen (Klassen, Funktionen, etc.) direkt automatisch zu dokumentieren, ohne die Autodoc-Anweisungen für die einzelnen Elemente manuell aufrufen zu müssen. Der Modulebene Docstring gibt einen Überblick über die Funktionalität, die das Modul bereitstellt. Dies geschieht normalerweise, indem die verschiedenen Komponenten der öffentlichen API in mehrere Unterabschnitte gruppiert werden.
ko_kr: 이 docstring은 rst 파일의 ``automodule`` 지시자에 명시된 모듈에 대한 모듈 레벨에 있다. 명시된 모듈이 디렉토리/명칭 공간라면, docstring은 그 디렉토리의 ``__init__.py`` 에 명시되어야 한다. 이 모듈-레벨의 docstring은 문서화된 모듈에 대한 더 많은 세부정보를 포함한다. 이 docstring의 일반적인 구조는 모듈에 포함된 공개 API의 모든 클래스와 함수를 나열하는 것이다. 이는 일반적으로 `autosummary directive <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>`__ 에 의해서 실행된다(또는 ``qiskit.execute`` 의 경우와 같이 모듈이 간단한 경우에는 `autodoc directives <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ 로 직접 실행). autosummary directive는 다른 Python 요소들(클래스, 함수 등)을 각각의 autodoc directive를 호출할 필요 없이 직접 이런 요소들의 autodoc을 실행하는데 사용된다. 모듈-레벨 docstring은 모듈이 제공하는 기능에 대한 높은 수준의 개요를 제공한다. 이는 주로 공개 API의 다른 컴포넌트를 여러 세부항목으로 묶음으로서 이루어진다.
ta_in: இந்த நுழைவு ``automodule`` திசை கோப்பு ' இல் குறிப்பிடப்பட்ட கூற்றுக்கான கூறு மட்டத்தில் உள்ளது. If the module specified is a directory/namespace, the docstring should be specified in the ``__init__.py`` அந்த கோப்பகத்திற்கான கோப்பு. இந்த தொகுதி-நிலை டாக்ஸ்ட்ரிங் ஆவணப்படுத்தப்பட்ட தொகுதி பற்றிய கூடுதல் விவரங்களைக் கொண்டுள்ளது. இந்த நுழைவுக்கு சாதாரண கட்டமைப்பு அனைத்து வகுப்புகளையும், பொது API, அந்த கூற்றில் உள்ள அனைத்து வகுப்புகளையும் மற்றும் செயல்பாடுகளையும் வெளிப்பட உள்ளது. இந்த டாக்ஸ்ட்ரிங்கின் இயல்பான கட்டமைப்பு, அந்த தொகுதியில் உள்ள பொது API இன் அனைத்து வகுப்புகள் மற்றும் செயல்பாடுகளை கோடிட்டுக் காட்டுவதாகும். இது பொதுவாக `தன்னியக்க உத்தரவு <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>` __ (அல்லது `தானியங்கு வழிமுறைகள் <http: //www.sphinx- doc.org/en/master/usage/extensions/autodoc.html> `__ நேரடியாக தொகுதி எளிமையானதாக இருந்தால், ``qiskit.execute`` போன்றவை). ஒவ்வொன்றிற்கும் ஆட்டோடாக் கட்டளைகளை கைமுறையாக அழைக்காமல் நேரடியாக வெவ்வேறு பைதான் கூறுகளின் (வகுப்புகள், செயல்பாடுகள் போன்றவை) பட்டியலை ஆட்டோடாக் செய்ய ஆட்டோசம்மரி உத்தரவு பயன்படுத்தப்படுகிறது. தொகுதி-நிலை டாக்ஸ்ட்ரிங் என்பது தொகுதி என்ன செயல்பாட்டை வழங்குகிறது என்பதற்கான உயர் மட்ட கண்ணோட்டத்தை வழங்குவதாகும். இது பொதுவாக பொது API இன் வெவ்வேறு கூறுகளை ஒன்றாக பல துணைப்பிரிவுகளாக தொகுப்பதன் மூலம் செய்யப்படுகிறது.

source: For example, as in the previous dagcircuit module example, the contents of the module docstring for ``qiskit/dagcircuit/__init__.py`` would be::
de_de: Anhand des vorherigen Beispiels zum dagcircuit-Modul könnte der Inhalt des Modul-Docstrings in ``qiskit/dagcircuit/__init__.py`` etwa so aussehen::
ko_kr: 예를 들어, 이전에 제시된 dagcircuit 모듈 예제에서 ``qiskit/dagcircuit/__init__.py`` 에 대한 모듈 docstring의 내용은 다음과 같을 것이다::
ta_in: எடுத்துக்காட்டாக, முந்தைய டாக்சர்க்யூட் தொகுதி உதாரணத்தைப் போலவே, டாக்ஸ்ட்ரிங் தொகுதியின் உள்ளடக்கங்களும் ``qiskit/dagcircuit/__init__.py`` இருக்கலாம்::

source: This is just an example and the actual module docstring for the dagcircuit module might diverge from this.
de_de: Dies ist nur ein Beispiel und der tatsächliche Docstring des dagcircuit-Moduls kann abweichen.
ko_kr: 이것은 예일 뿐이며 dagcircuit 회로 모듈에 대한 실제 모듈 문서 문자열은 이와 다를 수 있다.
ta_in: இது ஒரு எடுத்துக்காட்டு மற்றும் டாக்சர்க்யூட் தொகுதிக்கான உண்மையான தொகுதி டாக்ஸ்ட்ரிங் இதிலிருந்து வேறுபடக்கூடும்.

source: The actual docstring for the elements listed in the module docstring
de_de: Der eigentliche Docstring der Objekte, die im Modul-Docstring aufgeführt sind
ko_kr: 모듈 docstring에 나열된 요소들에 대한 실제 docstring
ta_in: தொகுதி டாக்ஸ்ட்ரிங்கில் பட்டியலிடப்பட்டுள்ள உறுப்புகளுக்கான உண்மையான டாக்ஸ்ட்ரிங்

source: You should strive to document thoroughly all the public interfaces exposed using examples when necessary. For docstrings, `Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__ are used. This is parsed using the `napoleon sphinx extension <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__. The `napoleon documentation <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ contains a good example of how docstrings should be formatted.
de_de: Alle öffentlichen Schnittstellen sollten nach Möglichkeit mit Beispielen dokumentiert sein. Für Docstrings werden dabei `Google-Python-Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__ verwendet. Diese werden mit der `Napoleon Sphinx-Erweiterung <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__ verarbeitet. Die `Napoleon Dokumentation <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ enthält gute Beispiele, wie Docstrings formatiert werden sollten.
ko_kr: 개발자들은 필요한 경우에 예제를 사용하여 노출된 모든 공개 인터페이스를 철저하게 문서화하기위해 노력해야 한다. docstring은 `Google Python 스타일 Docstring <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__ 이 사용된다. 이후 문서는 `napoleon sphinx 확장판 <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__ 을 사용하여 분석된다. `napoleon 문서 <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ 는 docstring이 어떻게 형식화되어야 하는지에 대한 좋은 예제를 포함한다.
ta_in: தேவைப்படும்போது எடுத்துக்காட்டுகளைப் பயன்படுத்தி வெளிப்படும் அனைத்து பொது இடைமுகங்களையும் முழுமையாக ஆவணப்படுத்த நீங்கள் முயற்சிக்க வேண்டும். டாக்ஸ்ட்ரிங்குகளுக்கு, `Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__ பயன்படுத்தப்படுகின்றன. இது `napoleon sphinx extension <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__ ஐப் பயன்படுத்தி பாகுபடுத்தப்படுகிறது. `napoleon documentation <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ டாக்ஸ்ட்ரிங்ஸ் எவ்வாறு வடிவமைக்கப்பட வேண்டும் என்பதற்கு ஒரு சிறந்த எடுத்துக்காட்டு உள்ளது.

source: You can use any Sphinx directive or rst formatting in a docstring as it makes sense. For example, one common extension used is the ``jupyter-execute`` directive, which is used to execute a code block in Jupyter and display both the code and output. This is particularly useful for visualizations.
de_de: Jede Sphinx-Direktive und jede rst-Formatierung kann in Docstrings verwendet werden, soweit dies sinnvoll ist. Eine oft genutzte Erweiterung ist z. B. die ``jupyter-execute`` Direktive. Mit ihr kann man einen Code-Block in Jupyter ausführen und sowohl den Code als auch dessen Ausgabe anzeigen. Das ist gerade für Visualisierungen sehr hilfreich.
ko_kr: 필요한 곳에 Sphinx나 rst 포맷형식을 사용할 수 있다. 예를 들어, 한 가지 공통적으로 사용되는 확장은 ``jupyter-execute`` 지시자이며, 이는 주피터(Jupyter) 에서 코드 블록을 실행하고, 코드와 결과를 보여주는데 사용된다. 이는 시각화에 특히 매우 유용하다.
ta_in: நீங்கள் எந்த ஸ்பிங்க்ஸ் உத்தரவு அல்லது முதல் வடிவமைப்பையும் டாக்ஸ்ட்ரிங்கில் அர்த்தமுள்ளதாகப் பயன்படுத்தலாம். எடுத்துக்காட்டாக, பயன்படுத்தப்படும் ஒரு பொதுவான நீட்டிப்பு ``jupyter-execute`` டைரக்டிவ் ஆகும், இது ஜூபிட்டரில் ஒரு கோட் பிளாக்கை இயக்கவும் குறியீடு மற்றும் வெளியீடு இரண்டையும் காட்டவும் பயன்படுகிறது. காட்சிப்படுத்தலுக்கு இது மிகவும் பயனுள்ளதாக இருக்கும்.

source: Documentation Integration
de_de: Integration der Dokumentation
ko_kr: 문서 통합
ta_in: ஆவண ஒருங்கிணைப்பு
tr_tr: Dokümantasyon Entegrasyonu

source: The hosted documentation at https://qiskit.org/documentation/ covers the entire Qiskit project; Terra is just one component of that. As such, the documentation builds for the hosted version are built by the Qiskit meta-package repository https://github.com/Qiskit/qiskit. When commits are merged to that repo, the output of Sphinx builds are uploaded to the qiskit.org website. Those Sphinx builds are configured to pull in the documentation from the version of the Qiskit elements installed by the meta-package at that point. For example, if the meta-package version is currently 0.13.0, then that will copy the documentation from Terra's 0.10.0 release. When the meta-package's requirements are bumped, then it will start pulling documentation from the new version. This means that fixes for incorrect API documentation will need to be included in a new release. Documentation fixes are valid backports for a stable patch release per the stable branch policy (see :ref:`stable_branch_policy`).
de_de: Die Dokumentation unter https://qiskit.org/documentation/ deckt das komplette Qiskit Projekt ab; Terra ist davon nur eine Komponente. Daher wird die Dokumentation für die Webseite aus dem Qiskit Meta-Paket Repository https://github.com/Qiskit/qiskit erstellt. Wenn Commits in dieses Repository übernommen werden, wird das Ergebnis des Sphinx-Builds auf qiskit.org hochgeladen. Die Sphinx-Builds sind so konfiguriert, dass sie die Dokumentation der einzelnen Qiskit-Elemente mit der Version, welche im Meta-Paket angegeben ist verwenden. Wenn das Meta-Paket bspw. in Version 0.13.0 ist, wird die Dokumentation der 0.10.0 Version von Terra verwendet. Wenn die Versionsnummern in den Abhängigkeiten des Meta-Pakets aktualisiert werden, wird auch die Dokumentation der neuen Versionen übernommen. Das bedeutet, dass Korrekturen für eine fehlerhafte API Dokumentation ein neues Release benötigen. Korrekturen an der Dokumentation sind valide Rückportierungen für ein Stable Patch Release anhand der Stable Branch Regelung (siehe :ref:`stable_branch_policy`).
ko_kr: https://qiskit.org/documentation/ 에서 제공하는 문서는 전체 Qiskit 프로젝트를 다룬다. Terra는 그 중 하나에 해당한다. 따라서 제공되는 문서 빌드 버전은 Qiskit 메타-패키지 저장소 https://github.com/Qiskit/qiskit 를 따른다. 커밋이 해당 저장소로 병합되면, Sphinx 빌드의 결과물이 qiskit.org 웹사이트에 전송된다. 이 Sphinx 빌드는 그 시점의 메타-패키지로 설치된 Qiskit 요소의 버전으로 문서로 구성된다. 예를 들어, 메타-패키지의 현재 버전이 0.13.0이면 이는 Terra의 0.10.0 릴리즈에서 문서를 가져올 것이다. 메타-패키지의 요구사항이 서로 충돌하는 경우, 새 버전에서 문서를 가져올 것이다. 이는 잘못된 API 문서의 수정 사항들이 새 릴리즈에 포함될 필요가 있음을 의미한다. 문서 수정은 안정된 브랜치 정책 ( :ref:`stable_branch_policy` 을 보라) 마다 안정된 패치 릴리즈에 대한 적합한 백포트이다.
ta_in: https://qiskit.org/documentation/ இல் ஹோஸ்ட் செய்யப்பட்ட ஆவணங்கள் முழு Qiskit திட்டத்தையும் உள்ளடக்கியது; டெர்ரா அதன் ஒரு கூறு மட்டுமே. எனவே, ஹோஸ்ட் செய்யப்பட்ட பதிப்பிற்கான ஆவணங்கள் Qiskit மெட்டா-பேக்கேஜ் களஞ்சியமான https://github.com/Qiskit/qiskit மூலம் கட்டமைக்கப்படுகின்றன. கமிட்கள் அந்த ரெப்போவுடன் இணைக்கப்படும்போது, ​​ஸ்பிங்க்ஸ் பில்ட்களின் வெளியீடு qiskit.org இணையதளத்தில் பதிவேற்றப்படும். அந்த இடத்தில் மெட்டா-பேக்கேஜ் நிறுவிய Qiskit உறுப்புகளின் பதிப்பிலிருந்து ஆவணங்களை இழுக்க அந்த ஸ்பிங்க்ஸ் பில்ட்கள் கட்டமைக்கப்பட்டுள்ளன. எடுத்துக்காட்டாக, மெட்டா-பேக்கேஜ் பதிப்பு தற்போது 0.13.0 ஆக இருந்தால், அது டெர்ராவின் 0.10.0 வெளியீட்டிலிருந்து ஆவணங்களை நகலெடுக்கும். மெட்டா-பேக்கேஜின் தேவைகள் பம்ப் செய்யப்பட்டால், அது புதிய பதிப்பிலிருந்து ஆவணங்களை இழுக்கத் தொடங்கும். தவறான API ஆவணங்களுக்கான திருத்தங்கள் புதிய வெளியீட்டில் சேர்க்கப்பட வேண்டும் என்பதே இதன் பொருள். நிலையான கிளைக் கொள்கையின்படி நிலையான பேட்ச் வெளியீட்டிற்கான ஆவணத் திருத்தங்கள் செல்லுபடியாகும் பேக்போர்ட்களாகும் (பார்க்க :ref:`stable_branch_policy`).
tr_tr: https://qiskit.org/documentation/ adresinde bulunan belgelendirmeler Qiskit Projesi'nin tamamını kapsar; Terra sadece bunun bir bileşenidir. Bunun gibi, barındırılan sürüm için belgelendirme yapıları Qiskit meta-paket deposu https://github.com/Qiskit/qiskit tarafından yapılır. Yapılan değişiklikler bu depoya eklendiğinde Sphinx derlemeleri çıktısı qiskit.org web sayfasına yüklenir. Bu Sphinx derlemeleri o noktadaki meta-paket tarafından yüklenen Qiskit öğelerinin sürümünden dokümantasyona çekilmesi için yapılandırılmıştır. Örneğin, meta-paket sürümü şu anda 0.13.0 ise, o zaman bu Terra'nın 0.10.0 sürümünden belgelendirmeyi kopyalanacaktır. Meta-paketin gereksinimleri yerine getirildiğinde, belgelendirmeyi yeni sürümünden çekmeye başlayacaktır. Bu doğru olmayan API belgelendirmesinin düzeltmelerinin yeni bir sürüme dahil edilmesi gerekeceği anlamına gelir. Belgelendirme düzeltmeleri, her kararlı dallanma politikası başına kararlı yama sürümü için geçerli backportlar (yeni özellikleri eski versiyona taşıma) şeklindedir (aşağıdaki bölüme bakınız).

source: During the build process, the contents of each element's ``docs/apidocs/`` are recursively copied into a shared copy of ``doc/apidocs/`` in the meta-package repository along with all the other elements. This means that what is in the root of docs/apidocs on each element at a release will end up on the root of https://qiskit.org/documentation/apidoc/.
de_de: Während des Build-Prozesses werden die Inhalte aus ``docs/apidocs/`` aller Module rekursiv in eine Kopie von ``doc/apidocs/`` im Meta-Paket-Repository kopiert, inklusive aller anderen Elemente. Das bedeutet, dass was direkt unter docs/apidocs eines Elements liegt, bei einem Release auch direkt unter https://qiskit.org/documentation/apidoc/ liegt.
ko_kr: 빌드 과정에서 각 요소의 ``docs/apidocs/`` 내용은 모든 다른 요소와 함께 메타-패키지 저장소에 있는 ``doc/apidocs/`` 의 공유된 복사본에 반복적으로 복사된다. 이렇게 함으로써, 릴리즈의 각 요소에서 docs/apidocs의 최상위에 있는 것은 https://qiskit.org/documentation/apidoc/의 최상위에 있게 된다.
ta_in: உருவாக்கச் செயல்பாட்டின் போது, ​​ஒவ்வொரு தனிமத்தின் ``docs/apidocs/`` உள்ளடக்கங்களும் மற்ற எல்லா உறுப்புகளுடன் மெட்டா-பேக்கேஜ் களஞ்சியத்தில் உள்ள ``docs/apidocs/`` இன் பகிரப்பட்ட நகலில் மீண்டும் மீண்டும் நகலெடுக்கப்படும். இதன் பொருள், வெளியீட்டில் உள்ள ஒவ்வொரு உறுப்பிலும் உள்ள டாக்ஸ்/அபிடோக்ஸின் ரூட்டில் உள்ளவை https://qiskit.org/documentation/apidoc/ இன் ரூட்டில் முடிவடையும்.

source: These files are used to tell Sphinx which modules to include in the rendered documentation. This contains two pieces of information: an `internal reference <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`__ or `cross reference <https://www.sphinx-doc.org/en/master/usage/restructuredtext/roles.html#ref-role>`__ to the module, which can be used for internal links inside the documentation, and an `automodule directive <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ used to parse the module docstrings from a specified import path. For example, the ``dagcircuit.rst`` file contains::
de_de: Diese Dateien werden verwendet, um Sphinx mitzuteilen, welche Module in die Dokumentation aufgenommen werden sollen. Dabei gibt es zwei Arten von Information: Eine `Interne Referenz <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`__ oder einen `Querverweis <https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`__ zu dem Modul, welches die interne Verlinkung innerhalb der Dokumentation beschreibt und eine `Auto-Modul Direktive <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ um die Docstrings des Moduls aus dem spezifizierten Import-Pfad zu parsen. Als Beispiel ein Ausschnitt der Datei dagcircuit.rst::
