Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/maintainers_guide.po
Languages: de_de, ko_kr, ta_in, te_in, tr_tr

source: Adding New Tracked Elements
de_de: Neue Elemente hinzufügen
ko_kr: 새 추적 요소 추가하기
ta_in: புதிய கண்காணிக்கப்பட்ட கூறுகளைச் சேர்த்தல்
te_in: కొత్త ట్రాక్ చేసిన ఎలిమెంట్‌లను జోడిస్తోంది
tr_tr: Yeni İzlenen Öğeler Ekleme

source: When a new Qiskit element is being added to the meta-package requirements, we need to increase the **Minor** version of the meta-package.
de_de: Wenn ein neues Qiskit-Element zu den Meta-Paket-Anforderungen hinzugefügt wird, müssen wir die ** Minor** Version des Meta-Pakets erhöhen.
ko_kr: 새로운 Qiskit 요소가 메타-페키지 필요 항목에 추가되면, 메타-패키지의 **부** 버전을 올려야 한다.
ta_in: மெட்டா-தொகுப்பு தேவைகளில் ஒரு புதிய Qiskit உறுப்பு சேர்க்கப்படும்போது, ​​மெட்டா-தொகுப்பு **Minor** பதிப்பை அதிகரிக்க வேண்டும்.
te_in: మెటా-ప్యాకేజీ అవసరాలకు కొత్త Qiskit మూలకం జోడించబడినప్పుడు, మేము మెటా-ప్యాకేజీ యొక్క **మైనర్** సంస్కరణను పెంచాలి.
tr_tr: Meta paket gereksinimlerine yeni bir Qiskit ögesi eklenirken, meta paketin **Minor** sürümünü artırmamız gerekiyor.

source: For example, if the meta-package is tracking 2 elements ``qiskit-aer`` and ``qiskit-terra`` and its version is ``0.7.4``. Then we release a new element ``qiskit-new`` that we intend to also have included in the meta-package. When we add the new element to the meta-package we increase the version to ``0.8.0``.
de_de: Beispiel: Ein Meta-Paket mit 2 Elementen ``qiskit-aer`` und ``qiskit-terra`` und der Version ``0.7.4``. Nun wird ein neues Element ``qiskit-neu`` veröffentlicht, das dann auch in das Meta-Paket aufgenommen werden soll. Wenn dieses neue Element zu dem Meta-Paket hinzugefügt wird, erhöht sich die Version auf ``0.8.0``.
ko_kr: 예를 들어, 메타 패키지가 ``qiskit-aer`` 및 ``qiskit-terra`` 요소 2개를 추적하고 있고 해당 버전이 ``0.7.4`` 인 경우를 살펴 보자. 그런 다음 메타 패키지에도 포함시키려는 새로운 요소 ``qiskit-new`` 를 릴리즈 한다. 메타 패키지에 새 요소를 추가할 때 버전을 ``0.8.0`` 으로 늘린다.
ta_in: எடுத்துக்காட்டாக, மெட்டா-பேக்கேஜ் ``qiskit-aer`` மற்றும் ``qiskit-terra`` ஆகிய 2 உறுப்புகளைக் கண்காணித்து, அதன் பதிப்பு ``0.7.4`` ஆக இருந்தால். மெட்டா பேக்கேஜில் சேர்க்க உத்தேசித்துள்ள ``qiskit-ignis`` என்ற புதிய உறுப்பை வெளியிடுகிறோம். மெட்டா பேக்கேஜில் புதிய உறுப்பைச் சேர்க்கும்போது, ​​பதிப்பை ``0.8.0`` ஆக அதிகரிக்கிறோம்.
te_in: ఉదాహరణకు, మెటా-ప్యాకేజీ ``qiskit-aer`` మరియు ``qiskit-terra`` అనే 2 మూలకాలను ట్రాక్ చేస్తుంటే మరియు దాని వెర్షన్ ``0.7.4``. తర్వాత మేము మెటా-ప్యాకేజీలో చేర్చాలనుకుంటున్న కొత్త మూలకం ``qiskit-new``ని విడుదల చేస్తాము. మేము మెటా-ప్యాకేజీకి కొత్త మూలకాన్ని జోడించినప్పుడు మేము సంస్కరణను ``0.8.0``కి పెంచుతాము.
tr_tr: Örneğin, meta paket, 2 ögeyi ``qiskit-aer`` ve ``qiskit-terra`` izliyorsa sürümü ``0.7.4``sürüm olur. Daha sonra, meta-pakete dahil etmeyi planladığımız yeni bir öğeyi ``qiskit-new`` yayınladık. Meta paketine yeni ögeyi eklediğimizde sürümünü ``0.8.0``'a yükselttik.

source: Patch Version Increases
de_de: Patch-Version erhöhen
ko_kr: 패치 버전 증가
ta_in: இணைப்புப் பதிப்பு அதிகரிக்கிறது
te_in: ప్యాచ్ వెర్షన్ పెరుగుతుంది
tr_tr: Yama Sürümü Yükseltilmesi

source: When any Qiskit element that is being already tracked by the meta-package releases a patch version to fix bugs in a release, we need also bump the requirement in the ``setup.py`` and then increase the patch version of the meta-package.
de_de: Wenn ein Qiskit-Element, das bereits vom Meta-Paket verfolgt wird, eine Patch-Version veröffentlicht, um Fehler in einem Release zu beheben, müssen wir auch die Anforderung im ``setup.py`` anpassen und dann die Patch-Version des Meta-Pakets erhöhen.
ko_kr: 메타-패키지에서 추적 중인 Qiskit 요소가 버그를 고치고자 패치 버전을 공개했다면, ``setup.py`` 파일에 있는 필요 항목을 고치고 메타-패키지의 패치 버전을 증가시켜야 한다.
ta_in: மெட்டா-தொகுப்பால் ஏற்கனவே கண்காணிக்கப்படும் எந்த Qiskit உறுப்பு ஒரு வெளியீட்டில் பிழைகளைச் சரிசெய்ய ஒரு பேட்ச் பதிப்பை வெளியிடும்போது, நமக்குத் தேவைப்படும் ``setup.py`` இல் உள்ள தேவையைப் பம்ப் செய்து பின்னர் மெட்டா-தொகுப்பின் பேட்ச் பதிப்பை அதிகரிக்கும்.
te_in: మెటా-ప్యాకేజీ ద్వారా ఇప్పటికే ట్రాక్ చేయబడిన ఏదైనా Qiskit మూలకం విడుదలలో బగ్‌లను పరిష్కరించడానికి ప్యాచ్ వెర్షన్‌ను విడుదల చేసినప్పుడు,మేము ``setup.py``లో ఆవశ్యకతను బంప్ చేసి, ఆపై మెటా-ప్యాకేజీ యొక్క ప్యాచ్ వెర్షన్‌ను పెంచాలి.
tr_tr: Halihazırda meta paketi tarafından izlenen herhangi bir Qiskit ögesi, bir sürümdeki hataları düzeltmek için bir yama sürümü yayınladığında, ``setup.py``'deki gereksinimi de karşılamamız ve ardından meta paketinin yama sürümünü yükseltmemiz gerekir.

source: For example, if the meta-package is tracking 2 elements ``qiskit-terra==0.8.1`` and ``qiskit-aer==0.2.1``, with the current version ``0.9.6``. When qiskit-terra release a new patch version to fix a bug ``0.8.2`` the meta-package will also need to increase its patch version and release, becoming ``0.9.7``.
de_de: Wenn zum Beispiel das Meta-Paket 2 Elemente ``qiskit-terra==0.8.1`` und ``qiskit-aer==0.2.1`` mit der aktuellen Version ``0.9.6`` verfolgt. Wenn qiskit-terra eine neue Patch-Version veröffentlicht, um einen Fehler ``0.8.2`` zu beheben. dann muss das Meta-Paket auch seine Patch-Version und -Veröffentlichung erhöhen und wird zu ``0.9.7``.
ko_kr: 예를 들어, 메타 패키지가 2개의 요소 ``qiskit-terra==0.8.1`` 및 ``qiskit-aer==0.2.1`` 를 추적하며 현재 버전은 ``0.9.6`` 인 경우를 살펴보자. qiskit-terra가 버그 ``0.8.2`` 를 수정하기 위해 새 패치 버전을 출시할 때 메타 패키지도 패치 버전과 릴리스를 늘려 ``0.9.7`` 이 되어야 한다.
ta_in: எடுத்துக்காட்டாக, மெட்டா-தொகுப்பு 2 கூறுகளை கண்காணிக்கிறதென்றால் ``qiskit-terra == 0.8.1``, ``qiskit-aer==0.2.1``, மற்றும் ``qiskit-ignis==0.1.4` `தற்போதைய பதிப்பில் ``0.9.6``. ஒரு பிழையை சரிசெய்ய qiskit-terra ஒரு புதிய இணைப்பு பதிப்பை வெளியிடும் போது ``0.8.2`` மெட்டா-தொகுப்பு அதன் இணைப்பு பதிப்பையும் வெளியீட்டையும் அதிகரிக்க வேண்டும், இது ``0.9.7`` ஆகிறது.
te_in: ఉదాహరణకు, మెటా-ప్యాకేజ్ ప్రస్తుత వెర్షన్ ``0.9.6``తో ``qiskit-terra==0.8.1`` మరియు ``qiskit-aer==0.2.1`` 2 మూలకాలను ట్రాక్ చేస్తుంటే. qiskit-terra బగ్ ``0.8.2``ని పరిష్కరించడానికి కొత్త ప్యాచ్ వెర్షన్‌ను విడుదల చేసినప్పుడు మెటా-ప్యాకేజీ కూడా దాని ప్యాచ్ వెర్షన్‌ని పెంచాలి మరియు విడుదల చేయాలి, ఇది ``0.9.7`` అవుతుంది.
tr_tr: Örneğin, meta-paketi yürürlükteki ``0.9.6`` sürümü ile 2 ögeyi izliyorsa ``qiskit-terra==0.8.1`` ve ``qiskit-aer==0.2.1``. Qiskit-terra, bir hatasını düzeltmek için yeni bir yama sürümü yayınladığında, ``0.8.2`` meta paketinin yama sürümünü de yükseltmesi ve ``0.9.7`` olması gerekir.

source: Additionally, there are occasionally packaging or other bugs in the meta-package itself that need to be fixed by pushing new releases. When those are encountered we should increase the patch version to differentiate it from the broken release. Do **not** delete the broken or any old releases from pypi in any situation, instead just increase the patch version and upload a new release.
de_de: Zusätzlich gibt es gelegentlich Pakete oder andere Fehler im Meta-Paket selbst, die durch Veröffentlichung neuer Releases behoben werden müssen. Wenn diese aufgetreten sind, soll die Patchversion erhöht werden, um sie von der defekten Version zu unterscheiden. Defekte oder alte Versionen von pypi sollen **nicht** gelöscht werden. Stattdessen soll die Patch Version erhöht und eine entsprechend höhere Version hochgeladen werden.
ko_kr: 추가로, 가끔은 패키징이나 메타-패키지 자체의 다른 버그로 이를 고치고 새 버전을 출시해야 할 수 있다. 이러한 상황에서는 잘못된 배포에서 구분되도록 패치 버전을 증가시켜야 한다. 어떤 경우에서도 pypi의 오래되거나 잘못된 배포를 지우지 **말고,** 대신에 패치 버전을 올리고 새 배포를 업로드하라.
ta_in: கூடுதலாக, மெட்டா-தொகுப்பில் எப்போதாவது பேக்கேஜிங் அல்லது பிற பிழைகள் உள்ளன, அவை புதிய வெளியீடுகளைத் தள்ளுவதன் மூலம் சரி செய்யப்பட வேண்டும். அவை எதிர்கொள்ளும்போது, உடைந்த வெளியீட்டிலிருந்து வேறுபடுவதற்கு இணைப்பு பதிப்பை அதிகரிக்க வேண்டும். எந்த சூழ்நிலையிலும் pypi இல் இருந்து உடைந்த அல்லது பழைய வெளியீடுகளை **செய்ய வேண்டாம்**, அதற்கு பதிலாக இணைப்பு பதிப்பை அதிகரித்து புதிய வெளியீட்டைப் பதிவேற்றவும்.
te_in: అదనంగా, మెటా-ప్యాకేజీలోనే అప్పుడప్పుడు ప్యాకేజింగ్ లేదా ఇతర బగ్‌లు ఉన్నాయి, వీటిని కొత్త విడుదలలను పుష్ చేయడం ద్వారా పరిష్కరించాలి. అవి ఎదురైనప్పుడు, విరిగిన విడుదల నుండి వేరు చేయడానికి మేము ప్యాచ్ సంస్కరణను పెంచాలి. ఏ పరిస్థితిలోనైనా pypi నుండి విరిగిన లేదా ఏదైనా పాత విడుదలలను **వద్దు** తొలగించవద్దు, బదులుగా ప్యాచ్ సంస్కరణను పెంచండి మరియు కొత్త విడుదలను అప్‌లోడ్ చేయండి.
tr_tr: Ek olarak, meta paketin kendisinde ara sıra yeni sürümler yayınlayarak düzeltilmesi gereken paketleme veya başka hatalar olabilir. Bunlarla karşılaşıldığında, bozuk sürümden ayırt etmek için yama sürümünü artırmalıyız. Herhangi bir durumda bozuk veya eski sürümleri pypi'den **silmeyin**, bunun yerine yama sürümünü artırın ve yeni bir sürüm yükleyin.

source: Minor Version Increases
de_de: Geringfügige Versionserhöhungen
ko_kr: 부 버전 증가
ta_in: சிறிய பதிப்பு அதிகரிக்கிறது
te_in: మైనర్ వెర్షన్ పెరుగుతుంది
tr_tr: Alt Sürüm Yükseltmesi

source: Besides when adding a new element to the meta-package, the minor version of the meta-package should also be increased anytime a minor version is increased in a tracked element.
de_de: Neben dem Hinzufügen eines neuen Elements zum Meta-Paket sollte auch die Nebenversion des Meta-Pakets erhöht werden, wenn eine Nebenversion in einem überwachten Element erhöht wird.
ko_kr: 메타-패키지에 새로운 요소를 추가하는 것 외에도 추적되는 요소의 부 버전이 증가할 때마다 메타-패키지의 부 버전도 증가해야 한다.
ta_in: மெட்டா-தொகுப்பில் ஒரு புதிய உறுப்பைச் சேர்ப்பதைத் தவிர, மெட்டா-தொகுப்பின் சிறிய பதிப்பு ஒரு சிறிய பதிப்பு கண்காணிக்கப்பட்ட உறுப்பில் அதிகரிக்கும் போதெல்லாம் அதிகரிக்கப்பட வேண்டும்.
te_in: మెటా-ప్యాకేజీకి కొత్త ఎలిమెంట్‌ను జోడించేటప్పుడు కాకుండా, ట్రాక్ చేయబడిన ఎలిమెంట్‌లో మైనర్ వెర్షన్ పెరిగినప్పుడు మెటా-ప్యాకేజీ యొక్క మైనర్ వెర్షన్ కూడా పెంచబడాలి.
tr_tr: Bunun yanısıra meta pakete yeni bir öğe eklerken, izlenen bir öğede küçük bir sürüm artırıldığında, meta paketin alt sürümü de artırılmalıdır.

source: For example, if the meta-package is tracking 2 elements ``qiskit-terra==0.7.0`` and ``qiskit-aer==0.1.1`` and the current version is ``0.7.5``. When the ``qiskit-aer`` element releases ``0.2.0`` then we need to increase the meta-package version to be ``0.8.0`` to correspond to the new release.
de_de: Zum Beispiel, wenn das Meta-Paket 2 Elemente ``qiskit-terra == 0.7.0 `` und ``qiskit-aer == 0.1.1 `` und die aktuelle Version ``0.7.5`` verfolgt. Wenn das `` qiskit-aer `` -Element ``0.2.0`` freigibt, müssen die Meta-Paket-Version auf ``0.8.0`` erhöht werden, um dem neuen Release zu entsprechen.
ko_kr: 예를 들어, 메타-패키지가 2개의 요소 ``qiskit-terra==0.7.0`` 과 ``qiskit-aer==0.1.1`` 을 추적하고 버전이 ``0.7.5`` 라고 해보자. ``qiskit-aer`` 요소가 ``0.2.0`` 버전을 공개했다면 메타-패키지 버전도 ``0.8.0`` 로 올려서 새 배포에 일치시켜야 한다.
ta_in: எடுத்துக்காட்டாக, மெட்டா-தொகுப்பு 2 கூறுகளைக் கண்காணிக்கிறதென்றால் ``qiskit-terra==0.7.0`` மற்றும் ``qiskit-aer==0.1.1`` மற்றும் தற்போதைய பதிப்பு ``0.7.5``. ``qiskit-aer`` உறுப்பு ``0.2.0`` ஐ வெளியிடும்போது, புதிய வெளியீட்டிற்கு ஒத்ததாக மெட்டா-தொகுப்பு பதிப்பை `` 0.8.0`` ஆக அதிகரிக்க வேண்டும்.
te_in: ఉదాహరణకు, మెటా-ప్యాకేజీ 2 మూలకాలను ట్రాక్ చేస్తున్నట్లయితే ``qiskit-terra==0.7.0`` మరియు ``qiskit-aer==0.1.1`` మరియు ప్రస్తుత వెర్షన్ ``0.7.5``. ``qiskit-aer`` మూలకం ``0.2.0``ని విడుదల చేసినప్పుడు, మేము కొత్త విడుదలకు అనుగుణంగా మెటా-ప్యాకేజీ సంస్కరణను ``0.8.0``కి పెంచాలి.
tr_tr: Örneğin, meta paket ``qiskit-terra==0.7.0`` ve ``qiskit-aer==0.1.1`` 2 öğesini izliyorsa ve mevcut sürüm ``0.7.5`` ise. ``qiskit-aer`` öğesi ``0.2.0`` yayınladığında, meta paket sürümünü yeni sürüme karşılık gelecek şekilde ``0.8.0`` olacak şekilde artırmamız gerekir.

source: Major Version Increases
de_de: Eine Erhöhung der Hauptversion
ko_kr: 주 버전 증가
ta_in: முக்கிய பதிப்பு அதிகரிக்கிறது
te_in: మేజర్ వెర్షన్ పెరుగుతుంది
tr_tr: Ana Sürüm Yükseltmesi

source: The major version is different from the other version number components. Unlike the other version number components, which are updated in lock step with each tracked element, the major version is only increased when all tracked versions are bumped (at least before ``1.0.0``). Right now, all the elements still have a major version number component of ``0``, and until each tracked element in the meta-repository is marked as stable by bumping the major version to be ``>=1``, then the meta-package version should not increase the major version.
de_de: Die Hauptversion unterscheidet sich von den anderen Versionen. Im Gegensatz zu den anderen Versionen, die unmittelbar mit jedem verfolgten Element aktualisiert werden, wird die Hauptversion nur erhöht, wenn alle verfolgten Versionen abgestoßen werden (mindestens vor "1.0.0"). Im Moment haben alle Elemente noch eine Hauptversionsnummernkomponente von "0" und bis jedes verfolgte Element im Meta-Repository als stabil markiert wird, indem die Hauptversion auf "> = 1" gesetzt wird, sollte die Meta-Version die Paketversion der Hauptversion nicht erhöhen.
ko_kr: 주 버전은 다른 버전 숫자들과는 다르다. 각각의 추적되는 요소에 맞춰 갱신되는 다른 버전 숫자들과는 달리 주 버전은 모든 추적되는 버전이 새 버전으로 올라갈 때 (적어도 ``1.0.0`` 전에) 에만 증가하게 된다. 현재는 모든 요소의 주 버전이 아직 ``0`` 이고 메타-저장소에 있는 각각의 추적 요소들이 안정적으로 판단되어 주 버전이 ``>=1`` 이 되기 전까진 메타-페키지의 주 버전을 올리지 않는다.
ta_in: முக்கிய பதிப்பு மற்ற பதிப்பு எண் கூறுகளிலிருந்து வேறுபட்டது. கண்காணிக்கப்பட்ட ஒவ்வொரு உறுப்புடனும் பூட்டு படிநிலையில் புதுப்பிக்கப்படும் பிற பதிப்பு எண் கூறுகளைப் போலன்றி, கண்காணிக்கப்பட்ட அனைத்து பதிப்புகளும் மோதும்போது மட்டுமே முக்கிய பதிப்பு அதிகரிக்கும் (குறைந்தது ``1.0.0`` க்கு முன்). இப்போதே எல்லா உறுப்புகளும் ``0`` இன் முக்கிய பதிப்பு எண் கூறுகளைக் கொண்டுள்ளன, மேலும் மெட்டா-களஞ்சியத்தில் கண்காணிக்கப்படும் ஒவ்வொரு உறுப்புகளும் முக்கிய பதிப்பை ``>=1`` என்று மெருகுவதன் மூலம் நிலையானதாகக் குறிக்கப்படும் வரை மெட்டா- தொகுப்பு பதிப்பு முக்கிய பதிப்பை அதிகரிக்கக்கூடாது.
te_in: ప్రధాన సంస్కరణ ఇతర సంస్కరణ సంఖ్య భాగాల నుండి భిన్నంగా ఉంటుంది. ట్రాక్ చేయబడిన ప్రతి ఎలిమెంట్‌తో లాక్ స్టెప్‌లో అప్‌డేట్ చేయబడిన ఇతర వెర్షన్ నంబర్ కాంపోనెంట్‌ల వలె కాకుండా, అన్ని ట్రాక్ చేయబడిన సంస్కరణలు (కనీసం ``1.0.0`` కంటే ముందు) బంప్ చేయబడినప్పుడు మాత్రమే ప్రధాన సంస్కరణ పెరుగుతుంది. ప్రస్తుతం, అన్ని మూలకాలు ఇప్పటికీ ``0`` యొక్క ప్రధాన సంస్కరణ సంఖ్య భాగాన్ని కలిగి ఉంటాయి మరియు మెటా-రిపోజిటరీలోని ప్రతి ట్రాక్ చేయబడిన మూలకం ప్రధాన సంస్కరణను ``>=1``గా బంప్ చేయడం ద్వారా స్థిరంగా గుర్తించబడే వరకు, అప్పుడు మెటా-ప్యాకేజీ సంస్కరణ ప్రధాన సంస్కరణను పెంచకూడదు.
tr_tr: Ana sürüm, diğer sürüm numarası bileşenlerinden farklıdır. Her izlenen öğeyle kilit adımında güncellenen diğer sürüm numarası bileşenlerinin aksine, ana sürüm yalnızca tüm izlenen sürümler arttırıldığında (en azından ``1.0.0``dan önce) yükseltilir. Şu anda tüm öğelerin hala ana sürüm numarası bileşeni meta depodaki izlenen her öğe, ana sürümü ``>=1`` olacak şekilde arttırarak kararlı olarak işaretlenene kadar ``0``'dır ve ardından meta-paket sürümü, ana sürümü artırmamalıdır.

source: The behavior of the major version number component tracking after when all the elements are at >=1.0.0 has not been decided yet.
de_de: Das Verhalten der Haupt-Versionsnummer-Komponentenverfolgung, nachdem alle Elemente bei >=1.0.0 liegen, wurde noch nicht entschieden.
ko_kr: 모든 요소들이 >=1.0.0일 때 주 버전 숫자가 어떻게 바뀌어야 할 지에 대해서는 아직 정해지지 않았다.
ta_in: அனைத்து உறுப்புகளும் >=1.0.0 இல் இருக்கும்போது முக்கிய பதிப்பு எண் கூறு கண்காணிப்பின் நடத்தை இன்னும் முடிவு செய்யப்படவில்லை.
te_in: అన్ని మూలకాలు >=1.0.0 వద్ద ఉన్నప్పుడు ప్రధాన వెర్షన్ నంబర్ కాంపోనెంట్ ట్రాకింగ్ యొక్క ప్రవర్తన ఇంకా నిర్ణయించబడలేదు.

source: Optional Extras
de_de: Optionale Extras
ko_kr: 추가 옵션
ta_in: விருப்பமான கூடுதல்
te_in: ఆప్టికల్ ఎక్టిట్రాస్
tr_tr: Opsiyonel Ekstralar

source: In addition to the tracked elements, there are additional packages built on top of Qiskit which are developed in tandem with Qiskit, for example, the application repositories like qiskit-optimization. For convienence these packages are tracked by the Qiskit metapackage as optional extras that can be installed with Qiskit. Releases of these optional downstream projects do not trigger a metapackage release as they are unpinned and do not affect the metapackage version. If there is a compatibility issue between Qiskit and these downstream optional dependencies and the minimum version needs to be adjusted in a standalone release, this will only be done as a patch version release as it's a packaging bugfix.
de_de: Zusätzlich zu den verfolgten Elementen gibt es zusätzliche Pakete, die auf Qiskit aufgebaut sind, die im Tandem mit Qiskit entwickelt werden, zum Beispiel die Anwendungsrepositorys wie qiskit-optimization. Für den Komfort werden diese Pakete mit dem Qiskit-Metapaket als optionale Extras nachgeführt, die mit Qiskit installiert werden können. Die Releases dieser optionalen Downstream-Projekte lösen kein Metapaket-Release aus, da sie nicht gepinnt werden und die Metapaketversion nicht beeinflussen. Wenn es ein Kompatibilitätsproblem zwischen Qiskit und diesen nachgelagerten optionalen Abhängigkeiten gibt und die Mindestversion in einem eigenständigen Release angepasst werden muss, wird dies nur als Patch-Version-Release ausgeführt, da es sich dabei um ein 'packaging bugfix' handelt.
ko_kr: 추적되는 요소 외에도 Qiskit과 함께 개발된 Qiskit 위에 설치되는 추가 패키지가 있으며, 예를 들어 qiskit-optimization과 같은 응용 프로그램 저장소가 있다. 편의성을 위해 이 패키지들은 Qiskit과 함께 설치될 수 있는 선택 사양으로써 Qiskit 메타-패키지에 추적된다. 이러한 다운스트림 프로젝트들의 배포는 메타-패키지 배포를 유도하지 않으며 메타-패키지 버전에도 영향을 주지 않는다. 만약 Qiskit과 해당 다운스트림의 선택적 종속성 사이에서 호환성 문제가 있어서 독립적 배포의 최소 버전이 조정되어야 하는 경우, 패키지 버그 수정처럼 패치 버전 배포로만 되어야 한다.
ta_in: கண்காணிக்கப்பட்ட உறுப்புகளுக்கு மேலதிகமாக, Qiskit இன் மேல் கூடுதல் தொகுப்புகள் கட்டப்பட்டுள்ளன, அவை Qiskit உடன் இணைந்து உருவாக்கப்பட்டன, எடுத்துக்காட்டாக Qiskit-ஆப்டிமைசேஷன் போன்ற பயன்பாட்டு களஞ்சியங்கள். வசதிக்காக, இந்த தொகுப்புகள் Qiskit மெட்டாதொகுப்பு மூலம் Qiskit மூலம் நிறுவக்கூடிய கூடுதல் என கண்காணிக்கப்படுகிறது. இந்த விருப்பத்தேர்வு கீழ்நிலை திட்டங்களின் வெளியீடுகள் மெட்டாதொகுப்பு வெளியீட்டைத் தூண்டுவதில்லை, ஏனெனில் அவை பின் செய்யப்படாதவை மற்றும் மெட்டாதொகுப்பு பதிப்பை பாதிக்காது. Qiskit மற்றும் இந்த கீழ்நிலை விருப்ப சார்புநிலைகளுக்கு இடையே பொருந்தக்கூடிய சிக்கல் இருந்தால் மற்றும் குறைந்தபட்ச பதிப்பை ஒரு தனி வெளியீட்டில் சரிசெய்ய வேண்டும் என்றால் இது பேக்கேஜிங் பிழைத்திருத்தம் என்பதால் இது இணைப்பு பதிப்பு வெளியீடாக மட்டுமே செய்யப்படும்.
te_in: ట్రాక్ చేయబడిన మూలకాలతో పాటుగా, Qiskit పైన నిర్మించబడిన అదనపు ప్యాకేజీలు ఉన్నాయి, ఇవి Qiskitతో కలిసి అభివృద్ధి చేయబడ్డాయి, ఉదాహరణకు, qiskit-optimization వంటి అప్లికేషన్ రిపోజిటరీలు. సౌలభ్యం కోసం ఈ ప్యాకేజీలు Qiskit మెటాప్యాకేజీ ద్వారా Qiskitతో ఇన్‌స్టాల్ చేయగల ఐచ్ఛిక అదనపువిగా ట్రాక్ చేయబడతాయి. ఈ ఐచ్ఛిక దిగువ ప్రాజెక్ట్‌ల విడుదలలు అవి అన్‌పిన్ చేయబడినందున మెటాప్యాకేజీ విడుదలను ప్రేరేపించవు మరియు మెటాప్యాకేజీ సంస్కరణను ప్రభావితం చేయవు. Qiskit మరియు ఈ డౌన్‌స్ట్రీమ్ ఐచ్ఛిక డిపెండెన్సీల మధ్య అనుకూలత సమస్య ఉంటే మరియు కనిష్ట సంస్కరణను స్వతంత్ర విడుదలలో సర్దుబాటు చేయాల్సి ఉంటే, ఇది ప్యాకేజింగ్ బగ్‌ఫిక్స్ అయినందున ఇది ప్యాచ్ వెర్షన్ విడుదలగా మాత్రమే చేయబడుతుంది.
tr_tr: İzlenen öğelere ek olarak, Qiskit ile birlikte geliştirilen, örneğin qiskit optimizasyonu gibi uygulama havuzları gibi Qiskit'in üzerine inşa edilmiş ek paketler vardır. Kolaylık sağlamak için bu paketler, Qiskit ile kurulabilen isteğe bağlı ekstralar olarak Qiskit meta paketi tarafından izlenir. Bu isteğe bağlı aşağı akış projelerinin yayınları, sabitlenmedikleri ve meta paket sürümünü etkilemediği için bir meta paket versiyonunu etkilemez. Qiskit ve bu aşağı yönlü isteğe bağlı bağımlılıklar arasında bir uyumluluk sorunu varsa ve minimum sürümün bağımsız bir sürümde ayarlanması gerekiyorsa, bu bir paketleme hatası düzeltmesi olduğu için yalnızca yama sürümü olarak yapılacaktır.

source: Qiskit Element Requirement Tracking
de_de: Qiskit-Element-Anforderungs-Tracking
ko_kr: Qiskit 요소 요구사항 추적
ta_in: Qiskit உறுப்புத் தேவை கண்காணிப்பு
te_in: క్విస్కిట్ ఎలిమెంట్ రిక్వైర్‌మెంట్ ట్రాకింగ్
tr_tr: Qiskit Öğe Gereksinimi Takibi

source: While not strictly related to the meta-package and Qiskit versioning, how we track the element versions in the meta-package's requirements list is important. Each element listed in the ``setup.py`` should be pinned to a single version. This means that each version of Qiskit should only install a single version for each tracked element. For example, the requirements list at any given point should look something like::
de_de: Obwohl kein strenger Zusammenhang mit dem Meta-Paket und der Qiskit-Versionierung besteht, ist es wichtig, wie wir die Element-Versionen in den Voraussetzungen des Meta-Pakets tracken. Jedes Element, das im ``setup.py`` aufgeführt ist, sollte auf eine einzige Version angeheftet werden. Dies bedeutet, dass jede Version von Qiskit nur eine einzige Version für jedes überwachte Element installieren sollte. Die Liste an Voraussetzungen an einem beliebigen Punkt sollte beispielsweise wie folgt aussehen::
ko_kr: 메타-패키지와 Qiskit 버저닝과 엄밀하게 관련되어 있는 건 아니지만, 메타-패키지의 요구사항 목록에 있는 요소 버전을 추적하는 것은 중요하다. ``setup.py`` 에 나열된 각각의 요소들은 단일 버전으로 고정되어 있어야 한다. 이는 Qiskit의 각 버전이 추적되는 요소 중에서 단일 버전만 설치해야 한다는 것을 의미한다. 예를 들어서, 어떤 순간에서의 요구사항 목록은 다음과 같이 보일 것이다::
ta_in: மெட்டா-தொகுப்பு மற்றும் கிஸ்கிட் பதிப்போடு கண்டிப்பாக தொடர்புடையதல்ல என்றாலும், மெட்டா-தொகுப்பின் தேவைகள் பட்டியலில் உள்ள உறுப்பு பதிப்புகளை நாங்கள் எவ்வாறு கண்காணிக்கிறோம் என்பது முக்கியம். ``Setup.py`` இல் பட்டியலிடப்பட்டுள்ள ஒவ்வொரு உறுப்புகளும் ஒற்றை பதிப்பில் பொருத்தப்பட வேண்டும். இதன் பொருள் Qiskitடின் ஒவ்வொரு பதிப்பும் கண்காணிக்கப்பட்ட ஒவ்வொரு உறுப்புக்கும் ஒரு பதிப்பை மட்டுமே நிறுவ வேண்டும். எடுத்துக்காட்டாக, எந்த நேரத்திலும் தேவைகள் பட்டியல்::
te_in: మెటా-ప్యాకేజీ మరియు క్విస్కిట్ సంస్కరణకు ఖచ్చితంగా సంబంధం లేనప్పటికీ, మెటా-ప్యాకేజీ అవసరాల జాబితాలో ఎలిమెంట్ వెర్షన్‌లను ఎలా ట్రాక్ చేయాలి అనేది ముఖ్యం. ``setup.py``లో జాబితా చేయబడిన ప్రతి మూలకం ఒకే సంస్కరణకు పిన్ చేయబడాలి. దీని అర్థం Qiskit యొక్క ప్రతి సంస్కరణ ప్రతి ట్రాక్ చేయబడిన మూలకం కోసం ఒక సంస్కరణను మాత్రమే ఇన్‌స్టాల్ చేయాలి. ఉదాహరణకు, ఏ సమయంలోనైనా అవసరాల జాబితా ఇలా ఉండాలి::
tr_tr: Meta paket ve Qiskit versiyonlama ile kesinlikle ilgili olmasa da, meta paketin gereksinimler listesindeki öğelerin versiyonlarını nasıl takip ettiğimiz önemlidir. ``setup.py`` içinde listelenen her öğe tek bir sürüme sabitlenmelidir. Bu, Qiskit'in her sürümünün, izlenen her öğe için yalnızca tek bir sürüm yüklemesi gerektiği anlamına gelir. Örneğin, herhangi bir noktadaki gereksinimler listesi şöyle görünmelidir::

source: This is to aid in debugging, but also make tracking the versions across multiple elements more transparent.
de_de: Dies soll beim Debuggen helfen, aber auch den Überblick über die Versionen mehrerer Elemente transparenter machen.
ko_kr: 이것은 디버깅을 돕기 위한 것이지만, 여러 요소들 간에 버전을 추적하는 일을 더 투명하도록 해 준다.
ta_in: இது பிழைத்திருத்தத்திற்கு உதவுவதாகும், ஆனால் பல உறுப்புகள் முழுவதும் பதிப்புகளைக் கண்காணிக்க மிகவும் வெளிப்படையானது.
tr_tr: Bu, hata ayıklamaya yardımcı olur, ancak aynı zamanda birden çok öğedeki sürümlerin izlenmesini daha şeffaf hale getirir.

source: Documentation Structure
de_de: Aufbau der Dokumentation
ko_kr: 문서 구조
ta_in: ஆவண அமைப்பு
tr_tr: Dokümantasyon Yapısı
