Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/qc_intro.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, zh_tw

source: The second principle of quantum mechanics that quantum computation can utilize is the phenomena of **entanglement**. Entanglement refers to states of more than one qubit (or particles in general) in which the combined state of the qubits contains more information than the qubits do independently. The overwhelming majority of multi-qubit quantum states are entangled, and represent a valuable resource. For example, entangled states between qubits can be used for quantum teleportation, where a shared entangled state of two qubits can be manipulated to transfer information from one qubit to another, regardless of the relative physical proximity of the qubits. Entangled states, as natural states of quantum systems, are also of importance in disciplines such as quantum chemistry and quantum simulation where the solution(s) often take the form of entangled multi-qubit states. One can also utilize highly-entangled quantum states of multiple qubits to, for example, generate certifiably random numbers. There is even a `Qiskit package <https://qiskit-rng.readthedocs.io/en/latest/>`_ to do this!
bn_bn: কোয়ান্টাম বলবিদ্যার দ্বিতীয় নীতি যেটি কোয়ান্টাম গণনা ব্যবহার করতে পারে তা হল **এনট্যাঙ্গেলমেন্ট** এর ঘটনা। এনট্যাঙ্গেলমেন্ট একাধিক কিউবিট (বা সাধারণভাবে কণা) এর মান বা অবস্থাকে বোঝায় যেখানে কিউবিটগুলি সম্মিলিত মান বা অবস্থা পৃথক কিউবিটের চেয়ে বেশি তথ্য বহন করে। বেশিরভাগ বহুকিউবিট কোয়ান্টাম মান বা ব্যবস্থা এনট্যাঙ্গেলড এবং এটি একটি জরুরি বিষয়। উদাহরণস্বরূপ, কিউবিটের এনট্যাঙ্গেলড অবস্থা কোয়ান্টাম টেলিপোর্টেশনে ব্যবহৃত হতে পারে, যেখানে দুটি কিউবিটের এনট্যাঙ্গেলড সহাবস্থাকে ব্যবহার করে কোনোরকম আপেক্ষিক নিকটবর্তিতার কথা চিন্তা না করেই একটি কিউবিট থেকে আরেকটিতে তথ্য আদানপ্রদান করা যায়। এনট্যাঙ্গেলড অবস্থা কোয়ান্টাম ব্যবস্থার একটি স্বাভাবিক অবস্থা যা কোয়ান্টাম রসায়ন ও কোয়ান্টাম সিমুলেশনেও গুরুত্বপূর্ণ যেখানে সমাধানগুলি প্রায়ই এনট্যাঙ্গেলড বহুকিউবিট মান বা অবস্থায় থাকে। উচ্চ এন্ট্যাঙ্গেলমেন্ট সম্পন্ন বহুকিউবিট বিশিষ্ট কোয়ান্টাম অবস্থার সাহায্যে দৈব সংখ্যা উৎপন্ন করা সম্ভব। এমনকি এটি করার জন্য একটি `Qiskit প্যাকেজ <https://qiskit-rng.readthedocs.io/en/latest/>`_ রয়েছে!
de_de: Das zweite Prinzip der Quantenmechanik, das die Quantenberechnung benutzen kann, ist das Phänomen der ** Verschränkung **. Die Verschränkung bezieht sich auf Zustände von mehr als einem Qubit (oder Teilchen im Allgemeinen), in denen der kombinierte Zustand der Qubits mehr Informationen enthält, als die Qubits unabhängig voneinander. Die überwältigende Mehrheit der Multi-Qubit-Quanten-Zustände sind verschränkt und stellen eine wertvolle Ressource dar. So können beispielsweise verschränkte Zustände zwischen Qubits für die Quanten-Teleportation verwendet werden, bei denen ein geteilter verschränkter Zustand von zwei Qubits unabhängig von der relativen physikalischen Nähe der Qubits zur Übertragung von Informationen von einem Qubit auf einen anderen manipuliert werden kann. Verschränkte Zustände, wie natürliche Zustände von Quantensystemen, sind auch in Disziplinen wie Quantenchemie und Quantensimulation von Bedeutung, bei denen die Lösung (en) oft die Form von verschränkten Multiqubit-Zuständen annehmen. Man kann auch hochverschränkte Quantenzustände von mehreren Qubits nutzen, um beispielsweise zertifizierbare Zufallszahlen zu erzeugen. Es gibt sogar ein ` Qiskit-Paket <https://qiskit-rng.readthedocs.io/en/latest/>` _ um dies zu tun!
el_gr: Η δεύτερη αρχή της κβαντικής μηχανικής είναι ότι ο κβαντικός υπολογισμός μπορεί να χρησιμοποιήσει τα φαινόμενα της **διεμπλοκής**. Η διεμπλοκή αναφέρεται σε περισσότερα από ένα qubit (ή σωματίδια γενικά) στα οποία η συνδυασμένη κατάσταση των qubits περιέχει περισσότερες πληροφορίες από ό,τι οι qubits ξεχωριστά. Η συντριπτική πλειοψηφία των πολλαπλών κβαντικών καταστάσεων είναι σε κατάσταση διεμπλοκής, και αντιπροσωπεύουν έναν πολύτιμο πόρο. Για παράδειγμα, οι καταστάσεις διεμπλοκής μεταξύ qubits μπορούν να χρησιμοποιηθούν για την κβαντική τηλεμεταφορά, όπου μπορεί να γίνει χρήση μιας κοινής κατάστασης διεμπλοκής δύο qubits για τη μεταφορά πληροφοριών από το ένα qubit σε ένα άλλο, ανεξάρτητα από τη σχετική φυσική εγγύτητα των qubits. Οι καταστάσεις διεμπλοκής, ως φυσικές καταστάσεις των κβαντικών συστημάτων, είναι επίσης σημαντικά σε κλάδους όπως η κβαντική χημεία και η κβαντική προσομοίωση όπου η λύση (ες) συχνά λαμβάνει τη μορφή πολλαπλών qubit καταστάσεων διεμπλοκής. Κάποιος μπορεί επίσης να χρησιμοποιήσει υψηλές κβαντικές καταστάσεις διεμπλοκής πολλαπλών qubits, για παράδειγμα, για να δημιουργήσει πιστοποιημένα τυχαίους αριθμούς. Υπάρχει ακόμη και ένα "Qiskit πακέτο <https://qiskit-rng.readthedocs.io/en/latest/>" _ για να το κάνουμε αυτό!
es_un: El segundo principio de la mecánica cuántica que puede utilizar la computación cuántica es el fenómeno del **entrelazamiento**. El entrelazamiento se refiere a estados de más de un qubit (o partículas en general) en los que el estado combinado de los qubits contiene más información que la de los qubits individualmente. La inmensa mayoría de los estados cuánticos de varios qubits están entrelazados y representan un recurso valioso. Por ejemplo, los estados entrelazados entre qubits se pueden usar para la teleportación cuántica, donde un estado entrelazado compartido de dos qubits se puede manipular para transferir información de un qubit a otro, independientemente de la proximidad física relativa de los qubits. Los estados entrelazados, como estados naturales de los sistemas cuánticos, también son importantes en disciplinas como la química cuántica y la simulación cuántica, donde la(s) solución(es) a menudo toman la forma de estados de múltiples qubits entrelazados. También se pueden utilizar estados cuánticos altamente entrelazados de múltiples qubits para, por ejemplo, generar números aleatorios certificables. ¡Incluso hay un `paquete de Qiskit <https://qiskit-rng.readthedocs.io/en/latest/>`_ para hacer esto!
fr_fr: Le deuxième principe de la mécanique quantique que le calcul quantique peut utiliser est le phénomène d'**intrication**. L'intrication fait référence à des états de plus d'un qubit (ou particules en général) dans lesquels l'état combiné des qubits contient plus d'informations que les qubits ne le font indépendamment. La très grande majorité des états quantiques multiqubits sont intriqués et représentent une ressource précieuse. Par exemple, les états intriqués entre les qubits peuvent être utilisés pour la téléportation quantique, où un état intriqué partagé de deux qubits peut être manipulé pour transférer des informations d'un qubit à un autre, quelle que soit la proximité physique relative des qubits. Les états intriqués, en tant qu'états naturels des systèmes quantiques, sont également importants dans des disciplines telles que la chimie quantique et la simulation quantique où la ou les solutions prennent souvent la forme d'états multiqubit intriqués. On peut aussi utiliser des états quantiques très intriqués de plusieurs qubits pour, par exemple, générer des nombres aléatoires certifiés. Il y a même un `module Qiskit <https://qiskit-rng.readthedocs.io/en/latest/>`_ pour faire cela !
it_it: Il secondo principio della meccanica quantistica che il calcolo quantistico può utilizzare è il fenomeno dell'**entanglement**. Entanglement si riferisce a stati di più di un qubit (o particelle in generale) che combinati permettono di contenere più informazioni dei singoli qubit indipendentemente. La stragrande maggioranza degli stati quantistici multi-qubit sono in entanglement e rappresentano una risorsa preziosa. Ad esempio, gli stati entangled tra qubit possono essere utilizzati per il teletrasporto quantistico, in cui uno stato entangled condiviso di due qubit può essere manipolato per trasferire informazioni da un qubit a un altro, indipendentemente dalla relativa vicinanza fisica dei qubit. Gli stati entangled, come stati naturali dei sistemi quantistici, sono importanti anche in discipline come la chimica quantistica e la simulazione quantistica in cui le soluzioni spesso assumono la forma di stati multi-qubit entangled. Si possono anche utilizzare stati quantistici altamente entangled di più qubit per, ad esempio, generare numeri casuali certificabili. C'è anche un `pacchetto Qiskit <https://qiskit-rng.readthedocs.io/en/latest/>`_ per farlo!
ja_jp: 量子計算が利用することのできる量子力学の第二原理は、 **エンタングルメント** という現象です。エンタングルメントとは、二つ以上の量子ビット (あるいは一般に複数粒子) の状態のことで、量子ビットの結合した状態は、単独の量子ビットよりも多くの情報を含んでいます。複数量子ビットの量子状態の圧倒的多数はエンタングルした状態であり、貴重なリソースとなっています。例えば、量子ビット間のエンタングル状態は量子テレポーテーションに用いることができます。量子テレポーテーションでは、二つの量子ビット間に共有されたエンタングル状態を操作することで、物理世界における相対的な近さによらず、一方の量子ビットからもう一方の量子ビットへ情報を転送することができます。量子系の自然な状態としてのエンタングル状態は、多くの場合に解がエンタングルした複数量子ビット状態となる量子化学や量子シミュレーションのような分野でも重要です。また例えば、複数量子ビットの非常にエンタングルした量子状態を利用することで、正真正銘の乱数を生成することもできます。これを行うための `Qiskit パッケージ <https://qiskit-rng.readthedocs.io/en/latest/>`_ さえ用意されています。
ko_kr: 양자 계산이 활용할 수 있는 양자역학의 두 번째 원리는 **entanglement** 의 현상이다. 얽힘 (Entanglement) 은 한 개 이상의 큐비트 (또는 일반적으로 입자들) 의 상태를 지칭하는데, 여기서 큐비트들의 결합된 상태는 큐비트들이 독립적으로 행하는 것보다 더 많은 정보를 포함한다. 다수의 큐비트 양자 상태들의 압도적인 다수는 얽히고, 가치 있는 자원을 나타낸다. 예를 들어, 큐비트들 사이의 얽힌 상태들은 큐비트의 상대적인 물리적 근접성에 상관없이, 두 개의 큐비트들의 공유된 얽힌 상태가 하나의 큐비트로부터 다른 큐비트로 정보를 전송하도록 조작될 수 있는 양자 이동을 위해 사용될 수 있다. 양자 시스템의 자연스러운 상태로서의 얽힘 상태는 양자 화학 (quantum chemistry) 과 양자 시뮬레이션 (quantum simulation) 과 같은 해법들이 종종 얽힌 다중-큐비트 (multi-qubit) 상태의 형태를 취하는 분야들에서도 중요하다. 또한, 인증 가능한 정도의 무작위성을 가진 난수들을 생성하기 위해 다수의 큐비트들의 고도로 얽힌 양자 상태들을 이용할 수도 있다. 이를 시행하기 위한 `Qiskit 패키지 <https://qiskit-rng.readthedocs.io/en/latest/>`_ 도 이미 있다.
pl_pl: Drugą zasadą mechaniki kwantowej, którą można wykorzystać w obliczeniach kwantowych jest zjawisko **splątania**. Splątanie odnosi się do stanu więcej niż jednego kubitu (lub innych cząstek), w których połączony stan kubitów zawiera więcej informacji niż każdy z nich osobno. Przytłaczająca większość stanów kwantowych więcej niż jednego kubitu jest splątana i stanowi cenny zasób. Stany splątane można wykorzystać między innymi w kwantowej teleportacji, gdzie wspólny stan splątany dwóch kubitów można użyć do transferu informacji z jednego kubitu do drugiego, niezależnie od względnej fizycznej odległości między kubitami. Jako naturalne stany systemu kwantowego, stany splątane są również istotne w dyscyplinach takich jak chemia kwantowa oraz symulacje kwantowe, gdzie rozwiązanie(a) często przyjmują formę stanów splątanych więcej niż jednego kubitu. Możliwe jest również wykorzystanie ściśle-splątanych stanów kwantowych wielu kubitów, np. do generowania prawdziwie losowych liczba. Istnieje również pakiet `Qiskit <https://qiskit-rng.readthedocs.io/en/latest/>`_ który to opisuje!
pt_un: O segundo princípio da mecânica quântica que a computação quântica pode utilizar é o fenômeno do **entrelaçamento**. Entrelaçamento se refere a estados de mais de um qubit (ou partículas em geral) nos quais o estado combinado dos qubits contém mais informações do que os qubits contêm independentemente. A esmagadora maioria dos estados quânticos multi-qubit são entrelaçados, e representam um recurso valioso. Por exemplo, estados entrelaçados entre qubits podem ser usados para teletransporte quântico, onde um estado entrelaçado compartilhado de dois qubits pode ser manipulado para transferir informações de um qubit para outro, independentemente da proximidade física relativa dos qubits. Os estados entrelaçados, que são estados naturais dos sistemas quânticos, também são importantes em disciplinas tais como química quântica e simulação quântica onde a(s) solução(ões) frequentemente assume a forma de estados multi-qubit entrelaçados. Pode-se também utilizar estados quânticos altamente entrelaçados de múltiplos qubits para, por exemplo, gerar números comprovadamente aleatórios. Existe até um `pacote Qiskit <https://qiskit-rng.readthedocs.io/en/latest/>`_ para fazer isso!
ru_ru: Второй принцип квантовой механики, который могут использоваться квантовые вычисления, - это явление **запутанности**. Запутанность относится к состояниям более чем одного кубита (или частицы в целом), в которых объединенное состояние кубитов содержит больше информации, чем кубиты по отдельности. Подавляющее большинство многокубитных квантовых состояний являются запутанными и представляют собой ценный ресурс. Например, запутанные состояния между кубитами могут быть использованы для квантовой телепортации, когда общим запутанным состоянием двух кубитов можно манипулировать для передачи информации от одного кубита к другому, независимо от физической близости кубитов. Запутанные состояния, как естественные состояния квантовых систем, также важны в таких дисциплинах, как квантовая химия и квантовое моделирование, где решение (решения) часто принимают форму запутанных мультикубитных состояний. Можно также использовать сильно запутанные квантовые состояния нескольких кубитов, например, для проверяемой генерации случайных чисел. Для этого даже существует пакет `Qiskit <https://qiskit-rng.readthedocs.io/en/latest/>`_!
sw_ke: Kanuni ya pili ya makanika ya kwanta ambayo inaweza kutumika na hesabu ya kwanta ni tukio la **mtangamano**. Mtangamano hurejelea hali zilizo na wingi wa qubit (au chembechembe kwa ujumla) ambapo hali unganifu za qubits zina ujumbe zaidi ya qubits huru. Idadi kubwa ya hali za kwanta za multi-qubit zinatangamana, na zinawakilisha rasilimali muhimu. Kwa mfano, hali ambazo ni tanagamano baina ya qubits zinaweza kutumika kwa teleportation ya kwanta, ambapo hali gawize iliyotangamana ya qubit mbili inawezafanywa kuhamisha ujumbe kutoka kwa qubit moja hadi nyingine, bila kujali ukaribu wa kimwili wa qubits hizo. Hali tangamano, kama hali asili za mifumo ya kwanta, pia zina umuhimu katika maudhui kama vile kemia ya kwanta na uigaji wa kwanta ambapo suluhisho mara nyingi huchukua fomu ya hali ya muti-qubit iliyotangamana. Mtu anaweza pia kutumia hali za kwanta zilizotangamana kiujuzi za qubits nyingi, kwa mfano, kuzalisha nambari nasibu zinazoweza kudhibitishwa. Hata kuna `furushi la Qiskit <https://qiskit-rng.readthedocs.io/en/latest/>`_ la kutekeleza haya!
ta_in: குவாண்டம் கணக்கீடு பயன்படுத்தக்கூடிய குவாண்டம் இயக்கவியலின் இரண்டாவது கொள்கை நிகழ்வுகளாக **entanglement** அமையும். என்டான்கில்மெண்ட் ஒன்றுக்கு மேற்பட்ட க்யூபிட் நிலைகளைக்(அல்லது பொதுவாக துகள்கள்) குறிப்பிடுகிறது, இதில் க்யூபிட்களின் ஒருங்கிணைந்த நிலை க்யூபிட்கள் சுயாதீனமாக செய்வதை விட அதிகமான தகவல்களைக் கொண்டுள்ளது. பல-க்யூபிட் குவாண்டம் நிலைகளில் பெரும்பான்மையானவை என்டான்கில்ட், மதிப்புமிக்க வளத்தைக் குறிக்கின்றன. எடுத்துக்காட்டாக, க்யூபிட்களுக்கு இடையில் சிக்கித் தவிக்கும் நிலைகள் குவாண்டம் டெலிபோர்ட்டேஷனுக்குப் பயன்படுத்தப்படலாம், அங்கு இரண்டு க்யூபிட்களின் பகிரப்பட்ட என்டான்கில்ட் நிலையை ஒரு க்யூபிட்லிருந்து இன்னொரு இடத்திற்கு மாற்றுவதற்கு கையாளலாம், இது க்யூபிட்களின் ஒப்பீட்டு உடல் அருகாமையைப் பொருட்படுத்தாமல். குவாண்டம் அமைப்புகளின் இயற்கையான நிலைகளாக, என்டான்கில்ட் நிலைகள், குவாண்டம் வேதியியல் மற்றும் குவாண்டம் உருவகப்படுத்துதல் போன்ற துறைகளிலும் முக்கியத்துவம் வாய்ந்தவை, அங்கு தீர்வு(கள்) பெரும்பாலும் என்டான்கில்ட் பல க்யூபிட் நிலைகளின் வடிவத்தை எடுக்கும். ஒருவர் பல க்யூபிட்களின் அதிக என்டான்கில்ட் குவாண்டம் நிலைகளையும் பயன்படுத்தலாம், எடுத்துக்காட்டாக, சான்றளிக்கும் வகையில் சீரற்ற எண்களை உருவாக்கலாம். இதனைச் செய்ய ஒரு `Qiskit package <https://qiskit-rng.readthedocs.io/en/latest/>`_ கூட உள்ளது!
te_in: క్వాంటం కంప్యూటేషన్ ఉపయోగించగల క్వాంటం మెకానిక్స్ యొక్క రెండవ సూత్రం ** entanglement** యొక్క దృగ్విషయం. ఎంటాంగిల్‌మెంట్ అనేది ఒకటి కంటే ఎక్కువ qubitల (లేదా సాధారణంగా కణాలు) స్థితులను సూచిస్తుంది, దీనిలో qubitల సంయుక్త స్థితి qubitలు స్వతంత్రంగా చేసే దానికంటే ఎక్కువ సమాచారాన్ని కలిగి ఉంటుంది. బహుళ-qubit క్వాంటం స్థితులలో అధిక భాగం చిక్కుకుపోయి(entangle), విలువైన వనరును సూచిస్తాయి. ఉదాహరణకు, qubitల మధ్య చిక్కుకున్న స్థితులను క్వాంటం టెలిపోర్టేషన్ కోసం ఉపయోగించవచ్చు, ఇక్కడ క్కుబిట్ల సాపేక్ష భౌతిక సామీప్యతతో సంబంధం లేకుండా, రెండు చిక్కుబడ్డ క్కుబిట్ల ఫేసులని మార్పిడిచేసి ఒక క్కుబిట్ నుండి మరొకదానికి సమాచారాన్ని బదిలీ చేయవచ్చు. క్వాంటం వ్యవస్థల సహజ స్థితులుగా చిక్కుకున్న స్థితులు, క్వాంటం కెమిస్ట్రీ మరియు క్వాంటం అనుకరణ వంటి విభాగాలలో కూడా ప్రాముఖ్యత కలిగి ఉంటాయి, ఇక్కడ పరిష్కారం(లు) తరచుగా entangled బహుళ-క్కుబిట్స్ స్టేట్ల రూపాన్ని తీసుకుంటాయి. బహుళ క్కుబిట్ల యొక్క అత్యంత entangled క్వాంటం స్థితులను కూడా ఉపయోగించవచ్చు, ఉదాహరణకు, ధృవీకరించదగిన యాదృచ్ఛిక సంఖ్యలను రూపొందించడానికి. దీన్ని చేయడానికి `Qiskit package <https://qiskit-rng.readthedocs.io/en/latest/>`_ కూడా ఉంది!
tr_tr: Kuantum hesaplamanın kullandığı kuantum mekaniğinin ikinci ilkesi **dolanıklık** olgusudur. Dolanıklık, kübitlerin bağımsız olarak içerdiğinden daha fazla bilgi içerebilen birleşik durumdaki kübitlerde, birden fazla kübitlik (veya genel olarak parçacıklar) durumları ifade eder. Çok-kübitli kuantum durumlarının çok büyük çoğunluğu dolanıktır ve değerli bir kaynağı temsil eder. Örneğin, kübitlerin göreli fiziksel yakınlığına bağlı olmadan bir kübitten diğerine bilgi iletmesi için ayarlanabilen paylaşılan dolanık iki kübitin olduğu yerde, kübitler arasındaki dolanık durumlar kuantum ışınlanma için kullanılabilir. Kuantum sistemlerin doğal durumları gibi dolanık durumlar, sonuçların genellikle çok-kübitli dolanık durum formunda olduğu kuantum simülasyon ve kuantum kimya gibi disiplinlerde de önemlidir. Örneğin onaylanmış rasgele sayılar üretmek için çok-kübitli yüksek dolanıklık kuantum durumları kullanılabilir. Bunu yapabilmek için bir Qiskit paketi bile var `Qiskit package <https://qiskit-rng.readthedocs.io/en/latest/>`_ !

source: Quantum circuits
bn_bn: কোয়ান্টাম বর্তনী (সার্কিট)
de_de: Quantenschaltungen
el_gr: Κβαντικά κυκλώματα
es_un: Circuitos cuánticos
fr_fr: Circuits quantiques
id_id: Sirkuit kuantum
it_it: Circuiti quantistici
ja_jp: 量子回路
ko_kr: 양자 회로
pl_pl: Obwody kwantowe
pt_un: Circuitos quânticos
ru_ru: Квантовые цепи
sw_ke: Saketi za kwanta
ta_in: குவாண்டம் சர்க்யூட்கள்
te_in: క్వాంటమ్ సర్క్యూట్లు
tr_tr: Kuantum devreleri
zh_tw: 量子電路
