Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/qc_intro.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, zh_tw

source: To see how this resource is utilized in quantum computation we first turn to a classical analog: noise cancellation. Noise cancellation, as done in noise cancelling headphones for example, is performed by employing superposition and the principle of **interference** to reduce the amplitude of unwanted noise by generating a tone of approximately the same frequency and amplitude, but out of phase by a value of :math:`\pi` (or any other odd integer of :math:`\pi`).
bn_bn: কোয়ান্টাম কম্পিউটেশনে এই সংস্থানটি কীভাবে ব্যবহৃত হয় তার জন্য আমরা প্রথমে দেখব অনুরূপ একটি প্রথাগত (ক্লাসিক্যাল) উদাহরণঃ দূষণ বা ত্রুটি দূরীকরন। উদাহরণস্বরূপ ত্রুটিমুক্ত হেডফোনগুলিতে ত্রুটি দূর করতে উপরিপাতন এবং **ব্যতিচার (ইন্টারফিয়ারেন্স)** নীতির প্রয়োগে অপ্রয়োজনীয় শব্দের বিস্তার কম করা হয় প্রায় একই কম্পাঙ্ক এবং বিস্তারযুক্ত কিন্তু :math:`\pi` (অথবা :math:`\pi` এর যেকোনো পূর্ণ বিজোড় গুণিতক ) কোণে দশাচ্যুত একটি সুর বা শব্দ তৈরি করে।
de_de: Um den Nutzen der quantenmechanischen Superposition besser zu verstehen, wird zuerst ein klassisches Analogon betrachtet: Rauschunterdrückung. Diese Technik wird zum Beispiel in Kopfhörern dazu benutzt, ungewollte Geräusche zu unterdrücken indem man Superposition zusammen mit Interferenz nutzt. Dabei wird ein Ton mit etwa gleicher Amplitude und Frequenz wie der Ungewollte erzeugt, allerding mit einer Phasenverschiebung von :math:`\pi` (oder jedem ungeraden ganzzahligen Vielfachen von :math:`\pi`).
el_gr: Για να δούμε πώς αυτός ο πόρος χρησιμοποιείται σε κβαντικό υπολογισμό γυρίζουμε πρώτα σε ένα κλασικό ανάλογο: την ακύρωση θορύβου. Ακύρωση θορύβου, όπως γίνεται σε ακουστικά με αυτή την λειτουργία, για παράδειγμα, εκτελείται με την χρήση της υπέρθεσης και της αρχής της **διεμπλοκής** για τη μείωση του πλάτους του ανεπιθύμητου θορύβου δημιουργώντας έναν τόνο περίπου της ίδιας συχνότητας και πλάτους, αλλά εκτός φάσης από μια τιμή :math:`\pi` (ή οποιονδήποτε άλλο περιττό ακέραιο :math:`\pi`).
es_un: Para ver cómo se utiliza este recurso en la computación cuántica, primero recurrimos a un análogo clásico: cancelación de ruido. La cancelación de ruido, como se hace en los auriculares con cancelación de ruido, por ejemplo, se realiza empleando la superposición y el principio de **interferencia** para reducir la amplitud del ruido no deseado generando un tono de aproximadamente la misma frecuencia y amplitud, pero desfasado por un valor de :math:`\pi` (o cualquier otro múltiplo entero impar de :math:`\pi`).
ko_kr: 이러한 개념이 어떻게 양자 계산에 사용되는지 알아볼려면 먼저 고전 컴퓨팅에서 상응하는 개념인 노이즈 캔슬링을 알아야 한다. 노이즈 캔슬링 헤드폰에서 사용되는 것과 같이 노이즈 캔슬링은 중첩과 **간섭** 의 원리를 이용해 원치 않는 소리와 비슷한 주파수와 진폭의 톤을 위상만 :math:`\pi` (아니면 :math:`\pi` 의 홀수 배수) 만큼 어긋나게 생성해 원치 않는 소리를 상쇄시킨다.
pl_pl: Aby zobrazować jak ta koncepcja jest wykorzystywana w obliczeniach kwantowych, musimy najpierw cofnąć się do klasycznego odpowiednika: wygłuszania dźwięku. Wygłuszanie dźwięku, stosowane np. w słuchawkach wygłuszających, działa w oparciu o superpozycję i zasadę **interferencji** do redukcji amplitudy niepożądanego szumu generując ton o tej samej częstotliwości i amplitudzie, ale przesunięty w fazie o :math:`\pi` (lub inną nieparzystą wartość :math:`\pi`).
pt_un: Para ver como esse recurso é utilizado na computação quântica , começamos com uma anlogia clássica: o cancelamento de ruído. Cancelamento de ruído, como utilizado em fones de ouvido com cancelamento de ruído, por exemplo, é realizado utilizando a superposição e o princípio de **interferência** para reduzir a amplitude de ruído indesejado gerando um tom de aproximandamente a mesma frequência e amplitude, mas fora de fase por um valor de :math:'\pi' (ou qualquer outro múltiplo inteiro ímpar de :math:'\pi').
ru_ru: Чтобы понять, как этот ресурс используется в квантовых вычислениях, мы сначала обратимся к классическому аналогу: шумоподавлению. Шумоподавление, как это делается, например, в наушниках, осуществляется при помощи принципа суперпозиции и **интерференции** волн, когда для уменьшения амплитуды нежелательного шума генерируется звук примерно той же частоты и амплитуды, но в противофазе на величину :math:`\pi` (или любое другое нечетное целое число :math:`\pi`).
sw_ke: Ili kuona jinsi rasilimali hii inatumika katika utarakilishi wa kwanta, kwanza tuangazie mfano wa klasiki: ukatishaji kelele. Ukatishaji kelele, kwa mfano, kama unavyofanywa katika hedifoni zinazokatisha kelele, unatekelezwa ukitumia superposition na kanuni ya **mwingiliano** kupunguza kimo cha wimbi la kelele ambazo hazitakikani kwa kuzalisha toni yenye takriban marudio na upeo sawa, lakini ambayo ina awamu kinyume kwa thamani ya :math:`\pi` (au nambari yoyote kamili ambayo ni witiri :math:`\pi`).
ta_in: குவாண்டம் கணக்கீட்டில் இந்த ஆதாரம் எவ்வாறு பயன்படுத்தப்படுகிறது என்பதைப் பார்க்க, நாம் முதலில் ஒரு கிளாசிக்கல் அனலாக்: சத்தம் ரத்து. சத்தம் ரத்துசெய்தல், எடுத்துக்காட்டாக, சத்தம் ரத்துசெய்யும் ஹெட்ஃபோன்களில் செய்யப்படுவது போல, ஏறக்குறைய ஒரே அதிர்வெண் மற்றும் அலைவீச்சின் தொனியை உருவாக்குவதன் மூலம் தேவையற்ற சத்தத்தின் வீச்சைக் குறைக்க சூப்பர்பொசிஷன் மற்றும் **interference** என்ற கொள்கையைப் பயன்படுத்துவதன் மூலம் செய்யப்படுகிறது, ஆனால் கட்டத்திற்கு வெளியே இதன் மதிப்பு :math:`\pi` (அல்லது வேறு ஏதேனும் ஒற்றைப்படை முழு எண் :math:`\pi`).
te_in: క్వాంటం కంప్యూటేషన్‌లో ఈ వనరు ఎలా ఉపయోగించబడుతుందో చూడడానికి మేము మొదట క్లాసికల్ అనలాగ్‌కి వెళ్తాము: నాయిస్ క్యాన్సిలేషన్. ఉదాహరణకు నాయిస్ క్యాన్సిలింగ్ హెడ్‌ఫోన్‌లలో చేసినట్లుగా, నాయిస్ క్యాన్సిలేషన్ అనేది సూపర్‌పొజిషన్ మరియు **ఇన్టర్పెరెన్స్** సూత్రాన్ని ఉపయోగించడం ద్వారా అవాంఛిత శబ్దం యొక్క వ్యాప్తిని తగ్గించడం ద్వారా దాదాపు అదే ఫ్రీక్వెన్సీ మరియు ఆంప్లిట్ట్యూడ్ యొక్క టోన్‌ను ఉత్పత్తి చేయడం ద్వారా నిర్వహించబడుతుంది, కానీ ఫేస్ నుండి బయటకి :math:` \pi ` (లేదా :math:`\pi` యొక్క ఏదైనా ఇతర బేసి పూర్ణాంకం) విలువ ద్వారా జరుగుతుంది.
tr_tr: Bu kaynağın kuantum hesaplamada nasıl kullanıldığını anlamak için ilk önce klasik bir analoğa dönüyoruz: gürültü engelleme. Gürültü engelleme, örneğin gürültü önleyici kulaklıklarda yapıldığı gibi, yaklaşık olarak aynı frekans ve genlikte fakat :math:`\pi` ( ya da :math:`\pi` nin herhangi bir tam tek sayısı) değeri faz dışı bir ton üreterek istenmeyen sesin genliğini azaltma girişimiyle birlikte süperpozisyon ve **girişim** ilkesi kullanılarak yürütülür.
zh_tw: 要看這個資源是如何在量子計算中使用的，我們首先轉向古典類比：噪音消除。 噪音消除，以耳機消噪為例，通過使用疊加和 **干涉的原理，去產生近似相同的頻率和振幅的音調來降低不想要的噪聲的幅度，但在兩者是以:math:`\pi` （或 :math:`\pi`的任何其它奇數的整數）數值令其反相來執行噪聲消除，從而降低了不想要的噪聲的幅度。

source: As shown above, when the phase difference is close to an odd multiple of :math:`\pi`, the superposition of the two waves results in interference, and an output that is significantly reduced compared to the original. The result is the signal of interest unencumbered by noise. Although this processing is done by digital circuits, the amplitude and phase are continuous variables that can never be matched perfectly, resulting in incomplete correction.
bn_bn: উপরের উল্লেখ অনুযায়ী, যখন দশা পার্থক্য প্রায় :math:`\pi` এর বিজোড় গুণিতক হয়, তখন দুটি তরঙ্গের উপরিপাতনের ফলস্বরূপ ব্যতিচার (ইন্টারফিয়ারেন্স) হয় এবং ফলাফল প্রকৃত সংকেতের তুলনায় উল্লেখযোগ্যভাবে কম হয়। ফলস্বরূপ তৈরি হয় ত্রুটিমুক্ত প্রয়োজনীয় সংকেত। যদিও এই প্রক্রিয়াজাতকরণ (প্রসেসিং) করা হয় ডিজিটাল বর্তনীর (সার্কিট) সাহায্যে এবং বিস্তার ও দশা হল অবিচ্ছিন্ন চলমান রাশি যেগুলির সম্পূর্ন সমকক্ষতা অসম্ভব, যার ফল হল অসম্পূর্ন সংশোধন।
de_de: Wie oben gezeigt, führt eine Phasendifferenz die ungefähr einem ungeraden Vielfachen von :math:` \pi ` entspricht, bei Überlagerung der beiden Wellen zu Interferenzen und einer im Vergleich zum Original deutlich reduzierten Leistung. Das Ergebnis ist ein erheblich verrauschten Signal. Obwohl die Verarbeitung durch digitale Schaltkreise erfolgt, sind Amplitude und Phase kontinuierliche Variablen, die nie perfekt aufeinander abgestimmt werden können, was zu einer unvollständigen Korrektur führt.
el_gr: Όπως φαίνεται παραπάνω, όταν η διαφορά φάσης είναι κοντά σε ένα περιττό πολλαπλάσιο του :math:` \pi `, η υπερθέση των δύο κυμάτων οδηγεί σε παρεμβολές, και μια έξοδο που είναι σημαντικά μειωμένη σε σύγκριση με το πρωτότυπο. Το αποτέλεσμα είναι το ενδιαφερόμενο σημα να μην επιβαρύνεται από το θόρυβο. Αν και αυτή η επεξεργασία γίνεται με ψηφιακά κυκλώματα, το εύρος και η φάση είναι συνεχείς μεταβλητές που δεν μπορούν ποτέ να αντιστοιχηθούν τέλεια, με αποτέλεσμα την ατελή διόρθωση.
es_un: Como se muestra arriba, cuando la diferencia de fase está cerca de un múltiplo impar de :math:`\pi`, la superposición de las dos ondas da como resultado una interferencia y una salida que se reduce significativamente en comparación con la original. El resultado es la señal de interés libre de ruido. Aunque este procesamiento se realiza mediante circuitos digitales, la amplitud y la fase son variables continuas que nunca pueden coincidir perfectamente, lo que resulta en una corrección incompleta.
ko_kr: 상술된 바와 같이, 위상차가 :math:`\pi` 의 홀수 배수에 가까울 때, 2개의 파동들의 중첩은 간섭을 초래하고, 출력은 원본에 비하여 현저하게 감소된다. 그 결과는 노이즈에 의해 방해받지 않는 관심신호이다. 이러한 처리는 디지털 회로에 의해 수행되지만, 진폭 및 위상은 완벽하게 매칭될 수 없는 연속 변수이며, 이는 불완전한 보정을 초래한다.
pl_pl: Jak pokazano powyżej, gdy różnica faz jest bliska nieparzystej wielokrotności :math:`\pi`, superpozycja obu fal wywołuje zjawisko interferencji, a sygnał wyjściowy zostaje znacznie zredukowany w porównaniu z sygnałem początkowym. Wynikiem jest sygnał wolny od szumu. Chociaż przetwarzanie sygnału odbywa się cyfrowo, amplituda i faza są zmiennymi ciągłymi, których nigdy nie można doskonale dopasować, co skutkuje niekompletną korekcją.
pt_un: Como mostrado acima, quando a diferença de fase é próxima de um múltiplo ímpar de :math:`\pi`, a superposição das duas ondas resulta em interferência e um resultado que é significativamente reduzido comparado ao original. O resultado é o sinal de interesse livre de ruído. Embora este processamento seja feito por circuitos digitais, a amplitude e a fase são variáveis contínuas que nunca podem ser combinadas perfeitamente, resultando numa correção incompleta.
ru_ru: Как было показано выше, когда разность фаз близка к нечетному кратному :math:`\pi`, суперпозиция двух волн приводит к интерференции, и выходной сигнал значительно уменьшается по сравнению с исходным. В результате получается интересующий нас сигнал, не содержащий шума. Несмотря на то, что эта обработка выполняется цифровыми схемами, поскольку амплитуда и фаза являются непрерывными переменными, которые никогда не могут быть идеально согласованы, коррекция всегда будет неполной.
sw_ke: Kama ilivyoonyeshwa hapo juu, tofauti ya fezi ikiwa karibu na kigawe witiri cha :math:`\pi`, superposition ya mawimbi hayo mawili husababisha mwingiliano na pato ambalo limepunguzwa kwa kiasi kikubwa ikilinganishwa na asili. Matokeo yake ni signali isiyokuwa na kasoro za kelele. Ingawa usindikaji huu unafanywa na saketi za kidijitali, tambo na fezi ni vigezo mwendeleo ambavyo haviwezi kulinganishwa kikamilifu, na hivyo husababisha masahihisho yasiyo kamili.
ta_in: மேலே காட்டப்பட்டுள்ளபடி, பக்க வித்தியாசம் :math:`\pi` இன் ஒற்றைப்படை மடங்குக்கு நெருக்கமாக இருக்கும்போது, இரண்டு அலைகளின் சூப்பர் பொசிஷன் குறுக்கீட்டில் விளைகிறது, மேலும் அசலுடன் ஒப்பிடும்போது ஒரு வெளியீடு கணிசமாகக் குறைக்கப்படுகிறது. இதன் விளைவாக இரைச்சலால் பாதிக்கப்படாத சிக்னல் ஆஃப் இண்ட்ரஸ்ட் வெளியாகிறது. இந்த செயலாக்கம் டிஜிட்டல் சர்க்யூட்களால் செய்யப்படுகிறது என்றாலும், வீச்சு மற்றும் கட்டம் தொடர்ச்சியான மாறிகள், அவை ஒருபோதும் சரியாக பொருந்தாது, இதன் விளைவாக முழுமையற்ற திருத்தம் ஏற்படுகிறது.
te_in: పైన చూపిన విధంగా, దశ వ్యత్యాసం బేసి గుణింతానికి దగ్గరగా ఉన్నప్పుడు :math:`\pi`, రెండు తరంగాల యొక్క సూపర్‌పొజిషన్ జోక్యం మరియు అసలైన దానితో పోలిస్తే గణనీయంగా తగ్గిన అవుట్‌పుట్‌కు దారి తీస్తుంది. ఫలితం నాయిస్ ద్వారా భారం లేని ప్రయోజనకరమైన సంకేతం. ఈ ప్రాసెసింగ్ డిజిటల్ సర్క్యూట్‌ల ద్వారా జరిగినప్పటికీ, నిరంతర వెరియేబులైన ఏంప్లిట్యూడ్ మరియు ఫేస్ ఎప్పుడూ సంపూర్ణంగా సరిపోలడం సాధ్యం కాదు, ఫలితంగా అసంపూర్ణ దిద్దుబాటు ఏర్పడుతుంది.
tr_tr: Yukarıda gösterildiği gibi, faz farkı :math:`\pi` nin tek katına yaklaştığında, iki dalganın süperpozisyonu girişimle ve orijinale kıyasla önemli ölçüde azalmış bir çıktı ile sonuçlanır. Sonuç, gürültüden etkilenmemiş ilgili sinyaldir. Bu işlem dijital devreler tarafından yapılmasına rağmen genlik ve faz, asla mükemmel bir şekilde eşleştirilemeyecek, eksik düzeltmeyle sonuçlanan sürekli değişkenlerdir.
zh_tw: 如上所示，當相位差接近 :math:`\pi`的奇數倍數時，兩波的疊加導致干涉，使輸出比原相的明顯減少。其結果是信號的利益沒有被雜訊所影響。雖然這種處理是由數位電路所完成，但振幅和相位都是無法完美匹配的連續變數，導致不完整的修正。

source: Quantum circuits enable a quantum computer to take in classical information and output a classical solution, leveraging quantum principles such as :ref:`interference <qc-intro-interference>` and :ref:`entanglement <qc-intro-entanglement>` to perform the computation.
bn_bn: কোয়ান্টাম বর্তনী (সার্কিট) গণনা সম্পাদন করতে একটি কোয়ান্টাম কম্পিউটারকে ধ্রুপদী (ক্লাসিক্যাল) তথ্য নিয়ে একটি ধ্রুপদী (ক্লাসিক্যাল) সমাধান আউটপুট দিতে সক্ষম করে :ref:`ব্যতিচার (ইন্টারফিয়ারেন্স) <qc-intro-interference>` এবং :ref:`এনট্যাঙ্গেলমেন্ট <qc-intro-entanglement>` কোয়ান্টাম নীতিগুলিকে কাজে লাগিয়ে।
de_de: Quantenschaltkreise ermöglichen es einem Quantencomputer, klassische Informationen zu übernehmen und eine klassische Lösung herauszugeben, indem Quantenprinzipien wie :ref:` Superposition <qc-intro-superposition>` und :ref:` Verschränkung <qc-intro-entanglement>` für die Berechnung genutzt werden.
el_gr: Τα κβαντικά κυκλώματα επιτρέπουν σε έναν κβαντικό υπολογιστή να λαμβάνει κλασικές πληροφορίες και να παράγει μια κλασική λύση, αξιοποιώντας κβαντικές αρχές όπως :ref:` παρεμβολές <qc-intro-interference>` και :ref:'entanglement <qc-intro-entanglement>' για την εκτέλεση του υπολογισμού.
es_un: Los circuitos cuánticos permiten a una computadora cuántica tomar información clásica y generar una solución clásica, aprovechando principios cuánticos como la :ref:`interferencia <qc-intro-interference>` y el :ref:`entrelazamiento <qc-intro-entanglement>` para realizar el cálculo.
ko_kr: 양자 회로는 양자 컴퓨터가 고전적인 정보를 받아들이고 고전적인 솔루션을 출력할 수 있게 하는데, 이 때 :ref:`간섭 <qc-intro-interference>` 과 :ref:`얽힘 <qc-intro-entanglement>` 과 같은 양자 원리를 사용하여 계산을 한다.
pl_pl: Obwody kwantowe umożliwiają komputerowi kwantowemu przyjmowanie informacji klasycznych i uzyskanie klasycznego rozwiązania, wykorzystując zasady mechaniki kwantowej takie jak :ref:`interferencja <qc-intro-interference>` i :ref:`splątanie <qc-intro-entanglement>` do wykonywania obliczeń.
pt_un: Circuitos quânticos permitem a um computador quântico receber informação clássica e oferecer uma solução clássica, aproveitando princípios quânticos como a :ref:`interference<qc-intro-interference>` e o :ref:`entanglement<qc-intro-entanglement>` para realizar a computação.
ru_ru: Квантовые цепи позволяют квантовому компьютеру принимать на входе классическую информацию и выводить классическое решение, используя такие квантовые принципы, как :ref:`интерференция<qc-intro-interference>` и :ref:`запутанность<qc-intro-interference><qc-intro-entanglement>` для выполнения вычислений.
sw_ke: Saketi za kwanta huwezesha tarakilishi ya kwanta kuchukua habari za kiklasiki na kutupa suluhisho la kiklasiki, kupitia kanuni za kwanta kama vile :ref:`mwingiliano <qc-intro-interference>` na :ref:`mtangamano <qc-intro-entanglement>` ili kufanya hisabati.
ta_in: குவாண்டம் சுற்றுகள் ஒரு குவாண்டம் கணினியை கிளாசிக்கல் தகவல்களை எடுத்து கிளாசிக்கல் தீர்வை வெளியிடுவதற்கு உதவுகின்றன. இது :ref:`interference<qc-intro-interference>` மற்றும் :ref:`entanglement<qc-intro-entanglement>` க்கு கணக்கீடு செய்ய உதவுவதன் மூலம், குவாண்டம் கொள்கைகளை மேம்படுத்துகிறது.
te_in: క్వాంటం సర్క్యూట్‌లు క్వాంటం కంప్యూటర్‌ని క్లాసికల్ సమాచారాన్ని తీసుకోవడానికి మరియు క్లాసికల్ సొల్యూషన్‌ను అవుట్‌పుట్ చేయడానికి వీలు కల్పిస్తాయి, :ref:`interference <qc-intro-interference>` మరియు :ref:`entanglement <qc-intro-entanglement>` వంటి క్వాంటం సూత్రాలను గణనను నిర్వహించేందుకు ప్రభావితం చేస్తాయి.
tr_tr: Kuantum devreleri, bir kuantum bilgisayarın klasik bilgiyi almasına ve klasik bir çözüm üretmesine olanak tanır ve hesaplamayı gerçekleştirmek için :ref:`interference <qc-intro-interference>` ve :ref:`entanglement <qc-intro-entanglement>` gibi kuantum ilkelerinden yararlanır.
zh_tw: 量子電路使量子計算機能夠掌握經典的資訊並輸出經典的解決方案，利用諸如 :ref:`干涉<qc-intro-interference>` 和 :ref:`糾纏 <qc-intro-entanglement>` 的量子原理進行計算。
