Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/qc_intro.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, zh_tw

source: Quantum computers which are programmed using quantum circuits can be constructed out of any quantum technology that allows for defining qubit elements, and can implement single- and multi-qubit gate operations with high-fidelity. At present, architectures based on superconducting circuits, trapped-ions, semiconducting quantum-dots, photons, and neutral atoms, are actively being developed, and many are accessible to users over the internet. Qiskit is agnostic with respect to the underlying architecture of a given quantum system, and can compile a quantum circuit to match the entangling gate topology of a quantum device, map the circuit instructions into the native gate set of the device, and optimize the resulting quantum circuit for enhanced fidelity.
bn_bn: কোয়ান্টাম বর্তনী (সার্কিট) ব্যবহার করে প্রোগ্রাম করা কোয়ান্টাম কম্পিউটারগুলি যে কোনো কোয়ান্টাম প্রযুক্তি দিয়ে তৈরি করা সম্ভব, যা কিউবিটকে সংজ্ঞায়িত করতে পারে এবং উচ্চ-বিশ্বস্ততার সাথে একক এবং বহুকিউবিট গেট ক্রিয়াকলাপ (অপারেশন) গুলি বাস্তবায়ন করতে পারে। বর্তমানে, সুপারকনডাক্টিং বর্তনী (সার্কিট), ট্র্যাপ্ড-আয়ন, অর্ধপরিবাহী কোয়ান্টাম-বিন্দু (ডটস), ফোটন এবং নিরপেক্ষ পরমাণুগুলির উপর ভিত্তি করে তৈরি নকশাগুলো সক্রিয়ভাবে বিকশিত হচ্ছে এবং এর মধ্যে অনেকগুলি ইন্টারনেট ব্যবহারকারীদের কাছে সুগম। Qiskit কোনো কোয়ান্টাম ব্যবস্থার অন্তর্নিহিত নকশা নিরপেক্ষ এবং একটি কোয়ান্টাম যন্ত্রের এনট্যাঙ্গলিং গেইট স্তরবিন্যাসক্রম (টপোলজি)-এর মানানসই করে কোয়ান্টাম বর্তনী(সার্কিট) কে সংকলন করতে পারে, বর্তনীর (সার্কিট) নির্দেশনাগুলিকে স্থানীয় যন্ত্রের যুক্তিবর্তনীগুলির (গেইট) সাথে মিলিয়ে বা ম্যাপ করে এবং ফলস্বরূপ কোয়ান্টাম বর্তনী (সার্কিট) কে উচ্চ-বিশ্বস্ততার জন্য অনুকূলকরণ (অপটিমাইজ) করে।
de_de: Quantencomputer, die mittels Quantenschaltkreisen programmiert werden, können im Prinzip aus jeder Quantentechnologie konstruiert werden, wenn diese Single- und Multi-Qubit-Gatte Operationen mit hoher Zuvarlässigkeit realisieren kann. Derzeit werden aktiv Architekturen entwickelt, die auf superleitenden Schaltkreisen, Ionenfallen, Halbleiterquantenpunkten, Photonen und neutralen Atomen basieren. Viele sind über das Internet für Nutzer zugänglich. Qiskit kapselt die Architektur des jeweiligen Quantensystems und kompiliert der Quantengattertopologie eines Gerätes entsprechende Quantenschaltungen, bildet die Schaltkreisbefehle auf dessen nativen Satz von Gates ab und optimiert die resultierende Quantenschaltung für eine erhöhte Genauigkeit.
el_gr: Οι κβαντικοί υπολογιστές που προγραμματίζονται χρησιμοποιώντας κβαντικά κυκλώματα μπορούν να κατασκευαστούν από οποιαδήποτε κβαντική τεχνολογία που επιτρέπει τον καθορισμό στοιχείων qubit και μπορούν να εφαρμόσουν λειτουργίες πύλης μονών και πολλαπλών qubit με υψηλή πιστότητα. Προς το παρόν, αναπτύσσονται ενεργά αρχιτεκτονικές που βασίζονται σε υπεραγώγιμα κυκλώματα, παγιδευμένα ιόντα, ημιαγώγιμες κβαντικές κουκκίδες, φωτόνια και ουδέτερα άτομα και πολλές είναι προσβάσιμες στους χρήστες μέσω του Διαδικτύου. Το Qiskit είναι αγνωστικό σε σχέση με την υποκείμενη αρχιτεκτονική ενός δεδομένου κβαντικού συστήματος και μπορεί να μεταγλωττίσει ένα κβαντικό κύκλωμα για να ταιριάξει με την τοπολογία διεμπλοκής πύλης μιας κβαντικής συσκευής, να χαρτογραφήσει τις οδηγίες κυκλώματος στο εγγενές σετ πύλης της συσκευής και να βελτιστοποιήσει το προκύπτον κβαντικό κύκλωμα για βελτιωμένη πιστότητα.
es_un: Las computadoras cuánticas que se programan utilizando circuitos cuánticos pueden construirse a partir de cualquier tecnología cuántica que permita definir elementos de qubits y pueda implementar operaciones de compuertas de uno y varios qubits con alta fidelidad. En la actualidad, se están desarrollando activamente arquitecturas basadas en circuitos superconductores, iones atrapados, puntos cuánticos semiconductores, fotones y átomos neutros, y muchos son accesibles para los usuarios a través de Internet. Qiskit es agnóstico con respecto a la arquitectura subyacente de un sistema cuántico dado y puede compilar un circuito cuántico para que coincida con la topología de la compuerta de entrelazamiento de un dispositivo cuántico, mapear las instrucciones del circuito en el conjunto de compuertas nativas del dispositivo y optimizar el circuito cuántico resultante para mejorar la fidelidad.
ko_kr: 양자 회로를 사용하여 프로그램되는 양자 컴퓨터들은 큐비트의 원소를 정의할 수 있는 아무 양자 기술을 사용하여 구축될 수 있고, 고충실도의 단일과 다중 큐비트 게이트 연산을 시행할 수 있다. 현재 초전도 회로, 이온 트랩, 양자점 반도체, 광자, 그리고 중성 원자를 기반으로 다양한 양자 컴퓨터 구조가 개발되고 있으며, 대다수는 이미 인터넷을 통해 사용해 볼 수 있다. Qiskit은 양자 시스템의 구조에 대한 전문 지식이 없어도 사용 가능하며, 양자 회로를 컴파일해 특정 양자 장치와 뒤엉킴 게이트의 위상을 일치시킬 수 있고, 회로 명령어를 장치의 기본 게이트 세트에 매핑시킬 수 있으며, 더 높은 충실도를 위해 양자 회로를 최적화시킬 수도 있다.
pl_pl: Komputery kwantowe, programowane z użyciem obwodów kwantowych, można zbudować za pomocą każdej technologii, która pozwala na zdefiniowanie podstawowych kubitów oraz jest w stanie zaimplementować pojedyncze i multikubitowe operacje z wysoką wiernością. Obecnie prowadzone są prace nad architekturami opartymi na obwodach nadprzewodzących, pułapkach jonowych, półprzewodnikowych kropkach kwantowych, fotonach oraz neutralnych atomach. Wiele z tych architektur dostępnych jest w Internecie. Qiskit jest niezależny od rodzaju architektury danego układu kwantowego. Ponadto jest w stanie: skompilować obwod kwantowy tak, by pasował do topologii bramki plączącej urządzenia kwantowe; mapować instrukcje obwodu na podstawowy zbiór bramek danego urządzenia; oraz zoptymalizować ostateczny obwód kwantowy, aby zwiększyć wierność.
pt_un: Computadores quânticos programados com circuitos quânticos podem ser construídos de qualquer tecnologia quântica que permite a definição de qubits e que consegue implementar operações quânticas de um ou dois qubits com alta fidelidade. Atualmente, arquiteturas baseadas em circuitos supercondutores, íons presos, pontos quânticos semicondutores, fótons e átomos neutros estão ativamente sendo desenvolvidas e muitas estão disponíveis para usuários através da internet. O Qiskit é agnóstico em relação a arquitetura subjacente de um dado sistema quântico, e pode compilar um circuito quântico para funcionar com a topologia de porta de emaranhamento de um dispositivo quântico, mapear as instruções do circuito ao conjunto nativo de portas do dispositivo, e optimizar o circuito quântico resultante para fidelidade aprimorada.
ru_ru: Квантовые компьютеры, которые программируются с помощью квантовых цепей, могут быть построены на основе любой квантовой технологии, позволяющей задать элементы кубита, и способной реализовать одно- и многокубитные операции с высокой точностью. В настоящее время активно разрабатываются архитектуры на основе сверхпроводящих схем, ионов в ловушках, полупроводниковых квантовых точек, фотонов и нейтральных атомов, и многие из них доступны пользователям через интернет. Qiskit не зависит от базовой архитектуры данной квантовой системы и может скомпилировать квантовую схему в соответствии с топологией запутывающих вентилей квантового устройства, преобразовать инструкции схемы в набор вентилей устройства и оптимизировать полученную квантовую схему для повышения точности.
sw_ke: Tarakilishi za kwanta zinazoprogramiwa kutumia saketi za kwanta zinaweza kujengwa kutoka kwa teknolojia yoyote ya kwanta inayowezesha ufafanulizi wa vipengee vya qubit na inaweza utekelezaji wa operesheni za qubit moja na qubit nyingi kwa usahihi wa hali ya juu. Kwa sasa, ujenzi unaotegemea saketi za superconductors, trapped-ions, semiconducting quantum-dots, fotoni na atomi neutral, zinaendelezwa kikamilifu, na nyingi zinapatikana kwa watumiaji kwenye mtandao. Qiskit ni agnostiki kwa msingi wa usanifu wa mfumo wa kwanta, na inaweza kukusanya saketi ya kwanta ili kulingana na topolojia ya lango inayoentangle ya kifaa cha kwanta, kupanga maagizo ya saketi katika seti ya lango la asili la kifaa, na kuboresha saketi ya kwanta kwa usahihi ulioimarishwa.
ta_in: குவாண்டம் சர்க்யூட்களைப் பயன்படுத்தி திட்டமிடப்பட்ட குவாண்டம் கணினிகள் குவாண்டம் கூறுகளை வரையறுக்க அனுமதிக்கும் எந்த குவாண்டம் தொழில்நுட்பத்திலிருந்தும் உருவாக்கப்படலாம், மேலும் ஒற்றை மற்றும் பல-க்யூபிட் கேட் செயல்பாடுகளை அதிக நம்பகத்தன்மையுடன் செயல்படுத்த முடியும். தற்போது, ​​சூப்பர் கண்டக்டிங் சர்க்யூட்கள், ட்ராப்ட்-அயனிகள், குறைக்கடத்தி குவாண்டம்-புள்ளிகள், ஃபோட்டான்கள் மற்றும் நடுநிலை அணுக்கள் ஆகியவற்றை அடிப்படையாகக் கொண்ட கட்டமைப்புகள் தீவிரமாக உருவாக்கப்பட்டு வருகின்றன, மேலும் பல இணையத்தில் பயனர்களுக்கு அணுகப்படுகின்றன. கொடுக்கப்பட்ட குவாண்டம் அமைப்பின் அடிப்படைக் கட்டமைப்பைப் பொறுத்தவரை Qiskit அஞ்ஞானவாதி, மேலும் ஒரு குவாண்டம் சாதனத்தின் சிக்கலான கேட் டோபாலஜியுடன் பொருந்த ஒரு குவாண்டம் சர்க்யூட்டைத் தொகுக்கலாம், சர்க்யூட் வழிமுறைகளைச் சாதனத்தின் சொந்த கேட் தொகுப்பில் வரைபடமாக்கலாம் மற்றும் அதன் விளைவாக வரும் குவாண்டம் சர்க்யூட்டின் நம்பகத்தன்மையை மேம்படுத்தலாம்.
te_in: క్వాంటం సర్క్యూట్‌లను ఉపయోగించి ప్రోగ్రామ్ చేయబడిన క్వాంటం కంప్యూటర్‌లు క్కుబిట్ మూలకాలను నిర్వచించడానికి అనుమతించే ఏదైనా క్వాంటం టెక్నాలజీ నుండి నిర్మించబడతాయి మరియు అధిక-విశ్వసనీయతతో సింగిల్- మరియు మల్టీ-క్కుబిట్ గేట్ ఆపరేషన్‌లను అమలు చేయగలవు. ప్రస్తుతం, సూపర్ కండక్టింగ్ సర్క్యూట్‌లు, ట్రాప్డ్-అయాన్‌లు, సెమీకండక్టింగ్ క్వాంటం-డాట్‌లు, ఫోటాన్‌లు మరియు న్యూట్రల్ అణువుల ఆధారంగా నిర్మాణాలు చురుకుగా అభివృద్ధి చేయబడుతున్నాయి మరియు చాలా వరకు ఇంటర్నెట్‌లో వినియోగదారులకు అందుబాటులో ఉన్నాయి. ఇచ్చిన క్వాంటం సిస్టమ్ యొక్క అంతర్లీన ఆర్కిటెక్చర్‌కు సంబంధించి కిస్కిట్ అజ్ఞాతవాది, మరియు మెరుగైన విశ్వసనీయత కోసం క్వాంటం పరికరం యొక్క ఎంటాంగ్లింగ్ గేట్ టోపోలాజీతో సరిపోలడానికి ఒక క్వాంటం సర్క్యూట్‌ను కంపైల్ చేయవచ్చు, పరికరం యొక్క స్థానిక గేట్ సెట్‌లో సర్క్యూట్ సూచనలను మ్యాప్ చేయవచ్చు మరియు ఫలితంగా వచ్చే క్వాంటం సర్క్యూట్ను ఆప్టిమైజ్ చేయవచ్చు.
tr_tr: Kuantum devreleri kullanılarak programlanan kuantum bilgisayarları kübit ögelerinin tanımlanmasına imkan sağlayan, tek ve çok kübitli kapı işlemlerini yüksek doğrulukla uygulayabilen herhangi bir kuantum teknolojisi ile üretilebilir. Şu anda, süper iletken devreleri, tuzaklanmış iyonları, yarı iletken kuantum noktalarını, fotonları ve nötr atomları temel alan mimariler aktif olarak geliştirilmektedir ve birçoğuna internet üzerinden kullanıcılar tarafından erişilebilir. Qiskit, belirli bir kuantum sisteminin temel mimarisine göre agnostiktir ve bir kuantum cihazının dolanıklaştırma kapısı topolojisine uyacak bir kuantum devresi derleyebilir, devre talimatlarını cihazın yerel kapı setine eşleyebilir ve ortaya çıkan kuantum devresini gelişmiş doğruluk için optimize edebilir.

source: Constructing complex quantum circuits with minimal effort is at the heart of Qiskit, that support a rich feature set of operations, and can be passed to a range of :ref:`quantum computers <qc-intro-computers>` or classical simulators. With only a few lines of code, it is possible to construct complex circuits like the one above.
ta_in: குறைந்த முயற்சியுடன் சிக்கலான குவாண்டம் சர்க்யூட்களை உருவாக்குவது Qiskit இன் மையத்தில் உள்ளது, இது சிறப்பான செயல்பாடுகளின் தொகுப்பை ஆதரிக்கிறது, மேலும் :ref:`quantum கணினிகள் <qc-intro-computers>` அல்லது கிளாசிக்கல் சிமுலேட்டர்களுக்கு அனுப்பலாம். குறியீட்டின் சில வரிகளை மட்டுமே கொண்டு, மேலே உள்ளதைப் போன்ற சிக்கலான சுற்றுகளை உருவாக்க முடியும்.
