Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/qc_intro.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, zh_tw

source: Quantum gates form the primitive operations on quantum data. Quantum gates represent information preserving, reversible transformations on the quantum data stored in qubits. These "unitary" transformations represent the quantum mechanical core of a quantum circuit. Some gates such as :math:`X` (also written as :math:`\oplus`) and :math:`CX` have classical analogs such as bit-flip and :math:`XOR` operations, respectively, while others do not. The Hadamand (:math:`H`) gate, along with the parameterized rotates :math:`rX(\theta)` and :math:`rY(\theta)`, generate non-classical superposition states, while gates such as :math:`Z`, :math:`rZ(\theta)`, :math:`S`, and :math:`T` impart phases that can be used for interference. Two-qubit gates like the :math:`CX` gate are used to generate entanglement between pairs of qubits, or to "kick" the phase from one qubit ot another. In contrast to gates, operations like "measurement", represented by the meter symbol in a box with a line connecting to a "target" wire, extract enough information about a qubit's state, including the phase, to be able to represent it as a classical bit and write that classical bit onto the target wire (often a fully classical wire in some readout device). This is the typical way to take information from the quantum data into a classical device. Note that with only :math:`H`, :math:`rZ(\theta)`, :math:`CX`, and measurement gates, i.e. a universal gate set, we can construct any quantum circuit, including those efficiently computing the dynamics of any physical system in nature.
fr_fr: Les portes quantiques forment les opérations primitives sur les données quantiques. Les portes quantiques représentent des transformations réversibles préservant les données quantiques stockées en qubits. Ces transformations "unitaires" représentent la mécanique quantique qui est au coeur d'un circuit quantique. Certaines portes telles que :math:`X` (également écrite comme :math:`\oplus`) et :math:`CX` ont des analogues classiques tels que les opérations bit-flip et :math:`XOR` respectivement, mais ce n'est pas toujours le cas. La porte Hadamard (:math:`H`) et les rotations paramétrées :math:`rX(\theta)` et :math:`rY(\theta)`, génèrent des états de superposition non classiques, tandis que les portes telles que :math:`Z`, :math:`rZ(\theta)`, :math:`S`, et :math:`T` produisent des phases qui peuvent être utilisées pour des interférences. Les portes à deux bits comme la porte :math:`CX` sont utilisées pour générer une intrication entre les paires de qubits, ou pour "expulser" la phase d'un qubit veers un autre. Contrairement aux portes, des opérations comme "la mesure", représenté par le symbole d'un compteur dans une boîte avec une ligne se connectant à un fil "cible", ont pour but d'extraire suffisamment d'informations à propos de l'état d'un qubit, y compris la phase, pour être capable de le représenter comme un bit classique et d'écrire ce bit classique sur le fil cible (souvent un fil entièrement classique dans un dispositif de lecture). C'est la façon typique de passer les informations des données quantiques vers un appareil classique. Notez qu'avec seulement :math:`H`, :math:`rZ(\theta)`, :math:`CX`, et des portes de mesure, qui constitue un ensemble de portes universel, nous pouvons construire n’importe quel circuit quantique, y compris ceux qui calculent efficacement la dynamique de n’importe quel système physique dans la nature.
it_it: Le porte quantistiche formano le operazioni primitive sui dati quantistici. Le porte quantistiche rappresentano trasformazioni reversibili e che conservano le informazioni sui dati quantistici memorizzati in qubit. Queste trasformazioni "unitarie" rappresentano il nucleo della meccanica quantistica di un circuito quantistico. Alcune porte come :math:`X` (scritto anche come :math:`\oplus`) e :math:`CX` hanno analoghi classici come bit-flip e :math:`XOR`, rispettivamente, mentre altri no. Il gate Hadamand (:math:`H`), insieme alle rotazioni parametrizzate :math:`rX(\theta)` e :math:`rY(\theta)`, generano stati di sovrapposizione non classici, mentre gates come :math:`Z`, :math:`rZ(\theta)`, :math:`S` e :math:`T` definiscono fasi che possono essere utilizzate per l'interferenza. I gate a due qubit come il gate :math:`CX` sono usati per generare entanglement tra coppie di qubit, o per "kickare" (scalciare, sfasare) la fase da un qubit all'altro. A differenza dei gate, operazioni come la misurazione, rappresentata dal simbolo del misuratore in una scatola con una linea che si collega ad un cavo specifico del circuito, estraggono informazioni sufficienti sullo stato di un qubit, compresa la fase, in modo da rappresentarlo come un bit classico e poter scrivere il risultato di quel bit classico sul cavo di destinazione (spesso un cavo completamente classico in qualche dispositivo di lettura). Questo è il modo tipico per trasferire le informazioni dai dati quantistici in un dispositivo classico. Nota che con solo :math:`H`, :math:`rZ (\theta)`, :math:`CX`, e le porte di misurazione, cioè un insieme di porte universali, possiamo costruire qualsiasi circuito quantistico, compresi quelli in modo efficiente calcolare le dinamiche di qualsiasi sistema fisico in natura.
ja_jp: 量子ゲートは、量子データの最も基本的な操作をなしています。量子ゲートは量子ビットに格納された量子データの情報保存および可逆的な変換を表現しています。これらの「ユニタリー」変換は量子回路の量子力学的な本質を表しています。 :math:`X` (:math:`\oplus` とも書かれる) や :math:`CX` といったいくつかのゲートは、それぞれビット反転や :math:`XOR` 演算のような古典的なアナログを持っていますが、他のゲートにはそれがありません。アダマール (:math:`H`) ゲートは、パラメータ表示された回転 :math:`rX(\theta)` や :math:`rY(\theta)` とともに、非古典的な重ね合わせ状態を生成します。 :math:`Z` や :math:`rZ(\theta)` , :math:`S` , :math:`T` といったゲートは、干渉に用いることのできる位相に影響を与えます。 :math:`CX` ゲートのような二量子ビットゲートは、量子ビット対の間にエンタングルメントを生成したり、ある量子ビットから別の量子ビットへ位相を「キック」したりするために用いられます。ゲートとは対照的に、「測定」のような操作は、線が「ターゲット」ワイヤに接続されている、箱の中のメーターシンボルで表され、位相を含む量子ビットの状態に関する十分な情報を抽出し、それを古典ビットとして表現して、その古典ビットをターゲットワイヤ (多くの場合、読み出しデバイスでこれは完全に古典的なワイヤです) に書き込むことができます。これが、量子データから古典デバイスに情報を取り込む典型的な方法です。 :math:`H`, :math:`rZ(\theta)`, :math:`CX` と測定ゲート、すなわちユニバーサルゲートセットだけによって、自然界の任意の物理システムのダイナミクスを効率的に計算できるものを含む、あらゆる量子回路を構築できるということに注意してください。

source: Some workloads contain an extended sequence of interleaved quantum circuits and classical computation, for example variational quantum algorithms execute quantum circuits within an optimization loop. For these workloads, system performance increases substantially if the quantum circuits are parameterized, and transitions between circuit execution and non-current classical computation are made efficient. Consequently, we define **near-time computation** to refer to computations with algorithms that make repeated use of quantum circuits with hardware developed to speed up the computation time. In near-time computation, the classical computation occurs on a time scale longer than the coherence of the quantum computation. Contrast this with **real-time computation**, where the classical computation occurs within the decoherence time of the quantum device.
bn_bn: কিছু নির্দিষ্ট কাজে আন্তঃবাহিত কোয়ান্টাম সার্কিট এবং ধ্রুপদী (ক্লাসিক্যাল) গণনার সম্প্রসারিত অনুক্রম থাকে, যেমন পরিবর্তনশীল (ভ্যারিয়েশনাল) কোয়ান্টাম অ্যালগরিদম একটি অনুকূলকরণ (অপটিমাইজেশন) লুপের মধ্যে কোয়ান্টাম বর্তনীকে (সার্কিট) কার্যকর করে। এই সব কাজের জন্য, কোয়ান্টাম বর্তনী(সার্কিট) গুলি পরামিতিক (প্যারামিটারাইজড) করা থাকলে পদ্ধতির কার্যকারিতা যথেষ্ট পরিমাণে বৃদ্ধি পায়, ও বর্তনী (সার্কিট) সম্পাদন এবং অ-বর্তমান ধ্রুপদী (ক্লাসিক্যাল) গণনার মধ্যে রূপান্তরগুলি সাশ্রয়ী হয়ে ওঠে। তো **নিয়ার-টাইম কম্পিউটেশন** বলতে অ্যালগরিদমের সাহায্যে গণনার উল্লেখ বোঝায়, যা গণনার গতি বৃদ্ধির জন্য তৈরি হার্ডওয়্যারে কোয়ান্টাম সার্কিটের বারবার (রিপিটেড ইউজ) ব্যবহার করে। নিয়ার-টাইম কম্পিউটেশনে, ধ্রুপদী (ক্লাসিক্যাল) গণনা কোয়ান্টাম গণনার সমদশার (কোহেরেন্স) চেয়ে দীর্ঘ সময়ব্যাপী। এর বিপরীতে **রিয়াল-টাইম কম্পিউটেশন**, যেখানে ধ্রুপদী (ক্লাসিক্যাল) গণনা কোয়ান্টাম যন্ত্রের অসমদশার (ডিকোহেরেন্স) সময়ের মধ্যেই সম্পন্ন হয়।
de_de: Einige Workloads enthalten eine erweiterte Folge von verschachtelten Quantenschaltkreisen und klassischen Berechnungen, wie zum Beispiel Variations-Quantenalgorithmen, die Quantenschaltkreise innerhalb einer Optimierungsschleife ausführen. Für diese Workloads erhöht sich die Systemleistung erheblich, wenn die Quantenschaltkreise parametrisiert werden und Übergänge zwischen der Schaltkreissausführung und der nicht aktuellen klassischen Berechnung effizient gemacht werden. Folglich definieren wir ** Nahzeitberechnung **, um auf Berechnungen mit Algorithmen zu verweisen, die von mehrfacher Verwendung bestimmter Quantenschaltkreise Gebrauch macht auf Hardware, die entwickelt wurde, um die Rechenzeit zu verkürzen. In der Nahzeitberechnung erfolgt die klassische Berechnung auf einer zeitlichen Skala, die länger ist als die Kohärenz der Quantenberechnung. Im Gegensatz dazu erfolgt bei der ** Echtzeitberechnung ** die klassische Berechnung innerhalb der Dekohärenzzeit der Quantenvorrichtung.
el_gr: Μερικά φορτία εργασίας περιέχουν μια εκτεταμένη ακολουθία αλληλένδετων κβαντικών κυκλωμάτων και κλασικού υπολογισμού, για παράδειγμα, variational κβαντικοί αλγόριθμοι εκτελούν κβαντικά κυκλώματα μέσα σε ένα βρόχο βελτιστοποίησης. Για αυτά τα φορτία εργασίας, η απόδοση του συστήματος αυξάνεται σημαντικά αν τα κβαντικά κυκλώματα παραμετροποιούνται, και οι μεταβάσεις μεταξύ της εκτέλεσης του κυκλώματος και της μη τρέχουσας κλασσικής υπολογιστικής είναι αποδοτικές. Κατά συνέπεια, ορίζουμε τον ** υπολογισμός κοντά στο χρόνο * * για να αναφερθούμε σε υπολογισμούς με αλγορίθμους που κάνουν επανειλημμένη χρήση κβαντικών κυκλωμάτων με υλικό που αναπτύχθηκε για να επιταχυνθεί ο χρόνος υπολογισμού. Για τον υπολογισμός κοντά στο χρόνο, ο κλασικός υπολογισμός γίνεται σε μια χρονική κλίμακα περισσότερο από την συμφωνία του κβαντικού υπολογισμού. Σε αντίθεση με τον ** υπολογισμό σε πραγματικό χρόνο * *, όπου ο κλασικός υπολογισμός πραγματοποιείται εντός του χρόνου αποσυνοχής της κβαντικής συσκευής.
es_un: Algunas cargas de trabajo contienen una secuencia extendida de circuitos cuánticos intercalada con cálculos clásicos, por ejemplo, los algoritmos cuánticos variacionales ejecutan circuitos cuánticos dentro de un bucle de optimización que contiene procesamiento clásico. Para estas cargas de trabajo, el rendimiento del sistema aumenta significativamente si los circuitos cuánticos son parametrizados y las transiciones entre ejecución del circuito cuántico y cálculos clásicos se hacen eficientemente. Por esto, definimos el término **computación en tiempo cercano** (near-time computation) para referirnos a los cálculos con algoritmos que hacen uso de circuitos cuánticos de manera repetida con hardware desarrollado para acelerar los tiempos de computación. En la computación de tiempo cercano, los cálculos clásicos ocurren en una escala de tiempo más larga que los tiempos de coherencia de la computación cuántica. A diferencia de la **computación en tiempo real** (real-time computation), donde los cálculos clásicos ocurren dentro de los tiempos de decoherencia de un dispositivo cuántico.
fr_fr: Certaines charges de travail contiennent une séquence étendue de circuits quantiques entrelacés de calculs classiques, par exemple des algorithmes quantiques variationnels exécutent des circuits quantiques dans une boucle d'optimisation. Pour ces charges de travail, la performance du système augmente considérablement si les circuits quantiques sont paramétrés, et les transitions entre l'exécution du circuit et le calcul classique non courant sont rendues efficaces. Par conséquent, nous définissons **le calcul proche du temps réel** pour faire référence à des calculs avec des algorithmes qui font une utilisation répétée de circuits quantiques avec du matériel développé pour accélérer le temps de calcul. En temps quasi-réel, le calcul classique se produit sur une échelle deque la cohérence du calcul quantique. Contrairement au Contraste ceci avec **calcul en temps réel**, où le calcul classique se produit dans le temps de décohérence de l'appareil quantique.
it_it: Alcuni carichi di lavoro contengono una sequenza estesa di entrambi circuiti quantistici e calcoli classici, ad esempio gli algoritmi quantistici variazionali eseguono circuiti quantistici all'interno di un ciclo di ottimizzazione. Per questi carichi di lavoro, le prestazioni del sistema aumentano notevolmente se i circuiti quantistici sono parametrizzati e le transizioni tra l'esecuzione del circuito e il calcolo classico non corrente sono rese efficienti. Di conseguenza, definiamo **near-time computation** per fare riferimento a calcoli con algoritmi che fanno un uso ripetuto di circuiti quantistici con hardware sviluppato per accelerare il tempo di calcolo. Nel near-time computation, il calcolo classico avviene su una scala temporale più lunga della coerenza del calcolo quantistico. Confrontandolo con il **real-time computation** (calcolo in tempo reale), in cui il calcolo classico avviene entro il tempo di decoerenza del dispositivo quantistico.
ja_jp: ワークロードの中には、量子回路と古典計算を交互に配置した、拡張シーケンスを含むものがあり、例えば変分量子アルゴリズムでは最適化ループ内で量子回路を実行します。このようなワークロードでは、量子回路をパラメータ化し、回路実行と古典計算の間の遷移を効率的に行うことで、システムの性能を大幅に向上させることができます。そこで、計算時間を高速化するために開発されたハードウェアを用いて、量子回路を繰り返し利用するアルゴリズムを用いた計算を **near-time computation** と定義します。 near-time computation では、古典計算は量子計算のコヒーレンスよりも長い時間スケールで行われます。これは、古典的な計算が量子デバイスのデコヒーレンス時間内に行われる **real-time computation** とは対照的です。
ko_kr: 일부 작업부하들은 양자 회로들과 고전적인 계산이 교차로 합쳐진 확장된 시퀀스를 포함한다. 예를 들어, 다양한 변분 양자 알고리즘들은 최적화 루프 내에서 양자 회로들을 실행한다. 이러한 작업부하에 있어서, 양자 회로가 매개 변수화되고, 회로 실행과 비유동적 고전적 계산 사이의 상태 변화가 효율화되면 시스템 성능이 실질적으로 증가한다. 결과적으로, 계산 시간을 가속화하기 위해 개발된 하드웨어를 가진 양자 회로를 반복적으로 사용하는 알고리즘을 사용하는 계산으로 **근-시간 계산** 을 정의한다. 근-시간 계산에서 고전적인 계산은 양자 연산의 결맞음보다 더 긴 시간 단위에서 발생한다. 이는 고전적인 계산이 양자장치의 결어긋남 시간 내에서 발생하는 **실시간 계산** 과 대조된다.
pl_pl: Niektóre procesy składają się z długich sekwencji przeplatających się obwodów kwantowych i obliczeń klasycznych. Przykładem są wariacyjne algorytmy kwantowe, które uruchamiają obwody kwantowe wewnątrz pętli optymalizacyjnej. W przypadku takich procesów wydajność systemu znacznie wzrasta, jeśli obwody kwantowe są sparametryzowane, a przejścia od uruchomienia obwodu do długotrwałych obliczeń klasycznych są wydajne. Dlatego terminem **obliczenia w czasie prawie rzeczywistym** nazywamy obliczenia wykonane przy użyciu algorytmów, które wielokrotnie wykorzystują obwody kwantowe stworzone w celu przyspieszenia obliczeń. W obliczeniach w czasie prawie rzeczywistym obliczenia klasyczne mają zakres czasowy większy niż koherencja obliczeń kwantowych. Przeciwieństwem są **obliczenia w czasie rzeczywistym**, w których obliczenia klasyczne mieszczą się w czasie dekoherencji maszyny kwantowej.
pt_un: Algumas cargas de trabalho contém sequências extendidas de circuitos quânticos entrelaçados e computação clássica, por exemplo algoritmos quânticos variacionais executam circuitos quânticos dentro de um loop de otimização. Para essas cargas, a performance do sistema aumenta sustancialmente se os circuitos quânticos estão parametrizados, e as transições entre a execução do circuito e computação clássica não-atual se tornam eficientes. Consequentemente, definimos **computação em tempo-quase-real** para nos referir a computação com algoritmos que fazem repetidos uso de circuitos com hardware desenvolvido para acelerar o tempo computacional. Em contraste com a **computação em tempo-real**, onde a computação clássica ocorre dentro do tempo da descoêrencia do dispositivo quântico.
ru_ru: Некоторые рабочие задания содержат расширенную последовательность чередующихся квантовых схем и классических вычислений, например, вариационные квантовые алгоритмы выполняют квантовые цепи в рамках цикла оптимизации. Для таких рабочих задач производительность системы существенно возрастает, если квантовые схемы параметризованы, а переходы между выполнением схем и бездействующими классическими вычислениями эффективно реализованы. Следовательно, мы определяем **вычисления в ближнем времени** для обозначения вычислений с алгоритмами, которые неоднократно используют квантовые схемы с аппаратным обеспечением, разработанным для ускорения времени вычислений. При вычислениях в ближнем времени классические вычисления происходят на шкале времени, превышающем когерентность квантовых вычислений. Напротив, при **вычислениях в реальном времени** классические вычисления происходят в пределах времени декогеренции квантового устройства.
sw_ke: Baadhi ya kazi zina mlolongo uliopanuliwa wa mchanganyo wa saketi za kwanta na hesabu klasiki, kwa mfano variational quantum algorithms hutekeleza saketi za kwanta katika kitanzi cha usadifishaji. Kwa kazi hizi, utendaji wa mfumo huongezeka kwa kiasi kikubwa ikiwa saketi za kwanta zimewekwa kwenye parameta, na mapito baina ya utekelezaji wa saketi na hesabu za klasiki zisizo za kisasa zinafanywa kwa ufanisi. Kwa hivyo, tunaainisha **near-term computation** kurejelea hesabu zinazofanywa kutumia alogaridhimu ambazo zinatumia mara kwa mara saketi za kwanta na maunzi iliyotengenezwa kuharakisha muda wa kufanya hesabu. Katika near-time computation, hesabu za klasiki zinatendeka kwa muda mrefu zaidi kuliko coherence ya utarakilishi wa kwanta. Tofautisha hii na **real-time computation**, ambapo hesabu ya klasiki inatendeka katika muda wa decoherence wa kifaa cha kwanta.
ta_in: சில பணிச்சுமைகள் இன்டர்லீவ் குவாண்டம் சர்க்யூட்கள் மற்றும் கிளாசிக்கல் கணக்கீட்டின் நீட்டிக்கப்பட்ட வரிசையைக் கொண்டிருக்கின்றன, எடுத்துக்காட்டாக மாறுபட்ட குவாண்டம் வழிமுறைகள் ஒரு தேர்வுமுறை சுழற்சியில் குவாண்டம் சர்க்யூட்களை இயக்குகின்றன. இந்த பணிச்சுமைகளுக்கு, குவாண்டம் சர்க்யூட்கள் அளவுருவாக்கப்பாட்டால் கணினி செயல்திறன் கணிசமாக அதிகரிக்கிறது, மேலும் சர்க்யூட் செயல்படுத்தல் மற்றும் தற்போதைய அல்லாத கிளாசிக்கல் கணக்கீடு ஆகியவற்றுக்கு இடையிலான மாற்றங்கள் திறமையாக செய்யப்படுகின்றன. இதன் விளைவாக, கணக்கீட்டு நேரத்தை விரைவுபடுத்துவதற்காக உருவாக்கப்பட்ட வன்பொருள்களுடன் குவாண்டம் சுற்றுகளை மீண்டும் மீண்டும் பயன்படுத்தும் வழிமுறைகளுடன் கூடிய கணக்கீடுகளைக் குறிக்க **near-time computation** ஐ வரையறுக்கிறோம். Near-time computation-ல், கிளாசிக்கல் கணக்கீடு, குவாண்டம் கணக்கீட்டின் ஒத்திசைவைக் காட்டிலும் நீண்ட கால இடைவெளியில் நிகழ்கிறது. **Real-time computation** உடன் இதை வேறுபடுத்துங்கள், அங்கு குவாண்டம் சாதனத்தின் டிகோஹரன்ஸ் நேரத்திற்குள் கிளாசிக்கல் கணக்கீடு நிகழ்கிறது.
te_in: కొన్ని వర్క్‌లోడ్‌లు ఇంటర్‌లీవ్డ్ క్వాంటం సర్క్యూట్‌లు మరియు క్లాసికల్ కంప్యూటేషన్‌ల యొక్క పొడిగించిన క్రమాన్ని కలిగి ఉంటాయి, ఉదాహరణకు వైవిధ్యమైన(వేరియేషనల్) క్వాంటం అల్గారిథమ్‌లు ఆప్టిమైజేషన్ లూప్‌లో క్వాంటం సర్క్యూట్‌లను అమలు చేస్తాయి. ఈ వర్క్‌లోడ్‌ల కోసం, క్వాంటం సర్క్యూట్‌లు పారామీటరైజ్డ్ చేయబడితే సిస్టమ్ పనితీరు గణనీయంగా పెరుగుతుంది మరియు సర్క్యూట్ ఎగ్జిక్యూషన్ మరియు నాన్-కరెంట్ క్లాసికల్ కంప్యూటేషన్ మధ్య పరివర్తనాలు సమర్థవంతంగా ఉంటాయి. పర్యవసానంగా, గణన సమయాన్ని వేగవంతం చేయడానికి అభివృద్ధి చేయబడిన హార్డ్‌వేర్‌తో క్వాంటం సర్క్యూట్‌లను పదేపదే ఉపయోగించుకునే అల్గారిథమ్‌లతో గణనలను సూచించడానికి మేము **నియర్-టైమ్ కంప్యూటేషన్**ని నిర్వచించాము. నియర్-టైమ్ గణనలో, క్లాసికల్ గణన క్వాంటం గణన యొక్క పొందిక కంటే ఎక్కువ సమయ ప్రమాణంలో జరుగుతుంది. **నిజ-సమయ గణన**దీనికి విరుద్ధం, ఇక్కడ క్లాసికల్ గణన క్వాంటం పరికరం యొక్క డీకోహెరెన్స్ సమయంలో జరుగుతుంది.
tr_tr: Bazı iş yükleri genişleştirilmiş bir dizi kuantum devresi ve klasik hesaplama içerir, örneğin değişimsel kuantum algoritmaları optimizasyon döngüsü içerisinde kuantum devreleri yürütür. Bu iş yükleri için eğer kuantum devreleri parametrelendirilmiş ve devre yürütme ve güncel olmayan klasik hesaplama arasındaki geçişler verimli yapılmışsa sistem performansı oldukça artar. Dolayısıyla, hesaplama süresini hızlandırılmak için geliştirilmiş donanımla kuantum devrelerini tekrar tekrar kullanan algoritmalarla hesaplamaları ifade etmek için **yakın zamanlı hesaplama** sını tanımlıyoruz. Yakın zamanlı hesaplamada, klasik hesaplama kuantum hesaplamasının eş fazlılık durumundan daha uzun bir zaman ölçeğinde gerçekleşir. Bunu kuantum cihazının eşevresizlik zamanı içerisinde gerçekleşen klasik hesaplamanın olduğu **gerçek zamanlı hesaplama** ile karşılaştırın.

source: Constructing complex quantum circuits with minimal effort is at the heart of Qiskit. With only a few lines of code, is it possible to construct complex circuits like the one above
fr_fr: La construction de circuits quantiques complexes avec un effort minimal est au cœur de Qiskit. Avec seulement quelques lignes de code, est-il possible de construire des circuits complexes comme celui ci-dessus
id_id: Membangun sirkuit kuantum kompleks dengan usaha minimal adalah inti dari Qiskit. Dengan hanya beberapa baris kode, sudah memungkinkan untuk membangun sirkuit kompleks seperti yang ada di atas
it_it: La costruzione di circuiti quantistici complessi con il minimo sforzo è l'obiettivo di Qiskit. Con poche righe di codice è possibile costruire circuiti complessi come quello sopra.
ja_jp: 最小限の労力で、複雑な量子回路を構築することが、 Qiskit の核心です。たった数行のコードで、上記のような複雑な回路を構築することができるでしょうか。

source: that support a rich feature set of operations, and can be passed to a range of :ref:`quantum computers <qc-intro-computers>` or classical simulators.
el_gr: που υποστηρίζουν ένα πλούσιο σύνολο λειτουργιών, και μπορεί να περάσει σε μια σειρά από :ref:` κβαντικούς υπολογιστές <qc-intro-computers>` ή κλασικούς προσομοιωτές.
fr_fr: qui prennent en charge un ensemble de fonctionnalités riches et peuvent être passés à une gamme :ref:`d'ordinateurs quantiques <qc-intro-computers>` ou de simulateurs classiques.
id_id: yang mendukung set kaya fitur dari operasi, dan dapat diteruskan ke berbagai :ref:`komputer kuantum <qc-intro-computers>` atau simulator klasik.
it_it: che supportano un ricco insieme di funzionalità di operazioni e possono essere passati a una gamma di :ref:`quantum computers <qc-intro-computers>` o simulatori classici.
ja_jp: 豊富な操作の機能セットをサポートしており、 :ref:`量子コンピューター <qc-intro-computers>` や古典的なシミュレーターに渡すことができます。

source: Quantum computers
bn_bn: কোয়ান্টাম কম্পিউটারসমূহ
de_de: Quantencomputer
el_gr: Κβαντικοί υπολογιστές
es_un: Computadoras cuánticas
fr_fr: Ordinateurs quantiques
id_id: Komputer kuantum
it_it: Computer quantistici
ja_jp: 量子コンピューター
ko_kr: 양자 컴퓨터
pl_pl: Komputery kwantowe
pt_un: Computadores quânticos
ru_ru: Квантовые компьютеры
sw_ke: Tarakilishi za Kwanta
ta_in: குவாண்டம் கணினிகள்
te_in: క్వాంటమ్ కంప్యూటర్లు
tr_tr: Kuantum bilgisayarlar
zh_tw: 量子電腦

source: A view inside the IBM Quantum System One.
bn_bn: IBM কোয়ান্টাম ব্যবস্থা (সিস্টেম) একের (ওয়ান) একটি অভ্যন্তরীণ দৃশ্য।
de_de: Ein Blick in das Innere des IBM Quantum System One.
el_gr: Μια προβολή στο IBM Quantum System One.
es_un: Una vista del interior de IBM Quantum System One.
fr_fr: Une vue à l'intérieur du système Quantum IBM One.
id_id: Sebuah tampilan dalam dari IBM Quantum System One.
it_it: Uno sguardo all'interno dell'IBM Quantum System One.
ja_jp: IBM Quantum System Oneの内側
ko_kr: IBM 양자 시스템 원의 내부.
pt_un: Uma visão dentro do IBM Quantum System One.
ru_ru: IBM Quantum System One: вид изнутри.
sw_ke: Mtazamo ndani ya IBM Quantum System One.
ta_in: IBM Quantum System One உள்ளே ஒரு பார்வை.
te_in: IBM క్వాంటం సిస్టమ్ వన్ లోపల ఒక వీక్షణ.
tr_tr: IBM Quantum System One'ın içinden bir görünüm.
zh_tw: 內觀IBM Quantum System One。
