Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/qc_intro.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, zh_tw

source: Quantum computers that are programmed using quantum circuits are called **gate-based quantum computers**. Such systems can be constructed out of any quantum technology that allows for defining qubit elements, and can implement single- and multi-qubit gate operations with high-fidelity. At present, architectures based on superconducting circuits, trapped-ions, semiconducting quantum-dots, photons, and neutral atoms, are actively being developed, and many are accessible to users over the internet. Qiskit is agnostic with respect to the underlying architecture of a given quantum system, and can compile a quantum circuit to match the entangling gate topology of a quantum device, map the circuit instructions into the native gate set of the device, and optimize the resulting quantum circuit for enhanced fidelity.
fr_fr: Les ordinateurs quantiques programmés à l'aide de circuits quantiques sont appelés **calculateurs quantiques à portes**. De tels systèmes peuvent être construits à partir de n'importe quelle technologie quantique qui permet de définir des éléments de qubits, et de mettre en œuvre des opérations de portes simples et multiqubits avec une haute fidélité. À l'heure actuelle, les architectures basées sur les circuits supraconducteurs, les ions piégés, les quantum-dots à semi-conducteurs, les photons et les atomes neutres sont activement développées, et beaucoup sont accessibles aux utilisateurs sur Internet. Qiskit est agnostique par rapport à l'architecture sous-jacente d'un système quantique donné, et peut compiler un circuit quantique pour correspondre à la topologie à la porte d'entrée d'un appareil quantique, cartographier les instructions du circuit dans l'ensemble de porte native de l'appareil, et optimiser le circuit quantique qui en résulte pour une fidélité accrue.
it_it: I computer quantistici programmati utilizzando circuiti quantistici sono chiamati **gate-based quantum computers** (computer quantistici basati su gate). Tali sistemi possono essere costruiti con qualsiasi tecnologia quantistica che consenta di definire elementi qubit e possono implementare operazioni a single-gate e multi-qubit con alta fedeltà. Attualmente, le architetture basate su circuiti superconduttori, ioni intrappolati, punti quantici semiconduttori, fotoni e atomi neutri sono in fase di sviluppo attivo e molte sono accessibili agli utenti su Internet. Qiskit può compilare un circuito quantistico per abbinare la topologia di porta entangling di un dispositivo, mappare le istruzioni del circuito nel set di porte nativo del dispositivo e ottimizzare il circuito quantistico risultante per una maggiore fedeltà.
ja_jp: 量子回路を用いてプログラムされた量子コンピューターは、 **ゲートベースの量子コンピューター** と呼ばれています。このようなシステムは、量子ビット素子を定義することのできる量子技術を用いて構成することができ、単一および複数量子ビットのゲート演算を高精度に実装することができます。現在、超伝導回路、トラップイオン、半導体量子ドット、光子、中性原子に基づいたアーキテクチャーが積極的に開発されており、その多くはインターネットを介してユーザーがアクセスできるようになっています。 Qiskit は与えられた量子システムの基礎となるアーキテクチャーにとらわれず、量子デバイスのエンタングルゲートトポロジーに合わせて量子回路をコンパイルして、回路命令をデバイスのネイティブゲートセットにマッピングし、結果として得られた量子回路を最適化することで忠実度を高めることができます。

source: As with the noise cancellation example above, the amplitude and phase of qubits are continuous degrees of freedom upon which operations can never be done exactly. These gates errors, along with noise from the environment in which a quantum computer resides, can conspire to ruin a computation if not accounted for in the compilation process, and may require additional mitigation procedures in order to obtain a high-fidelity output on present day quantum systems susceptible to noise. Qiskit is capable of taking into account a wide range of device calibration metrics (see figure below) in its compilation strategy, and can select an optimal set of qubits on which to run a given quantum circuit. In addition, Qiskit hosts a collection of noise mitigation techniques for extracting a faithful representation of a quantum circuits output.
bn_bn: উপরের ত্রুটিমুক্তকরণ উদাহরণ অনুসারে, কিউবিটগুলির বিস্তার এবং দশা হল অবিচ্ছিন্ন স্বাধীনতার মাত্রা (ডিগ্রি অফ ফ্রীডম) যার ওপর কখনো হুবহু ক্রিয়াকলাপগুলো (অপারেশন) সম্পন্ন করা যায় না। এই গেইট ত্রুটি এবং কোয়ান্টাম কম্পিউটারের কর্মপরিবেশের দূষণ বা ত্রুটি যদি সংকলন (কম্পাইলেশন) এর সময় খেয়াল না করা হয় তাহলে এর ফলে একটি গণনাতে ভুল হতে পারে এবং বর্তমানের সংবেদনশীল কোয়ান্টাম ব্যবস্থার ক্ষেত্রে উচ্চমানের ফলাফল পাওয়ার জন্য অতিরিক্ত নিরসন (মিটিগেশন)-এর প্রয়োজন হতে পারে। Qiskit তার সংকলন (কম্পাইলেশন) কৌশলে বহু যন্ত্রের ক্রমাঙ্কন (ক্যালিব্রেশন) পদ্ধতি (মেট্রিক) গ্রহণ করতে সক্ষম (নিচের ছবিটি দেখুন), প্রদত্ত কোয়ান্টাম বর্তনী (সার্কিট) চালানোর জন্য কিউবিটের একটি অনুকূল সেট নির্বাচন করতে পারে। এছাড়াও Qiskit কোয়ান্টাম বর্তনীর (সার্কিট) যথাযথ ফলাফল পাবার জন্য দূষণ বা ত্রুটি নিরসন (মিটিগেশন) প্রযুক্তিকে ব্যবহার করে।
de_de: Wie bei dem Beispiel für Rauschunterdrückung oben sind die Amplitude und Phase von Qubits kontinuierliche Freiheitsgrade, auf denen Operationen niemals exakt durchgeführt werden können. Diese Gate-Fehler, zusammen mit Rauschen aus der Umgebung eines Quantencomputers, können zusammen genommen eine Berechnung zerstören, wenn das nicht beim Kompilierungsprozesses mit berücksichtigt wird und entsprechende Korrekturen durchgeführt werden, um eine hohe Zuverlässigkeit auf störanfälligen derzeitigen Quantensystemen zu erhalten, wie sie heute üblich sind. Qiskit ist in der Lage, eine breite Palette von Gerätekalibrierungsmetriken (siehe Abbildung unten) in seiner Kompilierungsstrategie zu berücksichtigen, und kann eine optimale Gruppe von Qubits auswählen, auf denen eine bestimmte Quantenschaltung ausgeführt werden soll. Darüber hinaus bietet Qiskit eine Sammlung von rauschunterdrückenden Techniken für die Extraktion einer originalgetreuen Darstellung der Ausgabe von Quantenschaltungen an.
el_gr: Όπως και με το παράδειγμα ακύρωσης θορύβου παραπάνω, το εύρος και η φάση των qubits είναι συνεχείς βαθμοί ελευθερίας πάνω στις οποίες οι διαδικασίες δεν μπορούν ποτέ να γίνουν ακριβώς. Αυτές τα λάθη στις πύλες, μαζί με το θόρυβο από το περιβάλλον στο οποίο βρίσκεται ένας κβαντικός υπολογιστής, μπορούν να συνωμοτούν για να καταστρέψουν έναν υπολογισμό, αν δεν υπολογιστούν στη διαδικασία μεταγλώττισης, και μπορεί να απαιτήσει πρόσθετες διαδικασίες μετριασμού, προκειμένου να αποκτήσουν μια υψηλής πιστότητας έξοδο τα σημερινά κβαντικά συστήματα που είναι ευπαθή στον θόρυβο. Το Qiskit είναι ικανό να λάβει υπόψη ένα ευρύ φάσμα μετρικών στοιχείων βαθμονόμησης συσκευών (βλέπε εικόνα παρακάτω) στη στρατηγική μεταγλώττισης, και μπορεί να επιλέξει ένα βέλτιστο σύνολο qubits για το οποίο θα εκτελεστεί ένα δεδομένο κβαντικό κύκλωμα. Επιπλέον, το Qiskit φιλοξενεί μια συλλογή τεχνικών μείωσης του θορύβου για την εξαγωγή μιας πιστής αναπαράστασης της εξόδου κβαντικών κυκλωμάτων.
es_un: Al igual que con el ejemplo anterior de cancelación de ruido, la amplitud y la fase de los qubits son grados de libertad continuos en los que las operaciones nunca se pueden realizar con exactitud. Estos errores de compuerta, junto con el ruido del entorno en el que reside una computadora cuántica, pueden conspirar para arruinar un cálculo si no se tienen en cuenta en el proceso de compilación, y pueden requerir procedimientos de mitigación adicionales para obtener una salida de alta fidelidad en los sistemas cuánticos actuales susceptibles al ruido. Qiskit es capaz de tener en cuenta una amplia gama de métricas de calibración de dispositivos (consulta la figura siguiente) en su estrategia de compilación y puede seleccionar un conjunto óptimo de qubits en el cual ejecutar un circuito cuántico determinado. Además, Qiskit alberga una colección de técnicas de mitigación de ruido para extraer una representación fiel de la salida de un circuito cuántico.
fr_fr: Comme dans le cas de l'exemple d'annulation du bruit ci-dessus, l'amplitude et la phase des qubits sont des degrés de liberté continus sur lesquels les opérations ne peuvent jamais être effectuées exactement. Ces erreurs de portes, ainsi que le bruit de l'environnement dans lequel réside un ordinateur quantique, peuvent conspirer à ruiner un calcul s'ils ne sont pas pris en compte dans le processus de compilation, et peuvent nécessiter des procédures d'atténuation supplémentaires afin d'obtenir une sortie de haute fidélité sur les systèmes quantiques actuels sensibles au bruit. Qiskit est capable de prendre en compte une large gamme de mesures d'étalonnage des dispositifs (voir figure ci-dessous) dans sa stratégie de compilation, et peut sélectionner un ensemble optimal de qubits sur lequel exécuter un circuit quantique donné. De plus, Qiskit héberge une collection de techniques d'atténuation du bruit pour l'extraction d'une représentation fidèle d'une sortie de circuits quantiques.
it_it: Come nell'esempio di cancellazione precedente, l'ampiezza e la fase dei qubit sono gradi di libertà continui su cui le operazioni non possono mai essere eseguite esattamente. Questi errori di gate, insieme al rumore proveniente dall'ambiente in cui risiede un computer quantistico, possono finire per rovinare un calcolo se non tenuti in considerazione nel processo di compilazione e possono richiedere procedure di mitigazione aggiuntive per ottenere un output ad alta fedeltà. Qiskit è in grado di tenere conto di un'ampia gamma di metriche di calibrazione del dispositivo (vedere la figura sottostante) nella sua strategia di compilazione e può selezionare un insieme ottimale di qubit su cui eseguire un dato circuito quantistico. Inoltre, Qiskit ospita una raccolta di tecniche di mitigazione del rumore per estrarre una rappresentazione fedele dell'output di un circuito quantistico.
ja_jp: 上述のノイズキャンセリングの例と同様に、量子ビットの振幅と位相は連続的な自由度であるため、演算が正確に行われることはありません。これらのゲートエラーは、量子コンピューターの置かれた環境からのノイズとともに、コンパイル以外の段階において計算を台無しにする可能性があります。そのため、ノイズの影響を受けやすい現在の量子システムで高忠実度の出力を得るためには、追加の緩和手順が必要になります。 Qiskit ではそのコンパイル戦略において、様々なデバイス較正指標 (下図参照) を考慮することができ、量子回路を実行するために最適な量子ビットのセットを選択することができます。さらに Qiskit には、量子回路の出力の忠実な表現を得るための、ノイズ緩和テクニックが集められています。
ko_kr: 위의 노이즈 제거 예에서와 같이, 큐비트들의 진폭 및 위상은 동작들이 정확하게 수행될 수 없는 연속적인 자유도 (degree of freedom) 이다. 이들 게이트 에러들은, 양자 컴퓨터가 상주하는 환경으로부터의 잡음과 함께, 컴파일 프로세스에서 설명되지 않는 경우 계산을 방해할 수 있고, 잡음에 민감한 현재의 양자 시스템들 상에서 고충실도 출력을 획득하기 위해 추가적인 완화 절차들을 요구할 수 있다. Qiskit은 컴파일 전략에서 광범위한 장치 교정 메트릭 (아래 그림 참조) 을 고려할 수 있고, 주어진 양자 회로를 실행할 최적의 큐비트 세트를 선택할 수 있다. 또한, Qiskit은 양자 회로 출력의 충실한 표현을 추출하기 위한 잡음 완화 기술의 집합을 호스트한다.
pl_pl: Tak jak w przypadku eliminacji szumu w powyższym przykładzie, amplituda i faza kubitów to ciągłe stopnie swobody, na których operacje nigdy nie będą całkowicie dokładne. Te błędy bramek, razem z szumem pochodzącym ze środowiska, w którym znajduje się komputer kwantowy, mogą razem przyczynić się do zniszczenia obliczeń, jeżeli nie zostaną uwzględnione w procesie kompilacji. Mogą wymagać dodatkowych procedur mitygacji, aby otrzymać wyjście o wysokiej wierności na obecnych komputerach kwantowych wrażliwych na szum. Qiskit jest w stanie wziąć pod uwagę szeroki zakres metryk kalibracji danego urządzenia (patrz grafika niżej) w swojej strategii kompilacyjnej, a następnie wybrać optymalny zbiór kubitów, na których zostanie uruchomiony dany obwód kwantowy. Ponadto Qiskit posiada wiele technik mitygacji szumu, które pozwalają na uzyskanie wiernej reprezentacji wyniku obwodu kwantowego.
pt_un: Como no exemplo de cancelamento de ruído acima, a amplitude e a fase de qubits são graus de liberdade contínuos sobre os quais as operações nunca poderão ser feitas exatamente. Estes erros das portas, juntamente com o ruído do ambiente no qual um computador quântico reside, podem conspirar para arruinar um cálculo se não forem contabilizados no processo de compilação, e podem exigir procedimentos adicionais de mitigação a fim de obter um resultado de alta fidelidade nos sistemas quânticos atuais suscetíveis a ruído. O Qiskit é capaz de levar em conta uma ampla gama de métricas de calibração de dispositivos (veja a figura abaixo) na sua estratégia de compilação e pode selecionar um conjunto ideal de qubits para executar um determinado circuito quântico. Além disso, o Qiskit hospeda uma coleção de técnicas de mitigação de ruído para extrair uma representação fiel do resultado de um circuito quântico.
ru_ru: Как и в приведенном выше примере с подавлением шума, амплитуда и фаза кубитов - это непрерывные степени свободы, операции над которыми никогда не могут быть выполнены точно. Эти ошибки вентилей, наряду с помехами от окружающей среды, в которой находится квантовый компьютер, могут разрушить вычисления, если они не учтены в процессе компиляции, и могут потребовать дополнительных процедур по снижению шума, чтобы получить высокоточный результат на современных квантовых системах, подверженных шуму. Qiskit способен учитывать широкий диапазон калибровочных параметров устройства (см. рисунок ниже) в своей стратегии компиляции и может выбрать оптимальный набор кубитов, на которых будет работать заданная квантовая схема. Кроме того, Qiskit содержит коллекцию методов подавления шума для получения точного представления вывода квантовой схемы.
sw_ke: Kama ilivyo katika mfano wa ukatishaji kelele hapo juu, kimo cha wimbi na awamu ya qubits ni viwango endelevu vya uhuru ambapo operesheni haziwezi kamwe kufanyika hasa. Hitilafu hizi za malango, pamoja na kelele kutoka kwenye mazingira ambapo tarakilishi ya kwanta ilipo, zinaweza kusababisha uharibifu wa hesabu zisipohesabiwa katika mchakato wa ujumuishaji, na zinaweza kuhitaji utaratibu wa ziada ili kupata pato lenye uaminifu wa hali ya juu katika mifumo ya kwanta ya kisasa yenye urahisi wa kuambukizwa na kelele. Qiskit ina uwezo wa kuzingatia masafa mbalimbali ya vipimo vya urekebishaji wa vifaa (tazama mchoro hapa chini) katika mkakati wake wa compilation, na inaweza kuchagua seti mojawapo ya qubits ambayo inatumika kutekeleza saketi ya kwanta iliyopeanwa. Vile vile, Qiskit ina mkusanyiko wa mbinu za kupunguza kelele kwa ajili ya kutoa uwakilishi wa uaminifu wa pato la saketi za kwanta.
ta_in: மேலே உள்ள சத்தம் நீக்குதல் உதாரணத்தைப் போலவே, க்யூபிட்களின் வீச்சு மற்றும் கட்டம் தொடர்ச்சியான சுதந்திரத்தின் அளவுகள் ஆகும், அதன் அடிப்படையில் செயல்பாடுகள் ஒருபோதும் சரியாக செய்ய முடியாது. இந்த கேட் பிழைகள், ஒரு குவாண்டம் கணினி வசிக்கும் சூழலில் இருந்து வரும் சத்தத்துடன், தொகுப்பு செயல்பாட்டில் கணக்கிடப்படாவிட்டால் ஒரு கணக்கீட்டை அழிக்க சதி செய்யலாம், மேலும் இன்றைய நாளில் அதிக நம்பகத்தன்மையை வெளியிடுவதற்கு கூடுதல் தணிப்பு நடைமுறைகள் தேவைப்படலாம், இதனால் குவாண்டம் அமைப்புகள் சத்தத்திற்கு ஆளாகின்றன. Qiskit அதன் தொகுப்பு மூலோபாயத்தில் பரந்த அளவிலான சாதன அளவீட்டு அளவீடுகளை (கீழே உள்ள படத்தைக் காண்க) கணக்கில் எடுத்துக்கொள்ளும் திறன் கொண்டது, மேலும் கொடுக்கப்பட்ட குவாண்டம் சுற்றுவட்டத்தை இயக்குவதற்கான உகந்த தொகுப்புகளை தேர்ந்தெடுக்கலாம். கூடுதலாக, ஒரு குவாண்டம் சர்க்யூட்கள் வெளியீட்டின் உண்மையுள்ள பிரதிநிதித்துவத்தைப் பிரித்தெடுப்பதற்கான சத்தம் குறைப்பு நுட்பங்களின் தொகுப்பை Qiskit வழங்குகிறது.
te_in: ఎగువన నాయిస్ క్యాన్సిలేషన్ ఉదాహరణ వలె, క్కుబిట్ల ఏంప్లిట్యూడ్ మరియు ఫేస్ అనేది నిరంతర స్వేచ్ఛా స్థాయిలు, వీటిపై ఆపరేషన్‌లు ఎప్పటికీ సరిగ్గా చేయలేవు. ఈ గేట్‌ల లోపాలు, క్వాంటం కంప్యూటర్‌లో ఉండే వాతావరణం నుండి వచ్చే శబ్దంతో పాటు, కంపైలేషన్ ప్రక్రియలో లెక్కించబడకపోతే గణనను నాశనం చేయడానికి కుట్ర చేయవచ్చు మరియు ప్రస్తుత రోజుల్లో అధిక-విశ్వసనీయ అవుట్‌పుట్‌ను పొందేందుకు అదనపు ఉపశమన విధానాలు అవసరం కావచ్చు. కిస్కిట్ దాని సంకలన వ్యూహంలో విస్తృత శ్రేణి పరికర క్రమాంకన కొలమానాలను (క్రింద ఉన్న బొమ్మను చూడండి) పరిగణనలోకి తీసుకోగలదు మరియు ఇచ్చిన క్వాంటం సర్క్యూట్‌ను అమలు చేయడానికి సరైన క్కుబిట్ల సెట్‌ను ఎంచుకోవచ్చు. అదనంగా, క్విస్కిట్ క్వాంటం సర్క్యూట్ అవుట్‌పుట్ యొక్క నమ్మకమైన ప్రాతినిధ్యాన్ని సంగ్రహించడానికి నాయిస్ తగ్గించే పద్ధతుల సేకరణను నిర్వహిస్తుంది.
tr_tr: Yukarıdaki gürültü giderme örneğinde olduğu gibi, kübitlerin genliği ve fazı, işlemlerin asla tam olarak yapılamayacağı sürekli serbestlik dereceleridir. Bu kapı hataları, kuantum bilgisayarların bulunduğu ortamdan gelen gürültüyle birlikte, derleme sürecinde hesaba katılmazsa hesaplamayı bozmak için gizlice anlaşabilir ve gürültüye duyarlı kuantum sistemlerinde yüksek doğruluklu bir çıktı elde etmek için ek azaltma işlemleri gerekebilir. Qiskit, derleme stratejisinde çok çeşitli cihaz kalibrasyon ölçümlerini (aşağıdaki şekle bakın) hesaba katabilir ve belirli bir kuantum devresini çalıştırmak için en uygun kübit kümesini seçebilir. Ek olarak, Qiskit bir kuantum devreleri çıktısının aslına uygun bir temsilini çıkarmak için bir dizi gürültü azaltma tekniğine ev sahipliği yapıyor.

source: Topology and error rates for the IBM Quantum *ibmq_manhattan* system.
bn_bn: আইবিএম কোয়ান্টামের *ibmq_manhattan* ব্যবস্থার স্তরবিন্যাসক্রম (টপোলজি) এবং ত্রুটির হার (এরর রেট)।
de_de: Topologie und Fehlerraten für das IBM Quantum *ibmq_manhattan* System.
el_gr: Τοπολογία και ποσοστά σφαλμάτων για το σύστημα IBM Quantum *ibmq_manhattan*.
es_un: Topología y tasas de error para el sistema de IBM Quantum *ibmq_manhattan*.
fr_fr: Topologie et taux d'erreur pour le système IBM Quantum *ibmq_manhattan*.
id_id: Topologi dan tingkat galat untuk sistem IBM Quantum *ibmq_manhattan*.
it_it: Topologia e tassi di errore per il computer quantistico *ibmq_manhattan* dell'IBM.
ja_jp: IBM Quantum *ibmq_manhattan* システムのトポロジーとエラー率
ko_kr: *ibmq_manhattan* 시스템에 대한 위상수학 및 오류 비율.
pl_pl: Topologia i wskaźniki błędów dla systemu IBM Quantum *ibmq_manhattan*.
pt_un: Topologia e taxas de erro para o sistema *ibmq_manhattan* do IBM Quantum.
ru_ru: Топология и частота ошибок для системы IBM Quantum *ibmq_manhattan*.
sw_ke: Mpangamano na viwango vya kasoro vya mfumo wa IBM Quantum *ibmq_manhattan*.
ta_in: IBM Quantum *ibmq_manhattan* system-இன் இடவியல் மற்றும் பிழை விகிதங்கள்.
te_in: IBM క్వాంటం *ibmq_manhattan* సిస్టమ్ యొక్క టోపాలజీ మరియు ఎర్రర్ రేట్లు.
tr_tr: IBM Quantum *ibmq_manhattan* sistemi için topoloji ve hata oranları.
zh_tw: IBM Quantum *ibmq_manhattan* 系統的拓蹼及錯誤率。

source: Where to go from here
bn_bn: এরপর কোথায় যাবেন
de_de: Weitere Informationen
el_gr: Πού να πάτε από εδώ
es_un: A dónde ir a partir de aquí
fr_fr: A présent où aller ?
id_id: Kemana selanjutnya setelah ini
it_it: Prossimi passi
ja_jp: 次なる学び
ko_kr: 더 알아보기
pl_pl: Kolejne kroki
pt_un: Onde ir a partir daqui
ru_ru: Что можно посмотреть ещё
sw_ke: Tunakwenda wapi kutoka hapa
ta_in: இங்கிருந்து எங்கே செல்ல
te_in: ఇక్కడి నుంచి ఎక్కడికి వెళ్లాలి
tr_tr: Buradan nereye gidilir
zh_tw: 從這裡開始

source: Hopefully we have given the reader a taste of what quantum computation has to offer and you are hungry for more. If so, there are several resources that may be of interest:
bn_bn: কোয়ান্টাম গণনা কি করতে পারে তার একটি নমুনা আমরা পাঠককে দিতে পেরেছি বলে আশা করি এবং আপনি নিশ্চয়ই আরও জানার জন্য আগ্রহী। সেজন্য, এখানে কিছু গুরুত্বপূর্ণ জিনিস দেয়া হলোঃ
de_de: Hoffentlich haben wir bei dem Leser einen Eindruck über die Leistungsfähingkeit von Quantencomputern verschaffen können und Interese auf weiterführenden Lernstoff geweckt. Wenn ja, gibt es mehrere Ressourcen, die sehr hier hilfreich sein könnten:
el_gr: Ας ελπίσουμε ότι έχουμε δώσει στον αναγνώστη μια γεύση του τι κβαντικό υπολογισμό έχει να προσφέρει και είστε "πεινασμένοι" για περισσότερα. Αν ναι, υπάρχουν διάφοροι πόροι που μπορεί να παρουσιάζουν ενδιαφέρον:
es_un: Esperamos haberle dado al lector una muestra de lo que la computación cuántica tiene para ofrecer y que estés ansioso por más. Si es así, existen varios recursos que pueden ser de interés:
fr_fr: Nous espérons avoir donné au lecteur un aperçu de ce que le calcul quantique a à offrir et l'envie d'aller plus loin. Dans ce cas, il y a plusieurs ressources qui peuvent vous intéresser :
it_it: Speriamo di averti dato un assaggio di ciò che il calcolo quantistico ha da offrire e di averti incuriosito. In tal caso, ci sono diverse risorse che potrebbero interessarti:
ja_jp: 量子計算が提供するものを読者の皆さんに体験してもらい、さらに多くのことを知りたいと思ってもらえたことを期待しています。もしそのようであれば、興味のあるかもしれない資料がいくつか用意されています。
ko_kr: 바라건대, 우리는 독자들에게 양자 계산이 어떤걸 제공하는지 맛보았기를 바라며, 여러분은 더 많은 것을 갈망하길 바란다. 그렇다면 다음과 같은 몇 가지 리소스를 활용할 수 있다.
pl_pl: Mamy nadzieję, że czytelnik poczuł przedsmak tego, co obliczenia kwantowe mają do zaoferowania i jest gotowy na więcej. Jeśli tak, to poniższe zasoby mogą być interesujące:
pt_un: Espero que tenhamos dado ao leitor um sabor do que a Computação Quântica tem para oferecer e que você esteja com fome de mais. Em caso afirmativo, há vários recursos que podem ser interessantes:
ru_ru: Надеемся, что мы дали читателю представление о том, что могут предложить квантовые вычисления, и вы захотите узнать больше. Если это так, то есть несколько ресурсов, которые могут быть вам интересны:
sw_ke: Tunatumaini kuwa tumempa msomaji mwonjo wa yale yanayowezekana kupitia tarakilishi za kwanta na kwamba ana hamu ya zaidi. Ikiwa ni hivyo, kuna rasilimali kadhaa zinazoweza kukuvutia:
ta_in: குவாண்டம் கணக்கீடு என்ன வழங்க வேண்டும் என்பதற்கான சுவையை வாசகருக்கு நாங்கள் வழங்கியுள்ளோம், மேலும் நீங்கள் பசியுடன் இருக்கிறீர்கள். அப்படியானால், ஆர்வமுள்ள பல ஆதாரங்கள் உள்ளன:
te_in: క్వాంటం కంప్యూటేషన్‌ని సమర్పించే దాని గురించి మేము పాఠకులకు ఒక రుచిని అందించాము మరియు మీరు మరిన్ని వాటి కోసం ఆసక్తితో ఉన్నారని ఆశిస్తున్నాము. అలా అయితే, ఆసక్తి కలిగించే అనేక వనరులు ఉన్నాయి:
tr_tr: Umarız okuyucuya kuantum hesaplamanın neler sunabileceğine dair bir tat vermişizdir ve siz daha fazlası için açsınızdır. Eğer öyleyse, ilginizi çekebilecek birkaç kaynak var:
zh_tw: 希望我們能讓讀者嘗嘗有什麼量子計算是必須提供，而你渴望能得到更多。 如果是的話，有幾個資源您可能會興趣的：

source: `Getting started with Qiskit <getting_started.html>`_ - Dive right into Qiskit.
bn_bn: `Qiskit পরিচিতি <getting_started.html>`_ - সরাসরি Qiskit শুরু করা যাক।
de_de: ` Erste Schritte mit Qiskit <getting_started.html>` _- Direkt mit Qiskit loslegen.
el_gr: `Ξεκινώντας με το Qiskit <getting_started.html>`_ - Μπείτε δεξιά στο Qiskit.
es_un: `Primeros pasos con Qiskit <getting_started.html>`_- Sumérjete en Qiskit.
fr_fr: `Getting started with Qiskit <getting_started.html>`_ - Démarrer avec Qiskit.
id_id: `Memulai dengan Qiskit <getting_started.html>`_ - Mendalami Qiskit.
it_it: Primi passi con Quiskit <getting_started.html>`_ - Dive right into Qiskit.
ja_jp: `Getting started with Qiskit <getting_started.html>`_ - Qiskit に飛び込んでみましょう。
ko_kr: `Getting started with Qiskit <getting_started.html>`_ - Qiskit 시작하기.
pl_pl: `Wprowadzenie do Qiskit <getting_started.html>`_ - Rozpocznik pracę z Qiskit.
pt_un: `Getting started with Qiskit <getting_started.html>`_ - Mergulhe diretamente no Qiskit.
ru_ru: `Начало работы с Qiskit <getting_started.html>`_ - Окунитесь прямо в Qiskit.
sw_ke: `Kuanzia na Qiskit <getting_started.html>`_ - Anza moja kwa moja katika Qiskit.
ta_in: `Qiskit-ஐ வைத்துத் தொடங்குதல் <getting_started.html>`_ - நேரடியாக Qiskit-ற்குள் குதிக்கலாம்.
te_in: `Qiskitతో ప్రారంభించడం <getting_started.html>`_ - Qiskitలోకి నేరుగా డైవ్ చేయండి.
tr_tr: `Getting started with Qiskit <getting_started.html>`_ - Doğrudan Qiskit'e dalın.
zh_tw: `開始使用 Qiskit <getting_started.html>`_ - 直接進入Qiskit。
