Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/qc_intro.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, zh_tw

source: Algorithms and applications that utilize quantum mechanical resources can be easily and efficiently written in the language of **quantum circuits**. A quantum circuit is a computational routine consisting of coherent quantum operations on quantum data, such as that held in qubits, and concurrent real-time classical computation. Each horizontal line, or wire in a circuit represents a qubit, with the left end of the wire being the initial quantum data, and the right being the final quantum data generated by the quantum circuit's computation. Operations on qubits can be placed on these wires, and are represented by boxes.
bn_bn: যে অ্যালগরিদম (ধারাক্রম) এবং অ্যাপ্লিকেশনগুলি কোয়ান্টাম বলবিদ্যার সাহায্য নেয় সেগুলি সহজে এবং নিপুণভাবে **কোয়ান্টাম বর্তনীর (সার্কিট)** ভাষায় প্রকাশ করা যায়। কোয়ান্টাম বর্তনী (সার্কিট) হল একটি গণনার রুটিন যা কিউবিটে থাকা কোয়ান্টাম তথ্যের উপর সুসংগত কোয়ান্টাম ক্রিয়াকলাপ এবং সহগামী রিয়াল টাইম ধ্রুপদী (ক্লাসিক্যাল) গণনার সমন্বয়। কোনো বর্তনীর (সার্কিট) তার বা প্রত্যেক অনুভূমিক রেখা একটি কিউবিটকে চিত্রিত করে, যেখানে তারের বামপ্রান্ত হল প্রাথমিক কোয়ান্টাম তথ্য এবং ডানপ্রান্ত হল কোয়ান্টাম সার্কিটের গণনা দ্বারা উৎপাদিত অন্তিম কোয়ান্টাম ডেটা। কিউবিটের অপারেশন এই তারগুলিতে স্থাপন করা যেতে পারে এবং সেগুলি বাক্স দিয়ে চিহ্নিত করা হয়।
de_de: Algorithmen und Anwendungen, die quantenmechanische Ressourcen nutzen, können einfach und effizient in der Sprache von ** Quantenschaltkreisen * * geschrieben werden. Ein Quantenschaltkreis ist eine Rechenroutine, die aus kohärenten Quantenoperationen auf Quantendaten besteht, wie sie in Qubits gehalten werden, und parallel dazu ablaufenden klassischen Echtzeit-Berechnungen. Jede horizontale Linie oder Draht in einer Schaltung stellt ein Qubit dar, wobei das linke Ende des Drahtes die ursprünglichen Quantendaten darstellt und das Rechte die endgültigen Quantendaten, die durch die Berechnung des Quantenschaltkreises erzeugt werden. Operationen auf Qubits werden durch Boxen dargestellt, die auf diesen Drähten platziert werden.
el_gr: Οι αλγόριθμοι και οι εφαρμογές που χρησιμοποιούν κβαντικούς μηχανικούς πόρους μπορούν να γραφτούν εύκολα και αποτελεσματικά στη γλώσσα των ** κβαντικών κυκλωμάτων * *. Ένα κβαντικό κύκλωμα είναι μια υπολογιστική ρουτίνα που αποτελείται από συνεκτικές κβαντικές λειτουργίες σε κβαντικά δεδομένα, όπως αυτά που διατηρούνται σε qubits, και ταυτόχρονο κλασικό υπολογισμό σε πραγματικό χρόνο. Κάθε οριζόντια γραμμή, ή καλώδιο σε ένα κύκλωμα αντιπροσωπεύει ένα qubit, με το αριστερό άκρο του καλωδίου να είναι τα αρχικά κβαντικά δεδομένα, και το δεξιό να είναι τα τελικά κβαντικά δεδομένα που δημιουργούνται από τον υπολογισμό του κβαντικού κυκλώματος. Οι λειτουργίες σε qubits μπορούν να τοποθετηθούν σε αυτά τα καλώδια και αντιπροσωπεύονται από τα πλαίσια.
es_un: Los algoritmos y las aplicaciones que utilizan recursos de la mecánica cuántica se pueden escribir de manera fácil y eficiente en el lenguaje de **circuitos cuánticos**. Un circuito cuántico es una rutina computacional que consiste en operaciones cuánticas coherentes sobre datos cuánticos, como el que se mantiene en qubits, y computación clásica concurrente en tiempo real. Cada línea horizontal o cable en un circuito representa un qubit, siendo el extremo izquierdo del cable los datos cuánticos iniciales y el derecho los datos cuánticos finales generados por el cálculo del circuito cuántico. Las operaciones en qubits se pueden colocar en estos cables y se representan mediante cajas.
fr_fr: Les algorithmes et les applications qui utilisent les principes de la mécanique quantique peuvent être écrits facilement et efficacement dans la langue des **circuits quantiques**. Un circuit quantique est une routine de calcul consistant en des opérations quantiques cohérentes sur des données quantiques, telles que celles qui sont détenues en qubits, et des calculs classiques en temps réel. Chaque ligne horizontale ou fil dans un circuit représente un qubit, avec l'extrémité gauche du fil étant les données quantiques initiales, et la droite étant les données quantiques finales générées par le calcul du circuit quantique. Les opérations sur les qubits peuvent être placées sur ces fils et sont représentées par des boîtes.
id_id: Algoritma dan aplikasi yang memanfaatkan prinsip mekanika kuantum dapat dengan mudah dan efisien ditulis dalam bahasa **sirkuit kuantum**. Sebuah sirkuit kuantum adalah sebuah rutinitas komputasi yang terdiri dari operasi kuantum koheren pada data kuantum, seperti yang ada di qubit, dan komputasi klasik konkuren dalam waktu riil. Setiap garis horizontal, atau kawat dalam sebuah sirkuit mewakili sebuah qubit, dengan ujung kiri kawat menjadi data kuantum awal, dan ujung kanan adalah data kuantum akhir yang dihasilkan oleh komputasi sirkuit kuantum. Operasi pada qubit dapat ditempatkan pada kabel ini, dan direpresentasikan dengan kotak-kotak.
it_it: Gli algoritmi e le applicazioni che utilizzano risorse della meccanica quantistica possono essere scritti in modo semplice ed efficiente nel linguaggio dei **circuiti quantistici**. Un circuito quantistico è una routine computazionale costituita da operazioni quantistiche coerenti su dati quantistici, come quella contenuta in qubit, e calcoli classici in tempo reale simultanei. Ogni linea orizzontale in un circuito rappresenta un qubit, con l'estremità sinistra della linea che rappresenta i dati quantistici iniziali e la destra i dati quantistici finali generati dal calcolo del circuito quantistico. Le operazioni sui qubit possono essere posizionate su questi fili e sono rappresentate da caselle.
ja_jp: 量子力学的なリソースを利用するアルゴリズムやアプリケーションは、 **量子回路** の枠組みで簡単かつ効率的に記述することができます。量子回路とは、量子ビットに保持されているような量子データに対するコヒーレントな量子演算と、リアルタイムの古典計算を同時に行う計算ルーチンのことです。回路内の各水平線は量子ビットを表し、線の左端が初期の量子データ、右端が量子回路の計算によって生成される最終的な量子データとなっています。量子ビットに対する演算は、これらの線上に配置することができ、箱として表されます。
ko_kr: 양자 기계 자원을 이용하는 알고리즘 및 애플리케이션은 **양자 회로** 의 언어로 쉽고 효율적으로 작성될 수 있다. 양자 회로는 양자으로 유지되는 것과 같은 양자 데이터에 대한 결맞음 양자 동작 (coherent quantum operations), 및 동시 실시간 고전적인 계산으로 구성되는 계산 루틴이다. 회로에 있는 각각의 수평선 또는 선은 큐비트를 나타내고, 와이어의 왼쪽 끝은 초기 양자 데이터이고, 우측은 양자 회로의 계산에 의해 생성되는 최종 양자 데이터이다. 큐비트들에 대한 동작들은 이러한 와이어들 상에 배치될 수 있고, 박스들로 표현된다.
pl_pl: Algorytmy i aplikacje, które wykorzystują zasoby mechaniki kwantowej, można łatwo i sprawnie pisać w języku **obwodów kwantowych**. Obwód kwantowy jest procedurą obliczeniową składającą się ze spójnych operacji kwantowych na danych kwantowych, takich jak te przechowywane w kubitach oraz współbieżne obliczenia klasyczne w czasie rzeczywistym. Każda linia pozioma lub drut w obwodzie reprezentuje kubit, gdzie lewy koniec drutu to początkowe dane kwantowe, a prawy koniec to dane kwantowe wygenerowane przez kwantowe obliczenia obwodu. Operacje na kubitach mogą być umieszczane na tych drutach i są reprezentowane przez kwadratowe pola.
pt_un: Algoritmos e aplicativos que utilizam recursos da mecânica quântica podem ser escritos de forma fácil e eficiente na linguagem dos **circuitos quânticos**. Um circuito quântico é uma rotina computacional que consiste de operações quânticas coerentes em dados quânticos, como aqueles armazenados em qubits, e computação clássica concorrente em tempo real. Cada linha horizontal ou fio em um circuito representa um qubit, com a extremidade esquerda do fio sendo os dados quânticos iniciais, e a direita sendo os dados quânticos finais gerados pela computação do circuito quântico. Operações em qubits podem ser colocadas nesses fios, e são representadas por caixas.
ru_ru: Алгоритмы и приложения, использующие ресурсы квантовой механики, могут быть легко и эффективно написаны на языке **квантовых цепей**. Квантовая цепь - это вычислительная процедура, состоящая из когерентных квантовых операций над квантовыми данными, например, хранящимися в кубитах, и параллельных классических вычислений в реальном времени. Каждая горизонтальная линия, или провод, в схеме представляет собой кубиты, левый конец провода - это начальные квантовые данные, а правый - конечные квантовые данные, полученные в результате вычислений квантовой схемы. Операции над кубитами могут быть размещены на этих проводах и представлены квадратиками.
sw_ke: Alogaridhimu na programu-tumizi zinazotumia rasilimali nyingi za makanika ya kwanta zinaweza kuandikwa kwa urahisi na kwa ufanisi kwa lugha ya **saketi za kwanta**. Saketi ya kwanta ni utaratibu wa hesabu ulio na operesheni zinazoambatana za kwanta kwenye data ya kwanta, kama ile iliyo katika qubits, na hesabu zenye mapatano za kiklasiki za wakati halisi. Kila mstari wa mlalo au waya katika saketi inawakilisha qubit, huku upande mwisho wa kushoto wa waya ukiwa data ya kwanta ya awali na upande wa kulia wa waya ukiwa data ya mwisho ya kwanta inayotokana na hesabu ya saketi ya kwanta. Operesheni kwenye qubits huwekwa kwenye waya hizi na zinawakilishwa na miraba.
ta_in: குவாண்டம் இயந்திர வளங்களைப் பயன்படுத்தும் வழிமுறைகள் மற்றும் பயன்பாடுகளை எளிதாகவும் திறமையாகவும் **quantum circuits** மொழியில் எழுதலாம். ஒரு குவாண்டம் சர்க்யூட் என்பது குவாண்டம் தரவுகளில் ஒத்திசைவான குவாண்டம் செயல்பாடுகளை உள்ளடக்கிய ஒரு கணக்கீட்டு வழக்கமாகும், அதாவது க்யூபிட்ல் நடத்தப்பட்டவை, மற்றும் ஒரே நேரத்தில் நிகழ்நேர கிளாசிக்கல் கணக்கீடு ஆகும். ஒவ்வொரு கிடைமட்டக் கோடு, அல்லது ஒரு சுற்றில் உள்ள கம்பி ஒரு க்யூபிட்டைக் குறிக்கிறது. கம்பியின் இடது முனை ஆரம்ப குவாண்டம் தரவு, மற்றும் வலது குவாண்டம் சர்க்யூட்டின் கணக்கீட்டால் உருவாக்கப்படும் இறுதி குவாண்டம் தரவு. க்யூபிட்களில் செயல்பாடுகள் இந்த கம்பிகளில் வைக்கப்படலாம், மேலும் அவை பெட்டிகளால் குறிக்கப்படுகின்றன.
te_in: క్వాంటం మెకానికల్ వనరులను ఉపయోగించే అల్గారిథమ్‌లు మరియు అప్లికేషన్‌లు **క్వాంటం సర్క్యూట్‌ల** భాషలో సులభంగా మరియు సమర్ధవంతంగా వ్రాయబడతాయి. క్వాంటం సర్క్యూట్ అనేది క్వాంటం డేటాపై పొందికైన క్వాంటం ఆపరేషన్‌లు, క్కుబిట్లలో నిర్వహించడం మరియు ఏకకాలిక నిజ-సమయ క్లాసికల్ కంప్యూటేషన్ వంటి గణన రొటీన్. ఒక సర్క్యూట్‌లోని ప్రతి క్షితిజ సమాంతర రేఖ లేదా వైర్ ఒక క్కుబిట్ను సూచిస్తుంది, వైర్ యొక్క ఎడమ చివర ప్రారంభ క్వాంటం డేటా మరియు కుడివైపు క్వాంటం సర్క్యూట్ యొక్క గణన ద్వారా రూపొందించబడిన చివరి క్వాంటం డేటా. క్కుబిట్లపై ఆపరేషన్లు ఈ వైర్‌లపై ఉంచబడతాయి మరియు బాక్సుల ద్వారా సూచించబడతాయి.
tr_tr: Kuantum mekanik kaynaklarını kullanan algoritmalar ve uygulamalar kolayca ve verimli bir şekilde **kuantum devreleri** nin dilinde yazılabilir. Bir kuantum devresi, kübitlerde tutulanlar gibi kuantum verileri üzerindeki eşevreli kuantum işlemlerini ve eş zamanlı gerçek zamanlı klasik hesaplamaları içeren bir hesaplama rutinidir. Bir devredeki her yatay çizgi ya da kablo bir kübiti, telin sol ucu başlangıç kuantum verisini ve sağ ucu kuantum devrenin hesaplamasıyla üretilen son kuantum verisini temsil eder. Kübitlerle ilişkili işlemler bu kablolara yerleştirilebilir ve kutularla temsil edilir.
zh_tw: 利用量子機械資源的演算法和應用，可以用 **量子電路** 的語言來輕鬆高效地編寫。 量子電路是一個計算常式，包含量子資料上的相干量子運算，如以量子位元為單位的量子運算，以及並行的實時經典計算。 每條水平線，或電路中的線代表一個量子位元，其中線的左端是初始量子資料，右邊是量子電路的計算產生的最終量子資料。 qubits 上的操作可以放置在這些電線上，並以方框表示。

source: Quantum state teleportation circuit revisited.
bn_bn: কোয়ান্টাম মান টেলিপোর্টেশন বর্তনীর (সার্কিট)।
de_de: Tiefere Einblicke in die Teleportation von Quantenzuständen.
el_gr: Επανεξετάστηκε το κύκλωμα τηλεμεταφοράς κβαντικής κατάστασης.
es_un: Revisando el circuito de teleportación de estados cuánticos.
fr_fr: Le circuit de téléportation d'état quantique revisité.
id_id: Menilik kembali sirkuit teleportasi keadaan kuantum.
it_it: Circuito di teletrasporto di stato quantistico rivisitato.
ja_jp: 量子状態テレポーテーション回路再訪
ko_kr: 다시 보는 양자 상태의 원격 이동 회로.
pl_pl: Ponowna prezentacja obwodu do teleportacji stanu kwantowego.
pt_un: Circuito de teletransporte de estado quântico revisitado.
ru_ru: Пересмотрена схема телепортации квантового состояния.
sw_ke: Urejeleaji wa saketi ya teleportation ya hali ya kwanta.
ta_in: குவாண்டம் நிலை டெலிபோர்ட்டேஷன் சர்க்யூட் மறுபார்வை.
te_in: క్వాంటం స్టేట్ టెలిపోర్టేషన్ సర్క్యూట్ తిరిగి సందర్శించబడినది.
tr_tr: Kuantum durum ışınlanma devresinin yeniden ele alınması.
zh_tw: 量子態的隠形傳輸電路被重新審視。

source: Quantum circuits enable a quantum computer to take in classical information and output a classical solution, leveraging quantum principles such as :ref:`superposition <qc-intro-superposition>` and :ref:`entanglement <qc-intro-entanglement>` to perform the computation.
fr_fr: Les circuits quantiques permettent à un ordinateur quantique d'utiliser des informations classiques et de produire une solution classique, en utilisant des principes quantiques tels que :ref:`superposition <qc-intro-superposition>` et :ref:`intrication <qc-intro-entanglement>` pour effectuer le calcul.
id_id: Sirkuit kuantum memungkinkan komputer kuantum untuk menerima informasi klasik dan mengeluarkan solusi klasik, dengan memanfaatkan prinsip-prinsip kuantum seperti :ref:`superposisi <qc-intro-superposition>` dan :ref:`entanglement <qc-intro-entanglement>` untuk melakukan komputasi.
it_it: I circuiti quantistici consentono a un computer quantistico di acquisire informazioni classiche e produrre una soluzione classica, sfruttando principi quantistici come :ref:`superposition <qc-intro-superposition>` e :ref:`entanglement <qc-intro-entanglement>` per eseguire il calcolo.
ja_jp: 量子回路は、量子コンピューターが古典的な情報を取り込んで、古典的な解を出力することを可能にし、 :ref:`重ね合わせ <qc-intro-superposition>` や :ref:`エンタングルメント <qc-intro-entanglement>` といった量子力学の原理を利用して計算を実行します。

source: A typical quantum algorithm workflow consists of:
bn_bn: একটি আদর্শ কোয়ান্টাম ধারাক্রম (অ্যালগরিদম) কর্মধারা যা নিয়ে গঠিত হয় তা হলঃ
de_de: Ein typischer Quanten-Algorithmus-Workflow besteht aus:
el_gr: Μια τυπική ροή εργασιών κβαντικού αλγόριθμου αποτελείται από:
es_un: Un flujo de trabajo típico de un algoritmo cuántico consiste en:
fr_fr: Un algorithme quantique typique consiste en :
id_id: Alur kerja algoritma kuantum umumnya terdiri dari:
it_it: Un tipico flusso di lavoro di un algoritmo quantistico è costituito da:
ja_jp: 典型的な量子アルゴリズムのワークフローは、以下のように構成されています。
ko_kr: 일반적인 양자 알고리즘 워크플로우는 다음으로 구성됩니다.
pl_pl: Schemat pracy z algorytmami kwantowymi składa się z:
pt_un: Um fluxo de trabalho de um algoritmo quântico típico consiste de:
ru_ru: Типичный ход квантового алгоритма состоит из:
sw_ke: Mtiririko wa kazi wa algorithmu ya kwanta kwa kawaida hujumuisha:
ta_in: ஒரு பொதுவான குவாண்டம் வழிமுறை பணிப்பாய்வு பின்வருமாறு:
te_in: ఒక సాధారణ క్వాంటం అల్గోరిథం వర్క్‌ఫ్లో వీటిని కలిగి ఉంటుంది:
tr_tr: Tipik bir kuantum algoritması iş akışı şunlardan oluşur:
zh_tw: 典型的量子演算法工作流程包括：

source: The problem we want to solve,
bn_bn: আমরা যে সমস্যা সমাধান করতে চাইছি,
de_de: Das Problem, das wir lösen wollen,
el_gr: Το πρόβλημα που θέλουμε να λύσουμε,
es_un: El problema que queremos resolver,
fr_fr: Le problème que nous voulons résoudre,
id_id: Masalah yang ingin kita pecahkan,
it_it: Il problema che vogliamo risolvere,
ja_jp: 解決したい問題
ko_kr: 우리가 해결하고자 하는 문제는
pl_pl: Problemu, który chcemy rozwiązać,
pt_un: O problema que queremos resolver,
ru_ru: Задача, которую мы хотим решить,
sw_ke: Tatizo tunalotaka kutatua,
ta_in: நாம் தீர்க்க விரும்பும் பிரச்சினை,
te_in: మనం పరిష్కరించాలనుకుంటున్న సమస్య,
tr_tr: Çözmek istediğimiz problem,
zh_tw: 我們想解決的問題

source: A classical algorithm that generates a description of a quantum circuit,
bn_bn: একটি ধ্রুপদী (ক্লাসিক্যাল) ধারাক্রম​ যা কোয়ান্টাম বর্তনীর (সার্কিট) বিবরণ যোগায়,
de_de: Ein klassischer Algorithmus, der eine Beschreibung eines Quantenschaltkreises erzeugt,
el_gr: Ένας κλασικός αλγόριθμος που δημιουργεί περιγραφή ενός κβαντικού κυκλώματος,
es_un: Un algoritmo clásico que genera una descripción de un circuito cuántico,
fr_fr: Un algorithme classique qui génère une description d'un circuit quantique,
id_id: Sebuah algoritma klasik yang menghasilkan deskripsi dari sirkuit kuantum,
it_it: Un algoritmo classico che genera una descrizione di un circuito quantistico,
ja_jp: 量子回路の記述を生成する古典的なアルゴリズム
ko_kr: 양자 회로에 대한 설명을 생성하는 고전적인 알고리즘,
pl_pl: Klasycznego algorytmu, który opisuje obwód kwantowy,
pt_un: Um algoritmo clássico que gera a descrição do circuito quântico,
ru_ru: Классического алгоритма, задающего вид квантовой цепи,
sw_ke: Algorithmu ya kiklasiki inayotoa taswira ya saketi ya kwanta,
ta_in: ஒரு குவாண்டம் சர்க்யூட் பற்றிய விளக்கத்தை உருவாக்கும் ஒரு கிளாசிக்கல் வழிமுறை,
te_in: క్వాంటం సర్క్యూట్ యొక్క వివరణను రూపొందించే క్లాసికల్ అల్గోరిథం,
tr_tr: Bir kuantum devresinin tanımını yapan klasik bir algoritma,
zh_tw: 一個經典演算法產生了量子電路的描述

source: The quantum circuit that needs to be run on quantum hardware,
bn_bn: কোয়ান্টাম বর্তনী (সার্কিট) যা কোয়ান্টাম হার্ডওয়্যারে রান করা প্রয়োজন,
de_de: Der Quantenschaltkreis, der auf Quantenhardware betrieben werden muss,
el_gr: Το κβαντικό κύκλωμα που πρέπει να τρέξει σε κβαντικό υλικό,
es_un: El circuito cuántico que necesita ser ejecutado en un hardware cuántico,
fr_fr: Le circuit quantique qui doit être exécuté sur du matériel quantique,
id_id: Sirkuit kuantum yang perlu dijalankan pada perangkat keras (hardware) kuantum,
it_it: Il circuito quantistico che deve essere eseguito su hardware quantistico,
ja_jp: 量子ハードウェア上で実行される量子回路
ko_kr: 양자 하드웨어에서 실행되어야 하는 양자 회로는
pl_pl: Obwodu kwantowego, który należy uruchomić na realnym komputerze kwantowym,
pt_un: O circuito quântico que precisa ser executado em hardware quântico,
ru_ru: Квантовой цепи, которую нужно запустить на квантовом оборудовании,
sw_ke: Saketi ya kwanta tunyohitaji kuendesha kutumia maunzi ya kwanta,
ta_in: குவாண்டம் வன்பொருளில் இயக்கப்பட வேண்டிய குவாண்டம் சர்க்யூட்,
te_in: క్వాంటం హార్డ్‌వేర్‌పై అమలు చేయాల్సిన క్వాంటం సర్క్యూట్,
tr_tr: Kuantum donanımı üzerinde çalıştırılması gereken kuantum devresi,
zh_tw: 量子電路要在量子硬體上運行

source: And the output classical solution to the problem that it produces.
bn_bn: এবং এটি যে ফলাফল উৎপাদন করে তা হল সমস্যার ধ্রুপদী (ক্লাসিক্যাল) সমাধান।
de_de: Und die klassische Output-Lösung für das Problem, das es erzeugt.
el_gr: Και η έξοδος της κλασική λύσης στο πρόβλημα που παράγει.
es_un: Y la solución clásica que resulta del problema que este produce.
fr_fr: Et la solution classique de sortie au problème qu'elle produit.
id_id: Dan output solusi klasik untuk masalah yang dihasilkannya.
it_it: E la classica soluzione in uscita (output) al problema che produce.
ja_jp: それが生成する問題に対しての古典的な出力解
ko_kr: 그리고 생성된 문제를 해결하기 위해 출력된 고전적 해법.
pl_pl: Oraz końcowego, klasycznego rozwiązania dla opisanego wcześniej problemu.
pt_un: E a solução clássica de saída para o problema que ela produz.
ru_ru: И выходное классическое решение проблемы, которую она производит.
sw_ke: Na pato la suluhisho la kiklasiki la tatizo ambalo linazalisha.
ta_in: அது உருவாக்கும் சிக்கலுக்கு வெளியாகும் கிளாசிக்கல் தீர்வு.
te_in: మరియు అది ఉత్పత్తి చేసే సమస్యకు అవుట్‌పుట్ క్లాసికల్ సొల్యూషన్.
tr_tr: Ve üretilen soruna klasik çözümün çıkışı.
zh_tw: 而它產生的問題的輸出經典解決方法。
