Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/qc_intro.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, zh_tw

source: Quantum gates form the primitive operations on quantum data. Quantum gates represent information preserving, reversible transformations on the quantum data stored in qubits. These "unitary" transformations represent the quantum mechanical core of a quantum circuit. Some gates such as :math:`X` (also written as :math:`\oplus`) and :math:`CX` have classical analogs such as bit-flip and :math:`XOR` operations, respectively, while others do not. The Hadamard (:math:`H`) gate, along with the parameterized rotates :math:`rX(\theta)` and :math:`rY(\theta)`, generate superposition states, while gates such as :math:`Z`, :math:`rZ(\theta)`, :math:`S`, and :math:`T` impart phases that can be used for interference. Two-qubit gates like the :math:`CX` gate are used to generate entanglement between pairs of qubits, or to "kick" the phase from one qubit to another. In contrast to gates, operations like "measurement", represented by the meter symbol in a box with a line connecting to a "target" wire, extract partial information about a qubit's state, often losing the phase, to be able to represent it as a classical bit and write that classical bit onto the target wire (often a fully classical wire in some readout device). This is the typical way to take information from the quantum data into a classical device. Note that with only :math:`H`, :math:`rZ(\theta)`, :math:`CX`, and measurement gates, i.e. a universal gate set, we can construct any quantum circuit, including those efficiently computing the dynamics of any physical system in nature.
bn_bn: কোয়ান্টাম যুক্তিবর্তনী (গেইট) কোয়ান্টাম তথ্যের (ডেটা) উপর প্রারম্ভিক ক্রিয়াকলাপ (অপারেশন) গঠন করে। কোয়ান্টাম যুক্তিবর্তনীগুলো তথ্য সংরক্ষণ করে, কোয়ান্টাম তথ্যের উপরে করা বিপরীতদিকের পরিবর্তনগুলো (রিভার্সিবল ট্রান্সফর্মেশন) কিউবিটে সংরক্ষিত থাকে। এই ঐকিক (ইউনিটারি) রূপান্তরগুলি কোয়ান্টাম সার্কিটের কোয়ান্টাম যান্ত্রিক কোর (core) কে প্রতিনিধিত্ব করে। কিছু গেট যেমন :math:`X` ( :math:`\oplus` হিসাবেও লেখা যায়) এবং :math:`CX` -এর যথাক্রমে বিট-ফ্লিপ এবং :math:`XOR` অপারেশনের মতো ধ্রুপদী (ক্লাসিক্যাল) অ্যানালগ রয়েছে, যা অন্যদের নেই। হ্যাডামার্ড (Hadamard (:math:`H`)) যুক্তিবর্তনী (গেইট), পরামিতিক ঘূর্ণন (প্যারামিটারাইজড রোটেট) যুক্তিবর্তনীসমূহ :math:`rX(\theta)` এবং :math:`rY(\theta)`, উপরিপাতন (সুপারপজিশন) অবস্থা (স্টেট) তৈরি করে, যখন : :math:`Z`, :math:`rZ(\theta)`, :math:`S`, এবং :math:`T` গেটগুলি দশা (ফেজ) তৈরি করে যা ব্যতিচারের (ইন্টারফিয়ারেন্স) জন্য ব্যবহার করা যায়। :math:`CX` গেটের মতো দুই-কিউবিট গেটগুলি কিউবিট জোড়ার মধ্যে এনট্যাঙ্গেলমেন্ট তৈরি করতে বা এক কিউবিট থেকে আরেকটি কিউবিটে দশা (ফেজ) কে স্থানান্তর করতে ব্যবহৃত হয়। অপরদিকে, পরিমাপ বা মেজারমেন্ট অপারেশন, যা একটি "টার্গেট" তারের সাথে সংযোগকারী একটি লাইন সহ একটি বাক্সে মিটার প্রতীক দ্বারা চিহ্নিত, একটি কিউবিটের অবস্থা সম্পর্কে আংশিক তথ্য বের করে। এই দশাকে ধ্রুপদী (ক্লাসিক্যাল) বিট হিসাবে প্রকাশ করতে এবং লক্ষ্য (টার্গেট) তারে তা লিখে রাখতে (অনেক রিডআউট যন্ত্রেই সম্পূর্ণ ক্লাসিক্যাল তার) প্রায়শই দশাটি হারিয়ে যায়। এটি কোয়ান্টাম ডেটা থেকে একটি ধ্রুপদী (ক্লাসিক্যাল) ডিভাইসে তথ্য নেওয়ার একটি সাধারণ উপায়। মনে রাখবেন যে শুধু :math:`H`, :math:`rZ(\theta)`, :math:`CX`, এবং পরিমাপের গেইট দিয়ে, অর্থাৎ একটি সার্বজনীন যুক্তিবর্তনী (গেইট) সেট দিয়ে, আমরা যেকোনো কোয়ান্টাম বর্তনী (সার্কিট) তৈরি করতে পারি, যার মধ্যে রয়েছে দক্ষতার সাথে প্রকৃতির যে কোন ভৌত ব্যবস্থার গতিবিদ্যা গণনা করা।
de_de: Quanten-Gates sind die Grundfunktionen für Quantendaten. Diese "unitären" Transformationen sind das Kernstück eines Quantenschaltkreises. Die Vorgänge sind Informationserhaltend und umkehrbar. Manche Gatter wie :math:`X` (auch geschrieben als :math:`\oplus`) und :math:`CX` haben klassische Analogien wie Bit-flip und :math:`XOR` Operationen, andere nicht. Das Hadamard (:math:`H`) Gatter, zusammen mit den parametrisierten Rotationen :math:`rX(\theta)` und :math:`rY(\theta)`, generiert Superposition-Zustände, während Gates wie :math:`Z`, :math:`rZ(\theta)`, :math:`S`, und :math:`T` Phasen erzeugen, die für Interferenzen verwendet werden können. Zwei-Qubit-Gates wie das :math:`CX` Gatter werden verwendet, um Verschränkung zwischen Qubit-Paaren zu erzeugen, oder die Phase von einem Qubit zum anderen zu "kicken". Im Gegensatz zu Gates, gehen bei Operationen wie einer "Messung" (repräsentiert durch das Zählersymbol mit einer Linie zum Zielregister) teilweise Informationen über den Zustand eines Qubits, wie z.B. die Phase verloren, um diese Information als klassischen Bit darstellen zu können. Es ist zu beachten, dass nur mit :math:`H`, :math:`rZ(\theta)`, :math:`CX` Messgattern, also Universellen Gate-Gruppen Quantenschaltkreise aufgebaut werden können. Einschließlich derer, die die Dynamik jedes physikalischen Systems in der Natur effizient berechnen.
es_un: Las compuertas cuánticas forman las operaciones primitivas sobre datos cuánticos. Las compuertas cuánticas representan transformaciones reversibles que preservan la información de los datos cuánticos almacenados en qubits. Estas transformaciones "unitarias" representan el núcleo mecánico cuántico de un circuito cuántico. Algunas compuertas como :math:`X` (también escrito como :math:`\oplus`) y :math:`CX` tienen análogos clásicos como las operaciones de cambio de bit (bit-flip) y :math:`XOR`, respectivamente, mientras que otras no. La compuerta Hadamard (:math:`H`), junto con las rotaciones parametrizadas :math:`rX(\theta)` y :math:`rY(\theta)`, generan estados de superposición, mientras que las compuertas como :math:`Z`, :math:`rZ(\theta)`, :math:`S`, y :math:`T` imparten fases que pueden usarse para la interferencia. Las compuertas de dos qubit como la compuerta :math:`CX` se utilizan para generar entrelazamientos entre pares de qubits, o para "patear" la fase de un qubit a otro. A diferencia de las compuertas, las operaciones como la "medición", representadas por el símbolo de medidor en una caja con una línea que se conecta a un cable "objetivo", extraen información parcial sobre el estado de un qubit, a menudo perdiendo la fase, para poder representarlo como un bit clásico y escribir ese bit clásico en el cable de destino (a menudo un cable completamente clásico en algún dispositivo de lectura). Esta es la forma típica de llevar información de los datos cuánticos a un dispositivo clásico. Ten en cuenta que con solo :math:`H`, :math:`rZ(\theta)`, :math:`CX`, y compuertas de medición, es decir, un conjunto de compuertas universales, podemos construir cualquier circuito cuántico, incluidos los que calculan eficazmente la dinámica de cualquier sistema físico de la naturaleza.
ko_kr: 양자 게이트는 양자 데이터에 적용되는 기본적인 연산을 구성한다. 양자 게이트는 큐비트 상에 저장된 양자 데이터에 적용되는 변환을 나타내며 이는 정보를 보존하고 가역적이다. 이러한 "유니터리" 변환은 양자 회로의 양자역학적 핵심을 보여준다. :math:`X` (:math:`\oplus` 형태로도 표기) 및 :math:`CX`와 같은 몇몇 게이트는 비트 반전 및 :math:`XOR`과 같이 대응되는 고전적 연산이 존재하기도 하지만 그렇지 않은 게이트 또한 존재한다. 하다마드(Hadamard, :math:`H`) 게이트와 매개변수를 가진 :math:`rX(\theta)` 및 :math:`rY(\theta)` 회전은 중첩 상태를 생성하는 한편 :math:`Z`, :math:`rZ(\theta)`, :math:`S`, 그리고 :math:`T` 게이트는 간섭을 일으킬 수 있도록 위상을 변화시킨다. :math:`CX` 게이트와 같은 2큐비트 게이트는 큐비트 묶음에 얽힘을 만들거나 어느 한 큐비트로부터 다른 하나의 큐비트로 위상을 "킥(kick)"하기 위해 사용한다. 다음으로 앞서 언급한 게이트와는 달리 "측정"(상자 내의 계량 기호와 "표적" 와이어로 연결된 선으로 표현)과 같은 연산은 큐비트의 상태에 관한 부분적인 정보를 추출하며 이 과정에서 고전적인 비트로 표현하고 표적 와이어(해독 장치의 대체로 완전히 고전적인 연결)에 그것을 기록하기 위해 보통 위상 정보를 잃게 된다. 이는 양자 데이터로부터 정보를 얻어내 고전적 장치로 보내는 일반적인 방법이다. 참고로 :math:`H`, :math:`rZ(\theta)`, :math:`CX`, 그리고 측정 게이트, 즉, 유니버설 게이트 집합만으로도 모든 종류의 양자 회로를 생성할 수 있으며 그러한 양자 회로에는 자연에 존재하는 물리계의 역학을 효율적으로 계산할 수 있는 회로까지 포함된다.
pl_pl: Bramki kwantowe wykonują podstawowe operacje na danych kwantowych. Bramki kwantowe reprezentują utrwalanie informacji, odwracalne przekształcenia danych kwantowych przechowywanych w kubitach. Te "unitarne" przekształcenia są kwantowo-mechanicznym trzonem obwodów kwantowych. Niektóre bramki, jak :math:`X` (pisane również jako :math:`\oplus`) i :math:`CX`, mają swoje klasyczne odpowiedniki, czyli odpowiednio operacje odwrócenie bitu i :math:`XOR`, natomiast inne ich nie posiadają. Bramka Hadamarda (:math:`H`) wraz z parametryzowalnymi rotacjami :math:`rX(\theta)` i :math:`rY(\theta)`, generują stany superpozycji, podczas gdy bramki takie jak :math:`Z`, :math:`rZ(\theta)`, :math:`S` oraz :math:`T` nadają fazy, które mogą być użyte do interferencji. Bramki dwu-kubitowe takie jak bramka :math:`CX` są wykorzystywane do wywoływania splątania między parami kubitów lub "przerzucenia" fazy z jednego kubitu na drugi. W przeciwieństwie do bramek, takie operacje jak "pomiar" oznaczone symbolem licznika w kwadracie połączonym linią z przewodem docelowym, uzyskują częściową informacje o stanie kubitu, często tracąc przy tym fazę, w celu przedstawienia informacji w postaci klasycznych bitów i zapisania tych klasycznych bitów na przewodzie docelowym (najczęściej jest to w pełni klasyczny przewód w urządzeniu odczytującym). To najczęstszy sposób przekazywania informacji z danych kwantowych do klasycznego urządzenia. Należy zauważyć, że przy użyciu wyłącznie bramek :math:`H`, :math:`rZ(\theta)`, :math:`CX` i bramki pomiaru, czyli uniwersalnego zestawu bramek, możemy skonstruować dowolny obwód kwantowy, włącznie z tymi, które wydajnie obliczają dynamikę dowolnego naturalnego układu fizycznego.
pt_un: As portas quânticas formam as operações primitivas em dados quânticos. As portas quânticas representam a preservação da informação, transformações reversíveis dos dados quânticos armazenados em qubits. Essas transformações "unitárias" representam o núcleo mecânico quântico de um circuito quântico. Algumas portas como :math:`X` (também escritas como :math:`\oplus`) e :math:`CX` possuem analogias clássicas como bit-flip e operações :math:`XOR`, respectiviamente, enquanto as outras não possuem. A transformação Hadamard (:math:`H`), junto com a rotação :math:`rX(\theta)` e :math:`rY(\theta)`, geram estados superpostos, enquanto portas como :math:`Z`, :math:`rZ(\theta)`, :math:`S`, e :math:`T` refletem fases que podem ser usadas para interferência. Portas Two-qubit como a :math:`CX` são usadas para criar um entrosamento entre pares de qubits, ou para "empurrar" a fase de um qubit para outro. Em contraste com portas, operações como "medição", representadas pelo símbolo do multímetro em uma caixa com uma linha conectando a um fio "alvo", extrai informação parcial sobre um estado qubit's, geralmente perdendo a fase, para ser possível representa-lo como um bit clássico, e escrever aquele bit clássico no fio alvo (geralmente um fio clássico em algum dispositivo de leitura-saída).Esse é o caminho típico de obter informações dos dados quânticos em um dispositivo clássico. Perceba que apenas com :math:`H`, :math:`rZ(\theta)`, :math:`CX`, e portas de mensuração, ex. um conjunto universal de portas, podemos construir qualquer circuito quântico, incluindo aqueles que computam eficientemente as dinâmicas de qualquer sistema físico em sua natureza.
ru_ru: Квантовые вентили образуют примитивные операции над квантовыми данными. Квантовые вентили представляют собой сохраняющие информацию обратимые преобразования квантовых данных, хранящихся в кубитах. Эти "унитарные" преобразования представляют собой квантово-механическое ядро квантовой цепи. Некоторые вентили, такие как :math:`X` (также пишутся как :math:`\oplus`) и :math:`CX`, имеют классические аналоги, такие как операции инвертирования бита и :math:`XOR`, соответственно, а другие - нет. Вентиль Адамара (:math:`H`), наряду с параметризованными вращениями :math:`rX(\theta)` и :math:`rY(\theta)`, создают состояния суперпозиции, а такие вентили как :math:`Z`, :math:`rZ(\theta)`, :math:`S` и :math:`T` придают фазы, которые могут быть использованы для интерференции. Двухкубитные вентили, такие как :math:`CX`, используются для создания запутанности между парами кубитов или для "перебрасывания" фазы с одного кубита на другой. В отличие от вентилей, операции типа "измерения", представленные символом счетчика в коробке с линией, соединяющей с "целевым" проводом, извлекают частичную информацию о состоянии кубита, часто теряя фазу, чтобы иметь возможность представить ее в виде классического бита и записать этот классический бит на целевой провод (часто полностью классический провод в некотором считывающем устройстве). Это типичный способ переноса информации из квантовых данных в классическое устройство. Заметим, что имея только :math:`H`, :math:`rZ(\theta)`, :math:`CX` и измерительные вентили, т.е. универсальный набор вентилей, мы можем построить любую квантовую схему, включая те, которые эффективно вычисляют динамику любой физической системы в природе.
sw_ke: Malango ya kwanta huunda msingi wa operesheni kwa data ya kwanta. Malango ya kwanta yanawakilisha mabadiliko kwenye data ya kwanta iliyohifadhiwa katika qubits; mabadiliko yanayohifadhi habari na yanayoweza kurejeshwa . Mabadiliko haya ya ``unitary`` yanawakilisha msingi wa makanika ya kwanta wa saketi ya kwanta. Baadhi ya malango kama vile :math:`X` (pia huandikwa kama :math:`\oplus`) na :math:`CX` yana analojia za kiklasiki kama vile operesheni za bit-flip na :math:`XOR` mtawalia, wakati mengine hayana. Lango la Hadamard (:math:`H`) pamoja na malango ya parameta za uzungushi :math:`rX(\theta)` na :math:`rY(\theta)`, huzalisha hali za superposition, wakati malango kama vile :math:`Z`, :math:`rZ(\theta)`, :math:`S`, na :math:`T` hutoa awamu ambazo zinaweza kutumiwa kwa mwingiliano. Malango ya qubit mbili kama lango la :math:`CX` hutumiwa kuzalisha entanglement kati ya jozi za qubits, au kuhamisha awamu kutoka qubit moja hadi nyingine. Tofauti na malango, operesheni kama "kipimo", inayowakilishwa na alama ya mita katika sanduku na mstari unaounganisha na waya "lengwa", hutoa habari kiasi kuhusu hali ya qubit, mara nyingi ikipoteza awamu, ili iweze kuiwakilisha kama bit ya klasiki na kuandika bit hiyo ya klasiki kwenye waya lengwa (mara nyingi waya wa klasiki kabisa kwenye kifaa cha readout). Hii ndio njia ya kawaida ya kuchukua habari kutoka kwa data ya kwanta hadi kwenye kifaa cha klasiki. Kumbuka kuwa tukiwa na tu :math:`H`, :math:`rZ(\theta)`, :math:`CX`, na malango ya kipimo, yaani seti ya jumla ya malango (universal gate set), tunaweza kujenga saketi yoyote ya kwanta, pamoja na zile zinazokokotoa kwa ufanisi mienendo ya mfumo wowote wa asili katika maumbile.
ta_in: குவாண்டம் கேட்ஸ் குவாண்டம் தரவின் பழமையான செயல்பாடுகளை உருவாக்குகிறது. குவாண்டம் கேட்ஸ் தகவல் பாதுகாத்தல், க்விட்களில் சேமிக்கப்பட்ட குவாண்டம் தரவின் மீளக்கூடிய மாற்றங்கள் ஆகியவற்றைக் குறிக்கிறது. இந்த "ஒற்றை" மாற்றங்கள் குவாண்டம் சுற்றின் குவாண்டம் இயந்திர மையத்தைக் குறிக்கின்றன. :math:`X` (:math:`\oplus` என்றும் எழுதப்பட்டுள்ளது) மற்றும் :math:`CX` ஆனது முறையே பிட்-ஃபிளிப் மற்றும் :math:`XOR` செயல்பாடுகள், முறையே, மற்றவை இல்லை. ஹடாமார்ட் (:math:`H`) வாயிலுடன், அளவுரு சுழற்சி சுழல்கிறது :math:`rX(\theta)` மற்றும் :math:`rY(\theta)`, வாயில்கள் :math:`Z`, :math:`rZ(\theta)`, :math:`S`, மற்றும் :math:`T` குறுக்கீட்டிற்குப் பயன்படுத்தக்கூடிய கட்டங்களை வழங்குகிறது இரண்டு-க்விட் வாயில்கள் :math:`CX` கேட் ஜோடி க்விட்களுக்கு இடையில் சிக்கலை உருவாக்க பயன்படுகிறது, அல்லது கட்டத்தை ஒரு குவிட்டில் இருந்து இன்னொரு கட்டத்திற்கு" உதைக்க "பயன்படுகிறது. வாயில்களுக்கு மாறாக, "அளவீடு" போன்ற செயல்பாடுகள், ஒரு "இலக்கு" கம்பியுடன் இணைக்கும் ஒரு கோடுடன் ஒரு பெட்டியில் மீட்டர் குறியீட்டால் குறிப்பிடப்படுகின்றன, ஒரு குவிட் நிலை பற்றிய பகுதியளவு தகவலைப் பிரித்தெடுக்கவும், பெரும்பாலும் கட்டத்தை இழந்து, அதை பிரதிநிதித்துவப்படுத்த முடியும் ஒரு கிளாசிக்கல் பிட் மற்றும் அந்த கிளாசிக்கல் பிட்டை இலக்கு கம்பியில் எழுதுங்கள் (பெரும்பாலும் சில ரீடுஅவுட் சாதனத்தில் ஒரு முழுமையான கிளாசிக்கல் கம்பி). குவாண்டம் தரவிலிருந்து தகவல்களை கிளாசிக்கல் சாதனத்திற்கு எடுத்துச் செல்வதற்கான பொதுவான வழி இது. :math:`H`, :math:`rZ(\theta)`, :math:`CX`, மற்றும் அளவீட்டு வாயில்கள், அதாவது உலகளாவிய வாயில் தொகுப்பு, மற்றும் எந்தவிதமான குவாண்டம் சுற்றையும் உருவாக்கலாம். இதில் அனைத்து இயற்கை இயற்பியல் அமைப்பின் மாற்றங்களைத் திறமையாகக் கணக்கிடுவதும் உட்படும்.
te_in: క్వాంటం గేట్స్ క్వాంటం డేటాపై ప్రిమిటివ్ ఆపరేషన్స్లను ఏర్పరుస్తాయి. క్వాంటం గేట్స్ qiskit నిల్వ చేయబడిన క్వాంటం డేటాపై సమాచారాన్ని భద్రపరిచే, రివర్సిబుల్ పరివర్తనలను సూచిస్తాయి. ఈ "యూనిటరీ" రూపాంతరాలు క్వాంటం సర్క్యూట్ యొక్క క్వాంటం మెకానికల్ కోర్ని సూచిస్తాయి. :math:`X` (:math:`\oplus` అని కూడా వ్రాయబడుతోంది) మరియు :math:`CX` వంటి కొన్ని గేట్‌లు వరుసగా బిట్-ఫ్లిప్ మరియు :math:`XOR` ఆపరేషన్స్ వంటి క్లాసికల్ అనలాగ్‌లను కలిగి ఉంటాయి, మరికొన్ని ఉండవు. Hadamard (:math:`H`) గేట్ తోపాటు, పారామీటరైజ్డ్ రోటేట్స్ :math:`rX(\theta)` మరియు :math:`rY(\theta)` , సూపర్‌పొజిషన్ స్థితులను ఉత్పత్తి చేస్తాయి, అయితే :math: `Z`, :math:`rZ(\theta)`, :math:`S`, మరియు :math:`T` అందించిన ఫసెస్ని ఇంటర్ఫేరెన్సు కోసం ఉపయోగించవచ్చు. :math:`CX` గేట్ వంటి రెండు-క్కుబిట్ గేట్స్ క్కుబిట్ జతల మధ్య ఎన్టాన్గిలెమెంట్ని సృష్టించడానికి లేదా ఒక క్కుబిట్ నుండి మరొకదానికి ఫసెని "కిక్" చేయడానికి ఉపయోగించబడతాయి. గేట్‌లకు విరుద్ధంగా, "టార్గెట్" వైర్‌కి కనెక్ట్ చేసే లైన్‌తో బాక్స్‌లో మీటర్ గుర్తు ద్వారా సూచించబడే "మెస్సుర్మెంట్" వంటి ఆపరేషన్స్, క్కుబిట్ స్థితి గురించి పాక్షిక సమాచారాన్ని సంగ్రహిస్తాయి, తరచుగా దశను కోల్పోయి, దానిని క్లాసికల్ బిట్ గా సూచించగలవు మరియు ఆ క్లాసికల్ బిట్‌ని టార్గెట్ వైర్‌పై వ్రాయగలవు (తరచుగా కొన్ని రీడౌట్ పరికరాలలో పూర్తిగా క్లాసికల్ వైర్). క్వాంటం డేటా నుండి సమాచారాన్ని క్లాసికల్ పరికరంలోకి తీసుకోవడానికి ఇది సాధారణ మార్గం. కేవలం :math:`H`, :math:`rZ(\theta)`, :math:`CX`, మరియు మెస్సుర్మెంట్ గేట్‌లతో, అంటే యూనివర్సల్ గేట్ సెట్‌తో, మనం ఎటువంటి క్వాంటం సర్క్యుట్ని అయినా నిర్మించగలమని గమనించండి , సమర్ధవంతంగా ప్రకృతిలో ఏదైనా భౌతిక వ్యవస్థ యొక్క డైనమిక్స్ కంప్యూటింగ్ చేసే వాటితో సహా .
tr_tr: Kuantum kapıları, kuantum verileri üzerindeki ilkel işlemleri oluşturur. Kuantum kapıları, kübitlerde depolanan kuantum verilerindeki bilgileri koruyan, tersine çevrilebilir dönüşümleri temsil eder. Bu "birimsel" dönüşümler, bir kuantum devresinin kuantum mekaniksel çekirdeğini temsil eder. :math:`X` (ayrıca :math:`\oplus` olarak da yazılır) ve :math:`CX` gibi bazı kapılar bit-flip ve :math:`XOR` işlemleri gibi klasik analog karşılıklara sahipken, diğerlerinde böyle bir özellik yoktur. Hadamard (:math:`H`) kapısı, parametreli döndürmeler :math:`rX(\theta)` ve :math:`rY(\theta)` ile birlikte süperpozisyon durumları oluştururken, :math: 'Z', :math:'rZ(\theta)', :math:'S' ve :math:'T' kapıları girişim için kullanılabilecek fazlar verir. :math:`CX` kapısı gibi iki kübitlik kapılar, kübit çiftleri arasında dolanıklık oluşturmak veya bir kübitten diğerine fazı "atlatmak" için kullanılır. Kapıların aksine, bir "hedef" tele (bazı okuma cihazlarında genellikle tamamen klasik bir tel) bağlanan bir çizgiye sahip bir kutuda sayaç sembolü ile temsil edilen "ölçüm" gibi işlemler, kübiti bir klasik bit şeklinde temsil edebilmek ve bu klasik biti hedef tele yazabilmek için genellikle fazı kaybederek bir kübitin durumu hakkında kısmi bilgi çıkarır. Bu, kuantum verilerinden klasik bir cihaza bilgi almanın tipik yoludur. Yalnızca :math:`H`, :math:`rZ(\theta)`, :math:`CX` ve ölçüm kapıları, yani evrensel bir kapı seti ile, doğadaki herhangi bir fiziksel sistemin dinamiği verimli şekilde hesaplamak da dahil olmak üzere herhangi bir kuantum devresini inşa edebileceğimize dikkat edin.

source: Constructing complex quantum circuits with minimal effort is at the heart of Qiskit, which supports a rich feature set of operations and can send your circuits to a range of :ref:`quantum computers <qc-intro-computers>` or classical simulators. With only a few lines of code, it is possible to construct complex circuits like the one above.
de_de: Die Konstruktion komplexer Quantenschaltungen mit minimalem Aufwand ist das Herzstück von Qiskit, das eine Vielzahl von Funktionen unterstützt und Ihre Schaltungen an eine Reihe von :ref:`Quantencomputern <qc-intro-computers>` oder klassischen Simulatoren senden kann. Mit nur wenigen Zeilen Code ist es möglich, komplexe Schaltungen wie die obige zu konstruieren.
es_un: La construcción de circuitos cuánticos complejos con el mínimo esfuerzo está el corazón de Qiskit, que admite un amplio conjunto de funciones de operaciones y puede enviar tus circuitos a una variedad de :ref:`computadoras cuánticas <qc-intro-computers>` o simuladores clásicos. Con solo unas pocas líneas de código, es posible construir circuitos complejos como el de arriba.
ko_kr: 복잡한 양자 회로를 최소한의 노력으로 구성하는 것이 Qiskit의 핵심이며, 다양한 기능 세트를 지원하고 회로를 다양한 :ref:`quantum computers <qc-intro-computers>` 또는 고전적 시뮬레이터로 보낼 수 있다. 약간의 코드만으로 위와 같은 복잡한 회로를 구성할 수 있다.
pt_un: Construir circuitos quânticos complexos com o mínimo de esforço está no coração do Qiskit, que suporta um rico conjunto de recursos de operações e pode ser passado para uma variedade de :ref:`computadores quânticos <qc-intro-computers>` ou simuladores clássicos. Com apenas algumas linhas de código, é possível construir circuitos complexos como o acima.
te_in: తక్కువ శ్రమతో సంక్లిష్టమైన క్వాంటం సర్క్యూట్‌లను నిర్మించడం Qiskit యొక్క ప్రదాన్యమైన విశేషమ్, ఇది రిచ్ ఫీచర్ ఆపరేషన్‌లకు మద్దతు ఇస్తుంది మరియు మీ సర్క్యూట్‌లను :ref:`quantum computers <qc-intro-computers>` లేదా క్లాసికల్ సిమ్యులేటర్‌ల శ్రేణికి పంపగలదు. కేవలం కొన్ని లైన్ల కోడ్‌తో, పైన పేర్కొన్న విధంగా సంక్లిష్ట సర్క్యూట్‌లను నిర్మించడం సాధ్యమవుతుంది.
