Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/qc_intro.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, zh_tw

source: The power of quantum computing rests on two cornerstones of quantum mechanics, namely :ref:`interference <qc-intro-interference>` and :ref:`entanglement <qc-intro-entanglement>` that highlight the wave- and particle-like aspects of quantum computation, respectively. Qiskit is an SDK for performing quantum computations that utilize these quantum mechanical principles using the language of :ref:`quantum circuits <qc-intro-circuits>`. Comprised of quantum gates, instructions, and classical control logic, quantum circuits allow for expressing complex algorithms and applications in a abstract manner that can be executed on a quantum computer. At its core, Qiskit is a quantum circuit construction, optimization, and execution engine. Additional algorithm and application layers leverage quantum circuits, often in concert with classical computing resources, to solve problems in optimization, quantum chemistry, physics, machine learning, and finance. In what follows, we give a very brief overview of quantum computing, and how Qiskit is used at each step. Interested readers are directed to additional in-depth materials for further insights.
bn_bn: কোয়ান্টাম কম্পিউটিংয়ের শক্তি কোয়ান্টাম বলবিদ্যার দুটি মূল নীতির উপর দণ্ডায়মান, যথা :ref:`interference <qc-intro-interference> এবং :ref:`entanglement <qc-intro-entanglement>` যা যথাক্রমে কোয়ান্টাম কম্পিউটেশনের তরঙ্গ- এবং কণার দিককে উল্লেখ করে। Qiskit কোয়ান্টাম কম্পিউটেশন সম্পাদনের জন্য একটি SDK যা :ref:`কোয়ান্টাম বর্তনী <qc-intro-circuits>` ল্যাঙ্গুয়েজ -এর মাধ্যমে কোয়ান্টাম বলবিদ্যার এই নীতিগুলি ব্যবহার করে। কোয়ান্টাম যুক্তিবর্তনী, নির্দেশনা, প্রথাগত (ক্লাসিক্যাল) কন্ট্রোল লজিক নিয়ে গঠিত কোয়ান্টাম বর্তনী (সার্কিট) জটিল ধারাক্রম (অ্যালগরিদম) এবং অ্যাপ্লিকেশনকে নির্দিষ্ট পদ্ধতিতে কোয়ান্টাম কম্পিউটারে কার্যকর করে। মূলত, Qiskit হ'ল একটি কোয়ান্টাম বর্তনী (সার্কিট) নির্মাণ, অনুকূলকরণ (অপটিমাইজেশন) এবং এক্সিকিউশন ইঞ্জিন। অতিরিক্ত ধারাক্রম (অ্যালগরিদম) এবং অ্যাপ্লিকেশনের মাধ্যমে এবং কখনো ধ্রুপদী (ক্লাসিক্যাল) কম্পিউটিংয়ের এর সাহায্য নিয়ে এটি অনুকূলকরণ (অপটিমাইজেশন), কোয়ান্টাম রসায়ন, পদার্থবিজ্ঞান, মেশিন লার্নিং এবং ব্যবস্থাপনাবিদ্যার জটিল সমস্যার সমাধান করে। এরপরে আমরা কোয়ান্টাম কম্পিউটিংয়ের এবং Qiskit কীভাবে ব্যবহৃত হয় তার প্রতিটি ধাপের সংক্ষিপ্ত বিবরণ দিব। আগ্রহী পাঠকদের আরও বেশি জানার জন্য বাড়তি পাঠ্য উপকরণ দেয়া হলো।
de_de: Die große Leistungsfähigkeit von Quantencomputing beruht im Wesentlichen auf zwei Eigenschaften der Quantenmechanik. Diese sind :ref:`Superposition <qc-intro-superposition>` und :ref:`Verschränkung <qc-intro-entanglement>` und leiten sich aus der parallelen Wellen- und Teilcheneigenschaft der Materia ab (Welle und Teilchen-Dualismus). Qiskit ist ein Software Development Kit (SDK) für das Quantencomputing, welche diese quantenmechanischen Prinzipien mit Hilfe von programmierbaren :ref:`Quantenschaltkreisen <qc-intro-circuits>` umsetzt. Durch Quantengatter, Programmieranweisungen und klassischer Steuerlogik, erlauben es Quantenschaltungen, komplexe Algorithmen und Anwendungen auf abstrakte Weise darzustellen und auf einem Quantencomputer auszuführen. Im Kern ist Qiskit ein Programmier-Instrument, um Quantenschaltkreise zu erstellen, zu optimieren und auszuführen. Sehr häufig arbeiten diese Quantenschaltkreise eng mit klassischen Rechenresourcen zusammen, um somit zum Beispiel numerische Optimierungen in der Chemie, der Physik, dem maschinellen Lernen oder der Finanzindustrie durzuführen. Im folgenden wird ein kurzer Überblick über die wesentlichen Eigenschaften des Quantencomputing gegeben, und anhand von Qiskit mit praktischen Beispielen erläutert. Interessierte Leser mögen dabei auf zusätzliche vertiefendere Fachliteratur zurückgreifen.
el_gr: Η δύναμη της κβαντικής υπολογιστικής βασίζεται σε δύο ακρογωνιαίους λίθους της κβαντικής μηχανικής, δηλαδή στις ιδιότητες των :ref:"interference <qc-intro-interference>` και :ref:" entanglement <qc-intro-entanglement>" που τονίζουν τις κυματικές και σωματιδιακές πτυχές του κβαντικού υπολογισμού, αντίστοιχα. Το Qiskit είναι ένα SDK για την εκτέλεση κβαντικών υπολογισμών που χρησιμοποιούν αυτές τις κβαντικές μηχανικές αρχές χρησιμοποιώντας τη γλώσσα :ref:` κβαντικών κυκλωμάτων <qc-intro-circuits>`. Αποτελείται από κβαντικές πύλες, οδηγίες, και την κλασική λογική ελέγχου, τα κβαντικά κυκλώματα επιτρέπουν την έκφραση πολύπλοκων αλγορίθμων και εφαρμογών με έναν αφηρημένο τρόπο που μπορεί να εκτελεστεί σε έναν κβαντικό υπολογιστή. Στον πυρήνα του, το Qiskit είναι μια μηχανή κβαντικών κυκλωμάτων κατασκευής, βελτιστοποίησης και εκτέλεσης. Πρόσθετοι αλγόριθμοι και επίπεδα εφαρμογών αξιοποιούν τα κβαντικά κυκλώματα, συχνά σε συνεννόηση με τους κλασικούς υπολογιστικούς πόρους, για την επίλυση προβλημάτων βελτιστοποίησης, κβαντικής χημείας, φυσικής, μηχανικής μάθησης και χρηματοδότησης. Στη συνέχεια, δίνουμε μια πολύ σύντομη επισκόπηση του κβαντικού υπολογισμού και πώς χρησιμοποιείται το Qiskit σε κάθε βήμα. Οι ενδιαφερόμενοι αναγνώστες απευθύνονται σε επιπλέον υλικό για περαιτέρω πληροφορίες σε βάθος.
es_un: El poder de la computación cuántica se basa en dos pilares de la mecánica cuántica, la :ref:`interferencia <qc-intro-interference>` y el :ref:`entrelazamiento <qc-intro-entanglement>` que resaltan los aspectos ondulatorios y de partículas de la computación cuántica, respectivamente. Qiskit es un kit de desarrollo de software (Software Development Kit, SDK) para realizar cálculos cuánticos que utilizan estos principios de la mecánica cuántica usando el lenguaje de los :ref:`circuitos cuánticos <qc-intro-circuits>`. Compuestos por compuertas cuánticas, instrucciones y lógica de control clásica, los circuitos cuánticos permiten expresar algoritmos complejos y aplicaciones de manera abstracta que pueden ser ejecutados en una computadora cuántica. En esencia, Qiskit es un motor de construcción, optimización y ejecución de circuitos cuánticos. Las capas de aplicaciones y algoritmos adicionales aprovechan los circuitos cuánticos, a menudo en combinación con recursos computacionales clásicos, para resolver problemas de optimización, química cuántica, física, machine learning y finanzas. A continuación, brindamos una breve descripción general de la computación cuántica y cómo se emplea Qiskit en cada paso. Los lectores interesados son dirigidos a materiales detallados adicionales para obtener más información.
ko_kr: 양자 컴퓨팅의 힘은 양자역학의 두 주춧돌에서 나오는데, 바로 양자 계산의 파동의 성질을 강조하는 :ref:`간섭 <qc-intro-interference>` 과 입자의 성질을 강조하는 :ref:`얽힘 <qc-intro-entanglement>` 이다. Qiskit은 :ref:`양자 회로 <qc-intro-circuits>` 의 언어를 사용하여 이러한 양자역학의 원리들을 적용해 양자 계산을 수행하는 SDK이다. 양자 게이트, 명령어, 그리고 고전적 제어 논리로 이루어진 양자 회로는 복잡한 알고리즘과 애플리케이션을 양자 컴퓨터에서 실행될 수 있는 추상적인 방식으로 나타낸다. Qiskit은 본질적으로 양자 회로 구축, 최적화, 그리고 실행 엔진이다. 추가적인 알고리즘과 애플리케이션 계층은 보통 고전적인 컴퓨팅 자원과 함께 양자 회로를 이용하여 최적화, 양자 화학, 물리, 기계 학습, 그리고 금융에 관한 문제들을 해결한다. 다음으로는 양자 컴퓨팅에 대한 간단한 개요와 Qiskit이 각 단계에서 어떻게 사용되는지 설명할 것이다. 더 심도 있는 내용에 관심이 있는 독자들을 위해 추가자료도 제공될 것이다.
pl_pl: Siła obliczeń kwantowych opiera się na dwóch fundamentach mechaniki kwantowej, a mianowicie :ref:`interferencji <qc-intro-interference>` i :ref:`splątaniu <qc-intro-entanglement>`, które podkreślają aspekty obliczeń kwantowych związane odpowiednio z falami i cząstkami. Qiskit jest SDK (software development kit) do przeprowadzania obliczeń kwantowych wykorzystujących zasady mechaniki kwantowej z pomocą języka :ref:`obwodów kwantowych <qc-intro-circuits>`. Obwody kwantowe składające się bramek kwantowych, instrukcji i klasycznej logiki kontrolnej umożliwiają przedstawienie złożonych algorytmów i aplikacji na poziomie abstrakcji, która umożliwia ich uruchomienie na komputerze kwantowym. Rdzeniem Qiskit jest konstrukcja, optymalizacja i wykonywanie obwodów kwantowych. Dodatkowe algorytmy i warstwy aplikacji wykorzystują obiegi kwantowe, często w połączeniu z klasycznymi zasobami komputerowymi, do rozwiązywania problemów w dziedzinie optymalizacji, chemii kwantowej, fizyki, uczeniem maszynowym i finansami. Poniżej przedstawiamy bardzo krótkie podsumowanie obliczeń kwantowych i sposób korzystania z Qiskit na każdym etapie. Zainteresowanych czytelników odsyłamy do dodatkowych, bardziej szczególowych materiałów w celu uzyskania głębszej wiedzy.
pt_un: O poder da computação quântica baseia-se em dois pilares da mecânica quântica, denominadas por :ref:`interferência <qc-intro-superposition>` e o :ref:`entrelaçamento <qc-intro-entanglement>` que destacam os aspectos ondulatórios - e da partícula - na computação quântica, respectivamente. O Qiskit é uma SDK para executar cálculos quânticos que utiliza esses princípios mecânico quânticos usando a linguagem de :ref:`circuitos quânticos <qc-intro-circuits>`. Composto de portas quânticas, instruções e lógica de controle clássica, circuitos quânticos permitem expressar algoritmos e aplicações complexas de forma abstrata e que pode ser executada em um computador quântico. Em sua essência, o Qiskit é um mecanismo de construção, otimização e execução de circuitos quânticos. Algoritmos adicionais e camadas de aplicações alavancam circuitos quânticos, geralmente em conjunto com recursos de computação clássica, para resolver problemas de otimização, química quântica, física, aprendizado de máquina e finanças. A seguir, apresentaremos uma breve visão geral da computação quântica e como o Qiskit é usado em cada passo. Os leitores interessados podem acessar materiais adicionais mais detalhados para novas ideias.
ru_ru: Сила квантовых вычислений опирается на два краеугольных камня квантовой механики, а именно: :ref:`интерференцию <qc-intro-interference>` и :ref:`квантовую запутанность <qc-intro-entanglement>`, которые подчеркивают волновые и корпускулярные аспекты квантовых вычислений, соответственно. Qiskit (читается кис-кит) - это SDK (Software Development Kit, набор для разработки программного обеспечения) для выполнения квантовых вычислений, опирающихся на принципы квантовой механики, используя язык :ref:`квантовых цепей <qc-intro-circuits>`. Квантовые цепи, элементами которых являются квантовые вентили, инструкции и классическая логика управления, позволяют представлять сложные алгоритмы и приложения в абстрактной форме, которая может быть выполнена на квантовом компьютере. В своей основе Qiskit - это механизм построения, оптимизации и выполнения квантовых цепей. Дополнительные уровни алгоритмов и приложений используют квантовые схемы, часто в сочетании с классическими вычислительными ресурсами, для решения проблем оптимизации, квантовой химии, физики, машинного обучения и финансов. Далее мы даем очень краткий обзор квантовых вычислений и того, как Qiskit используется на каждом этапе. Заинтересованные читатели могут обратиться к дополнительным материалам для более глубокого понимания.
sw_ke: Uwezo wa utarakilishi wa kwanta unategemea misingi miwili ya makanika ya kwanta, ambayo ni :ref:`mwingiliano <qc-intro-interference>` na :ref:`entanglement <qc-intro-entanglement>` ambazo zinabainisha uwimbi na uchembechembe wa utarakilshi wa kwanta mtawalia. Qiskit ni SDK ya kutekeleza hesabu za kwanta ambazo zinatumia kanuni za makanika ya kwanta ikitumia lugha ya :ref:`saketi za kwanta <qc-intro-circuits>`. Zikijumuisha malango ya kwanta, maagizo, na udhibiti wa mantiki ya klasiki, saketi za kwanta zinaruhusu kuonyesha alogaridhimu tata na programu-tumizi kwa namna dhahania ambayo inaweza kutekelezwa kwenye tarakilishi ya kwanta. Kwenye msingi wake, Qiskit ni ujenzi wa saketi ya kwanta, usadifishaji na mtambo wa utekelezaji. Alogaridhimu na tabaka za programu-tumizi zaidi zinatumia saketi za kwanta, mara nyingi kwa ushirikiano na rasilimali za utarakilishi wa klasiki, ili kusuluhisha matatizo katika usadifishaji, kemia ya kwanta, fizikia, ujifunzaji wa mashine, na fedha. Katika yajayo, tunapeana muhtasari mfupi wa utarakilishi wa kwanta, na jinsi Qiskit inatumika katika kila hatua. Wasomaji waliovutiwa wanaelekezwa kwenye nyenzo zaidi za kina kwa maarifa zaidi.
ta_in: குவாண்டம் கம்ப்யூட்டிங்கின் சக்தி குவாண்டம் இயக்கவியலின் இரண்டு மூலையில் உள்ளது, அதாவது :ref:`குறுக்கீடு <qc-intro-interference>` மற்றும் :ref:`அலைகளை முன்னிலைப்படுத்தும் <qc-intro-entanglement>` முறையே குவாண்டம் கணக்கீட்டின் அம்சங்கள்.Qiskit என்பது குவாண்டம் கணக்கீடுகளைச் செய்வதற்கான ஒரு SDK ஆகும், இது இந்த குவாண்டம் இயந்திரக் கொள்கைகளைப் பயன்படுத்துகிறது :ref:`குவாண்டம் சர்க்யூட்கள் <qc-intro-circuits>`. குவாண்டம் கேட்கள், அறிவுறுத்தல்கள் மற்றும் கிளாசிக்கல் கட்டுப்பாட்டு தர்க்கம் ஆகியவற்றைக் கொண்ட குவாண்டம் சர்க்யூட்கள் சிக்கலான வழிமுறைகளையும் பயன்பாடுகளையும் ஒரு குவாண்டம் கணினியில் செயல்படுத்தக்கூடிய சுருக்க முறையில் வெளிப்படுத்த அனுமதிக்கின்றன. அதன் மையத்தில், Qiskit என்பது ஒரு குவாண்டம் சர்க்யூட் கட்டுமானம், தேர்வுமுறை மற்றும் செயல்படுத்தல் இயந்திரம். கூடுதல் வழிமுறை மற்றும் பயன்பாட்டு அடுக்குகள் குவாண்டம் சர்க்யூட்களை, பெரும்பாலும் கிளாசிக்கல் கம்ப்யூட்டிங் ஆதாரங்களுடன் இணைந்து, தேர்வுமுறை, குவாண்டம் வேதியியல், இயற்பியல், இயந்திர கற்றல் மற்றும் நிதி ஆகியவற்றில் சிக்கல்களைத் தீர்க்கின்றன. பின்வருவனவற்றில், குவாண்டம் கம்ப்யூட்டிங் பற்றிய மிகச் சுருக்கமான கண்ணோட்டத்தையும், ஒவ்வொரு அடியிலும் qiskit எவ்வாறு பயன்படுத்தப்படுகிறது என்பதையும் தருகிறோம். ஆர்வமுள்ள வாசகர்கள் கூடுதல் நுண்ணறிவுகளுக்கும், கூடுதல் ஆழமான பொருட்களுக்கும் அனுப்பப்படுகிறார்கள்.
te_in: క్వాంటం కంప్యూటింగ్ యొక్క శక్తి క్వాంటం మెకానిక్స్ యొక్క రెండు మూలస్తంభాలపై ఆధారపడి ఉంటుంది, అవి :ref:`ఇంటర్ఫేన్స్ <qc-intro-interference>` మరియు :ref:`ఎన్టాన్గిల్మెంట్<qc-intro-entanglement>` ఇవి క్వాంటమ్ కంప్యూటేషన్ యొక్క వేవ్ మరియు పార్టికల్ లాంటి అంశాలని హైలైట్ చేస్తాయి వరుసగా. Qiskit అనేది క్వాంటం కంప్యూటేషన్‌లను నిర్వహించడానికి ఒక SDK, ఇది :ref:`క్వాంటం సర్క్యూట్లు <qc-intro-circuits>` భాషని వినియోగించుకుని ఈ క్వాంటం మెకానికల్ సూత్రాలను ఉపయోగిస్తుంది. క్వాంటం గేట్‌లు, ఇన్స్ట్రక్షన్లు మరియు క్లాసికల్ కంట్రోల్ లాజిక్‌లతో కూడిన క్వాంటం సర్క్యూట్‌లు సంక్లిష్ట అల్గారిథమ్‌లు మరియు అప్లికేషన్‌లను క్వాంటం కంప్యూటర్‌లో అమలు చేయగల నైరూప్య పద్ధతిలో వ్యక్తీకరించడానికి అనుమతిస్తాయి. Qiskit అనేది దాని ప్రధాన భాగంలో, క్వాంటం సర్క్యూట్ నిర్మాణం, ఆప్టిమైజేషన్ మరియు అమలు ఇంజిన్. ఆప్టిమైజేషన్, క్వాంటం కెమిస్ట్రీ, ఫిజిక్స్, మెషిన్ లెర్నింగ్ మరియు ఫైనాన్స్‌లో సమస్యలను పరిష్కరించడానికి అదనపు అల్గారిథమ్ మరియు అప్లికేషన్ లేయర్‌లు క్వాంటం సర్క్యూట్‌లను, తరచుగా క్లాసికల్ కంప్యూటింగ్ వనరుల పరస్పర అంగీకారం చే ప్రభావితం చేస్తాయి. కింది వాటిలో, మేము క్వాంటం కంప్యూటింగ్ గురించి చాలా సంక్షిప్త అవలోకనాన్ని మరియు ప్రతి దశలో Qiskit ఎలా ఉపయోగించబడుతుందో ఇస్తాము. ఆసక్తిగల పాఠకులు తదుపరి అంతర్దృష్టుల కోసం అదనపు లోతైన మెటీరియల్‌లకు మళ్లించబడ్డారు.
tr_tr: Kuantum hesaplamanın gücü, kuantum mekaniğinin iki temel taşı sırasıyla kuantum hesaplamanın dalga ve parçacık yönlerini vurgulayan girişim :ref:`interference <qc-intro-interference>` ve dolanıklık :ref:`entanglement <qc-intro-entanglement>` yatar. Qiskit, kuantum devrelerinin :ref:`quantum circuits <qc-intro-circuits>` dilini kullanarak kuantum mekaniğinin prensiplerinden faydalanan kuantum hesaplamaları yürütmek için bir SDK (yazılım geliştirme kiti) 'dir. Kuantum kapıları, talimatlar ve klasik kontrol mantığından oluşan kuantum devreleri, karmaşık algoritmaların ve uygulamaların bir kuantum bilgisayarda yürütülebilecek soyut bir şekilde ifade edilmesini sağlar. Özünde, Qiskit bir kuantum devre yapım, optimizasyon ve yürütme makinesidir. Ek algoritma ve uygulama katmanları, optimizasyon, kuantum kimyası, fizik, makine öğrenimi ve finanstaki sorunları çözmek için genellikle klasik hesaplama kaynaklarıyla uyumlu olarak kuantum devrelerinden yararlanır. Akabinde, kuantum hesaplamaya çok kısa bir genel bakış ve Qiskit'in her adımda nasıl kullanıldığını veriyoruz. Konuyla ilgilenen okuyucular, daha fazla bilgi için derinlemesine işlenen ek materyallere yönlenebilir.
zh_tw: 量子計算的力量在於量子力學的兩個基石，即 :ref:`干涉 <qc-intro-interference>` 和 :ref:`糾纏 <qc-intro-entanglement>` ，分別強調量子計算的波與粒子像性等方面。 Qiskit 是一套軟體開發套件用來進行量子計算並使用量子力學的原理來作 :ref:"量子電路 <qc-intro-circuits>" 的語言。量子閘、指令和經典的控制邏輯，量子電路允許量子電腦上執行以抽象的方式表達複雜的演算法和應用。在其核心， Qiskit 是一個量子電路構造、最佳化和執行引擎。額外的演算法和應用層利用量子電路，經常與經典運算資源合作，去解決最佳化、量子化學、物理、機器學習和金融等方面的問題。以下是我們對量子計算的簡要概述，以及在每個步驟中如何使用 Qiskit 的情況。有興趣的讀者請至額外深入的資料以進一步深入瞭解。

source: Interference
bn_bn: ব্যতিচার (ইন্টারফিয়ারেন্স)
de_de: Interferenz
el_gr: Παρεμβολή
es_un: Interferencia
ko_kr: 간섭
pl_pl: Interferencja
pt_un: Interferência
ru_ru: Интерференция
sw_ke: Mwingiliano
ta_in: குறுக்கீடு
te_in: ఇన్టర్పెరెన్స్
tr_tr: Girişim
zh_tw: 干涉

source: Like a classical computer, a quantum computer operates on bits. However, while classical bits can only be found in the states 0 and 1, a quantum bit, or qubit, can represent the values 0 and 1, or linear combinations of both. These linear combinations are known as superpositions (or superposition states).
bn_bn: ধ্রুপদী (ক্লাসিক্যাল) কম্পিউটারের মতো একটি কোয়ান্টাম কম্পিউটার বিট (bit) এর ওপর কাজ করে। তবে, যদিও ধ্রুপদী (ক্লাসিক্যাল) বিট কেবল ০ এবং ১ এই দুটি অবস্থায় পাওয়া যায়, একটি কোয়ান্টাম বিট, বা কিউবিট ০ এবং ১ অথবা উভয়ের যোগাশ্রয়ী সমযোজন অবস্থায় থাকতে পারে। এই যোগাশ্রয়ী সমযোজন সুপারপজিশন বা উপরিপাতন (অথবা উপরিপাতন মান বা অবস্থা) নামে পরিচিত।
de_de: Ein Quantencomputer arbeitet analog zu einem klassischen Computer auf der Basis von Bits. Beim klassischen Computer können diese Bits nur zwei Zustände einnehmen, nämlich den Zustand 0 oder den Zustand 1. Ein Quantenbit oder qubit kann allerdinds zusätzlich zur 0 und 1 noch eine Linearkombination dieser beiden Zustände darstellen. Diese Linearkombination wird Superposition oder Superposition von Zuständen genannt.
el_gr: Όπως ένας κλασικός υπολογιστής, ένας κβαντικός υπολογιστής λειτουργεί με bits. Ωστόσο, ενώ τα κλασικά bits μπορούν να βρεθούν μόνο στις καταστάσεις 0 και 1, ένα κβαντικό bit, ή qubit, μπορεί να αντιπροσωπεύει τις τιμές 0 και 1, ή γραμμικούς συνδυασμούς και των δύο. Αυτοί οι γραμμικοί συνδυασμοί είναι γνωστοί ως υπερθέσεις (ή καταστάσεις υπερθέσεων).
es_un: Al igual que una computadora clásica, una computadora cuántica opera en bits. Sin embargo, mientras que los bits clásicos solo se pueden encontrar en los estados 0 y 1, un bit cuántico, o qubit, puede representar los valores 0 y 1, o combinaciones lineales de ambos. Estas combinaciones lineales se conocen como superposiciones (o estados de superposición).
ko_kr: 고전 컴퓨터와 마찬가지로, 양자 컴퓨터는 비트로 동작한다. 하지만 고전 비트가 0이나 1 상태로만 있을 수 있는 반면에 양자 비트, 또는 큐비트는 0이나 1 뿐만 아니라 둘의 선형 결합으로도 존재할 수 있다. 이러한 선형 결합은 중첩 (또는 중첩 상태) 이라고도 알려져 있다.
pl_pl: Podobnie jak komputer klasyczny, komputer kwantowy wykonuje operacje na bitach. Klasyczne bity mogą znajdować się w stanie 0 lub 1, natomiast kwantowe bity, lub kubity, mogą mieć wartość 0, 1 lub liniową kombinację obu stanów. Liniową kombinację obu stanów nazywamy superpozycją (lub stan superpozycji).
pt_un: Como um computador clássico, um computador quântico opera em bits. No entanto, enquanto bits clássicos só podem ser encontrados nos estados 0 ou 1, um bit quântico, ou qubit, pode representar os valores 0, 1, ou combinações lineares de ambos. Tais combinações lineares são conhecidas como superposições (ou estados de superposição).
ru_ru: По аналогии с классическим компьютером, квантовый компьютер тоже работает с битами. Однако, в то время как классические биты могут находиться только в состояниях 0 и 1, квантовый бит, или кубит, может принимать не только значения 0 и 1, но и любую их линейную комбинацию. В последнем случае говорят, что система находится в суперпозиции (состоянии суперпозиции).
sw_ke: Kama tu tarakilishi za kiklasiki, tarakilishi ya kwanta infanya kazi kutumia tarakimu jozi. Tarakimu jozi za kiklasiki huwa katika hali za 0 na 1, ilhali tarakimu jozi za kwanta, au "qubit" zaezakuwa katika hali za 0 na 1 au muungano wa kimstari wa zote mbili. Miungano hii ya kimstari huitwa **superpositions** (au hali za superposition).
ta_in: கிளாசிக்கல் கணினியைப் போலவே, ஒரு குவாண்டம் கணினி பிட்கள் மூலமாகவே இயங்குகின்றன. எனினும், கிளாசிக்கல் பிட்களை 0 மற்றும் 1 நிலைகளில் மட்டுமே காண முடியும், ஒரு குவாண்டம் பிட் அல்லது க்யூபிட், 0 மற்றும் 1 மதிப்புகளை அல்லது இரண்டின் நேரியல் சேர்க்கைகளையும் குறிக்க முடியும். இந்த நேரியல் சேர்க்கைகள் சூப்பர்பொசிஷன்கள் (அல்லது சூப்பர்பொசிஷன் நிலைகள்) என்று அழைக்கப்படுகின்றன.
te_in: క్లాసికల్ కంప్యూటర్ లాగా, క్వాంటం కంప్యూటర్ బిట్స్‌పై పనిచేస్తుంది. అయినప్పటికీ, క్లాసికల్ బిట్‌లు 0 మరియు 1 స్టేట్లలో మాత్రమే కనుగొనబడతాయి, క్వాంటం బిట్ లేదా qubit, 0 మరియు 1 విలువలను లేదా రెండింటి యొక్క లీనియర్ కంబినేషన్లను సూచించగలవు. ఈ లీనియర్ కంబినేషన్లను సూపర్‌పొజిషన్‌లు (లేదా సూపర్‌పొజిషన్ స్టేట్స్) అంటారు.
tr_tr: Klasik bir bilgisayar gibi bir kuantum bilgisayar bitler üzerinde çalışır. Ancak, klasik bitler sadece 0 ve 1 durumlarında bulunabilirken bir kuantum bit ya da kübit 0 ve 1 değerlerini ya da ikisinin lineer kombinasyonlarını temsil edebilir. Bu lineer kombinasyonlar süperpozisyonlar (ya da süperpozisyon durumları) olarak bilinir.
zh_tw: 就如經典的電腦，量子電腦在位元上操作。 然而，當經典位元只能在狀態 0 和 1中找到，但量子位元或qubit以代表 0 和 1 的值，或兩者的線性組合。 這些線性組合稱為畳加（或疊加狀態）。
