Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/qc_intro.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, zh_tw

source: Quantum computing in a nutshell
bn_bn: এক নজরে কোয়ান্টাম কম্পিউটিং
de_de: Quantum Computing auf den Punkt gebracht
el_gr: Κβαντικός υπολογισμός με λίγα λόγια
es_un: Computación cuántica en pocas palabras
fr_fr: Le calcul quantique en bref
id_id: Sekilas tentang komputasi kuantum
it_it: Computazione quantistica "in a nutshell"
ja_jp: 量子コンピューティングの概要
ko_kr: 핵심적인 양자 컴퓨팅의 내용
pl_pl: Obliczenia kwantowe w pigułce
pt_un: Computação quântica em poucas palavras
ru_ru: Коротко о квантовых вычислениях
sw_ke: Utarakilishi wa kwanta kwa ufupi
ta_in: குவாண்டம் கணினிகள் பற்றிய சுருக்கம்
te_in: క్లుప్తంగా క్వాంటం కంప్యూటింగ్
tr_tr: Özetle kuantum hesaplama
zh_tw: 簡短秒解量子計算

source: Quantum computing represents a new paradigm in computation that utilizes the fundamental principles of quantum mechanics to perform calculations. If you are reading this then you have undoubtedly heard that the promise of quantum computation lies in the possibility of efficiently performing a handful of tasks such as prime factorization, quantum simulation, and optimization; computations that at size are beyond the capabilities of even the largest of classical computers.
fr_fr: L'informatique quantique représente un nouveau paradigme dans le calcul qui utilise les principes fondamentaux de la mécanique quantique pour effectuer les calculs. Si vous lisez ceci, vous avez sans aucun doute entendu que la promesse du calcul quantique réside dans la possibilité de réaliser efficacement un certain nombre de de tâches telles que la factorisation en nombres premiers , la simulation quantique et certains problème d'optimisation; des calculs qui dont la taille dépasse les capacités des plus grands d'ordinateurs classiques.
id_id: Komputasi kuantum adalah paradigma baru dalam komputasi yang memanfaatkan prinsip-prinsip dasar mekanika kuantum untuk kalkulasi. Jika Anda membaca ini maka Anda tidak diragukan lagi pernah mendengar potensi komputasi kuantum yang dapat melakukan kalkulasi seperti faktorisasi prima, simulasi kuantum, dan optimasi secara efisien; komputasi yang ukurannya berada di luar kemampuan dari komputer klasik terbesar.
it_it: La computazione quantistica rappresenta un nuovo paradigma di computazione che sfrutta i fondamenti principali della meccanica quantistica per eseguire calcoli. Se stai leggendo questo articolo, hai senza dubbio sentito che la promessa del calcolo quantistico risiede nella possibilità di eseguire in modo efficiente una serie di compiti come la fattorizzazione in fattori primi, la simulazione quantistica e l'ottimizzazione dei calcoli; calcoli di dimensioni superiori alle capacità anche dei computer classici più performanti.
ja_jp: 量子計算は、量子力学の基本原理を利用して計算を行う、新しい計算のパラダイムです。これを読んでいる方は量子計算の将来性が、素因数分解、量子シミュレーション、最適化といった古典的なコンピュータの能力を超える一部のタスクを、効率的に実行できる可能性にあるということを聞いたことがあるでしょう。

source: The power of quantum computing rests on two cornerstones of quantum mechanics, namely :ref:`superposition <qc-intro-superposition>` and :ref:`entanglement <qc-intro-entanglement>` that highlight the wave- and particle-like aspects of quantum computation, respectively. Qiskit is an SDK for performing quantum computations that utilize these quantum mechanical principles using the language of :ref:`quantum circuits <qc-intro-circuits>`. Comprised of quantum gates, instructions, and classical control logic, quantum circuits allow for expressing complex algorithms and applications in a abstract manner that can be executed on a quantum computer. At its core, Qiskit is a quantum circuit construction, optimization, and execution engine. Additional algorithm and application layers leverage quantum circuits, often in concert with classical computing resources, to solve problems in optimization, quantum chemistry, physics, machine learning, and finance. In what follows, we give a very brief overview of quantum computing, and how Qiskit is used at each step. Interested readers are directed to additional in-depth materials for further insights.
fr_fr: La puissance de l'informatique quantique repose sur deux pierres angulaires de la mécanique quantique, à savoir la :ref:`superposition d'état <qc-intro-superposition>` et :ref:`l'intrication <qc-intro-entanglement>` qui mettent en évidence certains aspects de la dualité onde-particule. Qiskit est un environnement de développement (SDK) permettant de réaliser des calculs quantiques qui utilisent ces principes de mécanique quantique en utilisant le langage des :ref:`circuits quantiques <qc-intro-circuits>`. Ces circuits sont constitués de portes quantiques, d'instructions et de logique de contrôle classique, et ils permettent d'exprimer des algorithmes et des applications complexes pour être exécutés sur un ordinateur quantique. A la base, Qiskit est un moteur quantique de construction, d'optimisation et d'exécution. Les algorithmes et les applications qui sont construites par dessus tirent parti des circuits quantiques, souvent de concert avec les ressources informatiques classiques, pour résoudre des problèmes d'optimisation, de chimie quantique, de physique, d'apprentissage automatique et de finance. Dans ce qui suit, nous donnons un bref aperçu de l'informatique quantique et de la façon dont Qiskit est utilisé à chaque étape. Les lecteurs intéressés sont orientés vers des documents plus détaillés afin d'obtenir de plus amples renseignements.
id_id: Kekuatan komputasi kuantum bertumpu pada dua landasan mekanika kuantum, yaitu :ref:`superposisi <qc-intro-superposition>` dan :ref:`entanglement <qc-intro-entanglement>` yang masing-masing menyoroti aspek gelombang dan partikel dari komputasi kuantum. Qiskit adalah SDK untuk melakukan komputasi kuantum yang memanfaatkan prinsip mekanika kuantum ini dengan menggunakan bahasa dari :ref:`sirkuit kuantum <qc-intro-circuits>`. Terdiri dari gerbang kuantum, instruksi, dan logika kontrol klasik, sirkuit kuantum memungkinkan untuk mengekspresikan algoritma dan aplikasi kompleks dengan cara abstrak yang dapat dieksekusi pada komputer kuantum. Pada intinya, Qiskit adalah konstruksi sirkuit quantum, optimasi, dan mesin eksekusi. Algoritma tambahan dan lapisan aplikasi memanfaatkan sirkuit kuantum, sering kali dalam sinergi dengan komputasi klasik, untuk memecahkan masalah dalam optimasi, kimia kuantum, fisika, pembelajaran mesin, dan keuangan. Pada bagian berikutnya, kami memberikan pandangan ringkas tentang komputasi kuantum, dan bagaimana Qiskit digunakan pada tiap langkah. Pembaca yang tertarik diarahkan ke bahan tambahan yang lebih mendalam untuk wawasan lebih lanjut.
it_it: La potenza del calcolo quantistico si basa su due pietre miliari della meccanica quantistica, ovvero :ref:`superposition (principio di sovrapposizione) <qc-intro-superposition>` e :ref:`entanglement (correlazione quantistica) <qc-intro-entanglement>` che evidenziano rispettivamente gli aspetti ondulatori e particellari del calcolo quantistico. Quiskit è un SDK per eseguire calcoli quantistici che utilizzano questi principi della meccanica quantistica utilizzando il linguaggio dei :ref:`circuiti quantistici <qc-intro-circuits>`. Composti da quantum gates (porte quantistiche), istruzioni e logica di controllo classica, i circuiti quantistici consentono di esprimere algoritmi e applicazioni complessi in modo astratto che possono essere eseguiti su un computer quantistico. Il nucleo di Qiskit è un motore di costruzione, ottimizzazione ed esecuzione di circuiti quantistici. Molti algoritmi e livelli applicativi sfruttano i circuiti quantistici, spesso insieme alle risorse di calcolo classiche, per risolvere problemi di ottimizzazione, chimica quantistica, fisica, apprendimento automatico e finanza. In questa documentazione, forniremo una breve panoramica del calcolo quantistico e di come è possibile implementare Qiskit. I lettori interessati sono indirizzati a materiali aggiuntivi per ulteriori approfondimenti.
ja_jp: 量子計算の強みは、量子力学の二つの原理、すなわち :ref:`重ね合わせ <qc-intro-superposition>` と :ref:`エンタングルメント <qc-intro-entanglement>` に基づいています。 Qiskit は、 :ref:`量子回路 <qc-intro-circuits>` の枠組みでこうした量子力学の原理を活用して、量子計算を実行するための SDK です。量子ゲート、命令、古典的な制御ロジックから構成される量子回路は、複雑なアルゴリズムやアプリケーションを抽象的に表現し、量子コンピュータ上で実行することができます。その中核をなす Qiskit は、量子回路の構築、最適化、実行エンジンです。また、アルゴリズムやアプリケーションのレイヤーでは、古典的な計算リソースを連携させながら量子回路を利用することで、最適化、量子化学、物理学、機械学習、金融などの問題を解きます。

source: Superposition
id_id: Superposisi
it_it: Principio di sovrapposizione quantistica
ja_jp: 重ね合わせ

source: Like a classical computer, a quantum computer operates on bits. However, while classical bits can only be found in the states 0 and 1, a quantum bit, or qubit, can represent the values 0 and 1, or linear combinations of both. These linear combinations are known as **superpositions** (or superposition states) and allow for representing, and processing, exponentially many logical states simultaneously.
fr_fr: Comme un ordinateur classique, un ordinateur quantique fonctionne avec des bits. Cependant, alors que les bits classiques ne peuvent être trouvés que dans les états 0 et 1, un bit quantique, ou un qubit, peut représenter les valeurs 0 et 1, ou des combinaisons linéaires des deux. Ces combinaisons linéaires sont connues sous le nom de **superpositions** (ou états de superposition) et permettent de représenter et de traiter de façon exponentielle de nombreux états logiques simultanément.
id_id: Seperti komputer klasik, komputer kuantum beroperasi pada bit. Namun, bit klasik hanya dapat ditemukan dalam keadaan 0 dan 1, sedangkan sebuah bit kuantum, atau qubit, dapat mewakili nilai 0 dan 1, atau kombinasi linear dari keduanya. Kombinasi linear ini dikenal sebagai **superposisi** (atau keadaan superposisi) dan memungkinkan untuk mewakili, dan pemrosesan, sangat banyak keadaan logika sekaligus.
it_it: Come un computer classico, un computer quantistico opera sui bit. Tuttavia, mentre i bit classici possono essere trovati solo negli stati 0 e 1, un bit quantistico, o qubit, può rappresentare i valori 0 e 1 o combinazioni lineari di entrambi. Queste combinazioni lineari sono note come **sovrapposizioni** (o stati di sovrapposizione) e consentono di rappresentare ed elaborare in modo esponenziale molti stati logici simultaneamente.
ja_jp: 古典的なコンピューターと同様に、量子コンピューターもビット上で動作します。しかし、古典ビットは 0 と 1 の状態しか取りませんが、量子ビットは 0 と 1 の値およびそれらの線形結合を表現することができます。これらの線形結合は **重ね合わせ** (あるいは重ね合わせ状態) と呼ばれ、指数関数的に多くの論理状態を同時に表現し、処理することができます。

source: To see how this resource is utilized in quantum computation we first turn to a classical analog: noise cancellation. Noise cancellation, as done in noise cancelling headphones for example, is performed by employing the principle of superposition along with interference to reduce the amplitude of unwanted noise by generating a tone of approximately the same frequency and amplitude, but out of phase by a value of :math:`\pi` (or any other odd integer of :math:`\pi`).
fr_fr: Pour voir comment cette ressource est utilisée dans le calcul quantique, nous nous tournons d'abord vers un analogue classique: l'annulation du bruit. L'annulation du bruit, comme on le trouve dans les écouteurs annulant le bruit ambiant par exemple, est réalisée en employant le principe de superposition avec l'interférence pour réduire l'amplitude du bruit non désiré en générant un ton de même fréquence et amplitude, mais déphasé d'une valeur de :math:`\pi` (ou tout autre entier impair de :math:`\pi`).
id_id: Untuk melihat bagaimana sumber daya ini digunakan dalam komputasi kuantum kita pertama kali beralih ke analog klasik: pembatalan derau. Pembatalan derau, seperti yang dilakukan dalam headphone berfitur pembatalan kebisingan misalnya, dilakukan dengan menggunakan prinsip superposisi dan interferensi untuk mengurangi amplitudo derau yang tidak diinginkan dengan menghasilkan nada berfrekuensi dan amplitudo yang hampir sama, tetapi berselisih fase dengan nilai :math:`\pi` (atau kelipatan bilangan bulat ganjil lainnya dari :math:`\pi`).
it_it: Per vedere come questa risorsa viene utilizzata nel calcolo quantistico, ci rivolgiamo prima ad un classico esempio: la cancellazione del rumore. La cancellazione del rumore, come avviene ad esempio nelle cuffie (in modo attivo o passivo), viene eseguita impiegando il principio di sovrapposizione insieme all'interferenza per ridurre l'ampiezza del rumore indesiderato generando un tono approssimativamente della stessa frequenza e ampiezza, ma fuori fase di un valore di :math:`\pi` (o qualsiasi altro numero intero dispari di :math:`\pi`).
ja_jp: このリソースが量子計算でどのように利用されているかをみるために、まず古典的なアナログである、ノイズキャンセリングに目を向けます。ノイズキャンセリングは、例えばノイズキャンセリング・ヘッドフォンで行われているように、 :math:`\pi` (あるいは :math:`\pi` の奇数倍) だけ位相のずれた、ほぼ同じ周波数と振幅の音波を生成して、重ね合わせの原理と干渉を活用することで、不要なノイズの振幅を小さくしています。

source: Approximate cancellation of a noise signal by a tone of nearly equal amplitude and offset by a phase of :math:`\sim \pi`.
bn_bn: আনুমানিকভাবে ত্রুটি সংকেত দূরীকরণ করা হয় প্রায় সমান বিস্তার এবং :math:`\sim \pi` দশাপার্থক্যযুক্ত একটি সুর বা শব্দের সাহায্যে।
de_de: Ungefähre Rauschunterdrückung durch einen Ton von nahezu gleicher Amplitude und einer Phasenverschiebung von :math:` \sim \pi `.
el_gr: Κατά προσέγγιση ακύρωση ενός σήματος θορύβου με έναν τόνο σχεδόν ίσου πλάτους και μετατόπισης από μια φάση :math:` \sim \pi `.
es_un: Cancelación aproximada de una señal de ruido por un tono de amplitud casi igual y compensado por una fase de :math:`\sim \pi`.
fr_fr: Annulation approximative d'un signal sonore par un ton d'amplitude presque égale et décalé par une phase de :math:`\sim \pi`.
id_id: Aproksimasi pembatalan sinyal derau oleh nada dengan amplitudo yang hampir sama dan offset fase sebesar :math:`\sim\pi`.
it_it: Cancellazione approssimativa di un segnale di rumore da un tono di ampiezza quasi uguale e compensato da una fase di :math:`\sim \pi`.
ja_jp: およそ :math:`\pi` だけ位相のずれた、振幅のほぼ等しい音波による、ノイズ信号の近似的な打ち消し合い
ko_kr: 거의 동일한 진폭의 톤에 의한 잡음 신호의 대략적인 소거 및 :math:`\sim \pi` 의 위상에 의한 오프셋.
pl_pl: Przybliżone wygłuszanie sygnału szumu przez ton o niemal równej amplitudzie i przesunięty w fazie o :math:` \sim \pi `.
pt_un: Cancelamento aproximado de um sinal de ruído por um tom de amplitude quase igual e contrabalanceado por uma fase de :math:`\sim \pi`.
ru_ru: Почти полное подавление шумового сигнала другим звуковым сигналом почти той же амплитуды и сдвигом по фазе равным :math:`\sim \pi`.
sw_ke: Ukatishaji kwa takriban wa signali ya kelele kwa toni yenye nusra kimo cha wimbi sawa na usawazishaji kupitia awamu ya :math:`\sim \pi`.
ta_in: ஒரு noise சிக்னல் தோராயமான ரத்து கிட்டத்தட்ட சமமான வீச்சு மற்றும் ஒரு கட்டத்தால் ஈடுசெய்யப்படுகிறது :math:`\sim \pi`.
te_in: దాదాపు సమాన వ్యాప్తి యొక్క టోన్ ద్వారా నాయిస్ సిగ్నల్ యొక్క ఉజ్జాయింపు రద్దు మరియు :math:`\sim \pi` దశ ద్వారా ఆఫ్‌సెట్ చేయబడింది.
tr_tr: Bir gürültü sinyalinin yaklaşık olarak eşit genlikte bir tonla iptal edilmesi ve :math:`\sim \pi fazıyla dengelenmesi.
zh_tw: 通過近似相等振幅的音調，以偏移相位值:math:`\sim \pi`來消除噪聲訊號的近似性。

source: As shown above, when the phase difference is close to an odd multiple of :math:`\pi`, the superposition of the two waves results in interference, and an output that is significantly reduced compared to the original. The result is the signal of interest unincumbered by noise. Although this processing is done by digital circuits, the amplitude and phase are continuous variables that can never be matched perfectly, resulting in incomplete correction.
fr_fr: Comme indiqué ci-dessus, lorsque la différence de phase est proche d'un multiple impair de :math:`\pi`, la superposition des deux ondes entraîne une interférence, et une sortie qui est significativement réduite par rapport à l'original. Le résultat est le signal d'intérêt non encombré par le bruit. Bien que ce traitement soit effectué par des circuits numériques, l'amplitude et la phase sont des variables continues qui ne peuvent jamais être parfaitement appariés, ce qui entraîne une correction incomplète.
id_id: Seperti di atas, ketika perbedaan fase mendekati kelipatan ganjil dari :math:`\pi`, posisi superposisi dari dua gelombang tersebut menghasilkan interferensi, dan output yang secara signifikan berkurang dibandingkan dengan yang asli. Hasilnya adalah sinyal yang diinginkan tanpa derau. Meskipun proses ini dilakukan oleh sirkuit digital, amplitudo dan fase adalah variabel kontinu yang tidak pernah dapat dicocokkan dengan sempurna, sehingga menghasilkan koreksi yang tidak lengkap.
it_it: Come mostrato in precedenza, quando la differenza di fase è vicina a un multiplo dispari di :math:`\pi`, la sovrapposizione delle due onde provoca un'interferenza e un'uscita notevolmente ridotta rispetto all'originale. Il risultato è il segnale di interesse 'liberato' dal rumore. Sebbene questa elaborazione venga eseguita da circuiti digitali, l'ampiezza e la fase sono variabili continue che non possono mai essere abbinate perfettamente, con conseguente correzione incompleta.
ja_jp: 上記のように、位相差が :math:`\pi` の奇数倍に近い場合、二つの波の重ね合わせは干渉をもたらし、元の波と比べて振幅が大幅に減少した出力が得られます。その結果、ノイズの影響を受けない信号が得られます。この処理はデジタル回路で行われますが、振幅と思想は連続変数であるため、完全に一致することはなく、不完全な補正となってしまいます。
