Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/qc_intro.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, zh_tw

source: `Field guide to quantum computing <https://quantum-computing.ibm.com/docs/iqx/guide/>`_ : A gentle physics-based introduction written by some of the founders of quantum computation that makes use of the interactive circuit composer.
bn_bn: `কোয়ান্টাম গণনার ব্যবহার নির্দেশিকা <https://quantum-computing.ibm.com/docs/iqx/guide/>`_ : কোয়ান্টাম গণনার কয়েকজন প্রতিষ্ঠাতার দ্বারা লিখিত একটি সহজ পদার্থবিজ্ঞান ভিত্তিক ভূমিকা যা পারস্পরিক ক্রিয়াশীল বর্তনী (ইন্টারেক্টিভ সার্কিট) কম্পোজারকে ব্যবহার করে।
de_de: " Leitfaden Quantencomputing <https://quantum-computing.ibm.com/docs/iqx/guide/>` _: Eine anfängerfreundliche, physik-basierte Einführung, die von einigen Gründern des Quantencomputings geschrieben wurde und den interaktiven Circuit-Composer nutzt.
el_gr: "Οδηγός πεδίου για κβαντικό υπολογισμό <https://quantum-computing.ibm.com/docs/iqx/guide/>" _: Μια ήπια εισαγωγή στη φυσική, η οποία γράφτηκε από μερικούς από τους ιδρυτές της κβαντικής υπολογιστικής που κάνει χρήση του διαδραστικού συνθέτη κυκλώματος.
es_un: `Guía de campo para la computación cuántica <https://quantum-computing.ibm.com/docs/iqx/guide/>`_ : Una introducción gentil basada en la física escrita por algunos de los fundadores de la computación cuántica que hace uso del compositor interactivo de circuitos.
fr_fr: `Field guide to quantum computing <https://quantum-computing.ibm.com/docs/iqx/guide/>`_: une introduction progressive et basée sur la physique quantique écrite par certains des fondateurs du calcul quantique et qui utilise le composeur interactif de circuits quantiques.
it_it: `Field guide to quantum computing <https://quantum-computing.ibm.com/docs/iqx/guide/>`_ : Una semplice introduzione basata sulla fisica scritta da alcuni dei fondatori della computazione quantistica che permette di utilizzare lo strumento interattivo di creazione dei circuiti.
ja_jp: `Field guide to quantum computing <https://quantum-computing.ibm.com/docs/iqx/guide/>`_ : 量子計算の創始者たちが、対話型の回路コンポーザーを利用して書いた、物理学に基づく易しい入門
ko_kr: `Field guide to quantum computing <https://quantum-computing.ibm.com/docs/iqx/guide/>`_ : 대화형 회로 컴포저를 사용하는 양자 계산의 창시자 중 일부가 작성한 물리학 기반 소개이다.
pl_pl: `Przewodnik po obliczeniach kwantowych <https://quantum-computing.ibm.com/docs/iqx/guide/>`_ : Proste wprowadzenie od strony fizycznej, stworzone przez twórców obliczeń kwantowych, wykorzystujące interaktywnego kompozytora obwodów (circuit composer).
pt_un: `Field guide to quantum computing <https://quantum-computing.ibm.com/docs/iqx/guide/>`_ : Uma introdução leve baseada em física escrita por alguns dos fundadores da computação quântica que faz uso do compositor de circuitos interativo.
ru_ru: `Cправочник по квантовым вычислениям <https://quantum-computing.ibm.com/docs/iqx/guide/>`_ : Плавное, основанное на физике введение, написанное одними из основателей квантовых вычислений, в котором используется интерактивный компоновщик схем.
sw_ke: `Mwongozo wa tarakilishi za kwanta <https://quantum-computing.ibm.com/docs/iqx/guide/>`_ : Utangulizi nyepesi kulingana na fizikia ulioandikwa na waanzilishi wa tarakilishi za kwanta ambao unatumia programu ya utunzi wa saketi.
ta_in: `குவாண்டம் கணினிகளுக்கான கள வழிகாட்டி <https://quantum-computing.ibm.com/docs/iqx/guide/>`_ : குவாண்டம் கணக்கீட்டின் சில நிறுவனர்களால் எழுதப்பட்ட ஒரு மென்மையான இயற்பியல் அடிப்படையிலான அறிமுகம், இது ஊடாடும் சர்க்யூட்டை உருவாக்கப் பயன்படுத்துகிறது.
te_in: `క్వాంటం కంప్యూటింగ్‌కు ఫీల్డ్ గైడ్ <https://quantum-computing.ibm.com/docs/iqx/guide/>`_ : ఇంటరాక్టివ్‌ సర్క్యూట్ కంపోజర్ని ఉపయోగించుకునే క్వాంటం కంప్యూటర్ ను సృష్టించిన వ్యవస్థాపకులు కొందరు వ్రాసిన సున్నితమైన భౌతిక-ఆధారిత పరిచయం .
tr_tr: `Field guide to quantum computing <https://quantum-computing.ibm.com/docs/iqx/guide/>`_ : Etkileşimli devre oluşturucuyu kullanan kuantum hesaplamanın bazı kurucuları tarafından yazılmış, fizik temelli hafif bir giriş.

source: `Qiskit textbook <https://qiskit.org/textbook>`_ : A university quantum algorithms/computation course supplement based on Qiskit.
bn_bn: `Qiskit টেক্সটবুক <https://qiskit.org/textbook>`_ : একটি বিশ্ববিদ্যালয়ের Qiskit ভিত্তিক কোয়ান্টাম অ্যালগরিদম/গণনার পাঠ্যক্রমের সহায়িকা।
el_gr: " Qiskit textbook <https://qiskit.org/textbook>` _: Ένα συμπληρωματικό πανεπιστημιακό μάθημα κβαντικών αλγορίθμων/υπολογισμών βασίζεται στο Qiskit.
es_un: `Libro de texto de Qiskit <https://qiskit.org/textbook>`_ : Un suplemento de curso universitario de algoritmos/computación cuántica basado en Qiskit.
fr_fr: `Qiskit textbook <https://qiskit.org/textbook>`_ : Un supplément de cours universitaire de pour les algorithmes et calculs quantiques basé sur Qiskit.
id_id: `Buku teks Qiskit <https://qiskit.org/textbook>`_ : Sebuah suplemen kursus algoritma kuantum/komputasi universitas berbasis Qiskit.
ja_jp: `Qiskit textbook <https://qiskit.org/textbook>`_ : Qiskit に基づいた大学における量子アルゴリズム・計算コースの補助教材
ko_kr: `Qiskit 교과서 <https://qiskit.org/textbook>`_ : Qiskit 을 기반으로 만들어진 대학 양자 알고리즘/계산 강좌의 보충 자료.
pl_pl: `Podręcznik Qiskit <https://qiskit.org/textbook>`_ : Dodatek do kursu o algorytmach/obliczeniach kwantowych dla studentów uczelni wyższych, oparty na pakiecie Qiskit.
pt_un: `Qiskit textbook <https://qiskit.org/textbook>`_ : Um complemento de cursos universitários de algoritmos quânticos e computação quântica baseado no Qiskit.
ru_ru: `Учебник по Qiskit <https://qiskit.org/textbook>`_ : Приложение к университетскому курсу по квантовым алгоритмам/вычислениям, основанное на Qiskit.
sw_ke: `Kitabu cha Qiskit <https://qiskit.org/textbook>`_ : Kozi ya ziada ya kiwango cha chuo kikuu kuhusu alogaridhimu/hesabu za kwanta kulingana na Qiskit.
ta_in: `Qiskit பாடநூல் <https://qiskit.org/textbook>`_ : Qiskit-டை அடிப்படையாகக் கொண்ட ஒரு பல்கலைக்கழக குவாண்டம் வழிமுறைகள் / கணக்கீட்டு பாடநெறி.
te_in: `Qiskit పాఠ్యపుస్తకం <https://qiskit.org/textbook>`_ : Qiskit ఆధారంగా యూనివర్సిటీ క్వాంటం అల్గారిథమ్స్/కంప్యూటేషన్ కోర్సు సప్లిమెంట్.
tr_tr: `Qiskit textbook <https://qiskit.org/textbook>`_ : Qiskit'e dayalı bir üniversite kuantum algoritmaları/hesaplama kursu eki.

source: Quantum computing represents a new paradigm in computation that utilizes the fundamental principles of quantum mechanics to perform calculations. If you are reading this then you have undoubtedly heard that the promise of quantum computation lies in the possibility of efficiently performing a handful of tasks such as prime factorization, quantum simulation, search, optimization, and algebraic programs such as machine learning; computations that at size are beyond the capabilities of even the largest of classical computers.
bn_bn: কোয়ান্টাম কম্পিউটিং আধুনিক প্রযুক্তিতে নতুন দৃষ্টান্ত উপস্থাপন করেছে যা কোয়ান্টাম বলবিদ্যার মৌলিক নীতিগুলি ব্যবহার করে। আপনি যেহেতু এই রচনাটি পড়ছেন, আপনি অবশ্যই শুনেছেন কোয়ান্টাম কম্পিউটেশনের কিছু প্রতিশ্রুতিময় কাজ সম্পর্কে যেমন মৌলিক উৎপাদক গণনা, কোয়ান্টাম সিমুলেশন, অনুসন্ধান, অপটিমাইজেশন এবং বীজগাণিতিক প্রোগ্রাম যেমন মেশিন লার্নিং ইত্যাদি বিশাল কম্পিউটেশন, যা এমনকি বৃহত্তম ধ্রুপদী (ক্লাসিক্যাল) কম্পিউটারের ক্ষমতার বাইরে।
de_de: Quantencomputing is ein neuer Ansatz in der Informatik, der die Grundprinzipien der Quantenmechanik nutzt, um Berechnungen durchzuführen. Berechnungen mit Quantencomputern versprechen dabei einige Probleme effizient lösen zu können. Dies sind zum Beispiel Primfaktorzerlegung, Quantensimulation, Optimierung von Such-Abfragen und das maschinelle Lernen; Quantencomputing hat dabei die Perspektive Berechnungen durchzuführen, die sogar die Fähingkeiten der größten Supercomputer übersteigen.
el_gr: Η κβαντική πληροφορική αντιπροσωπεύει ένα νέο παράδειγμα στον υπολογισμό που χρησιμοποιεί τις θεμελιώδεις αρχές της κβαντικής μηχανικής για την εκτέλεση υπολογισμών. Αν διαβάζετε αυτό τότε έχετε αναμφίβολα ακούσει ότι η υπόσχεση του κβαντικού υπολογισμού έγκειται στην πιθανότητα να εκτελέσει αποτελεσματικά μια σειρά εργασιών, όπως η παραγοντοποίηση πρώτων αριθμών, κβαντική προσομοίωση, την αναζήτηση, τη βελτιστοποίηση, και αλγεβρικά προγράμματα, όπως η μηχανική εκμάθηση, υπολογισμοί που σε μέγεθος είναι πέρα από τις δυνατότητες ακόμη και των μεγαλύτερων κλασικών υπολογιστών.
es_un: La computación cuántica representa un nuevo paradigma en computación que utiliza los principios fundamentales de la mecánica cuántica para realizar cálculos. Si estás leyendo esto, sin duda habrás escuchado que la promesa de la computación cuántica radica en la posibilidad de realizar de manera eficiente un puñado de tareas como la factorización en números primos, simulación cuántica, búsqueda, optimización y programas algebraicos como el machine learning; cálculos que en tamaño están más allá de las capacidades incluso de las computadoras clásicas más grandes.
ko_kr: 양자 컴퓨팅은 양자역학의 기본 원리를 활용하는 계산의 새로운 패러다임을 나타낸다. 이걸 읽고 있다면, 양자 컴퓨팅의 전망은 규모가 커지면 가장 성능이 좋은 고전 컴퓨터로도 수행할 수 없는 계산들을 효율적으로 수행할 수 있는가의 여부에 달려 있다는 것을 알 것이다. 이러한 작업들에는 소인수 분해, 양자 시뮬레이션, 검색, 최적화, 그리고 기계 학습과 같은 대수 프로그램이 있다.
pl_pl: Obliczenia kwantowe prezentują nowy paradygmat w obliczeniach, który wykorzystuje fundamentalne zasady mechaniki kwantowej do wykonywania obliczeń. Jeśli to czytasz, to z pewnością słyszałeś, że obliczenia kwantowe mogą potencjalnie wpłynąć na wydajność wykonywania zadań, takich jak rozkład na czynniki liczb pierwszych, symulacje kwantowe, wyszukiwanie, optymalizacja i programy algebraiczne, np. uczenie maszynowe; obliczenia, które ze względu na swój rozmiar są poza możliwościami nawet największych klasycznych komputerów.
pt_un: A computação quântica representa um novo paradigma em computação que utiliza os princípios fundamentais da mecânica quântica para realizar cálculos. Se você está lendo isso, então você sem dúvida já ouviu que a promessa da computação quântica reside na possibilidade de realizar de forma eficiente um punhado de tarefas como a fatoração de primos, simulação quântica, busca, otimização e programas algébricos como aprendizado de máquina; computações cujos tamanhos estão além das capacidades até mesmo dos maiores dos computadores clássicos.
ru_ru: Квантовые вычисления представляют собой новый принцип вычислений, который использует фундаментальные принципы квантовой механики для проведения расчетов. Если вы читаете этот текст, значит, вы, несомненно слышали, что преимущество квантовых вычислений заключается в возможности эффективно решить ряд задач, таких как факторизация целых чисел, квантовое моделирование, поиск, оптимизация, и улучшить производительность алгебраических программ, таких как машинное обучение; задач, которые требуют большего вычислительного объема, доступного на самых мощных современных классических компьютерах.
sw_ke: Utarakilishi wa kwanta unawakilisha namna mpya ya utarakilishi unaotumia kanuni za kimsingi za makanika ya kwanta kufanya hisabati. Iwapo unasoma haya, bila shaka umesikia ahadi kuwa tarakilishi za kwanta zinaweza kufanya kwa ufanisi baadhi ya kazi kama vile uzalishaji wa namba tasa, uigaji wa kwanta, utaftaji, uboreshaji na programu za kialjebra kama vile ujifunzaji wa mashine; kazi ambazo zinazidi uwezo wa tarakilishi kubwa za kiklasiki.
ta_in: குவாண்டம் கம்ப்யூட்டிங் கணக்கீட்டில் ஒரு புதிய முன்னுதாரணத்தைக் குறிக்கிறது. இது கணக்கீடுகளைச் செய்ய குவாண்டம் இயக்கவியலின் அடிப்படைக் கொள்கைகளைப் பயன்படுத்துகிறது. நீங்கள் இதைப் படிக்கிறீர்கள் என்றால், குவாண்டம் கணக்கீட்டின் வாக்குறுதி பிரதான காரணிமயமாக்கல், குவாண்டம் உருவகப்படுத்துதல், தேடல், தேர்வுமுறை மற்றும் இயந்திர கற்றல் போன்ற இயற்கணித திட்டங்கள் போன்ற ஒரு சில பணிகளை திறம்படச் செய்வதற்கான சாத்தியத்தில் உள்ளீர்கள் என்பதில் சந்தேகமில்லை. இது பெரிய அளவிலான கிளாசிக்கல் கணினிகளின் திறன்களுக்கு அப்பாற்பட்ட கணக்கீடுகள்.
te_in: క్వాంటం కంప్యూటింగ్ అనేది గణనలో కొత్త నమూనాను సూచిస్తుంది, ఇది గణనలను నిర్వహించడానికి క్వాంటం మెకానిక్స్ యొక్క ప్రాథమిక సూత్రాలను ఉపయోగిస్తుంది. మీరు దీన్ని చదువుతున్నట్లయితే, క్వాంటం కంప్యూటేషన్ యొక్క వాగ్దానం ప్రైమ్ ఫ్యాక్టరైజేషన్, క్వాంటం సిమ్యులేషన్, సెర్చ్, ఆప్టిమైజేషన్ మరియు మెషీన్ లెర్నింగ్ వంటి బీజగణిత ప్రోగ్రామ్‌లు వంటి కొన్ని పనులను సమర్థవంతంగా నిర్వహించే అవకాశం ఉందని మీరు నిస్సందేహంగా విన్నారు; అతిపెద్ద శాస్త్రీయ కంప్యూటర్‌ల సామర్థ్యాలకు మించిన పరిమాణంలో ఉన్న గణనలు.
tr_tr: Kuantum hesaplama, hesaplama işlemlerini gerçekleştirmek için kuantum mekaniğin temel prensiplerini kullanan hesaplamada yeni bir paradigmayı temsil eder. Eğer bunu okuyorsanız, şüphesiz çarpanlara ayırma, kuantum simülasyon, arama, optimizasyon ve makine öğrenmesi gibi cebirsel programlar; en büyük klasik bilgisayarların bile kapasitelerinin ötesinde hesaplamalar, gibi bir takım görevleri verimli bir şekilde yürütme ihtimalinin altında yatan kuantum hesaplama sözünü duymuşsunuzdur.
zh_tw: 量子計算在計算中代表一個新的範式，它利用量子力學的基本原理來進行計算。如果你讀到這一點，你無疑已經聽說了量子計算的前途在於能夠高效地執行一些任務，諸如質因數分解、量子模擬、搜尋、最佳化以及代數程式如機器學習；計算在規模上甚至超越了最大規模的經典計算機的能力。
