Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/qc_intro.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, pl_pl, pt_un, ru_ru, sw_ke, ta_in, te_in, tr_tr, zh_tw

source: A general computation on a quantum computer proceeds in very much the same way as noise cancellation. To begin, one prepares a superposition of all possible computation states. This is then used as an input to a :ref:`quantum circuit <qc-intro-circuits>` that selectively interferes the components of the superposition according to a prescribed algorithm. What remains after cancelling the relative amplitudes and phases of the input state is the solution to the computation performed by the quantum circuit.
bn_bn: কোয়ান্টাম কম্পিউটারে একটি সাধারণ গণনার পদ্ধতি অনেকটা দূষণ বা ত্রুটি দূরীকরণ পদ্ধতির মত। প্রথমে সমস্ত সম্ভাব্য গণনার মান বা অবস্থার উপরিপাতন সৃষ্টি করা হয়। তারপর এটিকে ইনপুট হিসেবে :ref:`কোয়ান্টাম বর্তনীতে <qc-intro-circuits>` পাঠানো হয় যেটি নির্ধারিত ধারাক্রম (অ্যালগরিদম) মেনে নির্বাচিত উপরিপাতন উপাদানের সাথে ব্যতিচার (ইন্টারফিয়ারেন্স) সম্পন্ন করে। আপেক্ষিক বিস্তার এবং দশা বাতিল করবার পর ইনপুট মান বা অবস্থায় যা বাকি থাকে তা হল কোয়ান্টাম বর্তনীর (সার্কিট) গণনার ফলাফল।
de_de: Eine allgemeine Berechnung auf einem Quantencomputer erfolgt in sehr ähnlicher Weise wie die Rauschunterdrückung. Zunächst werden alle möglichen Berechnungszustände in Superposition gebracht. Diese wird dann als Eingabe für eine :ref:` Quantenschaltung <qc-intro-circuits>` verwendet, die die Komponenten der Superposition nach einem vorgegebenen Algorithmus selektiv zur Interferenz bringt. Was nach der Aufhebung der relativen Amplituden und Phasen des Eingangszustandes bleibt, ist die Lösung der von der Quantenschaltung durchgeführten Berechnung.
el_gr: Ένας γενικός υπολογισμός σε έναν κβαντικό υπολογιστή προχωρά με τον ίδιο τρόπο όπως η ακύρωση του θορύβου. Κατ ' αρχάς, προετοιμάζει μια υπερθέση όλων των πιθανών υπολογισμών. Αυτό τότε χρησιμοποιείται ως είσοδος σε ένα :ref:` κβαντικό κύκλωμα <qc-intro-circuits>` που παρεμβαίνει επιλεκτικά στα συστατικά της υπερθέσης σύμφωνα με έναν καθορισμένο αλγόριθμο. Αυτό που παραμένει μετά την ακύρωση των σχετικών πλατών και φάσεων της κατάστασης εισόδου είναι η λύση για τον υπολογισμό που εκτελείται από το κβαντικό κύκλωμα.
es_un: Un cálculo general en una computadora cuántica procede de manera muy similar a la cancelación de ruido. Para empezar, se prepara una superposición de todos los posibles estados de cálculo. Esto luego se usa como entrada a un :ref:`circuito cuántico <qc-intro-circuits>` que interfiere selectivamente los componentes de la superposición de acuerdo con un algoritmo prescrito. Lo que queda después de cancelar las amplitudes y fases relativas del estado de entrada es la solución al cálculo realizado por el circuito cuántico.
fr_fr: Un calcul général sur un ordinateur quantique procède de la même manière que l'annulation du bruit. Pour commencer, on prépare une superposition de tous les états de calcul possibles. Ceci est ensuite utilisé comme entrée dans un :ref:`circuit quantique <qc-intro-circuits>` qui interfère sélectivement les composantes de la superposition selon un algorithme prescrit. Ce qui reste après l'annulation des amplitudes et des phases relatives de l'état d'entrée est la solution au calcul effectué par le circuit quantique.
id_id: Perhitungan umum pada komputer kuantum berlangsung sama seperti pembatalan kebisingan. Untuk memulai, seseorang menyiapkan superposisi dari semua keadaan komputasi yang mungkin. Hal ini kemudian digunakan sebagai masukan ke sirkuit kuantum :ref:`<qc-intro-circuits>` yang secara selektif membuat interfensi komponen superposisi menurut resep algoritma. Apa yang tersisa setelah pembatalan amplitudo relatif dan fase-fase dari state input adalah solusi komputasi yang dihasilkan oleh sirkuit kuantum.
it_it: In generale un calcolo su un computer quantistico procede in modo molto simile alla cancellazione del rumore. Per iniziare, si prepara una sovrapposizione di tutti i possibili stati di calcolo. Questo viene quindi utilizzato come input per un :ref:`quantum circuit <qc-intro-circuits>` che interferisce selettivamente sui componenti della sovrapposizione secondo un algoritmo prescritto. Ciò che rimane dopo aver annullato le ampiezze e le fasi relative dello stato di ingresso è la soluzione al calcolo eseguito dal circuito quantistico.
ja_jp: 量子コンピューター上での一般的な計算は、ノイズキャンセリングとよく似ています。まず、すべての計算状態の重ね合わせを準備します。これは、所定のアルゴリズムにしたがって、重ね合わせの成分を選択的に干渉させる :ref:`量子回路 <qc-intro-circuits>` への入力として使用されます。入力状態の相対的な振幅と位相を打ち消した後に残るのは、量子回路によって実行される計算の解となっています。
ko_kr: 양자 컴퓨터의 일반적인 계산은 잡음 제거와 거의 같은 방식으로 진행된다. 우선, 모든 가능한 계산 상태들의 중첩을 준비한다. 그러면 이는 규정된 알고리즘에 따라 초위치의 구성요소를 선택적으로 방해하는 :ref:`quantum circuit <qc-intro-circuits>` 의 입력으로 사용된다. 입력 상태의 상대 진폭 및 위상을 취소한 후에 남는 것은 양자 회로에 의해 수행되는 계산에 대한 해법이다.
pl_pl: Obliczenia na komputerze kwantowym opierają się na tych samych zasadach co anulowanie hałasu. Na początek przygotowuje się superpozycję wszystkich możliwych stanów obliczeniowych. Są one następnie wykorzystywane jako dane wejściowe do :ref:`obwodu kwantowego <qc-intro-circuits>`, który wybiórczo oddziałuje na elementy superpozycji zgodnie z określonym algorytmem. Po anulowaniu amplitud względnych i faz stanu wejściowego pozostaje rozwiązanie dla obliczeń wykonanych przez obwód kwantowy.
pt_un: Um cálculo geral em um computador quântico ocorre de maneira muito semelhante ao cancelamento de ruído. De início, prepara-se uma superposição de todos os estados computacionais possíveis. Isso é então usado como uma entrada para um :ref:`circuito quântico <qc-intro-circuits>` que interfere seletivamente nos componentes da superposição de acordo com um algoritmo prescrito. O que resta após o cancelamento das amplitudes e fases relativas do estado de entrada é a solução para o cálculo realizado pelo circuito quântico.
ru_ru: В целом вычисления на квантовом компьютере происходят примерно так же, как и подавление шума. Сначала создается суперпозиция всех возможных вычислительных состояний. Затем она подается на вход :ref:`квантовой цепи <qc-intro-circuits>`, при прохождении которой компоненты состояния суперпозиции выборочно интерферируют в соответствии с заданным алгоритмом. То, что остается после отбрасывания относительных амплитуд и фаз входного состояния, является решением вычислений, выполняемых квантовой цепью.
sw_ke: Utarakilishi wa jumla kwenye tarakilishi ya kwanta huendelezwa kwa njia sawa na ukatishaji kelele. Kuanza, mtu huandaa superposition ya hali zote za utarakilishi zinazowezekana. Kisha zinatumiwa kama ingizo kwenye :ref:`saketi ya kwanta <qc-intro-circuits>` ambayo hufanya mwingiliano wa vipengele vya superposition kwa uteuzi kulingana na alogaridhimu inayotekelezwa. Kinachobaki baada ya kukatisha kimo cha wimbi na awamu za hali ingizo ni suluhisho la computation inayofanywa na saketi ya kwanta.
ta_in: ஒரு குவாண்டக் கணினியில் ஒரு பொதுவான கணக்கீடு சத்தம் ரத்துசெய்யப்படுவதைப் போலவே தொடர்கிறது. ஒரு வேலை தொடங்குவதற்காக, ஒருவர் அணைத்து கணக்கீட்டு நிலைகளுக்கும் ஒரு சூப்பர்பொசிஷனை தயாரிக்கிறார். இது பின்னர் ஒரு உள்ளீடாக :ref:`quantum circuit <qc-intro-circuits>` ஒரு குறிப்பிட்ட வழிமுறையின்படி சூப்பர்பொசிஷனின் கூறுகளைத் தேர்ந்தெடுக்கப் பயன்படுத்தப்படுகிறது. உள்ளீட்டு நிலையின் ஒப்பீட்டு வீச்சுகள் மற்றும் கட்டங்களை ரத்துசெய்த பிறகு எஞ்சியிருப்பது குவாண்டம் சுற்று மூலம் நிகழ்த்தப்படும் கணக்கீட்டிற்கான தீர்வாகும்.
te_in: క్వాంటం కంప్యూటర్‌లో సాధారణ గణన నాయిస్ క్యాన్సిలేషన్ మాదిరిగానే కొనసాగుతుంది. మొదట, సాధ్యమయ్యే అన్ని గణన స్థితుల యొక్క సూపర్‌పొజిషన్‌ను సిద్ధం చేస్తారు. ఇది నిర్ణీత అల్గోరిథం ప్రకారం సూపర్‌పొజిషన్‌లోని భాగాలను ఎంపిక చేసి జోక్యం చేసుకునే :ref:`quantum circuit <qc-intro-circuits>`కి ఇన్‌పుట్‌గా ఉపయోగించబడుతుంది. ఇన్‌పుట్ స్టేట్ యొక్క సాపేక్ష ఏంప్లిట్యూడ్స్ మరియు ఫేజెస్ ని రద్దు చేసిన తర్వాత మిగిలి ఉన్నది క్వాంటం సర్క్యూట్ ద్వారా చేసే గణనకు పరిష్కారం.
tr_tr: Bir kuantum bilgisayar üzerinde genel bir hesaplama, gürültü engelleme ile hemen hemen aynı şekilde elde edilir. Başlamak için, bütün olası hesaplama durumlarının süperpozisyonu hazırlanır. Bu daha sonra, öngörülen algoritmaya göre süperpozisyonun bileşenlerine seçici olarak müdahele eden bir :ref:`quantum circuit <qc-intro-circuits>` için girdi olarak kullanılır. Girdi durumunun göreli genlik ve fazlarını engelledikten sonra geriye kalan kuantum devresi tarafından gerçekleştirilen hesaplamanın çözümüdür.
zh_tw: 在量子計算機上的一般計算方式與噪聲消除的方式非常相同。 一開始，一個人準備疊加所有可能的計算狀態。然後，作為輸入到 :ref:`量子電路 <qc-intro-circuits>` 的輸入，根據規定的演算法選擇性地干涉疊加的組成部分。在抵消了輸入狀態的相對振幅和相位之後的所剩下的是量子電路所執行計算的解。

source: Quantum computation as an interference generation process.
bn_bn: ব্যতিচার (ইন্টারফিয়ারেন্স) উৎপাদন প্রক্রিয়া (প্রসেস) হিসেবে কোয়ান্টাম কম্পিউটেশন।
de_de: Quantenberechnung als ein Porzess zur Erstellung von Interferenzen.
el_gr: Κβαντικός υπολογισμός ως διαδικασία παραγωγής παρεμβολών.
es_un: Computación cuántica como proceso de generación de interferencia.
fr_fr: Calcul quantique en tant que processus de génération d'interférence.
id_id: Komputasi kuantum sebagai proses pembuatan interferensi.
it_it: Calcolo quantistico come processo di generazione di interferenze.
ja_jp: 干渉発生過程としての量子計算
ko_kr: 간섭 생성 프로세스로서의 양자 계산.
pl_pl: Obliczenia kwantowe jako proces generowania interferencji.
pt_un: Computação quântica como um processo de geração de interferência.
ru_ru: Квантовое вычисление как процесс порождения интерференции.
sw_ke: Utarakilishi wa kwanta kama mfumo wa uzalishaji wa mwingiliano.
ta_in: குறுக்கீடு உருவாக்கும் செயல்முறையாக குவாண்டம் கணக்கீடு.
te_in: క్వాంటమ్ కంప్యుటేషన్ ఒక ఇన్టర్పెరెన్స్ జెనెరేట్ చేసే ప్రక్రియ.
tr_tr: Bir girişim oluşturma süreci olarak kuantum hesaplama.
zh_tw: 量子計算作為相干產生過程。

source: Entanglement
bn_bn: এনট্যাঙ্গেলমেন্ট
de_de: Verschränkung
el_gr: Διεμπλοκή
es_un: Entrelazamiento
fr_fr: Intrication
it_it: Entanglement (Correlazione quantistica)
ja_jp: エンタングルメント
ko_kr: 얽힘
pl_pl: Splątanie
pt_un: Entrelaçamento
ru_ru: Запутанность
sw_ke: Mtangamano
ta_in: என்டான்கில்மெண்ட்
te_in: ఎన్టేంగిల్మెంట్
tr_tr: Dolanıklık
zh_tw: 糾纏
