Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: Added support for Circuits through the new API :pull_ibmq-provider:`79`.
ta_in: புதிய ஏபிஐ மூலம் சுற்றுகளுக்கு ஆதரவு சேர்க்கப்பட்டது:pull_ibmq-provider: `79`.

source: Fixed incorrect parsing of some API hub URLs :pull_ibmq-provider:`77`.
ta_in: சில API மைய மையங்களின் நிலையான தவறான பாகுபடுத்தல்:pull_ibmq-provider: `77`.

source: Fixed noise model handling for remote simulators :pull_ibmq-provider:`84`.
ta_in: தொலைநிலை சிமுலேட்டர்களுக்கான நிலையான இரைச்சல் மாதிரி கையாளுதல்:pull_ibmq-provider: `84`.

source: Highlights
ta_in: சிறப்பம்சங்கள்

source: Introduction of the Pulse module under ``qiskit.pulse``, which includes tools for building pulse commands, scheduling them on pulse channels, visualization, and running them on IBM Q devices.
ta_in: துடிப்பு கட்டளைகளை உருவாக்குவது, துடிப்பு சேனல்களில் திட்டமிடுதல், காட்சிப்படுத்தல் மற்றும் ஐபிஎம் கியூ சாதனங்களில் அவற்றை இயக்குவதற்கான கருவிகளை உள்ளடக்கிய `` qiskit.pulse`` இன் கீழ் துடிப்பு தொகுதி அறிமுகம்.

source: Improved QuantumCircuit and Instruction classes, allowing for the composition of arbitrary sub-circuits into larger circuits, and also for creating parameterized circuits.
ta_in: மேம்படுத்தப்பட்ட குவாண்டம் சர்க்யூட் மற்றும் அறிவுறுத்தல் வகுப்புகள், தன்னிச்சையான துணை சுற்றுகளை பெரிய சுற்றுகளாக உருவாக்க அனுமதிக்கிறது, மேலும் அளவுருவாக்கப்பட்ட சுற்றுகளை உருவாக்குவதற்கும் அனுமதிக்கிறது.

source: A powerful Quantum Info module under ``qiskit.quantum_info``, providing tools to work with operators and channels and to use them inside circuits.
ta_in: `` Qiskit.quantum_info`` இன் கீழ் ஒரு சக்திவாய்ந்த குவாண்டம் தகவல் தொகுதி, ஆபரேட்டர்கள் மற்றும் சேனல்களுடன் பணிபுரிய மற்றும் அவற்றை சுற்றுகளுக்குள் பயன்படுத்த கருவிகளை வழங்குகிறது.

source: New transpiler optimization passes and access to predefined transpiling routines.
ta_in: புதிய டிரான்ஸ்பைலர் தேர்வுமுறை கடந்து செல்கிறது மற்றும் முன் வரையறுக்கப்பட்ட டிரான்ஸ்பைலிங் நடைமுறைகளுக்கான அணுகல்.

source: The core ``StochasticSwap`` routine is implemented in `Cython <https://cython.org/>`__.
ta_in: `` StochasticSwap`` வழக்கமான `Cython <https://cython.org/>` __ இல் செயல்படுத்தப்படுகிறது.

source: Added ``QuantumChannel`` classes for manipulating quantum channels and CPTP maps.
ta_in: குவாண்டம் சேனல்கள் மற்றும் CPTP வரைபடங்களைக் கையாள `` QuantumChannel`` வகுப்புகள் சேர்க்கப்பட்டன.

source: Support for parameterized circuits.
ta_in: அளவுரு சுற்றுகளுக்கான ஆதரவு.

source: The ``PassManager`` interface has been improved and new functions added for easier interaction and usage with custom pass managers.
ta_in: '' PassManager`` இடைமுகம் மேம்படுத்தப்பட்டு, தனிப்பயன் பாஸ் மேலாளர்களுடன் எளிதாக தொடர்பு கொள்ளவும் பயன்படுத்தவும் புதிய செயல்பாடுகள் சேர்க்கப்பட்டுள்ளன.

source: Preset ``PassManager``\s are now included which offer a predetermined pipeline of transpiler passes.
ta_in: முன்னமைக்கப்பட்ட `` பாஸ் மேனேஜர்`` கள் இப்போது சேர்க்கப்பட்டுள்ளன, அவை முன்னரே தீர்மானிக்கப்பட்ட டிரான்ஸ்பைலர் பாஸ்களை வழங்குகின்றன.

source: User configuration files to let local environments override default values for some functions.
ta_in: சில செயல்பாடுகளுக்கான இயல்புநிலை மதிப்புகளை உள்ளூர் சூழல்கள் மேலெழுத அனுமதிக்கும் பயனர் உள்ளமைவு கோப்புகள்.

source: New transpiler passes: ``EnlargeWithAncilla``, ``Unroll2Q``, ``NoiseAdaptiveLayout``, ``OptimizeSwapBeforeMeasure``, ``RemoveDiagonalGatesBeforeMeasure``, ``CommutativeCancellation``, ``Collect2qBlocks``, and ``ConsolidateBlocks``.
ta_in: புதிய டிரான்ஸ்பைலர் கடந்து செல்கிறது:``EnlargeWithAncilla``, ``Unroll2Q``, ``NoiseAdaptiveLayout``, ``OptimizeSwapBeforeMeasure``, ``RemoveDiagonalGatesBeforeMeasure``, ``CommutativeCancellation``, ``Collect2qBlocks``, மற்றும் ``ConsolidateBlocks``.

source: Compatibility Considerations
ta_in: ஒத்திசைவு கொள்கைகள்

source: As part of the 0.8 release the following things have been deprecated and will either be removed or changed in a backwards incompatible manner in a future release. While not strictly necessary these are things to adjust for before the 0.9 (unless otherwise noted) release to avoid a breaking change in the future.
ta_in: 0.8 வெளியீடுகளின் பகுதியாக பின்வரும் விஷயங்கள் புதுப்பிக்கப்பட்டு, அல்லது ஒரு எதிர்காமல் வெளியீட்டில் ஒரு பின்னணி முறையில் நீக்கப்படும் அல்லது மாற்றியமைக்கப்படும். சரியாக தேவையில்லையென்றால், எதிர்காலத்தில் ஒரு வெடிப்பு மாற்றத்தை தவிர்க்க 0.9 (இல்லையென்றால்) விடுதலை செய்யும் விஷயங்கள்.

source: The methods prefixed by ``_get`` in the ``DAGCircuit`` object are being renamed without that prefix.
ta_in: ` DAGCircuit`` பொருளில் `` _ஜெட்`` மூலம் முன்னொட்டுள்ள முறைகள் அந்த முன்னொட்டு இல்லாமல் மறுபெயரிடப்படுகின்றன.

source: Changed elements in ``couplinglist`` of ``CouplingMap`` from tuples to lists.
ta_in: டூப்பிள்களிலிருந்து பட்டியல்களுக்கு `` கூப்பிங் மேப்பின்` `` இணைப்பு பட்டியலில்` மாற்றப்பட்ட கூறுகள்.

source: Unroller bases must now be explicit, and violation raises an informative ``QiskitError``.
ta_in: அலுவலர் தளங்கள் இப்போது வெளிப்படையாகக் கொண்டிருக்க வேண்டும், மற்றும் உள்வாங்கும் ஒரு தகவல் ` ` QiskitError ` `.

source: The ``qiskit.tools.qcvv`` package is deprecated and will be removed in the in the future. You should migrate to using the Qiskit Ignis which replaces this module.
ta_in: `` Qiskit.tools.qcvv`` தொகுப்பு நீக்கப்பட்டது மற்றும் எதிர்காலத்தில் அகற்றப்படும். இந்த தொகுதியை மாற்றும் கிஸ்கிட் இக்னிஸைப் பயன்படுத்த நீங்கள் இடம்பெயர வேண்டும்.

source: The ``qiskit.compile()`` function is now deprecated in favor of explicitly using the ``qiskit.compiler.transpile()`` function to transform a circuit, followed by ``qiskit.compiler.assemble()`` to make a Qobj out of it. Instead of ``compile(...)``, use ``assemble(transpile(...), ...)``.
ta_in: `` Qiskit.compile () `` செயல்பாடு இப்போது வெளிப்படையாக `` qiskit.compiler.transpile () `` ஒரு சுற்றுவட்டத்தை மாற்றுவதற்கான செயல்பாட்டைப் பயன்படுத்துவதற்கு ஆதரவாக நீக்கப்பட்டது, அதைத் தொடர்ந்து `` qiskit.compiler.assemble () `` அதிலிருந்து ஒரு கோப்ஜை உருவாக்க. `` தொகுத்தல் (...) `` என்பதற்கு பதிலாக, `` ஒன்றுகூடு (டிரான்ஸ்பைல் (...), ...) `` ஐப் பயன்படுத்தவும்.

source: ``qiskit.converters.qobj_to_circuits()`` has been deprecated and will be removed in a future release. Instead ``qiskit.assembler.disassemble()`` should be used to extract ``QuantumCircuit`` objects from a compiled Qobj.
ta_in: ` qiskit.converters.qobj_to_circuits () `` நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக `` qiskit.assembler.disassemble () `` தொகுக்கப்பட்ட Qobj இலிருந்து `` QuantumCircuit`` பொருட்களைப் பிரித்தெடுக்கப் பயன்படுத்தப்பட வேண்டும்.

source: The ``qiskit.mapper`` namespace has been deprecated. The ``Layout`` and ``CouplingMap`` classes can be accessed via ``qiskit.transpiler``.
ta_in: `` Qiskit.mapper`` பெயர்வெளி நீக்கப்பட்டது. `` லேஅவுட்`` மற்றும் `` கப்ளிங் மேப்`` வகுப்புகளை `` qiskit.transpiler`` வழியாக அணுகலாம்.

source: A few functions in ``qiskit.tools.qi.qi`` have been deprecated and moved to ``qiskit.quantum_info``.
ta_in: `` Qiskit.tools.qi.qi`` இல் உள்ள சில செயல்பாடுகள் நீக்கப்பட்டு `` qiskit.quantum_info`` க்கு நகர்த்தப்பட்டுள்ளன.

source: Please note that some backwards incompatible changes have been made during this release. The following notes contain information on how to adapt to these changes.
ta_in: இந்த விடுதலை போது சில பின்னணி மாற்றங்கள் செய்யப்பட்டுள்ளது என்று குறிப்பிடுக. பின்வரும் குறிப்புகள் இந்த மாற்றங்களை எப்படி ஏற்றுக்கொள்ளும் எப்படி தகவல்களை கொண்டுள்ளது.

source: IBM Q Provider
ta_in: IBM Q வழங்குபவர்

source: The IBM Q provider was previously included in Terra, but it has been split out into a separate package ``qiskit-ibmq-provider``. This will need to be installed, either via pypi with ``pip install qiskit-ibmq-provider`` or from source in order to access ``qiskit.IBMQ`` or ``qiskit.providers.ibmq``. If you install qiskit with ``pip install qiskit``, that will automatically install all subpackages of the Qiskit project.
ta_in: அவர் ஐபிஎம் கியூ வழங்குநர் முன்பு டெர்ராவில் சேர்க்கப்பட்டார், ஆனால் அது ஒரு தனி தொகுப்பாக பிரிக்கப்பட்டுள்ளது `` கிஸ்கிட்-இப்மக்-வழங்குநர்``. `` பிப் இன்ஸ்டால் கிஸ்கிட்-இப்மக்-வழங்குநர்`` உடன் பைபி வழியாகவோ அல்லது `` கிஸ்கிட்.ஐ.பி.எம்.கியூ`` அல்லது `` qiskit.providers.ibmq`` ஐ அணுக மூலத்திலிருந்து இது நிறுவப்பட வேண்டும். `` பிப் இன்ஸ்டால் கிஸ்கிட்`` உடன் நீங்கள் கிஸ்கிட்டை நிறுவினால், அது தானாகவே கிஸ்கிட் திட்டத்தின் அனைத்து துணைப் பொதிகளையும் நிறுவும்.

source: Cython Components
ta_in: சைதான் கூறுகள்

source: Starting in the 0.8 release the core stochastic swap routine is now implemented in `Cython <https://cython.org/>`__. This was done to significantly improve the performance of the swapper, however if you build Terra from source or run on a non-x86 or other platform without prebuilt wheels and install from source distribution you'll need to make sure that you have Cython installed prior to installing/building Qiskit Terra. This can easily be done with pip/pypi: ``pip install Cython``.
ta_in: 0.8 வெளியீட்டில் தொடங்கி, கோர் ஸ்டோகாஸ்டிக் ஸ்வாப் வழக்கம் இப்போது `Cython <https://cython.org/>` __ இல் செயல்படுத்தப்படுகிறது. ஸ்வாப்பரின் செயல்திறனை கணிசமாக மேம்படுத்துவதற்காக இது செய்யப்பட்டது, இருப்பினும் நீங்கள் டெர்ராவை மூலத்திலிருந்து உருவாக்கினால் அல்லது x86 அல்லாத அல்லது பிற இயங்குதளத்தில் முன் கட்டப்பட்ட சக்கரங்கள் இல்லாமல் இயங்கினால் மற்றும் மூல விநியோகத்திலிருந்து நிறுவினால், நீங்கள் முன்பு சைதான் நிறுவியிருப்பதை உறுதி செய்ய வேண்டும். Qiskit டெர்ராவை நிறுவ / கட்டமைக்க. பிப் / பைபி மூலம் இதை எளிதாக செய்யலாம்: `` pip install Cython``.

source: Compiler Workflow
ta_in: கம்பைலர் பணிப்பாய்வு

source: The ``qiskit.compile()`` function has been deprecated and replaced by first calling ``qiskit.compiler.transpile()`` to run optimization and mapping on a circuit, and then ``qiskit.compiler.assemble()`` to build a Qobj from that optimized circuit to send to a backend. While this is only a deprecation it will emit a warning if you use the old ``qiskit.compile()`` call.
ta_in: ``` Qiskit.compile () `` செயல்பாடு நீக்கப்பட்டு, முதலில் `` qiskit.compiler.transpile () `` ஐ அழைப்பதன் மூலம் ஒரு சுற்றுவட்டத்தில் தேர்வுமுறை மற்றும் மேப்பிங்கை இயக்கவும், பின்னர் `` qiskit.compiler.assemble () `` ஒரு பின்தளத்தில் அனுப்ப அந்த உகந்த சுற்றிலிருந்து ஒரு கோப்ஜ் உருவாக்க. இது ஒரு நீக்கம் மட்டுமே என்றாலும், நீங்கள் பழைய `` qiskit.compile () `` அழைப்பைப் பயன்படுத்தினால் அது ஒரு எச்சரிக்கையை வெளியிடும்.

source: These functions are heavily overloaded and accept a wide range of inputs. They can handle circuit and pulse inputs. All kwargs except for ``backend`` for these functions now also accept lists of the previously accepted types. The ``initial_layout`` kwarg can now be supplied as a both a list and dictionary, e.g. to map a Bell experiment on qubits 13 and 14, you can supply: ``initial_layout=[13, 14]`` or ``initial_layout={qr[0]: 13, qr[1]: 14}``
ta_in: இந்த செயல்பாடுகள் அதிக சுமை மற்றும் பரந்த அளவிலான உள்ளீடுகளை ஏற்றுக்கொள்கின்றன. அவர்கள் சுற்று மற்றும் துடிப்பு உள்ளீடுகளை கையாள முடியும். இந்த செயல்பாடுகளுக்கான `` பின்தளத்தில்`` தவிர அனைத்து குவார்க்குகளும் இப்போது முன்னர் ஏற்றுக்கொள்ளப்பட்ட வகைகளின் பட்டியல்களையும் ஏற்றுக்கொள்கின்றன. `` ஆரம்ப_ லேஅவுட்`` குவார்க் இப்போது பட்டியல் மற்றும் அகராதி இரண்டாக வழங்கப்படலாம், எ.கா. 13 மற்றும் 14 குவிட்களில் பெல் பரிசோதனையை வரைபடமாக்க, நீங்கள் வழங்கலாம்: `` ஆரம்ப_லேயவுட் = [13, 14] `` அல்லது `` ஆரம்ப_லேயவுட் = {qr [0]: 13, qr [1]: 14} ```

source: The Qobj class has been split into two separate subclasses depending on the use case, either ``PulseQobj`` or ``QasmQobj`` for pulse and circuit jobs respectively. If you're interacting with Qobj directly you may need to adjust your usage accordingly.
ta_in: பயன்பாட்டு வழக்கைப் பொறுத்து Qobj வகுப்பு இரண்டு தனித்தனி துணைப்பிரிவுகளாக பிரிக்கப்பட்டுள்ளது, முறையே துடிப்பு மற்றும் சுற்று வேலைகளுக்கு `` PulseQobj`` அல்லது ``QasmQobj``. நீங்கள் நேரடியாக கோப்ஜுடன் தொடர்புகொள்கிறீர்கள் என்றால் அதற்கேற்ப உங்கள் பயன்பாட்டை சரிசெய்ய வேண்டியிருக்கும்.

source: The ``qiskit.qobj.qobj_to_dict()`` is removed. Instead use the ``to_dict()`` method of a Qobj object.
ta_in: ` ` qiskit.qobj.qobj_to_dict () ` ` நீக்கப்பட்டுள்ளது. அதற்கு பதிலாக ` `to_dict () ` ` ஒரு Qobj பொருளின் வழிமுறையை பயன்படுத்த.

source: Visualization
ta_in: காட்சிப்படுத்தல்

source: The largest change to the visualization module is it has moved from ``qiskit.tools.visualization`` to ``qiskit.visualization``. This was done to indicate that the visualization module is more than just a tool. However, since this interface was declared stable in the 0.7 release the public interface off of ``qiskit.tools.visualization`` will continue to work. That may change in a future release, but it will be deprecated prior to removal if that happens.
ta_in: காட்சிப்படுத்தல் தொகுதிக்கு மிகப்பெரிய மாற்றம் இது `` qiskit.tools.visualization`` இலிருந்து `` qiskit.visualization`` க்கு நகர்த்தப்பட்டுள்ளது. காட்சிப்படுத்தல் தொகுதி ஒரு கருவியை விட அதிகம் என்பதைக் குறிக்க இது செய்யப்பட்டது. இருப்பினும், 0.7 வெளியீட்டில் இந்த இடைமுகம் நிலையானதாக அறிவிக்கப்பட்டதால், `` qiskit.tools.visualization`` இன் பொது இடைமுகம் தொடர்ந்து செயல்படும். எதிர்கால வெளியீட்டில் அது மாறக்கூடும், ஆனால் அது நடந்தால் அகற்றப்படுவதற்கு முன்பு அது நீக்கப்படும்.

source: The previously deprecated functions, ``plot_circuit()``, ``latex_circuit_drawer()``, ``generate_latex_source()``, and ``matplotlib_circuit_drawer()`` from ``qiskit.tools.visualization`` have been removed. Instead of these functions, calling ``qiskit.visualization.circuit_drawer()`` with the appropriate arguments should be used.
ta_in: முன்னர் நீக்கப்பட்ட செயல்பாடுகள், ``plot_circuit()``, ``latex_circuit_drawer()``, ``generate_latex_source()`` மற்றும் ``matplotlib_circuit_drawer()`` ``qiskit.tools.visualization`` இலிருந்து நீக்கப்பட்டன. இந்த செயல்பாடுகளுக்கு பதிலாக, ``qiskit.visualization.circuit_drawer ()`` ஐ பொருத்தமான வாதங்களுடன் அழைப்பது பயன்படுத்தப்பட வேண்டும்.

source: The previously deprecated ``plot_barriers`` and ``reverse_bits`` keys in the ``style`` kwarg dictionary are deprecated, instead the ``qiskit.visualization.circuit_drawer()`` kwargs ``plot_barriers`` and ``reverse_bits`` should be used.
ta_in: `` style`` குவார்க் அகராதியில் முன்னர் நீக்கப்பட்ட `` plot_barries`` மற்றும் `` reverse_bits`` விசைகள் நீக்கப்பட்டன, அதற்கு பதிலாக `` qiskit.visualization.circuit_drawer () `` குவார்க்ஸ் ``plot_barries`` மற்றும் ``reverse_bits `` பயன்படுத்தப்பட வேண்டும்.

source: The Wigner plotting functions ``plot_wigner_function``, ``plot_wigner_curve``, ``plot_wigner_plaquette``, and ``plot_wigner_data`` previously in the ``qiskit.tools.visualization._state_visualization`` module have been removed. They were never exposed through the public stable interface and were not well documented. The code to use this feature can still be accessed through the qiskit-tutorials repository.
ta_in: விக்னர் சதி செயல்பாடுகள் `` plot_wigner_function``, `` plot_wigner_curve``, `` plot_wigner_plaquette``, மற்றும் `` plot_wigner_data`` முன்பு `` qiskit.tools.visualization._state_visualization`` தொகுதியில் நீக்கப்பட்டன. அவை ஒருபோதும் பொது நிலையான இடைமுகத்தின் மூலம் வெளிப்படுத்தப்படவில்லை மற்றும் நன்கு ஆவணப்படுத்தப்படவில்லை. இந்த அம்சத்தைப் பயன்படுத்துவதற்கான குறியீட்டை கிஸ்கிட்-டுடோரியல் களஞ்சியத்தின் மூலம் இன்னும் அணுகலாம்.

source: Mapper
ta_in: மேப்பர்

source: The public api from ``qiskit.mapper`` has been moved into ``qiskit.transpiler``. While it has only been deprecated in this release, it will be removed in the 0.9 release so updating your usage of ``Layout`` and ``CouplingMap`` to import from ``qiskit.transpiler`` instead of ``qiskit.mapper`` before that takes place will avoid any surprises in the future.
ta_in: `` Qiskit.mapper`` இலிருந்து பொது Api `` qiskit.transpiler`` க்கு நகர்த்தப்பட்டது. இந்த வெளியீட்டில் மட்டுமே அது நீக்கப்பட்டிருந்தாலும், இது 0.9 வெளியீட்டில் அகற்றப்படும், எனவே `` கிஸ்கிட் 'க்கு பதிலாக `` கிஸ்கிட்.ரான்ஸ்பைலர்`` இலிருந்து இறக்குமதி செய்ய உங்கள் `` லேஅவுட்`` மற்றும் `` கப்ளிங் மேப்`` ஆகியவற்றைப் பயன்படுத்துகிறது. அது நடப்பதற்கு முன் மேப்பர் எதிர்காலத்தில் எந்த ஆச்சரியங்களையும் தவிர்க்கும்.

source: Added multiplexer gate :pull_aer:`192`
ta_in: மல்டிபிளெக்சர் கேட் சேர்க்கப்பட்டது: pull_aer: `192

source: Added ``remap_noise_model`` function to ``noise.utils`` :pull_aer:`181`
ta_in: ` noise.utils`` இல் `` remap_noise_model`` செயல்பாடு சேர்க்கப்பட்டது:pull_aer: `181`

source: Added ``__eq__`` method to ``NoiseModel``, ``QuantumError``, ``ReadoutError`` :pull_aer:`181`
ta_in: `` NoiseModel``, `` QuantumError``, `` ReadoutError``: pull_aer: `181` இல்` `__eq__`` முறையைச் சேர்த்தது.

source: Added support for labelled gates in noise models :pull_aer:`175`
ta_in: இரைச்சல் மாதிரிகளில் பெயரிடப்பட்ட கேட்களுக்கான ஆதரவு சேர்க்கப்பட்டது :pull_aer:` 175 `

source: Added optimized ``mcx``, ``mcy``, ``mcz``, ``mcu1``, ``mcu2``, ``mcu3``, gates to ``QubitVector`` :pull_aer:`124`
ta_in: உகந்ததாக `` mcx``, `` mcy``, `` mcz``, `` mcu1``, `` mcu2``, `` mcu3``, `` QubitVector`` க்கு கேட்கள் சேர்க்கப்பட்டுள்ளன :pull_aer: `124 `

source: Added optimized controlled-swap gate to ``QubitVector`` :pull_aer:`142`
ta_in: `` QubitVector`` இல் உகந்த கட்டுப்பாட்டு-இடமாற்று கேட் சேர்க்கப்பட்டது:pull_aer: `142`

source: Added gate-fusion optimization for ``QasmController``, which is enabled by setting ``fusion_enable=true`` :pull_aer:`136`
ta_in: `` QasmController`` க்கான கேட்-ஃப்யூஷன் தேர்வுமுறை சேர்க்கப்பட்டது, இது `` fusion_enable=true``:pull_aer: `136`

source: Added better management of failed simulations :pull_aer:`167`
ta_in: தோல்வியுற்ற உருவகப்படுத்துதல்களின் சிறந்த நிர்வாகத்தைச் சேர்த்தது:pull_aer: `167

source: Added qubits truncate optimization for unused qubits :pull_aer:`164`
ta_in: சேர்க்கப்பட்ட குவிட்கள் பயன்படுத்தப்படாத க்விட்களுக்கான தேர்வுமுறை துண்டிக்கப்படுகின்றன:pull_aer: `164

source: Added ability to disable depolarizing error on device noise model :pull_aer:`131`
ta_in: சாதன இரைச்சல் மாதிரியில் டிப்போலரைசிங் பிழையை முடக்கும் திறன் சேர்க்கப்பட்டது: pull_aer: `131

source: Added initialize simulator instruction to ``statevector_state`` :pull_aer:`117`, :pull_aer:`137`
ta_in: `` ஸ்டேட்வெக்டர்_ஸ்டேட்`` க்கு சிமுலேட்டர் அறிவுறுத்தலைத் துவக்கியது: pull_aer: `117` ,: pull_aer:` 137

source: Added coupling maps to simulators :pull_aer:`93`
ta_in: சிமுலேட்டர்களில் இணைப்பு வரைபடங்கள் சேர்க்கப்பட்டன:pull_aer: `93`

source: Added circuit optimization framework :pull_aer:`83`
ta_in: சுற்று உகப்பாக்கம் கட்டமைப்பைச் சேர்த்தது:pull_aer: `83`

source: Added benchmarking :pull_aer:`71`, :pull_aer:`177`
ta_in: கூடுதலாக :pull_aer:` 71 `, :pull_aer:` 177 `

source: Added wheels support for Debian-like distributions :pull_aer:`69`
ta_in: டெபியன் போன்ற விநியோகங்களுக்கு சக்கரங்கள் துணைபுரிகின்றன: pull_aer: `69

source: Added autoconfiguration of threads for qasm simulator :pull_aer:`61`
ta_in: Qasm சிமுலேட்டருக்கான நூல்களின் தானியங்கு கட்டமைப்பு சேர்க்கப்பட்டது: pull_aer: `61`

source: Added Simulation method based on Stabilizer Rank Decompositions :pull_aer:`51`
ta_in: நிலைப்படுத்தி தரவரிசை சிதைவுகளை அடிப்படையாகக் கொண்ட உருவகப்படுத்துதல் முறை: pull_aer: `51`

source: Added ``basis_gates`` kwarg to ``NoiseModel`` init :pull_aer:`175`.
ta_in: `` NoiseModel`` init: pull_aer: `175` இல்` `அடிப்படை_கேட்ஸ்`` குவார்க் சேர்க்கப்பட்டது.

source: Added an optional parameter to ``NoiseModel.as_dict()`` for returning dictionaries that can be serialized using the standard json library directly :pull_aer:`165`
ta_in: நிலையான json நூலகத்தைப் பயன்படுத்தி தொடர்ச்சியாக வரிசைப்படுத்தக்கூடிய அகராதிகளைத் திருப்புவதற்கு `` NoiseModel.as_dict () `` க்கு ஒரு விருப்ப அளவுருவைச் சேர்த்தது: pull_aer: `165`

source: Refactor thread management :pull_aer:`50`
ta_in: மறுசீரமைப்பு நூல் மேலாண்மை: pull_aer: `50

source: Improve noise transformations :pull_aer:`162`
ta_in: இரைச்சல் மாற்றங்களை மேம்படுத்தவும்: pull_aer: `162`

source: Improve error reporting :pull_aer:`160`
ta_in: பிழை அறிக்கையை மேம்படுத்தவும்: pull_aer: `160`

source: Improve efficiency of parallelization with ``max_memory_mb`` a new parameter of ``backend_opts`` :pull_aer:`61`
ta_in: `` அதிகபட்சம்_மெமரி_எம்பி`` உடன் இணையான செயல்திறனை மேம்படுத்தவும் `` பின்தளத்தில்_ஒப்டிஸின்` புதிய அளவுரு: pull_aer: `61`

source: Improve u1 performance in ``statevector`` :pull_aer:`123`
ta_in: `` ஸ்டேட்வெக்டர்`` இல் u1 செயல்திறனை மேம்படுத்தவும்: pull_aer: `123

source: Fixed OpenMP clashing problems on macOS for the Terra add-on :pull_aer:`46`
ta_in: டெர்ரா செருகு நிரலுக்கான மேகோஸில் நிலையான ஓப்பன் எம்.பி மோதல் சிக்கல்கள்: pull_aer: `46

source: Deprecated ``"initial_statevector"`` backend option for ``QasmSimulator`` and ``StatevectorSimulator`` :pull_aer:`185`
ta_in: `` காஸ்மிமுலேட்டர்`` மற்றும் `` ஸ்டேட்வெக்டர் சிமுலேட்டர்``: புல்_ஆயர்: `185

source: Renamed ``"chop_threshold"`` backend option to ``"zero_threshold"`` and changed default value to 1e-10 :pull_aer:`185`
ta_in: `` "சாப்_தெரெஷோல்ட்" `` பின்தளத்தில் விருப்பத்தை `` "ஜீரோ_தெரெஷோல்ட்" என மாற்றி, இயல்புநிலை மதிப்பை 1e-10 ஆக மாற்றியது: pull_aer: `185`

source: Quantum volume
ta_in: குவாண்டம் தொகுதி

source: Measurement mitigation using tensored calibrations
ta_in: வெப்பம் சிக்குறுத்தும் வளிமண்டலங்கள்

source: Simultaneous RB has the option to align Clifford gates across subsets
ta_in: ஒரே நேரத்தில் ஆர். பி. க்கு கிளிஃபோர்ட் வாயில்களை துணைக்குழுக்களில் சீரமைக்க விருப்பம் உள்ளது

source: Measurement correction can produce a new calibration for a subset of qubits
ta_in: அளவீட்டு திருத்தம் குவிட்களின் துணைக்குழுவுக்கு புதிய அளவுத்திருத்தத்தை உருவாக்க முடியும்

source: RB writes to the minimal set of classical registers (it used to be Q[i]->C[i]). This change enables measurement correction with RB. Unless users had external analysis code, this will not change outcomes. RB circuits from 0.1 are not compatible with 0.1.1 fitters.
ta_in: RB கிளாசிக்கல் பதிவேடுகளின் குறைந்தபட்ச தொகுப்பிற்கு எழுதுகிறது (இது Q [i] -> C [i] ஆக இருந்தது). இந்த மாற்றம் RB உடன் அளவீட்டு திருத்தத்தை செயல்படுத்துகிறது. பயனர்களுக்கு வெளிப்புற பகுப்பாய்வுக் குறியீடு இல்லையென்றால், இது விளைவுகளை மாற்றாது. 0.1 இலிருந்து RB சுற்றுகள் 0.1.1 பொருத்திகளுடன் பொருந்தாது.

source: Implementation of the HHL algorithm supporting ``LinearSystemInput``
ta_in: `` LinearSystemInput`` ஐ ஆதரிக்கும் எச். எச். எல் வழிமுறையை செயல்படுத்துதல்

source: Pluggable component ``Eigenvalues`` with variant ``EigQPE``
ta_in: `` EigQPE`` மாறுபாட்டுடன் சொருகக்கூடிய கூறு `` Eigenvalues``

source: Pluggable component ``Reciprocal`` with variants ``LookupRotation`` and ``LongDivision``
ta_in: `` LookupRotation`` மற்றும் ``LongDivision`` ஆகிய வகைகளுடன் செருகக்கூடிய கூறு `` பரஸ்பர``

source: Multiple-Controlled U1 and U3 operations ``mcu1`` and ``mcu3``
ta_in: பல கட்டுப்படுத்தப்பட்ட U1 மற்றும் U3 செயல்பாடுகள் `` mcu1`` மற்றும் `` mcu3``

source: Pluggable component ``QFT`` derived from component ``IQFT``
ta_in: சொருகக்கூடிய கூறு `` QFT`` `` IQFT`` கூறுகளிலிருந்து பெறப்பட்டது

source: Summarized the transpiled circuits at the DEBUG logging level
ta_in: DEBUG பதிவு மட்டத்தில் கடத்தப்பட்ட சுற்றுகளை சுருக்கமாகக் கூறினார்

source: ``QuantumInstance`` accepts ``basis_gates`` and ``coupling_map`` again.
ta_in: ` ` QuantumInstance ` ` ` basis_gates ` ` and ` coupling_map ` ` மீண்டும் ஏற்றுக்கொள்ளும்.

source: Support to use ``cx`` gate for the entanglement in ``RY`` and ``RYRZ`` variational form (``cz`` is the default choice)
ta_in: `` RY`` மற்றும் `` RYRZ`` மாறுபட்ட வடிவத்தில் சிக்கலுக்கு `` cx`` வாயிலைப் பயன்படுத்துவதற்கான ஆதரவு (`` cz`` இயல்புநிலை தேர்வு)

source: Support to use arbitrary mixer Hamiltonian in QAOA, allowing use of QAOA in constrained optimization problems [arXiv:1709.03489]
ta_in: QAOA இல் தன்னிச்சையான கலவை ஹாமில்டோனியனைப் பயன்படுத்துவதற்கான ஆதரவு, கட்டுப்படுத்தப்பட்ட தேர்வுமுறை சிக்கல்களில் QAOA ஐப் பயன்படுத்த அனுமதிக்கிறது [arXiv: 1709.03489]

source: Added variational algorithm base class ``VQAlgorithm``, implemented by ``VQE`` and ``QSVMVariational``
ta_in: `` VQE`` மற்றும் `` QSVMVariational`` ஆகியவற்றால் செயல்படுத்தப்பட்ட மாறுபட்ட வழிமுறை அடிப்படை வகுப்பு `` VQAlgorithm`` சேர்க்கப்பட்டது
