Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: The ``routing_method`` kwarg for the :func:`~qiskit.compiler.transpile` function now accepts a new option, ``'none'``. When ``routing_method='none'`` no routing pass will be run as part of the transpilation. If the circuit does not fit coupling map a :class:`~qiskit.transpiler.exceptions.TranspilerError` exception will be raised.
ta_in: "routing_method" க்வார்க் :func:"~qiskit.compiler.transpile" செயல்பாட்டிற்கான க்வார்க் இப்போது ஒரு புதிய விருப்பத்தை ஏற்றுக்கொள்கிறது, "எதுவும் இல்லை". 'routing_method='எதுவும் இல்லை' என்ற போது, பரிமாற்றத்தின் ஒரு பகுதியாக எந்த ரூட்டிங் பாஸ் இயக்கப்படாது. சுற்று இணைப்பு வரைபடத்தில் பொருந்தவில்லை என்றால் :class:'~qiskit.transpiler.exceptions.TranspilerError' விதிவிலக்கு எழுப்பப்படும்.

source: A new gate class, :class:`~qiskit.circuit.library.RVGate`, was added to the :mod:`qiskit.circuit.library` module along with the corresponding :class:`~qiskit.circuit.QuantumCircuit` method :meth:`~qiskit.circuit.QuantumCircuit.rv`. The :class:`~qiskit.circuit.library.RVGate` is a general rotation gate, similar to the :class:`~qiskit.circuit.library.UGate`, but instead of specifying Euler angles the three components of a rotation vector are specified where the direction of the vector specifies the rotation axis and the magnitude specifies the rotation angle about the axis in radians. For example::
ta_in: ஒரு புதிய வாயில் :class:'~qiskit.circuit.library.RVGate', தொடர்புடைய :mod:'qiskit.circuit.library' தொகுதியுடன் சேர்க்கப்பட்டது:class:'~qiskit.circuit.QuantumCircuit' முறை :meth:'~qiskit.circuit.QuantumCircuit.rv'. :class:'~qiskit.circuit.library.RVGate' என்பது ஒரு பொதுவான சுழற்சி வாயில் ஆகும், இது :class:'~qiskit.circuit.library.UGate', ஆனால் யூலர் கோணங்களைக் குறிப்பிடுவதற்குப் பதிலாக, ஒரு சுழற்சி திசையனின் மூன்று கூறுகளும் சுழற்சி அச்சைக் குறிப்பிடுகின்றன மற்றும் ரேடான்களில் அச்சு பற்றிய சுழற்சி கோணத்தை அளவு குறிப்பிடுகிறது. உதாரணமாக::

source: Unbound :class:`~qiskit.circuit.Parameter` objects used in a :class:`~qiskit.circuit.QuantumCircuit` object will now be sorted by name. This will take effect for the parameters returned by the :attr:`~qiskit.circuit.QuantumCircuit.parameters` attribute. Additionally, the :meth:`qiskit.circuit.QuantumCircuit.bind_parameters` and :meth:`qiskit.circuit.QuantumCircuit.assign_parameters` methods can now take in a list of a values which will bind/assign them to the parameters in name-sorted order. Previously these methods would only take a dictionary of parameters and values. For example:
ta_in: கட்டுப்படாத :class:'~qiskit.circuit.Parameter' ஒரு :class:'~qiskit.circuit.QuantumCircuit' பொருள் இப்போது பெயரால் வரிசைப்படுத்தப்படும். இது :attr:'~qiskit.circuit.QuantumCircuit.parameters' பண்புமூலம் திருப்பியருக்களுக்கு நடைமுறைக்கு வரும். கூடுதலாக, :meth:'qiskit.circuit.QuantumCircuit.bind_parameters' மற்றும் :meth:'qiskit.circuit.QuantumCircuit.assign_parameters' முறைகள் இப்போது ஒரு மதிப்புகளின் பட்டியலை எடுக்கலாம், இது பெயர் வரிசைப்படுத்தப்பட்ட வரிசையில் அளவுருக்களுடன் அவற்றை இணைக்கும் / ஒதுக்கும். முன்பு இந்த முறைகள் அளவுருக்கள் மற்றும் மதிப்புகளின் அகராதியை மட்டுமே எடுக்கும். உதாரணமாக:

source: The constructors for the :class:`qiskit.quantum_info.Statevector` and :class:`qiskit.quantum_info.DensityMatrix` classes can now take a :class:`~qiskit.circuit.QuantumCircuit` object in to build a :class:`~qiskit.quantum_info.Statevector` and :class:`~qiskit.quantum_info.DensityMatrix` object from that circuit, assuming that the qubits are initialized in :math:`|0\rangle`. For example:
ta_in: :class:'qiskit.quantum_info.Statevector' க்கான கட்டமைப்பாளர்கள் மற்றும் :class:'qiskit.quantum_info.DensityMatrix' வகுப்புகள் இப்போது ஒரு :class: '~qiskit.circuit.QuantumCircuit' பொருளை ஒரு :class:'~qiskit.quantum_info உருவாக்க லாம். ஸ்டேட்வெக்டர்' மற்றும் :class:'~qiskit.quantum_info. அந்த சுற்றில் இருந்து அடர்த்தி மேட்ரிக்ஸ் பொருள், குபிட்கள் :math:'|0\rமூலை' இல் துவக்கப்படுகின்றன என்று அனுமானித்து. உதாரணமாக:

source: New fake backend classes are available under ``qiskit.test.mock``. These included mocked versions of ``ibmq_casablanca``, ``ibmq_sydney``, ``ibmq_mumbai``, ``ibmq_lima``, ``ibmq_belem``, ``ibmq_quito``. As with the other fake backends, these include snapshots of calibration data (i.e. ``backend.defaults()``) and error data (i.e. ``backend.properties()``) taken from the real system, and can be used for local testing, compilation and simulation.
ta_in: புதிய போலி பின்தளத்தில் வகுப்புகள் `` qiskit.test.mock`` இன் கீழ் கிடைக்கின்றன. `` Ibmq_casablanca``, `` ibmq_sydney``, `` ibmq_mumbai``, `` ibmq_lima``, `` ibmq_belem``, `` ibmq_quito`` ஆகியவற்றின் கேலி செய்யப்பட்ட பதிப்புகள் இதில் அடங்கும். மற்ற போலி பின்தளத்தில் உள்ளதைப் போலவே, அளவீட்டுத் தரவின் ஸ்னாப்ஷாட்களும் (அதாவது ``backend.defaults()``) மற்றும் பிழை தரவு (அதாவது `` backend.properties()``) உண்மையான அமைப்பிலிருந்து எடுக்கப்பட்டவை, அவற்றைப் பயன்படுத்தலாம் உள்ளூர் சோதனை, தொகுப்பு மற்றும் உருவகப்படுத்துதலுக்காக.

source: Attempting to add an :class:`qiskit.pulse.Instruction` object with a parameterized ``duration`` (ie the value of ``duration`` is an unbound :class:`~qiskit.circuit.Parameter` or :class:`~qiskit.circuit.ParameterExpression` object) to a :class:`qiskit.pulse.Schedule` is not supported. Attempting to do so will result in ``UnassignedDurationError`` :class:`~qiskit.pulse.PulseError` being raised. This is a limitation of how the :class:`~qiskit.pulse.Instruction` overlap constraints are evaluated currently. This is supported by :class:`~qiskit.pulse.ScheduleBlock`, in which the overlap constraints are evaluated just before the execution.
ta_in: ஒரு :class:'qiskit.pulse.Instruction' பொருளை அளவுருக்கள் கொண்ட 'கால அளவு' (அதாவது 'காலஅளவு' மதிப்பு ஒரு எல்லையற்றது :class:'~qiskit.circuit.Parameter'. அல்லது :class: ~ qiskit.circuit.ParameterExpression' பொருள்) ஒரு :class:'qiskit.pulse.Schedule' ஆதரிக்கப்படவில்லை. அவ்வாறு செய்ய முயற்சிப்பது 'ஒதுக்கப்படாதகாலபிழை':class:'~qiskit.pulse.PulseError' எழுப்பப்படும். இது :class:'~qiskit.pulse.Instruction' மேல்கவிழ்ப்பு கட்டுப்பாடுகள் தற்போது எவ்வாறு மதிப்பிடப்படுகின்றன என்பதற்கான வரம்பு ஆகும். இதை ஆதரிக்கிறது:class:'~qiskit.pulse.ScheduleBlock', இதில் மேல்கவிழ்ப்பு கட்டுப்பாடுகள் மரணதண்டனைக்கு சற்று முன்பு மதிப்பிடப்படுகின்றன.

source: On Windows systems when parallel execution is enabled for :func:`~qiskit.tools.parallel_map` parallelism may not work when called from a script running outside of a ``if __name__ == '__main__':`` block. This is due to how Python launches parallel processes on Windows. If a ``RuntimeError`` or ``AttributeError`` are raised by scripts that call :func:`~qiskit.tools.parallel_map` (including using functions that use ``parallel_map()`` internally like :func:`~qiskit.compiler.transpile`) with Windows and parallelism enabled you can try embedding the script calls inside ``if __name__ == '__main__':`` to workaround the issue. For example::
ta_in: இணை செயலாக்கம் செயல்படுத்தப்படும் போது விண்டோஸ் அமைப்புகளில் :func:'~qiskit.tools.parallel_map' இணைவாதம் ஒரு ஸ்கிரிப்ட் வெளியே இயங்கும் போது வேலை செய்யாது "__name__ என்றால் =="__main__":'' தொகுதி. இது பைத்தான் விண்டோஸ் இணை செயல்முறைகள் தொடங்குகிறது எப்படி காரணமாக உள்ளது. 'RuntimeError' அல்லது 'AttributeError' என்று அழைக்கும் ஸ்கிரிப்ட்களால் எழுப்பப்பட்டால் :func:'~qiskit.tools.parallel_map' ('parallel_map()' போன்ற உள்செயல்பாடுகளைப் பயன்படுத்துவது உட்பட :func:'~qiskit.compiler.transpile') விண்டோஸ் மற்றும் இணைத்தன்மையுடன் '__name__ == '__main__':' என்ற ஸ்கிரிப்ட் அழைப்புகளை உள்ளே உட்பொதிக்க முயற்சிக்கலாம். உதாரணமாக::

source: should be changed to::
ta_in: :: க்கு மாற்றப்பட வேண்டும்::

source: if any errors are encountered with parallelism on Windows.
ta_in: விண்டோஸ்-யின் இணை இயக்க செயலாக்கத்தின் பயன்பாடு முறையில். ஏதேனும் பிழைகள் ஏற்பட்டால்.

source: The preset pass managers :class:`~qiskit.transpiler.preset_passmanagers.level_1_pass_manager`, :class:`~qiskit.transpiler.preset_passmanagers.level_2_pass_manager`, and :class:`~qiskit.transpiler.preset_passmanagers.level_3_pass_manager` (which are used for ``optimization_level`` 1, 2, and 3 in the :func:`~qiskit.compiler.transpile` and :func:`~qiskit.execute_function.execute` functions) now unconditionally use the :class:`~qiskit.transpiler.passes.Optimize1qGatesDecomposition` pass for 1 qubit gate optimization. Previously, these pass managers would use the :class:`~qiskit.transpiler.passes.Optimize1qGates` pass if the basis gates contained ``u1``, ``u2``, or ``u3``. If you want to still use the old :class:`~qiskit.transpiler.passes.Optimize1qGates` you will need to construct a custom :class:`~qiskit.transpiler.PassManager` with the pass.
ta_in: முன்னமைக்கப்பட்ட பாஸ் மேலாளர்கள்: வகுப்பு: `கிஸ்கிட். டிரான்ஸ்பைலர். முன்னமைக்கப்பட்ட _ பாஸ்மேனேஜர்கள். நிலை _ 1 _ பாஸ் _மேனேஜர்` ,: வகுப்பு: `~ கிஸ்கிட். டிரான்ஸ்பைலர். முன்னமைக்கப்பட்ட _ பாஸ்மேனேஜர்கள் .லெவல்_2_பாஸ்_ மேலாளர்`, மற்றும்: வகுப்பு: `~ கிஸ்கிட். டிரான்ஸ்பைலர். முன்னமைக்கப்பட்ட _ பாஸ்மேனேஜர்கள். நிலை _3_ பாஸ் _ மேலாளர்` (இவை `` உகப்பாக்கம்_அளவு`` 1, 2, மற்றும் 3 இல் பயன்படுத்தப்படுகின்றன: func: ` கிஸ்கிட். கம்பைலர். டிரான்ஸ்பைல்` மற்றும்: ஃபங்க்:` ~ கிஸ்கிட். எக்ஸிகியூட்_ஃபங்க்ஷன். நிபந்தனையின்றி பயன்படுத்தவும்: வர்க்கம்: `~ கிஸ்கிட். டிரான்ஸ்பைலர். சீட்டுகள். 1 குவிட் கேட் தேர்வுமுறைக்கு ஆப்டிமைஸ் 1 கே கேட்ஸ் டெகம்போசிஷன்` பாஸ். முன்னதாக, இந்த பாஸ் மேலாளர்கள்: வகுப்பு: `~ கிஸ்கிட் ஐப் பயன்படுத்துவார்கள். டிரான்ஸ்பைலர். சீட்டுகள். அடிப்படை வாயில்களில் `` u1``, `` u2``, அல்லது `` u3`` இருந்தால் 1q கேட்ஸ் பாஸை மேம்படுத்தவும். நீங்கள் இன்னும் பழையதைப் பயன்படுத்த விரும்பினால்: வகுப்பு: `~ கிஸ்கிட். டிரான்ஸ்பைலர். சீட்டுகள். ஆப்டிமைஸ் 1 கே கேட்ஸ்` நீங்கள் தனிப்பயன்: வகுப்பு: `கிஸ்கிட் கட்டமைக்க வேண்டும். டிரான்ஸ்பைலர். பாஸ்மேனேஜர்` பாஸுடன்.

source: Following transpilation of a parameterized :class:`~qiskit.circuit.QuantumCircuit`, the :attr:`~qiskit.circuit.QuantumCircuit.global_phase` attribute of output circuit may no longer be returned in a simplified form, if the global phase is a :class:`~qiskit.circuit.ParameterExpression`.
ta_in: அளவுருக்கள் மாற்றப்பட்டதைத் தொடர்ந்து :class:'~qiskit.circuit.QuantumCircuit', :attr:'~qiskit.circuit.QuantumCircuit.global_phase' வெளியீடு சுற்று பண்பு இனி எளிமைப்படுத்தப்பட்ட வடிவத்தில் திரும்ப முடியாது, உலகளாவிய கட்டம் ஒரு :class:'~qiskit.circuit.ParameterExpression'.

source: For example::
ta_in: உதாரணத்திற்கு::

source: previously returned ``0``, but will now return ``-0.5*theta + 0.5*theta``. This change was necessary was to avoid a large runtime performance penalty as simplifying symbolic expressions can be quite slow, especially if there are many :class:`~qiskit.circuit.ParameterExpression` objects in a circuit.
ta_in: முன்பு '0' என்று திரும்பி வந்தது, ஆனால் இப்போது '-0.5*திட்டா + 0.5*திட்டா' என்று திரும்பும் . அடையாள வெளிப்பாடுகளை எளிமைப்படுத்துவது மிகவும் மெதுவாக இருக்கும் என்பதால், ஒரு பெரிய ரன்டைம் செயல்திறன் அபராதத்தை தவிர்ப்பதற்கு இந்த மாற்றம் அவசியமாக இருந்தது, குறிப்பாக பல இருந்தால்:class:'~qiskit.circuit.ParameterExpression' பொருட்கள் ஒரு சுற்றில் உள்ளன.

source: The :class:`~qiskit.providers.basicaer.BasicAerJob` job objects returned from BasicAer backends are now synchronous instances of :class:`~qiskit.providers.JobV1`. This means that calls to the :meth:`~qiskit.providers.basicaer.QasmSimulatorPy.run` will block until the simulation finishes executing. If you want to restore the previous async behavior you'll need to wrap the :meth:`~qiskit.providers.basicaer.QasmSimulatorPy.run` with something that will run in a seperate thread or process like ``futures.ThreadPoolExecutor`` or ``futures.ProcessPoolExecutor``.
ta_in: :class: `~ qiskit.providers.basicaer.BasicAerJob` வேலை பொருள்கள் BasicAer பின்தளத்தில் இருந்து திரும்பியவை இப்போது ஒத்திசைவான நிகழ்வுகளாக இருக்கின்றன :class:` ~ qiskit.providers.JobV1`. இதன் பொருள் :meth: `~ qiskit.providers.basicaer.QasmSimulatorPy.run` க்கு அழைப்புகள் உருவகப்படுத்துதல் இயங்குவதை முடிக்கும் வரை தடுக்கும். முந்தைய ஒத்திசைவு நடத்தை மீட்டெடுக்க நீங்கள் விரும்பினால் :meth: `~ qiskit.providers.basicaer.QasmSimulatorPy.run` என்பது ஒரு தனி நூலில் அல்லது` `எதிர்காலங்கள் 'போன்ற செயல்பாட்டில் இயங்கும். ThreadPoolExecutor`` அல்லது `` futures.ProcessPoolExecutor``.

source: The ``allow_sample_measuring`` option for the BasicAer simulator :class:`~qiskit.providers.basicaer.QasmSimulatorPy` has changed from a default of ``False`` to ``True``. This was done to better reflect the actual default behavior of the simulator, which would use sample measuring if the input circuit supported it (even if it was not enabled). If you are running a circuit that doesn't support sample measurement (ie it has :class:`~qiskit.circuit.Reset` operations or if there are operations after a measurement on a qubit) you should make sure to explicitly set this option to ``False`` when you call :meth:`~qiskit.providers.basicaer.QasmSimulatorPy.run`.
ta_in: BasicAer சிமுலேட்டருக்கான ``allow_sample_measuring`` விருப்பம் :class: `~ qiskit.providers.basicaer.QasmSimulatorPy` என்பது ``False`` இன் இயல்புநிலையிலிருந்து ``True`` என மாறிவிட்டது. சிமுலேட்டரின் உண்மையான இயல்புநிலை நடத்தையை சிறப்பாக பிரதிபலிக்க இது செய்யப்பட்டது, இது உள்ளீட்டு சுற்று அதை ஆதரித்தால் மாதிரி அளவீட்டைப் பயன்படுத்தும் (இது இயக்கப்படாவிட்டாலும் கூட). மாதிரி அளவீட்டை ஆதரிக்காத ஒரு சுற்றுவட்டத்தை நீங்கள் இயக்குகிறீர்கள் என்றால் (அதாவது இது :class: `~ qiskit.circuit.Reset` செயல்பாடுகள் அல்லது ஒரு குவிட்டில் ஒரு அளவீட்டுக்குப் பிறகு செயல்பாடுகள் இருந்தால்) இந்த விருப்பத்தை வெளிப்படையாக அமைப்பதை உறுதி செய்ய வேண்டும் நீங்கள் அழைக்கும் போது ``False`` க்கு :meth: `~ qiskit.providers.basicaer.QasmSimulatorPy.run`.

source: The :class:`~qiskit.transpiler.passes.CommutativeCancellation` transpiler pass is now aware of the target basis gates, which means it will only use gates in the specified basis. Previously, the pass would unconditionally replace consecutive gates which commute with :class:`~qiskit.circuit.library.ZGate` with the :class:`~qiskit.circuit.library.U1Gate`. However, now that the pass is basis aware and has a kwarg, ``basis_gates``, for specifying the target basis there is a potential change in behavior if the kwarg is not set. When the ``basis_gates`` kwarg is not used and there are no variable z-rotation gates in the circuit then no commutative cancellation will occur.
ta_in: :class: `~ qiskit.transpiler.passes.CommutativeCancellation` டிரான்ஸ்பைலர் பாஸ் இப்போது இலக்கு அடிப்படை வாயில்களை அறிந்திருக்கிறது, அதாவது இது குறிப்பிட்ட அடிப்படையில் மட்டுமே வாயில்களைப் பயன்படுத்தும். முன்னதாக, பாஸ் நிபந்தனையின்றி தொடர்ச்சியான வாயில்களை மாற்றும் :class: `~ qiskit.circuit.library.ZGate` உடன் :class:` ~ qiskit.circuit.library.U1Gate`. இருப்பினும், இப்போது பாஸ் அடிப்படையில் அறிந்திருக்கிறது மற்றும் ஒரு குவார்க் உள்ளது, ``basis_gates``, இலக்கு அடிப்படையைக் குறிப்பிடுவதற்கு குவார்க் அமைக்கப்படாவிட்டால் நடத்தையில் சாத்தியமான மாற்றம் இருக்கும். ``basis_gates`` குவார்க் பயன்படுத்தப்படாதபோது, ​​சுற்றுவட்டத்தில் மாறி z- சுழற்சி வாயில்கள் இல்லாதபோது, ​​பரிமாற்ற ரத்து எதுவும் ஏற்படாது.

source: :class:`~qiskit.circuit.Register` (which is the parent class for :class:`~qiskit.circuit.QuantumRegister` and :class:`~qiskit.circuit.ClassicalRegister` and :class:`~qiskit.circuit.Bit` (which is the parent class for :class:`~qiskit.circuit.Qubit` and :class:`~qiskit.circuit.Clbit`) objects are now immutable. In previous releases it was possible to adjust the value of a :attr:`~qiskit.circuit.QuantumRegister.size` or :attr:`~qiskit.circuit.QuantumRegister.name` attributes of a :class:`~qiskit.circuit.Register` object and the :attr:`~qiskit.circuit.Qubit.index` or :attr:`~qiskit.circuit.Qubit.register` attributes of a :class:`~qiskit.circuit.Bit` object after it was initially created. However this would lead to unsound behavior that would corrupt container structure that rely on a hash (such as a `dict`) since these attributes are treated as immutable properties of a register or bit (see `#4705 <https://github.com/Qiskit/qiskit-terra/issues/4705>`__ for more details). To avoid this unsound behavior this attributes of a :class:`~qiskit.circuit.Register` and :class:`~qiskit.circuit.Bit` are no longer settable after initial creation. If you were previously adjusting the objects at runtime you will now need to create a new ``Register`` or ``Bit`` object with the new values.
ta_in: :class: `~ qiskit.circuit.Register` (இது பெற்றோர் வகுப்பு :class:` ~ qiskit.circuit.QuantumRegister` மற்றும் :class: `~ qiskit.circuit.ClassicalRegister` மற்றும் :class:` ~ qiskit.circuit .பிட்` (இது பெற்றோர் வர்க்கம் :class: `~ qiskit.circuit.Qubit` மற்றும் :class:` ~ qiskit.circuit.Clbit`) பொருள்கள் இப்போது மாறாதவை. முந்தைய வெளியீடுகளில் அதன் மதிப்பை சரிசெய்ய முடிந்தது a :attr: `~ qiskit.circuit.QuantumRegister.size` அல்லது :attr:` ~ qiskit.circuit.QuantumRegister.name` ஒரு: வகுப்பின் பண்புக்கூறுகள் :class: `~ qiskit.circuit.Register` பொருள் மற்றும் :attr:` ~ qiskit.circuit.Qubit.index` அல்லது :attr: `~ qiskit.circuit.Qubit.register` இன் பண்புக்கூறுகள் :class:` ~ qiskit.circuit.Bit` பொருள் ஆரம்பத்தில் உருவாக்கப்பட்ட பிறகு. இருப்பினும் இது தவறான நடத்தைக்கு வழிவகுக்கும் இந்த பண்புக்கூறுகள் ஒரு பதிவேடு அல்லது பிட்டின் மாறாத பண்புகளாகக் கருதப்படுவதால் (` டிக்ட்` போன்றவை) நம்பியிருக்கும் கொள்கலன் கட்டமைப்பை இது சிதைக்கும் (`#4705 <https://github.com/Qiskit/qiskit-terra/issues/4705>`__ மேலும் விவரங்களுக்கு). இதைத் தவிர்க்க ஒரு நடத்தை :class: `~ qiskit.circuit.Register` மற்றும் :class:` ~ qiskit.circuit.Bit` இன் இந்த பண்புகளை ஆரம்ப உருவாக்கத்திற்குப் பிறகு இனி தீர்க்க முடியாது. நீங்கள் முன்பு இயக்க நேரத்தில் பொருள்களை சரிசெய்திருந்தால், இப்போது புதிய மதிப்புகளுடன் புதிய ``Register`` அல்லது ``Bit`` பொருளை உருவாக்க வேண்டும்.

source: The ``DAGCircuit.__eq__`` method (which is used by the ``==`` operator), which is used to check structural equality of :class:`~qiskit.dagcircuit.DAGCircuit` and :class:`~qiskit.circuit.QuantumCircuit` instances, will now include the :attr:`~qiskit.circuit.QuantumCircuit.global_phase` and :attr:`~qiskit.circuit.QuantumCircuit.calibrations` attributes in the fields checked for equality. This means that circuits which would have evaluated as equal in prior releases may not anymore if the ``global_phase`` or ``calibrations`` differ between the circuits. For example, in previous releases this would return ``True``::
ta_in: `` DAGCircuit.__eq__`` முறை (இது `` == `` ஆபரேட்டரால் பயன்படுத்தப்படுகிறது), இது கட்டமைப்பு சமத்துவத்தை சரிபார்க்கப் பயன்படுகிறது :class: `~ qiskit.dagcircuit.DAGCircuit` மற்றும் :class:` q qiskit .circuit.QuantumCircuit` நிகழ்வுகளில், இப்போது :attr: `~ qiskit.circuit.QuantumCircuit.global_phase` மற்றும் :attr:` ~ qiskit.circuit.QuantumCircuit.calibrations` பண்புகளை சமத்துவத்திற்காக சரிபார்க்கும். இதன் பொருள், `` global_phase`` அல்லது ``calibrations`` சுற்றுகளுக்கு இடையில் வேறுபடுகிறதென்றால், முந்தைய வெளியீடுகளில் சமமாக மதிப்பிடப்பட்ட சுற்றுகள் இனி இருக்காது. எடுத்துக்காட்டாக, முந்தைய வெளியீடுகளில் இது ``True`` ::

source: However, now because the ``global_phase`` attribute of the circuits differ this will now return ``False``.
ta_in: இருப்பினும், இப்போது சுற்றுகளின் `` global_phase`` பண்பு வேறுபடுவதால் இது இப்போது `` False`` தரும்.

source: The previously deprecated ``qubits()`` and ``clbits()`` methods on the :class:`~qiskit.dagcircuit.DAGCircuit` class, which were deprecated in the 0.15.0 Terra release, have been removed. Instead you should use the :attr:`~qiskit.dagcircuit.DAGCircuit.qubits` and :attr:`~qiskit.dagcircuit.DAGCircuit.clbits` attributes of the :class:`~qiskit.dagcircuit.DAGCircuit` class. For example, if you were running::
ta_in: 0.15.0 டெர்ரா வெளியீட்டில் நீக்கப்பட்ட:class: `~ qiskit.dagcircuit.DAGCircuit` வகுப்பு, முன்னர் நீக்கப்பட்ட``qubits()` `மற்றும் ``clbits()` `முறைகள் நீக்கப்பட்டன. அதற்கு பதிலாக நீங்கள் :attr: `~ qiskit.dagcircuit.DAGCircuit.qubits` மற்றும் :attr:` ~ qiskit.dagcircuit.DAGCircuit.clbits` இன் பண்புக்கூறுகள் :class: `~ qiskit.dagcircuit.DAGCircuit` வகுப்பைப் பயன்படுத்த வேண்டும். உதாரணமாக, நீங்கள் இயங்கினால் ::

source: That would be replaced by::
ta_in: அது மாற்றப்படும்::

source: The :class:`~qiskit.providers.models.PulseDefaults` returned by the fake pulse backends :py:class:`qiskit.test.mock.FakeOpenPulse2Q` and :py:class:`qiskit.test.mock.FakeOpenPulse3Q` have been updated to have more realistic pulse sequence definitions. If you are using these fake backend classes you may need to update your usage because of these changes.
ta_in: :class: `~ qiskit.providers.models.PulseDefaults` போலி துடிப்பு பின்தளத்தில் திரும்பியது :py: class:` qiskit.test.mock.FakeOpenPulse2Q` மற்றும் :py: class: `qiskit.test.mock.FakeOpenPulse3Q` மிகவும் யதார்த்தமான துடிப்பு வரிசை வரையறைகளைக் கொண்டதாக புதுப்பிக்கப்பட்டது. நீங்கள் இந்த போலி பின்தளத்தில் வகுப்புகளைப் பயன்படுத்துகிறீர்கள் என்றால், இந்த மாற்றங்கள் காரணமாக உங்கள் பயன்பாட்டைப் புதுப்பிக்க வேண்டியிருக்கும்.

source: The default synthesis method used by :func:`~qiskit.quantum_info.decompose_clifford` function in the :mod:`~qiskit.quantum_info` module (which gets used internally by the :meth:`qiskit.quantum_info.Clifford.to_circuit` method) for more than 3 qubits now uses a non-optimal greedy compilation routine for Clifford elements synthesis, by Bravyi et. al., which typically yields better CX cost compared to the old default. If you need to revert to the previous Aaronson-Gottesman method this can be done by setting ``method='AG'``.
ta_in: இயல்புநிலை தொகுப்பு முறை :func: `~ qiskit.quantum_info.decompose_clifford` இன் செயல்பாடு :mod:` ~ qiskit.quantum_info` தொகுதி (இது உள்நாட்டில் பயன்படுத்தப்படுகிறது :meth: `qiskit.quantum_info.Clifford.to_circuit` முறை ) 3 க்கும் மேற்பட்ட வினாடிகளுக்கு இப்போது பிராவி எட் எழுதிய கிளிஃபோர்ட் கூறுகளின் தொகுப்புக்கான உகந்த பேராசை இல்லாத தொகுப்பு வழக்கத்தைப் பயன்படுத்துகிறது. அல்., இது பழைய இயல்புநிலையுடன் ஒப்பிடும்போது சிறந்த சிஎக்ஸ் செலவை அளிக்கிறது. முந்தைய ஆரோன்சன்-கோட்டெஸ்மேன் முறைக்கு நீங்கள் திரும்ப வேண்டுமானால், `` method='AG'`` அமைப்பதன் மூலம் இதைச் செய்யலாம்.

source: The previously deprecated module ``qiskit.visualization.interactive``, which was deprecated in the 0.15.0 release, has now been removed. Instead you should use the matplotlib based visualizations:
ta_in: 0.15.0 வெளியீட்டில் நீக்கப்பட்ட முன்னர் நீக்கப்பட்ட தொகுதி `` qiskit.visualization.interactive`` இப்போது அகற்றப்பட்டது. அதற்கு பதிலாக நீங்கள் matplotlib அடிப்படையிலான காட்சிப்படுத்தல்களைப் பயன்படுத்த வேண்டும்:

source: Removed Interactive function
ta_in: நீக்கப்பட்ட உரையாடும் செயல்பாடு

source: Equivalent matplotlib function
ta_in: சமமான மேட்லோட்லிப் செயல்பாடு

source: The ``qiskit.Aer`` and ``qiskit.IBMQ`` top level attributes are now lazy loaded. This means that the objects will now always exist and warnings will no longer be raised on import if ``qiskit-aer`` or ``qiskit-ibmq-provider`` are not installed (or can't be found by Python). If you were checking for the presence of ``qiskit-aer`` or ``qiskit-ibmq-provider`` using these module attributes and explicitly comparing to ``None`` or looking for the absence of the attribute this no longer will work because they are always defined as an object now. In other words running something like::
ta_in: `` Qiskit.Aer`` மற்றும் `` qiskit.IBMQ`` ஆகியவற்றின் உயர் மட்ட பண்புக்கூறுகள் இப்போது சோம்பேறியாக ஏற்றப்பட்டுள்ளன. இதன் பொருள், பொருள்கள் எப்போதுமே எப்போதும் இருக்கும், மேலும் ``qiskit-aer`` அல்லது `` qiskit-ibmq-provider`` நிறுவப்படாவிட்டால் (அல்லது பைத்தானால் கண்டுபிடிக்க முடியாது) எச்சரிக்கைகள் இனி இறக்குமதி செய்யப்படாது. இந்த தொகுதி பண்புகளைப் பயன்படுத்தி ``qiskit-aer`` அல்லது ``qiskit-ibmq-provider`` இருப்பதை நீங்கள் சோதித்துப் பார்த்தால், ``None`` என்று வெளிப்படையாக ஒப்பிட்டுப் பார்த்தால் அல்லது பண்பு இல்லாததைத் தேடுகிறீர்கள் வேலை எப்போதும் அவை எப்போதும் ஒரு பொருளாக வரையறுக்கப்படுவதால். வேறு வார்த்தைகளில் கூறுவதானால்::
