Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: The :class:`~qiskit.transpiler.passes.CommutativeCancellation` transpiler pass has a new optional kwarg on the constructor ``basis_gates``, which takes the a list of the names of basis gates for the target backend. When specified the pass will only use gates in the ``basis_gates`` kwarg. Previously, the pass would automatically replace consecutive gates which commute with :class:`~qiskit.circuit.library.ZGate` with the :class:`~qiskit.circuit.library.U1Gate` unconditionally. The ``basis_gates`` kwarg enables you to specify which z-rotation gates are present in the target basis to avoid this.
ta_in: :class: `~ qiskit.transpiler.passes.CommutativeCancellation` டிரான்ஸ்பைலர் பாஸில் கட்டமைப்பாளரின் ``basis_gates`` இல் ஒரு புதிய விருப்ப குவார்க் உள்ளது, இது இலக்கு பின்தளத்தில் அடிப்படை வாயில்களின் பெயர்களின் பட்டியலை எடுக்கும். குறிப்பிடப்பட்டால், பாஸ் ``basis_gates`` குவார்க்கில் மட்டுமே வாயில்களைப் பயன்படுத்தும். முன்னதாக, பாஸ் தானாகவே தொடர்ச்சியான வகுப்புகளை மாற்றும்:class: `~ qiskit.circuit.library.ZGate` உடன்:class:` ~ qiskit.circuit.library.U1Gate` உடன் நிபந்தனையின்றி. இதைத் தவிர்ப்பதற்காக இலக்கு அடிப்படையில் எந்த z- சுழற்சி வாயில்கள் உள்ளன என்பதைக் குறிப்பிட ``basis_gates`` குவார்க் உங்களுக்கு உதவுகிறது.

source: The constructors of the :class:`~qiskit.circuit.Bit` class and subclasses, :class:`~qiskit.circuit.Qubit`, :class:`~qiskit.circuit.Clbit`, and :class:`~qiskit.circuit.AncillaQubit`, have been updated such that their two parameters, ``register`` and ``index`` are now optional. This enables the creation of bit objects that are independent of a register.
ta_in: வகுப்பின் கட்டமைப்பாளர்கள்:class:`~ qiskit.circuit.Bit` வகுப்பு மற்றும் துணைப்பிரிவுகள் ,:class:` ~ qiskit.circuit.Qubit` ,:class: `~ qiskit.circuit.Clbit`, மற்றும்:class:` ~ qiskit .circuit.AncillaQubit`, அவற்றின் இரண்டு அளவுருக்கள், `` register`` மற்றும் `` index`` ஆகியவை இப்போது விருப்பமானவை. இது ஒரு பதிவேட்டில் இருந்து சுயாதீனமான பிட் பொருள்களை உருவாக்க உதவுகிறது.

source: A new class, :class:`~qiskit.circuit.classicalfunction.BooleanExpression`, has been added to the :mod:`qiskit.circuit.classicalfunction` module. This class allows for creating an oracle from a Python boolean expression. For example:
ta_in: ஒரு புதிய வகுப்பு ,:class: `~ qiskit.circuit.classicalfunction.BooleanExpression`, இதில் சேர்க்கப்பட்டுள்ளது:mod:` qiskit.circuit.classicalfunction` தொகுதிக்கு. இந்த வகுப்பு பைதான் பூலியன் வெளிப்பாட்டிலிருந்து ஒரு ஆரக்கிளை உருவாக்க அனுமதிக்கிறது. உதாரணத்திற்கு:

source: The :class:`~qiskit.circuit.classicalfunction.BooleanExpression` also includes a method, :meth:`~qiskit.circuit.classicalfunction.BooleanExpression.from_dimacs_file`, which allows loading formulas described in the `DIMACS-CNF <https://people.sc.fsu.edu/~jburkardt/data/cnf/cnf.html>`__ format. For example:
ta_in: :class: `~ qiskit.circuit.classicalfunction.BooleanExpression` இல் ஒரு முறையும் அடங்கும், :meth:`~qiskit.circuit.classicalfunction.BooleanExpression.from_dimacs_file` இது `DIMACS-CNF <https://people.sc.fsu.edu/~jburkardt/data/cnf/cnf.html>` __ வடிவத்தில் விவரிக்கப்பட்டுள்ள சூத்திரங்களை ஏற்ற அனுமதிக்கிறது. உதாரணத்திற்கு:

source: Added a new class, :class:`~qiskit.circuit.library.PhaseOracle`, has been added to the :mod:`qiskit.circuit.library` module. This class enables the construction of phase oracle circuits from Python boolean expressions.
ta_in: ஒரு புதிய வகுப்பைச் சேர்த்தது ,:class: `~ qiskit.circuit.library.PhaseOracle`,:mod:` qiskit.circuit.library` தொகுதிக்கு சேர்க்கப்பட்டுள்ளது. இந்த வகுப்பு பைதான் பூலியன் வெளிப்பாடுகளிலிருந்து கட்ட ஆரக்கிள் சுற்றுகளை உருவாக்க உதவுகிறது.

source: These phase oracles can be used as part of a larger algorithm, for example with :class:`qiskit.algorithms.AmplificationProblem`:
ta_in: இந்த கட்ட ஆரக்கிள்களை ஒரு பெரிய வழிமுறையின் ஒரு பகுதியாகப் பயன்படுத்தலாம், எடுத்துக்காட்டாக:class: `qiskit.algorithms.AmplificationProblem`:

source: The :class:`~qiskit.circuit.library.PhaseOracle` class also includes a :meth:`~qiskit.circuit.library.PhaseOracle.from_dimacs_file` method which enables constructing a phase oracle from a file describing a formula in the `DIMACS-CNF <https://people.sc.fsu.edu/~jburkardt/data/cnf/cnf.html>`__ format.
ta_in: :class: `~ qiskit.circuit.library.PhaseOracle` வகுப்பிலும் ஒரு:meth:`~ qiskit.circuit.library.PhaseOracle.from_dimacs_file` முறையும் அடங்கும், இது `DIMACS இல் உள்ள ஒரு சூத்திரத்தை விவரிக்கும் கோப்பிலிருந்து ஒரு கட்ட ஆரக்கிளை உருவாக்க உதவுகிறது. -CNF <https://people.sc.fsu.edu/~jburkardt/data/cnf/cnf.html> `__ வடிவம்.

source: All transpiler passes (ie any instances of :class:`~qiskit.transpiler.BasePass`) are now directly callable. Calling a pass provides a convenient interface for running the pass on a :class:`~qiskit.circuit.QuantumCircuit` object.
ta_in: அனைத்து டிரான்ஸ்பைலர் பாஸ்கள் (அதாவது எந்தவொரு நிகழ்வுகளும் :class:` ~qiskit.transpiler.BasePass`) இப்போது நேரடியாக அழைக்கப்படுகின்றன. பாஸை அழைப்பது ஒரு: வகுப்பில் பாஸை இயக்க வசதியான இடைமுகத்தை வழங்குகிறது :class: `~ qiskit.circuit.QuantumCircuit` பொருள்.

source: For example, running a single transformation pass, such as :class:`~qiskit.transpiler.passes.BasisTranslator`, can be done with:
ta_in: எடுத்துக்காட்டாக,:class: `~ qiskit.transpiler.passes.BasisTranslator` போன்ற ஒற்றை உருமாற்ற பாஸை இயக்குவது:

source: When running an analysis pass, a property set (as ``dict`` or as :class:`~qiskit.transpiler.PropertySet`) needs to be added as a parameter and it might be modified "in-place". For example:
ta_in: பகுப்பாய்வு பாஸை இயக்கும்போது, ​​ஒரு சொத்து தொகுப்பு (``dict`` அல்லது:class: `~ qiskit.transpiler.PropertySet`) ஒரு அளவுருவாக சேர்க்கப்பட வேண்டும், மேலும் அது"in-place". உதாரணத்திற்கு:

source: The :class:`~qiskit.qobj.QasmQobjConfig` class now has an optional kwarg for ``meas_level`` and ``meas_return``. These fields can be used to enable generating :class:`~qiskit.qobj.QasmQobj` job payloads that support ``meas_level=1`` (kerneled data) for circuit jobs (previously this was only exposed for :class:`~qiskit.qobj.PulseQobj` objects). The :func:`~qiskit.compiler.assemble` function has been updated to set this field for :class:`~qiskit.qobj.QasmQobj` objects it generates.
ta_in: :class: `~ qiskit.qobj.QasmQobjConfig` வகுப்பில் இப்போது ``meas_level`` மற்றும் ``meas_return`` ஆகியவற்றுக்கான விருப்பமான குவார்க் உள்ளது. மின்சுற்றலை இயக்க இந்த புலங்கள் பயன்படுத்தப்படலாம்:class: `~qiskit.qobj.QasmQobj` வேலை வேலைகள் ``meas_level=1`` (கர்னல் தரவு) சுற்று வேலைகளுக்கு (முன்பு இது அம்பலப்படுத்தப்பட்டது:class:`qiskit.qobj.PulseQobj` பொருள்கள்). இந்த புலம்:class: `~ qiskit.qobj.QasmQobj அது உருவாக்கும் பொருள்களை அமைப்பதற்காக:func:` ~ qiskit.compiler.assemble` செயல்பாடு புதுப்பிக்கப்பட்டுள்ளது.

source: A new :meth:`~qiskit.circuit.QuantumCircuit.tensor` method has been added to the :class:`~qiskit.circuit.QuantumCircuit` class. This method enables tensoring another circuit with an existing circuit. This method works analogously to :meth:`qiskit.quantum_info.Operator.tensor` and is consistent with the little-endian convention of Qiskit.
ta_in: ஒரு புதிய:meth: `~ qiskit.circuit.QuantumCircuit.tensor` முறை: வகுப்பில் சேர்க்கப்பட்டுள்ளது :class:` ~ qiskit.circuit.QuantumCircuit` வகுப்பில். இந்த முறை ஏற்கனவே இருக்கும் சுற்றுடன் மற்றொரு சுற்றுக்கு டென்சார் செய்ய உதவுகிறது. இந்த முறை இதற்கு ஒத்ததாக செயல்படுகிறது:meth: `qiskit.quantum_info.Operator.tensor` மற்றும் இது Qiskit டின் சிறிய-எண்டியன் மாநாட்டோடு ஒத்துப்போகிறது.

source: The :class:`qiskit.circuit.QuantumCircuit` class now supports arbitrary free form metadata with the :attr:`~qiskit.circuit.QuantumCircuit.metadata` attribute. A user (or program built on top of :class:`~qiskit.circuit.QuantumCircuit`) can attach metadata to a circuit for use in tracking the circuit. For example::
ta_in: :class: `qiskit.circuit.QuantumCircuit` வகுப்பு இப்போது தன்னிச்சையான இலவச படிவ மெட்டாடேட்டாவை ஆதரிக்கிறது:attr:` ~ qiskit.circuit.QuantumCircuit.metadata` பண்புக்கூறு. ஒரு பயனர் (அல்லது நிரல்:class: `~ qiskit.circuit.QuantumCircuit`) கட்டமைக்கப்பட்ட மெட்டாடேட்டாவை ஒரு சுற்றுக்கு இணைக்க முடியும். உதாரணத்திற்கு::

source: or::
ta_in: அல்லது::

source: This metadata will **not** be used for influencing the execution of the circuit but is just used for tracking the circuit for the lifetime of the object. The ``metadata`` attribute will persist between any circuit transforms including :func:`~qiskit.compiler.transpile` and :func:`~qiskit.compiler.assemble`. The expectation is for providers to associate the metadata in the result it returns, so that users can filter results based on circuit metadata the same way they can currently do with ``QuantumCircuit.name``.
ta_in: இந்த மெட்டாடேட்டா ** சுற்றுவட்டத்தின் செயல்பாட்டை பாதிக்க ** பயன்படுத்தப்படாது, ஆனால் பொருளின் வாழ்நாளில் சுற்று கண்காணிக்க பயன்படுத்தப்படுகிறது. `` மெட்டாடேட்டா`` பண்புக்கூறு எந்தவொரு சுற்று மாற்றங்களுக்கும் இடையில் நீடிக்கும்:func: `~ qiskit.compiler.transpile` மற்றும்:func:` ~ qiskit.compiler.assemble`. மெட்டாடேட்டாவைத் தரும் முடிவில் வழங்குநர்கள் அதை இணைப்பதே எதிர்பார்ப்பு, இதனால் பயனர்கள் சர்க்யூட் மெட்டாடேட்டாவின் அடிப்படையில் முடிவுகளை ``QuantumCircuit.name`` உடன் தற்போது செய்யக்கூடிய வழியில் வடிகட்டலாம்.

source: Add a new operator class :class:`~qiskit.quantum_info.CNOTDihedral` has been added to the :mod:`qiskit.quantum_info` module. This class is used to represent the CNOT-Dihedral group, which is generated by the quantum gates :class:`~qiskit.circuit.library.CXGate`, :class:`~qiskit.circuit.library.TGate`, and :class:`~qiskit.circuit.library.XGate`.
ta_in: ஒரு புதிய ஆபரேட்டர் வகுப்பைச் சேர்க்கவும்:class: `~ qiskit.quantum_info.CNOTDihedral` :mod:` qiskit.quantum_info` தொகுதிக்கு சேர்க்கப்பட்டுள்ளது. குவாண்டம் வாயில்களால் உருவாக்கப்படும் சி.என்.ஓ.டி-டைஹெட்ரல் குழுவைக் குறிக்க இந்த வகுப்பு பயன்படுத்தப்படுகிறது:class: `~ qiskit.circuit.library.CXGate` ,:class:` ~ qiskit.circuit.library.TGate`, மற்றும்:class: `~ qiskit.circuit.library.XGate`.

source: Adds a ``&`` (``__and__``) binary operator to ``BaseOperator`` subclasses (eg :class:`qiskit.quantum_info.Operator`) in the :mod:`qiskit.quantum_info` module. This is shorthand to call the classes :meth:`~qiskit.quantum_info.Operator.compose` method (ie ``A & B == A.compose(B)``).
ta_in: ஒரு `` & `` (``__and__``) பைனரி ஆபரேட்டரை ``BaseOperator`` துணைப்பிரிவுகளில் (எ.கா.:class: `qiskit.quantum_info.Operator`):mod:` qiskit.quantum_info` தொகுதியில் சேர்க்கிறது. வகுப்புகளை அழைப்பதற்கான சுருக்கெழுத்து இது:meth: `~ qiskit.quantum_info.Operator.compose` முறை (அதாவது` `A & B == A.compose (B)` `).

source: Adds a ``&`` (``__and__``) binary operator to :class:`qiskit.quantum_info.Statevector` and :class:`qiskit.quantum_info.DensityMatrix` classes. This is shorthand to call the classes :meth:`~qiskit.quantum_info.Statevector.evolve` method (ie ``psi & U == psi.evolve(U)``).
ta_in: `` & `` (`` __and__``) பைனரி ஆபரேட்டரைச் சேர்க்கிறது :class: `qiskit.quantum_info.Statevector` மற்றும் :class:` qiskit.quantum_info.DensityMatrix` வகுப்புகள். வகுப்புகளை அழைக்க இது சுருக்கெழுத்து:meth: `~ qiskit.quantum_info.Statevector.evolve` முறை (அதாவது ``psi & U == psi.evolve (U)``).

source: A new a new 2-qubit gate, :class:`~qiskit.circuit.library.ECRGate`, the echo cross-resonance (ECR), has been added to the :mod:`qiskit.circuit.library` module along with a corresponding method, :meth:`~qiskit.circuit.QuantumCircuit.ecr` for the :class:`~qiskit.circuit.QuantumCircuit` class. The ECR gate is two :math:`CR(\frac{π}{4})` pulses with an :class:`~qiskit.circuit.library.XGate` between them for the echo. This gate is locally equivalent to a :class:`~qiskit.circuit.library.CXGate` (can convert to a CNOT with local pre- or post-rotation). It is the native gate on current IBM hardware and compiling to it allows the pre-/post-rotations to be merged into the rest of the circuit.
ta_in: ஒரு புதிய 2-குவிட் கேட் ,:class: `~ qiskit.circuit.library.ECRGate`, எதிரொலி குறுக்கு-அதிர்வு (ECR), இதில் சேர்க்கப்பட்டுள்ளது:mod:` qiskit.circuit.library` தொகுதிக்கு ஒரு தொடர்புடைய முறை ,:meth: `~ qiskit.circuit.QuantumCircuit.ecr`:class:` ~ qiskit.circuit.QuantumCircuit` வகுப்புக்கு. ECR கேட் இரண்டு:math: `CR(\frac{π}{4})` பருப்பு வகைகள்:class: `~ qiskit.circuit.library.XGate` அவற்றுக்கு இடையில் எதிரொலி. இந்த வாயில் உள்நாட்டில் ஒரு: வகுப்பிற்கு சமம் :class: `~ qiskit.circuit.library.CXGate` (உள்ளூர் முன் அல்லது பிந்தைய சுழற்சியுடன் CNOT ஆக மாற்றலாம்). இது தற்போதைய ஐபிஎம் வன்பொருளில் உள்ள சொந்த வாயில் மற்றும் அதை தொகுப்பது முந்தைய / பிந்தைய சுழற்சிகளை மீதமுள்ள சுற்றுடன் இணைக்க அனுமதிக்கிறது.

source: A new kwarg ``approximation_degree`` has been added to the :func:`~qiskit.compiler.transpile` function for enabling approximate compilation. Valid values range from 0 to 1, and higher means less approximation. This is a heuristic dial to experiment with circuit approximations. The concrete interpretation of this number is left to each pass, which may use it to perform some approximate version of the pass. Specific examples include the :class:`~qiskit.transpiler.passes.UnitarySynthesis` pass or the or translators to discrete gate sets. If a pass does not support this option, it implies exact transformation.
ta_in: தோராயமான தொகுப்பை இயக்குவதற்கான ஒரு புதிய குவார்க் ``approximation_degree``:func: `~ qiskit.compiler.transpile` செயல்பாட்டில் சேர்க்கப்பட்டுள்ளது. செல்லுபடியாகும் மதிப்புகள் 0 முதல் 1 வரை இருக்கும், மேலும் உயர்ந்தது குறைவான தோராயமாகும். சுற்று தோராயங்களை பரிசோதிக்க இது ஒரு ஹூரிஸ்டிக் டயல். இந்த எண்ணின் உறுதியான விளக்கம் ஒவ்வொரு பாஸிலும் விடப்படுகிறது, இது பாஸின் தோராயமான பதிப்பைச் செய்ய அதைப் பயன்படுத்தலாம். குறிப்பிட்ட எடுத்துக்காட்டுகளில்:class: `~ qiskit.transpiler.passes.UnitarySynthesis` பாஸ் அல்லது தனித்தனி கேட் செட்களுக்கான மொழிபெயர்ப்பாளர்கள். ஒரு பாஸ் இந்த விருப்பத்தை ஆதரிக்கவில்லை என்றால், அது சரியான மாற்றத்தைக் குறிக்கிறது.

source: Two new transpiler passess, :class:`~qiskit.transpiler.passes.GateDirection` and :class:`qiskit.transpiler.passes.CheckGateDirection`, were added to the :mod:`qiskit.transpiler.passes` module. These new passes are inteded to be more general replacements for :class:`~qiskit.transpiler.passes.CXDirection` and :class:`~qiskit.transpiler.passes.CheckCXDirection` (which are both now deprecated, see the deprecation notes for more details) that perform the same function but work with other gates beside just :class:`~qiskit.circuit.library.CXGate`.
ta_in: இரண்டு புதிய டிரான்ஸ்பைலர் பாஸஸ் ,:class: `~ qiskit.transpiler.passes.GateDirection` மற்றும்:class:` qiskit.transpiler.passes.CheckGateDirection`, ஆகியவை:mod: `qiskit.transpiler.passes` தொகுதிக்கு சேர்க்கப்பட்டன. இந்த புதிய பாஸ்கள் இன்னும் பொதுவான மாற்றாக இருக்க வேண்டும்:class: `~ qiskit.transpiler.passes.CXDirection` மற்றும்:class:` ~ qiskit.transpiler.passes.CheckCXDirection` (இவை இரண்டும் இப்போது நீக்கப்பட்டன, அதற்கான நீக்குதல் குறிப்புகளைப் பார்க்கவும் மேலும் விவரங்கள்) ஒரே செயல்பாட்டைச் செய்கின்றன, ஆனால் அருகிலுள்ள மற்ற வாயில்களுடன் வேலை செய்கின்றன :class: `~ qiskit.circuit.library.CXGate`.

source: When running on Windows, parallel execution with the :func:`~qiskit.tools.parallel_map` function can now be enabled (it is still disabled by default). To do this you can either set ``parallel = True`` in a user config file, or set the ``QISKIT_PARALLEL`` environment variable to ``TRUE`` (this will also effect :func:`~qiskit.compiler.transpile` and :func:`~qiskit.compiler.assemble` which both use :func:`~qiskit.tools.parallel_map` internally). It is important to note that when enabling parallelism on Windows there are limitations around how Python launches processes for Windows, see the Known Issues section below for more details on the limitations with parallel execution on Windows.
ta_in: விண்டோஸ் இயங்கும் போது, இணை செயலாக்கம் :func:'~qiskit.tools.parallel_map' செயல்பாடு இப்போது செயல்படுத்த முடியும் (அது இன்னும் இயல்புநிலை முடக்கப்பட்டது). இதைச் செய்ய நீங்கள் ஒரு பயனர் உள்ளமைகோப்பில் 'இணை = உண்மை' என்பதை அமைக்கலாம், அல்லது 'QISKIT_PARALLEL' சுற்றுச்சூழல் மாறியை 'உண்மை' என்று அமைக்கலாம் (இது :func:'~qiskit.compiler.transpile' மற்றும் :func:'~qiskit.compiler.assemble', இவை இரண்டும் உள்நிலையில் பயன்படுத்துகின்றன :func:'~qiskit.tools.parallel_map'). விண்டோஸ் இணைத்தன்மை செயல்படுத்தும் போது பைத்தான் விண்டோஸ் செயல்முறைகள் தொடங்குகிறது எப்படி சுற்றி வரம்புகள் உள்ளன என்பதை கவனத்தில் கொள்ள வேண்டும், விண்டோஸ் இணை செயலாக்கம் வரம்புகள் மேலும் விவரங்களுக்கு கீழே அறியப்பட்ட சிக்கல்கள் பிரிவில் பார்க்க.

source: A new function, :func:`~qiskit.quantum_info.hellinger_distance`, for computing the Hellinger distance between two counts distributions has been added to the :mod:`qiskit.quantum_info` module.
ta_in: ஒரு புதிய செயல்பாடு ,:func: `~ qiskit.quantum_info.hellinger_distance`, இரண்டு எண்ணிக்கையிலான விநியோகங்களுக்கு இடையில் ஹெலிங்கர் தூரத்தை கணக்கிடுவதற்கு:mod:` qiskit.quantum_info` தொகுதிக்கு சேர்க்கப்பட்டுள்ளது.

source: The :func:`~qiskit.quantum_info.decompose_clifford` function in the :mod:`qiskit.quantum_info` module (which gets used internally by the :meth:`qiskit.quantum_info.Clifford.to_circuit` method) has a new kwarg ``method`` which enables selecting the synthesis method used by either setting it to ``'AG'`` or ``'greedy'``. By default for more than three qubits it is set to ``'greedy'`` which uses a non-optimal greedy compilation routine for Clifford elements synthesis, by Bravyi et. al., which typically yields better CX cost compared to the previously used Aaronson-Gottesman method (for more than two qubits). You can use the ``method`` kwarg to revert to the previous default Aaronson-Gottesman method by setting ``method='AG'``.
ta_in: தி:func: `~ qiskit.quantum_info.decompose_clifford` இன் செயல்பாடு:mod:` qiskit.quantum_info` module (இது உள்நாட்டில் பயன்படுத்தப்படுகிறது:meth: `qiskit.quantum_info.Clifford.to_circuit` முறை), இது ``'AG'`` அல்லது` `' greedy'` என அமைப்பதன் மூலம் பயன்படுத்தப்படும் தொகுப்பு முறையைத் தேர்ந்தெடுக்க உதவுகிறது. முன்னிருப்பாக மூன்று வினாடிகளுக்கு மேல் இது `` 'greedy'` என அமைக்கப்பட்டுள்ளது, இது கிளிஃபோர்ட் கூறுகளின் தொகுப்புக்கான உகந்த அல்லாத பேராசை தொகுப்பு வழக்கத்தைப் பயன்படுத்துகிறது, பிராவி மற்றும். அல்., இது முன்னர் பயன்படுத்தப்பட்ட ஆரோன்சன்-கோட்டெஸ்மேன் முறையுடன் ஒப்பிடும்போது சிறந்த சிஎக்ஸ் செலவை அளிக்கிறது (இரண்டு வினாடிகளுக்கு மேல்). ``method=AG`` அமைப்பதன் மூலம் முந்தைய இயல்புநிலை ஆரோன்சன்-கோட்டெஸ்மேன் முறைக்கு மாற்ற ``method`` குவார்க்கைப் பயன்படுத்தலாம்.

source: The :class:`~qiskit.extensions.Initialize` class in the :mod:`qiskit.extensions` module can now be constructed using an integer. The '1' bits of the integer will insert a :class:`~qiskit.circuit.Reset` and an :class:`~qiskit.circuit.library.XGate` into the circuit for the corresponding qubit. This will be done using the standard little-endian convention is qiskit, ie the rightmost bit of the integer will set qubit 0. For example, setting the parameter in :class:`~qiskit.extensions.Initialize` equal to ``5`` will set qubits 0 and 2 to value 1.
ta_in: :class: `~ qiskit.extensions.Inidialize` class in :mod:` qiskit.extensions` தொகுதி இப்போது ஒரு முழு எண்ணைப் பயன்படுத்தி உருவாக்கப்படலாம். முழு எண்ணின் '1' பிட்கள் ஒரு:class: `~ qiskit.circuit.Reset` மற்றும் ஒரு :class:` ~ qiskit.circuit.library.XGate` ஐ தொடர்புடைய குவிட்டிற்கான சுற்றுக்குள் செருகும். நிலையான சிறிய-எண்டியன் மாநாட்டை பயன்படுத்தி இது செய்யப்படும் Qiskit, அதாவது முழு எண்ணின் வலதுபுறம் பிட் 0 ஐ அமைக்கும். எடுத்துக்காட்டாக, அளவுருவை அமைத்தல்:class: `~ qiskit.extensions.`` 5` க்கு சமமாக தொடங்கவும் `மதிப்பு 1 மற்றும் 2 மதிப்புகளை 1 க்கு அமைக்கும்.

source: The :class:`~qiskit.extensions.Initialize` class in the :mod:`qiskit.extensions` module now supports constructing directly from a Pauli label (analogous to the :meth:`qiskit.quantum_info.Statevector.from_label` method). The Pauli label refer to basis states of the Pauli eigenstates Z, X, Y. These labels use Qiskit's standard little-endian notation, for example a label of ``'01'`` would initialize qubit 0 to :math:`|1\rangle` and qubit 1 to :math:`|0\rangle`.
ta_in: :class: `~ qiskit.extensions.Inidialize` வகுப்பில்:mod:` qiskit.extensions` தொகுதி இப்போது ஒரு பவுலி லேபிளிலிருந்து நேரடியாக நிர்மாணிப்பதை ஆதரிக்கிறது (இதற்கு ஒத்த :meth: `qiskit.quantum_info.Statevector.from_label` முறை) . பவுலி லேபிள் பவுலி ஐஜென்ஸ்டேட்ஸ் Z, X, Y இன் அடிப்படை நிலைகளைக் குறிக்கிறது. இந்த லேபிள்கள் கிஸ்கிட்டின் நிலையான சிறிய-எண்டியன் குறியீட்டைப் பயன்படுத்துகின்றன, எடுத்துக்காட்டாக `` '01'` இன் லேபிள் குவிட் 0 ஐ துவக்கும் :math: `|1\rangle` மற்றும் qubit 1 to :math: `| 0 \rangle`.

source: The kwarg, ``template_list``, for the constructor of the :class:`qiskit.transpiler.passes.TemplateOptimization` transpiler pass now supports taking in a list of both :class:`~qiskit.circuit.QuantumCircuit` and :class:`~qiskit.dagcircuit.DAGDependency` objects. Previously, only :class:`~qiskit.circuit.QuantumCircuit` were accepted (which were internally converted to :class:`~qiskit.dagcircuit.DAGDependency` objects) in the input list.
ta_in: :class: `qiskit.transpiler.passes.TemplateOptimization` டிரான்ஸ்பைலர் பாஸ் இப்போது இரண்டின் பட்டியலையும் எடுத்துக்கொள்வதை ஆதரிக்கிறது:class:` ~ qiskit.circuit.QuantumCircuit` மற்றும் :class: `~ qiskit.dagcircuit.DAGDependency` பொருள்கள். முன்னதாக, மட்டும்:class: `~ qiskit.circuit.QuantumCircuit` ஏற்றுக்கொள்ளப்பட்டது (அவை உள்நாட்டில் மாற்றப்பட்டன:class:` ~ qiskit.dagcircuit.DAGDependency` பொருள்கள்) உள்ளீட்டு பட்டியலில்.

source: A new transpiler pass, :py:class:`qiskit.transpiler.passes.RZXCalibrationBuilder`, capable of generating calibrations and adding them to a quantum circuit has been introduced. This pass takes calibrated :class:`~qiskit.circuit.library.CXGate` objects and creates the calibrations for :class:`qiskit.circuit.library.RZXGate` objects with an arbitrary rotation angle. The schedules are created by stretching and compressing the :class:`~qiskit.pulse.GaussianSquare` pulses of the echoed-cross resonance gates.
ta_in: ஒரு புதிய டிரான்ஸ்பைலர் பாஸ் ,: py:class: `qiskit.transpiler.passes.RZXCalibrationBuilder`, அளவுத்திருத்தங்களை உருவாக்கி அவற்றை ஒரு குவாண்டம் சுற்றுக்குச் சேர்க்கும் திறன் அறிமுகப்படுத்தப்பட்டுள்ளது. இந்த பாஸ் அளவுத்திருத்தத்தை எடுக்கும்:class: `~ qiskit.circuit.library.CXGate` பொருள்கள் மற்றும் அதற்கான அளவுத்திருத்தங்களை உருவாக்குகிறது:class:` qiskit.circuit.library.RZXGate` பொருள்கள் தன்னிச்சையான சுழற்சி கோணத்துடன். வகுப்புகள் :class: `~ qiskit.pulse.GaussianSquare` எதிரொலித்த-குறுக்கு அதிர்வு வாயில்களின் பருப்பு வகைகளை நீட்டி சுருக்கி அட்டவணைகள் உருவாக்கப்படுகின்றன.

source: New template circuits for using :class:`qiskit.circuit.library.RZXGate` are added to the :mod:`qiskit.circuit.library` module (eg :class:`~qiskit.circuit.library.rzx_yz`). This enables pairing the :class:`~qiskit.transpiler.passes.TemplateOptimization` pass with the :py:class:`qiskit.transpiler.passes.RZXCalibrationBuilder` pass to automatically find and replace gate sequences, such as ``CNOT - P(theta) - CNOT``, with more efficent circuits based on :class:`qiskit.circuit.library.RZXGate` with a calibration.
ta_in: பயன்படுத்த புதிய டெம்ப்ளேட் சுற்றுகள்:class: `qiskit.circuit.library.RZXGate` :mod:` qiskit.circuit.library` தொகுதிக்கு (எ.கா.:class: `~qiskit.circuit.library.rzx_yz`) சேர்க்கப்பட்டுள்ளது. இது:class: `~ qiskit.transpiler.passes.TemplateOptimization` உடன்: py:class:` qiskit.transpiler.passes.RZXCalibrationBuilder` பாஸுடன் இணைக்க உதவுகிறது. `` CNOT - P (தீட்டா) - CNOT``, இதன் அடிப்படையில் மிகவும் திறமையான சுற்றுகள்:class: `qiskit.circuit.library.RZXGate` ஒரு அளவுத்திருத்தத்துடன்.
