Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: The ``fold`` field in the ``style`` dict kwarg for the ``qiskit.QuantumCircuit.draw()`` method and the ``qiskit.visualization.circuit_drawer()`` function has been deprecated. It has been replaced by the ``fold`` kwarg on both functions. This kwarg behaves identically to the field in the style dict.
ta_in: "Style" உள்ள "fold" புலம் "qiskit. QuantumCircuit.draw ()'' க்கான kwarg dict முறை மற்றும் "qiskit.visualization.circuit_drawer()'' செயல்பாடு நீக்கப்பட்டுள்ளது. இரண்டு செயல்பாடுகளிலும் ''fold'' க்வார்க் மாற்றப்பட்டுள்ளது.இந்த க்வார்க் stlye dict-ல் துறையில் ஒரு மாதிரி யாக நடந்து.

source: Instructions layering which underlies all types of circuit drawing has changed to address right/left justification. This sometimes results in output which is topologically equivalent to the rendering in prior versions but visually different than previously rendered. Fixes `issue #2802 <https://github.com/Qiskit/qiskit-terra/issues/2802>`_
ta_in: அனைத்து வகையான சர்க்யூட் வரைபடத்திற்கும் அடிப்படையான வழிமுறைகள் அடுக்கு வலது / இடது நியாயப்படுத்தலுக்கு மாற்றப்பட்டுள்ளது. இது சில நேரங்களில் வெளியீட்டில் விளைகிறது, இது முந்தைய பதிப்புகளில் ரெண்டரிங் செய்வதற்கு இடவியல் ரீதியாக சமமானது, ஆனால் முன்னர் வழங்கப்பட்டதை விட பார்வை வித்தியாசமானது. `வெளியீடு # 2802 <https://github.com/Qiskit/qiskit-terra/issues/2802>` _

source: Add ``memory_slots`` to ``QobjExperimentHeader`` of pulse Qobj. This fixes a bug in the data format of ``meas_level=2`` results of pulse experiments. Measured quantum states are returned as a bit string with zero padding based on the number set for ``memory_slots``.
ta_in: துடிப்பு Qobj இன் `` QobjExperimentHeader`` இல் `` மெமரி_ஸ்லாட்டுகளை`` சேர்க்கவும். இது துடிப்பு சோதனைகளின் `` அளவீட்டு_ நிலை = 2`` முடிவுகளின் தரவு வடிவமைப்பில் ஒரு பிழையை சரிசெய்கிறது. அளவிடப்பட்ட குவாண்டம் நிலைகள் `` மெமரி_ஸ்லாட்டுகள்`` க்கு அமைக்கப்பட்ட எண்ணின் அடிப்படையில் பூஜ்ஜிய திணிப்புடன் ஒரு பிட் சரமாகத் திரும்பும்.

source: Fixed the visualization of the rzz gate in the latex circuit drawer to match the cu1 gate to reflect the symmetry in the rzz gate. The fix is based on the cds command of the qcircuit latex package. Fixes `issue #1957 <https://github.com/Qiskit/qiskit-terra/issues/1957>`_
ta_in: Rzz வாயிலில் சமச்சீர்மையை பிரதிபலிக்க cu1 வாயிலுடன் பொருந்துமாறு லேடெக்ஸ் சர்க்யூட் டிராயரில் rzz கேட்டின் காட்சிப்படுத்தல் சரி செய்யப்பட்டது. பிழைத்திருத்தம் qcircuit லேடக்ஸ் தொகுப்பின் cds கட்டளையை அடிப்படையாகக் கொண்டது. `சிக்கல் # 1957 <https://github.com/Qiskit/qiskit-terra/issues/1957>` _

source: ``matplotlib.figure.Figure`` objects returned by visualization functions are no longer always closed by default. Instead the returned figure objects are only closed if the configured matplotlib backend is an inline jupyter backend(either set with ``%matplotlib inline`` or ``%matplotlib notebook``). Output figure objects are still closed with these backends to avoid duplicate outputs in jupyter notebooks (which is why the ``Figure.close()`` were originally added).
ta_in: `` matplotlib.figure.Figure`` காட்சிப்படுத்தல் செயல்பாடுகளால் திரும்பிய பொருள்கள் இனி இயல்பாகவே மூடப்படாது. கட்டமைக்கப்பட்ட மேட்லோட்லிப் பின்தளத்தில் இன்லைன் ஜூபிட்டர் பின்தளத்தில் இருந்தால் (``% மேட்லோட்லிப் இன்லைன்`` அல்லது ``% மேட்லோட்லிப் நோட்புக்`` உடன் அமைக்கப்பட்டால்) திரும்பிய உருவப் பொருள்கள் மூடப்படும். ஜூபிட்டர் நோட்புக்குகளில் நகல் வெளியீடுகளைத் தவிர்ப்பதற்காக வெளியீட்டு எண்ணிக்கை பொருள்கள் இந்த பின்தளத்தில் இன்னும் மூடப்பட்டுள்ளன (அதனால்தான் `` Figure.close () `` முதலில் சேர்க்கப்பட்டது).

source: The 0.9 release includes many new features and many bug fixes. The biggest changes for this release are new debugging capabilities for PassManagers. This includes a function to visualize a PassManager, the ability to add a callback function to a PassManager, and logging of passes run in the PassManager. Additionally, this release standardizes the way that you can set an initial layout for your circuit. So now you can leverage ``initial_layout`` the kwarg parameter on ``qiskit.compiler.transpile()`` and ``qiskit.execute()`` and the qubits in the circuit will get laid out on the desire qubits on the device. Visualization of circuits will now also show this clearly when visualizing a circuit that has been transpiled with a layout.
ta_in: 0.9 வெளியீட்டில் பல புதிய அம்சங்கள் மற்றும் பல பிழைத் திருத்தங்கள் உள்ளன. இந்த வெளியீட்டிற்கான மிகப்பெரிய மாற்றங்கள் பாஸ்மேனேஜர்களுக்கான புதிய பிழைத்திருத்த திறன்கள் ஆகும். பாஸ்மேனேஜரைக் காட்சிப்படுத்துவதற்கான ஒரு செயல்பாடு, பாஸ்மேனேஜருக்கு கால்பேக் செயல்பாட்டைச் சேர்க்கும் திறன் மற்றும் பாஸ்மேனேஜரில் இயங்கும் பாஸ்களின் பதிவு ஆகியவை இதில் அடங்கும். கூடுதலாக, இந்த வெளியீடு உங்கள் சுற்றுக்கான ஆரம்ப தளவமைப்பை அமைக்கும் வழியை தரப்படுத்துகிறது. எனவே இப்போது நீங்கள் `` qiskit.compiler.transpile () `` மற்றும் `` qiskit.execute () `` ஆகியவற்றில் உள்ள `` initial_layout`` குவார்க் அளவுருவைப் பயன்படுத்தலாம், மேலும் சுற்றுகளில் உள்ள குவிட்கள் ஆசை வினாடிகளில் அமைக்கப்படும் சாதனம். ஒரு தளவமைப்புடன் கடத்தப்பட்ட ஒரு சுற்றுவட்டத்தைக் காட்சிப்படுத்தும்போது சுற்றுகளின் காட்சிப்படுத்தல் இப்போது இதை தெளிவாகக் காண்பிக்கும்.

source: A ``DAGCircuit`` object (i.e. the graph representation of a QuantumCircuit where operation dependencies are explicit) can now be visualized with the ``.draw()`` method. This is in line with Qiskit's philosophy of easy visualization. Other objects which support a ``.draw()`` method are ``QuantumCircuit``, ``PassManager``, and ``Schedule``.
ta_in: ஒரு `` DAGCircuit`` பொருள் (அதாவது செயல்பாட்டு சார்புகள் வெளிப்படையாக இருக்கும் ஒரு குவாண்டம் சிர்குட்டின் வரைபட பிரதிநிதித்துவம்) இப்போது ``.draw()`` முறை மூலம் காட்சிப்படுத்தப்படலாம். இது கிஸ்கிட்டின் எளிதான காட்சிப்படுத்தல் தத்துவத்துடன் ஒத்துப்போகிறது. ``.draw()`` முறையை ஆதரிக்கும் பிற பொருள்கள் ``QuantumCircuit``, ``PassManager``, மற்றும் ``Schedule``.

source: Added a new visualization function ``qiskit.visualization.plot_error_map()`` to plot the error map for a given backend. It takes in a backend object from the qiskit-ibmq-provider and will plot the current error map for that device.
ta_in: கொடுக்கப்பட்ட பின்தளத்தில் பிழை வரைபடத்தைத் திட்டமிட புதிய காட்சிப்படுத்தல் செயல்பாடு `` qiskit.visualization.plot_error_map () `` சேர்க்கப்பட்டது. இது qiskit-ibmq- வழங்குநரிடமிருந்து ஒரு பின்தளத்தில் பொருளை எடுக்கும், மேலும் அந்த சாதனத்திற்கான தற்போதைய பிழை வரைபடத்தை உருவாக்கும்.

source: Both ``qiskit.QuantumCircuit.draw()`` and ``qiskit.visualization.circuit_drawer()`` now support annotating the qubits in the visualization with layout information. If the ``QuantumCircuit`` object being drawn includes layout metadata (which is normally only set on the circuit output from ``transpile()`` calls) then by default that layout will be shown on the diagram. This is done for all circuit drawer backends. For example::
ta_in: `` Qiskit.QuantumCircuit.draw () `` மற்றும் `` qiskit.visualization.circuit_drawer () `` இரண்டும் தளவமைப்பு தகவலுடன் காட்சிப்படுத்தலில் உள்ள வினாக்களைக் குறிக்க இப்போது துணைபுரிகின்றன. வரையப்பட்ட ``QuantumCircuit`` பொருள் தளவமைப்பு மெட்டாடேட்டாவை உள்ளடக்கியிருந்தால் (இது வழக்கமாக ``transpile()`` அழைப்புகளிலிருந்து சுற்று வெளியீட்டில் மட்டுமே அமைக்கப்படுகிறது) பின்னர் இயல்பாகவே அந்த தளவமைப்பு வரைபடத்தில் காண்பிக்கப்படும். இது அனைத்து சர்க்யூட் டிராயர் பின்தளத்தில் செய்யப்படுகிறது. உதாரணத்திற்கு::

source: will yield a diagram like::
ta_in: :: போன்ற வரைபடத்தைக் கொடுக்கும்::

source: If you do not want the layout to be shown on transpiled circuits (or any other circuits with a layout set) there is a new boolean kwarg for both functions, ``with_layout`` (which defaults ``True``), which when set ``False`` will disable the layout annotation in the output circuits.
ta_in: இடமாற்றம் செய்யப்பட்ட சுற்றுகளில் (அல்லது தளவமைப்பு தொகுப்பைக் கொண்ட வேறு ஏதேனும் சுற்றுகள்) தளவமைப்பு காண்பிக்கப்பட விரும்பவில்லை எனில், இரண்டு செயல்பாடுகளுக்கும் ஒரு புதிய பூலியன் குவார்க் உள்ளது, `` with_layout`` (இது இயல்புநிலை ``True``), இது எப்போது ``False`` என அமைத்தால் வெளியீட்டு சுற்றுகளில் தளவமைப்பு சிறுகுறிப்பை முடக்கும்.

source: A new analysis pass ``CountOpsLongest`` was added to retrieve the number of operations on the longest path of the DAGCircuit. When used it will add a ``count_ops_longest_path`` key to the property set dictionary. You can add it to your a passmanager with something like::
ta_in: DAGCircuit இன் மிக நீண்ட பாதையில் செயல்படும் எண்ணிக்கையை மீட்டெடுக்க ஒரு புதிய பகுப்பாய்வு பாஸ் `` CountOpsLongest`` சேர்க்கப்பட்டது. பயன்படுத்தும்போது, ​​சொத்து தொகுப்பு அகராதியில் `` count_ops_longest_path`` விசையைச் சேர்க்கும். இதைப் போன்ற ஏதாவது ஒன்றை உங்கள் பாஸ்மேனேஜரில் சேர்க்கலாம்::

source: and then access the longest path via the property set value with something like::
ta_in: பின்னர் சொத்து தொகுப்பு மதிப்பு வழியாக மிக நீண்ட பாதையை அணுகவும்::

source: which will set a condition on that pass based on the longest path.
ta_in: இது மிக நீண்ட பாதையின் அடிப்படையில் அந்த பாஸில் ஒரு நிபந்தனையை அமைக்கும்.

source: Two new functions, ``sech()`` and ``sech_deriv()`` were added to the pulse library module ``qiskit.pulse.pulse_lib`` for creating an unnormalized hyperbolic secant ``SamplePulse`` object and an unnormalized hyperbolic secant derviative ``SamplePulse`` object respectively.
ta_in: இரண்டு புதிய செயல்பாடுகள், `` sech () `` மற்றும் `` sech_deriv () `` துடிப்பு நூலக தொகுதிக்கு `` qiskit.pulse.pulse_lib` அசாதாரணமான ஹைபர்போலிக் செகண்ட் `` சாம்பிள் பல்ஸ்`` பொருள் மற்றும் வழக்கத்திற்கு மாறான ஹைப்பர்போலிக் செகண்ட் டெர்வியேட்டிவ் `` சாம்பிள் பல்ஸ்`` பொருள்களை உருவாக்குவதற்கு.

source: A new kwarg option ``vertical_compression`` was added to the ``QuantumCircuit.draw()`` method and the ``qiskit.visualization.circuit_drawer()`` function. This option only works with the ``text`` backend. This option can be set to either ``high``, ``medium`` (the default), or ``low`` to adjust how much vertical space is used by the output visualization.
ta_in: `` QuantumCircuit.draw () `` முறை மற்றும் `` qiskit.visualization.circuit_drawer () `` செயல்பாட்டில் ஒரு புதிய குவார்க் விருப்பம் `` செங்குத்து_குறிப்பு`` சேர்க்கப்பட்டது. இந்த விருப்பம் `` உரை`` பின்தளத்தில் மட்டுமே செயல்படும். வெளியீட்டு காட்சிப்படுத்தல் மூலம் எவ்வளவு செங்குத்து இடம் பயன்படுத்தப்படுகிறது என்பதை சரிசெய்ய இந்த விருப்பத்தை `` உயர்``, `` நடுத்தர`` (இயல்புநிலை) அல்லது `` குறைந்த`` என அமைக்கலாம்.

source: A new kwarg boolean option ``idle_wires`` was added to the ``QuantumCircuit.draw()`` method and the ``qiskit.visualization.circuit_drawer()`` function. It works for all drawer backends. When ``idle_wires`` is set False in a drawer call the drawer will not draw any bits that do not have any circuit elements in the output quantum circuit visualization.
ta_in: `` QuantumCircuit.draw () `` முறை மற்றும் `` qiskit.visualization.circuit_drawer () `` செயல்பாட்டில் ஒரு புதிய குவார்க் பூலியன் விருப்பம் `` idle_wires`` சேர்க்கப்பட்டது. இது அனைத்து அலமாரியின் பின்தளத்தில் வேலை செய்கிறது. `` ஐட்லி_வைர்ஸ்`` ஒரு டிராயரில் தவறாக அமைக்கப்பட்டால், டிராயர் வெளியீட்டு குவாண்டம் சர்க்யூட் காட்சிப்படுத்தலில் எந்த சுற்று கூறுகளும் இல்லாத எந்த பிட்களையும் வரையாது.

source: A new PassManager visualizer function ``qiskit.visualization.pass_mamanger_drawer()`` was added. This function takes in a PassManager object and will generate a flow control diagram of all the passes run in the PassManager.
ta_in: புதிய பாஸ்மேனேஜர் விஷுவலைசர் செயல்பாடு `` qiskit.visualization.pass_mamanger_drawer () `` சேர்க்கப்பட்டது. இந்த செயல்பாடு ஒரு பாஸ்மேனேஜர் பொருளில் எடுக்கும் மற்றும் பாஸ்மேனேஜரில் இயங்கும் அனைத்து பாஸ்களின் ஓட்ட கட்டுப்பாட்டு வரைபடத்தையும் உருவாக்கும்.

source: When creating a PassManager you can now specify a callback function that if specified will be run after each pass is executed. This function gets passed a set of kwargs on each call with the state of the pass manager after each pass execution. Currently these kwargs are:
ta_in: ஒரு பாஸ்மேனேஜரை உருவாக்கும்போது, ஒவ்வொரு பாஸும் செயல்படுத்தப்பட்ட பின் குறிப்பிடப்பட்டால் இயக்கப்படும் என்று ஒரு அழைப்பு செயல்பாட்டைக் குறிப்பிடலாம். இந்த செயல்பாடு ஒவ்வொரு அழைப்பிலும் ஒவ்வொரு பாஸ் மரணதண்டனைக்குப் பிறகு பாஸ் மேலாளரின் நிலையுடன் ஒரு குவார்க் தொகுப்பை அனுப்பும். தற்போது இந்த குவார்க்குகள்:

source: ``pass_`` (``Pass``): the pass being run
ta_in: ``pass_`` (``Pass``): பாஸ் இயக்கப்படுகிறது

source: ``dag`` (``DAGCircuit``): the dag output of the pass
ta_in: ` ` dag ` ` ` (` DAGCircuit ` `): பாட்டின் dag வெளியீடு

source: ``time`` (``float``): the time to execute the pass
ta_in: ``time`` (``float``): பாஸை இயக்க நேரம்

source: ``property_set`` (``PropertySet``): the property set
ta_in: ``property_set`` (``PropertySet``): சொத்து தொகுப்பு

source: ``count`` (``int``): the index for the pass execution
ta_in: ``count`` (``int``): பாஸ் செயல்படுத்தலுக்கான குறியீடு

source: However, it's worth noting that while these arguments are set for the 0.9 release they expose the internals of the pass manager and are subject to change in future release.
ta_in: இருப்பினும், இந்த வாதங்கள் 0.9 வெளியீட்டிற்கு அமைக்கப்பட்டிருக்கும்போது அவை பாஸ் மேலாளரின் உள்ளகங்களை அம்பலப்படுத்துகின்றன மற்றும் எதிர்கால வெளியீட்டில் மாற்றத்திற்கு உட்பட்டுள்ளன என்பது கவனிக்கத்தக்கது.

source: For example you can use this to create a callback function that will visualize the circuit output after each pass is executed::
ta_in: எடுத்துக்காட்டாக, ஒரு அழைப்பு செயல்பாட்டை உருவாக்க இதைப் பயன்படுத்தலாம், இது ஒவ்வொரு பாஸும் செயல்படுத்தப்பட்ட பின் சுற்று வெளியீட்டைக் காண்பிக்கும்::

source: Additionally you can specify the callback function when using ``qiskit.compiler.transpile()``::
ta_in: கூடுதலாக ``qiskit.compiler.transpile () ``:: ஐப் பயன்படுத்தும் போது நீங்கள் திரும்ப அழைக்கும் செயல்பாட்டைக் குறிப்பிடலாம்::

source: A new method ``filter()`` was added to the ``qiskit.pulse.Schedule`` class. This enables filtering the instructions in a schedule. For example, filtering by instruction type::
ta_in: ``Qiskit.pulse.Schedule`` வகுப்பில் ஒரு புதிய முறை ``filter() `` சேர்க்கப்பட்டது. இது ஒரு அட்டவணையில் வழிமுறைகளை வடிகட்ட உதவுகிறது. எடுத்துக்காட்டாக, அறிவுறுத்தல் வகை மூலம் வடிகட்டுதல்::

source: Additional decomposition methods for several types of gates. These methods will use different decomposition techniques to break down a gate into a sequence of CNOTs and single qubit gates. The following methods are added:
ta_in: பல வகையான கேட்களுக்கான கூடுதல் சிதைவு முறைகள். இந்த முறைகள் சி. என். ஓ. டி மற்றும் ஒற்றை குவிட் வாயில்களின் வரிசையாக ஒரு கேடை உடைக்க வெவ்வேறு சிதைவு நுட்பங்களைப் பயன்படுத்தும். பின்வரும் முறைகள் சேர்க்கப்பட்டுள்ளன:

source: Method
ta_in: முறை

source: Description
ta_in: விளக்கம்

source: Add an arbitrary isometry from m to n qubits to a circuit. This allows for attaching arbitrary unitaries on n qubits (m=n) or to prepare any state of n qubits (m=0)
ta_in: ஒரு சுற்றுக்கு m முதல் n qubits வரை தன்னிச்சையான ஐசோமெட்ரியைச் சேர்க்கவும். இது n குவிட்களில் (m = n) தன்னிச்சையான யூனிடரிகளை இணைக்க அல்லது n குவிட்களின் எந்த நிலையையும் (m = 0) தயாரிக்க அனுமதிக்கிறது

source: Add a diagonal gate to the circuit
ta_in: சுற்றுக்கு ஒரு மூலைவிட்ட வாயில் சேர்க்கவும்

source: Decompose an arbitrary 2x2 unitary into three rotation gates and add to a circuit
ta_in: ஒரு தன்னிச்சையான 2x2 ஒற்றையை மூன்று சுழற்சி வாயில்களாக சிதைத்து ஒரு சுற்றுக்குச் சேர்க்கவும்

source: Attach an uniformly controlled gate (also called a multiplexed gate) to a circuit
ta_in: ஒரு சுற்றுக்கு ஒரே மாதிரியாக கட்டுப்படுத்தப்பட்ட வாயிலை (மல்டிபிளெக்ஸ் கேட் என்றும் அழைக்கப்படுகிறது) இணைக்கவும்

source: Attach a uniformly controlled (also called multiplexed) Rx rotation gate to a circuit
ta_in: ஒரே மாதிரியாக கட்டுப்படுத்தப்பட்ட (மல்டிபிளெக்ஸ் என்றும் அழைக்கப்படுகிறது) Rx சுழற்சி வாயிலை ஒரு சுற்றுடன் இணைக்கவும்

source: Attach a uniformly controlled (also called multiplexed) Ry rotation gate to a circuit
ta_in: ஒரே மாதிரியாக கட்டுப்படுத்தப்பட்ட (மல்டிபிளெக்ஸ் என்றும் அழைக்கப்படுகிறது) Ry சுழற்சி வாயிலை ஒரு சுற்றுக்கு இணைக்கவும்

source: Attach a uniformly controlled (also called multiplexed) Rz rotation gate to a circuit
ta_in: ஒரே மாதிரியாக கட்டுப்படுத்தப்பட்ட (மல்டிபிளெக்ஸ் என்றும் அழைக்கப்படுகிறது) Rz சுழற்சி வாயிலை ஒரு சுற்றுடன் இணைக்கவும்

source: Addition of Gray-Synth and Patel–Markov–Hayes algorithms for synthesis of CNOT-Phase and CNOT-only linear circuits. These functions allow the synthesis of circuits that consist of only CNOT gates given a linear function or a circuit that consists of only CNOT and phase gates given a matrix description.
ta_in: சி. என். ஓ. டி-கட்டம் மற்றும் சி. என். ஓ. டி-மட்டும் நேரியல் சுற்றுகளின் தொகுப்புக்கான கிரே-சின்த் மற்றும் படேல்-மார்கோவ்-ஹேய்ஸ் வழிமுறைகளைச் சேர்த்தல். இந்த செயல்பாடுகள் ஒரு நேரியல் செயல்பாடு அல்லது சி. என். ஓ. டி மற்றும் மேட்ரிக்ஸ் விளக்கத்தைக் கொடுக்கும் கட்ட கேட்களை மட்டுமே கொண்ட ஒரு சுற்றுக்கு வழங்கப்பட்ட சி. என். ஓ. டி கேட்களை மட்டுமே கொண்ட சுற்றுகளின் தொகுப்பை அனுமதிக்கின்றன.

source: A new function ``random_circuit`` was added to the ``qiskit.circuit.random`` module. This function will generate a random circuit of a specified size by randomly selecting different gates and adding them to the circuit. For example, you can use this to generate a 5-qubit circuit with a depth of 10 using::
ta_in: `` Qiskit.circuit.random`` தொகுதிக்கு ஒரு புதிய செயல்பாடு `` random_circuit`` சேர்க்கப்பட்டது. இந்த செயல்பாடு ஒரு குறிப்பிட்ட அளவின் சீரற்ற சுற்றுகளை தோராயமாக வெவ்வேறு வாயில்களைத் தேர்ந்தெடுத்து அவற்றை சுற்றுக்குச் சேர்ப்பதன் மூலம் உருவாக்கும். எடுத்துக்காட்டாக, இதைப் பயன்படுத்தி 10-ஆழத்துடன் 5-குவிட் சுற்று ஒன்றை உருவாக்க இதைப் பயன்படுத்தலாம்::

source: A new kwarg ``output_names`` was added to the ``qiskit.compiler.transpile()`` function. This kwarg takes in a string or a list of strings and uses those as the value of the circuit name for the output circuits that get returned by the ``transpile()`` call. For example::
ta_in: `` Qiskit.compiler.transpile () `` செயல்பாட்டில் ஒரு புதிய குவார்க் `` output_names`` சேர்க்கப்பட்டது. இந்த குவார்க் ஒரு சரம் அல்லது சரங்களின் பட்டியலை எடுத்து, `` transpile() `` அழைப்பால் திரும்பப் பெறும் வெளியீட்டு சுற்றுகளுக்கு சுற்று பெயரின் மதிப்பாக அவற்றைப் பயன்படுத்துகிறது. உதாரணத்திற்கு::

source: the ``name`` attribute on tcirc_a and tcirc_b will be ``'Circuit A'`` and ``'Circuit B'`` respectively.
ta_in: tcirc_a மற்றும் tcirc_b இல் உள்ள `` name`` பண்பு முறையே ``'Circuit A'`` மற்றும் ``'Circuit B'`` ஆக இருக்கும்.

source: A new method ``equiv()`` was added to the ``qiskit.quantum_info.Operator`` and ``qiskit.quantum_info.Statevector`` classes. These methods are used to check whether a second ``Operator`` object or ``Statevector`` is equivalent up to global phase.
ta_in: `` Qiskit.quantum_info.Operator`` மற்றும் `` qiskit.quantum_info.Statevector`` வகுப்புகளில் ``equiv()`` ஒரு புதிய முறை சேர்க்கப்பட்டது. இரண்டாவது ``Operator`` பொருள் அல்லது `` Statevector`` என்பது உலகளாவிய கட்டத்திற்கு சமமானதா என்பதைச் சரிபார்க்க இந்த முறைகள் பயன்படுத்தப்படுகின்றன.

source: The user config file has several new options:
ta_in: பயனர் கட்டமைப்பு கோப்பில் பல புதிய விருப்பங்கள் உள்ளன:

source: The ``circuit_drawer`` field now accepts an `auto` value. When set as the value for the ``circuit_drawer`` field the default drawer backend will be `mpl` if it is available, otherwise the `text` backend will be used.
ta_in: ``circuit_drawer`` புலம் இப்போது `auto` மதிப்பை ஏற்றுக்கொள்கிறது. ``circuit_drawer`` புலத்திற்கான மதிப்பாக அமைக்கப்பட்டால், இயல்புநிலை டிராயர் பின்தளத்தில் அது கிடைத்தால் `mpl` ஆக இருக்கும், இல்லையெனில்`text` பின்தளத்தில் பயன்படுத்தப்படும்.

source: A new field ``circuit_mpl_style`` can be used to set the default style used by the matplotlib circuit drawer. Valid values for this field are ``bw`` and ``default`` to set the default to a black and white or the default color style respectively.
ta_in: மேட்லோட்லிப் சர்க்யூட் டிராயரால் பயன்படுத்தப்படும் இயல்புநிலை பாணியை அமைக்க ஒரு புதிய புலம் ``circuit_mpl_style`` பயன்படுத்தப்படலாம். இயல்புநிலையை முறையே கருப்பு மற்றும் வெள்ளை அல்லது இயல்புநிலை வண்ண பாணியாக அமைக்க இந்த புலத்திற்கான செல்லுபடியாகும் மதிப்புகள் `` bw`` மற்றும் ``default``.

source: A new field ``transpile_optimization_level`` can be used to set the default transpiler optimization level to use for calls to ``qiskit.compiler.transpile()``. The value can be set to either 0, 1, 2, or 3.
ta_in: `` Qiskit.compiler.transpile () `` க்கான அழைப்புகளுக்குப் பயன்படுத்த இயல்புநிலை டிரான்ஸ்பைலர் உகப்பாக்கம் அளவை அமைக்க ஒரு புதிய புலம் `` transpile_optimization_level`` பயன்படுத்தப்படலாம். மதிப்பை 0, 1, 2 அல்லது 3 என அமைக்கலாம்.

source: The previously deprecated ``qiskit._util`` module has been removed. ``qiskit.util`` should be used instead.
ta_in: முன்னர் நீக்கப்பட்ட ``qiskit._util`` தொகுதி நீக்கப்பட்டது. அதற்கு பதிலாக ``qiskit.util`` பயன்படுத்தப்பட வேண்டும்.

source: The ``QuantumCircuit.count_ops()`` method now returns an ``OrderedDict`` object instead of a ``dict``. This should be compatible for most use cases since ``OrderedDict`` is a ``dict`` subclass. However type checks and other class checks might need to be updated.
ta_in: `` QuantumCircuit.count_ops () `` முறை இப்போது `` dict`` க்கு பதிலாக `` OrderedDict`` பொருளை வழங்குகிறது. `` OrderedDict`` என்பது `` dict`` துணைப்பிரிவு என்பதால் பெரும்பாலான பயன்பாட்டு நிகழ்வுகளுக்கு இது இணக்கமாக இருக்க வேண்டும். இருப்பினும் வகை காசோலைகள் மற்றும் பிற வகுப்பு காசோலைகள் புதுப்பிக்கப்பட வேண்டியிருக்கும்.

source: The ``DAGCircuit.width()`` method now returns the total number quantum bits and classical bits. Before it would only return the number of quantum bits. If you require just the number of quantum bits you can use ``DAGCircuit.num_qubits()`` instead.
ta_in: `` DAGCircuit.width () `` முறை இப்போது மொத்த எண் குவாண்டம் பிட்கள் மற்றும் கிளாசிக்கல் பிட்களை வழங்குகிறது. இது குவாண்டம் பிட்களின் எண்ணிக்கையை மட்டுமே தரும் முன். உங்களுக்கு குவாண்டம் பிட்களின் எண்ணிக்கை தேவைப்பட்டால், அதற்கு பதிலாக `` DAGCircuit.num_qubits () `` ஐப் பயன்படுத்தலாம்.

source: The function ``DAGCircuit.num_cbits()`` has been removed. Instead you can use ``DAGCircuit.num_clbits()``.
ta_in: `` DAGCircuit.num_cbits () `` செயல்பாடு நீக்கப்பட்டது. அதற்கு பதிலாக நீங்கள் `` DAGCircuit.num_clbits () `` ஐப் பயன்படுத்தலாம்.

source: Individual quantum bits and classical bits are no longer represented as ``(register, index)`` tuples. They are now instances of `Qubit` and `Clbit` classes. If you're dealing with individual bits make sure that you update any usage or type checks to look for these new classes instead of tuples.
ta_in: தனிப்பட்ட குவாண்டம் பிட்கள் மற்றும் கிளாசிக்கல் பிட்கள் இனி ``(register, index)`` டுபில்கள் என குறிப்பிடப்படுவதில்லை. அவை இப்போது `குபிட்` மற்றும்` கிளிபிட்` வகுப்புகளின் நிகழ்வுகளாகும். நீங்கள் தனிப்பட்ட பிட்களைக் கையாளுகிறீர்களானால், எந்தவொரு பயன்பாட்டையும் புதுப்பிக்கிறீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் அல்லது இந்த புதிய வகுப்புகளைத் தேடுவதற்கு காசோலைகளைத் தட்டச்சு செய்க.

source: The preset passmanager classes ``qiskit.transpiler.preset_passmanagers.default_pass_manager`` and ``qiskit.transpiler.preset_passmanagers.default_pass_manager_simulator`` (which were the previous default pass managers for ``qiskit.compiler.transpile()`` calls) have been removed. If you were manually using this pass managers switch to the new default, ``qiskit.transpile.preset_passmanagers.level1_pass_manager``.
ta_in: முன்னமைக்கப்பட்ட பாஸ்மேனேஜர் வகுப்புகள் `` qiskit.transpiler.preset_passmanagers.default_pass_manager`` மற்றும் `` qiskit.transpiler.preset_passmanagers.default_pass_manager_simulator`` (`''qiskit.compiler.transpile() க்கான முந்தைய இயல்புநிலை பாஸ் மேலாளர்கள்) அகற்றப்பட்டது. இந்த பாஸ் மேலாளர்கள் நீங்கள் கைமுறையாகப் பயன்படுத்தினால், புதிய இயல்புநிலைக்கு மாறவும், `` qiskit.transpile.preset_passmanagers.level1_pass_manager``.
