Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: The :class:`~qiskit.circuit.QuantumCircuit` method :meth:`~qiskit.circuit.QuantumCircuit.unitary` method has been fixed to accept a single integer for the ``qarg`` argument (when adding a 1-qubit unitary). The allowed types for the ``qargs`` argument are now ``int``, :class:`~qiskit.circuit.Qubit`, or a list of integers. Fixes `#4944 <https://github.com/Qiskit/qiskit-terra/issues/4944>`__
ta_in: :class: `~ qiskit.circuit.QuantumCircuit` முறை :meth:` qiskit.circuit.QuantumCircuit.unitary` முறை ``qarg`` வாதத்திற்கான ஒற்றை முழு எண்ணை ஏற்றுக்கொள்ள சரி செய்யப்பட்டது (1-qubit unitary சேர்க்கும்போது). ``qargs`` வாதத்திற்கான அனுமதிக்கப்பட்ட வகைகள் இப்போது ``int`` , :class: `~ qiskit.circuit.Qubit`, அல்லது முழு எண்களின் பட்டியல். திருத்தம் `# 4944 <https://github.com/Qiskit/qiskit-terra/issues/4944>` __

source: Previously, calling :meth:`~qiskit.circuit.library.BlueprintCircuit.inverse` on a :class:`~qiskit.circuit.library.BlueprintCircuit` object could fail if its internal data property was not yet populated. This has been fixed so that the calling :meth:`~qiskit.circuit.library.BlueprintCircuit.inverse` will populate the internal data before generating the inverse of the circuit. Fixes `#5140 <https://github.com/Qiskit/qiskit-terra/issues/5140>`__
ta_in: முன்னதாக, அழைப்பு :meth: `~ qiskit.circuit.library.BlueprintCircuit.inverse` இல் ஒரு :class:` ~ qiskit.circuit.library.BlueprintCircuit` object அதன் உள் தரவு பண்பு தொகை இல்லாவிட்டால் தோல்வியடையும். இது சரி செய்யப்பட்டது, இதனால் அழைப்பு :meth: `qiskit.circuit.library.BlueprintCircuit.inverse` circuitக்கு நேர்மாறாக உருவாக்கும் முன் உள் தரவை விரிவுபடுத்துகிறது. திருத்தம் `# 5140 <https://github.com/Qiskit/qiskit-terra/issues/5140>` __

source: Fixed an issue when creating a :class:`qiskit.result.Counts` object from an empty data dictionary. Now this will create an empty :class:`~qiskit.result.Counts` object. The :meth:`~qiskit.result.Counts.most_frequent` method is also updated to raise a more descriptive exception when the object is empty. Fixes `#5017 <https://github.com/Qiskit/qiskit-terra/issues/5017>`__
ta_in: ஒரு வெற்று தரவு அகராதியிலிருந்து ஒரு :class: `qiskit.result.Counts` பொருளை உருவாக்கும்போது ஒரு சிக்கல் சரி செய்யப்பட்டது. இப்போது இது வெற்று :class: `~ qiskit.result.Counts` பொருள் உருவாக்கும். பொருள் காலியாக இருக்கும்போது மேலும் விளக்கமான விதிவிலக்கை எழுப்புவதற்கு :meth: `~ qiskit.result.Counts.most_frequent` முறையும் புதுப்பிக்கப்பட்டுள்ளது. திருத்தம் `# 5017 <https://github.com/Qiskit/qiskit-terra/issues/5017>` __

source: Fixes a bug where setting ``ctrl_state`` of a :class:`~qiskit.extensions.UnitaryGate` would be applied twice; once in the creation of the matrix for the controlled unitary and again when calling the :meth:`~qiskit.circuit.ControlledGate.definition` method of the :class:`qiskit.circuit.ControlledGate` class. This would give the appearence that setting ``ctrl_state`` had no effect.
ta_in: ஒரு :class:ன் ``ctrl_state`` ஐ அமைப்பதில் ஒரு பிழையை சரிசெய்கிறது: `~ qiskit.extensions.UnitaryGate` இரண்டு முறை பயன்படுத்தப்படும்; கட்டுப்படுத்தப்பட்ட unitaryக்கான மேட்ரிக்ஸை உருவாக்கியதும், மீண்டும் :meth: `~ qiskit.circuit.ControlledGate.definition` முறையின் :class:` qiskit.circuit.ControlledGate` வகுப்பை அழைக்கும் போது. `` Ctrl_state`` அமைப்பால் எந்த விளைவும் இல்லை என்று இதனால் தோன்றும்.

source: Previously the :class:`~qiskit.circuit.ControlledGate` method :meth:`~qiskit.circuit.ControlledGate.inverse` would not preserve the ``ctrl_state`` parameter in some cases. This has been fixed so that calling :meth:`~qiskit.circuit.ControlledGate.inverse` will preserve the value ``ctrl_state`` in its output.
ta_in: முன்னதாக :class: `~ qiskit.circuit.ControlledGate` முறை :meth:` ~ qiskit.circuit.ControlledGate.inverse` சில சந்தர்ப்பங்களில் ``ctrl_state`` அளவுருவைப் பாதுகாக்காது. இது சரி செய்யப்பட்டது, எனவே :meth: `~ qiskit.circuit.ControlledGate.inverse` ஐ அழைப்பது, அதன் வெளியீட்டில்` `ctrl_state`` மதிப்பைப் பாதுகாக்கும்.

source: Fixed a bug in the ``mpl`` output backend of the circuit drawer :meth:`qiskit.circuit.QuantumCircuit.draw` and :func:`qiskit.visualization.circuit_drawer` that would cause the drawer to fail if the ``style`` kwarg was set to a string. The correct behavior would be to treat that string as a path to a JSON file containing the style sheet for the visualization. This has been fixed, and warnings are raised if the JSON file for the style sheet can't be loaded.
ta_in: சர்க்யூட் டிராயரின் `` எம்.பி.எல்`` வெளியீட்டு பின்தளத்தில் ஒரு பிழை சரி செய்யப்பட்டது: மெத்: `qiskit.circuit.QuantumCircuit.draw` மற்றும்: func:` qiskit.visualization.circuit_drawer` இது டிராயரை செயலிழக்கச் செய்தால் `` நடை`` குவார்க் ஒரு சரத்திற்கு அமைக்கப்பட்டது. காட்சிப்படுத்தலுக்கான நடை தாளைக் கொண்ட ஒரு JSON கோப்பிற்கான பாதையாக அந்த சரத்தை கருதுவதே சரியான நடத்தை. இது சரி செய்யப்பட்டது, மற்றும் ஸ்டைல் ​​ஷீட்டிற்கான JSON கோப்பை ஏற்ற முடியாவிட்டால் எச்சரிக்கைகள் எழுப்பப்படுகின்றன.

source: Fixed an error where loading a QASM file via :meth:`~qiskit.circuit.QuantumCircuit.from_qasm_file` or :meth:`~qiskit.circuit.QuantumCircuit.from_qasm_str` would fail if a ``u``, ``phase(p)``, ``sx``, or ``sxdg`` gate were present in the QASM file. Fixes `#5156 <https://github.com/Qiskit/qiskit-terra/issues/5151>`__
ta_in: QASM கோப்பை இதன் மூலம் ஏற்றுவதில் பிழை சரி செய்யப்பட்டது: மெத்: `~ qiskit.circuit.QuantumCircuit.from_qasm_file` அல்லது: மெத்:` ~ qiskit.circuit.QuantumCircuit.from_qasm_str` ஒரு `` u``, `` கட்டம் ( p) QASM கோப்பில் ``, `` sx``, அல்லது `` sxdg`` கேட் இருந்தன. திருத்தங்கள் `# 5156

source: Fixed a bug that would potentially cause registers to be mismapped when unrolling/decomposing a gate defined with only one 2-qubit operation.
ta_in: ஒரே ஒரு 2-குவிட் செயல்பாட்டைக் கொண்டு வரையறுக்கப்பட்ட ஒரு வாயிலை அவிழ்த்து / சிதைக்கும்போது பதிவேடுகளில் பொருந்தாத ஒரு பிழை சரி செய்யப்பட்டது.

source: This 0.7.0 release includes numerous performance improvements and significant enhancements to the simulator interface, and drops support for Python 3.5. The main interface changes are configurable simulator backends, and constructing preconfigured simulators from IBMQ backends. Noise model an basis gate support has also been extended for most of the Qiskit circuit library standard gates, including new support for 1 and 2-qubit rotation gates. Performance improvements include adding SIMD support to the density matrix and unitary simulation methods, reducing the used memory and improving the performance of circuits using statevector and density matrix snapshots, and adding support for Kraus instructions to the gate fusion circuit optimization for greatly improving the performance of noisy statevector simulations.
ta_in: இந்த 0. 7. 0 விடுதலை பல செயல்திறன் முன்னேற்றங்கள் மற்றும் குறிப்பிடத்தக்க மேம்பாட்டு உரிமைகள் ஆகியவற்றை உள்ளடக்குகிறது, மற்றும் பைதான் 3.5 க்கு ஆதரவு தரும். முக்கிய இடைமுகப்பு மாற்றங்கள் வடிவமைப்புத் துணை பின்னணி, மற்றும் IBMQ பின்னணிகளில் இருந்து முன் வடிவமைக்கப்பட்ட உரையாடல் வடிவமைப்புகள். Noise model an basis gate support has also been extended for most of the Qiskit circuit library standard gates, including new support for 1 and 2-qubit சுழற்சி வாயுக்கள். பெரும்பாலான முன்னுரிமைகளில் SIMD ஆதரவு சேர்க்கும் அடர்த்தி மெட்ரிக்ஸ் மற்றும் ஒருங்கிணைந்த மின்சார முறைமைகளுக்கு, பயன்படுத்தப்பட்ட நினைவகத்தை குறைக்கவும் மற்றும் செயல்திறன் மற்றும் அடர்த்தி மெட்ரிக்ஸ் இன்ட்ரிக்ஸ் ஸ்பெக்ஸ்போஸ் ஆகியவற்றின் செயல்திறனை மேம்படுத்தும், மற்றும் கேரஸ் ஆணைக்குழுவுக்கு ஆதரவு சேர்க்கிறது.

source: Adds basis gate support for the :class:`qiskit.circuit.Delay` instruction to the :class:`~qiskit.providers.aer.StatevectorSimulator`, :class:`~qiskit.providers.aer.UnitarySimulator`, and :class:`~qiskit.providers.aer.QasmSimulator`. Note that this gate is treated as an identity gate during simulation and the delay length parameter is ignored.
ta_in: வகுப்பிற்கான அடிப்படை வாயில் ஆதரவைச் சேர்க்கிறது: `qiskit.circuit.Delay` இன் அறிவுறுத்தல்: வகுப்பு:` ~ qiskit.providers.aer.StatevectorSimulator` ,: வகுப்பு: `~ qiskit.providers.aer.UnitarySimulator`, மற்றும்: class : `~ qiskit.providers.aer.QasmSimulator`. உருவகப்படுத்துதலின் போது இந்த வாயில் அடையாள வாயிலாக கருதப்படுகிறது மற்றும் தாமத நீள அளவுரு புறக்கணிக்கப்படுகிறது என்பதை நினைவில் கொள்க.

source: Adds basis gate support for the single-qubit gate :class:`qiskit.circuit.library.UGate` to the :class:`~qiskit.providers.aer.StatevectorSimulator`, :class:`~qiskit.providers.aer.UnitarySimulator`, and the ``"statevector"``, ``"density_matrix"``, ``"matrix_product_state"``, and ``"extended_stabilizer"`` methods of the :class:`~qiskit.providers.aer.QasmSimulator`.
ta_in: வகுப்பு `, மற்றும்` `" ஸ்டேட்வெக்டர் "` `,` `" அடர்த்தி_மாட்ரிக்ஸ் "` `,` `" மேட்ரிக்ஸ்_ உற்பத்தி_நிலையம் "` `, மற்றும்` `" நீட்டிக்கப்பட்ட_நிலையாக்கி "` `முறைகள்: வர்க்கம்:` ~ qiskit.providers.aer. QasmSimulator`.

source: Adds basis gate support for the phase gate :class:`qiskit.circuit.library.PhaseGate` to the :class:`~qiskit.providers.aer.StatevectorSimulator`, :class:`~qiskit.providers.aer.StatevectorSimulator`, :class:`~qiskit.providers.aer.UnitarySimulator`, and the ``"statevector"``, ``"density_matrix"``, ``"matrix_product_state"``, and ``"extended_stabilizer"`` methods of the :class:`~qiskit.providers.aer.QasmSimulator`.
ta_in: கட்ட வாயிலுக்கு அடிப்படை கேட் ஆதரவைச் சேர்க்கிறது: வகுப்பு: `qiskit.circuit.library.PhaseGate`: வகுப்பிற்கு:` ~ qiskit.providers.aer.StatevectorSimulator` ,: வகுப்பு: `~ qiskit.providers.aer.StatevectorSimulator`, : class: `~ qiskit.providers.aer.UnitarySimulator`, மற்றும்` `" statevector "` `,` `" அடர்த்தி_மாட்ரிக்ஸ் "` `,` `" matrix_product_state "` `, மற்றும்` `" நீட்டிக்கப்பட்ட_நிலையாக்கி "` `முறைகள் வகுப்பு: `~ qiskit.providers.aer.QasmSimulator`.

source: Adds basis gate support for the controlled-phase gate :class:`qiskit.circuit.library.CPhaseGate` to the :class:`~qiskit.providers.aer.StatevectorSimulator`, :class:`~qiskit.providers.aer.StatevectorSimulator`, :class:`~qiskit.providers.aer.UnitarySimulator`, and the ``"statevector"``, ``"density_matrix"``, and ``"matrix_product_state"`` methods of the :class:`~qiskit.providers.aer.QasmSimulator`.
ta_in: கட்டுப்படுத்தப்பட்ட-கட்ட வாயிலுக்கு அடிப்படை வாயில் ஆதரவைச் சேர்க்கிறது: வகுப்பு: `qiskit.circuit.library.CPhaseGate`: வகுப்பிற்கு:` ~ qiskit.providers.aer.StatevectorSimulator` ,: வகுப்பு: `~ qiskit.providers.aer.StatevectorSimulator `,: வகுப்பு:` ~ qiskit.providers.aer.UnitarySimulator`, மற்றும் `` "ஸ்டேட்வெக்டர்" ``, `` "அடர்த்தி_மாட்ரிக்ஸ்" ``, மற்றும் `` "மேட்ரிக்ஸ்_ உற்பத்தி_நிலையம்" `` முறைகள்: வர்க்கம்: `~ qiskit.providers.aer.QasmSimulator`.

source: Adds support for the multi-controlled phase gate :class:`qiskit.circuit.library.MCPhaseGate` to the :class:`~qiskit.providers.aer.StatevectorSimulator`, :class:`~qiskit.providers.aer.UnitarySimulator`, and the ``"statevector"`` method of the :class:`~qiskit.providers.aer.QasmSimulator`.
ta_in: பல கட்டுப்பாட்டு கட்ட வாயிலுக்கு ஆதரவைச் சேர்க்கிறது: வகுப்பு: `qiskit.circuit.library.MCPhaseGate`: வகுப்பிற்கு:` ~ qiskit.providers.aer.StatevectorSimulator` ,: வகுப்பு: `~ qiskit.providers.aer.UnitarySimulator` , மற்றும் `` "ஸ்டேட்வெக்டர்" `` முறை: வர்க்கம்: `~ qiskit.providers.aer.QasmSimulator`.

source: Adds support for the :math:`\sqrt(X)` gate :class:`qiskit.circuit.library.SXGate` to the :class:`~qiskit.providers.aer.StatevectorSimulator`, :class:`~qiskit.providers.aer.UnitarySimulator`, and :class:`~qiskit.providers.aer.QasmSimulator`.
ta_in: கணிதத்திற்கான ஆதரவைச் சேர்க்கிறது :math:`\sqrt(X)` gate :class:`qiskit.circuit.library.SXGate`: வகுப்பிற்கு :class:` ~ qiskit.providers.aer.StatevectorSimulator` ,:class:`~qiskit.providers.aer.UnitarySimulator`, மற்றும்:class: `~ qiskit.providers.aer.QasmSimulator`.

source: Adds support for 1 and 2-qubit Qiskit circuit library rotation gates :class:`~qiskit.circuit.library.RXGate`, :class:`~qiskit.circuit.library.RYGate`, :class:`~qiskit.circuit.library.RZGate`, :class:`~qiskit.circuit.library.RGate`, :class:`~qiskit.circuit.library.RXXGate`, :class:`~qiskit.circuit.library.RYYGate`, :class:`~qiskit.circuit.library.RZZGate`, :class:`~qiskit.circuit.library.RZXGate` to the :class:`~qiskit.providers.aer.StatevectorSimulator`, :class:`~qiskit.providers.aer.UnitarySimulator`, and the ``"statevector"`` and ``"density_matrix"`` methods of the :class:`~qiskit.providers.aer.QasmSimulator`.
ta_in: 1 மற்றும் 2-குவிட் கிஸ்கிட் சுற்று நூலக சுழற்சி வாயில்களுக்கான ஆதரவைச் சேர்க்கிறது: வகுப்பு: `~ qiskit.circuit.library.RXGate` ,: வகுப்பு:` ~ qiskit.circuit.library.RYGate` ,: வகுப்பு: `~ qiskit.circuit. library.RZGate` ,: வகுப்பு: `~ qiskit.circuit.library.RGate` ,: வகுப்பு:` ~ qiskit.circuit.library.RXXGate` ,: வகுப்பு: `~ qiskit.circuit.library.RYYGate` ,: வகுப்பு: `~ qiskit.circuit.library.RZZGate` ,: வகுப்பு:` ~ qiskit.circuit.library.RZXGate` க்கு: வகுப்பு: `~ qiskit.providers.aer.StatevectorSimulator` ,: வகுப்பு:` ~ qiskit.providers.aer .உனிட்டரி சிமுலேட்டர்`, மற்றும் `` "ஸ்டேட்வெக்டர்" `` மற்றும் `` "அடர்த்தி_மாட்ரிக்ஸ்" `` முறைகள்: வர்க்கம்: `~ qiskit.providers.aer.QasmSimulator`. #: ../../release_notes.rst:1818

source: Adds support for multi-controlled rotation gates ``"mcr"``, ``"mcrx"``, ``"mcry"``, ``"mcrz"`` to the :class:`~qiskit.providers.aer.StatevectorSimulator`, :class:`~qiskit.providers.aer.UnitarySimulator`, and the ``"statevector"`` method of the :class:`~qiskit.providers.aer.QasmSimulator`.
ta_in: பல கட்டுப்பாட்டு கட்ட வாயிலுக்கு ஆதரவைச் சேர்க்கிறது: வகுப்பு: `qiskit.circuit.library.MCPhaseGate`: வகுப்பிற்கு:` ~ qiskit.providers.aer.StatevectorSimulator` ,: வகுப்பு: `~ qiskit.providers.aer.UnitarySimulator` , மற்றும் `` "ஸ்டேட்வெக்டர்" `` முறை: வர்க்கம்: `~ qiskit.providers.aer.QasmSimulator`.

source: Make simulator backends configurable. This allows setting persistant options such as simulation method and noise model for each simulator backend object.
ta_in: வடிவமைப்பை வடிவமைக்க முடியும். இது ஒவ்வொரு ஒருங்கிணைக்கும் பின்னணி பொருளாக ஒலிக்கோப்பு முறை மற்றும் ஒளி மாதிரி போன்றவற்றை அமைக்க அனுமதிக்கும்.

source: The :class:`~qiskit.providers.aer.QasmSimulator` and :class:`~qiskit.providers.aer.PulseSimulator` can also be configured from an :class:`~qiskit.providers.ibmq.IBMQBackend` backend object using the `:meth:`~qiskit.providers.aer.QasmSimulator.from_backend` method. For the :class:`~qiskit.providers.aer.QasmSimulator` this will configure the coupling map, basis gates, and basic device noise model based on the backend configuration and properties. For the :class:`~qiskit.providers.aer.PulseSimulator` the system model and defaults will be configured automatically from the backend configuration, properties and defaults.
ta_in: வகுப்பு: `~ qiskit.providers.aer.QasmSimulator` மற்றும்: class:` ~ qiskit.providers.aer.PulseSimulator` ஐ ஒரு: வகுப்பிலிருந்து கட்டமைக்க முடியும்: `q qiskit.providers.ibmq.IBMQBackend` பின்தளத்தில் பொருள் `: மெத்:` ~ qiskit.providers.aer.QasmSimulator.from_backend` முறை. வகுப்புக்கு: `~ qiskit.providers.aer.QasmSimulator` இது பின்தளத்தில் உள்ளமைவு மற்றும் பண்புகளின் அடிப்படையில் இணைப்பு வரைபடம், அடிப்படை வாயில்கள் மற்றும் அடிப்படை சாதன இரைச்சல் மாதிரியை உள்ளமைக்கும். வகுப்புக்கு: `~ qiskit.providers.aer.PulseSimulator` கணினி மாதிரி மற்றும் இயல்புநிலைகள் பின்தளத்தில் உள்ளமைவு, பண்புகள் மற்றும் இயல்புநிலைகளிலிருந்து தானாகவே கட்டமைக்கப்படும்.

source: For example a noisy density matrix simulator backend can be constructed as ``QasmSimulator(method='density_matrix', noise_model=noise_model)``, or an ideal matrix product state simulator as ``QasmSimulator(method='matrix_product_state')``.
ta_in: எடுத்துக்காட்டாக ஒரு நச்சுவான அடர்த்தி மெட்ரிக்ஸ் பாக்டிரிக்ஸ் பின்னணி ` ` QasmSimulator (method = 'density_matrix', Noe_ model = நுழை_ மாதிரி) ` `, அல்லது ஒரு வர்த்தக மேட்ரிக்ஸ் உற்பத்தி மாநிலமாகும் ` ` QasmSimulator (method = 'matrix_product_state') ` `.

source: A benefit is that a :class:`~qiskit.providers.aer.PulseSimulator` instance configured from a backend better serves as a drop-in replacement to the original backend, making it easier to swap in and out a simulator and real backend, e.g. when testing code on a simulator before using a real backend. For example, in the following code-block, the :class:`~qiskit.providers.aer.PulseSimulator` is instantiated from the ``FakeArmonk()`` backend. All configuration and default data is copied into the simulator instance, and so when it is passed as an argument to ``assemble``, it behaves as if the original backend was supplied (e.g. defaults from ``FakeArmonk`` will be present and used by ``assemble``).
ta_in: ஒரு நன்மை என்னவென்றால்: ஒரு வகுப்பு: `~ qiskit.providers.aer.PulseSimulator` உதாரணம் ஒரு பின்தளத்தில் இருந்து கட்டமைக்கப்பட்டிருப்பது அசல் பின்தளத்தில் மாற்றுவதற்கான ஒரு துளி-மாற்றாக சிறப்பாக செயல்படுகிறது, இது ஒரு சிமுலேட்டர் மற்றும் உண்மையான பின்தளத்தில் மாற்றுவதை எளிதாக்குகிறது, எ.கா. உண்மையான பின்தளத்தில் பயன்படுத்துவதற்கு முன்பு ஒரு சிமுலேட்டரில் குறியீட்டை சோதிக்கும் போது. எடுத்துக்காட்டாக, பின்வரும் குறியீடு-தொகுதியில், வகுப்பு: `~ qiskit.providers.aer.PulseSimulator` என்பது` `போலிஅர்மோங்க் ()` `பின்தளத்தில் இருந்து உடனடிப்படுத்தப்படுகிறது. எல்லா உள்ளமைவு மற்றும் இயல்புநிலை தரவுகளும் சிமுலேட்டர் நிகழ்வில் நகலெடுக்கப்படுகின்றன, எனவே இது `` அசெம்பிள்``க்கான வாதமாக அனுப்பப்படும்போது, ​​அசல் பின்தளத்தில் வழங்கப்பட்டதைப் போலவே இது செயல்படுகிறது (எ.கா. `ஃபேக்அர்மோன்க்` இலிருந்து இயல்புநிலைகள் இருக்கும் மற்றும் `` அசெம்பிள்`` ஆல் பயன்படுத்தப்படுகிறது).

source: While the above example is small, the demonstrated 'drop-in replacement' behavior should greatly improve the usability in more complicated work-flows, e.g. when calibration experiments are constructed using backend attributes.
ta_in: மேலிருக்கும் உதாரணம் சிறியதாகக் கூடும் போது, விரிவான 'drop-in replacement' நடவடிக்கை மேலும் சிக்கலான வேலைகளில் உபயோகத்தை மேம்படுத்துவது, எ. கா, எ. கா.

source: Adds support for qobj global phase to the :class:`~qiskit.providers.aer.StatevectorSimulator`, :class:`~qiskit.providers.aer.UnitarySimulator`, and statevector methods of the :class:`~qiskit.providers.aer.QasmSimulator`.
ta_in: Qobj உலகளாவிய கட்டத்திற்கான ஆதரவை: class: `~ qiskit.providers.aer.StatevectorSimulator` ,: class:` ~ qiskit.providers.aer.UnitarySimulator`, மற்றும்: class: `~ qiskit.providers இன் மாநிலவெக்டர் முறைகள் aer.QasmSimulator`.

source: Improves general noisy statevector simulation performance by adding a Kraus method to the gate fusion circuit optimization that allows applying gate fusion to noisy statevector simulations with general Kraus noise.
ta_in: பொதுவான ஒழுங்குபடுத்தும் மாதிரிகளை ஒழுங்குபடுத்துவதால் கேரஸ் (Kraus) முறை (Kraus) முறை (Kraus) முறைமையை சேர்த்துக் கொள்கிறது.

source: Use move semantics for statevector and density matrix snapshots for the `"statevector"` and `"density_matrix"` methods of the :class:`~qiskit.providers.aer.QasmSimulator` if they are the final instruction in a circuit. This reduces the memory usage of the simulator improves the performance by avoiding copying a large array in the results.
ta_in: "Statevector" ` and ` density_matrix "` ` density_matrix" என்பது :class:` ~ qiskit.देगा வழிமுறைகளுக்கான நடவடிக்கை மற்றும் அடர்த்தி மாதிரிகளை பயன்படுத்தவும். இது குறியீடுகளின் நினைவக பயன்பாட்டை குறைக்கிறது, முடிவுகளின் ஒரு பெரிய அர்ரே நகலெடுக்கும் செயல்திறனை அளிக்கிறது.

source: Adds support for general Kraus :class:`~qiskit.providers.aer.noise.QauntumError` gate errors in the :class:`~qiskit.providers.aer.noise.NoiseModel` to the ``"matrix_product_state"`` method of the :class:`~qiskit.providers.aer.QasmSimulator`.
ta_in: பொது க்ராஸிற்கான ஆதரவைச் சேர்க்கிறது: வர்க்கம்: `~ qiskit.providers.aer.noise.QauntumError` கேட் பிழைகள்: வகுப்பில்:` ~ qiskit.providers.aer.noise.NoiseModel` ஐ `` "matrix_product_state" `` முறைக்கு வகுப்பு: `~ qiskit.providers.aer.QasmSimulator`.

source: Adds support for density matrix snapshot instruction :class:`qiskit.providers.aer.extensions.SnapshotDensityMatrix` to the ``"matrix_product_state"`` method of the :class:`~qiskit.providers.aer.QasmSimulator`.
ta_in: அடர்த்தி மேட்ரிக்ஸ் ஸ்னாப்ஷாட் அறிவுறுத்தலுக்கான ஆதரவைச் சேர்க்கிறது: வகுப்பு: `qiskit.providers.aer.extensions.SnapshotDensityMatrix` ஐ` `" matrix_product_state "` `முறை: வகுப்பின் முறை:` ~ qiskit.providers.aer.QasmSimulator`.

source: Extends the SIMD vectorization of the statevector simulation method to the unitary matrix, superoperator matrix, and density matrix simulation methods. This gives roughtly a 2x performance increase general simulation using the :class:`~qiskit.providers.aer.UnitarySimulator`, the ``"density_matrix"`` method of the :class:`~qiskit.providers.aer.QasmSimulator`, gate fusion, and noise simulation.
ta_in: யூனிடரி மேட்ரிக்ஸ், சூப்பர் ஆபரேட்டர் மேட்ரிக்ஸ் மற்றும் அடர்த்தி மேட்ரிக்ஸ் சிமுலேஷன் முறைகளுக்கு ஸ்டேட்வெக்டர் சிமுலேஷன் முறையின் சிம்டி திசையன்மயமாக்கலை நீட்டிக்கிறது. இது வகுப்பைப் பயன்படுத்தி 2x செயல்திறன் அதிகரிக்கும் பொது உருவகப்படுத்துதலை அளிக்கிறது: `~ qiskit.providers.aer.UnitarySimulator`,` `" அடர்த்தி_மாட்ரிக்ஸ் "` `: வர்க்கத்தின் முறை:` ~ qiskit.providers.aer.QasmSimulator`, கேட் இணைவு மற்றும் சத்தம் உருவகப்படுத்துதல்.

source: Adds a custom vector class to C++ code that has better integration with Pybind11. This haves the memory requirement of the :class:`~qiskit.providers.aer.StatevectorSimulator` by avoiding an memory copy during Python binding of the final simulator state.
ta_in: பைபிண்ட் 11 உடன் சிறந்த ஒருங்கிணைப்பைக் கொண்ட சி ++ குறியீட்டில் தனிப்பயன் திசையன் வகுப்பைச் சேர்க்கிறது. இறுதி சிமுலேட்டர் நிலையின் பைதான் பிணைப்பின் போது நினைவக நகலைத் தவிர்ப்பதன் மூலம்: வர்க்கம்: `~ qiskit.providers.aer.StatevectorSimulator` இன் நினைவகத் தேவையை இது கொண்டுள்ளது.

source: AER now uses Lapack to perform some matrix related computations. It uses the Lapack library bundled with OpenBlas (already available in Linux and Macos typical OpenBlas dsitributions; Windows version distributed with AER) or with the accelerate framework in MacOS.
ta_in: AER இப்போது சில மாட்ரிக்ஸ் தொடர்பான கணினிகளை செயல்படுத்துவதற்கு பயன்படுகிறது. இது OpenBlas (ஏற்கனவே Linux and Macos සාමාන්ය OpenBlas dsitributions; விண்டோஸ் பதிப்பு AER with AER) அல்லது MacOS இல் ஆரம்ப வரையறையுடன் பகிர்ந்துகொண்டிருக்கும் லாபக் நூலகத்தை பயன்படுத்துகிறது.

source: The deprecated support for running qiskit-aer with Python 3.5 has been removed. To use qiskit-aer >=0.7.0 you will now need at least Python 3.6. If you are using Python 3.5 the last version which will work is qiskit-aer 0.6.x.
ta_in: Python 3.5 உடன் Qiskit டெர்ராவை இயக்குவதற்கான ஆதரவு நீக்கப்பட்டது. இந்த வெளியீட்டில் இருந்து Qiskit டெர்ராவைப் பயன்படுத்த நீங்கள் இப்போது குறைந்தபட்சம் Python 3.6 ஐப் பயன்படுத்த வேண்டும். நீங்கள் Python 3.5 ஐப் பயன்படுத்துகிறீர்கள் என்றால், வேலை செய்யும் கடைசி பதிப்பு Qiskit டெர்ரா 0.15.2 ஆகும்.

source: Updates gate fusion default thresholds so that gate fusion will be applied to circuits with of more than 14 qubits for statevector simulations on the :class:`~qiskit.providers.aer.StatevectorSimulator` and :class:`~qiskit.providers.aer.QasmSimulator`.
ta_in: புதுப்பிக்கப்படுவதற்கு முன்னிருப்பு மூலமாகக் கொண்டு வரையறுக்கப்பட்டிருக்கும் விகிதங்கள் :class:` ~ qiskit.வர்கள் மற்றும் :class:` ~ qiskit.देगा நபர். Qasmulator `.

source: For the ``"density_matrix"`` method of the :class:`~qiskit.providers.aer.QasmSimulator` and for the :class:`~qiskit.providers.aer.UnitarySimulator` gate fusion will be applied to circuits with more than 7 qubits.
ta_in: வர்க்கத்தின் `` "அடர்த்தி_மாட்ரிக்ஸ்" `` முறைக்கு: `~ qiskit.providers.aer.QasmSimulator` மற்றும்: வர்க்கம்:` ~ qiskit.providers.aer.UnitarySimulator` கேட் இணைவு அதிக சுற்றுகள் கொண்ட சுற்றுகளுக்கு பயன்படுத்தப்படும் 7 குவிட்களை விட.

source: Custom qubit threshold values can be set using the ``fusion_threshold`` backend option ie ``backend.set_options(fusion_threshold=10)``
ta_in: தனிப்பயன் குவிட் வாசல் மதிப்புகளை `` ஃப்யூஷன்_தெரெஷோல்ட்`` பின்தளத்தில் விருப்பத்தைப் பயன்படுத்தி அமைக்கலாம், அதாவது `` பின்தளத்தில்.செட்_ஆப்ஷன்ஸ் (ஃப்யூஷன்_தெஷோல்ட் = 10)
