Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: The matplotlib output type for the :func:`~qiskit.visualization.circuit_drawer` and the :meth:`~qiskit.circuit.QuantumCircuit.draw` method for the :class:`~qiskit.circuit.QuantumCircuit` class now supports configuration files for setting the visualization style. In previous releases, there was basic functionality that allowed users to pass in a ``style`` kwarg that took in a ``dict`` to customize the colors and other display features of the ``mpl`` drawer. This has now been expanded so that these dictionaries can be loaded from JSON files directly without needing to pass a dictionary. This enables users to create new style files and use that style for visualizations by passing the style filename as a string to the ``style`` kwarg.
ta_in: :func: `~ qiskit.visualization.circuit_drawer` மற்றும் :meth:` ~qiskit.circuit.QuantumCircuit.draw` முறைக்கான matplotlib வெளியீட்டு வகை:class: `~qiskit.circuit.QuantumCircuit` வகுப்பு இப்போது உள்ளமைவை ஆதரிக்கிறது காட்சிப்படுத்தல் பாணியை அமைப்பதற்கான கோப்புகள். முந்தைய வெளியீடுகளில், பயனர்கள் ``style`` குவார்க்கில் கடந்து செல்ல அனுமதித்த அடிப்படை செயல்பாடு இருந்தது, இது ``mpl`` டிராயரின் வண்ணங்கள் மற்றும் பிற காட்சி அம்சங்களைத் தனிப்பயனாக்க ``dict`` எடுத்தது. இது இப்போது விரிவாக்கப்பட்டுள்ளது, இதனால் இந்த அகராதிகள் ஒரு அகராதியை அனுப்ப வேண்டிய அவசியமின்றி JSON கோப்புகளிலிருந்து நேரடியாக ஏற்றப்படும். இது புதிய பாணி கோப்புகளை உருவாக்க பயனர்களுக்கு உதவுகிறது மற்றும் பாணி கோப்பு பெயரை ``style`` குவார்க்குக்கு ஒரு சரமாக அனுப்புவதன் மூலம் காட்சிப்படுத்தல்களுக்கு அந்த பாணியைப் பயன்படுத்துகிறது.

source: To leverage this feature you must set the ``circuit_mpl_style_path`` option in a user config file. This option should be set to the path you want qiskit to search for style JSON files. If specifying multiple path entries they should be separated by ``:``. For example, setting ``circuit_mpl_style_path = ~/.qiskit:~/user_styles`` in a user config file will look for JSON files in both ``~/.qiskit`` and ``~/user_styles``.
ta_in: இந்த அம்சத்தை மேம்படுத்துவதற்கு நீங்கள் ஒரு பயனர் உள்ளமைவு கோப்பில் `` Circuit_mpl_style_path`` விருப்பத்தை அமைக்க வேண்டும். பாணி JSON கோப்புகளைத் தேட qiskit விரும்பும் பாதையில் இந்த விருப்பத்தை அமைக்க வேண்டும். பல பாதை உள்ளீடுகளைக் குறிப்பிடினால், அவற்றை ``:`` பிரிக்க வேண்டும். எடுத்துக்காட்டாக, ஒரு பயனர் உள்ளமைவு கோப்பில் ``circuit_mpl_style_path = ~/.qiskit:~/user_styles`` ஐ அமைப்பது JSON கோப்புகளை ``~/.qiskit`` and ``~/user_styles`` ஆகிய இரண்டிலும் தேடும்.

source: A new kwarg, ``format_marginal`` has been added to the function :func:`~qiskit.result.utils.marginal_counts` which when set to ``True`` formats the counts output according to the :attr:`~qiskit.circuit.QuantumCircuit.cregs` in the circuit and missing indices are represented with a ``_``. For example:
ta_in: ஒரு புதிய குவார்க், ``format_marginal`` செயல்பாட்டில் சேர்க்கப்பட்டுள்ளது:func: `~ qiskit.result.utils.marginal_counts`, இது ``true`` என அமைக்கப்பட்டால், எண்ணிக்கையின் வெளியீட்டை வடிவமைக்கிறது:attr:`~qiskit சர்க்யூட்டில் உள்ள .circuit.QuantumCircuit.cregs` மற்றும் காணாமல் போன குறியீடுகள் `` _`` உடன் குறிப்பிடப்படுகின்றன. உதாரணத்திற்கு:

source: Improved the performance of :meth:`qiskit.quantum_info.Statevector.expectation_value` and :meth:`qiskit.quantum_info.DensityMatrix.expectation_value` when the argument operator is a :class:`~qiskit.quantum_info.Pauli` or :class:`~qiskit.quantum_info.SparsePauliOp` operator.
ta_in: :meth: `qiskit.quantum_info.Statevector.expectation_value` மற்றும் :meth:` qiskit.quantum_info.DensityMatrix.expectation_value` இன் செயல்திறனை மேம்படுத்தியது: வாதம் ஆபரேட்டர் ஒரு :class: `~ qiskit.quantum_info :class: `~ qiskit.quantum_info.SparsePauliOp` ஆபரேட்டர்.

source: The user config file has 2 new configuration options, ``num_processes`` and ``parallel``, which are used to control the default behavior of :func:`~qiskit.tools.parallel_map`. The ``parallel`` option is a boolean that is used to dictate whether :func:`~qiskit.tools.parallel_map` will run in multiple processes or not. If it set to ``False`` calls to :func:`~qiskit.tools.parallel_map` will be executed serially, while setting it to ``True`` will enable parallel execution. The ``num_processes`` option takes an integer which sets how many CPUs to use when executing in parallel. By default it will use the number of CPU cores on a system.
ta_in: பயனர் உள்ளமைவு கோப்பில் 2 புதிய உள்ளமைவு விருப்பங்கள் உள்ளன, ``num_processes`` மற்றும் ``parallel``, இவை இயல்புநிலை நடத்தையை கட்டுப்படுத்தப் பயன்படுகின்றன:func: `~ qiskit.tools.parallel_map`. `` இணையான`` விருப்பம் ஒரு பூலியன் ஆகும்: இது :func: `~ qiskit.tools.parallel_map` பல செயல்முறைகளில் இயங்குமா இல்லையா என்பதைக் கட்டளையிட பயன்படுகிறது. இது `` False`` அழைப்புகளுக்கு அமைக்கப்பட்டால் :func: `~ qiskit.tools.parallel_map` தொடர்ச்சியாக செயல்படுத்தப்படும், அதே சமயம் ``True`` என அமைப்பது இணையாக செயல்படுத்தப்படும். ``num_processes`` விருப்பம் ஒரு முழு எண்ணை எடுக்கும், இது இணையாக இயங்கும்போது எத்தனை CPU களைப் பயன்படுத்த வேண்டும் என்பதை அமைக்கிறது. இயல்பாக இது ஒரு கணினியில் CPU கோர்களின் எண்ணிக்கையைப் பயன்படுத்தும்.

source: There are 2 new environment variables, ``QISKIT_PARALLEL`` and ``QISKIT_NUM_PROCS``, that can be used to control the default behavior of :func:`~qiskit.tools.parallel_map`. The ``QISKIT_PARALLEL`` option can be set to the ``TRUE`` (any capitalization) to set the default to run in multiple processes when :func:`~qiskit.tools.parallel_map` is called. If it is set to any other value :func:`~qiskit.tools.parallel_map` will be executed serially. ``QISKIT_NUM_PROCS`` takes an integer (for example ``QISKIT_NUM_PROCS=5``) which will be used as the default number of processes to run with. Both of these will take precedence over the equivalent option set in the user config file.
ta_in: 2 புதிய சூழல் மாறிகள் உள்ளன, `` QISKIT_PARALLEL`` மற்றும் `` QISKIT_NUM_PROCS``, இவை இயல்புநிலை நடத்தையை கட்டுப்படுத்த பயன்படுத்தப்படலாம் :func: `~qiskit.tools.parallel_map`. பல செயல்முறைகளில் இயங்க இயல்புநிலையை அமைக்க `` QISKIT_PARALLEL`` விருப்பத்தை `` True`` (எந்த மூலதனமாக்கல்) என அமைக்கலாம் :func: `~qiskit.tools.parallel_map` என அழைக்கப்படும் போது. இது வேறு எந்த மதிப்புக்கும் அமைக்கப்பட்டால் :func: `~qiskit.tools.parallel_map` தொடர்ச்சியாக செயல்படுத்தப்படும். `` QISKIT_NUM_PROCS`` ஒரு முழு எண்ணை எடுக்கிறது (எடுத்துக்காட்டாக `` QISKIT_NUM_PROCS = 5``) இது இயங்குவதற்கான செயல்முறைகளின் இயல்புநிலை எண்ணிக்கையாகப் பயன்படுத்தப்படும். இவை இரண்டும் பயனர் கட்டமைப்பு கோப்பில் அமைக்கப்பட்ட சமமான விருப்பத்தை விட முன்னுரிமை பெறும்.

source: A new method, :meth:`~qiskit.circuit.ParameterExpression.gradient`, has been added to the :class:`~qiskit.circuit.ParameterExpression` class. This method is used to evaluate the gradient of a :class:`~qiskit.circuit.ParameterExpression` object.
ta_in: ஒரு புதிய முறை ,:meth: `~qiskit.circuit.ParameterExpression.gradient`, வகுப்பில் சேர்க்கப்பட்டுள்ளது :class:`~qiskit.circuit.ParameterExpression` வகுப்பில். :class: `~ qiskit.circuit.ParameterExpression` பொருளின் சாய்வு மதிப்பீடு செய்ய இந்த முறை பயன்படுத்தப்படுகிறது.

source: The ``__eq__`` method (ie what is called when the ``==`` operator is used) for the :class:`~qiskit.circuit.ParameterExpression` now allows for the comparison with a numeric value. Previously, it was only possible to compare two instances of :class:`~qiskit.circuit.ParameterExpression` with ``==``. For example::
ta_in: வகுப்பிற்கான `` __eq__`` முறை (அதாவது `` == `` ஆபரேட்டர் பயன்படுத்தப்படும்போது அழைக்கப்படுகிறது) :class: `~qiskit.circuit.ParameterExpression` இப்போது ஒரு எண் மதிப்புடன் ஒப்பிட்டுப் பார்க்க அனுமதிக்கிறது. முன்னதாக, வர்க்கத்தின் இரண்டு நிகழ்வுகளை மட்டுமே ஒப்பிட முடியும் :class: `~ qiskit.circuit.ParameterExpression` உடன் ``==` `. உதாரணத்திற்கு::

source: The :class:`~qiskit.circuit.library.PauliFeatureMap` class in the :mod:`qiskit.circuit.library` module now supports adjusting the rotational factor, :math:`\alpha`, by either setting using the kwarg ``alpha`` on the constructor or setting the :attr:`~qiskit.circuit.library.PauliFeatureMap.alpha` attribute after creation. Previously this value was fixed at ``2.0``. Adjusting this attribute allows for better control of decision boundaries and provides additional flexibility handling the input features without needing to explicitly scale them in the data set.
ta_in: :class: `qiskit.circuit.library.PauliFeatureMap` வர்க்கம்:mod:` qiskit.circuit.library` தொகுதி இப்போது சுழற்சி காரணியை சரிசெய்ய ஆதரிக்கிறது, :math:`\alpha`, குவார்க்கைப் பயன்படுத்தி அமைப்பதன் மூலம்` கட்டமைப்பாளரின் மீது ``alpha`` அல்லது அமைத்தல் :attr:` ~ qiskit.circuit.library.PauliFeatureMap.alpha` பண்புக்கூறு உருவாக்கிய பின். முன்பு இந்த மதிப்பு ``2.0`` என நிர்ணயிக்கப்பட்டது. இந்த பண்புக்கூறு சரிசெய்தல் முடிவு எல்லைகளை சிறப்பாக கட்டுப்படுத்த அனுமதிக்கிறது மற்றும் தரவு தொகுப்பில் வெளிப்படையாக அளவிட வேண்டிய அவசியமின்றி உள்ளீட்டு அம்சங்களை கையாள கூடுதல் நெகிழ்வுத்தன்மையை வழங்குகிறது.

source: A new :class:`~qiskit.circuit.Gate` class, :class:`~qiskit.circuit.library.PauliGate`, has been added the :class:`qiskit.circuit.library` module and corresponding method, :meth:`~qiskit.circuit.QuantumCircuit.pauli`, was added to the :class:`~qiskit.circuit.QuantumCircuit` class. This new gate class enables applying several individual pauli gates to different qubits at the simultaneously. This is primarily useful for simulators which can use this new gate to more efficiently implement multiple simultaneous Pauli gates.
ta_in: ஒரு புதிய:class: `~ qiskit.circuit.Gate` , :class:` ~ qiskit.circuit.library.PauliGate`, சேர்க்கப்பட்டுள்ளது :class: `qiskit.circuit.library` தொகுதி மற்றும் தொடர்புடைய முறை ,:meth: `~ qiskit.circuit.QuantumCircuit.pauli`, வகுப்பில் சேர்க்கப்பட்டது :class:` ~ qiskit.circuit.QuantumCircuit` வகுப்பில். இந்த புதிய கேட் வகுப்பு ஒரே நேரத்தில் வெவ்வேறு குவிட்டுகளுக்கு பல தனிப்பட்ட பாலி வாயில்களைப் பயன்படுத்த உதவுகிறது. ஒரே நேரத்தில் பல பாலி வாயில்களை மிகவும் திறமையாக செயல்படுத்த இந்த புதிய வாயிலைப் பயன்படுத்தக்கூடிய சிமுலேட்டர்களுக்கு இது முதன்மையாக பயனுள்ளதாக இருக்கும்.

source: Improve the :class:`qiskit.quantum_info.Pauli` operator. This class now represents and element from the full N-qubit Pauli group including complex coefficients. It now supports the Operator API methods including :meth:`~qiskit.quantum_info.Pauli.compose`, :meth:`~qiskit.quantum_info.Pauli.dot`, :meth:`~qiskit.quantum_info.Pauli.tensor` etc, where compose and dot are defined with respect to the full Pauli group.
ta_in: வகுப்பை மேம்படுத்தவும் :class: `qiskit.quantum_info.Pauli` ஆபரேட்டர். இந்த வர்க்கம் இப்போது சிக்கலான குணகங்களை உள்ளடக்கிய முழு N-qubit Pauli குழுவிலிருந்து பிரதிநிதித்துவப்படுத்துகிறது. இது இப்போது ஆபரேட்டர் ஏபிஐ முறைகளை ஆதரிக்கிறது :meth: `~ qiskit.quantum_info.Pauli.compose` , :meth:` ~ qiskit.quantum_info.Pauli.dot` ,:meth: `~ qiskit.quantum_info.Pauli.tensor` போன்றவை , முழு பவுலி குழுவைப் பொறுத்து இசையமைத்தல் மற்றும் புள்ளி ஆகியவை வரையறுக்கப்படுகின்றன.

source: This class also allows conversion to and from the string representation of Pauli's for convenience.
ta_in: இந்த வகுப்பு வசதிக்காக பவுலியின் சரம் பிரதிநிதித்துவத்திற்கு மாற்றுவதற்கும் அனுமதிக்கிறது.

source: For example
ta_in: உதாரணத்திற்கு

source: Pauli's can also be directly appended to :class:`~qiskit.circuit.QuantumCircuit` objects
ta_in: பவுலியையும் நேரடியாக இணைக்கலாம் :class: `~ qiskit.circuit.QuantumCircuit` பொருள்கள்

source: Additional methods allow computing when two Pauli's commute (using the :meth:`~qiskit.quantum_info.Pauli.commutes` method) or anticommute (using the :meth:`~qiskit.quantum_info.Pauli.anticommutes` method), and computing the Pauli resulting from Clifford conjugation :math:`P^\prime = C.P.C^\dagger` using the :meth:`~qiskit.quantum_info.Pauli.evolve` method.
ta_in: கூடுதல் முறைகள் இரண்டு பவுலியின் பயணத்தின் போது (:meth: `q qiskit.quantum_info.Pauli.commutes` முறையைப் பயன்படுத்தி) அல்லது ஆன்டிகாம்முட் (:meth:`~qiskit.quantum_info.Pauli.anticommutes` முறையைப் பயன்படுத்தி), மற்றும் கணக்கிடும்போது கணக்கிட அனுமதிக்கின்றன. கிளிஃபோர்டு இணைப்பின் விளைவாக உருவாகும் பவுலி :math:`P^\prime = C.P.C^\dagger` ஐப் பயன்படுத்தி :meth:` ~ qiskit.quantum_info.Pauli.evolve` முறையைப் பயன்படுத்துதல்.

source: See the API documentation of the :class:`~qiskit.quantum_info.Pauli` class for additional information.
ta_in: கூடுதல் தகவலுக்கு :class: `~qiskit.quantum_info.Pauli` வகுப்பின் API ஆவணங்களைக் காண்க.

source: A new function, :func:`~qiskit.quantum_info.random_pauli`, for generating a random element of the N-qubit Pauli group has been added to the :mod:`qiskit.quantum_info` module.
ta_in: ஒரு புதிய செயல்பாடு ,:func: `~ qiskit.quantum_info.random_pauli`, N-qubit Pauli குழுவின் சீரற்ற உறுப்பை உருவாக்குவதற்கு:mod:` qiskit.quantum_info` தொகுதிக்கு சேர்க்கப்பட்டுள்ளது.

source: A new class, :class:`~qiskit.circuit.library.PiecewisePolynomialPauliRotations`, has been added to the :mod:`qiskit.circuit.library` module. This circuit library element is used for mapping a piecewise polynomial function, :math:`f(x)`, which is defined through breakpoints and coefficients, on qubit amplitudes. The breakpoints :math:`(x_0, ..., x_J)` are a subset of :math:`[0, 2^n-1]`, where :math:`n` is the number of state qubits. The corresponding coefficients :math:`[a_{j,1},...,a_{j,d}]`, where :math:`d` is the highest degree among all polynomials. Then :math:`f(x)` is defined as:
ta_in: ஒரு புதிய வகுப்பு ,:class: `~ qiskit.circuit.library.PiecewisePolynomialPauliRotations`, இதில் சேர்க்கப்பட்டுள்ளது :mod:` qiskit.circuit.library` தொகுதிக்கு. இந்த சுற்று நூலக உறுப்பு ஒரு பிஸ்கேஸ் பல்லுறுப்புறுப்பு செயல்பாட்டை மேப்பிங் செய்யப் பயன்படுகிறது :math: `f (x)`, இது இடைவெளி புள்ளிகள் மற்றும் குணகங்களின் மூலம் வரையறுக்கப்படுகிறது, இது குவிட் பெருக்கங்களில். முறிவு புள்ளிகள் :math: `(x_0, ..., x_J)` என்பதன் துணைக்குழு:math: `[0, 2 ^ n-1]`, எங்கே :math: `n` என்பது மாநில குவிட்களின் எண்ணிக்கை. தொடர்புடைய குணகங்கள் :math: `[a_{j,1}, ..., a_ {j,d}]`, எங்கே :math: `d` என்பது அனைத்து பல்லுறுப்புக்கோவைகளிலும் மிக உயர்ந்த பட்டம். பின்னர் :math:`f(x)` என வரையறுக்கப்படுகிறது:

source: where we implicitly assume :math:`x_{J+1} = 2^n`. And the mapping applied to the amplitudes is given by
ta_in: நாம் மறைமுகமாக கருதுகிறோம் :math: `x_{J+1}= 2 ^ n`. மேலும் பெருக்கங்களுக்கு பயன்படுத்தப்படும் மேப்பிங் வழங்கப்படுகிறது

source: This mapping is based on controlled Pauli Y-rotations and constructed using the :class:`~qiskit.circuit.library.PolynomialPauliRotations`.
ta_in: இந்த மேப்பிங் கட்டுப்படுத்தப்பட்ட பவுலி ஒய்-சுழற்சிகளை அடிப்படையாகக் கொண்டது மற்றும் வகுப்பைப் பயன்படுத்தி கட்டப்பட்டது :class: `~ qiskit.circuit.library.PolynomialPauliRotations`.

source: A new module :mod:`qiskit.algorithms` has been introduced. This module contains functionality equivalent to what has previously been provided by the :mod:`qiskit.aqua.algorithms` module (which is now deprecated) and provides the building blocks for constructing quantum algorithms. For details on migrating from ``qiskit-aqua`` to this new module please refer to the migration guide :ref:`aqua-migration`
ta_in: ஒரு புதிய தொகுதி:mod: `qiskit.algorithms` அறிமுகப்படுத்தப்பட்டுள்ளது. இந்த தொகுதி முன்னர் வழங்கியவற்றிற்கு சமமான செயல்பாட்டைக் கொண்டுள்ளது:mod: `qiskit.aqua.algorithms` தொகுதி (இது இப்போது நீக்கப்பட்டது) மற்றும் குவாண்டம் வழிமுறைகளை உருவாக்குவதற்கான கட்டுமானத் தொகுதிகளை வழங்குகிறது. இந்த புதிய தொகுதிக்கு ``qiskit-aqua`` இலிருந்து இடம்பெயர்வது குறித்த விவரங்களுக்கு தயவுசெய்து இடம்பெயர்வு வழிகாட்டியைப் பார்க்கவும் :ref:`aqua-migration`

source: A new module :mod:`qiskit.opflow` has been introduced. This module contains functionality equivalent to what has previously been provided by the :mod:`qiskit.aqua.operators` module (which is now deprecated) and provides the operators and state functions which are used to build quantum algorithms. For details on migrating from ``qiskit-aqua`` to this new module please refer to the migration guide :ref:`aqua-migration`
ta_in: ஒரு புதிய தொகுதி :mod: `qiskit.opflow` அறிமுகப்படுத்தப்பட்டுள்ளது. இந்த தொகுதி முன்னர் வழங்கியவற்றிற்கு சமமான செயல்பாட்டைக் கொண்டுள்ளது :mod: `qiskit.aqua.operators` module (இது இப்போது நீக்கப்பட்டது) மற்றும் குவாண்டம் வழிமுறைகளை உருவாக்க பயன்படும் ஆபரேட்டர்கள் மற்றும் மாநில செயல்பாடுகளை வழங்குகிறது. இந்த புதிய தொகுதிக்கு ``qiskit-aqua`` இலிருந்து இடம்பெயர்வது குறித்த விவரங்களுக்கு தயவுசெய்து இடம்பெயர்வு வழிகாட்டியைப் பார்க்கவும் :ref: `அக்வா-இடம்பெயர்வு`

source: This is the first release that includes precompiled binary wheels for the for Linux aarch64 systems. If you are running a manylinux2014 compatible aarch64 Linux system there are now precompiled wheels available on PyPI, you are no longer required to build from source to install qiskit-terra.
ta_in: லினக்ஸ் அராச் 64 அமைப்புகளுக்கான முன் தொகுக்கப்பட்ட பைனரி சக்கரங்களை உள்ளடக்கிய முதல் வெளியீடு இதுவாகும். நீங்கள் பல லினக்ஸ் 2014 இணக்கமான aarch64 லினக்ஸ் அமைப்பை இயக்குகிறீர்கள் என்றால், இப்போது PyPI இல் முன்பே தொகுக்கப்பட்ட சக்கரங்கள் உள்ளன, கிஸ்கிட்-டெர்ராவை நிறுவ நீங்கள் இனி மூலத்திலிருந்து உருவாக்க வேண்டியதில்லை.

source: The :func:`qiskit.quantum_info.process_fidelity` function is now able to be used with a non-unitary target channel. In this case the returned value is equivalent to the :func:`qiskit.quantum_info.state_fidelity` of the normalized :class:`qiskit.quantum_info.Choi` matrices for the channels.
ta_in: :func: `qiskit.quantum_info.process_fidelity` செயல்பாடு இப்போது ஒற்றையல்லாத இலக்கு சேனலுடன் பயன்படுத்தப்பட முடியும். இந்த வழக்கில் திரும்பிய மதிப்பு இயல்பாக்கப்பட்ட:func: `qiskit.quantum_info.state_fidelity` க்கு சமம்: சேனல்களுக்கான :class:` qiskit.quantum_info.Choi` மெட்ரிக்குகள்.

source: Note that the :func:`qiskit.quantum_info.average_gate_fidelity` and :func:`qiskit.quantum_info.gate_error` functions still require the target channel to be unitary and will raise an exception if it is not.
ta_in: நினைவில் கொள்ளுங்கள்:func: `qiskit.quantum_info.average_gate_fidelity` மற்றும் :func:` qiskit.quantum_info.gate_error` செயல்பாடுகளுக்கு இலக்கு சேனல் ஒற்றுமையாக இருக்க வேண்டும், அது இல்லாவிட்டால் விதிவிலக்கு எழுப்புகிறது.

source: Added a new pulse builder function, :func:`qiskit.pulse.macro`. This enables normal Python functions to be decorated as macros. This enables pulse builder functions to be used within the decorated function. The builder macro can then be called from within a pulse building context, enabling code reuse.
ta_in: புதிய துடிப்பு பில்டர் செயல்பாட்டைச் சேர்த்தது , :func: `qiskit.pulse.macro`. இது சாதாரண பைதான் செயல்பாடுகளை மேக்ரோக்களாக அலங்கரிக்க உதவுகிறது. இது துடிப்பு பில்டர் செயல்பாடுகளை அலங்கரிக்கப்பட்ட செயல்பாட்டிற்குள் பயன்படுத்த உதவுகிறது. பில்டர் மேக்ரோவை ஒரு துடிப்பு கட்டிட சூழலில் இருந்து அழைக்கலாம், இது குறியீடு மறுபயன்பாட்டை செயல்படுத்துகிறது.

source: For Example:
ta_in: உதாரணத்திற்கு:

source: A new class, :class:`~qiskit.circuit.library.PauliTwoDesign`, was added to the :mod:`qiskit.circuit.library` which implements a particular form of a 2-design circuit from https://arxiv.org/pdf/1803.11173.pdf For instance, this circuit can look like:
ta_in: ஒரு புதிய வகுப்பு ,:class: `~ qiskit.circuit.library.PauliTwoDesign`, இதில் சேர்க்கப்பட்டுள்ளது:mod:` qiskit.circuit.library` இது https://arxiv.org/pdf/1803.11173.pdf இலிருந்து 2-வடிவமைப்பு சுற்றுக்கான ஒரு குறிப்பிட்ட வடிவத்தை செயல்படுத்துகிறது. உதாரணமாக, இந்த சுற்று இப்படி இருக்கும்:

source: A new pulse drawer :func:`qiskit.visualization.pulse_v2.draw` (which is aliased as ``qiskit.visualization.pulse_drawer_v2``) is now available. This new pulse drawer supports multiple new features not present in the original pulse drawer (:func:`~qiskit.visualization.pulse_drawer`).
ta_in: ஒரு புதிய துடிப்பு இழுப்பறை :func:'qiskit.visualization.pulse_v2.draw' (இது 'qiskit.visualization.pulse_drawer_v2' என்று அழைக்கப்படுகிறது) இப்போது கிடைக்கிறது. இந்த புதிய துடிப்பு இழுப்பறை அசல் துடிப்பு இழுப்பறையில் இல்லாத பல புதிய அம்சங்களை ஆதரிக்கிறது (:func:'~qiskit.visualization.pulse_drawer').

source: Truncation of long pulse instructions.
ta_in: நீண்ட பல்ஸ் வழிமுறைகளை திருகுதல்.

source: Visualization of parametric pulses.
ta_in: பாராமெட்ரிக் பருப்புவகைகளை காட்சிப்படுத்துதல்.

source: New stylesheets ``IQXStandard``, ``IQXSimple``, ``IQXDebugging``.
ta_in: புதிய பாணிதாள்கள் 'ஐக்யூஎக்ஸ்ஸ்டாண்டர்ட்', 'ஐக்யூஎக்ஸ்சிம்பிள்', 'ஐக்யூஎக்ஸ்டிபக்கிங்'.

source: Visualization of system info (channel frequency, etc...) by specifying :class:`qiskit.providers.Backend` objects for visualization.
ta_in: கணினி தகவல் காட்சிப்படுத்தல் (சேனல் அதிர்வெண், முதலியன...) குறிப்பிடுவதன் மூலம் :class:'கிஸ்கிட்.வழங்குநர்கள்.பேக்எண்ட்' காட்சிப்படுத்தலுக்கான பொருள்கள்.

source: Specifying ``axis`` objects for plotting to allow further extension of generated plots, i.e., for publication manipulations.
ta_in: உருவாக்கப்பட்ட மனைகளை மேலும் நீட்டிக்க, அதாவது, வெளியீடு கையாளுதல்களுக்கு அனுமதிக்கும் சதித்திட்டம் 'அச்சு' பொருட்களைகுறிப்பிடுதல்.

source: New stylesheets can take callback functions that dynamically modify the apperance of the output image, for example, reassembling a collection of channels, showing details of instructions, updating appearance of pulse envelopes, etc... You can create custom callback functions and feed them into a stylesheet instance to modify the figure appearance without modifying the drawer code. See pulse drawer module docstrings for details.
ta_in: புதிய பாணிதாள்கள் வெளியீடு படத்தின் அபெராஸை மாறும் வகையில் மாற்றியமைக்கும் அழைப்பு செயல்பாடுகளை எடுக்கலாம், எடுத்துக்காட்டாக, சேனல்களின் தொகுப்பை மீண்டும் ஒன்றுசேர்ப்பது, அறிவுறுத்தல்களின் விவரங்களைக் காட்டுவது, துடிப்பு உறைகளின் தோற்றத்தைபுதுப்பிப்பது போன்றவை... நீங்கள் விருப்ப அழைப்பு செயல்பாடுகளை உருவாக்க மற்றும் இழுப்பறை குறியீடு மாற்றாமல் எண்ணிக்கை தோற்றத்தை மாற்ற ஒரு பாணிதாள் நிகழ்வில் அவற்றை உணவளிக்க முடியும். விவரங்களுக்கு துடிப்பு இழுப்பறை தொகுதி ஆவணக்சரங்களைப் பார்க்கவும்.

source: Note that file saving is now delegated to Matplotlib. To save image files, you need to call ``savefig`` method with returned ``Figure`` object.
ta_in: கோப்பு சேமிப்பு இப்போது மாட்ப்ளோட்லிப்பிற்கு ஒப்படைக்கப்பட்டுள்ளது என்பதை நினைவில் கொள்க. படிமக் கோப்புகளைச் சேமிக்க, 'savefig' முறையை திருப்பிய 'Figure' பொருள் மூலம் அழைக்க வேண்டும்.

source: Adds a :meth:`~qiskit.quantum_info.Statevector.reverse_qargs` method to the :class:`qiskit.quantum_info.Statevector` and :class:`qiskit.quantum_info.DensityMatrix` classes. This method reverses the order of subsystems in the states and is equivalent to the :meth:`qiskit.circuit.QuantumCircuit.reverse_bits` method for N-qubit states. For example:
ta_in: ஒரு சேர்க்கிறது :meth:'~qiskit.quantum_info. Statevector.reverse_qargs' முறை :class:'qiskit.quantum_info. ஸ்டேட்வெக்டர்' மற்றும் :class:'qiskit.quantum_info. அடர்த்தி மேட்ரிக்ஸ் வகுப்புகள். இந்த முறை மாநிலங்களில் துணை அமைப்புகளின் வரிசையை மாற்றியமைக்கிறது மற்றும் என்-குபிட் மாநிலங்களுக்கான :meth:'qiskit.circuit.QuantumCircuit.reverse_bits' முறைக்கு சமமானது. உதாரணமாக:

source: Adds a :meth:`~qiskit.quantum_info.Operator.reverse_qargs` method to the :class:`qiskit.quantum_info.Operator` class. This method reverses the order of subsystems in the operator and is equivalent to the :meth:`qiskit.circuit.QuantumCircuit.reverse_bits` method for N-qubit operators. For example:
ta_in: ஒரு சேர்க்கிறது :meth:'~qiskit.quantum_info. Operator.reverse_qargs' முறை :class:'qiskit.quantum_info. ஆபரேட்டர் வகுப்பு. இந்த முறை ஆபரேட்டரைதுணை அமைப்புகளின் வரிசையை மாற்றியமைக்கிறது மற்றும் என்-குபிட் ஆபரேட்டர்களுக்கான :meth:'qiskit.circuit.QuantumCircuit.reverse_bits' முறைக்கு சமமானது. உதாரணமாக:

source: The ``latex`` output method for the :func:`qiskit.visualization.circuit_drawer` function and the :meth:`~qiskit.circuit.QuantumCircuit.draw` method now will use a user defined label on gates in the output visualization. For example::
ta_in: "latex" வெளியீடு முறை :func:'qiskit.visualization.circuit_drawer' செயல்பாடு மற்றும் :meth:'~qiskit.circuit.QuantumCircuit.draw' முறை இப்போது வெளியீடு காட்சிப்படுத்தலில் வாயில்களில் ஒரு பயனர் வரையறுக்கப்பட்ட லேபிளைப் பயன்படுத்தும். உதாரணமாக::
