Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: Adds :class:`qiskit.providers.aer.library.SaveExpectationValue` and :class:`qiskit.providers.aer.library.SaveExpectationValueVariance` quantum circuit instructions for saving the expectation value :math:`\langle H\rangle = Tr[H\rho]`, or expectation value and variance :math:`Var(H) = \langle H^2\rangle - \langle H\rangle^2`, of a Hermitian operator :math:`H` for the simulator state :math:`\rho`. These instruction can be appended to a quantum circuit by using the :class:`~qiskit.providers.aer.library.save_expectation_value` and :class:`~qiskit.providers.aer.library.save_expectation_value_variance` circuit methods which is added to ``QuantumCircuit`` when importing Aer.
ta_in: சேர்க்கிறது :class:`qiskit.providers.aer.library.SaveExpectationValue` மற்றும் :class:`qiskit.providers.aer.library.SaveExpectationValue Variance` எதிர்பார்ப்பு மதிப்பைச் சேமிப்பதற்கான குவாண்டம் சுற்று வழிமுறைகள்:math:`\langle H\rangle = Tr[H\rho]`,அல்லது எதிர்பார்ப்பு மதிப்பு மற்றும் மாறுபாடு:math:`Var(H) = \langle H^2\rangle - \langle H\rangle^2`,ஒரு ஹெர்மிடியன் ஆபரேட்டரின் :math:`H`சிமுலேட்டர் நிலைக்கு :math:`\rho`.இந்த வழிமுறைகளை ஒரு குவாண்டம் சுற்றுக்கு பயன்படுத்தலாம்:class:`~qiskit.providers.aer.library.save_expectation_value`மற்றும் :class:`~qiskit.providers.aer.library.save_expectation_value_variance` சேர்க்கப்பட்ட சுற்று முறைகள்``QuantumCircuit``ஏர் ஐ இறக்குமதி செய்யும் போது.

source: Note that the snapshot instruction :class:`~qiskit.providers.aer.extensions.SnapshotExpectationValue`, is still supported but will be deprecated in a future release.
ta_in: ஸ்னாப்ஷாட் அறிவுறுத்தல் என்பதை நினைவில் கொள்க:class:`~qiskit.providers.aer.extensions.SnapshotExpectationValue`, இன்னும் ஆதரிக்கப்படுகிறது, ஆனால் எதிர்கால வெளியீட்டில் நீக்கப்படும்.

source: Adds :class:`qiskit.providers.aer.library.SaveProbabilities` and :class:`qiskit.providers.aer.library.SaveProbabilitiesDict` quantum circuit instruction for saving all measurement outcome probabilities for Z-basis measurements of the simualtor state. These instruction can be appended to a quantum circuit by using the :class:`~qiskit.providers.aer.library.save_probabilities` and :class:`~qiskit.providers.aer.library.save_probabilities_dict` circuit methods which is added to ``QuantumCircuit`` when importing Aer.
ta_in: சேர்க்கிறது :class:`qiskit.providers.aer.library.SaveProbabilities` மற்றும் :class:`qiskit.providers.aer.library.SaveProbabilitiesDict`சிமுவல்டர் மாநிலத்தின் Z- அடிப்படையிலான அளவீடுகளுக்கான அனைத்து அளவீட்டு விளைவு நிகழ்தகவுகளையும் சேமிப்பதற்கான குவாண்டம் சுற்று வழிமுறை. இந்த வழிமுறைகளை ஒரு குவாண்டம் சுற்றுக்கு பயன்படுத்தலாம் :class:`~qiskit.providers.aer.library.save_probabilities` மற்றும் :class:`~qiskit.providers.aer.library.save_probabilities_dict` சேர்க்கப்பட்ட சுற்று முறைகள்``QuantumCircuit``ஏர் ஐ இறக்குமதி செய்யும் போது.

source: Note that the snapshot instruction :class:`~qiskit.providers.aer.extensions.SnapshotProbabilities`, is still supported but will be deprecated in a future release.
ta_in: ஸ்னாப்ஷாட் அறிவுறுத்தல் என்பதை நினைவில் கொள்க:class:`~qiskit.providers.aer.extensions.SnapshotProbabilities`, இன்னும் ஆதரிக்கப்படுகிறது, ஆனால் எதிர்கால வெளியீட்டில் நீக்கப்படும்.

source: Adds :class:`qiskit.providers.aer.library.SaveAmplitudes` and :class:`qiskit.providers.aer.library.SaveAmplitudesSquared` circuit instructions for saving select complex statevector amplitudes, or select probabilities (amplitudes squared) for supported simulation methods. These instructions can be appended to a quantum circuit by using the :class:`~qiskit.providers.aer.library.save_amplitudes` and :class:`~qiskit.providers.aer.library.save_amplitudes_squared` circuit methods which is added to ``QuantumCircuit`` when importing Aer.
ta_in: சேர்க்கிறது:class: `qiskit.providers.aer.library.SaveAmplitude` மற்றும்:class:` qiskit.providers.aer.library.SaveAmplitudeSquared` தேர்ந்தெடுக்கப்பட்ட சிக்கலான ஸ்டேட்வெக்டர் பெருக்கங்களை சேமிப்பதற்கான சுற்று வழிமுறைகள், அல்லது ஆதரிக்கப்பட்ட உருவகப்படுத்துதல் முறைகளுக்கான நிகழ்தகவுகளை (பெருக்கங்கள்) . :class: `~ qiskit.providers.aer.library.save_amplitude` மற்றும்:class:` ~ qiskit.providers.aer.library.save_amplitude_squared` சுற்று முறைகளைப் பயன்படுத்தி இந்த வழிமுறைகளை ஒரு குவாண்டம் சுற்றுக்குச் சேர்க்கலாம். Aer ஐ இறக்குமதி செய்யும் போது ``QuantumCircuit``.

source: Adds instructions for setting the state of the simulators. These instructions must be defined on the full number of qubits in the circuit. They can be applied at any point in a circuit and will override the simulator state with the one specified. Added instructions are
ta_in: ஒப்புருவாக்கிகளின் நிலையை அமைப்பதற்கான வழிமுறைகளைச் சேர்க்கிறது. இந்த வழிமுறைகள் சுற்றுகளில் உள்ள முழு எண்ணிக்கையிலான க்யூபிட்டுகளில் வரையறுக்கப்பட வேண்டும். அவை ஒரு சுற்றுவட்டத்தின் எந்த நேரத்திலும் பயன்படுத்தப்படலாம் மற்றும் ஒப்புருவாக்கி நிலையை குறிப்பிட்டவற்றுடன் மேலெழுதும். சேர்க்கப்பட்ட வழிமுறைகள்

source: These instruction can be appended to a quantum circuit by using the :class:`~qiskit.providers.aer.library.set_density_matrix`, :class:`~qiskit.providers.aer.library.set_stabilizer`, :class:`~qiskit.providers.aer.library.set_statevector`, :class:`~qiskit.providers.aer.library.set_unitary` circuit methods which are added to ``QuantumCircuit`` when importing Aer.
ta_in: :class:`~qiskit.providers.aer.library.set_density_matrix`, :class:`~qiskit.providers.aer.library.set_stabilizer`, :class:`~qiskit.providers.aer.library.set_statevector`, :class:`~qiskit.providers.aer.library.set_unitary`, ஏரை இறக்குமதி செய்யும் போது ``QuantumCircuit`` இல் சேர்க்கப்படும் இந்த சுற்று முறைகள் ஆகியவற்றைப் பயன்படுத்தி இந்த வழிமுறைகளை ஒரு குவாண்டம் சுற்றுடன் சேர்க்கலாம்.

source: Added support for diagonal gates to the ``"matrix_product_state"`` simulation method.
ta_in: ``"Matrix_product_state"`` உருவகப்படுத்துதல் முறைக்கு மூலைவிட்ட வாயில்களுக்கான ஆதரவு சேர்க்கப்பட்டது.

source: Added support for the ``initialize`` instruction to the ``"matrix_product_state"`` simulation method.
ta_in: `` "matrix_product_state" `` உருவகப்படுத்துதல் முறைக்கு ``initialize`` அறிவுறுத்தலுக்கான ஆதரவு சேர்க்கப்பட்டது.

source: There is a known issue where the simulation of certain circuits with a Kraus noise model using the ``"matrix_product_state"`` simulation method can cause the simulator to crash. Refer to `#306 <https://github.com/Qiskit/qiskit-aer/issues/1184>`__ for more information.
ta_in: `` "Matrix_product_state" `` உருவகப்படுத்துதல் முறையைப் பயன்படுத்தி க்ராஸ் இரைச்சல் மாதிரியுடன் சில சுற்றுகளின் உருவகப்படுத்துதல் சிமுலேட்டரை செயலிழக்கச் செய்யும் ஒரு அறியப்பட்ட சிக்கல் உள்ளது. மேலும் தகவலுக்கு `# 306 <https://github.com/Qiskit/qiskit-aer/issues/1184>` __ ஐப் பார்க்கவும்.

source: The minimum version of `Conan <https://conan.io/>`__ has been increased to 1.31.2. This was necessary to fix a compatibility issue with newer versions of the `urllib3 <https://pypi.org/project/urllib3/>`__ (which is a dependency of Conan). It also adds native support for AppleClang 12 which is useful for users with new Apple computers.
ta_in: `Conan <https://conan.io/>`__ இன் குறைந்தபட்ச பதிப்பு 1.31.2 ஆக உயர்த்தப்பட்டுள்ளது. `urllib3 <https://pypi.org/project/urllib3/>` __ (இது கோனனின் சார்பு) இன் புதிய பதிப்புகளுடன் பொருந்தக்கூடிய சிக்கலை சரிசெய்ய இது அவசியம். இது புதிய ஆப்பிள் கணினிகளைக் கொண்ட பயனர்களுக்கு பயனுள்ளதாக இருக்கும் ஆப்பிள் கிளாங் 12 க்கான சொந்த ஆதரவையும் சேர்க்கிறது.

source: ``pybind11`` minimum version required is 2.6 instead of 2.4. This is needed in order to support CUDA enabled compilation in Windows.
ta_in: ``pybind11`` குறைந்தபட்ச பதிப்பு 2.4 க்கு பதிலாக 2.6 ஆகும். விண்டோஸில் CUDA இயக்கப்பட்ட தொகுப்பை ஆதரிக்க இது தேவைப்படுகிறது.

source: Cython has been removed as a build dependency.
ta_in: கட்டு சார்புநிலையாக சைதான் அகற்றப்பட்டது.

source: Removed x90 gate decomposition from noise models that was deprecated in qiskit-aer 0.7. This decomposition is now done by using regular noise model basis gates and the qiskit transpiler.
ta_in: Qiskit aer 0.7 இல் நீக்கப்பட்ட இரைச்சல் மாதிரிகளிலிருந்து x90 கேட் சிதைவு நீக்கப்பட்டது. வழக்கமான சிதைவு இரைச்சல் மாதிரி அடிப்படை கேட் மற்றும் Qiskit டிரான்ஸ்பைலரைப் பயன்படுத்தி இந்த சிதைவு இப்போது செய்யப்படுகிறது.

source: The following options for the ``"extended_stabilizer"`` simulation method have changed.
ta_in: `` "extended_stabilizer" `` உருவகப்படுத்துதல் முறைக்கான பின்வரும் விருப்பங்கள் மாற்றப்பட்டுள்ளன.

source: ``extended_stabilizer_measure_sampling``: This option has been replaced by the options ``extended_stabilizer_sampling_method``, which controls how we simulate qubit measurement.
ta_in: ``extended_stabilizer_measure_sampling``: இந்த விருப்பம் ``extended_stabilizer_sampling_method`` விருப்பங்களால் மாற்றப்பட்டுள்ளது, இது க்யூபிட் அளவீட்டை எவ்வாறு உருவகப்படுத்துகிறோம் என்பதைக் கட்டுப்படுத்துகிறது.

source: ``extended_stabilizer_mixing_time``: This option has been renamed as ``extended_stabilizer_metropolis_mixing_time`` to clarify it only applies to the ``metropolis`` and ``resampled_metropolis`` sampling methods.
ta_in: `` extended_stabilizer_mixing_time``: இதை தெளிவுபடுத்துவதற்காக இந்த விருப்பம் `` extended_stabilizer_metropolis_mixing_time`` என மறுபெயரிடப்பட்டது, இது `` metropolis`` மற்றும் `` resampled_metropolis`` மாதிரி முறைகளுக்கு மட்டுமே பொருந்தும்.

source: ``extended_stabilizer_norm_estimation_samples``: This option has been renamed to ``extended_stabilizer_norm_estimation_default_samples``.
ta_in: ``extended_stabilizer_norm_estimation_samples``: இந்த விருப்பம் ``extended_stabilizer_norm_estimation_default_samples`` என மறுபெயரிடப்பட்டது.

source: One additional option, ``extended_stabilizer_norm_estimation_repetitions`` has been added, whih controls part of the behaviour of the norm estimation sampling method.
ta_in: ஒரு கூடுதல் விருப்பம், ``extended_stabilizer_norm_estimation_repetitions`` சேர்க்கப்பட்டுள்ளது, இது விதிமுறை மதிப்பீட்டு மாதிரி முறையின் நடத்தையின் ஒரு பகுதியைக் கட்டுப்படுத்துகிறது.

source: Fixes bug with :class:`~qiskit.providers.aer.AerProvider` where options set on the returned backends using :meth:`~qiskit.providers.aer.QasmSimulator.set_options` were stored in the provider and would persist for subsequent calls to :meth:`~qiskit.providers.aer.AerProvider.get_backend` for the same named backend. Now every call to and :meth:`~qiskit.providers.aer.AerProvider.backends` returns a new instance of the simulator backend that can be configured.
ta_in: பிழையை சரிசெய்கிறது: வர்க்கம்: `~ qiskit.providers.aer.AerProvider` ஐப் பயன்படுத்தி திரும்பிய பின்தளத்தில் விருப்பங்கள் அமைக்கப்படுகின்றன: மெத்:` ~ qiskit.providers.aer.QasmSimulator.set_options` வழங்குநரில் சேமிக்கப்பட்டு அடுத்தடுத்த அழைப்புகளுக்கு தொடர்ந்து இருக்கும் to: meth: `~ qiskit.providers.aer.AerProvider.get_backend` அதே பெயரிடப்பட்ட பின்தளத்தில். இப்போது ஒவ்வொரு அழைப்பும் மற்றும்: மெத்: `~ qiskit.providers.aer.AerProvider.backends` கட்டமைக்கக்கூடிய சிமுலேட்டர் பின்தளத்தில் ஒரு புதிய நிகழ்வை வழங்குகிறது.

source: Fixes bug in the error message returned when a circuit contains unsupported simulator instructions. Previously some supported instructions were also being listed in the error message along with the unsupported instructions.
ta_in: பிழை செய்தியில் பிழை தகவல் திரும்பி திரும்பும் போது ஒரு சுற்றுச்சொல் ஆதரிக்கப்படாத உரையாடல் கட்டளையை கொண்டிருக்கும். முன்னதாக சில ஆதரவுப் பரிந்துரைகள் பிழை செய்திகளில் பட்டியலிடப்பட்டன.

source: Fixes issue with setting :class:`~qiskit.providers.aer.QasmSimulator` basis gates when using ``"method"`` and ``"noise_model"`` options together, and when using them with a simulator constructed using :meth:`~qiskit.providers.aer.QasmSimulator.from_backend`. Now the listed basis gates will be the intersection of gates supported by the backend configuration, simulation method, and noise model basis gates. If the intersection of the noise model basis gates and simulator basis gates is empty a warning will be logged.
ta_in: அமைப்பில் சிக்கலை சரிசெய்கிறது: வர்க்கம்: `~ qiskit.providers.aer.QasmSimulator` அடிப்படை வாயில்கள்` `" முறை "` `மற்றும்` `" சத்தம்_மாடல் "` `விருப்பங்களை ஒன்றாகப் பயன்படுத்தும் போது, ​​அவற்றைப் பயன்படுத்தி உருவாக்கப்பட்ட சிமுலேட்டருடன் பயன்படுத்தும் போது: மெத் : `~ qiskit.providers.aer.QasmSimulator.from_backend`. இப்போது பட்டியலிடப்பட்ட அடிப்படை வாயில்கள் பின்தளத்தில் உள்ளமைவு, உருவகப்படுத்துதல் முறை மற்றும் இரைச்சல் மாதிரி அடிப்படை வாயில்கள் ஆதரிக்கும் வாயில்களின் குறுக்குவெட்டாக இருக்கும். இரைச்சல் மாதிரி அடிப்படை வாயில்கள் மற்றும் சிமுலேட்டர் அடிப்படை வாயில்கள் வெட்டுவது காலியாக இருந்தால் எச்சரிக்கை பதிவு செய்யப்படும்.

source: Fix bug where the ``"sx"``` gate :class:`~qiskit.circuit.library.SXGate` was not listed as a supported gate in the C++ code, in ``StateOpSet`` of ``matrix_product_state.hp``.
ta_in: பிழை சரிசெய்யவும், ``"sx"`` `கேட் :class:`~qiskit.circuit.library.SXGate ஆனது C ++ குறியீட்டில் ஆதரிக்கப்படும் வாயிலாக பட்டியலிடப்படவில்லை, ``matrix_product_state.hp`` இன் ``StateOpSet``.

source: Fix bug where ``"csx"``, ``"cu2"``, ``"cu3"`` were incorrectly listed as supported basis gates for the ``"density_matrix"`` method of the :class:`~qiskit.providers.aer.QasmSimulator`.
ta_in: `` "சி.எஸ்.எக்ஸ்" ``, `` "கியூ 2" ``, `` "கியூ 3" `` ஆகியவை `` "அடர்த்தி_மாட்ரிக்ஸ்" `` முறை: வகுப்பின்: `~ முறைக்கு ஆதரிக்கப்பட்ட அடிப்படை வாயில்களாக தவறாக பட்டியலிடப்பட்ட பிழையை சரிசெய்யவும். qiskit.providers.aer.QasmSimulator`.

source: Fix bug where parameters were passed incorrectly between functions in ``matrix_product_state_internal.cpp``, causing wrong simulation, as well as reaching invalid states, which in turn caused an infinite loop.
ta_in: `` Matrix_product_state_internal.cpp`` இல் உள்ள செயல்பாடுகளுக்கு இடையில் அளவுருக்கள் தவறாக அனுப்பப்பட்ட பிழையை சரிசெய்யவும், இது தவறான உருவகப்படுத்துதலை ஏற்படுத்துகிறது, மேலும் தவறான நிலைகளை அடைகிறது, இது எல்லையற்ற சுழற்சியை ஏற்படுத்தியது.

source: Fixes a bug that resulted in ``c_if`` not working when the width of the conditional register was greater than 64. See `#1077 <https://github.com/Qiskit/qiskit-aer/issues/1077>`__.
ta_in: நிபந்தனை பதிவேட்டின் அகலம் 64 ஐ விட அதிகமாக இருக்கும்போது `` c_if`` வேலை செய்யாத ஒரு பிழையை சரிசெய்கிறது. `# 1077 <https://github.com/Qiskit/qiskit-aer/issues/1077>` __.

source: Fixes a bug `#1153 <https://github.com/Qiskit/qiskit-aer/issues/1153>`__) where noise on conditional gates was always being applied regardless of whether the conditional gate was actually applied based on the classical register value. Now noise on a conditional gate will only be applied in the case where the conditional gate is applied.
ta_in: ஒரு பிழையை சரிசெய்கிறது `# 1153 <https://github.com/Qiskit/qiskit-aer/issues/1153>` __) அங்கு நிபந்தனை வாயில்களில் சத்தம் எப்போதும் கிளாசிக்கல் அடிப்படையில் நிபந்தனை வாயில் பயன்படுத்தப்பட்டதா என்பதைப் பொருட்படுத்தாமல் பயன்படுத்தப்படுகிறது. பதிவு மதிப்பு. இப்போது நிபந்தனை வாயிலில் சத்தம் நிபந்தனை வாயில் பயன்படுத்தப்படும் வழக்கில் மட்டுமே பயன்படுத்தப்படும்.

source: Fixes a bug with nested OpenMP flag was being set to true when it shouldn't be.
ta_in: ஒரு பிழை நீக்கப்பட்ட OpenMP கொள்கையை அமைக்கும் போது உண்மையில் அமைக்கப்பட்டிருக்கும்.

source: Fixes a bug when applying truncation in the matrix product state method of the QasmSimulator.
ta_in: QasmSimulator யின் மாட்ரிக்ஸ் உற்பத்தி மாநில முறையில் தட்டை பயன்படுத்தும்போது ஒரு பிழை நீக்கு.

source: Fixed issue `#1126 <https://github.com/Qiskit/qiskit-aer/issues/1126>`__: bug in reporting measurement of a single qubit. The bug occured when copying the measured value to the output data structure.
ta_in: திருத்தப்பட்ட பிழை `#1126 <https://github.com/Qiskit/qiskit-aer/issues/1126>`__: ஒற்றை Qubit-ன் அளவீட்டை அறிக்கையளிப்பதில் பிழை. அளவிடப்பட்ட மதிப்பை வெளியீட்டு தரவு கட்டமைப்பிற்கு நகலெடுக்கும் போது பிழை ஏற்பட்டது.

source: In MPS, apply_kraus was operating directly on the input bits in the parameter qubits, instead of on the internal qubits. In the MPS algorithm, the qubits are constantly moving around so all operations should be applied to the internal qubits.
ta_in: MPS இல், apply_kraus ஆனது உள் குவிட்டுகளுக்குப் பதிலாக, அளவுரு குவிட்டுகளில் உள்ளீட்டு பிட்களில் நேரடியாக இயங்குகிறது. எம். பி. எஸ் வழிமுறையில், குவிட்கள் தொடர்ந்து சுற்றி வருகின்றன, எனவே அனைத்து செயல்பாடுகளும் உள் குவிட்டுகளுக்கு பயன்படுத்தப்பட வேண்டும்.

source: When invoking MPS::sample_measure, we need to first sort the qubits to the default ordering because this is the assumption in qasm_controller.This is done by invoking the method move_all_qubits_to_sorted_ordering. It was correct in sample_measure_using_apply_measure, but missing in sample_measure_using_probabilities.
ta_in: MPS:: sample_measure ஐத் தொடங்கும்போது, ​​நாம் முதலில் qitsm_controller இல் உள்ள அனுமானமாக இருப்பதால், முன்னிருப்புகளை வரிசைப்படுத்த வேண்டும். இது move_all_qubits_to_sorted_ordering முறையைத் தொடங்குவதன் மூலம் செய்யப்படுகிறது. இது மாதிரி_அளவு_பயன்படுத்தல்_அறிவிப்பு_ அளவீட்டில் சரியானது, ஆனால் மாதிரி_அளவு_பயன்படுத்தல்_செயல்பாடுகளில் காணவில்லை.

source: Fixes bug with the :meth:`~qiskit.providers.aer.QasmSimulator.from_backend` method of the :class:`~qiskit.provider.aer.QasmSimulator` that would set the ``local`` attribute of the configuration to the backend value rather than always being set to ``True``.
ta_in: :class:`~qiskit.provider.aer.QasmSimulator`யின் :meth:`~qiskit.providers.aer.QasmSimulator.from_backend` முறையின் பிழையை சரிசெய்கிறது. இது எப்போதும் `` True`` என அமைக்கப்படுவதை விட பின்நிலையில் மதிப்பு.

source: Fixes bug in :meth:`~qiskit.providers.aer.noise.NoiseModel.from_backend` and :meth:`~qiskit.providers.aer.QasmSimulator.from_backend` where :attr:`~qiskit.providers.aer.noise.NoiseModel.basis_gates` was set incorrectly for IBMQ devices with basis gate set ``['id', 'rz', 'sx', 'x', 'cx']``. Now the noise model will always have the same basis gates as the backend basis gates regardless of whether those instructions have errors in the noise model or not.
ta_in: பிழைகளை சரிசெய்கிறது: மெத்: `~ qiskit.providers.aer.noise.NoiseModel.from_backend` மற்றும்: meth:` ~ qiskit.providers.aer.QasmSimulator.from_backend` where: attr: `~ qiskit.providers.aer. அடிப்படை வாயில் தொகுப்பு `` ['ஐடி', 'ஆர்.எஸ்', 'எஸ்.எக்ஸ்', 'எக்ஸ்', 'சிஎக்ஸ்'] `` ஐபிஎம்யூ சாதனங்களுக்கு NoiseModel.basis_gates` தவறாக அமைக்கப்பட்டது. இப்போது சத்தம் மாதிரியில் எப்போதும் பின்தளத்தில் அடிப்படை வாயில்கள் போன்ற அடிப்படை வாயில்கள் இருக்கும், அந்த அறிவுறுத்தல்கள் சத்தம் மாதிரியில் பிழைகள் உள்ளதா இல்லையா என்பதைப் பொருட்படுத்தாமல்.

source: Fixes an issue where the Extended `"extended_stabilizer"` simulation method would give incorrect results on quantum circuits with sparse output distributions. Refer to `#306 <https://github.com/Qiskit/qiskit-aer/issues/306>`__ for more information and examples.
ta_in: விரிவாக்கப்பட்ட `"extended_stabilizer"` உருவகப்படுத்துதல் முறை, குவாண்டம் சுற்றுகளில் சிதறல் வெளியீட்டு விநியோகங்களுடன் தவறான முடிவுகளைத் தரும் சிக்கலை சரிசெய்கிறது. மேலும் தகவல்களுக்கும் எடுத்துக்காட்டுகளுக்கும் `# 306 <https://github.com/Qiskit/qiskit-aer/issues/306>` __ ஐப் பார்க்கவும்.

source: The :func:`qiskit.ignis.mitigation.expval_meas_mitigator_circuits` function has been improved so that the number of circuits generated by the function used for calibration by the CTMP method are reduced from :math:`O(n)` to :math:`O(\log{n})` (where :math:`n` is the number of qubits).
ta_in: :func:`qiskit.ignis.mitigation.expval_meas_mitigator_circuits` செயல்பாடு மேம்படுத்தப்பட்டுள்ளது, இதனால் CTMP முறையால் அளவுத்திருத்தத்திற்கு பயன்படுத்தப்படும் செயல்பாட்டின் மூலம் உருவாக்கப்படும் சுற்றுகளின் எண்ணிக்கை :math:`O(n)` இலிருந்து :math:`O(\log{n})` ஆக குறைக்கப்பட்டுள்ளது.(எங்கே :math: `n` என்பது குவிட்களின் எண்ணிக்கை).

source: The :func:`qiskit.ignis.verification.randomized_benchmarking_seq` function is now using the upgraded CNOTDihedral class, :class:`qiskit.ignis.verification.CNOTDihedral`, which enables performing CNOT-Dihedral Randomized Benchmarking on more than two qubits.
ta_in: :func:`qiskit.ignis.verification.randomized_benchmarking_seq` செயல்பாடு இப்போது மேம்படுத்தப்பட்ட CNOTDihedral வகுப்பைப் பயன்படுத்துகிறது ,:class:`qiskit.ignis.verification.CNOTDihedral`, இது இரண்டு க்யூபிட்டுகளுக்கு மேல் CNOT-Dihedral சீரற்ற இலக்குக் குறி செய்ய உதவுகிறது.

source: The python package ``retworkx`` is now a requirement for installing qiskit-ignis. It replaces the previous usage of ``networkx`` (which is no longer a requirement) to get better performance.
ta_in: பைதான் பேக்கேஜ் ``retworkx`` இப்போது Qiskit-இக்னிஸை நிறுவுவதற்கான தேவை. சிறந்த செயல்திறனைப் பெற இது முந்தைய ``networkx`` இன் பயன்பாட்டை மாற்றுகிறது (இது இனி தேவையில்லை).

source: The ``scikit-learn`` dependency is no longer required and is now an optional requirement. If you're using the IQ measurement discriminators (:class:`~qiskit.ignis.measurement.IQDiscriminationFitter`, :class:`~qiskit.ignis.measurement.LinearIQDiscriminationFitter`, :class:`~qiskit.ignis.measurement.QuadraticIQDiscriminationFitter`, or :class:`~qiskit.ignis.measurement.SklearnIQDiscriminator`) you will now need to manually install scikit-learn, either by running ``pip install scikit-learn`` or when you're also installing qiskit-ignis with ``pip install qiskit-ignis[iq]``.
ta_in: ``scikit-learn`` சார்பு இனி தேவையில்லை, இப்போது இது ஒரு விருப்பத் தேவையாகும். நீங்கள் IQ அளவீட்டு பாகுபாடுகளைப் பயன்படுத்துகிறீர்கள் என்றால் (:class:`~qiskit.ignis.measurement.IQDiscriminationFitter`, :class:`~qiskit.ignis.measurement.LinearIQDiscriminationFitter`, :class:`~qiskit.ignis.measurement.QuadraticIQDiscriminationFitter`, அல்லது :class:`~qiskit.ignis.measurement.SklearnIQDiscriminator`) ``pip install scikit-learn``` ஐ இயக்குவதன் மூலமாகவோ அல்லது Qiskit-இக்னிஸை ``pip install qiskit-ignis[iq]`` உடன் நிறுவுவதன் மூலமாகவோ நீங்கள் இப்போது ஸ்கிக்கிட்-கற்றலை கைமுறையாக நிறுவ வேண்டும்.

source: Fixed an issue in the expectation value method :meth:`~qiskit.ignis.mitigation.TensoredExpvalMeasMitigator.expectation_value`, for the error mitigation classes :class:`~qiskit.ignis.mitigation.TensoredExpvalMeasMitigator` and :class:`~qiskit.ignis.mitigation.CTMPExpvalMeasMitigator` if the ``qubits`` kwarg was not specified it would incorrectly use the total number of qubits of the mitigator, rather than the number of classical bits in the count dictionary leading to greatly reduced performance. Fixed `#561 <https://github.com/Qiskit/qiskit-ignis/issues/561>`__
ta_in: எதிர்பார்ப்பு மதிப்பு முறையில் ஒரு சிக்கல் சரி செய்யப்பட்டது:meth:`~qiskit.ignis.mitigation.TensoredExpvalMeasMitigator.expectation_value`, பிழை குறைப்பு வகுப்புகளுக்கு :class:`~qiskit.ignis.mitigation.TensoredExpvalMeasMitigator`மற்றும் :class:`~qiskit.ignis.mitigation.CTMPExpvalMeasMitigator`என்றால்``qubits``குவார்க் குறிப்பிடப்படவில்லை, இது எண்ணிக்கை அகராதியில் உள்ள கிளாசிக்கல் பிட்களின் எண்ணிக்கையை விட, தணிப்பாளரின் மொத்த குவிட்களின் எண்ணிக்கையை தவறாகப் பயன்படுத்தும். சரிசெய்யப்பட்டது`#561 <https://github.com/Qiskit/qiskit-ignis/issues/561>`__
