Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: The ``pass_manager`` kwarg for the :func:`qiskit.compiler.transpile` has been deprecated and will be removed in a future release. Moving forward the preferred way to transpile a circuit with a custom :class:`~qiskit.transpiler.PassManager` object is to use the :meth:`~qiskit.transpiler.PassManager.run` method of the ``PassManager`` object.
ta_in: 'pass_manager' kwarg ':func:'qiskit.compiler.transpile' நீக்கப்பட்டது மற்றும் ஒரு எதிர்கால வெளியீட்டில் நீக்கப்படும். ஒரு தனிப்பயன் :class:'~qiskit.transpiler.PassManager' ஒரு விருப்ப ஒரு சுற்று டிரான்ஸ்பைலர் செய்ய விருப்பமான வழி நகரும் ':meth:'~qiskit.transpiler.PassManager.run' முறை பயன்படுத்த வேண்டும் 'PassManager' பொருள்.

source: The :func:`qiskit.quantum_info.random_state` function has been deprecated and will be removed in a future release. Instead you should use the :func:`qiskit.quantum_info.random_statevector` function.
ta_in: ':func:'qiskit.quantum_info.radom_state' செயல்பாடு நீக்கப்பட்டது மற்றும் ஒரு எதிர்கால வெளியீட்டில் நீக்கப்படும். அதற்கு பதிலாக நீங்கள் :func:'qiskit.quantum_info.random_statevector' function ஐ பயன்படுத்த வேண்டும்.

source: The ``add``, ``subtract``, and ``multiply`` methods of the :class:`qiskit.quantum_info.Statevector` and :class:`qiskit.quantum_info.DensityMatrix` classes are deprecated and will be removed in a future release. Instead you shoulde use ``+``, ``-``, ``*`` binary operators instead.
ta_in: "கூட்டு", "கழித்தல்", மற்றும் "பெருக்கல்" முறைகள் :class:"qiskit.quantum_info. statevector' மற்றும் :class:'qiskit.quantum_info. DensityMatrix ' வகுப்புகள் deprecated மற்றும் ஒரு எதிர்கால வெளியீட்டில் நீக்கப்படும். அதற்கு பதிலாக நீங்கள் "+'', "-'', "*" பைனரி ஆப்பரேட்டர்களை பயன்படுத்த வேண்டும்.

source: Deprecates :meth:`qiskit.quantum_info.Statevector.to_counts`, :meth:`qiskit.quantum_info.DensityMatrix.to_counts`, and :func:`qiskit.quantum_info.counts.state_to_counts`. These functions are superseded by the class methods :meth:`qiskit.quantum_info.Statevector.probabilities_dict` and :meth:`qiskit.quantum_info.DensityMatrix.probabilities_dict`.
ta_in: நீக்குகிறது:meth: `qiskit.quantum_info.Statevector.to_counts` ,:meth:` qiskit.quantum_info.DensityMatrix.to_counts`, மற்றும்:func: `qiskit.quantum_info.counts.state_to_counts`. இந்த செயல்பாடுகளை வர்க்க முறைகள் மீறுகின்றன:meth: `qiskit.quantum_info.Statevector.probilities_dict` மற்றும்:meth:` qiskit.quantum_info.DensityMatrix.probilities_dict`.

source: :py:class:`~qiskit.pulse.pulse_lib.SamplePulse` and :py:class:`~qiskit.pulse.pulse_lib.ParametricPulse` s (e.g. ``Gaussian``) now subclass from :py:class:`~qiskit.pulse.pulse_lib.Pulse` and have been moved to the :mod:`qiskit.pulse.pulse_lib`. The previous path via ``pulse.commands`` is deprecated and will be removed in a future release.
ta_in: : py:class: `~ qiskit.pulse.pulse_lib.SamplePulse` மற்றும்: py: class:` ~ qiskit.pulse.pulse_lib.ParametricPulse’s (எ.கா. `` Gaussian``) இப்போது துணைப்பிரிவு: py: class: `~ qiskit.pulse.pulse_lib.Pulse` மற்றும் அவை:mod: `qiskit.pulse.pulse_lib` க்கு நகர்த்தப்பட்டுள்ளன. `` pulse.commands`` வழியாக முந்தைய பாதை நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும்.

source: ``DelayInstruction`` has been deprecated and replaced by :py:class:`~qiskit.pulse.instruction.Delay`. This new instruction has been taken over the previous ``Command`` ``Delay``. The migration pattern is::
ta_in: ``DelayInstruction`` நீக்கப்பட்டு, அதற்கு பதிலாக: py: class: `~ qiskit.pulse.instruction.Delay`. இந்த புதிய அறிவுறுத்தல் முந்தைய `` Command`` `` Delay`` மீது எடுக்கப்பட்டுள்ளது. இடம்பெயர்வு முறை ::

source: Until the deprecation period is over, the previous ``Delay`` syntax of calling a command on a channel will also be supported::
ta_in: நீக்குதல் காலம் முடியும் வரை, ஒரு சேனலில் ஒரு கட்டளையை அழைப்பதற்கான முந்தைய `` Delay`` தொடரியல் ஆதரிக்கப்படும்::

source: The new ``Delay`` instruction does not support a ``command`` attribute.
ta_in: புதிய `` Delay`` அறிவுறுத்தல் `` command`` பண்புக்கூறுக்கு ஆதரவளிக்காது.

source: ``FrameChange`` and ``FrameChangeInstruction`` have been deprecated and replaced by :py:class:`~qiskit.pulse.instructions.ShiftPhase`. The changes are::
ta_in: ``FrameChange`` மற்றும் `` FrameChangeInstruction`` ஆகியவை நீக்கப்பட்டன, அதற்கு பதிலாக: பை:class: `~ qiskit.pulse.instructions.ShiftPhase`. மாற்றங்கள் ::

source: Until the deprecation period is over, the previous FrameChange syntax of calling a command on a channel will be supported::
ta_in: நீக்குதல் காலம் முடியும் வரை, ஒரு சேனலில் ஒரு கட்டளையை அழைக்கும் முந்தைய பிரேம் சேஞ்ச் தொடரியல் ஆதரிக்கப்படும்::

source: The ``call`` method of :py:class:`~qiskit.pulse.pulse_lib.SamplePulse` and :py:class:`~qiskit.pulse.pulse_lib.ParametricPulse` s have been deprecated. The migration is as follows::
ta_in: Py:class: `~ qiskit.pulse.pulse_lib.SamplePulse` மற்றும்: py: class:` ~ qiskit.pulse.pulse_lib.ParametricPulse` இன் ``call`` முறை நீக்கப்பட்டது. இடம்பெயர்வு பின்வருமாறு ::

source: ``AcquireInstruction`` has been deprecated and replaced by :py:class:`~qiskit.pulse.instructions.Acquire`. The changes are::
ta_in: `` AcquireInstruction`` நீக்கப்பட்டு, அதற்கு பதிலாக: py: class: `~ qiskit.pulse.instructions.Acquire`. மாற்றங்கள் ::

source: Until the deprecation period is over, the previous Acquire syntax of calling the command on a channel will be supported::
ta_in: நீக்குதல் காலம் முடியும் வரை, ஒரு சேனலில் கட்டளையை அழைப்பதற்கான முந்தைய கையகப்படுத்தல் தொடரியல் ஆதரிக்கப்படும்::

source: The :class:`~qiskit.transpiler.passes.BarrierBeforeFinalMeasurements` transpiler pass, included in the preset transpiler levels when targeting a physical device, previously inserted a barrier across only measured qubits. In some cases, this allowed the transpiler to insert a swap after a measure operation, rendering the circuit invalid for current devices. The pass has been updated so that the inserted barrier will span all qubits on the device. Fixes `#3937 <https://github.com/Qiskit/qiskit-terra/issues/3937>`_
ta_in: :class: `~ qiskit.transpiler.passes.BarrierBeforeFinalMeasurements` டிரான்ஸ்பைலர் பாஸ், ஒரு இயற்பியல் சாதனத்தை குறிவைக்கும் போது முன்னமைக்கப்பட்ட டிரான்ஸ்பைலர் மட்டங்களில் சேர்க்கப்பட்டுள்ளது, முன்பு அளவிடப்பட்ட குவிட்களில் மட்டும் ஒரு தடையை செருகியது. சில சந்தர்ப்பங்களில், இது ஒரு அளவீட்டு செயல்பாட்டிற்குப் பிறகு ஒரு இடமாற்றத்தை செருகுவதற்கு டிரான்ஸ்பைலரை அனுமதித்தது, தற்போதைய சாதனங்களுக்கு சுற்று செல்லாது. பாஸ் புதுப்பிக்கப்பட்டது, இதனால் செருகப்பட்ட தடை சாதனத்தில் உள்ள அனைத்து வினைகளையும் பரப்புகிறது. திருத்தங்கள் `# 3937 <https://github.com/Qiskit/qiskit-terra/issues/3937>` _

source: When extending a :class:`~qiskit.circuit.QuantumCircuit` instance (extendee) with another circuit (extension), the circuit is taken via reference. If a circuit is extended with itself that leads to an infinite loop as extendee and extension are the same. This bug has been resolved by copying the extension if it is the same object as the extendee. Fixes `#3811 <https://github.com/Qiskit/qiskit-terra/issues/3811>`_
ta_in: ஒரு: வகுப்பை நீட்டிக்கும்போது:class: `~ qiskit.circuit.QuantumCircuit` நிகழ்வு (நீட்டிப்பு) மற்றொரு சுற்று (நீட்டிப்பு) உடன், சுற்று குறிப்பு வழியாக எடுக்கப்படுகிறது. ஒரு சுற்று தன்னுடன் நீட்டிக்கப்பட்டால், அது நீட்டிப்பு மற்றும் நீட்டிப்பு ஒரே மாதிரியாக இருப்பதால் எல்லையற்ற வளையத்திற்கு வழிவகுக்கிறது. நீட்டிப்பு நீட்டிக்கப்பட்ட அதே பொருளாக இருந்தால் நீட்டிப்பை நகலெடுப்பதன் மூலம் இந்த பிழை தீர்க்கப்பட்டது. திருத்தங்கள் `# 3811 <https://github.com/Qiskit/qiskit-terra/issues/3811>` _

source: Fixes a case in :meth:`qiskit.result.Result.get_counts`, where the results for an expirement could not be referenced if the experiment was initialized as a Schedule without a name. Fixes `#2753 <https://github.com/Qiskit/qiskit-terra/issues/2753>`_
ta_in: ஒரு வழக்கை இதில் சரிசெய்கிறது:meth: `qiskit.result.Result.get_counts`, அங்கு ஒரு பெயர் இல்லாமல் ஒரு அட்டவணையாக சோதனை தொடங்கப்பட்டால் காலாவதியாகும் முடிவுகளைக் குறிப்பிட முடியாது. திருத்தங்கள் `# 2753 <https://github.com/Qiskit/qiskit-terra/issues/2753>` _

source: Previously, replacing :class:`~qiskit.circuit.Parameter` objects in a circuit with new Parameter objects prior to decomposing a circuit would result in the substituted values not correctly being substituted into the decomposed gates. This has been resolved such that binding and decomposition may occur in any order.
ta_in: முன்னதாக, மாற்றுவது:class: `~ qiskit.circuit.Parameter` பொருள்கள் ஒரு சுற்றுவட்டத்தை சிதைப்பதற்கு முன் புதிய அளவுரு பொருள்களைக் கொண்ட ஒரு சுற்றுவட்டத்தில் உள்ள பொருள்கள், சிதைந்த வாயில்களில் மாற்றாக மதிப்புகள் சரியாக மாற்றப்படாமல் போகும். பிணைப்பு மற்றும் சிதைவு எந்த வரிசையிலும் ஏற்படக்கூடிய வகையில் இது தீர்க்கப்பட்டுள்ளது.

source: The matplotlib output backend for the :func:`qiskit.visualization.circuit_drawer` function and :meth:`qiskit.circuit.QuantumCircuit.draw` method drawer has been fixed to render :class:`~qiskit.extensions.CU1Gate` gates correctly. Fixes `#3684 <https://github.com/Qiskit/qiskit-terra/issues/3684>`_
ta_in: :func: `qiskit.visualization.circuit_drawer` செயல்பாட்டிற்கான matplotlib வெளியீட்டு பின்தளத்தில் மற்றும்:meth:` qiskit.circuit.QuantumCircuit.draw` முறை அலமாரியை வழங்க சரி செய்யப்பட்டது:class: `~ qiskit.extensions.CU1Gate` வாயில்கள் . திருத்தங்கள் `# 3684 <https://github.com/Qiskit/qiskit-terra/issues/3684>` _

source: A bug in :meth:`qiskit.circuit.QuantumCircuit.from_qasm_str` and :meth:`qiskit.circuit.QuantumCircuit.from_qasm_file` when loading QASM with custom gates defined has been fixed. Now, loading this QASM::
ta_in: இதில் உள்ள பிழை:meth: `qiskit.circuit.QuantumCircuit.from_qasm_str` மற்றும்:meth:` qiskit.circuit.QuantumCircuit.from_qasm_file` வரையறுக்கப்பட்ட தனிப்பயன் வாயில்களுடன் QASM ஐ ஏற்றும்போது சரி செய்யப்பட்டது. இப்போது, ​​இந்த QASM ஐ ஏற்றுகிறது ::

source: is equivalent to the following circuit::
ta_in: பின்வரும் சுற்றுக்கு சமம்::

source: Fixes `#1566 <https://github.com/Qiskit/qiskit-terra/issues/1566>`_
ta_in: `# 1566 <https://github.com/Qiskit/qiskit-terra/issues/1566>` _ திருத்தங்கள்

source: Allow quantum circuit Instructions to have list parameter values. This is used in Aer for expectation value snapshot parameters for example ``params = [[1.0, 'I'], [1.0, 'X']]]`` for :math:`\langle I + X\rangle`.
ta_in: பட்டியல் அளவுரு மதிப்புகளைக் கொண்டிருக்க குவாண்டம் சுற்று வழிமுறைகளை அனுமதிக்கவும். எதிர்பார்ப்பு மதிப்பு ஸ்னாப்ஷாட் அளவுருக்களுக்கு இது ஏரில் பயன்படுத்தப்படுகிறது ``params = [[1.0, 'I'], [1.0, 'X']]] `` இதற்கு:math: `\langle I + X \rangle`.

source: Previously, for circuits containing composite gates (those created via :meth:`qiskit.circuit.QuantumCircuit.to_gate` or :meth:`qiskit.circuit.QuantumCircuit.to_instruction` or their corresponding converters), attempting to bind the circuit more than once would result in only the first bind value being applied to all circuits when transpiled. This has been resolved so that the values provided for subsequent binds are correctly respected.
ta_in: முன்னதாக, கலப்பு வாயில்களைக் கொண்ட சுற்றுகளுக்கு (:meth: `qiskit.circuit.QuantumCircuit.to_gate` அல்லது:meth:` qiskit.circuit.QuantumCircuit.to_instruction` அல்லது அவற்றுடன் தொடர்புடைய மாற்றிகள்), சுற்றுக்கு ஒன்றுக்கு மேற்பட்ட முறை பிணைக்க முயற்சிக்கும் மாற்றப்படும் போது அனைத்து சுற்றுகளுக்கும் முதல் பிணைப்பு மதிப்பு மட்டுமே பயன்படுத்தப்படும். இது தீர்க்கப்பட்டுள்ளது, இதனால் அடுத்தடுத்த பிணைப்புகளுக்கு வழங்கப்பட்ட மதிப்புகள் சரியாக மதிக்கப்படுகின்றன.

source: The qasm and pulse qobj classes:
ta_in: Qasm மற்றும் துடிப்பு qobj வகுப்புகள்:

source: from :mod:`qiskit.qobj` have all been reimplemented without using the marsmallow library. These new implementations are designed to be drop-in replacement (except for as noted in the upgrade release notes) but specifics inherited from marshmallow may not work. Please file issues for any incompatibilities found.
ta_in: இருந்து:mod: `qiskit.qobj` அனைத்தும் மார்ஸ்மெல்லோ நூலகத்தைப் பயன்படுத்தாமல் மறுசீரமைக்கப்பட்டுள்ளன. இந்த புதிய செயலாக்கங்கள் டிராப்-இன் மாற்றாக வடிவமைக்கப்பட்டுள்ளன (மேம்படுத்தல் வெளியீட்டுக் குறிப்புகளில் குறிப்பிடப்பட்டுள்ளதைத் தவிர) ஆனால் மார்ஷ்மெல்லோவிலிருந்து பெறப்பட்ட பிரத்தியேகங்கள் செயல்படாது. ஏதேனும் பொருந்தாத தன்மைகளுக்கு சிக்கல்களைத் தாக்கல் செய்க.

source: Added
ta_in: சேர்க்கப்பட்டது

source: Add support for terra diagonal gate
ta_in: டெர்ரா மூலைவிட்ட வாயிலுக்கு ஆதரவைச் சேர்க்கவும்

source: Add support for parameterized qobj
ta_in: அளவுருவாக்கப்பட்ட qobj க்கு ஆதரவைச் சேர்க்கவும்

source: Fixed
ta_in: சரி செய்யப்பட்டது

source: Added postfix for linux on Raspberry Pi
ta_in: ராஸ்பெர்ரி Pi இல் லினக்ஸிற்கான போஸ்ட்ஃபிக்ஸ் சேர்க்கப்பட்டது

source: Handle numpy array inputs from qobj
ta_in: Qobj இலிருந்து எண்ணற்ற வரிசை உள்ளீடுகளைக் கையாளவும்

source: API documentation
ta_in: API ஆவணங்கள்

source: CNOT-Dihedral randomized benchmarking
ta_in: CNOT-Dihedral சீரற்ற தரப்படுத்தல்

source: Accreditation module for output accrediation of noisy devices
ta_in: சத்தமில்லாத சாதனங்களின் வெளியீட்டு அங்கீகாரத்திற்கான அங்கீகார தொகுதி

source: Pulse calibrations for single qubits
ta_in: ஒற்றை குவிட்டுகளுக்கான துடிப்பு அளவுத்திருத்தங்கள்

source: Pulse Discriminator
ta_in: துடிப்பு பாகுபாடு காண்பிப்பவர்

source: Entanglement verification circuits
ta_in: சிக்கலான சரிபார்ப்பு சுற்றுகள்

source: Gateset tomography for single-qubit gate sets
ta_in: ஒற்றை-குவிட் கேட் செட்களுக்கான கேட்செட் டோமோகிராபி

source: Adds randomized benchmarking utility functions ``calculate_1q_epg``, ``calculate_2q_epg`` functions to calculate 1 and 2-qubit error per gate from error per Clifford
ta_in: தற்போக்கான இலக்குக் குறி பயன்பாட்டு செயல்பாடுகளை சேர்க்கிறது "calculate_1q_epg", "calculate_2q_epg" செயல்பாடுகளை கிளிஃபோர்ட் ஒன்றுக்கு ஒரு பிழை யிலிருந்து ஒரு கேட் ஒன்றுக்கு 1 மற்றும் 2-qubit பிழை கணக்கிட

source: Adds randomized benchmarking utility functions ``calculate_1q_epc``, ``calculate_2q_epc`` for calculating 1 and 2-qubit error per Clifford from error per gate
ta_in: தற்போக்காக பெஞ்ச்மார்க்கிங் பயன்பாட்டு செயல்பாடுகளை சேர்க்கிறது "calculate_1q_epc", "calculate_2q_epc" ஒவ்வொரு கேட் ஒரு கிளிஃபோர்ட் பிழை யிலிருந்து 1 மற்றும் 2-qubit பிழை கணக்கிடுவதற்கு

source: Changed
ta_in: மாற்றப்பட்டது

source: Support integer labels for qubits in tomography
ta_in: வரைவி qubits க்கான முழு எண் லேபல்களை ஆதரிக்கவும்

source: Support integer labels for measurement error mitigation
ta_in: அளவீட்டு பிழை குறைப்பிக்கான முழு எண் லேபல்களை ஆதரிக்கவும்

source: Deprecated
ta_in: நீக்கப்படும்

source: Deprecates ``twoQ_clifford_error`` function. Use ``calculate_2q_epc`` instead.
ta_in: "twoQ_clifford_error" செயல்பாட்டை க்டுகிறது. அதற்கு பதிலாக 'calculate_2q_epc' பயன்படுத்தவும்.

source: Python 3.5 support in qiskit-ignis is deprecated. Support will be removed on the upstream python community's end of life date for the version, which is 09/13/2020.
ta_in: பைத்தான் 3.5 qiskit-ignis இல் ஆதரவு நீக்கப்பட்டுள்ளது. பதிப்பு க்கான மேல்நீரோட்ட பைதான் சமூகத்தின் வாழ்க்கை தேதி, இது 09/13/2020 இல் ஆதரவு அகற்றப்படும்.

source: Aqua 0.6.5
ta_in: அக்வா 0.6.5

source: IBM Q Provider 0.6.0
ta_in: IBM Q வழங்குபவர் 0.6.0

source: Terra 0.12.0
ta_in: டெரா 0.12.0

source: Aer 0.4.1
ta_in: ஏர் 0.4.1

source: Ignis 0.2.0
ta_in: பற்றவைப்பு 0.2.0

source: There are three new exceptions: ``VisualizationError``, ``VisualizationValueError``, and ``VisualizationTypeError``. These are now used in the visualization modules when an exception is raised.
ta_in: மூன்று புதிய விதிவிலக்குகள் உள்ளன: "VisualizationError", "VisualizationValueError", மற்றும் "VisualizationTypeError". ஒரு விதிவிலக்கு எழுப்பப்படும் போது இவை இப்போது காட்சிப்படுத்தல் தொகுதிகளில் பயன்படுத்தப்படுகின்றன.

source: You can now set the logging level and specify a log file using the environment variables ``QSIKIT_IBMQ_PROVIDER_LOG_LEVEL`` and ``QISKIT_IBMQ_PROVIDER_LOG_FILE``, respectively. Note that the name of the logger is ``qiskit.providers.ibmq``.
ta_in: நீங்கள் இப்போது பதிவெடுத்தல் அளவை அமைத்து முறையே "QSIKIT_IBMQ_PROVIDER_LOG_LEVEL" மற்றும் "QISKIT_IBMQ_PROVIDER_LOG_FILE" சூழல் மாறிகளைப் பயன்படுத்தி ஒரு பதிவு கோப்பை குறிப்பிடலாம். குறிப்பின் பெயர் "qiskit.providers.ibmq" ஆகும்.

source: :class:`qiskit.providers.ibmq.job.IBMQJob` now has a new method :meth:`~qiskit.providers.ibmq.job.IBMQJob.scheduling_mode` that returns the scheduling mode the job is in.
ta_in: :class:'qiskit.providers.ibmq.job.IBMQJob' இப்போது ஒரு புதிய முறையை க்கொண்டிருக்கிறது :meth:'~qiskit.providers.ibmq.job.IBMQJob.scheduling_mode' என்று ஒரு புதிய முறை உள்ளது, இது வேலை உள்ளது.

source: IQX-related tutorials that used to be in ``qiskit-iqx-tutorials`` are now in ``qiskit-ibmq-provider``.
ta_in: "qiskit-iqx-tutorials" இல் பயன்படுத்தப்படும் IQX தொடர்பான பயிற்சிகள் இப்போது "qiskit-ibmq-provider" இல் உள்ளன.

source: :meth:`qiskit.providers.ibmq.IBMQBackend.jobs` now accepts a new boolean parameter ``descending``, which can be used to indicate whether the jobs should be returned in descending or ascending order.
ta_in: :meth:'qiskit.providers.ibmq.IBMQBackend.jobs' இப்போது ஒரு புதிய பூலியன் அளவுரு "descending" ஏற்கிறது, இது இறங்கு அல்லது ஏறுவரிசையில் வேலைகள் திரும்ப வேண்டுமா என்பதைக் குறிக்க பயன்படுத்தப்படலாம்.

source: :class:`qiskit.providers.ibmq.managed.IBMQJobManager` now looks at the job limit and waits for old jobs to finish before submitting new ones if the limit has been reached.
ta_in: :class:'qiskit.providers.ibmq.managed.IBMQJobManager' இப்போது வேலை வரம்பை ப்பார்த்து, வரம்பு எட்டப்பட்டால் புதிய பணிகளை சமர்ப்பிக்கும் முன் பழைய வேலைகள் முடிவடையும் வரை காத்திருக்கிறது.

source: :meth:`qiskit.providers.ibmq.IBMQBackend.status` now raises a :class:`qiskit.providers.ibmq.IBMQBackendApiProtocolError` exception if there was an issue with validating the status.
ta_in: :meth:'qiskit.providers.ibmq.IBMQBackend.status' இப்போது ஒரு எழுப்புகிறது:class:'qiskit.providers.ibmq.IBMQBackendApiProtocolError' நிலையை செல்லுபடியாக்குவதில் சிக்கல் இருந்தால் விதிவிலக்கு.

source: Aer 0.4.0
ta_in: ஏர் 0.4.0

source: Aqua 0.6.4
ta_in: அக்வா 0.6.4

source: IBM Q Provider 0.5.0
ta_in: IBM Q வழங்குபவர் 0.5.0

source: Some of the visualization and Jupyter tools, including gate/error map and backend information, have been moved from ``qiskit-terra`` to ``qiskit-ibmq-provider``. They are now under the :mod:`qiskit.providers.ibmq.jupyter` and :mod:`qiskit.providers.ibmq.visualization`. In addition, you can now use ``%iqx_dashboard`` to get a dashboard that provides both job and backend information.
ta_in: சில காட்சிப்படுத்தல் மற்றும் ஜூபியர் கருவிகள், கேட் /பிழை வரைபடம் மற்றும் பின்நிலை தகவல் உட்பட, "qiskit-terra" இருந்து "qiskit-ibmq-provider" க்கு நகர்த்தப்பட்டுள்ளன. அவர்கள் இப்போது :mod:'qiskit.providers.ibmq.jupyter' மற்றும் ':mod:'qiskit.providers.ibmq.visualization' கீழ் உள்ளன. கூடுதலாக, பணி மற்றும் பின்நிலை தகவலை வழங்கும் டாஷ்போர்டை பெற நீங்கள் இப்போது '%iqx_dashboard' ஐ ப் பயன்படுத்தலாம்.

source: JSON schema validation is no longer run by default on Qobj objects passed to :meth:`qiskit.providers.ibmq.IBMQBackend.run`. This significantly speeds up the execution of the `run()` method. Qobj objects are still validated on the server side, and invalid Qobjs will continue to raise exceptions. To force local validation, set ``validate_qobj=True`` when you invoke ``run()``.
ta_in: JSON பண்புவிவரம் சரிபார்த்தல் இனி Qobj பொருள்களில் முன்னிருப்பாக இயங்காது :meth:'qiskit.providers.ibmq.IBMQBackend.run'. இது 'ரன்()' முறை யின் செயலாக்கத்தை கணிசமாக வேகப்படுத்துகிறது. Qobj பொருள்கள் சேவையகபக்கத்தில் இன்னும் செல்லுபடியாக்கப்படுகின்றன, மேலும் செல்லுபடியாகாத Qobjs தொடர்ந்து விதிவிலக்குகளை உயர்த்தும். அக சரிபார்த்தலை கட்டாயப்படுத்த, "validate_qobj=true" என்பதை நீங்கள் "run()" என்று அமைக்கும்போது அமைக்கவும்.

source: The 0.12.0 release includes several new features and bug fixes. The biggest change for this release is the addition of support for parametric pulses to OpenPulse. These are Pulse commands which take parameters rather than sample points to describe a pulse. 0.12.0 is also the first release to include support for Python 3.8. It also marks the beginning of the deprecation for Python 3.5 support, which will be removed when the upstream community stops supporting it.
ta_in: 0.12.0 வெளியீட்டில் பல புதிய அம்சங்கள் மற்றும் பிழைத்திருத்தங்கள் உள்ளன. இந்த வெளியீட்டின் மிகப்பெரிய மாற்றம் OpenPulse க்கு parametric பருப்புகளுக்கான ஆதரவு கூடுதலாக உள்ளது. இவை ஒரு நாடித்துடிப்பை விவரிக்க மாதிரி ப்புள்ளிகளை விட அளவுருக்களை எடுக்கும் பல்ஸ் கட்டளைகள் ஆகும். 0.12.0 என்பது பைத்தான் 3.8 க்கான ஆதரவை உள்ளடக்கிய முதல் வெளியீடு ஆகும். இது பைத்தான் 3.5 ஆதரவு க்கான தேய்மானத்தின் தொடக்கத்தையும் குறிக்கிறது, இது மேல்நீரோட்ட சமூகம் அதை ஆதரிப்பதை நிறுத்தும்போது அகற்றப்படும்.

source: The pass :class:`qiskit.transpiler.passes.CSPLayout` was extended with two new parameters: ``call_limit`` and ``time_limit``. These options allow limiting how long the pass will run. The option ``call_limit`` limits the number of times that the recursive function in the backtracking solver may be called. Similarly, ``time_limit`` limits how long (in seconds) the solver will be allowed to run. The defaults are ``1000`` calls and ``10`` seconds respectively.
ta_in: ":class:"qiskit.transpiler.passes.CSPLayout" என்ற இரண்டு புதிய அளவுருக்கள் கொண்ட "call_limit" மற்றும் "time_limit" என்ற இரண்டு புதிய அளவுருக்கள் நீட்டிக்கப்பட்டுள்ளது. இந்த விருப்பங்கள் பாஸ் எவ்வளவு நேரம் இயங்கும் என்பதை வரம்பிட அனுமதிக்கின்றன. "call_limit" என்ற விருப்பம், பின்தொடர்தல் தீர்வில் உள்ள திரும்பவரும் செயல்பாடு அழைக்கப்படவேண்டிய எண்ணிக்கையை வரையறுக்கிறது. இதேபோல், "time_limit" என்பது தீர்வி இயங்க எவ்வளவு காலம் (விநாடிகளில்) அனுமதிக்கப்படும் என்பதை வரையறுக்கிறது. முன்னிருப்புகள் முறையே "1000" அழைப்புகள் மற்றும் "10" விநாடிகள் ஆகும்.

source: :class:`qiskit.pulse.Acquire` can now be applied to a single qubit. This makes pulse programming more consistent and easier to reason about, as now all operations apply to a single channel. For example::
ta_in: :class:'qiskit.pulse.Acqual' இப்போது ஒரே qubit க்கு பயன்படுத்தலாம். இது பல்ஸ் நிரலாக்கத்தை இன்னும் நிலையானதாகவும், பகுத்தறிவதற்கு எளிதாகவும் செய்கிறது, இப்போது அனைத்து செயல்பாடுகளும் ஒற்றை சேனலுக்கு பொருந்தும். உதாரணமாக::

source: A new method :meth:`qiskit.transpiler.CouplingMap.draw` was added to :class:`qiskit.transpiler.CouplingMap` to generate a graphviz image from the coupling map graph. For example:
ta_in: ஒரு புதிய முறை ":meth:'qiskit.transpiler.CouplingMap.draw' சேர்க்கப்பட்டுள்ளது :class:'qiskit.transpiler.CouplingMap' coupling map graph. உதாரணமாக:

source: Parametric pulses have been added to OpenPulse. These are pulse commands which are parameterized and understood by the backend. Arbitrary pulse shapes are still supported by the SamplePulse Command. The new supported pulse classes are:
ta_in: திறந்தவெளிக்கு பாரமெட்ரிக் பருப்பு கள் சேர்க்கப்பட்டுள்ளன. இவை, பின்முனையால் அளபுருக்கள் மற்றும் புரிந்து கொள்ளக்கூடிய துடிப்பு கட்டளைகள் ஆகும். தன்னிச்சையான துடிப்பு வடிவங்கள் இன்னும் SamplePulse கட்டளை யால் ஆதரிக்கப்படுகின்றன. புதிய ஆதரவு துடிப்பு வகுப்புகள்:

source: They can be used like any other Pulse command. An example::
ta_in: வேறு எந்த பல்ஸ் கட்டளை யும் போலவே அவையும் பயன்படுத்தப்படலாம். ஒரு உதாரணம்::
