Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: The resulting schedule will be similar to a SamplePulse schedule built using :mod:`qiskit.pulse.pulse_lib`, however, waveform sampling will be performed by the backend. The method :meth:`qiskit.pulse.Schedule.draw` can still be used as usual. However, the command will be converted to a ``SamplePulse`` with the :meth:`qiskit.pulse.ParametricPulse.get_sample_pulse` method, so the pulse shown may not sample the continuous function the same way that the backend will.
ta_in: இதன் விளைவாக அட்டவணை :mod:'qiskit.pulse.pulse_lib'ஐ பயன்படுத்தி கட்டப்பட்ட SamplePulse அட்டவணையைப் போலவே இருக்கும், இருப்பினும், பின்முனையால் அலைவடிவம் மாதிரி செய்யப்படும். :meth:'qiskit.pulse.Schedule.draw' என்ற முறையை இன்றும் வழக்கம் போல் பயன்படுத்த முடியும். எனினும், கட்டளை ஒரு ":meth:'qiskit.pulse.ParametricPulse.get_sample_pulse" முறை ஒரு "மாதிரிதுடிப்பு" மாற்றப்படுகிறது, எனவே காட்டப்படும் துடிப்பு பின்இறுதியில் என்று அதே வழியில் தொடர்ச்சியான செயல்பாடு மாதிரி இல்லை.

source: This feature can be used to construct Pulse programs for any backend, but the pulses will be converted to ``SamplePulse`` objects if the backend does not support parametric pulses. Backends which support them will have the following new attribute::
ta_in: இந்த அம்சம் எந்த பின்புலத்திற்கும் பல்ஸ் நிரல்களை உருவாக்க பயன்படுத்தலாம், ஆனால் பின்முனை parametric pulses ஐ ஆதரிக்கவில்லை என்றால், பருப்பு வகைகள் "SamplePulse" பொருள்களாக மாற்றப்படும். அவற்றை ஆதரிக்கும் பின்முனைகள் பின்வரும் புதிய பண்புக்கூறை கொண்டிருக்கும்::

source: Note that the backend does not need to support all of the parametric pulses defined in Qiskit.
ta_in: பின்முனை, Qiskit வரையறுக்கப்பட்ட அனைத்து பாராமெட்ரிக் துடிப்புகளையும் ஆதரிக்க வேண்டிய அவசியமில்லை என்பதை நினைவில் கொள்ளவும்.

source: When the backend supports parametric pulses, and the Pulse schedule is built with them, the assembled Qobj is significantly smaller. The size of a PulseQobj built entirely with parametric pulses is dependent only on the number of instructions, whereas the size of a PulseQobj built otherwise will grow with the duration of the instructions (since every sample must be specified with a value).
ta_in: பின்பக்கம் அளவுருபல்ஸ்கள் ஆதரிக்கிறது, மற்றும் துடிப்பு அட்டவணை அவர்களுடன் கட்டப்பட்ட போது, கூடியிருந்த Qobj கணிசமாக சிறியது. அளவுரு பல்ஸ் மூலம் கட்டப்பட்ட ஒரு PulseQobj அளவு மட்டுமே அறிவுறுத்தல்கள் எண்ணிக்கை பொறுத்தது, அதேசமயம் இல்லையெனில் கட்டப்பட்ட ஒரு PulseQobj அளவு அறிவுறுத்தல்கள் கால (ஒவ்வொரு மாதிரி ஒரு மதிப்பு குறிப்பிடவேண்டும் என்பதால்) வளரும்.

source: Added utility functions, :func:`qiskit.scheduler.measure` and :func:`qiskit.scheduler.measure_all` to `qiskit.scheduler` module. These functions return a :class:`qiskit.pulse.Schedule` object which measures qubits using OpenPulse. For example::
ta_in: பயன்பாட்டு செயல்பாடுகளை ச்சேர்த்த, :func:'qiskit.scheduler.measure' மற்றும் ':func:'qiskit.scheduler.measure_all' 'qiskit.scheduler' module. இந்த செயல்பாடுகள் OpenPulse ஐ பயன்படுத்தி qubis அளக்கும் ஒரு :class:'qiskit.pulse.Schedule" object ஐ திருப்பும். உதாரணமாக::

source: Pulse :class:`qiskit.pulse.Schedule` objects now have better representations that for simple schedules should be valid Python expressions.
ta_in: பல்ஸ் :class:` qiskit.pulse.Schedule ` பொருள்கள் இப்போது எளிமையான செயல்திறன் முறையான பைத்தான் வெளிப்பாடுகள் இருக்க வேண்டும்.

source: The :class:`qiskit.circuit.QuantumCircuit` methods :meth:`qiskit.circuit.QuantumCircuit.measure_active`, :meth:`qiskit.circuit.QuantumCircuit.measure_all`, and :meth:`qiskit.circuit.QuantumCircuit.remove_final_measurements` now have an addition kwarg ``inplace``. When ``inplace`` is set to ``False`` the function will return a modified **copy** of the circuit. This is different from the default behavior which will modify the circuit object in-place and return nothing.
ta_in: The :class:'qiskit.circuit.QuantumCircuit' methods :meth:'qiskit.circuit.QuantumCircuit.measure_active', :meth:'qiskit.circuit.QuantumCircuit.measure_all', and :meth:'qiskit.circuit.QuantumCircuit.remove_final_measurements' now a addition kwarg 'inplace'. "inplace" "False" என அமைக்கப்படும்போது, செயல்கூறு சுற்றுமாற்றப்பட்ட **copy** ஐ திருப்பும். இது இயல்புநிலை நடத்தையில் இருந்து வேறுபட்டது, இது சர்க்யூட் ஆப்ஜக்டை உள்ள-இடத்தில் மாற்றி விட்டு எதையும் திருப்பி விடும்.

source: Several new constructor methods were added to the :class:`qiskit.transpiler.CouplingMap` class for building objects with basic qubit coupling graphs. The new constructor methods are:
ta_in: அடிப்படை க்யூப்ட் இணைப்பு வரைபடங்கள் கொண்ட பொருட்களை உருவாக்கபல புதிய கன்ஸ்ட்ரக்டர் முறைகள் :class:'qiskit.transpiler.CouplingMap' வகுப்பில் சேர்க்கப்பட்டன. புதிய கட்டமைப்பான் முறைகள்:

source: For example, to use the new constructors to get a coupling map of 5 qubits connected in a linear chain you can now run:
ta_in: எடுத்துக்காட்டாக, ஒரு நேரியல் சங்கிலியில் இணைக்கப்பட்ட 5 குவிட்டுகளின் இணைப்பு வரைபடத்தைப் பெற புதிய கட்டமைப்பாளர்களைப் பயன்படுத்த நீங்கள் இப்போது இயக்கலாம்:

source: Introduced a new pass :class:`qiskit.transpiler.passes.CrosstalkAdaptiveSchedule`. This pass aims to reduce the impact of crosstalk noise on a program. It uses crosstalk characterization data from the backend to schedule gates. When a pair of gates has high crosstalk, they get serialized using a barrier. Naive serialization is harmful because it incurs decoherence errors. Hence, this pass uses a SMT optimization approach to compute a schedule which minimizes the impact of crosstalk as well as decoherence errors.
ta_in: புதிய பாஸை அறிமுகப்படுத்தியது:class: `qiskit.transpiler.passes.CrosstalkAdaptiveSchedule`. இந்த பாஸ் ஒரு நிரலில் க்ரோஸ்டாக் சத்தத்தின் தாக்கத்தை குறைப்பதை நோக்கமாகக் கொண்டுள்ளது. இது கேட்களை திட்டமிட பின்தளத்தில் இருந்து க்ரோஸ்டாக் குணாதிசய தரவைப் பயன்படுத்துகிறது. ஒரு ஜோடி வாயில்கள் அதிக க்ரோஸ்டாக்கைக் கொண்டிருக்கும்போது, ​​அவை ஒரு தடையைப் பயன்படுத்தி தொடர்கின்றன. அப்பாவியாக வரிசைப்படுத்துதல் தீங்கு விளைவிக்கும், ஏனெனில் இது டிகோஹரன்ஸ் பிழைகள் ஏற்படுகிறது. எனவே, இந்த பாஸ் ஒரு அட்டவணையை கணக்கிட ஒரு SMT தேர்வுமுறை அணுகுமுறையைப் பயன்படுத்துகிறது, இது க்ரோஸ்டாக்கின் தாக்கத்தையும் டிகோஹரன்ஸ் பிழைகளையும் குறைக்கிறது.

source: The pass takes as input a circuit which is already transpiled onto the backend i.e., the circuit is expressed in terms of physical qubits and swap gates have been inserted and decomposed into CNOTs if required. Using this circuit and crosstalk characterization data, a `Z3 optimization <https://github.com/Z3Prover/z3>`_ is used to construct a new scheduled circuit as output.
ta_in: பாஸ் உள்ளீடாக எடுத்துக்கொள்கிறது, இது ஏற்கனவே பின்தளத்தில் அனுப்பப்பட்டுள்ளது, அதாவது, சுற்று ப physical தீக வினாடிகளின் அடிப்படையில் வெளிப்படுத்தப்படுகிறது மற்றும் தேவைப்பட்டால் இடமாற்று வாயில்கள் செருகப்பட்டு சி.என்.ஓ.டி.களில் சிதைக்கப்படுகின்றன. இந்த சுற்று மற்றும் க்ரோஸ்டாக் பண்புக்கூறு தரவைப் பயன்படுத்தி, ஒரு புதிய திட்டமிடப்பட்ட சுற்று வெளியீட்டை வெளியிடுவதற்கு `Z3 தேர்வுமுறை <https://github.com/Z3Prover/z3>` _ பயன்படுத்தப்படுகிறது.

source: To use the pass on a circuit circ::
ta_in: ஒரு சுற்று வட்டத்தில் பாஸைப் பயன்படுத்த::

source: ``backend_prop`` is a :class:`qiskit.providers.models.BackendProperties` object for the target backend. ``crosstalk_prop`` is a dict which specifies conditional error rates. For two gates ``g1`` and ``g2``, ``crosstalk_prop[g1][g2]`` specifies the conditional error rate of ``g1`` when ``g1`` and ``g2`` are executed simultaneously. A method for generating ``crosstalk_prop`` will be added in a future release of qiskit-ignis. Until then you'll either have to already know the crosstalk properties of your device, or manually write your own device characterization experiments.
ta_in: `` backend_prop`` என்பது ஒரு:class: `qiskit.providers.models.BackendProperties` இலக்கு பின்தளத்தில் பொருள். `` crosstalk_prop`` என்பது நிபந்தனை பிழை விகிதங்களைக் குறிப்பிடும் ஒரு கட்டளை. `` G1`` மற்றும் `` g2`` ஆகிய இரண்டு வாயில்களுக்கு, `` crosstalk_prop [g1] [g2] `` `` g1`` மற்றும் `` g2`` போது `` g1`` இன் நிபந்தனை பிழை விகிதத்தைக் குறிப்பிடுகிறது ஒரே நேரத்தில் செயல்படுத்தப்படுகிறது. கிஸ்கிட்-இக்னிஸின் எதிர்கால வெளியீட்டில் `` crosstalk_prop`` ஐ உருவாக்குவதற்கான ஒரு முறை சேர்க்கப்படும். அதுவரை நீங்கள் ஏற்கனவே உங்கள் சாதனத்தின் க்ரோஸ்டாக் பண்புகளை அறிந்து கொள்ள வேண்டும், அல்லது உங்கள் சொந்த சாதன குணாதிசய சோதனைகளை கைமுறையாக எழுத வேண்டும்.பின்நிலை.

source: In the preset pass manager for optimization level 1, :func:`qiskit.transpiler.preset_passmanagers.level_1_pass_manager` if :class:`qiskit.transpiler.passes.TrivialLayout` layout pass is not a perfect match for a particular circuit, then :class:`qiskit.transpiler.passes.DenseLayout` layout pass is used instead.
ta_in: தேர்வுமுறை நிலை 1 க்கான முன்னமைக்கப்பட்ட பாஸ் மேலாளரில் ,:func: `qiskit.transpiler.preset_passmanagers.level_1_pass_manager` if :class:` qiskit.transpiler.passes.TrivialLayout` தளவமைப்பு பாஸ் ஒரு குறிப்பிட்ட சுற்றுக்கு சரியான பொருத்தம் அல்ல, பின்னர்:class: `qiskit.transpiler.passes.DenseLayout` தளவமைப்பு பாஸ் அதற்கு பதிலாக பயன்படுத்தப்படுகிறது.

source: Added a new abstract method :meth:`qiskit.quantum_info.Operator.dot` to the abstract ``BaseOperator`` class, so it is included for all implementations of that abstract class, including :class:`qiskit.quantum_info.Operator` and ``QuantumChannel`` (e.g., :class:`qiskit.quantum_info.Choi`) objects. This method returns the right operator multiplication ``a.dot(b)`` :math:`= a \cdot b`. This is equivalent to calling the operator :meth:`qiskit.quantum_info.Operator.compose` method with the kwarg ``front`` set to ``True``.
ta_in: ஒரு புதிய சுருக்க முறையைச் சேர்த்தது:meth: `qiskit.quantum_info.Operator.dot` என்பது சுருக்கமான``BaseOperator`` வகுப்பிற்கு, எனவே அந்த சுருக்க வகுப்பின் அனைத்து செயலாக்கங்களுக்கும் இது சேர்க்கப்பட்டுள்ளது, இதில்:class:` qiskit.quantum_info.Operator` மற்றும் `` QuantumChannel`` (எ.கா., :class: `qiskit.quantum_info.Choi`) பொருள்கள். இந்த முறை சரியான ஆபரேட்டர் பெருக்கத்தை `` a.dot (b) ``:math: `= a \ cdot b`. இது ஆபரேட்டரை அழைப்பதற்கு சமம்:meth: `qiskit.quantum_info.Operator.compose` முறை குவார்க்குடன்` `front``` `True`` என அமைக்கப்பட்டுள்ளது.

source: Added :func:`qiskit.quantum_info.average_gate_fidelity` and :func:`qiskit.quantum_info.gate_error` functions to the :mod:`qiskit.quantum_info` module for working with :class:`qiskit.quantum_info.Operator` and ``QuantumChannel`` (e.g., :class:`qiskit.quantum_info.Choi`) objects.
ta_in: சேர்க்கப்பட்டது:func: `qiskit.quantum_info.average_gate_fidelity` மற்றும் :func:` qiskit.quantum_info.gate_error` உடன் செயல்படும்:mod: `qiskit.quantum_info` தொகுதி:class:` qiskit.quantum_info.Operator மற்றும் ``QuantumChannel`` (எ.கா ,:class: `qiskit.quantum_info.Choi`) பொருள்கள்.

source: Added the :func:`qiskit.quantum_info.partial_trace` function to the :mod:`qiskit.quantum_info` that works with :class:`qiskit.quantum_info.Statevector` and :class:`qiskit.quantum_info.DensityMatrix` quantum state classes. For example::
ta_in: :func:'qiskit.quantum_info.partial_trace' function ஐ :mod:'qiskit.quantum_info' உடன் சேர்க்கிறது :class:qiskit.quantum_info. statevector' மற்றும் :class:'qiskit.quantum_info.DensityMatrix ' குவாண்டம் நிலை வகுப்புகள். உதாரணமாக::

source: When :meth:`qiskit.circuit.QuantumCircuit.draw` or :func:`qiskit.visualization.circuit_drawer` is called with the ``with_layout`` kwarg set True (the default) the output visualization will now display the physical qubits as integers to clearly distinguish them from the virtual qubits.
ta_in: போது :meth:'quiskit.circuit.draw' or :func:'qiskit.visualization.circuit_drawer' is calling with the 'with_layout' kwarg set True (the default) the output visualization will display the physical qubits to blistinkto theviror qubits from the virtual qubits.

source: Added new state measure functions to the :mod:`qiskit.quantum_info` module: :func:`qiskit.quantum_info.entropy`, :func:`qiskit.quantum_info.mutual_information`, :func:`qiskit.quantum_info.concurrence`, and :func:`qiskit.quantum_info.entanglement_of_formation`. These functions work with the :class:`qiskit.quantum_info.Statevector` and :class:`qiskit.quantum_info.DensityMatrix` classes.
ta_in: புதிய மாநில அளவீட்டு செயல்பாடுகளை:mod: `qiskit.quantum_info` தொகுதிக்குச் சேர்த்தது ::func:` qiskit.quantum_info.entropy` ,:func: `qiskit.quantum_info.mutual_information` ,:func:` qiskit.quantum_info.concurrence`, மற்றும்:func: `qiskit.quantum_info.entanglement_of_formation`. இந்த செயல்பாடுகள்:class: `qiskit.quantum_info.Statevector` மற்றும்:class:` qiskit.quantum_info.DensityMatrix` வகுப்புகளுடன் செயல்படுகின்றன.

source: The decomposition methods for single-qubit gates in :class:`qiskit.quantum_info.synthesis.one_qubit_decompose.OneQubitEulerDecomposer` have been expanded to now also include the ``'ZXZ'`` basis, characterized by three rotations about the Z,X,Z axis. This now means that a general 2x2 Operator can be decomposed into following bases: ``U3``, ``U1X``, ``ZYZ``, ``ZXZ``, ``XYX``, ``ZXZ``.
ta_in: ஒற்றை-குவிட் வாயில்களுக்கான சிதைவு முறைகள்:class: `qiskit.quantum_info.synthesis.one_qubit_decompose.OneQubitEulerDecomposer` இப்போது விரிவாக்கப்பட்டுள்ளது,` `ZZZ`` அடிப்படையையும் உள்ளடக்கியது, இது Z, X, இசட் அச்சு. இதன் பொருள் இப்போது ஒரு பொதுவான 2x2 ஆபரேட்டரை பின்வரும் தளங்களாக சிதைக்கலாம்: `` U3``, `` U1X``, `` ZYZ``, `` ZXZ``, `` XYX``, `` ZXZ``. .

source: Running functions that use :func:`qiskit.tools.parallel_map` (for example :func:`qiskit.execute.execute`, :func:`qiskit.compiler.transpile`, and :meth:`qiskit.transpiler.PassManager.run`) may not work when called from a script running outside of a ``if __name__ == '__main__':`` block when using Python 3.8 on MacOS. Other environments are unaffected by this issue. This is due to changes in how parallel processes are launched by Python 3.8 on MacOS. If ``RuntimeError`` or ``AttributeError`` are raised by scripts that are directly calling ``parallel_map()`` or when calling a function that uses it internally with Python 3.8 on MacOS embedding the script calls inside ``if __name__ == '__main__':`` should workaround the issue. For example::
ta_in: :func:'qiskit.tools.parallel_map' (உதாரணமாக :func:'qiskit.execute.execute', :func:'qiskit.compiler.transpile', and :meth:'qiskit.transpiler.PassManager.run') பயன்படுத்தும் செயல்பாடுகள் "if __name__ == '__main__':" block ஐ MaCOS இல் Python 3.8 ஐ ப்பயன்படுத்தும் போது இயங்குதல். மற்ற சூழல்கள் இந்த பிரச்சினையால் பாதிக்கப்படவில்லை. இது MacOS இல் Python 3.8 ஆல் இணை செயல்முறைகள் எவ்வாறு அறிமுகப்படுத்தப்படுகின்றன என்பது பற்றிய மாற்றங்களால் ஏற்படுகிறது. "RuntimeError" அல்லது "AttributeError" நேரடியாக "parallel_map()" என்று அழைக்கும் ஸ்கிரிப்ட்களால் எழுப்பப்பட்டால் அல்லது MacOS இல் Python 3.8 உடன் உள்முகமாக பயன்படுத்தும் ஒரு செயல்பாட்டை அழைக்கும் போது "if __name__ == '__main__':" இந்த சிக்கலை ச்சரிசெய்ய வேண்டும். உதாரணமாக::

source: if errors are encountered with Python 3.8 on MacOS.
ta_in: macOS இல் பைதான் 3.8 உடன் பிழைகள் ஏற்பட்டால்.

source: The value of the ``rep_time`` parameter for Pulse backend's configuration object is now in units of seconds, not microseconds. The first time a ``PulseBackendConfiguration`` object is initialized it will raise a single warning to the user to indicate this.
ta_in: பல்ஸ் பின்தளத்தில் உள்ளமைவு பொருளின் `` rep_time`` அளவுருவின் மதிப்பு இப்போது மைக்ரோ விநாடிகளில் அல்ல, வினாடிகளின் அலகுகளில் உள்ளது. முதல் முறையாக `` PulseBackendConfiguration`` பொருள் துவக்கப்பட்டால், இதைக் குறிக்க பயனருக்கு ஒரு எச்சரிக்கையை எழுப்புகிறது.

source: The ``rep_time`` argument for :func:`qiskit.compiler.assemble` now takes in a value in units of seconds, not microseconds. This was done to make the units with everything else in pulse. If you were passing in a value for ``rep_time`` ensure that you update the value to account for this change.
ta_in: இதற்கான `` rep_time`` வாதம்:func: `qiskit.compiler.assemble` இப்போது மைக்ரோ விநாடிகள் அல்ல, வினாடிகளின் அலகுகளில் ஒரு மதிப்பைப் பெறுகிறது. எல்லாவற்றையும் துடிப்பில் உள்ள அலகுகளை உருவாக்க இது செய்யப்பட்டது. `` Rep_time`` க்கான மதிப்பை நீங்கள் கடந்து வந்தால், இந்த மாற்றத்திற்கான கணக்கை மதிப்பைப் புதுப்பிப்பதை உறுதிசெய்க.

source: The value of the ``base_gate`` property of :class:`qiskit.circuit.ControlledGate` objects has been changed from the class of the base gate to an instance of the class of the base gate.
ta_in: `` base_gate`` சொத்தின் மதிப்பு:class: `qiskit.circuit.ControlledGate` பொருள்கள் அடிப்படை வாயிலின் வகுப்பிலிருந்து அடிப்படை வாயிலின் வர்க்கத்தின் ஒரு நிகழ்வாக மாற்றப்பட்டுள்ளன.

source: The ``base_gate_name`` property of :class:`qiskit.circuit.ControlledGate` has been removed; you can get the name of the base gate by accessing ``base_gate.name`` on the object. For example::
ta_in: `` base_gate_name`` இன் சொத்து:class: `qiskit.circuit.ControlledGate` அகற்றப்பட்டது; பொருளின் மீது `` base_gate.name`` ஐ அணுகுவதன் மூலம் நீங்கள் அடிப்படை வாயிலின் பெயரைப் பெறலாம். உதாரணத்திற்கு::

source: Changed :class:`qiskit.quantum_info.Operator` magic methods so that ``__mul__`` (which gets executed by python's multiplication operation, if the left hand side of the operation has it defined) implements right matrix multiplication (i.e. :meth:`qiskit.quantum_info.Operator.dot`), and ``__rmul__`` (which gets executed by python's multiplication operation from the right hand side of the operation if the left does not have ``__mul__`` defined) implements scalar multiplication (i.e. :meth:`qiskit.quantum_info.Operator.multiply`). Previously both methods implemented scalar multiplciation.
ta_in: மாற்றப்பட்டது:class: `qiskit.quantum_info.Operator` மந்திர முறைகள், இதனால்` `__mul__`` (இது பைத்தானின் பெருக்கல் செயல்பாட்டால் செயல்படுத்தப்படுகிறது, செயல்பாட்டின் இடது புறம் வரையறுக்கப்பட்டிருந்தால்) வலது மேட்ரிக்ஸ் பெருக்கத்தை செயல்படுத்துகிறது (அதாவது:meth: `qiskit.quantum_info.Operator.dot`), மற்றும்` `__rmul__`` (இது இடதுபுறத்தில்` `__mul__`` வரையறுக்கப்படவில்லை எனில், செயல்பாட்டின் வலது புறத்திலிருந்து பைத்தானின் பெருக்கல் செயல்பாட்டின் மூலம் செயல்படுத்தப்படுகிறது) அளவிடல் பெருக்கத்தை செயல்படுத்துகிறது ( அதாவது:meth: `qiskit.quantum_info.Operator.multiply`). முன்னதாக இரண்டு முறைகளும் அளவிடுதல் பெருக்கத்தை செயல்படுத்தின.

source: The second argument of the :func:`qiskit.quantum_info.process_fidelity` function, ``target``, is now optional. If a target unitary is not specified, then process fidelity of the input channel with the identity operator will be returned.
ta_in: :func: `qiskit.quantum_info.process_fidelity` செயல்பாட்டின் இரண்டாவது வாதம்,` `இலக்கு``, இப்போது விருப்பமானது. இலக்கு ஒற்றுமை குறிப்பிடப்படவில்லை எனில், அடையாள ஆபரேட்டருடன் உள்ளீட்டு சேனலின் நம்பகத்தன்மை திரும்பப்பெறும்.

source: :func:`qiskit.compiler.assemble` will now respect the configured ``max_shots`` value for a backend. If a value for the ``shots`` kwarg is specified that exceed the max shots set in the backend configuration the function will now raise a ``QiskitError`` exception. Additionally, if no shots argument is provided the default value is either 1024 (the previous behavior) or ``max_shots`` from the backend, whichever is lower.
ta_in: :func: `qiskit.compiler.assemble` இப்போது ஒரு பின்தளத்தில் கட்டமைக்கப்பட்ட` `max_shots`` மதிப்பை மதிக்கும். பின்தளத்தில் உள்ளமைவில் அமைக்கப்பட்ட அதிகபட்ச காட்சிகளைத் தாண்டிய `` shots` குவார்க்கின் மதிப்பு குறிப்பிடப்பட்டால், செயல்பாடு இப்போது `` QiskitError`` விதிவிலக்கை உயர்த்தும். கூடுதலாக, ஷாட்ஸ் வாதம் எதுவும் வழங்கப்படாவிட்டால், இயல்புநிலை மதிப்பு 1024 (முந்தைய நடத்தை) அல்லது பின்தளத்தில் இருந்து `` max_shots``, எது குறைவாக இருந்தாலும்.

source: Methods for adding gates to a :class:`qiskit.circuit.QuantumCircuit` with abbreviated keyword arguments (e.g. ``ctl``, ``tgt``) have had their keyword arguments renamed to be more descriptive (e.g. ``control_qubit``, ``target_qubit``). The old names have been deprecated. A table including the old and new calling signatures for the ``QuantumCircuit`` methods is included below.
ta_in: ஒரு :class:'qiskit.circuit.QuantumCircuit' உடன் கூடிய முக்கிய பயனிலைகளுடன் (எ.கா. "ctl", "tgt") அவற்றின் திறவுச்சொல் பயனிலைகளை இன்னும் விளக்கமாக மாற்றுகிறது (எ.கா. "control_qubit", "target_qubit"). பழைய பெயர்கள் நீக்கப்பட்டுள்ளன. 'QuantumCircuit' முறைகளுக்கான பழைய மற்றும் புதிய அழைப்புகையொப்பங்கள் அடங்கிய அட்டவணை கீழே சேர்க்கப்பட்டுள்ளது.

source: New signatures for ``QuantumCircuit`` gate methods
ta_in: ``QuantumCircuit`` கேட் முறைகளுக்கான புதிய கையொப்பங்கள்

source: Instruction Type
ta_in: குவாண்டம் சிர்குட்

source: Former Signature
ta_in: முன்னாள் கையொப்பம்

source: New Signature
ta_in: புதிய கையொப்பம்

source: Running :class:`qiskit.pulse.Acquire` on multiple qubits has been deprecated and will be removed in a future release. Additionally, the :class:`qiskit.pulse.AcquireInstruction` parameters ``mem_slots`` and ``reg_slots`` have been deprecated. Instead ``reg_slot`` and ``mem_slot`` should be used instead.
ta_in: இயங்கும்:class: பல குவிட்களில் `qiskit.pulse.Acquire` நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். கூடுதலாக,:class: `qiskit.pulse.AcquireInstruction` அளவுருக்கள்` `mem_slots`` மற்றும்` `reg_slots`` ஆகியவை நீக்கப்பட்டன. அதற்கு பதிலாக `` reg_slot`` மற்றும் `` mem_slot`` ஆகியவற்றைப் பயன்படுத்த வேண்டும்.

source: The attribute of the :class:`qiskit.providers.models.PulseDefaults` class ``circuit_instruction_map`` has been deprecated and will be removed in a future release. Instead you should use the new attribute ``instruction_schedule_map``. This was done to match the type of the value of the attribute, which is an ``InstructionScheduleMap``.
ta_in: :class:'qiskit.providers.models.PulseDefaults' class 'circuit_instruction_map' இன் பண்புக்கூறு நீக்கப்பட்டுள்ளது மற்றும் எதிர்கால வெளியீட்டில் நீக்கப்படும். அதற்கு பதிலாக நீங்கள் புதிய பண்பு "instruction_schedule_map" பயன்படுத்த வேண்டும். இது பண்புக்கூறின் மதிப்பின் வகையுடன் பொருந்துவதற்காக செய்யப்பட்டது, இது ஒரு "InstructionScheduleMap" ஆகும்.

source: The :class:`qiskit.pulse.PersistentValue` command is deprecated and will be removed in a future release. Similar functionality can be achieved with the :class:`qiskit.pulse.ConstantPulse` command (one of the new parametric pulses). Compare the following::
ta_in: :class: `qiskit.pulse.PersistentValue` கட்டளை நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். :class: `qiskit.pulse.ConstantPulse` கட்டளை (புதிய அளவுரு பருப்புகளில் ஒன்று) மூலம் இதேபோன்ற செயல்பாட்டை அடைய முடியும். பின்வருவனவற்றை ஒப்பிடுக ::

source: Python 3.5 support in qiskit-terra is deprecated. Support will be removed in the first release after the upstream Python community's end of life date for the version, which is 09/13/2020.
ta_in: Qiskit-டெர்ராவில் பைதான் 3.5 ஆதரவு நீக்கப்பட்டது. 09/13/2020 என்ற பதிப்பிற்கான அப்ஸ்ட்ரீம் பைதான் சமூகத்தின் வாழ்க்கை தேதி முடிவடைந்த பின்னர் முதல் வெளியீட்டில் ஆதரவு நீக்கப்படும்.

source: The ``require_cptp`` kwarg of the :func:`qiskit.quantum_info.process_fidelity` function has been deprecated and will be removed in a future release. It is superseded by two separate kwargs ``require_cp`` and ``require_tp``.
ta_in: :func: `qiskit.quantum_info.process_fidelity` செயல்பாட்டின்` `required_cptp`` kwarg நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். இது `` need_cp`` மற்றும் `` need_tp`` ஆகிய இரண்டு தனித்தனி குவார்க்குகளால் முறியடிக்கப்படுகிறது.

source: Setting the ``scale`` parameter for :meth:`qiskit.circuit.QuantumCircuit.draw` and :func:`qiskit.visualization.circuit_drawer` as the first positional argument is deprecated and will be removed in a future release. Instead you should use ``scale`` as keyword argument.
ta_in: இதற்கான `` scale`` அளவுருவை அமைத்தல்:meth: `qiskit.circuit.QuantumCircuit.draw` மற்றும்:func:` qiskit.visualization.circuit_drawer` முதல் நிலை வாதம் நீக்கப்பட்டு எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக நீங்கள் `` scale`` ஐ முக்கிய வாதமாகப் பயன்படுத்த வேண்டும்.
