Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: A new kwarg, ``user_cost_dict`` has been added to the constructor for the :class:`qiskit.transpiler.passes.TemplateOptimization` transpiler pass. This enables users to provide a custom cost dictionary for the gates to the underlying template matching algorithm. For example::
ta_in: ஒரு புதிய குவார்க், `` user_cost_dict`` :class:`qiskit.transpiler.passes.TemplateOptimization` டிரான்ஸ்பைலர் தேர்ச்சிக்கான கன்ஸ்ட்ரக்டருக்கு சேர்க்கப்பட்டுள்ளது. இது வார்ப்புரு பொருந்தக்கூடிய வழிமுறைக்கு கேட்களுக்கான தனிப்பயன் செலவு அகராதியை வழங்க பயனர்களுக்கு உதவுகிறது. உதாரணத்திற்கு::

source: An issue when passing the :class:`~qiskit.result.Counts` object returned by :meth:`~qiskit.result.Result.get_counts` to :func:`~qiskit.result.marginal_counts` would produce an improperly formatted :class:`~qiskit.result.Counts` object with certain inputs has been fixed. Fixes `#5424 <https://github.com/Qiskit/qiskit-terra/issues/5424>`__
ta_in: கடந்து செல்லும் போது ஒரு சிக்கல் :class:`~qiskit.result.Counts`பொருள் திரும்பியது :meth:`~qiskit.result.Result.get_counts`க்கு :func:`~qiskit.result.marginal_counts`முறையற்ற முறையில் வடிவமைக்கப்பட்டிருக்கும்:class:`~qiskit.result.Counts` சில உள்ளீடுகளைக் கொண்ட பொருள் சரி செய்யப்பட்டது. திருத்தங்கள் `#5424 <https://github.com/Qiskit/qiskit-terra/issues/5424>`__

source: Improved the allocation of helper qubits in :class:`~qiskit.circuit.library.PolynomialPauliRotations` and :class:`~qiskit.circuit.library.PiecewiseLinearPauliRotations` which makes the implementation of these circuit more efficient. Fixed `#5320 <https://github.com/Qiskit/qiskit-terra/issues/5320>`__ and `#5322 <https://github.com/Qiskit/qiskit-terra/issues/5322>`__
ta_in: உதவியாளரின் ஒதுக்கீட்டை மேம்படுத்தியது க்யூபிட்ஸ் இல்:class:`~qiskit.circuit.library.PolynomialPauliRotations` மற்றும்:class:`~qiskit.circuit.library.PiecewiseLinearPauliRotations` இது இந்த சுற்றுகளை செயல்படுத்துவதை மிகவும் திறமையாக்குகிறது.நிர்ணயித்தல் `#5320<https://github.com/Qiskit/qiskit-terra/issues/5320>`__மற்றும் #5322<https://github.com/Qiskit/qiskit-terra/issues/5322>`__

source: Fix the usage of the allocated helper qubits in the :class:`~qiskit.circuit.library.MCXGate` in the :class:`~qiskit.circuit.library.WeightedAdder` class. These were previously allocated but not used prior to this fix. Fixed `#5321 <https://github.com/Qiskit/qiskit-terra/issues/5321>`__
ta_in: :class:`~ Qiskit.circuit.library.MCXGate` இல் :class:`~ qiskit.circuit.library.WeightedAdder` வகுப்பில் ஒதுக்கப்பட்ட உதவி க்யூபிட்களின் பயன்பாட்டை சரிசெய்யவும். இவை முன்னர் ஒதுக்கப்பட்டன, ஆனால் இந்த பிழைத்திருத்தத்திற்கு முன்பு பயன்படுத்தப்படவில்லை. நிலையான`#5321 <https://github.com/Qiskit/qiskit-terra/issues/5321>`__

source: In a number of cases, the ``latex`` output method for the :func:`qiskit.visualization.circuit_drawer` function and the :meth:`~qiskit.circuit.QuantumCircuit.draw` method did not display the gate name correctly, and in other cases, did not include gate parameters where they should be. Now the gate names will be displayed the same way as they are displayed with the ``mpl`` output method, and parameters will display for all the gates that have them. In addition, some of the gates did not display in the correct form, and these have been fixed. Fixes `#5605 <https://github.com/Qiskit/qiskit-terra/issues/5605>`__, `#4938 <https://github.com/Qiskit/qiskit-terra/issues/4938>`__, and `#3765 <https://github.com/Qiskit/qiskit-terra/issues/3765>`__
ta_in: பல சந்தர்ப்பங்களில், தி``latex``வெளியீட்டு முறை :func:`qiskit.visualization.circuit_drawer`செயல்பாடு மற்றும் :meth:`~qiskit.circuit.QuantumCircuit.draw` முறை கேட் பெயரை சரியாகக் காட்டவில்லை, மற்ற சந்தர்ப்பங்களில், அவை இருக்க வேண்டிய கேட் அளவுருக்களை சேர்க்கவில்லை. இப்போது கேட் பெயர்கள் அவை காண்பிக்கப்படும் அதே வழியில் காட்டப்படும்``mpl`` வெளியீட்டு முறை, மற்றும் அளவுருக்கள் அவற்றைக் கொண்ட அனைத்து வாயில்களுக்கும் காண்பிக்கும். கூடுதலாக, சில வாயில்கள் சரியான வடிவத்தில் காட்டப்படவில்லை, மேலும் இவை சரி செய்யப்பட்டுள்ளன. திருத்தங்கள்`#5605 <https://github.com/Qiskit/qiskit-terra/issues/5605>`__, `#4938 <https://github.com/Qiskit/qiskit-terra/issues/4938>`__, and `#3765 <https://github.com/Qiskit/qiskit-terra/issues/3765>`__

source: Fixed an issue where, if the :meth:`qiskit.circuit.Instruction.to_instruction` method was used on a subcircuit which contained classical registers and that :class:`~qiskit.circuit.Instruction` object was then added to a :class:`~qiskit.circuit.QuantumCircuit` object, then the output from the :func:`qiskit.visualization.circuit_drawer` function and the :meth:`qiskit.circuit.QuantumCircuit.draw` method would in some instances display the subcircuit to the left of a measure when it should have been displayed to the right. Fixed `#5947 <https://github.com/Qiskit/qiskit-terra/issues/5947>`__
ta_in: ஒரு சிக்கல் சரி செய்யப்பட்டது :meth: `qiskit.circuit.Instruction.to_instruction` கிளாசிக்கல் பதிவேடுகளைக் கொண்ட ஒரு துணை வட்டத்தில் முறை பயன்படுத்தப்பட்டது:class: `~qiskit.circuit.Instruction` பொருள் பின்னர் சேர்க்கப்பட்டது:class: `~qiskit.circuit.QuantumCircuit` பொருள், பின்னர் வெளியீடு:func: `qiskit.visualization.circuit_drawer` செயல்பாடு மற்றும்:meth:`qiskit.circuit.QuantumCircuit.draw` முறை சில சந்தர்ப்பங்களில் துணை வட்டத்தை ஒரு அளவின் இடதுபுறத்தில் வலதுபுறத்தில் காண்பிக்க வேண்டும்.நிர்ணயித்தல் `#5947<https://github.com/Qiskit/qiskit-terra/issues/5947>`__

source: Fixed an issue with :class:`~qiskit.circuit.Delay` objects in a :class:`~qiskit.circuit.QuantumCircuit` where :func:`qiskit.compiler.transpile` would not be convert the units of the :class:`~qiskit.circuit.Delay` to the units of the :class:`~qiskit.providers.Backend`, if the ``backend`` kwarg is set on :func:`~qiskit.circuit.transpile`. This could result in the wrong behavior because of a unit mismatch, for example running::
ta_in: உடன் சிக்கல் சரி செய்யப்பட்டது :class:`~qiskit.circuit.Delay` ஒரு பொருள்கள்:class:`~qiskit.circuit.QuantumCircuit` எங்கே :func:`qiskit.compiler.transpile` இன் அலகுகளை மாற்ற முடியாது:class:`~qiskit.circuit.Delay`அலகுகளுக்கு:class:`~qiskit.providers.Backend`,என்றால்``backend``குவார்க் அமைக்கப்பட்டுள்ளது:func:`~qiskit.circuit.transpile`.அலகு பொருந்தாததால் இது தவறான நடத்தைக்கு வழிவகுக்கும், எடுத்துக்காட்டாக இயங்குகிறது ::

source: would previously have resulted in the backend delay for 100 timesteps (each of duration dt) rather than expected (100e-6 / dt) timesteps. This has been corrected so the :func:`qiskit.compiler.transpile` function properly converts the units.
ta_in: முன்னர் எதிர்பார்த்ததை விட (100e-6 / dt) நேர அட்டவணைகளுக்கு 100 நேர அட்டவணைகளுக்கு (ஒவ்வொரு கால அளவு dt) பின்நிலையில் தாமதத்தை ஏற்படுத்தியிருக்கும்.இது சரி செய்யப்பட்டது, எனவே :func:`qiskit.compiler.transpile` செயல்பாடு அலகுகளை சரியாக மாற்றுகிறது.

source: The snapshots of all the fake/mock backends in ``qiskit.test.mock`` have been updated to reflect recent device changes. This includes a change in the :attr:`~qiskit.providers.models.QasmBackendConfiguration.basis_gates` attribute for the :class:`~qiskit.providers.models.BackendConfiguration` to ``['cx', 'rz', 'sx', 'x', 'id']``, the addition of a ``readout_length`` property to the qubit properties in the :class:`~qiskit.providers.models.BackendProperties`, and updating the :class:`~qiskit.providers.models.PulseDefaults` so that all the mock backends support parametric pulse based :class:`~qiskit.pulse.InstructionScheduleMap` instances.
ta_in: `Qiskit.test.mock`` இல் உள்ள அனைத்து போலி / போலி பின்தளத்தில் உள்ள ஸ்னாப்ஷாட்கள் சமீபத்திய சாதன மாற்றங்களை பிரதிபலிக்கும் வகையில் புதுப்பிக்கப்பட்டுள்ளன. இதில்:attr: `~ qiskit.providers.models.QasmBackendConfiguration.basis_gates` பண்புக்கூறு:class:` ~ qiskit.providers.models.BackendConfiguration` to `` ['cx', 'rz', ' sx ',' x ',' id '] ``, :class: `~ qiskit.providers.models.BackendProperties` இல் உள்ள குவிட் பண்புகளில் ``readout_length`` சொத்தைச் சேர்த்தல், மற்றும்:class: `~ qiskit.providers.models.PulseDefaults` இதனால் அனைத்து போலி பின்தளங்களும் அளவுரு துடிப்பு அடிப்படையிலானவை:class:` ~ qiskit.pulse.InstructionScheduleMap` நிகழ்வுகள்.

source: The 0.8 release includes several new features and bug fixes. The highlights for this release are: the introduction of a unified :class:`~qiskit.providers.aer.AerSimulator` backend for running circuit simulations using any of the supported simulation methods; a simulator instruction library (:mod:`qiskit.providers.aer.library`) which includes custom instructions for saving various kinds of simulator data; MPI support for running large simulations on a distributed computing environment.
ta_in: 0.8 வெளியீட்டில் பல புதிய அம்சங்கள் மற்றும் பிழை திருத்தங்கள் உள்ளன. இந்த வெளியீட்டிற்கான சிறப்பம்சங்கள்: ஒரு ஒருங்கிணைந்த அறிமுகம்:class: `~ qiskit.providers.aer.AerSimulator` ஆதரிக்கப்படும் எந்த உருவகப்படுத்துதல் முறைகளையும் பயன்படுத்தி சுற்று உருவகப்படுத்துதல்களை இயக்குவதற்கான பின்தளத்தில்; ஒரு சிமுலேட்டர் அறிவுறுத்தல் நூலகம் (:mod: `qiskit.providers.aer.library`) இதில் பல்வேறு வகையான சிமுலேட்டர் தரவைச் சேமிப்பதற்கான தனிப்பயன் வழிமுறைகள் உள்ளன; விநியோகிக்கப்பட்ட கணினி சூழலில் பெரிய உருவகப்படுத்துதல்களை இயக்குவதற்கான MPI ஆதரவு.

source: Python 3.9 support has been added in this release. You can now run Qiskit Aer using Python 3.9 without building from source.
ta_in: இந்த வெளியீட்டில் பைதான் 3.9 ஆதரவு சேர்க்கப்பட்டுள்ளது. நீங்கள் தற்பொழுது Qiskit Aer மூலத்திலிருந்து கட்டமைக்காமல் பைதான் 3.9 பயன்படுத்தி இயக்கலாம்.

source: Add the CMake flag ``DISABLE_CONAN`` (default=``OFF``)s. When installing from source, setting this to ``ON`` allows bypassing the Conan package manager to find libraries that are already installed on your system. This is also available as an environment variable ``DISABLE_CONAN``, which takes precedence over the CMake flag. This is not the official procedure to build AER. Thus, the user is responsible of providing all needed libraries and corresponding files to make them findable to CMake.
ta_in: CMake கொடியை ` ` DISABLE_CONAN ` ` (default= ` ` OFF ` `) சேர். மூலத்திலிருந்து நிறுவி, ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` `. இது ஒரு சூழல் மாறாக ` DISABLE_CONAN ` `, இது CMake கொடியை மேல் எடுத்துக் கொள்ளும். இது AER கட்டுவதற்கு அதிகாரப்பூர்வை அளிக்கவில்லை. இப்படி, பயனர் அனைத்து தேவையான நூலகங்களையும், ஒத்திசைவு கோப்புகளையும் வழங்குவதற்கு பொறுப்பேற்றது.

source: This release includes support for building qiskit-aer with MPI support to run large simulations on a distributed computing environment. See the `contributing guide <https://github.com/Qiskit/qiskit-aer/blob/master/CONTRIBUTING.md#building-with-mpi-support>`__ for instructions on building and running in an MPI environment.
ta_in: இந்த வெளியீட்டில் விநியோகிக்கப்பட்ட கணினி சூழலில் பெரிய உருவகப்படுத்துதல்களை இயக்க MPI ஆதரவுடன் கிஸ்கிட்-ஏரை உருவாக்குவதற்கான ஆதரவு அடங்கும். `பங்களிக்கும் வழிகாட்டியைக் காண்க<https://github.com/Qiskit/qiskit-aer/blob/master/CONTRIBUTING.md#building-with-mpi-support>`__ ஒரு MPI சூழலில் கட்டமைத்தல் மற்றும் இயங்குவதற்கான வழிமுறைகளுக்கு.

source: It is now possible to build qiskit-aer with CUDA enabled in Windows. See the `contributing guide <https://github.com/Qiskit/qiskit-aer/blob/master/CONTRIBUTING.md#building-with-gpu-support>`__ for instructions on building from source with GPU support.
ta_in: விண்டோஸில் இயக்கப்பட்ட CUDA உடன் கிஸ்கிட்-ஏரை உருவாக்க இப்போது சாத்தியம். `பங்களிக்கும் வழிகாட்டியைக் காண்க <https://github.com/Qiskit/qiskit-aer/blob/master/CONTRIBUTING.md#building-with-gpu-support>`__ ஜி.பீ.யூ ஆதரவுடன் மூலத்திலிருந்து கட்டமைப்பதற்கான வழிமுறைகளுக்கு.

source: When building the qiskit-aer Python extension from source several build dependencies need to be pre-installed to enable C++ compilation. As a user convenience when building the extension any of these build dependencies which were missing would be automatically installed using ``pip`` prior to the normal ``setuptools`` installation steps, however it was previously was not possible to avoid this automatic installation. To solve this issue a new environment variable ``DISABLE_DEPENDENCY_INSTALL`` has been added. If it is set to ``1`` or ``ON`` when building the python extension from source this will disable the automatic installation of these missing build dependencies.
ta_in: மூலத்திலிருந்து கிஸ்கிட்-ஏர் பைதான் நீட்டிப்பை உருவாக்கும்போது, ​​C++ தொகுப்பை இயக்க பல உருவாக்க சார்புகளை முன்பே நிறுவ வேண்டும். நீட்டிப்பை உருவாக்கும் போது பயனர் வசதியாக, காணாமல் போன இந்த உருவாக்க சார்புகளில் ஏதேனும் தானாகவே நிறுவப்படும் ``pip`` இயல்பான முன் ``setuptools`` நிறுவல் படிகள், இருப்பினும் இந்த தானியங்கி நிறுவலைத் தவிர்ப்பது முன்னர் சாத்தியமில்லை. இந்த சிக்கலை தீர்க்க ஒரு புதிய சூழல் மாறி ``DISABLE_DEPENDENCY_INSTALL`` இணைக்கப்பட்டு விட்டது. இது அமைக்கப்பட்டால் ``1`` அல்லது ``ON`` மூலத்திலிருந்து பைதான் நீட்டிப்பை உருவாக்கும்போது, ​​இந்த காணாமல் போன உருவாக்க சார்புகளின் தானியங்கி நிறுவலை இது முடக்கும்.

source: Adds support for optimized N-qubit Pauli gate ( :class:`qiskit.circuit.library.PauliGate`) to the :class:`~qiskit.providers.aer.StatevectorSimulator`, :class:`~qiskit.providers.aer.UnitarySimulator`, and the statevector and density matrix methods of the :class:`~qiskit.providers.aer.QasmSimulator` and :class:`~qiskit.providers.aer.AerSimulator`.
ta_in: உகந்த N-qubit பவுலி வாயிலுக்கு (:class: `qiskit.circuit.library.PauliGate`): வகுப்பிற்கு ஆதரவைச் சேர்க்கிறது :class:` ~ qiskit.providers.aer.StatevectorSimulator` ,:class: `~qiskit.providers.aer. யூனிட்டரிசிமுலேட்டர்`, மற்றும் ஸ்டேட்வெக்டர் மற்றும் அடர்த்தி மேட்ரிக்ஸ் முறைகள் :class: `~qiskit.providers.aer.QasmSimulator` மற்றும் :class:` ~ qiskit.providers.aer.AerSimulator`.

source: The :meth:`~qiskit.providers.aer.AerSimulator.run` method for the :class:`~qiskit.providers.aer.AerSimulator`, :class:`~qiskit.providers.aer.QasmSimulator`, :class:`~qiskit.providers.aer.StatevectorSimulator`, and :class:`~qiskit.providers.aer.UnitarySimulator` backends now takes a :class:`~qiskit.circuit.QuantumCircuit` (or a list of :class:`~qiskit.circuit.QuantumCircuit` objects) as it's input. The previous :class:`~qiskit.qobj.QasmQobj` object is still supported for now, but will be deprecated in a future release.
ta_in: தி :meth:`~qiskit.providers.aer.AerSimulator.run`அதற்கான முறை :class:`~qiskit.providers.aer.AerSimulator`, :class:`~qiskit.providers.aer.QasmSimulator`, :class:`~qiskit.providers.aer.StatevectorSimulator`, மற்றும்:class:`~qiskit.providers.aer.UnitarySimulator` பின்தளத்தில் இப்போது ஒரு எடுக்கும் :class:`~qiskit.circuit.QuantumCircuit`(அல்லது ஒரு பட்டியல்:class:`~qiskit.circuit.QuantumCircuit` பொருள்) அது உள்ளீடாக இருப்பதால். முந்தைய :class:`~qiskit.qobj.QasmQobj` பொருள் இப்போதும் ஆதரிக்கப்படுகிறது, ஆனால் எதிர்கால வெளியீட்டில் அது நீக்கப்படும்.

source: The :meth:`~qiskit.providers.aer.PulseSimulator.run` method for the :class:`~qiskit.providers.aer.PulseSimulator` backend now takes a :class:`~qiskit.pulse.Schedule` (or a list of :class:`~qiskit.pulse.Schedule` objects) as it's input. The previous :class:`~qiskit.qobj.PulseQobj` object is still supported for now, but will be deprecated in a future release.
ta_in: தி:meth:`~qiskit.providers.aer.PulseSimulator.run` அதற்கான முறை:class:`~qiskit.providers.aer.PulseSimulator` பின்தளத்தில் இப்போது ஒரு எடுக்கும்:class:`~qiskit.pulse.Schedule`(அல்லது ஒரு பட்டியல் :class:`~qiskit.pulse.Schedule` பொருள்) அது உள்ளீடு என்பதால். முந்தைய :class:`~qiskit.qobj.PulseQobj`பொருள் இப்போதும் ஆதரிக்கப்படுகிறது, ஆனால் எதிர்கால வெளியீட்டில் அது நீக்கப்படும்.

source: Adds the new :class:`~qiskit.provider.aer.AerSimulator` simulator backend supporting the following simulation methods
ta_in: புதியதைச் சேர்க்கிறது:class:`~qiskit.provider.aer.AerSimulator` பின்வரும் உருவகப்படுத்துதல் முறைகளை ஆதரிக்கும் சிமுலேட்டர் பின்தளத்தில்

source: The default `automatic` method will automatically choose a simulation method separately for each run circuit based on the circuit instructions and noise model (if any). Initializing a simulator with a specific method can be done using the `method` option.
ta_in: இயல்புநிலை `automatic` முறை சுற்று வழிமுறைகள் மற்றும் இரைச்சல் மாதிரியின் அடிப்படையில் (ஏதேனும் இருந்தால்) ஒவ்வொரு ரன் சுற்றுக்கும் தனித்தனியாக ஒரு உருவகப்படுத்துதல் முறையைத் தேர்ந்தெடுக்கும். ஒரு குறிப்பிட்ட முறையுடன் ஒரு ஒப்புருவாகியைத் தொடங்குவது `method` விருப்பத்தைப் பயன்படுத்தி செய்யப்படலாம்.

source: GPU simulation for the statevector, density matrix and unitary methods can be enabled by setting the ``device='GPU'`` backend option.
ta_in: ``device='GPU`` பின்தளத்தில் விருப்பத்தை அமைப்பதன் மூலம் ஸ்டேட்வெக்டர், அடர்த்தி மேட்ரிக்ஸ் மற்றும் ஒற்றையாட்சி முறைகளுக்கான ஜி. பீ. யூ உருவகப்படுத்துதலை இயக்க முடியும்.

source: Note that the ``unitary`` and ``superop`` methods do not support measurement as they simulate the unitary matrix or superoperator matrix of the run circuit so one of the new :func:`~qiskit.providers.aer.library.save_unitary`, :func:`~qiskit.providers.aer.library.save_superop`, or :func:`~qiskit.providers.aer.library.save_state` instructions must be used to save the simulator state to the returned results. Similarly state of the other simulations methods can be saved using the appropriate instructions. See the :mod:`qiskit.providers.aer.library` API documents for more details.
ta_in: ரன் சர்க்யூட்டின் யூனிட்டரி மேட்ரிக்ஸ் அல்லது சூப்பர் ஆபரேட்டர் மேட்ரிக்ஸை உருவகப்படுத்துவதால் ``unitary`` மற்றும் ``superop`` முறைகள் அளவீட்டை ஆதரிக்காது என்பதை நினைவில் கொள்க, எனவே புதியது :func: `~ qiskit.providers.aer.library. save_unitary` ,:func: `~ qiskit.providers.aer.library.save_superop`, அல்லது:func:` ~ qiskit.providers.aer.library.save_state` அறிவுறுத்தல்கள் சிமுலேட்டர் நிலையை திரும்பப் பெற்ற முடிவுகளில் சேமிக்க பயன்படுத்தப்பட வேண்டும். இதேபோல் பிற உருவகப்படுத்துதல் முறைகளின் நிலையும் பொருத்தமான வழிமுறைகளைப் பயன்படுத்தி சேமிக்க முடியும். மேலும் விவரங்களுக்கு:mod: `qiskit.providers.aer.library` API ஆவணங்களைக் காண்க.

source: Note that the :class:`~qiskit.providers.aer.AerSimulator` simulator superceds the :class:`~qiskit.providers.aer.QasmSimulator`, :class:`~qiskit.providers.aer.StatevectorSimulator`, and :class:`~qiskit.providers.aer.UnitarySimulator` backends which will be deprecated in a future release.
ta_in: :class: `~ qiskit.providers.aer.AerSimulator` சிமுலேட்டர்:class:` ~ qiskit.providers.aer.QasmSimulator` ,:class: `~ qiskit.providers.aer.StatevectorSimulator`, மற்றும்:class: `~ qiskit.providers.aer.UnitarySimulator` பின்தளத்தில் எதிர்கால வெளியீட்டில் நீக்கப்படும்.

source: Updates the :class:`~qiskit.providers.aer.AerProvider` class to include multiple :class:`~qiskit.providers.aer.AerSimulator` backends preconfigured for all available simulation methods and simulation devices. The new backends can be accessed through the provider interface using the names
ta_in: புதுப்பிக்கிறது:class: `~ qiskit.providers.aer.AerProvider` வகுப்பை பலவற்றை சேர்க்க:class:` ~ qiskit.providers.aer.AerSimulator` பின்தளத்தில் கிடைக்கக்கூடிய அனைத்து உருவகப்படுத்துதல் முறைகள் மற்றும் உருவகப்படுத்துதல் சாதனங்களுக்கும் முன்பே கட்டமைக்கப்பட்டுள்ளது. புதிய பின்தளத்தில் பெயர்களைப் பயன்படுத்தி வழங்குநர் இடைமுகத்தின் மூலம் அணுகலாம்

source: Additional if Aer was installed with GPU support on a compatible system the following GPU backends will also be available
ta_in: இணக்கமான கணினியில் GPU ஆதரவுடன் ஏர் நிறுவப்பட்டிருந்தால் கூடுதல் GPU பின்தளத்தில் கிடைக்கும்

source: Added a new ``norm estimation`` method for performing measurements when using the ``"extended_stabilizer"`` simulation method. This norm estimation method can be used by passing the following options to the :class:`~qiskit.providers.aer.AerSimulator` and :class:`~qiskit.providers.aer.QasmSimulator` backends
ta_in: `` "extended_stabilizer" `` உருவகப்படுத்துதல் முறையைப் பயன்படுத்தும் போது அளவீடுகளைச் செய்வதற்கான புதிய ``norm estimation`` முறையைச் சேர்த்தது. பின்வரும் விருப்பங்களை வகுப்பிற்கு அனுப்புவதன் மூலம் இந்த விதிமுறை மதிப்பீட்டு முறையைப் பயன்படுத்தலாம் :class: `~ qiskit.providers.aer.AerSimulator` மற்றும்:class:` ~ qiskit.providers.aer.QasmSimulator` பின்தளத்தில்

source: The norm estimation method is slower than the alternative ``metropolis`` or ``resampled_metropolis`` options, but gives better performance on circuits with sparse output distributions. See the documentation of the :class:`~qiskit.providers.aer.QasmSimulator` for more information.
ta_in: விதிமுறை மதிப்பீட்டு முறை மாற்று `` metropolis`` அல்லது ``resampled_metropolis`` விருப்பங்களை விட மெதுவாக உள்ளது, ஆனால் சிதறல் வெளியீட்டு விநியோகங்களுடன் சுற்றுகளில் சிறந்த செயல்திறனை அளிக்கிறது. மேலும் தகவலுக்கு:class: `~ qiskit.providers.aer.QasmSimulator` இன் ஆவணங்களைக் காண்க.

source: Adds instructions for saving the state of the simulator in various formats. These instructions are
ta_in: சிமுலேட்டரின் நிலையை பல்வேறு வடிவங்களில் சேமிப்பதற்கான வழிமுறைகளைச் சேர்க்கிறது. இந்த வழிமுறைகள்

source: These instructions can be appended to a quantum circuit by using the :class:`~qiskit.providers.aer.library.save_density_matrix`, :class:`~qiskit.providers.aer.library.save_matrix_product_state`, :class:`~qiskit.providers.aer.library.save_stabilizer`, :class:`~qiskit.providers.aer.library.save_state`, :class:`~qiskit.providers.aer.library.save_statevector`, :class:`~qiskit.providers.aer.library.save_statevector_dict`, :class:`~qiskit.providers.aer.library.save_unitary` circuit methods which are added to ``QuantumCircuit`` when importing Aer.
ta_in: These instructions can be appended to a quantum circuit by using the :class:`~qiskit.providers.aer.library.save_density_matrix`, :class:`~qiskit.providers.aer.library.save_matrix_product_state`, :class:`~qiskit.providers.aer.library.save_stabilizer`, :class:`~qiskit.providers.aer.library.save_state`, :class:`~qiskit.providers.aer.library.save_statevector`, :class:`~qiskit.providers.aer.library.save_statevector_dict`, :class:`~qiskit.providers.aer.library.save_unitary` சுற்று முறைகள் Aer ஐ இறக்குமதி செய்யும் போது` `QuantumCircuit`` இல் சேர்க்கப்படுகின்றன.

source: See the :mod:`qiskit.providers.aer.library` API documentation for details on method compatibility for each instruction.
ta_in: ஒவ்வொரு அறிவுறுத்தலுக்கும் முறை பொருந்தக்கூடிய தன்மை குறித்த விவரங்களுக்கு :mod: `qiskit.providers.aer.library` API ஆவணங்களைக் காண்க.

source: Note that the snapshot instructions :class:`~qiskit.providers.aer.extensions.SnapshotStatevector`, :class:`~qiskit.providers.aer.extensions.SnapshotDensityMatrix`, :class:`~qiskit.providers.aer.extensions.SnapshotStabilizer` are still supported but will be deprecated in a future release.
ta_in: ஸ்னாப்ஷாட் வழிமுறைகள் என்பதை நினைவில் கொள்க:class:`~qiskit.providers.aer.extensions.SnapshotStatevector`, :class:`~qiskit.providers.aer.extensions.SnapshotDensityMatrix`,:class:`~qiskit.providers.aer.extensions.SnapshotStabilizer` இன்னும் ஆதரிக்கப்படுகின்றன, ஆனால் எதிர்கால வெளியீட்டில் நீக்கப்படும்.
