Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: Changes ``fusion_threshold`` backend option to apply fusion when the number of qubits is above the threshold, not equal or above the threshold, to match the behavior of the OpenMP qubit threshold parameter.
ta_in: ஓப்பன்எம்பி குவிட் த்ரெஷோல்ட் அளவுருவின் நடத்தைக்கு பொருந்த, குவிட்டுகளின் எண்ணிக்கை வாசலுக்கு மேலே இருக்கும்போது, ​​வாசலுக்கு சமமாகவோ அல்லது வாசலுக்கு மேலேவோ இருக்கும்போது இணைவு பயன்படுத்த `` ஃப்யூஷன்_தெரெஷோல்ட்`` பின்தளத்தில் விருப்பத்தை மாற்றுகிறது.

source: :meth:`qiskit.providers.aer.noise.NoiseModel.set_x90_single_qubit_gates` has been deprecated as unrolling to custom basis gates has been added to the qiskit transpiler. The correct way to use an X90 based noise model is to define noise on the Sqrt(X) ``"sx"`` or ``"rx"`` gate and one of the single-qubit phase gates ``"u1"``, ``"rx"``, or ``"p"`` in the noise model.
ta_in: : meth: `qiskit.providers.aer.noise.NoiseModel.set_x90_single_qubit_gates` தனிப்பயன் அடிப்படை வாயில்களுக்கு அன்ரோல் செய்வது கிஸ்கிட் டிரான்ஸ்பைலரில் சேர்க்கப்பட்டுள்ளதால் நீக்கப்பட்டது. எக்ஸ் 90 அடிப்படையிலான இரைச்சல் மாதிரியைப் பயன்படுத்துவதற்கான சரியான வழி சதுர (எக்ஸ்) `` "எஸ்எக்ஸ்" `` அல்லது `` "ஆர்எக்ஸ்" `` வாயில் மற்றும் ஒற்றை-குவிட் கட்ட வாயில்களில் ஒன்றான `` "யு 1" இரைச்சல் மாதிரியில் ``, `` "rx" `` அல்லது `` "ப" ``.

source: The ``variance`` kwarg of Snapshot instructions has been deprecated. This function computed the sample variance in the snapshot due to noise model sampling, not the variance due to measurement statistics so was often being used incorrectly. If noise modeling variance is required single shot snapshots should be used so variance can be computed manually in post-processing.
ta_in: ஸ்னாப்ஷாட் அறிவுறுத்தல்களின் `` மாறுபாடு`` குவார்க் நீக்கப்பட்டது. இந்த செயல்பாடு சத்தம் மாதிரி மாதிரியின் காரணமாக ஸ்னாப்ஷாட்டில் உள்ள மாதிரி மாறுபாட்டைக் கணக்கிட்டது, அளவீட்டு புள்ளிவிவரங்கள் காரணமாக மாறுபாடு அல்ல, எனவே பெரும்பாலும் தவறாகப் பயன்படுத்தப்படுகிறது. சத்தம் மாடலிங் மாறுபாடு தேவைப்பட்டால் ஒற்றை ஷாட் ஸ்னாப்ஷாட்களைப் பயன்படுத்த வேண்டும், எனவே மாறுபாட்டை பிந்தைய செயலாக்கத்தில் கைமுறையாக கணக்கிடலாம்.

source: Fixes bug in the :class:`~qiskit.providers.aer.StatevectorSimulator` that caused it to always run as CPU with double-precision without SIMD/AVX2 support even on systems with AVX2, or when single-precision or the GPU method was specified in the backend options.
ta_in: பிழை: வகுப்பில் பிழைகளை சரிசெய்கிறது: `~ qiskit.providers.aer.StatevectorSimulator` இது எப்போதும் AVX2 உடன் கணினிகளில் அல்லது ஒற்றை துல்லியம் அல்லது ஜி.பீ. பின்தளத்தில் விருப்பங்களில் குறிப்பிடப்பட்டுள்ளது.

source: Fixes some for-loops in C++ code that were iterating over copies rather than references of container elements.
ta_in: C++ குறியீட்டில் உள்ள சில-லூப்ஸ் (C++ குறியீடுகள்) உள்ளடக்க உறுப்புகளை குறிப்பிடுவதற்கு பதிலளிக்கும்.

source: Fixes a bug where snapshot data was always copied from C++ to Python rather than moved where possible. This will halve memory usage and improve simulation time when using large statevector or density matrix snapshots.
ta_in: எப்போதும் எப்போதும் நகர்த்தப்படுவதை விட எப்பொழுதும் C++ ல் இருந்து எப்போதும் நகலெடுக்கப்பட்டிருக்கும் ஒரு பிழை நீக்குகிறது. இது நினைவக பயன்பாடு மற்றும் பெரிய மாதிரிகளை அல்லது அடர்த்தி மாட்ரிக்ஸ் ஸான்ஸ்போட் பயன்படுத்தும்போது நினைவகத்தை மேம்படுத்தும்.

source: Fix `State::snapshot_pauli_expval` to return correct Y expectation value in stabilizer simulator. Refer to `#895 <https://github.com/Qiskit/qiskit-aer/issues/895>` for more details.
ta_in: நிலைப்படுத்தி சிமுலேட்டரில் சரியான Y எதிர்பார்ப்பு மதிப்பைத் தர `மாநில:: ஸ்னாப்ஷாட்_பாலி_எக்ஸ்பால்` ஐ சரிசெய்யவும். மேலும் விவரங்களுக்கு `# 895 <https://github.com/Qiskit/qiskit-aer/issues/895>` ஐப் பார்க்கவும்.

source: The controller_execute wrappers have been adjusted to be functors (objects) rather than free functions. Among other things, this allows them to be used in multiprocessing.pool.map calls.
ta_in: கட்டுப்பாட்டின் செயல்பாடு செயல்பாடு (பொருட்கள்) இலவச செயல்பாடுகளுக்கு மேலாக அமைக்கப்பட்டுள்ளது. மற்ற விஷயங்களுள் இவற்றை பெரும்பான்மையானவற்றில் பயன்படுத்தப்படுவதற்கு அனுமதிக்கிறது.

source: Add missing available memory checks for the :class:`~qiskit.providers.aer.StatevectorSimulator` and :class:`~qiskit.providers.aer.UnitarySimulator`. This throws an exception if the memory required to simulate the number of qubits in a circuit exceeds the available memory of the system.
ta_in: : Class: `q qiskit.providers.aer.StatevectorSimulator` மற்றும்: class:` ~ qiskit.providers.aer.UnitarySimulator` க்கான கிடைக்காத நினைவக சோதனைகளைச் சேர்க்கவும். ஒரு சுற்றில் உள்ள குவிட்களின் எண்ணிக்கையை உருவகப்படுத்த தேவையான நினைவகம் கணினியின் கிடைக்கக்கூடிய நினைவகத்தை விட அதிகமாக இருந்தால் இது விதிவிலக்கு.

source: This release includes a new module for expectation value measurement error mitigation, improved plotting functionality for quantum volume experiments, several bug fixes, and drops support for Python 3.5.
ta_in: இந்த வெளியீட்டில் எதிர்பார்ப்பு மதிப்பு அளவீட்டு பிழை தணிப்பு, குவாண்டம் தொகுதி சோதனைகளுக்கான மேம்பட்ட சதி செயல்பாடு, பல பிழை திருத்தங்கள் மற்றும் பைத்தான் 3.5 க்கான ஆதரவைக் கொண்டுள்ளது.

source: The :func:`qiskit.ignis.verification.randomized_benchmarking.randomized_benchmarking_seq` function allows an optional input of gate objects as `interleaved_elem`. In addition, the CNOT-Dihedral class :class:`qiskit.ignis.verification.randomized_benchmarking.CNOTDihedral` has a new method `to_instruction`, and the existing `from_circuit` method has an optional input of an `Instruction` (in addition to `QuantumCircuit`).
ta_in: : Func: `qiskit.ignis.verification.randomized_benchmarking.randomized_benchmarking_seq` செயல்பாடு கேட் பொருள்களின் விருப்ப உள்ளீட்டை` interleaved_elem` என அனுமதிக்கிறது. கூடுதலாக, சி.என்.ஓ.டி. `குவாண்டம் சர்க்யூட்`).

source: The :class:`qiskit.ignis.verification.randomized_benchmarking.CNOTDihedral` now contains the following new features. Initialization from various types of objects: `CNOTDihedral`, `ScalarOp`, `QuantumCircuit`, `Instruction` and `Pauli`. Converting to a matrix using `to_matrix` and to an operator using `to_operator`. Tensor product methods `tensor` and `expand`. Calculation of the adjoint, conjugate and transpose using `conjugate`, `adjoint` and `transpose` methods. Verify that an element is CNOTDihedral using `is_cnotdihedral` method. Decomposition method `to_circuit` of a CNOTDihedral element into a circuit was extended to allow any number of qubits, based on the function `decompose_cnotdihedral_general`.
ta_in: The :class:`qiskit.ignis.verification.randomized_benchmarking.CNOTDihedral` now contains the following new features. Initialization from various types of objects: `CNOTDihedral`, `ScalarOp`, `QuantumCircuit`, `Instruction` and `Pauli`. Converting to a matrix using `to_matrix` and to an operator using `to_operator`. Tensor product methods `tensor` and `exவகுப்பு: `qiskit.ignis.verification.randomized_benchmarking.CNOTDihedral` இப்போது பின்வரும் புதிய அம்சங்களைக் கொண்டுள்ளது. பல்வேறு வகையான பொருட்களிலிருந்து துவக்கம்: `சி.என்.ஓ.டி.டிஹெட்ரல்`,` ஸ்கேலார்ஆப்`, `குவாண்டம் சர்க்யூட்`,` அறிவுறுத்தல்` மற்றும் `பவுலி`. `To_matrix` ஐப் பயன்படுத்தி ஒரு மேட்ரிக்ஸாகவும்,` to_operator` ஐப் பயன்படுத்தும் ஆபரேட்டராகவும் மாற்றுகிறது. டென்சர் தயாரிப்பு முறைகள் `டென்சர்` மற்றும்` விரிவாக்கு`. `இணைத்தல்`,` சரிசெய்தல்` மற்றும்` இடமாற்றம்` முறைகளைப் பயன்படுத்தி சரிசெய்தல், இணைத்தல் மற்றும் இடமாற்றம் ஆகியவற்றைக் கணக்கிடுதல். `Is_cnotdihedral` முறையைப் பயன்படுத்தி ஒரு உறுப்பு CNOTDihedral என்பதை சரிபார்க்கவும். `சிதைவு_நொட்டிஹெட்ரல்_ஜெனரல்` செயல்பாட்டின் அடிப்படையில், ஒரு சி.என்.ஓ.டி.டிஹெட்ரல் தனிமத்தின் சிதைவு முறை` டூ_சர்க்யூட்` எந்தவொரு குவிட்டுகளையும் அனுமதிக்க நீட்டிக்கப்பட்டது. pand`. Calculation of the adjoint, conjugate and transpose using `conjugate`, `adjoint` and `transpose` methods. Verify that an element is CNOTDihedral using `is_cnotdihedral` method. Decomposition method `to_circuit` of a CNOTDihedral element into a circuit was extended to allow any number of qubits, based on the function `decompose_cnotdihedral_general`.

source: Adds expectation value measurement error mitigation to the mitigation module. This supports using *complete* N-qubit assignment matrix, single-qubit *tensored* assignment matrix, or *continuous time Markov process (CTMP)* [1] measurement error mitigation when computing expectation values of diagonal operators from counts dictionaries. Expectation values are computed using the using the :func:`qiskit.ignis.mitigation.expectation_value` function.
ta_in: தணிப்பு தொகுதிக்கு எதிர்பார்ப்பு மதிப்பு அளவீட்டு பிழை குறைப்பை சேர்க்கிறது. இது * முழுமையான * என்-க்விட் அசைன்மென்ட் மேட்ரிக்ஸ், ஒற்றை-க்விட் * டென்சர் * அசைன்மென்ட் மேட்ரிக்ஸ் அல்லது * தொடர்ச்சியான நேர மார்கோவ் செயல்முறை (சி.டி.எம்.பி) * [1] கணக்கீட்டு ஆபரேட்டர்களின் எதிர்பார்ப்பு மதிப்புகளை கணக்கீட்டு அகராதிகளிலிருந்து கணக்கிடும்போது அளவீட்டு பிழை குறைப்பு. : Func: `qiskit.ignis.mitigation.expectation_value` செயல்பாட்டைப் பயன்படுத்தி எதிர்பார்ப்பு மதிப்புகள் கணக்கிடப்படுகின்றன.

source: Calibration circuits for calibrating a measurement error mitigator are generated using the :func:`qiskit.ignis.mitigation.expval_meas_mitigator_circuits` function, and the result fitted using the :class:`qiskit.ignis.mitigation.ExpvalMeasMitigatorFitter` class. The fitter returns a mitigator object can the be supplied as an argument to the :func:`~qiskit.ignis.mitigation.expectation_value` function to apply mitigation.
ta_in: அளவீட்டு பிழை தணிப்பாளரை அளவிடுவதற்கான அளவுத்திருத்த சுற்றுகள்: func: `qiskit.ignis.mitigation.expval_meas_mitigator_circuits` செயல்பாட்டைப் பயன்படுத்தி உருவாக்கப்படுகின்றன, இதன் விளைவாக: class:` qiskit.ignis.mitigation.ExpvalMeasMitigatorFitter` வகுப்பைப் பயன்படுத்தி பொருத்தப்படுகிறது. தணிப்பான் ஒரு தணிக்கும் பொருளை ஒரு வாதமாக வழங்கலாம்: func: `~ qiskit.ignis.mitigation.expectation_value` செயல்பாட்டைத் தணிக்க.

source: *Mitigating measurement errors in multi-qubit experiments*, arXiv:2006.14044 [quant-ph].
ta_in: * மல்டி-கியூபிட் அளவீட்டு பிழைகளை குறைத்தல் *, arXiv: 2006.14044 [quant-ph].

source: Example:
ta_in: எடுத்துக்காட்டுகள்:

source: The following example shows calibrating a 5-qubit expectation value measurement error mitigator using the ``'tensored'`` method.
ta_in: பின்வரும் உதாரணமாக 5-விகிதமான எதிர்பார்ப்பு மதிப்பு அளவிலான மதிப்பு அளவிலான ` ` 'tensored ' ` முறையை பயன்படுத்துகிறது.

source: The following shows how to use the above mitigator to apply measurement error mitigation to expectation value computations
ta_in: பின்வரும் நிகழ்படங்கள் எப்படி மேற்பட்ட mitigator யை பயன்படுத்த எவ்வாறு கணக்கிடும் தவறான மதிப்பு கணக்கீடுகளுக்குத் தேவைப்படுகிறது

source: Adds Numba as an optional dependency. Numba is used to significantly increase the performance of the :class:`qiskit.ignis.mitigation.CTMPExpvalMeasMitigator` class used for expectation value measurement error mitigation with the CTMP method.
ta_in: நம்பாவை விருப்ப சார்புநிலையாக சேர்க்கிறது. வகுப்பு: `qiskit.ignis.mitigation.CTMPExpvalMeasMitigator` வகுப்பின் செயல்திறனை கணிசமாக அதிகரிக்க நம்பா CTMP முறையுடன் எதிர்பார்ப்பு மதிப்பு அளவீட்டு பிழை தணிப்புக்கு பயன்படுத்தப்படுகிறது.

source: Add two methods to :class:`qiskit.ignis.verification.quantum_volume.QVFitter`.
ta_in: இரண்டு முறைகளைச் சேர் :class:` qiskit.ignis.verification.quantum_volume.QVFitter `.

source: :meth:`qiskit.ignis.verification.quantum_volume.QVFitter.calc_z_value` to calculate z value in standard normal distribution using mean and standard deviation sigma. If sigma = 0, it raises a warning and assigns a small value (1e-10) for sigma so that the code still runs.
ta_in: மெத்: சராசரி மற்றும் நிலையான விலகல் சிக்மாவைப் பயன்படுத்தி நிலையான இயல்பான விநியோகத்தில் z மதிப்பைக் கணக்கிட `qiskit.ignis.verification.quantum_volume.QVFitter.calc_z_value`. சிக்மா = 0 எனில், அது ஒரு எச்சரிக்கையை எழுப்புகிறது மற்றும் சிக்மாவுக்கு ஒரு சிறிய மதிப்பை (1e-10) ஒதுக்குகிறது, இதனால் குறியீடு இன்னும் இயங்கும்.

source: :meth:`qiskit.ignis.verification.quantum_volume.QVFitter.calc_confidence_level` to calculate confidence level using z value.
ta_in: : மெத்: z மதிப்பைப் பயன்படுத்தி நம்பிக்கை அளவைக் கணக்கிட `qiskit.ignis.verification.quantum_volume.QVFitter.calc_confidence_level`.

source: Store confidence level even when hmean < 2/3 in :meth:`qiskit.ignis.verification.quantum_volume.QVFitter.qv_success`.
ta_in: Hmean <2/3 in :meth: `qiskit.ignis.verification.quantum_volume.QVFitter.qv_success` போது கூட நம்பிக்கை நிலை சேமிக்கவும்.

source: Add explanations for how to calculate statistics based on binomial distribution in :meth:`qiskit.ignis.verification.quantum_volume.QVFitter.calc_statistics`.
ta_in: பைனோமியல் விநியோகத்தின் அடிப்படையில் புள்ளிவிவரங்களை எவ்வாறு கணக்கிடுவது என்பதற்கான விளக்கங்களைச் சேர்க்கவும்: மெத்: `qiskit.ignis.verification.quantum_volume.QVFitter.calc_statistics`.

source: The :class:`qiskit.ignis.verification.QVFitter` method :meth:`~qiskit.ignis.verification.QVFitter.plot_qv_data` has been updated to return a ``matplotlib.Figure`` object. Previously, it would not return anything. By returning a figure this makes it easier to integrate the visualizations into a larger ``matplotlib`` workflow.
ta_in: வகுப்பு: `qiskit.ignis.verification.QVFitter` முறை: மெத்:` ~ qiskit.ignis.verification.QVFitter.plot_qv_data` ஒரு `` matplotlib.Figure`` பொருளைத் தர புதுப்பிக்கப்பட்டுள்ளது. முன்பு, அது எதையும் திருப்பித் தராது. ஒரு உருவத்தைத் திருப்புவதன் மூலம், காட்சிப்படுத்தல்களை ஒரு பெரிய `` மேட்லோட்லிப்`` பணிப்பாய்வுகளில் ஒருங்கிணைப்பதை இது எளிதாக்குகிறது.

source: The error bars in the figure produced by the :class:`qiskit.ignis.verification.QVFitter` method :meth:`qiskit.ignis.verification.QVFitter.plot_qv_data` has been updated to represent two-sigma confidence intervals. Previously, the error bars represent one-sigma confidence intervals. The success criteria of Quantum Volume benchmarking requires heavy output probability > 2/3 with one-sided two-sigma confidence (~97.7%). Changing error bars to represent two-sigma confidence intervals allows easily identification of success in the figure.
ta_in: : class: `qiskit.ignis.verification.QVFitter` முறை: மெத்:` qiskit.ignis.verification.QVFitter.plot_qv_data` ஆல் உருவாக்கப்பட்ட உருவத்தில் உள்ள பிழைகள் இரண்டு சிக்மா நம்பிக்கை இடைவெளிகளைக் குறிக்கும் வகையில் புதுப்பிக்கப்பட்டுள்ளன. முன்னதாக, பிழைகள் ஒரு-சிக்மா நம்பிக்கை இடைவெளிகளைக் குறிக்கும். குவாண்டம் தொகுதி தர நிர்ணயத்தின் வெற்றிகரமான அளவுகோல்களுக்கு கனமான வெளியீட்டு நிகழ்தகவு> 2/3 ஒரு பக்க இரு சிக்மா நம்பிக்கையுடன் (~ 97.7%) தேவைப்படுகிறது. இரண்டு சிக்மா நம்பிக்கை இடைவெளிகளைக் குறிக்க பிழைப் பட்டிகளை மாற்றுவது படத்தில் வெற்றியை எளிதில் அடையாளம் காண அனுமதிக்கிறது.

source: A new kwarg, ``figsize`` has been added to the :class:`qiskit.ignis.verification.QVFitter` method :meth:`qiskit.ignis.verification.QVFitter.plot_qv_data`. This kwarg takes in a tuple of the form ``(x, y)`` where ``x`` and ``y`` are the dimension in inches to make the generated plot.
ta_in: ஒரு புதிய குவார்க், `` figsize``: class: `qiskit.ignis.verification.QVFitter` method: meth:` qiskit.ignis.verification.QVFitter.plot_qv_data` இல் சேர்க்கப்பட்டுள்ளது. இந்த குவார்க் `` (x, y) `` வடிவத்தின் ஒரு பகுதியை எடுத்துக்கொள்கிறது, அங்கு `` x`` மற்றும் `` y`` ஆகியவை உருவாக்கப்பட்ட சதித்திட்டத்தை உருவாக்க அங்குலங்களில் பரிமாணமாகும்.

source: The :meth:`qiskit.ignis.verification.quantum_volume.QVFitter.plot_hop_accumulative` method has been added to plot heavy output probability (HOP) vs number of trials similar to Figure 2a of Quantum Volume 64 paper (`arXiv:2008.08571 <https://arxiv.org/abs/2008.08571>`_). HOP of individual trials are plotted as scatters and cummulative HOP are plotted in red line. Two-sigma confidence intervals are plotted as shaded area and 2/3 success threshold is plotted as dashed line.
ta_in: குவாண்டம் தொகுதி 64 காகிதத்தின் படம் 2a ஐப் போன்ற சோதனைகளின் எண்ணிக்கையை எதிர்த்து கனரக வெளியீட்டு நிகழ்தகவு (HOP) மற்றும் சோதனைகளின் எண்ணிக்கையைத் திட்டமிட: மெத்: `qiskit.ignis.verification.quantum_volume.QVFitter.plot_hop_accumulative` முறை சேர்க்கப்பட்டுள்ளது. //arxiv.org/abs/2008.08571>`_). தனிப்பட்ட சோதனைகளின் HOP சிதறல்கள் மற்றும் ஒட்டுமொத்த HOP சிவப்பு வரிசையில் திட்டமிடப்பட்டுள்ளதால் திட்டமிடப்பட்டுள்ளது. இரண்டு-சிக்மா நம்பிக்கை இடைவெளிகள் நிழலாடிய பகுதியாகவும் 2/3 வெற்றி வாசல் கோடு கோட்டாகவும் திட்டமிடப்பட்டுள்ளது

source: The :meth:`qiskit.ignis.verification.quantum_volume.QVFitter.plot_qv_trial` method has been added to plot individual trials, leveraging on the :meth:`qiskit.visualization.plot_histogram` method from Qiskit Terra. Bitstring counts are plotted as overlapping histograms for ideal (hollow) and experimental (filled) values. Experimental heavy output probability are shown on the legend. Median probability is plotted as red dashed line.
ta_in: தனிப்பட்ட சோதனைகளைத் திட்டமிட, மெத்: `qiskit.ignis.verification.quantum_volume.QVFitter.plot_qv_trial` முறை சேர்க்கப்பட்டுள்ளது, கிஸ்கிட் டெர்ராவிலிருந்து: மெத்:` qiskit.visualization.plot_histogram` முறையை மேம்படுத்துகிறது. சிறந்த (வெற்று) மற்றும் சோதனை (நிரப்பப்பட்ட) மதிப்புகளுக்கான பிட்ஸ்ட்ரிங் எண்ணிக்கைகள் ஒன்றுடன் ஒன்று ஹிஸ்டோகிராம்களாக திட்டமிடப்பட்டுள்ளன. புராணத்தில் சோதனை கனமான வெளியீட்டு நிகழ்தகவு காட்டப்பட்டுள்ளது. சராசரி நிகழ்தகவு சிவப்பு கோடு கோட்டாக திட்டமிடப்பட்டுள்ளது.

source: The deprecated support for running qiskit-ignis with Python 3.5 has been removed. To use qiskit-ignis >=0.5.0 you will now need at least Python 3.6. If you are using Python 3.5 the last version which will work is qiskit-ignis 0.4.x.
ta_in: Python 3.5 உடன் Qiskit டெர்ராவை இயக்குவதற்கான ஆதரவு நீக்கப்பட்டது. இந்த வெளியீட்டில் இருந்து Qiskit டெர்ராவைப் பயன்படுத்த நீங்கள் இப்போது குறைந்தபட்சம் Python 3.6 ஐப் பயன்படுத்த வேண்டும். நீங்கள் Python 3.5 ஐப் பயன்படுத்துகிறீர்கள் என்றால், வேலை செய்யும் கடைசி பதிப்பு Qiskit டெர்ரா 0.15.2 ஆகும்.

source: Fixing a bug in the class :class:`qiskit.ignis.verification.randomized_benchmarking.CNOTDihedral` for elements with more than 5 quits.
ta_in: வகுப்பில் ஒரு பிழையை சரிசெய்தல்: வர்க்கம்: 5 க்கும் மேற்பட்ட விலகல்களைக் கொண்ட உறுப்புகளுக்கு `qiskit.ignis.verification.randomized_benchmarking.CNOTDihedral`.

source: Fix the confidence level threshold for :meth:`qiskit.ignis.verification.quantum_volume.QVFitter.qv_success` to 0.977 corresponding to z = 2 as defined by the QV paper Algorithm 1.
ta_in: இதற்கான நம்பிக்கை நிலை வாசலை சரிசெய்யவும்: மெத்: `qiskit.ignis.verification.quantum_volume.QVFitter.qv_success` ஐ 0.977 க்கு z = 2 உடன் ஒத்த QV காகித அல்காரிதம் 1 ஆல் வரையறுக்கப்பட்டுள்ளது.

source: Fix a bug at :func:`qiskit.ignis.verification.randomized_benchmarking.randomized_benchmarking_seq` which caused all the subsystems with the same size in the given rb_pattern to have the same gates when a 'rand_seed' parameter was given to the function.
ta_in: ஒரு பிழையைச் சரிசெய்யவும்: func: `qiskit.ignis.verification.randomized_benchmarking.randomized_benchmarking_seq`, கொடுக்கப்பட்ட rb_pattern இல் ஒரே அளவிலான அனைத்து துணை அமைப்புகளும் ஒரு 'rand_seed' அளவுரு செயல்பாட்டிற்கு வழங்கப்பட்டபோது ஒரே வாயில்களைக் கொண்டிருக்கின்றன.

source: This release introduces an interface for running the available methods for Bosonic problems. In particular we introduced a full interface for running vibronic structure calculations.
ta_in: இந்த விடுதலை போசிக் பிரச்சினைகளுக்கான கிடைக்கப்பெற்ற முறைகளை இயக்குவதற்கு ஒரு இடைமுகத்தை அறிமுகம் செய்கிறது. குறிப்பாக நாம் ஒரு முழு இடைமுகத்தை இயங்குவதற்கு ஒரு முழு இடைமுகத்தை அறிமுகப்படுத்தினோம்.

source: This release introduces an interface for excited states calculations. It is now easier for the user to create a general excited states calculation. This calculation is based on a Driver which provides the relevant information about the molecule, a Transformation which provides the information about the mapping of the problem into a qubit Hamiltonian, and finally a Solver. The Solver is the specific way which the excited states calculation is done (the algorithm). This structure follows the one of the ground state calculations. The results are modified to take lists of expectation values instead of a single one. The QEOM and NumpyEigensolver are adapted to the new structure. A factory is introduced to run a numpy eigensolver with a specific filter (to target states of specific symmetries).
ta_in: ஆரம்பிக்கப்பட்ட மாநிலங்களுக்கான ஒரு இடைமுகம் வேதியியல் கூறுகளுக்கு சேர்க்கப்பட்டுள்ளது. பொதுவான ஆயுதமான மாநிலங்களின் கணிப்பை உருவாக்குவதற்கு பயனருக்கு இப்போது எளிமையானதாகும். இந்த கணக்கெடுப்பு ` ` Driver ` ` இது மூலக்கூறுகளைப் பற்றிய ஒத்திசைவு தகவல்களை வழங்குகிறது, ` ` மாற்றம் ` ` பிரச்சினை பற்றிய தகவல்களை ஒரு விரைவான ஹாமிலோனியன் மற்றும் இறுதியாக ஒரு சோழர் பற்றிய தகவல்களை வழங்குகிறது. The Solver is the specific way which the उत्साहित states ගණනය is done (the algorithm). இந்த அமைப்பு தரமான மாநில கணக்கெடுப்பின் ஒன்றை பின்பற்றுகிறது. ஒரு ஒற்றை பதிலாக எதிர்பார்ப்பு மதிப்புகளின் பட்டியல்களை எடுப்பதற்கு முடிவுகள் மாற்றப்படுகின்றன. ` ` QEOM ` ` மற்றும் ` NumpyEigensolver ` ` புதிய கட்டமைப்புக்கு ஏற்றுக்கொள்ளப்படுகின்றன. ஒரு தொழிற்சாலையை ஒரு குறிப்பிட்ட வடிகட்டி (குறிப்பிட்ட சிம்மடிகளின் இலக்கு மாநிலங்கள்) கொண்டு ஒரு விண்மையான eigensolver இயக்குவதற்கு அறிமுகப்படுத்தப்படுகிறது.

source: VQE expectation computation with Aer qasm_simulator now defaults to a computation that has the expected shot noise behavior.
ta_in: Aer qasm_ simulator யுடன் VQE எதிர்பார்ப்பு கணக்கீடு இப்போது எதிர்பார்க்கப்பட்ட சுழல் நடத்தை கணக்கிடும்.

source: Introduced an option `warm_start` that should be used when tuning other options does not help. When this option is enabled, a relaxed problem (all variables are continuous) is solved first and the solution is used to initialize the state of the optimizer before it starts the iterative process in the `solve` method.
ta_in: `சூடான_ஸ்டார்ட்` என்ற விருப்பத்தை அறிமுகப்படுத்தியது, பிற விருப்பங்களை சரிசெய்யும்போது பயன்படுத்தப்படாது. இந்த விருப்பம் இயக்கப்பட்டால், ஒரு தளர்வான சிக்கல் (அனைத்து மாறிகள் தொடர்ச்சியாக இருக்கும்) முதலில் தீர்க்கப்படும் மற்றும் தீர்வு `தீர்வு` முறையில் செயல்பாட்டு செயல்முறையைத் தொடங்குவதற்கு முன்பு தேர்வாளரின் நிலையைத் தொடங்க பயன்படுத்தப்படுகிறது.

source: The amplitude estimation algorithms now use ``QuantumCircuit`` objects as inputs to specify the A- and Q operators. This change goes along with the introduction of the ``GroverOperator`` in the circuit library, which allows an intuitive and fast construction of different Q operators. For example, a Bernoulli-experiment can now be constructed as
ta_in: வீச்சு மதிப்பீட்டு வழிமுறைகள் இப்போது A- மற்றும் Q ஆபரேட்டர்களைக் குறிப்பிட உள்ளீடுகளாக `` குவாண்டம் சிர்குட்`` பொருள்களைப் பயன்படுத்துகின்றன. இந்த மாற்றம் சுற்று நூலகத்தில் `` க்ரோவர் ஆபரேட்டர்`` அறிமுகப்படுத்தப்படுவதோடு செல்கிறது, இது வெவ்வேறு கியூ ஆபரேட்டர்களின் உள்ளுணர்வு மற்றும் விரைவான கட்டுமானத்தை அனுமதிக்கிறது. எடுத்துக்காட்டாக, ஒரு பெர்ன lli லி-பரிசோதனையை இப்போது கட்டமைக்க முடியும்

source: Add the possibility to compute Conditional Value at Risk (CVaR) expectation values.
ta_in: நிபந்தனை (CVR) எதிர்பார்ப்பு மதிப்புகளின் கூட்டு மதிப்பை ஒழுங்கும்படி சேர்க்கவும்.

source: Given a diagonal observable H, often corresponding to the objective function of an optimization problem, we are often not as interested in minimizing the average energy of our observed measurements. In this context, we are satisfied if at least some of our measurements achieve low energy. (Note that this is emphatically not the case for chemistry problems).
ta_in: ஒரு உகப்பாக்கம் சிக்கலின் புறநிலை செயல்பாட்டுக்கு ஒத்த ஒரு மூலைவிட்ட அவதானிக்கக்கூடிய எச் கொடுக்கப்பட்டால், நாம் கவனித்த அளவீடுகளின் சராசரி ஆற்றலைக் குறைப்பதில் நாங்கள் பெரும்பாலும் ஆர்வம் காட்டவில்லை. இந்த சூழலில், எங்கள் அளவீடுகளில் சில குறைந்த ஆற்றலை அடைந்தால் நாங்கள் திருப்தி அடைகிறோம். (வேதியியல் சிக்கல்களுக்கு இது உறுதியாக இல்லை என்பதை நினைவில் கொள்க).
