Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: Improves the performance of the `"statevector"` simulation method of the :class:`qiskit.providers.aer.QasmSimulator` and :class:`qiskit.providers.aer.StatevectorSimulator` by using SIMD intrinsics on systems that support the AVX2 instruction set. AVX2 support is automatically detected and enabled at runtime.
ta_in: வகுப்பு: `qiskit.providers.aer.QasmSimulator` மற்றும்: வகுப்பு:` qiskit.providers.aer.StatevectorSimulator` இன் `" ஸ்டேட்வெக்டர் "` உருவகப்படுத்துதல் முறையின் செயல்திறனை மேம்படுத்துகிறது அமை. AVX2 ஆதரவு தானாகவே கண்டறியப்பட்டு இயக்க நேரத்தில் இயக்கப்படும்.

source: Changes the build system to use the `Conan package manager <https://conan.io/>`__. This tool will handle most of the dependencies needed by the C++ source code. Internet connection may be needed for the first build or when dependencies are added or updated, in order to download the required packages if they are not in your Conan local repository.
ta_in: ` Conan தொகுப்பு மேலாளர் <https://conan.io/>` _. இந்த கருவி C++ மூல குறியீட்டால் தேவைப்படும் சார்புகளை கையாளும். இணைய இணைப்பு முதலாவது கட்டமைப்புக்கு தேவையிட இருக்கலாம் அல்லது சார்புகள் சேர்க்கப்பட்டோ அல்லது புதுப்பிக்கப்படும் போது, தேவையான தொகுப்புகளை இறக்குமதி செய்யவும்.

source: When building the standalone version of qiskit-aer you must install conan first with:
ta_in: Qiskit-aer யின் நிலையான பதிப்பை கட்டும் போது நீங்கள் முதலில் கானன் நிறுவவேண்டும்:

source: Changes how transpilation passes are handled in the C++ Controller classes so that each pass must be explicitly called. This allows for greater customization on when each pass should be called, and with what parameters. In particular this enables setting different parameters for the gate fusion optimization pass depending on the QasmController simulation method.
ta_in: சி ++ கன்ட்ரோலர் வகுப்புகளில் டிரான்ஸ்பிளேஷன் பாஸ்கள் எவ்வாறு கையாளப்படுகின்றன என்பதை மாற்றுகிறது, இதனால் ஒவ்வொரு பாஸையும் வெளிப்படையாக அழைக்க வேண்டும். ஒவ்வொரு பாஸையும் எப்போது அழைக்க வேண்டும், எந்த அளவுருக்களுடன் இது அதிக தனிப்பயனாக்கத்தை அனுமதிக்கிறது. குறிப்பாக இது QasmController உருவகப்படுத்துதல் முறையைப் பொறுத்து கேட் இணைவு தேர்வுமுறை பாஸுக்கு வெவ்வேறு அளவுருக்களை அமைக்க உதவுகிறது.

source: Add ``gate_length_units`` kwarg to :meth:`qiskit.providers.aer.noise.NoiseModel.from_device` for specifying custom ``gate_lengths`` in the device noise model function to handle unit conversions for internal code.
ta_in: உள் குறியீட்டிற்கான அலகு மாற்றங்களைக் கையாள சாதன noise model செயல்பாட்டில் தனிப்பயன் `` gate_lengths`` என்பதைக் குறிப்பிடுவதற்கு `` gate_length_units`` குவார்க்கை இங்கு சேர்க்கவும்:meth: `qiskit.providers.aer.noise.NoiseModel.from_device`.

source: Add Controlled-Y ("cy") gate to the Stabilizer simulator methods supported gateset.
ta_in: கட்டுப்படுத்தல்-Y ("cy") சேர் Stabilizer simulator முறைகளுக்கு வாய்ப்பு gateset ஆதரிக்கப்பட்டது.

source: For Aer's backend the jsonschema validation of input qobj objects from terra is now opt-in instead of being enabled by default. If you want to enable jsonschema validation of qobj set the ``validate`` kwarg on the :meth:`qiskit.providers.aer.QasmSimualtor.run` method for the backend object to ``True``.
ta_in: ஏரின் பின்தளத்தில், டெர்ராவிலிருந்து உள்ளீட்டு qobj பொருள்களின் jsonschema சரிபார்ப்பு இப்போது இயல்புநிலையாக செயல்படுத்தப்படுவதற்கு பதிலாக தேர்வுசெய்யப்பட்டுள்ளது. Qobj இன் jsonschema சரிபார்ப்பை நீங்கள் இயக்க விரும்பினால், பின்தளத்தில் உள்ள பொருளின் ``validation'` க்கு ''True" குவார்க்கை அமைக்க :meth: `qiskit.providers.aer.QasmSimualtor.run` முறையை அமைக்கவும்.

source: Adds an OpSet object to the base simulator State class to allow easier validation of instructions, gates, and snapshots supported by simulators.
ta_in: சிமுலேட்டர்களால் ஆதரிக்கப்படும் அறிவுறுத்தல்கள், கேட்கள் மற்றும் ஸ்னாப்ஷாட்களை எளிதாக சரிபார்க்க அனுமதிக்க அடிப்படை சிமுலேட்டருக்கு ஸ்டேட் கிளாஸில் ஒரு ஒப்செட் பொருளைச் சேர்க்கிறது.

source: Refactor OpSet class. Moved OpSet to separate header file and add ``contains`` and ``difference`` methods based on ``std::set::contains`` and ``std::algorithm::set_difference``. These replace the removed invalid and validate instructions from OpSet, but with the order reversed. It returns a list of other ops not in current opset rather than opset instructions not in the other.
ta_in: Refactor OpSet வகுப்பு. தலைப்பு கோப்பை பிரிக்க ஒப்செட்டை நகர்த்தி, `` std::set:: contains`` மற்றும் `` std::algorithm:: set_difference`` ஐ அடிப்படையாகக் கொண்ட `` contains`` மற்றும் `` difference`` முறைகளைச் சேர்க்கவும். இவை ஒப்செட்டிலிருந்து அகற்றப்பட்ட தவறான மற்றும் வழிமுறைகளை சரிபார்க்கின்றன, ஆனால் ஒழுங்கு தலைகீழாக மாற்றப்படுகிறது. இது மற்ற ஆப்சுகளின் பட்டியலை தற்போதைய ஆப்செட்டில் இல்லாததை விட மற்றொன்று இல்லை.

source: Improves how measurement sampling optimization is checked. The expensive part of this operation is now done once during circuit construction where rather than multiple times during simulation for when checking memory requirements, simulation method, and final execution.
ta_in: அளவீட்டு மாதிரி தேர்வுமுறை எவ்வாறு சரிபார்க்கப்படுகிறது என்பதை மேம்படுத்துகிறது. இந்த செயல்பாட்டின் விலையுயர்ந்த பகுதி இப்போது ஒரு முறை சுற்று கட்டுமானத்தின் போது செய்யப்படுகிறது, அங்கு நினைவக தேவைகள், உருவகப்படுத்துதல் முறை மற்றும் இறுதி செயலாக்கத்தை சரிபார்க்கும்போது உருவகப்படுத்துதலின் போது பல முறை அல்ல.

source: Remove "extended_stabilizer" from the automatically selected simulation methods. This is needed as the extended stabilizer method is not exact and may give incorrect results for certain circuits unless the user knows how to optimize its configuration parameters.
ta_in: தானாக தேர்ந்தெடுக்கப்பட்ட உருவகப்படுத்துதல் முறைகளிலிருந்து "நீட்டிக்கப்பட்ட_நிலையாக்கி" ஐ அகற்று. நீட்டிக்கப்பட்ட நிலைப்படுத்தி முறை துல்லியமாக இல்லாததால் இது தேவைப்படுகிறது மற்றும் அதன் உள்ளமைவு அளவுருக்களை எவ்வாறு மேம்படுத்துவது என்பது பயனருக்குத் தெரியாவிட்டால் சில சுற்றுகளுக்கு தவறான முடிவுகளைத் தரக்கூடும்.

source: The automatic method now only selects from "stabilizer", "density_matrix", and "statevector" methods. If a non-Clifford circuit that is too large for the statevector method is executed an exception will be raised suggesting you could try explicitly using the "extended_stabilizer" or "matrix_product_state" methods instead.
ta_in: தானியங்கி முறை இப்போது "நிலைப்படுத்தி", "அடர்த்தி_மாட்ரிக்ஸ்" மற்றும் "ஸ்டேட்வெக்டர்" முறைகளிலிருந்து மட்டுமே தேர்ந்தெடுக்கிறது. ஸ்டேட்வெக்டர் முறைக்கு மிகப் பெரியதாக இருக்கும் கிளிஃபோர்ட் அல்லாத சுற்று செயல்படுத்தப்பட்டால், அதற்கு பதிலாக "நீட்டிக்கப்பட்ட_நிலையாக்கி" அல்லது "மேட்ரிக்ஸ்_பிரடெக்ட்_ஸ்டேட்" முறைகளைப் பயன்படுத்தி வெளிப்படையாக முயற்சி செய்யலாம் என்று பரிந்துரைக்கும் விதிவிலக்கு எழுப்பப்படும்.

source: Disables gate fusion for the matrix product state simulation method as this was causing issues with incorrect results being returned in some cases.
ta_in: மேட்ரிக்ஸ் தயாரிப்பு நிலை உருவகப்படுத்துதல் முறைக்கான கேட் இணைவை முடக்குகிறது, ஏனெனில் இது சில சந்தர்ப்பங்களில் தவறான முடிவுகள் வழங்கப்படுவதில் சிக்கல்களை ஏற்படுத்துகிறது.

source: Fixes a bug causing incorrect channel evaluation in the :class:`qiskit.providers.aer.PulseSimulator`.
ta_in: :class:`qiskit.providers.aer.PulseSimulator` - ல் தவறான சேனல் மதிப்பீட்டை ஏற்படுத்தும் பிழையை சரிசெய்கிறது.

source: Fixes several minor bugs for Hamiltonian parsing edge cases in the :class:`qiskit.providers.aer.pulse.system_models.hamiltonian_model.HamiltonianModel` class.
ta_in: வகுப்பில் ஹாமில்டோனிய பாகுபடுத்தும் விளிம்பு வழக்குகளுக்கு பல சிறிய பிழைகளை சரிசெய்கிறது :class:`qiskit.providers.aer.pulse.system_models.hamiltonian_model.HamiltonianModel` வகுப்பு.

source: The main change made in this release is a refactor of the Randomized Benchmarking code to integrate the updated Clifford class :class:`qiskit.quantum_info.Clifford` from Terra and to improve the CNOT-Dihedral class.
ta_in: இந்த வெளியீட்டில் செய்யப்பட்ட முக்கிய மாற்றம், புதுப்பிக்கப்பட்ட கிளிஃபோர்ட் வகுப்பை ஒருங்கிணைக்க சீரற்ற தரப்படுத்தல் குறியீட்டின் மறுசீரமைப்பாகும்: வகுப்பு: `கிஸ்கிட். டெர்ராவிலிருந்து குவாண்டம்_இன்ஃபோ.கிளிஃபோர்ட்` மற்றும் சி.என்.ஓ.டி-டைஹெட்ரல் வகுப்பை மேம்படுத்த.

source: The :func:`qiskit.ignis.verification.randomized_benchmarking.randomized_benchmarking_seq` function was refactored to use the updated Clifford class :class:`~qiskit.quantum_info.Clifford`, to allow efficient Randomized Benchmarking (RB) on Clifford sequences with more than 2 qubits. In addition, the code of the CNOT-Dihedral class :class:`qiskit.ignis.verification.randomized_benchmarking.CNOTDihedral` was refactored to make it more efficient, by using numpy arrays, as well not using pre-generated pickle files storing all the 2-qubit group elements. The :func:`qiskit.ignis.verification.randomized_benchmarking.randomized_benchmarking_seq` function has a new kwarg ``rand_seed`` which can be used to specify a seed for the random number generator used to generate the RB circuits. This can be useful for having a reproducible circuit.
ta_in: கிளிஃபோர்டு காட்சிகளைக் காட்டிலும் திறமையான ரேண்டமைஸ் பெஞ்ச்மார்க்கிங் (ஆர்.பி. 2 குவிட்ஸ். கூடுதலாக, சி.என்.ஓ.டி. 2-குவிட் குழு கூறுகள். : பியுன்க் : `கிஸ்கிட். பற்றவைப்பு. சரிபார்ப்பு. சீரற்ற _ பெஞ்ச்மார்க்கிங்.ராண்டமைஸ்_பெஞ்ச்மார்க்கிங்_செக்` செயல்பாட்டில் ஒரு புதிய குவார்க் உள்ளது` `ரேண்ட் _ சீட் ``, இது ஆர்பி சர்க்ய்ட் உருவாக்கப் பயன்படுத்தப்படும் சீரற்ற எண் ஜெனரேட்டருக்கு ஒரு விதையைக் குறிப்பிடப் பயன்படுகிறது. இனப்பெருக்கம் செய்யக்கூடிய சுற்றுக்கு இது பயனுள்ளதாக இருக்கும்.

source: The :func:`qiskit.ignis.verification.qv_circuits` function has a new kwarg ``seed`` which can be used to specify a seed for the random number generator used to generate the Quantum Volume circuits. This can be useful for having a reproducible circuit.
ta_in: :func: `qiskit.ignis.verification.qv_circuits` செயல்பாட்டில் ஒரு புதிய குவார்க்`'seed`` உள்ளது, இது குவாண்டம் தொகுதி சுற்றுகளை உருவாக்க பயன்படும் சீரற்ற எண் ஜெனரேட்டருக்கு ஒரு ஸீடைக் குறிப்பிட பயன்படுகிறது. மீண்டும் செய்யக்கூடிய சுற்றுக்கு இது பயனுள்ளதாக இருக்கும்.

source: The :func:`qiskit.ignis.verification.randomized_benchmarking.randomized_benchmarking_seq` function is now using the updated Clifford class :class:`~qiskit.quantum_info.Clifford` and the updated CNOT-Dihedral class :class:`qiskit.ignis.verification.randomized_benchmarking.CNOTDihedral` to construct its output instead of using pre-generated group tables for the Clifford and CNOT-Dihedral group elements, which were stored in pickle files. This may result in subtle differences from the output from the previous version.
ta_in: :func:`qiskit.ignis.verification.randomized_benchmarking.randomized_benchmarking_seq` செயல்பாடு இப்போது புதுப்பிக்கப்பட்ட கிளிஃபோர்ட் வகுப்பைப் பயன்படுத்துகிறது:class:`~ qiskit.quantum_info.Clifford` மற்றும் புதுப்பிக்கப்பட்ட CNOT-Dihedral class:class: `qiskit.ignis.veris. .randomized_benchmarking.CNOTDihedral` அதன் வெளியீட்டை கட்டமைக்க கிளிஃபோர்ட் மற்றும் சி.என்.ஓ.டி-டைஹெட்ரல் குழு கூறுகளுக்கு முன் உருவாக்கிய குழு அட்டவணைகளைப் பயன்படுத்துவதற்குப் பதிலாக, ஊறுகாய் கோப்புகளில் சேமிக்கப்பட்டன. இது முந்தைய பதிப்பிலிருந்து வெளியீட்டிலிருந்து நுட்பமான வேறுபாடுகளை ஏற்படுத்தக்கூடும்.

source: A new requirement `scikit-learn <https://scikit-learn.org/stable/>`__ has been added to the requirements list. This dependency was added in the 0.3.0 release but wasn't properly exposed as a dependency in that release. This would lead to an ``ImportError`` if the :mod:`qiskit.ignis.measurement.discriminator.iq_discriminators` module was imported. This is now correctly listed as a dependency so that ``scikit-learn`` will be installed with qiskit-ignis.
ta_in: தேவைகள் பட்டியலில் ஒரு புதிய தேவை `scikit-learn <https://scikit-learn.org/stable/>` __ சேர்க்கப்பட்டுள்ளது. இந்த சார்பு 0.3.0 வெளியீட்டில் சேர்க்கப்பட்டது, ஆனால் அந்த வெளியீட்டில் ஒரு சார்புநிலையாக சரியாக வெளிப்படுத்தப்படவில்லை.:mod: `qiskit.ignis.measurement.discriminator.iq_discriminators` தொகுதி இறக்குமதி செய்யப்பட்டால் இது` `இறக்குமதி பிழை``க்கு வழிவகுக்கும். இது இப்போது ஒரு சார்புநிலையாக சரியாக பட்டியலிடப்பட்டுள்ளது, இதனால் `ஸ்கிகிட்-லர்ன்`` கிஸ்கிட்-இக்னிஸுடன் நிறுவப்படும்.

source: The :func:`qiskit.ignis.verification.qv_circuits` function is now using the circuit library class :class:`~qiskit.circuit.library.QuantumVolume` to construct its output instead of building the circuit from scratch. This may result in subtle differences from the output from the previous version.
ta_in: :func: `qiskit.ignis.verification.qv_circuits` செயல்பாடு இப்போது சுற்று நூலக வகுப்பைப் பயன்படுத்துகிறது:class:` q qiskit.circuit.library.QuantumVolume` புதிதாக சுற்றுவட்டத்தை உருவாக்குவதற்குப் பதிலாக அதன் வெளியீட்டைக் கட்டமைக்க. இது முந்தைய பதிப்பிலிருந்து வெளியீட்டிலிருந்து நுட்பமான வேறுபாடுகளை ஏற்படுத்தக்கூடும்.

source: Tomography fitters can now also get list of `Result` objects instead of a single `Result` as requested in `issue #320 <https://github.com/Qiskit/qiskit-ignis/issues/320/>`_.
ta_in: `வெளியீடு # 320 <https://github.com/Qiskit/qiskit-ignis/issues/320/>` _ இல் கோரப்பட்டபடி டோமோகிராபி பொருத்திகள் இப்போது ஒரு `முடிவு` க்கு பதிலாக` முடிவு` பொருள்களின் பட்டியலையும் பெறலாம்.

source: The kwarg ``interleaved_gates`` for the :func:`qiskit.ignis.verification.randomized_benchmarking.randomized_benchmarking_seq` function has been deprecated and will be removed in a future release. It is superseded by ``interleaved_elem``. The helper functions :class:`qiskit.ignis.verification.randomized_benchmarking.BasicUtils`, :class:`qiskit.ignis.verification.randomized_benchmarking.CliffordUtils` and :class:`qiskit.ignis.verification.randomized_benchmarking.DihedralUtils` were deprecated. These classes are superseded by :class:`qiskit.ignis.verification.randomized_benchmarking.RBgroup` that handles the group operations needed for RB. The class :class:`qiskit.ignis.verification.randomized_benchmarking.Clifford` is superseded by :class:`~qiskit.quantum_info.Clifford`.
ta_in: :func: `qiskit.ignis.verification.randomized_benchmarking.randomized_benchmarking_seq` செயல்பாட்டிற்கான குவார்க்``interleaved_gates`` நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். இது ``interleaved_elem`` ஆல் மீறப்படுகிறது. உதவியாளர் செயல்பாடுகள்:class: `qiskit.ignis.verification.randomized_benchmarking.BasicUtils` ,:class:` qiskit.ignis.verification.randomized_benchmarking.CliffordUtils` மற்றும்:class: `qiskit.ignis.verification.randomized_benchralcated. இந்த வகுப்புகள் பின்வருமாறு:class: `qiskit.ignis.verification.randomized_benchmarking.RBgroup` இது RB க்குத் தேவையான குழு செயல்பாடுகளை கையாளுகிறது. class:class: `qiskit.ignis.verification.randomized_benchmarking.Clifford` ஐ மீறுகிறது:class:` ~ qiskit.quantum_info.Clifford`.

source: The kwargs ``qr`` and ``cr`` for the :func:`qiskit.ignis.verification.qv_circuits` function have been deprecated and will be removed in a future release. These kwargs were documented as being used for specifying a :class:`qiskit.circuit.QuantumRegister` and :class:`qiskit.circuit.ClassicalRegister` to use in the generated Quantum Volume circuits instead of creating new ones. However, the parameters were never actually respected and a new Register would always be created regardless of whether they were set or not. This behavior is unchanged and these kwargs still do not have any effect, but are being deprecated prior to removal to avoid a breaking change for users who may have been setting either.
ta_in: ஃபங்க்: `qiskit.ignis.verification.qv_circuits` செயல்பாட்டிற்கான குவாஜ்கள்` `qr`` மற்றும்` `cr`` ஆகியவை நீக்கப்பட்டன, அவை எதிர்கால வெளியீட்டில் அகற்றப்படும். இந்த குவார்க்குகள் ஒரு: வகுப்பு : `qiskit.circuit.QuantumRegister` மற்றும்: class:` qiskit.circuit.ClassicalRegister` ஐக் குறிப்பிடுவதற்குப் பயன்படுத்தப்படுவதாக ஆவணப்படுத்தப்பட்டுள்ளன. இருப்பினும், பரமீடேர்ஸ் உண்மையில் ஒருபோதும் மதிக்கப்படவில்லை மற்றும் ஒரு புதிய பதிவு எப்போதும் உருவாக்கப்படுமா என்பதைப் பொருட்படுத்தாமல் உருவாக்கப்படும்.

source: Support for passing in subsets of qubits as a list in the ``qubit_lists`` parameter for the :func:`qiskit.ignis.verification.qv_circuits` function has been deprecated and will removed in a future release. In the past this was used to specify a layout to run the circuit on a device. In other words if you had a 5 qubit device and wanted to run a 2 qubit QV circuit on qubits 1, 3, and 4 of that device. You would pass in ``[1, 3, 4]`` as one of the lists in ``qubit_lists``, which would generate a 5 qubit virtual circuit and have qv applied to qubits 1, 3, and 4 in that virtual circuit. However, this functionality is not necessary and overlaps with the concept of ``initial_layout`` in the transpiler and whether a circuit has been embedded with a layout set. Moving forward instead you should just run :func:`~qiskit.compiler.transpile` or :func:`~qiskit.execute.execute` with initial layout set to do this. For example, running the above example would become::
ta_in: :func:` qiskit.ignis.verification.qv_circuits ` செயல்பாடு நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். கடந்த காலத்தில் இது ஒரு சாதனத்தில் சர்குய்ட் இயக்க ஒரு பில்டபோர்ம்மை குறிப்பிட பயன்படுத்தப்பட்டது .வேறு வார்த்தைகளில் கூறுவதானால் ஒரு 5 குவிட் சாதனை கொண்டிருக்கும் என்றால், 1, 3, மற்றும் 4 என்று சாதனத்தின் ஒரு 2 குவிட் QV சுற்றுப்பாதை இயக்க விரும்பினால்.நீங்கள் கண்டிப்பாக பாஸ் செய்வது ` ` [1, 3, 4] ` உள்ள பட்டியல்களில் ஒன்றாக ` qubit_lists ` `, இது 5 குவிட் மெய்நிகர் சுற்றுவட்டத்தை உருவாக்கும் மற்றும் அந்த மெய்நிகர் சுற்றுவட்டத்தில் 1, 3, மற்றும் 4 குவிட்டுகளுக்கு qv பயன்படுத்தப்படும்it. எனினும், இந்த செயல்திறன் தேவையிட்டது மற்றும் ` ` துவக்க அமைப்பு ` ` எனும் கருத்துக்களுடன் கூடுதலாக மற்றும் ஒரு சுற்றுச்சூழல் அமைப்பு அமைப்பை உடையது. முன் நகர்த்துவதற்கு பதிலாக :func:` ~ qiskit.compiler.transpile ` or :func:` ~ qiskit.execute.execute ` இதைச் செய்ய ஆரம்ப லயூட் அமைக்கப்பட்டுள்ளது. எடுத்துக்காட்டாக, மேலே இயங்கும் உதாரணம்::

source: Fix a bug of the position of measurement pulses inserted by py:func:`qiskit.ignis.characterization.calibrations.pulse_schedules.drag_schedules`. Fixes `#465 <https://github.com/Qiskit/qiskit-ignis/issues/465>`__
ta_in: பை செருகப்பட்ட அளவீட்டு பருப்புகளின் நிலையின் பிழையை சரிசெய்யவும்:func: `qiskit.ignis.characterization.calibrations.pulse_schedules.drag_schedules`. `# 465 <https://github.com/Qiskit/qiskit-ignis/issues/465>` __

source: Removed soft dependency on CPLEX in ADMMOptimizer. Now default optimizers used by ADMMOptimizer are MinimumEigenOptimizer for QUBO problems and SlsqpOptimizer as a continuous optimizer. You can still use CplexOptimizer as an optimizer for ADMMOptimizer, but it should be set explicitly.
ta_in: ADMMOptimizer இல் CPLEX இல் மென்மையான சார்பாக நீக்கப்பட்டது. இப்போது பயன்படும் முன்னிருப்பு ஒப்பீட்டாளர்கள் KUBO பிரச்சினைகள் மற்றும் SlsqpOptimizer) ஒரு தொடர்ச்சியான ஒப்பீட்டாளராகப் பயன்படுத்தப்படுகிறது. நீங்கள் இன்னும் CplexOptimizer பயன்படுத்த ADMMOptimizer க்கு ஒரு ஒப்பிடுக்க முடியும், ஆனால் அது கண்டிப்பாக அமைக்க வேண்டும்.

source: New Yahoo! finance provider created.
ta_in: புதிய யாஹூ! நிதி வழங்குபவர் உருவாக்கப்பட்டது.

source: Introduced ``QuadraticProgramConverter`` which is an abstract class for converters. Added ``convert``/``interpret`` methods for converters instead of ``encode``/``decode``. Added ``to_ising`` and ``from_ising`` to ``QuadraticProgram`` class. Moved all parameters from ``convert`` to constructor except ``name``. Created setter/getter for converter parameters. Added ``auto_define_penalty`` and ``interpret`` for``LinearEqualityToPenalty``. Now error messages of converters are more informative.
ta_in: அறிமுகப்படுத்தப்பட்டவர்களுக்கு `` குவாட்ராடிக் புரோகிராம் கன்வெர்ட்டர்`` அறிமுகப்படுத்தப்பட்டது. `` குறியாக்கம்`` / `` டிகோட்`` என்பதற்கு பதிலாக மாற்றிகள் மாற்றுவதற்கான `` மாற்ற`` / `` விளக்கம்`` முறைகள் சேர்க்கப்பட்டன. `` To_ising`` மற்றும் `` from_ising```` குவாட்ராடிக் புரோகிராம்`` வகுப்பில் சேர்க்கப்பட்டது. `` பெயர்`` தவிர அனைத்து அளவுருக்களையும் `` மாற்ற`` இலிருந்து கட்டமைப்பாளருக்கு நகர்த்தியது. மாற்றி அளவுருக்களுக்கு செட்டர் / கெட்டர் உருவாக்கப்பட்டது. `` லைனர் எக்வாலிட்டி டோபெனால்டி`` க்கு `` ஆட்டோ_டெஃபைன்_பெனால்டி`` மற்றும் `` விளக்கம்`` ஆகியவை சேர்க்கப்பட்டன. இப்போது மாற்றிகளின் பிழை செய்திகள் மிகவும் தகவலறிந்தவை.

source: Added an SLSQP optimizer ``qiskit.optimization.algorithms.SlsqpOptimizer`` as a wrapper of the corresponding SciPy optimization method. This is a classical optimizer, does not depend on quantum algorithms and may be used as a replacement for ``CobylaOptimizer``.
ta_in: ஒரு SLSQP ஒப்பீட்டாளர் ` ` க்கு qiskit.optimization.algorithms.SlsqpOptimizer ` ` தொடர்புடைய SciPy தேர்வுமுறை முறையின் போர்வையாக.. இது ஒரு சாதாரண கிளாசிக்கல் ஆப்டிமைசர் ஒப்பீட்டாளர், குவாண்டம் அல்கோரிதம் மற்றும் ` ` Cobylaoptimizer ` ` க்கான மாற்றம் செய்ய பயன்படும்.

source: Cobyla optimizer has been modified to accommodate a multi start feature introduced in the SLSQP optimizer. By default, the optimizer does not run in the multi start mode.
ta_in: Cobyla optimizer என்பது SLSQP ஒப்பீட்டளவில் அறிமுகப்படுத்தப்பட்ட ஒரு பல ஆரம்ப அம்சங்களைக் கொண்டு மாற்றப்பட்டுள்ளது. இயல்பாக, ஆப்டிமிஸ்ர் பல தொடக்க பயன்முறையில் இயங்காது.

source: The ``SummedOp`` does a mathematically more correct check for equality, where expressions such as ``X + X == 2*X`` and ``X + Z == Z + X`` evaluate to ``True``.
ta_in: ``SummedOp`` என்பது சமத்துவத்திற்கான கணித ரீதியாக மிகவும் சரியான சோதனை செய்கிறது, அங்கு ``X + X == 2*X`` மற்றும் ``X + Z == Z + X`` போன்ற வெளிப்பாடுகள் `True' என்று மதிப்பிடுகின்றன.

source: The ``pprint_as_string`` method for :class:`qiskit.optimization.QuadraticProgram` has been deprecated and will be removed in a future release. Instead you should just run ``.pprint_as_string()`` on the output from :meth:`~qiskit.optimization.QuadraticProgram.to_docplex`
ta_in: இதற்கான `` pprint_as_string`` முறை: வகுப்பு: `qiskit.optimization.QuadraticProgram` நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக நீங்கள் வெளியீட்டில் `` .pprint_as_string () `` ஐ இயக்க வேண்டும்: மெத்: `~ qiskit.optimization.QuadraticProgram.to_docplex`

source: The ``prettyprint`` method for :class:`qiskit.optimization.QuadraticProgram` has been deprecated and will be removed in a future release. Instead you should just run ``.prettyprint()`` on the output from :meth:`~qiskit.optimization.QuadraticProgram.to_docplex`
ta_in: இதற்கான ``prettyprint`` முறை:class: `qiskit.optimization.QuadraticProgram` நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக நீங்கள் வெளியீட்டில் ``.prettyprint()`` ஐ இயக்க வேண்டும்:meth: `~ qiskit.optimization.QuadraticProgram.to_docplex`

source: Changed in python version 3.8: On macOS, the spawn start method is now the default. The fork start method should be considered unsafe as it can lead to crashes in subprocesses. However P_BFGS doesn't support spawn, so we revert to single process. Refer to `#1109 <https://github.com/Qiskit/qiskit-aqua/issues/1109>` for more details.
ta_in: பைதான் பதிப்பு 3.8 இல் மாற்றப்பட்டது: மேகோஸில், ஸ்பான் தொடக்க முறை இப்போது இயல்புநிலையாக உள்ளது. முட்கரண்டி தொடக்க முறை பாதுகாப்பற்றதாக கருதப்பட வேண்டும், ஏனெனில் இது துணை செயலாக்கங்களில் செயலிழக்க வழிவகுக்கும். இருப்பினும் P_BFGS ஸ்பானை ஆதரிக்கவில்லை, எனவே நாங்கள் ஒற்றை செயல்முறைக்கு திரும்புவோம். மேலும் விவரங்களுக்கு `# 1109 <https://github.com/Qiskit/qiskit-aqua/issues/1109>` ஐப் பார்க்கவும்.

source: Binding parameters in the ``CircuitStateFn`` did not copy the value of ``is_measurement`` and always set ``is_measurement=False``. This has been fixed.
ta_in: ``CircuitStateFn`` இல் உள்ள பிணைப்பு அளவுருக்கள் `` is_measurement`` இன் மதிப்பை நகலெடுக்கவில்லை, எப்போதும் `` is_measurement = False`` ஐ அமைக்கவும். இது சரி செய்யப்பட்டது.
