Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: Deprecate the ``CircuitFactory`` and derived types. The ``CircuitFactory`` has been introduced as temporary class when the ``QuantumCircuit`` missed some features necessary for applications in Aqua. Now that the circuit has all required functionality, the circuit factory can be removed. The replacements are shown in the following table.
ta_in: `` சர்க்யூட்ஃபாக்டரி`` மற்றும் பெறப்பட்ட வகைகளை நீக்கு. அக்வாவில் உள்ள பயன்பாடுகளுக்குத் தேவையான சில அம்சங்களை `` குவாண்டம் சர்க்யூட்`` தவறவிட்டபோது, ​​`` சர்க்யூட்ஃபாக்டரி`` தற்காலிக வகுப்பாக அறிமுகப்படுத்தப்பட்டுள்ளது. இப்போது சுற்றுக்கு தேவையான அனைத்து செயல்பாடுகளும் இருப்பதால், சுற்று தொழிற்சாலையை அகற்றலாம். மாற்றீடுகள் பின்வரும் அட்டவணையில் காட்டப்பட்டுள்ளன.

source: The ising convert classes :class:`qiskit.optimization.converters.QuadraticProgramToIsing` and :class:`qiskit.optimization.converters.IsingToQuadraticProgram` have been deprecated and will be removed in a future release. Instead the :class:`qiskit.optimization.QuadraticProgram` methods :meth:`~qiskit.optimization.QuadraticProgram.to_ising` and :meth:`~qiskit.optimization.QuadraticPrgraom.from_ising` should be used instead.
ta_in: ஐசிங் மாற்றும் வகுப்புகள்: வர்க்கம்: `qiskit.optimization.converters.QuadraticProgramToIsing` மற்றும்: class:` qiskit.optimization.converters.IsingToQuadraticProgram` நீக்கப்பட்டன, அவை எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக: வர்க்கம்: `qiskit.optimization.QuadraticProgram` முறைகள்: மெத்:` ~ qiskit.optimization.QuadraticProgram.to_ising` மற்றும்: meth: `~ qiskit.optimization.QuadraticPrgraom.from_ising` அதற்கு பதிலாக பயன்படுத்தப்பட வேண்டும்.

source: Deprecate the ``WeightedSumOperator`` which has been ported to the circuit library as ``WeightedAdder`` in ``qiskit.circuit.library``.
ta_in: ர்க்யூட் நூலகத்திற்கு `` வெயிட்அடர்`` என `` qiskit.circuit.library`` இல் போர்ட் செய்யப்பட்டுள்ள `` வெயிட்ஸம்ஆப்பரேட்டர்`` ஐ நீக்கவும்.

source: ``Core Hamiltonian`` class is deprecated in favor of the ``FermionicTransformation`` ``Chemistry Operator`` class is deprecated in favor of the ``tranformations`` ``minimum_eigen_solvers/vqe_adapt`` is also deprecated and moved as an implementation of the ground_state_solver interface ``applications/molecular_ground_state_energy`` is deprecated in favor of ``ground_state_solver``
ta_in: `` கோர் ஹாமில்டோனியன்`` வகுப்பு `` ஃபெர்மியோனிக் டிரான்ஸ்ஃபார்மேஷனுக்கு` ஆதரவாக நீக்கப்பட்டது, `` வேதியியல் ஆபரேட்டர்`` வகுப்பு `` டிரான்ஃபார்மேஷன்களுக்கு 'ஆதரவாக நீக்கப்பட்டது`` `குறைந்தபட்ச_இஜென்_சால்வர்கள் / வி. கே_அடாப்ட்`` ஆகியவையும் நீக்கப்பட்டு நகர்த்தப்படுகின்றன கிரவுண்ட்_ஸ்டேட்_சால்வர் இடைமுகத்தை செயல்படுத்துதல் `` பயன்பாடுகள் / மூலக்கூறு_ மைதானம்_ஸ்டேட்_எனர்ஜி`` `` கிரவுண்ட்_ஸ்டேட்_சால்வர்`` க்கு ஆதரவாக நீக்கப்பட்டது

source: ``Optimizer.SupportLevel`` nested enum is replaced by ``OptimizerSupportLevel`` and ``Optimizer.SupportLevel`` was removed. Use, for example, ``OptimizerSupportLevel.required`` instead of ``Optimizer.SupportLevel.required``.
ta_in: `` ஆப்டிமைசர். எடுத்துக்காட்டாக, `` Optimizer.SupportLevel.required`` க்கு பதிலாக `` OptimizerSupportLevel.required`` ஐப் பயன்படுத்தவும்.

source: Deprecate the ``UnivariateVariationalDistribution`` and ``MultivariateVariationalDistribution`` as input to the ``QuantumGenerator``. Instead, plain ``QuantumCircuit`` objects can be used.
ta_in: ``QunatumGenerator`` உள்ளீடாக `` UnivariateVariationalDistribution`` மற்றும் `` MultivariateVariationalDistribution`` ஆகியவற்றைக் குறைக்கவும். அதற்கு பதிலாக, வெற்று ``QuantumCircuit `` பொருட்களைப் பயன்படுத்தலாம்.

source: Ignored `fast` and `use_nx` options of `AbelianGrouper.group_subops` to be removed in the future release.
ta_in: எதிர்கால வெளியீட்டில் அகற்றப்பட வேண்டிய `அபேலியன் குரூப்பர்.குரூப்_சுபாப்ஸ்` இன்` வேகமான` மற்றும் `பயன்பாட்டு_என்எக்ஸ்` விருப்பங்கள் புறக்கணிக்கப்பட்டன.

source: GSLS optimizer class deprecated ``__init__`` parameter ``max_iter`` in favor of ``maxiter``. SPSA optimizer class deprecated ``__init__`` parameter ``max_trials`` in favor of ``maxiter``. optimize_svm function deprecated ``max_iters`` parameter in favor of ``maxiter``. ADMMParameters class deprecated ``__init__`` parameter ``max_iter`` in favor of ``maxiter``.
ta_in: ஜி. எஸ். எல். எஸ் உகப்பாக்கி வகுப்பு `` மேக்சிட்டருக்கு` ஆதரவாக `` __init__`` அளவுரு `` அதிகபட்சம்_அறிவு`` நீக்கப்பட்டது. எஸ். பி. எஸ். ஏ ஆப்டிமைசர் வகுப்பு `` மேக்சிட்டருக்கு` ஆதரவாக `` __init__`` அளவுரு `` அதிகபட்ச_விவரங்கள்`` நீக்கப்பட்டது. உகந்ததாக்கு_விஎம் செயல்பாடு `` அதிகபட்சம்`` க்கு ஆதரவாக `` அதிகபட்சம்_விளக்குகள்`` அளவுரு நீக்கப்பட்டது. ADMMParameters வகுப்பு `` அதிகபட்சம்`` க்கு ஆதரவாக `` __init__`` அளவுரு `` அதிகபட்சம்_அறிவு`` நீக்கப்பட்டது.

source: The UCCSD excitation list, comprising single and double excitations, was not being generated correctly when an active space was explicitly provided to UCSSD via the active_(un)occupied parameters.
ta_in: ஒற்றை மற்றும் இரட்டை உற்சாகங்களை உள்ளடக்கிய யு.சி.சி.எஸ்.டி கிளர்ச்சி பட்டியல், செயலில்_ (un) ஆக்கிரமிக்கப்பட்ட அளவுருக்கள் வழியாக யு.சி.எஸ்.எஸ்.டி.க்கு ஒரு செயலில் இடம் வெளிப்படையாக வழங்கப்பட்டபோது சரியாக உருவாக்கப்படவில்லை.

source: For the amplitude estimation algorithms, we define the number of oracle queries as number of times the Q operator/Grover operator is applied. This includes the number of shots. That factor has been included in MLAE and IQAE but was missing in the 'standard' QAE.
ta_in: அலைவீச்சு மதிப்பீட்டு வழிமுறைகளுக்கு, ஆரக்கிள் வினவல்களின் எண்ணிக்கையை Q ஆபரேட்டர் / க்ரோவர் ஆபரேட்டர் எத்தனை முறை பயன்படுத்தப்படுகிறது என்பதை வரையறுக்கிறோம். காட்சிகளின் எண்ணிக்கையும் இதில் அடங்கும். அந்த காரணி MLAE மற்றும் IQAE இல் சேர்க்கப்பட்டுள்ளது, ஆனால் 'நிலையான' QAE இல் இல்லை.

source: Fix CircuitSampler.convert, so that the ``is_measurement`` property is propagated to converted StateFns.
ta_in: CircuitSampler.convert ஐ சரிசெய்யவும், இதனால் `` is_measurement`` ஆனது மாற்றப்பட்ட ஸ்டேட்ஃபென்ஸுக்கு பிரச்சாரம் செய்யப்படுகிறது.

source: Fix double calculation of coefficients in :meth`~qiskit.aqua.operators.VectorStateFn.to_circuit_op`.
ta_in: இதில் குணகங்களின் இரட்டை கணக்கீட்டை சரிசெய்யவும்: மெத்` qiskit.aqua.operators.VectorStateFn.to_circuit_op`.

source: Calling PauliTrotterEvolution.convert on an operator including a term that is a scalar multiple of the identity gave an incorrect circuit, one that ignored the scalar coefficient. This fix includes the effect of the coefficient in the global_phase property of the circuit.
ta_in: அடையாளத்தின் அளவிடக்கூடிய பன்மடங்கு என்ற சொல் உட்பட ஒரு ஆபரேட்டரில் PauliTrotterEvolution.convert ஐ அழைப்பது தவறான சுற்றுவட்டத்தைக் கொடுத்தது, இது அளவிடல் குணகத்தை புறக்கணித்தது. இந்த பிழைத்திருத்தம் சுற்றுவட்டத்தின் Global_phase சொத்தில் உள்ள குணகத்தின் விளைவை உள்ளடக்கியது.

source: Make ListOp.num_qubits check that all ops in list have the same num_qubits Previously, the number of qubits in the first operator in the ListOp was returned. With this change, an additional check is made that all other operators also have the same number of qubits.
ta_in: ListOp.num_qubits பட்டியலில் உள்ள அனைத்து ஆப்களுக்கும் ஒரே எண்_க்பிட்கள் உள்ளதா என சரிபார்க்கவும். முன்பு, லிஸ்ட்ஆப்பில் முதல் ஆபரேட்டரில் உள்ள குவிட்களின் எண்ணிக்கை திரும்பப் பெறப்பட்டது. இந்த மாற்றத்தின் மூலம், மற்ற எல்லா ஆபரேட்டர்களுக்கும் ஒரே எண்ணிக்கையிலான குவிட்கள் உள்ளன என்று கூடுதல் சோதனை செய்யப்படுகிறது.

source: Make PauliOp.exp_i() generate the correct matrix with the following changes. 1) There was previously an error in the phase of a factor of 2. 2) The global phase was ignored when converting the circuit to a matrix. We now use qiskit.quantum_info.Operator, which is generally useful for converting a circuit to a unitary matrix, when possible.
ta_in: PauliOp.exp_i () பின்வரும் மாற்றங்களுடன் சரியான மேட்ரிக்ஸை உருவாக்கவும். 1) 2 இன் காரணியின் கட்டத்தில் முன்பு பிழை ஏற்பட்டது. 2) சுற்று ஒரு மேட்ரிக்ஸாக மாற்றும்போது உலகளாவிய கட்டம் புறக்கணிக்கப்பட்டது. நாம் இப்போது qiskit.quantum_info.Operator ஐப் பயன்படுத்துகிறோம், இது ஒரு சுற்று ஒரு ஒற்றையாட்சி மேட்ரிக்ஸாக மாற்றுவதற்கு பொதுவாக பயனுள்ளதாக இருக்கும்.

source: Fixes the cyclicity detection as reported buggy in https://github.com/Qiskit/qiskit-aqua/issues/1184.
ta_in: Https://github.com/Qiskit/qiskit-aqua/issues/1184 இல் புகாரளிக்கப்பட்டதாக சுழற்சி கண்டறிதலை சரிசெய்கிறது.

source: IBM Q Provider 0.11.0
ta_in: ஐபிஎம் கியூ வழங்குபவர் 0.11.0

source: The deprecated support for running qiskit-ibmq-provider with Python 3.5 has been removed. To use qiskit-ibmq-provider >=0.11.0 you will now need at least Python 3.6. If you are using Python 3.5 the last version which will work is qiskit-ibmq-provider 0.10.x.
ta_in: பைதான் 3.5 உடன் கிஸ்கிட்-இப்மக்-வழங்குநரை இயக்குவதற்கான நீக்கப்பட்ட ஆதரவு நீக்கப்பட்டது. Qiskit-ibmq-வழங்குநர்> = 0.11.0 ஐப் பயன்படுத்த உங்களுக்கு இப்போது குறைந்தபட்சம் பைதான் 3.6 தேவைப்படும். நீங்கள் பைதான் 3.5 ஐப் பயன்படுத்துகிறீர்கள் என்றால், வேலை செய்யும் கடைசி பதிப்பு qiskit-ibmq- வழங்குநர் 0.10.x.

source: Prior to this release, ``websockets`` 7.0 was used for Python 3.6. With this release, ``websockets`` 8.0 or above is required for all Python versions. The package requirements have been updated to reflect this.
ta_in: இந்த வெளியீட்டிற்கு முன்பு, பைதான் 3.6 க்கு `` வெப்சாக்கெட்`` 7.0 பயன்படுத்தப்பட்டது. இந்த வெளியீட்டில், அனைத்து பைதான் பதிப்புகளுக்கும் `` வெப்சாக்கெட்`` 8.0 அல்லது அதற்கு மேல் தேவை. இதை பிரதிபலிக்கும் வகையில் தொகுப்பு தேவைகள் புதுப்பிக்கப்பட்டுள்ளன.

source: Terra 0.15.2
ta_in: டெரா 0.15.2

source: Aqua 0.7.5
ta_in: அக்வா 0.7.5

source: IBM Q Provider 0.10.0
ta_in: ஐபிஎம் கியூ வழங்குபவர் 0.10.0

source: CQC randomness extractors can now be invoked asynchronously, using methods :meth:`~qiskit.providers.ibmq.random.CQCExtractor.run_async_ext1` and :meth:`~qiskit.providers.ibmq.random.CQCExtractor.run_async_ext2`. Each of these methods returns a :class:`~qiskit.providers.ibmq.random.CQCExtractorJob` instance that allows you to check on the job status (using :meth:`~qiskit.providers.ibmq.random.CQCExtractorJob.status`) and wait for its result (using :meth:`~qiskit.providers.ibmq.random.CQCExtractorJob.block_until_ready`). The :meth:`qiskit.provider.ibmq.random.CQCExtractor.run` method remains synchronous.
ta_in: சிக்யூசி சீரற்ற பிரித்தெடுத்தல்களை இப்போது ஒத்திசைவற்ற முறையில் பயன்படுத்தலாம், முறைகளைப் பயன்படுத்தி: மெத்: `கிஸ்கிட் .பிரவைடர்கள். ஐ பி ம் கியூ . சீரற்ற. சி கியூ சி எஸ்ட்ரக்டர்.ரன் _அஸின்க் _ஈஸ்ட் 1` மற்றும்: மெத் : `~ கிஸ்கிட் . பிரோவிடேர்ஸ் .ஐபிம்கியூ . ரெண்டோம் . சிகியூசி எஸ்ட்ரக்டர் . ரன் _அஸின்க் _ ஈஸ்ட் 2`. இந்த முறைகள் ஒவ்வொன்றும் ஒரு: வகுப்பைத் தருகின்றன: `~ கிஸ்கிட் . ப்ரொவிடேர்ஸ் . ஐபிம் கியூ .ரெண்டோம் .சி கியூ சி எஸ்ட்ரக்டர்ஸ் ஜாப் ` உதாரணம், இது வேலை நிலையை சரிபார்க்க உங்களை அனுமதிக்கிறது (பயன்படுத்தி: மெத்:` கிஸ்கிட் .பிரவைடர்கள். ஐபிம் கியூ .ரெண்டோம் .சி கியூ சி எஸ்ட்ரக்டர்ஸ் ஜாப்.ஸ்டேட்டஸ் ` ) மற்றும் அதன் முடிவுக்காக காத்திருங்கள் (பயன்படுத்தி: மெத்: `~ கிஸ்கிட் .பிரவைடர்கள். ஐபிம் கியூ . சீரற்றது. தி: மெத்: `ஸ்கிட் .பிரவைடர்கள். ஐபிம் கியூ .ரெண்டோம் .சி கியூ சி எஸ்ட்ரக்டர்ஸ் ஜாப்.ஸ்டேட்டஸ் .ரன் ` முறை ஒத்திசைவாக உள்ளது.

source: You can now use the new IBMQ experiment service to query, retrieve, and download experiment related data. Interface to this service is located in the new :mod:`qiskit.providers.ibmq.experiment` package. Note that this feature is still in beta, and not all accounts have access to it. It is also subject to heavy modification in both functionality and API without backward compatibility.
ta_in: நீங்கள் இப்பொழுது புதிய ஐபிம் கியூ பரிசோதனை சேவையை கேள்வி, மீட்கவும், மற்றும் பதிவிறக்கப்பட்ட தரவை பதிவிறக்க முடியும். இந்த சேவையகத்துக்கு புதிய இன்டெர்பாஸ் :மொட் :` க்கிஸ்கிட் .ப்ரொவிடெர் ' பிணைப்பு.ஐபிம் கியூ.யூஸ் ` பேக்கஜ் . இந்த அம்சம் இன்னும் பீட்டாவில் உள்ளது என்பதை கவனிக்கவும், அனைத்து கணக்குகளையும் புதிய தாக அணுக வேண்டுடாம் . இது பின்பு ஒத்திசைவு இல்லாமல் செயல்திறன் மற்றும் எ பி ஐ இரண்டிலும் பெரும் மாற்றத்துக்கு உட்பட்டது.

source: Two Jupyter magic functions, the IQX dashboard and the backend widget, are updated to display backend reservations. If a backend has reservations scheduled in the next 24 hours, time to the next one and its duration are displayed (e.g. ``Reservation: in 6 hrs 30 min (60m)``). If there is a reservation and the backend is active, the backend status is displayed as ``active [R]``.
ta_in: இரண்டு ஜூபியர் மாய செயல்பாடுகள், ஐ கியூ எக்ஸ் டேஸ்போர்டு மற்றும் பின்னணி விட்ஜெட், பின்னணி ரெசெர்விஷன் காட்ட புதுப்பிக்கப்படுகிறது. ஒரு பின்னணி அடுத்த 24 மணி நேரத்தில் நிர்ணயிக்கப்பட்டால், அடுத்த ஒரு மணி நேரம் மற்றும் அதன் கால அளவு தெரியும் (எ. கா ` ` சராசரியாக: 6 மணிக்கு 30 நிமிடங்கள் (60மீ) ` `). முன்பதிவு இருந்தால் மற்றும் பின்தளத்தில் செயலில் இருந்தால், பின்னணி நிலையானது `` ஆக்ட்டிவ் [ஆர்] ``.

source: Starting from this release, the `basis_gates` returned by :meth:`qiskit.providers.ibmq.IBMQBackend.configuration` may differ for each backend. You should update your program if it relies on the basis gates being ``['id','u1','u2','u3','cx']``. We recommend always using the :meth:`~qiskit.providers.ibmq.IBMQBackend.configuration` method to find backend configuration values instead of hard coding them.
ta_in: இந்த விடுதலிலிருந்து துவங்குகிறது, ` basis_ வாயில்கள் `: மெத்: `கிஸ்கிட். ப்ரீர்ஸ் . ஐபிம் கியூ .பின்தளத்தில் .அமைத்தல் ` ஒவ்வொரு பின்னணிக்கு வேறுபடும். நீங்கள் உங்கள் நிரலை புதுப்பிக்கப்பட வேண்டும் என்றால், அடிப்படை வாயுக்கள் ` ` ['ஐ டி ',' யூ 1 ',' யூ 2 ',' சி எக்ஸ் ',' சி எக்ஸ் '] ` `. நாம் எப்போதும் :: மெத்: `கிஸ்கிட். ப்ரீர்ஸ் . ஐபிம் கியூ .பின்தளத்தில் .அமைத்தல் ` முறையை பயன்படுத்தி பின்பற்ற வடிவமைப்பு மதிப்புகளைக் கண்டுபிடுக்க வேண்டும்.

source: ``qiskit-ibmq-provider`` release 0.10 requires ``qiskit-terra`` release 0.15 or above. The package metadata has been updated to reflect the new dependency.
ta_in: `` கிஸ்கிட்-ஐபிம் -ப்ரோவிடெர் - `` 0. 10. தேவை `` கிஸ்கிட்-டெர்ரா `` வெளியீடு 0.15 அல்லது அதற்கு மேல். புதிய சார்புநிலையை பிரதிபலிக்கும் வகையில் தொகுப்பு மெட்டாடேட்டா புதுப்பிக்கப்பட்டுள்ளது.

source: Qiskit 0.21.0
ta_in: கிஸ்கிட் 0.21.0

source: IBM Q Provider 0.9.0
ta_in: ஐபிஎம் கியூ வழங்குபவர் 0.10.0

source: You can now access the IBMQ random number services, such as the CQC randomness extractor, using the new package :mod:`qiskit.providers.ibmq.random`. Note that this feature is still in beta, and not all accounts have access to it. It is also subject to heavy modification in both functionality and API without backward compatibility.
ta_in: புதிய தொகுப்பைப் பயன்படுத்தி சி கியூ சி சீரற்ற பிரித்தெடுத்தல் போன்ற ஐபிம் கியூ சீரற்ற எண் சேவைகளை இப்போது நீங்கள் அணுகலாம்: மொட் : `க்கிஸ்கிட்.ப்ரொவைடர் .ஐ பி ம் கியூ .ரெண்டோம் `. இந்த அம்சம் இன்னும் பீட்டாவில் உள்ளது என்பதை நினைவில் கொள்க, எல்லா கணக்குகளுக்கும் அனுமதி இல்லை. இது பின்தங்கிய இணக்கத்தன்மை இல்லாமல் செயல்பட மற்றும் ஏபிஐ இரண்டிலும் கடுமையான மாற்றங்களுக்கு உட்பட்டது.

source: Fixes an issue that may raise a ``ValueError`` if :meth:`~qiskit.providers.ibmq.IBMQBackend.retrieve_job` is used to retrieve a job submitted via the IBM Quantum Experience Composer.
ta_in: ஐபிஎம் குவாண்டம் எக்ஸ்பீரியன்ஸ் உருவாக்கப்பட்டவர் வழியாக சமர்ப்பிக்கப்பட்ட வேலையை மீட்டெடுக்க ```` மதிப்பு பிழை `` என்ற: மெத்: `~ க்கிஸ்கிட் .ப்ரொவைடர் .ஐபிம் கியூ .ஐபிம் கியூ பாக்கெண்ட் .ரெட்ரிவ் _ ஜாப் ` என்பது `` மதிப்பு பிழை`` ஐ எழுப்பக்கூடிய சிக்கலை சரிசெய்கிறது.

source: :class:`~qiskit.providers.ibmq.managed.IBMQJobManager` has been updated so that if a time out happens while waiting for an old job to finish, the time out error doesn't prevent a new job to be submitted. Fixes `#737 <https://github.com/Qiskit/qiskit-ibmq-provider/issues/737>`_
ta_in: : class: `~ qiskit.providers.ibmq.managed.IBMQJobManager` புதுப்பிக்கப்பட்டுள்ளது, இதனால் பழைய வேலை முடிவடையும் வரை காத்திருக்கும்போது நேரம் முடிந்தால், புதிய வேலை சமர்ப்பிக்கப்படுவதைத் தடுக்காது. திருத்தங்கள் `# 737

source: When accessing the ``definition`` attribute of a parameterized ``Gate`` instance, the generated ``QuantumCircuit`` had been generated with an invalid ``ParameterTable``, such that reading from ``QuantumCircuit.parameters`` or calling ``QuantumCircuit.bind_parameters`` would incorrectly report the unbound parameters. This has been resolved.
ta_in: அளவுருவாக்கப்பட்ட `` கேட்`` உதாரணத்தின் `` வரையறை`` பண்புக்கூற்றை அணுகும்போது, ​​உருவாக்கப்பட்ட `` குவாண்டம் சர்க்யூட்`` தவறான `` அளவுரு டேபிள்`` உடன் உருவாக்கப்பட்டது, அதாவது `` குவாண்டம் சிர்குட்.பாராமீட்டர்கள்`` `` QuantumCircuit.bind_parameters`` ஐ அழைப்பது வரம்பற்ற அளவுருக்களை தவறாக புகாரளிக்கும். இது தீர்க்கப்பட்டுள்ளது.

source: ``SXGate().inverse()`` had previously returned an 'sx_dg' gate with a correct ``definition`` but incorrect ``to_matrix``. This has been updated such that ``SXGate().inverse()`` returns an ``SXdgGate()`` and vice versa.
ta_in: `` எஸ்.எக்ஸ் கேட் (). இது புதுப்பிக்கப்பட்டது `` எஸ்.எக்ஸ் கேட் (). தலைகீழ் () `` ஒரு `` எஸ்.எக்ஸ்.டி.ஜி கேட் () `` மற்றும் அதற்கு நேர்மாறாக.

source: ``Instruction.inverse()``, when not overridden by a subclass, would in some cases return a ``Gate`` instance with an incorrect ``to_matrix`` method. The instances of incorrect ``to_matrix`` methods have been removed.
ta_in: `` Instruction.inverse () ``, துணைப்பிரிவால் மேலெழுதப்படாதபோது, ​​சில சந்தர்ப்பங்களில் தவறான `` to_matrix`` முறையுடன் `` கேட்`` உதாரணத்தைத் தரும். தவறான `` to_matrix`` முறைகளின் நிகழ்வுகள் நீக்கப்பட்டன.

source: For ``C3XGate`` with a non-zero ``angle``, inverting the gate via ``C3XGate.inverse()`` had previously generated an incorrect inverse gate. This has been corrected.
ta_in: பூஜ்ஜியமற்ற `` கோணத்துடன்` `` சி 3 எக்ஸ் கேட்`` க்கு, `` சி 3 எக்ஸ் கேட்.இன்வர்ஸ் () `` வழியாக கேட்டை தலைகீழாக மாற்றுவது முன்பு தவறான தலைகீழ் வாயிலை உருவாக்கியது. இது சரி செய்யப்பட்டது.

source: The ``MCXGate`` modes have been updated to return a gate of the same mode when calling ``.inverse()``. This resolves an issue where in some cases, transpiling a circuit containing the inverse of an ``MCXVChain`` gate would raise an error.
ta_in: ``.விளக்கு () `` என்று அழைக்கும் போது அதே பயன்முறையின் ஒரு வாயிலைத் திருப்புவதற்கு `` MCXGate`` முறைகள் புதுப்பிக்கப்பட்டுள்ளன. சில சந்தர்ப்பங்களில், `` MCXVChain`` வாயிலின் தலைகீழ் கொண்ட ஒரு சுற்றுக்குச் செல்வது பிழையை எழுப்பும் ஒரு சிக்கலை இது தீர்க்கிறது.

source: Previously, when creating a multiply controlled phase gate via ``PhaseGate.control``, an ``MCU1Gate`` gate had been returned. This has been had corrected so that an ``MCPhaseGate`` is returned.
ta_in: முன்னதாக, `` PhaseGate.control`` வழியாக பெருக்க கட்டுப்பாட்டு கட்ட வாயிலை உருவாக்கும் போது, ​​`` MCU1Gate`` வாயில் திரும்பியது. இது சரி செய்யப்பட்டது, இதனால் `` MCPhaseGate`` திரும்பப் பெறப்படும்.

source: Previously, attempting to decompose a circuit containing an ``MCPhaseGate`` would raise an error due to an inconsistency in the definition of the ``MCPhaseGate``. This has been corrected.
ta_in: முன்னதாக, `` MCPhaseGate`` கொண்ட ஒரு சுற்றுவட்டத்தை சிதைக்க முயற்சிப்பது `` MCPhaseGate`` இன் வரையறையில் முரண்பாடு காரணமாக ஒரு பிழையை எழுப்புகிறது. இது சரி செய்யப்பட்டது.

source: ``QuantumCircuit.compose`` and ``DAGCircuit.compose`` had, in some cases, incorrectly translated conditional gates if the input circuit contained more than one ``ClassicalRegister``. This has been resolved.
ta_in: `` QuantumCircuit.compose`` மற்றும் `` DAGCircuit.compose`` ஆகியவை சில சந்தர்ப்பங்களில், உள்ளீட்டு சுற்றுகளில் ஒன்றுக்கு மேற்பட்ட `` கிளாசிக்கல் ரெஜிஸ்டர்`` ஐக் கொண்டிருந்தால், நிபந்தனை வாயில்களை தவறாக மொழிபெயர்த்துள்ளன. இது தீர்க்கப்பட்டுள்ளது.

source: Extending circuits with differing registers updated the ``qregs`` and ``cregs`` properties accordingly, but not the ``qubits`` and ``clbits`` lists. As these are no longer generated from the registers but are cached lists, this lead to a discrepancy of registers and bits. This has been fixed and the ``extend`` method explicitly updates the cached bit lists.
ta_in: மாறுபட்ட பதிவேடுகளுடன் சுற்றுகளை விரிவாக்குவது, `` கிரெக்ஸ்`` மற்றும் `` கிரெக்ஸ்`` பண்புகளை அதற்கேற்ப புதுப்பித்தது, ஆனால் `` க்விட்ஸ்`` மற்றும் `` கிளிபிட்ஸ்`` பட்டியல்கள் அல்ல. இவை இனி பதிவேடுகளிலிருந்து உருவாக்கப்படாது, ஆனால் அவை தற்காலிக சேமிப்பு பட்டியல்களாக இருப்பதால், இது பதிவேடுகள் மற்றும் பிட்களின் முரண்பாட்டிற்கு வழிவகுக்கிறது. இது சரி செய்யப்பட்டது மற்றும் `` நீட்டிப்பு` 'முறை தற்காலிக சேமிப்பு பிட் பட்டியல்களை வெளிப்படையாக புதுப்பிக்கிறது.

source: Fix bugs of the concrete implementations of meth:`~qiskit.circuit.ControlledGate.inverse` method which do not preserve the ``ctrl_state`` parameter.
ta_in: மெத்தின் உறுதியான செயலாக்கங்களின் பிழைகளை சரிசெய்யவும்: `` qiskit.circuit.ControlledGate.inverse` முறை, `` ctrl_state`` அளவுருவைப் பாதுகாக்காது.

source: A bug was fixed that caused long pulse schedules to throw a recursion error.
ta_in: ஒரு பிழை ஏற்பட்டது என்று நீண்ட சாளர திட்டத்தை ஏற்படுத்தும் போது ஒரு சுழல் பிழை ஏற்பட்டது.

source: IBM Q Provider 0.8.0
ta_in: IBM Q வழங்கி 0. 8. 0

source: The 0.15.0 release includes several new features and bug fixes. Some highlights for this release are:
ta_in: 0.16.0 வெளியீட்டில் பல புதிய அம்சங்கள் மற்றும் பிழை திருத்தங்கள் ஆகியவை அடங்கும். இந்த வெளியீட்டில் வரும் அம்சங்கள் பின்வருமாறு:

source: This release includes the introduction of arbitrary basis translation to the transpiler. This includes support for directly targeting a broader range of device basis sets, e.g. backends implementing RZ, RY, RZ, CZ or iSwap gates.
ta_in: இந்த விடுதலை சார்ந்த அடிப்படையிலான மொழிபெயர்ப்பு அறிமுகம் (transpiler) உள்ளடக்கத்தை உள்ளடக்குகிறது. இது நேரடியாக ஒரு பரவலான கருவி அடிப்படையிலான சாதனை அடிப்படையிலான ஆதரவு, எ. கா, RZ, RZ, CZ, CZ அல்லது iSwap வாயில்களை செயல்படுத்துகிறது.

source: The :class:`~qiskit.circuit.QuantumCircuit` class now tracks global phase. This means controlling a circuit which has global phase now correctly adds a relative phase, and gate matrix definitions are now exact rather than equal up to a global phase.
ta_in: The :class:` ~ qiskit.circuit.QuantumCircuit ` class now tracks global phase. அதாவது உலகளாவிய காலம் தற்போது சரியாக கூடுதலாக ஒரு சுற்றுச்சூழல் நிலையை கட்டுப்படுத்துகிறது, மற்றும் வாய்க்கு மாட்ரிக்ஸ் வரையறைகள் ஒரு உலகளாவிய நிலைக்கு சமமாக கூடுதலாகும்.

source: A new DAG class :class:`qiskit.dagcircuit.DAGDependency` for representing the dependency form of circuit, In this DAG, the nodes are operations (gates, measure, barrier, etc...) and the edges corresponds to non-commutation between two operations.
ta_in: ஒரு புதிய DAG வகுப்பு: வர்க்கம்: சுற்றுகளின் சார்பு வடிவத்தைக் குறிக்க `qiskit.dagcircuit.DAGDependency`, இந்த DAG இல், முனைகள் செயல்பாடுகள் (வாயில்கள், அளவீட்டு, தடை போன்றவை ...) மற்றும் விளிம்புகள் பரிமாற்றம் அல்லாதவற்றுடன் ஒத்திருக்கும் இரண்டு செயல்பாடுகளுக்கு இடையில்.

source: Four new functions are added to :mod:`qiskit.converters` for converting back and forth to :class:`~qiskit.dagcircuit.DAGDependency`. These functions are:
ta_in: நான்கு புதிய செயல்பாடுகள் இதில் சேர்க்கப்பட்டுள்ளன: mod: `qiskit.converters` முன்னும் பின்னுமாக மாற்றுவதற்கு: வகுப்பு:` ~ qiskit.dagcircuit.DAGDependency`. இந்த செயல்பாடுகள்:

source: :func:`~qiskit.converters.circuit_to_dagdependency` to convert from a :class:`~qiskit.circuit.QuantumCircuit` object to a :class:`~qiskit.dagcircuit.DAGDependency` object.
ta_in: func: `~ qiskit.converters.circuit_to_dagdependency` ஒரு: வகுப்பிலிருந்து மாற்ற:` ~ qiskit.circuit.QuantumCircuit` பொருள் ஒரு: வகுப்பிற்கு: `~ qiskit.dagcircuit.DAGDependency` பொருள்.

source: :func:`~qiskit.converters.dagdependency_to_circuit` to convert from a :class:`~qiskit.dagcircuit.DAGDependency` object to a :class:`~qiskit.circuit.QuantumCircuit` object.
ta_in: : func: `~ qiskit.converters.dagdependency_to_circuit` இலிருந்து ஒரு: வகுப்பிலிருந்து மாற்ற:` ~ qiskit.dagcircuit.DAGDependency` பொருள் ஒரு: வகுப்பிற்கு: `q qiskit.circuit.QuantumCircuit` பொருள.
