Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: Previously it was possible to set the number of control qubits to zero in which case the the original, potentially non-controlled, operation would be returned. This could cause an ``AttributeError`` to be raised if the caller attempted to access an attribute which only :class:`~qiskit.circuit.ControlledGate` object have. This has been fixed by adding a getter and setter for :attr:`~qiskit.circuit.ControlledGate.num_ctrl_qubits` to validate that a valid value is being used. Fixes `#4576 <https://github.com/Qiskit/qiskit-terra/issues/4576>`__
ta_in: முன்னதாக கட்டுப்பாட்டு வினாடிகளின் எண்ணிக்கையை பூஜ்ஜியமாக அமைக்க முடிந்தது, இந்த விஷயத்தில் அசல், கட்டுப்படுத்தப்படாத, செயல்பாடு திரும்பப் பெறப்படும். அழைப்பாளர் ஒரு பண்புகளை மட்டுமே அணுக முயற்சித்தால் இது ஒரு `` பண்புக்கூறு பிழை`` எழுப்பப்படக்கூடும்: வர்க்கம்: `~ qiskit.circuit.ControlledGate` பொருள் உள்ளது. செல்லுபடியாகும் மதிப்பு பயன்படுத்தப்படுவதை சரிபார்க்க, attr: `~ qiskit.circuit.ControlledGate.num_ctrl_qubits` க்கு ஒரு பெறுநர் மற்றும் அமைப்பாளரைச் சேர்ப்பதன் மூலம் இது சரி செய்யப்பட்டது. `# 4576 <https://github.com/Qiskit/qiskit-terra/issues/4576>` __

source: Open controls were implemented by modifying a :class:`~qiskit.circuit.Gate` objects :attr:`~qiskit.circuit.Gate.definition`. However, when the gate already exists in the basis set, this definition was not used, which resulted in incorrect circuits being sent to a backend after transpilation. This has been fixed by modifying the :class:`~qiskit.transpiler.Unroller` pass to use the definition if it encounters a controlled gate with open controls. Fixes `#4437 <https://github.com/Qiskit/qiskit-terra/issues/4437>`__
ta_in: ஒரு: வகுப்பு : `~ qiskit.circuit.Gate` பொருள்கள்: attr:` ~ qiskit.circuit.Gate.definition` ஐ மாற்றியமைப்பதன் மூலம் திறந்த கட்டுப்பாடுகள் செயல்படுத்தப்பட்டன. இருப்பினும், அடிப்படை தொகுப்பில் கேட் ஏற்கனவே இருக்கும்போது, ​​இந்த வரையறை பயன்படுத்தப்படவில்லை, இதன் விளைவாக தவறான சுற்றுகள் இடமாற்றத்திற்குப் பிறகு ஒரு பின்தளத்தில் அனுப்பப்பட்டன. திறந்த கட்டுப்பாடுகளுடன் கட்டுப்படுத்தப்பட்ட வாயிலை எதிர்கொண்டால், வரையறையைப் பயன்படுத்த: வர்க்கம்: `~ qiskit.transpiler.Unroller` பாஸை மாற்றுவதன் மூலம் இது சரி செய்யப்பட்டது. திருத்தங்கள் `# 4437 <https://github.com/Qiskit/qiskit-terra/issues/4437>` __

source: The ``insert_barriers`` keyword argument in the :class:`~qiskit.circuit.library.ZZFeatureMap` class didn't actually insert barriers in between the Hadamard layers and evolution layers. This has been fixed so that barriers are now properly inserted.
ta_in: வகுப்பில் உள்ள `` செருகு_ தடைகள்`` முக்கிய வாதம்: `~ qiskit.circuit.library.ZZFeatureMap` வகுப்பு உண்மையில் ஹடாமார்ட் அடுக்குகளுக்கும் பரிணாம அடுக்குகளுக்கும் இடையில் தடைகளைச் சேர்க்கவில்லை. தடைகள் இப்போது சரியாக செருகப்படுவதற்கு இது சரி செய்யப்பட்டது.

source: Fixed issue where some gates with three or more qubits would fail to compile in certain instances. Refer to `#4577 <https://github.com/Qiskit/qiskit-terra/issues/4577` for more detail.
ta_in: மூன்று அல்லது அதிக குறும்படங்களுடன் சில வாயில்கள் குறிப்பிட்ட நிகழ்வுகளுக்குள் ஒழுங்குபடுத்துவதற்கு மாறுபடும். Refer to `#4577 <https: //github.com/Qiskit/qiskit-terra/issues/4577 ` மேலும் விவரம்.

source: The matplotlib (``'mpl'``) output backend for the :class:`qiskit.circuit.QuantumCircuit` method :meth:`~qiskit.circuit.QuantumCircuit.draw` and the :func:`qiskit.visualization.circuit_drawer` function was not properly scaling when the kwarg ``scale`` was set. Fonts and line widths did not scale with the rest of the image. This has been fixed and all elements of the circuit diagram now scale properly. For example:
ta_in: மேட்லோட்லிப் (`` 'எம்.பி.எல்``) வெளியீட்டு பின்தளத்தில்: வகுப்பு: `qiskit.circuit.QuantumCircuit` முறை: மெத்:` q qiskit.circuit.QuantumCircuit.draw` மற்றும்: func: `qiskit.visualization.circuit_drawer குவார்க் `` அளவு`` அமைக்கப்பட்டபோது `செயல்பாடு சரியாக அளவிடப்படவில்லை. எழுத்துருக்கள் மற்றும் வரி அகலங்கள் படத்தின் மீதமுள்ள அளவோடு அளவிடப்படவில்லை. இது சரி செய்யப்பட்டது மற்றும் சுற்று வரைபடத்தின் அனைத்து கூறுகளும் இப்போது சரியாக அளவிடப்படுகின்றன. உதாரணத்திற்கு:

source: Fixes `#4179 <https://github.com/Qiskit/qiskit-terra/issues/4179>`_.
ta_in: `# 4179 <https://github.com/Qiskit/qiskit-terra/issues/4179>` _ திருத்தங்கள்.

source: Fixes issue where initializing or evolving :class:`qiskit.quantum_info.Statevector` and :class:`qiskit.quantum_info.DensityMatrix` classes by circuits by circuit containing :class:`~qiskit.circuit.Barrier` instructions would raise an exception. Fixes `#4461 <https://github.com/Qiskit/qiskit-terra/issues/4461>`__
ta_in: துவக்க அல்லது உருவாகும் இடத்தை சரிசெய்கிறது: வர்க்கம்: `qiskit.quantum_info.Statevector` மற்றும்: வகுப்பு:` qiskit.quantum_info.DensityMatrix` வகுப்புகள் சுற்றுகள் மூலம் சுற்றுகள் மூலம்: வர்க்கம்: `q qiskit.circuit.Barrier` அறிவுறுத்தல்கள் ஒரு விதிவிலக்கை எழுப்புகின்றன. திருத்தங்கள் `# 4461 <https://github.com/Qiskit/qiskit-terra/issues/4461>` __

source: Previously when a :class:`~qiskit.circuit.QuantumCircuit` contained a :class:`~qiskit.circuit.Gate` with a classical condition the transpiler would sometimes fail when using ``optimization_level=3`` on :func:`~qiskit.compiler.transpile` or :func:`~qiskit.execute.execute` raising an ``UnboundLocalError``. This has been fixed by updating the :class:`~qiskit.transpiler.passes.ConsolidateBlocks` pass to account for the classical condition. Fixes `#4672 <https://github.com/Qiskit/qiskit-terra/issues/4672>`_.
ta_in: முன்னதாக ஒரு: வகுப்பு: `~ qiskit.circuit.QuantumCircuit` இல் ஒரு: வகுப்பு:` ~ qiskit.circuit.Gate` ஒரு கிளாசிக்கல் நிபந்தனையுடன் இருக்கும்போது, ​​`` உகப்பாக்கம்_ நிலை = 3`` இல்: டிரான்ஸ்பைலர் சில நேரங்களில் தோல்வியடையும்: func: ` ~ qiskit.compiler.transpile` அல்லது: func: `~ qiskit.execute.execute`` `வரம்பற்ற லோகல் பிழை`` ஐ உயர்த்துகிறது. கிளாசிக்கல் நிலைக்கு கணக்கில் திருத்தங்கள்: class: `~ qiskit.transpiler.passes.ConsolidateBlocks` பாஸைப் புதுப்பிப்பதன் மூலம் இது சரி செய்யப்பட்டது .

source: In some situations long gate and register names would overflow, or leave excessive empty space around them when using the ``'mpl'`` output backend for the :meth:`qiskit.circuit.QuantumCircuit.draw` method and :func:`qiskit.visualization.circuit_drawer` function. This has been fixed by using correct text widths for a proportional font. Fixes `#4611 <https://github.com/Qiskit/qiskit-terra/issues/4611>`__, `#4605 <https://github.com/Qiskit/qiskit-terra/issues/4605>`__, `#4545 <https://github.com/Qiskit/qiskit-terra/issues/4545>`__, `#4497 <https://github.com/Qiskit/qiskit-terra/issues/4497>`__, `#4449 <https://github.com/Qiskit/qiskit-terra/issues/4449>`__, and `#3641 <https://github.com/Qiskit/qiskit-terra/issues/3641>`__.
ta_in: சில சூழ்நிலைகளில் நீண்ட வாயில் மற்றும் பதிவு பெயர்கள் நிரம்பி வழியும், அல்லது `` 'எம்.பி.எல்`` வெளியீட்டு பின்தளத்தில்: மெத்: `qiskit.circuit.QuantumCircuit.draw` முறை மற்றும்: func:` qiskit.visualization.circuit_drawer` செயல்பாடு. விகிதாசார எழுத்துருவுக்கு சரியான உரை அகலங்களைப் பயன்படுத்துவதன் மூலம் இது சரி செய்யப்பட்டது. திருத்தங்கள் ` `#4611 <https://github.com/Qiskit/qiskit-terra/issues/4611>`__, `#4605 <https://github.com/Qiskit/qiskit-terra/issues/4605>`__, `#4545 <https://github.com/Qiskit/qiskit-terra/issues/4545>`__, `#4497 <https://github.com/Qiskit/qiskit-terra/issues/4497>`__, `#4449 <https://github.com/Qiskit/qiskit-terra/issues/4449>`__, and `#3641 <https://github.com/Qiskit/qiskit-terra/issues/3641>`__.

source: When using the ``style` kwarg on the :meth:`qiskit.circuit.QuantumCircuit.draw` or :func:`qiskit.visualization.circuit_drawer` with the ``'mpl'`` output backend the dictionary key ``'showindex'`` set to ``True``, the index numbers at the top of the column did not line up properly. This has been fixed.
ta_in: `மெத்:` qiskit.circuit.QuantumCircuit.draw` அல்லது: func: `qiskit.visualization.circuit_drawer` இல்` `பாணி` குவார்க்கைப் பயன்படுத்தும் போது,` `'mpl`` வெளியீட்டைக் கொண்டு அகராதி விசையை` `' showindex'`` `உண்மை`` என அமைக்கப்பட்டால், நெடுவரிசையின் மேலே உள்ள குறியீட்டு எண்கள் சரியாக வரிசைப்படுத்தப்படவில்லை. இது சரி செய்யப்பட்டது.

source: When using ``cregbunde=True`` with the ``'mpl'`` output backend for the :meth:`qiskit.circuit.QuantumCircuit.draw` method and :func:`qiskit.visualization.circuit_drawer` function and measuring onto a second fold, the measure arrow would overwrite the creg count. The count was moved to the left to prevent this. Fixes `#4148 <https://github.com/Qiskit/qiskit-terra/issues/4148>`__.
ta_in: மெத்: `qiskit.circuit.QuantumCircuit.draw` முறை மற்றும்: func:` qiskit.visualization.circuit_drawer` செயல்பாடு மற்றும் அளவிடும் `` 'mpl`` வெளியீட்டு பின்தளத்தில் `` cregbunde = True`` ஐப் பயன்படுத்தும் போது இரண்டாவது மடங்கு, அளவீட்டு அம்பு க்ரெக் எண்ணிக்கையை மேலெழுதும். இதைத் தடுக்க எண்ணிக்கை இடதுபுறமாக நகர்த்தப்பட்டது. திருத்தங்கள் ` `#4148 <https://github.com/Qiskit/qiskit-terra/issues/4148>`__.

source: When using the ``'mpl'`` output backend for the :meth:`qiskit.circuit.QuantumCircuit.draw` method and :func:`qiskit.visualization.circuit_drawer` function :class:`~qiskit.circuit.library.CSwapGate` gates and a controlled :class:`~qiskit.circuit.library.RZZGate` gates now display with their appropriate symbols instead of in a box.
ta_in: : `மெத்:` qiskit.circuit.QuantumCircuit.draw` முறை மற்றும்: func: `qiskit.visualization.circuit_drawer` செயல்பாடு: வகுப்பு:` ~ qiskit.circuit.library. CSwapGate` வாயில்கள் மற்றும் ஒரு கட்டுப்படுத்தப்பட்ட:வகுப்பு : `~ qiskit.circuit.library.RZZGate` வாயில்கள் இப்போது ஒரு பெட்டியில் இல்லாமல் அவற்றின் பொருத்தமான சின்னங்களுடன் காண்பிக்கப்படுகின்றன.

source: When using the ``'mpl'`` output backend for the :meth:`qiskit.circuit.QuantumCircuit.draw` method and :func:`qiskit.visualization.circuit_drawer` function controlled gates created using the :meth:`~qiskit.circuit.QuantumCircuit.to_gate` method were not properly spaced and could overlap with other gates in the circuit diagram. This issue has been fixed.
ta_in: : `மெத்:` qiskit.circuit.QuantumCircuit.draw` முறை மற்றும்: func: `qiskit.visualization.circuit_drawer` செயல்பாடு கட்டுப்படுத்தப்பட்ட வாயில்களைப் பயன்படுத்தி` `'mpl'` வெளியீட்டு பின்தளத்தில் பயன்படுத்தும் போது: மெத்:` q கிஸ்கிட் .circuit.QuantumCircuit.to_gate` முறை சரியாக இடைவெளியில் இல்லை மற்றும் சுற்று வரைபடத்தில் உள்ள மற்ற வாயில்களுடன் ஒன்றிணைக்க முடியும். இந்த சிக்கல் சரி செய்யப்பட்டது.

source: When using the ``'mpl'`` output backend for the :meth:`qiskit.circuit.QuantumCircuit.draw` method and :func:`qiskit.visualization.circuit_drawer` function gates with arrays as parameters, such as :class:`~qiskit.extensions.HamiltonianGate`, no longer display with excessive space around them. Fixes `#4352 <https://github.com/Qiskit/qiskit-terra/issues/4352>`__.
ta_in: மெத்: `qiskit.circuit.QuantumCircuit.draw` முறை மற்றும்: func,:` போன்ற காரணிகள், போன்ற அணிகளை கொண்டு qiskit.visualization.circuit_drawer` செயல்பாடு வாயில்கள்: வர்க்கம் ` 'mpl'`` வெளியீடு பின்தளம் பயன்படுத்தும் போது: `~ qiskit.extensions.HamiltonianGate`, அவற்றைச் சுற்றி அதிக இடத்துடன் இனி காண்பிக்கப்படாது. `# 4352 <https://github.com/Qiskit/qiskit-terra/issues/4352>` __ திருத்தங்கள்.

source: When using the ``'mpl'`` output backend for the :meth:`qiskit.circuit.QuantumCircuit.draw` method and :func:`qiskit.visualization.circuit_drawer` function generic gates created by directly instantiating :class:`qiskit.circuit.Gate` method now display the proper background color for the gate. Fixes `#4496 <https://github.com/Qiskit/qiskit-terra/issues/4496>`__.
ta_in: மெத்: `qiskit.circuit.QuantumCircuit.draw` முறை மற்றும்: func,:` qiskit.visualization.circuit_drawer` செயல்பாடு நேரடியாக துவக்குவதில் உருவாக்கப்படும் ஜெனரிக் வாயில்கள்: வர்க்கம்: ` 'mpl'`` வெளியீடு பின்தளம் பயன்படுத்தும் போது` qiskit .circuit.Gate` முறை இப்போது வாயிலுக்கு சரியான பின்னணி நிறத்தைக் காண்பிக்கும். `# 4496 <https://github.com/Qiskit/qiskit-terra/issues/4496>` __ திருத்தங்கள்.

source: When using the ``'mpl'`` output backend for the :meth:`qiskit.circuit.QuantumCircuit.draw` method and :func:`qiskit.visualization.circuit_drawer` function an ``AttributeError`` that occurred when using :class:`~qiskit.extensions.Isometry` or :class:`~qiskit.extensions.Initialize` has been fixed. Fixes `#4439 <https://github.com/Qiskit/qiskit-terra/issues/4439>`__.
ta_in: மெத்: `qiskit.circuit.QuantumCircuit.draw` முறை மற்றும்: func:` qiskit.visualization.circuit_drawer` செயல்பாட்டிற்கான `` 'mpl'` வெளியீட்டு பின்தளத்தில் பயன்படுத்தும் போது: class: `~ qiskit.extensions.Isometry` அல்லது: class:` ~ qiskit.extensions.Initialize` சரி செய்யப்பட்டது. `# 4439 <https://github.com/Qiskit/qiskit-terra/issues/4439>` __ திருத்தங்கள்.

source: When using the ``'mpl'`` output backend for the :meth:`qiskit.circuit.QuantumCircuit.draw` method and :func:`qiskit.visualization.circuit_drawer` function some open-controlled gates did not properly display the open controls. This has been corrected so that open controls are properly displayed as open circles. Fixes `#4248 <https://github.com/Qiskit/qiskit-terra/issues/4248>`__.
ta_in: : `மெத்:` qiskit.circuit.QuantumCircuit.draw` முறை மற்றும்: func: `qiskit.visualization.circuit_drawer` செயல்பாட்டிற்கான` `'mpl'` வெளியீட்டு பின்தளத்தில் பயன்படுத்தும் போது திறந்த-கட்டுப்படுத்தப்பட்ட சில வாயில்கள் திறந்த திறந்த காட்சியைக் சரியாகக் காட்டவில்லை கட்டுப்பாடுகள். இது சரி செய்யப்பட்டது, இதனால் திறந்த கட்டுப்பாடுகள் திறந்த வட்டங்களாக சரியாக காட்டப்படும். `# 4248 <https://github.com/Qiskit/qiskit-terra/issues/4248>` __ திருத்தங்கள்.

source: When using the ``'mpl'`` output backend for the :meth:`qiskit.circuit.QuantumCircuit.draw` method and :func:`qiskit.visualization.circuit_drawer` function setting the ``fold`` kwarg to -1 will now properly display the circuit without folding. Fixes `#4506 <https://github.com/Qiskit/qiskit-terra/issues/4506>`__.
ta_in: மெத்: `qiskit.circuit.QuantumCircuit.draw` முறை மற்றும்: func,:` qiskit.visualization.circuit_drawer` செயல்பாடு நேரடியாக துவக்குவதில் உருவாக்கப்படும் ஜெனரிக் வாயில்கள்: வர்க்கம்: ` 'mpl'`` வெளியீடு பின்தளம் பயன்படுத்தும் போது` qiskit .circuit.Gate` முறை இப்போது வாயிலுக்கு சரியான பின்னணி நிறத்தைக் காண்பிக்கும். `# 4496 <https://github.com/Qiskit/qiskit-terra/issues/4496>` __ திருத்தங்கள்.

source: Parametric pulses from :mod:`qiskit.pulse.library.discrete` now have zero ends of parametric pulses by default. The endpoints are defined such that for a function :math:`f(x)` then :math:`f(-1) = f(duration + 1) = 0`. Fixes `#4317 <https://github.com/Qiskit/qiskit-terra/issues/4317>`__
ta_in: இதிலிருந்து அளவுரு பருப்பு வகைகள்: mod: `qiskit.pulse.library.discrete` இப்போது முன்னிருப்பாக அளவுரு பருப்புகளின் பூஜ்ஜிய முனைகளைக் கொண்டுள்ளது. இறுதி புள்ளிகள் ஒரு செயல்பாட்டிற்கு வரையறுக்கப்படுகின்றன: கணிதம்: `f (x)` பின்னர்: கணிதம்: `f (-1) = f (காலம் + 1) = 0`. திருத்தங்கள் `# 4317 <https://github.com/Qiskit/qiskit-terra/issues/4317>` __

source: The :class:`qiskit.result.Result` class which was previously constructed using the marshmallow library has been refactored to not depend on marshmallow anymore. This new implementation should be a seamless transition but some specific behavior that was previously inherited from marshmallow may not work. Please file issues for any incompatibilities found.
ta_in: முன்னர்: மார்ஷ்மெல்லோ நூலகத்தைப் பயன்படுத்தி கட்டப்பட்ட வகுப்பு: `qiskit.result.Result` வகுப்பு இனி மார்ஷ்மெல்லோவைச் சார்ந்து இருக்கக்கூடாது என்று மறுசீரமைக்கப்பட்டுள்ளது. இந்த புதிய செயல்படுத்தல் ஒரு தடையற்ற மாற்றமாக இருக்க வேண்டும், ஆனால் முன்னர் மார்ஷ்மெல்லோவிலிருந்து பெறப்பட்ட சில குறிப்பிட்ட நடத்தை செயல்படாது. ஏதேனும் பொருந்தாத தன்மைகளுக்கு சிக்கல்களைத் தாக்கல் செய்க.

source: This 0.6.0 release includes numerous performance improvements for all simulators in the Aer provider and significant changes to the build system when building from source. The main changes are support for SIMD vectorization, approximation in the matrix product state method via bond-dimension truncation, more efficient Pauli expectation value computation, and greatly improved efficiency in Python conversion of C++ result objects. The build system was upgraded to use the `Conan <https://conan.io/>`__ to manage common C++ dependencies when building from source.
ta_in: இந்த 0.6.0 வெளியீட்டில் ஏர் வழங்குநரில் உள்ள அனைத்து சிமுலேட்டர்களுக்கான பல செயல்திறன் மேம்பாடுகள் மற்றும் மூலத்திலிருந்து உருவாக்கும்போது உருவாக்க அமைப்பில் குறிப்பிடத்தக்க மாற்றங்கள் ஆகியவை அடங்கும். முக்கிய மாற்றங்கள் சிம்ட் திசையன்மயமாக்கலுக்கான ஆதரவு, பிணைப்பு-பரிமாணக் குறைப்பு வழியாக மேட்ரிக்ஸ் தயாரிப்பு நிலை முறையின் தோராயமாக்கல், மிகவும் திறமையான பவுலி எதிர்பார்ப்பு மதிப்பு கணக்கீடு மற்றும் சி ++ முடிவு பொருள்களின் பைதான் மாற்றத்தில் பெரிதும் மேம்படுத்தப்பட்ட செயல்திறன். மூலத்திலிருந்து உருவாக்கும்போது பொதுவான சி ++ சார்புகளை நிர்வகிக்க `கோனன் <https://conan.io/>` __ ஐப் பயன்படுத்த உருவாக்க அமைப்பு மேம்படுத்தப்பட்டது.

source: Add density matrix snapshot support to "statevector" and "statevector_gpu" methods of the QasmSimulator.
ta_in: QasmSimulator இன் "statevector" மற்றும் "statevector_gpu" முறைகளுக்கு அடர்த்தி மேட்ரிக்ஸ் ஸ்னாப்ஷாட் ஆதரவைச் சேர்க்கவும்.

source: Allow density matrix snapshots on specific qubits, not just all qubits. This computes the partial trace of the state over the remaining qubits.
ta_in: அடர்த்தி மேட்ரிக்ஸ் ஸ்னாப்ஷாட்களை குறிப்பிட்ட குவிட்களில் அனுமதிக்கவும், எல்லா குவிட்களையும் மட்டுமல்ல. இது மீதமுள்ள குவிட்களில் மாநிலத்தின் பகுதியளவு தடயத்தை கணக்கிடுகிறது.

source: Adds Pauli expectation value snapshot support to the `"density_matrix"` simulation method of the :class:`qiskit.providers.aer.QasmSimulator`. Add snapshots to circuits using the :class:`qiskit.providers.aer.extensions.SnapshotExpectationValue` extension.
ta_in: வர்க்கத்தின் `" அடர்த்தி_மாட்ரிக்ஸ் "` உருவகப்படுத்துதல் முறைக்கு பவுலி எதிர்பார்ப்பு மதிப்பு ஸ்னாப்ஷாட் ஆதரவைச் சேர்க்கிறது: `qiskit.providers.aer.QasmSimulator`. வகுப்பு: `qiskit.providers.aer.extensions.SnapshotExpectationValue` நீட்டிப்பைப் பயன்படுத்தி சுற்றுகளுக்கு ஸ்னாப்ஷாட்களைச் சேர்க்கவும்.

source: Enable the gate-fusion circuit optimization from the :class:`qiskit.providers.aer.QasmSimulator` in both the :class:`qiskit.providers.aer.StatevectorSimulator` and :class:`qiskit.providers.aer.UnitarySimulator` backends.
ta_in: வகுப்பு: `qiskit.providers.aer.StatevectorSimulator` மற்றும்: வகுப்பு:` qiskit.providers.aer.UnitarySimulator` பின்தளத்தில்: வகுப்பு: `qiskit.providers.aer.QasmSimulator` இலிருந்து கேட்-ஃப்யூஷன் சர்க்யூட் தேர்வுமுறையை இயக்கவும்.

source: Improve the performance of average snapshot data in simulator results. This effects probability, Pauli expectation value, and density matrix snapshots using the following extensions:
ta_in: சிமுலேட்டர் முடிவுகளில் சராசரி ஸ்னாப்ஷாட் தரவின் செயல்திறனை மேம்படுத்தவும். இது விளைவுகளின் நிகழ்தகவு, பவுலி எதிர்பார்ப்பு மதிப்பு மற்றும் அடர்த்தி மேட்ரிக்ஸ் ஸ்னாப்ஷாட்கள் பின்வரும் நீட்டிப்புகளைப் பயன்படுத்தி:

source: :class:`qiskit.providers.aer.extensions.SnapshotExpectationValue`
ta_in: : வகுப்பு: `கிஸ்கிட். வழங்குநர்கள்.ஏயர். நீட்டிப்புகள். ஸ்னாப்ஷாட் எதிர்பார்ப்பு மதிப்பு`

source: :class:`qiskit.providers.aer.extensions.SnapshotProbabilities`
ta_in: : வகுப்பு: `கிஸ்கிட். வழங்குநர்கள்.ஏயர். நீட்டிப்புகள். ஸ்னாப்ஷாட் எதிர்பார்ப்பு மதிப்பு`

source: :class:`qiskit.providers.aer.extensions.SnapshotDensityMatrix`
ta_in: : வகுப்பு: `qiskit.providers.aer.extensions.SnapshotDensityMatrix

source: Add move constructor and improve memory usage of the C++ matrix class to minimize copies of matrices when moving output of simulators into results.
ta_in: நடவடிக்கை உருவாக்கு மற்றும் C++ மாட்ரிக்ஸ் வகுப்பின் நினைவு பயன்பாட்டை மேம்படுத்துவதற்கு மாட்ரிகளின் நகல்களை சிறிது செய்யவும்.

source: Improve performance of unitary simulator.
ta_in: ஒருங்கிணைப்புச் செயல்திறன் செயற்பாடு.

source: Add approximation to the `"matrix_product_state"` simulation method of the :class:`~qiskit.providers.aer.QasmSimulator` to limit the bond-dimension of the MPS.
ta_in: ` "matrix_product_state" ` தனிப்பயன் முறையை :class:` ~ qiskkit.देगा ஏற்றுமதி முறைக்கு சேர். எம். எம். எஸ். QasmSimulator ` எம். எம். எஸ். எம்.

source: There are two modes of approximation. Both discard the smallest Schmidt coefficients following the SVD algorithm. There are two parameters that control the degree of approximation: ``"matrix_product_state_max_bond_dimension"`` (int): Sets a limit on the number of Schmidt coefficients retained at the end of the svd algorithm. Coefficients beyond this limit will be discarded. (Default: None, i.e., no limit on the bond dimension). ``"matrix_product_state_truncation_threshold"`` (double): Discard the smallest coefficients for which the sum of their squares is smaller than this threshold. (Default: 1e-16).
ta_in: தோராயமான இரண்டு முறைகள் உள்ளன. இருவரும் எஸ்.வி.டி வழிமுறையைப் பின்பற்றி மிகச்சிறிய ஷ்மிட் குணகங்களை நிராகரிக்கின்றனர். தோராயமான அளவைக் கட்டுப்படுத்தும் இரண்டு அளவுருக்கள் உள்ளன: `` "matrix_product_state_max_bond_dimension" `` (int): svd வழிமுறையின் முடிவில் தக்கவைக்கப்பட்ட ஷ்மிட் குணகங்களின் எண்ணிக்கையில் வரம்பை அமைக்கிறது. இந்த வரம்பைத் தாண்டிய குணகங்கள் நிராகரிக்கப்படும். (இயல்புநிலை: எதுவுமில்லை, அதாவது, பத்திர பரிமாணத்தில் வரம்பு இல்லை). `` "matrix_product_state_truncation_threshold" `` (இரட்டை): அவற்றின் சதுரங்களின் தொகை இந்த வாசலை விட சிறியதாக இருக்கும் மிகச்சிறிய குணகங்களை நிராகரிக்கவும். (இயல்புநிலை: 1e-16).

source: Improve the performance of measure sampling when using the `"matrix_product_state"` :class:`~qiskit.providers.aer.QasmSimulator` simulation method.
ta_in: " Matrix_product_state "`: வகுப்பு: `~ qiskit.providers.aer.QasmSimulator` உருவகப்படுத்துதல் முறையைப் பயன்படுத்தும் போது அளவீட்டு மாதிரியின் செயல்திறனை மேம்படுத்தவும்.

source: Add support for ``Delay``, ``Phase`` and ``SetPhase`` pulse instructions to the :class:`qiskit.providers.aer.PulseSimulator`.
ta_in: ``` தாமதம்``, `` கட்டம்`` மற்றும் `` செட்ஃபேஸ்`` துடிப்பு வழிமுறைகளுக்கு ஆதரவைச் சேர்க்கவும்: வகுப்பு: `qiskit.providers.aer.PulseSimulator.

source: Improve the performance of the :class:`qiskit.providers.aer.PulseSimulator` by caching calls to RHS function
ta_in: RHS செயல்பாட்டிற்கான அழைப்புகளை கேச் செய்வதன் மூலம்: வகுப்பின் செயல்திறனை மேம்படுத்தவும்: `qiskit.providers.aer.PulseSimulator`

source: Introduce alternate DE solving methods, specifiable through ``backend_options`` in the :class:`qiskit.providers.aer.PulseSimulator`.
ta_in: வகுப்பில் `` பின்தளத்தில்_ விருப்பங்கள்`` மூலம் குறிப்பிடக்கூடிய மாற்று DE தீர்க்கும் முறைகளை அறிமுகப்படுத்துங்கள்: `qiskit.providers.aer.PulseSimulator`.

source: Improve performance of simulator result classes by using move semantics and removing unnecessary copies that were happening when combining results from separate experiments into the final result object.
ta_in: வெப்பம் சிக்குறுத்தும் விளைவுகளைக் கொண்டு செயற்படும் வகுப்புகளைப் பயன்படுத்தி முடிவுகளின் விளைவுகளைக் கொண்டு இறுதியான விளைவுகளின் விளைவுகளைக் கொண்டு இறுதியாக நிகழ்கிறது.

source: Greatly improve performance of pybind11 conversion of simulator results by using move semantics where possible, and by moving vector and matrix results to Numpy arrays without copies.
ta_in: Greatly செயல்திறன் பைபிண்ட் 11 மாற்றத்திற்கான செயல்திறனை மேம்படுத்துவதால் நுழைவுகளின் முடிவுகளைக் கொண்டு செல்லுபடியாகும், மற்றும் நகரும் வெக்டர் மற்றும் மாட்ரிக்ஸ் முடிவுகளால் Numpy arrays to Numpy arrays to Numpy arrays.

source: Change the RNG engine for simulators from 32-bit Mersenne twister to 64-bit Mersenne twister engine.
ta_in: RNG இயந்திரத்தை 32-பிட் மெர்ஸ்விலிருந்து 64-பிட் மெர்ஸ்வின்ட் டிஸ்ரேட் இயந்திரத்தில் மாற்று.
