Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: Added ``ising/docplex.py`` for automatically generating Ising Hamiltonian from optimization models of DOcplex
ta_in: டாக்லெக்ஸின் தேர்வுமுறை மாதிரிகளிலிருந்து ஐசிங் ஹாமில்டோனியனை தானாக உருவாக்குவதற்கு ``ising / docplex.py`` சேர்க்கப்பட்டது

source: Added ``'basic-dirty-ancilla``' mode for ``mct``
ta_in: `` Mct`` க்கு `` 'basic-dirty-ancilla'`` பயன்முறை சேர்க்கப்பட்டது

source: Added ``mcmt`` for Multi-Controlled, Multi-Target gate
ta_in: மல்டி கண்ட்ரோல்ட், மல்டி-டார்கெட் கேட்டுக்கு `` mcmt`` சேர்க்கப்பட்டது

source: Exposed capabilities to generate circuits from logical AND, OR, DNF (disjunctive normal forms), and CNF (conjunctive normal forms) formulae
ta_in: தருக்க AND, OR, DNF (இடைவிடாத இயல்பான வடிவங்கள்) மற்றும் சி. என். எஃப் (ஒருங்கிணைந்த சாதாரண வடிவங்கள்) சூத்திரங்களிலிருந்து சுற்றுகளை உருவாக்குவதற்கான திறன்கள்

source: Added the capability to generate circuits from ESOP (exclusive sum of products) formulae with optional optimization based on Quine-McCluskey and ExactCover
ta_in: குயின்-மெக்ளஸ்கி மற்றும் எக்ஸாக்ட்கோவர் ஆகியவற்றை அடிப்படையாகக் கொண்ட விருப்ப தேர்வுமுறை கொண்ட ESOP (தயாரிப்புகளின் பிரத்யேக தொகை) சூத்திரங்களிலிருந்து சுற்றுகளை உருவாக்கும் திறனைச் சேர்த்தது

source: Added ``LogicalExpressionOracle`` for generating oracle circuits from arbitrary Boolean logic expressions (including DIMACS support) with optional optimization capability
ta_in: விருப்பமான தேர்வுமுறை திறனுடன் தன்னிச்சையான பூலியன் தர்க்க வெளிப்பாடுகளிலிருந்து (DIMACS ஆதரவு உட்பட) ஆரக்கிள் சுற்றுகளை உருவாக்குவதற்கு ``LogicalExpressionOracle`` சேர்க்கப்பட்டது

source: Added ``TruthTableOracle`` for generating oracle circuits from truth-tables with optional optimization capability
ta_in: விருப்ப தேர்வுமுறை திறனுடன் உண்மை அட்டவணையில் இருந்து ஆரக்கிள் சுற்றுகளை உருவாக்குவதற்கு `` TruthTableOracle`` சேர்க்கப்பட்டது

source: Added ``CustomCircuitOracle`` for generating oracle from user specified circuits
ta_in: பயனர் குறிப்பிட்ட சுற்றுகளிலிருந்து ஆரக்கிளை உருவாக்குவதற்கு `` CustomCircuitOracle`` சேர்க்கப்பட்டது

source: Added implementation of the Deutsch-Jozsa algorithm
ta_in: Deutsch-Jozsa வழிமுறையின் செயல்படுத்தல் சேர்க்கப்பட்டது

source: Added implementation of the Bernstein-Vazirani algorithm
ta_in: பெர்ன்ஸ்டைன்-வஜிராணி வழிமுறையின் செயல்பாட்டைச் சேர்த்தது

source: Added implementation of the Simon's algorithm
ta_in: சைமனின் வழிமுறையின் செயல்பாட்டைச் சேர்த்தது

source: Added implementation of the Shor's algorithm
ta_in: ஷோரின் வழிமுறையின் செயல்பாட்டைச் சேர்த்தது

source: Added optional capability for Grover's algorithm to take a custom initial state (as opposed to the default uniform superposition)
ta_in: ஒரு தனிப்பயன் ஆரம்ப நிலையை எடுக்கும் (முன்னிருப்பு அலுவலக சூப்பர்நிலைக்கு எதிராக)

source: Added capability to create a ``Custom`` initial state using existing circuit
ta_in: ஏற்கனவே உள்ள சாளரத்தை பயன்படுத்தி ` ` தனிப்பயன் ` ` ஆரம்ப நிலையை உருவாக்க இயலவில்லை

source: Added the ADAM (and AMSGRAD) optimization algorithm
ta_in: ADAM (மற்றும் AMSGRAD) தேர்வுமுறை வழிமுறை சேர்க்கப்பட்டது

source: Multivariate distributions added, so uncertainty models now have univariate and multivariate distribution components
ta_in: பன்முக விநியோகங்கள் சேர்க்கப்பட்டன, எனவே நிச்சயமற்ற மாதிரிகள் இப்போது ஒரே மாதிரியான மற்றும் பன்முக விநியோக கூறுகளைக் கொண்டுள்ளன

source: Added classical linear system solver ``ExactLSsolver``
ta_in: கூடுதலான நேர அமைப்பு அமைப்பு ` ` ExactLSsolver ` `

source: Added parameters ``auto_hermitian`` and ``auto_resize`` to ``HHL`` algorithm to support non-Hermitian and non :math:`2^n` sized matrices by default
ta_in: ஹெர்மிடியன் அல்லாத மற்றும் கணிதமற்றவர்களை ஆதரிப்பதற்காக `` எச்.எச்.எல்`` வழிமுறையில் `` ஆட்டோ_ஹெர்மிட்டியன்`` மற்றும் `` ஆட்டோ_ரசைஸ்`` அளவுருக்கள் சேர்க்கப்பட்டன: `2 ^ n` அளவிலான மெட்ரிக்குகள்

source: Added another feature map, ``RawFeatureVector``, that directly maps feature vectors to qubits' states for classification
ta_in: மற்றொரு அம்ச வரைபடத்தைச் சேர்த்துள்ளார், `` ராஃபீச்சர்வெக்டர்``, இது வகைப்படுத்தலுக்கான அம்ச திசையன்களை க்விட்ஸின் நிலைகளுக்கு நேரடியாக வரைபடமாக்குகிறது

source: ``SVM_Classical`` can now load models trained by ``QSVM``
ta_in: ` ` QSVM ` ` ` SVM_ Classical ` ` இப்போது பயிற்சி செய்யப்பட்ட மாதிரிகளை ஏற்ற முடியும்

source: Fixed ``ising/docplex.py`` to correctly multiply constant values in constraints
ta_in: Fixed ` `ising/docplex.py ` ` ` ` தவறான நிலையான மதிப்புகள் சரியாக மதிப்பிடப்பட்டுள்ளது

source: Fixed package setup to correctly identify namespace packages using ``setuptools.find_namespace_packages``
ta_in: `` Setuptools.find_namespace_packages`` ஐப் பயன்படுத்தி பெயர்வெளி தொகுப்புகளை சரியாக அடையாளம் காண நிலையான தொகுப்பு அமைப்பு

source: ``QuantumInstance`` does not take ``memory`` anymore.
ta_in: ``QuantumInstance`` இனி ``memory'` ஐ எடுக்காது.

source: Moved command line and GUI to separate repo (``qiskit_aqua_uis``)
ta_in: ரெப்போவை பிரிக்க கட்டளை வரி மற்றும் GUI ஐ நகர்த்தியது (`` qiskit_aqua_uis``)

source: Removed the ``SAT``-specific oracle (now supported by ``LogicalExpressionOracle``)
ta_in: `` SAT``- குறிப்பிட்ட ஆரக்கிள் அகற்றப்பட்டது (இப்போது `` LogicalExpressionOracle`` ஆல் ஆதரிக்கப்படுகிறது)

source: Changed ``advanced`` mode implementation of ``mct``: using simple ``h`` gates instead of ``ch``, and fixing the old recursion step in ``_multicx``
ta_in: `` Mct`` இன் `` மேம்பட்ட`` பயன்முறை செயல்படுத்தல் மாற்றப்பட்டது: `` ch`` க்கு பதிலாக எளிய `` h`` வாயில்களைப் பயன்படுத்துதல், மற்றும் `` _ மல்டிக்ஸ்`` இல் பழைய மறுநிகழ்வு படிநிலையை சரிசெய்தல்

source: Components ``random_distributions`` renamed to ``uncertainty_models``
ta_in: கூறுகள் `` சீரற்ற_விளையாடல்கள்```` நிச்சயமற்ற_ மாதிரிகள்` என மறுபெயரிடப்பட்டது

source: Reorganized the constructions of various common gates (``ch``, ``cry``, ``mcry``, ``mct``, ``mcu1``, ``mcu3``, ``mcmt``, ``logic_and``, and ``logic_or``) and circuits (``PhaseEstimationCircuit``, ``BooleanLogicCircuits``, ``FourierTransformCircuits``, and ``StateVectorCircuits``) under the ``circuits`` directory
ta_in: பல்வேறு பொதுவான வாயில்களின் கட்டுமானங்களை மறுசீரமைத்தது (`` சி``, `` அழ``, `` எம். சி. ஆர்``, `` எம். சி. டி``, `` எம். சி 1``, ​​`` எம். சி 3``, `` எம். சி. எம். டி``, `` லாஜிக்_ஆன்ட்``, மற்றும் `` லாஜிக்_அர்``) மற்றும் சுற்றுகள் (`` ஃபேஸ்எஸ்டிமேஷன் சர்க்யூட்``, `` பூலியன் லாஜிக் சர்க்யூட்ஸ்``, `` ஃபோரியர் டிரான்ஸ்ஃபார்ம் சர்க்யூட்ஸ்``, மற்றும் `` ஸ்டேட்வெக்டர் சர்க்யூட்ஸ்``)

source: Renamed the algorithm ``QSVMVariational`` to ``VQC``, which stands for Variational Quantum Classifier
ta_in: மாறுபட்ட குவாண்டம் வகைப்படுத்தியைக் குறிக்கும் `` QSVM மாறுபாடு`` என்ற வழிமுறையை `` VQC`` என மறுபெயரிட்டது

source: Renamed the algorithm ``QSVMKernel`` to ``QSVM``
ta_in: `` QSVMKernel`` என்ற வழிமுறையை `` QSVM`` என மறுபெயரிட்டது

source: Renamed the class ``SVMInput`` to ``ClassificationInput``
ta_in: `` எஸ். வி. எம். இன்புட்`` என்ற வகுப்பை `` கிளாசிஃபிகேஷன்இன்புட்`` என மறுபெயரிட்டது

source: Renamed problem type ``'svm_classification'`` to ``'classification'``
ta_in: மறுபெயரிடப்பட்ட சிக்கல் வகை `` 'svm_classification'`` முதல் ``' வகைப்பாடு`` வரை

source: Changed the type of ``entangler_map`` used in ``FeatureMap`` and ``VariationalForm`` to list of lists
ta_in: பட்டியல்களின் பட்டியலுக்கு `` அம்ச வரைபடம்`` மற்றும் `` மாறுபாட்டு வடிவம்`` ஆகியவற்றில் பயன்படுத்தப்படும் `` என்டாங்க்லர்_மாப்`` வகையை மாற்றியது

source: IBM Q Provider 0.1
ta_in: IBM Q வழங்குபவர் 0.1

source: This is the first release as a standalone package. If you are installing Terra standalone you'll also need to install the ``qiskit-ibmq-provider`` package with ``pip install qiskit-ibmq-provider`` if you want to use the IBM Q backends.
ta_in: இது ஒரு முழுமையான தொகுப்பாக முதல் வெளியீடாகும். நீங்கள் டெர்ரா தனித்தனியாக நிறுவுகிறீர்களானால், நீங்கள் ஐபிஎம் கியூ பின்தளத்தில் பயன்படுத்த விரும்பினால் `` கிஸ்கிட்-இப்மக்-வழங்குநர்`` தொகுப்பை `` பைப் நிறுவு கிஸ்கிட்-இப்மக்-வழங்குநர்`` உடன் நிறுவ வேண்டும்.

source: Support for non-Qobj format jobs has been removed from the provider. You'll have to convert submissions in an older format to Qobj before you can submit.
ta_in: Qobj வடிவமைப்பு பணிகளுக்கு ஆதரவு வழங்குபவர் இருந்து நீக்கப்பட்டது. நீங்கள் சமர்ப்பிக்கப்படுவதற்கு முன்பு Qobj க்கு ஒரு பழைய வடிவத்தில் உரிமையை மாற்ற வேண்டும்.

source: In Qiskit 0.8 we introduced the Qiskit Ignis element. It also includes the Qiskit Terra element 0.7.1 release which contains a bug fix for the BasicAer Python simulator.
ta_in: கிஸ்கிட் 0.8 இல் கிஸ்கிட் இக்னிஸ் உறுப்பை அறிமுகப்படுத்தினோம். இது கிஸ்கிட் டெர்ரா உறுப்பு 0.7.1 வெளியீட்டையும் உள்ளடக்கியது, இதில் பேசிக் ஏர் பைதான் சிமுலேட்டருக்கான பிழை திருத்தம் உள்ளது.

source: Terra 0.7
ta_in: டெரா 0. 7

source: Aer 0.1
ta_in: ஏர் 0.1

source: This is the first release of Qiskit Ignis.
ta_in: இது Qiskit இக்னிஸின் முதல் வெளியீடு.

source: In Qiskit 0.7 we introduced Qiskit Aer and combined it with Qiskit Terra.
ta_in: Qiskit 0.7 இல் நாம் Qiskit Aer அறிமுகப்படுத்தப்பட்டு Qiskit டெரா சேர்ந்தது.

source: This release includes several new features and many bug fixes. With this release the interfaces for circuit diagram, histogram, bloch vectors, and state visualizations are declared stable. Additionally, this release includes a defined and standardized bit order/endianness throughout all aspects of Qiskit. These are all declared as stable interfaces in this release which won't have breaking changes made moving forward, unless there is appropriate and lengthy deprecation periods warning of any coming changes.
ta_in: இந்த விடுதலை பல புதிய அம்சங்களையும் மற்றும் பல வழிப் படைப்புகளையும் உள்ளடக்குகிறது. இதன் மூலம் சுற்றுச்சூழல் வரைபடம், ஹிஸ்டோகிராம், பிளாக் வெக்டர்ஸ், மற்றும் மாநில விசைவுகளுக்கான இடைமுகங்கள் நிலையாக அறிவிக்கப்பட்டுள்ளன. கூடுதலாக இந்த விடுதலை ஒரு வரையறுக்கப்பட்ட மற்றும் நிலையான பிட் கோட்பாடு /endianness முழுவதும் Qiskit ஆகியவற்றை உள்ளடக்குகிறது. இவை அனைத்தும் இந்த விடுதலையில் நிலையான இடைமுகங்கள் என அறிவிக்கப்பட்டுள்ளன, இது எந்த மாற்றங்களையும் முன்னேற்றம் செய்கிறது.

source: There is also the introduction of the following new features:
ta_in: பின்வரும் புதிய அம்சங்களின் அறிமுகம் உள்ளது:

source: A new ASCII art circuit drawing output mode
ta_in: புதிய ASCII கலை சுற்றுப்பாதை வெளியீட்டு முறைமை

source: A new circuit drawing interface off of ``QuantumCircuit`` objects that enables calls of ``circuit.draw()`` or ``print(circuit)`` to render a drawing of circuits
ta_in: `` குவாண்டம் சிர்க்யூட்`` பொருள்களின் புதிய சர்க்யூட் வரைதல் இடைமுகம், `` சர்க்யூட் டிரா () `` அல்லது `` அச்சு (சுற்று) `` அழைப்புகளைச் செயல்படுத்துகிறது

source: A visualizer for drawing the DAG representation of a circuit
ta_in: ஒரு சுற்றுவட்டத்தின் DAG பிரதிநிதித்துவத்தை வரைவதற்கான ஒரு காட்சிப்படுத்தல்

source: A new quantum state plot type for hinton diagrams in the local matplotlib based state plots
ta_in: உள்ளூர் மேட்லோட்லிப் அடிப்படையிலான மாநில அடுக்குகளில் உள்ள ஹிண்டன் வரைபடங்களுக்கான புதிய குவாண்டம் மாநில சதி வகை

source: 2 new constructor methods off the ``QuantumCircuit`` class ``from_qasm_str()`` and ``from_qasm_file()`` which let you easily create a circuit object from OpenQASM
ta_in: `` குவாண்டம் சர்க்யூட்`` வகுப்பிலிருந்து ``_காஸ்ம்_ஸ்ட்ர் ()` `மற்றும்` `ஃப்ரம்_காஸ்ம்_ஃபைல் ()` `ஆகியவற்றிலிருந்து 2 புதிய கட்டமைப்பாளர் முறைகள், இது OpenQASM இலிருந்து ஒரு சுற்று பொருளை எளிதாக உருவாக்க உங்களை அனுமதிக்கிறது

source: A new function ``plot_bloch_multivector()`` to plot Bloch vectors from a tensored state vector or density matrix
ta_in: ஒரு புதிய செயல்பாடு `` plot_bloch_multivector () `` ஒரு பதற்றமான மாநில திசையன் அல்லது அடர்த்தி மேட்ரிக்ஸிலிருந்து ப்ளொச் திசையன்களைத் திட்டமிட

source: Per-shot measurement results are available in simulators and select devices. These can be accessed by setting the ``memory`` kwarg to ``True`` when calling ``compile()`` or ``execute()`` and then accessed using the ``get_memory()`` method on the ``Result`` object.
ta_in: ஒவ்வொரு ஷாட் அளவீட்டு முடிவுகள் சிமுலேட்டர்கள் மற்றும் தேர்ந்தெடுக்கப்பட்ட சாதனங்களில் கிடைக்கின்றன. `` தொகுத்தல் () `` அல்லது `` செயல்படுத்து () `` என்று அழைக்கும் போது `` மெமரி`` குவார்க்கை `` உண்மை`` என அமைப்பதன் மூலம் அணுகலாம், பின்னர் `` get_memory () `` முறையைப் பயன்படுத்தி அணுகலாம். `` முடிவு`` பொருள்.

source: A ``qiskit.quantum_info`` module with revamped Pauli objects and methods for working with quantum states
ta_in: புதுப்பிக்கப்பட்ட பவுலி பொருள்கள் மற்றும் குவாண்டம் நிலைகளுடன் பணிபுரியும் முறைகள் கொண்ட `` qiskit.quantum_info`` தொகுதி

source: New transpile passes for circuit analysis and transformation: ``CommutationAnalysis``, ``CommutationTransformation``, ``CXCancellation``, ``Decompose``, ``Unroll``, ``Optimize1QGates``, ``CheckMap``, ``CXDirection``, ``BarrierBeforeFinalMeasurements``
ta_in: சுற்று பகுப்பாய்வு மற்றும் மாற்றத்திற்கான புதிய டிரான்ஸ்பைல் பாஸ்கள்: `` கம்யூட்டேஷன் அனலிசிஸ்``, `` கம்யூட்டேஷன் டிரான்ஸ்ஃபார்மேஷன்``, `` சி. எக்ஸ் ரத்துசெய்தல்``, `` சிதைவு``, `` அன்ரோல்``, `` ஆப்டிமைஸ் 1 கியூட்ஸ்``, `` செக்மேப்``. , `` சி .எக்ஸ் டைரக்ஷன்``, `` பேரியர் பீஃபர்ஃபைனல் மெஷர்மென்ட்ஸ்``

source: New alternative swap mapper passes in the transpiler: ``BasicSwap``, ``LookaheadSwap``, ``StochasticSwap``
ta_in: டிரான்ஸ்பைலரில் புதிய மாற்று இடமாற்று மேப்பர் கடந்து செல்கிறது: `` பேசிக் ஸ்வாப்``, `` லுக்ஹெட் ஸ்வாப்``, `` ஸ்டோகாஸ்டிக் ஸ்வாப்``

source: More advanced transpiler infrastructure with support for analysis passes, transformation passes, a global ``property_set`` for the pass manager, and repeat-until control of passes
ta_in: மேலும் முன்னேற்றக் கூடுதலான தன்மைகள் ஆய்வுகளுக்கான ஆதரவுடன், மாற்றம் கடந்து, ஒரு உலகளாவிய ` ` வளைவு அமைப்பு ` ` கடவுச்சொல் நிர்வாகி, மற்றும் மீண்டும்-செல்வதற்கு கட்டுப்பாட்டை வரை

source: As part of the 0.7 release the following things have been deprecated and will either be removed or changed in a backwards incompatible manner in a future release. While not strictly necessary these are things to adjust for before the next release to avoid a breaking change.
ta_in: 0.7 வெளியீட்டின் ஒரு பகுதியாக பின்வரும் விஷயங்கள் நீக்கப்பட்டன, மேலும் அவை எதிர்கால வெளியீட்டில் அகற்றப்படும் அல்லது பின்னோக்கி பொருந்தாத வகையில் மாற்றப்படும். கண்டிப்பாக அவசியமில்லை என்றாலும், அடுத்த வெளியீட்டிற்கு முன்னர் சரிசெய்ய வேண்டிய விஷயங்கள் முறிந்த மாற்றத்தைத் தவிர்க்கின்றன.

source: ``plot_circuit()``, ``latex_circuit_drawer()``, ``generate_latex_source()``, and ``matplotlib_circuit_drawer()`` from qiskit.tools.visualization are deprecated. Instead the ``circuit_drawer()`` function from the same module should be used, there are kwarg options to mirror the functionality of all the deprecated functions.
ta_in: `` plot_circuit () ``, `` latex_circuit_drawer () ``, `` generate_latex_source () ``, மற்றும் `` matplotlib_circuit_drawer () `` qiskit.tools.visualization இலிருந்து நீக்கப்படும். அதற்கு பதிலாக, ஒரே தொகுதியிலிருந்து `` சர்க்யூட்_ டிராவர் () `` செயல்பாடு பயன்படுத்தப்பட வேண்டும், நீக்கப்பட்ட அனைத்து செயல்பாடுகளின் செயல்பாட்டையும் பிரதிபலிக்க குவார்க் விருப்பங்கள் உள்ளன.

source: The current default output of ``circuit_drawer()`` (using latex and falling back on python) is deprecated and will be changed to just use the ``text`` output by default in future releases.
ta_in: தற்போதைய முன்னிருப்பு வெளியீடு ` ` சுற்றுச்சூழல் அலங்காரம் () ` ` (latex மற்றும் பைலோன் மீண்டும் பின்பற்றுவதை பயன்படுத்தி) ` ` உரை ` ` வெளியீட்டை எதிர்காண வெளியீட்டில் முன்னிருப்பாக பயன்படுத்த மாற்றப்படும்.

source: The ``qiskit.wrapper.load_qasm_string()`` and ``qiskit.wrapper.load_qasm_file()`` functions are deprecated and the ``QuantumCircuit.from_qasm_str()`` and ``QuantumCircuit.from_qasm_file()`` constructor methods should be used instead.
ta_in: `` Qiskit.wrapper.load_qasm_string () `` மற்றும் `` qiskit.wrapper.load_qasm_file () `` செயல்பாடுகள் நீக்கப்பட்டன மற்றும் `` QuantumCircuit.from_qasm_str () `` மற்றும் `` QuantumCircuit.from_qasm_) அதற்கு பதிலாக பயன்படுத்தப்பட வேண்டும்.

source: The ``plot_barriers`` and ``reverse_bits`` keys in the ``style`` kwarg dictionary are deprecated, instead the ``qiskit.tools.visualization.circuit_drawer()`` kwargs ``plot_barriers`` and ``reverse_bits`` should be used instead.
ta_in: `` ஸ்டைல்`` குவார்க் அகராதியில் உள்ள `` சதி_ தடைகள்`` மற்றும் `` தலைகீழ்_பிட்ஸ்`` விசைகள் நீக்கப்பட்டன, அதற்கு பதிலாக `` qiskit.tools.visualization.circuit_drawer () `` குவார்க்ஸ் `` சதி_ தடைகள்` மற்றும் `` தலைகீழ்_பிட்கள் `` அதற்கு பதிலாக பயன்படுத்தப்பட வேண்டும்.

source: The functions ``plot_state()`` and ``iplot_state()`` have been depreciated. Instead the functions ``plot_state_*()`` and ``iplot_state_*()`` should be called for the visualization method required.
ta_in: அவர் செயல்படுகிறார் `` சதி_நிலையம் () `` மற்றும் `` iplot_state () `` தேய்மானம் செய்யப்பட்டுள்ளது. அதற்கு பதிலாக `` சதி_நிலையம் _ * () `` மற்றும் `` iplot_state _ * () `` செயல்பாடுகளை தேவையான காட்சிப்படுத்தல் முறைக்கு அழைக்க வேண்டும்.

source: The ``skip_transpiler`` argument has been deprecated from ``compile()`` and ``execute()``. Instead you can use the ``PassManager`` directly, just set the ``pass_manager`` to a blank ``PassManager`` object with ``PassManager()``
ta_in: `` ஸ்கிப்_ டிரான்ஸ்பைலர்`` வாதம் `` தொகுத்தல் () `` மற்றும் `` செயல்படுத்து () `` ஆகியவற்றிலிருந்து நீக்கப்பட்டது. அதற்கு பதிலாக நீங்கள் `` பாஸ் மேனேஜர்`` ஐ நேரடியாகப் பயன்படுத்தலாம், `` பாஸ் மேனேஜர்`` ஐ வெற்று `` பாஸ் மேனேஜர்`` பொருளை `பாஸ்மேனேஜர் ()` `உடன் அமைக்கவும்

source: The ``transpile_dag()`` function ``format`` kwarg for emitting different output formats is deprecated, instead you should convert the default output ``DAGCircuit`` object to the desired format.
ta_in: வெவ்வேறு வெளியீட்டு வடிவங்களை வெளியிடுவதற்கான `` டிரான்ஸ்பைல்_டாக் () `` செயல்பாடு `` வடிவம்`` குவார்க் நீக்கப்பட்டது, அதற்கு பதிலாக நீங்கள் இயல்புநிலை வெளியீட்டை `` DAGCircuit`` பொருளை விரும்பிய வடிவத்திற்கு மாற்ற வேண்டும்.

source: The unrollers have been deprecated, moving forward only DAG to DAG unrolling will be supported.
ta_in: அன்ரோலர்கள் நீக்கப்பட்டன, DAG க்கு DAG ஐ மட்டுமே முன்னோக்கி நகர்த்துவது ஆதரிக்கப்படும்.

source: Please note that some backwards-incompatible changes have been made during this release. The following notes contain information on how to adapt to these changes.
ta_in: இந்த விடுதலை போது சில பின்னணி மாற்றங்கள் செய்யப்பட்டுள்ளது என்று குறிப்பிடுக. பின்வரும் குறிப்புகள் இந்த மாற்றங்களை எப்படி ஏற்றுக்கொள்ளும் எப்படி தகவல்களை கொண்டுள்ளது.

source: Changes to Result objects
ta_in: முடிவு பொருள்களுக்கான மாற்றங்கள்

source: As part of the rewrite of the Results object to be more consistent and a stable interface moving forward a few changes have been made to how you access the data stored in the result object. First the ``get_data()`` method has been renamed to just ``data()``. Accompanying that change is a change in the data format returned by the function. It is now returning the raw data from the backends instead of doing any post-processing. For example, in previous versions you could call::
ta_in: முடிவடைந்த பொருளின் மீண்டும் எழுதப் பொருளின் பகுதியாக மற்றும் ஒரு நிலையான இடைமுகம் முன்னேறும் ஒரு நிலையான இடைமுகம், நீங்கள் விளைவு பொருளில் சேமிக்கப்பட்ட தரவுகளை எப்படி அணுக வேண்டும். முதலில் ` ` gget_data () ` முறையை ` தரவு () ` ` தரவு () ` ` ` `. ஒப்பந்தம் (`) ` ` என்று மாற்றியமைக்கப்பட்டுள்ளது. இது இப்போது எந்த பதவி-செயல்திறனை செய்யும் அதற்கு பதிலாக பின்னூட்டத்திலிருந்து முழு தகவல்கள் திரும்ப வருகின்றது. உதாரணமாக, முந்தைய பதிப்பில் நீங்கள் அழைக்க முடியும்::

source: and that would return the unitary matrix like::
ta_in: அது:: போன்ற ஒற்றையாட்சி அணியைத் தரும்::

source: But now if you call (with the renamed method)::
ta_in: ஆனால் இப்போது நீங்கள் அழைத்தால் (மறுபெயரிடப்பட்ட முறையுடன்)::

source: it will return something like::
ta_in: இது போன்ற ஒன்றைத் தரும்::

source: To get the post processed results in the same format as before the 0.7 release you must use the ``get_counts()``, ``get_statevector()``, and ``get_unitary()`` methods on the result object instead of ``get_data()['counts']``, ``get_data()['statevector']``, and ``get_data()['unitary']`` respectively.
ta_in: இடுகை செயலாக்கப்பட்ட முடிவுகளை 0.7 வெளியீட்டிற்கு முந்தைய வடிவத்தில் பெற நீங்கள் முடிவு பொருளுக்குப் பதிலாக `` get_counts () ``, `` get_statevector () ``, மற்றும் `` get_unitary () `` முறைகளைப் பயன்படுத்த வேண்டும். `` get_data () ['எண்ணிக்கைகள்'] ``, `` get_data () ['ஸ்டேட்வெக்டர்'] ``, மற்றும் `` get_data () ['ஒற்றையாட்சி'] `` முறையே.

source: Additionally, support for ``len()`` and indexing on a ``Result`` object has been removed. Instead you should deal with the output from the post processed methods on the Result objects.
ta_in: கூடுதலாக, `` len () `` க்கான ஆதரவு மற்றும் `` Result`` பொருளின் அட்டவணைப்படுத்தல் நீக்கப்பட்டன. அதற்கு பதிலாக நீங்கள் முடிவு பொருள்களில் இடுகையிடப்பட்ட செயலாக்க முறைகளின் வெளியீட்டைக் கையாள வேண்டும்.

source: Also, the ``get_snapshot()`` and ``get_snapshots()`` methods from the ``Result`` class have been removed. Instead you can access the snapshots using ``Result.data()['snapshots']``.
ta_in: மேலும், ``get_snapshot () `` மற்றும் ``get_snapshots ()`` முறைகள் ``Result`` வகுப்பிலிருந்து நீக்கப்பட்டன. அதற்கு பதிலாக நீங்கள் ``Result.data()['snapshots']`` ஐப் பயன்படுத்தி ஸ்னாப்ஷாட்களை அணுகலாம்.

source: Changes to Visualization
ta_in: காட்சிப்படுத்தல் மாற்றங்கள்

source: The largest change made to visualization in the 0.7 release is the removal of Matplotlib and other visualization dependencies from the project requirements. This was done to simplify the requirements and configuration required for installing Qiskit. If you plan to use any visualizations (including all the jupyter magics) except for the ``text``, ``latex``, and ``latex_source`` output for the circuit drawer you'll you must manually ensure that the visualization dependencies are installed. You can leverage the optional requirements to the Qiskit Terra package to do this::
ta_in: 0.7 வெளியீட்டில் காட்சிப்படுத்தலில் செய்யப்பட்ட மிகப்பெரிய மாற்றம், திட்டத் தேவைகளிலிருந்து மேட்லோட்லிப் மற்றும் பிற காட்சிப்படுத்தல் சார்புகளை நீக்குவதாகும். Qiskit ட்டை நிறுவ தேவையான தேவைகள் மற்றும் உள்ளமைவை எளிதாக்குவதற்காக இது செய்யப்பட்டது. சர்க்யூட் டிராயருக்கான ``text``, ``latex``, and மற்றும் ``latex_source`` வெளியீட்டைத் தவிர வேறு எந்த காட்சிப்படுத்தல்களையும் (அனைத்து ஜூபிட்டர் மந்திரவாதிகள் உட்பட) பயன்படுத்த திட்டமிட்டால், நீங்கள் காட்சிப்படுத்தலை கைமுறையாக உறுதி செய்ய வேண்டும் சார்புகள் நிறுவப்பட்டுள்ளன. இதைச் செய்ய நீங்கள் கிஸ்கிட் டெர்ரா தொகுப்புக்கு விருப்பத் தேவைகளைப் பயன்படுத்தலாம்::

source: Aside from this there have been changes made to several of the interfaces as part of the stabilization which may have an impact on existing code. The first is the ``basis`` kwarg in the ``circuit_drawer()`` function is no longer accepted. If you were relying on the ``circuit_drawer()`` to adjust the basis gates used in drawing a circuit diagram you will have to do this priort to calling ``circuit_drawer()``. For example::
ta_in: இது ஒருபுறம் இருக்க, உறுதிப்படுத்தலின் ஒரு பகுதியாக பல இடைமுகங்களில் மாற்றங்கள் செய்யப்பட்டுள்ளன, அவை ஏற்கனவே உள்ள குறியீட்டில் தாக்கத்தை ஏற்படுத்தக்கூடும். முதலாவது ``circuit_drawer()`` செயல்பாட்டில் உள்ள ``basis`` குவார்க் இனி ஏற்றுக்கொள்ளப்படாது. ஒரு சுற்று வரைபடத்தை வரைவதற்குப் பயன்படுத்தப்படும் அடிப்படை வாயில்களை சரிசெய்ய நீங்கள் ``circuit_drawer()`` ஐ நம்பியிருந்தால், ``circuit_drawer()`` என்று அழைப்பதற்கு இதை நீங்கள் செய்ய வேண்டும். உதாரணத்திற்கு::

source: will have to be adjusted to be::
ta_in: ஆக இருக்க வேண்டும்::
