Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: A new color scheme, ``iqx``, has been added to the ``mpl`` backend for the circuit drawer :func:`qiskit.visualization.circuit_drawer` and :meth:`qiskit.circuit.QuantumCircuit.draw`. This uses the same color scheme as the Circuit Composer on the IBM Quantum Experience website. There are now 3 available color schemes - ``default``, ``iqx``, and ``bw``.
ta_in: சர்க்யூட் டிராயருக்கான `` mpl`` பின்தளத்தில் `` iqx`` என்ற புதிய வண்ணத் திட்டம் சேர்க்கப்பட்டுள்ளது :func: `qiskit.visualization.circuit_drawer` மற்றும் :meth:` qiskit.circuit.QuantumCircuit.draw`. இது ஐபிஎம் குவாண்டம் எக்ஸ்பீரியன்ஸ் இணையதளத்தில் சர்க்யூட் அ மைப்பாளரின் அதே வண்ணத் திட்டத்தைப் பயன்படுத்துகிறது. இப்போது 3 வண்ணத் திட்டங்கள் உள்ளன - `` இயல்புநிலை``, `` iqx``, மற்றும் `` bw``.

source: There are two ways to select a color scheme. The first is to use a user config file, by default in the ``~/.qiskit`` directory, in the file ``settings.conf`` under the ``[Default]`` heading, a user can enter ``circuit_mpl_style = iqx`` to select the ``iqx`` color scheme.
ta_in: வண்ணத் திட்டத்தைத் தேர்ந்தெடுக்க இரண்டு வழிகள் இங்கே. முதலாவது, பயன்படுத்துபவர் உள்ளமைவு கோப்பைப் பயன்படுத்துவது, இரண்டாவதாக `` ~ /.qiskit`` கோப்பகத்தில், `` [Default] `` தலைப்பின் கீழ் `` settings.conf`` கோப்பில், பயன்படுத்துபவர் உள்ளிடலாம் ` `` iqx`` வண்ணத் திட்டத்தைத் தேர்ந்தெடுக்க `circ_mpl_style = iqx``.பயன்படுத்தலாம்.

source: The second way is to add ``{'name': 'iqx'}`` to the ``style`` kwarg to the ``QuantumCircuit.draw`` method or to the ``circuit_drawer`` function. The second way will override the setting in the settings.conf file. For example:
ta_in: இரண்டாவது வழி ``{'name': 'iqx'}`` ``style`` குவார்க்கில் ``QuantumCircuit.draw`` முறைக்கு அல்லது `` சர்க்யூட்_ டிராயர்`` செயல்பாட்டில் சேர்ப்பது. இரண்டாவது வழி settings.conf கோப்பில் உள்ள அமைப்பை மேலெழுதும். உதாரணத்திற்கு:

source: In the ``style`` kwarg for the the circuit drawer :func:`qiskit.visualization.circuit_drawer` and :meth:`qiskit.circuit.QuantumCircuit.draw` the ``displaycolor`` field with the ``mpl`` backend now allows for entering both the gate color and the text color for each gate type in the form ``(gate_color, text_color)``. This allows the use of light and dark gate colors with contrasting text colors. Users can still set only the gate color, in which case the ``gatetextcolor`` field will be used. Gate colors can be set in the ``style`` dict for any number of gate types, from one to the entire ``displaycolor`` dict. For example:
ta_in: சர்க்யூட் டிராயருக்கான `` ஸ்டைல்`` குவார்க்கில் :func: `qiskit.visualization.circuit_drawer` மற்றும் :meth:` qiskit.circuit.QuantumCircuit.dra`` `` டிஸ்ப்ளாக்கலர்`` புலத்தை `` எம்.பி.எல்`` பின்தளத்தில் இப்போது கேட் வண்ணம் மற்றும் ஒவ்வொரு கேட் வகைக்கும் உரை வண்ணம் இரண்டையும் `` (கேட்_ கலர், உரை_ வண்ணம்) `` வடிவத்தில் உள்ளிட அனுமதிக்கிறது. மாறுபட்ட உரை வண்ணங்களுடன் ஒளி மற்றும் இருண்ட வாயில் வண்ணங்களைப் பயன்படுத்த இது அனுமதிக்கிறது. பயனர்கள் இன்னும் கேட் நிறத்தை மட்டுமே அமைக்க முடியும், இந்நிலையில் `` கேடெக்ஸ்ட் கலர்`` புலம் பயன்படுத்தப்படும். கேட் வண்ணங்களை எந்தவொரு கேட் வகைகளுக்கும் `` ஸ்டைல்`` டிக்டில் அமைக்கலாம், ஒன்று முதல் முழு `டிஸ்ப்ளே கலர்`` டிக்ட் வரை. உதாரணத்திற்கு:

source: or
ta_in: அல்லது

source: Two alignment contexts are added to the pulse builder (:mod:`qiskit.pulse.builder`) to facilitate writing a repeated pulse sequence with delays.
ta_in: தாமதங்களுடன் மீண்டும் மீண்டும் துடிப்பு வரிசையை எழுதுவதற்கு வசதியாக துடிப்பு கட்டடத்தில் (: mod: `qiskit.pulse.builder`) இரண்டு சீரமைப்பு சூழல்கள் சேர்க்கப்படுகின்றன.

source: :func:`qiskit.pulse.builder.align_equispaced` inserts delays with equivalent length in between pulse schedules within the context.
ta_in: func: `qiskit.pulse.builder.align_equispaced` சூழலில் துடிப்பு அட்டவணைகளுக்கு இடையில் சம நீளத்துடன் தாமதங்களை செருகும்.

source: :func:`qiskit.pulse.builder.align_func` offers more advanced control of pulse position. This context takes a callable that calculates a fractional coordinate of i-th pulse and aligns pulses within the context. This makes coding of dynamical decoupling easy.
ta_in: : func: `qiskit.pulse.builder.align_func` துடிப்பு நிலையின் மேம்பட்ட கட்டுப்பாட்டை வழங்குகிறது. இந்த சூழல் ஐ-வது துடிப்பின் ஒரு பகுதியளவு ஒருங்கிணைப்பைக் கணக்கிட்டு, சூழலுக்குள் பருப்புகளை சீரமைக்கக்கூடிய ஒரு அழைப்பை எடுக்கிறது. இது டைனமிகல் டிகூப்பிளிங்கின் குறியீட்டை எளிதாக்குகிறது.

source: A ``rep_delay`` parameter has been added to the :class:`~qiskit.qobj.QasmQobj` class under the run configuration, :class:`~qiskit.qobj.QasmQobjConfig`. This parameter is used to denote the time between program executions. It must be chosen from the backend range given by the :class:`~qiskit.providers.models.BackendConfiguration` method :meth:`~qiskit.providers.models.BackendConfiguration.rep_delay_range`. If a value is not provided a backend default, :attr:`qiskit.providers.models.BackendConfiguration.default_rep_delay`, will be used. ``rep_delay`` will only work on backends which allow for dynamic repetition time. This is can be checked with the :class:`~qiskit.providers.models.BackendConfiguration` property :attr:`~qiskit.providers.models.BackendConfiguration.dynamic_reprate_enabled`.
ta_in: ரன் உள்ளமைவின் கீழ்: வகுப்பு: `~ qiskit.qobj.QasmQobj` வகுப்பில்` `rep_delay`` அளவுரு சேர்க்கப்பட்டுள்ளது ,: வகுப்பு:` ~ qiskit.qobj.QasmQobjConfig`. நிரல் செயலாக்கங்களுக்கு இடையிலான நேரத்தைக் குறிக்க இந்த அளவுரு பயன்படுத்தப்படுகிறது. வகுப்பு: `~ qiskit.providers.models.BackendConfiguration` முறை: மெத்:` ~ qiskit.providers.models.BackendConfiguration.rep_delay_range` வழங்கிய பின்தளத்தில் இருந்து இது தேர்ந்தெடுக்கப்பட வேண்டும். ஒரு மதிப்பு பின்தளத்தில் இயல்புநிலையாக வழங்கப்படாவிட்டால் ,: attr: `qiskit.providers.models.BackendConfiguration.default_rep_delay`, பயன்படுத்தப்படும். `` rep_delay`` என்பது பின்தளத்தில் மட்டுமே செயல்படும், இது மாறும் மறுபடியும் நேரத்தை அனுமதிக்கும். இதை: class: `~ qiskit.providers.models.BackendConfiguration` property: attr:` ~ qiskit.providers.models.BackendConfiguration.dynamic_reprate_enabled` உடன் இதைச் சரிபார்க்கலாம்.

source: The ``qobj_schema.json`` JSON Schema file in :mod:`qiskit.schemas` has been updated to include the ``rep_delay`` as an optional configuration property for QASM Qobjs.
ta_in: `` qobj_schema.json`` இன் JSON ஸ்கீமா கோப்பு: mod: `qiskit.schemas` QASM Qobj களுக்கான விருப்ப உள்ளமைவு சொத்தாக` `rep_delay`` ஐ சேர்க்க புதுப்பிக்கப்பட்டுள்ளது.

source: The ``backend_configuration_schema.json`` JSON Schema file in :mod:`qiskit.schemas` has been updated to include ``dynamic_reprate_enabled``, ``rep_delay_range`` and ``default_rep_delay`` as optional properties for a QASM backend configuration payload.
ta_in: `` பின்தளத்தில்_அமைவு_ஸ்கீமா .ஜ்சன்`` இந்த ஜ்சன் திட்ட கோப்பு: mod: `qiskit.schemas` ஒரு QASM பின்தளத்தில் உள்ளமைவுக்கான விருப்ப பண்புகளாக` `டைனமிக்_ரெபரேட்_எனபிள்``,` `ரெப்_டேலே_ரேஞ்ச்`` மற்றும்` `இயல்புநிலை_ரெப்_டேலே`` ஆகியவற்றைச் சேர்க்க புதுப்பிக்கப்பட்டுள்ளது. பேலோட்.

source: A new optimization pass, :class:`qiskit.transpiler.passes.TemplateOptimization` has been added to the transpiler. This pass applies a template matching algorithm described in `arXiv:1909.05270 <https://arxiv.org/pdf/1909.05270.pdf>`__ that replaces all compatible maximal matches in the circuit.
ta_in: ஒரு புதிய ஒப்பீட்டை கடந்து, :class:` qiskit.transpiler.passes.TemplateOptimization `. இந்த கடவுச்சொல் ` arXiv: 1909.05270 <https://arxiv.org/pdf/1909.05270.pdf>` _ (_) சுற்றுப்பாதையில் அனைத்து பொருத்தமான அதிகபட்ச போட்டிகளையும், ` arXiv: 1909.05270 <https://arxiv.org/pdf/1909.05270.pdf> ` (_) இல் விவரிக்கும் ஒரு வார்ப்புருவை பயன்படுத்துகிறது.

source: To implement this new transpiler pass a new module, ``template_circuits``, was added to the circuit library (:mod:`qiskit.circuit.library`). This new module contains all the Toffoli circuit templates used in the :class:`~qiskit.transpiler.passes.TemplateOptimization`.
ta_in: இந்த புதிய மின்சாரத்தை செயற்படுத்துவதற்கு ஒரு புதிய கூறு, ` ` template_circuits ` `, சேகரிப்பு நூலகத்துக்கு சேர்க்கப்பட்டது (:mod:` qiskit.circuit.library `). This new module contains all the Toffoli circuit templates used in the :class:` ~ qiskit.transpiler.passes.TemplateOptimization `.

source: This new pass is **not** currently included in the preset pass managers (:mod:`qiskit.transpiler.preset_passmanagers`), to use it you will need to create a custom :class:`~qiskit.transpiler.PassManager`.
ta_in: இந்த புதிய பாஸ் தற்போது முன்னமைக்கப்பட்ட பாஸ் மேலாளர்களில் சேர்க்கப்படவில்லை (:mod: `qiskit.transpiler.preset_passmanagers`), இதைப் பயன்படுத்த நீங்கள் ஒரு தனிப்பயனை உருவாக்க வேண்டும்:class:` ~ qiskit.transpiler.PassManager` .

source: A new version of the providers interface has been added. This new interface, which can be found in :mod:`qiskit.providers`, provides a new versioning mechanism that will enable changes to the interface to happen in a compatible manner over time. The new interface should be simple to migrate existing providers, as it is mostly identical except for the explicit versioning.
ta_in: வழங்குநர்கள் இடைமுகத்தின் புதிய பதிப்பு சேர்க்கப்பட்டது. இந்த புதிய இடைமுகம்: mod: `qiskit.providers` இல் காணப்படுகிறது, இது ஒரு புதிய பதிப்பு பொறிமுறையை வழங்குகிறது, இது இடைமுகத்தில் மாற்றங்களை காலப்போக்கில் இணக்கமான முறையில் நடக்க உதவும். புதிய இடைமுகம் ஏற்கனவே உள்ள வழங்குநர்களை நகர்த்துவதற்கு எளிமையாக இருக்க வேண்டும், ஏனெனில் இது வெளிப்படையான பதிப்பைத் தவிர பெரும்பாலும் ஒரே மாதிரியாக இருக்கும்.

source: Besides having explicitly versioned abstract classes the key changes for the new interface are that the :class:`~qiskit.providers.BackendV1` method :meth:`~qiskit.providers.BackendV1.run` can now take a :class:`~qiskit.circuits.QuantumCircuit` or :class:`~qiskit.pulse.Schedule` object as inputs instead of ``Qobj`` objects. To go along with that options are now part of a backend class so that users can configure run time options when running with a circuit. The final change is that :class:`qiskit.providers.JobV1` can now be synchronous or asynchronous, the exact configuration and method for configuring this is up to the provider, but there are interface hook points to make it explicit which execution model a job is running under in the ``JobV1`` abstract class.
ta_in: வெளிப்படையாக பதிப்பு செய்யப்பட்ட சுருக்க வகுப்புகளைத் தவிர, புதிய இடைமுகத்திற்கான முக்கிய மாற்றங்கள்: வர்க்கம்: `~ qiskit.providers.BackendV1` முறை: மெத்:` ~ qiskit.providers.BackendV1.run` இப்போது ஒரு: வகுப்பு: `~ qiskit.circuits.QuantumCircuit` அல்லது: class: `~ qiskit.pulse.Schedule` பொருள்` `Qobj`` பொருட்களுக்கு பதிலாக உள்ளீடுகளாக. அந்த விருப்பங்களுடன் செல்ல இப்போது ஒரு பின்தளத்தில் வகுப்பின் ஒரு பகுதியாக உள்ளது, இதனால் பயனர்கள் ஒரு சுற்றுடன் இயங்கும் போது இயக்க நேர விருப்பங்களை உள்ளமைக்க முடியும். இறுதி மாற்றம் என்னவென்றால்: வர்க்கம்: `qiskit.providers.JobV1` இப்போது ஒத்திசைவாக அல்லது ஒத்திசைவற்றதாக இருக்கலாம், இதை உள்ளமைப்பதற்கான சரியான உள்ளமைவு மற்றும் முறை வழங்குநரிடம் உள்ளது, ஆனால் எந்த மரணதண்டனை மாதிரியை வெளிப்படையாக வெளிப்படுத்த இடைமுக ஹூக் புள்ளிகள் உள்ளன `` ஜாப்வி 1`` சுருக்க வகுப்பில் வேலை இயங்குகிறது.

source: A new kwarg, ``inplace``, has been added to the function :func:`qiskit.result.marginal_counts`. This kwarg is used to control whether the contents are marginalized in place or a new copy is returned, for :class:`~qiskit.result.Result` object input. This parameter does not have any effect for an input ``dict`` or :class:`~qiskit.result.Counts` object.
ta_in: ஒரு புதிய குவார்க், `` இடம்``, செயல்பாட்டில் சேர்க்கப்பட்டுள்ளது: func: `qiskit.result.marginal_counts`. உள்ளடக்கங்கள் ஓரங்கட்டப்பட்டதா அல்லது புதிய நகல் திரும்பப் பெறப்படுகிறதா என்பதைக் கட்டுப்படுத்த இந்த குவார்க் பயன்படுத்தப்படுகிறது, இதற்கு: வகுப்பு: `~ qiskit.result.Result` பொருள் உள்ளீடு. இந்த அளவுரு ஒரு உள்ளீட்டு `` டிக்ட்`` அல்லது: வகுப்பு: `~ qiskit.result.Counts` பொருளுக்கு எந்த விளைவையும் ஏற்படுத்தாது.

source: An initial version of a classical function compiler, :mod:`qiskit.circuit.classicalfunction`, has been added. This enables compiling typed python functions (operating only on bits of type ``Int1`` at the moment) into :class:`~qiskit.circuit.QuantumCircuit` objects. For example:
ta_in: கிளாசிக்கல் செயல்பாட்டு தொகுப்பின் ஆரம்ப பதிப்பு ,: mod: `qiskit.circuit.classicalfunction`, சேர்க்கப்பட்டுள்ளது. இது தட்டச்சு செய்யப்பட்ட பைதான் செயல்பாடுகளை தொகுக்க உதவுகிறது (இந்த நேரத்தில் `` Int1`` வகை பிட்களில் மட்டுமே இயங்குகிறது): வர்க்கம்: `~ qiskit.circuit.QuantumCircuit` பொருள்கள். உதாரணத்திற்கு:

source: The parameter ``registerless=False`` in the :class:`qiskit.circuit.classicalfunction.ClassicalFunction` method :meth:`~qiskit.circuit.classicalfunction.ClassicalFunction.synth` creates a circuit with registers refering to the parameter names. For example:
ta_in: Qiskit.circuit.classicalfunction.ClassicalFunction` முறை: மெத்:` qiskit.circuit.classicalfunction.ClassicalFunction.synth` இல் உள்ள `` பதிவு இல்லாத = தவறு`` அளவுரு அளவுரு பெயர்களைக் குறிக்கும் பதிவேடுகளுடன் ஒரு சுற்று உருவாக்குகிறது. உதாரணத்திற்கு: :

source: A decorated classical function can be used the same way as any other quantum gate when appending it to a circuit.
ta_in: ஒரு சாதாரண மரபு செயற்கைக்கோள் ஒரே வழி ஒரே வழியே பயன்படுத்தலாம் அதனை ஒரு சுற்றுப்பகுதியை ஏற்றும் போது.

source: The ``GROVER_ORACLE`` gate is synthesized when its decomposition is required.
ta_in: `` GROVER_ORACLE`` வாயில் அதன் சிதைவு தேவைப்படும்போது ஒருங்கிணைக்கப்படுகிறது.

source: The feature requires ``tweedledum``, a library for synthesizing quantum circuits, that can be installed via pip with ``pip install tweedledum``.
ta_in: வளிமண்டலத்தில் ` ` pip install tweedledum ` ` ` ` pip நிறுவனத்தின் மூலம் நிறுவப்பட்டிருக்க முடியும் என்று ` ` tweedledum ` `, ஒரு நூலகம் தேவைப்படுகிறது.

source: A new class :class:`qiskit.circuit.Delay` for representing a delay instruction in a circuit has been added. A new method :meth:`~qiskit.circuit.QuantumCircuit.delay` is now available for easily appending delays to circuits. This makes it possible to describe timing-sensitive experiments (e.g. T1/T2 experiment) in the circuit level.
ta_in: ஒரு புதிய வகுப்பு: வகுப்பு: ஒரு சுற்றுவட்டத்தில் தாமத அறிவுறுத்தலைக் குறிக்கும் `qiskit.circuit.Delay` சேர்க்கப்பட்டுள்ளது. ஒரு புதிய முறை: மெத்: `~ qiskit.circuit.QuantumCircuit.delay` இப்போது சுற்றுகளுக்கு தாமதங்களை எளிதில் சேர்க்க கிடைக்கிறது. இது சுற்று மட்டத்தில் நேர-உணர்திறன் சோதனைகளை (எ.கா. T1 / T2 சோதனை) விவரிக்க உதவுகிறது.

source: A new argument ``scheduling_method`` for :func:`qiskit.compiler.transpile` has been added. It is required when transpiling circuits with delays. If ``scheduling_method`` is specified, the transpiler returns a scheduled circuit such that all idle times in it are padded with delays (i.e. start time of each instruction is uniquely determined). This makes it possible to see how scheduled instructions (gates) look in the circuit level.
ta_in: ஒரு புதிய வகுப்பு: வகுப்பு: ஒரு சுற்றுவட்டத்தில் தாமத அறிவுறுத்தலைக் குறிக்கும் `qiskit.circuit.Delay` சேர்க்கப்பட்டுள்ளது. ஒரு புதிய முறை: மெத்: `~ qiskit.circuit.QuantumCircuit.delay` இப்போது சுற்றுகளுக்கு தாமதங்களை எளிதில் சேர்க்க கிடைக்கிறது. இது சுற்று மட்டத்தில் நேர-உணர்திறன் சோதனைகளை (எ.கா. T1 / T2 சோதனை) விவரிக்க உதவுகிறது.

source: See also :func:`~qiskit.visualization.timeline_drawer` for the best visualization of scheduled circuits.
ta_in: : func: திட்டமிடப்பட்ட சுற்றுகளின் சிறந்த காட்சிப்படுத்தலுக்கு `q qiskit.visualization.timeline_drawer`.

source: A new fuction :func:`qiskit.compiler.sequence` has been also added so that we can convert a scheduled circuit into a :class:`~qiskit.pulse.Schedule` to make it executable on a pulse-enabled backend.
ta_in: ஒரு புதிய பிரிவு: func: `qiskit.compiler.afterence` மேலும் சேர்க்கப்பட்டுள்ளது, இதன்மூலம் ஒரு திட்டமிடப்பட்ட சுற்றுவட்டத்தை ஒரு: வகுப்பாக மாற்றலாம்:` ~ qiskit.pulse.Schedule` அதை துடிப்பு-இயக்கப்பட்ட பின்தளத்தில் இயக்கக்கூடியதாக மாற்றும்.

source: The :func:`~qiskit.compiler.schedule` has been updated so that it can schedule circuits with delays. Now there are two paths to schedule a circuit with delay:
ta_in: : Func: `~ qiskit.compiler.schedule` புதுப்பிக்கப்பட்டுள்ளது, இதனால் தாமதங்களுடன் சுற்றுகளை திட்டமிட முடியும். தாமதத்துடன் ஒரு சுற்று திட்டமிட இப்போது இரண்டு பாதைகள் உள்ளன:

source: Refer to the release notes and documentation for :func:`~qiskit.compiler.transpile` and :func:`~qiskit.compiler.sequence` for the details on the other path.
ta_in: இதனுக்கான வெளியீட்டுக் குறிப்புகள் மற்றும் ஆவணங்களைப் பார்க்கவும்: func: `~ qiskit.compiler.transpile` மற்றும்: func:` ~ qiskit.compiler.afterence` மற்ற பாதையில் உள்ள விவரங்களுக்கு.

source: Added the :class:`~qiskit.circuit.library.GroverOperator` to the circuit library (:mod:`qiskit.circuit.library`) to construct the Grover operator used in Grover's search algorithm and Quantum Amplitude Amplification/Estimation. Provided with an oracle in form of a circuit, ``GroverOperator`` creates the textbook Grover operator. To generalize this for amplitude amplification and use a generic operator instead of Hadamard gates as state preparation, the ``state_in`` argument can be used.
ta_in: க்ரோவரின் தேடல் வழிமுறை மற்றும் குவாண்டம் அலைவீச்சு பெருக்கம் / மதிப்பீடு ஆகியவற்றில் பயன்படுத்தப்படும் க்ரோவர் ஆபரேட்டரை உருவாக்க: வகுப்பு: `~ qiskit.circuit.library.GroverOperator` ஐ சுற்று நூலகத்தில் (: mod:` qiskit.circuit.library`) சேர்த்துள்ளார். ஒரு சுற்று வடிவத்தில் ஆரக்கிள் வழங்கப்படுகிறது, `` க்ரோவர் ஆபரேட்டர்`` க்ரோவர் ஆபரேட்டரை உருவாக்குகிறது. வீச்சு பெருக்கத்திற்காக இதைப் பொதுமைப்படுத்தவும், ஹடமார்ட் வாயில்களுக்குப் பதிலாக ஒரு பொதுவான ஆபரேட்டரை மாநில தயாரிப்பாகப் பயன்படுத்தவும், `` ஸ்டேட்_இன்`` வாதத்தைப் பயன்படுத்தலாம்.

source: The :class:`~qiskit.pulse.InstructionScheduleMap` methods :meth:`~qiskit.pulse.InstructionScheduleMap.get` and :meth:`~qiskit.pulse.InstructionScheduleMap.pop` methods now take :class:`~qiskit.circuit.ParameterExpression` instances in addition to numerical values for schedule generator parameters. If the generator is a function, expressions may be bound before or within the function call. If the generator is a :class:`~qiskit.pulse.ParametrizedSchedule`, expressions must be bound before the schedule itself is bound/called.
ta_in: :class:` ~ qiskit.pulse.InstructionScheduleMap ` முறைகள் :meth:` ~ qiskkit.pulse.InstructionScheduleMap.get ` and :meth:` ~ qiskit.pulse.InstructionScheduleMap.Pop ` முறைகள் இப்போது :class:` ~ qiskit.circuit.ParameterExpression ` instances in addition to numerical values for schedule generator parameters. பொதுவான செயல்பாடு செயல்பாடு என்றால், செயல்பாடு முன் அல்லது செயல்பாடு அழைக்கப்படுவதற்கு முன் வைத்திருக்கலாம். ஜெனரேட்டர் ஒரு :class:` ~ qiskit.pulse.ParametrizedSchedule ` என்றால், வரிசைப்படுத்துவதற்கு முன் பரிந்துரைக்கப்பட்டிருக்க வேண்டும்.

source: A new class :class:`~qiskit.circuit.library.LinearAmplitudeFunction` was added to the circuit library (:mod:`qiskit.circuit.library`) for mapping (piecewise) linear functions on qubit amplitudes,
ta_in: ஒரு புதிய வகுப்பு: வகுப்பு: `~ qiskit.circuit.library.LinearAmplitudeFunction` சுற்று நூலகத்தில் (: mod:` qiskit.circuit.library`) மேப்பிங் (பிஸ்கேவ்) நேரியல் செயல்பாடுகளை குவிட் அலைவீச்சுகளில்,

source: F|x\rangle |0\rangle = \sqrt{1 - f(x)}|x\rangle |0\rangle + \sqrt{f(x)}|x\rangle |1\rangle
ta_in: F|x\rகோணம் | 0\rகோணம் = \sqrt {1-f (x)} |x\rகோணம் | 0\rகோணம் + \sqrt {f (x)} |x\rகோணம் | 1\rகோணம்

source: The mapping is based on a controlled Pauli Y-rotations and a Taylor approximation, as described in https://arxiv.org/abs/1806.06893. This circuit can be used to compute expectation values of linear functions using the quantum amplitude estimation algorithm.
ta_in: வரைபடம் ஒரு கட்டுப்பாடற்ற Pauli Y-rotations and a Taylor approximation, as විස්තර in https://arxiv.org/abs/1806.06893. இந்த சுற்றுப்பொருளின் கணிப்பொறி கணிப்பொறி மதிப்பீடுகளின் கணிப்பொறி மதிப்புகளின் கணிப்பொறி மதிப்பை கணக்கிடும்.

source: The new jupyter magic ``monospaced_output`` has been added to the :mod:`qiskit.tools.jupyter` module. This magic sets the Jupyter notebook output font to "Courier New", when possible. When used this fonts returns text circuit drawings that are better aligned.
ta_in: The new jupyter magic ` ` monospaced_output ` ` :mod:` qiskit.tools.jupyter ` module. இந்த மந்திரம் ஜூபியர் கடிகார வெளியீட்டு எழுத்துருவை "கூரியர் நியூ", சாத்தியமாக அமைக்கிறது. இந்த மின்னெழுத்துக்களைப் பயன்படுத்தும் போது உரை சுற்றுப்பாதை வரையறுக்கிறது.

source: A new transpiler pass, :class:`~qiskit.transpiler.passes.Optimize1qGatesDecomposition`, has been added. This transpiler pass is an alternative to the existing :class:`~qiskit.transpiler.passes.Optimize1qGates` that uses the :class:`~qiskit.quantum_info.OneQubitEulerDecomposer` class to decompose and simplify a chain of single qubit gates. This method is compatible with any basis set, while :class:`~qiskit.transpiler.passes.Optimize1qGates` only works for u1, u2, and u3. The default pass managers for ``optimization_level`` 1, 2, and 3 have been updated to use this new pass if the basis set doesn't include u1, u2, or u3.
ta_in: ஒரு புதிய டிரான்ஸ்பைலர் பாஸ் ,: வகுப்பு: `~ qiskit.transpiler.passes.Optimize1qGatesDecomposition`, சேர்க்கப்பட்டுள்ளது. இந்த டிரான்ஸ்பைலர் பாஸ் தற்போதுள்ள: வர்க்கத்திற்கு மாற்றாகும்: `q qiskit.transpiler.passes.Optimize1qGates` இது: class:` ~ qiskit.quantum_info.OneQubitEulerDecomposer` வகுப்பைப் பயன்படுத்தி ஒற்றை குவிட் வாயில்களின் சங்கிலியை சிதைத்து எளிமைப்படுத்துகிறது. இந்த முறை எந்த அடிப்படைத் தொகுப்பிற்கும் பொருந்தக்கூடியது: வகுப்பு: `~ qiskit.transpiler.passes.Optimize1qGates` u1, u2 மற்றும் u3 க்கு மட்டுமே வேலை செய்கிறது. அடிப்படை தொகுப்பில் u1, u2, அல்லது u3 ஆகியவை அடங்கவில்லையெனில், `` உகப்பாக்கம்_ நிலை`` 1, 2 மற்றும் 3 க்கான இயல்புநிலை பாஸ் நிர்வாகிகள் இந்த புதிய பாஸைப் பயன்படுத்த புதுப்பிக்கப்பட்டுள்ளனர்.

source: The :class:`~qiskit.quantum_info.OneQubitEulerDecomposer` now supports two new basis, ``'PSX'`` and ``'U'``. These can be specified with the ``basis`` kwarg on the constructor. This will decompose the matrix into a circuit using :class:`~qiskit.circuit.library.PGate` and :class:`~qiskit.circuit.library.SXGate` for ``'PSX'``, and :class:`~qiskit.circuit.library.UGate` for ``'U'``.
ta_in: வகுப்பு: `~ qiskit.quantum_info.OneQubitEulerDecomposer` இப்போது இரண்டு புதிய அடிப்படைகளை ஆதரிக்கிறது,` `'PSX'`` மற்றும்` `' U'``. கட்டமைப்பாளரின் `` அடிப்படை`` குவார்க் மூலம் இவற்றைக் குறிப்பிடலாம். இது மேட்ரிக்ஸை ஒரு சுற்றுக்குள் சிதைக்கும்: வர்க்கம்: `~ qiskit.circuit.library.PGate` மற்றும்: class:` ~ qiskit.circuit.library.SXGate` `` `PSX'``, மற்றும்: class:` `` 'U'`` க்கான q qiskit.circuit.library.UGate`.

source: A new method :meth:`~qiskit.transpiler.PassManager.remove` has been added to the :class:`qiskit.transpiler.PassManager` class. This method enables removing a pass from a :class:`~qiskit.transpiler.PassManager` instance. It works on indexes, similar to :meth:`~qiskit.transpiler.PassManager.replace`. For example, to remove the :class:`~qiskit.transpiler.passes.RemoveResetInZeroState` pass from the pass manager used at optimization level 1:
ta_in: ஒரு புதிய முறை: மெத்: `~ கிஸ்கிட் .ட்ரான்ஸ்பைலர்.பாஸ்மேனேஜர்.ரெமோவ்`: வகுப்பு:` கிஸ்கிட் .ட்ரான்ஸ்பைலர்.பாஸ்மேனேஜர்` வகுப்பில் சேர்க்கப்பட்டுள்ளது. இந்த முறை ஒரு: வகுப்பிலிருந்து பாஸை அகற்ற உதவுகிறது: `~ கிஸ்கிட். டிரான்ஸ்பைலர். பாஸ் மேலாளரின் உதாரணம். இது போன்ற குறியீடுகளில் இது செயல்படுகிறது: மெத்: `~ கிஸ்கிட். டிரான்ஸ்பைலர். பாஸ் மேலாளர். பதிலாக`. எடுத்துக்காட்டாக,: கிளாஸ் c: `~ கிஸ்கிட் ஐ அகற்ற. டிரான்ஸ்பைலர் .பாஸ். தேர்வுமுறை நிலை 1 இல் பயன்படுத்தப்படும் பாஸ் மேலாளரிடமிருந்து மீட்டமை ஜீரோ ஸ்டேட் பாஸை அகற்று:

source: The stage ``[1]`` with ``RemoveResetInZeroState`` can be removed like this:
ta_in: `` [RemoveResetInZeroState`` உடன் `` [1] `` நிலை இதை நீக்கலாம்:
