Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: The :mod:`qiskit.tools.qi.qi` module is deprecated and will be removed in a future release. The legacy functions in the module have all been superseded by functions and classes in the :mod:`qiskit.quantum_info` module. A table of the deprecated functions and their replacement are below:
ta_in: :mod: `qiskit.tools.qi.qi` தொகுதி நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். தொகுதியில் உள்ள மரபுச் செயல்பாடுகள் அனைத்தும்:mod: `qiskit.quantum_info` தொகுதிக்கூறில் உள்ள செயல்பாடுகள் மற்றும் வகுப்புகளால் மீறப்பட்டுள்ளன. நீக்கப்பட்ட செயல்பாடுகளின் அட்டவணை மற்றும் அவற்றின் மாற்றீடு கீழே உள்ளன:

source: ``qiskit.tools.qi.qi`` replacements
ta_in: `` qiskit.tools.qi.qi`` மாற்றீடுகள்

source: Replacement
ta_in: மாற்று

source: The :mod:`qiskit.quantum_info.states.states` module is deprecated and will be removed in a future release. The legacy functions in the module have all been superseded by functions and classes in the :mod:`qiskit.quantum_info` module.
ta_in: :mod: `qiskit.quantum_info.states.states` தொகுதி நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். தொகுதியில் உள்ள மரபுச் செயல்பாடுகள் அனைத்தும்:mod: `qiskit.quantum_info` தொகுதிக்கூறில் உள்ள செயல்பாடுகள் மற்றும் வகுப்புகளால் மீறப்பட்டுள்ளன.

source: ``qiskit.quantum_info.states.states`` replacements
ta_in: `` qiskit.quantum_info.states.states`` மாற்றீடுகள்

source: The ``scaling`` parameter of the ``draw()`` method for the ``Schedule`` and ``Pulse`` objects was deprecated and will be removed in a future release. Instead the new ``scale`` parameter should be used. This was done to have a consistent argument between pulse and circuit drawings. For example::
ta_in: "அட்டவணை" மற்றும் "பல்ஸ்" பொருட்களுக்கான "வரைய()" முறையின் "அளவிடுதல்" அளவுரு நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் நீக்கப்படும். அதற்கு பதிலாக புதிய "அளவு" அளவுருபயன்படுத்தப்பட வேண்டும். இது துடிப்பு மற்றும் சுற்று வரைபடங்கள் இடையே ஒரு நிலையான வாதம் வேண்டும் செய்யப்பட்டது. உதாரணமாக::

source: Previously, calling :meth:`qiskit.circuit.QuantumCircuit.bind_parameters` prior to decomposing a circuit would result in the bound values not being correctly substituted into the decomposed gates. This has been resolved such that binding and decomposition may occur in any order. Fixes `issue #2482 <https://github.com/Qiskit/qiskit-terra/issues/2482>`_ and `issue #3509 <https://github.com/Qiskit/qiskit-terra/issues/3509>`_
ta_in: முன்பு, ஒரு சுற்று சிதைப்பதற்கு முன் ":meth:'qiskit.circuit.QuantumCircuit.bind_parameters" என்று அழைப்பது, கட்டப்பட்ட மதிப்புகள் சரியாக மக்கிப் போகும் கேட்களில் மாற்றப்படாமல் இருக்கும். இது எந்த ஒழுங்கிலும் சிதைவதாகவும், சிதைவதாகவும் இருக்கும் வகையில் தீர்க்கப்பட்டுள்ளது. 'பிரச்சினை #2482 <https://github.com/Qiskit/qiskit-terra/issues/2482>'_ மற்றும் 'சிக்கல் #3509 <https://github.com/Qiskit/qiskit-terra/issues/3509>' சரிசெய்கிறது_

source: The ``Collect2qBlocks`` pass had previously not considered classical conditions when determining whether to include a gate within an existing block. In some cases, this resulted in classical conditions being lost when transpiling with ``optimization_level=3``. This has been resolved so that classically conditioned gates are never included in a block. Fixes `issue #3215 <https://github.com/Qiskit/qiskit-terra/issues/3215>`_
ta_in: ஏற்கனவே உள்ள ஒரு பிளாக்கில் ஒரு கேட் சேர்க்க லாமா என்பதை தீர்மானிக்கும் போது "Collect2qBlocks" பாஸ் முன்னர் பாரம்பரிய நிலைமைகள் கருத்தில் இல்லை. சில சந்தர்ப்பங்களில், "optimization_level=3" உடன் டிரான்ஸ்பில் போது பாரம்பரிய நிலைமைகள் இழக்கப்படுகிறது. இது தீர்க்கப்பட்டு, கிளாஸிக்கல் கண்டிஷன் செய்யப்பட்ட வாயில்கள் ஒரு பிளாக்கில் சேர்க்கப்படவில்லை. 'சிக்கல் #3215 <https://github.com/Qiskit/qiskit-terra/issues/3215>' சரிசெய்கிறது_

source: All the output types for the circuit drawers in :meth:`qiskit.circuit.QuantumCircuit.draw` and :func:`qiskit.visualization.circuit_drawer` have fixed and/or improved support for drawing controlled custom gates. Fixes `issue #3546 <https://github.com/Qiskit/qiskit-terra/issues/3546>`_, `issue #3763 <https://github.com/Qiskit/qiskit-terra/issues/3763>`_, and `issue #3764 <https://github.com/Qiskit/qiskit-terra/issues/3764>`_
ta_in: ":meth:'qiskit.circuit.QuantumCircuit.draw' மற்றும் ":func:'qiskit.visualization.circuit_drawer' இல் உள்ள சுற்று இழுப்பறைகளுக்கான அனைத்து வெளியீடு வகைகளும் கட்டுப்படுத்தப்பட்ட தனிப்பயன் கேட்களை வரைவதற்கு நிலையான மற்றும் / அல்லது மேம்பட்ட ஆதரவைக் கொண்டுள்ளன. 'பிரச்சினை #3546 <https://github.com/Qiskit/qiskit-terra/issues/3546>'_, 'சிக்கல் #3763 <https://github.com/Qiskit/qiskit-terra/issues/3763>'_, மற்றும் 'பிரச்சினை #3764 <https://github.com/Qiskit/qiskit-terra/issues/3764>' சரிசெய்கிறது_

source: Explanation and examples have been added to documentation for the :class:`qiskit.circuit.QuantumCircuit` methods for adding gates: :meth:`qiskit.circuit.QuantumCircuit.ccx`, :meth:`qiskit.circuit.QuantumCircuit.ch`, :meth:`qiskit.circuit.QuantumCircuit.crz`, :meth:`qiskit.circuit.QuantumCircuit.cswap`, :meth:`qiskit.circuit.QuantumCircuit.cu1`, :meth:`qiskit.circuit.QuantumCircuit.cu3`, :meth:`qiskit.circuit.QuantumCircuit.cx`, :meth:`qiskit.circuit.QuantumCircuit.cy`, :meth:`qiskit.circuit.QuantumCircuit.cz`, :meth:`qiskit.circuit.QuantumCircuit.h`, :meth:`qiskit.circuit.QuantumCircuit.iden`, :meth:`qiskit.circuit.QuantumCircuit.rx`, :meth:`qiskit.circuit.QuantumCircuit.ry`, :meth:`qiskit.circuit.QuantumCircuit.rz`, :meth:`qiskit.circuit.QuantumCircuit.s`, :meth:`qiskit.circuit.QuantumCircuit.sdg`, :meth:`qiskit.circuit.QuantumCircuit.swap`, :meth:`qiskit.circuit.QuantumCircuit.t`, :meth:`qiskit.circuit.QuantumCircuit.tdg`, :meth:`qiskit.circuit.QuantumCircuit.u1`, :meth:`qiskit.circuit.QuantumCircuit.u2`, :meth:`qiskit.circuit.QuantumCircuit.u3`, :meth:`qiskit.circuit.QuantumCircuit.x`, :meth:`qiskit.circuit.QuantumCircuit.y`, :meth:`qiskit.circuit.QuantumCircuit.z`. Fixes `issue #3400 <https://github.com/Qiskit/qiskit-terra/issues/3400>`_
ta_in: Explanation and examples have been added to documentation for the :class:'qiskit.circuit.QuantumCircuit' methods for adding gates: :meth:'qiskit.circuit.QuantumCircuit.ccx', :meth:'qiskit.circuit.QuantumCircuit.ch', :meth:'qiskit.circuit.QuantumCircuit.crz', :meth:'qiskit.circuit.QuantumCircuit.cswap', :meth:'qiskit.circuit.QuantumCircuit.cu1', :meth:'qiskit.circuit.QuantumCircuit.cu3', :meth:'qiskit.circuit.QuantumCircuit.cx', :meth:'qiskit.circuit.QuantumCircuit.cy', :meth:'qiskit.circuit.QuantumCircuit.cz', :meth:'qiskit.circuit.QuantumCircuit.h', :meth:'qiskit.circuit.QuantumCircuit.iden', :meth:'qiskit.circuit.QuantumCircuit.rx', :meth:'qiskit.circuit.QuantumCircuit.ry', :meth:'qiskit.circuit.QuantumCircuit.rz', :meth:'qiskit.circuit.QuantumCircuit.s', :meth:'qiskit.circuit.QuantumCircuit.sdg', :meth:'qiskit.circuit.QuantumCircuit.swap', :meth:'qiskit.circuit.QuantumCircuit.t', :meth:'qiskit.circuit.QuantumCircuit.tdg', :meth:'qiskit.circuit.QuantumCircuit.u1', :meth:'qiskit.circuit.QuantumCircuit.u2', :meth:'qiskit.circuit.QuantumCircuit.u3', :meth:'qiskit.circuit.QuantumCircuit.x', :meth:'qiskit.circuit.QuantumCircuit.y', :meth:'qiskit.circuit.QuantumCircuit.z'. 'பிரச்சினை #3400 <https://github.com/Qiskit/qiskit-terra/issues/3400>' சரிசெய்கிறது_

source: Fixes for handling of complex number parameter in circuit visualization. Fixes `issue #3640 <https://github.com/Qiskit/qiskit-terra/issues/3640>`_
ta_in: சர்கூட் காட்சிப்படுத்தலில் சிக்கலான எண் அளவுருவை கையாளுவதற்கான திருத்தங்கள். 'பிரச்சினை #3640 <https://github.com/Qiskit/qiskit-terra/issues/3640>' சரிசெய்கிறது_

source: The transpiler passes in the :mod:`qiskit.transpiler.passes` directory have been organized into subdirectories to better categorize them by functionality. They are still all accessible under the ``qiskit.transpiler.passes`` namespace.
ta_in: டிரான்ஸ்பைலர் தேர்ச்சி :mod:'qiskit.transpiler.passes' அடைவு துணை அடைவுகள் சிறப்பாக செயல்பாடு மூலம் வகைப்படுத்த ஏற்பாடு செய்யப்பட்டுள்ளது. அவை அனைத்தும் இன்னும் "qiskit.transpiler.passes" என்ற பெயரில் அணுகக்கூடியவை.

source: Added ``NoiseModel.from_backend`` for building a basic device noise model for an IBMQ backend (\#569)
ta_in: IBMQ பின்முனைக்கான அடிப்படை சாதன இரைச்சல் மாதிரியை உருவாக்குவதற்கான 'NoiseModel.from_backend' சேர்க்கப்பட்டது (#569)

source: Added multi-GPU enabled simulation methods to the ``QasmSimulator``, ``StatevectorSimulator``, and ``UnitarySimulator``. The qasm simulator has gpu version of the density matrix and statevector methods and can be accessed using ``"method": "density_matrix_gpu"`` or ``"method": "statevector_gpu"`` in ``backend_options``. The statevector simulator gpu method can be accessed using ``"method": "statevector_gpu"``. The unitary simulator GPU method can be accessed using ``"method": "unitary_gpu"``. These backends use CUDA and require an NVidia GPU.(\#544)
ta_in: "QasmSimulator", "StatevectorSimulator", மற்றும் "UnitarySimulator" ஆகியபல-ஜிபியூ செயல்படுத்தப்பட்ட உருவகப்படுத்துதல் முறைகளை ச்சேர்த்தது. காஸிம் சிமுலேட்டர் அடர்த்தி அணி மற்றும் ஸ்டேட்வெக்டர் முறைகளின் GPU பதிப்பைக் கொண்டுள்ளது மற்றும் "முறை": "density_matrix_gpu" அல்லது "முறை": "statevector_gpu"" ஐ "backend_options" இல் பயன்படுத்தலாம். நிலைவெக்டர் சிமுலேட்டர் ஜி. பி. யு முறையை "முறை" பயன்படுத்தி அணுக முடியும்: "statevector_gpu".. ஒற்றை சிமுலேட்டர் ஜி. பீ. யூ முறையை "முறை" பயன்படுத்தி அணுகலாம்: "unitary_gpu". இந்த பேக்எண்டுகள் CUDA ஐப் பயன்படுத்துகிறது மற்றும் ஒரு NVidia GPU தேவைப்படுகிறது. (#544)

source: Added ``PulseSimulator`` backend (\#542)
ta_in: "PulseSimulator" பின்நிலை சேர்க்கப்பட்டது (#542)

source: Added ``PulseSystemModel`` and ``HamiltonianModel`` classes to represent models to be used in ``PulseSimulator`` (\#496, \#493)
ta_in: "PulseSystemModel" மற்றும் "HamiltonianModel" வகுப்புகள் "PulseSimulator" (#496, #493) இல் பயன்படுத்தப்பட வேண்டிய மாதிரிகளை பிரதிநிதித்துவப்படுத்துகின்றன

source: Added ``duffing_model_generators`` to generate ``PulseSystemModel`` objects from a list of parameters (\#516)
ta_in: "pulseSystemModel" பொருள்களை அளவுருக்களின் பட்டியலிலிருந்து உருவாக்க 'duffing_model_generators' சேர்க்கப்பட்டது (#516)

source: Migrated ODE function solver to C++ (\#442, \#350)
ta_in: C++ க்கு இடம்பெயர்க்கப்பட்ட ODE செயல்பாடு (#442, #350)

source: Added high level pulse simulator tests (\#379)
ta_in: உயர் நிலை துடிப்பு போலி சோதனைகள் சேர்க்கப்பட்டது (#379)

source: CMake BLAS_LIB_PATH flag to set path to look for BLAS lib (\#543)
ta_in: BLAS lib (#543) ஐ தேட பாதையை அமைக்க சிமேக் BLAS_LIB_PATH கொடி உருவாக்கவும்

source: Changed the structure of the ``src`` directory to organise simulator source code. Simulator controller headers were moved to ``src/controllers`` and simulator method State headers are in ``src/simulators`` (\#544)
ta_in: போலி மூல குறியீட்டை ஒழுங்கமைக்க "src" கோப்பகத்தை கட்டமைப்பை மாற்றியது. சிமுலேட்டர் கண்ட்ரோலர் தலைப்புகள் "src/ controllers" மற்றும் போலி முறை மாநில தலைப்புகள் "src / simulators" (#544)

source: Moved the location of several functions (\#568): * Moved contents of ``qiskit.provider.aer.noise.errors`` into the ``qiskit.providers.noise`` module * Moved contents of ``qiskit.provider.aer.noise.utils`` into the ``qiskit.provider.aer.utils`` module.
ta_in: பல செயல்பாடுகளின் இருப்பிடத்தை (#568) நகர்த்தியது: * "qiskit.provider.aer.noise.errors" இன் உள்ளடக்கங்களை "qiskit.provider.aer.noise.utils" தொகுதிக்கு நகர்த்தியது.

source: Enabled optimization to aggregate consecutive gates in a circuit (fusion) by default (\#579).
ta_in: முன்னிருப்பாக (#579) ஒரு சுற்று (இணைவு) உள்ள அடுத்தடுத்த வாயில்கள் திரட்ட செயல்படுத்தப்பட்டது.

source: Deprecated ``utils.qobj_utils`` functions (\#568)
ta_in: "utils.qobj_utils" செயல்பாடுகள் (#568)

source: Deprecated ``qiskit.providers.aer.noise.device.basic_device_noise_model``. It is superseded by the ``NoiseModel.from_backend`` method (\#569)
ta_in: "qiskit.providers.aer.noise.device.basic_device_noise_model" என்று கூறி. இது "NoiseModel.from_backend" முறை (#569)

source: Removed
ta_in: சேய்மையான

source: Removed ``NoiseModel.as_dict``, ``QuantumError.as_dict``, ``ReadoutError.as_dict``, and ``QuantumError.kron`` methods that were deprecated in 0.3 (\#568).
ta_in: நீக்கப்பட்டது 'NoiseModel.as_dict', 'QuantumError.as_dict', 'ReadoutError.as_dict', மற்றும் "QuantumError.kron" முறைகள் நீக்கப்பட்டது என்று 0.3 (#568).

source: Ignis 0.2
ta_in: பற்றவைப்பு 0.2

source: Aqua 0.6
ta_in: அக்வா 0.6

source: IBM Q Provider 0.4.6
ta_in: IBM Q வழங்குபவர் 0.4.6

source: Several new methods were added to :class:`IBMQBackend<qiskit.providers.ibmq.ibmqbackend.IBMQBackend>`:
ta_in: பல புதிய முறைகள் சேர்க்கப்பட்டன :class:'IBMQBackend<qiskit.providers.ibmq.ibmqbackend.IBMQBackend>':

source: :meth:`~qiskit.providers.ibmq.job.IBMQJob.wait_for_final_state` blocks until the job finishes. It takes a callback function that it will invoke after every query to provide feedback.
ta_in: :meth:'~qiskit.providers.ibmq.job.IBMQJob.wait_for_final_state' வேலை முடியும் வரை தடுக்கிறது. ஒவ்வொரு கேள்விக்கும் பிறகு பின்னூட்டத்தை வழங்க ுவதற்கு அது அழைக்கும் செயல்பாட்டை எடுக்கும்.

source: :meth:`~qiskit.providers.ibmq.ibmqbackend.IBMQBackend.active_jobs` returns the jobs submitted to a backend that are currently in an unfinished status.
ta_in: :meth:'~qiskit.providers.ibmq.ibmqbackend.IBMQBackend.active_jobs' தற்போது முடிக்கப்படாத நிலையில் உள்ள பின்முனைக்கு சமர்ப்பிக்கப்பட்ட வேலைகளை த் தரும்.

source: :meth:`~qiskit.providers.ibmq.ibmqbackend.IBMQBackend.job_limit` returns the job limit for a backend.
ta_in: :meth:'~qiskit.providers.ibmq.ibmqbackend.IBMQBackend.job_limit' பின்முனைக்கான பணி வரம்பை அளிக்கிறது.

source: :meth:`~qiskit.providers.ibmq.ibmqbackend.IBMQBackend.remaining_jobs_count` returns the number of jobs that you can submit to the backend before job limit is reached.
ta_in: :meth:'~qiskit.providers.ibmq.ibmqbackend.IBMQBackend.remaining_jobs_count' பணி வரம்பை அடைவதற்கு முன் நீங்கள் பின்நிலைக்கு சமர்ப்பிக்கக்கூடிய வேலைகளின் எண்ணிக்கையை அளிக்கிறது.

source: :class:`~qiskit.providers.ibmq.job.QueueInfo` now has a new :meth:`~qiskit.providers.ibmq.job.QueueInfo.format` method that returns a formatted string of the queue information.
ta_in: :class:'~qiskit.providers.ibmq.job.QueueInfo' இப்போது ஒரு புதிய உள்ளது :meth:'~qiskit.providers.ibmq.job.QueueInfo.format' முறை, வரிசை தகவலின் வடிவமைக்கப்பட்ட சரத்தை அளிக்கிறது.

source: :class:`IBMQJob<qiskit.providers.ibmq.job.IBMQJob>` now has three new methods: :meth:`~qiskit.providers.ibmq.job.IBMQJob.done`, :meth:`~qiskit.providers.ibmq.job.IBMQJob.running`, and :meth:`~qiskit.providers.ibmq.job.IBMQJob.cancelled` that are used to indicate job status.
ta_in: :class:'IBMQJob<qiskit.providers.ibmq.job.IBMQJob>' இப்போது மூன்று புதிய முறைகளைக் கொண்டுள்ளது: :meth:'~qiskit.providers.ibmq.job.done', :meth:'~qiskit.providers.ibmq.job.IBMQJob.running', மற்றும் :meth:'~qiskit.providers.ibmq.job.IBMQJob.cancelled' என்று வேலை நிலையை குறிக்க பயன்படுத்தப்படுகிறது.

source: :meth:`qiskit.providers.ibmq.ibmqbackend.IBMQBackend.run()` now accepts an optional `job_tags` parameter. If specified, the `job_tags` are assigned to the job, which can later be used as a filter in :meth:`qiskit.providers.ibmq.ibmqbackend.IBMQBackend.jobs()`.
ta_in: :meth:'qiskit.providers.ibmq.ibmqbackend.IBMQBackend.run()' இப்போது விருப்ப 'job_tags' அளவுருவை ஏற்றுக்கொள்கிறது. குறிப்பிடப்பட்டால், 'job_tags' வேலைக்கு ஒதுக்கப்படுகிறது, இது பின்னர் ஒரு வடிகட்டியாக பயன்படுத்தப்படலாம் :meth:'qiskit.providers.ibmqbackend.IBMQBackend.jobs()'.

source: :class:`~qiskit.providers.ibmq.managed.IBMQJobManager` now has a new method :meth:`~qiskit.providers.ibmq.managed.IBMQJobManager.retrieve_job_set()` that allows you to retrieve a previously submitted job set using the job set ID.
ta_in: :class:'~qiskit.providers.ibmq.managed.IBMQJobManager' now has a new method :meth:'~qiskit.providers.ibmq.managed.IBMQJobManager.retrieve_job_set()' என்று நீங்கள் வேலை தொகுப்பு ஐடி பயன்படுத்தி முன்பு சமர்ப்பிக்கப்பட்ட வேலை தொகுப்பு மீட்டெடுக்க அனுமதிக்கிறது.

source: The ``Exception`` hierarchy has been refined with more specialized classes. You can, however, continue to catch their parent exceptions (such as ``IBMQAccountError``). Also, the exception class ``IBMQApiUrlError`` has been replaced by ``IBMQAccountCredentialsInvalidUrl`` and ``IBMQAccountCredentialsInvalidToken``.
ta_in: "விதிவிலக்கு" படிநிலை இன்னும் சிறப்பு வகுப்புகள் மூலம் சுத்திகரிக்கப்பட்டுள்ளது. இருப்பினும், நீங்கள் அவர்களின் பெற்றோர் விதிவிலக்குகளை ('IBMQAccountError' போன்றவை) தொடர்ந்து பிடிக்கலாம். மேலும், விதிவிலக்கு வர்க்கம் "IBMQApiUrlError" பதிலாக "IBMQAccountCredentialsInvalidUrl" மற்றும் "IBMQAccountCredentialsInvalidToken" ஆல் மாற்றப்பட்டுள்ளது.

source: The use of proxy urls without a protocol (e.g. ``http://``) is deprecated due to recent Python changes.
ta_in: ப்ரோட்டோக்கால் (எ.கா., "http://'') இல்லாமல் ப்ராக்ஸி urlகளின் பயன்பாடு சமீபத்திய பைதான் மாற்றங்களால் நீக்கப்படுகிறது.

source: Terra 0.11.0
ta_in: டெரா 0.11.0

source: The 0.11.0 release includes several new features and bug fixes. The biggest change for this release is the addition of the pulse scheduler. This allows users to define their quantum program as a ``QuantumCircuit`` and then map it to the underlying pulse instructions that will control the quantum hardware to implement the circuit.
ta_in: 0.11.0 வெளியீட்டில் பல புதிய அம்சங்கள் மற்றும் பிழைத்திருத்தங்கள் உள்ளன. இந்த வெளியீட்டின் மிகப்பெரிய மாற்றம் பல்ஸ் திட்டமிடுபவர் கூடுதலாக உள்ளது. இது பயனர்கள் தங்கள் குவாண்டம் நிரலை ஒரு "குவாண்டம்சர்க்யூட்" என வரையறுக்க அனுமதிக்கிறது, பின்னர் அதை அடிப்படை பல்ஸ்வழிமுறைகளுக்கு வரைபடமாக்கஅனுமதிக்கிறது, இது குவாண்டம் வன்பொருள் சர்க்யூட் செயல்படுத்த ும்.

source: Added 5 new commands to easily retrieve user-specific data from ``BackendProperties``: ``gate_property``, ``gate_error``, ``gate_length``, ``qubit_property``, ``t1``, ``t2``, ``readout_error`` and ``frequency``. They return the specific values of backend properties. For example::
ta_in: "பின்முனைபண்புகள்": "gate_property'', "gate_error", "gate_length", "qubit_property t1", "t2", "readout_error", "அதிர்வெண்" இலிருந்து பயனர்-குறிப்பிட்ட தரவை எளிதாக மீட்டெடுக்க 5 புதிய கட்டளைகளை சேர்த்துள்ளோம். அவை பின்முனை பண்புகளின் குறிப்பிட்ட மதிப்புகளை திருப்பும். உதாரணமாக::

source: Added method ``Instruction.is_parameterized()`` to check if an instruction object is parameterized. This method returns ``True`` if and only if instruction has a ``ParameterExpression`` or ``Parameter`` object for one of its params.
ta_in: ஒரு அறிவுறுத்தல் பொருள் அளவுருவாக்கப்பட்டுள்ளதா என்பதைச் சரிபார்க்க `` Instruction.is_parameterized () `` முறை சேர்க்கப்பட்டது. அறிவுறுத்தலுக்கு அதன் ஒரு அளவுருவுக்கு ``ParameterExpression`` அல்லது ``Parameter`` பொருள் இருந்தால் மட்டுமே இந்த முறை ``True``.

source: Added a new analysis pass ``Layout2qDistance``. This pass allows to "score" a layout selection, once ``property_set['layout']`` is set. The score will be the sum of distances for each two-qubit gate in the circuit, when they are not directly connected. This scoring does not consider direction in the coupling map. The lower the number, the better the layout selection is.
ta_in: புதிய பகுப்பாய்வு பாஸ் `` Layout2qDistance`` ஐச் சேர்த்தது. ``property_set['layout'] `` அமைக்கப்பட்டவுடன், இந்த பாஸ் ஒரு தளவமைப்பு தேர்வை "மதிப்பெண்" செய்ய அனுமதிக்கிறது. சர்க்யூட்டில் உள்ள ஒவ்வொரு இரண்டு-குவிட் வாயிலுக்கும் அவை நேரடியாக இணைக்கப்படாதபோது தூரத்தின் கூட்டுத்தொகையாக இருக்கும். இந்த மதிப்பெண் இணைப்பு வரைபடத்தில் திசையைக் கருத்தில் கொள்ளாது. குறைந்த எண்ணிக்கையில், தளவமைப்பு தேர்வு சிறந்தது.

source: For example, consider a linear coupling map ``[0]--[2]--[1]`` and the following circuit::
ta_in: எடுத்துக்காட்டாக, ஒரு நேரியல் இணைப்பு வரைபடம் `` [0] - [2] - [1] `` மற்றும் பின்வரும் சுற்று::

source: If the layout is ``{qr[0]:0, qr[1]:1}``, ``Layout2qDistance`` will set ``property_set['layout_score'] = 1``. If the layout is ``{qr[0]:0, qr[1]:2}``, then the result is ``property_set['layout_score'] = 0``. The lower the score, the better.
ta_in: தளவமைப்பு `` {qr [0]: 0, qr [1]: 1} `` என்றால், `` Layout2qDistance`` ``property_set['layout_score'] = 1`` ஐ அமைக்கும். தளவமைப்பு `` {qr [0]: 0, qr [1]: 2} `` எனில், இதன் விளைவாக `` property_set ['Layout_score'] = 0``. குறைந்த மதிப்பெண், சிறந்தது.

source: Added ``qiskit.QuantumCircuit.cnot`` as an alias for the ``cx`` method of ``QuantumCircuit``. The names ``cnot`` and ``cx`` are often used interchangeably now the `cx` method can be called with either name.
ta_in: "qiskit" சேர்க்கப்பட்டது. QuantumCircuit.cnot" என்பது "QuantumCircuit" இன் "cx" முறைக்கு ஒரு மாற்றுப் பெயர். "cnot" மற்றும் "cx" ஆகிய பெயர்கள் பெரும்பாலும் ஒன்றுக்கொன்று மாறிமாறி பயன்படுத்தப்படுகின்றன, இப்போது 'cx' முறை இரண்டு பெயர்களையும் கொண்டு அழைக்கப்படலாம்.

source: Added ``qiskit.QuantumCircuit.toffoli`` as an alias for the ``ccx`` method of ``QuantumCircuit``. The names ``toffoli`` and ``ccx`` are often used interchangeably now the `ccx` method can be called with either name.
ta_in: "qiskit" சேர்க்கப்பட்டது. குவாண்டம்சர்க்யூட்.டாபோலி" என்பது "குவாண்டம் சர்க்யூட்" இன் "ccx" முறைக்கு ஒரு மாற்றுப் பெயர். "toffoli" மற்றும் "ccx" ஆகிய பெயர்கள் பெரும்பாலும் ஒன்றுக்கொன்று மாறிமாறி பயன்படுத்தப்படுகின்றன, இப்போது 'ccx' முறை இரண்டு பெயர்களையும் கொண்டு அழைக்கப்படலாம்.

source: Added ``qiskit.QuantumCircuit.fredkin`` as an alias for the ``cswap`` method of ``QuantumCircuit``. The names ``fredkin`` and ``cswap`` are often used interchangeably now the `cswap` method can be called with either name.
ta_in: "qiskit" சேர்க்கப்பட்டது. குவாண்டம்சர்க்யூட்.ஃப்ரெட்கின்" என்பது "QuantumCircuit" இன் "cswp" முறைக்கான ஒரு மாற்றுப் பெயர். 'fredkin' மற்றும் 'cswap' ஆகிய பெயர்கள் பெரும்பாலும் ஒன்றுக்கொன்று மாறிமாறி பயன்படுத்தப்படுகின்றன, இப்போது 'cswp' முறை இரண்டு பெயர்களையும் அழைக்கலாம்.

source: The ``latex`` output mode for ``qiskit.visualization.circuit_drawer()`` and the ``qiskit.circuit.QuantumCircuit.draw()`` method now has a mode to passthrough raw latex from gate labels and parameters. The syntax for doing this mirrors matplotlib's `mathtext mode <https://matplotlib.org/tutorials/text/mathtext.html>`__ syntax. Any portion of a label string between a pair of '$' characters will be treated as raw latex and passed directly into the generated output latex. This can be leveraged to add more advanced formatting to circuit diagrams generated with the latex drawer.
ta_in: "qiskit.visualization.circuit_drawer()" மற்றும் "qiskit.circuit.QuantumCircuit.draw()' முறைக்கான "மரப்பால்" வெளியீட்டு முறை இப்போது கேட் லேபல்கள் மற்றும் அளவுருக்கள் இருந்து மூல லேட்டக்ஸ் வழியாக கடந்து ஒரு முறை உள்ளது. இதை செய்வதற்கான தொடரியல் matplotlib இன் 'mathtext mode <https://matplotlib.org/tutorials/text/mathtext.html>'__ தொடரியல் பிரதிபலிக்கிறது. ஒரு ஜோடி '$' எழுத்துக்குறிகளுக்கு இடையே லேபிள் சரத்தின் எந்த பகுதியும் மூல மரப்பால் என கருதப்பட்டு நேரடியாக உருவாக்கப்பட்ட வெளியீடு லேட்டக்ஸ் க்கு அனுப்பப்படும். இது லேட்டக்ஸ் இழுப்பறை மூலம் உருவாக்கப்பட்ட சர்க்யூட் வரைபடத்திற்கு மேலும் மேம்பட்ட வடிவமைப்பைசேர்க்க லாம்.

source: Prior to this release all gate labels were run through a utf8 -> latex conversion to make sure that the output latex would compile the string as expected. This is still what happens for all portions of a label outside the '$' pair. Also if you want to use a dollar sign in your label make sure you escape it in the label string (ie ``'\$'``).
ta_in: இந்த வெளியீட்டிற்கு முன்பு அனைத்து கேட் லேபல்களும் utf8 -> லேட்டக்ஸ் மாற்றம் மூலம் இயக்கப்பட்டன, இது வெளியீடு லேட்டக்ஸ் எதிர்பார்த்தபடி சரத்தை தொகுக்கும் என்பதை உறுதி செய்ய. இது இன்னும் '$' ஜோடிக்கு வெளியே உள்ள லேபிலின் அனைத்து பகுதிகளுக்கும் என்ன நடக்கிறது. மேலும் உங்கள் லேபிளில் ஒரு டாலர் குறியைப் பயன்படுத்த விரும்பினால், லேபிள் சரத்தில் (அதாவது '$') அதை நீங்கள் தவிர்க்க வேண்டும்.

source: You can mix and match this passthrough with the utf8 -> latex conversion to create the exact label you want, for example::
ta_in: நீங்கள் விரும்பும் சரியான லேபிளை உருவாக்க utf8 -> லேடெக்ஸ் மாற்றத்துடன் இந்த பாஸ்ட்ரூவை கலந்து பொருத்தலாம், எடுத்துக்காட்டாக::
