Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: will no longer work. Instead to determine if those providers are present you can either explicitly use ``qiskit.providers.aer.Aer`` and ``qiskit.providers.ibmq.IBMQ``::
ta_in: இனி வேலை செய்யாது. அந்த வழங்குநர்கள் இருக்கிறார்களா என்பதைத் தீர்மானிக்க நீங்கள் வெளிப்படையாக `` qiskit.providers.aer.Aer`` மற்றும் `` qiskit.providers.ibmq.IBMQ``:: ஐப் பயன்படுத்தலாம்::

source: or check ``bool(qiskit.Aer)`` and ``bool(qiskit.IBMQ)`` instead, for example::
ta_in: அல்லது அதற்கு பதிலாக ``bool (qiskit.Aer) `` மற்றும் ``bool (qiskit.IBMQ) `` ஐச் சரிபார்க்கவும், எடுத்துக்காட்டாக::

source: This change was necessary to avoid potential import cycle issues between the qiskit packages and also to improve the import time when Aer or IBMQ are not being used.
ta_in: Qiskit தொகுப்புகளுக்கிடையேயான இறக்குமதி சுழற்சி சிக்கல்களைத் தவிர்ப்பதற்கும், ஏர் அல்லது IBMQ பயன்படுத்தப்படாதபோது இறக்குமதி நேரத்தை மேம்படுத்துவதற்கும் இந்த மாற்றம் அவசியம்.

source: The user config file option ``suppress_packaging_warnings`` option in the user config file and the ``QISKIT_SUPPRESS_PACKAGING_WARNINGS`` environment variable no longer has any effect and will be silently ignored. The warnings this option controlled have been removed and will no longer be emitted at import time from the ``qiskit`` module.
ta_in: பயனர் உள்ளமைவு கோப்பில் பயனர் உள்ளமைவு கோப்பு விருப்பம் ``suppress_packaging_warnings`` மற்றும் `` QISKIT_SUPPRESS_PACKAGING_WARNINGS`` சூழல் மாறி இனி எந்த விளைவையும் ஏற்படுத்தாது, அமைதியாக புறக்கணிக்கப்படும். கட்டுப்படுத்தப்பட்ட இந்த விருப்பம் எச்சரிக்கைகள் நீக்கப்பட்டன, மேலும் ``qiskit`` தொகுதியிலிருந்து இறக்குமதி நேரத்தில் வெளியிடப்படாது.

source: The previously deprecated ``condition`` kwarg for :class:`qiskit.dagcircuit.DAGNode` constructor has been removed. It was deprecated in the 0.15.0 release. Instead you should now be setting the classical condition on the :class:`~qiskit.circuit.Instruction` object passed into the :class:`~qiskit.dagcircuit.DAGNode` constructor when creating a new ``op`` node.
ta_in: இதற்கு முன்னர் நீக்கப்பட்ட ``condition`` குவார்க் :class: `qiskit.dagcircuit.DAGNode` கட்டமைப்பாளர் அகற்றப்பட்டார். இது 0.15.0 வெளியீட்டில் நீக்கப்பட்டது. அதற்கு பதிலாக நீங்கள் இப்போது கிளாசிக்கல் நிபந்தனையை அமைக்க வேண்டும்:class: `~ qiskit.circuit.Instruction` பொருள்:class:` ~ qiskit.dagcircuit.DAGNode` கட்டமைப்பாளருக்கு ஒரு புதிய `` op`` முனையை உருவாக்கும்போது.

source: When creating a new :class:`~qiskit.circuit.Register` (which is the parent class for :class:`~qiskit.circuit.QuantumRegister` and :class:`~qiskit.circuit.ClassicalRegister`) or :class:`~qiskit.circuit.QuantumCircuit` object with a number of bits (eg ``QuantumCircuit(2)``), it is now required that number of bits are specified as an integer or another type which is castable to unambiguous integers(e.g. ``2.0``). Non-integer values will now raise an error as the intent in those cases was unclear (you can't have fractional bits). For more information on why this was changed refer to: `#4855 <https://github.com/Qiskit/qiskit-terra/issues/4855>`__
ta_in: புதிய: வகுப்பை உருவாக்கும் போது :class: `~ qiskit.circuit.Register` (இது பெற்றோர் வகுப்பு:class:` ~ qiskit.circuit.QuantumRegister` மற்றும்:class: `~ qiskit.circuit.ClassicalRegister`) அல்லது:class: `~ qiskit.circuit.QuantumCircuit` பொருள் பல பிட்களுடன் (எ.கா.``QuantumCircuit(2)``), இப்போது பிட்களின் எண்ணிக்கை ஒரு முழு எண் அல்லது வேறு வகையாக குறிப்பிடப்பட வேண்டும், இது தெளிவற்ற முழு எண்களுக்கு (எ.கா. `` 2.0``). அந்த நிகழ்வுகளின் நோக்கம் தெளிவாக இல்லாததால் முழு எண் அல்லாத மதிப்புகள் இப்போது ஒரு பிழையை எழுப்புகின்றன (உங்களிடம் பகுதியளவு பிட்கள் இருக்க முடியாது). இது ஏன் மாற்றப்பட்டது என்பது குறித்த கூடுதல் தகவலுக்கு: `# 4855 <https://github.com/Qiskit/qiskit-terra/issues/4855>` __

source: `networkx <https://networkx.org/>`__ is no longer a requirement for qiskit-terra. All the networkx usage inside qiskit-terra has been removed with the exception of 3 methods:
ta_in: `networkx <https://networkx.org/>` __ இனி கிஸ்கிட்-டெர்ராவிற்கு தேவையில்லை. Qiskit-டெர்ராவிற்குள் உள்ள அனைத்து நெட்வொர்க் பயன்பாடுகளும் 3 முறைகளைத் தவிர்த்து அகற்றப்பட்டுள்ளன:

source: If you are using any of these methods you will need to manually install networkx in your environment to continue using them.
ta_in: இந்த முறைகளில் ஏதேனும் ஒன்றை நீங்கள் பயன்படுத்துகிறீர்கள் என்றால், தொடர்ந்து அவற்றைப் பயன்படுத்த உங்கள் சூழலில் நெட்வொர்க்ஸை கைமுறையாக நிறுவ வேண்டும்.

source: By default on macOS with Python >=3.8 :func:`~qiskit.tools.parallel_map` will no longer run in multiple processes. This is a change from previous releases where the default behavior was that :func:`~qiskit.tools.parallel_map` would launch multiple processes. This change was made because with newer versions of macOS with Python 3.8 and 3.9 multiprocessing is either unreliable or adds significant overhead because of the change in Python 3.8 to launch new processes with ``spawn`` instead of ``fork``. To re-enable parallel execution on macOS with Python >= 3.8 you can use the user config file ``parallel`` option or set the environment variable ``QISKIT_PARALLEL`` to ``True``.
ta_in: பைதான்> = 3.8 உடன் மேகோஸில் இயல்பாக:func: `~ qiskit.tools.parallel_map` இனி பல செயல்முறைகளில் இயங்காது. இயல்புநிலை நடத்தை இருந்த முந்தைய வெளியீடுகளிலிருந்து இது ஒரு மாற்றம்:func: `~ qiskit.tools.parallel_map` பல செயல்முறைகளைத் தொடங்கும். இந்த மாற்றம் செய்யப்பட்டது, ஏனெனில் பைதான் 3.8 மற்றும் 3.9 உடன் மாகோஸின் புதிய பதிப்புகள் நம்பமுடியாதவை அல்லது பைத்தான் 3.8 இன் மாற்றத்தின் காரணமாக குறிப்பிடத்தக்க மேல்நிலை சேர்க்கிறது, ஏனெனில் புதிய செயல்முறைகளை ``fork`` க்கு பதிலாக ``spawn`` உடன் தொடங்கலாம். பைத்தான்> = 3.8 உடன் மேகோஸில் இணையான செயல்பாட்டை மீண்டும் இயக்க நீங்கள் பயனர் கட்டமைப்பு கோப்பு ``parallel`` விருப்பத்தைப் பயன்படுத்தலாம் அல்லது சூழல் மாறி `` QISKIT_PARALLEL`` ஐ ``True`` என அமைக்கலாம்.

source: The previously deprecated kwarg ``callback`` on the constructor for the :class:`~qiskit.transpiler.PassManager` class has been removed. This kwarg has been deprecated since the 0.13.0 release (April, 9th 2020). Instead you can pass the ``callback`` kwarg to the :meth:`qiskit.transpiler.PassManager.run` method directly. For example, if you were using::
ta_in: :class: `~ qiskit.transpiler.PassManager` வகுப்பிற்கான கட்டமைப்பாளரின் முன்பு நீக்கப்பட்ட குவார்க் ``callback`` அகற்றப்பட்டது. இந்த குவார்க் 0.13.0 வெளியீட்டிலிருந்து (ஏப்ரல், 9, 2020) நீக்கப்பட்டது. அதற்கு பதிலாக நீங்கள் ``callback`` குவார்க்கை :meth: `qiskit.transpiler.PassManager.run` முறைக்கு நேரடியாக அனுப்பலாம். எடுத்துக்காட்டாக, நீங்கள் பயன்படுத்தினால்::

source: this can be replaced with::
ta_in: இதை:: உடன் மாற்றலாம்

source: It is now no longer possible to instantiate a base channel without a prefix, such as :class:`qiskit.pulse.Channel` or :class:`qiskit.pulse.PulseChannel`. These classes are designed to classify types of different user facing channel classes, such as :class:`qiskit.pulse.DriveChannel`, but do not have a definition as a target resource. If you were previously directly instantiating either :class:`qiskit.pulse.Channel` or :class:`qiskit.pulse.PulseChannel`, this is no longer allowed. Please use the appropriate subclass.
ta_in: :class: `qiskit.pulse.Channel` அல்லது :class:` qiskit.pulse.PulseChannel` போன்ற முன்னொட்டு இல்லாமல் ஒரு அடிப்படை சேனலை உடனடியாக நிறுவ முடியாது. இந்த வகுப்புகள் வெவ்வேறு பயனர் எதிர்கொள்ளும் சேனல் வகுப்புகளின் வகைகளை வகைப்படுத்த வடிவமைக்கப்பட்டுள்ளன, அதாவது :class: `qiskit.pulse.DriveChannel`, ஆனால் இலக்கு வளமாக ஒரு வரையறை இல்லை. நீங்கள் முன்பு நேரடியாக நிறுவியிருந்தால் :class: `qiskit.pulse.Channel` அல்லது :class:` qiskit.pulse.PulseChannel`, இது இனி அனுமதிக்கப்படாது. பொருத்தமான துணைப்பிரிவைப் பயன்படுத்தவும்.

source: When the ``require_cp`` and/or ``require_tp`` kwargs of :func:`qiskit.quantum_info.process_fidelity`, :func:`qiskit.quantum_info.average_gate_fidelity`, :func:`qiskit.quantum_info.gate_error` are ``True``, they will now only log a warning rather than the previous behavior of raising a :class:`~qiskit.exceptions.QiskitError` exception if the input channel is non-CP or non-TP respectively.
ta_in: `` Require_cp`` மற்றும் / அல்லது `` required_tp`` குவார்க்குகள் :func: `qiskit.quantum_info.process_fidelity` ,:func:` qiskit.quantum_info.average_gate_fidelity` ,:func: `qiskit.gantum_info. ``True``, உள்ளீடு சேனல் முறையே சிபி அல்லாத அல்லது டிபி அல்லாததாக இருந்தால், அவை: வகுப்பை உயர்த்துவதற்கான முந்தைய நடத்தைக்கு பதிலாக ஒரு எச்சரிக்கையை மட்டுமே பதிவு செய்யும். `:class:~ qiskit.exceptions.QiskitError` விதிவிலக்கு.

source: The :class:`~qiskit.circuit.library.QFT` class in the :mod:`qiskit.circuit.library` module now computes the Fourier transform using a little-endian representation of tensors, i.e. the state :math:`|1\rangle` maps to :math:`|0\rangle - |1\rangle + |2\rangle - ..` assuming the computational basis correspond to little-endian bit ordering of the integers. :math:`|0\rangle = |000\rangle, |1\rangle = |001\rangle`, etc. This was done to make it more consistent with the rest of Qiskit, which uses a little-endian convention for bit order. If you were depending on the previous bit order you can use the :meth:`~qiskit.circuit.library.QFT.reverse_bits` method to revert to the previous behavior. For example::
ta_in: :class:`qiskit.circuit.library.QFT` வர்க்கம் :mod:` qiskit.circuit.library` தொகுதி இப்போது ஃபோரியர் உருமாற்றத்தை டென்சர்களின் சிறிய-எண்டியன் பிரதிநிதித்துவத்தைப் பயன்படுத்தி கணக்கிடுகிறது, அதாவது நிலை:math: `|1\rangle` வரைபடங்கள்:math: `|0\rangle - |1\rangle+|2\rangle - ..` கணக்கீட்டு அடிப்படையானது முழு எண்களின் சிறிய-எண்டியன் பிட் வரிசைக்கு ஒத்திருக்கிறது. :math: `|0\rangle=|000 \rangle,|1\rangle=|001\rangle`, முதலியன. இது கிஸ்கிட்டின் மற்ற பகுதிகளுடன் மிகவும் ஒத்துப்போகும் வகையில் செய்யப்பட்டது, இது ஒரு பிட்-எண்டியன் மாநாட்டைப் பயன்படுத்துகிறது ஆர்டர். முந்தைய பிட் வரிசையைப் பொறுத்து நீங்கள் இருந்தால்: முந்தைய நடத்தைக்கு மாற்ற:meth: `q qiskit.circuit.library.QFT.reverse_bits` முறையைப் பயன்படுத்தலாம். உதாரணத்திற்கு::

source: The ``qiskit.__qiskit_version__`` module attribute was previously a ``dict`` will now return a custom read-only ``Mapping`` object that checks the version of qiskit elements at runtime instead of at import time. This was done to speed up the import path of qiskit and eliminate a possible import cycle by only importing the element packages at runtime if the version is needed from the package. This should be fully compatible with the ``dict`` previously return and for most normal use cases there will be no difference. However, if some applications were relying on either mutating the contents or explicitly type checking it may require updates to adapt to this change.
ta_in: ``qiskit.__qiskit_version__`` தொகுதி பண்புக்கூறு முன்பு ஒரு ``dict`` இப்போது தனிப்பயன் படிக்க-மட்டும் ``Mapping`` பொருளைத் தரும், இது இறக்குமதி நேரத்திற்கு பதிலாக இயக்க நேரத்தில் கிஸ்கிட் கூறுகளின் பதிப்பை சரிபார்க்கிறது. கிஸ்கிட்டின் இறக்குமதி பாதையை விரைவுபடுத்துவதற்கும், தொகுப்பிலிருந்து பதிப்பு தேவைப்பட்டால் இயக்க நேரத்தில் மட்டுமே உறுப்பு தொகுப்புகளை இறக்குமதி செய்வதன் மூலம் சாத்தியமான இறக்குமதி சுழற்சியை அகற்றுவதற்கும் இது செய்யப்பட்டது. இது முன்னர் திரும்பிய ``dict`` உடன் முழுமையாக ஒத்துப்போக வேண்டும், மேலும் சாதாரண பயன்பாட்டு நிகழ்வுகளில் எந்த வித்தியாசமும் இருக்காது. இருப்பினும், சில பயன்பாடுகள் உள்ளடக்கங்களை மாற்றுவதை நம்பியிருந்தால் அல்லது வெளிப்படையாக சரிபார்ப்பதை தட்டச்சு செய்தால், இந்த மாற்றத்திற்கு ஏற்ப புதுப்பிப்புகள் தேவைப்படலாம்.

source: The ``qiskit.execute`` module has been renamed to :mod:`qiskit.execute_function`. This was necessary to avoid a potentical name conflict between the :func:`~qiskit.execute_function.execute` function which is re-exported as ``qiskit.execute``. ``qiskit.execute`` the function in some situations could conflict with ``qiskit.execute`` the module which would lead to a cryptic error because Python was treating ``qiskit.execute`` as the module when the intent was to the function or vice versa. The module rename was necessary to avoid this conflict. If you're importing ``qiskit.execute`` to get the module (typical usage was ``from qiskit.execute import execute``) you will need to update this to use ``qiskit.execute_function`` instead. ``qiskit.execute`` will now always resolve to the function.
ta_in: `` Qiskit.execute`` தொகுதிக்கு மறுபெயரிடப்பட்டுள்ளது :mod: `qiskit.execute_function`. :func: `~ qiskit.execute_function.execute` செயல்பாட்டிற்கு இடையில் ஒரு சாத்தியமான பெயர் மோதலைத் தவிர்க்க இது அவசியம், இது` `qiskit.execute`` என மீண்டும் ஏற்றுமதி செய்யப்படுகிறது. `` qiskit.execute`` சில சூழ்நிலைகளில் உள்ள செயல்பாடு `` qiskit.execute`` உடன் முரண்படக்கூடும், இது ஒரு ரகசிய பிழைக்கு வழிவகுக்கும், ஏனெனில் பைதான் `` qiskit.execute`` ஐ தொகுதிக்கூறாகக் கருதுகிறது. செயல்பாடு அல்லது நேர்மாறாக. இந்த மோதலைத் தவிர்க்க தொகுதி மறுபெயரிடுதல் அவசியம். தொகுதியைப் பெற நீங்கள் `` qiskit.execute`` ஐ இறக்குமதி செய்கிறீர்கள் என்றால் (வழக்கமான பயன்பாடு qiskit.execute import execute`` என்பதிலிருந்து `` இருந்தது) அதற்கு பதிலாக `` qiskit.execute_function`` ஐப் பயன்படுத்த இதைப் புதுப்பிக்க வேண்டும். `` qiskit.execute`` இப்போது எப்போதும் செயல்பாட்டைத் தீர்க்கும்.

source: The ``qiskit.compiler.transpile``, ``qiskit.compiler.assemble``, ``qiskit.compiler.schedule``, and ``qiskit.compiler.sequence`` modules have been renamed to ``qiskit.compiler.transpiler``, ``qiskit.compiler.assembler``, ``qiskit.compiler.scheduler``, and ``qiskit.compiler.sequence`` respectively. This was necessary to avoid a potentical name conflict between the modules and the re-exported function paths :func:`qiskit.compiler.transpile`, :func:`qiskit.compiler.assemble`, :func:`qiskit.compiler.schedule`, and :func:`qiskit.compiler.sequence`. In some situations this name conflict between the module path and re-exported function path would lead to a cryptic error because Python was treating an import as the module when the intent was to use the function or vice versa. The module rename was necessary to avoid this conflict. If you were using the imports to get the modules before (typical usage would be like``from qiskit.compiler.transpile import transpile``) you will need to update this to use the new module paths. :func:`qiskit.compiler.transpile`, :func:`qiskit.compiler.assemble`, :func:`qiskit.compiler.schedule`, and :func:`qiskit.compiler.sequence` will now always resolve to the functions.
ta_in: `` Qiskit.compiler.transpile``, `` qiskit.compiler.assemble``, `` qiskit.compiler.schedule``, மற்றும் `` qiskit.compiler.afterence`` தொகுதிகள் ``qiskit. compiler.transpiler``, `` qiskit.compiler.assembler``, `` qiskit.compiler.scheduler``மற்றும் `` qiskit.compiler.afterence``என மறுபெயரிடப்பட்டுள்ளன. தொகுதிகள் மற்றும் மறு ஏற்றுமதி செய்யப்பட்ட செயல்பாட்டு பாதைகளுக்கு இடையில் ஒரு சாத்தியமான பெயர் மோதலைத் தவிர்க்க இது அவசியம் :func: `qiskit.compiler.transpile` ,:func:` qiskit.compiler.assemble` ,:func: `qiskit.compiler.schedule `, மற்றும் :func:` qiskit.compiler.afterence`. சில சூழ்நிலைகளில், தொகுதி பாதை மற்றும் மறு ஏற்றுமதி செய்யப்பட்ட செயல்பாட்டு பாதைக்கு இடையிலான இந்த பெயர் மோதல் ஒரு ரகசிய பிழைக்கு வழிவகுக்கும், ஏனெனில் பைதான் ஒரு இறக்குமதியை ஒரு தொகுதியாக கருதுகிறது, ஏனெனில் செயல்பாடு அல்லது அதற்கு நேர்மாறாக பயன்படுத்த வேண்டும். இந்த மோதலைத் தவிர்க்க தொகுதி மறுபெயரிடுதல் அவசியம். இதற்கு முன்னர் தொகுதிக்கூறுகளைப் பெற நீங்கள் இறக்குமதியைப் பயன்படுத்தினால் (வழக்கமான பயன்பாடு `` qiskit.compiler.transpile இறக்குமதி டிரான்ஸ்பைல்`` போல இருக்கும்) புதிய தொகுதி பாதைகளைப் பயன்படுத்த இதை நீங்கள் புதுப்பிக்க வேண்டும். :func: `qiskit.compiler.transpile` ,:func:` qiskit.compiler.assemble` ,:func: `qiskit.compiler.schedule`, மற்றும் :func:` qiskit.compiler.afterence` இப்போது எப்போதும் தீர்க்கப்படும் செயல்பாடுகள்.

source: The :class:`qiskit.quantum_info.Quaternion` class was moved from the ``qiskit.quantum_info.operator`` submodule to the ``qiskit.quantum_info.synthesis`` submodule to better reflect it's purpose. No change is required if you were importing it from the root :mod:`qiskit.quantum_info` module, but if you were importing from ``qiskit.quantum_info.operator`` you will need to update your import path.
ta_in: :class: `qiskit.quantum_info.Quaternion` வகுப்பு ``qiskit.quantum_info.operator`` துணைத் தொகுதியிலிருந்து` `qiskit.quantum_info.synthesis`` துணை தொகுதிக்கு அதன் நோக்கத்தை சிறப்பாக பிரதிபலிக்கும் வகையில் மாற்றப்பட்டது. நீங்கள் இதை மூலத்திலிருந்து இறக்குமதி செய்தால் எந்த மாற்றமும் தேவையில்லை :mod: `qiskit.quantum_info` தொகுதி, ஆனால் நீங்கள் ``qiskit.quantum_info.operator`` இலிருந்து இறக்குமதி செய்கிறீர்கள் என்றால், உங்கள் இறக்குமதி பாதையை நீங்கள் புதுப்பிக்க வேண்டும்.

source: Removed the ``QuantumCircuit.mcmt`` method, which has been deprecated since the Qiskit Terra 0.14.0 release in April 2020. Instead of using the method, please use the :class:`~qiskit.circuit.library.MCMT` class instead to construct a multi-control multi-target gate and use the :meth:`qiskit.circuit.QuantumCircuit.append` or :meth:`qiskit.circuit.QuantumCircuit.compose` to add it to a circuit.
ta_in: ஏப்ரல் 2020 இல் qiskit டெர்ரா 0.14.0 வெளியீட்டில் இருந்து நீக்கப்பட்ட `` QuantumCircuit.mcmt`` முறையை நீக்கியது. முறையைப் பயன்படுத்துவதற்குப் பதிலாக, தயவுசெய்து :class: `q qiskit.circuit.library.MCMT` வகுப்பைப் பயன்படுத்தவும் அதற்கு பதிலாக பல கட்டுப்பாட்டு மல்டி-டார்கெட் கேட்டை உருவாக்கி, ஒரு சுற்றுக்குச் சேர்க்க, :meth: `qiskit.circuit.QuantumCircuit.append` அல்லது :meth:` qiskit.circuit.QuantumCircuit.compose` ஐப் பயன்படுத்தவும்.

source: For example, you can replace::
ta_in: உதாரணமாக, நீங்கள் மாற்றலாம்::

source: with::
ta_in: உடன்::

source: Removed the ``QuantumCircuit.diag_gate`` method which has been deprecated since the Qiskit Terra 0.14.0 release in April 2020. Instead, use the :meth:`~qiskit.circuit.QuantumCircuit.diagonal` method of :class:`~qiskit.circuit.QuantumCircuit`.
ta_in: ஏப்ரல் 2020 இல் கிஸ்கிட் டெர்ரா 0.14.0 வெளியீட்டிலிருந்து நீக்கப்பட்ட `` QuantumCircuit.diag_gate`` முறையை நீக்கியது. அதற்கு பதிலாக, இதைப் பயன்படுத்தவும்:meth: `~qiskit.circuit.QuantumCircuit.diagonal` முறை:class:` ~ qiskit.circuit.QuantumCircuit`.

source: Removed the ``QuantumCircuit.ucy`` method which has been deprecated since the Qiskit Terra 0.14.0 release in April 2020. Instead, use the :meth:`~qiskit.circuit.QuantumCircuit.ucry` method of :class:`~qiskit.circuit.QuantumCircuit`.
ta_in: ஏப்ரல் 2020 இல் கிஸ்கிட் டெர்ரா 0.14.0 வெளியீட்டிலிருந்து நீக்கப்பட்ட ``QuantumCircuit.ucy`` முறை நீக்கப்பட்டது. அதற்கு பதிலாக, இதைப் பயன்படுத்தவும்:meth: `~qiskit.circuit.QuantumCircuit.ucry` இன் முறை:class:` ~ qiskit.circuit.QuantumCircuit`.

source: The previously deprecated ``mirror()`` method for :class:`qiskit.circuit.QuantumCircuit` has been removed. It was deprecated in the 0.15.0 release. The :meth:`qiskit.circuit.QuantumCircuit.reverse_ops` method should be used instead since mirroring could be confused with swapping the output qubits of the circuit. The ``reverse_ops()`` method only reverses the order of gates that are applied instead of mirroring.
ta_in: இதற்கு முன்னர் நீக்கப்பட்ட ``mirror() `` முறை:class: `qiskit.circuit.QuantumCircuit` அகற்றப்பட்டது. இது 0.15.0 வெளியீட்டில் நீக்கப்பட்டது. :meth: `qiskit.circuit.QuantumCircuit.reverse_ops` முறையைப் பயன்படுத்த வேண்டும், ஏனெனில் பிரதிபலிப்பு சுற்றுக்கான வெளியீட்டு வினைகளை மாற்றுவதில் குழப்பமடையக்கூடும். ``reverse_ops()`` முறை பிரதிபலிப்பதற்குப் பதிலாக பயன்படுத்தப்படும் வாயில்களின் வரிசையை மட்டுமே மாற்றியமைக்கிறது.

source: The previously deprecated support passing a float (for the ``scale`` kwarg as the first positional argument to the :meth:`qiskit.circuit.QuantumCircuit.draw` has been removed. It was deprecated in the 0.12.0 release. The first positional argument to the :meth:`qiskit.circuit.QuantumCircuit.draw` method is now the ``output`` kwarg which does not accept a float. Instead you should be using ``scale`` as a named kwarg instead of using it positionally.
ta_in: ஒரு மிதவை கடந்து செல்வதற்கு முன்னர் நீக்கப்பட்ட ஆதரவு (``scale`` குவார்குக்கான முதல் நிலை வாதமாக:meth: `qiskit.circuit.QuantumCircuit.draw` அகற்றப்பட்டது. இது 0.12.0 வெளியீட்டில் நீக்கப்பட்டது. முதல் நிலை வாதம்:meth:`qiskit.circuit.QuantumCircuit.draw` முறை இப்போது``output`` குவார்க் ஆகும், இது ஒரு மிதவை ஏற்காது. அதற்கு பதிலாக நீங்கள்``scale`` என பெயரிடப்பட்ட குவார்க்காகப் பயன்படுத்த வேண்டும் அதை நிலை ரீதியாகப் பயன்படுத்துகிறது.

source: For example, if you were previously calling ``draw`` with::
ta_in: எடுத்துக்காட்டாக, நீங்கள் முன்பு ``draw`` உடன் அழைத்திருந்தால்::

source: this would now need to be::
ta_in: இது இப்போது இருக்க வேண்டும்::

source: Features of Qiskit Pulse (:mod:`qiskit.pulse`) which were deprecated in the 0.15.0 release (August, 2020) have been removed. The full set of changes are:
ta_in: 0.15.0 வெளியீட்டில் (ஆகஸ்ட், 2020) நீக்கப்பட்ட Qiskit பல்ஸ் (:mod: `qiskit.pulse`) இன் அம்சங்கள் அகற்றப்பட்டுள்ளன. மாற்றங்களின் முழு தொகுப்பு:

source: Module
ta_in: தொகுதி

source: Old
ta_in: பழைய

source: New
ta_in: புதிய

source: (module rename)
ta_in: (தொகுதி மறுபெயரிடு)

source: ``pulse.pulse_lib`` Module
ta_in: ``pulse.pulse_lib`` தொகுதி

source: Class
ta_in: வகுப்பு

source: Old method
ta_in: பழைய முறை

source: New method
ta_in: புதிய முறைகள்

source: N/A. Commands and Instructions have been unified. Use :meth:`~qiskit.pulse.instructions.Instruction.operands` to get information about the instruction data.
ta_in: N/A. கட்டளைகளும் வழிமுறைகளும் ஒன்றிணைக்கப்பட்டுள்ளன. அறிவுறுத்தல் தரவைப் பற்றிய தகவல்களைப் பெற :meth: `~ qiskit.pulse.instructions.Instruction.operands` ஐப் பயன்படுத்தவும்.

source: :meth:`~qiskit.pulse.instructions.Acquire.acquire`, :meth:`~qiskit.pulse.instructions.Acquire.mem_slot`, :meth:`~qiskit.pulse.instructions.Acquire.reg_slot`. (The :class:`~qiskit.pulse.instructions.Acquire` instruction no longer broadcasts across multiple qubits.)
ta_in: :meth: `~ qiskit.pulse.instructions.Acquire.acquire` ,:meth:` ~ qiskit.pulse.instructions.Acquire.mem_slot` ,:meth: `~ qiskit.pulse.instructions.Acquire.reg_slot`. (தி:class: `~ qiskit.pulse.instructions.Acquire` அறிவுறுத்தல் இனி பல வினாடிகளில் ஒளிபரப்பப்படாது.)

source: The dictionary previously held on :class:`~qiskit.dagcircuit.DAGCircuit` edges has been removed. Instead, edges now hold the :class:`~qiskit.circuit.Bit` instance which had previously been included in the dictionary as its ``'wire'`` field. Note that the NetworkX graph returned by :meth:`~qiskit.dagcircuit.DAGCircuit.to_networkx` will still have a dictionary for its edge attributes, but the ``'name'`` field will no longer be populated.
ta_in: முன்னர் வைத்திருந்த அகராதி :class: `~ qiskit.dagcircuit.DAGCircuit` விளிம்புகள் அகற்றப்பட்டன. அதற்கு பதிலாக, விளிம்புகள் இப்போது: வர்க்கத்தை வைத்திருக்கின்றன :class: `~ qiskit.circuit.Bit` உதாரணம் இதற்கு முன்னர் அகராதியில் அதன்` `'wire'` புலமாக சேர்க்கப்பட்டிருந்தது. நெட்வொர்க்எக்ஸ் வரைபடம் வழங்கியதை நினைவில் கொள்க :meth: `~ qiskit.dagcircuit.DAGCircuit.to_networkx` அதன் விளிம்பு பண்புகளுக்கு இன்னும் ஒரு அகராதியைக் கொண்டிருக்கும், ஆனால்` `'name'` புலம் இனி மக்கள்தொகை பெறாது.
