Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: Moving forward the ``circuit_drawer()`` function will be the sole interface for circuit drawing in the visualization module. Prior to the 0.7 release there were several other functions which either used different output backends or changed the output for drawing circuits. However, all those other functions have been deprecated and that functionality has been integrated as options on ``circuit_drawer()``.
ta_in: ``circuit_drawer()`` செயல்பாடு முன்னோக்கி நகர்வது காட்சிப்படுத்தல் தொகுதியில் சுற்று வரைபடத்திற்கான ஒரே இடைமுகமாக இருக்கும். 0.7 வெளியீட்டிற்கு முன்னர் வேறு பல செயல்பாடுகள் இருந்தன, அவை வெவ்வேறு வெளியீட்டு பின்தளத்தில் பயன்படுத்தப்பட்டன அல்லது சுற்றுகள் வரைவதற்கான வெளியீட்டை மாற்றின. இருப்பினும், மற்ற அனைத்து செயல்பாடுகளும் நீக்கப்பட்டன, மேலும் அந்த செயல்பாடு `` circuit_drawer()`` இல் விருப்பங்களாக ஒருங்கிணைக்கப்பட்டுள்ளது.

source: For the other visualization functions, ``plot_histogram()`` and ``plot_state()`` there are also a few changes to check when upgrading. First is the output from these functions has changed, in prior releases these would interactively show the output visualization. However that has changed to instead return a ``matplotlib.Figure`` object. This provides much more flexibility and options to interact with the visualization prior to saving or showing it. This will require adjustment to how these functions are consumed. For example, prior to this release when calling::
ta_in: பிற காட்சிப்படுத்தல் செயல்பாடுகளுக்கு, ``plot_histogram()`` மற்றும் ``plot_state()`` மேம்படுத்தும்போது சரிபார்க்க சில மாற்றங்களும் உள்ளன. முதலாவதாக, இந்த செயல்பாடுகளின் வெளியீடு மாறிவிட்டது, முந்தைய வெளியீடுகளில் இவை வெளியீட்டு காட்சிப்படுத்தலை ஊடாடும். இருப்பினும் அதற்கு பதிலாக ``matplotlib.Figure`` பொருளைத் திருப்புவதற்கு மாற்றப்பட்டுள்ளது. இது காட்சிப்படுத்தலுடன் சேமிக்க அல்லது காண்பிப்பதற்கு முன்பு தொடர்புகொள்வதற்கான அதிக நெகிழ்வுத்தன்மையையும் விருப்பங்களையும் வழங்குகிறது. இந்த செயல்பாடுகள் எவ்வாறு நுகரப்படுகின்றன என்பதற்கான சரிசெய்தல் இதற்கு தேவைப்படும். எடுத்துக்காட்டாக, அழைக்கும் போது இந்த வெளியீட்டிற்கு முன்::

source: would open up new windows (depending on matplotlib backend) to display the visualization. However starting in the 0.7 you'll have to call ``show()`` on the output to mirror this behavior. For example::
ta_in: காட்சிப்படுத்தல் காண்பிக்க புதிய சாளரங்களை (மேட்லோட்லிப் பின்தளத்தில் பொறுத்து) திறக்கும். இருப்பினும் 0.7 இல் தொடங்கி இந்த நடத்தை பிரதிபலிக்க வெளியீட்டில் ``show() `` ஐ அழைக்க வேண்டும். உதாரணத்திற்கு::

source: Note that this is only for when running outside of Jupyter. No adjustment is required inside a Jupyter environment because Jupyter notebooks natively understand how to render ``matplotlib.Figure`` objects.
ta_in: இது ஜூபிட்டருக்கு வெளியே இயங்கும் போது மட்டுமே என்பதை நினைவில் கொள்க. ஜூபிட்டர் சூழலுக்குள் எந்த மாற்றமும் தேவையில்லை, ஏனென்றால் `` Matplotlib.Figure`` பொருள்களை எவ்வாறு வழங்குவது என்பதை ஜூபிட்டர் குறிப்பேடுகள் பூர்வீகமாக புரிந்துகொள்கின்றன.

source: However, returning the Figure object provides additional flexibility for dealing with the output. For example instead of just showing the figure you can now directly save it to a file by leveraging the ``savefig()`` method. For example::
ta_in: இருப்பினும், படம் பொருளைத் திருப்புவது வெளியீட்டைக் கையாள்வதற்கு கூடுதல் நெகிழ்வுத்தன்மையை வழங்குகிறது. எடுத்துக்காட்டாக, உருவத்தைக் காண்பிப்பதற்குப் பதிலாக, ``savefig() `` முறையை மேம்படுத்துவதன் மூலம் இப்போது அதை நேரடியாக ஒரு கோப்பில் சேமிக்க முடியும். உதாரணத்திற்கு::

source: The other key aspect which has changed with these functions is when running under jupyter. In the 0.6 release ``plot_state()`` and ``plot_histogram()`` when running under jupyter the default behavior was to use the interactive Javascript plots if the externally hosted Javascript library for rendering the visualization was reachable over the network. If not it would just use the matplotlib version. However in the 0.7 release this no longer the case, and separate functions for the interactive plots, ``iplot_state()`` and ``iplot_histogram()`` are to be used instead. ``plot_state()`` and ``plot_histogram()`` always use the matplotlib versions.
ta_in: இந்த செயல்பாடுகளுடன் மாறியுள்ள மற்ற முக்கிய அம்சம் ஜூபிட்டரின் கீழ் இயங்கும் போது ஆகும். 0.6 வெளியீட்டில் ``plot_state()`` மற்றும் ``plot_histogram()`` ஜூபிட்டரின் கீழ் இயங்கும் போது இயல்புநிலை நடத்தை, காட்சிப்படுத்தல் வழங்குவதற்காக வெளிப்புறமாக ஹோஸ்ட் செய்யப்பட்ட ஜாவாஸ்கிரிப்ட் நூலகத்தை நெட்வொர்க்கில் அடைய முடிந்தால், ஊடாடும் ஜாவாஸ்கிரிப்ட் அடுக்குகளைப் பயன்படுத்துவதாகும். இல்லையென்றால் அது matplotlib பதிப்பைப் பயன்படுத்தும். இருப்பினும் 0.7 வெளியீட்டில் இது இனி இருக்காது, மேலும் ஊடாடும் அடுக்குகளுக்கான தனி செயல்பாடுகள், `` iplot_state () `` மற்றும் `` iplot_histogram () `` ஆகியவை அதற்கு பதிலாக பயன்படுத்தப்பட வேண்டும். `` plot_state() `` மற்றும் ``plot_histogram() `` எப்போதும் மேட்லோட்லிப் பதிப்புகளைப் பயன்படுத்துகின்றன.

source: Additionally, starting in this release the ``plot_state()`` function is deprecated in favor of calling individual methods for each method of plotting a quantum state. While the ``plot_state()`` function will continue to work until the 0.9 release, it will emit a warning each time it is used. The
ta_in: கூடுதலாக, இந்த வெளியீட்டில் தொடங்கி `` plot_state() `` செயல்பாடு ஒரு குவாண்டம் நிலையைத் திட்டமிடும் ஒவ்வொரு முறைக்கும் தனிப்பட்ட முறைகளை அழைப்பதற்கு ஆதரவாக நீக்கப்படுகிறது. ``plot_state() `` செயல்பாடு 0.9 வெளியீடு வரை தொடர்ந்து செயல்படும், அது ஒவ்வொரு முறையும் பயன்படுத்தப்படும்போது ஒரு எச்சரிக்கையை வெளியிடும். தி

source: The same is true for the interactive JS equivalent, ``iplot_state()``. The function names are all the same, just with a prepended `i` for each function. For example, ``iplot_state(rho, method='paulivec')`` is ``iplot_state_paulivec(rho)``.
ta_in: ஊடாடும் JS சமமான `` iplot_state () `` க்கும் இது பொருந்தும். ஒவ்வொரு செயல்பாட்டிற்கும் ஒரு முன்னரே தயாரிக்கப்பட்ட `i` உடன், செயல்பாட்டு பெயர்கள் அனைத்தும் ஒரே மாதிரியானவை. எடுத்துக்காட்டாக, `` iplot_state (rho, method = 'paulivec') `` என்பது `` iplot_state_paulivec (rho) ``.

source: Changes to Backends
ta_in: பின்தளத்தில் மாற்றங்கள்

source: With the improvements made in the 0.7 release there are a few things related to backends to keep in mind when upgrading. The biggest change is the restructuring of the provider instances in the root ``qiskit``` namespace. The ``Aer`` provider is not installed by default and requires the installation of the ``qiskit-aer`` package. This package contains the new high performance fully featured simulator. If you installed via ``pip install qiskit`` you'll already have this installed. The python simulators are now available under ``qiskit.BasicAer`` and the old C++ simulators are available with ``qiskit.LegacySimulators``. This also means that the implicit fallback to python based simulators when the C++ simulators are not found doesn't exist anymore. If you ask for a local C++ based simulator backend, and it can't be found an exception will be raised instead of just using the python simulator instead.
ta_in: 0.7 வெளியீட்டில் செய்யப்பட்ட மேம்பாடுகளுடன், மேம்படுத்தும் போது மனதில் கொள்ள வேண்டிய பின்தளத்தில் தொடர்புடைய சில விஷயங்கள் உள்ளன. `` qiskit`` பெயர்வெளியில் வழங்குநர் நிகழ்வுகளை மறுசீரமைப்பதே மிகப்பெரிய மாற்றமாகும். ``Aer`` வழங்குநர் இயல்பாக நிறுவப்படவில்லை, மேலும் ``qiskit-aer`` தொகுப்பை நிறுவ வேண்டும். இந்த தொகுப்பு புதிய உயர் செயல்திறன் முழுமையாக இடம்பெற்ற சிமுலேட்டரைக் கொண்டுள்ளது. ``pip install qiskit`` வழியாக நீங்கள் நிறுவியிருந்தால், இதை ஏற்கனவே நிறுவியிருப்பீர்கள். பைதான் சிமுலேட்டர்கள் இப்போது `` qiskit.BasicAer`` இன் கீழ் கிடைக்கின்றன, மேலும் பழைய C ++ சிமுலேட்டர்கள் `` qiskit.LegacySimulators`` உடன் கிடைக்கின்றன. சி ++ சிமுலேட்டர்கள் கிடைக்காதபோது பைத்தான் அடிப்படையிலான சிமுலேட்டர்களுக்கான மறைமுகமான குறைவு இனி இருக்காது என்பதும் இதன் பொருள். நீங்கள் ஒரு உள்ளூர் சி ++ அடிப்படையிலான சிமுலேட்டர் பின்தளத்தில் கேட்டால், அதற்கு பதிலாக பைதான் சிமுலேட்டரைப் பயன்படுத்துவதற்குப் பதிலாக விதிவிலக்கு எழுப்பப்படும்.

source: Additionally the previously deprecation top level functions ``register()`` and ``available_backends()`` have been removed. Also, the deprecated ``backend.parameters()`` and ``backend.calibration()`` methods have been removed in favor of ``backend.properties()``. You can refer to the 0.6 release notes section :ref:`backends` for more details on these changes.
ta_in: கூடுதலாக, முன்னர் நீக்கப்பட்ட உயர் நிலை செயல்பாடுகள் ``register()`` மற்றும் `` available_backends() `` நீக்கப்பட்டன. மேலும், நீக்கப்பட்ட ``backend.parameters()`` மற்றும் `` backend.calibration()`` முறைகள் ``backend.properties()`` க்கு ஆதரவாக அகற்றப்பட்டுள்ளன. இந்த மாற்றங்கள் குறித்த கூடுதல் விவரங்களுக்கு நீங்கள் 0.6 வெளியீட்டு குறிப்புகள் பகுதியைப் பார்க்கலாம்:ref: `backends`.

source: The ``backend.jobs()`` and ``backend.retrieve_jobs()`` calls no longer return results from those jobs. Instead you must call the ``result()`` method on the returned jobs objects.
ta_in: ``Backend.jobs()`` மற்றும் ``backend.retrieve_jobs()`` அழைப்புகள் இனி அந்த வேலைகளின் முடிவுகளைத் தராது. அதற்கு பதிலாக நீங்கள் திரும்பிய வேலைவாய்ப்பு பொருள்களில் ``result()`` முறையை அழைக்க வேண்டும்.

source: Changes to the compiler, transpiler, and unrollers
ta_in: கம்பைலர், டிரான்ஸ்பைலர் மற்றும் அன்ரோலர்களில் மாற்றங்கள்

source: As part of an effort to stabilize the compiler interfaces there have been several changes to be aware of when leveraging the compiler functions. First it is important to note that the ``qiskit.transpiler.transpile()`` function now takes a QuantumCircuit object (or a list of them) and returns a QuantumCircuit object (or a list of them). The DAG processing is done internally now.
ta_in: கம்பைலர் இடைமுகங்களை உறுதிப்படுத்தும் முயற்சியின் ஒரு பகுதியாக, கம்பைலர் செயல்பாடுகளை மேம்படுத்தும் போது விழிப்புடன் இருக்க பல மாற்றங்கள் செய்யப்பட்டுள்ளன. முதலில் ``qiskit.transpiler.transpile ()`` செயல்பாடு இப்போது ஒரு குவாண்டம் சர்க்யூட் பொருளை (அல்லது அவற்றின் பட்டியல்) எடுத்து ஒரு குவாண்டம் சர்க்யூட் பொருளை (அல்லது அவற்றின் பட்டியல்) தருகிறது என்பதைக் கவனத்தில் கொள்ள வேண்டும். DAG செயலாக்கம் இப்போது உள்நாட்டில் செய்யப்படுகிறது.

source: You can also easily switch between circuits, DAGs, and Qobj now using the functions in ``qiskit.converters``.
ta_in: ``Qiskit.converters`` இல் உள்ள செயல்பாடுகளைப் பயன்படுத்தி இப்போது சுற்றுகள், DAG கள் மற்றும் Qobj க்கு இடையில் எளிதாக மாறலாம்.

source: Aer provides three simulator backends:
ta_in: Aer மூன்று சிமுலேட்டர் பின்தளத்தில் வழங்குகிறது:

source: ``QasmSimulator``: simulate experiments and return measurement outcomes
ta_in: `` QasmSimulator``: சோதனைகளை உருவகப்படுத்தி, அளவீட்டு விளைவுகளைத் தரவும்

source: ``StatevectorSimulator``: return the final statevector for a quantum circuit acting on the all zero state
ta_in: ``StatevectorSimulator``: அனைத்து பூஜ்ஜிய நிலையிலும் செயல்படும் ஒரு குவாண்டம் சுற்றுக்கான இறுதி ஸ்டேட்வெக்டரைத் திருப்பி விடுங்கள்

source: ``UnitarySimulator``: return the unitary matrix for a quantum circuit
ta_in: ``UnitarySimulator``: ஒரு குவாண்டம் சுற்றுக்கு யூனிட்டரி மேட்ரிக்ஸைத் திருப்பி விடுங்கள்

source: ``noise`` module: contains advanced noise modeling features for the ``QasmSimulator``
ta_in: `` noise`` தொகுதி: `` QasmSimulator`` க்கான மேம்பட்ட சத்தம் மாடலிங் அம்சங்களைக் கொண்டுள்ளது

source: ``NoiseModel``, ``QuantumError``, ``ReadoutError`` classes for simulating a Qiskit quantum circuit in the presence of errors
ta_in: பிழைகள் முன்னிலையில் ஒரு கிஸ்கிட் குவாண்டம் சுற்று உருவகப்படுத்துவதற்கான `` NoiseModel``, `` QuantumError``, `` ReadoutError`` வகுப்புகள்

source: ``errors`` submodule including functions for generating ``QuantumError`` objects for the following types of quantum errors: Kraus, mixed unitary, coherent unitary, Pauli, depolarizing, thermal relaxation, amplitude damping, phase damping, combined phase and amplitude damping
ta_in: பின்வரும் வகையான குவாண்டம் பிழைகளுக்கான ``QuantumError`` பொருள்களை உருவாக்குவதற்கான செயல்பாடுகள் உட்பட ``errors`` துணை தொகுதி: க்ராஸ், கலப்பு ஒற்றுமை, ஒத்திசைவான ஒற்றுமை, பவுலி, டிபோலரைசிங், வெப்ப தளர்வு, வீச்சு தணித்தல், கட்டம் குறைத்தல், ஒருங்கிணைந்த கட்டம் மற்றும் வீச்சு தணித்தல்

source: ``device`` submodule for automatically generating a noise model based on the ``BackendProperties`` of a device
ta_in: ஒரு சாதனத்தின் `` BackendProperties`` அடிப்படையில் சத்தம் மாதிரியை தானாக உருவாக்குவதற்கான ``device`` துணை தொகுதி

source: ``utils`` module:
ta_in: ``utils`` தொகுதி:

source: ``qobj_utils`` provides functions for directly modifying a Qobj to insert special simulator instructions not yet supported through the Qiskit Terra API.
ta_in: Qiskit Terra API மூலம் இதுவரை ஆதரிக்கப்படாத சிறப்பு சிமுலேட்டர் வழிமுறைகளைச் செருகுவதற்காக `` qobj_utils`` ஒரு Qobj ஐ நேரடியாக மாற்றுவதற்கான செயல்பாடுகளை வழங்குகிறது.

source: Programmatic APIs for algorithms and components -- each component can now be instantiated and initialized via a single (non-empty) constructor call
ta_in: வழிமுறைகள் மற்றும் கூறுகளுக்கான நிரல் API கள் - ஒவ்வொரு கூறுகளும் இப்போது ஒற்றை (காலியாக இல்லாத) கட்டமைப்பாளர் அழைப்பு வழியாக உடனடி மற்றும் துவக்கப்படலாம்

source: ``QuantumInstance`` API for algorithm/backend decoupling -- ``QuantumInstance`` encapsulates a backend and its settings
ta_in: அல்காரிதம் / பின்தளத்தில் டிகூப்பிளிங்கிற்கான ``QuantumInstance`` ஏபிஐ - ``QuantumInstance`` ஒரு பின்தளத்தில் மற்றும் அதன் அமைப்புகளை இணைக்கிறது

source: Updated documentation and Jupyter Notebooks illustrating the new programmatic APIs
ta_in: புதுப்பிக்கப்பட்ட ஆவணங்கள் மற்றும் புதிய நிரல் API களை விளக்கும் ஜூபிட்டர் குறிப்பேடுகள்

source: Transparent parallelization for gradient-based optimizers
ta_in: சாய்வு அடிப்படையிலான உகப்பாக்கிகளுக்கான வெளிப்படையான இணைப்படுத்தல்

source: Multiple-Controlled-NOT (cnx) operation
ta_in: பல-கட்டுப்படுத்தப்பட்ட- NOT (cnx) செயல்பாடு

source: Pluggable algorithmic component ``RandomDistribution``
ta_in: சொருகக்கூடிய வழிமுறை கூறு `` RandomDistribution``

source: Concrete implementations of ``RandomDistribution``: ``BernoulliDistribution``, ``LogNormalDistribution``, ``MultivariateDistribution``, ``MultivariateNormalDistribution``, ``MultivariateUniformDistribution``, ``NormalDistribution``, ``UniformDistribution``, and ``UnivariateDistribution``
ta_in: `` RandomDistribution`` இன் உறுதியான செயலாக்கங்கள்: ``BernoulliDistribution``, ``LogNormalDistribution``, ``MultivariateDistribution``, ``MultivariateNormalDistribution``, ``MultivariateUniformDistribution``, ``NormalDistribution``, ``UniformDistribution``, மற்றும் `` UnivariateDistribution``

source: Concrete implementations of ``UncertaintyProblem``: ``FixedIncomeExpectedValue``, ``EuropeanCallExpectedValue``, and ``EuropeanCallDelta``
ta_in: ``UncertaintyProblem`` இன் உறுதியான செயலாக்கங்கள்: ``FixedIncomeExpectedValue``, ``EuropeanCallExpectedValue``, மற்றும் ``EuropeanCallDelta``

source: Amplitude Estimation algorithm
ta_in: Amplitude Estimation படிமம்

source: Qiskit Optimization: New Ising models for optimization problems exact cover, set packing, vertex cover, clique, and graph partition
ta_in: Qiskit உகப்பாக்கம்: தேர்வுமுறை சிக்கல்களுக்கான புதிய ஐசிங் மாதிரிகள் சரியான கவர், செட் பேக்கிங், வெர்டெக்ஸ் கவர், க்ளிக் மற்றும் வரைபட பகிர்வு

source: New feature maps extending the ``FeatureMap`` pluggable interface: ``PauliExpansion`` and ``PauliZExpansion``
ta_in: `` FeatureMap`` சொருகக்கூடிய இடைமுகத்தை நீட்டிக்கும் புதிய அம்ச வரைபடங்கள்: ``PauliExpansion`` மற்றும் ``PauliZExpansion``

source: Training model serialization/deserialization mechanism
ta_in: பயிற்சி மாதிரி வரிசைப்படுத்தல் / தேசமயமாக்கல் வழிமுறை

source: Qiskit Finance:
ta_in: Qiskit நிதி:

source: Amplitude estimation for Bernoulli random variable: illustration of amplitude estimation on a single qubit problem
ta_in: பெர்னௌலி சீரற்ற மாறிக்கான வீச்சு மதிப்பீடு: ஒற்றை குவிட் சிக்கலில் வீச்சு மதிப்பீட்டின் விளக்கம்

source: Loading of multiple univariate and multivariate random distributions
ta_in: பெரும்பாலான தனிமங்களின் ஏற்றுமதி மற்றும் பல ஒழுங்குபடுத்துதல்

source: European call option: expected value and delta (using univariate distributions)
ta_in: ஐரோப்பிய அழைப்பின் விருப்பம்: எதிர்பார்க்கப்பட்ட மதிப்பு மற்றும் டெல்டா (univariate distributions)

source: Fixed income asset pricing: expected value (using multivariate distributions)
ta_in: நிலையான வருமானம் அச்சுப்பொறி: எதிர்பார்க்கப்பட்ட மதிப்பு (multivariate distributions)

source: The Pauli string in ``Operator`` class is aligned with Terra 0.7. Now the order of a n-qubit pauli string is ``q_{n-1}...q{0}`` Thus, the (de)serialier (``save_to_dict`` and ``load_from_dict``) in the ``Operator`` class are also changed to adopt the changes of ``Pauli`` class.
ta_in: `` Operator`` வகுப்பில் உள்ள பவுலி சரம் டெர்ரா 0.7 உடன் சீரமைக்கப்பட்டுள்ளது. இப்போது ஒரு n-qubit pauli சரத்தின் வரிசை `` q_ {n-1}... q {0} `` இவ்வாறு, (டி) சீரியல் (``save_to_dict`` மற்றும் `'load_from_dict``) ``Pauli`` வகுப்பின் மாற்றங்களை ஏற்க `'Operator`` வகுப்பும் மாற்றப்பட்டுள்ளது.

source: ``HartreeFock`` component of pluggable type ``InitialState`` moved to Qiskit Chemistry
ta_in: சொருகக்கூடிய வகையின் ``HartreeFock`` கூறு ``InitialState`` கிஸ்கிட் வேதியியலுக்கு நகர்த்தப்பட்டது

source: ``UCCSD`` component of pluggable type ``VariationalForm`` moved to Qiskit Chemistry
ta_in: சொருகக்கூடிய வகையின் ``UCCSD`` கூறு ``VariationalForm`` Qiskit வேதியியலுக்கு நகர்த்தப்பட்டது

source: Terra 0.6
ta_in: டெரா 0. 6

source: This release includes a redesign of internal components centered around a new, formal communication format (Qobj), along with long awaited features to improve the user experience as a whole. The highlights, compared to the 0.5 release, are:
ta_in: இந்த விடுதலை ஒரு புதிய, ஆரம்ப தகவல் தொடர்பு வடிவமைப்பு (Qobj) ஆகியவற்றின் மீதான ஒரு மறுபடியும், பயனர் அனுபவத்தை முழுவதுமாக மேம்படுத்துவதற்கு நீண்ட காலாவதியான அம்சங்களையும் கொண்டுள்ளது. The highlights, ஒப்பிடுகையில் 0.5 வெளியீடு:

source: Improvements for inter-operability (based on the Qobj specification) and extensibility (facilities for extending Qiskit with new backends in a seamless way)
ta_in: உள்நுழைவுகளுக்கான முன்னேற்றங்கள் (Qobj specification (based on the Qobj specification) and extensibility (வளிமங்கள் புதிய பின்னணிகளுடன் விரிவாக்குவதற்கு வசதிகள்)

source: New options for handling credentials and authentication for the IBM Q backends, aimed at simplifying the process and supporting automatic loading of user credentials
ta_in: IBM Q பின்னணிகளுக்கான சான்றுகள் மற்றும் அணுகுமுறையை கையாளும் புதிய விருப்பங்கள், பயனர் சான்றுகளின் தானியங்கி ஏற்றத்தை ஆதரவளிக்கும்

source: A revamp of the visualization utilities: stylish interactive visualizations are now available for Jupyter users, along with refinements for the circuit drawer (including a matplotlib-based version)
ta_in: காட்சிப்படுத்தல் பயன்பாடுகளின் மறுசீரமைப்பு: ஸ்டைலான ஊடாடும் காட்சிப்படுத்தல்கள் இப்போது ஜூபிட்டர் பயனர்களுக்குக் கிடைக்கின்றன, சர்க்யூட் டிராயருக்கான சுத்திகரிப்புகளுடன் (மேட்லோட்லிப் அடிப்படையிலான பதிப்பு உட்பட)

source: Performance improvements centered around circuit transpilation: the basis for a more flexible and modular architecture have been set, including parallelization of the circuit compilation and numerous optimizations
ta_in: சர்க்யூட் டிரான்ஸ்பிளேஷனை மையமாகக் கொண்ட செயல்திறன் மேம்பாடுகள்: சர்க்யூட் தொகுப்பின் இணையானமயமாக்கல் மற்றும் ஏராளமான மேம்படுத்தல்கள் உள்ளிட்ட மிகவும் நெகிழ்வான மற்றும் மட்டு கட்டமைப்பிற்கான அடிப்படை அமைக்கப்பட்டுள்ளது

source: Please note that some backwards-incompatible changes have been introduced during this release -- the following notes contain information on how to adapt to the new changes.
ta_in: இந்த விடுதலை போது சில பின்னணி மாற்றங்கள் செய்யப்பட்டுள்ளது என்று குறிப்பிடுக. பின்வரும் குறிப்புகள் இந்த மாற்றங்களை எப்படி ஏற்றுக்கொள்ளும் எப்படி தகவல்களை கொண்டுள்ளது.

source: Removal of ``QuantumProgram``
ta_in: `` குவாண்டம் புரோகிராம்`` ஐ அகற்றுதல்

source: As hinted during the 0.5 release, the deprecation of the ``QuantumProgram`` class has now been completed and is no longer available, in favor of working with the individual components (:class:`~qiskit.backends.basejob.BaseJob`, :class:`~qiskit._quantumcircuit.QuantumCircuit`, :class:`~qiskit._classicalregister.ClassicalRegister`, :class:`~qiskit._quantumregister.QuantumRegister`, :mod:`~qiskit`) directly.
ta_in: 0.5 வெளியீட்டின் போது சுட்டிக்காட்டப்பட்டபடி, `` குவாண்டம் புரோகிராம்`` வகுப்பின் நீக்கம் இப்போது நிறைவடைந்துள்ளது, மேலும் அது தனிப்பட்ட கூறுகளுடன் பணிபுரிய ஆதரவாக இனி கிடைக்காது (: வகுப்பு: `~ qiskit.backends.basejob.BaseJob`, : வகுப்பு: `~ qiskit._quantumcircuit.QuantumCircuit` ,: வகுப்பு:` ~ qiskit._classicalregister.ClassicalRegister.

source: Please check the :ref:`0.5 release notes <quantum-program-0-5>` and the examples for details about the transition::
ta_in: தயவுசெய்து சரிபார்க்கவும்: ref: `0.5 வெளியீட்டுக் குறிப்புகள் <quantum-program-0-5>` மற்றும் மாற்றம் குறித்த விவரங்களுக்கான எடுத்துக்காட்டுகள் ::

source: IBM Q Authentication and ``Qconfig.py``
ta_in: IBM Q அங்கீகாரம் மற்றும் `` Qconfig.py``

source: The managing of credentials for authenticating when using the IBM Q backends has been expanded, and there are new options that can be used for convenience:
ta_in: IBM Q பின்னணிகளை பயன்படுத்தும்போது அங்கீகரிக்க பரிந்துரைகளின் நிர்வாகம் விரிவாக்கப்பட்டு, வலைப்பதிவுகளுக்கு பயன்படும் புதிய விருப்பங்கள் உள்ளன:

source: save your credentials in disk once, and automatically load them in future sessions. This provides a one-off mechanism::
ta_in: உங்கள் சான்றுகள் தட்டில் ஒரு முறை சேமிக்க, மற்றும் தானாகவே அவற்றை எதிர்காண அமர்வுகளாக ஏற்றவும். இது ஒரு ஒற்றை மின்சாரம் வழங்குகிறது::

source: afterwards, your credentials can be automatically loaded from disk by invoking :meth:`~qiskit.backends.ibmq.ibmqprovider.IBMQ.load_accounts`::
ta_in: பின்னர், உங்கள் நற்சான்றிதழ்களை வட்டில் இருந்து தானாகவே ஏற்ற முடியும்: மெத்: `~ qiskit.backends.ibmq.ibmqprovider.IBMQ.load_accounts` ::

source: or you can load only specific accounts if you only want to use those in a session::
ta_in: அல்லது ஒரு அமர்வில் உள்ளவற்றை மட்டுமே பயன்படுத்த விரும்பினால் குறிப்பிட்ட கணக்குகளை மட்டுமே ஏற்ற முடியும்::

source: use environment variables. If ``QE_TOKEN`` and ``QE_URL`` is set, the ``IBMQ.load_accounts()`` call will automatically load the credentials from them.
ta_in: சூழல் மாறிகள் பயன்படுத்த. `` QE_TOKEN`` மற்றும் `` QE_URL`` ஆகியவை அமைக்கப்பட்டால், `` IBMQ.load_accounts () `` அழைப்பு தானாகவே அவர்களிடமிருந்து சான்றுகளை ஏற்றும்.

source: Additionally, the previous method of having a ``Qconfig.py`` file in the program folder and passing the credentials explicitly is still supported.
ta_in: கூடுதலாக, நிரல் கோப்புறையில் `` Qconfig.py`` கோப்பை வைத்திருப்பதற்கும், சான்றுகளை வெளிப்படையாக அனுப்புவதற்கும் முந்தைய முறை இன்னும் ஆதரிக்கப்படுகிறது.

source: Working with backends
ta_in: பின்னணிகளுடன் பணிசெய்யவும்

source: A new mechanism has been introduced in Terra 0.6 as the recommended way for obtaining a backend, allowing for more powerful and unified filtering and integrated with the new credentials system. The previous top-level methods :meth:`~qiskit.wrapper._wrapper.register`, :meth:`~qiskit.wrapper._wrapper.available_backends` and :meth:`~qiskit.wrapper._wrapper.get_backend` are still supported, but will deprecated in upcoming versions in favor of using the `qiskit.IBMQ` and `qiskit.Aer` objects directly, which allow for more complex filtering.
ta_in: புதிய வழிமுறை டெர்ரா 0.6 இல் ஒரு பின்தளத்தில் பெறுவதற்கான பரிந்துரைக்கப்பட்ட வழியாக அறிமுகப்படுத்தப்பட்டுள்ளது, இது மிகவும் சக்திவாய்ந்த மற்றும் ஒருங்கிணைந்த வடிகட்டலை அனுமதிக்கிறது மற்றும் புதிய நற்சான்றிதழ் அமைப்புடன் ஒருங்கிணைக்கப்படுகிறது. முந்தைய உயர்மட்ட முறைகள்: மெத்: `~ qiskit.wrapper._wrapper.register` ,: மெத்:` ~ qiskit.wrapper._wrapper.available_backends` மற்றும்: மெத்: `~ qiskit.wrapper._wrapper.get_backend` இன்னும் ஆதரிக்கப்படுகின்றன , ஆனால் வரவிருக்கும் பதிப்புகளில் `qiskit.IBMQ` மற்றும்` qiskit.Aer` பொருள்களை நேரடியாகப் பயன்படுத்துவதற்கு ஆதரவாக நீக்கப்படும், இது மிகவும் சிக்கலான வடிகட்டலை அனுமதிக்கும்.
