Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: For example, to list and use a local backend::
ta_in: உதாரணமாக, பட்டியல் மற்றும் ஒரு உள்ளூர் பின்னணியை பயன்படுத்தவும்::

source: And for listing and using remote backends::
ta_in: மற்றும் தொலைதூர பின்னணிகளை உபயோகிக்கவும்::

source: Please note as well that the names of the local simulators have been simplified. The previous names can still be used, but it is encouraged to use the new, shorter names:
ta_in: தயவு செய்து தயவு செய்து, உள்ளூர் உலாவிகளின் பெயர்களை எளிமைப்படுத்தப்பட்டுள்ளன. முந்தைய பெயர்களை இன்னும் பயன்படுத்த முடியும், ஆனால் புதிய, குறுகிய பெயர்களை பயன்படுத்த ஊக்குவித்துள்ளது:

source: Backend and Job API changes
ta_in: பின்னணி மற்றும் பணி API மாற்றங்கள்

source: Jobs submitted to IBM Q backends have improved capabilities. It is possible to cancel them and replenish credits (``job.cancel()``), and to retrieve previous jobs executed on a specific backend either by job id (``backend.retrieve_job(job_id)``) or in batch of latest jobs (``backend.jobs(limit)``)
ta_in: ஐபிஎம் கியூ பின்தளத்தில் சமர்ப்பிக்கப்பட்ட வேலைகள் மேம்பட்ட திறன்களைக் கொண்டுள்ளன. அவற்றை ரத்துசெய்து வரவுகளை நிரப்பவும் (`` job.cancel () ``), மற்றும் ஒரு குறிப்பிட்ட பின்தளத்தில் செயல்படுத்தப்பட்ட முந்தைய வேலைகளை வேலை ஐடி (`` backend.retrieve_job (job_id) ``) அல்லது தொகுப்பில் மீட்டெடுக்க முடியும். சமீபத்திய வேலைகள் (`` பின்தளத்தில்.ஜோப்ஸ் (வரம்பு) ``)

source: Properties for checking each individual job status (``queued``, ``running``, ``validating``, ``done`` and ``cancelled``) no longer exist. If you want to check the job status, use the identity comparison against ``job.status``::
ta_in: ஒவ்வொரு தனிப்பட்ட வேலை நிலையையும் சரிபார்க்கும் பண்புகள் (`` வரிசை``, `` இயங்கும்``, `` சரிபார்க்கும்``, `` முடிந்தது`` மற்றும் `` ரத்துசெய்யப்பட்ட``) இனி இருக்காது. நீங்கள் வேலை நிலையை சரிபார்க்க விரும்பினால், `` job.status``:: க்கு எதிரான அடையாள ஒப்பீட்டைப் பயன்படுத்தவும்::

source: Please consult the new documentation of the :class:`~qiskit.backends.ibmq.ibmqjob.IBMQJob` class to get further insight in how to use the simplified API.
ta_in: எளிமைப்படுத்தப்பட்ட API ஐ எவ்வாறு பயன்படுத்துவது என்பது பற்றிய கூடுதல் நுண்ணறிவைப் பெற தயவுசெய்து: வர்க்கத்தின் புதிய ஆவணங்களை அணுகவும்: `~ qiskit.backends.ibmq.ibmqjob.IBMQJob` வகுப்பு.

source: A number of members of :class:`~qiskit.backends.basebackend.BaseBackend` and :class:`~qiskit.backends.basejob.BaseJob` are no longer properties, but methods, and as a result they need to be invoked as functions.
ta_in: பல உறுப்பினர்கள்: வர்க்கம்: `~ qiskit.backends.basebackend.BaseBackend` மற்றும்: class:` ~ qiskit.backends.basejob.BaseJob` இனி பண்புகள் அல்ல, ஆனால் முறைகள், இதன் விளைவாக அவை செயல்படுத்தப்பட வேண்டும் செயல்பாடுகள்.

source: Better Jupyter tools
ta_in: சிறந்த ஜூபிட்டர் கருவிகள்

source: The new release contains improvements to the user experience while using Jupyter notebooks.
ta_in: புதிய வெளியீட்டில் ஜூபிட்டர் நோட்புக்குகளைப் பயன்படுத்தும் போது பயனர் அனுபவத்தின் மேம்பாடுகள் உள்ளன.

source: First, new interactive visualizations of counts histograms and quantum states are provided: :meth:`~qiskit.tools.visualization.plot_histogram` and :meth:`~qiskit.tools.visualization.plot_state`. These methods will default to the new interactive kind when the environment is Jupyter and internet connection exists.
ta_in: முதலாவதாக, எண்ணிக்கைகள் ஹிஸ்டோகிராம்கள் மற்றும் குவாண்டம் நிலைகளின் புதிய ஊடாடும் காட்சிப்படுத்தல்கள் வழங்கப்படுகின்றன:meth: `~ qiskit.tools.visualization.plot_histogram` மற்றும்:meth:` ~ qiskit.tools.visualization.plot_state`. சூழல் ஜூபிட்டராக இருக்கும்போது மற்றும் இணைய இணைப்பு இருக்கும்போது இந்த முறைகள் புதிய ஊடாடும் வகைக்கு இயல்புநிலையாக இருக்கும்.

source: Secondly, the new release provides Jupyter cell magics for keeping track of the progress of your code. Use ``%%qiskit_job_status`` to keep track of the status of submitted jobs to IBM Q backends. Use ``%%qiskit_progress_bar`` to keep track of the progress of compilation/execution.
ta_in: இரண்டாவதாக, புதிய வெளியீடு உங்கள் குறியீட்டின் முன்னேற்றத்தைக் கண்காணிக்க ஜூபிட்டர் செல் மந்திரங்களை வழங்குகிறது. IBM Q பின்தளத்தில் சமர்ப்பிக்கப்பட்ட வேலைகளின் நிலையை கண்காணிக்க `` %% qiskit_job_status`` ஐப் பயன்படுத்தவும். தொகுத்தல் / செயல்படுத்தலின் முன்னேற்றத்தைக் கண்காணிக்க `` %% qiskit_progress_bar`` ஐப் பயன்படுத்தவும்.

source: This release brings a number of improvements to Qiskit, both for the user experience and under the hood. Please refer to the full changelog for a detailed description of the changes - the highlights are:
ta_in: இந்த வெளியீடு பயனர் அனுபவத்திற்காகவும், பேட்டைக்குக் கீழாகவும் Qiskit டில் பல மேம்பாடுகளைக் கொண்டுவருகிறது. மாற்றங்களின் விரிவான விளக்கத்திற்கு முழு சேஞ்ச்லாக் ஐப் பார்க்கவும் - சிறப்பம்சங்கள்:

source: new ``statevector`` :mod:`simulators <qiskit.backends.local>` and feature and performance improvements to the existing ones (in particular to the C++ simulator), along with a reorganization of how to work with backends focused on extensibility and flexibility (using aliases and backend providers)
ta_in: புதிய ``statevector``:mod: `simulators <qiskit.backends.local>` மற்றும் ஏற்கனவே உள்ளவற்றிற்கான அம்சம் மற்றும் செயல்திறன் மேம்பாடுகள் (குறிப்பாக சி ++ சிமுலேட்டருக்கு), மேலும் விரிவாக்கத்தில் கவனம் செலுத்தும் பின்தளத்தில் எவ்வாறு செயல்படுவது என்பதற்கான மறுசீரமைப்போடு மற்றும் நெகிழ்வுத்தன்மை (மாற்றுப்பெயர்கள் மற்றும் பின்தளத்தில் வழங்குநர்களைப் பயன்படுத்துதல்)

source: reorganization of the asynchronous features, providing a friendlier interface for running jobs asynchronously via :class:`Job` instances
ta_in: ஒத்திசைவற்ற அம்சங்களை மறுசீரமைத்தல், ஒத்திசைவற்ற முறையில் வேலைகளை இயக்குவதற்கு ஒரு நட்பு இடைமுகத்தை வழங்குதல்:class: `Job` நிகழ்வுகள்

source: numerous improvements and fixes throughout the Terra as a whole, both for convenience of the users (such as allowing anonymous registers) and for enhanced functionality (such as improved plotting of circuits)
ta_in: பயனர்களின் வசதிக்காகவும் (அநாமதேய பதிவேடுகளை அனுமதிப்பது போன்றவை) மற்றும் மேம்பட்ட செயல்பாட்டிற்காகவும் (சுற்றுகளின் மேம்பட்ட சதித்திட்டம் போன்றவை) டெர்ரா முழுவதும் ஏராளமான மேம்பாடுகள் மற்றும் திருத்தங்கள்

source: Please note that several backwards-incompatible changes have been introduced during this release as a result of the ongoing development. While some of these features will continue to be supported during a period of time before being fully deprecated, it is recommended to update your programs in order to prepare for the new versions and take advantage of the new functionality.
ta_in: தற்போதைய வெளியீட்டின் விளைவாக இந்த வெளியீட்டின் போது பல பின்னோக்கி-பொருந்தாத மாற்றங்கள் அறிமுகப்படுத்தப்பட்டுள்ளன என்பதை நினைவில் கொள்க. இந்த அம்சங்களில் சில முழுமையாக நீக்கப்படுவதற்கு முன்னர் ஒரு காலகட்டத்தில் தொடர்ந்து ஆதரிக்கப்படும் என்றாலும், புதிய பதிப்புகளைத் தயாரிப்பதற்கும் புதிய செயல்பாட்டைப் பயன்படுத்துவதற்கும் உங்கள் நிரல்களைப் புதுப்பிக்க பரிந்துரைக்கப்படுகிறது.

source: ``QuantumProgram`` changes
ta_in: ``QuantumProgram`` மாற்றம்

source: Several methods of the :class:`~qiskit.QuantumProgram` class are on their way to being deprecated:
ta_in: வகுப்பின் பல முறைகள்:class: `~ qiskit.QuantumProgram` வகுப்பில் இருந்து நீக்கப்படும் பாதையில் உள்ளன:

source: methods for interacting **with the backends and the API**:
ta_in: பின்தளத்தில் மற்றும் API உடன் ** தொடர்புகொள்வதற்கான முறைகள் **:

source: The recommended way for opening a connection to the IBM Q API and for using the backends is through the top-level functions directly instead of the ``QuantumProgram`` methods. In particular, the :func:`qiskit.register` method provides the equivalent of the previous :func:`qiskit.QuantumProgram.set_api` call. In a similar vein, there is a new :func:`qiskit.available_backends`, :func:`qiskit.get_backend` and related functions for querying the available backends directly. For example, the following snippet for version 0.4::
ta_in: ஐபிஎம் கியூ ஏபிஐக்கு இணைப்பைத் திறப்பதற்கும், பின்தளத்தில் பயன்படுத்துவதற்கும் பரிந்துரைக்கப்பட்ட வழி, ``QuantumProgram '` முறைகளுக்கு பதிலாக நேரடியாக உயர்மட்ட செயல்பாடுகளின் வழியாகும். குறிப்பாக,:func: `qiskit.register` முறை முந்தையவற்றுக்கு சமமானதை வழங்குகிறது:func:` qiskit.QuantumProgram.set_api` அழைப்பு. இதேபோன்ற ஒரு நரம்பில், ஒரு புதிய:func: `qiskit.available_backends` ,:func:` qiskit.get_backend` மற்றும் கிடைக்கக்கூடிய பின்தளத்தில் நேரடியாக வினவுவதற்கான தொடர்புடைய செயல்பாடுகள் உள்ளன. எடுத்துக்காட்டாக, பதிப்பு 0.4 க்கான பின்வரும் துணுக்கை ::

source: would be equivalent to the following snippet for version 0.5::
ta_in: பதிப்பு 0. 5 க்கு பின்வரும் குறும்படத்துக்கு சமமானது::

source: methods for **compiling and executing programs**:
ta_in: ** நிரல்களை தொகுத்தல் மற்றும் செயல்படுத்துவதற்கான ** முறைகள்:

source: The top-level functions now also provide equivalents for the :func:`qiskit.QuantumProgram.compile` and :func:`qiskit.QuantumProgram.execute` methods. For example, the following snippet from version 0.4::
ta_in: உயர்மட்ட செயல்பாடுகள் இப்போது:func: `qiskit.QuantumProgram.compile` மற்றும் :func:` qiskit.QuantumProgram.execute` முறைகளுக்கும் சமமானவற்றை வழங்குகின்றன. எடுத்துக்காட்டாக, பதிப்பு 0.4 :: இலிருந்து பின்வரும் துணுக்கை::

source: In general, from version 0.5 onwards we encourage to try to make use of the individual objects and classes directly instead of relying on ``QuantumProgram``. For example, a :class:`~qiskit.QuantumCircuit` can be instantiated and constructed by appending :class:`~qiskit.QuantumRegister`, :class:`~qiskit.ClassicalRegister`, and gates directly. Please check the update example in the Quickstart section, or the ``using_qiskit_core_level_0.py`` and ``using_qiskit_core_level_1.py`` examples on the main repository.
ta_in: பொதுவாக, பதிப்பு 0.5 முதல் ``QuantumProgram`` ஐ நம்புவதற்கு பதிலாக தனிப்பட்ட பொருள்கள் மற்றும் வகுப்புகளை நேரடியாகப் பயன்படுத்த முயற்சிக்க ஊக்குவிக்கிறோம். எடுத்துக்காட்டாக, ஒரு:class: `~ qiskit.QuantumCircuit` ஐ சேர்ப்பதன் மூலம் உடனடி மற்றும் கட்டமைக்க முடியும்:class:` ~ qiskit.QuantumRegister` ,:class: `~ qiskit.ClassicalRegister`, மற்றும் வாயில்கள் நேரடியாக. குயிக்ஸ்டார்ட் பிரிவில் புதுப்பிப்பு உதாரணத்தை சரிபார்க்கவும் அல்லது பிரதான களஞ்சியத்தில் `` using_qiskit_core_level_0.py`` மற்றும் `` using_qiskit_core_level_1.py`` எடுத்துக்காட்டுகளைப் பார்க்கவும்.

source: Backend name changes
ta_in: பின்னணி பெயர் மாற்றம்

source: In order to provide a more extensible framework for backends, there have been some design changes accordingly:
ta_in: பின்தளத்தில் இன்னும் விரிவாக்கக்கூடிய கட்டமைப்பை வழங்குவதற்காக, அதற்கேற்ப சில வடிவமைப்பு மாற்றங்கள் செய்யப்பட்டுள்ளன:

source: **local simulator names**
ta_in: ** உள்ளார்ந்த உரையாடல் பெயர்கள் * *

source: The names of the local simulators have been homogenized in order to follow the same pattern: ``PROVIDERNAME_TYPE_simulator_LANGUAGEORPROJECT`` - for example, the C++ simulator previously named ``local_qiskit_simulator`` is now ``local_qasm_simulator_cpp``. An overview of the current simulators:
ta_in: அதே மாதிரியைப் பின்பற்றுவதற்காக உள்ளூர் சிமுலேட்டர்களின் பெயர்கள் ஒரே மாதிரியாக மாற்றப்பட்டுள்ளன: ``PROVIDERNAME_TYPE_simulator_LANGUAGEORPROJECT`` - எடுத்துக்காட்டாக, முன்னர் ``local_qiskit_simulator`` என்று பெயரிடப்பட்ட சி ++ சிமுலேட்டர் இப்போது `` local_qasm_simulator_cpp``. தற்போதைய சிமுலேட்டர்களின் கண்ணோட்டம்:

source: ``QASM`` simulator is supposed to be like an experiment. You apply a circuit on some qubits, and observe measurement results - and you repeat for many shots to get a histogram of counts via ``result.get_counts()``.
ta_in: ``QASM`` சிமுலேட்டர் ஒரு சோதனை போல இருக்க வேண்டும். நீங்கள் சில வினாடிகளில் ஒரு சுற்று பயன்படுத்துகிறீர்கள், மற்றும் அளவீட்டு முடிவுகளைக் கவனிக்கவும் - மேலும் `` result.get_counts () `` வழியாக எண்ணிக்கையின் வரைபடத்தைப் பெற பல காட்சிகளுக்கு நீங்கள் மீண்டும் செய்கிறீர்கள்.

source: ``Statevector`` simulator is to get the full statevector (:math:`2^n` amplitudes) after evolving the zero state through the circuit, and can be obtained via ``result.get_statevector()``.
ta_in: ``Statevector`` சிமுலேட்டர் என்பது பூஜ்ஜிய நிலையை சுற்று வழியாக உருவாக்கிய பிறகு முழு ஸ்டேட்வெக்டரை (:math: `2 ^ n` பெருக்கங்கள்) பெறுவதோடு, ``result.get_statevector()``வழியாகவும் பெறலாம்.

source: ``Unitary`` simulator is to get the unitary matrix equivalent of the circuit, returned via ``result.get_unitary()``.
ta_in: ``Unitary`` சிமுலேட்டர் என்பது சுற்றுக்கு நிகரான யூனிட் மேட்ரிக்ஸைப் பெறுவது, `` result.get_unitary () `` வழியாக திரும்பியது.

source: In addition, you can get intermediate states from a simulator by applying a ``snapshot(slot)`` instruction at various spots in the circuit. This will save the current state of the simulator in a given slot, which can later be retrieved via ``result.get_snapshot(slot)``.
ta_in: கூடுதலாக, சுற்றுவட்டத்தின் பல்வேறு இடங்களில் ``snapshot(slot)`` அறிவுறுத்தலைப் பயன்படுத்துவதன் மூலம் ஒரு சிமுலேட்டரிடமிருந்து இடைநிலை நிலைகளைப் பெறலாம். இது கொடுக்கப்பட்ட ஸ்லாட்டில் சிமுலேட்டரின் தற்போதைய நிலையைச் சேமிக்கும், பின்னர் `` result.get_snapshot (slot) `` வழியாக மீட்டெடுக்கலாம்.

source: **backend aliases**:
ta_in: ** பின்தளத்தில் மாற்றுப்பெயர்கள் **:

source: The SDK now provides an "alias" system that allows for automatically using the most performant simulator of a specific type, if it is available in your system. For example, with the following snippet::
ta_in: SDK இப்போது ஒரு "alias" அமைப்பை வழங்குகிறது, இது உங்கள் கணினியில் கிடைத்தால், ஒரு குறிப்பிட்ட வகையின் மிகச் சிறந்த செயல்திறன் கொண்ட சிமுலேட்டரை தானாகவே பயன்படுத்த அனுமதிக்கிறது. எடுத்துக்காட்டாக, பின்வரும் துணுக்குடன்::

source: the backend will be the C++ statevector simulator if available, falling back to the Python statevector simulator if not present.
ta_in: பின்தளத்தில் சி ++ ஸ்டேட்வெக்டர் சிமுலேட்டராக இருந்தால், பைத்தான் ஸ்டேட்வெக்டர் சிமுலேட்டரில் இல்லாவிட்டால் மீண்டும் விழும்.

source: More flexible names and parameters
ta_in: கூடுதலான பெயர் மற்றும் அளபுருக்கள்

source: Several functions of the SDK have been made more flexible and user-friendly:
ta_in: SDK இன் பல செயல்பாடுகள் அதிக நேர்மையான மற்றும் பயனர் நம்பிக்கை செய்யப்பட்டுள்ளன:

source: **automatic circuit and register names**
ta_in: ** தானியங்கி சுற்றுச்சொல் மற்றும் பதிவு பெயர்கள் **

source: :class:`qiskit.ClassicalRegister`, :class:`qiskit.QuantumRegister` and :class:`qiskit.QuantumCircuit` can now be instantiated without explicitly giving them a name - a new autonaming feature will automatically assign them an identifier::
ta_in: :class: `qiskit.ClassicalRegister` ,:class:` qiskit.QuantumRegister` மற்றும்:class: `qiskit.QuantumCircuit` இப்போது அவர்களுக்கு வெளிப்படையாக ஒரு பெயரைக் கொடுக்காமல் உடனடிப்படுத்தலாம் - ஒரு புதிய தன்னியக்க அம்சம் அவர்களுக்கு ஒரு அடையாளங்காட்டியை தானாக ஒதுக்கும்::

source: Please note as well that the order of the parameters have been swapped ``QuantumRegister(size, name)``.
ta_in: அளவுருக்களின் வரிசை ``QuantumRegister(size, name)`` மாற்றப்பட்டுள்ளது என்பதையும் நினைவில் கொள்க.

source: **methods accepting names or instances**
ta_in: ** பெயர்கள் அல்லது நிகழ்வுகளை ஏற்றுக்கொள்ளும் முறைகள் **

source: In combination with the autonaming changes, several methods such as :func:`qiskit.Result.get_data` now accept both names and instances for convenience. For example, when retrieving the results for a job that has a single circuit such as::
ta_in: தன்னியக்க மாற்றங்களுடன் இணைந்து, பல முறைகள்:func: `qiskit.Result.get_data` இப்போது பெயர்கள் மற்றும் நிகழ்வுகளை வசதிக்காக ஏற்றுக்கொள்கின்றன. எடுத்துக்காட்டாக, ஒற்றை சுற்று கொண்ட ஒரு வேலைக்கான முடிவுகளை மீட்டெடுக்கும்போது::

source: The following calls are equivalent::
ta_in: பின்வரும் அழைப்புகள் சமமானவை::
