Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: An import path was deprecated in Terra 0.10.0 and has now been removed: for ``PulseChannel``, ``DriveChannel``, ``MeasureChannel``, and ``ControlChannel``, use ``from qiskit.pulse.channels import X`` in place of ``from qiskit.pulse.channels.pulse_channels import X``.
ta_in: ஒரு இறக்குமதி பாதை டெரா 0.10.0 இல் விரிவாக்கப்பட்டது மற்றும் இப்போது நீக்கப்பட்டுள்ளது: ` ` PulseChannel ` `, ` ` DriveChannel ` ` ` ` ` ControlChannel ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` `.

source: The pass :class:`qiskit.transpiler.passes.CSPLayout` (which was introduced in the 0.11.0 release) has been added to the preset pass manager for optimization levels 2 and 3. For level 2, there is a call limit of 1,000 and a timeout of 10 seconds. For level 3, the call limit is 10,000 and the timeout is 1 minute.
ta_in: பாஸ் :class:` qiskit.transpiler.passes.CSPL வெளியீடு ` (இது 0.11.0 வெளியீட்டில் அறிமுகப்படுத்தப்பட்டது) முன்னேற்றக் கடல் மேலாளர் 2 மற்றும் 3 க்கு சேர்க்கப்பட்டுள்ளது. அளவு 2, 1,000 மற்றும் ஒரு நேரம் 10 நொடிகளின் ஒரு கால வரம்பு உள்ளது. அளவு 3, அழைப்பு வரம்பு 10,000 மற்றும் நேரம் 1 நிமிடம் ஆகும்.

source: Now that the pass is included in the preset pass managers the `python-constraint <https://pypi.org/project/python-constraint/>`_ package is not longer an optional dependency and has been added to the requirements list.
ta_in: முன்னமைக்கப்பட்ட பாஸ் மேலாளர்களில் பாஸ் இப்போது சேர்க்கப்பட்டுள்ளது `பைதான்-கட்டுப்பாடு <https://pypi.org/project/python-constraint/>` _ தொகுப்பு இனி விருப்ப சார்பு அல்ல, மேலும் தேவைகள் பட்டியலில் சேர்க்கப்பட்டுள்ளது.

source: The ``TranspileConfig`` class which was previously used to set run time configuration for a :class:`qiskit.transpiler.PassManager` has been removed and replaced by a new class :class:`qiskit.transpile.PassManagerConfig`. This new class has been structured to include only the information needed to construct a :class:`~qiskit.transpiler.PassManager`. The attributes of this class are:
ta_in: ஒரு: வகுப்பு: `qiskit.transpiler.PassManager` க்கான ரன் நேர உள்ளமைவை அமைப்பதற்கு முன்னர் பயன்படுத்தப்பட்ட` `டிரான்ஸ்பைல் கான்ஃபிக்`` வகுப்பு நீக்கப்பட்டு அதற்கு பதிலாக ஒரு புதிய வகுப்பு: வகுப்பு:` qiskit.transpile.PassManagerConfig`. இந்த புதிய வகுப்பு ஒரு: வகுப்பை உருவாக்க தேவையான தகவல்களை மட்டுமே சேர்க்கும் வகையில் கட்டமைக்கப்பட்டுள்ளது: `~ qiskit.transpiler.PassManager`. இந்த வகுப்பின் பண்புக்கூறுகள்:

source: The function ``transpile_circuit`` in :mod:`qiskit.transpiler` has been removed. To transpile a circuit with a custom :class:`~qiskit.transpiler.PassManager` now you should use the :meth:`~qiskit.transpiler.PassManager.run` method of the :class:~qiskit.transpiler.PassManager` object.
ta_in: `` Transpile_circuit`` இல்:mod: `qiskit.transpiler` செயல்பாடு நீக்கப்பட்டது. தனிப்பயன்:class: `~ qiskit.transpiler.PassManager` உடன் ஒரு சுற்றுவட்டத்தை மாற்ற நீங்கள் இப்போது:meth:` qiskit.transpiler.PassManager.run` முறையைப் பயன்படுத்த வேண்டும்:class: ~qiskit.transpiler.PassManager` பொருள் .

source: The :class:`~qiskit.circuit.QuantumCircuit` method :meth:`~qiskit.circuit.QuantumCircuit.draw` and :func:`qiskit.visualization.circuit_drawer` function will no longer include the initial state included in visualizations by default. If you would like to retain the initial state in the output visualization you need to set the ``initial_state`` kwarg to ``True``. For example, running:
ta_in: வகுப்பு: `~ qiskit.circuit.QuantumCircuit` முறை: மெத்:` ~ qiskit.circuit.QuantumCircuit.draw` மற்றும்: func: `qiskit.visualization.circuit_drawer` செயல்பாடு இனி இயல்புநிலையாக காட்சிப்படுத்தல்களில் சேர்க்கப்பட்ட ஆரம்ப நிலையை சேர்க்காது . வெளியீட்டு காட்சிப்படுத்தலில் ஆரம்ப நிலையை நீங்கள் தக்க வைத்துக் கொள்ள விரும்பினால், `` ஆரம்ப_நிலையம்`` குவார்க்கை `` உண்மை`` என அமைக்க வேண்டும். எடுத்துக்காட்டாக, இயங்கும்:

source: This no longer includes the initial state. If you'd like to retain it you can run:
ta_in: இது இனி ஆரம்ப நிலையை உள்ளடக்காது. நீங்கள் அதைத் தக்க வைத்துக் கொள்ள விரும்பினால் இயக்கலாம்:

source: :func:`qiskit.compiler.transpile` (and :func:`qiskit.execute.execute`, which uses ``transpile`` internally) will now raise an error when the ``pass_manager`` kwarg is set and a value is set for other kwargs that are already set in an instantiated :class:`~qiskit.transpiler.PassManager` object. Previously, these conflicting kwargs would just be silently ignored and the values in the ``PassManager`` instance would be used. For example::
ta_in: func: `qiskit.compiler.transpile` (மற்றும்: func:` qiskit.execute.execute`, இது `` டிரான்ஸ்பைல்`` ஐ உள்நாட்டில் பயன்படுத்துகிறது) இப்போது `` பாஸ்_மேனேஜர்`` குவார்க் அமைக்கப்பட்டு ஒரு மதிப்பு ஏற்கனவே நிறுவப்பட்ட பிற குவார்க்குகளுக்கு அமைக்கப்பட்டுள்ளது: வகுப்பு: `~ qiskit.transpiler.PassManager` பொருள். முன்னதாக, இந்த முரண்பட்ட குவார்க்குகள் அமைதியாக புறக்கணிக்கப்படும், மேலும் `` பாஸ்மேனேஜர்`` நிகழ்வில் உள்ள மதிப்புகள் பயன்படுத்தப்படும். உதாரணத்திற்:::

source: will now raise an error while prior to this release the value in ``pm`` would just silently be used and the value for the ``optimization_level`` kwarg would be ignored. The ``transpile`` kwargs this applies to are:
ta_in: இந்த வெளியீட்டிற்கு முன்னர் `` pm`` இல் உள்ள மதிப்பு அமைதியாகப் பயன்படுத்தப்படும், மேலும் `` optimization_level`` குவார்க்கின் மதிப்பு புறக்கணிக்கப்படும். இது பொருந்தும் `` transpile`` குவார்க்ஸ்:

source: The :class:`~qiskit.quantum_info.Operator`, :class:`~qiskit.quantum_info.Clifford`, :class:`~qiskit.quantum_info.SparsePauliOp`, :class:`~qiskit.quantum_info.PauliTable`, :class:`~qiskit.quantum_info.StabilizerTable`, operator classes have an added ``call`` method that allows them to assign a `qargs` to the operator for use with the :meth:`~qiskit.quantum_info.Operator.compose`, :meth:`~qiskit.quantum_info.Operator.dot`, :meth:`~qiskit.quantum_info.Statevector.evolve`,``+``, and ``-`` operations.
ta_in: :class: `~ qiskit.quantum_info.Operator` ,:class:` ~ qiskit.quantum_info.Clifford` ,:class: `~ qiskit.quantum_info.SparsePauliOp` ,:class:` ~ qiskit.quantum_info.PauliTable` :class: `~ qiskit.quantum_info.StabilizerTable`, ஆபரேட்டர் வகுப்புகள் சேர்க்கப்பட்ட``call`` முறையைக் கொண்டுள்ளன, இது:meth:` with qiskit.quantum_info.Operator.compose உடன் பயன்படுத்த ஆபரேட்டருக்கு `கர்க்ஸ் 'ஒதுக்க அனுமதிக்கிறது. `,:meth:` ~ qiskit.quantum_info.Operator.dot` ,:meth: `~ qiskit.quantum_info.Statevector.evolve`,` `+`, மற்றும் `` -`` செயல்பாடுகள்.

source: The addition method of the :class:`qiskit.quantum_info.Operator`, class now accepts a ``qarg`` kwarg to allow adding a smaller operator to a larger one assuming identities on the other subsystems (same as for ``qargs`` on :meth:`~qiskit.quantum_info.Operator.compose` and :meth:`~qiskit.quantum_info.Operator.dot` methods). This allows subsystem addition using the call method as with composition. This support is added to all BaseOperator subclasses (:class:`~qiskit.quantum_info.ScalarOp`, :class:`~qiskit.quantum_info.Operator`, :class:`~qiskit.quantum_info.QuantumChannel`).
ta_in: வகுப்பின் கூட்டல் முறை:class: `qiskit.quantum_info.Operator`, வகுப்பு இப்போது ஒரு ``qarg`` குவார்க்கை ஏற்றுக்கொள்கிறது, மற்றொன்று துணை அமைப்புகளில் அடையாளங்களைக் கருதி ஒரு பெரிய ஆபரேட்டரை ஒரு பெரிய நிறுவனத்தில் சேர்க்க அனுமதிக்கிறது (``qargs``on :meth:` ~ qiskit.quantum_info.Operator.compose` மற்றும்:meth: `~ qiskit.quantum_info.Operator.dot` முறைகள்). இது கலவை போலவே அழைப்பு முறையைப் பயன்படுத்தி துணை அமைப்பு சேர்த்தலை அனுமதிக்கிறது. இந்த ஆதரவு அனைத்து BaseOperator துணைப்பிரிவுகளுக்கும் சேர்க்கப்பட்டுள்ளது (:class: `~ qiskit.quantum_info.ScalarOp` ,:class:` ~ qiskit.quantum_info.Operator` ,:class: `~ qiskit.quantum_info.QuantumChannel`).

source: The ``BaseOperator`` class has been updated so that addition, subtraction and scalar multiplication are no longer abstract methods. This means that they are no longer required to be implemented in subclasses if they are not supported. The base class will raise a ``NotImplementedError`` when the methods are not defined.
ta_in: ``BaseOperator`` வகுப்பு புதுப்பிக்கப்பட்டுள்ளது, இதனால் கூட்டல், கழித்தல் மற்றும் அளவிடுதல் பெருக்கல் ஆகியவை இனி சுருக்க முறைகள் அல்ல. இதன் பொருள் அவை ஆதரிக்கப்படாவிட்டால் அவை இனி துணைப்பிரிவுகளில் செயல்படுத்தப்பட வேண்டியதில்லை. முறைகள் வரையறுக்கப்படாதபோது அடிப்படை வகுப்பு `` NotImplementedError`` ஐ உயர்த்தும்.

source: The :func:`qiskit.quantum_info.random_density_matrix` function will now return a random :class:`~qiskit.quantum_info.DensityMatrix` object. In previous releases it returned a numpy array.
ta_in: :func: `qiskit.quantum_info.random_decity_matrix` செயல்பாடு இப்போது ஒரு சீரற்ற:class:` ~ qiskit.quantum_info.DensityMatrix` பொருள். முந்தைய வெளியீடுகளில் இது ஒரு எண்ணற்ற வரிசையை அளித்தது.

source: The :class:`qiskit.quantum_info.Statevector` and :class:`qiskit.quantum_info.DensityMatrix` classes no longer copy the input array if it is already the correct dtype.
ta_in: :class: `qiskit.quantum_info.Statevector` மற்றும்:class:` qiskit.quantum_info.DensityMatrix` வகுப்புகள் உள்ளீட்டு வரிசையை ஏற்கனவே சரியான dtype ஆக இருந்தால் நகலெடுக்காது.

source: `fastjsonschema <https://pypi.org/project/fastjsonschema/>`_ is added as a dependency. This is used for much faster validation of qobj dictionaries against the JSON schema when the ``to_dict()`` method is called on qobj objects with the ``validate`` keyword argument set to ``True``.
ta_in: `fastjsonschema <https://pypi.org/project/fastjsonschema/>` _ ஒரு சார்புநிலையாக சேர்க்கப்பட்டுள்ளது. JSON திட்டத்திற்கு எதிராக qobj அகராதிகளின் மிக விரைவான சரிபார்ப்புக்கு இது பயன்படுத்தப்படுகிறது, `` to_dict () `` முறை qobj பொருள்களில் ``validate`` முக்கிய வாதத்துடன் ``True`` என அமைக்கப்பட்டிருக்கும்.

source: The qobj construction classes in :mod:`qiskit.qobj` will no longer validate against the qobj jsonschema by default. These include the following classes:
ta_in: Qodj கட்டுமான வகுப்புகள்:mod: `qiskit.qobj` இனி இயல்பாக qobj jsonschema க்கு எதிராக சரிபார்க்கப்படாது. இவை பின்வரும் வகுப்புகளை உள்ளடக்குகின்றன:

source: If you were relying on this validation or would like to validate them against the qobj schema this can be done by setting the ``validate`` kwarg to ``True`` on :meth:`~qiskit.qobj.QasmQobj.to_dict` method from either of the top level Qobj classes :class:`~qiskit.qobj.QasmQobj` or :class:`~qiskit.qobj.PulseQobj`. For example:
ta_in: நீங்கள் இந்த சரிபார்ப்பை நம்பியிருந்தால் அல்லது qobj schema க்கு எதிராக அவற்றை சரிபார்க்க விரும்பினால், இதை "validate" க்வார்க் ஐ "உண்மை" என அமைக்குவதன் மூலம் இதை செய்யலாம் :meth:'~qiskit.qobj.QasmQobj.to_dict' முறை உயர் நிலை Qobj வகுப்புகள் ஒன்று இருந்து :class:'~qiskit.qobj.QasmQobj' அல்லது :class:'~qiskit.qobj.PulseQobj'. உதாரணமாக:

source: which will validate the output dictionary against the Qobj jsonschema.
ta_in: இது கியூஒபிஜே jsonschema எதிராக வெளியீட்டு அகராதி செல்லுபடியாக்க.

source: The output dictionary from :meth:`qiskit.qobj.QasmQobj.to_dict` and :meth:`qiskit.qobj.PulseQobj.to_dict` is no longer in a format for direct json serialization as expected by IBMQ's API. These Qobj objects are the current format we use for passing experiments to providers/backends and while having a dictionary format that could just be passed to the IBMQ API directly was moderately useful for ``qiskit-ibmq-provider``, it made things more difficult for other providers. Especially for providers that wrap local simulators. Moving forward the definitions of what is passed between providers and the IBMQ API request format will be further decoupled (in a backwards compatible manner) which should ease the burden of writing providers and backends.
ta_in: ":meth:'qiskit.qobj.QasmQobj.to_dict' மற்றும் ":meth:'qiskit.qobj.PulseQobj.to_dict' இலிருந்து வெளியீடு அகராதி யானது IBMQ இன் API எதிர்பார்த்தபடி நேரடி json தொடர்வரிசைக்கான வடிவமைப்பில் இல்லை. இந்த Qobj பொருட்கள் நாம் வழங்குநர்கள் / பின்முனைகளுக்கு சோதனைகளை கடந்து செல்லும் தற்போதைய வடிவமைப்பாகும் மற்றும் நேரடியாக IBMQ API க்கு அனுப்பக்கூடிய ஒரு அகராதி வடிவமைப்பைக் கொண்டபோது , "qiskit-ibmq-provider" க்கு மிதமான பயனுள்ளதாக இருந்தது, இது மற்ற வழங்குநர்களுக்கு மிகவும் கடினமாக இருந்தது. குறிப்பாக உள்ளூர் போலி மடக்கு என்று வழங்குநர்கள். வழங்குநர்கள் மற்றும் IBMQ API கோரிக்கை வடிவமைப்புக்கு இடையே கடந்து செல்லும் வரையறைகளை முன்னோக்கி நகர்த்துவது மேலும் (பின்னோக்கி இணக்கமான முறையில்) எழுதுநர்கள் மற்றும் பின்முனைகளின் சுமையை க்குறைக்க வேண்டும்.

source: In practice, the only functional difference between the output of these methods now and previous releases is that complex numbers are represented with the ``complex`` type and numpy arrays are not silently converted to list anymore. If you were previously calling ``json.dumps()`` directly on the output of ``to_dict()`` after this release a custom json encoder will be needed to handle these cases. For example::
ta_in: நடைமுறையில், இந்த முறைகளின் வெளியீடு மற்றும் முந்தைய வெளியீடுகளுக்கு இடையே உள்ள ஒரே செயல்பாட்டு வேறுபாடு சிக்கலான எண்கள் "complex" வகையுடன் குறிக்கப்படுகின்றன மற்றும் numபி வரிசைகள் இனி பட்டியலாக மாற்றப்படவில்லை. நீங்கள் முன்பு "json.dumps()" என்று நேரடியாக இந்த வெளியீட்டிற்குப் பிறகு "to_dict()" இன் வெளியீட்டில் அழைக்கப்பட்டிருந்தால், இந்த வழக்குகளைகையாள ஒரு தனிப்பயன் json குறியாக்கி தேவைப்படுகிறது. உதாரணமாக::

source: will generate a json string in the same exact manner that ``json.dumps(my_qasm.to_dict())`` did in previous releases.
ta_in: "json.dumps(my_qasm.to_dicd())" முந்தைய வெளியீடுகளில் செய்த அதே முறையில் json சரம் உருவாக்க வேண்டும்.

source: ``CmdDef`` has been deprecated since Terra 0.11.0 and has been removed. Please continue to use :py:class:`~qiskit.pulse.InstructionScheduleMap` instead.
ta_in: 'CmdDef' டெர்ரா 0.11.0 இலிருந்து நீக்கப்பட்டது மற்றும் நீக்கப்பட்டது. அதற்கு பதிலாக :py:class:'~qiskit.pulse.InstructionScheduleMap' ஐ தொடர்ந்து பயன்படுத்தவும்.

source: The methods ``cmds`` and ``cmd_qubits`` in :py:class:`~qiskit.pulse.InstructionScheduleMap` have been deprecated since Terra 0.11.0 and have been removed. Please use ``instructions`` and ``qubits_with_instruction`` instead.
ta_in: :py:class:'~qiskit.pulse.InstructionScheduleMap' இல் உள்ள "cmds" மற்றும் "cmd_qubits" முறைகள் Terra 0.11.0 இலிருந்து நீக்கப்பட்டுவிட்டன. அதற்கு பதிலாக "வழிமுறைகளை" மற்றும் "qubits_with_instruction" பயன்படுத்தவும்.

source: PulseDefaults have reported ``qubit_freq_est`` and ``meas_freq_est`` in Hz rather than GHz since Terra release 0.11.0. A warning which notified of this change has been removed.
ta_in: டெரா வெளியீடு 0.11.0 இலிருந்து GHz ஐ விட ஹெர்ட்ஸ் இல் "qubit_freq_est" மற்றும் "meas_freq_est" என்று பல்ஸ்இயல்புநிலை அறிக்கை யிடப்பட்டுள்ளது. இந்த மாற்றம் குறித்து அறிவிக்கப்பட்ட ஒரு எச்சரிக்கை நீக்கப்பட்டது.

source: The previously deprecated (in the 0.11.0 release) support for passsing in :class:`qiskit.circuit.Instruction` parameters of types ``sympy.Basic``, ``sympy.Expr``, ``qiskit.qasm.node.node.Node`` (QASM AST node) and ``sympy.Matrix`` has been removed. The supported types for instruction parameters are:
ta_in: முன்னர் deprecated (0.11.0 வெளியீட்டில்) வகைகளின் அளவுருக்கள் :class:'qiskit.circuit.Instruction' இல் கடந்து செல்ல ஆதரவு. "sympy.Basic", "sympy.Expr", "qiskit.qasm.node.node.Node" (QASM ASM node) மற்றும் "sympy.Matrix' நீக்கப்பட்டது. அறிவுறுத்தல் அளவுருக்கள் ஆதரிக்கப்படும் வகைகள்:

source: The following properties of :py:class:`~qiskit.providers.models.BackendConfiguration`:
ta_in: பின்வரும் பண்புகள்: py: class: `~ qiskit.providers.models.BackendConfiguration`:

source: all have units of seconds. Prior to release 0.11.0, ``dt`` and ``dtm`` had units of nanoseconds. Prior to release 0.12.0, ``rep_time`` had units of microseconds. The warnings alerting users of these changes have now been removed from ``BackendConfiguration``.
ta_in: இவை அனைத்தும் விநாடிகள் அலகுகள். 0.11.0 வெளியீட்டிற்கு முன், "dt" மற்றும் "dtm" ஆகியவை நானோ விநாடிகளின் அலகுகளைக் கொண்டிருந்தது. 0.12.0 வெளியீட்டிற்கு முன், "rep_time" மைக்ரோ விநாடிகள் அலகுகள் இருந்தன. இந்த மாற்றங்களை ப்பயனீட்டாளர்களுக்கு எச்சரிக்கை செய்யும் எச்சரிக்கைகள் இப்போது "பின்முனைஉள்ளமைவு" -இலிருந்து நீக்கப்பட்டுள்ளன.

source: A new requirement has been added to the requirements list, `retworkx <https://pypi.org/project/retworkx/>`_. It is an Apache 2.0 licensed graph library that has a similar API to networkx and is being used to significantly speed up the :class:`qiskit.dagcircuit.DAGCircuit` operations as part of the transpiler. There are binaries published on PyPI for all the platforms supported by Qiskit Terra but if you're using a platform where there aren't precompiled binaries published refer to the `retworkx documentation <https://retworkx.readthedocs.io/en/stable/README.html#installing-retworkx>`_ for instructions on pip installing from sdist.
ta_in: ஒரு புதிய தேவை தேவைகள் பட்டியலில் சேர்க்கப்பட்டுள்ளது, 'retworkx <https://pypi.org/project/retworkx/>'_. இது Apache 2.0 உரிமம் பெற்ற வரைபட நூலகம், இது நெட்வொர்க்க்ஸிற்கு ஒத்த API ஐக் கொண்டுள்ளது, மேலும் டிரான்ஸ்பைலரின் ஒரு பகுதியாக :class:'qiskit.dagcircuit.DAGCircuit' நடவடிக்கைகளை கணிசமாக வேகப்படுத்த பயன்படுத்தப்படுகிறது. Qiskit Terra ஆல் ஆதரிக்கப்படும் அனைத்து தளங்களுக்குPyPI இல் பைனரிகள் வெளியிடப்படுகின்றன, ஆனால் நீங்கள் முன்தொகுக்கப்பட்ட பைனரிகள் இல்லாத ஒரு தளத்தைப் பயன்படுத்தினால், sdist இலிருந்து PIP நிறுவல் பற்றிய அறிவுறுத்தல்களுக்கு 'retworkx documentation <https://retworkx.readthedocs.io/en/stable/README.html#installing-retworkx>'_ ஐ பார்க்கவும்.

source: If you encounter any issues with the transpiler or DAGCircuit class as part of the transition you can switch back to the previous networkx implementation by setting the environment variable ``USE_RETWORKX`` to ``N``. This option will be removed in the 0.14.0 release.
ta_in: மாற்றத்தின் ஒரு பகுதியாக, டிரான்ஸ்பைலர் அல்லது DAGசர்க்கியூட் வகுப்பில் ஏதேனும் சிக்கல்களை நீங்கள் சந்தித்தால், முந்தைய நெட்வொர்க்எக்ஸ் செயல்படுத்தல் "USE_RETWORKX" ஐ "N" க்கு அமைப்பதன் மூலம் நீங்கள் மீண்டும் மாறலாம். இந்த விருப்பம் 0.14.0 வெளியீட்டில் நீக்கப்படும்.

source: Passing in the data to the constructor for :class:`qiskit.dagcircuit.DAGNode` as a dictionary arg ``data_dict`` is deprecated and will be removed in a future release. Instead you should now pass the fields in as kwargs to the constructor. For example the previous behavior of::
ta_in: ஒரு அகராதிarg 'data_dict' என :class:'qiskit.dagcircuit.DAGNode' க்கான கன்ஸ்ட்ரக்டர் க்கு தரவு அனுப்புகிறது மற்றும் ஒரு எதிர்கால வெளியீட்டில் நீக்கப்படும். அதற்கு பதிலாக நீங்கள் இப்போது கட்டுநர் kwargs போன்ற துறைகளில் கடந்து வேண்டும். உதாரணமாக::

source: should now be::
ta_in: இப்போது இருக்க வேண்டும்::

source: The naming of gate objects and methods have been updated to be more consistent. The following changes have been made:
ta_in: கேட் பொருள்கள் மற்றும் முறைகளின் பெயரிடுதல் மிகவும் சீரானதாக புதுப்பிக்கப்பட்டுள்ளது. பின்வரும் மாற்றங்கள் செய்யப்பட்டுள்ளன:

source: The Pauli gates all have one uppercase letter only (``I``, ``X``, ``Y``, ``Z``)
ta_in: பாலி கேட்கள் அனைத்தும் ஒரே ஒரு பெரிய எழுத்து ("I", "X", "Y", "Z") மட்டுமே உள்ளன

source: The parameterized Pauli gates (i.e. rotations) prepend the uppercase letter ``R`` (``RX``, ``RY``, ``RZ``)
ta_in: அளவீட்டு பாலி கேட்கள் (அதாவது சுழற்சிகள்) "R" ("RX", "RY", "RZ") என்ற எழுத்துக்கு முன்வரும்

source: A controlled version prepends the uppercase letter ``C`` (``CX``, ``CRX``, ``CCX``)
ta_in: கட்டுப்படுத்தப்பட்ட பதிப்பு,"C" ("CX", "CRX", "CCX") என்ற பேரெழுத்துக்கு முன்உள்ளது

source: Gates are named according to their action, not their alternative names (``CCX``, not ``Toffoli``)
ta_in: கேட்ஸ் அவர்களின் செயலுக்கு ஏற்ப பெயரிடப்பட்டுள்ளன, அவற்றின் மாற்று பெயர்கள் அல்ல (```CCX``, not ``Toffoli``)

source: The old names have been deprecated and will be removed in a future release. This is a list of the changes showing the old and new class, name attribute, and methods. If a new column is blank then there is no change for that.
ta_in: பழைய பெயர்கள் நீக்கப்பட்டன, எதிர்கால வெளியீட்டில் அவை அகற்றப்படும். இது பழைய மற்றும் புதிய வகுப்பு, பெயர் பண்புக்கூறு மற்றும் முறைகளைக் காட்டும் மாற்றங்களின் பட்டியல். ஒரு புதிய நெடுவரிசை காலியாக இருந்தால், அதற்கு எந்த மாற்றமும் இல்லை.

source: Gate Name Changes
ta_in: கேட் பெயர் மாற்றங்கள்

source: Old Class
ta_in: பழைய வகுப்பு

source: New Class
ta_in: புதிய வகுப்பு

source: Old Name Attribute
ta_in: பழைய பெயர் பண்பு

source: New Name Attribute
ta_in: புதிய பெயர் பண்பு

source: Old :class:`qiskit.circuit.QuantumCircuit` method
ta_in: பழையது:class: `qiskit.circuit.QuantumCircuit` முறை

source: New :class:`qiskit.circuit.QuantumCircuit` method
ta_in: புதியது:class: `qiskit.circuit.QuantumCircuit` முறை

source: :meth:`~qiskit.circuit.QuantumCircuit.i` and :meth:`~qiskit.circuit.QuantumCircuit.id`
ta_in: :meth: `~ qiskit.circuit.QuantumCircuit.i` மற்றும்:meth:` ~ qiskit.circuit.QuantumCircuit.id`

source: :meth:`~qiskit.circuit.QuantumCircuit.isometry` and :meth:`~qiskit.circuit.QuantumCircuit.iso`
ta_in: :meth: `~ qiskit.circuit.QuantumCircuit.isometry` மற்றும்:meth:` ~ qiskit.circuit.QuantumCircuit.iso`

source: The kwarg ``period`` for the function :func:`~qiskit.pulse.pulse_lib.square`, :func:`~qiskit.pulse.pulse_lib.sawtooth`, and :func:`~qiskit.pulse.pulse_lib.triangle` in :mod:`qiskit.pulse.pulse_lib` is now deprecated and will be removed in a future release. Instead you should now use the ``freq`` kwarg to set the frequency.
ta_in: செயல்பாட்டிற்கான குவார்க் ``period``:func: `~ qiskit.pulse.pulse_lib.square` ,:func:` ~ qiskit.pulse.pulse_lib.sawtooth`, மற்றும்:func: `~ qiskit.pulse.pulse_lib. முக்கோணம்` in :mod: `qiskit.pulse.pulse_lib` இப்போது நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக நீங்கள் இப்போது அதிர்வெண்ணை அமைக்க ``freq`` குவார்க்கைப் பயன்படுத்த வேண்டும்.

source: The ``DAGCircuit.compose_back()`` and ``DAGCircuit.extend_back()`` methods are deprecated and will be removed in a future release. Instead you should use the :meth:`qiskit.dagcircuit.DAGCircuit.compose` method, which is a more general and more flexible method that provides the same functionality.
ta_in: `` DAGCircuit.compose_back () `` மற்றும் `` DAGCircuit.extend_back () `` முறைகள் நீக்கப்பட்டன, அவை எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக நீங்கள்:meth: `qiskit.dagcircuit.DAGCircuit.compose` முறையைப் பயன்படுத்த வேண்டும், இது அதே செயல்பாட்டை வழங்கும் மிகவும் பொதுவான மற்றும் நெகிழ்வான முறையாகும்.

source: The ``callback`` kwarg of the :class:`qiskit.transpiler.PassManager` class's constructor has been deprecated and will be removed in a future release. Instead of setting it at the object level during creation it should now be set as a kwarg parameter on the :meth:`qiskit.transpiler.PassManager.run` method.
ta_in: வகுப்பின் ``callback`` குவார்க் :class: `qiskit.transpiler.PassManager` வகுப்பின் கட்டமைப்பாளர் நீக்கப்பட்டார், மேலும் இது எதிர்கால வெளியீட்டில் அகற்றப்படும். உருவாக்கத்தின் போது அதை பொருள் மட்டத்தில் அமைப்பதற்கு பதிலாக, இப்போது :meth: `qiskit.transpiler.PassManager.run` முறையில் ஒரு குவார்க் அளவுருவாக அமைக்க வேண்டும்.

source: The ``n_qubits`` and ``numberofqubits`` keywords are deprecated throughout Terra and replaced by ``num_qubits``. The old names will be removed in a future release. The objects affected by this change are listed below:
ta_in: `` N_qubits`` மற்றும் `` numberofqubits`` சொற்கள் டெர்ரா முழுவதும் நீக்கப்பட்டன, அதற்கு பதிலாக `` num_qubits`` மாற்றப்படுகின்றன. எதிர்கால வெளியீட்டில் பழைய பெயர்கள் அகற்றப்படும். இந்த மாற்றத்தால் பாதிக்கப்பட்ட பொருள்கள் கீழே பட்டியலிடப்பட்டுள்ளன:

source: New Methods
ta_in: புதிய முறைகள்

source: Old Method
ta_in: பழைய முறை

source: New Method
ta_in: புதிய முறைகள்

source: New arguments
ta_in: புதிய வாதங்கள்

source: The function ``qiskit.quantum_info.synthesis.euler_angles_1q`` is now deprecated. It has been superseded by the :class:`qiskit.quantum_info.OneQubitEulerDecomposer` class which provides the same functionality through::
ta_in: `` Qiskit.quantum_info.synthesis.euler_angles_1q`` செயல்பாடு இப்போது நீக்கப்பட்டது. இது:class: `qiskit.quantum_info.OneQubitEulerDecomposer` வகுப்பால் முறியடிக்கப்பட்டுள்ளது, இது ::
