Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: To this end, one might consider using the best observed sample as a cost function during variational optimization. The issue here, is that this can result in a non-smooth optimization surface. To resolve this issue, we can smooth the optimization surface by using not just the best observed sample, but instead average over some fraction of best observed samples. This is exactly what the CVaR estimator accomplishes [1].
ta_in: இந்த நோக்கத்திற்காக, மாறுபட்ட உகப்பாக்கத்தின் போது சிறந்த கவனிக்கப்பட்ட மாதிரியை செலவுச் செயல்பாடாகப் பயன்படுத்தலாம். இங்கே சிக்கல் என்னவென்றால், இது மென்மையான அல்லாத தேர்வுமுறை மேற்பரப்பில் ஏற்படக்கூடும். இந்த சிக்கலைத் தீர்க்க, சிறந்த கவனிக்கப்பட்ட மாதிரியை மட்டும் பயன்படுத்துவதன் மூலம் தேர்வுமுறை மேற்பரப்பை மென்மையாக்க முடியும், மாறாக சிறந்த கவனிக்கப்பட்ட மாதிரிகளில் சில பகுதிகளுக்கு மேல் சராசரியாக இருக்க முடியும். சி. வி. ஏ. ஆர் மதிப்பீட்டாளர் இதைச் சரியாகச் செய்கிறார் [1].

source: Let :math:`\alpha` be a real number in :math:`[0,1]` which specifies the fraction of best observed samples which are used to compute the objective function. Observe that if :math:`\alpha = 1`, CVaR is equivalent to a standard expectation value. Similarly, if :math:`\alpha = 0`, then CVaR corresponds to using the best observed sample. Intermediate values of :math:`\alpha` interpolate between these two objective functions.
ta_in: விடுங்கள்: கணிதம்: `\ ஆல்பா` இதில் ஒரு உண்மையான எண்ணாக இருக்க வேண்டும்: கணிதம்:` [0,1] `இது புறநிலை செயல்பாட்டைக் கணக்கிடப் பயன்படும் சிறந்த கவனிக்கப்பட்ட மாதிரிகளின் பகுதியைக் குறிக்கிறது. கணிதம்: `\ ஆல்பா = 1`, சி.வி.ஆர் ஒரு நிலையான எதிர்பார்ப்பு மதிப்புக்கு சமம் என்பதைக் கவனியுங்கள். இதேபோல், கணிதம்: `\ ஆல்பா = 0` என்றால், சி.வி.ஆர் சிறந்த கவனிக்கப்பட்ட மாதிரியைப் பயன்படுத்துவதற்கு ஒத்திருக்கிறது. இதன் இடைநிலை மதிப்புகள்: கணிதம்: `\ ஆல்பா` இந்த இரண்டு புறநிலை செயல்பாடுகளுக்கு இடையில் ஒன்றிணைகிறது.

source: Examples::
ta_in: எடுத்துக்காட்டுகள்::

source: Similarly, an operator corresponding to a standard expectation value can be converted into a CVaR expectation using the CVaRExpectation converter.
ta_in: அதே போல, ஒரு இயல்பான எதிர்பார்ப்பு மதிப்புக்கு ஒத்திருக்கும் ஒரு இயக்குநர் CVaRExpectation மாற்றத்தை பயன்படுத்தி ஒரு CVR எதிர்பார்ப்பை மாற்றலாம்.

source: See [1] for additional details regarding this technique and it's empircal performance.
ta_in: இந்த நுட்பத்தைப் பற்றிய கூடுதல் விவரங்களுக்காக [1] பார்க்கவும்.

source: References:
ta_in: குறிப்பு:

source: "Improving Variational Quantum Optimization using CVaR" `arXiv:1907.04769 <https://arxiv.org/abs/1907.04769>`_
ta_in: "CVaR ஐப் பயன்படுத்தி மாறுபட்ட குவாண்டம் உகப்பாக்கலை மேம்படுத்துதல்" `arXiv: 1907.04769

source: New interface ``Eigensolver`` for Eigensolver algorithms.
ta_in: புதிய இடைமுகம் ` ` Eigensolver ` ` for Eigensolver algorithms.

source: An interface for excited states calculation has been added to the chemistry module. It is now easier for the user to create a general excited states calculation. This calculation is based on a ``Driver`` which provides the relevant information about the molecule, a ``Transformation`` which provides the information about the mapping of the problem into a qubit Hamiltonian, and finally a Solver. The Solver is the specific way which the excited states calculation is done (the algorithm). This structure follows the one of the ground state calculations. The results are modified to take lists of expectation values instead of a single one. The ``QEOM`` and ``NumpyEigensolver`` are adapted to the new structure. A factory is introduced to run a numpy eigensolver with a specific filter (to target states of specific symmetries).
ta_in: ஆரம்பிக்கப்பட்ட மாநிலங்களுக்கான ஒரு இடைமுகம் வேதியியல் கூறுகளுக்கு சேர்க்கப்பட்டுள்ளது. பொதுவான ஆயுதமான மாநிலங்களின் கணிப்பை உருவாக்குவதற்கு பயனருக்கு இப்போது எளிமையானதாகும். இந்த கணக்கெடுப்பு ` ` Driver ` ` இது மூலக்கூறுகளைப் பற்றிய ஒத்திசைவு தகவல்களை வழங்குகிறது, ` ` மாற்றம் ` ` பிரச்சினை பற்றிய தகவல்களை ஒரு விரைவான ஹாமிலோனியன் மற்றும் இறுதியாக ஒரு சோழர் பற்றிய தகவல்களை வழங்குகிறது. The Solver is the specific way which the उत्साहित states ගණනය is done (the algorithm). இந்த அமைப்பு தரமான மாநில கணக்கெடுப்பின் ஒன்றை பின்பற்றுகிறது. ஒரு ஒற்றை பதிலாக எதிர்பார்ப்பு மதிப்புகளின் பட்டியல்களை எடுப்பதற்கு முடிவுகள் மாற்றப்படுகின்றன. ` ` QEOM ` ` மற்றும் ` NumpyEigensolver ` ` புதிய கட்டமைப்புக்கு ஏற்றுக்கொள்ளப்படுகின்றன. ஒரு தொழிற்சாலையை ஒரு குறிப்பிட்ட வடிகட்டி (குறிப்பிட்ட சிம்மடிகளின் இலக்கு மாநிலங்கள்) கொண்டு ஒரு விண்மையான eigensolver இயக்குவதற்கு அறிமுகப்படுத்தப்படுகிறது.

source: In addition to the workflows for solving Fermionic problems, interfaces for calculating Bosonic ground and excited states have been added. In particular we introduced a full interface for running vibronic structure calculations.
ta_in: ஃபெர்மோனிக் பிரச்சினைகளைத் தீர்மானிக்கும் பணிபுரிவதற்கு கூடுதலாக, போஸோனிக் கோட்பாடு மற்றும் ஆரம்பிக்கும் மாநிலங்கள் கணக்கிடுவதற்கு இடைமுகங்கள் சேர்க்கப்பட்டுள்ளன. குறிப்பாக நாம் ஒரு முழு இடைமுகத்தை இயங்குவதற்கு ஒரு முழு இடைமுகத்தை அறிமுகப்படுத்தினோம்.

source: The ``OrbitalOptimizationVQE`` has been added as new ground state solver in the chemistry module. This solver allows for the simulatneous optimization of the variational parameters and the orbitals of the molecule. The algorithm is introduced in Sokolov et al., The Journal of Chemical Physics 152 (12).
ta_in: The ` ` OrbitalOptimizationVQE ` ` has been added as new ground state solver in the chemistry module. This solver அனுமதிக்கிறது மாற்று அளபுருக்கள் மற்றும் மூலக்கூறுகளின் ஒழுங்குபடுத்தல். The algorithm is හඳුන්වා in Sokolov et al., The Journal of Chemical Physics 152 (12).

source: A new algorithm has been added: the Born Openheimer Potential Energy surface for the calculation of potential energy surface along different degrees of freedom of the molecule. The algorithm is called ``BOPESSampler``. It further provides functionalities of fitting the potential energy surface to an analytic function of predefined potentials.
ta_in: ஒரு புதிய வழிமுறை சேர்க்கப்பட்டுள்ளது: மூலக்கூறின் சுதந்திரத்தின் வெவ்வேறு அளவுகளில் சாத்தியமான ஆற்றல் மேற்பரப்பைக் கணக்கிடுவதற்கான பிறப்பு ஓப்பன்ஹைமர் ஆற்றல் ஆற்றல் மேற்பரப்பு. வழிமுறை `` BOPESSampler`` என அழைக்கப்படுகிறது. இது முன் வரையறுக்கப்பட்ட ஆற்றல்களின் பகுப்பாய்வு செயல்பாட்டிற்கு சாத்தியமான ஆற்றல் மேற்பரப்பை பொருத்துவதற்கான செயல்பாடுகளை மேலும் வழங்குகிறது. சில விவரங்கள்.

source: A feasibility check of the obtained solution has been added to all optimizers in the optimization stack. This has been implemented by adding two new methods to ``QuadraticProgram``: * ``get_feasibility_info(self, x: Union[List[float], np.ndarray])`` accepts an array and returns whether this solution is feasible and a list of violated variables(violated bounds) and a list of violated constraints. * ``is_feasible(self, x: Union[List[float], np.ndarray])`` accepts an array and returns whether this solution is feasible or not.
ta_in: The ``OrbitalOptimizationVQE`` has been added as new ground state solver in the chemistry module. This solver allows for the simulatneous optimization of the variational parameters and the orbitals of the molecule. The algorithm is introduced in Sokolov et al., The Journal of Chemical Physics 152 (12).

source: Add circuit-based versions of ``FixedIncomeExpectedValue``, ``EuropeanCallDelta``, ``GaussianConditionalIndependenceModel`` and ``EuropeanCallExpectedValue`` to ``qiskit.finance.applications``.
ta_in: OrbitalOptimizationVQE`` வேதியியல் தொகுதியில் புதிய தரை நிலை தீர்வாக சேர்க்கப்பட்டுள்ளது. இந்த தீர்வி மாறுபட்ட அளவுருக்கள் மற்றும் மூலக்கூறின் சுற்றுப்பாதைகளின் உருவகப்படுத்துதலை மேம்படுத்த அனுமதிக்கிறது. இந்த வழிமுறை சோகோலோவ் மற்றும் பலர், வேதியியல் இயற்பியல் இதழ் 152 (12) இல் அறிமுகப்படுத்தப்பட்டுள்ளது.`.

source: Gradient Framework. :class:`qiskit.operators.gradients` Given an operator that represents either a quantum state resp. an expectation value, the gradient framework enables the evaluation of gradients, natural gradients, Hessians, as well as the Quantum Fisher Information.
ta_in: சாய்வு கட்டமைப்பு. : class: `qiskit.operators.gradients` ஒரு குவாண்டம் நிலை ரெஸ்பைக் குறிக்கும் ஒரு ஆபரேட்டருக்கு வழங்கப்பட்டது. ஒரு எதிர்பார்ப்பு மதிப்பு, சாய்வு கட்டமைப்பானது சாய்வு, இயற்கை சாய்வு, ஹெஸ்ஸியன் மற்றும் குவாண்டம் ஃபிஷர் தகவல்களை மதிப்பீடு செய்ய உதவுகிறது

source: Suppose a parameterized quantum state `|ψ(θ)〉 = V(θ)|ψ〉` with input state `|ψ〉` and parametrized Ansatz `V(θ)`, and an Operator `O(ω)`.
ta_in: ஒரு அளவுருவாக்கப்பட்ட குவாண்டம் நிலை `| ψ ()〉 = வி (ψ) | ψ input` உள்ளீட்டு நிலை `| ψ〉` மற்றும் அளவுருவாக்கப்பட்ட அன்சாட்ஸ் `வி (θ)`, மற்றும் ஒரு ஆபரேட்டர் `ஓ (ω)`.

source: Gradients: We want to compute :math:`d⟨ψ(θ)|O(ω)|ψ(θ)〉/ dω` resp. :math:`d⟨ψ(θ)|O(ω)|ψ(θ)〉/ dθ` resp. :math:`d⟨ψ(θ)|i〉⟨i|ψ(θ)〉/ dθ`.
ta_in: சாய்வு: நாம் கணக்கிட விரும்புகிறோம்: கணிதம்: `d⟨ψ (θ) | O (ω) | ψ (θ)〉 / dω` resp. : கணிதம்: `d⟨ψ (θ) | O (ω) | ψ ()〉 / dθ` resp. : கணிதம்: `d⟨ψ (θ) | i〉 | i | ψ ()〉 / dθ`

source: The last case corresponds to the gradient w.r.t. the sampling probabilities of `|ψ(θ)`. These gradients can be computed with different methods, i.e. a parameter shift, a linear combination of unitaries and a finite difference method.
ta_in: கடைசி வழக்கு சாய்வு w.r.t. `| ψ ()` இன் மாதிரி நிகழ்தகவுகள். இந்த சாய்வுகளை வெவ்வேறு முறைகள் மூலம் கணக்கிடலாம், அதாவது ஒரு அளவுரு மாற்றம், யூனிடரிகளின் நேரியல் கலவை மற்றும் வரையறுக்கப்பட்ட வேறுபாடு முறை.

source: Hessians: We want to compute :math:`d^2⟨ψ(θ)|O(ω)|ψ(θ)〉/ dω^2` resp. :math:`d^2⟨ψ(θ)|O(ω)|ψ(θ)〉/ dθ^2` resp. :math:`d^2⟨ψ(θ)|O(ω)|ψ(θ)〉/ dθdω` resp. :math:`d^2⟨ψ(θ)|i〉⟨i|ψ(θ)〉/ dθ^2`.
ta_in: ஹெஸ்ஸியன்ஸ்: நாங்கள் கணக்கிட விரும்புகிறோம்: கணிதம்: `d ^ 2⟨ψ () | O (ω) | ψ (θ)〉 / dω ^ 2` resp. : கணிதம்: `d ^ 2⟨ψ () | O (ω) | ψ ()〉 / dθ ^ 2` resp. : கணிதம்: `d ^ 2⟨ψ () | O (ω) | ψ (θ)〉 / dθdω` resp. : கணிதம்: `d ^ 2⟨ψ () | i〉 | i | ψ ()〉 / dθ ^ 2`.

source: The last case corresponds to the Hessian w.r.t. the sampling probabilities of `|ψ(θ)`. Just as the first order gradients, the Hessians can be evaluated with different methods, i.e. a parameter shift, a linear combination of unitaries and a finite difference method. Given a tuple of parameters ``Hessian().convert(op, param_tuple)`` returns the value for the second order derivative. If a list of parameters is given ``Hessian().convert(op, param_list)`` returns the full Hessian for all the given parameters according to the given parameter order.
ta_in: கடைசி வழக்கு ஹெஸியன் w.r.t. `| ψ ()` இன் மாதிரி நிகழ்தகவுகள். முதல் வரிசை சாய்வுகளைப் போலவே, ஹெஸ்ஸியன்களையும் வெவ்வேறு முறைகள் மூலம் மதிப்பீடு செய்யலாம், அதாவது ஒரு அளவுரு மாற்றம், அலகுகளின் நேரியல் கலவை மற்றும் வரையறுக்கப்பட்ட வேறுபாடு முறை. `` ஹெஸியன் () அளவுருக்கள் கொடுக்கப்பட்டால். மாற்றவும் (op, param_tuple) `` இரண்டாவது வரிசை வழித்தோன்றலுக்கான மதிப்பை வழங்குகிறது. அளவுருக்களின் பட்டியல் வழங்கப்பட்டால் `` ஹெஸியன் (). மாற்றவும் (op, param_list) `` கொடுக்கப்பட்ட அனைத்து பாராமீட்டர்க்கும் முழு ஹெஸ்ஸியனை வழங்குகிறது.

source: QFI: The Quantum Fisher Information `QFI` is a metric tensor which is representative for the representation capacity of a parameterized quantum state `|ψ(θ)〉 = V(θ)|ψ〉` generated by an input state `|ψ〉` and a parametrized Ansatz `V(θ)`. The entries of the `QFI` for a pure state read :math:`[QFI]kl= Re[〈∂kψ|∂lψ〉−〈∂kψ|ψ〉〈ψ|∂lψ〉] * 4`.
ta_in: QFI: குவாண்டம் ஃபிஷர் தகவல் `QFI` என்பது ஒரு மெட்ரிக் டென்சர் ஆகும், இது ஒரு அளவுரு குவாண்டம் மாநிலத்தின் பிரதிநிதித்துவ திறனுக்கான பிரதிநிதியாகும்` | ψ (θ) V = V (θ) | ψ ψ `உள்ளீட்டு நிலையால் உருவாக்கப்படுகிறது` | `மற்றும் அளவுருவாக்கப்பட்ட அன்சாட்ஸ்` வி (θ) `. தூய்மையான மாநிலத்திற்கான `QFI` இன் உள்ளீடுகள் படிக்க: கணிதம்:` [QFI] kl = Re [〈∂kψ | ∂lψ〉 - ∂kψ |〉 〈ψ | ∂lψ〉] * 4`.

source: Just as for the previous derivative types, the QFI can be computed using different methods: a full representation based on a linear combination of unitaries implementation, a block-diagonal and a diagonal representation based on an overlap method.
ta_in: முந்தைய வழித்தோன்றல் வகைகளைப் போலவே, QFI ஐ வெவ்வேறு முறைகளைப் பயன்படுத்தி கணக்கிடலாம்: யூனிடரிகளின் செயல்பாட்டின் நேரியல் கலவையை அடிப்படையாகக் கொண்ட முழு பிரதிநிதித்துவம், ஒரு தொகுதி-மூலைவிட்ட மற்றும் ஒன்றுடன் ஒன்று முறையின் அடிப்படையில் ஒரு மூலைவிட்ட பிரதிநிதித்துவம்.

source: The combination of the QFI and the gradient lead to a special form of a gradient, namely
ta_in: QFI மற்றும் சாய்வு ஆகியவற்றின் கலவையானது ஒரு சாய்வு சிறப்பு வடிவத்திற்கு வழிவகுக்கிறது, அதாவது

source: NaturalGradients: The natural gradient is a special gradient method which rescales a gradient w.r.t. a state parameter with the inverse of the corresponding Quantum Fisher Information (QFI) :math:`QFI^-1 d⟨ψ(θ)|O(ω)|ψ(θ)〉/ dθ`. Hereby, we can choose a gradient as well as a QFI method and a regularization method which is used together with a least square solver instead of exact invertion of the QFI:
ta_in: நேச்சுரல் கிராடியண்ட்ஸ்: இயற்கை சாய்வு என்பது ஒரு சிறப்பு சாய்வு முறையாகும், இது ஒரு சாய்வு மீட்டெடுக்கிறது w.r.t. தொடர்புடைய குவாண்டம் ஃபிஷர் தகவலின் (QFI) தலைகீழ் கொண்ட ஒரு மாநில அளவுரு: கணிதம்: `QFI ^ -1 d⟨ψ (θ) | O (ω) | ψ (θ)〉 / dθ`. இதன்மூலம், QFI இன் சரியான தலைகீழ் மாற்றத்திற்குப் பதிலாக குறைந்தபட்ச சதுர தீர்வோடு சேர்ந்து பயன்படுத்தப்படும் ஒரு சாய்வு மற்றும் QFI முறை மற்றும் ஒழுங்குமுறை முறை ஆகியவற்றை நாம் தேர்வு செய்யலாம்:

source: The gradient framework is also compatible with the optimizers from `qiskit.aqua.components.optimizers`. The derivative classes come with a `gradient_wrapper()` function which returns the corresponding callable.
ta_in: சாய்வு கட்டமைப்பானது `qiskit.aqua.components.optimizers` இலிருந்து உகப்பாக்கிகளுடன் இணக்கமானது. வழித்தோன்றல் வகுப்புகள் `கிரேடியண்ட்_வ்ரப்பர் ()` செயல்பாட்டுடன் வருகின்றன, இது தொடர்புடைய அழைப்பை வழங்குகிறது.

source: Introduces ``transformations`` for the fermionic and bosonic transformation of a problem instance. Transforms the fermionic operator to qubit operator. Respective class for the transformation is ``fermionic_transformation`` Introduces in algorithms ``ground_state_solvers`` for the calculation of ground state properties. The calculation can be done either using an ``MinimumEigensolver`` or using ``AdaptVQE`` Introduces ``chemistry/results`` where the eigenstate_result and the electronic_structure_result are also used for the algorithms. Introduces Minimum Eigensolver factories ``minimum_eigensolver_factories`` where chemistry specific minimum eigensolvers can be initialized Introduces orbital optimization vqe ``oovqe`` as a ground state solver for chemistry applications
ta_in: ஒரு சிக்கல் நிகழ்வின் ஃபெர்மியோனிக் மற்றும் போசோனிக் மாற்றத்திற்கான `` உருமாற்றங்களை`` அறிமுகப்படுத்துகிறது. ஃபெர்மியோனிக் ஆபரேட்டரை க்விட் ஆபரேட்டராக மாற்றுகிறது. உருமாற்றத்திற்கான மரியாதைக்குரிய வர்க்கம் `` ஃபெர்மியோனிக்_மாற்றம்`` என்பது நில நில பண்புகளைக் கணக்கிடுவதற்கான வழிமுறைகளில் `` கிரவுண்ட்_ஸ்டேட்_சால்வர்ஸ்`` அறிமுகப்படுத்துகிறது. கணக்கீடு ஒரு `` குறைந்தபட்ச ஈஜென்சால்வர்`` ஐப் பயன்படுத்தி அல்லது `` அடாப்ட்விக்யூ`` ஐப் பயன்படுத்தி `` வேதியியல் / முடிவுகளை`` அறிமுகப்படுத்துகிறது, அங்கு ஈஜென்ஸ்டேட்_ முடிவு மற்றும் மின்னணு_ கட்டமைப்பு

source: New Algorithm result classes:
ta_in: புதிய அல்காரிதம் முடிவு வகுப்புகள்:

source: :class:`~qiskit.aqua.algorithms.Grover` method :meth:`~qiskit.aqua.algorithms.Grover._run` returns class :class:`~qiskit.aqua.algorithms.GroverResult`. :class:`~qiskit.aqua.algorithms.AmplitudeEstimation` method :meth:`~qiskit.aqua.algorithms.AmplitudeEstimation._run` returns class :class:`~qiskit.aqua.algorithms.AmplitudeEstimationResult`. :class:`~qiskit.aqua.algorithms.IterativeAmplitudeEstimation` method :meth:`~qiskit.aqua.algorithms.IterativeAmplitudeEstimation._run` returns class :class:`~qiskit.aqua.algorithms.IterativeAmplitudeEstimationResult`. :class:`~qiskit.aqua.algorithms.MaximumLikelihoodAmplitudeEstimation` method :meth:`~qiskit.aqua.algorithms.MaximumLikelihoodAmplitudeEstimation._run` returns class :class:`~qiskit.aqua.algorithms.MaximumLikelihoodAmplitudeEstimationResult`.
ta_in: : வகுப்பு: `~ கிஸ்கிட் .அக்வா. வழிமுறைகள் .கிரோவர்` முறை: மெத்: `~ கிஸ்கிட் .அக்வா. வழிமுறைகள் .குரோவர் ._ ரன்` திரும்பும் வகுப்பு: வகுப்பு: `~ கிஸ்கிட் .அக்வா .அல்காரிதம்ஸ். க்ரோவர் ரிசல்ட்`. : வகுப்பு: `~ கிஸ்கிட் .அக்வா. வழிமுறைகள் .அம்ப்ளிட்யூட் மதிப்பீடு` முறை: மெத்: `~ கிஸ்கிட் .அக்வா. வழிமுறைகள். அலைவீச்சு மதிப்பீடு ._ரூன்` வகுப்பு: வகுப்பு: `~ கிஸ்கிட் .அக்வா. வழிமுறைகள் .அம்ப்ளிட்யூட் மதிப்பீட்டு முடிவு`. : வகுப்பு: `~ கிஸ்கிட். அக்வா. வழிமுறைகள். மறுபயன்பாட்டு வீச்சு மதிப்பீடு` முறை: மெத்: ` கிஸ்கிட். அக்வா. வழிமுறைகள் .செயல்பாட்டு வீச்சு மதிப்பீடு ._ ரன்` வகுப்பு: வகுப்பு: `கிஸ்கிட். அக்வா. வழிமுறைகள். மறுபயன்பாட்டு வீச்சு மதிப்பீட்டு முடிவு`. : வகுப்பு: `~ கிஸ்கிட். அக்வா. வழிமுறைகள். அதிகபட்ச விருப்பம்.

source: All new result classes are backwards compatible with previous result dictionary.
ta_in: அனைத்து புதிய முடிவுகளின் வகுப்புகள் முந்தைய விளைவு அகராதியுடன் பொருந்தும்.

source: New Linear Solver result classes:
ta_in: புதிய லீனியர் சொல்வர் முடிவு வகுப்புகள்:

source: ``MinimumEigenOptimizationResult`` now exposes properties: ``samples`` and ``eigensolver_result``. The latter is obtained from the underlying algorithm used by the optimizer and specific to the algorithm. ``RecursiveMinimumEigenOptimizer`` now returns an instance of the result class ``RecursiveMinimumEigenOptimizationResult`` which in turn may contains intermediate results obtained from the underlying algorithms. The dedicated result class exposes properties ``replacements`` and ``history`` that are specific to this optimizer. The depth of the history is managed by the ``history`` parameter of the optimizer.
ta_in: `` மினிமம்இஜென் ஆப்டிமைசேஷன் ரிசல்ட்`` இப்போது பண்புகளை அம்பலப்படுத்துகிறது: `` மாதிரிகள்`` மற்றும் `` ஈஜென்சால்வர்_ முடிவு``. பிந்தையது ஆப்டிமைசர் பயன்படுத்தும் அடிப்படை வழிமுறையிலிருந்து பெறப்படுகிறது மற்றும் வழிமுறைக்கு குறிப்பிட்டது. `` சுழல்நிலை மினிமம்இஜென் ஆப்டிமைசர்`` இப்போது முடிவு வகுப்பின் ஒரு உதாரணத்தை அளிக்கிறது `` சுழல்நிலைமினிமம்இஜென் ஆப்டிமைசேஷன் ரிசல்ட்`` இதன் விளைவாக அடிப்படை வழிமுறைகளிலிருந்து பெறப்பட்ட இடைநிலை முடிவுகள் இருக்கலாம். அர்ப்பணிப்பு முடிவு வகுப்பு பண்புகளை `` மாற்றீடுகள்`` மற்றும் `` வரலாறு`` ஆகியவற்றை வெளிப்படுத்துகிறது.

source: ``GroverOptimizer`` now returns an instance of ``GroverOptimizationResult`` and this result class exposes properties ``operation_counts``, ``n_input_qubits``, and ``n_output_qubits`` directly. These properties are not available in the ``raw_results`` dictionary anymore.
ta_in: `` க்ரோவர் ஆப்டிமைசர்`` இப்போது `` க்ரோவர் ஆப்டிமைசேஷன் ரிசல்ட்`` இன் ஒரு நிகழ்வைத் தருகிறது, மேலும் இந்த முடிவு வகுப்பு `` ஆபரேஷன்_கவுண்ட்ஸ்``, `` என்_இன்புட்_க்பிட்ஸ்``, மற்றும் `` என்_அவுட்_க்விட்ஸ்`` ஆகியவற்றை நேரடியாக வெளிப்படுத்துகிறது. இந்த பண்புகள் இனி `` raw_results`` அகராதியில் கிடைக்காது.

source: ``SlsqpOptimizer`` now returns an instance of ``SlsqpOptimizationResult`` and this result class exposes additional properties specific to the SLSQP implementation.
ta_in: `` SlsqpOptimizer`` இப்போது `` SlsqpOptimizationResult`` இன் ஒரு உதாரணத்தைத் தருகிறது, மேலும் இந்த முடிவு வகுப்பு SLSQP செயல்படுத்தலுக்கான குறிப்பிட்ட கூடுதல் பண்புகளை அம்பலப்படுத்துகிறது.

source: Support passing ``QuantumCircuit`` objects as generator circuits into the ``QuantumGenerator``.
ta_in: `` குவாண்டம் சர்க்யூட்`` பொருள்களை ஜெனரேட்டர் சுற்றுகளாக `` குவாண்டம் ஜெனரேட்டருக்கு`` அனுப்பும் ஆதரவு.

source: Removes the restriction to real input vectors in CircuitStateFn.from_vector. The method calls extensions.Initialize. The latter explicitly supports (in API and documentation) complex input vectors. So this restriction seems unnecessary.
ta_in: CircuitStateFn.from_vector இல் உண்மையான உள்ளீட்டு திசையன்களுக்கான கட்டுப்பாட்டை நீக்குகிறது. முறை நீட்டிப்புகளை அழைக்கிறது. பிந்தையது சிக்கலான உள்ளீட்டு திசையன்களை வெளிப்படையாக ஆதரிக்கிறது (API மற்றும் ஆவணங்கள்). எனவே இந்த கட்டுப்பாடு தேவையற்றதாகத் தெரிகிறது.

source: Simplified `AbelianGrouper` using a graph coloring algorithm of retworkx. It is faster than the numpy-based coloring algorithm.
ta_in: Retworkx இன் வரைபட வண்ணமயமாக்கல் வழிமுறையைப் பயன்படுத்தி எளிமைப்படுத்தப்பட்ட `AbelianGrouper`. இது numpy அடிப்படையிலான வண்ணமயமாக்கல் வழிமுறையை விட வேகமானது.

source: Allow calling ``eval`` on state function objects with no argument, which returns the ``VectorStateFn`` representation of the state function. This is consistent behavior with ``OperatorBase.eval``, which returns the ``MatrixOp`` representation, if no argument is passed.
ta_in: எந்தவொரு வாதமும் இல்லாத மாநில செயல்பாட்டு பொருள்களில் `` எவல்`` ஐ அழைக்க அனுமதிக்கவும், இது மாநில செயல்பாட்டின் `` வெக்டர்ஸ்டேட்எஃப்`` பிரதிநிதித்துவத்தை வழங்குகிறது. இது `` ஆபரேட்டர் பேஸ்.இவல்`` உடன் நிலையான நடத்தை, இது எந்தவொரு வாதமும் நிறைவேற்றப்படாவிட்டால், `` மேட்ரிக்ஸ்ஆப்`` பிரதிநிதித்துவத்தை வழங்குகிறது.

source: Adds ``max_iterations`` to the ``VQEAdapt`` class in order to allow limiting the maximum number of iterations performed by the algorithm.
ta_in: வழிமுறையால் நிகழ்த்தப்படும் அதிகபட்ச எண்ணிக்கையிலான மறு செய்கைகளை கட்டுப்படுத்த அனுமதிக்க `` VQEAdapt`` வகுப்பில் `` அதிகபட்ச_அறிவுகளை`` சேர்க்கிறது.

source: VQE expectation computation with Aer qasm_simulator now defaults to a computation that has the expected shot noise behavior. The special Aer snapshot based computation, that is much faster, with the ideal output similar to state vector simulator, may still be chosen but like before Aqua 0.7 it now no longer defaults to this but can be chosen.
ta_in: Aer qasm_simulator உடன் VQE எதிர்பார்ப்பு கணக்கீடு இப்போது எதிர்பார்க்கப்படும் ஷாட் இரைச்சல் நடத்தை கொண்ட ஒரு கணக்கீட்டிற்கு இயல்புநிலையாகிறது. சிறப்பு ஏர் ஸ்னாப்ஷாட் அடிப்படையிலான கணக்கீடு, இது மிகவும் வேகமானது, மாநில திசையன் சிமுலேட்டரைப் போன்ற சிறந்த வெளியீட்டைக் கொண்டு இன்னும் தேர்வு செய்யப்படலாம், ஆனால் அக்வா 0.7 க்கு முன்பு போலவே இது இப்போது இயல்புநிலையாக இருக்காது, ஆனால் தேர்வு செய்யப்படலாம்.

source: Extension of the previous Analytic Quantum Gradient Descent (AQGD) classical optimizer with the AQGD with Epochs. Now AQGD performs the gradient descent optimization with a momentum term, analytic gradients, and an added customized step length schedule for parametrized quantum gates. Gradients are computed "analytically" using the quantum circuit when evaluating the objective function.
ta_in: முந்தைய அனலிட்டிக் குவாண்டம் கிரேடியண்ட் டிசென்ட் (AQGD) கிளாசிக்கல் ஆப்டிமைசரின் நீட்டிப்பு AQGD உடன் சகாப்தங்களுடன். இப்போது AQGD ஒரு வேகமான சொல், பகுப்பாய்வு சாய்வு மற்றும் அளவுருவாக்கப்பட்ட குவாண்டம் வாயில்களுக்கான கூடுதல் தனிப்பயனாக்கப்பட்ட படி நீள அட்டவணையுடன் சாய்வு வம்சாவளியை மேம்படுத்துகிறது. புறநிலை செயல்பாட்டை மதிப்பிடும்போது குவாண்டம் சுற்று பயன்படுத்தி சாய்வு "பகுப்பாய்வு ரீதியாக" கணக்கிடப்படுகிறது.

source: The deprecated support for running qiskit-aqua with Python 3.5 has been removed. To use qiskit-aqua >=0.8.0 you will now need at least Python 3.6. If you are using Python 3.5 the last version which will work is qiskit-aqua 0.7.x.
ta_in: பைதான் 3.5 உடன் கிஸ்கிட்-அக்வாவை இயக்குவதற்கான நீக்கப்பட்ட ஆதரவு நீக்கப்பட்டது. Qiskit-aqua> = 0.8.0 ஐப் பயன்படுத்த உங்களுக்கு இப்போது குறைந்தபட்சம் பைதான் 3.6 தேவைப்படும். நீங்கள் பைதான் 3.5 ஐப் பயன்படுத்துகிறீர்கள் என்றால், வேலை செய்யும் கடைசி பதிப்பு கிஸ்கிட்-அக்வா 0.7.x.

source: Added retworkx as a new dependency.
ta_in: Retworkx ஐ புதிய சார்புநிலையாகச் சேர்த்தது.

source: The ``i_objective`` argument of the amplitude estimation algorithms has been renamed to ``objective_qubits``.
ta_in: வீச்சு மதிப்பீட்டு வழிமுறைகளின் `` i_objective`` வாதம் `` புறநிலை_க்பிட்கள்`` என மறுபெயரிடப்பட்டது.

source: TransformationType
ta_in: உருமாற்ற வகை

source: QubitMappingType
ta_in: குபிட் மேப்பிங் டைப்
