Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: The ``LegacySwap`` pass has been removed. If you were using it in a custom pass manager, it's usage can be replaced by the ``StochasticSwap`` pass, which is a faster more stable version. All the preset passmanagers have been updated to use ``StochasticSwap`` pass instead of the ``LegacySwap``.
ta_in: `` LegacySwap`` பாஸ் அகற்றப்பட்டது. தனிப்பயன் பாஸ் நிர்வாகியில் நீங்கள் இதைப் பயன்படுத்தினால், அதன் பயன்பாட்டை `` StochasticSwap`` பாஸால் மாற்றலாம், இது வேகமான நிலையான பதிப்பாகும். முன்னமைக்கப்பட்ட அனைத்து பாஸ்மேனேஜர்களும் `` LegacySwap`` க்கு பதிலாக `` StochasticSwap`` பாஸைப் பயன்படுத்த புதுப்பிக்கப்பட்டுள்ளனர்.

source: The following deprecated ``qiskit.dagcircuit.DAGCircuit`` methods have been removed:
ta_in: பின்வரும் நீக்கப்பட்ட `` qiskit.dagcircuit.DAGCircuit`` முறைகள் நீக்கப்பட்டன:

source: ``DAGCircuit.get_qubits()`` - Use ``DAGCircuit.qubits()`` instead
ta_in: `` DAGCircuit.get_qubits () `` - அதற்கு பதிலாக `` DAGCircuit.qubits () `` ஐப் பயன்படுத்தவும்

source: ``DAGCircuit.get_bits()`` - Use ``DAGCircuit.clbits()`` instead
ta_in: `` DAGCircuit.get_bits () `` - அதற்கு பதிலாக `` DAGCircuit.clbits () `` ஐப் பயன்படுத்தவும்

source: ``DAGCircuit.qasm()`` - Use a combination of ``qiskit.converters.dag_to_circuit()`` and ``QuantumCircuit.qasm()``. For example::
ta_in: `` DAGCircuit.qasm () `` - `` qiskit.converters.dag_to_circuit () `` மற்றும் `` QuantumCircuit.qasm () `` ஆகியவற்றின் கலவையைப் பயன்படுத்தவும். உதாரணத்திற்கு::

source: ``DAGCircuit.get_op_nodes()`` - Use ``DAGCircuit.op_nodes()`` instead. Note that the return type is a list of ``DAGNode`` objects for ``op_nodes()`` instead of the list of tuples previously returned by ``get_op_nodes()``.
ta_in: `` DAGCircuit.get_op_nodes () `` - அதற்கு பதிலாக `` DAGCircuit.op_nodes () `` ஐப் பயன்படுத்தவும். திரும்பும் வகை என்பது `` get_op_nodes () `` ஆல் முன்னர் வழங்கப்பட்ட டுபில்களின் பட்டியலுக்குப் பதிலாக `` op_nodes () `` க்கான `` DAGNode`` பொருட்களின் பட்டியல் என்பதை நினைவில் கொள்க.

source: ``DAGCircuit.get_gate_nodes()`` - Use ``DAGCircuit.gate_nodes()`` instead. Note that the return type is a list of ``DAGNode`` objects for ``gate_nodes()`` instead of the list of tuples previously returned by ``get_gate_nodes()``.
ta_in: `` DAGCircuit.get_op_nodes () `` - அதற்கு பதிலாக `` DAGCircuit.op_nodes () `` ஐப் பயன்படுத்தவும். திரும்பும் வகை என்பது `` get_op_nodes () `` ஆல் முன்னர் வழங்கப்பட்ட டுபில்களின் பட்டியலுக்குப் பதிலாக `` op_nodes () `` க்கான `` DAGNode`` பொருட்களின் பட்டியல் என்பதை நினைவில் கொள்க.

source: ``DAGCircuit.get_named_nodes()`` - Use ``DAGCircuit.named_nodes()`` instead. Note that the return type is a list of ``DAGNode`` objects for ``named_nodes()`` instead of the list of node_ids previously returned by ``get_named_nodes()``.
ta_in: `` DAGCircuit.get_op_nodes () `` - அதற்கு பதிலாக `` DAGCircuit.op_nodes () `` ஐப் பயன்படுத்தவும். திரும்பும் வகை என்பது `` get_op_nodes () `` ஆல் முன்னர் வழங்கப்பட்ட டுபில்களின் பட்டியலுக்குப் பதிலாக `` op_nodes () `` க்கான `` DAGNode`` பொருட்களின் பட்டியல் என்பதை நினைவில் கொள்க.

source: ``DAGCircuit.get_2q_nodes()`` - Use ``DAGCircuit.twoQ_gates()`` instead. Note that the return type is a list of ``DAGNode`` objects for ``twoQ_gates()`` instead of the list of data_dicts previously returned by ``get_2q_nodes()``.
ta_in: `` DAGCircuit.get_op_nodes () `` - அதற்கு பதிலாக `` DAGCircuit.op_nodes () `` ஐப் பயன்படுத்தவும். திரும்பும் வகை என்பது `` get_op_nodes () `` ஆல் முன்னர் வழங்கப்பட்ட டுபில்களின் பட்டியலுக்குப் பதிலாக `` op_nodes () `` க்கான `` DAGNode`` பொருட்களின் பட்டியல் என்பதை நினைவில் கொள்க.

source: ``DAGCircuit.get_3q_or_more_nodes()`` - Use ``DAGCircuit.threeQ_or_more_gates()`` instead. Note that the return type is a list of ``DAGNode`` objects for ``threeQ_or_more_gates()`` instead of the list of tuples previously returned by ``get_3q_or_more_nodes()``.
ta_in: `` DAGCircuit.get_op_nodes () `` - அதற்கு பதிலாக `` DAGCircuit.op_nodes () `` ஐப் பயன்படுத்தவும். திரும்பும் வகை என்பது `` get_op_nodes () `` ஆல் முன்னர் வழங்கப்பட்ட டுபில்களின் பட்டியலுக்குப் பதிலாக `` op_nodes () `` க்கான `` DAGNode`` பொருட்களின் பட்டியல் என்பதை நினைவில் கொள்க.

source: The following ``qiskit.dagcircuit.DAGCircuit`` methods had deprecated support for accepting a ``node_id`` as a parameter. This has been removed and now only ``DAGNode`` objects are accepted as input:
ta_in: பின்வரும் `` qiskit.dagcircuit.DAGCircuit`` முறைகள் ஒரு `` node_id`` ஐ ஒரு அளவுருவாக ஏற்றுக்கொள்வதற்கான ஆதரவைக் குறைத்துவிட்டன. இது அகற்றப்பட்டது, இப்போது `` DAGNode`` பொருள்கள் மட்டுமே உள்ளீடாக ஏற்றுக்கொள்ளப்படுகின்றன:

source: The ``qiskit.dagcircuit.DAGCircuit`` method ``rename_register()`` has been removed. This was unused by all the qiskit code. If you were relying on it externally you'll have to re-implement is an external function.
ta_in: `` Qiskit.dagcircuit.DAGCircuit`` முறை `` rename_register() `` அகற்றப்பட்டது. இது அனைத்து கிஸ்கிட் குறியீடும் பயன்படுத்தப்படவில்லை. நீங்கள் அதை வெளிப்புறமாக நம்பியிருந்தால், நீங்கள் மீண்டும் செயல்படுத்த வேண்டியது வெளிப்புற செயல்பாடு.

source: The ``qiskit.dagcircuit.DAGCircuit`` property ``multi_graph`` has been removed. Direct access to the underlying ``networkx`` ``multi_graph`` object isn't supported anymore. The API provided by the ``DAGCircuit`` class should be used instead.
ta_in: ` ` qiskit.dagcircuit.DAGCircuit ` ` பண்பாடு ` ` multi_graph ` ` நீக்கப்பட்டது. நேரடியான ` 'networkx ` ` ` multi_graph ` ` பொருள் இனி ஆதரிக்கப்படவில்லை. ` ` DAGCircuit ` ` வகுப்பால் வழங்கப்படும் API, அதற்கு பதிலாக பயன்படும்.

source: The deprecated exception class ``qiskit.qiskiterror.QiskitError`` has been removed. Instead you should use ``qiskit.exceptions.QiskitError``.
ta_in: நீக்கப்பட்ட விதிவிலக்கு வகுப்பு `` qiskit.qiskiterror.QiskitError`` அகற்றப்பட்டது. அதற்கு பதிலாக நீங்கள் `` qiskit.exceptions.QiskitError`` ஐப் பயன்படுத்த வேண்டும்.

source: The boolean kwargs, ``ignore_requires`` and ``ignore_preserves`` from the ``qiskit.transpiler.PassManager`` constructor have been removed. These are no longer valid options.
ta_in: `` Qiskit.transpiler.PassManager` இன் கட்டமைப்பாளரிடமிருந்து பூலியன் குவார்க்ஸ், `` ignore_requires`` மற்றும் ``ignore_presevers`` ஆகியவை நீக்கப்பட்டன. இவை இனி சரியான விருப்பங்கள் அல்ல.

source: The module ``qiskit.tools.logging`` has been removed. This module was not used by anything and added nothing over the interfaces that Python's standard library ``logging`` module provides. If you want to set a custom formatter for logging use the standard library ``logging`` module instead.
ta_in: `` Qiskit.tools.logging`` தொகுதி நீக்கப்பட்டது. இந்த தொகுதி எதையும் பயன்படுத்தவில்லை மற்றும் பைத்தானின் நிலையான நூலகம் ``logging`` தொகுதி வழங்கும் இடைமுகங்களில் எதையும் சேர்க்கவில்லை. உள்நுழைவதற்கு தனிப்பயன் வடிவமைப்பை அமைக்க விரும்பினால், அதற்கு பதிலாக நிலையான நூலகம் ``logging'` தொகுதியைப் பயன்படுத்தவும்.

source: The ``CompositeGate`` class has been removed. Instead you should directly create a instruction object from a circuit and append that to your circuit. For example, you can run something like::
ta_in: `` CompositeGate`` வகுப்பு அகற்றப்பட்டது. அதற்கு பதிலாக நீங்கள் ஒரு சுற்றிலிருந்து ஒரு அறிவுறுத்தல் பொருளை நேரடியாக உருவாக்கி அதை உங்கள் சுற்றுடன் சேர்க்க வேண்டும். எடுத்துக்காட்டாக, நீங்கள்::

source: The previously deprecated kwargs, ``seed`` and ``config`` for ``qiskit.compiler.assemble()`` have been removed use ``seed_simulator`` and ``run_config`` respectively instead.
ta_in: முன்பு நீக்கப்பட்ட குவார்க்குகள், ``seed`` மற்றும் `` qiskit.compiler.assemble () `` க்கான ``config`` ஆகியவை நீக்கப்பட்டன, அதற்கு பதிலாக முறையே `` seed_simulator`` மற்றும் `` run_config`` ஆகியவற்றைப் பயன்படுத்தவும்.

source: The previously deprecated converters ``qiskit.converters.qobj_to_circuits()`` and ``qiskit.converters.circuits_to_qobj()`` have been removed. Use ``qiskit.assembler.disassemble()`` and ``qiskit.compiler.assemble()`` respectively instead.
ta_in: முன்னர் நீக்கப்பட்ட மாற்றிகள் `` qiskit.converters.qobj_to_circuits () `` மற்றும் `` qiskit.converters.circuits_to_qobj () `` நீக்கப்பட்டன. அதற்கு பதிலாக முறையே `` qiskit.assembler.disassemble () `` மற்றும் `` qiskit.compiler.assemble () `` ஐப் பயன்படுத்தவும்.

source: The previously deprecated kwarg ``seed_mapper`` for ``qiskit.compiler.transpile()`` has been removed. Instead you should use ``seed_transpiler``
ta_in: `` Qiskit.compiler.transpile () `` க்காக முன்னர் நீக்கப்பட்ட குவார்க் `` seed_mapper`` அகற்றப்பட்டது. அதற்கு பதிலாக நீங்கள் `` seed_transpiler`` ஐப் பயன்படுத்த வேண்டும்

source: The previously deprecated kwargs ``seed``, ``seed_mapper``, ``config``, and ``circuits`` for the ``qiskit.execute()`` function have been removed. Use ``seed_simulator``, ``seed_transpiler``, ``run_config``, and ``experiments`` arguments respectively instead.
ta_in: `` Qiskit.execute () `` செயல்பாட்டிற்காக முன்னர் நீக்கப்பட்ட குவார்க்ஸ் ``seed``, ``seed_mapper``, ``config`` மற்றும் ``circuits``ஆகியவை நீக்கப்பட்டன. அதற்கு பதிலாக முறையே `` seed_simulator``, ``seed_transpiler``, ``run_config``, மற்றும் ``experiments`` வாதங்களைப் பயன்படுத்தவும்.

source: The previously deprecated ``qiskit.tools.qcvv`` module has been removed use qiskit-ignis instead.
ta_in: முன்னர் நீக்கப்பட்ட `` qiskit.tools.qcvv`` தொகுதி அகற்றப்பட்டது, அதற்கு பதிலாக qiskit-ignis ஐப் பயன்படுத்தவும்.

source: The previously deprecated functions ``qiskit.transpiler.transpile()`` and ``qiskit.transpiler.transpile_dag()`` have been removed. Instead you should use ``qiskit.compiler.transpile``. If you were using ``transpile_dag()`` this can be replaced by running::
ta_in: முன்னர் நீக்கப்பட்ட செயல்பாடுகள் `` qiskit.transpiler.transpile () `` மற்றும் `` qiskit.transpiler.transpile_dag () `` நீக்கப்பட்டன. அதற்கு பதிலாக நீங்கள் `` qiskit.compiler.transpile`` ஐப் பயன்படுத்த வேண்டும். நீங்கள் `` transpile_dag()`` ஐப் பயன்படுத்தினால், இதை இயக்குவதன் மூலம் மாற்றலாம்::

source: The previously deprecated function ``qiskit.compile()`` has been removed instead you should use ``qiskit.compiler.transpile()`` and ``qiskit.compiler.assemble()``.
ta_in: முன்னர் நீக்கப்பட்ட செயல்பாடு `` qiskit.compile () `` அகற்றப்பட்டது, அதற்கு பதிலாக நீங்கள் `` qiskit.compiler.transpile () `` மற்றும் `` qiskit.compiler.assemble () `` ஐப் பயன்படுத்த வேண்டும்.

source: The jupyter cell magic ``%%qiskit_progress_bar`` from ``qiskit.tools.jupyter`` has been changed to a line magic. This was done to better reflect how the magic is used and how it works. If you were using the ``%%qiskit_progress_bar`` cell magic in an existing notebook, you will have to update this to be a line magic by changing it to be ``%qiskit_progress_bar`` instead. Everything else should behave identically.
ta_in: `` Qiskit.tools.jupyter`` இலிருந்து `` %%qiskit_progress_bar`` என்ற ஜூபிட்டர் செல் மேஜிக் ஒரு வரி மந்திரமாக மாற்றப்பட்டுள்ளது. மந்திரம் எவ்வாறு பயன்படுத்தப்படுகிறது, அது எவ்வாறு இயங்குகிறது என்பதை சிறப்பாக பிரதிபலிக்க இது செய்யப்பட்டது. நீங்கள் ஏற்கனவே இருக்கும் நோட்புக்கில் `` %%qiskit_progress_bar`` செல் மந்திரத்தைப் பயன்படுத்தினால், அதற்கு பதிலாக ``%qiskit_progress_bar`` என மாற்றுவதன் மூலம் இதை ஒரு வரி மந்திரமாக புதுப்பிக்க வேண்டும். மற்ற அனைத்தும் ஒரே மாதிரியாக நடந்து கொள்ள வேண்டும்.

source: The deprecated function ``qiskit.tools.qi.qi.random_unitary_matrix()`` has been removed. You should use the ``qiskit.quantum_info.random.random_unitary()`` function instead.
ta_in: நீக்கப்பட்ட செயல்பாடு `` qiskit.tools.qi.qi.random_unitary_matrix () `` நீக்கப்பட்டது. அதற்கு பதிலாக நீங்கள் `` qiskit.quantum_info.random.random_unitary () `` செயல்பாட்டைப் பயன்படுத்த வேண்டும்.

source: The deprecated function ``qiskit.tools.qi.qi.random_density_matrix()`` has been removed. You should use the ``qiskit.quantum_info.random.random_density_matrix()`` function instead.
ta_in: நீக்கப்பட்ட செயல்பாடு `` qiskit.tools.qi.qi.random_decity_matrix () `` நீக்கப்பட்டது. அதற்கு பதிலாக `` qiskit.quantum_info.random.random_decity_matrix () `` செயல்பாட்டைப் பயன்படுத்த வேண்டும்.

source: The deprecated function ``qiskit.tools.qi.qi.purity()`` has been removed. You should the ``qiskit.quantum_info.purity()`` function instead.
ta_in: நீக்கப்பட்ட செயல்பாடு `` qiskit.tools.qi.qi.purity () `` நீக்கப்பட்டது. அதற்கு பதிலாக நீங்கள் `` qiskit.quantum_info.purity () `` செயல்பட வேண்டும்.

source: The deprecated ``QuantumCircuit._attach()`` method has been removed. You should use ``QuantumCircuit.append()`` instead.
ta_in: நீக்கப்பட்ட `` QuantumCircuit._attach () `` முறை நீக்கப்பட்டது. அதற்கு பதிலாக `` QuantumCircuit.append () `` ஐப் பயன்படுத்த வேண்டும்.

source: The ``qiskit.qasm.Qasm`` method ``get_filename()`` has been removed. You can use the ``return_filename()`` method instead.
ta_in: `` Qiskit.qasm.Qasm`` முறை `` get_filename () `` அகற்றப்பட்டது. அதற்கு பதிலாக `` return_filename () `` முறையைப் பயன்படுத்தலாம்.

source: The deprecated ``qiskit.mapper`` module has been removed. The list of functions and classes with their alternatives are:
ta_in: நீக்கப்பட்ட `` qiskit.mapper`` தொகுதி நீக்கப்பட்டது. அவற்றின் மாற்றுகளுடன் செயல்பாடுகள் மற்றும் வகுப்புகளின் பட்டியல்:

source: ``qiskit.mapper.CouplingMap``: ``qiskit.transpiler.CouplingMap`` should be used instead.
ta_in: `` qiskit.mapper.CouplingMap``: `` qiskit.transpiler.CouplingMap`` அதற்கு பதிலாக பயன்படுத்தப்பட வேண்டும்.

source: ``qiskit.mapper.Layout``: ``qiskit.transpiler.Layout`` should be used instead
ta_in: `` qiskit.mapper.Layout``: `` qiskit.transpiler.Layout`` அதற்கு பதிலாக பயன்படுத்தப்பட வேண்டும்

source: ``qiskit.mapper.compiling.euler_angles_1q()``: ``qiskit.quantum_info.synthesis.euler_angles_1q()`` should be used instead
ta_in: `` qiskit.mapper.compiling.euler_angles_1q () ``: `` qiskit.quantum_info.synthesis.euler_angles_1q () `` அதற்கு பதிலாக பயன்படுத்தப்பட வேண்டும்

source: ``qiskit.mapper.compiling.two_qubit_kak()``: ``qiskit.quantum_info.synthesis.two_qubit_cnot_decompose()`` should be used instead.
ta_in: `` qiskit.mapper.compiling.two_qubit_kak () ``: `` qiskit.quantum_info.synthesis.two_qubit_cnot_decompose () `` அதற்கு பதிலாக பயன்படுத்தப்பட வேண்டும்.

source: The deprecated exception classes ``qiskit.mapper.exceptions.CouplingError`` and ``qiskit.mapper.exceptions.LayoutError`` don't have an alternative since they serve no purpose without a ``qiskit.mapper`` module.
ta_in: நீக்கப்பட்ட விதிவிலக்கு வகுப்புகள் `` qiskit.mapper.exceptions.CouplingError`` மற்றும் `` qiskit.mapper.exceptions.LayoutError`` க்கு ஒரு மாற்று இல்லை, ஏனெனில் அவை `` qiskit.mapper`` தொகுதி இல்லாமல் எந்த நோக்கமும் செய்யாது.

source: The ``qiskit.pulse.samplers`` module has been moved to ``qiskit.pulse.pulse_lib.samplers``. You will need to update imports of ``qiskit.pulse.samplers`` to ``qiskit.pulse.pulse_lib.samplers``.
ta_in: `` Qiskit.pulse.samplers`` தொகுதி `` qiskit.pulse.pulse_lib.samplers`` க்கு நகர்த்தப்பட்டது. `` Qiskit.pulse.samplers`` இன் இறக்குமதியை `` qiskit.pulse.pulse_lib.samplers`` க்கு புதுப்பிக்க வேண்டும்.

source: `seaborn`_ is now a dependency for the function ``qiskit.visualization.plot_state_qsphere()``. It is needed to generate proper angular color maps for the visualization. The ``qiskit-terra[visualization]`` extras install target has been updated to install ``seaborn>=0.9.0`` If you are using visualizations and specifically the ``plot_state_qsphere()`` function you can use that to install ``seaborn`` or just manually run ``pip install seaborn>=0.9.0``
ta_in: `seaborn`_ இப்போது` `qiskit.visualization.plot_state_qsphere ()` `செயல்பாட்டிற்கான சார்புநிலையாகும். காட்சிப்படுத்தலுக்கு சரியான கோண வண்ண வரைபடங்களை உருவாக்க இது தேவைப்படுகிறது. ``qiskit-terra [visualization] `` கூடுதல் நிறுவல் இலக்கு ``seaborn> = 0.9.0`` ஐ நிறுவ புதுப்பிக்கப்பட்டுள்ளது. நீங்கள் காட்சிப்படுத்தல் மற்றும் குறிப்பாக `` plot_state_qsphere () `` செயல்பாட்டைப் பயன்படுத்துகிறீர்கள் என்றால், ``seaborn`` ஐ நிறுவ அல்லது கைமுறையாக ``pip install seaborn> = 0.9.0`` ஐ இயக்கலாம்

source: The previously deprecated functions ``qiksit.visualization.plot_state`` and ``qiskit.visualization.iplot_state`` have been removed. Instead you should use the specific function for each plot type. You can refer to the following tables to map the deprecated functions to their equivalent new ones:
ta_in: முன்னர் நீக்கப்பட்ட செயல்பாடுகள் `` qiksit.visualization.plot_state`` மற்றும் `` qiskit.visualization.iplot_state`` ஆகியவை நீக்கப்பட்டன. அதற்கு பதிலாக ஒவ்வொரு சதி வகைக்கும் குறிப்பிட்ட செயல்பாட்டை நீங்கள் பயன்படுத்த வேண்டும். நீக்கப்பட்ட செயல்பாடுகளை அவற்றின் சமமான புதியவற்றுடன் வரைபட பின்வரும் அட்டவணையைப் பார்க்கலாம்:

source: plot_state(rho, method='paulivec')
ta_in: plot_state(rho, method='city')

source: The ``pylatexenc`` and ``pillow`` dependencies for the ``latex`` and ``latex_source`` circuit drawer backends are no longer listed as requirements. If you are going to use the latex circuit drawers ensure you have both packages installed or use the setuptools extras to install it along with qiskit-terra::
ta_in: `` latex`` மற்றும் ``latex_source`` சர்க்யூட் டிராயர் பின்தளத்தில் உள்ள ``pylatexenc`` மற்றும் ``pillow'` சார்புகள் இனி தேவைகளாக பட்டியலிடப்படவில்லை. நீங்கள் லேடெக்ஸ் சர்க்யூட் டிராயர்களைப் பயன்படுத்தப் போகிறீர்கள் என்றால், நீங்கள் இரண்டு தொகுப்புகளையும் நிறுவியிருப்பதை உறுதிசெய்கிறீர்களா அல்லது கிஸ்கிட்-டெர்ராவுடன் சேர்ந்து அதை நிறுவ செட்டப்டூல்ஸ் கூடுதல் பயன்படுத்தவும்::

source: The root of the ``qiskit`` namespace will now emit a warning on import if either ``qiskit.IBMQ`` or ``qiskit.Aer`` could not be setup. This will occur whenever anything in the ``qiskit`` namespace is imported. These warnings were added to make it clear for users up front if they're running qiskit and the qiskit-aer and qiskit-ibmq-provider packages could not be found. It's not always clear if the packages are missing or python packaging/pip installed an element incorrectly until you go to use them and get an empty ``ImportError``. These warnings should make it clear up front if there these commonly used aliases are missing.
ta_in: `` qiskit.IBMQ'` அல்லது ``qiskit.Aer`` ஆகியவற்றை அமைக்க முடியாவிட்டால், `` qiskit`` பெயர்வெளியின் வேர் இப்போது இறக்குமதி குறித்த எச்சரிக்கையை வெளியிடும். ``qiskit`` பெயர்வெளியில் எதையும் இறக்குமதி செய்யும்போதெல்லாம் இது நிகழும். பயனர்கள் qiskitஐ இயக்குகிறார்களா என்பதை தெளிவுபடுத்துவதற்காக இந்த எச்சரிக்கைகள் சேர்க்கப்பட்டன, மேலும் qiskit-aer மற்றும் qiskit-ibmq-வழங்குநர் தொகுப்புகளைக் கண்டுபிடிக்க முடியவில்லை. தொகுப்புகள் காணவில்லை அல்லது பைதான் பேக்கேஜிங் / பிப் ஒரு உறுப்பை தவறாக நிறுவியிருக்கிறதா என்பது தெளிவாகத் தெரியவில்லை, அவற்றைப் பயன்படுத்த நீங்கள் சென்று வெற்று ``ImportError`` கிடைக்கும். பொதுவாக பயன்படுத்தப்படும் இந்த மாற்றுப்பெயர்கள் காணவில்லை எனில் இந்த எச்சரிக்கைகள் முன் தெளிவுபடுத்த வேண்டும்.

source: However, for users that choose not to use either qiskit-aer or qiskit-ibmq-provider this might cause additional noise. For these users these warnings are easily suppressable using Python's standard library ``warnings``. Users can suppress the warnings by putting these two lines before any imports from qiskit::
ta_in: எனினும், பயனர்களுக்காக, qiskit-aer அல்லது qiskit-ibmq-வழங்குநர் பயன்படுத்துவதற்கு இல்லையென்றால் இது கூடுதல் ஒலியை ஏற்படுத்தலாம். இந்த பயனர்களுக்கு இந்த எச்சரிப்புகள் எளிதாக, பைதான் (Python) நிலையான நூலகம் ` ` warnings ` `. பயனர்கள் இந்த இரண்டு வரிகளை qiskit லிருந்து எந்த இறக்குமதியின் முன் இந்த இரண்டு வரிகளை தடுக்க முடியும்::

source: This will suppress the warnings emitted by not having qiskit-aer or qiskit-ibmq-provider installed, but still preserve any other warnings emitted by qiskit or any other package.
ta_in: இது qiskit-aer அல்லது qiskit-ibmq-வழங்குபவர் நிறுவப்பட்டிருப்பது இல்லையென்றால், இன்னும் இன்னும் பிற எச்சரிகளை பாதுகாக்கிறது.

source: The ``U`` and ``CX`` gates have been deprecated. If you're using these gates in your code you should update them to use ``u3`` and ``cx`` instead. For example, if you're using the circuit gate functions ``circuit.u_base()`` and ``circuit.cx_base()`` you should update these to be ``circuit.u3()`` and ``circuit.cx()`` respectively.
ta_in: `` U`` மற்றும் `` CX`` கேட்கள் நீக்கப்பட்டன. உங்கள் குறியீட்டில் இந்த கேட்களைப் பயன்படுத்துகிறீர்கள் என்றால், அதற்கு பதிலாக `` u3`` மற்றும் `` cx`` ஐப் பயன்படுத்த அவற்றை புதுப்பிக்க வேண்டும். எடுத்துக்காட்டாக, நீங்கள் சர்க்யூட் கேட் செயல்பாடுகளைப் பயன்படுத்துகிறீர்கள் என்றால் ``circuit.u.base () `` மற்றும் ``circuit.cx.base() `` இவை ``circuit.u3() `` மற்றும் ``circuit.cx()" என புதுப்பிக்க வேண்டும் முறையே.

source: The ``u0`` gate has been deprecated in favor of using multiple ``iden`` gates and it will be removed in the future. If you're using the ``u0`` gate in your circuit you should update your calls to use ``iden``. For example, f you were using ``circuit.u0(2)`` in your circuit before that should be updated to be::
ta_in: `` U0`` கேட் பல ``Iden`` கேட்களைப் பயன்படுத்துவதற்கு ஆதரவாக நீக்கப்பட்டது, அது எதிர்காலத்தில் அகற்றப்படும். உங்கள் சுற்று வட்டாரத்தில் `` u0`` கேட்-ஐப் பயன்படுத்துகிறீர்கள் என்றால், `` Iden`` ஐப் பயன்படுத்த உங்கள் அழைப்புகளைப் புதுப்பிக்க வேண்டும். எடுத்துக்காட்டாக, உங்கள் சர்க்யூட்டில் ``circuit.u0(2) `` ஐப் பயன்படுத்துகிறீர்கள்::

source: instead.
ta_in: பதிலாக.

source: The ``qiskit.pulse.DeviceSpecification`` class is deprecated now. Instead you should use ``qiskit.pulse.PulseChannelSpec``.
ta_in: ``Qiskit.pulse.DeviceSpecification`` வகுப்பு இப்போது நீக்கப்பட்டது. அதற்கு பதிலாக நீங்கள் ``qiskit.pulse.PulseChannelSpec`` ஐப் பயன்படுத்த வேண்டும்.

source: Accessing a ``qiskit.circuit.Qubit``, ``qiskit.circuit.Clbit``, or ``qiskit.circuit.Bit`` class by index is deprecated (for compatibility with the ``(register, index)`` tuples that these classes replaced). Instead you should use the ``register`` and ``index`` attributes.
ta_in: `` Qiskit.circuit.Qubit``, `` qiskit.circuit.Clbit``, அல்லது `` qiskit.circuit.Bit`` வகுப்பை குறியீட்டால் அணுகுவது நீக்கப்பட்டது (`` (register, index) உடன் பொருந்தக்கூடியது ` `இந்த வகுப்புகள் மாற்றப்பட்ட டூப்பிள்ஸ்). அதற்கு பதிலாக நீங்கள் `` register`` மற்றும் ``index`` பண்புகளைப் பயன்படுத்த வேண்டும்.

source: Passing in a bit to the ``qiskit.QuantumCircuit`` method ``append`` as a tuple ``(register, index)`` is deprecated. Instead bit objects should be used directly.
ta_in: `` Qiskit.QuantumCircuit`` முறைக்கு ``append`` ஒரு டூப்பிள் `` (register, index) `` க்குச் செல்லுதல் நீக்கப்பட்டது. அதற்கு பதிலாக பிட் பொருள்களை நேரடியாக பயன்படுத்த வேண்டும்.

source: Accessing the elements of a ``qiskit.transpiler.Layout`` object with a tuple ``(register, index)`` is deprecated. Instead a bit object should be used directly.
ta_in: `` Qiskit.transpiler.Layout`` பொருளின் கூறுகளை ஒரு டூப்பிள் ``(register, index)`` உடன் அணுகுவது நீக்கப்பட்டது. அதற்கு பதிலாக ஒரு பிட் பொருள் நேரடியாக பயன்படுத்தப்பட வேண்டும்.

source: The ``qiskit.transpiler.Layout`` constructor method ``qiskit.transpiler.Layout.from_tuplelist()`` is deprecated. Instead the constructor ``qiskit.transpiler.Layout.from_qubit_list()`` should be used.
ta_in: `` Qiskit.transpiler.Layout`` கட்டமைப்பாளர் முறை `` qiskit.transpiler.Layout.from_tuplelist () `` நீக்கப்பட்டது. அதற்கு பதிலாக கட்டமைப்பாளர் `` qiskit.transpiler.Layout.from_qubit_list () `` ஐப் பயன்படுத்த வேண்டும்.

source: The module ``qiskit.pulse.ops`` has been deprecated. All the functions it provided:
ta_in: `` Qiskit.pulse.ops`` தொகுதி நீக்கப்பட்டது. இது வழங்கிய அனைத்து செயல்பாடுகளும்:

source: have equivalent methods available directly on the ``qiskit.pulse.Schedule`` and ``qiskit.pulse.Instruction`` classes. Those methods should be used instead.
ta_in: ``qiskit.pulse.Schedule`` மற்றும் ``qiskit.pulse.Instruction`` வகுப்புகளில் நேரடியாக சமமான முறைகள் உள்ளன. அதற்கு பதிலாக அந்த முறைகள் பயன்படுத்தப்பட வேண்டும்.

source: The ``qiskit.qasm.Qasm`` method ``get_tokens()`` is deprecated. Instead you should use the ``generate_tokens()`` method.
ta_in: ``Qiskit.qasm.Qasm`` முறை ``get_tokens ()`` நீக்கப்பட்டது. அதற்கு பதிலாக நீங்கள் ``generate_tokens ()`` முறையைப் பயன்படுத்த வேண்டும்.
