Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: :func:`~qiskit.converters.dag_to_dagdependency` to convert from a :class:`~qiskit.dagcircuit.DAGCircuit` object to a :class:`~qiskit.dagcircuit.DAGDependency` object.
ta_in: : func: `~ qiskit.converters.dag_to_dagdependency` ஒரு: வகுப்பிலிருந்து மாற்ற:` ~ qiskit.dagcircuit.DAGCircuit` பொருள் ஒரு: வகுப்பிற்கு: `~ qiskit.dagcircuit.DAGDependency` பொருள்.

source: :func:`~qiskit.converters.dagdependency_to_dag` to convert from a :class:`~qiskit.dagcircuit.DAGDependency` object to a :class:`~qiskit.dagcircuit.DAGCircuit` object.
ta_in: : func: `~ qiskit.converters.dagdependency_to_circuit` இலிருந்து ஒரு: வகுப்பிலிருந்து மாற்ற:` ~ qiskit.dagcircuit.DAGDependency` பொருள் ஒரு: வகுப்பிற்கு: `q qiskit.circuit.QuantumCircuit` பொருள.

source: Two new transpiler passes have been added to :mod:`qiskit.transpiler.passes` The first, :class:`~qiskit.transpiler.passes.UnrollCustomDefinitions`, unrolls all instructions in the circuit according to their :attr:`~qiskit.circuit.Instruction.definition` property, stopping when reaching either the specified ``basis_gates`` or a set of gates in the provided :class:`~qiskit.circuit.EquivalenceLibrary`. The second, :class:`~qiskit.transpiler.passes.BasisTranslator`, uses the set of translations in the provided :class:`~qiskit.circuit.EquivalenceLibrary` to re-write circuit instructions in a specified basis.
ta_in: இரண்டு புதிய டிரான்ஸ்பைலர் பாஸ்கள் இதில் சேர்க்கப்பட்டுள்ளன: mod: `qiskit.transpiler.passes` முதல் ,: வகுப்பு:` ~ qiskit.transpiler.passes.UnrollCustomDefinitions`, அவற்றின் படி அனைத்து வழிமுறைகளையும் அவிழ்த்து விடுகிறது: attr: `q qiskit .circuit.Instruction.definition` சொத்து, குறிப்பிட்ட `` அடிப்படை_கட்டுகள்`` அல்லது வழங்கப்பட்ட வாயில்களின் தொகுப்பை அடையும் போது நிறுத்தப்படும்: வகுப்பு: `~ qiskit.circuit.EquivlanceLibrary`. இரண்டாவது ,: வகுப்பு: `~ qiskit.transpiler.passes.BasisTranslator`, வழங்கப்பட்ட மொழிபெயர்ப்புகளின் தொகுப்பைப் பயன்படுத்துகிறது: வகுப்பு:` ~ qiskit.circuit.EquivalentLibrary` ஒரு குறிப்பிட்ட அடிப்படையில் சுற்று வழிமுறைகளை மீண்டும் எழுத.

source: A new ``translation_method`` keyword argument has been added to :func:`~qiskit.compiler.transpile` to allow selection of the method to be used for translating circuits to the available device gates. For example, ``transpile(circ, backend, translation_method='translator')``. Valid choices are:
ta_in: கிடைக்கக்கூடிய சாதன வாயில்களுக்கு சுற்றுகளை மொழிபெயர்க்க பயன்படும் முறையைத் தேர்ந்தெடுப்பதை அனுமதிக்க ஒரு புதிய `` மொழிபெயர்ப்பு_மாதல்`` முக்கிய சொல் சேர்க்கப்பட்டுள்ளது: func: `~ qiskit.compiler.transpile`. எடுத்துக்காட்டாக, `` டிரான்ஸ்பைல் (சுற்றறிக்கை, பின்தளத்தில், மொழிபெயர்ப்பு_மெதட் = 'மொழிபெயர்ப்பாளர்') ``. செல்லுபடியாகும் தேர்வுகள்:

source: ``'unroller'``: to use the :class:`~qiskit.transpiler.passes.Unroller` pass
ta_in: `` 'unroller'``: வகுப்பைப் பயன்படுத்த: `~ qiskit.transpiler.passes.Unroller`

source: ``'translator'``: to use the :class:`~qiskit.transpiler.passes.BasisTranslator` pass.
ta_in: `` 'மொழிபெயர்ப்பாளர்'``: வகுப்பைப் பயன்படுத்த: `~ qiskit.transpiler.passes.BasisTranslator`.

source: ``'synthesis'``: to use the :class:`~qiskit.transpiler.passes.UnitarySynthesis` pass.
ta_in: `` 'தொகுப்பு'``: வகுப்பைப் பயன்படுத்த: `~ qiskit.transpiler.passes.UnitarySynthesis` pass.

source: The default value is ``'translator'``.
ta_in: முன்னிருப்பு மதிப்பு ` மொழிபெயர்ப்பு ` ` `.

source: A new class for handling counts result data, :class:`qiskit.result.Counts`, has been added. This class is a subclass of ``dict`` and can be interacted with like any other dictionary. But, it includes helper methods and attributes for dealing with counts results from experiments and also handles post processing and formatting of binary strings at object initialization. A :class:`~qiskit.result.Counts` object can be created by passing a dictionary of counts with the keys being either integers, hexadecimal strings of the form ``'0x4a'``, binary strings of the form ``'0b1101'``, a bit string formatted across register and memory slots (ie ``'00 10'``), or a dit string. For example::
ta_in: முடிவு முடிவு தரவைக் கையாள்வதற்கான புதிய வகுப்பு ,: வகுப்பு: `qiskit.result.Counts`, சேர்க்கப்பட்டுள்ளது. இந்த வகுப்பு `` டிக்ட்`` இன் துணைப்பிரிவாகும், மேலும் இது வேறு எந்த அகராதியையும் போல தொடர்பு கொள்ளலாம். ஆனால், இது சோதனைகளின் எண்ணிக்கையின் முடிவுகளைக் கையாள்வதற்கான உதவி முறைகள் மற்றும் பண்புகளை உள்ளடக்கியது மற்றும் பொருள் துவக்கத்தில் பைனரி சரங்களின் பிந்தைய செயலாக்கம் மற்றும் வடிவமைப்பையும் கையாளுகிறது. A: class: `~ qiskit.result.Counts` பொருளை விசைகள் முழு எண்ணாகக் கொண்டு,` `0x4a'` வடிவத்தின் அறுகோண சரங்களை,` `'வடிவத்தின் பைனரி சரங்களைக் கொண்டு எண்ணிக்கையின் அகராதியைக் கடந்து செல்வதன் மூலம் உருவாக்க முடியும். 0b1101'``, பதிவு மற்றும் நினைவக இடங்கள் (அதாவது `` '00 10'``) அல்லது ஒரு டிட் சரம் முழுவதும் வடிவமைக்கப்பட்ட ஒரு பிட் சரம். உதாரணத்திற்கு::

source: A new method for constructing :class:`qiskit.dagcircuit.DAGCircuit` objects has been added, :meth:`~qiskit.dagcircuit.DAGCircuit.from_networkx`. This method takes in a networkx ``MultiDiGraph`` object (in the format returned by :meth:`~qiskit.dagcircuit.DAGCircuit.to_networkx`) and will return a new :class:`~qiskit.dagcircuit.DAGCircuit` object. The intent behind this function is to enable transpiler pass authors to leverage networkx's `graph algorithm library <https://networkx.github.io/documentation/stable/reference/algorithms/index.html>`__ if a function is missing from the `retworkx API <https://retworkx.readthedocs.io/en/latest/api.html>`_. Although, hopefully in such casses an issue will be opened with `retworkx issue tracker <https://github.com/Qiskit/retworkx/issues>`__ (or even better a pull request submitted).
ta_in: :class:` qiskit.dagcircuit.DAGCircuit ` பொருட்களை சேர்க்கும், :meth:` ~ qiskit.dagcircuit.DAGCircuit.from_networkx `. This method takes in a networkx ` ` MultiDiGraph ` ` object (in the format of :meth:` ~ qiskit.dagcircuit.dAGCircuit.to_networkx `) and will return a new :class:` ~ qiskit.dagcircuit.DAGCircuit ` object. இந்த செயல்கூறு பின்னால் இந்த செயல்கூறு இயங்கும் ஆசிரியர்கள் வலைப்பதிவொன்றின் ` ग्राफ படிமம் நூலகம் <https://networkx.github.io/documentation/stable/reference/algorithms/index.html>` _ என்றால், ` retworkx API <https://retworkx.readthedocs.io/en/latest/api.html>` _. என்றாலும், அதாவது, இப்படி ஒரு பிரச்சனை ` retworkx issue tracker <https://github.com/Qiskit/retworkx/issues>` __ (or even the better a pull request बुझाएको).

source: A new kwarg for ``init_qubits`` has been added to :func:`~qiskit.compiler.assemble` and :func:`~qiskit.execute.execute`. For backends that support this feature ``init_qubits`` can be used to control whether the backend executing the circuits inserts any initialization sequences at the start of each shot. By default this is set to ``True`` meaning that all qubits can assumed to be in the ground state at the start of each shot. However, when ``init_qubits`` is set to ``False`` qubits will be uninitialized at the start of each experiment and between shots. Note, that the backend running the circuits has to support this feature for this flag to have any effect.
ta_in: `` Init_qubits`` க்கான புதிய குவார்க் இதில் சேர்க்கப்பட்டுள்ளது: func: `~ qiskit.compiler.assemble` மற்றும்: func:` ~ qiskit.execute.execute`. இந்த அம்சத்தை ஆதரிக்கும் பின்தளத்தில், `` init_qubits`` சுற்றுகளை இயக்கும் பின்தளத்தில் ஒவ்வொரு ஷாட்டின் தொடக்கத்திலும் ஏதேனும் துவக்க வரிசைகளை செருகுமா என்பதைக் கட்டுப்படுத்த பயன்படுத்தலாம். முன்னிருப்பாக இது `` உண்மை`` என அமைக்கப்பட்டுள்ளது, அதாவது ஒவ்வொரு ஷாட்டின் தொடக்கத்திலும் அனைத்து குவிட்களும் தரை நிலையில் இருப்பதாக கருதலாம். இருப்பினும், `` init_qubits`` `` தவறு`` என அமைக்கப்பட்டால், ஒவ்வொரு பரிசோதனையின் தொடக்கத்திலும் காட்சிகளுக்கிடையில் துவக்கங்கள் தொடங்கப்படாது. குறிப்பு, சுற்றுகளை இயக்கும் பின்தளத்தில் இந்த கொடி எந்த விளைவையும் ஏற்படுத்த இந்த அம்சத்தை ஆதரிக்க வேண்டும்.

source: A new kwarg ``rep_delay`` has been added to :func:`qiskit.compiler.assemble`, :func:`qiskit.execute.execute`, and the constructor for :class:`~qiskit.qobj.PulseQobjtConfig`.qiskit This new kwarg is used to denotes the time between program executions. It must be chosen from the list of valid values set as the ``rep_delays`` from a backend's :class:`~qiskit.providers.models.PulseBackendConfiguration` object which can be accessed as ``backend.configuration().rep_delays``).
ta_in: ஒரு புதிய குவார்க் `` rep_delay`` இல் சேர்க்கப்பட்டுள்ளது: func: `qiskit.compiler.assemble` ,: func:` qiskit.execute.execute`, மற்றும் கட்டமைப்பாளர்: class: `~ qiskit.qobj.PulseQobjtConfig`. qiskit நிரல் செயலாக்கங்களுக்கு இடையிலான நேரத்தைக் குறிக்க இந்த புதிய குவார்க் பயன்படுத்தப்படுகிறது. இது ஒரு பின்தளத்தில் இருந்து `` rep_delays`` என அமைக்கப்பட்ட செல்லுபடியாகும் மதிப்புகளின் பட்டியலிலிருந்து தேர்ந்தெடுக்கப்பட வேண்டும்: வகுப்பு: `~ qiskit.providers.models.PulseBackendConfiguration` பொருள்` `backend.configuration (). Rep_delays` என அணுகலாம். `).

source: The ``rep_delay`` kwarg will only work on backends which allow for dynamic repetition time. This will also be indicated in the :class:`~qiskit.providers.models.PulseBackendConfiguration` object for a backend as the ``dynamic_reprate_enabled`` attribute. If ``dynamic_reprate_enabled`` is ``False`` then the ``rep_time`` value specified for :func:`qiskit.compiler.assemble`, :func:`qiskit.execute.execute`, or the constructor for :class:`~qiskit.qobj.PulseQobjtConfig` will be used rather than ``rep_delay``. ``rep_time`` only allows users to specify the duration of a program, rather than the delay between programs.
ta_in: `` Rep_delay`` kwarg பின்தளத்தில் மட்டுமே செயல்படும், இது மாறும் மறுபடியும் நேரத்தை அனுமதிக்கும். இது: வர்க்கத்திலும் குறிக்கப்படும்: `~ qiskit.providers.models.PulseBackendConfiguration` ஒரு பின்தளத்தில்` `டைனமிக்_ரெபிரேட்_எனபிள்`` பண்புக்கூறு. `` டைனமிக்_ரெபரேட்_எனபிள்`` என்பது `` தவறு`` எனில், `` rep_time`` மதிப்பு: func: `qiskit.compiler.assemble` ,: func:` qiskit.execute.execute`, அல்லது கட்டமைப்பாளருக்கான: : `` q_kit.qobj.PulseQobjtConfig` என்பது `` rep_delay`` ஐ விடப் பயன்படுத்தப்படும். `` rep_time`` நிரல்களுக்கு இடையிலான தாமதத்தை விட, ஒரு நிரலின் காலத்தைக் குறிப்பிட பயனர்களை மட்டுமே அனுமதிக்கிறது.

source: The ``qobj_schema.json`` JSON Schema file in :mod:`qiskit.schemas` has been updated to include the ``rep_delay`` as an optional configuration property for pulse qobjs.
ta_in: `` qobj_schema.json`` இன் JSON ஸ்கீமா கோப்பு: mod: `qiskit.schemas` QASM Qobj களுக்கான விருப்ப உள்ளமைவு சொத்தாக` `rep_delay`` ஐ சேர்க்க புதுப்பிக்கப்பட்டுள்ளது.

source: The ``backend_configuration_schema.json`` JSON Schema file in mod:`qiskit.schemas` has been updated to include ``rep_delay_range`` and ``default_rep_delay`` as optional properties for a pulse backend configuration.
ta_in: `` பின்தளத்தில்_அமைவு_ஸ்கீமா.ஜ்சன்`` இந்த ஜ்சன் திட்ட கோப்பு: mod: `qiskit.schemas` ஒரு QASM பின்தளத்தில் உள்ளமைவுக்கான விருப்ப பண்புகளாக` `டைனமிக்_ரெபரேட்_எனபிள்``,` `ரெப்_டேலே_ரேஞ்ச்`` மற்றும்` `இயல்புநிலை_ரெப்_டேலே`` ஆகியவற்றைச் சேர்க்க புதுப்பிக்கப்பட்டுள்ளது. பேலோட்.

source: A new attribute, :attr:`~qiskit.circuit.QuantumCircuit.global_phase`, which is is used for tracking the global phase has been added to the :class:`qiskit.circuit.QuantumCircuit` class. For example::
ta_in: ஒரு புதிய பண்புக்கூறு ,: attr: `~ qiskit.circuit.QuantumCircuit.global_phase`, இது உலகளாவிய கட்டத்தைக் கண்காணிக்கப் பயன்படுகிறது: வர்க்கம்:` qiskit.circuit.QuantumCircuit` வகுப்பில் சேர்க்கப்பட்டுள்ளது. உதாரணத்திற்கு::

source: The global phase may also be changed or queried with ``circ.global_phase`` in the above example. In either case the setting is in radians. If the circuit is converted to an instruction or gate the global phase is represented by two single qubit rotations on the first qubit.
ta_in: மேலேயுள்ள எடுத்துக்காட்டில் உலகளாவிய கட்டம் `` சர்க்கி. குளோபல்_ஃபாஸ்`` உடன் மாற்றப்படலாம் அல்லது வினவப்படலாம். இரண்டிலும் இந்த அமைப்பு ரேடியன்களில் உள்ளது. சுற்று ஒரு அறிவுறுத்தலாக அல்லது வாயிலாக மாற்றப்பட்டால், உலகளாவிய கட்டம் முதல் குவிட்டில் இரண்டு ஒற்றை குவிட் சுழற்சிகளால் குறிக்கப்படுகிறது.

source: This allows for other methods and functions which consume a :class:`~qiskit.circuit.QuantumCircuit` object to take global phase into account. For example. with the :attr:`~qiskit.circuit.QuantumCircuit.global_phase` attribute the :meth:`~qiskit.circuit.Gate.to_matrix` method for a gate can now exactly correspond to its decompositions instead of just up to a global phase.
ta_in: இது ஒரு: வர்க்கத்தை உட்கொள்ளும் பிற முறைகள் மற்றும் செயல்பாடுகளை அனுமதிக்கிறது: `~ qiskit.circuit.QuantumCircuit` பொருள் உலகளாவிய கட்டத்தை கணக்கில் எடுத்துக்கொள்ள. உதாரணத்திற்கு. உடன்: attr: `~ qiskit.circuit.QuantumCircuit.global_phase` பண்புக்கூறு: மெத்:` ~ qiskit.circuit.Gate.to_matrix` ஒரு வாயிலுக்கான முறை இப்போது ஒரு உலகளாவிய கட்டத்திற்கு பதிலாக அதன் சிதைவுகளுக்கு சரியாக ஒத்திருக்கும்.

source: The same attribute has also been added to the :class:`~qiskit.dagcircuit.DAGCircuit` class so that global phase can be tracked when converting between :class:`~qiskit.circuit.QuantumCircuit` and :class:`~qiskit.dagcircuit.DAGCircuit`.
ta_in: இதே பண்புக்கூறு: வகுப்பு: `~ qiskit.dagcircuit.DAGCircuit` வகுப்பிலும் சேர்க்கப்பட்டுள்ளது, இதனால் இடையில் மாற்றும் போது உலகளாவிய கட்டத்தைக் கண்காணிக்க முடியும்: வகுப்பு:` ~ qiskit.circuit.QuantumCircuit` மற்றும்: வகுப்பு: `~ qiskit. dagcircuit.DAGCircuit`.

source: Two new classes, :class:`~qiskit.circuit.AncillaRegister` and :class:`~qiskit.circuit.AncillaQubit` have been added to the :mod:`qiskit.circuit` module. These are subclasses of :class:`~qiskit.circuit.QuantumRegister` and :class:`~qiskit.circuit.Qubit` respectively and enable marking qubits being ancillas. This will allow these qubits to be re-used in larger circuits and algorithms.
ta_in: இரண்டு புதிய வகுப்புகள் ,: வகுப்பு: `~ qiskit.circuit.AncillaRegister` மற்றும்: class:` ~ qiskit.circuit.AncillaQubit`: mod: `qiskit.circuit` தொகுதிக்கு சேர்க்கப்பட்டுள்ளன. இவை: வர்க்கம்: `~ qiskit.circuit.QuantumRegister` மற்றும்: class:` ~ qiskit.circuit.Qubit` இன் துணைப்பிரிவுகள் மற்றும் முறையே குறிக்கும் வினாடிகளை துணைபுரியும். இந்த குவிட்களை பெரிய சுற்றுகள் மற்றும் வழிமுறைகளில் மீண்டும் பயன்படுத்த இது அனுமதிக்கும்.

source: A new method, :meth:`~qiskit.circuit.QuantumCircuit.control`, has been added to the :class:`~qiskit.circuit.QuantumCircuit`. This method will return a controlled version of the :class:`~qiskit.circuit.QuantumCircuit` object, with both open and closed controls. This functionality had previously only been accessible via the :class:`~qiskit.circuit.Gate` class.
ta_in: ஒரு புதிய முறை ,: மெத்: `~ qiskit.circuit.QuantumCircuit.control`, வகுப்பில் சேர்க்கப்பட்டுள்ளது:` ~ qiskit.circuit.QuantumCircuit`. இந்த முறை: வர்க்கத்தின் கட்டுப்படுத்தப்பட்ட பதிப்பை வழங்கும்: `~ qiskit.circuit.QuantumCircuit` பொருள், திறந்த மற்றும் மூடிய கட்டுப்பாடுகளுடன். இந்த செயல்பாடு முன்பு: class: `~ qiskit.circuit.Gate` class வழியாக மட்டுமே அணுக முடியும்.

source: A new method :meth:`~qiskit.circuit.QuantumCircuit.repeat` has been added to the :class:`~qiskit.circuit.QuantumCircuit` class. It returns a new circuit object containing a specified number of repetitions of the original circuit. For example:
ta_in: ஒரு புதிய முறை: மெத்: `~ qiskit.circuit.QuantumCircuit.repeat`: வர்க்கத்தில் சேர்க்கப்பட்டுள்ளது:` ~ qiskit.circuit.QuantumCircuit` வகுப்பில். இது அசல் சுற்றுக்கான குறிப்பிட்ட எண்ணிக்கையிலான மறுபடியும் மறுபடியும் ஒரு புதிய சுற்று பொருளை வழங்குகிறது. உதாரணத்திற்கு:

source: The parameters are copied by reference, meaning that if you update the parameters in one instance of the circuit all repetitions will be updated.
ta_in: ப்ளட்போர்ம் குறிப்பு மூலம் நகலெடுக்கப்படுகின்றன, அதாவது நீங்கள் சுற்றுக்கான ஒரு நிகழ்வில் ப்ளட்போர்ம் புதுப்பித்தால் அனைத்தும் மறுபடியும் மறுபடியும் புதுப்பிக்கப்படும்.

source: A new method :meth:`~qiskit.circuit.QuantumCircuit.reverse_bits` has been added to the :class:`~qiskit.circuit.QuantumCircuit` class. This method will reverse the order of bits in a circuit (both quantum and classical bits). This can be used to switch a circuit from little-endian to big-endian and vice-versa.
ta_in: ஒரு புதிய முறை: மெத்: `~ qiskit.circuit.QuantumCircuit.reverse_bits`: வகுப்பில் சேர்க்கப்பட்டுள்ளது:` ~ qiskit.circuit.QuantumCircuit` வகுப்பில். இந்த முறை ஒரு சுற்றில் (குவாண்டம் மற்றும் கிளாசிக்கல் பிட்கள் இரண்டும்) பிட்களின் வரிசையை மாற்றியமைக்கும். லிட்டில்-எண்டியனில் இருந்து பிக்-எண்டியன் மற்றும் நேர்மாறாக ஒரு சுற்றுவட்டத்தை மாற்ற இதைப் பயன்படுத்தலாம்.

source: A new method, :meth:`~qiskit.transpiler.Layout.combine_into_edge_map()`, was added to the :class:`qiskit.transpiler.Layout` class. This method enables converting converting two :class:`~qiskit.transpiler.Layout` objects into a qubit map for composing two circuits.
ta_in: ஒரு புதிய முறை ,: மெத்: `~ qiskit.transpiler.Layout.combine_into_edge_map ()`, வகுப்பில் சேர்க்கப்பட்டுள்ளது: `qiskit.transpiler.Layout` வகுப்பில். இந்த முறை இரண்டாக மாற்றுவதை செயல்படுத்துகிறது: வர்க்கம்: `~ qiskit.transpiler.Layout` பொருள்கள் இரண்டு சுற்றுகளை உருவாக்குவதற்கான ஒரு குவிட் வரைபடமாக மாற்றுகின்றன.

source: A new class, :class:`~qiskit.test.mock.utils.ConfigurableFakeBackend`, has been added to the :mod:`qiskit.test.mock.utils` module. This new class enables the creation of configurable mock backends for use in testing. For example::
ta_in: ஒரு புதிய வகுப்பு ,: வகுப்பு: `~ qiskit.test.mock.utils.ConfigurableFakeBackend`,: mod:` qiskit.test.mock.utils` தொகுதிக்கு சேர்க்கப்பட்டுள்ளது. இந்த புதிய வகுப்பு சோதனையில் பயன்படுத்த கட்டமைக்கக்கூடிய போலி பின்தளத்தில் உருவாக்க உதவுகிறது. உதாரணத்திற்கு::

source: will create a backend object with 100 qubits and all the other parameters specified in the constructor.
ta_in: 100 குபிட்கள் மற்றும் கட்டமைப்பாளரில் குறிப்பிடப்பட்டுள்ள மற்ற அனைத்து அளவுருக்களுடன் ஒரு பின்தளத்தில் பொருளை உருவாக்கும்.

source: A new method :meth:`~qiskit.circuit.EquivalenceLibrary.draw` has been added to the :class:`qiskit.circuit.EquivalenceLibrary` class. This method can be used for drawing the contents of an equivalence library, which can be useful for debugging. For example:
ta_in: ஒரு புதிய முறை: மெத்: `~ qiskit.circuit.EquivlanceLibrary.draw`: class:` qiskit.circuit.EquivlanceLibrary` வகுப்பில் சேர்க்கப்பட்டுள்ளது. சமநிலை நூலகத்தின் உள்ளடக்கங்களை வரைவதற்கு இந்த முறை பயன்படுத்தப்படலாம், இது பிழைத்திருத்தத்திற்கு பயனுள்ளதாக இருக்கும். உதாரணத்திற்கு:

source: A new Phase instruction, :class:`~qiskit.pulse.SetPhase`, has been added to :mod:`qiskit.pulse`. This instruction sets the phase of the subsequent pulses to the specified phase (in radians. For example::
ta_in: ஒரு புதிய கட்ட அறிவுறுத்தல் ,: வகுப்பு: `~ qiskit.pulse.SetPhase`, இதில் சேர்க்கப்பட்டுள்ளது: mod:` qiskit.pulse`. இந்த அறிவுறுத்தல் அடுத்தடுத்த சூழ்நிலையமைப்பு கட்டத்தை குறிப்பிட்ட கட்டத்திற்கு அமைக்கிறது (ரேடியன்களில். எடுத்துக்காட்டாக ::

source: In this example, the phase of the pulses applied to ``DriveChannel(0)`` after the :class:`~qiskit.pulse.SetPhase` instruction will be set to :math:`\pi` radians.
ta_in: இந்த எடுத்துக்காட்டில், பருப்புகளின் கட்டம் `` டிரைவ் சேனல் (0) `` க்குப் பின்: வகுப்பு: `~ qiskit.pulse.SetPhase` அறிவுறுத்தல் இதற்கு அமைக்கப்படும்: கணிதம்:` \ பை` ரேடியன்கள்.

source: A new pulse instruction :class:`~qiskit.pulse.ShiftFrequency` has been added to :mod:`qiskit.pulse.instructions`. This instruction enables shifting the frequency of a channel from its set frequency. For example::
ta_in: ஒரு புதிய துடிப்பு வழிமுறை: வகுப்பு: `~ qiskit.pulse.ShiftFrequency` இங்கு சேர்க்கப்பட்டுள்ளது: mod:` qiskit.pulse.instructions`. இந்த அறிவுறுத்தல் ஒரு சேனலின் அதிர்வெண்ணை அதன் தொகுப்பு அதிர்வெண்ணிலிருந்து மாற்ற உதவுகிறது. உதாரணத்திற்கு::

source: In this example all the pulses applied to ``DriveChannel(0)`` after the :class:`~qiskit.pulse.ShiftFrequency` command will have the envelope a frequency decremented by 340MHz.
ta_in: இந்த எடுத்துக்காட்டில், `` டிரைவ் சேனல் (0) `` க்குப் பிறகு பயன்படுத்தப்படும் அனைத்து பருப்புகளும்: வகுப்பு: `~ qiskit.pulse.ShiftFrequency` கட்டளைக்கு உறை 340 மெகா ஹெர்ட்ஸ் குறைக்கப்பட்ட உறை நிலையில் இருக்கும்.

source: A new method :meth:`~qiskit.circuit.ParameterExpression.conjugate` has been added to the :class:`~qiskit.circuit.ParameterExpression` class. This enables calling ``numpy.conj()`` without raising an error. Since a :class:`~qiskit.circuit.ParameterExpression` object is real, it will return itself. This behaviour is analogous to Python floats/ints.
ta_in: ஒரு புதிய முறை: மெத்: `~ qiskit.circuit.ParameterExpression.conjugate`: வகுப்பில் சேர்க்கப்பட்டுள்ளது:` ~ qiskit.circuit.ParameterExpression` வகுப்பில். இது பிழையை எழுப்பாமல் `` numpy.conj () `` ஐ அழைக்க உதவுகிறது. ஒரு: வகுப்பு: `~ qiskit.circuit.ParameterExpression` பொருள் உண்மையானது என்பதால், அது தானே திரும்பும். இந்த நடத்தை பைதான் மிதவைகள் / இன்ட்டுகளுக்கு ஒத்ததாகும்.

source: A new class :class:`~qiskit.circuit.library.PhaseEstimation` has been added to :mod:`qiskit.circuit.library`. This circuit library class is the circuit used in the original formulation of the phase estimation algorithm in `arXiv:quant-ph/9511026 <https://arxiv.org/pdf/quant-ph/9511026.pdf>`__. Phase estimation is the task to to estimate the phase :math:`\phi` of an eigenvalue :math:`e^{2\pi i\phi}` of a unitary operator :math:`U`, provided with the corresponding eigenstate :math:`|psi\rangle`. That is
ta_in: ஒரு புதிய வகுப்பு: வகுப்பு: `~ qiskit.circuit.library.PhaseEstimation` இங்கு சேர்க்கப்பட்டுள்ளது: mod:` qiskit.circuit.library`. இந்த சுற்று நூலக வகுப்பு என்பது `arXiv: quant-ph / 9511026 <https://arxiv.org/pdf/quant-ph/9511026.pdf>` __ இல் கட்ட மதிப்பீட்டு வழிமுறையின் அசல் வடிவமைப்பில் பயன்படுத்தப்படும் சுற்று ஆகும். கட்ட மதிப்பீடு என்பது கட்டத்தை மதிப்பிடுவதற்கான பணியாகும்: கணிதம்: ஒரு ஐஜென்வெல்யூவின் `\ ஃபை`: கணிதம்: ஒரு ஒற்றையாட்சி ஆபரேட்டரின்` இ {{2 \ பை ஐ \ ஃபை} `: கணிதம்:` யு`, அதனுடன் தொடர்புடையது eigenstate: math: `| psi \ rangle`. டி

source: This estimation (and thereby this circuit) is a central routine to several well-known algorithms, such as Shor's algorithm or Quantum Amplitude Estimation.
ta_in: இந்த மதிப்பீடு (அதன் மூலம் இந்த சர்குய்ட்) ஷோரின் வழிமுறை அல்லது குவாண்டம் அலைவீச்சு மதிப்பீடு போன்ற பல நன்கு அறியப்பட்ட வழிமுறைகளுக்கு ஒரு மைய வழக்கமாகும்.

source: The :mod:`qiskit.visualization` function :func:`~qiskit.visualization.plot_state_qsphere` has a new kwarg ``show_state_labels`` which is used to control whether each blob in the qsphere visualization is labeled. By default this kwarg is set to ``True`` and shows the basis states next to each blob by default. This feature can be disabled, reverting to the previous behavior, by setting the ``show_state_labels`` kwarg to ``False``.
ta_in: தி: மோட்: `qiskit.visualization` செயல்பாடு: func:` ~ qiskit.visualization.plot_state_qsphere` இல் ஒரு புதிய குவார்க் உள்ளது `` show_state_labels``, இது qsphere காட்சிப்படுத்தலில் உள்ள ஒவ்வொரு குமிழியும் பெயரிடப்பட்டுள்ளதா என்பதைக் கட்டுப்படுத்தப் பயன்படுகிறது. முன்னிருப்பாக இந்த குவார்க் `` உண்மை`` என அமைக்கப்பட்டுள்ளது மற்றும் இயல்பாகவே ஒவ்வொரு குமிழிக்கும் அடுத்த அடிப்படை நிலைகளைக் காட்டுகிறது. `` ஷோ_ஸ்டேட்_லேபல்ஸ்`` குவார்க்கை `` தவறு`` என அமைப்பதன் மூலம் முந்தைய அம்சத்திற்கு மாற்றியமைத்து இந்த அம்சத்தை முடக்கலாம்.

source: The :mod:`qiskit.visualization` function :func:`~qiskit.visualization.plot_state_qsphere` has a new kwarg ``show_state_phases`` which is set to ``False`` by default. When set to ``True`` it displays the phase of each basis state.
ta_in: தி: மோட்: `qiskit.visualization` function: func:` ~ qiskit.visualization.plot_state_qsphere` இல் ஒரு புதிய குவார்க் உள்ளது `` show_state_phases`` இது இயல்பாகவே `` தவறு`` என அமைக்கப்பட்டுள்ளது. `` உண்மை`` என அமைக்கப்பட்டால், அது ஒவ்வொரு அடிப்படை நிலையின் கட்டத்தையும் காட்டுகிறது.
