Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: For the transpiler we have switched the graph library used to build the :class:`qiskit.dagcircuit.DAGCircuit` class which is the underlying data structure behind all operations to be based on `retworkx <https://pypi.org/project/retworkx/>`_ for greatly improved performance. Circuit transpilation speed in the 0.13.0 release should be significanlty faster than in previous releases.
ta_in: டிரான்ஸ்பைலரைப் பொறுத்தவரை:class: `qiskit.dagcircuit.DAGCircuit` வகுப்பை உருவாக்க பயன்படும் வரைபட நூலகத்தை நாங்கள் மாற்றியுள்ளோம், இது` retworkx <https://pypi.org/project/retworkx/>`_ பெரிதும் மேம்படுத்தப்பட்ட செயல்திறனுக்காக. 0.13.0 வெளியீட்டில் சுற்று பரிமாற்ற வேகம் முந்தைய வெளியீடுகளை விட வேகமாக இருக்க வேண்டும்.

source: There has been a significant simplification to the style in which Pulse instructions are built. Now, ``Command`` s are deprecated and a unified set of :class:`~qiskit.pulse.instructions.Instruction` s are supported.
ta_in: துடிப்பு அறிவுறுத்தல்கள் கட்டமைக்கப்பட்ட பாணியில் குறிப்பிடத்தக்க எளிமைப்படுத்தல் செய்யப்பட்டுள்ளது. இப்போது, ​​``Command ​`` கள் நீக்கப்பட்டன மற்றும் ஒரு ஒருங்கிணைந்த தொகுப்பு:class: `~ qiskit.pulse.instructions.Instruction` கள் ஆதரிக்கப்படுகின்றன.

source: The :mod:`qiskit.quantum_info` module includes several new functions for generating random operators (such as Cliffords and quantum channels) and for computing the diamond norm of quantum channels; upgrades to the :class:`~qiskit.quantum_info.Statevector` and :class:`~qiskit.quantum_info.DensityMatrix` classes to support computing measurement probabilities and sampling measurements; and several new classes are based on the symplectic representation of Pauli matrices. These new classes include Clifford operators (:class:`~qiskit.quantum_info.Clifford`), N-qubit matrices that are sparse in the Pauli basis (:class:`~qiskit.quantum_info.SparsePauliOp`), lists of Pauli's (:class:`~qiskit.quantum_info.PauliTable`), and lists of stabilizers (:class:`~qiskit.quantum_info.StabilizerTable`).
ta_in: :mod: `qiskit.quantum_info` தொகுதி சீரற்ற ஆபரேட்டர்களை (கிளிஃபோர்ட்ஸ் மற்றும் குவாண்டம் சேனல்கள் போன்றவை) உருவாக்குவதற்கும் குவாண்டம் சேனல்களின் வைர விதிமுறைகளை கணக்கிடுவதற்கும் பல புதிய செயல்பாடுகளை உள்ளடக்கியது; கம்ப்யூட்டிங் அளவீட்டு நிகழ்தகவுகள் மற்றும் மாதிரி அளவீடுகளை ஆதரிக்க :class: `~ qiskit.quantum_info.Statevector` மற்றும்:class:` ~ qiskit.quantum_info.DensityMatrix` வகுப்புகளுக்கு மேம்படுத்தல்கள்; மற்றும் பல புதிய வகுப்புகள் பவுலி மெட்ரிக்ஸின் சிம்பலெக்டிக் பிரதிநிதித்துவத்தை அடிப்படையாகக் கொண்டவை. இந்த புதிய வகுப்புகளில் கிளிஃபோர்ட் ஆபரேட்டர்கள் (:class: `~ qiskit.quantum_info.Clifford`), பவுலி அடிப்படையில் குறைவாக இருக்கும் N-qubit matrices (:class:` ~ qiskit.quantum_info.SparsePauliOp`), பவுலியின் பட்டியல்கள் (:class: `~ qiskit.quantum_info.PauliTable`), மற்றும் நிலைப்படுத்திகளின் பட்டியல்கள் (:class:` ~ qiskit.quantum_info.StabilizerTable`).

source: This release also has vastly improved documentation across Qiskit, including improved documentation for the :mod:`qiskit.circuit`, :mod:`qiskit.pulse` and :mod:`qiskit.quantum_info` modules.
ta_in: இந்த வெளியீட்டில் கிஸ்கிட் முழுவதும் மேம்பட்ட ஆவணங்கள் உள்ளன, இதில்:mod: `qiskit.circuit` ,:mod:` qiskit.pulse` மற்றும்:mod: `qiskit.quantum_info` தொகுதிகளுக்கான மேம்பட்ட ஆவணங்கள் அடங்கும்.

source: Additionally, the naming of gate objects and :class:`~qiskit.circuit.QuantumCircuit` methods have been updated to be more consistent. This has resulted in several classes and methods being deprecated as things move to a more consistent naming scheme.
ta_in: கூடுதலாக, கேட் பொருள்களின் பெயரிடுதல் மற்றும்:class: `~ qiskit.circuit.QuantumCircuit` முறைகள் மிகவும் சீரானதாக புதுப்பிக்கப்பட்டுள்ளன. விஷயங்கள் பல நிலையான பெயரிடும் திட்டத்திற்கு நகரும்போது பல வகுப்புகள் மற்றும் முறைகள் நீக்கப்பட்டன.

source: For full details on all the changes made in this release see the detailed release notes below.
ta_in: இந்த வெளியீட்டில் செய்யப்பட்ட அனைத்து மாற்றங்கள் பற்றிய முழு விவரங்களுக்கு கீழே உள்ள விரிவான வெளியீட்டுக் குறிப்புகளைக் காண்க.

source: Added a new circuit library module :mod:`qiskit.circuit.library`. This will be a place for constructors of commonly used circuits that can be used as building blocks for larger circuits or applications.
ta_in: புதிய சுற்று நூலக தொகுதி சேர்க்கப்பட்டது:mod: `qiskit.circuit.library`. பொதுவாக பயன்படுத்தப்படும் சுற்றுகளின் கட்டமைப்பாளர்களுக்கு இது ஒரு இடமாக இருக்கும், அவை பெரிய சுற்றுகள் அல்லது பயன்பாடுகளுக்கான கட்டுமானத் தொகுதிகளாகப் பயன்படுத்தப்படலாம்.

source: The :class:`qiskit.providers.BaseJob` class has four new methods:
ta_in: :class: `qiskit.providers.BaseJob` வகுப்பில் நான்கு புதிய முறைகள் உள்ளன:

source: These methods are used to check wheter a job is in a given job status.
ta_in: கொடுக்கப்பட்ட வேலை நிலையில் ஒரு வேலை இருக்கிறதா என்பதை சரிபார்க்க இந்த முறைகள் பயன்படுத்தப்படுகின்றன.

source: Add ability to specify control conditioned on a qubit being in the ground state. The state of the control qubits is represented by an integer. For example::
ta_in: தரையில் இருக்கும் ஒரு குவிட்டில் கட்டுப்படுத்தப்பட்ட கட்டுப்பாட்டைக் குறிப்பிடும் திறனைச் சேர்க்கவும். கட்டுப்பாட்டு வினாடிகளின் நிலை ஒரு முழு எண்ணால் குறிக்கப்படுகிறது. உதாரணத்திற்கு::

source: Creates a four qubit gate where the fourth qubit gets flipped if the first qubit is in the ground state and the second and third qubits are in the excited state. If ``ctrl_state`` is ``None``, the default, control is conditioned on all control qubits being excited.
ta_in: நான்கு குவிட் கேட்டை உருவாக்குகிறது, அங்கு முதல் குவிட் தரை நிலையில் இருந்தால், இரண்டாவது மற்றும் மூன்றாவது குவிட்கள் உற்சாகமான நிலையில் இருந்தால் நான்காவது குவிட் புரட்டப்படும். `` Ctrl_state`` என்பது `` None`` என்றால், இயல்புநிலை, கட்டுப்பாடு உற்சாகமாக இருக்கும் அனைத்து கட்டுப்பாட்டு வினாடிகளிலும் நிபந்தனை விதிக்கப்படுகிறது.

source: A new jupyter widget, ``%circuit_library_info`` has been added to :mod:`qiskit.tools.jupyter`. This widget is used for visualizing details about circuits built from the circuit library. For example
ta_in: ``%circuit_library_info`` என்ற புதிய ஜூபிட்டர் விட்ஜெட் இதில் சேர்க்கப்பட்டுள்ளது:mod: `qiskit.tools.jupyter`. சுற்று நூலகத்திலிருந்து கட்டப்பட்ட சுற்றுகள் பற்றிய விவரங்களைக் காட்சிப்படுத்த இந்த விட்ஜெட் பயன்படுத்தப்படுகிறது. உதாரணத்திற்கு

source: A new kwarg option, ``formatted`` , has been added to :meth:`qiskit.circuit.QuantumCircuit.qasm` . When set to ``True`` the method will print a syntax highlighted version (using pygments) to stdout and return ``None`` (which differs from the normal behavior of returning the QASM code as a string).
ta_in: ஒரு புதிய குவார்க் விருப்பம், ``formatted``, இதில் சேர்க்கப்பட்டுள்ளது:meth: `qiskit.circuit.QuantumCircuit.qasm`. ``True`` என அமைக்கப்பட்டால், இந்த முறை ஒரு தொடரியல் சிறப்பம்சமாக பதிப்பை (நிறமிகளைப் பயன்படுத்தி) அச்சிட்டு, ``None`` (QASM குறியீட்டை ஒரு சரமாகத் திருப்புவதற்கான சாதாரண நடத்தையிலிருந்து வேறுபடுகிறது).

source: A new kwarg option, ``filename`` , has been added to :meth:`qiskit.circuit.QuantumCircuit.qasm`. When set to a path the method will write the QASM code to that file. It will then continue to output as normal.
ta_in: ஒரு புதிய குவார்க் விருப்பம், ``filename``, இதில் சேர்க்கப்பட்டுள்ளது:meth: `qiskit.circuit.QuantumCircuit.qasm`. ஒரு பாதைக்கு அமைக்கப்பட்டால், அந்த கோப்பில் QASM குறியீட்டை முறை எழுதும். பின்னர் அது இயல்பான வெளியீட்டைத் தொடரும்.

source: A new instruction :py:class:`~qiskit.pulse.SetFrequency` which allows users to change the frequency of the :class:`~qiskit.pulse.PulseChannel`. This is done in the following way::
ta_in: ஒரு புதிய அறிவுறுத்தல் :py:class: `~ qiskit.pulse.SetFrequency` இது பயனர்களின்: வகுப்பின் அதிர்வெண்ணை மாற்ற அனுமதிக்கிறது:`~ qiskit.pulse.PulseChannel`. இது பின்வரும் வழியில் செய்யப்படுகிறது ::

source: In this example, the frequency of all pulses before the ``SetFrequency`` command will be the default frequency and all pulses applied to drive channel zero after the ``SetFrequency`` command will be at 5.5 GHz. Users of ``SetFrequency`` should keep in mind any hardware limitations.
ta_in: N இந்த எடுத்துக்காட்டுக்கு, `` SetFrequency`` கட்டளைக்கு முந்தைய அனைத்து பருப்புகளின் அதிர்வெண் இயல்புநிலை அதிர்வெண்ணாக இருக்கும், மேலும் `` SetFrequency`` கட்டளைக்குப் பிறகு சேனல் பூஜ்ஜியத்தை இயக்க பயன்படுத்தப்படும் அனைத்து பருப்புகளும் 5.5 GHz ஆக இருக்கும். `` SetFrequency`` இன் பயனர்கள் எந்தவொரு வன்பொருள் வரம்புகளையும் மனதில் கொள்ள வேண்டும்.

source: A new method, :meth:`~qiskit.circuit.QuantumCircuit.assign_parameters` has been added to the :class:`qiskit.circuit.QuantumCircuit` class. This method accepts a parameter dictionary with both floats and Parameters objects in a single dictionary. In other words this new method allows you to bind floats, Parameters or both in a single dictionary.
ta_in: ஒரு புதிய முறை ,:meth: `~ qiskit.circuit.QuantumCircuit.assign_parameters`: வகுப்பில் சேர்க்கப்பட்டுள்ளது :class:` qiskit.circuit.QuantumCircuit` வகுப்பில். இந்த முறை ஒற்றை அகராதியில் மிதவைகள் மற்றும் அளவுருக்கள் ஆகிய இரண்டையும் கொண்ட அளவுரு அகராதியை ஏற்றுக்கொள்கிறது. வேறு வார்த்தைகளில் கூறுவதானால், இந்த புதிய முறை மிதவைகள், அளவுருக்கள் அல்லது இரண்டையும் ஒரே அகராதியில் பிணைக்க உங்களை அனுமதிக்கிறது.

source: Also, by using the ``inplace`` kwarg it can be specified you can optionally modify the original circuit in place. By default this is set to ``False`` and a copy of the original circuit will be returned from the method.
ta_in: மேலும், ``inplace`` குவார்க்கைப் பயன்படுத்துவதன் மூலம் அதைக் குறிப்பிடலாம், நீங்கள் அசல் சுற்றுவட்டத்தை விருப்பமாக மாற்றலாம். இயல்பாக இது ``False`` என அமைக்கப்பட்டு, அசல் சுற்றுகளின் நகல் முறையிலிருந்து திரும்பப் பெறப்படும்.

source: A new method :meth:`~qiskit.circuit.QuantumCircuit.num_nonlocal_gates` has been added to the :class:`qiskit.circuit.QuantumCircuit` class. This method will return the number of gates in a circuit that involve 2 or or more qubits. These gates are more costly in terms of time and error to implement.
ta_in: ஒரு புதிய முறை:meth: `~ qiskit.circuit.QuantumCircuit.num_nonlocal_gates`: வகுப்பில் சேர்க்கப்பட்டுள்ளது :class:` qiskit.circuit.QuantumCircuit` வகுப்பில். இந்த முறை 2 அல்லது அதற்கு மேற்பட்ட குவிட்களை உள்ளடக்கிய ஒரு சுற்றுவட்டத்தின் வாயில்களின் எண்ணிக்கையை வழங்கும். இந்த வாயில்கள் செயல்படுத்த நேரம் மற்றும் பிழையின் அடிப்படையில் அதிக விலை கொண்டவை.

source: The :class:`qiskit.circuit.QuantumCircuit` method :meth:`~qiskit.circuit.QuantumCircuit.iso` for adding an :class:`~qiskit.extensions.Isometry` gate to the circuit has a new alias. You can now call :meth:`qiskit.circuit.QuantumCircuit.isometry` in addition to calling ``iso``.
ta_in: :class: `qiskit.circuit.QuantumCircuit` முறை :meth:` ~ qiskit.circuit.QuantumCircuit.iso` ஐச் சேர்ப்பதற்கு :class: `~ qiskit.extensions.Isometry` வாயில் சுற்றுக்கு புதிய மாற்றுப்பெயர் உள்ளது. நீங்கள் இப்போது அழைக்கலாம் :meth: `qiskit.circuit.QuantumCircuit.isometry` கூடுதலாக ``iso`` என்று அழைப்பது.

source: A ``description`` attribute has been added to the :class:`~qiskit.transpiler.CouplingMap` class for storing a short description for different coupling maps (e.g. full, grid, line, etc.).
ta_in: வெவ்வேறு இணைப்பு வரைபடங்களுக்கான (எ.கா. முழு, கட்டம், வரி, முதலியன) ஒரு குறுகிய விளக்கத்தை சேமிப்பதற்கான ``description`` பண்புக்கூறு :class: சேர்க்கப்பட்டுள்ளது : `~ qiskit.transpiler.CouplingMap` வகுப்பு.

source: A new method :meth:`~qiskit.dagcircuit.DAGCircuit.compose` has been added to the :class:`~qiskit.dagcircuit.DAGCircuit` class for composing two circuits via their DAGs.
ta_in: ஒரு புதிய முறை :meth: `~ qiskit.dagcircuit.DAGCircuit.compose` வகுப்பில் சேர்க்கப்பட்டுள்ளது :class:` ~ qiskit.dagcircuit.DAGCircuit` வகுப்பில் அவற்றின் DAG கள் வழியாக இரண்டு சுற்றுகளை இயற்றுவதற்காக.

source: The mock backends in ``qiskit.test.mock`` now have a functional ``run()`` method that will return results similar to the real devices. If ``qiskit-aer`` is installed a simulation will be run with a noise model built from the device snapshot in the fake backend. Otherwise, :class:`qiskit.providers.basicaer.QasmSimulatorPy` will be used to run an ideal simulation. Additionally, if a pulse experiment is passed to ``run`` and qiskit-aer is installed the ``PulseSimulator`` will be used to simulate the pulse schedules.
ta_in: `` Qiskit.test.mock`` இல் உள்ள போலி பின்தளத்தில் இப்போது ஒரு செயல்பாட்டு ``run() `` முறை உள்ளது, இது உண்மையான சாதனங்களுக்கு ஒத்த முடிவுகளை வழங்கும். `` qiskit-aer`` நிறுவப்பட்டிருந்தால், போலி பின்தளத்தில் சாதனம் ஸ்னாப்ஷாட்டில் இருந்து கட்டப்பட்ட சத்தம் மாதிரியுடன் ஒரு உருவகப்படுத்துதல் இயக்கப்படும். இல்லையெனில் ,:class: `qiskit.providers.basicaer.QasmSimulatorPy` ஒரு சிறந்த உருவகப்படுத்துதலை இயக்க பயன்படும். கூடுதலாக, ஒரு துடிப்பு சோதனை ``run`` க்கு அனுப்பப்பட்டு, கிஸ்கிட்-ஏர் நிறுவப்பட்டால், துடிப்பு அட்டவணைகளை உருவகப்படுத்த `` PulseSimulator`` பயன்படுத்தப்படும்.

source: The :meth:`qiskit.result.Result` method :meth:`~qiskit.result.Result.get_counts` will now return a list of all the counts available when there are multiple circuits in a job. This works when ``get_counts()`` is called with no arguments.
ta_in: :meth: `qiskit.result.Result` முறை :meth:` ~ qiskit.result.Result.get_counts` இப்போது ஒரு வேலையில் பல சுற்றுகள் இருக்கும்போது கிடைக்கும் எல்லா எண்ணிக்கையின் பட்டியலையும் வழங்கும். `` Get_counts () `` எந்த வாதங்களும் இல்லாமல் அழைக்கப்படும் போது இது செயல்படும்.

source: The main consideration for this feature was for drawing all the results from multiple circuits in the same histogram. For example it is now possible to do something like:
ta_in: இந்த அம்சத்திற்கான முக்கிய கருத்தாகும், ஒரே வரைபடத்தில் பல சுற்றுகளிலிருந்து அனைத்து முடிவுகளையும் வரைவது. எடுத்துக்காட்டாக, இதுபோன்ற ஒன்றை இப்போது செய்ய முடியும்:

source: A new kwarg, ``initial_state`` has been added to the :func:`qiskit.visualization.circuit_drawer` function and the :class:`~qiskit.circuit.QuantumCircuit` method :meth:`~qiskit.circuit.QuantumCircuit.draw`. When set to ``True`` the initial state will be included in circuit visualizations for all backends. For example:
ta_in: ஒரு புதிய குவார்க், `` initial_state``:func: `qiskit.visualization.circuit_drawer` செயல்பாடு மற்றும் :class:` ~ qiskit.circuit.QuantumCircuit` முறை:meth: `~ qiskit.circuit.QuantumCircuit இல் சேர்க்கப்பட்டுள்ளது. வரைய`. ``True`` என அமைக்கப்பட்டால், ஆரம்ப நிலை அனைத்து பின்தளத்தில் சுற்று காட்சிப்படுத்தல்களில் சேர்க்கப்படும். உதாரணத்திற்கு:

source: It is now possible to insert a callable into a :class:`qiskit.pulse.InstructionScheduleMap` which returns a new :class:`qiskit.pulse.Schedule` when it is called with parameters. For example:
ta_in: ஒரு: வகுப்பில் அழைக்கக்கூடியதை இப்போது செருக முடியும்:class: `qiskit.pulse.InstructionScheduleMap` இது ஒரு புதிய: வகுப்பைத் தருகிறது:class:` qiskit.pulse.Schedule` அளவுருக்கள் என அழைக்கப்படும் போது. உதாரணத்திற்கு:

source: Two new gate classes, :class:`qiskit.extensions.iSwapGate` and :class:`qiskit.extensions.DCXGate`, along with their :class:`~qiskit.circuit.QuantumCircuit` methods :meth:`~qiskit.circuit.QuantumCircuit.iswap` and :meth:`~qiskit.circuit.QuantumCircuit.dcx` have been added to the standard extensions. These gates, which are locally equivalent to each other, can be used to enact particular XY interactions. A brief motivation for these gates can be found in: `arxiv.org/abs/quant-ph/0209035 <https://arxiv.org/abs/quant-ph/0209035>`_
ta_in: இரண்டு புதிய கேட் வகுப்புகள் ,: வகுப்பு: `qiskit.extensions.iSwapGate` மற்றும்: வகுப்பு:` qiskit.extensions.DCXGate`, அவற்றுடன்: வகுப்பு: `~ qiskit.circuit.QuantumCircuit` முறைகள்: மெத்:` ~ qiskit.circuit .QuantumCircuit.iswap` மற்றும்: meth: `~ qiskit.circuit.QuantumCircuit.dcx` நிலையான நீட்டிப்புகளில் சேர்க்கப்பட்டுள்ளன. உள்நாட்டில் ஒருவருக்கொருவர் சமமான இந்த வாயில்கள் குறிப்பிட்ட XY இடைவினைகளைச் செயல்படுத்த பயன்படுத்தப்படலாம். இந்த வாயில்களுக்கான சுருக்கமான உந்துதலை இங்கே காணலாம்

source: The :class:`qiskit.providers.BaseJob` class now has a new method :meth:`~qiskit.providers.BaseJob.wait_for_final_state` that polls for the job status until the job reaches a final state (such as ``DONE`` or ``ERROR``). This method also takes an optional ``callback`` kwarg which takes a Python callable that will be called during each iteration of the poll loop.
ta_in: :class: `qiskit.providers.BaseJob` வகுப்பில் இப்போது ஒரு புதிய முறை உள்ளது:meth:` ~ qiskit.providers.BaseJob.night_for_final_state` இது வேலை இறுதி நிலையை அடையும் வரை வேலை நிலைக்கு வாக்களிக்கும் (``DONE`` or ``ERROR``). இந்த முறை விருப்பமான `` callback`` குவார்க்கையும் எடுக்கிறது, இது பைதான் அழைக்கக்கூடியதை எடுக்கும், இது வாக்கெடுப்பு வளையத்தின் ஒவ்வொரு மறு செய்கையின் போதும் அழைக்கப்படும்.

source: The ``search_width`` and ``search_depth`` attributes of the :class:`qiskit.transpiler.passes.LookaheadSwap` pass are now settable when initializing the pass. A larger search space can often lead to more optimized circuits, at the cost of longer run time.
ta_in: வகுப்பின் `` search_width`` மற்றும் `` search_depth`` பண்புக்கூறுகள் :class:`qiskit.transpiler.passes.LookaheadSwap` பாஸ் இப்போது பாஸைத் தொடங்கும்போது தீர்க்கப்படக்கூடியவை. ஒரு பெரிய தேடல் இடம் பெரும்பாலும் அதிக நேரம் இயங்கும் நேரத்தின் செலவில், அதிக உகந்த சுற்றுகளுக்கு வழிவகுக்கும்.

source: The number of qubits in :class:`~qiskit.providers.models.BackendConfiguration` can now be accessed via the property :py:attr:`~qiskit.providers.models.BackendConfiguration.num_qubits`. It was previously only accessible via the ``n_qubits`` attribute.
ta_in: வகுப்பில் உள்ள வினாடிகளின் எண்ணிக்கை: `~ qiskit.providers.models.BackendConfiguration` ஐ இப்போது சொத்து வழியாக அணுகலாம்: py: attr:` ~ qiskit.providers.models.BackendConfiguration.num_qubits`. இது முன்பு `` n_qubits`` பண்புக்கூறு வழியாக மட்டுமே அணுகக்கூடியது.

source: Two new methods, :meth:`~qiskit.quantum_info.OneQubitEulerDecomposer.angles` and :meth:`~qiskit.quantum_info.OneQubitEulerDecomposer.angles_and_phase`, have been added to the :class:`qiskit.quantum_info.OneQubitEulerDecomposer` class. These methods will return the relevant parameters without validation, and calling the ``OneQubitEulerDecomposer`` object will perform the full synthesis with validation.
ta_in: இரண்டு புதிய முறைகள் ,:meth: `~ qiskit.quantum_info.OneQubitEulerDecomposer.angles` மற்றும்:meth:` ~ qiskit.quantum_info.OneQubitEulerDecomposer.angles_and_phase`, இதில் சேர்க்கப்பட்டுள்ளன:class: `qiskit. இந்த முறைகள் சரிபார்ப்பு இல்லாமல் தொடர்புடைய அளவுருக்களைத் தரும், மேலும் `` OneQubitEulerDecomposer`` பொருளை அழைப்பது சரிபார்ப்புடன் முழு தொகுப்பையும் செய்யும்.

source: An ``RR`` decomposition basis has been added to the :class:`qiskit.quantum_info.OneQubitEulerDecomposer` for decomposing an arbitrary 2x2 unitary into a two :class:`~qiskit.extensions.RGate` circuit.
ta_in: ஒரு ``RR`` சிதைவு அடிப்படையானது: வகுப்பில் சேர்க்கப்பட்டுள்ளது :class:`qiskit.quantum_info.OneQubitEulerDecomposer` ஒரு தன்னிச்சையான 2x2 ஒற்றுமையை இரண்டாக சிதைப்பதற்காக :class:` ~ qiskit.extensions.RGate` சுற்று.

source: Adds the ability to set ``qargs`` to objects which are subclasses of the abstract ``BaseOperator`` class. This is done by calling the object ``op(qargs)`` (where ``op`` is an operator class) and will return a shallow copy of the original object with a qargs property set. When such an object is used with the :meth:`~qiskit.quantum_info.Operator.compose` or :meth:`~qiskit.quantum_info.Operator.dot` methods the internal value for qargs will be used when the ``qargs`` method kwarg is not used. This allows for subsystem composition using binary operators, for example::
ta_in: சுருக்கமான `` பேஸ் ஆபரேட்டர்`` வகுப்பின் துணைப்பிரிவுகளாக இருக்கும் பொருள்களுக்கு `` கர்க்ஸ்`` அமைக்கும் திறனைச் சேர்க்கிறது. பொருளை `` op (qargs) `` (`` op`` என்பது ஒரு ஆபரேட்டர் வகுப்பு) என்று அழைப்பதன் மூலம் இது செய்யப்படுகிறது, மேலும் அசல் பொருளின் ஆழமற்ற நகலை ஒரு qargs சொத்து தொகுப்புடன் திருப்பித் தரும். அத்தகைய பொருள்: மெத்: `~ qiskit.quantum_info.Operator.compose` அல்லது: meth:` ~ qiskit.quantum_info.Operator.dot` முறைகளுடன் பயன்படுத்தப்படும்போது, ​​`` குர்க்ஸ்` போது குவார்களுக்கான உள் மதிப்பு பயன்படுத்தப்படும். `முறை குவார்க் பயன்படுத்தப்படவில்லை. இது பைனரி ஆபரேட்டர்களைப் பயன்படுத்தி துணை அமைப்பு அமைப்பை அனுமதிக்கிறது, எடுத்துக்காட்டாக::

source: Adds :class:`qiskit.quantum_info.Clifford` operator class to the `quantum_info` module. This operator is an efficient symplectic representation an N-qubit unitary operator from the Clifford group. This class includes a :meth:`~qiskit.quantum_info.Clifford.to_circuit` method for compilation into a :class:`~qiskit.QuantumCircuit` of Clifford gates with a minimal number of CX gates for up to 3-qubits. It also providers general compilation for N > 3 qubits but this method is not optimal in the number of two-qubit gates.
ta_in: சேர்க்கிறது: வகுப்பு: `qiskit.quantum_info.Clifford` ஆபரேட்டர் வகுப்பு` குவாண்டம்_இன்ஃபோ` தொகுதிக்கு. இந்த ஆபரேட்டர் கிளிஃபோர்டு குழுவிலிருந்து ஒரு என்-க்விட் யூனிட்டரி ஆபரேட்டரின் திறமையான சிம்பலெக்டிக் பிரதிநிதித்துவம் ஆகும். இந்த வகுப்பில் ஒரு: மெத்: `~ qiskit.quantum_info.Clifford.to_circuit` முறை ஒரு: வகுப்பில் தொகுக்கப்படுகிறது: கிளிஃபோர்டு வாயில்களின்` q qiskit.QuantumCircuit` குறைந்த எண்ணிக்கையிலான CX வாயில்கள் 3-குவிட் வரை. இது N> 3 குவிட்களுக்கான பொதுவான தொகுப்பையும் வழங்குகிறது, ஆனால் இந்த முறை இரண்டு-குவிட் வாயில்களின் எண்ணிக்கையில் உகந்ததல்ல.

source: Adds :class:`qiskit.quantum_info.SparsePauliOp` operator class. This is an efficient representaiton of an N-qubit matrix that is sparse in the Pauli basis and uses a :class:`qiskit.quantum_info.PauliTable` and vector of complex coefficients for its data structure.
ta_in: சேர்க்கிறது:class: `qiskit.quantum_info.SparsePauliOp` ஆபரேட்டர் வகுப்பு. இது ஒரு என்-க்விட் மேட்ரிக்ஸின் திறமையான பிரதிநிதித்துவம் ஆகும், இது பவுலி அடிப்படையில் குறைவாக உள்ளது மற்றும் ஒரு: வர்க்கத்தைப் பயன்படுத்துகிறது :class: `qiskit.quantum_info.PauliTable` மற்றும் அதன் தரவு கட்டமைப்பிற்கான சிக்கலான குணகங்களின் திசையன்.

source: This class supports much of the same functionality of the :class:`qiskit.quantum_info.Operator` class so :class:`~qiskit.quantum_info.SparsePauliOp` objects can be tensored, composed, scalar multiplied, added and subtracted.
ta_in: இந்த வகுப்பு :class: `qiskit.quantum_info.Operator` வகுப்பின் அதே செயல்பாட்டை ஆதரிக்கிறது:class:` ~ qiskit.quantum_info.SparsePauliOp` பொருள்களை டென்சார் செய்யலாம், இசையமைக்கலாம், அளவிடலாம், பெருக்கலாம், கழிக்கலாம்.

source: Numpy arrays or :class:`~qiskit.quantum_info.Operator` objects can be converted to a :class:`~qiskit.quantum_info.SparsePauliOp` using the `:class:`~qiskit.quantum_info.SparsePauliOp.from_operator` method. :class:`~qiskit.quantum_info.SparsePauliOp` can be convered to a sparse csr_matrix or dense Numpy array using the :class:`~qiskit.quantum_info.SparsePauliOp.to_matrix` method, or to an :class:`~qiskit.quantum_info.Operator` object using the :class:`~qiskit.quantum_info.SparsePauliOp.to_operator` method.
ta_in: சுறுசுறுப்பான வரிசைகள் அல்லது:class: `~ qiskit.quantum_info.Operator` பொருள்களை a:class:` ~ qiskit.quantum_info.SparsePauliOp` ஐ `:class:` ~ qiskit.quantum_info.SparsePauliOp.from_operator` முறையைப் பயன்படுத்தி மாற்றலாம். :class: `~ qiskit.quantum_info.SparsePauliOp` ஐ ஒரு சிதறிய csr_matrix அல்லது அடர்த்தியான நம்பி வரிசைக்கு:class:` ~ qiskit.quantum_info.SparsePauliOp.to_matrix` முறை, அல்லது ஒரு :class: `qumkin.qu. :class: `~ qiskit.quantum_info.SparsePauliOp.to_operator` முறையைப் பயன்படுத்தி ஆபரேட்டர்` பொருள்.
