Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: Fix the ``"auto"`` method of the :class:`~qiskit.ignis.verification.tomography.TomographyFitter`, :class:`~qiskit.ignis.verification.tomography.StateTomographyFitter`, and :class:`~qiskit.ignis.verification.tomography.ProcessTomographyFitter` to only use ``"cvx"`` if CVXPY is installed *and* a third-party SDP solver other than SCS is available. This is because the SCS solver has lower accuracy than other solver methods and often returns a density matrix or Choi-matrix that is not completely-positive and fails validation when used with the :func:`qiskit.quantum_info.state_fidelity` or :func:`qiskit.quantum_info.process_fidelity` functions.
ta_in: வர்க்கத்தின் `` "ஆட்டோ" `` முறையை சரிசெய்யவும்: `~ qiskit.ignis.verification.tomography.TomographyFitter` ,: class:` ~ qiskit.ignis.verification.tomography.StateTomographyFitter`, மற்றும்: class: `~ qiskit.ignis.verification.tomography.ProcessTomographyFitter` ஐ CVXPY நிறுவப்பட்டிருந்தால் `` "cvx" `` ஐ மட்டுமே பயன்படுத்த * மற்றும் * SCS ஐத் தவிர மூன்றாம் தரப்பு SDP தீர்வி கிடைக்கிறது. ஏனென்றால், எஸ்சிஎஸ் தீர்வி மற்ற தீர்வி முறைகளை விட குறைந்த துல்லியத்தன்மையைக் கொண்டுள்ளது மற்றும் பெரும்பாலும் அடர்த்தி மேட்ரிக்ஸ் அல்லது சோய்-மேட்ரிக்ஸை முழுமையாக நேர்மறையானது அல்ல, மேலும்: func: `qiskit.quantum_info.state_fidelity` அல்லது: func: உடன் பயன்படுத்தும்போது சரிபார்ப்பில் தோல்வியடைகிறது.

source: Aqua 0.9.0
ta_in: அக்வா 0.9.0

source: This release officially deprecates the Qiskit Aqua project, in the future (no sooner than 3 months from this release) the Aqua project will have it's final release and be archived. All the functionality that qiskit-aqua provides has been migrated to either new packages or to other qiskit packages. The application modules that are provided by qiskit-aqua have been split into several new packages: ``qiskit-optimization``, ``qiskit-nature``, ``qiskit-machine-learning``, and ``qiskit-finance``. These packages can be installed by themselves (via the standard pip install command, ie ``pip install qiskit-nature``) or with the rest of the Qiskit metapackage as optional extras (ie, ``pip install 'qiskit[finance,optimization]'`` or ``pip install 'qiskit[all]'``. The core building blocks for algorithms and the operator flow now exist as part of qiskit-terra at :mod:`qiskit.algorithms` and :mod:`qiskit.opflow`. Depending on your existing usage of Aqua you should either use the application packages or the new modules in Qiskit Terra.
ta_in: இந்த வெளியீடு Qiskit அக்வா திட்டத்தை அதிகாரப்பூர்வமாக மதிப்பிடுகிறது, எதிர்காலத்தில் (இந்த வெளியீட்டில் இருந்து 3 மாதங்களுக்குள் விரைவில்) அக்வா திட்டம் அதன் இறுதி வெளியீட்டைக் கொண்டிருக்கும் மற்றும் காப்பகப்படுத்தப்படும். Qiskit-அக்வா வழங்கும் அனைத்து செயல்பாடுகளும் புதிய தொகுப்புகள் அல்லது பிற Qiskit தொகுப்புகளுக்கு மாற்றப்பட்டுள்ளன. Qiskit-அக்வாவால் வழங்கப்பட்ட பயன்பாட்டு தொகுதிகள் பல புதிய தொகுப்புகளாக பிரிக்கப்பட்டுள்ளன: ``qiskit-optimization``, ``qiskit-nature``, ``qiskit-machine-learning``மற்றும் ``qiskit-finance``. இந்த தொகுப்புகளை அவர்களால் நிறுவ முடியும் (நிலையான குழாய் நிறுவல் கட்டளை வழியாக, அதாவது ``pip install qiskit-nature``) அல்லது மீதமுள்ள Qiskit மெட்டாபேக்கேஜுடன் விருப்ப கூடுதல் (அதாவது, ``pip install 'qiskit[finance,optimization]'`` அல்லது ``pip install 'qiskit[all]'``. வழிமுறைகளுக்கான முக்கிய கட்டுமானத் தொகுதிகள் மற்றும் ஆபரேட்டர் ஓட்டம் இப்போது Qiskit-டெர்ராவின் ஒரு பகுதியாக உள்ளன:mod: `qiskit.algorithms` மற்றும்:mod:` qiskit.opflow`. உங்கள் தற்போதைய அக்வா பயன்பாட்டைப் பொறுத்து நீங்கள் பயன்பாட்டு தொகுப்புகள் அல்லது Qiskit டெர்ராவில் புதிய தொகுதிகள் பயன்படுத்த வேண்டும்.

source: For more details on how to migrate from using Qiskit Aqua you can refer to the :ref:`aqua-migration`.
ta_in: Qiskit அக்வாவைப் பயன்படுத்துவதிலிருந்து எவ்வாறு இடம்பெயர்வது என்பது பற்றிய கூடுதல் விவரங்களுக்கு நீங்கள் :ref:`aqua-migration`.

source: :meth:`qiskit.providers.ibmq.IBMQBackend.defaults` now returns the pulse defaults for the backend if the backend supports pulse. However, your provider may not support pulse even if the backend does. The ``open_pulse`` flag in backend configuration indicates whether the provider supports it.
ta_in: :meth: `qiskit.providers.ibmq.IBMQBackend.defaults` இப்போது பின்தளத்தில் துடிப்பை ஆதரித்தால் பின்தளத்தில் துடிப்பு இயல்புநிலையை வழங்குகிறது. இருப்பினும், பின்தளத்தில் இருந்தாலும் உங்கள் வழங்குநர் துடிப்பை ஆதரிக்கக்கூடாது. பின்தளத்தில் உள்ளமைவில் உள்ள `` திறந்த_ துடிப்பு`` கொடி வழங்குநர் அதை ஆதரிக்கிறதா என்பதைக் குறிக்கிறது.

source: This is the first release of qiskit-aer that publishes precompiled binaries to PyPI for Linux on aarch64 (arm64). From this release onwards Linux aarch64 packages will be published and supported.
ta_in: இது Qiskit Aer-ன் முதல் வெளியீடாகும், இது முன்னரே தொகுக்கப்பட்ட பைனரிகளை PyPi-க்கு லினக்ஸிற்காக aarch64 (arm64) இல் வெளியிடுகிறது. இந்த வெளியீட்டில் இருந்து லினக்ஸ் aarch 64 தொகுப்புகள் வெளியிடப்பட்டு ஆதரிக்கப்படும்.

source: Fixes a bug `#1153 <https://github.com/Qiskit/qiskit-aer/issues/1153>`__ where noise on conditional gates was always being applied regardless of whether the conditional gate was actually applied based on the classical register value. Now noise on a conditional gate will only be applied in the case where the conditional gate is applied.
ta_in: பிழை திருத்தம் `#1153 <https://github.com/Qiskit/qiskit-aer/issues/1153>`__ கிளாசிக்கல் பதிவு மதிப்பின் அடிப்படையில் நிபந்தனை வாயில் உண்மையில் பயன்படுத்தப்பட்டதா என்பதைப் பொருட்படுத்தாமல் நிபந்தனை வாயில்களில் இரைச்சல் எப்போதும் பயன்படுத்தப்படுகிறது. இப்போது நிபந்தனை வாயிலில் இரைச்சல் நிபந்தனை வாயில் பயன்படுத்தப்படும் போது மட்டுமே பயன்படுத்தப்படும்.

source: There was previously a mismatch between the default reported number of qubits the Aer backend objects would say were supported and the the maximum number of qubits the simulator would actually run. This was due to a mismatch between the Python code used for calculating the max number of qubits and the C++ code used for a runtime check for the max number of qubits based on the available memory. This has been correct so by default now Aer backends will allow running circuits that can fit in all the available system memory. Fixes `#1114 <https://github.com/Qiskit/qiskit-aer/issues/1126>`__
ta_in: முன்னதாக Aer பின்தளத்தில் பொருள்கள் ஆதரிக்கப்படுவதாகக் கூறப்படும் இயல்புநிலை அறிக்கையிடப்பட்ட எண்ணிக்கையிலான Qubit-கள் மற்றும் சிமுலேட்டர் உண்மையில் இயங்கும் அதிகபட்ச எண்ணிக்கையிலான Qubit-க்கு இடையில் பொருந்தவில்லை. அதிகபட்ச எண்ணிக்கையிலான Qubitகளைக் கணக்கிடுவதற்குப் பயன்படுத்தப்படும் Python குறியீட்டிற்கும், கிடைக்கக்கூடிய நினைவகத்தின் அடிப்படையில் அதிகபட்ச எண்ணிக்கையிலான Qubitகளுக்கான இயக்க நேர சோதனைக்கு பயன்படுத்தப்படும் C++ குறியீட்டிற்கும் இடையிலான பொருந்தாத காரணத்தினால் இது ஏற்பட்டது. இது சரியானது, எனவே இயல்புநிலையாக இப்போது கிடைக்கக்கூடிய அனைத்து கணினி நினைவகத்திலும் பொருந்தக்கூடிய சுற்றுகளை இயக்க Aer பின்தளத்தில் அனுமதிக்கும். திருத்துவது `#1114 <https://github.com/Qiskit/qiskit-aer/issues/1126>`__

source: IBM Q Provider 0.12.0
ta_in: IBM Q வழங்கி 0. 12. 0

source: :meth:`qiskit.providers.ibmq.IBMQBackend.run` method now takes one or more :class:`~qiskit.circuit.QuantumCircuit` or :class:`~qiskit.pulse.Schedule`. Use of :class:`~qiskit.qobj.QasmQobj` and :class:`~qiskit.qobj.PulseQobj` is now deprecated. Runtime configuration options, such as the number of shots, can be set via either the :meth:`~qiskit.providers.ibmq.IBMQBackend.run` method, or the :meth:`qiskit.providers.ibmq.IBMQBackend.set_options` method. The former is used as a one-time setting for the job, and the latter for all jobs sent to the backend. If an option is set in both places, the value set in :meth:`~qiskit.providers.ibmq.IBMQBackend.run` takes precedence.
ta_in: :meth:` qiskit.preers.ibmq.IBMQBackend.run ` method now takes one or more :class:` ~ qiskit.circuit.QuantumCircuit ` or :class:` ~ qiskit.pulse.Schedule `. Use of :class:` ~ qiskit.QasmQobj ` and :class:` ~ qiskit.Qobj.PulseQobj ` is now deprecated. இயங்கும் கட்டமைப்பு விருப்பங்கள், போன்றவற்றின் எண்ணிக்கை, :meth:` ~ qiskit.preers.ibmq.IBMQBackend.run ` method, or the :meth:` qiskit.preers.ibmq.IBMQBackend.set_options ` method. முன்னாள் வேலைகளுக்கான ஒரு முறை அமைப்பாக பயன்படுத்தப்படுகிறது, மற்றும் பின்னணியில் அனுப்பப்பட்ட அனைத்து வேலைகளுக்கான பின்னணி. இரண்டு இடங்களிலும் ஒரு விருப்பத்தேர்வு அமைக்கப்பட்டால், :meth:` ~ qiskit.देगा என்ற மதிப்பு அமைக்கப்பட்டுள்ளது.

source: IBM Quantum credentials are now loaded only from sections of the ``qiskitrc`` file that start with 'ibmq'.
ta_in: IBM Quantum credentials இப்போது ` ` qiskitrc ` ` கோப்பிலிருந்து 'ibmq' ஆரம்பித்தல் மட்டுமே ஏற்றப்படுகின்றன.

source: Python 3.9 support has been added in this release. You can now run Qiskit IBMQ provider using Python 3.9.
ta_in: இந்த வெளியீட்டில் பைதான் 3.9 ஆதரவு சேர்க்கப்பட்டுள்ளது. நீங்கள் தற்பொழுது Qiskit IBMQ வழங்குபவர் பைதான் 3.9 பயன்படுத்தி இயக்கலாம்.

source: :meth:`qiskit.providers.ibmq.AccountProvider.backends` now has a new parameter `min_num_qubits` that allows you to filter by the minimum number of qubits.
ta_in: : meth: `qiskit.providers.ibmq.AccountProvider.backends` இப்போது ஒரு புதிய அளவுரு` min_num_qubits` ஐக் கொண்டுள்ளது, இது குறைந்தபட்ச எண்ணிக்கையிலான குவிட்களால் வடிகட்ட உங்களை அனுமதிக்கிறது.

source: :class:`qiskit.providers.ibmq.experiment.Experiment` now has three additional attributes, `hub`, `group`, and `project`, that identify the provider used to create the experiment.
ta_in: : class: `qiskit.providers.ibmq.experiment.Experiment` இல் இப்போது மூன்று கூடுதல் பண்புக்கூறுகள் உள்ளன,` ஹப்`, `குழு`, மற்றும்` திட்டம்`, அவை பரிசோதனையை உருவாக்க பயன்படும் வழங்குநரை அடையாளம் காணும்.

source: You can now assign an ``experiment_id`` to a job when submitting it using :meth:`qiskit.providers.ibmq.IBMQBackend.run`. You can use this new field to group together a collection of jobs that belong to the same experiment. The :meth:`qiskit.providers.ibmq.IBMQBackendService.jobs` method was also updated to allow filtering by ``experiment_id``.
ta_in: ஒரு வேலையைப் பயன்படுத்தி சமர்ப்பிக்கும் போது நீங்கள் இப்போது ஒரு `` சோதனை_ஐடி`` ஐ ஒதுக்கலாம்: மெத்: `qiskit.providers.ibmq.IBMQBackend.run`. ஒரே பரிசோதனையைச் சேர்ந்த வேலைகளின் தொகுப்பை ஒன்றிணைக்க இந்த புதிய புலத்தைப் பயன்படுத்தலாம். `மெத்:` qiskit.providers.ibmq.IBMQBackendService.jobs` முறையும் `` பரிசோதனை_ஐடி`` மூலம் வடிகட்டலை அனுமதிக்க புதுப்பிக்கப்பட்டது.

source: :class:`qiskit.providers.ibmq.experiment.Experiment` now has two additional attributes:
ta_in: :class:` qiskit.रोज़ी. Ibmq.experiment.Experiment ` தற்போது இரண்டு கூடுதல் குணங்கள் கொண்டது:

source: share_level: The level at which the experiment is shared which determines who can see it when listing experiments. This can be updated.
ta_in: செங்குத்து அளவு: பரிசோதனை பகிர்ந்துகொள்ளும் அளவு பகிர்ந்தளிக்கப்படுகிறது. இது புதுப்பிக்கலாம்.

source: owner: The ID of the user that uploaded the experiment. This is set by the server and cannot be updated.
ta_in: உரிமையாளர்: ஆய்வு செய்யப்பட்ட பயனரின் அடையாளம். இது சேவையகத்தால் அமைக்கப்பட்டு புதுப்பிக்கப்படாது.

source: The method :meth:`qiskit.providers.ibmq.experimentservice.ExperimentService.experiments` now accepts ``hub``, ``group``, and ``project`` as filtering keywords.
ta_in: முறை: மெத்: `qiskit.providers.ibmq.experimentervice.ExperimentService.experiment`s இப்போது` `ஹப்``,` `குழு``, மற்றும்` `திட்டம்`` ஆகியவற்றை முக்கிய வார்த்தைகளை வடிகட்டுவதாக ஏற்றுக்கொள்கிறது.

source: Methods :meth:`qiskit.providers.ibmq.experiment.ExperimentService.experiments` and :meth:`qiskit.providers.ibmq.experiment.ExperimentService.analysis_results` now support a ``limit`` parameter that allows you to limit the number of experiments and analysis results returned.
ta_in: முறைகள்: மெத்: `qiskit.providers.ibmq.experiment.ExperimentService.experiment` மற்றும்: மெத்:` qiskit.providers.ibmq.experiment.ExperimentService.analysis_results` இப்போது எண்ணைக் கட்டுப்படுத்த உங்களை அனுமதிக்கும் `` வரம்பு`` அளவுருவை ஆதரிக்கிறது சோதனைகள் மற்றும் பகுப்பாய்வு முடிவுகள் திரும்பின.

source: The method :meth:`qiskit.providers.ibmq.experimentservice.ExperimentService.experiments` now accepts ``exclude_mine`` and ``mine_only`` as filtering keywords.
ta_in: முறை: மெத்: `qiskit.providers.ibmq.experimentervice.ExperimentService.experiment` இப்போது` `விலக்கு_மெயின்`` மற்றும்` `என்னுடைய_ஒரு`` ஆகியவற்றை முக்கிய வார்த்தைகளை வடிகட்டுவதாக ஏற்றுக்கொள்கிறது.

source: The method :meth:`qiskit.providers.ibmq.experimentservice.ExperimentService.experiments` now accepts ``exclude_public`` and ``public_only`` as filtering keywords.
ta_in: முறை: மெத்: `qiskit.providers.ibmq.experimentervice.ExperimentService.experiment`s இப்போது` `விலக்கு_பொது`` மற்றும்` `பொது_ஒரு`` ஆகியவற்றை முக்கிய வார்த்தைகளை வடிகட்டுவதாக ஏற்றுக்கொள்கிறது.

source: :meth:`qiskit.providers.ibmq.managed.IBMQJobManager.run` now accepts a single :class:`~qiskit.circuit.QuantumCircuit` or :class:`~qiskit.pulse.Schedule` in addition to a list of them.
ta_in: மீத்: `qiskit.providers.ibmq.managed.IBMQJobManager.run` இப்போது ஒற்றை: வகுப்பை ஏற்றுக்கொள்கிறது:` ~ qiskit.circuit.QuantumCircuit` அல்லது: வகுப்பு: `~ qiskit.pulse.Schedule` அவற்றின் பட்டியலுடன் கூடுதலாக.

source: The :func:`~qiskit.providers.ibmq.least_busy` function now skips backends that are operational but paused, meaning they are accepting but not processing jobs.
ta_in: தி: func: `~ qiskit.providers.ibmq.least_busy` செயல்பாடு இப்போது செயல்படும் ஆனால் இடைநிறுத்தப்பட்ட பின்தளத்தில் தவிர்க்கிறது, அதாவது அவை வேலைகளை ஏற்றுக்கொள்கின்றன, ஆனால் செயலாக்கவில்லை.

source: You can now pickle an :class:`~qiskit.providers.ibmq.job.IBMQJob` instance, as long as it doesn't contain custom data that is not picklable (e.g. in Qobj header).
ta_in: நீங்கள் இப்பொழுது ஒரு :class:` ~ qiskit.fmq.job.IBMQJ `. Ibmq.job.IBMQJob `. உதாரணமாக, அப்படியே (எ. கா: Qobj தலைப்பில்).

source: You can now use the two new methods, :meth:`qiskit.providers.ibmq.AccountProvider.services` and :meth:`qiskit.providers.ibmq.AccountProvider.service` to find out what services are available to your account and get an instance of a particular service.
ta_in: நீங்கள் இப்பொழுது இரண்டு புதிய முறைகளைப் பயன்படுத்தலாம், :meth:` qiskit.देगा நுழைவுக்குள் ./ibmq.AccountProvider.සේවාවන් ` மற்றும் :meth:` qiskit.देगा என்ன சேவைகள் உங்கள் கணக்கில் கிடைக்கப்பெற்றது மற்றும் ஒரு குறிப்பிட்ட சேவையகத்தின் ஒரு நிகழ்வு கிடைக்கும்.

source: The :meth:`qiskit.providers.ibmq.IBMQBackend.reservations` method now always returns the reservation scheduling modes even for reservations that you don't own.
ta_in: :meth:` qiskit.preers.ibmq.IBMQBackend.రిஸ்பேஷன் ` முறை இப்பொழுது எப்போதும் உங்களிடம் இல்லையென்றால் எப்போதும் ரீதியான நேரத்தைக் காட்டும்.

source: A number of previously deprecated methods and features have been removed, including:
ta_in: முன்பு திருத்தப்பட்ட முறைகள் மற்றும் அம்சங்களின் எண்ணிக்கை நீக்கப்பட்டுள்ளன, உட்பட:

source: :meth:`qiskit.providers.ibmq.job.IBMQJob.to_dict`
ta_in: : மெத்: `qiskit.providers.ibmq.job.IBMQJob.to_dict`

source: :meth:`qiskit.providers.ibmq.job.IBMQJob.from_dict`
ta_in: மெத்: `qiskit.providers.ibmq.job.IBMQJob.from_dict

source: `Qconfig.py` support
ta_in: ` Qconfig.py ` ஆதரவு

source: Use of proxy URLs that do not include protocols
ta_in: நெறிமுறைகளை சேர்க்காத ப்ராக்ஸி URL களின் பயன்பாடு

source: A new parameter, ``limit`` is now the first parameter for both :meth:`qiskit.providers.ibmq.experiment.ExperimentService.experiments` and :meth:`qiskit.providers.ibmq.experiment.ExperimentService.analysis_results` methods. This ``limit`` has a default value of 10, meaning by deafult only 10 experiments and analysis results will be returned.
ta_in: முறைகள்: மெத்: `qiskit.providers.ibmq.experiment.ExperimentService.experiment` மற்றும்: மெத்:` qiskit.providers.ibmq.experiment.ExperimentService.analysis_results` இப்போது எண்ணைக் கட்டுப்படுத்த உங்களை அனுமதிக்கும் `` வரம்பு`` அளவுருவை ஆதரிக்கிறது சோதனைகள் மற்றும் பகுப்பாய்வு முடிவுகள் திரும்பின.

source: IBM Quantum credentials are now loaded only from sections of the ``qiskitrc`` file that start with 'ibmq'. This allows the ``qiskitrc`` file to be used for other functionality.
ta_in: IBM Quantum credentials இப்போது ` ` qiskitrc ` ` கோப்பிலிருந்து 'ibmq' ஆரம்பித்தல் மட்டுமே ஏற்றப்படுகின்றன. இது ` qiskitrc ` ` கோப்பை மற்ற செயல்பாடுகளுக்கு பயன்படுகிறது.

source: Use of :class:`~qiskit.qobj.QasmQobj` and :class:`~qiskit.qobj.PulseQobj` in the :meth:`qiskit.providers.ibmq.IBMQBackend.run` method is now deprecated. :class:`~qiskit.circuit.QuantumCircuit` and :class:`~qiskit.pulse.Schedule` should now be used instead.
ta_in: :class:இன் பயன்பாடு `~ qiskit.qobj.QasmQobj` மற்றும்:class:` ~ qiskit.qobj.PulseQobj` இல்:meth: `qiskit.providers.ibmq.IBMQBackend.run` முறை இப்போது நீக்கப்பட்டது. :class: `~ qiskit.circuit.QuantumCircuit` மற்றும்:class:` ~ qiskit.pulse.Schedule` இப்போது அதற்கு பதிலாக பயன்படுத்தப்பட வேண்டும்.

source: The ``backends`` attribute of :class:`qiskit.providers.ibmq.AccountProvider` has been renamed to ``backend`` (sigular). For backward compatibility, you can continue to use ``backends``, but it is deprecated and will be removed in a future release. The :meth:`qiskit.providers.ibmq.AccountProvider.backends` method remains unchanged. For example:
ta_in: ` ` backends ` ` பண்பாடு :class:` qiskit.भविष्य-ibmq.AccountProvider ` ` backend ` ` (sigular) என்று பெயர் மாற்றம் செய்யப்பட்டது. பின்னணி பொருட்களுக்கு, நீங்கள் ` ` backends ` `, பயன்படுத்த தொடர முடியும், ஆனால் அது ஒரு எதிர்கால வெளியீட்டில் நீக்கப்படும். :meth:` qiskit.देगा நபர். Ibmq.AccountProvider.backends ` method remains unchanged. உதாரணமாக:

source: Setting of the :class:`~qiskit.providers.ibmq.job.IBMQJob` ``client_version`` attribute has been deprecated. You can, however, continue to read the value of attribute.
ta_in: :class:` ~ qiskit.preers.ibmq.job.IBMQJob ` ` client_version ` ` பண்பாடு திருத்தப்பட்டுள்ளது. இருப்பினும், பண்பாட்டு மதிப்பை வாசிக்கலாம்.

source: "The ``validate_qobj`` keyword in :meth:`qiskit.providers.ibmq.IBMQBackend.run` is deprecated and will be removed in a future release. If you're relying on this schema validation you should pull the schemas from the `Qiskit/ibmq-schemas <https://github.com/Qiskit/ibm-quantum-schemas>`_ and directly validate your payloads with that.
ta_in: `` Validate_qobj`` இன் முக்கிய சொல்: மெத்: `qiskit.providers.ibmq.IBMQBackend.run` நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். இந்த ஸ்கீமா சரிபார்ப்பை நீங்கள் நம்பினால், `கிஸ்கிட் / இப்மக்-ஸ்கீமாக்கள் <https://github.com/Qiskit/ibm-quantum-schemas>` _ இலிருந்து ஸ்கீமாக்களை இழுத்து, அதனுடன் உங்கள் பேலோடுகளை நேரடியாக சரிபார்க்க வேண்டும்.

source: Fixes the issue wherein a job could be left in the ``CREATING`` state if job submit fails half-way through.
ta_in: வேலை சமர்ப்பிப்பு பாதி வழியில் தோல்வியுற்றால், `` உருவாக்குதல்`` நிலையில் ஒரு வேலையை விடக்கூடிய சிக்கலை சரிசெய்கிறது.

source: Fixes the issue wherein using Jupyter backend widget would fail if the backend's basis gates do not include the traditional u1, u2, and u3. Fixes `#844 <https://github.com/Qiskit/qiskit-ibmq-provider/issues/844>`_
ta_in: பாரம்பரிய u1, u2 மற்றும் u3 ஆகியவை பின்தளத்தில் அடிப்படை வாயில்களில் சேர்க்கப்படாவிட்டால், ஜூப்பிட்டர் பின்தளத்தில் விட்ஜெட்டைப் பயன்படுத்துவது தோல்வியடையும் சிக்கலை சரிசெய்கிறது. திருத்தங்கள் `# 844 <https://github.com/Qiskit/qiskit-ibmq-provider/issues/844>`

source: Fixes the infinite loop raised when passing an ``IBMQRandomService`` instance to a child process.
ta_in: ஒரு குழந்தை செயல்முறைக்கு `` IBMQRandomService`` உதாரணத்தை அனுப்பும்போது எழுப்பப்படும் எல்லையற்ற சுழற்சியை சரிசெய்கிறது.

source: Fixes the issue wherein a ``TypeError`` is raised if the server returns an error code but the response data is not in the expected format.
ta_in: சேவையகம் பிழைக் குறியீட்டை வழங்கினால் `` டைப் எர்ரர்`` எழுப்பப்படும் சிக்கலை சரிசெய்கிறது, ஆனால் பதில் தரவு எதிர்பார்த்த வடிவத்தில் இல்லை.

source: Qiskit 0.23.6
ta_in: கிஸ்கிட் 0.23.3

source: Aer 0.7.5
ta_in: எ இ அர் 0.7.5

source: This release is a bugfix release that fixes compatibility in the precompiled binary wheel packages with numpy versions < 1.20.0. The previous release 0.7.4 was building the binaries in a way that would require numpy 1.20.0 which has been resolved now, so the precompiled binary wheel packages will work with any numpy compatible version.
ta_in: This release is a bugfix release that fixes compatibility in the precompiled binary wheel packages with numpy versions < 1.20.0. முந்தைய வெளியீடு 0.7.4 ஒரு வழியில் பிணைப்பு கட்டப்பட்டது என்று ஒரு வழி 1.20.0 என்று தேவைப்படும் இது இப்போது நீக்கப்பட்டுள்ளது, அதனால் precompiled binary wheel தொகுப்புகள் எந்த எண் பொருத்தமான பதிப்புடன் பணிபுரிந்து கொள்ளும்.

source: IBM Q Provider 0.11.1
ta_in: IBM Q வழங்குபவர் 0.11.1

source: Qiskit 0.23.5
ta_in: கிஸ்கிட் 0.23.5

source: This release is a bugfix release that primarily fixes compatibility with numpy 1.20.0. This numpy release deprecated their local aliases for Python's numeric types (``np.int`` -> ``int``, ``np.float`` -> ``float``, etc.) and the usage of these aliases in Qiskit resulted in a large number of deprecation warnings being emitted. This release fixes this so you can run Qiskit with numpy 1.20.0 without those deprecation warnings.
ta_in: இந்த வெளியீடு ஒரு பிழைத்திருத்த வெளியீடாகும், இது முதன்மையாக நம்பி 1.20.0 உடன் பொருந்தக்கூடிய தன்மையை சரிசெய்கிறது. இந்த எண்ணற்ற வெளியீடு பைத்தானின் எண் வகைகளுக்கான (`` np.int`` -> `` int``, `` np.float`` -> `` மிதவை`, முதலியன) மற்றும் அவற்றின் பயன்பாடு ஆகியவற்றிற்கான உள்ளூர் மாற்றுப்பெயர்களை நீக்கியது. கிஸ்கிட்டில் உள்ள மாற்றுப்பெயர்கள் ஏராளமான தேய்மான எச்சரிக்கைகள் வெளியேற்றப்பட்டன. இந்த வெளியீடு இதை சரிசெய்கிறது, எனவே அந்த நீக்குதல் எச்சரிக்கைகள் இல்லாமல் நீங்கள் கிஸ்கிட்டை எண்ணற்ற 1.20.0 உடன் இயக்க முடியும்.

source: Aer 0.7.4
ta_in: எ இ அர் 0.7.4

source: Fixes compatibility with numpy 1.20.0. This numpy release deprecated their local aliases for Python's numeric types (``np.int`` -> ``int``, ``np.float`` -> ``float``, etc.) and the usage of these aliases in Qiskit Aer resulted in a large number of deprecation warnings being emitted. This release fixes this so you can run Qiskit Aer with numpy 1.20.0 without those deprecation warnings.
ta_in: எண்ணற்ற 1.20.0 உடன் பொருந்தக்கூடிய தன்மையை சரிசெய்கிறது. இந்த எண்ணற்ற வெளியீடு பைத்தானின் எண் வகைகளுக்கான (`` np.int`` -> `` int``, `` np.float`` -> `` மிதவை`, முதலியன) மற்றும் அவற்றின் பயன்பாடு ஆகியவற்றிற்கான உள்ளூர் மாற்றுப்பெயர்களை நீக்கியது. கிஸ்கிட் ஏரில் உள்ள மாற்றுப்பெயர்கள் ஏராளமான தேய்மான எச்சரிக்கைகள் வெளியேற்றப்பட்டன. இந்த வெளியீடு இதை சரிசெய்கிறது, எனவே நீங்கள் கிஸ்கிட் ஏரை 1.20.0 உடன் எண்ணற்ற 1.20.0 உடன் இயக்க முடியும்.

source: This release is a bugfix release that primarily fixes compatibility with numpy 1.20.0. It is also the first release to include support for Python 3.9. Earlier releases (including 0.5.0 and 0.5.1) worked with Python 3.9 but did not indicate this in the package metadata, and there was no upstream testing for those releases. This release fixes that and was tested on Python 3.9 (in addition to 3.6, 3.7, and 3.8).
ta_in: This release is a bugfix release that ప్రధానంగా fixes compatibility with numpy 1.20.0. இது பைதான் 3.9 க்கு ஆதரவு உள்ளிடும் முதல் வெளியீடாகும். முந்தைய வெளியீடுகள் (0.5.0 மற்றும் 0.5.1 உட்பட) பைதான் 3.9 உடன் பணியாற்றினார் ஆனால் இந்த பொதி மெட்டாடா இதில் இது குறிக்கவில்லை, மற்றும் அந்த வெளியீடுகளுக்கான மேம்பட்ட சோதனைகள் இல்லை. இந்த விடுதலை நீக்குகிறது மற்றும் பைதான் 3.9 (3.6, 3.7, மற்றும் 3.8) இல் சோதிக்கப்பட்டது.
