Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: The ``IBMQJob`` class has been revised, and now mimics more closely to the contents of a remote job along with new features:
ta_in: ` ` IBMQJob ` ` வகுப்பு திருத்தப்பட்டுள்ளது, மேலும் இப்போது புதிய அம்சங்களுடன் ஒரு தொலைதூர வேலைகளின் உள்ளடக்கங்களை மேலும் நெருக்கமாக கொண்டு வருகின்றது:

source: You can now assign a name to a job, by specifying ``IBMQBackend.run(..., job_name='...')`` when submitting a job. This name can be retrieved via ``IBMQJob.name()`` and can be used for filtering.
ta_in: ஒரு வேலையைச் சமர்ப்பிக்கும் போது `` IBMQBackend.run (..., job_name = '...') `` என்பதைக் குறிப்பிடுவதன் மூலம் நீங்கள் இப்போது ஒரு வேலைக்கு ஒரு பெயரை ஒதுக்கலாம். இந்த பெயரை `` IBMQJob.name () `` வழியாக மீட்டெடுக்கலாம் மற்றும் வடிகட்டலுக்குப் பயன்படுத்தலாம்.

source: Jobs can now be shared with other users at different levels (global, per hub, group or project) via an optional ``job_share_level`` parameter when submitting the job.
ta_in: வேலையை ஒழுங்குபடுத்தும்போது, வேறுபடி ` job_शेयर_level ` ` அளபுருக்கள் மூலம் வேறுபடும் அளவிலான (உலகளாவிய, ஒவ்வொன்றும், குழு அல்லது திட்டம்) போன்றவற்றோடு இப்போது பிற பயனர்களுடன் பகிர்ந்து கொள்ளலாம்.

source: ``IBMQJob`` instances now have more attributes, reflecting the contents of the remote IBM Q jobs. This implies that new attributes introduced by the IBM Q API will automatically and immediately be available for use (for example, ``job.new_api_attribute``). The new attributes will be promoted to methods when they are considered stable (for example, ``job.name()``).
ta_in: ` ` IBMQJob ` ` instances now have more attributes, reflecting the contents of the remote IBM Q பணிகள். இது IBM Q API மூலம் அறிமுகப்படுத்தப்பட்ட புதிய குணங்கள் தானாகவே மற்றும் உடனடியாக பயன்படுத்த கிடைக்கும் (உதாரணமாக, ``job.new_api_attribute ` `). புதிய குணங்கள் அவை நிலையாக கருதப்படும் போது முறைகளுக்கு பரிந்துரைக்கப்படும் (உதாரணமாக, ``job.name () ` `).

source: ``.error_message()`` returns more information on why a job failed.
ta_in: `. Error_ message () ` ` மேலும் தகவல்களை தரும் ஏன் ஒரு வேலை தோல்வியுற்றது.

source: ``.queue_position()`` accepts a ``refresh`` parameter for forcing an update.
ta_in: ` `.queue_position () ` ` ` ` refresh ` ` அளபுருவை ஏற்றுக்கொள்ளும் ஒரு புதுப்பிக்கப்படுகிறது.

source: ``.result()`` accepts an optional ``partial`` parameter, for returning partial results, if any, of jobs that failed. Be aware that ``Result`` methods, such as ``get_counts()`` will raise an exception if applied on experiments that failed.
ta_in: ` `.result () ` ` ` ` ` ` பகுதி ` ` அளபுருக்கான அளபுருக்கள் ஏற்றுக்கொள்ளும், முழுமையான முடிவுகளையும் திரும்ப ஏற்றுக்கொள்ளும், எந்த வேலைகளில் தோல்வியுற்றது. ` ` get_counts () ` ` ` ` Result ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` ` முடிவுகளுக்கு ஒரு விதிமுறையை உயர்த்தியுள்ளது.

source: Please note that the changes include some low-level modifications of the class. If you were creating the instances manually, note that:
ta_in: தயவு செய்து மாற்றங்கள் வகுப்பின் சில குறைந்த அளவு மாற்றங்களை உள்ளடக்குகிறது என்று குறிப்பிடுக. நீங்கள் எந்த நிகழ்வுகளையும் கைமுறையாக உருவாக்கினால், குறிப்பு:

source: the signature of the constructor has changed to account for the new features.
ta_in: கட்டமைப்பின் கையொப்பம் புதிய அம்சங்களுக்காக கணக்கிடப்பட்டுள்ளது.

source: the ``.submit()`` method can no longer be called directly, and jobs are expected to be submitted either via the synchronous ``IBMQBackend.run()`` or via the Job Manager.
ta_in: `. சமர்ப்பித்தல் () `` முறையை இனி நேரடியாக அழைக்க முடியாது, மேலும் ஒத்திசைவான `` IBMQBackend.run () `` வழியாக அல்லது வேலை மேலாளர் வழியாக வேலைகள் சமர்ப்பிக்கப்படும் என்று எதிர்பார்க்கப்படுகிறது.

source: Job Manager
ta_in: பணி மேலாளர்

source: A new Job Manager (``IBMQJobManager``) has been introduced, as a higher-level mechanism for handling jobs composed of multiple circuits or pulse schedules. The Job Manager aims to provide a transparent interface, intelligently splitting the input into efficient units of work and taking full advantage of the different components. It will be expanded on upcoming versions, and become the recommended entry point for job submission.
ta_in: ஒரு புதிய பணி மேலாளர் (` ` IBMQJobManager ` `) அறிமுகப்படுத்தப்பட்டு, பல சுற்றுச்சூழல் அல்லது பழுப்பு திட்டங்களைக் கொண்டிருக்கும் பணிகளை கையாளுவதற்கு மேல்நிலைப்பள்ளி இயக்கமாகும். பணி மேலாளர் ஒரு தெளிவான இடைமுகத்தை வழங்குவதற்கு, ஒழுங்குபடுத்தும் வேலைகளின் திறமையான அலகுகளாக உள்ளீடு மற்றும் பல்வேறு கூறுகளின் முழு வசதி எடுத்துக்கொள்கிறது. இது அப்போதைய பதிப்புக்களில் விரிவாக்கப்பட்டு, வேலை உள்நுழைக்கு பரிந்துரைக்கப்படும் நுழைவு புள்ளியாக மாறும்.

source: Its ``.run()`` method receives a list of circuits or pulse schedules, and returns a ``ManagedJobSet instance``, which can then be used to track the statuses and results of these jobs. For example::
ta_in: அதன் ` `.run () ` முறையில், சுற்றுப்பயணங்களின் பட்டியலை பெறுகிறது. ` ` ManagedJobSet நிகழ்வு ` ` ` ` ManagedJobSet உதாரணம் ` `, இது பின்னர் இந்த வேலைகளின் மாநிலங்கள் மற்றும் முடிவுகளையும் தடுக்க பயன்படுகிறது. உதாரணமாக::

source: provider.backends modifications
ta_in: பின்னணி மாற்றங்கள்

source: The ``provider.backends`` member, which was previously a function that returned a list of backends, has been promoted to a service. This implies that it can be used both in the previous way, as a ``.backends()`` method, and also as a ``.backends`` attribute with expanded capabilities:
ta_in: வழங்குநர்.பேக்கண்ட்ஸ்`` உறுப்பினர், முன்பு பின்தளத்தில் பட்டியலை வழங்கிய ஒரு செயல்பாடாக இருந்தது, இது ஒரு சேவைக்கு உயர்த்தப்பட்டது. இது முந்தைய வழியில், ``.பேக்கண்ட்ஸ் () `` முறையாகவும், விரிவாக்கப்பட்ட திறன்களைக் கொண்ட ``.பேக்கண்ட்ஸ்`` பண்புகளாகவும் பயன்படுத்தப்படலாம் என்பதை இது குறிக்கிறது:

source: it contains the existing backends from that provider as attributes, which can be used for autocompletion. For example::
ta_in: இது அந்தப் பணியாளரால் இருந்து தற்போதைய பின்னணிகளை உள்ளடக்குகிறது. உதாரணமாக::

source: is equivalent to::
ta_in: இதற்கு சமம்::

source: the ``provider.backends.jobs()`` and ``provider.backends.retrieve_job()`` methods can be used for retrieving provider-wide jobs.
ta_in: `` வழங்குநர்.பேக்கண்ட்ஸ்.ஜோப்ஸ் () `` மற்றும் `` வழங்குநர்.

source: Other changes
ta_in: மற்ற மாற்றங்கள்

source: The ``backend.properties()`` function now accepts an optional ``datetime`` parameter. If specified, the function returns the backend properties closest to, but older than, the specified datetime filter.
ta_in: ` Backend.properties () `` செயல்பாடு இப்போது விருப்பமான `` தேதிநேர`` அளவுருவை ஏற்றுக்கொள்கிறது. குறிப்பிடப்பட்டால், செயல்பாடு பின்தளத்தில் பண்புகளை மிக நெருக்கமான, ஆனால் குறிப்பிட்ட தேதிநேர வடிப்பானை விட பழையதாக வழங்குகிறது.

source: Some ``warnings`` have been toned down to ``logger.warning`` messages.
ta_in: சில `` எச்சரிக்கைகள்`` `` லாஜர். எச்சரிக்கை`` செய்திகளுக்கு குறைக்கப்பட்டுள்ளன.

source: Terra 0.10.0
ta_in: டெரா 0.10.0

source: The 0.10.0 release includes several new features and bug fixes. The biggest change for this release is the addition of initial support for using Qiskit with trapped ion trap backends.
ta_in: 0.10.0 விடுதலை பல புதிய அம்சங்கள் மற்றும் பிழை திருத்தங்கள் ஆகியவற்றை உள்ளடக்குகிறது. இந்த விடுதலுக்கான மிகப்பெரிய மாற்றம் சிக்கிட் பயன்படுத்துவதற்கு ஆரம்ப ஆதரவு கூடியது.

source: Introduced new methods in ``QuantumCircuit`` which allows the seamless adding or removing of measurements at the end of a circuit.
ta_in: `` குவாண்டம் சிர்குட்`` இல் புதிய முறைகளை அறிமுகப்படுத்தியது, இது ஒரு சுற்று முடிவில் அளவீடுகளை தடையின்றி சேர்க்க அல்லது அகற்ற அனுமதிக்கிறது.

source: ``measure_all()``
ta_in: ` ` அளவு எல்லாம் () ` `

source: Adds a ``barrier`` followed by a ``measure`` operation to all qubits in the circuit. Creates a ``ClassicalRegister`` of size equal to the number of qubits in the circuit, which store the measurements.
ta_in: ஒரு `` தடையை`` சேர்க்கிறது, அதன்பிறகு சுற்றுகளில் உள்ள அனைத்து குவிட்டுகளுக்கும் `` அளவீட்டு`` செயல்பாடு சேர்க்கிறது. சுற்றுகளில் உள்ள குவிட்களின் எண்ணிக்கைக்கு சமமான `` கிளாசிக்கல் ரெஜிஸ்டர்`` அளவை உருவாக்குகிறது, இது அளவீடுகளை சேமிக்கிறது.

source: ``measure_active()``
ta_in: ` ` அளவு செயலில் () ` `

source: Adds a ``barrier`` followed by a ``measure`` operation to all active qubits in the circuit. A qubit is active if it has at least one other operation acting upon it. Creates a ``ClassicalRegister`` of size equal to the number of active qubits in the circuit, which store the measurements.
ta_in: சுற்றுகளில் உள்ள அனைத்து செயலில் உள்ள குவிட்டுகளுக்கும் ஒரு `` தடை`` ஐத் தொடர்ந்து `` அளவீட்டு`` செயல்பாட்டைச் சேர்க்கிறது. ஒரு குவிட் செயலில் குறைந்தது ஒரு செயல்பாட்டைக் கொண்டிருந்தால். சுற்றுகளில் செயலில் உள்ள குவிட்களின் எண்ணிக்கைக்கு சமமான ஒரு `` கிளாசிக்கல் ரெஜிஸ்டர்`` அளவை உருவாக்குகிறது, இது அளவீடுகளை சேமிக்கிறது.

source: ``remove_final_measurements()``
ta_in: `அகற்று_ இறுதி_ அளவீடுகள் ()` `

source: Removes all final measurements and preceeding ``barrier`` from a circuit. A measurement is considered "final" if it is not followed by any other operation, excluding barriers and other measurements. After the measurements are removed, if all of the classical bits in the ``ClassicalRegister`` are idle (have no operations attached to them), then the ``ClassicalRegister`` is removed.
ta_in: அனைத்து இறுதி அளவீடுகளையும் நீக்குகிறது மற்றும் ஒரு சுற்றிலிருந்து `` தடை`` க்கு முன்னால். தடைகள் மற்றும் பிற அளவீடுகளைத் தவிர்த்து, வேறு எந்த நடவடிக்கையும் பின்பற்றப்படாவிட்டால், ஒரு அளவீட்டு "இறுதி" என்று கருதப்படுகிறது. அளவீடுகள் அகற்றப்பட்ட பிறகு, `` கிளாசிக்கல் ரெஜிஸ்டர்`` இல் உள்ள கிளாசிக்கல் பிட்கள் அனைத்தும் செயலற்றதாக இருந்தால் (அவற்றுடன் எந்த நடவடிக்கைகளும் இணைக்கப்படவில்லை), பின்னர் `` கிளாசிக்கல் ரெஜிஸ்டர்`` அகற்றப்படும்.

source: Initial support for executing experiments on ion trap backends has been added.
ta_in: ஆயுதப் பக்கங்களின் பின்புலத்தைக் கொண்டு செயற்படுத்துவதற்கு ஆரம்ப ஆதரவு சேர்க்கப்பட்டது.

source: An Rxx gate (rxx) and a global Mølmer–Sørensen gate (ms) have been added to the standard gate set.
ta_in: ஒரு Rxx வாயில் (rxx) மற்றும் ஒரு உலகளாவிய Mølmer-Sørensen gate (ms) தரப்பட்ட வாயுத் தளத்தில் சேர்க்கப்பட்டுள்ளது.

source: A Cnot to Rxx/Rx/Ry decomposer ``cnot_rxx_decompose`` and a single qubit Euler angle decomposer ``OneQubitEulerDecomposer`` have been added to the ``quantum_info.synthesis`` module.
ta_in: Rxx / Rx / Ry டிகம்போசருக்கு ஒரு முடிச்சு `` cnot_rxx_decompose`` மற்றும் ஒற்றை குவிட் யூலர் கோண டிகம்போசர் `` OneQubitEulerDecomposer`` ஆகியவை `` குவாண்டம்_இன்ஃபோ.சிந்தெசிஸ்`` தொகுதிக்கு சேர்க்கப்பட்டுள்ளன.

source: A transpiler pass ``MSBasisDecomposer`` has been added to unroll circuits defined over U3 and Cnot gates into a circuit defined over Rxx,Ry and Rx. This pass will be included in preset pass managers for backends which include the 'rxx' gate in their supported basis gates.
ta_in: U3 மற்றும் Cnot வாயில்களில் வரையறுக்கப்பட்ட சுற்றுகளை Rxx, Ry மற்றும் Rx இல் வரையறுக்கப்பட்ட ஒரு சுற்றுக்குள் சேர்க்க ஒரு டிரான்ஸ்பைலர் பாஸ் `` MSBasisDecomposer`` சேர்க்கப்பட்டுள்ளது. இந்த பாஸ் பின்தளத்தில் முன்னமைக்கப்பட்ட பாஸ் மேலாளர்களில் சேர்க்கப்படும், இதில் 'rxx' வாயில் அவற்றின் ஆதரவு அடிப்படை வாயில்களில் அடங்கும்.

source: The backends in ``qiskit.test.mock`` now contain a snapshot of real device calibration data. This is accessible via the ``properties()`` method for each backend. This can be used to test any code that depends on backend properties, such as noise-adaptive transpiler passes or device noise models for simulation. This will create a faster testing and development cycle without the need to go to live backends.
ta_in: `` Qiskit.test.mock`` இல் உள்ள பின்தளத்தில் இப்போது உண்மையான சாதன அளவீட்டு தரவின் ஸ்னாப்ஷாட் உள்ளது. ஒவ்வொரு பின்தளத்தில் உள்ள `` பண்புகள் () `` முறை வழியாக இதை அணுகலாம். சத்தம்-தகவமைப்பு டிரான்ஸ்பைலர் பாஸ்கள் அல்லது உருவகப்படுத்துதலுக்கான சாதன இரைச்சல் மாதிரிகள் போன்ற பின்தளத்தில் பண்புகளைப் பொறுத்து எந்த குறியீட்டையும் சோதிக்க இதைப் பயன்படுத்தலாம். இது நேரடி பின்தளத்தில் செல்ல வேண்டிய அவசியமின்றி வேகமான சோதனை மற்றும் மேம்பாட்டு சுழற்சியை உருவாக்கும்.

source: Allows the Result class to return partial results. If a valid result schema is loaded that contains some experiments which succeeded and some which failed, this allows accessing the data from experiments that succeeded, while raising an exception for experiments that failed and displaying the appropriate error message for the failed results.
ta_in: பகுதி முடிவுகளை பகுதி முடிவுகளை வழங்க அனுமதிக்கிறது. செல்லுபடியாகும் முடிவுத் திட்டம் ஏற்றப்பட்டால், அதில் சில சோதனைகள் வெற்றிபெற்றன மற்றும் தோல்வியுற்றன, இது வெற்றிகரமான சோதனைகளிலிருந்து தரவை அணுக அனுமதிக்கிறது, அதே நேரத்தில் தோல்வியுற்ற சோதனைகளுக்கு விதிவிலக்கு எழுப்புவதோடு தோல்வியுற்ற முடிவுகளுக்கு பொருத்தமான பிழை செய்தியைக் காண்பிக்கும்.

source: An ``ax`` kwarg has been added to the following visualization functions:
ta_in: பின்வரும் காட்சிப்படுத்தல் செயல்பாடுகளில் ``ax_`` மற்றும் `` ax_imag`` குவார்க் சேர்க்கப்பட்டுள்ளன:

source: ``qiskit.visualization.circuit_drawer`` (``mpl`` backend only)
ta_in: `` qiskit.visualization.circuit_drawer`` (`` mpl`` பின்தளத்தில் மட்டும்)

source: ``qiskit.QuantumCircuit.draw`` (``mpl`` backend only)
ta_in: `` qiskit.QuantumCircuit.draw`` (`` mpl`` பின்தளத்தில் மட்டும்)

source: This kwarg is used to pass in a ``matplotlib.axes.Axes`` object to the visualization functions. This enables integrating these visualization functions into a larger visualization workflow. Also, if an `ax` kwarg is specified then there is no return from the visualization functions.
ta_in: இந்த குவார்க் காட்சிப்படுத்தல் செயல்பாடுகளுக்கு `` matplotlib.axes.Axes`` பொருளில் அனுப்ப பயன்படுகிறது. இந்த காட்சிப்படுத்தல் செயல்பாடுகளை ஒரு பெரிய காட்சிப்படுத்தல் பணிப்பாய்வுகளில் ஒருங்கிணைக்க இது உதவுகிறது. மேலும், ஒரு `ax` குவார்க் குறிப்பிடப்பட்டால், காட்சிப்படுத்தல் செயல்பாடுகளிலிருந்து திரும்ப முடியாது.

source: An ``ax_real`` and ``ax_imag`` kwarg has been added to the following visualization functions:
ta_in: பின்வரும் காட்சிப்படுத்தல் செயல்பாடுகளில் ``ax_`` மற்றும் `` ax_imag`` குவார்க் சேர்க்கப்பட்டுள்ளன:

source: These new kargs work the same as the newly added ``ax`` kwargs for other visualization functions. However because these plots use two axes (one for the real component, the other for the imaginary component). Having two kwargs also provides the flexibility to only generate a visualization for one of the components instead of always doing both. For example::
ta_in: இந்த புதிய கார்குகள் பிற காட்சிப்படுத்தல் செயல்பாடுகளுக்கு புதிதாக சேர்க்கப்பட்ட `` ax`` குவார்க்குகளைப் போலவே செயல்படுகின்றன. இருப்பினும், இந்த அடுக்கு இரண்டு அச்சுகளைப் பயன்படுத்துகிறது (ஒன்று உண்மையான கூறுக்கு, மற்றொன்று கற்பனைக் கூறுக்கு). இரண்டு குவார்க்குகளை வைத்திருப்பது எப்போதும் இரண்டையும் செய்வதற்குப் பதிலாக ஒரு கூறுகளுக்கு மட்டுமே காட்சிப்படுத்தலை உருவாக்குவதற்கான நெகிழ்வுத்தன்மையை வழங்குகிறது. உதாரணத்திற்கு::

source: will only generate a plot of the real component.
ta_in: உண்மையான கூறு ஒரு சதி மட்டுமே உருவாக்க வேண்டும்.

source: A given pass manager now can be edited with the new method `replace`. This method allows to replace a particular stage in a pass manager, which can be handy when dealing with preset pass managers. For example, let's edit the layout selector of the pass manager used at optimization level 0:
ta_in: கொடுக்கப்பட்ட பாஸ் மேலாளரை இப்போது புதிய முறை `replace` மூலம் திருத்தலாம். பாஸ் மேலாளரில் ஒரு குறிப்பிட்ட கட்டத்தை மாற்ற இந்த முறை அனுமதிக்கிறது, இது முன்னமைக்கப்பட்ட பாஸ் மேலாளர்களுடன் கையாளும் போது எளிது. எடுத்துக்காட்டாக, தேர்வுமுறை நிலை 0 இல் பயன்படுத்தப்படும் பாஸ் மேலாளரின் தளவமைப்பு தேர்வாளரைத் திருத்துவோம்:

source: The layout selection is set in the stage `[1]`. Let's replace it with `DenseLayout`:
ta_in: தளவமைப்பு தேர்வு `[1]` கட்டத்தில் அமைக்கப்பட்டுள்ளது. இதை `DenseLayout` உடன் மாற்றுவோம்:

source: If you want to replace it without any condition, you can use set-item shortcut:
ta_in: எந்தவொரு நிபந்தனையும் இல்லாமல் அதை மாற்ற விரும்பினால், நீங்கள் தொகுப்பு உருப்படி குறுக்குவழியைப் பயன்படுத்தலாம்:

source: Introduced a new pulse command ``Delay`` which may be inserted into a pulse ``Schedule``. This command accepts a ``duration`` and may be added to any ``Channel``. Other commands may not be scheduled on a channel during a delay.
ta_in: ஒரு புதிய துடிப்பு கட்டளையை அறிமுகப்படுத்தியது `` Delay`` இது ஒரு துடிப்பு `` Schedule`` இல் செருகப்படலாம். இந்த கட்டளை `` duration`` ஏற்றுக்கொள்கிறது, மேலும் இது எந்த `` Channel``லுக்கும் சேர்க்கப்படலாம். பிற கட்டளைகள் தாமதத்தின் போது சேனலில் திட்டமிடப்படாமல் போகலாம்.

source: The delay can be added just like any other pulse command. For example::
ta_in: மற்ற துடிப்பு கட்டளைகளைப் போலவே தாமதத்தையும் சேர்க்கலாம். உதாரணத்திற்கு::

source: One may also pass additional channels to be padded and a time to pad until, for example::
ta_in: ஒருவர் கூடுதல் சேனல்களைத் திணிக்கலாம் மற்றும் திண்டுக்கு ஒரு நேரம் வரை அனுப்பலாம், எடுத்துக்காட்டாக::

source: Assignments and modifications to the ``data`` attribute of ``qiskit.QuantumCircuit`` objects are now validated following the same rules used throughout the ``QuantumCircuit`` API. This was done to improve the performance of the circuits API since we can now assume the ``data`` attribute is in a known format. If you were manually modifying the ``data`` attribute of a circuit object before this may no longer work if your modifications resulted in a data structure other than the list of instructions with context in the format ``[(instruction, qargs, cargs)]``
ta_in: `` Qiskit.QuantumCircuit`` பொருட்களின் ``data`` பண்புக்கூறுக்கான பணிகள் மற்றும் மாற்றங்கள் இப்போது `` QuantumCircuit`` ஏபிஐ முழுவதும் பயன்படுத்தப்படும் அதே விதிகளைப் பின்பற்றி சரிபார்க்கப்படுகின்றன. சுற்றுகள் API இன் செயல்திறனை மேம்படுத்துவதற்காக இது செய்யப்பட்டது, ஏனெனில் ``data`` பண்பு அறியப்பட்ட வடிவத்தில் இருப்பதாக இப்போது நாம் கருதலாம். சர்க்யூட் பொருளின் `` data`` பண்புக்கூற்றை நீங்கள் கைமுறையாக மாற்றியமைத்திருந்தால், உங்கள் மாற்றங்கள் சூழலில் உள்ள அறிவுறுத்தல்களின் பட்டியலைத் தவிர வேறு தரவு கட்டமைப்பை விளைவித்தால் இனி இயங்காது `` [(instruction, qargs, cargs)] ``

source: The transpiler default passmanager for optimization level 2 now uses the ``DenseLayout`` layout selection mechanism by default instead of ``NoiseAdaptiveLayout``. The ``Denselayout`` pass has also been modified to be made noise-aware.
ta_in: தேர்வுமுறை நிலை 2 க்கான டிரான்ஸ்பைலர் இயல்புநிலை பாஸ்மேனேஜர் இப்போது `` NoiseAdaptiveLayout`` க்கு பதிலாக இயல்பாக `` DenseLayout`` தளவமைப்பு தேர்வு பொறிமுறையைப் பயன்படுத்துகிறது. `` DenseLayout`` பாஸும் சத்தம்-விழிப்புணர்வுக்குரியதாக மாற்றப்பட்டுள்ளது.

source: The deprecated ``DeviceSpecification`` class has been removed. Instead you should use the ``PulseChannelSpec``. For example, you can run something like::
ta_in: நீக்கப்பட்ட `` DeviceSpecification`` வகுப்பு நீக்கப்பட்டது. அதற்கு பதிலாக நீங்கள் `` PulseChannelSpec`` ஐப் பயன்படுத்த வேண்டும். எடுத்துக்காட்டாக, நீங்கள்::

source: The deprecated module ``qiskit.pulse.ops`` has been removed. Use ``Schedule`` and ``Instruction`` methods directly. For example, rather than::
ta_in: நீக்கப்பட்ட தொகுதி `` qiskit.pulse.ops`` அகற்றப்பட்டது. `` Schedule`` மற்றும் ``Instruction`` முறைகளை நேரடியாகப் பயன்படுத்தவும். எடுத்துக்காட்டாக,::

source: Instead please use::
ta_in: அதற்கு பதிலாக:: ஐப் பயன்படுத்தவும்::

source: This same pattern applies to other ``ops`` functions: ``insert``, ``shift``, ``append``, and ``flatten``.
ta_in: இதே முறை மற்ற ``ops` செயல்பாடுகளுக்கும் பொருந்தும்: ``insert``, ``shift``, ``append``, and ``flatten``.

source: Using the ``control`` property of ``qiskit.circuit.Instruction`` for classical control is now deprecated. In the future this property will be used for quantum control. Classically conditioned operations will instead be handled by the ``condition`` property of ``qiskit.circuit.Instruction``.
ta_in: கிளாசிக்கல் கட்டுப்பாட்டுக்கு `` qiskit.circuit.Instruction`` இன் `` control`` சொத்தைப் பயன்படுத்துவது இப்போது நீக்கப்பட்டது. எதிர்காலத்தில் இந்த சொத்து குவாண்டம் கட்டுப்பாட்டுக்கு பயன்படுத்தப்படும். கிளாசிக்கல் நிபந்தனைக்குட்பட்ட செயல்பாடுகள் அதற்கு பதிலாக `` qiskit.circuit.Instruction`` இன் ``condition`` சொத்தால் கையாளப்படும்.

source: Support for setting ``qiskit.circuit.Instruction`` parameters with an object of type ``qiskit.qasm.node.Node`` has been deprecated. ``Node`` objects that were previously used as parameters should be converted to a supported type prior to initializing a new ``Instruction`` object or calling the ``Instruction.params`` setter. Supported types are ``int``, ``float``, ``complex``, ``str``, ``qiskit.circuit.ParameterExpression``, or ``numpy.ndarray``.
ta_in: `` Qiskit.qasm.node.Node`` வகை பொருளைக் கொண்டு `` qiskit.circuit.Instruction`` அளவுருக்களை அமைப்பதற்கான ஆதரவு நீக்கப்பட்டது. புதிய ``Instruction`` பொருளைத் தொடங்குவதற்கு முன் அல்லது `` instruction.params'` செட்டரை அழைப்பதற்கு முன்பு, `` Node`` பொருள்களை முன்னர் அளவுருக்களாகப் பயன்படுத்தப்பட்டவை ஆதரிக்கப்பட்ட வகையாக மாற்றப்பட வேண்டும். ஆதரிக்கப்படும் வகைகள் `` int``, `` float``, ``complex``, `` str``, `` qiskit.circuit.ParameterExpression``, அல்லது `` numpy.ndarray``.

source: In the qiskit 0.9.0 release the representation of bits (both qubits and classical bits) changed from tuples of the form ``(register, index)`` to be instances of the classes ``qiskit.circuit.Qubit`` and ``qiskit.circuit.Clbit``. For backwards compatibility comparing the equality between a legacy tuple and the bit classes was supported as everything transitioned from tuples to being objects. This support is now deprecated and will be removed in the future. Everything should use the bit classes instead of tuples moving forward.
ta_in: Qiskit 0.9.0 வெளியீட்டில், ``(register, index)`` வடிவத்தின் டுப்பில்களிலிருந்து மாற்றப்பட்ட பிட்களின் பிரதிநிதித்துவம் (குவிட்ஸ் மற்றும் கிளாசிக்கல் பிட்கள்) `` qiskit.circuit.Qubit`` மற்றும் ` `qiskit.circuit.Clbit``. எல்லாவற்றையும் டூப்பிள்ஸில் இருந்து பொருள்களாக மாற்றுவதால், ஒரு பாரம்பரிய டூப்பிள் மற்றும் பிட் வகுப்புகளுக்கு இடையிலான சமத்துவத்தை ஒப்பிடும் பின்னோக்கி பொருந்தக்கூடிய தன்மை ஆதரிக்கப்பட்டது. இந்த ஆதரவு இப்போது நீக்கப்பட்டது மற்றும் எதிர்காலத்தில் அகற்றப்படும். முன்னோக்கி நகர்த்துவதற்கு பதிலாக பிட் வகுப்புகளை எல்லாம் பயன்படுத்த வேண்டும்.

source: When the ``mpl`` output is used for either ``qiskit.QuantumCircuit.draw()`` or ``qiskit.visualization.circuit_drawer()`` and the ``style`` kwarg is used, passing in unsupported dictionary keys as part of the ``style``` dictionary is now deprecated. Where these unknown arguments were previously silently ignored, in the future, unsupported keys will raise an exception.
ta_in: `` mpl`` வெளியீடு `` qiskit.QuantumCircuit.draw () `` அல்லது `` qiskit.visualization.circuit_drawer () `` மற்றும் `` style`` குவார்க் பயன்படுத்தப்படும்போது, ​​ஆதரிக்கப்படாத அகராதியில் கடந்து செல்லும் போது ``style`` அகராதியின் ஒரு பகுதியாக விசைகள் இப்போது நீக்கப்பட்டன. இந்த அறியப்படாத வாதங்கள் முன்பு அமைதியாக புறக்கணிக்கப்பட்ட இடத்தில், எதிர்காலத்தில், ஆதரிக்கப்படாத விசைகள் விதிவிலக்கை எழுப்புகின்றன.

source: The ``line length`` kwarg for the ``qiskit.QuantumCircuit.draw()`` method and the ``qiskit.visualization.circuit_drawer()`` function with the text output mode is deprecated. It has been replaced by the ``fold`` kwarg which will behave identically for the text output mode (but also now supports the mpl output mode too). ``line_length`` will be removed in a future release so calls should be updated to use ``fold`` instead.
ta_in: `` Qiskit.QuantumCircuit.draw () `` முறைக்கான ``line lenght`` குவார்க் மற்றும் உரை வெளியீட்டு பயன்முறையுடன் `` qiskit.visualization.circuit_drawer () `` செயல்பாடு நீக்கப்பட்டது. இது ``fold`` குவார்க்கால் மாற்றப்பட்டுள்ளது, இது உரை வெளியீட்டு பயன்முறையில் ஒரே மாதிரியாக செயல்படும் (ஆனால் இப்போது எம்.பி.எல் வெளியீட்டு பயன்முறையையும் ஆதரிக்கிறது). எதிர்கால வெளியீட்டில் `` line_length`` அகற்றப்படும், எனவே அதற்கு பதிலாக `` fold`` ஐப் பயன்படுத்த அழைப்புகள் புதுப்பிக்கப்பட வேண்டும்.
