Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: A :class:`~qiskit.quantum_info.SparsePauliOp` can be iterated over in terms of its :class:`~qiskit.quantum_info.PauliTable` components and coefficients, its coefficients and Pauli string labels using the :meth:`~qiskit.quantum_info.SparsePauliOp.label_iter` method, and the (dense or sparse) matrix components using the :meth:`~qiskit.quantum_info.SparsePauliOp.matrix_iter` method.
ta_in: :class: `~ qiskit.quantum_info.SparsePauliOp` ஐ அதன்:class:` ~ qiskit.quantum_info.PauliTable` கூறுகள் மற்றும் குணகங்கள், அதன் குணகங்கள் மற்றும் பவுலி சரம் லேபிள்களைப் பயன்படுத்தி :meth: `~qiskit. quantum_info.SparsePauliOp.label_iter` முறை, மற்றும் (அடர்த்தியான அல்லது சிதறிய) மேட்ரிக்ஸ் கூறுகள்:meth:`~ qiskit.quantum_info.SparsePauliOp.matrix_iter` முறையைப் பயன்படுத்தி.

source: Add :meth:`qiskit.quantum_info.diamond_norm` function for computing the diamond norm (completely-bounded trace-norm) of a quantum channel. This can be used to compute the distance between two quantum channels using ``diamond_norm(chan1 - chan2)``.
ta_in: சேர்:meth: ஒரு குவாண்டம் சேனலின் வைர நெறிமுறையை (முற்றிலும் கட்டுப்படுத்தப்பட்ட சுவடு-விதிமுறை) கணக்கிடுவதற்கான `qiskit.quantum_info.diamond_norm` செயல்பாடு. `` diamond_norm(chan1 - chan2)`` ஐப் பயன்படுத்தி இரண்டு குவாண்டம் சேனல்களுக்கு இடையிலான தூரத்தை கணக்கிட இதைப் பயன்படுத்தலாம்.

source: A new class :class:`qiskit.quantum_info.PauliTable` has been added. This is an efficient symplectic representation of a list of N-qubit Pauli operators. Some features of this class are:
ta_in: ஒரு புதிய வகுப்பு:class: `qiskit.quantum_info.PauliTable` சேர்க்கப்பட்டுள்ளது. இது N-qubit Pauli ஆபரேட்டர்களின் பட்டியலின் திறமையான சிம்பலெக்டிக் பிரதிநிதித்துவம் ஆகும். இந்த வகுப்பின் சில அம்சங்கள்:

source: :class:`~qiskit.quantum_info.PauliTable` objects may be composed, and tensored which will return a :class:`~qiskit.quantum_info.PauliTable` object with the combination of the operation ( :meth:`~qiskit.quantum_info.PauliTable.compose`, :meth:`~qiskit.quantum_info.PauliTable.dot`, :meth:`~qiskit.quantum_info.PauliTable.expand`, :meth:`~qiskit.quantum_info.PauliTable.tensor`) between each element of the first table, with each element of the second table.
ta_in: :class: `~ qiskit.quantum_info.PauliTable` பொருள்கள் இயற்றப்படலாம், மேலும் அவை ஒரு:class:` ~ qiskit.quantum_info.PauliTable` பொருளின் செயல்பாட்டின் கலவையுடன் (:meth: `~ qiskit.quantum_info. PauliTable.compose` ,:meth: `~ qiskit.quantum_info.PauliTable.dot` ,:meth:` ~ qiskit.quantum_info.PauliTable.expand` ,:meth: `~ qiskit.quantum_info.PauliTable.tensor`) முதல் அட்டவணையில், இரண்டாவது அட்டவணையின் ஒவ்வொரு உறுப்புடனும்.

source: Addition of two tables acts as list concatination of the terms in each table (``+``).
ta_in: இரண்டு அட்டவணைகள் சேர்ப்பது ஒவ்வொரு அட்டவணையிலும் உள்ள சொற்களின் பட்டியல் இணைப்பாக செயல்படுகிறது (`` + ``).

source: Pauli tables can be sorted by lexicographic (tensor product) order or by Pauli weights (:meth:`~qiskit.quantum_info.PauliTable.sort`).
ta_in: பவுலி அட்டவணைகளை லெக்சோகிராஃபிக் (டென்சர் தயாரிப்பு) ஒழுங்கு அல்லது பவுலி எடைகள் (:meth: `~ qiskit.quantum_info.PauliTable.sort`) மூலம் வரிசைப்படுத்தலாம்.

source: Duplicate elements can be counted and deleted (:meth:`~qiskit.quantum_info.PauliTable.unique`).
ta_in: நகல் கூறுகளை எண்ணி நீக்கலாம் (:meth: `~ qiskit.quantum_info.PauliTable.unique`).

source: The PauliTable may be iterated over in either its native symplectic boolean array representation, as Pauli string labels (:meth:`~qiskit.quantum_info.PauliTable.label_iter`), or as dense Numpy array or sparse CSR matrices (:meth:`~qiskit.quantum_info.PauliTable.matrix_iter`).
ta_in: பவுலி சரம் லேபிள்கள் (:meth: `q qiskit.quantum_info.PauliTable.label_iter`), அல்லது அடர்த்தியான நம்பி வரிசை அல்லது சிதறிய சிஎஸ்ஆர் மெட்ரிக்குகள் (:meth:` ~ qiskit.quantum_info.PauliTable.matrix_iter`).

source: Checking commutation between elements of the Pauli table and another Pauli (:meth:`~qiskit.quantum_info.PauliTable.commutes`) or Pauli table (:meth:`~qiskit.quantum_info.PauliTable.commutes_with_all`)
ta_in: பவுலி அட்டவணையின் கூறுகளுக்கும் மற்றொரு பவுலிக்கும் இடையிலான பரிமாற்றத்தை சரிபார்க்கிறது (:meth: `~ qiskit.quantum_info.PauliTable.commutes`) அல்லது பவுலி அட்டவணை (:meth:` ~ qiskit.quantum_info.PauliTable.commutes_with_all`)

source: See the :class:`qiskit.quantum_info.PauliTable` class API documentation for additional details.
ta_in: கூடுதல் விவரங்களுக்கு: வகுப்பு: `qiskit.quantum_info.PauliTable` வகுப்பு API ஆவணங்களைக் காண்க.

source: Adds :class:`qiskit.quantum_info.StabilizerTable` class. This is a subclass of the :class:`qiskit.quantum_info.PauliTable` class which includes a boolean phase vector along with the Pauli table array. This represents a list of Stabilizer operators which are real-Pauli operators with +1 or -1 coefficient. Because the stabilizer matrices are real the ``"Y"`` label matrix is defined as ``[[0, 1], [-1, 0]]``. See the API documentation for additional information.
ta_in: சேர்க்கிறது: வகுப்பு: `qiskit.quantum_info.StabilizerTable` class. இது: வர்க்கம்: `qiskit.quantum_info.PauliTable` வகுப்பின் துணைப்பிரிவாகும், இதில் பவுலி அட்டவணை வரிசையுடன் பூலியன் கட்ட திசையன் அடங்கும். இது +1 அல்லது -1 குணகத்துடன் உண்மையான-பவுலி ஆபரேட்டர்களாக இருக்கும் நிலைப்படுத்தி ஆபரேட்டர்களின் பட்டியலைக் குறிக்கிறது. நிலைப்படுத்தி மெட்ரிக்குகள் உண்மையானவை என்பதால் `` "Y" `` லேபிள் மேட்ரிக்ஸ் `` [[0, 1], [-1, 0]] `` என வரையறுக்கப்படுகிறது. கூடுதல் தகவலுக்கு API ஆவணங்களைக் காண்க.

source: Adds :func:`qiskit.quantum_info.pauli_basis` function which returns an N-qubit Pauli basis as a :class:`qiskit.quantum_info.PauliTable` object. The ordering of this basis can either be by standard lexicographic (tensor product) order, or by the number of non-identity Pauli terms (weight).
ta_in: சேர்க்கிறது: func: `qiskit.quantum_info.pauli_basis` செயல்பாடு இது ஒரு N- குவிட் பவுலி அடிப்படையை ஒரு: வர்க்கமாக அளிக்கிறது:` qiskit.quantum_info.PauliTable` பொருள். இந்த அடிப்படையின் வரிசைமுறை நிலையான லெக்சோகிராஃபிக் (டென்சர் தயாரிப்பு) வரிசையால் அல்லது அடையாளமற்ற பவுலி சொற்களின் எண்ணிக்கையால் (எடை) இருக்கலாம்.

source: Adds :class:`qiskit.quantum_info.ScalarOp` operator class that represents a scalar multiple of an identity operator. This can be used to initialize an identity on arbitrary dimension subsystems and it will be implicitly converted to other ``BaseOperator`` subclasses (such as an :class:`qiskit.quantum_info.Operator` or :class:`qiskit.quantum_info.SuperOp`) when it is composed with, or added to, them.
ta_in: சேர்க்கிறது: வகுப்பு: `qiskit.quantum_info.ScalarOp` ஆபரேட்டர் வகுப்பு, இது ஒரு அடையாள ஆபரேட்டரின் அளவிடக்கூடிய பலவற்றைக் குறிக்கிறது. தன்னிச்சையான பரிமாண துணை அமைப்புகளில் ஒரு அடையாளத்தைத் தொடங்க இது பயன்படுத்தப்படலாம், மேலும் இது மறைமுகமாக மற்ற `` பேஸ் ஆபரேட்டர்`` துணைப்பிரிவுகளுக்கு மாற்றப்படும் (ஒரு: வகுப்பு: `qiskit.quantum_info.Operator` அல்லது: வகுப்பு:` qiskit.quantum_info.SuperOp `) அது அவர்களுடன் இயற்றப்படும்போது அல்லது சேர்க்கப்படும்போது.

source: Example: Identity operator
ta_in: எடுத்துக்காட்டு: அடையாளம் செய்பவர்

source: A new method, :meth:`~qiskit.quantum_info.Operator.reshape`, has been added to the :class:`qiskit.quantum_innfo.Operator` class that returns a shallow copy of an operator subclass with reshaped subsystem input or output dimensions. The combined dimensions of all subsystems must be the same as the original operator or an exception will be raised.
ta_in: புதிய முறை: . அனைத்து துணை அமைப்புகளின் ஒருங்கிணைந்த பரிமாணங்கள் அசல் ஆபரேட்டருக்கு சமமாக இருக்க வேண்டும் அல்லது விதிவிலக்கு எழுப்பப்படும்.

source: Adds :func:`qiskit.quantum_info.random_clifford` for generating a random :class:`qiskit.quantum_info.Clifford` operator.
ta_in: சேர்க்கிறது: func: ஒரு சீரற்றதை உருவாக்குவதற்கு `qiskit.quantum_info.random_clifford`: வகுப்பு:` qiskit.quantum_info.Clifford` Operator.

source: Add :func:`qiskit.quantum_info.random_quantum_channel` function for generating a random quantum channel with fixed :class:`~qiskit.quantum_info.Choi`-rank in the :class:`~qiskit.quantum_info.Stinespring` representation.
ta_in: சேர்: func: நிலையான: வர்க்கத்துடன் ஒரு சீரற்ற குவாண்டம் சேனலை உருவாக்குவதற்கான `qiskit.quantum_info.random_quantum_channel` செயல்பாடு:`: qiskit.quantum_info.Choi`- தரவரிசை: வகுப்பில்: `~ qiskit.quantum_info.Stinespring` பிரதிநிதித்துவம்.

source: Add :func:`qiskit.quantum_info.random_hermitian` for generating a random Hermitian :class:`~qiskit.quantum_info.Operator`.
ta_in: சேர்: func: `qiskit.quantum_info.random_hermitian` ஒரு சீரற்ற ஹெர்மிடியன் உருவாக்க: வகுப்பு:` ~ qiskit.quantum_info.Operator`.

source: Add :func:`qiskit.quantum_info.random_statevector` for generating a random :class:`~qiskit.quantum_info.Statevector`.
ta_in: சேர்: func: ஒரு சீரற்றதை உருவாக்குவதற்கு `qiskit.quantum_info.random_statevector`: வகுப்பு:` ~ qiskit.quantum_info.Statevector`.

source: Adds :func:`qiskit.quantum_info.random_pauli_table` for generating a random :class:`qiskit.quantum_info.PauliTable`.
ta_in: சேர்க்கிறது: func: ஒரு சீரற்றதை உருவாக்குவதற்கு `qiskit.quantum_info.random_pauli_table`: வகுப்பு:` qiskit.quantum_info.PauliTable.

source: Adds :func:`qiskit.quantum_info.random_stabilizer_table` for generating a random :class:`qiskit.quantum_info.StabilizerTable`.
ta_in: சேர்க்கிறது: func: `qiskit.quantum_info.random_stabilizer_table` ஒரு சீரற்றதை உருவாக்குவதற்கு: வகுப்பு:` qiskit.quantum_info.StabilizerTable`.

source: Add a ``num_qubits`` attribute to :class:`qiskit.quantum_info.StateVector` and :class:`qiskit.quantum_info.DensityMatrix` classes. This returns the number of qubits for N-qubit states and returns ``None`` for non-qubit states.
ta_in: வகுப்புக்கு `` num_qubits`` பண்புக்கூறு சேர்க்கவும்: `qiskit.quantum_info.StateVector` மற்றும்: class:` qiskit.quantum_info.DensityMatrix` வகுப்புகள். இது என்-குவிட் மாநிலங்களுக்கான குவிட்களின் எண்ணிக்கையைத் தருகிறது மற்றும் க்விட் அல்லாத மாநிலங்களுக்கு `` எதுவுமில்லை``.

source: Adds :meth:`~qiskit.quantum_info.Statevector.to_dict` and :meth:`~qiskit.quantum_info.DensityMatrix.to_dict` methods to convert :class:`qiskit.quantum_info.Statevector` and :class:`qiskit.quantum_info.DensityMatrix` objects into Bra-Ket notation dictionary.
ta_in: சேர்க்கிறது: மெத்: `~ qiskit.quantum_info.Statevector.to_dict` மற்றும்: மெத்:` ~ qiskit.quantum_info.DensityMatrix.to_dict` மாற்றுவதற்கான முறைகள்: வகுப்பு: `qiskit.quantum_info.Statevector` மற்றும்: class:` qiskit.quant. ப்ரான்-கெட் குறியீட்டு அகராதியில் டென்சிட்டிமேட்ரிக்ஸின் பொருள்கள்.

source: Example
ta_in: உதாரணமாக

source: Adds :meth:`~qiskit.quantum_info.Statevector.probabilities` and :meth:`~qiskit.quantum_info.DensityMatrix.probabilities` to :class:`qiskit.quantum_info.Statevector` and :class:`qiskit.quantum_info.DensityMatrix` classes which return an array of measurement outcome probabilities in the computational basis for the specified subsystems.
ta_in: சேர்க்கிறது: மெத்: `~ qiskit.quantum_info.Statevector.probilities` மற்றும்: மெத்:` ~ qiskit.quantum_info.DensityMatrix.probables` to: class: `qiskit.quantum_info.Statevector` மற்றும்: class:` qiskit.quantum_in. குறிப்பிட்ட துணை அமைப்புகளுக்கான கணக்கீட்டு அடிப்படையில் அளவீட்டு விளைவு நிகழ்தகவுகளின் வரிசையை வழங்கும் வகுப்புகள்.

source: Adds :meth:`~qiskit.quantum_info.Statevector.probabilities_dict` and :meth:`~qiskit.quantum_info.DensityMatrix.probabilities_dict` to :class:`qiskit.quantum_info.Statevector` and :class:`qiskit.quantum_info.DensityMatrix` classes which return a count-style dictionary array of measurement outcome probabilities in the computational basis for the specified subsystems.
ta_in: சேர்க்கிறது: மெத்: `~ qiskit.quantum_info.Statevector.probilities` மற்றும்: மெத்:` ~ qiskit.quantum_info.DensityMatrix.probables` to: class: `qiskit.quantum_info.Statevector` மற்றும்: class:` qiskit.quantum_in. குறிப்பிட்ட துணை அமைப்புகளுக்கான கணக்கீட்டு அடிப்படையில் அளவீட்டு விளைவு நிகழ்தகவுகளின் வரிசையை வழங்கும் வகுப்புகள்.

source: Add :meth:`~qiskit.quantum_info.Statevector.sample_counts` and :meth:`~qiskit.quantum_info.Statevector.sample_memory` methods to the :class:`~qiskit.quantum_info.Statevector` and :class:`~qiskit.quantum_info.DensityMatrix` classes for sampling measurement outcomes on subsystems.
ta_in: சேர்: மெத்: `~ qiskit.quantum_info.Statevector.sample_counts` மற்றும்: மெத்:` ~ qiskit.quantum_info.Statevector.sample_memory` முறைகள்: வகுப்பிற்கு: `~ qiskit.quantum_info.Statevector` மற்றும்: வகுப்பு:` ~ qisk. குவாண்டம்_இன்ஃபோ.டென்சிட்டி மேட்ரிக்ஸின் வகுப்புகள் துணை அமைப்புகளில் அளவீட்டு விளைவுகளை மாதிரிப்படுத்துகின்றன.

source: Generate a counts dictionary by sampling from a statevector
ta_in: ஒரு ஸ்டேட்வெக்டரிடமிருந்து மாதிரி எடுப்பதன் மூலம் ஒரு எண்ணிக்கையிலான அகராதியை உருவாக்கவும்

source: Return the array of measurement outcomes for each sample
ta_in: ஒவ்வொரு மாதிரிக்கும் அளவீட்டு விளைவுகளின் வரிசையைத் தரவும்

source: Adds a :meth:`~qiskit.quantum_info.Statevector.measure` method to the :class:`qiskit.quantum_info.Statevector` and :class:`qiskit.quantum_info.DensityMatrix` quantum state classes. This allows sampling a single measurement outcome from the specified subsystems and collapsing the statevector to the post-measurement computational basis state. For example
ta_in: A :meth:` ~ qiskit.quantum_info.Statevector.मापन ` method to the :class:` qiskit.quantum_info.Statevector ` and :class:` qiskit.quantum_info.DensityMatrix ` quantum state classes. இது குறிப்பிட்ட துணைமுறைகளிலிருந்து ஒற்றை அளவிலான முடிவுகளைக் கொண்டு ஒரே அளவைக் கணக்கிட அனுமதிக்கிறது. எடுத்துக்காட்டாக

source: Adds a :meth:`~qiskit.quantum_info.Statevector.reset` method to the :class:`qiskit.quantum_info.Statevector` and :class:`qiskit.quantum_info.DensityMatrix` quantum state classes. This allows reseting some or all subsystems to the :math:`|0\rangle` state. For example
ta_in: ஒரு: மெத்: `~ qiskit.quantum_info.Statevector.reset` முறையை: வகுப்பில் சேர்க்கிறது:` qiskit.quantum_info.Statevector` மற்றும்: வகுப்பு: `qiskit.quantum_info.DensityMatrix` குவாண்டம் மாநில வகுப்புகள். இது சில அல்லது அனைத்து துணை அமைப்புகளையும்: கணித: `| 0 \ ரேங்கிள்` நிலைக்கு மீட்டமைக்க அனுமதிக்கிறது. உதாரணத்திற்கு.

source: A new visualization function :func:`qiskit.visualization.visualize_transition` for visualizing single qubit gate transitions has been added. It takes in a single qubit circuit and returns an animation of qubit state transitions on a Bloch sphere. To use this function you must have installed the dependencies for and configured globally a matplotlib animtion writer. You can refer to the `matplotlib documentation <https://matplotlib.org/api/animation_api.html#writer-classes>`_ for more details on this. However, in the default case simply ensuring that `FFmpeg <https://www.ffmpeg.org/>`_ is installed is sufficient to use this function.
ta_in: ஒரு புதிய காட்சிப்படுத்தல் செயல்பாடு: func: ஒற்றை குயிட் கேட் மாற்றங்களைக் காட்சிப்படுத்த `qiskit.visualization.visualize_transition` சேர்க்கப்பட்டுள்ளது. இது ஒரு குவிட் சுற்றுக்கு எடுத்து, ஒரு ப்ளொச் கோளத்தில் குவிட் நிலை மாற்றங்களின் அனிமேஷனை வழங்குகிறது. இந்த செயல்பாட்டைப் பயன்படுத்த நீங்கள் உலகளவில் ஒரு மேட்லோட்லிப் அனிமேஷன் எழுத்தாளருக்கான சார்புகளை நிறுவி கட்டமைத்திருக்க வேண்டும். இது குறித்த கூடுதல் விவரங்களுக்கு `matplotlib ஆவணங்கள் <https://matplotlib.org/api/animation_api.html#writer-classes>` _ ஐப் பார்க்கவும். இருப்பினும், இயல்புநிலை வழக்கில் `FFmpeg <https://www.ffmpeg.org/>` _ நிறுவப்பட்டிருப்பதை உறுதிசெய்வது இந்த செயல்பாட்டைப் பயன்படுத்த போதுமானது.

source: It supports circuits with the following gates:
ta_in: இது பின்வரும் வாயில்களுடன் சேர்க்கையை ஆதரிக்கிறது:

source: :func:`~qiskit.execute.execute` has a new kwarg ``schedule_circuit``. By setting ``schedule_circuit=True`` this enables scheduling of the circuit into a :class:`~qiskit.pulse.Schedule`. This allows users building :class:`qiskit.circuit.QuantumCircuit` objects to make use of custom scheduler methods, such as the ``as_late_as_possible`` and ``as_soon_as_possible`` methods. For example::
ta_in: : func: `~ qiskit.execute.execute` இல் ஒரு புதிய குவார்க் உள்ளது` `அட்டவணை_சர்க்யூட்``. `` Schedule_circuit = True`` ஐ அமைப்பதன் மூலம் இது ஒரு: வகுப்பில் சுற்றுவட்டத்தை திட்டமிட உதவுகிறது: `~ qiskit.pulse.Schedule`. இது பயனர்களை உருவாக்க அனுமதிக்கிறது: வகுப்பு: `qiskit.circuit.QuantumCircuit` பொருள்கள்` `as_late_as_possible`` மற்றும்` `as_soon_as_possible`` முறைகள் போன்ற தனிப்பயன் திட்டமிடல் முறைகளைப் பயன்படுத்த. உதாரணத்திற்கு::

source: A new environment variable ``QISKIT_SUPPRESS_PACKAGING_WARNINGS`` can be set to ``Y`` or ``y`` which will suppress the warnings about ``qiskit-aer`` and ``qiskit-ibmq-provider`` not being installed at import time. This is useful for users who are only running qiskit-terra (or just not qiskit-aer and/or qiskit-ibmq-provider) and the warnings are not an indication of a potential packaging problem. You can set the environment variable to ``N`` or ``n`` to ensure that warnings are always enabled even if the user config file is set to disable them.
ta_in: ஒரு புதிய சூழல் மாறி `` QISKIT_SUPPRESS_PACKAGING_WARNINGS`` ஐ `` Y`` அல்லது `` y`` என அமைக்கலாம், இது `` கிஸ்கிட்-ஏர்`` மற்றும் `` கிஸ்கிட்-இப்மக்-வழங்குநர்`` நிறுவப்படவில்லை பற்றிய எச்சரிக்கைகளை அடக்கும். இறக்குமதி நேரத்தில். கிஸ்கிட்-டெர்ராவை மட்டுமே இயக்கும் பயனர்களுக்கு இது பயனுள்ளதாக இருக்கும் (அல்லது கிஸ்கிட்-ஏர் மற்றும் / அல்லது கிஸ்கிட்-இப்மக்-வழங்குநர் அல்ல) மற்றும் எச்சரிக்கைகள் சாத்தியமான பேக்கேஜிங் சிக்கலின் அறிகுறியாக இல்லை. பயனர் உள்ளமைவு கோப்பு அவற்றை முடக்க அமைக்கப்பட்டிருந்தாலும் எச்சரிக்கைகள் எப்போதும் இயக்கப்பட்டிருப்பதை உறுதிசெய்ய நீங்கள் சூழல் மாறியை `` N`` அல்லது `` n`` என அமைக்கலாம்.

source: A new user config file option, ``suppress_packaging_warnings`` has been added. When set to ``true`` in your user config file like::
ta_in: புதிய பயனர் வடிவமைப்பு கோப்பு தேர்வு ` ` suppress_packaging_warnings ` ` சேர்க்கப்பட்டது. உங்கள் பயனர் வடிவமைப்பு கோப்பில் ` ` உண்மையான ` ` ` உண்மையில் அமைக்கும்போது::

source: it will suppress the warnings about ``qiskit-aer`` and ``qiskit-ibmq-provider`` not being installed at import time. This is useful for users who are only running qiskit-terra (or just not qiskit-aer and/or qiskit-ibmq-provider) and the warnings are not an indication of a potential packaging problem. If the user config file is set to disable the warnings this can be overriden by setting the ``QISKIT_SUPPRESS_PACKAGING_WARNINGS`` to ``N`` or ``n``
ta_in: இது ` qiskit-aer ` ` மற்றும் ` qiskit-ibmq-வழங்குபவர் ` ` இறக்குமதி நேரத்தில் நிறுவப்படவில்லை. இது பயனர்கள் பயனர்களுக்கு மட்டுமே qiskit-terra (அல்லது qiskit-aer and/or qiskit-ibmq-வழங்குபவர்) மட்டுமே இயங்கும் பயனர்களுக்கு பயன்படுகிறது. பயனர் வடிவமைப்பு கோப்பு எச்சரிக்கை நீக்குவதற்கு அமைக்கப்பட்டால், ` ` QISKIT_ SUPPRESS_PACKAGING_WARNINGS" to "N" or "n"

source: :func:`qiskit.compiler.transpile()` has two new kwargs, ``layout_method`` and ``routing_method``. These allow you to select a particular method for placement and routing of circuits on constrained architectures. For, example::
ta_in: :func:` qiskit.compiler.transpile () ` has two new kwargs, ` ` layout_method ` ` and ` routing_method ` `. இவை நீங்கள் ஒரு குறிப்பிட்ட முறையை தேர்ந்தெடுக்க அனுமதிக்கிறது. உதாரணமாக::

source: will run :class:`~qiskit.transpiler.passes.DenseLayout` layout pass and :class:`~qiskit.transpiler.passes.LookaheadSwap` routing pass.
ta_in: இயங்கும்:class: `~ qiskit.transpiler.passes.DenseLayout` தளவமைப்பு பாஸ் மற்றும்:class:` ~ qiskit.transpiler.passes.LookaheadSwap` ரூட்டிங் பாஸ்.

source: There has been a significant simplification to the style in which Pulse instructions are built.
ta_in: துடிப்பு அறிவுறுத்தல்கள் கட்டமைக்கப்பட்ட பாணியில் குறிப்பிடத்தக்க எளிமைப்படுத்தல் செய்யப்பட்டுள்ளது.

source: With the previous style, ``Command`` s were called with channels to make an :py:class:`~qiskit.pulse.instructions.Instruction`. The usage of both commands and instructions was a point of confusion. This was the previous style::
ta_in: முந்தைய பாணியுடன், `` கட்டளை` கள் சேனல்களுடன் ஒரு: py: class: `~ qiskit.pulse.instructions.Instruction` ஐ உருவாக்க அழைக்கப்பட்டன. கட்டளைகள் மற்றும் அறிவுறுத்தல்கள் இரண்டின் பயன்பாடு குழப்பமான ஒரு புள்ளியாக இருந்தது. இது முந்தைய பாணி::

source: or, equivalently (though less used)::
ta_in: அல்லது, சமமாக (குறைவாகப் பயன்படுத்தப்பட்டாலும்)::

source: Now, rather than build a command *and* an instruction, each command has been migrated into an instruction::
ta_in: இப்போது, ​​ஒரு கட்டளை * and * ஒரு வழிமுறையை உருவாக்குவதற்கு பதிலாக, ஒவ்வொரு கட்டளையும் ஒரு அறிவுறுத்தலாக மாற்றப்பட்டுள்ளது::

source: There is now a :py:class:`~qiskit.pulse.instructions.Play` instruction which takes a description of a pulse envelope and a channel. There is a new :py:class:`~qiskit.pulse.pulse_lib.Pulse` class in the :mod:`~qiskit.pulse.pulse_lib` from which the pulse envelope description should subclass.
ta_in: இப்போது ஒரு: py: class: `~ qiskit.pulse.instructions.Play` அறிவுறுத்தல் உள்ளது, இது ஒரு துடிப்பு உறை மற்றும் ஒரு சேனலின் விளக்கத்தை எடுக்கும். ஒரு புதிய: py: class: `~ qiskit.pulse.pulse_lib.Pulse` class: mod:` ~ qiskit.pulse.pulse_lib` இல் இருந்து துடிப்பு உறை விளக்கம் துணைப்பிரிவாக இருக்க வேண்டும்.பல்ஸ்.

source: The :class:`qiskit.dagcircuit.DAGNode` method ``pop`` which was deprecated in the 0.9.0 release has been removed. If you were using this method you can leverage Python's ``del`` statement or ``delattr()`` function to perform the same task.
ta_in: 0.9.0 வெளியீட்டில் நீக்கப்பட்ட: வகுப்பு: `qiskit.dagcircuit.DAGNode` முறை` `பாப்`` அகற்றப்பட்டது. நீங்கள் இந்த முறையைப் பயன்படுத்துகிறீர்கள் என்றால், அதே பணியைச் செய்ய பைத்தானின் `` டெல்`` அறிக்கை அல்லது `` டெலட்ர் () `` செயல்பாட்டைப் பயன்படுத்தலாம்.

source: A new optional visualization requirement, `pygments <https://pygments.org/>`_ , has been added. It is used for providing syntax highlighting of OpenQASM 2.0 code in Jupyter widgets and optionally for the :meth:`qiskit.circuit.QuantumCircuit.qasm` method. It must be installed (either with ``pip install pygments`` or ``pip install qiskit-terra[visualization]``) prior to using the ``%circuit_library_info`` widget in :mod:`qiskit.tools.jupyter` or the ``formatted`` kwarg on the :meth:`~qiskit.circuit.QuantumCircuit.qasm` method.
ta_in: ஒரு புதிய விருப்பமான விசைவு தேவை, ` pygments <https://pygments.org/>` _, சேர்க்கப்பட்டுள்ளது. :meth:` qiskit.circuit.QuantumCircuit.qasm ` முறையின்படி (210-10-012 ` qiskit.circuit.QuantumCircuit.qasm) வழிவகுப்பில் OpenQASM 2.0 குறியீடு (OpenQASM) 2.0 குறியீட்டை வழங்குவதற்கு பயன்படுகிறது. இது நிறுவப்பட்டிருக்க வேண்டும் (` ` pip install pygments ` ` அல்லது ` pip install qiskit-terra[visualization]` `) முன் ` `%circuit_library_info ` ` widget in :mod:` qiskit.tools.jupyter ` or the ` formatted ` ` kwarg on the :meth:` ~ qiskit.circuit.QuantumCircuit.qasm ` method.

source: The pulse ``buffer`` option found in :class:`qiskit.pulse.Channel` and :class:`qiskit.pulse.Schedule` was deprecated in Terra 0.11.0 and has now been removed. To add a delay on a channel or in a schedule, specify it explicitly in your Schedule with a Delay::
ta_in: துடிப்பு `` இடையக`` விருப்பம்: வர்க்கம்: `qiskit.pulse.Channel` மற்றும்: class:` qiskit.pulse.Schedule` டெர்ரா 0.11.0 இல் நீக்கப்பட்டது, இப்போது அகற்றப்பட்டது. சேனலில் அல்லது ஒரு அட்டவணையில் தாமதத்தைச் சேர்க்க, தாமதத்துடன் உங்கள் அட்டவணையில் அதை வெளிப்படையாகக் குறிப்பிடவும்::

source: ``PulseChannelSpec``, which was deprecated in Terra 0.11.0, has now been removed. Use BackendConfiguration instead::
ta_in: டெர்ரா 0.11.0 இல் நீக்கப்பட்ட `` பல்ஸ் சேனல்ஸ்பெக்`` இப்போது அகற்றப்பட்டது. அதற்கு பதிலாக பின்தளத்தில் உள்ளமைவைப் பயன்படுத்தவும்::

source: or, simply reference the channel directly, such as ``DriveChannel(index)``.
ta_in: அல்லது, சரியாக வழி நேரடியாக, ` DriveChannel (index) ` `.
