Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: The :mod:`qiskit.visualization` function :func:`~qiskit.visualization.plot_state_qsphere` has a new kwarg ``use_degrees`` which is set to ``False`` by default. When set to ``True`` it displays the phase of each basis state in degrees, along with the phase circle at the bottom right.
ta_in: தி: மோட்: `qiskit.visualization` செயல்பாடு: func:` ~ qiskit.visualization.plot_state_qsphere` இல் ஒரு புதிய குவார்க் உள்ளது `` use_degrees`` இது இயல்பாக `` தவறு`` என அமைக்கப்பட்டுள்ளது. `` உண்மை`` என அமைக்கப்பட்டால், அது ஒவ்வொரு அடிப்படை நிலையின் கட்டத்தையும் டிகிரிகளில் காண்பிக்கும், அதோடு கீழ் வலதுபுறத்தில் உள்ள வட்ட வட்டமும் இருக்கும்.

source: A new class, :class:`~qiskit.circuit.library.QuadraticForm` to the :mod:`qiskit.circuit.library` module for implementing a a quadratic form on binary variables. The circuit library element implements the operation
ta_in: ஒரு புதிய வகுப்பு ,: வகுப்பு: `~ qiskit.circuit.library.QuadraticForm` க்கு: mod:` qiskit.circuit.library` தொகுதிக்கு பைனரி மாறிகள் மீது இருபடி வடிவத்தை செயல்படுத்த. சுற்று நூலக உறுப்பு செயல்பாட்டை செயல்படுத்துகிறது

source: |x\rangle |0\rangle \mapsto |x\rangle |Q(x) \mod 2^m\rangle
ta_in: |x\rகோணம் | 0\rகோணம் \mapsto |x\rகோணம் | Q (x) \mod 2 ^ m\rகோணம்

source: for the quadratic form :math:`Q` and :math:`m` output qubits. The result is in the :math:`m` output qubits is encoded in two's complement. If :math:`m` is not specified, the circuit will choose the minimal number of qubits required to represent the result without applying a modulo operation. The quadratic form is specified using a matrix for the quadratic terms, a vector for the linear terms and a constant offset. If all terms are integers, the circuit implements the quadratic form exactly, otherwise it is only an approximation.
ta_in: ஒரு புதிய வகுப்பு ,: வகுப்பு: `~ qiskit.circuit.library.QuadraticForm` க்கு: இருபடி வடிவத்தை மாற்றியமைக்கவும்: கணிதம்:` Q` மற்றும்: கணிதம்: `ம் ` வெளியீடு குவிட்ஸ். இதன் விளைவாக: கணிதத்தில் உள்ளது: `ம் ` வெளியீட்டு குபிட்கள் இருவரின் நிரப்புதலில் குறியாக்கம் செய்யப்பட்டுள்ளன. கணிதம்: `மீ` குறிப்பிடப்படவில்லை எனில், ஒரு மட்டு ஓபராவைப் பயன்படுத்தாமல் முடிவை பிரதிநிதித்துவப்படுத்த தேவையான குறைந்தபட்ச எண்ணிக்கையிலான சுற்றுக்களை சுற்று தேர்வு செய்யும்: பைனரி மாறிகள் மீது இருபடி வடிவத்தை செயல்படுத்த` qiskit.circuit.library` தொகுதி. சுற்று நூலக உறுப்பு செயல்பாட்டை செயல்படுத்துகிறது.

source: Add :meth:`qiskit.quantum_info.Statevector.expectation_value` and :meth:`qiskit.quantum_info.DensityMatrix.expectation_value` methods for computing the expectation value of an :class:`qiskit.quantum_info.Operator`.
ta_in: சேர்: மெத்: `qiskit.quantum_info.Statevector.expectation_value` மற்றும்: மெத்:` qiskit.quantum_info.DensityMatrix.expectation_value` ஒரு: வகுப்பின் எதிர்பார்ப்பு மதிப்பைக் கணக்கிடுவதற்கான முறைகள்: `qiskit.quantum_info.Operator`.

source: For the ``seed`` kwarg in the constructor for :class:`qiskit.circuit.library.QuantumVolume` `numpy random Generator objects <https://numpy.org/doc/stable/reference/random/generator.html>`__ can now be used. Previously, only integers were a valid input. This is useful when integrating :class:`~qiskit.circuit.library.QuantumVolume` as part of a larger function with its own random number generation, e.g. generating a sequence of :class:`~qiskit.circuit.library.QuantumVolume` circuits.
ta_in: இதற்கான கட்டமைப்பாளரின் `` விதை`` குவார்க்குக்கு: வகுப்பு: `qiskit.circuit.library.QuantumVolume`` எண்ணற்ற சீரற்ற ஜெனரேட்டர் பொருள்கள் <https://numpy.org/doc/stable/reference/random/generator.html> `__ இப்போது பயன்படுத்தலாம். முன்னதாக, முழு எண்கள் மட்டுமே சரியான உள்ளீடாக இருந்தன. ஒருங்கிணைக்கும் போது இது பயனுள்ளதாக இருக்கும்: வகுப்பு : `~ qiskit.circuit.library.QuantumVolume` அதன் சொந்த சீரற்ற எண் தலைமுறையுடன் ஒரு பெரிய செயல்பாட்டின் ஒரு பகுதியாக, எ.கா. வர்க்கத்தின் வரிசையை உருவாக்குகிறது: `~ qiskit.circuit.library.QuantumVolume` சுற்றுகள்.

source: The :class:`~qiskit.circuit.QuantumCircuit` method :meth:`~qiskit.circuit.QuantumCircuit.compose` has a new kwarg ``front`` which can be used for prepending the other circuit before the origin circuit instead of appending. For example:
ta_in: வகுப்பு: `~ qiskit.circuit.QuantumCircuit` முறை: மெத்:` ~ qiskit.circuit.QuantumCircuit.compose` ஒரு புதிய குவார்க் `` முன்`` ஐக் கொண்டுள்ளது, இது பிற சுற்றுக்கு பதிலாக பிற சுற்றுக்கு முன்னதாக தயாரிக்க பயன்படுகிறது சேர்க்கிறது. உதாரணத்திற்கு:

source: Two new passes, :class:`~qiskit.transpiler.passes.SabreLayout` and :class:`~qiskit.transpiler.passes.SabreSwap` for layout and routing have been added to :mod:`qiskit.transpiler.passes`. These new passes are based on the algorithm presented in Li et al., "Tackling the Qubit Mapping Problem for NISQ-Era Quantum Devices", ASPLOS 2019. They can also be selected when using the :func:`~qiskit.compiler.transpile` function by setting the ``layout_method`` kwarg to ``'sabre'`` and/or the ``routing_method`` to ``'sabre'`` to use :class:`~qiskit.transpiler.passes.SabreLayout` and :class:`~qiskit.transpiler.passes.SabreSwap` respectively.
ta_in: இரண்டு புதிய பாஸ்கள் ,:class: `~ qiskit.transpiler.passes.SabreLayout` மற்றும்:class:` ~ qiskit.transpiler.passes.SabreSwap` தளவமைப்பு மற்றும் ரூட்டிங் சேர்க்கப்பட்டுள்ளது:mod: `qiskit.transpiler.passes`. இந்த புதிய பாஸ்கள் லி மற்றும் பலர், "Tackling the Qubit Mapping Problem for NISQ-Era Quantum Devices", ASPLOS 2019 இல் வழங்கப்பட்ட வழிமுறையை அடிப்படையாகக் கொண்டவை. :func: `q qiskit.compiler.transpile ஐப் பயன்படுத்தும் போது அவை தேர்ந்தெடுக்கப்படலாம். ``layout_method`` குவார்க்கை `` 'sabre'` மற்றும் / அல்லது `` routing_method`` ஐ ``' sabre'''க்கு அமைப்பதன் மூலம் செயல்பட:class: `~ qiskit.transpiler.passes.SabreLayout `மற்றும்:class: முறையே` q qiskit.transpiler.passes.SabreSwap`.

source: Added the method :meth:`~qiskit.pulse.Schedule.replace` to the :class:`qiskit.pulse.Schedule` class which allows a pulse instruction to be replaced with another. For example::
ta_in: வழிமுறை :meth:` ~ qiskit.pulse.Schedule.replace ` to the :class:` qiskit.pulse.Schedule ` வகுப்பு, இது ஒரு துடிப்பு அறிவுறுத்தலை மற்றொரு இடத்திற்கு மாற்ற அனுமதிக்கிறது. உதாரணமாக::

source: from qiskit import pulse
ta_in: qiskit இறக்குமதி துடிப்பு இருந்து

source: Added new gate classes to :mod:`qiskit.circuit.library` for the :math:`\sqrt{X}`, its adjoint :math:`\sqrt{X}^\dagger`, and controlled :math:`\sqrt{X}` gates as :class:`~qiskit.circuit.library.SXGate`, :class:`~qiskit.circuit.library.SXdgGate`, and :class:`~qiskit.circuit.library.CSXGate`. They can also be added to a :class:`~qiskit.circuit.QuantumCircuit` object using the :meth:`~qiskit.circuit.QuantumCircuit.sx`, :meth:`~qiskit.circuit.QuantumCircuit.sxdg`, and :meth:`~qiskit.circuit.QuantumCircuit.csx` respectively.
ta_in: புதிய கேட் வகுப்புகளை இவற்றுக்குச் சேர்த்தது:mod: `qiskit.circuit.library` க்கு :math:` \ sqrt {X}`, அதன் சரிசெய்தல்:math: `\ sqrt {X} ^ ag dagger`, மற்றும் கட்டுப்படுத்தப்பட்ட:math:` \ sqrt {X} `வாயில்கள்:class:` ~ qiskit.circuit.library.SXGate` ,:class: `~ qiskit.circuit.library.SXdgGate`, மற்றும் :class:` ~ qiskit.circuit.library.CSXGate` . அவற்றை:class: `~ qiskit.circuit.QuantumCircuit` பொருளைப் பயன்படுத்தி:meth:` ~ qiskit.circuit.QuantumCircuit.sx` ,:meth: `~ qiskit.circuit.QuantumCircuit.sxdg`, மற்றும் :meth: `~ qiskit.circuit.QuantumCircuit.csx` முறையே.

source: Add support for :class:`~qiskit.circuit.Reset` instructions to :meth:`qiskit.quantum_info.Statevector.from_instruction`. Note that this involves RNG sampling in choosing the projection to the zero state in the case where the qubit is in a superposition state. The seed for sampling can be set using the :meth:`~qiskit.quantum_info.Statevector.seed` method.
ta_in: :class:` ~ qiskit.circuit.Reset ` வழிமுறையை :meth:` qiskit.quiskit.quantum_info.Statevector.from_instruction` க்கு ஆதரவு சேர்க்கவும். குறிப்பு குவிட் ஒரு சூப்பர் போசிஷன் நிலையில் இருக்கும் விஷயத்தில் பூஜ்ஜிய நிலைக்குத் திட்டத்தைத் தேர்ந்தெடுப்பதில் ஆர்.என்.ஜி மாதிரியை இது உள்ளடக்குகிறது என்பதை நினைவில் கொள்க. சாம்ப்டிங் க்கு விதி :meth:` ~ qiskit.quantum_info.Statevector.seed ` முறையைப் பயன்படுத்தி அமைக்கலாம்.

source: The methods :meth:`qiskit.circuit.ParameterExpression.subs` and :meth:`qiskit.circuit.QuantumCircuit.assign_parameters` now accept :class:`~qiskit.circuit.ParameterExpression` as the target value to be substituted.
ta_in: முறைகள் :meth:` qiskit.circuit.ParameterExpression.subs ` and :meth:` qiskit.circuit.QuantumCircuit.Quiskit.QuantumCircuit.pres_parameters ` இப்போது :class:` ~ qiskit.circuit.ParameterExpression ` இலக்கு மதிப்பு மாற்றாக.

source: The :meth:`~qiskit.circuit.QuantumCircuit` method :meth:`~qiskit.circuit.QuantumCircuit.to_gate` has a new kwarg ``label`` which can be used to set a label for for the output :class:`~qiskit.circuit.Gate` object. For example:
ta_in: தி:meth: `~ qiskit.circuit.QuantumCircuit` முறை:meth:` ~ qiskit.circuit.QuantumCircuit.to_gate` இல் ஒரு புதிய குவார்க் உள்ளது `` label`` இது வெளியீட்டிற்கான லேபிளை அமைக்கப் பயன்படுகிறது:class: `~ qiskit.circuit.Gate` பொருள். உதாரணத்திற்கு:

source: Added the :class:`~qiskit.circuit.library.UGate`, :class:`~qiskit.circuit.library.CUGate`, :class:`~qiskit.circuit.library.PhaseGate`, and :class:`~qiskit.circuit.library.CPhaseGate` with the corresponding :class:`~qiskit.circuit.QuantumCircuit` methods :meth:`~qiskit.circuit.QuantumCircuit.u`, :meth:`~qiskit.circuit.QuantumCircuit.cu`, :meth:`~qiskit.circuit.QuantumCircuit.p`, and :meth:`~qiskit.circuit.QuantumCircuit.cp`. The :class:`~qiskit.circuit.library.UGate` gate is the generic single qubit rotation gate with 3 Euler angles and the :class:`~qiskit.circuit.library.CUGate` gate its controlled version. :class:`~qiskit.circuit.library.CUGate` has 4 parameters to account for a possible global phase of the U gate. The :class:`~qiskit.circuit.library.PhaseGate` and :class:`~qiskit.circuit.library.CPhaseGate` gates are the general Phase gate at an arbitrary angle and it's controlled version.
ta_in: சேர்க்கப்பட்டது: வகுப்பு: `~ qiskit.circuit.library.UGate` ,: வகுப்பு:` ~ qiskit.circuit.library.CUGate` ,: வகுப்பு: `~ qiskit.circuit.library.PhaseGate`, மற்றும்: வகுப்பு:` ~ qiskit.circuit.library.CPhaseGate` உடன் தொடர்புடையது: வகுப்பு: `~ qiskit.circuit.QuantumCircuit` முறைகள்: மெத்:` ~ qiskit.circuit.QuantumCircuit.u` ,: மெத்: `~ qiskit.circuit.QuantumCircuit.cucu` ,: மெத்: `~ qiskit.circuit.QuantumCircuit.p`, மற்றும்: மெத்:` ~ qiskit.circuit.QuantumCircuit.cp`. வகுப்பு: `~ qiskit.circuit.library.UGate` கேட் என்பது 3 யூலர் கோணங்களைக் கொண்ட பொதுவான ஒற்றை குவிட் சுழற்சி வாயில் மற்றும்: வர்க்கம்:` ~ qiskit.circuit.library.CUGate` கேட் அதன் கட்டுப்படுத்தப்பட்ட பதிப்பு. : வகுப்பு: `~ qiskit.circuit.library.CUGate` க்கு U வாயிலின் சாத்தியமான உலகளாவிய கட்டத்தைக் கணக்கிட 4 அளவுருக்கள் உள்ளன. வகுப்பு: `~ qiskit.circuit.library.PhaseGate` மற்றும்: வகுப்பு:` ~ qiskit.circuit.library.CPhaseGate` வாயில்கள் ஒரு தன்னிச்சையான கோணத்தில் பொதுவான கட்ட வாயில் மற்றும் அது கட்டுப்படுத்தப்பட்ட பதிப்பு.

source: A new kwarg, ``cregbundle`` has been added to the :func:`qiskit.visualization.circuit_drawer` function and the :class:`~qiskit.circuit.QuantumCircuit` method :meth:`~qiskit.circuit.QuantumCircuit.draw`. When set to ``True`` the cregs will be bundled into a single line in circuit visualizations for the ``text`` and ``mpl`` drawers. The default value is ``True``. Addresses issue `#4290 <https://github.com/Qiskit/qiskit-terra/issues/4290>`_.
ta_in: ஒரு புதிய குவார்க், `` க்ரெக்பண்டில்``:func: `qiskit.visualization.circuit_drawer` செயல்பாடு மற்றும் :class:` ~ qiskit.circuit.QuantumCircuit` முறை:meth: `q qiskit.circuit.QuantumCircuit இல் சேர்க்கப்பட்டுள்ளது. வரைய`. `` உண்மை`` என அமைக்கப்பட்டால், `` உரை`` மற்றும் `` எம்.பி.எல்`` இழுப்பறைகளுக்கான சுற்று காட்சிப்படுத்தல்களில் கிரெக்ஸ் ஒரு வரியில் தொகுக்கப்படும். இயல்புநிலை மதிப்பு `` உண்மை``. முகவரிகள் வெளியீடு `# 4290 <https://github.com/Qiskit/qiskit-terra/issues/4290>` _.

source: A new kwarg, ``initial_state`` has been added to the :func:`qiskit.visualization.circuit_drawer` function and the :class:`~qiskit.circuit.QuantumCircuit` method :meth:`~qiskit.circuit.QuantumCircuit.draw`. When set to ``True`` the initial state will now be included in circuit visualizations for all drawers. Addresses issue `#4293 <https://github.com/Qiskit/qiskit-terra/issues/4293>`_.
ta_in: ஒரு புதிய குவார்க், `` ஆரம்ப_நிலையம்``:func: `qiskit.visualization.circuit_drawer` செயல்பாடு மற்றும் :class:` ~ qiskit.circuit.QuantumCircuit` முறை:meth: `~ qiskit.circuit.QuantumCircuit இல் சேர்க்கப்பட்டுள்ளது. வரைய`. `` உண்மை`` என அமைக்கப்பட்டால், ஆரம்ப நிலை இப்போது அனைத்து இழுப்பறைகளுக்கான சுற்று காட்சிப்படுத்தல்களில் சேர்க்கப்படும். முகவரிகள் வெளியீடு `# 4293 <https://github.com/Qiskit/qiskit-terra/issues/4293>` _.

source: Labels will now be displayed when using the 'mpl' drawer. There are 2 types of labels - gate labels and control labels. Gate labels will replace the gate name in the display. Control labels will display above or below the controls for a gate. Fixes issues #3766, #4580 Addresses issues `#3766 <https://github.com/Qiskit/qiskit-terra/issues/3766>`_ and `#4580 <https://github.com/Qiskit/qiskit-terra/issues/4580>`_.
ta_in: 'Mpl' டிராயரைப் பயன்படுத்தும் போது லேபிள்கள் இப்போது காண்பிக்கப்படும். 2 வகையான லேபிள்கள் உள்ளன - கேட் லேபிள்கள் மற்றும் கட்டுப்பாட்டு லேபிள்கள். கேட் லேபிள்கள் காட்சியில் கேட் பெயரை மாற்றும். கட்டுப்பாட்டு லேபிள்கள் ஒரு வாயிலுக்கான கட்டுப்பாடுகளுக்கு மேலே அல்லது கீழே காண்பிக்கப்படும். சிக்கல்களை சரிசெய்கிறது # 3766, # 4580 முகவரிகள் சிக்கல்கள் `# 3766 <https://github.com/Qiskit/qiskit-terra/issues/3766>` _ மற்றும் `#4580 <https://github.com/Qiskit/qiskit-terra/issues/4580>`_.

source: Implementations of the multi-controlled X Gate ( :class:`~qiskit.circuit.library.MCXGrayCode`, :class:`~qiskit.circuit.library.MCXRecursive`, and :class:`~qiskit.circuit.library.MCXVChain`) have had their ``name`` properties changed to more accurately describe their implementation: ``mcx_gray``, ``mcx_recursive``, and ``mcx_vchain`` respectively. Previously, these gates shared the name ``mcx`` with :class:`~qiskit.circuit.library.MCXGate`, which caused these gates to be incorrectly transpiled and simulated.
ta_in: பல கட்டுப்படுத்தப்பட்ட எக்ஸ் கேட் (: வகுப்பு: `~ qiskit.circuit.library.MCXGrayCode` ,: வகுப்பு:` ~ qiskit.circuit.library.MCXRecursive`, மற்றும்: வகுப்பு: `~ qiskit.circuit.library.MCXVChain `) அவற்றின்` `பெயர்`` பண்புகள் அவற்றின் செயல்பாட்டை இன்னும் துல்லியமாக விவரிக்கும் வகையில் மாற்றப்பட்டுள்ளன:` `mcx_gray``,` `mcx_recursive``, மற்றும்` `mcx_vchain`` முறையே. முன்னதாக, இந்த வாயில்கள் `` mcx`` என்ற பெயரை: class: `~ qiskit.circuit.library.MCXGate` உடன் பகிர்ந்து கொண்டன, இதனால் இந்த வாயில்கள் தவறாக மாற்றப்பட்டு உருவகப்படுத்தப்பட்டன.

source: By default the preset passmanagers in :mod:`qiskit.transpiler.preset_passmanagers` are using :class:`~qiskit.transpiler.passes.UnrollCustomDefinitions` and :class:`~qiskit.transpiler.passes.BasisTranslator` to handle basis changing instead of the previous default :class:`~qiskit.transpiler.passes.Unroller`. This was done because the new passes are more flexible and allow targeting any basis set, however the output may differ. To use the previous default you can set the ``translation_method`` kwarg on :func:`~qiskit.compiler.transpile` to ``'unroller'``.
ta_in: முன்னிருப்பாக :mod:` qiskit.transpiler.preset_passmanagers ` :class:` ~ qiskit.transpiler.passes.UnrollCustomDefinitions ` மற்றும் :class:` ~ qiskit.transpiler.passes.BasisTranslator ` முன்னிருப்பு முன்னிருப்பு :class:` ~ qiskit.transpiler.passes.Unroller `. இது புதிய கடைகள் அதிக மறுமலையானவை ஏனெனில் எந்த அடிப்படையில் அமைக்க அனுமதிக்கிறது, எனினும் வெளியீடு வேறுபடும். முந்தைய முன்னிருப்பு பயன்படுத்த நீங்கள் ` ` மொழிபெயர்த்தல் முறையை :func:` ~ qiskit.compiler.compiler.transpile ` ` unroller ` `.

source: The :func:`qiskit.converters.circuit_to_gate` and :func`qiskit.converters.circuit_to_instruction` converter functions had previously automatically included the generated gate or instruction in the active ``SessionEquivalenceLibrary``. These converters now accept an optional ``equivalence_library`` keyword argument to specify if and where the converted instances should be registered. The default behavior has changed to not register the converted instance.
ta_in: : Func: `qiskit.converters.circuit_to_gate` மற்றும்: func`qiskit.converters.circuit_to_instruction` மாற்றி செயல்பாடுகள் முன்பு தானாகவே உருவாக்கப்பட்ட கேட் அல்லது அறிவுறுத்தலை செயலில்` `SessionEquivlanceLibrary`` இல் தானாகவே சேர்த்திருந்தன. மாற்றப்பட்ட நிகழ்வுகள் எங்கே, எங்கு பதிவு செய்யப்பட வேண்டும் என்பதைக் குறிப்பிட இந்த மாற்றிகள் இப்போது விருப்பமான `` சமநிலை_ நூலகம்`` முக்கிய வாதத்தை ஏற்றுக்கொள்கின்றன. மாற்றப்பட்ட நிகழ்வை பதிவு செய்யாதபடி இயல்புநிலை நடத்தை மாற்றப்பட்டுள்ளது .

source: The default value of the ``cregbundle`` kwarg for the :meth:`qiskit.circuit.QuantumCircuit.draw` method and :func:`qiskit.visualization.circuit_drawer` function has been changed to ``True``. This means that by default the classical bits in the circuit diagram will now be bundled by default, for example:
ta_in: :meth: `qiskit.circuit.QuantumCircuit.draw` முறை மற்றும்:func:` qiskit.visualization.circuit_drawer` செயல்பாட்டிற்கான ``cregbundle`` குவார்க்கின் இயல்புநிலை மதிப்பு ``True`` என மாற்றப்பட்டுள்ளது. இதன் பொருள் இயல்புநிலையாக சுற்று வரைபடத்தில் உள்ள கிளாசிக்கல் பிட்கள் இப்போது இயல்புநிலையாக தொகுக்கப்படும், எடுத்துக்காட்டாக:

source: If you want to have your circuit drawing retain the previous behavior and show each classical bit in the diagram you can set the ``cregbundle`` kwarg to ``False``. For example:
ta_in: உங்கள் சர்க்யூட் வரைபடம் முந்தைய நடத்தையைத் தக்க வைத்துக் கொள்ள விரும்பினால், ஒவ்வொரு கிளாசிக்கல் பிட்டையும் வரைபடத்தில் காண்பிக்க விரும்பினால், நீங்கள் ``cregbundle`` குவார்க்கை ``False`` என அமைக்கலாம். உதாரணத்திற்கு:

source: :class:`~qiskit.pulse.Schedule` plotting with :py:meth:`qiskit.pulse.Schedule.draw` and :func:`qiskit.visualization.pulse_drawer` will no longer display the event table by default. This can be reenabled by setting the ``table`` kwarg to ``True``.
ta_in: class: `~ qiskit.pulse.Schedule` உடன் ப்ளோட்டிங் : py: meth:` qiskit.pulse.Schedule.draw` மற்றும்: func: `qiskit.visualization.pulse_drawer` இனி இயல்புநிலையாக நிகழ்வு அட்டவணையைக் காண்பிக்காது. `` அட்டவணை`` குவார்க்கை `` உண்மை`` என அமைப்பதன் மூலம் இதை மீண்டும் இயக்க முடியும்.

source: The pass :class:`~qiskit.transpiler.passes.RemoveResetInZeroState` was previously included in the preset pass manager :func:`~qiskit.transpiler.preset_passmanagers.level_0_pass_manager` which was used with the ``optimization_level=0`` for :func:`~qiskit.compiler.transpile` and :func:`~qiskit.execute.execute` functions. However, :class:`~qiskit.transpiler.passes.RemoveResetInZeroState` is an optimization pass and should not have been included in optimization level 0 and was removed. If you need to run :func:`~qiskit.compiler.transpile` with :class:`~qiskit.transpiler.passes.RemoveResetInZeroState` either use a custom pass manager or ``optimization_level`` 1, 2, or 3.
ta_in: பாஸ்: வகுப்பு: `~ qiskit.transpiler.passes.RemoveResetInZeroState` முன்பு முன்னமைக்கப்பட்ட பாஸ் மேலாளரில் சேர்க்கப்பட்டுள்ளது: func:` ~ qiskit.transpiler.preset_passmanagers.level_0_pass_manager` இது `` உகப்பாக்கம்_level = 0`` உடன் பயன்படுத்தப்பட்டது: func: `~ qiskit.compiler.transpile` மற்றும்: func:` ~ qiskit.execute.execute` செயல்பாடுகள். இருப்பினும், வகுப்பு: `~ qiskit.transpiler.passes.RemoveResetInZeroState` என்பது ஒரு தேர்வுமுறை பாஸ் மற்றும் இது தேர்வுமுறை நிலை 0 இல் சேர்க்கப்படக்கூடாது மற்றும் அகற்றப்பட்டது. உங்களுக்கு தேவைப்பட்டால் :func:`~qiskit.compiler.transpile` with :class:`~qiskit.transpiler.passes.RemoveResetInZeroState` தனிப்பயன் பாஸ் நிர்வாகியைப் பயன்படுத்தவும் அல்லது ``optimization_level`` 1, 2, or 3.

source: The deprecated kwarg ``line_length`` for the :func:`qiskit.visualization.circuit_drawer` function and :meth:`qiskit.circuit.QuantumCircuit.draw` method has been removed. It had been deprecated since the 0.10.0 release. Instead you can use the ``fold`` kwarg to adjust the width of the circuit diagram.
ta_in: : Func: `qiskit.visualization.circuit_drawer` செயல்பாடு மற்றும்: மெத்:` qiskit.circuit.QuantumCircuit.draw` முறைக்கு நீக்கப்பட்ட குவார்க் `` வரி_நீளம்`` நீக்கப்பட்டது. இது 0.10.0 வெளியீட்டிலிருந்து நீக்கப்பட்டது. அதற்கு பதிலாக சுற்று வரைபடத்தின் அகலத்தை சரிசெய்ய `` மடிப்பு`` குவார்க்கைப் பயன்படுத்தலாம்.

source: The ``'mpl'`` output mode for the :meth:`qiskit.circuit.QuantumCircuit.draw` method and :func:`~qiskit.visualization.circuit_drawer` now requires the `pylatexenc <https://pylatexenc.readthedocs.io/en/latest/latexencode/>`__ library to be installed. This was already an optional dependency for visualization, but was only required for the ``'latex'`` output mode before. It is now also required for the matplotlib drawer because it is needed to handle correctly sizing gates with matplotlib's `mathtext <https://matplotlib.org/3.2.2/tutorials/text/mathtext.html>`__ labels for gates.
ta_in: : `மெத்:` qiskit.circuit.QuantumCircuit.draw` முறை மற்றும்: func: `~ qiskit.visualization.circuit_drawer` க்கான` `'mpl'`` வெளியீட்டு முறைக்கு இப்போது` pylatexenc <https: //pylatexenc.readthedocs தேவைப்படுகிறது .io / en / latest / latexencode /> `__ நூலகம் நிறுவப்பட வேண்டும். இது ஏற்கனவே காட்சிப்படுத்தலுக்கான விருப்ப சார்புநிலையாக இருந்தது, ஆனால் இதற்கு முன்பு `` 'லேடெக்ஸ்`` வெளியீட்டு முறைக்கு மட்டுமே இது தேவைப்பட்டது. மேட்லோட்லிப் டிராயருக்கு இது இப்போது தேவைப்படுகிறது, ஏனெனில் மேட்லோட்லிப்பின் `கணிதத்துடன் சரியான அளவிலான வாயில்களைக் கையாள இது தேவைப்படுகிறது.

source: The deprecated ``get_tokens`` methods for the :class:`qiskit.qasm.Qasm` and :class:`qiskit.qasm.QasmParser` has been removed. These methods have been deprecated since the 0.9.0 release. The :meth:`qiskit.qasm.Qasm.generate_tokens` and :meth:`qiskit.qasm.QasmParser.generate_tokens` methods should be used instead.
ta_in: இது :class:` qiskit.qasm.Qasm ` மற்றும் :class:` qiskit.qasm.Qasm.QasmParser ` அகற்றப்பட்டது. இந்த முறைகள் 0.9.0 விடுதலை இருந்து விடுதலை செய்யப்பட்டு வருகின்றது. :meth:` qiskit.qasm.Qasm.Qasm.generate_tokens ` and :meth:` qiskit.qasm.Qasm.QasmParser.generate_tokens ` முறைகள் பதிலாக பயன்படும்.

source: The deprecated kwarg ``channels_to_plot`` for :meth:`qiskit.pulse.Schedule.draw`, :meth:`qiskit.pulse.Instruction.draw`, ``qiskit.visualization.pulse.matplotlib.ScheduleDrawer.draw`` and :func:`~qiskit.visualization.pulse_drawer` has been removed. The kwarg has been deprecated since the 0.11.0 release and was replaced by the ``channels`` kwarg, which functions identically and should be used instead.
ta_in: நீக்கப்பட்ட குவார்க் `` சேனல்கள்_டொ_பிளாட்``: மெத்: `qiskit.pulse.Schedule.draw` ,: மெத்:` qiskit.pulse.Instruction.draw`, `` qiskit.visualization.pulse.matplotlib.ScheduleDrawer.draw`` மற்றும்: func: `~ qiskit.visualization.pulse_drawer` அகற்றப்பட்டது. 0.11.0 வெளியீட்டிலிருந்து குவார்க் நீக்கப்பட்டது மற்றும் அதற்கு பதிலாக `` சேனல்கள்`` குவார்க் மாற்றப்பட்டது, இது ஒரே மாதிரியாக செயல்படுகிறது, அதற்கு பதிலாக பயன்படுத்தப்பட வேண்டும்.

source: The deprecated ``circuit_instruction_map`` attribute of the :class:`qiskit.providers.models.PulseDefaults` class has been removed. This attribute has been deprecated since the 0.12.0 release and was replaced by the ``instruction_schedule_map`` attribute which can be used instead.
ta_in: வகுப்பின் நீக்கப்பட்ட `` சர்க்யூட்_இன்ஸ்ட்ரக்ஷன்_மாப்`` பண்புக்கூறு: `qiskit.providers.models.PulseDefaults` வகுப்பு நீக்கப்பட்டது. இந்த பண்பு 0.12.0 வெளியீட்டிலிருந்து நீக்கப்பட்டது மற்றும் அதற்கு பதிலாக பயன்படுத்தக்கூடிய `` அறிவுறுத்தல்_ அட்டவணை_மாப்`` பண்புக்கூறு மாற்றப்பட்டது.
