Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: `networkx <https://networkx.org/>`__ is explicitly listed as a dependency now. It previously was an implicit dependency as it was required for the :mod:`qiskit.ignis.verification.topological_codes` module but was not correctly listed as a depdendency as qiskit-terra also requires networkx and is also a depdency of ignis so it would always be installed in practice. However, it is necessary to list it as a requirement for future releases of qiskit-terra that will not require networkx. It's also important to correctly list the dependencies of ignis in case there were a future incompatibility between version requirements.
ta_in: ` networkx <https://networkx.org/>` __ (_) தற்போது சார்பாக பட்டியலிடப்பட்டுள்ளது. இது முன்பு :mod:` qiskit.ignis.verification.topological_codes ` module but was not නිවැරදිව listed as a depdendency as a depdendency as qiskit-terra also requires networkx and is a depdency of ignis so it would always be installed in practice. எனினும் இது தேவையாகத் தேவையாகத் தேவையாகத் தேவையாகத் தேவையான குசிக்ஸ்-டெரா (qiskit-terra) வெளியீடுகளுக்கான தேவையாகத் தேவைப்படுகிறது. பதிப்பு தேவைகளுக்கு இடையிலான ஒரு எதிர்காணி எதிர்மையை சரியாக பட்டியலிடும் வகையில் இது சரியாக உள்ளது.

source: Qiskit 0.23.4
ta_in: கிஸ்கிட் 0.23.4

source: Terra 0.16.3
ta_in: டெரா 0.16.3

source: Fixed an issue introduced in 0.16.2 that would cause errors when running :func:`~qiskit.compiler.transpile` on a circuit with a series of 1 qubit gates and a non-gate instruction that only operates on a qubit (e.g. :class:`~qiskit.circuit.Reset`). Fixes `#5736 <https://github.com/Qiskit/qiskit-terra/issues/5736>`__
ta_in: 0.16.2 இல் அறிமுகப்படுத்தப்பட்ட ஒரு சிக்கல் சரி செய்யப்பட்டது, இது இயங்கும் போது பிழைகளை ஏற்படுத்தும்: func: `q qiskit.compiler.transpile` ஒரு சுற்றுக்கு 1 குவிட் வாயில்கள் மற்றும் ஒரு குவிட் மீது மட்டுமே செயல்படும் கேட் அல்லாத அறிவுறுத்தல்

source: Aer 0.7.3
ta_in: எ இ அர் 0.7.3

source: Ignis 0.5.1
ta_in: லிக்னிஸ் 0.5.1

source: Aqua 0.8.1
ta_in: அக்வா 0.8.1

source: Terra 0.16.2
ta_in: டெரா 0.16.2

source: Python 3.9 support has been added in this release. You can now run Qiskit Terra using Python 3.9.
ta_in: இந்த வெளியீட்டில் பைதான் 3.9 ஆதரவு சேர்க்கப்பட்டுள்ளது. நீங்கள் தற்பொழுது Qiskit Ibmq வழங்குபவர் பைதான் 3.9 பயன்படுத்தி இயக்கலாம்.

source: The class :class:`~qiskit.library.standard_gates.x.MCXGrayCode` will now create a ``C3XGate`` if ``num_ctrl_qubits`` is 3 and a ``C4XGate`` if ``num_ctrl_qubits`` is 4. This is in addition to the previous functionality where for any of the modes of the :class:'qiskit.library.standard_gates.x.MCXGate`, if ``num_ctrl_bits`` is 1, a ``CXGate`` is created, and if 2, a ``CCXGate`` is created.
ta_in: வகுப்பு: வர்க்கம்: `~ qiskit.library.standard_gates.x.MCXGrayCode` இப்போது` `num_ctrl_qubits` 3 3 ஆகவும்,` `num_ctrl_qubits` 4 என்றால் 4` `` C3XGate`` ஐ உருவாக்கும். இது முந்தைய செயல்பாட்டுக்கு கூடுதலாக: வர்க்கத்தின் எந்த முறைகளுக்கும்: 'qiskit.library.standard_gates.x.MCXGate`, `` num_ctrl_bits`` 1 எனில், `` CXGate`` உருவாக்கப்பட்டது, 2 எனில், `` சி.சி.எக்ஸ் கேட்`` உருவாக்கப்பட்டது.

source: Pulse :py:class:`~qiskit.pulse.instructions.Delay` instructions are now explicitly assembled as :class:`~qiskit.qobj.PulseQobjInstruction` objects included in the :class:`~qiskit.qobj.PulseQobj` output from :func:`~qiskit.compiler.assemble`.
ta_in: துடிப்பு: py: class: `~ qiskit.pulse.instructions.Delay` இன் அறிவுறுத்தல்கள் இப்போது இவ்வாறு வெளிப்படையாக கூடியிருக்கின்றன: class:` ~ qiskit.qobj.PulseQobjInstruction` பொருள்கள்: வகுப்பில் சேர்க்கப்பட்டுள்ளன: `q qiskit.qobj.PulseQobj` வெளியீடு : func: `~ qiskit.compiler.assemble.

source: Previously, we could ignore :py:class:`~qiskit.pulse.instructions.Delay` instructions in a :class:`~qiskit.pulse.Schedule` as part of :func:`~qiskit.compiler.assemble` as the time was explicit in the :class:`~qiskit.qobj.PulseQobj` objects. But, now with pulse gates, there are situations where we can schedule ONLY a delay, and not including the delay itself would remove the delay.
ta_in: முன்னதாக, நாம் புறக்கணிக்கலாம்: py: class: `~ qiskit.pulse.instructions.Delay` இன் அறிவுறுத்தல்கள் a: class:` ~ qiskit.pulse.Schedule` இன் ஒரு பகுதியாக: func: `~ qiskit.compiler.assemble` :class: `~ qiskit.qobj.PulseQobj` பொருள்களில் நேரம் வெளிப்படையாக இருந்தது. ஆனால், இப்போது pulse gates, ஒரு தாமதத்தை மட்டுமே நாங்கள் திட்டமிடக்கூடிய சூழ்நிலைகள் உள்ளன, மேலும் தாமதத்தை உள்ளடக்குவது தாமதத்தை அகற்றும்.

source: Circuits with custom gate calibrations can now be scheduled with the transpiler without explicitly providing the durations of each circuit calibration.
ta_in: தனிப்பயன் கேட் அளவுத்திருத்தங்களுடன் கூடிய சுற்றுகள் இப்போது ஒவ்வொரு சுற்று அளவுத்திருத்தத்தின் காலங்களையும் வெளிப்படையாக வழங்காமல் டிரான்ஸ்பைலருடன் திட்டமிடலாம்.

source: The :class:`~qiskit.transpiler.passes.BasisTranslator` and :class:`~qiskit.transpiler.passes.Unroller` passes, in some cases, had not been preserving the global phase of the circuit under transpilation. This has been fixed.
ta_in: :class: `~ qiskit.transpiler.passes.BasisTranslator` மற்றும்:class:` ~ qiskit.transpiler.passes.Unroller` பாஸ்கள், சில சந்தர்ப்பங்களில், சுற்றோட்டத்தின் உலகளாவிய கட்டத்தை இடமாற்றத்தின் கீழ் பாதுகாக்கவில்லை. இது சரி செய்யப்பட்டது.

source: A bug in :func:`qiskit.pulse.builder.frequency_offset` where when ``compensate_phase`` was set a factor of :math:`2\pi` was missing from the appended phase.
ta_in: ஒரு பிழை:func: `qiskit.pulse.builder.frequency_offset`, அங்கு` `compensate_phase`` ஒரு காரணியாக அமைக்கப்பட்டபோது:math:` 2 \ pi` சேர்க்கப்பட்ட கட்டத்தில் இருந்து காணவில்லை.

source: Fix the global phase of the output of the :class:`~qiskit.circuit.QuantumCircuit` method :meth:`~qiskit.circuit.QuantumCircuit.repeat`. If a circuit with global phase is appended to another circuit, the global phase is currently not propagated. Simulators rely on this, since the phase otherwise gets applied multiple times. This sets the global phase of :meth:`~qiskit.circuit.QuantumCircuit.repeat` to 0 before appending the repeated circuit instead of multiplying the existing phase times the number of repetitions.
ta_in: :class:` ~ qiskit.circuit.QuantumCircuit ` method :meth:` ~ qiskit.circuit.QuantumCircuit.Repit.QuantumCircuit.Repe`. If a circuit with global phase is appended to another circuit, the global phase is currently not propagated. சிமோலேட்டர்கள் இதை கவனிக்கின்றனர், இல்லையென்றால், இல்லையென்றால் பல முறை பயன்படுத்தப்படுகிறது. இது :meth:` ~ qiskit.circuit.QuantumCircuit.QuantumCircuit.QuantumCircuit.QuantumCircuit.ref க்கு முன்னால், மறுபடியும் மறுபடியும் மறுபடியும் மறுபடியும் மறுபடியும் கூடுதலாக.

source: Fixes bug in :class:`~qiskit.quantum_info.SparsePauliOp` where multiplying by a certain non Python builtin Numpy scalar types returned incorrect values. Fixes `#5408 <https://github.com/Qiskit/qiskit-terra/issues/5408>`__
ta_in: பிழையை சரிசெய்கிறது: வர்க்கம்: `~ qiskit.quantum_info.SparsePauliOp`, அங்கு ஒரு குறிப்பிட்ட பைதான் அல்லாத பில்டினால் பெருக்கினால் நம்பி ஸ்கேலர் வகைகள் தவறான மதிப்புகளை அளித்தன. திருத்தங்கள் `# 5408 <https://github.com/Qiskit/qiskit-terra/issues/5408>` __

source: The definition of the Hellinger fidelity from has been corrected from the previous defition of :math:`1-H(P,Q)` to :math:`[1-H(P,Q)^2]^2` so that it is equal to the quantum state fidelity of P, Q as diagonal density matrices.
ta_in: ஹெலிங்கர் நம்பகத்தன்மையின் வரையறை முந்தைய கணிப்பிலிருந்து சரி செய்யப்பட்டது: கணிதம்: `1-எச் (பி, கியூ)` முதல்: கணிதம்: `[1-எச் (பி, கியூ) ^ 2] ^ 2` இது மூலைவிட்ட அடர்த்தி மெட்ரிக்குகளாக P, Q இன் குவாண்டம் நிலை நம்பகத்தன்மைக்கு சமம்.

source: Reduce the number of CX gates in the decomposition of the 3-controlled X gate, :class:`~qiskit.circuit.library.C3XGate`. Compiled and optimized in the `U CX` basis, now only 14 CX and 16 U gates are used instead of 20 and 22, respectively.
ta_in: CX வாயில்களின் எண்ணிக்கை 3-கட்டுப்படுத்தப்பட்ட X வாயில், :class:` ~ qiskit.circuit.library.C3XGate `. Compiled and optimized in the ` U CX ` அடிப்படையில், இப்போது மட்டுமே 14 CX மற்றும் 16 U வாயுக்கள் மட்டுமே 20 மற்றும் 22 இன் பதிலாக பயன்படுத்தப்படுகின்றன.

source: Fixes the issue wherein using Jupyter backend widget or :meth:`qiskit.tools.backend_monitor` would fail if the backend's basis gates do not include the traditional u1, u2, and u3.
ta_in: ஜூப்டர் பின்னணி விட்ஜெட் அல்லது :meth:` qiskit.tools.backend_monitor ` ஐ பயன்படுத்தும் இசையை பரிசோதிக்கிறது. பின்னணி அடிப்படையிலான வாயுக்கள் பாரம்பரிய u1, u2, மற்றும் u3 ஆகியவை இல்லை.

source: When running :func:`qiskit.compiler.transpile` on a list of circuits with a single element, the function used to return a circuit instead of a list. Now, when :func:`qiskit.compiler.transpile` is called with a list, it will return a list even if that list has a single element. See `#5260 <https://github.com/Qiskit/qiskit-terra/issues/5260>`__.
ta_in: இயங்கும் போது: func: `qiskit.compiler.transpile` என்பது ஒற்றை உறுப்புடன் கூடிய சுற்றுகளின் பட்டியலில், ஒரு பட்டியலுக்குப் பதிலாக ஒரு சுற்றுக்குத் திரும்பப் பயன்படுத்தப்படும் செயல்பாடு. இப்போது, ​​எப்போது: func: `qiskit.compiler.transpile` ஒரு பட்டியலுடன் அழைக்கப்படுகிறது, அந்த பட்டியலில் ஒரு உறுப்பு இருந்தாலும் அது ஒரு பட்டியலைத் தரும். `# 5260 <https://github.com/Qiskit/qiskit-terra/issues/5260>` __ ஐக் காண்க.

source: Fixes a bug that resulted in `c_if` not working when the width of the conditional register was greater than 64. See `#1077 <https://github.com/Qiskit/qiskit-aer/issues/1077>`__.
ta_in: அமைப்பில் சிக்கலை சரிசெய்கிறது: வர்க்கம்: `~ qiskit.providers.aer.QasmSimulator` அடிப்படை வாயில்கள்` `" முறை "` `மற்றும்` `" சத்தம்_மாடல் "` `விருப்பங்களை ஒன்றாகப் பயன்படுத்தும் போது, ​​அவற்றைப் பயன்படுத்தி உருவாக்கப்பட்ட சிமுலேட்டருடன் பயன்படுத்தும் போது: மெத் : `~ qiskit.providers.aer.QasmSimulator.from_backend`. இப்போது பட்டியலிடப்பட்ட அடிப்படை வாயில்கள் பின்தளத்தில் உள்ளமைவு, உருவகப்படுத்துதல் முறை மற்றும் இரைச்சல் மாதிரி அடிப்படை வாயில்கள் ஆதரிக்கும் வாயில்களின் குறுக்குவெட்டாக இருக்கும். இரைச்சல் மாதிரி அடிப்படை வாயில்கள் மற்றும் சிமுலேட்டர் அடிப்படை வாயில்கள் வெட்டுவது காலியாக இருந்தால் எச்சரிக்கை பதிவு செய்யப்படும்.

source: Qiskit 0.23.2
ta_in: கிஸ்கிட் 0.23.3

source: Terra 0.16.1
ta_in: டெரா 0.16.1

source: Aer 0.7.2
ta_in: எ இ அர் 0.7.3

source: Qiskit 0.23.1
ta_in: கிஸ்கிட் 0.23.1

source: Fixed an issue where an error was thrown in execute for valid circuits built with delays.
ta_in: தாமதங்களுடன் கட்டப்பட்ட செல்லுபடியாகும் சுற்றுகளுக்கு இயக்கத்தில் பிழை எறியப்பட்ட ஒரு சிக்கல் சரி செய்யப்பட்டது.

source: The QASM definition of 'c4x' in qelib1.inc has been corrected to match the standard library definition for C4XGate.
ta_in: Qelib1.inc யில் 'c4x' இன் QASM வரையறையை C4XGate க்கு நிலையான நூலகம் வரையறையை பொருந்துவதற்கு திருத்தப்பட்டது.

source: Fixes a bug in subtraction for quantum channels :math:`A - B` where :math:`B` was an :class:`~qiskit.quantum_info.Operator` object. Negation was being applied to the matrix in the Operator representation which is not equivalent to negation in the quantum channel representation.
ta_in: குவாண்டம் சேனல்களுக்கு கழிப்பதில் ஒரு பிழையை சரி செய்கிறது: கணிதம்: `A - B` எங்கே: கணிதம்:` B` என்பது ஒரு: வகுப்பு: `~ qiskit.quantum_info.Operator` பொருள். ஆபரேட்டர் பிரதிநிதித்துவத்தில் உள்ள மேட்ரிக்ஸுக்கு நிராகரிப்பு பயன்படுத்தப்பட்டது, இது குவாண்டம் சேனல் பிரதிநிதித்துவத்தில் நிராகரிக்கப்படுவதற்கு சமமானதல்ல.

source: Changes the way :meth:`~qiskit.quantum_info.states.statevector.Statevector._evolve_instruction` access qubits to handle the case of an instruction with multiple registers.
ta_in: வழியை மாற்றுகிறது: மெத்: `~ qiskit.quantum_info.states.statevector.Statevector._evolve_instruction` பல பதிவேடுகளுடன் ஒரு அறிவுறுத்தலின் வழக்கைக் கையாள அணுகல் வினாடிகள்.

source: Aer 0.7.1
ta_in: எ இ அர் 0.7.1

source: The minimum cmake version to build qiskit-aer has increased from 3.6 to 3.8. This change was necessary to enable fixing GPU version builds that support running on x86_64 CPUs lacking AVX2 instructions.
ta_in: Qiskit-aer உருவாக்க குறைந்தபட்ச சிக்கல் பதிப்பு 3.6 முதல் 3.8 ஆக உயர்ந்தது. GPU பதிப்பு x86_64 CPUல் இயங்கும் ஆதரவு AVX2 கட்டளைகளில் இயங்கும் ஆதரவைப் பயன்படுத்தி இந்த மாற்றம் தேவைப்பட்டது.

source: qiskit-aer with GPU support will now work on systems with x86_64 CPUs lacking AVX2 instructions. Previously, the GPU package would only run if the AVX2 instructions were available. Fixes `#1023 <https://github.com/Qiskit/qiskit-aer/issues/1023>`__
ta_in: ஜி.பீ.யூ ஆதரவுடன் qiskit-aer இப்போது AVX2 அறிவுறுத்தல்கள் இல்லாத x86_64 CPU களுடன் கணினிகளில் வேலை செய்யும். முன்னதாக, ஏ.வி.எக்ஸ் 2 அறிவுறுத்தல்கள் இருந்தால் மட்டுமே ஜி.பீ.யூ தொகுப்பு இயங்கும். திருத்தங்கள் `# 1023

source: Fix bug where the `"sx"`` gate :class:`~qiskit.circuit.library.SXGate` was not listed as a supported gate in the C++ code, in `StateOpSet` of `matrix_product_state.hp`.
ta_in: ++ sx" `` கேட்: வகுப்பு: `~ qiskit.circuit.library.SXGate` ஆனது C ++ குறியீட்டில் ஆதரிக்கப்படும் வாயிலாக பட்டியலிடப்படாத பிழையை சரிசெய்யவும்,` matrix_product_state.hp இன் `StateOpSet` இல்.

source: A new algorithm has been added: the Born Openheimer Potential Energy surface for the calculation of potential energy surface along different degrees of freedom of the molecule. The algorithm is called ``BOPESSampler``. It further provides functionalities of fitting the potential energy surface to an analytic function of predefined potentials.some details.
ta_in: ஒரு புதிய வழிமுறை சேர்க்கப்பட்டுள்ளது: மூலக்கூறின் சுதந்திரத்தின் வெவ்வேறு அளவுகளில் சாத்தியமான ஆற்றல் மேற்பரப்பைக் கணக்கிடுவதற்கான பிறப்பு ஓப்பன்ஹைமர் ஆற்றல் ஆற்றல் மேற்பரப்பு. வழிமுறை `` BOPESSampler`` என அழைக்கப்படுகிறது. இது முன் வரையறுக்கப்பட்ட ஆற்றல்களின் பகுப்பாய்வு செயல்பாட்டிற்கு சாத்தியமான ஆற்றல் மேற்பரப்பை பொருத்துவதற்கான செயல்பாடுகளை மேலும் வழங்குகிறது. சில விவரங்கள்.

source: Critical Issues
ta_in: விமர்சனங்கள்

source: Be aware that ``initial_state`` parameter in ``QAOA`` has now different implementation as a result of a bug fix. The previous implementation wrongly mixed the user provided ``initial_state`` with Hadamard gates. The issue is fixed now. No attention needed if your code does not make use of the user provided ``initial_state`` parameter.
ta_in: பிழை சரிசெய்தலின் விளைவாக `` QAOA`` இல் உள்ள `` ஆரம்ப_நிலையம்`` அளவுரு இப்போது வேறுபட்ட செயலாக்கத்தைக் கொண்டுள்ளது என்பதை அறிந்து கொள்ளுங்கள். முந்தைய செயலாக்கம் பயனர் `` ஆரம்ப_நிலையம்`` ஐ ஹடமார்ட் வாயில்களுடன் தவறாக கலக்கியது. சிக்கல் இப்போது சரி செய்யப்பட்டது. வழங்கப்பட்ட `` ஆரம்ப_நிலையம்`` அளவுருவை உங்கள் குறியீடு பயன்படுத்தாவிட்டால் கவனம் தேவையில்லை.

source: optimize_svm method of qp_solver would sometimes fail resulting in an error like this `ValueError: cannot reshape array of size 1 into shape (200,1)` This addresses the issue by adding an L2 norm parameter, lambda2, which defaults to 0.001 but can be changed via the QSVM algorithm, as needed, to facilitate convergence.
ta_in: qp_solver இன் optimize_svm முறை சில நேரங்களில் இதுபோன்ற பிழையின் விளைவாக தோல்வியடையும் `மதிப்பு பிழை: அளவு 1 இன் வடிவத்தை வடிவமாக மாற்றியமைக்க முடியாது (200,1)` இது எல் 2 நெறிமுறை அளவுருவான லாம்ப்டா 2 ஐ சேர்ப்பதன் மூலம் சிக்கலை தீர்க்கிறது, இது இயல்புநிலையாக 0.001 ஆக இருக்கும், ஆனால் இருக்க முடியும் QSVM வழிமுறை வழியாக மாற்றப்பட்டது, தேவைக்கேற்ப, ஒன்றிணைவதை எளிதாக்குகிறது.

source: A method ``one_letter_symbol`` has been removed from the ``VarType`` in the latest build of DOCplex making Aqua incompatible with this version. So instead of using this method an explicit type check of variable types has been introduced in the Aqua optimization module.
ta_in: DOCplex இன் சமீபத்திய கட்டமைப்பில் `` One_letter_symbol`` என்ற முறை `` VarType`` இலிருந்து அகற்றப்பட்டது, இது அக்வாவை இந்த பதிப்போடு பொருந்தாது. எனவே இந்த முறையைப் பயன்படுத்துவதற்குப் பதிலாக, அக்வா தேர்வுமுறை தொகுதியில் மாறி வகைகளின் வெளிப்படையான வகை சோதனை அறிமுகப்படுத்தப்பட்டுள்ளது.

source: :meth`~qiskit.aqua.operators.state_fns.DictStateFn.sample()` could only handle real amplitudes, but it is fixed to handle complex amplitudes. `#1311 <https://github.com/Qiskit/qiskit-aqua/issues/1311>` for more details.
ta_in: :மெத் `~ க்கிஸ்கிட்.அக்வா.ஓபெராடோர்ஸ்.ஸ்டேட் _ fns.DictStateFn.sample () `. உண்மை யானா அம்பிலிட்டுட்ட் -ஐ மட்டுமே கையாள முடியும், ஆனால் சிக்கலான அம்பிலிட்டுட்ட் -ஐ கையாள இது செய்யப்பட்டது. மேலும் விவரங்களுக்காக <https://github.com/Qiskit/qiskit-aqua/issues/1311>`#1311.

source: Trotter class did not use the reps argument in constructor. `#1317 <https://github.com/Qiskit/qiskit-aqua/issues/1317>` for more details.
ta_in: ட்ராட்டர் வகுப்பு கட்டுப்பாட்டில் மறுபடியும் பயன்படுத்தவில்லை. மேலும் விவரங்களுக்காக <https://github.com/Qiskit/qiskit-aqua/issues/1317>`#1317.

source: Raise an `AquaError` if :class`qiskit.aqua.operators.converters.CircuitSampler` samples an empty operator. `#1321 <https://github.com/Qiskit/qiskit-aqua/issues/1321>` for more details.
ta_in: ஒரு எழுப்பு `AquaError` if :class 'Kit qiskit.aqua.operators.converters.CircuitSampler ` வெற்று ஆபரேட்டரின் மாதிரிகள். மேலும் விவரங்களுக்காக <https://github.com/Qiskit/qiskit-aqua/issues/1321>`#1321.

source: :meth:`~qiskit.aqua.operators.legacy.WeightedPauliOperator.to_opflow()` returns a correct operator when coefficients are complex numbers. `#1381 <https://github.com/Qiskit/qiskit-aqua/issues/1381>` for more details.
ta_in: : meth: `~ qiskit.aqua.operators.legacy.WeightedPauliOperator.to_opflow ()` குணகங்கள் சிக்கலான எண்களாக இருக்கும்போது சரியான ஆபரேட்டரைத் தருகிறது. மேலும் விவரங்களுக்கு `# 1381 <https://github.com/Qiskit/qiskit-aqua/issues/1381>`.

source: Let backend simulators validate NoiseModel support instead of restricting to Aer only in QuantumInstance.
ta_in: குவாண்டம் இன்ஸ்டான்ஸில் மட்டுமே aerக்கு கட்டுப்படுத்துவதற்குப் பதிலாக பின்தளத்தில் சிமுலேட்டர்கள் நொய்ஸ்மாடல் ஆதரவை சரிபார்க்கட்டும்.

source: Correctly handle PassManager on QuantumInstance ``transpile`` method by calling its ``run`` method if it exists.
ta_in: குவாண்டம் இன்ஸ்டான்ஸ் ``transpile`` முறையில் பாஸ்மேனேஜரை சரியாகக் கையாள, அதன் ``run`` முறை இருந்தால் அதை அழைக்கவும்.

source: A bug that mixes custom ``initial_state`` in ``QAOA`` with Hadamard gates has been fixed. This doesn't change functionality of QAOA if no initial_state is provided by the user. Attention should be taken if your implementation uses QAOA with cusom ``initial_state`` parameter as the optimization results might differ.
ta_in: மிஃஸ்ஸ் கஸ்டம் பிழை` ` initial_state ` ` இன் `'QAOA'` ஹடமார்ட் வாயில்கள் சரி செய்யப்பட்டுள்ளன. பயன்படுத்துபவர்கள் இனிஷியல்_ ஸ்டேட் எதுவும் வழங்கப்படாவிட்டால் இது QAOA இன் செயல்பாட்டை மாற்றாது. தேர்வுமுறை முடிவுகள் வேறுபடக்கூடும் என்பதால் உங்கள் செயல்பபாடும், QAOA ஐயூம் ``initial_state`` அளவுருவுடன் இருக்குமாறு கவனம் செலுத்தப்பட வேண்டும்.

source: Previously, setting `seed_simulator=0` in the `QuantumInstance` did not set any seed. This was only affecting the value 0. This has been fixed.
ta_in: முன் 'seed_simulator=0' 'QuantumInstance' எந்த சீயிட்டும் அமைக்கவில்லை. இது மதிப்பு 0 ஐ மட்டுமே பாதிக்கிறது. இது சரி செய்யப்பட்டது.

source: Terra 0.16.0
ta_in: டெரா 0.16.1

source: The 0.16.0 release includes several new features and bug fixes. The major features in this release are the following:
ta_in: 0.16.0 வெளியீட்டில் பல புதிய அம்சங்கள் மற்றும் பிழை திருத்தங்கள் ஆகியவை அடங்கும். இந்த வெளியீட்டில் வரும் அம்சங்கள் பின்வருமாறு:

source: Introduction of scheduled circuits, where delays can be used to control the timing and alignment of operations in the circuit.
ta_in: திட்டமிடப்பட்ட சிர்குய்ட் அறிமுகம், சிர்குய்ட் செயல்பாடுகளின் நேரம் மற்றும் சீரமைப்பைக் கட்டுப்படுத்த காலதாமதம் பயன்படுத்தப்படலாம்.

source: Compilation of quantum circuits from classical functions, such as oracles.
ta_in: குவாண்டம் சர்க்குய்ட் கோட்பாடு ஒவ்வொன்றும் பாரம்பரிய செயல்பாடுகளான ஆரக்கிள்போன்றவை.

source: Ability to compile and optimize single qubit rotations over different Euler basis as well as the phase + square-root(X) basis (i.e. ``['p', 'sx']``), which will replace the older IBM Quantum basis of ``['u1', 'u2', 'u3']``.
ta_in: வெவ்வேறு யூலர் அடிப்படையிலும் கட்டம் + சதுர-ரூட் (எக்ஸ்) அடிப்படையிலும் ஒற்றை குபிட் சுழற்சிகளை தொகுத்து மேம்படுத்தும் திறன்(அதாவது` ` பி ',' ஸ் எக்ஸ் ']) ` ` ['யு 1', 'யு2', 'யு3'] ` `.

source: Tracking of :meth:`~qiskit.circuit.QuantumCircuit.global_phase` on the :class:`~qiskit.circuit.QuantumCircuit` class has been extended through the :mod:`~qiskit.transpiler`, :mod:`~qiskit.quantum_info`, and :mod:`~qiskit.assembler` modules, as well as the BasicAer and Aer simulators. Unitary and state vector simulations will now return global phase-correct unitary matrices and state vectors.
ta_in: கண்காணிப்பு: மெத்: ~ கிஸ்கிட்.சர்க்யூட்.குவாண்டம்சர்க்யூட். குளோபல்_ கட்டம்` அதன் மேல் :வகுப்பு :` ~ கிஸ்கிட்.சர்க்யூட்.குவாண்டம்சர்க்யூட் ` cவகுப்பு மூலம் நீட்டிக்கப்பட்டுள்ளது :மொட் :` ~ கிஸ்கிட். ற்றன்ச்பிளெர் `, :மொட் :` ~ கிஸ்கிட்.குவாண்டம்_யின்போ `, அன்ட் :மொட் :` ~கிஸ்கிட்.அஸ்ஸம்ப்ளேர் ` மொடூல்ஸ் , அத்துடன் அடிப்படை ஏர் மற்றும் ஏர் சிமுலேட்டர்கள். தனிநபர் மற்றும் மாநில வெக்டர் சில்லேர்ஸ் இப்போது உலகளாவிய காலநிலை-சரியான தனிமங்கள் மற்றும் மாநில வெக்டார்களை திருப்பி வருகின்றது.

source: Also of particular importance for this release is that Python 3.5 is no longer supported. If you are using Qiskit Terra with Python 3.5, the 0.15.2 release is that last version which will work.
ta_in: மேலும் இந்த வெளியீடு குறிப்பிடத்தக்க முக்கியத்துவம், பைதான் 3.5 இனி ஆதரவளிக்கவில்லை. நீங்கள் கிஸ்கிட் டெர்ராவுடன் பைதான் 3.5, 0.15.2 பயன்படுத்தினால், வேலை செய்யும்.

source: Global R gates have been added to :mod:`qiskit.circuit.library`. This includes the global R gate (:class:`~qiskit.circuit.library.GR`), global Rx (:class:`~qiskit.circuit.library.GRX`) and global Ry (:class:`~qiskit.circuit.library.GRY`) gates which are derived from the :class:`~qiskit.circuit.library.GR` gate, and global Rz ( :class:`~qiskit.circuit.library.GRZ`) that is defined in a similar way to the :class:`~qiskit.circuit.library.GR` gates. The global R gates are defined on a number of qubits simultaneously, and act as a direct sum of R gates on each qubit.
ta_in: உலகளாவிய ஆர் வாயுக்கள் :மொட் :` கிஸ்கிட்.சர்க்யூட்.லைப்ரரி `. இதில் உலகளாவிய ஆர் வாயில் (:கிளாஸ் :` ~ கிஸ்கிட்.சர்க்யூட்.லைப்ரரி .ஜி ஆர் `), உலகளாவிய ஆர் எக்ஸ் (:கிளாஸ்:` ~ கிஸ்கிட்.சர்க்யூட்.லைப்ரரி .ஜி ஆர் எக்ஸ் `) மற்றும் உலகளாவிய ஆர் வ்ஹை (:கிளாஸ் :` ~ ஸ்கிட்.சர்க்யூட்.லைப்ரரி .ஜி ஆர் வ்ஹை `) வாயில்கள் :கிளாஸ் :` ~ ஸ்கிட்.சர்க்யூட்.லைப்ரரி .ஜி ஆர் ` வாயில், மற்றும் உலகளாவிய ஆர் ஸிட் ( :கிளாஸ் :` ~ கிஸ்கிட்.சர்க்யூட்.லைப்ரரி .ஜி ஆர் ஸிட்`) என்பது :கிளாஸ் :` ~ கிஸ்கிட்.சர்க்யூட்.லைப்ரரி .ஜி ஆர் ` வாயுக்கள். உலகளாவிய ஆர் வாயுக்கள் ஒரே நேரத்தில் ஒரு எண்ணிக்கையில் வரையறுக்கப்பட்டு, ஒவ்வொரு குறும்படத்தில் ஆர் வாயுக்களின் நேரடியாக செயல்படுகிறது.

source: will create a :class:`~qiskit.circuit.QuantumCircuit` on a :class:`~qiskit.circuit.QuantumRegister` of 3 qubits and perform a :class:`~qiskit.circuit.library.RGate` of an angle :math:`\theta = \frac{\pi}{3}` about an axis in the xy-plane of the Bloch spheres that makes an angle of :math:`\phi = \frac{2\pi}{3}` with the x-axis on each qubit.
ta_in: ஒரு :class: 'qiskit.circuit.QuantumCircuit` ஐ உருவாக்கும் :class:` q qiskit.circuit.QuantumRegister` 3 qubits மற்றும் ஒரு :class: `~ qiskit.circuit.library.RGate` ஒரு கோணத்தில்:math: `\theta = \frac{\pi}{3}` Bloch spheres-ன் xy- planeல் ஒரு கோணத்தை உருவாக்குகிறது :math:`\phi = \frac{2\pi}{3}` `ஒவ்வொரு qubitலும் x-axis உடன்.
