Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: Several classes to load probability distributions into qubit amplitudes; :class:`~qiskit.circuit.library.UniformDistribution`, :class:`~qiskit.circuit.library.NormalDistribution`, and :class:`~qiskit.circuit.library.LogNormalDistribution` were added to the circuit library (:mod:`qiskit.circuit.library`). The normal and log-normal distribution support both univariate and multivariate distributions. These circuits are central to applications in finance where quantum amplitude estimation is used.
ta_in: நிகழ்தகவு விநியோகங்களை குவிட் பெருக்கங்களில் ஏற்ற பல வகுப்புகள்; : class: `~ qiskit.circuit.library.UniformDistribution` ,: class:` ~ qiskit.circuit.library.NormalDistribution`, மற்றும்: class: `q qiskit.circuit.library.LogNormalDistribution` ஆகியவை சுற்று நூலகத்தில் சேர்க்கப்பட்டன (: mod: `qiskit.circuit.library`). இயல்பான மற்றும் பதிவு-இயல்பான விநியோகம் ஒற்றுமையற்ற மற்றும் பன்முகப்படுத்தப்பட்ட விநியோகங்களை ஆதரிக்கிறது. குவாண்டம் அலைவீச்சு மதிப்பீடு பயன்படுத்தப்படும் நிதிகளில் உள்ள பயன்பாடுகளுக்கு இந்த சுற்றுகள் மையமாக உள்ளன.

source: Support for pulse gates has been added to the :class:`~qiskit.circuit.QuantumCircuit` class. This enables a :class:`~qiskit.circuit.QuantumCircuit` to override (for basis gates) or specify (for standard and custom gates) a definition of a :class:`~qiskit.circuit.Gate` operation in terms of time-ordered signals across hardware channels. In other words, it enables the option to provide pulse-level custom gate calibrations.
ta_in: துடிப்பு வாயில்களுக்கான ஆதரவு: வகுப்பு: `~ qiskit.circuit.QuantumCircuit` வகுப்பில் சேர்க்கப்பட்டுள்ளது. இது ஒரு: வர்க்கம்: `~ qiskit.circuit.QuantumCircuit` ஐ மேலெழுத (அடிப்படை வாயில்களுக்கு) அல்லது (நிலையான மற்றும் தனிப்பயன் வாயில்களுக்கு) ஒரு: வகுப்பின் வரையறையை குறிப்பிட:` ~ qiskit.circuit.Gate` செயல்பாட்டை நேரத்தின் அடிப்படையில் வன்பொருள் சேனல்கள் முழுவதும் வரிசைப்படுத்தப்பட்ட சமிக்ஞைகள். வேறு வார்த்தைகளில் கூறுவதானால், இது துடிப்பு-நிலை தனிப்பயன் கேட் அளவுத்திருத்தங்களை வழங்குவதற்கான விருப்பத்தை செயல்படுத்துகிறது.

source: The circuits are built exactly as before. For example::
ta_in: சுற்றுகள் முன்பு போலவே கட்டப்பட்டுள்ளன. உதாரணத்திற்கு::

source: Then, the calibration for the gate can be registered using the :class:`~qiskit.circuit.QuantumCircuit` method :meth:`~qiskit.circuit.QuantumCircuit.add_calibration` which takes a :class:`~qiskit.pulse.Schedule` definition as well as the qubits and parameters that it is defined for::
ta_in: பின்னர், வாயிலுக்கான அளவுத்திருத்தத்தை: class: `~ qiskit.circuit.QuantumCircuit` முறை: மெத்:` ~ qiskit.circuit.QuantumCircuit.add_calibration` ஐப் பயன்படுத்தி பதிவு செய்யலாம்: இது ஒரு: வகுப்பு: `~ qiskit.pulse.Schedule `வரையறை மற்றும் இது வரையறுக்கப்பட்டுள்ள குவிட்ஸ் மற்றும் அளவுருக்கள் ::

source: Previously, this functionality could only be used through complete Pulse Schedules. Additionally, circuits can now be submitted to backends with your custom definitions (dependent on backend support).
ta_in: முன்னதாக, இந்த செயல்திறன் மட்டுமே முழுமையான பழுப்பு நேரத்தினால் பயன்படுத்தமுடியும். கூடுதலாக, சுற்றுச்சூழல் இப்போது உங்கள் தனிப்பயன் வரையறைகளுடன் பின்னணிக்கு சமர்ப்பிக்கலாம் (பின்னணி ஆதரவைப் பொறுத்து).

source: Circuits with pulse gates can still be lowered to a :class:`~qiskit.pulse.Schedule` by using the :func:`~qiskit.compiler.schedule` function.
ta_in: பால்ஸ் வாயில்களுடன் மின்சாரம் இன்னும் ஒரு :class:` ~ qiskit.pulse.Schedule ` கூடுதலாக :func:` ~ qiskit.compiler.schedule ` செயல்கூறு பயன்படுத்தப்படுகிறது.

source: The calibrated gate can also be transpiled using the regular transpilation process::
ta_in: கலிப்ரேட் வாயில் வழக்கமான தொடர் பயிற்சி முறையை பயன்படுத்தி transpiled முடியும்::

source: The transpiled circuit will leave the calibrated gates on the same qubit as the original circuit and will not unroll them to the basis gates.
ta_in: இடமாற்றம் செய்யப்பட்ட சுற்று அளவீடு செய்யப்பட்ட வாயில்களை அசல் சுற்றுக்கு ஒத்ததாக இருக்கும், மேலும் அவை அடிப்படை வாயில்களுக்கு அவிழ்க்காது.

source: Support for disassembly of :class:`~qiskit.qobj.PulseQobj` objects has been added to the :func:`qiskit.assembler.disassemble` function. For example:
ta_in: : வகுப்பை பிரிப்பதற்கான ஆதரவு: `~ qiskit.qobj.PulseQobj` பொருள்கள்: func:` qiskit.assembler.disassemble` செயல்பாட்டில் சேர்க்கப்பட்டுள்ளன. உதாரணத்திற்கு:

source: A new kwarg, ``coord_type`` has been added to :func:`qiskit.visualization.plot_bloch_vector`. This kwarg enables changing the coordinate system used for the input parameter that describes the positioning of the vector on the Bloch sphere in the generated visualization. There are 2 supported values for this new kwarg, ``'cartesian'`` (the default value) and ``'spherical'``. If the ``coord_type`` kwarg is set to ``'spherical'`` the list of parameters taken in are of the form ``[r, theta, phi]`` where ``r`` is the radius, ``theta`` is the inclination from +z direction, and ``phi`` is the azimuth from +x direction. For example:
ta_in: ஒரு புதிய குவார்க், `` coord_type`` இல் சேர்க்கப்பட்டுள்ளது: func: `qiskit.visualization.plot_bloch_vector`. உருவாக்கப்பட்ட காட்சிப்படுத்தலில் ப்ளொச் கோளத்தில் திசையனின் நிலைப்பாட்டை விவரிக்கும் உள்ளீட்டு அளவுருவுக்கு பயன்படுத்தப்படும் ஒருங்கிணைப்பு அமைப்பை மாற்ற இந்த குவார்க் உதவுகிறது. இந்த புதிய குவார்க்குக்கு 2 ஆதரவு மதிப்புகள் உள்ளன, `` 'கார்ட்டீசியன்`` (இயல்புநிலை மதிப்பு) மற்றும் ``' கோள வடிவம்``. `` Coord_type`` kwarg `` 'கோள வடிவமாக` அமைக்கப்பட்டால், எடுக்கப்பட்ட அளவுருக்களின் பட்டியல் `` [r, theta, phi] `` எங்கே `` r`` ஆரம், ` `தீட்டா` என்பது + z திசையிலிருந்து வரும் சாய்வு, மற்றும்` `ஃபை` என்பது + x திசையிலிருந்து வரும் அசிமுத் ஆகும். உதாரணத்திற்கு:

source: Pulse :py:class:`~qiskit.pulse.Schedule` objects now support using :py:class:`~qiskit.circuit.ParameterExpression` objects for parameters.
ta_in: துடிப்பு: py: class: `~ qiskit.pulse.Schedule` பொருள்கள் இப்போது இதைப் பயன்படுத்துவதை ஆதரிக்கின்றன: py: class:` ~ qiskit.circuit.ParameterExpression` அளவுருக்கள் பொருள்கள்.

source: Parameter assignment is done via the :meth:`~qiskit.pulse.Schedule.assign_parameters` method::
ta_in: அளவுரு ஒதுக்கீடு: மெத்: `~ qiskit.pulse.Schedule.assign_parameters` முறை வழியாக செய்யப்படுகிறது::

source: Expressions and partial assignment also work, such as::
ta_in: வெளிப்பாடுகள் மற்றும் பகுதி ஒதுக்கீடும் செயல்படுகின்றன, அதாவது::

source: A new visualization function :func:`~qiskit.visualization.timeline_drawer` was added to the :mod:`qiskit.visualization` module.
ta_in: ஒரு புதிய காட்சிப்படுத்தல் செயல்பாடு: func: `~ qiskit.visualization.timeline_drawer`: mod:` qiskit.visualization` தொகுதிக்கு சேர்க்கப்பட்டது.

source: Type checking for the ``params`` kwarg of the constructor for the :class:`~qiskit.circuit.Gate` class and its subclasses has been changed. Previously all :class:`~qiskit.circuit.Gate` parameters had to be in a set of allowed types defined in the :class:`~qiskit.circuit.Instruction` class. Now a new method, :meth:`~qiskit.circuit.Gate.validate_parameter` is used to determine if a parameter type is valid or not. The definition of this method in a subclass will take priority over its parent. For example, :class:`~qiskit.extensions.UnitaryGate` accepts a parameter of the type ``numpy.ndarray`` and defines a custom :meth:`~qiskit.extensionst.UnitaryGate.validate_parameter` method that returns the parameter if it's an ``numpy.ndarray``. This takes priority over the function defined in its parent class :class:`~qiskit.circuit.Gate`. If :class:`~qiskit.extensions.UnitaryGate` were to be used as parent for a new class, this ``validate_parameter`` method would be used unless the new child class defines its own method.
ta_in: வகுப்பு: `~ qiskit.circuit.Gate` வகுப்பு மற்றும் அதன் துணைப்பிரிவுகளுக்கான கட்டமைப்பாளரின்` `அளவுருக்கள்`` குவார்க்கை சரிபார்க்கவும். முன்பு அனைத்தும்: வகுப்பு : `~ qiskit.circuit.Gate` அளவுருக்கள்: class:` ~ qiskit.circuit.Instruction` வகுப்பில் வரையறுக்கப்பட்ட அனுமதிக்கப்பட்ட வகைகளின் தொகுப்பில் இருக்க வேண்டும். இப்போது ஒரு புதிய முறை ,: மெத்: `~ qiskit.circuit.Gate.validate_parameter` ஒரு அளவுரு வகை செல்லுபடியாகுமா இல்லையா என்பதை தீர்மானிக்க பயன்படுத்தப்படுகிறது. துணைப்பிரிவில் இந்த முறையின் வரையறை அதன் பெற்றோரை விட முன்னுரிமை பெறும். முன்னாள்.

source: The previously deprecated methods, arguments, and properties named ``n_qubits`` and ``numberofqubits`` have been removed. These were deprecated in the 0.13.0 release. The full set of changes are:
ta_in: முந்தைய தவறான முறைமைகளும், உரையாடல், மற்றும் பண்புகள் ` ` n_ qubits ` ` ` ` ` numberofqubits ` ` நீக்கப்பட்டுள்ளன. இவை 0.13.0 விடுதலை செய்யப்பட்டன. மாற்றங்களின் முழு அமைப்பு:

source: :class:`~qiskit.circuit.QuantumCircuit.num_qubits`
ta_in: : வகுப்பு: `~ qiskit.circuit.QuantumCircuit`

source: :class:`~qiskit.quantum_info.Pauli`
ta_in: : வகுப்பு: `~ qiskit.quantum_info.Pauli

source: ``numberofqubits``
ta_in: qubits இன் எண்ணிக்கை

source: Function
ta_in: செயல்கூறு

source: Old Argument
ta_in: பழைய ஆர்குமென்ட்

source: New Argument
ta_in: புது ஆர்குமென்ட்

source: Inserting a parameterized :class:`~qiskit.circuit.Gate` instance into a :class:`~qiskit.circuit.QuantumCircuit` now creates a copy of that gate which is used in the circuit. If changes are made to the instance inserted into the circuit it will no longer be reflected in the gate in the circuit. This change was made to fix an issue when inserting a single parameterized :class:`~qiskit.circuit.Gate` object into multiple circuits.
ta_in: ஒரு parameter-ச் செருகுவது :class: `~ qiskit.circuit.Gate` instance ஒரு :class:` ~ qiskit.circuit.QuantumCircuit` இப்போது அந்த வாயிலின் நகலை உருவாக்குகிறது, இது circuitகளில் பயன்படுத்தப்படுகிறது. circuitக்குள் செருகப்பட்ட instanceல் மாற்றங்கள் செய்யப்பட்டால், அது இனி circuitல் உள்ள வாயிலில் பிரதிபலிக்காது. ஒற்றை parameter ஆக்கப்பட்ட :class: `~ qiskit.circuit.Gate` object-ஐ பல circuitகளில் செருகும்போது சிக்கலை சரிசெய்ய இந்த மாற்றம் செய்யப்பட்டது.

source: The function :func:`qiskit.result.marginal_counts` now, by default, does not modify the :class:`qiskit.result.Result` instance parameter. Previously, the ``Result`` object was always modified in place. A new kwarg ``inplace`` has been added :func:`~qiskit.result.marginal_counts` which enables using the previous behavior when ``inplace=True`` is set.
ta_in: The function :func:` qiskit.result.marginal_counts ` now, by default, does not modify the :class:` qiskit.result.Result ` instance parameter. முன்னதாக, ` ` Result ` ` பொருள் எப்போதும் இடத்தில் மாற்றப்பட்டது. ஒரு புதிய kwarg ` ` inplace ` ` inplace ` :func:` ~ qiskit.result.marginal_counts ` ` inplace=True ` ` அமைக்கப்பட்டிருக்கும் போது முந்தைய நடத்தை பயன்படுத்துகிறது.

source: The :class:`~qiskit.circuit.library.U3Gate` definition has been changed to be in terms of the :class:`~qiskit.circuit.library.UGate` class. The :class:`~qiskit.circuit.library.UGate` class has no definition. It is therefore not possible to unroll **every** circuit in terms of U3 and CX anymore. Instead, U and CX can be used for **every** circuit.
ta_in: :class: `~ qiskit.circuit.library.U3Gate` வரையறை :class:` ~ qiskit.circuit.library.UGate` வர்க்கத்தின் அடிப்படையில் மாற்றப்பட்டுள்ளது. :class: `~ qiskit.circuit.library.UGate` வகுப்புக்கு வரையறை இல்லை. எனவே இனி U3 மற்றும் CX ஆகியவற்றின் அடிப்படையில் ** ஒவ்வொரு ** circuitகளையும் unroll செய்வது சாத்தியமில்லை. அதற்கு பதிலாக, U மற்றும் CX ஐ ** ஒவ்வொரு ** circuitக்கும் பயன்படுத்தலாம்.

source: The deprecated support for running Qiskit Terra with Python 3.5 has been removed. To use Qiskit Terra from this release onward you will now need to use at least Python 3.6. If you are using Python 3.5 the last version which will work is Qiskit Terra 0.15.2.
ta_in: Python 3.5 உடன் Qiskit டெர்ராவை இயக்குவதற்கான ஆதரவு நீக்கப்பட்டது. இந்த வெளியீட்டில் இருந்து Qiskit டெர்ராவைப் பயன்படுத்த நீங்கள் இப்போது குறைந்தபட்சம் Python 3.6 ஐப் பயன்படுத்த வேண்டும். நீங்கள் Python 3.5 ஐப் பயன்படுத்துகிறீர்கள் என்றால், வேலை செய்யும் கடைசி பதிப்பு Qiskit டெர்ரா 0.15.2 ஆகும்.

source: In the :class:`~qiskit.providers.models.PulseBackendConfiguration` in the ``hamiltonian`` attributes the ``vars`` field is now returned in a unit of Hz instead of the previously used GHz. This change was made to be consistent with the units used with the other attributes in the class.
ta_in: :class: `~ qiskit.providers.models.PulseBackendConfiguration`` `hamiltonian`` பண்புகளில்` `vars`` புலம் இப்போது முன்னர் பயன்படுத்திய GHz க்கு பதிலாக Hz இன் ஒரு யூனிட்டில் திரும்பியுள்ளது. இந்த மாற்றம் வகுப்பில் உள்ள பிற பண்புகளுடன் பயன்படுத்தப்படும் அலகுகளுடன் ஒத்துப்போகும் வகையில் செய்யப்பட்டது.

source: The previously deprecated support for passing in a dictionary as the first positional argument to :class:`~qiskit.dagcircuit.DAGNode` constructor has been removed. Using a dictonary for the first positional argument was deprecated in the 0.13.0 release. To create a :class:`~qiskit.dagcircuit.DAGNode` object now you should directly pass the attributes as kwargs on the constructor.
ta_in: :class: `~ qiskit.dagcircuit.DAGNode` கன்ஸ்ட்ரக்டருக்கான முதல் நிலை ஆர்குமென்டாக அகராதியில் கடந்து செல்வதற்கான முன்னர் நீக்கப்பட்ட ஆதரவு நீக்கப்பட்டது. முதல் நிலை ஆர்குமென்டிற்கு ஒரு அகராதியைப் பயன்படுத்துவது 0.13.0 வெளியீட்டில் நீக்கப்பட்டது. ஒரு :class: உருவாக்க: `~ qiskit.dagcircuit.DAGNode` பொருளை இப்போது நீங்கள் கன்ஸ்ட்ரக்டரின் மீது kwarg-ஆக பண்புகளை நேரடியாக அனுப்ப வேண்டும்.

source: The keyword arguments for the circuit gate methods (for example: :class:`qiskit.circuit.QuantumCircuit.cx`) ``q``, ``ctl*``, and ``tgt*``, which were deprecated in the 0.12.0 release, have been removed. Instead, only ``qubit``, ``control_qubit*`` and ``target_qubit*`` can be used as named arguments for these methods.
ta_in: சர்க்யூட் கேட் முறைகளுக்கான முக்கிய ஆர்குமென்ட்கள் (எடுத்துக்காட்டாக :class: `qiskit.circuit.QuantumCircuit.cx`)` `q``,` `ctl*` `, மற்றும்` `tgt*` `, அவை நீக்கப்பட்டன 0.12.0 வெளியீட்டில் அகற்றப்பட்டது. அதற்கு பதிலாக, இந்த முறைகளுக்கு பெயரிடப்பட்ட ஆர்குமென்ட்களாக `` qubit``, `` control_qubit* `` மற்றும் `` target_qubit* `` மட்டுமே பயன்படுத்த முடியும்.

source: The previously deprecated module ``qiskit.extensions.standard`` has been removed. This module has been deprecated since the 0.14.0 release. The :mod:`qiskit.circuit.library` can be used instead. Additionally, all the gate classes previously in ``qiskit.extensions.standard`` are still importable from :mod:`qiskit.extensions`.
ta_in: முன்னர் நீக்கப்பட்ட தொகுதி `` கிஸ்கிட். நீட்டிப்புகள். நிலையான`` அகற்றப்பட்டது. 0.14.0 வெளியீட்டிலிருந்து இந்த தொகுதி நீக்கப்பட்டது. அதற்கு பதிலாக: மொட் : `qகிஸ்கிட்.சர்க்யூட்.லைப்ரரி `. இதில் உலகளாவிய ஆர் வாயில் (:கிளாஸ் :` ~ கிஸ்கிட்.சர்க்யூட்.லைப்ரரி .ஜி ஆர் `), உலகளாவிய ஆர் எக்ஸ்` ஐப் பயன்படுத்தலாம். கூடுதலாக, `` கிஸ்கிட். நீட்டிப்புகள். நிலையான`` இல் உள்ள அனைத்து கேட் வகுப்புகளும் இன்னும் இறக்குமதி செய்யப்படுகின்றன: மொட் : `கிஸ்கிட். நீட்டிப்புகள்`.

source: The previously deprecated gates in the module ``qiskit.extensions.quantum_initializer``: ``DiagGate``, `UCG``, ``UCPauliRotGate``, ``UCRot``, ``UCRXGate``, ``UCX``, ``UCRYGate``, ``UCY``, ``UCRZGate``, ``UCZ`` have been removed. These were all deprecated in the 0.14.0 release and have alternatives available in the circuit library (:mod:`qiskit.circuit.library`).
ta_in: `` கிஸ்கிட். நீட்டிப்புகள் தொகுதியில் முன்னர் நீக்கப்பட்ட வாயில்கள். குவாண்டம்_இனிட்டலைசர்``: `` டயகேட்``, `யு.சி.ஜி``,` `யு.சி.பாலி ரோட்கேட்``,` `யூ.சி.ஆர்.ஓ.டி``,` `யு.சி.ஆர்.எக்ஸ் கேட்``,` `யு.சி.எக்ஸ்``,` `யூ.சி.ஆர்.ஜேட்``,` `யூ.சி.வி``, `` யூ.சி.ஆர்.ஜேட்கேட் ``, ``.சி.சி.ஜேட்`` நீக்கப்பட்டன. இவை அனைத்தும் 0.14.0 வெளியீட்டில் நீக்கப்பட்டன மற்றும் சுற்று நூலகத்தில் மாற்று வழிகள் உள்ளன (: மொட்: `கிஸ்கிட்.சர்க்யூட்.லைப்ரரி`).

source: The previously deprecated :class:`qiskit.circuit.QuantumCircuit` gate method :meth:`~qiskit.circuit.QuantumCircuit.iden` has been removed. This was deprecated in the 0.13.0 release and :meth:`~qiskit.circuit.QuantumCircuit.i` or :meth:`~qiskit.circuit.QuantumCircuit.id` can be used instead.
ta_in: முன்பிருந்த :class: `qiskit.circuit.QuantumCircuit` கேட் முறை :meth:` ~ qiskit.circuit.QuantumCircuit.iden` அகற்றப்பட்டது. இது 0.13.0 வெளியீட்டில் நீக்கப்பட்டது மற்றும் :meth: `~ qiskit.circuit.QuantumCircuit.i` அல்லது :meth:` ~ qiskit.circuit.QuantumCircuit.id` ஐ இதற்குப் பதிலாகப் பயன்படுத்தலாம்.

source: The use of a ``numpy.ndarray`` for a parameter in the ``params`` kwarg for the constructor of the :class:`~qiskit.circuit.Gate` class and subclasses has been deprecated and will be removed in future releases. This was done as part of the refactoring of how ``parms`` type checking is handled for the :class:`~qiskit.circuit.Gate` class. If you have a custom gate class which is a subclass of :class:`~qiskit.circuit.Gate` directly (or via a different parent in the hierarchy) that accepts an ``ndarray`` parameter, you should define a custom :meth:`~qiskit.circuit.Gate.validate_parameter` method for your class that will return the allowed parameter type. For example::
ta_in: :class: இன் கன்ஸ்ட்ரக்டருக்கான ``params`` kwargல் ஒரு parameterக்கு ``numpy.ndarray`` இன் பயன்பாடு : `~ qiskit.circuit.Gate` வகுப்பு மற்றும் துணைப்பிரிவுகள் நீக்கப்பட்டன, அவை எதிர்காலத்தில் அகற்றப்படும் வெளியீடுகள். :class: `~ qiskit.circuit.Gate` வகுப்பிற்கு ``params`` வகை சோதனை எவ்வாறு கையாளப்படுகிறது என்பதற்கான மறுசீரமைப்பின் ஒரு பகுதியாக இது செய்யப்பட்டது. உங்களிடம் கஸ்டம் கேட் வகுப்பு இருந்தால் :class: `~ qiskit.circuit.Gate` நேரடியாக (அல்லது வரிசைக்கு வேறுபட்ட பெற்றோர் வழியாக)` `ndarray`` parameterஐ ஏற்றுக்கொள்கிறது, நீங்கள் ஒரு கஸ்டத்தை வரையறுக்க வேண்டும் :meth: உங்கள் வகுப்பிற்கான `qiskit.circuit.Gate.validate_parameter` முறை அனுமதிக்கப்பட்ட parameter வகையைத் தரும். உதாரணத்திற்கு::

source: The :attr:`~qiskit.circuit.library.PiecewiseLinearPauliRotations.num_ancilla_qubits` property of the :class:`~qiskit.circuit.library.PiecewiseLinearPauliRotations` and :class:`~qiskit.circuit.library.PolynomialPauliRotations` classes has been deprecated and will be removed in a future release. Instead the property :attr:`~qiskit.circuit.library.PolynomialPauliRotations.num_ancillas` should be used instead. This was done to make it consistent with the :class:`~qiskit.circuit.QuantumCircuit` method :meth:`~qiskit.circuit.QuantumCircuit.num_ancillas`.
ta_in: :class:`~qiskit.circuit.library.PiecewiseLinearPauliRotations` இன் பண்பு :attr:`~qiskit.circuit.library.PiecewiseLinearPauliRotations.num_ancilla_qubits` மற்றும் :class:`~qiskit.circuit.library.PolynomialPauliRotations` எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக :attr: `~ qiskit.circuit.library.PolynomialPauliRotations.num_ancillas` பயன்படுத்தப்பட வேண்டும். :class: `~ qiskit.circuit.QuantumCircuit` முறை :meth:` ~ qiskit.circuit.QuantumCircuit.num_ancillas` உடன் ஒத்துப்போக இது செய்யப்பட்டது.

source: The :class:`qiskit.circuit.library.MSGate` class has been deprecated, but will remain in place to allow loading of old jobs. It has been replaced with the :class:`qiskit.circuit.library.GMS` class which should be used instead.
ta_in: :class: `qiskit.circuit.library.MSGate` வகுப்பு நீக்கப்பட்டது, ஆனால் பழைய வேலைகளை ஏற்ற அனுமதிக்க அந்த இடத்தில் இருக்கும். இது :class: `qiskit.circuit.library.GMS` வகுப்பால் மாற்றப்பட்டுள்ளது, அதற்கு பதிலாக பயன்படுத்தப்பட வேண்டும்.

source: The :class:`~qiskit.transpiler.passes.MSBasisDecomposer` transpiler pass has been deprecated and will be removed in a future release. The :class:`qiskit.transpiler.passes.BasisTranslator` pass can be used instead.
ta_in: :class: `~ qiskit.transpiler.passes.MSBasisDecomposer` டிரான்ஸ்பைலர் பாஸ் நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். :class: `qiskit.transpiler.passes.BasisTranslator` பாஸைப் பயன்படுத்தலாம்.

source: The :class:`~qiskit.circuit.QuantumCircuit` methods ``u1``, ``u2`` and ``u3`` are now deprecated. Instead the following replacements can be used.
ta_in: :class: `~ qiskit.circuit.QuantumCircuit` முறைகள்` `u1``,` `u2`` மற்றும்` `u3`` ஆகியவை இப்போது நீக்கப்பட்டன. அதற்கு பதிலாக பின்வரும் மாற்றுகளைப் பயன்படுத்தலாம்.

source: The gate classes themselves, :class:`~qiskit.circuit.library.U1Gate`, :class:`~qiskit.circuit.library.U2Gate` and :class:`~qiskit.circuit.library.U3Gate` remain, to allow loading of old jobs.
ta_in: கேட் வகுப்புகள் :class: `~ qiskit.circuit.library.U1Gate` , :class:` ~ qiskit.circuit.library.U2Gate` மற்றும் :class: `~ qiskit.circuit.library.U3Gate` பழைய வேலைகளை ஏற்ற அனுமதிக்க உள்ளன.

source: The :class:`~qiskit.result.Result` class's methods :meth:`~qiskit.result.Result.data`, :meth:`~qiskit.result.Result.get_memory`, :meth:`~qiskit.result.Result.get_counts`, :meth:`~qiskit.result.Result.get_unitary`, and :meth:`~qiskit.result.Result.get_statevector ` will now emit a warning when the ``experiment`` kwarg is specified for attempting to fetch results using either a :class:`~qiskit.circuit.QuantumCircuit` or :class:`~qiskit.pulse.Schedule` instance, when more than one entry matching the instance name is present in the ``Result`` object. Note that only the first entry matching this name will be returned. Fixes `#3207 <https://github.com/Qiskit/qiskit-terra/issues/3207>`__
ta_in: :class: `~ qiskit.result.Result` வகுப்பின் முறைகள் :meth:` ~ qiskit.result.Result.data` , :meth: `~ qiskit.result.Result.get_memory` , :meth:` ~ qiskit.result .Result.get_counts` , :meth: `~ qiskit.result.Result.get_unitary`, மற்றும் :meth:` ~ qiskit.result.Result.get_statevector `இப்போது` `சோதனை`` kwarg குறிப்பிடப்படும்போது ஒரு எச்சரிக்கையை வெளியிடும் a :class: `~ qiskit.circuit.QuantumCircuit` அல்லது :class:` ~ qiskit.pulse.Schedule` உதாரணத்தைப் பயன்படுத்தி முடிவுகளைப் பெற முயற்சிக்கிறது, ``Result`` objectஇல் instance பெயருடன் பொருந்தக்கூடிய ஒன்றுக்கு மேற்பட்ட பதிவுகள் இருக்கும்போது. இந்த பெயருடன் பொருந்தக்கூடிய முதல் நுழைவு மட்டுமே திரும்பும் என்பதை நினைவில் கொள்க. `# 3207 <https://github.com/Qiskit/qiskit-terra/issues/3207>` __

source: The :class:`qiskit.circuit.QuantumCircuit` method :meth:`~qiskit.circuit.QuantumCircuit.append` can now be used to insert one parameterized gate instance into multiple circuits. This fixes a previous issue where inserting a single parameterized :class:`~qiskit.circuit.Gate` object into multiple circuits would cause failures when one circuit had a parameter assigned. Fixes `#4697 <https://github.com/Qiskit/qiskit-terra/issues/4697>`__
ta_in: :class: `qiskit.circuit.QuantumCircuit` முறை :meth:` ~ qiskit.circuit.QuantumCircuit.append` இப்போது ஒரு parameter gateன் நிகழ்வை பல circuitகளில் செருக பயன்படுத்தலாம். ஒற்றை parameterஐச் செருகும் முந்தைய சிக்கலை இது சரிசெய்கிறது :class: `qiskit.circuit.Gate` பொருள் பல circuitகளில் ஒரு circuitக்கு ஒரு parameter ஒதுக்கப்பட்டால் தோல்விகளை ஏற்படுத்தும். சரிசெய்யப்படும் பிழை `# 4697 <https://github.com/Qiskit/qiskit-terra/issues/4697>` __

source: Previously the :func:`qiskit.execute.execute` function would incorrectly disallow both the ``backend`` and ``pass_manager`` kwargs to be specified at the same time. This has been fixed so that both ``backend`` and ``pass_manager`` can be used together on calls to :func:`~qiskit.execute.execute`. Fixes `#5037 <https://github.com/Qiskit/qiskit-terra/issues/5037>`__
ta_in: முன்னதாக :func: `qiskit.execute.execute` செயல்பாடு ஒரே நேரத்தில் குறிப்பிட``backend`` மற்றும் ``pass_manager`` kwargகள் இரண்டையும் தவறாக அனுமதிக்காது. இது சரி செய்யப்பட்டது, இதனால் ``backend`` மற்றும் ``pass_manager`` ஆகிய இரண்டையும் ஒன்றாக அழைப்பதில் பயன்படுத்தலாம் :func: `~ qiskit.execute.execute`. திருத்தங்கள் `# 5037 <https://github.com/Qiskit/qiskit-terra/issues/5037>` __
