Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: Add ``ControlledGate`` class for representing controlled gates. Controlled gate instances are created with the ``control(n)`` method of ``Gate`` objects where ``n`` represents the number of controls. The control qubits come before the controlled qubits in the new gate. For example::
ta_in: கட்டுப்படுத்தப்பட்ட வாயில்களைக் குறிக்க `` ControlledGate`` வகுப்பைச் சேர்க்கவும். கட்டுப்படுத்தப்பட்ட வாயில் நிகழ்வுகள் `` control(n) `` `` Gate`` பொருட்களின் முறை மூலம் உருவாக்கப்படுகின்றன, அங்கு ``n`` கட்டுப்பாடுகளின் எண்ணிக்கையைக் குறிக்கிறது. கட்டுப்பாட்டு வாயில்கள் புதிய வாயிலில் கட்டுப்படுத்தப்பட்ட குவிட்டுகளுக்கு முன் வருகின்றன. உதாரணத்திற்கு::

source: generates::
ta_in: உருவாக்குகிறது::

source: Allowed values of ``meas_level`` parameters and fields can now be a member from the `IntEnum` class ``qiskit.qobj.utils.MeasLevel``. This can be used when calling ``execute`` (or anywhere else ``meas_level`` is specified) with a pulse experiment. For example::
ta_in: `` meas_level`` அளவுருக்கள் மற்றும் புலங்களின் அனுமதிக்கப்பட்ட மதிப்புகள் இப்போது `IntEnum` வகுப்பிலிருந்து` `qiskit.qobj.utils.MeasLevel`` உறுப்பினராக இருக்கலாம். ஒரு துடிப்பு பரிசோதனையுடன் `` execute`` (அல்லது வேறு எங்கும் ``meas_level`` குறிப்பிடப்பட்டுள்ளது) அழைக்கும் போது இதைப் பயன்படுத்தலாம். உதாரணத்திற்கு::

source: In this above example, ``meas_level=MeasLevel.CLASSIFIED`` and ``meas_level=2`` can be used interchangably now.
ta_in: மேலே உள்ள இந்த எடுத்துக்காட்டில், `` measure_level = MeasLevel.CLASSIFIED`` மற்றும் `` measure_level = 2`` ஆகியவற்றை இப்போது பரிமாறிக் கொள்ளலாம்.

source: A new layout selector based on constraint solving is included. `CSPLayout` models the problem of finding a layout as a constraint problem and uses recursive backtracking to solve it.
ta_in: தடை தீர்க்கும் அடிப்படையில் புதிய தளவமைப்பு தேர்வுக்குழு சேர்க்கப்பட்டுள்ளது. `CSPLayout` ஒரு தளவமைப்பைக் கண்டுபிடிப்பதில் உள்ள சிக்கலை ஒரு கட்டுப்பாட்டு சிக்கலாக மாதிரியாகக் கொண்டு, அதைத் தீர்க்க சுழல்நிலை பின்னடைவைப் பயன்படுத்துகிறது.

source: The parameter ``CSPLayout(...,strict_direction=True)`` is more restrictive but it will guarantee there is no need of running ``CXDirection`` after.
ta_in: `` CSPLayout (...,strict_direction=True) `` அளவுரு மிகவும் கட்டுப்படுத்தப்பட்டுள்ளது, ஆனால் அதற்குப் பிறகு `` CXDirection`` ஐ இயக்க வேண்டிய அவசியமில்லை என்பதற்கு இது உத்தரவாதம் அளிக்கும்.

source: If the constraint system is not solvable, the `layout` property is not set.
ta_in: கட்டுப்பாட்டு அமைப்பு தீர்க்கப்படாவிட்டால், `layout` சொத்து அமைக்கப்படவில்லை.

source: PulseBackendConfiguration (accessed normally as backend.configuration()) has been extended with useful methods to explore its data and the functionality that exists in PulseChannelSpec. PulseChannelSpec will be deprecated in the future. For example::
ta_in: PulseBackendConfiguration (பொதுவாக backend.configuration () என அணுகப்படுகிறது) அதன் தரவையும் பல்ஸ் சேனல்ஸ்பெக்கில் இருக்கும் செயல்பாட்டையும் ஆராய பயனுள்ள முறைகள் மூலம் நீட்டிக்கப்பட்டுள்ளது. பல்ஸ் சேனல்ஸ்பெக் எதிர்காலத்தில் நீக்கப்படும். உதாரணத்திற்கு::

source: ``PulseDefaults`` (accessed normally as ``backend.defaults()``) has an attribute, ``circuit_instruction_map`` which has the methods of CmdDef. The new `circuit_instruction_map` is an ``InstructionScheduleMap`` object with three new functions beyond what CmdDef had:
ta_in: "PulseDefaults" (பொதுவாக "backend.defaults()"என அணுகப்படுகிறது) ஒரு பண்புக்கூறு உள்ளது, "circuit_instruction_map" இது CmdDef இன் முறைகளைக் கொண்டுள்ளது. புதிய 'circuit_instruction_map' CmdDef என்ன அப்பால் மூன்று புதிய செயல்பாடுகளை ஒரு "InstructionScheduleMap" பொருள்:

source: qubit_instructions(qubits) returns the operations defined for the qubits
ta_in: qubit_instructions (qubits) குவிட்டுகளுக்கு வரையறுக்கப்பட்ட செயல்பாடுகளை வழங்குகிறது

source: assert_has(instruction, qubits) raises an error if the op isn't defined
ta_in: op வரையறுக்கப்படவில்லை எனில் assert_has (அறிவுறுத்தல், qubits) ஒரு பிழையை எழுப்புகிறது

source: remove(instruction, qubits) like pop, but doesn't require parameters
ta_in: பாப் போன்ற நீக்கு (அறிவுறுத்தல், குவிட்ஸ்), ஆனால் அளவுருக்கள் தேவையில்லை

source: There are some differences from the CmdDef:
ta_in: CmdDef இலிருந்து சில வேறுபாடுகள் உள்ளன:

source: ``__init__`` takes no arguments
ta_in: `` __init__`` எந்த வாதங்களையும் எடுக்கவில்லை

source: ``cmds`` and ``cmd_qubits`` are deprecated and replaced with ``instructions`` and ``qubits_with_instruction``
ta_in: `` cmds`` மற்றும் `` cmd_qubits`` ஆகியவை நீக்கப்பட்டு, `` instructions`` மற்றும் `` qubits_with_instruction``

source: Example::
ta_in: உதாரணமாக::

source: A new kwarg parameter, ``show_framechange_channels`` to optionally disable displaying channels with only framechange instructions in pulse visualizations was added to the ``qiskit.visualization.pulse_drawer()`` function and ``qiskit.pulse.Schedule.draw()`` method. When this new kwarg is set to ``False`` the output pulse schedule visualization will not include any channels that only include frame changes.
ta_in: ஒரு புதிய க்வார்க் அளவுரு, "show_framechange_channels" விருப்பமாக சேனல்களை செயல்முடக்கு," qiskit.visualization.pulse_drawer()'' செயல்பாடு மற்றும் "qiskit.pulse.Schedule.draw()" முறை க்கு சேர்க்கப்பட்டது. இந்த புதிய க்வார்க் "தவறு" என அமைக்கப்படும்போது வெளியீட்டு துடிப்பு அட்டவணை காட்சிப்படுத்தல் மட்டுமே சட்ட மாற்றங்களை உள்ளடக்கிய எந்த சேனல்களையும் உள்ளடக்காது.

source: A new utility function ``qiskit.result.marginal_counts()`` is added which allows marginalization of the counts over some indices of interest. This is useful when more qubits are measured than needed, and one wishes to get the observation counts for some subset of them only.
ta_in: ஒரு புதிய பயன்பாட்டு செயல்பாடு `` qiskit.result.marginal_counts () `` சேர்க்கப்பட்டுள்ளது, இது சில வட்டி குறியீடுகளில் எண்ணிக்கையை ஓரங்கட்ட அனுமதிக்கிறது. தேவைக்கு அதிகமான குவிட்கள் அளவிடப்படும்போது இது பயனுள்ளதாக இருக்கும், மேலும் அவற்றில் சில துணைக்குழுக்களுக்கு மட்டுமே அவதானிப்பு எண்ணிக்கையைப் பெற ஒருவர் விரும்புகிறார்.

source: When ``passmanager.run(...)`` is invoked with more than one circuit, the transpilation of these circuits will run in parallel.
ta_in: `` Passmanager.run (...) `` ஒன்றுக்கு மேற்பட்ட சுற்றுடன் பயன்படுத்தப்படும்போது, ​​இந்த சுற்றுகளின் இடமாற்றம் இணையாக இயங்கும்.

source: PassManagers can now be sliced to create a new PassManager containing a subset of passes using the square bracket operator. This allow running or drawing a portion of the PassManager for easier testing and visualization. For example let's try to draw the first 3 passes of a PassManager pm, or run just the second pass on our circuit:
ta_in: சதுர அடைப்புக்குறி ஆபரேட்டரைப் பயன்படுத்தி பாஸின் துணைக்குழுவைக் கொண்ட புதிய பாஸ்மேனேஜரை உருவாக்க பாஸ்மேனேஜர்களை இப்போது வெட்டலாம். இது எளிதாக சோதனை மற்றும் காட்சிப்படுத்தலுக்காக பாஸ்மேனேஜரின் ஒரு பகுதியை இயக்க அல்லது வரைய அனுமதிக்கிறது. எடுத்துக்காட்டாக, பாஸ்மேனேஜரின் முதல் 3 பாஸ்களை வரைய முயற்சிப்போம், அல்லது எங்கள் சுற்றில் இரண்டாவது பாஸை இயக்கலாம்:

source: Also now, PassManagers can be created by adding two PassManagers or by directly adding a pass/list of passes to a PassManager.
ta_in: இப்போது, ​​பாஸ்மேனேஜர்களை இரண்டு பாஸ்மேனேஜர்களைச் சேர்ப்பதன் மூலம் அல்லது பாஸ் மேனேஜரில் பாஸ் / பாஸின் பட்டியலை நேரடியாக சேர்ப்பதன் மூலம் உருவாக்க முடியும்.

source: A basic ``scheduler`` module has now been added to Qiskit. The `scheduler` schedules an input transpiled ``QuantumCircuit`` into a pulse ``Schedule``. The scheduler accepts as input a ``Schedule`` and either a pulse ``Backend``, or a ``CmdDef`` which relates circuit ``Instruction`` objects on specific qubits to pulse Schedules and a ``meas_map`` which determines which measurements must occur together.
ta_in: ஒரு அடிப்படை "scheduler" தொகுதி இப்போது Qiskit சேர்க்கப்பட்டுள்ளது. 'scheduler' ஒரு உள்ளீடு 'QuantumCircuit' ஒரு துடிப்பு "அட்டவணை" க்கு மாற்றுகிறது. திட்டமிடுநர் உள்ளீடு ஒரு "அட்டவணை" மற்றும் ஒரு துடிப்பு "பின்முனை", அல்லது ஒரு "CmdDef" இது ஒரு குறிப்பிட்ட qubits மீது சுற்று "அறிவுறுத்தல்" பொருட்கள் மற்றும் ஒரு "meas_map" ஒன்றாக நிகழ வேண்டும் என்பதை தீர்மானிக்கிறது.

source: Scheduling example::
ta_in: எடுத்துக்காட்டு திட்டமிடல்::

source: The scheduler currently supports two scheduling policies, `as_late_as_possible` (``alap``) and `as_soon_as_possible` (``asap``), which respectively schedule pulse instructions to occur as late as possible or as soon as possible across qubits in a circuit. The scheduling policy may be selected with the input argument ``method``, for example::
ta_in: திட்டமிடுபவர் தற்போது இரண்டு திட்டமிடல் கொள்கைகளை ஆதரிக்கிறார், `as_late_as_possible` (``alap``) மற்றும்` as_soon_as_possible` (`` asap``), இவை முறையே துடிப்பு வழிமுறைகளை முடிந்தவரை தாமதமாக அல்லது விரைவில் ஒரு குவிட்ஸில் நிகழும் என்று திட்டமிடுகின்றன. சுற்று. உள்ளீட்டு வாதம் ``method` உடன் திட்டமிடல் கொள்கை தேர்ந்தெடுக்கப்படலாம், எடுத்துக்காட்டாக::

source: It is easy to use a pulse ``Schedule`` within a ``QuantumCircuit`` by mapping it to a custom circuit instruction such as a gate which may be used in a ``QuantumCircuit``. To do this, first, define the custom gate and then add an entry into the ``CmdDef`` for the gate, for each qubit that the gate will be applied to. The gate can then be used in the ``QuantumCircuit``. At scheduling time the gate will be mapped to the underlying pulse schedule. Using this technique allows easy integration with preexisting qiskit modules such as Ignis.
ta_in: `` QuantumCircuit`` க்குள் ஒரு துடிப்பு `` Schedule`` பயன்படுத்த எளிதானது, இது ஒரு `QuantumCircuit`` இல் பயன்படுத்தப்படக்கூடிய கேட் போன்ற தனிப்பயன் சுற்று அறிவுறுத்தலுடன் மேப்பிங் செய்வதன் மூலம். இதைச் செய்ய, முதலில், தனிப்பயன் வாயிலை வரையறுத்து, பின்னர் நுழைவாயிலுக்கு `` CmdDef`` இல் ஒரு நுழைவைச் சேர்க்கவும், ஒவ்வொரு குவிட்டிற்கும் கேட் பயன்படுத்தப்படும். இந்த வாயிலை `` QuantumCircuit`` இல் பயன்படுத்தலாம். திட்டமிடல் நேரத்தில் கேட் அடிப்படை துடிப்பு அட்டவணைக்கு மாற்றப்படும். இந்த நுட்பத்தைப் பயன்படுத்துவது இக்னிஸ் போன்ற முன்பே இருக்கும் கிஸ்கிட் தொகுதிகளுடன் எளிதாக ஒருங்கிணைக்க அனுமதிக்கிறது.

source: The feature for transpiling in parallel when ``passmanager.run(...)`` is invoked with more than one circuit is not supported under Windows. See `#2988 <https://github.com/Qiskit/qiskit-terra/issues/2988>`__ for more details.
ta_in: ஒன்றுக்கு மேற்பட்ட சுற்றுடன் `` passmanager.run (...) `` செயல்படுத்தப்படும்போது இணையாக மாற்றுவதற்கான அம்சம் விண்டோஸின் கீழ் ஆதரிக்கப்படாது. மேலும் விவரங்களுக்கு `# 2988 <https://github.com/Qiskit/qiskit-terra/issues/2988>` __ ஐப் பார்க்கவும்.

source: The ``qiskit.pulse.channels.SystemTopology`` class was used as a helper class for ``PulseChannelSpec``. It has been removed since with the deprecation of ``PulseChannelSpec`` and changes to ``BackendConfiguration`` make it unnecessary.
ta_in: `` Qiskit.pulse.channels.SystemTopology`` வகுப்பு `` PulseChannelSpec`` க்கு ஒரு உதவி வகுப்பாகப் பயன்படுத்தப்பட்டது. `` PulseChannelSpec`` நீக்கப்பட்டதோடு, `` BackendConfiguration``க்கான மாற்றங்களும் தேவையற்றதாக இருப்பதால் இது அகற்றப்பட்டது.

source: The previously deprecated representation of qubits and classical bits as tuple, which was deprecated in the 0.9 release, has been removed. The use of ``Qubit`` and ``Clbit`` objects is the new way to represent qubits and classical bits.
ta_in: 0.9 வெளியீட்டில் நீக்கப்பட்ட குவிட்ஸ் மற்றும் கிளாசிக்கல் பிட்களை டூப்பிள் என முன்னர் நீக்கப்பட்ட பிரதிநிதித்துவம் நீக்கப்பட்டது. `` Qubit`` மற்றும் `` Clbit`` பொருள்களின் பயன்பாடு குவிட்ஸ் மற்றும் கிளாசிக்கல் பிட்களைக் குறிக்கும் புதிய வழியாகும்.

source: The previously deprecated representation of the basis set as single string has been removed. A list of strings is the new preferred way.
ta_in: ஒற்றை சரம் என அமைக்கப்பட்ட அடிப்படையின் முன்னர் நீக்கப்பட்ட பிரதிநிதித்துவம் நீக்கப்பட்டது. சரங்களின் பட்டியல் புதிய விருப்பமான வழி.

source: The method ``BaseModel.as_dict``, which was deprecated in the 0.9 release, has been removed in favor of the method ``BaseModel.to_dict``.
ta_in: 0.9 வெளியீட்டில் நீக்கப்பட்ட "BaseModel.as_dict" முறை "BaseModel.to_dict" முறைக்கு ஆதரவாக நீக்கப்பட்டது.

source: In PulseDefaults (accessed normally as backend.defaults()), ``qubit_freq_est`` and ``meas_freq_est`` are now returned in Hz rather than GHz. This means the new return values are 1e9 * their previous value.
ta_in: PulseDefaults இல் (பொதுவாக backend.defaults ()என அணுகப்படுகிறது), "qubit_freq_est" மற்றும் "meas_freq_est" ஆகியவை இப்போது GHz க்கு பதிலாக Hz இல் திரும்புகின்றன. அதாவது புதிய ரிட்டர்ன் மதிப்புகள் 1e9 * அவற்றின் முந்தைய மதிப்பு.

source: `dill <https://pypi.org/project/dill/>`__ was added as a requirement. This is needed to enable running ``passmanager.run()`` in parallel for more than one circuit.
ta_in: `வெந்தயம் <https://pypi.org/project/dill/>` __ ஒரு தேவையாக சேர்க்கப்பட்டது. ஒன்றுக்கு மேற்பட்ட சுற்றுக்கு இணையாக `` passmanager.run () `` ஐ இயக்க இது தேவைப்படுகிறது.

source: The previously deprecated gate ``UBase``, which was deprecated in the 0.9 release, has been removed. The gate ``U3Gate`` should be used instead.
ta_in: முன்பு நீக்கப்பட்ட கேட் `` UBase``, 0.9 வெளியீட்டில் நீக்கப்பட்டது, அகற்றப்பட்டது. அதற்கு பதிலாக `` U3Gate`` என்ற வாயில் பயன்படுத்தப்பட வேண்டும்.

source: The previously deprecated gate ``CXBase``, which was deprecated in the 0.9 release, has been removed. The gate ``CnotGate`` should be used instead.
ta_in: முன்னர் நீக்கப்பட்ட கேட் `` CXBase``, 0.9 வெளியீட்டில் நீக்கப்பட்டது, அகற்றப்பட்டது. அதற்கு பதிலாக `` CnotGate`` என்ற வாயில் பயன்படுத்தப்பட வேண்டும்.

source: The instruction ``snapshot`` used to implicitly convert the ``label`` parameter to string. That conversion has been removed and an error is raised if a string is not provided.
ta_in: ``snapshot`` என்ற அறிவுறுத்தல் ``label`` அளவுருவை மறைமுகமாக சரமாக மாற்ற பயன்படுகிறது. அந்த மாற்றம் நீக்கப்பட்டு, ஒரு சரம் வழங்கப்படாவிட்டால் பிழை எழுப்பப்படுகிறது.

source: The previously deprecated gate ``U0Gate``, which was deprecated in the 0.9 release, has been removed. The gate ``IdGate`` should be used instead to insert delays.
ta_in: முன்னர் நீக்கப்பட்ட கேட் `` U0Gate``, 0.9 வெளியீட்டில் நீக்கப்பட்டது, அகற்றப்பட்டது. தாமதங்களைச் செருகுவதற்கு பதிலாக ``IdGate`` என்ற கேட் பயன்படுத்தப்பட வேண்டும்.

source: The ``qiskit.pulse.CmdDef`` class has been deprecated. Instead you should use the ``qiskit.pulse.InstructionScheduleMap``. The ``InstructionScheduleMap`` object for a pulse enabled system can be accessed at ``backend.defaults().instruction_schedules``.
ta_in: `` Qiskit.pulse.CmdDef`` வகுப்பு நீக்கப்பட்டது. அதற்கு பதிலாக நீங்கள் `` qiskit.pulse.InstructionScheduleMap`` ஐப் பயன்படுத்த வேண்டும். துடிப்பு இயக்கப்பட்ட அமைப்பிற்கான `` InstructionScheduleMap`` பொருளை `` backend.defaults().instruction_schedules``.

source: ``PulseChannelSpec`` is being deprecated. Use ``BackendConfiguration`` instead. The backend configuration is accessed normally as ``backend.configuration()``. The config has been extended with most of the functionality of PulseChannelSpec, with some modifications as follows, where `0` is an exemplary qubit index::
ta_in: "PulseChannelSpec" நீக்கப்படுகிறது. அதற்கு பதிலாக "பின்முனைஉள்ளமைவு" பயன்படுத்தவும். பின்முனை கட்டமைப்பு பொதுவாக "backend.configuration()" என அணுகப்படுகிறது. உள்ளமைவு PulseChannelSpec இன் பெரும்பாலான செயல்பாடுகளுடன் நீட்டிக்கப்பட்டுள்ளது, சில மாற்றங்களுடன் பின்வருமாறு, '0' ஒரு முன்மாதிரி க்யூபிட் அட்டவணை::

source: Now, if there is an attempt to get a channel for a qubit which does not exist for the device, a ``BackendConfigurationError`` will be raised with a helpful explanation.
ta_in: இப்போது, ​​சாதனத்திற்கு இல்லாத ஒரு குவிட்டிற்கான சேனலைப் பெற முயற்சி இருந்தால், ஒரு பயனுள்ள விளக்கத்துடன் ``BackendConfigurationError`` எழுப்பப்படும்.

source: The methods ``memoryslots`` and ``registerslots`` of the PulseChannelSpec have not been migrated to the backend configuration. These classical resources are not restrained by the physical configuration of a backend system. Please instantiate them directly::
ta_in: பல்ஸ் சேனல்ஸ்பெக்கின் `` memoryslots`` மற்றும் `` registerslots`` முறைகள் பின்தளத்தில் உள்ளமைவுக்கு இடம்பெயரவில்லை. இந்த கிளாசிக்கல் வளங்கள் பின்தளத்தில் அமைப்பின் இயற்பியல் உள்ளமைவால் கட்டுப்படுத்தப்படவில்லை. தயவுசெய்து அவற்றை நேரடியாக நிறுவவும்::

source: The ``qubits`` method is not migrated to backend configuration. The result of ``qubits`` can be built as such::
ta_in: ``qubits`` முறை பின்தளத்தில் உள்ளமைவுக்கு மாற்றப்படவில்லை. ``qubits`` இன் முடிவை இவ்வாறு உருவாக்கலாம்::

source: ``Qubit`` within ``pulse.channels`` has been deprecated. They should not be used. It is possible to obtain channel <=> qubit mappings through the BackendConfiguration (or backend.configuration()).
ta_in: 'பல்ஸ்.சேனல்'களில் 'க்யூபிட்' என்ற புதிய வகை க்ரூப் நீக்கப்பட்டுள்ளது. அவை பயன்படுத்தப்படக் கூடாது. பின்எண்ட்கட்டமைப்பு (அல்லது backend.configuration())மூலம் சேனல் <=> qubit வரையிணைப்புகளைப் பெற முடியும்.

source: The function ``qiskit.visualization.circuit_drawer.qx_color_scheme()`` has been deprecated. This function is no longer used internally and doesn't reflect the current IBM QX style. If you were using this function to generate a style dict locally you must save the output from it and use that dictionary directly.
ta_in: `` Qiskit.visualization.circuit_drawer.qx_color_scheme () `` செயல்பாடு நீக்கப்பட்டது. இந்த செயல்பாடு இனி உள்நாட்டில் பயன்படுத்தப்படாது, தற்போதைய IBM QX பாணியை பிரதிபலிக்காது. உள்நாட்டில் ஒரு பாணி கட்டளையை உருவாக்க நீங்கள் இந்த செயல்பாட்டைப் பயன்படுத்தினால், அதிலிருந்து வெளியீட்டைச் சேமித்து அந்த அகராதியை நேரடியாகப் பயன்படுத்த வேண்டும்.

source: The Exception ``TranspilerAccessError`` has been deprecated. An alternative function ``TranspilerError`` can be used instead to provide the same functionality. This alternative function provides the exact same functionality but with greater generality.
ta_in: விதிவிலக்கு `` TranspilerAccessError`` நீக்கப்பட்டது. அதே செயல்பாட்டை வழங்குவதற்கு பதிலாக `` TranspilerError`` என்ற மாற்று செயல்பாடு பயன்படுத்தப்படலாம். இந்த மாற்று செயல்பாடு சரியான செயல்பாட்டை வழங்குகிறது, ஆனால் அதிக பொதுவான தன்மையைக் கொண்டுள்ளது.

source: Buffers in Pulse are deprecated. If a nonzero buffer is supplied, a warning will be issued with a reminder to use a Delay instead. Other options would include adding samples to a pulse instruction which are (0.+0.j) or setting the start time of the next pulse to ``schedule.duration + buffer``.
ta_in: துடிப்பில் உள்ள இடையகங்கள் நீக்கப்பட்டன. ஒரு நொஜெரோ இடையகம் வழங்கப்பட்டால், அதற்கு பதிலாக தாமதத்தைப் பயன்படுத்த நினைவூட்டலுடன் எச்சரிக்கை வழங்கப்படும். பிற விருப்பங்களில் (0. + 0.j) ஒரு துடிப்பு அறிவுறுத்தலில் மாதிரிகளைச் சேர்ப்பது அல்லது அடுத்த துடிப்பின் தொடக்க நேரத்தை `` அட்டவணை. காலம் + இடையக`` என அமைத்தல் ஆகியவை அடங்கும்.

source: Passing in ``sympy.Basic``, ``sympy.Expr`` and ``sympy.Matrix`` types as instruction parameters are deprecated and will be removed in a future release. You'll need to convert the input to one of the supported types which are:
ta_in: ` சிம்மி.அடிப்படை ` `, ` சிம்ப.எதிர்பார்ப்பு ` ` மற்றும் ` சிம்ப.மாட்ரிக்ஸ் ` வகை ஆசிரியர் அளபுருக்கள் துண்டிக்கப்படுகின்றன மற்றும் ஒரு எதிர்க் வெளியீட்டில் நீக்கப்படும். நீங்கள் உள்ளீட்டை ஒரு ஆதரவு வகைகளில் மாற்ற வேண்டும்:

source: The Collect2qBlocks and CommutationAnalysis passes in the transpiler had been unable to process circuits containing Parameterized gates, preventing Parameterized circuits from being transpiled at optimization_level 2 or above. These passes have been corrected to treat Parameterized gates as opaque.
ta_in: டிரான்ஸ்பைலரில் உள்ள கலெக்ட் 2 க் பிளாக்ஸ் மற்றும் கம்யூட்டேஷன் அனாலிசிஸ் பாஸ்கள் அளவுருவாக்கப்பட்ட வாயில்களைக் கொண்ட சுற்றுகளை செயலாக்க முடியவில்லை, அளவுரு சுற்றுகள் உகப்பாக்கம்_அளவு 2 அல்லது அதற்கு மேல் அனுப்பப்படுவதைத் தடுக்கின்றன. அளவுருக்கள் கொண்ட வாயில்கள் ஒளிபுகாவாக கருத இந்த பாஸ்கள் சரி செய்யப்பட்டுள்ளன.

source: The align_measures function had an issue where Measure stimulus pulses weren't properly aligned with Acquire pulses, resulting in an error. This has been fixed.
ta_in: அலைன்_மெஷர்ஸ் செயல்பாட்டில் ஒரு சிக்கல் இருந்தது, அங்கு அளவீட்டு தூண்டுதல் பருப்பு வகைகளை அக்வைர் ​​பருப்புகளுடன் சரியாக இணைக்கவில்லை, இதன் விளைவாக பிழை ஏற்பட்டது. இது சரி செய்யப்பட்டது.

source: Uses of ``numpy.random.seed`` have been removed so that calls of qiskit functions do not affect results of future calls to ``numpy.random``
ta_in: "numpy.random.seed" இன் பயன்பாடுகள் நீக்கப்பட்டுள்ளன, இதனால் qiskit செயல்பாடுகளின் அழைப்புகள் எதிர்கால அழைப்புகளின் முடிவுகளை பாதிக்காது என்று "numpy.random"

source: Fixed race condition occurring in the job monitor when ``job.queue_position()`` returns ``None``. ``None`` is a valid return from ``job.queue_position()``.
ta_in: "job.queue_position()" "ஏதுமில்லை" என்று திரும்பும் போது வேலை மானிட்டரில் ஏற்படும் நிலையான இனம் நிலை. 'ஏதுமில்லை' என்பது 'job.queue_position()'' இருந்து ஒரு செல்லுபடியாகும் வருமானம்.

source: Backend support for ``memory=True`` now checked when that kwarg is passed. ``QiskitError`` results if not supported.
ta_in: "memory=True" க்கான பின்னணி ஆதரவு இப்போது அந்த kwarg கடந்து போது சரிபார்க்கப்பட்டது. ஆதரிக்கப்படவில்லை என்றால் "QiskitError" முடிவுகள்.

source: When transpiling without a coupling map, there were no check in the amount of qubits of the circuit to transpile. Now the transpile process checks that the backend has enough qubits to allocate the circuit.
ta_in: ஒரு இணைப்பு வரைபடம் இல்லாமல் டிரான்ஸ்பைலர் போது, டிரான்ஸ்பைலர் செய்ய சுற்று qubits அளவு எந்த காசோலை இருந்தன. இப்போது டிரான்ஸ்பில் செயல்முறை பின்முனை க்கு சர்க்யூட் ஒதுக்க போதுமான qubits உள்ளதா என்று சரிபார்க்கிறது.

source: The ``qiskit.result.marginal_counts()`` function replaces a similar utility function in qiskit-ignis ``qiskit.ignis.verification.tomography.marginal_counts()``, which will be deprecated in a future qiskit-ignis release.
ta_in: ஒரு இணைப்பு வரைபடத்தை இல்லாமல் மாற்றும் போது, எந்த checkThe "qiskit.result.marginal_counts ()" செயல்பாடு quiskit-ignis "qiskit.ignis.verification.tomography.marginal_counts()' இல் இதே போன்ற பயன்பாட்டு செயல்பாட்டை மாற்றுகிறது, இது எதிர்காலத்தில் quiskit-ignis release.in மின்சுற்று க்கு டிரான்பைல் அளவு. இப்போது டிரான்ஸ்பில் செயல்முறை பின்முனை க்கு சர்க்யூட் ஒதுக்க போதுமான qubits உள்ளதா என்று சரிபார்க்கிறது.

source: All sympy parameter output type support have been been removed (or deprecated as noted) from qiskit-terra. This includes sympy type parameters in ``QuantumCircuit`` objects, qasm ast nodes, or ``Qobj`` objects.
ta_in: அனைத்து அறிகுறி அளவுரு வெளியீடு வகை ஆதரவு qiskit-terra இருந்து நீக்கப்பட்டது (அல்லது குறிப்பிடப்பட்டுள்ளது என நீக்கப்பட்டது). இதில் "குவாண்டம்சர்க்யூட்" பொருள்கள், குவாம் அஸட் முனைகள் அல்லது "Qobj" பொருள்களில் உள்ள அறிகுறி வகை அளவுருக்கள் அடங்கும்.

source: Aer 0.3
ta_in: ஏர் 0.3

source: IBM Q Provider 0.4
ta_in: IBM Q வழங்குபவர் 0.4

source: The 0.4.0 release is the first release that makes use of all the features of the new IBM Q API. In particular, the ``IBMQJob`` class has been revamped in order to be able to retrieve more information from IBM Q, and a Job Manager class has been added for allowing a higher-level and more seamless usage of large or complex jobs. If you have not upgraded from the legacy IBM Q Experience or QConsole yet, please ensure to revisit the release notes for IBM Q Provider 0.3 (Qiskit 0.11) for more details on how to make the transition. The legacy accounts will no longer be supported as of this release.
ta_in: 0.4.0 விடுதலை முதல் வெளியீடு என்று புதிய IBM Q API இன் அனைத்து அம்சங்களையும் பயன்படுத்துகிறது. குறிப்பாக, ` ` IBMQJob ` ` வகுப்பு, IBM Q லிருந்து அதிக தகவல்களை மீட்க முடியும், மற்றும் ஒரு பணி மேலாளர் வகுப்பு, பெரிய அல்லது சிக்கலான பணிகளின் அதிக அளவு பயன்பாடு அனுமதிக்கிறது. IBM Q அனுபவம் அல்லது QConsole இன்னும் வரலாற்றில் இருந்து மேம்படுத்தப்படவில்லை என்றால், தயவு செய்து IBM Q வழங்குபவர் 0.3 (Qiskit 0.11) விடுதலை குறிப்பிடுவதற்கு மேலும் விவரங்களுக்கு எப்படி மாற்றம் செய்ய வேண்டும். வரலாறு கணக்குகள் இப்பொழுது இந்த விடுதலை ஆதரிக்கப்படாது.

source: Job modifications
ta_in: மாற்றங்களை அனுமதி
