Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: ``ControlledGate`` instances with a set ``ctrl_state`` were in some cases not being evaluated as equal, even if the compared gates were equivalent. This has been resolved.
ta_in: ` ` ControlledGate ` ` instances with a set ` ` ctrl_state ` ` சில வழக்குகளிலும் சமமாக மதிப்பிடப்படவில்லை என்றும், ஒப்பிடுகையில் வாய்ப்புகள் சமமாக இருந்தன. இது தெரிவித்துள்ளது.

source: Fixed the SI unit conversion for :py:class:`qiskit.pulse.SetFrequency`. The ``SetFrequency`` instruction should be in Hz on the frontend and has to be converted to GHz when ``SetFrequency`` is converted to ``PulseQobjInstruction``.
ta_in: இதற்கான SI அலகு மாற்றம் சரி செய்யப்பட்டது: py: class: `qiskit.pulse.SetFrequency`. ``SetFrequency`` அறிவுறுத்தல் முன்பக்கத்தில் ஹெர்ட்ஸில் இருக்க வேண்டும், மேலும் ``SetFrequency`` ஐ ``PulseQobjInstruction`` ஆக மாற்றும்போது ஜிஹெர்ட்ஸ் ஆக மாற்ற வேண்டும்.

source: Open controls were implemented by modifying a gate\'s definition. However, when the gate already exists in the basis, this definition is not used, which yields incorrect circuits sent to a backend. This modifies the unroller to output the definition if it encounters a controlled gate with open controls.
ta_in: ஒரு வாயிலின் வரையறையை மாற்றுவதன் மூலம் திறந்த கட்டுப்பாடுகள் செயல்படுத்தப்பட்டன. இருப்பினும், கேட் ஏற்கனவே அடிப்படையில் இருக்கும்போது, ​​இந்த வரையறை பயன்படுத்தப்படவில்லை, இது ஒரு பின்தளத்தில் அனுப்பப்பட்ட தவறான சுற்றுகளை அளிக்கிறது. திறந்த கட்டுப்பாடுகளுடன் கட்டுப்படுத்தப்பட்ட வாயிலை எதிர்கொண்டால், வரையறையை வெளியிடுவதற்கு இது அன்ரோலரை மாற்றியமைக்கிறது.

source: `cvxpy <https://github.com/cvxgrp/cvxpy/>`_ is now in the requirements list as a dependency for qiskit-aqua. It is used for the quadratic program solver which is used as part of the :class:`qiskit.aqua.algorithms.QSVM`. Previously ``cvxopt`` was an optional dependency that needed to be installed to use this functionality. This is no longer required as cvxpy will be installed with qiskit-aqua.
ta_in: 'cvxpy <https://github.com/cvxgrp/cvxpy/>'_ இப்போது qiskit-அக்வா ஒரு சார்பு என தேவைகள் பட்டியலில் உள்ளது. இது quadratic program solver பயன்படுத்தப்படுகிறது, இது :class:'qiskit.aqua.algithms.QSVM' இன் ஒரு பகுதியாக பயன்படுத்தப்படுகிறது. முன்பு "cvxopt" இந்த செயல்பாட்டைபயன்படுத்த நிறுவப்பட வேண்டிய ஒரு விருப்பசார்பு ஆகும். இது இனி தேவையில்லை, ஏனெனில் CVXPY qiskit-aqua உடன் நிறுவப்படும்.

source: For state tomography run as part of :class:`qiskit.aqua.algorithms.HHL` with a QASM backend the tomography fitter function :meth:`qiskit.ignis.verification.StateTomographyFitter.fit` now gets called explicitly with the method set to ``lstsq`` to always use the least-squares fitting. Previously it would opportunistically try to use the ``cvx`` fitter if ``cvxpy`` were installed. But, the ``cvx`` fitter depends on a specifically configured ``cvxpy`` installation with an SDP solver installed as part of ``cvxpy`` which is not always present in an environment with ``cvxpy`` installed.
ta_in: மாநில டோமோகிராஃபி ரன் :class:'qiskit.aqua.algoritms.HHL' ஒரு QASM பின்முனை யுடன் டோமோகிராபி ஃபிட்டர் செயல்பாடு :meth:'qiskit.ignis.verification.StateTomographyFitter.fit' இப்போது வெளிப்படையாக அழைக்கப்படுகிறது 'lstsq' அமைக்க ப்பட்டுள்ளது முறை எப்போதும் பொருந்தும் எப்போதும் பொருந்தும். இதற்கு முன்னர் ,"cvxpy" நிறுவப்பட்டால் அது "cvx" ஃபிட்டரை ப்பயன்படுத்த ுவதற்கு சந்தர்ப்பவாதமுயற்சிசெய்யும். ஆனால், "cvxpy" நிறுவப்பட்ட சூழலில் எப்போதும் இல்லாத ஒரு SDP solver நிறுவல் "cvxpy" உடன் "cvxpy" பொருத்துதல் குறிப்பாக கட்டமைக்கப்பட்ட "cvxpy" நிறுவலை சார்ந்துள்ளது.

source: The VQE expectation computation using qiskit-aer's :class:`qiskit.providers.aer.extensions.SnapshotExpectationValue` instruction is not enabled by default anymore. This was changed to be the default in 0.7.0 because it is significantly faster, but it led to unexpected ideal results without shot noise (see `#1013 <https://github.com/Qiskit/qiskit-aqua/issues/1013>`_ for more details). The default has now changed back to match user expectations. Using the faster expectation computation is now opt-in by setting the new ``include_custom`` kwarg to ``True`` on the :class:`qiskit.aqua.algorithms.VQE` constructor.
ta_in: Qiskit-aer இன் :class:'qiskit.providers.aer.extensions.SnapshotExpectationValue' instruction ஐ பயன்படுத்தி VQE எதிர்பார்க்கப்படுகிறது. இது குறிப்பிடத்தக்க வேகமாக இருப்பதால் இது 0.7.0 இல் இயல்புநிலையாக மாற்றப்பட்டது, ஆனால் அது ஷாட் சத்தம் இல்லாமல் எதிர்பாராத சிறந்த முடிவுகளுக்கு வழிவகுத்தது (மேலும் விவரங்களுக்கு '#1013 <https://github.com/Qiskit/qiskit-aqua/issues/1013>'ஐப் பார்க்கவும்). இயல்புநிலை இப்போது பயனர் எதிர்பார்ப்புகளை பொருத்த மீண்டும் மாறிவிட்டது. வேகமாக எதிர்பார்ப்பு க்வாட் பயன்படுத்தி இப்போது புதிய 'include_custom' kwarg அமைக்க ப்படுகிறது "உண்மை" :class:'qiskit.aqua.algoritms.VQE' constructor.

source: A new kwarg ``include_custom`` has been added to the constructor for :class:`qiskit.aqua.algorithms.VQE` and it's subclasses (mainly :class:`qiskit.aqua.algorithms.QAOA`). When set to true and the ``expectation`` kwarg is set to ``None`` (the default) this will enable the use of VQE expectation computation with Aer's ``qasm_simulator`` :class:`qiskit.providers.aer.extensions.SnapshotExpectationValue` instruction. The special Aer snapshot based computation is much faster but with the ideal output similar to state vector simulator.
ta_in: ஒரு புதிய kwarg "include_custom" constructor சேர்க்கப்பட்டுள்ளது :class:'qiskit.aqua.algiitthms.VQE' மற்றும் அது subclasses (முக்கியமாக :class:'qiskit.aqua.algoritms.QAOA'). "expectation" kwarg 'None' (இயல்புநிலை) க்கு அமைக்கப்படும் போது, இது ஏர் இன் "qasm_simulator" :class:'qiskit.providers.aer.extensions.SnapshotExtensionValue' instruction உடன் VQE எதிர்பார்ப்பு க்யூப்பயன்படுத்துதலை செயல்படுத்துகிறது. சிறப்பு ஏர் ஸ்னாப்ஷாட் அடிப்படையிலான கம்ப்யூட்டிங் மிகவும் வேகமாக ஆனால் மாநில வெக்டார் போலி ஒத்த சிறந்த வெளியீடு.

source: Terra 0.14.1
ta_in: டெரா 0.14.1

source: Fixed bug with statevector and unitary simulators running a number of (parallel) shots equal to the number of CPU threads instead of only running a single shot.
ta_in: ஒரே ஒரு ஷாட் இயங்கும் பதிலாக CPU நூல்கள் எண்ணிக்கை சமமாக (இணை) காட்சிகளை பல இயங்கும் statevector மற்றும் ஒற்றை போலி கொண்டு நிலையான பிழை.

source: Fixes the "diagonal" qobj gate instructions being applied incorrectly in the density matrix Qasm Simulator method.
ta_in: அடர்த்தி அணி Qasm சிமுலேட்டர் முறையில் தவறாக பயன்படுத்தப்படும் "சாய்வு" qobj வாயில் வழிமுறைகளை சரி.

source: Fixes bug where conditional gates were not being applied correctly on the density matrix simulation method.
ta_in: டென்சிட்டி மேட்ரிஸ் சிமுலேஷன் முறையில் நிபந்தனை கேட்கள் சரியாக பயன்படுத்தப்படாத பிழைசரிசெய்கிறது.

source: Fix bug in CZ gate and Z gate for "density_matrix_gpu" and "density_matrix_thrust" QasmSimulator methods.
ta_in: "density_matrix_gpu" மற்றும் "density_matrix_thrust" QasmSimulator முறைகளுக்கு CZ கேட் மற்றும் Z கேட் இல் பிழை சரி செய்யவும்.

source: Fixes issue where memory requirements of simulation were not being checked on the QasmSimulator when using a non-automatic simulation method.
ta_in: ஒரு அல்லாத தானியங்கி உருவகப்படுத்துதல் முறை பயன்படுத்தும் போது QasmSimulator மீது உருவகப்படுத்துதல் நினைவக தேவைகள் சரிபார்க்கப்படவில்லை எங்கே சிக்கல் சரி.

source: Fixed a memory leak that effected the GPU simulator methods
ta_in: ஜி. பி. யு ஒப்புருவாக்கி முறைகளை ப்பாதிக்கும் நினைவக கசிவு நிர்ணயித்தல்

source: Aqua 0.7.1
ta_in: அக்வா 0.7.1

source: :meth:`qiskit.provider.ibmq.IBMQBackend.jobs` will now return the correct list of :class:`~qiskit.provider.ibmq.job.IBMQJob` objects when the ``status`` kwarg is set to ``'RUNNING'``. Fixes `#523 <https://github.com/Qiskit/qiskit-ibmq-provider/issues/523>`_
ta_in: meth:'qiskit.provider.ibmq.IBMQBackend.jobs' will now returns the correct list of :class:'~qiskit.provider.ibmq.job.IBMQJob' objects whn 'status' kwarg is set to ''RunnING''. '#523 <https://github.com/Qiskit/qiskit-ibmq-provider/issues/523>' சரிசெய்கிறது_

source: Terra 0.14.0
ta_in: டெரா 0.14.0

source: The 0.14.0 release includes several new features and bug fixes. The biggest change for this release is the introduction of a quantum circuit library in :mod:`qiskit.circuit.library`, containing some circuit families of interest.
ta_in: 0.14.0 வெளியீட்டில் பல புதிய அம்சங்கள் மற்றும் பிழைத்திருத்தங்கள் உள்ளன. இந்த வெளியீட்டிற்கான மிகப்பெரிய மாற்றம் , வட்டி சில சுற்று குடும்பங்கள் கொண்ட ஒரு குவாண்டம் சுற்று நூலகம் அறிமுகம் உள்ளது :'qiskit.circuit.library'.

source: The circuit library gives users access to a rich set of well-studied circuit families, instances of which can be used as benchmarks, as building blocks in building more complex circuits, or as a tool to explore quantum computational advantage over classical. The contents of this library will continue to grow and mature.
ta_in: சர்கூட் லைப்ரரி பயனர்கள் நன்கு ஆய்வு செய்யப்பட்ட சுற்று குடும்பங்களின் பணக்கார தொகுப்புக்கு அணுகலை வழங்குகிறது, இதன் எடுத்துக்காட்டுகள், மிகவும் சிக்கலான சுற்றுகளை உருவாக்குவதில் கட்டிட த்தொகுதிகள், அல்லது கிளாசிக்கல் மீது குவாண்டம் கணக்கிடுதல் அனுகூலத்தை ஆராய ஒரு கருவியாக பயன்படுத்தப்படலாம். இந்த நூலகத்தின் உள்ளடக்கங்கள் தொடர்ந்து வளர்ந்து முதிர்ச்சியடையத் தொடங்கும்.

source: The initial release of the circuit library contains:
ta_in: சர்க்யூட் லைப்ரரியின் ஆரம்ப வெளியீடு பின்வருமாறு:

source: ``standard_gates``: these are fixed-width gates commonly used as primitive building blocks, consisting of 1, 2, and 3 qubit gates. For example the :class:`~qiskit.circuit.library.XGate`, :class:`~qiskit.circuit.library.RZZGate` and :class:`~qiskit.circuit.library.CSWAPGate`. The old location of these gates under ``qiskit.extensions.standard`` is deprecated.
ta_in: 'standard_gates': இவை பொதுவாக 1, 2, மற்றும் 3 க்யூபிட் கேட்கள் கொண்ட பழமையான கட்டிட தொகுதிகள் பயன்படுத்தப்படும் நிலையான-அகல வாயில்கள் உள்ளன. உதாரணமாக: class:'~qiskit.circuit.library.XGate', :class:'~qiskit.circuit.library.RZZGate' மற்றும் :class:'~qiskit.circuit.library.CSWAPGate'. இந்த கேட்களின் பழைய இடம் "qiskit.extensions.standard" கீழ் நீக்கப்படுகிறது.

source: ``generalized_gates``: these are families that can generalize to arbitrarily many qubits, for example a :class:`~qiskit.circuit.library.Permutation` or :class:`~qiskit.circuit.library.GMS` (Global Molmer-Sorensen gate).
ta_in: ''generalized_gates'': இவை பல குபிட்களை பொதுமைப்படுத்தக் கூடிய குடும்பங்கள், உதாரணமாக ஒரு :class:'~qiskit.circuit.library.Permutation' அல்லது :class:'~qiskit.circuit.library.GMS' (Global Molmer-Sorensen கேட்).

source: ``boolean_logic``: circuits that transform basis states according to simple Boolean logic functions, such as :class:`~qiskit.circuit.library.ADD` or :class:`~qiskit.circuit.library.XOR`.
ta_in: "boolean_logic": அடிப்படைகளை மாற்றும் சுற்றுகள் எளிய பூலியன் தர்க்க ச்சார்புகளின் படி கூறுகிறது, உதாரணமாக :class:'~qiskit.circuit.library.ADD' அல்லது :class:'~qiskit.circuit.library.XOR'.

source: ``arithmetic``: a set of circuits for doing classical arithmetic such as :class:`~qiskit.circuit.library.WeightedAdder` and :class:`~qiskit.circuit.library.IntegerComparator`.
ta_in: "arithmetic": போன்ற :வர்க்கம்:'~qiskit.circuit.library.WeightedAdder' மற்றும் :class:'~qiskit.circuit.library.IntegerComparer' போன்ற கிளாசிக்கல் கணித செய்ய ஒரு சர்கூட் கள்.

source: ``basis_changes``: circuits such as the quantum Fourier transform, :class:`~qiskit.circuit.library.QFT`, that mathematically apply basis changes.
ta_in: 'basis_changes': குவாண்டம் ஃூரியே உருமாற்றம், :class:'~qiskit.circuit.library.QFT', கணிதஅடிப்படையில் மாற்றங்களைப் பயன்படுத்துகிறது.

source: ``n_local``: patterns to easily create large circuits with rotation and entanglement layers, such as :class:`~qiskit.circuit.library.TwoLocal` which uses single-qubit rotations and two-qubit entanglements.
ta_in: 'n_local': ஒற்றை-qubit சுழற்சிகள் மற்றும் இரண்டு qubit வளையும் பயன்படுத்துகிறது இது போன்ற :'~qiskit.circuit.library.TwoLocal' போன்ற சுழற்சி மற்றும் சிக்கலுடனான பெரிய சுற்றுகளை எளிதாக உருவாக்க வடிவங்கள்.

source: ``data_preparation``: circuits that take classical input data and encode it in a quantum state that is difficult to simulate, e.g. :class:`~qiskit.circuit.library.PauliFeatureMap` or :class:`~qiskit.circuit.library.ZZFeatureMap`.
ta_in: "data_preparation": கிளாசிக்கல் உள்ளீட்டு த்தரவை எடுத்து உருவகப்படுத்தகடினமாக இருக்கும் குவாண்டம் நிலையில் குறியாக்கம் செய்யும் சுற்றுகள், எ.கா: class:'~qiskit.circuit.library.PauliFeatureMap' அல்லது :class:'~qiskit.circuid.library.ZZZFeatureMap'.

source: Other circuits that have proven interesting in the literature, such as :class:`~qiskit.circuit.library.QuantumVolume`, :class:`~qiskit.circuit.library.GraphState`, or :class:`~qiskit.circuit.library.IQP`.
ta_in: இலக்கியத்தில் சுவாரஸ்யமான துரதிர்ர்த்தாக நிரூபிக்கப்பட்டுள்ளது என்று மற்ற சர்கூட்கள், போன்ற :class:'~qiskit.circuit.library.QuantumVolume', :class:'~qiskit.circuit.library.GraphState', அல்லது :class:'~qiskit.circuid.library.IQP'.

source: To allow easier use of these circuits as building blocks, we have introduced a :meth:`~qiskit.circuit.QuantumCircuit.compose` method of :class:`qiskit.circuit.QuantumCircuit` for composition of circuits either with other circuits (by welding them at the ends and optionally permuting wires) or with other simpler gates::
ta_in: இந்த சர்கூட்களை கட்டிடத் தொகுதிகளாக எளிதாகப் பயன்படுத்த அனுமதிக்க, நாம் ஒரு அறிமுகப்படுத்தப்பட்டுள்ளது :meth:'~qiskit.circuit.QuantumCircuit' முறை :class:'qiskit.circuit.QuantumCircuit' மற்ற சர்கூட்களை (முனைகளில் அவற்றை வெல்டிங் மற்றும் விருப்பமாக permuting கம்பிகள் மூலம்) அல்லது பிற எளிய கேட்கள்::

source: With this, Qiskit's circuits no longer assume an implicit initial state of :math:`|0\rangle`, and will not be drawn with this initial state. The all-zero initial state is still assumed on a backend when a circuit is executed.
ta_in: இதன் மூலம், Qiskit's சர்கூட்கள் இனி "math:'|0rangle" இன் உட்குறிப்பாக ஆரம்ப நிலையை எடுத்துக் கொள்வதில்லை, மேலும் இந்த ஆரம்ப நிலையுடன் வரையப்படாது. ஒரு சுற்று செயல்படுத்தப்படும்போது அனைத்து-பூஜ்ய ஆரம்ப நிலை இன்னும் ஒரு பின்நிலையில் கருதப்படுகிறது.

source: A new method, :meth:`~qiskit.circuit.EquivalenceLibrary.has_entry`, has been added to the :class:`qiskit.circuit.EquivalenceLibrary` class to quickly check if a given gate has any known decompositions in the library.
ta_in: ஒரு புதிய முறை, :meth:'~qiskit.circuit.EquivalenceLibrary.has_entry', :class:'qiskit.circuit.EquivalenceLibrary' class சேர்க்கப்பட்டுள்ளது, ஒரு கொடுக்கப்பட்ட கேட் நூலகத்தில் அறியப்பட்ட சிதைவை உள்ளதா என்பதை விரைவாக சரிபார்க்க.

source: A new class :class:`~qiskit.circuit.library.IQP`, to construct an instantaneous quantum polynomial circuit, has been added to the circuit library module :mod:`qiskit.circuit.library`.
ta_in: ஒரு புதிய வர்க்கம் :'~qiskit.circuit.library.IQP', ஒரு உடனடி குவாண்டம் பலகூறு சர்கூட் உருவாக்க, சுற்று நூலகம் தொகுதி சேர்க்கப்பட்டுள்ளது :mod:'qiskit.circuit.library'.

source: A new :meth:`~qiskit.circuit.QuantumCircuit.compose` method has been added to :class:`qiskit.circuit.QuantumCircuit`. It allows composition of two quantum circuits without having to turn one into a gate or instruction. It also allows permutations of qubits/clbits at the point of composition, as well as optional inplace modification. It can also be used in place of :meth:`~qiskit.circuit.QuantumCircuit.append()`, as it allows composing instructions and operators onto the circuit as well.
ta_in: ஒரு புதிய :meth:'~qiskit.circuit.QuantumCircuit.compose' method has added to :class:'qiskit.circuit.QuantumCircuit'. இது ஒரு கேட் அல்லது அறிவுறுத்தல் ஒரு திரும்ப இல்லாமல் இரண்டு குவாண்டம் சர்கூட்கள் கலவை அனுமதிக்கிறது. இது தொகுப்பு புள்ளியில் qubits / clbits permutations அனுமதிக்கிறது, அதே போல் விருப்ப மாற்ற. இது :meth:'~qiskit.circuit.QuantumCircuit.append ()' என்ற இடத்தில் பயன்படுத்தப்படலாம், ஏனெனில் இது கட்டளைகள் மற்றும் ஆபரேட்டர்களை சர்கூட்டிலும் பயன்படுத்த அனுமதிக்கிறது.

source: :class:`qiskit.circuit.library.Diagonal` circuits have been added to the circuit library. These circuits implement diagonal quantum operators (consisting of non-zero elements only on the diagonal). They are more efficiently simulated by the Aer simulator than dense matrices.
ta_in: :class:'qiskit.circuit.library.Diagonal' சர்க்யூட்சர்சர்கள் சர்க்யூட் நூலகத்தில் சேர்க்கப்பட்டுள்ளன. இந்த சுற்றுகள் மூலைவிட்ட குவாண்டம் ஆபரேட்டர்களை செயல்படுத்துகின்றன (மூலைவிட்டத்தில் மட்டும் பூஜ்ஜியம் அல்லாத உறுப்புகள் உள்ளன). அவர்கள் அடர்த்தியான matrices விட ஏயர் போலி மூலம் மிகவும் திறமையாக உருவகப்படுத்தப்பட்ட.

source: Add :meth:`~qiskit.quantum_info.Clifford.from_label` method to the :class:`qiskit.quantum_info.Clifford` class for initializing as the tensor product of single-qubit I, X, Y, Z, H, or S gates.
ta_in: கூட்டு :meth:'~qiskit.quantum_info. Clifford.from_label' என்ற முறையை :class: qiskit.quantum_info. ஒற்றை-குபிட் I, X, Y, Z, H, அல்லது S வாயில்களின் டென்சர் பெருக்கல் என துவக்குவதற்கான Clifford வர்க்கம்.

source: Schedule transformer :func:`qiskit.pulse.reschedule.compress_pulses` performs an optimization pass to reduce the usage of waveform memory in hardware by replacing multiple identical instances of a pulse in a pulse schedule with a single pulse. For example::
ta_in: அட்டவணை மின்மாற்றி :func:'qiskit.pulse.reschedule.compress_pulses' ஒற்றை துடிப்பு ஒரு துடிப்பு அட்டவணை யில் ஒரு துடிப்பு பல ஒத்த நிகழ்வுகளை மாற்றுவதன் மூலம் வன்பொருள் உள்ள அலைவடிவ நினைவகம் பயன்பாடு குறைக்க ஒரு தேர்வுமுறை பாஸ் செய்கிறது. உதாரணமாக::

source: The :class:`qiskit.transpiler.Layout` has a new method :meth:`~qiskit.transpiler.Layout.reorder_bits` that is used to reorder a list of virtual qubits based on the layout object.
ta_in: :class: `qiskit.transpiler.Layout` ஒரு புதிய முறையைக் கொண்டுள்ளது:meth:` ~ qiskit.transpiler.Layout.reorder_bits` இது தளவமைப்பு பொருளின் அடிப்படையில் மெய்நிகர் குவிட்களின் பட்டியலை மறுவரிசைப்படுத்த பயன்படுகிறது.

source: Two new methods have been added to the :class:`qiskit.providers.models.PulseBackendConfiguration` for interacting with channels.
ta_in: சேனல்களுடன் தொடர்புகொள்வதற்கு இரண்டு புதிய முறைகள்:class: `qiskit.providers.models.PulseBackendConfiguration` இல் சேர்க்கப்பட்டுள்ளன.

source: :meth:`~qiskit.providers.models.PulseBackendConfiguration.get_channel_qubits` to get a list of all qubits operated by the given channel and
ta_in: :meth: `~ qiskit.providers.models.PulseBackendConfiguration.get_channel_qubits` கொடுக்கப்பட்ட சேனலால் இயக்கப்படும் அனைத்து வினாடிகளின் பட்டியலையும் பெறவும்

source: :meth:`~qiskit.providers.models.PulseBackendConfiguration.get_qubit_channel` to get a list of channels operating on the given qubit.
ta_in: :meth: `qiskit.providers.models.PulseBackendConfiguration.get_qubit_channel` கொடுக்கப்பட்ட குவிட்டில் இயங்கும் சேனல்களின் பட்டியலைப் பெற.

source: New :class:`qiskit.extensions.HamiltonianGate` and :meth:`qiskit.circuit.QuantumCircuit.hamiltonian()` methods are introduced, representing Hamiltonian evolution of the circuit wavefunction by a user-specified Hermitian Operator and evolution time. The evolution time can be a :class:`~qiskit.circuit.Parameter`, allowing the creation of parameterized UCCSD or QAOA-style circuits which compile to ``UnitaryGate`` objects if ``time`` parameters are provided. The Unitary of a ``HamiltonianGate`` with Hamiltonian Operator ``H`` and time parameter ``t`` is :math:`e^{-iHt}`.
ta_in: புதியது:class: `qiskit.extensions.HamiltonianGate` மற்றும்:meth:` qiskit.circuit.QuantumCircuit.hamiltonian ()` முறைகள் அறிமுகப்படுத்தப்பட்டுள்ளன, இது பயனர் குறிப்பிட்ட ஹெர்மிடியன் ஆபரேட்டர் மற்றும் பரிணாம நேரம் மூலம் சுற்று அலைவடிவத்தின் ஹாமில்டோனிய பரிணாமத்தை குறிக்கிறது. பரிணாம நேரம் ஒரு: வர்க்கமாக இருக்கலாம் :class: `~ qiskit.circuit.Parameter`, ``time`` அளவுருக்கள் வழங்கப்பட்டால்` `UnitaryGate`` பொருள்களுடன் தொகுக்கும் அளவுருவாக்கப்பட்ட UCCSD அல்லது QAOA- பாணி சுற்றுகளை உருவாக்க அனுமதிக்கிறது. ஹாமில்டோனிய ஆபரேட்டர் `` எச்`` மற்றும் நேர அளவுரு ``t`` உடன் ஒரு ``HamiltonianGate`` இன் ஒற்றுமை :math:`e^{-iHt}`.

source: The circuit library module :mod:`qiskit.circuit.library` now provides a new boolean logic AND circuit, :class:`qiskit.circuit.library.AND`, and OR circuit, :class:`qiskit.circuit.library.OR`, which implement the respective operations on a variable number of provided qubits.
ta_in: சுற்று நூலக தொகுதி:mod: `qiskit.circuit.library` இப்போது ஒரு புதிய பூலியன் தர்க்கத்தையும் சுற்றுகளையும் வழங்குகிறது ,:class:` qiskit.circuit.library.AND`, மற்றும் OR சுற்று ,:class: `qiskit.circuit.library. OR`, இது வழங்கப்பட்ட வினாடிகளின் மாறுபட்ட எண்ணிக்கையில் அந்தந்த செயல்பாடுகளை செயல்படுத்துகிறது.

source: New fake backends are added under :mod:`qiskit.test.mock`. These include mocked versions of ``ibmq_armonk``, ``ibmq_essex``, ``ibmq_london``, ``ibmq_valencia``, ``ibmq_cambridge``, ``ibmq_paris``, ``ibmq_rome``, and ``ibmq_athens``. As with other fake backends, these include snapshots of calibration data (i.e. ``backend.defaults()``) and error data (i.e. ``backend.properties()``) taken from the real system, and can be used for local testing, compilation and simulation.
ta_in: புதிய போலி பின்தளத்தில் சேர்க்கப்பட்டுள்ளது:mod: `qiskit.test.mock`. `` Ibmq_armonk``, `` ibmq_essex``, `` ibmq_london``, `` ibmq_valencia``, `` ibmq_cambridge``, `` ibmq_paris``, `` ibmq_rome`` ஆகியவற்றின் கேலி செய்யப்பட்ட பதிப்புகள் இதில் அடங்கும். ibmq_athens``. பிற போலி பின்தளத்தில் உள்ளதைப் போலவே, அளவீட்டுத் தரவின் ஸ்னாப்ஷாட்களும் (அதாவது `` ``backend.defaults()``) மற்றும் பிழை தரவு (அதாவது `` backend.properties () ``) உண்மையான அமைப்பிலிருந்து எடுக்கப்பட்டவை, மேலும் அவை பயன்படுத்தப்படலாம் உள்ளூர் சோதனை, தொகுப்பு மற்றும் உருவகப்படுத்துதல்.

source: The ``last_update_date`` parameter for :class:`~qiskit.providers.models.BackendProperties` can now also be passed in as a ``datetime`` object. Previously only a string in ISO8601 format was accepted.
ta_in: இதற்கான ``last_update_date`` அளவுரு:class: `~ qiskit.providers.models.BackendProperties` ஐ இப்போது``datetime`` பொருளாகவும் அனுப்பலாம். முன்னர் ISO8601 வடிவத்தில் ஒரு சரம் மட்டுமே ஏற்றுக்கொள்ளப்பட்டது.

source: Adds :meth:`qiskit.quantum_info.Statevector.from_int` and :meth:`qiskit.quantum_info.DensityMatrix.from_int` methods that allow constructing a computational basis state for specified system dimensions.
ta_in: சேர்க்கிறது:meth: `qiskit.quantum_info.Statevector.from_int` மற்றும்:meth:` qiskit.quantum_info.DensityMatrix.from_int` முறைகள் குறிப்பிட்ட கணினி பரிமாணங்களுக்கு ஒரு கணக்கீட்டு அடிப்படை நிலையை உருவாக்க அனுமதிக்கின்றன.

source: The methods on the :class:`qiskit.circuit.QuantumCircuit` class for adding gates (for example :meth:`~qiskit.circuit.QuantumCircuit.h`) which were previously added dynamically at run time to the class definition have been refactored to be statically defined methods of the class. This means that static analyzer (such as IDEs) can now read these methods.
ta_in: வர்க்கங்களைச் சேர்ப்பதற்கான வகுப்புகள் :class: `qiskit.circuit.QuantumCircuit` வகுப்பில் உள்ள முறைகள் (எடுத்துக்காட்டாக:meth:` ~ qiskit.circuit.QuantumCircuit.h`) வர்க்க வரையறைக்கு முன்னர் இயங்கும் நேரத்தில் மாறும் வகையில் சேர்க்கப்பட்டன. வர்க்கத்தின் நிலையான வரையறுக்கப்பட்ட முறைகள். நிலையான பகுப்பாய்வி (ஐடிஇக்கள் போன்றவை) இப்போது இந்த முறைகளைப் படிக்க முடியும் என்பதே இதன் பொருள்.

source: A new package, `python-dateutil <https://pypi.org/project/python-dateutil/>`_, is now required and has been added to the requirements list. It is being used to parse datetime strings received from external providers in :class:`~qiskit.providers.models.BackendProperties` objects.
ta_in: `Python-dateutil <https://pypi.org/project/python-dateutil/>` _ என்ற புதிய தொகுப்பு இப்போது தேவைப்படுகிறது மற்றும் தேவைகள் பட்டியலில் சேர்க்கப்பட்டுள்ளது. வெளிப்புற வழங்குநர்களிடமிருந்து பெறப்பட்ட தேதிநேர சரங்களை அலசுவதற்கு இது பயன்படுத்தப்படுகிறது :class:`qiskit.providers.models.BackendProperties` பொருள்கள்.
