Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: The use of methods inherited from the ``set`` type on the output of the :attr:`~qiskit.circuit.QuantumCircuit.parameters` attribute (which used to be a ``set``) of the :class:`~qiskit.circuit.QuantumCircuit` class are deprecated and will be removed in a future release. This includes the methods from the ``add()``, ``difference()``, ``difference_update()``, ``discard()``, ``intersection()``, ``intersection_update()``, ``issubset()``, ``issuperset()``, ``symmetric_difference()``, ``symmetric_difference_update()``, ``union()``, ``update()``, ``__isub__()`` (which is the ``-=`` operator), and ``__ixor__()`` (which is the ``^=`` operator).
ta_in: ``set`` வகையிலிருந்து மரபுரிமையாகப் பெறப்பட்ட முறைகளின் பயன்பாடு வெளியீட்டின் :attr:`~qiskit.circuit.QuantumCircuit.parameters` பண்புக்கூறு (இது ஒரு 'தொகுப்பாக' இருந்தது) :class:`~qiskit.circuit.QuantumCircuit` வகுப்பு மதிப்பிழந்து, எதிர்கால வெளியீட்டில் அகற்றப்படும். இதில் ``add()``, ``difference()``, ``difference_update()``, ``discard()``, ``intersection()``, ``intersection_update()``, ``issubset()``, ``issuperset()``, ``symmetric_difference()``, ``symmetric_difference_update()``, ``union()``, ``update()``, ``__isub__()`` (which is the ``-=`` operator), மற்றும் ``__ixor__()`` (which is the ``^=`` operator) இந்த முறைகள் அடங்கும்.

source: The name of the first (and only) positional argument for the :meth:`qiskit.circuit.QuantumCircuit.bind_parameters` method has changed from ``value_dict`` to ``values``. The passing an argument in with the name ``values_dict`` is deprecated and will be removed in future release. For example, if you were previously calling :meth:`~qiskit.circuit.QuantumCircuit.bind_parameters` with a call like: ``bind_parameters(values_dict={})`` this is deprecated and should be replaced by ``bind_parameters(values={})`` or even better just pass the argument positionally ``bind_parameters({})``.
ta_in: இதற்கான முதல் (மற்றும் ஒரே) நிலை வாதத்தின் பெயர் :meth: `qiskit.circuit.QuantumCircuit.bind_parameters` முறை ``value_dict`` இலிருந்து ``values`` என மாற்றப்பட்டுள்ளது. `` values_dict`` என்ற பெயருடன் ஒரு வாதத்தை அனுப்புவது நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். எடுத்துக்காட்டாக, நீங்கள் முன்பு அழைத்திருந்தால் :meth: `~ qiskit.circuit.QuantumCircuit.bind_parameters` போன்ற அழைப்போடு: ``bind_parameters (values_dict = {})`` இது நீக்கப்பட்டது மற்றும் மாற்றப்பட வேண்டும் ``bind_parameters (values) = {}) `` அல்லது இன்னும் சிறப்பாக வாதத்தை நிலைநிறுத்தினால் ``bind_parameters({})``.

source: The name of the first (and only) positional argument for the :meth:`qiskit.circuit.QuantumCircuit.assign_parameters` method has changed from ``param_dict`` to ``parameters``. Passing an argument in with the name ``param_dict`` is deprecated and will be removed in future release. For example, if you were previously calling :meth:`~qiskit.circuit.QuantumCircuit.assign_parameters` with a call like: ``assign_parameters(param_dict={})`` this is deprecated and should be replaced by ``assign_parameters(values={})`` or even better just pass the argument positionally ``assign_parameters({})``.
ta_in: இதற்கான முதல் (மற்றும் ஒரே) நிலை வாதத்தின் பெயர் :meth: `qiskit.circuit.QuantumCircuit.assign_parameters` முறை ``param_dict`` இலிருந்து ``parameters`` என மாற்றப்பட்டுள்ளது. ``param_dict`` என்ற பெயருடன் ஒரு வாதத்தை அனுப்புவது நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். எடுத்துக்காட்டாக, நீங்கள் முன்பு அழைத்திருந்தால் :meth: `~ qiskit.circuit.QuantumCircuit.assign_parameters` போன்ற அழைப்போடு:` `ஒதுக்கு_பராமீட்டர்கள் (param_dict = {})`` இது நீக்கப்பட்டது மற்றும் மாற்றப்பட வேண்டும் ``assign_parameters(values={}) `` அல்லது இன்னும் சிறப்பாக வாதத்தை நிலைநிறுத்துங்கள் ``assign_parameters({})``.

source: Fixed an issue where the :func:`~qiskit.execute_function.execute` function would raise :class:`~qiskit.exceptions.QiskitError` exception when a :class:`~qiskit.circuit.ParameterVector` object was passed in for the ``parameter_bind`` kwarg. parameter. For example, it is now possible to call something like::
ta_in: :func: `q qiskit.execute_function.execute` செயல்பாடு எழுப்பும் ஒரு சிக்கல் சரி செய்யப்பட்டது :class:` ~ qiskit.exceptions.QiskitError` விதிவிலக்கு ஒரு :class: `qiskit.circuit.ParameterVector` பொருள் அனுப்பப்பட்டபோது ``parameter_bind`` குவார்க். அளவுரு. எடுத்துக்காட்டாக, இப்போது போன்றவற்றை அழைக்க முடியும்::

source: where ``pv1`` and ``pv2`` are :class:`~qiskit.circuit.ParameterVector` objects. Fixed `#5467 <https://github.com/Qiskit/qiskit-terra/issues/5467>`__
ta_in: எங்கே `` pv1`` மற்றும் `` pv2`` ஆகியவை :class: `~ qiskit.circuit.ParameterVector` பொருள்கள். நிலையான `# 5467 <https://github.com/Qiskit/qiskit-terra/issues/5467>` __

source: Fixed an issue with the labels of parametric pulses in the :class:`~qiskit.qobj.PulseQobjInstruction` class were not being properly set as they are with sampled pulses. This also means that pulse names that are imported from the :class:`~qiskit.providers.models.PulseDefaults` returned by a :class:`~qiskit.providers.Backend`, such as ``x90``, ``x90m``, etc, will properly be set. Fixed `#5363 <https://github.com/Qiskit/qiskit-terra/issues/5363>`__
ta_in: வகுப்பில் உள்ள அளவுரு பருப்புகளின் லேபிள்களில் ஒரு சிக்கல் சரி செய்யப்பட்டது :class: `~ qiskit.qobj.PulseQobjInstruction` வகுப்பு மாதிரி பருப்புகளுடன் இருப்பதால் அவை சரியாக அமைக்கப்படவில்லை. வகுப்பிலிருந்து இறக்குமதி செய்யப்படும் துடிப்பு பெயர்கள் :class:`~ qiskit.providers.models.PulseDefaults` ஒரு: வகுப்பால் திருப்பி அனுப்பப்படுகிறது :class:` ~ qiskit.providers.Backend`, `` x90``, `` x90 மீ ``, போன்றவை சரியாக அமைக்கப்படும். நிலையான `# 5363 <https://github.com/Qiskit/qiskit-terra/issues/5363>` __

source: Fixed an issue where unbound parameters only occurring in the :attr:`~qiskit.circuit.QuantumCircuit.global_phase` attribute of a :class:`~qiskit.circuit.QuantumCircuit` object would not show in the :attr:`~qiskit.circuit.QuantumCircuit.parameters` attribute and could not be bound. Fixed `#5806 <https://github.com/Qiskit/qiskit-terra/issues/5806>`__
ta_in: வரம்பற்ற அளவுருக்கள் மட்டுமே நிகழும் ஒரு சிக்கல் சரி செய்யப்பட்டது :attr: `~ qiskit.circuit.QuantumCircuit.global_phase` ஒரு: வகுப்பின் பண்புக்கூறு :class:` ~ qiskit.circuit.QuantumCircuit` பொருள் :attr: `qiskit இல் காட்டாது. circ.QuantumCircuit.parameters` பண்புக்கூறு மற்றும் கட்டுப்படுத்த முடியவில்லை. நிலையான `# 5806 <https://github.com/Qiskit/qiskit-terra/issues/5806>` __

source: The :attr:`~qiskit.circuit.QuantumCircuit.calibrations` attribute of :class:`~qiskit.circuit.QuantumCircuit` objects are now preserved when the ``+=`` (ie the :meth:`~qiskit.circuit.QuantumCircuit.extend` method) and the ``+`` (ie the :meth:`~qiskit.circuit.QuantumCircuit.combine` method) are used. Fixed `#5930 <https://github.com/Qiskit/qiskit-terra/pull/5930>`__ and `#5908 <https://github.com/Qiskit/qiskit-terra/issues/5908>`__
ta_in: ``+=`` (அதாவது :meth:`~qiskit.circuit.QuantumCircuit.extend` முறை) மற்றும் ``+`` (அதாவது :meth:`~qiskit.circuit.QuantumCircuit.combine` முறை) பயன்படுத்தும்போது :class:`~qiskit.circuit.QuantumCircuit`இன் பண்பு :attr:`~qiskit.circuit.QuantumCircuit.calibrations` பொருள்கள் இப்போது பாதுகாக்கப்படுகின்றன. நிலையான `# 5930 <https://github.com/Qiskit/qiskit-terra/pull/5930>` __ மற்றும் `# 5908 <https://github.com/Qiskit/qiskit-terra/issues/5908>` __

source: The :attr:`~qiskit.circuit.Register.name` setter method of class :class:`~qiskit.circuit.Register` (which is the parent class of :class:`~qiskit.circuit.QuantumRegister` and :class:`~qiskit.circuit.ClassicalRegister`) previously did not check if the assigned string was a valid register name as per the `OpenQASM specification <https://arxiv.org/pdf/1707.03429v2.pdf>`__. This check was previously only performed when the name was specified in the constructor, this has now been fixed so that setting the ``name`` attribute directly with an invalid value will now also raise an exception. Fixed `#5461 <https://github.com/Qiskit/qiskit-terra/issues/5461>`__
ta_in: The :attr:'~qiskit.circuit.Register.name' வகுப்பின் செட்டர் முறை :class: ~qiskit.circuit.Register` (இது பெற்றோர்வகுப்பு :class: '~qiskit.circuit.QuantumRegister` மற்றும் :class:`~qiskit.circuit.ClassicalRegister') ஒதுக்கப்பட்ட சரம் செல்லுபடியாகும் பதிவுபெயரா என்பதை முன்னர் சரிபார்க்கவில்லை `OpenQASMவிவரக்குறிப்பு <https://arxiv.org/pdf/1707.03429v2.pdf>. இந்த சரிபார்ப்பு முன்பு மட்டுமே செய்யப்பட்டது கட்டமைப்பாளரில் பெயர் குறிப்பிடப்பட்டபோது,இது இப்போது சரி செய்யப்பட்டுள்ளது, இதனால் `` பெயர்`` பண்புக்கூறு தவறான மதிப்புடன் நேரடியாக அமைப்பது இப்போது விதிவிலக்கையும் எழுப்புகிறது. சரி செய்யப்பட்டது `#5461<https://github.com/Qiskit/qiskit-terra/issues/5461>'__

source: Fixed an issue with the :func:`qiskit.visualization.circuit_drawer` function and :meth:`qiskit.circuit.QuantumCircuit.draw` method when visualizing a :class:`~qiskit.circuit.QuantumCircuit` with a :class:`~qiskit.circuit.Gate` that has a classical condition after a :class:`~qiskit.circuit.Measure` that used the same :class:`~qiskit.circuit.ClassicalRegister`, it was possible for the conditional :class:`~qiskit.circuit.Gate` to be displayed to the left of the :class:`~qiskit.circuit.Measure`. Fixed `#5387 <https://github.com/Qiskit/qiskit-terra/issues/5387>`__
ta_in: ஒரு சிக்கல் சரி செய்யப்பட்டது:func:`qiskit.visualization.circuit_drawer` செயல்பாடு மற்றும்:meth:`qiskit.circuit.QuantumCircuit.draw` காட்சிப்படுத்தும் முறை :class:`~qiskit.circuit.QuantumCircuit` உடன் ஒரு:class:`~qiskit.circuit.Gate` அதற்குப் பிறகு ஒரு கிளாசிக்கல் நிலை உள்ளது:class:`~qiskit.circuit.Measure` அதே பயன்படுத்தப்பட்டது:class:`~qiskit.circuit.ClassicalRegister`,இது நிபந்தனைக்கு சாத்தியமானது:class:`~qiskit.circuit.Gate`இடதுபுறத்தில் காட்டப்படும் :class:`~qiskit.circuit.Measure`. சரி செய்யப்பட்டது`#5387<https://github.com/Qiskit/qiskit-terra/issues/5387>`__

source: In the transpiler pass :class:`qiskit.transpiler.passes.CSPLayout` a bias towards lower numbered qubits could be observed. This undesireable bias has been fixed by shuffling the candidates to randomize the results. Furthermore, the usage of the :class:`~qiskit.transpiler.passes.CSPLayout` pass in the :mod:`~qiskit.transpiler.preset_passmanagers` (for level 2 and 3) has been adjusted to use a configured seed if the ``seed_transpiler`` kwarg is set when :func:`~qiskit.compiler.transpile` is called. Fixed `#5990 <https://github.com/Qiskit/qiskit-terra/issues/5990>`__
ta_in: டிரான்ஸ்பைலர் பாஸில்:class:`qiskit.transpiler.passes.CSPLayout`குறைந்த எண்ணிக்கையிலான குவிட்களை நோக்கிய ஒரு சார்பு காணப்படுகிறது. முடிவுகளை சீரற்றதாக்க வேட்பாளர்களை மாற்றுவதன் மூலம் இந்த விரும்பத்தகாத சார்பு சரி செய்யப்பட்டது. மேலும், பயன்பாடு:class:`~qiskit.transpiler.passes.CSPLayout` கடந்து செல்லுங்கள்:mod:`~qiskit.transpiler.preset_passmanagers`(நிலை 2 மற்றும் 3 க்கு) கட்டமைக்கப்பட்ட விதைகளைப் பயன்படுத்த சரிசெய்யப்பட்டால்``seed_transpiler``kwarg எப்போது அமைக்கப்படுகிறது:func:`~qiskit.compiler.transpile`என்று அழைக்கப்படுகிறது. சரி செய்யப்பட்டது`#5990 <https://github.com/Qiskit/qiskit-terra/issues/5990>`__

source: Fixes a bug where the ``channels`` field for a :class:`~qiskit.providers.models.PulseBackendConfiguration` object was not being included in the output of the :class:`qiskit.providers.models.PulseBackendConfiguration.to_dict` method. Fixed `#5579 <https://github.com/Qiskit/qiskit-terra/issues/5579>`__
ta_in: வகுப்பிற்கான `` சேனல்கள்`` புலம் :class: `~ qiskit.providers.models.PulseBackendConfiguration` பொருள்: வகுப்பின் வெளியீட்டில் சேர்க்கப்படாத ஒரு பிழை :class:` qiskit.providers.models.PulseBackendConfiguration.to_dict` முறை. நிலையான `# 5579 <https://github.com/Qiskit/qiskit-terra/issues/5579>` __

source: Fixed the ``'circular'`` entanglement in the :class:`qiskit.circuit.library.NLocal` circuit class for the edge case where the circuit has the same size as the entanglement block (e.g. a two-qubit circuit and CZ entanglement gates). In this case there should only be one entanglement gate, but there was accidentially added a second one in the inverse direction as the first. Fixed `Qiskit/qiskit-aqua#1452 <https://github.com/Qiskit/qiskit-aqua/issues/1452>`__
ta_in: சரி செய்யப்பட்டது ``'circular'`' சிக்கலில்:class:`qiskit.circuit.library.NLocal` விளிம்பு வழக்குக்கான சுற்று வகுப்பு, அங்கு சுற்றுக்கு சிக்கலான தொகுதி உள்ளது கேட்(எ.கா. இரண்டு-குவிட் சுற்று மற்றும் CZ சிக்கலான வாயில்கள்).இந்த வழக்கில் ஒரே ஒரு சிக்கல் வாயில் மட்டுமே இருக்க வேண்டும், ஆனால் தலைகீழ் திசையில் முதல் ஒன்றை தற்செயலாகச் சேர்த்தது.சரி செய்யப்பட்டது`Qiskit/qiskit-aqua#1452 <https://github.com/Qiskit/qiskit-aqua/issues/1452>`__

source: Fixed the handling of breakpoints in the :class:`~qiskit.circuit.library.PiecewisePolynomialPauliRotations` class in the :mod:`qiskit.circuit.library`. Now for ``n`` intervals, ``n+1`` breakpoints are allowed. This enables specifying another end interval other than :math:`2^\text{num qubits}`. This is important because from the end of the last interval to :math:`2^\text{num qubits}` the function is the identity.
ta_in: பிரேக் பாயிண்டுகளின் கையாளுதல் சரி செய்யப்பட்டது:class:`~qiskit.circuit.library.PiecewisePolynomialPauliRotations`.வகுப்பு:mod:`qiskit.circuit.library`.இப்போது ``n``இடைவெளிகள்,'`n+1`` இடைவேளை புள்ளிகள் அனுமதிக்கப்படுகின்றன.இது தவிர வேறு இறுதி இடைவெளியைக் குறிப்பிட உதவுகிறது:math:`2^\text{num qubits}'.இது முக்கியமானது, ஏனெனில் கடைசி இடைவெளியின் முடிவில் இருந்து:math:`2^\text{num qubits}' செயல்பாடு என்பது அடையாளம்.

source: Fixed an issue in the :class:`qiskit.circuit.library.Permutation` circuit class where some permutations would not be properly generated. This issue could also effect :class:`qiskit.circuit.library.QuantumVolume` if it were called with `classical_permutation=False``. Fixed `#5812 <https://github.com/Qiskit/qiskit-terra/issues/5812>`__
ta_in: இல் ஒரு சிக்கல் சரி செய்யப்பட்டது:class:`qiskit.circuit.library.Permutation`சில வரிசைமாற்றங்கள் சரியாக உருவாக்கப்படாத சுற்று வகுப்பு. இந்த சிக்கலும் பாதிக்கப்படலாம்:class:`qiskit.circuit.library.QuantumVolume`அது அழைக்கப்பட்டால்`classical_permutation=False``நிர்ணயித்தல்`#5812 <https://github.com/Qiskit/qiskit-terra/issues/5812>`__

source: Fixed an issue where generating QASM output with the :meth:`~qiskit.circuit.QuantumCircuit.qasm` method for a :class:`~qiskit.circuit.QuantumCircuit` object that has a :class:`~qiskit.circuit.ControlledGate` with an open control the output would be as if all controls were closed independent of the specified control state. This would result in a different circuit being created from :meth:`~qiskit.circuit.QuantumCircuit.from_qasm_str` if parsing the generated QASM.
ta_in: உருவாக்கும் இடத்தில் ஒரு சிக்கல் சரி செய்யப்பட்டதுQASMஉடன் வெளியீடு:meth:`~qiskit.circuit.QuantumCircuit.qasm` ஒரு முறை:class:`~qiskit.circuit.QuantumCircuit` ஒரு பொருள்:class:`~qiskit.circuit.ControlledGate`திறந்த கட்டுப்பாட்டுடன் வெளியீடு அனைத்து கட்டுப்பாடுகளும் குறிப்பிட்ட கட்டுப்பாட்டு நிலையிலிருந்து சுயாதீனமாக மூடப்பட்டிருக்கும். இதன் விளைவாக வேறுபட்ட சுற்று உருவாக்கப்படும்:meth:`~qiskit.circuit.QuantumCircuit.from_qasm_str`உருவாக்கப்பட்ட பாகுபடுத்தினால்QASM.

source: This was fixed by updating the QASM output from :meth:`~qiskit.circuit.QuantumCircuit.qasm` by defining a composite gate which uses :class:`~qiskit.circuit.XGate` to implement the open controls. The composite gate is named like ``<original_gate_name>_o<ctrl_state>`` where ``o`` stands for open control and ``ctrl_state`` is the integer value of the control state. Fixed `#5443 <https://github.com/Qiskit/qiskit-terra/issues/5443>`__
ta_in: புதுப்பிப்பதன் மூலம் இது சரி செய்யப்பட்டது QASM வெளியீடு :meth:`~qiskit.circuit.QuantumCircuit.qasm` பயன்படுத்தும் கலப்பு வாயிலை வரையறுப்பதன் மூலம்:class: `~qiskit.circuit.XGate` திறந்த கட்டுப்பாடுகளை செயல்படுத்த. கலப்பு வாயில் போன்ற பெயர்<original_gate_name>_o<ctrl_state>`` எங்கே ``o`` திறந்த கட்டுப்பாடு மற்றும் ``ctrl_state`` என்பது கட்டுப்பாட்டு நிலையின் முழு மதிப்பு.நிர்ணயித்தல் `#5443 <https://github.com/Qiskit/qiskit-terra/issues/5443>`__

source: Fixed an issue where binding :class:`~qiskit.circuit.Parameter` objects in a :class:`~qiskit.circuit.QuantumCircuit` with the ``parameter_binds`` in the :class:`~qiskit.execute_function.execute` function would cause all the bound :class:`~qiskit.circuit.QuantumCircuit` objects would have the same :attr:`~qiskit.circuit.QuantumCircuit.name`, which meant the result names were also not unique. This fix causes the :meth:`~qiskit.circuit.QuantumCircuit.bind_parameters` and :meth:`~qiskit.circuit.QuantumCircuit.assign_parameters` to assign a unique circuit name when ``inplace=False`` as::
ta_in: பிணைக்கும் இடத்தில் ஒரு சிக்கல் சரி செய்யப்பட்டது :class:`~qiskit.circuit.Parameter`ஒரு பொருள்கள் :class:`~qiskit.circuit.QuantumCircuit`உடன்``parameter_binds``இல் :class:`~qiskit.execute_function.execute`செயல்பாடு அனைத்து எல்லைகளையும் ஏற்படுத்தும் :class:`~qiskit.circuit.QuantumCircuit`பொருள்கள் ஒரே மாதிரியாக இருக்கும் :attr:`~qiskit.circuit.QuantumCircuit.name` இதன் விளைவாக முடிவு பெயர்களும் தனித்துவமானவை அல்ல. இந்த பிழைத்திருத்தம் ஏற்படுகிறது :meth:`~qiskit.circuit.QuantumCircuit.bind_parameters`மற்றும் :meth:`~qiskit.circuit.QuantumCircuit.assign_parameters`ஒரு தனிப்பட்ட சுற்று பெயரை எப்போது ஒதுக்க``inplace=False``என ::

source: where ``<base name>`` is the name supplied by the "name" kwarg, otherwise it defaults to "circuit". The class instance number gets incremented every time an instance of the class is generated. ``<pid name>`` is appended if called outside the main process. Fixed `#5185 <https://github.com/Qiskit/qiskit-terra/issues/5185>`__
ta_in: எங்கே``<base name>``வழங்கிய பெயர்"name"குவார்க், இல்லையெனில் அது இயல்புநிலையாக இருக்கும்"circuit".ஒவ்வொரு முறையும் வகுப்பின் ஒரு நிகழ்வு உருவாக்கப்படும் போது வகுப்பு நிகழ்வு எண் அதிகரிக்கும்.``<pid name>``முக்கிய செயல்முறைக்கு வெளியே அழைக்கப்பட்டால் சேர்க்கப்படும். சரி செய்யப்பட்டது`#5185 <https://github.com/Qiskit/qiskit-terra/issues/5185>`__

source: Fixed an issue with the :func:`~qiskit.compiler.scheduler` function where it would raise an exception if an input circuit contained an unbound :class:`~qiskit.circuit.QuantumCircuit` object. Fixed `#5304 <https://github.com/Qiskit/qiskit-terra/issues/5304>`__
ta_in: :func:`~qiskit.compiler.scheduler செயல்பாட்டுடன் ஒரு சிக்கல் சரி செய்யப்பட்டது, அங்கு ஒரு உள்ளீட்டு சுற்றுக்கு வரம்பற்ற :class:`~qiskit.circuit.QuantumCircuit` object. பொருள் இருந்தால் அது விதிவிலக்கு அளிக்கும். `# 5304 <https://github.com/Qiskit/qiskit-terra/issues/5304>` சரி செய்யப்பட்டது __

source: Fixed an issue in the :class:`qiskit.transpiler.passes.TemplateOptimization` transpiler passes where template circuits that contained unbound :class:`~qiskit.circuit.Parameter` objects would crash under some scenarios if the parameters could not be bound during the template matching. Now, if the :class:`~qiskit.circuit.Parameter` objects can not be bound templates with unbound :class:`~qiskit.circuit.Parameter` are discarded and ignored by the :class:`~qiskit.transpiler.passes.TemplateOptimization` pass. Fixed `#5533 <https://github.com/Qiskit/qiskit-terra/issues/5533>`__
ta_in: இல் ஒரு சிக்கல் சரி செய்யப்பட்டது :class:`qiskit.transpiler.passes.TemplateOptimization` வரம்பற்ற அளவைக் கொண்ட வார்ப்புரு சுற்றுகள் இருக்கும் இடத்தில் டிரான்ஸ்பைலர் கடந்து செல்கிறது :class:`~qiskit.circuit.Parameter` வார்ப்புரு பொருத்தத்தின் போது அளவுருக்களைக் கட்டுப்படுத்த முடியாவிட்டால் பொருள்கள் சில காட்சிகளின் கீழ் செயலிழக்கும். இப்போது, ​​என்றால் :class:`~qiskit.circuit.Parameter`பொருள்களை வரம்பற்ற வார்ப்புருக்களுடன் பிணைக்க முடியாது :class:`~qiskit.circuit.Parameter`நிராகரிக்கப்பட்டு புறக்கணிக்கப்படுகிறது :class:`~qiskit.transpiler.passes.TemplateOptimization` பாஸ். சரி செய்யப்பட்டது#5533 <https://github.com/Qiskit/qiskit-terra/issues/5533>`__

source: Fixed an issue with the :func:`qiskit.visualization.timeline_drawer` function where classical bits were inproperly handled. Fixed `#5361 <https://github.com/Qiskit/qiskit-terra/issues/5361>`__
ta_in: கிளாசிக்கல் பிட்கள் முறையற்ற முறையில் கையாளப்பட்ட :func:`qiskit.visualization.timeline_drawer` செயல்பாட்டின் சிக்கல் சரி செய்யப்பட்டது. `#5361 <https://github.com/Qiskit/qiskit-terra/issues/5361>` சரி செய்யப்பட்டது

source: Fixed an issue in the :func:`qiskit.visualization.circuit_drawer` function and the :meth:`qiskit.circuit.QuantumCircuit.draw` method where :class:`~qiskit.circuit.Delay` instructions in a :class:`~qiskit.circuit.QuantumCircuit` object were not being correctly treated as idle time. So when the ``idle_wires`` kwarg was set to ``False`` the wires with the :class:`~qiskit.circuit.Delay` objects would still be shown. This has been fixed so that the idle wires are removed from the visualization if there are only :class:`~qiskit.circuit.Delay` objects on a wire.
ta_in: :func:`qiskit.visualization.circuit_drawer` செயல்பாடு மற்றும் :meth:`qiskit.circuit.QuantumCircuit.draw` இல் ஒரு சிக்கல் சரி செய்யப்பட்டது. :class:`~qiskit.circuit.QuantumCircuit பொருளில் :class:`~qiskit.circuit.Delay` அறிவுறுத்தல்கள் செயலற்ற நேரமாக சரியாக கருதப்படவில்லை. ஆகவே, ``idle_wires`` குவார்க் `` False`` என அமைக்கப்பட்டிருக்கும் போது :class:`~ qiskit.circuit.Delay` பொருள்கள் காண்பிக்கப்படும். இது சரி செய்யப்பட்டது, இதனால் செயலற்ற கம்பிகளில் :class:`~ qiskit.circuit.Delay` பொருள்கள் இருந்தால் மட்டுமே காட்சிப்படுத்தலில் இருந்து அகற்றப்படும்.

source: Previously, when the option ``layout_method`` kwarg was provided to the :func:`~qiskit.compiler.transpile` function and the ``optimization_level`` kwarg was set to >= 2 so that the pass :class:`qiskit.transpiler.passes.CSPLayout` would run, if :class:`~qiskit.transpiler.passes.CSPLayout` found a solution then the method in ``layout_method`` was not executed. This has been fixed so that if specified, the ``layout_method`` is always honored. Fixed `#5409 <https://github.com/Qiskit/qiskit-terra/issues/5409>`__
ta_in: முன்பு, விருப்பம் போது ``layout_method`` குவார்க் வழங்கப்பட்டது :func:`~qiskit.compiler.transpile` செயல்பாடு மற்றும் `optimization_level`` kwarg என அமைக்கப்பட்டது >= 2 அதனால் பாஸ்:class:'qiskit.transpiler.passes.CSPLayout` இருந்தால், இயங்கும்:class:`~qiskit.transpiler.passes.CSPLayout` ஒரு தீர்வைக் கண்டுபிடித்தார்``layout_method`` செயல்படுத்தப்படவில்லை.இது சரி செய்யப்பட்டது, எனவே குறிப்பிடப்பட்டால், தி ``layout_method`` எப்போதும் கவுரவிக்கப்படுகிறது.நிர்ணயித்தல் `#5409<https://github.com/Qiskit/qiskit-terra/issues/5409>`__

source: When the argument ``coupling_map=None`` (either set explicitly, set implicitly as the default value, or via the ``backend`` kwarg), the transpiling process was not "embedding" the circuit. That is, even when an ``initial_layout`` was specified, the virtual qubits were not assigned to physical qubits. This has been fixed so that now, the :func:`qiskit.compiler.transpile` function honors the ``initial_layout`` argument by embedding the circuit:
ta_in: வாதம் போது``coupling_map=None``(வெளிப்படையாக அமைக்கவும், இயல்புநிலை மதிப்பாக மறைமுகமாக அமைக்கவும் அல்லது வழியாக``backend``குவார்க்), கடத்தும் செயல்முறை இல்லை"embedding"சர்க்குட். அதாவது, ஒரு போது கூட ``initial_layout`` குறிப்பிடப்பட்டது , மெய்நிகர் குவிட்கள் உடல் வினாடிகளுக்கு ஒதுக்கப்படவில்லை. இது சரி செய்யப்பட்டது, எனவே இப்போது:func:`qiskit.compiler.transpile`செயல்பாடு மரியாதை``initial_layout``சுற்று உட்பொதிப்பதன் மூலம் வாதம்:

source: If the ``initial_layout`` refers to more qubits than in the circuit, the transpiling process will extended the circuit with ancillas.
ta_in: ``initial_layout`` என்பது சுற்றுவட்டத்தை விட அதிகமான க்யூபிட்களைக் குறிக்கிறது என்றால், கடத்தும் செயல்முறை சுற்றுக்கு துணைக்குழாய்களை நீட்டிக்கும்.

source: Fixed `#5345 <https://github.com/Qiskit/qiskit-terra/issues/5345>`__
ta_in: சரி செய்யப்பட்டது `#5345 <https://github.com/Qiskit/qiskit-terra/issues/5345>`__
