Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: Previously, SummedOp.to_matrix_op built a list MatrixOp's (with numpy matrices) and then summed them, returning a single MatrixOp. Some algorithms (for example vqe) require summing thousands of matrices, which exhausts memory when building the list of matrices. With this change, no list is constructed. Rather, each operand in the sum is converted to a matrix, added to an accumulator, and discarded.
ta_in: முன்னதாக, SummedOp.to_matrix_op மேட்ரிக்ஸ்ஆப்பின் (நம்பர் மெட்ரிக்ஸுடன்) ஒரு பட்டியலை உருவாக்கி, பின்னர் அவற்றைச் சுருக்கி, ஒரு மேட்ரிக்ஸ்ஆப்பைத் திருப்பித் தருகிறது. சில வழிமுறைகளுக்கு (எடுத்துக்காட்டாக vqe) ஆயிரக்கணக்கான மெட்ரிக்குகளைச் சேர்ப்பது தேவைப்படுகிறது, இது மெட்ரிக்ஸின் பட்டியலை உருவாக்கும்போது நினைவகத்தை வெளியேற்றும். இந்த மாற்றத்தால், எந்த பட்டியலும் கட்டப்படவில்லை. மாறாக, தொகையில் உள்ள ஒவ்வொரு செயல்பாடும் ஒரு மேட்ரிக்ஸாக மாற்றப்பட்டு, ஒரு குவிப்பானில் சேர்க்கப்பட்டு, நிராகரிக்கப்படுகிறது.

source: Changing backends in VQE from statevector to qasm_simulator or real device was causing an error due to CircuitSampler incompatible reuse. VQE was changed to always create a new CircuitSampler and create a new expectation in case not entered by user. Refer to `#1153 <https://github.com/Qiskit/qiskit-aqua/issues/1153>` for more details.
ta_in: சர்க்யூட் சாம்ப்லர் பொருந்தாத மறுபயன்பாடு காரணமாக VQE இல் பின்தளத்தில் இருந்து ஸ்டேட்வெக்டரிலிருந்து qasm_simulator அல்லது உண்மையான சாதனத்திற்கு மாற்றுவது பிழையை ஏற்படுத்தியது. எப்போதும் ஒரு புதிய சர்க்யூட்ஸாம்ப்ளரை உருவாக்குவதற்கும் பயனரால் நுழையப்படாவிட்டால் புதிய எதிர்பார்ப்பை உருவாக்குவதற்கும் VQE மாற்றப்பட்டது. மேலும் விவரங்களுக்கு `# 1153 <https://github.com/Qiskit/qiskit-aqua/issues/1153>` ஐப் பார்க்கவும்.

source: Exchange and Wikipedia finance providers were fixed to correctly handle Quandl data. Refer to `#775 <https://github.com/Qiskit/qiskit-aqua/issues/775>` for more details. Fixes a divide by 0 error on finance providers mean vector and covariance matrix calculations. Refer to `#781 <https://github.com/Qiskit/qiskit-aqua/issues/781>` for more details.
ta_in: குவாண்டல் தரவை சரியாகக் கையாள பரிவர்த்தனை மற்றும் விக்கிபீடியா நிதி வழங்குநர்கள் சரி செய்யப்பட்டனர். மேலும் விவரங்களுக்கு `# 775 <https://github.com/Qiskit/qiskit-aqua/issues/775>` ஐப் பார்க்கவும். நிதி வழங்குநர்களில் 0 பிழையால் வகுக்கப்படுவதை சரிசெய்கிறது திசையன் மற்றும் கோவாரன்ஸ் மேட்ரிக்ஸ் கணக்கீடுகள். மேலும் விவரங்களுக்கு `# 781 <https://github.com/Qiskit/qiskit-aqua/issues/781>` ஐப் பார்க்கவும்.

source: The ``ListOp.combo_fn`` property has been lost in several transformations, such as converting to another operator type, traversing, reducing or multiplication. Now this attribute is propagated to the resulting operator.
ta_in: மற்றொரு ஆபரேட்டர் வகையாக மாற்றுவது, பயணித்தல், குறைத்தல் அல்லது பெருக்கல் போன்ற பல மாற்றங்களில் `` ListOp.combo_fn`` சொத்து இழந்துவிட்டது. இப்போது இந்த பண்பு விளைவாக ஆபரேட்டருக்கு பிரச்சாரம் செய்யப்படுகிறது.

source: The evaluation of some operator expressions, such as of ``SummedOp``s and evaluations with the ``CircuitSampler`` did not treat coefficients correctly or ignored them completely. E.g. evaluating ``~StateFn(0 * (I + Z)) @ Plus`` did not yield 0 or the normalization of ``~StateFn(I) @ ((Plus + Minus) / sqrt(2))`` missed a factor of ``sqrt(2)``. This has been fixed.
ta_in: சில ஆபரேட்டர் வெளிப்பாடுகளின் மதிப்பீடு, அதாவது ``SummedOp`` மற்றும் ``CircuitSampler`` உடன் மதிப்பீடுகள் குணகங்களை சரியாக நடத்தவில்லை அல்லது அவற்றை முழுமையாக புறக்கணிக்கவில்லை. எ.கா. `` StateFn(0 * (I + Z)) @ Plus`` ஐ மதிப்பீடு செய்யவில்லை அல்லது `` ~StateFn(I) @ ((Plus + Minus) / sqrt(2))`` இயல்பாக்கம் தவறவிட்டது ``sqrt(2)`` இன் காரணி. இது சரி செய்யப்பட்டது.

source: ``OptimizationResult`` included some public setters and class variables were ``Optional``. This fix makes all class variables read-only so that mypy and pylint can check types more effectively. ``MinimumEigenOptimizer.solve`` generated bitstrings in a result as ``str``. This fix changed the result into ``List[float]`` as the other algorithms do. Some public classes related to optimization algorithms were missing in the documentation of ``qiskit.optimization.algorithms``. This fix added all such classes to the docstring. `#1131 <https://github.com/Qiskit/qiskit-aqua/issues/1131>` for more details.
ta_in: ``OptimizationResult`` சில பொது அமைப்பாளர்களை உள்ளடக்கியது மற்றும் வகுப்பு மாறிகள் ``Optional``. இந்த பிழைத்திருத்தம் அனைத்து வகுப்பு மாறிகளையும் படிக்க மட்டுமே செய்கிறது, இதனால் மைபி மற்றும் பைலிண்ட் வகைகளை மிகவும் திறம்பட சரிபார்க்க முடியும். `` MinimEEigenOptimizer.solve`` இதன் விளைவாக ``str`` என உருவாக்கப்பட்ட பிட்ஸ்ட்ரிங்ஸ். இந்த பிழைத்திருத்தம் மற்ற வழிமுறைகளைப் போலவே முடிவை ``List [float] `` என மாற்றியது. `` Qiskit.optimization.algorithms`` இன் ஆவணத்தில் தேர்வுமுறை வழிமுறைகள் தொடர்பான சில பொது வகுப்புகள் இல்லை. இந்த பிழைத்திருத்தம் இதுபோன்ற அனைத்து வகுப்புகளையும் டாக்ஸ்ட்ரிங்கில் சேர்த்தது. மேலும் விவரங்களுக்கு `# 1131 <https://github.com/Qiskit/qiskit-aqua/issues/1131>`.

source: ``OptimizationResult.__init__`` did not check whether the sizes of ``x`` and ``variables`` match or not (they should match). This fix added the check to raise an error if they do not match and fixes bugs detected by the check. This fix also adds missing unit tests related to ``OptimizationResult.variable_names`` and ``OptimizationResult.variables_dict`` in ``test_converters``. `#1167 <https://github.com/Qiskit/qiskit-aqua/issues/1167>` for more details.
ta_in: ``OptimizationResult.__init__`` `` x`` மற்றும் ``variables`` ஆகியவற்றின் அளவுகள் பொருந்துமா இல்லையா என்பதைச் சரிபார்க்கவில்லை (அவை பொருந்த வேண்டும்). இந்த பிழைத்திருத்தம் பொருந்தவில்லை என்றால் பிழையை எழுப்ப காசோலையைச் சேர்த்தது மற்றும் காசோலை மூலம் கண்டறியப்பட்ட பிழைகளை சரிசெய்கிறது. ``test_converters`` இல் ``OptimizationResult.variable_names`` மற்றும் ``OptimizationResult.variables_dict`` தொடர்பான காணாமல் போன யூனிட் சோதனைகளையும் இந்த பிழைத்திருத்தம் சேர்க்கிறது. மேலும் விவரங்களுக்கு `# 1167 <https://github.com/Qiskit/qiskit-aqua/issues/1167>`.

source: Fix parameter binding in the ``OperatorStateFn``, which did not bind parameters of the underlying primitive but just the coefficients.
ta_in: ``OperatorStateFn`` இல் அளவுரு பிணைப்பை சரிசெய்யவும், இது அடிப்படை பழமையான அளவுருக்களை பிணைக்கவில்லை, ஆனால் குணகங்களை மட்டுமே.

source: ``op.eval(other)``, where ``op`` is of type ``OperatorBase``, sometimes silently returns a nonsensical value when the number of qubits in ``op`` and ``other`` are not equal. This fix results in correct behavior, which is to throw an error rather than return a value, because the input in this case is invalid.
ta_in: ``op.eval(other) ``, ``op`` வகை ``OperatorBase`` வகை, சில நேரங்களில் அமைதியாக `` op`` மற்றும் ``other`` ஆகியவற்றில் உள்ள குவிட்களின் எண்ணிக்கை இருக்கும்போது ஒரு முட்டாள்தனமான மதிப்பை அளிக்கிறது. சமமாக இல்லை. இந்த பிழைத்திருத்தம் சரியான நடத்தையில் விளைகிறது, இது ஒரு மதிப்பைத் திருப்புவதற்குப் பதிலாக பிழையை எறிவதாகும், ஏனெனில் இந்த வழக்கில் உள்ளீடு தவறானது.

source: The ``construct_circuit`` method of ``VQE`` previously returned the expectation value to be evaluated as type ``OperatorBase``. This functionality has been moved into ``construct_expectation`` and ``construct_circuit`` returns a list of the circuits that are evaluated to compute the expectation value.
ta_in: `` VQE`` இன் ``construct_circuit`` முறை முன்பு எதிர்பார்ப்பு மதிப்பை வகை `` OperatorBase`` என மதிப்பிட வேண்டும். இந்த செயல்பாடு ``construct_expectation`` க்கு நகர்த்தப்பட்டு, ``construct_circuit`` எதிர்பார்ப்பு மதிப்பைக் கணக்கிட மதிப்பீடு செய்யப்பட்ட சுற்றுகளின் பட்டியலை வழங்குகிறது.

source: :class:`~qiskit.providers.ibmq.IBMQBackend` now has a new :meth:`~qiskit.providers.ibmq.IBMQBackend.reservations` method that returns reservation information for the backend, with optional filtering. In addition, you can now use :meth:`provider.backends.my_reservations()<qiskit.providers.ibmq.IBMQBackendService.my_reservations>` to query for your own reservations.
ta_in: :class: `~ qiskit.providers.ibmq.IBMQBackend` இப்போது புதியது:meth:` ~ qiskit.providers.ibmq.IBMQBackend.reservations` முறை பின்தளத்தில் முன்பதிவு தகவல்களை விருப்ப வடிகட்டலுடன் வழங்குகிறது. கூடுதலாக, நீங்கள் இப்போது பயன்படுத்தலாம்: உங்கள் சொந்த முன்பதிவுகளை வினவ, :meth: `provider.backends.my_reservations()<qiskit.providers.ibmq.IBMQBackendService.my_reservations>`.

source: :meth:`qiskit.providers.ibmq.job.IBMQJob.result` raises an :class:`~qiskit.providers.ibmq.job.IBMQJobFailureError` exception if the job has failed. The exception message now contains the reason the job failed, if the entire job failed for a single reason.
ta_in: :meth: `qiskit.providers.ibmq.job.IBMQJob.result` ஒரு: வகுப்பை எழுப்புகிறது:class:`~qiskit.providers.ibmq.job.IBMQJobFailureError` விதிவிலக்கு வேலை தோல்வியடைந்தால். விதிவிலக்கு செய்தியில் இப்போது வேலை தோல்வியடைந்ததற்கான காரணம் உள்ளது, முழு வேலையும் ஒரே காரணத்திற்காக தோல்வியடைந்தால்.

source: A new attribute ``client_version`` was added to :class:`~qiskit.providers.ibmq.job.IBMQJob` and :class:`qiskit.result.Result` object retrieved via :meth:`qiskit.providers.ibmq.job.IBMQJob.result`. ``client_version`` is a dictionary with the key being the name and the value being the version of the client used to submit the job, such as Qiskit.
ta_in: "client_version" என்ற புதிய பண்புக்கூறு :'~qiskit.providers.ibmq.job.IBMQJob' மற்றும் :class:'qiskit.result.Result' object retrieved by :meth:'qiskit.providers.ibmq.job.IBMQJob.result'. "client_version" என்பது ஒரு அகராதி, அதாவது பெயர் மற்றும் மதிப்பு என்பது Qiskit போன்ற வேலையை சமர்ப்பிக்க பயன்படுத்தப்படும் கிளையன்ட்டின் பதிப்பு ஆகும்.

source: The :func:`~qiskit.providers.ibmq.least_busy` function now takes a new, optional parameter ``reservation_lookahead``. If specified or defaulted to, a backend is considered unavailable if it has reservations in the next ``n`` minutes, where ``n`` is the value of ``reservation_lookahead``. For example, if the default value of 60 is used, then any backends that have reservations in the next 60 minutes are considered unavailable.
ta_in: :func:'~qiskit.providers.ibmq.least_busy' செயல்பாடு இப்போது ஒரு புதிய, விருப்ப அளவுரு "reservation_lookahead" எடுக்கும். குறிப்பிடப்பட்டாலோ அல்லது இயல்புநிலையில் இருந்தாலோ, அடுத்த 'n' நிமிடங்களில் இட ஒதுக்கீடு இருந்தால், பின்முனை கிடைக்காது எனக் கருதப்படுகிறது, அங்கு "n" என்பது "reservation_lookahead" மதிப்பு. எடுத்துக்காட்டாக, 60 இன் முன்னிருப்பு மதிப்பு பயன்படுத்தப்பட்டால், அடுத்த 60 நிமிடங்களில் முன்பதிவுகளைக் கொண்ட எந்த பேக்எண்களும் கிடைக்கப்பெறாது எனக் கருதப்படும்.

source: :class:`~qiskit.providers.ibmq.managed.ManagedResults` now has a new :meth:`~qiskit.providers.ibmq.managed.ManagedResults.combine_results` method that combines results from all managed jobs and returns a single :class:`~qiskit.result.Result` object. This ``Result`` object can be used, for example, in ``qiskit-ignis`` fitter methods.
ta_in: :class:'~qiskit.providers.ibmq.managed.ManagedResults' now has a new :meth:'~qiskit.providers.ibmq.managed.ManagedResults.combine_results' method that combins results from all managed jobs and returns a single :class:'~qiskit.result.Result' object. இந்த "முடிவு" பொருளை உதாரணமாக , "கிஸ்கிட்-இக்னிசு" ஃபிட்டர் முறைகளில் பயன்படுத்தலாம்.

source: Timestamps in the following fields are now in local time instead of UTC:
ta_in: பின்வரும் புலங்களில் நேர முத்திரைகள் இப்போது UTC க்கு பதிலாக உள்ளூர் நேரத்தில் உள்ளன:

source: Backend properties returned by :meth:`qiskit.providers.ibmq.IBMQBackend.properties`.
ta_in: பின்நிலையில் பண்புகள் :meth:'qiskit.providers.ibmq.IBMQBackend.properties'.

source: Backend properties returned by :meth:`qiskit.providers.ibmq.job.IBMQJob.properties`.
ta_in: பின்நிலையில் பண்புகள் :meth:'qiskit.providers.ibmq.job.IBMQJob.properties'ஆல் திருப்பி யளிக்கப்பட்டது.

source: ``estimated_start_time`` and ``estimated_complete_time`` in :class:`~qiskit.providers.ibmq.job.QueueInfo`, returned by :meth:`qiskit.providers.ibmq.job.IBMQJob.queue_info`.
ta_in: ` ` estimated_start_time ` ` and ` ` estimated_complete_time ` ` in :class:` ~ qiskit.preers.ibmq.job.QueueInfo `, திரும்பிய :meth:` qiskit. ' kiskit.job.IBMQJob.queue_info `.

source: ``date`` in :class:`~qiskit.result.Result`, returned by :meth:`qiskit.providers.ibmq.job.IBMQJob.result`.
ta_in: "date" in :class:'~qiskit.result.Result', மூலம் திரும்பியது :meth:'qiskit.providers.ibmq.job.IBMQJob.result'.

source: In addition, the ``datetime`` parameter for :meth:`qiskit.providers.ibmq.IBMQBackend.properties` is also expected to be in local time unless it has UTC timezone information.
ta_in: கூடுதலாக, "datetime" அளவுரு ":meth:'qiskit.providers.ibmq.IBMQBackend.properties' க்கான "datetime" அளவுரு வும் UTC நேரமண்டல தகவலைக் கொண்டாலன்றி உள்ளூர் நேரத்தில் இருக்கும் என எதிர்பார்க்கப்படுகிறது.

source: ``websockets`` 8.0 or above is now required if Python 3.7 or above is used. ``websockets`` 7.0 will continue to be used for Python 3.6 or below.
ta_in: "websockets" 8.0 அல்லது அதற்கு மேல் பைதான் 3.7 அல்லது அதற்கு மேல் பயன்படுத்தப்பட்டால் இப்போது தேவைப்படுகிறது. "websockets" 7.0 பைத்தான் 3.6 அல்லது அதற்கு கீழே தொடர்ந்து பயன்படுத்தப்படும்.

source: On Windows, the event loop policy is set to ``WindowsSelectorEventLoopPolicy`` instead of using the default ``WindowsProactorEventLoopPolicy``. This fixes the issue that the :meth:`qiskit.providers.ibmq.job.IBMQJob.result` method could hang on Windows. Fixes `#691 <https://github.com/Qiskit/qiskit-ibmq-provider/issues/691>`_
ta_in: Windows இல், நிகழ்வு வளைய கொள்கை "WindowsSelectorEventLoopPolicy" க்கு முன்னிருப்பு "WindowsProactorEventLoopPolicy" ஐ பயன்படுத்துவதற்கு பதிலாக அமைக்கப்பட்டுள்ளது. இது ":meth:'qiskit.providers.ibmq.job.IBMQJob.result" முறை Windows இல் தொங்கலாம் என்ற சிக்கலை த் தீர்க்கிறது. '#691 <https://github.com/Qiskit/qiskit-ibmq-provider/issues/691>' சரிசெய்கிறது_

source: Use of ``Qconfig.py`` to save IBM Quantum Experience credentials is deprecated and will be removed in the next release. You should use ``qiskitrc`` (the default) instead.
ta_in: IBM Quantum Experience credentials சேமிக்க ` ` Qconfig.py ` ` ஐ பயன்படுத்தவும் அடுத்த வெளியீட்டில் நீக்கப்படும். நீங்கள் ` ` qiskitrc ` ` (முன்னிருப்பு) பயன்படுத்த வேண்டும்.

source: Fixes an issue wherein a call to :meth:`qiskit.providers.ibmq.IBMQBackend.jobs` can hang if the number of jobs being returned is large. Fixes `#674 <https://github.com/Qiskit/qiskit-ibmq-provider/issues/674>`_
ta_in: ஒரு சிக்கலைத் தீர்க்கிறது, அதில் ":meth:'qiskit.providers.ibmq.IBMQBackend.jobs" என்ற அழைப்பில், திரும்பும் வேலைகளின் எண்ணிக்கை பெரியதாக இருந்தால், தொங்கலாம். '#674 <https://github.com/Qiskit/qiskit-ibmq-provider/issues/674>' சரிசெய்கிறது_

source: Fixes an issue which would raise a ``ValueError`` when building error maps in Jupyter for backends that are offline. Fixes `#706 <https://github.com/Qiskit/qiskit-ibmq-provider/issues/706>`_
ta_in: ஆஃப்லைனில் இருக்கும் பின்நிலைகளுக்கு ஜூபியர் இல் பிழை வரைபடங்களை உருவாக்கும் போது ஒரு "ValueError" ஐ எழுப்பும் ஒரு சிக்கலை சரிசெய்கிறது. '#706 <https://github.com/Qiskit/qiskit-ibmq-provider/issues/706>' சரிசெய்கிறது_

source: :meth:`qiskit.providers.ibmq.IBMQBackend.jobs` will now return the correct list of :class:`~qiskit.providers.ibmq.job.IBMQJob` objects when the ``status`` kwarg is set to ``'RUNNING'``.
ta_in: :meth: `qiskit.providers.ibmq.IBMQBackend.jobs` இப்போது சரியான பட்டியலைத் தரும்:class:` ~ qiskit.providers.ibmq.job.IBMQJob` பொருள்கள் `` status`` குவார்க் `` என அமைக்கப்பட்டால் ''`RUNNING`".

source: The package metadata has been updated to properly reflect the dependency on ``qiskit-terra`` >= 0.14.0. This dependency was implicitly added as part of the 0.7.0 release but was not reflected in the package requirements so it was previously possible to install ``qiskit-ibmq-provider`` with a version of ``qiskit-terra`` which was too old. Fixes `#677 <https://github.com/Qiskit/qiskit-ibmq-provider/issues/677>`_
ta_in: தொகுப்பு மெட்டாடேட்டா சரியாக "qiskit-terra" >= 0.14.0 சார்ந்திருப்பதை பிரதிபலிக்க புதுப்பிக்கப்பட்டுள்ளது. இந்த சார்பு 0.7.0 வெளியீட்டின் ஒரு பகுதியாக மறைமுகமாக சேர்க்கப்பட்டது, ஆனால் தொகுப்பு தேவைகளில் பிரதிபலிக்கவில்லை, எனவே இது முன்னர் மிகவும் பழைய "கிஸ்கிட்-டெர்ரா" பதிப்புடன் "qiskit-ibmq-provider" ஐ நிறுவமுடிந்தது. '#677 <https://github.com/Qiskit/qiskit-ibmq-provider/issues/677>' சரிசெய்கிறது_

source: Terra 0.14.2
ta_in: டெரா 0.14.2

source: No Change
ta_in: எந்த மாற்றமும் இல்லை

source: Aer 0.5.2
ta_in: எ இ அர் 0.5.2

source: Ignis 0.3.3
ta_in: லிக்னிஸ் 0.3.3

source: Fixes an issue in qiskit-ignis 0.3.2 which would raise an ``ImportError`` when :mod:`qiskit.ignis.verification.tomography.fitters.process_fitter` was imported without ``cvxpy`` being installed.
ta_in: கிஸ்கிட்-தலிக்னிஸ் 0.3.2 இல் ஒரு சிக்கலை சரிசெய்கிறது, இது ஒரு ``இம்போர்ட் ஏற்றோர் `` ஐ எழுப்புகிறது: mod: `qiskit.ignis.verification.tomography.fitters.process_fitter`` cvxpy` நிறுவப்படாமல் இறக்குமதி செய்யப்பட்டது.

source: Aqua 0.7.3
ta_in: அக்வா 0.7.3

source: IBM Q Provider 0.7.2
ta_in: ஐபிஎம் கியூ வழங்குபவர் 0.7.2

source: Qiskit 0.19.5
ta_in: கிஸ்கிட் 0.23.5

source: Ignis 0.3.2
ta_in: லிக்னிஸ் 0.3.2

source: The :meth:`qiskit.ignis.verification.TomographyFitter.fit` method has improved detection logic for the default fitter. Previously, the ``cvx`` fitter method was used whenever `cvxpy <https://www.cvxpy.org/>`__ was installed. However, it was possible to install cvxpy without an SDP solver that would work for the ``cvx`` fitter method. This logic has been reworked so that the ``cvx`` fitter method is only used if ``cvxpy`` is installed and an SDP solver is present that can be used. Otherwise, the ``lstsq`` fitter is used.
ta_in: The :meth:'qiskit.ignis.verification.TomographyFitter.fit' முறை முன்னிருப்பு ஃபிட்டர் க்கான கண்டறிதல் தர்க்கத்தை மேம்படுத்தியுள்ளது. இதற்கு முன்னர், 'cvxpy <https://www.cvxpy.org/>'__ நிறுவப்பட்ட போதெல்லாம் "cvx" ஃபிட்டர் முறை பயன்படுத்தப்பட்டது. எனினும், அது ஒரு SDP தீர்வு இல்லாமல் cvxpy நிறுவ முடியும் என்று "cvx" ஃபிட்டர் முறை வேலை என்று. இந்த தர்க்கம் மறுவேலை செய்யப்பட்டது, அதனால் "cvxpy" நிறுவப்பட்டால் மட்டுமே "cvx" ஃபிட்டர் முறை பயன்படுத்தப்படுகிறது மற்றும் ஒரு SDP தீர்வு பயன்படுத்த முடியும். இல்லையெனில், "lstsq" பொருத்துனர் பயன்படுத்தப்படுகிறது.

source: Fixes an edge case in :meth:`qiskit.ignis.mitigation.measurement.fitters.MeasurementFitter.apply` for input that has invalid or incorrect state labels that don't match the calibration circuit. Previously, this would not error and just return an empty result. Instead now this case is correctly caught and a ``QiskitError`` exception is raised when using incorrect labels.
ta_in: ":meth:'qiskit.ignis.mitigation.measurement.fittters.MeasurementFitter.apply' இல் ஒரு விளிம்பில் வழக்கு சரிசெய்கிறது, இது அளவுத்திருத்த சுற்றுடன் பொருந்தாத தவறான அல்லது தவறான மாநில லேபல்களைக் கொண்டுள்ளது. முன்பு, இது பிழையாக இருக்காது மற்றும் வெறும் வெற்று முடிவை த் தரும். மாறாக இப்போது இந்த வழக்கு சரியாக பிடிக்கப்படுகிறது மற்றும் தவறான லேபல்களைப் பயன்படுத்தும் போது ஒரு "QiskitError" விதிவிலக்கு எழுப்பப்படுகிறது.

source: The `cvxpy <https://www.cvxpy.org/>`__ dependency which is required for the svm classifier has been removed from the requirements list and made an optional dependency. This is because installing cvxpy is not seamless in every environment and often requires a compiler be installed to run. To use the svm classifier now you'll need to install cvxpy by either running ``pip install cvxpy<1.1.0`` or to install it with aqua running ``pip install qiskit-aqua[cvx]``.
ta_in: Svm வகைப்பாடு தேவைப்படுகிறது இது 'cvxpy <https://www.cvxpy.org/>'__ சார்பு தேவைகள் பட்டியலில் இருந்து நீக்கப்பட்டது மற்றும் ஒரு விருப்ப சார்பு செய்துள்ளது. ஏனெனில் Cvxpy ஐ நிறுவுவது ஒவ்வொரு சூழலிலும் தடையற்றதாக இல்லை, மேலும் பெரும்பாலும் ஒரு கம்பைலர் நிறுவப்பட வேண்டும். இப்போது svm classipier ஐ ப் பயன்படுத்த நீங்கள் cvxpy ஐ நிறுவ வேண்டும்,"pip install cvxpy<1.1.0" அல்லது அக்வா இயங்கும் "pip ஐ நிறுவ qiskit-aqua[cvx]".

source: The ``compose`` method of the ``CircuitOp`` used ``QuantumCircuit.combine`` which has been changed to use ``QuantumCircuit.compose``. Using combine leads to the problem that composing an operator with a ``CircuitOp`` based on a named register does not chain the operators but stacks them. E.g. composing ``Z ^ 2`` with a circuit based on a 2-qubit named register yielded a 4-qubit operator instead of a 2-qubit operator.
ta_in: "QuantumCircuit.compose" ஐ ப் பயன்படுத்தும் "QuantumCircuit.combine" இன் "கம்போஸ்" முறை "QuantumCircuit.compose" ஐ பயன்படுத்த மாற்றப்பட்டுள்ளது. கம்பைன் பயன்படுத்துவது ஒரு ஆப்பரேட்டரை ஒரு பெயரிடப்பட்ட பதிவேட்டின் அடிப்படையில் ஒரு "CircuitOp" உடன் இணைப்பது ஆபரேட்டர்களை சங்கிலியால் பிணைக்கமுடியாது, ஆனால் அவற்றை அடுக்கும் சிக்கல் ஏற்படுகிறது. எ.கா. "Z ^ 2" ஐ 2-qbit என்ற பெயரில் உள்ள ஒரு சுற்றுடன் சேர்த்து, 2-qubit செயற்குறிக்கு பதிலாக 4-qubit செயற்குறியை தருகிறது.

source: The ``MatrixOp.to_instruction`` method previously returned an operator and not an instruction. This method has been updated to return an Instruction. Note that this only works if the operator primitive is unitary, otherwise an error is raised upon the construction of the instruction.
ta_in: ``MatrixOp.to_instruction`` முறை முன்பு ஒரு ஆபரேட்டரைத் திருப்பி அளித்தது, அறிவுறுத்தலாக அல்ல. ஒரு வழிமுறையை வழங்க இந்த முறை புதுப்பிக்கப்பட்டுள்ளது. ஆபரேட்டர் பழமையானது ஒற்றுமையாக இருந்தால் மட்டுமே இது செயல்படும் என்பதை நினைவில் கொள்க, இல்லையெனில் அறிவுறுத்தலின் கட்டுமானத்தில் பிழை எழுப்பப்படுகிறது.

source: The ``__hash__`` method of the ``PauliOp`` class used the ``id()`` method which prevents set comparisons to work as expected since they rely on hash tables and identical objects used to not have identical hashes. Now, the implementation uses a hash of the string representation inline with the implementation in the ``Pauli`` class.
ta_in: `` __hash__`` வகுப்பின் ``PauliOp`' '` முறை ``id()`` முறையைப் பயன்படுத்தியது, இது ஹாஷ் அட்டவணைகள் மற்றும் ஒரே மாதிரியான ஹாஷ்கள் இல்லாத ஒத்த பொருள்களை நம்பியிருப்பதால் செட் ஒப்பீடுகள் எதிர்பார்த்தபடி செயல்படத் தடுக்கிறது. இப்போது, ​​அமலாக்கம் ``Pauli`` வகுப்பில் செயல்படுத்தலுடன் சரம் பிரதிநிதித்துவ இன்லைனின் ஹாஷைப் பயன்படுத்துகிறது.

source: The ``circuit_to_gate`` and ``circuit_to_instruction`` converters had previously automatically included the generated gate or instruction in the active ``SessionEquivalenceLibrary``. These converters now accept an optional ``equivalence_library`` keyword argument to specify if and where the converted instances should be registered. The default behavior is not to register the converted instance.
ta_in: ``circuit_to_gate `` மற்றும் ``circuit_to_instruction `` மாற்றிகள் முன்பு தானாகவே உருவாக்கப்பட்ட கேட் அல்லது அறிவுறுத்தலை செயலில் உள்ள `` SessionEquivalenceLibrary`` இல் சேர்த்துள்ளன. மாற்றப்பட்ட நிகழ்வுகள் எங்கே, எங்கு பதிவு செய்யப்பட வேண்டும் என்பதைக் குறிப்பிட இந்த மாற்றிகள் இப்போது விருப்பமான `` equivalence_library`` முக்கிய வாதத்தை ஏற்றுக்கொள்கின்றன. இயல்புநிலை நடத்தை மாற்றப்பட்ட நிகழ்வை பதிவு செய்யக்கூடாது.

source: Implementations of the multi-controlled X Gate (``MCXGrayCode``, ``MCXRecursive`` and ``MCXVChain``) have had their ``name`` properties changed to more accurately describe their implementation (``mcx_gray``, ``mcx_recursive``, and ``mcx_vchain`` respectively.) Previously, these gates shared the name ``mcx` with ``MCXGate``, which caused these gates to be incorrectly transpiled and simulated.
ta_in: பல கட்டுப்பாட்டு எக்ஸ் கேட் ("MCXGrayCode", "MCXRecursive" மற்றும் "MCXVChain") செயல்படுத்தல்கள் அவற்றின் "பெயர்" பண்புகளை அவற்றின் செயல்படுத்தல் விவரிக்க இன்னும் துல்லியமாக விவரிக்க மாற்றப்பட்டது ("mcx_gray", "mcx_recursive", மற்றும் "mcx_vchain" முறையே.) முன்னதாக, இந்த வாயில்கள் "MCXGate" உடன் "MCX" என்ற பெயரைப் பகிர்ந்து கொண்டனர், இது இந்த கேட்கள் தவறாக டிரான்ஸ்பைல் செய்யப்பட்டு உருவகப்படுத்தப்பட்டன.
