Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: The ``union`` method of :py:class:`~qiskit.pulse.Schedule` and :py:class:`~qiskit.pulse.Instruction` have been deprecated since the 0.12.0 release and have now been removed. Use :meth:`qiskit.pulse.Schedule.insert` and :meth:`qiskit.pulse.Instruction.meth` methods instead with the kwarg``time=0``.
ta_in: ` ` ஒன்றியம் `: பி: வகுப்பு: ` ` qiskit.pulse.Schedule ` and :py:class: `~ qiskit.pulse.Instruction ` 0.12.0 விடுதலை செய்யப்பட்டு இப்போது நீக்கப்பட்டு வருகின்றது. :meth:` qiskit.pulse.Schedule.Schedule.insert ` மற்றும் :meth:` qiskit.pulse.Instruction.meth ` முறைகள் பதிலாக kwarg ` ` time=0 `.

source: The deprecated ``scaling`` argument to the ``draw`` method of :py:class:`~qiskit.pulse.Schedule` and :py:class:`~qiskit.pulse.Instruction` has been replaced with ``scale`` since the 0.12.0 release and now has been removed. Use the ``scale`` kwarg instead.
ta_in: பை: வகுப்பு: `~ qiskit.pulse.Schedule` மற்றும்: py: class:` ~ qiskit.pulse.Instruction` இன் `` வரைய`` முறைக்கு நீக்கப்பட்ட `` அளவிடுதல்`` வாதம் `` உடன் மாற்றப்பட்டுள்ளது. 0.12.0 வெளியீட்டிலிருந்து அளவுகோல் `` இப்போது அகற்றப்பட்டது. அதற்கு பதிலாக `` அளவு`` குவார்க்கைப் பயன்படுத்தவும்.

source: The deprecated ``period`` argument to :py:mod:`qiskit.pulse.library` functions have been replaced by ``freq`` since the 0.13.0 release and now removed. Use the ``freq`` kwarg instead of ``period``.
ta_in: பை: வகுப்பு: `~ qiskit.pulse.Schedule` மற்றும்: py: class:` ~ qiskit.pulse.Instruction` இன் `` வரைய`` முறைக்கு நீக்கப்பட்ட `` அளவிடுதல்`` வாதம் `` உடன் மாற்றப்பட்டுள்ளது. 0.13.0 வெளியீட்டிலிருந்து அளவுகோல் `` இப்போது அகற்றப்பட்டது. அதற்கு பதிலாக `` அளவு`` குவார்க்கைப் பயன்படுத்தவும்.

source: The ``qiskit.pulse.commands`` module containing ``Commands`` classes was deprecated in the 0.13.0 release and has now been removed. You will have to upgrade your Pulse code if you were still using commands. For example:
ta_in: `` கட்டளைகள்`` வகுப்புகள் அடங்கிய `` qiskit.pulse.commands`` தொகுதி 0.13.0 வெளியீட்டில் நீக்கப்பட்டது, இப்போது அகற்றப்பட்டது. நீங்கள் இன்னும் கட்டளைகளைப் பயன்படுத்துகிறீர்கள் என்றால் உங்கள் துடிப்பு குறியீட்டை மேம்படுத்த வேண்டும். உதாரணத்திற்கு:

source: ``Command(args)(channel)``
ta_in: `` கட்டளை (ஆர்க்ஸ்) (சேனல்) ``

source: ``Instruction(args, channel)``
ta_in: " அறிவுறுத்தல் (ஆர்க்ஸ், சேனல்) ``

source: All classes and function in the ``qiskit.tool.qi`` module were deprecated in the 0.12.0 release and have now been removed. Instead use the :mod:`qiskit.quantum_info` module and the new methods and classes that it has for working with quantum states and operators.
ta_in: எல்லா வகுப்பு மற்றும் செயல்கூறு ` க்குள் qiskit.tool.qi ` ` கூறு 0.12.0 வெளியீட்டில் துண்டிக்கப்பட்டு இப்போது நீக்கப்பட்டு வருகின்றது. பதிலாக :mod:` qiskit.quiskit.quiskit.quantum_info ` ல் மற்றும் புதிய முறைகள் மற்றும் வகுப்புகளைப் பயன்படுத்தி அது குவாண்ட் மாநிலங்கள் மற்றும் இயக்குநர்களுடன் பணிபுரிகின்றது.

source: The ``qiskit.quantum_info.basis_state`` and ``qiskit.quantum_info.projector`` functions are deprecated as of Qiskit Terra 0.12.0 as are now removed. Use the :class:`qiskit.quantum_info.QuantumState` and its derivatives :class:`qiskit.quantum_info.Statevector` and :class:`qiskit.quantum_info.DensityMatrix` to work with states.
ta_in: `` Qiskit.quantum_info.basis_state`` மற்றும் `` qiskit.quantum_info.projector`` செயல்பாடுகள் கிஸ்கிட் டெர்ரா 0.12.0 இன் படி நீக்கப்பட்டன. மாநிலங்களுடன் இணைந்து பணியாற்ற: class: `qiskit.quantum_info.QuantumState` மற்றும் அதன் வழித்தோன்றல்கள்: வர்க்கம்:` qiskit.quantum_info.Statevector` மற்றும்: வகுப்பு: `qiskit.quantum_info.DensityMatrix` ஐப் பயன்படுத்தவும்.

source: The interactive plotting functions from :mod:`qiskit.visualization`, ``iplot_bloch_multivector``, ``iplot_state_city``, ``iplot_state_qsphere``, ``iplot_state_hinton``, ``iplot_histogram``, ``iplot_state_paulivec`` now are just deprecated aliases for the matplotlib based equivalents and are no longer interactive. The hosted static JS code that these functions relied on has been removed and they no longer could work. A normal deprecation wasn't possible because the site they depended on no longer exists.
ta_in: இதிலிருந்து ஊடாடும் சதி செயல்பாடுகள்: மோட்: `qiskit.visualization`,` `iplot_bloch_multivector``,` `iplot_state_city``,` `iplot_state_qsphere``,` `iplot_state_hinton``,` `iplot_histogram``,` `iplot_histolog_` மேட்லோட்லிப் அடிப்படையிலான சமமானவர்களுக்கு நீக்கப்பட்ட மாற்றுப்பெயர்கள் மற்றும் இனி ஊடாடும். இந்த செயல்பாடுகளை நம்பியிருந்த ஹோஸ்ட் செய்யப்பட்ட நிலையான JS குறியீடு அகற்றப்பட்டது, மேலும் அவை இனி இயங்காது. ஒரு சாதாரண தேய்மானம் சாத்தியமில்லை, ஏனெனில் அவர்கள் நம்பியிருந்த தளம் இனி இல்லை.

source: The validation components using marshmallow from :mod:`qiskit.validation` have been removed from terra. Since they are no longer used to build any objects in terra.
ta_in: மார்ஷ்மெல்லோவைப் பயன்படுத்தி சரிபார்ப்பு கூறுகள்: mod: `qiskit.validation` டெர்ராவிலிருந்து அகற்றப்பட்டுள்ளன. டெர்ராவில் எந்தவொரு பொருளையும் உருவாக்க அவை இனி பயன்படுத்தப்படுவதில்லை என்பதால்.

source: The marshmallow schema classes in :mod:`qiskit.result` have been removed since they are no longer used by the :class:`qiskit.result.Result` class.
ta_in: : Mod: `qiskit.result` இல் உள்ள மார்ஷ்மெல்லோ ஸ்கீமா வகுப்புகள் நீக்கப்பட்டன, ஏனெனில் அவை இனி: class:` qiskit.result.Result` வகுப்பால் பயன்படுத்தப்படாது.

source: The output of the :meth:`~qiskit.result.Result.to_dict` method for the :class:`qiskit.result.Result` class is no longer in a format for direct JSON serialization. Depending on the content contained in instances of these classes there may be types that the default JSON encoder doesn't know how to handle, for example complex numbers or numpy arrays. If you're JSON serializing the output of the ``to_dict()`` method directly you should ensure that your JSON encoder can handle these types.
ta_in: வகுப்பு: `qiskit.result.Result` வகுப்பிற்கான: மெத்:` ~ qiskit.result.Result.to_dict` முறையின் வெளியீடு இனி நேரடி JSON சீரியலைசேஷனுக்கான வடிவமைப்பில் இல்லை. இந்த வகுப்புகளின் நிகழ்வுகளில் உள்ள உள்ளடக்கத்தைப் பொறுத்து இயல்புநிலை JSON குறியாக்கிக்கு எவ்வாறு கையாள்வது என்று தெரியாத வகைகள் இருக்கலாம், எடுத்துக்காட்டாக சிக்கலான எண்கள் அல்லது எண்ணற்ற வரிசைகள். `` To_dict () `` முறையின் வெளியீட்டை நீங்கள் JSON தொடர்ச்சியாக வரிசைப்படுத்துகிறீர்கள் என்றால், உங்கள் JSON குறியாக்கி இந்த வகைகளைக் கையாள முடியும் என்பதை உறுதிப்படுத்த வேண்டும்.

source: The option to acquire multiple qubits at once was deprecated in the 0.12.0 release and is now removed. Specifically, the init args ``mem_slots`` and ``reg_slots`` have been removed from :class:`qiskit.pulse.instructions.Acquire`, and ``channel``, ``mem_slot`` and ``reg_slot`` will raise an error if a list is provided as input.
ta_in: ஒரே நேரத்தில் பல குவிட்களைப் பெறுவதற்கான விருப்பம் 0.12.0 வெளியீட்டில் நீக்கப்பட்டது, இப்போது அகற்றப்பட்டது. குறிப்பாக, init `` mem_slots`` மற்றும் `` reg_slots`` ஆகியவை வகுப்பிலிருந்து நீக்கப்பட்டன: `qiskit.pulse.instructions.Acquire`, மற்றும்` `சேனல்``,` `mem_slot`` மற்றும்` `reg_slot` ஒரு பட்டியல் உள்ளீடாக வழங்கப்பட்டால் `பிழை எழுப்புகிறது.

source: Support for the use of the ``USE_RETWORKX`` environment variable which was introduced in the 0.13.0 release to provide an optional fallback to the legacy `networkx <https://networkx.github.io/>`__ based :class:`qiskit.dagcircuit.DAGCircuit` implementation has been removed. This flag was only intended as provide a relief valve for any users that encountered a problem with the new implementation for one release during the transition to retworkx.
ta_in: மரபு `நெட்வொர்க் <https://networkx.github.io/>` __ அடிப்படையிலான: வர்க்கம்: மரபுக்கு விருப்பமான குறைவை வழங்க 0.13.0 வெளியீட்டில் அறிமுகப்படுத்தப்பட்ட `` USE_RETWORKX`` சூழல் மாறியைப் பயன்படுத்துவதற்கான ஆதரவு. `qiskit.dagcircuit.DAGCircuit` செயல்படுத்தல் நீக்கப்பட்டது. ரீட்வொர்க்ஸுக்கு மாற்றும்போது ஒரு வெளியீட்டிற்கான புதிய செயல்படுத்தலில் சிக்கலை எதிர்கொண்ட எந்தவொரு பயனருக்கும் நிவாரண வால்வை வழங்குவதற்காக மட்டுமே இந்த கொடி கருதப்பட்டது.

source: The module within :mod:`qiskit.pulse` responsible for schedule->schedule transformations has been renamed from ``reschedule.py`` to ``transforms.py``. The previous import path has been deprecated. To upgrade your code::
ta_in: உள்ள தொகுதி: mod: `qiskit.pulse` அட்டவணை-> அட்டவணை மாற்றங்களுக்கு பொறுப்பானது` `reschedule.py`` இலிருந்து` `உருமாற்றங்கள்.பீ`` என மறுபெயரிடப்பட்டது. முந்தைய இறக்குமதி பாதை நீக்கப்பட்டது. உங்கள் குறியீட்டை மேம்படுத்த ::

source: should be replaced by::
ta_in: இதை மாற்ற வேண்டும்::

source: In previous releases a :class:`~qiskit.transpiler.PassManager` did not allow ``TransformationPass`` classes to modify the :class:`~qiskit.transpiler.PropertySet`. This restriction has been lifted so a ``TransformationPass`` class now has read and write access to both the :class:`~qiskit.transpiler.PropertySet` and :class:`~qiskit.transpiler.DAGCircuit` during :meth:`~qiskit.transpiler.PassManager.run`. This change was made to more efficiently facilitate ``TransformationPass`` classes that have an internal state which may be necessary for later passes in the :class:`~qiskit.transpiler.PassManager`. Without this change a second redundant ``AnalysisPass`` would have been necessary to recreate the internal state, which could add significant overhead.
ta_in: முந்தைய வெளியீடுகளில் ஒரு: வகுப்பு: `~ qiskit.transpiler.PassManager`` `டிரான்ஸ்ஃபர்மேஷன் பாஸ்`` வகுப்புகளை மாற்றியமைக்க அனுமதிக்கவில்லை: வர்க்கம்:` ~ qiskit.transpiler.PropertySet`. இந்த கட்டுப்பாடு நீக்கப்பட்டது, எனவே ஒரு `` டிரான்ஸ்ஃபர்மேஷன் பாஸ்`` வகுப்பு இப்போது வகுப்பு: `~ qiskit.transpiler.PropertySet` மற்றும்: வகுப்பு:` ~ qiskit.transpiler.DAGCircuit` இன் போது: மெத்: ` ~ qiskit.transpiler.PassManager.run`. வகுப்பு: `~ qiskit.transpiler.PassManager` இல் பின்னர் தேர்ச்சி பெற வேண்டிய உள் நிலையைக் கொண்ட` `டிரான்ஸ்ஃபர்மேஷன் பாஸ்`` வகுப்புகளை மிகவும் திறமையாக எளிதாக்குவதற்காக இந்த மாற்றம் செய்யப்பட்டது. இந்த மாற்றம் இல்லாமல் இரண்டாவது தேவையற்ற `` அனாலிசிஸ் பாஸ்`` உள் நிலையை மீண்டும் உருவாக்க அவசியமாக இருந்திருக்கும், இது குறிப்பிடத்தக்க மேல்நிலைகளை சேர்க்கக்கூடும்.

source: The name of the first positional parameter for the :mod:`qiskit.visualization` functions :func:`~qiskit.visualization.plot_state_hinton`, :func:`~qiskit.visualization.plot_bloch_multivector`, :func:`~qiskit.visualization.plot_state_city`, :func:`~qiskit.visualization.plot_state_paulivec`, and :func:`~qiskit.visualization.plot_state_qsphere` has been renamed from ``rho`` to ``state``. Passing in the value by name to ``rho`` is deprecated and will be removed in a future release. Instead you should either pass the argument positionally or use the new parameter name ``state``.
ta_in: : Mod: `qiskit.visualization` செயல்பாடுகளுக்கான முதல் நிலை அளவுருவின் பெயர்: func:` ~ qiskit.visualization.plot_state_hinton` ,: func: `~ qiskit.visualization.plot_bloch_multivector` ,: func:` q qiskit.visualization .plot_state_city` ,: func: `~ qiskit.visualization.plot_state_paulivec`, மற்றும்: func:` ~ qiskit.visualization.plot_state_qsphere` `` rho`` இலிருந்து `` state`` என மறுபெயரிடப்பட்டுள்ளது. `` ரோ`` என்ற பெயரில் மதிப்பைக் கடந்து செல்வது நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக நீங்கள் வாதத்தை நிலைநிறுத்த வேண்டும் அல்லது புதிய அளவுரு பெயரை `` மாநிலம்`` பயன்படுத்த வேண்டும்.

source: The ``qiskit.pulse.pulse_lib`` module has been deprecated and will be removed in a future release. It has been renamed to :py:mod:`qiskit.pulse.library` which should be used instead.
ta_in: `` Qiskit.pulse.pulse_lib`` தொகுதி நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். இதற்கு மறுபெயரிடப்பட்டுள்ளது: py: mod: `qiskit.pulse.library`, அதற்கு பதிலாக பயன்படுத்தப்பட வேண்டும்.

source: The :class:`qiskit.circuit.QuantumCircuit` method :meth:`~qiskit.circuit.QuantumCircuit.mirror` has been deprecated and will be removed in a future release. The method :meth:`qiskit.circuit.QuantumCircuit.reverse_ops` should be used instead, since mirroring could be confused with swapping the output qubits of the circuit. The :meth:`~qiskit.circuit.QuantumCircuit.reverse_ops` method only reverses the order of gates that are applied instead of mirroring.
ta_in: வகுப்பு: `qiskit.circuit.QuantumCircuit` முறை: மெத்:` ~ qiskit.circuit.QuantumCircuit.mirror` நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். முறை: மெத்: `qiskit.circuit.QuantumCircuit.reverse_ops` அதற்கு பதிலாக பயன்படுத்தப்பட வேண்டும், ஏனெனில் பிரதிபலிப்பு சுற்றுக்கான வெளியீட்டு வினாடிகளை மாற்றுவதில் குழப்பமடையக்கூடும். தி: மெத்: `~ qiskit.circuit.QuantumCircuit.reverse_ops` முறை பிரதிபலிப்புக்கு பதிலாக பயன்படுத்தப்படும் வாயில்களின் வரிசையை மட்டுமே மாற்றுகிறது.

source: The :meth:`~qiskit.dagcircuit.DAGCircuit.qubits` and :meth:`~qiskit.dagcircuit.DAGCircuit.clbits` methods of :class:`qiskit.dagcircuit.DAGCircuit` have been deprecated and will be removed in a future release. They have been replaced with properties of the same name, :attr:`qiskit.dagcircuit.DAGCircuit.qubits` and :attr:`qiskit.dagcircuit.DAGCircuit.clbits`, and are cached so accessing them is much faster.
ta_in: தி: மெத்: `~ qiskit.dagcircuit.DAGCircuit.qubits` மற்றும்: மெத்:` ~ qiskit.dagcircuit.DAGCircuit.clbits` இன் முறைகள்: வகுப்பு: `qiskit.dagcircuit.DAGCircuit` நீக்கப்பட்டன மற்றும் எதிர்காலத்தில் அகற்றப்படும் வெளியீடு. அவை அதே பெயரின் பண்புகளுடன் மாற்றப்பட்டுள்ளன ,: attr: `qiskit.dagcircuit.DAGCircuit.qubits` மற்றும்: attr:` qiskit.dagcircuit.DAGCircuit.clbits`, மற்றும் தற்காலிக சேமிப்பில் உள்ளன, எனவே அவற்றை அணுகுவது மிக விரைவானது.

source: The ``get_sample_pulse`` method for ``qiskit.pulse.library.ParametricPulse`` derived classes (for example :class:`~qiskit.pulse.library.GaussianSquare`) has been deprecated and will be removed in a future release. It has been replaced by the ``get_waveform`` method (for example :meth:`~qiskit.pulse.library.GaussianSquare.get_waveform`) which should behave identically.
ta_in: `` Qiskit.pulse.library.ParametricPulse`` பெறப்பட்ட வகுப்புகளுக்கான `` get_sample_pulse`` முறை (எடுத்துக்காட்டாக: வர்க்கம்: `~ qiskit.pulse.library.GaussianSquare`) நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். இது `` get_waveform`` முறையால் மாற்றப்பட்டுள்ளது (எடுத்துக்காட்டாக: மெத்: `~ qiskit.pulse.library.GaussianSquare.get_waveform`) இது ஒரே மாதிரியாக நடந்து கொள்ள வேண்டும்.

source: The use of the optional ``condition`` argument on :class:`qiskit.dagcircuit.DAGNode`, :meth:`qiskit.dagcircuit.DAGCircuit.apply_operation_back`, and :meth:`qiskit.dagcircuit.DAGCircuit.apply_operation_front` has been deprecated and will be removed in a future release. Instead the ``control`` set in :class:`qiskit.circuit.Instruction` instances being added to a :class:`~qiskit.dagcircuit.DAGCircuit` should be used.
ta_in: விருப்பமான `` நிபந்தனை`` வாதத்தின் பயன்பாடு: வகுப்பு: `qiskit.dagcircuit.DAGNode` ,: மெத்:` qiskit.dagcircuit.DAGCircuit.apply_operation_back`, மற்றும்: meth: `qiskit.dagcircuit.DAGCircuit.apply_operation_front` has நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக அமைக்கப்பட்ட `` கட்டுப்பாடு``: வகுப்பு: `qiskit.circuit.Instruction` நிகழ்வுகள் ஒரு: வகுப்பில் சேர்க்கப்படுகின்றன:` ~ qiskit.dagcircuit.DAGCircuit` பயன்படுத்தப்பட வேண்டும்.

source: The ``set_atol`` and ``set_rtol`` class methods of the :class:`qiskit.quantum_info.BaseOperator` and :class:`qiskit.quantum_info.QuantumState` classes (and their subclasses such as :class:`~qiskit.quantum_info.Operator` and :class:`qiskit.quantum_info.DensityMatrix`) are deprecated and will be removed in a future release. Instead the value for the attributes ``.atol`` and ``.rtol`` should be set on the class instead. For example::
ta_in: வர்க்கத்தின் `` set_atol`` மற்றும் `` set_rtol`` வகுப்பு முறைகள்: `qiskit.quantum_info.BaseOperator` மற்றும்: class:` qiskit.quantum_info.QuantumState` வகுப்புகள் (மற்றும் அவற்றின் துணைப்பிரிவுகளான: class: `q qiskit .quantum_info.Operator` மற்றும்: class: `qiskit.quantum_info.DensityMatrix`) நீக்கப்பட்டன, அவை எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக `` .atol`` மற்றும் `` .rtol`` பண்புகளுக்கான மதிப்பு வகுப்பில் அமைக்கப்பட வேண்டும். உதாரணத்திற்கு::

source: The interactive plotting functions from :mod:`qiskit.visualization`, ``iplot_bloch_multivector``, ``iplot_state_city``, ``iplot_state_qsphere``, ``iplot_state_hinton``, ``iplot_histogram``, ``iplot_state_paulivec`` have been deprecated and will be removed in a future release. The matplotlib based equivalent functions from :mod:`qiskit.visualization`, :func:`~qiskit.visualization.plot_bloch_multivector`, :func:`~qiskit.visualization.plot_state_city`, :func:`~qiskit.visualization.plot_state_qsphere`, :func:`~qiskit.visualization.plot_state_hinton`, :func:`~qiskit.visualization.plot_state_histogram`, and :func:`~qiskit.visualization.plot_state_paulivec` should be used instead.
ta_in: இதிலிருந்து ஊடாடும் செயல்பாடுகள்: மோட்: `qiskit.visualization`,` `iplot_bloch_multivector``,` `iplot_state_city``,` `iplot_state_qsphere``,` `iplot_state_hinton``,` `iplot_histogram``,` `iplot_histolog_` நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். மேட்லோட்லிப் அடிப்படையிலான சமமான செயல்பாடுகள்: mod: `qiskit.visualization` ,: func:` ~ qiskit.visualization.plot_bloch_multivector` ,: func: `~ qiskit.visualization.plot_state_city` ,: func:` ~ qiskit.visualization.splot_state_spate_state அதற்கு பதிலாக பயன்படுத்தப்பட வேண்டும்.

source: The properties ``acquires``, ``mem_slots``, and ``reg_slots`` of the :class:`qiskit.pulse.instructions.Acquire` pulse instruction have been deprecated and will be removed in a future release. They are just duplicates of :attr:`~qiskit.pulse.instructions.Acquire.channel`, :attr:`~qiskit.pulse.instructions.Acquire.mem_slot`, and :attr:`~qiskit.pulse.instructions.Acquire.reg_slot` respectively now that previously deprecated support for using multiple qubits in a single :class:`~qiskit.pulse.instructions.Acquire` instruction has been removed.
ta_in: வகுப்பின் `` பெறுகிறது``, `` மெம்_ஸ்லாட்டுகள்``, மற்றும் `` ரெக்_ஸ்லாட்டுகள்`` ஆகிய பண்புகள்: `qiskit.pulse.instructions.Aququ`` துடிப்பு அறிவுறுத்தல் நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். அவை வெறும் நகல்கள்: attr: `~ qiskit.pulse.instructions.Acquire.channel` ,: attr:` ~ qiskit.pulse.instructions.Acquire.mem_slot`, மற்றும்: attr: `~ qiskit.pulse.instructions.Acquire .reg_slot` முறையே இப்போது ஒற்றை: வகுப்பில் பல குவிட்களைப் பயன்படுத்துவதற்கான ஆதரவை நீக்கியது: `~ qiskit.pulse.instructions.Acquire` அறிவுறுத்தல் நீக்கப்பட்டது.

source: The ``SamplePulse`` class from :mod:`qiskit.pulse` has been renamed to :py:class:`~qiskit.pulse.library.Waveform`. ``SamplePulse`` is deprecated and will be removed in a future release.
ta_in: இதிலிருந்து `` மாதிரி துடிப்பு`` வகுப்பு: மோட்: `qiskit.pulse` என மறுபெயரிடப்பட்டது: py: class:` ~ qiskit.pulse.library.Waveform`. `` மாதிரி துடிப்பு`` நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும்.

source: The style dictionary key ``cregbundle`` has been deprecated and will be removed in a future release. This has been replaced by the kwarg ``cregbundle`` added to the :func:`qiskit.visualization.circuit_drawer` function and the :class:`~qiskit.circuit.QuantumCircuit` method :meth:`~qiskit.circuit.QuantumCircuit.draw`.
ta_in: பாணி அகராதி விசை `` க்ரெக்பண்டில்`` நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். இதை மாற்றியமைத்த குவார்க் `` கிரெக்பண்டில்``: func: `qiskit.visualization.circuit_drawer` செயல்பாடு மற்றும்: வர்க்கம்:` ~ qiskit.circuit.QuantumCircuit` முறை: மெத்: `~ qiskit.circuit.QuantumCircuit . இழுக்க`.

source: The :class:`qiskit.circuit.QuantumCircuit` method :attr:`~qiskit.circuit.QuantumCircuit.num_nonlocal_gates` previously included multi-qubit :class:`qiskit.circuit.Instruction` objects (for example, :class:`~qiskit.circuit.library.Barrier`) in its count of non-local gates. This has been corrected so that only non-local :class:`~qiskit.circuit.Gate` objects are counted. Fixes `#4500 <https://github.com/Qiskit/qiskit-terra/issues/4500>`__
ta_in: வகுப்பு: `qiskit.circuit.QuantumCircuit` முறை: attr:` ~ qiskit.circuit.QuantumCircuit.num_nonlocal_gates` முன்பு பல-குவிட்: வகுப்பு: `qiskit.circuit.Instruction` பொருள்கள் (எடுத்துக்காட்டாக, வகுப்பு:` ~ qiskit.circuit.library.Barrier`) அதன் உள்ளூர் அல்லாத வாயில்களின் எண்ணிக்கையில். இது சரி செய்யப்பட்டது, எனவே உள்ளூர் அல்லாதவை: வர்க்கம்: `~ qiskit.circuit.Gate` பொருள்கள் கணக்கிடப்படுகின்றன. `# 4500 <https://github.com/Qiskit/qiskit-terra/issues/4500>` __

source: :class:`~qiskit.circuit.ControlledGate` instances with a set ``ctrl_state`` were in some cases not being evaluated as equal, even if the compared gates were equivalent. This has been resolved so that Fixes `#4573 <https://github.com/Qiskit/qiskit-terra/issues/4573>`__
ta_in: : class: `~ qiskit.circuit.ControlledGate` நிகழ்வுகள்` `ctrl_state`` ஒரு தொகுப்பைக் கொண்டு சில சந்தர்ப்பங்களில் ஒப்பிடப்பட்ட வாயில்கள் சமமாக இருந்தாலும் கூட சமமாக மதிப்பிடப்படவில்லை. `# 4573 <https://github.com/Qiskit/qiskit-terra/issues/4573>` __

source: When accessing a bit from a :class:`qiskit.circuit.QuantumRegister` or :class:`qiskit.circuit.ClassicalRegister` by index when using numpy `integer types` <https://numpy.org/doc/stable/user/basics.types.html>`__ would previously raise a ``CircuitError`` exception. This has been resolved so numpy types can be used in addition to Python's built-in ``int`` type. Fixes `#3929 <https://github.com/Qiskit/qiskit-terra/issues/3929>`__.
ta_in: ஒரு: வகுப்பிலிருந்து ஒரு பிட்டை அணுகும்போது: `qiskit.circuit.QuantumRegister` அல்லது: class:` qiskit.circuit.ClassicalRegister` ஐ குறியீட்டால் `எண்ணற்ற` முழு வகைகள்` <https://numpy.org/doc/stable/user /basics.types.html>`__ முன்பு ஒரு `` சர்க்யூட் பிழை`` விதிவிலக்கை உயர்த்தும். இது தீர்க்கப்பட்டுள்ளது, எனவே பைத்தானின் உள்ளமைக்கப்பட்ட `` int`` வகைக்கு கூடுதலாக எண்ணற்ற வகைகளையும் பயன்படுத்தலாம். `# 3929 <https://github.com/Qiskit/qiskit-terra/issues/3929>` __ திருத்தங்கள்.

source: A bug was fixed where only the first :class:`qiskit.pulse.configuration.Kernel` or :class:`qiskit.pulse.configuration.Discriminator` for an :class:`qiskit.pulse.Acquire` was used when there were multiple Acquires at the same time in a :class:`qiskit.pulse.Schedule`.
ta_in: ஒரு பிழை சரி செய்யப்பட்டது: முதல்: வகுப்பு: `qiskit.pulse.configuration.Kernel` அல்லது: class:` qiskit.pulse.configuration.Discriminator` ஒரு: வகுப்பிற்கு: `qiskit.pulse.Acquire` இருந்தபோது பயன்படுத்தப்பட்டது ஒரு: வகுப்பில் ஒரே நேரத்தில் பல பெறுகிறது: `qiskit.pulse.Schedule`.

source: The SI unit use for constructing :py:class:`qiskit.pulse.SetFrequency` objects is in Hz, but when a :class:`~qiskit.qobj.PulseQobjInstruction` object is created from a :py:class:`~qiskit.pulse.SetFrequency` instance it needs to be converted to GHz. This conversion was missing from previous releases and has been fixed.
ta_in: கட்டமைக்க SI அலகு பயன்பாடு: py: class: `qiskit.pulse.SetFrequency` பொருள்கள் Hz இல் உள்ளன, ஆனால் ஒரு: class:` ~ qiskit.qobj.PulseQobjInstruction` பொருள் ஒரு: py: class: `~ qiskit .pulse.SetFrequency` உதாரணமாக இது GHz ஆக மாற்றப்பட வேண்டும். இந்த மாற்றம் முந்தைய வெளியீடுகளில் இல்லை, சரி செய்யப்பட்டது.
