Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: Release Notes
ta_in: வெளியீட்டு அறிக்கை

source: Version History
ta_in: பதிப்பு வரலாறு

source: This table tracks the meta-package versions and the version of each Qiskit element installed:
ta_in: இந்த அட்டவணை மெட்டா-தொகுப்பு பதிப்புகள் மற்றும் ஒவ்வொரு Qiskit உறுப்பின் பதிப்பு நிறுவப்பட்டது:

source: **Version History**
ta_in: பதிப்பு வரலாறு

source: For the ``0.7.0``, ``0.7.1``, and ``0.7.2`` meta-package releases the :ref:`versioning_strategy` policy was not formalized yet.
ta_in: ` ` 0.7.0 ` `, ` ` 0.7.1 ` `, மற்றும் ` 0.7.2 ` ` மெட்டா தொகுப்பு வெளியீடுகள் :ref:`பதிப்பு உத்தி` கொள்கை இன்னும் முறைப்படுத்தப்படவில்லை.

source: Notable Changes
ta_in: குறிப்பிடத்தக்க மாற்றங்கள்

source: Prelude
ta_in: முன்னுரை

source: Bug Fixes
ta_in: பிழை திருத்தங்கள்

source: No change
ta_in: எந்த மாற்றங்களும் இல்லை

source: Aqua 0.9.1
ta_in: அக்வா 0.9.1

source: New Features
ta_in: புதிய அம்சங்கள்

source: Upgrade Notes
ta_in: குறிப்புகளை மேம்படுத்தவும் #: ../../release_notes .rs t :54 ../../release_not e s.r s t:240 #: ../../release_no t es. r st:480 ../../release_no tes . rst:710 #: ../../release_ n ot es .rst:879 ../../release _ no te s.rst:1491 #: ../../releas e _n ot es.rst:1915 ../../relea s e_ no tes.rst:2172 #: ../../rele a se _n otes.rst:2552 ../../rel e as e_ notes.rst:2694 #: ../../re l ea se _notes.rst:2767 ../../r e le as e_notes.rst:3507 #: ../../ r el ea se_notes.rst:4156 ../.. / re le ase_notes.rst:4273 #: ../. . /r el ease_notes.rst:4552 .. /. . /re lease_notes.rst:4634 #: ../ ../r elease_notes.rst:4706 .. /../ release_notes.rst:4755 #: . ./.. /release_notes.rst :481 1 ../. ./release_notes.rst :510 2 #: ../ ../release_notes .rst :539 3 .. /../release_notes. rst: 5443 #: . ./../release_n otes .rst:6 275 ../../release_no tes. rst:749 7 #: ../../relea se_n otes.rst :831 2 ../../release _notes.rst:8 872 #: ../../relea se_notes.rst: 9323 கோப்பு: release_notes.po Kuṟippukaḷa i mēm paṭutt avum #: ../../ Relea se_note s.Rs t:54../../Relea se_no tes.Rs t:24 0 #: ../../ Relea se_note s.Rs t:480../../Rele ase_n otes.R st:7 10 #: ../.. /Rele ase_not es.R st:879../../Rele ase_n otes.R st:1 491 #: ../../Release_not es.R st:1915../../Release_ notes. Rst: 2172 #: ../. ./Re lease_no tes. Rst:2552../../ Rele ase_notes .Rst :2694 #: . ./../ Release_n otes .Rst:2767../.. /Rel ease_note s.Rs t:3507 #: ../.. /Release_ note s.Rst:4156../. ./Re lease_not es.R st:4273 #: ../. ./Release _not es.Rst:4552../ ../R elease_no tes. Rst:4634 # : .. /../Releas e_no tes.Rst:4706. ./.. /Release_n otes .Rst:4755 #: . ./../Relea se_n otes.Rst:4811 ../. ./Release_ note s.Rst:5102 #: ../../Rele ase_ notes.Rst:539 3../ ../Release _not es.Rst:544 3 #: ../../Rel ease _notes.Rst:62 75.. /../Releas e_no tes.Rst:74 97 # : ../../Re leas e_notes.Rst: 8312 ../../Relea se_n otes.Rst: 8872 #: ../../Rel ease_notes.Rst:9323 Kōppu: Release_notes.Po

source: Other Notes
ta_in: பிற குறிப்புகள்

source: Terra 0.17.1
ta_in: டெரா 0.17.1

source: Known Issues
ta_in: தெரிந்த சிக்கல்கள்

source: Aer 0.8.1
ta_in: ஏர் 0.8.1

source: Fixed an issue where the transpiler pass :class:`~qiskit.transpiler.passes.Unroller` didn't preserve global phase in case of nested instructions with one rule in their definition. Fixed `#6134 <https://github.com/Qiskit/qiskit-terra/issues/6134>`__
ta_in: __டிரான்ஸ்பிலர் கடந்து செல்லும் ஒரு சிக்கலை சரிசெய்தது:class:'~qiskit.transpiler.passes.Unroller 'அவற்றின் வரையறையில் ஒரு விதியுடன் காணப்படுகிறது அறிவுறுத்தல்கள் வழக்கில் உலகளாவிய கட்டத்தை பாதுகாக்கவில்லை. நிலையான '#6134 <https://github.com/Qiskit/qiskit-terra/issues/6134>'__

source: Fixed an issue where the :attr:`~qiskit.circuit.ControlledGate.parameter` attribute of a :class:`~qiskit.circuit.ControlledGate` object built from a :class:`~qiskit.extensions.UnitaryGate` was not being set to the unitary matrix of the :class:`~qiskit.extensions.UnitaryGate` object. Previously, :meth:`~qiskit.extensions.UnitaryGate.control` was building a :class:`~qiskit.circuit.ControlledGate` with the ``parameter`` attribute set to the controlled version of :class:`~qiskit.extensions.UnitaryGate` matrix. This would lead to a modification of the ``parameter`` of the base :class:`~qiskit.extensions.UnitaryGate` object and subsequent calls to :meth:`~qiskit.circuit.ControlledGate.inverse` was creating the inverse of a double-controlled :class:`~qiskit.extensions.UnitaryGate`. Fixed `#5750 <https://github.com/Qiskit/qiskit-terra/issues/5750>`__
ta_in: ஒரு :attr:'~qiskit.circuit.ControlledGate.parameter' பண்புக்கூறு :class:'~qiskit.circuit.ControlledGate' பொருள் :class:'~qiskit.extensions.UnitaryGate' என்ற ஒற்றை அணியாக அமைக்கப்படவில்லை:class:'~qiskit.extensions.UnitaryGate' பொருள். முன்னதாக, :meth:'~qiskit.extensions.UnitaryGate.control' ஒரு :class:'~qiskit.circuit.ControlledGate' என்ற ''அளவுரு'' பண்புக்கூறு :class:'~qiskit.extensions.UnitaryGate' மேட்ரிக்ஸ். இது தளத்தின் "அளவுரு"வை மாற்றியமைக்க வழிவகுக்கும்:class:'~qiskit.extensions.UnitaryGate' பொருள் மற்றும் அடுத்தடுத்த அழைப்புகள் :meth:'~qiskit.circuit.ControlledGate.inverse' இரட்டை கட்டுப்படுத்தப்பட்ட :class:'~qiskit.extensions.UnitaryGate'. நிலையான '#5750 <https://github.com/Qiskit/qiskit-terra/issues/5750>'__

source: Fixed an issue with the preset pass managers :class:`~qiskit.transpiler.preset_passmanagers.level_0_pass_manager` and :class:`~qiskit.transpiler.preset_passmanagers.level_1_pass_manager` (which corresponds to ``optimization_level`` 0 and 1 for :func:`~qiskit.compiler.transpile`) where in some cases they would produce circuits not in the requested basis.
ta_in: முன்தொகுப்பு பாஸ் மேலாளர்களுடன் ஒரு சிக்கலை சரிசெய்தது:class:'~qiskit.transpiler.preset_passmanagers.level_0_pass_manager' மற்றும் :class:'~qiskit.transpiler.preset_passmanagers.level_1_pass_manager' (இது ''optimization_level''0 மற்றும் 1 க்கு ஒத்திருக்கிறது :func:'~qiskit.compiler.transpile') அடிப்படைசில சந்தர்ப்பங்களில் அவர்கள் கோரப்பட்ட அடிப்படையில் இல்லாத சுற்றுகளை உருவாக்குவார்கள்.

source: Fix a bug where using :class:`~qiskit.algorithms.optimizers.SPSA` with automatic calibration of the learning rate and perturbation (i.e. ``learning_rate`` and ``perturbation`` are ``None`` in the initializer), stores the calibration for all future optimizations. Instead, the calibration should be done for each new objective function.
ta_in: பயன்படுத்தும் ஒரு பிழையை சரிசெய்யவும் :class:'~qiskit.algorithms.optimizers.SPSA'வை கற்றல் விகிதம் மற்றும் கலக்கத்தின் தானியங்கி அளவுத்திருத்தத்துடன் (அதாவது "learning_rate'' மற்றும் ''கலக்கம்'' ஆகியவை முதலெழுத்துக்களில் ''ஏதுமில்லை'') , அனைத்து எதிர்கால தேர்வுமுறைகளுக்கும் அளவுத்திருத்தத்தை சேமிக்கிறது. மாறாக, ஒவ்வொரு புதிய புறநிலை செயல்பாட்டிற்கும் அளவுத்திருத்தம் செய்யப்பட வேண்டும்.

source: Fixed an issue with use of the ``matrix_product_state`` method of the :class:`~qiskit.providers.aer.AerSimulator` and :class:`~qiskit.providers.aer.QasmSimulator` simulators when running a noisy simulation with Kraus errors. Previously, the matrix product state simulation method would not propogate changes to neighboring qubits after applying the Kraus matrix. This has been fixed so the output from the simulation is correct. Fixed `#1184 <https://github.com/Qiskit/qiskit-aer/issues/1184>`__ and `#1205 <https://github.com/Qiskit/qiskit-aer/issues/1205>`__
ta_in: பயன்பாட்டில் ஒரு சிக்கல் சரி செய்யப்பட்டது ''matrix_product_state'' முறையைப் பயன்படுத்தி ஒரு சிக்கலை சரிநிர்ணயித்தல்செய்தது :class:'~qiskit.providers.aer.AerSimulator' மற்றும் :class:'~qiskit.providers.aer.QasmSimulator' சிமுலேட்டர்கள் க்ராஸ் பிழைகளுடன் ஒரு இரைச்சலான உருவகப்படுத்தலை இயக்கும் போது. முன்பு, மேட்ரிக்ஸ் தயாரிப்பு நிலை உருவகப்படுத்துதல் முறை க்ராஸ் மேட்ரிக்ஸ் விண்ணப்பித்த பிறகு அண்டை க்யூபிட்களில் மாற்றங்களை ப்ரொபோடோகேட் செய்யாது. இது சரி செய்யப்நிர்ணயித்தல்பட்டுள்ளது எனவே உருவகப்படுத்துதலின் இருந்து வெளியீடு சரியானது. நிலையான '#1184 <https://github.com/Qiskit/qiskit-aer/issues/1184>'__ மற்றும் '#1205 <https://github.com/Qiskit/qiskit-aer/issues/1205>'__

source: Fixed an issue where the :class:`qiskit.extensions.Initialize` instruction would disable measurement sampling optimization for the ``statevector`` and ``matrix_product_state`` simulation methods of the :class:`~qiskit.providers.aer.AerSimulator` and :class:`~qiskit.providers.aer.QasmSimulator` simulators, even when it was the first circuit instruction or applied to all qubits and hence deterministic. Fixed `#1210 <https://github.com/Qiskit/qiskit-aer/issues/1210>`__
ta_in: ஒரு சிக்கல் சரி செய்யப்பட்டது :class:'qiskit.extensions.Initialize' அறிவுறுத்தல் ''ஸ்டேட்வெக்டர்'', மற்றும் ''matrix_product_state'' உருவகப்படுத்துதல் முறைகளுக்கான அளவீட்டு மாதிரி தேர்வுமுறையை முடக்கும்:class:'~qiskit.providers.aer.AerSimulator' மற்றும் :class:'~qiskit.providers.aer.QasmSimulator' சிமுலேட்டர்கள், அது முதல் சுற்று அறிவுறுத்தல் அல்லது அனைத்து குபிட்கள் பயன்படுத்தப்படும் போது கூட எனவே தீர்மானகரமான. நிலையான '#1210 <https://github.com/Qiskit/qiskit-aer/issues/1210>'__

source: Fix an issue with the :class:`~qiskit.providers.aer.library.SaveStatevector` and :class:`~qiskit.providers.aer.extensions.SnapshotStatevector` instructions when used with the ``extended_stabilizer`` simulation method of the :class:`~qiskit.providers.aer.AerSimulator` and :class:`~qiskit.providers.aer.QasmSimulator` simulators where it would return an unnormalized statevector. Fixed `#1196 <https://github.com/Qiskit/qiskit-aer/issues/1210>`__
ta_in: ஒரு சிக்கலை :class:'~qiskit.providers.aer.library.SaveStatevector' மற்றும் :class:'~qiskit.providers.aer.extensions.SnapshotStatevector' அறிவுறுத்தல்களுடன் பயன்படுத்தும்போது "extended_stabilizer" உருவகப்படுத்துதல் முறை :class:'~qiskit.providers.aer.AerSimulator' மற்றும் :class:'~qiskit.providers.aer.QasmSimulator' போலி அங்கு அது ஒரு இயல்பாக்கப்படாத மாநில வெக்டர் திரும்ப வேண்டும். நிலையான '#1196 <https://github.com/Qiskit/qiskit-aer/issues/1210>'__

source: The ``matrix_product_state`` simulation method now has support for it's previously missing set state instruction, :class:`qiskit.providers.aer.library.SetMatrixProductState`, which enables setting the state of a simulation in a circuit.
ta_in: ''matrix_product_state'' உருவகப்படுத்துதல் முறை இப்போது முன்பு காணாமல் போன தொகுப்பு மாநில அறிவுறுத்தலுக்கு ஆதரவு உள்ளது, :class:'qiskit.providers.aer.library.SetMatrixProductState', இது ஒரு சர்கூட் ஒரு உருவகப்படுத்துதல் நிலையை அமைக்க உதவுகிறது.

source: This release officially deprecates the Qiskit Aqua project. Accordingly, in a future release the ``qiskit-aqua`` package will be removed from the Qiskit metapackage, which means in that future release ``pip install qiskit`` will no longer include ``qiskit-aqua``. The application modules that are provided by qiskit-aqua have been split into several new packages: ``qiskit-optimization``, ``qiskit-nature``, ``qiskit-machine-learning``, and ``qiskit-finance``. These packages can be installed by themselves (via the standard pip install command, e.g. ``pip install qiskit-nature``) or with the rest of the Qiskit metapackage as optional extras (e.g. ``pip install 'qiskit[finance,optimization]'`` or ``pip install 'qiskit[all]'`` The core algorithms and the operator flow now exist as part of qiskit-terra at :mod:`qiskit.algorithms` and :mod:`qiskit.opflow`. Depending on your existing usage of Aqua you should either use the application packages or the new modules in Qiskit Terra. For more details on how to migrate from Qiskit Aqua you can refer to the :ref:`aqua-migration`.
ta_in: இந்த வெளியீடு கிஸ்கிட் அக்வா திட்டத்தை அதிகாரப்பூர்வமாக மதிப்பிடுகிறது. அதன்படி, எதிர்கால வெளியீட்டில் ``qiskit-aqua`` தொகுப்பு qiskit மெட்டாபேக்கேஜிலிருந்து அகற்றப்படும், அதாவது எதிர்கால வெளியீட்டில் ``pip install qiskit`` இனி `` qiskit-aqua`` சேர்க்கப்படாது. Qiskit-அக்வாவால் வழங்கப்பட்ட பயன்பாட்டு தொகுதிகள் பல புதிய தொகுப்புகளாக பிரிக்கப்பட்டுள்ளன: ``qiskit-optimization``, ``qiskit-nature``, ``qiskit-machine-learning``, மற்றும் `` qiskit-finance ``. இந்த தொகுப்புகளை அவர்களால் நிறுவ முடியும் (நிலையான பிப் நிறுவல் கட்டளை வழியாக, எ.கா. ``pip install qiskit-nature``) அல்லது மீதமுள்ள qiskit மெட்டாபேக்கேஜுடன் விருப்ப கூடுதல் (எ.கா. ``pip install 'qiskit[finance,optimization]'`` அல்லது ``pip install 'qiskit[all]'`` முக்கிய வழிமுறைகள் மற்றும் ஆபரேட்டர் ஓட்டம் இப்போது qiskit-டெராவின் ஒரு பகுதியாக உள்ளன:mod: `qiskit.algorithms` மற்றும் :mod:` qiskit.opflow`. நீங்கள் தற்போதுள்ள அக்வா பயன்பாட்டைப் பொறுத்து, கிஸ்கிட் டெர்ராவில் உள்ள பயன்பாட்டு தொகுப்புகள் அல்லது புதிய தொகுதிக்கூறுகளைப் பயன்படுத்த வேண்டும். கிஸ்கிட் அக்வாவிலிருந்து எவ்வாறு இடம்பெயர்வது என்பது பற்றிய கூடுதல் விவரங்களுக்கு நீங்கள் பின்வருமாறு குறிப்பிடலாம்:ref: `aqua-migration`.

source: The Qiskit Terra 0.17.0 includes many new features and bug fixes. The major new feature for this release is the introduction of the :mod:`qiskit.algorithms` and :mod:`qiskit.opflow` modules which were migrated and adapted from the :mod:`qiskit.aqua` project.
ta_in: பிழைமுன்னுரைQiskit டெர்ரா 0.17.0 பல புதிய அம்சங்கள் மற்றும் பிழைத்திருத்தங்களை உள்ளடக்கியது. இந்த வெளியீட்டிற்கான முக்கிய புதிய அம்சம் :mod:'qiskit.algorithms' மற்றும் :mod:'qiskit.opflow' தொகுதிகள் அறிமுகப்படுத்தப்பட்டது, அவை இடம்பெயர்ந்து :mod:'qiskit.aqua' திட்டத்திலிருந்து தழுவி எடுக்கப்பட்டன.

source: The :py:func:`qiskit.pulse.call` function can now take a :class:`~qiskit.circuit.Parameter` object along with a parameterized subroutine. This enables assigning different values to the :class:`~qiskit.circuit.Parameter` objects for each subroutine call.
ta_in: :py:func:'qiskit.pulse.call' செயல்பாடு இப்போது ஒரு :class:'~qiskit.circuit.Parameter' பொருளை அளவுருக்கள் கொண்ட துணைவழக்கத்துடன் எடுக்கலாம். இது ஒவ்வொரு துணைவழக்கமான அழைப்புக்கும் :class:'~qiskit.circuit.Parameter' பொருட்களுக்கு வெவ்வேறு மதிப்புகளை ஒதுக்க உதவுகிறது.

source: For example,
ta_in: உதாரணமாக

source: The :class:`qiskit.providers.models.QasmBackendConfiguration` has a new field ``processor_type`` which can optionally be used to provide information about a backend's processor in the form: ``{"family": <str>, "revision": <str>, segment: <str>}``. For example: ``{"family": "Canary", "revision": "1.0", segment: "A"}``.
ta_in: :class:`qiskit.providers.models.QasmBackendConfiguration` ஒரு புதிய புலத்தைக் கொண்டுள்ளது ``processor_type``, இது வடிவத்தில் ஒரு பின்முனையின் செயலி பற்றிய தகவலை வழங்க விருப்பத்தேர்வு டன் பயன்படுத்தப்படலாம்: ``{"குடும்பம்": <str>, "திருத்தம்": <str>, பிரிவு: <str>}``. உதாரணமாக: ``{"குடும்பம்": "கேனரி", "திருத்தம்": "1.0", பிரிவு: "ஏ."}``.

source: The :py:class:`qiskit.pulse.Schedule`, :py:class:`qiskit.pulse.Instruction`, and :py:class:`qiskit.pulse.Channel` classes now have a :attr:`~qiiskit.pulse.Schedule.parameter` property which will return any :class:`~qiskit.circuit.Parameter` objects used in the object and a :meth:`~qiskit.pulse.Schedule.is_parameterized()` method which will return ``True`` if any parameters are used in the object.
ta_in: :py:class:'qiskit.pulse.Schedule', :py:class:'qiskit.pulse.Instruction', மற்றும் :py:class:'qiskit.pulse.Channel'வகுப்புகள் இப்போது ஒரு :attr:'~qiiskit.pulse.Schedule.parameter' சொத்து உள்ளது, இது எந்த :class:'~qiskit.circuit.Parameter' பொருள் மற்றும் ஒரு :meth:'~qiskit.pulse.Schedule.is_parameterized()' முறை, எந்த அளவுருக்கள் பொருளில் பயன்படுத்தப்பட்டால் ``உண்மை`` திரும்பும்.

source: For example:
ta_in: உதாரணத்திற்கு:

source: Added a :class:`~qiskit.circuit.library.PiecewiseChebyshev` to the :mod:`qiskit.circuit.library` for implementing a piecewise Chebyshev approximation of an input function. For a given function :math:`f(x)` and degree :math:`d`, this class class implements a piecewise polynomial Chebyshev approximation on :math:`n` qubits to :math:`f(x)` on the given intervals. All the polynomials in the approximation are of degree :math:`d`.
ta_in: ஒரு உள்ளீடு செயல்பாட்டின் செபிஷேவ் தோராயத்தை ஒரு பிஸ்கேவ் செயல்படுத்துவதற்காக:mod: `qiskit.circuit.library` க்கு:class:` ~qiskit.circuit.library.PiecewiseChebyshev` ஐச் சேர்த்தது. கொடுக்கப்பட்ட செயல்பாட்டிற்கு:math: `f (x)` மற்றும் பட்டம்:math: `d`, இந்த வகுப்பு வர்க்கம் ஒரு பிஸ்கேவ் பல்லுறுப்புறுப்பு செபிஷேவ் தோராயத்தை செயல்படுத்துகிறது:math:` n` வினவல்கள்:math: `f (x)` இல் கொடுக்கப்பட்ட இடைவெளிகள். தோராயத்தில் உள்ள அனைத்து பல்லுறுப்புக்கோவைகளும் பட்டம்:math: `d`.

source: The :py:class:`~qiskit.providers.models.BackendProperties` class now has a :meth:`~qiskit.providers.models.BackendProperties.readout_length` method, which returns the readout length [sec] of the given qubit.
ta_in: :py:class: `~ qiskit.providers.models.BackendProperties` வகுப்பில் இப்போது ஒரு:meth:` ~ qiskit.providers.models.BackendProperties.readout_length` முறை உள்ளது, இது கொடுக்கப்பட்ட குவிட்டின் வாசிப்பு நீளத்தை [sec] தருகிறது.

source: A new class, :py:class:`~qiskit.pulse.ScheduleBlock`, has been added to the :class:`qiskit.pulse` module. This class provides a new representation of a pulse program. This representation is best suited for the pulse builder syntax and is based on relative instruction ordering.
ta_in: ஒரு புதிய வகுப்பு ,: py:class: `~ qiskit.pulse.ScheduleBlock`, இதில்:class:` qiskit.pulse` தொகுதிக்கு சேர்க்கப்பட்டுள்ளது. இந்த வகுப்பு ஒரு துடிப்பு நிரலின் புதிய பிரதிநிதித்துவத்தை வழங்குகிறது. இந்த பிரதிநிதித்துவம் துடிப்பு பில்டர் தொடரியல் மிகவும் பொருத்தமானது மற்றும் இது தொடர்புடைய அறிவுறுத்தல் வரிசையை அடிப்படையாகக் கொண்டது.

source: This representation takes ``alignment_context`` instead of specifying starting time ``t0`` for each instruction. The start time of instruction is implicitly allocated with the specified transformation and relative position of instructions.
ta_in: இந்த பிரதிநிதித்துவம் ஒவ்வொரு அறிவுறுத்தலுக்கும் தொடக்க நேரத்தை `` t0`` குறிப்பிடுவதற்கு பதிலாக `` alignment_context`` ஐ எடுக்கும். அறிவுறுத்தலின் தொடக்க நேரம் குறிப்பிட்ட மாற்றம் மற்றும் அறிவுறுத்தல்களின் உறவினர் நிலையுடன் மறைமுகமாக ஒதுக்கப்பட்டுள்ளது.

source: The :py:class:`~qiskit.pulse.ScheduleBlock` allows for lazy instruction scheduling, meaning we can assign arbitrary parameters to the duration of instructions.
ta_in: :py:class: `~ qiskit.pulse.ScheduleBlock` சோம்பேறி அறிவுறுத்தல் திட்டமிடலை அனுமதிக்கிறது, அதாவது அறிவுறுத்தல்களின் காலத்திற்கு தன்னிச்சையான அளவுருக்களை ஒதுக்கலாம்.

source: this code defines an experiment scanning a Gaussian pulse's duration followed by a measurement ``measure_sched``, i.e. a Rabi experiment. You can reuse the ``block`` object for every scanned duration by assigning a target duration value.
ta_in: இந்த குறியீடு காஸியன் துடிப்பு காலத்தை ஸ்கேன் செய்யும் ஒரு பரிசோதனையை வரையறுக்கிறது, அதன்பிறகு ஒரு அளவீட்டு ``measure_sched``, அதாவது ஒரு ரபி சோதனை. இலக்கு கால மதிப்பை ஒதுக்குவதன் மூலம் ஸ்கேன் செய்யப்பட்ட ஒவ்வொரு காலத்திற்கும் ``block`` பொருளை மீண்டும் பயன்படுத்தலாம்.

source: Added a new function :func:`~qiskit.visualization.array_to_latex` to the :mod:`qiskit.visualization` module that can be used to represent and visualize vectors and matrices with LaTeX.
ta_in: ஒரு புதிய செயல்பாட்டைச் சேர்த்தது:func: `~ qiskit.visualization.array_to_latex` :mod:` qiskit.visualization` தொகுதிக்கு லாடெக்ஸுடன் திசையன்கள் மற்றும் மெட்ரிக்குகளை பிரதிநிதித்துவப்படுத்தவும் காட்சிப்படுத்தவும் பயன்படுத்தலாம்.

source: The :class:`~qiskit.quantum_info.Statevector` and :class:`~qiskit.quantum_info.DensityMatrix` classes now have :meth:`~qiskit.quantum_info.Statevector.draw` methods which allow objects to be drawn as either text matrices, IPython Latex objects, Latex source, Q-spheres, Bloch spheres and Hinton plots. By default the output type is the equivalent output from ``__repr__`` but this default can be changed in a user config file by setting the ``state_drawer`` option. For example:
ta_in: :class: `~ qiskit.quantum_info.Statevector` மற்றும்:class:` ~ qiskit.quantum_info.DensityMatrix` வகுப்புகள் இப்போது உள்ளன:meth: `~ qiskit.quantum_info.Statevector.draw` முறைகள் அவை உரைகளாக வரையப்பட அனுமதிக்கின்றன மெட்ரிக்குகள், ஐபிதான் லேடெக்ஸ் பொருள்கள், லேடெக்ஸ் மூல, கியூ-கோளங்கள், ப்ளாச் கோளங்கள் மற்றும் ஹிண்டன் அடுக்கு. முன்னிருப்பாக வெளியீட்டு வகை `` __repr__`` இலிருந்து சமமான வெளியீடாகும், ஆனால் இந்த இயல்புநிலையை பயனர் உள்ளமைவு கோப்பில் `` state_drawer`` விருப்பத்தை அமைப்பதன் மூலம் மாற்றலாம். உதாரணத்திற்கு:

source: Additionally, the :meth:`~qiskit.quantum_info.DensityMatrix.draw` method is now used for the ipython display of these classes, so if you change the default output type in a user config file then when a :class:`~qiskit.quantum_info.Statevector` or a :class:`~qiskit.quantum_info.DensityMatrix` object are displayed in a jupyter notebook that output type will be used for the object.
ta_in: கூடுதலாக, இந்த வகுப்புகளின் ஐபிதான் காட்சிக்கு இப்போது:meth: `~ qiskit.quantum_info.DensityMatrix.draw` முறை பயன்படுத்தப்படுகிறது, எனவே நீங்கள் ஒரு பயனர் உள்ளமைவு கோப்பில் இயல்புநிலை வெளியீட்டு வகையை மாற்றினால், பின்: a:class:` q qiskit .quantum_info.Statevector` அல்லது a:class: `~ qiskit.quantum_info.DensityMatrix` பொருள் ஒரு ஜூபிட்டர் நோட்புக்கில் காட்டப்படும், அது பொருளுக்கு வெளியீட்டு வகை பயன்படுத்தப்படும்.

source: Pulse :class:`qiskit.pulse.Instruction` objects and parametric pulse objects (eg :class:`~qiskit.pulse.library.Gaussian` now support using :class:`~qiskit.circuit.Parameter` and :class:`~qiskit.circuit.ParameterExpression` objects for the ``duration`` parameter. For example:
ta_in: துடிப்பு:class: `qiskit.pulse.Instruction` பொருள்கள் மற்றும் அளவுரு துடிப்பு பொருள்கள் (எ.கா:class:` ~ qiskit.pulse.library.Gaussian` இப்போது இதைப் பயன்படுத்துவதை ஆதரிக்கிறது:class: `q qiskit.circuit.Parameter` மற்றும் :class:~qiskit.circuit.ParameterExpression` ``duration`` அளவுருவுக்கான பொருள்கள். எடுத்துக்காட்டாக:

source: Note that while we can create an instruction with a parameterized ``duration`` adding an instruction with unbound parameter ``duration`` to a schedule is supported only by the newly introduced representation :class:`~qiskit.pulse.ScheduleBlock`. See the known issues release notes section for more details.
ta_in: ஒரு அளவுரு ``duration`` உடன் ஒரு வழிமுறையை ஒரு அட்டவணையில் சேர்க்கும்போது, ​​``duration`` ஒரு அட்டவணையில் சேர்ப்பது புதிதாக அறிமுகப்படுத்தப்பட்ட பிரதிநிதித்துவத்தால் மட்டுமே ஆதரிக்கப்படுகிறது:class: `~ qiskit.pulse.ScheduleBlock`. மேலும் விவரங்களுக்கு அறியப்பட்ட சிக்கல்கள் வெளியீட்டு குறிப்புகள் பகுதியைப் பார்க்கவும்.

source: The :meth:`~qiskit.providers.basicaer.QasmSimulatorPy.run` method for the :class:`~qiskit.providers.basicaer.QasmSimulatorPy`, :class:`~qiskit.providers.basicaer.StatevectorSimulatorPy`, and :class:`~qiskit.providers.basicaer.UnitarySimulatorPy` backends now takes a :class:`~qiskit.circuit.QuantumCircuit` (or a list of :class:`~qiskit.circuit.QuantumCircuit` objects) as its input. The previous :class:`~qiskit.qobj.QasmQobj` object is still supported for now, but will be deprecated in a future release.
ta_in: தி :meth: `~ qiskit.providers.basicaer.QasmSimulatorPy.run` முறை:class:` ~ qiskit.providers.basicaer.QasmSimulatorPy` ,:class: `~ qiskit.providers.basicaer.StatevectorSimulatorPy` மற்றும் :class: `~ qiskit.providers.basicaer.UnitarySimulatorPy` பின்தளத்தில் இப்போது ஒரு:class:` ~ qiskit.circuit.QuantumCircuit` (அல்லது :class: `~ qiskit.circuit.QuantumCircuit` பொருள்கள்) அதன் உள்ளீடாக எடுக்கிறது. முந்தைய:class: `~ qiskit.qobj.QasmQobj` பொருள் இப்போதும் ஆதரிக்கப்படுகிறது, ஆனால் எதிர்கால வெளியீட்டில் அது நீக்கப்படும்.
