Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: The ``qiskit.qasm.qasmparser.QasmParser`` method ``get_tokens()`` is deprecated. Instead you should use the ``read_tokens()`` method.
ta_in: ``Qiskit.qasm.qasmparser.QasmParser`` முறை ``get_tokens ()`` நீக்கப்பட்டது. அதற்கு பதிலாக நீங்கள் ``read_tokens()`` முறையைப் பயன்படுத்த வேண்டும்.

source: The ``as_dict()`` method for the Qobj class has been deprecated and will be removed in the future. You should replace calls to it with ``to_dict()`` instead.
ta_in: Qobj வகுப்பிற்கான ``as_dict ()`` முறை நீக்கப்பட்டது மற்றும் எதிர்காலத்தில் அகற்றப்படும். அதற்கான அழைப்புகளை அதற்கு பதிலாக ``to_dict()`` உடன் மாற்ற வேண்டும்.

source: The definition of the ``CU3Gate`` has been changed to be equivalent to the canonical definition of a controlled ``U3Gate``.
ta_in: `` CU3Gate`` இன் வரையறை கட்டுப்படுத்தப்பட்ட `` U3Gate`` இன் நியமன வரையறைக்கு சமமாக மாற்றப்பட்டுள்ளது.

source: The handling of layout in the pass manager has been standardized. This fixes several reported issues with handling layout. The ``initial_layout`` kwarg parameter on ``qiskit.compiler.transpile()`` and ``qiskit.execute()`` will now lay out your qubits from the circuit onto the desired qubits on the device when transpiling circuits.
ta_in: பாஸ் மேலாளரில் தளவமைப்பைக் கையாளுதல் தரப்படுத்தப்பட்டுள்ளது. தளவமைப்பைக் கையாள்வதில் பல புகாரளிக்கப்பட்ட சிக்கல்களை இது சரிசெய்கிறது. `` Qiskit.compiler.transpile () `` மற்றும் `` qiskit.execute () `` இல் உள்ள `` initial_layout`` குவார்க் அளவுரு இப்போது சுற்றுகளை கடத்தும் போது சாதனத்தில் விரும்பிய குவிட்களில் சுற்றிலிருந்து உங்கள் குவிட்களை வெளியேற்றும்.

source: Support for n-qubit unitaries was added to the BasicAer simulator and ``unitary`` (arbitrary unitary gates) was added to the set of basis gates for the simulators
ta_in: N-qubit அலகுகளுக்கான ஆதரவு BasicAer சிமுலேட்டரில் சேர்க்கப்பட்டது மற்றும் சிமுலேட்டர்களுக்கான அடிப்படை வாயில்களின் தொகுப்பில் `` unitary`` (தன்னிச்சையான ஒற்றையாட்சி வாயில்கள்) சேர்க்கப்பட்டன

source: The ``qiskit.visualization.plost_state_qsphere()`` has been updated to fix several issues with it. Now output Q Sphere visualization will be correctly generated and the following aspects have been updated:
ta_in: `` Qiskit.visualization.plost_state_qsphere () `` இதில் பல சிக்கல்களை சரிசெய்ய புதுப்பிக்கப்பட்டுள்ளது. இப்போது வெளியீடு Q கோள காட்சிப்படுத்தல் சரியாக உருவாக்கப்பட்டு பின்வரும் அம்சங்கள் புதுப்பிக்கப்பட்டுள்ளன:

source: All complementary basis states are antipodal
ta_in: அனைத்து நிரப்பு அடிப்படை நிலைகளும் ஆண்டிபோடல் ஆகும்

source: Phase is indicated by color of line and marker on sphere's surface
ta_in: கட்டம் கோளத்தின் மேற்பரப்பில் கோடு மற்றும் மார்க்கரின் நிறத்தால் குறிக்கப்படுகிறது

source: Probability is indicated by translucency of line and volume of marker on
ta_in: கோட்டின் ஒளிஊடுருவல் மற்றும் மார்க்கரின் அளவின் மூலம் நிகழ்தகவு குறிக்கப்படுகிறது

source: sphere's surface
ta_in: கோளத்தின் மேற்பரப்பு

source: The default PassManager for ``qiskit.compiler.transpile()`` and ``qiskit.execute()`` has been changed to optimization level 1 pass manager defined at ``qiskit.transpile.preset_passmanagers.level1_pass_manager``.
ta_in: `` Qiskit.compiler.transpile () `` மற்றும் `` qiskit.execute () `` க்கான இயல்புநிலை PassManager `` qiskit.transpile.preset_passmanagers.level1_pass_manager`` இல் வரையறுக்கப்பட்ட தேர்வுமுறை நிலை 1 பாஸ் மேலாளராக மாற்றப்பட்டுள்ளது.

source: All the circuit drawer backends now will express gate parameters in a circuit as common fractions of pi in the output visualization. If the value of a parameter can be expressed as a fraction of pi that will be used instead of the numeric equivalent.
ta_in: அனைத்து சர்க்யூட் டிராயர் பின்தளத்தில் இப்போது வெளியீட்டு காட்சிப்படுத்தலில் pi இன் பொதுவான பின்னங்களாக ஒரு சுற்றில் கேட் அளவுருக்களை வெளிப்படுத்தும். ஒரு அளவுருவின் மதிப்பை pi இன் ஒரு பகுதியாக வெளிப்படுத்த முடியுமானால் அது எண் சமத்திற்கு பதிலாக பயன்படுத்தப்படும்.

source: When using ``qiskit.assembler.assemble_schedules()`` if you do not provide the number of memory_slots to use the number will be inferred based on the number of acquisitions in the input schedules.
ta_in: `` Qiskit.assembler.assemble_schedules () `` ஐப் பயன்படுத்தும் போது, ​​எண்ணைப் பயன்படுத்த நினைவக_ இடங்களின் எண்ணிக்கையை நீங்கள் வழங்காவிட்டால், உள்ளீட்டு அட்டவணைகளில் கையகப்படுத்துதல்களின் எண்ணிக்கையின் அடிப்படையில் ஊகிக்கப்படும்.

source: The deprecation warning on the ``qiskit.dagcircuit.DAGCircuit`` property ``node_counter`` has been removed. The behavior change being warned about was put into effect when the warning was added, so warning that it had changed served no purpose.
ta_in: `` Qiskit.dagcircuit.DAGCircuit`` சொத்து `` node_counter`` இல் உள்ள நீக்குதல் எச்சரிக்கை நீக்கப்பட்டது. எச்சரிக்கை சேர்க்கப்பட்டபோது எச்சரிக்கப்பட்ட நடத்தை மாற்றம் நடைமுறைக்கு வந்தது, எனவே அது மாறிவிட்டது என்ற எச்சரிக்கை எந்த நோக்கமும் செய்யவில்லை.

source: Calls to ``PassManager.run()`` now will emit python logging messages at the INFO level for each pass execution. These messages will include the Pass name and the total execution time of the pass. Python's standard logging was used because it allows Qiskit-Terra's logging to integrate in a standard way with other applications and libraries. All logging for the transpiler occurs under the ``qiskit.transpiler`` namespace, as used by ``logging.getLogger('qiskit.transpiler``). For example, to turn on DEBUG level logging for the transpiler you can run::
ta_in: `` PassManager.run () `` க்கான அழைப்புகள் இப்போது ஒவ்வொரு பாஸ் செயலாக்கத்திற்கும் INFO மட்டத்தில் பைதான் பதிவு செய்திகளை வெளியிடும். இந்த செய்திகளில் பாஸ் பெயர் மற்றும் பாஸின் மொத்த செயல்பாட்டு நேரம் ஆகியவை அடங்கும். பைத்தானின் நிலையான பதிவு பயன்படுத்தப்பட்டது, ஏனெனில் இது Qiskit-Terra வின் பதிவு மற்ற பயன்பாடுகள் மற்றும் நூலகங்களுடன் நிலையான வழியில் ஒருங்கிணைக்க அனுமதிக்கிறது. டிரான்ஸ்பைலருக்கான அனைத்து பதிவுகளும் `` qiskit.transpiler`` பெயர்வெளியின் கீழ் நிகழ்கின்றன, ``logging.getLogger ('qiskit.transpiler``) பயன்படுத்துகிறது. எடுத்துக்காட்டாக, நீங்கள் இயக்கக்கூடிய டிரான்ஸ்பைலருக்கான DEBUG நிலை பதிவை இயக்க::

source: which will set the log level for the transpiler to DEBUG and configure those messages to be printed to stderr.
ta_in: இது டிரான்ஸ்பைலருக்கான பதிவு அளவை DEBUG க்கு அமைக்கும் மற்றும் அந்த செய்திகளை stderr இல் அச்சிட கட்டமைக்கும்.

source: There's a new high-performance Density Matrix Simulator that can be used in conjunction with our noise models, to better simulate real world scenarios.
ta_in: நிஜ உலக காட்சிகளை சிறப்பாக உருவகப்படுத்த, எங்கள் இரைச்சல் மாதிரிகளுடன் இணைந்து பயன்படுத்தக்கூடிய புதிய உயர் செயல்திறன் Density Matrix சிமுலேட்டர் உள்ளது.

source: We have added a Matrix Product State (MPS) simulator. MPS allows for efficient simulation of several classes of quantum circuits, even under presence of strong correlations and highly entangled states. For cases amenable to MPS, circuits with several hundred qubits and more can be exactly simulated, e.g., for the purpose of obtaining expectation values of observables.
ta_in: மேட்ரிக்ஸ் தயாரிப்பு நிலை (MPS) சிமுலேட்டரைச் சேர்த்துள்ளோம். பலவிதமான குவாண்டம் சுற்றுகளை திறம்பட உருவகப்படுத்துவதற்கு MPS அனுமதிக்கிறது, வலுவான தொடர்புகள் மற்றும் மிகவும் சிக்கலான மாநிலங்களின் முன்னிலையில் கூட. MPS-க்கு ஏற்ற நிகழ்வுகளுக்கு, பல நூறு குவிட்கள் மற்றும் பலவற்றைக் கொண்ட சுற்றுகள் சரியாக உருவகப்படுத்தப்படலாம், எ.கா., கவனிக்கத்தக்கவற்றின் எதிர்பார்ப்பு மதிப்புகளைப் பெறுவதற்கான நோக்கத்திற்காக.

source: Snapshots can be performed in all of our simulators.
ta_in: எங்கள் எல்லா சிமுலேட்டர்களிலும் ஸ்னாப்ஷாட்களைச் செய்யலாம்.

source: Now we can measure sampling circuits with read-out errors too, not only ideal circuits.
ta_in: இப்போது நாம் மாதிரி சுற்றுகளை படிக்கக்கூடிய பிழைகள் மூலம் அளவிட முடியும், சிறந்த சுற்றுகள் மட்டுமல்ல.

source: We have increased some circuit optimizations with noise presence.
ta_in: இரைச்சல் இருப்புடன் சில சுற்று மேம்படுத்தல்களை அதிகரித்துள்ளோம்.

source: A better 2-qubit error approximations have been included.
ta_in: சிறந்த 2-குவிட் பிழை தோராயங்கள் சேர்க்கப்பட்டுள்ளன.

source: Included some tools for making certain noisy simulations easier to craft and faster to simulate.
ta_in: சில சத்தமில்லாத உருவகப்படுத்துதல்களை எளிதில் உருவாக்குவதற்கும், உருவகப்படுத்துவதற்கும் சில கருவிகள் உள்ளன.

source: Increased performance with simulations that require less floating point numerical precision.
ta_in: குறைந்த மிதக்கும் புள்ளி எண் துல்லியம் தேவைப்படும் உருவகப்படுத்துதல்களுடன் அதிகரித்த செயல்திறன்.

source: Seed values can now be arbitrarily added to RB (not just in order)
ta_in: Seed values இப்போது தன்னிச்சையாக RB இல் சேர்க்கப்படலாம் (வரிசையில் மட்டுமல்ல)

source: Support for adding multiple results to measurement mitigation
ta_in: அளவீட்டுத் தணிப்புக்கு பல முடிவுகளைச் சேர்ப்பதற்கான ஆதரவு

source: RB Fitters now support providing guess values
ta_in: RB ஃபிட்டர்ஸ் இப்போது யூக மதிப்புகளை வழங்குவதை ஆதரிக்கிறது

source: Fixed a bug in RB fit error
ta_in: RB பொருத்தம் பிழையில் பிழை சரி செய்யப்பட்டது

source: Fixed a bug in the characterization fitter when selecting a qubit index to fit
ta_in: பொருத்தமாக ஒரு குவிட் குறியீட்டைத் தேர்ந்தெடுக்கும்போது, ​​பண்புக்கூறு ஃபிட்டரில் ஒரு பிழை சரி செய்யப்பட்டது

source: Measurement mitigation now operates in parallel when applied to multiple results
ta_in: பல முடிவுகளுக்குப் பயன்படுத்தப்படும் போது அளவீட்டுத் தணிப்பு இப்போது இணையாக இயங்குகிறது

source: Guess values for RB fitters are improved
ta_in: RB பொருத்துதல்களுக்கான யூக மதிப்புகள் மேம்படுத்தப்பட்டுள்ளன

source: Relative-Phase Toffoli gates ``rccx`` (with 2 controls) and ``rcccx`` (with 3 controls).
ta_in: Relative-Phase Toffoli gates `` rccx`` (2 கட்டுப்பாடுகளுடன்) மற்றும் `` rcccx`` (3 கட்டுப்பாடுகளுடன்).

source: Variational form ``RYCRX``
ta_in: மாறுபட்ட வடிவம் `` RYCRX``

source: A new ``'basic-no-ancilla'`` mode to ``mct``.
ta_in: ``Mct`` க்கு புதிய ``'basic-no-ancilla'`` பயன்முறை.

source: Multi-controlled rotation gates ``mcrx``, ``mcry``, and ``mcrz`` as a general ``u3`` gate is not supported by graycode implementation
ta_in: பல கட்டுப்பாட்டு சுழற்சி வாயில்கள் ``mcrx``, ``mcry``, மற்றும் ``mcrz`` ஆகியவை பொதுவான ``u3`` வாயிலாக கிரேக்கோடு செயல்படுத்தப்படுவதை ஆதரிக்கவில்லை

source: Chemistry: ROHF open-shell support
ta_in: வேதியியல்: ROHF திறந்த-ஷெல் ஆதரவு

source: Supported for all drivers: Gaussian16, PyQuante, PySCF and PSI4
ta_in: அனைத்து இயக்கிகளுக்கும் துணைபுரிகிறது: Gaussian16, PyQuante, PySCF மற்றும் PSI4

source: HartreeFock initial state, UCCSD variational form and two qubit reduction for parity mapping now support different alpha and beta particle numbers for open shell support
ta_in: ஹார்ட்ரீஃபாக் ஆரம்ப நிலை, UCCSD மாறுபட்ட வடிவம் மற்றும் பரிதி மேப்பிங்கிற்கான இரண்டு குவிட் குறைப்பு இப்போது திறந்த ஷெல் ஆதரவுக்காக வெவ்வேறு ஆல்பா மற்றும் பீட்டா துகள் எண்களை ஆதரிக்கிறது

source: Chemistry: UHF open-shell support
ta_in: வேதியியல்: UHF திறந்த-ஷெல் ஆதரவு

source: QMolecule extended to include integrals, coefficients etc for separate beta
ta_in: தனி பீட்டாவிற்கான ஒருங்கிணைப்புகள், குணகங்கள் போன்றவற்றைச் சேர்க்க QMolecule நீட்டிக்கப்பட்டுள்ளது

source: Chemistry: QMolecule extended with integrals in atomic orbital basis to facilitate common access to these for experimentation
ta_in: வேதியியல்: சோதனைக்கு இவற்றிற்கான பொதுவான அணுகலை எளிதாக்க அணு சுற்றுப்பாதை அடிப்படையில் ஒருங்கிணைப்புகளுடன் QMolecule நீட்டிக்கப்பட்டுள்ளது

source: Chemistry: Additional PyQuante and PySCF driver configuration
ta_in: வேதியியல்: கூடுதலான PyQuante மற்றும் PySCF இயக்கி வடிவமைப்பு

source: Convergence tolerance and max convergence iteration controls.
ta_in: குவிப்பு சகிப்புத்தன்மை மற்றும் அதிகபட்ச குவிப்பு மறு செய்கை கட்டுப்பாடுகள்.

source: For PySCF initial guess choice
ta_in: PySCF ஆரம்ப யூக தேர்வுக்கு

source: Chemistry: Processing output added to debug log from PyQuante and PySCF computations (Gaussian16 and PSI4 outputs were already added to debug log)
ta_in: வேதியியல்: PyQuante மற்றும் PySCF கணக்கீடுகளிலிருந்து பிழைத்திருத்த பதிவில் செயலாக்க வெளியீடு சேர்க்கப்பட்டது (Gaussian16 மற்றும் PSI4 வெளியீடுகள் ஏற்கனவே பிழைத்திருத்த பதிவில் சேர்க்கப்பட்டன)

source: Chemistry: Merged qiskit-chemistry into qiskit-aqua
ta_in: வேதியியல்: ஒன்றுசேர்ந்த qiskit-chemistry qiskit-aqua

source: Add ``MatrixOperator``, ``WeightedPauliOperator`` and ``TPBGroupedPauliOperator`` class.
ta_in: `` MatrixOperator``, `` WeightedPauliOperator`` மற்றும் `` TPBGroupedPauliOperator`` வகுப்பைச் சேர்க்கவும்.

source: Add ``evolution_instruction`` function to get registerless instruction of time evolution.
ta_in: நேர பரிணாமத்தின் பதிவு இல்லாத வழிமுறைகளைப் பெற `` evolution_instruction`` செயல்பாட்டைச் சேர்க்கவும்.

source: Add ``op_converter`` module to unify the place in charge of converting different types of operators.
ta_in: ` ` op_converter ` ` கூடுதலாக பல்வேறு வகையான இயக்குநர்களை மாற்றுவதற்கு இடத்தை ஒழுங்குபடுத்துவதற்கு கூடுதலாக சேர்க்கவும்.

source: Add ``Z2Symmetries`` class to encapsulate the Z2 symmetries info and has helper methods for tapering an Operator.
ta_in: Z2 சமச்சீர் தகவலை இணைக்க `` Z2Symmetries`` வகுப்பைச் சேர்க்கவும், மேலும் ஒரு ஆபரேட்டரைத் தட்டச்சு செய்வதற்கான உதவி முறைகள் உள்ளன.

source: Amplitude Estimation: added maximum likelihood postprocessing and confidence interval computation.
ta_in: அலைவீச்சு மதிப்பீடு: அதிகபட்ச சாத்தியக்கூறுகள் போஸ்ட்ரோசெசிங் மற்றும் நம்பிக்கை இடைவெளி கணக்கீடு சேர்க்கப்பட்டது.

source: Maximum Likelihood Amplitude Estimation (MLAE): Implemented new algorithm for amplitude estimation based on maximum likelihood estimation, which reduces number of required qubits and circuit depth.
ta_in: அதிகபட்ச அளவிலான மதிப்பீடுகள் Amplitude Estimation (MLAE): அதிக அளவிலான மதிப்பீடுகள் அடிப்படையாகக் கணிசமான மதிப்பீடுகளுக்கான புதிய படிமுறை கணினி மதிப்பீடுகள் மற்றும் சுற்றுச்சூழல் ஆழம் குறைக்கிறது.

source: Added (piecewise) linearly and polynomially controlled Pauli-rotation circuits.
ta_in: சேர்க்கப்பட்ட (துல்லியமான) சார்ந்த மற்றும் பல்லுறுப்புக்கோவை கட்டுப்படுத்தப்பட்ட Pauli-சுழற்சி சுழற்சி.

source: Add ``q_equation_of_motion`` to study excited state of a molecule, and add two algorithms to prepare the reference state.
ta_in: ஒரு மூலக்கூறின் உற்சாகமான நிலையைப் படிக்க `` q_equation_of_motion`` ஐச் சேர்த்து, குறிப்பு நிலையைத் தயாரிக்க இரண்டு வழிமுறைகளைச் சேர்க்கவும்.

source: Improve ``mct``'s ``'basic'`` mode by using relative-phase Toffoli gates to build intermediate results.
ta_in: '' mct ` ` அடிப்படையிலான டோஃப்லோலி கேட்களை பயன்படுத்தி இடைநிலை முடிவுகளைக் கட்டுவதற்கு ` `basic ` `.

source: Adapt to Qiskit Terra's newly introduced ``Qubit`` class.
ta_in: Qiskit டெரரா புதியது அறிமுகப்படுத்தப்பட்ட ` ` Qubit ` ` வகுப்பு.

source: Prevent ``QPE/IQPE`` from modifying input ``Operator`` objects.
ta_in: உள்ளீடு ``Operators`` பொருள்களை மாற்றுவதில் இருந்து `` QPE / IQPE`` ஐத் தடுக்கவும்.

source: The PyEDA dependency was removed; corresponding oracles' underlying logic operations are now handled by SymPy.
ta_in: PyEDA சார்பு நீக்கப்பட்டது; தொடர்புடைய ஆரக்கிள்களின் அடிப்படை தர்க்க செயல்பாடுகள் இப்போது SymPy-யால் கையாளப்படுகின்றன.

source: Refactor the ``Operator`` class, each representation has its own class ``MatrixOperator``, ``WeightedPauliOperator`` and ``TPBGroupedPauliOperator``.
ta_in: `` Operator`` வகுப்பை மாற்றியமைத்து, ஒவ்வொரு பிரதிநிதித்துவத்திற்கும் அதன் சொந்த வகுப்பு ``MatrixOperator``, ``WeightedPauliOperator`` மற்றும் ``TPBGroupedPauliOperator`` ஆகியவை உள்ளன.

source: The ``power`` in ``evolution_instruction`` was applied on the theta on the CRZ gate directly, the new version repeats the circuits to implement power.
ta_in: சி. ஆர். இசட் கேட்டில் உள்ள தீட்டாவில் ``evolution_instruction`` இல் உள்ள ``power`` நேரடியாகப் பயன்படுத்தப்பட்டது, புதிய பதிப்பு சக்தியைச் செயல்படுத்த சுற்றுகளை மீண்டும் செய்கிறது.

source: CircuitCache is OFF by default, and it can be set via environment variable now ``QISKIT_AQUA_CIRCUIT_CACHE``.
ta_in: சர்க்யூட்கேச் இயல்பாகவே முடக்கப்பட்டுள்ளது, இப்போது அதை சூழல் மாறி வழியாக `` QISKIT_AQUA_CIRCUIT_CACHE`` என அமைக்கலாம்.

source: A bug where ``TruthTableOracle`` would build incorrect circuits for truth tables with only a single ``1`` value.
ta_in: `` TruthTableOracle`` ஒரு `` 1`` மதிப்பைக் கொண்ட உண்மை அட்டவணைகளுக்கு தவறான சுற்றுகளை உருவாக்கும் பிழை.

source: A bug caused by ``PyEDA``'s indeterminism.
ta_in: `` PyEDA`` உறுதியற்ற தன்மையால் ஏற்பட்ட பிழை.

source: A bug with ``QPE/IQPE``'s translation and stretch computation.
ta_in: `` QPE / IQPE` இன் மொழிபெயர்ப்பு மற்றும் நீட்டிப்பு கணக்கீடு கொண்ட பிழை.

source: Chemistry: Bravyi-Kitaev mapping fixed when num qubits was not a power of 2
ta_in: வேதியியல்: எண் குவிட்ஸ் 2 இன் சக்தியாக இல்லாதபோது பிராவி-கிட்டேவ் மேப்பிங் சரி செய்யப்பட்டது

source: Setup ``initial_layout`` in ``QuantumInstance`` via a list.
ta_in: ` ` QuantumInstance ` ` ஒரு பட்டியலால் ` ` initial_layout` ` துவக்குகிறது.

source: General multi-controlled rotation gate ``mcu3`` is removed and replaced by multi-controlled rotation gates ``mcrx``, ``mcry``, and ``mcrz``
ta_in: பொது பல கட்டுப்பாட்டு சுழற்சி கேட் `` mcu3`` அகற்றப்பட்டு பல கட்டுப்பாட்டு சுழற்சி கேட்கள் `` mcrx``, `` mcry``, மற்றும் `` mcrz`` ஆகியவற்றால் மாற்றப்படுகின்றன

source: The ``Operator`` class is deprecated, in favor of using ``MatrixOperator``, ``WeightedPauliOperator`` and ``TPBGroupedPauliOperator``.
ta_in: `` Opertator`` வகுப்பு நீக்கப்பட்டது, ``MatrixOperator``, ``WeightedPauliOperator`` மற்றும் ``TPBGroupedPauliOperator`` ஆகியவற்றைப் பயன்படுத்துவதற்கு ஆதரவாக.

source: We have bumped up Qiskit micro version to 0.11.1 because IBM Q Provider has bumped its micro version as well.
ta_in: Qiskit மைக்ரோ பதிப்பை 0.11.1 ஆக உயர்த்தியுள்ளோம், ஏனெனில் ஐபிஎம் கியூ வழங்குநர் அதன் மைக்ரோ பதிப்பையும் மோதியுள்ளது.

source: ``qiskit-aqua`` has been updated to ``0.5.3`` to fix code related to changes in how gates inverses are done.
ta_in: கேட்கள் தலைகீழாக எவ்வாறு செய்யப்படுகின்றன என்பதற்கான மாற்றங்கள் தொடர்பான குறியீட்டை சரிசெய்ய ``qiskit-aqua`` "0.5.3`` என புதுப்பிக்கப்பட்டுள்ளது.

source: The ``IBMQProvider`` has been updated to version ``0.3.1`` to fix backward compatibility issues and work with the default 10 job limit in single calls to the IBM Q API v2.
ta_in: பின்தங்கிய பொருந்தக்கூடிய சிக்கல்களை சரிசெய்ய `` 0.3.1`` பதிப்பிற்கு `` IBMQProvider`` புதுப்பிக்கப்பட்டுள்ளது மற்றும் IBM Q API v2 க்கான ஒற்றை அழைப்புகளில் இயல்புநிலை 10 வேலை வரம்புடன் வேலை செய்கிறது.

source: We have bumped up Qiskit minor version to 0.11 because IBM Q Provider has bumped up its minor version too. On Aer, we have jumped from 0.2.1 to 0.2.3 because there was an issue detected right after releasing 0.2.2 and before Qiskit 0.11 went online.
ta_in: Qiskit சிறு பதிப்பை 0.11 ஆக உயர்த்தியுள்ளோம், ஏனெனில் ஐபிஎம் கியூ வழங்குநர் அதன் சிறிய பதிப்பையும் அதிகரித்துள்ளது. ஏரில், நாங்கள் 0.2.1 இலிருந்து 0.2.3 ஆக உயர்ந்தோம், ஏனெனில் 0.2.2 ஐ வெளியிட்டபின்னும், Qiskit 0.11 ஆன்லைனில் செல்வதற்கு முன்பும் ஒரு சிக்கல் கண்டறியப்பட்டது.

source: New features
ta_in: புதிய அம்சங்கள்

source: Added support for multi-controlled phase gates
ta_in: பல கட்டுப்பாட்டு கட்ட வாயில்களுக்கான ஆதரவு சேர்க்கப்பட்டது

source: Added optimized anti-diagonal single-qubit gates
ta_in: ஒதுக்கப்பட்ட ஒற்றை-வரைபடம் ஒற்றை-கிட் கேட்களை சேர்க்கப்பட்டது

source: Improvements
ta_in: மேம்பாடுகள்

source: Introduced a technique called Fusion that increments performance of circuit execution Tuned threading strategy to gain performance in most common scenarios.
ta_in: சர்க்யூட் எக்ஸிக்யூஷனின் செயல்திறனை அதிகரிக்கும் ஃப்யூஷன் எனப்படும் ஒரு நுட்பத்தை அறிமுகப்படுத்தியது, மிகவும் பொதுவான காட்சிகளில் செயல்திறனைப் பெற டியூன் செய்யப்பட்ட த்ரெட்டிங் உத்தி.

source: Some of the already implemented error models have been polished.
ta_in: ஏற்கெனவே செயல் செய்யப்பட்ட பிழை மாதிரிகளில் சில புள்ளிகள் செய்யப்பட்டுள்ளன.

source: The ``IBMQProvider`` has been updated in order to default to use the new `IBM Q Experience v2 <https://quantum-computing.ibm.com>`__. Accessing the legacy IBM Q Experience v1 and QConsole will still be supported during the 0.3.x line until its final deprecation one month from the release. It is encouraged to update to the new IBM Q Experience to take advantage of the new functionality and features.
ta_in: புதிய `IBM Q அனுபவம் v2 <https://quantum-computing.ibm.com>` __ ஐப் பயன்படுத்த இயல்புநிலையாக `` IBMQProvider`` புதுப்பிக்கப்பட்டுள்ளது. வெளியீட்டில் இருந்து ஒரு மாதம் அதன் இறுதி நீக்கம் வரை ஐபிஎம் கியூ எக்ஸ்பீரியன்ஸ் வி 1 மற்றும் க்யூ கன்சோல் 0.3.x வரியின் போது ஆதரிக்கப்படும். புதிய செயல்பாடு மற்றும் அம்சங்களைப் பயன்படுத்த புதிய ஐபிஎம் கியூ அனுபவத்திற்கு புதுப்பிக்க ஊக்குவிக்கப்படுகிறது.

source: Updating to the new IBM Q Experience v2
ta_in: புதிய IBM Q எக்ஸ்பீரியன்ஸ் v2 புதுப்பிக்கப்படுகிறது

source: If you have credentials for the legacy IBM Q Experience stored on disk, you can make use of the interactive helper::
ta_in: வட்டில் சேமிக்கப்பட்டுள்ள ஐபிஎம் கியூ எக்ஸ்பீரியன்ஸ்க்கான சான்றுகளை நீங்கள் வைத்திருந்தால், நீங்கள் ஊடாடும் உதவியாளரைப் பயன்படுத்தலாம்::

source: For more complex cases or fine tuning your configuration, the following methods are available:
ta_in: மேலும் சிக்கலான வழக்குகள் அல்லது நன்றாக உங்கள் வடிவமைப்பு, பின்வரும் முறைகள் கிடைக்கப்பெறுகின்றன:

source: the ``IBMQ.delete_accounts()`` can be used for resetting your configuration file.
ta_in: ` ` IBMQ.delete_accounts() ` ` உங்கள் உள்ளமைவு கோப்பை மறுபடியும் பயன்படும்.

source: the ``IBMQ.save_account('MY_TOKEN')`` method can be used for saving your credentials, following the instructions in the `IBM Q Experience v2 <https://quantum-computing.ibm.com>`__ account page.
ta_in: 'IBM Q Experience v2 <https://quantum-computing.ibm.com>` __ கணக்கு பக்கத்தில் உள்ள வழிமுறைகளைப் பின்பற்றி, உங்கள் சான்றுகளைச் சேமிக்க `` IBMQ.save_account ('MY_TOKEN') `` முறையைப் பயன்படுத்தலாம்.

source: Updating your programs
ta_in: உங்கள் நிரல்களைப் புதுப்பித்தல்

source: When using the new IBM Q Experience v2 through the provider, access to backends is done via individual ``provider`` instances (as opposed to accessing them directly through the ``qiskit.IBMQ`` object as in previous versions), which allows for more granular control over the project you are using.
ta_in: வழங்குநர் மூலம் புதிய ஐபிஎம் கியூ எக்ஸ்பீரியன்ஸ் வி 2 ஐப் பயன்படுத்தும் போது, ​​பின்தளத்தில் அணுகல் தனிப்பட்ட `` provider`` நிகழ்வுகள் வழியாக செய்யப்படுகிறது (முந்தைய பதிப்புகளைப் போலவே `` qiskit.IBMQ`` பொருள் வழியாக அவற்றை நேரடியாக அணுகுவதற்கு மாறாக) நீங்கள் பயன்படுத்தும் திட்டத்தின் மீது மேலும் நுணுக்க கட்டுப்பாட்டுக்கு.

source: You can get a reference to the ``providers`` that you have access to using the ``IBMQ.providers()`` and ``IBMQ.get_provider()`` methods::
ta_in: `` IBMQ.providers () `` மற்றும் `` IBMQ.get_provider () `` முறைகள்:: ஐப் பயன்படுத்துவதற்கான அணுகல் உங்களுக்கு ``providers`` பற்றிய குறிப்பைப் பெறலாம்::

source: For convenience, ``IBMQ.load_account()`` and ``IBMQ.enable_account()`` will return a provider for the open access project, which is the default in the new IBM Q Experience v2.
ta_in: வசதிக்காக, `` IBMQ.load_account () `` மற்றும் `` IBMQ.enable_account () `` திறந்த அணுகல் திட்டத்திற்கான ஒரு வழங்குநரைத் தரும், இது புதிய IBM Q அனுபவம் v2 இல் இயல்புநிலையாகும்.

source: For example, the following program in previous versions::
ta_in: எடுத்துக்காட்டாக, முந்தைய பதிப்புக்களில் பின்வரும் நிரல்::

source: Would be equivalent to the following program in the current version::
ta_in: தற்போதைய பதிப்பில் பின்வரும் நிரலுக்கு சமமானது::

source: You can find more information and details in the `IBM Q Provider documentation <https://github.com/Qiskit/qiskit-ibmq-provider>`__.
ta_in: `IBM Q வழங்குநர் ஆவணத்தில் <https://github.com/Qiskit/qiskit-ibmq-provider>` __ இல் கூடுதல் தகவல்களையும் விவரங்களையும் காணலாம்.

source: The ``IBMQProvider`` supports connecting to the new version of the IBM Q API. Please note support for this version is still experimental :pull_ibmq-provider:`78`.
ta_in: `` IBMQProvider`` IBM Q API இன் புதிய பதிப்பை இணைக்க ஆதரிக்கிறது. இந்த பதிப்பிற்கான ஆதரவு இன்னும் சோதனைக்குரியது என்பதை நினைவில் கொள்க:pull_ibmq-provider: `78`.
