Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: The :attr:`~qiskit.circuit.QuantumCircuit.parameters` attribute of the :class:`~qiskit.circuit.QuantumCircuit` class no longer is returning a ``set``. Instead it returns a ``ParameterView`` object which implements all the methods that ``set`` offers (albeit deprecated). This was done to support a model that preserves name-sorted parameters. It should be fully compatible with any previous usage of the ``set`` returned by the :attr:`~qiskit.circuit.QuantumCircuit.parameters` attribute, except for where explicit type checking of a set was done.
ta_in: வர்க்கத்தின் :attr: `~ qiskit.circuit.QuantumCircuit.parameters` பண்புக்கூறு :class:` ~ qiskit.circuit.QuantumCircuit` வகுப்பு இனி ``set`` ஐத் தரவில்லை. அதற்கு பதிலாக இது ``ParameterView`` பொருளைத் தருகிறது, இது `` set`` சலுகைகள் (நீக்கப்பட்டிருந்தாலும்) அனைத்து முறைகளையும் செயல்படுத்துகிறது. பெயர் வரிசைப்படுத்தப்பட்ட அளவுருக்களைப் பாதுகாக்கும் மாதிரியை ஆதரிக்க இது செய்யப்பட்டது. ஒரு தொகுப்பின் வெளிப்படையான வகை சோதனை எங்கு செய்யப்பட்டது என்பதைத் தவிர :attr: `~ qiskit.circuit.QuantumCircuit.parameters` பண்புக்கூறு வழங்கிய ``set`` இன் முந்தைய பயன்பாட்டுடன் இது முழுமையாக ஒத்துப்போக வேண்டும்.

source: When running :func:`~qiskit.compiler.transpile` on a :class:`~qiskit.circuit.QuantumCircuit` with :meth:`~qiskit.circuit.QuantumCircuit.delay` instructions, the units will be converted to dt if the value of dt (sample time) is known to :func:`~qiskit.compiler.transpile`, either explicitly via the ``dt`` kwarg or via the :class:`~qiskit.providers.models.BackendConfiguration` for a ``Backend`` object passed in via the ``backend`` kwarg.
ta_in: இயங்கும் போது :func: `~ qiskit.compiler.transpile` ஒரு :class:` ~ qiskit.circuit.QuantumCircuit` உடன்:meth: `~ qiskit.circuit.QuantumCircuit.delay` அறிவுறுத்தல்கள், அலகுகள் dt ஆக மாற்றப்படும் dt (மாதிரி நேரம்) இன் மதிப்பு அறியப்படுகிறது :func: `~ qiskit.compiler.transpile`, வெளிப்படையாக` `dt`` குவார்க் வழியாக அல்லது :class:` ~ qiskit.providers.models.BackendConfiguration` வழியாக ``Backend`` பொருள் `` backend`` குவார்க் வழியாக சென்றது.

source: The interpretation of ``meas_map`` (which is an attribute of a :class:`~qiskit.providers.models.PulseBackendConfiguration` object or as the corresponding ``meas_map`` kwarg on the :func:`~qiskit.compiler.schedule`, :func:`~qiskit.compiler.assemble`, :func:`~qiskit.compiler.sequence`, or :func:`~qiskit.execute_function.execute` functions) has been updated to better match the true constraints of the hardware. The format of this data is a list of lists, where the items in the inner list are integers specifying qubit labels. For instance::
ta_in: ``meas_map`` இன் விளக்கம் (இது ஒரு வகுப்பின் பண்பு :class: `~ qiskit.providers.models.PulseBackendConfiguration` பொருள் அல்லது அதனுடன் தொடர்புடைய ``meas_map`` குவார்க் :func:` ~ qiskit.compiler. அட்டவணை` ,:func: `~ qiskit.compiler.assemble` ,:func:` ~ qiskit.compiler.afterence`, அல்லது :func: `~ qiskit.execute_function.execute` செயல்பாடுகள்) உண்மையான தடைகளுடன் சிறப்பாக பொருந்தும் வகையில் புதுப்பிக்கப்பட்டுள்ளது. வன்பொருள். இந்தத் தரவின் வடிவம் பட்டியல்களின் பட்டியல், உள் பட்டியலில் உள்ள உருப்படிகள் குவிட் லேபிள்களைக் குறிப்பிடும் முழு எண்களாகும். உதாரணமாக ::

source: Previously, the ``meas_map`` constraint was interpreted such that if one qubit was acquired (e.g. A), then all other qubits sharing a subgroup with that qubit (B and C) would have to be acquired at the same time and for the same duration. This constraint has been relaxed. One acquisition does not require more acquisitions. (If A is acquired, B and C do **not** need to be acquired.) Instead, qubits in the same measurement group cannot be acquired in a partially overlapping way -- think of the ``meas_map`` as specifying a shared acquisition resource (If we acquire A from ``t=1000`` to ``t=2000``, we cannot acquire B starting from ``1000<t<2000``). For example:
ta_in: முன்னதாக, ``meas_map`` கட்டுப்பாடு ஒரு குவிட் வாங்கப்பட்டால் (எ.கா. ஏ), பின்னர் அந்த குவிட் (பி மற்றும் சி) உடன் ஒரு துணைக்குழுவைப் பகிர்ந்து கொள்ளும் மற்ற அனைத்து குவிட்களும் ஒரே நேரத்தில் பெறப்பட வேண்டும், அதே காலம். இந்த தடை தளர்த்தப்பட்டுள்ளது. ஒரு கையகப்படுத்துதலுக்கு அதிக கையகப்படுத்துதல் தேவையில்லை. (A ஐப் பெற்றால், B மற்றும் C செய்ய ** தேவையில்லை **.) அதற்கு பதிலாக, ஒரே அளவீட்டுக் குழுவில் உள்ள குவிட்களை ஓரளவு ஒன்றுடன் ஒன்று பெற முடியாது - ``meas_map`` ஐக் குறிப்பிடுவதை நினைத்துப் பாருங்கள் பகிரப்பட்ட கையகப்படுத்தல் வளம் (```t = 1000`` முதல் ``t = 2000`` வரை A ஐப் பெற்றால்,``1000 <t <2000`` முதல் B ஐப் பெற முடியாது). உதாரணத்திற்கு:

source: Deprecation Notes
ta_in: தேய்மான குறிப்புகள்

source: Two new arguments have been added to :meth:`qiskit.dagcircuit.DAGNode.semantic_eq`, ``bit_indices1`` and ``bit_indices2``, which are expected to map the :class:`~qiskit.circuit.Bit` instances in each :class:`~qiskit.dagcircuit.DAGNode` to their index in ``qubits`` or ``clbits`` list of their respective :class:`~qiskit.dagcircuit.DAGCircuit`. During the deprecation period, these arguments are optional and when **not** specified the mappings will be automatically constructed based on the ``register`` and ``index`` properties of each :class:`~qiskit.circuit.Bit` instance. However, in a future release, they will be required arguments and the mapping will need to be supplied by the user.
ta_in: இரண்டு புதிய வாதங்கள் இதில் சேர்க்கப்பட்டுள்ளன:meth: `qiskit.dagcircuit.DAGNode.semantic_eq`,` `bit_indices1`` மற்றும்``bit_indices2``, இவை வரைபடத்தை எதிர்பார்க்கும் :class:`~ qiskit.circuit.Bit` நிகழ்வுகள் ஒவ்வொன்றிலும் :class: `q qiskit.dagcircuit.DAGNode` அவர்களின் குறியீட்டுக்கு` `qubits`` அல்லது``clbits`` அந்தந்த பட்டியலில் :class:` ~ qiskit.dagcircuit.DAGCircuit`. தேய்மான காலத்தில், இந்த வாதங்கள் விருப்பமானவை, ** குறிப்பிடப்படாத போது ** ஒவ்வொன்றின் ``register`` மற்றும் `` index`` பண்புகளின் அடிப்படையில் வரைபடங்கள் தானாகவே உருவாக்கப்படும் :class: `~ qiskit.circuit.Bit `உதாரணம். இருப்பினும், எதிர்கால வெளியீட்டில், அவை தேவைப்படும் வாதங்கள் மற்றும் மேப்பிங் பயனரால் வழங்கப்பட வேண்டும்.

source: The :mod:`~qiskit.pulse` builder functions:
ta_in: :mod:`~qiskit.pulse` பில்டர் செயல்பாடுகள்:

source: are deprecated and will be removed in a future release. These functions are unified into :py:func:`qiskit.pulse.call` which should be used instead.
ta_in: நீக்கப்பட்டன மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். இந்த செயல்பாடுகள் ஒன்றிணைக்கப்படுகின்றன:py:func:`qiskit.pulse.call`, அதற்கு பதிலாக பயன்படுத்தப்பட வேண்டும்.

source: The :class:`qiskit.pulse.Schedule` method :py:meth:`qiskit.pulse.Schedule.flatten` method is deprecated and will be removed in a future release. Instead you can use the :py:func:`qiskit.pulse.transforms.flatten` function which will perform the same operation.
ta_in: :class:`qiskit.pulse.Schedule` முறை:py:meth:` qiskit.pulse.Schedule.flatten` முறை நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக நீங்கள்:py:func:`qiskit.pulse.transforms.flatten` செயல்பாட்டைப் பயன்படுத்தலாம், இது ஒரே செயல்பாட்டைச் செய்யும்.

source: The :meth:`~qiskit.pulse.channels.Channel.assign_parameters` for the following classes:
ta_in: :meth: `~ qiskit.pulse.channels.Channel.assign_parameters` பின்வரும் வகுப்புகளுக்கு:

source: and all their subclasses is now deprecated and will be removed in a future release. This functionality has been subsumed :py:class:`~qiskit.pulse.ScheduleBlock` which is the future direction for constructing parameterized pulse programs.
ta_in: அவற்றின் அனைத்து துணைப்பிரிவுகளும் இப்போது நீக்கப்பட்டன, மேலும் அவை எதிர்கால வெளியீட்டில் அகற்றப்படும். இந்த செயல்பாடு உட்பட்டது: py: class: `~ qiskit.pulse.ScheduleBlock` இது அளவுருவாக்கப்பட்ட துடிப்பு நிரல்களை உருவாக்குவதற்கான எதிர்கால திசையாகும்.

source: The :attr:`~qiskit.pulse.channels.Channel.parameters` attribute for the following clasess:
ta_in: பின்வரும் மோதலுக்கான:attr: `~ qiskit.pulse.channels.Channel.parameters` பண்புக்கூறு:

source: is deprecated and will be removed in a future release. This functionality has been subsumed :py:class:`~qiskit.pulse.ScheduleBlock` which is the future direction for constructing parameterized pulse programs.
ta_in: நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். இந்த செயல்பாடு உட்பட்டது: py: class: `~ qiskit.pulse.ScheduleBlock` இது அளவுருவாக்கப்பட்ட பல்ஸ் நிரல்களை உருவாக்குவதற்கான எதிர்கால திசையாகும்.

source: Python 3.6 support has been deprecated and will be removed in a future release. When support is removed you will need to upgrade the Python version you're using to Python 3.7 or above.
ta_in: பைதான் 3.6 ஆதரவு நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். ஆதரவு நீக்கப்படும் போது நீங்கள் பயன்படுத்தும் பைதான் பதிப்பை பைதான் 3.7 அல்லது அதற்கு மேல் மேம்படுத்த வேண்டும்.

source: Two :class:`~qiskit.circuit.QuantumCircuit` methods :meth:`~qiskit.circuit.QuantumCircuit.combine` and :meth:`~qiskit.circuit.QuantumCircuit.extend` along with their corresponding Python operators ``+`` and ``+=`` are deprecated and will be removed in a future release. Instead the :class:`~qiskit.circuit.QuantumCircuit` method :meth:`~qiskit.circuit.QuantumCircuit.compose` should be used. The :meth:`~qiskit.circuit.QuantumCircuit.compose` method allows more flexibility in composing two circuits that do not have matching registers. It does not, however, automatically add qubits/clbits unlike the deprecated methods. To add a circuit on new qubits/clbits, the :meth:`qiskit.circuit.QuantumCircuit.tensor` method can be used. For example::
ta_in: இரண்டு:class: `~ qiskit.circuit.QuantumCircuit` முறைகள் :meth:` ~ qiskit.circuit.QuantumCircuit.combine` மற்றும்:meth: `~ qiskit.circuit.QuantumCircuit.extend` உடன் தொடர்புடைய பைதான் ஆபரேட்டர்கள்` `+` `மற்றும்` `+ =` `நீக்கப்பட்டன, அவை எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக :class: `~ qiskit.circuit.QuantumCircuit` முறை :meth:` ~ qiskit.circuit.QuantumCircuit.compose` ஐப் பயன்படுத்த வேண்டும். பொருந்தக்கூடிய பதிவேடுகள் இல்லாத இரண்டு சுற்றுகளை உருவாக்குவதில் :meth: `~ qiskit.circuit.QuantumCircuit.compose` முறை அதிக நெகிழ்வுத்தன்மையை அனுமதிக்கிறது. இருப்பினும், நீக்கப்பட்ட முறைகளைப் போலல்லாமல் இது தானாகவே குவிட்ஸ் / கிளிப்பிட்களை சேர்க்காது. புதிய குவிட்ஸ் / கிளிப்பிட்களில் ஒரு சுற்று சேர்க்க,:meth: `qiskit.circuit.QuantumCircuit.tensor` முறையைப் பயன்படுத்தலாம். உதாரணத்திற்கு::

source: Support for passing :class:`~qiskit.circuit.Qubit` instances to the ``qubits`` kwarg of the :meth:`qiskit.transpiler.InstructionDurations.get` method has been deprecated and will be removed in a future release. Instead, you should call the :meth:`~qiskit.transpiler.InstructionDurations.get` method with the integer indices of the desired qubits.
ta_in: தேர்ச்சிக்கான ஆதரவு :class: `q qiskit.circuit.Qubit` இன்` `க்விட்ஸ்`` குவார்க்கின் :meth:` qiskit.transpiler.InstructionDurations.get` முறை நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக, நீங்கள் விரும்பிய மெத்தைகளை :meth: `qiskit.transpiler.InstructionDurations.get` முறையை விரும்பிய குவிட்களின் முழு குறியீடுகளுடன் அழைக்க வேண்டும்.

source: Using ``@`` (``__matmul__``) for invoking the ``compose`` method of ``BaseOperator`` subclasses (eg :class:`~qiskit.quantum_info.Operator`) is deprecated and will be removed in a future release. The :meth:`qiskit.quantum_info.Operator.compose` method can be used directly or also invoked using the ``&`` (``__and__``) operator.
ta_in: ``BaseOperator`` துணைப்பிரிவுகளின் (eg :class:`~qiskit.quantum_info.Operator`) ``compose`` முறையைத் தொடங்க ``@`` (``__matmul__``) ஐப் பயன்படுத்துதல் நீக்கப்பட்டது, மேலும் அவை அகற்றப்படும் எதிர்கால வெளியீடு. :meth:`qiskit.quantum_info.Operator.compose` முறையை நேரடியாகப் பயன்படுத்தலாம் அல்லது``&``(``__and__``) ஆபரேட்டரைப் பயன்படுத்தி பயன்படுத்தலாம்.

source: Using ``*`` (``__mul__``) for calling the :meth:`~qiskit.quantum_info.Operator.dot` method of ``BaseOperator`` subclasses (eg :class:`qiskit.quantum_info.Operator`) is deprecated and will be removed in a future release. Instead you can just call the :meth:`~qiskit.quantum_info.Operator.dot` directly.
ta_in: அழைப்பதற்கு `` * `` (``__mul__``) ஐப் பயன்படுத்துதல் :meth: `~ qiskit.quantum_info.Operator.dot ``BaseOperator`` துணைப்பிரிவுகளின் முறை (எ.கா :class:` qiskit.quantum_info.Operator`) நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக :meth: `~ qiskit.quantum_info.Operator.dot` ஐ நேரடியாக அழைக்கலாம்.

source: Using ``@`` (``__matmul__``) for invoking the :meth:`~qiskit.quantum_info.Statevector.evolve` method of the :class:`qiskit.quantum_info.Statevector` and :class:`qiskit.quantum_info.DensityMatrix` classes is deprecated and will be removed in a future release.. The ``evolve`` method can be used directly or also invoked using the ``&`` (``__and__``) operator.
ta_in: ` `@` `(` `__matmul__``) ஐப் பயன்படுத்துத் தொடங்கப்படும் :class:`qiskit.quantum_info.Statevector மற்றும் :class:`qiskit.quantum_info.DensityMatrix` வகுப்புகளின் முறை :meth:`~qiskit.quantum_info.Statevector.evolve` நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும் .. ``evolve`` முறையை நேரடியாகப் பயன்படுத்தலாம் அல்லது ``&`` (``__and__``) ஆபரேட்டரைப் பயன்படுத்தி பயன்படுத்தலாம்.

source: The ``qiskit.pulse.schedule.ParameterizedSchedule`` class has been deprecated and will be removed in a future release. Instead you can directly parameterize pulse :class:`~qiskit.pulse.Schedule` objects with a :class:`~qiskit.circuit.Parameter` object, for example::
ta_in: `` Qiskit.pulse.schedule.ParameterizedSchedule`` வகுப்பு நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக நீங்கள் துடிப்பு :class: `~ qiskit.pulse.Schedule` பொருள்களை ஒரு :class:` ~ qiskit.circuit.Parameter` பொருளுடன் நேரடியாக அளவுருவாக்கலாம், எடுத்துக்காட்டாக::

source: The :class:`qiskit.pulse.ScheduleComponent` class in the :mod:`qiskit.pulse` module has been deprecated and will be removed in a future release. Its usage should be replaced either using a :class:`qiskit.pulse.Schedule` or :class:`qiskit.pulse.Instruction` directly. Additionally, the primary purpose of the ``ScheduleComponent`` class was as a common base class for both :class:`~qiskit.pulse.Schedule` and :class:`~qiskit.pulse.Instruction` for any place that was explicitly type checking or documenting accepting a ``ScheduleComponent`` input should be updated to accept :class:`~qiskit.pulse.Instruction` or :class:`~qiskit.pulse.Schedule`.
ta_in: :mod: `qiskit.pulse` தொகுதியில் உள்ள :class:` qiskit.pulse.ScheduleComponent` வகுப்பு நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். இதன் பயன்பாடு ஒரு :class: `qiskit.pulse.Schedule` அல்லது :class:` qiskit.pulse.Instruction` ஐ பயன்படுத்தி நேரடியாக மாற்றப்பட வேண்டும். கூடுதலாக, ``ScheduleComponent`` வகுப்பின் முதன்மை நோக்கம் இருவருக்கும் பொதுவான அடிப்படை வகுப்பாக இருந்தது :class: `~ qiskit.pulse.Schedule` மற்றும் :class:` ~ qiskit.pulse.Instruction` வெளிப்படையாக எந்த இடத்திற்கும் `` அட்டவணைக் கூறு`` உள்ளீட்டை ஏற்றுக்கொள்வதை சரிபார்க்கவும் அல்லது ஆவணப்படுத்தவும் வகை :class: `~ qiskit.pulse.Instruction` அல்லது :class:` ~ qiskit.pulse.Schedule`.

source: The JSON Schema files and usage for the IBMQ API payloads are deprecated and will be removed in a future release. This includes everything under the :mod:`qiskit.schemas` module and the :mod:`qiskit.validation` module. This also includes the ``validate`` kwargs for :meth:`qiskit.qobj.QasmQobj.to_dict` and :meth:`qiskit.qobj.QasmQobj.to_dict` along with the module level fastjsonschema validators in :mod:`qiskit.qobj` (which do not raise a deprecation warning). The schema files have been moved to the `Qiskit/ibmq-schemas <https://github.com/Qiskit/ibmq-schemas>`__ repository and those should be treated as the canonical versions of the API schemas. Moving forward only those schemas will recieve updates and will be used as the source of truth for the schemas. If you were relying on the schemas bundled in qiskit-terra you should update to use that repository instead.
ta_in: JSON ஸ்கீமா கோப்புகள் மற்றும் IBMQ API பேலோடுகளுக்கான பயன்பாடு நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். இதில் :mod: `qiskit.schemas` தொகுதி மற்றும் :mod:` qiskit.validation` தொகுதி ஆகியவற்றின் கீழ் உள்ள அனைத்தும் அடங்கும். :meth: `qiskit.qobj.QasmQobj.to_dict` மற்றும் :meth:` qiskit.qobj.QasmQobj.to_dict` ஆகியவற்றுக்கான ``validate`` குவார்க்குகளும் இதில் அடங்கும் :mod: `qiskit. qobj` (இது ஒரு நீக்குதல் எச்சரிக்கையை எழுப்பாது). ஸ்கீமா கோப்புகள் `Qiskit / ibmq-schemas <https://github.com/Qiskit/ibmq-schemas>` __ களஞ்சியத்திற்கு நகர்த்தப்பட்டுள்ளன, அவை API திட்டங்களின் நியமன பதிப்புகளாக கருதப்பட வேண்டும். அந்தத் திட்டங்களை மட்டுமே முன்னோக்கி நகர்த்துவது புதுப்பிப்புகளைப் பெறும் மற்றும் திட்டங்களுக்கான உண்மையின் ஆதாரமாகப் பயன்படுத்தப்படும். கிஸ்கிட்-டெர்ராவில் தொகுக்கப்பட்ட திட்டங்களை நீங்கள் நம்பியிருந்தால், அதற்கு பதிலாக அந்த களஞ்சியத்தைப் பயன்படுத்த புதுப்பிக்க வேண்டும்.

source: The :mod:`qiskit.util` module has been deprecated and will be removed in a future release. It has been replaced by :mod:`qiskit.utils` which provides the same functionality and will be expanded in the future. Note that no ``DeprecationWarning`` will be emitted regarding this deprecation since it was not feasible on Python 3.6.
ta_in: :mod: `qiskit.util` தொகுதி நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். இதற்கு பதிலாக :mod: `qiskit.utils` கொண்டுவரப்பட்டுள்ளது, இது அதே செயல்பாட்டை வழங்குகிறது மற்றும் எதிர்காலத்தில் விரிவாக்கப்படும். பைதான் 3.6 இல் இது சாத்தியமில்லை என்பதால் இந்த தேய்மானம் தொடர்பாக `` நீக்குதல் எச்சரிக்கை`` வெளியிடப்படாது என்பதை நினைவில் கொள்க.

source: The :class:`~qiskit.transpiler.passes.CXDirection` transpiler pass in the :mod:`qiskit.transpiler.passes` module has been deprecated and will be removed in a future release. Instead the :class:`~qiskit.transpiler.GateDirection` should be used. It behaves identically to the :class:`~qiskit.transpiler.passes.CXDirection` except that it now also supports transforming a circuit with :class:`~qiskit.circuit.library.ECRGate` gates in addition to :class:`~qiskit.circuit.library.CXGate` gates.
ta_in: :class: `qiskit.transpiler.passes.CXDirection` டிரான்ஸ்பைலர் பாஸ் :mod:` qiskit.transpiler.passes` தொகுதிக்கூறு நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக :class: `~ qiskit.transpiler.GateDirection` ஐப் பயன்படுத்த வேண்டும். இது :class: `~ qiskit.transpiler.passes.CXDirection` உடன் ஒரே மாதிரியாக செயல்படுகிறது: தவிர, இப்போது ஒரு சுற்றுவட்டத்தை மாற்றுவதை ஆதரிக்கிறது :class:` ~ qiskit.circuit.library.ECRGate` வாயில்கள் கூடுதலாக :class: `~ qiskit.circuit.library.CXGate` வாயில்கள்.

source: The :class:`~qiskit.transpiler.passes.CheckCXDirection` transpiler pass in the :mod:`qiskit.transpiler.passes` module has been deprecated and will be removed in a future release. Instead the :class:`~qiskit.transpiler.CheckGateDirection` pass should be used. It behaves identically to the :class:`~qiskit.transpiler.passes.CheckCXDirection` except that it now also supports checking the direction of all 2-qubit gates, not just :class:`~qiskit.circuit.library.CXGate` gates.
ta_in: :class: `~ qiskit.transpiler.passes.CheckCXDirection` டிரான்ஸ்பைலர் பாஸ் :mod:` qiskit.transpiler.passes` தொகுதிக்கூறு நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக :class: `~ qiskit.transpiler.CheckGateDirection` பாஸ் பயன்படுத்தப்பட வேண்டும். இது :class: `~ qiskit.transpiler.passes.CheckCXDirection` க்கு ஒத்ததாக செயல்படுகிறது, தவிர இப்போது 2-குவிட் வாயில்களின் திசையை சரிபார்க்கவும் இது துணைபுரிகிறது :class:` ~ qiskit.circuit.library.CXGate` வாயில்கள் .

source: The :class:`~qiskit.circuit.library.WeightedAdder` method :meth:`~qiskit.circuit.library.WeightedAdder.num_ancilla_qubits` is deprecated and will be removed in a future release. It has been replaced with the :attr:`qiskit.circuit.library.WeightedAdder.num_ancillas` attribute which is consistent with other circuit libraries' APIs.
ta_in: :class: `~ qiskit.circuit.library.WeightedAdder` முறை :meth:` ~ qiskit.circuit.library.WeightedAdder.num_ancilla_qubits` நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். இது மாற்றப்பட்டுள்ளது :attr: `qiskit.circuit.library.WeightedAdder.num_ancillas` பண்புக்கூறு இது மற்ற சுற்று நூலகங்களின் API களுடன் ஒத்துப்போகிறது.

source: The following legacy methods of the :class:`qiskit.quantum_info.Pauli` class have been deprecated. See the method documentation for replacement use in the updated Pauli class.
ta_in: :class:`qiskit.quantum_info.Pauli` வகுப்பின் பின்வரும் மரபு முறைகள் நீக்கப்பட்டன. புதுப்பிக்கப்பட்ட பவுலி வகுப்பில் மாற்று பயன்பாட்டிற்கான முறை ஆவணங்களைக் காண்க.

source: Using a ``list`` or ``numpy.ndarray`` as the ``channel`` or ``target`` argument for the :func:`qiskit.quantum_info.process_fidelity`, :func:`qiskit.quantum_info.average_gate_fidelity`, :func:`qiskit.quantum_info.gate_error`, and :func:`qiskit.quantum_info.diamond_norm` functions has been deprecated and will not be supported in a future release. The inputs should instead be a :class:`~qiskit.circuit.Gate` or a ``BaseOperator`` subclass object (eg. :class:`~qiskit.quantum_info.Operator`, :class:`~qiskit.quantum_info.Choi`, etc.)
ta_in: ``list`` அல்லது ``numpy.ndarray`` ஐ ``channel`` அல்லது ``target`` வாதமாகப் பயன்படுத்துதல் :func: `qiskit.quantum_info.process_fidelity` ,:func:` qiskit.quantum_info. average_gate_fidelity` ,:func: `qiskit.quantum_info.gate_error`, மற்றும் :func:` qiskit.quantum_info.diamond_norm` செயல்பாடுகள் நீக்கப்பட்டன, எதிர்கால வெளியீட்டில் ஆதரிக்கப்படாது. உள்ளீடுகள் அதற்கு பதிலாக ஒரு :class: `~ qiskit.circuit.Gate` அல்லது` `BaseOperator`` துணைப்பிரிவு பொருள் (எ.கா. :class:` ~ qiskit.quantum_info.Operator` ,:class: `~ qiskit.quantum_info.Choi`, முதலியன)

source: Accessing references from :class:`~qiskit.circuit.Qubit` and :class:`~qiskit.circuit.Clbit` instances to their containing registers via the :attr:`~qiskit.circuit.Qubit.register` or :attr:`~qiskit.circuit.Qubit.index` properties has been deprecated and will be removed in a future release. Instead, :class:`~qiskit.circuit.Register` objects can be queried to find the :class:`~qiskit.circuit.Bit` objects they contain.
ta_in: குறிப்புகளை அணுகல் :class: `~ qiskit.circuit.Qubit` மற்றும் :class:` ~ qiskit.circuit.Clbit` நிகழ்வுகள் அவற்றின் பதிவேடுகளுக்கு :attr: `q qiskit.circuit.Qubit.register` அல்லது :attr: `~ qiskit.circuit.Qubit.index` பண்புகள் நீக்கப்பட்டன, மேலும் அவை எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக ,:class: `~ qiskit.circuit.Register` பொருள்களைக் கண்டுபிடிக்க வினவலாம் :class:` ~ qiskit.circuit.Bit` பொருள்கள் அவற்றில் உள்ளன.

source: The current functionality of the :func:`qiskit.visualization.pulse_drawer` function is deprecated and will be replaced by :func:`qiskit.visualization.pulse_drawer_v2` (which is not backwards compatible) in a future release.
ta_in: எதிர்கால வெளியீட்டில் :func: `qiskit.visualization.pulse_drawer` செயல்பாட்டின் தற்போதைய செயல்பாடு நீக்கப்பட்டது மற்றும் மாற்றப்படும் :func:` qiskit.visualization.pulse_drawer_v2` (இது பின்னோக்கி பொருந்தாது).
