Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/release_notes.po
Languages: ta_in

source: The marshmallow schema classes in :mod:`qiskit.providers.models` have been removed since they are no longer used by the BackendObjects.
ta_in: மார்ஷ்மெல்லோ ஸ்கீமா வகுப்புகள்:mod: `qiskit.providers.models` அவை இனி பின்தளத்தில் பொருள்கள் பயன்படுத்தாததால் அகற்றப்பட்டுள்ளன.

source: The output of the ``to_dict()`` method for the classes in :mod:`qiskit.providers.models` is no longer in a format for direct JSON serialization. Depending on the content contained in instances of these class there may be numpy arrays and/or complex numbers in the fields of the dict. If you're JSON serializing the output of the to_dict methods you should ensure your JSON encoder can handle numpy arrays and complex numbers. This includes:
ta_in: வகுப்புகளில் `` to_dict () `` முறையின் வெளியீடு :mod: `qiskit.providers.models` இனி நேரடி JSON சீரியலைசேஷனுக்கான வடிவமைப்பில் இல்லை. இந்த வகுப்பின் நிகழ்வுகளில் உள்ள உள்ளடக்கத்தைப் பொறுத்து, கட்டளைகளின் புலங்களில் எண்ணற்ற வரிசைகள் மற்றும் / அல்லது சிக்கலான எண்கள் இருக்கலாம். To_dict முறைகளின் வெளியீட்டை நீங்கள் JSON வரிசைப்படுத்துகிறீர்கள் என்றால், உங்கள் JSON குறியாக்கி எண்ணற்ற வரிசைகள் மற்றும் சிக்கலான எண்களைக் கையாள முடியும் என்பதை உறுதிப்படுத்த வேண்டும். இதில் பின்வருவன அடங்கும்:

source: :meth:`qiskit.providers.models.UchannelLO.to_dict`
ta_in: :meth:` qiskit.preers.models.Uchannello.to_dict `

source: :meth:`qiskit.providers.models.PulseDefaults.to_dict`
ta_in: :meth:` qiskit.preers.models.PulseDefaults.to_dict `

source: :meth:`qiskit.providers.models.JobStatus.to_dict`
ta_in: :meth:` qiskit.preers.models.JobStatus.to_dict `

source: :meth:`qiskit.providers.models.Nduv.to_dict`
ta_in: :meth:` qiskit.preers.models.Uchannello.to_dict `

source: :meth:`qiskit.providers.models.Gate.to_dict`
ta_in: :meth:` qiskit.preers.models.Uchannello.to_dict `

source: The :meth:`qiskit.dagcircuit.DAGCircuit.compose` method now takes a list of qubits/clbits that specify the positional order of bits to compose onto. The dictionary-based method of mapping using the ``edge_map`` argument is deprecated and will be removed in a future release.
ta_in: :meth: `qiskit.dagcircuit.DAGCircuit.compose` முறை இப்போது பிட்ஸின் நிலை வரிசையை குறிப்பிடும் குவிட்ஸ் / கிளிப்பிட்களின் பட்டியலை எடுக்கிறது. ``edge_map`` வாதத்தைப் பயன்படுத்தி அகராதி அடிப்படையிலான மேப்பிங் முறை நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும்.

source: The ``combine_into_edge_map()`` method for the :class:`qiskit.transpiler.Layout` class has been deprecated and will be removed in a future release. Instead, the new method :meth:`~qiskit.transpiler.Layout.reorder_bits` should be used to reorder a list of virtual qubits according to the layout object.
ta_in: :class: `qiskit.transpiler.Layout` வகுப்புக்கான` `comb_into_edge_map ()` `முறை நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக, புதிய முறை:meth: `~ qiskit.transpiler.Layout.reorder_bits` என்பது தளவமைப்பு பொருளின் படி மெய்நிகர் குவிட்டுகளின் பட்டியலை மறுவரிசைப்படுத்த பயன்படுத்தப்பட வேண்டும்.

source: Passing a :class:`qiskit.pulse.ControlChannel` object in via the parameter ``channel`` for the :class:`qiskit.providers.models.PulseBackendConfiguration` method :meth:`~qiskit.providers.models.PulseBackendConfiguration.control` has been deprecated and will be removed in a future release. The ``ControlChannel`` objects are now generated from the backend configuration ``channels`` attribute which has the information of all channels and the qubits they operate on. Now, the method :meth:`~qiskit.providers.models.PulseBackendConfiguration.control` is expected to take the parameter ``qubits`` of the form ``(control_qubit, target_qubit)`` and type ``list`` or ``tuple``, and returns a list of control channels.
ta_in: ஒரு:class: `qiskit.pulse.ControlChannel` பொருளை``channel`` அளவுரு வழியாக:class:` qiskit.providers.models.PulseBackendConfiguration` முறை :meth: `qiskit.providers.models.PulseBackendConfiguration. கட்டுப்பாடு` நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். ``ControlChannel`` பொருள்கள் இப்போது பின்தளத்தில் உள்ளமைவு ``channels`` பண்புக்கூறிலிருந்து உருவாக்கப்படுகின்றன, அவை எல்லா சேனல்களின் தகவல்களையும் அவை செயல்படும் வினாடிகளையும் கொண்டுள்ளது. இப்போது, ​​முறை:meth: `~ qiskit.providers.models.PulseBackendConfiguration.control` வடிவத்தின் ``qubits`` அளவுருவை ``(control_qubit, target_qubit)`` க்யூபிட்ஸ்எடுத்து ``list`` அல்லது தட்டச்சு செய்க. `` tuple``, மற்றும் கட்டுப்பாட்டு சேனல்களின் பட்டியலை வழங்குகிறது.

source: The ``AND`` and ``OR`` methods of :class:`qiskit.circuit.QuantumCircuit` are deprecated and will be removed in a future release. Instead you should use the circuit library boolean logic classes :class:`qiskit.circuit.library.AND` amd :class:`qiskit.circuit.library.OR` and then append those objects to your class. For example::
ta_in: வர்க்கத்தின் `` AND`` மற்றும் `` OR`` முறைகள் :class: `qiskit.circuit.QuantumCircuit` நீக்கப்பட்டன, அவை எதிர்கால வெளியீட்டில் அகற்றப்படும். அதற்கு பதிலாக நீங்கள் சுற்று நூலக பூலியன் தர்க்க வகுப்புகளைப் பயன்படுத்த வேண்டும்:class: `qiskit.circuit.library.AND` amd :class:` qiskit.circuit.library.OR` பின்னர் அந்த பொருட்களை உங்கள் வகுப்பில் சேர்க்கவும். உதாரணத்திற்கு::

source: The ``qiskit.extensions.standard`` module is deprecated and will be removed in a future release. The gate classes in that module have been moved to :mod:`qiskit.circuit.library.standard_gates`.
ta_in: ``Qiskit.extensions.standard`` தொகுதி நீக்கப்பட்டது மற்றும் எதிர்கால வெளியீட்டில் அகற்றப்படும். அந்த தொகுதியில் உள்ள கேட் வகுப்புகள்:mod: `qiskit.circuit.library.standard_gates` க்கு நகர்த்தப்பட்டுள்ளன.

source: The :class:`qiskit.circuit.QuantumCircuit` methods :meth:`~qiskit.circuit.QuantumCircuit.inverse`, :meth:`~qiskit.circuit.QuantumCircuit.mirror` methods, as well as the ``QuantumCircuit.data`` setter would generate an invalid circuit when used on a parameterized circuit instance. This has been resolved and these methods should now work with a parameterized circuit. Fixes `#4235 <https://github.com/Qiskit/qiskit-terra/issues/4235>`_
ta_in: :class: `qiskit.circuit.QuantumCircuit` முறைகள்:meth:` ~ qiskit.circuit.QuantumCircuit.inverse` ,:meth: `~ qiskit.circuit.QuantumCircuit.mirror` முறைகள், அத்துடன்` `QuantumCircuit.data `` அளவுருப்படுத்தப்பட்ட சுற்று நிகழ்வில் பயன்படுத்தும்போது செட்டர் தவறான சுற்றுவட்டத்தை உருவாக்கும். இது தீர்க்கப்பட்டது, இந்த முறைகள் இப்போது அளவுருவாக்கப்பட்ட சுற்றுடன் செயல்பட வேண்டும். திருத்தங்கள் `# 4235 <https://github.com/Qiskit/qiskit-terra/issues/4235>` _

source: Previously when creating a controlled version of a standard qiskit gate if a ``ctrl_state`` was specified a generic ``ControlledGate`` object would be returned whereas without it a standard qiskit controlled gate would be returned if it was defined. This PR allows standard qiskit controlled gates to understand ``ctrl_state``.
ta_in: முன்னதாக ஒரு நிலையான கிஸ்கிட் வாயிலின் கட்டுப்படுத்தப்பட்ட பதிப்பை உருவாக்கும் போது, ​​``ctrl_state`` ஒரு பொதுவான ``ControlledGate`` பொருள் குறிப்பிடப்பட்டால், அது இல்லாமல் ஒரு நிலையான கிஸ்கிட் கட்டுப்படுத்தப்பட்ட கேட் திருப்பித் தரப்படும். இந்த பிஆர் நிலையான கிஸ்கிட் கட்டுப்படுத்தப்பட்ட வாயில்களை `` ctrl_state`` புரிந்துகொள்ள அனுமதிக்கிறது.

source: Additionally, this PR fixes what might be considered a bug where setting the ``ctrl_state`` of an already controlled gate would assume the specified state applied to the full control width instead of the control qubits being added. For instance,::
ta_in: கூடுதலாக, ஏற்கனவே கட்டுப்படுத்தப்பட்ட வாயிலின் ``ctrl_state`` ஐ அமைப்பது ஒரு கட்டுப்பாட்டு பிழைகள் சேர்க்கப்படுவதற்கு பதிலாக முழு கட்டுப்பாட்டு அகலத்திற்கும் பயன்படுத்தப்படும் குறிப்பிட்ட நிலையை கருதுகிறது. உதாரணமாக,::

source: would apply ``ctrl_state`` to all three control qubits instead of just the two control qubits being added.
ta_in: சேர்க்கப்படும் இரண்டு கட்டுப்பாட்டு வினாடிகளுக்கு பதிலாக மூன்று கட்டுப்பாட்டு வினாடிகளுக்கும் `` ctrl_state`` பொருந்தும்.

source: Fixed a bug in :func:`~qiskit.quantum_info.random_clifford` that stopped it from sampling the full Clifford group. Fixes `#4271 <https://github.com/Qiskit/qiskit-terra/issues/4271>`_
ta_in: இதில் ஒரு பிழை சரி செய்யப்பட்டது:func: `~ qiskit.quantum_info.random_clifford` இது முழு கிளிஃபோர்டு குழுவையும் மாதிரியாக்குவதைத் தடுத்தது. திருத்தங்கள் `# 4271 <https://github.com/Qiskit/qiskit-terra/issues/4271>` _

source: The :class:`qiskit.circuit.Instruction` method :meth:`qiskit.circuit.Instruction.is_parameterized` method had previously returned ``True`` for any ``Instruction`` instance which had a :class:`qiskit.circuit.Parameter` in any element of its ``params`` array, even if that ``Parameter`` had been fully bound. This has been corrected so that ``.is_parameterized`` will return ``False`` when the instruction is fully bound.
ta_in: வர்க்கம்: `qiskit.circuit.Instruction` முறை: மெத்:` qiskit.circuit.Instruction.is_parameterized` முறை இதற்கு முன்னர் `` அறிவுறுத்தல்`` எந்தவொரு `` அறிவுறுத்தலுக்கும்` `: வகுப்பு:` கிஸ்கிட். சுற்று. அளவுரு` அதன் `` அளவுருக்கள்`` வரிசையின் எந்த உறுப்புகளிலும், அந்த `` அளவுரு`` முழுமையாக பிணைக்கப்பட்டிருந்தாலும் கூட. இது சரி செய்யப்பட்டுள்ளது, இதனால் அறிவுறுத்தல் முழுமையாக பிணைக்கப்படும்போது `` .is_parameterized`` `` தவறானது``

source: :meth:`qiskit.circuit.ParameterExpression.subs` had not correctly detected some cases where substituting parameters would result in a two distinct :class:`~qiskit.circuit.Parameters` objects in an expression with the same name. This has been corrected so a ``CircuitError`` will be raised in these cases.
ta_in: :meth: `qiskit.circuit.ParameterExpression.subs` சில அளவுருக்களை மாற்றியமைக்கும் இரண்டு நிகழ்வுகளை சரியாகக் கண்டறியவில்லை:class:` ~ qiskit.circuit.Parameters` பொருள்கள் ஒரே பெயரில் ஒரு வெளிப்பாட்டில். இது சரி செய்யப்பட்டுள்ளது, எனவே இந்த நிகழ்வுகளில் `` CircuitError`` எழுப்பப்படும்.

source: Improve performance of :class:`qiskit.quantum_info.Statevector` and :class:`qiskit.quantum_info.DensityMatrix` for low-qubit circuit simulations by optimizing the class ``__init__`` methods. Fixes `#4281 <https://github.com/Qiskit/qiskit-terra/issues/4281>`_
ta_in: வர்க்கத்தின் ``__init__`` முறைகளை மேம்படுத்துவதன் மூலம் குறைந்த-குவிட் சர்க்யூட் சிமுலேஷன்களுக்கான:class: `qiskit.quantum_info.Statevector` மற்றும் :class:` qiskit.quantum_info.DensityMatrix` இன் செயல்திறனை மேம்படுத்தவும். திருத்தங்கள் `# 4281 <https://github.com/Qiskit/qiskit-terra/issues/4281>` _

source: The function :func:`qiskit.compiler.transpile` now correctly handles when the parameter ``basis_gates`` is set to ``None``. This will allow any gate in the output tranpiled circuit, including gates added by the transpilation process. Note that using this parameter may have some unintended consequences during optimization. Some transpiler passes depend on having a ``basis_gates`` set. For example, :class:`qiskit.transpiler.passes.Optimize1qGates` only optimizes the chains of u1, u2, and u3 gates and without ``basis_gates`` it is unable to unroll gates that otherwise could be optimized:
ta_in: The function :func:` qiskit.compiler.transpile ` now correctly handles when the parameter ` basis_ gates ` s set ` `. இது வெளியீட்டில் எந்த வாயிலையும் அனுமதிக்கும், வெளியீட்டுச் சுற்றுச்சூழல் (transpilation) நடைமுறையில் சேர்க்கப்பட்ட வாயுக்கள் சேர்க்கும். இந்த அளபுருக்களைப் பயன்படுத்தி ஒப்பிடுகையில் சில ஆதாரமான விளைவுகளைக் கொண்டிருக்கலாம் என்று குறிக்கவும். சில மின்சார கடவுச்சொல் ` ` basis_ வாயு ` ` அமைக்கிறது. உதாரணமாக, :class:` qiskit.transpiler.passes.Optimize1qGates ` only optimizes the chains the chains of u1, u2, and u3 gates and without ` basis_gates ` ` it is unable to unroll gates that otherwise could be optimized:

source: Fixes `#3017 <https://github.com/Qiskit/qiskit-terra/issues/3017>`_
ta_in: திருத்தங்கள் `# 3017 <https://github.com/Qiskit/qiskit-terra/issues/3017>` _

source: The objects in :mod:`qiskit.providers.models` which were previously constructed using the marshmallow library have been refactored to not depend on marshmallow. This includes:
ta_in: இதில் உள்ள பொருள்கள்:mod: `qiskit.providers.models` முன்பு மார்ஷ்மெல்லோ நூலகத்தைப் பயன்படுத்தி கட்டப்பட்டவை மார்ஷ்மெல்லோவைச் சார்ந்து இருக்காதபடி மறுசீரமைக்கப்பட்டுள்ளன. இதில் பின்வருவன அடங்கும்:

source: These should be drop-in replacements without any noticeable change but specifics inherited from marshmallow may not work. Please file issues for any incompatibilities found.
ta_in: எந்தவொரு குறிப்பிடத்தக்க மாற்றமும் இல்லாமல் இவை டிராப்-இன் மாற்றாக இருக்க வேண்டும், ஆனால் மார்ஷ்மெல்லோவிலிருந்து பெறப்பட்ட பிரத்தியேகங்கள் செயல்படாது. ஏதேனும் பொருந்தாத தன்மைகளுக்கு சிக்கல்களைத் தாக்கல் செய்க.

source: The Qiskit Aqua 0.7.0 release introduces a lot of new functionality along with an improved integration with :class:`qiskit.circuit.QuantumCircuit` objects. The central contributions are the Qiskit's optimization module, a complete refactor on Operators, using circuits as native input for the algorithms and removal of the declarative JSON API.
ta_in: Qiskit Aqua 0.7.0 வெளியீடு:class: `qiskit.circuit.QuantumCircuit` பொருள்களுடன் மேம்பட்ட ஒருங்கிணைப்புடன் நிறைய புதிய செயல்பாடுகளை அறிமுகப்படுத்துகிறது. மைய பங்களிப்புகள் கிஸ்கிட்டின் தேர்வுமுறை தொகுதி, ஆபரேட்டர்கள் மீதான முழுமையான மறுசீரமைப்பு, வழிமுறைகளுக்கான சொந்த உள்ளீடாக சுற்றுகளைப் பயன்படுத்துதல் மற்றும் அறிவிக்கும் JSON API ஐ நீக்குதல்.

source: Optimization module
ta_in: உகப்பாக்கம் தொகுதி

source: The :mod:`qiskit.optimization`` module now offers functionality for modeling and solving quadratic programs. It provides various near-term quantum and conventional algorithms, such as the ``MinimumEigenOptimizer`` (covering e.g. ``VQE`` or ``QAOA``) or ``CplexOptimizer``, as well as a set of converters to translate between different problem representations, such as ``QuadraticProgramToQubo``. See the `changelog <https://github.com/Qiskit/qiskit-aqua/blob/master/CHANGELOG.md>`_ for a list of the added features.
ta_in: :mod: `qiskit.optimization`` தொகுதி இப்போது இருபடி நிரல்களை மாடலிங் செய்வதற்கும் தீர்ப்பதற்கும் செயல்பாட்டை வழங்குகிறது. இது ``MinimumEigenOptimizer`` (எ.கா. `` VQE`` அல்லது `` QAOA`` ஐ உள்ளடக்கியது) அல்லது `` CplexOptimizer``, மற்றும் மொழிபெயர்ப்பதற்கான மாற்றிகளின் தொகுப்பு போன்ற பல்வேறு அருகிலுள்ள கால குவாண்டம் மற்றும் வழக்கமான வழிமுறைகளை வழங்குகிறது. `` QuadraticProgramToQubo`` போன்ற வெவ்வேறு சிக்கல் பிரதிநிதித்துவங்களுக்கு இடையில். சேர்க்கப்பட்ட அம்சங்களின் பட்டியலுக்கு `changelog <https://github.com/Qiskit/qiskit-aqua/blob/master/CHANGELOG.md>` _ ஐப் பார்க்கவும்.

source: Operator flow
ta_in: ஆபரேட்டர் ஓட்டம்

source: The operator logic provided in :mod:`qiskit.aqua.operators`` was completely refactored and is now a full set of tools for constructing physically-intuitive quantum computations. It contains state functions, operators and measurements and internally relies on Terra's Operator objects. Computing expectation values and evolutions was heavily simplified and objects like the ``ExpectationFactory`` produce the suitable, most efficient expectation algorithm based on the Operator input type. See the `changelog <https://github.com/Qiskit/qiskit-aqua/blob/master/CHANGELOG.md>`_ for a overview of the added functionality.
ta_in: இதில் வழங்கப்பட்ட ஆபரேட்டர் தர்க்கம்:mod: `qiskit.aqua.operators`` முற்றிலும் மறுசீரமைக்கப்பட்டு, இப்போது உடல்-உள்ளுணர்வு குவாண்டம் கணக்கீடுகளை உருவாக்குவதற்கான முழு கருவியாகும். இது மாநில செயல்பாடுகள், ஆபரேட்டர்கள் மற்றும் அளவீடுகளைக் கொண்டுள்ளது மற்றும் உள்நாட்டில் டெர்ராவின் ஆபரேட்டர் பொருள்களை நம்பியுள்ளது. கணினி எதிர்பார்ப்பு மதிப்புகள் மற்றும் பரிணாமங்கள் பெரிதும் எளிமைப்படுத்தப்பட்டன, மேலும் ``ExpectationFactory`` போன்ற பொருள்கள் ஆபரேட்டர் உள்ளீட்டு வகையின் அடிப்படையில் பொருத்தமான, மிகவும் திறமையான எதிர்பார்ப்பு வழிமுறையை உருவாக்குகின்றன. சேர்க்கப்பட்ட செயல்பாட்டின் மேலோட்டப் பார்வைக்கு `changelog<https://github.com/Qiskit/qiskit-aqua/blob/master/CHANGELOG.md>` _ ஐப் பார்க்கவும்.

source: Native circuits
ta_in: இவரது சுற்றுகள்

source: Algorithms commonly use parameterized circuits as input, for example the VQE, VQC or QSVM. Previously, these inputs had to be of type ``VariationalForm`` or ``FeatureMap`` which were wrapping the circuit object. Now circuits are natively supported in these algorithms, which means any individually constructed ``QuantumCircuit`` can be passed to these algorithms. In combination with the release of the circuit library which offers a wide collection of circuit families, it is now easy to construct elaborate circuits as algorithm input.
ta_in: வழிமுறைகள் பொதுவாக அளவுருவாக்கப்பட்ட சுற்றுகளை உள்ளீடாகப் பயன்படுத்துகின்றன, எடுத்துக்காட்டாக VQE, VQC அல்லது QSVM. முன்னதாக, இந்த உள்ளீடுகள் சுற்று பொருளை மடிக்கும் ``VariationalForm`` அல்லது `` FeatureMap``` வகையாக இருக்க வேண்டும். இப்போது இந்த வழிமுறைகளில் சுற்றுகள் இயல்பாக ஆதரிக்கப்படுகின்றன, அதாவது தனித்தனியாக கட்டப்பட்ட ``QuantumCircuit`` இந்த வழிமுறைகளுக்கு அனுப்பப்படலாம். சுற்று குடும்பங்களின் பரந்த தொகுப்பை வழங்கும் சுற்று நூலகத்தின் வெளியீட்டோடு இணைந்து, விரிவான சுற்றுகளை அல்காரிதம் உள்ளீடாக உருவாக்குவது இப்போது எளிதானது.

source: Declarative JSON API
ta_in: அறிவிப்பு JSON API

source: The ability of running algorithms using dictionaries as parameters as well as using the Aqua interfaces GUI has been removed.
ta_in: அகராதிகளை அளவுருக்களாகப் பயன்படுத்துவதோடு, அக்வா இடைமுகங்கள் GUI ஐப் பயன்படுத்துவதற்கான வழிமுறைகளும் அகற்றப்பட்டுள்ளன.

source: A new exception, :class:`qiskit.providers.ibmq.IBMQBackendJobLimitError`, is now raised if a job could not be submitted because the limit on active jobs has been reached.
ta_in: ஒரு புதிய விதிவிலக்கு ,:class: `qiskit.providers.ibmq.IBMQBackendJobLimitError`, இப்போது ஒரு வேலையைச் சமர்ப்பிக்க முடியாவிட்டால் எழுப்பப்படுகிறது, ஏனெனில் செயலில் உள்ள வேலைகளுக்கான வரம்பு எட்டப்பட்டுள்ளது.

source: :class:`qiskit.providers.ibmq.job.IBMQJob` and :class:`qiskit.providers.ibmq.managed.ManagedJobSet` each has two new methods ``update_name`` and ``update_tags``. They are used to change the name and tags of a job or a job set, respectively.
ta_in: :class: `qiskit.providers.ibmq.job.IBMQJob` மற்றும்:class:` qiskit.providers.ibmq.managed.ManagedJobSet` ஒவ்வொன்றும் இரண்டு புதிய முறைகள் `` update_name`` மற்றும் `` update_tags``. அவை முறையே ஒரு வேலை அல்லது வேலை தொகுப்பின் பெயர் மற்றும் குறிச்சொற்களை மாற்ற பயன்படுகின்றன.

source: :meth:`qiskit.providers.ibmq.IBMQFactory.save_account` and :meth:`qiskit.providers.ibmq.IBMQFactory.enable_account` now accept optional parameters ``hub``, ``group``, and ``project``, which allow specifying a default provider to save to disk or use, respectively.
ta_in: செயல்பாடு: func: `qiskit.compiler.transpile` இப்போது` `அடிப்படை_கேட்ஸ்`` அளவுரு` `எதுவுமில்லை`` என அமைக்கப்பட்டால் சரியாகக் கையாளப்படுகிறது. இது டிரான்ஸ்பைலேஷன் செயல்முறையால் சேர்க்கப்பட்ட வாயில்கள் உட்பட, வெளியீடு அமைக்கப்பட்ட சுற்றில் எந்த வாயிலையும் அனுமதிக்கும். இந்த அளவுருவைப் பயன்படுத்துவது தேர்வுமுறை போது சில எதிர்பாராத விளைவுகளை ஏற்படுத்தக்கூடும் என்பதை நினைவில் கொள்க. சில டிரான்ஸ்பைலர் பாஸ்கள் `` அடிப்படை_கேட்ஸ்`` தொகுப்பைப் பொறுத்து இருக்கும். எ.கா.

source: The :class:`qiskit.providers.ibmq.job.IBMQJob` methods ``creation_date`` and ``time_per_step`` now return date time information as a ``datetime`` object in local time instead of UTC. Similarly, the parameters ``start_datetime`` and ``end_datetime``, of :meth:`qiskit.providers.ibmq.IBMQBackendService.jobs` and :meth:`qiskit.providers.ibmq.IBMQBackend.jobs` can now be specified in local time.
ta_in: :class: `qiskit.providers.ibmq.job.IBMQJob` முறைகள்``creation_date`` மற்றும் ``time_per_step`` ஆகியவை இப்போது தேதி நேரத் தகவலை UTC க்கு பதிலாக உள்ளூர் நேரத்தில் ``datetime`` பொருளாகத் தருகின்றன. இதேபோல், ``start_datetime`` மற்றும் ``end_datetime`` ஆகியவற்றின் அளவுருக்கள்:meth: `qiskit.providers.ibmq.IBMQBackendService.jobs` மற்றும்:meth:` qiskit.providers.ibmq.IBMQBackend.jobs` இப்போது குறிப்பிடப்படலாம் உள்ளூர் நேரத்தில்.

source: The :meth:`qiskit.providers.ibmq.job.QueueInfo.format` method now uses a custom ``datetime`` to string formatter, and the package `arrow <https://pypi.org/project/arrow/>`_ is no longer required and has been removed from the requirements list.
ta_in: :meth: `qiskit.providers.ibmq.job.QueueInfo.format` முறை இப்போது சரம் வடிவமைப்பிற்கு தனிப்பயன்``datetime`` ஐப் பயன்படுத்துகிறது, மேலும் `arrow <https://pypi.org/project/arrow/> `_ இனி தேவையில்லை மற்றும் தேவைகள் பட்டியலிலிருந்து அகற்றப்பட்டது.

source: The :meth:`~qiskit.providers.ibmq.job.IBMQJob.from_dict` and :meth:`~qiskit.providers.ibmq.job.IBMQJob.to_dict` methods of :class:`qiskit.providers.ibmq.job.IBMQJob` are deprecated and will be removed in the next release.
ta_in: :meth: `~ qiskit.providers.ibmq.job.IBMQJob.from_dict` மற்றும்:meth:` ~ qiskit.providers.ibmq.job.IBMQJob.to_dict` முறைகள்:class: `qiskit.providers.ibmq.job. IBMQJob` நீக்கப்பட்டது மற்றும் அடுத்த வெளியீட்டில் அகற்றப்படும்.

source: Fixed an issue where ``nest_asyncio.apply()`` may raise an exception if there is no asyncio loop due to threading.
ta_in: த்ரெட்டிங் காரணமாக அசின்சியோ லூப் இல்லாவிட்டால் ``nest_asyncio.apply () `` விதிவிலக்கு எழுப்பக்கூடிய ஒரு சிக்கல் சரி செய்யப்பட்டது.

source: Fixes Controller classes so that the ReduceBarrier transpilation pass is applied first. This prevents barrier instructions from preventing truncation of unused qubits if the only instruction defined on them was a barrier.
ta_in: கட்டுப்பாட்டு வகுப்புகளை சரிசெய்கிறது, இதனால் ReduseBarrier transpilation pass முதலில் பயன்படுத்தப்படும். இது வரையறுக்கப்பட்ட வழிமுறைகள் பயன்படுத்தப்படாத குயிட்களைக் குறைப்பதைத் தடுப்பதைத் தடுக்கிறது.

source: Fix error in gate time unit conversion for device noise model with thermal relaxation errors and gate errors. The error probability the depolarizing error was being calculated with gate time in microseconds, while for thermal relaxation it was being calculated in nanoseconds. This resulted in no depolarizing error being applied as the incorrect units would make the device seem to be coherence limited.
ta_in: வெப்ப தளர்வு பிழைகள் மற்றும் கேட் பிழைகள் கொண்ட சாதன இரைச்சல் மாதிரிக்கான கேட் டைம் யூனிட் மாற்றத்தில் பிழையை சரிசெய்யவும். பிழை நிகழ்தகவு டிப்போலரைசிங் பிழை மைக்ரோ விநாடிகளில் கேட் நேரத்துடன் கணக்கிடப்படுகிறது, அதே நேரத்தில் வெப்ப தளர்வுக்காக நானோ விநாடிகளில் கணக்கிடப்படுகிறது. தவறான அலகுகள் சாதனம் ஒத்திசைவு மட்டுப்படுத்தப்பட்டதாகத் தோன்றும் என்பதால் இது டிப்போலரைசிங் பிழையைப் பயன்படுத்தவில்லை.

source: Fix bug in incorrect composition of QuantumErrors when the qubits of composed instructions differ.
ta_in: இயற்றப்பட்ட வழிமுறைகளின் வினாக்கள் வேறுபடும்போது குவாண்டம் எர்ரர்களின் தவறான கலவையில் பிழையை சரிசெய்யவும்.

source: Fix issue where the "diagonal" gate is checked to be unitary with too high a tolerance. This was causing diagonals generated from Numpy functions to often fail the test.
ta_in: "Diagonal" வாயில் மிக அதிகமான சகிப்புத்தன்மையுடன் ஒற்றுமையாக இருக்கிறதா என்று சோதிக்கப்படும் சிக்கலை சரிசெய்யவும். இது நம்பி செயல்பாடுகளிலிருந்து உருவாக்கப்படும் மூலைவிட்டங்கள் பெரும்பாலும் சோதனையில் தோல்வியடையும்.

source: Fix remove-barrier circuit optimization pass to be applied before qubit trucation. This fixes an issue where barriers inserted by the Terra transpiler across otherwise inactive qubits would prevent them from being truncated.
ta_in: குவிட் ட்ரூசேஷனுக்கு முன் பயன்படுத்த வேண்டிய நீக்கு-தடை சுற்று உகப்பாக்கம் பாஸை சரிசெய்யவும். இது ஒரு சிக்கலை சரிசெய்கிறது, அங்கு டெர்ரா டிரான்ஸ்பைலரால் செருகப்பட்ட தடைகள் இல்லையெனில் செயலற்ற குவிட்கள் குறைக்கப்படுகின்றன.

source: The 0.13.0 release includes many big changes. Some highlights for this release are:
ta_in: 0.13.0 வெளியீட்டில் பல பெரிய மாற்றங்கள் உள்ளன. இந்த வெளியீட்டிற்கான சில சிறப்பம்சங்கள்:
