Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/cloud/at-events.po
Languages: de, es_un, ja, ta, te

source: Audit events for Qiskit Runtime
de: Audit-Ereignisse für Qiskit Runtime
es_un: Auditar eventos para Qiskit Runtime
ja: Qiskit Runtimeの監査イベント
ta: Qiskit இயக்க நேரத்திற்கான தணிக்கை நிகழ்வுகள்
te: Qiskit రన్‌టైమ్ కోసం సంఘటనలను ఆడిట్ చేయండి

source: As a security officer, auditor, or manager, you can use the IBM Cloud® Activity Tracker service to track how users and applications interact with the Qiskit Runtime service in IBM Cloud.
de: Als Sicherheitsbeamter, Auditor oder Manager können Sie den IBM Cloud® Activity Tracker nutzen, um zu verfolgen, wie Benutzer und Anwendungen mit dem Qiskit Runtime Service in IBM Cloud interagieren.
es_un: Como oficial de seguridad, auditor o administrador, puedes utilizar el servicio IBM Cloud® Activity Tracker para rastrear cómo los usuarios y las aplicaciones interactúan con el servicio Qiskit Runtime en IBM Cloud.
ja: セキュリティー担当者、監査員、または管理者として、 IBM Cloud® Activity Tracker サービスを使用して、ユーザーおよびアプリケーションが IBM Cloudの Qiskit Runtime サービスと対話する方法を追跡することができます。
ta: பாதுகாப்பு அதிகாரி, தணிக்கையாளர் அல்லது மேலாளராக, IBM கிளவுட்டில் உள்ள Qiskit இயக்க நேர சேவையுடன் பயனர்கள் மற்றும் பயன்பாடுகள் எவ்வாறு தொடர்பு கொள்கின்றன என்பதைக் கண்காணிக்க IBM Cloud® செயல்பாட்டு கண்காணிப்பு சேவையைப் பயன்படுத்தலாம்.
te: భద్రతా అధికారిగా, ఆడిటర్‌గా లేదా మేనేజర్‌గా, IBM క్లౌడ్‌లోని Qiskit రన్‌టైమ్ సేవతో వినియోగదారులు మరియు అప్లికేషన్‌లు ఎలా ఇంటరాక్ట్ అవుతాయో ట్రాక్ చేయడానికి మీరు IBM Cloud® కార్యాచరణ ట్రాకర్ సేవను ఉపయోగించవచ్చు.

source: IBM Cloud Activity Tracker records user-initiated activities that change the state of a service in IBM Cloud. You can use this service to investigate abnormal activity and critical actions and to comply with regulatory audit requirements. In addition, you can be alerted about actions as they happen. The events that are collected comply with the Cloud Auditing Data Federation (CADF) standard. For more information, see the `getting started tutorial for IBM Cloud Activity Tracker <https://cloud.ibm.com/docs/activity-tracker?topic=activity-tracker-getting-started>`__.
de: IBM Cloud Activity Tracker erfasst von Nutzern initiierte Aktivitäten, die den Status eines Dienstes in IBM Cloud ändern. Sie können diesen Dienst nutzen, um ungewöhnliche Aktivitäten und kritische Maßnahmen zu untersuchen und die Anforderungen der regulatorischen Prüfung zu erfüllen. Darüber hinaus können Sie über die geplanten Aktionen informiert werden. Die erfassten Ereignisse entsprechen dem Standard der Cloud Auditing Data Federation (CADF). Weitere Informationen finden Sie im `Einführungsbeispiel für IBM Cloud Activity Tracker <https://cloud.ibm.com/docs/activity-tracker?topic=activity-tracker-getting-started>`__.
es_un: IBM Cloud Activity Tracker registra las actividades iniciadas por el usuario que cambian el estado de un servicio en IBM Cloud. Puedes usar este servicio para investigar actividades anormales y acciones críticas y para cumplir con los requisitos de auditoría reglamentarios. Además, puedes recibir alertas sobre las acciones a medida que ocurren. Los eventos que se recopilan cumplen con el estándar Cloud Auditing Data Federation (CADF). Para obtener más información, consulta el `tutorial de primeros pasos para IBM Cloud Activity Tracker <https://cloud.ibm.com/docs/activity-tracker?topic=activity-tracker-getting-started>`__.
ja: IBM Cloud Activity Trackerは、IBM Cloud 内のサービスの状態を変更するユーザー主導のアクティビティを記録します。 このサービスを使用して、異常な活動や重大な行動を調査し、規制の監査要件に準拠することができます。 さらに、行動について警告することができます。収集されたイベントは、クラウド監査データ・フェデレーション(CADF)規格に準拠しています。 詳細については、`IBM Cloud Activity Tracker 入門チュートリアル <https://cloud.ibm.com/docs/activity-tracker?topic=activity-tracker-getting-started>`__ を参照してください。
ta: IBM Cloud Activity Tracker ஆனது IBM Cloud இல் சேவையின் நிலையை மாற்றும் பயனர்களால் தொடங்கப்பட்ட செயல்பாடுகளை பதிவு செய்கிறது. அசாதாரண செயல்பாடு மற்றும் முக்கியமான செயல்களை விசாரிக்கவும், ஒழுங்குமுறை தணிக்கைத் தேவைகளுக்கு இணங்கவும் இந்தச் சேவையைப் பயன்படுத்தலாம். கூடுதலாக, செயல்கள் நடக்கும்போது அவற்றைப் பற்றி நீங்கள் எச்சரிக்கலாம். சேகரிக்கப்படும் நிகழ்வுகள் கிளவுட் ஆடிட்டிங் டேட்டா ஃபெடரேஷன் (CADF) தரநிலைக்கு இணங்குகின்றன. மேலும் தகவலுக்கு, ஐபிஎம் கிளவுட் ஆக்டிவிட்டி டிராக்கருக்கான `தொடக்கப் பயிற்சி <https://cloud.ibm.com/docs/activity-tracker?topic=activity-tracker-getting-started>`__ என்பதைப் பார்க்கவும்.

source: List of data events
de: Liste der Datenereignisse
es_un: Lista de eventos de datos
ja: データイベントの一覧
ta: தரவு நிகழ்வுகளின் பட்டியல்
te: డాటా సంఘటనల జాబితా

source: The following table lists the Qiskit Runtime actions that generate an event:
de: In der folgenden Tabelle werden die Qiskit Runtime Aktionen aufgelistet, die ein Ereignis generieren:
es_un: La siguiente tabla enumera las acciones de Qiskit Runtime que generan un evento:
ja: 以下の表は、イベントを生成する Qiskit Runtime アクションの一覧です。
ta: ஒரு நிகழ்வை உருவாக்கும் Qiskit இயக்க நேர செயல்களைப் பின்வரும் அட்டவணை பட்டியலிடுகிறது:
te: సంఘటనను రూపొందించే Qiskit రన్‌టైమ్ చర్యలను క్రింది పట్టిక జాబితా చేస్తుంది:

source: Action
de: Aktion
es_un: Acción
ja: 動作
ta: செயல்
te: చర్య

source: Description
de: Beschreibung
es_un: Descripción
ja: 説明
ta: விளக்கம்
te: వివరణ

source: An event is generated a program is uploaded.
de: Ein Ereignis wird generiert, das ein Programm hochgeladen wird.
es_un: Se genera un evento cuando se carga un programa.
ja: イベントが生成され、プログラムがアップロードされます。
ta: ஒரு நிகழ்வு உருவாக்கப்பட்டு ஒரு நிரல் பதிவேற்றப்படுகிறது.
te: ఒక ఘటన రూపొందించబడింది ఒక ప్రోగ్రామ్ అప్‌లోడ్ చేయబడింది.

source: An event is generated when program information is returned. For example, when you list programs or program details.
de: Ein Ereignis wird generiert, wenn Programminformationen zurückgegeben werden. Zum Beispiel, wenn man Programme oder Programmdetails auflistet.
es_un: Se genera un evento cuando se devuelve información del programa. Por ejemplo, cuando enumera programas o detalles de programas.
ja: プログラム情報が返されたときにイベントが生成されます。たとえば、プログラムやプログラムの詳細を一覧表示するときなどです。
ta: நிரல் தகவலைத் திரும்பப் பெறும்போது ஒரு நிகழ்வு உருவாக்கப்படுகிறது. எடுத்துக்காட்டாக, நீங்கள் நிரல்களை அல்லது நிரல் விவரங்களைப் பட்டியலிடும்போது.
te: ప్రోగ్రామ్ సమాచారం అందించబడినప్పుడు సంఘటన సృష్టించబడుతుంది. ఉదాహరణకు, మీరు ప్రోగ్రామ్‌లు లేదా ప్రోగ్రామ్ వివరాలను జాబితా చేసినప్పుడు.

source: An event is generated when a program is deleted.
de: Ein Ereignis wird generiert, wenn ein Programm gelöscht wird.
es_un: Se genera un evento cuando se elimina un programa.
ja: プログラムが削除されるとイベントが生成されます。
ta: ஒரு நிரல் நீக்கப்படும்போது ஒரு நிகழ்வு உருவாக்கப்படுகிறது.
te: ప్రోగ్రామ్ తొలగించబడినప్పుడు సంఘటన సృష్టించబడుతుంది.

source: An event is generated when a program metadata is updated.
de: Ein Ereignis wird generiert, wenn Metadaten eines Programms aktualisiert werden.
es_un: Se genera un evento cuando se actualizan los metadatos de un programa.
ja: プログラムメタデータが更新されたときにイベントが生成されます。
ta: நிரல் மெட்டாடேட்டா புதுப்பிக்கப்படும்போது ஒரு நிகழ்வு உருவாக்கப்படுகிறது.
te: ప్రోగ్రామ్ మెటాడేటా నవీకరించబడినప్పుడు సంఘటన రూపొందించబడుతుంది.

source: An event is generated when a job is started.
de: Ein Ereignis wird generiert, wenn ein Job gestartet wird.
es_un: Se genera un evento cuando se inicia un trabajo.
ja: イベントはジョブが開始されたときに生成されます。
ta: ஒரு வேலை தொடங்கும்போது ஒரு நிகழ்வு உருவாக்கப்படுகிறது.
te: ఉద్యోగం ప్రారంభించినప్పుడు ఒక సంఘటన సృష్టించబడుతుంది.

source: An event is generated when job information is returned. This includes listing jobs, job details, job results, job interim results, or job logs.
de: Ein Ereignis wird generiert, wenn Jobinformationen zurückgegeben werden. Dies umfasst die Auflistung von Jobs, Jobdetails, Arbeitsergebnissen, Zwischenergebnissen des Jobs oder Jobprotokollen.
es_un: Se genera un evento cuando se devuelve información del trabajo. Esto incluye enumerar trabajos, detalles de trabajos, resultados de trabajos, resultados provisionales de trabajos o registros de trabajos.
ja: ジョブ情報が返されたときにイベントが生成されます。これには、ジョブ、ジョブの詳細、ジョブ結果、ジョブの中間結果、またはジョブ・ログのリストが含まれます
ta: வேலைத் தகவலைத் திரும்பப் பெறும்போது ஒரு நிகழ்வு உருவாக்கப்படுகிறது. இதில் வேலைகள், வேலை விவரங்கள், வேலை முடிவுகள், வேலை இடைக்கால முடிவுகள் அல்லது வேலைப் பதிவுகள் ஆகியவை அடங்கும்.
te: ఉద్యోగ సమాచారం అందించబడినప్పుడు ఒక సంఘటన సృష్టించబడుతుంది. ఇది ఉద్యోగాలు, ఉద్యోగ వివరాలు, ఉద్యోగ ఫలితాలు, ఉద్యోగ మధ్యంతర ఫలితాలు లేదా ఉద్యోగ లాగ్‌లను జాబితా చేస్తుంది.

source: An event is generated when a job is deleted.
de: Ein Ereignis wird generiert, wenn ein Job gelöscht wird.
es_un: Se genera un evento cuando se elimina un trabajo.
ja: ジョブが削除されるとイベントが生成されます。
ta: ஒரு வேலை நீக்கப்படும் போது ஒரு நிகழ்வு உருவாக்கப்படுகிறது.
te: ఉద్యోగం తొలగించబడినప్పుడు సంఘటన సృష్టించబడుతుంది.

source: An event is generated when a job is cancelled.
de: Ein Ereignis wird generiert, wenn ein Job abgebrochen wird.
es_un: Se genera un evento cuando se cancela un trabajo.
ja: ジョブがキャンセルされたときにイベントが生成されます。
ta: வேலை ரத்து செய்யப்படும்போது ஒரு நிகழ்வு உருவாக்கப்படுகிறது.
te: ఉద్యోగం రద్దు చేయబడినప్పుడు ఒక సంఘటన సృష్టించబడుతుంది.

source: Viewing events
de: Ereignisse anzeigen
es_un: Ver eventos
ja: イベントを表示する
ta: நிகழ்வுகளைப் பார்க்கிறது
te: సంఘటనలను వీక్షించడం

source: Events that are generated by an instance of the *YourServiceName* service are automatically forwarded to the IBM Cloud Activity Trackerservice instance that is available in the same location.
de: Ereignisse, die von einer Instanz des *DeinServiceName*-Dienstes generiert werden, werden automatisch an die IBM Cloud Activity Trackerservice-Instanz weitergeleitet, die an derselben Stelle verfügbar ist.
es_un: Los eventos generados por una instancia del servicio *YourServiceName* se reenvían automáticamente a la instancia del servicio IBM Cloud Activity Tracker que está disponible en la misma ubicación.
ja: *YourServiceName* サービスのインスタンスによって生成されたイベントは、同じ場所で利用可能な IBM Cloud Activity Trackerservice インスタンスに自動的に転送されます。
ta: *YourServiceName* சேவையின் நிகழ்வால் உருவாக்கப்பட்ட நிகழ்வுகள், அதே இடத்தில் கிடைக்கும் IBM Cloud Activity Trackerservice நிகழ்வுக்குத் தானாகவே அனுப்பப்படும்.
te: *YourServiceName* సేవ యొక్క ఇనిస్టాన్స్ ద్వారా రూపొందించబడిన సంఘటనలు స్వయంచాలకంగా అదే స్థానంలో అందుబాటులో ఉన్న IBM క్లౌడ్ కార్యాచరణ ట్రాకర్‌సర్వీస్ ఇనిస్టాన్స్కి ఫార్వార్డ్ చేయబడతాయి.

source: IBM Cloud Activity Tracker can have only one instance per location. To view events, you must access the web UI of the IBM Cloud Activity Tracker service in the same location where your service instance is available. For more information, see `Launching the UI <https://cloud.ibm.com/docs/activity-tracker?topic=activity-tracker-launch>`__.
de: Der IBM Cloud Activity Tracker kann nur eine Instanz pro Ort haben. Um Ergeinisse anzuzeigen muss man auf die Web-Oberfläche des IBM Cloud Activity Tracker Services an der gleichen Stelle zugreifen, an der Ihre Service-Instanz verfügbar ist. Für weitere Informationen, siehe `Start der UI <https://cloud.ibm.com/docs/activity-tracker?topic=activity-tracker-launch>`__.
es_un: IBM Cloud Activity Tracker solo puede tener una instancia por ubicación. Para ver eventos, debes acceder a la interfaz de usuario web del servicio IBM Cloud Activity Tracker en la misma ubicación donde está disponible tu instancia de servicio. Para obtener más información, consulta `Launching the UI <https://cloud.ibm.com/docs/activity-tracker?topic=activity-tracker-launch>`__.
ja: IBM Cloud Activity Trackerはロケーションごとに1つのインスタンスしか作成できません。 イベントを表示する サービスインスタンスが利用可能な場所と同じ場所で IBM Cloud Activity Tracker サービスの Web UI にアクセスする必要があります。 詳細については、`UI の起動 <https://cloud.ibm.com/docs/activity-tracker?topic=activity-tracker-launch>`__ を参照してください。
ta: ஐபிஎம் கிளவுட் ஆக்டிவிட்டி டிராக்கரில் ஒரு இடத்திற்கு ஒரு நிகழ்வு மட்டுமே இருக்க முடியும். நிகழ்வுகளைப் பார்க்க, உங்கள் சேவை நிகழ்வு இருக்கும் அதே இடத்தில் IBM Cloud Activity Tracker சேவையின் இணைய UI ஐ அணுக வேண்டும். மேலும் தகவலுக்கு, `UI ஐத் தொடங்குதல் <https://cloud.ibm.com/docs/activity-tracker?topic=activity-tracker-launch> ஐப் பார்க்கவும்.
te: IBM క్లౌడ్ యాక్టివిటీ ట్రాకర్ ఒక్కో లొకేషన్‌కు ఒక ఇన్షెన్స్ను మాత్రమే కలిగి ఉంటుంది. సంఘటనలను వీక్షించడానికి, మీరు మీ సేవా సందర్భం అందుబాటులో ఉన్న అదే స్థానంలో IBM క్లౌడ్ కార్యాచరణ ట్రాకర్ సేవ యొక్క వెబ్ UIని తప్పనిసరిగా యాక్సెస్ చేయాలి. మరింత సమాచారం కోసం, `UIని లాంచ్ చేస్తోంది <https://cloud.ibm.com/docs/activity-tracker?topic=activity-tracker-launch>`__ చూడండి.
