Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/cloud/cloud-provider-org.po
Languages: es_un, ja, ta

source: When you use App ID as ID provider with the Cloud directory, you can create users in the IBM Cloud user interface.
es_un: Cuando utilizas App ID como proveedor de ID con el directorio de Cloud, puedes crear usuarios en la interfaz de usuario de IBM Cloud.
ja: Cloud ディレクトリで App ID を ID プロバイダとして使用すると、IBM Cloud ユーザー インターフェイスでユーザーを作成できます。
ta: ஆப்ஸ் ஐடியை கிளவுட் கோப்பகத்துடன் ஐடி வழங்குநராகப் பயன்படுத்தும்போது, ​​ஐபிஎம் கிளவுட் பயனர் இடைமுகத்தில் பயனர்களை உருவாக்கலாம்.

source: Open the App ID instance page from the `resource list <https://cloud.ibm.com/resources>`__ Services and software section.
es_un: Abre la página de la instancia de App ID desde la `resource list <https://cloud.ibm.com/resources>`__ de la sección de Services and software.
ja: `リソース・リスト <https://cloud.ibm.com/resources>`__ サービスとソフトウェアセクションから、App ID インスタンスページを開きます。
ta: `வளங்களின் பட்டியல் <https://cloud.ibm.com/resources>`__ சேவைகள் மற்றும் மென்பொருள் பிரிவிலிருந்து ஆப்ஸ் ஐடி instance பக்கத்தைத் திறக்கவும்.

source: Go to **Manage Authentication** → **Cloud Directory** → **Users**, and click **Create User**. Enter the user details.
es_un: Dirígete a **Manage Authentication** → **Cloud Directory** → **Users**, y haz clic en **Create User**. Ingresa los detalles del usuario.
ja: **認証の管理** → **クラウド・ディレクトリ** → **ユーザー** に移動し、**ユーザーを作成**をクリックします。ユーザーの詳細を入力します。
ta: **Manage Authentication** → **Cloud Directory** → **Users**என்பதற்குச் சென்று, **Create User** என்பதைக் கிளிக் செய்யவும். பயனர் விவரங்களை உள்ளிடவும்.

source: Create or modify users’ project assignments
es_un: Crear o modificar las asignaciones de proyectos de los usuarios
ja: ユーザーのプロジェクト割り当ての作成または変更
ta: பயனர்களின் திட்டப்பணிகளை உருவாக்கவும் அல்லது மாற்றவும்

source: access1
ja: アクセス 1

source: If you don’t see the user that you want to manage, verify that they logged in to IBM Cloud at least once. See step 1 in the :ref:`user-org`.
es_un: Si no ves al usuario que deseas administrar, verifica que haya iniciado sesión en IBM Cloud al menos una vez. Consulta el paso 1 en :ref:`user-org`.
ja: 管理したいユーザーが表示されない場合は、少なくとも一度はIBM Cloudにログインしていることを確認してください。 :ref:`user-org` のステップ1を参照してください。
ta: நீங்கள் நிர்வகிக்க விரும்பும் பயனரை நீங்கள் காணவில்லை எனில், அவர்கள் IBM Cloud இல் குறைந்தது ஒரு முறை உள்நுழைந்துள்ளார்களா என்பதைச் சரிபார்க்கவும். :ref:`user-org` இல் படி 1 ஐப் பார்க்கவும்.

source: User flow
es_un: Flujo del usuario
ja: ユーザー・フロー
ta: பயனர் ஓட்டம்

source: A user is sent the ID provider URL for the IBM Cloud account. They use this URL and the login information to access the system. The user should change their password after they log on.
es_un: A un usuario se le envía la URL del proveedor de ID para la cuenta de IBM Cloud. Utilizan esta URL y la información de inicio de sesión para acceder al sistema. El usuario debe cambiar su contraseña después de iniciar sesión.
ja: IBM Cloud アカウントの ID プロバイダー URL がユーザーに送信されます。 システムにアクセスするには、この URL とログイン情報を使用します。ユーザーはログオン後にパスワードを変更する必要があります。
ta: ஐபிஎம் கிளவுட் கணக்கிற்கான ஐடி வழங்குநரின் URL ஒரு பயனருக்கு அனுப்பப்பட்டது. கணினியை அணுக இந்த URL மற்றும் உள்நுழைவுத் தகவலைப் பயன்படுத்துகின்றனர். உள்நுழைந்த பிறகு பயனர் தனது கடவுச்சொல்லை மாற்ற வேண்டும்.

source: The administrator can always go to `Manage → Access (IAM) → Identity providers <https://cloud.ibm.com/iam/identity-providers>`__ to look up the ID provider URL.
es_un: El administrador siempre puede ir a `Manage → Access (IAM) → Identity providers <https://cloud.ibm.com/iam/identity-providers>`__ para buscar la URL del proveedor de ID.
ja: 管理者は常に `管理 → アクセス (IAM) → アイデンティティ・プロバイダー <https://cloud.ibm.com/iam/identity-providers>`__ に移動して、ID プロバイダーの URL を検索できます。
ta: ஐடி வழங்குநரின் URLஐப் பார்க்க, நிர்வாகி எப்போதும் `நிர்வகி → அணுகல் (IAM) → அடையாள வழங்குநர்கள் <https://cloud.ibm.com/iam/identity-providers>`__ என்பதற்குச் செல்லலாம்.

source: To work with Qiskit Runtime and access service instances, users need to create an API key from `Manage → Access (IAM) → API keys <https://cloud.ibm.com/iam/apikeys>`__.
es_un: Para trabajar con Qiskit Runtime y acceder a las instancias del servicio, los usuarios deben crear una clave de API desde `Manage → Access (IAM) → API keys <https://cloud.ibm.com/iam/apikeys>`__.
ja: Qiskit Runtimeを操作し、サービスインスタンスにアクセスするには ユーザーは `管理 → アクセス (IAM) → API キー <https://cloud.ibm.com/iam/apikeys>`__ からAPI キーを作成する必要があります。
ta: Qiskit இயக்க நேரம் மற்றும் அணுகல் சேவை நிகழ்வுகளுடன் பணிபுரிய, பயனர்கள் `Manage → Access (IAM) → API விசைகள் <https://cloud.ibm.com/iam/apikeys>`__ இலிருந்து API விசையை உருவாக்க வேண்டும்.

source: The ``ml`` project needs access to the service instances ``QR-ml`` and ``QR-common``.
es_un: El proyecto ``ml`` necesita acceso a las instancias de servicio ``QR-ml`` y ``QR-common``.
ja: ``ml`` プロジェクトは、サービス インスタンス ``QR-ml`` と ``QR-common`` にアクセスする必要があります。
ta: ``ml`` திட்டத்திற்கு ``QR-ml`` மற்றும் ``QR-common`` சேவை நிகழ்வுகளுக்கான அணுகல் தேவை.

source: Fatima needs access to the ``ml`` project.
es_un: Fatima necesita acceso al proyecto ``ml``.
ja: Fatimaは ``ml`` プロジェクトにアクセスする必要があります。
ta: பாத்திமாவுக்கு ``ml`` திட்டத்திற்கான அணுகல் தேவை.

source: Ravi needs access to the ``finance`` project.
es_un: Ravi necesita acceso al proyecto ``finance``.
ja: Ravi は ``finance`` プロジェクトにアクセスする必要があります。
ta: ரவிக்கு ``நிதி`` திட்டத்திற்கான அணுகல் தேவை.

source: Amyra needs access to both projects.
es_un: Amyra necesita acceso a ambos proyectos.
ja: Amyraは両方のプロジェクトにアクセスできる必要があります。
ta: இரண்டு திட்டங்களுக்கும் அமிராவுக்கு அணுகல் தேவை.

source: Users are defined in IBM Cloud but project assignments are done in an App ID instance.
es_un: Los usuarios se definen en IBM Cloud, pero las asignaciones de proyectos se realizan en una instancia de App ID.
ja: ユーザーは IBM Cloud で定義されますが、App ID インスタンスでプロジェクトの割り当てが行われます。
ta: பயனர்கள் IBM Cloud இல் வரையறுக்கப்பட்டுள்ளனர் ஆனால் திட்டப்பணிகள் ஆப் ஐடி நிகழ்வில் செய்யப்படுகின்றன.

source: The Cloud administrator creates an App ID instance and ensures that it is linked in the Cloud administrator’s account. The administrator notes the ID provider URL to share it with users.
es_un: El administrador de Cloud crea una instancia de App ID y se asegura de que esté vinculada en la cuenta del administrador de Cloud. El administrador anota la URL del proveedor de ID para compartirla con los usuarios.
ja: クラウド管理者は、アプリケーション ID インスタンスを作成し、それがクラウド管理者のアカウントでリンクされていることを確認します。 管理者は ID プロバイダー URL をメモして、ユーザーと共有します。
ta: கிளவுட் நிர்வாகி ஆப் ஐடி நிகழ்வை உருவாக்கி, அது கிளவுட் நிர்வாகியின் கணக்கில் இணைக்கப்பட்டுள்ளதை உறுதிசெய்கிறார். ஐடி வழங்குநரின் URL ஐ பயனர்களுடன் பகிர நிர்வாகி குறிப்பிடுகிறார்.

source: The ``ml`` access group can access ``QR-ml`` and ``QR-common``. This access group needs a dynamic rule for the App ID IDP that accepts users whose ``project`` attribute contains ``ml``.
es_un: El grupo de acceso ``ml`` puede acceder a ``QR-ml`` y ``QR-common``. Este grupo de acceso necesita una regla dinámica para el IDP del App ID que acepta usuarios cuyo atributo ``project`` contiene ``ml``.
ja: ``ml`` アクセスグループは ``QR-ml`` と ``QR-common`` にアクセスできます。 このアクセスグループには、``project`` 属性が ``ml`` を含むユーザーを受け入れるアプリケーション ID IDPの動的ルールが必要です。
ta: ``ml`` அணுகல் குழு ``QR-ml`` மற்றும் ``QR-common`` ஆகியவற்றை அணுகலாம். ``திட்டம்`` பண்புக்கூறில் ``மிலி`` உள்ள பயனர்களை ஏற்கும் ஆப் ஐடி ஐடிபிக்கான டைனமிக் விதி இந்த அணுகல் குழுவிற்குத் தேவை.

source: The ``finance`` access group can access ``QR-finance`` and ``QR-common``. This access group nees a dynamic rule for the App ID IDP that accepts users whose ``project`` attribute contains ``finance``.
es_un: El grupo de acceso ``finance`` puede acceder a ``QR-finance`` y ``QR-common``. Este grupo de acceso necesita una regla dinámica para el IDP del App ID que acepta usuarios cuyo atributo ``project`` contenga ``finance``.
ja: ``finance`` アクセスグループは ``QR-finance`` と ``QR-common`` にアクセスできます。 このアクセスグループは、``project`` 属性に ``finance`` が含まれているユーザーを受け入れるApp ID IDPの動的ルールを指定します。
ta: ``நிதி`` அணுகல் குழு ``QR-finance`` மற்றும் ``QR-common`` ஆகியவற்றை அணுகலாம். ``திட்டம்`` பண்புக்கூறில் ``நிதி`` உள்ள பயனர்களை ஏற்கும் ஆப் ஐடி ஐடிபிக்கான டைனமிக் விதி இந்த அணுகல் குழுவிற்குத் தேவை.

source: The ID provider administrator defines the three users in the IBM Cloud user interface.
es_un: El administrador del proveedor de ID define los tres usuarios en la interfaz de usuario de IBM Cloud.
ja: ID プロバイダー管理者は、IBM Cloud ユーザー インターフェイス内の 3 つのユーザーを定義します。
ta: ஐடி வழங்குநர் நிர்வாகி IBM கிளவுட் பயனர் இடைமுகத்தில் உள்ள மூன்று பயனர்களை வரையறுக்கிறார்.

source: Users log in at least once.
es_un: Los usuarios inician sesión al menos una vez.
ja: ユーザーは少なくとも一度はログインしてください。
ta: பயனர்கள் ஒரு முறையாவது உள்நுழைய வேண்டும்.

source: The cloud administrator assigns access by adding users to the access groups that give them access to the projects:
es_un: El administrador de Cloud asigna acceso agregando usuarios a los grupos de acceso que les dan acceso a los proyectos:
ja: クラウド管理者は、プロジェクトへのアクセスを許可するアクセスグループにユーザーを追加することでアクセス権を割り当てます。
ta: திட்டங்களுக்கான அணுகலை வழங்கும் அணுகல் குழுக்களில் பயனர்களைச் சேர்ப்பதன் மூலம் கிளவுட் நிர்வாகி அணுகலை ஒதுக்குகிறார்:

source: Fatima is given access to the ``ml`` project.
es_un: Fatima tiene acceso al proyecto ``ml``.
ja: Fatima は ``ml`` プロジェクトへのアクセスを与えられます。
ta: ``ml`` திட்டத்திற்கான அணுகல் பாத்திமாவுக்கு வழங்கப்பட்டது.

source: Ravi is given access to the ``finance`` project.
es_un: Ravi tiene acceso al proyecto ``finance``.
ja: Ravi は ``finance`` プロジェクトへのアクセスを与えられます。
ta: ரவிக்கு ``நிதி`` திட்டத்திற்கான அணுகல் வழங்கப்பட்டது.

source: Amyra is given access to the ``ml`` and ``finanace`` projects.
es_un: Amyra tiene acceso a ambos proyectos ``ml`` y ``finanace``.
ja: Amyra は ``ml`` と ``finanace`` プロジェクトにアクセスすることができます。
ta: ``எம்எல்`` மற்றும் ``நிதி`` திட்டங்களுக்கான அணுகல் அமிராவுக்கு வழங்கப்பட்டது.

source: Users can log in through the ID provider URL, create API keys, and work with their projects’ service instances.
es_un: Los usuarios pueden iniciar sesión a través de la URL del proveedor de ID, crear claves de API y trabajar con las instancias de servicio de sus proyectos.
ja: ユーザーはIDプロバイダーURLからログインし、APIキーを作成し、プロジェクトのサービスインスタンスを使用できます。
ta: பயனர்கள் ஐடி வழங்குநரின் URL மூலம் உள்நுழையலாம், API விசைகளை உருவாக்கலாம் மற்றும் அவர்களின் திட்டங்களின் சேவை நிகழ்வுகளுடன் வேலை செய்யலாம்.

source: Manage ID provider users with the ID provider
es_un: Administrar usuarios de proveedor de ID con el proveedor de ID
ja: ID プロバイダーのユーザーを管理します
ta: ஐடி வழங்குநருடன் ஐடி வழங்குநர் பயனர்களை நிர்வகிக்கவும்

source: App ID creates an ID provider so you can add users directly in App ID or connect to other external ID providers. This tutorial describes how to set up your ID provider to work with users that do not have IBM Cloud accounts.
es_un: App ID crea un proveedor de ID para que puedas agregar usuarios directamente en App ID o conectarse a otros proveedores de ID externos. Este tutorial describe cómo configurar tu proveedor de ID para trabajar con usuarios que no tienen cuentas de IBM Cloud.
ja: App ID は、ID プロバイダを作成するため、App ID に直接ユーザーを追加したり、他の外部 ID プロバイダに接続したりできます。 このチュートリアルでは、IBM Cloud アカウントを持たないユーザーと連携するように ID プロバイダーを設定する方法について説明します。
ta: ஆப் ஐடி ஒரு ஐடி வழங்குநரை உருவாக்குகிறது, எனவே நீங்கள் நேரடியாக ஆப் ஐடியில் பயனர்களைச் சேர்க்கலாம் அல்லது பிற வெளிப்புற ஐடி வழங்குநர்களுடன் இணைக்கலாம். ஐபிஎம் கிளவுட் கணக்குகள் இல்லாத பயனர்களுடன் பணிபுரிய உங்கள் ஐடி வழங்குநரை எவ்வாறு அமைப்பது என்பதை இந்த டுடோரியல் விவரிக்கிறது.

source: `Open App ID from the IBM Cloud catalog <https://cloud.ibm.com/catalog/services/app-id>`__ and log in. Specify the following values:
es_un: `Abre App ID desde el catálogo de IBM Cloud <https://cloud.ibm.com/catalog/services/app-id>`__ e inicia sesión. Especifica los siguientes valores:
ja: `IBM Cloud カタログからApp ID を開き <https://cloud.ibm.com/catalog/services/app-id>`__ 、ログインします。次の値を指定します。
ta: `IBM கிளவுட் அட்டவணையில் இருந்து ஆப் ஐடியைத் திறந்து <https://cloud.ibm.com/catalog/services/app-id>`__ உள்நுழையவும். பின்வரும் மதிப்புகளைக் குறிப்பிடவும்:

source: For **Select a location**, it is recommended to keep it in the same location as the Qiskit Runtime service, which is ``Washington DC (us-east)``.
es_un: Para **Select a location**, se recomienda mantenerla en la misma ubicación que el servicio Qiskit Runtime, que es ``Washington DC (us-east)``.
ja: **場所を選択**するには、``Washington DC (us-east)`` の Qiskit Runtime サービスと同じ場所に保管することをお勧めします。
ta: **ஒரு இருப்பிடத்தைத் தேர்ந்தெடு** என்பதற்கு, Qiskit இயக்க நேரச் சேவை இருக்கும் அதே இடத்தில் வைக்க பரிந்துரைக்கப்படுகிறது, இது ``Washington DC (us-east)``.

source: The **Graduated tier** is paid per event and per user beyond the Lite tier limits. This tier supports more features such as multi-factor authentication. The Cloud administrator as the owning account of the App ID instance is charged for any costs for the graduated tier instances.
es_un: El **Graduated tier** se paga por evento y por usuario más allá de los límites del nivel básico (Lite). Este nivel admite más funciones, como la autenticación multifactor. Al administrador de Cloud, como cuenta propietaria de la instancia de App ID, se le cobran los costos de las instancias del *graduated tier*.
ja: **段階的な階層** は、イベントごとおよびユーザーごとに、 ライト層の制限を超えて支払われます。 この層は、多要素認証などの追加機能をサポートします。 アプリケーション ID インスタンスの所有アカウントとしてのクラウド管理者は、段階的なインスタンスの料金に対して請求されます。
ta: லைட் அடுக்கு வரம்புகளுக்கு அப்பால் ஒரு நிகழ்விற்கும் ஒரு பயனருக்கும் **பட்டம் பெற்ற அடுக்கு** செலுத்தப்படுகிறது. இந்த அடுக்கு பல காரணி அங்கீகாரம் போன்ற கூடுதல் அம்சங்களை ஆதரிக்கிறது. ஆப் ஐடி நிகழ்வின் சொந்தக் கணக்காக கிளவுட் நிர்வாகியிடம் இருந்து பட்டம் பெற்ற அடுக்கு நிகழ்வுகளுக்கான ஏதேனும் செலவுகள் விதிக்கப்படும்.

source: create
ja: 作成
ta: உருவாக்கு

source: Navigate to **Manage Authentication** → **Cloud Directory** → **Settings** and choose whether user logins should use email or usernames.
es_un: Dirígete a **Manage Authentication** → **Cloud Directory** → **Settings** y elige si los inicios de sesión de usuario deben usar correo electrónico o nombres de usuario.
ja: **認証の管理** → **クラウド・ディレクトリ** → **設定** に移動し、ユーザログインに電子メールまたはユーザ名を使用するかどうかを選択します。
ta: ** அங்கீகாரத்தை நிர்வகித்தல்** → **கிளவுட் டைரக்டரி** → **அமைப்புகள்** என்பதற்குச் சென்று, பயனர் உள்நுழைவுகள் மின்னஞ்சல் அல்லது பயனர்பெயர்களைப் பயன்படுத்த வேண்டுமா என்பதைத் தேர்வுசெய்யவும்.

source: Optional: Open **Manage Authentication** → **Cloud Directory** → **Password Policies** to define the password strength.
es_un: Opcional: Abre **Manage Authentication** → **Cloud Directory** → **Password Policies** para definir la fortaleza de la contraseña.
ja: 必要に応じて、パスワードの強度を定義するために、**認証の管理** → **クラウド・ディレクトリ** → **パスワードポリシー** に移動します。
ta: விருப்பத்தேர்வு: கடவுச்சொல் வலிமையை வரையறுக்க ** அங்கீகாரத்தை நிர்வகி** → **கிளவுட் டைரக்டரி** → **கடவுச்சொல் கொள்கைகள்** என்பதைத் திறக்கவும்.

source: identity
ja: アイデンティティー
ta: அடையாளம்

source: Add a dynamic rule to the access group
es_un: Agregar una regla dinámica al grupo de acceso
ja: アクセス・グループに動的ルールを追加
ta: அணுகல் குழுவில் டைனமிக் விதியைச் சேர்க்கவும்

source: The access group needs a dynamic rule to test whether it should be applied to an IDP user when they log in.
es_un: El grupo de acceso necesita una regla dinámica para probar si se debe aplicar a un usuario IDP cuando inicia sesión.
ja: アクセスグループには、ログイン時に IDP ユーザーに適用するかどうかをテストするために、動的なルールが必要です。
ta: அணுகல் குழுவில் டைனமிக் விதியைச் சேர்க்கவும்.

source: Because the dynamic rules are evaluated during login, any changes are picked up the next time the user logs in. {: note}
es_un: Debido a que las reglas dinámicas se evalúan durante el inicio de sesión, los cambios se recogen la próxima vez que el usuario inicia sesión. {: note}
ja: 動的ルールはログイン時に評価されるため、次回ログイン時に変更が検出されます。 {: note}
ta: உள்நுழைவின் போது மாறும் விதிகள் மதிப்பீடு செய்யப்படுவதால், அடுத்த முறை பயனர் உள்நுழையும்போது ஏதேனும் மாற்றங்கள் எடுக்கப்படும். {: note}

source: Navigate to `Manage → IAM → Access groups <https://cloud.ibm.com/iam/groups>`__ and click your access group to open its details page.
es_un: Dirígete a `Manage → IAM → Access groups <https://cloud.ibm.com/iam/groups>`__ y haz clic en tu grupo de acceso para abrir su página de detalles.
ja: `管理 → IAM → グループへのアクセス <https://cloud.ibm.com/iam/groups>`__ に移動し、アクセスグループをクリックして詳細ページを開きます。
ta: `நிர்வகி → IAM → அணுகல் குழுக்களுக்கு <https://cloud.ibm.com/iam/groups>`__ என்பதற்குச் சென்று அதன் விவரங்கள் பக்கத்தைத் திறக்க உங்கள் அணுகல் குழுவைக் கிளிக் செய்யவும்.

source: Click the **Dynamic rules** tab, then click **Add**.
es_un: Haz clic en la pestaña **Dynamic rules** y luego haz clic en **Add**.
ja: **Dynamic rules** タブをクリックし、**Add** をクリックします。
ta: **டைனமிக் விதிகள்** தாவலைக் கிளிக் செய்து, **சேர்** என்பதைக் கிளிக் செய்யவும்.

source: Provide a name.
es_un: Proporciona un nombre.
ja: 名前を入力してください。
ta: ஒரு பெயரை வழங்கவும்.

source: For the Authentication method, choose **Users federated by IBM Cloud AppID**, then select the IDP from the Identity provider drop-down list.
es_un: Para el método de autenticación, elige **Users federated by IBM Cloud AppID**, luego selecciona el IDP de la lista desplegable Identity provider.
ja: 認証方法については、**IBM Cloud AppIDによって連携されたユーザー** を選択し、アイデンティティー・プロバイダーのドロップダウンリストからIDPを選択します。
ta: அங்கீகார முறைக்கு, **IBM Cloud AppID மூலம் கூட்டமைக்கப்பட்ட பயனர்கள்** என்பதைத் தேர்வுசெய்து, அடையாள வழங்குநர் கீழ்தோன்றும் பட்டியலில் இருந்து IDPயைத் தேர்ந்தெடுக்கவும்.

source: Dynamic
ja: ダイナミック
ta: இயக்கவியல்

source: Click **Add a condition**, complete the following values, then click **Add**.
es_un: Haz clic en **Add a condition**, completa los siguientes valores y luego haz clic en **Add**.
ja: **条件を追加** をクリックし、次の値を完了し、**追加** をクリックします。
ta: **ஒரு நிபந்தனையைச் சேர்** என்பதைக் கிளிக் செய்து, பின்வரும் மதிப்புகளை நிறைவுசெய்து, **சேர்** என்பதைக் கிளிக் செய்யவும்.

source: In the **Allow users when** field, enter the attribute key that is used by the IDP administrator in the ID provider user attributes, such as ``project`` (this string is a convention that is defined during planning).
es_un: En el campo **Allow users when**, ingresa la clave de atributo que utiliza el administrador de IDP en los atributos de usuario del proveedor de ID, como ``project`` (esta cadena es una convención que se define durante la planeación).
ja: **Allow users when** フィールドに、ID プロバイダーのユーザ属性に IDP 管理者が使用する属性キーを入力します。 例えば、``project`` (この文字列は計画中に定義される規約です) など。
ta: **பயனர்களை அனுமதிக்கும் போது** புலத்தில், ``திட்டம்`` போன்ற ஐடி வழங்குநரின் பயனர் பண்புக்கூறுகளில் IDP நிர்வாகியால் பயன்படுத்தப்படும் பண்புக்கூறு விசையை உள்ளிடவும் (இந்த சரம் திட்டமிடலின் போது வரையறுக்கப்பட்ட ஒரு மாநாடு).

source: Select **Contains** as the **Qualifier**.
es_un: Selecciona **Contains** como el **Qualifier**.
ja: **Qualifier** として **Contains** を選択します。
ta: **குவாலிஃபையர்** ஆக **கொண்டுள்ளது** என்பதைத் தேர்ந்தெடுக்கவும்.

source: In **Values**, enter the value, such as ``ml``. This is the same value that the IDP administrator uses in the IDP user profile definition. It is typically the project name.
es_un: En **Values**, ingresa el valor, como ``ml``. Este es el mismo valor que utiliza el administrador de IDP en la definición del perfil de usuario de IDP. Suele ser el nombre del proyecto.
ja: **Values** には、``ml`` などの値を入力します。 これはIDP管理者がIDPユーザープロファイル定義で使用するのと同じ値です。通常はプロジェクト名です。
ta: **மதிப்புகள்** இல், ``ml`` போன்ற மதிப்பை உள்ளிடவும். IDP பயனர் சுயவிவர வரையறையில் IDP நிர்வாகி பயன்படுத்தும் அதே மதிப்பு இதுவாகும். இது பொதுவாக திட்டத்தின் பெயர்.

source: You might want to increase the **Session duration** to increase the period before users must log back in. Logged-in users keep their access group membership for that period, and reevaluation takes place on the next login.
es_un: Es posible que desees aumentar la **Session duration** para aumentar el periodo antes de que los usuarios deban volver a iniciar sesión. Los usuarios que iniciaron sesión mantienen su membresía de grupo de acceso durante ese periodo y la reevaluación se realiza en el próximo inicio de sesión.
ja: ユーザーがログインする前に、**セッションの期間** を増やすことをお勧めします。 ログインしたユーザーは、その期間、アクセスグループのメンバーシップを維持し、再評価は次回のログイン時に行われます。
ta: பயனர்கள் மீண்டும் உள்நுழைய வேண்டிய காலகட்டத்தை அதிகரிக்க, **அமர்வு காலத்தை** அதிகரிக்க நீங்கள் விரும்பலாம். உள்நுழைந்த பயனர்கள் அந்தக் காலக்கட்டத்தில் தங்கள் அணுகல் குழு உறுப்பினர்களை வைத்து, அடுத்த உள்நுழைவில் மறுமதிப்பீடு நடைபெறும்.

source: Condition
ja: 条件
ta: நிபந்தனை

source: Add users
es_un: Agregar usuarios
ja: ユーザの追加
ta: பயனர்களைச் சேர்க்கவும்

source: When you use App ID as ID provider with the Cloud directory, you can create users in the Cloud user interface.
es_un: Cuando utilizas App ID como proveedor de ID con el directorio de Cloud, puedes crear usuarios en la interfaz de usuario de Cloud.
ja: Cloud ディレクトリで App ID を ID プロバイダとして使用すると、IBM Cloud ユーザー インターフェイスでユーザーを作成できます。
ta: கிளவுட் கோப்பகத்துடன் ஐடி வழங்குநராக ஆப் ஐடியைப் பயன்படுத்தும்போது, ​​கிளவுட் பயனர் இடைமுகத்தில் பயனர்களை உருவாக்கலாம்.

source: If the IDP administrator will assign users to projects, you can define project values in the user’s attributes.
es_un: Si el administrador de IDP asignará usuarios a los proyectos, puedes definir los valores del proyecto en los atributos del usuario.
ja: IDP管理者がユーザーをプロジェクトに割り当てる場合は、ユーザーの属性でプロジェクト値を定義できます。
ta: IDP நிர்வாகி திட்டங்களுக்கு பயனர்களை ஒதுக்கினால், பயனரின் பண்புக்கூறுகளில் திட்ட மதிப்புகளை நீங்கள் வரையறுக்கலாம்.

source: Go to **Manage Authentication** → **Cloud Directory** → **Users**, and click a user to open it.
es_un: Dirígete a **Manage Authentication** → **Cloud Directory** → **Users** y haz clic en un usuario para abrirlo.
ja: **認証の管理** → **クラウドディレクトリ** → **ユーザー** に移動し、ユーザーをクリックして開きます。
ta: ** அங்கீகாரத்தை நிர்வகி** → **கிளவுட் டைரக்டரி** → **பயனர்கள்** என்பதற்குச் சென்று, அதைத் திறக்க ஒரு பயனரைக் கிளிக் செய்யவும்.

source: Scroll down to **Custom Attributes**, and click **Edit**.
es_un: Desplázate hacia abajo hasta **Custom Attributes** y haz clic en **Edit**.
ja: **カスタム属性** までスクロールして **編集** をクリックします。
ta: **தனிப்பயன் பண்புக்கூறுகள்** என்பதற்கு கீழே உருட்டி, **திருத்து** என்பதைக் கிளிக் செய்யவும்.

source: Enter a key value pair that can will checked by the dynamic rules of the access groups, then click **Save**. You can add several values in the same string (for example, ``{"project":"ml finance"}``); the **contains** qualifier of the dynamic rule detects a match of a substring. For our example, add ``{"project":"ml"}``.
es_un: Ingresa un par de valores clave que puedan ser verificados por las reglas dinámicas de los grupos de acceso, luego haz clic en **Save**. Puedes agregar varios valores en la misma cadena (por ejemplo, ``{"project":"ml finance"}``); el calificador **contains** de la regla dinámica detecta una coincidencia de una subcadena. Para nuestro ejemplo, agrega ``{"project":"ml"}``.
ja: アクセス グループの動的ルールでチェックできるキー値のペアを入力し、**保存** をクリックします。 同じ文字列に複数の値を追加することができます (例えば、 ``{"project":"ml finance"}``); 動的ルールの **contains** 修飾子は、部分文字列の一致を検出します。 この例では、``{"project":"ml"}`` を追加します。
ta: அணுகல் குழுக்களின் டைனமிக் விதிகளால் சரிபார்க்கப்படும் முக்கிய மதிப்பு ஜோடியை உள்ளிடவும், பின்னர் **சேமி** என்பதைக் கிளிக் செய்யவும். ஒரே சரத்தில் பல மதிப்புகளைச் சேர்க்கலாம் (உதாரணமாக, ``{"திட்டம்":"மிலி நிதி"}``); டைனமிக் விதியின் **கொண்டுள்ளது** ஒரு துணைச்சரத்தின் பொருத்தத்தைக் கண்டறியும். எங்கள் உதாரணத்திற்கு, ``{"திட்டம்":"ml"}`` ஐச் சேர்க்கவும்.

source: The value ``project`` corresponds to the convention defined in the planning section. ``ml`` is the project that the user belongs to.
es_un: El valor ``project`` corresponde a la convención definida en la sección de planeación. ``ml`` es el proyecto al que pertenece el usuario.
ja: 値 ``project`` は、計画セクションで定義された規約に対応します。``ml`` はユーザーが属するプロジェクトです。
ta: ``திட்டம்`` மதிப்பானது திட்டமிடல் பிரிவில் வரையறுக்கப்பட்ட மரபுக்கு ஒத்திருக்கிறது. ``ml`` என்பது பயனருக்குச் சொந்தமான திட்டமாகும்.
