Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/cloud/cloud-provider-org.po
Languages: es_un, ja, ta

source: This check is done on every login, so changes in the ID provider user attributes will be effective when a user next logs in.
es_un: Esta comprobación se realiza en cada inicio de sesión, por lo que los cambios en los atributos de usuario del proveedor de ID serán efectivos la próxima vez que un usuario inicie sesión.
ja: このチェックはログインごとに行われるため、ID プロバイダのユーザ属性の変更は、次回ログイン時に有効になります。
ta: இந்தச் சரிபார்ப்பு ஒவ்வொரு உள்நுழைவிலும் செய்யப்படுகிறது, எனவே ஒரு பயனர் அடுத்து உள்நுழையும்போது ஐடி வழங்குநரின் பயனர் பண்புக்கூறுகளில் மாற்றங்கள் பயனுள்ளதாக இருக்கும்.

source: A user is sent the ID provider URL for the IBM Cloud account.
es_un: A un usuario se le envía la URL del proveedor de ID para la cuenta de IBM Cloud.
ja: IBM Cloud アカウントの ID プロバイダー URL がユーザーに送信されます。
ta: ஐபிஎம் கிளவுட் கணக்கிற்கான ஐடி வழங்குநரின் URL ஒரு பயனருக்கு அனுப்பப்பட்டது.

source: To work with Qiskit Runtime serive instances, users must create an API key by going to `Manage → Access (IAM) → API keys <https://cloud.ibm.com/iam/apikeys>`__.
es_un: Para trabajar con las instancias del servicio Qiskit Runtime, los usuarios deben crear una clave de API dirigiéndose a `Manage → Access (IAM) → API keys <https://cloud.ibm.com/iam/apikeys>`__.
ja: Qiskit Runtimeサービスインスタンスを操作するには、ユーザーは `管理（Manage） → アクセス (Access、IAM) → API キー（API keys） <https://cloud.ibm.com/iam/apikeys>`__ に移動して、API キーを作成する必要があります。

source: The ``finance`` project needs access to the service instances ``QR-finance`` and ``QR-common``.
es_un: El proyecto ``finance`` necesita acceso a las instancias de servicio ``QR-finance`` y ``QR-common``.
ja: ``finance`` プロジェクトはサービスインスタンスの ``QR-finance`` と ``QR-common`` にアクセスする必要があります。
ta: ``நிதி`` திட்டத்திற்கு ``QR-finance`` மற்றும் ``QR-common`` சேவை நிகழ்வுகளுக்கான அணுகல் தேவை.

source: Users are defined in an App ID instance and project assignments are also done there.
es_un: Los usuarios se definen en una instancia de App ID y las asignaciones de proyectos también se realizan allí.
ja: ユーザーは App ID インスタンスで定義され、プロジェクトの割り当ても行われます。
ta: பயன்பாட்டு ஐடி நிகழ்வில் பயனர்கள் வரையறுக்கப்பட்டுள்ளனர் மற்றும் திட்டப்பணிகளும் அங்கு செய்யப்படுகின்றன.

source: The ``finance`` access group can access ``QR-finance`` and ``QR-common``. This access group needs a dynamic rule for the App ID IDP that accepts users whose ``project`` attribute contains ``finance``.
es_un: El grupo de acceso ``finance`` puede acceder a ``QR-finance`` y ``QR-common``. Este grupo de acceso necesita una regla dinámica para el IDP del App ID que acepta usuarios cuyo atributo ``project`` contenga ``finance``.
ja: ``finance`` アクセスグループは ``QR-finance`` と ``QR-common`` にアクセスできます。 このアクセスグループは、``project`` 属性に ``finance`` が含まれているユーザーを受け入れるApp ID IDPの動的ルールを指定します。
ta: ``நிதி`` அணுகல் குழு ``QR-finance`` மற்றும் ``QR-common`` ஆகியவற்றை அணுகலாம். ``திட்டம்`` பண்புக்கூறில் ``நிதி`` உள்ள பயனர்களை ஏற்கும் ஆப்ஸ் ஐடி ஐடிபிக்கான டைனமிக் விதி இந்த அணுகல் குழுவிற்குத் தேவை.

source: The IDP administrator uses the App ID instance that the Cloud administrator created and defines the three users:
es_un: El administrador de IDP utiliza la instancia de App ID que creó el administrador de Cloud y define los tres usuarios:
ja: IDP管理者は、クラウド管理者が作成し、3つのユーザーを定義するApp IDインスタンスを使用します。
ta: கிளவுட் நிர்வாகி உருவாக்கிய ஆப் ஐடி நிகழ்வை ஐடிபி நிர்வாகி பயன்படுத்துகிறார் மற்றும் மூன்று பயனர்களை வரையறுக்கிறார்:

source: For Fatima, the custom attributes contain ``{"project":"ml"}``.
es_un: Para Fatima, los atributos personalizados contienen ``{"project":"ml"}``.
ja: Fatimaの場合、カスタム属性には ``{"project":"ml"}`` が含まれます。
ta: பாத்திமாவைப் பொறுத்தவரை, தனிப்பயன் பண்புக்கூறுகளில் ``{"திட்டம்":"மிலி"}`` உள்ளது.

source: For Ravi, the custom attributes contain ``{"project":"finance"}``.
es_un: Para Ravi, los atributos personalizados contienen ``{"project":"finance"}``.
ja: Ravi の場合、カスタム属性には ``{"project":"finance"}`` が含まれます。
ta: ரவிக்கு, தனிப்பயன் பண்புக்கூறுகளில் ``{"திட்டம்":"நிதி"}`` உள்ளது.

source: For Amyra, the custom attributes contain ``{"project":"ml finance"}``.
es_un: Para Amyra, los atributos personalizados contienen ``{"project":"ml finance"}``.
ja: Amyra の場合、カスタム属性には ``{"project":"ml finance"}`` が含まれます。
ta: அமிராவைப் பொறுத்தவரை, தனிப்பயன் பண்புக்கூறுகளில் ``{"திட்டம்":"மிலி நிதி"}`` உள்ளது.

source: Next steps
es_un: Siguientes pasos
ja: 次のステップ
ta: அடுத்த படிகள்

source: |create|
ta: |உருவாக்கு|

source: |identity|
ta: |அடையாளம்|

source: |Dynamic|
ta: |இயக்கவியல்|

source: |Condition|
ta: |நிபந்தனை|
