Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/cloud/cloud-provider-org.po
Languages: es_un, ja, ta

source: Manage users
es_un: Administrar usuarios
ja: ユーザーの管理
ta: பயனர்களை நிர்வகிக்கவும்

source: You can manage IBM Cloud users or ID provider users. Follow the instructions in the relevant section, depending on your setup.
es_un: Puedes administrar usuarios de IBM Cloud o usuarios de proveedor de ID. Sigue las instrucciones en la sección correspondiente, dependiendo de tu configuración.
ja: IBM Cloud ユーザーまたは ID プロバイダー・ユーザーを管理できます。 ご使用のセットアップに応じて、関連するセクションの指示に従ってください。

source: Manage IBM Cloud users
es_un: Administrar usuarios de IBM Cloud
ja: IBM Cloud ユーザーの管理
ta: IBM கிளவுட் பயனர்களை நிர்வகிக்கவும்

source: This tutorial how to use IBM Cloud to enable users who have IBM Cloud accounts and gives instructions for users to access the environment.
es_un: Este tutorial muestra cómo utilizar IBM Cloud para habilitar a los usuarios que tienen cuentas de IBM Cloud y proporciona instrucciones para que los usuarios accedan al entorno.
ja: このチュートリアルでは、IBM Cloud アカウントを持っているユーザーを有効にし、ユーザーが環境にアクセスするための指示を与えるために、IBM Cloud を使用する方法を示します。

source: Invite users
es_un: Invitar usuarios
ja: ユーザーの招待
ta: பயனர்களை அழைக்கவும்

source: Ensure that the users that you want to invite have IBM Cloud accounts.
es_un: Asegúrate de que los usuarios que deseas invitar tengan cuentas de IBM Cloud.
ja: 招待したいユーザーが IBM Cloud アカウントを持っていることを確認します。
ta: நீங்கள் அழைக்க விரும்பும் பயனர்களுக்கு IBM Cloud கணக்குகள் இருப்பதை உறுதிசெய்யவும்.

source: Go to Manage → Access (IAM) and click `Invite users <https://cloud.ibm.com/iam/users/invite_users>`__.
es_un: Dirígete a Manage → Access (IAM) y haz clic en `Invite users <https://cloud.ibm.com/iam/users/invite_users>`__.
ja: 管理（Manage） → アクセス (Access、IAM) に進み、`ユーザーを招待する（Invite users） <https://cloud.ibm.com/iam/users/invite_users>`__ をクリックします。
ta: Manage → Access (IAM) என்பதற்குச் சென்று `Invite users <https://cloud.ibm.com/iam/users/invite_users>`__ என்பதைக் கிளிக் செய்யவும்.

source: Enter the email addresses of users to be added.
es_un: Ingresa las direcciones de correo electrónico de los usuarios que serán agregados.
ja: 追加するユーザーのメールアドレスを入力します。
ta: சேர்க்கப்பட வேண்டிய பயனர்களின் மின்னஞ்சல் முகவரிகளை உள்ளிடவும்.

source: Select the access group or groups of the projects that the users will be part of. These assignments can be changed later.
es_un: Selecciona el grupo o grupos de acceso de los proyectos de los que formarán parte los usuarios. Estas asignaciones se pueden cambiar más adelante.
ja: ユーザが参加するプロジェクトのアクセスグループまたはグループを選択します．これらのアサインは後で変更できます．
ta: பயனர்கள் அங்கம் வகிக்கும் திட்டங்களின் அணுகல் குழு அல்லது குழுக்களைத் தேர்ந்தெடுக்கவும். இந்தப் பணிகள் பின்னர் மாற்றப்படலாம்.

source: Click Add to confirm the access group selection.
es_un: Haz clic en Add para confirmar la selección del grupo de acceso.
ja: 追加（Add）をクリックして、アクセス・グループの選択を確認します。
ta: அணுகல் குழு தேர்வை உறுதிப்படுத்த Add என்பதைக் கிளிக் செய்யவும்.

source: Click Invite to send the invitation to the users.
es_un: Haz clic en Invite para enviar la invitación a los usuarios.
ja: 招待（Invite）をクリックして、ユーザーに招待を送信します。
ta: பயனர்களுக்கு அழைப்பிதழை அனுப்ப invite என்பதைக் கிளிக் செய்யவும்.

source: Users cannot be managed until they accept the invitation and log in at least once.
es_un: Los usuarios no se pueden administrar hasta que acepten la invitación e inicien sesión al menos una vez.
ja: 招待を承認し、少なくとも一度のログインをするまで、ユーザーは管理できません。
ta: அழைப்பை ஏற்று ஒரு முறையாவது உள்நுழையும் வரை பயனர்களை நிர்வகிக்க முடியாது.

source: Optional: Modify users’ project assignments
es_un: Opcional: Modificar las asignaciones de proyectos de los usuarios
ja: オプション: ユーザーのプロジェクトのアサインを変更
ta: விருப்பத்தேர்வு: பயனர்களின் திட்டப்பணிகளை மாற்றவும்

source: Go to `Manage → Access (IAM) → Users <https://cloud.ibm.com/iam/users>`__ and click the user.
es_un: Dirígite a `Manage → Access (IAM) → Users <https://cloud.ibm.com/iam/users>`__ y haz clic en el usuario.
ja: `管理（Manage） → アクセス (Access、IAM) → ユーザー（Users） <https://cloud.ibm.com/iam/users>`__ に移動し、ユーザーをクリックします。
ta: `Manage → Access (IAM) → Users <https://cloud.ibm.com/iam/users>`__ என்பதற்குச் சென்று Userஐ கிளிக் செய்யவும்.

source: change1
ja: 変更 1

source: Add access groups with **Assign group** or remove the user from an access group by clicking the three dot menu and choosing **Remove user**.
es_un: Agrega grupos de acceso con **Assign group** o elimina al usuario de un grupo de acceso haciendo clic en el menú de tres puntos y eligiendo **Remove user**.
ja: **Assign group** でアクセスグループを追加するか、3 つのドットメニューをクリックして **Remove user** を選択してアクセスグループからユーザーを削除します。
ta: **Assign group** உடன் அணுகல் குழுக்களைச் சேர்க்கவும் அல்லது மூன்று புள்ளிகள் மெனுவைக் கிளிக் செய்து **Remove user** என்பதைத் தேர்ந்தெடுப்பதன் மூலம் அணுகல் குழுவிலிருந்து பயனரை அகற்றவும்.

source: User Flow
es_un: Flujo del Usuario
ja: ユーザー・フロー

source: After they accept an invitation, users can log in through the `IBM Cloud portal <https://cloud.ibm.com/>`__.
es_un: Después de aceptar una invitación, los usuarios pueden iniciar sesión a través del `IBM Cloud portal <https://cloud.ibm.com/>`__.
ja: 招待を受け入れた後、ユーザーは `IBM Cloud ポータル <https://cloud.ibm.com/>`__ からログインできます。
ta: அவர்கள் அழைப்பை ஏற்றுக்கொண்ட பிறகு, பயனர்கள் `IBM Cloud portal <https://cloud.ibm.com/>`__ மூலம் உள்நுழையலாம்.

source: To work with Qiskit Runtime service instances, users must create an API key by going to `Manage → Access (IAM) → API keys <https://cloud.ibm.com/iam/apikeys>`__.
es_un: Para trabajar con las instancias del servicio Qiskit Runtime, los usuarios deben crear una clave de API dirigiéndose a `Manage → Access (IAM) → API keys <https://cloud.ibm.com/iam/apikeys>`__.
ja: Qiskit Runtimeサービスインスタンスを操作するには、ユーザーは `管理（Manage） → アクセス (Access、IAM) → API キー（API keys） <https://cloud.ibm.com/iam/apikeys>`__ に移動して、API キーを作成する必要があります。
ta: Qiskit இயக்க நேர சேவை நிகழ்வுகளுடன் பணிபுரிய, பயனர்கள் `Manage → Access (IAM) → API விசைகள் <https://cloud.ibm.com/iam/apikeys>`__ என்பதற்குச் சென்று API விசையை உருவாக்க வேண்டும்.

source: For further information, users can review `Getting started, Step 2 <quickstart#install-packages>`__.
es_un: Para obtener más información, los usuarios pueden consultar `Primeros pasos, Paso 2 <quickstart#install-packages>`__.
ja: 詳細については、 `はじめに ステップ２ <quickstart#install-packages>`__ を参照してください。
ta: மேலும் தகவலுக்கு, பயனர்கள் `தொடங்குதல், படி 2 <quickstart#install-packages>`__ மதிப்பாய்வு செய்யலாம்.

source: Example scenario
es_un: Escenario de ejemplo
ja: シナリオの例
ta: உதாரணம் காட்சி

source: In our example, we want to create the following setup:
es_un: En nuestro ejemplo, queremos crear la siguiente configuración:
ja: この例では、以下の設定を作成します。
ta: எங்கள் எடுத்துக்காட்டில், பின்வரும் அமைப்பை உருவாக்க விரும்புகிறோம்:

source: We have two projects, ``ml`` and ``finance``.
es_un: Tenemos dos proyectos, ``ml`` y ``finance``.
ja: ``ml`` と ``finance`` の2つのプロジェクトがあります。
ta: எங்களிடம் இரண்டு திட்டங்கள் உள்ளன, ``ml`` மற்றும் ``finance``.

source: The ``ml`` project should have access to the service instances ``QR-ml`` and ``QR-common``.
es_un: El proyecto ``ml`` debería tener acceso a las instancias de servicio ``QR-ml`` y ``QR-common``.
ja: ``ml`` プロジェクトは、サービス インスタンス ``QR-ml`` と ``QR-common`` にアクセスする必要があります。
ta: ``ml`` திட்டமானது ``QR-ml`` மற்றும் ``QR-common`` சேவை நிகழ்வுகளுக்கான அணுகலைப் பெற்றிருக்க வேண்டும்.

source: The ``finance`` project should have access to the service instances ``QR-finance`` and ``QR-common``.
es_un: El proyecto ``finance`` debería tener acceso a las instancias de servicio ``QR-finance`` y ``QR-common``.
ja: ``finance`` プロジェクトはサービスインスタンスの ``QR-finance`` と ``QR-common`` にアクセスする必要があります。
ta: ``finance`` திட்டமானது ``QR-finance`` மற்றும் ``QR-common`` சேவை நிகழ்வுகளுக்கான அணுகலைப் பெற்றிருக்க வேண்டும்.

source: We have three users:
es_un: Tenemos tres usuarios:
ja: 3人のユーザーがいます：
ta: எங்களிடம் மூன்று பயனர்கள் உள்ளனர்:

source: Fatima should have access to the ``ml`` project.
es_un: Fatima debería tener acceso al proyecto ``ml``.
ja: Fatimaは ``ml`` プロジェクトにアクセスする必要があります。
ta: பாத்திமாவுக்கு ``ml`` திட்டத்திற்கான அணுகல் இருக்க வேண்டும்.

source: Ravi should have access to the ``finance`` project.
es_un: Ravi debería tener acceso al proyecto ``finance``.
ja: Ravi は ``finance`` プロジェクトにアクセスする必要があります。
ta: ரவி க்கு ``finance`` திட்டத்திற்கான அணுகல் இருக்க வேண்டும்.

source: Amyra should have access to both projects.
es_un: Amyra debería tener acceso a ambos proyectos.
ja: Amyraは両方のプロジェクトにアクセスできる必要があります。
ta: அம்ரா இரண்டு திட்டங்களையும் அணுக வேண்டும்.

source: We will use access groups without resource groups.
es_un: Usaremos grupos de acceso sin grupos de recursos.
ja: リソース・グループのないアクセス・グループを使用します。
ta: ஆதாரக் குழுக்கள் இல்லாமல் அணுகல் குழுக்களைப் பயன்படுத்துவோம்.

source: Users are defined in IBM Cloud and project assignments are done there as well.
es_un: Los usuarios se definen en IBM Cloud y las asignaciones de proyectos también se realizan allí.
ja: ユーザーは IBM Cloud で定義され、プロジェクトの割り当ても行われます。
ta: IBM Cloud இல் பயனர்கள் வரையறுக்கப்பட்டுள்ளனர் மற்றும் திட்டப் பணிகள் அங்கேயும் செய்யப்படுகின்றன.

source: Users should be able to delete jobs.
es_un: Los usuarios deberían poder eliminar trabajos (jobs).
ja: ユーザーはジョブを削除できる必要があります。
ta: பயனர்கள் வேலைகளை நீக்க முடியும்.

source: The steps to implement this setup are:
es_un: Los pasos para implementar esta configuración son:
ja: このセットアップを実装する手順は次のとおりです。
ta: இந்த அமைப்பைச் செயல்படுத்துவதற்கான படிகள்:

source: The Cloud administrator creates three service instances: ``QR-ml``, ``QR finance``, and ``QR-common``.
es_un: El administrador de Cloud crea tres instancias de servicio: ``QR-ml``, ``QR finance``, y ``QR-common``.
ja: クラウド管理者は、``QR-ml`` 、 ``QR finance`` および ``QR-common`` の 3 つのサービスインスタンスを作成します。
ta: Cloud நிர்வாகம் மூன்று சேவை நிகழ்வுகளையும் உருவாக்குகிறது: ` ` QR-ml ` ` ` QR finance ` ` மற்றும் `` QR-common``.

source: The Cloud administrator creates a custom rule that includes the ``quantum-computing.job.delete`` action.
es_un: El administrador de Cloud crea una regla personalizada que incluye la acción ``quantum-computing.job.delete``.
ja: クラウド管理者は、``quantum-computing.job.delete`` アクションを含むカスタムルールを作成します。
ta: கிளவுட் நிர்வாகி தனிப்பயன் விதியை உருவாக்குகிறார், அதில் ``quantum-computing.job.delete`` செயல் அடங்கும்.

source: The Cloud administrator creates two access groups:
es_un: El administrador de Cloud crea dos grupos de acceso:
ja: クラウド管理者は、2つのアクセスグループを作成します。
ta: கிளவுட் நிர்வாகி இரண்டு அணுகல் குழுக்களை உருவாக்குகிறார்:

source: The ``ml`` access group can access ``QR-ml`` and ``QR-common``.
es_un: El grupo de acceso ``ml`` puede acceder a ``QR-ml`` y ``QR-common``.
ja: ``ml`` アクセスグループは ``QR-ml`` と ``QR-common`` にアクセスできます。
ta: ``ml`` அணுகல் குழு ``QR-ml`` மற்றும் ``QR-common`` ஆகியவற்றை அணுகலாம்.

source: The ``finance`` access group can access ``QR-finance`` and ``QR-common``.
es_un: El grupo de acceso ``finance`` puede acceder a ``QR-finance`` y ``QR-common``.
ja: ``finance`` アクセスグループは ``QR-finance`` と ``QR-common`` にアクセスできます。
ta: ``finance`` அணுகல் குழு ``QR-finance`` மற்றும் ``QR-common`` ஆகியவற்றை அணுகலாம்.

source: The Cloud administrator invites cloud users to the appropriate project. Specifically, they invite and assign users to an access group that includes the project.
es_un: El administrador de Cloud invita a los usuarios de la nube al proyecto apropiado. En concreto, invitan y asignan usuarios a un grupo de acceso que incluye el proyecto.
ja: クラウド管理者は、適切なプロジェクトにクラウドユーザーを招待します。具体的には、プロジェクトを含むアクセス・グループにユーザーを招待して割り当てます。
ta: கிளவுட் நிர்வாகி கிளவுட் பயனர்களைப் பொருத்தமான திட்டத்திற்கு அழைக்கிறார். குறிப்பாக, திட்டத்தை உள்ளடக்கிய ஒரு அணுகல் குழுவிற்கு அவர்கள் அழைக்கிறார்கள் மற்றும் அந்தக் குழுவிற்கு அவர்களை ஒதுக்குகிறார்கள்.

source: Fatima is added to the “ml” access group.
es_un: Fatima se agrega al grupo de acceso “ml”.
ja: 「ml」 アクセス・グループにFatimaが追加されます。
ta: பாத்திமா "ml" அணுகல் குழுவில் சேர்க்கப்படுகிறார்.

source: Ravi is added to the “finance” access group.
es_un: Ravi se agrega al grupo de acceso “finance”.
ja: Raviは「finance」アクセスグループに追加されます。
ta: ரவி "finance" அணுகல் குழுவில் சேர்க்கப்படுகிறார்.

source: Amyra is added to both the “ml” and “finance” access groups.
es_un: Amyra se agrega a ambos grupos de acceso “ml” y “finance”.
ja: Amyraは「ml」と「finance」の両方のアクセスグループに追加されます。
ta: "finance" மற்றும் "ml" அணுகல் குழுக்களில் அமிரா சேர்க்கப்பட்டது.

source: Users can log in through the IBM Cloud portal, create API keys, and work with their projects’ service instances.
es_un: Los usuarios pueden iniciar sesión a través del portal de IBM Cloud, crear claves de API y trabajar con las instancias de servicio de sus proyectos.
ja: ユーザーは IBM Cloud ポータルからログインし、API キーを作成し、プロジェクトのサービスインスタンスを使用できます。
ta: பயனர்கள் ஐபிஎம் கிளவுட் போர்டல் மூலம் உள்நுழையலாம், ஏபிஐ விசைகளை உருவாக்கலாம் மற்றும் தங்கள் திட்டங்களின் சேவை நிகழ்வுகளுடன் வேலை செய்யலாம்.

source: Manage ID provider users with IBM Cloud
es_un: Administrar usuarios de proveedor de ID con IBM Cloud
ja: IBM Cloud を使用した ID プロバイダー・ユーザーの管理
ta: ஐபிஎம் கிளவுட் மூலம் ஐடி வழங்குநர் பயனர்களை நிர்வகிக்கவும்

source: App ID creates an ID provider so you can add users directly in App ID or connect to other external ID providers. This tutorial describes how to set up your ID provider to work with IBM Cloud users, and gives instructions for users to access the environment.
es_un: App ID crea un proveedor de ID para que puedas agregar usuarios directamente en App ID o conectarse a otros proveedores de ID externos. Este tutorial describe cómo configurar tu proveedor de ID para trabajar con usuarios de IBM Cloud y proporciona instrucciones para que los usuarios accedan al entorno.
ja: App ID は、ID プロバイダを作成するため、App ID に直接ユーザーを追加したり、他の外部 ID プロバイダに接続したりできます。 このチュートリアルでは、IBM Cloud ユーザーと連携するように ID プロバイダーを設定し、環境へのアクセス手順を説明します。
ta: ஆப் ஐடி ஒரு ஐடி வழங்குநரை உருவாக்குகிறது, எனவே நீங்கள் நேரடியாக ஆப் ஐடியில் பயனர்களைச் சேர்க்கலாம் அல்லது பிற வெளிப்புற ஐடி வழங்குநர்களுடன் இணைக்கலாம். ஐபிஎம் கிளவுட் பயனர்களுடன் பணிபுரிய உங்கள் ஐடி வழங்குநரை எவ்வாறு அமைப்பது என்பதை இந்த டுடோரியல் விவரிக்கிறது, மேலும் பயனர்கள் சூழலை அணுகுவதற்கான வழிமுறைகளை வழங்குகிறது.

source: Create an App ID instance
es_un: Crear una instancia de App ID
ja: App ID インスタンスの作成
ta: ஆப் ஐடி instanceஐ உருவாக்கவும்

source: `Open App ID from the IBM Cloud catalog <https://cloud.ibm.com/catalog/services/app-id>`__ and log in if necessary. Specify the following values:
es_un: `Abre App ID desde el catálogo de IBM Cloud <https://cloud.ibm.com/catalog/services/app-id>`__ e inicia sesión si es necesario. Especifica los siguientes valores:
ja: `IBM Cloud カタログからApp ID を開き <https://cloud.ibm.com/catalog/services/app-id>`__ 、必要であればログインします。次の値を指定します。
ta: `IBM Cloud catalog <https://cloud.ibm.com/catalog/services/app-id>`__ இலிருந்து ஆப்ஸ் ஐடியைத் திறந்து, தேவைப்பட்டால் உள்நுழையவும். பின்வரும் மதிப்புகளைக் குறிப்பிடவும்:

source: For **Select a location**, it is recommended that you keep it in the same location as the Qiskit Runtime service, which is ``Washington DC (us-east)``.
es_un: Para **Select a location**, se recomienda que lo mantengas en la misma ubicación que el servicio Qiskit Runtime, que es ``Washington DC (us-east)``.
ja: **場所を選択**するには、``Washington DC (us-east)`` の Qiskit Runtime サービスと同じ場所に保管することをお勧めします。
ta: **ஒரு இருப்பிடத்தைத் தேர்ந்தெடு** என்பதற்கு, Qiskit இயக்க நேரச் சேவையின் அதே இடத்தில் அதை வைத்திருக்க பரிந்துரைக்கப்படுகிறது, அதாவது ``Washington DC (us-east)``.

source: **Select a pricing plan**:
ja: **料金プランを選択**：
ta: **விலை திட்டத்தைத் தேர்ந்தெடுக்கவும்**:

source: The **Lite** plan is free of charge and is enough to get started. If needed, you can seamlessly upgrade to the graduated tier later.
es_un: El plan **Lite** es gratuito y es suficiente para comenzar. Si es necesario, puedes actualizar sin problemas al *Graduated tier* más adelante.
ja: **Lite** プランは無料で開始できます。必要に応じて、後で段階的に階層をアップグレードできます。
ta: **லைட்** திட்டம் இலவசம் மற்றும் தொடங்குவதற்கு போதுமானது. தேவைப்பட்டால், நீங்கள் பின்னர் பட்டம் பெற்ற அடுக்குக்கு தடையின்றி மேம்படுத்தலாம்.

source: The **Graduated tier** is paid per event and per user beyond the lite tier limits. This tier supports more features such as multi-factor authentication. The Cloud administrator as the owning account of the App ID instance is charged for any fees for the graduated tier instances.
es_un: El **Graduated tier** se paga por evento y por usuario más allá de los límites del nivel básico (lite). Este nivel admite más funciones, como la autenticación multifactor. Al administrador de Cloud, como cuenta propietaria de la instancia de App ID, se le cobran las tarifas de las instancias del *graduated tier*.
ja: **段階的な階層** は、イベントごとおよびユーザーごとに、 ライト層の制限を超えて支払われます。 この層は、多要素認証などの追加機能をサポートします。 アプリケーション ID インスタンスの所有アカウントとしてのクラウド管理者は、段階的なインスタンスの料金に対して請求されます。
ta: லைட் அடுக்கு வரம்புகளுக்கு அப்பால் ஒரு நிகழ்விற்கும் ஒரு பயனருக்கும் **பட்டம் பெற்ற அடுக்கு** செலுத்தப்படுகிறது. இந்த அடுக்கு பல காரணி அங்கீகாரம் போன்ற கூடுதல் அம்சங்களை ஆதரிக்கிறது. ஆப் ஐடி நிகழ்வின் சொந்தக் கணக்காக கிளவுட் நிர்வாகியிடம் இருந்து பட்டம் பெற்ற அடுக்கு நிகழ்வுகளுக்கு ஏதேனும் கட்டணம் விதிக்கப்படும்.

source: Complete the values for **Service name** (the App ID instance name), **Resource group** (if one is being used), and any tags you want.
es_un: Completa los valores para **Service name** (el nombre de la instancia de App ID), **Resource group** (si se está utilizando uno) y cualquier etiqueta que desees.
ja: **サービス名** (App ID インスタンス名)、**リソースグループ** (使用中の場合)、および任意のタグの値を入力します。
ta: **சேவையின் பெயர்** (பயன்பாட்டு ஐடி நிகழ்வுப் பெயர்), **வளக் குழு** (ஒன்று பயன்படுத்தப்பட்டால்) மற்றும் நீங்கள் விரும்பும் குறிச்சொற்களுக்கான மதிப்புகளை முடிக்கவும்.

source: create1
ja: 作成 1

source: Read and agree to the terms and click **Create**.
es_un: Lee y acepta los términos y haz clic en **Create**.
ja: 利用規約を読んで同意し、**作成** をクリックしてください。
ta: விதிமுறைகளைப் படித்து ஒப்புக்கொண்டு **உருவாக்கு** என்பதைக் கிளிக் செய்யவும்.

source: Configure the ID provider
es_un: Configurar el proveedor de ID
ja: ID プロバイダーの設定
ta: ஐடி வழங்குநரைக் கட்டமைக்கவும்

source: We will use the **Cloud Directory** capability to add users to the ID provider. Refer to the `App ID documentation <https://cloud.ibm.com/docs/appid>`__ for instructions how to integrate other ID providers into App ID.
es_un: Usaremos la capacidad de **Cloud Directory** para agregar usuarios al proveedor de ID. Consulta la `App ID documentation <https://cloud.ibm.com/docs/appid>`__ para obtener instrucciones sobre cómo integrar otros proveedores de ID en App ID.
ja: **Cloud Directory** 機能を使用して、ユーザーをIDプロバイダーに追加します。 他の ID プロバイダを App ID に統合する方法については、`App ID ドキュメント <https://cloud.ibm.com/docs/appid>`__ を参照してください。
ta: ஐடி வழங்குநரிடம் பயனர்களைச் சேர்க்க **கிளவுட் டைரக்டரி** திறனைப் பயன்படுத்துவோம். ஆப் ஐடியில் பிற ஐடி வழங்குநர்களை எவ்வாறு ஒருங்கிணைப்பது என்பது பற்றிய வழிமுறைகளுக்கு `ஆப் ஐடி ஆவணங்கள் <https://cloud.ibm.com/docs/appid>`__ ஐப் பார்க்கவும்.

source: Open the `IBM Cloud resource list <https://cloud.ibm.com/resources>`__, expand the **Services and software** section, find your App ID instance and click its name to view its details.
es_un: Abre la `IBM Cloud resource list <https://cloud.ibm.com/resources>`__, expande la sección **Services and software**, busca tu instancia de App ID y haz clic en su nombre para ver sus detalles.
ja: `IBM Cloud リソース リスト <https://cloud.ibm.com/resources>`__ を開き、**サービスとソフトウェア** のセクションを展開します。 App ID インスタンスを見つけて、名前をクリックして詳細を表示します。
ta: `IBM Cloud ஆதாரப் பட்டியலைத் திறந்து <https://cloud.ibm.com/resources>`__, **சேவைகள் மற்றும் மென்பொருள்** பிரிவை விரிவுபடுத்தி, உங்கள் ஆப் ஐடி நிகழ்வைக் கண்டறிந்து அதன் விவரங்களைக் காண அதன் பெயரைக் கிளிக் செய்யவும்.

source: Click **Manage Authentication** and deselect any login options that you don’t need, such as Facebook and Google.
es_un: Haz clic en **Manage Authentication** y deselecciona cualquier opción de inicio de sesión que no necesites, como Facebook y Google.
ja: **Manage Authentication** をクリックし、FacebookやGoogleなど必要のないログインオプションの選択を解除します。
ta: **அங்கீகாரத்தை நிர்வகி** என்பதைக் கிளிக் செய்து, Facebook மற்றும் Google போன்ற உங்களுக்குத் தேவையில்லாத உள்நுழைவு விருப்பங்களைத் தேர்வுநீக்கவும்.

source: Go to **Manage Authentication** → **Cloud Directory** → **Settings** and choose whether user logins should use email or usernames.
es_un: Dirígete a **Manage Authentication** → **Cloud Directory** → **Settings** y elige si los inicios de sesión de usuario deben usar correo electrónico o nombres de usuario.
ja: **認証の管理** → **クラウド・ディレクトリ** → **設定** に移動し、ユーザログインに電子メールまたはユーザ名を使用するかどうかを選択します。
ta: **Manage Authentication** → **Cloud Directory** → **Settings** என்பதற்குச் சென்று, பயனர் உள்நுழைவுகள் மின்னஞ்சல் அல்லது பயனர் பெயர்களைப் பயன்படுத்த வேண்டுமா என்பதைத் தேர்வுசெய்யவும்.

source: Optionally go to **Manage Authentication** → **Cloud Directory** → **Password Policies** to define the password strength.
es_un: Opcionalmente, dirígete a **Manage Authentication** → **Cloud Directory** → **Password Policies** para definir la fortaleza de la contraseña.
ja: 必要に応じて、パスワードの強度を定義するために、**認証の管理** → **クラウド・ディレクトリ** → **パスワードポリシー** に移動します。
ta: கடவுச்சொல் வலிமையை வரையறுக்க விருப்பமாக இருந்தால்**Manage Authentication** → **Cloud Directory** → **Password Policies** என்பதற்குச் செல்லவும்.

source: Optionally open **Login Customization** and customize the appearance of the login page.
es_un: Opcionalmente, abre **Login Customization** y personaliza la apariencia de la página de inicio de sesión.
ja: 必要に応じて **ログイン・カスタマイズ** を開き、ログインページの外観をカスタマイズします。
ta: விருப்பமாக இருந்தால் **உள்நுழைவு தனிப்பயனாக்கம்** திறக்கவும் மற்றும் உள்நுழைவு பக்கத்தின் தோற்றத்தைத் தனிப்பயனாக்கவும்.

source: Integrate the App ID instance as the ID provider for the administrator’s account
es_un: Integrar la instancia de App ID como proveedor de ID para la cuenta del administrador
ja: アプリIDインスタンスを管理者アカウントのIDプロバイダーとして統合する
ta: நிர்வாகியின் கணக்கிற்கான ஐடி வழங்குநராக ஆப் ஐடி instanceஐ ஒருங்கிணைக்கவும்

source: Go to `Manage → Access (IAM) → Identity Providers <https://cloud.ibm.com/iam/identity-providers>`__. For **Type**, choose **IBM Cloud App ID**, then click **Create**.
es_un: Dirígete a `Manage → Access (IAM) → Identity Providers <https://cloud.ibm.com/iam/identity-providers>`__. Para **Type**, elige **IBM Cloud App ID**, luego haz clic en **Create**.
ja: `管理 → アクセス (IAM) → アイデンティティプロバイダー <https://cloud.ibm.com/iam/identity-providers>`__ に移動します。**タイプ**については、**IBM Cloud App ID** を選択し、**作成**をクリックします。
ta: `Manage → Access (IAM) → Identity Providers <https://cloud.ibm.com/iam/identity-providers>`__ என்பதற்குச் செல்லவும். **Type**க்கு, **IBM Cloud App ID** என்பதைத் தேர்ந்தெடுத்து, **Create** என்பதைக் கிளிக் செய்யவும்.

source: Specify a name and select the App ID instance from the drop-down list.
es_un: Especifica un nombre y selecciona la instancia de App ID de la lista desplegable.
ja: 名前を指定し、ドロップダウン リストからアプリケーション ID インスタンスを選択します。
ta: ஒரு பெயரைக் குறிப்பிட்டு, கீழ்தோன்றும் பட்டியலிலிருந்து ஆப் ஐடி நிகழ்வைத் தேர்ந்தெடுக்கவும்.

source: Select the checkbox to enable the ID provider.
es_un: Selecciona la casilla de verificación para habilitar el proveedor de ID.
ja: ID プロバイダーを有効にするにはチェックボックスを選択します。
ta: ஐடி வழங்குநரை இயக்கத் தேர்வுப்பெட்டியைத் தேர்ந்தெடுக்கவும்.

source: identity1
ja: 識別値 1

source: The default IdP URL is shown. Share this URL with users when they need to log in.
es_un: Se muestra la URL del proveedor de ID predeterminado. Comparte esta URL con los usuarios cuando necesiten iniciar sesión.
ja: デフォルトの IdP URL が表示されます。ログインが必要な場合は、このURLをユーザーと共有してください。
ta: இயல்புநிலை IdP URL காட்டப்பட்டுள்ளது. பயனர்கள் உள்நுழைய வேண்டியிருக்கும்போது இந்த URLஐ அவர்களுடன் பகிரவும்.

source: Add Users
es_un: Agregar Usuarios
ja: ユーザーを追加
