Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/cloud/cost.po
Languages: de, es_un, ja

source: Manage costs
de: Kosten verwalten
es_un: Administrar costos
ja: コストの管理

source: The Standard plan is not free, except when running jobs on simulators. Use the information in this topic to help you understand how much you’re paying and how to limit your costs.
de: Der Standardplan ist nicht kostenlos, außer bei der Ausführung von Jobs auf Simulatoren. Verwenden Sie die Informationen in diesem Abschnitt, um Ihnen zu helfen, zu verstehen, wie viel Sie zahlen und wie Sie Ihre Kosten begrenzen können. #test#
es_un: El plan Estándar no es gratuito, excepto cuando se ejecutan trabajos en simuladores. Usa la información de este tema para ayudarte a comprender cuánto estás pagando y cómo limitar tus costos.
ja: 標準プランは、シミュレーター上でジョブを実行する場合を除き、無料ではありません。 このトピックの情報は、支払い額とコストを制限する方法を理解するのに役立ちます。

source: Time limits on programs
de: Zeitbegrenzung für Programme
es_un: Límites de tiempo en los programas
ja: プログラムの時間制限

source: The maximum execution time for the Sampler primitive is 10000 seconds (2.78 hours). The maximum execution time for the Estimator primitive is 18000 seconds (5 hours).
de: Die maximale Ausführungszeit des Sampler Primitivs beträgt 10000 Sekunden (2,78 Stunden). Die maximale Ausführungszeit für den Estimator beträgt 18000 Sekunden (5 Stunden).
es_un: El tiempo máximo de ejecución de la primitiva Sampler es de 10000 segundos (2.78 horas). El tiempo máximo de ejecución de la primitiva Estimator es de 18000 segundos (5 horas).
ja: Sampler primitiveの最大実行時間は、10000秒(2.78時間) です。 Estimater primitiveの最大実行時間は 18,000 秒 (5 時間) です。

source: Additionally, the system limit on the job execution time is 3 hours for a job that is running on a simulator and 8 hours for a job running on a physical system.
de: Darüber hinaus beträgt der Systemgrenzwert für die Jobausführungszeit 3 Stunden für einen Job, der auf einem Simulator ausgeführt wird, und 8 Stunden für einen Job, der auf einem physischen System ausgeführt wird.
ja: 加えて、ジョブ実行時間のシステムしきい値は、シミュレーターで実行されるジョブの場合は 3 時間、物理システムで実行されているジョブの場合は 8 時間です。

source: How to limit your cost
de: So begrenzen Sie Ihre Kosten
es_un: Cómo limitar tu costo
ja: コストを制限する方法

source: The time your job takes (and therefore, its cost) depends on how many iterations you make in a session and how many shots are run in each iteration. Thus, you can manage your cost by running only as many iterations and shots as you need.
de: Die Zeit, die Ihr Job braucht (und daher der Preis) hängt davon ab, wie viele Iterationen Sie in einer Session machen und wie viele Läufe in jeder Iteration ausgeführt werden. So können Sie Ihre Kosten verwalten, indem Sie nur so viele Iterationen und Läufe verwenden, wie Sie benötigen.
ja: あなたのジョブにかかる時間（すなわち、そのコスト）は、セッションで繰り返しを行う回数と各繰り返しで実行されるショットの数によって異なります。 したがって、必要な反復数とショットを実行することで、コストを管理することができます。

source: Additionally, an instance administrator can limit how much is spent. To set cost limits, navigate to the `IBM Cloud Instances page <https://cloud.ibm.com/quantum/instances>`__, then click the instance and set the **Cost limit**. The cost limit refers to the total cost of all jobs run with this instance since it was created, and it will always be greater than or equal to the Total cost. After the instance reaches the specified number of total seconds, no further jobs can be run and no more cost is incurred.
de: Außerdem kann ein Instanzadministrator einschränken, wie viel verwendet wird. Um Kostenbegrenzungen festzulegen, navigieren Sie zur `IBM Cloud-Instanz-Seite <https://cloud.ibm.com/quantum/instances>`__, und klicken Sie dann auf die Instanz und legen Sie die **Kostenbegrenzung** fest. Der Kostengrenzwert bezieht sich auf die Gesamtkosten aller Jobs, die mit dieser Instanz ausgeführt werden, mit der sie erstellt wurden, und sie wird immer größer oder gleich der Gesamtkosten sein. Nachdem die Instanz die angegebene Anzahl an Sekunden erreicht hat, können keine weiteren Jobs ausgeführt werden, und es fallen keine weiteren Kosten an.
es_un: Además, un administrador de instancias puede limitar cuánto se gasta. Para establecer límites de costo, dirígete a la página `Instances de IBM Cloud <https://cloud.ibm.com/quantum/instances>`__, luego haz clic en la instancia y establece el **Cost limit**. El límite de costo se refiere al costo total de todos los trabajos ejecutados con esta instancia desde que se creó, y siempre será mayor o igual que el costo total. Una vez que la instancia alcanza el número especificado de segundos totales, no se pueden ejecutar más trabajos y no se incurre en más costos.
ja: さらに、インスタンス管理者は、使用した金額を制限することができます。 コスト制限を設定するには、`IBM Cloud Instances page <https://cloud.ibm.com/quantum/instances>`__ に移動し、インスタンスをクリックして **コスト制限** を設定します。コスト制限は、このインスタンスが作成されてから実行されたすべてのジョブのコストの合計を参照し、常に合計コスト以上となります。インスタンスが指定された合計秒数に達すると、それ以上のジョブを実行できなくなり、コストが発生しなくなります。

source: The cost limit is always specified in US dollars (USD), then converted to runtime seconds. However, for monthly billing purposes, you are charged in your local currency, specified on your IBM Cloud account. Because currency exchange rates can fluctuate, the cost for `X` runtime seconds might be different when initially calculated in USD than when you're actually charged in your local currency. As a result, if your local currency is not USD, the total amount charged for the number of seconds specified in this field could vary from the dollar amount you specify.
de: Die Kostengrenze wird immer in US-Dollar (USD) angegeben und dann in Laufzeitsekunden konvertiert. Für monatliche Abrechnungszwecke werden Sie jedoch in Ihrer lokalen Währung in Rechnung gestellt, die auf Ihrem IBM Cloud-Konto angegeben ist. Da die Wechselkurse schwanken können, können die Kosten für "X" -Laufzeitsekunden unterschiedlich sein, wenn sie ursprünglich in USD berechnet werden, als wenn Sie tatsächlich in Ihrer lokalen Währung berechnet werden. Wenn Ihre lokale Währung nicht USD ist, kann der Gesamtbetrag, der für die in diesem Feld angegebene Anzahl von Sekunden berechnet wird, von dem von Ihnen angegebenen Dollarbetrag abweichen.
es_un: El límite de costo siempre se especifica en dólares estadounidenses (USD), luego se convierte a segundos de tiempo de ejecución. Sin embargo, para fines de facturación mensual, se te cobra en tu moneda local, especificada en tu cuenta de IBM Cloud. Debido a que las tasas de cambio de moneda pueden fluctuar, el costo de `X` segundos de tiempo de ejecución puede ser diferente cuando se calcula inicialmente en USD que cuando realmente se te cobra en tu moneda local. Como resultado, si tu moneda local no es USD, el monto total cobrado por la cantidad de segundos especificados en este campo podría variar del monto en dólares que especifiques.
ja: コスト制限は常に米ドル (USD) で指定され、ランタイム秒に変換されます。 ただし、毎月の請求のためには、IBM Cloud アカウントで指定された現地通貨で請求されます。 為替レートが変動するため、 `X` ランタイム秒のコストは、最初にUSDで計算された場合と、実際に現地通貨で請求された場合とで異なることがあります。 結果として、あなたの現地通貨がUSDでない場合、このフィールドで指定された秒数の合計金額は、指定されたドル額から異なる可能性があります。

source: How to remove a cost limit
de: So entfernen Sie ein Kostenlimit
es_un: Cómo eliminar un límite de costo
ja: コスト制限を削除する方法

source: An instance administrator can remove the cost limit. To do so, navigate to the `IBM Cloud Instances page <https://cloud.ibm.com/quantum/instances>`__, then open the instance and click the edit button by the **Cost limit**. Delete the value and click **Save**.
de: Ein Instanzadministrator kann die Kostengrenze entfernen. Navigieren Sie dazu zu der `IBM Cloud-Instanz-Seite <https://cloud.ibm.com/quantum/instances>` __, öffnen Sie dann die Instanz und klicken Sie auf die Schaltfläche 'Bearbeiten' für die **Kostenbegrenzung**. Löschen Sie den Wert, und klicken Sie auf **Speichern**.
es_un: Un administrador de instancias puede eliminar el límite de costos. Para hacerlo, dirígete a la página `Instances de IBM Cloud <https://cloud.ibm.com/quantum/instances>`__, luego abre la instancia y haz clic en el botón de edición junto al **Cost limit**. Elimina el valor y haz clic en **Save**.
ja: インスタンス管理者はコスト制限を削除できます。 これを行うには、 `IBM Cloud Instances page <https://cloud.ibm.com/quantum/instances>`__ に移動します。次に、インスタンスを開き、 **コスト制限** で編集ボタンをクリックします。 値を削除し、 **保存** をクリックします。

source: What happens when the cost limit is reached
de: Was passiert, wenn die Kostengrenze erreicht ist
es_un: Qué sucede cuando se alcanza el límite de costo
ja: コスト制限に達すると何が起こるか

source: When the instance's cost limit is reached, the currently running job is stopped. Its status is set to `Cancelled` with a reason of `Ran too long`. Any available partial results are kept.
de: Wenn das Kostenlimit der Instanz erreicht ist, wird der momentan aktive Job gestoppt. Sein Status wird auf `Cancelled` mit dem Grund `Ran too long` gesetzt. Alle verfügbaren Teilergebnisse werden beibehalten.
es_un: Cuando se alcanza el límite de costo de la instancia, se detiene el trabajo que se está ejecutando actualmente. Su estado se establece en `Cancelled` con el motivo de `Ran too long`. Se conservan los resultados parciales disponibles.
ja: インスタンスのコスト制限に達すると、現在実行中のジョブは停止されます。 ステータスは `実行が長すぎます` という理由で、 `Cancelled` に設定されます。利用可能な部分的な結果はすべて保持されます。

source: No further jobs can be submitted by using this instance until the cost limit is increased.
de: Es können keine weiteren Jobs unter Verwendung dieser Instanz übergeben werden, bis die Kostengrenze erhöht wird.
es_un: No se pueden enviar más trabajos utilizando esta instancia hasta que se aumente el límite de costo.
ja: コスト制限が増えるまで、このインスタンスを使用してジョブを送信することはできません。

source: How to see what you’re being charged
de: Wie sehen Sie, was Ihnen berechnet wird
es_un: Cómo ver lo que se te está cobrando
ja: 請求内容を確認する方法

source: You are sent a monthly invoice that provides details about your resource charges. You can check how much has been spent at any time on the `IBM Cloud Billing and usage page <https://cloud.ibm.com/billing>`__.
de: Sie erhalten eine monatliche Rechnung, die Details zu Ihren Ressourcenkosten enthält. Sie können jederzeit auf der `IBM Cloud Abrechnungs- und Nutzungsseite <https://cloud.ibm.com/billing>`__` nachsehen, wie viel ausgegeben wurde.
es_un: Se te envía una factura mensual que proporciona detalles sobre los cargos de tus recursos. Puedes comprobar cuánto te has gastado en cualquier momento en la `página de Billing and usage de IBM Cloud <https://cloud.ibm.com/billing>`__.
ja: 毎月の請求書が送信され、あなたのリソース料金についての詳細が表示されます。 `IBM Cloud Billing and usage page <https://cloud.ibm.com/billing>`__ にいつでも費やされた金額を確認できます。

source: Additionally, you can determine cost per instance or per job at any time.
de: Darüber hinaus können Sie die Kosten pro Instanz oder pro Job jederzeit ermitteln.
es_un: Adicionalmente, puedes determinar el costo por instancia o por trabajo en cualquier momento.
ja: さらに、インスタンスごとまたはジョブごとのコストをいつでも決定できます。

source: View instance cost
de: Instanzkosten anzeigen
es_un: Ver el costo de la instancia
ja: インスタンスコストの表示

source: To determine how much has been billed to an instance during the current billing cycle, from the `Instances page <https://cloud.ibm.com/quantum/instances>`__, click the instance to open its details page.
de: Um festzustellen, wie viel an eine Instanz während des aktuellen Abrechnungszyklus abgerechnet wurde, klicken Sie auf der Seite 'Instanzen' <https://cloud.ibm.com/quantum/instances>` __ auf die Instanz, um die zugehörige Detailseite zu öffnen.
es_un: Para determinar cuánto se ha facturado a una instancia durante el ciclo de facturación actual, desde la `página Instances <https://cloud.ibm.com/quantum/instances>`__, haz clic en la instancia para abrir su página de detalles.
ja: 現在の請求サイクル中にインスタンスにどの程度請求されたかを判別するには、 `Instances page <https://cloud.ibm.com/quantum/instances>`__ からインスタンスをクリックして、その詳細ページを開きます。

source: These are the fields relevant to cost:
de: Dies sind die kostenrelevanten Felder:
es_un: Estos son los campos relevantes para el costo:
ja: コストに関連するフィールドは以下のとおりです。

source: **Billing cycle QR usage**: The amount of quantum runtime used by this instance during the current billing cycle
de: **Abrechnungszyklus QR-Nutzung**: Die Menge an Quantenlaufzeit, die von dieser Instanz während des aktuellen Abrechnungszyklus verwendet wird
ja: **請求サイクルQR使用量**：現在の請求サイクルでこのインスタンスが使用するQuantum Rumtimeの量

source: **Billing cycle cost**: The total cost of running jobs during the current billing cycle
de: **Abrechnungszyklus**: Die Gesamtkosten für laufende Jobs während des aktuellen Abrechnungszyklus
ja: **請求サイクルコスト**：現在の請求サイクル中のジョブ実行の合計コスト

source: **Total QR usage**: The amount of quantum runtime used by this instance since it was created
de: **Gesamte QR-Nutzung**: Die Menge der von dieser Instanz seit der Erstellung verwendeten Quanten-Laufzeit
ja: **QR の使用量の合計**: このインスタンスが作られてから使用された量子ランタイムの量

source: **Total cost**: The total cost of running jobs on this instance since it was created (only administrators can set this value)
de: **Gesamtkosten**: Die Gesamtkosten für die Ausführung von Jobs in dieser Instanz seit der Erstellung (nur Administratoren können diesen Wert festlegen)
ja: **合計コスト**: このインスタンスが作成されてから実行されたジョブの合計コスト (管理者のみがこの値を設定できます)

source: You can view your billing cycle on the `Billing and usage page <https://cloud.ibm.com/billing>`__.
de: Sie können Ihren Abrechnungszyklus auf der ` Billing and usage page <https://cloud.ibm.com/billing>` __ anzeigen.
es_un: Puedes ver tu ciclo de facturación en la `página de Billing and usage <https://cloud.ibm.com/billing>`__.
ja: 請求サイクルは、 `Billing and usage page <https://cloud.ibm.com/billing>`__ から確認できます。

source: View job cost
de: Jobkosten anzeigen
es_un: Ver costo de trabajo (job)
ja: ジョブのコストを表示

source: To determine how much has been billed to each job associated with an instance, from the `Instances page <https://cloud.ibm.com/quantum/instances>`__, click the instance to open its details page. Next, on the left side, click Jobs.
de: Um festzustellen, wie viel für jeden Job, der einer Instanz zugeordnet ist, in Rechnung gestellt wurde, klicken Sie auf der Seite 'Instanzen' <https://cloud.ibm.com/quantum/instances>` __ auf die Instanz, um die zugehörige Detailseite zu öffnen. Klicken Sie anschließend auf der linken Seite auf Jobs.
es_un: Para determinar cuánto se ha facturado a cada trabajo (job) asociado con una instancia, desde la `página de Instances <https://cloud.ibm.com/quantum/instances>`__, haz clic en la instancia para abrir su página de detalles. A continuación, en el lado izquierdo, haz clic en Jobs.
ja: インスタンスに関連付けられている各ジョブにどの程度請求されたかを判別するには、 `Instances page <https://cloud.ibm.com/quantum/instances>`__ のインスタンスをクリックして、その詳細ページを開きます。 次に、左側でジョブをクリックします。

source: These are the columns relevant to cost:
de: Dies sind die für die Kosten relevanten Spalten:
es_un: Estas son las columnas relevantes para el costo:
ja: これらは費用に関連する列です。

source: **QR usage**: The amount of quantum runtime used by this job
de: **QR-Nutzung**: Die Menge an Quantenlaufzeit, die von diesem Job verwendet wird
ja: **QR usage**: このジョブで使用されるQuantum Runtimeの量

source: **Cost**: The total cost of running this job
de: **Kosten**: Die Gesamtkosten für den Betrieb dieses Jobs
es_un: **Costo (Cost)**: el costo total de ejecutar este trabajo (job)
ja: **コスト**: このジョブを実行する総コスト

source: Set up spending notifications
de: Ausgabenbenachrichtigungen einrichten
es_un: Configurar notificaciones de gastos
ja: 送金通知の設定

source: You can set up spending notifications to get notified when your account or a particular service reaches a specific spending threshold that you set. For information, see the `IBM Cloud account Type description <https://cloud.ibm.com/docs/account?topic=account-accounts>`__. IBM Cloud spending notifications must be used with other methods of cost management for several reasons:
de: Sie können Ausgabenbenachrichtigungen einrichten, um benachrichtigt zu werden, wenn Ihr Konto oder ein bestimmter Service einen bestimmten Ausgabenschwellenwert erreicht, den Sie festgelegt haben. Weitere Informationen finden Sie im ` IBM Cloud-Konto Typbeschreibung <https://cloud.ibm.com/docs/account?topic=account-accounts>` __. Die IBM Cloud-Ausgabenbenachrichtigungen müssen aus mehreren Gründen mit anderen Methoden der Kostenverwaltung verwendet werden:
es_un: Puedes configurar notificaciones de gastos para recibir una notificación cuando tu cuenta o un servicio en particular alcance un umbral de gasto específico que establezcas. Para obtener más información, consulta la `descripción del IBM Cloud account Type <https://cloud.ibm.com/docs/account?topic=account-accounts>`__. Las notificaciones de gastos de IBM Cloud se deben utilizar con otros métodos de gestión de costos por varios motivos:
ja: アカウントまたは特定のサービスが設定した特定の支出のしきい値に達したときに通知を受け取るために支出通知を設定できます。 詳しくは、 `IBM Cloud account Type description <https://cloud.ibm.com/docs/account?topic=account-accounts>`__ を参照してください。 IBM Cloud の支出通知は、いくつかの理由で他のコスト管理方法と一緒に使用する必要があります。

source: The notifications trigger only *after* cost surpasses the specified limit.
de: Sie werden nur *nachdem* die Kosten das angegebene Limit überschritten haben, benachrichtigt.
es_un: Las notificaciones se activan solo *después* de que el costo supere el límite especificado.
ja: 通知トリガーは、コストが指定された上限を超えた *後* です。

source: Cost is submitted to the billing system hourly. Thus, a long delay might occur between the job submission and the spending notification being sent.
de: Die Kosten werden stündlich an das Abrechnungssystem übergeben. So kann es zu einer langen Verzögerung zwischen der Jobübergabe und der gesendeten Ausgabenbenachrichtigung kommen.
ja: 費用は、請求システムに毎時送金されます。このように、ジョブの送信と送金通知の間に長い遅延が発生する可能性があります。

source: The billing system can take multiple days to get information to the invoicing system, which might cause further delay in notifications. For more information about how the IBM Cloud billing system works, see `Setting spending notifications <https://cloud.ibm.com/docs/billing-usage?topic=billing-usage-spending>`__.
de: Das Abrechnungssystem kann mehrere Tage in Anspruch nehmen, um Informationen an das Abrechnungssystem zu erhalten, was zu einer weiteren Verzögerung bei Benachrichtigungen führen könnte. Weitere Informationen dazu, wie das IBM Cloud-Abrechnungssystem funktioniert, finden Sie unter ` Ausgabenbenachrichtigungen <https://cloud.ibm.com/docs/billing-usage?topic=billing-usage-spending>` __ festlegen.
es_un: El sistema de cobros puede tardar varios días en obtener la información al sistema de facturación, lo que podría causar más demoras en las notificaciones. Para obtener más información sobre cómo funciona el sistema de facturación de IBM Cloud, consulta `Setting spending notifications <https://cloud.ibm.com/docs/billing-usage?topic=billing-usage-spending>`__.
ja: 請求システムは、請求書発行システムに情報を取得するのに数日かかることがあり、通知がさらに遅れる可能性があります。 IBM Cloud 課金システムの仕組みについての詳細は、`支出通知の設定 <https://cloud.ibm.com/docs/billing-usage?topic=billing-usage-spending>`__ を参照してください。

source: Next steps
de: Nächste Schritte
es_un: Siguientes pasos
ja: 次のステップ

source: See `Qiskit Runtime plans <plans.html>`__ to learn about the plans.
de: Siehe `Qiskit Runtime Pläne <plans.html>`__ um mehr über die Pläne zu erfahren.
es_un: Consulta los `planes de Qiskit Runtime <plans.html>`__ para obtener información sobre los mismos.
ja: 計画については、`Qiskit Runtime plan <plans.html>`__ を参照してください。

source: The time your job takes (and therefore, its cost) depends on how many iterations you make in a session and how many shots are run in each iteration. Therefore, you can manage your cost by running only as many iterations and shots as you need.
es_un: El tiempo que toma tu trabajo (y, por lo tanto, tu costo) depende de cuántas iteraciones realices en una sesión y cuántas repeticiones (shots) se ejecuten en cada iteración. En consecuencia, puedes administrar tu costo ejecutando solo tantas iteraciones y repeticiones como necesites.

source: Cost is submitted to the billing system hourly. Therefore, a long delay might occur between the job submission and the spending notification being sent.
es_un: El costo se envía al sistema de cobros cada hora. Por lo tanto, puede ocurrir una gran demora entre el envío del trabajo (job) y el envío de la notificación de gastos.
