Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/cloud/plans.po
Languages: es_un, ja

source: Qiskit Runtime plans
es_un: Planes de Qiskit Runtime
ja: Qiskit Runtime のプラン

source: The Qiskit Runtime service offers these plans for running quantum programs:
es_un: El servicio Qiskit Runtime ofrece estos planes para ejecutar programas cuánticos:
ja: Qiskit Runtimeサービスは、以下のような量子プログラムの実行プランを提供します。

source: Lite Plan: Simulator access plan (free)
es_un: Lite Plan (plan básico): Plan de acceso al simulador (gratis)
ja: ライト・プラン: シミュレーターにアクセスするプラン(無料)

source: Standard Plan: Quantum hardware and simulator access plan
es_un: Standard Plan (plan estándar): Plan de acceso al simulador y hardware cuántico
ja: スタンダード・プラン: 量子ハードウェアとシミュレーターにアクセスするプラン

source: Lite plan
es_un: Lite plan (plan básico)
ja: ライト・プラン

source: A free plan that gives you access to quantum simulators to help you get started with Qiskit Runtime. It does not include access to IBM Quantum systems. The following simulators are included in this plan:
es_un: Un plan gratuito que te brinda acceso a simuladores cuánticos para ayudarte a comenzar con Qiskit Runtime. No incluye acceso a sistemas IBM Quantum. En este plan se incluyen los siguientes simuladores:
ja: Qiskit Runtime を使い始めるための量子シミュレーターへのアクセスを提供する無料プランです。IBM Quantum システムへのアクセスは含まれていません。このプランには、以下のシミュレーターが含まれています。

source: **ibmq_qasm_simulator**: A general-purpose simulator for simulating quantum circuits both ideally and subject to noise modeling. The simulation method is automatically selected based on the input circuits and parameters.
es_un: **ibmq_qasm_simulator**: Un simulador de propósito general para simular circuitos cuánticos tanto ideales como sujetos a modelado de ruido. El método de simulación se selecciona automáticamente en función de los circuitos y parámetros de entrada.
ja: **ibmq_qasm_simulator**: 量子回路の理想的なシミュレーションとノイズモデリングを行うための汎用シミュレーターです。入力された回路とパラメーターに基づいて、シミュレーション方法が自動的に選択されます。

source: **Type**: General, context-aware
es_un: **Tipo**: general, según el contexto
ja: **タイプ**: 一般、コンテキストアウェア

source: **Simulatable Qubits**: 32
es_un: **Qubits Simulables**: 32
ja: **シミュレート可能な量子ビット数**: 32

source: **simulator_statevector**: Simulates a quantum circuit by computing the wave function of the qubit’s state vector as gates and instructions are applied. Supports general noise modeling.
es_un: **simulator_statevector**: Simula un circuito cuántico mediante el cálculo de la función de onda del vector de estado del qubit a medida que se aplican compuertas e instrucciones. Soporta modelado de ruido general.
ja: **simulator_statevector**: 量子ビットの状態ベクトルの波動関数をゲートや命令の適用に応じて計算することにより、量子回路をシミュレートします。一般的なノイズのモデリングをサポートします。

source: **Type**: Schrödinger wave function
es_un: **Tipo**: función de onda de Schrödinger
ja: **タイプ**: シュレディンガーの波動関数

source: **Simulated Qubits**: 32
es_un: **Qubits Simulados**: 32
ja: **シミュレート可能な量子ビット数**: 32

source: **simulator_mps**: A tensor-network simulator that uses a Matrix Product State (MPS) representation for the state that is often more efficient for states with weak entanglement.
es_un: **simulator_mps**: Un simulador de red de tensores que utiliza una representación del Estado del Producto Matricial (Matrix Product State, MPS) para el estado que a menudo es más eficiente para estados con entrelazamiento débil.
ja: **simulator_mps**: テンソルネットワークのシミュレーターで、行列積状態 (Matrix Product State, MPS) 表現を使用します。

source: **Type**: Matrix Product State
es_un: **Tipo**: Estado del Producto Matricial
ja: **タイプ **: 行列積状態

source: **Simulated Qubits**: 100
es_un: **Qubits Simulados**: 100
ja: **シミュレート可能な量子ビット数**: 100

source: **simulator_stabilizer**: An efficient simulator of Clifford circuits. Can simulate noisy evolution if the noise operators are also Clifford gates.
es_un: **simulator_stabilizer**: Un simulador eficiente de circuitos de Clifford. Puede simular la evolución ruidosa si los operadores de ruido también son compuertas de Clifford.
ja: **simulator_stabilizer**: Clifford回路を効率的にシミュレートするシミュレーター。ノイズ演算子もCliffordゲートであれば、ノイズの多い展開もシミュレートできる。

source: **Type**: Clifford
es_un: **Tipo**: Clifford
ja: ** タイプ **: クリフォード

source: **Simulated Qubits**: 5000
es_un: **Qubits Simulados**: 5000
ja: **シミュレート可能な量子ビット数**: 5000

source: **simulator_extended_stabilizer**: Approximates the action of a quantum circuit by using a ranked-stabilizer decomposition. The number of non-Clifford gates determines the number of stabilizer terms.
es_un: **simulator_extended_stabilizer**: Aproxima la acción de un circuito cuántico mediante el uso de una descomposición de estabilizadores clasificados. El número de compuertas que no son de Clifford determina el número de términos estabilizadores.
ja: **simulator_extended_stabilizer**: 量子回路の動作をランク付けされたスタビライザー分解を用いることで近似します。非クリフォードゲートの数により、安定化項の数が決定されます。

source: **Type**: Extended Clifford (for example, Clifford+T)
es_un: **Tipo**: Clifford extendido (por ejemplo, Clifford+T)
ja: **タイプ **: 拡張クリフォード ( 例: クリフォード+T)

source: **Simulated Qubits**: 63
es_un: **Qubits Simulados**: 63
ja: **シミュレート可能な量子ビット数**: 63

source: Standard plan
es_un: Standard plan (plan estándar)
ja: 標準プラン

source: A pay-as-you-go plan for accessing IBM Quantum systems. Build your own programs and access all the benefits of Qiskit Runtime by running on real quantum hardware, while maintaining access to all of the simulators available in the Lite plan.
es_un: Un plan de pago por uso para acceder a los sistemas IBM Quantum. Crea tus propios programas y accede a todos los beneficios de Qiskit Runtime ejecutándolos en hardware cuántico real, mientras mantienes el acceso a todos los simuladores disponibles en el plan Lite.
ja: IBM Quantum システムにアクセスするための従量課金プランです。 Liteプランで利用可能なすべてのシミュレーターへのアクセスを維持しながら、自分のプログラムを構築し、実際の量子ハードウェア上で動作させることで、Qiskit Runtimeのすべての利点にアクセスできます。

source: Pricing overview
es_un: Descripción general de precios
ja: 価格設定の概要

source: The Lite plan is free. The Standard plan charges you per *runtime second* when running on physical systems. The following diagram illustrates what is included in a runtime second. For this service, one runtime second includes quantum compute time as well as classical near-time pre- and post-processing time. Any time spent waiting for results or in the queue for the quantum computer are excluded from the classical processing time.
es_un: El plan Lite es gratis. El plan Standard te cobra por *segundo de tiempo de ejecución* cuando se ejecuta en sistemas físicos. El siguiente diagrama ilustra lo que se incluye en un segundo de tiempo de ejecución. Para este servicio, un segundo de tiempo de ejecución incluye el tiempo de cómputo cuántico, así como el tiempo clásico de preprocesamiento y posprocesamiento en tiempo cercano. Cualquier tiempo gastado en la espera de resultados o en la fila de la computadora cuántica se excluye del tiempo de procesamiento clásico.
ja: ライト・プランは無料です。スタンダード・プランは、物理システム上で実行すると *runtime 秒* 単位で課金されます。下図は、1秒に含まれる内容を示しています。このサービスでは、1秒間に含まれる時間は、量子計算時間と古典の近い将来のプリ・ポストプロセッシングの時間です。量子コンピューターの待ち時間は、古典の処理時間から除外されます。

source: This diagram shows that everything before the program starts (such as queuing) is free. After the job starts, it costs $1.60 per second.
es_un: Este diagrama muestra que todo antes de que se inicie el programa (como esperar en la fila) es gratuito. Una vez que comienza el trabajo (job), cuesta $1.60 por segundo.
ja: この図は、プログラムが始まる前（キューイングなど）はすべて無料であることを示しています。ジョブが開始された後は、1秒あたり1.60ドルのコストがかかります。

source: Runtime second accounting
es_un: Contabilidad de segundos de tiempo de ejecución
ja: Runtime秒の会計処理

source: The quantum and near-time classical compute times are grouped to deliver the best performance of quantum programs. The runtime environment uses near-time classical compute to host in-term hardware-dependent tasks like session management, circuit optimization, and (when supported) error mitigation to optimize the execution of quantum programs.
es_un: Los tiempos de computación cuánticos y clásicos de tiempo cercano se agrupan para ofrecer el mejor rendimiento de los programas cuánticos. El entorno de tiempo de ejecución utiliza la computación clásica de tiempo cercano para albergar tareas dependientes del hardware a corto plazo, como la gestión de sesiones, la optimización de circuitos y (cuando se admite) la mitigación de errores para optimizar la ejecución de programas cuánticos.
ja: 量子計算機と近い将来の古典計算機は、量子プログラムの性能を最大限に発揮できるようにグループ化されています。実行環境は、セッション管理、回路最適化、エラー緩和などのハードウェア依存のタスクをホストするために、近い将来の古典計算を使用して、量子プログラムの実行を最適化します。

source: Next steps
es_un: Siguientes pasos
ja: 次のステップ

source: See `Manage costs <cost.html>`__ to learn how to determine and minimize your costs.
es_un: Consulta `Administrar costos <cost.html>`__ para aprender a determinar y minimizar tus costos.
ja: コストを決定し最小化する方法は `コストの管理 <cost.html>`__ を参照してください。
