Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/cloud/quickstart-steps-org.po
Languages: es_un, ja

source: Configure Qiskit Runtime for an organization
es_un: Configurar Qiskit Runtime para una organización
ja: Qiskit Runtimeの組織向け構成

source: Follow these steps to start setting up Qiskit runtime.
es_un: Sigue estos pasos para comenzar a configurar Qiskit Runtime.
ja: 以下のステップに従って、 Qiskit Runtime のセットアップを開始します。

source: Configure IAM settings
es_un: Configurar los ajustes de IAM
ja: IAM 設定の構成

source: First, configure some settings in the administrator’s Identity and Access Management (IAM) account. To review and configure these settings, go to `Manage → IAM → Settings <https://cloud.ibm.com/iam/settings>`__.
es_un: Primero, configura algunos ajustes en la cuenta de Administración de Acceso e Identidad (Identity and Access Management, IAM) del administrador. Para revisar y configurar estos ajustes, dirígete a `Manage → IAM → Settings <https://cloud.ibm.com/iam/settings>`__.
ja: 最初に、管理者の Identity and Access Management (IAM) アカウントでいくつかの設定を構成します。 これらの設定を確認して構成するには、`Manage → IAM → Settings <https://cloud.ibm.com/iam/settings>`__ に移動します。

source: **User list visibility** determines whether users can see each other, regardless of project assignment. The ``enabled`` setting restricts user visibility. That is, users in your account cannot see each other, even if they can access the same resources. Choose the appropriate value for your environment. See `Controlling user visibility <https://cloud.ibm.com/docs/account?topic=account-iam-user-setting>`__ for more information.
es_un: **User list visibility** determina si los usuarios pueden verse entre sí, independientemente de la asignación del proyecto. La configuración ``enabled`` restringe la visibilidad del usuario. Es decir, los usuarios de tu cuenta no pueden verse entre sí, incluso si pueden acceder a los mismos recursos. Elige el valor apropiado para tu entorno. Consulta `Controlling user visibility <https://cloud.ibm.com/docs/account?topic=account-iam-user-setting>`__ para obtener más información.
ja: **ユーザー リストの表示** は、プロジェクトの割り当てに関係なく、ユーザーがお互いを表示できるかどうかを決定します。 ``enabled`` 設定は、ユーザーの可視性を制限します。 つまり、同じリソースにアクセスできる場合でも、アカウント内のユーザーはお互いを見ることができません。 環境に適した値を選択してください。 詳しくは、`ユーザーの可視性の制御 <https://cloud.ibm.com/docs/account?topic=account-iam-user-setting>`__ を参照してください。

source: **API key creation** controls whether users can create API keys. In Qiskit Runtime, it is common to use API keys. If API keys are being used, choose ``disabled``. Alternatively, you can give specific permissions to each user.
es_un: **API key creation** controla si los usuarios pueden crear claves de API. En Qiskit Runtime, es común usar claves de API. Si se están utilizando claves de API, elige ``disabled``. Alternativamente, puedes otorgar permisos específicos a cada usuario.
ja: **API キーの作成** は、ユーザーが API キーを作成できるかどうかを制御します。 Qiskit Runtime では、API キーを使用するのが一般的です。 API キーが使用されている場合は、 ``disabled`` を選択します。 または、各ユーザーに特定の権限を付与することもできます。

source: IAM settings
ja: IAM 設定

source: (Optional) Create resource groups
es_un: (Opcional) Crear grupos de recursos
ja: (オプション) リソース・グループの作成

source: Skip this step if you are using access groups that directly reference Qiskit Runtime service instances.
es_un: Omite este paso si estás utilizando grupos de acceso que hacen referencia directa a las instancias del servicio Qiskit Runtime.
ja: Qiskit Runtime サービス・インスタンスを直接参照するアクセス・グループを使用している場合は、この手順をスキップしてください。

source: If you chose to use resource groups, go to `Manage → Account → Resource groups (in Account resources) <https://cloud.ibm.com/account/resource-groups>`__ and click **Create**.
es_un: Si eliges usar grupos de recursos, dirígete a `Manage → Account → Resource groups (en Account resources) <https://cloud.ibm.com/account/resource-groups>`__ y haz clic en **Create**.
ja: リソース グループを使用することを選択した場合は、 `Manage → Account → Resource groups (in Account resources) <https://cloud.ibm.com/account/resource-groups>`__ に移動し、**作成** をクリックします。

source: Create Qiskit Runtime service instances
es_un: Crear instancias del servicio Qiskit Runtime
ja: Qiskit Runtime サービス・インスタンスの作成

source: If you already created Qiskit Runtime service instances, skip this step.
es_un: Si ya creaste instancias del servicio Qiskit Runtime, omite este paso.
ja: Qiskit Runtime サービス・インスタンスを既に作成している場合は、この手順をスキップしてください。

source: If you are using resource groups, make sure to create the service instances on the appropriate resource group.
es_un: Si utilizas grupos de recursos, asegúrate de crear las instancias de servicio en el grupo de recursos adecuado.
ja: リソース・グループを使用している場合は、必ず適切なリソース・グループにサービス・インスタンスを作成してください。

source: The service instance name, such as ``QR-ml``, is needed for access group references.
es_un: El nombre de la instancia de servicio, como ``QR-ml``, es necesario para acceder a las referencias de grupos.
ja: アクセス・グループの参照には、 ``QR-ml`` などのサービス・インスタンス名が必要です。

source: From the `Qiskit Runtime Provisioning page <https://cloud.ibm.com/catalog/services/quantum-computing>`__, select the Create tab, then choose the appropriate service plan, depending on what you need access to:
es_un: En la página `Qiskit Runtime Provisioning <https://cloud.ibm.com/catalog/services/quantum-computing>`__, selecciona la pestaña Create y, a continuación, elige el plan de servicio adecuado, según a qué necesites acceder:
ja: `Qiskit Runtime Provisioning ページ <https://cloud.ibm.com/catalog/services/quantum-computing>`__ から、作成タブを選択し、アクセスが必要なものに応じて適切なサービス・プランを選択します。

source: **Lite**: Free simulators-only plan to help you get started with Qiskit Runtime. Learn to use Qiskit Runtime by following our examples and tutorials for one of the pre-built programs available for running circuits efficiently.
es_un: **Lite**: plan gratuito solo para simuladores para ayudarte a comenzar con Qiskit Runtime. Aprende a usar Qiskit Runtime siguiendo nuestros ejemplos y tutoriales para uno de los programas preconstruidos disponibles para ejecutar circuitos de manera eficiente.
ja: **ライト**: Qiskit Runtime を使い始めるのに役立つ無料のシミュレーターのみのプラン。Qiskit Runtime の使用方法については、回路を効率的に実行するために使用できるビルド済みプログラムの 1 つの例とチュートリアルに従ってください。

source: **Standard**: A pay-as-you-go model for accessing IBM Quantum systems and simulators. Build your own programs and use all the benefits of Qiskit Runtime by running on real quantum hardware.
es_un: **Standard**: un modelo de pago por uso para acceder a los sistemas y simuladores de IBM Quantum. Crea tus propios programas y utiliza todos los beneficios de Qiskit Runtime ejecutándolos en hardware cuántico real.
ja: **スタンダード**: IBM Quantum システムとシミュレーターにアクセスするための従量課金モデルです。独自のプログラムを構築し、実際の量子ハードウェア上で実行することにより、Qiskit Runtimeのすべての利点を使用することができます。

source: Complete the required information, then click **Create**.
es_un: Completa la información requerida, luego haz clic en **Create**.
ja: 必要な情報を入力し、 **作成** をクリックします。

source: Create access groups for projects
es_un: Crear grupos de acceso para proyectos
ja: プロジェクトのアクセス・グループを作成する

source: First, we create a custom role that allows users to perform actions to work with Qiskit Runtime service instances for each access group. Next, we create an access group for each project and give that group the minimum set of permissions that are required to work with the project resources. In a later step, we map users to access groups.
es_un: Primero, creamos un rol personalizado que permite a los usuarios realizar acciones para trabajar con las instancias del servicio Qiskit Runtime para cada grupo de acceso. A continuación, creamos un grupo de acceso para cada proyecto y otorgamos a ese grupo el conjunto mínimo de permisos necesarios para trabajar con los recursos del proyecto. En un paso posterior, asignamos usuarios a grupos de acceso.
ja: 最初に、ユーザーがアクションを実行して各アクセス・グループの Qiskit Runtime サービス・インスタンスを操作できるようにするカスタム・ロールを作成します。 次に、プロジェクトごとにアクセス・グループを作成し、そのグループに、プロジェクト・リソースを操作するために必要な最小限の権限セットを付与します。 後のステップで、ユーザーをアクセス・グループにマップします。

source: Follow these steps to set up an access group:
es_un: Sigue estos pasos para configurar un grupo de acceso:
ja: 次の手順に従って、アクセス・グループを設定します。

source: Create a custom role.
es_un: Crea un rol personalizado.
ja: カスタム・ロールを作成します。

source: From `Manage → IAM → Roles <https://cloud.ibm.com/iam/roles>`__, click ``Create``.
es_un: Desde `Manage → IAM → Roles <https://cloud.ibm.com/iam/roles>`__, haz clic en ``Create``.
ja: `Manage → IAM → Roles <https://cloud.ibm.com/iam/roles>`__ から、 ``Create`` をクリックします。

source: Enter a name, ID, description, and select ``Qiskit Runtime`` from the service, as shown in the image:
es_un: Ingresa un nombre, ID, descripción y selecciona ``Qiskit Runtime`` en el servicio, como se muestra en la imagen:
ja: イメージに示すように、名前、ID、説明を入力し、サービスから ``Qiskit Runtime`` を選択します。

source: custom
ja: カスタム

source: Select the following roles, then click **Create**.
es_un: Selecciona los siguientes roles y luego haz clic en **Create**.
ja: 次の役割を選択し、 **作成** をクリックします。

source: Select quantum-computing.job.delete if you want to allow users to delete jobs.
es_un: Selecciona quantum-computing.job.delete si deseas permitir que los usuarios eliminen trabajos (jobs).
ja: ユーザーがジョブを削除できるようにする場合は、quantum-computing.job.delete を選択します。

source: actions
ja: アクション

source: You can optionally define more fine grained roles by following `these instructions <considerations-org#more-roles-org>`__.
es_un: Opcionalmente, puedes definir roles más detallados siguiendo `estas instrucciones <considerations-org#more-roles-org>`__.
ja: オプションで、`これらの指示 <considerations-org#more-roles-org>`__ に従って、より細かい役割を定義できます。

source: Create an access group.
es_un: Crea un grupo de acceso.
ja: アクセス・グループを作成する。

source: Go to `Manage → IAM → Access groups <https://cloud.ibm.com/iam/groups>`__ and click **Create**.
es_un: Dirígete a `Manage → IAM → Access groups <https://cloud.ibm.com/iam/groups>`__ y haz clic en **Create**.
ja: `Manage → IAM → Access groups <https://cloud.ibm.com/iam/groups>`__ に移動し、**Create** をクリックします。

source: Enter a name, like ``project-ml``, and a description.
es_un: Introduce un nombre, como ``project-ml``, y una descripción.
ja: ``project-ml`` のような名前と説明を入力します。

source: Assign access to the group.
es_un: Asigna acceso al grupo.
ja: グループへのアクセスを割り当てます。

source: Select the Access tab and click **Assign access**.
es_un: Selecciona la pestaña Access y haz clic en **Assign access**.
ja: アクセスタブを選択し、 **アクセスの割り当て** をクリックします。

source: In the Service list, search for **Qiskit Runtime** and select it, then click **Next**.
es_un: En la lista Service, busca **Qiskit Runtime** y selecciónalo, luego haz clic en **Next**.
ja: サービスリストで、 **Qiskit Runtime** を検索して選択し、 **次へ** をクリックします。

source: service
ja: サービス

source: In Resources, select **Specific resources**. For Attribute type, choose **Service Instance**.
es_un: En Resources, selecciona **Specific resources**. Para Attribute type, elige **Service Instance**.
ja: リソース で **特定のリソース** を選択します。 属性タイプで **サービス インスタンス** を選択します。

source: From the drop-down list, select the service instance that you want to add to the access group, for example, ``QR-ml``. If you are using resource groups, select the resource group instead of selecting individual service instances. Click **Next**.
es_un: En la lista desplegable, selecciona la instancia de servicio que deseas agregar al grupo de acceso, por ejemplo, ``QR-ml``. Si utilizas grupos de recursos, selecciona el grupo de recursos en lugar de seleccionar instancias de servicio individuales. Haz clic en **Next**.
ja: ドロップダウン・リストから、アクセス・グループに追加するサービス・インスタンスを選択します (例: ``QR-ml`` )。 リソース・グループを使用している場合は、個々のサービス・インスタンスを選択するのではなく、リソース・グループを選択します。 **次へ** をクリックします。

source: resources
ja: リソース

source: For Roles and actions, select **Viewer** and the custom role that was created previously. Click **Add**, then **Assign**.
es_un: Para Roles and actions, selecciona **Viewer** y el rol personalizado que se creó anteriormente. Haz clic en **Add** y luego en **Assign**.
ja: ロールとアクション で、**Viewer** と、以前に作成したカスタム・ロールを選択します。 **追加** 、 **割り当て** の順にクリックします。

source: roles
ja: ロール

source: Repeat this step if you want to give an access group permission to several service instances.
es_un: Repite este paso si deseas otorgar un permiso de grupo de acceso a varias instancias de servicio.
ja: 複数のサービス・インスタンスにアクセス・グループのアクセス許可を付与する場合は、この手順を繰り返します。

source: Set up your ID provider and assign users
es_un: Configurar tu proveedor de ID y asignar usuarios
ja: ID プロバイダーを設定してユーザーを割り当てる

source: Follow the steps in the `manage users topic <cloud-provider-org.html>`__.
es_un: Sigue los pasos del tema `administrar usuarios <cloud-provider-org.html>`__.
ja: `manage users topic <cloud-provider-org.html>`__ の手順に従います。
