Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/cloud/quickstart-org.po
Languages: es_un, ja

source: Plan Qiskit Runtime for an organization
es_un: Plan de Qiskit Runtime para una organización
ja: Qiskit Runtimeの組織向けプラン

source: In an organization where individuals might work on several projects, Qiskit Runtime governance can seem complex. However, access management can be used to easily enable user collaboration and to restrict visibility of users and projects when necessary. Managing access becomes more relevant with Qiskit Runtime resources that are not free: that is, Qiskit Runtime service instances that use the Standard plan (which organizations are charged for).
es_un: En una organización donde las personas pueden trabajar en varios proyectos, la gobernabilidad de Qiskit Runtime puede parecer compleja. Sin embargo, la administración del acceso se puede utilizar para habilitar fácilmente la colaboración de usuarios y restringir la visibilidad de usuarios y proyectos cuando sea necesario. Administrar el acceso se vuelve más relevante con los recursos de Qiskit Runtime que no son gratuitos: es decir, las instancias de servicio de Qiskit Runtime que usan el plan Estándar (Standard) (que se cobra a las organizaciones).
ja: 個人が複数のプロジェクトに携わるような組織では、Qiskit runtime ガバナンスは複雑に見えるかもしれません。しかし、アクセス管理はユーザーのコラボレーションを容易にし、必要に応じてユーザーやプロジェクトの可視性を制限するために使用することができます。アクセス管理は、有料Qiskit Runtimeリソース、つまりスタンダード・プラン（組織が支払う）を使用するQiskit Runtimeサービスインスタンスに、より関連性が高いです。

source: Overview
es_un: Descripción General
ja: 概要

source: IBM Cloud provides various ways to implement these mechanisms described in this tutorial. There are several ways to achieve these objectives. Additionally, most of the steps in this tutorial are generic to IBM Cloud and not specific to Qiskit Runtime, except the custom role details.
es_un: IBM Cloud proporciona varias formas de implementar estos mecanismos descritos en este tutorial. Hay varias formas de lograr estos objetivos. Además, la mayoría de los pasos de este tutorial son genéricos para IBM Cloud y no específicos para Qiskit Runtime, excepto los detalles del rol personalizado.
ja: IBM Cloudは、このチュートリアルで説明するこれらのメカニズムを実装するためのさまざまな方法を提供します。これらの目的を達成するためには、いくつかの方法があります。さらに、このチュートリアルの手順のほとんどは、カスタムロールの詳細を除き、IBM Cloudに一般的であり、Qiskit Runtimeに固有のものではありません。

source: Involved Personas
es_un: Personas Involucradas
ja: 関係するペルソナ

source: The are several main personas that are mentioned in this tutorial:
es_un: Hay varias personas principales que se mencionan en este tutorial:
ja: このチュートリアルでは、いくつかの主要なペルソナを紹介しています：

source: **User**: Someone who gets access to Qiskit Runtime resources (*service instances*) and can potentially collaborate with other users on these resources. Users’ access is controlled by an administrator and they cannot create or delete service instances.
es_un: **Usuario**: Alguien que obtiene acceso a los recursos de Qiskit Runtime (*instancias de servicio*) y puede colaborar potencialmente con otros usuarios en estos recursos. El acceso de los usuarios está controlado por un administrador y no pueden crear ni eliminar instancias de servicio.
ja: **ユーザー**: Qiskit Runtimeリソース（*サービスインスタンス*）へのアクセスを取得し、これらのリソース上で他のユーザーと共同作業ができる可能性がある人。ユーザーのアクセスは管理者によって制御され、サービスインスタンスを作成または削除することはできません。

source: **Cloud administrator**: An IBM Cloud account owner who owns Qiskit Runtime resources and manages which users can access these resources. As the resource owner, the administrator is charged for any paid resource use.
es_un: **Administrador de Cloud**: propietario de una cuenta de IBM Cloud que posee los recursos de Qiskit Runtime y administra qué usuarios pueden acceder a estos recursos. Como propietario del recurso, al administrador se le cobra por el uso pagado de los recursos.
ja: **Cloud administrator (クラウド管理者)**: IBM Cloudのアカウント所有者で、Qiskit Runtime リソースを所有し、どのユーザーがこれらのリソースにアクセスできるかを管理します。リソース所有者として、管理者はすべての有料リソースの使用に対して課金されます。

source: **IDP administrator**: An administrator who defines identities and their attributes in an identity provider (IDP).
es_un: **Administrador de IDP**: Un administrador que define identidades y sus atributos en un proveedor de identidad (IDP).
ja: **IDP 管理者**: IDP（アイデンティティー・プロバイダー）において、IDとその属性を定義する管理者。

source: Terminology
es_un: Terminología
ja: 専門用語

source: This tutorial uses the following terms:
es_un: Este tutorial utiliza los siguientes términos:
ja: このチュートリアルでは、以下の用語を使用します：

source: *Resource*: A generic IBM Cloud term that refers to an object that can be managed through the Cloud user interface, CLI, or API. For this tutorial, a *resource* is a Qiskit Runtime service instance.
es_un: *Recurso*: Término genérico de IBM Cloud que hace referencia a un objeto que se puede gestionar a través de la interfaz de usuario de Cloud, la CLI o la API. Para este tutorial, un *recurso* es una instancia del servicio Qiskit Runtime.
ja: *リソース*: IBM Cloudの一般的な用語で、Cloudのユーザーインターフェース、CLI、またはAPIを通じて管理できるオブジェクトを指します。このチュートリアルでは、 *リソース* はQiskit Runtimeサービスのインスタンスです。

source: *Service instance*: A service instance is used to access Cloud functions. Specifically, quantum computing on real devices or simulators. It is defined through the catalog. You can define several service instances based on the same or different plans, which offer access to different quantum computing backends. See `Qiskit Runtime plans <plans.html>`__ for more details.
es_un: *Instancia de servicio*: una instancia de servicio se utiliza para acceder a las funciones de Cloud. En concreto, computación cuántica sobre dispositivos reales o simuladores. Se define a través del catálogo. Puedes definir varias instancias de servicio basadas en planes iguales o diferentes, que ofrecen acceso a diferentes backends de computación cuántica. Consulta `Planes de Qiskit Runtime <plans.html>`__ para obtener más detalles.
ja: *サービス・インスタンス*: クラウドの機能、具体的には、実機やシミュレーター上での量子コンピューティング、にアクセスするためのサービス・インスタンス。カタログで定義します。同じプラン、または異なるプランに基づいて複数のサービスインスタンスを定義し、異なる量子コンピューティングバックエンドへのアクセスを提供することができます。詳細は `Qiskit Runtimeプラン <plans.html>`__ を参照すること。

source: *Project*: A grouping unit that enables users to work on the same resources. This tutorial uses two projects; ``ml`` and ``finance``. See `Hierarchical project structures <considerations-org#nest-org.html>`__ for more information.
es_un: *Proyecto*: Una unidad de agrupación que permite a los usuarios trabajar en los mismos recursos. Este tutorial utiliza dos proyectos; ``ml`` y ``finance``. Consulta `Estructuras jerárquicas de proyectos <considerations-org#nest-org.html>`__ para obtener más información.
ja: *プロジェクト*: ユーザーが同じリソースで作業することを可能にするグループ化された単位です。このチュートリアルでは、 ``ml`` と ``finance`` の2つのプロジェクトを使用します。詳しくは `階層的なプロジェクト構造 <considerations-org#nest-org.html>`__ を参照してください。

source: This project is not related to the “project” concept in IBM Quantum Platform.
es_un: Este proyecto no está relacionado con el concepto de “project” en IBM Quantum Platform.
ja: このプロジェクトは、IBM Quantum Platformの “project” の概念とは関係ありません。

source: Decisions
es_un: Decisiones
ja: 意思決定

source: Before you set up Qiskit Runtime for your organization, you need to make these decisions:
es_un: Antes de configurar Qiskit Runtime para tu organización, debes tomar estas decisiones:
ja: Qiskit Runtimeを組織用にセットアップする前に、これらの決定を行う必要があります。

source: How are user identities defined? You can set up IBM Cloud users, users from another IDP, or both.
es_un: ¿Cómo se definen las identidades de los usuarios? Puedes configurar usuarios de IBM Cloud, usuarios de otro IDP o ambos.
ja: ユーザー ID はどのように定義されますか？IBM Cloud ユーザー、別の IDP からのユーザー、またはその両方を設定できます。

source: If you are using a different IDP, does the Cloud administrator or the IDP administrator assign users to project resources?
es_un: Si estás utilizando un IDP diferente, ¿el administrador de Cloud o el administrador de IDP asigna usuarios a los recursos del proyecto?
ja: 別のIDPを使用している場合、クラウド管理者とIDP管理者のどちらがプロジェクトリソースにユーザーを割り当てるのでしょうか？

source: If the IDP administrator assigns users to projects, you need a string to be used as a key, such as ``project`` (which this tutorial uses) for project comparisons.
es_un: Si el administrador de IDP asigna usuarios a proyectos, necesitas una cadena a usar como una clave, tal como ``project`` (que usa este tutorial) para comparaciones de proyectos.
ja: IDP管理者がユーザーをプロジェクトに割り当てる場合、プロジェクトの比較のために (このチュートリアルで意味する) ``project`` などのキーとして使用する文字列が必要です。

source: What are the projects and which service instances will belong to each? You must plan your project names carefully.
es_un: ¿Cuáles son los proyectos y qué instancias de servicio pertenecerán a cada uno? Debes planificar cuidadosamente los nombres de tus proyectos.
ja: プロジェクトとは何か、どのサービスインスタンスがそれぞれに所属するのか。プロジェクト名は慎重に計画する必要があります。

source: Do not make project names substrings of another. For example, if you use ``ml`` and ``chemlab`` for project names, then later you set up a project match for ``ml``, it triggers on both values, accidentally granting more access than expected. Instead, use unique names such as ``ml`` and ``chem-lab``. Alternatively, use prefix or suffix values to avoid such unintended substring matches.
es_un: No hagas que los nombres de los proyectos sean subcadenas de otro. Por ejemplo, si usas ``ml`` y ``chemlab`` para nombres de proyectos, luego configuras una coincidencia de proyecto para ``ml``, se activa en ambos valores, otorgando accidentalmente más acceso de lo esperado. En su lugar, utiliza nombres únicos como ``ml`` y ``chem-lab``. Alternativamente, usa valores de prefijo o sufijo para evitar tales coincidencias de subcadena no deseadas.
ja: プロジェクト名を他のプロジェクト名の部分文字列にしないでください。例えば、 ``ml`` と ``chemlab`` をプロジェクト名として使用した場合、後で ``ml`` のプロジェクトマッチを設定すると、両方の値でトリガーされてしまい、誤って予想以上のアクセス権が付与されてしまいます。代わりに、 ``ml`` や ``chem-lab`` のようなユニークな名前を使用してください。また、プレフィックスやサフィックスを使用して、このような意図しない部分一致を避けることもできます。

source: Using naming conventions, along with prefix or suffix values can help you easily allow access to several projects.
es_un: El uso de convenciones de nomenclatura, junto con valores de prefijo o sufijo, puede ayudarte a permitir el acceso a varios proyectos fácilmente.
ja: プレフィックス値やサフィックス値とともに命名規則を使用すると、複数のプロジェクトへのアクセスを容易に許可することができます。

source: Quantum experiments (jobs) belong to service instances, and users that have access to an instance can see its jobs.
es_un: Los experimentos cuánticos (jobs) pertenecen a instancias de servicio y los usuarios que tienen acceso a una instancia pueden ver sus trabajos.
ja: 量子実験（ジョブ）はサービス・インスタンスに所属し，あるインスタンスにアクセスできるユーザーはそのジョブを見ることができます．

source: Service instances can be based on different plans, allowing access to different backends like real devices or simulators. See `Choose a system or simulator <../how_to/choose-system.html>`__ for details.
es_un: Las instancias de servicio pueden basarse en diferentes planes, lo que permite el acceso a diferentes backends como dispositivos reales o simuladores. Consulta `Eligir un sistema o simulador <../how_to/choose-system.html>`__ para obtener más detalles.
ja: サービス・インスタンスは異なるプランに基づくことができ、実機やシミュレーターのような異なるバックエンドにアクセスできるようになります。詳しくは `システムまたはシミュレーターの選択 <../how_to/choose-system.html>`__ を参照してください。

source: Which users need to access which projects?
es_un: ¿Qué usuarios necesitan acceder a qué proyectos?
ja: どのユーザーがどのプロジェクトにアクセスする必要があるか？

source: Should users be able to delete jobs? Keeping jobs in service instances gives more traceability for billing costs. This information combines well with the audit trail of `Activity Tracker <at-events.html>`__, which tracks which user submitted the job.
es_un: ¿Deberían los usuarios poder eliminar trabajos (jobs)? Mantener trabajos en instancias de servicio brinda más trazabilidad para los costos de facturación. Esta información se combina bien con el seguimiento de auditoría del `Activity Tracker <at-events.html>`__, que rastrea qué usuario envió el trabajo.
ja: ユーザーはジョブを削除できるようにすべきですか？ジョブをサービス・インスタンスに保存しておくと、コスト請求のための追跡可能性が高まります。この情報は、どのユーザーがジョブを投入したかを追跡する `Activity Tracker <at-events.html>`__ の監査証跡とうまく結びつきます。

source: Will you use access groups that directly reference Qiskit Runtime service instances or organize services into resource groups?
es_un: ¿Usarás grupos de acceso que hagan referencia directa a las instancias de servicio de Qiskit Runtime u organizarás los servicios en grupos de recursos?
ja: Qiskit Runtimeのサービス・インスタンスを直接参照するアクセスグループを使用するか、リソースグループにサービスを整理するか？

source: **Access groups** are a convenient and common way of controlling user access for IBM Cloud resources. They are a simple but powerful means to consistently assign user access. We create an access group for each project and map users to access groups. Each access group uses a custom role that allows users to access specific Qiskit Runtime service instances or resource groups.
es_un: Los **grupos de acceso** son una forma conveniente y común de controlar el acceso de los usuarios a los recursos de IBM Cloud. Son un medio simple pero poderoso para asignar de manera consistente el acceso de los usuarios. Creamos un grupo de acceso para cada proyecto y asignamos usuarios a grupos de acceso. Cada grupo de acceso utiliza un rol personalizado que permite a los usuarios acceder a instancias de servicio o grupos de recursos específicos de Qiskit Runtime.
ja: **アクセス・グループ** は、IBM Cloud リソースへのユーザー アクセスを制御するための便利で一般的な方法です。 これらは、ユーザー アクセスを一貫して割り当てるためのシンプルですが強力な手段です。 プロジェクトごとにアクセス・グループを作成し、ユーザーをアクセス・グループにマッピングします。 各アクセス・グループは、ユーザーが特定の Qiskit Runtime サービス インスタンスまたはリソース グループにアクセスできるようにするカスタム・ロールを使用します。

source: **Resource groups** are used only when you need to maintain a clear separation of service instances. If more service instances are created in a resource group, all users that have access to the resource group see them automatically without updating access groups. If you choose to use resource groups, you will create access groups and then assign them to resource groups.
es_un: Los **grupos de recursos** se usan solo cuando necesitas mantener una separación clara de las instancias de servicio. Si se crean más instancias de servicio en un grupo de recursos, todos los usuarios que tienen acceso al grupo de recursos las ven automáticamente sin actualizar los grupos de acceso. Si eliges usar grupos de recursos, crearás grupos de acceso y luego los asignarás a grupos de recursos.
ja: **リソース・グループ** は、サービス・インスタンスを明確に分離する必要がある場合にのみ使用されます。 リソース・グループに追加のサービス・インスタンスが作成された場合、リソース・グループにアクセスできるすべてのユーザーは、アクセス・グループを更新しなくても自動的にサービス・インスタンスを参照できます。 リソース・グループの使用を選択した場合は、アクセス・グループを作成してから、それらをリソース・グループに割り当てます。

source: A service instance can belong to only one resource group, and after instances are assigned into resource groups, they cannot be changed. This also means that the resource group assignment can happen only at service instance creation. Therefore, resource groups might not provide enough flexibility if assignments of service instances to resource groups might need to change.
es_un: Una instancia de servicio puede pertenecer a un solo grupo de recursos y, una vez que las instancias se asignan a grupos de recursos, no se pueden cambiar. Esto también significa que la asignación del grupo de recursos solo puede ocurrir en la creación de la instancia de servicio. Por lo tanto, es posible que los grupos de recursos no brinden suficiente flexibilidad si es necesario cambiar las asignaciones de instancias de servicio a los grupos de recursos.
ja: サービス・インスタンスは 1 つのリソース・グループにのみ属することができ、インスタンスがリソース・グループに割り当てられた後は変更できません。 これは、リソース・グループの割り当てがサービス・インスタンスの作成時にのみ発生する可能性があることも意味します。 したがって、リソース・グループへのサービス・インスタンスの割り当てを変更する必要がある場合、リソース・グループでは十分な柔軟性が得られない可能性があります。

source: Considerations
es_un: Consideraciones
ja: 考慮事項

source: You should understand the following considerations when setting up your environment.
es_un: Debes comprender las siguientes consideraciones al configurar tu entorno.
ja: 環境をセットアップするときは、次の考慮事項を理解する必要があります。

source: Auditability
es_un: Auditabilidad
ja: オーディオビリティ

source: Activity tracker logs significant actions performed on Qiskit Runtime service instances. Create an instance of Activity Tracker in the region of your Qiskit Runtime instances to get an audit trail of events. Refer to the Qiskit Runtime `Activity Tracker page <at_events.html>`__ for details about the events logged.
es_un: El rastreador de actividad registra acciones significativas realizadas en las instancias del servicio Qiskit Runtime. Crea una instancia de Activity Tracker en la región de tus instancias de Qiskit Runtime para obtener un seguimiento de auditoría de los eventos. Consulta la página `Activity Tracker <at_events.html>`__ de Qiskit Runtime para obtener detalles sobre los eventos registrados.
ja: アクティビティ・トラッカーは、Qiskit Runtime サービス・インスタンスで実行された重要なアクションをログに記録します。 イベントの監査証跡を取得するには、Qiskit Runtime インスタンスの領域に Activity Tracker のインスタンスを作成します。 ログに記録されたイベントの詳細については、Qiskit Runtime `Activity Tracker ページ <at_events.html>`__ を参照してください。

source: This audit log contains the fields ``initiator_authnName`` and ``initiator_authnId``, which match the name shown in `Manage → Access (IAM) → Users <https://cloud.ibm.com/iam/users>`__. To view this field, click on the user name, then **Details** in the **IAM ID** field.
es_un: Este registro de auditoría contiene los campos ``initiator_authnName`` y ``initiator_authnId``, que coinciden con el nombre que se muestra en `Manage → Access (IAM) → Users <https://cloud.ibm.com/iam/users>`__. Para ver este campo, haz clic en el nombre de usuario, luego en **Details** en el campo **IAM ID**.
ja: この監査ログにはフィールド ``initiator_authnName`` および ``initiator_authnId`` が含まれており、これらは `Manage → Access (IAM) → Users <https://cloud.ibm.com/iam/users>`__ に表示される名前と一致します。このフィールドを表示するには、ユーザー名をクリックし、**IAM ID** フィールドの **詳細** をクリックします。

source: event
ja: イベント

source: To capture App ID events, open your App ID instance, then navigate to **Manage Authentication -> Authentication settings** and enable **Runtime Activity**.
es_un: Para capturar eventos de App ID, abre tu instancia de App ID, luego dirígete a **Manage Authentication -> Authentication settings** y habilita **Runtime Activity**.
ja: App ID イベントをキャプチャするには、App ID インスタンスを開き、**Manage Authentication -> Authentication settings** に移動し、**Runtime Activity** を有効にします。

source: Define more fine grained roles
es_un: Definir roles más detallados
ja: よりきめ細かい粒度のロールを定義する

source: The actions in the custom roles can be used for more fine grained access control. For example, some users might need full access to work on service instances, while others might only need Read access to service instances, programs, and jobs.
es_un: Las acciones en los roles personalizados se pueden usar para un control de acceso más detallado. Por ejemplo, algunos usuarios pueden necesitar acceso completo para trabajar en instancias de servicio, mientras que otros pueden necesitar solo acceso de lectura a instancias de servicio, programas y trabajos (jobs).
ja: カスタム・ロールのアクションは、よりきめ細かいアクセス制御に使用できます。たとえば、サービス インスタンスで作業するためにフル・アクセスが必要なユーザーもいれば、サービス・インスタンス、プログラム、およびジョブへの読み取りアクセスのみが必要なユーザーもいます。

source: To achieve that, define two different custom roles such as ``MLreader`` and ``MLwriter``. Remove all cancel, delete, and update roles from the ``MLreader`` custom role, and include all actions in the ``MLwriter`` custom role. Next, add the roles to two different access groups accordingly.
es_un: Para lograrlo, define dos funciones personalizadas diferentes, como ``MLreader`` y ``MLwriter``. Elimina todas las funciones de cancelación, eliminación y actualización de la función personalizada ``MLreader`` e incluye todas las acciones en la función personalizada ``MLwriter``. A continuación, agrega los roles a dos grupos de acceso diferentes según corresponda.
ja: これを実現するには、``MLreader`` と ``MLwriter`` のような２つの異なるカスタム・ロールを定義します。 ``MLreader`` カスタム・ロールからはすべてのキャンセル、削除、および更新ロールを除き、 ``MLwriter`` カスタム・ロールにはすべてのアクションを含めます。次に、ロールを２つの異なるアクセス・グループに適宜追加します。

source: When using dynamic rules, that is, when the IDP administrator manages access through custom IDP user attributes, do not use IDP custom user attributes that are substrings of each other. For instance, don't use ``ml`` and ``mlReader``, as the string comparison of ``ml`` would also accept ``mlReader``. You could use ``MLreader`` and ``MLwriter`` to avoid this conflict.
es_un: Cuando se utilicen reglas dinámicas, es decir, cuando el administrador de IDP gestiona el acceso a través de atributos de usuario de IDP personalizados, no utilices atributos de usuario de IDP personalizados que sean subcadenas entre sí. Por ejemplo, no uses ``ml`` y ``mlReader``, ya que la comparación de cadenas de ``ml`` también aceptaría ``mlReader``. Podrías usar ``MLreader`` y ``MLwriter`` para evitar este conflicto.
ja: 動的ルールを使用する場合、つまり、IDP管理者がカスタムIDPユーザー属性を介してアクセスを管理する場合は、互いの部分文字列にあたるIDPカスタム・ユーザー属性を使用しないでください。たとえば、 ``ml`` の文字列比較は ``mlReader`` も受け入れるため、 ``ml`` と ``mlReader`` を使用しないでください。この衝突を避けるために ``MLreader`` と ``MLwriter`` を使うことができます。

source: For an example of setting up custom roles, see `Create access groups for projects <quickstart-steps-org#create-group-org.html>`__.
es_un: Para ver un ejemplo de configuración de funciones personalizadas, consulta `Crear grupos de acceso para proyectos <quickstart-steps-org#create-group-org.html>`__.
ja: カスタム・ロールを設定する例については、 `プロジェクトのアクセス・グループの作成 <quickstart-steps-org#create-group-org.html>`__ を参照してください。

source: Other Cloud resources
es_un: Otros recursos de Cloud
ja: 他のクラウド・リソース

source: The steps used in this tutorial can be used to manage access to other Cloud resources as well. Include the appropriate permissions to the access groups of the relevant projects.
es_un: Los pasos utilizados en este tutorial también se pueden utilizar para administrar el acceso a otros recursos de Cloud. Incluyendo los permisos apropiados a los grupos de acceso de los proyectos relevantes.
ja: このチュートリアルで使用する手順を使用して、他のクラウド・リソースへのアクセスを管理することもできます。 関連するプロジェクトのアクセス・グループに適切な権限を含めます。

source: Hierarchical project structures
es_un: Estructuras jerárquicas de proyectos
ja: 階層型プロジェクト構造

source: In this tutorial, the mapping of users to projects and service instances was kept simple. However, by associating several users with access groups and referencing service instances from several access groups, more complex mappings can be implemented.
es_un: En este tutorial, la asignación de usuarios a proyectos e instancias de servicio se mantuvo simple. Sin embargo, al asociar varios usuarios con grupos de acceso y hacer referencia a instancias de servicio de varios grupos de acceso, se pueden implementar asignaciones más complejas.
ja: このチュートリアルでは、プロジェクトとサービス・インスタンスへのユーザーのマッピングは単純に保たれます。ただし、複数のユーザーをアクセス・グループに関連付け、複数のアクセス・グループからサービス・インスタンスを参照することで、より複雑なマッピングを実装できます。

source: This method can accommodate a hierarchical structure. That is, it can align to how users might be assigned to the Hub/Group/Project access structure in the IBM Quantum Platform. For example, a *group* could be an access group that is assigned to all service instances of the group’s projects. Users who should get access to all of the group’s projects would then only have to be added to the group’s access group.
es_un: Este método puede adaptarse a una estructura jerárquica. Es decir, puede alinearse con la forma en que los usuarios pueden asignarse a la estructura de acceso Hub/Group/Project en IBM Quantum Platform. Por ejemplo, un *grupo* podría ser un grupo de acceso asignado a todas las instancias de servicio de los proyectos del grupo. Los usuarios que deberían tener acceso a todos los proyectos del grupo solo tendrían que agregarse al grupo de acceso del grupo.
ja: この方法は、階層構造に対応できます。つまり、IBM Quantum Platform のハブ/グループ/プロジェクトのアクセス構造にユーザーを割り当てる方法に合わせることができます。たとえば、 *グループ* は、グループのプロジェクトのすべてのサービス・インスタンスに割り当てられるアクセス・グループである可能性があります。グループのすべてのプロジェクトへのアクセス権を取得する必要があるユーザーは、グループのアクセス・グループに追加するだけで済みます。

source: Consistent and repeatable deployment of the configuration
es_un: Despliegue consistente y repetible de la configuración
ja: 構成の一貫性および反復可能なデプロイメント
