Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/cloud/quickstart-org.po
Languages: es_un, ja

source: The steps of this tutorial can be automated for consistent and repeatable management of users, projects, and the mapping between those. Refer to the `Terraform IBM Cloud Provider documentation <https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs>`__ for templates.
es_un: Los pasos de este tutorial se pueden automatizar para una administración consistente y repetible de usuarios, proyectos y el mapeo entre ellos. Consulta la `documentación de Terraform IBM Cloud Provider <https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs>`__ para ver las plantillas.
ja: このチュートリアルの手順は、ユーザー、プロジェクト、およびそれらの間のマッピングの一貫した反復可能な管理のために自動化できます。テンプレートについては、 `Terraform IBM Cloud Provider documentation <https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs>`__ を参照してください。

source: Next steps
es_un: Siguientes pasos
ja: 次のステップ

source: See `Configure Qiskit Runtime for an organization <quickstart-steps-org.html>`__ for the steps to set up Qiskit Runtime.
es_un: Consulta `Configurar Qiskit Runtime para una organización <quickstart-steps-org.html>`__ para conocer los pasos para configurar Qiskit Runtime.
ja: Qiskit Runtime をセットアップする手順については、 `組織におけるQiskit Runtime構成 <quickstart-steps-org.html>`__ を参照してください。
