Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/cloud/quickstart.po
Languages: es_un, fr, ja_jp

source: Getting started
es_un: Primeros pasos
fr: Premiers pas
ja_jp: はじめに

source: This tutorial walks you through the steps to set up a Qiskit Runtime service instance, log in to your service instance, and run your first job on a quantum computer.
es_un: Este tutorial te guía a través de los pasos para configurar una instancia del servicio Qiskit Runtime, iniciar sesión en tu instancia de servicio y ejecutar tu primer trabajo en una computadora cuántica.
fr: Ce tutoriel vous guide à travers les étapes pour configurer un service Qiskit Runtime, se connecter à votre service et exécuter votre première tâche sur un ordinateur quantique.
ja_jp: このチュートリアルでは、Qiskit Runtimeサービスインスタンスのセットアップ、サービスインスタンスへのログイン、量子コンピューター上での最初のジョブの実行のステップを説明します。

source: If you are an administrator who needs to set up Qiskit Runtime for your organization, refer to `Plan Qiskit Runtime for an organization <quickstart-org>`__ for instructions to set up a service instance and work with users.
es_un: Si eres un administrador que necesita configurar Qiskit Runtime para tu organización, consulta `Plan de Qiskit Runtime para una organización <quickstart-org>`__ para obtener instrucciones sobre cómo configurar una instancia de servicio y trabajar con usuarios.
ja_jp: あなたの組織にQiskit Runtimeを設定する必要がある管理者であれば、`Qiskit Runtimeを組織で計画する <quickstart-org>`__ を参照して、サービスインスタンスの設定とユーザーとの作業を行う手順をご覧ください。

source: Create a service instance
es_un: Crear una instancia de servicio
fr: Créer une instance du service
ja_jp: サービス・インスタンスの作成

source: If you already created a Qiskit Runtime service instance or were invited to one by an administrator, skip to the next step. To determine whether you already have access to an instance, check your `IBM Cloud Instances page <https://cloud.ibm.com/quantum/instances>`__. If you have one or more instances shown, you can skip ahead to :ref:`install-packages`.
es_un: Si ya creaste una instancia del servicio Qiskit Runtime o un administrador te invitó a una, dirígete al siguiente paso. Para determinar si ya tienes acceso a una instancia, consulta la página `IBM Cloud Instances <https://cloud.ibm.com/quantum/instances>`__. Si tienes una o más instancias mostradas, puedes pasar directamente a :ref:`install-packages`.
fr: Si vous avez déjà créé une instance du service Qiskit Runtime ou que vous avez été invité par un administrateur, passez à l'étape suivante. Pour déterminer si vous avez déjà accès à une instance, vérifiez votre `page IBM Cloud Instances <https://cloud.ibm.com/quantum/instances>`__. Si vous avez une ou plusieurs instances affichées, vous pouvez passer à :ref:`install-packages`.
ja_jp: すでにQiskit Runtimeサービス・インスタンスを作成している場合、または管理者からインスタンスに招待されている場合は、次のステップに進みます。既にインスタンスにアクセスしているかどうかを判断するには、`IBM Cloud Instances page <https://cloud.ibm.com/quantum/instances>`__ を確認してください。1つ以上のインスタンスが表示されている場合は、 :ref:`install-packages` にスキップして進むことができます。

source: This image shows an Instances page with two instances.
es_un: Esta imagen muestra una página Instances con dos instancias.
fr: Cette image montre une page Instances listant deux instances.
ja_jp: この画像は、2つのインスタンスを持つインスタンス・ページです。

source: Instances page showing multiple instances.
es_un: Página Instances que muestra varias instancias.
fr: Page Instances listant plusieurs instances.
ja_jp: 複数のインスタンスを表示するインスタンスページ。

source: From the `Qiskit Runtime Provisioning page <https://cloud.ibm.com/catalog/services/quantum-computing>`__, choose the appropriate service plan, depending on what you need access to. For more information about these plans, see the `Qiskit Runtime plans <plans.html>`__ topic.
es_un: En la página `Qiskit Runtime Provisioning <https://cloud.ibm.com/catalog/services/quantum-computing>`__, elige el plan de servicio apropiado, según a qué necesites acceder. Para obtener más información sobre estos planes, consulta el tema `Planes de Qiskit Runtime <plans.html>`__.
fr: À partir de la `page Qiskit Runtime Provisioning <https://cloud.ibm.com/catalog/services/quantum-computing>`__, sélectionnez le plan approprié, en fonction de ce dont vous aurez besoin d'accéder. Pour plus d'informations sur ces plans, référez-vous à `Qiskit Runtime plans <plans.html>`__.
ja_jp: `Qiskit Runtime Provisioning ページ <https://cloud.ibm.com/catalog/services/quantum-computing>`__ から、アクセスが必要なものに応じて適切なサービスプランを選択します。これらのプランの詳細については、`Qiskit Runtimeのプラン <plans.html>`__トピックを参照してください。

source: **Lite**: Free simulators-only plan to help you get started with Qiskit Runtime. Learn to use Qiskit Runtime by following our examples and tutorials for one of the pre-built programs available for running circuits efficiently.
es_un: **Lite**: plan gratuito solo para simuladores para ayudarte a comenzar con Qiskit Runtime. Aprende a usar Qiskit Runtime siguiendo nuestros ejemplos y tutoriales para uno de los programas preconstruidos disponibles para ejecutar circuitos de manera eficiente.
fr: **Lite** : Plan gratuit pour vous aider à démarrer avec Qiskit Runtime, donnant accès aux simulateurs uniquement. Apprenez à utiliser Qiskit Runtime en suivant nos exemples et tutoriels pour l'un des programmes prédéfinis disponibles pour exécuter les circuits efficacement.
ja_jp: **ライト**: Qiskit Runtimeを使い始めるための無料のシミュレーター専用プランです。回路を効率的に実行するために利用できるビルド済みプログラムの1つについて、例題やチュートリアルに沿ってQiskit Runtimeの使い方を学びましょう。

source: **Standard**: A pay-as-you-go model for accessing IBM Quantum systems. Build your own programs and leverage all the benefits of Qiskit Runtime by running on real quantum hardware.
ja_jp: **スタンダード**: IBM Quantum システムにアクセスするための従量課金モデルです。独自のプログラムを構築し、実際の量子ハードウェア上で実行することにより、Qiskit Runtimeのすべての利点を活用することができます。

source: Because this is not a free plan, it is important to understand how to best manage your costs. See `Manage the cost <cost.html>`__ for tips to limit your cost, how to set up spending notifications, and more.
es_un: Debido a que este no es un plan gratuito, es importante comprender cómo administrar mejor tus costos. Consulta `Administrar los costos <cost.html>`__ para obtener consejos para limitar tu costo, cómo configurar notificaciones de gastos y más.
fr: Étant donné qu'il ne s'agit pas d'un plan gratuit, il est important de comprendre comment gérer au mieux vos dépenses. Consultez `Gérer le coût <cost.html>`__ pour des conseils pour limiter vos dépenses, comment configurer des notifications de dépenses, et plus encore.
ja_jp: 無料プランではないため、コストを最適に管理する方法を理解することが重要です。コストを制限するためのヒント、支出通知の設定方法などについては、`コストの管理 <cost.html>`__ をご覧ください。

source: If you want to access physical devices as well as simulators, you need to set up one instance with the Lite plan and one instance with the Standard plan.
ja_jp: シミュレーターだけでなく、物理デバイスにもアクセスしたい場合は、ライトプランで1インスタンス、スタンダードプランで1インスタンスをセットアップする必要があります。

source: Complete the required information, then click **Create**.
es_un: Completa la información requerida, luego haz clic en **Create**.
fr: Complétez les informations requises, puis cliquez sur **Create**.
ja_jp: 必要事項を入力し、 **作成** をクリックします。

source: Install or update Qiskit packages
es_un: Instalar o actualizar paquetes de Qiskit
fr: Installez ou mettez à jour les paquets Qiskit
ja_jp: Qiskit パッケージのインストールまたはアップデート

source: Install or update the following packages in your development environment. They let you create circuits and work with primitive programs with Qiskit Runtime. For detailed instructions, refer to the `Qiskit textbook <https://qiskit.org/textbook/ch-appendix/qiskit.html>`__. Periodically check the `Qiskit release notes <https://qiskit.org/documentation/release_notes.html>`__ (or rerun these commands) so that you always have the latest version.
es_un: Instala o actualiza los siguientes paquetes en tu entorno de desarrollo. Te permiten crear circuitos y trabajar con programas primitivos con Qiskit Runtime. Para obtener instrucciones detalladas, consulta el `libro de texto de Qiskit <https://qiskit.org/textbook/ch-appendix/qiskit.html>`__. Verifica periódicamente las `notas de la versión de Qiskit <https://qiskit.org/documentation/release_notes.html>`__ (o vuelve a ejecutar estos comandos) para que siempre tengas la última versión.
ja_jp: 以下のパッケージを開発環境にインストールまたはアップデートしてください。これらのパッケージを使用すると、Qiskit Runtimeで回路を作成したり、primitive プログラムを動作させることができます。詳細な手順については、 `Qiskitテキストブック <https://qiskit.org/textbook/ch-appendix/qiskit.html>`__を参照してください。また、定期的に `Qiskitのリリースノート <https://qiskit.org/documentation/release_notes.html>`__ を確認する（またはこれらのコマンドを再実行する）ことで、常に最新版を利用することができます。

source: Be sure to run these commands even if you already installed the packages, to ensure that you have the latest versions.
es_un: Asegúrate de ejecutar estos comandos incluso si ya instalaste los paquetes, para asegurarte de tener las últimas versiones.
fr: Assurez-vous d'exécuter ces commandes même si vous avez déjà installé les paquets, pour vous assurer que vous utilisez les dernières versions.
ja_jp: すでにインストールされている場合でも、これらのコマンドを実行し、最新版のパッケージを入手するようにしてください。

source: Authenticate to the service
es_un: Autenticarse en el servicio
fr: Authentifiez-vous au service
ja_jp: サービスに対する認証

source: To authenticate to the service, call ``QiskitRuntimeService`` with your IBM Cloud API key and the CRN:
es_un: Para autenticarse en el servicio, llama a ``QiskitRuntimeService`` con tu clave de API de IBM Cloud y el CRN:
fr: Pour vous authentifier au service, appelez ``QiskitRuntimeService`` avec votre clé API IBM Cloud et le CRN :
ja_jp: サービスに対する認証を行うには、IBM Cloud APIキーとCRNを指定して ``QiskitRuntimeService`` を呼び出します:

source: Find your access credentials
es_un: Encontrar tus credenciales de acceso
fr: Accédez à vos identifiants
ja_jp: アクセス資格情報の検索

source: Find your API key. From the `API keys page <https://cloud.ibm.com/iam/apikeys>`__, view or create your API key, then copy it to a secure location so you can use it for authentication.
es_un: Encuentra tu clave de API. Desde la `página de claves de API <https://cloud.ibm.com/iam/apikeys>`__, consulta o crea tu clave de API, luego cópiala en una ubicación segura para que puedas usarla para la autenticación.
ja_jp: APIキーを探します。 `APIキーのページ <https://cloud.ibm.com/iam/apikeys>`__ から、APIキーを表示または作成し、安全な場所にコピーして、認証に使用できるようにします。

source: Find your Cloud Resource Name (CRN). Open the `Instances page <https://cloud.ibm.com/quantum/instances>`__ and click your instance. In the page that opens, click the icon to copy your CRN. Save it in a secure location so you can use it for authentication.
es_un: Encuentra tu Nombre de Recurso de la Nube (Cloud Resource Name, CRN). Abre la página `Instances <https://cloud.ibm.com/quantum/instances>`__ y haz clic en tu instancia. En la página que se abre, haz clic en el icono para copiar tu CRN. Guárdalo en un lugar seguro para que puedas usarlo para la autenticación.
ja_jp: 自分のCloud Resource Name (CRN)を探します。`インスタンスページ <https://cloud.ibm.com/quantum/instances>`__ を開き、自分のインスタンスをクリックします。開いたページで、アイコンをクリックしてCRNをコピーします。認証に使用できるように、安全な場所に保存してください。

source: Optionally save your credentials to disk
es_un: Opcionalmente, guardar tus credenciales en disco
ja_jp: オプションで認証情報をディスクに保存する

source: Optionally save your credentials to disk (in the ``$HOME/.qiskit/qiskit-ibm.json`` file). If you don't save your credentials to disk, you must specify your credentials every time you start a new session.
es_un: Opcionalmente, guarda tus credenciales en disco (en el archivo ``$HOME/.qiskit/qiskit-ibm.json``). Si no guardas tus credenciales en disco, debes especificar tus credenciales cada vez que inicies una nueva sesión.
ja_jp: オプションとして、ディスクに認証情報を保存します ( ``$HOME/.qiskit/qiskit-ibm.json`` ファイル内)。ディスクに保存しない場合、新しいセッションを開始するたびに資格情報を指定する必要があります。

source: If you save your credentials to disk, you can use ``QiskitRuntimeService()`` in the future to initialize your account.
es_un: Si guardas tus credenciales en disco, puedes usar ``QiskitRuntimeService()`` en el futuro para inicializar tu cuenta.
ja_jp: 認証情報をディスクに保存しておけば、将来的に ``QiskitRuntimeService()`` を使用してアカウントを初期化することができます。

source: If you need to update your saved credentials, run ``save_account`` again, passing in ``overwrite=True`` and the updated credentials. For more information about managing your account, see the `account management topic <how_to/account-management.html>`__.
es_un: Si necesitas actualizar tus credenciales guardadas, ejecuta ``save_account`` nuevamente, pasando ``overwrite=True`` y las credenciales actualizadas. Para obtener más información sobre cómo administrar tu cuenta, consulta el `tema de administración de cuentas <how_to/account-management.html>`__.
ja_jp: 保存した認証情報を更新する必要がある場合は、 ``overwrite=True`` と更新した認証情報を渡して、 ``save_account`` を再度実行してください。アカウントの管理に関するより詳しい情報は、 `アカウント管理トピック <how_to/account-management.html>`__ を参照してください。

source: Test your setup
es_un: Probar tu configuración
ja_jp: セットアップのテスト

source: Run the Hello World program to ensure that your environment is set up properly.
es_un: Ejecuta el programa Hello World para asegurarte de que tu entorno esté configurado correctamente.
ja_jp: Hello World プログラムを実行して、環境が正しくセットアップされていることを確認します。

source: If you are using the Standard plan, running Hello World incurs a cost. See `Manage costs <cost.html>`__ for cost information.
ja_jp: スタンダード・プランをご利用の場合、Hello Worldを実行するとコストが発生します。コストについては `コストの管理 <cost.html>`__ を参照してください。

source: If you did not save your credentials to disk, specify ``QiskitRuntimeService(channel="ibm_cloud", token=<IBM Cloud API key>, instance=<IBM Cloud CRN>)`` instead of ``QiskitRuntimeService()`` in the following code.
es_un: Si no guardaste tus credenciales en disco, especifica ``QiskitRuntimeService(channel="ibm_cloud", token=<IBM Cloud API key>, instance=<IBM Cloud CRN>)`` en lugar de ``QiskitRuntimeService()`` en el siguiente código.
ja_jp: 認証情報をディスクに保存していない場合は、次のコードで ``QiskitRuntimeService()`` の代わりに ``QiskitRuntimeService(channel="ibm_cloud", token=<IBM Cloud API key>, instance=<IBM Cloud CRN>)`` を指定してください。

source: Result:
es_un: Resultado:
ja_jp: 結果:

source: Choose a program to run
es_un: Escoger un programa a ejecutar
ja_jp: 実行するプログラムの選択

source: Qiskit Runtime uses primitive programs to interface with quantum computers. The following programs are publicly available. Choose the appropriate link to continue learning how to run a program.
es_un: Qiskit Runtime utiliza programas primitivos para interactuar con computadoras cuánticas. Los siguientes programas están disponibles públicamente. Elige el enlace apropiado para continuar aprendiendo cómo ejecutar un programa.
ja_jp: Qiskit Runtimeは、量子コンピューターとのインターフェースにPrimitive プログラムを使用します。以下のプログラムは一般に公開されています。プログラムの実行方法を学ぶために、適切なリンクを選択してください。

source: `Getting started with Sampler <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-sampler.html>`__
es_un: `Primeros pasos con Sampler <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-sampler.html>`__
ja_jp: `Sampler入門 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-sampler.html>`__

source: `Getting started with Estimator <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-estimator.html>`__
es_un: `Primeros pasos con Estimator <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-estimator.html>`__
ja_jp: `Estimator入門 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/tutorials/how-to-getting-started-with-estimator.html>`__

source: **Standard**: A pay-as-you-go model for accessing IBM Quantum systems and simulators. Build your own programs and leverage all the benefits of Qiskit Runtime by running on real quantum hardware.
es_un: **Standard**: un modelo de pago por uso para acceder a los sistemas y simuladores de IBM Quantum. Crea tus propios programas y aprovecha todos los beneficios de Qiskit Runtime ejecutándolos en hardware cuántico real.

source: If you are running on real backends, Hello World incurs a cost. See `Manage costs <cost.html>`__ for cost information.
es_un: Si estás ejecutando backends reales, Hello World incurre en un costo. Consulta `Administrar costos <cost.html>`__ para obtener información sobre los costos.

source: If you are an administrator who needs to set up Qiskit Runtime for your organization, refer to `Plan Qiskit Runtime for an organization <quickstart-org.html>`__ for instructions to set up a service instance and work with users.
fr: Si vous êtes un administrateur qui doit configurer Qiskit Runtime pour votre organisation, reportez-vous à `Planifier Qiskit Runtime pour une organisation <quickstart-org.html>`__ pour les instructions de configuration du service et des utilisateurs.

source: **Standard**: A pay-as-you-go model for accessing IBM Quantum systems and simulators. Build your own programs and use all the benefits of Qiskit Runtime by running on real quantum hardware.
fr: **Standard** : Un plan ce paiement à l'usage pour accéder aux systèmes et simulateurs d'IBM Quantum. Construisez vos propres programmes et bénéficiez de tous les avantages de Qiskit Runtime en utilisant de vrais systèmes quantiques.

source: Install or update the following packages in your development environment. They let you create circuits and work with primitives with Qiskit Runtime. For detailed instructions, refer to the `Qiskit textbook <https://qiskit.org/textbook/ch-appendix/qiskit.html>`__. Periodically check the `Qiskit release notes <https://qiskit.org/documentation/release_notes.html>`__ (or rerun these commands) so that you always have the latest version.
fr: Installez ou mettez à jour les packages suivants dans votre environnement de développement. Ils vous permettent de créer des circuits et de travailler avec des primitives avec Qiskit Runtime. Pour obtenir des instructions détaillées, consultez le manuel "Qiskit" <https://qiskit.org/textbook/ch-appendix/qiskit.html>` __. Vérifiez régulièrement les notes d'édition de Qiskit <https://qiskit.org/documentation/release_notes.html>` __ (ou réexécutez ces commandes) de sorte que vous disposez toujours de la dernière version.

source: Choose a primitive to run
fr: Choisir une primitive à exécuter
