Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/cloud/setup-terraform.po
Languages: es_un, ja

source: Set up Terraform for Qiskit Runtime
es_un: Configurar Terraform para Qiskit Runtime
ja: Qiskit Runtime用のTerraformの設定

source: If you use Terraform to manage your infrastructure, the `IBM Cloud provider for Terraform <https://cloud.ibm.com/docs/ibm-cloud-provider-for-terraform?topic=ibm-cloud-provider-for-terraform-getting-started>`__ supports provisioning Qiskit Runtime service instances. The generic ``ibm_resource_instance`` resource is used for that. The following parameters have to be specified:
es_un: Si usas Terraform para gestionar tu infraestructura, el `proveedor de IBM Cloud para Terraform <https://cloud.ibm.com/docs/ibm-cloud-provider-for-terraform?topic=ibm-cloud-provider-for-terraform-getting-started>`__ admite el aprovisionamiento de instancias del servicio Qiskit Runtime. Para ello se utiliza el recurso genérico ``ibm_resource_instance``. Se deben especificar los siguientes parámetros:

source: Provisioning with Terraform
es_un: Aprovisionamiento con Terraform
ja: Terraform を使用したプロビジョニング

source: ``name`` – The name of your service instance.
es_un: ``name`` – El nombre de tu instancia de servicio.
ja: ``name`` - サービス・インスタンスの名前。

source: ``service`` – Specify ``quantum-computing`` to provision Qiskit Runtime instances.
es_un: ``service`` – Especifica ``quantum-computing`` para aprovisionar instancias de Qiskit Runtime.
ja: ``service`` - Qiskit Runtimeインスタンスをプロビジョンするための ``quantum-computing`` を指定します。

source: ``plan`` – Can be ``lite`` or ``paygo-standard``.
es_un: ``plan`` – Puede ser ``lite`` o ``paygo-standard``.
ja: ``plan`` – ``lite`` または ``paygo-standard`` にできます。

source: ``location`` – Currently, this must be ``us-east``.
es_un: ``location`` – Actualmente, debe ser ``us-east``.
ja: ``location`` – 現在、``us-east`` でなければなりません。

source: Optional parameters include:
es_un: Los parámetros opcionales incluyen:
ja: オプション・パラメーターには以下が含まれます：

source: ``resource_group_id`` – Creates the service instance in the specified resource group.
es_un: ``resource_group_id`` – Crea la instancia de servicio en el grupo de recursos especificado.
ja: ``resource_group_id`` – 指定したリソースグループ内のサービスインスタンスを作成します。

source: ``tags`` – Add tags to the resource.
es_un: ``tags`` – Agrega etiquetas al recurso.
ja: ``tags`` – タグをリソースに追加します。

source: Example: Creating a service instance of Qiskit Runtime
es_un: Ejemplo: Crear una instancia de servicio de Qiskit Runtime

source: After the job completes, you can view the results.
es_un: Una vez que se completa el trabajo (job), puedes ver los resultados.
ja: ジョブが完了すると、結果を表示できます。

source: In your Terraform configuration file, add the following code. Change the name of the service instance (parameter “name”) and the plan (parameter “plan”) according to your requirements:
es_un: En tu archivo de configuración de Terraform, agrega el siguiente código. Cambia el nombre de la instancia de servicio (parámetro “name”) y el plan (parámetro “plan”) según tus requerimientos:
ja: Terraformの設定ファイルに、次のコードを追加します。 サービス・インスタンスの名前（パラメーター “name” ）とプラン（パラメーター “plan” ）を要件に応じて変更します:

source: Create a Terraform execution plan.
es_un: Crea un plan de ejecución de Terraform.
ja: Terraform実行プランを作成します。

source: Remove the namespace and re-create it with a new name. Note that this process might take a few minutes to complete.
es_un: Elimina el espacio de nombres y vuelve a crearlo con un nuevo nombre. Ten en cuenta que este proceso puede tardar unos minutos en completarse.
ja: 名前空間を削除し、新しい名前で再作成します。この処理には数分かかる場合があります。

source: Verify on the `Instances page <https://cloud.ibm.com/quantum/instances>`__ that your service instance has been created.
es_un: Verifica en la `página Instances <https://cloud.ibm.com/quantum/instances>`__ que se ha creado tu instancia de servicio.
ja: サービスインスタンスが作成された `Instances ページ <https://cloud.ibm.com/quantum/instances>`__ で確認します。

source: Qiskit Runtime service instances are IAM managed resources. Access can be shaped through terraform using IAM user policies. See `ibm_iam_user_policy <https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/iam_user_policy>`__ for more details and examples.
es_un: Las instancias del servicio Qiskit Runtime son recursos administrados por IAM. El acceso se puede configurar a través de terraform utilizando políticas de usuario de IAM. Consulta la `ibm_iam_user_policy <https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/iam_user_policy>`__ para obtener más detalles y ejemplos.
ja: Qiskit RuntimeサービスインスタンスはIAMで管理されたリソースです。IAMのユーザーポリシーを使って、terraform でアクセスを制御することができます。詳細とサンプルは `ibm_iam_user_policy <https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/iam_user_policy>`__ を参照してください。

source: If you use Terraform to manage your infrastructure, the `IBM Cloud provider for Terraform <https://cloud.ibm.com/docs/ibm-cloud-provider-for-terraform?topic=ibm-cloud-provider-for-terraform-getting-started>`__ supports provisioning Qiskit Runtime service instances. The generic "ibm_resource_instance" resource is used for that. The following parameters have to be specified:
ja: Terraformを使用してインフラストラクチャーを管理している場合、`IBM Cloud provider for Terraform <https://cloud.ibm.com/docs/ibm-cloud-provider-for-terraform?topic=ibm-cloud-provider-for-terraform-getting-started>`__ はQiskit Runtimeサービス・インスタンスのプロビジョニングをサポートしています。そのためには、汎用の "ibm_resource_instance" リソースが使用されます。以下のパラメーターを指定する必要があります。

source: Example: Creating a Service Instance of Qiskit Runtime
ja: 例: Qiskit Runtime のサービス・インスタンスの作成
