Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/optimization/1_quadratic_program.po
Languages: es_un, fr_fr, id_id, it_it, ko_kr, ta_in

source: You can access the constant, the linear term, and the quadratic term by looking at ``Quadratic.objective.{constant, linear, quadratic}``, respectively. As for linear and quadratic terms, you can get a dense matrix (``to_array``), a sparse matrix (``coefficients``), and a dictionary (``to_dict``). For dictionaries, you can specify whether to use variable indices or names as keys. Note that the quadratic terms are stored in a compressed way, e.g., ``{('x', 'y'): 1, ('y', 'x'): 2}`` is stored as ``{('x', 'y'): 3}``. You can get the quadratic term as a symmetric matrix by calling ``to_array(symmetric=True)`` or ``to_dict(symmetric=True)``. If you call ``to_dict(name=True)``, you can get a dictionary whose keys are pairs of variable names.
es_un: Puedes acceder a la constante, el término lineal y el término cuadrático mediante ``Quadratic.objective.{constant, linear, quadratic}``, respectivamente. En cuanto a los términos lineales y cuadráticos, puedes obtener una matriz densa (``to_array``), una matriz dispersa (``coefficients``), y un diccionario (``to_dict``). Para los diccionarios, puedes especificar si usar los índices de variables o los nombres como claves. Ten en cuenta que los términos cuadráticos se almacenan de una manera comprimida, por ejemplo, ``{('x', 'y'): 1, ('y', 'x'): 2}`` se almacena como ``{('x', 'y'): 3}``. Puedes obtener el término cuadrático como una matriz simétrica llamando a ``to_array(symmetric=True)`` o ``to_dict(symmetric=True)``. Si llama a ``to_dict(name=True)``, puedes obtener un diccionario cuyas claves son pares de nombres de variables.
fr_fr: Vous pouvez accéder au terme constant, au terme linéaire et au terme quadratique en regardant respectivement ``Quadratic.objective.{constant, linear, quadratic}``. Pour ce qui est des termes linéaires et quadratiques, vous pouvez obtenir une matrice dense (``to_array``), une matrice éparse (``coefficients``) et un dictionnaire (``to_dict``). Pour les dictionnaires, vous pouvez spécifier si vous devez utiliser des indices variables ou des noms comme clés. Notez que les termes quadratiques sont stockés de manière compressée, par exemple ``{('x', 'y'): 1, ('y', 'x'): 2}`` est stocké sous la forme ``{('x', 'y'): 3}``. Vous pouvez obtenir le terme quadratique en tant que matrice symétrique en appelant ``to_array(symmetric=True)`` ou ``to_dict(symmetric=True)``. Si vous appelez ``to_dict(name=True)``, vous pouvez obtenir un dictionnaire dont les clés sont des paires de noms de variables.
id_id: Anda dapat mengakses konstanta, term linear, dan term kuadrat dari ``Quadratic.objective.{constant, linear, quadratic}` `, masing-masing. Sedangkan untuk term linear dan kuadratik, Anda dapat mendapatkan matriks padat (` ` to_array ` `), matriks jarang (` ` coefficients ` `), dan dictionary (` ` to_dict ` ` `). Untuk dictionary, Anda dapat menentukan apakah menggunakan indeks variabel atau nama sebagai kunci. Perhatikan bahwa term kuadrat disimpan dengan cara yang kompak, misalnya, ` ` {('x ',' y '): 1, ('y', 'x'): 2} ` ` disimpan sebagai ` ` {('x ',' y '): 3} ` `. Anda dapat memperoleh term kuadrat sebagai matriks simetrik dengan cara memanggil ` ` to_array (symmetric =True) ` ` atau ` ` to_dict (symmetric=True) ``. Jika Anda memanggil ` ` to_dict (name=True) ``, Anda dapat mendapatkan dictionary yang kunci-kuncinya adalah pasangan nama variabel.
it_it: È possibile accedere al termine costante, lineare e quadratico guardando rispettivamente ``Quadratic.objective.{constant, linear, quadratic}``. Per i termini lineari e quadratici si può ottenere una matrice densa (``to_array``), una matrice sparsa (``coefficients``), e un dizionario (``to_dict``). Per i dizionari è possibile specificare se usare gli indici delle variabili o i loro nomi come chiavi. Si noti che i termini quadratici sono salvati in maniera compressa, ad esempio ``{('x', 'y'): 1, ('y', 'x'): 2}`` è salvato come ``{('x', 'y'): 3}``. Si può ottenere il termine quadratico come una matrice simmetrica usando ``to_array(symmetric=True)`` o ``to_dict(symmetric=True)``. Usando ``to_dict(name=True)`` si ottiene un dizionario le cui chiavi sono coppie di nomi di variabili.
ko_kr: ``Quadratic.objective.{constant, linear, quadratic}`` 를 출력함으로써 상수 항, 선형 항, 이차 항에 각각 액세스 (access) 할 수 있다. 선형 항과 이차 항을 출력하고자 할 때는 밀집 행렬( ``to_array``), 희소 행렬( ``coefficients``), 딕셔너리( ``to_dict``) 중에서 선택하여 출력할 수 있다. 딕셔너리의 경우, 자료형의 키를 명시할 때 변수들의 인덱스를 사용하거나 변수들의 이름을 사용하여 명시할 수 있다. 출력된 이차 항은 압축된 형태 (즉, ``{('x', 'y'): 1, ('y', 'x'): 2}`` 는 ``{('x', 'y'): 3}`` 의 형태로 압축) 임에 유의하시오. ``to_array(symmetric=True)`` 또는 ``to_dict(symmetric=True)`` 를 호출하여 이차 항을 대칭 행렬 형태로 출력할 수 있다. 만약 ``to_dict(name=True)`` 를 호출했다면 키가 변수들의 이름인 딕셔너리를 출력할 수 있을 것이다.
ta_in: முறையே `` Quadratic.objective. {constant, linear, quadratic} `` ஐப் பார்த்து நிலையான, நேரியல் சொல் மற்றும் இருபடி காலத்தை அணுகலாம். நேரியல் மற்றும் இருபடி சொற்களைப் பொறுத்தவரை, நீங்கள் அடர்த்தியான அணி (`` to_array``), ஒரு சிதறாத அணி (`` coefficients``) மற்றும் ஒரு அகராதி (`` to_dict``) ஆகியவற்றைப் பெறலாம். அகராதிகளுக்கு, மாறி குறியீடுகள் அல்லது பெயர்களை விசைகளாகப் பயன்படுத்தலாமா என்பதை நீங்கள் குறிப்பிடலாம். இருபடி சொற்கள் சுருக்கப்பட்ட வழியில் சேமிக்கப்படுகின்றன என்பதை நினைவில் கொள்க, எ.கா., `` {('x', 'y'): 1, ('y', 'x'): 2} `` `` as ( 'x', 'y'): 3} ``. `` To_array (symmetric=True) `` அல்லது `` to_dict (symmetric=True) `` என்று அழைப்பதன் மூலம் நீங்கள் இருபடிச் சொல்லை சமச்சீர் மேட்ரிக்ஸாகப் பெறலாம். நீங்கள் `` to_dict (name=True) `` என்று அழைத்தால், நீங்கள் ஒரு அகராதியைப் பெறலாம், அதன் விசைகள் மாறி பெயர்களின் ஜோடிகளாகும்.

source: Adding/removing linear and quadratic constraints
es_un: Añadiendo/eliminando restricciones lineales y cuadráticas
fr_fr: Ajout/suppression des contraintes linéaires et quadratiques
id_id: Menambah/menghapus kondisi linear dan kuadrat
it_it: Aggiungere/rimuovere vincoli lineari e quadratici
ko_kr: 선형 제약조건과 이차 제약조건을 추가/제거하기
ta_in: நேரியல் மற்றும் இருபடி தடைகளைச் சேர்த்தல் / நீக்குதல்

source: You can add linear constraints by setting name, linear expression, sense and right-hand-side value (rhs). You can use senses ‘EQ’, ‘LE’, and ‘GE’ as Docplex supports.
es_un: Puedes añadir restricciones lineales estableciendo un nombre, expresión lineal, el sentido y el valor de mano derecha (rhs). Puedes utilizar los sentidos 'EQ', 'LE' y 'GE' como soporte de Docplex.
id_id: Anda dapat menambah kondisi linear dengan menetapkan nama, ekspresi linear, arah atau sense dan nilai di sebelah kanan persamaan (rhs value). Anda dapat menggunakan arah 'EQ', 'LE', dan 'GE' seperti yang dipakai di Docplex.
ko_kr: 이름, 선형 표현식, 민감도 (sense), 우변 (right-hand-side valuel; rhs) 을 설정함으로써 선형 제약조건을 추가할 수 있다. 민감도의 경우 Docples는 'EQ', 'LE', and 'GE' 를 지원한다.
ta_in: பெயர், நேரியல் வெளிப்பாடு, உணர்வு மற்றும் வலது கை மதிப்பு (rhs) ஆகியவற்றை அமைப்பதன் மூலம் நீங்கள் நேரியல் கட்டுப்பாடுகளைச் சேர்க்கலாம். டாக்ளெக்ஸ் ஆதரவாக நீங்கள் ‘EQ’, ‘LE’ மற்றும் ‘GE’ போன்ற புலன்களைப் பயன்படுத்தலாம்.

source: You can add quadratic constraints as well as objective function and linear constraints.
es_un: Puedes añadir restricciones cuadráticas, así como funciones objetivo y restricciones lineales.
fr_fr: Vous pouvez ajouter des contraintes quadratiques ainsi que des fonctions objectives et des contraintes linéaires.
id_id: Anda dapat menambah kondisi kuadrat serta fungsi obyektif dan kondisi linear.
it_it: Si possono aggiungere vincoli quadratici, così come funzioni obiettivo e vincoli lineari.
ko_kr: 목적함수와 선형 제약조건 뿐만 아니라 이차 제약조건도 추가할 수 있다.
ta_in: நீங்கள் இருபடி கட்டுப்பாடுகள் மற்றும் புறநிலை செயல்பாடு மற்றும் நேரியல் தடைகளை சேர்க்கலாம்.

source: You can access linear and quadratic terms of linear and quadratic constraints as in the same way as the objective function.
es_un: Puedes acceder a términos lineales y cuadráticos de restricciones cuadráticas y lineales como del mismo modo que la función objetivo.
fr_fr: Vous pouvez accéder à des termes linéaires et quadratiques de contraintes linéaires et quadratiques de la même manière que la fonction cible.
id_id: Anda dapat mengakses term linear dan kuadrat dari kondisi linear dan kuadratik dengan cara sama seperti fungsi objektif.
it_it: È possibile accedere ai termini lineari e quadratici dei vincoli lineari e quadratici nello stesso modo in cui si accede a quelli della funzione obiettivo.
ko_kr: 목적함수에 액세스(access) 했던 방법을 그대로 사용하여 선형 제약조건의 선형 항과 이차 제약조건의 이차 항에 각각 액세스할 수 있다.
ta_in: புறநிலை செயல்பாட்டைப் போலவே நேரியல் மற்றும் இருபடி கட்டுப்பாடுகளின் நேரியல் மற்றும் இருபடி சொற்களை நீங்கள் அணுகலாம்.

source: You can also remove linear/quadratic constraints by ``remove_linear_constraint`` and ``remove_quadratic_constraint``.
es_un: También puedes eliminar restricciones lineales/cuadráticas con ``remove_linear_constraint`` y ``remove_quadratic_constraint``.
fr_fr: Vous pouvez également supprimer les contraintes linéaires/quadratiques par ``remove_linear_constraint`` et ``remove_quadratic_constraint``.
id_id: Anda juga dapat menghapus kondisi linear/kuadrat dengan ` ` remove_linear_constraint ` ` dan ` ` remove_quadratic_constraint ` `.
it_it: Si possono inoltre rimuovere vincoli lineari/quadratici usando ``remove_linear_constraint`` e ``remove_quadratic_constraint``.
ko_kr: 또한 ``remove_linear_constraint`` 과 ``remove_quadratic_constraint`` 을 사용하여 선형/이차 제약조건을 제거할 수 있다.
ta_in: `` Remove_linear_constraint`` மற்றும் `` remove_quadratic_constraint`` மூலம் நேரியல் / இருபடி கட்டுப்பாடுகளையும் நீக்கலாம்.

source: You can substitute some of variables with constants or other variables. More precicely, ``QuadraticProgram`` has a method ``substitute_variables(constants=..., variables=...)`` to deal with the following two cases. - :math:`x \leftarrow c`: when ``constants`` have a dictionary ``{x: c}``. - :math:`x \leftarrow c y`: when ``variables`` have a dictionary ``{x: (y, c)}``.
fr_fr: Vous pouvez remplacer certaines variables par des constantes ou par d'autres variables. Plus précisément, ``QuadraticProgram`` a une méthode ``substitute_variables (constants= ..., variables= ...)`` pour traiter les deux cas suivants. - :math:`x \leftarrow c`: quand `` constants`` ont un dictionnaire ``{x: c}``.- :math:` x \leftarrow c y`: quand ``variables`` ont un dictionnaire ``{ x: (y, c) }``.
it_it: È possibile sostituire alcune delle variabili con costanti o con altre variabili. Più precisamente, ``QuadraticProgram`` contiene un metodo ``substitute_variables(constants=..., variables=...)`` per gestire i seguenti due casi. - :math:`x \leftarrow c`: quando ``constants`` hanno un dizionario ``{x: c}``.- :math:`x \leftarrow c y`: quando ``variables`` hanno un dizionario ``{x: (y, c)}``.
ko_kr: 변수에 상수를 대입하거나 해당 변수를 다른 변수로 대체할 수 있다. 엄밀히 말하자면, ``QuadraticProgram`` 의 ``substitute_variables(constants=..., variables=...)`` 메서드는 다음의 두 가지 경우를 처리할 수 있다. - :math:`x \leftarrow c`: ``constants`` 가 딕셔너리 ``{x: c}`` 를 가질 때. - :math:`x \leftarrow c y`: ``variables`` 가 딕셔너리 ``{x: (y, c)}`` 를 가질 때.

source: Substituting Variables
es_un: Sustitución de Variables
fr_fr: Substitution des variables
id_id: Substitusi Variabel
it_it: Sostituire le Variabili
ko_kr: 변수 치환
ta_in: மாற்று மாறிகள்

source: If the resulting problem is infeasible due to lower bounds or upper bounds, the methods returns the status ``Status.INFEASIBLE``. We try to replace variable ``x`` with -1, but -1 is out of range of ``x`` (0 <= ``x`` <= 1). So, it returns ``Status.INFEASIBLE``.
es_un: Si el problema resultante es inviable debido a los límites inferiores o superiores, los métodos devuelven el estado ``Status.INFEASIBLE``. Intentamos reemplazar la variable ``x`` por -1, pero -1 está fuera del rango de ``x`` (0 <= ``x`` <= 1). Por lo tanto, se devuelve ``Status.INFEASIBLE``.
fr_fr: S'il n'est pas possible de résoudre le problème résultant en raison de bornes inférieures ou de bornes supérieures, la méthode renvoie le statut ``Status.INFEASIBLE``. Nous essayons de remplacer la variable ``x`` par -1, mais -1 n'est pas comprise dans la plage de ``x`` (0 < = ``x`` < = 1). Donc, il retourne ``Status.INFEASIBLE ``.
id_id: Jika masalah yang diformulasi tidak bisa dipecahkan karena batas rendah atau batas atas, metode mengembalikan status ` `Status.INFEASIBLE ` `. Kami mencoba untuk mengganti variabel ` ` x ` ` dengan -1, tetapi -1 diluar dari jangka nilai ` ` x ` ` (0 < = ` ` x ` ` < = 1). Jadi, metode ini menghasilkan ` `Status.INFEASIBLE ` `.
it_it: Se il problema risultante è infattibile per via dei vincoli inferiori o superiori, i metodi restituiscono lo status ``Status.INFEASIBLE``. Si cerca di sostituire la variabile ``x`` con -1, ma -1 è al di fuori dell'intervallo di ``x`` (0 <= ``x`` <= 1). Perciò restituisce ``Status.INFEASIBLE``.
ko_kr: 상계 혹은 하계의 제약조건을 만족할 수 없는 불가능 (infeasible) 상태에서, 해당 메서드는 ``Status.INFEASIBLE`` 을 반환한다. 우리는 변수 ``x`` 에 -1을 대입하고 있지만, -1 은 ``x`` 의 범위 (0 <= ``x`` <= 1) 를 벗어난다. 따라서 메서드는 ``Status.INFEASIBLE`` 를 반환하는 것이다.
ta_in: குறைந்த வரம்புகள் அல்லது மேல் வரம்புகள் காரணமாக விளைந்த சிக்கல் அணுக முடியாததாக இருந்தால், முறைகள் `` Status. INFEASIBLE`` என்ற நிலையை அளிக்கிறது. மாறி `` x`` ஐ -1 உடன் மாற்ற முயற்சிக்கிறோம், ஆனால் -1 என்பது `` x`` (0 <= `` x`` <= 1) வரம்பிற்கு வெளியே உள்ளது. எனவே, இது `` Status.INFEASIBLE`` ஐ வழங்குகிறது.

source: You cannot substitute variables multiple times. The method raises an error in such a case.
es_un: No puedes sustituir variables varias veces. El método devuelve un error en este caso.
fr_fr: Vous ne pouvez pas substituer plusieurs fois les variables. La méthode renvoie une erreur dans ce cas.
id_id: Anda tidak bisa mengganti variabel lebih dari sekali. Metode ini melaporkan error dalam kasus seperti itu.
it_it: Non è possibile sostituire più volte le variabili. In tal caso il metodo genera un errore.
ko_kr: 한 번 대체한 변수는 중복하여 대체할 수 없다. 이와 같은 경우 메서드는 오류를 발생시킨다.
ta_in: நீங்கள் மாறிகள் பல முறை மாற்ற முடியாது. அத்தகைய வழக்கில் முறை ஒரு பிழையை எழுப்புகிறது.

source: You can substitute some of variables with constants or other variables. More precisely, ``QuadraticProgram`` has a method ``substitute_variables(constants=..., variables=...)`` to deal with the following two cases. - :math:`x \leftarrow c`: when ``constants`` have a dictionary ``{x: c}``. - :math:`x \leftarrow c y`: when ``variables`` have a dictionary ``{x: (y, c)}``.
ta_in: நீங்கள் மாறிகள் அல்லது மாறிகளுடன் சில மாறிகள் மாற்றலாம். இன்னும் துல்லியமாக, பின்வரும் இரண்டு நிகழ்வுகளைச் சமாளிக்க `` குவாட்ராடிக் புரோகிராம்``க்கு ஒரு முறை ``substitute_variables(constants=..., variables=...) `` உள்ளது. -:math:`x \leftarrow c`: ``constants`` ஒரு அகராதி இருக்கும்போது` `{x: c}` `. -:math:`x \leftarrow c y`: ``variables`` ஒரு அகராதி இருக்கும்போது` `{x: (y, c)}` `.

source: In this tutorial, we briefly introduce how to build optimization problems using Qiskit's optimization module. Qiskit introduces the ``QuadraticProgram`` class to make a model of an optimization problem. More precicely, it deals with quadratically constrained quadratic programs given as follows:
fr_fr: Dans ce tutoriel, nous vous présentons brièvement comment générer des problèmes d'optimisation à l'aide du module d'optimisation de Qiskit. Qiskit introduit la classe ``QuadraticProgram`` pour construire un modèle d'un problème d'optimisation. Plus précisément, il traite des programmes quadratiques à contraintes quadratiques données comme suit :

source: where the :math:`Q_i` are :math:`n \times n` matrices, :math:`A` is a :math:`m \times n` matrix , :math:`x`, and :math:`c` are :math:`n`-dimensional vectors, :math:`b` is an :math:`m`-dimensional vector, and where :math:`x` can defined as binary, integer, or continuous variables. In addition to ":math:`\leq`" constraints 'QuadraticProgram' also supports ":math:`\geq`" and ":math:`=`".
fr_fr: où les :math:` Q_i ` sont :math:` n \t, n ` matrices, :math:` A ` est un :math:` m \times n ` matrice, :math:` x `, et :math:` c ` sont des vecteurs bidimensionnels :math:` s, :math:` b ` est un vecteur de dimension :math:` m, et où :math:` x ` peut être défini comme des variables binaires, entières ou continues. En plus de la contrainte ":math:` \leq` 'QuadraticProgram' prend également en charge":math:` \geq ` et :math:` =` .
it_it: dove i :math:`Q_i`sono matrici :math:`n \times n`, :math:`A` è una matrice :math:`m \times n`, :math:`x` e :math:`c` sono vettori :math:`n`-dimensionali, :math:`b` è un vettore :math:`m`-dimensionale, e dove :math:`x` può essere definita come variabile binaria, intera o continua. Oltre a vincoli di tipo ":math:`\leq`", 'QuadraticProgram' supporta anche ":math:`\geq`" e ":math:`=`".

source: You start with an empty model. How to add variables and constraints to a model is explained in the section "Directly constructing a ``QuadraticProgram``".
fr_fr: Vous démarrez avec un modèle vierge. La manière d'ajouter des variables et des contraintes à un modèle est expliqué dans la section "Construire directement un ``QuadraticProgamme``" (Programme Quadratique).
it_it: Si inizia con un modello vuoto. Come aggiungere variabili e vincoli a un modello è spiegato nella sezione "Costruire direttamente un ``QuadraticProgram``".

source: Qiskit's optimization module supports the conversion from Docplex model. You can easily make a model of an optimization problem with Docplex. You can find the documentation of Docplex at https://ibmdecisionoptimization.github.io/docplex-doc/mp/index.html
fr_fr: Le module d'optimisation de Qiskit prend en charge la conversion à partir du modèle Docplex. Vous pouvez facilement créer un modèle pour un problème d'optimisation avec Docplex. Vous trouverez la documentation de Docplex à l'adresse https://ibmdecisionoptimization.github.io/docplex-doc/mp/index.html
it_it: Il modulo di ottimizzazione di Qiskit supporta la conversione da un modello Docplex. Si può facilmente creare un modello di un problema di ottimizzazione con Docplex. La documentazione di Docplex è disponibile all'indirizzo https://ibmdecisionoptimization.github.io/docplex-doc/mp/index.html

source: We then explain how to make model of an optimization problem directly using ``QuadraticProgram``. Let's start from an empty model.
fr_fr: Nous expliquons ensuite comment modéliser un problème d'optimisation directement en utilisant le ``QuadraticProgram``. Commençons à partir d'un modèle vide.
it_it: Vediamo ora come creare un modello di un problema di ottimizzazione utilizzando direttamente ``QuadraticProgram``. Cominciamo con un modello vuoto.

source: When you display your problem as LP format, ``Binaries`` denotes binary variables and ``Generals`` denotes integer variables. If variables are not included in either ``Binaries`` or ``Generals``, such variables are continuous ones with default lower bound = 0 and upper bound = infinity. Note that you cannot use 'e' or 'E' as the first character of names due to the `specification of LP format <https://www.ibm.com/support/knowledgecenter/SSSA5P_12.7.1/ilog.odms.cplex.help/CPLEX/FileFormats/topics/LP_VariableNames.html>`__.
fr_fr: Lorsque vous affichez votre problème sous forme de format LP, ``Binaries`` indique des variables binaires et ``Generals`` indique les variables entières. Si les variables ne figurent pas dans ``Binaries`` ou ``Generals``, ces variables sont continues avec 0 comme limite inférieure par défaut, et l'infinité comme limite supérieure. Notez que vous ne pouvez pas utiliser 'e' ou 'E' comme premier caractère des noms en raison de la spécification du format LP <https://www.ibm.com/support/knowledgecenter/SSSA5P_12.7.1/ilog.odms.cplex.help/CPLEX/FileFormats/topics/LP_VariableNames.html>` __.
it_it: Quando si visualizza il problema in formato LP, ``Binaries`` denota le variabili binarie e ``Generals`` denota le variabili intere. Se le variabili non sono incluse in ``Binaries`` o ``Generals``, tali variabili sono continue, con limite inferiore predefinito = 0 e limite superiore = infinito. Da notare che non è possibile utilizzare 'e' o 'E' come primo carattere dei nomi a causa delle `specifiche del formato LP <https://www.ibm.com/support/knowledgecenter/SSSA5P_12.7.1/ilog.odms.cplex.help/CPLEX/FileFormats/topics/LP_VariableNames.html>` __.

source: You can add linear constraints by setting name, linear expression, sense and right-hand-side value (rhs). You can use senses 'EQ', 'LE', and 'GE' as Docplex supports.
fr_fr: Vous pouvez ajouter des contraintes linéaires en définissant le nom, l'expression linéaire, le sens de l'inégalité et la valeur du côté droit (rhs pour right-hand-side). Vous pouvez utiliser les sens 'EQ', 'LE' et 'GE' comme supporté par Docplex.
it_it: Si possono aggiungere vincoli lineari impostando nome, espressione lineare, direzione e valore destro (rhs). Si possono utilizzare le direzioni 'EQ', 'LE', e 'GE' come supportato da Docplex.
