Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/optimization/1_quadratic_program.po
Languages: es_un, fr_fr, id_id, it_it, ko_kr, ta_in

source: This page was generated from `tutorials/optimization/1_quadratic_program.ipynb`__.
es_un: Esta página ha sido generada a partir de `tutorials/optimization/1_quadratic_program.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/optimization/1_quadratic_program.ipynb`__.
id_id: Halaman ini dibuat dari ` tutorials/algoritms/01_grover.ipynb ` __.
it_it: Questa pagina è stata generata da `tutorials/optimization/1_quadratic_program.ipynb`__.
ko_kr: 이 페이지는 `tutorials/optimization/1_quadratic_program.ipynb`_ 에서 생성되었다.
ta_in: இந்த பக்கம் `tutorials/optimization/1_quadratic_program.ipynb`__.இலிருந்து உருவாக்கப்பட்டது.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/1_quadratic_program.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/5_quantum_volume.ipynb>`_.
id_id: Jalankan secara interaktif dalam ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/simulators/1_aer_provider.ipynb>` _.
ko_kr: `IBM 퀀텀 랩 <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/1_quadratic_program.ipynb>`_ 에서 대화식으로 실행하십시오.
ta_in: `IBM குவாண்டம் ஆய்வகத்தில் <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/1_quadratic_program.ipynb>` _ இல் ஊடாடும் வகையில் இயக்கவும்.

source: Quadratic Programs
es_un: Programas Cuadráticos
fr_fr: Programmes quadratiques
id_id: Program Kuadratik
it_it: Programmi Quadratici
ko_kr: 이차계획법 문제
ta_in: இருபடி திட்டங்கள்

source: Introduction
es_un: Introducción
id_id: Pendahuluan
it_it: Introduzione
ko_kr: 소개
ta_in: முன்னுரை

source: In this tutorial, we briefly introduce how to build optimization problems using Qiskit’s optimization module. Qiskit introduces the ``QuadraticProgram`` class to make a model of an optimization problem. More precisely, it deals with quadratically constrained quadratic programs given as follows:
es_un: En este tutorial presentamos brevemente cómo construir problemas de optimización usando el módulo de optimización de Qiskit. Qiskit introduce la clase ``QuadraticProgram`` para hacer un modelo de un problema de optimización. Más precisamente, se ocupa de programas cuadráticamente restringidos que se dan de la siguiente manera:
id_id: Dalam tutorial ini, kami memperkenalkan cara membangun masalah optimisasi dengan menggunakan modul optimasi Qiskit. Qiskit membuat kelas ` ` QuadraticProgram ` ` untuk membuat model optimisasi. Tutorial ini berkaitan dengan program kuadratik yang memiliki konstrain kuadratik diberikan sebagai berikut:
ko_kr: 본 사용 지침서에서는, 키스킷의 최적화 모듈을 사용하여 최적화 문제를 빌드하는 방법을 간략하게 소개할 것이다. 키스킷은 최적화 문제의 모델을 생성하기 위하여 ``QuadraticProgram`` 클래스를 소개한다. 엄밀히 말하자면, ``QuadraticProgram`` 는 목적함수와 제약조건이 모두 이차 식으로 주어진 문제들 (quadratically constrained quadratic programs) 을 다룬다. 예를 들어, 다음과 같이 주어진 문제에서:
ta_in: இந்த டுடோரியலில், Qiskit ட்டின் தேர்வுமுறை தொகுதியைப் பயன்படுத்தி தேர்வுமுறை சிக்கல்களை எவ்வாறு உருவாக்குவது என்பதை சுருக்கமாக அறிமுகப்படுத்துகிறோம். தேர்வுமுறை சிக்கலின் மாதிரியை உருவாக்க Qiskit `` குவாட்ராடிக் புரோகிராம்`` வகுப்பை அறிமுகப்படுத்துகிறது. இன்னும் துல்லியமாக, இது பின்வருமாறு கொடுக்கப்பட்டுள்ள இருபடி கட்டுப்படுத்தப்பட்ட இருபடி திட்டங்களுடன் தொடர்புடையது:

source: where the :math:`Q_i` are :math:`n \times n` matrices, :math:`A` is a :math:`m \times n` matrix , :math:`x`, and :math:`c` are :math:`n`-dimensional vectors, :math:`b` is an :math:`m`-dimensional vector, and where :math:`x` can defined as binary, integer, or continuous variables. In addition to “:math:`\leq`” constraints ‘QuadraticProgram’ also supports “:math:`\geq`” and “:math:`=`”.
es_un: donde el :math:`Q_i` son matrices :math:`n \times n`, :math:`A` es una matriz de :math:`m \times n` , :math:`x`, y :math:`c` son vectores :math:`n`-dimensionales, :math:`b` es un vector :math:`m`-dimensional, y donde :math:`x` puede definirse como variables binarias, enteras o continuas. Además de las restricciones “:math:`\leq`” ‘QuadraticProgram’ también soporta “:math:`\geq`” y “:math:`=`”.
id_id: dimana :math:` Q_i` adalah matrik :math:` n \times n`, :math:`A` adalah matrik :math:` m \times n`, :math:`x`, dan :math:`c` adalah vektor berdimensi :math:`n`, :math:`b` adalah vektor berdimensi :math:` m`, dan :math:` x ` dapat didefinisikan sebagai biner, integer, atau variabel kontinu. Selain dari kondisi ":math:`\leq`" 'QuadraticProgram' juga mendukung kondisi ":math:` \geq`" dan ":math:`=`".
ko_kr: 여기서 :math:`Q_i`는 `i`번째 :math:`n \times n` 행렬, :math:`A`는 :math:`m \times n` 행렬, :math:`x`와 :math:`c`는 각각 :math:`n`-차원 벡터이고, :math:`b`는 :math:`m`-차원 벡터일 때, :math:`x`는 바이너리, 정수, 혹은 연속한 변수들로 정의된다. ``QuadraticProgram`` 클래스는 ":math:`\leq`" 제약조건 뿐만 아니라 ":math:`\geq`" 제약조건과 ":math:`=`" 제약조건도 지원한다.
ta_in: எங்கே: math: `Q_i`: math:` n \ முறை n` மெட்ரிக்குகள் ,: math: `A` என்பது ஒரு: math:` m \ முறை n` அணி ,: math: `x`, மற்றும்: math: `c` கள்: கணிதம்:` n` பரிமாண திசையன்கள் ,: math: `b` என்பது ஒரு: math:` m` பரிமாண திசையன், மற்றும் எங்கே: math: `x` பைனரி, முழு எண் அல்லது தொடர்ச்சியான மாறிகள் என வரையறுக்கப்படுகிறது . “: math:` \ leq` ”தடைகளுக்கு மேலதிகமாக‘ QuadraticProgram ’மேலும்“: math: `\ geq`” மற்றும் “: math:` = `” ஐ ஆதரிக்கிறது.

source: Loading a ``Quadratic Program`` from an LP file
es_un: Cargando un ``Quadratic Program`` desde un archivo LP
fr_fr: Chargement d'un ``Quadratic Program`` depuis un fichier LP
id_id: Memuat ``Program Kuadrat`` dari file LP
it_it: Caricare un ``Quadratic Program`` da un file LP
ko_kr: LP (Linear Program) 파일에서 ``Quadratic Program`` 를 불러오기
ta_in: எல்பி கோப்பிலிருந்து ``Quadratic Program`` ஏற்றுகிறது

source: As setup, you need to import the following module.
es_un: Como configuración, necesitas importar el siguiente módulo.
fr_fr: Pour préparer votre station de travail vous devez importer le module suivant.
id_id: Sebagai pengaturan, Anda perlu mengimpor modul berikut.
it_it: Come setup, è necessario importare il seguente modulo.
ko_kr: 초기 설정을 위하여, 아래와 같이 모듈을 임포트해야 한다.
ta_in: அமைப்பாக, நீங்கள் பின்வரும் தொகுதியை இறக்குமதி செய்ய வேண்டும்.

source: You start with an empty model. How to add variables and constraints to a model is explained in the section “Directly constructing a ``QuadraticProgram``”.
es_un: Se inicia con un modelo vacío. Cómo agregar variables y restricciones a un modelo se explica en la sección "Construir directamente un ``QuadraticProgram``".
id_id: Anda mulai dengan model yang kosong. Cara menambahkan variabel dan constrain pada sebuah model dijelaskan dalam bagian "Langung mengkontruksi sebuah ` ` QuadraticProgram ` `".
ko_kr: 비어 있는 모델에서 시작한다. 모델에 변수와 제한조건을 추가하는 방법에 대해서는 " ``QuadraticProgram`` 을 사용하여 직접 모델을 세워보기" 섹션에서 설명할 것이다.
ta_in: நீங்கள் ஒரு காலியான மாதிரி ஆரம்பிக்கிறது. மாதிரிகளுக்கு மாறுபாடு மற்றும் கட்டுப்பாடுகள் எப்படி ஒரு மாதிரிகளுக்கு சேர்க்க எப்படி " நேரடியாக ``QuadraticProgram `` " தெரிவு செய்யப்படுகிறது.

source: Qiskit’s optimization module supports the conversion from Docplex model. You can easily make a model of an optimization problem with Docplex. You can find the documentation of Docplex at https://ibmdecisionoptimization.github.io/docplex-doc/mp/index.html
es_un: El módulo de optimización de Qiskit da soporte a la conversión del modelo Docplex. Puedes crear fácilmente un modelo de un problema de optimización con Docplex. Puedes encontrar la documentación de Docplex en https://ibmdecisionoptimization.github.io/docplex-doc/mp/index.html
id_id: Modul optimisasi Qiskit mendukung konversi dari model Docplex. Anda dapat dengan mudah membuat model masalah optimasi dengan Docplex. Anda dapat menemukan dokumentasi dari Docplex di https://ibmdecisionoptimization.github.io/docplex-doc/mp/index.html
ko_kr: 키스킷의 최적화 모듈은 Docplex 모델과의 변환을 지원한다. Docplex를 활용하면 쉽게 최적화 문제의 모델을 생성할 수 있다. Docplex 문서는 여기 https://ibmdecisionoptimization.github.io/docplex-doc/mp/index.html 에서 찾을 수 있다.
ta_in: Qiskit's optimization module from the conversion from Docplex model. நீங்கள் எளிதாக ஒரு ஒப்பீடு பிரச்சினை Docplex யுடன் ஒரு மாதிரி செய்ய முடியும். You can find the documentation of Docplex at https://ibmdecisionoptimization.github.io/docplex-doc/mp/index.html

source: You can load a Docplex model to ``QuadraticProgram`` by invoking ``from_docplex``.
es_un: Puedes cargar un modelo Docplex a ``QuadraticProgram`` invocando ``from_docplex``.
fr_fr: Vous pouvez charger un modèle Docplex vers le ``QuadraticProgram`` en appelant ``from_docplex``.
id_id: Anda dapat memuat model Docplex untuk ` ` ` QuadraticProgram ` ` dengan memanggil ` ` from_docplex ` `.
it_it: Un modello Docplex può essere caricato in un ``QuadraticProgram`` usando ``from_docplex``.
ko_kr: ``from_docplex`` 를 호출하여 Docplex 모델을 ``QuadraticProgram`` 에 불러올 수 있다.
ta_in: டாக்ளெக்ஸ் மாதிரியை ``QuadraticProgram`` க்கு ``from_docplex`` ஐ அழைப்பதன் மூலம் ஏற்றலாம்.

source: Loading a ``QuadraticProgram`` from a docplex model
es_un: Cargando un ``QuadraticProgram`` desde un modelo docplex
fr_fr: Chargement d'un ` ` QuadraticProgram ` ` à partir d'un modèle docplex
id_id: Memuat` ` QuadraticProgram ` ` dari model docplex
it_it: Caricare un ``QuadraticProgram`` da un modello docplex
ko_kr: Docplex 모델에서 ``QuadraticProgram``을 불러오기
ta_in: எல்பி கோப்பிலிருந்து ``QuadraticProgram`` ஏற்றுகிறது

source: Directly constructing a ``QuadraticProgram``
es_un: Construyendo directamente un ``QuadraticProgram``
fr_fr: Construction directe d'un ``QuadraticProgram``
id_id: Langsung membangun ` ` QuadraticProgram ` `
it_it: Costruire direttamente un ``QuadraticProgram``
ko_kr: ``QuadraticProgram`` 을 사용하여 직접 모델을 세워보기
ta_in: நேரடியாக `` QuadraticProgram`` ஐ உருவாக்குகிறது

source: We then explain how to make model of an optimization problem directly using ``QuadraticProgram``. Let’s start from an empty model.
es_un: A continuación, explicamos cómo hacer el modelo de un problema de optimización directamente utilizando ``QuadraticProgram``. Empecemos con un modelo vacío.
id_id: Kami kemudian menjelaskan bagaimana membuat model dari masalah optimisasi secara langsung menggunakan ` ` QuadraticProgram ` `. Mari kita mulai dari model yang kosong.
ko_kr: 우리는 ``QuadraticProgram`` 을 직접 사용하여 어떻게 최적화 문제의 모델을 생성하는지 설명할 것이다. 앞서 언급했듯이 비어 있는 모델에서 시작하자.
ta_in: ``QuadraticProgram`` ஐப் பயன்படுத்தி நேரடியாக ஒரு தேர்வுமுறை சிக்கலின் மாதிரியை எவ்வாறு உருவாக்குவது என்பதை நாங்கள் விளக்குகிறோம். வெற்று மாதிரியிலிருந்து ஆரம்பிக்கலாம்.

source: The ``QuadraticProgram`` supports three types of variables: - Binary variable - Integer variable - Continuous variable
es_un: El ``QuadraticProgram`` admite tres tipos de variables: - Variable binaria - Variable completa - Variable continua
fr_fr: Le programme ` ` QuadraticProgram ` ` prend en charge trois types de variables : -Variable binaire -Variable de type entier -Variable continue
id_id: ` ` QuadraticProgram ` ` mendukung tiga jenis variabel:-Variable biner-Variable bilangan bulat-Variabel kontinu
it_it: Il ``QuadraticProgram`` supporta tre tipi di variabili: - variabile Binaria - variabile Intera - variabile Continua
ko_kr: ``QuadraticProgram`` 는 다음의 세 가지 변수 유형을 지원한다: - 바이너리 변수 - 정수 변수 - 연속형 변수
ta_in: `` குவாட்ராடிக் புரோகிராம்`` மூன்று வகையான மாறிகளை ஆதரிக்கிறது: - பைனரி மாறி - முழு மாறுபாடு - தொடர்ச்சியான மாறி

source: When you add variables, you can specify names, types, lower bounds and upper bounds.
es_un: Al añadir variables, puedes especificar nombres, tipos, límites inferiores y límites superiores.
fr_fr: Lorsque vous ajoutez des variables, vous pouvez spécifier des noms, des types, des bornes inférieures et supérieures.
id_id: Ketika Anda menambahkan variabel, Anda dapat menentukan nama, tipe, batas bawah dan batas atas.
it_it: Quando si aggiunge una variabile, è possibile specificare nomi, tipi, limiti inferiori e superiori.
ko_kr: 변수를 추가할 때, 변수의 이름, 유형, 하계, 상계를 지정할 수 있다.
ta_in: நீங்கள் மாறிகளைச் சேர்க்கும்போது, ​​பெயர்கள், வகைகள், குறைந்த எல்லைகள் மற்றும் மேல் எல்லைகளைக் குறிப்பிடலாம்.

source: When you display your problem as LP format, ``Binaries`` denotes binary variables and ``Generals`` denotes integer variables. If variables are not included in either ``Binaries`` or ``Generals``, such variables are continuous ones with default lower bound = 0 and upper bound = infinity. Note that you cannot use ‘e’ or ‘E’ as the first character of names due to the `specification of LP format <https://www.ibm.com/support/knowledgecenter/SSSA5P_12.7.1/ilog.odms.cplex.help/CPLEX/FileFormats/topics/LP_VariableNames.html>`__.
es_un: Cuando muestras tu problema como formato LP, ``Binaries`` denota variables binarias y ``Generals`` denota variables enteros. Si las variables no están incluidas en ``Binaries`` o ``Generals``, dichas variables son continuas con un límite inferior predeterminado = 0 y límite superior = infinito. Ten en cuenta que no puede utilizar 'e' o' E' como primer carácter de nombre debido a la especificación del formato LP <https://www.ibm.com/support/knowledgecenter/SSSA5P_12.7.1/ilog.odms.cplex.help/CPLEX/FileFormats/topics/LP_VariableNames.html>` __.
id_id: Ketika Anda menampilkan masalah Anda sebagai format LP, ` ` Binaries ` ` menandakan variabel biner dan ` ` Generals ` ` menandakan variabel bilangan bulat. Jika variabel tidak dimasukkan dalam ` ` ` Binaries ` ` atau ` ` Generals ` `, variabel tersebut adalah variabel kontinu dengan batas bawah = 0 dan batas atas = tak terhingga (default). Perhatikan bahwa anda tidak dapat menggunakan 'e' atau' E' sebagai karakter pertama nama karena ` spesifikasi dari format LP <https://www.ibm.com/support/knowledgecenter/SSSA5P_12.7.1/ilog.odms.cplex.help/CPLEX/FileFormats/topics/LP_VariableNames.html>` __.
ko_kr: 당신의 최적화 문제가 LP 형식으로 표시될 때, ``Binaries`` 는 바이너리 변수들을 나타내고, ``Generals`` 는 정수형 변수들을 나타낸다. 만약 ``Binaries`` 와 ``Generals`` 둘 중에 어디에도 속하지 않는 변수들이 있다면, 이와 같은 변수들은 하계 = 0이고 상계 = infinity를 기본값으로 갖는 연속형 변수들이다. `LP 형식의 명세 <https://www.ibm.com/support/knowledgecenter/SSSA5P_12.7.1/ilog.odms.cplex.help/CPLEX/FileFormats/topics/LP_VariableNames.html>`_ 에 따라, 변수이름 첫 글자로 'e' 또는 'E'가 들어갈 수 없다는 점에 주의하시오.
ta_in: நீங்கள் உங்கள் பிரச்சனை LP வடிவமாக காட்டும் போது, ` ` binaries ` ` இரும வேறுபாடு மற்றும் `` Generals `` பொதுவான முழு வேறுபாட்டை குறிக்கும். வேறுபாடு ` ` binaries ` ` அல்லது `` Generals `` பொதுவான ` ` பொதுவான ` ` பொதுவான ` ` தனிமங்கள் " என்றால், முன்னிருப்பு குறைந்த பிணைப்பு = 0 மற்றும் மேல் பிணைப்பு = இனப்பெருக்கத்துடன் தொடர்ச்சியாக உள்ளன. நீங்கள் 'e' அல்லது' E' யை பயன்படுத்த முடியாது ' LP வடிவமைப்பு <https://www.ibm.com/support/knowledgecenter/SSSA5P_12.7.1/ilog.odms.cplex.help/CPLEX/FileFormats/topics/LP_VariableNames.html>` _.

source: You can set the objective function by invoking ``QuadraticProgram.minimize`` or ``QuadraticProgram.maximize``. You can add a constant term as well as linear and quadratic objective function by specifying linear and quadratic terms with either list, matrix or dictionary.
es_un: Puedes establecer la función objetivo invocando ``QuadraticProgram.minimize`` o ``QuadraticProgram.maximize``. Puedes añadir un término constante, así como una función objetivo lineal y cuadrática, especificando términos lineales y cuadráticos con una lista, una matriz o un diccionario.
fr_fr: Vous pouvez définir la fonction objectif en appelant ``QuadraticProgram.minimize`` ou ``QuadraticProgram.maximize``. Vous pouvez ajouter un terme constant ainsi qu'une fonction objectif linéaire ou quadratique en spécifiant des termes linéaires et quadratiques avec une liste, une matrice ou un dictionnaire.
id_id: Anda dapat mengatur fungsi objektif dengan memanggil ``QuadraticProgram.minimize`` atau ``QuadraticProgram.maximize``. Anda dapat menambahkan faktor konstan serta fungsi objektif linear dan kuadrat dengan menentukan term linear dan kuadrat baik dengan list, matrik atau dictionary.
it_it: È possibile impostare la funzione obiettivo tramite ``QuadraticProgram.minimize`` o ``QuadraticProgram.maximize``. Si può aggiungere un termine costante, così come una funzione obiettivo lineare o quadratica specificando i termini lineari e quadratici con una lista, una matrice o un dizionario.
ko_kr: ``QuadraticProgram.minimize`` 또는 ``QuadraticProgram.maximize`` 를 호출하여 목적함수를 설정할 수 있다. 리스트, 행렬, 혹은 딕셔너리 자료형을 사용해 선형 항과 이차 항을 지정함으로서 상수 항을 추가할 수 있을 뿐만 아니라 선형 목적함수와 이차 목적함수를 추가할 수 있다.
ta_in: `` QuadraticProgram.minimize`` அல்லது `` QuadraticProgram.maximize`` ஐ செயல்படுத்துவதன் மூலம் நீங்கள் புறநிலை செயல்பாட்டை அமைக்கலாம். பட்டியல், அணி அல்லது அகராதி ஆகியவற்றுடன் நேரியல் மற்றும் இருபடி சொற்களைக் குறிப்பிடுவதன் மூலம் நிலையான சொல் மற்றும் நேரியல் மற்றும் இருபடி புறநிலை செயல்பாட்டை நீங்கள் சேர்க்கலாம்.

source: Note that in the LP format the quadratic part has to be scaled by a factor :math:`1/2`. Thus, when printing as LP format, the quadratic part is first multiplied by 2 and then divided by 2 again.
es_un: Ten en cuenta que en el formato LP la parte cuadrática tiene que ser escalada por un factor :math:`1/2`. Por lo tanto, cuando se imprime como formato LP, la parte cuadrática se multiplica primero por 2 y luego se divide por 2 de nuevo.
fr_fr: Notez que dans le format LP, la partie quadratique doit être réduite par un facteur :math:` 1/2`. Ainsi, lors de l'affichage du résultat en format LP, la partie quadratique est d'abord multipliée par 2, puis divisée par 2.
id_id: Perhatikan bahwa dalam format LP bagian kuadratik harus diskala oleh faktor :math:` 1/2 `. Dengan demikian, ketika mencetak sebagai format LP, bagian kuadratik pertama kali dikalikan 2 dan kemudian dibagi 2 lagi.
it_it: Da notare che nel formato LP la parte quadratica deve essere scalata di un fattore :math:`1/2`. Per questo motivo, quando mostrata in formato LP, la parte quadratica è prima moltiplicata per 2 e poi nuovamente divisa per 2.
ko_kr: LP 형식에 따라 이차 항은 스케일 팩터 :math:`1/2` 로 스케일링 되어야 한다는 점을 유의하시오. 따라서 LP 형식에 따라 출력할 때, 이차 항에 먼저 2를 곱한 후 2로 나누게 된다.
ta_in: குறிப்பு LP வடிவத்தில் ஒரு காரணி :math:` 1/2 `. இவ்வாறு LP வடிவமாக அச்சிடும்போது, க்வாட்ரேட்டிக் பகுதி முதன் முதலில் 2 ஆக பிரிக்கப்பட்டு பின்னர் மீண்டும் 2 பிரிக்கப்பட்டுள்ளது.

source: For quadratic programs, there are 3 pieces that have to be specified: a constant (offset), a linear term (:math:`c^{T}x`), and a quadratic term (:math:`x^{T}Qx`).
es_un: Para los programas cuadráticos, hay 3 piezas que se deben de especificar: una constante (desplazamiento), un término lineal (:math:`c^{T}x`), y un término cuadrático (:math:`x^{T}Qx`).
id_id: Untuk program-program kuadrat, terdapat 3 bagian yang harus ditentukan: sebuah konstanta (offset), sebuah term linear (:math:` c ^{T}x `), dan sebuah term kuadrat (:math:` x ^{T}Qx `).
ko_kr: 이차 계획법 문제에서는 다음의 3가지 요소가 명시되어야 한다: 상수 항 (offset), 선형 항(:math:`c^{T}x`), 이차 항(:math:`x^{T}Qx`).
ta_in: Quadratic நிரல்களுக்கு, 3 துண்டுகள் குறிப்பிடப்பட்டிருக்க வேண்டும்: ஒரு நிலையான (ஆஃப்செய்ட்), ஒரு நேர்நிரல் (:math:` c ^{T}x `), மற்றும் ஒரு quadratic term (:math:` x ^{T}Qx `).

source: The cell below shows how to declare an objective function using a dictionary. For the linear term, keys in the dictionary correspond to variable names, and the corresponding values are the coefficients. For the quadratic term, keys in the dictionary correspond to the two variables being multiplied, and the values are again the coefficients.
es_un: La siguiente celda muestra cómo declarar una función objetivo utilizando un diccionario. Para el término lineal, las claves en el diccionario corresponden a nombres de variables, y los valores correspondientes son los coeficientes. Para el término cuadrático, las claves en el diccionario corresponden a las dos variables que se están multiplicando, y los valores son de nuevo los coeficientes.
id_id: Sel di bawah ini menunjukkan bagaimana cara deklarasi fungsi objektif menggunakan dictionary. Untuk term linear, key dalam dictionary adalah nama variabel, dan nilainya adalah koefisien. Untuk term kuadrat, key dalam dictionary adalah dua variabel yang dikalikan, dan nilainya juga adalah koefisien.
ko_kr: 아래의 셀 (cell) 은 딕셔너리 자료형을 사용하여 목적함수를 선언하는 방법을 보여준다. 선형 항의 경우, 자료형의 키 (key) 는 변수 이름에 대응되며 자료형의 값 (value) 은 계수에 대응된다. 이차 항의 경우, 키는 곱한 두 변수를 나타내며, 마찬가지로 값은 계수에 대응된다.
ta_in: கீழே செல் ஒரு அகராதியை பயன்படுத்தி ஒரு உதாரண செயல்கூறு அறிவிக்க எப்படி காட்டுகிறது. நேர்மையான தரம், விசைகளில் விசைகள் மாறிகளின் பெயர்களுக்கு, மற்றும் ஒத்திசைவு மதிப்புகளுக்கான மதிப்பீடுகள். கடுமையான தரம், விசைகளில் விசைகள் இரண்டு மாதிரிகளை மடங்குவதால், மதிப்புகள் மீண்டும் coefficients.

source: Another way to specify the quadratic program is using arrays. For the linear term, the array corresponds to the vector :math:`c` in the mathematical formulation. For the quadratic term, the array corresponds to the matrix :math:`Q`. Note that the ordering of the variables (:math:`x` in the mathematical formulation) is the order in which the variables were originally declared in the QuadraticProgram object.
es_un: Otra forma de especificar el programa cuadrático es usando arreglos. Para el término lineal, el arreglo corresponde al vector :math:`c` en la formulación matemática. Para el término cuadrático, el arreglo corresponde a la matriz :math:`Q`. Ten en cuenta que el orden de las variables (:math:`x` en la formulación matemática) es el orden en el que las variables fueron declaradas originalmente en el objeto QuadraticProgram.
id_id: Cara lain untuk menentukan program kuadrat adalah dengan menggunakan array. Untuk term linear, array sesuai dengan vektor :math:` c ` dalam formulasi matematika. Untuk term kuadrat, array sesuai dengan matriks :math:` Q `. Perlu dicatat bahwa urutan variabel (:math:` x ` dalam formulasi matematika) adalah urutan di mana variabel-variabel awalnya dinyatakan dalam objek QuadraticProgram.
ko_kr: 이와 더불어, 배열을 사용하여 이차 계획법 문제를 지정하는 방법도 있다. 선형 항의 경우, 배열은 앞서 수학 식의 벡터 :math:`c`에 해당한다. 이차 항의 경우, 배열은 행렬 :math:`Q`에 해당한다. 변수 (수학 식의 :math:`x`) 의 순서는 QuadraticProgram 객체에 변수를 선언했던 순서와 동일함을 유의하시오.
ta_in: இருபடி நிரலைக் குறிப்பிடுவதற்கான மற்றொரு வழி வரிசைகளைப் பயன்படுத்துவதாகும். நேரியல் காலத்திற்கு, வரிசை திசையனுடன் ஒத்திருக்கிறது:math: கணித சூத்திரத்தில் `c`. இருபடி காலத்திற்கு, வரிசை அணி:math: `Q` உடன் ஒத்துள்ளது. மாறிகள் வரிசைப்படுத்துதல் (:math: `x` கணித சூத்திரத்தில்) என்பது மாறிகள் முதலில் குவாட்ராடிக் புரோகிராம் பொருளில் அறிவிக்கப்பட்ட வரிசையாகும்.
