Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/optimization/3_minimum_eigen_optimizer.po
Languages: es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, ta_in

source: Then, we use the ``MinimumEigensolver`` to create ``MinimumEigenOptimizer``.
es_un: Luego, usamos el ``MinimumEigensolver`` para crear ``MinimumEigenOptimizer``.
fr_fr: Ensuite, nous utilisons le ``MinimumEigensolver`` pour créer ``MinimumEigenOptimizer``.
id_id: Kemudian, gunakan `` MinimumEigensolver '' untuk membuat `` MinimumEigenOptimizer ''.
it_it: Quindi, usiamo il ``MinimumEigensolver`` per creare ``MinimumEigenOptimizer``.
ja_jp: 次に、``MinimumEigensolver`` を使用して ``MinimumEigenOptimizer`` を作成します。
ko_kr: 그런 다음 ``MinimumEigenOptimizer`` 를 생성하기 위하여 ``MinimumEigensolver`` 를 사용한다.
ta_in: பின்னர், நாங்கள் "MinumEigenOptimizer" ஐ உருவாக்க "MinimumEigensolver" ஐபயன்படுத்துகிறோம்.

source: We first use the ``MinimumEigenOptimizer`` based on the classical exact ``NumPyMinimumEigensolver`` to get the optimal benchmark solution for this small example.
es_un: Primero usamos el ``MinimumEigenOptimizer`` basado en el clásico exacto ``NumPyMinimumEigensolver`` para obtener la solución de referencia óptima para este pequeño ejemplo.
fr_fr: Nous utilisons d'abord le ``MinimumEigenOptimizer`` basé sur le ``NumPyMinimumEigensolver`` classique pour obtenir la solution de benchmark optimale pour ce petit exemple.
id_id: Pertama, gunakan ` ` MinimumEigenOptimizer ` ` berdasarkan nilai eksak klasik ` ` NumPyMinimumEigensolver ` ` ` untuk mendapatkan solusi patokan optimal di contoh kecil ini.
it_it: Per prima cosa usiamo il ``MinimumEigenOptimizer`` basato sul classico esatto ``NumPyMinimumEigensolver`` per ottenere la soluzione di riferimento ottimale per questo piccolo esempio.
ja_jp: 最初に、古典的で厳密な``NumPyMinimumEigensolver`` に基づいた ``MinimumEigenOptimizer`` を使用して、この小さな例に対してベンチマークとなる最適解を求めます。
ta_in: இந்த சிறிய உதாரணத்திற்கான உகந்த அளவுகோலைப் பெற, நாம் முதலில் "MinimumEigenOptimizer" ஐ ப் பயன்படுத்துகிறோம்.

source: Next we apply the ``MinimumEigenOptimizer`` based on ``QAOA`` to the same problem.
es_un: A continuación aplicamos el ``MinimumEigenOptimizer`` basado en ``QAOA`` para el mismo problema.
fr_fr: Ensuite, nous appliquons le ``MinimumEigenOptimizer`` basé sur ``QAOA`` au même problème.
id_id: Selanjutnya, aplikasikan ``MinimumEigenOptimizer`` yang berdasarkan ``QAOA`` ke masalah yang sama.
it_it: Successivamente applichiamo lo ``MinimumEigenOptimizer`` basato su ``QAOA`` allo stesso problema.
ja_jp: 次に、同じ問題に対して、``QAOA`` に基づいた ``MinimumEigenOptimizer`` を適用します。
ta_in: அடுத்து, அதே சிக்கலுக்கு 'QAOA' அடிப்படையில் 'MinimumEigenOptimizer' ஐ ப்பயன்படுத்துகிறோம்.

source: RecursiveMinimumEigenOptimizer
ta_in: திரும்ப திரும்ப குறைந்தபட்ச ஈகன் ஆப்டிமைசர்

source: The ``RecursiveMinimumEigenOptimizer`` takes a ``MinimumEigenOptimizer`` as input and applies the recursive optimization scheme to reduce the size of the problem one variable at a time. Once the size of the generated intermediate problem is below a given threshold (``min_num_vars``), the ``RecursiveMinimumEigenOptimizer`` uses another solver (``min_num_vars_optimizer``), e.g., an exact classical solver such as CPLEX or the ``MinimumEigenOptimizer`` based on the ``NumPyMinimumEigensolver``.
es_un: El ``RecursiveMinimumEigenOptimizer`` toma un ``MinimumEigenOptimizer`` como entrada y aplica el esquema de optimización recursiva para reducir el tamaño del problema una variable a la vez. Una vez que el tamaño del problema intermedio generado está por debajo de un umbral dado (``min_num_vars``), el ``RecursiveMinimumEigenOptimizer`` usa otro solucionador (``min_num_vars_optimizer``), ej., un solucionador clásico exacto como CPLEX o el ``MinimumEigenOptimizer`` basado en el ``NumPyMinimumEigensolver``.
fr_fr: Le ``RecursiveMinimumEigenOptimizer`` prend un ``MinimumEigenOptimizer`` en entrée et applique le schéma d'optimisation récursive pour réduire la taille du problème une variable à la fois. Une fois que la taille du problème intermédiaire généré est inférieure à un seuil donné (``min_num_vars``), le ``RecursiveMinimumEigenOptimizer`` utilise un autre solveur (``min_num_vars_optimizer``) par exemple un solveur classique tel que CPLEX ou le ``MinimumEigenOptimizer`` basé sur le ``NumPyMinimumEigensolver``.
id_id: ``RecursiveMinimumEigenOptimizer`` memanfaatkan `` MinimumEigenOptimizer '' sebagai input dan menerapkan skema optimisasi rekursif untuk mengurangi ukuran masalah satu variabel setiap waktu. Setelah ukuran masalah perantara yang dihasilkan berada di bawah ambang yang diberikan (`` min_num_vars``), `` RecursiveMinimumEigenOptimizer`` menggunakan pemecah lain (``min_num_vars_optimizer``), misalnya, pemecah klasik eksak seperti CPLEX atau ``MinimumEigenOptimizer`` berdasarkan `` NumPyMinimumEigensolver``.
it_it: La ` ` RecursiveMinimumEigenOptimizer ` ` assume un ` ` MinimumEigenOptimizer ` ` come input e applica lo schema di ottimizzazione ricorsiva per ridurre la dimensione del problema una variabile alla volta. Una volta che la dimensione del problema intermedio generato è al di sotto di una determinata soglia (` ` min_num_vars ` `), la ` ` RecursiveMinimumEigenOptimizer ` ` utilizza un altro solutore (` ` min_num_vars_optimizer ` `), ad esempio, un solutore classico esatto come CPLEX o il ` ` MinimumEigenOptimizer ` ` basato sul ` ` NumPyMinimumEigensolver ` `.
ja_jp: ``RecursiveMinimumEigenOptimizer`` は入力として ``MinimumEigenOptimizer`` を取り、再帰的な最適化スキームを適用して、問題のサイズを1変数ずつ小さくしていきます。 生成された中間問題のサイズが与えられたしきい値 (``min_num_vars``) を下回ると、``RecursiveMinimumEigenOptimizer`` は別のソルバー(``min_num_vars_optimizer``)、例えば、CPLEX、あるいは ``NumPyMinimumEigensolver`` に基づいた ``MinimumEigenOptimizer`` のような、厳密な古典的ソルバーを使用します。
ta_in: "RecursiveMinimumEigenOptimizer" ஒரு "MinimumEigenOptimizer" ஐ உள்ளீட்டாக எடுத்துக்கொள்கிறது மற்றும் ஒரு நேரத்தில் ஒரு மாறி யின் அளவை குறைக்க மீண்டும் வரும் தேர்வுமுறை திட்டத்தை ப்பயன்படுத்துகிறது. உருவாக்கப்பட்ட இடைப்பட்ட சிக்கலின் அளவு ஒரு குறிப்பிட்ட நுழைவாயிலுக்கு கீழே இருந்தால் ("min_num_vars"), "RecursiveMinimumEigenOptimizer" மற்றொரு தீர்வைப் ("min_num_vars_optimizer"), உதாரணமாக, CPLEX அல்லது "NumPyMinimumEigensolver" அடிப்படையில் "MinimumEigenOptimizer" போன்ற சரியான கிளாசிக்கல் தீர்வுகளைப் பயன்படுத்துகிறது.

source: In the following, we show how to use the ``RecursiveMinimumEigenOptimizer`` using the two ``MinimumEigenOptimizer`` introduced before.
es_un: A continuación, se muestra cómo utilizar el ``RecursiveMinimumEigenOptimizer`` utilizando los dos ``MinimumEigenOptimizer`` presentados antes.
fr_fr: Dans ce qui suit, nous montrons comment utiliser le ``RecursiveMinimumEigenOptimizer`` en utilisant les deux ``MinimumEigenOptimizer`` introduits avant.
id_id: Berikut ditunjukkan cara penggunaan ``RecursiveMinimumEigenOptimizer`` melalui dua ``MinimumEigenOptimizer`` yang telah diperkenalkan sebelumnya.
it_it: Qui di seguito mostriamo come usare il ``RecursiveMinimumEigenOptimizer`` usando i due ``MinimumEigenOptimizer`` introdotti prima.
ja_jp: 以下では、以前に導入した 2 つの ``MinimumEigenOptimizer`` を使用して ``RecursiveMinimumEigenOptimizer`` を使用する方法を示します。
ta_in: பின்வருவனவற்றில், முன்னர் அறிமுகப்படுத்தப்பட்ட இரண்டு "MinimumEigenOptimizer" ஐப் பயன்படுத்தி "RecursiveMinimumEigenOptimizer" ஐ எவ்வாறு பயன்படுத்துவது என்பதை நாங்கள் காட்டுகிறோம்.

source: First, we construct the ``RecursiveMinimumEigenOptimizer`` such that it reduces the problem size from 3 variables to 1 variable and then uses the exact solver for the last variable. Then we call ``solve`` to optimize the considered problem.
es_un: En primer lugar, construimos el ``RecursiveMinimumEigenOptimizer`` tal que reduce el tamaño del problema de 3 variables a 1 variable y luego utiliza el solucionador exacto para la última variable. Entonces llamamos ``solve`` para optimizar el problema considerado.
fr_fr: Tout d'abord, nous construisons le ``RecursiveMinimumEigenOptimizer`` de telle sorte qu'il réduit la taille du problème de 3 variables à 1 variable et utilise ensuite le solveur exact pour la dernière variable. Puis nous appelons ``solve`` pour optimiser le problème considéré.
id_id: Pertama, kita buat ``RecursiveMinimumEigenOptimizer`` sehingga mengurangi ukuran masalah dari 3 variabel ke 1 variabel dan kemudian menggunakan solver eksak untuk variabel terakhir. Lalu kita panggil ``solve`` untuk mengoptimisasi masalah tersebut.
it_it: In primo luogo, costruiamo il ` ` RecursiveMinimumEigenOptimizer ` ` tale che riduce la dimensione del problema da 3 variabili a 1 variabile e quindi utilizza il solutore esatto per l'ultima variabile. Poi chiamiamo ` ` risolto ` ` per ottimizzare il problema considerato.
ja_jp: 最初に ``RecursiveMinimumEigenOptimizer`` を構築し、問題サイズを3つの変数から1つの変数に縮小し、最後の変数に正確なソルバーを使用します。 次に、検討された問題を最適化するために ``solve`` を呼び出します。
ta_in: முதலில், நாம் "RecursiveMinimumEigenOptimizer" கட்டமைக்கவேண்டும், இது சிக்கல் அளவை 3 மாறிகளிலிருந்து 1 மாறிக்கு குறைக்கிறது, பின்னர் கடைசி மாறிக்கான சரியான தீர்வைபயன்படுத்துகிறது. பின்னர் நாம் கருத்தில் பிரச்சனை மேம்படுத்த 'solve' அழைக்க.

source: [1] `A. Lucas, Ising formulations of many NP problems, Front. Phys., 12 (2014). <https://arxiv.org/abs/1302.5843>`__
it_it: [1] ` A. Lucas, Le formulazioni Ising di molti problemi NP, Fronte. Phys., 12 (2014). <https://arxiv.org/abs/1302.5843>` __
