Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/optimization/3_minimum_eigen_optimizer.po
Languages: es_un, fr_fr, id_id, it_it, ja_jp, ko_kr, ta_in

source: This page was generated from `tutorials/optimization/3_minimum_eigen_optimizer.ipynb`__.
es_un: Esta página ha sido generada a partir de `tutorials/optimization/3_minimum_eigen_optimizer.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/optimization/3_minimum_eigen_optimizer.ipynb`__.
id_id: Halaman ini dihasilkan dari ` tutorials/optimization/3_minimum_eigen_optimizer.ipynb ` __.
it_it: Questa pagina è stata generata da `tutorials/optimization/3_minimum_eigen_optimizer.ipynb`__.
ja_jp: このページは `tutorials/optimization/3_minimum_eigen_optimizer.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/optimization/3_minimum_eigen_optimizer.ipynb`__ 에서 생성되었다.
ta_in: இந்த பக்கம் 'tutorials/optimization/3_minimum_eigen_optimizer.ipynb' இருந்து உருவாக்கப்பட்டது__.பயிற்சிகள்பயிற்சிகள்.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/3_minimum_eigen_optimizer.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/noise/5_quantum_volume.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le ` IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/3_minimum_eigen_optimizer.ipynb>` _.
id_id: Jalankan secara interaktif dalam ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/3_minimum_eigen_optimizer.ipynb>` _.
it_it: Esegui interattivamente in `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/3_minimum_eigen_optimizer.ipynb>`_.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/3_minimum_eigen_optimizer.ipynb>`_ でインタラクティブに実行します。
ko_kr: `IBM 퀀텀 랩 <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/3_minimum_eigen_optimizer.ipynb>`_ 에서 대화식으로 실행하시오.
ta_in: 'IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/3_minimum_eigen_optimizer.ipynb>'_இல் ஊடாடும் இயக்கவும்.

source: Minimum Eigen Optimizer
es_un: Optimizador Eigen Mínimo
fr_fr: Optimiseur de Valeure Propre Minimale
id_id: Pengoptimal Eigen Minimum
ja_jp: 最小固有値オプティマイザー (Minimum Eigen Optimizer)
ta_in: குறைந்தபட்ச ஈகன் ஆப்டிமைசர்

source: Introduction
es_un: Introducción
id_id: Pengantar
it_it: Introduzione
ja_jp: はじめに
ko_kr: 소개
ta_in: முன்னுரை

source: An interesting class of optimization problems to be addressed by quantum computing are Quadratic Unconstrained Binary Optimization (QUBO) problems. Finding the solution to a QUBO is equivalent to finding the ground state of a corresponding Ising Hamiltonian, which is an important problem not only in optimization, but also in quantum chemistry and physics. For this translation, the binary variables taking values in :math:`\{0, 1\}` are replaced by spin variables taking values in :math:`\{-1, +1\}`, which allows to replace the resulting spin variables by Pauli Z matrices, and thus, an Ising Hamiltonian. For more details on this mapping we refer to [1].
fr_fr: Une classe intéressante de problèmes d'optimisation à résoudre par le calcul quantique est "Quadratic Unconstrained Binary Optimization" (QUBO). Trouver la solution à un QUBO équivaut à trouver l'état fondamental d'un hamiltonien Ising, qui est un problème important non seulement dans l'optimisation, mais aussi dans la chimie quantique et la physique des matériaux. Pour cette transposition, les variables binaires qui prennent des valeurs dans :math:`\{0, 1\}` sont remplacées par des variables "spin" prenant des valeurs dans :math:`\{-1, +1\}`, permettant ainsi de remplacer les variables spin résultantes par des matrices Pauli Z, et donc un Hamiltonien. Pour plus de détails sur cette cartographie, nous nous référons à [1].
it_it: Una classe interessante di problemi di ottimizzazione da affrontare per quanto riguarda il quantum computing sono i problemi di Quadratic Unvincolained Binary Optimization (QUBO). Trovare la soluzione a un QUBO equivale a trovare lo stato fondamentale di una corrispondente Hamiltoniana di Ising, un problema importante non solo nell'ottimizzazione, ma anche nella chimica quantistica e nella fisica. Per questa traduzione, le variabili binarie che assumono valori in :math:` \ {0, 1 \} ` sono sostituite da variabili di spin che assumono valori in :math:` \ {-1, + 1\} `, che consente di sostituire le variabili di spin risultante da quelle di Pauli Z, e quindi, un Hamiltoniano di Ising. Per maggiori dettagli su questa mappatura si può far riferimento a [1].
ko_kr: 양자 컴퓨팅에서 다루어지는 흥미로운 최적화 문제들 중 이차 비한정 이진 최적화 (Quadratic Unconstrained Binary Optimization; QUBO)라는 문제가 있다. QUBO에 대한 솔루션을 찾는 것은 이에 대응하는 이싱 해밀토니안(Ising Hamiltonian)의 기저 상태(ground state)를 찾는 것과 동일한 문제로 취급될 수 있는데, 이는 최적화에서 뿐만 아니라 양자 화학과 물리학에서도 중요하게 여겨진다. 이러한 변환에 대하여, :math:`\{0, 1\}` 값을 취하는 바이너리형 변수들은 :math:`\{-1, +1\}` 값을 취하는 스핀 변수(spin variable)들에 의하여 대체되며, 이는 결과적으로 스핀 변수들을 Pauli Z 행렬들에 의해 대체될 수 있게 하며, 따라서 Ising Hamiltonian로 대체된다. 매핑에 대한 자세한 사항은 [1]을 참조하라.
ta_in: குவாண்டம் கம்ப்யூட்டிங் மூலம் தீர்க்கப்பட வேண்டிய தேர்வுமுறை சிக்கல்களின் ஒரு சுவாரஸ்யமான வர்க்கம் குவாட்ராடிக் கட்டுப்பாடற்ற பைனரி ஆப்டிமைசேஷன் (QUBO) சிக்கல்கள். ஒரு QUBO க்கான தீர்வைக் கண்டறிவது தொடர்புடைய ஐசிங் ஹாமில்டோனியனின் நில நிலையைக் கண்டுபிடிப்பதற்கு சமம், இது தேர்வுமுறைக்கு மட்டுமல்ல, குவாண்டம் வேதியியல் மற்றும் இயற்பியலிலும் ஒரு முக்கியமான பிரச்சினையாகும். இந்த மொழிபெயர்ப்பிற்கு, மதிப்புகளை எடுக்கும் பைனரி மாறிகள்:math: `\ {0, 1 \}` இதில் மதிப்புகளை எடுக்கும் சுழல் மாறிகள் மாற்றப்படுகின்றன:math: `\ {- 1, +1 \}`, இது மாற்ற அனுமதிக்கிறது இதன் விளைவாக பவுலி இசட் மெட்ரிக்ஸின் சுழல் மாறிகள், இதனால், ஒரு ஐசிங் ஹாமில்டோனியன். இந்த மேப்பிங் குறித்த கூடுதல் விவரங்களுக்கு [1] ஐக் குறிப்பிடுகிறோம்.

source: Qiskit provides automatic conversion from a suitable ``QuadraticProgram`` to an Ising Hamiltonian, which then allows to leverage all the ``MinimumEigenSolver`` such as - ``VQE``, - ``QAOA``, or - ``NumpyMinimumEigensolver`` (classical exact method).
es_un: Qiskit provee conversión automática de ``QuadraticProgram`` a un Ising Hamiltoniano, que luego permite aprovechar todo el ``MinimumEigenSolver`` como - ``VQE``, - ``QAOA``, or - ``NumpyMinimumEigensolver`` (método clásico exacto).
fr_fr: Qiskit propose une conversion automatique de ``QuadraticProgram`` vers un hamiltonien d'Ising, qui permet ensuite de tirer parti de tous les ``MinimumEigenSolver`` tels que ``VQE``, -``QAOA``, ou -``NumpyMinimumEigensolver`` (qui est la méthode classique exacte).
id_id: Qiskit menyediakan konversi otomatis dari ` ` QuadraticProgram ` ` yang sesuai ` ke Hamiltonian Ising, yang kemudian memungkinkan untuk memanfaatkan semua ` ` MinimumEigenSolver ` ` seperti-` ` ` VQE ` `,-` ` QAOA ` `, atau-` ` NumpyMinimumEigensolver ` ` (metode eksak klasik).
it_it: Qiskit fornisce la conversione automatica da un idoneo ` ` Problema Quadratico ` ` ad una Hamiltoniana di Ising, che permette di far leva su tutti i ` ` MinimumEigenSolver ` ` quali - ` ` VQE ` `, - ` ` QAOA ` `, oppure - ` ` NumpyMinimumEigensolver ` ` (metodo esatto classico).
ja_jp: Qiskitは、適切な ``QuadraticProgram`` からイジング・ハミルトニアンへの自動変換を提供します。これにより、- ``VQE`` 、- ``QAOA`` 、または- ``NumpyMinimumEigensolver`` （クラシカルな厳密法）などのすべての ``MinimumEigenSolver`` を活用できます。
ko_kr: 키스킷은 ``QuadraticProgram`` 에서 이싱 해밀토니안으로의 적절한 자동 변환을 제공한다. 이로서 - ``VQE``, - ``QAOA``, 혹은 - ``NumpyMinimumEigensolver`` (classical exact method) 와 같은 모든 ``MinimumEigenSolver`` 들을 활용할 수 있다.
ta_in: Qiskit ஒரு பொருத்தமான "QuadraticProgram" இருந்து ஒரு இசிங் Hamiltonian, தானியங்கி மாற்றம் வழங்குகிறது, இது பின்னர் போன்ற அனைத்து "MinimumEigenSolver" - "VQE", - "QAOA", அல்லது - "NumpyMinimumEigensolver`" (கிளாசிக்கல் சரியான முறை) பயன்படுத்த அனுமதிக்கிறது.

source: Qiskit wraps the translation to an Ising Hamiltonian (in Qiskit Aqua also called ``Operator``), the call to an ``MinimumEigensolver`` as well as the translation of the results back to ``OptimizationResult`` in the ``MinimumEigenOptimizer``.
es_un: Qiskit envuelve la traducción a un Ising Hamiltoniano (en Qiskit Aqua también llamado ``Operator``), la llamada a un ``MinimumEigensolver``, así como la traducción de los resultados a un ``OptimizationResult`` en el ``MinimumEigenOptimizer``.
fr_fr: Qiskit fournit la traduction vers un Hamiltonien Ising (dans Qiskit Aqua également appelé ` ` Operator ` `), l'appel à un ` ` MinimumEigensolver ` ` ainsi que la traduction des résultats vers ` ` OptimizationResult ` ` dans ` ` MinimumEigenOptimizer ` `.
id_id: Qiskit membungkus terjemahan ke sebuah Hamiltonian Ising (dalam Qiskit Aqua juga disebut sebagai ` ` Operator ` `), panggilan ke ` ` MinimumEigensolver ` ` serta terjemahan hasilnya kembali ke ` ` OptimizationResult ` ` di ` ` ` MinimumEigenOptimizer ` `.
it_it: Qiskit include la traslazione ad una Hamiltoniana di Ising (in Qiskit Aqua anche denominato ``Operator``), la chiamata a un ``MinimumEigensolver`` nonché la traduzione dei risultati a ``OptimizationResult`` in ``MinimumEigenOptimizer``.
ja_jp: Qiskitは、イジング・ハミルトニアン (Qiskit Aquaでは ``Operator`` とも呼ばれます) への翻訳、すなわち ``MinimumEigensolver`` への呼び出しと、結果の翻訳とを、ラップして ``MinimumEigenOptimizer`` の ``OptimizationResult`` に戻します。
ko_kr: 키스킷은 Ising Hamiltonian (키스킷 아쿠아에서는 ``Operator`` 라고도 함) 으로 변환을 래핑(wrapping) 하고 ``MinimumEigensolver`` 에 대한 호출은 물론 ``MinimumEigenOptimizer`` 에서 결과를 다시 ``OptimizationResult`` 로 변환한다.
ta_in: Qiskit ஒரு Ising Hamiltonian (மேலும் "Operator" என்று Qiskit அக்வா வில்), ஒரு "MinimumEigensolver" அழைப்பு அத்துடன் முடிவுகளை மொழிபெயர்ப்பு மீண்டும் "OptimizationResult" உள்ள "MinimumEigenOptimizer" இல்.

source: In the following we first illustrate the conversion from a ``QuadraticProgram`` to an ``Operator`` and then show how to use the ``MinimumEigenOptimizer`` with different ``MinimumEigensolver`` to solve a given ``QuadraticProgram``. The algorithms in Qiskit automatically try to convert a given problem to the supported problem class if possible, for instance, the ``MinimumEigenOptimizer`` will automatically translate integer variables to binary variables or add a linear equality constraints as a quadratic penalty term to the objective. It should be mentioned that Aqua will through a ``QiskitOptimizationError`` if conversion of a quadratic program with integer variable is attempted.
es_un: En lo siguiente, primero ilustramos la conversión de un ``QuadraticProgram`` a un ``Operador`` y luego mostramos cómo usar el ``MinimumEigenOptimizer`` con ``MinimumEigensolver`` para resolver un ``QuadraticProgram`` dado. Los algoritmos en Qiskit automáticamente intentan convertir un problema determinado a la clase de problema soportada, si es posible, por ejemplo, el ``MinimumEigenOptimizer`` traducirá automáticamente variables enteras a variables binarias o añadirá una restricción lineal de igualdad como un término de penalización cuadrática al objetivo. Se debe mencionar que Aqua arrojara un ``QiskitOptimizationError`` si se intenta la conversión de un programa cuadrático con variable entera.
fr_fr: Dans ce qui suit, nous illustrons d'abord la conversion d'un ``QuadraticProgram`` à un ``Operator``, puis montrons comment utiliser ``MinimumEigenOptimizer`` avec le ``MinimumEigensolver`` pour résoudre un ``QuadraticProgram`` donné. Les algorithmes de Qiskit tentent automatiquement de convertir un problème donné en classe d'incident prise en charge si possible, par exemple, le ``MinimumEigenOptimizer`` traduira automatiquement les variables entières en variables binaires ou ajoutera une contrainte d'égalité linéaire en tant que terme de pénalité quadratique à l'objectif. Il convient de mentionner que Aqua va passer par une erreur ``QiskitOptimizationError`` si la conversion d'un programme quadratique avec une variable entière est tentée.
id_id: Berikut ini pertama-tama diilustrasikan konversi dari `` QuadraticProgram '' menjadi `` Operator '' dan kemudian menunjukkan bagaimana menggunakan `` MinimumEigenOptimizer '' dengan `` MinimumEigensolver '' yang berbeda untuk menyelesaikan `` QuadraticProgram '' yang ada. Algoritma di Qiskit secara otomatis mencoba mengonversi masalah yang diberikan ke kelas masalah yang didukung jika memungkinkan, misalnya, `` MinimumEigenOptimizer '' akan secara otomatis menerjemahkan variabel bilangan bulat ke variabel biner atau menambahkan batasan persamaan linier sebagai syarat penalti kuadrat ke objektif. Harus disebutkan bahwa Aqua akan melalui `` QiskitOptimizationError '' jika konversi program kuadrat dengan variabel bilangan bulan dicoba.
it_it: In quanto segue illustriamo per la prima volta la conversione da un ` ` QuadraticProgram ` ` ad un ` Operatore ` ` e poi mostrare come usare il ` ` MinimumEigenOptimizer ` ` con ` diverso ` ` MinimumEigensolver ` ` per risolvere un dato ` ` QuadraticProgram ` `. Gli algoritmi in Qiskit tentano automaticamente di convertire un determinato problema nella classe dei problemi supportati se possibile, ad esempio, il ` ` MinimumEigenOptimizer ` ` tradurrà automaticamente variabili intere a variabili binarie o aggiungerà un vincolo di uguaglianza lineare come termine di penalità quadratica all'obiettivo. Va ricordato che Aqua attraverserà un ` ` QiskitOptimizationError ` ` se si tenta la conversione di un programma quadratico con variabile intera.
ja_jp: 以下では、まず、``QuadraticProgram`` から ``Operator`` への変換を示します。次に、与えられた ``QuadraticProgram`` を解くのに、``MinimumEigenOptimizer`` を異なる ``MinimumEigensolver`` にどう使うのかを示します。Qiskitのアルゴリズムは、与えられた問題を、可能であればサポートされている問題クラスに自動的に変換しようとします。例えば、``MinimumEigenOptimizer`` は整数変数をバイナリー変数に自動的に変換したり、線形等価制約を2次ペナルティ項として目的関数に追加したりします。整数変数を持つ二次計画問題を変換しようとすると、Aqua は ``QiskitOptimizationError`` を投げることに注意してください。
ko_kr: 다음에서는 먼저 ``QuadraticProgram`` 에서 ``Operator`` 로의 변환을 설명하고 ``MinimumEigenOptimizer`` 를 이와 유사하지만 다른 ``MinimumEigensolver`` 와 함께 사용하여 주어진 ``QuadraticProgram`` 을 해결하는 방법을 보일 것이다. 키스킷의 알고리즘은 가능한 경우 주어진 문제를 지원되는 지원되는 문제의 클래스로 자동 변환하려고 시도한다. 예를 들어, ``MinimumEigenOptimizer`` 는 정수형 변수를 바이너리형 변수로 자동 변환하거나 목적함수에 대한 2차식 패널티 항으로서 선형 등식 제약조건을 추가한다. 아쿠아는 이차계획법 문제의 정수형 변수에 대한 변환이 시도될 경우 ``QiskitOptimizationError`` 를 통해 언급할 것이다.
ta_in: பின்வருபவற்றில் நாம் முதலில் ஒரு "QuadraticProgram" இலிருந்து ஒரு "Operator" க்கு மாற்றத்தை விளக்குகிறோம், பின்னர் கொடுக்கப்பட்ட "QuadraticProgram" ஐ தீர்க்க வெவ்வேறு "MinimumEigensolver" உடன் "MinimumEigenOptimizer" ஐ எவ்வாறு பயன்படுத்துவது என்பதை விளக்குகிறோம். Qiskit உள்ள வழிமுறைகள் தானாகவே ஒரு கொடுக்கப்பட்ட பிரச்சனை யை ஆதரிக்கப்படும் சிக்கல் வர்க்கத்திற்கு மாற்ற முயற்சிக்கிறது, உதாரணமாக, "MinimumEigenOptimizer" தானாகவே முழு எண் மாறிகளை பைனரி மாறிகளுக்கு மொழிபெயர்க்கும் அல்லது ஒரு நேரியல் சமத்துவ கட்டுப்பாடுகளை இலக்கிற்கு ஒரு இருபடி தண்டனையாக சேர்க்கும். முழு எண் மாறிகொண்ட ஒரு இருபடி நிரலை மாற்ற முயற்சித்தால், "`QiskitOptimizationError" மூலம் அக்வா ஒரு "`QiskitOptimizationError" மூலம் வரும் என்பதை குறிப்பிட வேண்டும்.

source: The circuit depth of ``QAOA`` potentially has to be increased with the problem size, which might be prohibitive for near-term quantum devices. A possible workaround is Recursive QAOA, as introduced in [2]. Qiskit generalizes this concept to the ``RecursiveMinimumEigenOptimizer``, which is introduced at the end of this tutorial.
es_un: La profundidad del circuito de ``QAOA`` podría ser incrementada con el tamaño del problema, lo que podría ser prohibitivo para los dispositivos cuánticos a corto plazo. Un posible método alternativo es el QAOA recursivo, como se introduce en la referencia [2]. Qiskit generaliza este concepto a ``RecursiveMinimumEigenOptimizer``, que se introduce al final de este tutorial.
fr_fr: La profondeur du circuit ``QAOA`` pourrait augmenter avec la taille du problème, ce qui pourrait être prohibitif à court terme pour les ordinateurs quantiques. Une solution possible est la QAOA récursive, telle qu'elle a été introduite dans le [2]. Qiskit généralise ce concept à ``RecursiveMinimumEigenOptimizer``, qui est introduit à la fin de ce tutoriel.
id_id: Kedalaman sirkuit `` QAOA '' harus ditingkatkan seiring dengan ukuran masalah, yang mungkin menjadi penghalang untuk perangkat kuantum jangka pendek. Solusi yang mungkin adalah QAOA Rekursif, seperti yang diperkenalkan di [2]. Qiskit menggeneralisasi konsep ini ke `` RecursiveMinimumEigenOptimizer``, yang diperkenalkan di akhir tutorial ini.
it_it: La profondità di circuito di ` ` QAOA ` ` potenzialmente deve essere aumentata con la dimensione del problema, che potrebbe essere proibitiva per i dispositivi quantistici a breve termine. Un possibile workaround è Recursive QAOA, come introdotto nel [2]. Qiskit generalizza questo concetto a ` ` RecursiveMinimumEigenOptimizer ` `, introdotto alla fine di questo tutorial.
ja_jp: ``QAOA`` の回路の深さは、問題の大きさに応じて必然的に増加する可能性があり、これは近未来の量子デバイスにとっては障害となる可能性があります。考えられる回避策として、 [2] で紹介されている再帰QAOAがあります。このチュートリアルの最後で紹介しますが、Qiskit はこの概念を`RecursiveMinimumEigenOptimizer` に一般化しています。
ko_kr: ``QAOA`` 의 회로 깊이(depth) 는 잠재적으로 문제의 크기와 함께 증가해야 하는데, 이는 현재의 양자 디바이스(near-term quantum devices) 에서는 (회로 비용을) 감당할 수 없을지도 모른다. 가능한 해결 방법은 [2] 에 소개된 Recursive QAOA이다. 키스킷은 본 사용 지침서의 마지막 부분에 소개된 ``RecursiveMinimumEigenOptimizer`` 에서 이 개념을 다루었다.
ta_in: "QAOA" இன் சுற்று ஆழம் சாத்தியமான சிக்கல் அளவு டன் அதிகரிக்கப்பட வேண்டும், இது கிட்டத்தட்ட கால குவாண்டம் சாதனங்களுக்கு தடை செய்யப்படலாம். ஒரு சாத்தியமான பணிச்சுற்று திரும்ப திரும்ப QAOA ஆகும், இது [2] இல் அறிமுகப்படுத்தப்பட்டது. இந்த கருத்தை Qiskit பொதுமைப்படுத்துகிறது "RecursiveMinimumEigenOptimizer", இது இந்த டபயிற்சிகள் முடிவில் அறிமுகப்படுத்தப்படுகிறது.

source: References
es_un: Referencias
fr_fr: Références
id_id: Daftar pustaka
it_it: Riferimenti
ja_jp: 参考文献
ko_kr: 참조
ta_in: குறிப்பு

source: Converting a QUBO to an Operator
es_un: Conversión de un QUBO a un operador
fr_fr: Conversion d'un QUBO en opérateur
id_id: Mengubah suatu QUBO ke sebuah Operator
it_it: Conversione di un QUBO ad un Operatore
ja_jp: QUBOをオペレーターに変換する
ko_kr: QUBO를 Operator로 변환하기
ta_in: ஒரு QUBO ஐ ஒரு ஆபரேட்டராக மாற்றுதல்

source: Next we translate this QUBO into an Ising operator. This results not only in an ``Operator`` but also in a constant offset to be taking into account to shift the resulting value.
es_un: A continuación traducimos este QUBO en un operador de Ising. Esto no sólo resulta en un ``Operator`` sino también en una compensación constante a tener en cuenta para desplazar el valor resultante.
fr_fr: Ensuite, nous traduisons ce QUBO en un opérateur Ising. Le résultat consiste non seulement dans un ``Operator`` mais aussi dans un décalage constant à prendre en compte pour recaler la valeur résultante.
id_id: Selanjutnya kita terjemahkan QUBO ini menjadi operator Ising. Hasil ini tidak hanya berada pada ` ` Operator ` ` tetapi juga dalam offset konstan yang akan dilibatkan untuk menggeser nilai yang dihasilkan.
it_it: Successivamente traduciamo questo QUBO in un operatore di Ising. Questo risultato non solo in un ``Operator`` ma anche in un offset costante da prendere in considerazione per spostare il valore risultante.
ja_jp: 次に、このQUBOをIsingオペレータに翻訳します。 翻訳の結果は、``Operator`` だけではなく、結果の値をシフトするのに考慮すべき定数オフセットにもなります。
ko_kr: 다음으로 이 QUBO를 Ising operator로 변환한다. 변환 결과로 ``Operator`` 뿐만 아니라 결과 값을 이동(shift) 하기 위해 고려 해야할 상수 오프샛(offset) 이 발생한다.
ta_in: அடுத்து இந்த QUBO ஐ ஒரு ஐசிங் ஆபரேட்டராக மொழிபெயர்க்கிறோம். இது ஒரு 'Operator' இல் மட்டுமல்ல, விளைவாக மதிப்பை மாற்றுவதிற்கு கணக்கில் எடுத்துக்கொள்ளவேண்டிய ஒரு நிலையான ஈடுபாடை யும் ஏற்படுத்துகிறது.

source: Sometimes an ``QuadraticProgram`` might also directly be given in the form of an ``Operator``. For such cases, Qiskit also provides a converter from an ``Operator`` back to a ``QuadraticProgram``, which we illustrate in the following.
es_un: A veces, un ``QuadraticProgram`` también podría ser dado directamente en forma de ``Operator``. Para tales casos, Qiskit también provee un conversor de ``Operator`` de vuelta a un ``QuadraticProgram``, que ilustramos a continuación.
fr_fr: Parfois, un ``QuadraticProgram`` peut également être donné directement sous la forme d'un ``Operator``. Dans de tels cas, Qiskit fournit un convertisseur depuis un ``Operator`` vers un ``QuadraticProgram``, que nous illustrons dans ce qui suit.
id_id: Terkadang sebuah ` ` QuadraticProgram ` ` bisa secara langsung diberikan dalam bentuk ` ` Operator ` `. Untuk kasus seperti itu, Qiskit juga menyediakan konverter dari ` ` Operator ` ` kembali ke ` ` ` QuadraticProgram ` `, yang diilustrasikan berikut ini.
it_it: A volte un ``QuadraticProgram`` potrebbe anche essere dato direttamente sotto forma di ``Operatore``. In questi casi, Qiskit fornisce anche un convertitore da un ``Operator`` a un ``QuadraticProgram``, che illustriamo nel seguito.
ja_jp: ときには、``QuadraticProgram`` が ``Operator`` の形でも直接与えられる場合があります。 このような場合、Qiskit は ``Operator`` から ``QuadraticProgram`` に戻す変換機能を備えています。これについては以下で説明します。
ko_kr: 때때로 ``QuadraticProgram`` 은 ``Operator`` 의 형태로 직접 주어질 수도 있다. 이러한 경우를 위하여, 키스킷은 ``Operator`` 에서 다시 ``QuadraticProgram`` 으로 변환하는 converter를 제공한다.
ta_in: சில நேரங்களில் "குவாட்ரடிக் புரோக்ராம்" என்பது நேரடியாக "ஆபரேட்டர்" வடிவத்தில் வழங்கப்படலாம். அத்தகைய சந்தர்ப்பங்களில், Qiskit ஒரு "ஆபரேட்டர்" இருந்து ஒரு மாற்றி வழங்குகிறது "குவாட்ராடிக் ப்ரொக்ராம்", இது நாம் பின்வரும் விளக்க.

source: This converter allows, for instance, to translate an ``Operator`` to a ``QuadraticProgram`` and then solve the problem with other algorithms that are not based on the Ising Hamiltonian representation, such as the ``GroverOptimizer``.
es_un: Este conversor permite, por ejemplo, traducir un ``Operator`` a un ``QuadraticProgram`` y luego resolver el problema con otros algoritmos que no se basan en la representación de Ising Hamiltoniano, como ``GroverOptimizer``.
fr_fr: Ce convertisseur permet, par exemple de traduire un ``Operator`` en un ``QuadraticProgram`` puis de résoudre le problème avec d'autres algorithmes qui ne sont pas basés sur la représentation d'Ising Hamiltonien, comme le ``GroverOptimizer``.
id_id: Konverter ini memungkinkan, misalnya, untuk menerjemahkan sebuah `` Operator '' menjadi `` QuadraticProgram '' dan kemudian menyelesaikan masalah dengan algoritma lain yang tidak berdasarkan representasi Ising Hamiltonian, misalnya seperti `` GroverOptimizer ''.
it_it: Questo convertitore consente, ad esempio, per tradurre un ``Operator`` in ``QuadraticProgram`` e quindi risolvere il problema con altri algoritmi che non sono basati sulla rappresentazione di Ising Hamiltonian, come ``GroverOptimizer``.
ja_jp: このコンバーターにより、例えば、``Operator`` を ``QuadraticProgram`` に変換して、イジング・ハミルトニアン表現に基づいていない他のアルゴリズム（例えば ``GroverOptimizer`` ）で問題を解くことができます。
ta_in: இந்த மாற்றி உதாரணமாக, ஒரு "QuadraticProgram" க்கு ஒரு "Operator" ஐ மொழிபெயர்க்க அனுமதிக்கிறது, பின்னர் "GroverOptimizer" போன்ற ஐசிங் ஹாமில்டன் பிரதிநிதித்துவத்தின் அடிப்படையில் இல்லாத மற்ற வழிமுறைகளுடன் சிக்கலைத் தீர்க்க அனுமதிக்கிறது.

source: Solving a QUBO with the MinimumEigenOptimizer
es_un: Resolviendo un QUBO con MinimumEigenOptimizer
fr_fr: Résoudre un QUBO avec le MinimumEigenOptimizer
id_id: Memecahkan sebuah QUBO dengan MinimumEigenOptimizer
it_it: Risolvere un QUBO con MinimumEigenOptimizer
ko_kr: MinimumEigenOptimizer를 사용하여 QUBO를 해결하기
ta_in: குறைந்தபட்ச ஐகன் ஆப்டிமைசர் உடன் ஒரு QUBO ஐ த் தீர்த்தல்

source: We start by initializing the ``MinimumEigensolver`` we want to use.
es_un: Empezamos inicializando el ``MinimumEigensolver`` que queremos usar.
fr_fr: Nous commençons par initialiser le ``MinimumEigensolver`` que nous voulons utiliser.
id_id: Kita mulai dengan menginisialisasi ` ` MinimumEigensolver ` ` yang ingin digunakan.
it_it: Iniziamo inizializzando il ``MinimumEigensolver`` che vogliamo usare.
ja_jp: まず、使用する ``MinimumEigensolver`` を初期化します。
ko_kr: ``MinimumEigensolver`` 를 초기화하는 것으로 시작한다.
ta_in: நாம் பயன்படுத்த விரும்பும் "MinimumEigensolver" ஐ துவக்குவதன் மூலம் தொடங்குகிறோம்.
