Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/optimization/4_grover_optimizer.po
Languages: fr_fr, id_id, ta_in

source: This page was generated from `tutorials/optimization/4_grover_optimizer.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/optimization/4_grover_optimizer.ipynb`__.
id_id: Halaman ini dihasilkan dari ` tutorials/optimization/4_grover_optimizer.ipynb ` __.
ta_in: இந்த பக்கம் உருவாக்கப்பட்டது`tutorials/optimization/4_grover_optimizer.ipynb`__.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/4_grover_optimizer.ipynb>`_.
id_id: Jalankan secara interaktif dalam ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/4_grover_optimizer.ipynb>` _.
ta_in: 'IBM குவாண்டம் ஆய்வக <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/4_grover_optimizer.ipynb>`இல் ஊடாடும் இயக்கவும்.

source: Grover Optimizer
fr_fr: Optimiseur de Grover
id_id: Pengoptimal Grover
ta_in: க்ரோவர் ஆப்டிமைசர்

source: Introduction
id_id: Pengantar
ta_in: முன்னுரை

source: Grover Adaptive Search (GAS) has been explored as a possible solution for combinatorial optimization problems, alongside variational algorithms such as Variational Quantum Eigensolver (VQE) and Quantum Approximate Optimization Algorithm (QAOA). The algorithm iteratively applies Grover Search to find the optimum value of an objective function, by using the best-known value from the previous run as a threshold. The adaptive oracle used in GAS recognizes all values above or below the current threshold (for max and min respectively), decreasing the size of the search space every iteration the threshold is updated, until an optimum is found.
fr_fr: La recherche adaptative de Grover (Grover Adaptive Search : GAS) a été explorée comme une solution possible aux problèmes d'optimisation combinatoire, aux côtés d'algorithmes variationnels tels que Variational Quantum Eigensolver (VQE) et Quantum Approximate Optimization Algorithm (QAOA). L'algorithme applique de façon itérative Grover Search pour trouver la valeur optimale d'une fonction objectif, en utilisant la meilleure valeur issue de l'exécution précédente comme seuil. L'oracle adaptatif utilisé dans GAS reconnaît toutes les valeurs au-dessus ou au-dessous du seuil actuel (respectivement pour max et min), diminuant la taille de l'espace de recherche à chaque itération pour laquelle le seuil est mis à jour, jusqu'à ce qu'un optimum soit trouvé.
id_id: Grover Adaptive Search (GAS) telah dieksplorasi sebagai solusi yang mungkin untuk masalah optimisasi kombinatorial, bersama dengan algoritma variasional seperti Variational Quantum Eigensolver (VQE) dan Quantum Approximate Optimization Algorithm (QAOA). Algoritma tersebut secara berulang menerapkan Pencarian Grover untuk menemukan nilai optimal dari suatu fungsi tujuan, dengan menggunakan nilai terbaik dari proses sebelumnya sebagai ambang batas. Oracle adaptif yang digunakan dalam GAS mengenali semua nilai di atas atau di bawah ambang batas saat ini (untuk maks dan min masing-masing), mengurangi ukuran ruang pencarian setiap iterasi ambang diperbarui, hingga nilai optimal ditemukan.
ta_in: குரோவர் அடாப்டிவ் தேடல் (GAS) ஒருங்கிணைந்த தேர்வுமுறை சிக்கல்களுக்கான சாத்தியமான தீர்வாக ஆராயப்பட்டுள்ளது, மாறுபட்ட குவாண்டம் ஐஜென்சால்வர் (VQE) மற்றும் குவாண்டம் தோராயமான உகப்பாக்கம் அல்காரிதம் (QAOA) போன்ற மாறுபட்ட வழிமுறைகளுடன். முந்தைய ஓட்டத்திலிருந்து சிறந்த அறியப்பட்ட மதிப்பை ஒரு நுழைவாயிலாகப் பயன்படுத்துவதன் மூலம், ஒரு புறநிலை செயல்பாட்டின் உகந்த மதிப்பைக் கண்டறிய இந்த வழிமுறை குரோவர் தேடலைப் பயன்படுத்துகிறது. GAS இல் பயன்படுத்தப்படும் தகவமைப்பு ஆரக்கிள் தற்போதைய வாசலுக்கு மேலே அல்லது அதற்குக் கீழே உள்ள அனைத்து மதிப்புகளையும் அங்கீகரிக்கிறது (முறையே அதிகபட்சம் மற்றும் நிமிடம்), உகந்ததைக் கண்டுபிடிக்கும் வரை, வாசல் புதுப்பிக்கப்படும் ஒவ்வொரு மறு செய்கையும் தேடல் இடத்தின் அளவைக் குறைக்கிறது.

source: In this notebook we will explore each component of the ``GroverOptimizer``, which utilizes the techniques described in GAS, by minimizing a Quadratic Unconstrained Binary Optimization (QUBO) problem, as described in [1]
fr_fr: Dans ce bloc-notes, nous explorerons chaque composant de ``GroverOptimizer``, qui utilise les techniques décrites dans le GAS, en minimisant un problème de type QUBO (Quadratic Unconstrained Binary Optimization), tel que décrit dans [1]
id_id: Di notebook ini kita akan mempelajari setiap komponen `` GroverOptimizer``, yang menggunakan teknik yang dijelaskan dalam GAS, dengan meminimalkan masalah Quadratic Unconstrained Binary Optimization (QUBO), seperti yang dijelaskan di [1]
ta_in: இந்த நோட்புக்கில், GAS இல் விவரிக்கப்பட்டுள்ள நுட்பங்களைப் பயன்படுத்தும் `` க்ரோவர் ஆப்டிமைசர்`` இன் ஒவ்வொரு கூறுகளையும் ஆராய்வோம், விவரிக்கப்பட்டுள்ளபடி, இருபடி கட்டுப்பாடற்ற பைனரி உகப்பாக்கம் (QUBO) சிக்கலைக் குறைப்பதன் மூலம் [1]

source: References
fr_fr: Références
id_id: Daftar pustaka
ta_in: குறிப்புகள்

source: Grover Adaptive Search
fr_fr: Recherche adaptative de Grover
id_id: Pencarian Adaptif Grover (Grover Adaptive Search/GAS)
ta_in: குரோவர் தகவமைப்பு தேடல்

source: Grover Search, the core element of GAS, needs three ingredients:
fr_fr: Grover Search, l'élément central du GAS, a besoin de trois ingrédients :
id_id: Pencari Grover, elemen inti dari GAS, membutuhkan tiga komponen:
ta_in: GAS இன் முக்கிய உறுப்பு க்ரோவர் தேடலுக்கு மூன்று பொருட்கள் தேவை:

source: A state preparation operator :math:`A` to construct a superposition of all states in the search space.
fr_fr: Un opérateur de préparation d'état :math:` A ` pour construire une superposition de tous les états dans l'espace de recherche.
id_id: Sebuah operator persiapan keadaan :math:` A ` untuk membangun sebuah superposisi dari semua keadaan dalam ruang pencarian.
ta_in: ஒரு மாநில தயாரிப்பு ஆபரேட்டர்:math:`A`தேடல் இடத்தில் அனைத்து மாநிலங்களின் சூப்பர் போசிஷனை உருவாக்க.

source: An oracle operator :math:`O`, that recognizes the states of interest and multiplies their amplitudes by -1.
fr_fr: Un opérateur oracle :math:` O', qui reconnaît les états d'intérêt et multiplie leurs amplitudes par -1.
id_id: Sebuah operator oracle :math:` O `, mengenali keadaan yang diperhatikan dan mengalikan amplitudo mereka dengan -1.
ta_in: ஒரு ஆரக்கிள் ஆபரேட்டர்:math:`O`,இது வட்டி நிலைகளை அங்கீகரிக்கிறது மற்றும் அவற்றின் பெருக்கங்களை -1 ஆல் பெருக்கும்.

source: The Grover diffusion operator :math:`D`, that multiplies the amplitude of the :math:`|0\rangle_n` state by -1.
fr_fr: L'opérateur de diffusion Grover :math:` D `, qui multiplie l'amplitude du :math:`| 0\rangle_n` état par -1.
id_id: Operator Grover difusi :math:` D `, mengalikan amplitudo dari :math:` | 0\rangle_n ` state sebanyak -1.
ta_in: க்ரோவர் பரவல் ஆபரேட்டர்:math:`D`,இது பெருக்கத்தை பெருக்கும்:math:`|0\rangle_n` state by -1.

source: While implementations of GAS vary around the specific use case, the general framework still loosely follows the steps described below.
fr_fr: Bien que les implémentations de GAS varient en fonction du cas d'utilisation spécifique, le cadre général suit généralement les étapes décrites ci-dessous.
id_id: Walaupun implementasi GAS bervariasi di sekitar kasus penggunaan spesifik, kerangka umumnya masih secara umum mengikuti langkah-langkah yang dijelaskan di bawah ini.
ta_in: குறிப்பிட்ட பயன்பாட்டு வழக்கில் GAS இன் செயல்பாடுகள் வேறுபடுகையில், பொதுவான கட்டமைப்பு இன்னும் கீழே விவரிக்கப்பட்டுள்ள படிகளைப் பின்பற்றுகிறது.

source: ``GroverOptimizer`` uses ``QuadraticProgramToNegativeValueOracle`` to construct :math:`A_y` such that it prepares a :math:`n`-qubit register to represent the equal superposition of all :math:`|x\rangle_n` and a :math:`m`-qubit register to (approximately) represent the corresponding :math:`|Q(x)-y\rangle_m`. Then, all states with :math:`(Q(x) - y)` negative should be flagged by :math:`O_y`. Note that in the implementation discussed, the oracle operator is actually independent of :math:`y`, but this is not a requirement. For clarity, we will refer to the oracle as :math:`O` when the oracle is independent of :math:`y`.
fr_fr: ``GroverOptimizer`` utilise l'oracle ``QuadraticProgramToNegativeValueOracle`` pour construire :math:`A_y` de telle sorte qu'il prépare un registre à :math:`n`-qubit pour représenter la superposition égale de tous les états :math:`|x\rangle_n` et un registre à :math:`m`-qubit pour (approximativement) représenter l'état :math:`|Q(x)-y\rangle_m`. Ensuite, tous les états avec :math:`(Q(x) - y)` négatifs devraient être marqués par :math:`O_y`. Notez que dans l'implémentation discutée, l'opérateur Oracle est en fait indépendant de :math:`y`, mais ce n'est pas une exigence. Pour plus de clarté, nous appellerons l'oracle :math:`O` lorsque l'oracle est indépendant de :math:`y`.
id_id: ` ` ` GroverOptimizer ` ` menggunakan ` ` QuadraticProgramToNegativeValueOracle ` ` untuk menyusun :math:` A_y ` sedemikian rupa sehingga menyiapkan register :math:` n ` n `-qubit untuk mewakili superposisi yang setara dari semua :math:` |x\rangle_n ` dan sebuah :math:` m `-qubit register untuk (secara aproksimasi) mewakili :math:` | Q (x)-y\rangle_m ` yang sesuai. Kemudian, semua keadaan dengan :math:` (Q (x)-y) ` negatif seharusnya dilabeli oleh :math:` O_y `. Perlu dicatat bahwa dalam implementasi yang dibahas, operator oracle sebenarnya independen dari :math:` y `, tetapi ini bukan persyaratan. Untuk kejelasan, kita akan merujuk kepada oraclesebagai :math:` O ` ketika oracle tersebut independen dari :math:` y `.
ta_in: `` க்ரோவர் ஆப்டிமைசர்`` கட்டமைக்க `` QuadraticProgramToNegativeValueOracle`` ஐப் பயன்படுத்துகிறது :math:`A_y`இது ஒரு தயாரிக்கிறது:math:`n`-அனைவருக்கும் சமமான சூப்பர் பொசிஷனைக் குறிக்க க்விட் பதிவு :math:`|x\rangle_n` மற்றும் ஒரு :math:`m`-(தோராயமாக) க்கு குவிட் பதிவு தொடர்புடையதைக் குறிக்கிறது:math:`|Q(x)-y\rangle_m`.பின்னர், அனைத்து மாநிலங்களும்:math:`(Q(x) - y)` எதிர்மறையால் கொடியிடப்பட வேண்டும்:math:`O_y`. விவாதிக்கப்பட்ட செயல்பாட்டில், ஆரக்கிள் ஆபரேட்டர் உண்மையில் சுயாதீனமாக இருப்பதை நினைவில் கொள்க :math:`y`,ஆனால் இது தேவையில்லை. தெளிவுக்காக, ஆரக்கிள் என குறிப்பிடுவோம்:math:`O` ஆரக்கிள் சுயாதீனமாக இருக்கும்போது :math:`y`.

source: Put formally, ``QuadraticProgramToNegativeValueOracle`` constructs an :math:`A_y` and :math:`O` such that:
fr_fr: En termes plus formels, ` ` QuadraticProgramToNegativeValueOracle ` ` construit un :math:` A_y ` et :math:` O ` tel que:
id_id: Secara formal, ` ` QuadraticProgramToNegativeValueOracle ` ` ` membangun sebuah :math:` A_y ` dan :math:` O `sehingga:
ta_in: முறையாகச் சொன்னால், `` QuadraticProgramToNegativeValueOracle`` ஐ உருவாக்குகிறது:math:`A_y`மற்றும்:math:`O`அதுபோல்:

source: where :math:`|x\rangle` is the binary encoding of the integer :math:`x`.
fr_fr: où l'état :math:`|x\rangle` représente l'encodage binaire de l'entier :math:`x`.
ta_in: எங்கே:math: `| x\rangle` என்பது முழு எண்ணின் பைனரி குறியாக்கமாகும்:math:` x`.

source: At each iteration in which the threshold :math:`y` is updated, we adapt :math:`A_y` such that the function values are shifted up or down (for minimum and maximum respectively) by :math:`y`. For example, in the context of finding the minimum, as the value of :math:`y` decreases, the search space (negative values) also decreases, until only the minimum value remains. A concrete example will be explored in the next section.
id_id: Pada setiap iterasi di mana threshold :math:` y ` diperbarui, kita mengadaptasi :math:` A_y ` sedemikian sehingga nilai fungsi digeser ke atas atau ke bawah (untuk minimum dan maksimum masing-masing) sebesar :math:` y `. Sebagai contoh, dalam konteks menemukan minimum, sementara :math:` y ` menurun, ruang pencarian (nilai negatif) juga menurun, sampai hanya nilai minimum yang tersisa. Contoh konkrit akan ditelusuri di bagian berikutnya.
ta_in: நுழைவு:math: `y` புதுப்பிக்கப்பட்ட ஒவ்வொரு மறு செய்கையிலும், நாங்கள் மாற்றியமைக்கிறோம்:math:` A_y` அதாவது செயல்பாட்டு மதிப்புகள் மேலே அல்லது கீழ் நோக்கி மாற்றப்படுகின்றன (முறையே குறைந்தபட்ச மற்றும் அதிகபட்சம்):math: `y`. எடுத்துக்காட்டாக, குறைந்தபட்சத்தைக் கண்டுபிடிக்கும் சூழலில், இதன் மதிப்பு :math:`y` குறைகிறது, குறைந்தபட்ச மதிப்பு மட்டுமே இருக்கும் வரை, தேடல் இடமும் (எதிர்மறை மதிப்புகள்) குறைகிறது. ஒரு உறுதியான உதாரணம் அடுத்த பகுதியில் ஆராயப்படும்.

source: Find the Minimum of a QUBO Problem using GroverOptimizer
fr_fr: Trouver le minimum d'un problème QUBO en utilisant GroverOptimizer
id_id: Temukan Minimum dari Permasalahan QUBO dengan Menggunakan GroverOptimizer
ta_in: GroverOptimizer ஐப் பயன்படுத்தி QUBO சிக்கலின் குறைந்தபட்சத்தைக் கண்டறியவும்

source: The following is a toy example of a minimization problem.
fr_fr: Voici un exemple de taille réduite d'un problème de minimisation.
id_id: Berikut ini adalah contoh dari permasalahan minimisasi.
ta_in: பின்வருவது குறைக்கும் சிக்கலின் பொம்மை எடுத்துக்காட்டு.

source: For our initial steps, we create a docplex model that defines the problem above, and then use the ``from_docplex()`` function to convert the model to a ``QuadraticProgram``, which can be used to represent a QUBO in Qiskit Optimization.
fr_fr: Pour nos étapes initiales, nous créons un modèle docplex qui définit le problème ci-dessus, puis nous utilisons la fonction ``from_docplex()`` pour convertir le modèle en un ``QuadraticProgram``, qui peut être utilisé pour représenter un QUBO dans Qiskit Optimisation.
id_id: Untuk langkah awal, kami membuat model docplex yang mendefinisikan permasalahan di atas dan menggunakan fungsi``from_docplex()`` untuk mengkonversi modelnya menjadi sebuah ``QuadraticProgram``, yang bisa digunakan untuk merepresentasikan QUBO dalam optimasi Qiskit.
ta_in: எங்கள் ஆரம்ப படிகளுக்கு, மேலே உள்ள சிக்கலை வரையறுக்கும் டாக்ளெக்ஸ் மாதிரியை நாங்கள் உருவாக்குகிறோம், பின்னர் மாதிரியை `` குவாட்ராடிக் புரோகிராம்`` ஆக மாற்ற `` from_docplex() `` செயல்பாட்டைப் பயன்படுத்துகிறோம், இது கிஸ்கிட்டில் ஒரு QUBO ஐக் குறிக்கப் பயன்படுகிறது. உகப்பாக்கம்.

source: Next, we create a ``GroverOptimizer`` that uses 6 qubits to encode the value, and will terminate after there have been 10 iterations of GAS without progress (i.e. the value of :math:`y` does not change). The ``solve()`` function takes the ``QuadraticProgram`` we created earlier, and returns a results object that contains information about the run.
id_id: Selanjutnya, kami membuat sebuah ` ` ` GroverOptimizer ` ` yang menggunakan 6 qubit untuk meng-encode nilai, dan akan berakhir setelah 10 iteras itanpa kemajuan S (yaitu nilai :math:` y ` tidak berubah) dari GAS. Fungsi ` ` solve () ` ` mengambil ` ` QuadraticProgram ` ` yang kita buat sebelumnya, dan mengembalikan sebuah objek hasil yang berisi informasi tentang proses yang berjalan.
ta_in: அடுத்து, மதிப்பைக் குறியிட 6 குவிட்களைப் பயன்படுத்தும் `` க்ரோவர் ஆப்டிமைசர்`` ஐ உருவாக்குகிறோம், மேலும் GAS இன் 10 மறு செய்கைகள் முன்னேற்றமின்றி முடிந்தபின் நிறுத்தப்படும் (அதாவது கணிதத்தின் மதிப்பு :math: `y` மாறாது). `` solve() `` செயல்பாடு நாம் முன்னர் உருவாக்கிய `` குவாட்ராடிக் புரோகிராம்`` ஐ எடுத்து, ரன் பற்றிய தகவல்களைக் கொண்ட ஒரு முடிவு பொருளை வழங்குகிறது.

source: This results in the optimal solution :math:`x_0=1`, :math:`x_1=0`, :math:`x_2=1` and the optimal objective value of :math:`-6` (most of the time, since it is a randomized algorithm). In the following, a custom visualization of the quantum state shows a possible run of ``GroverOptimizer`` applied to this QUBO.
fr_fr: Il en résulte la solution optimale :math:`x_0 = 1`, :math:`x_1 = 0`, :math:`x_2 = 1` et la valeur objective optimale de :math:`-6` (la plupart du temps, puisqu'il s'agit d'un algorithme aléatoire). Dans ce qui suit, une visualisation de l'état quantique montre une possible exécution de ``GroverOptimizer`` appliqué à ce QUBO.
id_id: Hal ini menghasilkan solusi optimal :math:` x_0 = 1 `, :math:` x_1 = 0 `, :math:` x_2 = 1 ` dan nilai objektif optimal dari :math:` -6 ` (untuk kebanyakan waktu, karena algoritma yang digunakan merupakan algoritma yang diacak). Dalam hal berikut, visualisasi kustom dari keadaan kuantum menunjukkan sebuah contoh proses yang dijalankan dari ` ` GroverOptimizer ` ` yang diterapkan pada QUBO ini.
ta_in: இது உகந்த தீர்வில் விளைகிறது:math: `x_0 = 1` ,:math:` x_1 = 0` ,:math: `x_2 = 1` மற்றும் உகந்த புறநிலை மதிப்பு:math:` -6` (பெரும்பாலான நேரம் , இது ஒரு சீரற்ற வழிமுறை என்பதால்). பின்வருவனவற்றில், குவாண்டம் நிலையின் தனிப்பயன் காட்சிப்படுத்தல் இந்த QUBO க்குப் பயன்படுத்தப்படும் `` க்ரோவர் ஆப்டிமைசர்`` இன் சாத்தியமான ஓட்டத்தைக் காட்டுகிறது.

source: Each graph shows a single iteration of GAS, with the current values of :math:`r` (= iteration counter) and :math:`y` (= threshold/offset) shown in the title. The X-axis displays the integer equivalent of the input (e.g. ‘101’ :math:`\rightarrow` 5), and the Y-axis shows the possible function values. As there are 3 binary variables, there are :math:`2^3=8` possible solutions, which are shown in each graph. The color intensity indicates the probability of measuring a certain result (with bright intensity being the highest), while the actual color indicates the corresponding phase (see phase color-wheel below). Note that as :math:`y` decreases, we shift all of the values up by that amount, meaning there are fewer and fewer negative values in the distribution, until only one remains (the minimum).
id_id: Setiap grafik menunjukkan iterasi tunggal dari GAS, dengan nilai saat ini :math:` r ` (= iterasi counter) dan :math:` y ` (= ambang/offset) seperti ditunjukkan pada judul. Sumbu X menampilkan bilangan bulat yang setara dengan masukan (misalnya '101' :math:`\rightarrow ` 5), dan sumbu Y menunjukkan nilai fungsi yang mungkin. Karena ada 3 variabel biner, terdapat :math:` 2 ^ 3 = 8 ` kemungkinan solusi, yang ditunjukkan dalam setiap grafik. Intensitas warna menunjukkan probabilitas pengukuran hasil tertentu (dengan warna terang menunjukkan yang tertinggi), sedangkan warna yang sebenarnya menunjukkan fase yang sesuai (lihat warna fasa-roda di bawah). Perhatikan bahwa dengan menurunnya :math:` y `, kita menggeser semua nilai naik dengan jumlah itu, yang berarti nilai negatif semakin sedikit dan terus mengurang pada distribusi, sampai hanya satu yang tersisa (minimum).
ta_in: ஒவ்வொரு வரைபடமும் GAS இன் ஒற்றை மறு செய்கையை காட்டுகிறது, தற்போதைய மதிப்புகள்:math: `r` (= மறு செய்கை கவுண்டர்) மற்றும்:math:` y` (= வாசல் / ஆஃப்செட்) தலைப்பில் காட்டப்பட்டுள்ளது. எக்ஸ்-அச்சு உள்ளீட்டுக்கு சமமான முழு எண்ணைக் காட்டுகிறது (எ.கா. ‘101’:math: `\ வலதுபுறம்` 5), மற்றும் Y- அச்சு சாத்தியமான செயல்பாட்டு மதிப்புகளைக் காட்டுகிறது. 3 பைனரி மாறிகள் இருப்பதால், :math: `2 ^ 3 = 8` சாத்தியமான தீர்வுகள், அவை ஒவ்வொரு வரைபடத்திலும் காட்டப்படுகின்றன. வண்ண தீவிரம் ஒரு குறிப்பிட்ட முடிவை அளவிடுவதற்கான நிகழ்தகவைக் குறிக்கிறது (பிரகாசமான தீவிரம் மிக உயர்ந்ததாக இருக்கும்), உண்மையான நிறம் தொடர்புடைய கட்டத்தைக் குறிக்கிறது (கீழே கட்ட வண்ண-சக்கரத்தைக் காண்க).:math: `y` குறைகிறது எனில், எல்லா மதிப்புகளையும் அந்த அளவு மூலம் மாற்றுவோம், அதாவது விநியோகத்தில் குறைவான மற்றும் குறைவான எதிர்மறை மதிப்புகள் உள்ளன, ஒன்று மட்டுமே இருக்கும் வரை (குறைந்தபட்சம்).

source: Check that GroverOptimizer finds the correct value
fr_fr: Vérifiez que GroverOptimizer trouve la valeur correcte
id_id: Periksa bahwa GroverOptimizer telah menemukan nilai yang tepat.
ta_in: GroverOptimizer சரியான மதிப்பைக் காண்கிறதா என்று சரிபார்க்கவும்

source: We can verify that the algorithm is working correctly using the ``MinimumEigenOptimizer`` in Qiskit.
fr_fr: Nous pouvons vérifier que l'algorithme fonctionne correctement en utilisant ``MinimumEigenOptimizer`` dans Qiskit.
id_id: Kita dapat memverifikasi bahwa algoritma bekerja dengan benar dengan menggunakan ` ` MinimumEigenOptimizer ` ` pada Qiskit.
ta_in: கிஸ்கிட்டில் உள்ள `` குறைந்தபட்ச ஈஜென் ஆப்டிமைசர்`` ஐப் பயன்படுத்தி வழிமுறை சரியாக வேலை செய்கிறது என்பதை நாங்கள் சரிபார்க்க முடியும்.

source: At each iteration in which the threshold :math:`y` is updated, we adapt :math:`A_y` such that the function values are shifted up or down (for minimum and maxmimum respectively) by :math:`y`. For example, in the context of finding the minimum, as the value of :math:`y` decreases, the search space (negative values) also decreases, until only the minimum value remains. A concrete example will be explored in the next section.
fr_fr: A chaque itération dans laquelle le seuil :math:`y` est mis à jour, nous adaptons :math:` A_y` de sorte que les valeurs de fonction sont décalées vers le haut ou vers le bas (pour le minimum et le maximum respectivement) par :math:`y`. Par exemple, dans le contexte de la recherche du minimum, comme la valeur de :math:`y` diminue, l'espace de recherche (valeurs négatives) diminue également, jusqu'à ce que seule la valeur minimale reste. Un exemple concret sera examiné dans la prochaine section.

source: Next, we create a ``GroverOptimizer`` that uses 6 qubits to encode the value, and will terminate after there have been 10 iterations of GAS without progress (i.e. the value of :math:`y` does not change). The ``solve()`` function takes the ``QuadraticProgram`` we created earlier, and returns a results object that contains information about the run.
fr_fr: Ensuite, nous créons un ` ` GroverOptimizer ` ` ` qui utilise 6 qubits pour coder la valeur, et se terminera après 10 itérations de GAS sans progression (c'est-à-dire que la valeur de :math:` y'ne change plus). La fonction ` ` solve() ` ` prend le ` ` QuadraticProgram ` ` que nous avons créé plus tôt, et renvoie un objet qui contient les résultats de l'exécution.

source: Each graph shows a single iteration of GAS, with the current values of :math:`r` (= iteration counter) and :math:`y` (= threshold/offset) shown in the title. The X-axis displays the integer equivalent of the input (e.g. '101' :math:`\rightarrow` 5), and the Y-axis shows the possible function values. As there are 3 binary variables, there are :math:`2^3=8` possible solutions, which are shown in each graph. The color intensity indicates the probability of measuring a certain result (with bright intensity being the highest), while the actual color indicates the corresponding phase (see phase color-wheel below). Note that as :math:`y` decreases, we shift all of the values up by that amount, meaning there are fewer and fewer negative values in the distribution, until only one remains (the minimum).
fr_fr: Chaque graphique montre une seule itération de GAS, avec les valeurs actuelles de :math:`r` (= compteur d'itération) et :math:`y` (= seuil/offset) affichées dans le titre. L'axe X affiche l'équivalent entier de l'entrée (e. . '101' :math:`\rightarrow` 5), et l'axe Y montre les valeurs possibles de la fonction. Comme il y a 3 variables binaires, il y a :math:`2^3=8` solutions possibles, qui sont affichées dans chaque graphique. L'intensité de la couleur indique la probabilité de mesurer un certain résultat (avec l'intensité la plus élevée), tandis que la couleur elle même indique la phase correspondante (voir la roue de la phase ci-dessous). Notez que puisque :math:`y` diminue, nous déplaçons toutes les valeurs d'autant, signifiant qu'il y a de moins en moins de valeurs négatives dans la distribution, jusqu'à ce qu'il n'en reste qu'une (le minimum).
