Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/optimization/5_admm_optimizer.po
Languages: es_un, fr_fr, id_id

source: This page was generated from `tutorials/optimization/5_admm_optimizer.ipynb`__.
es_un: Esta página fue generada a partir de `tutorials/optimization/5_admm_optimizer.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/optimization/5_admm_optimizer.ipynb`__.
id_id: Halaman ini dihasilkan dari ` tutorials/optimization/5_admm_optimizer.ipynb ` __.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/5_admm_optimizer.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/5_admm_optimizer.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le ` IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/5_admm_optimizer.ipynb>` _.
id_id: Jalankan secara interaktif dalam ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/5_admm_optimizer.ipynb>` _.

source: ADMM Optimizer
es_un: Optimizador ADMM
fr_fr: Optimiseur ADMM
id_id: Pengoptimasi ADMM

source: Introduction
es_un: Introducción
id_id: Pendahuluan

source: The ADMM Optimizer can solve classes of mixed-binary constrained optimization problems, hereafter (MBCO), which often appear in logistic, finance, and operation research. In particular, the ADMM Optimizer here designed can tackle the following optimization problem :math:`(P)`:
es_un: El optimizador ADMM puede resolver clases de problemas de optimización con restricciones binarias mixtas, en adelante (MBCO, mixed-binary constrained optimization problems), que a menudo aparecen en la investigación de operaciones, finanzas y logística. En particular, el optimizador ADMM diseñado aquí puede abordar el siguiente problema de optimización :math:`(P)`:
fr_fr: L'optimiseur ADMM permet de résoudre des classes de problèmes d'optimisation à contraintes binaires mixtes (MBCO), qui apparaissent souvent dans les domaines de la logistique, les finances et la recherche opérationnelle. En particulier, l'optimiseur ADMM conçu ici peut résoudre le problème d'optimisation suivant :math:`(P)` :
id_id: Pengoptimasi ADMM dapat menyelesaikan kelas-kelas dari masalah optimisasi yang terbatasi mixed-binary, kemudian (MBCO), yang sering muncul dalam penelitian logistik, finance, dan operasi. Secara khusus, ADMM Optimizer di sini dirancang untuk mengatasi masalah optimisasi berikut :math:` (P) `:

source: subject to the constraints:
es_un: sujeto a las restricciones:
fr_fr: soumis aux contraintes :
id_id: dengan konstrain:

source: with the corresponding functional assumptions.
es_un: con los correspondientes supuestos funcionales.
fr_fr: avec les hypothèses suivantes :
id_id: dengan asumsi fungsional yang sesuai.

source: Function :math:`q: \mathbb{R}^n \to \mathbb{R}` is quadratic, i.e., :math:`q(x) = x^{\intercal} Q x + a^{\intercal} x` for a given symmetric squared matrix :math:`Q \in \mathbb{R}^n \times \mathbb{R}^n, Q = Q^{\intercal}`, and vector :math:`a \in \mathbb{R}^n`;
es_un: La función :math:`q: \mathbb{R}^n \to \mathbb{R}` es cuadrática, es decir, :math:`q(x) = x^{\intercal} Q x + a^{\intercal} x` para una matriz cuadrada simétrica :math:`Q \in \mathbb{R}^n \times \mathbb{R}^n, Q = Q^{\intercal}` dada, y el vector :math:`a \in \mathbb{R}^n`;
fr_fr: La fonction :math:`q: \mathbb{R}^pf \to \mathbb{R}` est quadratique, donc :math:`q(x) = x^{\intercal} Q x + a^{\intercal} x` pour une matrice carrée symétrique donnée :math:`Q \in \mathbb{R}^ \times \mathbb{R}^n, Q = Q^{\intercal}`, et un vecteur :math:`a \in \mathbb{R}^n`;
id_id: Fungsi :math:`q: \mathbb{R}^n \to \mathbb{R}` bersifat kuadratik, misal, :math:`q(x) = x^{\intercal} Q x + a^{\intercal} x` untuk sebuah matriks simetrik squared :math:`Q \in \mathbb{R}^n \times \mathbb{R}^n, Q = Q^{\intercal}`, dan vektor :math:`a \in \mathbb{R}^n`;

source: The set :math:`\mathcal{X} = \{0,1\}^n = \{x_{(i)} (1-x_{(i)}) = 0, \forall i\}` enforces the binary constraints;
es_un: El conjunto :math:`\mathcal{X} = \{0,1\}^n = \{x_{(i)} (1-x_{(i)}) = 0, \forall i\}` impone las restricciones binarias;
fr_fr: L'ensemble :math:`\mathcal{X} = \{0,1\}^M = \{x_{(i)} (1-x_{(i)}) = 0, \forall i\}` impose les contraintes binaires ;
id_id: Set :math:` \mathcal{X} = \ {0 ,1 \} ^ n = \ {x_ {(i)} (1-x_ {(i)}) = 0, \forall i\} ` memberlakukan batasan biner;

source: Matrix :math:`G\in\mathbb{R}^n \times \mathbb{R}^{n'}`, vector :math:`b \in \mathbb{R}^{n'}`, and function :math:`g: \mathbb{R}^n \to \mathbb{R}` is convex;
es_un: La matriz :math:`G\in\mathbb{R}^n \times \mathbb{R}^{n'}`, el vector :math:`b \in \mathbb{R}^{n'}`, y la función :math:`g: \mathbb{R}^n \to \mathbb{R}` es convexa;
fr_fr: La matrice :math:`G\in\mathbb{R}^f \times \mathbb{R}^{n'}`, le vecteur :math:`b \in \mathbb{R}^{n'}`, et la fonction :math:`g: \mathbb{R}^ \to \mathbb{R}` sont convexes;
id_id: Matriks :math:` G \in\mathbb{R}^ n \times \mathbb{R}^{n'}`, vektor :math:` b \in \mathbb{R}^{n'}`, dan fungsi :math:` g: \mathbb{R}^ n \to \mathbb{R}` berbentuk cembung;

source: Function :math:`\varphi: \mathbb{R}^l \to \mathbb{R}` is convex and :math:`\mathcal{U}` is a convex set;
es_un: La función :math:`\varphi: \mathbb{R}^l \to \mathbb{R}` es convexa y :math:`\mathcal{U}` es un conjunto convexo;
fr_fr: La fonction :math:`\varphi: \mathbb{R}^l \to \mathbb{R}` est convexe et :math:`\mathcal{U}` est un ensemble convexe ;
id_id: Fungsi :math:` \varphi: \mathbb{R}^ l \to \mathbb{R}` berbentuk cembung dan :math:` \mathcal{U}` adalah sebuah himpunan cembung;

source: Function :math:`\ell: \mathbb{R}^n\times \mathbb{R}^l \to \mathbb{R}` is *jointly* convex in :math:`x, u`.
es_un: La función :math:`\ell: \mathbb{R}^n\times \mathbb{R}^l \to \mathbb{R}` es *conjuntamente* convexa en :math:`x, u`.
fr_fr: La fonction :math:`\ell: \mathbb{R}^pf\times \mathbb{R}^l \to \mathbb{R}` est *jointivement* convexe en :math:`x, u`.
id_id: Fungsi :math:` \ell: \mathbb{R}^ n\times \mathbb{R}^ l \to \mathbb{R}` bersifat * sama-sama * cembung dalam :math:` x, u `.

source: In order to solve MBO problems, [1] proposed heuristics for :math:`(P)` based on the Alternating Direction Method of Multipliers (ADMM) [2]. ADMM is an operator splitting algorithm with a long history in convex optimization, and it is known to have residual, objective and dual variable convergence properties, provided that convexity assumptions are holding.
es_un: Para resolver problemas MBO, [1] propone heurísticas para :math:`(P)` basadas en el Método de Multiplicadores de Dirección Alterna (Alternating Direction Method of Multipliers, ADMM) [2]. ADMM es un algoritmo de división de operadores con una larga historia en optimización convexa, y se sabe que tiene propiedades de convergencia de variables residuales, objetivas y duales, siempre que se cumplan los supuestos de convexidad.
fr_fr: Afin de résoudre les problèmes MBO, [1] a proposé une méthode heuristique pour :math:`(P)` basée sur la méthode de direction alternée des multiplicateurs (ADMM) [2]. ADMM est un algorithme de fractionnement d'opérateurs utilisé depuis longtemps dans l'optimisation convexe. Cette méthode est connue pour avoir des propriétés de convergence résiduelle, objective et à double variable, à condition que les hypothèses de convexité soient vérifiées.
id_id: Untuk menyelesaikan permasalahan-permasalahan MBO, [1] mengusulkan heuristik untuk :math:` (P) ` berdasarkan Metode Pengarahan Alternatif dari Pengali (Alternating Direction Method of Multipliers) (ADMM) [2]. ADMM adalah algoritme pemisahan operator dengan sejarah panjang dalam optimasi cembung, dan diketahui memiliki sifat konvergensi residual, objektif dan properti konvergensi variabel ganda, dengan syarat bahwa asumsi kecembungan terpenuhi.

source: The method of [1] (referred to as 3-ADMM-H) leverages the ADMM operator-splitting procedure to devise a decomposition for certain classes of MBOs into: - a QUBO subproblem to be solved by on the quantum device via variational algorithms, such as VQE or QAOA; - continuous convex constrained subproblem, which can be efficiently solved with classical optimization solvers.
es_un: El método de [1] (denominado 3-ADMM-H) aprovecha el procedimiento de división del operador de ADMM para diseñar una descomposición de ciertas clases de MBOs en: - un subproblema QUBO que se resolverá en el dispositivo cuántico mediante algoritmos variacionales, como VQE o QAOA; - subproblema restringido convexo continuo, que puede resolverse eficientemente con solucionadores de optimización clásicos.
fr_fr: La méthode décrite en [1] (appelée 3-ADMM-H) repose sur la procédure de décomposition des opérateurs pour découper certaines classes de problèmes MBO en: - un sous-problème QUBO qui peut être solutionné par un ordinateur quantique via des algorithmes tels que VQE (Variational-Quantum-Eigensolver) ou QAOA (Quantum Approximate Optimization Algorithm); - des sous-problèmes à contraintes continues convexes qui peuvent être résolus efficacement par des optimisations classiques.
id_id: Metode [1] (disebut sebagai 3-ADMM-H) memanfaatkan prosedur pemisahan operator ADMM untuk merancang suatu dekomposisi untuk kelas-kelas tertentu dari MBOs menjadi:-sebuah submasalah QUBO yang akan dipecahkan oleh perangkat kuantum melalui algoritme variasional, seperti VQE atau QAOA;-subproblem cembung kontinu dengan batasan, yang dapat diselesaikan secara efisien dengan solver optimisasi klasik.

source: The algorithm 3-ADMM-H works as follows:
es_un: El algoritmo 3-ADMM-H funciona de la siguiente manera:
fr_fr: L'algorithme 3-ADMM-H fonctionne ainsi :
id_id: Algoritma 3-ADMM-H bekerja sebagai berikut:

source: Initialization phase (set the parameters and the QUBO and convex solvers);
es_un: Fase de inicialización (configurar los parámetros y los solucionadores QUBO y convexos);
fr_fr: Phase d'initialisation (positionne les paramètres, la QUBO -Quadratic Unconstrained Binary Optimization- et les solveurs convexes);
id_id: Tahap inisialisasi (menentukan parameter dan solvers QUBO dan cembung);

source: For each ADMM iterations ($k = 1, 2, :nbsphinx-math:`\ldots`, $) untill termination:
id_id: Untuk setiap iterasi ADMM ($k = 1, 2, :nbsphinx-math:` \ldots `, $) hingga terminasi:

source: Solve a properly defined QUBO subproblem (with a classical or quantum solver);
es_un: Resolver un subproblema QUBO correctamente definido (con un solucionador clásico o cuántico);
fr_fr: Résoudre un sous-problème QUBO défini complètement (avec une machine classique ou quantique);
id_id: Pecahkan submasalah QUBO yang didefinisikan dengan benar (dengan solver klasik atau kuantum);

source: Solve properly defined convex problems (with a classical solver);
es_un: Resolver problemas convexos correctamente definidos (con un solucionador clásico);
fr_fr: Résoudre des problèmes convexes correctement définis (avec une machine classique);
id_id: Pecahkan masalah cembung yang didefinisikan dengan benar (dengan solver klasik);

source: Update the dual variables.
es_un: Actualizar las variables duales.
fr_fr: Mettre à jour les variables duales.
id_id: Perbarui variabel ganda.

source: Return optimizers and cost.
es_un: Regresar optimizadores y costos.
fr_fr: Retourner les optimiseurs et le coût.
id_id: Kembalikan pengoptimasi dan biayanya.

source: A comprehensive discussion on the conditions for convergence, feasibility and optimality of the algorithm can be found in [1]. A variant with 2 ADMM blocks, namely a QUBO subproblem, and a continuous convex constrained subproblem, is also introduced in [1].
es_un: En [1] se puede encontrar una discusión exhaustiva sobre las condiciones para la convergencia, la viabilidad y la optimización del algoritmo. En [1] también se introduce una variante con 2 bloques ADMM, es decir, un subproblema QUBO y un subproblema restringido convexo continuo.
fr_fr: Une discussion accessible sur les conditions de convergence, la faisabilité et l'optimisation de l'algorithme peut être trouvé dans [1]. Une variante avec deux blocs ADMM, de fait un problème QUBO, et un sous-problème contraint continu convexe est aussi présenté en [1].
id_id: Sebuah diskusi komprehensif tentang kondisi untuk konvergensi, kelayakan dan optimalitas dari algoritma dapat ditemukan pada [1]. Sebuah varian dengan 2 blok ADMM, yaitu submasalah QUBO, dan submasalah konveks kontinu, juga diperkenalkan pada [1].

source: References
es_un: Referencias
fr_fr: Références
id_id: Referensi

source: Initialization
es_un: Inicialización
fr_fr: Initialisation
id_id: Inisialisasi

source: First of all we load all the packages that we need.
es_un: En primer lugar cargamos todos los paquetes que necesitamos.
fr_fr: On commence ici par charger tous les packages nécessaires.
id_id: Pertama-tama, kita memuat semua paket yang kita butuhkan.

source: We first initialize all the algorithms we plan to use later in this tutorial.
es_un: Primero inicializamos todos los algoritmos que planeamos usar más adelante en este tutorial.
fr_fr: On initialise ensuite tous les algorithmes prévus pour ce tutoriel.
id_id: Kita pertama-tama menginisialisasi semua algoritma yang akan kita gunakan nanti dalam tutorial ini.

source: To solve the QUBO problems we can choose between - ``MinimumEigenOptimizer`` using different ``MinimumEigensolver``, such as ``VQE``, ``QAOA`` or ``NumpyMinimumEigensolver`` (classical) - ``GroverOptimizer`` - ``CplexOptimizer`` (classical, if CPLEX is installed)
es_un: Para resolver los problemas QUBO podemos elegir entre - ``MinimumEigenOptimizer`` usando diferentes ``MinimumEigensolver``, como ``VQE``, ``QAOA`` o ``NumpyMinimumEigensolver`` (clásico) - ``GroverOptimizer`` - ``CplexOptimizer`` (clásico, si CPLEX está instalado)
fr_fr: Pour résoudre les problèmes QUBO, on peut choisir entre - ``MinimumEigenOptimizer`` utilisant des ``MinimumEigensolver``, tels que ``VQE``, ``QAOA`` ou ``NumpyMinimumEigensolver`` (classique) - ``GroverOptimizer`` - ``CplexOptimizer`` (classique, nécessite CPLEX installé)
id_id: Untuk memecahkan masalah QUBO kita dapat memilih antara-` ` MinimumEigenOptimizer ` ` dengan` ` MinimumEigensolver ` ` yang berbeda, seperti ` ` VQE ` `, ` ` QAOA ` ` atau ` ` NumpyMinimumEigensolver ` ` (klasik)-` ` GroverOptimizer ` `-` ` CplexOptimizer ` ` (klasik, jika CPLEX terinstal)

source: and to solve the convex continuous problems we can choose between the following classical solvers: - ``CplexOptimizer`` (if CPLEX is installed) - ``CobylaOptimizer``
es_un: y para resolver los problemas continuos convexos podemos elegir entre los siguientes solucionadores clásicos: - ``CplexOptimizer`` (si CPLEX está instalado) - ``CobylaOptimizer``
fr_fr: et pour résoudre les problèmes convexes continus on peut choisir l'un des choisir classiques suivants : - ``CplexOptimizer`` (nécessite CPLEX installé) - ``CobylaOptimizer``
id_id: dan untuk memecahkan permasalahan cembung kontinu, kita dapat memilih antara solvers klasik berikut:-` ` CplexOptimizer ` ` (jika CPLEX telah terinstal)-` ` CobylaOptimizer ` `

source: In case CPLEX is not available, the ``CobylaOptimizer`` (for convex continuous problems) and the ``MinimumEigenOptimizer`` using the ``NumpyMinimumEigensolver`` (for QUBOs) can be used as classical alternatives to CPLEX for testing, validation, and benchmarking.
es_un: En caso de que CPLEX no esté disponible, el ``CobylaOptimizer`` (para problemas continuos convexos) y el ``MinimumEigenOptimizer`` usando el ``NumpyMinimumEigensolver`` (para QUBOs) se pueden utilizar como alternativas clásicas a CPLEX para pruebas, validación, y evaluación comparativa.
fr_fr: Si CPLEX n'est pas disponible, la classe ``CobylaOptimizer`` (pour les problèmes continus convexes) ainsi que ``MinimumEigenOptimizer`` reposant sur ``NumpyMinimumEigensolver`` (pour QUBO) peuvent être utilisées comme alternatives à CPLEX pour tester, valider et mesurer les performances.
id_id: Apabila CPLEX tidak tersedia, ` ` CobylaOptimizer ` ` (untuk permasalahan cembung kontinu) dan ` ` MinimumEigenOptimizer ` ` menggunakan ` ` NumpyMinimumEigensolver ` ` (untuk QUBOs) dapat digunakan sebagai alternatif klasik untuk CPLEX untuk pengujian, validasi, dan penentuan tolok ukur.

source: Example
es_un: Ejemplo
fr_fr: Exemple
id_id: Contoh

source: We test 3-ADMM-H algorithm on a simple Mixed-Binary Quadratic Problem with equality and inequality constraints (Example 6 reported in [1]). We first construct a docplex problem and then load it into a ``QuadraticProgram``.
es_un: Probamos el algoritmo 3-ADMM-H en un problema cuadrático mixto-binario simple con restricciones de igualdad y desigualdad (ejemplo 6 informado en [1]). Primero construimos un problema docplex (decision optimization CPLEX) y luego lo cargamos en un ``QuadraticProgram``.
fr_fr: Nous testons maintenant l'algorithme 3-ADMM-H sur un problème simple quadratique binaire mixte avec des contraintes d'égalités et d'inégalités (Exemple 6 décrit dans [1]). Nous commençons par construire un problème docplex puis nous le chargeons dans un ``QuadraticProgram``.
id_id: Kita menguji algoritma 3-ADMM-H pada Problem Quadratic Mixed-Binary Quadratic sederhana dengan bataasan kesamaan dan ketidaksamaan (Contoh 6 didapatkan dari [1]). Kita pertama-tama membangun sebuah masalah docplex dan kemudian dimuat ke dalam ` ` QuadraticProgram ` `.

source: Classical Solution
es_un: Solución Clásica
fr_fr: Solution classique
id_id: Solusi Klasik

source: 3-ADMM-H needs a QUBO optimizer to solve the QUBO subproblem, and a continuous optimizer to solve the continuous convex constrained subproblem. We first solve the problem classically: we use the ``MinimumEigenOptimizer`` with the ``NumPyMinimumEigenSolver`` as a classical and exact QUBO solver and we use the ``CobylaOptimizer`` as a continuous convex solver. 3-ADMM-H supports any other suitable solver available in Qiskit. For instance, VQE, QAOA, and GroverOptimizer can be invoked as quantum solvers, as demonstrated later. If CPLEX is installed, the ``CplexOptimizer`` can also be used as both, a QUBO and convex solver.
es_un: 3-ADMM-H necesita un optimizador QUBO para resolver el subproblema QUBO y un optimizador continuo para resolver el subproblema restringido convexo continuo. Primero resolvemos el problema de manera clásica: usamos el ``MinimumEigenOptimizer`` con el ``NumPyMinimumEigenSolver`` como un solucionador QUBO clásico y exacto y usamos el ``CobylaOptimizer`` como un solucionador convexo continuo. 3-ADMM-H admite cualquier otro solucionador adecuado disponible en Qiskit. Por ejemplo, VQE, QAOA y GroverOptimizer se pueden invocar como solucionadores cuánticos, como se demuestra más adelante. Si CPLEX está instalado, el ``CplexOptimizer`` también se puede utilizar tanto como solucionador QUBO como solucionador convexo.
fr_fr: L'algorithme 3-ADMM-H repose sur l'utilisation d'un optimiseur QUBO (pour adresser les sujets QUBO) et d'un optimiseur continu (pour adresser les problèmes contraints continus convexes). En premier lieu, nous résolvons ce problème de manière classique: Nous utilisons la classe ``MinimumEigenOptimizer`` avec un ``NumPyMinimumEigenSolver`` comme solution QUBO classique exacte et nous utilisons la classe ``CobylaOptimizer`` comme solution du problème continu convexe. 3-ADMM-H supporte tout solveur disponible dans Qiskit. Par exemple VQE, QAOA, et GroverOptimizer peuvent être invoqués comme solveurs quantiques comme nous le verrons plus tard. Si CPLEX est installé, le ``CplexOptimizer`` peut être utilisé à la fois comme solveur QUBO et comme solveur continu convexe.
id_id: 3-ADMM-H membutuhkan pengoptimasi QUBO untuk memecahkan submasalah QUBO, dan pengoptimasi kontinu untuk memecahkan submasalah yang kontinu dengan batasan. Kita pertama-tama memecahkan masalah secara klasik: menggunakan` ` MinimumEigenOptimizer ` ` dengan ` ` NumPyMinimumEigenSolver ` ` sebagai solver QUBO klasik dan tepat; kami menggunakan ` ` ` CobylaOptimizer ` ` sebagai solver cembung yang kontinu. 3-ADMM-H mendukung setiap solver cocok lainnya yang tersedia di Qiskit. Sebagai contoh, VQE, QAOA, dan GroverOptimizer dapat dipanggil sebagai pemecah kuantum, seperti yang ditunjukkan kemudian. Jika CPLEX terinstall, ` ` CplexOptimizer ` ` juga dapat digunakan sebagai solver QUBO dan cembung.

source: Parameters
es_un: Parámetros
fr_fr: Paramètres
id_id: Parameter

source: The 3-ADMM-H are wrapped in class ``ADMMParameters``. Customized parameter values can be set as arguments of the class. In this example, parameters :math:`\rho, \beta` are initialized to :math:`1001` and :math:`1000`, respectively. The penalization ``factor_c`` of equality constraints :math:`Gx = b` is set to :math:`900`. The tolerance ``tol`` for primal residual convergence is set to ``1.e-6``. In this case, the 3-block implementation is guaranteed to converge for Theorem 4 of [1], because the inequality constraint with the continuous variable is always active. The 2-block implementation can be run by setting ``three_block=False``, and practically converges to a feasible not optimal solution.
es_un: Los 3-ADMM-H están incluidos en la clase ``ADMMParameters``. Los valores de los parámetros personalizados se pueden establecer como argumentos de la clase. En este ejemplo, los parámetros :math:`\rho, \beta` se inicializan en :math:`1001` y :math:`1000`, respectivamente. La penalización ``factor_c`` de las restricciones de igualdad :math:`Gx = b` se establece en :math:`900`. La tolerancia ``tol`` para la convergencia residual primaria se establece en ``1.e-6``. En este caso, se garantiza que la implementación de 3 bloques convergerá para el Teorema 4 de [1], porque la restricción de desigualdad con la variable continua siempre está activa. La implementación de 2 bloques se puede ejecutar configurando ``three_block=False`` y prácticamente converge a una solución factible no óptima.
fr_fr: Le 3-ADMM-H est associé à la classe ``ADMMParameters``. Des valeurs particulières de certains paramètres doivent être définis comme arguments de la classe. Dans notre exemple, les paramètres :math:`\rho, \beta` sont initialisés à :math:`1001` et :math:`1000` , respectivement. La pénalisation ``factor_c`` associée aux contraintes d'égalité :math:`Gx = b`est définie à :math:`900` . La tolérance ``tol`` de la convergence résiduelle primaire est définie à ``1.e-6``. Dans ce cas, l'implémentation 3-block converge forcément en accord avec le théorème 4 de [1], car la contrainte d'inégalité sur la variable continue est toujours active. L'implémentation 2-block est réalisée en posant ``three_block=False``, et converge vers une solution possible mais non optimale.
id_id: 3-ADMM-H dibalut dalam kelas ` ` ADMMParameters ` `. Nilai parameter yang disesuaikan dapat diatur sebagai argumen dari kelas. Dalam contoh ini, parameter :math:`\rho, \beta ` diinisialisasi untuk :math:` 1001 ` dan :math:` 1000 `, secara berturut-turut. Penalti dari` ` factor_c ` ` sesuai batasan kesamaan :math:` Gx = b ` ditentukan pada :math:` 900 `. Toleransi ` ` tol ` ` untuk konvergensi residual ditentukan pada ` `1.e-6 ` `. Dalam hal ini, implementasi 3 blok dijamin konvergen untuk Teorema 4 dari [1], karena batasan ketidaksamaan dengan variabel kontinu selalu aktif. Implementasi 2 blok ini dapat dijalankan dengan menetapkan ` ` three_block=False ` `, dan secara praktis menjadi konvergen ke solusi yang mungkin namun tidak optimal.

source: Calling 3-ADMM-H algorithm
es_un: Llamando al algoritmo 3-ADMM-H
fr_fr: Appel de l'algorithme 3-ADMM-H
id_id: Memanggil algoritma 3-ADMM-H
