Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/optimization/5_admm_optimizer.po
Languages: es_un, fr_fr, id_id

source: To invoke the 3-ADMM-H algorithm, an instance of the ``ADMMOptimizer`` class needs to be created. This takes ADMM-specific parameters and the subproblem optimizers separately into the constructor. The solution returned is an instance of ``OptimizationResult`` class.
es_un: Para invocar el algoritmo 3-ADMM-H, es necesario crear una instancia de la clase ``ADMMOptimizer``. Esto toma los parámetros específicos de ADMM y los optimizadores de subproblemas por separado en el constructor. La solución devuelta es una instancia de la clase ``OptimizationResult``.
fr_fr: Pour invoquer l'algorithme 3-ADMM-H, une instance de la classe ``ADMMOptimizer`` doit être créée. Cette instance accepte des paramètres spécifiques ADMM et les différents optimiseurs dans un constructeur. La solution retournée est une instance de la classe ``OptimizationResult``.
id_id: Untuk memanggil algoritma 3-ADMM-H, sebuah instansi dari kelas ` ` ADMMOptimizer ` ` perlu dibuat. Aksi ini mengambil parameter-parameter spesifik ADMM dan pengoptimasi submasalah secara terpisah ke konstruktor. Solusi yang dikembalikan adalah instance dari kelas ` ` OptimizationResult ` `.

source: Classical Solver Result
es_un: Resultado del Solucionador Clásico
fr_fr: Résultats avec un solveur classique
id_id: Hasil Solver Klasik

source: The 3-ADMM-H solution can be then printed and visualized. The ``x`` attribute of the solution contains respectively, the values of the binary decision variables and the values of the continuous decision variables. The ``fval`` is the objective value of the solution.
es_un: A continuación, se puede imprimir y visualizar la solución 3-ADMM-H. El atributo ``x`` de la solución contiene, respectivamente, los valores de las variables de decisión binarias y los valores de las variables de decisión continuas. El ``fval`` es el valor objetivo de la solución.
fr_fr: La solution 3-ADMM-H peut alors être imprimée et visualisée. L'attribut ``x`` de la solution contient respectivement, les valeurs des variables binaires de décision et les valeurs des variables de décision continues. L'objet ``fval`` est une valeur objective de la solution.
id_id: Solusi 3-ADMM-H dapat kemudian dicetak dan divisualisasikan. Atribut ` ` x ` ` dari solusi yang mengandung secara berturut-turut, nilai-nilai dari variabel keputusan biner dan nilai-nilai dari variabel keputusan yang kontinu. ` ` fval ` ` adalah nilai objektif dari solusi.

source: Solution statistics can be accessed in the ``state`` field and visualized. We here display the convergence of 3-ADMM-H, in terms of primal residuals.
es_un: Se puede acceder a las estadísticas de la solución en el campo ``state`` y visualizarlas. Aquí mostramos la convergencia de 3-ADMM-H, en términos de residuos primarios.
fr_fr: Les statistiques sur la solution sont accessibles via le champ ``state``. On affiche ici la convergence du 3-ADMM-H, en termes de résidus primaires.
id_id: Statistik solusi dapat diakses dalam field ` ` state ` ` dan divisualisasikan. Kita di sini menampilkan konvergensi 3-ADMM-H, dalam hal residual primal.

source: Quantum Solution
es_un: Solución Cuántica
fr_fr: Solution Quantique
id_id: Solusi Kuantum

source: We now solve the same optimization problem with QAOA as QUBO optimizer, running on simulated quantum device. First, one need to select the classical optimizer of the eigensolver QAOA. Then, the simulation backend is set. Finally, the eigensolver is wrapped into the ``MinimumEigenOptimizer`` class. A new instance of ``ADMMOptimizer`` is populated with QAOA as QUBO optimizer.
es_un: Ahora resolvemos el mismo problema de optimización con QAOA como el optimizador QUBO, ejecutándolo en un dispositivo cuántico simulado. Primero, es necesario seleccionar el optimizador clásico del eigensolucionador QAOA. Luego, se configura el backend de simulación. Finalmente, el eigensolucionador se incluye en la clase ``MinimumEigenOptimizer``. Una nueva instancia de ``ADMMOptimizer`` se completa con QAOA como optimizador QUBO.
fr_fr: Nous allons maintenant résoudre le même problème d'optimisation avec QAOA comme optimiseur QUBO via une exécution sur un système quantique simulé. Nous devons, en premier, sélectionner l'optimiseur classique eigensolver QAOA. Ensuite le backend de simulation doit être choisi. Enfin, le eigensolver est associé à la classe ``MinimumEigenOptimizer``. Une nouvelle instance de ``ADMMOptimizer`` est créée avec QAOA comme optimiseur QUBO.
id_id: Kita sekarang memecahkan masalah optimisasi yang sama dengan QAOA sebagai pengoptimasi QUBO, yang berjalan pada perangkat kuantum tersimulasi. Pertama, seseorang perlu memilih pengoptimasi klasik dari eigensolver QAOA. Kemudian, simulasi backend ditentukan. Akhirnya, eigensolver dibalut ke dalam kelas ` ` MinimumEigenOptimizer ` `. Sebuah mesin virtual baru dari ` ` ADMMOptimizer ` ` dihuni oleh QAOA sebagai optimizer QUBO.

source: Quantum Solver Results
es_un: Resultados del Solucionador Cuántico
fr_fr: Résultats du solveur quantique
id_id: Hasil Solver Kuantum

source: Here we present the results obtained from the quantum solver. As in the example above ``x`` stands for the solution, the ``fval`` is for objective value.
es_un: A continuación presentamos los resultados obtenidos del solucionador cuántico. Como en el ejemplo anterior, ``x`` representa la solución, el ``fval`` es el valor objetivo.
fr_fr: Nous présentons ici les résultats obtenus avec le solveur quantique. Comme précédemment, `x` est la solution, `fval` est une valeur objective de la solution.
id_id: Di sini kita menyajikan hasil yang diperoleh dari solver kuantum. Seperti pada contoh di atas, ` ` x ` ` untuk solusi, ` ` fval ` ` untuk nilai objektif.

source: For each ADMM iterations ($k = 1, 2, :nbsphinx-math:`\ldots`, $) until termination:
fr_fr: Pour chaque itération ADMM ($k = 1, 2, :nbsphinx-math:`\ldots`, $) et jusqu'à la fin :
