Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/optimization/7_examples_vehicle_routing.po
Languages: fr_fr, ja_jp

source: First, we derive the solution from the ground up, using a class QuantumOptimizer that encodes the quantum approach to solve the problem and then we instantiate it and solve it. We define the following methods inside the class: - ``binary_representation`` : encodes the problem :math:`(M)` into a QP terms (that’s basically linear algebra); - ``construct_problem`` : constructs a QUBO optimization problem as an instance of ``QuadraticProgram``; - ``solve_problem``: solves the problem :math:`(M)` constructed at the previous step via ``MinimunEigenOptimizer`` by using VQE with default parameters;
ja_jp: まず、問題を解決するために量子アプローチをエンコードするクラスQuantumOptimizerを使用して、ゼロからソリューションを導き出し、次にそれをインスタンス化して解決します。 クラス内で次のメソッドを定義します。-- ``binary_representation`` ：問題 :math:`(M)` をQP項 (基本的に線形代数) にエンコードします。 -- ``construct_problem`` ： ``QuadraticProgram`` のインスタンスとしてQUBO最適化問題を構築します。 -- ``solve_problem`` ：デフォルトのパラメーターでVQEを使用することにより、 ``MinimunEigenOptimizer`` を介して前のステップで構築された問題 :math:`(M)` を解決します。

source: Step 1
fr_fr: Étape 1
ja_jp: ステップ 1

source: Instantiate the quantum optimizer class with parameters: - the instance; - the number of nodes and vehicles ``n`` and ``K``;
fr_fr: Instancions la classe d'optimiseur quantique avec les paramètres suivants : - l'instance ; - le nombre de nœuds et de véhicules ``n`` et ``K`` ;
ja_jp: パラメータを使用して量子オプティマイザクラスをインスタンス化します。 - インスタンス。 - ノードと車両の数 ``n`` と ``K`` ;

source: Step 2
fr_fr: Étape 2
ja_jp: ステップ２

source: Encode the problem as a binary formulation (IH-QP).
fr_fr: Encodons le problème en tant que formulation binaire (IH-QP).
ja_jp: 問題をバイナリ定式化（IH-QP）としてエンコードします。

source: Sanity check: make sure that the binary formulation in the quantum optimizer is correct (i.e., yields the same cost given the same solution).
fr_fr: Vérification : assurons-nous que la formulation binaire dans l'optimiseur quantique est correcte (c'est-à-dire qu'elle génère le même coût compte tenu de la même solution).
ja_jp: サニティチェック：量子オプティマイザのバイナリ定式化が正しいことを確認します（つまり、同じソリューションで同じコストが得られることを確認します）。

source: Step 3
fr_fr: Étape 3
ja_jp: ステップ３

source: Encode the problem as an instance of ``QuadraticProgram``.
fr_fr: Encodons le problème sous la forme d'une instance de ``QuadraticProgram``.
ja_jp: ``QuadraticProgram`` のインスタンスとして問題をエンコードします。

source: Step 4
fr_fr: Étape 4
ja_jp: ステップ 4

source: Solve the problem via ``MinimumEigenOptimizer`` from the optimization stack. N.B. Depending on the number of qubits, the state-vector simulation can take a while; for example with 12 qubits, it takes more than 12 hours. Logging is useful to see what the program is doing.
fr_fr: Résolvons le problème via ``MinimumEigenOptimizer`` depuis la pile d'optimisation. N.B. Selon le nombre de qubits, la simulation par vecteur d'état peut prendre un certain temps ; par exemple avec 12 qubits, elle prend plus de 12 heures. La journalisation est donc utile pour voir ce que fait le programme.
ja_jp: 最適化スタックから ``MinimumEigenOptimizer`` を介して問題を解決します。 N.B. 量子ビットの数によっては、状態ベクトルシミュレーションに時間がかかる場合があります。 たとえば、12量子ビットの場合、12時間以上かかります。 ロギングは、プログラムが何をしているかを確認するのに役立ちます。

source: Step 5
fr_fr: Étape 5
ja_jp: ステップ5

source: Visualize the solution
fr_fr: Visualisons la solution
ja_jp: ソリューションを視覚化する

source: The plots present the depot with a star and the selected routes for the vehicles with arrows. Note that in this particular case, we can find the optimal solution of the QP formulation, which happens to coincide with the optimal solution of the ILP.
fr_fr: Les graphique présente le dépôt avec une étoile et les routes sélectionnées pour les véhicules avec des flèches. Notez que dans ce cas particulier, nous pouvons trouver la solution optimale de la formulation QP, qui se trouve coïncider avec la solution optimale de l'ILP.
ja_jp: プロットには、デポに星が表示され、車両用に選択されたルートが矢印で表示されます。 この特定のケースでは、QP定式化の最適解を見つけることができます。これはたまたまILPの最適解と一致します。

source: Keep in mind that VQE is an heuristic working on the QP formulation of the Ising Hamiltonian, though. For suitable choices of A, local optima of the QP formulation will be feasible solutions to the ILP. While for some small instances, as above, we can find optimal solutions of the QP formulation which coincide with optima of the ILP, finding optimal solutions of the ILP is harder than finding local optima of the QP formulation, in general, which in turn is harder than finding feasible solutions of the ILP. Even within the VQE, one may provide stronger guarantees, for specific variational forms (trial wave functions).
fr_fr: Gardez à l'esprit que VQE est un travail heuristique sur la formulation QP du hamiltonien Ising. Pour les choix appropriés de A, l'optimisation locale de la formulation QP sera une solution réalisable pour l'ILP. Bien que pour des instances de petite taille, comme ci-dessus, nous pouvons trouver des solutions optimales de la formulation QP qui coïncident avec optimum de l'ILP, il est plus difficile de trouver des solutions optimales de l'ILP que de trouver des optimum locaux de la formulation QP, en général, ce qui à son tour est plus difficile que de trouver des solutions réalisables de l'ILP. Ainsi, dans le cadre du VQE, on peut fournir des garanties plus fortes, pour des formes variationnelles spécifiques (fonctions d'onde d'essai).
ja_jp: ただし、VQEはイジングハミルトニアンのQP定式化に取り組んでいるヒューリスティックであることに注意してください。 Aの適切な選択については、QP定式化の局所最適点がILPの実行可能解になります。 いくつかの小さな例では、上記のように、ILPの最適化と一致するQP公式の最適解を見つけることができますが、ILPの最適解を見つけることは、一般にQP公式の局所最適を見つけることよりも困難です。 ILPの実行可能な解決策を見つけるよりも難しい。 VQE内でも、特定の変分形式（試行波動関数）に対してより強力な保証を提供する場合があります。

source: Logistics is a major industry, with some estimates valuing it at USD 8183 billion globally in 2015. Most service providers operate a number of vehicles (e.g., trucks and container ships), a number of depots, where the vehicles are based overnight, and serve a number of client locations with each vehicle during each day. There are many optimization and control problems that consider these parameters. Computationally, the key challenge is how to design routes from depots to a number of client locations and back to the depot, so as to minimize vehicle-miles traveled, time spent, or similar objective functions. In this notebook we formalize an idealized version of the problem and showcase its solution using the quantum approximate optimization approach of Farhi, Goldstone, and Gutman (2014).
fr_fr: Le secteur de la logistique représente une industrie majeure, certaines estimations l'évaluant à 8183 milliards de dollars en 2015. La plupart des fournisseurs de services utilisent un certain nombre de véhicules (par exemple des camions et des porte-conteneurs), un certain nombre de dépôts, où les véhicules sont basés, et desservent chaque jour un certain nombre de destinations avec chaque véhicule. Il existe de nombreux problèmes d'optimisation et de contrôle qui tiennent compte de ces paramètres. Sur le plan informatique, le principal défi consiste à concevoir des routes à partir de dépôts jusqu'à un certain nombre d'emplacements de clients et de retourner au dépôt, de façon à réduire au minimum le nombre de kilomètres parcourus, le temps de parcours, ou des fonctions objectives similaires. Dans ce bloc-notes, nous formalisons une version idéalisée du problème et nous exposons sa solution en utilisant l'approche d'optimisation quantique approximative de Farhi, Goldstone et Gutman (2014).

source: compute the pair-wise distances, travel times, or similar. In our case, we consider the Euclidean distance, "as the crow flies", which is perhaps the simplest possible.
fr_fr: calculer les distances point à point, les temps de trajet (ou équivalent). Dans notre cas, nous considérons la distance euclidienne, "à vol d'oiseau", ce qui est peut-être le plus simple possible.

source: Here, we demonstrate an approach that combines classical and quantum computing steps, following the quantum approximate optimization approach of Farhi, Goldstone, and Gutman (2014). In particular, we use the variational quantum eigensolver (VQE). We stress that given the use of limited depth of the quantum circuits employed (variational forms), it is hard to discuss the speed-up of the algorithm, as the solution obtained is heuristic in nature. At the same time, due to the nature and importance of the target problems, it is worth investigating heuristic approaches, which may be worthwhile for some problem classes.
fr_fr: Dans ce qui suit, nous exposons une approche combinant des étapes d'informatique classique et quantique, en suivant l'approche d'optimisation quantique approximative de Farhi, Goldstone et Gutman (2014). En particulier, nous utilisons l'eigensolver quantique variationnel (VQE). Soulignons que compte tenu du fait que nous utilisons des circuits quantiques de profondeur limitée (formes variationnelles), il est difficile d'évaluer l'accélération apportée par l'algorithme, car la solution obtenue est de nature heuristique. En même temps, en raison de la nature et de l'importance des problèmes ciblés, il est utile d'étudier des approches heuristiques qui peuvent être utiles pour certaines classes de problèmes.

source: First, we derive the solution from the ground up, using a class QuantumOptimizer that encodes the quantum approach to solve the problem and then we instantiate it and solve it. We define the following methods inside the class: - ``binary_representation`` : encodes the problem :math:`(M)` into a QP terms (that's basically linear algebra); - ``construct_problem`` : constructs a QUBO optimization problem as an instance of ``QuadraticProgram``; - ``solve_problem``: solves the problem :math:`(M)` constructed at the previous step via ``MinimunEigenOptimizer`` by using VQE with default parameters;
fr_fr: Tout d'abord, nous construisons la solution en utilisant une classe QuantumOptimizer qui encode l'approche quantique pour résoudre le problème et ensuite nous l'instancions et le résolvons. Nous définissons les méthodes suivantes dans la classe : - ``binary_representation`` : pour encoder le problème :math:`(M)` en termes de QP (il s'agit essentiellement d'algèbre linéaire); - ``construct_problem`` : construit un problème d'optimisation QUBO en tant qu'instance de ``QuadraticProgram`` ; - ``solve_problem`` : résout le problème :math:`(M)` qui a été construit à l'étape précédente via ``MinimunEigenOptimizer`` en utilisant VQE avec des paramètres par défaut ;
