Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/optimization/7_examples_vehicle_routing.po
Languages: fr_fr, ja_jp

source: This page was generated from `tutorials/optimization/7_examples_vehicle_routing.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/optimization/7_examples_vehicle_routing.ipynb`__.
ja_jp: 当ページは `tutorials/optimization/7_examples_vehicle_routing.ipynb`__ から生成されました。

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/7_examples_vehicle_routing.ipynb>`_.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/optimization/7_examples_vehicle_routing.ipynb>`_ でインタラクティブに実行します。

source: *Vehicle Routing*
ja_jp: *配車ルーティング*

source: The Introduction
fr_fr: L'introduction
ja_jp: はじめに

source: Logistics is a major industry, with some estimates valuing it at USD 8183 billion globally in 2015. Most service providers operate a number of vehicles (e.g., trucks and container ships), a number of depots, where the vehicles are based overnight, and serve a number of client locations with each vehicle during each day. There are many optimization and control problems that consider these parameters. Computationally, the key challenge is how to design routes from depots to a number of client locations and back to the depot, so as to minimize vehicle-miles traveled, time spent, or similar objective functions. In this notebook we formalize an idealized version of the problem and showcase its solution using the quantum approximate optimization approach of Farhi, Goldstone, and Gutmann (2014).
ja_jp: ロジスティクスは主要産業であり、2015年には世界全体で8兆1830億米ドルになるという推計もあります。ほとんどのサービスプロバイダーは、多数の車両（トラックやコンテナ船など）、車両が夜間に拠点とする多数のデポを運営しています。 車両は夜間にはデポを拠点とし、毎日、各車両で多くのクライアントの場所にサービスを提供します。 これらのパラメータを考慮する最適化および制御の問題がたくさんあります。 計算上の重要な課題は、デポから多数のクライアントの場所に行ってまたデポに戻るルートをどのように設計すれば、車両の走行距離、費やした時間、またはそれに類する目的関数を最小にすることができるか、ということです。 このノートブックでは、理想化された形の問題を定式化し、Farhi, Goldstone, and Gutman（2014）の量子近似最適化アプローチを使用してその解決策を紹介します。

source: The overall workflow we demonstrate comprises:
fr_fr: Le workflow global que nous allons détailler comprend:
ja_jp: 私たちが示す全体的なワークフローは次のとおりです。

source: establish the client locations. Normally, these would be available ahead of the day of deliveries from a database. In our use case, we generate these randomly.
fr_fr: établir les emplacements des clients à livrer : normalement ceux-ci sont disponibles avant le jour des livraisons dans une base de données. Dans notre cas d'utilisation, nous les générons aléatoirement.
ja_jp: クライアントの場所を確立します。 通常、これらはデータベースからの配信日の前に利用可能です。 私たちのユースケースでは、これらをランダムに生成します。

source: compute the pair-wise distances, travel times, or similar. In our case, we consider the Euclidean distance, “as the crow flies”, which is perhaps the simplest possible.
ja_jp: ペアワイズ距離、移動時間などを計算します。 私たちの場合、「カラスが飛ぶように」ユークリッド距離を考慮します。これはおそらく最も単純な距離です。

source: compute the actual routes. This step is run twice, actually. First, we obtain a reference value by a run of a classical solver (IBM CPLEX) on the classical computer. Second, we run an alternative, hybrid algorithm partly on the quantum computer.
fr_fr: calculer les routes réelles. Cette étape est exécutée deux fois, en fait. Tout d'abord, nous obtenons une valeur de référence par une exécution d'un solveur classique (IBM CPLEX) sur un ordinateur classique. Ensuite, nous avons une alternative, un algorithme hybride en partie sur l'ordinateur quantique.
ja_jp: 実際のルートを計算します。 このステップは、実際には2回実行されます。 最初に、古典的なコンピューターで古典的なソルバー（IBM CPLEX）を実行して参照値を取得します。 次に、量子コンピューターで部分的に代替のハイブリッドアルゴリズムを実行します。

source: visualization of the results. In our case, this is again a simplistic plot.
fr_fr: visualisation des résultats, dans notre cas, il s'agit à nouveau d'un graphique simple.
ja_jp: 結果の視覚化。 私たちの場合、これも単純なプロットです。

source: In the following, we first explain the model, before we proceed with the installation of the pre-requisites and the data loading.
fr_fr: Dans ce qui suit, nous expliquons d'abord le modèle utilisé ci-dessus, avant de procéder à l'installation des pré-requis et au chargement des données.
ja_jp: 以下では、前提条件のインストールとデータのロードに進む前に、まずモデルについて説明します。

source: The Model
fr_fr: Le Modèle
ja_jp: モデル

source: Mathematically speaking, the vehicle routing problem (VRP) is a combinatorial problem, wherein the best routes from a depot to a number of clients and back to the depot are sought, given a number of available vehicles. There are a number of formulations possible, extending a number of formulations of the traveling salesman problem [Applegate et al, 2006]. Here, we present a formulation known as MTZ [Miller, Tucker, Zemlin, 1960].
fr_fr: En termes mathématiques, le problème du routage des véhicules (VRP - vehicle routing problem) est un problème de combinatoire où l'on recherche les meilleurs itinéraires d'un dépôt à un certain nombre de clients et retour, étant donné un certain nombre de véhicules disponibles. Il existe plusieurs formulations possibles qui étendent un certain nombre de formulations du problème du voyageur de commerce [Applegate et al, 2006]. Ici, nous présentons une formulation connue sous le nom de MTZ [Miller, Tucker, Zemlin, 1960].
ja_jp: 数学的に言えば、配車ルート問題（vehicle routing problem、VRP）は組み合わせ問題であり、利用可能な車両の数を考慮して、デポから多数のクライアントに戻り、デポに戻る最適なルートが求められます。 巡回セールスマン問題の多くの定式化を拡張して、可能な多くの定式化があります [Applegate et al, 2006] 。 ここでは、MTZ [Miller, Tucker, Zemlin, 1960] として知られる定式化を紹介します。

source: Let :math:`n` be the number of clients (indexed as :math:`1,\dots,n`), and :math:`K` be the number of available vehicles. Let :math:`x_{ij} = \{0,1\}` be the binary decision variable which, if it is :math:`1`, activates the segment from node :math:`i` to node :math:`j`. The node index runs from :math:`0` to :math:`n`, where :math:`0` is (by convention) the depot. There are twice as many distinct decision variables as edges. For example, in a fully connected graph, there are :math:`n(n+1)` binary decision variables.
fr_fr: Soit :math:`n` s le nombre de clients (indexés par :math:`1, \dots, n`), et :math:`K` le nombre de véhicules disponibles. Soit :math:`x_{ij} = \ { 0,1 \ }` la variable de décision binaire qui, si elle vaut :math:`1`, active le segment du noeud :math:`i` au noeud :math:`j`. L'index du noeud passe de :math:`0` à :math:`n`, où :math:`0` est (par convention) le dépôt. Il existe deux fois plus de variables de décision distinctes que d'arêtes. Par exemple, dans un graphe entièrement connecté, il y a :math:'n(n+1) variables de décision binaires.
ja_jp: :math:`n` をクライアントの数（ :math:`1,\dots,n` としてインデックス付け）、 :math:`K` を利用可能な車両の数とします。 :math:`x_{ij} = \{0,1\}` をバイナリ決定変数とします。これが :math:`1` の場合、ノード :math:`i` からノード :math:`j` へのセグメントをアクティブにします。 ノードインデックスは :math:`0` から :math:`n` まで実行されます。ここで、 :math:`0` は（慣例により）デポです。 エッジの2倍の異なる決定変数があります。 たとえば、完全接続されたグラフには、 :math:`n(n+1)` 個のバイナリ決定変数があります。

source: If two nodes :math:`i` and :math:`j` have a link from :math:`i` to :math:`j`, we write :math:`i \sim j`. We also denote with :math:`\delta(i)^+` the set of nodes to which :math:`i` has a link, i.e., :math:`j \in \delta(i)^+` if and only if :math:`i \sim j`. Similarly, we denote with :math:`\delta(i)^-` the set of nodes which are connected to :math:`i`, in the sense that :math:`j \in \delta(i)^-` if and only if :math:`j \sim i`.
fr_fr: Si deux noeuds :math:`i` et :math:`j` sont liés de :math:`i` à :math:`j`, nous écrivons :math:`i \sim j`. Nous notons également :math:`\delta (i) ^ +` l'ensemble de noeuds avec lesquels le noeud :math:`i` a un lien, c'est-à-dire :math:`j \in \delta (i) ^ +` si et seulement si :math:`i \sim j`. De même, nous notons :math:` \delta (i) ^-` l'ensemble de noeuds qui sont connectés à :math:`i`, dans le sens où :math:`j \in \delta (i) ^-` si et seulement si :math:`j \sim i`.
ja_jp: 2つのノード :math:`i` と :math:`j` に :math:`i` から :math:`j` へのリンクがある場合、 :math:`i \sim j` と記述します。 また、 :math:`i \sim j` の場合に限り、 :math:`i` がリンクしているノードのセットを :math:`\delta(i)^+` で表します。つまり、:math:`j \in \delta(i)^+` です。 同様に、 :math:`j \sim i` の場合に限り、 :math:`j \in \delta(i)^-` という意味で、iに接続されているノードのセットをδ（i）-で表します。

source: In addition, we consider continuous variables, for all nodes :math:`i = 1,\dots, n`, denoted :math:`u_i`. These variables are needed in the MTZ formulation of the problem to eliminate sub-tours between clients.
fr_fr: En outre, nous considérons que les variables continues, pour tous les noeuds :math:`i = 1, \dots, n`, sont notées :math:`u_i`. Ces variables sont nécessaires dans la formulation MTZ du problème pour éliminer les sous-circuits entre clients.
ja_jp: さらに、 :math:`u_i` で表されるすべてのノード :math:`i = 1,\dots, n` について、連続変数を検討します。 これらの変数は、クライアント間のサブツアーを排除するために、問題のMTZ定式化で必要です。

source: The VRP can be formulated as:
fr_fr: Le VRP peut être formulé ainsi :
ja_jp: VRPは以下のように定式化できます:

source: subject to the node-visiting constraint:
fr_fr: sous réserve de la contrainte de visite des dépots :
ja_jp: ノード訪問制約の対象：

source: the depot-visiting constraints:
fr_fr: les contraintes de visite des dépôts :
ja_jp: デポ訪問の制約：

source: and the sub-tour elimination constraints:
fr_fr: et les contraintes d'élimination des sous-circuits :
ja_jp: およびサブツアー除去の制約：

source: In particular, - The cost function is linear in the cost functions and weighs the different arches based on a positive weight :math:`w_{ij}>0` (typically the distance between node :math:`i` and node :math:`j`); - The first set of constraints enforce that from and to every client, only one link is allowed; - The second set of constraints enforce that from and to the depot, exactly :math:`K` links are allowed; - The third set of constraints enforce the sub-tour elimination constraints and are bounds on :math:`u_i`, with :math:`Q>q_j>0`, and :math:`Q,q_i \in \mathbb{R}`.
fr_fr: En particulier, -La fonction de coût est une fonction linéaire des fonctions de coût et prend en compte les différents arcs avec un poids positif :math:`w_{ij}> 0` (généralement il s'agit de la distance entre le noeud :math:`i` et le noeud :math:`j`) ; -Le premier ensemble de contraintes impose qu'un seul lien aille sur chaque client ; -Le deuxième ensemble de contraintes impose que, depuis et vers le dépôt, exactement :math:`K` liens sont autorisés ; -Le troisième ensemble de contraintes applique les contraintes d'élimination des cous-circuits et appliquent les limites sur :math:`u_i`, avec :math:`Q > q_j> 0`, et :math:`Q, q_i \in \mathbb{R}`.
ja_jp: 特に、 - コスト関数はコスト関数で線形であり、正の重み :math:`w_{ij}>0` （通常はノード :math:`i` とノード :math:`j` の間の距離）に基づいてさまざまなアーチの重みを付けます。 - 最初の一連の制約により、すべてのクライアントとの間で、1つのリンクのみが許可されます。 - 制約の2番目のセットは、デポとの間で正確に :math:`K` 個のリンクが許可されることを強制します。 - 制約の3番目のセットは、サブツアー除去制約を適用し、 :math:`Q>q_j>0` 、および :math:`Q,q_i \in \mathbb{R}`の :math:`u_i` の境界です。

source: Classical solution
fr_fr: Solution classique
ja_jp: 古典的なソリューション

source: We can solve the VRP classically, e.g., by using CPLEX. CPLEX uses a branch-and-bound-and-cut method to find an approximate solution of the VRP, which, in this formulation, is a mixed-integer linear program (MILP). For the sake of notation, we pack the decision variables in one vector as
fr_fr: Nous pouvons résoudre le VRP classiquement, par exemple en utilisant CPLEX. Le CPLEX utilise une méthode de branchement et de coupe pour trouver une solution approximative de la VRP, qui, dans cette formulation, est un programme linéaire mixte entier (MILP). Pour des raisons de notation, nous comptons les variables de décision dans un vecteur comme
ja_jp: CPLEXを使用するなどして、VRPを古典的に解決できます。 CPLEXは、branch-and-bound-and-cut 法を使用して、VRPの近似解を見つけます。これは、この定式化では、混合整数線形計画（mixed-integer linear program、MILP）です。 表記のために、決定変数を1つのベクトルに次のようにパックします。

source: wherein :math:`{\bf z} \in \{0,1\}^N`, with :math:`N = n (n+1)`. So the dimension of the problem scales quadratically with the number of nodes. Let us denote the optimal solution by :math:`{\bf z}^*`, and the associated optimal cost :math:`f^*`.
fr_fr: où :math:`{\bf z} \in \{0,1\}^N`, avec :math:`N = n (n+1)`. Ainsi, la dimension du problème varie de façon quadratique avec le nombre de nœuds. Désignons la solution optimale de :math:`{\bf z}^*`, et le coût optimal associé :math:`f^*`.
ja_jp: ここでは、 :math:`{\bf z} \in \{0,1\}^N` 、 :math:`N = n (n+1)` です。 したがって、問題の次元はノードの数に比例して二次関数的にスケーリングします。 最適解を :math:`{\bf z}^*` で表し、関連する最適コストを :math:`f^*` で表します。

source: Quantum solution
fr_fr: Solution Quantique
ja_jp: 量子ソリューション

source: Here, we demonstrate an approach that combines classical and quantum computing steps, following the quantum approximate optimization approach of Farhi, Goldstone, and Gutmann (2014). In particular, we use the variational quantum eigensolver (VQE). We stress that given the use of limited depth of the quantum circuits employed (variational forms), it is hard to discuss the speed-up of the algorithm, as the solution obtained is heuristic in nature. At the same time, due to the nature and importance of the target problems, it is worth investigating heuristic approaches, which may be worthwhile for some problem classes.
ja_jp: ここでは、Farhi, Goldstone, and Gutman（2014）の量子近似最適化アプローチに従って、古典的な計算ステップと量子的な計算ステップを組み合わせたアプローチを示します。 特に、変分量子固有値ソルバー（variational quantum eigensolver、VQE）を使用します。 強調しておきたいのは、使用できる量子回路の深さが限られていること（変分形式）を考えると、アルゴリズムの高速化について議論するのは難しいということです。というのは、得られる解は本質的にヒューリスティックなものとなるからです。 同時に、対象となる問題の性質と重要性のため、ヒューリスティックなアプローチについて調べるのは価値のあることです。いくつかの問題クラスではこれが有用でしょう。

source: Following [5], the algorithm can be summarized as follows: - Preparation steps: - Transform the combinatorial problem into a binary polynomial optimization problem with equality constraints only; - Map the resulting problem into an Ising Hamiltonian (:math:`H`) for variables :math:`{\bf z}` and basis :math:`Z`, via penalty methods if necessary; - Choose the depth of the quantum circuit :math:`m`. Note that the depth can be modified adaptively. - Choose a set of controls :math:`\theta` and make a trial function :math:`\big|\psi(\boldsymbol\theta)\rangle`, built using a quantum circuit made of C-Phase gates and single-qubit Y rotations, parameterized by the components of :math:`\boldsymbol\theta`.
fr_fr: D'après [5], l'algorithme peut être résumé comme suit: -Etapes de préparation: - Transformation du problème combinatoire en un problème d'optimisation polynomiale binaire avec des contraintes d'égalité uniquement ;- Mapping du problème résultant dans un hamiltonien Ising (:math:`H`) pour les variables :math:`{ \bf z }` et la base :math:`Z`, via des méthodes de pénalité si nécessaire ; -Choix de la profondeur du circuit quantique :math:`m`. Notez que la profondeur peut être modifiée de façon adaptative. - Choix d'un ensemble de commandes :math:`\theta` et construction d'une fonction d'essai :math:`\big | \psi (\boldsymbol\theta)\rangle`, à l'aide d'un circuit quantique fait de portes C-Phase et de rotations sur un seul qubit selon Y, paramétrées par les composants de :math:` \boldsymbol\theta `.
ja_jp: [5] に従い、アルゴリズムは次のように要約できます。 - 準備手順： - 組み合わせ問題を等式制約のみのバイナリ多項式最適化問題に変換します。 - 必要に応じてペナルティ法を使用して、結果の問題を変数 :math:`{\bf z}` と基底 :math:`Z` のイジングハミルトニアン（ :math:`H` ）にマッピングします。 - 量子回路の深さ :math:`m` を選択します。 深さは適応的に変更できることに注意してください。 - コントロール :math:`\theta` のセットを選択し、 :math:`\boldsymbol\theta` の成分によってパラメータ化された制御位相ゲートと単一量子ビットY回転で構成される量子回路を使用して構築された試行関数 :math:`\big|\psi(\boldsymbol\theta)\rangle` を作成します。

source: Algorithm steps:
fr_fr: Etapes de l'algorithme:
ja_jp: アルゴリズムの手順：

source: Evaluate :math:`C(\boldsymbol\theta) = \langle\psi(\boldsymbol\theta)\big|H\big|\psi(\boldsymbol\theta)\rangle` by sampling the outcome of the circuit in the Z-basis and adding the expectation values of the individual Ising terms together. In general, different control points around :math:`\boldsymbol\theta` have to be estimated, depending on the classical optimizer chosen.
fr_fr: Évaluer :math:`C( \boldsymbol\theta) = \langle\psi (\boldsymbol\theta) \big | H \big | \psi (\boldsymbol\theta)\rangle` en échantillonant le résultat du circuit selon la base Z et en additionnant les valeurs d'espérance des différent termes d'Ising. En général, différents points de contrôle autour de :math:` \boldsymbol\theta doivent être estimés, en fonction de l'optimiseur classique choisi.
ja_jp: Zベースで回路の結果をサンプリングし、個々のIsing項の期待値を合計して、 :math:`C(\boldsymbol\theta) = \langle\psi(\boldsymbol\theta)\big|H\big|\psi(\boldsymbol\theta)\rangle` を評価します。 一般に、選択した古典的なオプティマイザに応じて、 :math:`\boldsymbol\theta` 周辺のさまざまな制御点を推定する必要があります。

source: Use a classical optimizer to choose a new set of controls.
fr_fr: Utiliser un optimiseur classique pour choisir un nouvel ensemble de contrôles.
ja_jp: 従来のオプティマイザを使用して、新しいコントロールのセットを選択します。

source: Continue until :math:`C(\boldsymbol\theta)` reaches a minimum, close enough to the solution :math:`\boldsymbol\theta^*`.
fr_fr: Continuer jusqu'à ce que :math:`C(\boldsymbol\theta)` atteigne un minimum, assez proche de la solution :math:`\boldsymbol\theta^*`.
ja_jp: :math:`C(\boldsymbol\theta)` が最小値に達するまで続け、解 :math:`\boldsymbol\theta^*` に十分に近づけます。

source: Use the last :math:`\boldsymbol\theta` to generate a final set of samples from the distribution :math:`\Big|\langle z_i\big|\psi(\boldsymbol\theta)\rangle\Big|^2\;\forall i` to obtain the answer.
fr_fr: Utiliser le dernier :math:`\boldsymbol\thet` pour générer un ensemble final d'échantillons à partir de la distribution :math:`\Big|\langle z_i\big|\psi(\boldsymbol\theta)\rangle\Big|^2\; a forall i` afin d'obtenir la réponse.
ja_jp: 最後の :math:`\boldsymbol\theta` を使用して、分布 :math:`\Big|\langle z_i\big|\psi(\boldsymbol\theta)\rangle\Big|^2\;\forall i` からサンプルの最終セットを生成し、答えを取得します。

source: There are many parameters throughout, notably the choice of the trial wavefunction. Below, we consider:
fr_fr: Il existe de nombreux paramètres, notamment le choix de la fonction d'onde de l'essai. Ci-dessous, nous considérons:
ja_jp: 全体を通して多くのパラメータがあり、特に試行波動関数の選択があります。 以下では、次を検討します。

source: where :math:`U_\mathrm{entangler}` is a collection of C-Phase gates (fully-entangling gates), and :math:`U_\mathrm{single}(\theta) = \prod_{i=1}^N Y(\theta_{i})`, where :math:`N` is the number of qubits and :math:`m` is the depth of the quantum circuit.
fr_fr: où :math:`U_\mathrm{entangler}` est un ensemble de portes C-Phase (portes d'intrication maximale), :math:`U_\mathrm{single}(\theta) = \prod_{i=1}^N Y(\theta_{i})`, où :math:`N` est le nombre de qubits et :math:`m` est la profondeur du circuit quantique.
ja_jp: ここで、 :math:`U_\mathrm{entangler}` は制御位相ゲート（完全にエンタングルしたゲート）の集合であり、 :math:`U_\mathrm{single}(\theta) = \prod_{i=1}^N Y(\theta_{i})` です。ここで、 :math:`N` は量子ビットの数、 :math:`m` は量子回路の深さです。

source: Construct the Ising Hamiltonian
fr_fr: Construction de l'hamiltonien Ising
ja_jp: イジングハミルトニアンを構築する

source: From :math:`VRP` one can construct a binary polynomial optimization with equality constraints only by considering cases in which :math:`K=n-1`. In these cases the sub-tour elimination constraints are not necessary and the problem is only on the variable :math:`{\bf z}`. In particular, we can write an augmented Lagrangian as
fr_fr: A partir de :math:` VRP ` on peut construire une optimisation polynomiale binaire avec des contraintes d'égalité en considérant seulement les cas pour lesquels :math:`K=n-1`. Dans ces cas, les contraintes d'élimination de sous-circuits ne sont pas nécessaires et le problème ne dépend que de la variable :math:` { \bf z } `. En particulier, nous pouvons écrire un lagrangien augmenté comme ceci :
ja_jp: :math:`VRP` から、 :math:`K=n-1` の場合を考慮することによってのみ、等式制約を使用して二値多項式最適化を構築できます。 これらの場合、サブツアー除去制約は必要なく、問題は変数 :math:`{\bf z}` にのみあります。 特に、拡張ラグランジュは次のように書くことができます。

source: where :math:`A` is a big enough parameter.
fr_fr: où :math:`A` est un paramètre suffisamment grand.
ja_jp: ここで、 :math:`A` は十分に大きいパラメーターです。

source: From Hamiltonian to QP formulation
fr_fr: Du hamiltonien à la formulation QP
ja_jp: ハミルトニアンからQP定式化へ

source: In the vector :math:`{\bf z}`, and for a complete graph (:math:`\delta(i)^+ = \delta(i)^- = \{0,1,\dots,i-1,i+1,\dots,n\}`), :math:`H` can be written as follows.
fr_fr: Par rapport au vecteur :math:`{ \bf z }`, et pour un graphe complet (:math:` \delta (i) ^ + = \delta (i) ^-= \ { 0 ,1, \dots, i-1,i + 1, \dots, n\ } `), :math:`H` peut être écrit comme suit.
ja_jp: ベクトル :math:`{\bf z}` で、完全グラフ（ :math:`\delta(i)^+ = \delta(i)^- = \{0,1,\dots,i-1,i+1,\dots,n\}` ）の場合、 :math:`H` は次のように記述できます。 。

source: That is:
fr_fr: Il s'agit de:
ja_jp: それは：

source: Where: first term:
fr_fr: Où: premier terme:
ja_jp: ここで：最初の項：

source: Second term:
fr_fr: Deuxième terme:
ja_jp: 第二の項：

source: Third term:
fr_fr: Troisième terme:
ja_jp: 第三の項：

source: The QP formulation of the Ising Hamiltonian is ready for the use of VQE. We will solve the QP using optimization stack available in Qiskit.
fr_fr: La formulation QP du Hamiltonien Ising est prête pour l'utilisation de VQE. Nous allons résoudre le QP en utilisant la pile d'optimisation disponible dans Qiskit.
ja_jp: イジングハミルトニアンのQP定式化はVQEの使用の準備ができています。 Qiskitで利用可能な最適化スタックを使用してQPを解決します。

source: References
fr_fr: Références
ja_jp: 参考文献

source: Initialization
fr_fr: Initialisation
ja_jp: 初期化

source: First of all we load all the packages that we need: - Python 3.6 or greater is required; - CPLEX 12.8 or greater is required for the classical computations; - Latest Qiskit is required for the quantum computations.
fr_fr: Tout d'abord, nous chargeons tous les packages dont nous avons besoin : - Python 3.6 ou supérieur; - CPLEX 12.8 ou supérieur sont requis pour les calculs classiques; - Le dernier niveau de Qiskit est requis pour les calculs quantiques.
ja_jp: まず、必要なすべてのパッケージをロードします。 - Python3.6以降が必要です。 - 従来の計算にはCPLEX12.8以上が必要です。 - 量子計算には最新のQiskitが必要です。

source: We then initialize the variables
fr_fr: Nous initialisons ensuite les variables
ja_jp: 次に、変数を初期化します

source: We define an initializer class that randomly places the nodes in a 2-D plane and computes the distance between them.
fr_fr: Nous définissons une classe d'initialisation qui place aléatoirement les nœuds dans un plan en dimension 2 et calcule la distance entre eux.
ja_jp: ノードを2次元平面にランダムに配置し、ノード間の距離を計算する初期化子クラスを定義します。

source: Classical solution using IBM ILOG CPLEX
ja_jp: IBM ILOGCPLEX を使用した従来のソリューション

source: For a classical solution, we use IBM ILOG CPLEX. CPLEX is able to find the exact solution of this problem. We first define a ClassicalOptimizer class that encodes the problem in a way that CPLEX can solve, and then instantiate the class and solve it.
fr_fr: Pour une solution classique, nous utilisons IBM ILOG CPLEX. CPLEX est capable de trouver la solution exacte pour ce problème. Nous définissons d'abord une classe ClassicalOptimizer qui code le problème d'une manière que CPLEX peut résoudre, puis nous instancions la classe et nous résolvons le problème.
ja_jp: 従来のソリューションでは、IBM ILOGCPLEX を使用します。 CPLEX は、この問題の正確な解決策を見つけることができます。 まず、CPLEX が解決できる方法で問題をエンコードする ClassicalOptimizer クラスを定義し、次にクラスをインスタンス化して解決します。

source: If you have CPLEX, the solution shows the depot with a star and the selected routes for the vehicles with arrows.
fr_fr: Si vous avez CPLEX, la solution marque le dépôt avec une étoile et les routes sélectionnées pour les véhicules avec des flèches.
ja_jp: CPLEXを使用している場合、ソリューションには星付きのデポと矢印付きの車両用に選択されたルートが表示されます。

source: Quantum solution from the ground up
fr_fr: Solution quantique depuis le début
ja_jp: ゼロからの量子ソリューション

source: For the quantum solution, we use Qiskit.
fr_fr: Pour la solution quantique, nous utilisons Qiskit.
ja_jp: 量子ソリューションには、Qiskitを使用します。
