Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/01_electronic_structure.po
Languages: bn_bn, de_de, es_un, it_it, ja, ko, ml_in, ru_ru, vi_vn

source: To learn more about the basis of your problem, please refer to the tutorial on the ```BasisTransformer`` <05_problem_transformers.ipynb>`__.
es_un: Para obtener más información sobre la base de tu problema, consulta el tutorial sobre ```BasisTransformer`` <05_problem_transformers.ipynb>`__.
ja: 問題の基礎について詳しくは、```BasisTransformer`` <05_problem_transformers.ipynb>`__ のチュートリアルを参照してください。
ko: 당신의 문제의 기초에 대해 자세히 알아보려면 ```BasisTransformer`` <05_problem_transformers.ipynb>` 튜토리얼을 참고하면 된다.

source: Additional observables
es_un: Observables adicionales
ja: 追加の観測量
ko: 추가적인 observables

source: The ``ElectronicStructureProblem`` also contains additional operator factories, which will generate observables to be evaluated at the ground- and excited-states at the end of your computation.
es_un: El ``ElectronicStructureProblem`` también contiene fábricas de operadores adicionales, que generarán observables para ser evaluados en los estados fundamental y excitado al final de tu cálculo.
ja: ``ElectronicStructureProblem`` には追加の演算子ファクトリーも含まれており、計算の最後に基底および励起状態で評価される観測データが生成されます。
ko: ``ElectronicStructureProblem`` 에는 연산이 끝날 때 바닥 상태 및 들뜬 상태에서 분석할 observables를 생성하는 연산자 공장도 추가적으로 포함한다.

source: For more information about these properties, please refer to `their tutorial <09_properties.ipynb>`__.
es_un: Para obtener más información sobre estas propiedades, consulta `su tutorial <09_properties.ipynb>`__.
ja: これらのプロパティの詳細については、 `こちらのチュートリアル <09_properties.ipynb>`__ を参照してください。
ko: 이러한 특성에 대한 자세한 정보는 `해당 튜토리얼 <09_properties.ipynb>` 에 있다.

source: Solving the ``ElectronicStructureProblem``
es_un: Resolviendo el ``ElectronicStructureProblem``
ja: ``ElectronicStructureProblem`` の解決
ko: ``ElectronicStructureProblem`` 풀기

source: In the following, we will compute the ground-state of our problem instance. To learn more about the individual components that go into the ``GroundStateSolver``, please refer to the `ground state tutorial <./03_ground_state_solvers.ipynb>`__.
es_un: A continuación, calcularemos el estado fundamental de nuestra instancia del problema. Para obtener más información sobre los componentes individuales que se incluyen en ``GroundStateSolver``, consulta el `tutorial de estado fundamental <./03_ground_state_solvers.ipynb>`__.
ja: 以下では、我々の問題インスタンスの基底状態を計算します。 ``GroundStateSolver`` に入る個々のコンポーネントの詳細については、 `基底状態チュートリアル <./03_ground_state_solvers.ipynb>`__ を参照してください。
ko: 아래에서는 우리의 문제 인스턴스의 바닥 상태를 계산한다. ``GroundStateSolver`` 에 포함되는 개별 구성 요소에 대한 자세한 내용은 `ground state tutorial <./03_ground_state_solvers.ipynb>`__에 있다.

source: Running this driver, will yield an ``ElectronicStructureProblem``, Qiskit Nature’s representation of the electronic structure problem which we are interested in solving. For further information about the drivers see https://qiskit.org/documentation/nature/apidocs/qiskit_nature.second_q.drivers.html
ja: このドライバーを実行すると、QisKit Natureの解析に興味のある電子構造問題を表現する ``ElectronicStructureProblem`` が生成されます。 ドライバーの詳細については、https://qiskit.org/documentation/nature/apidocs/qiskit_nature.second_q.drivers.html を参照してください。

source: Gaussian
de_de: Gaußsche Normalverteilung
ko: 가우시안

source: Therefore, one can first tackle the electronic problem with nuclear coordinate entering only as parameters. The energy levels of the electrons in the molecule can be found by solving the non-relativistic time independent Schroedinger equation,
bn_bn: সুতরাং, ইলেকট্রনিক পর্যায়ে সমস্যাগুলি প্রথমে নিউক্লিয়ার স্থানাংককে প্যারামিটার হিসেবে প্রবেশ করিয়ে সমাধান করা যেতে পারে। নন-আপেক্ষিক সময় নিরপেক্ষ শ্রোডিঞ্জার সমীকরণের সাহায্যে অণুর ইলেকট্রনের শক্তিস্তর নির্ণয় করা যেতে পারে,
de_de: Daher kann man zunächst das Problem der Elektronen lösen, wobei die Koordinaten der Kerne nur als Parameter eingehen. Die Energielevel der Elektronen im Molekül sind durch die Lösung der nicht relativistischen zeitunabhängigen Schrödinger-Gleichung zu finden
it_it: Pertanto, si può prima affrontare il problema elettronico con l'inserimento di coordinate nucleari solo come parametri. I livelli di energia degli elettroni nella molecola possono essere trovati risolvendo l'equazione Schroedinger indipendente dal tempo non relativistico,
ml_in: അതായത്, ഇലക്ട്രോണിന്റെ ഉുർജ്ജം കണ്ടെത്താൻ ന്യൂക്ലിയസന്റെ കോർഡിനേറ്റുകൾ പരാമീറ്ററുകളായി മാത്രം ഉപയോഗിചാൽ മതി. ഇതിനായി, താഴെ കാണുന്ന ഷ്രോഡിംഗർ ഇക്വേഷൻ ഉബയോക്കിക്യാവുനതാണ്. ഈ ഈക്വേഷൻ ആപേക്ഷികമല്ലാത്തതും സമയ ഭന്തിതമലാതത്തുമാണ്.
ru_ru: Как следствие, сначала можно решить задачу, используя координаты ядер только в качестве параметров. А энергетические уровни электронов могут быть найдены путем решения нерелятивистского стационарного уравнения Шредингера,
vi_vn: Từ đó, chúng ta có thể xử lý bài toán của electron với tọa độ của hạt nhân tham gia như các tham số. Các mức năng lượng của các electron trong phân tử có thể được tìm thấy bằng cách giải phương trình Schroedinger độc lập thời gian không tương đối tính,

source: The Hartree-Fock initial state
bn_bn: হার্ট্রি-ফক প্রাথমিক মান বা অবস্থা
de_de: Der Hartree-Fock Anfangszustand
it_it: Lo stato iniziale di Hartree-Fock
ml_in: ഹാർട്രീ-ഫോക്ക് ഇനിറ്യ​ൽ സ്റ്റെയ്റ്റ്
ru_ru: Начальное состояние Хартри — Фока
vi_vn: Trạng thái ban đầu Hartree-Fock

source: A good starting point for solving this problem is the Hartree-Fock (HF) method. This method approximates a N-body problem into N one-body problems where each electron evolves in the mean-field of the others. Classically solving the HF equations is efficient and leads to the exact exchange energy but does not include any electron correlation. Therefore, it is usually a good starting point to start adding correlation.
bn_bn: এই সমস্যা সমাধানের জন্যে একটি ভালো সূচনা পদ্ধতি হলো হাট্রি-ফক (এইচ.এফ.) পদ্ধতি। এই পদ্ধতি একটি N-বস্তু সমস্যাকে N সংখ্যক এক-বস্তু সমস্যায় অনুমিত করে যেখানে প্রতিটি ইলেকট্রন অপরের গড়-ক্ষেত্র (mean-field) এ প্রদক্ষিণ করে। প্রথাগতভাবে (ক্লাসিক্যালি) এইচ-এফ সমীকরণ সমাধান করা উপযোগী এবং একেবারে এক্সচেঞ্জ শক্তির মান দেয়, কিন্তু কোনো ইলেকট্রন কোরিলেশনকে অন্তর্ভুক্ত করে না। তাই, কোরিলেশন যোগ করা শুরু করার জন্য সাধারণত এটি একটি ভালো সুচনাস্থল।
de_de: Ein guter Startpunkt für die Lösung dieses Problems ist die Hartree-Fock (HF) -Methode. Diese Methode approximiert ein N-Körper-Problem mit N Einkörper-Problemen, bei denen sich jedes Elektron im Durchschnittsfeld der andren Elektronen bewegt. Das klassische Lösen der HF-Gleichungen ist effizient und führt zur exakten Austauschenergie, schließt aber Effekte durch Elektronenkorrelationen nicht ein. Daher ist es in der Regel ein guter Startpunkt Korrelationen hinzuzufügen.
it_it: Un buon punto di partenza per risolvere questo problema è il metodo Hartree-Fock (HF). Questo metodo approssima un problema N-corpi in N problemi di un corpo unico in cui ogni elettrone si evolve nel campo medio degli altri. Risolvere classicamente le equazioni HF è efficiente e porta all'energia di scambio esatta, ma non include alcuna correlazione elettronica. Pertanto, di solito è un buon punto di partenza per iniziare ad aggiungere la correlazione.
ml_in: ഇതിനു ഉത്തരം കണ്ടുപിടിക്കാനുള്ള ഒരു നല്ല മാർഗ്ഗം ഹാർട്രീ-ഫോക്ക് മെത്തേട് ആണ്ണ്. ഈ രീതിയിൽ N- ബോഡിക​ൾ (കണങ്ങൾ) ഉള്ള ഒരു സിസ്റ്റത്തിന്റെ മൊത്തം എനെർജി കണ്ടെത്താനായി, ഓരൊ ഇലക്ട്രോണുകളും മറ്റു ഇലക്ട്രോണുകളുടെ സാമിഭ്യത്തിൽ എഞനെ പെരുമാറുന്നു എനതിന്നെ ആസ്പതമാക്കി കണ്ടെത്തുന്നു. ഇതിന്റെ ഉത്തരം കണ്ടെത്താൻ ക്ലാസിക്കൽ കമ്പ്യൂട്ടർന് കഴിയും. എന്നാൽ ഇവിടെ, ഇലക്ട്രോൺ പരസ്പര ബന്ധം കൊണ്ട് ഉണ്ടാവുന്ന എനെർജി കണകാക്കുന്നില​. അതിനാൽ ഈ സമവാക്ക്യത്തെ അടിസ്താനമാക്കി കൂഡുത​ൽ സമവാക്ക്യഞൾ ഉണ്ടാക്കാം.
ru_ru: Хорошим отправным пунктом для решения нашей задачи является метод Хартри — Фока (ХФ, англ. Hartree-Fock, HF). Это метод сведения многочастичной задачи к одночастичной в предположении, что каждая частица двигается в некотором усреднённом самосогласованном поле, создаваемом всеми остальными частицами системы. Он достаточно эффективен и приводит к точному значению обменной энергии, хотя и не учитывает корреляционную энергию электронов. Поэтому обычно начинают с решения задачи в приближении Хартри — Фока, а затем добавляют корреляционные взаимодействия.
vi_vn: Một cách tiếp cận tốt để giải bài toán này là phương pháp Hartree-Fock (HF). Phương pháp này giúp xấp xỉ một bài toán N-vật thể thành N bài toán đơn-thể mà mỗi electron có thể được khai triển trên trường trung bình của các electron khác. Giải phương trình HF một cách cổ điển đem lại hiệu quả và năng lượng trao đổi chính xác nhưng không chỉ ra được mối tương quan giữa các electron. Do vậy, tốt hơn hết nên thêm các mối liên hệ từ đầu.

source: For further information about the drivers see https://qiskit.org/documentation/nature/apidocs/qiskit_nature.drivers.second_quantization.html
bn_bn: ড্রাইভারগুলির সম্পর্কে আরও তথ্যের জন্য https://qiskit.org/documentation/nature/apidocs/qiskit_nature.drivers.second_quantization.html দেখুন
de_de: Weitere Informationen zu den Treibern finden Sie unter https://qiskit.org/documentation/nature/apidocs/qiskit_nature.drivers.second_quantization.html
ml_in: ഡ്രൈവറുമായി ബന്ധപ്പെട്ട കൂടുതൽ വിവരങ്ങൾക്ക് https://qiskit.org/documentation/nature/apidocs/qiskit_nature.drivers.second_quantization.html സന്ദർശിക്കുക
ru_ru: Дополнительную информацию о классических драйверах можно найти по ссылке https://qiskit.org/documentation/nature/apidocs/qiskit_nature.drivers.second_quantization.html
vi_vn: Để biết thêm thông tin về các driver, xem https://qiskit.org/documentation/nature/apidocs/qiskit_nature.drivers.second_quantization.html

source: The mapping from fermions to qubits
bn_bn: ফার্মিয়ন থেকে কিউবিট এর ম্যাপিং (চিত্রায়ন)
de_de: Die Zuordnung von Fermionen zu Qubits
it_it: La mappatura dai fermioni ai qubit
ml_in: ഫെർമിയോണുകളെ ക്വിബിറ്റിലേക്ക് മാറ്റാൻ
ru_ru: Отображение фермионов на кубиты
vi_vn: Ánh xạ từ hạt Fermi tới qubit

source: The Hamiltonian given in the previous section is expressed in terms of fermionic operators. To encode the problem into the state of a quantum computer, these operators must be mapped to spin operators (indeed the qubits follow spin statistics).
bn_bn: পূর্ববর্তী বিভাগে প্রদত্ত হ্যামিল্টোনিয়ানটি ফার্মিওনিক অপারেটরদের (fermionic operators) সাহায্যে প্রকাশ করা হয়। সমস্যাটি একটি কোয়ান্টাম কম্পিউটারের অবস্থায় সংকেতায়ন(এনকোড) করতে, এই অপারেটরদের অবশ্যই স্পিন অপারেটরদের সাথে চিত্রায়ন(ম্যাপ) করতে হবে (প্রকৃতপক্ষে কিউবিটগুলি স্পিন পরিসংখ্যান অনুসরণ করে)।
de_de: Die im vorhergehenden Abschnitt gegebene Hamiltonian wird in Form von fermionischen Operatoren. Um das Problem in den Zustand eines Quanten-Computers zu kodieren, müssen diese Operatoren Spinoperatoren zugeordnet werden (in der Tat folgen die Qubits der Spin-Statistik).
it_it: L'Hamiltoniana data nella sezione precedente è espressa in termini di operatori fermionici. Per codificare il problema nello stato di un computer quantistico, questi operatori devono essere mappati agli operatori di spin (infatti i qubit seguono le statistiche di spin).
ru_ru: Приведенный в предыдущем разделе гамильтониан записан с помощью фермионных операторов. Для преобразования задачи в вид, подходящий для квантового компьютера, они должны быть отображены в виде спиновых операторов (действительно, кубиты подчиняются спиновой статистике).
vi_vn: Hamiltonian được đưa ra ở phần trước đã được diễn tả theo thuật ngữ của các toán tử hạt Fermi. Để mã hóa bài toán thành trạng thái của một máy tính lượng tử, các toán tử này phải được ánh xạ với các toán tử spin (thực tế các qubit dựa theo các thống kê spin).

source: There exist different mapping types with different properties. Qiskit already supports the following mappings:
de_de: Es gibt verschiedene Zuordnungstypen mit unterschiedlichen Eigenschaften. Qiskit unterstützt bereits die folgenden Zuordnungen:
ru_ru: Существуют разные варианты такого преобразования, обладающие различными свойствами. Сейчас Qiskit поддерживает следующие отображения:
vi_vn: Tồn tại các kiểu ánh xạ khác nhau với các thuộc tính khác nhau. Qiskit đã hỗ trợ các ánh xạ sau:

source: Jordan-Wigner (über das paulische äquivalenzverbot. In The Collected Works of Eugene Paul Wigner (pp. 109-129). Springer, Berlin, Heidelberg (1993)).
ru_ru: Джордана — Вигнера, Jordan-Wigner (über das paulische äquivalenzverbot. In The Collected Works of Eugene Paul Wigner (pp. 109-129). Springer, Berlin, Heidelberg (1993)).

source: Parity (The Journal of chemical physics, 137(22), 224109 (2012))
ru_ru: четности, Parity (The Journal of chemical physics, 137(22), 224109 (2012))

source: Bravyi-Kitaev (Annals of Physics, 298(1), 210-226 (2002))
ru_ru: Бравого — Китаева, Bravyi-Kitaev (Annals of Physics, 298(1), 210-226 (2002))

source: The Jordan-Wigner mapping is particularly interesting as it maps each Spin Orbital to a qubit (as shown on the Figure above).
bn_bn: জর্ডান-উইগনার (Jordan-Wigner) ম্যাপিং (চিত্রায়ন) বিশেষভাবে আকর্ষণীয় কারণ এটি প্রতিটি স্পিন কক্ষপথসমূহ (অরবিটাল)-কে একটি কিউবিটে চিত্রায়ন করে (উপরের চিত্রে যেমন দেখানো হয়েছে)।
de_de: Die Jordan-Wigner-Zuordnung ist besonders interessant, da sie jedem Spin- Orbital ein Qubit zuordnet (wie in der Abbildung oben dargestellt).
it_it: La mappatura di Jordan-Wigner è particolarmente interessante in quanto associa ogni orbitale di spin ad un qubit (come mostrato nella figura sopra).
ml_in: ജോർദാൻ-വിഗ്നർ മാപ്പിംഗ്ന്ന്റെ ( Jordan-Wigner mapping) പ്രെത്യെകത എന്തെന്നാൽ ഇവിടെ ഓരോ സ്പിൻ ഓർബിറ്റൽനെയും വെറെ വെറെ ക്വിബിറ്റായി മേപ്പ് ചെയുന്നു (മുകളിലുള്ള ചിത്രത്തിൽ കാണിച്ചിരിക്കുന്നതുപോലെ).
ru_ru: Особенно интересно отображение Jordan-Wigner, так как оно связывает каждую спин-орбиталь с кубитом (как показано на рисунке выше).
vi_vn: Ánh xạ Jordan-Wigner đặc biệt thú vị bởi nó ánh xạ mỗi Spin Orbital với một qubit (như Hình vẽ bên trên).

source: Here we set up the Electronic Structure Problem to generate the Second quantized operator and a qubit converter that will map it to a qubit operator.
bn_bn: এখানে আমরা দ্বিতীয় কোয়ান্টাইজড অপারেটর এবং একটি কিউবিট পরিবর্তক (কনভার্টার) তৈরি করতে ইলেকট্রনিক স্ট্রাকচার সমস্যা স্থাপন করেছি যা এটিকে একটি কিউবিট অপারেটরের সাথে চিত্রায়ন করবে।
de_de: Hier stellen wir das Problem der elektronischen Struktur auf, um den zweiten quantizierten Operator und einen Qubit-Konverter zu generieren, der einem Qubit-Operator zuordnet wird.
ru_ru: Далее показано, как сформулировать расчет электронной структуры для создания оператора вторичного квантования и преобразователя кубита, которые превратяться в оператор, применяемый к кубиту.
vi_vn: Ở đây chúng ta thiết lập Bài toán Cấu trúc Điện tử để tạo ra Toán tử lượng tủ hóa thứ hai và một bộ chuyển đổi qubit mà sẽ ánh xạ nó với một toán tử qubit.

source: If we now transform this Hamiltonian for the given driver defined above we get our qubit operator:
bn_bn: যদি আমরা এখন এই হ্যামিল্টোনিয়ানকে উপরে বর্ণিত প্রদত্ত ড্রাইভারের জন্য রূপান্তর করি তবে আমরা কিউবিট অপারেটরটি পেতে পারি:
de_de: Wenn wir jetzt diesen Hamiltonian für den angegebenen Treiber transformieren, bekommen wir unseren Qubit Operator:
it_it: Se ora trasformiamo questa Hamiltoniana per il driver definito sopra, otteniamo il nostro operatore qubit:
ml_in: മുകളിലെ ഡ്രൈവർ ഉഭയോകിചു ഹാമിൽട്ടോണിയൻനെ ട്രാസ്ഫോം ചെയ്താൽ ക്വിബിറ്റ് ഒപ്പറേറ്റർ ലഭികുന്നതാണ്:
ru_ru: Если мы теперь трансформируем гамильтониан для упомянутого выше драйвера, мы получим кубитный оператор:
vi_vn: Nếu chúng ta biến đổi Hamiltonian cho trình điều khiển đã cho được xác định bên trên, chúng ta có toán tử qubit:

source: In the minimal (STO-3G) basis set 4 qubits are required. We can reduce the number of qubits by using the Parity mapping, which allows for the removal of 2 qubits by exploiting known symmetries arising from the mapping.
bn_bn: ন্যূনতম (STO-3G) ভিত্তিতে সেট 4 কিউবিট প্রয়োজন। আমরা প্যারিটি ম্যাপিং (চিত্রায়ন) ব্যবহার করে কিউবিট সংখ্যা কমাতে পারি, যা ম্যাপিং থেকে উদ্ভূত পরিচিত প্রতিসাম্যকে কাজে লাগিয়ে 2 কিউবিট অপসারণের অনুমতি দেয়।
de_de: In der Minimalbasis (STO-3G) sind 4 Qubits erforderlich. Wir können die Anzahl der Qubits reduzieren, indem wir das Parity-Mapping verwenden, das die Entfernung von 2 Qubits erlaubt, indem wir bekannte Symmetrien ausnutzen, die sich aus der Zuordnung ergeben.
ru_ru: Минимальный базисный набор (STO-3G) требует четыре кубита. Можно уменьшить это количество в два раза с помощью Parity за счет симметрии, возникающей при отображении.
vi_vn: Trong tập cơ sở tối thiểu (STO-3G) cần 4 qubit. Chúng ta có thể giảm số lượng qubit bằng cách sử dụng ánh xạ Chẵn lẻ (Parity), nó cho phép loại bỏ 2 qubit nhờ việc khai thác tính đối xứng từ ánh xạ.

source: This time only 2 qubits are needed.
bn_bn: এই সময় শুধু ২টি কিউবিট লাগে।
de_de: Dieses Mal sind nur 2 Qubits erforderlich.
it_it: Questa volta sono necessari solo 2 qubit.
ml_in: ഇവിടെ 2 ക്വിബിറ്റിന്റെ ആവിശൃമേ ഉള്ളു.
ru_ru: В этом случае нам потребуется только два кубита.
vi_vn: Lần này chỉ có 2 qubit là cần thiết.

source: Now that the Hamiltonian is ready, it can be used in a quantum algorithm to find information about the electronic structure of the corresponding molecule. Check out our tutorials on Ground State Calculation and Excited States Calculation to learn more about how to do that in Qiskit!
bn_bn: এখন যেহেতু হ্যামিল্টোনিয়ান প্রস্তুত, এটি একটি কোয়ান্টাম অ্যালোগরিদম ব্যবহার করে সংশ্লিষ্ট অণুর বৈদ্যুতিন কাঠামো সম্পর্কে তথ্য খুঁজে পেতে পারে। Qiskit এ কীভাবে এটি করা যায় সে সম্পর্কে আরও জানতে গ্রাউন্ড স্টেট ক্যালকুলেশন এবং এক্সাইটেড স্টেটস ক্যালকুলেশনে আমাদের টিউটোরিয়ালগুলি দেখুন!
de_de: Nun, da der Hamiltonian fertig ist, kann er in einem Quantenalgorithmus verwendet werden, um Informationen über die elektronische Struktur des entsprechenden Moleküls zu finden. Schauen Sie sich unsere Tutorials zur Grundzustandsberechnung und zur Berechnung von angeregten Zuständen an, um mehr darüber zu erfahren, wie Sie das in Qiskit tun können!
it_it: Ora che l'Hamiltoniana è pronta, può essere utilizzata in un algoritmo quantistico per trovare informazioni sulla struttura elettronica della molecola corrispondente. Scopri i nostri tutorial su Ground State Calculation e Excited States Calculation per saperne di più su come usare Qiskit!
ru_ru: Теперь гамильтониан готов и может быть использован в квантовом алгоритме расчета электронных состояний заданной молекулы. Подробную информацию о том, как вычислять энергию основного и возбужденного состояний в Qiskit, вы найдете в дальнейших руководствах.
vi_vn: Bây giờ toán tử Hamilton đã sẵn sàng, nó có thể được sử dụng trong một thuật toán lượng tử để tìm kiếm thông tin về cấu trúc điện tử của một nguyên tử tương ứng. Xem thêm các hướng dẫn của chúng tôi về Tính toán Trạng thái Cơ bản và Tính toán Trạng thái Kích thích để tìm hiểu thêm cách thực hiện chúng trên Qiskit!

source: \mathcal{H}_{\text{el}} |\Psi_{n}\rangle = E_{n} |\Psi_{n}\rangle
de_de: \mathcal{H}_{\text{el}} |\Psi_{n}\rWinkel = E_{n} |\Psi_{n}

source: Qiskit is interfaced with different classical codes which are able to find the HF solutions. Interfacing between Qiskit and the following codes is already available: \* Gaussian \* Psi4 \* PyQuante \* PySCF
it_it: Qiskit è interfacciato con diversi codici classici che sono in grado di trovare le soluzioni HF. È possibile utilizzare Qiskit con questi pacchetti software: \ * Gaussiano \ * Psi4 \ * Pydissea \ * PySCF
ml_in: HF സൊലൂഷന്സ് കണ്ടെത്താനുള്ള​ ക്ലാസിക്കൽ കോഡുകൾ ക്വിസക്കിറ്റിൽ അടങിയിട്ടുണ്ട്. അവ ഇവിടെ ലഭിക്കും:\* Gaussian \* Psi4 \* PyQuante \* PySCF

source: There exist different mapping types with different properties. Qiskit already supports the following mappings: \* The Jordan-Wigner ‘jordan_wigner’ mapping (über das paulische äquivalenzverbot. In The Collected Works of Eugene Paul Wigner (pp. 109-129). Springer, Berlin, Heidelberg (1993)). \* The Parity ‘parity’ (The Journal of chemical physics, 137(22), 224109 (2012)) \* The Bravyi-Kitaev ‘bravyi_kitaev’ (Annals of Physics, 298(1), 210-226 (2002))
it_it: Esistono diversi tipi di mappatura con diverse proprietà. Qiskit supporta già le seguenti mappature: \* The Jordan-Wigner ‘jordan_wigner’ mapping (über das paulische äquivalenzverbot. In The Collected Works of Eugene Paul Wigner (pp. 109-129). Springer, Berlin, Heidelberg (1993)). \* The Parity ‘parity’ (The Journal of chemical physics, 137(22), 224109 (2012)) \* The Bravyi-Kitaev ‘bravyi_kitaev’ (Annals of Physics, 298(1), 210-226 (2002))
ml_in: മാപ്പിംഗനായി പല മാർഗങൾ ഉണ്ട. ഓരോനിനും അതിന്ടേതായ പ്രെത്യെകതക​ൾ ഉണ്ട്. ക്വിസ്കിറ്റിൽ ഇനി പറയുന്ന മാപ്പിംഗുകൾ ലഭ്യമാണ്: \* The Jordan-Wigner ‘jordan_wigner’ mapping (über das paulische äquivalenzverbot. In The Collected Works of Eugene Paul Wigner (pp. 109-129). Springer, Berlin, Heidelberg (1993)). \* The Parity ‘parity’ (The Journal of chemical physics, 137(22), 224109 (2012)) \* The Bravyi-Kitaev ‘bravyi_kitaev’ (Annals of Physics, 298(1), 210-226 (2002))

source: For further information about the drivers see https://qiskit.org/documentation/nature/apidocs/qiskit_nature.drivers.html
it_it: Per ulteriori informazioni sui driver consultare https://qiskit.org/documentation/nature/apidocs/qiskit_nature.drivers.html
