Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/01_electronic_structure.po
Languages: bn_bn, de_de, es_un, it_it, ja, ko, ml_in, ru_ru, vi_vn

source: This page was generated from `docs/tutorials/01_electronic_structure.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/01_electronic_structure.ipynb`__ থেকে বানানো হয়েছে।
de_de: Diese Seite wurde aus ` docs/tutorials/01_electronic_structure.ipynb ` __ generiert.
es_un: Esta página fue generada a partir de `docs/tutorials/01_electronic_structure.ipynb`__.
ja: このページは `docs/tutorials/01_electronic_structure.ipynb`__ から生成されました。
ko: 이 페이지는 `docs/tutorials/01_electronic_structure.ipynb`__ 에서 생성되었다.
ml_in: ഈ പേജ് എടുത്തത് `docs/tutorials/01_electronic_structure.ipynb`__.-ഇൽ നിന്നാണ്.
ru_ru: Страница создана на основе `docs/tutorials/01_electronic_structure.ipynb`__.
vi_vn: Trang này được tạo từ `docs/tutorials/01_electronic_structure.ipynb`__.

source: Electronic structure
bn_bn: ইলেকট্রনিক গঠন
de_de: Elektronische Struktur
es_un: Estructura electrónica
it_it: Struttura elettronica
ja: 電子構造
ko: 전자 구조
ml_in: ഇലക്ട്രോണിക് ഘടന
ru_ru: Электронная структура
vi_vn: Cấu trúc điện tử

source: Introduction
bn_bn: ভূমিকা
de_de: Einführung
es_un: Introducción
ja: はじめに
ko: 소개
ml_in: ആമുഖം
ru_ru: Введение
vi_vn: Giới thiệu

source: The molecular Hamiltonian is
bn_bn: মলিকুলার বা আণবিক হ্যামিল্টোনিয়ান হলো
de_de: Der molekulare Hamiltonian ist
es_un: El Hamiltoniano molecular es
ja: ある分子のハミルトニアンは、以下の数式で表されます。
ko: 분자 해밀톤은
ml_in: ഇതാണ് മോളിക്യൂലാർ ഹാമിൽട്ടനിയൻ
ru_ru: Гамильтониан (оператор полной энергии) молекулы может быть записан в виде
vi_vn: Hamiltonian của phân tử là

source: Because the nuclei are much heavier than the electrons they do not move on the same time scale and therefore, the behavior of nuclei and electrons can be decoupled. This is the Born-Oppenheimer approximation.
bn_bn: যেহেতু ইলেকট্রনের চেয়ে নিউক্লিয়াস বা কেন্দ্র বেশি ভারী, তাই তারা একই সময় স্কেলে স্থানপরিবর্তন করে না। তাই নিউক্লিয়াস এবং ইলেকট্রনের ধর্মকে ডিকাপ্লিং বা পৃথক করা যায়। এটি হল বর্ন-ওপেনহাইমার অনুমান।
de_de: Da die Kerne viel schwerer sind als die Elektronen, bewegen sie sich nicht auf derselben Zeitskala; daher kann das Verhalten von Kernen und Elektronen entkoppelt betrachtet werden. Das ist die Born-Oppenheimer-Näherung.
es_un: Cómo los núcleos son mucho más pesados que los electrones, no se mueven en la misma escala de tiempo, entonces, el comportamiento de los núcleos y los electrones puede estar desacoplado. Esta es la aproximación de Born-Oppenheimer.
ja: 原子核は電子よりも非常に重い質量を有するため、原子核は電子に比べて非常に遅い運動速度となります。したがって、原子核と電子の運動は分離しているとみなして考えることができます。 これはボルン・オッペンハイマー近似と呼ばれています。
ko: 핵들은 동일한 시간 축척으로 이동하지 않는 전자들보다 훨씬 더 무거운 것이기 때문에, 핵들 및 전자들의 거동은 분리될 수 있다. 이것은 Born-Oppenheimer 근사치이다.
ml_in: ന്യൂക്ലിയസ് ഇലക്ട്രോണുകളേക്കാൾ ഭാരമുള്ളതായതിനാൽ അവ വ്യത്യസ്ത ടെെം സ്കെയിലികളിലാണ് പ്രവർത്തിക്കുന്നത്ത്. അതിനാൽ അവരുടെ പ്രോപ്പർട്ടികൾ വ്യത്യസ്തമായി കാണണം. ഇതിനെ ബോൺ-ഓപ്പൺഹൈമർ അപ്രോക്സിമേഷൻ (Born-Oppenheimer approximation) എന്ന് വിളിക്കുന്നു.
ru_ru: Поскольку атомные ядра намного тяжелее электронов, характерные времена изменения их состояний сильно различаются, и можно рассматривать поведение этих систем раздельно. Данное приближение называется приближением Борна — Оппенгеймера (адиабатическим приближением).
vi_vn: Bởi vì các hạt nhân nặng hơn nhiều so với các electron nên chúng không di chuyển trong cùng thang đo thời gian và do đó, trạng thái của hạt nhân và electron có thể tách riêng. Đây được gọi là xấp xỉ Born-Oppenheimer.

source: Therefore, one can first tackle the electronic problem with the nuclear coordinates entering only as parameters. The energy levels of the electrons in the molecule can then be found by solving the non-relativistic time independent Schroedinger equation,
es_un: Por lo tanto, primero se puede abordar el problema electrónico con las coordenadas nucleares ingresándolas solo como parámetros. Los niveles de energía de los electrones en la molécula se pueden encontrar resolviendo la ecuación de Schröedinger no relativista independiente del tiempo,
ja: したがって、まずは核座標を一つの入力パラメーターとして限定的に扱うことで、電子構造を明らかにする問題に取り組むことができます。 分子中の電子のエネルギー・レベルは、非相対論的かつ時間に依存しないシュレーディンガー方程式の求解による導出が可能です。

source: where
bn_bn: যেখানে
de_de: wobei
es_un: donde
it_it: dove
ja: ここで
ko: 여기서
ml_in: എവിടെ
ru_ru: где
vi_vn: trong đó

source: In particular the ground state energy is given by:
bn_bn: মূলত প্রাথমিক অবস্থায় শক্তি প্রাপ্তি হয়ঃ
de_de: Insbesondere ist die Grundzustandsenergie gegeben durch:
es_un: En particular, la energía del estado fundamental está dada por:
it_it: In particolare, l'energia allo stato fondamentale è data da:
ja: 特に、電子の基底状態エネルギーは下記で与えられます。
ko: 특히, 바닥 상태 에너지는 다음과 같다:
ml_in: ഇലക്ട്രോണിന്റെ ഗ്രൗണ്ട് സ്റ്റേറ്റിലെ ഉുർജ്ജം പ്രത്യേകിച്ചും നൽകുന്നത്:
ru_ru: В частности, энергия основного состояния может быть записана как:
vi_vn: Đặc biệt năng lượng ở trạng thái cơ bản được tính như sau:

source: where :math:`\Psi_0` is the ground state of the system.
bn_bn: যেখানে :math:`\Psi_0` সিস্টেমের প্রাথমিক অবস্থা।
de_de: wobei :math:` \Psi_0 ` der Grundzustand des Systems ist.
es_un: donde :math:`\Psi_0` es el estado fundamental del sistema.
it_it: dove :math:`\Psi_0` è lo stato fondamentale del sistema.
ja: ここで :math:`\Psi_0` は、系の基底状態です。
ko: 여기서 :math:`\Psi_0` 는 시스템의 바닥 상태이다.
ml_in: ഇവിടെ :math:`\Psi_0` തന്മാത്രയുടെ ഗ്രൗണ്ട് സ്റ്റേറ്റിനെ സൂജിപിക്കുന്നു.
ru_ru: где :math:`\Psi_0` — волновая функция основного состояния системы.
vi_vn: trong đó :math:`\Psi_0` là trạng thái cơ bản của hệ thống.

source: However, the dimensionality of this problem grows exponentially with the number of degrees of freedom. To tackle this issue we would like to prepare :math:`\Psi_0` on a quantum computer and measure the Hamiltonian expectation value (or :math:`E_0`) directly.
bn_bn: তবুও, এই সমস্যাটির মাত্রা স্বাধীনতার মাত্রা (ডিগ্রিস অফ ফ্রিডম) হারে বৃদ্ধি পায়। এই সমস্যাটি সমাধানের লক্ষ্যে, আমরা কোয়ান্টাম কম্পিউটারে :math:`\Psi_0` তৈরি ও এর মাধ্যমে হ্যামিল্টোনিয় প্রত্যাশিত মানটি (অথবা :math:`E_0`) সরাসরি পরিমাপ করতে পারি।
de_de: Die Dimensionalität dieses Problems wächst jedoch exponentiell mit der Zahl der Freiheitsgrade. Um dieses Problem anzugehen, möchten wir :math:` \Psi_0 ` auf einem Quantencomputer vorbereiten und den Hamiltonian Erwartungswert (oder :math:` E_0 `) direkt messen.
es_un: Sin embargo, la dimensionalidad de este problema crece exponencialmente con el número de grados de libertad. Para abordar este problema nos gustaría preparar :math:`\Psi_0` en una computadora cuántica y medir el valor esperado del Hamiltoniano (o :math:`E_0`) directamente.
it_it: Tuttavia, la dimensione di questo problema cresce in modo esponenziale con il numero di gradi di libertà. Per affrontare questo problema vorremmo preparare :math:`\Psi_0` su un computer quantistico e misurare direttamente il valore hamiltoniano atteso (o :math:`E_0`).
ja: しかし、この問題の有する次元数は、分子/電子の自由度に応じて指数関数的に増大します。そのため、 こうした計算の次元数の増加を押さえるアプローチとして、 :math:`\Psi_0` を量子コンピューター上に用意してハミルトニアンの期待値(または :math:`E_0` )を直接測定する方法が考えられています。
ko: 그러나, 이 문제의 차원은 자유도의 수에 따라 기하급수적으로 증가한다. 이러한 문제를 해결하기 위해 우리는 양자 컴퓨터에 :math:`\Psi_0` 을 준비하고 Hamiltonian 기대값 (또는 :math:`E_0`) 을 직접 측정하고자 한다.
ml_in: ഡിഗ്രിസ് ഓഫ് ഫ്രീഡം കോടുനതിനു അനുസരിച് ഈ ഈക്വേഷന്റെ കാഡിന്യം കൂടും. അതിനാൽ, :math:`\Psi_0-ന്റെയും ഹാമിൽട്ടോണിയൻ (or :math:`E_0`)-ന്റെയും മൂല്യം കണ്ടുപിടിക്കാൻ നാം ക്വാണ്ടം കമ്പ്യൂട്ടർ ഉപയോഗിക്കുന്നു.
ru_ru: Однако размерность этой задачи возрастает экспоненциально с количеством степеней свободы. Для решения этой проблемы на квантовом компьютере необходимо подготовить :math:`\Psi_0` и затем непосредственно измерить ожидаемое значения гамильтониана (:math:`E_0`).
vi_vn: Tuy nhiên, bậc của bài toán này phát triển theo hàm mũ cùng với số bậc tự do. Để giải quyết vấn đề chúng ta cần có :math:`\Psi_0` trên một máy tính lượng tử và đo giá trị kỳ vọng của Hamiltonian (hay :math:`E_0`) một cách trực tiếp.

source: So how do we do that concretely?
bn_bn: তাহলে আমরা এইটা কিভাবে করি?
de_de: Also, wie machen wir das konkret?
es_un: Entonces, ¿cómo lo hacemos concretamente?
it_it: Quindi, come lo facciamo concretamente?
ja: では具体的にはどのようなアプローチなのでしょうか？
ko: 그러면 어떻게 구체적으로 표현할 수 있을까?
ml_in: അപ്പോൾ നിങ്ങൾ അത് പ്രായോഗികമായി എങ്ങനെ ചെയ്യും?
ru_ru: Как же это сделать?
vi_vn: Vậy làm thế nào để chúng ta làm điều đó một cách cụ thể?

source: Starting from the Hartree-Fock solution
es_un: A partir de la solución Hartree-Fock
ja: Hartree-Fock ソリューションからの開始
ko: Hartree-Fock 방법으로 시작하기

source: A good starting point for solving this problem is the Hartree-Fock (HF) method. This method approximates the N-body problem by N one-body problems where each electron evolves in the mean-field of the others. Classically solving the HF equations is efficient and leads to the exact exchange energy but does not include any electron correlation. Therefore, it is usually a good starting point to which to add correlation.
es_un: Un buen punto de partida para resolver este problema es el método Hartree-Fock (HF). Este método aproxima el problema de N cuerpos mediante N problemas de un cuerpo donde cada electrón evoluciona en el campo medio de los demás. La resolución clásica de las ecuaciones de HF es eficiente y conduce a la energía de intercambio exacta, pero no incluye ninguna correlación de electrones. Por lo tanto, suele ser un buen punto de partida al que añadir la correlación.
ja: この問題を解くアプローチの出発点として、ハー トリー・フォック法が用いられます。 この手法では、電子N体を独立したN個体の問題に近似（平均場近似）します。古典コンピューター上でハートリー・フォック方程式を解くことは効率的であり、正確な交換エネルギーにつながりますが、電子同士の相関は考慮されていません。 したがって、電子同士の相関を計算に考慮するのは良い議論の出発点とされています。
ko: 이 문제를 해결하기 위한 좋은 출발점은 HF (Hartree-Fock) 방법이다. 이 방법은 각각의 전자가 다른 전자들의 mean-field에서 변화하는 N개의 1체 문제에 의해 N체 문제를 근사화한다. 고전적으로 HF 방정식을 푸는 것은 효율적이며 정확한 exchange energy로 이어지지만 전자들 사이의 어떠한 상관 관계도 포함하지 않는다. 따라서 이것은 일반적으로 상관 관계를 추가할 수 있는 좋은 시작점이다.

source: The Hamiltonian can then be re-expressed in the basis of the solutions of the HF method, also called Molecular Orbitals (MOs):
bn_bn: হ্যামিল্টোনিয়ানকে এইচ-এফ পদ্ধতির সমাধান বেসিস(একটি কলাম ভেক্টর)গুলিতে পুনরায় প্রকাশ করা যায়, যাকে আণবিক কক্ষপথও বলে।
de_de: Der Hamiltonian kann dann auf der Basis der Lösungen der HF-Methode, auch Molecular Orbitals (MOs) genannt, re-exprimiert werden:
es_un: Luego, el Hamiltoniano se puede volver a expresar en la base de las soluciones del método HF, también llamado Orbitales Moleculares (MOs):
it_it: L'Hamiltoniana può poi essere riespressa in base alle soluzioni del metodo HF, chiamate anche Orbitali Molecolari (MO):
ja: 上述の電子のハミルトニアンは、ハートリー・フォック法、別名分子軌道法（MOs）を用いても数学的に表現可能です。
ko: 이어서, Hamiltonian은 또한 분자 오비탈 (Molecular Orbitals, MOs)이라고도 불리는 HF 방법의 풀이에 기초하여 다시 표현될 수 있다.
ml_in: ഹാമിൽട്ടോണിയൻ (\mathcal{H}) നെ HF മെതേഡ്നെ ആസ്പതമാക്കി കണ്ടെത്താം. ഇതിനേ മോൾികുലാർ ഓർബിറ്റല്സ്(MOs) എന്നും വിളിക്കുന്നു:
ru_ru: После этого гамильтониан может быть представлен в базисе собственных функции HF метода, которые называются молекулярными орбиталями (MO):
vi_vn: Hamiltonian có thể được diễn tả lại bằng cơ sở nghiệm của phương pháp HF, hay còn gọi là Orbital Phân tử (MOs):

source: with the 1-body integrals
bn_bn: ১-বডি ইন্টেগ্রাল
de_de: mit den 1-Körper-Integralen
es_un: con las integrales de 1 cuerpo
it_it: con gli integrali a 1 corpo
ja: 一体積分は次の通りです。
ko: 일체 적분은 다음과 같고,
ml_in: 1-ബോഡി ഇന്റഗ്രല്സുകൾ
ru_ru: с одночастичными
vi_vn: với các tích phân 1 thể

source: and 2-body integrals
bn_bn: এবং ২-বডি ইন্টেগ্রাল
de_de: und den 2-Körper-Integralen
es_un: y las integrales de 2 cuerpos
it_it: e integrali a 2 corpi
ja: 二体積分は次の通りです。
ko: 이체 적분은 다음과 같다
ml_in: 2-ബോഡി ഇന്റഗ്രല്സുകൾ
ru_ru: и двухчастичными интегралами
vi_vn: và tích phân 2 thể

source: The MOs (:math:`\phi_u`) can be occupied or virtual (unoccupied). One MO can contain 2 electrons. However, in what follows we actually work with Spin Orbitals which are associated with a spin up (:math:`\alpha`) of spin down (:math:`\beta`) electron. Thus Spin Orbitals can contain one electron or be unoccupied.
bn_bn: এম.ও. (MO) অধিকৃত বা ভার্চুয়াল(অনধিকৃত) হতে পারে। একটি এম.ও.(MO) তে 2 টি ইলেকট্রন থাকতে পারে। তবে, এর পরবর্তীতে আমরা আসলে স্পিন কক্ষপথসমূহের(অরবিটাল) সাথে কাজ করি যা স্পিন ডাউনের (:math:`\beta`) ইলেকট্রনের একটি স্পিন আপের (:math:`\alpha`) সাথে যুক্ত। এইভাবে স্পিন কক্ষপথসমূহ (অরবিটাল) একটি ইলেকট্রন ধারণ করতে পারে বা খালি থাকতে পারে।
de_de: Die MOs (:math:` \phi_u `) können belegt oder virtuell (unbesetzt) sein. Ein MO kann 2 Elektronen enthalten. In dem, was folgt, arbeiten wir tatsächlich mit Spin Orbitalen, die mit einem Spin-up (:math:` \alpha `) des Spin-Down-Elektrons (:math:` \beta `) -Elektrons verbunden sind. Somit können Spin-Orbitale können ein Elektron enthalten oder unbesetzt sein.
es_un: Los MOs (:math:`\phi_u`) pueden ser ocupados o virtuales (desocupados). Un MO puede contener 2 electrones. Sin embargo, en lo que sigue realmente trabajamos con orbitales de espín que están asociados con un espín de electrón hacia arriba (:math:`\alpha`) o hacia abajo (:math:`\beta`). Así, los orbitales de espín pueden contener un electrón o estar desocupados.
it_it: Gli MO o Orbitali Molecolari (:math:`\phi_u`) possono essere occupati o virtuali (non occupati). Un MO può contenere 2 elettroni. Tuttavia, in quanto segue in realtà lavoriamo con spin-orbitali che sono associati con un elettrone spin up (:math:`\alpha`) o spin down (:math:`\beta`) elettrone. Così gli spin-orbitali possono contenere un elettrone o essere liberi.
ja: 分子軌道法(:math:`\phi_u`)では、被占軌道もしくは空軌道の状態を取ることができます。ある一つの分子軌道には2つの電子まで入ることができます。しかし、下記では、2つのスピン軌道状態（上向き :math:`\alpha` または下向き :math:`\beta`）のどちらかを取り扱います。したがって、あるスピン軌道は1つの電子を含むかもしくは空軌道となります。
ko: MOs (:math:`\phi_u`)는 점유되거나 가상 (점유되지 않은, 비어있는)의 오비탈이 될 수 있다. 하나의 MO는 두 개의 전자를 포함할 수 있다. 그러나 스핀 다운 (:math:`\beta`)전자의 스핀 업 (:math:`\alpha`)과 연관된 스핀오비탈 (Spin Orbitals)과 실제로 작업하는 것은 다음과 같다. 따라서, 스핀오비탈은 하나의 전자를 포함하거나 비어있을 수 있다.
ru_ru: MO (:math:`\phi_u`) могут быть заполненными или виртуальными (свободными). Одна MO может содержать два электрона. Однако нужно уточнить, что далее мы будем рассматривать так называемые спин-орбитали, которые связаны со спином электрона, находящимся в состоянии вверх (:math:`\alpha`) или вниз (:math:`\beta`). Поэтому спин-орбиталь может либо содержать один электрон, либо оставаться свободной.
vi_vn: MOs (:math:`\phi_u`) có thể được lấp đầy hoặc ảo (không được lấp đầy). Một MO có thể chứa 2 electron. Tuy nhiên, sau đây chúng ta sẽ làm việc thực tế với Spin Orbital được liên kết với spin up (:math:`\alpha`) và spin down (:math:`\beta`) của electron. Do vậy Spin Orbital có thể chứa một electron hoặc trống.

source: Note: when referring to the number of orbitals, we will be using the number of *spatial* orbitals. This refers to any orbital in Cartesian space (whether its a molecular orbital or in another basis does not matter here). Each spatial orbital is then generally split into two *spin* orbitals.
es_un: Nota: cuando nos referimos al número de orbitales, usaremos el número de orbitales *espaciales*. Esto se refiere a cualquier orbital en el espacio cartesiano (aquí no importa si es un orbital molecular o en otra base). Cada orbital espacial se divide generalmente en dos orbitales de *espín*.
ja: 注記: 軌道の数を参照する場合、*空間* 軌道の数を使用します。 これは、デカルト空間の任意の軌道を指します (ここでは、分子軌道であろうと別の基底であろうと関係ありません)。 次に、各空間軌道は通常、2 つの *スピン* 軌道に分割されます。

source: We now show how to concretely realise these steps with Qiskit.
bn_bn: আমরা এখন দেখাই কীভাবে Qiskit-এর দ্বারা এই পদক্ষেপগুলি দৃঢ়ভাবে বাস্তবায়িত করা যায়।
de_de: Wir zeigen nun, wie diese Schritte mit Qiskit konkret umsetzen werden können.
es_un: Ahora mostramos cómo realizar estos pasos concretamente con Qiskit.
it_it: Ora mostreremo come realizzare concretamente questi passaggi con Qiskit.
ja: 実際にQiskitにて上記の計算過程を実現する方法を紹介します。
ko: 이제 Qiskit 으로 이러한 단계를 구체화하는 방법을 설명한다.
ml_in: നമ്മുക്ക് ഇതു ഇനി ക്വിസക്കിറ്റ് ഉഭയോകിച്ചു കണ്ടെത്താം.
ru_ru: Посмотрим, как реализовать эти шаги в Qiskit.
vi_vn: Bây giờ chúng tôi sẽ diễn giải một cách cụ thể các bước trên với Qiskit.

source: Obtaining an initial Hartree-Fock solution
es_un: Obtención de una solución Hartree-Fock inicial
ja: 初期 Hartree-Fock ソリューションの取得
ko: 초기 Hartree-Fock 솔루션 얻기

source: Qiskit is interfaced with different classical codes which are able to find the HF solutions. Interfacing between Qiskit and the following codes is already available:
de_de: Qiskit besitzt Schnittstellen zu verschiedenen klassischen Programmbibliotheken, die HT-Lösungen (Hartree-Fock-Lösungen) finden können. Schnittstellen zwischen Qiskit und den folgenden Programmbibliotheken sind bereits verfügbar:
es_un: Qiskit está interconectado con diferentes códigos clásicos que son capaces de encontrar las soluciones de HF. La interfaz entre Qiskit y los siguientes códigos ya está disponible:
ja: Qiskit はハートリー・フォック法を解く異なる古典コードとのインタフェースがあります。Qiskit と以下のコードには既にインターフェースがあります:
ko: Qiskit은 HF 솔루션을 찾을 수 있는 다양한 고전 코드와 호환된다. Qiskit과 호환되는 사용가능한 코드는 다음과 같다:
ru_ru: Qiskit предоставляет интерфейс к различным классическим программам для решения задачи HF. На настоящий момент это:
vi_vn: Qiskit thương thích với các mã cổ điển khác nhau có thể tìm được các nghiệm HF. Tương thích giữa Qiskit các mã sau đã có sẵn:

source: In the following we set up a PySCF driver, for the hydrogen molecule at equilibrium bond length (0.735 angstrom) in the singlet state and with no charge.
bn_bn: নিম্নলিখিতগুলিতে আমরা কোনও চার্জ ছাড়া একক অবস্থায় (singlet state) ভারসাম্য (equilibrium) বন্ড দৈর্ঘ্যে (0.735 অ্যাংস্ট্রম) হাইড্রোজেন অণুর জন্য একটি পাই এসসিএফ (PySCF) ড্রাইভার স্থাপন করেছি।
de_de: Im Folgenden nutzen wird einen PySCF-Treiber, für das Wasserstoffmolekül bei Gleichgewichtsbindungslänge (0.735 Angström) im Singulett-Zustand und ohne Ladung.
es_un: A continuación, configuramos un controlador (driver) PySCF, para la molécula de hidrógeno en la longitud de enlace de equilibrio (0.735 angstrom) en el estado singlete y sin carga.
it_it: Qui di seguito abbiamo allestito un driver PySCF, per la molecola di idrogeno alla distanza di legame (0,735 angstrom) nello stato unico e senza alcuna carica.
ja: 以下では、平衡結合距離 (0.735 angstrom) にある電荷なしでシングレット状態の水素分子で、PySCFドライバーを設定しました。
ko: 다음은 수소 분자를 전하가 없는 단일항 상태(singlet state)의 평형 결합 길이 (0.735 옹스트롬)에 두기 위해 PySCF 드라이버를 설정한다.
ml_in: സന്തുലിത ബോണ്ട് ലെൻങ്ത്തിലുള്ള (0.735 angstrom) ചാർജ രഹിത സിംഗിളെറ്റ് സ്റ്റേറ്റ് ഹൈഡ്രജൻ തന്മാത്രകായുള്ള PySCF ഡ്രൈവർ ക്രെനീകരണഞൾ താഴെ കൊടുത്തിരിക്കുന്നു.
ru_ru: В следующем примере мы используем PySCF драйвер для описания молекулы водорода с длиной связи, соответствующей положению равновесия (0,735 ангстрем), в синглетном состоянии без дополнительного заряда.
vi_vn: Sau đó chúng tôi thiết lập một trình điều khiển PySCF, cho một phân tử hydro có độ dài liên kết cân bằng (0.735 angstrom) ở trạng thái đơn và không có điện tích.

source: Running this driver, will yield an ``ElectronicStructureProblem``, Qiskit Nature's representation of the electronic structure problem which we are interested in solving. For further information about the drivers see https://qiskit.org/documentation/nature/apidocs/qiskit_nature.second_q.drivers.html
es_un: Ejecutar este controlador generará un ``ElectronicStructureProblem``, la representación de Qiskit Nature del problema de estructura electrónica que nos interesa resolver. Para obtener más información sobre los controladores, consulta https://qiskit.org/documentation/nature/apidocs/qiskit_nature.second_q.drivers.html
ko: 이 드라이버를 실행하면 우리가 해결하고자 하는 전자 구조의 문제에 대한 Qiskit Nature의 표현인 ``ElectronicStructureProblem`` 을 얻을 수 있다. 드라이버에 대한 자세한 정보는 https://qiskit.org/documentation/nature/apidocs/qiskit_nature.second_q.drivers.html 에서 볼 수 있다.

source: The ``ElectronicStructureProblem`` and its components
es_un: El ``ElectronicStructureProblem`` y sus componentes
ja: ``ElectronicStructureProblem`` とそのコンポーネント
ko: ``ElectronicStructureProblem`` 과 그 구성 요소

source: Let us spend some time to understand this problem instance and its components.
es_un: Dediquemos un tiempo a comprender esta instancia del problema y sus componentes.
ja: この問題のインスタンスとそのコンポーネントを理解するのに時間を費やしてみましょう。
ko: 이 문제의 인스턴스 및 구성요소에 대해 잠시 알아보자.

source: The ``ElectronicEnergy`` Hamiltonian
es_un: El Hamiltoniano ``ElectronicEnergy``
ja: ``ElectronicEnergy`` ハミルトニアン
ko: ``ElectronicEnergy`` 해밀토니언

source: The most important aspect is the internal Hamiltonian; in this case an ``ElectronicEnergy`` hamiltonian. This class is able to generate the second-quantized operator from the 1- and 2-body integrals which the classical code has computed for us.
es_un: El aspecto más importante es el Hamiltoniano interno; en este caso un Hamiltoniano ``ElectronicEnergy``. Esta clase es capaz de generar el operador de segunda cuantización a partir de las integrales de 1 y 2 cuerpos que el código clásico ha calculado para nosotros.
ja: 最も重要な側面は内部ハミルトニアンです。このケースでは、``ElectronicEnergy`` ハミルトニアンです。 このクラスは、古典的なコードが計算した1体積分と2体積分から第2量子化演算子を生成することができます。
ko: 가장 중요한 측면은 내부의 해밀토니언(Hamiltonian) 이다. 이 경우에는 ``ElectronicEnergy`` 헤밀토니언(hamiltonian) 이다. 이 클래스는 고전적인 코드가 우리를 위해 계산한 1체 및 2체 적분들로부터 제2양자화된(second-quantization) 연산자를 생성할 수 있다.

source: **IMPORTANT:** The container class for the integral coefficients (``PolynomialTensor``) requires the 2-body terms to be provided in **physicist order**!
es_un: **IMPORTANTE:** ¡La clase contenedora para los coeficientes integrales (``PolynomialTensor``) requiere que los términos de 2 cuerpos se proporcionen en **orden del físico**!
ja: **重要:** 積分係数のコンテナクラス ( ``PolynomialTensor``) は、 **物理順序** で2体項を提供する必要があります！
ko: **중요:** 적분 계수 (``PolynomialTensor``) 에 대한 컨테이너 클래스(container class) 에는 2체 용어를 **물리학자 순서**로 제공해야 한다!

source: Note, that this is purely the **electronic** Hamiltonian of the system. That means, that the *nuclear repulsion energy* is not included. Instead, Qiskit Nature will add this constant energy offset in a post-processing step, in order to compute the total energy of your system. To learn how to include the nuclear repulsion energy in this operator, please refer to the documentation of the ``ElectronicEnergy`` class `here <https://qiskit.org/documentation/nature/stubs/qiskit_nature.second_q.hamiltonians.ElectronicEnergy.html>`__.
es_un: Ten en cuenta que esto es puramente el Hamiltoniano **electrónico** del sistema. Eso significa que la *energía de repulsión nuclear* no está incluida. En su lugar, Qiskit Nature agregará esta compensación de energía constante en un paso de posprocesamiento para calcular la energía total de tu sistema. Para saber cómo incluir la energía de repulsión nuclear en este operador, consulta la documentación de la clase ``ElectronicEnergy`` `aquí <https://qiskit.org/documentation/nature/stubs/qiskit_nature.second_q.hamiltonians.ElectronicEnergy.html>`__.
ja: これは純粋にシステムの **電子** ハミルトニアンであることに注意してください。つまり、 *核反発エネルギー* は含まれていません。 代わりに、Qiskit Nature はシステムの総エネルギーを計算するために、後処理ステップでこの一定のエネルギーオフセットを追加します。 この演算子に核反発エネルギーを含める方法については、``ElectronicEnergy`` クラスの `こちら <https://qiskit.org/documentation/nature/stubs/qiskit_nature.second_q.hamiltonians.ElectronicEnergy.html>`__ のドキュメントを参照してください。
ko: 이것은 시스템의 순수한 **전자** 해밀토니언이다. 즉, *핵 반발 에너지* 가 포함되어 있지 않다는 것을 의미한다. 대신, Qiskit Nature는 시스템의 총 에너지를 계산하기 위해 이 일정한 에너지 오프셋을 사후 처리 단계에서 추가할 것이다. 이 연산자에 핵 반발 에너지를 포함시키는 방법을 배우려면 ``ElectronicEnergy`` 클래스의 문서 `여기<https://qiskit.org/documentation/nature/stubs/qiskit_nature.second_q.hamiltonians.ElectronicEnergy.html>` 를 참고하면 된다.

source: More attributes of the ``ElectronicStructureProblem``
es_un: Más atributos del ``ElectronicStructureProblem``
ja: ``ElectronicStructureProblem`` の他の属性
ko: 더 많은 ``ElectronicStructureProblem`` 객체의 속성(attributes)

source: Below we list some additional attributes of our ``problem`` instance:
es_un: A continuación, enumeramos algunos atributos adicionales de nuestra instancia ``problem``:
ja: 以下に、``problem`` インスタンスの追加属性を示します。
ko: 아래에는 ``problem`` 인스턴스의 몇몇 추가적인 속성이 나열되어 있다.
