Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/02_vibrational_structure.po
Languages: bn_bn, es_un, fr_fr, id_id, ja, ko, pt_un, tr

source: where :math:`V_0` is the electronic energy of the reference geometry, the one-mode term :math:`V^{[l]}(Q_l)` represents the variation of the PES upon change of the :math:`l`-th normal coordinate from the equilibrium position. Similarly, the two-body potential :math:`V^{[l,m]}(Q_l, Q_m)` represents the change in the exact PES upon a simultaneous displacement along the :math:`l`-th and :math:`m`-th coordinates. Often, including terms up to three-body in the :math:`L`-body expansion is sufficient to obtain an accuracy of about 1~cm\ :math:`^{-1}`. We highlight that the many-body expansion of the potential operator defining the Watson Hamiltonian contains arbitrarily high coupling terms. This is a crucial difference compared to the non-relativistic electronic-structure Hamiltonian that contains only pairwise interactions.
bn_bn: যেখানে :math:`V_0` হল রেফারেন্স জ্যামিতির ইলেকট্রনিক শক্তি, এক-মোড শব্দ :math:`V^{[l]}(Q_l)` ভারসাম্যপূর্ণ অবস্থান থেকে :math:`l`-তম স্বাভাবিক স্থানাঙ্ক পরিবর্তনের পরে PES এর বৈচিত্র্যকে প্রতিনিধিত্ব করে। একইভাবে, দ্বি-শরীরের সম্ভাব্য :math:`V^{[l,m]}(Q_l, Q_m)`, :math:`l`-তম এবং :math:`m`-তম স্থানাঙ্কগুলির সাথে একযোগে স্থানচ্যুতিতে সঠিক PES- এর পরিবর্তনের প্রতিনিধিত্ব করে। প্রায়শই, :math:`L`-বডি সম্প্রসারণে থ্রি -বডি পর্যন্ত পদগুলি সহ প্রায় 1~cm\ :math:`^{-1}` এর নির্ভুলতা পাওয়ার জন্য যথেষ্ট। আমরা হাইলাইট করি যে ওয়াটসন হ্যামিল্টোনিয়ান সংজ্ঞায়িত সম্ভাব্য অপারেটরের বহু-দেহের সম্প্রসারণে ইচ্ছাকৃতভাবে উচ্চ সংযোজন পদ রয়েছে। অ-আপেক্ষিক বৈদ্যুতিন-কাঠামো হ্যামিল্টোনিয়ানের তুলনায় এটি একটি গুরুত্বপূর্ণ পার্থক্য যা কেবল জোড়া যুক্ত মিথস্ক্রিয়া ধারণ করে।
es_un: donde :math:`V_0` es la energía electrónica de la geometría de referencia, el término de un modo :math:`V^{[l]}(Q_l)` representa la variación del PES al cambiar de la :math:`l`-ésima coordenada normal desde la posición de equilibrio. De manera similar, el potencial de dos cuerpos :math:`V^{[l,m]}(Q_l, Q_m)` representa el cambio en el PES exacto tras un desplazamiento simultáneo a lo largo de las coordenadas :math:`l`-ésima y :math:`m`-ésima. A menudo, incluir términos de hasta tres cuerpos en la expansión de :math:`L` cuerpos es suficiente para obtener una precisión de aproximadamente 1~cm\ :math:`^{-1}`. Destacamos que la expansión de muchos cuerpos del operador potencial que define el Hamiltoniano de Watson contiene términos de acoplamiento arbitrariamente altos. Esta es una diferencia crucial en comparación con el Hamiltoniano de estructura electrónica no relativista que contiene solo interacciones por pares.
fr_fr: où :math:`V_0` est l'énergie électronique de la géométrie de référence, le terme à un mode :math:`V^{[l]}(Q_l)` représente la variation du PES lors du changement de la coordonnée normale :math:`l`-th à partir de la position d'équilibre. De même, le potentiel à deux corps :math:`V^{ [l, m]}(Q_l, Q_m)` représente le changement dans le PES exact lors d'un déplacement simultané le long des coordonnées :math:`l`-th et :math:`m`-th. Souvent, y compris les termes allant jusqu'à trois corps dans l'expansion du corps :math:`L`, il suffit d'obtenir une précision d'environ 1 ~ cm\ :math:`^{-1}`. Nous soulignons que l'expansion à plusieurs corps de l'opérateur potentiel définissant l'Hamiltonien Watson contient des termes de couplage très élevés. Il s'agit d'une différence cruciale par rapport à l'Hamiltonien de structure électronique non relativiste qui ne contient que des interactions deux à deux.
id_id: di mana :math:`V_0` adalah energi elektronik dari geometri referensi, suku satu-mode :math:`V^{[l]}(Q_l)` mewakili variasi PES setelah perubahan koordinat normal ke-:math:`l` dari posisi ekuilibrium. Demikian pula, potensial dua-benda :math:`V^{[l, m]}(Q_l, Q_m)` mewakili perubahan eksak PES pada perpindahan secara simultan di sepanjang koordinat ke-:math:`l` dan :math:`m`. Seringkali, suku-suku yang mencapai tiga-benda dalam ekspansi :math:`L`-benda cukup untuk memperoleh akurasi sekitar 1~cm\:math:` ^{-1}`. Kami menyoroti bahwa ekspansi banyak-benda dari operator potensial yang mendefinisikan Hamiltonian Watson mengandung suku-suku kopling tinggi apapun. Hal ini menunjukkan perbedaan krusial apabila dibandingkan dengan struktur elektronik Hamiltonian non-relativistik yang hanya mengandung interaksi berpasangan.
ja: ここで、:math:`V_0` は参照配置の電子エネルギーであり、 1 体項 :math:`V^{[l]}(Q_l)` は、平衡位置からの :math:`l` 番目の標準座標の変化に対する PES の変化を表わしています。 同様に、 2 体のポテンシャル :math:`V^{[l,m]}(Q_l, Q_m)` は、 :math:`l` と :math:`m` 番目の座標に沿った同時変位における正確な PES の変化を表しています。 :math:`L` 体展開において3 体までの項を含めれば、約 1~cm\ :math:`^{-1}` の精度を得るのに十分です。 Watsonハミルトニアンを定義するポテンシャル演算子の多体展開は、任意の高結合項が含まれていることに注目しました。これは、ペアワイズ相互作用のみを含む非相対論的電子構造ハミルトニアンと比較すると、非常に重要な違いです。
ko: :math:`V_0` 가 참조 기하학의 전자 에너지이고, 단일 모드 용어 :math:`V^{[l]}(Q_l)` 는 평형 위치로부터의 :math:`l` 번째 정규 좌표를 따른 PES의 변화를 나타낸다. 비슷하게, 2체 전위 :math:`V^{[l,m]}(Q_l, Q_m)` 는 :math:`l` 번째와 :math:`m` 번째 좌표를 따른 동시적인 변위에 따른 정확한 PES의 변화를 나타낸다. 종종 3체나 :math:`L` 체 확장을 포함하는 것은 1~cm\ :math:`^{-1}` 정도의 정확도를 얻기에 충분하다. Watson Hamiltonian을 정의하는 잠재적 연산자의 다체 확장에는 임의로 높은 결합 항이 포함되어 있습니다. 이것은 쌍별 상호 작용 만 포함하는 비 상대 론적 전자 구조 Hamiltonian과 비교할 때 중요한 차이점입니다.
pt_un: onde :math:`V_0` é a energia eletrônica da geometria de referência, o termo de modo 1 :math:`V^{[l]}(Q_l)` representa a variação do PES após alteração da :math:`l`-ésima coordenada normal da posição de equilíbrio. Da mesma forma, o potencial de dois corpos :math:`V^{[l,m]}(Q_l, Q_m)` representa a mudança no PES exato com um deslocamento simultâneo ao longo da :math:`l`-ésima e :math:`m`-ésima coordenada. Frequentemente, incluindo termos de até três corpos na expansão de :math:`L` corpos é suficiente para obter uma precisão de cerca de 1~cm\ :math:`^{-1}`. Salientamos que a expansão de muitos corpos do operador potencial que define o Hamiltonian de Watson contém termos de acoplamento arbitrariamente elevados. Esta é uma diferença crucial em comparação com a Hamiltoniana da estrutura electrónica não-relativística que contém apenas interações em pares.
tr: burada :math:`V_0` referans geometrinin elektronik enerjisidir, tek modlu terim :math:`V^{[l]}(Q_l)`, :math:` PES’in :math:`l` inci normal koordinatı üzerinde denge konumundaki varyasyonu temsil eder. Benzer şekilde, iki cisim potansiyeli :math:`V^{[l,m]}(Q_l, Q_m)`, :math:`l`-th ve :math boyunca aynı anda bir yer değiştirme üzerine tam PES'teki değişikliği temsil eder. :`m`-inci koordinatlar. Genellikle, :math:`L`-gövde genişletmesine üç cisimli terimleri dahil etmek, yaklaşık 1~cm\ :math:`^{-1}` doğruluk elde etmek için yeterlidir. Watson Hamiltonyen'i tanımlayan potansiyel operatörün çok cisimli genişlemesinin keyfi olarak yüksek birleştirme terimleri içerdiğini vurguluyoruz. Bu, yalnızca ikili etkileşimler içeren göreli olmayan elektronik yapı Hamiltonyen ile karşılaştırıldığında çok önemli bir farktır.

source: A flexible second quantization form of the Watson Hamiltonian is obtained within the so-called n-mode representation. Let us assume that each mode :math:`l` is described by a :math:`N_l`-dimensional basis set :math:`S_l` defined as follows:
bn_bn: ওয়াটসন হ্যামিল্টোনিয়ানের একটি নমনীয় দ্বিতীয় কোয়ান্টাইজেশন ফর্ম তথাকথিত এন-মোড উপস্থাপনার মধ্যে পাওয়া যায়। আসুন আমরা ধরে নিই যে প্রতিটি মোড :math:`l` একটি :math:`N_l`- ডাইমেনশনাল ভিত্তিক সেট :math:`S_l` দ্বারা বর্ণনা করা হয়েছে যা নিম্নরূপ সংজ্ঞায়িত করা হয়েছে:
es_un: Se obtiene una segunda forma de cuantización flexible del Hamiltoniano de Watson dentro de la llamada representación en n-modos. Supongamos que cada modo :math:`l` está descrito por un conjunto :math:`S_l` base :math:`N_l`-dimensional definido como sigue:
fr_fr: Une seconde forme de quantification flexible du Hamiltonien Watson est obtenue dans le cadre de la représentation dite n-mode. Supposons que chaque mode :math:`l` est décrit par un ensemble de base :math:`N_l`-set :math:`S_l` défini comme suit :
id_id: Bentuk fleksibel kuantisasi kedua dari Hamiltonian Watson diperoleh dalam suatu representasi n-mode. Asumsikan bahwa setiap mode :math:`l` dideskripsikan oleh sebuah set basis :math:`S_l` berdimensi :math:`N_l` yang didefinisikan sebagai berikut:
ja: Watson ハミルトニアンの柔軟な第二量子化形式は、いわゆる n モード表現から得られます。各モード :math:`l` が、次のように定義された :math:`N_l` 次元基底の :math:`S_l` によって記述されているとしましょう。
ko: 소위 n-모드 표현 내에서 Watson Hamiltonian의 유연한 제2 양자화 형태가 얻어진다. 각각의 모드 :math:`l` 이 다음과 같이 정의된 :math:`N_l` - 차원 기초 세트 :math:`S_l` 에 의해 설명되는 것으로 가정하자.
pt_un: Uma forma flexível de segunda quantização do Hamiltoniano de Watson é obtida na chamada representação de modo n. Vamos supor que cada modo :math:`l` é descrito por um conjunto base :math:`N_l`-dimensional :math:`S_l` definido da seguinte forma:
tr: Watson Hamiltonyenin esnek bir ikinci kuantizasyon formu, n-modu gösterimi içinde elde edilir. Her bir modun :math:`l` bir :math:`N_l` boyutlu temel set :math:`S_l` tarafından aşağıdaki şekilde tanımlandığını varsayalım:

source: The :math:`n`-mode wave function can be expanded in the product basis :math:`\mathcal{S} = \otimes_{i=1}^L \mathcal{S}_i` as the following CI-like expansion:
bn_bn: :math:`n`- মোড ওয়েভ ফাংশনটি পণ্যের ভিত্তিতে :math:`\mathcal{S} = \otimes_{i=1}^L \mathcal{S}_i` নিম্নোক্ত CI- এর মত সম্প্রসারণ করা যেতে পারে:
es_un: La función de onda de :math:`n`-modos se puede expandir en el producto de las bases :math:`\mathcal{S} = \otimes_{i=1}^L \mathcal{S}_i` como la siguiente expansión tipo CI (interacción de configuraciones):
fr_fr: La fonction d'onde :math:`n` en mode peut être étendue dans la base du produit :math:`\mathcal{S} = \otimes_{i=1}^L \mathcal{S}_i` comme l'extension suivante de type CI:
id_id: Fungsi gelombang :math:`n`-mode dapat diperluas dalam basis perkalian produk :math:`\mathcal{S}=\otimes_ {i= 1}^L \mathcal{S}_i` sebagai ekspansi seperti CI berikut ini:
ja: :math:`n` モード波動関数は、積基底 :math:`\mathcal{S} = \otimes_{i=1}^L \mathcal{S}_i` によって、 Cl のように展開することができます。
ko: :math:`n` 모드 웨이브 기능은 다음의 CI같은 확장으로 제품 기반으로 :math:`\mathcal{S} = \otimes_{i=1}^L \mathcal{S}_i` 로 확장할 수 있다.
pt_un: A função de onda de modo :math:`n` pode ser expandida na base de produto :math:`\mathcal{S} = \otimes_{i=1}^L \mathcal{S}_i` como a seguinte expansão semelhante a CI:
tr: :math:`n`-mode dalga fonksiyonu ürün bazında genişletilebilir :math:`\mathcal{S} = \otimes_{i=1}^L \mathcal{S}_i` olarak takip eden CI benzeri olarak genişletme:

source: The many-body basis function :math:`\phi_{k_1}^{(1)}(Q_1) \cdots \phi_{k_L}^{(L)}(Q_L)` are encoded within the so-called :math:`n`-mode second quantization as occupation-number vectors (ONVs) as follows:
bn_bn: মনি-বডি বেস ফাংশন :math:`\phi_{k_1}^{(1)}(Q_1) \cdots \phi_{k_L}^{(L)}(Q_L)` তথাকথিত :math:`n`-মোড সেকেন্ড কোয়ান্টাইজেশনের মধ্যে পেশা-সংখ্যা ভেক্টর (ONVs) হিসাবে এনকোড করা হয়েছে:
es_un: Las funciones base de muchos cuerpos :math:`\phi_{k_1}^{(1)}(Q_1) \cdots \phi_{k_L}^{(L)}(Q_L)` están codificadas dentro de la llamada segunda cuantización de :math:`n`-modos como vectores de número de ocupación (ONVs) de la siguiente manera:
fr_fr: La fonction de base à plusieurs corps :math:` \phi_{k_1}^ { (1) } (Q_ 1) \cdots \phi_{k_L}^ { (L) } (Q_L) ` sont encodées dans la seconde quantification dite mode :math:` n ` en tant que vecteurs de numéro d'occupation (ONV) comme suit:
id_id: Fungsi basis benda-banyak :math:`\phi_{k_1}^{(1)}(Q_ 1) \cdots \phi_{k_L}^{(L)}(Q_L)` dikodekan dalam kuantisasi kedua :math:`n`-mode sebagai vektor bilangan pendudukan atau Occupation Number Vectors (ONVs) sebagai berikut:
ja: 多体基底関数 :math:`\phi_{k_1}^{(1)}(Q_1) \cdots \phi_{k_L}^{(L)}(Q_L)` は、いわゆる :math:`n` モード第二量子化において、以下のように占有数ベクトル (occupation-number vectors, ONVs) として符号化されています。
ko: 다수-체 기반 함수 :math:`\phi_{k_1}^{(1)}(Q_1) \cdots \phi_{k_L}^{(L)}(Q_L)` 는 다음과 같이 직업-수 벡터 (ONV) 로서 소위 :math:`n`-모드 제2양자화 내에서 인코딩된다:
pt_un: A função base de muitos corpos :math:`\phi_{k_1}^{(1)}(Q_1) \cdots \phi_{k_L}^{(L)}(Q_L)` é codificada dentro da chamada segunda quantização de modo :math:`n` como vetores de números de ocupação (ONVs) da seguinte forma:
tr: :math:`\phi_{k_1}^{(1)}(Q_1) \cdots \phi_{k_L}^{(L)}(Q_L)` çok cisim fonksiyonu :math:`n`- modunun ikinci kuantlaşmasında aşağıda gösterildiği gibi doluluk-sayı vektörleri (ONV) olarak kodlanır:

source: The ONV defined above is, therefore, the product of :math:`L` mode-specific ONVs, each one describing an individual mode. Since each mode is described by one and only one basis function, the occupation of each mode-specific ONV is one. From a theoretical perspective, each mode can be interpreted as a distinguishable quasi-particle (defined as phonons in solid-state physics). Distinguishability arises from the fact that the PES is not invariant by permutation of two modes, also in this case unlike the Coulomb interaction between two equal particles. From this perspective, a molecule can be interpreted as a collection of :math:`L` indistinguishable particles that interact through the PES operator.
bn_bn: উপরে সংজ্ঞায়িত ONV, তাই, :math:`L` মোড-নির্দিষ্ট ONV গুলির পণ্য, প্রত্যেকে একটি পৃথক মোড বর্ণনা করে। যেহেতু প্রতিটি মোড এক এবং শুধুমাত্র একটি ভিত্তি ফাংশন দ্বারা বর্ণনা করা হয়েছে, প্রতিটি মোড-নির্দিষ্ট ONV এর পেশা এক। তাত্ত্বিক দৃষ্টিকোণ থেকে, প্রতিটি মোডকে একটি পৃথক আধা-কণা হিসাবে ব্যাখ্যা করা যেতে পারে (কঠিন-রাষ্ট্র পদার্থবিজ্ঞানে ফোনন হিসাবে সংজ্ঞায়িত)। পৃথক পৃথকীকরণ এই সত্য থেকে উদ্ভূত হয় যে PES দুটি মোডের ক্রমবর্ধমান দ্বারা অপরিবর্তনীয় নয়, এই ক্ষেত্রে দুটি সমান কণার মধ্যে কুলম্ব মিথস্ক্রিয়া থেকে ভিন্ন। এই দৃষ্টিকোণ থেকে, একটি অণু কে :math:`L` পৃথকযোগ্য কণার সংগ্রহ হিসাবে ব্যাখ্যা করা যেতে পারে যা PES অপারেটরের মাধ্যমে যোগাযোগ করে।
es_un: El ONV definido anteriormente es, por lo tanto, el producto de :math:`L` ONVs específico del modo, cada uno describiendo un modo individual. Dado que cada modo está descrito por una y solo una función base, la ocupación de cada ONV específico del modo es uno. Desde una perspectiva teórica, cada modo se puede interpretar como una cuasi partícula distinguible (definidas como fonones en física de estado sólido). La distinguibilidad surge del hecho que la PES no es invariante por la permutación de dos modos, también en este caso a diferencia de la interacción de Coulomb entre dos partículas iguales. Desde esta perspectiva, una molécula puede ser interpretar como una colección de :math:`L` partículas indistinguibles que interactúan a través del operador de la PES.
fr_fr: L'ONV défini ci-dessus est donc le produit des ONV spécifiques au mode :math:` L', chacun décrivant un mode individuel. Puisque chaque mode est décrit par une seule et unique fonction de base, l'occupation de chaque ONV spécifique est une occupation. D'un point de vue théorique, chaque mode peut être interprété comme une quasi-particule distincte (définie comme des phonons en physique de l'état solide). La distinction découle du fait que le PSE n'est pas invariant par la permutation de deux modes, aussi dans ce cas, contrairement à l'interaction coulombienne entre deux particules égales. De ce point de vue, une molécule peut être interprétée comme une collection de particules indifférenciables de :math:"L" qui interagissent par l'intermédiaire de l'opérateur PES.
id_id: Oleh karena itu, ONV yang didefinisikan di atas adalah produk dari :math:`L` mode-spesifik ONV, yang masing-masing menggambarkan mode individu. Karena setiap mode digambarkan oleh satu dan hanya satu fungsi basis, pendudukan/occupation dari setiap mode-spesifik ONV adalah satu. Dari perspektif teoritis, setiap mode dapat diartikan sebagai suatu kuasi-partikel yang dapat dibedakan (didefinisikan sebagai fonon dalam fisika zat padat). Sifat kuasi-partikel yang dapat dibedakan ini muncul dari fakta bahwa PES tidak invarian oleh permutasi dua mode, juga dalam hal ini tidak seperti interaksi Coulomb antara dua partikel yang sama. Dari perspektif ini, sebuah molekul dapat diinterpretasikan sebagai kumpulan dari :math:`L` partikel tak dapat dibedakan yang berinteraksi melalui operator PES.
ja: したがって上のように定義された ONV は、それぞれが独立モードを記述する :math:`L` モードに固有なONV の積となります。各モードはただ一つの基底関数によって記述されているため、各モードに固有な ONV の占有数は 1 です。理論的に各モードは、区別可能な準粒子 (固体物理学ではフォノンとして定義されます) として解釈することができます。区別可能性は、 PESが二つのモードの並び替えに関して不変でないという事実から導かれます。今回の場合、これは二つの等しい粒子間にはたらくクーロン相互作用とは異なっています。この観点から、分子は PES 演算子を介して相互作用する、 :math:`L` 個の区別できない粒子の集合として解釈することができます。
ko: 따라서, 상기에 정의된 ONV는 각각 개별 모드를 기술하는 :math:`L` 의 모드-특정 ONV의 생성물이다. 각각의 모드가 오직 하나의 기본 기능에 의해 설명되기 때문에, 각각의 모드-특정 ONV의 점유는 하나이다. 이론적인 관점에서, 각 모드는 구별 가능한 준-입자 (고체-상태 물리에서 음향자로 정의됨) 로 해석될 수 있다. 구별 능력은, 2개의 동일한 입자들 사이의 쿨롱 상호작용과는 달리, 이러한 경우에, 2개의 모드의 순열에 의해 PES가 불변하지 않는다는 사실로부터 발생한다. 이러한 관점에서, 분자는 PES 조작자를 통하여 상호작용하는 :math:`L` 의 구별할 수 없는 입자들의 집합체로서 해석될 수 있다.
pt_un: O ONV definido acima é, portanto, o produto de :math:`L` ONVs de modo específico, cada um descrevendo um modo individual. Como cada modo é descrito por uma e apenas uma função base, a ocupação de cada ONV de modo específico é um. De uma perspectiva teórica, cada modo pode ser interpretado como uma quase-partícula distinguível (definidas como fônons na física do estado sólido). A distinguibilidade resulta do fato do PES não ser invariante à permutação de dois modos, também neste caso, ao contrário da interação de Coulomb entre duas partículas iguais. Desta perspectiva, uma molécula pode ser interpretada como uma coleção de :math:`L` partículas indistinguíveis que interagem através do operador PES.
tr: Bu nedenle yukarıda tanımlanan ONV, her biri ayrı bir modu tanımlayan :math:`L' moduna özgü ONV'lerin ürünüdür. Her mod bir ve yalnızca bir temel fonksiyonla tanımlandığından, her moda özgü ONV'nin yerleştiği yer tektir. Teorik bir perspektiften, her mod, ayırt edilebilir bir yarı-quasi-parçacık (katı hal fiziğinde fononlar olarak tanımlandı) olarak yorumlanabilir. Ayırt edilebilirlik, PES'in iki modun permütasyonuyla değişmez olmaması gerçeğinden kaynaklanmaktadır, bu durumda da iki eşit parçacık arasındaki Coulomb etkileşiminden farklı olmasından kaynaklanır. Bu perspektiften, bir molekül, PES operatörü aracılığıyla etkileşime giren :math:'L' ayırt edilemez parçacıkların bir koleksiyonu yani toplanması olarak yorumlanabilir.

source: Based on this second-quantization representation we introduce a pair of creation and annihilation operators per mode :math:`l` :nbsphinx-math:`\textit{and}` per basis function :math:`k_l` defined as:
bn_bn: এই দ্বিতীয় কোয়ান্টাইজেশন উপস্থাপনার উপর ভিত্তি করে আমরা এক জোড়া সৃষ্টি এবং ধ্বংসের অপারেটর প্রতি মোড :math:`l` :nbsphinx-math:`\textit{and}` প্রতি ভিত্তি ফাংশন :math:`k_l` হিসাবে সংজ্ঞায়িত করি:
es_un: Basándonos en esta representación de segunda cuantización, presentamos un par de operadores de creación y aniquilación por modo :math:`l` y por función base :math:`k_l` definidos como:
fr_fr: Basé sur cette représentation de deuxième quantification, nous introduisons une paire d'opérateurs de création et d'annihilation par mode :math:`l` :nbsphinx-math:`\textit{and}` par fonction de base :math:`k_l` définie comme:
id_id: Berdasarkan represenatsi kuantisasi kedua ini, diperkenalkan suatu pasangan operator penciptaan dan penihilan setiap mode :math:`l` :nbsphinx-math:`\textit{and}` untuk setiap fungsi basis :math:`k_l` yang didefinisikan sebagai:
ja: 第二量子化表現に基づいて、モード :math:`l` と基底関数 :math:`k_l` ごとに、以下のように生成演算子と消滅演算子の対を導入します。
ko: 이러한 이차 양자화 표현을 기반으로 각 다음과 같이 정의되는 기저함수 :math:`k_l` 에 대한 모드 :math:`l` :nbsphinx-math:`\textit{and}` 당 생성 및 소멸 연산자 쌍을 도입한다.
pt_un: Com base nesta representação da segunda quantização, introduzimos um par de operadores de criação e aniquilação por modo :math:`l` :nbsphinx-math:`\textit{and} por função base :math:`k_l` definidos como:
tr: Bu ikinci kuantlaşma temsiline dayanarak, mod başına bir çift yaratma ve yok etme operatörü sunuyoruz :math:`l` :nbsphinx-math:`\textit{and}` her temel fonksiyon için :math:`k_l` şu şekilde tanımlanır:

source: \begin{aligned} a_{k_l}^\dagger |\cdots, 0_1 \cdots 0_{k_l} \cdots 0_{N_l}, \cdots\rangle &= | \cdots, 0_1 \cdots 1_{k_l} \cdots 0_{N_l}, \cdots\rangle \\ a_{k_l}^\dagger | \cdots, 0_1 \cdots 1_{k_l} \cdots 0_{N_l}, \cdots\rangle &= 0 \\ a_{k_l} | \cdots, 0_1 \cdots 1_{k_l} \cdots 0_{N_l}, \cdots\rangle &= | \cdots, 0_1 \cdots 0_{k_l} \cdots 0_{N_l}, \cdots\rangle \\ a_{k_l} | \cdots, 0_1 \cdots 0_{k_l} \cdots 0_{N_l}, \cdots\rangle &= 0 \\ \end{aligned}
fr_fr: \start{aligned} a_{k_l}^\dagger |\cdots, 0_1 \cdots 0_{k_l} \cdots 0_{N_l}, \cdots\rangle &= | \cdots, 0_1 \cdots 1_{k_l} \cdots 0_{N_l}, \cdots\rangle \\ a_{k_l}^\dagger | \cdots, 0_1 \cdots 1_{k_l} \cdots 0_{N_l}, \cdots\rangle &= 0 \\ a_{k_l} | \cdots, 0_1 \cdots 1_{k_l} \cdots 0_{N_l}, \cdots\rangle &= | \cdots, 0_1 \cdots 0_{k_l} \cdots 0_{N_l}, \cdots\rangle \\ a_{k_l} | \cdots, 0_1 \cdots 0_{k_l} \cdots 0_{N_l}, \cdots\rangle &= 0 \\ \end{aligned}

source: with
bn_bn: সাথে বা সঙ্গে
es_un: con
fr_fr: avec
ja: ただし
ko: 에 대하여
pt_un: com

source: The second quantization form is obtained by expressing the potential as
bn_bn: সম্ভাব্যতা প্রকাশ করে দ্বিতীয় পরিমাপ গঠনটি পাওয়া যায়
es_un: La forma de la segunda cuantización se obtiene expresando el potencial como
fr_fr: La deuxième forme de quantification est obtenue en exprimant le potentiel comme
id_id: Bentuk kuantisasi kedua diperoleh dengan mengekspresikan potensial sebagai
ja: 第二量子化形式は、ポテンシャルを次のように表現することで得られます。
ko: 제2양자화 형태는 다음과 같이 포텐셜을 표현함으로써 얻어진다.
pt_un: A forma da segunda quantização é obtida através da expressão do potencial como
tr: İkinci kuantizasyon formu, potansiyelin şu şekilde ifade edilmesiyle elde edilir

source: \begin{aligned} \mathcal{H}_\text{vib}^{SQ} =& \sum_{l=1}^L \sum_{k_l,h_l}^{N_l} \langle \phi_{k_l} | T(Q_l) + V^{[l]}(Q_l) | \phi_{h_l} \rangle a_{k_l}^+ a_{h_l} \\ +& \sum_{l<m}^L \sum_{k_l,h_l}^{N_l} \sum_{k_m,h_m}^{N_m} \langle \phi_{k_l} \phi_{k_m} | V^{[l,m]}(Q_l, Q_m) | \phi_{h_l} \phi_{h_m} \rangle a_{k_l}^+ a_{k_m}^+ a_{h_l} a_{h_m} + \cdots \end{aligned}
fr_fr: \begin{aligned} \mathcal{H}_\text{vib}^{SQ} =& \sum_{l=1}^L \sum_{k_l,h_l}^{N_l} \langle \phi_{k_l} | T(Q_l) + V^{[l]}(Q_l) | \\phi_{h_l} \rangle a_{k_l}^+ a_{h_l} \\ +& \sum_{l<m}^L \sum_{k_l,h_l}^{N_l} \sum_{k_m,h_m}^{N_m} \langle \phi_{k_l} \phi_{k_m} | V^<unk> l, ]}(Q_l, Q_m) | \phi_{h_l} \phi_{h_m} \rangle a_{k_l}^+ a_{k_m}^+ a_{h_l} a_{h_m} + \cdots \end{aligned}
