Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/02_vibrational_structure.po
Languages: bn_bn, es_un, fr_fr, id_id, ja, ko, pt_un, tr

source: We highlight here the difference between the operators defined here above and the electronic structure one. First, as we already mentioned, the potential contains (in principle) three- and higher-body coupling terms that lead to strings with six (or more) second-quantization operators. Moreover, the Hamiltonian conserves the number of particles for each mode, as can be seen from the fact that the number of creation and annihilation operators for a given mode is the same in each term. Nevertheless, different modes are coupled by two- (and higher) body terms containing SQ operators belonging to different modes :math:`l` and :math:`m`.
bn_bn: আমরা উপরে বর্ণিত অপারেটর এবং বৈদ্যুতিন কাঠামোর মধ্যে পার্থক্য এখানে তুলে ধরছি। প্রথমত, যেমনটি আমরা ইতিমধ্যেই উল্লেখ করেছি, সম্ভাব্য (নীতিগতভাবে) তিনটি এবং উচ্চতর শরীরের সংযোজন পদ রয়েছে যা ছয় (বা তার বেশি) দ্বিতীয়-পরিমান অপারেটরগুলির সাথে স্ট্রিংয়ের দিকে পরিচালিত করে। তদুপরি, হ্যামিল্টোনিয়ান প্রতিটি মোডের জন্য কণার সংখ্যা সংরক্ষণ করে, যেমনটি দেখা যায় যে প্রদত্ত মোডের জন্য সৃষ্টি এবং ধ্বংসের অপারেটরগুলির সংখ্যা প্রতিটি পদে একই। তা সত্ত্বেও, বিভিন্ন মোড দুটি (এবং উচ্চতর) বডি টার্ম দ্বারা সংযুক্ত করা হয় যার মধ্যে বিভিন্ন মোডের SQ অপারেটর রয়েছে :math:`l` এবং :math:`m`।
es_un: Destacamos la diferencia entre los operadores definidos aquí anteriormente y el de la estructura del electrón. Primero, como ya mencionamos, el potencial contiene (en principio) términos de acoplamiento de tres y más cuerpos que conducen a cadenas con seis (o más) operadores de segunda cuantización. Por otra parte, el Hamiltoniano conserva el número de partículas para cada modo, como se puede ver del hecho que el número de operadores de creación y aniquilación para un modo dado es el mismo en cada término. No obstante, modos diferentes están acoplados por términos de dos (o más) cuerpos que contienen operadores SQ que pertenecen a diferentes modos :math:`l` y :math:`m`.
fr_fr: Nous soulignons ici la différence entre les opérateurs définis ci-desus et la structure électronique. Tout d'abord, comme nous l'avons déjà mentionné, le potentiel contient (en principe) des termes de couplage à trois corps et plus, qui conduisent à des cordes avec six (ou plus) opérateurs de seconde quantification. De plus, l'Hamiltonien conserve le nombre de particules pour chaque mode, comme on peut le voir du fait que le nombre d'opérateurs de création et d'annihilation pour un mode donné est le même à chaque terme. Néanmoins, différents modes sont couplés par des termes à deux corps (et plus) contenant des opérateurs de SQ appartenant à différents modes :math:` l ` et :math:` m `.
id_id: Kami menyoroti perbedaan antara operator yang ditentukan di atas dan struktur elektronik satu. Pertama, seperti yang sudah disebutkan, potensial mengandung (pada prinsipnya) suku kopling tiga- dan lebih tinggi- benda yang mengarah ke string dengan enam (atau lebih) operator kuantisasi kedua. Selain itu, Hamiltonian menjaga jumlah partikel untuk setiap mode, seperti yang dapat dilihat dari fakta bahwa jumlah operator penciptaan dan penihilan untuk sebuah mode tertentu sama dalam setiap suku. Namun, mode yang berbeda digabungkan oleh suku-suku dua- (dan lebih tinggi-) benda berisi operator SQ yang tergabung dalam mode yang berbeda :math:` l ` dan :math:` m `.
ja: ここで、上に定義した演算子と電子構造の演算子の違いを強調しておきます。まず既に述べたように、ポテンシャルには (原理的には) 三体やそれより高次の多体結合項が含まれており、これにより 6 つ (あるいはそれ以上の) 第二量子化演算子をもった演算子となっています。さらに、与えられたモードの生成演算子と消滅演算子の数が各項で同じであることからもわかるように、ハミルトニアンは各モードの粒子数を保存しています。一方で異なるモードは、相異なるモード :math:`l` と :math:`m` に属する第二量子化演算子を含んだ、二体 (あるいはそれより高次) の項 によって結合されています。
ko: 여기에서 정의한 연산자와 전자 구조 1과의 차이를 여기에서 강조한다. 첫째, 이미 언급한 바와 같이, 전위는 (원칙적으로) 6개 (또는 그 이상) 의 제2양자화 연산자를 갖는 스트링들을 유도하는 3-및 보다 높은 바디 커플링 조건들을 포함한다. 더욱이, 해밀턴은 주어진 모드에 대한 생성 및 소멸 연산자의 수가 각각의 용어에서 동일하다는 사실로부터 알 수 있는 바와 같이, 각각의 모드에 대한 입자의 수를 보존한다. 그럼에도 불구하고, 상이한 모드들은 상이한 모드들 :math:`l` 및 :math:`m` 에 속하는 SQ 연산자들을 포함하는 2개 - (더 높은) 바디 용어들에 의해 연결된다.
pt_un: Salientamos aqui a diferença entre os operadores definidos aqui acima e o da estrutura electrônica. Em primeiro lugar, como já mencionamos, o potencial contém (em princípio) termos de acoplamento de três e mais corpos que resultam em strings com seis (ou mais) operadores de segunda quantização. Além disso, os Hamiltonianos conservam o número de partículas para cada modo, como pode ser visto pelo fato do número de operadores de criação e de aniquilação para um determinado modo ser igual em cada termo. No entanto, diferentes modos são acoplados por termos de dois (e mais) corpos contendo operadores SQ pertencentes a diferentes modos :math:`l` e :math:`m`.
tr: Burada yukarıda tanımlanan operatörler ile elektronik yapı arasındaki farkı vurguluyoruz. İlk olarak, daha önce bahsettiğimiz gibi, potansiyel (prensipte) altı (veya daha fazla) ikinci nicemleme operatörlü dizilere yol açan üç ve daha yüksek gövdeli birleştirme terimlerini içerir. Ayrıca, Hamiltonian, belirli bir mod için yaratma ve yok etme operatörlerinin sayısının her terimde aynı olması gerçeğinden görülebileceği gibi, her mod için parçacık sayısını korur. Bununla birlikte, farklı kipler, farklı kiplere ait SQ operatörlerini içeren iki (ve daha yüksek) gövde terimleriyle birleştirilir :math:`l` ve :math:`m`.

source: Reference: Ollitrault, Pauline J., et al., arXiv:2003.12578 (2020).
bn_bn: তথ্যসূত্র (রেফারেন্স): Ollitrault, Pauline J., et al., arXiv:2003.12578 (2020)।
es_un: Referencia: Ollitrault, Pauline J., et al., arXiv:2003.12578 (2020).
fr_fr: Référence: Ollitrault, Pauline J., et al., arXiv:2003.12578 (2020).
id_id: Referensi: Ollitrault, Pauline J., et al., arXiv:2003.12578 (2020).
ja: 参考文献: Ollitrault, Pauline J., et al., arXiv:2003.12578 (2020).
ko: 참조: 문헌 [Ollitrault, Pauline J., et al., arXiv:2003.12578 (2020)] 을 참조한다.
pt_un: Referência: Ollitrault, Pauline J., et al., arXiv:2003.12578 (2020).
tr: Referans: Ollitrault, Pauline J., ve diğerleri, arXiv:2003.12578 (2020).

source: Compute the electronic potential
bn_bn: ইলেকট্রনিক সম্ভাবনা গণনা করা
es_un: Calcular el potencial electrónico
fr_fr: Calcul du potentiel électronique
id_id: Menghitung potensial elektronik
ja: 電子ポテンシャルの計算
ko: 전자 잠재력 계산
pt_un: Calcule o potencial eletrônico
tr: Elektronik potansiyeli hesaplayın

source: Solving the ESE for different nuclear configurations to obtain the PES function :math:`V(Q_1, \ldots, Q_L)`. So far Qiskit gives the possibility to approximate the PES with a quartic force field.
bn_bn: PES ফাংশন পেতে বিভিন্ন পারমাণবিক কনফিগারেশনের জন্য ESE সমাধান করা :math:`V(Q_1, \ldots, Q_L)`। এখন পর্যন্ত Qiskit একটি কোয়ার্টিক ফোর্স ক্ষেত্রের সাথে PES এর আনুমানিক সম্ভাবনা দেয়।
es_un: Resolver el ESE para diferentes configuraciones nucleares para obtener la función PES :math:`V(Q_1, \ldots, Q_L)`. Hasta ahora Qiskit ofrece la posibilidad de aproximar la PES con un campo de fuerza cuártico.
fr_fr: Résoudre l'ESE pour différentes configurations nucléaires afin d'obtenir la fonction PES :math:` V (Q_1, \lpoints, Q_L) `. Jusqu'à présent, Qiskit donne la possibilité d'approcher le PSE avec un champ de force quartique.
id_id: Memecahkan ESE ini untuk konfigurasi nuklir yang berbeda untuk mendapatkan fungsi PES :math:` V (Q_1, \ldots, Q_L) `. Sejauh ini Qiskit memungkinkan untuk memperkirakan PES dengan medan gaya kuartik.
ja: 異なる原子核配置に対して ESE を解くことで、 PES 関数 :math:`V(Q_1, \ldots, Q_L)` を求めることができます。現在では Qiskit によって、 PES を四次力場で近似することが可能です。
ko: 상이한 핵 구성을 위해 상기 ESE를 솔빙하여 PES기 능 :math:'V (Q_1, \ldot, Q_L)' 를 얻는다.
pt_un: Resolvendo o ESE para diferentes configurações nucleares para obter a função PES :math:`V(Q_1, \ldots, Q_L)`. Até agora, o Qiskit dá a possibilidade de aproximar o PES com um campo de força quártico.
tr: PES işlevini elde etmek için farklı nükleer konfigürasyonlar için ESE'yi çözme :math:`V(Q_1, \ldots, Q_L)`. Şimdiye kadar Qiskit, PES'e bir kuartik kuvvet alanı ile yaklaşma imkanı veriyor.

source: The advantage of such form for the PES is that the anharmonic force fields (:math:`k_{ij}`, :math:`k_{ijk}`, :math:`k_{ijkl}`) can be calculated by finite-difference approaches. For methods for which the nuclear energy Hessian can be calculated analytically with response theory-based methods (such as HF and DFT), the quartic force field can be calculated by semi-numerical differentiation as:
bn_bn: PES এর জন্য এই ধরনের ফর্মের সুবিধা হল যে anharmonic force ক্ষেত্রগুলি (:math:`k_{ij}`, :math:`k_{ijk}`, :math:`k_{ijkl}`) সসীম দ্বারা গণনা করা যায় -পার্থক্য পদ্ধতি যেসব পদ্ধতির জন্য পারমাণবিক শক্তি হেসিয়ানকে প্রতিক্রিয়া তত্ত্ব-ভিত্তিক পদ্ধতি (যেমন এইচএফ এবং ডিএফটি) দিয়ে বিশ্লেষণাত্মকভাবে গণনা করা যায়, কোয়ার্টিক বল ক্ষেত্রটি আধা-সংখ্যাসূচক অন্তরীকরণ দ্বারা গণনা করা যেতে পারে:
es_un: La ventaja de dicha forma para la PES es que los campos de fuerza anarmónicos (:math:`k_{ij}`, :math:`k_{ijk}`, :math:`k_{ijkl}`) se pueden calcular por enfoques de diferencia finita. Para métodos para los que la energía nuclear del Hessiano se puede calcular analíticamente con métodos basados en la teoría de la respuesta (como HF y DFT) , el campo de fuerza cuártico se puede calcular mediante una diferenciación semi-numérica como:
fr_fr: L'avantage de cette forme pour le PSE est que les champs de force anharmonique (:math:` k_{ij}`, :math:` k_{ijk}`, :math:` k_{ijkl}`) peuvent être calculés par des approches de différences finies. Pour les méthodes pour lesquelles l'énergie nucléaire Hessian peut être calculée de manière analytique avec des méthodes théorique de réponse (telles que HF et DFT), le champ de force quartique peut être calculé par différenciation semi-numérique comme suit:
id_id: Keuntungan dari bentuk tersebut untuk PES adalah bahwa medan gaya anharmonic (:math:` k_{ij}`, :math:` k_{ijk}`, :math:` k_{ijkl}`) dapat dihitung dengan pendekatan beda-hingga. Untuk metode yang mana energi nuklir Hessian dapat dihitung secara analitik dengan metode berbasis teori respon (seperti HF dan DFT), medan gaya kuartik dapat dihitung oleh diferensiasi semi-numerik sebagai:
ja: このような形式の PES の利点は、非調和力場 ( :math:`k_{ij}`, :math:`k_{ijk}`, :math:`k_{ijkl}` ) が有限差分法によって求められることです。応答理論に基づく手法 (HF や DFT) によって原子核エネルギーのヘシアンが解析的に求まる手法については、準数値微分によって四次力場を次のように計算することができます。
ko: 이러한 PES의 형태의 이점은 무조화 힘 필드 (:math:`k_{ij}`, :math:`k_{ijk}`, :math:`k_{ijkl}`) 가 유한한 차이 접근법에 의해 계산될 수 있다는 것이다. 핵 에너지 헤시안이 반응 이론-기반 방법 (예를 들어, HF및 DFT) 에 의해 분석적으로 계산될 수 있는 방법에 있어서, 4차 힘 필드는 하기와 같이 반-수치 분화에 의해 계산될 수 있다:
pt_un: A vantagem de tal forma para o PES é que os campos de força anarmônicos (:math:`k_{ij}`, :math:`k_{ijk}`, :math:`k_{ijkl}`) podem ser calculados com abordagens de diferenças finitas. Para métodos para os quais a energia nuclear Hessiana pode ser calculada analiticamente com métodos baseados na teoria de resposta (como HF e DFT), o campo de força quártica pode ser calculado pela diferenciação semi-numérica como:
tr: PES için böyle bir formun avantajı, anharmonik kuvvet alanlarının (:math:`k_{ij}`, :math:`k_{ijk}`, :math:`k_{ijkl}`) sonlu-farklı yaklaşımlar tarafından hesaplanabilmesidir. Nükleer enerji Hessian'ın yanıt teorisine dayalı yöntemlerle (HF ve DFT gibi) analitik olarak hesaplanabildiği yöntemler için, kuartik kuvvet alanı aşağıdaki gibi yarı sayısal türevle hesaplanabilir:

source: and
bn_bn: এবং
es_un: y
fr_fr: et
id_id: dan
ja: および
ko: 그리고
pt_un: e
tr: ve

source: Such numerical procedure is implemented, for instance, in the Gaussian suite of programs.
bn_bn: উদাহরণস্বরূপ, এই ধরনের সংখ্যাগত পদ্ধতি গাউসিয়ান স্যুটের নির্দেশমালায় প্রয়োগ করা হয়।
es_un: Tal procedimiento numérico está implementado, por ejemplo, en el conjunto de programas Gaussian.
fr_fr: Une telle procédure numérique est mise en œuvre, par exemple, dans la suite Gaussienne de programmes.
id_id: Prosedur numerik seperti ini diimplementasikan, misalnya, dalam rangkaian program Gaussian.
ja: 例えばこのような数値的手法は、Gaussian のプログラム・セットに実装されています。
ko: 이러한 수치적 절차는 예를 들어, 가우스 (Gaussian) 프로그램 모음에서 구현된다.
pt_un: Tal procedimento numérico é implementado, por exemplo, na suíte Gaussiana de programas.
tr: Bu tür sayısal prosedür, örneğin Gaussian programlarının paketinde uygulanmaktadır.

source: In practice this can be done with Qiskit using the GaussianForceDriver.
bn_bn: বাস্তবে এটি Qiskit-এর সাথে গাউসিয়ানফোর্সড্রাইভার(GaussianForceDriver) ব্যবহার করে করা যেতে পারে।
es_un: En la práctica esto se puede hacer con Qiskit usando GaussianForceDriver.
fr_fr: En pratique, cela peut être fait avec Qiskit en utilisant le GaussianForceDriver.
id_id: Dalam praktiknya hal ini dapat dilakukan dengan Qiskit menggunakan GaussianForceDriver.
ja: 実際には、これは GaussianForceDriver を使用して、Qiskit で行うことができます。
ko: 실제로 이 작업은 GaussianForceDriver를 사용하여 Qiskit 으로 수행할 수 있다.
pt_un: Na prática isso pode ser feito com Qiskit usando o GaussianForceDriver.
tr: Pratikte bu, GaussianForceDriver kullanılarak Qiskit ile yapılabilir.

source: Map to a qubit Hamiltonian
bn_bn: কিউবিট হ্যামিল্টোনিয়ানে চিত্রায়ন করা
es_un: Mapear a un Hamiltoniano de qubit
fr_fr: Schématiser avec un qubit Hamiltonien
id_id: Memetakan ke Hamiltonian qubit
ja: 量子ビット・ハミルトニアンへのマッピング
ko: 큐비트 Hamiltonian으로 mapping하기
pt_un: Mapear para um Hamiltoniano de qubit
tr: Bir kübit Hamiltonyeni haritalanması

source: Now that we have an approximation for the potential, we need to write the Hamiltonian in second quantization. To this end we need to select a modal basis to calculate the one-body integrals :math:`\langle\phi_{k_i}| V(Q_i) | \phi_{h_i} \rangle`, two-body integrals :math:`\langle\phi_{k_i} \phi_{k_j}| V(Q_i,Q_j) | \phi_{h_i} \phi_{h_j} \rangle`\ …
bn_bn: এখন যেহেতু আমাদের সম্ভাবনার একটি আনুমানিকতা আছে, আমাদের দ্বিতীয় পরিমাণে(কোয়ান্টাইজেশনে) হ্যামিল্টোনিয়ান লিখতে হবে। এই লক্ষ্যে আমাদের এক-দেহের অবিচ্ছেদ্য হিসাব করার জন্য একটি মোডাল ভিত্তি নির্বাচন করতে হবে :math:`\langle\phi_{k_i}| V(Q_i) | \phi_{h_i} \rangle`, two-body integrals :math:`\langle\phi_{k_i} \phi_{k_j}| V(Q_i,Q_j) | \phi_{h_i} \phi_{h_j} \rangle`\ …
es_un: Ahora que tenemos una aproximación para el potencial, necesitamos escribir el Hamiltoniano en la segunda cuantización. Para este fin necesitamos seleccionar una a base modal para calcular las integrales de un solo cuerpo :math:`\langle\phi_{k_i}| V(Q_i) | \phi_{h_i} \rangle`, integrales de dos cuerpos :math:`\langle\phi_{k_i} \phi_{k_j}| V(Q_i,Q_j) | \phi_{h_i} \phi_{h_j} \rangle`\ …
fr_fr: Maintenant que nous avons une approximation pour le potentiel, nous devons écrire le Hamiltonien en deuxième quantification. Pour cela, nous devons sélectionner une base modale pour calculer les intégraux d'un corps unique :math:`\langle\phi_{k_i}| V(Q_i) | \phi_{h_i} \rangle`, intégraux à deux corps :math:`\langle\phi_{k_i} \phi_{k_j}| V(Q_i,Q_j) | \\phi_{h_i} \phi_{h_j} \rangle`\ …
id_id: Setelah kita memiliki aproksimasi untuk potensial tersebut, kita perlu menulis Hamiltonian dalam kuantisasi kedua. Untuk tujuan ini, kita perlu memilih sebuah basis modal untuk menghitung integral satu-benda :math:` \langle\phi_{k_i}| V (Q_i) | \phi_{h_i} \rangle `, integral dua-benda :math:` \langle\phi_{k_i} \phi_{k_j}| V (Q_i, Q_j) | \phi_{h_i} \phi_{h_j} \rangle ` \ …
ja: ポテンシャルの近似ができたので、第二量子化でハミルトニアンを書き下す必要があります。そのためには、一体積分 :math:`\langle\phi_{k_i}| V(Q_i) | \phi_{h_i} \rangle` や二体積分 :math:`\langle\phi_{k_i} \phi_{k_j}| V(Q_i,Q_j) | \phi_{h_i} \phi_{h_j} \rangle`\ などを計算するためのモーダル基底を選ぶ必要があります。
ko: 이제 잠재력에 대한 근사값이 있으므로, 해밀턴을 2차 양자화로 작성해야 한다. 이를 위해, 모달 기준을 선택하여 1-체 인테그라스 :math:`\langle\phi_{k_i}| V(Q_i) | \phi_{h_i} \rangle`, 2-체 인테그린 :math:`\langle\phi_{k_i} \phi_{k_j}| V(Q_i,Q_j) | \phi_{h_i} \phi_{h_j} \rangle`\ … 를 계산할 필요가 있다.
pt_un: Agora que temos uma aproximação para o potencial, precisamos escrever o Hamiltoniano na segunda quantização. Para esse fim, precisamos selecionar uma base modal para calcular as integrais de um corpo :math:`\langle\phi_{k_i}| V(Q_i) | \phi_{h_i} \rangle`, integrais de dois corpos :math:`\langle\phi_{k_i} \phi_{k_j}| V(Q_i,Q_j) | \phi_{h_i} \phi_{h_j} \rangle`\ …
tr: Şimdi, mademki potansiyel için bir yaklaşımımız var, Hamiltonyeni ikinci kuantlaşma seviyesinde yazmamız gerekir. Sonunda biz :math:`\langle\phi_{k_i}| V(Q_i) | \phi_{h_i} \rangle` tek cisimli ve :math:`\langle\phi_{k_i} \phi_{k_j}| V(Q_i,Q_j) | \phi_{h_i} \phi_{h_j} \rangle`\ … çift cisimli integralleri hesaplamak için bir mod bazı seçmemiz gerekir…

source: In the simplest case, the :math:`\phi` functions are the harmonic-oscillator eigenfunctions for each mode. The main advantage of this choice is that the integrals of a PES expressed as a Taylor expansion are easy to calculate with such basis. A routine for computing these integrals is implemented in Qiskit.
bn_bn: সহজতম ক্ষেত্রে, :math:`\phi` ফাংশনগুলি প্রতিটি মোডের জন্য হারমোনিক-অসিলেটর(harmonic-oscillator) eigenfunction। এই পছন্দের প্রধান সুবিধা হ'ল টেলর(Taylor) সম্প্রসারণ হিসাবে প্রকাশিত পিইএস-এর অবিচ্ছেদ্য অংশগুলি এই জাতীয় ভিত্তির সাথে গণনা করা সহজ। এই অবিচ্ছেদ্য গুলি গণনা করার জন্য একটি রুটিন Qiskit-এ প্রয়োগ করা হয়েছে।
es_un: En el caso más simple, las funciones :math:`\phi` son las funciones propias del oscilador armónico para cada modo. La principal ventaja de esta elección es que las integrales de una PES expresada como una expansión de Taylor son fáciles de calcular con dicha base. Una rutina para calcular estas integrales está implementada en Qiskit.
fr_fr: Dans le cas le plus simple, les fonctions :math:` \phi sont les fonctions propres d'oscillateur harmonique pour chaque mode. Le principal avantage de ce choix réside dans le fait que les intégrales d'un PES exprimé en tant qu'expansion de Taylor sont faciles à calculer avec cette base. Une routine pour le calcul de ces intégrales est implémentée dans Qiskit.
id_id: Dalam kasus yang paling sederhana, fungsi :math:` \phi ` adalah fungsi eigen osilator harmonik untuk setiap mode. Keuntungan utama dari opsi ini adalah bahwa integral PES yang dinyatakan sebagai ekspansi Taylor mudah untuk dihitung dengan basis tersebut. Sebuah rutin untuk komputasi integral ini diimplementasikan dalam Qiskit.
ja: 最も単純な場合、 :math:`\phi` 関数は各モードの調和振動子固有関数です。この選択の主な利点は、テイラー展開によって表現された PES の積分が、このような基底で簡単に計算できることです。これらの積分を計算するためのルーチンは Qiskit で実装されています。
ko: 가장 간단한 경우에, :math:` \phi 함수는 각 모드에 대한 고조파-오실레이터 고유기능이다. 이러한 선택의 주요 이점은, 테일러 확장으로서 표현되는 PES의 적분이 이러한 기초로 계산하기 용이하다는 것이다. 이러한 통합을 계산하기 위한 루틴은 Qiskit 에서 구현된다.
pt_un: No caso mais simples, as funções :math:`\phi` são as autofunções do oscilador harmônico para cada modo. A principal vantagem desta escolha reside no fato das integrais de um PES expresso como uma expansão de Taylor serem fáceis de calcular com essa base. Uma rotina para calcular essas integrais está implementada no Qiskit.
tr: En basit durumda, :math:`\phi` işlevleri, her mod için harmonik osilatör özfonksiyonlarıdır. Bu seçimin ana avantajı, Taylor açılımı olarak ifade edilen bir PES'in integrallerinin böyle bir temelde hesaplanmasının kolay olmasıdır. Bu integralleri hesaplamak için bir rutin Qiskit'te uygulanmaktadır.

source: The bosonic operator, :math:`\mathcal{H}_\text{vib}^{SQ}`, is then created and must be mapped to a qubit operator. The direct mapping introduced in the first section of this tutorial can be used is Qiskit as follows:
bn_bn: বোসনিক অপারেটর, :math:`\mathcal{H}_\text{vib}^{SQ}`, তারপর তৈরি হয় এবং একটি কিউবিট অপারেটরে চিত্রায়ন করা আবশ্যক হয়। এই পাঠসমূহের প্রথম বিভাগে প্রবর্তিত সরাসরি ম্যাপিং(চিত্রায়ন)-টি Qiskit-এ নিম্নরূপ ব্যবহার করা যেতে পারে:
es_un: El operador bosónico :math:`\mathcal{H}_\text{vib}^{SQ}`, se crea y debe ser mapeado a un operador de qubit. El mapeo directo presentado en la primera sección de este tutorial se puede usar en Qiskit de la siguiente manera:
fr_fr: L'opérateur bosonique, :math:` \mathcal{H}_\text{vib}^{SQ}`, est alors créé et doit être associé à un opérateur de qubit. Le schéma direct introduit dans la première section de ce tutoriel peut être utilisé comme suit:
id_id: Operator bosonik, :math:` \mathcal{H}_\text{vib}^{SQ}`, kemudian dibuat dan harus dipetakan ke operator qubit. Pemetaan secara langsung yang diperkenalkan pada bagian pertama tutorial ini dapat digunakan dalam Qiskit sebagai berikut:
ja: その後、ボソン演算子 :math:`\mathcal{H}_\text{vib}^{SQ}` を生成し、量子ビット演算子にマッピングしなければなりません。このチュートリアルの最初のセクションで紹介した直接的なマッピングは Qiskitを用いて次のようにできます。
ko: 보존(bosonic) 연산자, :math:`\mathcal{H}_\text{vib}^{SQ}` 가 작성되어 큐비트 연산자로 mapping되어야 한다. 이 튜토리얼의 첫 번째 섹션에 소개되었던 직접 mapping은 다음과 같이 Qiskit에서 사용할 수 있다.
pt_un: O operador bosônico, :math:`\mathcal{H}_\text{vib}^{SQ}`, é então criado e deve ser mapeado para um operador de qubit. O mapeamento direto introduzido na primeira seção deste tutorial pode ser usado no Qiskit da seguinte forma:
tr: Bozonik operatör :math:`\mathcal{H}_\text{vib}^{SQ}` daha sonra oluşturulur ve bir kübit operatörüyle eşlenmesi gerekir. Bu öğreticinin ilk bölümünde tanıtılan doğrudan eşleme aşağıdaki gibi Qiskit'te kullanılabilir:

source: The Vibrational operator for the problem now reads as
bn_bn: সমস্যাটির জন্য কম্পন অপারেটর এখন এইভাবে পড়া যায়:
es_un: El operador Vibracional para el problema ahora se lee como
fr_fr: L'opérateur de vibration pour le problème est maintenant comme
id_id: Operator vibrasional untuk masalah sekarang dibaca sebagai
ja: 問題の振動演算子は次のようになります:
ko: 문제의 진동 연산자는 이제 아래와 같이 읽는다
pt_un: O operador vibracional para o problema agora lê-se como
tr: Sorun için titreşim operatörü şimdi şu şekilde okur:

source: In the previous cell we defined a bosonic transformation to express the Hamiltonian in the harmonic modal basis, with 2 modals per mode with the potential truncated at order 2 and the ‘direct’ boson to qubit mapping. The calculation is then ran as:
bn_bn: আগের কোষে আমরা হ্যামিল্টোনিয়ানকে হারমোনিক মোডাল ভিত্তিতে প্রকাশ করার জন্য একটি বোসনিক রূপান্তর সংজ্ঞায়িত করেছি, যাতে অর্ডার 2 এ সম্ভাব্য ছেঁটে ফেলা মোড প্রতি 2 মোডাল এবং 'সরাসরি' (ডিরেক্ট) বোসন থেকে কিউবিট ম্যাপিং (চিত্রায়ন) রয়েছে। গণনা টি তখন যেমন চালানো হয়:
es_un: En la celda previa definimos una transformación bosónica para expresar el Hamiltoniano en la base modal armónica, con 2 modales por modo con el potencial truncado en orden 2 y el bosón 'directo' al mapeo en qubit. El cálculo se ejecuta luego como:
fr_fr: Dans la cellule précédente, nous avons défini une transformation bosonique afin d'exprimer le Hamiltonien dans la base modale harmonique, avec 2 modals par mode avec le potentiel tronqué à l'ordre 2 et le boson ‘direct’ à qubit cartographié. Le calcul est alors exécuté comme suit :
id_id: Dalam sel sebelumnya kami mendefinisikan transformasi bosonik untuk mengekspresikan Hamiltonian di basis modal harmonik, dengan 2 modal per mode dengan potensial dipotong di urutan 2 dan boson 'langsung' untuk pemetaan qubit. Perhitungan tersebut kemudian dijalankan sebagai:
ja: 一つ前のセルでは、調和モーダル基底でハミルトニアンを表現するためにボソン変換を定義しました。ここでは、一つのモードごとに二つのモーダルが対応付けられ、ポテンシャルは二次で打ち切られており、ボソンの量子ビットに対する「直接的な」マッピングとなっています。計算は次のように実行されます。
ko: 이전의 셀에서, 본 발명자들은 고조파 모달 기준으로 해밀턴을 표현하기 위해 보온톤 변환을 정의하였으며, 2개의 모달기가 차수 2에서 절단될 수 있고, '다이렉트' 보아들이 맵핑을 절단하였다. 계산은 다음과 같이 실행된다.
pt_un: Na célula anterior definimos uma transformação bosónica para expressar o Hamiltoniano na base modal harmônica, com 2 modais por modo com o potencial truncado na ordem 2 e o mapeamento ‘direto’ bóson para qubit. O cálculo é então executado como:
tr: Önceki hücrede, Hamiltonyeni harmonik mod bazında ifade etmek için, mod başına 2 modlu, potansiyel ikinci sırada kesilen ve ‘direct’ bozonu kübit eşlemeye sahip bir bozonik dönüşüm tanımladık. Hesaplama daha sonra şu şekilde çalıştırılır:

source: To have a different number of modals per mode:
bn_bn: প্রতি মোডে বিভিন্ন সংখ্যক মোডালের জন্য:
es_un: Para tener un número diferente de modales por modo:
fr_fr: Pour avoir un nombre différent de modaux par mode:
id_id: Untuk memiliki jumlah modal per mode yang berbeda:
ja: モードごとに異なるモーダルをもたせるためには、以下のようにします。
ko: 모드당 다른 수의 모조물을 사용하려면 다음을 수행하십시오.
pt_un: Para ter um número diferente de modais por modo:
tr: Her durum başına farklı sayıda modellere sahip olmak için:
