Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/02_vibrational_structure.po
Languages: bn_bn, es_un, fr_fr, id_id, ja, ko, pt_un, tr

source: This page was generated from `docs/tutorials/02_vibrational_structure.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/02_vibrational_structure.ipynb`__ -থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `docs/tutorials/02_vibrational_structure.ipynb`__.
fr_fr: Cette page a été générée à partir de `docs/tutorials/02_vibrational_structure.ipynb`__.
ja: このページは `docs/tutorials/02_vibrational_structure.ipynb`__ から生成されました。
ko: 이 페이지는 `docs/tutorials/02_vibrational_structure.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/02_vibrational_structure.ipynb`__.
tr: Bu sayfa `docs/tutorials/02_vibrational_structure.ipynb`__ adresinden oluşturulmuştur.

source: Vibrational structure
bn_bn: কম্পন গঠন
es_un: Estructura vibracional
fr_fr: Structure vibronique
id_id: Struktur vibrasional
ja: 振動構造
ko: 진동 구조
pt_un: Estrutura vibracional
tr: Titreşimli yapı

source: The molecular Hamiltonian is
bn_bn: মলিকুলার বা আণবিক হ্যামিল্টোনিয়ান হলো
es_un: El Hamiltoniano molecular es
fr_fr: Le Hamiltonien moléculaire est
ja: ある分子のハミルトニアンは、以下の数式で表されます。
ko: 분자 해밀톤은
pt_un: O Hamiltoniano molecular é
tr: Moleküler Hamiltonyen şu şekildedir

source: \mathcal{H} = - \sum_I \frac{\nabla_{R_I}^2}{M_I} - \sum_i \frac{\nabla_{r_i}^2}{m_e} - \sum_I\sum_i \frac{Z_I e^2}{|R_I-r_i|} + \sum_i \sum_{j>i} \frac{e^2}{|r_i-r_j|} + \sum_I\sum_{J>I} \frac{Z_I Z_J e^2}{|R_I-R_J|}
fr_fr: \mathcal{H} = - \sum_I \frac{\nabla_{R_I}^2}{M_I} - \sum_i \frac{\nabla_{r_i}^2}{m_e} - \sum_I\sum_i \frac{Z_I e^2}{|R_I-r_i|} + \sum_i \sum_i \sum_{j>i}{|r_i-r_j|} + \frac{e^2} + \sum_I\sum_{J>I} \frac{Z_J e^2}{|R_I-R_J|}

source: Because the nuclei are much heavier than the electrons they do not move on the same time scale and therefore, the behavior of nuclei and electrons can be decoupled. This is the Born-Oppenheimer approximation.
bn_bn: যেহেতু ইলেকট্রনের চেয়ে নিউক্লিয়াস বা কেন্দ্র বেশি ভারী, তাই তারা একই সময় স্কেলে স্থানপরিবর্তন করে না। তাই নিউক্লিয়াস এবং ইলেকট্রনের ধর্মকে ডিকাপ্লিং বা পৃথক করা যায়। এটি হল বর্ন-ওপেনহাইমার অনুমান।
es_un: Cómo los núcleos son mucho más pesados que los electrones, no se mueven en la misma escala de tiempo, entonces, el comportamiento de los núcleos y los electrones puede estar desacoplado. Esta es la aproximación de Born-Oppenheimer.
fr_fr: Comme les noyaux d'atomes sont beaucoup plus lourds que les électrons ils ne bougent pas sur la même échelle de temps et, par conséquent, le comportement des noyaux et du nuage d'électrons peuvent être découplés. C'est l'approximation de Born-Oppenheimer.
ja: 原子核は電子よりも非常に重い質量を有するため、原子核は電子に比べて非常に遅い運動速度となります。したがって、原子核と電子の運動は分離しているとみなして考えることができます。 これはボルン・オッペンハイマー近似と呼ばれています。
ko: 핵들은 동일한 시간 축척으로 이동하지 않는 전자들보다 훨씬 더 무거운 것이기 때문에, 핵들 및 전자들의 거동은 분리될 수 있다. 이것은 Born-Oppenheimer 근사치이다.
pt_un: Porque os núcleos são muito mais pesados que os elétrons eles não se movem na mesma escala de tempo e, portanto, o comportamento de núcleos e elétrons pode ser desacoplado. Esta é a aproximação Born-Oppenheimer.
tr: Çekirdek elektronlardan daha ağır olduklarından ötürü aynı zaman ölçüsünde hareket etmezler, bundan dolayı çekirdeğin ve elektronların davranışları ayrılabilir. Bu Born-Oppenheimer yaklaşımıdır.

source: Within the Born-Oppenheimer approximation, a molecular wave function is factorized as a product of an electronic part, which is the solution of the electronic Schroedinger equation, and a vibro-rotational one, which is the solution of the nuclear Schroedinger equation in the potential energy surface (PES) generated by sampling the eigenvalues of the electronic Schroedinger equation for different geometries.
bn_bn: বর্ন-ওপেনহাইমার অনুমান সাপেক্ষে, একটি আণবিক তরঙ্গ ফাংশনকে একটি ইলেকট্রনিক অংশ, যেটি ইলেকট্রনিক শ্রডিঙ্গার সমীকরণ এর সমাধান এবং একটি ভিব্রিও-রোটেশনাল অংশ, যা বিভিন্ন জ্যামিতির জন্য ইলেকট্রনিক শ্রডিঙ্গার সমীকরণের স্বকীয়মান (আইগেনভ্যালু) প্রতিস্থাপন দ্বারা নির্মিত স্থিতিশক্তিতলে নিউক্লিয়ার শ্রডিঙ্গার সমীকরণের সমাধান এর গুণফল রূপে প্রকাশ করা যায়।
es_un: Dentro de la aproximación de Born-Oppenheimer, una función de onda molecular es factorizada como un producto de una parte electrónica, que es la solución a la ecuación de Schrödinger electrónica, una parte vibro-rotacional, que es la solución de la ecuación de Schrödinger nuclear en la superficie de energía potencial (potential energy surface, PES), generada al muestrear los valores propios de la ecuación de Schrödinger electrónica para diferentes geometrías.
fr_fr: Dans le cadre de l'approximation de Born-Oppenheimer, une fonction d'onde moléculaire est factorisée en tant que produit d'une partie électronique, qui est la solution de l'équation électronique de Schrödinger, et d'une solution vibro-rotationnelle, qui est la solution de l'équation de Schrödinger nucléaire dans la surface d'énergie potentielle (PSE) générée par l'échantillonnage des valeurs propres de l'équation de Schrödinger électronique pour différentes géométries.
id_id: Dalam pendekatan Born-Oppenheimer, sebuah fungsi gelombang molekuler difaktorisasi sebagai perkalian produk dari bagian elektronik, yang merupakan solusi dari persamaan Schroedinger untuk elektron, dan vibro-rotational, yang merupakan solusi dari persamaan Schroedinger untuk inti pada permukaan energi potential (potential energy surface, PES) yang dihasilkan dengan menyampel nilai eigen dari persamaan Schroedinger elektronik untuk geometri yang berbeda.
ja: ボルン・オッペンハイマー近似では、分子の波動関数は各電子の波動関数と振動回転スペクトルの積として表現されています。電子の波動関数は、電子のシュレーディンガー方程式の解に相当します。また、振動回転スペクトルは、様々な構造に対する電子のシュレディンガー方程式の固有値サンプリングによって生成されるポテンシャルエネルギー曲面(PES) での原子核のシュレーディンガー方程式の解に相当します。
ko: Born-Oppenheimer 근사에 따르면, 분자 파동 함수는 전자적인 부분(전자적인 Schrodinger 방정식의 해)과 진동-회전 부분(상이한 기하학적 구조들에 대한 전자 Schrodinger 방정식의 고유값들을 샘플링함으로써 생성되는 잠재적 에너지 표면 (PES)내의 핵 Schrodinger 방정식의 해)으로 분해할 수 있다.
pt_un: Dentro da aproximação Born-Oppenheimer, uma função de onda molecular é fatorizada como um produto de uma parte eletrônica, que é a solução da equação de Schroedinger eletrônica, e de uma vibro-rotacional, que é a solução da equação de Schroedinger nuclear na superfície de energia potencial (PES) gerada pela amostragem dos autovalores da equação de Schroedinger eletrônica para diferentes geometrias.
tr: Born-Oppenheimer yaklaşımında, bir moleküler dalga fonksiyonu, elektronik Schroedinger denkleminin çözümü ve vibro-rotasyonel olan, nükleer Schroedinger denkleminin potansiyel enerji zeminindeki (PES) elektornik Schroedinger denkleminin farklı geometriler için olan özdeğerlerinin örneklendirilmesiyle oluşturulmuş çözümü olan elektronik parçanın ürünü olarak çarpanlarına ayrılmıştır.

source: The nuclear Schroedinger equation is usually solved in two steps, in analogy with its electronic counterpart. A single-particle basis (the basis functions are called, in this case, modals) is obtained either by the harmonic approximation applied to the PES or from a vibrational self-consistent field (VSCF) calculation. Vibrational anharmonic correlations are added a-posteriori with perturbative or variational approaches. The latter include Vibrational Configuration Interaction (VCI) and Vibrational Coupled Cluster (VCC) for highly-accurate anharmonic energies. The main advantage of VCI and VCC over alternative approaches (such as perturbation theories) is that their accuracy can be systematically improved towards the complete basis set limit for a given PES. However, their applicability is limited to small molecules with up to about 10 atoms due to their unfavorable scaling with system size.
bn_bn: নিউক্লিয়ার শ্রডিঙ্গার সমীকরণ সাধারণত দুটো ধাপে সমাধান করা হয়, অনেকটা এর ইলেকট্রনিক অংশ এর মতো। একটি একক-কণা (সিঙ্গেল-পার্টিকেল) বেসিস বা ভিত্তি(এই ভিত্তি ফাংশনগুলিকে এক্ষেত্রে মডালস বলা হয়) হয় পিইএস(PES)এ হারমোনিক অনুমান এর দ্বারা, নয়তো ভাইব্রেশনাল স্ব-স্থায়ী ক্ষেত্র (VSCF) গননার দ্বারা নির্ধারন করা হয়। ভাইব্রেশনাল অ্যানহারমোনিক অনুবন্ধগুলি যুক্তিপূর্ণ ভাবে পার্টার্বেটিভ বা পরিবর্তনশীল (ভ্যারিয়েশনাল) পদ্ধতির দ্বারা যুক্ত করা হয়। খুব নিখুঁত অ্যানহারমোনিক শক্তির ক্ষেত্রে ভাইব্রেশনাল যান্ত্রিক বিন্যাস (কনফিগারেশন) মিথষ্ক্রিয়া (ইন্টারেকশন) এবং ভাইব্রেশনাল যুগলিকৃত ক্লাস্টার শেষেরটি অন্তর্ভুক্ত। অন্যান্য পদ্ধতি(যেমন পার্টারবেশন তত্ত্ব) র ওপর ভিসিআই এবং ভিসিসি র মূল সুবিধা হল যে প্রদত্ত পিইএস এর জন্য তাদের যথাযথতা সম্পূর্ণ ভিত্তি সেট সীমার দিকে নিয়মানুসারে বৃদ্ধি করা যায়। যাইহোক, তাদের প্রয়োগ সিস্টেম আয়তনের প্রতিকূল স্কেলিং এর কারণে ১০টি বা তার চেয়ে কম পরমানু সংখ্যাবিশিষ্ট ছোট অনুর মধ্যে সীমাবদ্ধ।
es_un: La ecuación de Schrödinger nuclear generalmente se resuelve en dos pasos, en analogía con su contraparte electrónica. Una base de una sola partícula (las funciones base se denominan, en este caso, modales) se obtiene mediante la aproximación armónica aplicada al PES o a partir de un cálculo de campo autoconsistente vibracional (vibrational self-consistent field, VSCF). Las correlaciones anarmónicas vibracionales son agregadas a posteriori con enfoques perturbativos o variacionales. Estos últimos incluyen la Interacción de Configuración Vibracional (Vibrational Configuration Interaction, VCI) y Clúster Acoplado Vibracional (Vibrational Coupled Cluster, VCC) para energías anarmónicas de alta precisión. La principal ventaja de VCI y VCC sobre los enfoques alternativos (como las teorías de perturbación) es que su precisión se puede mejorar sistemáticamente hacia el límite del conjunto de bases completo para un PES dado. Sin embargo, su aplicabilidad está limitada a moléculas pequeñas de hasta unos 10 átomos debido a su escalado desfavorable con el tamaño del sistema.
fr_fr: L'équation de Schrödinger nucléaire est généralement résolue en deux étapes, par analogie avec son homologue électronique. Une base à une seule particule (dans ce cas, les fonctions de base sont appelées les modes) est obtenue soit par l'approximation harmonique appliquée au PES, soit à partir d'un calcul de champ auto-cohérent vibrationnel (VSCF). Des corrélations anharmoniques vibrationnelles sont ajoutées a-posteriori avec des approches perturbatives ou variationnelles. Ces dernières incluent l'interaction de configuration vibrationnelle (VCI) et le Cluster Vibrationnel Couplé (VCC- CVC) pour des énergies anharmoniques très précises. Le principal avantage de VCI et de VCC sur d'autres approches (telles que les théories perturbationnelles) est que leur précision peut être systématiquement améliorée vers la limite de base complète pour une PES donnée. Cependant, leur applicabilité est limitée à de petites molécules ayant jusqu'à 10 atomes en raison de leur passage à l'échelle défavorable vis-à-vis de la taille du système considéré.
id_id: Persamaan Schroedinger nuklir biasanya diselesaikan dalam dua langkah, seperti penyelesaian suku elektronik. Sebuah basis partikel tunggal (dalam hal ini fungsi basis disebut modal) diperoleh baik melalui pendekatan harmonik yang diterapkan pada PES atau dari suatu perhitungan vibrasional self-consistent field (VSCF). Vibrational anharmonic corelations ditambahkan setelahnya dengan pendekatan perturbatif dan variasional. Yang terakhir termasuk Vibrational Configuration Interaction (VCI) dan Vibrational Coupled Cluster (VCC) untuk energi anharmonik yang sangat akurat. Keuntungan utama dari VCI dan VCC dibandingkan dengan pendekatan alternatif (seperti teori perturbasi) adalah bahwa akurasi mereka dapat ditingkatkan secara sistematis menuju basis yang lebih lengkap dengan batasan PES yang diberikan. Namun, penggunaan ini terbatas pada molekul kecil sampai sekitar 10 atom karena sistem yang kurang medukung penskalaan ukuran sistem.
ja: 原子核のシュレディンガー方程式は、通常、電子の場合と対比して、2段階で求解されます。 まず、単一粒子の基底状態 (この場合基底関数はモーダル(modals) と呼ばれます) は、ポテンシャルエネルギー曲面 (PES) に適用される調和近似もしくは振動自己無撞着場(VSCF) の計算から得られます。非調和振動の相関は、摂動的または変分法的なアプローチで帰納法的に追加されます。後者には、非調和振動子のエネルギーを高精度に導出可能にする振動配置間相互作用(VCI) と振動結合クラスター(VCC) が含まれます。 他のアプローチ (例：摂動論) に対するVCI法・VCC法の主な優位性は、所定のポテンシャルエネルギー曲面 (PES) での完全基底系限界に対する精度の系統的な向上にあるとされています。 しかし、この優位性は、系が大きくなると不利に働くため、原子数が最大10個程度の小さな分子に限定されています。
ko: 핵 슈뢰딩거 방정식은 통상적으로 두 단계로 해결되는데, 이는 이것의 전자 대응물과 유사하다. 단일-입자 (single-particle basis) (이러한 경우에 기저 함수들이라 칭함)는 PES에 적용되는 조화 근사법 의해 또는 진동 자체 일관 장 (vibrational self-consistent field, VSCF) 계산으로부터 얻어진다. 진동 부조화 상관계수 (Vibrational anharmonic correlations)는 섭동 또는 다양한 접근법을 가지고 결과에서 원인을 분석해 추가한다. 마지막에는 진동 배열 상호작용(Vibrational Configuration Interaction) VCI 및 진동 결합된 클러스터(Vibrational Coupled Cluster) VCC 를 높은 정확성의 부조화 에너지를 위해 포함한다. 섭동 이론들과 같은 대체적인 접근법에 비해 VCI및 VCC의 주요 이점은 그들의 정확도가 주어진 PES에 대한 완전한 기준 설정 한계를 향하여 체계적으로 개선될 수 있다는 것이다. 그러나 이들의 적용성은 시스템 크기에 의한 바람직하지 않은 스케일링으로 약 10개 이하의 원자를 갖는 소분자로 제한된다.
pt_un: A equação de Schroedinger nuclear costuma ser resolvida em duas etapas, em analogia com seu homólogo eletrônico. Uma base de partícula única (as funções base são chamadas de modais neste caso) é obtida ou pela aproximação harmônica aplicada ao PES ou a partir de um cálculo de campo auto-consistente vibracional (VSCF). As correlações anarmônicas vibracionais são adicionadas a posteriori com abordagens perturbativas ou variacionais. Estas últimas incluem Interação de Configuração Vibracional (VCI) e Cluster Vibracional Acoplado (VCC) para energias anarmônicas altamente precisas. A principal vantagem do VCI e do VCC sobre as abordagens alternativas (como as teorias de perturbação) é que a sua exatidão pode ser sistematicamente melhorada em direção ao limite do conjunto base completo para um determinado PES. No entanto, sua aplicabilidade é limitada a moléculas pequenas com até cerca de 10 átomos devido à sua dimensionamento desfavorável com o tamanho do sistema.
tr: Nükleer Schrödinger denklemi, elektronik karşılığına benzer şekilde genellikle iki adımda çözülür. Tek parçacık temeli (temel fonksiyonlar, bu durumda modal olarak adlandırılır) ya PES'e uygulanan harmonik yaklaşımla ya da bir titreşimsel kendi kendine tutarlı alan (VSCF) hesaplamasından elde edilir. Titreşimsel anharmonik korelasyonlar, pertürbatif veya varyasyonel yaklaşımlarla a-posteriori olarak eklenir. İkincisi, son derece doğru anharmonik enerjiler için Titreşimsel Yapılandırma Etkileşimi (VCI) ve Titreşimsel Bağlantılı Küme (VCC) içerir. VCI ve VCC'nin alternatif yaklaşımlara (pertürbasyon teorileri gibi) göre ana avantajı, doğruluklarının belirli bir PES için tam temel set limitine doğru sistematik olarak geliştirilebilmesidir. Bununla birlikte, sistem boyutu ile elverişsiz ölçeklenmeleri nedeniyle, uygulanabilirlikleri yaklaşık 10 atoma kadar olan küçük moleküllerle sınırlıdır.

source: To tackle the scaling problem we would like to use quantum algorithms.
bn_bn: স্কেলিং এর সমস্যাকে দূরীভূত করতে আমরা কোয়ান্টাম অ্যালগোরিদম ব্যাবহার করব।
es_un: Para abordar el problema de escalabilidad nos gustaría usar algoritmos cuánticos.
fr_fr: Pour résoudre le problème d'échelle, nous aimerions utiliser des algorithmes quantiques.
id_id: Untuk mengatasi masalah penskalaan kita akan menggunakan algoritme kuantum.
ja: こうした系が大きくなると不利になる問題に対して、量子アルゴリズムの適用が望まれています。
ko: 스케일링 문제를 해결하기 위해 우리는 양자 알고리즘을 사용하고자 한다.
pt_un: Para enfrentar o problema de escala gostaríamos de usar algoritmos quânticos.
tr: Ölçekleme problemini çözmek için kuantum algoritmalarını kullanmak istiyoruz.

source: The nuclear Schroedinger equation is
bn_bn: নিউক্লিয়ার শ্রডিঙ্গার সমীকরণ হল
es_un: La ecuación de Schrödinger nuclear es
fr_fr: L'équation de Schrödinger nucléaire est
id_id: Persamaan Schroedinger untuk inti adalah
ja: 原子核のシュレーディンガー方程式は以下で表されます。
ko: 핵 Schrodinger 방정식은 다음과 같다.
pt_un: A equação de Schroedinger nuclear é
tr: Nükleer Schrödinger denklemi şu şekildedir

source: The so-called Watson Hamiltonian (neglecting vibro-rotational coupling terms) is
bn_bn: তথাকথিত ওয়াটসন হ্যামিল্টোনিয়ান(ভাইব্রিও- রোটেশনাল যুগল পদগুলিকে উপেক্ষা করে) হল
es_un: El llamado Hamiltoniano de Watson (ignorando los términos de acoplamiento vibro-rotacional) es
fr_fr: Ce qu'on appelle l'Hamiltonien Watson (en négligeant les termes de couplage vibro-rotationnel) est
id_id: Maka Hamiltonian Watson (mengabaikan suku kopling vibro-rotational) dapat ditulis
ja: いわゆるWatsonハミルトニアン（振動回転結合を無視）は、以下で表されます。
ko: 소위 Watson Hamiltonian (진동-회전 결합 조건은 무시한)이라 불리는 식은 다음과 같다.
pt_un: O Hamiltoniano de Watson (negligenciando os termos de acoplamento vibro-rotacional) é
tr: Watson Hamiltonyen (titreşim-dönme kuplaj terimlerinin ihmal edilmesi) olarak adlandırılan bu

source: where :math:`Q_l` are the harmonic mass-weighted normal coordinates.
bn_bn: যেখানে math:`Q_l` হল হারমোনিক ভর-তুল্য (মাস-ওয়েটেড) লম্ব স্থানাঙ্ক।
es_un: donde :math:`Q_l` son las coordenadas cartesianas armónicas ponderadas en masa.
fr_fr: où :math:`Q_l` sont les coordonnées normales pondérées par la masse harmonique.
id_id: dimana :math:` Q_l ` adalah massa terbobot harmonik pada koordinat normal.
ja: ここで :math:`Q_l` は調和質量加重正規座標です。
ko: 여기서, :math:`Q_l` 은 조화 질량 가중 법선 좌표이다.
pt_un: onde :math:`Q_l` são as coordenadas normais ponderadas pela massa harmônica.
tr: burada :math:`Q_l` harmonik kütle ağırlıklı normal koordinatlardır.

source: :math:`\mathcal{H}_\text{vib}` must be mapped to an operator that acts on the states of a given set of :math:`N_q` qubits in order to calculate its eigenfunctions on quantum hardware. In electronic structure calculations, the mapping is achieved by expressing the non-relativistic electronic Hamiltonian in second quantization, :nbsphinx-math:`\textit{i.e.}` by projecting it onto the complete set of antisymmetrized occupation number vectors (ONV) generated by a given (finite) set of orbitals. To encode the vibrational Hamiltonian in an analogous second quantization operators, we expand the potential :math:`V(Q_1, \ldots, Q_L)` with the :math:`n`-body expansion as follows:
bn_bn: :math:`\mathcal{H}_\text{vib}` অবশ্যই এমন একটি অপারেটরের সাথে চিত্রায়ন করতে হবে যা কোয়ান্টাম হার্ডওয়্যারের উপর তার eigenfunction-গুলি গণনা করার জন্য :math:`N_q` কিউবিটদের একটি প্রদত্ত সেটের অবস্থাগুলিতে কাজ করে। বৈদ্যুতিন কাঠামোর গণনায়, অ-আপেক্ষিক ইলেকট্রনিক হ্যামিল্টোনিয়ানকে দ্বিতীয় কোয়ান্টাইজেশনে প্রকাশ করে, :nbsphinx-math:`\textit{i.e.}` একটি প্রদত্ত (সসীম) কক্ষপথসমূহের (অরবিটাল) সেট দ্বারা উৎপন্ন অ্যান্টিসিমিট্রাইজড (antisymmetrized) অকুপেশন নম্বর ভেক্টর (ONV) এর সম্পূর্ণ সেটের উপর তুলে ধরে ম্যাপিং (চিত্রায়ন) অর্জন করা হয়। একটি অনুরূপ দ্বিতীয় কোয়ান্টাইজেশন অপারেটরে কম্পন হ্যামিল্টোনিয়ান সংকেতায়ন করতে, আমরা :math:`n`-বডি সম্প্রসারণের সাথে সম্ভাব্য :math:`V(Q_1, \ldots, Q_L)` কে নিম্নরূপ প্রসারিত করি:
es_un: :math:`\mathcal{H}_\text{vib}` debe ser mapeado a un operador que actúa sobre los estados de un conjunto de :math:`N_q` qubits para poder calcular sus funciones propias en hardware cuántico. En los cálculos de estructura electrónica, el mapeo se logra al expresar el Hamiltoniano electrónico no relativista en la segunda cuantización, es decir, proyectándolo sobre el conjunto completo de vectores numéricos (occupation number vectors, ONV) de ocupación antisimetrizados generados por un conjunto dado (finito) de orbitales. Para codificar el Hamiltoniano vibracional en un operador de segunda cuantización análogo, expandimos el potencial :math:`V(Q_1, \ldots, Q_L)` con la expansión de :math:`n` cuerpos de la siguiente manera:
fr_fr: :math:`\mathcal{H}_\text{vib}` doit être mappé à un opérateur qui agit sur les états d'un ensemble donné de :math:`N_q` qubits afin de calculer ses fonctions propres sur la machine quantique. Dans les calculs de structure électronique, la cartographie est réalisée par l'expression de l'hamiltonien électronique non relativiste dans la seconde quantification, :nbsphinx-math:`\textit{i.e.}`, en le projetant sur l'ensemble complet des vecteurs d'occupation antisymétriques (ONV) générés par un ensemble d'orbitales donné (fini). Pour coder l'hamiltonien vibrationnel dans un second opérateur de quantification analogique, nous étendons le potentiel :math:`V (Q_1, \ldots, Q_L)` avec l'extension :math:`n`-body comme suit :
id_id: :math:` \mathcal{H}_\text{vib}` harus dipetakan sebagai operator yang dikenakan pada keadaan dari suatu set tertentu dari :math:` N_q ` qubit dalam rangka untuk menghitung fungsieigen pada perangkat keras kuantum. Dalam kalkulasi struktur elektronik, pemetaan dicapai dengan mengekspresikan Hamiltonian elektronik non-relativistik dalam kuantisasi kedua, :nbsphinx-math:`\textit{i.e.}` dengan memproyeksikan itu ke set yang lengkap ke occupation number vectors (ONV) tak simetri yang dihasilkan oleh himpunan orbital (hingga). Untuk mengkode Hamiltonian vibrasi dalam sebuah analog seperti operator kuantisasi kedua, kita ekspasikan potensial :math:` V (Q_1, \ldots, Q_L) ` dengan ekspansi :math:`n`-benda sebagai berikut:
ja: :math:`\mathcal{H}_\text{vib}` は、量子ハードウェア上で固有関数を計算するために、与えられた :math:`N_q` 量子ビットの状態に作用する演算子にマッピングする必要があります。 電子構造計算では、非相対論的電子ハミルトニアンを第二量子化で表現することによってマッピングを実現することができます。つまり、与えられた(有限の)分子軌道によって生成された反対称化された粒子数表示ベクトル(ONV)の完全なセットとして投影します。 同様に第二量子化演算子に調和振動子ハミルトニアンをエンコードするためには、ポテンシャル :math:`V(Q_1, \ldots, Q_L)` を :math:`n` 体に拡張して以下のように展開します。
ko: :math:`\mathcal{H}_\text{vib}` 는 양자 하드웨어에서 고유 기능을 계산하기 위해 :math:`N_q` 큐비트 세트의 주에서 작동하는 연산자에 매핑되어야 한다. 전자 구조 계산에서, 제2양자화, :nbsphinx-math:`\textit{i.e.}` 를 제2양자화된 (유한) 세트의 오비탈에 의해 생성된 반대칭 점유 직업 수 벡터 (ONV) 의 완전한 세트 상에 투영함으로써 비-관련성 전자 해밀턴을 제2양자화, :nbsphinx-math:`\textit{i.e.}` 로 표현함으로써 매핑이 달성된다. 유사한 제2양자화 오퍼레이터에서 진동 해밀턴을 인코딩하기 위해, 다음과 같이 전위 :math:`V(Q_1, \ldots, Q_L)` 를 확장하여, :math:`n` - 바디 확장을 확장한다:
pt_un: :math:`\mathcal{H}_\text{vib}` deve ser mapeado para um operador que atua sobre os estados de um determinado conjunto de :math:`N_q` qubits para calcular suas autofunções no hardware quântico. Em cálculos da estrutura eletrônica, o mapeamento é alcançado através da expressão do Hamiltoniano não relativístico eletrônico na segunda quantização, :nbsphinx-math:`\textit{i.e.}` projetando-o no conjunto completo de vetores de número de ocupação antisimétricos (ONV) gerados por um dado (finito) conjunto de orbitais. Para codificar o Hamiltoniano vibracional em operadores de segunda quantização análogos, nós expandimos o potencial :math:`V(Q_1, \ldots, Q_L)` com a expansão dos :math:`n` corpos da seguinte forma:
tr: Özfonksiyonlarını bir kuantum donanımı üzerinde hesaplayabilmek için; :math:`\mathcal{H}_\text{vib}`in, :math:`N_q` kübitlerinde işleyen bir operatörde haritalanması gerek. Elektronik yapı hesaplamalarında haritalama, göreli olmayan elektronik Hamiltonyen ikinci kuantlaşmasını :nbsphinx-math:`\textit{i.e.}` verilmiş (sınırlı) bir kümedeki orbitaller tarafından oluşturulmuş antisimetrik dolu sayı vektörleri (ONV) kümesine yansıtarak elde edilir. Titreşimsel Hamiltonyen muadili olan ikinci kuantlaşma seviyesindeki operatörlerde kodlamak için :math:`n`- cisim büyütmesi ile :math:`V(Q_1, \ldots, Q_L)` i potansiyelini aşağıda gösterildiği gibi genişletiyoruz:
