Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/02_vibrational_structure.po
Languages: bn_bn, es_un, fr_fr, id_id, ja, ko, pt_un, tr

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
ja: はじめに
ko: 소개
pt_un: Introdução
tr: Giriş

source: Solving the ``VibrationalStructureProblem``
ja: ``VibrationalStructureProblem`` の解決

source: In the following, we will compute the ground-state of our problem instance. To learn more about the individual components that go into the ``GroundStateSolver``, please refer to the corresponding tutorials.
ja: 以下では、我々の問題インスタンスの基底状態を計算します。 ``GroundStateSolver`` に入る個々のコンポーネントの詳細については、 `対応するチュートリアルを参照してください。

source: Now that the Hamiltonian is ready, it can be used in a quantum algorithm to find information about the vibrational structure of the corresponding molecule. Check out our tutorials on Ground State Calculation and Excited States Calculation to learn more about how to do that in Qiskit Nature!
bn_bn: এখন যেহেতু হ্যামিল্টোনিয়ান প্রস্তুত, এটি একটি কোয়ান্টাম ধারাক্রম (অ্যালোগরিদম) ব্যবহার করে সংশ্লিষ্ট অণুর কম্পন গঠন সম্পর্কে তথ্য খুঁজে পেতে পারে। Qiskit Nature-এ কীভাবে এটি করা যায় সে সম্পর্কে আরও জানতে গ্রাউন্ড স্টেট ক্যালকুলেশন এবং উত্তেজিত (এক্সাইটেড) স্টেটস ক্যালকুলেশনে আমাদের পাঠসমূহ (টিউটোরিয়ালস) গুলি দেখুন!
id_id: Sekarang Hamiltonian sudah siap, Hamiltonian itu dapat digunakan di algoritme kuantum untuk menemukan informasi mengenai struktur vibrasional dari molekul terkait. Lihat tutorial tentang Kalkulasi Keadaan Dasar dan Kalkulasi Keadaan Eksitasi untuk mempelajari lebih lanjut cara melakukan itu di Qiskit Nature!

source: \phi_{k_1}(Q_1) \cdots \phi_{k_L}(Q_L) \equiv |0_1 \cdots 1_{k_1} \cdots 0_{N_1}, 0_1 \cdots 1_{k_2} \cdots 0_{N_2}, \cdots , 0_1 \cdots 1_{k_L} \cdots 0_{N_L}\rangle \, .
ko: \phi_{k_1}(Q_ 1) \cdot \phi_{k_L}(Q_L) \당량 | 0_1 \cdot 1_{k_1} \c도트 0_{N_1}, 0_1 \cdot 1_{k_2} \c도트 0_{N_2}, \cdot, 0_1 \cdots 1_{k_L} \cdots 0_{N_L}\r각도\.
