Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/03_ground_state_solvers.po
Languages: bn_bn, es_un, id_id, ja, ko_kr, ta_in

source: This page was generated from `docs/tutorials/03_ground_state_solvers.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/03_ground_state_solvers.ipynb`__ থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `docs/tutorials/03_ground_state_solvers.ipynb`__.
ja: このページは `docs/tutorials/03_ground_state_solvers.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/03_ground_state_solvers.ipynb`__ 에서 생성되었다.

source: Ground state solvers
bn_bn: ভূমিস্তর সমাধানকারী (Ground state solvers)
es_un: Solucionadores de estado fundamental
id_id: Pemecah keadaan dasar
ja: 基底状態ソルバー
ko_kr: 바닥 상태 Solver들
ta_in: அடி நிலை தீர்வுகள்

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
ja: はじめに
ko_kr: 소개

source: In this tutorial we are going to discuss the ground state calculation interface of Qiskit Nature. The goal is to compute the ground state of a molecular Hamiltonian. This Hamiltonian can for example be electronic or vibrational. To know more about the preparation of the Hamiltonian, check out the `Electronic structure <01_electronic_structure.ipynb>`__ and `Vibrational structure tutorials <02_vibrational_structure.ipynb>`__.
ja: このチュートリアルでは、Qiskit Natureの基底状態計算インターフェースについて説明します。 目的は分子ハミルトニアンの基底状態を計算することです。 このハミルトニアンは、例えば電子的あるいは振動的なものである可能性があります。 ハミルトニアンの準備についての詳細は、 `電子構造 <01_electronic_structure.ipynb>`__ と `振動構造のチュートリアル <02_vibrational_structure.ipynb>`__ を参照してください。

source: It should be said, that in the electronic case, we are actually computing purely the **electronic** part. When using the Qiskit Nature stack as presented in this tutorial, the *nuclear repulsion energy* will be added automatically, to obtain the **total** ground state energy.
ja: 電子的なケースでは、実際には純粋に**電子的**な部分を計算している、と言うべきでしょう。このチュートリアルで紹介するQiskit Natureスタックを使用する場合、**核反発エネルギー*が自動的に追加され、**トータル** の基底状態エネルギーが得られます。

source: The first step is to define the molecular system. In the following we ask for the electronic part of a hydrogen molecule.
bn_bn: প্রথম ধাপ হল আণবিক সিস্টেমকে সংজ্ঞায়িত করা। নিচে আমরা হাইড্রোজেন অণুর বৈদ্যুতিক অংশটি পেতে চাই।
es_un: El primer paso es definir el sistema molecular. A continuación, pedimos la parte electrónica de una molécula de hidrógeno.
ja: まず分子系の定義から始めます。以下では、水素分子の電子部分を求めています。
ko_kr: 첫 번째 단계는 분자 시스템을 정의하는 것이다. 다음에서 수소 분자의 전자 부분을 설정한다.

source: We will also be sticking to the Jordan-Wigner mapping. To learn more about the various mappers available in Qiskit Nature, check out the `Qubit Mappers tutorial <06_qubit_mappers.ipynb>`__.
ja: また、Jordan-Wignerマッピングを使う予定です。Qiskit Natureで利用できる様々なマッパーについてもっと知りたい方は、`量子ビット空間への変換 <06_qubit_mappers.ipynb>`__ をチェックしてください。

source: The Solver
bn_bn: সমাধানকারী (The Solver)
es_un: El Solucionador
ja: ソルバー
ko_kr: 솔버 (Solver)

source: After these steps, we need to define a solver. The solver is the algorithm through which the ground state is computed.
ja: 次に、ソルバーを定義する必要があります。ソルバーとは、基底状態を求めるアルゴリズムのことです。

source: Let’s first start with a purely classical example: the ``NumPyMinimumEigensolver``. This algorithm exactly diagonalizes the Hamiltonian. Although it scales badly, it can be used on small systems to check the results of the quantum algorithms.
ja: まず、純粋に古典的な ``NumPyMinimumEigensolver`` の例から始めましょう。このアルゴリズムは、ハミルトニアンを正確に対角化します。これは規模の大きな問題には適用できませんが、小さな系で量子アルゴリズムの結果を確認するために用いることができます。

source: To find the ground state we could also use the Variational Quantum Eigensolver (VQE) algorithm. The VQE algorithm works by exchanging information between a classical and a quantum computer as depicted in the following figure.
ja: 基底状態を見つけるために、変分量子固有ソルバー (VQE) アルゴリズムを用いることもできます。 VQE アルゴリズムは次の図に示すように、古典コンピューターと量子コンピューターの間で情報を交換することによって動作します。

source: Let’s initialize a VQE solver.
bn_bn: VQE সমাধানকারীকে ইনিশিয়ালাইজ করা যাক।
es_un: Inicialicemos un solucionador de VQE.
id_id: Mari kita menginisialisasi pemecah VQE.
ja: VQE ソルバーを初期化しましょう。
ko_kr: VQE Solver를 초기화하자.
ta_in: VQE தீர்வி ஒன்றைத் துவக்குவோம்.

source: To define the VQE solver one needs three essential elements:
ja: VQE ソルバーを定義するには、3つの重要な要素が必要です。

source: An Estimator primitive: these were released as part of Qiskit Terra 0.22. To learn more about primitives, check out `this resource <https://qiskit.org/documentation/apidoc/primitives.html>`__.
ja: Estimator primitive: これらはQiskit Terra 0.22の一部としてリリースされました。Primitiveについてもっと知りたい方は、`このリソース <https://qiskit.org/documentation/apidoc/primitives.html>`__ をチェックしてください。

source: A variational form: here we use the Unitary Coupled Cluster (UCC) ansatz (see for instance [Physical Review A 98.2 (2018): 022322]). Since it is a chemistry standard, a factory is already available allowing a fast initialization of a VQE with UCC. The default is to use all single and double excitations. However, the excitation type (S, D, SD) as well as other parameters can be selected. Since we are using the ``VQEUCCFactory``, this will also prepend the ``UCCSD`` variational form with a ``HartreeFock`` initial state, which initializes the occupation of our qubits according to the problem which we are trying solve.
ja: 変分形式：ここでは、Unitary Coupled Cluster (UCC) ansatzを使用します (例えば、[Physical Review A 98.2 (2018): 022322] を参照してください)。化学の標準であるため、UCCを用いたVQEの高速な初期化を可能にするファクトリーが既に利用可能です。デフォルトでは、すべての単励起と二重励起を使用します。ただし、励起タイプ (S, D, SD) や他のパラメーターを選択することができます。 ``VQEUCCFactory`` を使用しているので、 ``UCCSD`` 変分形式と ``HartreeFock`` 初期状態が付加され、解決しようとする問題に応じて量子ビットの占有率が初期化されます。

source: An optimizer: this is the classical piece of code in charge of optimizing the parameters in our variational form. See `the corresponding documentation of Qiskit Terra <https://qiskit.org/documentation/stubs/qiskit.algorithms.optimizers.html>`__ for more information.
ja: オプティマイザー: これは変分形式のパラメーターを最適化する古典的なコードです。詳細は `Qiskit Terraの関連ドキュメント <https://qiskit.org/documentation/stubs/qiskit.algorithms.optimizers.html>`__ を参照してください。

source: One could also use any available ansatz / initial state or even define one’s own. For instance,
bn_bn: কেউ উপলব্ধ আনস্যাটজ / প্রাথমিক অবস্থা ব্যবহার করতে পারে বা এমনকি নিজের সংজ্ঞা দিতে পারে। উদাহরণস্বরূপ,
es_un: Uno podría usar cualquier ansatz / estado inicial disponible, o incluso definir uno propio. Por ejemplo,
id_id: Dapat pula digunakan ansatz apa saja yang tersedia/keadaan awal atau bahkan mendefinisikannya sendiri. Sebagai contoh,
ja: また、任意の利用可能なansatz / 初期状態を使用することもできますし、独自に定義することも可能です。以下にその例を示します。
ko_kr: 또한 사용 가능한 ansatz / 초기 상태를 사용하거나 직접 정의할 수도 있다. 예를 들어,
ta_in: ஒருவர் கிடைக்கக்கூடிய எந்த அன்சாட்ஸ் / ஆரம்ப நிலையையும் பயன்படுத்தலாம் அல்லது ஒருவரின் சொந்தத்தை வரையறுக்கலாம். உதாரணமாக,

source: The calculation and results
bn_bn: গননা এবং ফলাফল।
es_un: El cálculo y los resultados
ja: 計算と結果
ko_kr: 계산과 결과

source: We are now ready to put everything together to compute the ground-state of our problem. Doing so requires us to wrap our ``QubitConverter`` and quantum algorithm into a single ``GroundStateEigensolver`` like so:
ja: これで、問題の基底状態を計算するために、すべてをまとめる準備ができました。 ``QubitConverter`` と量子アルゴリズムを一つの ``GroundStateEigensolver`` にラップする必要があります。

source: This will now take of the entire workflow: 1. generating the second-quantized operators stored in our ``problem`` 2. mapping (and potentially reducing) the operators in the qubit space 3. if we provided a quantum algorithm factory (e.g. ``VQEUCCFactory``): finalizing its setup based on the ``problem`` 4. running the quantum algorithm on the Hamiltonian qubit operator 5. once converged, evaluating the additional observables at the determined ground state
ja: これで、ワークフロー全体を見ることができます。1. ``problem`` に格納されている第二量子化された演算子を生成します。 2. 演算子を量子ビット空間にマッピング (縮小の可能性もある) します。 3. 量子アルゴリズムファクトリー (例： ``VQEUCCFactory``) を提供した場合、 ``problem`` に基づいてその設定を確定します。 4. ハミルトニアン量子ビット演算子で量子アルゴリズムを実行します。5. 収束したら、決定した基底状態での追加の観測量を評価します。

source: We can compare the VQE results to the NumPy exact solver and see that they match.
bn_bn: আমরা ভি কিউ ই ফলাফল এর সাথে নামপাই এক্সাক্ট সমাধানকারীর (সলভার) তুলনা করতে পারি এবং দেখতে পারি তারা পরস্পর সমান কিনা।
es_un: Podemos comparar los resultados de VQE con el solucionador exacto de NumPy y ver que sí coinciden.
id_id: Kita dapat membandingkan hasil VQE dengan pemecah eksak NumPy dan melihat bahwa hasilnya cocok.
ja: NumPy の正確なソルバーと比較して、VQE の結果が一致していることを確認できます。
ko_kr: VQE 결과가 NumPy의 정확한 solver의 계산값과 같은지 비교해보자.
ta_in: நாம் VQE முடிவுகளை NumPy துல்லியமான தீர்வோடு ஒப்பிட்டு அவை பொருந்துவதைக் காணலாம்.

source: Using a filter function
bn_bn: একটি ফিল্টার ফাংশনের ব্যবহার
es_un: Usar una función de filtro
id_id: Menggunakan fungsi filter
ja: フィルター関数の使用
ko_kr: 필터 함수 사용
ta_in: வடிகட்டி செயல்பாட்டைப் பயன்படுத்துதல்

source: Sometimes the true ground state of the Hamiltonian is not of interest because it lies in a different symmetry sector of the Hilbert space. In this case the ``NumPyEigensolver`` can take a filter function to return only the eigenstates with for example the correct number of particles. This is of particular importance in the case of vibrational structure calculations where the true ground state of the Hamiltonian is the vacuum state. A default filter function to check the number of particles is implemented in the different problems and can be used as follows:
ja: ハミルトニアンの真の基底状態がヒルベルト空間の異なる対称性領域にあるため、そうした解に興味がないという場合もあります。こうした場合に ``NumPyEigensolver`` は、フィルター関数を取って、正しい粒子数をもつ固有状態だけを返すようにすることが可能です。これは特に、ハミルトニアンの真の基底状態が真空状態となる、振動構造計算の場合に重要です。粒子数をチェックするためのデフォルトのフィルター関数は、様々な問題に実装されており、以下のように用いることができます。

source: In this tutorial we are going to discuss the ground state calculation interface of Qiskit Nature. The goal is to compute the ground state of a molecular Hamiltonian. This Hamiltonian can be electronic or vibrational. To know more about the preparation of the Hamiltonian, check out the Electronic structure and Vibrational structure tutorials.
bn_bn: এই টিউটোরিয়ালে আমরা Qiskit Nature গ্রাউন্ড স্টেট ক্যালকুলেশন ইন্টারফেস নিয়ে আলোচনা করতে যাচ্ছি। লক্ষ্য হল একটি আণবিক হ্যামিল্টোনিয়ানের গ্রাউন্ড স্টেট গণনা করা। এই হ্যামিল্টোনিয়ান ইলেকট্রনিক বা কম্পন হতে পারে। হ্যামিল্টোনিয়ান প্রস্তুতি সম্পর্কে আরও জানতে, ইলেকট্রনিক কাঠামো এবং কম্পন কাঠামোর টিউটোরিয়ালগুলি দেখুন।
es_un: En este tutorial vamos a discutir la interfaz de cálculo del estado fundamental de Qiskit Nature. El objetivo es calcular el estado fundamental de un Hamiltoniano molecular. Este Hamiltoniano puede ser electrónico o vibracional. Para saber más sobre la preparación del Hamiltoniano, consulta los tutoriales de estructura Electrónica y estructura Vibracional.
ko_kr: 본 사용 지침서는 Qiskit Nature의 바닥 상태 계산 인터페이스에 대해 설명한다. 이의 목표는 전자적, 혹은 진동적 분자 해밀턴의 바닥 상태를 계산하는 것이다. 해밀턴의 준비에 대하여 더 알고 싶은 경우에는, 전자 구조와 진동 구조에 대한 지침서를 확인하라.

source: Then we need to define a solver. The solver is the algorithm through which the ground state is computed.
bn_bn: তারপর আমাদের একটি সমাধানকারীকে (সলভার) সংজ্ঞায়িত করার প্রয়োজন। সমাধানকারী (সলভার) হলো একটি অ্যালগরিদম / ধারাক্রম যার দ্বারা ভূমিস্তর(ground state) গণনা করা হয়।
es_un: Después necesitamos definir un solucionador. El solucionador es el algoritmo mediante el cual el estado fundamental es calculado.
ko_kr: 그런 다음 우리는 솔버를 정의해야 한다. 이 솔버는 기저 상태가 계산되는 알고리즘이다.

source: Let’s first start with a purely classical example: the NumPy minimum eigensolver. This algorithm exactly diagonalizes the Hamiltonian. Although it scales badly, it can be used on small systems to check the results of the quantum algorithms.
bn_bn: শুরু করা যাক একটি বিশুদ্ধ ক্লাসিক্যাল উদাহরণ দ্বারা। যেমন: নামপাই এর ন্যুনতম আইগেনসলভার। এই অ্যালগরিদম প্রকৃতপক্ষে হ্যামিল্টোনিয়ানকে ডায়াগোনালাইজ করে। যদিও এটি সামান্য ত্রুটিপূর্ণ, তবু এটি ছোট সিস্টেমে কোয়ান্টাম অ্যালগরিদম এর ফল পরীক্ষা করার জন্য ব্যবহার করা যায়।
es_un: Comencemos primero con un ejemplo puramente clásico: el solucionador propio mínimo de NumPy. Este algoritmo diagonaliza exactamente al Hamiltoniano. Aunque escala mal, se puede usar en sistemas pequeños para verificar los resultados de los algoritmos cuánticos.
id_id: Mari kita mulai dengan contoh yang murni klasik: pemecah eigen minimum NumPy. Algoritme ini mendiagonalisasi Hamiltonian secara eksak. Meskipun penskalaannya buruk, algoritme ini dapat digunakan untuk sistem kecil untuk mengecek hasil dari algoritme kuantum.
ko_kr: 먼저 순수하게 고전적인 예제인 NumPy 최소 eigensolver로 시작하자. 이 알고리즘은 해밀턴을 정확하게 대각화한다. 비록 규모를 정확하게 계산하지는 못하지만, 양자 알고리즘의 결과를 확인하기 위해 작은 시스템에 사용될 수 있다.
ta_in: முதலில் முற்றிலும் கிளாசிக்கல் எடுத்துக்காட்டுடன் ஆரம்பிக்கலாம்: NumPy குறைந்தபட்ச ஈஜென்சால்வர். இந்த வழிமுறை சரியாக ஹாமில்டோனியனை குறுக்காகக் கொண்டுள்ளது. இது மோசமாக அளவிடப்பட்டாலும், குவாண்டம் வழிமுறைகளின் முடிவுகளை சரிபார்க்க சிறிய கணினிகளில் இதைப் பயன்படுத்தலாம்.

source: To find the ground state we coul also use the Variational Quantum Eigensolver (VQE) algorithm. The VQE algorithms works by exchanging information between a classical and a quantum computer as depicted in the following figure.
bn_bn: ভুমিস্তর(ground state) পেতে আমরা ভেরিয়েশনাল কোয়ান্টাম আইগেনসলভার (ভিকিউই) ব্যাবহার করতে পারি। ভি কিউ ই অ্যালগরিদম একটি ক্লাসিক্যাল ও একটি কোয়ান্টাম কম্পিউটার এর মধ্যে তথ্য বিনিময়ের মাধ্যমে কাজ করে, যা নিচের চিত্রে দেখানো হয়েছে।
es_un: Para encontrar el estado fundamental también podríamos usar el algoritmo de Solucionador Propio Cuántico Variacional (Variational Quantum Eigensolver, VQE). El algoritmo VQE funciona intercambiando información entre una computadora clásica y una computadora cuántica, cómo se muestra en la siguiente figura.
id_id: Untuk menemukan keadaan dasar kita dapat menggunakan algoritme Pemecah Eigen Kuantum Variasional (Variational Quantum Eigensolver, VQE). Algoritme VQE bekerja dengan menukar informasi antara komputer klasik dan kuantum seperti digambarkan dalam gambar berikut.
ko_kr: 원하는 기저 상태를 찾기 위해서도 변분화된 양자 아이젠솔버 (Variational Quantum Eigensolver, VQE) 알고리즘을 사용한다. VQE 알고리즘들은 다음의 도면에 묘사된 바와 같이 고전 컴퓨터와 양자 컴퓨터 사이의 정보를 교환함으로써 작동한다.
ta_in: தரை நிலையைக் கண்டுபிடிக்க நாம் மாறுபட்ட குவாண்டம் ஐஜென்சால்வர் (VQE) வழிமுறையையும் பயன்படுத்துகிறோம். பின்வரும் படத்தில் சித்தரிக்கப்பட்டுள்ளபடி கிளாசிக்கல் மற்றும் குவாண்டம் கணினிக்கு இடையில் தகவல்களை பரிமாறிக்கொள்வதன் மூலம் VQE வழிமுறைகள் செயல்படுகின்றன.

source: To define the VQE solver one needs two essential elements:
bn_bn: VQE সমাধানকারী (সলভার) টিকে সংজ্ঞায়িত করতে প্রয়োজন দুটি অত্যাবশ্যক উপাদান:
es_un: Para definir el solucionador de VQE necesitamos dos elementos esenciales:
id_id: Untuk mendefinisikan pemecah VQE, diperlukan dua elemen esensial:
ko_kr: VQE Solver를 정의하려면 다음의 두 가지 요소가 필수적이다.
ta_in: VQE தீர்வி வரையறுக்க ஒருவருக்கு இரண்டு அத்தியாவசிய கூறுகள் தேவை:

source: A variational form: here we use the Unitary Coupled Cluster (UCC) ansatz (see for instance [Physical Review A 98.2 (2018): 022322]). Since it is a chemistry standard, a factory is already available allowing a fast initialization of a VQE with UCC. The default is to use all single and double excitations. However, the excitation type (S, D, SD) as well as other parameters can be selected.
bn_bn: একটি পরিবর্তনশীল (ভ্যারিয়েশনাল) রূপ: এখানে আমরা ব্যবহার করি ঐকিক (ইউনিটারি) দ্বৈত ক্লাস্টার (ইউ সি সি) অন্সাৎজ(উদাহরণ স্বরূপ: Physical Review A 98.2 (2018): 022322])। যেহেতু,এটি একটি রসায়ন মানের, ভি কিউ ই কে ইউসিসির সাথে দ্রুত শুরু করার জন্য একটি যন্ত্র অবশ্যই সহজলভ্য। সমস্ত একক এবং দ্বিগুণ উত্তেজন বা উদ্দীপন হলো স্বাভাবিক। যদিও, উদ্দীপন প্রক্রিয়া(এস, ডি, এসডি) এবং অপরাপর প্যারামিটারগুলিও নির্বাচন করা যেতে পারে।
es_un: Una forma variacional: aquí utilizamos el ansatz del Clúster Acoplado Unitario (Unitary Coupled Cluster, UCC) (ver por ejemplo [Physical Review A 98.2 (2018): 022322]). Ya que es un estándar en la química, una fábrica que permite una rápida inicialización de un VQE con UCC ya está disponible. Por defecto se usan todas las excitaciones simples y dobles. Sin embargo, se pueden seleccionar las excitaciones de tipo (S, D, SD) así como otros parámetros.
id_id: Bentuk variasional: di sini kita menggunakan ansatz Unitary Coupled Cluster (UCC) (lihat pada misalnya [Physical Review A 98.2 (2018): 022322]). Karena ini adalah standar kimia, sebuah factory sudah tersedia yang memungkinkan inisialisasi cepat dari VQE dengan UCC. Default-nya adalah menggunakan semua eksitasi tunggal dan ganda. Namun, jenis eksitasi (S, D, SD) serta parameter lainnya dapat dipilih.
ko_kr: 변분 형태: 여기서 우리는 Unitary Coupled Cluster (UCC) 가설을 사용한다 ([Physical Review A 98.2 (2018): 022322] 등 참조). 이는 화학 표준이므로, UCC 가설을 사용하여 VQE의 빠른 초기화가 가능한 패키지들이 이미 존재한다. 기본값은 모든 단일 및 이중 여기(Excitation) 들을 사용하는 것이다. 하지만, 여기(Excitation) 유형 (S, D, SD) 를 포함하여 다른 변수들도 직접 선택할 수 있다.
ta_in: ஒரு மாறுபட்ட வடிவம்: இங்கே நாம் யூனிட்டரி கப்பிள்ட் கிளஸ்டர் (யு. சி. சி) அன்சாட்ஸைப் பயன்படுத்துகிறோம் (உதாரணமாக பார்க்கவும் [இயற்பியல் விமர்சனம் A 98.2 (2018): 022322]). இது ஒரு வேதியியல் தரநிலை என்பதால், ஒரு தொழிற்சாலை ஏற்கனவே கிடைக்கிறது, இது UCC உடன் VQE ஐ விரைவாக தொடங்க அனுமதிக்கிறது. இயல்புநிலை அனைத்து ஒற்றை மற்றும் இரட்டை உற்சாகங்களைப் பயன்படுத்துவதாகும். இருப்பினும், உற்சாக வகை (எஸ், டி, எஸ்டி) மற்றும் பிற அளவுருக்களையும் தேர்ந்தெடுக்கலாம்.

source: An initial state: the initial state of the qubits. In the factory used above, the qubits are initialized in the Hartree-Fock (see the electronic structure tutorial) initial state (the qubits corresponding to occupied MOs are :math:`|1\rangle` and those corresponding to virtual MOs are :math:`|0\rangle`.
bn_bn: একটি প্রারম্ভিক মান বা অবস্থা: কিউবিটগুলির প্রারম্ভিক মান বা অবস্থা। ওপরে ব্যবহৃত প্রক্রিয়াতে, কিউবিটগুলি প্রাথমিকভাবে হার্ট্রি-ফক (বৈদ্যুতিন গঠন টিউটোরিয়ালসমূহ দ্রষ্টব্য) প্রারম্ভিক মান বা অবস্থায় থাকে( অধিকৃত আণবিক কক্ষপথের সাথে সংশ্লিষ্ট কিউবিটগুলি হল math:`|1\rangle` এবং ভার্চুয়্যাল আণবিক কক্ষপথের সাথে সংশ্লিষ্ট কিউবিটগুলি হল math:`|0\rangle` )।
es_un: Un estado inicial: el estado inicial de los qubits. En la fabrica usada anteriormente, los qubits son inicializados al estado inicial de Hartree-Fock (ver el tutorial de estructura electrónica), (los qubits que corresponden a orbitales moleculares ocupados son :math:`|1\rangle` y los que corresponden a orbitales moleculares virtuales son :math:`|0\rangle`.
id_id: Keadaan awal: keadaan awal dari qubit. Pada factory yang digunakan di atas, qubit diinisialisasi dalam keadaan awal (qubits yang sesuai dengan MOs yang diduduki adalah :math:` | 1\rangle ` dan yang sesuai dengan MOs virtual adalah :math:` | 0\rangle `) Hartree-Fock (lihat tutorial struktur elektronik).
ko_kr: 초기 상태: 큐비트들의 초기 상태. 위에 사용된 공장에서, 큐비트들은 Hartree-Fock 에서 초기화된다 (전자 구조 튜토리얼 참조) 초기 상태 (점유된 MOs에 대응하는 큐비트들은 :math:`|1\rangle` 이고, 가상 MOs에 상응하는 것들은 :math:`|0\rangle`) 이다.
ta_in: ஒரு ஆரம்ப நிலை: குவிட்களின் ஆரம்ப நிலை. மேலே பயன்படுத்தப்படும் தொழிற்சாலையில், ஹார்ட்ரீ-ஃபாக் (மின்னணு கட்டமைப்பு டுடோரியலைப் பார்க்கவும்) ஆரம்ப நிலையில் (ஆக்கிரமிக்கப்பட்ட MO களுடன் தொடர்புடைய வினாக்கள் :math:`|1\rangle` ரேங்கிள்` மற்றும் மெய்நிகர் MO களுடன் தொடர்புடையவை :math:`|0\rangle`.

source: The backend: this is the quantum machine on which the right part of the figure above will be performed. Here we ask for the perfect quantum emulator (``aer_simulator_statevector``).
bn_bn: ব্যাকএন্ড: এটি কোয়ান্টাম মেশিন যার উপর উপরের চিত্রের ডান অংশ সঞ্চালিত হবে। এখানে আমরা নিখুঁত কোয়ান্টাম ইমুলেটর (``aer_simulator_statevector``) চাই।
es_un: El backend: esta es la máquina cuántica en la que se realizará la parte derecha de la figura anterior. Aquí pedimos por el emulador cuántico perfecto (``aer_simulator_statevector``).
ko_kr: 백엔드: 위 그림의 오른쪽 부분을 실행하는 양자 기계이다. 이번 경우에는 이상적인 양자 시뮬레이터 (``aer_simulator_statevector``) 를 사용하기를 바란다.

source: We are now ready to run the calculation.
bn_bn: আমরা এখন গণনা চালু করার জন্য প্রস্তুত।
es_un: Ahora estamos listos para ejecutar el cálculo.
id_id: Kita sekarang siap untuk menjalankan kalkulasi.
ko_kr: 이제 계산을 실행할 준비가 되었다.
ta_in: நாங்கள் இப்போது கணக்கீட்டை இயக்க தயாராக உள்ளோம்.

source: Sometimes the true ground state of the Hamiltonian is not of interest because it lies in a different symmetry sector of the Hilbert space. In this case the NumPy eigensolver can take a filter function to return only the eigenstates with for example the correct number of particles. This is of particular importance in the case of vibrational structure calculations where the true ground state of the Hamiltonian is the vacuum state. A default filter function to check the number of particles is implemented in the different transformations and can be used as
bn_bn: কখনও কখনও হ্যামিল্টোনিয়ানের প্রকৃত স্থল অবস্থা আগ্রহী হয় না কারণ এটি হিলবার্ট মহাকাশের একটি ভিন্ন প্রতিসাম্য খাতে অবস্থিত। এই ক্ষেত্রে NumPy eigensolver একটি ফিল্টার ফাংশন নিতে পারে শুধুমাত্র eigenstates ফেরত দিতে উদাহরণস্বরূপ কণার সঠিক সংখ্যা। কম্পন কাঠামোর গণনার ক্ষেত্রে এটি বিশেষ গুরুত্ব বহন করে যেখানে হ্যামিল্টোনিয়ানের প্রকৃত স্থল অবস্থা হল ভ্যাকুয়াম অবস্থা। কণার সংখ্যা পরীক্ষা করার জন্য একটি ডিফল্ট ফিল্টার ফাংশন বিভিন্ন রূপান্তরে প্রয়োগ করা হয় এবং এটি হিসাবে ব্যবহার করা যেতে পারে
id_id: Terkadang keadaan dasar sebenarnya dari Hamiltonian tidak menarik karena terletak pada sektor simetri yang berbeda dari ruang Hilbert. Dalam hal ini NumPy eigensolver dapat mengambil fungsi filter untuk mengembalikan hanya keadaan eigen-nya saja, misalnya jumlah partikel yang tepat. Hal ini sangat penting dalam kasus perhitungan struktur vibrasoinal di mana keadaan dasar sesungguhnya dari Hamiltonian adalah keadaan vakum. Fungsi filter bawaan untuk memeriksa jumlah partikel diimplementasikan dalam transformasi yang berbeda dan dapat digunakan sebagai
ko_kr: 때때로 Hamiltonian의 진정한 기저 상태는 Hilbert 공간의 다른 대칭성 부분에 있기 때문에 관심 대상이 아니다. 이 경우에 NumPy eigensolver 는 예를 들어 정확한 수의 입자를 갖는 고유상태만을 반환시키기 위해 필터 함수를 취할 수 있다. 이것은 해밀턴의 진정한 기저 상태가 진공 상태인 진동 구조 계산의 경우에 특히 중요하다. 입자 수를 확인하는 기본 필터 함수는 다른 변환에서 구현되며 다음과 같이 사용할 수 있다.
ta_in: சில நேரங்களில் ஹாமில்டோனியனின் உண்மையான நில நிலை ஆர்வமாக இல்லை, ஏனெனில் இது ஹில்பர்ட் இடத்தின் வேறுபட்ட சமச்சீர் துறையில் உள்ளது. இந்த வழக்கில் NumPy eigensolver ஒரு வடிகட்டி செயல்பாட்டை ஐஜென்ஸ்டேட்களை மட்டுமே திருப்பி எடுக்க முடியும், எடுத்துக்காட்டாக சரியான துகள்களின் எண்ணிக்கை. அதிர்வு கட்டமைப்பு கணக்கீடுகளின் விஷயத்தில் இது முக்கியத்துவம் வாய்ந்தது, அங்கு ஹாமில்டோனியனின் உண்மையான நில நிலை வெற்றிட நிலை. துகள்களின் எண்ணிக்கையை சரிபார்க்க இயல்புநிலை வடிகட்டி செயல்பாடு வெவ்வேறு மாற்றங்களில் செயல்படுத்தப்படுகிறது, மேலும் இதைப் பயன்படுத்தலாம்

source: Sometimes the true ground state of the Hamiltonian is not of interest because it lies in a different symmetry sector of the Hilbert space. In this case the NumPy eigensolver can take a filter function to return only the eigenstates with for example the correct number of particles. This is of particular importance in the case of vibrational structure calculations where the true ground state of the Hamiltonian is the vacuum state. A default filter function to check the number of particles is implemented in the different transformations and can be used as follows:
es_un: A veces el verdadero estado fundamental del Hamiltoniano no es de interés, ya que yace en un sector de simetría distinto del espacio de Hilbert. En este caso, el solucionador propio de NumPy puede tomar una función filtro para devolver solo los estados propios con, por ejemplo, el número correcto de partículas. Esto es de particular importancia en el caso de los cálculos de estructuras vibracionales donde el verdadero estado fundamental del Hamiltoniano es el estado de vacío cuántico. Una función filtro predeterminada para revisar el número de partículas es implementada en las diferentes transformaciones y puede ser usada como sigue:
