Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/03_ground_state_solvers.po
Languages: bn_bn, es_un, id_id, ja, ko_kr, ta_in

source: In this tutorial we are going to discuss the ground state calculation interface of Qiskit Chemistry. The goal is to compute the ground state of a molecular Hamiltonian. This Hamiltonian can be electronic or vibrational. To know more about the preparation of the Hamiltonian, check out the Electronic structure and Vibrational structure tutorials.
id_id: Dalam tutorial ini kita akan membahas tentang antarmuka kalkulasi keadaan dasar Qiskit Chemistry. Tujuannya adalah untuk menghitung keadaan dasar dari Hamiltonian molekul. Hamiltonian ini dapat berupa elektronik atau vibrasional. Untuk mengetahui lebih lanjut tentang persiapan Hamiltonian-nya, cek tutorial Struktur Elektronik dan Vibrasional.
ta_in: இந்த டுடோரியலில் qiskit வேதியியலின் நில நிலை கணக்கீட்டு இடைமுகத்தைப் பற்றி விவாதிக்க உள்ளோம். ஒரு மூலக்கூறு ஹாமில்டோனியனின் நில நிலையை கணக்கிடுவதே குறிக்கோள். இந்த ஹாமில்டோனியன் மின்னணு அல்லது அதிர்வுறும். ஹாமில்டோனியனைத் தயாரிப்பது பற்றி மேலும் அறிய, மின்னணு அமைப்பு மற்றும் அதிர்வு கட்டமைப்பு பயிற்சிகளைப் பாருங்கள்.

source: The backend: this is the quantum machine on which the right part of the figure above will be performed. Here we ask for the perfect quantum emulator (``statevector_simulator``).
id_id: Backend: ini adalah mesin kuantum yang akan dioperasikan pada bagian kanan dari gambar di atas. Di sini kita meminta emulator kuantum sempurna (``statevector_simulator``).
ta_in: பின்தளத்தில்: இது குவாண்டம் இயந்திரமாகும், அதில் மேலே உள்ள உருவத்தின் வலது பகுதி செய்யப்படும். இங்கே நாம் சரியான குவாண்டம் முன்மாதிரியைக் கேட்கிறோம் (``statevector_simulator``).
