Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/04_excited_states_solvers.po
Languages: bn_bn, es_un, ja, ko_kr

source: This page was generated from `docs/tutorials/04_excited_states_solvers.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/04_excited_states_solvers.ipynb`__ থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `docs/tutorials/04_excited_states_solvers.ipynb`__.
ja: このページは `docs/tutorials/04_excited_states_solvers.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/04_excited_states_solvers.ipynb`__ 에서 생성되었다.

source: Excited states solvers
bn_bn: উত্তেজিত স্তর বা অবস্থা সমাধানকারী (সলভার)
es_un: Solucionadores de estados excitados
ja: 励起状態ソルバー
ko_kr: 여기 상태 솔버

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
ja: はじめに
ko_kr: 소개

source: In this tutorial we are going to discuss the excited states calculation interface of Qiskit Nature. The goal is to compute the excited states of a molecular Hamiltonian. This Hamiltonian can be electronic or vibrational. To know more about the preparation of the Hamiltonian, check out the `Electronic structure <01_electronic_structure.ipynb>`__ and `Vibrational structure tutorials <02_vibrational_structure.ipynb>`__.
es_un: En este tutorial vamos a discutir la interfaz de cálculo de estados excitados de Qiskit Nature. El objetivo es calcular los estados excitados de un Hamiltoniano molecular. Este Hamiltoniano puede ser electrónico o vibracional. Para saber más sobre la preparación del Hamiltoniano, consulta los tutoriales de `Estructura electrónica <01_electronic_structure.ipynb>`__ y `Estructura vibracional <02_vibrational_structure.ipynb>`__.
ja: このチュートリアルでは、Qiskit Natureの励起状態計算インターフェースについて説明します。 目的は分子ハミルトニアンの励起状態を計算することです。 このハミルトニアンは、電子的あるいは振動的なものである可能性があります。 ハミルトニアンの準備についての詳細は、 `電子構造 <01_electronic_structure.ipynb>`__ と `振動構造のチュートリアル <02_vibrational_structure.ipynb>`__ を参照してください。

source: The first step is to define the molecular system. In the following we ask for the electronic part of a hydrogen molecule.
bn_bn: প্রথম ধাপ হল আণবিক সিস্টেমকে সংজ্ঞায়িত করা। এরপর আমরা হাইড্রোজেন অণুর বৈদ্যুতিন অংশটি পেতে চাই।
es_un: El primer paso es definir el sistema molecular. A continuación, pedimos la parte electrónica de una molécula de hidrógeno.
ja: まず分子系の定義から始めます。以下では、水素分子の電子部分を求めています。
ko_kr: 첫 번째 단계는 분자 시스템을 정의하는 것이다. 본 튜토리얼에서, 우리는 수소 분자 해밀토니안의 전자적 부분에 대해서만 계산한다.

source: We will also be sticking to the Jordan-Wigner mapping. To learn more about the various mappers available in Qiskit Nature, check out the `Qubit Mappers tutorial <06_qubit_mappers.ipynb>`__.
es_un: También nos apegaremos al mapeo de Jordan-Wigner. Para obtener más información sobre los diversos mapeadores disponibles en Qiskit Nature, consulta el `Tutorial de Mapeadores de Qubit <06_qubit_mappers.ipynb>`__.
ja: また、Jordan-Wignerマッピングを使う予定です。Qiskit Natureで利用できる様々なマッパーについてもっと知りたい方は、`量子ビット空間への変換 <06_qubit_mappers.ipynb>`__ をチェックしてください。

source: The Solver
bn_bn: সমাধানকারী (সলভার)
es_un: El Solucionador
ja: ソルバー
ko_kr: 솔버 (Solver)

source: After these steps we need to define a solver. The solver is the algorithm through which the excited states are computed.
es_un: Después de estos pasos necesitamos definir un solucionador. El solucionador es el algoritmo a través del cual se calculan los estados excitados.
ja: 次に、ソルバーを定義する必要があります。ソルバーとは、励起状態を求めるアルゴリズムのことです。

source: Let's first start with a purely classical example: the ``NumPyEigensolver``. This algorithm exactly diagonalizes the Hamiltonian. Although it scales badly, it can be used on small systems to check the results of the quantum algorithms. Here, we are only interested to look at eigenstates with a given number of particles. To compute only those states a filter function can be passed to the ``NumPyEigensolver``. A default filter function is already implemented in Qiskit Nature which you can use for this purpose.
es_un: Comencemos primero con un ejemplo puramente clásico: el ``NumPyEigensolver``. Este algoritmo diagonaliza exactamente al Hamiltoniano. Aunque escala mal, se puede usar en sistemas pequeños para verificar los resultados de los algoritmos cuánticos. Aquí, solo estamos interesados en mirar estados propios con un número dado de partículas. Para calcular únicamente esos estados, se puede pasar una función de filtro al ``NumPyEigensolver``. Está implementada una función de filtro predeterminada en Qiskit Nature que puedes usar para este propósito.

source: We also need to specify the number of eigenvalues to be computed by the ``NumPyEigensolver``. For this particular system, we are interested in the ground and first three excited states, so we will set ``k=4`` (which defaults to 1 so be sure to set this, otherwise you will only obtain the ground state!).
es_un: También necesitamos especificar el número de valores propios que serán calculados por el ``NumPyEigensolver``. Para este sistema en particular, estamos interesados en el estado fundamental y los primeros tres estados excitados, por lo que estableceremos ``k=4`` (que por defecto es 1, así que asegúrate de configurar esto, de lo contrario, ¡solo obtendrás el estado fundamental!).

source: The excitation energies can also be accessed with the `qEOM algorithm <https://journals.aps.org/prresearch/abstract/10.1103/PhysRevResearch.2.043140>`__. The EOM method finds the excitation energies (differences in energy between the ground state and all :math:`n`\ th excited states) by solving the following pseudo-eigenvalue problem.
es_un: También se puede acceder a las energías de excitación con el `algoritmo qEOM <https://journals.aps.org/prresearch/abstract/10.1103/PhysRevResearch.2.043140>`__. El método EOM encuentra las energías de excitación (diferencias de energía entre el estado fundamental y todos los :math:`n`\ -ésimos estados excitados) resolviendo el siguiente problema de pseudovalores propios.
ja: 励起エネルギーは、 `qEOM アルゴリズム <https://journals.aps.org/prresearch/abstract/10.1103/PhysRevResearch.2.043140>`__によっても求めることができます。 EOM 法は、以下の擬似固有値問題を解くことにより、励起エネルギー (基底状態と全ての第 :math:`n` 励起状態との間のエネルギー差) を求めます。

source: with
bn_bn: সাথে বা সঙ্গে
es_un: con
ja: ただし
ko_kr: 에 대하여

source: Although the previous equation can be solved classically, each matrix element must be measured on the quantum computer with the corresponding ground state. To use the qEOM as a solver in Qiskit, we have to define a ground state calculation first, which will provide the required ground state information to the algorithm. With this the qEOM solver can be initialized like so:
es_un: Aunque la ecuación anterior se puede resolver clásicamente, cada elemento de matriz se debe medir en la computadora cuántica con el estado fundamental correspondiente. Para usar qEOM como un solucionador en Qiskit, primero tenemos que definir un cálculo del estado fundamental, que proporcionará la información de estado fundamental necesaria para el algoritmo. Con esto, el solucionador qEOM se puede inicializar así:
ja: 上の式は古典的に解くことができますが、各行列要素は対応する基底状態を量子コンピュータ上で測定しなければなりません。QiskitでqEOMをソルバーとして使用するには、まず基底状態の計算を定義する必要があり、これにより必要な基底状態の情報をアルゴリズムに提供することができます。これにより、qEOMソルバーは次のように初期化することができます：

source: The calculation and results
bn_bn: হিসাব এবং ফলাফল।
es_un: El cálculo y los resultados
ja: 計算と結果
ko_kr: 계산과 결과들

source: We are now ready to compute the results. Below, we are comparing the results obtained by the exact ``NumPyEigensolver`` with the default filter criterion enabled with the results obtained by the qEOM algorithm.
es_un: Ahora estamos listos para calcular los resultados. A continuación, comparamos los resultados obtenidos por el ``NumPyEigensolver`` exacto con el criterio de filtro predeterminado habilitado con los resultados obtenidos por el algoritmo qEOM.
ja: これで結果を計算する準備ができました。以下では、デフォルトのフィルター基準を有効にして、厳密な ``NumPyEigensolver`` で得られた結果と、qEOMアルゴリズムで得られた結果を比較しています。

source: One can see from these results that one state is missing from the NumPy results. The reason for this is because the spin is also used as a filter and only singlet states are shown. In the following we use a custom filter function to check our results consistently and only filter out states with the incorrect number of particles (in this case the number of particle is 2) as well as the wrong magnetization (which we enforce to be 0).
es_un: Uno puede ver a partir de estos resultados que falta un estado en los resultados de NumPy. La razón de esto es que el espín también se usa como filtro y solo se muestran los estados singletes. A continuación, usamos una función de filtro personalizada para verificar nuestros resultados de manera consistente y solo filtramos los estados con el número incorrecto de partículas (en este caso, el número de partículas es 2) así como la magnetización incorrecta (que forzamos a que sea 0).

source: Let’s first start with a purely classical example: the ``NumPyEigensolver``. This algorithm exactly diagonalizes the Hamiltonian. Although it scales badly, it can be used on small systems to check the results of the quantum algorithms. Here, we are only interested to look at eigenstates with a given number of particle. To compute only those states a filter function can be passed to the ``NumPyEigensolver``. A default filter function is already implemented in Qiskit Nature and will be extracted automatically, if you enable the ``use_default_filter_criterion`` setting like so:
ja: まず、純粋に古典的な例として ``NumPyEigensolver`` から始めましょう。このアルゴリズムはハミルトニアンを正確に対角化します。このアルゴリズムはスケールが大きいですが、量子アルゴリズムの結果を確認するために、小さなシステムで使用することができます。ここでは、与えられた粒子数の固有状態を見ることにのみ興味があります。これらの状態のみを計算するために、フィルター関数を ``NumPyEigensolver`` に渡すことができます。デフォルトのフィルター関数はQiskit Natureに既に実装されており、 ``use_default_filter_criterion`` の設定を有効にすると自動的に抽出されます：

source: One can see from these results that one state is missing from the NumPy results. The reason for this is because the spin is also used as a filter and only singlet states are shown. In the following we use a custom filter function to check our results consistently and only filter out states with the incorrect number of particles (in this case the number of particle is 2).
ja: これらの結果から、NumPyの結果から1つの状態が欠落していることがわかります。これは、スピンがフィルターとしても使用され、一重項状態のみが表示されるためです。以下では、カスタムフィルター関数を使用して、結果を一貫してチェックし、間違った粒子数 (この場合の粒子数は2) の状態のみをフィルタリングします。

source: In this tutorial we are going to discuss the excited states calculation interface of Qiskit Nature. The goal is to compute the excited states of a molecular Hamiltonian. This Hamiltonian can be electronic or vibrational. To know more about the preparation of the Hamiltonian, check out the Electronic structure and Vibrational structure tutorials.
bn_bn: এই টিউটোরিয়ালে আমরা Qiskit Nature উত্তেজিত দশা বা অবস্থা ক্যালকুলেশন ইন্টারফেস নিয়ে আলোচনা করতে যাচ্ছি। লক্ষ্য হল একটি আণবিক হ্যামিল্টোনিয়ানের উত্তেজিত দশা বা অবস্থা হিসাব করা। এই হ্যামিল্টোনিয়ান ইলেকট্রনিক বা কম্পন হতে পারে। হ্যামিল্টোনিয়ান প্রস্তুতি সম্পর্কে আরও জানতে, ইলেকট্রনিক কাঠামো এবং কম্পন কাঠামোর টিউটোরিয়ালগুলি দেখুন।
ko_kr: 본 사용 지침서는 Qiskit Nature의 들뜬 상태 계산 인터페이스에 대해 설명한다. 이의 목표는 전자적, 혹은 진동적 분자 해밀턴의 들뜬 상태를 계산하는 것이다. 해밀턴의 준비에 대하여 더 알고 싶은 경우에는, 전자 구조와 진동 구조에 대한 지침서를 확인하라.

source: Then we need to define a solver. The solver is the algorithm through which the ground state is computed.
bn_bn: তারপর আমাদের একটি সমাধানকারী (সলভার) সংজ্ঞায়িত করার প্রয়োজন। সমাধানকারী (সলভার) হলো একটি অ্যালগরিদম / ধারাক্রম যার দ্বারা গ্রাউন্ড স্টেট হিসাব করা হয়।
ko_kr: 그런 다음 우리는 솔버를 정의해야 한다. 이 솔버는 기저 상태가 계산되는 알고리즘이다.

source: Let’s first start with a purely classical example: the NumPy eigensolver. This algorithm exactly diagonalizes the Hamiltonian. Although it scales badly, it can be used on small systems to check the results of the quantum algorithms. Here, we are only interested to look at eigenstates with a given number of particle. To compute only those states a filter function can be passed to the NumPy eigensolver. A default filter function is already implemented in Qiskit and can be used in this way:
bn_bn: শুরু করা যাক একটি বিশুদ্ধ প্রথাগত (ক্লাসিক্যাল) উদাহরণ দ্বারা। যেমন: NumPy ন্যূনতম eigensolver। এই অ্যালগরিদম প্রকৃতপক্ষে হ্যামিল্টোনিয়ানকে কর্নিকরণ (ডায়াগোনালাইজ) করে। যদিও এটি সামান্য ত্রুটিপূর্ণ, তবু এটি ছোট সিস্টেমে কোয়ান্টাম অ্যালগরিদম এর ফল পরীক্ষা করার জন্য ব্যবহার করা যায়। এখানে, আমরা কেবল একটি নির্দিষ্ট সংখ্যার কণা যুক্ত আইগেনস্টেট গুলির প্রতি মনোযোগী। ওইসব স্তরের মান বা অবস্থা গণনা করতে একটি পরিশ্রুতকারক (ফিল্টার) ফাংশনকে NumPy eigensolver এ পাস করানো যেতে পারে। একটি সাধারন পরিশ্রুতকারক (ফিল্টার) ফাংশন Qiskit এ ইতিমধ্যে সম্পাদন করা হয়েছে এবং নিম্নরূপে ব্যবহার করা যায়:
ko_kr: 먼저, 순수하게 고전적인 예인 NumPy 고윳값 알고리즘으로 시작해보자. 이 알고리즘은 해밀토니안을 정확하게 도식화한다. 비록 확장이 어렵지만, 양자 알고리즘의 결과를 확인하기 위해 작은 시스템에 이 알고리즘을 사용할 수 있다. 여기서, 우리는 단지 주어진 입자수를 가지고 있는 eigenstate들을 보는 것에만 관심이 있다. 이들 상태만을 계산하기 위해, 필터 함수가 NumPy 고윳값 알고리즘에 전달될 수 있다. 기본 필터 기능은 이미 Qiskit에 구현되어 있으며 다음과 같은 방식으로 사용할 수 있다.

source: The excitation energies can also be accessed with the qEOM algorithm [arXiv preprint arXiv:1910.12890 (2019)]. The EOM method finds the excitation energies (differences in energy between the ground state and all :math:`n`\ th excited states) by solving the following pseudo-eigenvalue problem.
bn_bn: উদ্দীপক শক্তি qEOM অ্যালগরিদম / ধরাক্রম এর সাহায্যে পাওয়া যায় [arXiv preprint arXiv:1910.12890 (2019)]। EOM পদ্ধতি নীচের pseudo-eigenvalue সমস্যা সমাধানের মাধ্যমে উদ্দীপক শক্তি (গ্রাউন্ড স্টেট এবং সকল math:`n`\ তম উদ্দীপিত স্তরের মধ্যে শক্তি পার্থক্য) খোঁজে।
ko_kr: 여기 에너지는 또한 qEOM 알고리즘 [arXiv preprint arXiv:1910.12890 (2019)] 을 이용하여 접근될 수 있다. EOM 방법은 pseudo-eigenvalue 문제 해결을 통해 여기 에너지 (기저 상태와 모든 :math:`n`\ 여기 상태의 에너지의 차이) 를 찾아낸다.

source: Although the previous equation can be solved classically, each matrix element must be measured on the quantum computer with the corresponding ground state. To use the qEOM as a solver in Qiskit, we have to define a ground state calculation first, providing to the algorithm information on how to find the ground state. With this the qEOM solver can be initialized:
bn_bn: যদিও পূর্বের সমীকরণটি প্রথাগতভাবে (ক্লাসিক্যালি) সমাধান করা যেত, প্রতিটি ম্যাট্রিক্স উপাদান অবশ্যই সংশ্লিষ্ট ভূমিস্তরের সাথে কোয়ান্টাম কম্পিউটার দ্বারা মাপতে হত। qEOM কে Qiskit এর একটি সমাধানকারী (সলভার) হিসেবে ব্যবহার করতে হলে আমাদের প্রথমে একটি গ্রাউন্ড স্টেট হিসাব সংজ্ঞায়িত করতে হবে, যা গ্রাউন্ড স্টেট পাওয়ার পদ্ধতি আলোচনা করবে। এর সাথে সাথেই qEOM সমাধানকারী (সলভার) শুরু করা যেতে পারে:
ko_kr: 이전의 방정식이 고전적으로 해결될 수 있지만, 각 행렬 요소는 바닥 상태에 대응되는 양자 컴퓨터에서 측정되어야 한다. qEOM을 Qiskit에서 solver로 사용하려면 바닥 상태 계산을 정의하여 바닥 상태를 찾는 방법에 대한 알고리즘 정보를 제공해야 한다. 이를 통해 qEOM solver를 초기화할 수 있다.

source: The results are computed and printed
bn_bn: ফলাফল হিসাব এবং প্রিন্ট করা হয়েছে।
ko_kr: 결과가 계산되고 출력된다.

source: One can see from these results that one state is missing from the NumPy results. The reason for this is because the spin is also used as a filter and only singlet states are shown. In the following we use a custom filter function to check consistently our results and only filter out states with incorrect number of particle (in this case the number of particle is 2).
bn_bn: এই ফলাফল থেকে লক্ষ্য করা যায় যে NumPy ফলাফল থেকে একটি স্তরের মান বা অবস্থা উধাও হয়ে গেছে। এর কারণ হল স্পিন বা ঘূর্ণনও একটি পরিশ্রুতকারক (ফিল্টার) রূপে ব্যবহৃত হয়েছে এবং কেবল সিঙ্গলেট স্তরের মান বা অবস্থাগুলিই দেখানো হচ্ছে। অতঃপর, আমরা আমাদের ফলাফল নিয়মিতভাবে পরীক্ষা করতে এবং ভূল কণা সংখ্যা যুক্ত স্তরগুলিকে ছেঁকে বাদ দিতে একটি বিশেষায়িত (কাস্টম) পরিশ্রুতকারক (ফিল্টার) ফাংশন ব্যাবহার করবো।
ko_kr: 이러한 결과로부터 하나의 상태가 NumPy 결과로부터 누락되었다는 것을 알 수 있다. 그 이유는 스핀이 필터로도 사용되고 단일항 상태만 표시되었기 때문이다. 다음은 사용자 정의 필터 함수를 사용하여 결과를 일정하게 확인하고 올바르지 않은 수의 입자가 있는 상태만 필터링한다 (이 경우 입자의 수는 2임).
