Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/05_problem_transformers.po
Languages: es_un, ja

source: This page was generated from `docs/tutorials/05_problem_transformers.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/05_problem_transformers.ipynb`__.
ja: このページは `docs/tutorials/05_problem_transformers.ipynb`__ から生成されました。

source: Transforming Problems
es_un: Transformación de Problemas
ja: 問題の変換

source: This tutorial explains the various problem transformers available in Qiskit Nature.
es_un: Este tutorial explica los diversos transformadores de problemas disponibles en Qiskit Nature.
ja: Qiskit Natureに用意されている様々な問題変換ツールについて説明します。

source: **Note:** Currently, Qiskit Nature only has transformers which work with electronic structure problems.
es_un: **Nota:** Actualmente, Qiskit Nature solo tiene transformadores que funcionan con problemas de estructura electrónica.
ja: **注意:** 現在、Qiskit Natureには電子構造問題で動作する変換のみがあります。

source: The ``BasisTransformer``
es_un: El ``BasisTransformer``
ja: ``BasisTransformer``

source: This transformer allows you to transform an ``ElectronicStructureProblem`` from one basis into another. This is useful in certain settings such as: - when you obtained a problem description or the Hamiltonian coefficients in the AO basis from an external source - when you explicitly generated the problem in the AO basis to modify it manually before transforming into the MO basis - etc.
es_un: Este transformador te permite transformar un ``ElectronicStructureProblem`` de una base a otra. Esto es útil en ciertas configuraciones como: - cuando obtuviste una descripción del problema o los coeficientes del Hamiltoniano en la base AO de una fuente externa - cuando generaste explícitamente el problema en la base AO para modificarlo manualmente antes de transformarlo en la base MO - etc.
ja: この変換器は ``ElectronicStructureProblem`` をある基底から別の基底に変換することができます。これは以下のような状況で役に立ちます。- AO基底の問題記述やハミルトニアン係数を外部から取得した場合 - MO基底に変換する前に問題をAO基底で明示的に生成し、手動で修正した場合 - などです。

source: Since we can achieve the second scenario directly using Qiskit Nature, that is what we will be doing here. To learn more about how to do this, we recommend that you read the tutorial on the ```QCSchema`` <08_qcschema.ipynb>`__.
es_un: Dado que podemos lograr el segundo escenario directamente usando Qiskit Nature, eso es lo que haremos aquí. Para obtener más información sobre cómo hacer esto, te recomendamos que leas el tutorial sobre ```QCSchema`` <08_qcschema.ipynb>`__.
ja: Qiskit Natureを使用して直接2番目のシナリオを達成できるので、ここではそれを行うことにします。この方法の詳細については、``QCSchema`` <08_qcschema.ipynb>`__ のチュートリアルを読むことをお勧めします。

source: First, we create a problem in the ``AO`` basis in order to demonstrate the basis transformation:
es_un: Primero, creamos un problema en la base ``AO`` para demostrar la transformación de la base:
ja: まず、``AO`` 基底の問題を作り、基底変換のデモンストレーションを行います。

source: Next, we obtain the ``AO`` to ``MO`` transformer:
es_un: A continuación, obtenemos el transformador de ``AO`` a ``MO``:
ja: 次に、``AO`` から ``MO`` への変換器を入手します。

source: And finally, we can use the transformer to obtain the problem in the ``MO`` basis:
es_un: Y finalmente, podemos usar el transformador para obtener el problema en la base ``MO``:
ja: そして最後に、変換器を用いて ``MO`` 基底の問題を得ることができます。

source: If you need to construct your ``BasisTransformer`` manually, you can do this like so:
es_un: Si necesitas construir tu ``BasisTransformer`` manualmente, puedes hacerlo así:
ja: もし、 ``BasisTransformer`` を手動で作成する必要がある場合は、以下のようにすることができます。

source: The ``FreezeCoreTransformer``
es_un: El ``FreezeCoreTransformer``
ja: ``FreezeCoreTransformer``

source: This transformer provides you with the very simple means to freeze the *core orbitals* of your molecular system. It requires your problem to contain the ``.molecule`` attribute from which it can extract the atomic information necessary to perform this Hilbert space reduction.
es_un: Este transformador te proporciona medios muy simples para congelar los *orbitales centrales* de tu sistema molecular. Requiere que tu problema contenga el atributo ``.molecule`` del cual puede extraer la información atómica necesaria para realizar esta reducción del espacio de Hilbert.
ja: この変換ツールは、分子系の *コア軌道* をフリーズするための非常にシンプルな手段を提供します。この変換器には ``.molecule`` 属性が必要で、そこから Hilbert 空間削減を行うために必要な原子情報を抽出することができます。

source: In the following, we apply the ``FreezeCoreTransformer`` which in this case will remove the single lowest energy orbital (reducing the total number of spatial orbitals from 6 to 5) and also removing the two electrons from within that orbital (as reflected by the changed number of particles).
es_un: A continuación, aplicamos el ``FreezeCoreTransformer`` que en este caso eliminará el orbital de energía más bajo (reduciendo el número total de orbitales espaciales de 6 a 5) y también eliminará los dos electrones dentro de ese orbital (como se refleja en el número cambiado de partículas).
ja: 以下では、``FreezeCoreTransformer`` を適用します。この場合、最もエネルギーの低い軌道を1つ取り除き (空間軌道の総数を6から5に減らす) 、その軌道内の2つの電子も取り除きます (粒子数の変更に反映されます)。

source: Note, that this transformation will result in a constant energy offset resulting from the removal of the core electrons. This offset is registered inside of the hamiltonian’s ``constants`` attribute, which you can inspect like shown below:
es_un: Ten en cuenta que esta transformación dará como resultado una compensación de energía constante como resultado de la eliminación de los electrones del núcleo. Este desplazamiento se registra dentro del atributo ``constants`` del Hamiltoniano, que puedes inspeccionar como se muestra a continuación:
ja: この変換により、コア電子が取り除かれた結果、一定のエネルギーオフセットが発生することに注意してください。このオフセットはハミルトニアンの ``constants`` 属性に登録され、以下のように確認することができます。

source: Furthermore, you can provide a list of orbital indices (0-based) which are to be removed from the system.
es_un: Además, puedes proporcionar una lista de índices orbitales (basados en 0) que se eliminarán del sistema.
ja: さらに、システムから削除する軌道インデックス (0ベース) のリストを提供することができます。

source: **Note:** these orbitals *must* be unoccupied, otherwise you will incur a large error in your computation (even if they are unoccupied you should know which orbitals you are removing, because removing the wrong ones can still incur large errors if the systems dynamics are altered significantly). No guards are in place to check that the provided orbital indices are indeed unoccupied, so this is up to you!
es_un: **Nota:** estos orbitales *deben* estar desocupados, de lo contrario, incurrirás en un gran error en tu cálculo (incluso si están desocupados, debes saber qué orbitales estás eliminando, porque eliminar los incorrectos aún puede generar grandes errores si la dinámica de los sistemas se altera significativamente). No hay guardias para verificar que los índices orbitales provistos estén desocupados, ¡así que depende de ti!
ja: **注意：** これらの軌道は非占有でなければならず、そうでなければ計算で大きな誤差を生じます (たとえ非占有であっても、どの軌道を削除しているのか知っておくべきです、なぜなら間違ったものを削除すると、システムのダイナミクスが大幅に変更された場合にも大きな誤差を生じさせる可能性があるからです)。提供された軌道インデックスが本当に非占有であるかどうかをチェックするための防御装置はありませんので、これはあなた次第です。

source: The ``ActiveSpaceTransformer``
es_un: El ``ActiveSpaceTransformer``
ja: ``ActiveSpaceTransformer``

source: This transformer generalizes the Hilbert space reduction which is performed by the ``FreezeCoreTransformer``. Simply put, it allows you to specify an *active space* by selecting the number of active electrons and the number of active spatial orbitals. According to these settings, the active space will be chosen around the Fermi level.
es_un: Este transformador generaliza la reducción del espacio de Hilbert que realiza el ``FreezeCoreTransformer``. En pocas palabras, te permite especificar un *espacio activo* seleccionando el número de electrones activos y el número de orbitales espaciales activos. De acuerdo con estos ajustes, el espacio activo se elegirá alrededor del nivel de Fermi.
ja: この変換器は ``FreezeCoreTransformer`` によって実行されるヒルベルト空間削減を一般化したものです。簡単に言うと、活性電子の数と活性空間軌道の数を選択することによって、 *活性空間* を指定することができます。これらの設定により、活性空間はフェルミ準位の周辺に選ばれます。

source: The ``ActiveSpaceTransformer`` in Qiskit Nature has one more trick up its sleeve because it even allows you to manually specify the indices of the active orbitals. This enables you to hand-pick active spaces which do not lie continuously around the Fermi level.
es_un: El ``ActiveSpaceTransformer`` en Qiskit Nature tiene un truco más bajo la manga porque incluso te permite especificar manualmente los índices de los orbitales activos. Esto te permite seleccionar a mano espacios activos que no se encuentran continuamente alrededor del nivel de Fermi.
ja: Qiskit Natureの ``ActiveSpaceTransformer`` にはもう1つ、活性軌道のインデックスを手動で指定することができます。これにより、フェルミ準位の周囲に連続的に存在しない活性空間を手動で選ぶことができます。
