Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/06_calculating_thermodynamic_observables.po
Languages: bn_bn, es_un, id_id, ja_jp, ko_kr, pt_un, ta_in

source: Here we demonstrate how to access particular components (the rotational part) of the partition function, which in the H2 case we can further split to para-hydrogen and ortho-hydrogen components.
bn_bn: এখানে আমরা দেখিয়েছি কিভাবে পার্টিশন ফাংশনের বিশেষ উপাদান (ঘূর্ণন অংশ) অ্যাক্সেস করতে হয়, যা H2 এর ক্ষেত্রে আমরা প্যারা-হাইড্রোজেন এবং অর্থো-হাইড্রোজেন উপাদানগুলিতে আরও বিভক্ত করতে পারি।
es_un: Aquí demostramos cómo acceder a componentes particulares (la parte rotacional) de la función de partición, que en el caso de H2 podemos dividirlo aún más en componentes para-hidrógeno y orto-hidrógeno.
id_id: Di sini kami mendemonstrasikan cara mengakses komponen tertentu (bagian rotasi) dari fungsi partisi, yang dalam kasus H2 selanjutnya dapat dipisahkan menjadi komponen para-hidrogen dan orto-hidrogen.
ko_kr: 여기서 우리는 파티션 기능의 특정 구성 요소 (회전 부분) 에 액세스하는 방법을 설명하는데, 이는 H2 케이스에서 파라-수소 및 오르토-수소 성분으로 더 분할할 수 있다.
pt_un: Aqui demonstramos como acessar componentes particulares (a parte rotacional) da função de partição, que no caso do H2 podemos dividir ainda mais nas componentes para-hidrogênio e orto-hidrogênio.
ta_in: பகிர்வு செயல்பாட்டின் குறிப்பிட்ட கூறுகளை (சுழற்சி பகுதி) எவ்வாறு அணுகுவது என்பதை இங்கே காண்பிக்கிறோம், இவ்விடத்தில் H2 வை நாம் பாரா-ஹைட்ரஜன் மற்றும் ஆர்த்தோ-ஹைட்ரஜன் கூறுகளாக மேலும் பிரிக்கலாம்.

source: We will now plot the constant volume heat capacity (of the rotational part) demonstrating how we can call directly the functions in the ‘thermodynamics’ module, providing a callable object for the partition function (or in this case its rotational component). Note that in the plot we normalize the plot dividing by the universal gas constant R (Avogadro’s number times Boltzmann’s constant) and we use crossed to compare with experimental data found in literature.
bn_bn: আমরা এখন ধ্রুবক ভলিউম তাপ ক্ষমতা (ঘূর্ণন অংশের) প্লট করব কিভাবে আমরা সরাসরি 'থার্মোডায়নামিক্স' মডিউলে ফাংশনগুলিকে কল করতে পারি, পার্টিশন ফাংশনের জন্য একটি কলযোগ্য বস্তু প্রদান করে (অথবা এই ক্ষেত্রে এর ঘূর্ণন উপাদান)। লক্ষ্য করুন যে প্লটে আমরা সার্বজনীন গ্যাস ধ্রুবক R (Avogadro এর সংখ্যা বোল্টজমানের ধ্রুবক) দ্বারা বিভক্ত প্লটকে normalize করি এবং গবেষণায় প্রাপ্ত পরীক্ষামূলক তথ্যের সাথে তুলনা করতে আমরা ক্রস ব্যবহার করি।
ko_kr: 이제부터 분배 함수의 호출 가능한 객체 (또는 이 경우 회전 구성 요소) 를 제공하는 '열역학' 모듈에서 함수를 직접 호출하는 방법을 보이며 (회전 부분의) 일정 부피 열용량의 그래프를 그릴 것이다. 참고로 여기서는 그래프를 보편적 기체 상수 R (아보가드로 수와 볼츠만 상수의 곱) 로 나누어 정규화하고, 문헌에서 발견되는 실험 데이터와 상호 비교해본다.
ta_in: நாம் இப்போது 'வெப்ப இயக்கவியல்' தொகுதியில் உள்ள செயல்பாடுகளை எவ்வாறு நேரடியாக அழைக்க முடியும் என்பதை நிரூபிக்கும் நிலையான தொகுதி வெப்ப திறனை (சுழற்சி பகுதியின்) திட்டமிடுவோம், பகிர்வு செயல்பாட்டிற்கு அழைக்கக்கூடிய பொருளை வழங்குகிறது (அல்லது இந்த விஷயத்தில் அதன் சுழற்சி கூறு). சதித்திட்டத்தில் உலகளாவிய வாயு மாறிலி R (அவகாட்ரோவின் எண் நேரங்கள் போல்ட்ஸ்மேன் மாறிலி) வகுக்கும் சதித்திட்டத்தை இயல்பாக்குகிறோம் என்பதை கவனிக்கவும், இலக்கியத்தில் காணப்படும் சோதனைத் தரவுகளுடன் ஒப்பிடுவதற்கு நாங்கள் குறுக்குவழியைப் பயன்படுத்துகிறோம்.

source: We will now plot the constant volume heat capacity (of the rotational part) demonstrating how we can call directly the functions in the ‘thermodynamics’ module, providing a callable object for the partition function (or in this case its rotational component). Note that in the plot we normalize the plot dividing by the universal gas constant R (Avogadro’s number times Boltzman’s constant) and we use crossed to compare with experimental data found in literature.
es_un: Ahora graficaremos la capacidad de calor a volumen constante (de la parte rotacional) demostrando cómo podemos llamar directamente a las funciones en el módulo "thermodynamics", proporcionando un objeto invocable para la función de partición (o en este caso su componente rotacional). Notar que en el gráfico normalizamos el gráfico dividiendo por la constante universal de los gases R (número de Avogadro veces la constante de Botzman) y usamos cruces para comparar con los datos experimentales encontrados en la literatura.
id_id: Sekarang kita akan memplot kapasitas kalor volume konstan (dari bagian rotasi) yang mendemonstrasikan bagaimana kita dapat memanggil secara langsung fungsi dalam modul 'termodinamika', menyediakan objek yang dapat dipanggil untuk fungsi partisi (atau dalam hal ini komponen rotasinya). Perhatikan bahwa dalam plot kami menormalkan plot membagi dengan konstanta gas universal R (bilangan Avogadro dikali konstanta Boltzman) dan kami menggunakan persilangan untuk membandingkan dengan data eksperimental yang ditemukan dalam literatur.
pt_un: Vamos agora visualizar a capacidade térmica a volume constante (da parte rotacional) demonstrando como podemos chamar diretamente as funções no módulo ‘thermodynamics’, fornecendo um objeto chamável para a função de partição (ou neste caso seu componente rotacional). Observe que no gráfico nós normalizamos-o dividindo pela constante universal dos gases R (número de Avogadro vezes a constante de Boltzman) e usamos cruzes para comparar com dados experimentais encontrados na literatura.

source: The partition function for a molecule is the product of contributions from translational, rotational, vibrational, electronic, and nuclear degrees of freedom. Having the vibrational frequencies, now we can obtain the vibrational partition function :math:`q_{\rm vibration}` to compute the whole molecular partition function :nbsphinx-math:`\begin{equation} q_{\rm vibration} = \prod_{i=1} ^M \frac{\exp\,(-\Theta_{\nu_i}/2T)}{1-\exp\,(-\Theta_{\nu_i}/2T)} \, . \end{equation}` Here :math:`\Theta_{\nu_i}= h\nu_i/k_B`, :math:`T` is the temperature and :math:`k_B` is the Boltzmann constant.
ko_kr: 분자의 분배 함수는 병진, 회전, 진동, 전자 및 핵 자유도의 기여도의 산물이다. 진동 주파수를 가지고, 이제 우리는 전체 분자 분배 함수를 계산하기 위한 진동 분배 함수 :math:`q_{\rm vibration}` 를 얻을 수 있다. :nbsphinx-math:`\begin{equation} q_{\rm vibration} = \prod_{i=1} ^M \frac{\exp\,(-\Theta_{\nu_i}/2T)}{1-\exp\,(-\Theta_{\nu_i}/2T)} \, . \end{equation}` 여기서 :math:`\Theta_{\nu_i}= h\nu_i/k_B`, :math:`T` 는 온도이고 :math:`k_B` 는 볼츠만 상수이다.
