Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/06_calculating_thermodynamic_observables.po
Languages: bn_bn, es_un, id_id, ja_jp, ko_kr, pt_un, ta_in

source: This page was generated from `docs/tutorials/06_calculating_thermodynamic_observables.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/06_calculating_thermodynamic_observables.ipynb`__ থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `docs/tutorials/06_calculating_thermodynamic_observables.ipynb`__.
ja_jp: このページは `docs/tutorials/06_calculating_thermodynamic_observables.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/06_calculating_thermodynamic_observables.ipynb`__ 에서 생성되었다.
ta_in: இந்தப் பக்கம் `docs/tutorials/06_calculating_thermodynamic_observables.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Calculating Thermodynamics Observables with a quantum computer
bn_bn: কোয়ান্টাম কম্পিউটারের সাহায্যে তাপগতিবিদ্যার পর্যবেক্ষণযোগ্য বা দৃষ্টিগ্রাহ্য (অবজারভেবল) গণনা
es_un: Calculando Observables de Termodinámica con una computadora cuántica
id_id: Kalkulasi Pengamatan (Observable) Termodinamika dengan komputer kuantum
ja_jp: 量子コンピューターによる熱力学的観測量の計算
ko_kr: 양자컴퓨터를 이용해 열역학적 관측량 계산하기
pt_un: Calculando Observáveis Termodinâmicos com um computador quântico
ta_in: ஒரு குவாண்டம் கணினி மூலம் வெப்ப இயக்கவியல் அவதானிப்புகளைக் கணக்கிடுதல்

source: A preliminary draft with more information related to this tutorial can be found in preprint: Stober et al, arXiv 2003.02303 (2020)
bn_bn: আরও বিস্তারিত তথ্য নিয়ে এই পাঠসমূহের (টিউটোরিয়াল) একটি প্রাথমিক খসড়া পাওয়া যাবে: Stober et al, arXiv 2003.02303 (2020) - এখানে।
es_un: Se puede encontrar un borrador preliminar con más información relacionada con este tutorial en la preimpresión: Stober et al, arXiv 2003.02303 (2020)
id_id: Draf pendahuluan dengan lebih banyak informasi terkait dengan tutorial ini dapat ditemukan dalam pracetak: Stober et al, arXiv 2003.02303 (2020)
ja_jp: このチュートリアルに関連するより多くの情報を含んだ予備的なドラフトは、以下のプレプリントに記載されています。 Stober et al, arXiv 2003.02303 (2020)
ko_kr: 이 튜토리얼과 관련된 더 많은 정보가 있는 초안은 다음 사전 인쇄에서 볼 수 있다: Stober et al, arXiv 2003.02303 (2020)
pt_un: Um rascunho preliminar com mais informações relacionadas a este tutorial pode ser encontrado no preprint: Stober et al, arXiv 2003.02303 (2020)
ta_in: இந்த டுடோரியல் தொடர்பான கூடுதல் தகவல்களைக் கொண்ட பூர்வாங்க வரைவை முன்கூட்டியே அச்சிடலாம்: ஸ்டோபர் மற்றும் பலர், arXiv 2003.02303 (2020)

source: Calculation of the Born Oppenheimer Potential Energy Surface (BOPES)
bn_bn: বর্ন ওপেনহাইমার বিভব শক্তি পৃষ্ঠের হিসাব (BOPES)
es_un: Cálculo de la Superficie de Energía Potencial de Born Oppenheimer (BOPES)
id_id: Perhitungan dari Energi Potensial Permukaan Born Oppenheimer (Born Oppenheimer Potential Energy Surface, BOPES)
ja_jp: Born Oppenheimer ポテンシャル・エネルギー面 (Born Oppenheimer Potential Energy Surface, BOPES) の計算
ko_kr: 보른 오펜하이머 퍼텐셜 에너지 표면 (Born Oppenheimer Potential Energy Surface, BOPES) 계산
pt_un: Cálculo de Born Oppenheimer Potential Energy Surface (BOPES)
ta_in: பிறந்த ஓப்பன்ஹைமர் சாத்தியமான ஆற்றல் மேற்பரப்பின் கணக்கீடு (BOPES)

source: To compute thermodynamic observables we begin with single point energy calculation which calculates the wavefunction and charge density and therefore the energy of a particular arrangement of nuclei. Here we compute the Born-Oppenheimer potential energy surface of a hydrogen molecule, as an example, which is simply the electronic energy as a function of bond length.
bn_bn: থার্মোডাইনামিক পর্যবেক্ষণযোগ্যগুলো গণনা করার জন্য আমরা একক বিন্দু শক্তি গণনা দিয়ে শুরু করি যা তরঙ্গ ক্রিয়া এবং চার্জ ঘনত্ব গণনা করে এবং তাই নিউক্লিয়াসের একটি বিশেষ বিন্যাসের শক্তি। এখানে আমরা একটি হাইড্রোজেন অণুর বর্ন-ওপেনহাইমার সম্ভাব্য শক্তি পৃষ্ঠের হিসাব করি, উদাহরণস্বরূপ, যা কেবল বন্ড দৈর্ঘ্যের একটি ফাংশন হিসাবে বৈদ্যুতিন শক্তি।
es_un: Para calcular observables termodinámicas comenzamos con el cálculo de la energía de un solo punto el cual determina la función de onda y la densidad de carga, por lo tanto la energía de un arreglo particular de núcleos. Aquí calculamos la superficie de energía potencial Born Oppenheimer para una molécula de hidrógeno, como un ejemplo, la cuál es simplemente la energía electrónica como función de la longitud del enlace.
id_id: Untuk menghitung pengamatan termodinamika, kami mulai dengan kalkulasi energi titik tunggal yang menghitung fungsi gelombang, kerapatan muatan dan energi dari susunan inti tertentu. Di sini kami menghitung energi potensial permukaan Born-Oppenheimer dari molekul hidrogen, sebagai contoh, yang secara sederhana merupakan energi elektronik sebagai fungsi dari panjang ikatan.
ja_jp: 熱力学的な観測量を計算するために、波動関数と電荷密度、つまり特定の原子核配置におけるエネルギーを求める、一点計算から始めます。ここでは例として、単に結合長の関数としての電子のエネルギーである、水素分子の Born-Oppenheimer ポテンシャル・エネルギー面を計算します。
ko_kr: 열역학적 관측량을 계산하기 위해, 파동 함수와 전하 밀도를 계산하는 단일 지점 에너지 계산으로 시작하여 특정 배열의 핵 에너지를 계산한다. 여기서, 수소 분자의 Born-Oppenheimer 퍼텐셜 에너지 표면을 한 가지 예로서 계산하며, 이는 결합 길이의 함수로서 전자 에너지이다.
pt_un: Para computar observáveis termodinâmicos começamos com o cálculo de energia de um único ponto que calcula a função de onda e a densidade de carga e, portanto, a energia de um determinado arranjo de núcleos. Aqui computamos a superfície de energia potencial de Born-Oppenheimer de uma molécula de hidrogênio, como exemplo, que é simplesmente a energia eletrônica em função do comprimento da ligação.
ta_in: வெப்ப இயக்கவியல் அவதானிப்புகளைக் கணக்கிடுவதற்கு நாம் ஒற்றைப் புள்ளி ஆற்றல் கணக்கீட்டில் தொடங்குகிறோம், இது அலை செயல்பாடு மற்றும் சார்ஜ் அடர்த்தியைக் கணக்கிடுகிறது, எனவே கருக்களின் ஒரு குறிப்பிட்ட ஏற்பாட்டின் ஆற்றலைக் கணக்கிடுகிறது. இங்கே நாம் ஒரு ஹைட்ரஜன் மூலக்கூறின் பார்ன்-ஓப்பன்ஹைமர் சாத்தியமான ஆற்றல் மேற்பரப்பைக் கணக்கிடுகிறோம், எடுத்துக்காட்டாக, இது பிணைப்பு நீளத்தின் செயல்பாடாக மின்னணு ஆற்றலாகும்.

source: Calculation of the molecular Vibrational Energy levels
bn_bn: আণবিক কম্পন শক্তিস্তরের হিসাব
es_un: Cálculo de los niveles moleculares de Energía Vibracional
id_id: Kalkulasi dari tingkat Energi Vibrasional molekular
ja_jp: 分子の振動エネルギー・レベルの計算
ko_kr: 분자 진동 에너지 준위의 계산
ta_in: மூலக்கூறு அதிர்வு ஆற்றல் அளவுகளின் கணக்கீடு

source: The Born-Oppeheimer approximation removes internuclear vibrations from the molecular Hamiltonian and the energy computed from quantum mechanical ground-state energy calculations using this approximation contain only the electronic energy. Since even at absolute zero internuclear vibrations still occur, a correction is required to obtain the true zero-temperature energy of a molecule. This correction is called the zero-point vibrational energy (ZPE), which is computed by summing the contribution from internuclear vibrational modes. Therefore, the next step in computing thermodynamic observables is determining the vibrational energy levels. This can be done by constructing the Hessian matrix based on computed single point energies close to the equilibrium bond length. The eigenvalues of the Hessian matrix can then be used to determine the vibrational energy levels and the zero-point vibrational energy
bn_bn: Born-Oppeheimer approximation আণবিক হ্যামিল্টোনিয়ান থেকে অন্তর্নিহিত কম্পন দূর করে এবং এই আনুমানিক ব্যবহার করে কোয়ান্টাম মেকানিক্যাল গ্রাউন্ড-স্টেট এনার্জি গণনা থেকে গণিত শক্তি শুধুমাত্র ইলেকট্রনিক শক্তি ধারণ করে। যেহেতু পরম শূন্যেও পরমাণু স্পন্দন এখনও ঘটে, তাই একটি অণুর প্রকৃত শূন্য-তাপমাত্রা শক্তি পাওয়ার জন্য একটি সংশোধন প্রয়োজন। এই সংশোধনকে শূন্য-বিন্দু কম্পন শক্তি (ZPE) বলা হয়, যা অভ্যন্তরীণ কম্পনের মোডগুলির অবদানের সংমিশ্রণ দ্বারা গণনা করা হয়। অতএব, থার্মোডাইনামিক পর্যবেক্ষণযোগ্য গণনার পরবর্তী ধাপ হল কম্পন শক্তির মাত্রা নির্ধারণ করা। এটি ভারসাম্য বন্ড দৈর্ঘ্যের কাছাকাছি গণিত একক বিন্দু শক্তির উপর ভিত্তি করে হেসিয়ান ম্যাট্রিক্স তৈরি করে করা যেতে পারে। হেসিয়ান ম্যাট্রিক্স এর eigenvalues ​​তারপর কম্পন শক্তি মাত্রা এবং শূন্য বিন্দু কম্পন শক্তি নির্ধারণ করতে ব্যবহার করা যেতে পারে
es_un: La aproximación Born-Oppenheimer elimina las vibraciones internucleares del Hamiltoniano molecular y la energía calculada a partir de los cálculos de energía base del estado mecánico cuántico utilizando esta aproximación sólo contiene la energía electrónica. Puesto que incluso en cero absoluto las vibraciones internucleares todavía ocurren, se requiere una corrección para obtener la verdadera energía de temperatura cero de una molécula. Esta corrección se llama la energía vibratoria de punto cero (ZPE), que se calcula sumando la contribución de los modos vibratorios internucleares. Por lo tanto, el siguiente paso en la computación de observables termodinámicos es determinar los niveles de energía vibracional. Esto se puede hacer mediante la construcción de la matriz hessiana basada en las energías de un solo punto calculadas cerca de la longitud del enlace de equilibrio. Los valores propios de la matriz hessiana pueden ser usados para determinar los niveles de energía vibracional y la energía vibratoria de punto cero
id_id: Pendekatan Born-Oppeheimer menghilangkan vibrasi antar inti dari Hamiltonian molekul dan energi yang dihitung dari perhitungan energi keadaan dasar mekanika kuantum dengan pendekatan yang hanya mengandung energi elektronik. Karena pada nol mutlak vibrasi antar inti masih terjadi, koreksi diperlukan untuk mendapatkan energi temperatur nol yang sebenarnya dari sebuah molekul. Koreksi ini disebut energi vibrasi titik-nol (zero-point vibrational energy, ZPE), yang dihitung dengan menjumlahkan kontribusi dari mode vibrasi antar inti. Oleh karena itu, langkah berikutnya dalam komputasi termodinamika observabel adalah menentukan tingkat energi vibrasi. Hal ini dapat dilakukan dengan membuat matriks Hessian berdasarkan perhitungan energi titik tunggal yang dekat dengan panjang ikatan kesetimbangan. Nilai eigen matriks Hessian kemudian dapat digunakan untuk menentukan tingkat energi vibrasi dan energi vibrasi titik nol
ja_jp: Born-Oppeheimer 近似では、分子のハミルトニアンで原子核の振動を無視するため、このように近似された量子力学的な基底エネルギー計算によって求められたエネルギーは、電子的なエネルギーのみが含まれています。絶対零度においても原子核は振動しているため、分子の真の零点エネルギーを得るためには補正が必要です。この補正は、ゼロ点振動エネルギー (zero-point vibrational energy, ZPE) と呼ばれ、原子核の振動モードの寄与をあわせて計算されます。したがって、熱力学的な観測量を計算するための次のステップは、振動エネルギー・レベルを決定することです。これは、平衡結合長に近い単一点エネルギーに基づいてヘッセ行列を作成することにより行うことができます。ヘッセ行列の固有値は、振動エネルギー・レベルと零点振動エネルギーを決定するために用いることができます。
ko_kr: Born-Oppeheimer 근사값은 분자 해밀톤 (Hamiltonian) 으로부터의 핵간 진동을 제거하고, 이러한 근사값을 사용하는 양자 역학적 기저 상태 에너지 계산으로부터 계산된 에너지는 단지 전자 에너지만을 포함한다. 절대 제로 핵간 진동이 여전히 발생하기 때문에, 분자의 진정한 0-온도 에너지를 얻기 위해 보정이 필요하다. 이러한 보정을 영점 진동 에너지 (ZPE) 라고 하며, 이는 핵간 진동 모드로부터의 기여를 합하여 계산된다. 따라서, 열역학적 관측량을 연산하는 다음 단계는 진동 에너지 레벨을 결정하는 것이다. 이는 평형 결합 길이에 근접한 단일 지점 에너지 계산을 기반으로 하는 헤시안 (Hessian) 행렬 구성을 통해 결정된다. 그 후, 헤시안 (Hessian) 행렬의 고유값들은 진동 에너지 레벨들 및 영점 진동 에너지를 결정하기 위해 사용될 수 있다.
pt_un: A aproximação de Born-Oppenheimer remove vibrações internucleares do Hamiltoniano molecular e a energia computada a partir de cálculos de energia do estado fundamental da mecânica quântica utilizando esta aproximação contém apenas a energia eletrônica. Uma vez que mesmo no zero absoluto as vibrações internucleares ainda ocorrem, é necessária uma correção para obter a verdadeira energia de temperatura zero de uma molécula. Essa correção é chamada de energia vibracional do ponto zero (ZPE), que é computada somando a contribuição de modos vibracionais internucleares. Por isso, o próximo passo na computação dos observáveis termodinâmicos é determinar os níveis de energia vibracional. Isso pode ser feito através da construção da matriz Hessiana baseda nas energias de ponto único computadas próximas ao comprimento da ligação em equilíbrio. Os autovalores da matriz Hessiana podem, então, ser usados para determinar os níveis de energia vibracional e a energia vibracional de ponto zero
ta_in: பார்ன்-ஓபீஹைமர் தோராயமானது மூலக்கூறு ஹாமில்டோனியனிடமிருந்து உள்ளக அதிர்வுகளை நீக்குகிறது மற்றும் இந்த தோராயத்தைப் பயன்படுத்தி குவாண்டம் மெக்கானிக்கல் தரை-நிலை ஆற்றல் கணக்கீடுகளிலிருந்து கணக்கிடப்படும் ஆற்றல் மின்னணு ஆற்றலை மட்டுமே கொண்டுள்ளது. முழுமையான பூஜ்ஜிய உள் அணு அதிர்வுகளில் கூட இன்னும் ஏற்படுவதால், ஒரு மூலக்கூறின் உண்மையான பூஜ்ஜிய-வெப்பநிலை ஆற்றலைப் பெற ஒரு திருத்தம் தேவைப்படுகிறது. இந்த திருத்தம் பூஜ்ஜிய புள்ளி அதிர்வு ஆற்றல் (ZPE) என அழைக்கப்படுகிறது, இது அணுக்கரு அதிர்வு முறைகளின் பங்களிப்பைச் சுருக்கிக் கணக்கிடப்படுகிறது. எனவே, வெப்ப இயக்கவியல் அவதானிப்புகளைக் கணக்கிடுவதற்கான அடுத்த கட்டம் அதிர்வு ஆற்றல் மட்டங்களை தீர்மானிப்பதாகும். சமநிலை பிணைப்பு நீளத்திற்கு நெருக்கமான கணக்கிடப்பட்ட ஒற்றை புள்ளி ஆற்றல்களின் அடிப்படையில் ஹெஸியன் மேட்ரிக்ஸை உருவாக்குவதன் மூலம் இதைச் செய்யலாம். அதிர்வு ஆற்றல் மட்டங்களையும் பூஜ்ஜிய புள்ளி அதிர்வு ஆற்றலையும் தீர்மானிக்க ஹெஸியன் மேட்ரிக்ஸின் சமமான மதிப்புகள் பயன்படுத்தப்படலாம்

source: :nbsphinx-math:`\begin{equation} {\rm ZPE} = \frac{1}{2}\, \sum_i ^M \nu_i \, , \end{equation}` with :math:`\nu_i` being the vibrational frequencies, :math:`M = 3N − 6` or :math:`M = 3N − 5` for non-linear or linear molecules, respectively, and :math:`N` is number of the particles.
bn_bn: :nbsphinx-math:`\begin{equation} {\rm ZPE} = \frac{1}{2}\, \sum_i ^M \nu_i \, , \end{equation}` with :math:`\nu_i` হল স্পন্দন কম্পাঙ্ক, :math:`M = 3N − 6` or :math:`M = 3N − 5` যথাক্রমে অরৈখিক ও রৈখিক অণুর জন্য, এবং :math:`N` হল কণার সংখ্যা.
es_un: :nbsphinx-math:`\begin{equation} {\rm ZPE} = \frac{1}{2}\, \sum_i ^M \nu_i \, , \end{equation}` con :math:`\nu_i` siendo las frecuencias vibracionales, :math:`M = 3N − 6` o :math:`M = 3N − 5` para moléculas no lineales o lineales, respectivamente, y :math:`N` es el número de partículas.
id_id: :nbsphinx-math:`\begin{equation} {\rm ZPE} = \frac{1}{2}\, \sum_i ^M \nu_i \, , \end{equation}` dengan :math:`\nu_i` sebagai frekuensi vibrasional, :math:`M = 3N − 6` atau :math:`M = 3N − 5` untuk molekul non-linear atau linear, secara berurutan, dan :math:`N` adalah banyaknya partikel.
ja_jp: :nbsphinx-math:`\begin{equation} {\rm ZPE} = \frac{1}{2}\, \sum_i ^M \nu_i \, , \end{equation}` ここで :math:`\nu_i` は振動周波数、:math:`N` は粒子数を表しており、非線形な分子に対しては :math:`M = 3N − 6` 、線形な分子に対しては :math:`M = 3N − 5` です。
ko_kr: :nbsphinx-math:`\begin{equation} {\rm ZPE} = \frac{1}{2}\, \sum_i ^M \nu_i \, , \end{equation}` 위에서 :math:`\nu_i` 는 진동 주파수, :math:`M = 3N − 6` 또는 :math:`M = 3N − 5` (비선형 또는 선형 분자), :math:`N` 은 입자 수다.
pt_un: :nbsphinx-math:`\begin{equation} {\rm ZPE} = \frac{1}{2}\, \sum_i ^M \nu_i \, , \end{equation}` com :math:`\nu_i` sendo as frequências vibracionais, :math:`M = 3N -- 6` ou :math:`M = 3N -- 5` para moléculas não-lineares ou lineares, respectivamente e :math:`N` é o número de partículas.
ta_in: :nbsphinx-math:`\begin{equation} {\rm ZPE} = \frac{1}{2}\, \sum_i ^M \nu_i \, , \end{equation}` உடன் :math:`\nu_i` வைப்ரேஷனல் அதிர்வெண்களாக இருப்பின், :math:`M = 3N − 6` அல்லது நேரியல் அல்லது நேரியல் மூலக்கூறுகளுக்கு முறையே :math:`M = 3N − 5`, மற்றும் :math:`N` என்பது துகள்களின் எண்ணிக்கை.

source: Here we fit a “full” energy surface using a 1D spline potential and use it to evaluate molecular vibrational energy levels.
bn_bn: এখানে একটি একক মাত্রার স্প্লাইন বিভব ব্যবহার করে একটি "পূর্ণ" শক্তির পৃষ্ঠকে মানানসই (ফিট) করি এবং এটি আণবিক কম্পন শক্তির মাত্রা মূল্যায়নের জন্য ব্যবহার করি।
es_un: Aquí ajustamos una superficie "llena" con un potencial spline 1D y lo usamos para evaluar los niveles de energía vibracional molecular.
id_id: Di sini kami menyesuaikan energi permukaan "penuh" menggunakan potensial spline 1D dan menggunakannya untuk mengevaluasi tingkat energi vibrasional molekul.
ja_jp: ここで、一次元スプライン・ポテンシャルを用いてエネルギー面「全体」のフィッティングを行い、それを分子の振動エネルギー・レベルの評価に使用します。
ko_kr: 여기서는 1D spline potential을 사용하여 “전체” 에너지 표면을 맞추고, 이를 사용하여 분자 진동 에너지 레벨을 평가한다.
pt_un: Aqui ajustamos uma superfície de energia “completa” usando um potencial de spline 1D e utilizando-o para avaliar os níveis de energia vibracional molecular.
ta_in: இங்கே நாம் 1D ஸ்ப்லைன் திறனைப் பயன்படுத்தி ஒரு “முழு” ஆற்றல் மேற்பரப்பைப் பொருத்தி மூலக்கூறு அதிர்வு ஆற்றல் மட்டங்களை மதிப்பிடுவதற்குப் பயன்படுத்துகிறோம்.

source: Create a partition function for the calculation of heat capacity
bn_bn: তাপ ধারনক্ষমতা হিসাবের জন্য একটি পার্টিশন ফাংশন তৈরি কর
es_un: Crear una función de partición para el cálculo de la capacidad de calor
id_id: Membuat fungsi partisi untuk kalkulasi kapasitas kalor
ja_jp: 熱容量を計算するための分配関数の作成
ko_kr: 열용량 계산을 위한 분배함수 정의
pt_un: Crie uma função de partição para o cálculo da capacidade térmica
ta_in: வெப்பத் திறனைக் கணக்கிடுவதற்கு ஒரு பகிர்வு செயல்பாட்டை உருவாக்கவும்

source: The partition function for a molecule is the product of contributions from translational, rotational, vibrational, electronic, and nuclear degrees of freedom. Having the vibrational frequencies, now we can obtain the vibrational partition function :math:`q_{\rm vibration}` to compute the whole molecular partition function :nbsphinx-math:`\begin{equation} q_{\rm vibration} = \prod_{i=1} ^M \frac{\exp\,(-\Theta_{\nu_i}/2T)}{1-\exp\,(-\Theta_{\nu_i}/2T} \, . \end{equation}` Here :math:`\Theta_{\nu_i}= h\nu_i/k_B`, :math:`T` is the temperature and :math:`k_B` is the Boltzmann constant.
bn_bn: একটি অণুর জন্য পার্টিশন ফাংশন হল স্থানান্তরণ, ঘূর্ণন, কম্পন, ইলেকট্রনিক এবং স্বাধীনতার পারমাণবিক ডিগ্রির অবদানের ফল। ভাইব্রেশনাল ফ্রিকোয়েন্সি থাকার ফলে, এখন আমরা সম্পূর্ণ আণবিক পার্টিশন ফাংশন :nbsphinx-math:`\begin{equation} q_{\rm vibration} = \prod_{i=1} ^M \frac{\exp\,(-\Theta_{\nu_i}/2T)}{1-\exp\,(-\Theta_{\nu_i}/2T} \, গণনা করতে কম্পন পার্টিশন ফাংশন :math:`q_{\rm vibration}` পেতে পারি। \end{equation}` এখানে :math:`\Theta_{\nu_i}= h\nu_i/k_B`, :math:`T` হল তাপমাত্রা এবং :math:`k_B` হল বোল্টজম্যান ধ্রুবক।
es_un: La función de partición para una molécula es el producto de contribuciones de grados de libertad traslacionales, rotacionales, vibracionales, electrónicos y nucleares. Teniendo las frecuencias vibracionales, podemos obtener la función de partición vibracional :math:`q_{\rm vibration}` para calcular la función de partición molecular entera :nbsphinx-math:`\begin{equation} q_{\rm vibration} = \prod_{i=1} ^M \frac{\exp\,(-\Theta_{\nu_i}/2T)}{1-\exp\,(-\Theta_{\nu_i}/2T} \, .\end{equation}` Aquí :math:`\Theta_{\nu_i}= h\nu_i/k_B`, :math:`T` es la temperatura y :math:`k_B` es la constante de Boltzmann.
id_id: Fungsi partisi untuk sebuah molekul adalah produk kontribusi dari translasional, rotasional, vibrasional, elektronik, dan derajat kebebasan nuklir. Dengan frekuensi vibrasional, sekarang kita bisa mendapatkan fungsi partisi vibrasional :math:`q_{\rm vibration}` untuk menghitung keseluruhan fungsi partisi vibrasional :nbsphinx-math:`\begin{equation} q_{\rm vibration} = \prod_{i=1} ^M \frac{\exp\,(-\Theta_{\nu_i}/2T)}{1-\exp\,(-\Theta_{\nu_i}/2T} \, . \end{equation}` Di sini :math:`\Theta_{\nu_i}= h\nu_i/k_B`, :math:`T adalah temperatur dan :math:`k_B` adalah konstanta Boltzmann.
ja_jp: 分子の分配関数は、並進・回転・振動・電子・原子核の自由度からの寄与の積です。振動の周波数がわかっているので、分子全体の分配関数 :nbsphinx-math:`\begin{equation} q_{\rm vibration} = \prod_{i=1} ^M \frac{\exp\,(-\Theta_{\nu_i}/2T)}{1-\exp\,(-\Theta_{\nu_i}/2T} \, . \end{equation}` を計算するための振動分配関数 :math:`q_{\rm vibration}` を求めることができます。ここで :math:`\Theta_{\nu_i}= h\nu_i/k_B`であり、 :math:`T` は温度、:math:`k_B` はボルツマン定数です。
pt_un: A função de partição para uma molécula é o produto das contribuições dos graus de liberdade translacional, rotacional, vibracional, electrônico e nuclear. Tendo as frequências vibracionais, agora podemos obter a função de partição vibracional :math:`q_{\rm vibration}` para calcular a função de partição molecular inteira :nbsphinx-math:`\begin{equation} q_{\rm vibration} = \prod_{i=1} ^M \frac{\exp\,(-\Theta_{\nu_i}/2T)}{1-\exp\,(-\Theta_{\nu_i}/2T} \, . \end{equation}` Aqui :math:`\Theta_{\nu_i}= h\nu_i/k_B`, :math:`T` é a temperatura e :math:`k_B` é a constante de Boltzman.
ta_in: ஒரு மூலக்கூறுக்கான பகிர்வு செயல்பாடு என்பது மொழிபெயர்ப்பு, சுழற்சி, அதிர்வு, மின்னணு மற்றும் அணுசக்தி சுதந்திரத்தின் பங்களிப்புகளின் விளைவாகும். அதிர்வு அதிர்வெண்களைக் கொண்டிருப்பதால், இப்போது நாம் அதிர்வு பகிர்வு செயல்பாட்டைப் பெறலாம் :math:`q_{\rm vibration}` முழு மூலக்கூறு பகிர்வு செயல்பாட்டைக் கணக்கிட, :nbsphinx-math:`\begin{equation} q_{\rm vibration} = \prod_{i=1} ^M \frac{\exp\,(-\Theta_{\nu_i}/2T)}{1-\exp\,(-\Theta_{\nu_i}/2T} \, . \end{equation}` இங்கே :math:`\Theta_{\nu_i}= h\nu_i/k_B`, :math:`T` என்பது வெப்பநிலை மற்றும் :math:`k_B` என்பது போல்ட்ஜ்மேன் மாறிலி.

source: The single-point energy calculations and the resulting partition function can be used to calculate the (constant volume or constant pressure) heat capacity of the molecules. The constant volume heat capacity, for example, is given by
bn_bn: একক-বিন্দু শক্তির গণনা এবং ফলে পার্টিশন ফাংশন অণুর (ধ্রুব ভলিউম বা ধ্রুব চাপ) তাপ ক্ষমতা গণনা করতে ব্যবহার করা যেতে পারে। ধ্রুব ভলিউম তাপ ক্ষমতা, নিম্নের উদাহরণস্বরূপ দেওয়া হয়
es_un: La energía de un solo punto y la función de partición resultante se puede usar para calcular (a volumen constante o presión constante) la capacidad de calor de las moléculas. La capacidad de calor a volumen constante, por ejemplo, está dada por
id_id: Kalkulasi energi titik tunggal dan fungsi partisi yang dihasilkan dapat digunakan untuk menghitung kapasitas kalor (volume konstan atau tekanan konstan) molekul. Kapasitas kalor volume konstan, misalnya, diberikan oleh
ko_kr: 단일-점 에너지 계산 및 결과적인 파티션 함수는 분자의 (일정 체적 또는 일정한 압력) 열 용량을 계산하는데 사용될 수 있다. 예를 들어, 일정 부피의 열 용량은 다음에 의해 주어진다.
pt_un: Os cálculos da energia de ponto único e a função de partição resultante podem ser usados para calcular a capacidade térmica (a volume constante ou à pressão constante) das moléculas. A capacidade térmica a volume constante, por exemplo, é dada por
ta_in: ஒற்றை-புள்ளி ஆற்றல் கணக்கீடுகள் மற்றும் அதன் விளைவாக வரும் பகிர்வு செயல்பாடு மூலக்கூறுகளின் (நிலையான அளவு அல்லது நிலையான அழுத்தம்) வெப்பத் திறனைக் கணக்கிடப் பயன்படுத்தப்படலாம். நிலையான தொகுதி வெப்பத் திறன், எடுத்துக்காட்டாக, இவ்வாறு வழங்கப்படுகிறது

source: :math:`U` is the internal energy, :math:`V` is the volume and :math:`Q` is the partition function.
bn_bn: :math:`U` হল অভ্যন্তরীণ শক্তি, :math:`V` হল আয়তন এবং :math:`Q` হল পার্টিশন ফাংশন।
es_un: :math:`U` es la energía interna, :math:`V` es el volumen y :math:`Q` es la función de partición.
id_id: :math:`U` adalah energi internal, :math:`V` adalah volume dan :math:`Q` adalah fungsi partisi.
ja_jp: :math:`U` は内部エネルギー、 :math:`V` は体積、:math:`Q` は分配関数です。
ko_kr: :math:'U' 는 내부 에너지, :math:'V' 는 볼륨, :math:'Q' 는 파티션 기능이다.
pt_un: :math:`U` é a energia interna, :math:`V` é o volume e :math:`Q` é a função de partição.
ta_in: :math:`U` என்பது உள் ஆற்றல், :math:`V` என்பது தொகுதி மற்றும் :math:`Q` என்பது பகிர்வு செயல்பாடு.

source: Here we illustrate the simplest usage of the partition function, namely creating a Thermodynamics object to compute properties like the constant pressure heat capacity defined above.
bn_bn: এখানে পার্টিশন ফাংশনের সহজতম ব্যবহার ব্যাখ্যা করা হল, আমরা মূলত বিভিন্ন ধর্ম যেমন একটি তাপগতিবিদ্যা সম্বন্ধীয় অবজেক্ট তৈরি করে উপরে সংজ্ঞায়িত ধ্রুবক চাপ তাপ ক্ষমতা হিসাব করি।
es_un: Aquí ilustramos el uso más simple de la función de partición, a saber, la creación de un objeto Thermodynamics para calcular propiedades como la capacidad de calor a presión constante definida anteriormente.
id_id: Di sini kami mengilustrasikan penggunaan paling sederhana dari fungsi partisi, yaitu membuat objek Termodinamika untuk menghitung properti seperti kapasitas kalor tekanan konstan yang didefinisikan di atas.
ko_kr: 여기에서는 파티션 기능의 가장 단순한 사용법을 설명합니다. 즉, 위에 정의된 일정한 압력 열 용량과 같은 특성을 계산하기 위한 Thermodynamics 오브젝트를 작성합니다.
pt_un: Aqui ilustramos o uso mais simples da função de partição, a saber, criar um objeto Thermodynamics para computar propriedades como a capacidade térmica à pressão constante definida acima.
ta_in: பகிர்வு செயல்பாட்டின் எளிமையான பயன்பாட்டை இங்கே விளக்குகிறோம், அதாவது மேலே வரையறுக்கப்பட்ட நிலையான அழுத்தம் வெப்பத் திறன் போன்ற பண்புகளை கணக்கிட ஒரு வெப்ப இயக்கவியல் பொருளை உருவாக்குதல்.
