Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/06_qubit_mappers.po
Languages: es_un, ja

source: This page was generated from `docs/tutorials/06_qubit_mappers.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/06_qubit_mappers.ipynb`__.
ja: このページは `docs/tutorials/06_qubit_mappers.ipynb`__ から生成されました。

source: Mapping to the Qubit Space
es_un: Mapear al Espacio de Qubit
ja: 量子ビット空間へのマッピング

source: The problems and operators with which you interact in Qiskit Nature (usually) need to be mapped into the qubit space before they can be solved with our quantum algorithms. This task is handled by our ``QubitConverter`` as well as the various ``QubitMapper`` classes.
es_un: Los problemas y operadores con los que interactúas en Qiskit Nature (por lo general) deben mapearse al espacio de qubits antes de que puedan resolverse con nuestros algoritmos cuánticos. Esta tarea está a cargo de nuestro ``QubitConverter``, así como de las diversas clases de ``QubitMapper``.
ja: Qiskit Natureで扱う問題や演算子は、量子アルゴリズムで解く前に (通常は) 量子ビット空間にマッピングされる必要があります。このタスクは ``QubitConverter`` や ``QubitMapper`` クラスによって処理されます。

source: In this tutorial, you will learn about the various options available to you.
es_un: En este tutorial, aprenderás acerca de las diversas opciones disponibles para ti.
ja: このチュートリアルでは、利用可能なさまざまなオプションについて学びます。

source: Fermionic Mappers
es_un: Mapeadores Fermiónicos
ja: フェルミオン・マッパー

source: This section deals with fermionic mappers, which transform fermionic operators into the qubit space. This is mostly used by the `electronic structure stack <01_electronic_structure.ipynb>`__ but also finds application for the ```FermiHubbardModel`` <TODO>`__.
es_un: Esta sección trata sobre mapeadores fermiónicos, que transforman operadores fermiónicos en el espacio de qubits. Esto es utilizado principalmente por la `pila de estructura electrónica <01_electronic_structure.ipynb>`__, pero también encuentra aplicación para el ```FermiHubbardModel`` <TODO>`__.
ja: このセクションでは、フェルミオン演算子を量子ビット空間に変換する、フェルミオン・マッパーを扱います。これは主に電子構造スタック <01_electronic_structure.ipynb>`__ で使用されますが、``FermiHubbardModel`` <TODO>`__ にも応用されています。

source: There exist different mapping types with different properties. Qiskit Nature already supports the following fermionic mappings:
es_un: Existen diferentes tipos de mapeo con diferentes propiedades. Qiskit Nature ya admite los siguientes mapeos fermiónicos:
ja: 異なる特性を持つマッピングタイプが存在します。Qiskit Natureはすでに以下のフェルミオン・マッピングをサポートしています：

source: We will discuss some of these in the following sections. You should learn all the information necessary, to comfortable work with any of the available mappers.
es_un: Discutiremos algunos de estos en las siguientes secciones. Debes aprender toda la información necesaria para trabajar cómodamente con cualquiera de los mapeadores disponibles.
ja: 以下のセクションで、これらのいくつかを説明します。どのマッパーでも快適に使えるように、必要な情報はすべて学んでください。

source: In order to discuss the various mappings, we will be using the electronic structure Hamiltonian of the H2 molecule. For more information on how to obtain this, please refer to the `electronic structure tutorial <01_electronic_structure.ipynb>`__.
es_un: Para discutir los diversos mapeos, usaremos el Hamiltoniano de la estructura electrónica de la molécula H2. Para obtener más información sobre cómo obtener esto, consulta el `tutorial de estructura electrónica <01_electronic_structure.ipynb>`__.
ja: 様々なマッピングを議論するために、H2分子の電子構造ハミルトニアンを使用します。入手方法の詳細は、`電子構造チュートリアル<01_electronic_structure.ipynb>`__を参照してください。

source: The Jordan-Wigner Mapping
es_un: El Mapeo de Jordan-Wigner
ja: Jordan-Wigner マッピング

source: The Jordan-Wigner mapping is the most straight-forward mapping with the simplest physical interpretation, because it maps the occupation of one spin-orbital to the occupation of one qubit.
es_un: El mapeo de Jordan-Wigner es el mapeo más directo con la interpretación física más simple, porque mapea la ocupación de un orbital de espín a la ocupación de un qubit.
ja: Jordan-Wignerマッピングは、1つのスピン軌道の占有を1つの量子ビットの占有にマッピングするため、最も単純なマッピングであり、物理的解釈も最もシンプルです。

source: You can construct use it like so:
es_un: Puedes construirlo así:
ja: 以下のように構築できます。

source: In order to use this mapper with the rest of our stack, you need to wrap it inside of a ``QubitConverter``. The reason for this will become apparent in a later section. For now, we simply show you how this is done:
es_un: Para usar este mapeador con el resto de nuestra pila, debes encapsularlo dentro de un ``QubitConverter``. La razón de esto se hará evidente en una sección posterior. Por ahora, simplemente te mostramos cómo se hace esto:
ja: このマッパーを他のスタックと一緒に使うには、 ``QubitConverter`` の中でラップする必要があります。この理由は後のセクションで明らかにします。今のところ、この方法を簡単に説明します。

source: The Parity Mapping
es_un: El Mapeo de Paridad
ja: パリティ・マッピング

source: The Parity mapping is the dual mapping to the Jordan-Wigner one, in the sense that it encodes the parity information locally on one qubit, whereas the occupation information is delocalized over all qubits.
es_un: El mapeo de Paridad (parity) es el mapeo dual del de Jordan-Wigner, en el sentido de que codifica la información de paridad localmente en un qubit, mientras que la información de ocupación se deslocaliza en todos los qubits.
ja: パリティ・マッピングはJordan-Wignerマッピングの二重写像で、パリティ情報を1つの量子ビットに局所的に符号化するのに対し、占有情報はすべての量子ビットに非局在化されるという意味です。

source: This has one major benefit for the case of problems in which we want to preserve the number of particles of each spin species; it allows us to remove 2 qubits, because the information in them becomes redundant. Since Qiskit Nature arranges the qubits in block-order, such that the first half encodes the alpha-spin, and the second half the beta-spin information, this means we can remove the N/2-th and N-th qubit.
es_un: Esto tiene un gran beneficio para el caso de problemas en los que queremos preservar el número de partículas de cada especie de espín; nos permite eliminar 2 qubits, porque la información en ellos se vuelve redundante. Dado que Qiskit Nature organiza los qubits en orden de bloque, de modo que la primera mitad codifica el espín alfa y la segunda mitad la información del espín beta, esto significa que podemos eliminar el N/2-ésimo y N-ésimo qubit.
ja: これは、各スピン種の粒子の数を保持したい問題の場合、1つの大きな利点があり、2つの量子ビットの情報が冗長になるため、それらを削除することができます。Qiskit Natureは、前半がアルファスピン、後半がベータスピンの情報をエンコードするように、ブロックオーダーで量子ビットを配置するので、N/2番目とN番目の量子ビットを削除することができることを意味します。

source: To do this, you need to use the ``QubitConverter`` like so:
es_un: Para hacer esto, necesitas usar el ``QubitConverter`` así:
ja: そのためには、 ``QubitConverter`` を以下のように使用する必要があります：

source: In order for the reduction to work, you now also need to supply the number of particles:
es_un: Para que la reducción funcione, ahora también debes proporcionar la cantidad de partículas:
ja: 削減するには、粒子の数を指定する必要があります。

source: More advanced qubit reductions
es_un: Reducciones de qubits más avanzadas
ja: より高度な量子ビット数の削減

source: The ``QubitConverter`` also enables you to perform more advanced qubit reductions, which are based on finding Z2 symmetries in the Hilbert space of the qubit. A requirement for this to be useful, is that you know in which symmetry-subspace you need to look for your actual solution of interest. This can be a bit tricky, but luckily the problem classes of Qiskit Nature provide you with a utility to automatically determine that correct subspace.
es_un: El ``QubitConverter`` también te permite realizar reducciones de qubits más avanzadas, que se basan en encontrar simetrías Z2 en el espacio de Hilbert del qubit. Un requisito para que esto sea útil es que sepas en qué subespacio de simetría necesitas buscar tu solución real de interés. Esto puede ser un poco complicado, pero afortunadamente las clases de problemas de Qiskit Nature te brindan una utilidad para determinar automáticamente ese subespacio correcto.
ja: ``QubitConverter`` では、量子ビットのHilbert空間におけるZ2対称性を見つけることに基づいて、より高度な量子ビット削減を実行することもできます。この機能を利用するためには、どのような対称性-部分空間から実際の解を探す必要があるかが分かっている必要があります。これは少し厄介なことですが、幸運なことにQiskit Natureの問題クラスは、自動的に正しい部分空間を決定するユーティリティーを提供してくれます。

source: Here is how you can use this to your advantage:
es_un: Así es como puedes usar esto a tu favor:
ja: これをどう活用するか、ご紹介します：

source: As you can see here, the H2 molecule is such a simple system that we can simulate it entirely on a single qubit!
es_un: ¡Como puedes ver aquí, la molécula H2 es un sistema tan simple que podemos simularla completamente en un solo qubit!
ja: このように、H2分子は非常にシンプルなシステムなので、1つの量子ビットで完全にシミュレーションできるのです!

source: The ``QubitConverter``
es_un: El ``QubitConverter``
ja: ``QubitConverter``

source: We would like to end this tutorial with a few more notes on the ``QubitConverter``.
es_un: Nos gustaría terminar este tutorial con algunas notas más sobre ``QubitConverter``.
ja: 最後に ``QubitConverter`` についてのメモを残して、このチュートリアルを終了したいと思います。

source: There are multiple reasons for its existence: - it handles the qubit reduction techniques which are applied on the qubit space *after* the mapping process - it **stores** the symmetry information which you find during the conversion of your *Hamiltonian* such that you can recall and use the same symmetry reductions when mapping additional observables later on
es_un: Hay varias razones para su existencia: - maneja las técnicas de reducción de qubits que se aplican en el espacio de qubit *después* del proceso de mapeo - **almacena** la información de simetría que encuentra durante la conversión de tu *Hamiltoniano* tal que puedas recordar y usar las mismas reducciones de simetría al mapear observables adicionales más adelante
ja: その存在には複数の理由があります。- マッピングプロセスの *後* に量子ビット空間に適用される量子ビット削減技術を処理します - *ハミルトニアン* などの変換時に得られた対称性の情報を **保存** し、後で追加の観測量をマッピングする際に同じ対称性の削減を使用することができます。

source: This last point is especially important, since you would otherwise obtain qubit operators of different sizes, which will be incompatible when trying to evaluate them at your solution state.
es_un: Este último punto es especialmente importante, ya que de lo contrario obtendrías operadores de qubit de diferentes tamaños, que serán incompatibles al intentar evaluarlos en tu estado de solución.
ja: この最後のポイントは特に重要です。そうしないと、異なるサイズの量子ビット演算子を得ることになり、解の状態でそれらを評価しようとしたときに互換性がなくなってしまうからです。

source: **Note:** the ``symmetry_sector_locator`` is only available with the ``ElectronicStructureProblem``.
es_un: **Nota:** el ``symmetry_sector_locator`` solo está disponible con el ``ElectronicStructureProblem``.
ja: **注記:** ``symmetry_sector_locator`` は ``ElectronicStructureProblem`` でしか利用できません。

source: For more information we suggest that you read the documentation of the ``QubitConverter`` `here <https://qiskit.org/documentation/nature/stubs/qiskit_nature.second_q.mappers.QubitConverter.html>`__.
es_un: Para más información te sugerimos que leas la documentación del ``QubitConverter`` `aquí <https://qiskit.org/documentation/nature/stubs/qiskit_nature.second_q.mappers.QubitConverter.html>`__.
ja: 詳しくは `こちら <https://qiskit.org/documentation/nature/stubs/qiskit_nature.second_q.mappers.QubitConverter.html>`__ の ``QubitConverter`` のドキュメントをご覧ください。.
