Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/07_leveraging_qiskit_runtime.po
Languages: bn_bn, es_un, id_id, ja, ko, pt_un, ta_in

source: First, we'll have to load a provider to access Qiskit Runtime. **Note:** You have to replace the next cell with your provider.
ja: まず、Qiskit Runtimeにアクセスするためのプロバイダーをロードする必要があります。 **注** ：次のセルをあなたのプロバイダーに置き換える必要があります。

source: Now we can set up the ``VQEClient``. In this first release, the optimizer must be provided as a dictionary, in future releases you'll be able to pass the same optimizer object as in the traditional VQE.
ja: これで、 ``VQEClient`` を設定できます。この最初のリリースでは、オプティマイザーを辞書として提供する必要があります。将来のリリースでは、従来のVQEと同じオプティマイザーオブジェクトを渡すことができるようになります。

source: Let’s exchange the eigensolver from a local VQE algorithm to a VQE executed using Qiskit Runtime – simply by exchanging the ``VQE`` class by the ``VQEProgram``.
id_id: Mari kita tukar pemecah eigen dari algoritme VQE lokal dengan VQE yang dieksekusi menggunakan Qiskit Runtime – hanya dengan menukar kelas ``VQE`` ke ``VQEProgram``.
ta_in: ஒரு லோக்கல் VQE அல்காரிதத்தில் இருந்து ஒரு VQE க்கு Qiskit Runtime- ஐ பயன்படுத்தி செயல்படுத்தப்படும் Eigensolver ஐ மாற்றுவோம் - ``VQEProgram`` மூலம் ``VQE`` வகுப்பை பரிமாறிக்கொள்வதன் மூலம்.

source: Now we can set up the ``VQEProgram``. In this first release, the optimizer must be provided as a dictionary, in future releases you’ll be able to pass the same optimizer object as in the traditional VQE.
ta_in: இப்போது நாம் ``VQEProgram`` ஐ அமைக்கலாம். இந்த முதல் வெளியீட்டில், ஆப்டிமைசர் ஒரு அகராதியாக வழங்கப்பட வேண்டும், எதிர்கால வெளியீடுகளில் நீங்கள் பாரம்பரிய VQE இல் உள்ள அதே ஆப்டிமைசர் பொருளை அனுப்ப முடியும்.

source: If we are interested in the development of the energy, the ``VQEProgram`` allows access to the history of the optimizer, which contains the loss per iteration (along with the parameters and a timestamp). We can access this data via the ``raw_result`` attribute of the ground state solver.
id_id: Jika kita tertarik pada perkembangan energinya, ``VQEProgram`` memungkinkan akses ke riwayat pengoptimasi, yang berisi loss setiap iterasi (bersama dengan parameter dan waktunya). Kita dapat mengakses data ini melalui atribut ``raw_result`` dari pemecah keadaan dasar.
ta_in: ஆற்றலின் வளர்ச்சியில் நாம் ஆர்வமாக இருந்தால், ``VQEProgram`` ஆப்டிமைசரின் வரலாற்றை அணுக அனுமதிக்கிறது, இதில் மறு செய்கை இழப்பு (அளவுருக்கள் மற்றும் நேர முத்திரையுடன்) உள்ளது. தரை நிலை கரைப்பானின் ``raw_result`` பண்பு வழியாக இந்தத் தரவை நாம் அணுகலாம்.

source: VQE
bn_bn: ভি কিউ ই
