Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/07_leveraging_qiskit_runtime.po
Languages: bn_bn, es_un, id_id, ja, ko, pt_un, ta_in

source: This page was generated from `docs/tutorials/07_leveraging_qiskit_runtime.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/07_leveraging_qiskit_runtime.ipynb`__ থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `docs/tutorials/07_leveraging_qiskit_runtime.ipynb`__.
ja: このページは `docs/tutorials/07_leveraging_qiskit_runtime.ipynb`__ から生成されました。
ko: 이 페이지는 `docs/tutorials/07_leveraging_qiskit_runtime.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/07_leveraging_qiskit_runtime.ipynb`__.
ta_in: இந்தப் பக்கம் `docs/tutorials/07_leveraging_qiskit_runtime.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Leveraging Qiskit Runtime
bn_bn: Qiskit রানটাইম লিভারেজিং
es_un: Aprovechando Qiskit Runtime
id_id: Memanfaatkan Runtime Qiskit
ja: Qiskit Runtimeの活用
ko: Qiskit 런타임 활용
pt_un: Aproveitando o Qiskit Runtime
ta_in: Qiskit இயக்க நேரத்தை மேம்படுத்துதல்

source: Iterative algorithms, such as the Variational Quantum Eigensolver (VQE), traditionally send one batch of circuits (one “job”) to be executed on the quantum device in each iteration. Sending a job involves certain overhead, mainly
bn_bn: পুনরাবৃত্তিমূলক অ্যালগরিদম, যেমন ভেরিয়েশনাল কোয়ান্টাম আইজেনসলভার (VQE), গতানুগতিকভাবে প্রতিটি পুনরাবৃত্তিতে কোয়ান্টাম ডিভাইসে সঞ্চালনের জন্য একটি ব্যাচ সার্কিট (একটি "কাজ") পাঠায়। একটি চাকরি পাঠানো কিছু নির্দিষ্ট ওভারহেড জড়িত, প্রধানত
es_un: Los algoritmos iterativos, como el Solucionador Propio Variacional Cuántico (Variational Quantum Eigensolver, VQE), tradicionalmente envían un lote de circuitos (un “trabajo” o “job”) para ser ejecutados en el dispositivo cuántico en cada iteración. Mandar un trabajo implica una cierta sobrecarga, principalmente
id_id: Algoritme iteratif, seperti "Variational Quantum Eigensolver" (VQE), secara tradisional mengirimkan satu kumpulan sirkuit (satu "pekerjaan") untuk dieksekusi pada perangkat kuantum pada setiap iterasi. Mengirim sebuah pekerjaan melibatkan ongkos tertentu, terutama
ko: Variative Quantum Eigensolver (VQE) 와 같은 반복 알고리즘은 전통적으로 각 반복에서 양자 장치에서 실행할 한개의 회로 배치("작업" 하나) 를 전송한다. 작업 전송에는 특정 overhead가 수반된다. 주로 이것은
pt_un: Algoritmos iterativos, como o Variational Quantum Eigensolver (VQE), tradicionalmente enviam um lote de circuitos (uma "tarefa") para ser executado no dispositivo quântico em cada iteração. O envio de uma tarefa envolve certa sobrecarga, principalmente
ta_in: வேரியேஷனல் குவாண்டம் ஈஜென்சால்வர் (VQE) போன்ற வழக்கமான வழிமுறைகள், ஒவ்வொரு மறு செய்கையிலும் குவாண்டம் சாதனத்தில் செயல்படுத்தப்படும் ஒரு தொகுதி சுற்றுகளை (ஒரு "வேலை") பாரம்பரியமாக அனுப்புகின்றன. ஒரு வேலையை அனுப்புவது முக்கியமாக சில மேல்நிலைகளை உள்ளடக்கியது

source: the time to process the requests and send the data (API overhead, usually about 10s)
bn_bn: অনুরোধগুলি প্রক্রিয়া করার এবং ডেটা পাঠানোর সময় (API ওভারহেড, সাধারণত প্রায় 10s)
es_un: el tiempo para procesar las solicitudes y enviar los datos (sobrecarga de API, generalmente alrededor de 10s)
id_id: waktu untuk memproses permintaan dan mengirim data (ongkos API, biasanya sekitar 10 detik)
ja: リクエストを処理してデータを送信する時間。（APIのオーバーヘッド、通常は約10秒)
ko: 요청을 처리하고 데이터를 전송하는 시간 (API overhead, 일반적으로 약 10초)
pt_un: o tempo para processar as requisições e enviar os dados (sobrecarga da API, geralmente cerca de 10s)
ta_in: கோரிக்கைகளை செயலாக்க மற்றும் தரவை அனுப்ப நேரம் (API மேல்நிலை, பொதுவாக சுமார் 10 கள்)

source: the job queue time, that is how long you have to wait before it’s your turn to run on the device (usually about 2min)
bn_bn: কাজের সারির সময়, এইভাবে আপনার ডিভাইসে চালানোর পালা হওয়ার আগে আপনাকে কতক্ষণ অপেক্ষা করতে হবে (সাধারণত প্রায় 2 মিনিট)
es_un: el tiempo de espera del trabajo, es decir, cuánto tienes que esperar antes que sea tu turno de ejecutar en el dispositivo (por lo general unos 2min)
id_id: waktu antrian pekerjaan, yaitu berapa lama Anda perlu menunggu sebelum giliran Anda untuk menjalankan pekerjaan pada perangkat (biasanya sekitar 2 menit)
ko: 장치에서 실행할 차례가 되기 전에 기다려야 하는 작업 대기열 시간 (일반적으로 약 2분) 이다.
pt_un: o tempo de fila de tarefa, ou seja, quanto tempo você terá de esperar antes que seja sua vez de executar no dispositivo (geralmente cerca de 2min)
ta_in: வேலை வரிசை நேரம், சாதனத்தில் இயங்குவதற்கான உங்கள் முறை வரும் வரை நீங்கள் எவ்வளவு நேரம் காத்திருக்க வேண்டும் (வழக்கமாக சுமார் 2 நிமிடங்கள்)

source: If we send hundreds of jobs iteratively, this overhead quickly dominates the execution time of our algorithm. Qiskit Runtime allows us to tackle these issues and significantly speed up (especially) iterative algorithms. With Qiskit Runtime, one job does not contain only a batch of circuits but the *entire* algorithm. That means we only experience the API overhead and queue wait *once* instead of in every iteration! You’ll be able to either upload algorithm parameters and delegate all the complexity to the cloud, where your program is executed, or upload your personal algorithm directly.
bn_bn: যদি আমরা শত শত কাজ পুনরাবৃত্তিমূলকভাবে পাঠাই, তাহলে এই ওভারহেড দ্রুত আমাদের অ্যালগরিদমের এক্সিকিউশন টাইমে আধিপত্য বিস্তার করে। কিস্কিট রানটাইম আমাদের এই সমস্যাগুলি মোকাবেলা করতে এবং উল্লেখযোগ্যভাবে (বিশেষ করে) পুনরাবৃত্তিমূলক অ্যালগরিদমগুলিকে গতিশীল করতে দেয়। কিস্কিট রানটাইমের সাথে, একটি কাজে কেবল সার্কিটের একটি ব্যাচ থাকে না তবে *সম্পূর্ণ* অ্যালগরিদম থাকে। এর মানে হল যে আমরা কেবলমাত্র প্রতিটি পুনরাবৃত্তির পরিবর্তে API ওভারহেড এবং সারি অপেক্ষা *একবার* অনুভব করি! আপনি হয় অ্যালগরিদম প্যারামিটার আপলোড করতে পারবেন এবং ক্লাউডে সমস্ত জটিলতা অর্পণ করতে পারবেন, যেখানে আপনার প্রোগ্রামটি সম্পাদিত হবে অথবা সরাসরি আপনার ব্যক্তিগত অ্যালগরিদম আপলোড করতে পারবেন।
es_un: Si enviamos cientos de trabajos iterativamente, esta sobrecarga rápidamente domina el tiempo de ejecución de nuestro algoritmo. Qiskit Runtime nos permite abordar estos problemas y significativamente acelerar (especialmente) algoritmos iterativos. Con Qiskit Runtime, un trabajo no contiene solo un lote de circuitos, sino el algoritmo *entero*. ¡Esto significa que solamente experimentamos la sobrecarga de la API y el tiempo de espera *una vez* en lugar de en cada iteración! Podrás cargar parámetros para el algoritmo y delegar toda la complejidad a la nube, donde tu programa es ejecutado, o directamente cargar tu propio algoritmo.
id_id: Jika kita mengirimkan ratusan pekerjaan secara iteratif, ongkos ini akan mendominasi waktu eksekusi dari algoritme kita. Qiskit Runtime memungkinkan kita untuk mengatasi isu ini dan mempercepat secara signifikan (khususnya) algoritme iteratif. Dengan Qiskit Runtime, satu pekerjaan tidak hanya berisi satu kumpulan sirkuit, tetapi *seluruh* algoritme. Ini artinya kita hanya mengalami ongkos API dan antrian *sekali* alih-alih setiap iterasi! Anda dapat menunggah parameter algoritme dan menyerahkan semua kompleksitasnya ke cloud di mana program diesksekusi, atau Anda dapat mengunggah langsung algoritme sendiri.
ko: 수백 개의 작업을 반복적으로 전송하면 이러한 overhead가 알고리즘의 실행 시간을 빠르게 좌우한다. Qiskit Runtime을 사용하면 이러한 문제를 해결하고 반복적 알고리즘의 속도를 크게 높일 수 있다. 즉, API overhead와 대기열 대기는 매번 발생하는 것이 아니라 *한 번* 만 발생한다! 알고리즘 매개 변수를 업로드하고 프로그램이 실행되는 클라우드에 모든 복잡성을 위임하거나 개인 알고리즘을 직접 업로드할 수 있다.
pt_un: Se enviarmos centenas de tarefas iterativamente, essa sobrecarga rapidamente dominará o tempo de execução do nosso algoritmo. O Qiskit Runtime nos permite lidar com esses problemas e acelerar significativamente (em especial) os algoritmos iterativos. Com o Qiskit Runtime, uma tarefa não contém apenas um lote de circuitos mas o algoritmo *por completo*. Isso significa que apenas experimentamos a sobrecarga da API e a espera da fila *uma vez* em vez de a cada iteração! Você será capaz de até mesmo fazer upload dos parâmetros do algoritmo e delegar toda a complexidade para a nuvem, onde o seu programa é executado, ou fazer upload do seu algoritmo pessoal diretamente.
ta_in: நாங்கள் நூற்றுக்கணக்கான வேலைகளை மீண்டும் மீண்டும் அனுப்பினால், இந்த மேல்நிலை எங்கள் வழிமுறையின் செயல்பாட்டு நேரத்தை விரைவாக ஆதிக்கம் செலுத்துகிறது. Qiskit இயக்க நேரம் இந்த சிக்கல்களைச் சமாளிக்கவும், (குறிப்பாக) மறு செயல்பாட்டு வழிமுறைகளை கணிசமாக வேகப்படுத்தவும் அனுமதிக்கிறது. Qiskit இயக்க நேரத்துடன், ஒரு வேலையில் ஒரு தொகுதி சுற்றுகள் மட்டும் இல்லை ஆனால் *முழு* வழிமுறையும் உள்ளது. அதாவது ஒவ்வொரு மறு செய்கையிலும் *ஒரு முறை* API மேல்நிலை மற்றும் வரிசை காத்திருப்பை மட்டுமே நாங்கள் அனுபவிக்கிறோம்! நீங்கள் அல்காரிதம் அளவுருக்களை பதிவேற்றலாம் மற்றும் உங்கள் நிரல் செயல்படுத்தப்படும் மேகக்கணிக்கு அனைத்து சிக்கல்களையும் வழங்கலாம் அல்லது உங்கள் தனிப்பட்ட வழிமுறையை நேரடியாக பதிவேற்றலாம்.

source: For the VQE, the integration of Qiskit Runtime in your existing code is a piece of cake. There is a (almost) drop-in replacement, called ``VQEProgram`` for the ``VQE`` class.
bn_bn: VQE এর জন্য, আপনার বিদ্যমান কোডে কিস্কিট রানটাইমের সংহতকরণ হল কেকের একটি টুকরা। ``VQE`` ক্লাসের জন্য ``VQEProgram`` নামে একটি (প্রায়) ড্রপ-ইন রিপ্লেসমেন্ট আছে।
es_un: Para el VQE, la integración de Qiskit Runtime en tu código existente es pan comido. Hay un (casi) reemplazo directo, llamado ``VQEProgram`` para la clase ``VQE``.
id_id: Untuk VQE, integrasi Qiskit Runtime ke kode yang Anda miliki sangat mudah. (Hampir) terdapat pengganti drop-in, yang disebut ``VQEProgram`` untuk kelas ``VQE``.
pt_un: Para o VQE, a integração do Qiskit Runtime no seu código existente é moleza. Existe uma (quase) substituição de drop-in, chamada `VQEProgram`` para a classe ``VQE``.
ta_in: VQE க்கு, உங்கள் தற்போதைய குறியீட்டில் Qiskit இயக்க நேரத்தின் ஒருங்கிணைப்பு ஒரு துண்டு கேக் ஆகும். ``VQE`` வகுப்பிற்கு ``VQEProgram`` எனப்படும் (கிட்டத்தட்ட) டிராப்-இன் மாற்று உள்ளது.

source: Let’s see how you can leverage the runtime on a simple chemistry example: Finding the ground state energy of the lithium hydrate (LiH) molecule at a given bond distance.
bn_bn: আসুন দেখি কিভাবে আপনি একটি সহজ রসায়নের উদাহরণে রানটাইম ব্যবহার করতে পারেন: একটি নির্দিষ্ট বন্ধন দূরত্বে লিথিয়াম হাইড্রেট (LiH) অণুর গ্রাউন্ড স্টেট এনার্জি খুঁজে বের করা।
es_un: Veamos como puedes aprovechar el runtime en un ejemplo simple de química: Encontrar la energía del estado fundamental de la molécula de hidrato de litio (LiH) a una distancia de enlace dada.
id_id: Mari kita lihat bagaiman Anda dapat memanfaatkan waktu keberjalanan dalam contoh kimia sederhana: Mencari energi keadaan dasar dari molekul litium hidrida (LiH) pada jarak ikatan tertentu.
ko: 이제 간단한 화학 예에서 런타임을 활용하는 방법을 살펴보겠다. 주어진 결합 길이에서 리튬 하이드레이트(LiH) 분자의 기저 상태 에너지 찾기
pt_un: Vejamos como aproveitar o ambiente de execução em um exemplo de química simples: Encontrar a energia de estado fundamental da molécula de hidreto de lítio (LiH) a uma determinada distância de ligação.
ta_in: ஒரு எளிய வேதியியல் உதாரணத்தில் நீங்கள் இயக்க நேரத்தை எவ்வாறு மேம்படுத்துவது என்று பார்ப்போம்: கொடுக்கப்பட்ட பிணைப்பு தூரத்தில் லித்தியம் ஹைட்ரேட் (LiH) மூலக்கூறின் தரை நிலை ஆற்றலைக் கண்டறிதல்.

source: *Important: Version requirements*
es_un: *Importante: Requerimientos de la versión*
ko: *중요: 버전 요구사항*
pt_un: *Importante: Requisitos de versão*

source: *This notebook requires a minimum version number of Qiskit Terra 0.18.0 and Qiskit Nature 0.3.0.*
es_un: *Este cuaderno requiere un número de versión mínimo de Qiskit Terra 0.18.0 y Qiskit Nature 0.3.0.*
pt_un: *Este notebook requer um número de versão mínimo de Qiskit Terra 0.18.0 e Qiskit Nature 0.3.0.*

source: Problem specification: LiH molecule
bn_bn: সমস্যা স্পেসিফিকেশন: LiH অণু
es_un: Especificación del problema: molécula de LiH
id_id: Spesifikasi masalah: molekul LiH
ja: 問題の指定：LiH分子
ko: 문제 사양: LiH 분자
pt_un: Especificação do problema: molécula de LiH
ta_in: சிக்கல் விவரக்குறிப்பு: LiH மூலக்கூறு

source: First, we specify the molecule whose ground state energy we seek. Here, we look at LiH with a bond distance of 2.5 Å.
bn_bn: প্রথমত, আমরা অণু নির্দিষ্ট করি যার গ্রাউন্ড স্টেট এনার্জি আমরা চাই। এখানে, আমরা 2.5Å বন্ড দূরত্বের LiH এর দিকে তাকাই।
es_un: En primer lugar, especificamos la molécula de la cual buscamos su energía del estado fundamental. Aquí, trabajamos con LiH con una distancia de enlace de 2.5 Å.
id_id: Pertama, kita tentukan molekul yang energi keadaan dasarnya ingin kita cari. Di sini, kita melihat LiH dengan panjang ikatan 2.5 Å.
ja: まず、基底状態エネルギーを求める分子を指定します。ここでは、結合距離が2.5ÅのLiHを見てみましょう。
ko: 우선, 우리가 찾는 기저 상태 에너지를 가진 분자를 명시한다. 여기서는 2.5 Å 의 결합 거리를 갖는 LiH를 살펴본다.
pt_un: Primeiro, especificamos a molécula cuja energia de estado fundamental buscamos. Aqui, olhamos para a LiH com uma distância de ligação de 2,5 Å.
ta_in: முதலில், மூலக்கூறின் நிலத்தடி ஆற்றலை நாம் தேடுகிறோம். இங்கே, நாங்கள் 2.5 Å பிணைப்பு தூரத்துடன் LiH ஐப் பார்க்கிறோம்.

source: Classical reference solution
bn_bn: প্রথাগত (ক্লাসিক্যাল) রেফারেন্স সমাধান
es_un: Solución clásica de referencia
id_id: Solusi referensi klasik
ja: 古典的な参考解
ko: 고전적 참조 솔루션
pt_un: Solução de referência clássica
ta_in: கிளாசிக்கல் குறிப்பு தீர்வு

source: As a reference solution we can solve this system classically with the ``NumPyEigensolver``.
bn_bn: একটি রেফারেন্স সমাধান হিসাবে আমরা ``NumPyEigensolver`` দিয়ে ক্লাসিকভাবে এই সিস্টেমটি সমাধান করতে পারি।
es_un: Como solución de referencia podemos resolver este sistema clásicamente con el ``NumPyEigensolver``.
id_id: Sebagai solusi referensi, kita dapat memecahkan sistem ini secara klasik dengan ``NumPyEigensolver``.
ja: 参考解として、この問題を ``NumPyEigensolver`` で古典的に解くことができます。
ko: 참조 솔루션으로서 우리는 ``NumPyEigensolver`` 를 통해 이 시스템을 고전적으로 해결할 수 있다.
pt_un: Como uma solução de referência, podemos resolver este sistema classicamente com o ``NumPyEigensolver``.
ta_in: குறிப்பு தீர்வாக நாம் இந்த அமைப்பை ``NumPyEigensolver`` மூலம் கிளாசிக்கல் முறையில் தீர்க்க முடியும்.

source: To run the VQE we need to select a parameterized quantum circuit acting as ansatz and a classical optimizer. Here we’ll choose a heuristic, hardware efficient ansatz and the SPSA optimizer.
bn_bn: ভিকিউই চালানোর জন্য আমাদের একটি প্যারামিটারাইজড কোয়ান্টাম সার্কিট নির্বাচন করতে হবে যা আনস্যাটজ এবং একটি ক্লাসিক্যাল অপটিমাইজার হিসাবে কাজ করে। এখানে আমরা একটি হিউরিস্টিক, হার্ডওয়্যার দক্ষ Ansatz এবং SPSA অপটিমাইজার বেছে নেব।
es_un: Para ejecutar el VQE tenemos que seleccionar un circuito cuántico parametrizado que actúe como ansatz y un optimizador clásico. Aquí escogeremos un ansatz heurístico, eficiente en hardware y el optimizador SPSA.
id_id: Untuk menjalankan VQE, kita perlu memilih sirkuit kuantum terparameterisasi yang bertindak sebagai ansatz dan sebuah pengoptimasi klasik. Di sini kita memilih ansatz yang heuristis dan yang efisien pada perangkat keras, serta memilih pengoptimasi SPSA.
ko: VQE를 실행하려면 ansatz 역할을 하는 매개 변수화된 양자 회로와 고전적 최적화 프로그램을 선택해야 한다. 여기서는 체험적이고 하드웨어 효율적인 ansatz와 SPSA 최적화 프로그램을 선택한다.
pt_un: Para executar o VQE, precisamos selecionar um circuito quântico parametrizado que atue como ansatz e um otimizador clássico. Aqui escolheremos um ansatz heurístico, eficiente em hardware e o otimizador SPSA.
ta_in: VQE ஐ இயக்க நாம் அன்சட்ஸ் மற்றும் கிளாசிக்கல் ஆப்டிமைசராக செயல்படும் ஒரு அளவுரு குவாண்டம் சர்க்யூட்டை தேர்ந்தெடுக்க வேண்டும். இங்கே நாம் ஒரு ஹியூரிஸ்டிக், வன்பொருள் திறமையான அன்சட்ஸ் மற்றும் SPSA ஆப்டிமைசரை தேர்ந்தெடுப்போம்.

source: Before executing the VQE in the cloud using Qiskit Runtime, let’s execute a local VQE first.
bn_bn: কিস্কিট রানটাইম ব্যবহার করে ক্লাউডে VQE চালানোর আগে, প্রথমে একটি স্থানীয় VQE চালানো যাক।
es_un: Antes de ejecutar el VQE en la nube usando Qiskit Runtime, ejecutemos primero un VQE local.
id_id: Sebelum menjalankan VQE di cloud menggunakan Qiskit Runtime, mari kita eksekusi terlebih dahulu VQE di lokal.
ko: Qiskit 런타임을 사용하여 클라우드에서 VQE를 실행하기 전에 먼저 로컬 VQE를 실행하겠다.
pt_un: Antes de executar o VQE na nuvem usando o Qiskit Runtime, vamos executar primeiro um VQE local.
ta_in: Qiskit இயக்க நேரத்தைப் பயன்படுத்தி கிளவுட்டில் VQE ஐ செயல்படுத்துவதற்கு முன், முதலில் ஒரு லோக்கல் VQE ஐ இயக்கலாம்.

source: Runtime VQE
bn_bn: রানটাইম VQE
es_un: VQE de Runtime
id_id: Waktu keberjalanan VQE
ko: 런타임 VQE
ta_in: இயக்க நேரம் VQE

source: Let’s exchange the eigensolver from a local VQE algorithm to a VQE executed using Qiskit Runtime – simply by exchanging the ``VQE`` class by the ``qiskit_nature.runtime.VQEClient``.
es_un: Cambiemos el solucionador propio de un algoritmo VQE local a un VQE ejecutado usando Qiskit Runtime, simplemente intercambiando la clase ``VQE`` por el ``qiskit_nature.runtime.VQEClient``.
ko: 간단히 ``VQE`` 클래스를 ``qiskit_nature.runtime.VQEClient`` 로 바꿈으로써 로컬 VQE 알고리즘을 Qiskit Runtime을 이용해 실행되는 eigensolver로 바꾸자.
pt_un: Vamos trocar o eigensolver de um algoritmo VQE local para um VQE executado usando o Qiskit Runtime – simplesmente ao trocar a classe ``VQE`` pelo ``qiskit_nature.runtime.VQEClient``.

source: First, we’ll have to load a provider to access Qiskit Runtime. **Note:** You have to replace the next cell with your provider.
bn_bn: প্রথমে, কিস্কিট রানটাইম অ্যাক্সেস করতে আমাদের একটি প্রদানকারী লোড করতে হবে। **দ্রষ্টব্য:** আপনাকে পরবর্তী সেলকে আপনার প্রদানকারীর সাথে প্রতিস্থাপন করতে হবে।
es_un: Primero, tendremos que cargar un proveedor para acceder a Qiskit Runtime. **Nota:** Tienes que reemplazar la siguiente celda con tu proveedor.
id_id: Pertama, kita perlu memuat penyedia untuk mengakses Qiskit Runtime. **Note:** Anda perlu mengganti sel berikutnya dengan penyedia Anda.
ko: 먼저 Qiskit 런타임에 접근할 공급자를 로드해야 한다. **참고:** 다음 셀을 공급자로 교체해야 한다.
pt_un: Primeiro, teremos que carregar um provedor para acessar o Qiskit Runtime.**Nota:** Você deve substituir a próxima célula pelo seu provedor.
ta_in: முதலில், Qiskit இயக்க நேரத்தை அணுக ஒரு வழங்குநரை ஏற்ற வேண்டும். **குறிப்பு**: அடுத்த கலத்தை உங்கள் வழங்குநரிடம் மாற்ற வேண்டும்.

source: Now we can set up the ``VQEClient``. In this first release, the optimizer must be provided as a dictionary, in future releases you’ll be able to pass the same optimizer object as in the traditional VQE.
es_un: Ahora podemos configurar el ``VQEClient``. En esta primera versión, el optimizador debe proporcionarse como un diccionario; en versiones futuras, podrás pasar el mismo objeto optimizador que en el VQE tradicional.
ko: 이제 우리는 ``VQEClient``를 설정할 수 있다. 이 첫 번째 버전에서는, optimizer가 반드시 딕셔너리로 주어져야 하지만, 추후 버전에서는 기존의 VQE에서와 동일한 optimizer 오브젝트도 사용 가능할 것이다.
pt_un: Agora podemos configurar o ``VQEClient``. Nesta primeira versão, o otimizador deve ser fornecido como um dicionário; em versões futuras, você poderá passar o mesmo objeto otimizador do VQE tradicional.

source: If we are interested in the development of the energy, the ``VQEClient`` allows access to the history of the optimizer, which contains the loss per iteration (along with the parameters and a timestamp). Note that this only holds for the SPSA and QN-SPSA optimizers. Otherwise you have to use a callback to the ``VQEClient``, similar to the normal ``VQE``.
es_un: Si estamos interesados en el desarrollo de la energía, el ``VQEClient`` permite acceder al historial del optimizador, que contiene la pérdida por iteración (junto con los parámetros y una marca de tiempo). Ten en cuenta que esto solo es válido para los optimizadores SPSA y QN-SPSA. De lo contrario, debes usar una devolución de llamada (callback) al ``VQEClient``, similar al ``VQE`` normal.
ja: エネルギーの推移に興味がある場合、 ``VQEClient`` は、反復ごとの損失を含むオプティマイザーの履歴へアクセスすることができます（パラメーターとタイムスタンプとともに）。これは、SPSA および QN-SPSA オプティマイザー にのみ当てはまることに注意してください。 それ以外の場合は、通常の ``VQE`` と同様に、 ``VQEClient`` へのコールバックを使用する必要があります。
ko: 만약 에너지의 반복에 따른 변화에 관심이 있다면, ``VQEClient``는 optimizer의 이력에 대한 접근을 허용하는데, 이는 타임스탬프 및 매개변수들과 함께 매 반복당 손실을 포함한다. 이는 SPSA와 QN-SPSA optimizer에 대해서만 성립함에 유의하자. 다른 경우에는, 기존 ``VQE``와 유사하게 ``VQEClient``에 콜백을 사용해야 한다.
pt_un: Se estivermos interessados no desenvolvimento da energia, o ``VQEClient`` permite acesso ao histórico do otimizador, que contém a perda por iteração (junto com os parâmetros e um timestamp). Observe que isso só é válido para os otimizadores SPSA e QN-SPSA. Caso contrário, você tem que usar um callback para o ``VQEClient``, semelhante ao ``VQE`` normal.

source: We can access this data via the ``raw_result`` attribute of the ground state solver.
es_un: Podemos acceder a estos datos a través del atributo ``raw_result`` del solucionador de estado fundamental.
ja: このデータには、基底状態ソルバーの ``raw_result`` 属性を介してアクセスできます。
ko: 우리는 바닥 상태 해석기(Solver) 의 ``raw_result`` 속성을 통해 이 데이터에 접근할 수 있다.
pt_un: Podemos acessar esses dados por meio do atributo ``raw_result`` do solucionador de estado fundamental.

source: The ``VQEClient`` discussed in this tutorial is **DEPRECATED** as of version 0.6 of Qiskit Nature and will be removed no sooner than 3 months after the release. Instead you should use the new primitives based VQE with the Qiskit IBM Runtime Estimator primitive. For more details on how to migrate check out this guide `here <https://qisk.it/algo_migration#vqe>`__.
ja: このチュートリアルで説明されている ``VQEClient`` は、Qiskit Nature バージョン 0.6 の時点で **非推奨** で、リリースから3ヶ月以内に削除されます。 代わりに、新しいprimitiveベースの VQE を、Qiskit IBM Runtime Estimate primitive とともに使用する必要があります。 移行方法の詳細については、 `こちら<https://qisk.it/algo_migration#vqe>`__ のガイドを参照してください 。

source: Iterative algorithms, such as the Variational Quantum Eigensolver (VQE), traditionally send one batch of circuits (one "job") to be executed on the quantum device in each iteration. Sending a job involves certain overhead, mainly
ja: 変分量子固有値ソルバー（VQE）のような反復アルゴリズムでは，従来，反復ごとに1つの回路バッチ（1つの「ジョブ」）を送信して量子デバイス上で実行していました。ジョブの送信には、以下のようなオーバーヘッドがあります。

source: the job queue time, that is how long you have to wait before it's your turn to run on the device (usually about 2min)
ja: ジョブのキュータイム、つまり、デバイス上で実行する順番が来るまでの待ち時間。（通常は約2分）

source: If we send hundreds of jobs iteratively, this overhead quickly dominates the execution time of our algorithm. Qiskit Runtime allows us to tackle these issues and significantly speed up (especially) iterative algorithms. With Qiskit Runtime, one job does not contain only a batch of circuits but the *entire* algorithm. That means we only experience the API overhead and queue wait *once* instead of in every iteration! You'll be able to either upload algorithm parameters and delegate all the complexity to the cloud, where your program is executed, or upload your personal algorithm directly.
ja: 何百ものジョブを繰り返し送信すると、このオーバーヘッドがすぐにアルゴリズムの実行時間を支配してしまいます。Qiskit Runtimeにより、これらの問題に取り組み、（特に）反復アルゴリズムを大幅に高速化することができます。Qiskit Runtimeでは、1つのジョブは回路のバッチだけではなく、アルゴリズム *全体* を含みます。つまり、APIのオーバーヘッドとキューの待ち時間は、反復ごとではなく、 *一度* だけ発生するということです。アルゴリズムのパラメーターをアップロードして、プログラムが実行されるクラウドにすべての複雑さを委ねることも、個人のアルゴリズムを直接アップロードすることもできるでしょう。

source: For the VQE, the integration of Qiskit Runtime in your existing code is a piece of cake. There is a (almost) drop-in replacement, called ``VQEClient`` for the ``VQE`` class.
ja: VQEの場合、既存のコードにQiskit Runtimeを統合することは簡単です。 ``VQE`` クラスには ``VQEClient`` と呼ばれる（ほぼ）ドロップインの代替品があります。

source: Let's see how you can leverage the runtime on a simple chemistry example: Finding the ground state energy of the lithium hydrate (LiH) molecule at a given bond distance.
ja: 簡単な化学の例でruntimeをどのように活用できるか見てみましょう。：与えられた結合距離におけるリチウムハイドレート（LiH）分子の基底状態エネルギーを求めます。

source: To run the VQE we need to select a parameterized quantum circuit acting as ansatz and a classical optimizer. Here we'll choose a heuristic, hardware efficient ansatz and the SPSA optimizer.
ja: VQEを実行するには、パラメータ化された量子回路をansatzとして使用し、古典的なオプティマイザーを選択する必要があります。ここでは，ヒューリスティックでハードウェア効率のよいansatzとSPSAオプティマイザーを選択します。

source: Before executing the VQE in the cloud using Qiskit Runtime, let's execute a local VQE first.
ja: Qiskit Runtimeを使ってクラウド上でVQEを実行する前に、まずローカルでVQEを実行してみましょう。

source: Let's exchange the eigensolver from a local VQE algorithm to a VQE executed using Qiskit Runtime -- simply by exchanging the ``VQE`` class by the ``qiskit_nature.runtime.VQEClient``.
ja: 固有値ソルバーをローカルVQEアルゴリズムからQiskit Runtimeを使用して実行されるVQEに交換しましょう。 ``Qiskit_nature.runtime.VQEClient`` によって ``VQE`` クラスを交換するだけです。
