Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/08_property_framework.po
Languages: bn_bn, es_un, ja_jp, ko_kr, pt_un, ta_in

source: This page was generated from `docs/tutorials/08_property_framework.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/08_property_framework.ipynb`__ থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `docs/tutorials/08_property_framework.ipynb`__.
ja_jp: このページは `docs/tutorials/08_property_framework.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/08_property_framework.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/08_property_framework.ipynb`__.
ta_in: இந்தப் பக்கம் `docs/tutorials/08_property_framework.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: The Property Framework
bn_bn: Property (বৈশিষ্ট্য) ফ্রেমওয়ার্ক
es_un: El Framework Property
ja_jp: プロパティ・フレームワーク
ko_kr: 특성 프레임워크
pt_un: O Framework Property
ta_in: பொருள் கட்டமைப்பு

source: Qiskit Nature 0.2.0 introduces the *Property* framework. This framework replaces the legacy driver return types like ``QMolecule`` and ``WatsonHamiltonian`` with a more modular and extensible approach.
bn_bn: Qiskit Nature 0.2.0 *Property* ফ্রেমওয়ার্ক প্রবর্তন করে। এই ফ্রেমওয়ার্কটি আরো মডুলার এবং এক্সটেনসিবল পদ্ধতির সাথে ``QMolecule`` এবং ``WatsonHamiltonian`` এর মতো লিগ্যাসি ড্রাইভার রিটার্ন টাইপগুলি প্রতিস্থাপন করে।
es_un: Qiskit Nature 0.2.0 presenta el framework *Property*. Este framework reemplaza los tipos de retorno de controladores heredados como ``QMolecule`` y ``WatsonHamiltonian`` con un enfoque más modular y extensible.
ja_jp: Qiskit Nature 0.2.0 は *プロパティ* ・フレームワークを導入します。 このフレームワークは、``QMolecule`` や ``WatsonHamiltonian`` のような従来のドライバーの戻り値の型を、よりモジュール化された拡張可能なアプローチに置き換えます。
ko_kr: Qiskit Nature 0.2.0에서는 *특성* 프레임워크를 소개한다. 이 프레임워크는 ``QMolecule`` 와 ``WatsonHamiltonian`` 과 같은 기존의 드라이버 리턴 유형을 보다 모듈식이고 확장 가능한 방식으로 대체한다.
pt_un: O Qiskit Nature 0.2.0 apresenta o framework *Property*. Esse framework substitui os tipos de retorno de driver legados como o ``QMolecule`` e ``WatsonHamiltonian`` com uma abordagem mais modular e extensível.
ta_in: Qiskit Nature 0.2.0 *Property* கட்டமைப்பை அறிமுகப்படுத்துகிறது. இந்த கட்டமைப்பானது ``QMolecule`` மற்றும் ``WatsonHamiltonian`` போன்ற பாரம்பரிய டிரைவர் ரிட்டர்ன் வகைகளை அதிக மட்டு மற்றும் விரிவாக்க அணுகுமுறையுடன் மாற்றுகிறது.

source: In this tutorial, we will walk through the framework, explain its most important components and show you, how you can extend it with a custom *property* yourself.
bn_bn: এই টিউটোরিয়ালে, আমরা ফ্রেমওয়ার্কের মধ্য দিয়ে চলব, এর সবচেয়ে গুরুত্বপূর্ণ উপাদানগুলি ব্যাখ্যা করব এবং আপনাকে দেখাব, কিভাবে আপনি এটিকে একটি কাস্টম *property* দিয়ে নিজেই প্রসারিত করতে পারেন।
es_un: En este tutorial, recorreremos el framework, explicaremos sus componentes más importantes y te mostraremos cómo puedes ampliarlo con una *property* personalizada.
ja_jp: このチュートリアルでは、フレームワークについて説明し、その最も重要なコンポーネントを紹介します。 そしてあなた自身でカスタム・ *プロパティ* で拡張する方法をお見せします。
ko_kr: 이 사용 지침서에서는 프레임워크를 살펴보고, 가장 중요한 성분들에 대해 설명하고, 이러한 프레임워크를 사용자 정의 *특성*을 이용해 확장하는 방법을 보여준다.
pt_un: Neste tutorial, vamos percorrer o framework, explicaremos seus componentes mais importantes e mostraremos como você poderá amplia-lo com uma *property* personalizada.
ta_in: இந்த பயிற்சியில், நாங்கள் கட்டமைப்பின் வழியாக நடந்து, அதன் மிக முக்கியமான கூறுகளை விளக்கி, தனிப்பயன் *property* நீங்களே எப்படி நீட்டிக்க முடியும் என்பதை உங்களுக்குக் காண்பிப்போம்.

source: What is a ``Property``?
bn_bn: ``Property`` কি?
es_un: ¿Qué es una ``Property``?
ja_jp: ``Property`` とは何か?
ko_kr: ``Property`` 은 무엇인가?
pt_un: O que é uma ``Property``?
ta_in: ``Property`` என்றால் என்ன?

source: At its core, a ``Property`` is an object complementing some raw data with functions that allow you to transform/manipulate/interpret this raw data. This “definition” is kept rather abstract on purpose, but what it means is essentially the following. A ``Property``:
bn_bn: এর মূল অংশে, একটি ``Property`` এমন একটি বস্তু যা কিছু অপরিমার্জিত ডেটাকে ফাংশনগুলির সাথে পরিপূরক করে যা আপনাকে এই অপরিমার্জিত ডেটা রূপান্তর/হেরফের/ব্যাখ্যা করতে দেয়। এই "সংজ্ঞা" উদ্দেশ্যগতভাবে বরং বিমূর্ত রাখা হয়েছে, কিন্তু এর অর্থ কী তা মূলত নিম্নলিখিত। ``Property`` মানে:
es_un: En esencia, una ``Property`` (propiedad) es un objeto que complementa algunos datos sin procesar con funciones que te permiten transformar/manipular/interpretar estos datos sin procesar. Esta "definición" se mantiene bastante abstracta a propósito, pero lo que significa es esencialmente lo siguiente. Una ``Property``:
ja_jp: ``Property`` は生データを補完するオブジェクトで、変換/操作/解釈する機能があります。この "定義" は意図的に抽象的ですが、その意味は基本的に次のようになっています。``Property`` は:
ko_kr: 핵심인 ``Property`` 은 이러한 원시 데이터를 변환/조작/해석할 수 있도록 하는 함수를 사용하여 일부 원시 데이터를 보완하는 객체이다. 이 "정의"는 목적에 따라 다소 추상적이지만 본질적으로는 다음과 같다. ``Property`` 은:
pt_un: Na sua essência, uma ``Property`` é um objeto que complementa alguns dados brutos com funções que lhe permitirão transformar/manipular/interpretar estes dados brutos. Esta "definição" se mantém bastante abstrata a propósito, mas o que isso significa é essencialmente o seguinte. Uma ``Property``:
ta_in: அதன் மையத்தில், ``Property`` என்பது இந்த மூல தரவை மாற்ற/கையாள/விளக்குவதற்கு அனுமதிக்கும் செயல்பாடுகளுடன் சில மூல தரவுகளை பூர்த்தி செய்யும் ஒரு பொருள். இந்த "வரையறை" வேண்டுமென்றே சுருக்கமாக வைக்கப்பட்டுள்ளது, ஆனால் இதன் பொருள் அடிப்படையில் பின்வருமாறு. ஒரு ``Property``:

source: represents a physical observable (that’s the raw data)
bn_bn: একটি বাহ্যিক পর্যবেক্ষণযোগ্য প্রতিনিধিত্ব করে (এটি অপরিমার্জিত তথ্য)
es_un: representa un observable físico (esos son los datos sin procesar)
ja_jp: 物理的な観測可能量を表す (生データ)
ko_kr: 물리적으로 관찰 가능한 객체 (원시 데이터) 를 나타낸다.
pt_un: representa um observável físico (estes são os dados brutos)
ta_in: ஒரு உடல் காணக்கூடியதைக் குறிக்கிறது (அது பதனிடப்படாத தரவு)

source: can be expressed as an operator
bn_bn: অপারেটর হিসেবে প্রকাশ করা যায়
es_un: se puede expresar como un operador
ja_jp: 演算子として表現できる
ko_kr: 연산자로써 표현될 수 있다.
pt_un: pode ser expressado como um operador
ta_in: ஒரு ஆபரேட்டராக வெளிப்படுத்தலாம்

source: can be evaluated with a wavefunction
bn_bn: ওয়েভ ফাংশন দিয়ে মূল্যায়ন করা যায়
es_un: se puede evaluar con una función de onda
ja_jp: 波動関数で評価できる
ko_kr: 파동 함수로 평가될 수 있다.
pt_un: pode ser avaliado com uma função de onda
ta_in: ஒரு அலை செயல்பாட்டுடன் மதிப்பீடு செய்யலாம்

source: provides an ``interpret`` method which gives meaning to the eigenvalue of the evaluated qubit operator
bn_bn: একটি ``interpret`` পদ্ধতি প্রদান করে যা মূল্যায়নকৃত কিউবিট অপারেটরের স্বকীয়মান (আইগেনভ্যালু) এর অর্থ প্রদান করে
es_un: proporciona un método ``interpret`` que da significado al valor propio del operador de qubit evaluado
ja_jp: 評価された量子ビット演算子の固有値に意味を与える ``interpret`` メソッドを提供する
ko_kr: 평가된 큐비트 연산자의 고유값에 의미를 부여하는 ``interpret`` 방법을 제공한다.
pt_un: proporciona um método ``interpret`` que da significado ao autovalor do operador qubit avaliado
ta_in: மதிப்பீடு செய்யப்பட்ட க்யூபிட் ஆபரேட்டரின் முக்கிய மதிப்பை வழங்கும் ``interpret`` முறையை வழங்குகிறது

source: The ``qiskit_nature.properties`` module provides two classes:
bn_bn: ``Qiskit_nature.properties`` মডিউল দুটি ক্লাস প্রদান করে:
es_un: El módulo ``qiskit_nature.properties`` proporciona dos clases:
ja_jp: ``qiskit_nature.properties`` モジュールは２つのクラスを提供します：
ko_kr: ``qiskit_nature.properties`` 모듈은 두 가지 클래스를 제공한다:
pt_un: O módulo ``qiskit_nature.properties`` fornece duas classes:
ta_in: ``qiskit_nature.properties`` தொகுதி இரண்டு வகுப்புகளை வழங்குகிறது:

source: ``Property``: this is the basic interface. It requires only a ``name`` and an ``interpret`` method to be implemented.
bn_bn: ``Property``: এটি মৌলিক ইন্টারফেস। এটি প্রয়োগ করার জন্য শুধুমাত্র একটি ``নাম`` এবং একটি ``ব্যাখ্যা`` পদ্ধতি প্রয়োজন।
es_un: ``Property``: esta es la interfaz básica. Requiere solo un ``name`` y un método ``interpret`` para ser implementada.
ja_jp: ``Property``: 基本インターフェースです。``name`` と ``interpret`` メソッドが実装されることを要求します。
ko_kr: ``Property``: 이것이 기본 인터페이스이다. ``name`` 과 ``interpret`` 메서드만 구현되는 것을 요구한다.
pt_un: ``Property``: esta é a interface básica. Requer apenas um ``name`` e um método `ìnterpret`` para ser implementada.
ta_in: ``Property``: இது அடிப்படை இடைமுகம். அதை செயல்படுத்த ``name`` மற்றும் ``interpret`` முறை மட்டுமே தேவைப்படுகிறது.

source: ``GroupedProperty``: this class is an implementation of the `Composite pattern <https://en.wikipedia.org/wiki/Composite_pattern>`__ which allows you to *group* multiple properties into one.
bn_bn: ``GroupedProperty``: এই শ্রেণীটি `Composite pattern <https://en.wikipedia.org/wiki/Composite_pattern>`__ এর একটি বাস্তবায়ন যা আপনাকে একাধিক *গ্রুপের* বৈশিষ্ট্যগুলিকে এক করতে দেয়।
es_un: ``GroupedProperty``: esta clase es una implementación del `Patrón de diseño Composite <https://en.wikipedia.org/wiki/Composite_pattern>`__ que te permite *agrupar* múltiples propiedades en una.
ja_jp: ``GroupedProperty``: 複数のプロパティを一つの *グループ* にする `Composite pattern <https://en.wikipedia.org/wiki/Composite_pattern>`__ の実装クラスです。
ko_kr: ``GroupedProperty`` : 이 클래스는 복합 패턴 `Composite pattern <https://en.wikipedia.org/wiki/Composite_pattern>`__ 를 구현한 것이며, 이를 통해 여러 특성을 하나로 *그룹화*할 수 있다.
pt_un: ``GroupedProperty``: esta classe é uma implementação de ``Composite pattern <https://en.wikipedia.org/wiki/Composite_pattern>`__ que lhe permite *agrupar* múltiplas propriedades em uma.
ta_in: ``GroupedProperty``: இந்த வகுப்பு `Composite pattern <https://en.wikipedia.org/wiki/Composite_pattern>`__ இன் செயல்பாடாகும், இது உங்களை *பல* பண்புகளை ஒன்றாக இணைக்க அனுமதிக்கிறது.

source: **Note:** Grouped properties must have unique ``name`` attributes!
bn_bn: **দ্রষ্টব্য:** গোষ্ঠীভুক্ত বৈশিষ্ট্যগুলির অনন্য ``name`` অ্যাট্রিবিউট থাকতে হবে!
es_un: **Nota:** ¡Las propiedades agrupadas deben tener atributos únicos de ``name``!
ja_jp: ** 注: ** グループ化されたプロパティは一意の ``name`` 属性を持つ必要があります!
ko_kr: ** 참고: ** 그룹화된 특성에는 고유한 ``name`` 속성이 있어야 한다!
pt_un: **Nota:** Propriedades agrupadas devem possuir atributos ``name`` únicos!
ta_in: **குறிப்பு:** தொகுக்கப்பட்ட பண்புகள் தனித்துவமான ``name`` பண்புகளைக் கொண்டிருக்க வேண்டும்!

source: Second Quantization Properties
bn_bn: দ্বিতীয় কোয়ান্টাইজেশন বৈশিষ্ট্য
es_un: Propiedades de la Segunda Cuantización
ja_jp: 第二量子化プロパティ
ko_kr: 2차 양자화 특성
pt_un: Propriedades de Segunda Quantização
ta_in: இரண்டாவது அளவீட்டு பண்புகள்

source: At the time of writing, Qiskit Nature ships with a single variant of properties: the ``SecondQuantizedProperty`` objects.
bn_bn: লেখার সময়, Qiskit Nature বৈশিষ্ট্যগুলির একক রূপের সাথে আসে: ``দ্বিতীয় কোয়ান্টাইজেশন বৈশিষ্ট্য`` বস্তু।
es_un: En el momento de escribir este artículo, Qiskit Nature se envía con una única variante de propiedades: los objetos ``SecondQuantizedProperty``.
ja_jp: 執筆時点で Qiskit Nature は、一種類のプロパティ ``SecondQuantizedProperty`` オブジェクトを提供しています。
ko_kr: 이 글이 작성되는 시점에서, Qiskit Nature는 ``SecondQuantizedProperty`` 객체라는 하나의 특성을 제공한다.
pt_un: No momento da escrita, Qiskit Nature envia com uma única variante de propriedades: os objetos ``SecondQuantizedProperty``.
ta_in: எழுதும் நேரத்தில், Qiskit Nature பண்புகளின் ஒற்றை மாறுபாட்டுடன் அனுப்பப்படுகிறது: ``SecondQuantizedProperty`` பொருள்கள்.

source: This sub-type adds one additional requirement because any ``SecondQuantizedProperty``
bn_bn: এই সাব-টাইপটি একটি অতিরিক্ত প্রয়োজনীয়তা যুক্ত করে কারণ যেকোনো ``SecondQuantizedProperty``
es_un: Este subtipo agrega un requisito adicional porque cualquier ``SecondQuantizedProperty``
ja_jp: このサブタイプは１つの追加要件があります。それは ``SecondQuantizedProperty`` は
ko_kr: 이 하위 유형은 하나의 추가 요구 사항을 더하는데, 이는 ``SecondQuantizedProperty`` 가
pt_un: Este subtipo agrega um requisito adicional por qualquer ``SecondQuantizedProperty``
ta_in: இந்த துணை வகை ஒரு கூடுதல் தேவையை சேர்க்கிறது, ஏனெனில் எந்த ``SecondQuantizedProperty``

source: **must** implement a ``second_q_ops`` method which constructs a (list of) ``SecondQuantizedOp``\ s.
bn_bn: **অবশ্যই** একটি ``second_q_ops`` পদ্ধতি প্রয়োগ করতে হবে যা ``SecondQuantizedOp``\ গুলির একটি (তালিকা) তৈরি করে।
es_un: **debe** implementar un método ``second_q_ops`` que construya una (lista de) ``SecondQuantizedOp``\ s.
ja_jp: ``SecondQuantizedOp`` (のリスト) を構築する ``second_q_ops`` メソッドを実装 **しなければなりません**
ko_kr: **반드시** (일련의) ``SecondQuantizedOp`` 들을 구축하는 ``second_q_ops`` 방법을 구현해야 한다.
pt_un: **deve** implementar um método ``second_q_ops``que constrói uma (lista de) ``SecondQuantizedOp``\ s.
ta_in: ஒரு ``second_q_ops`` முறையை அமல்படுத்த **வேண்டும்**, இது ஒரு (பட்டியல்) ``SecondQuantizedOp`` ஐ உருவாக்குகிறது.

source: The ``qiskit_nature.properties.second_quantization`` module is further divided into ``electronic`` and ``vibrational`` modules (similar to other modules of Qiskit Nature). Let us dive into the ``electronic`` sub-module first.
bn_bn: ``qiskit_nature.properties.second_quantization`` মডিউলটি আরও ``ইলেকট্রনিক`` এবং ``ভাইব্রেশনাল`` মডিউলে বিভক্ত (Qiskit Nature এর অন্যান্য মডিউলের মতো)। আসুন প্রথমে ``ইলেকট্রনিক`` সাব-মডিউলে ডুব দেই।
es_un: El módulo ``qiskit_nature.properties.second_quantization`` se divide a su vez en los módulos ``electronic`` y ``vibrational`` (similares a otros módulos de Qiskit Nature). Vamos a sumergirnos primero en el submódulo ``electronic``.
ja_jp: ``qiskit_nature.properties.second_quantization`` メソッドは、 (Qiskit Nature のモジュールと同様に)さらに ``electronic`` と ``vibrational`` モジュールへ分割されます。まずは ``electronic`` サブモジュールを見てみましょう。
ko_kr: ``qiskit_nature.properties.second_quantization`` 모듈은 ``electronic`` 와 ``vibrational`` 모듈 (Qiskit Nature의 다른 모듈과 유사함) 으로 더 나누어진다. 먼저 ``electronic`` 하위 모듈을 살펴보도록 하자.
pt_un: O módulo ``qiskit_nature.properties.second_quantization`` é dividido entre os módulos ``electronic`` e ``vibrational`` (similares aos outros módulos de Qiskit Nature). Vamos mergulhar no sub-módulo ``electronic`` primeiro.
ta_in: ``qiskit_nature.properties.second_quantization`` தொகுதி மேலும் ``electronic`` மற்றும் ``vibrational`` தொகுதிகளாக பிரிக்கப்பட்டுள்ளது (Qiskit Nature மற்ற தொகுதிகள் போன்றது). முதலில் ``electronic`` துணை-தொகுதிக்குள் நுழைவோம்.

source: Electronic Second Quantization Properties
bn_bn: ইলেকট্রনিক দ্বিতীয় কোয়ান্টাইজেশন বৈশিষ্ট্য
es_un: Propiedades de la Segunda Cuantización Electrónica
ja_jp: 電子の第二量子化プロパティ
ko_kr: 전자 2차 양자화 특성
pt_un: Propriedades de Segunda Quantização Eletrônica
ta_in: மின்னணு இரண்டாம் அளவு பண்புகள்

source: Out-of-the-box Qiskit Nature ships the following electronic properties:
bn_bn: আউট অফ দ্য বক্স Qiskit Nature নিম্নলিখিত ইলেকট্রনিক বৈশিষ্ট্যগুলি পাঠায়:
es_un: Qiskit Nature, listo para usar, envía las siguientes propiedades electrónicas:
ja_jp: Qiskit Nature はすぐに使える次の電子プロパティを持っています：
ko_kr: 즉시 사용할 수 있는 Qiskit Nature는 다음과 같은 전자적 특성을 제공한다:
pt_un: Qiskit Nature Pronto para uso envia as seguintes propriedades eletrônicas:
ta_in: பெட்டிக்கு வெளியே உள்ள Qiskit இயற்கை பின்வரும் மின்னணு பண்புகளை அனுப்புகிறது:

source: ``ElectronicEnergy`` is arguably the most important property because it contains the *Hamiltonian* representing the electronic structure problem whose eigenvalues we are interested in when solving an ``ElectronicStructureProblem``. The way in which it stores this Hamiltonian is, just like the rest of the framework, highly modular. The initializer of the ``ElectronicEnergy`` has a single required argument, ``electronic_integrals``, which is a ``List[ElectronicIntegrals]``.
bn_bn: ``ইলেকট্রনিক এনার্জি`` যুক্তিযুক্তভাবে সবচেয়ে গুরুত্বপূর্ণ বৈশিষ্ট্য কারণ এতে ইলেকট্রনিক স্ট্রাকচার সমস্যার প্রতিনিধিত্বকারী *হ্যামিল্টোনিয়ান* রয়েছে যার স্বকীয়মান (আইগেনভ্যালু) ​​``ElectronicStructureProblem`` সমাধান করার সময় আমরা বের করতে আগ্রহী। যেভাবে এটি বাকী কাঠামোর মতো এই হ্যামিল্টোনিয়ান সঞ্চয় করে তা অত্যন্ত মডুলার। ``ইলেকট্রনিক এনার্জি`` এর প্রারম্ভিকের একটি একক প্রয়োজনীয় আর্গুমেন্ট আছে, ``electronic_integrals``, যা একটি ``List[ElectronicIntegrals]``।
es_un: ``ElectronicEnergy`` es posiblemente la propiedad más importante porque contiene al *Hamiltoniano* que representa el problema de la estructura electrónica cuyos valores propios nos interesan al resolver un ``ElectronicStructureProblem``. La forma en que almacena a este Hamiltoniano es, al igual que el resto del framework, muy modular. El inicializador de ``ElectronicEnergy`` tiene un único argumento requerido, ``electronic_integrals``, que es una ``List[ElectronicIntegrals]``.
ja_jp: ``ElectronicEnergy`` はほぼ間違いなく最も重要なプロパティです。なぜならそれは ``ElectronicStructureProblem`` を解く時に興味がある固有値を持った、電子構造問題の *ハミルトニアン* を含んでいるからです。このハミルトニアンを保有する方法も、他のフレームワークと同様に、高度にモジュール化されています。``ElectronicEnergy`` の初期化処理に必要な引数は ``electronic_integrals`` だけで、これは ``List[ElectronicIntegrals]`` です。
ko_kr: ``ElectronicEnergy`` 는 ``ElectronicStructureProblem`` 을 해결할 때 우리가 관심을 갖고 있는 전자 구조의 문제를 나타내는 *해밀톤*을 포함하고 있기 때문에 가장 중요한 특성이다. 이 해밀톤을 저장하는 방법은 나머지 프레임워크와 마찬가지로, 고도로 모듈화되어 있다. ``ElectronicEnergy`` 의 초기화기는 하나의 필수 전달인자인 ``electronic_integrals`` 를 갖고 있다. 이는 ``List[ElectronicIntegrals]`` 이다.
pt_un: ``ElectronicEnergy`` é sem dúvida a propriedade mais importante porque contém *Hamiltoniano* que representa o problema de estrutura eletrônica cujos autovalores nos interessam ao resolver um ``ElectronicStructureProblem``. A maneira como ela armazena o Hamiltoniano é, assim como o restante do framework, altamente modular. O inicializador da ``ElectronicEnergy`` tem um único argumento obrigatório, ``electronic_integrals``, que é uma `` ``List[ElectronicIntegrals]``.
ta_in: ``ElectronicEnergy`` என்பது மிக முக்கியமான சொத்து, ஏனெனில் இது மின்னணு கட்டமைப்பு சிக்கலைக் குறிக்கும் *Hamiltonian* ஐக் கொண்டுள்ளது, அதன் ``ElectronicStructureProblem`` ஐ தீர்க்கும்போது நாம் ஆர்வமாக உள்ளோம். இந்த ஹாமில்டோனியனை அது சேமிக்கும் விதம், மீதமுள்ள கட்டமைப்பைப் போலவே, மிகவும் மட்டு. ``ElectronicEnergy`` இன் துவக்கத்தில் ஒரு தேவையான வாதம் உள்ளது, ``electronic_integrals``, இது ஒரு ``List[ElectronicIntegrals]``.

source: ElectronicIntegrals
bn_bn: ইলেক্ট্রনিক ইন্টিগ্রালস
ta_in: மின்னணு ஒருங்கிணைப்பு

source: The ``ElectronicIntegrals`` are a container class for *n-body* interactions in a given basis, which can be any of the following:
bn_bn: ``ElectronicIntegrals`` একটি নির্দিষ্ট ভিত্তিতে *n-body* মিথস্ক্রিয়াগুলির জন্য একটি ধারক শ্রেণী, যা নিচের যেকোনো একটি হতে পারে:
es_un: Las ``ElectronicIntegrals`` son una clase de contenedor para interacciones de *n-cuerpos* en una base determinada, que puede ser cualquiera de las siguientes:
ja_jp: ``ElectronicIntegrals`` は所与の基底での *n体* 相互作用のコンテナクラスです。以下のようになります。
ko_kr: ``ElectronicIntegrals`` 은 주어진 기저에서 *n-body* 상호작용을 위한 컨테이너 클래스이며, 다음의 모든 것들이 가능하다:
pt_un: Os ``ElectronicIntegrals`` são uma classe contêiner para interações de *n-corpos* em uma determinada base, que pode ser qualquer uma das seguintes:
ta_in: ``ElectronicIntegrals`` என்பது கொடுக்கப்பட்ட அடிப்படையில் *n-body* தொடர்புகளுக்கான ஒரு கொள்கலன் வகுப்பாகும், இது பின்வருவனவற்றில் ஏதேனும் இருக்கலாம்:

source: Let us take the ``OneBodyElectronicIntegrals`` as an example. As the name suggests, this container is for 1-body interaction integrals. You can construct an instance of it like so:
bn_bn: আসুন একটি উদাহরণ হিসাবে ``OneBodyElectronicIntegrals`` গ্রহণ করি। নাম থেকে বোঝা যায়, এই ধারকটি ১-বডি ইন্টারঅ্যাকশন ইন্টিগ্রালের জন্য। আপনি এটির একটি উদাহরণ তৈরি করতে পারেন:
es_un: Tomemos como ejemplo los ``OneBodyElectronicIntegrals``. Como sugiere el nombre, este contenedor es para integrales de interacción de 1 cuerpo. Puedes construir una instancia de la siguiente manera:
ja_jp: ``OneBodyElectronicIntegrals`` を例に取りましょう。名前が示唆するように、このコンテナは 1 体の相互作用積分です。このインスタンスの構築は次の通りです：
ko_kr: 예를 들어 ``OneBodyElectronicIntegrals`` 를 살펴보자. 이름이 암시하는 바와 같이, 이 컨테이너는 1-body 상호작용의 통합을 위한 것이다. 다음과 같이 인스턴스를 생성할 수 있다:
pt_un: Tomemos o ``OneBodyElectronicIntegrals`` como exemplo. Como o nome sugere, este contêiner é para integrais de interação de 1-corpo. Você pode construir uma instância dele da seguinte forma:
ta_in: உதாரணமாக ``OneBodyElectronicIntegrals`` ஐ எடுத்துக் கொள்வோம். பெயர் குறிப்பிடுவது போல, இந்த கொள்கலன் 1-body தொடர்பு ஒருங்கிணைப்புகளுக்கானது. இது போன்ற ஒரு உதாரணத்தை நீங்கள் உருவாக்கலாம்:

source: As you can see, the first argument simply specifies the basis of the integrals. The second argument requires a little further explanation:
bn_bn: আপনি দেখতে পাচ্ছেন, প্রথম যুক্তিটি কেবল ইন্টিগ্রালের ভিত্তি নির্দিষ্ট করে। দ্বিতীয় যুক্তির আরেকটু ব্যাখ্যা প্রয়োজন:
es_un: Como puedes ver, el primer argumento simplemente especifica la base de las integrales. El segundo argumento requiere una pequeña explicación más:
ja_jp: ご覧の通り、最初の引数は単に積分の基底を指定するだけです。第二引数は少し説明が必要です：
ko_kr: 보이는 바와 같이, 첫 번째 전달인자는 간단하게 적분의 기저를 지정한다. 두 번째 전달인자는 다음과 같은 추가 설명이 필요하다:
pt_un: Como pode ver, o primeiro argumento simplesmente especifica a base das integrais. O segundo argumento requer um pouco mais de explicação:
ta_in: நீங்கள் பார்க்க முடியும் என, முதல் வாதம் வெறுமனே ஒருங்கிணைப்புகளின் அடிப்படையைக் குறிப்பிடுகிறது. இரண்டாவது வாதத்திற்கு இன்னும் கொஞ்சம் விளக்கம் தேவை:

source: In the case of the ``AO`` or ``MO`` basis, this argument **must** be a pair of numpy arrays, where the first and second one are the alpha- and beta-spin integrals, respectively.
bn_bn: "AO" বা "MO" ভিত্তির ক্ষেত্রে, এই যুক্তিটি **অবশ্যই** numpy অ্যারেগুলির একটি জোড়া হতে হবে, যেখানে প্রথম এবং দ্বিতীয়টি যথাক্রমে আলফা- এবং বিটা-স্পিন অবিচ্ছেদ্য।
es_un: En el caso de las bases ``AO`` o ``MO``, este argumento **debe** ser un par de matrices numéricas, donde la primera y la segunda son las integrales de espín alfa y beta, respectivamente.
ja_jp: ``AO`` または ``MO`` 基底の場合、この引数は α と β スピン積分の numpy 配列のペアで **なければ** なりません。
ko_kr: ``AO`` 나 ``MO`` 기저의 경우에, 이러한 전달인자들은 **반드시** 은 한 쌍의 numpy 배열이며, 여기서 첫 번째와 두 번째는 각각 알파- 및 베타-스핀 적분이다.
pt_un: No caso das bases ``AO`` ou ``MO``, este argumento **deve** ser um par de matrizes numpy, onde a primeira e a segunda são as integrais de spin alfa e beta, respectivamente.
ta_in: ``AO`` அல்லது ``MO`` அடிப்படையில், இந்த வாதம் ஒரு ஜோடி எண் வரிசைகளாக இருக்க **வேண்டும்**, அங்கு முதல் மற்றும் இரண்டாவது முறையே ஆல்பா மற்றும் பீட்டா-ஸ்பின் ஒருங்கிணைப்புகள்.

source: **Note:** The second argument may be ``None``, for the case where the beta-spin integrals are the same as the alpha-spin integrals (so there is no need to provide the same values twice).
bn_bn: **দ্রষ্টব্য:** দ্বিতীয় যুক্তিটি ``None`` হতে পারে, সেই ক্ষেত্রে যেখানে বিটা-স্পিন ইন্টিগ্রালগুলি আলফা-স্পিন ইন্টিগ্রালগুলির সমান (তাই দুইবার একই মান দেওয়ার প্রয়োজন নেই)।
es_un: **Nota:** El segundo argumento puede ser ``None``, para el caso donde las integrales beta-spin son las mismas que las integrales alfa-spin (por lo que no es necesario proporcionar los mismos valores dos veces).
ja_jp: **注記：** 第二引数は β スピン積分が α スピン積分と同じ場合 ``None`` にすることができます(つまり同じ値を二度指定する必要はありません)。
ko_kr: ** 참고: ** 두 번째 전달인자는 베타-스핀 적분이 알파-스핀 적분과 동일한 경우에 ``None`` 이 될 수 있다 (따라서 동일한 값을 두 번 제공할 필요가 없음).
pt_un: **Nota:** O segundo argumento pode ser ``None``, para o caso onde as integrais de spin beta são as iguais às integrais de spin alfa (logo, não há necessidade de fornecer os mesmos valores duas vezes).
ta_in: **குறிப்பு:** இரண்டாவது வாதம் ``None`` என்று இருக்கலாம், பீட்டா-ஸ்பின் ஒருங்கிணைந்தவை ஆல்ஃபா-ஸ்பின் ஒருங்கிணைந்தவை (எனவே ஒரே மதிப்புகளை இரண்டு முறை வழங்க வேண்டிய அவசியம் இல்லை).

source: In the case of the ``SO`` basis, this argument **must** be a single numpy array, storing the alpha- and beta-spin integrals in blocked order, i.e. like so:
bn_bn: "SO" ভিত্তির ক্ষেত্রে, এই যুক্তি **অবশ্যই** একটি একক সংখ্যাযুক্ত অ্যারে হতে হবে, যা আলফা- এবং বিটা-স্পিন ইন্টিগ্রালগুলিকে ব্লক অর্ডারে সংরক্ষণ করে, যেমন:
es_un: En el caso de la base ``SO``, este argumento **debe** ser una matriz numérica única, almacenando las integrales de espín alfa y beta en orden bloqueado, es decir, así:
ja_jp: ``SO`` 基底の場合、この引数は α と β スピン積分を決まった順序で保持した、単一の numpy 配列で **なければ** なりません。例えば次の通りです：
ko_kr: ``SO`` 기저의 경우, 전달인자는 **반드시** 단일의 numpy 배열로, 알파- 및 베타-스핀 적분을 차단된 순서로 저장한다.
pt_un: No caso da base ``SO``, este argumento **deve** ser uma matriz numpy, armazenando as integrais alpha- e beta-spin em ordem bloqueada, como por exemplo:
ta_in: ``SO`` அடிப்படையைப் பொறுத்தவரை, இந்த வாதம் ஒற்றை எண் வரிசையாக இருக்க **வேண்டும்**, ஆல்பா மற்றும் பீட்டா-ஸ்பின் ஒருங்கிணைப்புகளை தடுக்கப்பட்ட வரிசையில் சேமிக்கிறது, அதாவது. அப்படி:
