Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/08_property_framework.po
Languages: bn_bn, es_un, ja_jp, ko_kr, pt_un, ta_in

source: For the time being, you can still evaluate a custom Property, by passing it’s generated operators directly to the ``Eigensolver.solve`` method by means of constructing the ``aux_operators``. Note, however, that you will have to deal with transformations applied to your properties manually, until the above issue is resolved.
bn_bn: আপাতত, আপনি এখনও একটি কাস্টম সম্পত্তির মূল্যায়ন করতে পারেন, এটি ``aux_operators`` নির্মাণের মাধ্যমে সরাসরি ``Eigensolver.solve`` পদ্ধতিতে উৎপাদিত অপারেটরদের পাস করে। তবে মনে রাখবেন, উপরের সমস্যাটি সমাধান না হওয়া পর্যন্ত আপনাকে আপনার বৈশিষ্ট্যগুলিতে ম্যানুয়ালি প্রয়োগ করা রূপান্তরগুলি মোকাবেলা করতে হবে।
es_un: Por el momento, aún puedes evaluar una Property personalizada, pasando los operadores generados directamente al método ``Eigensolver.solve`` mediante la construcción de los ``aux_operators``. Sin embargo, ten en cuenta que tendrás que lidiar con las transformaciones aplicadas a tus propiedades manualmente, hasta que se resuelva el problema anterior.
ja_jp: 当面は ``aux_operators`` を生成する手段として、生成された演算子を ``Eigensolver.solve`` メソッドに直接渡すことで、カスタムプロパティを評価することができます。ただし上記の問題が解決するまでは、プロパティに適用される変換を手動で処理する必要があることに注意してください。
ko_kr: 당분간은 사용자 정의 Property을 평가할 수 있는데, 이는 생성된 연산자를 ``aux_operators`` 를 구성하는 방법으로 직접적으로 ``Eigensolver.solve`` 메서드에 전달하는 것이다. 그러나 참고로, 위의 문제가 해결될 때까지 사용자의 특성에 적용되는 변환을 수동으로 처리해야 한다.
pt_un: Por enquanto, você ainda pode avaliar uma propriedade personalizada, passando seus operadores gerados diretamente para o método ``Eigensolver.solve`` por meio da construção do ``aux_operators``. Observe, no entanto, que você terá que lidar com as transformações aplicadas às suas propriedades manualmente, até que o problema acima seja resolvido.
ta_in: இப்போதைக்கு, நீங்கள் ஒரு தனிப்பயன் சொத்தை மதிப்பீடு செய்யலாம், அது உருவாக்கப்பட்ட ஆப்பரேட்டர்களை நேரடியாக ``Eigensolver.solve`` முறைக்கு ``aux_operators`` ஐ உருவாக்குவதன் மூலம் மதிப்பீடு செய்யலாம். எவ்வாறாயினும், மேலே உள்ள சிக்கல் தீர்க்கப்படும் வரை, உங்கள் சொத்துக்களுக்குப் பயன்படுத்தப்படும் மாற்றங்களை நீங்கள் கைமுறையாக கையாள வேண்டும் என்பதை நினைவில் கொள்க.
