Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/08_property_framework.po
Languages: bn_bn, es_un, ja_jp, ko_kr, pt_un, ta_in

source: The ``TwoBodyElectronicIntegrals`` work pretty much the same except that they contain all possible spin-combinations in the tuple of numpy arrays. For example:
bn_bn: ``TwoBodyElectronicIntegrals`` গুলি numpy অ্যারেগুলির টাপলে সমস্ত সম্ভাব্য স্পিন-সমন্বয় ধারণ করা ব্যতীত অনেকটা একই রকম কাজ করে। উদাহরণ স্বরূপ:
es_un: Las ``TwoBodyElectronicIntegrals`` funcionan prácticamente igual, excepto que contienen todas las posibles combinaciones de espín en la tupla de matrices numpy. Por ejemplo:
ja_jp: ``TwoBodyElectronicIntegrals`` は、numpy 配列のタプルに全ての可能なスピンの組み合わせを含むこと除いて、ほとんど同じ動作をします。例えば次の通りです：
ko_kr: ``TwoBodyElectronicIntegrals`` 는 이들이 가능한 모든 스핀-조합을 numpy 배열의 튜플에서 포함하고 있다는 점을 제외하고는 거의 동일하다. 예를 들어:
pt_un: As ``TwoBodyElectronicIntegrals`` funcionam basicamente da mesma forma, exceto que contém todas as possíveis spin-combinations na tupla de matrizes numpy. Por exemplo:
ta_in: ``TwoBodyElectronicIntegrals`` என்பது ஒரே மாதிரியாக வேலை செய்கிறது, தவிர அவை நம்பி வரிசைகளின் டப்பிளில் சாத்தியமான அனைத்து ஸ்பின்-இணைப்புகளையும் கொண்டிருக்கின்றன. உதாரணத்திற்கு:

source: We should take note of a few observations:
bn_bn: আমাদের কয়েকটি পর্যবেক্ষণ লক্ষ্য করা উচিত:
es_un: Debemos tomar nota de algunas observaciones:
ja_jp: いくつか注目すべき点があります：
ko_kr: 몇 가지 관찰 결과를 참고해야 한다.
pt_un: Devemos tomar nota de algumas observações:
ta_in: ஒரு சில அவதானிப்புகளை நாம் கவனத்தில் கொள்ள வேண்டும்:

source: the numpy arrays shall be ordered as ``("alpha-alpha", "beta-alpha", "beta-beta", "alpha-beta")``
bn_bn: numpy array কে ``("alpha-alpha", "beta-alpha", "beta-beta", "alpha-beta")`` এভাবে সাজানো হবে
es_un: las matrices numpy se ordenarán como ``("alpha-alpha", "beta-alpha", "beta-beta", "alpha-beta")``
ja_jp: numpy 配列は ``("alpha-alpha", "beta-alpha", "beta-beta", "alpha-beta")`` の順になります
ko_kr: numpy 배열은 이렇게 배열될 것이다 ``("alpha-alpha", "beta-alpha", "beta-beta", "alpha-beta")``
pt_un: as matrizes numpy devem ser ordenadas como ``("alpha-alpha", "beta-alpha", "beta-beta", "alpha-beta")``
ta_in: எண் வரிசைகள் ``("alpha-alpha", "beta-alpha", "beta-beta", "alpha-beta")`` என வரிசைப்படுத்தப்பட வேண்டும்

source: the ``alpha-alpha`` matrix may **not** be ``None``
bn_bn: ``alpha-alpha`` ম্যাট্রিক্স ``None`` হতে পারে **না**
es_un: la matriz ``alpha-alpha`` **no** puede ser ``None``
ja_jp: ``alpha-alpha`` 配列は ``None`` を含みません
ko_kr: ``alpha-alpha`` 배열은 ``None`` 이 될 수 **없다**.
pt_un: a matriz ``alpha-alpha`` **não** pode ser ``None``
ta_in: ``alpha-alpha`` அணி **not** ``None``

source: if the ``alpha-beta`` matrix is ``None``, but ``beta-alpha`` is not, its transpose will be used (like above)
bn_bn: যদি ``alpha-beta`` ম্যাট্রিক্স ``None`` হয়, কিন্তু ``beta-alpha`` না হয়, তবে এর transpose ব্যবহার করা হবে (উপরের মত)
es_un: si la matriz ``alpha-beta`` es ``None``, pero ``beta-alpha`` no lo es, se usará su transposición (como arriba)
ja_jp: もし ``alpha-beta`` 配列が ``None`` だが ``beta-alpha`` が異なる場合には、 (上の様に) 転置が使用されます
ko_kr: ``alpha-beta`` 배열이 ``None``이고 ``beta-alpha`` 는 아니라면, 전치는 사용될 것이다 (위와 같이)
pt_un: se a matriz ``alpha-beta`` é ``None``, mas ``beta-alpha`` não, sua transposição será usada (como acima)
ta_in: ``alpha-beta`` மேட்ரிக்ஸ் ``None``, ஆனால் ``beta-alpha`` இல்லையென்றால், அதன் இடமாற்றம் பயன்படுத்தப்படும் (மேலே உள்ளதைப் போல)

source: in any other case, matrices which are ``None`` will be filled with the ``alpha-alpha`` matrix
bn_bn: অন্য কোন ক্ষেত্রে, ``None`` ম্যাট্রিক্স ``alpha-alpha`` ম্যাট্রিক্স দিয়ে ভরা হবে
es_un: en cualquier otro caso, las matrices que son ``None`` se llenarán con la matriz ``alpha-alpha``
ja_jp: それ以外の場合は、``None`` の配列は ``alpha-alpha`` 配列で埋められます
ko_kr: 어떤 경우에도 ``None`` 인 배열은 ``alpha-alpha`` 배열로 채워질 것이다.
pt_un: em qualquer outro caso, matrizes que são ``None``serão preenchidas com a matriz `alpha-alpha``
ta_in: வேறு எந்த விஷயத்திலும், ``None`` என்ற அணி ``alpha-alpha`` அணிகளால் நிரப்பப்படும்

source: in the ``SO`` basis case, a single numpy array must be specified. Refer to ``TwoBodyElectronicIntegrals.to_spin()`` for its exact formatting.
bn_bn: ``SO`` ভিত্তি ক্ষেত্রে, একটি একক numpy অ্যারে নির্দিষ্ট করা আবশ্যক। এর সঠিক বিন্যাসের জন্য ``TwoBodyElectronicIntegrals.to_spin()`` পড়ুন।
es_un: en el caso de la base ``SO``, se debe especificar una única matriz numérica. Refiérete a ``TwoBodyElectronicIntegrals.to_spin()`` para conocer su formato exacto.
ja_jp: ``SO`` 基底の場合、numpy 配列が一つ指定されなければなりません。正確なフォーマットは ``TwoBodyElectronicIntegrals.to_spin()`` を参照してください
ko_kr: ``SO`` 기저의 경우에는 한 개의 numpy 배열이 지정되어야만 한다. 정확한 양식은 ``TwoBodyElectronicIntegrals.to_spin()`` 을 참조하라.
pt_un: no caso da base ``SO``, deve ser especificada uma única matriz numpy. Consulte ``TwoBodyElectronicIntegrals.to_spin()`` para sua formatação exata.
ta_in: ``SO`` அடிப்படை வழக்கில், ஒற்றை எண் வரிசை குறிப்பிடப்பட வேண்டும். அதன் சரியான வடிவமைப்பிற்காக ``TwoBodyElectronicIntegrals.to_spin ()`` ஐப் பார்க்கவும்.

source: ElectronicEnergy
bn_bn: ইলেকট্রনিক শক্তি
ta_in: மின்னணு ஆற்றல்

source: Now we are ready to construct an ``ElectronicEnergy`` instance:
bn_bn: এখন আমরা একটি ``ElectronicEnergy`` উদাহরণ তৈরি করতে প্রস্তুত:
es_un: Ahora estamos listos para construir una instancia de ``ElectronicEnergy``:
ja_jp: さて ``ElectronicEnergy`` インスタンスを構築する準備ができました：
ko_kr: 이제 우리는 ``ElectronicEnergy`` 인스턴스를 구성할 준비가 되었다:
pt_un: Agora nós estamos prontos para construir uma instancia de ``ElectronicEnergy``:
ta_in: இப்போது நாம் ``ElectronicEnergy`` உதாரணத்தை உருவாக்கத் தயாராக உள்ளோம்:

source: This property can now be used to construct a ``SecondQuantizedOp`` (which can then be mapped to a ``QubitOperator``):
bn_bn: এই বৈশিষ্ট্য এখন একটি ``SecondQuantizedOp`` (যা তারপর একটি ``QubitOperator`` এ ম্যাপ করা যেতে পারে) নির্মাণ করতে ব্যবহার করা যেতে পারে:
es_un: Esta propiedad ahora se puede usar para construir un ``SecondQuantizedOp`` (que luego se puede mapear a un ``QubitOperator``):
ja_jp: このプロパティは ``SecondQuantizedOp`` を構築するために使用できます。(そして ``QubitOperator`` にマップできます)：
ko_kr: 이제 이 특성을 사용하여 ``SecondQuantizedOp`` 를 생성할 수 있다 (이는 이후 ``QubitOperator`` 에 맵핑될 수 있음):
pt_un: A pode ser usada agora para construir um ``SecondQuantizedOp`` (que pode então ser mapeado para ``QubitOperator``):
ta_in: இந்த சொத்தை இப்போது ``SecondQuantizedOp`` ஐ உருவாக்க பயன்படுத்தலாம் (பின்னர் அதை ``QubitOperator`` க்கு வரைபடமாக்கலாம்):

source: Result interpretation
bn_bn: ফলাফল ব্যাখ্যা
es_un: Interpretación del resultado
ja_jp: 結果の解釈
ko_kr: 결과 해석
pt_un: Interpretação do resultado
ta_in: முடிவு விளக்கம்

source: An additional benefit which we gain from the ``Property`` framework, is that the result interpretation of a computed eigenvalue can be handled by each property itself. This results in nice and logically consistent classes because the result gets interpreted in the same context where the raw data is available.
bn_bn: একটি অতিরিক্ত সুবিধা যা আমরা ``বৈশিষ্ট্য`` কাঠামো থেকে লাভ করি, তা হল একটি গণিত আইগেনভ্যালুর ফলাফল ব্যাখ্যা প্রতিটি বৈশিষ্ট্য নিজেই পরিচালনা করতে পারে। এটি সুন্দর এবং যৌক্তিকভাবে সামঞ্জস্যপূর্ণ ক্লাসে ফলাফল দেয় কারণ ফলাফলটি একই প্রসঙ্গে ব্যাখ্যা করা হয় যেখানে অপরিমার্জিত তথ্য (ডেটা) পাওয়া যায়।
es_un: Un beneficio adicional que obtenemos del framework ``Property`` es que la interpretación del resultado de un valor propio calculado puede ser manejada por cada propiedad en sí. Esto da como resultado clases agradables y lógicamente consistentes porque el resultado se interpreta en el mismo contexto donde están disponibles los datos sin procesar.
ja_jp: ``Property`` フレームワークから得られる追加の恩恵は、算出された固有値の結果解釈がプロパティそれ自身で処理できることです。この結果は、生データと同じコンテキストで解釈されるため、精密で論理的に一貫したクラスになります。
ko_kr: ``Property`` 프레임워크에서 얻을 수 있는 추가적인 이점은 계산된 고유값의 결과 해석을 각 특성 자체에서 처리할 수 있다는 점이다. 결과는 원시 데이터를 사용할 수 있는 동일한 맥락에서 해석되기 때문에, 이는 좋고 논리적으로 일관된 클래스를 생성한다.
pt_un: Um benefício adicional que obtemos da estrutura ``Property``, é que a interpretação do resultado de um autovalor calculado pode ser manipulado por cada propriedade em si. Isto resulta em classes agradáveis e logicamente consistentes pois estes resultados são interpretados no mesmo contexto em que os dados brutos são utilizados.
ta_in: ``Property`` கட்டமைப்பிலிருந்து நாம் பெறும் கூடுதல் நன்மை என்னவென்றால், கணக்கிடப்பட்ட ஈஜென்வெல்யூவின் முடிவு விளக்கத்தை ஒவ்வொரு சொத்தாலும் கையாள முடியும். இது நல்ல மற்றும் தர்க்கரீதியாக சீரான வகுப்புகளில் விளைகிறது, ஏனெனில் பதனிடப்படாதத் தரவு கிடைக்கும் அதே சூழலில் இதன் விளைவாக விளக்கப்படுகிறது.

source: While this particular example is not yet very impressive, wait until we use more properties at once.
bn_bn: যদিও এই বিশেষ উদাহরণটি এখনও খুব চিত্তাকর্ষক নয়, ততক্ষণ অপেক্ষা করুন যতক্ষণ না আমরা একবারে আরও বৈশিষ্ট্য ব্যবহার করি।
es_un: Si bien este ejemplo en particular aún no es muy impresionante, espera hasta que usemos más propiedades a la vez.
ja_jp: この例はまだそれほど印象的ではありませんが、同時に多くのプロパティを使用するまで待ってください。
ko_kr: 이 특정 예제가 아직 매우 인상적이지는 않지만, 한 번에 더 많은 특성을 사용할 때까지 기다리자.
pt_un: Embora este exemplo em particular ainda não seja muito impressionante, aguarde até utilizarmos mais propriedades de uma vez.
ta_in: இந்த குறிப்பிட்ட உதாரணம் இன்னும் மிகவும் ஈர்க்கக்கூடியதாக இல்லை என்றாலும், ஒரே நேரத்தில் அதிக பண்புகளைப் பயன்படுத்தும் வரை காத்திருக்கவும்.

source: ParticleNumber
bn_bn: কণাসংখ্যা
ta_in: பகுதி எண்

source: The ``ParticleNumber`` property also takes a special place among the builtin properties because it serves a dual purpose of:
bn_bn: ``ParticleNumber`` বৈশিষ্ট্য অন্তর্নির্মিত বৈশিষ্ট্যের মধ্যে একটি বিশেষ স্থান নেয় কারণ এটি একটি দ্বৈত উদ্দেশ্যে কাজ করে:
es_un: La propiedad ``ParticleNumber`` también ocupa un lugar especial entre las propiedades integradas porque tiene un doble propósito:
ja_jp: ``ParticleNumber`` プロパティは２つの目的を果たすため、組み込みプロパティのなかでも特別です：
ko_kr: ``ParticleNumber`` 특성은 다음과 같은 이중 목적을 제공하기 때문에 내장 특성 중에서 특별한 위치를 차지한다.
pt_un: A propriedade ``ParticleNumber`` também ocupa um lugar especial entre as propriedades integradas porque serve a um duplo propósito:
ta_in: ``ParticleNumber`` சொத்து கட்டப்பட்ட பண்புகளில் ஒரு சிறப்பு இடத்தைப் பெறுகிறது, ஏனெனில் இது இரட்டை நோக்கத்திற்காக செயல்படுகிறது:

source: storing the number of particles in the electronic system
bn_bn: ইলেকট্রনিক সিস্টেমে কণার সংখ্যা সংরক্ষণ করা
es_un: almacenar el número de partículas en el sistema electrónico
ja_jp: 電子系の粒子数を格納します
ko_kr: 전자 시스템에 입자의 수를 저장하는 것
pt_un: armazenando o número de partículas no sistema eletrônico
ta_in: மின்னணு அமைப்பில் உள்ள துகள்களின் எண்ணிக்கையை சேமித்தல்

source: providing the operators to evaluate the number of particles for a given eigensolution of the problem
bn_bn: অপারেটরদের সমস্যার প্রদত্ত eigensolution এর জন্য কণার সংখ্যা মূল্যায়ন করার জন্য প্রদান করা
es_un: proveer los operadores que evalúan el número de partículas para una determinada resolución del problema
ja_jp: 与えられた問題の固有解のための粒子数を評価する演算子を提供します
ko_kr: 문제의 주어진 고유해결책을 위해 입자의 수를 평가하는 연산자를 제공하는 것
pt_un: fornecer os operadores que avaliam o número de partículas para determinar uma solução automática do problema
ta_in: கொடுக்கப்பட்ட பிரச்சனைக்குத் தேவையான துகள்களின் எண்ணிக்கையை மதிப்பீடு செய்ய ஆபரேட்டர்களை வழங்குதல்

source: Therefore, this property is required if you want to use additional functionality like the ``ActiveSpaceTransformer`` or the ``ElectronicStructureProblem.default_filter_criterion()``.
bn_bn: অতএব, যদি আপনি ``ActiveSpaceTransformer`` বা ``ElectronicStructureProblem.default_filter_criterion()`` এর মতো অতিরিক্ত কার্যকারিতা ব্যবহার করতে চান তবে এই বৈশিষ্ট্য প্রয়োজন।
es_un: Por lo tanto, esta propiedad es necesaria si desea utilizar funciones adicionales como ``ActiveSpaceTransformer`` o el ``ElectronicStructureProblem.default_filter_criterion()``.
ja_jp: そのため、``ActiveSpaceTransformer`` または ``ElectronicStructureProblem.default_filter_criterion()`` のような追加機能を使う場合には、このプロパティが必要です。
ko_kr: 따라서 이 특성은 ``ActiveSpaceTransformer`` 또는``ElectronicStructureProblem.default_filter_criterion()`` 과 같은 추가 기능을 사용하려는 경우에 필요하다.
pt_un: Portanto, esta propriedade é necessária caso deseje utilizar funcionalidades adicionais como ``ActiveSpaceTransformer`` ou ``ElectronicStructureProblem.default_filter_criterion()``.
ta_in: எனவே, ``ActiveSpaceTransformer`` அல்லது ``ElectronicStructureProblem.default_filter_criterion()`` போன்ற கூடுதல் செயல்பாடுகளை நீங்கள் பயன்படுத்த விரும்பினால் இந்த சொத்து தேவைப்படுகிறது.

source: GroupedProperty
bn_bn: গোষ্ঠীভুক্ত বৈশিষ্ট্য
ta_in: குழுவாக்கப்பட்ட சொத்து

source: Rather than iterating all of the other properties one by one, let us simply consider a group of properties as provided by any ``ElectronicStructureDriver`` from the ``qiskit_nature.drivers.second_quantization`` module.
bn_bn: একের পর এক অন্যান্য সমস্ত বৈশিষ্ট্যের পুনরাবৃত্তি করার পরিবর্তে, আসুন আমরা ``qiskit_nature.drivers.second_quantization`` মডিউল থেকে যে কোনও ``ElectronicStructureDriver`` দ্বারা প্রদত্ত বৈশিষ্ট্যের একটি গ্রুপ বিবেচনা করি।
es_un: En lugar de iterar todas las demás propiedades una por una, consideremos simplemente un grupo de propiedades como las proporciona cualquier ``ElectronicStructureDriver`` del módulo ``qiskit_nature.drivers.second_quantization``.
ja_jp: 他の全てのプロパティを一つ一つ繰り返すのではなく、``qiskit_nature.drivers.second_quantization`` モジュールの中の ``ElectronicStructureDriver`` で提供されるプロパティのグループを考えてみましょう。
ko_kr: 다른 모든 특성을 하나씩 반복하기 보다는 ``qiskit_nature.drivers.second_quantization`` 모듈에서 ``ElectronicStructureDriver`` 가 제공하는 특성 그룹을 간단히 살펴보자.
pt_un: Ao invés de iterar todas as outras propriedades uma a uma, vamos simplesmente considerar um grupo de propriedades como fornecido por qualquer ``ElectronicStructureDriver`` do módulo ``qiskit_nature.drivers.second_quantization``.
ta_in: மற்ற அனைத்து பண்புகளையும் ஒவ்வொன்றாக மீண்டும் செய்வதற்குப் பதிலாக, ``qiskit_nature.drivers.second_quantization`` தொகுதியிலிருந்து எந்தவொரு ``ElectronicStructureDriver`` வழங்கிய பண்புகளின் குழுவைக் கருத்தில் கொள்வோம்.

source: There is a lot going on but with the explanations above you should not have any problems with understanding this output.
bn_bn: অনেক কিছু চলছে কিন্তু উপরের ব্যাখ্যাগুলির সাথে আপনার এই আউটপুটটি বুঝতে কোনও সমস্যা হওয়া উচিত নয়।
es_un: Están sucediendo muchas cosas, pero con las explicaciones anteriores no deberías tener ningún problema para comprender este resultado.
ja_jp: 多くのことが進行していますが、上述の説明によって、この出力を理解することに何の問題もありません。
ko_kr: 많은 일이 진행되고 있지만 위의 설명으로 이 출력을 이해하는 데 문제가 없을 것이다.
pt_un: Há muita coisa acontecendo, mas com as explicações acima, você não deve ter problemas em entender esta saída.
ta_in: நிறைய நடக்கிறது ஆனால் மேலே உள்ள விளக்கங்களுடன் இந்த வெளியீட்டைப் புரிந்துகொள்வதில் உங்களுக்கு எந்தப் பிரச்சினையும் இருக்கக் கூடாது.

source: Constructing a Hamiltonian from raw integrals
bn_bn: অপরিমার্জিত সমাকলন থেকে একটি হ্যামিল্টোনিয়ান নির্মাণ
es_un: Construir un Hamiltoniano a partir de integrales sin procesar
ja_jp: 生の積分からのハミルトニアンの構成
ko_kr: 원시 적분에서 해밀톤 만들기
pt_un: Construindo um Hamiltoniano a partir de uma integral crua
ta_in: மூல ஒருங்கிணைப்புகளிலிருந்து ஒரு ஹாமில்டோனியனை உருவாக்குதல்

source: If you have obtained some raw one- and two-body integrals by means other than through a driver provided by Qiskit Nature, you can still easily construct an ``ElectronicEnergy`` property to serve as your access point into the stack:
bn_bn: যদি আপনি Qiskit Nature কর্তৃক প্রদত্ত ড্রাইভারের মাধ্যমে অন্য কোন অপরিমার্জিত এক এবং দুই-দেহের ইন্টিগ্রাল অর্জন করে থাকেন, তাহলে আপনি স্ট্যাকের মধ্যে আপনার প্রবেশাধিকার পয়েন্ট হিসেবে কাজ করার জন্য সহজেই একটি "ইলেক্ট্রনিক এনার্জি" বৈশিষ্ট্য তৈরি করতে পারেন:
es_un: Si has obtenido algunas integrales sin procesar de uno y dos cuerpos por medios distintos a un controlador proporcionado por Qiskit Nature, aún puedes construir fácilmente una propiedad ``ElectronicEnergy`` para que sirva como tu punto de acceso a la pila:
ja_jp: Qiskit Nature のドライバー以外の方法でいくつかの生の１体積分と２体積分を得ている場合でも、 ``ElectronicEnergy`` プロパティをスタックへのアクセスポイントとして簡単に構築することができます：
ko_kr: Qiskit Nature에서 제공하는 드라이버 이외의 수단을 사용하여 일부 원시 1- 및 2-body 적분을 얻은 경우에는, 여전히 ``ElectronicEnergy`` 특성을 쉽게 구성하여 스택에 액세스 지점으로 사용할 수 있다:
pt_un: Se você obteve algumas integrais brutas de um e dois corpos por meios diferentes de um driver fornecido pela Qiskit Nature, você ainda pode construir facilmente uma propriedade ``ElectronicEnergy`` para servir como seu ponto de acesso na pilha:
ta_in: Qiskit நேச்சரால் வழங்கப்பட்ட ஒரு டிரைவர் மூலமாக அல்லாமல் சில மூல மற்றும் இரண்டு-உடல் ஒருங்கிணைப்புகளை நீங்கள் பெற்றிருந்தால், உங்கள் அணுகல் புள்ளியாக ஸ்டேக்கிற்கு சேவை செய்ய ``ElectronicEnergy`` சொத்தை எளிதாக உருவாக்கலாம்:

source: Vibrational Second Quantization Properties
bn_bn: দ্বিতীয় কম্পন কোয়ান্টাইজেশন বৈশিষ্ট্য
es_un: Propiedades de la Segunda Cuantización Vibratoria
ja_jp: 振動的第二量子化プロパティ
ko_kr: 진동 2차 양자화 특성
pt_un: Propriedades de Segunda Quantização Vibracional
ta_in: அதிர்வு இரண்டாவது அளவுப்படுத்தல் பண்புகள்

source: The ``vibrational`` stack for vibrational structure calculations also integrates with the Property framework. After the above introduction you should be able to understand the following directly:
bn_bn: কম্পন কাঠামোর গণনার জন্য ``vibrational`` স্ট্যাকটি সম্পত্তি কাঠামোর সাথে একীভূত হয়। উপরোক্ত পরিচয়ের পরে আপনি নিম্নলিখিতগুলি সরাসরি বুঝতে সক্ষম হবেন:
es_un: La pila ``vibrational`` para cálculos de estructura vibratoria también se integra con el framework Property. Después de la introducción anterior, deberías poder comprender lo siguiente directamente:
ja_jp: 振動構造計算のための ``vibrational`` スタックもプロパティ・フレームワークに統合されています。上記の紹介によって、以下のことが理解できるでしょう：
ko_kr: 진동 구조 계산을 위한 ``vibrational`` 스택은 또한 Property 프레임워크와 통합된다. 위의 소개 후에 다음을 직접 이해할 수 있어야 한다:
pt_un: A pilha ``vibrational`` para cálculos de estrutura vibracional também se integra com o framework Property. Após a introdução acima, você deve ser capaz de entender o seguinte diretamente:
ta_in: அதிர்வு கட்டமைப்பு கணக்கீடுகளுக்கான ``vibrational`` ஸ்டேக் சொத்து கட்டமைப்போடு ஒருங்கிணைக்கிறது. மேலே உள்ள அறிமுகத்திற்குப் பிறகு நீங்கள் பின்வருவனவற்றை நேரடியாகப் புரிந்துகொள்ள முடியும்:

source: For vibrational structure calculations we always need to define the basis which we want to work in, separately:
bn_bn: কম্পন কাঠামোর গণনার জন্য আমাদের সর্বদা যে ভিত্তিতে আমরা কাজ করতে চাই তা সংজ্ঞায়িত করতে হবে, আলাদাভাবে:
es_un: Para los cálculos de estructura vibratoria siempre necesitamos definir la base en la que queremos trabajar, por separado:
ja_jp: 振動構造計算のために、常に別々に基底を定義する必要があります。
ko_kr: 진동 구조 계산의 경우, 항상 다음과 같이 작업하고자 하는 기저를 정의해야 한다:
pt_un: Para os cálculos de estrutura vibracional nós sempre necessitamos definir a base na qual queremos trabalhar, separadamente:
ta_in: அதிர்வு கட்டமைப்புக் கணக்கீடுகளுக்கு நாம் எப்போதும் வேலை செய்ய விரும்பும் அடிப்படையை தனித்தனியாக வரையறுக்க வேண்டும்:

source: Writing custom Properties
bn_bn: বিশেষায়িত (কাস্টম) প্রোপার্টি লেখা
es_un: Escribir Propiedades personalizadas
ja_jp: カスタムプロパティの記述
ko_kr: 사용자 정의 Properties 작성하기
pt_un: Escrevendo propriedades personalizadas
ta_in: தனிப்பயன் பண்புகளை எழுதுதல்

source: You can extend the Property framework with your own implementations. Here, we will walk through the simple example of constructing a Property for the *electronic density*. Since this observable is essentially based on matrices, we will be leveraging the ``OneBodyElectronicIntegrals`` container to store the actual density matrix.
bn_bn: আপনি আপনার নিজস্ব বাস্তবায়নের সাথে বৈশিষ্ট্য কাঠামো প্রসারিত করতে পারেন। এখানে, আমরা *ইলেকট্রনিক ঘনত্ব* এর জন্য একটি বৈশিষ্ট্য (Property) তৈরির সহজ উদাহরণ দিয়ে যাব। যেহেতু এই পর্যবেক্ষণযোগ্যটি মূলত ম্যাট্রিক্সের উপর ভিত্তি করে, তাই আমরা প্রকৃত ঘনত্বের ম্যাট্রিক্স সংরক্ষণের জন্য ``OneBodyElectronicIntegrals`` ধারকটি ব্যবহার করব।
es_un: Puedes ampliar el framework Property con tus propias implementaciones. Aquí, veremos el ejemplo simple de construir una propiedad para la *densidad electrónica*. Dado que este observable se basa esencialmente en matrices, aprovecharemos el contenedor ``OneBodyElectronicIntegrals`` para almacenar la matriz de densidad real.
ja_jp: 独自の実装でプロパティ・フレームワークを拡張することができます。ここでは *電子密度* のためのプロパティを構成する単純な例を見ていきます。この観測可能量は基本的に配列に基づいているため ``OneBodyElectronicIntegrals`` コンテナを活用して実際の密度行列を格納します。
ko_kr: 사용자 고유의 구현으로 Property 프레임워크를 확장할 수 있다. 여기에서는 *전자 밀도* 에 대한 특성을 구성하는 간단한 예제를 살펴보겠다. 이러한 전망이 근본적으로 행렬을 기반으로 하기 때문에, 우리는 ``OneBodyElectronicIntegrals`` 컨테이너를 활용하여 실제 밀도 행렬을 저장할 것이다.
pt_un: Você pode estender a estrutura da Property com suas próprias implementações. Aqui, vamos percorrer o exemplo simples de construção de uma propriedade para a * densidade eletrônica *. Uma vez que este observável é essencialmente baseado em matrizes, iremos alavancar o contêiner ``OneBodyElectronicIntegrals`` para armazenar a matriz de densidade real.
ta_in: உங்கள் சொந்த செயலாக்கங்களுடன் சொத்து கட்டமைப்பை நீட்டிக்க முடியும். *electronic density* ஒரு சொத்தை உருவாக்குவதற்கான எளிய எடுத்துக்காட்டு வழியாக இங்கே நடப்போம். இந்த கவனிக்கத்தக்கது அடிப்படையில் மெட்ரிக்குகளை அடிப்படையாகக் கொண்டிருப்பதால், உண்மையான அடர்த்தி மேட்ரிக்ஸை சேமிக்க ``OneBodyElectronicIntegrals`` கொள்கலனை நாங்கள் மேம்படுத்துவோம்.

source: Of course, the above example is very minimal and can be extended at will.
bn_bn: অবশ্যই, উপরের উদাহরণটি খুবই ন্যূনতম এবং ইচ্ছায় বাড়ানো যেতে পারে।
es_un: Por supuesto, el ejemplo anterior es mínimo y puede ampliarse a voluntad.
ja_jp: もちろん、上記の例は最小限であり、自由に拡張できます。
ko_kr: 물론, 위 예는 매우 최소이며 확장될 수 있다.
pt_un: Claro, o exemplo acima é mínimo e pode ser extendido à vontade.
ta_in: நிச்சயமாக, மேலே உள்ள எடுத்துக்காட்டு மிகக் குறைவு மற்றும் விருப்பப்படி நீட்டிக்கப்படலாம்.

source: **Note:** as of Qiskit Nature version 0.2.0, the direct integration of custom Property objects into the stack is not implemented yet, due to limitations of the auxiliary operator parsing. See https://github.com/Qiskit/qiskit-nature/issues/312 for more details.
bn_bn: ** দ্রষ্টব্য: ** কিস্কিট প্রকৃতি সংস্করণ 0.2.0 অনুযায়ী, সহায়ক অপারেটর বিশ্লেষণের সীমাবদ্ধতার কারণে স্ট্যাকের মধ্যে কাস্টম প্রপার্টি অবজেক্টের সরাসরি সংহতকরণ এখনও বাস্তবায়িত হয়নি। আরো বিস্তারিত জানার জন্য https://github.com/Qiskit/qiskit-nature/issues/312 দেখুন।
es_un: **Nota:** a partir de la versión 0.2.0 de Qiskit Nature, la integración directa de los objetos Property personalizados en la pila aún no está implementada, debido a las limitaciones del análisis del operador auxiliar. Consulta https://github.com/Qiskit/qiskit-nature/issues/312 para obtener más detalles.
ja_jp: **注記：** Qiskit Nature バージョン 0.2.0 では、補助演算子のパースの制限により、カスタムプロパティ・オブジェクトをスタックに直接統合することはまだ実装されていません。詳細は https://github.com/Qiskit/qiskit-nature/issues/312 を見てください。
ko_kr: **참고:** Qiskit Nature 버전 0.2.0의 경우, 보조 연산자 구문 분석의 제한사항으로 인해 사용자 정의 특성 객체를 스택으로 직접 통합하는 작업이 아직 구현되지 않았다. 자세한 내용은 https://github.com/Qiskit/qiskit-nature/issues/312 를 참조.
pt_un: **Nota:** a partir do Qiskit Nature versão 0.2.0, a integração direta de objetos de propriedade personalizados na pilha ainda não foi implementada, devido às limitações da análise do operador auxiliar. Consulte https://github.com/Qiskit/qiskit-nature/issues/312 para obter mais detalhes.
ta_in: **Note:** Qiskit நேச்சர் பதிப்பு 0.2.0 படி, துணை ஆபரேட்டர் பாகுபடுத்தலின் வரம்புகள் காரணமாக, தனிப்பயன் சொத்து பொருள்களை ஸ்டாக்கில் நேரடியாக ஒருங்கிணைப்பது இன்னும் செயல்படுத்தப்படவில்லை. மேலும் விவரங்களுக்கு https://github.com/Qiskit/qiskit-nature/issue/312 ஐப் பார்க்கவும்.
