Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/08_qcschema.po
Languages: es_un, ja

source: This page was generated from `docs/tutorials/08_qcschema.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/08_qcschema.ipynb`__.
ja: このページは `docs/tutorials/08_qschema.ipynb`__ から生成されました。

source: The `QCSchema <https://github.com/MolSSI/QCSchema>`__ is a standard data format for quantum chemistry. The current version of it which has been adopted by multiple classical chemistry codes, only supports serialization via ``JSON``, but their docs clearly indicate that ``HDF5`` may also be used. Thus, in Qiskit Nature, we have opted for implementing support for both hierarchical data formats.
es_un: El `QCSchema <https://github.com/MolSSI/QCSchema>`__ es un formato de datos estándar para la química cuántica. La versión actual, que ha sido adoptada por varios códigos de química clásica, solo admite la serialización a través de ``JSON``, pero sus documentos indican claramente que también se puede usar ``HDF5``. Por ello, en Qiskit Nature hemos optado por implementar soporte para ambos formatos de datos jerárquicos.
ja: `QCSchema <https://github.com/MolSSI/QCSchema>`__ は、量子化学のための標準データフォーマットです。 複数の古典的な化学コードで採用されている現在のバージョンは、 ``JSON`` によるシリアル化のみをサポートしていますが、ドキュメントには ``HDF5`` も使用できると明確に示されています。 そのため、Qiskit Natureでは両方の階層的データフォーマットを実装サポートすることにしました。

source: Now, why do we have a tutorial specifically about this format you may wonder? The reason is fairly simple: this is the data format which our drivers use internally to transfer data between the classical computation and Qiskit Nature. Thus, this tutorial will explain a few concepts, in case you want to get a bit more elaborate with your driver interaction.
es_un: Ahora bien, ¿por qué tenemos un tutorial específicamente sobre este formato? La razón es bastante simple: este es el formato de datos que nuestros controladores (drivers) utilizan internamente para transferir datos entre la computación clásica y Qiskit Nature. Por lo tanto, este tutorial explicará algunos conceptos, en caso de que quieras ser un poco más elaborado con tu interacción con el controlador.
ja: さて、なぜこのフォーマットについて特にチュートリアルがあるのでしょうか？ 理由は非常に簡単です。古典計算と Qiskit Nature の間でデータをやりとりするために私たちのドライバーが内部で使用しているデータフォーマットであるからです。 したがって、このチュートリアルでは、いくつかの概念を説明することで、ドライバの相互作用をもう少し詳しく知ることができるようにします。

source: **Note:** the support for electronic-repulsion integrals as part of the QCSchema is not yet part of the official specification and, thus, custom to Qiskit Nature. But we are working with the QCSchema authors to make this integration official!
es_un: **Nota:** la compatibilidad con integrales de repulsión electrónica como parte de QCSchema aún no forma parte de la especificación oficial y, por lo tanto, está personalizada para Qiskit Nature. ¡Pero estamos trabajando con los autores de QCSchema para que esta integración sea oficial!
ja: **注意:** QCSchemaの一部としての電子反発積分のサポートは、まだ公式仕様に含まれていないため、Qiskit Natureにカスタム化されています。しかし、QCSchemaの作者と協力してこの統合を公式にするために作業しています。

source: For the purposes of this tutorial, we are using the ``PySCFDriver``, but most discussion points should apply to the other electronic structure drivers, too.
es_un: Para los propósitos de este tutorial, estamos usando el ``PySCFDriver``, pero la mayoría de los puntos de discusión también deberían aplicarse a los otros controladores de estructura electrónica.
ja: このチュートリアルでは、 ``PySCFDriver`` を使用していますが、ほとんどの議論ポイントは他の電子構造ドライバにもあてはまるはずです。

source: First, let us construct a ``PySCFDriver`` and run it:
es_un: Primero, construyamos un ``PySCFDriver`` y ejecutémoslo:
ja: まず、``PySCFDriver`` を構築して実行してみましょう。

source: This is basically short for the following:
es_un: Esto es básicamente la abreviatura de lo siguiente:
ja: これは基本的に次のような短いものです：

source: There are two things to note here: - the problem is specifically requested in the MO basis - dipole integrals are handled separately (because the current QCSchema standard does not support these coefficients)
es_un: Hay dos cosas a tener en cuenta aquí: - el problema se solicita específicamente en la base de MO - las integrales de dipolo se manejan por separado (porque el estándar QCSchema actual no admite estos coeficientes)
ja: ここで注意すべきことが2つあります。- この問題は、特にMO基底で要求されています。双極子積分は別に扱われます (現在のQCSchema標準では、これらの係数をサポートしていないため)。

source: What this means for you as an end-user, is that you can also request the problem in another basis like so:
es_un: Lo que esto significa para ti como usuario final, es que también puedes solicitar el problema en otra base de la siguiente manera:
ja: これがエンドユーザーにとってどういうことを意味するかというと、以下のような別の方法で問題をリクエストすることもできるということです。

source: If you now want to transform an AO problem into the MO basis, you need to use the ``BasisTransformer`` which is explained in `a separate tutorial <05_problem_transformers.ipynb>`__.
es_un: Si ahora deseas transformar un problema de AO a la base de MO, necesitas usar ``BasisTransformer`` que se explica en `un tutorial separado <05_problem_transformers.ipynb>`__.
ja: AO の問題を MO ベースに変換したい場合は、 `個別のチュートリアル <05_problem_transformers.ipynb>`__ で説明されている ``BasisTransformer`` を使用する必要があります。

source: This is the point, where you need to understand that the ``to_problem`` method actually relies on the ``to_qcschema`` method internally:
es_un: Este es el punto, en el que debes comprender que el método ``to_problem`` en realidad se basa internamente en el método ``to_qcschema``:
ja: ここで、``to_problem`` メソッドが実際には ``to_qcschema`` メソッドに内部的に依存していることを理解する必要があります。

source: Specifically extracting the QCSchema object from the driver allows you to later extract a ``BasisTransformer`` from it, without having to manually dig out the AO-2-MO transformation coefficients from the depths of the driver object:
es_un: Específicamente, extraer el objeto QCSchema del controlador te permite extraer más tarde un ``BasisTransformer`` de él, sin tener que extraer manualmente los coeficientes de transformación AO-2-MO de las profundidades del objeto del controlador:
ja: QCSchema オブジェクトをドライバーから抽出することにより、後で ``BasisTransformer`` を抽出することができます。 ドライバーオブジェクトの深いところから AO-2-MO 変換係数を手動で掘り起こす必要はありません。
