Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/09_Protein_Folding.po
Languages: bn_bn, es_un, ja_jp, ko_kr, pt_un, ta_in

source: This page was generated from `docs/tutorials/09_Protein_Folding.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/09_Protein_Folding.ipynb`__ থেকে বানানো হয়েছে।
es_un: Esta página fue generada a partir de `docs/tutorials/09_Protein_Folding.ipynb`__.
ja_jp: このページは `docs/tutorials/09_Protein_Folding.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/04_grover_optimizer.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/09_Protein_Folding.ipynb`__.
ta_in: இந்தப் பக்கம் `docs/tutorials/09_Protein_Folding.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Protein Folding
bn_bn: প্রোটিন ফোল্ডিং
es_un: Plegamiento de Proteínas
ja_jp: タンパク質の折りたたみ
ko_kr: 단백질 접힘
pt_un: Enovelamento de Proteínas
ta_in: புரத மடிப்பு

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
ja_jp: はじめに
ko_kr: 소개
pt_un: Introdução
ta_in: முன்னுரை

source: The structure and function of many natural and human-engineered proteins is still only poorly understood. As a result, our understanding of processes connected with protein folding, such as those encountered in Alzheimer’s disease, vaccine development, and crop improvement research, has remained limited.
bn_bn: অনেক প্রাকৃতিক এবং মানব-প্রকৌশলী প্রোটিনের গঠন এবং কার্যকারিতা এখনও দুর্বলভাবে বোঝা যায়। ফলস্বরূপ, প্রোটিন ভাঁজের সাথে সংযুক্ত প্রক্রিয়াগুলির সম্পর্কে আমাদের বোঝার, যেমন Alzheimer রোগ, ভ্যাকসিন উন্নয়ন এবং ফসলের উন্নতি নিয়ে গবেষণা সীমিত রয়ে গেছে।
es_un: La estructura y función de muchas proteínas naturales y creadas por humanos todavía es poco entendido. Como resultado, nuestra comprensión de los procesos relacionados con el plegamiento de proteínas, como los que se encuentran en la enfermedad de Alzheimer, el desarrollo de vacunas y la investigación de mejoramiento de cultivos, sigue siendo limitada.
ja_jp: 多くの自然界および人工のタンパク質の構造と機能は、まだほとんど理解されていません。その結果、アルツハイマー病やワクチン開発、農作物改良研究などでみられる、たんぱく質折りたたみに関連する理解に限りがあります。
ko_kr: 천연 단백질이든 개량된 단백질이든, 단백질의 구조와 기능은 아직 이해되지 못한 부분이 많이 있다. 그 결과, 알츠하이머, 백신 개발 및 작물 개량 연구등에서 직면하는 단백질 접힘과 관련된 프로세스에 대한 이해가 아직 완전하지 않다.
pt_un: A estrutura e função de muitas proteínas naturais e de engenharia humana ainda são mal compreendidas. Como resultado, nossa compreensão dos processos relacionados ao enovelamento de proteínas, como aqueles encontrados na doença de Alzheimer, desenvolvimento de vacinas, e pesquisa de melhoria de safra, tem permanecido limitada.
ta_in: பல இயற்கை மற்றும் மனிதனால் உருவாக்கப்பட்ட புரதங்களின் அமைப்பு மற்றும் செயல்பாடு இன்னும் சரியாக புரிந்து கொள்ளப்படவில்லை. இதன் விளைவாக, அல்சைமர் நோய், தடுப்பூசி வளர்ச்சி மற்றும் பயிர் மேம்பாட்டு ஆராய்ச்சி போன்ற புரத மடிப்புன் தொடர்புடைய செயல்முறைகளைப் பற்றிய நமது புரிதல் குறைவாகவே உள்ளது.

source: Unfolded polypeptides have a very large number of degrees of freedom and thus an enormous number of potential conformations. For example, a chain with :math:`100` aminoacids has on the order of :math:`10^{47}` conformations. In reality, however, many proteins fold to their native structure within seconds. This is known as Levinthal’s paradox [1].
bn_bn: আনফোল্ড করা পলিপেপটাইডগুলির একটি খুব বড় সংখ্যক স্বাধীনতার ডিগ্রি রয়েছে এবং এইভাবে বিপুল সংখ্যক সম্ভাব্য গঠন। উদাহরণস্বরূপ, একটি শৃঙ্খল :math:`100` অ্যামিনো অ্যাসিডের ক্রমে :math:`10^{47}` কনফরমেশন রয়েছে। বাস্তবে, তবে, অনেক প্রোটিন সেকেন্ডের মধ্যে তাদের স্থানীয় গঠনে ভাঁজ করে। এটি লেভিন্থালের প্যারাডক্স [১] নামে পরিচিত।
es_un: Los polipéptidos desplegados tienen un gran número de grados de libertad y, por tanto, un enorme número de conformaciones potenciales. Por ejemplo, una cadena con :math:`100` aminoácidos tiene conformaciones del orden de :math:`10^{47}`. En realidad, sin embargo, muchas proteínas se pliegan a su estructura nativa en segundos. Esto se conoce como la paradoja de Levinthal [1].
ja_jp: 折り畳まれていないポリペプチドは自由度が非常に高く、このため潜在的な配座が非常に多く存在します。 例えば、 :math:`100` のアミノ酸鎖には、 :math:`10^{47}` のオーダーの配座があります。しかし現実には、多くのタンパク質は数秒のうちに固有の構造に折りたたまれます。これはレヴィンタールのパラドックス [1] として知られています。
ko_kr: 접히지 않은 폴리펩타이드는 매우 많은 수의 자유도를 갖고, 따라서 엄청난 수의 잠재적인 형태를 갖는다. 예를 들어, :math:`100` 개의 아미노산을 갖는 사슬은 :math:`10^{47}` 개의 형태의 순서로 되어 있다. 그러나, 실제로, 많은 단백질이 수 초 내에 그들의 천연 구조로 접는다. 이것은 Levinthal의 패러독스 [1]로 알려져 있다.
pt_un: Polipeptídeos não dobrados têm um número muito grande de graus de liberdade e, portanto, um número enorme de conformações potenciais. Por exemplo, uma cadeia com :math:`100` aminoácidos tem conformações da ordem de :math:`10^{47}`. Na realidade, entretanto, muitas proteínas se dobram à sua estrutura nativa em segundos. Isso é conhecido como Paradoxo de Levinthal [1].
ta_in: விரிவடையாத பாலிபெப்டைடுகள் மிகப் பெரிய அளவிலான சுதந்திரத்தைக் கொண்டுள்ளன, இதனால் ஏராளமான சாத்தியமான இணக்கங்கள் உள்ளன. உதாரணமாக, ஒரு கணிதம் :math:`100` அமினோஅசிட்களின் வரிசையில் உள்ளது :math:`10^{47}` இணக்கங்கள். உண்மையில், இருப்பினும், பல புரதங்கள் அவற்றின் சொந்த அமைப்பை நொடிகளில் மடித்து விடுகின்றன. இது லெவிந்தலின் முரண்பாடு என்று அழைக்கப்படுகிறது [1].

source: The exponential growth of potential conformations with chain length makes the problem intractable for classical computers. In the quantum framework, our resource-efficient algorithm scales linearly with the number of aminoacids N.
bn_bn: শৃঙ্খল দৈর্ঘ্যের সাথে সম্ভাব্য গঠনগুলির সূচকীয় বৃদ্ধি সমস্যাটি ক্লাসিক্যাল কম্পিউটারের জন্য জটিল করে তোলে। কোয়ান্টাম কাঠামোতে, আমাদের রিসোর্স-সাশ্রয়ী অ্যালগরিদম অ্যামিনো অ্যাসিড N এর সংখ্যার সাথে রৈখিকভাবে স্কেল করে।
es_un: El crecimiento exponencial de las conformaciones potenciales con la longitud de la cadena hace que el problema sea insoluble para las computadoras clásicas. En el marco cuántico, nuestro algoritmo de uso eficiente de los recursos escala linealmente con el número de aminoácidos N.
ja_jp: 鎖の長さによる潜在的な配座の数が指数関数的に増加するため、古典コンピューターではこの問題は解決することができません。量子のフレームワークでは、リソース効率の良いアルゴリズムは、アミノ酸の数 N に対して線形にスケールします。
ko_kr: 사슬 길이를 갖는 잠재적인 형태의 지수적인 성장은 고전 컴퓨터에 대해 문제를 해결한다. 양자 프레임워크에서, 우리의 자원 효율적인 알고리즘은 아미노산 N의 수에 따라 선형으로 확장한다.
pt_un: O crescimento exponencial de conformações potenciais com comprimento de cadeia torna o problema intratável para computadores clássicos. No framework quântico, nosso algoritmo eficiente em recursos escala linearmente com o número de aminoácidos N.
ta_in: சங்கிலி நீளத்துடன் சாத்தியமான இணக்கங்களின் அதிவேக வளர்ச்சி கிளாசிக்கல் கணினிகளுக்கு சிக்கலை தீர்க்க முடியாததாக ஆக்குகிறது. குவாண்டம் கட்டமைப்பில், அமினோஅசிட்கள் N இன் எண்ணிக்கையுடன் எங்கள் வள-திறனுள்ள வழிமுறை அளவிடப்படுகிறது.

source: The goal of this work is to determine the minimum energy conformation of a protein. Starting from a random configuration, the protein’s structure is optimized to lower the energy. This can be achieved by encoding the protein folding problem into a qubit operator and ensuring that all physical constraints are satisfied.
bn_bn: এই কাজের লক্ষ্য হল প্রোটিনের ন্যূনতম শক্তির গঠন নির্ধারণ করা। একটি এলোমেলো কনফিগারেশন থেকে শুরু করে, প্রোটিনের কাঠামো শক্তি হ্রাস করার জন্য অনুকূলিত হয়। এটি একটি কিউবিট অপারেটরে প্রোটিন ভাঁজ সমস্যা এনকোড করে এবং সমস্ত বাহ্যিক সীমাবদ্ধতা সন্তুষ্ট করা নিশ্চিত করে অর্জন করা যেতে পারে।
es_un: El objetivo de este trabajo es determinar la conformación energética mínima de una proteína. A partir de una configuración aleatoria, la estructura de la proteína se optimiza para reducir la energía. Esto se puede lograr codificando el problema de plegamiento de proteínas en un operador qubit y asegurando que se satisfagan todas las limitaciones físicas.
ja_jp: 今回の目的はタンパク質の最小エネルギー配座を決定することです。ランダム構成から始め、タンパク質の構造をエネルギーを下げるように最適化します。これはタンパク質折りたたみ問題を量子ビット演算子に符号化し、すべての物理的制約を満足させることによって達成することができます。
ko_kr: 이 작업의 목적은 단백질의 최소 에너지 형태를 결정하는 것이다. 무작위 배열로부터 시작하여, 단백질의 구조는 에너지를 낮추도록 최적화된다. 이는 단백질 접힘 문제를 큐비트 연산자로 인코딩하고 모든 물리적 제약이 충족되는 것을 보장함으로써 달성될 수 있다.
pt_un: O objetivo deste trabalho é determinar a conformação energética mínima de uma proteína. A partir de uma configuração aleatória, a estrutura da proteína é otimizada para reduzir a energia. Isso pode ser alcançado codificando o problema de enovelamento de proteína em um operador qubit e garantindo que todas as restrições físicas sejam satisfeitas.
ta_in: இந்த வேலையின் குறிக்கோள் ஒரு புரதத்தின் குறைந்தபட்ச ஆற்றல் இணக்கத்தை தீர்மானிப்பதாகும். ஒரு சீரற்ற கட்டமைப்பிலிருந்து தொடங்கி, ஆற்றலைக் குறைக்க புரதத்தின் அமைப்பு உகந்ததாக உள்ளது. புரத மடிப்பு சிக்கலை ஒரு க்யூபிட் ஆபரேட்டராக குறியாக்கம் செய்வதன் மூலமும், அனைத்து உடல் தடைகளும் திருப்தி அடைவதை உறுதி செய்வதன் மூலமும் இதை அடைய முடியும்.

source: For the problem encoding we use:
bn_bn: সমস্যা এনকোডিং এর জন্য আমরা ব্যবহার করি:
es_un: Para la codificación del problema usamos:
ja_jp: 問題のエンコーディングには以下を使用します：
ko_kr: 문제 인코딩의 경우 다음을 사용한다:
pt_un: Para a codificação do problema usamos:
ta_in: சிக்கல் குறியாக்கத்திற்கு நாங்கள் பயன்படுத்துகிறோம்:

source: Configuration qubits: qubits that are used to describe the configurations and the relative position of the different beads
bn_bn: কনফিগারেশন কিউবিট: এমন কিউবিট যা কনফিগারেশন এবং বিভিন্ন পুঁতির আপেক্ষিক অবস্থান বর্ণনা করতে ব্যবহৃত হয়
es_un: Qubits de configuración: qubits que se utilizan para describir las configuraciones y la posición relativa de los diferentes puntos
ja_jp: 配置量子ビット: 配置および異なるビーズ間の相対位置を記述する量子ビット
ko_kr: Configuration 큐비트: 설정 및 다른 구슬의 상대적 위치를 설명하는 데 사용되는 큐비트
pt_un: Qubits de configuração: qubits que são usados para descrever as configurações e a posição relativa das diferentes contas
ta_in: உள்ளமைவு வினாக்கள்: உள்ளமைவுகள் மற்றும் வெவ்வேறு மணிகளின் சார்புடைய நிலையை விவரிக்கப் பயன்படும் க்யூபிட்கள்

source: Interaction qubits: qubits that encode interactions between the different aminoacids
bn_bn: ইন্টারঅ্যাকশন কিউবিট: এমন কিউবিট যা বিভিন্ন অ্যামিনোএসিডের মধ্যে মিথস্ক্রিয়া এনকোড করে
es_un: Qubits de interacción: qubits que codifican interacciones entre los diferentes aminoácidos
ja_jp: 相互作用量子ビット: 異なるアミノ酸の相互作用をエンコードする量子ビット
ko_kr: 상호작용 큐비트: 상이한 아미노산들 사이의 상호작용을 인코딩하는 큐비트
pt_un: Qubits de interação: qubits que codificam interações entre os diferentes aminoácidos
ta_in: இன்டராக்ஷன் கியூபிட்ஸ்: வெவ்வேறு அமினோஆசிட்களுக்கு இடையேயான தொடர்புகளை குறியாக்கம் செய்யும் கியூபிட்ஸ்

source: For our case we use a tetrahedral lattice (diamond shape lattice) where we encode the movement through the configuration qubits (see image below).
bn_bn: আমাদের ক্ষেত্রে আমরা একটি টেট্রাহেড্রাল ল্যাটিস (হীরার আকৃতির ল্যাটিস) ব্যবহার করি যেখানে আমরা যান্ত্রিক বিন্যাস (কনফিগারেশন) কিউবিটের মাধ্যমে আন্দোলনকে এনকোড করি (নিচের চিত্রটি দেখুন)।
es_un: Para nuestro caso usamos un enrejado tetraédrico (enrejado en forma de diamante) donde codificamos el movimiento mediante los qubits de configuración (ver imagen a continuación).
ja_jp: 今回は四面体格子(ダイヤモンド形状格子) を使用し、配置量子ビットで運動をエンコードします。(下図参照)
ko_kr: 우리의 경우에는 configuration 큐비트를 통해 움직임을 인코딩하는 사면체 격자 (다이아몬드 모양 격자) 를 사용한다 (아래 이미지 참조).
pt_un: Para nosso caso usamos uma rede tetraédrica (rede em forma de diamante) onde codificamos o movimento através dos qubits de configuração (veja a imagem abaixo).
ta_in: எங்கள் விஷயத்தில் நாங்கள் டெட்ராஹெட்ரல் லட்டீஸை (வைர வடிவ லேட்டிஸ்) பயன்படுத்துகிறோம், அங்கு உள்ளமைவு கியூபிட்களின் மூலம் இயக்கத்தை குறியாக்குகிறோம் (கீழே உள்ள படத்தைப் பார்க்கவும்).

source: The Hamiltonian of the system for a set of qubits :math:`\mathbf{q}=\{\mathbf{q}_{cf}, \mathbf{q}_{in}\}` is
bn_bn: Qubits :math:`\mathbf{q}=\{\mathbf{q}_{cf}, \mathbf{q}_{in}\}` এর একটি সেটের জন্য সিস্টেমের হ্যামিল্টোনিয়ান
es_un: El Hamiltoniano del sistema para un conjunto de qubits :math:`\mathbf{q}=\{\mathbf{q}_{cf}, \mathbf{q}_{in}\}` es
ja_jp: 量子ビットの集合 :math:`\mathbf{q}=\{\mathbf{q}_{cf}, \mathbf{q}_{in}\}` の系のハミルトニアンは以下の通りです。
ko_kr: 큐비트의 모임의 시스템의 해밀톤 :math:`\mathbf{q}=\{\mathbf{q}_{cf}, \mathbf{q}_{in}\}` 은
pt_un: O Hamiltoniano do sistema para um conjunto de qubits :math:`\mathbf{q}=\{\mathbf{q}_{cf}, \mathbf{q}_{in}\}` é
ta_in: கியூபிட்களின் தொகுப்பிற்கான அமைப்பின் ஹாமில்டோனியன் :math:`\mathbf{q}=\{\mathbf{q}_{cf}, \mathbf{q}_{in}\}`

source: where
bn_bn: যেখানে
es_un: donde
ja_jp: ここで
ko_kr: 어디에
pt_un: onde
ta_in: எங்கே

source: :math:`H_{gc}` is the geometrical constraint term (governing the growth of the primary sequence of aminoacids without bifurcations)
bn_bn: :math:`H_{gc}` হল জ্যামিতিক সীমাবদ্ধ পদ (দ্বিবিভাজন ছাড়াই অ্যামিনো অ্যাসিডের প্রাথমিক ক্রমের বৃদ্ধি নিয়ন্ত্রণ করে)
es_un: :math:`H_{gc}` es el término de restricción geométrica (que rige el crecimiento de la secuencia primaria de aminoácidos sin bifurcaciones)
ja_jp: :math:`H_{gc}` は幾何学的制約項 (分岐の無いアミノ酸のプライマリー・シーケンスの成長を統制)です
ko_kr: :math:`H_{gc}` 는 기하학적인 제약 조건이다 (두 갈래로 분리되지 않은 아미노산의 1차 서열의 성장을 통제하는 것)
pt_un: :math:`H_{gc}` é o termo de restrição geométrica (governando o crescimento da sequência primária de aminoácidos sem bifurcações)
ta_in: :math:`H_{gc}` என்பது வடிவியல் கட்டுப்பாட்டு சொல் (பைஃபர்கேஷன்ஸ் இல்லாமல் அமினோஅசிட்களின் முதன்மை வரிசையின் வளர்ச்சியை நிர்வகிக்கிறது)

source: :math:`H_{ch}` is the chirality constraint (enforcing the right stereochemistry for the system)
bn_bn: :math:`H_{ch}` হলো কাইরালিটি সীমাবদ্ধতা (সিস্টেমের জন্য সঠিক স্টেরিওকেমিস্ট্রি প্রয়োগ করে)
es_un: :math:`H_{ch}` es la restricción de quiralidad (imponiendo la estereoquímica correcta para el sistema)
ja_jp: :math:`H_{ch}` はキラリティ制約 (系の正しい立体化学を強制)です
ko_kr: :math:`H_{ch}` 는 카이랄성 제한조건 (시스템에 대한 올바른 입체화학을 적용) 이다.
pt_un: :math:`H_{ch}` é a restrição de quiralidade (reforçando a estereoquímica correta para o sistema)
ta_in: :math:`H_{gc}` என்பது சிராலிட்டி கட்டுப்பாடு (கணினிக்கான சரியான ஸ்டீரியோ கெமிஸ்ட்ரியை செயல்படுத்துகிறது)

source: :math:`H_{in}` is the interaction energy terms of the system. In our case we consider only nearest neighbor interactions.
bn_bn: :math:`H_{in}` হল সিস্টেমের মিথস্ক্রিয়া শক্তির পদ। আমাদের ক্ষেত্রে আমরা শুধুমাত্র নিকটতম প্রতিবেশীর মিথস্ক্রিয়া বিবেচনা করি।
es_un: :math:`H_{in}` son los términos energéticos de interacción del sistema. En nuestro caso, consideramos solo las interacciones de los vecinos más cercanos.
ja_jp: :math:`H_{in}` は系の相互作用エネルギー項です。このケースでは最近接相互作用のみを考慮します。
ko_kr: :math:`H_{in}` 은 시스템의 상호 작용 에너지 조건이다. 우리의 경우에는 가장 가까운 이웃 상호 작용만을 고려한다.
pt_un: :math:`H_{in}` são os termos de energia de interação do sistema. No nosso caso, consideramos apenas as interações com o vizinho mais próximo.
ta_in: :math:`H_{in}` என்பது அமைப்பின் தொடர்பு ஆற்றல் விதிமுறைகள். எங்கள் விஷயத்தில் அருகிலுள்ள அண்டை தொடர்புகளை மட்டுமே நாங்கள் கருதுகிறோம்.

source: Further details about the used model and the encoding of the problem can be found in [2].
bn_bn: ব্যবহৃত মডেল এবং সমস্যার এনকোডিং সম্পর্কে আরও বিশদ [২] পাওয়া যাবে।
es_un: En [2] se pueden encontrar más detalles sobre el modelo utilizado y la codificación del problema.
ja_jp: 問題のモデルとエンコードの詳細は [2] を参照してください。
ko_kr: 사용된 모델 및 문제점의 인코딩에 대한 자세한 내용은 [2]에서 찾을 수 있다.
pt_un: Maiores detalhes sobre o modelo utilizado e a codificação do problema podem ser encontrados em [2].
ta_in: பயன்படுத்தப்பட்ட மாதிரி மற்றும் சிக்கலின் குறியாக்கம் பற்றிய கூடுதல் விவரங்களை [2] இல் காணலாம்.

source: Protein Main Chain
bn_bn: প্রোটিনের প্রধান শিকল
es_un: Cadena Principal de la Proteína
ja_jp: タンパク質の主鎖
pt_un: Cadeia Principal da Proteína
ta_in: புரத முக்கிய சங்கிலி

source: The Protein consists of a main chain that is a linear chain of aminoacids. For the naming of different residues we use the one-letter code as defined in Ref. [3]. Further details about the naming and the type of aminoacids can also be found in [4].
bn_bn: প্রোটিন একটি প্রধান চেইন নিয়ে গঠিত যা অ্যামিনো অ্যাসিডের একটি রৈখিক চেইন। বিভিন্ন অবশিষ্টাংশের নামকরণের জন্য আমরা রেফারে সংজ্ঞায়িত এক অক্ষরের কোড ব্যবহার করি [৩]। নামকরণ এবং অ্যামিনোঅ্যাসিডের ধরন সম্পর্কে আরও বিশদ বিবরণ পাওয়া যাবে [৪]।
es_un: La proteína consta de una cadena principal que es una cadena lineal de aminoácidos. Para nombrar los diferentes residuos usamos el código de una letra como se define en la Ref. [3]. También se pueden encontrar más detalles sobre la denominación y el tipo de aminoácidos en [4].
ja_jp: タンパク質はアミノ酸の線形鎖である主鎖で構成されています。それ以外の残基の命名は [3] で定義されている1文字のコードを使用しました。より詳細なアミノ酸のタイプと命名法は [4] も参照してください。
ko_kr: 단백질은 아미노산의 선형 사슬인 주 사슬로 구성된다. 다른 잔류물의 이름을 지정하기 위해 한 글자의 코드 (Ref. [3]) 를 정의했다. 아미노산의 이름과 유형에 대한 자세한 내용은 [4]에서도 찾을 수 있다.
pt_un: A proteína consiste de uma cadeia principal que é uma cadeia linear de aminoácidos. Para nomear os diferentes resíduos, usamos o código de uma letra, como definido na Ref. [3]. Maiores detalhes sobre a nomenclatura e o tipo dos aminoácidos também podem ser encontrados em [4].
ta_in: புரதம் ஒரு முக்கிய சங்கிலியைக் கொண்டுள்ளது, இது அமினோஅசிட்களின் நேரியல் சங்கிலி ஆகும். வெவ்வேறு எச்சங்களுக்கு பெயரிடுவதற்கு, குறிப்பு [3] ல் வரையறுக்கப்பட்டபடி ஒரு எழுத்து குறியீட்டைப் பயன்படுத்துகிறோம். பெயரிடுதல் மற்றும் அமினோஅசிட்களின் வகை பற்றிய கூடுதல் விவரங்களையும் [4] ல் காணலாம்.

source: For this particular case we demonstrate the generation of the qubit operator in a neuropeptide with the main chain consisting of 7 aminoacids with letter codes APRLRFY (see also [2]).
bn_bn: এই বিশেষ ক্ষেত্রে আমরা একটি নিউরোপেপটাইডে কিউবিট অপারেটরের প্রজন্ম প্রদর্শন করি যার প্রধান চেইনটি 7 টি অ্যামিনোঅ্যাসিড নিয়ে গঠিত যাদের লেটার কোড APRLRFY (এছাড়াও [২] দেখুন)।
es_un: Para este caso particular, demostramos la generación del operador qubit en un neuropéptido con la cadena principal que consta de 7 aminoácidos con códigos de letras APRLRFY (ver también [2]).
ja_jp: この例ではコード APRLRFY を持つ、7 つのアミノ酸で構成された主鎖の神経ペプチドにおける量子演算子の生成をデモンストレーションします([2] 参照)。
ko_kr: 이런 특정한 경우에, APRLRFY (또한 [2]참조) 와 함께 7개의 아미노산으로 구성된 주 사슬을 갖는 신경 펩티드에 큐비트 연산자의 생성을 입증한다.
pt_un: Para este caso particular, demonstramos a geração do operador qubit em um neuropeptídeo com a cadeia principal consistindo de 7 aminoácidos com os códigos de letras APRLRFY (ver também [2]).
ta_in: இந்த குறிப்பிட்ட வழக்கில், நியூரோபெப்டைட்டில் உள்ள க்யூபிட் ஆபரேட்டரின் தலைமுறையை பிரதான சங்கிலியுடன் 7 அமினோஅசிட்களைக் கொண்ட APRLRFY என்ற எழுத்து குறியீடுகளுடன் நாங்கள் காண்பிக்கிறோம் (மேலும் [2] பார்க்கவும்).

source: Side Chains
bn_bn: পার্শ্ব শিকল
es_un: Cadenas Laterales
ja_jp: 側鎖
ko_kr: 사이드 사슬
pt_un: Cadeias Laterais
ta_in: பக்கச் சங்கிலிகள்

source: Beyond the main chain of the protein there may be aminoacids attached to the residues of the main chain. Our model allows for side chains of the maximum length of one. Elongated side chains would require the introduction of additional penalty terms which are still under development. In this example we do not consider any side chains to keep the real structure of the neuropeptide.
bn_bn: প্রোটিনের প্রধান শৃঙ্খল পেরিয়ে মূল শৃঙ্খলের অবশিষ্টাংশের সাথে সংযুক্ত অ্যামিনোঅ্যাসিড থাকতে পারে। আমাদের মডেলটি সর্বাধিক দৈর্ঘ্যের পার্শ্ব শিকলের অনুমতি দেয়। লম্বা পার্শ্ব শিকলের জন্য অতিরিক্ত penalty পদ প্রবর্তনের প্রয়োজন হবে যা এখনও বিকাশাধীন রয়েছে। এই উদাহরণে আমরা নিউরোপেপটাইডের আসল কাঠামো রাখার জন্য কোন পার্শ্ব শিকল বিবেচনা করি না।
es_un: Más allá de la cadena principal de la proteína, puede haber aminoácidos unidos a los residuos de la cadena principal. Nuestro modelo permite cadenas laterales de una longitud máxima de uno. Las cadenas laterales alargadas requerirían la introducción de términos de penalización adicionales que aún están en desarrollo. En este ejemplo, no consideramos ninguna cadena lateral para mantener la estructura real del neuropéptido.
ja_jp: タンパク質の主鎖の先に、主鎖の残基に接続したアミノ酸が存在することがあります。我々のモデルは最大長の側鎖を許容します。細長い側鎖は開発中の追加のペナルティ項の導入が必要になります。この例では神経ペプチドの真の構造を保持するための側鎖は考慮しません。
ko_kr: 단백질의 주 사슬을 넘어서, 주 사슬의 잔여물에 부착된 아미노산이 존재할 수 있다. 모델은 최대 길이의 사이드 체인을 허용한다. 길쭉해진 사이드 사슬은 여전히 개발 중인 추가적인 페널티 용어들의 도입을 필요로 할 것이다. 이 예에서, 신경 펩티드의 실제 구조를 유지하기 위한 어떠한 사이드 사슬도 고려하지 않는다.
pt_un: Além da cadeia principal da proteína, podem haver aminoácidos ligados aos resíduos da cadeia principal. O nosso modelo permite para as cadeias laterais o comprimento máximo de um. Cadeia laterais alongadas necessitariam a introdução de termos de penalidade adicionais que ainda estão em desenvolvimento. Neste exemplo, não consideramos nenhuma cadeia lateral para manter a estrutural real do neuropeptídeo.
ta_in: புரதத்தின் முக்கியச் சங்கிலியைத் தாண்டி, முக்கியச் சங்கிலியின் எச்சங்களுடன் அமினோஅசிட்கள் இணைக்கப்படலாம். எங்கள் மாதிரி ஒன்றின் அதிகபட்ச நீளத்தின் பக்கச் சங்கிலிகளை அனுமதிக்கிறது. நீட்டிக்கப்பட்ட பக்கச் சங்கிலிகளுக்கு இன்னும் வளர்ச்சியில் இருக்கும் கூடுதல் அபராத விதிமுறைகளை அறிமுகப்படுத்த வேண்டும். இந்த எடுத்துக்காட்டில், நியூரோபெப்டைட்டின் உண்மையான அமைப்பை வைத்திருக்க எந்த பக்க சங்கிலிகளையும் நாங்கள் கருத்தில் கொள்ளவில்லை.

source: Interaction between Aminoacids
bn_bn: অ্যামিনোঅ্যাসিডের মধ্যে মিথস্ক্রিয়া
es_un: Interacción entre Aminoácidos
ja_jp: アミノ酸間の相互作用
ko_kr: 아미노산 사이의 상호작용
pt_un: Interação entre Aminoácidos
ta_in: அமினோஅசிட்களுக்கு இடையிலான தொடர்பு

source: For the description of inter-residue contacts for proteins we use knowledge-based (statistical) potentials derived using quasi-chemical approximation. The potentials used here are introduced by Miyazawa, S. and Jernigan, R. L. in [5].
bn_bn: প্রোটিনের জন্য আন্ত-অবশিষ্টাংশের পরিচিতির বিবরণের জন্য আমরা অর্ধ-রাসায়নিক পরিমাপ ব্যবহার করে প্রাপ্ত জ্ঞান-ভিত্তিক (পরিসংখ্যানগত) সম্ভাবনা ব্যবহার করি। এখানে ব্যবহৃত সম্ভাবনাগুলি Miyazawa, S. এবং Jernigan, R. L. [৫] প্রবর্তন করেছেন।
es_un: Para la descripción de los contactos entre residuos de proteínas, utilizamos potenciales basados en el conocimiento (estadístico) derivados mediante aproximación cuasiquímica. Los potenciales utilizados aquí son introducidos por Miyazawa, S. y Jernigan, R. L. en [5].
ja_jp: タンパク質の残基間の接触を記述するため、準化学近似により導出された知識ベースの (統計的) ポテンシャルを使用します。ここで使われるポテンシャルは [5] Miyazawa, S. and Jernigan, R. L. によって導入されました。
ko_kr: 단백질에 대한 잔유물 사이 접촉을 설명하기 위해, 준-화학적 근사화 (quasi-chemical approximation) 를 이용하여 유도된 지식 기반 (통계적) 잠재력을 사용한다. 여기에서 사용되는 잠재력은 문헌 [Miyazawa, S. and Jernigan, R. L. in [5]] 에 도입되어 있다.
pt_un: Para a descrição dos contatos entre resíduos para proteínas, utilizamos potenciais baseados em conhecimento (estatístico) derivados mediante aproximação quase-química. Os potenciais usados aqui são introduzidos por Miyazawa, S. e Jernigan, R. L. em [5].
ta_in: புரோட்டீன்களுக்கு இடையேயான தொடர்புகளின் விளக்கத்திற்கு, அரை-வேதியியல் தோராயத்தைப் பயன்படுத்தி பெறப்பட்ட அறிவு அடிப்படையிலான (புள்ளிவிவர) ஆற்றலைப் பயன்படுத்துகிறோம். இங்கு பயன்படுத்தப்படும் ஆற்றல்கள் மியாசாவா, எஸ். மற்றும் ஜெர்னிகன், ஆர். எல் [5] இல் அறிமுகப்படுத்தப்பட்டது.

source: Beyond this model we also allow for random contact maps (interactions) that provide a random interaction map. One can also introduce a custom interaction map that enhances certain configurations of the protein (e.g. alpha helix, beta sheet etc).
bn_bn: এই মডেলের বাইরে আমরা এলোমেলো যোগাযোগের মানচিত্রের (ইন্টারঅ্যাকশন) অনুমতি দিই যা একটি এলোমেলো মিথস্ক্রিয়া মানচিত্র প্রদান করে। কেউ একটি কাস্টম ইন্টারঅ্যাকশন ম্যাপও প্রবর্তন করতে পারে যা প্রোটিনের নির্দিষ্ট কনফিগারেশন বাড়ায় (যেমন আলফা হেলিক্স, বিটা শীট ইত্যাদি)।
es_un: Más allá de este modelo, también permitimos mapas de contacto aleatorios (interacciones) que proporcionan un mapa de interacción aleatorio. También se puede introducir un mapa de interacción personalizado que mejora ciertas configuraciones de la proteína (por ejemplo, hélice alfa, hoja beta, etc.).
ja_jp: このモデルを超えて、ランダム相互作用マップを提供するランダム接続マップ(相互作用)も可能です。タンパク質の特定の配置 (例：αヘリックス、βシート 等) を強化したカスタム相互作用マップを導入することもできます。
ko_kr: 이 모델 이외에 무작위 상호작용 맵을 제공하는 무작위 컨택 맵 (상호작용) 도 허용한다. 또한, 단백질의 특정 구성 (예를 들어, 알파 나선, 베타 시트 등) 을 향상시키는 맞춤형 상호작용 맵을 도입할 수 있다.
pt_un: Além deste modelo, também permitimos mapas de contato aleatórios (interações) que fornecem um mapa de interação aleatório. Também pode-se introduzir um mapa de interação personalizado que aprimora certas configurações da proteína (por exemplo, hélice alfa, folha beta, etc).
ta_in: இந்த மாதிரிக்கு அப்பால், சீரற்ற தொடர்பு வரைபடத்தை வழங்கும் சீரற்ற தொடர்பு வரைபடங்களையும் (இடைவினைகள்) அனுமதிக்கிறோம். புரதத்தின் சில உள்ளமைவுகளை மேம்படுத்தும் தனிப்பயன் தொடர்பு வரைபடத்தையும் ஒருவர் அறிமுகப்படுத்தலாம் (எ.கா. ஆல்பா ஹெலிக்ஸ், பீட்டா தாள் போன்றவை).

source: Physical Constraints
bn_bn: বাহ্যিক সীমাবদ্ধতা
es_un: Restricciones Físicas
ja_jp: 物理的制約
ko_kr: 물리적 제한조건
pt_un: Restrições Físicas
ta_in: இயற்பியல் கட்டுப்பாடு
