Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/09_Protein_Folding.po
Languages: bn_bn, es_un, ja_jp, ko_kr, pt_un, ta_in

source: To ensure that all physical constraints are respected we introduce penalty functions. The different penalty terms used are:
bn_bn: সমস্ত বাহ্যিক সীমাবদ্ধতা সম্মান করা হয় তা নিশ্চিত করার জন্য আমরা পেনাল্টি ফাংশন চালু করি। ব্যবহৃত বিভিন্ন পেনাল্টি পদ হল:
es_un: Para garantizar que se respeten todas las restricciones físicas, introducimos funciones de penalización. Los diferentes términos de penalización utilizados son:
ja_jp: すべての物理制約が遵守されるように、ペナルティー関数を導入します。使用されている異なるペナルティー項は以下の通りです：
ko_kr: 모든 물리적 구속조건을 만족하기 위해 페널티 함수를 도입한다. 사용되는 서로 다른 페널티 조건은 다음과 같다.
pt_un: Para garantir que todas as restrições físicas sejam respeitadas, introduzimos funções de penalidade. Os diferentes termos de penalidade utilizados são:
ta_in: அனைத்து இயற்பிய தடைகளும் மதிக்கப்படுவதை உறுதி செய்வதற்காக நாங்கள் அபராதம் செயல்பாடுகளை அறிமுகப்படுத்துகிறோம். பயன்படுத்தப்படும் வெவ்வேறு தண்டனை விதிமுறைகள்:

source: penalty_chiral: A penalty parameter used to impose the right chirality.
bn_bn: penalty_chiral: একটি পেনাল্টি প্যারামিটার যা সঠিক কাইরালিটির জন্য ব্যবহৃত হয়।
es_un: penalty_chiral: Un parámetro de penalización utilizado para imponer la quiralidad correcta.
ja_jp: penalty_chiral: 正しいキラリティーを課すために使用されるペナルティー・パラメーター。
ko_kr: penalty_chiral: 올바른 카이랄성을 부과하기 위해 사용되는 페널티 매개변수.
pt_un: penalty_chiral: Um parâmetro de penalidade usado para impor a quiralidade correta.
ta_in: பெனால்டி_சிரல்: சரியான சிராலிட்டியைத் திணிக்கப் பயன்படுத்தப்படும் பெனால்டி அளவுரு.

source: penalty_back: A penalty parameter used to penalize turns along the same axis. This term is used to eliminate sequences where the same axis is chosen twice in a row. In this way we do not allow for a chain to fold back into itself.
bn_bn: penalty_back: একটি পেনাল্টি প্যারামিটার একই অক্ষ বরাবর ঘুরিয়ে পেনাল্টি করতে ব্যবহৃত হয়। এই পদটি ক্রমগুলি দূর করতে ব্যবহৃত হয় যেখানে একই অক্ষ পরপর দুবার নির্বাচিত হয়। এইভাবে আমরা একটি চেইনকে নিজের মধ্যে ভাঁজ করতে দেয় না।
es_un: penalty_back: Un parámetro de penalización que se utiliza para penalizar los giros a lo largo del mismo eje. Este término se utiliza para eliminar secuencias en las que el mismo eje se elige dos veces seguidas. De esta manera, no permitimos que una cadena se doble sobre sí misma.
ja_jp: penalty_back: 同じ軸に沿った回転にペナルティを与えるパラメーター。この項は一行に二回同じ軸が選ばれるシーケンスを排除するために使われます。この方法で鎖がそれ自身の中に折りたたまれることを防ぎます。
ko_kr: penalty_back: 같은 축을 따라 회전하기 위해 사용되는 페널티 매개변수. 이 용어는 동일한 축이 행에서 두 번 선택되는 연속을 제거하는 데 사용된다. 이런 식으로 사슬이 그 자체로 되돌아 가는 것을 허용하지 않는다.
pt_un: penalty_back: Um parâmetro de penalidade usado para penalizar voltas ao longo do mesmo eixo. Este termo é usado para eliminar sequências em que o mesmo eixo é escolhido duas vezes consecutivas. Desta forma, não permitimos que uma cadeia dobre sobre si mesma.
ta_in: பெனால்டி_பேக்: பெனால்டி விதிக்கப் பயன்படுத்தப்படும் பெனால்டி அளவுரு அதே அச்சில் சுழல்கிறது. ஒரே அச்சு தொடர்ச்சியாக இரண்டு முறை தேர்ந்தெடுக்கப்படும் காட்சிகளை அகற்ற இந்த சொல் பயன்படுத்தப்படுகிறது. இந்த வழியில் ஒரு சங்கிலி மீண்டும் மடிவதை நாம் அனுமதிக்க மாட்டோம்.

source: penalty_1: A penalty parameter used to penalize local overlap between beads within a nearest neighbor contact.
bn_bn: penalty_1: নিকটতম প্রতিবেশী সংযোগের পুঁতির মধ্যে স্থানীয় ওভারল্যাপকে penalize করার জন্য ব্যবহৃত একটি পেনাল্টি প্যারামিটার।
es_un: penalty_1: Un parámetro de penalización utilizado para penalizar la superposición local entre puntos dentro de un contacto vecino más cercano.
ja_jp: penalty_1: 最近接接続の局所的なビーズ間の重複にペナルティを与えるパラメーター。
ko_kr: penalty_1: 가장 가까운 접촉 내에서 구슬들 사이의 국부적 겹침을 선고하는데 사용되는 페널티 매개변수.
pt_un: penalty_1: Um parâmetro de penalidade usado para penalizar sobreposição local entre contas dentro de um contato de vizinho mais próximo.
ta_in: பெனால்டி_1: அருகிலுள்ள அண்டை தொடர்புகளுக்குள் உள்ள மணிகளுக்கு இடையில் உள்ளூர் ஒன்றுடன் ஒன்று தண்டிக்கப் பயன்படும் பெனால்டி அளவுரு.

source: Peptide Definition
bn_bn: পেপটাইড সংজ্ঞা
es_un: Definición de Péptido
ja_jp: ペプチドの定義
ko_kr: 펩타이드 정의
pt_un: Definição de Peptídeo
ta_in: பெப்டைட் வரையறை

source: Based on the main chain and possible side chains we define the peptide object that includes all the structural information of the modeled system.
bn_bn: প্রধান চেইন এবং সম্ভাব্য পার্শ্ব চেইনের উপর ভিত্তি করে আমরা পেপটাইড অবজেক্টকে সংজ্ঞায়িত করি যা মডেলিং সিস্টেমের সমস্ত কাঠামোগত তথ্য অন্তর্ভুক্ত করে।
es_un: Con base en la cadena principal y las posibles cadenas laterales definimos el objeto péptido que incluye toda la información estructural del sistema modelado.
ja_jp: 主鎖と可能な側鎖をベースにして、モデル化した系の全ての構造情報を含むペプチド・オブジェクトを定義します。
ko_kr: 주 사슬 및 가능한 사이드 사슬에 기초하여, 모델링된 시스템의 모든 구조적 정보를 포함하는 펩타이드 객체를 정의한다.
pt_un: Com base na cadeia principal e nas possíveis cadeias laterias, definimos o objeto peptídeo que inclui todas as informações estruturais do sistema modelado.
ta_in: முக்கிய வழி மற்றும் சாத்தியமான பக்க வழிகளின் அடிப்படையில், மாதிரி அமைப்பின் அனைத்து கட்டமைப்பு தகவல்களையும் உள்ளடக்கிய பெப்டைட் பொருளை வரையறுக்கிறோம்.

source: Protein Folding Problem
bn_bn: প্রোটিন ভাঁজ সমস্যা
es_un: Problema de Plegamiento de Proteínas
ja_jp: タンパク質の折りたたみ問題
ko_kr: 단백질 접힘 문제
pt_un: Problema de Enovelamento de Proteínas
ta_in: Protein Folding பிரச்சினை

source: Based on the defined peptide, the interaction (contact map) and the penalty terms we defined for our model we define the protein folding problem that returns qubit operators.
bn_bn: সংজ্ঞায়িত পেপটাইড, মিথস্ক্রিয়া (যোগাযোগ মানচিত্র) এবং পেনাল্টি শর্তাবলীর উপর ভিত্তি করে আমরা আমাদের মডেলের জন্য সংজ্ঞায়িত করেছি আমরা প্রোটিন ভাঁজ সমস্যা সংজ্ঞায়িত করি যা কিউবিট অপারেটরদের ফেরত দেয়।
es_un: Basándonos en el péptido definido, la interacción (mapa de contacto) y los términos de penalización que definimos para nuestro modelo, definimos el problema de plegamiento de proteínas que devuelve operadores qubit.
ja_jp: 定義されたペプチドに基づき、我々のモデルのために定義した相互作用(コンタクトマップ) とペナルティ項で、量子演算を返すタンパク質折りたたみ問題を定義します。
ko_kr: 정의된 펩타이드에 기초하여, 상호작용 (접촉 맵) 및 모델에 대해 정의된 페널티 용어를 기반으로, 큐비트 연산자를 반환하는 단백질 접힘 문제를 정의한다.
pt_un: Baseado no peptídeo definido, na interação (mapa de contato) e nos termos de penalidade que definimos para nosso modelo, definimos o problema do enovelamento de proteína que retorna operadores qubit.
ta_in: வரையறுக்கப்பட்ட பெப்டைடு, தொடர்பு (தொடர்பு வரைபடம்) மற்றும் எங்கள் மாதிரிக்கு நாங்கள் வரையறுக்கப்பட்ட அபராத விதிமுறைகளின் அடிப்படையில், க்யூபிட் ஆபரேட்டர்களை வழங்கும் புரத மடிப்பு பிரச்சினை நாங்கள் வரையறுக்கிறோம்.

source: Using VQE with CVaR expectation value for the solution of the problem
bn_bn: সমস্যা সমাধানের জন্য CVaR সম্ভাব্য মান সহ VQE ব্যবহার করা
es_un: Uso de VQE con valor esperado de CVaR para la solución del problema
ja_jp: 問題の解決のための CVaR 期待値での VQE の使用
ko_kr: 문제의 해결책에 대한 CVαR 기대값과 함께 VQE 사용하기
pt_un: Usando o VQE com o valor esperado de CVaR para a solução do problema
ta_in: சிக்கலின் தீர்வுக்கு CVaR எதிர்பார்ப்பு மதிப்புடன் VQE ஐப் பயன்படுத்துதல்

source: The problem that we are tackling has now implemented all the physical constraints and has a diagonal Hamiltonian. For the particular case we are targeting the single bitstring that gives us the minimum energy (corresponding to the folded structure of the protein). Thus, we can use the Variational Quantum Eigensolver with Conditional Value at Risk (CVaR) expectation values for the solution of the problem and for finding the minimum configuration energy [6] . We follow the same approach as in Ref. [2] but here we use COBYLA for the classical optimization part. One can also use the standard VQE or QAOA algorithm for the solution of the problem, though as discussed in Ref. [2] CVaR is more suitable.
bn_bn: আমরা যে সমস্যা মোকাবেলা করছি তা এখন সমস্ত বাহ্যিক সীমাবদ্ধতা বাস্তবায়ন করেছে এবং এর একটি কর্ণ হ্যামিল্টোনিয়ান রয়েছে। বিশেষ ক্ষেত্রে আমরা একক বিটস্ট্রিংকে লক্ষ্য করছি যা আমাদের সর্বনিম্ন শক্তি দেয় (প্রোটিনের ভাঁজ কাঠামোর সাথে সামঞ্জস্যপূর্ণ)। এইভাবে, আমরা সমস্যা সমাধানের জন্য এবং ন্যূনতম কনফিগারেশন শক্তি খুঁজে পেতে ঝুঁকির (সিভিএআর) প্রত্যাশার মান সহ শর্তাধীন মান সহ ভেরিয়েশনাল কোয়ান্টাম আইজেন্সলভার ব্যবহার করতে পারি [৬]। আমরা [2] এর মতো একই পদ্ধতি অনুসরণ করি কিন্তু এখানে আমরা ক্লাসিক্যাল অপটিমাইজেশন অংশের জন্য COBYLA ব্যবহার করি। সমস্যা সমাধানের জন্য কেউ স্ট্যান্ডার্ড VQE বা QAOA অ্যালগরিদম ব্যবহার করতে পারে, যদিও [2] তে আরো উপযুক্ত CVaR আলোচনা করা হয়েছে।
es_un: El problema que estamos abordando ahora ha implementado todas las limitaciones físicas y un Hamiltoniano diagonal. Para el caso particular, estamos apuntando a la cadena de bits única que nos da la energía mínima (correspondiente a la estructura plegada de la proteína). Por lo tanto, podemos utilizar el Solucionador Propio Cuántico Variacional (Variational Quantum Eigensolver) con valor condicional al riesgo (Conditional Value at Risk, CVaR) para la solución del problema y para encontrar la energía de configuración mínima [6]. Seguimos el mismo enfoque que en la Ref. [2] pero aquí usamos COBYLA para la parte clásica de optimización. También se puede utilizar el algoritmo estándar VQE o QAOA para la solución del problema, aunque como se explica en la Ref. [2] CVaR es más adecuado.
ja_jp: 我々が取り組んでいる問題は全ての物理的制約を実装し、そして対角化されたハミルトニアンを持っています。特定のケースでは、(タンパク質の折りたたみ構造に対応する) 最低エネルギーを与える単一のビット列をターゲットにします。こうして、解の期待値の条件付きバリュー・アット・リスク (CVaR) 変分量子固有値ソルバーを使うことができ、最低配置エネルギーを見つけることができます[6]。参考文献 [2] とおなじアプローチをとりましたが、我々はここで古典的最適化に COBYLA を使います。標準的な VQE または QAOA アルゴリズムを使うことも可能ですが、[2] で議論されているように CVaR がより適切です。
ko_kr: 우리가 해결하고 있는 문제는 이제 모든 물리적 제약을 구현하고, 대각선 해밀턴을 가지고 있다. 특정 경우에 있어서, 우리는 (단백질의 접힘 구조에 상응하는) 최소 에너지를 제공하는 단일 비트 문자열을 목표로 하고 있다. 따라서, 문제의 해결을 위한, 그리고 최소 구성 에너지 [6] 를 찾기 위한, Conditional Value at Risk (CVaR) 의 기대값을 갖는 VQE (Variational Quantum Eigensolver) 를 사용할 수 있다. Ref. [2] 와 동일한 접근 방식을 따르지만, 여기에서는 고전적인 최적화 부분에 대해서는 COBYLA를 사용한다. 또한, Ref. [2] CVαR 에 논의된 바와 같이, 문제점의 해결을 위해 표준 VQE 또는 QAOA 알고리즘을 사용할 수 있다.
pt_un: O problema que estamos enfrentando agora implementou todas as restrições físicas e tem um Hamiltoniano diagonal. Para o caso particular, temos como alvo o bitstring único que nos dá a energia mínima (correspondente à estrutura dobrada da proteína). Assim, podemos usar o Variacional Quantum Eigensolver com os valores esperados de Valor Condicional em Risco (CVaR) para a solução do problema e para encontrar a energia mínima de configuração [6] . Seguimos a mesma abordagem da Ref. [2], mas aqui usamos COBYLA para a parte da otimização clássica. Também pode-se uitlizar o algoritmos VQE ou QAOA padrão para a solução do problema, embora, como discutido na Ref. [2], o CVaR seja mais indicado.
ta_in: நாங்கள் சமாளிக்கும் சிக்கல் இப்போது அனைத்து உடல் தடைகளையும் செயல்படுத்தியுள்ளது மற்றும் ஒரு மூலைவிட்ட ஹாமில்டோனியனைக் கொண்டுள்ளது. குறிப்பிட்ட விஷயத்தில், எங்களுக்கு குறைந்தபட்ச ஆற்றலை (புரதத்தின் மடிந்த கட்டமைப்பிற்கு ஒத்ததாக) வழங்கும் ஒற்றை பிட்ஸ்ட்ரிங்கை நாங்கள் குறிவைக்கிறோம். எனவே, சிக்கலைத் தீர்ப்பதற்கும் குறைந்தபட்ச உள்ளமைவு ஆற்றலைக் கண்டுபிடிப்பதற்கும் நிபந்தனை மதிப்பில் (CVaR) எதிர்பார்ப்பு மதிப்புகளுடன் மாறுபாடு குவாண்டம் ஐஜென்சோல்வரைப் பயன்படுத்தலாம் [6] . Ref இல் உள்ள அதே அணுகுமுறையை நாங்கள் பின்பற்றுகிறோம். [2] ஆனால் இங்கே கிளாசிக்கல் தேர்வுமுறை பகுதிக்கு கோபிலாவைப் பயன்படுத்துகிறோம். Ref இல் விவாதிக்கப்பட்டாலும், சிக்கலைத் தீர்க்க நிலையான VQE அல்லது QAOA வழிமுறையையும் ஒருவர் பயன்படுத்தலாம். [2] CVaR மிகவும் பொருத்தமானது.

source: Visualizing the answer
es_un: Visualización de la respuesta
ja_jp: 回答の視覚化
pt_un: Visualizando a resposta

source: In order to reduce computational costs, we have reduced the problem’s qubit operator to the minimum amount of qubits needed to represent the shape of the protein. In order to decode the answer we need to understand how this has been done. \* The shape of the protein has been encoded by a sequence of turns , :math:`\{0,1,2,3\}`. Each turn represents a different direction in the lattice. \* For a main bead of :math:`N_{aminoacids}` in a lattice, we need :math:`N_{aminoacids}-1` turns in order to represent its shape. However, the orientation of the protein is not relevant to its energy. Therefore the first two turns of the shape can be set to :math:`[1,0]` without loss of generality. \* If the second bead does not have any side chain, we can also set the :math:`6^{th}` qubit to :math:`[1]` without breaking symmetry. \* Since the length of the secondary chains is always limited to :math:`1` we only need one turn to describe the shape of the chain.
es_un: Para reducir los costos computacionales, hemos reducido el operador qubit del problema a la cantidad mínima de qubits necesarios para representar la forma de la proteína. Para decodificar la respuesta necesitamos entender cómo se ha hecho esto. \* La forma de la proteína ha sido codificada por una secuencia de vueltas , :math:`\{0,1,2,3\}`. Cada vuelta representa una dirección diferente en la retícula. \* Para una cuenta principal de :math:`N_{aminoacids}` en una retícula, necesitamos :math:`N_{aminoacids}-1` vueltas para representar su forma. Sin embargo, la orientación de la proteína no es relevante para su energía. Por lo tanto, los dos primeros giros de la forma se pueden establecer en :math:`[1,0]` sin pérdida de generalidad. \* Si la segunda cuenta no tiene ninguna cadena lateral, también podemos configurar el :math:`6^{o}` qubit en :math:`[1]` sin romper la simetría. \* Dado que la longitud de las cadenas secundarias siempre está limitada a :math:`1`, solo necesitamos un giro para describir la forma de la cadena.
ja_jp: 計算コストを削減するために、問題の量子ビット演算子を、タンパク質の形状を表すために必要な最小量の量子ビットに削減しました。答えを解読するには、これがどのように行われたかを理解する必要があります。 \* タンパク質の形状は、一連のターン、 :math:`\{0,1,2,3\}` によってエンコードされています。各ターンは、格子内の異なる方向を表します。 \* 格子状の :math:`N_{aminoacids}` のメインビーズの場合、その形状を表すために :math:`N_{aminoacids}-1` ターンが必要です。 ただし、タンパク質の配向はそのエネルギーとは関係ありません。 したがって、形状の最初の2ターンは、一般性を失うことなく設定できます。 \* 2番目のビーズに側鎖がない場合は、対称性を破ることなく6番目の量子ビットを :math:`[1]` に設定することもできます。 \* 二次チェーンの長さは常に1に制限されているため、チェーンの形状を記述するために必要なのは :math:`1` 回転だけです。
pt_un: Para reduzir os custos computacionais, reduzimos o operador de qubit do problema para a quantidade mínima de qubits necessária para representar a forma da proteína. Para decodificar a resposta, precisamos entender como isso foi feito. \* A forma da proteína foi codificada por uma sequência de voltas , :math:`\{0,1,2,3\}`. Cada volta representa uma direção diferente na rede. \* Para uma conta principal de :math:`N_{aminoacids}` em uma rede, precisamos de :math:`N_{aminoacids}-1` voltas para representar sua forma. No entanto, a orientação da proteína não é relevante para sua energia. Portanto, as duas primeiras voltas da forma podem ser definidas como :math:`[1,0]` sem perda de generalidade. \* Se a segunda conta não tiver nenhuma cadeia lateral, também podemos definir o qubit :math:`6^{th}` para :math:`[1]` sem quebrar a simetria. \* Como o comprimento das cadeias secundárias é sempre limitado a :math:`1`, precisamos apenas de uma volta para descrever a forma da cadeia.

source: The total amount of qubits we need to represent the shape of the protein will be :math:`2(N_{aminoacids}-3)` if there is a secondary chain coming out of the second bead or :math:`2(N_{aminoacids}-3) - 1`, otherwise. All the other qubits will remain unused during the optimization process. See:
es_un: La cantidad total de qubits que necesitamos para representar la forma de la proteína será :math:`2(N_{aminoacids}-3)` si hay una cadena secundaria saliendo de la segunda cuenta o :math:`2(N_{aminoacids}-3) - 1`, en caso contrario. Todos los demás qubits permanecerán sin usar durante el proceso de optimización. Ver:
ja_jp: タンパク質の形状を表すために必要な量子ビットの合計量は、2番目のビーズから出ている二次鎖がある場合は :math:`2(N_{aminoacids}-3)` 、そうでない場合は :math:`2(N_{aminoacids}-3) - 1` になります。 他のすべての量子ビットは、最適化プロセス中は未使用のままになります。 見てみましょう。
pt_un: A quantidade total de qubits que precisamos para representar a forma da proteína será :math:`2(N_{aminoacids}-3)` se houver uma cadeia secundária saindo da segunda esfera ou :math:`2(N_ {aminoacids}-3) - 1`, caso contrário. Todos os outros qubits permanecerão sem uso durante o processo de otimização. Ver:

source: Now that we know which qubits encode which information, we can decode the bitstring into the explicit turns that form the shape of the protein.
es_un: Ahora que sabemos qué qubits codifican qué información, podemos decodificar la cadena de bits en los giros explícitos que modelan la forma de la proteína.
ja_jp: どの量子ビットがどの情報をエンコードするかが分かったので、ビット列を明示的に変形させてタンパク質の形に変換することができます。
pt_un: Agora que sabemos quais qubits codificam qual informação, podemos decodificar a bitstring nas voltas explícitas que formam a forma da proteína.

source: From this sequence of turns we can get the cartesian coordinates of each of the aminoacids of the protein.
es_un: De esta secuencia de vueltas podemos obtener las coordenadas cartesianas de cada uno de los aminoácidos de la proteína.
ja_jp: この順序から、タンパク質のアミノ酸それぞれのカルテシア座標を得ることができます。
pt_un: Desta sequência de voltas podemos obteras coordenadas cartesianas de cada um dos aminoácidos da proteína.

source: And finally, we can also plot the structure of the protein in 3D. Note that when rendered with the proper backend this plot can be interactively rotated.
es_un: Y finalmente, también podemos graficar la estructura de la proteína en 3D. Ten en cuenta que cuando se procesa con el backend adecuado, esta gráfica se puede rotar de forma interactiva.
ja_jp: そして最後に、タンパク質の構造を 3Dでプロットすることができます。 適切なバックエンドでレンダリングされる場合、このプロットはインタラクティブに回転させることができます。
pt_un: E finalmente, também podemos plotar a estrutura da proteína em 3D. Note que quando renderizada com o backend adequado, está imagem pode ser rotacionada de forma interativa.

source: And here is an example with side chains.
es_un: Y aquí hay un ejemplo con cadenas laterales.
ja_jp: これはサイド・チェーンの例です
pt_un: E aqui está um exemplo com cadeias laterais.

source: References
bn_bn: তথ্যসূত্র
es_un: Referencias
ja_jp: 参考文献
ko_kr: 참조
pt_un: Referências
ta_in: குறிப்புகள்

source: [1] https://en.wikipedia.org/wiki/Levinthal%27s_paradox
bn_bn: [১] https://en.wikipedia.org/wiki/Levinthal%27s_paradox

source: [2] A.Robert, P.Barkoutsos, S.Woerner and I.Tavernelli, Resource-efficient quantum algorithm for protein folding, NPJ Quantum Information, 2021, https://doi.org/10.1038/s41534-021-00368-4
bn_bn: [২] A.Robert, P.Barkoutsos, S.Woerner and I.Tavernelli, Resource-efficient quantum algorithm for protein folding, NPJ Quantum Information, 2021, https://doi.org/10.1038/s41534-021-00368-4

source: [3] IUPAC–IUB Commission on Biochemical Nomenclature (1972). “A one-letter notation for aminoacid sequences”. Pure and Applied Chemistry. 31 (4): 641–645. doi:10.1351/pac197231040639. PMID 5080161.
bn_bn: [৩] IUPAC–IUB Commission on Biochemical Nomenclature (1972). “A one-letter notation for aminoacid sequences”. Pure and Applied Chemistry. 31 (4): 641–645. doi:10.1351/pac197231040639. PMID 5080161.

source: [4] https://en.wikipedia.org/wiki/Amino_acid
bn_bn: [৪] https://en.wikipedia.org/wiki/Amino_acid

source: [5] S. Miyazawa and R. L.Jernigan, Residue – Residue Potentials with a Favorable Contact Pair Term and an Unfavorable High Packing Density Term for Simulation and Threading, J. Mol. Biol.256, 623–644, 1996, Table 3, https://doi.org/10.1006/jmbi.1996.0114
bn_bn: [৫] S. Miyazawa and R. L.Jernigan, Residue – Residue Potentials with a Favorable Contact Pair Term and an Unfavorable High Packing Density Term for Simulation and Threading, J. Mol. Biol.256, 623–644, 1996, Table 3, https://doi.org/10.1006/jmbi.1996.0114
ta_in: [5] S. Miyazawa and R. L. Jernigan, Residue-Residue Potentials with a Favorable Contact Pair Term and an unfavorable High Packing Density Term for Simulation and Threading, J. Mol. Biol.256, 623-644, 1996, அட்டவணை 3, https://doi.org/10.1006/jmbi.1996.0114

source: [6] P.Barkoutsos, G. Nannichini, A.Robert, I.Tavernelli, S.Woerner, Improving Variational Quantum Optimization using CVaR, Quantum 4, 256, 2020, https://doi.org/10.22331/q-2020-04-20-256
bn_bn: [৬] P.Barkoutsos, G. Nannichini, A.Robert, I.Tavernelli, S.Woerner, Improving Variational Quantum Optimization using CVaR, Quantum 4, 256, 2020, https://doi.org/10.22331/q-2020-04-20-256

source: H(\mathbf{q}) = H_{gc}(\mathbf{q}_{cf}) + H_{ch}(\mathbf{q}_{cf}) + H_{in}(\mathbf{q}_{cf}, \mathbf{q}_{in})
ko_kr: :math:`H(\mathbf{q}) = H_{gc}(\mathbf{q}_{cf}) + H_{ch}(\mathbf{q}_{cf}) + H_{in}(\mathbf{q}_{cf}, \mathbf{q}_{in})`
