Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/09_properties.po
Languages: es_un, ja

source: This page was generated from `docs/tutorials/09_properties.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/09_properties.ipynb`__.
ja: このページは `docs/tutorials/09_properties.ipynb`__ から生成されました。

source: Properties - or - Operator Factories
es_un: Propiedades - o - Fábricas de Operador
ja: プロパティーまたはオペレーター・ファクトリー

source: Qiskit Nature has various built-in "properties". These objects are effectively operator factories, since they allow the programming of operator blueprints based on a minimal set of required information. Some commonly used examples are the ``ParticleNumber``, ``AngularMomentum`` and ``Magnetization`` properties, all of which take only the system size as their only input, and generate a ``SparseLabelOp`` of the required size.
es_un: Qiskit Nature tiene varias "propiedades" integradas. Estos objetos son efectivamente fábricas de operadores, ya que permiten la programación de esquemas de operadores basados en un conjunto mínimo de información requerida. Algunos ejemplos comúnmente utilizados son las propiedades ``ParticleNumber``, ``AngularMomentum`` y ``Magnetization``, todas las cuales toman solo el tamaño del sistema como su única entrada y generan un ``SparseLabelOp`` del tamaño requerido.
ja: Qiskit Natureには様々な「プロパティー（"properties"）」が組み込まれています。これらのオブジェクトは事実上オペレーター・ファクトリーであり、必要最小限の情報に基づいてオペレーターの設計図をプログラミングすることができます。よく使われる例としては、 ``ParticleNumber``, ``AngularMomentum``, ``Magnetization`` プロパティーがあり、これらはすべてシステムサイズのみを入力とし、必要なサイズの ``SparseLabelOp`` を生成することができます。

source: These properties can be registered in a ``problem`` instance which will cause them to be evaluated once a ground state and/or excited states of that problem have been found. In the following, we will explain the general concept of how this works.
es_un: Estas propiedades se pueden registrar en una instancia de ``problem`` que hará que se evalúen una vez que se haya encontrado un estado fundamental y/o estados excitados de ese problema. A continuación, explicaremos el concepto general de cómo funciona esto.
ja: これらのプロパティーは ``problem`` インスタンスに登録することができ、その問題の基底状態や励起状態が見つかると、それらが評価されるようになります。以下では、これがどのように機能するかの一般的な概念を説明します。

source: The ``BaseProblem`` base class dictates the existence of the ``.properties`` attribute on any ``problem`` instance. This attribute is of type ``PropertiesContainer`` which is an object that can hold at most one instance of any ``SparseLabelOpsFactory`` (or property class, as we commonly refer to them).
es_un: La clase base ``BaseProblem`` dicta la existencia del atributo ``.properties`` en cualquier instancia tipo ``problem``. Este atributo es del tipo ``PropertiesContainer``, que es un objeto que puede contener como máximo una instancia de cualquier ``SparseLabelOpsFactory`` (o clase de propiedad, como comúnmente las llamamos).
ja: ベースクラスの ``BaseProblem`` は、すべての ``problem`` インスタンスに ``.properties`` 属性を持たせることを規定しています。この属性は ``PropertiesContainer`` 型で、任意の ``SparseLabelOpsFactory`` (またはproperty クラス) のインスタンスを最大1つまで保持できるオブジェクトです。

source: You can now modify the contents of the ``PropertiesContainer`` to your desire:
es_un: Ahora puedes modificar el contenido de ``PropertiesContainer`` a tu gusto:
ja: ``PropertiesContainer`` の内容を以下のように変更できます。

source: The specific subclasses of ``BaseProblem`` for the various stacks such as `electronic structure <01_electronic_structure.ipynb>`__, `vibrational structure <02_vibrational_structure.ipynb>`__ or `lattice models <10_lattice_models.ipynb>`__ make things even simpler for you, because they provide direct attributes for the built-in properties of Qiskit Nature:
es_un: Las subclases específicas de ``BaseProblem`` para las diversas pilas como la `estructura electrónica <01_electronic_structure.ipynb>`__, la `estructura vibracional <02_vibrational_structure.ipynb>`__ o los `modelos de retícula <10_lattice_models.ipynb>`__ hacen que las cosas sean más simples para ti, porque proporcionan atributos directos para las propiedades integradas de Qiskit Nature:
ja: `電子構造 <01_electronic_structure.ipynb>`__, `振動構造 <02_vibrational_structure.ipynb>`__ または `格子モデル <10_lattice_models.ipynb>`__ などの様々なスタックのための ``BaseProblem`` の特定のサブクラスは、Qiskit Nature の組み込みproperty を直接提供するので、物事をさらに簡単にします。

source: Note that the ``ElectronicDipoleMoment`` is populated by default. To exclude it, you can use the drivers ``to_problem()`` method and provide the ``include_dipole=False`` keyword argument. Refer to the drivers documentation for more details.
es_un: Ten en cuenta que ``ElectronicDipoleMoment`` se completa de forma predeterminada. Para excluirlo, puedes usar el método ``to_problem()`` de los controladores y proporcionar el argumento de palabra clave ``include_dipole=False``. Consulta la documentación de los controladores para obtener más detalles.
ja: デフォルトでは、``ElectronicDipoleMoment`` が設定されています。 除外するには、ドライバーの ``to_problem()`` メソッドを使用し、``include_dipole=False`` キーワード引数を指定します。詳細はドライバーのドキュメントを参照してください。

source: You can see, that all properties come pre-populated except for the ``ElectronicDensity``. But this is easy to add:
es_un: Puedes ver que todas las propiedades vienen precargadas excepto ``ElectronicDensity``. Pero esto es fácil de agregar:
ja: ``ElectronicDensity`` 以外のすべてのプロパティが事前に設定されていますが、これは簡単に追加できます。

source: The same concepts apply to the ``VibrationalStructureProblem`` and the ``LatticeModelProblem``.
es_un: Los mismos conceptos se aplican al ``VibrationalStructureProblem`` y al ``LatticeModelProblem``.
ja: 同じ概念は ``VibrationalStructureProblem`` と ``LatticeModelProblem`` にも適用されます。
