Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/10_lattice_models.po
Languages: es_un, ja_jp, ko, pt_un

source: This page was generated from `docs/tutorials/10_lattice_models.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/10_lattice_models.ipynb`__.
ja_jp: このページは `docs/tutorials/10_lattice_models.ipynb`__ から生成されました。
ko: 이 페이지는 `docs/tutorials/10_lattice_models.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/10_lattice_models.ipynb`__.

source: Lattice models
es_un: Modelos de retícula
ja_jp: 格子モデル
ko: 격자 모형들
pt_un: Modelos de rede

source: Introduction
es_un: Introducción
ja_jp: はじめに
ko: 소개
pt_un: Introdução

source: In quantum physics (including condensed matter physics and high energy physics) we often study models on lattices. For example, when we think about behavior of electrons in a solid, we can study a model defined on a lattice by considering the positions of atoms as lattice points. This notebook demonstrates how we can utilize ``Lattice`` classes to generate various lattice systems such as ``LineLattice``, ``SquareLattice``, ``HyperCubicLattice``, ``TriangularLattice``, and a general lattice. It also includes an example of a lattice model, the Fermi-Hubbard model. We see how we can define the Hamiltonian of the Fermi-Hubbard model for a given lattice using ``FermiHubbardModel`` class.
es_un: En física cuántica (incluida la física de materia condensada y la física de altas energías), a menudo estudiamos modelos en retículas. Por ejemplo, cuando pensamos en el comportamiento de los electrones en un sólido, podemos estudiar un modelo definido en una malla considerando las posiciones de los átomos como puntos de la retícula. Este cuaderno demuestra cómo podemos utilizar las clases ``Lattice`` para generar varios sistemas de retícula como ``LineLattice``, ``SquareLattice``, ``HyperCubicLattice``, ``TriangularLattice`` y una retícula general. También incluye un ejemplo de modelo de retícula, el modelo Fermi-Hubbard. Vemos cómo podemos definir el Hamiltoniano del modelo de Fermi-Hubbard para una retícula determinada usando la clase ``FermiHubbardModel``.
ja_jp: 量子物理学（物性物理学や高エネルギー物理学を含む）では、格子上のモデルを研究することがよくあります。たとえば、固体中の電子の振る舞いを考えるとき、原子の位置を格子点として考えることで、格子上に定義されたモデルを研究することができます。このノートブックは、 ``Lattice`` クラスを利用して、 ``LineLattice`` 、 ``SquareLattice`` 、 ``HyperCubicLattice`` 、 ``TriangularLattice`` 、および一般的な格子などのさまざまな格子システムを生成する方法を示しています。また、格子モデルの例であるフェルミ・ハバードモデルも含まれています。 ``FermiHubbardModel`` クラスを使用して、特定の格子の フェルミ・ハバードモデルモデルのハミルトニアンを定義する方法を確認します。
ko: 양자물리학에서 (응집물질물리학과 고에너지 물리학을 포함) 우리는 종종 격자 모형들을 연구한다. 예를 들어, 고체 내에서 전자의 움직임을 생각해보면, 우리는 원자들의 위치들이 격자점으로 정의된 격자 상에서 전자의 운동을 연구할 수 있다. 본 튜토리얼에서는 ``Lattice`` 클래스를 활용하여 `LineLattice``, ``SquareLattice``, ``HyperCubicLattice``, ``TriangularLattice``, 그리고 일반적인 격자 등 다양한 격자 시스템을 생성할 수 있는 방법을 제시한다. 또한, 격자 모형의 하나인 페르미-허바드 모형 (Fermi-Hubbard model) 의 예시 또한 제시한다. 우리는 ``FermiHubbardModel`` 클래스를 활용하여 주어진 격자에 대한 페르미-허바드 모형의 해밀토니안 (Hamiltonian) 을 어떻게 정의할 수 있는지 다룰 것이다.
pt_un: Na física quântica (incluindo física da matéria condensada e física de alta energia), muitas vezes estudamos modelos em redes. Por exemplo, quando pensamos no comportamento dos elétrons em um sólido, podemos estudar um modelo definido em uma rede considerando as posições dos átomos como pontos da rede. Este notebook demonstra como podemos usar classes ``Lattice`` para gerar vários sistemas de rede como ``LineLattice``, ``SquareLattice``, ``HyperCubicLattice``, ``TriangularLattice`` e uma rede geral. Também inclui um exemplo de modelo de rede, o modelo de Fermi-Hubbard. Vemos como podemos definir o Hamiltoniano do modelo de Fermi-Hubbard para uma dada rede usando a classe ``FermiHubbardModel``.

source: ``LineLattice`` provides a one-dimensional lattice. We can construct a one-dimensional lattice as follows.
es_un: ``LineLattice`` proporciona una retícula unidimensional. Podemos construir una malla unidimensional de la siguiente manera.
ja_jp: ``LineLattice`` は、一次元の格子を提供します。次のように一次元格子を構築することができます。
ko: ``LineLattice`` 클래스는 1차원 격자를 제공한다. 우리는 다음과 같이 1차원 격자를 구성할 수 있다.
pt_un: ``LineLattice`` fornece uma rede unidimensional. Podemos construir uma rede unidimensional da seguinte forma.

source: Here, it is visualized.
es_un: Aquí se visualiza.
ja_jp: ここでは、それが視覚化されています。
ko: 격자를 시각화하면 다음과 같다.
pt_un: Aqui, é visualizada.

source: We can also construct a one-dimensional lattice with the periodic boundary conditions by specifying ``BoundaryCondition.PERIODIC`` as the argument of ``boundary_condition``.
es_un: También podemos construir una retícula unidimensional con las condiciones de frontera periódicas especificando ``BoundaryCondition.PERIODIC`` como argumento de ``boundary_condition``.
ja_jp: また、 ``boundary_condition`` の引数として ``BoundaryCondition.PERIODIC`` を指定することにより、周期境界条件を使用して一次元格子を構築することもできます。
ko: 우리는 ``boundary_condition`` 인자를 ``BoundaryCondition.PERIODIC`` 로 명시함으로써 주기적 경계 조건을 갖는 1차원 격자를 구성할 수도 있다.
pt_un: Nós também podemos construir uma rede unidimensional com as condições de contorno periódicas especificando ``BoundaryCondition.PERIODIC`` como o argumento de ``condição_limite``.

source: When we want to draw the lattice ignoring the boundary conditions, we use the method ``draw_without_boundary``.
es_un: Cuando queremos dibujar la retícula ignorando las condiciones de frontera, usamos el método ``draw_without_boundary``.
ja_jp: 境界条件を無視して格子を描画する場合は、メソッド ``draw_without_boundary`` を使用します。
ko: 경계조건을 무시하고 격자를 그리고 싶을 때에는, ``draw_without_boundary`` 메소드를 사용한다.
pt_un: Quando queremos desenhar a rede ignorando as condições de contorno, usamos o método ``draw_without_boundary``.

source: We can define real or complex weights for the edges of the lattice. This is done by giving a value to the argument ``edge_parameter``. We can also give a value for the self-loops of the lattice by passing the value for ``onsite_parameter``.
es_un: Podemos definir pesos reales o complejos para los bordes de la retícula. Esto se hace dando un valor al argumento ``edge_parameter``. También podemos dar un valor para los auto-bucles de la malla pasando el valor de ``onsite_parameter``.
ja_jp: 格子のエッジに実数または複素数の重みを定義できます。これは、引数 ``edge_parameter`` に値を与えることによって行われます。 ``onsite_parameter`` の値を渡すことにより、格子の自己ループの値を指定することもできます。
ko: 우리는 격자 상의 모서리들에 실수 혹은 복소수 가중치를 정의할 수 있다. 이는 ``edge_parameter`` 인자에 값을 전달함으로써 가능하다. 또한, ``onsite_parameter`` 인자에 값을 전달함으로써 자가 루프 (self-loop) 들의 가중치도 정의할 수 있다.
pt_un: Podemos definir pesos reais ou complexos para as arestas da rede. Isso é feito dando um valor ao argumento ``edge_parameter``. Também podemos dar um valor para os auto-loops da rede passando o valor para ``onsite_parameter``.

source: The connectivity of the lattice can be seen as the adjacency matrix, which is done by ``to_adjacency_matrix``.
es_un: La conectividad de la retícula se puede ver como la matriz de adyacencia, que se logra con ``to_adjacency_matrix``.
ja_jp: 格子の接続性は、 ``to_adjacency_matrix`` によって実行される隣接行列と見なすことができます。
ko: 격자들의 연결 상태는 인접 행렬로 볼 수 있는데, 이는 ``to_adjacency_matrix`` 메소드로 확인 가능하다.
pt_un: A conectividade da rede pode ser vista como a matriz de adjacência, que é feita por ``to_adjacency_matrix``.

source: By setting ``weighted=True``, we obtain a Hermitian matrix whose matrix elements are the weights.
es_un: Al establecer ``weighted=True``, obtenemos una matriz Hermitiana cuyos elementos de matriz son los pesos.
ja_jp: ``weighted=True`` を設定することにより、行列要素が重みとなっているエルミート行列を取得します。
ko: ``weighted=True`` 설정을 통해, 우리는 행렬의 각 원소들이 가중치인 에르미트 행렬을 얻는다.
pt_un: Ao definir ``weighted=True``, obtemos uma matriz Hermitiana cujos elementos da matriz são os pesos.

source: ``SquareLattice`` provides a two-dimensional lattice. Here, we make a two-dimensional lattice with the open boundary conditions.
es_un: ``SquareLattice`` proporciona una retícula bidimensional. Aquí, hacemos una malla bidimensional con las condiciones de frontera abierta.
ja_jp: ``SquareLattice`` は二次元の格子を提供します。ここでは、開いた境界条件で二次元格子を作成します。
ko: ``SquareLattice``는 2차원 격자를 제공한다. 여기서 우리는 열린 경계 조건을 갖는 2차원 격자를 구성한다.
pt_un: ``SquareLattice`` fornece uma rede bidimensional. Aqui, fazemos uma rede bidimensional com as condições de contorno abertas.

source: We can specify the boundary conditions for each direction by setting ``boundary_condition`` as a tuple.
es_un: Podemos especificar las condiciones de frontera para cada dirección estableciendo ``boundary_condition`` como una tupla.
ja_jp: ``border_condition`` をタプルとして設定することにより、各方向の境界条件を指定できます。
ko: 우리는 ``boundary_condition`` 인자를 튜플로 설정함으로써, 각 방향에 대한 경계조건을 명시할 수 있다.
pt_un: Podemos especificar as condições de contorno para cada direção definindo ``boundary_condition`` como uma tupla.

source: Again, we can give weights on the edges and the self-loops of the lattice. Here, it is possible to give weights for each direction as a tuple.
es_un: Nuevamente, podemos dar pesos en los bordes y los auto-bucles de la retícula. Aquí, es posible dar pesos para cada dirección como una tupla.
ja_jp: ここでも、格子のエッジと自己ループに重みを付けることができます。ここでは、各方向にタプルとして重みを付けることができます。
ko: 1차원 격자에서처럼, 우리는 격자 상의 모서리들과 자가 루프들에 가중치를 줄 수 있다. 여기서는, 튜플을 통해 각 방향에 대한 가중치를 주는 것이 가능하다.
pt_un: Novamente, podemos dar pesos nas arestas e nos auto-loops da rede. Aqui, é possível atribuir pesos para cada direção como uma tupla.

source: ``HyperCubicLattice`` is a generalization of ``LineLattice`` and ``SquareLattice``. It provides an arbitrary d-dimensional lattice. Here, we make a three-dimensional lattice of size 3 by 4 by 5 as an example. The size is given as a tuple, and the boundary conditions can be specified for each direction too. In the example, the boundary conditions are open.
es_un: ``HyperCubicLattice`` es una generalización de ``LineLattice`` y ``SquareLattice``. Proporciona una retícula arbitraria d-dimensional. Aquí, hacemos una malla tridimensional de tamaño 3 por 4 por 5 como ejemplo. El tamaño se da como una tupla y las condiciones de frontera también se pueden especificar para cada dirección. En el ejemplo, las condiciones de frontera están abiertas.
ja_jp: ``HyperCubicLattice`` は、 ``LineLattice`` と ``SquareLattice`` を一般化したものです。任意のd次元格子を提供します。ここでは、例としてサイズ 3 x 4 x5 の三次元格子を作成します。サイズはタプルとして指定され、境界条件は方向ごとに指定することもできます。この例では、境界条件は開いています。
ko: ``HyperCubicLattice``은 ``LineLattice``와 ``SquareLattice``의 일반화된 형태이다. 이는 임의의 d차원 격자를 제공한다. 여기서, 우리는 3*4*5 크기의 3차원 격자를 예시로 구성해 본다. 격자의 사이즈는 튜플로 주어지며, 경계 조건들도 각 방향별로 명시할 수 있다. 이 예시에서, 모든 경계 조건은 열린 경계 조건이다.
pt_un: ``HyperCubicLattice`` é uma generalização de ``LineLattice`` e ``SquareLattice``. Ele fornece uma rede d-dimensional arbitrária. Aqui, fazemos uma rede tridimensional de tamanho 3 por 4 por 5 como exemplo. O tamanho é dado como uma tupla, e as condições de contorno também podem ser especificadas para cada direção. No exemplo, as condições de contorno estão abertas.

source: We draw the cubic lattice specifying the positions of the lattice points.
es_un: Dibujamos la retícula cúbica especificando las posiciones de los puntos de la malla.
ja_jp: 格子点の位置を指定して立方格子を描画します。
ko: 다음에서는 격자점들의 위치를 명시하는 3차원 입방체 격자를 그린다.
pt_un: Desenhamos a rede cúbica especificando as posições dos pontos da rede.

source: ``TriangularLattice`` provides a triangular lattice, which can be seen as a two-dimensional lattice with diagonal edges. The argument ``boundary_condition`` can take either “open” or “periodic”.
es_un: ``TriangularLattice`` proporciona una retícula triangular, que puede verse como una malla bidimensional con bordes diagonales. El argumento ``boundary_condition`` puede tomar “open” o “periodic”.
ja_jp: ``TriangularLattice`` は三角形の格子を提供します。これは、対角線のエッジを持つ二次元の格子と見なすことができます。引数 ``boundary_condition`` は、 "open" または "periodic" のいずれかを取ることができます。
ko: ``TriangularLattice``는 대각선 모서리들이 있는 2차원 격자로 볼 수 있는 삼각형 격자를 제공한다. ``boundary_condition`` 인자는 “open” 또는 “periodic”의 값을 가질 수 있다.
pt_un: ``TriangularLattice`` fornece uma rede triangular, que pode ser vista como uma rede bidimensional com arestas diagonais. O argumento ``boundary_condition`` pode ser “ open” ou “ periodic”.

source: General Lattice
es_un: Retícula General
ja_jp: 一般的な格子
ko: 일반적인 격자
pt_un: Rede Geral

source: Above, we have seen translational invariant lattices. Here, we consider a general lattice. We can construct a general lattice consisting of nodes and edges using an instance of PyGraph.
es_un: Arriba, hemos visto retículas invariantes traslacionales. Aquí, consideramos una malla general. Podemos construir una retícula general que consta de nodos y bordes usando una instancia de PyGraph.
ja_jp: 上記では、並進不変格子を見てきました。ここでは、一般的な格子について考えます。PyGraph のインスタンスを使用して、ノードとエッジで構成される一般的な格子を構築できます。
ko: 위에서, 우리는 평행 이동에 의해 불변인 격자들을 보았다. 여기서는, 일반적인 격자를 생각한다. 우리는 PyGraph의 인스턴스를 통해 꼭짓점들과 모서리들로 이루어진 일반적인 격자를 구성할 수 있다.
pt_un: Acima, vimos redes invariantes translacionais. Aqui, consideramos uma rede geral. Podemos construir uma rede geral consistindo de nós e arestas usando uma instância de PyGraph.

source: Here is its visualization.
es_un: Aquí está su visualización.
ja_jp: これがその可視化です。
ko: 다음은 위 격자의 시각화이다.
pt_un: Aqui está a sua visualização.

source: When we want to visualize the self-loops in the lattice, we set ``self_loop`` to True.
es_un: Cuando queremos visualizar los auto-bucles en la retícula, configuramos ``self_loop`` con True.
ja_jp: 格子内の自己ループを視覚化する場合は、 ``self_loop`` を True に設定します。
ko: 격자에서 자가 루프(self-loop) 들을 시각화하고 싶다면, ``self_loop`` 인자를 True로 설정한다.
pt_un: Quando queremos visualizar os auto-loops na rede, configuramos ``self_loop`` para True.

source: The labels of the lattice sites are drawn when ``with_labels`` is True.
es_un: Las etiquetas de los sitios de la retícula se dibujan cuando ``with_labels`` es True.
ja_jp: ``with_labels`` が True の場合、格子サイトのラベルが描画されます。
ko: 격자점들의 레이블은 ``with_labels`` 인자가 True 일때 그려진다.
pt_un: Os rótulos dos sítios da rede são desenhados quando ``with_labels`` é True.

source: The Fermi-Hubbard model
es_un: El modelo Fermi-Hubbard
ja_jp: フェルミ・ハバードモデル
ko: 페르미-허바드 모형
pt_un: O modelo de Fermi-Hubbard

source: The Fermi-Hubbard model is the simplest model describing electrons moving on a lattice and interaction with each other at the same site. The Hamiltonian is given as follows:
es_un: El modelo de Fermi-Hubbard es el modelo más simple que describe los electrones que se mueven en una retícula e interactúan entre sí en el mismo sitio. El Hamiltoniano se da de la siguiente manera:
ja_jp: フェルミ・ハバードモデルは、格子上を移動する電子と同じサイトでの相互作用を表す最も単純なモデルです。ハミルトニアンは次のように与えられます。
ko: 페르미-허바드 (Fermi-Hubbard) 모델은 같은 위치에서만 상호작용이 존재하는 격자 상 전자들의 움직임을 나타나는 가장 간단한 모형이다. 해밀토니안은 다음과 같이 주어진다.
pt_un: O modelo de Fermi-Hubbard é o modelo mais simples que descreve elétrons movendo-se em uma rede e interagindo uns com os outros no mesmo sítio. O hamiltoniano é dado da seguinte forma:

source: where :math:`c_{i, \sigma}^\dagger` and :math:`c_{i, \sigma}` are creation and annihilation operators of fermion at the site :math:`i` with spin :math:`\sigma`. The operator :math:`n_{i, \sigma}` is the number operator, which is defined by :math:`n_{i, \sigma} = c_{i, \sigma}^\dagger c_{i, \sigma}`. The matrix :math:`t_{i, j}` is a Hermitian matrix called interaction matrix. The parameter :math:`U` represents the strength of the interaction.
es_un: donde :math:`c_{i, \sigma}^\dagger` y :math:`c_{i, \sigma}` son operadores de creación y aniquilación de fermiones en el sitio :math:`i` con espín :math:`\sigma`. El operador :math:`n_{i, \sigma}` es el operador de número, que está definido por :math:`n_{i, \sigma} = c_{i, \sigma}^\dagger c_{i, \sigma}`. La matriz :math:`t_{i, j}` es una matriz Hermitiana llamada matriz de interacción. El parámetro :math:`U` representa la fuerza de la interacción.
ja_jp: ここで、 :math:`c_{i, \sigma}^\dagger` と :math:`c_{i, \sigma}` は、スピン :math:`\sigma` を伴うサイト :math:`i` でのフェルミ粒子の生成および消滅演算子です。演算子 :math:`n_{i, \sigma}` は、 :math:`n_{i, \sigma} = c_{i, \sigma}^\dagger c_{i, \sigma}` で定義される個数演算子です。 行列 :math:`t_{i, j}` は、相互作用行列と呼ばれるエルミート行列です。 パラメータ :math:`U` は、相互作用の強さを表します。
ko: 여기서 :math:`c_{i, \sigma}^\dagger` 와 :math:`c_{i, \sigma}`는 위치 :math:`i` 에 있는 스핀 :math:`\sigma`인 페르미온의 생성자와 소멸자이다. :math:`n_{i, \sigma}` 는 수 연산자로, :math:`n_{i, \sigma} = c_{i, \sigma}^\dagger c_{i, \sigma}` 에 의해 정의된다. 행렬 :math:`t_{i, j}` 는 상호작용 행렬이라 불리는 에르미트 행렬이다. 인자 :math:`U` 는 상호작용의 크기를 나타낸다.
pt_un: onde :math:`c_{i, \sigma}^\dagger` e :math:`c_{i, \sigma}` são operadores de criação e aniquilação de férmion no sítio :math:`i` com spin :math: `\sigma`. O operador :math:`n_{i, \sigma}` é o operador de número, que é definido por :math:`n_{i, \sigma} = c_{i, \sigma}^\dagger c_{i, \ sigma}`. A matriz :math:`t_{i, j}` é uma matriz Hermitiana chamada matriz de interação. O parâmetro :math:`U` representa a força da interação.

source: We can generate the corresponding Hamiltonian of a given lattice using ``FermiHubbardModel`` class. Here, we construct the Hamiltonian with uniform interaction and interaction parameters on a two-dimensional lattice.
es_un: Podemos generar el Hamiltoniano correspondiente de una retícula dada usando la clase ``FermiHubbardModel``. Aquí, construimos el Hamiltoniano con interacción uniforme y parámetros de interacción en una malla bidimensional.
ja_jp: ``FermiHubbardModel`` クラスを使用して、特定の格子の対応するハミルトニアンを生成できます。ここでは、二次元格子上に均一な相互作用と相互作用パラメーターを持つハミルトニアンを構築します。
ko: 우리는 ``FermiHubbardModel`` 클래스를 활용해 주어진 격자에 대응되는 해밀토니안을 생성할 수 있다. 여기서, 우리는 2차원 격자에서 균일한 상호작용과 상호작용 인자들을 갖는 해밀토니안을 구성한다.
pt_un: Podemos gerar o Hamiltoniano correspondente de uma dada rede usando a classe ``FermiHubbardModel``. Aqui, construímos o Hamiltoniano com interação uniforme e parâmetros de interação em uma rede bidimensional.

source: To obtain the Hamiltonian in terms of the fermionic operators, we use ``second_q_ops`` method. The Hamiltonian is returned as an instance of ``FermionicOp``.
es_un: Para obtener el Hamiltoniano en términos de los operadores fermiónicos, usamos el método ``second_q_ops``. El Hamiltoniano se devuelve como una instancia de ``FermionicOp``.
ja_jp: フェルミ粒子演算子の観点からハミルトニアンを取得するには、 ``second_q_ops`` メソッドを使用します。ハミルトニアンは ``FermionicOp`` のインスタンスとして返されます。
ko: 해밀토니안을 페르미온형 (fermionic) 연산자들로 나타내기 위해서, 우리는 ``second_q_ops`` 메소드를 사용한다. 해밀토니안은 ``FermionicOp`` 의 인스턴스로 반환된다.
pt_un: Para obter o Hamiltoniano em termos dos operadores fermiônicos, usamos o método ``second_q_ops``. O Hamiltoniano é retornado como uma instância de ``FermionicOp``.

source: Note
es_un: Nota
ja_jp: 注記
ko: 참고
pt_un: Nota

source: The number of fermionic operators required is twice the number of lattice sites because of the spin degrees of freedom.
es_un: El número de operadores fermiónicos requeridos es el doble del número de sitios de retícula debido a los grados de libertad del espín.
ja_jp: スピンの自由度のため、必要なフェルミ粒子演算子の数は格子サイトの数の2倍です。
ko: 필요한 페르미온형 연산자의 수는, 스핀 자유도로 인해 격자점 수의 2배이다.
pt_un: O número de operadores fermiônicos necessários é o dobro do número de sítios da rede por causa dos graus de liberdade de spin.

source: In the implementation, even indexes correspond to up-spin and odd indexes to down-spin.
es_un: En la implementación, los índices pares corresponden a un espín arriba y los índices impares a un espín abajo.
ja_jp: 実装では、偶数インデックスはアップスピンに対応し、奇数インデックスはダウンスピンに対応します。
ko: 구현에 있어서, 짝수 인덱스들은 업-스핀, 홀수 인덱스들은 다운-스핀에 대응된다.
pt_un: Na implementação, os índices pares correspondem ao giro ascendente e os índices ímpares ao giro descendente.

source: ``Lattice`` has weights on its edges, so we can define a general interaction matrix using a Lattice instance. Here, we consider the Fermi-Hubbard model on a general lattice on which non-uniform interaction parameters are given. In this case, the weights of the lattice are regarded as the interaction matrix. After generating the Hamiltonian (``second_q_ops``) we can use a qubit converter to generate the qubit operators and/or use any of the available algorithms to solver the corresponding lattice problem.
es_un: ``Lattice`` tiene pesos en sus bordes, por lo que podemos definir una matriz de interacción general utilizando una instancia de Lattice. Aquí, consideramos el modelo de Fermi-Hubbard en una retícula general en la que se dan parámetros de interacción no uniformes. En este caso, los pesos de la retícula se consideran la matriz de interacción. Después de generar el Hamiltoniano (``second_q_ops``) podemos usar un convertidor de qubit para generar los operadores de qubit y/o usar cualquiera de los algoritmos disponibles para resolver el problema de retícula correspondiente.
ja_jp: ``Lattice`` のエッジには重みがあるため、Latticeインスタンスを使用して一般的な相互作用行列を定義できます。ここでは、不均一な相互作用パラメータが与えられている一般的な格子上のフェルミ・ハバードモデルを検討します。この場合、格子の重みは相互作用行列と見なされます。ハミルトニアン（ ``second_q_ops`` ）を生成した後、量子ビットコンバーターを使用して量子ビット演算子を生成したり、使用可能なアルゴリズムのいずれかを使用して対応する格子問題を解決したりできます。
ko: ``Lattice`` 는 모서리들에 가중치를 갖고 있어, 우리는 Lattice 인스턴스를 활용해 일반적인 상호작용 행렬을 정의할 수 있다. 여기서, 우리는 균일하지 않은 상호작용 인자들이 주어진 일반적인 격자에서 페르미-허바드 모델을 고려한다. 이 경우, 격자 상의 가중치들은 상호작용 행렬로 생각할 수 있다. 해밀토니안을 생성한 후에는 (``second_q_ops``), 큐비트 변환기를 이용해 큐비트 연산자들을 생성하고 활용 가능한 적당한 알고리즘을 이용해 대응되는 격자 문제를 풀 수 있다.
pt_un: ``Lattice`` tem pesos em suas arestas, então podemos definir uma matriz de interação geral usando uma instância de Lattice. Aqui, consideramos o modelo de Fermi-Hubbard em uma rede geral na qual são dados parâmetros de interação não uniformes. Neste caso, os pesos da rede são considerados como a matriz de interação. Após gerar o Hamiltoniano (``second_q_ops``) podemos usar um conversor de qubit para gerar os operadores de qubit e/ou usar qualquer um dos algoritmos disponíveis para resolver o problema de rede correspondente.

source: LatticeModelProblem
ja_jp: 格子モデル問題

source: Qiskit Nature also has a ``LatticeModelProblem`` class which allows the usage of the ``GroundStateEigensolver`` to calculate the ground state energy of a given lattice. You can use this class as follows:
es_un: Qiskit Nature también tiene una clase ``LatticeModelProblem`` que permite el uso del ``GroundStateEigensolver`` para calcular la energía del estado fundamental de una retícula determinada. Puedes usar esta clase de la siguiente manera:
ja_jp: Qiskit Natureには、 ``LatticeModelProblem`` クラスもあります。これにより、 ``GroundStateEigensolver`` を使用して、特定の格子の基底状態エネルギーを計算できます。このクラスは次のように使用できます。
ko: Qiskit Nature에는 ``GroundStateEigensolver`` 를 사용하여 주어진 격자의 바닥 상태 에너지를 계산 할 수 있는``LatticeModelProblem`` 클래스도 있다. 다음과 같이 이 클래스를 사용할 수 있다:
pt_un: Qiskit Nature também tem uma classe ``LatticeModelProblem`` que permite o uso do ``GroundStateEigensolver`` para calcular a energía do estado fundamental de uma grade determinada. Pode usar esta classe da seguinte maneira:
