Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/11_quadratic_hamiltonian_and_slater_determinants.po
Languages: es_un, ko_kr, pt_un, ta

source: This page was generated from `docs/tutorials/11_quadratic_hamiltonian_and_slater_determinants.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/11_quadratic_hamiltonian_and_slater_determinants.ipynb`__.
ko_kr: 이 페이지는 `docs/tutorials/11_quadratic_hamiltonian_and_slater_determinants.ipynb`__ 로 부터 생성되었다.
pt_un: Esta página foi gerada a partir da página `docs/tutorials/11_quadratic_hamiltonian_and_slater_determinants.ipynb`__.
ta: இந்தப் பக்கம் `docs/tutorials/11_quadratic_hamiltonian_and_slater_determinants.ipynb`__. யிலிருந்து உருவாக்கப்பட்டது

source: Quadratic Hamiltonians and Slater determinants
es_un: Hamiltonianos cuadráticos y determinantes de Slater
ko_kr: 이차 해밀토니안과 슬레이터의 결정요인
pt_un: Hamiltonianos quadráticos e determinantes de Slater
ta: இருபடி ஹாமில்டோனியர்கள் மற்றும் ஸ்லேட்டர் தீர்மானிப்பவர்கள்

source: A quadratic Hamiltonian is a Hamiltonian of the form
es_un: Un Hamiltoniano cuadrático es un Hamiltoniano de la forma
ko_kr: 이차 해밀토니안은 다음 형식의 해미토니안이다.
pt_un: Um Hamiltoniano quadrático é um Hamiltoniano da forma
ta: ஒரு இருபடி ஹாமில்டோனியன் என்பது வடிவத்தின் ஹாமில்டோனியன்

source: H = \sum_{j, k} M_{jk} a^\dagger_j a_k + \frac12 \sum_{j, k} (\Delta_{jk} a^\dagger_j a^\dagger_k + \Delta^*_{jk} a_k a_j) + \text{constant}
es_un: H = \sum_{j, k} M_{jk} a^\dagger_j a_k + \frac12 \sum_{j, k} (\Delta_{jk} a^\dagger_j a^\dagger_k + \Delta^*_{jk} a_k a_j) + \text{constante}

source: where :math:`M` is a Hermitian matrix (:math:`M^\dagger = M`) and :math:`\Delta` is an antisymmetric matrix (:math:`\Delta^T = -\Delta`), and the :math:`\{a_j^\dagger\}` are fermionic creation operators which satisfy the anticommutation relations
es_un: donde :math:`M` es una matrix Hermitiana (:math:`M^\dagger = M`) y :math:`\Delta` es una matriz antisimétrica (:math:`\Delta^T = -\Delta`), y los :math:`\{a_j^\dagger\}` son operadores de creación fermiónicos que satisfacen las relaciones de anticonmutación
ko_kr: 여기서 :math:`M` 은 해밀토니안 행렬 (:math:`M^\dagger = M`) 이며 :math:`\Delta` 는 반대칭성 행렬 (:math:`\Delta^T = -\Delta`), 이고 :math:`\{a_j^\dagger\}` 는 반교체 관계를 만족시키는 페르미 생성 연산자이다.
pt_un: onde :math:`M` é uma matriz hermitiana (:math:`M^\dagger = M`) e :math:`\Delta' é uma matriz anti-simétrica (:math:`\Delta^T = -\Delta`), e os :math:`\{a_j^\dagger\} são operadores de criação fermiônicos que satisfazem as relações de anti-comutação
ta: எங்கே :math:`M` ஹெர்மிஷியன் மேட்ரிக்ஸ் ஆகும் (:math:`M^\dagger = M`) மற்றும் :math:`\Delta` ஒரு சமச்சீரற்ற அணி (:math:`\Delta^T = -\Delta`), மற்றும் இந்த :math:`\{a_j^\dagger\}` டாகர் ஃபெர்மியோனிக் கிரியேட்டிவ் ஆபரேட்டர்கள், இவை எதிர்மாற்ற உறவுகளைத் திருப்திப்படுத்துகின்றன

source: Quadratic Hamiltonians are an important class of Hamiltonians that are classically tractable. Their eigenstates are called fermionic Gaussian states, and they can be efficiently prepared on a quantum computer. Qiskit Nature includes the ``QuadraticHamiltonian`` class for representing quadratic Hamiltonians.
es_un: Los Hamiltonianos cuadráticos son una clase importante de Hamiltonianos que son clásicamente tratables. Sus estados propios se denominan estados fermiónicos Gaussianos y se pueden preparar de manera eficiente en una computadora cuántica. Qiskit Nature incluye la clase ``QuadraticHamiltonian`` para representar Hamiltonianos cuadráticos.
ko_kr: 이차 해밀토니안은 고전적으로 다루기 쉬운 해밀토니안의 중요한 분류이다. 이들의 고유 상태를 페르미온 가우스 상태라고 하며, 양자 컴퓨터에서 효율적으로 준비할 수 있다. Qiskit Nature 는 이차 해밀토니안을 나타내는 ``QuadraticHamiltonian`` 클래스를 포함한다.
pt_un: Os Hamiltonianos quadráticos são uma classe importante de Hamiltonianos que são clásicamente tratáveis. Seus eigenstates se chamam estados fermiónicos Gaussianos e podem se preparados de forma eficiente em um computador quântico. Qiskit Nature inclui a classe ``QuadraticHamiltonian`` para representar Hamiltonianos quadráticos.
ta: குவாட்ரேடிக் ஹாமில்டோனியர்கள் என்பது ஹாமில்டோனியர்களின் ஒரு முக்கியமான வகுப்பாகும், அவை பாரம்பரியமாக இழுக்கக்கூடியவை. அவற்றின் ஈஜென்ஸ்டேட்டுகள் ஃபெர்மியோனிக் காசியன் நிலைகள் என்று அழைக்கப்படுகின்றன, மேலும் அவை குவாண்டம் கணினியில் திறமையாகத் தயாரிக்கப்படலாம். கிஸ்கிட் நேச்சர் இருபடி ஹாமில்டோனியர்களைக் குறிக்கும் ``குவாட்ராடிக் ஹாமில்டோனியன்` வகுப்பை உள்ளடக்கியது.

source: Of course, the ``FermionicOp`` class can also be used to represent any quadratic Hamiltonian. The reason to have a class specifically for quadratic Hamiltonians is that they support special numerical routines that involve performing linear algebra on the matrices :math:`M` and :math:`\Delta`. The internal representation format of ``FermionicOp`` is not suitable for these routines.
es_un: Por supuesto, la clase ``FermionicOp`` también se puede utilizar para representar cualquier Hamiltoniano cuadrático. La razón para tener una clase específica para Hamiltonianos cuadráticos es que soporta rutinas numéricas especiales que implican realizar álgebra lineal en las matrices :math:`M` y :math:`\Delta`. El formato de representación interna de ``FermionicOp`` no es adecuado para estas rutinas.
ko_kr: 물론, ``FermionicOp`` 클래스는 임의의 이차 해밀토니안을 나타내는 데 사용될 수 있다. 이차 해밀턴 연산자를 위한 클래스를 갖는 이유는 행렬 :math:`M` 과 :math:`\Delta` 에서 선형 대수를 수행하는 것과 관련된 특별한 숫자 루틴을 지원하기 때문이다. ``FermionicOp`` 의 내부 표현 형식은 이러한 루틴에 적합하지 않다.
pt_un: Claro, a classe ``FermionicOp`` também pode ser usada para representar qualquer Hamiltoniano quadrático. A razão para ter uma classe especificamente para Hamiltonianos quadráticos é que eles suportam rotinas numéricas especiais que envolvem a execução de álgebra linear nas matrizes :math:`M` e :math:`\Delta`. O formato de representação interna do ``FermionicOp`` não é adequado para essas rotinas.
ta: நிச்சயமாக, இந்த ``FermionicOp`` வர்க்கம் எந்த இருபடியான ஹாமில்டோனியனைப் பிரதிநிதித்துவப்படுத்தவும் பயன்படுத்தப்படலாம். க்வாட்ரடிக் ஹாமில்டோனியர்களுக்கு ஒரு வகுப்பைக் கொண்டிருப்பதற்கான காரணம் என்னவென்றால், அவை மெட்ரிக்குகளில் நேரியல் இயற்கணிதத்தை நிகழ்த்துவதை உள்ளடக்கிய சிறப்பு எண் நடைமுறைகளை ஆதரிக்கின்றன :math:`M` மற்றும் math:`\Delta`. ``FermionicOp`` இன் உள் பிரதிநிதித்துவ வடிவம் இந்த நடைமுறைகளுக்குப் பொருந்தாது.

source: A quadratic Hamiltonian is initialized like so:
es_un: Un Hamiltoniano cuadrático se inicializa así:
ko_kr: 이차 해밀토니안은 다음과 같이 초기화된다.
pt_un: Um Hamiltoniano quadrático é inicializado como:
ta: ஒரு இருபடி ஹாமில்டோனியன் இவ்வாறு துவக்கப்படுகிறது:

source: Diagonalization and state preparation
es_un: Diagonalización y preparación de estado
ko_kr: 대각선화 및 상태 준비
pt_un: Diagonalização e preparação de estado
ta: மூலைவிட்டம் மற்றும் மாநில தயாரிப்பு

source: A quadratic Hamiltonian can always be rewritten in the form
es_un: Un Hamiltoniano cuadrático siempre se puede reescribir en la forma
ko_kr: 이차 해밀토니안은 항상 이 형태로 다시 작성될 수 있다.
pt_un: Um Hamiltoniano quadrático pode sempre ser reescrito na forma
ta: ஒரு இருபடி ஹாமில்டோனியன் எப்போதும் வடிவத்தில் மீண்டும் எழுதப்படலாம்

source: H = \sum_{j} \varepsilon_j b^\dagger_j b_j + \text{constant}
es_un: H = \sum_{j} \varepsilon_j b^\dagger_j b_j + \text{constante}

source: where :math:`\varepsilon_0 \leq \varepsilon_1 \leq \cdots \leq \varepsilon_N` are non-negative real numbers called orbitals energies and the :math:`\{b_j^\dagger\}` are a new set of fermionic creation operators that also satisfy the canonical anticommutation relations. These new creation operators are linear combinations of the original creation and annihilation operators:
es_un: donde :math:`\varepsilon_0 \leq \varepsilon_1 \leq \cdots \leq \varepsilon_N` son números reales no negativos llamados energías orbitales y los :math:`\{b_j^\dagger\}` son un nuevo conjunto de operadores fermiónicos de creación que también satisfacen las relaciones canónicas de anticonmutación. Estos nuevos operadores de creación son combinaciones lineales de los operadores de creación y aniquilación originales:
ko_kr: 여기서 :math:`\varepsilon_0 \leq \varepsilon_1 \leq \cdots \leq \varepsilon_N` 은 오비탈 에너지라고 불리는 음이 아닌 실수이고 :math:`\{b_j^\dagger\}` 는 또한 표준 반작용 관계를 만족시키는 새로운 페르미온 생성 연산자이다. 이러한 새로운 생성 연산자는 원래의 생성 연산자와 소멸 연산자의 선형 결합이다:
pt_un: onde :math:`\varepsilon_0 \leq \varepsilon_1 \leq \cdots \leq \varepsilon_N` são números reais não negativos chamados de energias orbitais e :math:`\{b_j^\dagger\}` são um novo conjunto de operadores de criação fermiônicos que também satisfazem as relações de anticomutação canônicas. Esses novos operadores de criação são combinações lineares dos operadores de criação e aniquilação originais:
ta: எங்கே :math:`\varepsilon_0 \leq \varepsilon_1 \leq \cdots \leq \varepsilon_N` ஆர்பிட்டால்ஸ் எனர்ஜிகள் எனப்படும் எதிர்மறை நிஜ எண்கள் :math:`\{b_j^\dagger\}` ஆபரேட்டர் ஃபெர்மியோனிக் கிரியேட்டிவ் ஆபரேட்டர்களின் புதிய தொகுப்பாகும். இந்த புதிய உருவாக்க ஆபரேட்டர்கள் அசல் உருவாக்கம் மற்றும் அழிவு ஆபரேட்டர்களின் நேரியல் சேர்க்கைகள்:

source: where :math:`W` is an :math:`N \times 2N` matrix. Given a basis of eigenvectors of the Hamiltonian, each eigenvector is labeled by a subset of :math:`\{0, \ldots, N - 1\}`, which we call the occupied orbitals. The corresponding eigenvalue is the sum of the corresponding values of :math:`\varepsilon_j`, plus the constant.
es_un: donde :math:`W` es una matriz de :math:`N \times 2N`. Dada una base de vectores propios del Hamiltoniano, cada vector propio está etiquetado por un subconjunto de :math:`\{0, \ldots, N - 1\}`, que llamamos orbitales ocupados. El valor propio correspondiente es la suma de los valores correspondientes de :math:`\varepsilon_j`, más la constante.
ko_kr: 여기서 :math:`W` 는 :math:`N \times 2N` 행렬이다. 해밀토니안의 고유벡터에 기초하여, 각각의 고유벡터는 :math:`\{0, \ldots, N-1\}` 의 부분 집합에 의해 라벨링되어 있으며, 이는 점유된 오비탈 이라고 부른다. 상응하는 고유값은 :math:`\varepsilon_j` 의 상응하는 값과 상수의 합이다.
pt_un: onde :math:`W` é uma matriz :math:`N \times 2N`. Dada uma base de eigenvectors do Hamiltoniano, cada eigenvector é rotulado por um subconjunto de :math:`\{0, \ldots, N - 1\}`, que chamamos de orbitais ocupados. O eigenvalue correspondente é a soma dos valores correspondentes de :math:`\varepsilon_j`, mais a constante.

source: The transformation matrix :math:`W` is used to construct a circuit to prepare an eigenvector of the Hamiltonian. The circuit is constructed using the ``FermionicGaussianState`` class. Currently, only the `Jordan-Wigner Transform <https://qiskit.org/documentation/nature/stubs/qiskit_nature.second_q.mappers.JordanWignerMapper.html>`__ is supported. The circuit for the Jordan-Wigner Transform has linear depth and uses only linear qubit connectivity. The algorithm is from `Phys. Rev. Applied 9, 044036 <https://journals.aps.org/prapplied/abstract/10.1103/PhysRevApplied.9.044036>`__.
es_un: La matriz de transformación :math:`W` se utiliza para construir un circuito para preparar un vector propio del Hamiltoniano. El circuito se construye usando la clase ``FermionicGaussianState``. Actualmente, solo se admite la `Transformada de Jordan-Wigner <https://qiskit.org/documentation/nature/stubs/qiskit_nature.second_q.mappers.JordanWignerMapper.html>`__. El circuito para la Transformada de Jordan-Wigner tiene una profundidad lineal y emplea únicamente conectividad lineal de qubits. El algoritmo es de `Phys. Rev. Applied 9, 044036 <https://journals.aps.org/prapplied/abstract/10.1103/PhysRevApplied.9.044036>`__.
ko_kr: 변환 행렬 :math:`W` 는 해밀토니안의 고유벡터를 준비하기 위해 회로를 구성하는데 사용된다. 이 회로는 ``FermionicGaussianState`` 클래스를 사용하여 구성된다. 지금은 `조단-위그너 변환 <https://qiskit.org/documentation/nature/stubs/qiskit_nature.second_q.mappers.JordanWignerMapper.html>`__ 만 지원된다. 조던-위그너 변환용 회로는 선형 깊이를 가지며 선형 큐비트 연결만 사용한다. 이 알고리즘은 `Phys. Rev. Applied 9, 044036 <https://journals.aps.org/prapplied/abstract/10.1103/PhysRevApplied.9.044036>`__ 을 참고하였다.

source: The following code cell simulates the circuit and verifies that the output state is indeed an eigenstate of the Hamiltonian with the expected eigenvalue.
es_un: La siguiente celda de código simula el circuito y verifica que el estado de salida sea de hecho un estado propio del Hamiltoniano con el valor propio esperado.
ko_kr: 다음 코드 셀은 회로를 시뮬레이션하고 출력 상태가 예상 고유값을 갖는 해밀톤의 고유 상태인지 확인한다.
pt_un: A célula de código a seguir simula o circuito e verifica se o estado de saída é de fato um eigenstate do Hamiltoniano com o eigenvalue esperado.
ta: பின்வரும் குறியீடு செல் சுற்றுகளை உருவகப்படுத்துகிறது மற்றும் வெளியீட்டு நிலை உண்மையில் எதிர்பார்க்கப்படும் ஈஜென் மதிப்புடன் ஹாமில்டோனியனின் ஈஜென்ஸ்டேட் என்பதைச் சரிபார்க்கிறது.

source: Slater determinants
es_un: Determinantes de Slater
ko_kr: 슬레이터(Slater) 결정기
pt_un: Determinantes de Slater
ta: ஸ்லேட்டர் தீர்மானிப்பவர்கள்

source: When the antisymmetric part :math:`\Delta = 0`, then the Hamiltonian conserves the number of particles. In this case, the basis change only needs to mix creation operators, not annihilation operators:
es_un: Cuando la parte antisimétrica :math:`\Delta = 0`, entonces el Hamiltoniano conserva el número de partículas. En este caso, el cambio de base solo necesita mezclar operadores de creación, no operadores de aniquilación:
ko_kr: 반대칭형 부분이 :math:`\Delta = 0` 이면, 해밀토니안은 입자의 수를 보존한다. 이 경우 기본 변경은 소멸 연산자가 아니라 작성 연산자만을 조합해야 한다.
pt_un: Quando a parte antisimétrica :math:`\Delta = 0`, o Hamiltoniano conserva o número de partículas. Nesse caso, a mudança de base precisa apenas misturar operadores de criação, não operadores de aniquilação:
ta: சமச்சீரற்ற பகுதி போது :math:`\Delta = 0`, பின்னர் ஹாமில்டோனியன் துகள்களின் எண்ணிக்கையைப் பாதுகாக்கிறது. இந்த வழக்கில், அடிப்படை மாற்றம் உருவாக்க ஆபரேட்டர்களை மட்டுமே கலக்க வேண்டும், அழிவு ஆபரேட்டர்கள் அல்ல:

source: where now :math:`W` is an :math:`N \times N` matrix. Furthermore, the orbital energies :math:`\{\varepsilon_j\}` are allowed to be negative.
es_un: donde ahora :math:`W` es una matriz de :math:`N \times N`. Además, las energías orbitales :math:`\{\varepsilon_j\}` pueden ser negativas.
ko_kr: 여기서 :math:`W` 는 :math:`N \times N` 행렬이다. 또한, 오비탈 에너지 :math:`\{\varepsilon_j\}` 는 음수가 될 수 있다.
pt_un: onde agora :math:`W` é uma matriz de :math:`N \times N`. Além disso, as energias orbitais :math:`\{\varepsilon_j\}` podem ser negativas.

source: In this special case, the eigenstates are called Slater determinants, and a more efficient algorithm is used to prepare them. This algorithm is accessed by using the ``SlaterDeterminant`` class instead of ``FermionicGaussianState``. ``SlaterDeterminant`` does not take the occupied orbitals as input. Instead, the shape of the transformation matrix is allowed to vary. It should be an :math:`\eta \times N` matrix where :math:`\eta` is the number of particles.
es_un: En este caso especial, los estados propios se denominan determinantes de Slater y se usa un algoritmo más eficiente para prepararlos. Se accede a este algoritmo utilizando la clase ``SlaterDeterminant`` en lugar de ``FermionicGaussianState``. ``SlaterDeterminant`` no toma los orbitales ocupados como entrada. En su lugar, se permite que varíe la forma de la matriz de transformación. Debería ser una matriz de :math:`\eta \times N` donde :math:`\eta` es el número de partículas.
ko_kr: 이 특별한 경우에, 고유 상태를 슬레이터 결정자라고 하며, 보다 효율적인 알고리즘을 사용하여 이를 준비한다. 이 알고리즘은 ``FermionicGaussianState`` 클래스 대신 ``SlaterDeterminant`` 클래스를 사용하여 접근된다. ``SlaterDeterminant`` 는 점령한 오비탈을 입력으로 받아들이지 않는다. 대신, 변환 행렬의 모양이 변할 수 있다. 이는 :math:`\eta \times N` 행렬이어야 하며, 여기서 :math:`\eta` 는 입자수 이다.
pt_un: Neste caso especial, os eigenstates são chamados de determinantes de Slater, e um algoritmo mais eficiente é usado para prepará-los. Este algoritmo é acessado usando a classe ``SlaterDeterminant`` em vez de ``FermionicGaussianState``. ``SlaterDeterminant`` não recebe os orbitais ocupados como entrada. Em vez disso, a forma da matriz de transformação pode variar. Deve ser uma matriz :math:`\eta \times N` onde :math:`\eta` é o número de partículas.
ta: இந்த சிறப்பு வழக்கில், ஈஜென்ஸ்டேட்டுகள் ஸ்லேட்டர் தீர்மானிப்பான்கள் என்று அழைக்கப்படுகின்றன, மேலும் அவற்றைத் தயாரிக்க மிகவும் திறமையான வழிமுறை பயன்படுத்தப்படுகிறது. இந்த அல்காரிதம் ஐப் பயன்படுத்தி அணுகப்படுகிறது ``SlaterDeterminant`` வர்க்கம் பதிலாக ``FermionicGaussianState``. ``SlaterDeterminant`` ஆக்கிரமிக்கப்பட்ட சுற்றுப்பாதைகளை உள்ளீடாக எடுத்துக் கொள்ளாது. மாறாக, உருமாற்ற மேட்ரிக்ஸின் வடிவம் மாறுபட அனுமதிக்கப்படுகிறது. அது ஒரு இருக்க வேண்டும் :math:`\eta \times N` அணி எங்கே :math:`\eta` துகள்களின் எண்ணிக்கை.

source: Time evolution
es_un: Evolución temporal
ko_kr: 시간 변화
pt_un: Evolução temporal
ta: கால பரிணாமம்

source: Time evolution under a quadratic Hamiltonian can be easily performed by changing into the diagonal basis of the Hamiltonian. The state preparation circuits shown above effect this basis change, but they are optimized for state preparation from a computational basis state (assumed to be the all zeros state), and they do not work on arbitrary states. The general unitary basis change which does work on arbitrary states is called the Bogoliubov transform, and it is also implemented in Qiskit Nature.
es_un: La evolución temporal bajo un Hamiltoniano cuadrático se puede realizar fácilmente cambiando a la base diagonal del Hamiltoniano. Los circuitos de preparación de estado que se muestran arriba efectúan este cambio de base, pero están optimizados para la preparación de estado a partir de un estado de base computacional (se supone que es el estado cero), y no funcionan en estados arbitrarios. El cambio de base unitaria general que funciona en estados arbitrarios se denomina transformada de Bogoliubov y también está implementada en Qiskit Nature.
ko_kr: 이차 해밀토니안 하에서의 시간 변화는 해밀토니안의 대각 기저로 변화함으로써 쉽게 수행될 수 있다. 위에 표시된 상태 준비 회로는 이 기준 변화에 영향을 미치지만, (모두 0인 상태라고 가정하는) 계산 기준 상태로부터 상태 준비가 최적화되어 있으며, 임의의 상태에서는 작동하지 않는다. 임의의 상태에서 작용하는 일반적인 단일 기저 변화는 보골류보프 변환(Bogoliubov transform)라고 불리며, 또한 Qiskit Nature에서 구현된다.
pt_un: Evolução temporal sob um Hamiltoniano quadrático pode ser facilmente realizada mudando para a base diagonal do Hamiltoniano. Os circuitos de preparação de estado mostrados acima efetuam essa mudança de base, mas são otimizados para preparação de estado a partir de um estado de base computacional (supostamente o estado de zeros) e não funcionam em estados arbitrários. A mudança geral de base unitária que funciona em estados arbitrários é chamada de transformada de Bogoliubov, e também é implementada no Qiskit Nature.
ta: ஒரு இருபடி ஹாமில்டோனியனின் கீழ் நேர பரிணாமத்தை ஹாமில்டோனியனின் மூலைவிட்ட அடிப்படையில் மாற்றுவதன் மூலம் எளிதாகச் செய்ய முடியும். மேலே காட்டப்பட்டுள்ள மாநில தயாரிப்பு சுற்றுகள் இந்த அடிப்படை மாற்றத்தை ஏற்படுத்துகின்றன, ஆனால் அவை கணக்கீட்டு அடிப்படை நிலையிலிருந்து (அனைத்து பூஜ்ஜிய நிலையாகக் கருதப்படுகிறது) மாநிலத் தயாரிப்பிற்கு உகந்ததாக இருக்கும், மேலும் அவை தன்னிச்சையான நிலைகளில் வேலை செய்யாது. தன்னிச்சையான மாநிலங்களில் வேலை செய்யும் பொதுவான ஒற்றையாட்சி அடிப்படை மாற்றம் போகோலியுபோவ் உருமாற்றம் என்று அழைக்கப்படுகிறது, மேலும் இது கிஸ்கிட் நேச்சரிலும் செயல்படுத்தப்படுகிறது.

source: The code block below demonstrates the use of the Bogoliubov transform to implement time evolution for a quadratic Hamiltonian.
es_un: El siguiente bloque de código demuestra el uso de la transformada de Bogoliubov para implementar la evolución temporal de un Hamiltoniano cuadrático.
ko_kr: 아래의 코드 블록은 이차 해밀토니안 시간 변화를 구현하기 위해 보골류보프 변환을 사용하는 것을 보여 준다.
pt_un: O bloco de código abaixo demonstra o uso da transformação de Bogoliubov para implementar evolução temporal para um Hamiltoniano quadrático.
ta: கீழேயுள்ள குறியீடு தொகுதியானது, இருபடி ஹாமில்டோனியனுக்கு நேர பரிணாமத்தை செயல்படுத்த போகோலியுபோவ் உருமாற்றத்தின் பயன்பாட்டை நிரூபிக்கிறது.
