Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/12_deuteron_binding_energy.po
Languages: es_un, ja

source: Now we can check if with this new type of ``ansatz``, we can reach the reference values obtained through classical methods. To do this verification, we have to repeat the experiments done previously, but now using the ``ansatz`` defined through the usage of TwoLocal function.
es_un: Ahora podemos comprobar si con este nuevo tipo de ``ansatz`` podemos alcanzar los valores de referencia obtenidos por métodos clásicos. Para hacer esta verificación, tenemos que repetir los experimentos hechos anteriormente, pero ahora usando el ``ansatz`` definido mediante el uso de la función TwoLocal.
ja: 新しいタイプの ``ansatz`` で、古典的な手法で得られた参照値に到達できるかどうかを確認できます。 この検証を行うには、以前に行った実験を繰り返す必要がありますが、今度は、TwoLocal 関数を使用して定義された ``ansatz`` を使用します。

source: Using the four different ``TwoLocal`` ansatze, we obtained the following results:
es_un: Usando los cuatro ansatze ``TwoLocal`` diferentes, obtuvimos los siguientes resultados:
ja: 4 つの ``TwoLocal`` ansatz を使用して、以下の結果を得ました：

source: Step 4: Calculating the observables expectation values
es_un: Paso 4: Calcular los valores esperados de los observables
ja: ステップ 4: 観測量の期待値を計算する

source: One of our goals in the Qiskit Advocate Mentorship Program project was to show that it is possible to calculate expectation values of some observables of interest, and show how they behave when we vary a parameter in the ``ansatz`` circuit. In our case, the observables of interest were :math:`I_1 \otimes Z_0`, :math:`Z_1 \otimes I_0`, :math:`X_1 \otimes X_0`, :math:`Y_1 \otimes Y_0` and :math:`H_2`, then we investigate their behavior when the parameter :math:`\theta` was varied inside the interval :math:`[-\pi,\pi]`.
es_un: Uno de nuestros objetivos en el proyecto Qiskit Advocate Mentorship Program era mostrar que es posible calcular los valores esperados de algunos observables de interés y mostrar cómo se comportan cuando variamos un parámetro en el circuito ``ansatz``. En nuestro caso, los observables de interés fueron :math:`I_1 \otimes Z_0`, :math:`Z_1 \otimes I_0`, :math:`X_1 \otimes X_0`, :math:`Y_1 \otimes Y_0` y :math:`H_2`, luego investigamos su comportamiento cuando el parámetro :math:`\theta` fue variado dentro del intervalo :math:`[-\pi,\pi]`.
ja: Qiskit Advocate Mentorship Program プロジェクトにおける我々の目標の一つは、興味のあるいくつかの観測量の期待値を計算可能であることを示し、 ``ansatz`` 回路のパラメーターを変えたときにそれらがどう振る舞うかを示すことでした。我々の場合、興味のある観測量は :math:`I_1 \otimes Z_0`, :math:`Z_1 \otimes I_0`, :math:`X_1 \otimes X_0`, :math:`Y_1 \otimes Y_0` と :math:`H_2` で、さらにパラメーター :math:`\theta` を区間 :math:`[-\pi,\pi]` 以内で変化させた時のそれらの動作を調査しています。

source: In Dirac notation (bra-ket), the definition of the expectation value of an observable :math:`\hat{O}` is equal to `[3] <https://www.feynmanlectures.caltech.edu/III_toc.html>`__ [4]:
es_un: En la notación de Dirac (bra-ket), la definición del valor esperado de un observable :math:`\hat{O}` es igual a `[3] <https://www.feynmanlectures.caltech.edu/III_toc.html>`__ [4]:
ja: ディラック記法 (ブラケット) では、観測値の期待値の定義 :math:`\hat{O}` は `[3] <https://www.feynmanlectures.caltech.edu/III_toc.html>`__ [4] に等しくなります。

source: The code below defines a function that calculates the expectation values of observables, given a parameterized quantum circuit and a list with some values for these parameters (angles). To build the ``calculate_observables_exp_values`` we use some tools of Qiskit Opflow.
es_un: El siguiente código define una función que calcula los valores esperados de los observables, dado un circuito cuántico parametrizado y una lista con algunos valores para estos parámetros (ángulos). Para construir el ``calculate_observables_exp_values`` usamos algunas herramientas de Qiskit Opflow.
ja: 以下のコードは、観測量の期待値を計算する関数を定義しています。 パラメーター化された量子回路と、これらのパラメーター(角度) の値を持つリストが与えられます。 ``calculate_observables_exp_values`` をビルドするには、Qiskit Opflow のいくつかのツールを使用します。

source: Calculating the expectation value of the observables of interest using the function defined above:
es_un: Cálculo del valor esperado de los observables de interés utilizando la función definida anteriormente:
ja: 上記で定義した関数を使用して、関心のある観測量の期待値を計算します。

source: Using the function ``calculate_observables_exp_values`` (we defined it in the Step 2), we got the plots presented below. They showed us that we were able to reproduce the results of `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__.
es_un: Usando la función ``calculate_observables_exp_values`` (la definimos en el Paso 2), obtuvimos las gráficas que se presentan a continuación. Nos mostraron que podíamos reproducir los resultados de `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__.
ja: (ステップ2で定義した) 関数 ``calculate_observables_exp_values`` を使用して、以下のプロットを得ました。 `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__ の結果を再現できていることを示しました。

source: Acknowledgment
es_un: Reconocimiento
ja: 謝辞

source: I would like to thank Steve Wood, Soham Pal and Siddhartha Morales for the debates in our meetings during the Qiskit Advocate Mentorship Program 2021 - Fall, they were very important for the construction of this tutorial.
es_un: Me gustaría agradecer a Steve Wood, Soham Pal y Siddhartha Morales por los debates en nuestras reuniones durante el Qiskit Advocate Mentorship Program 2021 - Fall, fueron muy importantes para la construcción de este tutorial.
ja: Qiskit Advocate Mentorship Program 2021 - Fallの期間中に行ったミーティングでのSteve Wood、Soham Pal、Siddhartha Moralesに感謝します。彼らはこのチュートリアルの構築に非常に重要でした。

source: References
es_un: Referencias
ja: 参考文献

source: [4] Expectation value (quantum mechanics) Wikipedia article. https://en.wikipedia.org/wiki/Expectation_value_(quantum_mechanics)
ja: [4] 期待値 (量子力学) Wikipedia の記事 https://en.wikipedia.org/wiki/Expectation_value_(quantum_mechanics)

source: :math:`\delta_{n,m} = \bigg\{\begin{array}{c}0, \ \textrm{if} \ n \neq m \\1, \ \textrm{if } \ n = m.\end{array}`.
es_un: :math:`\delta_{n,m} = \bigg\{\begin{array}{c}0, \ \textrm{si} \ n \neq m \\1, \ \textrm{si } \ n = m.\end{array}`.
