Repository: qiskit-community/qiskit-translations
Catalog: nature/docs/locale/*/LC_MESSAGES/tutorials/12_deuteron_binding_energy.po
Languages: es_un, ja

source: This page was generated from `docs/tutorials/12_deuteron_binding_energy.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/12_deuteron_binding_energy.ipynb`__.
ja: このページは `docs/tutorials/12_deuteron_binding_energy.ipynb`__ から生成されました。

source: Binding Energy between proton and neutron in the Deuteron nucleus
ja: 重水素原子核の陽子と中性子の結合エネルギー

source: At the current stage of quantum computing the quantum processors we have available do not yet have error correcting codes implemented and thus still have noise that must be contended with. This noise can adversely impact the results and hence can limit the sort of problems we can currently tackle when, due to the noise, a high level of confidence and precision cannot be expected from the results.
es_un: En la etapa actual de la computación cuántica, los procesadores cuánticos que tenemos disponibles aún no tienen códigos de corrección de errores implementados y, por lo tanto, todavía tienen ruido con el que deben lidiar. Este ruido puede afectar negativamente a los resultados y, en consecuencia, puede limitar el tipo de problemas que podemos abordar actualmente cuando, debido al ruido, no se puede esperar un alto nivel de confianza y precisión de los resultados.
ja: 現在の量子コンピューティングでは、量子プロセッサーに誤り訂正符号が実装されていないため、ノイズに悩まされることになります。このノイズが結果に悪影響を及ぼし、その結果、高い信頼性と精度が期待できない場合、現在取り組むことのできる問題が制限される可能性があります。

source: However, there are some problems which demand only few qubits to be solved, like the computation of the binding energy between the proton and neutron in the Deuteron nucleus `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__. This problem is an example of a scenario where we can achieve good results despite the challenges mentioned earlier.
es_un: Sin embargo, hay algunos problemas que requieren solo unos pocos qubits para ser resueltos, como el cálculo de la energía de enlace entre el protón y el neutrón en el núcleo del Deuterón `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__. Este problema es un ejemplo de un escenario en el que podemos lograr buenos resultados a pesar de los desafíos mencionados anteriormente.
ja: しかし、重陽子原子核の陽子と中性子の結合エネルギーの計算のように、数量子ビットしか必要としない問題も存在します `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__。この問題は、先に述べた課題にもかかわらず、良い結果を得られるシナリオの一例です。

source: Step 1: Importing the packages that we need to tackle the problem
es_un: Paso 1: Importar de los paquetes que necesitamos para abordar el problema
ja: ステップ 1: 問題に取り組むために必要なパッケージをインポートする

source: Step 2: Defining some functions that we will use
es_un: Paso 2: Definir algunas funciones que usaremos
ja: ステップ 2: いくつかの機能を定義する

source: Before we start the definition of the Deuteron Hamiltonian, we need to define a utility function implementing the Kronecker delta, which is defined as follows:
es_un: Antes de comenzar la definición del Hamiltoniano del Deuterón, debemos definir una función de utilidad que implemente la delta de Kronecker, que se define de la siguiente manera:
ja: 重水素のハミルトニアンの定義を始める前に、クロネッカーデルタを実装したユーティリティー関数を定義する必要があり、それは次のように定義されます。

source: This function appears in the Deuteron Hamiltonian definition given in `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__. Below we have a piece of code that defines the Kronecker delta function.
es_un: Esta función aparece en la definición del Hamiltoniano del Deuterón dada en `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__. A continuación tenemos un fragmento de código que define la función de la delta de Kronecker.
ja: この関数は `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__ で示される重水素のハミルトニアンの定義に登場します。以下に、クロネッカーのデルタ関数を定義するコードの一部を示します。

source: In `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__ we can find the following expression for the Deuteron Hamiltonian :math:`H_N = \sum_{n,m=0}^{N-1}\langle m|(T+V)|n\rangle a_{m}^\dagger a_n`, where :math:`|n\rangle` and :math:`|m\rangle` represent quantum states in the harmonic oscillator basis, and :math:`a_m^\dagger` and :math:`a_n` represent the creation and annihilation operators, respectively.
es_un: En `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__ podemos encontrar la siguiente expresión para el Hamiltoniano del Deuterón :math:`H_N = \sum_{n,m=0}^{N-1}\langle m|(T+V)|n\rangle a_{m}^\dagger a_n`, donde :math:`|n\rangle` y :math:`|m\rangle` representan estados cuánticos en la base del oscilador armónico, y :math:`a_m^\dagger` y :math:`a_n` representan los operadores de creación y aniquilación, respectivamente.
ja: `[1] <https://arxiv.org/pdf/1801.03897. pdf>`__ では、重水素のハミルトニアンの式は :math:`H_N = \sum_{n,m=0}^{N-1}\langle m|(T+V)|n\rangle a_{m}^\dagger a_n` と表されます。ここで :math:`|n\rangle` と :math:`|m\rangle` は調和振動子基底の量子状態を表し、 :math:`a_m^\dagger` と :math:`a_n` はそれぞれ生成演算子と消滅演算子を表します。

source: To create the code that defines :math:`H_N`, we need the matrix elements of the kinetic and potential energy. Again, we find these expressions in `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__:
es_un: Para crear el código que define a :math:`H_N`, necesitamos los elementos de la matriz de energía cinética y potencial. De nuevo, encontramos estas expresiones en `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__:
ja: :math:`H_N` を定義するコードを作成するために、運動エネルギーと位置エネルギーの行列要素が必要です。これらの式も `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__ で見つけることができます。

source: Where :math:`V_0 = -5.68658111 \ \textrm{MeV}` and :math:`\hbar\omega = 7 \ \textrm{MeV}`. However, the Hamiltonian written in this way cannot be processed directly in a quantum computer, because a quantum computer manipulates qubits through gates based on Pauli matrices. Thus, we need to convert the creation and annihilation operators into Pauli operators. To do that, we can make use of the Jordan-Wigner transformation
es_un: Donde :math:`V_0 = -5.68658111 \ \textrm{MeV}` y :math:`\hbar\omega = 7 \ \textrm{MeV}`. Sin embargo, el Hamiltoniano escrito de esta manera no se puede procesar directamente en una computadora cuántica, porque una computadora cuántica manipula qubits a través de compuertas basadas en matrices de Pauli. Por lo tanto, necesitamos convertir los operadores de creación y aniquilación en operadores de Pauli. Para hacer eso, podemos hacer uso de la transformación de Jordan-Wigner
ja: ここで、 :math:`V_0 = -5.68658111 \textrm{MeV}` で、 :math:`hbaromega = 7 \textrm{MeV}` です。しかし、このように書かれたハミルトニアンは、量子コンピューターでは直接処理できません。量子コンピューターは、パウリ行列に基づくゲートを通して量子ビットを操作するからです。そこで、生成消滅演算子をパウリ演算子に変換する必要があります。そのために、Jordan-Wigner変換を利用します。

source: Fortunately, in Qiskit Nature we have tools to define fermionic operators and to convert this kind of operators into Pauli operators through the Jordan-Wigner transformation. Initially, we use a for loop to construct and store the labels and coefficients in a tuple, and after this, we add the tuple in a list. Each string label and coefficient define a kinetic element :math:`\langle m|T|n\rangle` and a potential element :math:`\langle m|V|n\rangle` of the Hamiltonian. At the end of the for loop, we have to pass the list with the tuples with labels and coefficients to ``FermionicOp``, in order to create a Hamiltonian in terms of the creation and annihilation operators. We need to rewrite this Hamiltonian in terms of Pauli operators, to do this we use ``JordanWignerMapper()`` and the ``QubitConverter()``. In order to obtain more information about the Qiskit Nature tools, we recommend a reading of the Qiskit Nature documentation `[2] <https://qiskit.org/documentation/nature/>`__.
es_un: Afortunadamente, en Qiskit Nature disponemos de herramientas para definir operadores fermiónicos y convertir este tipo de operadores en operadores de Pauli mediante la transformación de Jordan-Wigner. Inicialmente, usamos un bucle for para construir y almacenar las etiquetas y los coeficientes en una tupla y, después de esto, agregamos la tupla en una lista. Cada etiqueta de cadena y cada coeficiente definen un elemento cinético :math:`\langle m|T|n\rangle` y un elemento potencial :math:`\langle m|V|n\rangle` del Hamiltoniano. Al final del bucle for, tenemos que pasar la lista con las tuplas con etiquetas y coeficientes a ``FermionicOp``, para crear un Hamiltoniano en términos de los operadores de creación y aniquilación. Necesitamos reescribir este Hamiltoniano en términos de operadores de Pauli, para hacer esto usamos ``JordanWignerMapper()`` y ``QubitConverter()``. Para obtener más información sobre las herramientas de Qiskit Nature, recomendamos leer la documentación de Qiskit Nature `[2] <https://qiskit.org/documentation/nature/>`__.
ja: 幸い、Qiskit Natureにはフェルミオン演算子を定義し、Jordan-Wigner変換によってこの種の演算子をパウリ演算子に変換するツールがあります。最初に、forループを使ってラベルと係数をタプルに構築し、保存します。この後、タプルをリストに追加します。それぞれの文字列ラベルと係数はハミルトニアンの運動の項 :math:`\langle m|T|n\rangle` とポテンシャルの項 :math:`\langle m|V|n\rangle` を定義します。forループの最後に、ラベルと係数のタプルを含むリストを ``FermionicOp`` に渡して、生成消滅演算子からハミルトニアンを作成する必要があります。このハミルトニアンをパウリ演算子で書き換える必要があります。そのためには、 ``JordanWignerMapper()`` と ``QubitConverter()`` を使用します。Qiskit Natureツールに関するより詳しい情報は、Qiskit Natureドキュメント `[2] <https://qiskit.org/documentation/nature/>`__ を読むことをお勧めします。

source: Now, we have an idea of how to use some of Qiskit Nature tools to build a Hamiltonian in terms of Pauli operators. However, this is not the end, we need to construct an ansatz through a parameterized quantum circuit and use it in the ``VQE`` to compute the minimum eigenvalue of the Deuteron Hamiltonian (binding energy).
es_un: Ahora, tenemos una idea de cómo usar algunas de las herramientas de Qiskit Nature para construir un Hamiltoniano en términos de operadores de Pauli. Sin embargo, este no es el final, necesitamos construir un ansatz a través de un circuito cuántico parametrizado y usarlo en el ``VQE`` para calcular el valor propio mínimo del Hamiltoniano del Deuterón (energía de enlace).
ja: さて、Qiskit Natureのツールを使って、パウリ演算子でハミルトニアンを構築する方法がわかりました。しかし、これで終わりではありません。パラメーター化された量子回路を通してansatzを構築し、 ``VQE`` を使用して重水素のハミルトニアンの最小固有値 (結合エネルギー) を計算します。

source: Step 3: Using Qiskit tools to calculate the binding energy between proton and neutron in Deuteron nucleus
es_un: Paso 3: Usar las herramientas de Qiskit para calcular la energía de enlace entre el protón y el neutrón en el núcleo del Deuterón
ja: ステップ 3: Qiskit ツールを使用して、重水素原子核の陽子と中性子の結合エネルギーを計算する

source: In the previous step, we have defined the functions that will be useful to us in the task of calculating the binding energy between proton and neutron in the Deuteron nucleus. Thus, now it is time to start the process of solving the problem with the tools we built.
es_un: En el paso anterior hemos definido las funciones que nos serán útiles en la tarea de calcular la energía de enlace entre el protón y el neutrón en el núcleo del Deuterón. Por lo tanto, ahora es el momento de comenzar el proceso de resolución del problema con las herramientas que construimos.
ja: 前のステップで重水素原子核の陽子と中性子の結合エネルギーの計算に役立つ機能を定義しました。 今度は、私たちが構築したツールを使って問題を解決するプロセスを始める時です。

source: Now it is time to create the Hamiltonian, we will begin with :math:`H_1`, that is the simplest form of the deuteron Hamiltonian (:math:`N = 1`). In `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__, the authors calculated the ground-state energy for :math:`N = 1,2,3` and they used those values to extrapolate the energy and try to reach :math:`-2.22 \ MeV`, the value of the deuteron’s ground-state energy. Here we will create a list to store the Hamiltonians :math:`H_1`, :math:`H_2`, :math:`H_3` and :math:`H_4`, because we will use these Hamiltonians later to calculate the ground-state. To do this, we can do a list comprehension with the function ``create_deuteron_hamiltonian`` that we defined above.
es_un: Ahora es el momento de crear el Hamiltoniano, comenzaremos con :math:`H_1`, que es la forma más simple del Hamiltoniano del deuterón (:math:`N = 1`). En `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__, los autores calcularon la energía del estado fundamental para :math:`N = 1,2,3` y usaron esos valores para extrapolar la energía e intentar alcanzar :math:`-2.22 \ MeV`, el valor de la energía del estado fundamental del deuterón. Aquí crearemos una lista para almacenar los Hamiltonianos :math:`H_1`, :math:`H_2`, :math:`H_3` y :math:`H_4`, porque usaremos estos Hamiltonianos más adelante para calcular el estado fundamental. Para ello, podemos hacer una lista por comprensión con la función ``create_deuteron_hamiltonian`` que definimos anteriormente.
ja: 重水素のハミルトニアン( :math:`N = 1` )の最も単純な形である :math:`H_1` から始めましょう。`[1] <https://arxiv.org/pdf/1801.03897.pdf>`__ では、著者らは :math:`N = 1,2,3` の基底状態のエネルギーを計算し、その値を使ってエネルギーを外挿し、重水素の基底状態のエネルギーの値である :math:`-2.22 \MeV` に到達しようと試みています。ここでは、ハミルトニアン :math:`H_1`, :math:`H_2`, :math:`H_3`, :math:`H_4` を格納するリストを作成します。なぜなら、これらのハミルトニアンは後に基底状態を計算するために使用することになるからです。これを行うには、上で定義した ``create_deuteron_hamiltonian`` という関数でリスト内包を行います。

source: In reference `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__, we can find the exact expressions for Deuteron Hamiltonian of size N = 1, 2 and 3 as given below.
es_un: En la referencia `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__, podemos encontrar las expresiones exactas para el Hamiltoniano del Deuterón de tamaño N = 1, 2 y 3 como se indica a continuación.
ja: 参考文献 `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__ に、N = 1, 2, 3 の大きさの重水素のハミルトニアンの厳密な式が示されています。

source: If we want to know if our ``create_deuteron_hamiltonian`` gives us the right result, we have to compare with the expressions presented above. For this purpose, we printed the Hamiltonians generated by the function ``create_deuteron_hamiltonian`` in the cell below.
es_un: Si queremos saber si nuestro ``create_deuteron_hamiltonian`` nos da el resultado correcto, tenemos que comparar con las expresiones presentadas anteriormente. Para este propósito, imprimimos los Hamiltonianos generados por la función ``create_deuteron_hamiltonian`` en la celda de abajo.
ja: もし、 ``create_deuteron_hamiltonian`` が正しい結果を与えているかどうかを知りたければ、上に示した式と比較する必要があります。この目的のために、関数 ``create_deuteron_hamiltonian`` によって生成されたハミルトニアンを以下のセルに記載しました。

source: By inspection, we can see that our function is giving us the right result for :math:`H_1`, :math:`H_2` and :math:`H_3`. However, we don’t have an expression for :math:`H_4` in `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__, but it is possible to say, by induction, that the result must be correct once the previous results matched with the expressions given in `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__.
es_un: Al inspeccionar, podemos ver que nuestra función nos está dando el resultado correcto para :math:`H_1`, :math:`H_2` y :math:`H_3`. Sin embargo, no tenemos una expresión para :math:`H_4` en `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__, pero es posible decir, por inducción, que el resultado debe ser correcto una vez que los resultados anteriores coincidan con las expresiones dadas en `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__.
ja: 検証の結果、この関数は :math:`H_1`, :math:`H_2`, :math:`H_3` に対して正しい結果を与えていることがわかります。 `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__ には :math:`H_4` の式がありませんが、帰納法により、以前の結果が `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__ で与えられた式と一致すれば、その結果は正しいに違いないと言うことは可能です。

source: In `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__, the authors worked with ansatze of low depth, because they wanted to compute things on a real quantum device. Those quantum circuits can be found in `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__. As we already discussed in the beginning of this tutorial, the currently available quantum hardware has to work with quantum circuits with low depth to achieve good results, once they still have a significant amount of noise and don’t have quantum error correction implemented.
es_un: En `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__, los autores trabajaron con ansatze de baja profundidad, porque querían calcular cosas en un dispositivo cuántico real. Esos circuitos cuánticos se pueden encontrar en `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__. Como ya comentamos al comienzo de este tutorial, el hardware cuántico actualmente disponible tiene que trabajar con circuitos cuánticos de baja profundidad para lograr buenos resultados, mientras que aún tengan una cantidad significativa de ruido y no tengan implementada la corrección de errores cuánticos.
ja: `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__ では、著者らは実量子デバイスで計算をしたかったので、Depthの浅いansatzで作業をしました。この量子回路は `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__ で見ることができます。このチュートリアルの冒頭で述べたように、現在利用可能な量子ハードウェアは、量子エラー訂正が実装されておらず、ノイズが多いため、良い結果を得るためには浅いDepthの量子回路で動作させる必要があります。

source: We need to define two parameters to build the circuits presented in `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__, :math:`\theta` (theta) and :math:`\eta` (eta), which we can do it using ``Parameter()`` as shown in the cell code below.
es_un: Necesitamos definir dos parámetros para construir los circuitos presentados en `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__, :math:`\theta` (theta) y :math:`\eta` (eta), que podemos lograr usando ``Parameter()`` como se muestra en el código de la celda a continuación.
ja: 下のコードセルで示されているように、 ``Parameter()`` を使用して `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__ で紹介されている回路を構築するために、 :math:`\theta` (theta) と :math:`\eta` (eta) という2つのパラメーターを定義する必要があります。

source: Using the parameters defined above and following the instructions to build the circuits presented in `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__, we obtain the following circuits:
es_un: Usando los parámetros definidos anteriormente y siguiendo las instrucciones para construir los circuitos presentados en `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__, obtenemos los siguientes circuitos:
ja: `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__で示される回路を構築する指示に従うと、上記で定義されたパラメーターを使用して以下の回路を得られます。

source: Unfortunately, in `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__ we can’t find a low-depth circuit for the ansatz for :math:`H_4`. Then, for now we are not going to work with :math:`N = 4`, but later we will return to this problem using ``TwoLocal`` as an ansatz.
es_un: Desafortunadamente, en `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__ no podemos encontrar un circuito de poca profundidad para el ansatz para :math:`H_4`. Entonces, por ahora no vamos a trabajar con :math:`N = 4`, pero luego volveremos a este problema usando ``TwoLocal`` como ansatz.
ja: 残念ながら、`[1] <https://arxiv.org/pdf/1801.03897.pdf>`__ では :math:`H_4` のansatzのための浅い回路を見つけることができません。よって、今のところ :math:`N = 4` を扱いませんが、後でansatzとして ``TwoLocal`` を使ってこの問題に戻りましょう。

source: Now, we can store these circuits in the ansatz list for the organization of the tests.
es_un: Ahora, podemos almacenar estos circuitos en la lista de ansatz para la organización de las pruebas.
ja: これらの回路をテストの構成のためにansatzリストに格納します。

source: The rather small size of our generated operators, allows us to use numpy functions (classical methods) to obtain the binding energy for :math:`H_1`, :math:`H_2`, :math:`H_3` and :math:`H_4` through the process of finding the lowest eigenvalue of the Hamiltonian matrices. This task is done in the for loop of the code cell below.
es_un: El tamaño bastante pequeño de nuestros operadores generados nos permite usar funciones de numpy (métodos clásicos) para obtener la energía de enlace para :math:`H_1`, :math:`H_2`, :math:`H_3` y :math:`H_4` a través del proceso de encontrar el valor propio más bajo de las matrices Hamiltonianas. Esta tarea se realiza en el bucle for de la celda de código siguiente.
ja: 生成された演算子のサイズが小さいので、 :math:`H_1`, :math: `H_2`, :math:`H_3`, :math:`H_4`の結合エネルギーを得るとき、ハミルトニアン行列の最小固有値を見つけるプロセスにnumpy関数 (古典的なメソッド) を使うことができます。このタスクは、以下のコードセルの for ループで実行されます。

source: The results obtained above will be used as our reference values. Thus, we can use them to see if the Estimator gives us good results. In the code cell below we ran the ``VQE`` algorithm for each pair of ``ansatz`` and Hamiltonian, using the Estimator and the ``SLSQP`` optimizer.
es_un: Los resultados obtenidos anteriormente se utilizarán como nuestros valores de referencia. Así, podemos usarlos para ver si el Estimator nos da buenos resultados. En la siguiente celda de código, ejecutamos el algoritmo ``VQE`` para cada par de ``ansatz`` y Hamiltoniano, usando el Estimator y el optimizador ``SLSQP``.
ja: 上記の結果を参照値として使用します。 したがって、Estimatorが良い結果をもたらすかどうかを確認するためにそれらを使用できます。 以下のコードセルでは、Estimatorと ``SLSQP`` オプティマイザーを使用して、``ansatz`` と ハミルトニアンのペアに対して ``VQE`` アルゴリズムを実行しました。

source: We can see that our results are in agreement with the reference values obtained by classical methods. We also tested some different options of optimizers provided in Qiskit, because we wanted to know which one behaves better. To do this, we make use of the ``callback`` option in ``VQE`` to allow us to store the list of counts and values. With this information it is possible to make a plot to see if the optimizer converges to the value of reference and, if it converges, how fast it does. However, in the code cell below, we are working only with the ``COBYLA`` optimizer for the sake of simplicity.
es_un: Podemos ver que nuestros resultados están de acuerdo con los valores de referencia obtenidos por métodos clásicos. También probamos algunas opciones diferentes de optimizadores provistos en Qiskit, porque queríamos saber cuál se comporta mejor. Para ello, hacemos uso de la opción ``callback`` en ``VQE`` que nos permite almacenar la lista de conteos y valores. Con esta información es posible hacer una gráfica para ver si el optimizador converge al valor de referencia y, si converge, qué tan rápido lo hace. Sin embargo, en la celda de código a continuación, estamos trabajando solo con el optimizador ``COBYLA`` en aras de la simplicidad.
ja: 我々の結果は古典的な手法で得られた基準値と一致していることがわかります。また、Qiskitで提供されているオプティマイザーのオプションもどれが良いかテストしました。そのために、``VQE`` の ``callback`` オプションを使用し、カウントと値のリストを保存できるようにしました。この情報を使って、オプティマイザーが参照値に収束するかどうか、収束する場合はどのくらいの速度で収束するかをプロットすることが可能です。しかし、以下のコードセルでは、簡単のために ``COBYLA`` オプティマイザーのみを使用しています。

source: Plotting the results obtained with the execution of ``VQE`` on the previous code cell.
es_un: Graficar los resultados obtenidos con la ejecución de ``VQE`` sobre la celda de código anterior.
ja: 前のコードセルで ``VQE`` を実行して取得した結果をプロットします。

source: Note that with the quantum circuits given in `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__, we can’t test whether we can reach the reference value for :math:`H_4`, because, as mentioned before, we don’t have an ``ansatz`` for this Hamiltonian. Fortunately, that is not the end for our experiments, because Qiskit provides some functions that create an ``ansatz`` for us. For our purposes, we decided to use the TwoLocal function to build our new ``ansatz``. In the code cell below we used a for loop to create a list with the ``TwoLocal`` ansatz for each Hamiltonian.
es_un: Ten en cuenta que con los circuitos cuánticos dados en `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__, no podemos probar si podemos alcanzar el valor de referencia para :math:`H_4`, porque, como se mencionó antes, no tenemos un ``ansatz`` para este Hamiltoniano. Afortunadamente, ese no es el final de nuestros experimentos, porque Qiskit proporciona algunas funciones que crean un ``ansatz`` para nosotros. Para nuestros propósitos, decidimos usar la función TwoLocal para construir nuestro nuevo ``ansatz``. En la siguiente celda de código, usamos un bucle for para crear una lista con el ansatz ``TwoLocal`` para cada Hamiltoniano.
ja: `[1] <https://arxiv.org/pdf/1801.03897.pdf>`__ で示した量子回路では、 :math:`H_4` の参照値に到達できるかどうかをテストすることができません。なぜなら、前述のように、このハミルトニアンの ``ansatz`` がないためです。幸いなことに、Qiskitには ``ansatz`` を作成する関数がいくつか用意されているので、実験が終わってしまうわけではありません。我々の目的のための新しい ``ansatz`` を作るためにTwoLocal関数を使うことにしました。以下のコードでは、forループを使って各ハミルトニアンの ``TwoLocal`` ansatzを含むリストを作成しています。
