Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/01_introduction_ibm_cloud_runtime.po
Languages: es_un, ja_jp, ko_kr, pt_un, ta_in

source: You can use the `QiskitRuntimeService.run() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.run>`__ method to invoke a runtime program. This method takes the following parameters:
es_un: Puedes utilizar el método `QiskitRuntimeService.run() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.run>`__ para invocar un programa runtime. Este método toma los siguientes parámetros:
ja_jp: Runtimeプログラムを呼び出すには、 `QiskitRuntimeService.run() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.run>`__ メソッドを使用できます。 このメソッドは以下のパラメーターを取ります。
ko_kr: `QiskitRuntimeService.run() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.run>`__ 메서드를 사용해서 런타임 프로그램을 호출할 수 있다. 이 메서드는 다음 매개변수를 사용한다:
pt_un: Podemos usar o método `QiskitRuntimeService.run() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.run>`__ para chamar um programa de tempo de execução. Este método usa os seguintes parâmetros:
ta_in: நீங்கள் `QiskitRuntimeService.run() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.run>`__ இந்த முறை பின்வரும் அளவுருக்களை எடுக்கும்:

source: ``program_id``: ID of the program to run.
es_un: ``program_id``: ID del programa a ejecutar.
ja_jp: ``program_id``: 実行するプログラムの ID 。
ko_kr: ``program_id``: 실행할 프로그램의 ID.
pt_un: ``program_id``: ID do programa a ser executado.
ta_in: ``program_id``: இயக்க வேண்டிய நிரலின் ஐடி.

source: ``inputs``: Program input parameters. These input values are passed to the runtime program.
es_un: ``inputs``: Parámetros de entrada del programa. Estos valores de entrada se pasan al programa runtime.
ja_jp: ``inputs``: プログラム入力パラメーター。 これらの入力値は、Runtimeプログラムに渡されます。
ko_kr: ``inputs``: 프로그램 입력 매개변수. 이 입력 값은 런타임 프로그램에 전달된다.
pt_un: ``inputs``: Parâmetros de entrada do programa. Esses valores de entrada são passados para o programa de runtime.
ta_in: ``உள்ளீடுகள்``: நிரல் உள்ளீட்டு அளவுருக்கள். இந்த உள்ளீட்டு மதிப்புகள் இயக்க நேர நிரலுக்கு அனுப்பப்படும்.

source: ``options``: Runtime options. These options control the execution environment. Currently the only available option is ``backend_name``, which is optional for cloud runtime.
es_un: ``options``: Opciones del runtime (tiempo de ejecución). Estas opciones controlan el entorno de ejecución. Actualmente, la única opción disponible es ``backend_name``, que es opcional para el runtime en la nube.
ja_jp: ``options``: Runtimeオプション。 これらのオプションは、実行環境を制御します。 現在利用可能な唯一のオプションは ``backend_name`` のみで、クラウドRuntimeのためのオプションです。
ko_kr: ``options``: 런타임 옵션. 이 옵션은 실행 환경을 제어한다. 현재 실행 가능한 유일한 옵션은 ``backend_name`` 이며 이 옵션은 클라우드 런타임에서는 선택 사항이다.
pt_un: ``options``: Opções de runtime. Essas opções controlam o ambiente de execução. Atualmente a única opção disponível é ``backend_name``, que é opcional para runtime na nuvem.
ta_in: ``விருப்பங்கள்``: இயக்க நேர விருப்பங்கள். இந்த விருப்பங்கள் செயல்படுத்தும் சூழலைக் கட்டுப்படுத்துகின்றன. தற்போது கிடைக்கக்கூடிய ஒரே விருப்பம் ``பின்தளப் பெயர்`` ஆகும், இது கிளவுட் இயக்க நேரத்திற்கு விருப்பமானது.

source: ``result_decoder``: Optional class used to decode the job result.
es_un: ``result_decoder``: Clase opcional utilizada para decodificar el resultado del trabajo.
ja_jp: ``result_decoder``: ジョブ結果のデコードに使用されるオプションのクラス。
ko_kr: ``result_decoder``: 작업 결과를 디코딩하는 데 사용되는 선택적 클래스.
pt_un: ``result_decoder``: Classe opcional usada para decodificar o resultado do job.
ta_in: ``result_decoder``: வேலை முடிவை டிகோட் செய்ய விருப்ப வகுப்பு பயன்படுத்தப்படுகிறது.

source: Below is an example of invoking the ``sampler`` program.
es_un: A continuación se muestra un ejemplo de invocación del programa ``sampler``.
ja_jp: 以下は、 ``sampler`` プログラムを呼び出す場合の例です。
ko_kr: 다음은 ``sampler`` 프로그램을 호출하는 예제다.
pt_un: Abaixo está um exemplo de como invocar o programa ``sampler``.
ta_in: ``மாதிரி`` திட்டத்தைச் செயல்படுத்துவதற்கான எடுத்துக்காட்டு கீழே உள்ளது.

source: First we need to construct a circuit as the input to ``sampler`` using Qiskit.
es_un: Primero necesitamos construir un circuito como entrada a ``sampler`` usando Qiskit.
ja_jp: まず、 Qiskit を使用した ``sampler`` への入力として回路を構築する必要があります。
ko_kr: 먼저, Qiskit을 사용하여 ``sampler`` 에 대한 입력으로 회로를 구성해야 한다.
pt_un: Primeiro precisamos construir um circuito como entrada para o ``sampler`` usando o Qiskit.
ta_in: முதலில் Qiskit ப் பயன்படுத்தி ``மாதிரி`` க்கு உள்ளீடாக ஒரு சர்க்யூட்டை உருவாக்க வேண்டும்.

source: We now use this circuit as the input to ``sampler``:
es_un: Ahora usamos este circuito como entrada a ``sampler``:
ja_jp: ここでは、この回路を ``sampler`` への入力として使用します。
ko_kr: 이제 이 회로를 ``sampler`` 에 대한 입력으로 사용한다:
pt_un: Agora usamos este circuito como entrada para o ``sampler``:
ta_in: நாம் இப்போது இந்தச் சுற்றை ``மாதிரி`` க்கான உள்ளீடாகப் பயன்படுத்துகிறோம்:

source: The ``run()`` method returns a `RuntimeJob <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`__ instance, which represents the asynchronous execution instance of the program.
es_un: El método ``run()`` devuelve una instancia `RuntimeJob <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`__, que representa la instancia de ejecución asíncrona del programa.
ja_jp: ``run()`` メソッドは、プログラムの非同期実行インスタンスを表す `RuntimeJob <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`__ を戻します。
ko_kr: ``run()`` 메서드는 프로그램의 비동기 실행 인스턴스를 나타내는 `RuntimeJob <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`__ 인스턴스를 리턴한다.
pt_un: O método ``run()`` retorna uma instância `RuntimeJob <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`__, que representa a instância de execução assíncrona do programa.
ta_in: ``run()`` என்ற முறை `இயக்க நேர வேலை <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`__ என்பதைத் திருப்பு உதாரணம், இது நிரலின் அசின்க்ரோனஸ் செயலாக்க நிகழ்வை குறிக்கிறது.

source: Some of the ``RuntimeJob`` methods:
es_un: Algunos de los métodos de ``RuntimeJob``:
ja_jp: ``RuntimeJob`` メソッドの一部を以下に示します。
ko_kr: ``RuntimeJob`` 메서드 중 일부는 다음과 같다:
pt_un: Alguns dos métodos de ``RuntimeJob``:
ta_in: ``இயக்கநேர வேலை`` முறைகளில் சில:

source: ``status()``: Return job status.
es_un: ``status()``: Devuelve el estado del trabajo.
ja_jp: ``status()``: ジョブ状況を返します。
ko_kr: ``status()``: 작업 상태를 반환한다.
pt_un: ``status()``: Retorna o status do job.
ta_in: ``நிலை()``: பணி நிலையைத் திரும்பப் பெறுதல்.

source: ``result()``: Wait for the job to finish and return the final result.
es_un: ``result()``: Espera a que termine el trabajo y devuelve el resultado final.
ja_jp: ``result()``: ジョブが完了するまで待機して、最終結果を返します。
ko_kr: ``result()``: 작업이 완료될 때까지 기다린 후 최종 결과를 반환한다.
pt_un: ``result()``: Espera o job terminar e retorna o resultado final.
ta_in: ``முடிவு()``: வேலை முடிவடையும் வரை காத்திருந்து இறுதி முடிவைத் தரவும்.

source: ``cancel()``: Cancel the job.
es_un: ``cancel()``: Cancela el trabajo.
ja_jp: ``cancel()``: ジョブをキャンセルします。
ko_kr: ``cancel()``: 작업을 취소한다.
pt_un: ``cancel()``: Cancela o job.
ta_in: ``ரத்து()``: வேலையை ரத்து செய்.

source: ``wait_for_final_state()``: Wait for the job to finish.
es_un: ``wait_for_final_state()``: Espera a que termine el trabajo.
ja_jp: ``wait_for_final_state()``: ジョブが終了するまで待ちます。
ko_kr: ``wait_for_final_state()``: 작업이 완료될 때까지 기다린다.
pt_un: ``wait_for_final_state()``: Espera o job terminar.
ta_in: ``இறுதி நிலைக்காகக் காத்திருக்கவும்()``: வேலை முடிவடையும் வரை காத்திருங்கள்.

source: ``logs()``: Return job logs.
es_un: ``logs()``: Devuelve los registros de trabajo.
ja_jp: ``logs()``: ジョブのログを返します。
ko_kr: ``logs()``: 작업 로그를 반환한다.
pt_un: `logs()``: Retorna logs do job.
ta_in: ``பதிவுகள்()``: வேலைப் பதிவுகளைத் திருப்பி அனுப்பவும்.

source: ``error_message()``: Returns the reason if the job failed and ``None`` otherwise.
es_un: ``error_message()``: Devuelve el motivo si el trabajo falló y ``None`` en caso contrario.
ja_jp: ``error_message()``: ジョブが失敗した場合にはその理由を戻し、そうでない場合は ``None`` を返します。
ko_kr: ``error_message()``: 작업이 실패하면 이유를 반환하고 그렇지 않은 경우에는 ``None`` 을 반환한다.
pt_un: ``error_message()``: Retorna o motivo se o job falhou e ``None`` caso contrário.
ta_in: ``பிழைச்செய்தி()``: வேலை தோல்வியுற்றால் ``ஒன்றுமில்லை`` என்றால் காரணத்தைத் திருப்பும்.

source: Some of the ``RuntimeJob`` attributes:
ja_jp: ``RuntimeJob`` 属性の一部を以下に示します。
ko_kr: ``RuntimeJob`` 속성 중 일부는 다음과 같다:

source: ``job_id``: Unique identifier of the job.
ja_jp: ``job_id``: ジョブの固有 ID 。
ko_kr: ``job_id``: 작업의 고유한 식별자.

source: ``backend``: The backend where the job is run.
ja_jp: ``backend``: ジョブが実行されているバックエンド。
ko_kr: ``backend``: 작업이 실행되는 백엔드.

source: ``program_id``: ID of the program the execution is for.
ja_jp: ``program_id``: 実行するプログラムの ID 。
ko_kr: ``program_id``: 실행할 프로그램의 ID.

source: Refer to the `RuntimeJob API documentation <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`__ for a full list of methods and usage.
es_un: Consulta la `documentación de la API de RuntimeJob <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`__ para obtener una lista completa de métodos y usos.
ja_jp: メソッドおよび使用方法についてのすべてのリストは、 `RuntimeJob API ドキュメント <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`__ を参照してください。
ko_kr: 메서드와 용법의 전체 리스트를 보려면 `RuntimeJob API documentation <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`__ 을 참고하라.
pt_un: Consulte a `documentação da API RuntimeJob <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`__ para obter uma lista completa de métodos e uso.

source: Note: To ensure fairness, there is a maximum execution time for each Qiskit Runtime job. Refer to this documentation on what the time limit is.
es_un: Nota: Para garantizar la equidad, existe un tiempo máximo de ejecución para cada trabajo de Qiskit Runtime. Consulta esta documentación sobre cuál es el límite de tiempo.
ja_jp: 注記: 公平性を確保するため、それぞれの Qiskit Rutime ジョブごとに最大の実行時間があります。 時間制限については、このドキュメンテーションを参照してください。
ko_kr: 참고: 공정성을 보장하기 위해 각 Qiskit 런타임 작업에 대한 최대 실행 시간이 있다. 시간 제한이 무엇인지에 대해서는 이 문서를 참조하라.
pt_un: Nota: para garantir a imparcialidade, há um tempo máximo de execução para cada trabalho do Qiskit Runtime. Consulte esta documentação para saber qual é o limite de tempo.

source: Selecting a backend
es_un: Seleccionar un backend
ja_jp: バックエンドの選択
ko_kr: 백엔드 선택하기
pt_un: Selecionando um backend

source: A **backend** is a quantum device or simulator capable of running quantum circuits or pulse schedules.
es_un: Un **backend** es un dispositivo o simulador cuántico capaz de ejecutar circuitos cuánticos o planificadores de pulsos.
ja_jp: **backend** は、量子回路またはパルススケジュールを実行することができる、量子デバイスまたはシミュレーターです。
ko_kr: **backend** 는 양자 회로 또는 펄스 스케줄을 실행할 수 있는 양자 디바이스 또는 시뮬레이터이다.
pt_un: Um **back-end** é um dispositivo ou simulador quântico capaz de executar circuitos quânticos ou programações de pulso.

source: In the example above, we invoked a runtime program without specifying which backend it should run on. In this case the server automatically picks the one that is the least busy. Alternatively, you can choose a specific backend to run your program.
es_un: En el ejemplo anterior, invocamos un programa runtime sin especificar en qué backend debería ejecutarse. En este caso, el servidor elige automáticamente el que está menos ocupado. Alternativamente, puedes elegir un backend específico para ejecutar tu programa.
ja_jp: 上記の例では、実行するバックエンドを指定せずにRuntimeプログラムを呼び出しました。 この場合、サーバーは最もビジーでないものを自動的に選択します。 または、特定のバックエンドを選択してプログラムを実行することもできます。
ko_kr: 위의 예제에서는 실행하려는 백엔드를 지정하지 않고 런타임 프로그램을 호출했다. 이 경우 서버는 사용량이 가장 적은 항목을 자동으로 선택한다. 반면 특정 백엔드를 선택하여 프로그램을 실행할 수도 있다.
pt_un: No exemplo acima, invocamos um programa de runtime sem especificar em qual backend ele deve ser executado. Neste caso, o servidor escolhe automaticamente aquele que estiver menos ocupado. Como alternativa, você pode escolher um backend específico para executar seu programa.

source: To list all the backends you have access to:
es_un: Para enlistar todos los backends a los que tienes acceso:
ja_jp: アクセス権限を持つすべてのバックエンドをリストするには、以下のようにします。
pt_un: Para listar todos os backends aos quais temos acesso:

source: The `QiskitRuntimeService.backends() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.backends>`__ method also takes filters. For example, to find all real devices that have at least five qubits:
es_un: El método `QiskitRuntimeService.backends() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.backends>`__ también acepta filtros. Por ejemplo, para encontrar todos los dispositivos reales que tengan al menos cinco qubits:
ja_jp: `QiskitRuntimeService.backends() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.backends>`__ メソッドもフィルターを使用します。 例えば、少なくとも 5 つの量子ビットがあるすべての実装置を検索するには、次のようにします
pt_un: O método `QiskitRuntimeService.backends() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.backends>`__ também aceita filtros. Por exemplo, para encontrar todos os dispositivos reais que tenham pelo menos cinco qubits:

source: `QiskitRuntimeService.backends() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.backends>`__ returns a list of `IBMBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__ instances. Each instance represents a particular backend. Attributes and methods of an ``IBMBackend`` provide more information about the backend, such as its qubit count, error rate, and status.
es_un: `QiskitRuntimeService.backends() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.backends>`__ devuelve una lista de instancias `IBMBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__. Cada instancia representa un backend particular. Los atributos y métodos de un ``IBMBackend`` brindan más información sobre el backend, como el conteo de qubits, la tasa de error y el estado.
ja_jp: `QiskitRuntimeService.backends() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.backends>`__ は、 `IBMBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__ インスタンスのリストを返します。 各インスタンスは、特定のバックエンドを表します。 ``IBMBackend`` の属性およびメソッドは、量子ビット数、エラー率、状態など、バックエンドについての詳細情報を提供します。
ko_kr: `QiskitRuntimeService.backends() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.backends>`__ 는 `IBMBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__ 인스턴스의 리스트를 반환한다. 각각의 인스턴스는 특정한 백엔드를 나타낸다. ``IBMBackend`` 의 속성과 메서드는 큐비트 개수, 오류율, 상태 같은 백엔드에 관한 추가 정보를 제공한다.
pt_un: `QiskitRuntimeService.backends() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.backends>`__ retorna uma lista de instâncias `IBMBackend <https://qiskit. org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__. Cada instância representa um back-end específico. Atributos e métodos de um ``IBMBackend`` fornecem mais informações sobre o backend, como sua contagem de qubits, taxa de erro e status.

source: For more information about backends, such as commonly used attributes, see `03_backends.ipynb <03_backends.ipynb>`__.
es_un: Para obtener más información sobre los backends, como los atributos de uso común, consulta `03_backends.ipynb <03_backends.ipynb>`__.
ja_jp: 一般的に使用される属性など、バックエンドの詳細は、 `03_backends.ipynb <03_backends.ipynb>`__ を参照してください。
ko_kr: 일반적으로 사용되는 속성과 같은 백엔드에 대한 자세한 정보는 `03_backends.ipynb <03_backends.ipynb>`__ 를 참조하라.
pt_un: Para obter mais informações sobre backends, como atributos comumente usados, consulte `03_backends.ipynb <03_backends.ipynb>`__.

source: Once you select a backend to use, you can specify the name of the backend in the ``options`` parameter:
es_un: Una vez que selecciones un backend a usar, puedes especificar el nombre del backend en el parámetro ``options``:
ja_jp: 使用するバックエンドを選択すると、 ``options`` パラメーターにバックエンドの名前を指定することができます。
ko_kr: 사용할 백엔드를 선택하면 ``options`` 매개변수에 백엔드의 이름을 지정할 수 있다.
pt_un: Depois de selecionar um backend a ser usado, você pode especificar o nome do backend no parâmetro ``options``:

source: Retrieving previously run jobs
es_un: Recuperar los trabajos ejecutados anteriormente
ja_jp: 以前に実行されたジョブの取得
ko_kr: 이전에 실행된 작업을 가져오기
pt_un: Recuperando jobs executados anteriormente

source: You can use the `QiskitRuntimeService.job() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.job>`__ method to retrieve a previously executed runtime job. Attributes of this `RuntimeJob <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`__ instance can tell you about the execution:
es_un: Puedes utilizar el método `QiskitRuntimeService.job() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.job>`__ para recuperar un trabajo de runtime ejecutado anteriormente. Los atributos de esta instancia `RuntimeJob <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`__ pueden informarte sobre la ejecución:
ja_jp: `QiskitRuntimeService.job() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.job>`__ メソッドを使用して、以前に実行されたRuntimeJobを取得できます。 この`RuntimeJob <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`__ の属性により、実行について以下のことが分かります。
ko_kr: `QiskitRuntimeService.job() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.job>`__ 메서드를 사용하여 이전에 실행된 런타임 작업을 검색할 수 있다. 이 `RuntimeJob <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`__ 인스턴스의 속성은 실행에 대한 정보를 줄 수 있다:
pt_un: Você pode usar o método `QiskitRuntimeService.job() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.job>`__ para recuperar uma tarefa de runtime executada anteriormente. Os atributos desta instância `RuntimeJob <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeJob.html#qiskit_ibm_runtime.RuntimeJob>`__ podem informar sobre a execução:

source: Similarly, you can use `QiskitRuntimeService.jobs() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.jobs>`__ to get a list of jobs. You can specify a limit on how many jobs to return. The default limit is 10:
es_un: De manera similar, puedes usar `QiskitRuntimeService.jobs() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.jobs>`__ para obtener una lista de trabajos. Puedes especificar un límite sobre cuántos trabajos devolver. El límite predeterminado es 10:
ja_jp: 同様に、 `QiskitRuntimeService.jobs() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.jobs>`__ を使用して、ジョブのリストを取得できます。 返されるジョブの数に制限を指定できます。 デフォルトの制限は 10です。
ko_kr: 이와 유사하게, `QiskitRuntimeService.jobs() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.jobs>`__ 를 사용하여 작업 목록을 얻을 수 있다. 반환할 작업 수에 대한 한계를 지정할 수 있다. 기본 한계는 10개이다.
pt_un: Da mesma forma, podemos usar `QiskitRuntimeService.jobs() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.jobs>`__ para obter uma lista de tarefas. Podemos especificar um limite de quantos jobs retornar. O limite padrão é 10:

source: Deleting a job
es_un: Eliminar un trabajo
ja_jp: ジョブの削除
ko_kr: 작업 삭제하기
pt_un: Deletando um job
