Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/01_introduction_ibm_cloud_runtime.po
Languages: es_un, ja_jp, ko_kr, pt_un, ta_in

source: You can use the `QiskitRuntimeService.delete_job() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.delete_job>`__ method to delete a job. You can only delete your own jobs, and this action cannot be reversed.
es_un: Puedes utilizar el método `QiskitRuntimeService.delete_job() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.delete_job>`__ para eliminar un trabajo. Solo puedes eliminar tus propios trabajos y esta acción no se puede revertir.
ja_jp: ジョブを削除するには、`QiskitRuntimeService.delete_job() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.delete_job>`__ メソッドを使用できます。 自分のジョブのみを削除することができ、このアクションを元に戻すことはできません
ko_kr: `QiskitRuntimeService.delete_job() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.delete_job>`__ 메서드를 사용하여 작업을 삭제할 수 있다. 사용자 자신의 작업만 삭제할 수 있으며 되돌릴 수 없다.
pt_un: Podemos usar o método `QiskitRuntimeService.delete_job() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.delete_job>`__ para excluir uma tarefa. Só podemos excluir nossos próprios trabalhos e essa ação não pode ser revertida.

source: Next steps
es_un: Siguientes pasos
ja_jp: 次のステップ
ko_kr: 다음 단계
pt_un: Próximos Passos

source: There are additional tutorials in this directory:
es_un: Hay tutoriales adicionales en este directorio:
ja_jp: このディレクトリーには追加のチュートリアルがあります。
ko_kr: 이 디렉토리에는 다음과 같은 추가 튜토리얼이 있다:
pt_un: Existem tutoriais adicionais neste diretório:

source: `02_introduction_ibm_quantum_runtime.ipynb <02_introduction_ibm_quantum_runtime.ipynb>`__ is the corresponding tutorial on using Qiskit Runtime on IBM Quantum. You can skip this tutorial if you don’t plan on using Qiskit Runtime on IBM Quantum.
es_un: `02_introduction_ibm_quantum_runtime.ipynb <02_introduction_ibm_quantum_runtime.ipynb>`__ es el tutorial correspondiente sobre el uso de Qiskit Runtime en IBM Quantum. Puedes omitir este tutorial si no planeas usar Qiskit Runtime en IBM Quantum.
ja_jp: `02_introduction_ibm_quantum_runtime.ipynb <02_introduction_ibm_quantum_runtime.ipynb>`__ Aは、IBM Quantum での Qiskit Runtime の使用に関する対応するチュートリアルです。 IBM Quantum で Qiskit Runtime を使用する予定がない場合は、このチュートリアルをスキップできます。
pt_un: `02_introduction_ibm_quantum_runtime.ipynb <02_introduction_ibm_quantum_runtime.ipynb>`__ é o tutorial correspondente sobre como usar o Qiskit Runtime no IBM Quantum. Você pode pular este tutorial se não planeja usar o Qiskit Runtime no IBM Quantum.

source: `03_backends.ipynb <03_backends.ipynb>`__ describes how to find a target backend for the Qiskit Runtime program you want to invoke.
es_un: `03_backends.ipynb <03_backends.ipynb>`__ describe cómo encontrar un backend de destino para el programa Qiskit Runtime que deseas invocar.
ja_jp: `03_backends.ipynb <03_backends.ipynb>`__ は、呼び出す Qiskit Runtime プログラムのターゲット・バックエンドを検出する方法を説明しています。
ko_kr: `03_backends.ipynb <03_backends.ipynb>`__ 는 호출하려는 Qiskit 런타임 프로그램의 대상 백엔드를 찾는 방법에 대해 설명한다.
pt_un: `03_backends.ipynb <03_backends.ipynb>`__ descreve como encontrar um backend de destino para o programa Qiskit Runtime que você deseja invocar.

source: `04_account_management.ipynb <04_account_management.ipynb>`__ describes how to save, load, and delete your account credentials on disk.
es_un: `04_account_management.ipynb <04_account_management.ipynb>`__ describe cómo guardar, cargar y eliminar las credenciales de tu cuenta en el disco.
ja_jp: `04_account_management.ipynb <04_account_management.ipynb>`__ は、ディスク上のアカウント資格情報を保存、ロード、および削除する方法について説明しています。
ko_kr: `04_account_management.ipynb <04_account_management.ipynb>`__ 는 디스크에서 계정 증명서를 저장, 로드 및 삭제하는 방법에 대해 설명한다.
pt_un: `04_account_management.ipynb <04_account_management.ipynb>`__ descreve como salvar, carregar e excluir suas credenciais de conta no disco.

source: `qiskit_runtime_vqe_program.ipynb <sample_vqe_program/qiskit_runtime_vqe_program.ipynb>`__ goes into more details on uploading a real-world program (VQE).
ja_jp: `qiskit_runtime_vqe_program.ipynb <sample_vqe_program/qiskit_runtime_vqe_program.ipynb>`__ は、実世界のプログラム（VQE）のアップロードについて詳しく説明します。
ko_kr: `qiskit_runtime_vqe_program.ipynb <sample_vqe_program/qiskit_runtime_vqe_program.ipynb>`__ 에서는 실제 프로그램 (VQE) 업로드에 대한 자세한 내용을 확인할 수 있다.

source: `qka.ipynb <qka.ipynb>`__, `vqe.ipynb <vqe.ipynb>`__, and `qiskit_runtime_expval_program.ipynb <sample_expval_program/qiskit_runtime_expval_program.ipynb>`__ describe how to use the public programs ``qka``, ``vqe``, and ``sample-expval``, respectively. These programs are currently only available in Qiskit Runtime on IBM Quantum.
ja_jp: `qka.ipynb <qka.ipynb>`__ 、 `vqe.ipynb <vqe.ipynb>`__ および `qiskit_runtime_expval_program.ipynb <sample_expval_program/qiskit_runtime_expval_program.ipynb>`__ は、それぞれ ``qka`` 、 ``vqe`` および ``sample-expval`` を使用する方法を説明します。 これらのプログラムは現在、 IBM Quantumの Qiskit Runtime でのみ使用可能です。
ko_kr: `qka.ipynb <qka.ipynb>`__, `vqe.ipynb <vqe.ipynb>`__, 그리고 `qiskit_runtime_expval_program.ipynb <sample_expval_program/qiskit_runtime_expval_program.ipynb>`__ 는 각각 ``qka``, ``vqe``, 그리고 ``sample-expval`` 이라는 공용 프로그램을 사용하는 방법을 설명하고 있다. 이러한 프로그램은 현재 IBM Quantum의 Qiskit Runtime 에서만 사용할 수 있다.

source: Runtime job
es_un: Trabajo de runtime
ko_kr: 런타임 작업
ta_in: இயக்க நேர வேலை

source: ``job_id()``: Unique identifier of the job.
es_un: ``job_id()``: Identificador único del trabajo.

source: ``backend()``: The backend where the job is run.
es_un: ``backend()``: El backend donde se ejecuta el trabajo.

source: Some of the ``RuntimeJob`` attributes: - ``program_id``: ID of the program the execution is for.
es_un: Algunos de los atributos de ``RuntimeJob``: - ``program_id``: ID del programa para el que es la ejecución.

source: qiskit-ibm-runtime
ta_in: qiskit-ibm-இயக்க நேரம்
