Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/01_introduction_ibm_cloud_runtime.po
Languages: es_un, ja_jp, ko_kr, pt_un, ta_in

source: This page was generated from `docs/tutorials/01_introduction_ibm_cloud_runtime.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/01_introduction_ibm_cloud_runtime.ipynb`__.
ja_jp: このページは `docs/tutorials/01_introduction_ibm_cloud_runtime.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/01_introduction_ibm_cloud_runtime.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/01_introduction_ibm_cloud_runtime.ipynb`__.
ta_in: இந்தப் பக்கம் `docs/tutorials/01_introduction_ibm_cloud_runtime.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Qiskit Runtime on IBM Cloud
es_un: Qiskit Runtime en IBM Cloud
ja_jp: IBM Cloud 上の Qiskit Runtime
ko_kr: IBM Cloud의 Qiskit 런타임
pt_un: Qiskit Runtime na IBM Cloud
ta_in: IBM கிளவுட்டில் Qiskit இயக்க நேரம்

source: Qiskit Runtime is now part of the IBM Quantum Services on IBM Cloud. To use this service, you’ll need to create an IBM Cloud account and a quantum service instance. `This guide <https://cloud.ibm.com/docs/account?topic=account-account-getting-started>`__ contains step-by-step instructions on setting up the account and `this page <https://cloud.ibm.com/docs/quantum-computing?topic=quantum-computing-quickstart>`__ explains how to create a service instance, including directions to find your IBM Cloud API key and Cloud Resource Name (CRN), which you will need later in this tutorial.
es_un: Qiskit Runtime ahora forma parte de IBM Quantum Services en IBM Cloud. Para utilizar este servicio, deberás crear una cuenta de IBM Cloud y una instancia de servicio cuántico. `Esta guía <https://cloud.ibm.com/docs/account?topic=account-account-getting-started>`__ contiene instrucciones paso a paso sobre cómo configurar la cuenta y `esta página <https://cloud.ibm.com/docs/quantum-computing?topic=quantum-computing-quickstart>`__ explica cómo crear una instancia de servicio, incluidas las instrucciones para encontrar tu clave de API de IBM Cloud y el Nombre del Recurso de la Nube (Cloud Resource Name, CRN), que necesitarás más adelante en este tutorial.
ja_jp: Qiskit Runtime は、IBM Cloud 上の IBM Quantum Services の一部となっています。このサービスを使用するには、 IBM Cloud アカウントと量子サービス・インスタンスを作成する必要があります。 `このガイド <https://cloud.ibm.com/docs/account?topic=account-account-getting-started>`__ には、アカウントをセットアップするための段階的な説明が含まれています。 `このページ <https://cloud.ibm.com/docs/quantum-computing?topic=quantum-computing-quickstart>`__ では、サービス・インスタンスを作成する方法を説明します。これには、 IBM Cloud API キーとクラウド・リソース名 (Cloud Resource Name、CRN) を検索するための指示が含まれます。このチュートリアルでは、後で必要になります。
ko_kr: Qiskit 런타임은 이제 IBM 클라우드에 있는 IBM 양자 서비스 (Quantum Services)의 일부이다. 이 서비스를 사용하려면, IBM 클라우드 계정과 퀀텀 서비스 인스턴스를 만들어야 한다. `이 가이드 <https://cloud.ibm.com/docs/account?topic=account-account-getting-started>`__ 에는 계정 설정에 대한 단계별 지침이 포함되어 있으며 `이 페이지 <https://cloud.ibm.com/docs/quantum-computing?topic=quantum-computing-quickstart>`__ 에서는 이 튜토리얼에서 나중에 필요한 IBM 클라우드 API 키와 CRN (Cloud Resource Name)을 찾는 방법을 포함하여 서비스 인스턴스를 생성하는 방법을 설명한다.
pt_un: O Qiskit Runtime agora faz parte do IBM Quantum Services on IBM Cloud. Para usar esse serviço, você precisará criar uma conta do IBM Cloud e uma instância de serviço quântico. `Este guia <https://cloud.ibm.com/docs/account?topic=account-account-getting-started>`__ contém instruções passo a passo sobre como configurar a conta e `esta página <https:/ /cloud.ibm.com/docs/quantum-computing?topic=quantum-computing-quickstart>`__ explica como criar uma instância de serviço, incluindo instruções para localizar sua chave de API do IBM Cloud e Cloud Resource Name (CRN), que você vai precisar mais tarde neste tutorial.
ta_in: Qiskit இயக்க நேரம் இப்போது IBM Cloud இல் IBM குவாண்டம் சேவைகளின் ஒரு பகுதியாகும். இந்தச் சேவையைப் பயன்படுத்த, நீங்கள் IBM Cloud கணக்கையும் குவாண்டம் சேவை நிகழ்வையும் உருவாக்க வேண்டும். `இந்த வழிகாட்டி <https://cloud.ibm.com/docs/account?topic=account-account-getting-started>`__ கணக்கை அமைப்பதற்கான படிப்படியான வழிமுறைகள் மற்றும் `இந்தப் பக்கத்தை <https:/ /cloud.ibm.com/docs/quantum-computing?topic=quantum-computing-quickstart>`__ உங்கள் IBM கிளவுட் API விசை மற்றும் Cloud Resource Name (CRN) ஆகியவற்றைக் கண்டுபிடிப்பதற்கான வழிமுறைகள் உட்பட, சேவை நிகழ்வை எவ்வாறு உருவாக்குவது என்பதை விளக்குகிறது.

source: This tutorial assumes that you know how to use Qiskit, including using it to create circuits. If you are not familiar with Qiskit, the `Qiskit Textbook <https://qiskit.org/textbook/preface.html>`__ is a great resource to learn about both Qiskit and quantum computation in general.
es_un: Este tutorial supone que sabes cómo usar Qiskit, incluido su uso para crear circuitos. Si no estás familiarizado con Qiskit, el `Libro de texto de Qiskit <https://qiskit.org/textbook/preface.html>`__ es un gran recurso para aprender sobre Qiskit y la computación cuántica en general.
ja_jp: このチュートリアルは、回路作成を含むQiskitの使用方法を理解していることを前提としています。Qiskitに慣れていない場合、 `Qiskit Textbook <https://qiskit.org/textbook/preface.html>`__ は、Qiskitと量子計算の両方について一般的に学ぶための優れたリソースです。
ko_kr: 이 튜토리얼에서는 사용자가 Qiskit을 사용하여 회로를 작성하는 방법을 포함하여 Qiskit 사용 방법을 알고 있다고 가정한다. Qiskit에 익숙하지 않다면, `Qiskit 교과서 <https://qiskit.org/textbook/preface.html>`__ 는 Qiskit과 양자 연산 모두를 전반적으로 배울 수 있는 훌륭한 자료이다.
pt_un: Este tutorial pressupõe que saibamos como usar o Qiskit, incluindo usá-lo para criar circuitos. Se não estiver familiarizado com o Qiskit, o `Qiskit Textbook <https://qiskit.org/textbook/preface.html>`__ é um ótimo recurso para aprender sobre Qiskit e computação quântica em geral.
ta_in: சர்க்யூட்களை உருவாக்குவது உட்பட, Qiskit எப்படிப் பயன்படுத்துவது என்பது உங்களுக்குத் தெரியும் என்று இந்த டுடோரியல் கருதுகிறது. Qiskit பற்றி உங்களுக்குத் தெரியாவிட்டால், `Qiskit Textbook <https://qiskit.org/textbook/preface.html>`__ என்பது Qiskit மற்றும் குவாண்டம் கணிப்பீடு இரண்டையும் பற்றி அறிய சிறந்த ஆதாரமாகும்.

source: Once you have an IBM Cloud account and service instance set up, you can use ``qiskit-ibm-runtime`` to access Qiskit Runtime on IBM Cloud. ``qiskit-ibm-runtime`` provides the interface to interact with Qiskit Runtime. You can, for example, use it to query and execute runtime programs.
es_un: Una vez que hayas configurado una cuenta de IBM Cloud y una instancia de servicio, puedes utilizar ``qiskit-ibm-runtime`` para acceder a Qiskit Runtime en IBM Cloud. ``qiskit-ibm-runtime`` proporciona la interfaz para interactuar con Qiskit Runtime. Puedes, por ejemplo, usarlo para consultar y ejecutar programas runtime.
ja_jp: IBM Cloud アカウント とサービス・インスタンスをセットアップしたら、``qiskit-ibm-runtime`` を使用して IBMクラウド上の Qiskit Runtime にアクセスできます。``qiskit-ibm-runtime`` は、Qiskit Runtime と対話するためのインターフェースを提供します。 たとえば、Runtimeプログラムのクエリと実行に使用できます。
ko_kr: IBM 클라우드 계정이 있고 서비스 인스턴스를 설정했다면, ``qiskit-ibm-runtime`` 을 이용해서 IBM 클라우드의 Qiskit 런타임에 접근할 수 있다. ``qiskit-ibm-runtime`` 은 Qiskit 런타임과 상호 작용할 수 있는 인터페이스를 제공한다. 예를 들어, 런타임 프로그램들을 조회하고 실행하는 데 사용할 수 있다.
pt_un: Depois de configurar uma conta do IBM Cloud e uma instância de serviço, é possível usar ``qiskit-ibm-runtime`` para acessar o Qiskit Runtime no IBM Cloud. ``qiskit-ibm-runtime`` fornece a interface para interagir com o Qiskit Runtime. Você pode, por exemplo, usá-lo para consultar e executar programas de runtime.
ta_in: IBM கிளவுட் கணக்கு மற்றும் சேவை நிகழ்வை அமைத்தவுடன், IBM கிளவுடில் Qiskit இயக்க நேரத்தை அணுக ``qiskit-ibm-இயக்க நேரம்`` ஐப் பயன்படுத்தலாம். ``qiskit-ibm-இயக்க நேரம்`` என்பது Qiskit இயக்க நேரத்துடன் தொடர்புகொள்வதற்கான இடைமுகத்தை வழங்குகிறது. எடுத்துக்காட்டாக, இயக்க நேர நிரல்களை வினவவும் இயக்கவும் இதைப் பயன்படுத்தலாம்.

source: Installation
es_un: Instalación
ja_jp: インストール
ko_kr: 설치
pt_un: Instalação
ta_in: நிறுவல்

source: You can install the ``qiskit-ibm-runtime`` package using pip:
es_un: Puedes instalar el paquete ``qiskit-ibm-runtime`` usando pip:
ja_jp: pipを使用して ``qiskit-ibm-runtime`` パッケージをインストールできます。
ko_kr: pip를 이용해서 ``qiskit-ibm-runtime`` 패키지를 설치할 수 있다:
pt_un: Você pode instalar o pacote ``qiskit-ibm-runtime`` usando pip:
ta_in: Pip ஐப் பயன்படுத்தி ``qiskit-ibm-இயக்க நேரம்`` தொகுப்பை நிறுவலாம்:

source: Account initialization
es_un: Inicialización de la cuenta
ja_jp: アカウント初期化
ko_kr: 계정 초기화
pt_un: Inicialização de conta
ta_in: கணக்கு துவக்கம்

source: Before you can start using Qiskit Runtime, you need to initialize your account by calling ``QiskitRuntimeService`` with your IBM Cloud API key and the CRN or service name of your service instance.
es_un: Antes de que puedas comenzar a utilizar Qiskit Runtime, debes inicializar tu cuenta llamando a ``QiskitRuntimeService`` con tu clave de API de IBM Cloud y el CRN o nombre de servicio de tu instancia de servicio.
ja_jp: Qiskit Runtime の使用を開始する前に、 IBM Cloud API キー、およびサービス・インスタンスの CRN またはサービス名を使用して ``QiskitRuntimeService`` を呼び出して、アカウントを初期化する必要があります。
ko_kr: Qiskit 런타임 이용을 시작하기 전에, ``QiskitRuntimeService`` 를 IBM 클라우드 API 키와 CRN 또는 서비스 인스턴스의 서비스 이름과 함께 호출하여 계정을 초기화해야 한다.
pt_un: Antes de começar a usar o Qiskit Runtime, precisamos inicializar sua conta chamando ``QiskitRuntimeService`` com sua chave de API do IBM Cloud e o CRN ou nome de serviço de sua instância de serviço.
ta_in: நீங்கள் Qiskit இயக்க நேரத்தைப் பயன்படுத்தத் தொடங்குவதற்கு முன், உங்கள் IBM கிளவுட் API விசை மற்றும் CRN அல்லது உங்கள் சேவையின் பெயருடன் ``Qiskit இயக்க நேர சேவை`` என்று அழைப்பதன் மூலம் உங்கள் கணக்கை துவக்க வேண்டும்.

source: You can also choose to save your credentials on disk (in the ``$HOME/.qiskit/qiskit-ibm.json`` file). By doing so, you only need to use ``QiskitRuntimeService()`` in the future to initialize your account.
es_un: También puedes optar por guardar tus credenciales en el disco (en el archivo ``$HOME/.qiskit/qiskit-ibm.json``). Al hacerlo, solo necesitas usar ``QiskitRuntimeService()`` en el futuro para inicializar tu cuenta.
ja_jp: 資格情報をディスク ( ``$HOME/.qiskit/qiskit-ibm.json`` ファイル内 )に保存することを選択することもできます。そうすることで、将来的にアカウントを初期化するのに ``QiskitRuntimeService()`` を使用するだけで済みます。
ko_kr: 증명서를 (``$HOME/.qiskit/qiskit-ibm.json`` 파일안에 있는) 디스크에 저장하도록 선택할 수 있다. 이렇게 하면 앞으로 ``QiskitRuntimeService()`` 을 사용해서 계정을 초기화하면 된다.
pt_un: Também podemos optar por salvar suas credenciais em disco (no arquivo ``$HOME/.qiskit/qiskit-ibm.json``). Ao fazer isso, só precisamos usar ``QiskitRuntimeService()`` no futuro para inicializar sua conta.
ta_in: உங்கள் சான்றாதாரங்களை வட்டில் (``$HOME/.qiskit/qiskit-ibm.json`` கோப்பில்) சேமிக்கவும் நீங்கள் தேர்ந்தெடுக்கலாம். அவ்வாறு செய்வதன் மூலம், உங்கள் கணக்கை ஆரம்பிப்பதற்கு எதிர்காலத்தில் நீங்கள் மட்டுமே ``QiskitRuntimeService()`` ஐ பயன்படுத்த வேண்டும்.

source: For more information about account management, such as how to delete or view an account, see `04_account_management.ipynb <04_account_management.ipynb>`__.
es_un: Para obtener más información sobre la administración de cuentas, por ejemplo, cómo eliminar o ver una cuenta, consulta `04_account_management.ipynb <04_account_management.ipynb>`__.
ja_jp: アカウントの削除や表示の方法などのアカウント管理について、詳しくは `04_account_management.ipynb <04_account_management.ipynb>`__を参照してください。
ko_kr: 계정을 삭제하거나 보는 방법과 같은 계정 관리에 대한 정보는 `04_account_management.ipynb <04_account_management.ipynb>`__ 를 참조하면 된다.
pt_un: Para obter mais informações sobre gerenciamento de contas, como excluir ou visualizar uma conta, consulte `04_account_management.ipynb <04_account_management.ipynb>`__.
ta_in: கணக்கை எவ்வாறு நீக்குவது அல்லது பார்ப்பது போன்ற கணக்கு மேலாண்மை பற்றிய கூடுதல் தகவலுக்கு, `<04_account_management.ipynb>`__ ஐப் பார்க்கவும்.

source: Note: Account credentials are saved in plain text, so only do so if you are using a trusted device.
es_un: Nota: Las credenciales de la cuenta se guardan en texto sin formato, así que solo hazlo si estás utilizando un dispositivo confiable.
ja_jp: 注記：アカウントの資格情報はプレーン・テキストで保存されるため、信頼できるデバイスを使用している場合にのみ実行してください。
ko_kr: 참고: 계정 증명서는 일반 텍스트로 저장되므로, 신뢰할 수 있는 장치를 사용하고 있는 경우에만 저장하라.
pt_un: Nota: as credenciais da conta são salvas em texto simples, portanto, faça isso apenas se estiver usando um dispositivo confiável.
ta_in: குறிப்பு: கணக்கு நற்சான்றிதழ்கள் எளிய உரையில் சேமிக்கப்படும், எனவே நீங்கள் நம்பகமான சாதனத்தைப் பயன்படுத்தினால் மட்டுமே அவ்வாறு செய்யுங்கள்.

source: The ``<IBM Cloud API key>`` in the example above is your IBM Cloud API key and looks something like
es_un: La ``<IBM Cloud API key>`` en el ejemplo anterior es tu clave de API de IBM Cloud y se parece a
ja_jp: 上の例の ``<IBM Cloud API key>`` は IBM Cloud API キーで、次のようになります。
ko_kr: 위의 예제에 있는 ``<IBM Cloud API key>`` 는 IBM 클라우드 API 키이며 다음과 같은 것이다.
pt_un: A ``<IBM Cloud API key>`` no exemplo acima é sua chave de API do IBM Cloud e tem a seguinte forma
ta_in: மேலே உள்ள எடுத்துக்காட்டில் உள்ள ``<IBM கிளவுட் API விசை>`` என்பது உங்கள் IBM கிளவுட் API விசை மற்றும் இது போல் தெரிகிறது

source: The ``<IBM Cloud CRN>`` is the Cloud Resource Name and looks something like
es_un: El ``<IBM Cloud CRN>`` es el nombre del recurso de la nube y se parece a
ja_jp: ``<IBM Cloud CRN>`` は、クラウド・リソース名（Cloud Resource Name、CRN）で、以下のようになります。
ko_kr: ``<IBM Cloud CRN>`` 는 Cloud Resource Name 이며 다음과 같이 생긴 것이다.
pt_un: O ``<IBM Cloud CRN>`` é o nome do recurso de nuvem (Cloud Resource Name) e tem a forma
ta_in: ``<IBM கிளவுட் CRN>`` என்பது கிளவுட் ரிசோர்ஸ் பெயர் மற்றும் ஏதோ ஒன்று போல் தெரிகிறது

source: The ``<IBM Cloud service name>`` is user-provided and defaults to something like
es_un: El ``<IBM Cloud service name>`` lo proporciona el usuario y su valor predeterminado es algo como
ja_jp: ``<IBM Cloud service name>`` はユーザーが提供するもので、デフォルトでは以下のようになります。
ko_kr: ``<IBM Cloud service name>`` 는 사용자가 제공하는 것으로 기본적으로 다음과 같은 것이다.
pt_un: O ``<IBM Cloud service name>`` é fornecido pelo usuário e o padrão é algo como
ta_in: ``<IBM கிளவுட் சேவையின் பெயர்>`` என்பது பயனர் வழங்கியது மற்றும் இயல்புநிலையானது

source: If you choose to set ``instance`` to the service name, the initialization time of the ``QiskitRuntimeService`` is slightly higher because the required ``CRN`` value is internally resolved via IBM Cloud APIs.
es_un: Si eliges colocar ``instance`` en el nombre del servicio, el tiempo de inicialización de ``QiskitRuntimeService`` es ligeramente mayor porque el valor de ``CRN`` requerido se resuelve internamente a través de las APIs de IBM Cloud.
ja_jp: ``instance`` をサービス名に設定することを選択した場合、必要な ``CRN`` 値は IBM Cloud API を介して内部的に解決されるため、 ``QiskitRuntimeService`` の初期化の時間はわずかに長くなります。
ko_kr: 서비스 이름에 ``instance`` 를 설정하도록 선택하면 필수적인 ``CRN`` 값이 내부적으로는 IBM 클라우드 API를 통해 결정되기 때문에 ``QiskitRuntimeService`` 의 초기화 시간이 약간 더 걸린다.
pt_un: Se você optar por configurar ``instance`` para o nome do serviço, o tempo de inicialização do ``QiskitRuntimeService`` será um pouco maior porque o valor ``CRN`` necessário é resolvido internamente por meio das APIs do IBM Cloud.
ta_in: நீங்கள் சேவை பெயருக்கு ``நிகழ்வு`` அமைக்கத் தேர்வு செய்தால், ``Qiskit இயக்க நேர சேவை`` இன் தொடக்க நேரம் சற்று அதிகமாக இருக்கும், ஏனெனில் தேவையான ``CRN`` மதிப்பு IBM கிளவுட் API கள் மூலம் உட்புறமாகத் தீர்க்கப்படுகிறது.

source: Listing programs
es_un: Listado de programas
ja_jp: プログラムのリスト
ko_kr: 프로그램 목록을 나열하기
pt_un: Listando programas
ta_in: பட்டியல் நிரல்கள்

source: There are three methods that can be used to find metadata of available programs:
es_un: Hay tres métodos que se pueden utilizar para encontrar metadatos de los programas disponibles:
ja_jp: 使用可能なプログラムのメタデータを検索するために使用できる方法は 3 つあります。
ko_kr: 사용 가능한 프로그램의 메타데이터를 찾는 데 사용할 수 있는 세 가지 메서드가 있다.
pt_un: Existem três métodos que podem ser usados para encontrar metadados de programas disponíveis:
ta_in: கிடைக்கக்கூடிய நிரல்களின் மெட்டாடேட்டாவைக் கண்டறிய மூன்று முறைகள் பயன்படுத்தப்படலாம்:

source: ``pprint_programs()``: pretty prints summary metadata of available programs
es_un: ``pprint_programs()``: impresiones bonitas de resumen de metadatos de los programas disponibles
ja_jp: ``pprint_programs()``: 使用可能なプログラムの要約メタデータをきれいに印字します。
ko_kr: ``pprint_programs()``: 사용 가능한 프로그램의 요약 메타데이터를 출력한다.
pt_un: ``pprint_programs()``: pretty imprime metadados resumidos dos programas disponíveis
ta_in: ``print_programs()``: கிடைக்கக்கூடிய நிரல்களின் சுருக்கப்பட்ட மெடாதரவை அழகாக அச்சிடுகிறது

source: ``programs()``: returns a list of ``RuntimeProgram`` instances
es_un: ``programs()``: devuelve una lista de instancias de ``RuntimeProgram``
ja_jp: ``programs()``: ``RuntimeProgram`` インスタンスのリストを返します。
ko_kr: ``programs()``: ``RuntimeProgram`` 의 인스턴스의 목록을 반환한다.
pt_un: ``programs()``: retorna uma lista de instâncias de ``RuntimeProgram``
ta_in: ``நிரல்கள்()``: ``இயக்க நேர நிரல்`` நிகழ்வுகளின் பட்டியலை வழங்குகிறது

source: ``program()``: returns a single ``RuntimeProgram`` instance
es_un: ``program()``: devuelve una única instancia de ``RuntimeProgram``
ja_jp: ``program()``: 単一の ``RuntimeProgram`` インスタンスを返します。
ko_kr: ``program()``: 하나의 ``RuntimeProgram`` 인스턴스를 반환한다.
pt_un: ``program()``: retorna uma única instância ``RuntimeProgram``
ta_in: ``நிரல்()``: ஒற்றை ``இயக்க நேர நிரல்`` நிகழ்வை வழங்கும்

source: The metadata of a runtime program includes its ID, name, description, maximum execution time, backend requirements, input parameters, and return values. Maximum execution time is the maximum amount of time, in seconds, a program can run before being forcibly terminated.
es_un: Los metadatos de un programa runtime incluyen su ID, nombre, descripción, tiempo máximo de ejecución, requerimientos de backend, parámetros de entrada y valores de retorno. El tiempo máximo de ejecución es la cantidad máxima de tiempo, en segundos, que un programa puede ejecutarse antes de ser terminado por la fuerza.
ja_jp: Runtimeプログラムのメタデータには、ID、名前、説明、最大実行時間、バックエンド要件、入力パラメーター、および戻り値が含まれます。 最大実行時間は、プログラムが強制的に終了するまでに実行できる最大時間（秒単位）です。
ko_kr: 런타임 프로그램의 메타데이터에는 ID, 이름, 설명, 최대 실행 시간, 백엔드 요구 사항, 입력 매개변수, 반환 값이 포함된다. 최대 실행 시간은 프로그램이 강제로 종료되기 전에 실행할 수 있는 최대 시간 (초) 이다.
pt_un: Os metadados de um programa runtime incluem seu ID, nome, descrição, tempo máximo de execução, requisitos de back-end, parâmetros de entrada e valores de retorno. O tempo máximo de execução é a quantidade máxima de tempo, em segundos, que um programa pode ser executado antes de ser encerrado à força.
ta_in: இயக்க நேர நிரலின் மெட்டாடேட்டாவில் அதன் ஐடி, பெயர், விளக்கம், அதிகபட்ச செயலாக்க நேரம், பின்தளத்தில் தேவைகள், உள்ளீட்டு அளவுருக்கள் மற்றும் திரும்ப மதிப்புகள் ஆகியவை அடங்கும். அதிகபட்ச செயலாக்க நேரம் என்பது அதிகபட்ச நேரமாகும், சில நொடிகளில், ஒரு நிரல் வலுக்கட்டாயமாக நிறுத்தப்படுவதற்கு முன்பு இயக்க முடியும்.

source: To print the summary metadata of the programs (by default first 20 programs are displayed):
es_un: Para imprimir los metadatos de resumen de los programas (por defecto se muestran los primeros 20 programas):
ja_jp: プログラムの要約メタデータを印字するには（デフォルトでは最初の20個のプログラムが表示されます）：
ko_kr: 프로그램의 요약 메타데이터를 출력하려면 (기본적으로 처음 20개의 프로그램이 표시됨):
pt_un: Para imprimir os metadados resumidos dos programas (por padrão, os primeiros 20 programas são exibidos):
ta_in: நிரல்களின் சுருக்க மெட்டாடேட்டாவை அச்சிட (இயல்புநிலையாக முதல் 20 நிரல்கள் காட்டப்படும்):

source: You can use the ``limit`` and ``skip`` parameters in ``pprint_programs()`` and ``programs()`` to page through all programs.
es_un: Puedes usar los parámetros ``limit`` y ``skip`` en ``pprint_programs()`` y ``programs()`` para recorrer todos los programas.
ja_jp: ``limit`` および ``skip`` パラメーターを ``pprint_programs()`` および ``programs()`` で使用して、すべてのプログラムをページ送りにすることができます。
ko_kr: 모든 프로그램을 호출하기 위해 ``pprint_programs()`` 과 ``programs()`` 에서 ``limit`` 과 ``skip`` 을 매개변수로 사용할 수 있다.
pt_un: Você pode usar os parâmetros ``limit`` e ``skip`` em ``pprint_programs()`` e ``programs()`` para percorrer todos os programas.
ta_in: அனைத்து நிரல்களின் ஊடாகப் பக்கத்திற்கு ``pprint_programs()`` மற்றும் ``programs()`` என்பவற்றில் உள்ள ``limit`` மற்றும் ``skip`` அளவுருக்களைப் பயன்படுத்தலாம்.

source: You can pass ``detailed=True`` parameter to ``pprint_programs()`` to view all the metadata for the programs.
es_un: Puedes pasar el parámetro ``detailed=True`` a ``pprint_programs()`` para ver todos los metadatos de los programas.
ja_jp: ``detailed=True`` パラメーターを ``pprint_programs()`` に渡して、プログラムのすべてのメタデータを表示することができます。
ko_kr: 프로그램에 대한 모든 메타데이터를 보기 위해 ``detailed=True`` 매개변수를 ``pprint_programs()`` 으로 전달할 수 있다.
pt_un: Você pode passar o parâmetro ``detailed=True`` para ``pprint_programs()`` para visualizar todos os metadados dos programas.
ta_in: நிரல்களுக்கான அனைத்து மெட்டாடேட்டாவையும் பார்க்க, ``detailed=True`` அளவுருவை ``pprint_programs()`` க்கு அனுப்பலாம்.

source: The program metadata, once fetched, is cached for performance reasons. But you can pass the ``refresh=True`` parameter to get the latest data from the server.
es_un: Los metadatos del programa, una vez obtenidos, se almacenan en caché por motivos de rendimiento. Pero puedes pasar el parámetro ``refresh=True`` para obtener los últimos datos del servidor.
ja_jp: プログラムのメタデータは、フェッチされると、パフォーマンス上の理由からキャッシュされます。しかし、 ``refresh=True`` パラメーターを渡せば、サーバーから最新のデータを取得することができます。
ko_kr: 프로그램 메타데이터를 가져오면 성능상의 이유로 캐쉬된다. 하지만 ``refresh=True`` 매개변수를 전달해서 서버에서 최신 데이터를 가져올 수 있다.
pt_un: Os metadados do programa, uma vez obtidos, são armazenados em cache por motivos de desempenho. Mas você pode passar o parâmetro ``refresh=True`` para obter os dados mais recentes do servidor.
ta_in: நிரல் மெட்டாடேட்டா, பெறப்பட்டவுடன், செயல்திறன் காரணங்களுக்காகத் தற்காலிகமாகச் சேமிக்கப்படும். ஆனால் சேவையகத்திலிருந்து சமீபத்திய தரவைப் பெற, ``புதுப்பி = உண்மை`` அளவுருவை நீங்கள் அனுப்பலாம்.

source: To print the metadata of the program ``sampler``:
es_un: Para imprimir los metadatos del programa ``sampler``:
ja_jp: ``sampler`` プログラムのメタデータを印字するには：
ko_kr: 프로그램 ``sampler`` 의 메타데이터를 출력하려면:
pt_un: Para imprimir os metadados do programa ``sampler``:
ta_in: ``மாதிரி`` நிரலின் மெட்டாடேட்டாவை அச்சிட:

source: As you can see from above, the primitive ``sampler`` calculates the distributions generated by given circuits executed on the target backend. It takes a number of parameters, but ``circuits`` and ``circuit_indices`` are the only required parameters. When the program finishes, it returns the quasi-probabilities for each circuit.
es_un: Como puedes ver desde arriba, el ``sampler`` primitivo calcula las distribuciones generadas por los circuitos dados ejecutados en el backend de destino. Toma un número de parámetros, pero ``circuits`` y ``circuit_indices`` son los únicos parámetros requeridos. Cuando el programa finaliza, devuelve las cuasi probabilidades de cada circuito.
ja_jp: 上からわかるように、primitive ``sampler`` は、ターゲット・バックエンドで実行された特定の回路によって生成された分布を計算します。 いくつかのパラメータを取りますが、必要なパラメータは ``circuits`` と ``circuit_indices`` だけです。 プログラムが終了すると、各回路の擬確率が返されます。
ko_kr: 위에서 볼 수 있듯이 예제 ``sampler`` 는 타겟 백엔드에서 회로를 실행해서 얻은 확률 분포를 계산한다. 많은 매개변수를 사용하지만 ``circuits`` 와 ``circuit_indices`` 이 필수 매개변수이다. 프로그램이 완료되면 각 회로의 준확률을 반환한다.
pt_un: Como você pode ver acima, o primitivo ``sampler`` calcula as distribuições geradas por determinados circuitos executados no backend de destino. São necessários vários parâmetros, mas ``circuits`` e ``circuit_indices`` são os únicos parâmetros necessários. Quando o programa termina, ele retorna as quase-probabilidades de cada circuito.
ta_in: மேலே இருந்து நீங்கள் பார்ப்பது போல், முதன்மையான ``மாதிரி`` இலக்கு பின்தளத்தில் செயல்படுத்தப்படும் கொடுக்கப்பட்ட சுற்றுகளால் உருவாக்கப்பட்ட விநியோகங்களைக் கணக்கிடுகிறது. இதற்கு பல அளவுருக்கள் தேவை, ஆனால் ``சர்க்யூட்ஸ்`` மற்றும் ``சர்க்யூட்_இன்டிஸ்`` ஆகியவை மட்டுமே தேவையான அளவுருக்கள். நிரல் முடிந்ததும், அது ஒவ்வொரு சுற்றுக்கும் அரை-நிகழ்தகவுகளை வழங்குகிறது.

source: Invoking a runtime program
es_un: Invocación de un programa runtime
ja_jp: Runtimeプログラムの呼び出し
ko_kr: 런타임 프로그램 호출하기
pt_un: Invocando um programa de runtime
ta_in: இயக்கனேர நிரலை துவக்குகிறது
