Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/03_backends.po
Languages: es_un, ko_kr, pt_un

source: This page was generated from `docs/tutorials/03_backends.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/03_backends.ipynb`__.
ko_kr: 이 페이지는 `docs/tutorials/03_backends.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/03_backends.ipynb`__.

source: Backends
ko_kr: 백엔드

source: A **backend** represents either a simulator or a real quantum computer and are responsible for running quantum circuits and/or pulse schedules and returning results.
es_un: Un **backend** representa un simulador o una computadora cuántica real y es responsable de ejecutar circuitos cuánticos y/o planificadores de pulsos y devolver resultados.
ko_kr: **백엔드** 는 시뮬레이터 또는 실제 양자 컴퓨터를 나타내며, 양자 회로 및/또는 펄스 스케줄을 실행하고 결과를 반환하는 역할을 한다.
pt_un: Um **backend** representa um simulador ou um computador quântico real e é responsável por executar circuitos quânticos e/ou programações de pulso e retornar resultados.

source: In ``qiskit-ibm-runtime``, a backend is represented by an instance of the `IBMBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__ class. Attributes of this class provides information about this backend. For example:
es_un: En ``qiskit-ibm-runtime``, un backend está representado por una instancia de la clase `IBMBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__. Los atributos de esta clase proporcionan información sobre este backend. Por ejemplo:
ko_kr: ``qiskit-ibm-runtime`` 에서는, 백엔드가 `IBMBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__ 클래스의 인스턴스로 표시된다. 이 클래스의 속성은 이 백엔드에 대한 정보를 제공한다. 예를 들어:
pt_un: Em ``qiskit-ibm-runtime``, um backend é representado por uma instância da classe`IBMBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>` __. Os atributos dessa classe fornecem informações sobre esse backend. Por exemplo:

source: ``name``: Name of the backend.
es_un: ``name``: Nombre del backend.
ko_kr: ``name``: 백엔드의 이름.
pt_un: ``name``: Nome do backend.

source: ``instructions``: A list of instructions the backend supports.
es_un: ``instructions``: Una lista de instrucciones que admite el backend.
ko_kr: ``instructions``: 백엔드가 지원하는 명령어 목록.
pt_un: ``instructions``: Uma lista de instruções que o backend suporta.

source: ``operation_names``: A list of instruction names the backend supported.
es_un: ``operation_names``: Una lista de nombres de instrucciones que admite el backend.
ko_kr: ``operation_names``: 백엔드가 지원하는 명령어 이름 목록.
pt_un: ``operation_names``: Uma lista de nomes de instruções que o backend suporta.

source: ``num_qubits``: The number of qubits the backend has.
es_un: ``num_qubits``: El número de qubits que tiene el backend.
ko_kr: ``num_qubits``: 백엔드가 가진 큐비트의 개수.
pt_un: ``num_qubits``: O número de qubits que o backend possui.

source: ``coupling_map``: Coupling map of the backend.
es_un: ``coupling_map``: Mapa de acoplamiento del backend.
ko_kr: ``coupling_map``: 백엔드의 커플링 맵.
pt_un: ``coupling_map``: Mapa de acoplamento do backend.

source: ``dt``: System time resolution of input signals.
es_un: ``dt``: Resolución del tiempo del sistema de las señales de entrada.
ko_kr: ``dt``: 입력 신호의 시스템 시간 분해능.

source: ``dtm``: System time resolution of output signals.
es_un: ``dtm``: Resolución del tiempo del sistema de las señales de salida.
ko_kr: ``dtm``: 출력 신호의 시스템 시간 분해능.
pt_un: ``dtm``: Resolução de tempo do sistema de sinais de saída.

source: Refer to the API reference for a complete list of attributes and methods ``IBMBackend`` has.
es_un: Consulta la referencia de la API para obtener una lista completa de los atributos y métodos que tiene ``IBMBackend``.
ko_kr: ``IBMBackend`` 가 가진 속성 및 메소드의 전체 목록은 API 레퍼런스를 참조하라.
pt_un: Consulte a referência da API para obter uma lista completa de atributos e métodos que o ``IBMBackend`` possui.

source: Listing backends
es_un: Listado de backends
ko_kr: 백엔드 나열
pt_un: Listando backends

source: Use the `backends() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.backends>`__ method to list all backends you have access to. This method returns a list of ``IBMBackend`` instances:
es_un: Utiliza el método `backends() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.backends>`__ para enumerar todos los backends a los que tienes acceso. Este método devuelve una lista de instancias de ``IBMBackend``:
ko_kr: 접근할 수 있는 모든 백엔드를 나열하려면 `backends() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.backends>`__ 메소드를 사용하라. 이 메소드는 ``IBMBackend`` 인스턴스 목록을 반환한다.
pt_un: Use o método `backends() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.backends>`__ para listar todos os backends aos quais você tem acesso. Este método retorna uma lista de instâncias do ``IBMBackend``:

source: The `backend() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.backend>`__ (singular) method, on the other hand, takes the name of the backend as the input parameter and returns an ``IBMBackend`` instance representing that particular backend:
es_un: El método `backend() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.backend>`__ (singular), por otro lado, toma el nombre del backend como parámetro de entrada y devuelve una instancia ``IBMBackend`` que representa ese backend en particular:
ko_kr: 반면, `backend() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.backend>`__ (단수) 메소드는 백엔드의 이름을 입력 매개변수로 사용하고 그 특정 백엔드를 나타내는 ``IBMBackend`` 인스턴스를 반환한다.
pt_un: O método `backend() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.backend>`__ (singular), por outro lado, recebe o nome do backend como o parâmetro de entrada e retorna uma instância ``IBMBackend`` representando esse backend específico:

source: Filtering backends
es_un: Filtrado de backends
ko_kr: 백엔드 필터링
pt_un: Filtrando backends

source: You may also optionally filter the set backends, by passing arguments that query the backend’s configuration, status, or properties. For more general filters, you can make advanced functions using a lambda function. Refer to the API documentation for more details.
es_un: Opcionalmente, también puedes filtrar los backends establecidos, pasando argumentos que consultan la configuración, el estado o las propiedades del backend. Para filtros más generales, puedes hacer funciones avanzadas usando una función lambda. Consulta la documentación de la API para obtener más detalles.
ko_kr: 백엔드의 구성이나 상태, 특성을 조회하는 인수를 전달함으로써 설정된 백엔드를 선택적으로 필터링할 수도 있다. 보다 일반적인 필터의 경우, 람다 함수를 사용하여 고급 함수를 만들 수 있다. 보다 세부적인 건 API 문서를 참조하라.
pt_un: Também podemos filtrar opcionalmente os backends definidos, passando argumentos que consultam a configuração, o status ou as propriedades do backend. Para filtros mais gerais, podemos criar funções avançadas usando uma função lambda. Consulte a documentação da API para obter mais detalhes.

source: Let’s try getting only backends that are
es_un: Intentemos obtener solo backends que son
ko_kr: 다음과 같은 백엔드만을 사용해 보자.
pt_un: Vamos tentar obter apenas backends que são

source: real quantum devices (``simulator=False``)
es_un: dispositivos cuánticos reales (``simulator=False``)
ko_kr: 실제 양자 장치 (``simulator=False``)
pt_un: dispositivos quânticos reais (``simulator=False``)

source: currently operational (``operational=True``)
es_un: actualmente operacionales (``operational=True``)
ko_kr: 현재 작동 중인 것 (``operational=True``)
pt_un: atualmente operacionais (``operacional=True``)

source: have at least 5 qubits (``min_num_qubits=5``)
es_un: tienen al menos 5 qubits (``min_num_qubits=5``)
ko_kr: 5개 이상의 큐비트를 갖는 것 (``min_num_qubits=5``)
pt_un: possuem pelo menos 5 qubits (``min_num_qubits=5``)

source: A similar method is `least_busy() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.least_busy>`__, which takes the same filters as ``backends()`` but returns the backend that has the least number of jobs pending in the queue:
es_un: Un método similar es `least_busy() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.least_busy>`__, que utiliza los mismos filtros que ``backends()``, pero devuelve el backend que tiene la menor cantidad de trabajos pendientes en la fila:
ko_kr: 유사한 방법은 `least_busy() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.least_busy>`__ 으로, ``backends()`` 와 동일한 필터를 사용하지만 대기열에 대기 중인 작업의 수가 가장 적은 백엔드를 반환한다.
pt_un: Um método semelhante é `least_busy() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.least_busy>`__, que usa os mesmos filtros que ``backends()`` mas retorna o backend que tem o menor número de jobs pendentes na fila:

source: Some programs also define the type of backends they need in the ``backend_requirements`` field of the program metadata.
es_un: Algunos programas también definen el tipo de backends que necesitan en el campo ``backend_requirements`` de los metadatos del programa.
ko_kr: 일부 프로그램은 필요한 백엔드 타입을 프로그램 메타데이터의 ``backend_requirements`` 필드에 정의하기도 한다.
pt_un: Alguns programas também definem o tipo de backends que eles precisam no campo ``backend_requirements`` dos metadados do programa.

source: The ``hello-world`` program, for example, needs a backend that has at least 5 qubits:
es_un: El programa ``hello-world``, por ejemplo, necesita un backend que tenga al menos 5 qubits:
ko_kr: 예를 들어 ``hello-world`` 프로그램은 5개 이상의 큐비트를 가진 백엔드를 필요로 한다.
pt_un: O programa ``hello-world``, por exemplo, precisa de um backend que tenha pelo menos 5 qubits:

source: You can use this ``backend_requirements`` field to find backends that meet the criteria:
es_un: Puedes usar este campo ``backend_requirements`` para encontrar backends que cumplan con los criterios:
ko_kr: 이 ``backend_requirements`` 필드를 통해 기준에 맞는 백엔드를 찾을 수 있다:
pt_un: Você pode usar este campo ``backend_requirements`` para encontrar backends que atendam aos critérios:

source: Backend attributes
es_un: Atributos del backend
ko_kr: 백엔드 속성
pt_un: Atributos do backend

source: As mentioned earlier, the attributes of `IBMBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__ class provides information about the backend.
es_un: Como se mencionó anteriormente, los atributos de la clase `IBMBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__ proporcionan información sobre el backend.
ko_kr: 앞서 언급했듯이 `IBMBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__ 클래스의 속성은 백엔드에 대한 정보를 제공한다.
pt_un: Conforme mencionado anteriormente, os atributos da classe `IBMBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__ fornecem informações sobre o backend.

source: Name of the backend.
es_un: Nombre del backend.
ko_kr: 백엔드의 이름.
pt_un: Nome do backend.

source: Version of the backend.
es_un: Versión del backend.
ko_kr: 백엔드의 버전.
pt_un: Versão do backend.

source: Check if the backend is a simulator or real system.
es_un: Comprueba si el backend es un simulador o un sistema real.
ko_kr: 백엔드가 시뮬레이터인지 실제 시스템인지 여부.
pt_un: Checa se o backend é um simulador ou um sistema real.

source: Number of qubits the backend has.
es_un: Número de qubits que tiene el backend.
ko_kr: 백엔드가 가진 큐비트 개수.
pt_un: Número de qubits que o backend possui.

source: Maximum number of circuits per job.
es_un: Número máximo de circuitos por trabajo.
ko_kr: 작업당 최대 회로 개수.
pt_un: Número máximo de circuitos por job.

source: A list of instructions the backend supports.
es_un: Una lista de instrucciones que soporta el backend.
ko_kr: 백엔드가 지원하는 명령어 목록.
pt_un: Uma lista de instruções que o backend suporta.

source: Coupling map of the backend.
es_un: Mapa de acoplamiento del backend.
ko_kr: 백엔드의 커플링 맵.
pt_un: Mapa de acoplamento do backend.

source: For a complete list of backend attributes refer to the `IBMBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__ class documentation.
es_un: Para obtener una lista completa de los atributos del backend, consulta la documentación de la clase `IBMBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__.
ko_kr: 백엔드 속성의 전체 목록은 `IBMBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__ 클래스 문서를 참조하라.
pt_un: Para obter uma lista completa de atributos dos backends, consulte a documentação da classe `IBMBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.IBMBackend.html#qiskit_ibm_runtime.IBMBackend>`__.
