Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/04_account_management.po
Languages: es_un, ja_jp, ko_kr

source: This page was generated from `docs/tutorials/04_account_management.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/04_account_management.ipynb`__.
ja_jp: このページは `docs/tutorials/04_account_management.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/04_account_management.ipynb`__ 에서 생성되었다.

source: Account management
es_un: Administración de cuentas
ja_jp: アカウント管理
ko_kr: 계정 관리

source: Qiskit Runtime is available on both IBM Cloud and IBM Quantum. The former requires an IBM Cloud account and the latter an IBM Quantum account. If you don’t have these accounts, please refer to `01_introduction_ibm_cloud_runtime.ipynb <01_introduction_ibm_cloud_runtime.ipynb>`__ or `02_introduction_ibm_quantum_runtime.ipynb <02_introduction_ibm_quantum_runtime.ipynb>`__ on how to set one up.
es_un: Qiskit Runtime está disponible tanto en IBM Cloud como en IBM Quantum. El primero requiere una cuenta de IBM Cloud y el segundo una cuenta de IBM Quantum. Si no tienes estas cuentas, consulta `01_introduction_ibm_cloud_runtime.ipynb <01_introduction_ibm_cloud_runtime.ipynb>`__ o `02_introduction_ibm_quantum_runtime.ipynb <02_introduction_ibm_quantum_runtime.ipynb>`__ sobre cómo configurar una.
ja_jp: Qiskit Runtime は、 IBM Cloud と IBM Quantum の両方で使用可能です。 前者には、 IBM Cloud アカウントと IBM Quantum アカウントが必要です。 これらのアカウントがない場合は、 `01_introduction_ibm_cloud_runtime.ipynb <01_introduction_ibm_cloud_runtime.ipynb>`__ または `02_introduction_ibm_quantum_runtime.ipynb <02_introduction_ibm_quantum_runtime.ipynb>`__ の設定方法を参照してください。
ko_kr: Qiskit Runtime은 IBM Cloud와 IBM Quantum 둘 모두에서 사용 가능하다. IBM Cloud은 IBM Cloud 계정을, IBM Quantum은 IBM Quantum 계정을 요구한다. 이러한 계정이 없는 경우, `01_introduction_ibm_cloud_runtime.ipynb <01_introduction_ibm_cloud_runtime.ipynb>`__ 나 `02_introduction_ibm_quantum_runtime.ipynb <02_introduction_ibm_quantum_runtime.ipynb>`__ 을 참고하라.

source: There are a number of methods for handling account management. Your account credentials can be saved to disk, or used in a session and never saved.
es_un: Hay una serie de métodos para manejar la administración de cuentas. Las credenciales de tu cuenta pueden guardarse en el disco o usarse en una sesión y nunca guardarse.
ja_jp: アカウント管理を処理する方法はいくつかあります。 アカウント資格情報は、ディスクに保存することも、セッションで使用して保存しないこともできます。
ko_kr: 계정을 관리하기 위한 여러 가지 방법이 있다. 계정 증명서는 디스크에 저장되거나, 아니면 세션에서만 쓰이고 아예 저장이 안 될 수도 있다.

source: ``save_account()``: Save your account to disk for future use.
es_un: ``save_account()``: Guarda tu cuenta en el disco para uso futuro.
ja_jp: ``save_account()``: 今後使用するためにアカウントをディスクに保存します。
ko_kr: ``save_account()``: 나중을 위해 계정 정보를 디스크에 저장한다.

source: ``delete_account()``: Delete the saved account from disk.
es_un: ``delete_account()``: Elimina la cuenta guardada del disco.
ja_jp: ``delete_account()``: 保存されたアカウントをディスクから削除します。
ko_kr: ``delete_account()``: 디스크에 있는 계정 정보를 삭제한다.

source: ``active_account()``: List the account currently in the session.
es_un: ``active_account()``: Enlista la cuenta actualmente en la sesión.
ja_jp: ``active_account()``: セッション内の現在のアカウントを一覧表示します。
ko_kr: ``active_account()``: 현재 세션에 있는 계정 정보를 나열한다.

source: ``saved_account()``: List the account stored on disk.
es_un: ``saved_account()``: Enlista la cuenta almacenada en el disco.
ja_jp: ``saved_account()``: ディスクに保管されているアカウントをリストします。
ko_kr: ``saved_account()``: 디스크에 저장된 계정 정보를 나열한다.

source: Storing credentials
es_un: Almacenamiento de credenciales
ja_jp: 資格情報の保存
ko_kr: 증명서 저장

source: The `save_account() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.save_account>`__ method can be used to store your account credentials on disk, in the ``$HOME/.qiskit/qiskit-ibm.json`` file. Once the credentials are saved, you will only need to use ``QiskitRuntimeService()`` to initialize your account in the future.
es_un: El método `save_account() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.save_account>`__ se puede utilizar para almacenar las credenciales de tu cuenta en el disco, en el archivo ``$HOME/.qiskit/qiskit-ibm.json``. Una vez que se guardan las credenciales, solo necesitarás usar ``QiskitRuntimeService()`` para inicializar tu cuenta en el futuro.
ja_jp: `save_account() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.save_account>`__ メソッドを使用して、アカウントの資格情報をディスクの ``$HOME/.qiskit/qiskit-ibm.json`` ファイルに保存できます。 資格情報が保存されると、後でアカウントを初期化するために ``QiskitRuntimeService()`` を使用するだけで済みます。
ko_kr: `save_account() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.save_account>`__ 는 계정 증명서를 디스크에 있는 ``$HOME/.qiskit/qiskit-ibm.json`` 파일에 저장할 때 쓰인다. 일단 증명서가 저장되면, 나중에 서비스를 이용할 때 ``QiskitRuntimeService()`` 명령어를 통해 본인 계정을 불러올 수 있다.

source: Note: Account credentials are saved in plain text, so only do so if you are using a trusted device.
es_un: Nota: Las credenciales de la cuenta se guardan en texto sin formato, así que solo hazlo si estás utilizando un dispositivo confiable.
ja_jp: 注記: アカウントの資格情報はプレーン・テキストで保存されるため、信頼できるデバイスを使用している場合にのみ実行してください。
ko_kr: 참고: 계정 증명서는 일반 텍스트로 저장되므로, 신뢰할 수 있는 장치를 사용하고 있는 경우에만 저장하라.

source: Below are examples of saving an IBM Cloud and an IBM Quantum accounts. The ``channel`` parameter allows to distinguish between different account types. If you are saving multiple accounts per channel, consider using the ``name`` parameter to differentiate them.
es_un: A continuación se muestran ejemplos de cómo guardar una cuenta de IBM Cloud e IBM Quantum. El parámetro ``channel`` permite distinguir entre diferentes tipos de cuenta. Si estás guardando varias cuentas por canal, considera usar el parámetro ``name`` para diferenciarlas.
ja_jp: IBM Cloud と IBM Quantum のアカウントを保存する例を以下に示します。 ``channel`` パラメーターを使用すると、異なるアカウント・タイプを区別することができます。 チャネルごとに複数のアカウントを保存する場合は、 ``name`` パラメーターを使用して区別することを検討してください。
ko_kr: 아래 예시는 IBM Cloud 계정과 IBM Quantum 계정을 저장하는 것에 대한 예시이다. ``channel`` 매개변수는 다른 두 계정 유형을 구별할 수 있도록 하는 매개변수다. 만약 채널 당 여러 개의 계정을 저장한다면 ``name`` 매개변수를 통해 구별할 수 있다.

source: Initializing
es_un: Inicialización
ja_jp: 初期化
ko_kr: 초기화

source: You need to initialize your account in a Python session before you can start using Qiskit Runtime. If you have the credentials already saved, you can initialize an ``QiskitRuntimeService`` instance without additional parameters.
es_un: Necesitas inicializar tu cuenta en una sesión de Python antes de poder comenzar a usar Qiskit Runtime. Si ya tienes las credenciales guardadas, puedes inicializar una instancia de ``QiskitRuntimeService`` sin parámetros adicionales.
ja_jp: Qiskit Runtime の使用を開始する前に、 Python セッションでアカウントを初期化する必要があります。資格情報が既に保存されている場合は、追加のパラメーターを指定せずに ``QiskitRuntimeService`` インスタンスを初期化できます。
ko_kr: Qiskit Runtime을 사용하기 전에, Python 세션의 계정을 초기화해줄 필요가 있다. 만약 이미 증명서가 저장이 되어있다면, ``QiskitRuntimeService`` 인스턴스를 다른 매개변수 없이 초기화할 수 있다.

source: If you have both an IBM Cloud and an IBM Quantum accounts saved, ``QiskitRuntimeService()`` by default will load the IBM Cloud account. To load the IBM Quantum account, you can specify ``QiskitRuntimeService(channel="ibm_quantum")`` instead.
es_un: Si tienes guardadas tanto una cuenta de IBM Cloud así como una de IBM Quantum, ``QiskitRuntimeService()`` por defecto cargará la cuenta de IBM Cloud. Para cargar la cuenta de IBM Quantum, puedes especificar ``QiskitRuntimeService(channel="ibm_quantum")`` en su lugar.
ja_jp: IBM Cloud と IBM Quantum アカウントの両方が保存されている場合は、デフォルトで ``QiskitRuntimeService()`` が IBM Cloud アカウントをロードします。 IBM Quantum アカウントをロードするには、 ``QiskitRuntimeService(channel="ibm_quantum")`` を指定できます。
ko_kr: 만약 IBM Cloud 계정과 IBM Quantum 계정이 모두 저장되어 있는 경우, ``QiskitRuntimeService()`` 는 기본적으로 IBM Cloud 계정을 불러온다. IBM Quantum 계정을 불러오려면, ``QiskitRuntimeService(channel="ibm_quantum")`` 와 같이 채널을 명시해주면 된다.

source: Alternatively, if you specified a ``name`` for your account when saving it, you can also specify the name of the account to load.
es_un: Alternativamente, si especificaste un ``name`` para tu cuenta al guardarla, también puedes especificar el nombre de la cuenta a cargar.
ja_jp: また、保存時にアカウントに ``name`` を指定した場合は、ロードするアカウントの名前を指定することもできます。
ko_kr: 또는, 계정 저장 당시 ``name`` 을 지정한 경우, 이름을 명시하여 계정을 불러올 수도 있다.

source: If you want to use your credentials for just the session instead of saving it, you can pass the credentials in when initializing the ``QiskitRuntimeService`` instance:
es_un: Si deseas usar tus credenciales solo para la sesión en lugar de guardarlas, puedes pasar las credenciales al inicializar la instancia de ``QiskitRuntimeService``:
ja_jp: セッションを保存するのではなく、単にセッションに対して資格情報を使用する場合は、 ``QiskitRuntimeService`` インスタンスを初期化する際に資格情報を渡すことができます。
ko_kr: 계정 증명서를 저장하지 않고 세션에서만 사용하는 경우, ``QiskitRuntimeService`` 인스턴스를 초기화할 때 증명서를 전달할 수 있다.
