Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/05_uploading_program.po
Languages: es_un, ja_jp, ko_kr

source: This page was generated from `docs/tutorials/05_uploading_program.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/05_uploading_program.ipynb`__.
ja_jp: このページは `docs/tutorials/05_uploading_program.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/05_uploading_program.ipynb`__ 에서 생성되었다.

source: Uploading a Qiskit runtime program
es_un: Cargar un programa Qiskit runtime
ja_jp: Qiskit Runtime プログラムのアップロード
ko_kr: Qiskit Runtime 프로그램 업로드하는법

source: Here we provide an overview on how to construct and upload a runtime program. A runtime program is a piece of Python code that lives in the cloud and can be invoked by passing in just its parameters. Runtime programs are private by default, which means only you can see and access your programs. Some authorized users can also mark their programs as public, making them visible and accessible by everyone.
es_un: Aquí proporcionamos una descripción general sobre cómo construir y cargar un programa runtime. Un programa runtime es una pieza de código de Python que vive en la nube y se puede invocar pasándole solo sus parámetros. Los programas runtime son privados de forma predeterminada, lo que significa que solamente tú puedes ver y acceder a tus programas. Algunos usuarios autorizados también pueden marcar tus programas como públicos, haciéndolos visibles y accesibles para todos.
ja_jp: ここでは、runtime プログラムを構築してアップロードする方法の概要を説明します。 runtime プログラムは、クラウドに存在するPythonコードの一部であり、そのパラメーターのみを渡すことで呼び出すことができます。 runtime プログラムはデフォルトで非公開です。つまり、プログラムを表示してアクセスできるのはあなただけです。 一部の許可されたユーザーは、プログラムを公開としてマークして、誰でも表示およびアクセスできるようにすることもできます。
ko_kr: 여기서는 런타임 프로그램을 구성하고 업로드하는 방법에 대한 개요를 제공한다. 런타임 프로그램은 클라우드에 있는 Python 코드로 매개변수만 전달하여 호출할 수 있다. 런타임 프로그램은 기본적으로 비공개이며 해당 사용자만 프로그램을 보거나 접근할 수 있다. 일부 권한이 있는 사용자는 프로그램을 공개로 표시하여 모든 사용자가 보거나 접근 하도록 할 수 있다.

source: Constructing a runtime program
es_un: Construir un programa runtime
ja_jp: Runtime プログラムの構成
ko_kr: 런타임 프로그램 구성하기

source: Below is a template of a runtime program. You can find the template file in the `qiskit-ibm-runtime <https://github.com/Qiskit/qiskit-ibm-runtime/blob/main/qiskit_ibm_runtime/program/program_template.py>`__ repository.
es_un: A continuación, se muestra una plantilla de un programa runtime. Puedes encontrar el archivo de la plantilla en el repositorio `qiskit-ibm-runtime <https://github.com/Qiskit/qiskit-ibm-runtime/blob/main/qiskit_ibm_runtime/program/program_template.py>`__.
ja_jp: 以下はruntime プログラムのテンプレートです。テンプレートファイルは `qiskit-ibm-runtime <https://github.com/Qiskit/qiskit-ibm-runtime/blob/main/qiskit_ibm_runtime/program/program_template.py>`__ リポジトリーにあります。
ko_kr: 다음은 런타임 프로그램의 템플릿이다. `qiskit-ibm-runtime <https://github.com/Qiskit/qiskit-ibm-runtime/blob/main/qiskit_ibm_runtime/program/program_template.py>`__ 에서 템플릿 파일을 찾을 수 있다.

source: Each runtime program must have a ``main()`` function, which serves as the entry point to the program. This function must have ``backend`` and ``user_messenger`` as the first two positional arguments:
es_un: Cada programa runtime debe tener una función ``main()``, que sirve como punto de entrada al programa. Esta función debe tener ``backend`` y ``user_messenger`` como los dos primeros argumentos posicionales:
ja_jp: 各runtime プログラムには ``main()`` 関数がなければなりません。この関数は、プログラムへのエントリー・ポイントとして機能します。 この関数は、最初の 2 つの定位置引数として ``backend`` および ``user_messenger`` を持つ必要があります。
ko_kr: 각 런타임 프로그램에는 프로그램의 진입점인 ``main()`` 함수가 있어야 한다. 이 함수의 첫째와 둘째 입력인수는 반드시 ``backend`` 와 ``user_messenger`` 가 되야한다.

source: ``backend`` is an instance of `ProgramBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.ProgramBackend.html#qiskit_ibm_runtime.ProgramBackend>`__ and has a `run() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.ProgramBackend.html#qiskit_ibm_runtime.ProgramBackend.run>`__ method that can be used to submit circuits.
es_un: ``backend`` es una instancia de `ProgramBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.ProgramBackend.html#qiskit_ibm_runtime.ProgramBackend>`__ y tiene un método `run() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.ProgramBackend.html#qiskit_ibm_runtime.ProgramBackend.run>`__ que se puede utilizar para enviar circuitos.
ja_jp: ``backend`` は、`ProgramBackend <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.ProgramBackend.html#qiskit_ibm_runtime.ProgramBackend>`__ のインスタンスであり、回路の送信に使用できる `run() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.ProgramBackend.html#qiskit_ibm_runtime.ProgramBackend.run>`__ メソッドを持っています。

source: ``user_messenger`` is an instance of `UserMessenger <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.UserMessenger.html#qiskit_ibm_runtime.UserMessenger>`__ and has a `publish() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.UserMessenger.html#qiskit_ibm_runtime.UserMessenger.publish>`__ method that can be used to send interim and final results to the program user. This method takes a parameter ``final`` that indicates whether it’s a final result. However, it is recommended to return the final result directly from the ``main()`` function. Currently only final results are stored after a program execution finishes.
es_un: ``user_messenger`` es una instancia de `UserMessenger <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.UserMessenger.html#qiskit_ibm_runtime.UserMessenger>`__ y tiene un método `publish() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.UserMessenger.html#qiskit_ibm_runtime.UserMessenger.publish>`__ que se puede utilizar para enviar resultados intermedios y finales al usuario del programa. Este método toma un parámetro ``final`` que indica si es un resultado final. Sin embargo, se recomienda devolver el resultado final directamente desde la función ``main()``. Actualmente, solo los resultados finales se almacenan después de que finaliza la ejecución de un programa.
ja_jp: ``user_messenger`` は、 `UserMessenger <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.UserMessenger.html#qiskit_ibm_runtime.UserMessenger>`__ のインスタンスであり、プログラム・ユーザーに中間結果と最終結果を送信するために使用できる `publish() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.UserMessenger.html#qiskit_ibm_runtime.UserMessenger.publish>`__ を持っています。 このメソッドは、最終結果であるかどうかを示すパラメーター ``final`` を使用します。 ただし、 ``main()`` 関数から最終結果を直接返すことをお勧めします。 現在、プログラムの実行が終了すると、最終結果のみが保管されます。

source: There are several runtime program source code in the ``program_source`` directory in this repository. ``program_source/hello_world/hello_world.py`` is one of them. It is a sample runtime program that submits random circuits for user-specified iterations:
es_un: Hay varios códigos fuente de programas runtime en el directorio ``program_source`` en este repositorio. ``program_source/hello_world/hello_world.py`` es uno de ellos. Es un programa runtime de muestra que envía circuitos aleatorios para iteraciones especificadas por el usuario:
ja_jp: このリポジトリー内の ``program_source`` ディレクトリーには、いくつかのruntime プログラム・ソース・コードがあります。 ``program_source/hello_world/hello_world.py`` はその中の 1 つです。 これは、ユーザー指定の反復用にランダム・サーキットをサブミットするruntime プログラムのサンプルです。
ko_kr: ``program_source`` 디렉토리에는 여러 개의 런타임 프로그램 소스 코드가 있다. ``program_source/hello_world/hello_world.py`` 는 소스 코드중 하나이며, 사용자가 설정한 반복횟수 만큼 무작위 회로를 실행하는 예제 런타임 프로그램이다.

source: Data serialization
es_un: Serialización de datos
ja_jp: データのシリアライズ
ko_kr: 데이터 직렬화

source: Runtime programs live in the cloud, and JSON is the standard way of passing data to and from cloud services. Therefore, when a user invokes a runtime program, the input parameters must first be serialized into the JSON format and then deserialized once received by the server. By default, this serialization and deserialization is done automatically using the `RuntimeEncoder <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeEncoder.html#qiskit_ibm_runtime.RuntimeEncoder>`__ and `RuntimeDecoder <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeDecoder.html#qiskit_ibm_runtime.RuntimeDecoder>`__ classes.
es_un: Los programas Runtime viven en la nube, y JSON es la forma estándar de pasar datos hacia y desde los servicios en la nube. Por lo tanto, cuando un usuario invoca un programa runtime, los parámetros de entrada primero deben serializarse en formato JSON y luego deserializarse una vez recibidos por el servidor. De forma predeterminada, esta serialización y deserialización se realiza automáticamente mediante las clases `RuntimeEncoder <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeEncoder.html#qiskit_ibm_runtime.RuntimeEncoder>`__ y `RuntimeDecoder <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeDecoder.html#qiskit_ibm_runtime.RuntimeDecoder>`__.
ja_jp: Runtimeプログラムはクラウドに存在し、 JSON はクラウド・サービスとの間でデータを受け渡しする標準的な方法です。 したがって、ユーザーがRuntimeプログラムを呼び出すときには、入力パラメーターをまず JSON 形式にシリアライズしてから、サーバーによって受信されたときにデシリアライズする必要があります。 デフォルトでは、このシリアライズおよびデシリアライズは、 `RuntimeEncoder <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeEncoder.html#qiskit_ibm_runtime.RuntimeEncoder>`__ と `RuntimeDecoder <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeDecoder.html#qiskit_ibm_runtime.RuntimeDecoder>`__ を使用して自動的に実行されます。
ko_kr: 런타임 프로그램은 클라우드에 있으며, JSON은 클라우드 서비스와 데이터를 주고받는 표준 방식이다. 따라서 사용자가 런타임 프로그램을 호출할 때, 입력 매개변수를 먼저 JSON 형식으로 직렬화한 다음 서버에서 받은 것을 역직렬화해야 한다. 기본적으로 이 직렬화 및 역직렬화는 `RuntimeEncoder <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeEncoder.html#qiskit_ibm_runtime.RuntimeEncoder>`__ 및 `RuntimeDecoder <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.RuntimeDecoder.html#qiskit_ibm_runtime.RuntimeDecoder>`__ 클래스를 사용하여 자동으로 수행된다.

source: Custom classes
es_un: Clases personalizadas
ja_jp: カスタム・クラス
ko_kr: 사용자 정의 클래스

source: ``RuntimeEncoder`` and ``RuntimeDecoder`` only support types commonly used in Qiskit, such as complex numbers and numpy arrays. If your program uses custom Python classes for input or output, these two methods only have partial support for that.
es_un: ``RuntimeEncoder`` y ``RuntimeDecoder`` solo admiten tipos comúnmente utilizados en Qiskit, como números complejos y arreglos numpy. Si tu programa usa clases personalizadas de Python para entrada o salida, estos dos métodos solo tienen soporte parcial para eso.
ja_jp: ``RuntimeEncoder`` と ``RuntimeDecoder`` は、複素数やnumpy配列など、Qiskitで一般的に使用される型のみをサポートしています。 プログラムが入力または出力にカスタムPythonクラスを使用している場合、これらの2つのメソッドは部分的なサポートしかありません。
ko_kr: ``RuntimeEncoder`` 와 ``RuntimeDecoder`` 는 복소수와 numpy 배열과 같이 Qiskit에서 일반적으로 사용되는 자료형만 지원한다. 만약 사용자 프로그램이 입력 또는 출력 용도로 사용자 정의 파이썬 클래스를 사용하면, 이 두 가지 메서드는 부분적으로만 지원한다.

source: Your custom class should have the following methods:
es_un: Tu clase personalizada debe tener los siguientes métodos:
ja_jp: カスタムクラスには以下のメソッドが必要です。
ko_kr: 사용자 정의 클래스에는 다음과 같은 메서드가 있어야 한다.

source: a ``to_json()`` method that returns a JSON string representation of the object
es_un: un método ``to_json()`` que devuelve una representación en cadena JSON del objeto
ja_jp: オブジェクトの JSON 文字列表現を戻す ``to_json()`` メソッド
ko_kr: 객체의 JSON 문자열 표현을 반환하는 ``to_json()`` 메서드

source: a ``from_json()`` class method that accepts a JSON string and returns the corresponding object.
es_un: un método de clase ``from_json()`` que acepta una cadena JSON y devuelve el objeto correspondiente.
ja_jp: JSON 文字列を受け取り、対応するオブジェクトを返す ``from_json()`` クラスメソッド
ko_kr: JSON 문자열을 받고 해당하는 객체를 반환하는 ``from_json()`` 클래스 메서드.

source: When ``RuntimeEncoder`` serializes a Python object, it checks whether the object has a ``to_json()`` method. If so, it calls the method to serialize the object. ``RuntimeDecoder``, however, does *not* invoke ``from_json()`` to convert the data back because it doesn’t know how to import your custom class. Therefore the deserialization needs to be done explicitly.
es_un: Cuando ``RuntimeEncoder`` serializa un objeto de Python, comprueba si el objeto tiene un método ``to_json()``. Si es así, llama al método para serializar el objeto. ``RuntimeDecoder``, sin embargo, *no* invoca ``from_json()`` para volver a convertir los datos porque no sabe cómo importar tu clase personalizada. Por lo tanto, la deserialización debe hacerse explícitamente.
ja_jp: ``RuntimeEncoder`` が Python オブジェクトをシリアライズするとき、オブジェクトが ``to_json()`` メソッドを持っているかどうかをチェックします。もしそうなら、オブジェクトをシリアライズするためにそのメソッドを呼び出します。しかし、 ``RuntimeDecoder`` は、カスタムクラスをインポートする方法が分からないため、``from_json()`` を呼び出すことはありません。 したがって、デシリアライズは明示的に行う必要があります。
ko_kr: ``RuntimeEncoder`` 는 파이선 객체를 직렬화할 때 객체에 ``to_json()`` 메서드가 있는지 확인한다. 그러한 경우 메서드를 호출하여 객체를 직렬화한다. 그러나 ``RuntimeDecoder`` 는 사용자 정의 클래스를 호출하는 방법을 *모르기 때문에* 데이터를 다시 변환하기 위해 ``from_json()`` 을 호출하지 않는다. 따라서 역직렬화를 명시적으로 수행하야 한다.

source: Here is an example of serializing and deserializing a custom class. First we define the class ``MyCustomClass``:
es_un: Este es un ejemplo de cómo serializar y deserializar una clase personalizada. Primero definimos la clase ``MyCustomClass``:
ja_jp: 以下に、カスタム・クラスのシリアライズとデシリアライズの例を示します。 まず、クラス ``MyCustomClass`` を定義します。
ko_kr: 다음은 사용자 정의 클래스를 직렬화 및 역직렬화하는 예제이다. 먼저 ``MyCustomClass`` 를 정의한다.

source: Note that it has the ``to_json()`` method that converts a ``MyCustomClass`` instance to a JSON string, and a ``from_json()`` class method that converts a JSON string back to a ``MyCustomClass`` instance.
es_un: Ten en cuenta que tiene el método ``to_json()`` que convierte una instancia de ``MyCustomClass`` en una cadena JSON, y un método de clase ``from_json()`` que convierte una cadena JSON de nuevo en una instancia ``MyCustomClass``.
ja_jp: ``MyCustomClass``インスタンスをJSON文字列に変換する ``to_json()`` メソッドと、JSON文字列を ``MyCustomClass`` インスタンスに変換する ``from_json()`` クラスメソッドがあることに注意してください。
ko_kr: ``MyCustomClass`` 인스턴스를 JSON 문자열로 변환하는 ``to_json()`` 메서드와 JSON 문자열을 다시 ``MyCustomClass`` 인스턴스로 변환하는 ``from_json()`` 클래스 메서드가 있다.

source: Here is how one would use ``MyCustomClass`` as an **input** to your program:
es_un: Así es como uno usaría ``MyCustomClass`` como una **entrada** para tu programa:
ja_jp: プログラムへの **入力** として ``MyCustomClass`` を使用する方法は次のとおりです。
ko_kr: ``MyCustomClass`` 을 프로그램의 **입력** 으로 사용하는 방법은 다음과 같다.

source: Since ``MyCustomClass`` has a ``to_json()`` method, the method is automatically called to convert the instance to a JSON string when ``service.run()`` is invoked.
es_un: Dado que ``MyCustomClass`` tiene un método ``to_json()``, se llama automáticamente al método para convertir la instancia en una cadena JSON cuando ``service.run()`` es invocado.
ja_jp: ``MyCustomClass`` には ``to_json()`` メソッドが含まれているため、 ``service.run()`` が呼び出されるときに、メソッドは自動的に呼び出され、インスタンスを JSON ストリングに変換します。
ko_kr: ``MyCustomClass`` 에는 ``to_json()`` 메서드가 있으므로, 이 메서드는 ``service.run()`` 이 호출될 때 자동으로 인스턴스를 JSON 문자열로 변환한다.

source: Your program can then use the ``from_json()`` method to restore the JSON string back to a ``MyCustomClass`` instance:
es_un: Tu programa puede usar el método ``from_json()`` para restaurar la cadena JSON a una instancia de ``MyCustomClass``:
ja_jp: プログラムは ``from_json()`` メソッドを使用して、JSON 文字列を ``MyCustomClass`` インスタンスに戻すことができます。
ko_kr: 그런 다음 ``from_json()`` 메서드를 사용하여 JSON 문자열을 ``MyCustomClass`` 인스턴스로 복원할 수 있다.

source: Similarly, if you pass a ``MyCustomClass`` instance as an **output** of your program, it is automatically converted to a JSON string (via the ``to_json()`` method):
es_un: De manera similar, si pasas una instancia de ``MyCustomClass`` como una **salida** de tu programa, se convierte automáticamente en una cadena JSON (a través del método ``to_json()``):
ja_jp: 同様に、 ``MyCustomClass`` インスタンスをプログラムの **出力** として渡すと、自動的に JSON 文字列に変換されます ( ``to_json()`` メソッドを使用 )。
ko_kr: 마찬가지로 ``MyCustomClass`` 인스턴스를 프로그램의 **출력** 으로 전달하면, 이는 자동으로 ``to_json()`` 메서드를 통해 JSON 문자열로 변환된다.

source: Now when the user of this program calls ``job.result()``, they will receive a JSON string rather than a ``MyCustomClass`` instance. The user can convert the string back to ``MyCustomClass`` themselves:
es_un: Ahora, cuando el usuario de este programa llame a ``job.result()``, recibirá una cadena JSON en lugar de una instancia de ``MyCustomClass``. El usuario puede volver a convertir la cadena a ``MyCustomClass``:
ja_jp: これで、このプログラムのユーザーは ``job.result()`` を呼び出すときに、 ``MyCustomClass`` インスタンスではなく JSON ストリングを受け取ります。 ユーザーは、このストリングを ``MyCustomClass`` 自体に戻すことができます。
ko_kr: 이제 이 프로그램 사용자가 ``job.result()`` 을 호출하면, ``MyCustomClass`` 인스턴스가 아닌 JSON 문자열을 받는다. 사용자는 문자열을 다시 ``MyCustomClass`` 으로 변환할 수 있다.

source: Alternatively, you can provide a decoder for the users. Your decoder class should inherit `ResultDecoder <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.ResultDecoder.html#qiskit_ibm_runtime.ResultDecoder>`__ and overwrite the ``decode()`` method:
es_un: Alternativamente, puedes proporcionar un decodificador para los usuarios. Tu clase decodificadora debe heredar de `ResultDecoder <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.ResultDecoder.html#qiskit_ibm_runtime.ResultDecoder>`__ y sobrescribir el método ``decode()``:
ja_jp: 別の方法として、ユーザーのデコーダーを指定することもできます。 デコーダー・クラスは、 `ResultDecoder <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.ResultDecoder.html#qiskit_ibm_runtime.ResultDecoder>`__ を継承し、 ``decode()`` メソッドを上書きする必要があります。

source: Your user can then use this ``MyResultDecoder`` to decode the result of your program:
es_un: Tu usuario puede usar este ``MyResultDecoder`` para decodificar el resultado de tu programa:
ja_jp: ユーザーはこの ``MyResultDecoder`` を使用してプログラムの結果をデコードできます。
ko_kr: 사용자는 ``MyResultDecoder`` 를 사용해서 프로그램의 결과를 디코딩할 수 있다:

source: Testing your runtime program
es_un: Probar tu programa runtime
ja_jp: Runtime プログラムのテスト
ko_kr: 런타임 프로그램 테스트하기

source: You can test your runtime program using a local simulator or a real backend before uploading it. Simply import and invoke the ``main()`` function of your program and pass the following parameters:
es_un: Puedes probar tu programa runtime utilizando un simulador local o un backend real antes de cargarlo. Simplemente importa e invoca la función ``main()`` de tu programa y pasa los siguientes parámetros:
ja_jp: Runtime プログラムをアップロードする前に、ローカル・シミュレーターまたは実バックエンドを使用してテストすることができます。 単に、プログラムの ``main()`` 関数をインポートし、起動して、以下のパラメーターを渡します。
ko_kr: 로컬 시뮬레이터 또는 실제 백엔드를 사용하여 런타임 프로그램을 업로드하기 전에 테스트할 수 있다. 간단히 프로그램의 ``main()`` 함수를 가져와서 다음의 매개변수를 전달하면 된다:

source: the ``backend`` instance you want to use
es_un: la instancia del ``backend`` que deseas usar
ja_jp: 使用したい ``backend`` インスタンス
ko_kr: 사용하려는 ``backend`` 인스턴스

source: a new ``UserMessenger`` instance.
es_un: una instancia nueva de ``UserMessenger``.
ja_jp: 新しい ``UserMessenger`` インスタンス。
ko_kr: 새로운 ``UserMessenger`` 인스턴스

source: program input parameters that are serialized and then deserialized using the correct encoder and decoder. While this may seem redundant, it is to ensure input parameters can be passed to your program properly once it’s uploaded to the cloud.
es_un: parámetros de entrada del programa que se serializan y luego se deserializan utilizando el codificador y decodificador correctos. Si bien esto puede parecer redundante, es para garantizar que los parámetros de entrada se puedan pasar a tu programa correctamente una vez que se carga en la nube.
ja_jp: 入力パラメーターをシリアライズし、正しいエンコーダーとデコーダーを使用してデシリアライズするプログラム。 これは冗長に見えるかもしれませんが、クラウドにアップロードされた後、入力パラメーターをプログラムに適切に渡すことができるようにするためのものです。
ko_kr: 올바른 인코더와 디코더를 사용해서 직렬화 및 역직렬화되는 프로그램 입력 매개변수. 이는 쓸모 없는 것처럼 보일 수 있지만, 프로그램이 일단 클라우드에 업로드된 후에 입력 매개변수가 프로그램에 바르게 전달되도록 하기 위한 것이다.

source: The following example tests the ``hello-world`` program we saw earlier. It uses the ``qasm_simulator`` from Qiskit Aer as the test backend. It serializes and deserializes input data using ``RuntimeEncoder`` and ``RuntimeDecoder``, which are the default en/decoders used by runtime.
es_un: El siguiente ejemplo prueba el programa ``hello-world`` que vimos anteriormente. Utiliza el ``qasm_simulator`` de Qiskit Aer como backend de prueba. Serializa y deserializa los datos de entrada utilizando ``RuntimeEncoder`` y ``RuntimeDecoder``, que son los codificadores/decodificadores predeterminados utilizados por runtime.
ja_jp: 次の例では、前に見た``hello-world`` プログラムをテストします。 Qiskit Aerの ``qasm_simulator`` をテストバックエンドとして使用します。 Runtime で使用されるデフォルトの en/decoder である ``RuntimeEncoder`` と ``RuntimeDecoder`` を使用して入力データをシリアライズ・デシリアライズします。
ko_kr: 다음 예제는 앞서 봤던 ``hello-world`` 프로그램을 테스트하며, Qiskit Aer에 있는 ``qasm_simulator`` 를 테스트 백엔드로 사용한다. 런타임에 사용되는 기본 인코더와 디코더인 ``RuntimeEncoder`` 와 ``RuntimeDecoder`` 를 사용해서 입력 데이터를 직렬화 및 역직렬화 한다.

source: Defining program metadata
es_un: Definir los metadatos del programa
ja_jp: プログラムメタデータの定義
ko_kr: 프로그램 메타데이터 정의하기

source: Program metadata helps users to understand how to use your program. It includes:
es_un: Los metadatos del programa ayudan a los usuarios a entender cómo usar tu programa. Incluye:
ja_jp: プログラム・メタデータは、ユーザーがプログラムの使用方法を理解するのに役立ちます これには、
ko_kr: 프로그램 메타데이터는 사용자가 프로그램 사용법을 이해하는 데에 도움을 준다. 이는 다음과 같은 항목을 포함한다:

source: ``name``: Name of the program.
es_un: ``name``: Nombre del programa.
ja_jp: ``name``: プログラムの名前。
ko_kr: ``name``: 프로그램 이름.

source: ``max_execution_time``: Maximum amount of time, in seconds, a program can run before being forcibly terminated.
es_un: ``max_execution_time``: Cantidad máxima de tiempo, en segundos, que un programa puede ejecutarse antes de ser terminado por la fuerza.
ja_jp: ``max_execution_time``: プログラムが強制終了されるまでに実行できる最大時間（秒単位）。
ko_kr: ``max_execution_time``: 강제 종료 전에 프로그램을 실행할 수 있는 최대 시간 (초).

source: ``description``: Describes the program.
es_un: ``description``: Describe el programa.
ja_jp: ``description``: プログラムの説明。
ko_kr: ``description``: 프로그램을 설명한다.

source: ``spec``: Detailed information about the program, which includes the following attributes:
es_un: ``spec``: Información detallada sobre el programa, que incluye los siguientes atributos:
ja_jp: ``spec``: プログラムに関する詳細情報。これには以下の属性が含まれます。
ko_kr: ``spec``: 다음 속성을 포함하는 프로그램 상세 정보:

source: ``backend_requirements``: Describes the backend attributes needed to run the program.
es_un: ``backend_requirements``: Describe los atributos del backend necesarios para ejecutar el programa.
ja_jp: ``backend_requirements``: プログラムを実行するために必要なバックエンド属性の説明。
ko_kr: ``backend_requirements``: 프로그램 실행에 필요한 백엔드 속성을 설명한다.

source: ``parameters``: Describes the program input parameters as a JSON schema
es_un: ``parameters``: Describe los parámetros de entrada del programa como un esquema JSON
ja_jp: ``parameters``: プログラムの入力パラメーターを JSON スキーマとして記述。
ko_kr: ``parameters``: 프로그램 입력 매개변수를 JSON 스키마로 설명한다.

source: ``return_values``: Describes the return values as a JSON schema
es_un: ``return_values``: Describe los valores devueltos como un esquema JSON
ja_jp: ``return_values``: 戻り値を JSON スキーマとして記述。
ko_kr: ``return_values``: 반환 값을 JSON 스키마로 설명한다.

source: ``interim_results``: Describes the interim results as a JSON schema
es_un: ``interim_results``: Describe los resultados intermedios como un esquema JSON
ja_jp: ``interim_results``: 暫定結果を JSON スキーマとして記述。
ko_kr: ``interim_results``: 중간 결과를 JSON 스키마로 설명한다.
