Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/05_uploading_program.po
Languages: es_un, ja_jp, ko_kr

source: When uploading a program, you must specify at least ``name``, ``max_execution_time``, and ``description``. It is strongly encouraged to also specify ``parameters``, ``return_values``, and ``interim_results`` within ``spec`` if the program has them.
es_un: Al cargar un programa, debes especificar al menos ``name``, ``max_execution_time``, y ``description``. Se recomienda enfáticamente especificar también ``parameters``, ``return_values``, e ``interim_results`` dentro de ``spec`` si el programa los tiene.
ja_jp: プログラムをアップロードするときは、少なくとも ``name`` 、 ``max_execution_time`` 、および ``description`` を指定する必要があります。 プログラムにある場合は、 ``spec`` 内で ``parameters`` 、 ``return_values`` 、および ``interim_results`` も指定することを強くお勧めします。
ko_kr: 프로그램을 업로드할 때, 최소한 ``name``, ``max_execution_time``, ``description`` 을 명시해야 한다. 프로그램의 ``spec`` 하위에 ``parameters``, ``return_values``, ``interim_results`` 가 있다면 이를 명시하는 것을 권장한다.

source: Below shows the metadata JSON file of the ``hello-world`` program as an example:
es_un: A continuación se muestra el archivo JSON de metadatos del programa ``hello-world`` como ejemplo:
ja_jp: 以下に、 ``hello-world`` プログラムのメタデータ JSON ファイルを例として示します。
ko_kr: 아래는 ``hello-world`` 프로그램의 메타데이터인 JSON 파일 예제이다:

source: Uploading a program
es_un: Cargar un programa
ja_jp: プログラムのアップロード
ko_kr: 프로그램 업로드하기

source: You can use the `QiskitRuntimeService.upload_program() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.upload_program>`__ method to upload your program. In the example below, the program data lives in the file ``hello_world.py``, and its metadata, as described above, is in ``hello_world.json``.
es_un: Puedes usar el método `QiskitRuntimeService.upload_program() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.upload_program>`__ para cargar tu programa. En el siguiente ejemplo, los datos del programa residen en el archivo ``hello_world.py``, y sus metadatos, como se describe arriba, están en ``hello_world.json``.
ja_jp: `QiskitRuntimeService.upload_program() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.upload_program>`__ メソッドを使用して、プログラムをアップロードすることができます。 以下の例では、プログラムのデータはファイル ``hello_world.py`` にあり、そのメタデータは ``hello_world.json`` に示されています。
ko_kr: `QiskitRuntimeService.upload_program() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.upload_program>`__ 메서드를 사용해서 프로그램을 업로드할 수 있다. 아래 예제는 ``hello_world.py`` 파일에 있는 프로그램 데이터이며, 앞서 설명한 것처럼 메타데이터는 ``hello_world.json`` 에 있다:

source: ``upload_program()`` returns a program ID, which uniquely identifies the program. It is derived from the program name, usually with a randomly-generated suffix. Program ID is needed to invoke the program.
es_un: ``upload_program()`` devuelve un ID del programa, que identifica de forma única el programa. Se deriva del nombre del programa, generalmente con un sufijo generado aleatoriamente. Se necesita el ID del programa para invocar al programa.
ja_jp: ``upload_program()`` は、プログラムを一意的に識別するプログラム ID を戻します。 これはプログラム名から派生し、通常はランダムに生成された接尾部が付けられます。 プログラムを呼び出すにはプログラム ID が必要です。
ko_kr: ``upload_program()`` 는 프로그램 고유의 ID를 반환한다. 이는 프로그램 이름에서 파생되며, 일반적으로 무작위로 생성된 접미사를 함께 사용한다. 프로그램 ID는 프로그램을 호출할 때 필요하다.

source: Updating a program
es_un: Actualizar un programa
ja_jp: プログラムの更新
ko_kr: 프로그램 업데이트하기

source: You can use the `QiskitRuntimeService.update_program() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.update_program.html#qiskit_ibm_runtime.QiskitRuntimeService.update_program>`__ method to update the source code and/or metadata of a program:
es_un: Puedes usar el método `QiskitRuntimeService.update_program() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.update_program.html#qiskit_ibm_runtime.QiskitRuntimeService.update_program>`__ para actualizar el código fuente y/o los metadatos de un programa:
ja_jp: `QiskitRuntimeService.update_program() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.update_program.html#qiskit_ibm_runtime.QiskitRuntimeService.update_program>`__ メソッドを使用して、プログラムのソース・コードまたはメタデータ ( あるいはその両方 ) を更新することができます。
ko_kr: `QiskitRuntimeService.update_program() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.update_program.html#qiskit_ibm_runtime.QiskitRuntimeService.update_program>`__ 메서드를 사용해서 소스 코드 및/또는 프로그램의 메타데이터를 갱신할 수 있다.

source: This method allows you to make changes to your program while retaining the same program ID.
es_un: Este método te permite realizar cambios en tu programa conservando el mismo ID de programa.
ja_jp: この方法を使用すると、同じプログラム IDを保持しながら、プログラムに変更を加えることができます。
ko_kr: 이 매서드를 사용하면 동일한 프로그램 ID를 유지하면서 프로그램을 수정할 수 있다.

source: Deleting a program
es_un: Eliminar un programa
ja_jp: プログラムの削除
ko_kr: 프로그램 삭제하기

source: You can use the `QiskitRuntimeService.delete_program() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.delete_program>`__ method to delete a program. Only the person who uploaded the program can delete it.
es_un: Puedes usar el método `QiskitRuntimeService.delete_program() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.delete_program>`__ para eliminar un programa. Solo la persona que cargó el programa puede eliminarlo.
ja_jp: プログラムを削除するには、 `QiskitRuntimeService.delete_program() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.delete_program>`__ メソッドを使用できます。 削除できるのは、そのプログラムをアップロードしたユーザーのみです。
ko_kr: `QiskitRuntimeService.delete_program() <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.QiskitRuntimeService.html#qiskit_ibm_runtime.QiskitRuntimeService.delete_program>`__ 메서드를 사용해서 프로그램을 삭제할 수 있다. 프로그램을 업로드한 사람만 삭제가 가능하다.

source: Additional materials
es_un: Materiales adicionales
ja_jp: 追加資料
ko_kr: 추가 자료

source: This is an introductory tutorial on creating and uploading a very simple custom program. `sample_vqe_program/qiskit_runtime_vqe_program.ipynb <sample_vqe_program/qiskit_runtime_vqe_program.ipynb>`__ provides a more in-depth tutorial on creating a real-world Qiskit Runtime program.
es_un: Este es un tutorial introductorio sobre cómo crear y cargar un programa personalizado muy simple. `sample_vqe_program/qiskit_runtime_vqe_program.ipynb <sample_vqe_program/qiskit_runtime_vqe_program.ipynb>`__ proporciona un tutorial más detallado sobre cómo crear un programa Qiskit Runtime del mundo real.
ja_jp: これは、非常に単純なカスタム・プログラムを作成し、アップロードするための入門チュートリアルです。 `sample_vqe_program/qiskit_runtime_vqe_program.ipynb <sample_vqe_program/qiskit_runtime_vqe_program.ipynb>`__ を使用すると、実世界の Qiskit Runtime プログラムの作成に関するより詳細なチュートリアルが提供されます。
ko_kr: 지금까지는 매우 간단한 사용자 정의 프로그램을 만들고 업로드하는 방법을 설명했다. `sample_vqe_program/qiskit_runtime_vqe_program.ipynb <sample_vqe_program/qiskit_runtime_vqe_program.ipynb>`__ 은 실제 Qiskit Runtime 프로그램을 만드는 깊이 있는 해설이다.
