Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/chsh_with_estimator.po
Languages: es_un, ja_jp, ko, ta

source: This page was generated from `docs/tutorials/chsh_with_estimator.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/chsh_with_estimator.ipynb`__.
ja_jp: このページは `docs/tutorials/chsh_with_estimator.ipynb`__ から生成されました。
ko: 이 페이지는 "docs/tutorials/chsh_with_estimator.ipynb" 로부터 생성되었다.
ta: இந்தப் பக்கம் `docs/tutorials/chsh_with_estimator.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Demonstrate the violation of the CHSH inequality with the Estimator primitive
es_un: Demostrar el incumplimiento de la desigualdad CHSH con la primitiva Estimator
ja_jp: Estimator primitiveを用いたCHSH不等式の破れの証明
ko: Estimator primitive를 통해 CHSH 부등식의 위반 입증하기
ta: மதிப்பீட்டாளர் பழமையான உடன் CHSH சமத்துவமின்மையை மீறுவதை நிரூபிக்கவும்

source: In this tutorial, you will run an experiment on a quantum computer to demonstrate the violation of the CHSH inequality with the Estimator primitive.
es_un: En este tutorial, ejecutarás un experimento en una computadora cuántica para demostrar el incumplimiento de la desigualdad CHSH con la primitiva Estimator.
ja_jp: このチュートリアルでは、Estimator primitive を用いてCHSH不等式の破れを実証する実験を量子コンピューターで行います。
ko: 이 튜토리얼에서는 양자 컴퓨터 위에서 Estimator primitive를 통해 CHSH 부등식의 위반을 입증하는 실험을 진행할 것이다.
ta: இந்த டுடோரியலில், எஸ்டிமேட்டர் ப்ரிமிட்டிவ் உடன் CHSH சமத்துவமின்மையை மீறுவதை நிரூபிக்கக் குவாண்டம் கணினியில் ஒரு பரிசோதனையை இயக்குவீர்கள்.

source: The violation of the CHSH inequality is used to show that quantum mechanics is incompatible with local hidden-variable theories. This is an important experiment for understanding the foundation of quantum mechanics. Demonstrating this on a quantum computer was a major scientific breakthrough worthy of a high impact journal publication just a few years ago. [1] It’s truly incredible that you can conduct this experiment at the comfort of your home using Qiskit and an IBM Quantum system.
es_un: El incumplimiento de la desigualdad CHSH se usa para mostrar que la mecánica cuántica es incompatible con las teorías de variables ocultas locales. Este es un experimento importante para comprender los fundamentos de la mecánica cuántica. Demostrar esto en una computadora cuántica fue un gran avance científico digno de una publicación de alto impacto hace solo unos años. [1] Es realmente increíble que puedas realizar este experimento desde la comodidad de su hogar utilizando Qiskit y un sistema IBM Quantum.
ja_jp: CHSH不等式の破れは、量子力学が局所的な隠れた変数理論と相容れないことを示します。これは、量子力学の基礎を理解する上で重要な実験です。これを量子コンピューターで実証することは、ほんの数年前まで、インパクトのある学術誌に掲載される価値のある、大きな科学的ブレークスルーでした。[1] QiskitとIBM Quantumシステムを使って、自宅でこの実験を行えるのは本当に信じられないことです。
ko: CHSH 부등식의 위반은 양자역학이 국소적 숨은 변수 이론과 상호성립이 불가능하다는 것을 보여주기 위해서 사용된다. 이것은 양자역학의 기반을 이해하는 중요한 실험이다. 이를 양자 컴퓨터를 통해 입증하는 것은 불과 몇 년 전만 해도 높은 평가를 받는 저널에 발행할 만큼의 가치가 있는 과학적으로 주요한 발전이었다. [1] IBM Quantum 시스템과 Qiskit을 이용해 집에서 편안하게 이 실험을 실행할 수 있다는 건 엄청나게 놀라운 일이다.

source: Before you begin
es_un: Antes de comenzar
ja_jp: 始める前に
ko: 시작하기 전에

source: This tutorial requires a Qiskit Runtime service instance. If you haven’t done so already, follow the instructions in the Qiskit `Getting started guide <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ to set one up.
es_un: Este tutorial requiere una instancia del servicio Qiskit Runtime. Si aún no lo has hecho, sigue las instrucciones de la `guía de Primeros pasos de Qiskit <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ para configurar uno.
ja_jp: このチュートリアルには、Qiskit Runtimeのサービスインスタンスが必要です。まだの方は、Qiskitの `入門ガイド<https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ の指示に従ってセットアップしてください。
ko: 이 지침서는 Qiskit Runtime 서비스 인스턴스가 필요하다. 이것이 없다면 `이 단계 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ 를 Qiskit에 있는 설명을 따라 설정을 한다.

source: Background Information
es_un: Información de Antecedentes
ja_jp: 背景情報
ko: 배경 정보

source: CHSH Inequality
es_un: Desigualdad CHSH
ja_jp: CHSH不等式
ko: CHSH 부등식

source: The CHSH inequality, named after the authors Clauser, Horne, Shimony, and Holt, is used to experimentally prove Bell’s theorem. This theorem asserts that local hidden variable theories cannot account for some consequences of entanglement in quantum mechanics.
es_un: La desigualdad CHSH, llamada así por los autores Clauser, Horne, Shimony y Holt, se usa para demostrar experimentalmente el teorema de Bell. Este teorema afirma que las teorías de variables ocultas locales no se pueden dar cuenta de algunas consecuencias del entrelazamiento en la mecánica cuántica.
ja_jp: CHSH不等式は、著者であるClauser、Horne、Shimony、Holt にちなんで名付けられ、ベルの定理を実験的に証明するために使用されています。この定理は、局所的な隠れた変数理論は量子力学におけるエンタングルメントのいくつかの結果を説明できないと主張するものです。
ko: CHSH 부등식은 저자 Clauser와 Horne, Shimony, Holt의 이름을 따서 만들어진 것으로, Bell의 정리를 실험적으로 입증하기 위해 사용된다. 이 정리는 국소적 숨은 변수 이론이 양자역학의 얽힘에 대한 일부 결과를 고려할 수 없다고 주장한다.

source: For this experiment, we will create an entangled pair on which we measure each qubit on two different bases. We will label the bases for the first qubit :math:`A` and :math:`a` and the bases for the second qubit :math:`B` and :math:`b`. This allows us to compute the CHSH quantity :math:`S_1`:
es_un: Para este experimento, crearemos un par entrelazado en el que mediremos cada qubit en dos bases diferentes. Etiquetaremos las bases para el primer qubit :math:`A` y :math:`a` y las bases para el segundo qubit :math:`B` y :math:`b`. Esto nos permite calcular la cantidad :math:`S_1` de CHSH:
ja_jp: この実験では、量子もつれのペアを作り、それぞれの量子ビットを2つの異なる基底で測定します。第一量子ビットの基底を :math:`A` と :math:`a` 、第二量子ビットの基底を :math:`B` と :math:`b` とラベル付けします。これにより、CHSH量 :math:`S_1`を計算することができます。
ko: 이 실험을 위해 우리는 얽힌 쌍을 하나 만들고 그 쌍을 두 개의 다른 기저를 가진 각 큐비트를 측정한다. 첫 번째 큐비트의 기저는 :math:`A` 와 :math:`a` 로, 두 번째 큐비트의 기저는 :math:`B` 와 :math:`b` 로 이름 붙일 것이다. 이를 통해 CHSH 부등식 :math:`S_1` 을 계산할 수 있다:
ta: இந்தச் சோதனைக்காக, ஒரு சிக்கிய ஜோடியை உருவாக்குவோம், அதில் ஒவ்வொரு குவிட்டையும் இரண்டு வெவ்வேறு அடிப்படைகளில் அளவிடுவோம். முதல் குவிட் :math:`A` மற்றும் :math:`a` மற்றும் இரண்டாவது qubitக்கான அடிப்படைகளை :math:`B` மற்றும் :math:`b` என லேபிளிடுவோம். இது CHSH அளவைக் கணக்கிட அனுமதிக்கிறது :math:`S_1`:

source: Each observable is either :math:`+1` or :math:`-1`. Clearly, one of the terms :math:`B\pm b` must be :math:`0`, and the other must be :math:`\pm 2`. Therefore, :math:`S_1 = \pm 2`. The average value of :math:`S_1` must satisfy the inequality:
es_un: Cada observable es :math:`+1` o :math:`-1`. Claramente, uno de los términos :math:`B\pm b` debe ser :math:`0`, y el otro debe ser :math:`\pm 2`. Por lo tanto, :math:`S_1 = \pm 2`. El valor promedio de :math:`S_1` debe satisfacer la desigualdad:
ja_jp: 各オブザーバブルは :math:`+1` または :math:`-1` のいずれかです。 明らかに、項 :math:`B\pm b` の 1 つは 0 でなければならず、もう 1 つは :math:`\pm 2` でなければなりません。 したがって、 :math:`S_1 = \pm 2` です。 :math:`S_1` の平均値は次の不等式を満たさなければなりません。
ko: 각 관측가능량은 :math:`+1` 이거나 :math:`-1` 이다. 확실히 용어 :math:`B\pm b` 중 하나는 :math:`0` 이어야 하고, 다른 하나는 무조건 :math:`\pm 2` 이어야 한다. 따라서 :math:`S_1 = \pm 2` 이다. :math:`S_1` 의 평균값은 무조건 이 부등식을 만족한다:
ta: ஒவ்வொரு கவனிக்கத்தக்கது :math:`+1` அல்லது :math:`-1`. தெளிவாக, விதிமுறைகளில் ஒன்று :math:`B\pm b` கண்டிப்பாக :math:`0` ஆகவும், மற்றொன்று :math:`\pm 2` ஆகவும் இருக்க வேண்டும். எனவே, :math:`S_1 = \pm 2`. :math:`S_1` இன் சராசரி மதிப்பு சமத்துவமின்மையை பூர்த்தி செய்ய வேண்டும்:

source: Expanding :math:`S_1` in terms of :math:`A`, :math:`a`, :math:`B`, and :math:`b` results in:
es_un: Expandir :math:`S_1` en términos de :math:`A`, :math:`a`, :math:`B`, y :math:`b` da como resultado:
ja_jp: :math:`S_1` を :math:`A`、 :math:`a`、:math:`B`、:math:`b` で展開すると、次のようになります。
ko: :math:`A` 와 :math:`a`, :math:`B`, :math:`b` 의 면에서 :math:`S_1` 를 확장하면 결과는 다음과 같다:
ta: விரிவடைகிறது :math:`S_1` அடிப்படையில் :math:`A`, :math:`a`, :math:`B`, மற்றும் :math:`b` முடிவுகள்:

source: You can define another CHSH quantity :math:`S_2`:
es_un: Puedes definir otra cantidad :math:`S_2` de CHSH:
ja_jp: 別の CHSH 量 :math:`S_2` を定義できます。
ko: 다른 CHSH 부등식 :math:`S_2` 을 다음과 같이 정의할 수 있다:
ta: நீங்கள் மற்றொரு CHSH அளவை வரையறுக்கலாம் :math:`S_2`:

source: This leads to another inequality:
es_un: Esto conduce a otra desigualdad:
ja_jp: これは、別の不等式につながります。
ko: 이것은 다른 부등식으로 이어진다:
ta: இது மற்றொரு சமத்துவமின்மைக்கு வழிவகுக்கிறது:

source: If quantum mechanics can be described by local hidden variable theories, the above inequalities must hold true. However, as you are going to demonstrate in this notebook, these inequalities can be violated in a quantum computer. Therefore, quantum mechanics is not compatible with local hidden variable theories.
es_un: Si la mecánica cuántica puede describirse mediante teorías de variables ocultas locales, las desigualdades anteriores deben ser ciertas. Sin embargo, como vas a demostrar en este cuaderno, estas desigualdades pueden incumplirse en una computadora cuántica. Por lo tanto, la mecánica cuántica no es compatible con las teorías de variables ocultas locales.
ja_jp: もし、量子力学が局所的な隠れた変数理論で記述できるのであれば、上記の不等式は成立するはずです。しかし、このノートで示すように、量子コンピューターではこの不等式が破られる可能性があります。従って、量子力学は局所的な隠れた変数理論とは相容れません。
ko: 만약에 양자역학이 국소적 숨은 변수 이론으로 기술될 수 있다면 위의 부등식은 전부 참이어야 한다. 하지만 이 노트북에서 입증해보일 것처럼 이러한 부등식은 양자 컴퓨터에 위반된다. 따라서 양자역학은 국소적 숨은 변수 이론과는 상호성립이 불가능하다.

source: If you want to learn more, you can read the chapter about the CHSH inequality in `the Qiskit textbook <https://qiskit.org/textbook/ch-demos/chsh.html>`__.
es_un: Si deseas obtener más información, puedes leer el capítulo sobre la desigualdad CHSH en `el libro de texto de Qiskit <https://qiskit.org/textbook/ch-demos/chsh.html>`__.
ja_jp: もっと詳しく知りたい方は、 `Qiskitテキストブック<https://qiskit.org/textbook/ch-demos/chsh.html>`__にあるCHSH不等式についての章を読んでみてください。
ko: 더 공부하고 싶다면 `the Qiskit textbook <https://qiskit.org/textbook/ch-demos/chsh.html>`__ 에서 CHSH 부등식에 관한 장을 참고하길 바란다.
ta: நீங்கள் மேலும் அறிய விரும்பினால், `கிஸ்கிட் பாடப்புத்தகத்தில் <https://qiskit.org/textbook/ch-demos/chsh.html>`__ இல் CHSH சமத்துவமின்மை பற்றிய அத்தியாயத்தைப் படிக்கலாம்.

source: Overview
es_un: Descripción General
ja_jp: 概要
ko: 개요
ta: கண்ணோட்டம்

source: You will create an entangled pair between two qubits in a quantum computer by creating the Bell state :math:`|\Phi^+\rangle = \frac{|00\rangle + |11\rangle}{\sqrt{2}}`. Using the Estimator primitive, you can directly obtain the expectation values needed (:math:`\langle AB \rangle, \langle Ab \rangle, \langle aB \rangle`, and :math:`\langle ab \rangle`) to calculate the expectation values of the two CHSH quantities :math:`\langle S_1\rangle` and :math:`\langle S_2\rangle`. Before the introduction of the Estimator primitive, you would have to construct the expectation values from the measurement outcomes.
es_un: Crearás un par entrelazado entre dos qubits en una computadora cuántica creando el estado de Bell :math:`|\Phi^+\rangle = \frac{|00\rangle + |11\rangle}{\sqrt{2}}`. Con la primitiva Estimator, puedes obtener directamente los valores esperados necesarios (:math:`\langle AB \rangle, \langle Ab \rangle, \langle aB \rangle`, and :math:`\langle ab \rangle`) para calcular los valores esperados de las dos cantidades :math:`\langle S_1\rangle` y :math:`\langle S_2\rangle` de CHSH. Antes de la introducción de la primitiva Estimator, deberías construir los valores esperados a partir de los resultados de la medición.
ja_jp: ベル状態 :math:`|\Phi^+\rangle = \frac{|00\rangle + |11\rangle}{\sqrt{2}}` を作成することで、量子コンピューターの 2量子ビット間にエンタングルのペアを作成します。 Estimator primitive を使用すると、必要な期待値 (:math:`\langle AB \rangle, \langle Ab \rangle, \langle aB \rangle`, :math:`\langle ab \rangle`) を直接取得して、 :math:`\langle S_1\rangle` と :math:`\langle S_2\rangle` の 2 つの CHSH量の期待値を計算します。Estimator primitive を導入する前は、測定結果から期待値を構築する必要がありました。
ko: Bell 상태 :math:`|\Phi^+\rangle = \frac{|00\rangle + |11\rangle}{\sqrt{2}}` 를 만듦으로 양자 컴퓨터에서 두 개의 큐비트를 이용해 얽힘 쌍을 만들 것이다. Estimator primitive를 이용해 두 CHSH 양 :math:`\langle S_1\rangle` and :math:`\langle S_2\rangle` 의 기댓값을 계산하기 위해 필요한 기댓값(:math:`\langle AB \rangle, \langle Ab \rangle, \langle aB \rangle`, and :math:`\langle ab \rangle`)을 바로 얻을 수 있다. Estimator primitive 소개에 들어가기 전에, 측정 결과로부터 기댓값을 구성해야한다.
ta: பெல் நிலை :math:`|\Phi^+\rangle = \frac{|00\rangle + |11\rangle}{\sqrt{2}} ஐ உருவாக்குவதன் மூலம் ஒரு குவாண்டம் கணினியில் இரண்டு குவிட்களுக்கு இடையில் சிக்கிய ஜோடியை உருவாக்குவீர்கள் `. Estimator primitiveஐப் பயன்படுத்தி, தேவையான எதிர்பார்ப்பு மதிப்புகளை நீங்கள் நேரடியாகப் பெறலாம் (:math:`\langle AB \rangle, \langle Ab \rangle, \langle aB \rangle`, மற்றும் :math:`\langle ab \rangle`) இரண்டு CHSH அளவுகளின் எதிர்பார்ப்பு மதிப்புகளைக் கணக்கிடவும் :math:`\langle S_1\rangle` மற்றும் :math:`\langle S_2\rangle`. மதிப்பீட்டாளர் பழமையான அறிமுகத்திற்கு முன், நீங்கள் அளவீட்டு விளைவுகளிலிருந்து எதிர்பார்ப்பு மதிப்புகளை உருவாக்க வேண்டும்.

source: You will measure the second qubit in the :math:`Z` and :math:`X` bases. The first qubit will be measured also in orthogonal bases, but with an angle with respect to the second qubit, which we are going to sweep between :math:`0` and :math:`2\pi`. As you will see, the Estimator primitive makes running parameterized circuits very easy. Instead of creating a series of CHSH circuits, you only need to create *one* CHSH circuit with a parameter specifying the measurement angle and a series of phase values for the parameter.
es_un: Medirás el segundo qubit en las bases :math:`Z` y :math:`X`. El primer qubit se medirá también en bases ortogonales, pero con un ángulo con respecto al segundo qubit, que vamos a barrer entre :math:`0` y :math:`2\pi`. Como verás, la primitiva Estimator hace que ejecutar circuitos parametrizados sea muy fácil. En lugar de crear una serie de circuitos CHSH, solo necesitas crear *un* circuito CHSH con un parámetro que especifique el ángulo de medición y una serie de valores de fase para el parámetro.
ja_jp: :math:`Z` および:math:`X` 基底で 2 番目の量子ビットを測定します。 最初の量子ビットも直交基底で測定されますが、2 番目の量子ビットに対して角度があり、:math:`0` から:math:`2\pi` の間でスイープします。 ご覧のとおり、Estimator primitive により、パラメーター化された回路の実行が非常に簡単になります。 一連の CHSH 回路を作成する代わりに、測定角度を指定するパラメーターとパラメーターの一連の位相の値を使用して *1つ* の CHSH 回路を作成するだけで済みます。
ko: :math:`Z` 와 :math:`X` 기저에 있는 두 번째 큐비트를 측정할 것이다. 또한 첫 번째 큐비트는 직교 기저에서 측정될 것이지만, 두 번째 큐비트의 각도에 관련해서는 :math:`0` 과 :math:`2\pi` 사이에서 천천히 변화시킬 것이다. 보이는 것처럼 Estimator primitive는 매개변수화된 회로를 아주 쉽게 실행할 수 있다. 일련의 CHSH 회로를 만드는 대신, 측정 각도와 위상 값이 명시되어 있는 하나의 매개변수로 CHSH *하나*만 만들면 된다.

source: Finally, you will analyze the results and plot them against the measurement angle. You will see that for certain range of measurement angles, the expectation values of CHSH quantities :math:`|\langle S_1\rangle| > 2` or :math:`|\langle S_2\rangle| > 2`, which demonstrates the violation of the CHSH inequality.
es_un: Finalmente, analizarás los resultados y los graficarás contra el ángulo de medición. Verás que para cierto rango de ángulos de medición, los valores esperados de las cantidades CHSH serán :math:`|\langle S_1\rangle| > 2` o :math:`|\langle S_2\rangle| > 2`, lo que demuestra el incumplimiento de la desigualdad CHSH.
ja_jp: 最後に、結果を分析し、測定角度に対してプロットします。 測定角度の特定の範囲で、CHSH 量の期待値 が :math:`|\langle S_1\rangle| > 2` または :math:`|\langle S_2\rangle| > 2` であることがわかります。これは、CHSH 不等式の破れを示しています。
ko: 마지막으로, 결과를 분석하고 해당 결과를 측정 각도에 대해 그래프에 나타낼 것이다. 특정 범위의 측정 각도에 대해서 CHSH 양의 기댓값 :math:`|\langle S_1\rangle| > 2` 과 :math:`|\langle S_2\rangle| > 2` 이 CHSH 부등식의 위반을 나타내는 것을 알 수 있다.
ta: இறுதியாக, நீங்கள் முடிவுகளைப் பகுப்பாய்வு செய்து அளவீட்டு கோணத்திற்கு எதிராகத் திட்டமிடுவீர்கள். குறிப்பிட்ட அளவிலான அளவீட்டு கோணங்களுக்கு, CHSH அளவுகளின் எதிர்பார்ப்பு மதிப்புகள் :math:`|\langle S_1\rangle| > 2` அல்லது :math:`|\langle S_2\rangle| > 2`, இது CHSH சமத்துவமின்மையை மீறுவதைக் காட்டுகிறது.

source: Note
es_un: Nota
ja_jp: 注記
ko: 참고
ta: குறிப்பு

source: For experts users out there, we need to confess that there are a number of loopholes that have to be closed when violating the inequality in order to claim that either locality or realism have been disproven. Please read the last paragraph (right above “Exercise” section) in the CHSH chapter in `the Qiskit textbook <https://qiskit.org/textbook/ch-demos/chsh.html>`__ for discussions.
es_un: Para los usuarios expertos, debemos confesar que hay una serie de lagunas que deben cerrarse cuando se incumple la desigualdad para afirmar que la localidad o el realismo han sido refutados. Lee el último párrafo (justo arriba de la sección “Exercise”) en el capítulo CHSH en `el libro de texto de Qiskit <https://qiskit.org/textbook/ch-demos/chsh.html>`__ para discusiones.
ja_jp: この不等式の破れで、局所性や実在性が否定されたと主張するためには、いくつかの抜け穴を塞がなければならないことを、専門家のために告白しておく必要があります。議論のために、`Qiskitテキストブック<https://qiskit.org/textbook/ch-demos/chsh.html>`__ の CHSH の章の最後の段落（"Exercise "の項のすぐ上）を読んでください。
ko: 지역성이나 사실성이 증명되지 않았음을 주장하기 위한 부등식이 위반될 때 이 글을 읽는 전문가들에게 닫혀야하는 많은 허점이 있다는 사실을 고백해야한다. 이에 관한 토론을 위해 `the Qiskit textbook <https://qiskit.org/textbook/ch-demos/chsh.html>`__ CHSH 장의 마지막 단락(“Exercise” 절 바로 위)을 읽기를 바란다.

source: Step 1: Create CHSH circuits
es_un: Paso 1: Crear circuitos CHSH
ja_jp: ステップ1：CHSH回路の作成
ko: 1단계: CHSH 회로 생성하기
ta: படி 1: CHSH சுற்றுகளை உருவாக்கவும்

source: Create a parameterized CHSH circuit
es_un: Crea un circuito CHSH parametrizado
ja_jp: パラメーター化されたCHSH回路を作成する
ko: 매개변수화된 CHSH 회로 만들기
ta: ஒரு அளவுரு CHSH சுற்று உருவாக்கவும்

source: First, we write the circuit with the parameter :math:`\theta`, which we call ``theta``. The ``Estimator`` primitive can enormously simplify circuit building and output analysis by directly providing expectation values of observables. Many problems of interest, especially for near-term applications on noisy systems, can be formulated in terms of expectation values. For maximum generalization, the ``Estimator`` primitive requires circuits with no measurements.
es_un: Primero, escribimos el circuito con el parámetro :math:`\theta`, al que llamamos ``theta``. La primitiva ``Estimator`` puede simplificar enormemente la construcción de circuitos y el análisis de las salidas al proporcionar directamente los valores esperados de los observables. Muchos problemas de interés, especialmente para aplicaciones a corto plazo en sistemas ruidosos, se pueden formular en términos de valores esperados. Para una máxima generalización, la primitiva ``Estimator`` requiere circuitos sin mediciones.
ja_jp: まず、パラメータ :math:`\theta` を ``theta`` と呼ぶことにして、回路を書きます。Estimator primitiveは、観測値の期待値を直接提供することにより、回路の構築と出力の解析を非常に簡単に行うことができます。多くの興味深い問題、特にノイズのあるシステムを使う近未来のアプリケーションは、期待値で定式化できます。最大限の一般化を図るため、Estimator primitive は測定のない回路が必要です。
ko: 먼저 ``theta`` 라고 부르는 매개변수 :math:`\theta` 로 회로를 작성한다. ``Estimator`` primitive는 관측가능량의 기댓값을 직접적으로 제공함으로써 회로 생성 및 결과 분석을 매우 단순화할 수 있다. 특히 노이즈가 있는 시스템에서의 현재 애플리케이션을 위한 많은 흥미로운 문제는 기댓값의 관점에서 공식화될 수 있다. 가장 일반화된 형태를 위해서 ``Estimator`` primitive는 측정이 없는 회로를 필요로 한다.
ta: முதலில், நாம் சுற்றுகளை எழுதுகிறோம் அளவுரு :math:`\theta`, அதை நாம் ``theta`` என்று அழைக்கிறோம். ``மதிப்பீட்டாளர்`` ஆதியானது, அவதானிக்கக்கூடியவற்றின் எதிர்பார்ப்பு மதிப்புகளை நேரடியாக வழங்குவதன் மூலம் சுற்று உருவாக்கம் மற்றும் வெளியீட்டு பகுப்பாய்வை பெரிதும் எளிதாக்கும். ஆர்வமுள்ள பல சிக்கல்கள், குறிப்பாக சத்தமில்லாத அமைப்புகளில் அருகிலுள்ள பயன்பாடுகளுக்கு, எதிர்பார்ப்பு மதிப்புகளின் அடிப்படையில் வடிவமைக்கப்படலாம். அதிகபட்ச பொதுமைப்படுத்தலுக்கு, ``மதிப்பீட்டாளர்`` ப்ரிமிட்டிவ்க்கு அளவீடுகள் இல்லாத சுற்றுகள் தேவை.

source: Create a list of phase values to be assigned later
es_un: Crea una lista de valores de fase para asignarlos más adelante
ja_jp: 後で割り当てる位相の値のリストを作成する
ko: 나중에 지정할 위상 값 리스트 만들기
ta: பின்னர் ஒதுக்கப்பட வேண்டிய கட்ட மதிப்புகளின் பட்டியலை உருவாக்கவும்

source: After creating the parameterized CHSH circuit, you will create a list of phase values to be assigned to the circuit in the next step. You can use the code below to create a list of 21 phase values range from :math:`0` to :math:`2 \pi` with equal spacing, i.e. :math:`0`, :math:`0.1 \pi`, :math:`0.2 \pi`, …, :math:`1.9 \pi`, :math:`2 \pi`.
es_un: Después de crear el circuito CHSH parametrizado, crearás una lista de valores de fase que se asignarán al circuito en el siguiente paso. Puedes usar el siguiente código para crear una lista de 21 valores de fase que van desde :math:`0` a :math:`2 \pi` con espacios iguales, es decir, :math:`0`, :math:`0.1 \pi`, :math:`0.2 \pi`, …, :math:`1.9 \pi`, :math:`2 \pi`.

source: Step 2: Submit the circuits to a quantum computer on the cloud
es_un: Paso 2: Enviar los circuitos a una computadora cuántica en la nube
ja_jp: ステップ2: 回路をクラウド上の量子コンピューターに送信する
ko: 2단계: 클라우드의 양자 컴퓨터에 회로 제출하기
ta: படி 2: மேகக்கணியில் உள்ள குவாண்டம் கணினியில் சுற்றுகளைச் சமர்ப்பிக்கவும்

source: Connect to the Qiskit Runtime service
es_un: Conéctate al servicio Qiskit Runtime
ja_jp: Qiskit Runtime サービスに接続する
ko: Qiskit Runtime 서비스에 연결하기
ta: கிஸ்கிட் இயக்க நேர சேவையுடன் இணைக்கவும்

source: Before running circuits, you need to connect to the Qiskit Runtime service instance that you created in `the first step <#before-you-begin>`__. We will run this tutorial on a simulator.
es_un: Antes de ejecutar los circuitos, debes conectarte a la instancia del servicio Qiskit Runtime que creaste en `el primer paso <#before-you-begin>`__. Ejecutaremos este tutorial en un simulador.
ja_jp: 回路を実行する前に、 `最初のステップ <#before-you-begin>`__で作成したQiskit Runtimeサービスインスタンスに接続する必要があります。このチュートリアルは、シミュレーター上で実行します。
ko: 회로를 실행하기 전에 `the first step <#before-you-begin>`__ 에서 만든 Qiskit Runtime 서비스 인스턴스에 연결해야 한다. 이 튜토리얼은 시뮬레이터를 통해 실행될 예정이다.

source: Run the parameterized circuits using the Estimator primitive
es_un: Ejecuta los circuitos parametrizados usando la primitiva Estimator
ja_jp: Estimator primitive を使用してパラメーター化された回路を実行する
ko: Estimator primitive를 사용하여 매개변수화된 회로 실행하기

source: Now we need observables from which to compute the expectation values. In our case we are looking at orthogonal bases for each qubit, letting the parameterized :math:`Y-` rotation for the first qubit sweep the measurement basis nearly continuously with respect to the second qubit basis. We will therefore choose the observables :math:`ZZ`, :math:`ZX`, :math:`XZ`, and :math:`XX`.
es_un: Ahora necesitamos observables a partir de los cuales calcular los valores esperados. En nuestro caso, buscamos bases ortogonales para cada qubit, dejando que la rotación parametrizada :math:`Y` para el primer qubit, barra la base de medición casi continuamente con respecto a la segunda base del qubit. Por lo tanto, elegiremos los observables :math:`ZZ`, :math:`ZX`, :math:`XZ`, y :math:`XX`.
ja_jp: 次に、期待値を計算するためのオブザーバブルが必要です。 私たちの場合、各量子ビットの直交基底を見て、最初の量子ビットのパラメーター化された :math:`Y-` 回転が、2 番目の量子ビットの基底に関してほぼ連続的に測定基底をスイープするようにします。 したがって、オブザーバブル :math:`ZZ`, :math:`ZX`, :math:`XZ`, :math:`XX`を選択することにします。
ko: 이제 기댓값을 계산할 수 있는 관측가능량이 필요하다. 이번 경우에는 각 큐비트를 직교 기저에서 살펴보고, 첫 번째 큐비트에 매개변수화된 :math:`Y-` 회전을 적용하여 측정 기저를 두 번째 큐비트 기저와 관련하여 연속적으로 따라갈 것이다. 따라서 관측가능량 :math:`ZZ` 와 :math:`ZX`, :math:`XZ`, :math:`XX` 를 선택할 것이다.
ta: இப்போது எதிர்பார்ப்பு மதிப்புகளைக் கணக்கிடுவதற்கு அவதானிக்கக்கூடியவை தேவை. எங்கள் விஷயத்தில், ஒவ்வொரு குவிட்டிற்கும் ஆர்த்தோகனல் அடிப்படைகளை நாங்கள் பார்க்கிறோம், முதல் குவிட்டின் அளவுருவாகிய :math:`Y-` சுழற்சியானது இரண்டாவது குவிட் அடிப்படையைப் பொறுத்து அளவீட்டு அடிப்படையை கிட்டத்தட்ட தொடர்ச்சியாக ஸ்வீப் செய்ய அனுமதிக்கிறது. எனவே நாம் கவனிக்கக்கூடியவை :math:`ZZ`, :math:`ZX`, :math:`XZ`, மற்றும் :math:`XX` ஆகியவற்றைத் தேர்ந்தெடுப்போம்.

source: Step 3: Analyze the results
es_un: Paso 3: Analizar los resultados
ja_jp: ステップ 3: 結果の分析
ko: 3단계: 결과 분석하기
ta: படி 3: முடிவுகளைப் பகுப்பாய்வு செய்யவும்
