Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/chsh_with_estimator.po
Languages: es_un, ja_jp, ko, ta

source: After running the circuits, we need to build the CHSH witness functions. We first build the quantities :math:`\langle AB \rangle`, :math:`\langle Ab \rangle`, :math:`\langle aB \rangle`, and :math:`\langle ab \rangle`, by looking at the parity of the outcomes for the four families of circuits we built (two measurement bases for each of the two qubits). Then we use those quantities to build the witness functions as defined above.
es_un: Después de ejecutar los circuitos, necesitamos construir las funciones testigo de CHSH. Primero construimos las cantidades :math:`\langle AB \rangle`, :math:`\langle Ab \rangle`, :math:`\langle aB \rangle`, y :math:`\langle ab \rangle`, observando la paridad de los resultados de las cuatro familias de circuitos que construimos (dos bases de medición para cada uno de los dos qubits). Luego usamos esas cantidades para construir las funciones testigo como se definió anteriormente.
ja_jp: 回路を実行した後、CHSH 証人関数を構築する必要があります。 最初に、構築した 4 つの回路群（2つの量子ビットに2つの測定基底）の結果のパリティーを調べることによって、量 :math:`\langle AB \rangle`, :math:`\langle Ab \rangle`, :math:`\langle aB \rangle`, :math:`\langle ab \rangle` を構築します。 次に、これらの量を使用して、上記で定義した証人関数を構築します。
ko: 회로를 실행한 후 CHSH 관찰 함수를 만들어야 한다. 가장 먼저, 만든 회로(두 개의 큐비브 각각의 측정 기저 두 개)로부터 4개의 군의 결과 패리티를 보면서 양 :math:`\langle AB \rangle` 와 :math:`\langle Ab \rangle`, :math:`\langle aB \rangle`, :math:`\langle ab \rangle` 을 만들어야 한다. 그런 다음 위에서 정의한 관찰 함수를 만들기 위해 이러한 양들을 사용한다.

source: Note that now we do not have to build the observables ourselves because they are returned to us! The computed expectation values are given in ``result.values``. What comes back is a very small payload of data.
es_un: ¡Ten en cuenta que ahora no tenemos que construir los observables nosotros mismos porque nos los devuelven! Los valores esperados calculados se dan en ``result.values``. Lo que se regresa es una carga muy pequeña de datos.
ja_jp: 観測値が返されるので、自分たちで観測値を作る必要がないことに注意してください。計算された期待値は ``result.values`` で与えられます。返ってくるのは非常に小さなデータです。
ko: 이제 관측가능량이 반환되기 때문에 굳이 만들 필요가 없다는 것이 주목할만한 점이다! 계산된 기댓값은 ``result.values`` 로 주어진다. 다시 돌아오는 것은 데이터의 아주 작은 페이로드이다.
ta: கவனிக்கத்தக்கவைகளை நாமே உருவாக்க வேண்டியதில்லை, ஏனெனில் அவை எங்களிடம் திரும்புகின்றன! கணக்கிடப்பட்ட எதிர்பார்ப்பு மதிப்புகள் ``result.values`` இல் கொடுக்கப்பட்டுள்ளன. திரும்பி வருவது மிகவும் சிறிய அளவிலான தரவு.

source: In the figure above, the red dashed lines delimit the classical bounds (:math:`\pm 2`) and the dash-dotted blue lines delimit the quantum bounds (:math:`\pm 2\sqrt{2}`). You can see that the experimental results resemble the general trend of the simulated results and there are regions where the CHSH witness quantities exceeds the classical bounds. Congratulations! You have successfully demonstrated the violation of CHSH inequality in a real quantum system!
es_un: En la figura anterior, las líneas discontinuas rojas delimitan los límites clásicos (:math:`\pm 2`) y las líneas azules punteadas señalan los límites cuánticos (:math:`\pm 2\sqrt{2}`). Puedes ver que los resultados experimentales se asemejan a la tendencia general de los resultados simulados y hay regiones donde las cantidades testigo de CHSH exceden los límites clásicos. ¡Felicidades! ¡Has demostrado con éxito el incumplimiento de la desigualdad CHSH en un sistema cuántico real!
ja_jp: 上図では、赤の破線が古典的境界 (:math:`\pm 2`)、青の点線は量子的境界 (:math:`\pm 2\sqrt{2}`)を区切っています。実験結果はシミュレーション結果の一般的な傾向に似ており、CHSHの証人量が古典的な境界を越えている領域があることがわかります。おめでとうございます! あなたは、実際の量子系でCHSH不等式の破れを実証することに成功しました!
ko: 위의 그림에서 빨간 점선은 고전적 경계 (:math:`\pm 2`) 를 표시하고 파란 점선은 양자 경계 (:math:`\pm 2\sqrt{2}`) 를 표시한다. 보시다시피 실험 결과가 시뮬레이션 결과의 일반적 경향과 닮아있고 CHSH 관찰 양이 고전적 경계를 넘는 부분이 있다. 경축! 이제 실제 양자 계에서 CHSH 부등식 위반을 성공적으로 입증하였다!

source: Summary
es_un: Resumen
ja_jp: 概要
ko: 요약
ta: சுருக்கம்

source: In this tutorial, you have created a parameterized CHSH circuit, run it using the Estimator primitive, analyzed the results and demonstrated the violation of CHSH inequality. You can see that the Estimator primitive not only makes running parameterized circuits very easy but also greatly simplifies the workflow for obtaining expectation values for observables.
es_un: En este tutorial, creaste un circuito CHSH parametrizado, lo ejecutaste usando la primitiva Estimator, analizaste los resultados y demostraste el incumplimiento de la desigualdad CHSH. Puedes ver que la primitiva Estimator no solo facilita la ejecución de circuitos parametrizados, sino que también simplifica enormemente el flujo de trabajo para obtener los valores esperados de los observables.
ja_jp: このチュートリアルでは、パラメーター化されたCHSH回路を作成し、Estimator primitive を使って実行し、結果を解析してCHSH不等式の破れを実証しています。Estimator primitive はパラメーター化された回路の実行を非常に簡単にするだけでなく、観測値の期待値を得るためのワークフローを大幅に簡素化することができることがおわかりいただけたと思います。
ko: 이 튜토리얼에서 매개변수화된 CHSH 부등식의 회로를 만들고, Estimator primitive를 사용해 회로를 실행하고 결과를 분석해 CHSH 부등식의 위반을 입증하였다. 이러한 과정 속에서 Estimator primitive는 매개변수화된 회로를 아주 쉽게 실행할 수 있을 뿐만 아니라 관측가능량의 기댓값을 얻는 과정을 매우 단순화할 수 있음을 확인했을 것이다.
ta: இந்த டுடோரியலில், நீங்கள் ஒரு அளவுரு CHSH சர்க்யூட்டை உருவாக்கியுள்ளீர்கள், மதிப்பீட்டாளர் ப்ரிமிட்டிவ் பயன்படுத்தி அதை இயக்கவும், முடிவுகளை பகுப்பாய்வு செய்து CHSH சமத்துவமின்மையை மீறுவதை நிரூபித்துள்ளீர்கள். Estimator primitive ஆனது பாராமீட்டரைஸ்டு சர்க்யூட்களை இயக்குவதை மிகவும் எளிதாக்குவது மட்டுமல்லாமல், அவதானிக்கக்கூடியவற்றிற்கான எதிர்பார்ப்பு மதிப்புகளைப் பெறுவதற்கான பணிப்பாய்வுகளை பெரிதும் எளிதாக்குவதையும் நீங்கள் பார்க்கலாம்.

source: References
es_un: Referencias
ja_jp: 参考文献
ko: 참고문헌
ta: குறிப்புகள்

source: Qiskit versions and copyright
es_un: Versiones de Qiskit y derechos de autor
ja_jp: Qiskit のバージョンと著作権
ko: Qiskit 버전 및 저작권
ta: Qiskit பதிப்புகள் மற்றும் பதிப்புரிமை

source: After creating the parameterized CHSH circuit, you will create a list of phase values to be assigned to the circuit in the next step. You can use the code below to create a list of 21 phase values range from :math:`0` to :math:`2 \pi` with equal spacing, i.e. \ :math:`0`, :math:`0.1 \pi`, :math:`0.2 \pi`, …, :math:`1.9 \pi`, :math:`2 \pi`.
ja_jp: パラメーター化された CHSH 回路を作成したら、次の手順で回路に割り当てる位相の値のリストを作成します。 以下のコードを使用して、等間隔、つまり \ :math:`0`, :math:`0.1 \pi`, :math:`0.2 \pi`, …, :math:`1.9 \pi`, :math:`2 \pi` で :math:`0` から:math:`2 \pi` までの範囲の 21 の位相の値のリストを作成します。

source: Background information
ta: பின்னணி தகவல்

source: CHSH inequality
ta: CHSH சமத்துவமின்மை

source: The CHSH inequality, named after the authors Clauser, Horne, Shimony, and Holt, is used to experimentally prove Bell's theorem. This theorem asserts that local hidden variable theories cannot account for some consequences of entanglement in quantum mechanics.
ta: கிளாசர், ஹார்ன், ஷிமோனி மற்றும் ஹோல்ட் ஆகிய ஆசிரியர்களின் பெயரால் பெயரிடப்பட்ட CHSH சமத்துவமின்மை, பெல்லின் தேற்றத்தை சோதனை ரீதியாக நிரூபிக்கப் பயன்படுகிறது. குவாண்டம் இயக்கவியலில் சிக்கலின் சில விளைவுகளுக்கு உள்ளூர் மறைக்கப்பட்ட மாறி கோட்பாடுகள் காரணமாக இருக்க முடியாது என்று இந்த தேற்றம் வலியுறுத்துகிறது.

source: If quantum mechanics can be described by local hidden variable theories, the previous inequalities must hold true. However, as you are going to demonstrate in this notebook, these inequalities can be violated in a quantum computer. Therefore, quantum mechanics is not compatible with local hidden variable theories.
ta: குவாண்டம் இயக்கவியல் உள்ளூர் மறைக்கப்பட்ட மாறிக் கோட்பாடுகளால் விவரிக்கப்படுமானால், முந்தைய ஏற்றத்தாழ்வுகள் உண்மையாக இருக்க வேண்டும். இருப்பினும், இந்த நோட்புக்கில் நீங்கள் நிரூபிக்கப் போகிறீர்கள், இந்த ஏற்றத்தாழ்வுகள் ஒரு குவாண்டம் கணினியில் மீறப்படலாம். எனவே, குவாண்டம் இயக்கவியல் உள்ளூர் மறைக்கப்பட்ட மாறி கோட்பாடுகளுடன் பொருந்தாது.

source: You will measure the second qubit in the :math:`Z` and :math:`X` bases. The first qubit will be measured also in orthogonal bases, but with an angle with respect to the second qubit, which we are going to sweep between :math:`0` and :math:`2\pi`. As you will see, the Estimator primitive makes running parameterized circuits very easy. Rather than creating a series of CHSH circuits, you only need to create *one* CHSH circuit with a parameter specifying the measurement angle and a series of phase values for the parameter.
ta: நீங்கள் :math:` Z ` மற்றும் :math:` X ` தளத்தில் இரண்டாவது குறும்படத்தை அளவிடும். முதல் குறும்படம் ஒழுங்கற்ற தளங்களிலும் அளவிடப்படும், ஆனால் இரண்டாவது குறும்படத்துக்கு மதிப்புடன் ஒரு கோணத்துடன், நாம் :math:` 0 ` மற்றும் :math:` 2\pi ` க்கு இடையே சென்றுவிடும். நீங்கள் பார்க்க, Estimator primitive போன்றவற்றை மிகவும் எளிமையாகச் செய்கிறது. CHSH சாளரங்களின் தொடர்களை உருவாக்குவதற்கு மேலாக, நீங்கள் மட்டும் * CHSH சாதனத்தை மட்டும் அளபுருவாக உருவாக்க வேண்டும். அளபுருக்கான அளபுருக்கான கோணம் மற்றும் அளபுரு மதிப்புகளின் தொடர்.

source: For expert users out there, we should mention there are several loopholes that must be closed when violating the inequality to claim that either locality or realism have been disproven. See the last paragraph (right before the "Exercise" section) in the CHSH chapter in `the Qiskit textbook <https://qiskit.org/textbook/ch-demos/chsh.html>`__ for discussions.
ta: அங்குள்ள நிபுணத்துவ பயனர்களுக்கு, சமத்துவமின்மையை மீறும் போது, ​​உள்ளாட்சி அல்லது யதார்த்தவாதம் நிரூபிக்கப்பட்டதாகக் கூறுவதற்கு பல ஓட்டைகள் மூடப்பட வேண்டும் என்பதை நாம் குறிப்பிட வேண்டும். விவாதங்களுக்கு `கிஸ்கிட் பாடப்புத்தகத்தில் <https://qiskit.org/textbook/ch-demos/chsh.html>`__ இல் உள்ள CHSH அத்தியாயத்தில் உள்ள கடைசி பத்தியை ("உடற்பயிற்சி" பகுதிக்கு முன் வலது) பார்க்கவும்.

source: After creating the parameterized CHSH circuit, you will create a list of phase values to be assigned to the circuit in the next step. You can use the following code to create a list of 21 phase values range from :math:`0` to :math:`2 \pi` with equal spacing, that is, :math:`0`, :math:`0.1 \pi`, :math:`0.2 \pi`, ..., :math:`1.9 \pi`, :math:`2 \pi`.
ta: அளவுரு CHSH சர்க்யூட்டை உருவாக்கிய பிறகு, அடுத்த கட்டத்தில் சுற்றுக்கு ஒதுக்க வேண்டிய கட்ட மதிப்புகளின் பட்டியலை உருவாக்குவீர்கள். :math:`0` இலிருந்து :math:`2 \pi` வரையிலான 21 கட்ட மதிப்புகளின் பட்டியலை உருவாக்க பின்வரும் குறியீட்டைப் பயன்படுத்தலாம், அதாவது :math:`0`, :math:`0.1 \pi`, :math:`0.2 \pi`, ..., :math:`1.9 \pi`, :math:`2 \pi`.

source: After running the circuits, we need to build the CHSH witness functions. We first build the quantities :math:`\langle AB \rangle`, :math:`\langle Ab \rangle`, :math:`\langle aB \rangle`, and :math:`\langle ab \rangle`, by looking at the parity of the outcomes for the four families of circuits we built (two measurement bases for each of the two qubits). Then we use those quantities to build the witness functions as defined previously.
ta: சுற்றுகளை இயக்கிய பிறகு, நாம் CHSH சாட்சி செயல்பாடுகளை உருவாக்க வேண்டும். நாம் முதலில் அளவுகளை உருவாக்குகிறோம் :math:`\langle AB \rangle`, :math:`\langle Ab \rangle`, :math:`\langle aB \rangle`, மற்றும் :math:`\langle ab \rangle`, நாங்கள் உருவாக்கிய சுற்றுகளின் நான்கு குடும்பங்களுக்கான விளைவுகளின் சமநிலையைப் பார்ப்பதன் மூலம் (இரண்டு குவிட்களில் ஒவ்வொன்றிற்கும் இரண்டு அளவீட்டுத் தளங்கள்). முன்பு வரையறுக்கப்பட்டபடி சாட்சி செயல்பாடுகளை உருவாக்க அந்த அளவுகளைப் பயன்படுத்துகிறோம்.

source: In the figure, the red dashed lines delimit the classical bounds (:math:`\pm 2`) and the dash-dotted blue lines delimit the quantum bounds (:math:`\pm 2\sqrt{2}`). You can see that the experimental results resemble the general trend of the simulated results and there are regions where the CHSH witness quantities exceeds the classical bounds. Congratulations! You have successfully demonstrated the violation of CHSH inequality in a real quantum system!
ta: படத்தில், சிவப்பு கோடு கோடுகள் கிளாசிக்கல் எல்லைகளை (:math:`\pm 2`) மற்றும் கோடு-புள்ளியிடப்பட்ட நீல கோடுகள் குவாண்டம் எல்லைகளை (:math:`\pm 2\sqrt{2}`) வரையறுக்கின்றன. சோதனை முடிவுகள் உருவகப்படுத்தப்பட்ட முடிவுகளின் பொதுவான போக்கை ஒத்திருப்பதை நீங்கள் காணலாம் மற்றும் CHSH சாட்சி அளவுகள் பாரம்பரிய வரம்புகளை மீறும் பகுதிகள் உள்ளன. வாழ்த்துகள்! உண்மையான குவாண்டம் அமைப்பில் CHSH சமத்துவமின்மையை மீறுவதை நீங்கள் வெற்றிகரமாக நிரூபித்துள்ளீர்கள்!

source: Córcoles, A. (n.d.), Local Reality and the CHSH Inequality. In A. Abbas, et al. Learn Quantum Computation Using Qiskit. URL: https://qiskit.org/textbook/ch-demos/chsh.html (accessed 07/13/2022) (2020).
ta: கோர்கோல்ஸ், ஏ. (என்.டி.), லோக்கல் ரியாலிட்டி அண்ட் தி CHSH சமத்துவமின்மை. ஏ. அப்பாஸ் மற்றும் பலர். கிஸ்கிட்டைப் பயன்படுத்தி குவாண்டம் கணக்கீட்டைக் கற்றுக்கொள்ளுங்கள். URL: https://qiskit.org/textbook/ch-demos/chsh.html (07/13/2022 அணுகப்பட்டது) (2020).
