Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/Error-Suppression-and-Error-Mitigation.po
Languages: es_un, ja

source: Twirled readout error extinction (T-REx) uses a technique known as Pauli twirling to reduce the noise introduced during the process of quantum measurement. This technique assumes no specific form of noise, which makes it very general and effective.
es_un: La extinción de error de lectura torcida (Twirled readout error extinction, T-REx) utiliza una técnica conocida como giro de Pauli (Pauli twirling) para reducir el ruido introducido durante el proceso de medición cuántica. Esta técnica no asume una forma específica de ruido, lo que la hace muy general y efectiva.
ja: トワイル読み出しエラー消去法 (Twirled Readout Error eXtinction, T-REx) は、Pauli twirlingと呼ばれる技術を使用して、量子力学の測定過程で混入するノイズを低減します。この手法は、特定の形態のノイズを想定していないため、非常に汎用的で効果的です。

source: Overall workflow
es_un: Flujo de trabajo general
ja: 全体のワークフロー

source: Acquire data for the zero state with randomized bit flips (i.e. Pauli X before measurement)
ja: ランダム化されたビットフリップでゼロ状態のデータを取得します (つまり、測定前のパウリ X)。

source: Acquire data for the desired (noisy) state with randomized bit flips (i.e. Pauli X before measurement)
ja: ランダム化されたビットフリップを使用して目的の (ノイズの多い) 状態のデータを取得します (つまり、測定前のパウリ X)。

source: Compute the special function for each data set, and divide.
es_un: Calcular la función especial para cada conjunto de datos y dividir.
ja: 各データセットの特殊関数を計算し、除算します。

source: **Reference**: E. van den Berg, Z. Minev, and K. Temme, *Model-free readout-error mitigation for quantum expectation values* `arXiv:2012.09738 <https://arxiv.org/abs/2012.09738>`__
es_un: **Referencia**: E. van den Berg, Z. Minev, and K. Temme, *Model-free readout-error mitigation for quantum expectation values* `arXiv:2012.09738 <https://arxiv.org/abs/2012.09738>`__
ja: **参考文献**: E. van den Berg, Z. Minev, and K. Temme, *Model-free readout-error mitigation for quantum expectation values* `arXiv:2012.09738 <https://arxiv.org/abs/2012.09738>`__

source: Zero noise extrapolation
es_un: Extrapolación de ruido cero
ja: ゼロ・ノイズ外挿

source: Zero noise extrapolation (ZNE) works by first amplifying the noise in the circuit that is preparing the desired quantum state, obtaining measurements for several different levels of noise, and using those measurements to infer the noiseless result.
es_un: La extrapolación de ruido cero (zero noise extrapolation, ZNE) funciona amplificando primero el ruido en el circuito que está preparando el estado cuántico deseado, obteniendo medidas para varios niveles diferentes de ruido y usando esas medidas para inferir el resultado sin ruido.
ja: ゼロ・ノイズ外挿 (ZNE) は、最初に目的の量子状態を準備している回路内のノイズを増幅し、いくつかの異なるレベルのノイズの測定値を取得し、それらの測定値を使用してノイズのない結果を推測することによって機能します。

source: Amplify circuit noise for several noise factors
es_un: Amplificar el ruido del circuito para varios factores de ruido
ja: いくつかのノイズ要因に対して回路ノイズを増幅する

source: Run every noise amplified circuit
es_un: Ejecutar cada circuito amplificado de ruido
ja: すべてのノイズ増幅回路を実行する

source: Extrapolate back to the zero noise limit
es_un: Extrapolar de regreso al límite de ruido cero
ja: ゼロ・ノイズ限界に外挿する

source: Probabilistic error cancellation
es_un: Cancelación probabilística de errores
ja: 確率的エラー・キャンセル

source: Probabilistic error cancellation (PEC) samples for a collection of circuits that, on average mimics a noise inverting channel to cancel out the noise in the desired computation. This process is a bit like how noise-cancelling headphones work, and produces great results, however it is not as general as other methods, and the sampling overhead is exponential.
ja: 回路のコレクションの確率的エラー・キャンセル (PEC) サンプルは、平均してノイズ反転チャネルを模倣して、目的の計算でノイズをキャンセルします。 このプロセスは、ノイズ・キャンセリング・ヘッドフォンの動作に少し似ており、優れた結果をもたらしますが、他の方法ほど一般的ではなく、サンプリング・オーバーヘッドは指数関数的です。

source: **Reference**: E. van den Berg, Z. Minev, A. Kandala, and K. Temme, *Probabilistic error cancellation with sparse Pauli-Lindblad models on noisy quantum processors* `arXiv:2201.09866 <https://arxiv.org/abs/2201.09866>`__
es_un: **Referencia**: E. van den Berg, Z. Minev, A. Kandala, and K. Temme, *Probabilistic error cancellation with sparse Pauli-Lindblad models on noisy quantum processors* `arXiv:2201.09866 <https://arxiv.org/abs/2201.09866>`__
ja: **参考文献**: E. van den Berg, Z. Minev, A. Kandala, and K. Temme, *Probabilistic error cancellation with sparse Pauli-Lindblad models on noisy quantum processors* `arXiv:2201.09866 <https://arxiv.org/abs/2201.09866>`__

source: Step 1: Pauli twirling
es_un: Paso 1: Giros de Pauli (Pauli twirling)
ja: ステップ 1: Pauliトワイル

source: Step 2: Repeat layer and learn the noise
es_un: Paso 2: Repetir la capa y aprender el ruido
ja: ステップ2：レイヤーを繰り返したノイズの学習

source: Step 3: Derive a fidelity (error for each noise channel)
es_un: Paso 3: Obtener una fidelidad (error para cada canal de ruido)
ja: ステップ 3: 忠実度の導出 (各ノイズ・チャネルの誤差)

source: PEC callback messages explained
es_un: Explicación de los mensajes de devolución de llamada de PEC
ja: PEC コールバック・メッセージの説明

source: **Layers detected:**
es_un: **Capas detectadas:**
ja: **検出されたレイヤー:**

source: In the list of circuits passed to the Estimator, a total of **60** layers were detected and **two** of them were unique. Qiskit Runtime will learn the noise model for the two unique layers.
es_un: En la lista de circuitos pasados al Estimator, se detectaron un total de **60** capas y **dos** de ellas fueron únicas. Qiskit Runtime aprenderá el modelo de ruido para las dos capas únicas.
ja: Estimator に渡された回路のリストでは、合計で **60** のレイヤーが検出され、そのうちの **2** は一意でした。 Qiskit Runtime は、2 つの固有のレイヤーのノイズ・モデルを学習します。

source: **Sampling overhead for layers:**
es_un: **Sobrecarga de muestreo para capas:**
ja: **レイヤーのサンプリング・オーバーヘッド:**

source: These messages show the sampling overhead for each of the unique layers. Notice that it took roughly 7 minutes to learn the noise model of each layer.
es_un: Estos mensajes muestran la sobrecarga de muestreo para cada una de las capas únicas. Ten en cuenta que tomó aproximadamente 7 minutos aprender el modelo de ruido de cada capa.
ja: これらのメッセージは、一意のレイヤーごとのサンプリング・オーバーヘッドを示します。 各レイヤーのノイズ・モデルを学習するのに約 7 分かかったことに注意してください。

source: In the list of circuits passed to Estimator, a total of **60** layers were detected and **two** of them were unique. Qiskit Runtime will learn the noise model for the two unique layers.
es_un: En la lista de circuitos pasados a Estimator, se detectaron un total de **60** capas y **dos** de ellas fueron únicas. Qiskit Runtime aprenderá el modelo de ruido para las dos capas únicas.
ja: Estimator に渡された回路のリストでは、合計で **60** のレイヤーが検出され、そのうちの **2** は一意でした。 Qiskit Runtime は、2 つの固有のレイヤーのノイズ・モデルを学習します。

source: **Circuit total sampling overhead**
es_un: **Sobrecarga de muestreo total del circuito**
ja: **回路の合計サンプリング・オーバーヘッド**

source: Circuit 1 total sampling overhead: ``1.2045186180127132``
es_un: Sobrecarga de muestreo total del circuito 1: ``1.2045186180127132``
ja: 回路 1 の合計サンプリング・オーバーヘッド: ``1.2045186180127132``

source: Circuit 2 total sampling overhead: ``1.4508651011392564``
es_un: Sobrecarga de muestreo total del circuito 2: ``1.4508651011392564``
ja: サーキット 2 の合計サンプリング・オーバーヘッド: ``1.4508651011392564``

source: Circuit 3 total sampling overhead: ``1.7475940265471324``
es_un: Sobrecarga de muestreo total del circuito 3: ``1.7475940265471324``
ja: 回路 3 の合計サンプリング・オーバーヘッド: ``1.7475940265471324``

source: Circuit 4 total sampling overhead: ``2.105009541703825``
es_un: Sobrecarga de muestreo total del circuito 4: ``2.105009541703825``
ja: 回路 4 の合計サンプリング・オーバーヘッド: ``2.105009541703825``

source: Circuit 5 total sampling overhead: ``2.5355231840766654``
es_un: Sobrecarga de muestreo total del circuito 5: ``2.5355231840766654``
ja: 回路 5 の合計サンプリング・オーバーヘッド: ``2.5355231840766654``

source: The sampling overhead increases when there are more layers to mitigate.
es_un: La sobrecarga de muestreo aumenta cuando hay más capas a mitigar.
ja: 軽減するレイヤーが増えると、サンプリングのオーバーヘッドが増加します。

source: PEC metadata
es_un: Metadatos de PEC
ja: PEC メタデータ

source: Circuit 1:
es_un: Circuito 1:
ja: 回路 1:

source: Circuit 2:
es_un: Circuito 2:
ja: 回路 2:

source: Circuit 3:
es_un: Circuito 3:
ja: 回路 3:

source: Circuit 4:
es_un: Circuito 4:
ja: 回路 4:

source: Circuit 5
es_un: Circuito 5
ja: 回路5

source: Combined plot
es_un: Gráfica combinada
ja: 結合されたプロット

source: Advanced ZNE options
es_un: Opciones avanzadas de ZNE
ja: 高度なZNEオプション

source: Noise amplification
es_un: Amplificación de ruido
ja: ノイズ増幅

source: As a first approach, we provide a noise amplification technique known as *unitary folding*.
es_un: Como primera aproximación, proporcionamos una técnica de amplificación de ruido conocida como *plegamiento unitario* (unitary folding).
ja: 最初のアプローチとして、 *ユニタリ・フォールディング* として知られるノイズ増幅技術を提供します。

source: **Reference**: Tudor Giurgica-Tiron, Yousef Hindy, Ryan LaRose, Andrea Mari, and William J. Zeng, *Digital zero noise extrapolation for quantum error mitigation* `arXiv:2005.10921 <https://arxiv.org/abs/2005.10921>`__.
es_un: **Referencia**: Tudor Giurgica-Tiron, Yousef Hindy, Ryan LaRose, Andrea Mari, and William J. Zeng, *Digital zero noise extrapolation for quantum error mitigation* `arXiv:2005.10921 <https://arxiv.org/abs/2005.10921>`__.
ja: **参考文献**: Tudor Giurgica-Tiron, Yousef Hindy, Ryan LaRose, Andrea Mari, and William J. Zeng, *Digital zero noise extrapolation for quantum error mitigation* `arXiv:2005.10921 <https://arxiv.org/abs/2005.10921>`__.

source: Digital vs analog
es_un: Digital vs analógico
ja: デジタル vs アナログ

source: Local vs global
ja: ローカル対グローバル

source: Extrapolation
es_un: Extrapolación
ja: 外挿

source: Useful noise profiles
es_un: Perfiles de ruido útiles
ja: 便利なノイズ・プロファイル

source: Useless noise profiles
es_un: Perfiles de ruido inútiles
ja: 役に立たないノイズ・プロファイル

source: Error suppression and error mitigation with Qiskit Runtime
es_un: Supresión y mitigación de errores con Qiskit Runtime

source: The following code cell defines a list of Trotter circuits for use in the experiments.
es_un: La siguiente celda de código define una lista de circuitos Trotter para usar en los experimentos.

source: Suppression
es_un: Supresión

source: Let's start with the error correction, since it was the first one to be formally discovered within the field.
es_un: Comencemos con la corrección de errores, ya que fue la primera en ser descubierta formalmente dentro del campo.

source: **Reference**: M.A. Nielsen, and I.L. Chuang, *Quantum Computation and Quantum Information*.
es_un: **Referencia**: M.A. Nielsen, and I.L. Chuang, *Quantum Computation and Quantum Information*.

source: \* The data in the previous table is based on simulations for surface codes with certain conditions. The code distance was chosen so that none of the T-gates, or 100 logical qubits at the end of runtime, had error greater than :math:`1\text{E}-2`. The number of T-gates is :math:`n \times d` and each parity check cycle takes :math:`1 \mu s`.
es_un: \* Los datos de la tabla anterior se basan en simulaciones para códigos de superficie con ciertas condiciones. La distancia del código se eligió para que ninguna de las compuertas T, o 100 qubits lógicos al final del tiempo de ejecución, tuviera un error mayor a :math:`1\text{E}-2`. El número de compuertas T es :math:`n \times d` y cada ciclo de verificación de paridad toma :math:`1 \mu s`.

source: Error suppression is the most basic level of error handling. It often refers to a set of techniques performed close to hardware, such as altering control signals (that is, at Qiskit Pulse level). To make it simpler, we define these techniques as introducing *classical overhead*, usually within the transpilation/compilation process.
es_un: La supresión de errores es el nivel más básico de manejo de errores. A menudo se refiere a un conjunto de técnicas realizadas cerca del hardware, como la alteración de las señales de control (es decir, a nivel de Qiskit Pulse). Para hacerlo más simple, definimos estas técnicas como la introducción de *sobrecarga clásica*, generalmente dentro del proceso de transpilación/compilación.

source: Quantum computers have adopted some of these techniques like spin echos (a sequence of pulses that can help refocus the state of a qubit). As a matter of fact, spin echos play a big role in a class of techniques known as *Dynamical Decoupling* (DD), which sends pulses to idle qubits to reset their value to their original states, undoing the potentially harmful effects of nearby qubits that are being used for the calculation.
es_un: Las computadoras cuánticas han adoptado algunas de estas técnicas como ecos de espín (una secuencia de pulsos que pueden ayudar a reenfocar el estado de un qubit). De hecho, los ecos de espín juegan un papel importante en una clase de técnicas conocidas como *Desacoplamiento dinámico* (DD), que envía pulsos a qubits inactivos para restablecer su valor a sus estados originales, deshaciendo los efectos potencialmente dañinos de qubits cercanos que se están utilizando para el cálculo.

source: Typically, error correction uses the outputs of multiple ensembles of noisy calculations to reduce or eliminate the noise in estimating quantities like expectation values — commonly by using classical post-processing. In this regard, error mitigation is different from error correction. Rather than fixing errors in every circuit run, errors are allowed to occur, then better results are inferred from several of these noisy calculations.
es_un: Por lo general, la corrección de errores utiliza las salidas de múltiples conjuntos de cálculos ruidosos para reducir o eliminar el ruido al estimar cantidades como valores esperados, comúnmente mediante el uso de posprocesamiento clásico. En este sentido, la mitigación de errores es diferente de la corrección de errores. En lugar de corregir los errores en cada ejecución del circuito, se permite que ocurran errores, luego se infieren mejores resultados de varios de estos cálculos ruidosos.

source: Since there is no threshold that one must surpass before quantum error mitigation becomes practical, we see error mitigation as the key to realizing useful quantum computers in the near term.
es_un: Dado que no hay un umbral que uno deba superar antes de que la mitigación de errores cuántica sea práctica, vemos la mitigación de errores como la clave para realizar computadoras cuánticas útiles a corto plazo.

source: Acquire data for the zero state with randomized bit flips (Pauli X before measurement)
es_un: Adquirir datos para el estado cero con cambios de bits aleatorios (Pauli X antes de la medición)

source: Acquire data for the desired (noisy) state with randomized bit flips (Pauli X before measurement)
es_un: Adquirir datos para el estado deseado (ruidoso) con cambios de bits aleatorios (Pauli X antes de la medición)

source: Probabilistic error cancellation (PEC) samples for a collection of circuits that, on average mimics a noise inverting channel to cancel out the noise in the desired computation. This process is a bit like how noise-cancelling headphones work, and produces great results; however, it is not as general as other methods, and the sampling overhead is exponential.
es_un: Muestras de cancelación probabilística de errores (probabilistic error cancellation, PEC) para una colección de circuitos que, en promedio, imita un canal inversor de ruido para cancelar el ruido en el cálculo deseado. Este proceso es un poco como funcionan los auriculares con cancelación de ruido y produce excelentes resultados; sin embargo, no es tan general como otros métodos, y la sobrecarga de muestreo es exponencial.
