Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/Error-Suppression-and-Error-Mitigation.po
Languages: es_un, ja

source: This page was generated from `docs/tutorials/Error-Suppression-and-Error-Mitigation.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/Error-Suppression-and-Error-Mitigation.ipynb`__.
ja: このページは `docs/tutorials/Error-Supression-and-Error-Mitigation.ipynb`__ から生成されました。

source: Error supression and error mitigation with Qiskit Runtime
ja: Qiskit Runtimeによるエラー抑制とエラー緩和

source: Introduction
es_un: Introducción
ja: はじめに

source: To illustrate the need for error suppression and mitigation, we will start by taking a look at some results without error suppression or error mitigation. First, we are going to use a noiseless simulator to get an idea of what ideal results look like. Next, we are going to run the same experiment in a real backend without using error suppression or error mitigation.
es_un: Para ilustrar la necesidad de supresión y mitigación de errores, comenzaremos analizando algunos resultados sin supresión o mitigación de errores. Primero, vamos a usar un simulador silencioso para tener una idea de cómo se ven los resultados ideales. A continuación, ejecutaremos el mismo experimento en un backend real sin utilizar la supresión o mitigación de errores.
ja: エラー抑制と緩和の必要性を説明するために、まず、エラー抑制やエラー緩和を行わない場合の結果をいくつか見てみます。まず、ノイズのないシミュレーターを使用して、理想的な結果がどのようなものであるかを把握することにします。次に、実機のバックエンドで、エラー抑制やエラー緩和を行わずに同じ実験を行います。

source: For the experiments, we are going to use a list of Trotter circuits defined below.
ja: 実験には、以下に定義するトロッター回路のリストを使用します。

source: Create a Trotter circuit
es_un: Crear un circuito Trotter
ja: トロッター回路の作成

source: Simulator run
es_un: Ejecución del simulador
ja: シミュレーターの実行

source: Unmitigated, real backend
es_un: No mitigado, backend real
ja: 緩和なし、実機のバックエンド

source: Theory and background
es_un: Teoría y antecedentes
ja: 理論と背景

source: We want to build a tool which, beginning in 2024, is capable of estimating *noise-free observables* of *100-qubit* circuits, with *depth 100*, within *one day*.
es_un: Queremos construir una herramienta que, a partir de 2024, sea capaz de estimar *observables sin ruido* de circuitos de *100 qubits*, con *profundidad de 100*, en *un día*.
ja: 2024 年から、 *深さ 100* の *100量子ビット* 回路の *ノイズのない観測量* を *1 日* 以内に推定できるツールを構築したいと考えています。

source: Although this is not a promise for quantum advantage *per-se*, the goal is to get to the point where we can solve interesting or relevant problems faster, more accurately, or more cheaply in a practical time frame as compared to efficient classical computations.
es_un: Aunque esto no es una promesa de ventaja cuántica *per-se*, el objetivo es llegar al punto en el que podamos resolver problemas interesantes o relevantes de forma más rápida, precisa o económica en un marco de tiempo práctico en comparación con los cálculos clásicos eficientes.
ja: これは、量子的な優位性 *そのもの* を約束するものではありませんが、目標は、興味深い問題や関連する問題を、効率的な古典計算と比較して、より速く、より正確に、あるいはより安く、実用的な時間枠で解決できるようになることです。

source: The threshold for simulability seems to be at around 100 qubits. However, this is not enough qubits, as we also need a sufficiently complex quantum circuit to ensure that it cannot be reproduced classically. For example, deep, non-clifford.
es_un: El umbral de simulabilidad parece estar en torno a los 100 qubits. Sin embargo, estos no son suficientes qubits, ya que también necesitamos un circuito cuántico lo suficientemente complejo para garantizar que no se pueda reproducir de forma clásica. Por ejemplo, profundo, no clifford.
ja: シミュレーションの可能性のしきい値は、100量子ビット程度と思われます。しかし、これだけでは十分ではなく、古典的な計算で再現できないような十分に複雑な量子回路が必要です。例えば、深い、非クリフォード演算です。

source: With errors per gate of order ``1E-3``, we estimate a final fidelity of such a computation of about ``1E-6``, which implies totally meaningless results.
es_un: Con errores por compuerta de orden ``1E-3``, estimamos una fidelidad final de tal cálculo de aproximadamente ``1E-6``, lo que implica resultados totalmente sin sentido.
ja: ゲートあたりの誤差が ``1E-3`` であることから、このような計算の最終的な忠実度は``1E-6`` 程度と推定され、全く意味のない結果を意味することになります。

source: Fault tolerant quantum computing
es_un: Computación cuántica tolerante a fallas
ja: フォールトトレラントな量子計算

source: Errors are a natural occurrence in any computer. In quantum computers, these errors are usually more complex and happen when the quantum states are not prepared exactly how they should. For example, overshooting their target values or drifting away. Furthermore, the disturbances that generate these issues are typically unavoidable.
es_un: Los errores son una ocurrencia natural en cualquier computadora. En las computadoras cuánticas, estos errores suelen ser más complejos y ocurren cuando los estados cuánticos no se preparan exactamente como deberían. Por ejemplo, sobrepasar sus valores objetivo o alejarse. Además, las perturbaciones que generan estos problemas suelen ser inevitables.
ja: どのようなコンピューターにもエラーはつきものです。量子コンピューターの場合、エラーはより複雑で、量子状態が正確に準備されていないときに発生します。例えば、目標値をオーバーシュートしたり、ドリフトしたりします。さらに、これらの問題を発生させる外からの乱れは、通常、避けられません。

source: There are several ways to handle these errors. The terminology can get confusing, as there is disagreement even within the field. We will break it into three core pieces:
es_un: Hay varias formas de manejar estos errores. La terminología puede resultar confusa, ya que existe desacuerdo incluso dentro del campo. Lo dividiremos en tres partes principales:
ja: これらのエラーを処理する方法はいくつかあります。この分野でも意見が分かれているため、用語が混乱することがありますが、ここでは、そのコアとなる3つの部分に分けて説明します。

source: Supression
ja: 抑制

source: Mitigation
es_un: Mitigación
ja: 緩和

source: Correction
es_un: Corrección
ja: 訂正

source: Let’s start with the error correction, since it was the first one to be formally discovered within the field.
ja: まず、この分野で最初に正式に発見されたエラー訂正から始めましょう。

source: Error correction
es_un: Corrección de errores
ja: エラー訂正

source: Error correction in classical computers is the standard procedure of encoding information in redundant ways to make it resilient to unwanted noise —allowing us to detect and correct errors as they occur.
es_un: La corrección de errores en las computadoras clásicas es el procedimiento estándar de codificación de información de manera redundante para hacerla resistente al ruido no deseado, lo que nos permite detectar y corregir errores a medida que ocurren.
ja: 古典コンピューターにおけるエラー訂正は、情報を冗長な方法で符号化し、不要なノイズに耐えられるようにすることで、発生したエラーを検出し訂正する標準的な手順です。

source: It has being known for a long time that the coupling of quantum systems to their environment sets a limit for any quantum computation, both in time and size. Nonetheless, theoretical discoveries in the form of *Quantum error correction* solved this issue early on.
es_un: Se sabe desde hace mucho tiempo que el acoplamiento de los sistemas cuánticos a su entorno marca un límite para cualquier computación cuántica, tanto en tiempo como en tamaño. No obstante, los descubrimientos teóricos en forma de *Corrección de errores cuánticos* resolvieron este problema desde el principio.
ja: 量子力学の計算では、量子力学系が環境と結合することで、時間的にも規模的にも限界があることは以前から知られていました。しかし、 *量子エラー訂正* の理論的発見により、この問題は早くから解決されていました。

source: THRESHOLD THEOREM
es_un: TEOREMA DEL UMBRAL
ja: しきい値定理

source: If errors in quantum computers can be reduced below certain (finite) level, a fault-tolerant quantum computation could be carried out arbitrarily long even in noisy hardware.
es_un: Si los errores en las computadoras cuánticas pueden reducirse por debajo de cierto nivel (finito), un cálculo cuántico tolerante a fallas podría llevarse a cabo durante un tiempo arbitrario incluso en hardware ruidoso.
ja: 量子コンピューターのエラーを一定 (有限) レベル以下に抑えることができれば、ノイズの多いハードウェアであっても、フォールト・トレラントな量子計算を任意の時間で実行できます。

source: **Reference**: M.A. Nielsen, and I.L. Chuang, *Quantum Computation and Quantum Information*.
ja: **参考**: M.A. Nielsen, and I.L. Chuang, *Quantum Computation and Quantum Information*.

source: This is how we hope to achieve the ultimate goal of *fault-tolerant* quantum computation. However, even if we build hardware that can achieve the prescribed threshold, the overhead for performing full error correction, such as the necessary qubit count, makes it infeasible in the short term; as we will try to encode single qubit logical values across multiple physical qubits:
es_un: Así es como esperamos lograr el objetivo final de la computación cuántica *tolerante a fallas*. Sin embargo, incluso si construimos hardware que pueda alcanzar el umbral prescrito, la sobrecarga para realizar la corrección de errores completa, como el recuento de qubits necesario, lo hace inviable a corto plazo; como intentaremos codificar valores lógicos de un solo qubit en múltiples qubits físicos:
ja: これが、 *フォールト・トレラント* な量子計算の究極の目標を達成する方法です。ただし、規定のしきい値を達成できるハードウェアを構築できたとしても、必要な量子ビット数といったような、完全なエラー訂正を実行するためのオーバーヘッドにより、短期的には実行不可能になります。そのため、複数の物理量子ビットをまたいで、単一量子ビットの論理値をエンコードしようとしています。

source: Physical qubits
es_un: Qubits físicos
ja: 物理量子ビット

source: Distance
es_un: Distancia
ja: 距離

source: These *surface code resources*\ \* are well beyond our 2025 roadmap plans, although we are working hard in this area to make it feasible as soon as possible.
es_un: Estos *recursos de código de superficie*\ \* están mucho más allá de nuestros planes para 2025, aunque estamos trabajando arduamente en esta área para que sea factible lo antes posible.
ja: これらの *表面的なコード リソース*\ \* は、2025 年のロードマップ計画をはるかに超えていますが、できるだけ早く実現できるようにこの分野で懸命に取り組んでいます。

source: \* The data in the above table is based on simulations for surface codes with certain conditions. The code distance was chosen so that none of the T-gates, or 100 logical qubits at the end of runtime, had error greater than :math:`1\text{E}-2`. The number of T-gates is :math:`n \times d` and each parity check cycle takes :math:`1 \mu s`.
ja: \* 上記の表のデータは、特定の条件下におけるサーフェス・コードのシミュレーションに基づいています。コードの距離はT ゲートなし、あるいはランタイムの最後に100個の論理量子ビットで :math:`1\text{E}-2` より大きな誤差を持たないように選択されています。T ゲートの数は :math:`n \times d` で、各パリティ・チェック・サイクルには :math:`1 \mu s` の時間がかかります。

source: **Reference**: Daniel Litinski, *A Game of Surface Codes: Large-Scale Quantum Computing with Lattice Surgery*, `arXiv:1808.02892 <https://arxiv.org/abs/1808.02892>`__
es_un: **Referencia**: Daniel Litinski, *A Game of Surface Codes: Large-Scale Quantum Computing with Lattice Surgery*, `arXiv:1808.02892 <https://arxiv.org/abs/1808.02892>`__
ja: **参考文献**: Daniel Litinski, *A Game of Surface Codes: Large-Scale Quantum Computing with Lattice Surgery*, `arXiv:1808.02892 <https://arxiv.org/abs/1808.02892>`__

source: Error suppression
es_un: Supresión de errores
ja: エラー抑止

source: Error suppression is the most basic level of error handling. It often refers to a set of techniques performed close to hardware, such as altering control signals (i.e. Qiskit Pulse level). To make it simpler, we define these techniques as introducing *classical overhead*, usually within the transpilation/compilation process.
ja: エラー抑制は、エラー処理の最も基本的なレベルのものです。多くの場合、制御信号 (たとえば、Qiskit Pulse レベル) の変更など、ハードウェアの近くで実行される一連の手法を指します。簡単にするために、これらの手法を *従来のオーバーヘッド* を導入するものとして定義します。これは通常、トランスパイル/コンパイル・プロセス内で行われます。

source: These techniques are very old and were first developed outside of the field at the same time as some of the first controllable quantum systems such as magnetic resonance imaging devices.
es_un: Estas técnicas son muy antiguas y se desarrollaron por primera vez fuera del campo al mismo tiempo que algunos de los primeros sistemas cuánticos controlables, como los dispositivos de imágenes por resonancia magnética.
ja: これらの技術は非常に古く、磁気共鳴画像装置などの最初の制御可能な量子系の一部と同時期に初めて開発されました。

source: Dynamical decoupling (DD)
es_un: Desacoplamiento dinámico (Dynamical Decoupling, DD)
ja: 動的デカップリング (Dynamical decoupling, DD)

source: Quantum computers have adopted some of these techniques like spin echos (a sequence of pulses that can help refocus the state of a qubit). As a matter of fact, spin echos play a big role in a class of techniques known as *Dynamical Decoupling* (DD), which sends pulses to idle qubits in order to reset their value to their original states, undoing the potentially harmful effects of nearby qubits that are being used for the calculation.
ja: 量子コンピューターは、スピン・エコー (量子ビットの状態を再収束するのに役立つ一連のパルス) などの手法の一部を採用しています。実際、スピン・エコーは *動的デカップリング* (Dynamical Decoupling, DD) として知られるクラスの手法として大きな役割を果たします。DDはアイドル状態の量子ビットにパルスを送信することで値を元の状態にリセットし、計算に使用されている付近の量子ビットの潜在的かつ有害な影響を元に戻します。

source: **Reference**: Lorenza Viola, and Seth Lloyd , *Dynamical suppression of decoherence in two-state quantum systems*, `arXiv:quant-ph/9803057 <https://arxiv.org/abs/quant-ph/9803057>`__
es_un: **Referencia**: Lorenza Viola, and Seth Lloyd , *Dynamical suppression of decoherence in two-state quantum systems*, `arXiv:quant-ph/9803057 <https://arxiv.org/abs/quant-ph/9803057>`__
ja: **参考文献**: Lorenza Viola, and Seth Lloyd , *Dynamical suppression of decoherence in two-state quantum systems*, `arXiv:quant-ph/9803057 <https://arxiv.org/abs/quant-ph/9803057>`__

source: Error mitigation
es_un: Mitigación de errores
ja: 誤り軽減

source: Error mitigation introduces *quantum overhead* to our calculations.
es_un: La mitigación de errores introduce *sobrecarga cuántica* en nuestros cálculos.
ja: エラー軽減では、計算に *量子オーバーヘッド* が導入されます。

source: Typically, error correction uses the outputs of multiple ensembles of noisy calculations to reduce or eliminate the noise in estimating quantities like expectation values — commonly by using classical post-processing. In this regard, error mitigation is different from error correction. Instead of fixing errors in every circuit run, errors are allowed to occur, then better results are inferred from several of these noisy calculations.
ja: 通常、誤り訂正では、ノイズの多い計算の複数のアンサンブルの出力を使用して、期待値などの量を推定する際のノイズを削減または除去します。通常は、従来の後処理を使用します。 この点で、エラーの軽減はエラーの修正とは異なります。 回路を実行するたびにエラーを修正する代わりに、エラーが発生することを許可し、これらのノイズの多い計算のいくつかからより良い結果を推測します。

source: Since there is no threshold that one must surpass before QEM becomes practical, we see error mitigation as the key to realizing useful quantum computers in the near term.
ja: QEM が実用化される前に超えなければならないしきい値はないため、短期的に有用な量子コンピューターを実現するための鍵として、エラーの軽減が考えられます。

source: We are developing a portfolio of different error mitigation techniques, looking for three main things:
es_un: Estamos desarrollando una cartera de diferentes técnicas de mitigación de errores, buscando tres cosas principales:
ja: さまざまなエラー軽減手法のポートフォリオを開発しており、主に次の 3 つを探しています。

source: Small overhead (*speed*)
es_un: Poca sobrecarga (*rapidez*)
ja: 小さなオーバーヘッド ( *スピード* )

source: Improved accuracy (*quality*)
es_un: Precisión mejorada (*calidad*)
ja: 精度の向上 ( *品質* )

source: Few assumptions (*scale*)
es_un: Pocas suposiciones (*escala*)
ja: いくつかの仮定( *スケール* )

source: Each method come with their own associated overhead: a trade-off between the number of quantum computations needed (time) and the accuracy of our results. The level of accuracy that can be achieved is also specific to each method, and is usually inversely proportional to the previously mentioned overhead. Defining :math:`\lambda` as the base noise in our computation:
es_un: Cada método viene con su propia sobrecarga asociada: una compensación entre la cantidad de cálculos cuánticos necesarios (tiempo) y la precisión de nuestros resultados. El nivel de precisión que se puede lograr también es específico de cada método y, por lo general, es inversamente proporcional a la sobrecarga mencionada anteriormente. Definiendo :math:`\lambda` como el ruido base en nuestro cálculo:
ja: 各方法には、関連する独自のオーバーヘッドが伴います。必要な量子計算の数 (時間) と結果の精度との間のトレードオフです。 達成できる精度のレベルも各方法に固有であり、通常は前述のオーバーヘッドに反比例します。 :math:`\lambda` を計算のベース・ノイズとして定義します。

source: Methods
es_un: Métodos
ja: 獲得方法

source: Assumptions
es_un: Suposiciones
ja: 仮定

source: None
es_un: Ninguna
ja: 無し

source: Ability to scale the noise
es_un: Capacidad para escalar el ruido
ja: ノイズを拡大する能力

source: Full knowledge of the noise
es_un: Pleno conocimiento del ruido
ja: ノイズに関する完全な知識

source: Qubit overhead
es_un: Sobrecarga de qubit
ja: 量子ビットのオーバーヘッド

source: Sampling overhead
es_un: Sobrecarga de muestreo
ja: サンプリング・オーバーヘッド

source: Bias
es_un: Sesgo
ja: バイアス

source: More detailed information is available at:
es_un: Información más detallada está disponible en:
ja: より詳細な情報はこちら:

source: By having a portfolio of methods, users can choose which technique makes the most sense for their problem of interest, based on accuracy demands and how much overhead they are willing to accept. We are excited about this because, in the best scenarios, we can achieve unbiased results (that is, noise-free); and we want to make this capability accessible all across the stack: from kernel to algorithm and model developers.
es_un: Al tener una cartera de métodos, los usuarios pueden elegir qué técnica tiene más sentido para su problema de interés, en función de las demandas de precisión y la cantidad de sobrecarga que están dispuestos a aceptar. Estamos entusiasmados con esto porque, en los mejores escenarios, podemos lograr resultados sin sesgo (es decir, sin ruido); y queremos que esta capacidad sea accesible en toda la pila: desde el kernel hasta los algoritmos y desarrolladores de modelos.
ja: メソッドのポートフォリオを用意することで、ユーザーは、精度の要求と許容できるオーバーヘッドに基づいて、関心のある問題に最も適した手法を選択できます。 最良のシナリオでは、偏りのない (つまり、ノイズのない) 結果を達成できるため、私たちはこれに興奮しています。 そして、カーネルからアルゴリズムやモデルの開発者まで、スタック全体でこの機能にアクセスできるようにしたいと考えています。

source: Why is error mitigation important?
es_un: ¿Por qué es importante la mitigación de errores?
ja: エラー軽減はなぜ重要なのか？

source: We need improvements in *scale*, *quality*, and *speed*.
es_un: Necesitamos mejoras en *escala*, *calidad* y *rapidez*.
ja: *スケール* 、 *品質* 、 *スピード* の改善が必要です。

source: The promise of error mitigation is to translate the continuous progress in quantum hardware into continuous improvements in quantum computations and quantum information processing. We expect that, while insufficient to fully overcome imperfections, every advancement should incrementally push the frontier of what can be achieved practically; as opposed to a scenario where little to no progress is made until we suddenly overcome the fault-tolerant threshold.
es_un: La promesa de la mitigación de errores es traducir el progreso continuo del hardware cuántico en mejoras continuas en los cálculos cuánticos y el procesamiento de la información cuántica. Esperamos que, si bien es insuficiente para superar por completo las imperfecciones, cada avance debe ampliar gradualmente la frontera de lo que se puede lograr en la práctica; a diferencia de un escenario en el que se hace poco o ningún progreso hasta que de repente superamos el umbral tolerante a fallas.
ja: エラー軽減の約束は、量子ハードウェアの継続的な進歩を、量子計算と量子情報処理の継続的な改善に変換することです。 不完全さを完全に克服するには不十分ですが、すべての進歩は、実際に達成できるもののフロンティアを徐々に押し進めるべきであると期待しています。 フォールト・トレラントのしきい値を突然超えるまで、ほとんどまたはまったく進歩しないシナリオとは対照的です。

source: |0f0d6ea11c0649c09a1c14817fe09f45|
ja: |0f0d6ea11c0649c09a1c14817fe09f09f45|

source: Beyond the 100x100 circuit, we envision a future where error correction and error mitigation can work in a hybrid way. In that regard, this approach has proven to be both practically effective and intellectually challenging.
es_un: Más allá del circuito 100x100, visualizamos un futuro en el que la corrección y la mitigación de errores pueden funcionar de manera híbrida. En ese sentido, este enfoque ha demostrado ser efectivo en la práctica e intelectualmente desafiante.
ja: 100x100 回路を超えて、エラー修正とエラー軽減がハイブリッドな方法で機能する未来を想定しています。 その点で、このアプローチは実際に効果的であると同時に知的に挑戦的であることが証明されています。

source: Concepts
es_un: Conceptos
ja: コンセプト

source: The following terms are used in this section.
es_un: Los siguientes términos se utilizan en esta sección.
ja: このセクションでは、以下の用語を使用します。

source: TERMINOLOGY
es_un: TERMINOLOGÍA
ja: 用語

source: As with every nascent field, terminology is sometimes incosistent: people use the same terms to refer to (slightly) different things.
es_un: Al igual que con todos los campos emergentes, la terminología a veces es inconsistente: las personas usan los mismos términos para referirse a cosas (ligeramente) diferentes.
ja: すべての新生分野と同様に、用語には一貫性がない場合があります。人々は同じ用語を使用して (わずかに) 異なるものを指します。

source: Estimators: Strategies for approximating certain physical values that are fundamentally unknown.
es_un: Estimadores (Estimators): Estrategias para aproximar ciertos valores físicos que son fundamentalmente desconocidos.
ja: 推定値: 基本的に未知の特定の物理値を概算するための戦略です。

source: Sampling: The process of taking several measurements of one or several things.
es_un: Muestreo (Sampling): El proceso de tomar varias medidas de una o varias cosas.
ja: サンプリング: 1 つまたは複数のものについて複数の測定を行うプロセスです。

source: Overhead: Extra costs introduced by new techniques, relative to a base implementation.
es_un: Sobrecarga (Overhead): Costos adicionales introducidos por nuevas técnicas, en relación con una implementación base.
ja: オーバーヘッド: 基本的な実装と比較して、新しい手法によって導入される追加のコストです。

source: Bias: A systematic drift in the measured quantities, usually caused by errors.
es_un: Sesgo (Bias): Una desviación sistemática en las cantidades medidas, generalmente causada por errores.
ja: バイアス: 測定された量の体系的なドリフトで、通常はエラーによって引き起こされます。

source: Shot/sample noise: Uncertainty in the obtained results due to a lack of infinite precision (that is, a finite number of samples).
es_un: Ruido de iteración/muestra (Shot/sample noise): Incertidumbre en los resultados obtenidos debido a la falta de precisión infinita (es decir, un número finito de muestras).
ja: ショット/サンプル ノイズ: 無限の精度の欠如 (つまり、有限数のサンプル) による、得られた結果の不確実性です。

source: Implications
es_un: Implicaciones
ja: 含意

source: When implementing any error mitigation technique, we expect the *bias* in our results to be reduced with respect to the previous, unmitigated, bias; in some cases even disappearing. However, this comes at a cost. As we reduce the bias in our estimated quantities, the statistical variability will increase (that is, *variance*), which we can account for by further increasing the number of shots per circuit in our sampling process. This will introduce overhead beyond that needed to reduce the bias, therefore it is not done by default. The user can easily opt in to this behavior by adjusting the amount of ``shots`` per circuit in ``run_options``.
es_un: Al implementar cualquier técnica de mitigación de errores, esperamos que el *sesgo* en nuestros resultados se reduzca con respecto al sesgo anterior, no mitigado; en algunos casos incluso desapareciendo. Sin embargo, esto tiene un costo. A medida que reducimos el sesgo en nuestras cantidades estimadas, la variabilidad estadística aumentará (es decir, la *varianza*), lo que podemos explicar aumentando aún más el número de iteraciones por circuito en nuestro proceso de muestreo. Esto introducirá una sobrecarga más allá de la necesaria para reducir el sesgo, por lo que no se realiza de forma predeterminada. El usuario puede optar fácilmente por este comportamiento ajustando la cantidad de ``shots`` por circuito en ``run_options``.
ja: エラー軽減手法を実装する場合、結果の *バイアス* は、以前の軽減されていないバイアスに対して減少することが期待されます。 場合によっては消えることさえあります。 ただし、これには代償が伴います。 推定量の偏りを減らすと、統計的変動性 (つまり、 *分散*) が増加します。これは、サンプリング・プロセスで回路あたりのショット数をさらに増やすことで説明できます。 これにより、バイアスを減らすために必要な以上のオーバーヘッドが発生するため、デフォルトでは行われません。 ユーザーは ``run_options`` で回路ごとの ``shots`` の量を調整することで、この動作を簡単にオプトインできます。

source: In mathematical terms, we expect our error mitigated estimator to be such that:
es_un: En términos matemáticos, esperamos que nuestro estimador de error mitigado sea tal que:
ja: 数学的に言えば、エラー軽減推定量は次のようになると予想されます。

source: Twirled readout error extinction
es_un: Extinción de error de lectura torcida (twirled)
ja: トワイル読み出しエラー消去法
