Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/grover_with_sampler.po
Languages: es_un, fr, ja

source: This page was generated from `docs/tutorials/grover_with_sampler.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/grover_with_sampler.ipynb`__.
fr: Cette page a été générée à partir de ` docs/tutorials/grover_with_sampler.ipynb ` __.
ja: このページは `docs/tutorials/grover_with_sampler.ipynb`__ から生成されました。

source: Database search with Grover’s using Sampler
es_un: Búsqueda en base de datos con Grover usando Sampler
ja: GroverのSamplerを使用したデータベース検索

source: In this tutorial, you will solve a small database search problem using Grover’s algorithm with the Sampler primitive Qiskit Runtime program.
es_un: En este tutorial, resolverás un pequeño problema de búsqueda en una base de datos utilizando el algoritmo de Grover con la primitiva Sampler de Qiskit Runtime.
ja: このチュートリアルでは、 Sampler primitive Qiskit Runtime プログラムと、グローバーのアルゴリズムを使用して、小さなデータベース検索の問題を解決します。

source: Before you begin
es_un: Antes de comenzar
ja: 始める前に

source: This tutorial requires a Qiskit Runtime service instance. If you haven’t done so already, please follow the `Getting Started Guide <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ to set one up.
es_un: Este tutorial requiere una instancia del servicio Qiskit Runtime. Si aún no lo has hecho, por favor sigue la `Guía de Primeros Pasos <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ para configurar uno.
ja: このチュートリアルでは、Qiskit Runtime サービス・インスタンスが必要です。まだ実行していない場合は、`入門ガイド <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ に従ってセットアップします。

source: Background information
es_un: Información de antecedentes
ja: 背景情報

source: Unstructured search problem
es_un: Problema de búsqueda no estructurada
ja: 非構造化探索の問題

source: In the olden days, you looked up a person’s phone number in a phone book. That is an easy task if you know the person’s name because a phone book is ordered alphabetically by name. However, the opposite task, that is, you are given a phone number and want to find out who it belongs to, is much more difficult. That is because a phone book is not ordered by phone numbers. This is an example of an unstructured search problem. To solve this problem with a classical computer, your best trick is to randomly pick an entry. On average, you will need to look up half of the entries (:math:`N/2`, if :math:`N` is the total number of entries) to find the owner. If you have a quantum computer, however, you can use Grover’s algorithm to find the owner in :math:`\sqrt N` tries. That means to identify the owner in a phone book that has 1 million numbers, you only need to do 1000 tries instead of 500,000!
es_un: En los viejos tiempos, buscabas el número de teléfono de una persona en una guía telefónica. Esa es una tarea fácil si sabes el nombre de la persona porque una guía telefónica está ordenada alfabéticamente por nombre. Sin embargo, la tarea contraria, es decir, te dan un número de teléfono y quieres saber a quién pertenece, es mucho más difícil. Esto se debe a que una guía telefónica no está ordenada por números de teléfono. Este es un ejemplo de un problema de búsqueda no estructurada. Para resolver este problema con una computadora clásica, tu mejor truco es elegir una entrada al azar. En promedio, necesitará buscar la mitad de las entradas (:math:`N/2`, si :math:`N` es el número total de entradas) para encontrar al propietario. Sin embargo, si tienes una computadora cuántica, puedes usar el algoritmo de Grover para encontrar al propietario en :math:`\sqrt N` intentos. Eso significa que para identificar al propietario en una guía telefónica que tiene 1 millón de números, ¡solo necesita hacer 1000 intentos en lugar de 500,000!
ja: 昔、あなたは電話帳で人の電話番号を調べていました。 電話帳は名前のアルファベット順に並べられているので、その人の名前を知っていれば、これは簡単な作業です。 ただし、反対のタスク、つまり、電話番号が与えられ、それが誰に属しているかを知りたい場合は、はるかに困難です。 そのため、電話帳は電話番号順には並んでいません。 これは、非構造化探索の問題の例です。 従来のコンピューターでこの問題を解決するには、エントリーをランダムに選択するのが最善の方法です。 平均して、電話番号の持ち主を見つけるには、全体の半分 (:math:`N` がエントリーの総数の場合 :math:`N/2` ) を調べる必要があります。 ただし、量子コンピューターを使用している場合は、グローバーのアルゴリズムを使用して、 :math:`\sqrt N` 回の試行で持ち主を見つけることができます。 つまり、100万件の番号がある電話帳で所有者を特定するには、500,000回ではなく1000回の試行を行うだけで済みます。

source: Grover’s algorithm
es_un: Algoritmo de Grover
ja: グローバーのアルゴリズム

source: In a nutshell, Grover’s algorithm uses a nice quantum trick called amplitude amplification to dramatically increase the chances of finding the correct answer - the owner of a phone number - in each try (iteration). That’s all you need to know now. You don’t have to understand the details about how Grover’s algorithm works to apply it, because Qiskit does it for you! However, if you are interested, you can read the chapter about Grover’s algorithm in `the Qiskit textbook <https://qiskit.org/textbook/ch-algorithms/grover.html>`__.
es_un: En pocas palabras, el algoritmo de Grover utiliza un buen truco cuántico llamado amplificación de amplitud para aumentar drásticamente las posibilidades de encontrar la respuesta correcta, el propietario de un número de teléfono, en cada intento (iteración). Eso es todo lo que necesitas saber ahora. No tienes que entender los detalles sobre cómo funciona el algoritmo de Grover para aplicarlo, ¡porque Qiskit lo hace por ti! Sin embargo, si estás interesado, puedes leer el capítulo sobre el algoritmo de Grover en `el libro de texto de Qiskit <https://qiskit.org/textbook/ch-algorithms/grover.html>`__.
ja: 一言で言えば、グローバーのアルゴリズムは、振幅増幅と呼ばれる優れた量子トリックを使用して、各試行 (反復) で正しい答え (電話番号の所有者) を見つける可能性を劇的に高めます。 今知っておく必要があるのはそれだけです。 Qiskitがやってくれるので、グローバーのアルゴリズムの仕組みについて詳細を理解する必要はありません！ ただし、興味がある場合は、 `Qiskit textbook <https://qiskit.org/textbook/ch-algorithms/grover.html>`__ でグローバーのアルゴリズムに関する章を読むことができます。

source: Next, let’s look at a concrete example.
es_un: A continuación, veamos un ejemplo concreto.
ja: 次に、具体的な例を見てみましょう。

source: Overview
es_un: Descripción General
ja: 概要

source: In this tutorial, you are going to look for the owner of a small phone book using Grover’s algorithm following these steps:
es_un: En este tutorial, buscarás al propietario de una pequeña guía telefónica utilizando el algoritmo de Grover siguiendo estos pasos:
ja: このチュートリアルでは、以下の手順に従って、Groverのアルゴリズムを使用して小さな電話帳の所有者を探します。

source: Create Grover’s circuit for the phone book search problem.
es_un: Crea el circuito de Grover para el problema de búsqueda en la guía telefónica.
ja: 電話帳検索の問題のためにGroverの回路を作成します。

source: Submit the circuits to a quantum computer on the cloud using Qiskit Runtime service and the Sampler primitive program.
es_un: Envía los circuitos a una computadora cuántica en la nube utilizando el servicio Qiskit Runtime y el programa primitivo Sampler.
ja: Qiskit Runtime サービスと Sampler プリミティブ・プログラムを使用して、クラウド上の量子コンピュータに回路を送信します。

source: Analyze the results and identify the owner of the phone number.
es_un: Analiza los resultados e identifica al propietario del número de teléfono.
ja: 結果を分析し、電話番号の所有者を特定します。

source: Step 1: Create Grover’s circuit
es_un: Paso 1: Crear el circuito de Grover
ja: グローバーの回路の作成

source: Define an unstructured search problem in Qiskit
es_un: Definir un problema de búsqueda no estructurada en Qiskit
ja: Qiskit で非構造化探索の問題を定義します

source: In this simple example, you are given a small phone book that has 8 entries, person 0 to person 7, and you want to find the owner of a certain phone number. However, you are not allowed to look at the phone book directly. You are only allowed to consult an ‘oracle’: a black-box circuit that immediately tells you if your guess is right or wrong (like the Oracle in “The Matrix”).
es_un: En este ejemplo simple, se te entrega una pequeña guía telefónica que tiene 8 entradas, de la persona 0 a la persona 7, y quieres encontrar al propietario de un determinado número de teléfono. Sin embargo, no se te permite mirar la guía telefónica directamente. Solo se te permite consultar un ‘oráculo’: un circuito de caja negra que te dice inmediatamente si nuestra conjetura es correcta o incorrecta (como el Oráculo en “The Matrix”).
ja: この簡単な例では、 人物0 から人物7 までの8 つの項目を持つ小さな電話帳が与えられ、特定の電話番号の所有者を見つけたいと考えています。 しかし、直接電話帳を見ることは許されていません。 私たちは 「オラクル」 に相談することしか許されていません。 オラクルは、私たちの推測が正しいか間違っているか ( 「行列」のオラクルのように) すぐにわかるブラック・ボックス回路です。

source: Once you have the oracle, you can define the unstructured search problem using the ``AmplificationProblem`` class in Qiskit.
es_un: Una vez que tienes el oráculo, puedes definir el problema de búsqueda no estructurada usando la clase ``AmplificationProblem`` en Qiskit.
ja: 一度オラクルを手にしてしまえば、 Qiskitの ``AmplificationProblem`` クラスを使用して非構造化探索の問題を定義できます。

source: Construct Grover’s circuit for the problem
es_un: Construir el circuito de Grover para el problema
ja: 問題に対するグローバーの回路を構成する

source: Now you are ready to construct the quantum circuits for Grover’s algorithm for this problem. Grover’s algorithm’s accuracy in finding the correct answer increases with the number of iterations. Let’s create two circuits with one and two iterations each to see this effect.
es_un: Ahora estás listo para construir los circuitos cuánticos para el algoritmo de Grover para este problema. La precisión del algoritmo de Grover para encontrar la respuesta correcta aumenta con el número de iteraciones. Vamos a crear dos circuitos con una y dos iteraciones en cada uno, para ver este efecto.
ja: これで、この問題に対するグローバーのアルゴリズムの量子回路を構築する準備が整いました。 正しい答えを見つける際のグローバーのアルゴリズムの精度は、反復回数とともに増加します。 この効果を確認するために、1回と2回の反復で回路を作成してみましょう。

source: Let’s look at the circuits:
es_un: Veamos los circuitos:
ja: 回路を見ていきましょう。

source: Step 2: Submit the circuits to a quantum computer on the cloud
es_un: Paso 2: Enviar los circuitos a una computadora cuántica en la nube
ja: ステップ2: 回路をクラウド上の量子コンピューターに送信する

source: Now that the Grover’s circuits are created, let’s submit them to a quantum computer on the cloud by using the Sampler program.
es_un: Ahora que se crearon los circuitos de Grover, enviémoslos a una computadora cuántica en la nube usando el programa Sampler.
ja: これで、グローバーの回路が作成され、Sampler プログラムを使用してクラウド上の量子コンピュータに送信できるようになりました。

source: Connect to the Qiskit Runtime service
es_un: Conectarse al servicio Qiskit Runtime
ja: Qiskit Runtime サービスに接続する

source: First, connect to the Qiskit Runtime service instance that you created in `the first step <#Set-up-your-local-development-environment>`__.
es_un: Primero, conéctate a la instancia del servicio Qiskit Runtime que creaste en `el primer paso <#Set-up-your-local-development-environment>`__.
ja: まず、 `最初のステップ <#Set-up-your-local-development-environment>`__ で作成した Qiskit Runtime サービス・インスタンスに接続します。

source: Grover’s algorithm determines the correct answer based on the highest probability of measurement outcomes. The ``Sampler`` primitive program is perfect for getting probabilities, so you will use that. In the cell below, you create an instance of the ``Sampler`` program, and start a Runtime session using the context manager (``with ...:``), which automatically opens and closes the session for you.
es_un: El algoritmo de Grover determina la respuesta correcta en función de la mayor probabilidad de resultados de medición. El programa primitivo ``Sampler`` es perfecto para obtener probabilidades, así que lo usarás. En la celda de abajo, crea una instancia del programa ``Sampler`` e iniciamos una sesión de Runtime usando el administrador de contexto (``with ...:``), que automáticamente abre y cierra la sesión por ti.
ja: グローバーのアルゴリズムは、測定結果のうち最も高い確率に基づいて正しい答えを決定します。 ``Sampler`` primitive プログラムは、確率を求めるのに最適なので、これを使うことにします。以下のセルでは、 ``Sampler`` プログラムのインスタンスを作成し、コンテキスト・マネージャーを使用してRuntimeセッションを開始します ( ``with ...:`` )。これは、セッションを自動的に開いたり閉じたりします。

source: The ``Sampler`` program allows a batch submission of circuits in a job. Here you are passing a list of two circuits (Grover with 1 iteration and 2 iterations) to the Sampler but only one call is needed to sample the probability of measurement outcomes of both circuits.
es_un: El programa ``Sampler`` permite el envío por lotes de circuitos en un trabajo (job). Aquí estás pasando una lista de dos circuitos (Grover con 1 iteración y con 2 iteraciones) al Sampler, pero solo se necesita una llamada para muestrear la probabilidad de los resultados de medición de ambos circuitos.
ja: ``Sampler`` プログラムでは、ジョブ内の回路のバッチ送信が可能です。 ここでは、2つの回路(1回の反復と2回の反復を持つグローバー)のリストを Sampler に渡しますが、両方の回路の測定結果の確率をサンプリングするには、1回の呼び出ししか必要ありません。

source: Step 3: Analyze the results
es_un: Paso 3: Analizar los resultados
ja: ステップ 3: 結果の分析

source: Let’s look at the results:
es_un: Veamos los resultados:
ja: 結果を見てみよう。

source: Let’s print out the quantum result, along with the secret string, to check the quantum computer found the correct answer.
es_un: Imprimamos el resultado cuántico, junto con la cadena secreta, para verificar que la computadora cuántica encontró la respuesta correcta.
ja: 量子の結果を秘密の文字列とともに印字して、量子コンピューターが正しい答えを見つけたことを確認しましょう。

source: Congratulations! You have successfully found the owner of the phone number.
es_un: ¡Felicidades! Has encontrado con éxito al propietario del número de teléfono.
ja: おめでとうございます！電話番号の所有者が見つかりました。

source: You can re-run the tutorial a few times to generate other random secret strings to check that we are not cheating! The quantum computer will find the correct answer every time.
es_un: ¡Puedes volver a ejecutar el tutorial varias veces para generar otras cadenas secretas aleatorias para comprobar que no estamos haciendo trampa! La computadora cuántica siempre encontrará la respuesta correcta.
ja: チュートリアルを数回再実行すると、他のランダムな秘密の文字列を生成して、私たちが不正をしていないことを確認することができます。 量子コンピュータは毎回正しい答えを見つけるでしょう。

source: Summary
es_un: Resumen
ja: 概要

source: In this tutorial, you have solved a small database search problem using a quantum computer. You have constructed Grover’s circuits by defining a phone book search problem using the ``AmplificationProblem`` class in Qiskit and then submitted the circuits to run using the Sampler primitive program via Qiskit Runtime service.
es_un: En este tutorial, has resuelto un pequeño problema de búsqueda en una base de datos usando una computadora cuántica. Has construido los circuitos de Grover definiendo un problema de búsqueda en la guía telefónica usando la clase ``AmplificationProblem`` en Qiskit y luego enviaste los circuitos para que se ejecuten usando el programa primitivo Sampler a través del servicio Qiskit Runtime.
ja: このチュートリアルでは、量子コンピューターを使用して小さなデータベース検索の問題を解決しました。 Qiskit の ``AmplificationProblem`` クラスを使用して電話帳検索の問題を定義し、Qiskit Runtime サービスを介してSamper primitive プログラムを使用して実行する回路を提出しました。

source: References
es_un: Referencias
ja: 参考文献

source: Qiskit versions and copyright
es_un: Versiones de Qiskit y derechos de autor
ja: Qiskit のバージョンと著作権

source: Grover's algorithm using the Sampler primitive
fr: Algorithme de Grover utilisant la primitive Sampler

source: Background
fr: Contexte

source: Amplitude amplification is a general purpose quantum algorithm, or subroutine, that can be used to obtain a quadratic speedup over a handful of classical algorithms. `Grover’s algorithm <https://arxiv.org/abs/quant-ph/9605043>`__ was the first to demonstrate this speedup on unstructured search problems. Formulating a Grover's search problem requires an oracle function that marks one or more computational basis states as the states we are interested in finding, and an amplification circuit that increases the amplitude of marked states, consequently suppressing the remaining states.
fr: Amplification d'amplitude est un algorithme quantique à usage général qui peut être utilisé pour obtenir une accélération quadratique sur certains algorithmes classiques. L'algorithme de Grover <https://arxiv.org/abs/quant-ph/9605043>` __ a été le premier à démontrer cette accélération sur des problèmes de recherche non structurés. La formulation d'un problème de recherche de Grover nécessite une fonction oracle qui marque un ou plusieurs états comme les états que nous recherchons, et un circuit d'amplification qui augmente l'amplitude des états marqués, en supprimant par conséquent les états restants.

source: Here we demonstrate how to construct Grover oracles and make use of the ``GroverOperator`` from the Qiskit circuit library to easily setup a Grover's search instance. The runtime ``Sampler`` primitive allows for seamless execution of Grover circuits, including automatic compilation, error suppression, and readout error mitigation techniques.
fr: Ici nous montrons comment construire des oracles de Grover et utiliser le ``GroverOperator`` de la bibliothèque de circuits Qiskit pour configurer facilement une recherche Grover. La primitive d'exécution ``Sampler`` permet l'exécution transparente des circuits Grover, y compris la compilation automatique, la suppression des erreurs et les techniques d'atténuation des erreurs de mesures.

source: Setup
fr: Configuration

source: Here we import the small number of tools we need for this tutorial.
fr: Ici, nous importons les outils nécessaires pour ce tutoriel.

source: Initialize Runtime service and select backends
fr: Configurer le service d'exécution et sélectionner des systèmes

source: Here we instantiate the Runtime service that gives access to the quantum devices and the simulator that we use in this tutorial. We will first use a simulator to validate our circuit, then execute it on a real quantum system.
fr: Ici, nous configurons le service d'exécution qui donne accès aux systèmes quantiques et au simulateur que nous utilisons dans ce tutoriel. Nous utiliserons d'abord un simulateur pour valider notre circuit, avant de l'exécuter sur un réel système quantique.

source: Define a Grover experiment
fr: Définir une expérience Grover

source: Grover's algorithm requires an `oracle <https://quantum-computing.ibm.com/admin/docs/admin/guide/grovers-algorithm#the-oracle>`__ that specifies one or more marked computational basis states, where "marked" means a state with a phase of -1. A controlled-Z gate, or its multi-controlled generalization over :math:`N` qubits, marks the :math:`2^{N}-1` state (``'1'``\ \*\ :math:`N` bit-string). Marking basis states with one or more ``'0'`` in the binary representation requires applying X-gates on the corresponding qubits before and after the controlled-Z gate; equivalent to having an open-control on that qubit. In the following code, we define an oracle that does just that, marking one or more input basis states defined through their bit-string representation. The ``MCMT`` gate is used to implement the multi-controlled Z-gate.
fr: L'algorithme de Grover nécessite un "oracle <https://quantum-computing.ibm.com/admin/docs/admin/guide/grovers-algorithm#the-oracle>`__ qui spécifie un ou plusieurs états de calcul marqués, où "marqués" signifie un état avec une phase de -1. L'opérateur controlled-Z, ou sa généralisation multi-contrôlée sur :math:`N` qubits, marque le :math:`2 ^{N}-1` state (``'1'``\ \*\ :math:`N` bit-string). Le marquage des états avec un ou plusieurs ``'0'`` dans la représentation binaire nécessite d'appliquer des opérations X sur les qubits correspondants avant et après l'opérateur controlled-Z; correspondant à avoir un contrôle inversé sur ce qubit. Dans le code suivant, nous définissons un oracle qui fait cela, marquant un ou plusieurs états d'entrée définis via leur représentation binaire. L'opérateur ``MCMT`` est utilisé pour appliquer l'opérateur Z-gate multi-contrôlée.

source: Specific Grover's instance
fr: Instance spécifique de Grover

source: Now that we have the oracle function, we can define a specific instance of Grover search. In this example we will mark two computational states out of the eight available in a three-qubit computational space:
fr: Maintenant que nous avons la fonction oracle, nous pouvons définir une instance spécifique de recherche Grover. Dans cet exemple, nous allons marquer deux états sur les huit disponibles dans un espace de calcul de trois qubits :

source: The ``GroverOperator``
fr: Le ``GroverOperator``

source: The built-in Qiskit ``GroverOperator`` takes an oracle circuit and returns a circuit that is composed of the oracle circuit itself and a circuit that amplifies the states marked by the oracle. Here, we ``decompose`` the circuit to see the gates within the operator:
fr: Le ``GroverOperator`` de Qiskit prend un circuit oracle et retourne un circuit qui est composé du circuit oracle ainsi que d'un circuit qui amplifie les états marqués par l'oracle. Ici, nous ``décomposons`` le circuit pour voir les opérations quantiques de l'opérateur :

source: Repeated applications of this ``grover_op`` circuit amplify the marked states, making them the most probable bit-strings in the output distribution from the circuit. There is an optimal number of such applications that is determined by the ratio of marked states to total number of possible computational states:
fr: L'execution répétée de ce circuit ``grover_op`` amplifie les états marqués, ce qui en fait les bits les plus probables dans la distribution résultante du circuit. Il y a un nombre optimal de telles executions qui est déterminé par le rapport entre les états marqués et le nombre total d'états de calcul possibles:

source: Full Grover circuit
fr: Circuit Grover complet

source: A complete Grover experiment starts with a Hadamard gate on each qubit; creating an even superposition of all computational basis states, followed the Grover operator (``grover_op``) repeated the optimal number of times. Here we make use of the ``QuantumCircuit.power(INT)`` method to repeatedly apply the Grover operator.
fr: Une expérience de Grover complète commence par une porte Hadamard sur chaque qubit ; générant une superposition de tous les états de calcul, suivi par l'opérateur Grover (``grover_op``) répété le nombre de fois optimal. Ici, nous utilisons la méthode ``QuantumCircuit.power (INT)`` pour appliquer à plusieurs reprises l'opérateur Grover.

source: Execution with the Sampler primitive
fr: Exécution avec la primitive Sampler

source: Amplitude amplification is a sampling problem that is suitable for execution with the ``Sampler`` runtime primitive. Because we have a single circuit, we instantiate a ``Sampler`` using the target backend. To begin, this is the simulator:
fr: L'amplification de l'amplitude est un problème d'échantillonnage qui peut être exécuté avec la primitive d'exécution ``Sampler``. Parce que nous avons un circuit unique, nous configurons un ``Sampler`` en utilisant le backend désiré. Pour commencer, voilà le simulateur :

source: Now we execute the circuit by using ``sim_sampler.run``. The result is obtained in the returned quasi-probability distribution:
fr: Maintenant, nous exécutons le circuit en utilisant ``sim_sampler.run``. Le résultat est obtenu dans la distribution de probabilités retournée :

source: To see that the marked states are visible in the returned distribution, we convert the returned quasi-probability distribution from integer to bit-string representation to compare to the list of ``marked_states``.
fr: Pour vérifier que les états marqués sont visibles dans la distribution retournée, nous convertissons la distribution de probabilité de la représentation de nombres entiers à la représentation binaire pour la comparer à la liste des ``marked_states``.

source: Having verified that our code does indeed produce the desired outcome, we now execute it on a real device, creating an ``Sampler`` instance targeting that system:
fr: Ayant vérifié que notre code produit le résultat souhaité, nous l'exécutons maintenant sur un véritable système, créant une instance ``Sampler`` depuis ce système :
