Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/how-to-getting-started-with-estimator.po
Languages: es_un, ja, ko_kr

source: The next step is to create an instance of an ``Estimator`` class. This can be any ``Estimator`` class that complies with the ``Estimator`` primitive specification. For simplicity, we will use Qiskit Terra's ``qiskit.primitives.Estimator`` class, based on the `Statevector construct <https://qiskit.org/documentation/stubs/qiskit.quantum_info.Statevector.html?highlight=statevector#qiskit.quantum_info.Statevector>`__ (algebraic simulation).
es_un: El siguiente paso es crear una instancia de una clase ``Estimator``. Puede ser cualquier clase ``Estimator`` que cumpla con la especificación de la primitiva ``Estimator``. Para simplificar, usaremos la clase ``qiskit.primitives.Estimator`` de Qiskit Terra, basada en el `Statevector construct <https://qiskit.org/documentation/stubs/qiskit.quantum_info.Statevector.html?highlight=statevector#qiskit.quantum_info.Statevector>`__ (simulación algebraica).

source: In this section we will go over how to use Qiskit Runtime's implementation of the ``Estimator`` primitive.
es_un: En esta sección, veremos cómo usar la implementación de Qiskit Runtime de la primitiva ``Estimator``.

source: Follow the steps in the `getting started guide <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ if you don't already have an account set up.
es_un: Sigue la `guía de primeros pasos <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ si aún no tienes una cuenta configurada.

source: Here we are initializing an instance of ``qiskit_ibm_runtime.Estimator`` rather than ``qiskit.primitives.Estimator`` to use Qiskit Runtime's implementation of the ``Estimator``.
es_un: Aquí estamos inicializando una instancia de ``qiskit_ibm_runtime.Estimator`` en lugar de ``qiskit.primitives.Estimator`` para usar la implementación de ``Estimator`` de Qiskit Runtime.

source: Primitives come with several options that are grouped into different categories. Commonly used options, such as ``resilience_level``, are at the first level.
es_un: Las primitivas vienen con varias opciones que se agrupan en diferentes categorías. Las opciones de uso común, como ``resilience_level``, se encuentran en el primer nivel.

source: In the following example, we create an instance of the ``Options`` class. ``optimization_level`` is a first level option and can be passed as an input parameter. Options related to the execution environment are passed using the ``environment`` parameter.
es_un: En el siguiente ejemplo, creamos una instancia de la clase ``Options``. ``optimization_level`` es una opción de primer nivel y se puede pasar como un parámetro de entrada. Las opciones relacionadas con el entorno de ejecución se pasan mediante el parámetro ``environment``.

source: You can also pass options to the ``run()`` method. This will overwrite the options you specified when creating the ``Estimator`` instance for that particular execution.
es_un: También puedes pasar opciones al método ``run()``. Esto sobrescribirá las opciones que especificaste al crear la instancia de ``Estimator`` para esa ejecución en particular.

source: Since most users will only overwrite a handful of options at the job level, it is not necessary to specify the category the options are in. The following code, for example, specifies ``shots=1024`` rather than ``execution={"shots": 1024}`` (which is also valid).
es_un: Dado que la mayoría de los usuarios solo sobrescribirán un puñado de opciones a nivel del trabajo (job), no es necesario especificar la categoría en la que se encuentran las opciones. El siguiente código, por ejemplo, especifica ``shots=1024`` en lugar de ``execution={"shots": 1024}`` (que también es válido).

source: A Qiskit Runtime *session* allows you to group a collection of iterative calls to the quantum computer. A session is started when the first job within the session is started. If the session is active, subsequent jobs within the session are prioritized by the scheduler to minimize artificial delay within an iterative algorithm. Data used within a session, such as transpiled circuits, is also cached to avoid unnecessary overhead.
es_un: Una *sesión* de Qiskit Runtime te permite agrupar una colección de llamadas iterativas a la computadora cuántica. Una sesión se inicia cuando se inicia el primer trabajo (job) dentro de la sesión. Si la sesión está activa, el planificador prioriza los trabajos posteriores dentro de la sesión para minimizar el retraso artificial dentro de un algoritmo iterativo. Los datos utilizados dentro de una sesión, como los circuitos transpilados, también se almacenan en caché para evitar una sobrecarga innecesaria.

source: If you don't specify a timeout value, it is set to the initial job's maximum execution time and is the smaller of these values:
es_un: Si no especificas un valor de tiempo de espera, se establece en el tiempo de ejecución máximo del trabajo inicial y es el menor de estos valores:

source: The system limit (see `What is the maximum execution time for a Qiskit Runtime job? <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/faqs/max_execution_time.html>`__).
es_un: El límite del sistema (consulta `¿Cuál es el tiempo máximo de ejecución para un job de Qiskit Runtime? <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/faqs/max_execution_time.html>`__).

source: The ``max_execution_time`` defined by the program.
es_un: El ``max_execution_time`` definido por el programa.

source: The following example shows how you can create both an instance of the ``Sampler`` class and one of the ``Estimator`` class and invoke their ``run()`` methods within a session.
es_un: El siguiente ejemplo muestra cómo puedes crear tanto una instancia de la clase ``Sampler`` como una de la clase ``Estimator`` e invocar sus métodos ``run()`` dentro de una sesión.

source: The calls can also be asynchronous. You don't need to wait for the result of a previous job before submitting another one.
es_un: Las llamadas también pueden ser asíncronas. No necesitas esperar el resultado de un trabajo anterior para enviar otro.

source: The following code recaps using Qiskit Runtime primitives, options, and session.
es_un: El siguiente código resume el uso de las primitivas, las opciones y la sesión de Qiskit Runtime.

source: Learn how to set up and use the Estimator primitive program.
ko_kr: Estimator primitive를 설정하고 사용하는 방법을 익힌다.

source: Overview
ko_kr: 개요

source: The ``Estimator`` primitive lets you efficiently calculate and interpret expectation values of quantum operators required for many algorithms. You can specify a list of circuits and observables, then evaluate expectation values and variances for a given parameter input.
ko_kr: ``Estimator`` primitive를 사용하면 다양한 알고리즘에 필요한 양자 연산자의 기댓값을 효율적으로 계산하고 해석할 수 있다. 회로 및 관측가능량에 대한 리스트 를 지정한 후, 입력 매개변수에 따른 기댓값과 분산을 계산할 수 있다.

source: Prepare the environment
ko_kr: 환경 준비하기

source: Follow the steps in the `getting started guide <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ to get your quantum service instance ready to use.
ko_kr: `getting started guide <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ 의 단계를 따라 양자 서비스 인스턴스를 사용할 수 있도록 준비한다.

source: You’ll need at least one circuit to submit to the program. Our examples all have circuits in them, but if you want to submit your own circuit, you can use Qiskit to create one. To learn how to create circuits by using Qiskit, see the `Circuit basics tutorial <https://qiskit.org/documentation/tutorials/circuits/01_circuit_basics.html>`__.
ko_kr: 적어도 하나의 회로가 있어야만 프로그램을 제출할 수 있다. 예제에 제시된 회로 이외에, Qiskit을 사용해 회로를 직접 만들어 업로드할 수도 있다. Qiskit으로 회로를 만드는 법을 학습하려면 `Circuit basics tutorial <https://qiskit.org/documentation/tutorials/circuits/01_circuit_basics.html>`__ 를 참조하면 된다.

source: Create a list of observables. Observables let you define the properties of the circuit that are relevant to your problem and enable you to efficiently measure their expectation value. For simplicity, you can use the `PauliSumOp class <https://qiskit.org/documentation/stubs/qiskit.opflow.primitive_ops.html#module-qiskit.opflow.primitive_ops>`__ in Qiskit to define them, as illustrated in the example below.
ko_kr: 리스트의 관측가능량을 만든다. 관측가능량으로 프로그램과 관련 있는 회로의 속성을 정의할 수 있고, 해당 기댓값을 효율적으로 측정할 수 있다. 단순하게 아래 예제에 설명된 대로 Qiskit에 있는 `PauliSumOp class <https://qiskit.org/documentation/stubs/qiskit.opflow.primitive_ops.html#module-qiskit.opflow.primitive_ops>`__ 를 사용해서 관측가능량을 정의할 수 있다.

source: Start a session
ko_kr: 세션 시작하기

source: Create an Estimator instance
ko_kr: Estimator 인스턴스 만들기

source: ``options`` can be either a dictionary or a ``qiskit_ibm_runtime.Options`` class instance. Initializing it as an ``Options`` class allows you to do auto-complete.
ko_kr: ``options`` 은 딕셔너리나 ``qiskit_ibm_runtime.Options`` 클래스 인스턴스일 수 있다. 이를 ``Options`` 클래스로 초기화할 경우 자동 완성을 이용할 수 있게 한다.

source: **optimization_level**: How much optimization to perform on the circuits. The default is 1.
ko_kr: **optimization_level**: 회로에서 수행할 최적화 정도. 기본값은 1이다.

source: **resilience_level**: How much resilience to build against errors. Higher levels generate more accurate results, at the expense of longer processing times. The default is 0.
ko_kr: **resilience_level**: 오류에 대비하여 얼마나 많은 복원력을 구축하는 정도. 레벨이 높을수록 처리 긴 처리 시간을 사용해 더 정확한 결과를 얻을 수 있다. 기본값은 0이다.

source: You can find more details in `the Options API reference <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`__.
ko_kr: `옵션 API 레퍼런스 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`__ 에서 좀 더 자세한 내용을 확인할 수 있다.

source: With these arguments, you can create a ``Estimator`` instance with the desired options. Example:
ko_kr: 이러한 인수를 사용하여 원하는 옵션으로 ``Estimator`` 인스턴스를 만들 수 있다.

source: Invoke the Estimator primitive
ko_kr: Estimator primitive 호출

source: You can invoke the ``Estimator`` primitive program using the ``run()`` method of the ``Estimator`` instance you just created. The method returns a ``IBMRuntimeJob`` instance which you can use to query for things like job ID and status. The ``result()`` method of the job will return the result.
ko_kr: 방금 만든 ``Estimator`` 인스턴스의 ``run()`` 메서드를 사용하여 ``Estimator`` primitive 프로그램을 호출할 수 있다. 메서드는 작업 ID 및 상황과 같은 항목을 쿼리하는 데 사용할 수 있는 ``IBMRuntimeJob`` 인스턴스를 반환한다. 작업의 ``result()`` 메서드는 결과를 반환한다.

source: You can invoke the ``run()`` method multiple times with the different inputs within a session.
ko_kr: 세션 내에서 다른 입력으로 ``run()`` 매서드를 여러 번 호출할 수 있다.

source: Specify program inputs
ko_kr: 프로그램 입력 지정하기

source: The ``Estimator.run()`` method takes in the following arguments:
ko_kr: ``Estimator.run()`` 매서드는 다음과 같은 입력인수를 갖는다:

source: **circuits**: A list of (parameterized) circuits that you want to investigate.
ko_kr: **circuits**: 살펴보려는 (매개변수화된) 회로의 목록

source: **observables**: A list of observables to measure the expectation values.
ko_kr: **observables**: 기댓값을 측정하는 관측가능량의 목록

source: **parameter_values**: An optional list of concrete parameters to be bound.
ko_kr: **parameter_values**: 묶을 구체적인 매개변수의 선택적 목록.

source: **kwargs**: Additional options to overwrite the default values.
ko_kr: **kwargs**: 기본값을 덮어쓰는 추가 옵션.

source: You can find more details in `the Estimator API reference <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Estimator.html>`__.
ko_kr: `추정기 API 레퍼런스 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Estimator.html>`__ 에서 좀 더 자세한 내용을 확인할 수 있다.

source: Run the job & print results
ko_kr: 작업 실행 및 결과 보기

source: Run the job, specifying your previously defined inputs and options. Use ``circuits``, ``observables``, and ``parameter_values`` to use a specific parameter and observable with the specified circuit.
ko_kr: 이전에 정의한 입력 및 옵션을 지정하여 작업을 실행하시오. ``circuits``, ``observables``, ``parameter_values`` 와 같은 변수를 활용해서 지정한 회로에 대해 특정 매개변수와 관측량을 추정기의 입력인수로 전달하시오.

source: For example, this line ``psi1_H23_result = estimator.run(circuits=[psi1, psi1], observables=[H2, H3], parameter_values=[theta1]*2).result()`` specifies the following:
ko_kr: 예를 들어, ``psi1_H23_result = estimator.run(circuits=[psi1, psi1], observables=[H2, H3], parameter_values=[theta1]*2).result()`` 은 다음을 지정한다.

source: Return the value for using observable ``H2`` and parameter ``theta1`` with the circuit ``psi1``.
ko_kr: 회로 ``psi1`` 에 대해 관측량 ``H2`` 와 매개변수 ``theta1`` 을 사용해서 기댓값을 구한다.

source: Return the value for using observable ``H3`` and parameter ``theta1`` with the circuit ``psi1``.
ko_kr: 회로 ``psi1`` 에 대해 관측량 ``H3`` 와 매개변수 ``theta1`` 을 사용해서 기댓값을 구한다.

source: The results align with the parameter - circuit - observable tuples specified previously. For example, the first result: ``EstimatorResult(values=array([1.5285]), metadata=[{'variance': 9.33715875, 'shots': 4000}])`` is the output of the parameter labeled ``theta1`` and observable ``H1`` being sent to the first circuit.
ko_kr: 이전에 지정한 매개변수-회로-관측량 튜플 자료형과 일치한다. 에를 들어, 첫 번째 결과인 ``EstimatorResult(values=array([1.5285]), metadata=[{'variance': 9.33715875, 'shots': 4000}])`` 는 ``theta1`` 으로 표시된 매개변수의 출력이고 첫 번째 회로로 전송되는 관측량 ``H1`` 이다.
