Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/how-to-getting-started-with-estimator.po
Languages: es_un, ja, ko_kr

source: This page was generated from `docs/tutorials/how-to-getting-started-with-estimator.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/how-to-getting-started-with-estimator.ipynb`__.
ja: このページは `docs/tutorials/how-to-getting-started-with-estimator.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/how-to-getting-started-with-estimator.ipynb`__ 에서 생성되었다.

source: Get started with the Estimator primitive
es_un: Primeros pasos con la primitiva Estimator
ja: Estimator primitive 入門
ko_kr: Estimator primitive 시작하기

source: In this tutorial we will show you how to set up the Qiskit Runtime ``Estimator`` primitive, explore the different options you can use to configure it, and invoke the primitive efficiently inside a session.
es_un: En este tutorial, te mostraremos cómo configurar la primitiva ``Estimator`` de Qiskit Runtime, explorar las diferentes opciones que puedes usar para configurarlo e invocar la primitiva de manera eficiente dentro de una sesión.
ja: このチュートリアルでは、Qiskit Rumtime ``Estimator`` primitiveを設定する方法、設定に使用できるさまざまなoption、およびsession内でprimitiveを効率的に呼び出す方法を説明します。

source: Primitives
es_un: Primitivas
ja: Primitive

source: Primitives are core functions that make it easier to build modular algorithms and applications.
es_un: Las primitivas son funciones básicas que facilitan la creación de aplicaciones y algoritmos modulares.
ja: Primitiveは、モジュール化されたアルゴリズムやアプリケーションを簡単に構築するためのコア関数です。

source: Instead of simply returning counts, they return more immediately meaningful information.
ja: 単にcountを返すだけでなく、より即座に意味のある情報を返すことができます。

source: Additionally, they provide a seamless way to access the latest advancements in IBM Quantum hardware and software.
es_un: Adicionalmente, proporcionan una forma sencilla de acceder a los últimos avances en hardware y software de IBM Quantum.
ja: さらに、IBM Quantumのハードウェアとソフトウェアの最新の進歩にアクセスするためのシームレスな方法を提供します。

source: The initial release of Qiskit Runtime includes two primitives:
es_un: La versión inicial de Qiskit Runtime incluye dos primitivas:
ja: Qiskit Runtimeの初期リリースには、次の2つのprimitiveが含まれています。

source: **Sampler:** Generates quasi-probabilities from input circuits.
es_un: **Sampler:** Genera cuasi-probabilidades a partir de circuitos de entrada.
ja: **Sampler:** 入力回路から準確率を生成する。

source: **Estimator:** Calculates expectation values from input circuits and observables.
es_un: **Estimator:** Calcula los valores esperados de los circuitos de entrada y observables.
ja: **Estimator:** 入力回路と観測量から期待値を計算する。

source: In this tutorial we will focus on the ``Estimator`` primitive. There is a separate tutorial on `Getting started with the Sampler primitive <how-to-getting-started-with-sampler.ipynb>`__.
es_un: En este tutorial nos centraremos en la primitiva ``Estimator``. Hay un tutorial separado sobre los `Primeros pasos con la primitiva Sampler <how-to-getting-started-with-sampler.ipynb>`__.
ja: このチュートリアルでは、 ``Estimator`` primitiveに焦点を当てます。`Sampler primtive 入門 <how-to-getting-started-with-sampler.ipynb>`__ というチュートリアルは別にあります。

source: Using the Estimator primitive
es_un: Utilizar la primitiva Estimator
ja: Estimator primitive を使う

source: Similar to the ``Backend`` base class, there is an ``Estimator`` base class defined in Qiskit Terra that standardizes the way users interact with all ``Estimator`` implementations. This allows users to easily change their choice of simulator or device for performing expectation value calculations, even if the underlying implementation is different.
es_un: Similar a la clase base ``Backend``, hay una clase base ``Estimator`` definida en Qiskit Terra que estandariza la forma en que los usuarios interactúan con todas las implementaciones de ``Estimator``. Esto permite a los usuarios cambiar fácilmente su elección de simulador o dispositivo para realizar cálculos de valor esperado, incluso si la implementación subyacente es diferente.
ja: ``Backend`` の基底クラスと同様に、Qiskit Terraには ``Estimator`` 基底クラスが定義されており、ユーザーがすべての ``Estimator`` 実装と対話する方法を標準化します。これにより、基礎となる実装が異なっていても、期待値計算を行うためのシミュレーターやデバイスの選択を簡単に変更することができます。

source: In this section we will be using the default implementation in Qiskit Terra, which uses a local statevector simulator.
ja: このセクションでは、Qiskit Terraのデフォルトの実装であるローカルの状態ベクトル・シミュレーターを使用します。

source: 1. Create a circuit
es_un: 1. Crear un circuito
ja: 1. 回路の作成

source: For a basic expectation value calculation you will need at least one quantum circuit to prepare our system in a precise quantum state for study. Our examples all have circuits in them, but you can use Qiskit to create your own. To learn how to create circuits by using Qiskit, see the `Circuit basics tutorial <https://qiskit.org/documentation/tutorials/circuits/01_circuit_basics.html>`__.
es_un: Para un cálculo básico del valor esperado, necesitarás al menos un circuito cuántico para preparar nuestro sistema en un estado cuántico preciso para el estudio. Todos nuestros ejemplos tienen circuitos, pero puedes usar Qiskit para crear el tuyo propio. Para aprender a crear circuitos con Qiskit, consulta el `Tutorial de aspectos básicos de un circuito <https://qiskit.org/documentation/tutorials/circuits/01_circuit_basics.html>`__.
ja: 基本的な期待値計算のためには、研究のための正確な量子状態でシステムを準備するために、少なくとも1つの量子回路が必要になります. すべての例に回路が含まれていますが、Qiskit を使用して独自の回路を作成することができます。 Qiskit を使用して回路を作成する方法については、`回路の基本チュートリアル <https://qiskit.org/documentation/tutorials/circuits/01_circuit_basics.html>`__ を参照してください。

source: 2. Create an observable to measure
es_un: 2. Crear un observable para medir
ja: 2. 測定する観測量の作成

source: You will also need at least one observable to measure. Observables represent physical properties of a quantum system (e.g. energy, spin), and allow said properties to be measured (e.g. their expectation values) for a given state of our system. For simplicity, you can use the `PauliSumOp class <https://qiskit.org/documentation/stubs/qiskit.opflow.primitive_ops.html#module-qiskit.opflow.primitive_ops>`__ in Qiskit to define them, as illustrated in the example below.
ja: 少なくとも測定する1つの観測量も必要です。観測量は量子系の物理的特性 (エネルギーやスピンなど) を表し、系の与えられた状態について前記特性を測定 (期待値など) できるようにします。単純化するために、以下の例に示すように、Qiskitの `PauliSumOp クラス <https://qiskit.org/documentation/stubs/qiskit.opflow.primitive_ops.html#module-qiskit.opflow.primitive_ops>`__ を使用してそれらを定義することができます。

source: 3. Initialize an Estimator class
es_un: 3. Inicializar una clase Estimator
ja: 3. Estimatorクラスの初期化

source: The next step is to create an instance of an ``Estimator`` class. This can be any ``Estimator`` class that complies with the ``Estimator`` primitive specification. For simplicity, we will use Qiskit Terra’s ``qiskit.primitives.Estimator`` class, based on the `Statevector construct <https://qiskit.org/documentation/stubs/qiskit.quantum_info.Statevector.html?highlight=statevector#qiskit.quantum_info.Statevector>`__ (i.e. algebraic simulation).
ja: 次のステップは、*Estimator* クラスのインスタンスを作ることです。これは、``Estimator`` primitiveの仕様に準拠した どのような``Estimator`` クラスでも構いません。分かりやすくするため、Qiskit Terraの ``qiskit.primitives.Estimator`` クラスを使用します。これは、 `Statevector construct <https://qiskit.org/documentation/stubs/qiskit.quantum_info.Statevector.html?highlight=statevector#qiskit.quantum_info.Statevector>`__ (すなわち代数シミュレーション) に基づいています。

source: 4. Invoke the Estimator and get results
es_un: 4. Invocar el Estimator y obtener resultados
ja: 4. Estimatorの呼び出しおよび結果の取得

source: To calculate the expectation values, invoke the ``run()`` method of the ``Estimator`` instance you just created and pass in the circuit and observable as input parameters. This method call is asynchronous, and you will get a ``Job`` object back. You can use this object to query for information like ``job_id()`` and ``status()``.
es_un: Para calcular los valores esperados, invoca al método ``run()`` de la instancia ``Estimator`` que acabas de crear y pasa el circuito y el observable como parámetros de entrada. Esta llamada de método es asíncrona y obtendrás un objeto ``Job``. Puedes usar este objeto para consultar información como ``job_id()`` y ``status()``.
ja: 期待値を計算するには、先ほど作成した ``Estimator`` インスタンスの ``run()`` メソッドを呼び出し、入力パラメータとして回路と観測量を渡します。このメソッドの呼び出しは非同期で、``Job`` オブジェクトを戻します。 このオブジェクトを使って ``job_id()`` や ``status()`` のような情報を問い合わせることができます。

source: The ``result()`` method of the job will return the ``EstimatorResult``, which includes both the expectation values and job metadata.
es_un: El método ``result()`` del trabajo (job) devolverá el ``EstimatorResult``, que incluye tanto los valores esperados como los metadatos del trabajo.
ja: ジョブの ``result()`` メソッドは、期待値とジョブのメタデータ双方を含む ``EstimatorResult`` を返します。

source: You can keep invoking the ``run()`` method again with the different inputs:
es_un: Puedes seguir invocando al método ``run()`` nuevamente con las diferentes entradas:
ja: このように、入力を変えて再度 ``run()`` メソッドを起動し続けることができます。

source: You can also provide compound inputs to the ``run()`` method:
es_un: También puedes proporcionar entradas compuestas al método ``run()``:
ja: ``run()`` メソッドに複数の入力を提供することもできます。

source: Or use parameterized circuits:
es_un: O usar circuitos parametrizados:
ja: もしくはパラメーター化された回路を使用します。

source: Using Qiskit Runtime Estimator
es_un: Usar Estimator de Qiskit Runtime
ja: Qiskit Runtime Estimatorの使用

source: In this section we will go over how to use Qiskit Runtime’s implementation of the ``Estimator`` primitive.
ja: このセクションでは、Qiskit Runtimeの ``Estimator`` primitiveの実装方法について説明します。

source: 1. Initialize the account
es_un: 1. Inicializar la cuenta
ja: 1. アカウントの初期化

source: Since Qiskit Runtime ``Estimator`` is a managed service, you will first need to initialize your account. You can then select the simulator or real backend you want to use to calculate the expectation value.
es_un: Dado que ``Estimator`` de Qiskit Runtime es un servicio administrado, primero deberás inicializar tu cuenta. Luego puedes seleccionar el simulador o el backend real que deseas usar para calcular el valor esperado.
ja: QisKit Runtimeの ``Estimator`` はマネージドサービスなので、まずアカウントを初期化する必要があります。 すると、期待値を計算するために使用するシミュレーターや実際のバックエンドを選択できるようになります。

source: Follow the steps in the `getting started guide <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ if you don’t already have an account set up.
ja: まだアカウントを設定していない場合は、 `getting started guide <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ の手順に従ってください。

source: 2. Create a circuit and an observable
es_un: 2. Crear un circuito y un observable
ja: 2. 回路と観測量の作成

source: Just like the section before, you will need at least one circuit and one observable as inputs to the ``Estimator`` primitive.
es_un: Al igual que en la sección anterior, necesitarás al menos un circuito y un observable como entradas para la primitiva ``Estimator``.
ja: 前のセクションと同様に、``Estimator`` primitive への入力として少なくとも1つの回路と観測量が必要です。

source: 3. Initialize the Qiskit Runtime Estimator
es_un: 3. Inicializar Estimator de Qiskit Runtime
ja: 3. Qiskit Runtime Estimator の初期化

source: Here we are initializing an instance of ``qiskit_ibm_runtime.Estimator`` instead of ``qiskit.primitives.Estimator`` to use Qiskit Runtime’s implementation of the ``Estimator``.
ja: ここでは、Qiskit Runtimeの``Estimator`` の実装を使用するため、 ``qiskit.primitives.Estimator`` の代わりに ``qiskit_ibm_runtime.Estimator`` のインスタンスを初期化します。

source: When you initialize the ``Estimator``, you’ll need to pass in the backend you previously selected as the target device (or simulator), using the ``session`` parameter. This automatically opens a session for that backend. We will talk more about session in a later section.
ja: ``Estimator`` を初期化する場合は、 ``session`` パラメータを使用して、先に選択したバックエンドをターゲット・デバイス (またはシミュレーター) として渡す必要があります。 これにより、バックエンドのセッションが自動的に開きます。セッションについては、後のセクションで詳しく説明します。

source: You can then invoke the ``run()`` method to calculate expectation values for the input circuit(s) and observable(s).
es_un: Luego puedes invocar al método ``run()`` para calcular los valores esperados para los circuitos de entrada y los observables.
ja: その後、 ``run()`` メソッドを呼び出して、入力回路と観測量の期待値を計算することができます。

source: Options
es_un: Opciones
ja: オプション

source: Primitives come with a number of options that are grouped into different categories. Commonly used options, such as ``resilience_level``, are at the first level.
ja: primitiveには、さまざまなカテゴリーにグループ化された数々のオプションが用意されています。``resilience_level`` などの一般的に使用されるオプションは、最初のレベルにあります。

source: You can use the `Options <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`__ class to specify different options.
es_un: Puedes utilizar la clase `Options <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`__ para especificar distintas opciones.
ja: `Options <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`__ クラスを使用して、さまざまなオプションを指定できます。

source: In the example below, we create an instance of the ``Options`` class. ``optimization_level`` is a first level option and can be passed as an input parameter. Options related to the execution environment are passed using the ``environment`` parameter.
ja: 以下の例では、``Options`` クラスのインスタンスを作成します。 ``optimization_level`` は最初のレベルのオプションで、入力パラメーターとして渡すことができます。 実行環境に関連するオプションは ``environment`` パラメーターを使用して渡されます。

source: ``Options`` supports auto-complete. Once you create an instance of the ``Options`` class, you can use auto-complete to see what options are available. If you choose one of the categories, you can use auto-complete again to see what options are available under that category.
es_un: ``Options`` soporta el autocompletado. Una vez que creas una instancia de la clase ``Options``, puedes usar la función de autocompletar para ver qué opciones están disponibles. Si eliges una de las categorías, puedes usar la función de autocompletar nuevamente para ver qué opciones están disponibles en esa categoría.
ja: ``Options`` は自動補完をサポートします。``Options`` クラスのインスタンスを作成したら、自動補完を使用して利用可能なオプションを確認できます。 カテゴリーを選択した場合は、再び自動補完を使用して、そのカテゴリーの下で利用可能なオプションを確認できます。

source: When creating an instance of the ``Estimator`` class, you can pass in the ``options`` you just created. Those options will then be applied when you use ``run()`` to perform the calculation.
es_un: Al crear una instancia de la clase ``Estimator``, puedes pasar las ``options`` que acabas de crear. Esas opciones se aplicarán cuando uses ``run()`` para realizar el cálculo.
ja: ``Estimator`` クラスのインスタンスを作成する場合、作成したばかりの ``options`` を渡すことができます。 これらのオプションは ``run()`` を使って計算を行うときに適用されます。

source: You can also pass in options via the ``run()`` method. This will overwrite the options you specified when creating the ``Estimator`` instance for that particular execution.
ja: ``run()`` メソッドでオプションを渡すこともできます。 これにより、``Estimator`` インスタンスを作成するときに指定したオプションを、特定の実行のために上書きします。

source: Since most users will only overwrite a handful of options at the job level, it is not necessary to specify the category the options are in. The code below, for example, specifies ``shots=1024`` instead of ``execution={"shots": 1024}`` (which is also valid).
ja: ほとんどのユーザーはジョブ・レベルでのオプションのみ上書きするので、 カテゴリーを指定する必要はありません。 例えば、``execution={"shots": 1024}`` (これも有効です) の代わりに ``shots=1024`` を指定します 。

source: Error suppression and mitigation
es_un: Supresión y mitigación de errores
ja: エラーの抑止と軽減

source: ``optimization_level`` and ``resilience_level`` are used to configure error suppress and mitigation.
es_un: ``optimization_level`` y ``resilience_level`` se utilizan para configurar la supresión y mitigación de errores.
ja: ``optimization_level`` および ``resilience_level `` を使用して、エラーの抑止と軽減を構成します。

source: ``Estimator`` supports ``optimization_level`` 0-3 and ``resilience_level`` 0-3.
es_un: ``Estimator`` admite ``optimization_level`` 0-3 y ``resilience_level`` 0-3.
ja: ``Estimator`` は ``optimization_level`` 0-3 と ``resilience_level`` 0-3 をサポートしています。

source: Advanced mitigation options can be specified under ``resilience``.
es_un: Las opciones de mitigación avanzadas se pueden especificar en ``resilience``.
ja: 高度な軽減オプションは ``resilience`` で指定できます。

source: Session
es_un: Sesión
ja: セッション

source: A Qiskit Runtime *session* allows you to group a collection of iterative calls to the quantum computer. A session is started when the first job within the session is started. As long as the session is active, subsequent jobs within the session are prioritized by the scheduler to minimize artificial delay within an iterative algorithm. Data used within a session, such as transpiled circuits, is also cached to avoid unnecessary overhead.
ja: Qiskit Runtime *セッション* は、量子コンピューターの反復呼び出しの集合をグループ化することができます。セッションは、プログラムの最初のジョブがセッション内で開始したときに開始されます。セッションが有効である限り、セッション内の後続のジョブは反復アルゴリズム内の人為的な遅延を最小化するようスケジューラーによって優先順位が付けられます。トランスパイルされた回路のように、セッション内で使用されるデータも、不要なオーバーヘッドを避けるためにキャッシュされます。

source: Session timing
es_un: Duración de la sesión
ja: セッションの時間

source: When a session is started, it is assigned a maximum session timeout value. You can set this value by using the ``max_time`` parameter.
es_un: Cuando se inicia una sesión, se le asigna un valor máximo de tiempo de espera de sesión. Puedes establecer este valor utilizando el parámetro ``max_time``.
ja: セッションが開始されると、セッション・タイムアウトの最大値が割り当てられます。この値は ``max_time`` パラメーターを使用して設定できます。

source: If you don’t specify a timeout value, it is set to the initial job’s maximum execution time and is the smaller of these values:
ja: タイムアウト値を指定しない場合、最初のジョブの最大実行時間に設定されます。これは次のうちの小さい方の値です。

source: The system limit which can be found `here <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/faqs/max_execution_time.html>`__.
ja: `ここ <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/faqs/max_execution_time.html>`__ にあるシステムの制限。

source: The max_execution_time defined by the program.
ja: プログラムによって定義された max_execution_time。

source: After this time limit is reached, the session is permanently closed.
es_un: Una vez alcanzado este límite de tiempo, la sesión se cierra de forma permanente.
ja: この制限時間に達すると、セッションは永久にクローズされます。

source: A session also has an *interactive* timeout value. If there are no session jobs queued within that window, the session is temporarily deactivated and normal job selection resumes. This interactive timeout value is set by the system and cannot be overwritten.
es_un: Una sesión también tiene un valor de tiempo de espera *interactivo*. Si no hay trabajos (jobs) de sesión encolados dentro de esa ventana, la sesión se desactiva temporalmente y se reanuda la selección normal de trabajos. Este valor de tiempo de espera interactivo lo establece el sistema y no se puede sobrescribir.
ja: セッションには *対話的* タイムアウト値もあります。 そのウィンドウ内に待ち行列に入ったセッション・ジョブがない場合、セッションは一時的に無効化され、通常のジョブ選択が再開されます。 この対話的タイムアウト値はシステムによって設定され、上書きすることはできません。

source: Invoking Estimator.run within a session
es_un: Invocar Estimator.run dentro de una sesión
ja: セッション内での Estimator.run の呼び出し

source: You can create a Qiskit Runtime session using the context manager (``with ...:``), which automatically opens and closes the session for you. You can invoke ``Estimator.run`` one or more times within a session:
es_un: Puedes crear una sesión de Qiskit Runtime usando el administrador de contexto (``with ...:``), que automáticamente abre y cierra la sesión por ti. Puedes invocar ``Estimator.run`` una o más veces dentro de una sesión:
ja: 自動的にセッションを開閉するコンテキスト・マネージャー (``with ...:``) を使って、Qiskit Runtimeセッションを作成できます。セッション内で ``Estimator.run`` を1回以上呼び出すことができます。

source: Invoke multiple primitives in a session
es_un: Invocar múltiples primitivas en una sesión
ja: セッション内での複数primitiveの呼び出し

source: You are not restricted to a single primitive function within a session. In this section we will show you an example of using multiple primitives.
es_un: No estás restringido a una sola función primitiva dentro de una sesión. En esta sección te mostraremos un ejemplo del uso de múltiples primitivas.
ja: セッション内は単一のprimitive関数に限定されていません。このセクションでは、複数のprimitiveを使用する例を示します。

source: First we prepare a circuit for the sampler primitive.
es_un: Primero preparamos un circuito para la primitiva sampler.
ja: 最初に、Sampler primitive用の回路を用意します。

source: The example below shows how you can create both an instance of the ``Sampler`` class and one of the ``Estimator`` class and invoke their ``run()`` methods within a session.
ja: 以下の例では、``Sampler`` クラスと ``Estimator`` クラスのインスタンスを両方作成し、セッション内で ``run()`` メソッドを呼び出す方法を示しています。

source: The calls can also be asynchronous. You don’t need to wait for the result of a previous job before submitting another one.
ja: 呼び出しは非同期にすることもできます。別のジョブを送信する前に、前のジョブの結果を待つ必要はありません。

source: Summary
es_un: Resumen
ja: まとめ

source: Below is a quick recap of using Qiskit Runtime primitives, options, and session.
ja: 以下は、Qiskit Runtime primitive、オプション、そしてセッションを簡単にまとめたものです。

source: Reference
es_un: Referencia
ja: 参考資料

source: You can find more details about the ``Estimator`` methods in the `Estimator API reference <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Estimator.html#qiskit_ibm_runtime.Estimator>`__.
es_un: Puedes encontrar más detalles sobre los métodos de ``Estimator`` en la `referencia de la API de Estimator <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Estimator.html#qiskit_ibm_runtime.Estimator>`__.
ja: ``Estimator`` メソッドの詳細は、 `Estimator API reference <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Estimator.html#qiskit_ibm_runtime.Estimator>`__ を参照してください。

source: And all the available options in the `Options API reference <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`__.
es_un: Y todas las opciones disponibles en la `referencia de la API de Options <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`__.
ja: そして利用可能なすべてのオプションは、`Options API reference <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`__ に記載されています。

source: Rather than simply returning counts, they return more immediately meaningful information.
es_un: En lugar de simplemente devolver recuentos, devuelven información significativa más inmediata.

source: In this section we will be using the default implementation in Qiskit Terra, which uses a local state vector simulator.
es_un: En esta sección, utilizaremos la implementación predeterminada en Qiskit Terra, que utiliza un simulador de vector de estado local.

source: You will also need at least one observable to measure. Observables represent physical properties of a quantum system (such as energy or spin), and allow said properties to be measured (such as their expectation values) for a given state of our system. For simplicity, you can use the `SparsePauliOp class <https://qiskit.org/documentation/stubs/qiskit.quantum_info.SparsePauliOp.html#qiskit.quantum_info.SparsePauliOp>`__ in Qiskit to define them, as illustrated in the following example.
es_un: También necesitarás al menos un observable para medir. Los observables representan propiedades físicas de un sistema cuántico (como la energía o el espín) y permiten medir dichas propiedades (como sus valores esperados) para un estado dado de nuestro sistema. Para simplificar, puedes usar la `clase SparsePauliOp <https://qiskit.org/documentation/stubs/qiskit.quantum_info.SparsePauliOp.html#qiskit.quantum_info.SparsePauliOp>`__ en Qiskit para definirlos, como se ilustra en el siguiente ejemplo.
