Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/how-to-getting-started-with-sampler.po
Languages: es_un

source: This page was generated from `docs/tutorials/how-to-getting-started-with-sampler.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/how-to-getting-started-with-sampler.ipynb`__.

source: Get started with the Sampler primitive
es_un: Primeros pasos con la primitiva Sampler

source: In this tutorial we will show you how to set up the Qiskit Runtime ``Sampler`` primitive, explore the different options you can use to configure it, and invoke the primitive efficiently inside a session.
es_un: En este tutorial, te mostraremos cómo configurar la primitiva ``Sampler`` de Qiskit Runtime, explorar las diferentes opciones que puedes usar para configurarlo e invocar la primitiva de manera eficiente dentro de una sesión.

source: Primitives
es_un: Primitivas

source: Primitives are core functions that make it easier to build modular algorithms and applications.
es_un: Las primitivas son funciones básicas que facilitan la creación de aplicaciones y algoritmos modulares.

source: Instead of simply returning counts, they return more immediately meaningful information.
es_un: En lugar de simplemente devolver recuentos, devuelven información significativa más inmediata.

source: Additionally, they provide a seamless way to access the latest advancements in IBM Quantum hardware and software.
es_un: Adicionalmente, proporcionan una forma sencilla de acceder a los últimos avances en hardware y software de IBM Quantum.

source: The initial release of Qiskit Runtime includes two primitives:
es_un: La versión inicial de Qiskit Runtime incluye dos primitivas:

source: **Sampler:** Generates quasi-probabilities from input circuits.
es_un: **Sampler:** Genera cuasi-probabilidades a partir de circuitos de entrada.

source: **Estimator:** Calculates expectation values from input circuits and observables.
es_un: **Estimator:** Calcula los valores esperados de los circuitos de entrada y observables.

source: In this tutorial we will focus on the ``Sampler`` primitive. There is a separate tutorial on `Getting started with the Estimator primitive <how-to-getting-started-with-estimator.ipynb>`__.
es_un: En este tutorial nos centraremos en la primitiva ``Sampler``. Hay un tutorial separado sobre los `Primeros pasos con la primitiva Estimator <how-to-getting-started-with-estimator.ipynb>`__.

source: Using the Sampler primitive
es_un: Utilizar la primitiva Sampler

source: Similar to the ``Backend`` base class, there is an ``Sampler`` base class defined in Qiskit Terra that standardizes the way users interact with all ``Sampler`` implementations. This allows users to easily change their choice of simulator or device for performing expectation value calculations, even if the underlying implementation is different.
es_un: Similar a la clase base ``Backend``, hay una clase base ``Sampler`` definida en Qiskit Terra que estandariza la forma en que los usuarios interactúan con todas las implementaciones de ``Sampler``. Esto permite a los usuarios cambiar fácilmente su elección de simulador o dispositivo para realizar cálculos de valor esperado, incluso si la implementación subyacente es diferente.

source: In this section we will be using the default implementation in Qiskit Terra, which uses a local statevector simulator.
es_un: En esta sección, utilizaremos la implementación predeterminada en Qiskit Terra, que utiliza un simulador de vector de estado local.

source: 1. Create a circuit
es_un: 1. Crear un circuito

source: You will need at least one quantum circuit to prepare our system in a precise quantum state for study. Our examples all have circuits in them, but you can use Qiskit to create your own. To learn how to create circuits by using Qiskit, see the `Circuit basics tutorial <https://qiskit.org/documentation/tutorials/circuits/01_circuit_basics.html>`__.
es_un: Necesitarás al menos un circuito cuántico para preparar nuestro sistema en un estado cuántico preciso para el estudio. Todos nuestros ejemplos tienen circuitos, pero puedes usar Qiskit para crear el tuyo propio. Para aprender a crear circuitos con Qiskit, consulta el `Tutorial de aspectos básicos de un circuito <https://qiskit.org/documentation/tutorials/circuits/01_circuit_basics.html>`__.

source: 2. Initialize a Sampler class
es_un: 2. Inicializar una clase Sampler

source: The next step is to create an instance of an ``Sampler`` class. This can be any ``Sampler`` class that complies with the ``Sampler`` primitive specification. For simplicity, we will use Qiskit Terra’s ``qiskit.primitives.Sampler`` class, based on the `Statevector construct <https://qiskit.org/documentation/stubs/qiskit.quantum_info.Statevector.html?highlight=statevector#qiskit.quantum_info.Statevector>`__ (i.e. algebraic simulation).
es_un: El siguiente paso es crear una instancia de una clase ``Sampler``. Puede ser cualquier clase ``Sampler`` que cumpla con la especificación de la primitiva ``Sampler``. Para simplificar, usaremos la clase ``qiskit.primitives.Sampler`` de Qiskit Terra, basada en el `Statevector construct <https://qiskit.org/documentation/stubs/qiskit.quantum_info.Statevector.html?highlight=statevector#qiskit.quantum_info.Statevector>`__ (es decir, simulación algebraica).

source: 3. Invoke the Sampler and get results
es_un: 3. Invocar el Sampler y obtener resultados

source: To estimate the quasi-probability distribution of the circuit output, invoke the ``run()`` method of the ``Sampler`` instance you just created and pass in the circuit as an input parameter. This method call is asynchronous, and you will get a ``Job`` object back. You can use this object to query for information like ``job_id()`` and ``status()``.
es_un: Para estimar la distribución de cuasi-probabilidad de la salida del circuito, invoca al método ``run()`` de la instancia ``Sampler`` que acabas de crear y pasa el circuito como un parámetro de entrada. Esta llamada de método es asíncrona y obtendrás un objeto ``Job``. Puedes usar este objeto para consultar información como ``job_id()`` y ``status()``.

source: The ``result()`` method of the job will return the ``SamplerResult``, which includes both the quasi-distribution and job metadata.
es_un: El método ``result()`` del trabajo (job) devolverá el ``SamplerResult``, que incluye tanto la cuasi-distribución como los metadatos del trabajo.

source: You can keep invoking the ``run()`` method again with the different inputs:
es_un: Puedes seguir invocando al método ``run()`` nuevamente con las diferentes entradas:

source: You can also provide compound inputs to the ``run()`` method:
es_un: También puedes proporcionar entradas compuestas al método ``run()``:

source: Or use parameterized circuits:
es_un: O usar circuitos parametrizados:

source: Using Qiskit Runtime Sampler
es_un: Usar Sampler de Qiskit Runtime

source: In this section we will go over how to use Qiskit Runtime’s implementation of the ``Sampler`` primitive.
es_un: En esta sección, veremos cómo usar la implementación de Qiskit Runtime de la primitiva ``Sampler``.

source: 1. Initialize the account
es_un: 1. Inicializar la cuenta

source: Since Qiskit Runtime ``Sampler`` is a managed service, you will first need to initialize your account. You can then select the simulator or real backend you want to use to calculate the expectation value.
es_un: Dado que ``Sampler`` de Qiskit Runtime es un servicio administrado, primero deberás inicializar tu cuenta. Luego puedes seleccionar el simulador o el backend real que deseas usar para calcular el valor esperado.

source: Follow the steps in the `getting started guide <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ if you don’t already have an account set up.
es_un: Sigue la `guía de primeros pasos <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ si aún no tienes una cuenta configurada.

source: 2. Create a circuit
es_un: 2. Crear un circuito

source: Just like the section before, you will need at least one circuit as the input to the ``Sampler`` primitive.
es_un: Al igual que en la sección anterior, necesitarás al menos un circuito como la entrada para la primitiva ``Sampler``.

source: 3. Initialize the Qiskit Runtime Sampler
es_un: 3. Inicializar Sampler de Qiskit Runtime

source: Here we are initializing an instance of ``qiskit_ibm_runtime.Sampler`` instead of ``qiskit.primitives.Sampler`` to use Qiskit Runtime’s implementation of the ``Sampler``.
es_un: Aquí estamos inicializando una instancia de ``qiskit_ibm_runtime.Sampler`` en lugar de ``qiskit.primitives.Sampler`` para usar la implementación de ``Sampler`` de Qiskit Runtime.

source: When you initialize the ``Sampler``, you’ll need to pass in the backend you previously selected as the target device (or simulator), using the ``session`` parameter. This automatically opens a session for that backend. We will talk more about session in a later section.
es_un: Cuando inicializas el ``Sampler``, deberás pasar el backend que seleccionaste previamente como el dispositivo de destino (o simulador), utilizando el parámetro ``session``. Esto abre automáticamente una sesión para ese backend. Hablaremos más sobre la sesión en una sección posterior.

source: 4. Invoke the Sampler and get results
es_un: 4. Invocar el Sampler y obtener resultados

source: You can then invoke the ``run()`` method to calculate expectation values for the input circuit(s) and observable(s).
es_un: Luego puedes invocar al método ``run()`` para calcular los valores esperados para los circuitos de entrada y los observables.

source: Options
es_un: Opciones

source: Primitives come with a number of options that are grouped into different categories. Commonly used options, such as ``resilience_level``, are at the first level.
es_un: Las primitivas vienen con una serie de opciones que se agrupan en diferentes categorías. Las opciones de uso común, como ``resilience_level``, se encuentran en el primer nivel.

source: You can use the `Options <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`__ class to specify different options.
es_un: Puedes utilizar la clase `Options <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`__ para especificar distintas opciones.

source: In the example below, we create an instance of the ``Options`` class. ``optimization_level`` is a first level option and can be passed as an input parameter. Options related to the execution environment are passed using the ``environment`` parameter.
es_un: En el siguiente ejemplo, creamos una instancia de la clase ``Options``. ``optimization_level`` es una opción de primer nivel y se puede pasar como un parámetro de entrada. Las opciones relacionadas con el entorno de ejecución se pasan mediante el parámetro ``environment``.

source: ``Options`` supports auto-complete. Once you create an instance of the ``Options`` class, you can use auto-complete to see what options are available. If you choose one of the categories, you can use auto-complete again to see what options are available under that category.
es_un: ``Options`` soporta el autocompletado. Una vez que creas una instancia de la clase ``Options``, puedes usar la función de autocompletar para ver qué opciones están disponibles. Si eliges una de las categorías, puedes usar la función de autocompletar nuevamente para ver qué opciones están disponibles en esa categoría.

source: When creating an instance of the ``Sampler`` class, you can pass in the ``options`` you just created. Those options will then be applied when you use ``run()`` to perform the calculation.
es_un: Al crear una instancia de la clase ``Sampler``, puedes pasar las ``options`` que acabas de crear. Esas opciones se aplicarán cuando uses ``run()`` para realizar el cálculo.

source: You can also pass in options via the ``run()`` method. This will overwrite the options you specified when creating the ``Sampler`` instance for that particular execution.
es_un: También puedes pasar opciones a través del método ``run()``. Esto sobrescribirá las opciones que especificaste al crear la instancia de ``Sampler`` para esa ejecución en particular.

source: Since most users will only overwrite a handful of options at the job level, it is not necessary to specify the category the options are in. The code below, for example, specifies ``shots=1024`` instead of ``execution={"shots": 1024}`` (which is also valid).
es_un: Dado que la mayoría de los usuarios solo sobrescribirán un puñado de opciones a nivel del trabajo (job), no es necesario especificar la categoría en la que se encuentran las opciones. El siguiente código, por ejemplo, especifica ``shots=1024`` en lugar de ``execution={"shots": 1024}`` (que también es válido).

source: Error suppression and mitigation
es_un: Supresión y mitigación de errores

source: ``optimization_level`` and ``resilience_level`` are used to configure error suppress and mitigation.
es_un: ``optimization_level`` y ``resilience_level`` se utilizan para configurar la supresión y mitigación de errores.

source: ``Sampler`` supports ``optimization_level`` 0-3 and ``resilience_level`` 0-1.
es_un: ``Sampler`` admite ``optimization_level`` 0-3 y ``resilience_level`` 0-1.

source: Session
es_un: Sesión

source: A Qiskit Runtime *session* allows you to group a collection of iterative calls to the quantum computer. A session is started when the first job within the session is started. As long as the session is active, subsequent jobs within the session are prioritized by the scheduler to minimize artificial delay within an iterative algorithm. Data used within a session, such as transpiled circuits, is also cached to avoid unnecessary overhead.
es_un: Una *sesión* de Qiskit Runtime te permite agrupar una colección de llamadas iterativas a la computadora cuántica. Una sesión se inicia cuando se inicia el primer trabajo (job) dentro de la sesión. Siempre que la sesión esté activa, el planificador prioriza los trabajos posteriores dentro de la sesión para minimizar el retraso artificial dentro de un algoritmo iterativo. Los datos utilizados dentro de una sesión, como los circuitos transpilados, también se almacenan en caché para evitar una sobrecarga innecesaria.

source: Session timing
es_un: Duración de la sesión

source: When a session is started, it is assigned a maximum session timeout value. You can set this value by using the ``max_time`` parameter.
es_un: Cuando se inicia una sesión, se le asigna un valor máximo de tiempo de espera de sesión. Puedes establecer este valor utilizando el parámetro ``max_time``.

source: If you don’t specify a timeout value, it is set to the initial job’s maximum execution time and is the smaller of these values:
es_un: Si no especificas un valor de tiempo de espera, se establece en el tiempo de ejecución máximo del trabajo inicial y es el menor de estos valores:

source: The system limit which can be found `here <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/faqs/max_execution_time.html>`__.
es_un: El límite del sistema que se puede encontrar `aquí <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/faqs/max_execution_time.html>`__.

source: The max_execution_time defined by the program.
es_un: El max_execution_time definido por el programa.

source: After this time limit is reached, the session is permanently closed.
es_un: Una vez alcanzado este límite de tiempo, la sesión se cierra de forma permanente.

source: A session also has an *interactive* timeout value. If there are no session jobs queued within that window, the session is temporarily deactivated and normal job selection resumes. This interactive timeout value is set by the system and cannot be overwritten.
es_un: Una sesión también tiene un valor de tiempo de espera *interactivo*. Si no hay trabajos (jobs) de sesión encolados dentro de esa ventana, la sesión se desactiva temporalmente y se reanuda la selección normal de trabajos. Este valor de tiempo de espera interactivo lo establece el sistema y no se puede sobrescribir.

source: Invoking Sampler.run within a session
es_un: Invocar Sampler.run dentro de una sesión

source: You can create a Qiskit Runtime session using the context manager (``with ...:``), which automatically opens and closes the session for you. You can invoke ``Sampler.run`` one or more times within a session:
es_un: Puedes crear una sesión de Qiskit Runtime usando el administrador de contexto (``with ...:``), que automáticamente abre y cierra la sesión por ti. Puedes invocar ``Sampler.run`` una o más veces dentro de una sesión:

source: Invoke multiple primitives in a session
es_un: Invocar múltiples primitivas en una sesión

source: You are not restricted to a single primitive function within a session. In this section we will show you an example of using multiple primitives.
es_un: No estás restringido a una sola función primitiva dentro de una sesión. En esta sección te mostraremos un ejemplo del uso de múltiples primitivas.

source: First we prepare a circuit and an observale for the ``Estimator`` primitive.
es_un: Primero preparamos un circuito y un observable para la primitiva ``Estimator``.

source: The example below shows how you can create both an instance of the ``Sampler`` class and one of the ``Estimator`` class and invoke their ``run()`` methods within a session.
es_un: El siguiente ejemplo muestra cómo puedes crear tanto una instancia de la clase ``Sampler`` como una de la clase ``Estimator`` e invocar sus métodos ``run()`` dentro de una sesión.

source: The calls can also be asynchronous. You don’t need to wait for the result of a previous job before submitting another one.
es_un: Las llamadas también pueden ser asíncronas. No necesitas esperar el resultado de un trabajo anterior para enviar otro.

source: Summary
es_un: Resumen

source: Below is a quick recap of using Qiskit Runtime primitives, options, and session.
es_un: A continuación se muestra un resumen rápido del uso de las primitivas, las opciones y la sesión de Qiskit Runtime.

source: Reference
es_un: Referencia

source: You can find more details about the ``Sampler`` methods in the `Sampler API reference <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Sampler.html#qiskit_ibm_runtime.Sampler>`__.
es_un: Puedes encontrar más detalles sobre los métodos de ``Sampler`` en la `referencia de la API de Sampler <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Sampler.html#qiskit_ibm_runtime.Sampler>`__.

source: And all the available options in the `Options API reference <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`__.
es_un: Y todas las opciones disponibles en la `referencia de la API de Options <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`__.
