Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/qka.po
Languages: es_un, ja_jp, ko_kr

source: This page was generated from `docs/tutorials/qka.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/qka.ipynb`__.
ja_jp: このページは `docs/tutorials/qka.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/qka.ipynb`__ 에서 생성되었다.

source: Quantum Kernel Alignment with Qiskit Runtime
es_un: Alineación del Kernel Cuántico con Qiskit Runtime
ja_jp: Qiskit Runtime による量子カーネルアラインメント
ko_kr: Qiskit Runtime을 이용한 양자 커널 정렬

source: **Classification with Support Vector Machines**\ Classification problems are widespread in machine learning applications. Examples include credit card risk, handwriting recognition, and medical diagnosis. One approach to tackling classification problems is the support vector machine (SVM) [1,2]. This supervised learning algorithm uses labeled data samples to train a model that can predict to which class a test sample belongs. It does this by finding a separating hyperplane maximizing the margin between data classes. Often, data is not linearly separable in the original space. In these cases, the kernel trick is used to implicitly encode a transformation of the data into a higher-dimensional feature space, through the inner product between pairs of data points, where the data may become separable.
es_un: **Clasificación con Máquinas de Vectores de Soporte**\ Los problemas de clasificación están muy extendidos en las aplicaciones de machine learning. Los ejemplos incluyen riesgo de tarjeta de crédito, reconocimiento de escritura a mano y diagnóstico médico. Un enfoque para abordar los problemas de clasificación es la máquina de vectores de soporte (support vector machine, SVM) [1,2]. Este algoritmo de aprendizaje supervisado utiliza muestras de datos etiquetados para entrenar un modelo que puede predecir a qué clase pertenece una muestra de prueba. Lo hace encontrando un hiperplano de separación que maximiza el margen entre las clases de datos. A menudo, los datos no se pueden separar linealmente en el espacio original. En estos casos, el truco del kernel se usa para codificar implícitamente una transformación de los datos en un espacio de características de mayor dimensión, a través del producto interno entre pares de puntos de datos, donde los datos pueden volverse separables.
ja_jp: **サポート・ベクトル・マシンによる分類**\ 分類の問題は、機械学習アプリケーションに広く適用されています。 例えば、クレジット・カードのリスク、手書き文字認識、医療診断などが挙げられます。 分類問題に対処するための 1 つのアプローチは、サポートベクターマシン ( SVM) [1,2] です。 この教師あり学習アルゴリズムは、ラベル付きデータ・サンプルを使用して、テスト・サンプルがどのクラスに属するかを予測できるモデルをトレーニングします。 これは、データクラス間のマージンを最大にする分離超平面を見つけることによって行われます。 多くの場合、データは元の空間では線形分離可能ではありません。 このような場合、カーネル・トリックは、データが分離できるようになるデータ・ポイントのペア間の内積を通して、データをより高次元の特徴空間に変換することを暗黙的に符号化するために使用されます。
ko_kr: **서포트 벡터 머신을 이용한 분류**\ 분류 문제는 신용 위험도 분류, 필기 인식, 의료 진단 등을 포함하는 기계 학습 분야에서 널리 사용된다. 서포트 벡터 머신(Support Vector Machine, SVM) [1,2]은 분류 문제를 위한 접근 방식 중 하나이다. 이 지도 학습 알고리즘은 라벨링된 데이터 샘플을 사용하여 테스트 샘플이 속해있는 클래스를 분류하기 위한 모델을 학습시킨다. 이 과정은 데이터 클래스 간의 차이를 극대화하는 초평면을 찾는 것으로 이루어진다. 많은 경우에 데이터가 속하는 원래의 공간에서는 데이터를 선형적으로 분리시킬 수 없다. 이를 해결하기 위한 커널은 각각의 데이터 포인트 쌍끼리의 내적을 취함으로써 데이터를 분리 가능한 더 높은 차원의 특성 공간으로 변환하는 트릭을 사용한다.

source: **Quantum Kernels**\ Quantum computers can be used to encode classical data in a quantum-enhanced feature space. In 2019, IBM introduced an algorithm called the quantum kernel estimator (QKE) for computing quantum kernels [3]. This algorithm uses quantum circuits with data provided classically and offers an efficient way to evaluate inner products between data in a quantum feature space. For two data samples :math:`\theta` and :math:`\theta'`, the kernel matrix is given as
es_un: **Kernels Cuánticos**\ Las computadoras cuánticas se pueden usar para codificar datos clásicos en un espacio de funciones mejoradas cuánticamente. En 2019, IBM introdujo un algoritmo llamado estimador de kernel cuántico (quantum kernel estimator, QKE) para calcular kernels cuánticos [3]. Este algoritmo utiliza circuitos cuánticos con datos proporcionados de forma clásica y ofrece una forma eficiente de evaluar productos internos entre datos en un espacio de características cuánticas. Para dos muestras de datos :math:`\theta` y :math:`\theta'`, la matriz del kernel está dada como
ja_jp: **Quantum Kernels**\ 量子コンピューターは、古典データを量子的に拡張された特徴空間に符号化するために使用することができます。 2019年に IBM は量子カーネルを計算するための量子カーネル推定器 (quantum kernel estimator、QKE ) と呼ばれるアルゴリズムを発表しました [3] 。 このアルゴリズムは、古典的に提供されたデータを持つ量子回路を使用し、量子特徴空間におけるデータ間の内積を効率的に評価する方法を提供します。 :math:`\theta` と :math:`\theta'` の 2 つのデータサンプルについて、カーネル行列は以下のように与えられます。
ko_kr: **양자 커널** 양자 컴퓨터는 양자적으로 효율화된 특성 공간에서 고전적 데이터를 인코딩 하는데 사용될 수 있다. 2019년, IBM은 양자 커널을 계산하기 위한 양자 커널 추정기 (Quantum Kernal Estimator, QKE) 알고리즘을 소개했다 [3]. 이 알고리즘은 양자 회로를 사용하여 양자 특성 공간에서 제시된 데이터간의 내적을 계산하기 위한 효율적인 방법을 제공한다. 두 개의 데이터 샘플 :math:`\theta` 와 :math:`\theta'` 에 대해서, 커널 행렬은 다음과 같이 주어진다.

source: where :math:`U(\theta)` prepares the quantum feature state. Quantum kernels used in a classification framework inherit the convex optimization program of the SVM and avoid common limitations of variational quantum classifiers. A key observation of this paper was that a necessary condition for a computational advantage requires quantum circuits for the kernel that are hard to simulate classically. More recently, IBM proved that quantum kernels can offer superpolynomial speedups over any classical learner on a learning problem based on the hardness of the discrete logarithm problem [4]. This means that quantum kernels can someday offer quantum advantage on suitable problems.
es_un: donde :math:`U(\theta)` prepara el estado de la característica cuántica. Los kernels cuánticos utilizados en un framework de clasificación heredan el programa de optimización convexa de SVM y evitan las limitaciones comunes de los clasificadores cuánticos variacionales. Una observación clave de este artículo fue que una condición necesaria para una ventaja computacional requiere circuitos cuánticos para el kernel que son difíciles de simular de forma clásica. Más recientemente, IBM demostró que los kernels cuánticos pueden ofrecer aceleraciones superpolinómicas sobre cualquier aprendiz clásico en un problema de aprendizaje basado en la dificultad del problema del logaritmo discreto [4]. Esto significa que los kernels cuánticos algún día pueden ofrecer una ventaja cuántica en los problemas adecuados.
ja_jp: ここで、 :math:`U(\theta)` は量子特徴量の状態を表します。 分類フレームワークで使用される量子カーネルは、 SVM の凸最適化プログラムを継承し、変分量子分類器に共通する制約を回避します。 この論文では、量子カーネルが計算量的に優位に立つための条件として、古典的にシミュレートするのが難しい量子回路が必要であることが示されています。 さらに最近では、IBMは量子カーネルが、離散対数問題の困難さに基づいた学習問題に関して、古典な学習器よりも超多項式高速化を実現できることを証明しました [4] 。 このことは、量子カーネルがいつか、適切な問題に量子的な利点を提供することを意味しています。
ko_kr: 이 때 :math:`U(\theta)` 는 양자 특성 상태를 나타낸다. 분류 프레임워크에서 사용되는 양자 커널은 SVM의 컨벡스 최적화 기법을 이어받았고, 다양한 양자 분류기의 공통된 제한을 피할 수 있다. 이 논문의 핵심적인 관찰은 계산적 이점을 위한 필요 조건으로 고전적으로는 실험하기 어려운 커널에 대한 양자 회로가 요구된다는 것이었다. 보다 최근에, IBM은 어려운 이산 로그 문제 [4]를 기반으로 하는 학습 문제에 대해 양자 커널이 고전적인 학습 기법에 비해 초다항적인 속도 향상을 제공할 수 있다는 것을 입증하였다. 이는 언젠가 적절한 문제들에 있어서 양자 커널이 양자 이점을 제공할 수 있다는 것을 의미한다.

source: **Quantum Kernels that Exploit Structure in Data**\ An important approach in the search for practical quantum advantage in machine learning is to identify quantum kernels for learning problems that have underlying structure in the data. We’ve taken a step in this direction in our recent paper [5], where we introduced a broad class of quantum kernels that exploit group structure in data. Examples of learning problems for data with group structure could include learning permutations or classifying translations. We call this new class of kernels *covariant quantum kernels* as they are related to covariant quantum measurements. The quantum feature map is defined by a unitary representation :math:`D(\theta)` of a group :math:`G` for some element :math:`\theta \in G`, and a fiducial reference state :math:`\lvert\psi\rangle = V\lvert0^n\rangle` prepared by a unitary circuit :math:`V`. The kernel matrix is given as
es_un: **Kernels Cuánticos que Explotan la Estructura de los Datos**\ Un enfoque importante en la búsqueda de una ventaja cuántica práctica en el machine learning es identificar los kernels cuánticos para problemas de aprendizaje que tienen una estructura subyacente en los datos. Hemos dado un paso en esta dirección en nuestro artículo reciente [5], donde presentamos una amplia clase de kernels cuánticos que explotan la estructura de grupo en los datos. Los ejemplos de problemas de aprendizaje para datos con estructura de grupo podrían incluir el aprendizaje de permutaciones o la clasificación de traducciones. Llamamos a esta nueva clase de núcleos *kernels cuánticos covariantes* ya que están relacionados con mediciones cuánticas covariantes. El mapa de características cuánticas está definido por una representación unitaria :math:`D(\theta)` de un grupo :math:`G` para algún elemento :math:`\theta \in G`, y un estado de referencia fiducial :math:`\lvert\psi\rangle = V\lvert0^n\rangle` preparado por un circuito unitario :math:`V`. La matriz del kernel está dada como
ja_jp: **データの構造を利用する量子カーネル**\ 機械学習で実用的な量子の利点を探すための重要なアプローチは、データの基礎となる構造を持つ問題を学習するための量子カーネルを特定することです。私たちは、最近の論文 [5] でこの方向に一歩踏み出しました。そこでは、データの群構造を利用する幅広いクラスの量子カーネルを紹介しました。 群構造を持つデータの学習問題の例には、順列の学習や翻訳の分類が含まれます。 この新しいクラスのカーネルは、共変量子測定に関連しているため、*共変量子カーネル* と呼ばれます。量子特徴マップは、ある要素 :math:`\theta \in G` のグループ :math:`G` のユニタリー表現 :math:`D(\theta)` と、ユニタリー回路 :math:`V` によって作成された基準参照状態 :math:`\lvert\psi\rangle = V\lvert0^n\rangle` によって定義されます。カーネル行列は次のように与えられます。
ko_kr: **데이터의 구조를 이용하는 양자 커널** 기계 학습 분야에서 실용적인 양자 이점을 찾아내기 위한 중요한 접근법은 내부적으로 구조를 갖는 데이터를 학습하는 문제에 대한 양자 커널을 찾아내는 것이다. 우리는 최근 논문에서 [5], 데이터의 군 구조를 찾아내는 양자 커널의 개괄적인 클래스를 소개함으로써 이 방향으로의 진전을 이룬 바 있다. 군 구조를 갖는 데이터 학습 문제의 예로서, 순열 학습 문제나 번역 분류 문제를 들 수 있다. 우리는 이러한 새 커널 클래스를 *공변 양자 커널 (covariant quantum kernels)* 이라고 부르는데, 이 클래스가 공변 양자 측정과 관계되어 있기 때문이다. 군 :math:`G` 의 임의의 원소 :math:`\theta \in G` 에 대해, 양자 특성맵은 단일 표현 :math:`D(\theta)`으로 정의되며, 단일 회로 :math:`V` 로 기준 참조 상태 :math:`\vert\psi\rangle = V\vert0^n\rangle` 를 준비할 수 있다. 커널 행렬은 다음과 같이 주어진다.

source: In general, the choice of the fiducial state is not known *a priori* and can significantly impact the performance of the classifier. Here, we use a method called quantum kernel alignment (QKA) to find a good fiducial state for a given group.
es_un: En general, la elección del estado fiducial no se conoce *a priori* y puede afectar significativamente el rendimiento del clasificador. Aquí, usamos un método llamado alineación del kernel cuántico (quantum kernel alignment, QKA) para encontrar un buen estado fiducial para un grupo determinado.
ja_jp: 基準状態に何を選ぶかが分類器のパフォーマンスに大きな影響を与えることがありますが、*先験的*に何を選ぶべきかは一般に知られていません。ここでは、量子カーネルアライメント (quantum kernel alignment、QKA) と呼ばれる手法を使用して、与えられたグループに適した基準の状態を探します。
ko_kr: 일반적으로, 기준 상태는 *연역적으로(priori)* 선택하는 방법이 알려져 있지 않으며, 선택에 따라 분류기의 성능에 큰 영향을 줄 수 있다. 여기서, 우리는 양자 커널 정렬 (Quantum Kernel Alignment, QKA) 이라 불리는 방법을 사용하여 주어진 군에 대한 좋은 기준 상태를 찾는다.

source: **Aligning Quantum Kernels on a Dataset**\ In practice, SVMs require a choice of the kernel function. Sometimes, symmetries in the data can inform this selection, other times it is chosen in an ad hoc manner. Kernel alignment is one approach to learning a kernel on a given dataset by iteratively adapting it to have high similarity to a target kernel informed from the underlying data distribution [6]. As a result, the SVM with an aligned kernel will likely generalize better to new data than with an unaligned kernel. Using this concept, we introduced in [5] an algorithm for quantum kernel alignment, which provides a way to learn a quantum kernel from a family of kernels. Specifically, the algorithm optimizes the parameters in a quantum circuit to maximize the alignment of a kernel while converging to the maximum SVM margin. In the context of covariant quantum kernels, we extend Eq. :math:`(1)` to
es_un: **Alineación de Kernels Cuánticos en un Conjunto de Datos**\ En la práctica, las SVMs requieren una elección de la función del kernel. A veces, las simetrías en los datos pueden informar esta selección, otras veces se elige de manera ad hoc. La alineación del kernel es un enfoque para aprender un kernel en un conjunto de datos determinado al adaptarlo iterativamente para que tenga una gran similitud con un kernel objetivo informado a partir de la distribución de datos subyacente [6]. Como resultado, la SVM con un kernel alineado probablemente generalizará mejor los datos nuevos que con un kernel no alineado. Usando este concepto, presentamos en [5] un algoritmo para la alineación del kernel cuántico, que proporciona una forma de aprender un kernel cuántico de una familia de kernels. Específicamente, el algoritmo optimiza los parámetros en un circuito cuántico para maximizar la alineación de un kernel mientras converge al margen máximo de la SVM. En el contexto de los kernels cuánticos covariantes, extendemos la ecuación :math:`(1)` a
ja_jp: **データセットでの量子カーネルのアライン**\ 実際に、SVMではカーネル関数を選択する必要があります。 データの対称性により選ぶ場合もあれば、アドホックな方法で選択する場合もあります。 カーネルアラインメントは、与えらえれたデータセットでカーネルを学習するためのアプローチでの一つで、元になるデータ分布から得られる目標のカーネルとの類似性が高くなるように繰り返し適応させる手法です [6] 。 その結果、アラインされたカーネルを使用したSVMは、アラインされていないカーネルを使用した場合よりも、新しいデータに対してより良く汎化される可能性が高くなります。 この概念を使用して、[5] で、カーネルのファミリーから量子カーネルを学習する方法を提供する、量子カーネルアライメントのアルゴリズムを導入しました。 具体的には、アルゴリズムは量子回路のパラメーターを最適化して、SVMマージンを最大に収束しながらカーネルのアライメントを最大化します。共変量子カーネルのコンテキストでは、式 :math:`(1)` を次のように拡張します。
ko_kr: **데이터셋에 양자 커널 맞추기** 실제 사용에서, SVM은 커널 함수를 요구한다. 때때로 데이터의 대칭으로부터 이 함수의 선택에 대한 정보를 얻을 수 있지만, 그렇지 않을 경우에는 특별 방식으로 선택하여야 한다. 커널 정렬은 주어진 데이터 셋에 대해서 내부적인 데이터 분포로 정해진 목표 커널과의 유사도를 높힐 수 있도록 순차적으로 적응하는 방식을 통해 커널을 선택하는 접근법이다 [6]. 그 결과로, 정렬된 커널을 사용하는 SVM은 정렬되지 않은 커널에 비해 새로운 데이터를 더 잘 예측할 수 있다. 이 개념을 사용하여 우리는 [5]에서, 하나의 커널 집합으로부터 양자 커널을 구하는 양자 커널 정렬 알고리즘을 소개하였다. 특히, 이 알고리즘은 양자 회로의 파라미터를 최적화함으로써 커널의 정렬을 극대화할 수 있고, 이는 곧 SVM에서 차이를 극대화하는 결과로 이어진다. 공변 양자 커널의 관점에서 우리는 식 :math:`(1)` 을 다음과 같이 확장한다.

source: and use QKA to learn a good fiducial state parametrized by :math:`\lambda` for a given group.
es_un: y usamos QKA para aprender un buen estado fiducial parametrizado por :math:`\lambda` para un grupo determinado.
ja_jp: QKA を使用して、与えられた所定のグループに対して、 :math:`\lambda` をパラメーターとする適切な基準状態を把握することができます。
ko_kr: 그리고 주어진 군에 대하여 :math:`\lambda` 매개변수로 표시되는 좋은 기준 상태를 학습하기 위해 QKA를 사용한다.

source: **Covariant Quantum Kernels on a Specific Learning Problem**\ Let’s try out QKA on a learning problem. In the following, we’ll consider a binary classification problem we call *labeling cosets with error* [5]. In this problem, we will use a group and a subgroup to form two cosets, which will represent our data classes. We take the group :math:`G = SU(2)^{\otimes n}` for :math:`n` qubits, which is the special unitary group of :math:`2\times2` matrices and has wide applicability in nature, for example, the Standard Model of particle physics and in many condensed matter systems. We take the graph-stabilizer subgroup :math:`S_{\mathrm{graph}} \in G` with :math:`S_{\mathrm{graph}} = \langle \{ X_i \otimes_{k:(k,i) \in \mathcal{E}} Z_k \}_{i \in \mathcal{V}} \rangle` for a graph :math:`(\mathcal{E},\mathcal{V})` with edges :math:`\mathcal{E}` and vertices :math:`\mathcal{V}`. Note that the stabilizers fix a stabilizer state such that :math:`D_s \lvert \psi\rangle = \lvert \psi\rangle`. This observation will be useful a bit later.
es_un: **Kernels Cuánticos Covariantes en un Problema de Aprendizaje Específico**\ Probemos QKA en un problema de aprendizaje. A continuación, consideraremos un problema de clasificación binaria que llamamos *etiquetado de clases laterales con error* [5]. En este problema, usaremos un grupo y un subgrupo para formar dos clases laterales, que representarán nuestras clases de datos. Tomamos el grupo :math:`G = SU(2)^{\otimes n}` para :math:`n` qubits, que es el grupo unitario especial de :math:`2\times2` matrices y tiene una amplia aplicabilidad en la naturaleza, por ejemplo, el Modelo Estándar de física de partículas y en muchos sistemas de materia condensada. Tomamos el subgrupo estabilizador de grafos :math:`S_{\mathrm{graph}} \in G` con :math:`S_{\mathrm{graph}} = \langle \{ X_i \otimes_{k:(k,i) \in \mathcal{E}} Z_k \}_{i \in \mathcal{V}} \rangle` para un grafo :math:`(\mathcal{E},\mathcal{V})` con aristas :math:`\mathcal{E}` y vértices :math:`\mathcal{V}`. Ten en cuenta que los estabilizadores fijan un estado estabilizador tal que :math:`D_s \lvert \psi\rangle = \lvert \psi\rangle`. Esta observación será útil un poco más adelante.
ja_jp: **特定の学習問題に関する共変量子カーネル**\ 学習問題に関するQKAを試してみましょう。 以下では、*剰余類へのエラーラベル付け* [5]と呼ばれるバイナリ分類の問題について検討します。 この問題では、群と部分群を使用して、データクラスを表す2つの剰余類を形成します。 グループ :math:`G = SU(2)^{\otimes n}` を :math:`n` 量子ビットと見なします。これは、 :math:`2\times2` 行列の特殊ユニタリー群であり、素粒子物理学の標準モデルや多くの凝縮系など、自然界で幅広い適用されてます。 ここでは、辺 :math:`\mathcal{E}` と頂点 :math:`\mathcal{V}` を持つグラフ :math:`(\mathcal{E},\mathcal{V})` を :math:`S_{\mathrm{graph}} = \langle \{ X_i \otimes_{k:(k,i) \in \mathcal{E}} Z_k \}_{i \in \mathcal{V}} \rangle` として持つグラフスタビライザー部分群 :math:`S_{\mathrm{graph}} \in G` を取ります。スタビライザーは :math:`D_s \lvert \psi\rangle = \lvert \psi\rangle` のようにスタビライザー状態を固定することに注意してください。 この観察は少し後で役に立ちます。
ko_kr: **특정 학습 문제에 대한 공변 양자 커널** 학습 문제에 QKA를 적용해보자. 앞으로의 문제에서, 우리는 *오류가 있는 잉여류 라벨링* [5] 이라고 불리는 이항 분류 문제를 다룰 것이다. 이 문제에서, 우리는 데이터 클래스를 나타내는 두 개의 잉여류를 만들기 위한 하나의 군과 하나의 부분군을 사용할 것이다. :math:`n` 큐비트을 나타내기 위해 군 :math:`G = SU(2)^{\otimes n}` 을 사용하는데, 이 군은 :math:`2\times2` 행렬의 특별한 유니터리 군이며, 입자 물리학의 표준모형이나 많은 응집 물질계와 같은 다양한 분야에 적용될 수 있다. 우리는 :math:`\mathcal{E}` 를 간선으로, :math:`\mathcal{V}` 를 정점으로 갖는 그래프 :math:`(\mathcal{E},\mathcal{V})` 에 대해, 그래프 스태빌라이저로 :math:`S_{\mathrm{graph}} = \langle \{ X_i \otimes_{k:(k,i) \in \mathcal{E}} Z_k \}_{i \in \mathcal{V}} \rangle` 인 부분군 :math:`S_{\mathrm{graph}} \in G` 을 사용한다. 스태빌라이저는 :math:`D_s \vert\psi\rangle = \vert\psi\rangle` 와 같은 안정 상태를 고정한다는 것을 기억하자. 이 사실은 조금 후에 유용하게 사용될 것이다.

source: To generate the dataset, we write the rotations of the group as :math:`D(\theta_1, \theta_2, 0)=\exp(i \theta_1 X) \exp(i \theta_2 Z) \in SU(2)`, so that each qubit is parametrized by the first two Euler angles (the third we set to zero). Then, we draw randomly two sets of angles :math:`\mathbf{\theta}_\pm \in [-\pi/4, \pi/4]^{2n}` for the :math:`n`-qubit problem. From these two sets, we construct a binary classification problem by forming two left-cosets (representing the two classes) with those angles, :math:`C_\pm = D(\mathbf{\theta}_\pm) S_{\mathrm{graph}}` where :math:`D(\mathbf{\theta}_\pm) = \otimes_{k=1}^n D(\theta_\pm^{2k-1}, \theta_\pm^{2k}, 0)`. Note that the elements of the cosets can again be written in terms of Euler angles. We build training and testing sets by randomly drawing elements from :math:`C_\pm` such that the dataset has samples :math:`i=1,...,m` containing the first two Euler angles for each qubit :math:`\mathbf{\theta}_{y_i} = (\theta_{y_i}^{1}, \theta_{y_i}^{2}, \theta_{y_i}^{3}, \theta_{y_i}^{4}, ..., \theta_{y_i}^{2n-1}, \theta_{y_i}^{2n})` and labels :math:`y_i \in \{-1,1\}` that indicate to which coset a sample belongs.
es_un: Para generar el conjunto de datos, escribimos las rotaciones del grupo como :math:`D(\theta_1, \theta_2, 0)=\exp(i \theta_1 X) \exp(i \theta_2 Z) \in SU(2)`, de modo que cada qubit esté parametrizado por los dos primeros ángulos de Euler (el tercero lo ponemos en cero). Luego, dibujamos aleatoriamente dos conjuntos de ángulos :math:`\mathbf{\theta}_\pm \in [-\pi/4, \pi/4]^{2n}` para el problema de :math:`n` qubits A partir de estos dos conjuntos, construimos un problema de clasificación binaria formando dos clases laterales izquierdas (que representan las dos clases) con esos ángulos, :math:`C_\pm = D(\mathbf{\theta}_\pm) S_{\mathrm{graph}}` donde :math:`D(\mathbf{\theta}_\pm) = \otimes_{k=1}^n D(\theta_\pm^{2k-1}, \theta_\pm^{2k}, 0)`. Ten en cuenta que los elementos de las clases laterales se pueden escribir nuevamente en términos de los ángulos de Euler. Construimos conjuntos de entrenamiento y prueba dibujando elementos al azar de :math:`C_\pm` de modo que el conjunto de datos tenga muestras :math:`i=1,...,m` que contengan los dos primeros ángulos de Euler para cada qubit :math:`\mathbf{\theta}_{y_i} = (\theta_{y_i}^{1}, \theta_{y_i}^{2}, \theta_{y_i}^{3}, \theta_{y_i}^{4}, ..., \theta_{y_i}^{2n-1}, \theta_{y_i}^{2n})` y etiquetas :math:`y_i \in \{-1,1\}` que indican a qué clase lateral pertenece una muestra.
ja_jp: データセットを生成するために、グループの回転を :math:`D(\theta_1, \theta_2, 0)=\exp(i \theta_1 X) \exp(i \theta_2 Z) \in SU(2)` として記述し、各量子ビットが最初の2つのオイラー角（3番目はゼロに設定）によってパラメーター化されるようにします。 次に、 :math:`n` 量子ビット問題に対して2セットの角度 :math:`\mathbf{\theta}_\pm \in [-\pi/4, \pi/4]^{2n}` をランダムに描画します。 これらの2つのセットから、これらの角度 :math:`C_\pm = D(\mathbf{\theta}_\pm) S_{\mathrm{graph}}` （ :math:`D(\mathbf{\theta}_\pm) = \otimes_{k=1}^n D(\theta_\pm^{2k-1}` ）で2つの左剰余類（2つのクラスを表す）を形成することにより、二項分類問題を構築します。剰余類の要素は、オイラー角で表すことができます。 データセットに各量子ビット :math:`\mathbf{\theta}_{y_i} = (\theta_{y_i}^{1}, \theta_{y_i}^{2}, \theta_{y_i}^{3}, \theta_{y_i}^{4}, ..., \theta_{y_i}^{2n-1}, \theta_{y_i}^{2n})` の最初の2つのオイラー角とどの剰余類を示すラベル :math:`y_i \in \{-1,1\}` を含むサンプル :math:`i=1,...,m` が含まれるように、 :math:`C_\pm` から要素をランダムに描画することにより、トレーニングセットとテストセットを構築します。
ko_kr: 데이터셋을 만들기 위해, 군의 회전을 :math:`D(\theta_1, \theta_2, 0)=\exp(i \theta_1 X) \exp(i \theta_2 Z) \in SU(2)` 과 같이 표현하여 각각의 큐비트를 첫 두 개의 오일러 각(세번째는 0으로 둔다)으로 매개화할 것이다. 그리고 :math:`n`-큐비트 문제에 대하여 랜덤하게 두 개의 각 집합 :math:`\mathbf{\theta}_\pm \in [-\pi/4, \pi/4]^{2n}` 를 뽑는다. 이 두 집합으로부터, :math:`D(\mathbf{\theta}_\pm) = \otimes_{k=1}^n D(\theta_\pm^{2k-1}, \theta_\pm^{2k}, 0)` 인 (두 개의 클래스를 나타내는) 두 개의 좌잉여류 :math:`C_\pm = D(\mathbf{\theta}_\pm) S_{\mathrm{graph}}` 를 만듦으로써 이항 분류 문제를 유도해낼 수 있다. 잉여류의 각 원소는 오일러 각으로 표현할 수 있음에 유의하라. 각각의 큐비트에 대해서 첫 두 개의 오일러 각을 포함하고, 각 샘플이 어떤 잉여류에 속하는지를 라벨 :math:`y_i \in \{-1,1\}` 로 표시하는 :math:`i=1,...,m` 개의 샘플 데이터셋 :math:`\mathbf{\theta}_{y_i} = (\theta_{y_i}^{1}, \theta_{y_i}^{2}, \theta_{y_i}^{3}, \theta_{y_i}^{4}, ..., \theta_{y_i}^{2n-1}, \theta_{y_i}^{2n})` 을 :math:`C_\pm` 으로부터 랜덤하게 추출함으로써 훈련용 데이터셋과 테스트용 데이터셋을 만들 수 있다.
