Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/qpe_with_sampler.po
Languages: es_un, ja_jp, ta

source: In this tutorial, you have created a parameterized QPE circuit, run it using the Sampler primitive, analyzed the results, and obtained solutions that are closed to the ideal solutions. You can see that the Sampler primitive makes running parameterized circuits very easy.
es_un: En este tutorial, creaste un circuito QPE parametrizado, lo ejecutaste con la primitiva Sampler, analizaste los resultados y obtuviste soluciones cercanas a las soluciones ideales. Puedes ver que la primitiva Sampler facilita mucho la ejecución de circuitos parametrizados.
ja_jp: このチュートリアルでは、パラメーター化されたQPE回路を作成し、Sampler primitiveを使って実行し、結果を解析して、理想的な解に近い解を得ました。Sampler primitiveを使うと、パラメーター化された回路を非常に簡単に実行できることがおわかりいただけると思います。
ta: இந்த டுடோரியலில், நீங்கள் ஒரு அளவுரு QPE சர்க்யூட்டை உருவாக்கியுள்ளீர்கள், சாம்ப்லர் ப்ரிமிட்டிவ் பயன்படுத்தி அதை இயக்கி, முடிவுகளை பகுப்பாய்வு செய்து, சிறந்த தீர்வுகளுக்கு மூடப்பட்ட தீர்வுகளைப் பெற்றுள்ளீர்கள். சாம்ப்லர் ப்ரிமிட்டிவ், அளவுருப்படுத்தப்பட்ட சுற்றுகளை இயக்குவதை மிகவும் எளிதாக்குகிறது என்பதை நீங்கள் பார்க்கலாம்.

source: References
es_un: Referencias
ja_jp: 参考文献
ta: குறிப்புகள்

source: Kitaev, A. Y. (1995). Quantum measurements and the Abelian stabilizer problem. arXiv preprint quant-ph/9511026.
ta: கிடேவ், ஏ. ஒய். (1995). குவாண்டம் அளவீடுகள் மற்றும் அபெலியன் நிலைப்படுத்தி பிரச்சனை. arXiv preprint quant-ph/9511026.

source: Nielsen, M., & Chuang, I. (2010). Quantum computation and quantum information (2nd ed., pp. 221-226). Cambridge University Press.
ta: நீல்சன், எம்., & சுவாங், ஐ. (2010). குவாண்டம் கணக்கீடு மற்றும் குவாண்டம் தகவல் (2வது பதிப்பு, பக். 221-226). கேம்பிரிட்ஜ் பல்கலைக்கழக அச்சகம்.

source: Abbas, A., Andersson, S., Asfaw, A., Córcoles, A., Bello, L., Ben-Haim, Y., ... & Wootton, J. (2020). Learn quantum computation using qiskit. URL: https://qiskit.org/textbook/preface.html (accessed 07/14/2022).
ta: அப்பாஸ், ஏ., ஆண்டர்சன், எஸ்., அஸ்ஃபா, ஏ., கார்கோல்ஸ், ஏ., பெல்லோ, எல்., பென்-ஹைம், ஒய்., ... & வூட்டன், ஜே. (2020). கிஸ்கிட்டைப் பயன்படுத்தி குவாண்டம் கணக்கீட்டைக் கற்றுக்கொள்ளுங்கள். URL: https://qiskit.org/textbook/preface.html (07/14/2022 அணுகப்பட்டது).

source: Qiskit versions and copyright
es_un: Versiones de Qiskit y derechos de autor
ja_jp: Qiskit のバージョンと著作権
ta: Qiskit பதிப்புகள் மற்றும் காப்புரிமை

source: The quantum phase estimation (QPE) algorithm is an important subroutine in quantum computation. It serves as a central building block of many quantum algorithms including the Shor’s factoring algorithm and the quantum algorithm for linear systems of equations (HHL algorithm). In this tutorial, you will build a parameterized version of QPE circuit and run it using the Sampler primitive, which makes running parameterized circuits very easy.
es_un: El algoritmo de estimación de fase cuántica (quantum phase estimation, QPE) es una subrutina importante en la computación cuántica. Sirve como un bloque de construcción central de muchos algoritmos cuánticos, incluido el algoritmo de factorización de Shor y el algoritmo cuántico para sistemas lineales de ecuaciones (algoritmo HHL). En este tutorial, construirás una versión parametrizada del circuito QPE y la ejecutarás utilizando la primitiva Sampler, lo que facilita mucho la ejecución de circuitos parametrizados.
ja_jp: 量子位相推定（QPE）アルゴリズムは、量子計算における重要なサブルーチンです。ショアの因数分解アルゴリズムや連立方程式の量子アルゴリズム(HHLアルゴリズム) など、多くの量子アルゴリズムの中心的な構成要素として機能しています。このチュートリアルでは、パラメーター化されたQPE回路を構築し、Sampler primitive を使用して実行します。

source: This tutorial requires a Qiskit Runtime service instance. If you haven’t done so already, follow the instructions in the Qiskit `Getting started guide <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ to set one up.
es_un: Este tutorial requiere una instancia del servicio Qiskit Runtime. Si aún no lo has hecho, sigue las instrucciones de la `guía de Primeros pasos de Qiskit <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ para configurar uno.
ja_jp: このチュートリアルには、Qiskit Runtimeのサービスインスタンスが必要です。まだの方は、Qiskitの `入門ガイド<https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ の指示に従ってセットアップしてください。

source: The QPE algorithm [1][2] estimates the value of theta, where a unitary operator :math:`U` has an eigenvector :math:`|\psi \rangle` with eigenvalue :math:`e^{2\pi i \theta}`. To find the estimation, we assume we have black boxes (sometimes called *oracles*), that can prepare the state :math:`|\psi \rangle` and run a controlled-\ :math:`U^{2^j}` operation.
es_un: El algoritmo QPE [1][2] estima el valor de theta, donde un operador unitario :math:`U` tiene un vector propio :math:`|\psi \rangle` con valor propio :math:`e^{2\pi i \theta}`. Para encontrar la estimación, asumimos que tenemos cajas negras (a veces llamadas *oráculos*), que pueden preparar el estado :math:`|\psi \rangle` y ejecutar una operación control-\ :math:`U^{2^j}`.
ja_jp: QPE アルゴリズム [1][2] は、ユニタリー演算子 :math:`U` が固有ベクトル :math:`|\psi \rangle` 、固有値 :math:`e^{2\pi i \theta}` を持つとき、thetaの値を推定します。推定のために、状態 :math:`|\psi \rangle` を準備し、制御-\ :math:`U^{2^j}` 演算を実行する、ブラック ボックス ( *オラクル* と呼ばれることもあります) を仮定します。

source: Because it relies on black boxes, the QPE algorithm is not actually a complete algorithm, but can be thought of as a subroutine. It can work with other subroutines to perform other computations, such as Shor’s factoring algorithm and the HHL algorithm.
es_un: Debido a que se basa en cajas negras, el algoritmo QPE no es en realidad un algoritmo completo, pero puede considerarse como una subrutina. Puede funcionar con otras subrutinas para realizar otros cálculos, como el algoritmo de factorización de Shor y el algoritmo HHL.
ja_jp: ブラックボックスに依存しているため、QPEアルゴリズムは実際には完全なアルゴリズムではなく、サブルーチンとして考えることができます。このサブルーチンは他のサブルーチンと連携して、ショアの因数分解アルゴリズムやHHLアルゴリズムなど他の計算を実行することができます。

source: As explained above, there are black boxes in the QPE algorithm to prepare the state :math:`|\psi \rangle` and perform the controlled-\ :math:`U^{2^j}` operation. In this tutorial, you will prepare a series of QPE circuits containing different black boxes corresponding to different phases. You will then run these circuits using the `Sampler primitive <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Sampler.html>`__ and analyze the results. As you will see, the Sampler primitive makes running parameterized circuits very easy. Instead of creating a series of QPE circuits, you only need to create *one* QPE circuit with a parameter specifying the phase the black boxes generate and a series of phase values for the parameter.
es_un: Como se explicó anteriormente, hay cajas negras en el algoritmo QPE para preparar el estado :math:`|\psi \rangle` y realizar la operación control-\ :math:`U^{2^j}`. En este tutorial, prepararás una serie de circuitos QPE que contienen diferentes cajas negras correspondientes a diferentes fases. Después, ejecutarás estos circuitos utilizando la `primitiva Sampler <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Sampler.html>`__ y analizarás los resultados. Como verás, la primitiva Sampler facilita mucho la ejecución de circuitos parametrizados. En lugar de crear una serie de circuitos QPE, solo necesitas crear *un* circuito QPE con un parámetro que especifique la fase que generan las cajas negras y una serie de valores de fase para el parámetro.
ja_jp: 上で説明したように、QPE アルゴリズムには状態 :math:`|\psi \rangle` を準備し、制御-\ :math:`U^{2^j}` 演算を実行するためのブラック ボックスがあります。 このチュートリアルでは、さまざまな位相に対応するさまざまなブラック ボックスを含む一連の QPE 回路を準備します。 次に、`Sampler primitive <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Sampler.html>`__ を使用してこれらの回路を実行し、結果を分析します。 ご覧のとおり、Sampler primitiveを使用すると、パラメーター化された回路を非常に簡単に実行できます。 一連の QPE 回路を作成する代わりに、ブラック ボックスが生成する位相を指定するパラメーターとパラメーターの一連の位相値を使用して *1 つ* の QPE 回路を作成するだけで済みます。

source: In a typical usage of the QPE algorithm, such as the Shor’s factoring algorithm, the black boxes are not configured by the user but instead are specified by other subroutines. However, the purpose of this tutorial is to use the QPE algorithm to illustrate the ease of running parameterized circuits by using the Sampler primitive.
es_un: En un uso típico del algoritmo QPE, como el algoritmo de factorización de Shor, el usuario no configura las cajas negras, sino que las especifican otras subrutinas. Sin embargo, el propósito de este tutorial es usar el algoritmo QPE para ilustrar la facilidad de ejecutar circuitos parametrizados usando la primitiva Sampler.
ja_jp: ショアの素因数分解アルゴリズムのようなQPEアルゴリズムの典型的な使用法では、ブラックボックスはユーザーによって設定されず、他のサブルーチンによって指定されます。しかし、このチュートリアルの目的は、QPEアルゴリズムを使用して、Sampler primitiveを使用したパラメーター化回路の実行の容易さを説明することです。

source: Apply the controlled-\ :math:`U^{2^j}` black box.
es_un: Aplica la caja negra control-\ :math:`U^{2^j}`.
ja_jp: 制御- \ :math:`U^{2^j}` ブラック ボックスを適用します。

source: The following code creates a function ``create_qpe_circuit`` for creating a QPE circuit given the keyword arguments ``theta`` and ``num_qubits``. Note that ``theta`` doesn’t contain the :math:`2\pi` factor. The ``num_qubits`` argument specifies the number of qubits in the first register. More qubits will provide more precision for the phase estimation.
es_un: El siguiente código crea una función ``create_qpe_circuit`` para crear un circuito QPE dados los argumentos de palabra clave ``theta`` y ``num_qubits``. Ten en cuenta que ``theta`` no contiene el factor :math:`2\pi`. El argumento ``num_qubits`` especifica el número de qubits en el primer registro. Más qubits proporcionarán más precisión para la estimación de fase.
ja_jp: 次のコードは、キーワード引数 ``theta`` と ``num_qubits`` を与えて、QPE回路を作成するための関数 ``create_qpe_circuit`` を作成します。 ``theta`` は :math:`2\pi` ファクターを含んでいないことに注意してください。``num_qubits`` 引数は最初のレジスターの量子ビット数を指定します。子ビット数が多いほど、位相推定の精度が良くなります。

source: After creating the parameterized QPE circuit, you will create a list of phase values to be assigned to the circuit in the next step. You can use the code below to create a list of 21 phase values that range from ``0`` to ``2`` with equal spacing, i.e. \ ``0``, ``0.1``, ``0.2``, …, ``1.9``, ``2.0``.
es_un: Después de crear el circuito QPE parametrizado, crearás una lista de valores de fase que se asignarán al circuito en el siguiente paso. Puedes usar el siguiente código para crear una lista de 21 valores de fase que van desde ``0`` a ``2`` con espacios iguales, es decir, \ ``0``, ``0.1``, ``0.2``, …, ``1.9``, ``2.0``.
ja_jp: パラメーター化されたQPE回路を作成した後、次のステップで回路に割り当てる位相の値のリストを作成します。以下のコードを使用して、 ``0`` から ``2`` までの21個の位相の値のリストを等間隔で作成します： \ ``0``, ``0.1``, ``0.2``, …, ``1.9``, ``2.0``

source: With the Qiskit Runtime service connected, a parameterized QPE circuit, and a list of parameter values, you are now ready to use the Sampler primitive to run the QPE circuits. The ``with ...`` syntax opens a Qiskit Runtime session. Within the session, you will run the parameterized QPE circuit with 21 parameter values with just one line of code. The Sampler primitive will take the parameter values, assign them to the circuit and run it as 21 circuits with fixed parameter values and return a single job result containing the (quasi-)probabilities of bitstrings. This saves you from writing dozens of lines of code.
es_un: Con el servicio Qiskit Runtime conectado, un circuito QPE parametrizado y una lista de valores de parámetros, ahora estás listo para usar la primitiva Sampler para ejecutar los circuitos QPE. La sintaxis ``with ...`` abre una sesión de Qiskit Runtime. Dentro de la sesión, ejecutarás el circuito QPE parametrizado con 21 valores de parámetros con solo una línea de código. La primitiva Sampler tomará los valores de los parámetros, los asignará al circuito y lo ejecutará como 21 circuitos con valores de parámetros fijos y devolverá un solo resultado de trabajo que contiene las (cuasi) probabilidades de cadenas de bits. Esto te ahorra tener que escribir docenas de líneas de código.
ja_jp: Qiskit Runtimeサービスが接続され、パラメーター化されたQPE回路、およびパラメーターの値のリストがあれば、Sampler primitiveを使用してQPE回路を実行する準備が整ったことになります。 ``with ...`` 構文は、Qiskit Runtime sessionを開きます。Session内では、たった1行のコードで21個の異なるパラメーターの値を持つパラメーター化されたQPE回路を実行することになります。Sampler primitiveは、パラメーター値を受け取り、それを回路に割り当て、異なるパラメーター値を持つ21個の回路として実行し、ビット列の（擬似）確率を含む1つのジョブ結果を返します。これにより、何十行ものコードを書く手間が省けます。

source: After the job has been completed, you can start analyzing the results by looking at the histogram of one of the circuits. The (quasi-)probability distribution of the measurement outcome is stored in ``results.quasi_dists`` and you can access results from an individual circuit by passing the index of the circuit (:math:`idx=6` in the example below) you are interested in.
es_un: Una vez que se haya completado el trabajo, puedes comenzar a analizar los resultados mirando el histograma de uno de los circuitos. La (cuasi) distribución de probabilidad del resultado de la medición se almacena en ``results.quasi_dists`` y puedes acceder a los resultados de un circuito individual pasando el índice del circuito (:math:`idx=6` en el ejemplo a continuación) en el que estás interesado.
ja_jp: ジョブが完了したら、回路のヒストグラムを見ることで結果の解析を開始することができます。測定結果の（準）確率分布は ``results.quasi_dists`` に格納されており、興味のある回路のインデックス（以下の例では:math:`idx=6` ）を渡すことで個々の回路の結果にアクセスすることが可能です。

source: This is close to the expected value of :math:`0.6`, but you can do a better estimate by taking the weighted average of the most likely outcome (``1010`` in binary or ``10`` in decimal) and the second most likely outcome (``1001`` in binary or ``9`` in decimal):
es_un: Esto está cerca del valor esperado de :math:`0.6`, pero puedes hacer una mejor estimación tomando el promedio ponderado del resultado más probable (``1010`` en binario o ``10`` en decimal) y el segundo resultado más probable (``1001`` en binario o ``9`` en decimal):
ja_jp: これは :math:`0.6` の期待値に近いですが、最も可能性の高い結果 (2進数で ``1010`` 、10進数で ``10``) と2番目に可能性の高い結果 (2進数で ``1001`` 、10進数で ``9``) を加重平均すれば、もっと良い推定値が得られます。

source: You can use the helper functions below to find the values for :math:`N_1`, :math:`P_1`, :math:`N_2`, and :math:`P_2` for a phase and calculate the estimated :math:`\theta`. Ideally :math:`N_2` should be a “neighbor” of :math:`N_1` (for example, the neighbors of ``1010`` are ``1001`` and ``1011``), however due to the presence of noise, the second most likely outcome may not be a neighbor of :math:`N_1` if the results were obtained from a real quantum system. The helper functions take the :math:`N_2` value only from :math:`N_1`\ ’s neighbors.
es_un: Puedes utilizar las siguientes funciones auxiliares para encontrar los valores de :math:`N_1`, :math:`P_1`, :math:`N_2`, y :math:`P_2` para una fase y calcular el valor estimado de :math:`\theta`. Idealmente, :math:`N_2` debería ser un “vecino” de :math:`N_1` (por ejemplo, los vecinos de ``1010`` son ``1001`` y ``1011``), sin embargo, debido a la presencia de ruido, el segundo resultado más probable puede no ser vecino de :math:`N_1` si los resultados se obtuvieron de un sistema cuántico real. Las funciones auxiliares toman el valor :math:`N_2` solo de los vecinos de :math:`N_1`.
ja_jp: 以下のヘルパー関数を利用することで、ある位相における :math:`N_1`, :math:`P_1`, :math:`N_2`, :math:`P_2` の値を求め、その推定値 :math:`\theta` を計算することができます。理想的には :math:`N_2` は :math:`N_1` の「近傍」であるべきですが（例えば、 ``1010`` の近傍は ``1001`` と ``1011`` ）、実際の量子系から得られた結果では、ノイズがあるため 2番目に可能性が高い結果は :math:`N_1` の近傍ではない可能性があります。ヘルパー関数は :math:`N_2` の値を :math:`N_1` の近傍領域から取得します。

source: The ideal solutions for the phases :math:`\theta` are periodic with a period of ``1`` because the eigenvalue :math:`e^{2 \pi i \theta}` is :math:`2 \pi` periodic. You can run the cell below to generate the ideal solutions for comparison with the solutions obtained from the QPE algorithm.
es_un: Las soluciones ideales para las fases :math:`\theta` son periódicas con un periodo de ``1`` porque el valor propio :math:`e^{2 \pi i \theta}` es :math:`2 \pi` periódico. Puedes ejecutar la celda a continuación para generar las soluciones ideales para compararlas con las soluciones obtenidas del algoritmo QPE.
ja_jp: 位相 :math:`\theta` の理想的な解は、固有値:math:`e^{2 \pi i \theta}` が :math:`2 \pi` で周期的なので、周期 ``1`` を持つ周期的な解となります。以下のセルを実行して理想的な解を生成し、QPEアルゴリズムから得られる解と比較することができます。

source: You can run the code below to visualize the solutions.
es_un: Puedes ejecutar el siguiente código para visualizar las soluciones.
ja_jp: 以下のコードを実行して、解を視覚化できます。
