Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/sea_with_sampler.po
Languages: es_un, ja_jp, ko_kr, ta_in

source: This page was generated from `docs/tutorials/sea_with_sampler.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/sea_with_sampler.ipynb`__.
ja_jp: このページは `docs/tutorials/sea_with_sampler.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/sea_with_sampler.ipynb`__ 에서 생성되었다.
ta_in: இந்தப் பக்கம் `docs/tutorials/sea_with_sampler.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Spectroscopic Eigensolver Algorithm with Sampler
es_un: Algoritmo de Solucionador Propio Espectroscópico con Sampler
ja_jp: Samplerを用いた分光固有値ソルバーアルゴリズム
ko_kr: Sampler를 사용한 분광 고윳값 해석기 알고리즘 (Spectroscopic Eigensolver Algorithm)
ta_in: மாதிரியுடன் கூடிய ஸ்பெக்ட்ரோஸ்கோபிக் ஈஜென்சல்வர் அல்காரிதம்

source: This tutorial demonstrates the ability to send flexible circuits to the ``Sampler`` primitive by performing a simple example of the spectroscopic eigensolver algorithm (`arXiv:2202.12910 <http://arxiv.org/abs/2202.12910>`__). The SEA is used for quantum simulation of model Hamiltonians, and works by interacting a “probe” auxiliary qubit with a simulation register. The energy of the probe qubit is sweeped and eigenvalues of the simulation Hamiltonian are observed as peaks or dips in the response, akin to the experimental tool of spectroscopy. Because each point (i.e., energy) is a different quantum circuit, this technique is expensive with respect to the number of circuits required. The ``Sampler`` provides the flexibility to send just a single circuit with the needed ``Parameter``\ s passed.
es_un: Este tutorial demuestra la capacidad de enviar circuitos flexibles a la primitiva ``Sampler`` mediante la realización de un ejemplo simple del algoritmo de solucionador propio espectroscópico (`arXiv:2202.12910 <http://arxiv.org/abs/2202.12910>`__). El SEA se utiliza para la simulación cuántica de modelos Hamiltonianos y funciona mediante la interacción de un qubit auxiliar “probe” (“sonda”) con un registro de simulación. La energía del qubit sonda se barre y los valores propios de la simulación Hamiltoniana se observan como picos o caídas en la respuesta, similar a la herramienta experimental de la espectroscopia. Debido a que cada punto (es decir, energía) es un circuito cuántico diferente, esta técnica es costosa con respecto a la cantidad de circuitos necesarios. El ``Sampler`` proporciona la flexibilidad de enviar un solo circuito con los ``Parameter``\ s necesarios.
ja_jp: このチュートリアルでは、分光学的固有値ソルバーアルゴリズム（ SEA, `arXiv:2202.12910 <http://arxiv.org/abs/2202.12910>`__ ）の簡単な例を実行して、柔軟な回路を ``Sampler`` primitive に送信する機能を示します。 SEAは、モデルハミルトニアンの量子シミュレーションに使用され、「プローブ」補助量子ビットをシミュレーションレジスターと相互作用させることによって機能します。 プローブ量子ビットのエネルギーが掃引され、シミュレーションハミルトニアンの固有値が、分光法の実験ツールと同様に、応答のピークまたはディップとして観察されます。 各点（つまりエネルギー）は異なる量子回路であるため、この手法は必要な回路の数に関して高価です。 ``Sampler`` は、必要な ``Parameter`` を渡して1つの回路だけを送信する柔軟性を備えています。
ko_kr: 이 튜토리얼에서는 분광 고윳값 해석기 알고리즘 (Spectroscopic Eigensolver Algorithm) (`arXiv: 2202.12910 <http://arxiv.org/abs/2202.12910>`__) 의 간단한 예제를 사용해 ``Sampler`` 프리미티브로 유연하게 회로를 전송할 수 있는 기능을 설명한다. SEA는 모델 해밀토니안의 양자 시뮬레이션에 사용되며, "프로브 보조 큐비트 (probe auxiliary qubit with a simulation register)" 와 상호 작용하여 작동한다. 프로브 큐비트의 에너지는 분광법의 실험적 도구와 유사하게, 측정후 반응에서 고점 (peak) 또는 저점 (dips) 으로서 관찰되는 시뮬레이션 해밀토니안의 고유값이다. 각각의 포인트 (즉, 에너지) 는 각기 다른 양자 회로이기 때문에, 이 기술은 요구되는 회로들의 수에 비해 계산양이 많다. ``Sampler`` 는 필요한 ``매개변수`` 들이 전달된 단 하나의 회로만을 전송할 수 있는 유연성을 제공한다.
ta_in: ஸ்பெக்ட்ரோஸ்கோபிக் ஈஜென்சோல்வர் அல்காரிதம் (`arXiv:2202.12910 <http://arxiv.org/abs/2202.12910>`__) என்ற எளிய உதாரணத்தைச் செயல்படுத்துவதன் மூலம், ``Sampler`` ஆதிநிலைக்கு நெகிழ்வான சுற்றுகளை அனுப்பும் திறனை இந்தப் பயிற்சி விளக்குகிறது. SEA ஆனது மாடல் ஹாமில்டோனியன்களின் குவாண்டம் உருவகப்படுத்துதலுக்குப் பயன்படுத்தப்படுகிறது, மேலும் ஒரு உருவகப்படுத்துதல் பதிவேட்டுடன் "ஆய்வு" துணை குவிட்டை தொடர்புகொள்வதன் மூலம் செயல்படுகிறது. ஆய்வுக் குவிட்டின் ஆற்றல் துடைக்கப்படுகிறது மற்றும் ஸ்பெக்ட்ரோஸ்கோபியின் சோதனைக் கருவியைப் போலவே, ஹாமில்டோனியன் உருவகப்படுத்துதலின் ஈஜென் மதிப்புகள் உச்சமாக அல்லது பதிலில் டிப்களாகக் காணப்படுகின்றன. ஒவ்வொரு புள்ளியும் (அதாவது, ஆற்றல்) வெவ்வேறு குவாண்டம் சுற்று என்பதால், தேவைப்படும் சுற்றுகளின் எண்ணிக்கையைப் பொறுத்து இந்த நுட்பம் விலை உயர்ந்தது. ``மாதிரி`` ஆனது தேவையான ``Parameter``\ கள் கடந்து ஒரு ஒற்றை சுற்று அனுப்பும் நெகிழ்வுத்தன்மையை வழங்குகிறது.

source: Set up your local development environment
es_un: Configura tu entorno de desarrollo local
ja_jp: ローカル開発環境のセットアップ
ko_kr: 로컬 개발 환경 설정하기
ta_in: உங்கள் அந்த இடத்திற்குறிய மேம்பாட்டு சூழலை அமைக்கவும்

source: This tutorial requires a Qiskit Runtime service instance. If you haven’t done so already, follow `these steps <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ to set one up.
es_un: Este tutorial requiere una instancia del servicio Qiskit Runtime. Si aún no lo has hecho, sigue `estos pasos <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ para configurar uno.
ja_jp: このチュートリアルでは、Qiskit Runtime Service インスタンスが必要です。まだ実行していない場合は、`これらの手順 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ に従ってセットアップします。
ko_kr: 이 지침서는 Qiskit Runtime 서비스 인스턴스가 필요하다. 이것이 없다면 `이 단계 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ 를 따라 설정을 한다.
ta_in: இந்த டுடோரியலுக்கு கிஸ்கிட் இயக்க நேர சேவை நிகழ்வுத் தேவை. நீங்கள் ஏற்கனவே அவ்வாறு செய்யவில்லை என்றால், ஒன்றை அமைக்க `இந்தப் படிகளைப் பின்பற்றவும் <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__.

source: Simple Hamiltonian Model
es_un: Modelo Hamiltoniano Simple
ja_jp: シンプルなハミルトニアン・モデル
ko_kr: 간단한 해밀토니안 모델
ta_in: எளிய ஹாமில்டோனியன் மாதிரி

source: Let’s consider a Pauli-X matrix acting on a qubit,
es_un: Consideremos una matriz de Pauli X actuando sobre un qubit,
ja_jp: 量子ビット上で動作する パウリX行列を考えてみましょう。
ko_kr: 큐비트에 작용하는 파울리-X 행렬을 고려해 보자.
ta_in: ஒரு குவிட்டில் செயல்படும் பாலி-எக்ஸ் மேட்ரிக்ஸைக் கருத்தில் கொள்வோம்,

source: where we can set :math:`\mu` later, or even sweep its values as well. The SEA works by taking the model Pauli (i.e., qubit) Hamiltonian and building a larger “resonance” Hamiltonian that includes both the simulation register and probe qubit ``q0`` via
es_un: donde podemos colocar :math:`\mu` más tarde, o incluso barrer sus valores también. El SEA funciona tomando el Hamiltoniano del modelo Pauli (es decir, el qubit) y construyendo un Hamiltoniano de “resonancia” más grande que incluye tanto el registro de simulación como el qubit sonda ``q0`` a través de
ja_jp: 後に :math:`\mu` を設定することもできますし、その値もスイープすることもできます。 SEA は、モデルパウリ ( つまり、量子ビット) ハミルトニアンを使って、シミュレーション・レジスターと以下の式のプローブ量子ビット ``q0`` の両方を含む、より大きな "共鳴" ハミルトニアンを構築することによって動作します。
ko_kr: :math:`\mu` 를 나중에 설정하거나 심지어 그 값들을 쓸 수 있다. SEA는 모델 파울리 (즉, 큐비트) 해밀토니안을 취하고, 시뮬레이션 레지스터 및 프로브 큐비트 ``q0`` 를 포함하는 더 큰 "공명" 해밀토니안을 생성함으로써 작동한다.
ta_in: அங்கு நாம் :math:`\mu` ஐ பின்னர் அமைக்கலாம் அல்லது அதன் மதிப்புகளையும் துடைக்கலாம். பாலி (அதாவது, குவிட்) ஹாமில்டோனியன் மாதிரியை எடுத்து, சிமுலேஷன் ரிஜிஸ்டர் மற்றும் ப்ரோப் க்யூபிட் ``q0`` ஆகிய இரண்டையும் உள்ளடக்கிய ஒரு பெரிய “resonance” ஹாமில்டோனியனை உருவாக்குவதன் மூலம் SEA செயல்படுகிறது

source: where the angular frequency :math:`\omega` corresponds to the energy of the probe qubit, and :math:`c` is the coupling between the probe qubit and a qubit in the simulation register (``q1`` in this case). The letters :math:`I`, :math:`X`, and :math:`Z` correspond to the Pauli spin matrices and their order reflect which qubit they operate on (note that this notation is little-endian). We will set :math:`\hbar \equiv 1` in the following code.
es_un: donde la frecuencia angular :math:`\omega` corresponde a la energía del qubit sonda, y :math:`c` es el acoplamiento entre el qubit sonda y un qubit en el registro de simulación (``q1`` en este caso ). Las letras :math:`I`, :math:`X`, y :math:`Z` corresponden a las matrices de espín de Pauli y su orden refleja en qué qubit operan (ten en cuenta que esta notación es little-endian). Estableceremos :math:`\hbar \equiv 1` en el siguiente código.
ja_jp: ここで、角周波数 :math:`\omega` は、プローブ量子ビットのエネルギーに対応し、 :math:`c` は、プローブ・量子ビットと、シミュレーション・レジスター ( この場合は ``q1`` ) 内の量子ビット間の結合です。 :math:`I`, :math:`X`, および :math:`Z` はパウリのスピン行列に対応し、それらの順序は動作する量子ビットを反映しています ( この表記はリトル・エンディアンです ) 。以下のコードでは、 :math:`\hbar \equiv 1` に設定します。
ko_kr: 여기서 각진동수 :math:`\omega` 는 프로브 큐비트의 에너지에 대응하고, :math:`c` 는 프로브 큐비트와 시뮬레이션 레지스터 내의 큐비트 사이의 결합을 나타낸다 (이 경우에는 ``q1``). :math:`I`, :math:`X`, 그리고 :math:`Z` 는 파울리 스핀 행렬에 해당하며, 그들의 정렬 순서는 어느 큐비트에서 작업하는지를 반영한다 (이 표기법은 리틀 엔디안 (little-endian)이라 한다). 우리는 이 코드에서 :math:`\hbar \equiv 1` 로 설정할 것이다.
ta_in: கோண அதிர்வெண் :math:`\omega` என்பது ஆய்வு குவிட்டின் ஆற்றலுடன் ஒத்துப்போகிறது, மேலும் :math:`c` என்பது உருவகப்படுத்துதல் பதிவேட்டில் உள்ள ஆய்வு குவிட் மற்றும் ஒரு குவிட் இடையே இணைப்பாகும் (இந்த வழக்கில் ``q1`` ) :math:`I`, :math:`X`, மற்றும் :math:`Z` ஆகியவை பாலி ஸ்பின் மெட்ரிக்ஸுடன் ஒத்துப்போகின்றன மற்றும் அவற்றின் வரிசை அவை எந்த குவிட்டில் செயல்படுகின்றன என்பதை பிரதிபலிக்கிறது (இந்த குறியீடு சிறிய எண்டியன் என்பதை நினைவில் கொள்க). பின்வரும் குறியீட்டில் :math:`\hbar \equiv 1` ஐ அமைப்போம்.

source: We can construct the SEA circuits with tools from Qiskit Opflow.
es_un: Podemos construir los circuitos SEA con herramientas de Qiskit Opflow.
ja_jp: Qiskit Opflowのツールを使用して SEA 回路を構成することができます。
ko_kr: Qiskit Opflow의 도구를 사용하여 SEA 회로를 구성할 수 있다.
ta_in: Qiskit Opflow இன் கருவிகளைக் கொண்டு நாம் SEA சுற்றுகளை உருவாக்கலாம்.

source: Time evolve the resonance Hamiltonian.
es_un: El tiempo evoluciona el Hamiltoniano de resonancia.
ja_jp: 共鳴ハミルトニアンを時間発展させます。
ko_kr: 시간이 공명 해밀토니안을 변화시킨다.
ta_in: நேரம் அதிர்வு ஹாமில்டோனியனை உருவாக்குகிறது.

source: From the time-evolution operator :math:`U_{\rm ham}`, we use the Suzuki-Trotter expansion to convert this operator into quantum circuits that implement discrete time steps of the simulation. The smaller the time steps (more Trotter steps), the more accurate the quantum circuit, but also longer depth, which could introduce errors when executing on noisy quantum hardware. We then transpile the circuits to IBM backend basis gates and measure only the probe qubit ``q0``.
ja_jp: 時間発展演算子 :math:`U_{\rm ham}` から、スズキ - トロッター展開を用いて、シミュレーションの離散時間ステップを実装した量子回路に変換します。 時間が短くなるほど(トロッターステップが多いほど)、量子回路をより正確にすることができますが、深さが長くなり、ノイズの多い量子ハードウェア上での実行時にエラーが発生する可能性があります。 次に、この回路を IBM バックエンドの基底ゲートに transpile (変換)し、プローブ・量子ビット ``q0`` のみを測定します。
ko_kr: 시간-진화 연산자 :math:`U_{\rm ham}` 에서, 우리는 스즈키-트로터 (Suzuki-Trotter) 확장을 사용하여 이 연산자를 시뮬레이션의 시간에 분리된 불연속성을 구현하는 양자 회로로 변환한다. 시간 단계를 더 잘게 쪼갤수록 (더 많은 트롬 스텝), 양자 회로는 더 정확해지지만, 회로의 깊이가 깊어질수록 노이즈가 많은 양자 하드웨어에서 실행될 때 에러를 더욱 야기할 수 있다. 그런 다음, 저희는 회로를 IBM 백엔드 기저 게이트로 트랜스파일하고 프로브의 큐비트 ``q0`` 만 측정한다.

source: Now let’s fix our parameters and sweep over frequency with a number of points ``num_pts``. The eigenvalues of our model Hamiltonian :math:`H_{\rm Pauli}` are :math:`\pm \mu`, so we need to choose a range that includes those numbers.
es_un: Ahora fijemos nuestros parámetros y hagamos un barrido sobre la frecuencia con un número de puntos ``num_pts``. Los valores propios de nuestro modelo Hamiltoniano :math:`H_{\rm Pauli}` son :math:`\pm \mu`, por lo que debemos elegir un rango que incluya esos números.
ja_jp: ここで、パラメーターを修正し、複数のポイント ``num_pts`` を使用して頻度をスイープするようにします。 モデルのハミルトニアン :math:`H_{\rm Pauli}` の固有値は :math:`\pm \mu` であるため、これらの数値を含む範囲を選択する必要があります。
ko_kr: 매개변수를 수정하고 여러 지점의 ``num_pts`` 를 사용하여 빈도를 모아볼것이다. 우리의 모델 해밀토니안 :math:`H_{\rm Pauli}` 의 고유값은 :math:`\pm \mu` 이므로 이 숫자들을 포함하는 범위를 선택할 필요가 있다.
ta_in: இப்போது நமது அளவுருக்களைச் சரிசெய்து, பல புள்ளிகள் ``num_pts`` மூலம் அதிர்வெண்ணை ஸ்வீப் செய்வோம். எங்களின் மாதிரியான Hamiltonian :math:`H_{\rm Pauli}` இன் ஐஜென் மதிப்புகள் :math:`\pm \mu`, எனவே அந்த எண்களை உள்ளடக்கிய வரம்பை நாம் தேர்வு செய்ய வேண்டும்.

source: Note that the ``Parameter``\ s’ keys and values must be separared and converted into a ``List`` of ``List``\ s. The keys give us the ``Parameter``\ s inside each circuit. In this case, we only have a single circuit, so the ``List`` of keys contains a single ``List``. For the ``Parameter`` values, there is a ``List`` for each value of ``ww``.
es_un: Ten en cuenta que las claves y valores de los ``Parameter``\ s deben separarse y convertirse en una ``List`` de ``List``\ s. Las claves nos dan los ``Parameter``\ s dentro de cada circuito. En este caso, tenemos solo un circuito, por lo que la ``List`` de claves contiene una sola ``List``. Para los valores de ``Parameter``, hay una ``List`` para cada valor de ``ww``.
ja_jp: ``Parameter`` キーと値は分離して、``List`` 内の ``List`` に変換する必要があることに注意してください。 キーは、各回路内の ``Parameter`` を示します。 この場合、回路は1つしかないため、キーの ``List`` 内には1つの ``List`` が含まれます。 ``Parameter`` 値については、``ww`` の値ごとに ``List`` があります。
ko_kr: ``Parameter`` 의 키 및 값은 분리해야 하며 ``List`` 들의 ``List`` 로 변환되어야 한다. 키는 각 회로의 ``Parameter`` 을 제공한다. 이 경우에는 단 하나의 회로만 있을 뿐이므로 키의 ``List`` 에는 하나의 ``List`` 가 포함되어 있다. ``Parameter`` 값의 경우에는 ``ww`` 의 각 값에 대한 ``List`` 가 있다.
ta_in: ``அளவுரு``\ கள்' விசைகள் மற்றும் மதிப்புகள் பிரிக்கப்பட்டு, ``லிஸ்ட்``\ களின் ``பட்டியல்`` ஆக மாற்றப்பட வேண்டும் என்பதை நினைவில் கொள்ளவும். விசைகள் ஒவ்வொரு சுற்றுக்குள்ளும் ``அளவுரு``\களை நமக்குத் தருகின்றன. இந்த வழக்கில், எங்களிடம் ஒரு ஒற்றை சுற்று மட்டுமே உள்ளது, எனவே ``பட்டியல்`` விசைகளில் ஒற்றை ``பட்டியல்`` உள்ளது. ``அளவுரு`` மதிப்புகளுக்கு, ``ww``ன் ஒவ்வொரு மதிப்புக்கும் ``பட்டியல்`` உள்ளது.

source: When calling the ``sampler``, we specify a list of ``circuits`` pointing to the circuits desired to be run and the parameter values for each circuit.
ja_jp: ``sampler`` を呼び出す際には、実行したい回路を指す ``circuits`` のリストと、各回路のパラメーター値を指定します。

source: Build the :math:`Z` expectations by converting quasi-probabilities to :math:`\langle Z \rangle`.
es_un: Construye los valores esperados de :math:`Z` convirtiendo las cuasi-probabilidades en :math:`\langle Z \rangle`.
ja_jp: 準確率を :math:`\langle Z \rangle` に変換することにより、 :math:`Z` の期待値を構築します。
ko_kr: 준확률을 :math:`\langle Z \rangle` 로 변환해 :math:`Z` 기대치들을 구축한다.
ta_in: அரை நிகழ்தகவுகளை :math:`\langle Z \rangle` ஆக மாற்றுவதன் மூலம் :math:`Z` எதிர்பார்ப்புகளை உருவாக்கவும்.

source: As a sanity check, we’ll calculate the exact expectation values with Qiskit Opflow.
es_un: Como comprobación, calcularemos los valores esperados exactos con Qiskit Opflow.
ja_jp: 健全性チェックとして、Qiskit Opflowで正確な期待値を計算します。
ko_kr: 적합한지 평가하기 위해서 Qiskit Opflow를 사용하여 정확한 기대값들을 계산할 것이다.
ta_in: நல்லறிவு சரிபார்ப்பாக, Qiskit Opflow மூலம் சரியான எதிர்பார்ப்பு மதிப்புகளைக் கணக்கிடுவோம்.

source: And plotting everything together shows that the energy at which our peaks occurs to be :math:`\pm \mu`.
es_un: Y graficar todo junto muestra que la energía en la que ocurren nuestros picos es :math:`\pm \mu`.
ja_jp: そして、すべてをプロットすることにより、ピーク時のエネルギーが :math:`\pm \mu` になることが示されます。
ko_kr: 그리고 모든 것을 함께 그렸을 때 고점이 일어나는 에너지가 :math:`\pm \mu` 라는 것을 보여준다.
ta_in: மேலும் எல்லாவற்றையும் ஒன்றாகச் சதி செய்வது, நமது சிகரங்கள் நிகழும் ஆற்றல் :math:`\pm \mu` என்பதைக் காட்டுகிறது.

source: In the ``Sampler`` class, we pass the list of circuits and parameter keys in the constructor. When calling the ``sampler``, we specify a list of ``circuits`` pointing to the circuits desired to be run (which was passed to the constructor), in this case, the index ``0`` ``num_pts`` times.
es_un: En la clase ``Sampler``, pasamos la lista de circuitos y claves de parámetros en el constructor. Al llamar al ``sampler``, especificamos una lista de ``circuits`` apuntando a los circuitos que se desean ejecutar (que se pasó al constructor), en este caso, el índice ``0``, ``num_pts`` veces.
