Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/vqe.po
Languages: es_un, ja_jp, ko_kr, pt_un

source: This page was generated from `docs/tutorials/vqe.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/vqe.ipynb`__.
ja_jp: このページは `docs/tutorials/vqe.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/vqe.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/vqe.ipynb`__.

source: The Variational Quantum Eigensolver (VQE) is a central algorithm in many applications from e.g. quantum chemistry or optimization. This tutorial shows you how to run the VQE as a Qiskit Runtime program. We’ll start off by defining the algorithm settings, such as the Hamiltonian and ansatz, and then run a VQE both locally, on your machine, and remotely, using the Qiskit Runtime.
es_un: El Solucionador Propio Variacional Cuántico (Variational Quantum Eigensolver, VQE) es un algoritmo central en muchas aplicaciones, por ejemplo, en la química cuántica o en la optimización. Este tutorial te muestra cómo ejecutar el VQE como un programa Qiskit Runtime. Comenzaremos definiendo la configuración del algoritmo, como el Hamiltoniano y ansatz, y luego ejecutaremos un VQE localmente, en tu máquina, y de forma remota, utilizando Qiskit Runtime.
ja_jp: 変分量子固有ソルバー（Variational Quantum Eigensolver、VQE) は、量子化学や最適化といった多くの応用における中心的アルゴリズムです。 このチュートリアルでは、 VQE を Qiskit Runtime プログラムとして実行する方法について説明します。 まず、ハミルトニアンや ansatz などのアルゴリズムの設定を定義してから、 Qiskit Runtime を使用して、あなたのマシン上でローカルに、そしてリモートで、実行します。
ko_kr: 양자 변분 알고리즘(VQE)는 양자 화학이나 최적화와 같은 많은 응용 분야에서 핵심적인 알고리즘이다. 이 튜토리얼에서는 VQE를 Qiskit Runtime 프로그램으로 실행하는 방법을 소개한다. 해밀토니안이나 ansatz와 같은 알고리즘 설정을 정의하는 것으로 시작해, 본인의 장치를 통해 로컬과 Qiskit Runtime을 이용해 원격으로 동시에 VQE를 실행시킬 것이다.
pt_un: O Variational Quantum Eigensolver (VQE) é um algoritmo central em muitas aplicações de, por exemplo, química quântica ou otimização. Este tutorial mostra como executar o VQE como um programa Qiskit Runtime. Começaremos definindo as configurações do algoritmo, como o Hamiltoniano e o ansatz, e, em seguida, executaremos um VQE localmente, em sua máquina e remotamente, usando o Qiskit Runtime.

source: **Note:** You can find tutorials on solving more comprehensive problems, such as finding the ground state of the lithium hydride molecule, using the VQE (and Qiskit Runtime) within `the tutorials of Qiskit Nature <https://github.com/Qiskit/qiskit-nature/tree/main/docs/tutorials>`__.
es_un: **Nota:** Puedes encontrar tutoriales sobre cómo resolver problemas más completos, como encontrar el estado fundamental de la molécula de hidruro de litio, usando VQE (y Qiskit Runtime) dentro de `los tutoriales de Qiskit Nature <https://github.com/Qiskit/qiskit-nature/tree/main/docs/tutorials>`__.
ja_jp: **注記:** `Qiskit Nature のチュートリアル <https://github.com/Qiskit/qiskit-nature/tree/main/docs/tutorials>`__ 内のVQE（およびQiskit Runtime）を使用して、水素化リチウム分子の基底状態を求めるなど、より包括的な問題を解決するためのチュートリアルを見つけることができます。
ko_kr: **참고:** `the tutorials of Qiskit Nature <https://github.com/Qiskit/qiskit-nature/tree/main/docs/tutorials>`__ 에서 VQE(및 Qiskit Runtime)를 사용하여 수소화 리튬 분자의 바닥 상태를 찾는 등의 보다 포괄적인 문제 해결에 대한 튜토리얼을 찾을 수 있다.
pt_un: **Nota:** Você pode encontrar tutoriais sobre como resolver problemas mais abrangentes, como encontrar o estado fundamental da molécula de hidreto de lítio, usando o VQE (e o Qiskit Runtime) dentro dos `tutoriais do Qiskit Nature <https://github. com/Qiskit/qiskit-nature/tree/main/docs/tutorials>`__.

source: System Hamiltonian
es_un: Hamiltoniano del Sistema
ja_jp: システム・ハミルトニアン
ko_kr: 시스템 해밀토니안
pt_un: Hamiltoniano Do Sistema

source: Let’s start by defining the operator of which we want to determine the ground state. Here we’ll chose a simple diagonal Hamiltonian :math:`\hat H` acting with Pauli-Z operators on the first two qubits
es_un: Empecemos definiendo el operador del que queremos determinar el estado fundamental. Aquí elegiremos un Hamiltoniano diagonal simple :math:`\hat H` que actúa con operadores de Pauli Z en los dos primeros qubits
ja_jp: 基底状態を決定する演算子を定義することから始めましょう。 ここでは、最初の2つの量子ビットでパウリZ演算子を使用して動作する単純な対角ハミルトニアン :math:`\hat H` を選択します。
ko_kr: 먼저 바닥 상태를 결정할 연산자를 정의하는 것으로 시작한다. 여기서 처음 두 큐비트에 파울리-Z 연산자와 함께 작용하는 간단한 대각 해밀토니안 :math:`\hat H` 를 선택할 것이다.
pt_un: Vamos começar definindo o operador do qual queremos determinar o estado fundamental. Aqui vamos escolher um hamiltoniano diagonal simples :math:`\hat H` atuando com operadores Pauli-Z nos dois primeiros qubits

source: We can construct this Hamiltonian with Qiskit’s ``opflow`` module:
es_un: Podemos construir este Hamiltoniano con el módulo ``opflow`` de Qiskit:
ja_jp: このハミルトニアンは、Qiskitの ``opflow`` モジュールを使用して構築できます。
ko_kr: 이 해밀토니안은 Qiskit의 ``opflow`` 모듈로 구성할 수 있다.
pt_un: Podemos construir este Hamiltoniano com o módulo ``opflow`` do Qiskit:

source: This Hamiltonian has a ground state energy of -1.
es_un: Este Hamiltoniano tiene una energía de estado fundamental de -1.
ja_jp: このハミルトニアンは、 基底状態エネルギーが-1です。
ko_kr: 이 해밀토니안은 -1의 기저 상태 에너지를 가진다.
pt_un: Este hamiltoniano tem uma energia do estado fundamental de -1.

source: Parameterized Ansatz Circuit
es_un: Circuito Ansatz Parametrizado
ja_jp: パラメータ化されたAnsatz回路
ko_kr: 매개변수화된 Ansatz 회로
pt_un: Circuito Ansatz Parametrizado

source: Next, we choose a parameterized quantum circuit :math:`\hat U(\theta)` to prepare the ansatz wavefunction
es_un: A continuación, elegimos un circuito cuántico parametrizado :math:`\hat U(\theta)` para preparar la función de onda ansatz
ja_jp: 次に、パラメータ化された量子回路 :math:`\hat U(\theta)` を選択して、ansatz 波動関数を準備します。
ko_kr: 다음으로, 매개변수화된 양자 회로 :math:`\hat U(\theta)` 를 선택하여 Ansatz 파동함수를 준비한다.
pt_un: Em seguida, escolhemos um circuito quântico parametrizado :math:`\hat U(\theta)` para preparar a função de onda ansatz

source: We’ll use the ``EfficientSU2`` circuit from Qiskit’s circuit library, which is a hardware efficient, heuristic ansatz with alternating rotation and entanglement layers.
es_un: Usaremos el circuito ``EfficientSU2`` de la biblioteca de circuitos de Qiskit, que es un ansatz heurístico eficiente en hardware con rotación alterna y capas entrelazadas.
ja_jp: Qiskitのcircuitライブラリーから提供される ``EfficientSU2`` 回路を使用します。これは、ハードウェア効率の高いヒューリスティック ansatz で、回転とエンタングルメントの層を交互に繰り返します。
ko_kr: Qiskit의 회로 라이브러리에서 ``EfficientSU2`` 회로를 사용할 것이며, 이 회로 라이브러리는 교차 회전 및 얽힘 레이어가 있는 하드웨어 효율적인(Hardware efficient) 휴리스틱 (heuristic) Ansatz이다.
pt_un: Usaremos o circuito ``EfficientSU2`` da biblioteca de circuitos do Qiskit, que é um ansatz heurístico eficiente de hardware com camadas alternadas de rotação e de emaranhamento.

source: Solve with the VQE
es_un: Resolver con el VQE
ja_jp: VQEを用いた解法
ko_kr: VQE를 사용하여 풀기
pt_un: Resolva com o VQE

source: Now that we have the problem and ansatz specified we can use the Variational Quantum Eigensolver (VQE) to solve for the minimal eigenvalue of our Hamiltonian.
es_un: Ahora que tenemos el problema y el ansatz especificados, podemos usar el Solucionador Propio Variacional Cuántico (Variational Quantum Eigensolver, VQE) para resolver el valor propio mínimo de nuestro Hamiltoniano.
ja_jp: 問題とansatzが指定されたので、変分量子固有値ソルバー(VQE)を使用してハミルトニアンの最小固有値を解くことができます。
ko_kr: 이제 문제와 가설이 지정되었으므로, 변분화된 양자 고윳값 해석기(Variational Quantum Eigensolver)를 사용하여 해밀토니안의 최소 고유값을 구할 수 있다.
pt_un: Agora que temos o problema e ansatz especificados, podemos usar o Variational Quantum Eigensolver (VQE) para resolver o eigenvalue mínimo do nosso Hamiltoniano.

source: The VQE requires a classical optimization routine, along with an initial point, to calculate the parameter updates.
es_un: El VQE requiere una rutina de optimización clásica, junto con un punto inicial, para calcular las actualizaciones de los parámetros.
ja_jp: VQE は、パラメーターの更新を計算するために、初期点とともに、古典最適化ルーチンを必要とします。
ko_kr: VQE는 업데이트되는 매개변수를 계산하기 위해 초기 포인트와 함께 고전적인 최적화 루틴을 필요로 한다.
pt_un: O VQE requer uma rotina de otimização clássica, juntamente com um ponto inicial, para calcular as atualizações dos parâmetros.

source: To access intermediate information we can pass a callback into the VQE. The callback is given the current number of function evaluations, the current parameters, function values and standard deviation in the expectation evaluation.
es_un: Para acceder a la información intermedia, podemos pasar una devolución de llamada (callback) al VQE. La devolución de llamada recibe el número actual de evaluaciones de la función, los parámetros actuales, los valores de la función y la desviación estándar en la evaluación de valores esperados.
ja_jp: 中間情報にアクセスするには、コールバックを VQE に渡すことができます。 コールバックには、現在の関数の評価数、現在のパラメーター、関数の値、および期待値の標準偏差が与えられます。
ko_kr: 중간 정보에 접근하기 위해서 VQE에 콜백을 전달할 수 있다. 콜백에는 현재 함수의 평가 수와 매개변수, 기댓값 평가에 있는 함수값 및 표준 편차가 주어진다.
pt_un: Para acessar informações intermediárias, podemos passar um callback para o VQE. O callback recebe o número atual de avaliações de função, os parâmetros atuais, valores de função e desvio padrão na avaliação de expectativa.

source: Local VQE
es_un: VQE local
ja_jp: ローカル VQE
ko_kr: 로컬 VQE
pt_un: VQE Local

source: Before running the Qiskit Runtime VQE program, let’s first simulate this system locally using Qiskit’s ``VQE`` class.
es_un: Antes de ejecutar el programa Qiskit Runtime VQE, primero simulemos este sistema localmente usando la clase ``VQE`` de Qiskit.
ja_jp: Qiskit Runtime VQE プログラムを実行する前に、まず、 Qiskitの ``VQE`` クラスを使用して、このシステムをローカルでシミュレートしてください。
ko_kr: Qiskit Runtime VQE 프로그램을 실행하기 전에 먼저 Qiskit의 ``VQE`` 클래스를 이용해 이 시스템을 로컬에서 시뮬레이션 해보려고 한다.
pt_un: Antes de executar o programa Qiskit Runtime VQE, vamos primeiro simular este sistema localmente usando a classe ``VQE`` do Qiskit.

source: With the information from the callback, we can for instance compute the average of the estimation errors in the expectation evaluations. For an exact (statevector) simulation this would be 0, but for a shot-based readout as we have on real hardware, this will be a small finite error.
es_un: Con la información de la devolución de llamada, podemos, por ejemplo, calcular el promedio de los errores de estimación en las evaluaciones de valores esperados. Para una simulación exacta (vector de estado), esto sería 0, pero para una lectura basada en iteraciones como la que tenemos en el hardware real, será un pequeño error finito.
ja_jp: コールバックからの情報を使用して、たとえば、期待値評価の推定誤差の平均を計算できます。 正確な（状態ベクトル）シミュレーションの場合、これは0になりますが、実際のハードウェアの場合のようにショットベースの読み出しの場合、これは小さな有限誤差になります。
ko_kr: 예를 들어 콜백의 정보를 사용하여 기댓값 평가에서 추정 오차를 계산할 수 있다. 정확한 (상태벡터) 시뮬레이션의 경우에 이는 0이 되지만, 실제 하드웨어에서 사용하는 샷 기반 해독의 경우 이는 작은 유한한 오류가 될 것이다.
pt_un: Com as informações do callback, podemos, por exemplo, calcular a média dos erros de estimativa nas avaliações de expectativa. Para uma simulação exata (statevector) isso seria 0, mas para uma leitura baseada em tiros como temos em hardware real, este será um pequeno erro finito.

source: Qiskit Runtime VQE
es_un: VQE en Qiskit Runtime
ko_kr: Qiskit 런타임 VQE

source: To call the VQE code on the Qiskit Runtime on the cloud, we interact with the ``run`` method of ``QiskitRuntimeService``:
es_un: Para llamar al código VQE en Qiskit Runtime en la nube, interactuamos con el método ``run`` de ``QiskitRuntimeService``:
ja_jp: クラウド上の Qiskit Runtime で VQE コードを呼び出すには、 ``QiskitRuntimeService`` の ``run`` メソッドと対話します。
ko_kr: 클라우드 상의 Qiskit 런타임 에서 VQE코드를 호출하기 위해서는 ``QiskitRuntimeService``의 ``run`` 메소드와 상호작용한다.
pt_un: Para chamar o código VQE no Qiskit Runtime na nuvem, interagimos com o método ``run`` de ``QiskitRuntimeService``:

source: where
es_un: donde
ja_jp: ここで
ko_kr: 여기서 이는 다음과 같다
pt_un: onde

source: ``program_id`` determines the Qiskit Runtime program run, i.e. \ ``'vqe'`` for the VQE
es_un: ``program_id`` determina la ejecución del programa Qiskit Runtime, es decir, ``'vqe''`` para el VQE
ja_jp: ``program_id`` は Qiskit Runtime プログラムの実行を決定します。すなわち、VQE の ``'vqe'`` です。
ko_kr: ``program_id`` 는 Qiskit 런타임 프로그램 실행을 결정한다. 즉 ``'vqe'`` 는 VQE 실행을 결정한다.
pt_un: ``program_id`` determina a execução do programa Qiskit Runtime, ou seja, \ ``'vqe'`` para o VQE

source: ``inputs`` contains the input for the VQE algorithm
es_un: ``inputs`` contiene la entrada para el algoritmo VQE
ja_jp: ``inputs`` には VQE アルゴリズムの入力が含まれています
ko_kr: ``inputs`` 는 VQE 알고리즘에 대한 입력을 포함한다.
pt_un: ``inputs`` contém a entrada para o algoritmo VQE

source: ``options`` specifies the backend
es_un: ``options`` especifica el backend
ja_jp: ``options`` はバックエンドを指定します
ko_kr: ``options`` 는 백엔드를 지정한다.
pt_un: ``options`` especifica o backend

source: ``callback`` is the callback used inside the VQE
es_un: ``callback`` es la devolución de llamada utilizada dentro del VQE
ja_jp: ``callback`` は VQE 内で使用されるコールバックです
ko_kr: ``callback`` 은 VQE 내부에서 사용되는 콜백이다.
pt_un: ``callback`` é o callback utilizado dentro do VQE

source: We start by initializing an account with access to the Qiskit Runtime service and the backend to execute the circuits on
es_un: Comenzamos inicializando una cuenta con acceso al servicio Qiskit Runtime y el backend para ejecutar los circuitos
ja_jp: QisKit Runtime サービスへのアクセスでアカウントを初期化し、回路を実行するバックエンドから始めます。
ko_kr: 회로를 실행하기 위해서 Qiskit 런타임 서비스와 백엔드에 엑세스 권한을 가진 계정을 초기화하는 것으로 시작한다.
pt_un: Começamos inicializando uma conta com acesso ao serviço Qiskit Runtime e o backend para executar os circuitos

source: We’re using the ``ibmq_montreal`` device, but you can replace this with another device you have access to.
es_un: Estamos usando el dispositivo ``ibmq_montreal``, pero puedes reemplazarlo con otro dispositivo al que tengas acceso.
ja_jp: 私たちは ``ibmq_montreal`` デバイスを使用していますが、アクセス可能な別のデバイスに置き換えることができます。
ko_kr: ``ibmq_montreal`` 을 사용하고 있지만, 엑세스할 수 있는 다른 장치로 교체할 수도 있다.
pt_un: Estamos usando o dispositivo ``ibmq_montreal``, mas podemos substituí-lo por outro dispositivo ao qual também tenhamos acesso.

source: Let’s gather all the inputs to the VQE in a dictionary.
es_un: Reunamos todas las entradas al VQE en un diccionario.
ja_jp: 辞書内の VQE へのすべての入力を収集します。
ko_kr: VQE에 대한 모든 입력값을 딕셔너리로 모아보자.
pt_un: Vamos reunir todas as entradas para o VQE em um dicionário.

source: The backend options only need to contain the name of the backend.
es_un: Las opciones del backend solo necesitan contener el nombre del backend.
ja_jp: バックエンド・オプションには、バックエンドの名前のみが含まれている必要があります。
ko_kr: 백엔드 옵션은 백엔드 이름만 포함하면 된다.
pt_un: As opções de backend só precisam conter o nome do backend.

source: The callback acts a little different than before. Instead of only being passed the VQE callback arguments, it is passed a tuple with the job ID as first argument, followed by the VQE arguments.
es_un: La devolución de llamada actúa un poco diferente que antes. En lugar de pasar solo los argumentos del callback de VQE, se pasa una tupla con el ID del trabajo (job) como primer argumento, seguido de los argumentos de VQE.
ja_jp: コールバックは以前とは少し異なります。 VQEコールバック引数のみ渡される代わりに。 最初の引数としてジョブIDを持つタプルを渡し、続いてVQE引数を渡します。
ko_kr: 콜백은 이전과 조금 다르게 작동한다. VQE 콜백 인수만 전달하는 대신, 작업 ID를 첫 번째 인수로 지정한 튜플과 VQE 인수를 차례로 전달한다.
pt_un: O callback age um pouco diferente do que antes. Em vez de serem passados apenas os argumentos de callback do VQE, é passado uma tupla com o ID da tarefa como primeiro argumento, seguido pelos argumentos do VQE.

source: Now we can call the Qiskit Runtime VQE program. Note, that the result will not be of the same type as ``VQE``, but a plain dictionary.
es_un: Ahora podemos llamar al programa VQE en Qiskit Runtime. Ten en cuenta que el resultado no será del mismo tipo que ``VQE``, sino un diccionario simple.
ja_jp: これで、Qiskit Runtime VQEプログラムを呼び出すことができます。 結果は ``VQE`` と同じ型ではなくプレーンな辞書であることに注意してください。
ko_kr: 이제 Qiskit Runtime VQE 프로그램을 호출할 수 있다. 참고로 결과는 ``VQE`` 와 같은 타입이 아니라 일반적인 딕셔너리가 될 것이다.
pt_un: Agora podemos chamar o programa Qiskit Runtime VQE. Observe que o resultado não será do mesmo tipo que ``VQE``, mas sim um dicionário simples.
