Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/vqe_with_estimator.po
Languages: es_un, fr, ja, ko_kr, pt_un, ta_in

source: This page was generated from `docs/tutorials/vqe_with_estimator.ipynb`__.
es_un: Esta página fue generada a partir de `docs/tutorials/vqe_with_estimator.ipynb`__.
fr: Cette page a été générée à partir de `docs/tutorials/vqe_with_estimator.ipynb`__.
ja: このページは `docs/tutorials/vqe_with_estimator.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/vqe_with_estimator.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de `docs/tutorials/vqe_with_estimator.ipynb`__.
ta_in: இந்தப் பக்கம் `docs/tutorials/vqe_with_estimator.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: VQE using Estimator primitive and Sessions
fr: VQE à l'aide de la primitive Estimator et des Sessions
ja: Estimator primitive と session を使った VQE

source: Background
fr: Contexte
ja: 背景

source: `Variational quantum algorithms <https://arxiv.org/abs/2012.09265>`__ are promising candidate hybrid-algorithms for observing the utility of quantum computation on noisy near-term devices. Variational algorithms are characterized by the use of a classical optimization algorithm to iteratively update a parameterized trial solution, or "ansatz". Chief among these methods is the Variational Quantum Eigensolver (VQE) that aims to solve for the ground state of a given Hamiltonian represented as a linear combination of Pauli terms, with an ansatz circuit where the number of parameters to optimize over is polynomial in the number of qubits. Given that size of the full solution vector is exponential in the number of qubits, successful minimization using VQE requires, in general, additional problem specific information to define the structure of the ansatz circuit.
fr: Les algorithmes quantiques variationnels <https://arxiv.org/abs/2012.09265>` __ sont des algorithmes hybrides efficaces pour observer l'utilité des calcul quantiques sur des système bruyants. Les algorithmes de variabilité sont caractérisés par l'utilisation d'un algorithme d'optimisation classique pour mettre à jour itérativement une solution expérimentale paramétrée, ou "ansatz". Le plus connu est le Variational Quantum Eigensolver (VQE) qui vise à obtenir l'état fondamental d'une Hamiltonian représentée comme une combinaison linéaire de Pauli vectors, avec un circuit ansatz où le nombre de paramètres à optimiser évolu de manière polynomiale avec le nombre de qubits. Étant donné que la taille du vecteur solution évolue de manière exponentielle avec le nombre de qubits, la minimisation à l'aide de VQE nécessite, en général, des informations supplémentaires spécifiques au problème pour définir la structure du circuit ansatz.
ja: `変分量子アルゴリズム <https://arxiv.org/abs/2012.09265>`__ は、ノイズの多い近い将来のデバイス上での量子計算の有用性を観測するための有望なハイブリッドアルゴリズムの候補です。変分アルゴリズムは、パラメーター化されたトライアル解（ansatz）を繰り返し更新するために、古典的な最適化アルゴリズムを使用することが特徴です。これらの手法の中で最も重要なものは、変分量子固有値ソルバー（VQE）であり、パウリ項の線形結合として表されるハミルトニアンの基底状態を、最適化するパラメーターの数が量子ビット数の多項式となる ansatz 回路を用いて解くことを目的としています。完全な解のベクトルのサイズが量子ビット数に対して指数関数的であることを考えると、VQEを用いて最小化を成功させるには、一般的に、ansatz 回路の構造を定義するために、問題固有の情報を追加する必要があります。

source: Executing a VQE algorithm requires the following 3 components:
fr: Exécuter un algorithme VQE nécessite les 3 composants suivants :
ja: VQE アルゴリズムを実行するには、以下の 3 つのコンポーネントが必要です：

source: Hamiltonian and ansatz (problem specification)
fr: Hamiltonien et ansatz (définition du problème)
ja: ハミルトニアンと ansatz (問題の仕様)

source: Qiskit Runtime estimator
fr: Estimateur Qiskit Runtime

source: Classical optimizer
fr: Optimiseur classique
ja: 古典オプティマイザー

source: Although the Hamiltonian and ansatz require domain specific knowledge to construct, these details are immaterial to the Runtime, and we can execute a wide class of VQE problems in the same manner.
fr: Bien que l'Hamiltonian et l'ansatz nécessitent une connaissance spécifique du domaine, ces détails sont négligeables pour l'exécution, et nous pouvons exécuter de nombreux problèmes VQE de la même manière.
ja: ハミルトニアンとansatzを構築するには領域固有の知識が必要ですが、これらの詳細は Runtime にとって重要ではなく、同じ方法で幅広いクラスのVQE問題を実行することができます。

source: Setup
fr: Configuration
ja: 設定

source: Here we import the tools needed for a VQE experiment. The primary imports can be grouped logically into three components that correspond to the three required elements.
fr: Ici, nous importons les outils nécessaires à une expérience VQE. Les imports peuvent être groupés de manière logique en trois composantes qui correspondent aux trois éléments nécessaires.
ja: ここでは、VQEの実験に必要なツールをインポートします。主要なインポートは、必要な3つの要素に対応する3つのコンポーネントに論理的にグループ化することができます。

source: Initialize Runtime service and select backend
fr: Initialiser le service d'exécution et sélectionner le backend
ja: Runtime サービスを初期化してバックエンドを選択する

source: Here we instantiate the Runtime service that gives access to the simulator that we use in this tutorial.
fr: Ici, nous configurons le service d'exécution qui donne accès au simulateur que nous utilisons dans ce tutoriel.
ja: ここでは、このチュートリアルで使用するシミュレーターへのアクセスを提供する Runtime サービスをインスタンス化します。

source: Problem specification
fr: Définition du problème
ja: 問題の仕様

source: Here we define the problem instance for our VQE algorithm. Although the problem in question can come from a variety of domains, the form for execution via Runtime is the same. Qiskit provides a convenience class for expressing Hamiltonians in Pauli form, and a collection of widely used ansatz circuits in the ``qiskit.circuit.library``.
fr: Ici, nous définissons le problème pour notre algorithme VQE. Bien que le problème en question puisse provenir d'une variété de domaines, la forme de l'exécution via Runtime est la même. Qiskit fournit une classe pour l'expression des Hamiltonians sous forme de vecteurs Pauli, et une collection de circuits ansatz dans la ``qiskit.circuit.library``.

source: Here, our example Hamiltonian is derived from a quantum chemistry problem
fr: Ici, notre exemple Hamiltonien est dérivé d'un problème de chimie quantique
ja: ここでは、量子化学の問題からハミルトニアンを導出します。

source: and our choice of ansatz is the ``EfficientSU2`` that, by default, linearly entangles qubits, making it ideal for quantum hardware with limited connectivity.
fr: et notre choix d'ansatz est le ``EfficientSU2`` qui, par défaut, intrique linéairement les qubits, le rendant idéal pour les systèmes quantique avec une connectivité limitée.
ja: そして ansatz として選択する ``EfficientSU2`` は、デフォルトで量子ビットを線形にエンタングルするため、接続性の限られた量子ハードウェアに最適です。

source: From the figure above we see that our ansatz circuit is defined by a vector of parameters, :math:`\theta_{i}`, with the total number given by:
fr: Sur la figure ci-dessus, nous pouvons voir que notre circuit ansatz est défini par un vecteur de paramètres, :math:`\theta_{i}`, avec le nombre total donné par :

source: VQE cost function and minimization
fr: Fonction de coût VQE et minimisation
ja: VQEのコスト関数と最小化

source: Like many classical optimization problems, the solution to a VQE problem can be formulated as minimization of a scalar cost function. By definition, VQE looks to find the ground state solution to a Hamiltonian by optimizing the ansatz circuit parameters to minimize the expectation value (energy) of the Hamiltonian. With the Runtime ``Estimator`` directly taking a Hamiltonian and parameterized ansatz, and returning the necessary energy, The cost function for a VQE instance is quite simple:
fr: Comme de nombreux problèmes d'optimisation classiques, la solution à un problème VQE peut être formulée comme la minimisation d'une fonction scalaire de coût. Par définition, VQE cherche à trouver la solution de l'état fondamental à un hamiltonien en optimisant les paramètres du circuit ansatz afin de minimiser la valeur attendu (énergie) de l'hamiltonien. Avec le Runtime ``Estimator`` qui prend directement un ansatz hamiltonien et paramétré, et en retournant l'énergie nécessaire, la fonction de coût d'une instance VQE est assez simple:
ja: 多くの古典的な最適化問題と同様に、VQE問題の解はスカラーのコスト関数の最小化として定式化することができます。定義によれば、VQEはハミルトニアンの期待値（エネルギー）を最小化するために ansatz 回路のパラメーターを最適化することによって、ハミルトニアンの基底状態の解を見つけることを目的としています。Runtime ``Estimator`` がハミルトニアンとパラメーター化された ansatz を直接受け取り、必要なエネルギーを返すので、VQEインスタンスのコスト関数は非常にシンプルです：

source: Note that, in addition to the array of optimization parameters that must be the first argument, we use additional arguments to pass the terms needed in the cost function.
fr: Notez que, en plus de l'ensemble des paramètres d'optimisation qui doivent être le premier argument, nous utilisons des arguments supplémentaires pour passer les valeurs nécessaires à la fonction de coût.
ja: 最初の引数でなければならない最適化パラメーターの配列に加えて、コスト関数に必要な項を渡すために追加の引数を使用することに注意してください。

source: We are now free to use a classical optimizer of our choice to minimize our cost function. Here we use the `COBYLA routine from SciPy via the ``minimize`` function <https://docs.scipy.org/doc/scipy/reference/generated/scipy.optimize.minimize.html>`__. Note that, when running on real quantum hardware, the choice of optimizer is important as not all optimizers handle noisy cost function landscapes equally well.
fr: Nous sommes maintenant libres d'utiliser un optimiseur classique de notre choix pour minimiser notre fonction de coût. Ici, nous utilisons `la routine COBYLA de SciPy via la fonction ``minimize`` <https://docs.scipy.org/doc/scipy/reference/generated/scipy.optimize.minimize.html>`__. Notez que, lors de l'exécution sur des systèmes quantiques réels, le choix de l'optimiseur est important car tous les optimiseurs ne gèrent pas aussi bien les fonctions de coût bruyantes.

source: To begin the routine, we start by specifying a random initial set of parameters,
fr: Pour définir la routine, nous commençons par spécifier un ensemble aléatoire initial de paramètres,
ja: ルーチンを開始するために、まずランダムな初期パラメーターセットを指定します。

source: and because we are sending a large number of jobs that we would like to execute together, here we use a ``Session`` to execute all the generated circuits in one block. Here ``args`` is the standard SciPy way to supply the additional parameters needed by the cost function.
fr: et parce que nous envoyons un grand nombre de circuits que nous aimerions exécuter ensemble, nous utilisons une ``Session`` pour exécuter tous les circuits générés en un seul bloc. Ici, ``args`` est la manière SciPy standard de fournir les paramètres supplémentaires requis par la fonction de coût.
ja: 一緒に実行したいジョブを大量に送信するため、ここでは ``Session`` を使用して、生成されたすべての回路を1つのブロックで実行します。ここで ``args`` は SciPy の標準的な方法で、コスト関数が必要とする追加パラメーターを与えます。

source: At the terminus of this routine we have a result in the standard SciPy ``OptimizeResult`` format. From this we see that it took ``nfev`` number of cost function evaluations to obtain the solution vector of parameter angles (``x``) that, when plugged into the ansatz circuit, yield the approximate ground state solution we were looking for.
fr: À la fin de cette routine nous avons un résultat dans le format standard SciPy ``OptimizeResult``. De ce fait, nous voyons qu'il a fallu ``nfev`` évaluations de la fonction coût pour obtenir le vecteur de solution des angles paramètres (``x``) qui, lorsqu'ils sont connectés au circuit ansatz, donnent la solution approximative de l'état fondamental que nous recherchons.
ja: このルーチンの最後で、標準的なSciPyの ``OptimizeResult`` フォーマットの結果が得られます。この結果から、角度パラメーター (``x``) の解ベクトルを得るために、 ``nfev`` 回のコスト関数の評価が必要であり、それを ansatz 回路に差し込むと、求めていた基底状態の近似解が得られることがわかります。

source: Adding a callback function
fr: Ajout d'une fonction de rappel
ja: コールバック関数の追加

source: As it stands now, we are unable to save intermediate results from the iteration process, view the value of the cost function per iteration, nor are we able to monitor the progress of the routine. Callback functions are a standard way for users to obtain additional information about the status of an iterative algorithm. The standard SciPy callback routine allows for returning only the interim vector at each iteration. However, it is possible to do much more than this. Here we show how to use a mutable object, such as a dictionary, to store the current vector at each iteration, for example in case we need to restart the routine due to failure, and also return the current iteration number and average time per iteration.
fr: Actuellement, nous ne pouvons pas enregistrer les résultats intermédiaires du processus d'itération, voir la valeur de la fonction de coût à chaque itération, et nous ne pouvons pas non plus surveiller l'avancement de la routine. Les fonctions de rappel constituent une manière pour les utilisateurs d'obtenir des informations supplémentaires sur le statut d'un algorithme itératif. La routine de rappel standard SciPy permet de ne renvoyer que le vecteur intermédiaire à chaque itération. Cependant, il est possible de faire beaucoup plus que cela. Ici, nous montrons comment utiliser un objet mutable, tel qu'un dictionnaire, pour stocker le vecteur actuel à chaque itération, par exemple dans le cas où nous avons besoin de redémarrer la routine en raison d'un problème, et aussi de renvoyer le nombre d'itérations en cours et le temps moyen par itération.
ja: 現状では、繰り返し処理の中間結果を保存したり、繰り返しごとのコスト関数の値を表示したり、ルーチンの進行状況を監視したりすることはできません。コールバック関数は、ユーザーが反復アルゴリズムの状態に関する追加情報を得るための標準的な方法です。標準的なSciPyのコールバックルーチンでは、各反復で中間ベクトルだけを返すことができます。しかし、それ以上のことも可能です。ここでは、辞書のような変更可能なオブジェクトを使用して、各反復の現在のベクトルを保存し、例えば、失敗によりルーチンを再起動する必要がある場合に、現在の反復回数と反復ごとの平均時間を返す方法を示します。

source: We can now repeat the experiment setting the ``callback`` argument in ``minimize`` with our function:
fr: Nous pouvons à présent répéter l'expérience, définir l'argument ``callback`` dans ``minimize`` avec notre fonction :
ja: これで、関数を使用して ``minimize`` に ``callback`` 引数を設定して実験を繰り返すことができます：

source: If the procedure terminates correctly, then the ``prev_vector`` and ``iters`` values in our ``callback_dict`` dictionary should be equal to the solution vector and total number of function evaluations, respectively. This is easy to verify:
fr: Si la procédure se termine correctement, les valeurs ``prev_vecteur`` et ``iters`` du dictionnaire ``callback_dict`` devraient être égales au vecteur solution et au nombre total d'évaluations de la fonction, respectivement. Ceci est facile à vérifier :
ja: このプロシージャーが正しく終了すれば、 ``callback_dict`` 辞書内の ``prev_vector`` と ``iters`` の値は、それぞれ解ベクトルと関数評価の総数に等しくなるはずです。これは簡単に確認でます：

source: We can also now view the progress towards convergence as monitored by the cost history at each iteration:
fr: Nous pouvons également observer la progression vers la convergence, telle qu'elle est suivie par l'historique des coûts à chaque itération :
ja: また、各反復におけるコスト履歴によってモニターされる収束への進捗状況を見ることもできるようになりました：

source: Here we define the problem instance for our VQE algorithm. Although the problem in question can come from a variety of domains, the form for execution through Runtime is the same. Qiskit provides a convenience class for expressing Hamiltonians in Pauli form, and a collection of widely used ansatz circuits in the ``qiskit.circuit.library``.
ja: ここでは、VQE アルゴリズムの問題インスタンスを定義します。問題の領域は様々ですが、Runtime を通して実行される形式は同じです。Qiskit はハミルトニアンをパウリ形式で表現するための便利なクラスと、広く使用されている ansatz 回路のコレクションを ``qiskit.circuit.library`` で提供しています。

source: From the previous figure we see that our ansatz circuit is defined by a vector of parameters, :math:`\theta_{i}`, with the total number given by:
ja: 上の図から、ansatz 回路はパラメーターのベクトル、:math:`\theta_{i}` で定義され、その総数は次式で与えられます：

source: We are now free to use a classical optimizer of our choice to minimize our cost function. Here we use the `COBYLA routine from SciPy through the ``minimize`` function <https://docs.scipy.org/doc/scipy/reference/generated/scipy.optimize.minimize.html>`__. Note that, when running on real quantum hardware, the choice of optimizer is important as not all optimizers handle noisy cost function landscapes equally well.
ja: コスト関数を最小化するために、古典オプティマイザーを自由に使うことができます。ここでは `SciPyのCOBYLAルーチンを ``minimize`` 関数 <https://docs.scipy.org/doc/scipy/reference/generated/scipy.optimize.minimize.html>`__ を通して使用します。実際の量子ハードウェア上で実行する場合、どのオプティマイザーも同じようにノイズの多いコスト関数を扱えるわけではないので、オプティマイザーの選択は重要であることに注意してください。

source: Variational Quantum Eigensolver with Estimator Primitive
es_un: Solucionador Propio Variacional Cuántico con Estimador Primitivo
ko_kr: 근원 추정기를 이용한 변분화된 양자 고윳값 해석기
pt_un: Variational Quantum Egienesolver com o primitivo Estimator
ta_in: மதிப்பீட்டாளர் ப்ரிமிட்டிவ் உடன் மாறுபட்ட குவாண்டம் ஈஜென்சொல்வர்

source: Overview
es_un: Descripción general
ko_kr: 개요
pt_un: Visão geral
ta_in: கண்ணோட்டம்

source: The Variational Quantum Eigensolver (VQE) is an optimization routine for finding the ground state energy (the lowest eigenvalue) of a `Hamiltonian <https://en.wikipedia.org/wiki/Hamiltonian_(quantum_mechanics)>`__ and is a considered to be a viable candidate for near-term hardware. In this tutorial, you will learn how to use Qiskit Runtime to submit variational jobs using the estimator primitive. Specifically, you will calculate the ground state energy of the :math:`H_2` molecule.
es_un: El Solucionador Propio Variacional Cuántico (Variational Quantum Eigensolver, VQE) es una rutina de optimización para encontrar la energía del estado fundamental (el valor propio más bajo) de un `Hamiltoniano <https://en.wikipedia.org/wiki/Hamiltonian_(quantum_mechanics)>`__ y es considerado a ser un candidato viable para el hardware a corto plazo. En este tutorial, aprenderás a usar Qiskit Runtime para enviar trabajos variacionales usando el estimator primitivo. Específicamente, calcularás la energía del estado fundamental de la molécula :math:`H_2`.

source: Set up your local development environment
es_un: Configura tu entorno de desarrollo local
ko_kr: 로컬 개발 환경 설정하기
pt_un: Configure o ambiente de desenvolvimento local
ta_in: உங்கள் உள்ளூர் மேம்பாட்டு சூழலை அமைக்கவும்

source: This tutorial requires a Qiskit Runtime service instance. If you haven’t done so already, follow `these steps <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ to set one up.
es_un: Este tutorial requiere una instancia de servicio Qiskit Runtime. Si aún no lo has hecho, sigue `estos pasos <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ para configurar uno.
ko_kr: 이 지침서는 Qiskit Runtime 서비스 인스턴스가 필요하다. 이것이 없다면 `이 단계 <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ 를 따라 설정을 한다.
pt_un: Este tutorial requer uma instância de serviço Qiskit Runtime. Se ainda não fez isso, siga `estas etapas <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ para configurar um.
ta_in: இந்த டுடோரியலுக்கு கிஸ்கிட் இயக்க நேர சேவை நிகழ்வுத் தேவை. நீங்கள் ஏற்கனவே அவ்வாறு செய்யவில்லை என்றால், ஒன்றை அமைக்க `இந்தப் படிகளைப் பின்பற்றவும் <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__.

source: Generate molecular Hamiltonians
es_un: Generar Hamiltonianos moleculares

source: This tutorial uses Qiskit Nature to generate and handle molecular Hamiltonians. If you haven’t already, you can install Qiskit Nature (and the PySCF addon) using the commands shown below. For more information about Qiskit Nature, see the `Getting started guide <https://qiskit.org/documentation/nature/getting_started.html>`__.
es_un: Este tutorial utiliza Qiskit Nature para generar y manejar Hamiltonianos moleculares. Si aún no lo has hecho, puedes instalar Qiskit Nature (y el complemento PySCF) usando los comandos que se muestran a continuación. Para obtener más información sobre Qiskit Nature, consulta la `guía de Primeros pasos <https://qiskit.org/documentation/nature/getting_started.html>`__.

source: Next, we will generate the Hamiltonians that we want to find the ground state energy of. The first step is to use the ``PySCFDriver`` to convert a string representing our molecule to an ``ElectronicStructureProblem``. The next step is to use the ``ParityMapper`` to convert this problem into a qubit Hamiltonian that can run on a quantum computer.
es_un: A continuación, generaremos los Hamiltonianos de los que queremos encontrar la energía del estado fundamental. El primer paso es usar ``PySCFDriver`` para convertir una cadena que represente a nuestra molécula en un ``ElectronicStructureProblem``. El siguiente paso es usar ``ParityMapper`` para convertir este problema en un Hamiltoniano de qubit que pueda ejecutarse en una computadora cuántica.

source: Solve classically
es_un: Resolver clásicamente

source: Since this problem is very small, we can solve it exactly using classical methods. The code below uses the minimum eigensolver from the ``NumPy`` package to find the electronic ground state energy (in Hartree units), which we will use to assess the performance of the VQE.
es_un: Como este problema es muy pequeño, podemos resolverlo exactamente usando métodos clásicos. El siguiente código usa el solucionador propio mínimo del paquete ``NumPy`` para encontrar la energía del estado fundamental electrónico (en unidades Hartree), que usaremos para evaluar el rendimiento del VQE.

source: Solve with VQE
es_un: Resolver con VQE

source: Next, we will create our service instance and specify our backend. In this example we will use a simulator to avoid queue times, but you can use the code below to run on a real device by simply changing the backend.
es_un: A continuación, crearemos nuestra instancia de servicio y especificaremos nuestro backend. En este ejemplo, usaremos un simulador para evitar tiempos de encolamiento, pero puedes usar el código a continuación para ejecutarlo en un dispositivo real simplemente cambiando el backend.

source: The next code cell specifies how we want to run the VQE. This includes
es_un: La siguiente celda de código especifica cómo queremos ejecutar el VQE. Esto incluye

source: the type of circuit (ansatz) used to create our trial state,
es_un: el tipo de circuito (ansatz) utilizado para crear nuestro estado de prueba,

source: the classical algorithm that decides how to adjust our trial state to acheive better solutions, and
es_un: el algoritmo clásico que decide cómo ajustar nuestro estado de prueba para lograr mejores soluciones, y

source: the starting parameters.
es_un: los parámetros de inicio.

source: We will also create a simple object to log our intermediate resuts for plotting later.
es_un: También crearemos un objeto simple para registrar resultados intermedios para graficarlos más tarde.

source: The next code cell runs the VQE algorithm. If you chose to run on a real device, the code runs `zero-noise extrapolation <https://arxiv.org/abs/2005.10921>`__ on the final result to estimate the effects of noise, and guess what the result would be from a noiseless device.
es_un: La siguiente celda de código ejecuta el algoritmo VQE. Si eliges ejecutar en un dispositivo real, el código ejecuta la `extrapolación de ruido cero <https://arxiv.org/abs/2005.10921>`__ en el resultado final para estimar los efectos del ruido y adivinar cuál sería el resultado de un dispositivo sin ruido.

source: Finally, the code cell below plots the intermediate results from the optimization process. The optimization algorithm tweaks the parameters to gradually home in on values that produce lower energies. Provided the algorithm does not get caught in a local minima, this graph will plateau at the electronic ground state energy of the molecule.
es_un: Finalmente, la siguiente celda de código grafica los resultados intermedios del proceso de optimización. El algoritmo de optimización ajusta los parámetros para ubicarse gradualmente en los valores que producen energías más bajas. Siempre que el algoritmo no quede atrapado en un mínimo local, esta gráfica se estancará en la energía del estado fundamental electrónico de la molécula.
