Repository: qiskit-community/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/vqe_with_estimator.po
Languages: es_un, fr, ja, ko_kr, pt_un, ta_in

source: The Variational Quantum Eigensolver (VQE) is an optimization routine for finding the ground state energy (i.e. lowest eigenvalue) of a Hamiltonian and is a considered to be a viable candidate for NISQ hardware. In this tutorial, we will go over how to use Qiskit Runtime to submit variational jobs using the estimator. Specifically, we will be looking at calculating the ground state energy of the :math:`H_2` molecule using the estimator primitive.
ko_kr: 변분화된 양자 고윳값 해석기(VQE)는 해밀토니안의 기저 상태 에너지 (최저의 고유값) 를 찾기 위한 최적화 루틴이며 NISQ 하드웨어로 실현 가능한 후보로 고려되고 있다. 이 튜토리얼에서는 Qiskit Runtime을 사용하여 추정기를 이용하여 변분 작업을 제출하는 방법에 대해서 알아볼것이다. 구체적으로 우리는 근원 추정기를 이용하여 :math:`H_2` 분자의 기저 상태 에너지를 계산 하는 법을 알아볼것이다.
pt_un: O Variational Quantum Eigensolver (VQE) é uma rotina de otimização para encontrar a energia do estado fundamental (ou seja, o menor eigenvalue) de um hamiltoniano e é considerado um candidato viável para o hardware NISQ. Neste tutorial, veremos como usar o Qiskit Runtime para enviar jobs variacionais usando o Estimator. Especificamente, vamos calcular a energia do estado fundamental da molécula :math:`H_2` usando o primitivo Estimator.
ta_in: மாறுபாடு குவாண்டம் ஈஜென்சோல்வர் (VQE) என்பது ஹாமில்டோனியனின் தரை நிலை ஆற்றலைக் (அதாவது மிகக் குறைந்த ஈஜென்வேல்யூ) கண்டறிவதற்கான ஒரு தேர்வுமுறை வாடிக்கையாகும், மேலும் இது NISQ வன்பொருளுக்கான சாத்தியமான வேட்பாளராகக் கருதப்படுகிறது. இந்த டுடோரியலில், மதிப்பீட்டாளரைப் பயன்படுத்தி மாறுபட்ட வேலைகளைச் சமர்பிக்க Qiskit இயக்க நேரத்தை எவ்வாறு பயன்படுத்துவது என்பதைப் பார்ப்போம். குறிப்பாக, மதிப்பீட்டாளர் பழமையானதைப் பயன்படுத்தி :math:`H_2` மூலக்கூறின் தரை நிலை ஆற்றலைக் கணக்கிடுவோம்.

source: Connect to the Qiskit Runtime service
ko_kr: Qiskit Runtime 서비스에 연결하기
pt_un: Conecte com o serviço Qiskit Runtime
ta_in: Qiskit இயக்க நேர சேவையுடன் இணைக்கவும்

source: First we have to create our service instance and specify our backend. In this example we will be working with a simulator for the sake of speed, but by simply changing this one line (for choice of backend) this could run on hardware as well.
ko_kr: 먼저 서비스 인스턴스를 작성하고 백엔드를 지정해야 한다. 이 예제에서는 속도를 위해 시뮬레이터를 사용할 예정이지만, 백엔드 선택 시 이 한줄만 변경하면 하드웨어에서도 실행할 수 있습니다.
pt_un: Primeiro temos que criar nossa instância de serviço e especificar nosso backend. Neste exemplo, estaremos trabalhando com um simulador por questão de velocidade, mas simplesmente alterando esta linha (para escolha do backend), isso também pode ser executado em hardware.
ta_in: முதலில் நாம் நமது சேவை நிகழ்வை உருவாக்கி நமது பின்தளத்தைக் குறிப்பிட வேண்டும். இந்த எடுத்துக்காட்டில் நாம் வேகத்திற்காக ஒரு சிமுலேட்டருடன் வேலை செய்வோம், ஆனால் இந்த ஒரு வரியை மாற்றுவதன் மூலம் (பின்தளத்தில் தேர்வு செய்ய) இது வன்பொருளிலும் இயங்கும்.

source: Generate Molecular Hamiltonians
ko_kr: 분자 해밀토니안 생성
pt_un: Gere Os Hamiltonianos Moleculares
ta_in: மூலக்கூறு ஹாமில்டோனியன்களை உருவாக்குங்கள்

source: We will be working with Qiskit Nature to generate and handle molecular hamiltonians. First though, we need to install these packages. This can be done through pip, using the commands shown below. For more information on setting up and working with Qiskit Nature, see this `guide <https://qiskit.org/documentation/nature/getting_started.html>`__.
ko_kr: 우리는 분자 해밀토니안을 생성하고 처리하기 위해 Qiskit Nature를 사용한다. 그러기 위해선, 이러한 패키지를 설치해야 한다. 이는 아래 표시된 명령을 사용하여 파이프를 통해 수행할 수 있다. Qiskit Nature 설정 및 작업에 대한 자세한 정보는 `안내서 <https://qiskit.org/documentation/nature/getting_started.html>`__ 를 참조하라.
ta_in: மூலக்கூறு ஹாமில்டோனியன்களை உருவாக்கவும் கையாளவும் கிஸ்கிட் நேச்சருடன் இணைந்து செயல்படுவோம். முதலில் இந்த தொகுப்புகளை நிறுவ வேண்டும். கீழே காட்டப்பட்டுள்ள கட்டளைகளைப் பயன்படுத்தி, பிப் மூலம் இதைச் செய்யலாம். கிஸ்கிட் நேச்சரை அமைப்பது மற்றும் வேலை செய்வது பற்றிய கூடுதல் தகவலுக்கு, இந்த `வழிகாட்டி <https://qiskit.org/documentation/nature/getting_started.html>`__ ஐப் பார்க்கவும்.

source: Now we need to generate the Hamiltonians that we wish to find the ground state energy of. For this task we will be utilizing Qiskit Nature. First we have to specify how we are converting the fermionic operators of the electronic molecular hamiltonian to qubit operators. Here we will use the Parity Mapper, which maps annihilation to Pauli operators via :math:`\hat{a} \rightarrow \frac{1}{2} \left ( X_p Z_{p-1} + i Y_p \right ) X_{p+1} ... X_{N}`
ko_kr: 이제 우리는 우리가 목표로 하는 기저 상태 에너지를 나타내는 해밀토니안을 생성해야 한다. 이러한 과제를 위하여 우리는 Qiskit Nature를 이용할 것이다. 첫째, 우리는 페르미온 연산자의 전자 분자 해밀토니안을 큐비트 연산자로 전환하는 방법을 명시해야 한다. 여기서 우리는 소멸 연산자를 파울리 연산자로 맵핑해주는 Parity Mapper를 사용할 것이다. 즉 :math:`\hat{a} \rightarrow \frac{1}{2} \left ( X_p Z_{p-1} + i Y_p \right ) X_{p+1} ... X_{N}` 이다.
pt_un: Agora precisamos gerar os hamiltonianos para os quais desejamos encontrar a energia do estado fundamental. Para esta tarefa, utilizaremos o Qiskit Nature. Primeiro temos que especificar como estamos convertendo os operadores fermiônicos do hamiltoniano molecular eletrônico para operadores qubit. Aqui usaremos o Parity Mapper, que mapeia as aniquilações para os operadores Pauli via :math:`\hat{a} \rightarrow \frac{1}{2} \left ( X_p Z_{p-1} + i Y_p \right ) X_{p+1} ... X_{N}`
ta_in: இப்போது நாம் தரை நிலை ஆற்றலைக் கண்டறிய விரும்பும் ஹாமில்டோனியர்களை உருவாக்க வேண்டும். இந்த பணிக்காக நாங்கள் கிஸ்கிட் இயற்கையைப் பயன்படுத்துவோம். எலக்ட்ரானிக் மூலக்கூறு ஹாமில்டோனியனின் ஃபெர்மியோனிக் ஆபரேட்டர்களை எப்படி குவிட் ஆபரேட்டர்களாக மாற்றுகிறோம் என்பதை முதலில் குறிப்பிட வேண்டும். இங்கே நாம் பாரிட்டி மேப்பரைப் பயன்படுத்துவோம், இது பாலி ஆபரேட்டர்களுக்கு அழிவை வரைபடமாக்குகிறது :math:`\hat{a} \rightarrow \frac{1}{2} \left ( X_p Z_{p-1} + i Y_p \right ) X_{p+1} ... X_{N}`

source: At our specified bond length we will create an electronic structure problem and generate the second quantized (i.e. fermionic) operators. We then compute the true ground state energy to compare against.
ko_kr: 지정된 결합 길이에서 전자 구조 문제점을 작성하고 두 번째 양자화된 (즉, fermionic) 연산자를 생성한다. 그런 다음 비교할 실제 기저 상태 에너지를 계산한다.
pt_un: No nosso comprimento de ligação especificado, criaremos um problema de estrutura eletrônica e geraremos os operadores de segunda quantização (ou seja, fermiônicos). Em seguida, calculamos a verdadeira energia do estado fundamental para comparar.
ta_in: எங்களின் குறிப்பிட்ட பத்திரத்தின் நீளத்தில், எலக்ட்ரானிக் கட்டமைப்புச் சிக்கலை உருவாக்கி, இரண்டாவது அளவு (அதாவது ஃபெர்மியோனிக்) ஆபரேட்டர்களை உருவாக்குவோம். பின்னர் ஒப்பிடுவதற்கு உண்மையான நில நிலை ஆற்றலைக் கணக்கிடுகிறோம்.

source: Now we can use this hamiltonian as the observable in our estimator factory. The VQE routine is formalized as :math:`\min_\theta \langle \Psi | \hat{H} | \Psi \rangle`, so we just need to minimize the expectation values of the hamiltonian.
ko_kr: 우리는 이 해밀턴을 우리의 추정기 공장에서 관찰할 수 있는 것으로 사용할 수 있다. VQE 루틴은 :math:`\min_\theta \langle \Psi | \hat{H} | \Psi \rangle` 로 공식화되므로, 우리는 해밀토니안의 예상 값을 최소화하기만 하면 된다.
pt_un: Agora podemos usar esse hamiltoniano como o observável em nossa estimator factory. A rotina VQE é formalizada como :math:`\min_\theta \langle \Psi | \hat{H} | \Psi \rangle`, então só precisamos minimizar os valores esperados do hamiltoniano.
ta_in: இப்போது இந்த ஹாமில்டோனியனை நமது மதிப்பீட்டாளர் தொழிற்சாலையில் காணக்கூடியதாகப் பயன்படுத்தலாம். VQE வழக்கம் :math:`\min_\theta \langle \Psi | \hat{H} | \Psi \rangle`, எனவே ஹாமில்டோனியனின் எதிர்பார்ப்பு மதிப்புகளை நாம் குறைக்க வேண்டும்.

source: Now that we solved the electronic hamiltonian, we have to add the nuclear energies.
ko_kr: 이제 전자 해밀토니안을 풀었으니, 핵에너지를 추가해야 한다.
pt_un: Agora que resolvemos o hamiltoniano eletrônico, temos que somar as energias nucleares.
ta_in: இப்போது நாம் எலக்ட்ரானிக் ஹாமில்டோனியனைத் தீர்த்துவிட்டோம், அணுசக்திகளைச் சேர்க்க வேண்டும்.

source: Create the convergence plot
ko_kr: 수렴 그래프 만들기
pt_un: Crie o plot de convergência
ta_in: ஒருங்கிணைப்பு திட்டத்தை உருவாக்கவும்
