Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/migration_guides/algorithms_migration.po
Languages: pt_un, ta, te

source: Finally, the phase estimators are the last group of algorithms to undergo the first type of refactoring (Algorithms refactored in-place). Instead of a :class:`~qiskit.utils.QuantumInstance`, :mod:`qiskit.algorithms.phase_estimators` are now initialized using an instance of any "Sampler" primitive e.g. :mod:`~qiskit.primitives.Sampler`.
pt_un: Finalmente, os estimadores de fase são o último grupo de algoritmos a passar pelo primeiro tipo de refatoração (Algoritmos refatorados no local). Em vez de uma classe :class:`~qiskit.utils.QuantumInstance`, :mod:`qiskit.algorithms.phase_estimators` agora são inicializados usando uma instância de qualquer primitiva "Sampler", por exemplo :mod:`~qiskit.primitives.Sampler`.
ta: இறுதியாக, கட்ட மதிப்பீட்டாளர்கள் என்பது முதல் வகை மறுசீரமைப்பிற்கு (அல்காரிதம்ஸ் ரீஃபாக்டார்ட் இன்-பிளேஸ்) உள்ள கடைசி அல்காரிதம் ஆகும். ஒரு :class:`~qiskit.utils.QuantumInstance` என்பதற்குப் பதிலாக, :mod:`qiskit.algorithms.phase_estimators` இப்போது ஏதேனும் "மாதிரி" பழமையான நிகழ்வைப் பயன்படுத்தி துவக்கப்படுகிறது எ.கா. :mod:`~qiskit.primitives.Sampler`.
te: చివరగా, ఫేస్ ఎస్టిమేటర్‌లు మొదటి రకం రీఫ్యాక్టరింగ్ (అల్గారిథమ్స్ రీఫ్యాక్టర్డ్ ఇన్-ప్లేస్) చేయించుకునే చివరి అల్గారిథమ్‌ల సమూహం. ఒక :class:`~qiskit.utils.QuantumInstance`కి బదులుగా, :mod:`qiskit.algorithms.phase_estimators` ఇప్పుడు ఏదైనా "Sampler" ప్రిమిటివ్ ఇన్స్టన్స్ను ఉపయోగించి ప్రారంభించబడ్డాయి ఉదా. :mod:`~qiskit.primitives.Sampler`.

source: The full :mod:`qiskit.algorithms.phase_estimators` module has been refactored in place. No need to change import paths.
pt_un: O módulo :mod:`qiskit.algorithms.phase_estimators` completo foi refatorado. Não há necessidade de alterar os caminhos de importação.
ta: முழு :mod:`qiskit.algorithms.phase_estimators' தொகுதி மறுவடிவமைக்கப்பட்டுள்ளது. இறக்குமதி பாதைகளை மாற்ற வேண்டிய அவசியமில்லை.
te: పూర్తి :mod:`qiskit.algorithms.phase_estimators` మాడ్యూల్ స్థానంలో రీఫ్యాక్టర్ చేయబడింది. ఇంపోర్ట్ మార్గాలను మార్చాల్సిన అవసరం లేదు.

source: IPE Example
pt_un: Exemplo de IPE
ta: IPE எடுத்துக்காட்டு
te: IPE ఉదాహరణ

source: `Iterative Phase Estimation <https://qiskit.org/documentation/tutorials/algorithms/09_IQPE.html>`_
pt_un: `Estimativa de fase Iterativa <https://qiskit.org/documentation/tutorials/algorithms/09_IQPE.html>`_
ta: `மீண்டும் மீண்டும் கட்ட மதிப்பீடு <https://qiskit.org/documentation/tutorials/algorithms/09_IQPE.html>`_

source: *Back to* `TL;DR`_
pt_un: *De volta a* `TL;DR`_

source: `Opflow migration guide <https://qisk.it/opflow_migration>`_
pt_un: `Guia de migração Opflow <https://qisk.it/opflow_migration>`_
te: `ఆప్‌ఫ్లో మైగ్రేషన్ గైడ్ <https://qisk.it/opflow_migration>`_
