Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/migration_guides/algorithms_migration.po
Languages: pt_un, ta, te

source: The eigensolver algorithms also belong to the first type of refactoring (Algorithms refactored in a new location to support :mod:`~qiskit.primitives`). Instead of a :class:`~qiskit.utils.QuantumInstance`, :mod:`qiskit.algorithms.eigensolvers` are now initialized using an instance of the :class:`~qiskit.primitives.Sampler` or :class:`~qiskit.primitives.Estimator` primitive, or **a primitive-based subroutine**, depending on the algorithm. The legacy classes can still be found in :mod:`qiskit.algorithms.eigen_solvers`.
pt_un: Os algoritmos eigensolver também pertencem ao primeiro tipo de refatoração (Algoritmos refatorados em um novo local para suportar :mod:`~qiskit.primitives`). Em vez de uma :class:`~qiskit.utils.QuantumInstance`, :mod:`qiskit.algorithms.eigensolvers` eles agora são inicializados usando uma instância de :class:`~qiskit.primitives.Sampler` ou :class:`~ qiskit.primitives.Estimator` primitivo, ou **uma sub-rotina baseada em primitivo**, dependendo do algoritmo. As classes legadas ainda podem ser encontradas em :mod:`qiskit.algorithms.eigen_solvers`.
ta: Eigensolver அல்காரிதம்களும் முதல் வகை மறுசீரமைப்பைச் சேர்ந்தவை (அல்காரிதம்கள் :mod:`~qiskit.primitives` ஐ ஆதரிக்க ஒரு புதிய இடத்தில் மறுசீரமைக்கப்பட்டது). :class:`~qiskit.primitives.Sampler` அல்லது :class:`~ என்பதற்குப் பதிலாக :class:`~qiskit.utils.QuantumInstance`, :mod:`qiskit.algorithms.eigensolvers` இப்போது துவக்கப்பட்டுள்ளது. qiskit.primitives.Estimator` primitive, அல்லது ** a primitive-based subroutine**, அல்காரிதம் சார்ந்தது. மரபு வகுப்புகளை இன்னும் :mod:`qiskit.algorithms.eigen_solvers` இல் காணலாம்.
te: ఐగెన్ సాల్వర్ అల్గారిథమ్‌లు కూడా మొదటి రీఫ్యాక్టరింగ్‌ రకానికి చెందినవి (అల్గారిథమ్‌లు :mod:`~qiskit.primitives`కి మద్దతు ఇవ్వడానికి కొత్త ప్రదేశంలో రీఫ్యాక్టర్డ్ చేయబడ్డాయి). :class:`~qiskit.utils.QuantumInstance` కి బదులుగా,ఇప్పుడు అల్గోరిథం ఆధారంగా :mod:`qiskit.algorithms.eigensolvers` :class:`~qiskit.primitives.Sampler` లేదా :class:`~qiskit.primitives.Estimator` ప్రిమిటివ్ లేదా **ఒక ప్రిమిటివ్-ఆధారిత subroutine** యొక్క ఇన్స్టన్స్ని ఉపయోగించి ఇన్స్టసియేట్ చేయబడ్డాయి.. లెగసీ క్లాస్లను ఇప్పటికీ :mod:`qiskit.algorithms.eigen_solvers`లో కనుగొనవచ్చు.

source: For the :mod:`qiskit.algorithms.eigensolvers` classes, depending on the import path, you will access either the primitive-based or the quantum-instance-based implementation. You have to be extra-careful, because the class name does not change.
pt_un: Para as classes de :mod:`qiskit.algorithms.eigensolvers`, dependendo do caminho de importação, você acessará a implementação baseada em primitivas ou baseada em instância quântica. Você tem que ter muito cuidado, porque o nome da classe não muda.
ta: :mod:`qiskit.algorithms.eigensolvers' வகுப்புகளுக்கு, இறக்குமதி பாதையைப் பொறுத்து, நீங்கள் பழமையான அடிப்படையிலான அல்லது குவாண்டம்-உதாரண அடிப்படையிலான செயல்படுத்தலை அணுகலாம். வகுப்பின் பெயர் மாறாததால், நீங்கள் கூடுதல் கவனமாக இருக்க வேண்டும்.
te: :mod:`qiskit.algorithms.eigensolvers` క్లాస్ల కోసం, ఇంపోర్ట్ మార్గంపై ఆధారపడి, మీరు ప్రిమిటివ్-ఆధారిత లేదా క్వాంటం-ఇన్స్టన్స్-ఆధారిత ఇంప్లీమెంటేషన్ ను యాక్సెస్ చేస్తారు. క్లాస్ పేరు మారనందువలన, మీరు చాలా జాగ్రత్తగా ఉండాలి.

source: Old import path (Quantum Instance): ``from qiskit.algorithms import VQD, NumPyEigensolver``
pt_un: Antigo caminho de importação (Instância Quantum): ``from qiskit.algorithms import VQD, NumPyEigensolver``
ta: பழைய இறக்குமதி பாதை (குவாண்டம் நிகழ்வு): ``qiskit.algorithms இலிருந்து VQD, NumPyEigensolver இறக்குமதி செய்க``
te: పాత ఇంపోర్ట్ మార్గం (క్వాంటం ప్రిమిటివ్): ``from qiskit.algorithms import VQD, NumPyEigensolver``

source: New import path (Primitives): ``from qiskit.algorithms.eigensolvers import VQD, NumPyEigensolver``
pt_un: Novo caminho de importação (Primitivas): ``from qiskit.algorithms.eigensolvers import VQD, NumPyEigensolver``
ta: புதிய இறக்குமதி பாதை (Primitives): ``qiskit.algorithms.eigensolvers இறக்குமதி VQD, NumPyEigensolver``
te: కొత్త ఇంపోర్ట్ మార్గం (ప్రిమిటివ్స్): ` ` from qiskit.algorithms.eigensolvers import VQD, NumPyEigensolver `

source: The new :class:`qiskit.algorithms.eigensolvers.VQD` class is initialized with an instance of the :class:`~qiskit.primitives.Estimator` primitive instead of a :class:`~qiskit.utils.QuantumInstance`. In addition to this, it takes an instance of a state fidelity class from mod:`qiskit.algorithms.state_fidelities`, such as the :class:`~qiskit.primitives.Sampler`-based :class:`~qiskit.algorithms.state_fidelities.ComputeUncompute`.
pt_un: A nova classe :class:`qiskit.algorithms.eigensolvers.VQD` é inicializada com uma instância de :class:`~qiskit.primitives.Estimator` ao invés de uma :class:`~qiskit.utils.QuantumInstance`. Além disso, ela usa uma instância de uma classe de fidelidade de estado de mod:`qiskit.algorithms.state_fidelities`, como a :class:`~qiskit.primitives.Sampler` baseada em :class:`~qiskit.algorithms. state_fidelities.ComputeUncompute`.
ta: புதிய :class:`qiskit.algorithms.eigensolvers.VQD` வகுப்பானது :class:`~qiskit.utils.QuantumInstance` என்பதற்குப் பதிலாக :class:`~qiskit.primitives.Estimator` primitive இன் உதாரணத்துடன் துவக்கப்பட்டது. இது தவிர, இது mod:`qiskit.algorithms.state_fidelities` இலிருந்து மாநில நம்பகத்தன்மை வகுப்பின் உதாரணத்தை எடுத்துக்கொள்கிறது, அதாவது :class:`~qiskit.primitives.Sampler`-அடிப்படையிலான :class:`~qiskit.algorithms. மாநில_நம்பிக்கைகள்.கணக்கிடப்படாதது`.
te: కొత్త :class:`qiskit.algorithms.eigensolvers.VQD` క్లాస్ :class:`~qiskit.utils.QuantumInstance` కి బదులుగా :class:`~qiskit.primitives.Estimator` యొక్క ఇన్స్టన్స్తో ప్రారంభించబడింది. దీనికి అదనంగా, ఇది mod:`qiskit.algorithms.state_fidelities` నుండి స్టేట్ ఫిడిలిటీ క్లాస్ యొక్క ఉదాహరణను తీసుకుంటుంది, ఉదాహరణకు :class:`~qiskit.primitives.Sampler`-ఆధారిత :class:`~qiskit.algorithms.state_fidelities.ComputeUncompute`.

source: In addition to taking in an :mod:`~qiskit.primitives.Estimator` instance instead of a :class:`~qiskit.utils.QuantumInstance`, the new :class:`~qiskit.algorithms.eigensolvers.VQD` signature has undergone the following changes:
pt_un: Além de receber uma instância de :mod:`~qiskit.primitives.Estimator` em vez de uma :class:`~qiskit.utils.QuantumInstance`, a nova assinatura da :class:`~qiskit.algorithms.eigensolvers.VQD` sofreu as seguintes alterações:
ta: :class:`~qiskit.utils.QuantumInstance` என்பதற்குப் பதிலாக :mod:`~qiskit.primitives.Estimator` நிகழ்வை எடுத்துக்கொள்வதோடு, புதிய :class:`~qiskit.algorithms.eigensolvers.VQD` கையொப்பம் உள்ளது. பின்வரும் மாற்றங்களுக்கு உட்பட்டது:
te: :class:`~qiskit.utils.QuantumInstance`కి బదులుగా :mod:`~qiskit.primitives.Estimator` ఇన్‌స్టాన్స్ తీసుకోవడంతో పాటు, కొత్త :class:`~qiskit.algorithms.eigensolvers.VQD` సిగ్నెచర్ కింది మార్పులకు గురైంది:

source: The custom ``fidelity`` parameter has been added, and the custom ``gradient`` parameter has been removed, as current classes in :mod:`qiskit.algorithms.gradients` cannot deal with state fidelity gradients.
pt_un: O parâmetro personalizado ``fidelity`` foi adicionado e o parâmetro personalizado ``gradient`` foi removido, pois as classes atuais em :mod:`qiskit.algorithms.gradients` não podem lidar com gradientes de fidelidade de estado.
ta: தனிப்பயன் ``fidelity`` அளவுரு சேர்க்கப்பட்டது, மேலும் தனிப்பயன் ``கிரேடியன்ட்`` அளவுரு அகற்றப்பட்டது, ஏனெனில் :mod:`qiskit.algorithms.gradients` இல் உள்ள தற்போதைய வகுப்புகள் மாநில நம்பக சாய்வுகளைக் கையாள முடியாது.
te: కస్టమ్ ``fidelity` పెరామీటర్ జోడించబడింది మరియు కస్టమ్ ``gradient`` పెరామీటర్ తీసివేయబడింది, ఎందుకంటే :mod:`qiskit.algorithms.gradients`లో ప్రస్తుత క్లాసులు స్టేట్ ఫిడెలిటీ గ్రేడియెంట్లతో వ్యవహరించలేవు.

source: The ``estimator``, ``fidelity``, ``ansatz`` and ``optimizer`` are the only parameters that can be defined positionally (and in this order), all others have become keyword-only arguments.
pt_un: O ``estimator``, ``fidelity``, ``ansatz`` e ``optimizer`` são os únicos parâmetros que podem ser definidos posicionalmente (e nesta ordem), todos os outros se tornaram parâmetros keyword-only.
ta: ``மதிப்பிடுபவர்``, ``விசுவாசம்``, ``ansatz`` மற்றும் ``உகப்பாக்கி`` ஆகியவை நிலைப்பாட்டில் வரையறுக்கப்படக்கூடிய ஒரே அளவுருக்கள் (மற்றும் இந்த வரிசையில்), மற்ற அனைத்தும் முக்கிய வார்த்தைகள் மட்டுமே.
te: ``estimator``, ``fidelity``, ``ansatz`` మరియు ``optimizer`` మాత్రమే స్థానపరంగా (మరియు ఈ క్రమంలో) నిర్వచించగల పారామీటర్‌లు, మిగతావన్నీ కీవర్డ్-ఓన్లీ ఆర్గ్యుమెంట్‌లుగా మారాయి.

source: Similarly to VQE, the new :class:`~qiskit.algorithms.eigensolvers.VQDResult` class does not include the state anymore. If your application requires the final probability distribution, you can instantiate a ``Sampler`` and run it with the optimal circuit for the desired excited state after running :class:`~qiskit.algorithms.eigensolvers.VQD`.
pt_un: Da mesma forma que o VQE, a nova classe :class:`~qiskit.algorithms.eigensolvers.VQDResult` não inclui mais o estado. Se sua aplicação exige a distribuição de probabilidade final, você pode instanciar um ``Sampler`` e executá-lo com o circuito ideal para o estado excitado desejado após executar a classe :class:`~qiskit.algorithms.eigensolvers.VQD`.
ta: VQE ஐப் போலவே, புதிய :class:`~qiskit.algorithms.eigensolvers.VQDResult` வகுப்பில் நிலை சேர்க்கப்படவில்லை. உங்கள் பயன்பாட்டிற்கு இறுதி நிகழ்தகவு விநியோகம் தேவைப்பட்டால், நீங்கள் ஒரு ``மாதிரி`` ஐ உடனடியாக உருவாக்கலாம் மற்றும் :class:`~qiskit.algorithms.eigensolvers.VQD` இயங்கிய பிறகு விரும்பிய உற்சாகமான நிலைக்கு உகந்த சுற்றுடன் அதை இயக்கலாம்.
te: VQE విధంగా , కొత్త :class:`~qiskit.algorithms.eigensolvers.VQDResult` క్లాస్ ఇకపై స్టేట్ని చేర్చదు. మీ అనువర్తనానికి తుది సంభావ్యత డిస్ట్రిబ్యూషన్ అవసరమైతే, మీరు ``Sampler``ని తక్షణం చేయవచ్చు మరియు :class:`~qiskit.algorithms.eigensolvers.VQD`ని అమలు చేసిన తర్వాత కావలసిన ఉత్తేజిత స్థితికి అనుకూలమైన సర్క్యూట్‌తో దాన్ని అమలు చేయవచ్చు.

source: VQD Example
pt_un: Exemplo de VQD
ta: VQD எடுத்துக்காட்டு
te: VQD ఉదాహరణలు

source: For complete code examples, see the following updated tutorial:
pt_un: Para obter exemplos de código completos, consulte o seguinte tutorial atualizado:
ta: முழுமையான குறியீடு எடுத்துக்காட்டுகளுக்கு, பின்வரும் மேம்படுத்தப்பட்ட டுடோரியலைப் பார்க்கவும்:
te: పూర్తి కోడ్ ఉదాహరణల కోసం, కింది నవీకరించబడిన ట్యుటోరియల్‌ని చూడండి:

source: NumPyEigensolver
ta: நம்பைஐகேன்சால்வர்

source: Similarly to its minimum eigensolver counterpart, because this is a classical solver, the workflow has not changed between the old and new implementation. The import has however changed from :class:`qiskit.algorithms.eigen_solvers.NumPyEigensolver` to :class:`qiskit.algorithms.eigensolvers.MinimumEigensolver` to conform to the new interfaces and result classes.
pt_un: Da mesma forma que a contraparte do minimum eigensolver, uma vez que este é um solucionador clássico, o fluxo de trabalho não mudou entre a implementação antiga e a nova. No entanto, a importação mudou de :class:`qiskit.algorithms.eigen_solvers.NumPyEigensolver` para :class:`qiskit.algorithms.eigensolvers.MinimumEigensolver` para se adequar às novas interfaces e classes de resultado.
ta: அதன் குறைந்தபட்ச eigensolver எண்ணைப் போலவே, இது ஒரு கிளாசிக்கல் தீர்வு என்பதால், பழைய மற்றும் புதிய செயலாக்கத்திற்கு இடையே பணிப்பாய்வு மாறவில்லை. இருப்பினும் இறக்குமதியானது புதிய இடைமுகங்கள் மற்றும் முடிவு வகுப்புகளுக்கு இணங்க :class:`qiskit.algorithms.eigen_solvers.NumPyEigensolver` இலிருந்து :class:`qiskit.algorithms.eigensolvers.MinimumEigensolver` ஆக மாற்றப்பட்டுள்ளது.
te: దాని కనీస ఐగెన్ సాల్వర్ కౌంటర్‌పార్ట్ విధంగా, ఇది క్లాసికల్ సాల్వర్ అయినందున, పాత మరియు కొత్త అమలు మధ్య వర్క్‌ఫ్లో మారలేదు. అయితే కొత్త ఇంటర్‌ఫేస్‌లు మరియు రిసల్ట్ క్లాసులకు అనుగుణంగా :class:`qiskit.algorithms.eigen_solvers.NumPyEigensolver` నుండి :class:`qiskit.algorithms.eigensolvers.MinimumEigensolver`కి ఇంపోర్ట్ మార్చబడింది.

source: NumPyEigensolver Example
pt_un: Exemplo de NumPyEigensolver
ta: நம்பைஐகேன்சல்வர் எடுத்துக்காட்டு
te: NumPyEigensolver ఉదాహరణ

source: Time Evolvers
ta: `டைம் எவால்வர்ஸ்`_
te: టైం ఎవెల్వర్లు

source: The time evolvers are the last group of algorithms to undergo the first type of refactoring (Algorithms refactored in a new location to support :mod:`~qiskit.primitives`). Instead of a :class:`~qiskit.utils.QuantumInstance`, :mod:`qiskit.algorithms.time_evolvers` are now initialized using an instance of the :class:`~qiskit.primitives.Estimator` primitive. The legacy classes can still be found in :mod:`qiskit.algorithms.evolvers`.
pt_un: Os evoluidores de tempo são o último grupo de algoritmos a passar pelo primeiro tipo de refatoração (Algoritmos refatorados em um novo local para suportar :mod:`~qiskit.primitives`). Em vez de :class:`~qiskit.utils.QuantumInstance`, :mod:`qiskit.algorithms.time_evolvers` agora são inicializados usando uma instância da primitiva :class:`~qiskit.primitives.Estimator`. As classes legadas ainda podem ser encontradas em :mod:`qiskit.algorithms.evolvers`.
ta: டைம் எவால்வர்கள் என்பது முதல் வகை மறுசீரமைப்பிற்கு உட்பட்ட கடைசி அல்காரிதம்களின் குழுவாகும் (அல்காரிதம்கள் புதிய இடத்தில் மறுசீரமைக்கப்பட்டது :mod:`~qiskit.primitives`). :class:`~qiskit.utils.QuantumInstance` என்பதற்குப் பதிலாக, :mod:`qiskit.algorithms.time_evolvers` ஆனது இப்போது :class:`~qiskit.primitives.Estimator` primitive இன் நிகழ்வைப் பயன்படுத்தி துவக்கப்படுகிறது. மரபு வகுப்புகளை இன்னும் :mod:`qiskit.algorithms.evolvers` இல் காணலாம்.
te: టైమ్ ఎవాల్వర్‌లు మొదటి రకం రీఫ్యాక్టరింగ్‌కు లోనయ్యే చివరి అల్గారిథమ్‌ల సమూహం (ఆల్గారిథమ్‌లు :mod:`~qiskit.primitives`కి మద్దతు ఇవ్వడానికి కొత్త ప్రదేశంలో రీఫ్యాక్టర్డ్ చేయబడ్డాయి). బదులుగా :class:`~qiskit.utils.QuantumInstance`, :mod:`qiskit.algorithms.time_evolvers` ఇప్పుడు :class:`~qiskit.primitives.Estimator` primitive యొక్క ఉదాహరణను ఉపయోగించి ప్రారంభించబడ్డాయి. లెగసీ క్లాసులు ఇప్పటికీ :mod:`qiskit.algorithms.evolvers`లో కనుగొనవచ్చు.

source: On top of the migration, the module has been substantially expanded to include **Variational Quantum Time Evolution** (:class:`~qiskit.algorithms.time_evolvers.VarQTE`\) solvers.
pt_un: Além da migração, o módulo foi substancialmente expandido para incluir **Variational Quantum Time Evolution** (:class:`~qiskit.algorithms.time_evolvers.VarQTE`\).
ta: இடம்பெயர்வுக்கு மேல், **மாரியல் குவாண்டம் டைம் எவல்யூஷன்** (:class:`~qiskit.algorithms.time_evolvers.VarQTE`\) தீர்வுகளை உள்ளடக்கும் வகையில் தொகுதி கணிசமாக விரிவுபடுத்தப்பட்டுள்ளது.
te: మైగ్రేషన్ పైన, **వేరియేషనల్ క్వాంటం టైమ్ ఎవల్యూషన్** (:class:`~qiskit.algorithms.time_evolvers.VarQTE`\) సాల్వర్‌లను చేర్చడానికి మాడ్యూల్ గణనీయంగా విస్తరించబడింది.

source: For the :class:`qiskit.algorithms.time_evolvers.TrotterQRTE` class, depending on the import path, you will access either the primitive-based or the quantum-instance-based implementation. You have to be extra-careful, because the class name does not change.
pt_un: Para a classe :class:`qiskit.algorithms.time_evolvers.TrotterQRTE`, dependendo do caminho de importação, você acessará a implementação baseada em primitiva ou baseada em instância quântica. Você tem que ter muito cuidado, porque o nome da classe não muda.
ta: :class:`qiskit.algorithms.time_evolvers.TrotterQRTE` வகுப்பிற்கு, இறக்குமதி பாதையைப் பொறுத்து, நீங்கள் பழமையான அடிப்படையிலான அல்லது குவாண்டம்-உதாரண அடிப்படையிலான செயல்படுத்தலை அணுகலாம். வகுப்பின் பெயர் மாறாததால், நீங்கள் கூடுதல் கவனமாக இருக்க வேண்டும்.
te: :class:`qiskit.algorithms.time_evolvers.TrotterQRTE` క్లాస్ కోసం, ఇంపోర్ట్ మార్గంపై ఆధారపడి, మీరు ప్రిమిటివ్-ఆధారిత లేదా క్వాంటం-ఇన్స్టన్స్-ఆధారిత ఇంప్లీమెంటేషన్ను యాక్సెస్ చేస్తారు. , ఎందుకంటే క్లాస్ పేరు మారనందువలన, మీరు చాలా జాగ్రత్తగా ఉండాలి.

source: Old import path (Quantum Instance): ``from qiskit.algorithms import TrotterQRTE``
pt_un: Antigo caminho de importação (Quantum Instance): ``from qiskit.algorithms import TrotterQRTE``
ta: பழைய இறக்குமதி பாதை (குவாண்டம் நிகழ்வு): ``qiskit.algorithms இறக்குமதி TrotterQRTE``
te: పాత ఇంపోర్ట్ మార్గం (క్వాంటం ఇన్స్టన్స్): ``from qiskit.algorithms import TrotterQRTE``

source: New import path (Primitives): ``from qiskit.algorithms.time_evolvers import TrotterQRTE``
pt_un: Novo caminho de importação (Primitives): ``from qiskit.algorithms.time_evolvers import TrotterQRTE``
ta: புதிய இறக்குமதி பாதை (Primitives): ``qiskit.algorithms.time_evolvers இறக்குமதி TrotterQRTE``
te: కొత్త ఇంపోర్ట్ మార్గం (ప్రిమిటివ్స్): ``from qiskit.algorithms.time_evolvers import TrotterQRTE``

source: The ``expectation`` parameter has been removed, as this functionality is now defined at the ``Estimator`` level.
pt_un: O parâmetro ``expectation`` foi removido, já que esta funcionalidade agora é definida no nível ``Estimator``.
ta: ``எதிர்பார்ப்பு`` அளவுரு அகற்றப்பட்டது, ஏனெனில் இந்தச் செயல்பாடு இப்போது `` மதிப்பீட்டாளர்`` அளவில் வரையறுக்கப்பட்டுள்ளது.
te: ఈ కార్యాచరణ ఇప్పుడు `` Estimator`` స్థాయిలో నిర్వచించబడినందున ``expectation`` పారామీటర్‌ తీసివేయబడింది.

source: The ``num_timesteps`` parameters has been added, to allow to define the number of steps the full evolution time is divided into.
pt_un: Os parâmetros ``num_timesteps`` foram adicionados, para permitir definir o número de etapas em que o tempo de evolução completo é dividido.
ta: முழு பரிணாம நேரத்தைப் பிரிக்கும் படிகளின் எண்ணிக்கையை வரையறுக்க அனுமதிக்க, ``num_timesteps`` அளவுருக்கள் சேர்க்கப்பட்டுள்ளன.
te: పూర్తి పరిణామ సమయాన్ని విభజించిన దశల సంఖ్యను నిర్వచించడానికి అనుమతించడానికి ``num_timesteps`` పారామితులు జోడించబడ్డాయి.

source: TrotterQRTE Example
pt_un: Exemplo de TrotterQRTE
ta: TrotterQRTE எடுத்துக்காட்டு
te: TrotterQRTE ఉదాహరణ

source: Amplitude Amplifiers
pt_un: Amplificadores de Amplitude
ta: `அலைவீச்சு பெருக்கிகள்`_

source: The amplitude amplifier algorithms belong to the second type of refactoring (Algorithms refactored in-place). Instead of a :class:`~qiskit.utils.QuantumInstance`, :mod:`qiskit.algorithms.amplitude_amplifiers` are now initialized using an instance of any "Sampler" primitive e.g. :mod:`~qiskit.primitives.Sampler`.
pt_un: Os algoritmos amplificadores de amplitude pertencem ao segundo tipo de refatoração (Algoritmos refatorados no local). Em vez de uma classe :class:`~qiskit.utils.QuantumInstance`, :mod:`qiskit.algorithms.amplitude_amplifiers` agora são inicializados usando uma instância de qualquer primitiva "Sampler", por exemplo :mod:`~qiskit.primitives.Sampler`.
ta: அலைவீச்சு பெருக்கி வழிமுறைகள் இரண்டாவது வகை மறுசீரமைப்பைச் சேர்ந்தவை (அல்காரிதம்கள் இன்-இடத்தில் மறுசீரமைக்கப்பட்டவை). ஒரு :class:`~qiskit.utils.QuantumInstance` என்பதற்குப் பதிலாக, :mod:`qiskit.algorithms.amplitude_amplifiers` இப்போது ஏதேனும் "சாம்ப்ளர்" பழமையான நிகழ்வைப் பயன்படுத்தி துவக்கப்படுகிறது எ.கா. :mod:`~qiskit.primitives.Sampler`.
te: యాంప్లిట్యూడ్ యాంప్లిఫైయర్ అల్గోరిథంలు రెండవ రకమైన రీఫ్యాక్టరింగ్‌కు చెందినవి (అల్గారిథమ్‌లు ఇన్-ప్లేస్ లో రీఫ్యాక్టర్ చేయబడ్డాయి). ఒక :class:`~qiskit.utils.QuantumInstance`కి బదులుగా, :mod:`qiskit.algorithms.amplitude_amplifiers` ఇప్పుడు ఏదైనా "Sampler" ప్రిమిటివ్ ఉదాహరణను ఉపయోగించి ప్రారంభించబడ్డాయి ఉదా. :mod:`~qiskit.primitives.Sampler`.

source: The full :mod:`qiskit.algorithms.amplitude_amplifiers` module has been refactored in place. No need to change import paths.
pt_un: O módulo completo :mod:`qiskit.algorithms.amplitude_amplifiers` foi refatorado no lugar. Não há necessidade de alterar os caminhos de importação.
ta: முழு :mod:`qiskit.algorithms.amplitude_amplifiers' தொகுதி மறுவடிவமைக்கப்பட்டுள்ளது. இறக்குமதி பாதைகளை மாற்ற வேண்டிய அவசியமில்லை.
te: పూర్తి :mod:`qiskit.algorithms.amplitude_amplifiers` మాడ్యూల్ స్థానంలో రీఫ్యాక్టర్ చేయబడింది. ఇంపోర్ట్ మార్గాలను మార్చాల్సిన అవసరం లేదు.

source: Grover Example
pt_un: Exemplo de Grover
ta: கிராவர் எடுத்துக்காட்டு
te: Grover ఉదాహరణ

source: `Amplitude Amplification and Grover <https://qiskit.org/documentation/tutorials/algorithms/06_grover.html>`_
pt_un: `Amplificação de Amplitude e Grover <https://qiskit.org/documentation/tutorials/algorithms/06_grover.html>`_
ta: `வீச்சு பெருக்கம் மற்றும் குரோவர் <https://qiskit.org/documentation/tutorials/algorithms/06_grover.html>`_

source: `Grover Examples <https://qiskit.org/documentation/tutorials/algorithms/07_grover_examples.html>`_
pt_un: `Exemplos de Grover <https://qiskit.org/documentation/tutorials/algorithms/07_grover_examples.html>`_
ta: `க்ரோவர் எடுத்துக்காட்டுகள் <https://qiskit.org/documentation/tutorials/algorithms/07_grover_examples.html>`_
te: ` Grover ఉదాహరణలు <https://qiskit.org/documentation/tutorials/algorithms/07_grover_examples.html>` _

source: Amplitude Estimators
pt_un: Estimadores de Amplitude
ta: `அலைவீச்சு மதிப்பீட்டாளர்கள்`_

source: Similarly to the amplitude amplifiers, the amplitude estimators also belong to the second type of refactoring (Algorithms refactored in-place). Instead of a :class:`~qiskit.utils.QuantumInstance`, :mod:`qiskit.algorithms.amplitude_estimators` are now initialized using an instance of any "Sampler" primitive e.g. :mod:`~qiskit.primitives.Sampler`.
pt_un: Da mesma forma que os amplificadores de amplitude, os estimadores de amplitude também pertencem ao segundo tipo de refatoração (Algoritmos refatorados no local). Em vez de uma classe :class:`~qiskit.utils.QuantumInstance`, :mod:`qiskit.algorithms.amplitude_estimators` agora são inicializados usando uma instância de qualquer primitiva "Sampler", por exemplo :mod:`~qiskit.primitives.Sampler`.
ta: வீச்சு பெருக்கிகளைப் போலவே, அலைவீச்சு மதிப்பீட்டாளர்களும் இரண்டாவது வகை மறுசீரமைப்பைச் சேர்ந்தவை (அல்காரிதம்ஸ் இன்-பிளேஸ் மறுசீரமைப்பு). ஒரு :class:`~qiskit.utils.QuantumInstance` என்பதற்குப் பதிலாக, :mod:`qiskit.algorithms.amplitude_estimators` என்பது இப்போது ஏதேனும் "மாதிரி" பழமையான நிகழ்வைப் பயன்படுத்தி துவக்கப்படுகிறது எ.கா. :mod:`~qiskit.primitives.Sampler`.
te: యాంప్లిట్యూడ్ యాంప్లిఫైయర్‌ల మాదిరిగానే, యాంప్లిట్యూడ్ ఎస్టిమేటర్‌లు కూడా రెండవ రకం రీఫ్యాక్టరింగ్‌కు చెందినవి (అల్గారిథమ్స్ రీఫ్యాక్టర్డ్ ఇన్-ప్లేస్). ఒక :class:`~qiskit.utils.QuantumInstance`కి బదులుగా, :mod:`qiskit.algorithms.amplitude_estimators` ఇప్పుడు ఏదైనా "Sampler" ప్రిమిటివ్ ఇన్స్టన్స్ను ఉపయోగించి ప్రారంభించబడ్డాయి ఉదా. :mod:`~qiskit.primitives.Sampler`.

source: The full :mod:`qiskit.algorithms.amplitude_estimators` module has been refactored in place. No need to change import paths.
pt_un: O módulo completo :mod:`qiskit.algorithms.amplitude_estimators` foi refatorado no local. Não há necessidade de alterar os caminhos de importação.
ta: முழு :mod:`qiskit.algorithms.amplitude_estimators' தொகுதி மறுவடிவமைக்கப்பட்டுள்ளது. இறக்குமதி பாதைகளை மாற்ற வேண்டிய அவசியமில்லை.
te: పూర్తి :mod:`qiskit.algorithms.amplitude_estimators` మాడ్యూల్ స్థానంలో రీఫ్యాక్టర్ చేయబడింది. ఇంపోర్ట్ మార్గాలను మార్చాల్సిన అవసరం లేదు.

source: IAE Example
pt_un: Exemplos de IAE
ta: IAE எடுத்துக்காட்டு
te: IAE ఉదాహరణలు

source: `Amplitude Estimation <https://qiskit.org/documentation/finance/tutorials/00_amplitude_estimation.html>`_
pt_un: `Estimação de Amplitude <https://qiskit.org/documentation/finance/tutorials/00_amplitude_estimation.html>`_
ta: `வீச்சு மதிப்பீடு <https://qiskit.org/documentation/finance/tutorials/00_amplitude_estimation.html>`_

source: Phase Estimators
pt_un: Estimadores de fase
ta: `கட்ட மதிப்பீட்டாளர்கள்`_
