Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/migration_guides/algorithms_migration.po
Languages: pt_un, ta, te

source: Aer Primitives with ``shots=None``, ``approximation=True`` (see `TrotterQRTE`_ example):
pt_un: Primitivas Aer com ``shots=None``, ``approximation=True`` (consulte o exemplo de `TrotterQRTE`_):
ta: ``ஷாட்ஸ்=ஒன்றுமில்லை``, ``தோராயம்=உண்மை`` உடன் ஏர் ப்ரிமிடிவ்ஸ் (`TrotterQRTE`_ உதாரணத்தைப் பார்க்கவும்):
te: ``shots=None``, ``approximation=True``తో ఎయిర్ ప్రిమిటివ్స్ (`TrotterQRTE`_ ఉదాహరణ చూడండి):

source: Minimum Eigensolvers
pt_un: Eigensolvers mínimos
ta: `குறைந்தபட்ச ஈஜென்சொல்வர்கள்`_

source: The minimum eigensolver algorithms belong to the first type of refactoring listed above (Algorithms refactored in a new location to support :mod:`~qiskit.primitives`). Instead of a :class:`~qiskit.utils.QuantumInstance`, :mod:`qiskit.algorithms.minimum_eigensolvers` are now initialized using an instance of the :mod:`~qiskit.primitives.Sampler` or :mod:`~qiskit.primitives.Estimator` primitive, depending on the algorithm. The legacy classes can still be found in :mod:`qiskit.algorithms.minimum_eigen_solvers`.
pt_un: Os algoritmos eigensolver mínimos pertencem ao primeiro tipo de refatoração listado acima (Algoritmos refatorados em um novo local para suportar :mod:`~qiskit.primitives`). Em vez de uma :class:`~qiskit.utils.QuantumInstance`, :mod:`qiskit.algorithms.minimum_eigensolvers` agora são inicializados usando uma instância de :mod:`~qiskit.primitives.Sampler` ou :mod:`~ qiskit.primitives.Estimator` primitivo, dependendo do algoritmo. As classes legadas ainda podem ser encontradas em :mod:`qiskit.algorithms.minimum_eigen_solvers`.
ta: குறைந்தபட்ச eigensolver அல்காரிதம்கள் மேலே பட்டியலிடப்பட்டுள்ள முதல் வகை மறுசீரமைப்பைச் சேர்ந்தவை (அல்காரிதம்கள் :mod:`~qiskit.primitives` ஐ ஆதரிக்க புதிய இடத்தில் மறுசீரமைக்கப்பட்டது). :class:`~qiskit.utils.QuantumInstance` என்பதற்குப் பதிலாக, :mod:`qiskit.algorithms.minimum_eigensolvers` இப்போது :mod:`~qiskit.primitives.Sampler` அல்லது :mod:`~ qiskit.primitives.Estimator` primitive, அல்காரிதம் சார்ந்தது. மரபு வகுப்புகளை இன்னும் :mod:`qiskit.algorithms.minimum_eigen_solvers` இல் காணலாம்.
te: మినిమం ఐగెన్ సోల్వర్ అల్గారిథమ్‌లు పైన జాబితా చేయబడిన మొదటి రీఫ్యాక్టరింగ్‌కు చెందినవి (అల్గారిథమ్‌లు :mod:`~qiskit.primitives`కి మద్దతు ఇవ్వడానికి కొత్త ప్రదేశంలో రీఫ్యాక్టరింగ్ చేయబడ్డాయి). బదులుగా :class:`~qiskit.utils.QuantumInstance`, :mod:`qiskit.algorithms.minimum_eigensolvers` ఇప్పుడు :mod:`~qiskit.primitives.Sampler` లేదా :mod:`~qiskit.primitives.Estimator` ప్రిమిటివ్ యొక్క ఉదాహరణను ఉపయోగించి , అల్గోరిథం ఆధారంగా ప్రారంభించబడింది. . లెగసీ క్లాస్లను ఇప్పటికీ :mod:`qiskit.algorithms.minimum_eigen_solvers`లో కనుగొనవచ్చు.

source: For the :mod:`qiskit.algorithms.minimum_eigensolvers` classes, depending on the import path, you will access either the primitive-based or the quantum-instance-based implementation. You have to be extra-careful, because the class name does not change.
pt_un: Para as classes :mod:`qiskit.algorithms.minimum_eigensolvers`, dependendo do caminho de importação, você acessará a implementação baseada em primitiva ou baseada em instância quântica. Você tem que ter muito cuidado, porque o nome da classe não muda.
ta: :mod:`qiskit.algorithms.minimum_eigensolvers' வகுப்புகளுக்கு, இறக்குமதி பாதையைப் பொறுத்து, நீங்கள் பழமையான அடிப்படையிலான அல்லது குவாண்டம்-உதாரண அடிப்படையிலான செயல்படுத்தலை அணுகலாம். வகுப்பின் பெயர் மாறாததால், நீங்கள் கூடுதல் கவனமாக இருக்க வேண்டும்.
te: :mod:`qiskit.algorithms.minimum_eigensolvers` క్లాస్ల కోసం, ఇంపోర్ట్ మార్గంపై ఆధారపడి, మీరు ప్రిమిటివ్-ఆధారిత లేదా క్వాంటం-ఇన్స్టన్స్-ఆధారిత అమలును యాక్సెస్ చేస్తారు.క్లాస్ పేరు మారనందువలన మీరు చాలా జాగ్రత్తగా ఉండాలి.

source: Old import (Quantum Instance based): ``from qiskit.algorithms import VQE, QAOA, NumPyMinimumEigensolver``
pt_un: Antigas importações (baseadas em instancia Quantum): ``from qiskit.algorithms import VQE, QAOA, NumPyMinimumEigensolver``
ta: பழைய இறக்குமதி (குவாண்டம் நிகழ்வு அடிப்படையிலானது): ``qiskit.algorithms இலிருந்து VQE, QAOA, NumPyMinimumEigensolver"
te: పాత ఇంపోర్ట్(క్వాంటం ఇన్‌స్టాన్స్ ఆధారిత): ``from qiskit.algorithms import VQE, QAOA, NumPyMinimumEigensolver``

source: New import (Primitives based): ``from qiskit.algorithms.minimum_eigensolvers import VQE, SamplingVQE, QAOA, NumPyMinimumEigensolver``
pt_un: Novas importações (baseadas em Primitives): ``from qiskit.algorithms.minimum_eigensolvers import VQE, SamplingVQE, QAOA, NumPyMinimumEigensolver``
ta: புதிய இறக்குமதி (Primitives அடிப்படையில்): ``qiskit.algorithms.minimum_eigensolvers இலிருந்து VQE, SamplingVQE, QAOA, NumPyMinimumEigensolver"
te: కొత్త ఇంపోర్ట్ (ప్రిమిటివ్స్ ఆధారితం): ``from qiskit.algorithms.minimum_eigensolvers import VQE, SamplingVQE, QAOA, NumPyMinimumEigensolver``

source: The legacy :class:`qiskit.algorithms.minimum_eigen_solvers.VQE` class has now been split according to the use-case:
pt_un: A classe legada :class:`qiskit.algorithms.minimum_eigen_solvers.VQE` foi dividida de acordo com os casos de uso:
ta: பாரம்பரியம் :class:`qiskit.algorithms.minimum_eigen_solvers.VQE` வகுப்பு இப்போது பயன்பாட்டு வழக்கின்படி பிரிக்கப்பட்டுள்ளது:
te: లెగసీ :class:`qiskit.algorithms.minimum_eigen_solvers.VQE` తరగతి ఇప్పుడు వినియోగ-కేస్ ప్రకారం విభజించబడింది:

source: For general-purpose Hamiltonians, you can use the Estimator-based :class:`qiskit.algorithms.minimum_eigensolvers.VQE` class.
pt_un: Para Hamiltonianos de uso geral, você pode usar a classe :class:`qiskit.algorithms.minimum_eigensolvers.VQE` baseada na Estimator.
ta: பொதுவான-நோக்கமான ஹாமிலோனியர்கள், நீங்கள் Estimator-அடிப்படை :class:` qiskit.algorithms.minimum_eigensolvers.VQE` வகுப்பு பயன்படுத்த முடியும்.
te: సాధారణ ప్రయోజన హామిల్టోనియన్ల కోసం, మీరు ఎస్టిమేటర్-ఆధారిత :class:`qiskit.algorithms.minimum_eigensolvers.VQE` తరగతిని ఉపయోగించవచ్చు.

source: If you have a diagonal Hamiltonian, and would like the algorithm to return a sampling of the state, you can use the new Sampler-based :class:`qiskit.algorithms.minimum_eigensolvers.SamplingVQE` algorithm. This could formerly be realized using the legacy :class:`~qiskit.algorithms.minimum_eigen_solvers.VQE` with :class:`~qiskit.opflow.expectations.CVaRExpectation`.
pt_un: Se você tiver um Hamiltoniano diagonal e quiser que o algoritmo retorne uma amostra do estado, você pode usar o novo algoritmo :class:`qiskit.algorithms.minimum_eigensolvers.SamplingVQE` baseado em Sampler. Anteriormente, isso poderia ser realizado usando a classe legada :class:`~qiskit.algorithms.minimum_eigen_solvers.VQE` com a :class:`~qiskit.opflow.expectations.CVaRExpectation`.
ta: உங்களிடம் மூலைவிட்ட ஹாமில்டோனியன் இருந்தால், மற்றும் நிலையின் மாதிரியை அல்காரிதம் திரும்பப் பெற விரும்பினால், நீங்கள் புதிய மாதிரி அடிப்படையிலான :class:`qiskit.algorithms.minimum_eigensolvers.SamplingVQE` அல்காரிதத்தைப் பயன்படுத்தலாம். பாரம்பரியம் :class:`~qiskit.algorithms.minimum_eigen_solvers.VQE` உடன் :class:`~qiskit.opflow.expectations.CVaRExpectation` ஐப் பயன்படுத்தி இது முன்னர் உணரப்பட்டது.
te: మీకు డియాగోనల్ హామిల్టోనియన్ ఉంటే మరియు అల్గారిథమ్ స్టేట్ యొక్క నమూనాను తిరిగి ఇవ్వాలనుకుంటే, మీరు కొత్త సాంప్లర్-ఆధారిత :class:`qiskit.algorithms.minimum_eigensolvers.SamplingVQE` అల్గారిథమ్‌ని ఉపయోగించవచ్చు. ఇది గతంలో లెగసీ :class:`~qiskit.algorithms.minimum_eigen_solvers.VQE`ని :class:`~qiskit.opflow.expectations.CVaRExpectation`ని ఉపయోగించి గ్రహించవచ్చు.

source: In addition to taking in an :mod:`~qiskit.primitives.Estimator` instance instead of a :class:`~qiskit.utils.QuantumInstance`, the new :class:`~qiskit.algorithms.minimum_eigensolvers.VQE` signature has undergone the following changes:
pt_un: Além de receber uma instância :mod:`~qiskit.primitives.Estimator` em vez de uma :class:`~qiskit.utils.QuantumInstance`, a nova assinatura :class:`~qiskit.algorithms.minimum_eigensolvers.VQE` sofreu as seguintes alterações:
ta: :class:`~qiskit.utils.QuantumInstance` என்பதற்குப் பதிலாக :mod:`~qiskit.primitives.Estimator` நிகழ்வை எடுத்துக்கொள்வதோடு, புதிய :class:`~qiskit.algorithms.minimum_eigensolvers.VQE` கையொப்பம் உள்ளது. பின்வரும் மாற்றங்களுக்கு உட்பட்டது:
te: :class:`~qiskit.utils.QuantumInstance`కి బదులుగా :mod:`~qiskit.primitives.Estimator` ఇన్‌స్టాన్స్ తీసుకోవడంతో పాటు, కొత్త :class:`~qiskit.algorithms.minimum_eigensolvers.VQE` సిగ్నెచర్ కింది మార్పులకు గురైంది:

source: The ``expectation`` and ``include_custom`` parameters have been removed, as this functionality is now defined at the ``Estimator`` level.
pt_un: Os parâmetros ``expectation`` e ``include_custom`` foram removidos, já que esta funcionalidade agora é definida no nível de ``Estimator``.
ta: ``expectation` மற்றும் ``include_custom`` அளவுருக்கள் அகற்றப்பட்டன, ஏனெனில் இந்தச் செயல்பாடு இப்போது ``Estimator`` அளவில் வரையறுக்கப்பட்டுள்ளது.
te: ``expectation`` మరియు ``include_custom`` పారామీటర్‌లు తీసివేయబడ్డాయి, ఎందుకంటే ఈ కార్యాచరణ ఇప్పుడు ``Estimator`` స్థాయిలో నిర్వచించబడింది.

source: The ``gradient`` parameter now takes in an instance of a primitive-based gradient class from :mod:`qiskit.algorithms.gradients` instead of the legacy :mod:`qiskit.opflow.gradients.Gradient` class.
pt_un: O parâmetro ``gradient`` agora usa uma instância de uma classe de gradiente baseada em primitiva de :mod:`qiskit.algorithms.gradients` em vez da classe :mod:`qiskit.opflow.gradients.Gradient` herdada.
ta: ``கிரேடியன்ட்`` அளவுரு இப்போது மரபு :mod:`qiskit.opflow.gradients.Gradient` வகுப்பிற்குப் பதிலாக :mod:`qiskit.algorithms.gradients` இலிருந்து ஒரு பழமையான-அடிப்படையிலான சாய்வு வகுப்பின் உதாரணத்தை எடுத்துக்கொள்கிறது.
te: ``gradient`` పారామీటర్‌ ఇప్పుడు లెగసీ :mod:`qiskit.opflow.gradients.Gradient` క్లాస్కి బదులుగా :mod:`qiskit.algorithms.gradients` నుండి ప్రిమిటివ్-ఆధారిత గ్రేడియంట్ క్లాస్ యొక్క ఉదాహరణను తీసుకుంటుంది.

source: The ``max_evals_grouped`` parameter has been removed, as it can be set directly on the optimizer class.
pt_un: O parâmetro ``max_evals_grouped`` foi removido, pois pode ser definido diretamente na classe optimizer.
ta: ``max_evals_grouped`` அளவுரு அகற்றப்பட்டது, ஏனெனில் இது ஆப்டிமைசர் வகுப்பில் நேரடியாக அமைக்கப்படலாம்.
te: ``max_evals_grouped`` పారామీటర్‌ తీసివేయబడింది, ఎందుకంటే ఇది నేరుగా ఆప్టిమైజర్ క్లాస్‌లో సెట్ చేయబడుతుంది.

source: The ``estimator``, ``ansatz`` and ``optimizer`` are the only parameters that can be defined positionally (and in this order), all others have become keyword-only arguments.
pt_un: O ``estimator``, ``ansatz`` e ``optimizer`` são os únicos parâmetros que podem ser definidos posicionalmente (e nesta ordem), todos os outros se tornaram argumentos keyword-only.
ta: ``மதிப்பிடுபவர்``, ``ansatz`` மற்றும் ``ஆப்டிமைசர்`` ஆகியவை நிலைப்பாட்டில் வரையறுக்கப்படக்கூடிய ஒரே அளவுருக்கள் (மற்றும் இந்த வரிசையில்), மற்ற அனைத்தும் முக்கிய வார்த்தைகள் மட்டுமே.
te: ``estimator``, ``ansatz`` మరియు ``optimizer`` మాత్రమే స్థానపరంగా (మరియు ఈ క్రమంలో) నిర్వచించగల పారామీటర్‌లు, మిగతావన్నీ కీవర్డ్-ఓన్లీ ఆర్గ్యుమెంట్‌లుగా మారాయి.

source: The new :class:`~qiskit.algorithms.minimum_eigensolvers.VQEResult` class does not include the state anymore, as this output was only useful in the case of diagonal operators. However, if it is available as part of the new :class:`~qiskit.algorithms.minimum_eigensolvers.SamplingVQE`'s :class:`~qiskit.algorithms.minimum_eigensolvers.SamplingVQEResult`.
pt_un: A nova classe :class:`~qiskit.algorithms.minimum_eigensolvers.VQEResult` não inclui mais o estado, pois esta saída só foi útil no caso de operadores diagonais. No entanto, se estiver disponível como parte da classe :class:`~qiskit.algorithms.minimum_eigensolvers.SamplingVQEResult` da nova classe :class:`~qiskit.algorithms.minimum_eigensolvers.SamplingVQE`'s .
ta: புதிய :class:`~qiskit.algorithms.minimum_eigensolvers.VQEResult` வகுப்பில் மாநிலம் சேர்க்கப்படவில்லை, ஏனெனில் இந்த வெளியீடு மூலைவிட்ட ஆபரேட்டர்களுக்கு மட்டுமே பயனுள்ளதாக இருக்கும். இருப்பினும், இது புதிய :class:`~qiskit.algorithms.minimum_eigensolvers.SamplingVQE`ன் ஒரு பகுதியாகக் கிடைத்தால்:class:`~qiskit.algorithms.minimum_eigensolvers.SamplingVQEResult`.
te: కొత్త :class:`~qiskit.algorithms.minimum_eigensolvers.VQEResult` క్లాస్ ఇకపై స్టేట్ని చేర్చదు, ఎందుకంటే ఈ అవుట్‌పుట్ డయాగోనల్ ఆపరేటర్‌ల విషయంలో మాత్రమే ఉపయోగపడుతుంది. అయితే, ఇది కొత్త :class:`~qiskit.algorithms.minimum_eigensolvers.SamplingVQE` యొక్క :class:`~qiskit.algorithms.minimum_eigensolvers.SamplingVQEResult`లో భాగంగా అందుబాటులో ఉంది.

source: VQE Example
pt_un: Exemplo de VQD
ta: VQE எடுத்துக்காட்டு
te: VQE ఉదాహరణ

source: **[Legacy] Using Quantum Instance:**
pt_un: **[Legacy] Usando Quantum Instance:**
ta: **[Legacy] குவாண்டம் நிகழ்வைப் பயன்படுத்துதல்:**
te: **[Legacy] క్వాంటం ఉదాహరణను ఉపయోగించడం:**

source: **[Updated] Using Primitives:**
pt_un: **[Updated] Usando Primitives:**
ta: **[Updated] முதற்பொருள்களைப் பயன்படுத்துதல்:**
te: **[Updated] ప్రిమిటివ్స్ ఉపయోగించి: **

source: VQE applying CVaR (SamplingVQE) Example
pt_un: Exemplo de VQE aplicado a CVaR (SamplingVQE)
ta: VQE விண்ணப்பிக்கும் CVaR (SamplingVQE) எடுத்துக்காட்டு
te: VQE వర్తించే CVaR (SamplingVQE) ఉదాహరణ

source: For complete code examples, see the following updated tutorials:
pt_un: Para obter exemplos de código completos, consulte os seguintes tutoriais atualizados:
ta: முழுமையான குறியீடு எடுத்துக்காட்டுகளுக்கு, பின்வரும் மேம்படுத்தப்பட்ட பயிற்சிகளைப் பார்க்கவும்:
te: పూర్తి కోడ్ ఉదాహరణల కోసం, కింది నవీకరించబడిన ట్యుటోరియల్‌లను చూడండి:

source: `VQE Introduction <https://qiskit.org/documentation/tutorials/algorithms/01_algorithms_introduction.html>`_
pt_un: `Introdução ao VQE <https://qiskit.org/documentation/tutorials/algorithms/01_algorithms_introduction.html>`_
ta: ` VQE அறிமுகம் <https://qiskit.org/documentation/tutorials/algorithms/01_algorithms_introduction.html>` _
te: ` VQE పరిచయం <https://qiskit.org/documentation/tutorials/algorithms/01_algorithms_introduction.html>` _

source: `VQE, Callback, Gradients, Initial Point <https://qiskit.org/documentation/tutorials/algorithms/02_vqe_advanced_options.html>`_
pt_un: `Callback, Gradientes, Pontos Iniciais do VQE <https://qiskit.org/documentation/tutorials/algorithms/02_vqe_advanced_options.html>`_
ta: ` VQE, கால்பேக், கிரேடியண்ட்ஸ், ஆரம்ப புள்ளி <https://qiskit.org/documentation/tutorials/algorithms/02_vqe_advanced_options.html>` _
te: `VQE, కాల్‌బ్యాక్, గ్రేడియంట్స్, ఇనిషియల్ పాయింట్ <https://qiskit.org/documentation/tutorials/algorithms/02_vqe_advanced_options.html>` _

source: `VQE with Aer Primitives <https://qiskit.org/documentation/tutorials/algorithms/03_vqe_simulation_with_noise.html>`_
pt_un: `VQE com Aer Primitives <https://qiskit.org/documentation/tutorials/algorithms/03_vqe_simulation_with_noise.html>`_
ta: ` Aer Primitives உடன் VQE <https://qiskit.org/documentation/tutorials/algorithms/03_vqe_simulation_with_noise.html>` _
te: ``ఏర్ ప్రిమిటివ్స్‌తో VQE <https://qiskit.org/documentation/tutorials/algorithms/03_vqe_simulation_with_noise.html>` _

source: The legacy :class:`qiskit.algorithms.minimum_eigen_solvers.QAOA` class used to extend :class:`qiskit.algorithms.minimum_eigen_solvers.VQE`, but now, :class:`qiskit.algorithms.minimum_eigensolvers.QAOA` extends :class:`qiskit.algorithms.minimum_eigensolvers.SamplingVQE`. For this reason, **the new QAOA only supports diagonal operators**.
pt_un: A classe :class:`qiskit.algorithms.minimum_eigen_solvers.QAOA` legada usada para estender :class:`qiskit.algorithms.minimum_eigen_solvers.VQE`, mas agora, a :class:`qiskit.algorithms.minimum_eigensolvers.QAOA` estende :class: `qiskit.algorithms.minimum_eigensolvers.SamplingVQE`. Por esta razão, **o novo QAOA suporta apenas operadores diagonais**.
ta: மரபு :class:`qiskit.algorithms.minimum_eigen_solvers.QAOA` வகுப்பு நீட்டிக்கப் பயன்படுத்தப்பட்டது :class:`qiskit.algorithms.minimum_eigen_solvers.VQE`, ஆனால் இப்போது, :class:`qiskit.algorithms.minimum_eigensolvers.QAOA` நீட்டிக்கிறது :class:`qiskit.algorithms.minimum_eigensolvers.SamplingVQE`. இந்த காரணத்திற்காக, **புதிய QAOA மூலைவிட்ட ஆபரேட்டர்களை மட்டுமே ஆதரிக்கிறது**.
te: లెగసీ :class:`qiskit.algorithms.minimum_eigen_solvers.QAOA` :class:`qiskit.algorithms.minimum_eigen_solvers.VQE` క్లాస్‌ని ఎక్స్టెండ్ చేసేది, కానీ ఇప్పుడు,:class:`qiskit.algorithms.minimum_eigensolvers.SamplingVQE` ని :class:`qiskit.algorithms.minimum_eigensolvers.QAOA` ఎక్స్టెండ్ చేస్తుంది . ఈ కారణంగా, **కొత్త QAOA వికర్ణ ఆపరేటర్‌లకు మాత్రమే మద్దతు ఇస్తుంది**.

source: In addition to taking in an :mod:`~qiskit.primitives.Sampler` instance instead of a :class:`~qiskit.utils.QuantumInstance`, the new :class:`~qiskit.algorithms.minimum_eigensolvers.QAOA` signature has undergone the following changes:
pt_un: Além de receber uma instância de :mod:`~qiskit.primitives.Sampler` em vez de uma :class:`~qiskit.utils.QuantumInstance`, a nova assinatura da classe :class:`~qiskit.algorithms.minimum_eigensolvers.QAOA` sofreu as seguintes alterações:
ta: மேலும் :mod:` ~ qiskit.primitives.Sampler `s பதிலாக :class:` ~ qiskit.utils.QuantumInstance `, புதிய :class:` ~ qiskit.algorithms.minimum_eigensolvers.QAOA ` கையெழுத்து பின்வரும் மாற்றங்களைக் கொண்டுள்ளது:
te: :class:`~qiskit.utils.QuantumInstance`కి బదులుగా :mod:`~qiskit.primitives.Sampler` ఇన్స్టన్స్ని తీసుకోవడంతో పాటు, కొత్త :class:`~qiskit.algorithms.minimum_eigensolvers.QAOA` సిగ్నెచర్ కింది మార్పులకు గురైంది:

source: The ``expectation`` and ``include_custom`` parameters have been removed. In return, the ``aggregation`` parameter has been added (it used to be defined through a custom ``expectation``).
pt_un: Os parâmetros ``expectation`` e ``include_custom`` foram removidos. Em troca, o parâmetro ``aggregation`` foi adicionado (costumava ser definido através de uma ``expectation`` adaptada).
ta: ``expectation`` மற்றும் ``include_custom`` அளவுருக்கள் அகற்றப்பட்டன. பதிலுக்கு, ``ஒருங்கிணைத்தல்`` அளவுரு சேர்க்கப்பட்டது (இது தனிப்பயன் ``எதிர்பார்ப்பு`` மூலம் வரையறுக்கப்பட்டது).
te: ``expectation`` మరియు ``include_custom`` పారామితులు తీసివేయబడ్డాయి. ప్రతిఫలంగా, ``aggregation`` పారామీటర్‌ జోడించబడింది (ఇది అనుకూల ``expectation`` ద్వారా నిర్వచించబడుతుంది).

source: The ``sampler`` and ``optimizer`` are the only parameters that can be defined positionally (and in this order), all others have become keyword-only arguments.
pt_un: O ``sampler`` e ``optimizer`` são os únicos parâmetros que podem ser definidos posicionalmente (e nesta ordem), todos os outros se tornaram parâmetros keyword-only.
ta: ` ` sampler ` ` மற்றும் ` ` optimizer ` ` ஒரே அளபுருக்கள் மட்டுமே வரையறுக்கப்படலாம் (மற்றும் இந்த வரிசையில்), அனைத்து மற்றவர்கள் விசைவார்த்தை மட்டுமே.
te: ``sampler`` మరియు ``optimizer`` అనేది స్థానపరంగా నిర్వచించబడే ఏకైక పారామీటర్‌లు (మరియు ఈ క్రమంలో), మిగతావన్నీ కీవర్డ్-ఓన్లీ ఆర్గ్యుమెంట్‌లుగా మారాయి.

source: If you want to run QAOA on a non-diagonal operator, you can use the :class:`.QAOAAnsatz` with :class:`qiskit.algorithms.minimum_eigensolvers.VQE`, but bear in mind there will be no state result. If your application requires the final probability distribution, you can instantiate a ``Sampler`` and run it with the optimal circuit after :class:`~qiskit.algorithms.minimum_eigensolvers.VQE`.
pt_un: Se você deseja executar QAOA em um operador não diagonal, pode usar a :class:`.QAOAAnsatz` com :class:`qiskit.algorithms.minimum_eigensolvers.VQE`, mas tenha em mente que não haverá resultado de estado. Se seu aplicativo requer a distribuição de probabilidade final, você pode instanciar um ``Sampler`` e executá-lo com o circuito ideal após a :class:`~qiskit.algorithms.minimum_eigensolvers.VQE`.
ta: மூலைவிட்டம் அல்லாத ஆபரேட்டரில் QAOAஐ இயக்க விரும்பினால், :class:`qiskit.algorithms.minimum_eigensolvers.VQE` உடன் :class:`.QAOAAnsatz` ஐப் பயன்படுத்தலாம், ஆனால் எந்த நிலை முடிவும் இருக்காது என்பதை நினைவில் கொள்ளவும். உங்கள் பயன்பாட்டிற்கு இறுதி நிகழ்தகவு விநியோகம் தேவைப்பட்டால், நீங்கள் ஒரு ``மாதிரி`` ஐ உடனடியாகச் செய்து :class:`~qiskit.algorithms.minimum_eigensolvers.VQE` க்குப் பிறகு உகந்த சுற்றுடன் இயக்கலாம்.
te: మీరు నాన్-హారిజాంటల్ ఆపరేటర్‌లో QAOAని అమలు చేయాలనుకుంటే, మీరు :class:`.QAOAAnsatz`ని :class:`qiskit.algorithms.minimum_eigensolvers.VQE`తో ఉపయోగించవచ్చు, కానీ స్టేట్ ఫలితం ఉండదని గుర్తుంచుకోండి. మీ అప్లికేషన్‌కి తుది సంభావ్యత డిస్ట్రిబ్యూషన్ అవసరమైతే, మీరు ``Sampler``ని తక్షణం చేసి, :class:`~qiskit.algorithms.minimum_eigensolvers.VQE` తర్వాత సరైన సర్క్యూట్‌తో దీన్ని అమలు చేయవచ్చు.

source: QAOA Example
pt_un: Exemplo de QAOA
ta: QAOA எடுத்துக்காட்டு
te: QAOA ఉదాహరణ

source: NumPyMinimumEigensolver
ta: நம்பைமினிமம்ஐகேன்சல்வர்

source: Because this is a classical solver, the workflow has not changed between the old and new implementation. The import has however changed from :class:`qiskit.algorithms.minimum_eigen_solvers.NumPyMinimumEigensolver` to :class:`qiskit.algorithms.minimum_eigensolvers.NumPyMinimumEigensolver` to conform to the new interfaces and result classes.
pt_un: Como este é um solucionador clássico, o fluxo de trabalho não mudou entre a implementação antiga e a nova. No entanto, a importação mudou de :class:`qiskit.algorithms.minimum_eigen_solvers.NumPyMinimumEigensolver` para :class:`qiskit.algorithms.minimum_eigensolvers.NumPyMinimumEigensolver` para se adequar às novas interfaces e classes de resultados.
ta: இது ஒரு கிளாசிக்கல் தீர்வு என்பதால், பழைய மற்றும் புதிய செயலாக்கத்திற்கு இடையே பணிப்பாய்வு மாறவில்லை. இருப்பினும் இறக்குமதியானது :class:`qiskit.algorithms.minimum_eigen_solvers.NumPyMinimumEigensolver` இலிருந்து :class:`qiskit.algorithms.minimum_eigensolvers.NumPyMinimumEigensolver` என மாற்றப்பட்டுள்ளது.
te: ఇది క్లాసికల్ సాల్వర్ అయినందున, పాత మరియు కొత్త అమలు మధ్య వర్క్‌ఫ్లో మారలేదు. ఇంపోర్ట్ అయితే:class:`qiskit.algorithms.minimum_eigen_solvers.NumPyMinimumEigensolver` నుండి :class:`qiskit.algorithms.minimum_eigensolvers.NumPyMinimumEigensolver` కి రిసల్ట్ క్లాస్లకి మరియు కొత్త ఇంటర్ఫేస్లకి అనుగుణంగా మార్చబడింది.

source: NumPyMinimumEigensolver Example
pt_un: Exemplo de NumPyMinimumEigensolver
ta: நம்பைமினிமம்ஐகேன்சல்வர் எடுத்துக்காட்டு
te: NumPyMinimumEigensolver ఉదాహరణ

source: Eigensolvers
pt_un: Eigensolver
ta: ஐகென்சால்வர்
te: ఐగేన్‌సోల్వర్స్
