Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/migration_guides/algorithms_migration.po
Languages: pt_un, ta, te

source: Algorithms Migration Guide
pt_un: Guia de Migração de Algoritmos
ta: அல்காரிதம்கள் இடம்பெயர்வு வழிகாட்டி
te: అల్గారిథమ్స్ మైగ్రేషన్ గైడ్

source: The :mod:`qiskit.algorithms` module has been fully refactored to use the :mod:`~qiskit.primitives`, for circuit execution, instead of the :class:`~qiskit.utils.QuantumInstance`, which is now deprecated.
pt_un: O módulo :mod:`qiskit.algorithms` foi completamente refatorado para que use o :mod:`~qiskit.primitives`, na execução de circuitos, em vez da :class:`~qiskit.utils.QuantumInstance`, a qual está agora depreciada.
ta: :mod:`qiskit.algorithms` தொகுதியானது சுற்றுச் செயல்பாட்டிற்கு, :class:`~qiskit.utils.QuantumInstance`க்குப் பதிலாக :mod:`~qiskit.primitives` ஐப் பயன்படுத்த முழுமையாக மறுவடிவமைக்கப்பட்டுள்ளது, இது இப்போது நிறுத்தப்பட்டுள்ளது.
te: :mod:`qiskit.algorithms` మాడ్యూల్ సర్క్యూట్ ఎగ్జిక్యూషన్ కోసం :class:`~qiskit.utils.QuantumInstance`కి బదులుగా :mod:`~qiskit.primitives`ని ఉపయోగించడానికి పూర్తిగా రీఫ్యాక్టర్డ్ చేయబడింది, ఇది ఇప్పుడు నిలిపివేయబడింది.

source: There have been **3 types of refactoring**:
pt_un: Temos **3 tipos de refatoração**:
ta: **3 வகையான மறுசீரமைப்பு** உள்ளன:
te: **3 రకాల రీఫ్యాక్టరింగ్** ఉన్నాయి:

source: Algorithms refactored in a new location to support :mod:`~qiskit.primitives`. These algorithms have the same class names as the :class:`~qiskit.utils.QuantumInstance`\-based ones but are in a new sub-package.
pt_un: Algoritmos refatorados em uma nova localização a fim de suportar :mod:`~qiskit.primitives`. Esses algoritmos têm o mesmos nomes de classe que aquelas baseadas em :class:`~qiskit.utils.QuantumInstance`\-, mas estão em um novo sub-pacote.
ta: :mod:`~qiskit.primitives` ஐ ஆதரிக்கப் புதிய இடத்தில் அல்காரிதம்கள் மறுசீரமைக்கப்பட்டது. இந்த அல்காரிதம்கள் :class:`~qiskit.utils.QuantumInstance`\-அடிப்படையிலான அதே வகுப்புப் பெயர்களைக் கொண்டுள்ளன, ஆனால் அவை புதிய துணைத் தொகுப்பில் உள்ளன.
te: :mod:`~qiskit.primitives`కి మద్దతివ్వడానికి అల్గారిథమ్‌లు కొత్త ప్రదేశంలో రీఫ్యాక్టర్ చేయబడ్డాయి. ఈ అల్గారిథమ్‌లు :class:`~qiskit.utils.QuantumInstance`\-ఆధారిత వాటి వలె ఒకే క్లాస్ పేర్లను కలిగి ఉంటాయి కానీ కొత్త సబ్-ప్యాకేజీలో ఉన్నాయి.

source: **Careful with import paths!!** The legacy algorithms are still importable directly from :mod:`qiskit.algorithms`. Until the legacy imports are removed, this convenience import is not available for the refactored algorithms. Thus, to import the refactored algorithms you must always **specify the full import path** (e.g., ``from qiskit.algorithms.eigensolvers import VQD``)
pt_un: **Cuidado com caminhos de importação!!** Os algoritmos legados ainda podem ser importados diretamente de :mod:`qiskit.algorithms`. Até que as importações legadas sejam removidas, essa importação de conveniência não estará disponível para os algoritmos refatorados. Portanto, para importar os algoritmos refatorados, você deve sempre **especificar o caminho de importação completo** (por exemplo, ``from qiskit.algorithms.eigensolvers import VQD``)
ta: **இறக்குமதி பாதைகளில் கவனமாக இருங்கள்!!** மரபு வழிமுறைகள் இன்னும் நேரடியாக :mod:`qiskit.algorithms` இலிருந்து இறக்குமதி செய்யப்படுகின்றன. மரபு இறக்குமதிகள் அகற்றப்படும் வரை, மறுசீரமைக்கப்பட்ட அல்காரிதங்களுக்கு இந்த வசதியான இறக்குமதி கிடைக்காது. எனவே, மறுசீரமைக்கப்பட்ட அல்காரிதங்களை இறக்குமதி செய்ய, நீங்கள் எப்போதும் **முழு இறக்குமதி பாதையைக் குறிப்பிட வேண்டும்** (எ.கா., ``qiskit.algorithms.eigensolvers இறக்குமதி VQD``)
te: **ఇంపోర్ట్ పాత్స్ తో జాగ్రత్తగా ఉండండి!!** లెగసీ అల్గారిథమ్‌లు ఇప్పటికీ నేరుగా :mod:`qiskit.algorithms` నుండి దిగుమతి చేసుకోవచ్చు. లెగసీ దిగుమతులు తీసివేయబడే వరకు, రీఫ్యాక్టర్డ్ అల్గారిథమ్‌లకు ఈ సౌలభ్యం దిగుమతి అందుబాటులో ఉండదు. అందువల్ల, రీఫ్యాక్టర్డ్ అల్గారిథమ్‌లను దిగుమతి చేయడానికి మీరు ఎల్లప్పుడూ **పూర్తి ఇంపోర్ట్ మార్గాన్ని పేర్కొనాలి** (ఉదా., ``from qiskit.algorithms.eigensolvers import VQD``)

source: `Minimum Eigensolvers`_
ta: `குறைந்தபட்ச ஈஜென்சொல்வர்கள்`_

source: `Eigensolvers`_
ta: `ஈஜென்சொல்வர்ஸ்`_

source: `Time Evolvers`_
ta: `டைம் எவால்வர்ஸ்`_

source: Algorithms refactored in-place (same namespace) to support both :class:`~qiskit.utils.QuantumInstance` and :mod:`~qiskit.primitives`. In the future, the use of :class:`~qiskit.utils.QuantumInstance` will be removed.
pt_un: Algoritmos refatorados in-place (mesmo namespace) para suportar ambos :class:`~qiskit.utils.QuantumInstance` e :mod:`~qiskit.primitives`. No futuro, o uso da :class:`~qiskit.utils.QuantumInstance` será removido.
ta: அல்காரிதம்கள் :class:`~qiskit.utils.QuantumInstance` மற்றும் :mod:`~qiskit.primitives` இரண்டையும் ஆதரிக்கும் இடத்தில் (ஒரே பெயர்வெளி) மறுசீரமைக்கப்பட்டது. எதிர்காலத்தில், :class:`~qiskit.utils.QuantumInstance` பயன்பாடு அகற்றப்படும்.
te: అల్గారిథమ్‌లు :class:`~qiskit.utils.QuantumInstance` మరియు :mod:`~qiskit.primitives` రెండింటికి మద్దతివ్వడానికి ఇన్-ప్లేస్ (అదే నేమ్‌స్పేస్) రీఫ్యాక్టర్ చేయబడింది. భవిష్యత్తులో, :class:`~qiskit.utils.QuantumInstance` ఉపయోగం తీసివేయబడుతుంది.

source: `Amplitude Amplifiers`_
pt_un: `Amplificadores de Amplitude`_
ta: `அலைவீச்சு பெருக்கிகள்`_

source: `Amplitude Estimators`_
pt_un: `Estimadores de Amplitude`_
ta: `அலைவீச்சு மதிப்பீட்டாளர்கள்`_

source: `Phase Estimators`_
ta: `கட்ட மதிப்பீட்டாளர்கள்`_

source: Algorithms that were deprecated and are now removed entirely from :mod:`qiskit.algorithms`. These are algorithms that do not currently serve as building blocks for applications. Their main value is educational, and as such, will be kept as tutorials in the qiskit textbook. You can consult the tutorials in the following links:
pt_un: Algoritmos que estavam depreciados e que agora foram totalmente removidos do :mod:`qiskit.algorithms`. Estes são algoritmos que atualmente não servem como blocos de construção para aplicativos. Seu principal valor é educacional e, como tal, serão mantidos como tutoriais no manual do qiskit. Você pode consultar os tutoriais nos seguintes links:
ta: நீக்கப்பட்ட அல்காரிதம்கள் இப்போது :mod:`qiskit.algorithms` இலிருந்து முற்றிலும் அகற்றப்பட்டுள்ளன. இவை தற்போது பயன்பாடுகளுக்கான கட்டுமானத் தொகுதிகளாக செயல்படாத வழிமுறைகள். அவர்களின் முக்கிய மதிப்பு கல்வி, மேலும் கிஸ்கிட் பாடப்புத்தகத்தில் பயிற்சிகளாக வைக்கப்படும். பின்வரும் இணைப்புகளில் நீங்கள் பயிற்சிகளைப் பார்க்கலாம்:
te: విస్మరించబడిన అల్గారిథమ్‌లు ఇప్పుడు పూర్తిగా :mod:`qiskit.algorithms` నుండి తీసివేయబడ్డాయి . ఇవి ప్రస్తుతం అప్లికేషన్‌లకు బిల్డింగ్ బ్లాక్‌లుగా పని చేయని అల్గారిథమ్‌లు. వాటి ప్రధాన విలువ విద్యాపరమైనది మరియు క్విస్కిట్ పాఠ్యపుస్తకంలో ట్యుటోరియల్‌లుగా ఉంచబడుతుంది. మీరు క్రింది లింక్‌లలో ట్యుటోరియల్‌లను సంప్రదించవచ్చు:

source: `Linear Solvers (HHL) <https://learn.qiskit.org/course/ch-applications/solving-linear-systems-of-equations-using-hhl-and-its-qiskit-implementation>`_ ,
ta: 'நேரியல் தீர்வுகள் (HHL) <https://learn.qiskit.org/course/ch-applications/solving-linear-systems-of-equations-using-hhl-and-its-qiskit-implementation>`_ ,

source: `Factorizers (Shor) <https://learn.qiskit.org/course/ch-algorithms/shors-algorithm>`_
pt_un: `Fatoradores (Shor) <https://learn.qiskit.org/course/ch-algorithms/shors-algorithm>`_
ta: காரணியாக்கிகள் (ஷோர்) <https://learn.qiskit.org/course/ch-algorithms/shors-algorithm>`_ #:../../migration_guides/algorithms_migration.rst:39

source: The remainder of this migration guide will focus on the algorithms with migration alternatives within :mod:`qiskit.algorithms`, that is, those under refactoring types 1 and 2.
pt_un: O restante deste guia de migração se concentrará nos algoritmos com alternativas de migração dentro de :mod:`qiskit.algorithms`, ou seja, aqueles sob os tipos de refatoração 1 e 2.
ta: இந்த இடம்பெயர்வு வழிகாட்டியின் மீதமுள்ளவை :mod:`qiskit.algorithms` க்குள் இடம்பெயர்வு மாற்றுகளுடன் கூடிய அல்காரிதங்களில் கவனம் செலுத்தும், அதாவது, மறுசீரமைப்பு வகை 1 மற்றும் 2 இன் கீழ் இருக்கும்.
te: ఈ మైగ్రేషన్ గైడ్‌లోని మిగిలినవి :mod:`qiskit.algorithms`లోని మైగ్రేషన్ ప్రత్యామ్నాయాలతో అల్గారిథమ్‌లపై దృష్టి పెడతాయి, అంటే రీఫ్యాక్టరింగ్ రకాలు 1 మరియు 2 కింద ఉన్నవి.

source: Background
ta: பின்னணி
te: నేపథ్యం

source: The :mod:`qiskit.algorithms` module was originally built on top of the :mod:`qiskit.opflow` library and the :class:`~qiskit.utils.QuantumInstance` utility. The development of the :mod:`~qiskit.primitives` introduced a higher-level execution paradigm, with the ``Estimator`` for computation of expectation values for observables, and ``Sampler`` for executing circuits and returning probability distributions. These tools allowed to refactor the :mod:`qiskit.algorithms` module, and deprecate both :mod:`qiskit.opflow` and :class:`~qiskit.utils.QuantumInstance`.
pt_un: O módulo :mod:`qiskit.algorithms` foi originalmente construído sobre a biblioteca :mod:`qiskit.opflow` e o utilitário :class:`~qiskit.utils.QuantumInstance`. O desenvolvimento do :mod:`~qiskit.primitives` introduziu um paradigma de execução de alto nível, com o ``Estimator`` para cálculo de valores esperados para observáveis e ``Sampler`` para circuitos de execução e retorno de distribuições de probabilidade. Essas ferramentas permitiram refatorar o módulo :mod:`qiskit.algorithms` e descontinuar ambos :mod:`qiskit.opflow` e :class:`~qiskit.utils.QuantumInstance`.
ta: தி :mod:`qiskit.algorithms` தொகுதி முதலில் மேல் கட்டப்பட்டது :mod:`qiskit.opflow` நூலகம் மற்றும் :class:`~qiskit.utils.QuantumInstance` பயன்பாடு. :mod: இன் வளர்ச்சி `~qiskit.primitives` ஒரு உயர்-நிலை செயல்படுத்தல் முன்னுதாரணத்தை அறிமுகப்படுத்தியது ``Estimator`` கவனிக்கக்கூடியவற்றிற்கான எதிர்பார்ப்பு மதிப்புகளை கணக்கிடுவதற்கு, மற்றும் ``Sampler``சுற்றுகளை செயல்படுத்துவதற்கு மற்றும் நிகழ்தகவு பகிர்வுகள் திரும்பும். இந்த கருவிகள் மறுசீரமைக்க அனுமதிக்கப்படுகின்றன தி :mod:`qiskit.algorithms` module, மற்றும் இரண்டையும் நிராகரிக்கவும் :mod:`qiskit.opflow` மற்றும் :class:`~qiskit.utils.QuantumInstance`.
te: :mod:`qiskit.algorithms` మాడ్యూల్ నిజానికి :mod:`qiskit.opflow` లైబ్రరీ మరియు :class:`~qiskit.utils.QuantumInstance` యుటిలిటీ పైన నిర్మించబడింది. :mod:`~qiskit.primitives' యొక్క అభివృద్ధి ఒక ఉన్నత-స్థాయి ఎగ్జిక్యూషన్ నమూనాను పరిచయం చేసింది, పరిశీలించదగిన వాటి కోసం ఎక్స్‌పెక్టేషన్ విలువల గణన కోసం ``Estimator`` మరియు సర్క్యూట్‌లను అమలు చేయడానికి మరియు సంభావ్యత డిస్ట్రిబ్యూషన్ను తిరిగి అందించడానికి ``Sampler``తో. ఈ సాధనాలు :mod:`qiskit.algorithms` మాడ్యూల్‌ను రీఫాక్టర్ చేయడానికి అనుమతించబడ్డాయి మరియు :mod:`qiskit.opflow` మరియు :class:`~qiskit.utils.QuantumInstance` రెండింటినీ విస్మరించాయి.

source: The transition away from :mod:`qiskit.opflow` affects the classes that algorithms take as part of the problem setup. As a rule of thumb, most :mod:`qiskit.opflow` dependencies have a direct :mod:`qiskit.quantum_info` replacement. One common example is the class :mod:`qiskit.opflow.PauliSumOp`, used to define Hamiltonians (for example, to plug into VQE), that can be replaced by :mod:`qiskit.quantum_info.SparsePauliOp`. For information on how to migrate other :mod:`~qiskit.opflow` objects, you can refer to the `Opflow migration guide <https://qisk.it/opflow_migration>`_.
pt_un: A transição de :mod:`qiskit.opflow` afeta as classes que os algoritmos tomam como parte da configuração do problema. Como regra geral, a maioria das dependências :mod:`qiskit.opflow` tem uma substituição direta de :mod:`qiskit.quantum_info`. Um exemplo comum é a classe :mod:`qiskit.opflow.PauliSumOp`, usada para definir Hamiltonianos (por exemplo, para conectar ao VQE), que pode ser substituída por :mod:`qiskit.quantum_info.SparsePauliOp`. Para obter informações sobre como migrar outros objetos :mod:`~qiskit.opflow`, você pode consultar o `Guia de migração Opflow <https://qisk.it/opflow_migration>`_.
ta: :mod:`qiskit.opflow` இலிருந்து மாறுவது, சிக்கல் அமைப்பின் ஒரு பகுதியாக அல்காரிதம் எடுக்கும் வகுப்புகளைப் பாதிக்கிறது. கட்டைவிரல் விதியாக, பெரும்பாலான :mod:`qiskit.opflow` சார்புகள் நேரடி :mod:`qiskit.quantum_info` மாற்றீட்டைக் கொண்டுள்ளன. ஒரு பொதுவான உதாரணம் வகுப்பு :mod:`qiskit.opflow.PauliSumOp`, ஹாமில்டோனியர்களை வரையறுக்கப் பயன்படுகிறது (உதாரணமாக, VQE இல் செருகுவதற்கு), அதை :mod:`qiskit.quantum_info.SparsePauliOp` மூலம் மாற்றலாம். மற்ற :mod:`~qiskit.opflow` பொருட்களை எவ்வாறு நகர்த்துவது என்பது பற்றிய தகவலுக்கு, நீங்கள் `Opflow இடம்பெயர்வு வழிகாட்டி <https://qisk.it/opflow_migration>`_ ஐப் பார்க்கவும்.
te: :mod:`qiskit.opflow` నుండి ట్రాన్సిషన్ సమస్య సెటప్‌లో భాగంగా అల్గారిథమ్‌లు తీసుకునే తరగతులను ప్రభావితం చేస్తుంది. నియమం ప్రకారం, చాలా వరకు :mod:`qiskit.opflow` డిపెండెన్సీలు ప్రత్యక్ష :mod:`qiskit.quantum_info` భర్తీని కలిగి ఉంటాయి. ఒక సాధారణ ఉదాహరణ క్లాస్ :mod:`qiskit.opflow.PauliSumOp`, హామిల్టోనియన్లను నిర్వచించడానికి ఉపయోగిస్తారు (ఉదాహరణకు, VQEకి ప్లగ్ చేయడానికి), దీనిని :mod:`qiskit.quantum_info.SparsePauliOp` ద్వారా భర్తీ చేయవచ్చు. ఇతర :mod:`~qiskit.opflow` ఆబ్జెక్ట్‌లను ఎలా తరలించాలో సమాచారం కోసం, మీరు `Opflow మైగ్రేషన్ గైడ్ <https://qisk.it/opflow_migration>`_ని చూడవచ్చు.

source: For further background and detailed migration steps, see the:
pt_un: Para obter mais informações e passos detalhados de migração, consulte:
ta: மேலும் பின்னணி மற்றும் விரிவான இடம்பெயர்வு படிகளுக்கு, பார்க்கவும்:
te: తదుపరి నేపథ్యం మరియు వివరణాత్మక మైగ్రేషన్ దశల కోసం, వీటిని చూడండి:

source: `Quantum Instance migration guide <https://qisk.it/qi_migration>`_
pt_un: `Guia de migração de Quantum Instance <https://qisk.it/qi_migration>`_
ta: ` குவாண்டம் நிகழ்வு இடம்பெயர்வு வழிகாட்டி <https://qisk.it/qi_migration>` _
te: `క్వాంటం ఇన్‌స్టాన్స్ మైగ్రేషన్ గైడ్ <https://qisk.it/qi_migration>`_

source: How to choose a primitive configuration for your algorithm
pt_un: Como escolher uma configuração primitiva para seu algoritmo
ta: உங்கள் அல்காரிதத்திற்கான பழமையான உள்ளமைவை எவ்வாறு தேர்வு செய்வது
te: మీ అల్గోరిథం కోసం ప్రిమిటివ్ కాన్ఫిగరేషన్‌ను ఎలా ఎంచుకోవాలి

source: The classes in :mod:`qiskit.algorithms` are initialized with any implementation of :class:`qiskit.primitive.BaseSampler` or class:`qiskit.primitive.BaseEstimator`.
pt_un: As classes em :mod:`qiskit.algorithms` são inicializadas com qualquer implementação de :class:`qiskit.primitive.BaseSampler` ou class:`qiskit.primitive.BaseEstimator`.
ta: :mod:` qiskit.algorithms ` இல் வகுப்புகள் :class:` qiskit.primitive.BaseSampler ` or class: `qiskit.primitive.BaseEstimator `.
te: :mod:`qiskit.algorithms`లోని క్లాసులు :class:`qiskit.primitive.BaseSampler` లేదా class:`qiskit.primitive.BaseEstimator` యొక్క ఏదైనా అమలుతో ప్రారంభించబడతాయి.

source: Once the kind of primitive is known, you can choose between the primitive implementations that better adjust to your case. For example:
pt_un: Uma vez conhecido o tipo de primitiva, você pode escolher entre as implementações primitivas que melhor se ajustam ao seu caso. Por exemplo:
ta: பழமையான வகை தெரிந்தவுடன், உங்கள் விஷயத்தில் சிறப்பாகச் சரிசெய்யும் பழமையான செயலாக்கங்களுக்கு இடையே நீங்கள் தேர்வு செய்யலாம். உதாரணத்திற்கு:
te: ప్రిమిటివ్ రకం తెలిసిన తర్వాత, మీరు మీ కేసుకు బాగా సర్దుబాటు చేసే ప్రిమిటివ్ ఇంప్లిమెంటేషన్ల మధ్య ఎంచుకోవచ్చు. ఉదాహరణకి:

source: For quick prototyping, you can use the **reference implementations of primitives** included in Qiskit: :class:`qiskit.primitives.Sampler` and :class:`qiskit.primitives.Estimator`.
pt_un: Para prototipagem rápida, você pode usar as **reference implementations of primitives** inclusas no Qiskit: :class:`qiskit.primitives.Sampler` e :class:`qiskit.primitives.Estimator`.
ta: விரைவான நெறிமுறைகளுக்காக, நீங்கள் ப்ரெம்மியர் * * * சேர்க்கப்பட்ட ஆதாரங்களின் ** குறிப்பு முறைமையைப் பயன்படுத்த முடியும்: :class:` qiskit.primitives.Sampler ` and :class:` qiskit.primitives.Estimator `.
te: తక్షణ ప్రోటోటైపింగ్ కోసం, మీరు Qiskit: :class:`qiskit.primitives.Sampler` మరియు :class:`qiskit.primitives.Estimator`లో చేర్చబడిన **ప్రిమిటివ్ ఇంప్లిమెంటేషన్లని** ఉపయోగించవచ్చు.

source: For finer algorithm tuning, a local simulator such as the **primitive implementation in Aer**: :class:`qiskit_aer.primitives.Sampler` and :class:`qiskit_aer.primitives.Estimator`.
pt_un: Para um ajuste mais fino do algoritmo, um simulador local como a **primitive implementation in Aer**: :class:`qiskit_aer.primitives.Sampler` e :class:`qiskit_aer.primitives.Estimator`.
ta: சிறந்த அல்காரிதம் ட்யூனிங்கிற்காக, ** Aer இல் உள்ள பழமையான செயல்படுத்தல்**: :class:`qiskit_aer.primitives.Sampler` மற்றும் :class:`qiskit_aer.primitives.Estimator` போன்ற உள்ளூர் சிமுலேட்டர்.
te: చక్కటి అల్గారిథమ్ ట్యూనింగ్ కోసం, Aerలో **ప్రిమిటివ్ ఇంప్లిమెంటేషన్: :class:`qiskit_aer.primitives.Sampler` మరియు :class:`qiskit_aer.primitives.Estimator` వంటి స్థానిక సిమ్యులేటర్.

source: For executing in quantum hardware you can:
pt_un: Para executar em um hardware quântico, você pode:
ta: குவாண்டம் வன்பொருளை இயக்க நீங்கள்:
te: క్వాంటం హార్డ్‌వేర్‌లో అమలు చేయడానికి మీరు వీటిని చేయవచ్చు:

source: access services with native primitive implementations, such as **IBM's Qiskit Runtime service** via :class:`qiskit_ibm_runtime.Sampler` and :class:`qiskit_ibm_runtime.Estimator`
pt_un: acessar serviços com implementações primitivas nativas, como **IBM's Qiskit Runtime service** via :class:`qiskit_ibm_runtime.Sampler` e :class:`qiskit_ibm_runtime.Estimator`
ta: **IBM's Qiskit Runtime service** போன்ற சொந்த பழமையான செயலாக்கங்களுடன் சேவைகளை அணுகவும்:class:`qiskit_ibm_runtime.Sampler` மற்றும் :class:`qiskit_ibm_runtime.Estimator`
te: **IBM యొక్క Qiskit రన్‌టైమ్ సేవ** వంటి స్థానిక ప్రిమిటివ్ ఇంప్లిమెంటేషన్లతో సేవలను యాక్సెస్ చేయండి :class:`qiskit_ibm_runtime.Sampler` మరియు :class:`qiskit_ibm_runtime.Estimator` ద్వారా

source: Wrap any backend with **Backend Primitives** (:class:`~qiskit.primitives.BackendSampler` and :class:`~qiskit.primitives.BackendEstimator`). These wrappers implement a primitive interface on top of a backend that only supports ``Backend.run()``.
pt_un: Encapsule qualquer backend com **Backend Primitives** (:class:`~qiskit.primitives.BackendSampler` e :class:`~qiskit.primitives.BackendEstimator`). Esses wrappers implementam uma interface primitiva em cima de um backend que suporta apenas ``Backend.run()``.
ta: **Backend Primitives** (:class:`~qiskit.primitives.BackendSampler` மற்றும் :class:`~qiskit.primitives.BackendEstimator`) மூலம் எந்தப் பின்முனையையும் மடக்குங்கள். இந்த ரேப்பர்கள், ``Backend.run()`` ஐ மட்டுமே ஆதரிக்கும் பின்தளத்தின் மேல் ஒரு பழமையான இடைமுகத்தைச் செயல்படுத்துகின்றன.
te: **బ్యాకెండ్ ప్రిమిటివ్స్** (:class:`~qiskit.primitives.BackendSampler` మరియు :class:`~qiskit.primitives.BackendEstimator`)తో ఏదైనా బ్యాకెండ్‌ను వ్రాప్ చేయండి. ఈ వ్రాపర్లు కేవలం ``Backend.run()``కి మాత్రమే మద్దతిచ్చే బ్యాకెండ్ పైన ప్రిమిటివ్ ఇంటర్‌ఫేస్‌ను అమలు చేస్తాయి.

source: For more detailed information and examples, particularly on the use of the **Backend Primitives**, please refer to the `Quantum Instance migration guide <https://qisk.it/qi_migration>`_.
pt_un: Para obter informações e exemplos mais detalhados, particularmente sobre o uso de **Backend Primitives**, consulte o `Guia de Migração de Quantum Instance <https://qisk.it/qi_migration>`_.
ta: மேலும் விரிவான தகவல் மற்றும் எடுத்துக்காட்டுகளுக்கு, குறிப்பாக **Backend Primitives** பயன்பாடுகுறித்து, `குவாண்டம் நிகழ்வு இடம்பெயர்வு வழிகாட்டி <https://qisk.it/qi_migration>`_ ஐப் பார்க்கவும்.
te: మరింత వివరణాత్మక సమాచారం మరియు ఉదాహరణల కోసం, ప్రత్యేకించి **Backend Primitives** ఉపయోగం కోసం, దయచేసి `క్వాంటం ఇన్‌స్టాన్స్ మైగ్రేషన్ గైడ్ <https://qisk.it/qi_migration>`_ని చూడండి.

source: In this guide, we will cover 3 different common configurations for algorithms that determine **which primitive import** you should be selecting:
pt_un: Neste guia, abordaremos 3 configurações comuns diferentes para algoritmos que determinam **qual importação primitiva** você deve selecionar:
ta: இந்த வழிகாட்டியில், **எந்தப் பழமையான இறக்குமதியை** நீங்கள் தேர்ந்தெடுக்க வேண்டும் என்பதைத் தீர்மானிக்கும் அல்காரிதங்களுக்கான 3 வெவ்வேறு பொதுவான உள்ளமைவுகளை நாங்கள் உள்ளடக்குவோம்:
te: ఈ గైడ్‌లో, మీరు ఎంచుకోవాల్సిన **ఏ ప్రిమిటివ్ ఇంపోర్ట్**ని నిర్ణయించే అల్గారిథమ్‌ల కోసం మేము 3 విభిన్న సాధారణ కాన్ఫిగరేషన్‌లను కవర్ చేస్తాము:

source: Running an algorithm with a statevector simulator (i.e., using :mod:`qiskit.opflow`\'s legacy :class:`.MatrixExpectation`), when you want the ideal outcome without shot noise:
pt_un: Executando um algoritmo com um simulador de vetor de estado (ou seja, usando a :class:`.MatrixExpectation` legada de :mod:`qiskit.opflow`), quando você desejar um resultado ideal sem ruído de execução:
ta: ஸ்டேட்வெக்டர் சிமுலேட்டருடன் ஒரு அல்காரிதத்தை இயக்குதல் (அதாவது :mod:`qiskit.opflow`\'s legacy :class:`.MatrixExpectation`) ஐப் பயன்படுத்தி, ஷாட் இரைச்சல் இல்லாமல் சிறந்த முடிவை நீங்கள் விரும்பினால்:
te: మీరు షాట్ నాయిస్ లేకుండా ఆదర్శవంతమైన ఫలితాన్ని పొందాలనుకున్నప్పుడు, స్టేట్‌వెక్టర్ సిమ్యులేటర్‌ (అంటే, :mod:`qiskit.opflow`\'s లెగసీ :class:`.MatrixExpectation`ని ఉపయోగించడం) ద్వారా అల్గారిథమ్‌ను అమలు చేయడం:

source: Reference Primitives with default configuration (see `QAOA`_ example):
pt_un: Primitivas Aer **com simulador de vetores de estado** (consulte o exemplo de `QAOA`_):
ta: இயல்புநிலை உள்ளமைவுடன் குறிப்பு முதன்மைகள் (`QAOA`_ உதாரணத்தைப் பார்க்கவும்):
te: డిఫాల్ట్ కాన్ఫిగరేషన్‌తో రిఫరెన్స్ ప్రిమిటివ్లు (`QAOA`_ ఉదాహరణ చూడండి):

source: Aer Primitives **with statevector simulator** (see `QAOA`_ example):
pt_un: Primitivas Aer **com simulador de vetores de estado** (consulte o exemplo de `QAOA`_):
ta: ஸ்டேட்வெக்டர் சிமுலேட்டருடன் ஏர் ப்ரிமிடிவ்ஸ் ** (பார்க்க ` QAOA ` _ உதாரணம்):
te: ఎయిర్ ప్రిమిటివ్స్ ** స్టేట్‌వెక్టర్ సిమ్యులేటర్‌తో** (`QAOA`_ ఉదాహరణ చూడండి):

source: Running an algorithm using a simulator/device with shot noise (i.e., using :mod:`qiskit.opflow`\'s legacy :class:`.PauliExpectation`):
pt_un: Executando um algoritmo usando um simulador/dispositivo com ruído de shot (ou seja, usando a classe legada :class:`.PauliExpectation` do módulo :mod:`qiskit.opflow`):
ta: ஷாட் இரைச்சலுடன் சிமுலேட்டர்/சாதனத்தைப் பயன்படுத்தி அல்காரிதத்தை இயக்குதல் (அதாவது :mod:`qiskit.opflow`\'s மரபு :class:`.PauliExpectation` ஐப் பயன்படுத்துதல்):
te: షాట్ నాయిస్‌తో సిమ్యులేటర్/డివైస్ని ఉపయోగించి అల్గారిథమ్‌ను అమలు చేయడం (అనగా :mod:`qiskit.opflow`\'s లెగసీ :class:`.PauliExpectation`ని ఉపయోగించడం):

source: Reference Primitives **with shots** (see `VQE`_ examples):
pt_un: Primitivas de Referência **com shots** (consulte exemplos de `VQE`_):
ta: குறிப்பு முதன்மைகள் ** காட்சிகளுடன்** (`VQE`_ எடுத்துக்காட்டுகளைப் பார்க்கவும்):
te: రిఫరెన్స్ ప్రిమిటివ్స్ **with shots** (`VQE`_ ఉదాహరణలు చూడండి):

source: Aer Primitives with default configuration (see `VQE`_ examples):
pt_un: Primitivas Aer com configuração padrão (consulte exemplos de `VQE`_):
ta: இயல்புநிலை உள்ளமைவுடன் கூடிய ஏர் ப்ரிமிடிவ்ஸ் (`VQE`_ எடுத்துக்காட்டுகளைப் பார்க்கவும்):
te: డిఫాల్ట్ కాన్ఫిగరేషన్‌తో ఎయిర్ ప్రిమిటివ్స్ (`VQE`_ ఉదాహరణలు చూడండి):

source: IBM's Qiskit Runtime Primitives with default configuration (see `VQD`_ example):
pt_un: Primitivas IBM's Qiskit Runtime com configuração padrão (consulte o exemplo de `VQD`_):
ta: ஐபிஎம்மின் கிஸ்கிட் இயக்க நேர ப்ரிமிடிவ்ஸ் இயல்புநிலை உள்ளமைவுடன் ('VQD`_ உதாரணத்தைப் பார்க்கவும்):
te: డిఫాల్ట్ కాన్ఫిగరేషన్‌తో IBM యొక్క Qiskit రన్‌టైమ్ ప్రిమిటివ్స్ (`VQD`_ ఉదాహరణ చూడండి):

source: 3. Running an algorithm on an Aer simulator using a custom instruction (i.e., using :mod:`qiskit.opflow`\'s legacy :class:`.AerPauliExpectation`):
pt_un: 3. Executando um algoritmo em um simulador Aer usando uma instrução personalizada (ou seja, usando a classe legada :class:`.AerPauliExpectation` do módulo :mod:`qiskit.opflow`):
ta: 3. தனிப்பயன் அறிவுறுத்தலைப் பயன்படுத்தி ஏர் சிமுலேட்டரில் அல்காரிதத்தை இயக்குதல் (அதாவது:mod:`qiskit.opflow`\'s மரபு :class:`.AerPauliExpectation` ஐப் பயன்படுத்தி):
te: 3. అనుకూల సూచనను ఉపయోగించి Aer సిమ్యులేటర్‌లో అల్గారిథమ్‌ను అమలు చేయడం (అంటే, :mod:`qiskit.opflow`\'s లెగసీ :class:`.AerPauliExpectation`ని ఉపయోగించడం):
