Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/migration_guides/opflow_migration.po
Languages: ta

source: The role of the :class:`qiskit.opflow.converters` submodule was to convert the operators into other opflow operator classes (:class:`~qiskit.opflow.converters.TwoQubitReduction`, :class:`~qiskit.opflow.converters.PauliBasisChange`...). In the case of the :class:`~qiskit.opflow.converters.CircuitSampler`, it traversed an operator and outputted approximations of its state functions using a quantum backend. Notably, this functionality has been replaced by the :mod:`~qiskit.primitives`.
ta: :class:`qiskit.opflow.converters' துணைத் தொகுதியின் பங்கு, ஆபரேட்டர்களை மற்ற ஆப்ஃப்ளோ ஆபரேட்டர் வகுப்புகளாக மாற்றுவதாகும் (:class:`~qiskit.opflow.converters.TwoQubitReduction`, :class:`~qiskit.opflow.converters .PauliBasisChange`...). :class:`~qiskit.opflow.converters.CircuitSampler` விஷயத்தில், அது ஒரு ஆபரேட்டரைக் கடந்து குவாண்டம் பின்தளத்தைப் பயன்படுத்தி அதன் நிலை செயல்பாடுகளின் தோராயங்களை வெளியிட்டது. குறிப்பிடத்தக்க வகையில், இந்த செயல்பாடு :mod:`~qiskit.primitives` மூலம் மாற்றப்பட்டது.

source: :class:`~qiskit.primitives.Sampler` or :class:`~qiskit.primitives.Estimator` if used with :class:`~qiskit.oflow.expectations`. See examples :ref:`below <example_convert_state>`.
ta: :class:`~qiskit.primitives.Sampler` அல்லது :class:`~qiskit.primitives.Estimator` :class:`~qiskit.oflow.expectations` உடன் பயன்படுத்தினால். எடுத்துக்காட்டுகளைப் பார்க்கவும் :ref:`கீழே <example_convert_state>`.

source: This class allowed a sum a of Pauli operators to be grouped, a similar functionality can be achieved through the :meth:`~qiskit.quantum_info.SparsePauliOp.group_commuting` method of :class:`qiskit.quantum_info.SparsePauliOp`, although this is not a 1-1 replacement, as you can see in the example :ref:`below <example_commuting>`.
ta: பாலி ஆபரேட்டர்களின் தொகையை குழுவாக்க இந்த வகுப்பு அனுமதித்துள்ளது, அதேபோன்ற செயல்பாட்டை :meth:`~qiskit.quantum_info.SparsePauliOp.group_commuting` முறையின் மூலம் அடையலாம் :class:`qiskit.quantum_info.SparsePauliOp`, இருப்பினும் இது 1-1 மாற்று அல்ல, நீங்கள் எடுத்துக்காட்டில் பார்க்க முடியும் :ref:`கீழே <example_commuting>`.

source: No direct replacement. This class was used to convert from :class:`~qiskit.opflow.state_fns.DictStateFn`\s or :class:`~qiskit.opflow.state_fns.VectorStateFn`\s to equivalent :class:`~qiskit.opflow.state_fns.CircuitStateFn`\s.
ta: நேரடி மாற்றீடு இல்லை. இந்த வகுப்பு :class:`~qiskit.opflow.state_fns.DictStateFn`\s அல்லது :class:`~qiskit.opflow.state_fns.VectorStateFn`\s இலிருந்து சமமான :class:`~qiskit.opflow.state_fns ஆக மாற்றப் பயன்படுத்தப்பட்டது. .CircuitStateFn`\s.

source: No direct replacement. This class was used for changing Paulis into other bases.
ta: நேரடி மாற்றீடு இல்லை. பாலிஸை மற்ற தளங்களாக மாற்ற இந்த வகுப்பு பயன்படுத்தப்பட்டது.

source: No direct replacement. This class implements a chemistry-specific reduction for the :class:`.ParityMapper` class in :mod:`qiskit_nature`. The general symmetry logic this mapper depends on has been refactored to other classes in :mod:`~qiskit.quantum_info`, so this specific :mod:`~qiskit.opflow` implementation is no longer necessary.
ta: நேரடி மாற்றீடு இல்லை. இந்த வகுப்பு :class:`.ParityMapper` வகுப்பிற்கான வேதியியல் சார்ந்த குறைப்பை :mod:`qiskit_nature` இல் செயல்படுத்துகிறது. இந்த மேப்பர் சார்ந்திருக்கும் பொதுவான சமச்சீர் தர்க்கம் :mod:`~qiskit.quantum_info` இல் உள்ள மற்ற வகுப்புகளுக்கு மறுசீரமைக்கப்பட்டுள்ளது, எனவே இந்த குறிப்பிட்ட :mod:`~qiskit.opflow` செயல்படுத்தல் இனி தேவையில்லை.

source: Example 1: ``CircuitSampler`` for sampling parametrized circuits
ta: எடுத்துக்காட்டு 1: அளவுருப்படுத்தப்பட்ட சுற்றுகளை மாதிரியாக்குவதற்கு ``சர்க்யூட் சாம்ப்ளர்``

source: Example 2: ``CircuitSampler`` for computing expectation values
ta: எடுத்துக்காட்டு 2: ` CircuitSampler ` ` கணினி எதிர்பார்ப்பு மதிப்புகள்

source: Example 3: ``AbelianGrouper`` for grouping operators
ta: எடுத்துக்காட்டு 3: ` ` AbelianGrouper ` ` குழு இயக்குநர்கள்

source: Evolutions
ta: பரிணாமங்கள்

source: The :mod:`qiskit.opflow.evolutions` submodule was created to provide building blocks for Hamiltonian simulation algorithms, including various methods for Trotterization. The original opflow workflow for Hamiltonian simulation did not allow for delayed synthesis of the gates or efficient transpilation of the circuits, so this functionality was migrated to the ``qiskit.synthesis`` :ref:`Evolution <evolution_synthesis>` module.
ta: :mod:`qiskit.opflow.evolutions' துணைத் தொகுதியானது ஹாமில்டோனியன் உருவகப்படுத்துதல் வழிமுறைகளுக்கான கட்டுமானத் தொகுதிகளை வழங்குவதற்காக உருவாக்கப்பட்டது, இதில் டிராட்டரைசேஷனுக்கான பல்வேறு முறைகளும் அடங்கும். ஹாமில்டோனியன் உருவகப்படுத்துதலுக்கான அசல் ஒப்ஃப்ளோ ஒர்க்ஃப்ளோ, கேட்களின் தாமதமான தொகுப்பு அல்லது சுற்றுகளின் திறமையான டிரான்ஸ்பிலேஷனை அனுமதிக்கவில்லை, எனவே இந்த செயல்பாடு ``qiskit.synthesis`` :ref:`Evolution <evolution_synthesis>` தொகுதிக்கு மாற்றப்பட்டது.

source: The :class:`qiskit.opflow.evolutions.PauliTrotterEvolution` class computes evolutions for exponentiated sums of Paulis by converting to the Z basis, rotating with an RZ, changing back, and Trotterizing. When calling ``.convert()``, the class follows a recursive strategy that involves creating :class:`~qiskit.opflow.evolutions.EvolvedOp` placeholders for the operators, constructing :class:`.PauliEvolutionGate`\s out of the operator primitives, and supplying one of the desired synthesis methods to perform the Trotterization. The methods can be specified via ``string``, which is then inputted into a :class:`~qiskit.opflow.evolutions.TrotterizationFactory`, or by supplying a method instance of :class:`qiskit.opflow.evolutions.Trotter`, :class:`qiskit.opflow.evolutions.Suzuki` or :class:`qiskit.opflow.evolutions.QDrift`.
ta: :class:`qiskit.opflow.evolutions.PauliTrotterEvolution` வகுப்பு, இசட் அடிப்படையில் மாற்றி, RZ உடன் சுழற்றுதல், பின்னோக்கி மாற்றுதல் மற்றும் ட்ராட்டரைசிங் செய்வதன் மூலம் பாலிஸின் அதிவேகத் தொகைகளுக்கான பரிணாமங்களைக் கணக்கிடுகிறது. ``.convert()`` என அழைக்கும் போது, ​​வர்க்கமானது:class:`~qiskit.opflow.evolutions.EvolvedOp` ஒதுக்கிடங்களை உருவாக்கி, ஆபரேட்டர்களுக்காக, :class:`.PauliEvolutionGate`\களை உருவாக்குவதை உள்ளடக்கிய ஒரு சுழல்நிலை உத்தியைப் பின்பற்றுகிறது. ஆபரேட்டர் ப்ரிமிடிவ்ஸ், மற்றும் ட்ரொட்டரைசேஷன் செய்ய விரும்பிய தொகுப்பு முறைகளில் ஒன்றை வழங்குதல். முறைகளை ``ஸ்ட்ரிங்`` மூலம் குறிப்பிடலாம், பின்னர் அது :class:`~qiskit.opflow.evolutions.TrotterizationFactory` இல் உள்ளிடப்படும், அல்லது :class:`qiskit.opflow.evolutions.Trotter இன் முறை நிகழ்வை வழங்குவதன் மூலம் `, :class:`qiskit.opflow.evolutions.Suzuki` அல்லது :class:`qiskit.opflow.evolutions.QDrift`.

source: The different Trotterization methods that extend :class:`qiskit.opflow.evolutions.TrotterizationBase` were migrated to :mod:`qiskit.synthesis`, and now extend the :class:`qiskit.synthesis.ProductFormula` base class. They no longer contain a ``.convert()`` method for standalone use, but are now designed to be plugged into the :class:`.PauliEvolutionGate` and called via ``.synthesize()``. In this context, the job of the :class:`qiskit.opflow.evolutions.PauliTrotterEvolution` class can now be handled directly by the algorithms (for example, :class:`~qiskit.algorithms.time_evolvers.trotterization.TrotterQRTE`\).
ta: :class:`qiskit.opflow.evolutions.TrotterizationBase`ஐ நீட்டிக்கும் வெவ்வேறு ட்ரொட்டரைசேஷன் முறைகள் :mod:`qiskit.synthesis` க்கு நகர்த்தப்பட்டு, இப்போது :class:`qiskit.synthesis.ProductFormula` அடிப்படை வகுப்பை விரிவுபடுத்துகிறது. அவை இனி தனித்த பயன்பாட்டிற்கான ``.convert()`` முறையைக் கொண்டிருக்காது, ஆனால் இப்போது :class:`.PauliEvolutionGate` இல் செருகப்பட்டு ``.synthesize()`` வழியாக அழைக்கப்படும் வகையில் வடிவமைக்கப்பட்டுள்ளது. இந்த சூழலில், :class:`qiskit.opflow.evolutions.PauliTrotterEvolution` வகுப்பின் வேலையை இப்போது அல்காரிதம்கள் மூலம் நேரடியாகக் கையாள முடியும் (உதாரணமாக, :class:`~qiskit.algorithms.time_evolvers.trotterization.TrotterQRTE`\) .

source: In a similar manner, the :class:`qiskit.opflow.evolutions.MatrixEvolution` class performs evolution by classical matrix exponentiation, constructing a circuit with :class:`.UnitaryGate`\s or :class:`.HamiltonianGate`\s containing the exponentiation of the operator. This class is no longer necessary, as the :class:`.HamiltonianGate`\s can be directly handled by the algorithms.
ta: இதே முறையில், :class:`qiskit.opflow.evolutions.MatrixEvolution` வகுப்பு கிளாசிக்கல் மேட்ரிக்ஸ் எக்ஸ்போனென்ஷியேஷன் மூலம் பரிணாமத்தை செய்கிறது, :class:`.UnitaryGate`\s அல்லது :class:`.HamiltonianGate`\s உடன் ஒரு சுற்று உருவாக்குகிறது. ஆபரேட்டரின் விரிவாக்கம். இந்த வகுப்பு இனி தேவையில்லை, ஏனெனில் :class:`.HamiltonianGate`\s நேரடியாக அல்காரிதம்களால் கையாள முடியும்.

source: Trotterizations
ta: சுழற்றுகிறது

source: No direct replacement. This class was used to create instances of one of the classes listed below.
ta: நேரடியான மாற்றம் இல்லை. இந்த வகுப்பு கீழே பட்டியலிடப்பட்ட ஒரு வகுப்புகளின் நிகழ்வுகளைக் உருவாக்க பயன்படுகிறது.

source: Other Evolution Classes
ta: பிற பரிணாம வகுப்புகள்

source: No direct replacement. The workflow no longer requires a specific operator for evolutions.
ta: நேரடியான மாற்றம் இல்லை. பணிபுறம் இல்லையெனில் ஒரு குறிப்பிட்ட இயக்குநர் தேவைப்படுகிறது.

source: Example 1: Trotter evolution
ta: எடுத்துக்காட்டு 1: டிராட்டர் பரிணாமம்

source: Example 2: Evolution with time-dependent Hamiltonian
ta: எடுத்துக்காட்டு 2: காலத்தைச் சார்ந்த ஹாமில்டோனியனுடன் பரிணாமம்

source: Example 3: Matrix evolution
ta: எடுத்துக்காட்டு 3: மேட்ரிக்ஸ் பரிணாமம்

source: Expectations
ta: எதிர்பார்ப்புகள்

source: Expectations are converters which enable the computation of the expectation value of an observable with respect to some state function. This functionality can now be found in the :class:`~qiskit.primitives.Estimator` primitive. Please remember that there are different ``Estimator`` implementations, as noted :ref:`here <attention_primitives>`
ta: எதிர்பார்ப்புகள் என்பது சில நிலைச் செயல்பாட்டைப் பொறுத்தமட்டில் கவனிக்கத்தக்க ஒன்றின் எதிர்பார்ப்பு மதிப்பைக் கணக்கிடுவதற்கு உதவும் மாற்றிகள் ஆகும். இந்தச் செயல்பாட்டை இப்போது :class:`~qiskit.primitives.Estimator` primitive இல் காணலாம். இங்கு <attention_primitives>` :ref:`குறிப்பிடப்பட்டுள்ளபடி வெவ்வேறு ``Estimator`` செயலாக்கங்கள் உள்ளன என்பதை நினைவில் கொள்ளவும்

source: Algorithm-Agnostic Expectations
ta: அல்காரிதம்-அக்னாஸ்டிக் எதிர்பார்ப்புகள்

source: :class:`~qiskit.opflow.expectations.ExpectationFactory`
ta: :class:` ~ qiskit.opflow.opflow.expectations.ExpectationFactory `

source: :class:`~qiskit.opflow.expectations.AerPauliExpectation`
ta: :class:` ~ qiskit.opflow.opflow.expectations.AerPauliExpectation `

source: :class:`~qiskit.opflow.expectations.MatrixExpectation`
ta: :class:` ~ qiskit.opflow.opflow.expectations.MatrixExpectation `

source: Use :class:`qiskit.primitives.Estimator` primitive (if no shots are set, it performs an exact Statevector calculation). See example below.
ta: பயன்படுத்தவும் :class:`qiskit.primitives.Estimator` primitive (காட்சிகள் எதுவும் அமைக்கப்படவில்லை என்றால், அது ஒரு துல்லியமான ஸ்டேட்வெக்டர் கணக்கீட்டைச் செய்கிறது). கீழே உள்ள உதாரணத்தைப் பார்க்கவும்.

source: :class:`~qiskit.opflow.expectations.PauliExpectation`
ta: :class:` ~ qiskit.opflow.opflow.expectations.PauliExpectation `

source: Use any Estimator primitive (for :class:`qiskit.primitives.Estimator`, set ``shots!=None`` for a shot-based simulation, for :class:`qiskit_aer.primitives.Estimator` , this is the default).
ta: எந்த மதிப்பீட்டாளரின் ப்ரிமிட்டிவ் (:class:`qiskit.primitives.Estimator` க்கு, ஷாட் அடிப்படையிலான உருவகப்படுத்துதலுக்கு ``shots!=None`` ஐ அமைக்கவும், :class:`qiskit_aer.primitives.Estimator`, இது இயல்புநிலை).

source: Example 1: Aer Pauli expectation
ta: எடுத்துக்காட்டு 1: ஏர் பாலி எதிர்பார்ப்பு

source: Example 2: Matrix expectation
ta: எடுத்துக்காட்டு 2: மாட்ரிக்ஸ் எதிர்பார்ப்பு

source: :class:`~qiskit.opflow.expectations.CVaRExpectation`
ta: :class:` ~ qiskit.opflow.opflow.expectations.CVaRExpectation `

source: Functionality migrated into new VQE algorithm: :class:`~qiskit.algorithms.minimum_eigensolvers.SamplingVQE`
ta: செயல்பாடு புதிய VQE அல்காரிதத்திற்கு மாற்றப்பட்டது: :class:`~qiskit.algorithms.minimum_eigensolvers.SamplingVQE`

source: Example 1: VQE with CVaR
ta: எடுத்துக்காட்டு 1: CVR யுடன் VQE

source: Gradients
ta: க்ரேடியன்ட்டுகள்

source: The opflow :mod:`~qiskit.opflow.gradients` framework has been replaced by the new :mod:`qiskit.algorithms.gradients` module. The new gradients are **primitive-based subroutines** commonly used by algorithms and applications, which can also be executed in a standalone manner. For this reason, they now reside under :mod:`qiskit.algorithms`.
ta: Opflow :mod:`~qiskit.opflow.gradients` கட்டமைப்பானது புதிய :mod:`qiskit.algorithms.gradients` தொகுதியால் மாற்றப்பட்டது. புதிய சாய்வுகள் **முதன்மை அடிப்படையிலான சப்ரூட்டின்கள்** பொதுவாக அல்காரிதம்கள் மற்றும் பயன்பாடுகளால் பயன்படுத்தப்படுகின்றன, இவை தனித்தனியாகவும் செயல்படுத்தப்படலாம். இந்த காரணத்திற்காக, அவர்கள் இப்போது :mod:`qiskit.algorithms` கீழ் வசிக்கின்றனர்.

source: The former gradient framework contained base classes, converters and derivatives. The "derivatives" followed a factory design pattern, where different methods could be provided via string identifiers to each of these classes. The new gradient framework contains two main families of subroutines: **Gradients** and **QGT/QFI**. The **Gradients** can either be Sampler or Estimator based, while the current **QGT/QFI** implementations are Estimator-based.
ta: முந்தைய கிரேடியன்ட் கட்டமைப்பில் அடிப்படை வகுப்புகள், மாற்றிகள் மற்றும் வழித்தோன்றல்கள் இருந்தன. "வழித்தோன்றல்கள்" ஒரு தொழிற்சாலை வடிவமைப்பு முறையைப் பின்பற்றின, இந்த வகுப்புகள் ஒவ்வொன்றிற்கும் சரம் அடையாளங்காட்டிகள் மூலம் வெவ்வேறு முறைகள் வழங்கப்படலாம். புதிய கிரேடியன்ட் கட்டமைப்பில் சப்ரூட்டின்களின் இரண்டு முக்கிய குடும்பங்கள் உள்ளன: ** கிரேடியன்ட்** மற்றும் **QGT/QFI**. **கிரேடியன்ட்ஸ்** மாதிரி அல்லது மதிப்பீட்டின் அடிப்படையிலானதாக இருக்கலாம், அதே சமயம் தற்போதைய **QGT/QFI** செயலாக்கங்கள் மதிப்பீட்டின் அடிப்படையிலானவை.

source: This leads to a change in the workflow, where instead of doing:
ta: இது பணிப்பாய்வு மாற்றத்திற்கு வழிவகுக்கிறது, அதற்குப் பதிலாக:

source: We now import explicitly the desired class, depending on the target primitive (Sampler/Estimator) and target method:
ta: இலக்கு பழமையான (மாதிரி/மதிப்பீட்டாளர்) மற்றும் இலக்கு முறையைப் பொறுத்து, விரும்பிய வகுப்பை இப்போது வெளிப்படையாக இறக்குமதி செய்கிறோம்:

source: This works similarly for the QFI class, where instead of doing:
ta: இது QFI வகுப்பிற்கும் இதேபோல் வேலை செய்கிறது, இங்குச் செய்வதற்கு பதிலாக:

source: You now have a generic QFI implementation that can be initialized with different QGT (Quantum Gradient Tensor) implementations:
ta: வெவ்வேறு QGT (குவாண்டம் கிரேடியன்ட் டென்சர்) செயலாக்கங்களுடன் தொடங்கக்கூடிய பொதுவான QFI செயல்படுத்தல் இப்போது உங்களிடம் உள்ளது:

source: Here is a quick guide for migrating the most common gradient settings. Please note that all new gradient imports follow the format:
ta: மிகவும் பொதுவான சாய்வு அமைப்புகளை நகர்த்துவதற்கான விரைவான வழிகாட்டி இங்கே உள்ளது. அனைத்து புதிய சாய்வு இறக்குமதிகளும் வடிவமைப்பைப் பின்பற்றுகின்றன என்பதை நினைவில் கொள்ளவும்:

source: ``LinCombEstimatorGradient(estimator=estimator)`` or ``LinCombSamplerGradient(sampler=sampler)``
ta: ``LinCombEstimatorGradient(estimator=estimator)`` அல்லது ``LinCombSamplerGradient(sampler=sampler)``

source: ``ParamShiftEstimatorGradient(estimator=estimator)`` or ``ParamShiftSamplerGradient(sampler=sampler)``
ta: ``ParamShiftEstimatorGradient(estimator=estimator)`` அல்லது ``ParamShiftSamplerGradient(sampler=sampler)``

source: ``FiniteDiffEstimatorGradient(estimator=estimator)`` or ``ParamShiftSamplerGradient(sampler=sampler)``
ta: ``FiniteDiffEstimatorGradient(estimator=estimator)`` அல்லது ``ParamShiftSamplerGradient(sampler=sampler)``

source: Other auxiliary classes in the legacy gradient framework have now been deprecated. Here is the complete migration list:
ta: மரபு கிரேடியன்ட் கட்டமைப்பில் உள்ள பிற துணை வகுப்புகள் இப்போது நிராகரிக்கப்பட்டுள்ளன. முழு இடம்பெயர்வு பட்டியல் இங்கே:

source: No replacement. This was the base class for the gradient, hessian and QFI base classes.
ta: மாற்று இல்லை. இது கிரேடியன்ட், ஹெஸியன் மற்றும் QFI அடிப்படை வகுப்புகளுக்கான அடிப்படை வகுப்பாகும்.

source: :class:`.BaseSamplerGradient` or :class:`.BaseEstimatorGradient`, and specific subclasses per method, as explained above.
ta: :class:`.BaseSamplerGradient` அல்லது :class:`.BaseEstimatorGradient`, மற்றும் ஒரு முறைக்குக் குறிப்பிட்ட துணைப்பிரிவுகள், மேலே விளக்கப்பட்டுள்ளது.

source: :class:`.HessianBase` and :class:`~qiskit.opflow.gradients.Hessian`
ta: :class:` .HessianBase ` மற்றும் :class:` ~ qiskit.opflow.gradients.Hessian `

source: No replacement. The new gradient framework does not work with hessians as independent objects.
ta: மாற்று இல்லை. புதிய கிரேடென்ட் கட்டமைப்பானது ஹெஸ்ஸியன்களுடன் சுயாதீனமான பொருட்களாக வேலை செய்யாது.

source: :class:`.QFIBase` and :class:`~qiskit.opflow.gradients.QFI`
ta: :class:` .QFIBase ` மற்றும் :class:` ~ qiskit.opflow.gradients.QFI `

source: The new :class:`~qiskit.algorithms.gradients.QFI` class extends :class:`~qiskit.algorithms.gradients.QGT`, so the corresponding base class is :class:`~qiskit.algorithms.gradients.BaseQGT`
ta: புதிய :class:`~qiskit.algorithms.gradients.QFI` வகுப்பு நீட்டிக்கப்பட்டுள்ளது :class:`~qiskit.algorithms.gradients.QGT`, எனவே தொடர்புடைய அடிப்படை வகுப்பு :class:`~qiskit.algorithms.gradients.BaseQGT`

source: No replacement. This class was used to convert between circuit and gradient :class:`~qiskit.opflow.primitive_ops.PrimitiveOp`, and this functionality is no longer necessary.
ta: மாற்று இல்லை. சர்க்யூட் மற்றும் கிரேடியன்ட் :class:`~qiskit.opflow.primitive_ops.PrimitiveOp` இடையே மாற்ற இந்த வகுப்பு பயன்படுத்தப்பட்டது, மேலும் இந்தச் செயல்பாடு இனி தேவையில்லை.

source: No replacement. This class was used to convert between circuit and QFI :class:`~qiskit.opflow.primitive_ops.PrimitiveOp`, and this functionality is no longer necessary.
ta: மாற்று இல்லை. சர்க்யூட் மற்றும் QFI :class:`~qiskit.opflow.primitive_ops.PrimitiveOp` இடையே மாற்ற இந்த வகுப்பு பயன்படுத்தப்பட்டது, மேலும் இந்தச் செயல்பாடு இனி தேவையில்லை.

source: No replacement. The same functionality can be achieved with the QFI module.
ta: மாற்று இல்லை. அதே செயல்பாட்டை QFI தொகுதி மூலம் அடையலாம்.

source: Example 1: Finite Differences Batched Gradient
ta: எடுத்துக்காட்டு 1: வரையறுக்கப்பட்ட வேறுபாடுகள் தொகுக்கப்பட்ட கிரேடியன்ட்

source: Example 2: QFI
ta: எடுத்துக்காட்டு 2: QFI
