Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/migration_guides/opflow_migration.po
Languages: ta

source: Opflow Migration Guide
ta: Opflow இடம்பெயர்வு வழிகாட்டி

source: The new :mod:`~qiskit.primitives`, in combination with the :mod:`~qiskit.quantum_info` module, have superseded functionality of :mod:`~qiskit.opflow`. Thus, the latter is being deprecated.
ta: புதிய :mod:`~qiskit.primitives`, :mod:`~qiskit.quantum_info` தொகுதியுடன் இணைந்து, :mod:`~qiskit.opflow` இன் செயல்பாடுகளை மீறியுள்ளது. இதனால், பிந்தையது கைவிடப்படுகிறது.

source: In this migration guide, you will find instructions and code examples for how to migrate your code based on the :mod:`~qiskit.opflow` module to the :mod:`~qiskit.primitives` and :mod:`~qiskit.quantum_info` modules.
ta: இந்த இடம்பெயர்வு வழிகாட்டியில், உங்கள் குறியீட்டை :mod:`~qiskit.opflow` தொகுதியின் அடிப்படையில் :mod:`~qiskit.primitives` மற்றும் :mod:`~qiskitக்கு எப்படி நகர்த்துவது என்பதற்கான வழிமுறைகள் மற்றும் குறியீட்டு எடுத்துக்காட்டுகளைக் காணலாம். quantum_info` தொகுதிகள்.

source: The use of :mod:`~qiskit.opflow` was tightly coupled to the :class:`~qiskit.utils.QuantumInstance` class, which is also being deprecated. For more information on migrating the :class:`~qiskit.utils.QuantumInstance`, please read the `quantum instance migration guide <http://qisk.it/qi_migration>`_.
ta: :mod:`~qiskit.opflow` இன் பயன்பாடு :class:`~qiskit.utils.QuantumInstance` வகுப்போடு இறுக்கமாக இணைக்கப்பட்டது, இதுவும் நிராகரிக்கப்படுகிறது. :class:`~qiskit.utils.QuantumInstance` ஐ நகர்த்துவது பற்றிய கூடுதல் தகவலுக்கு, `குவாண்டம் நிகழ்வு இடம்பெயர்வு வழிகாட்டி <http://qisk.it/qi_migration>`_ ஐப் படிக்கவும்.

source: Most references to the :class:`qiskit.primitives.Sampler` or :class:`qiskit.primitives.Estimator` in this guide can be replaced with instances of any primitive implementation. For example Aer primitives (:class:`qiskit_aer.primitives.Sampler`/:class:`qiskit_aer.primitives.Estimator`) or IBM's Qiskit Runtime primitives (:class:`qiskit_ibm_runtime.Sampler`/:class:`qiskit_ibm_runtime.Estimator`). Specific backends can be wrapped with (:class:`qiskit.primitives.BackendSampler`, :class:`qiskit.primitives.BackendEstimator`) to also present primitive-compatible interfaces.
ta: இந்த வழிகாட்டியில் உள்ள :class:`qiskit.primitives.Sampler` அல்லது :class:`qiskit.primitives.Estimator` பற்றிய பெரும்பாலான குறிப்புகள், எந்தவொரு பழமையான செயலாக்கத்தின் நிகழ்வுகளாலும் மாற்றப்படலாம். எடுத்துக்காட்டாக ஏர் ப்ரிமிடிவ்ஸ் (:class:`qiskit_aer.primitives.Sampler`/:class:`qiskit_aer.primitives.Estimator`) அல்லது IBMன் Qiskit இயக்க நேர ப்ரிமிடிவ்கள் (:class:`qiskit_ibm_runtime.Sampler`/sampler`/ ) பழமையான-இணக்கமான இடைமுகங்களையும் வழங்க, குறிப்பிட்ட பின்தளங்களை (:class:`qiskit.primitives.BackendSampler`, :class:`qiskit.primitives.BackendEstimator`) உடன் சுற்றலாம்.

source: Certain classes, such as the :class:`~qiskit.opflow.expectations.AerPauliExpectation`, can only be replaced by a specific primitive instance (in this case, :class:`qiskit_aer.primitives.Estimator`), or require a specific option configuration. If this is the case, it will be explicitly indicated in the corresponding section.
ta: சில வகுப்பு, :class:` ~ qiskit.opflow.opflow.expectations.AerPauliExpectation `, can only be replaced by a specific primitive instance (in this case, :class:` qiskit_aer.primitives.Estimator `), or தேவை ஒரு குறிப்பிட்ட தேர்வு வடிவமைப்பு. இது வழக்கமாக என்றால், அது ஒத்திசைவு பிரிவில் தெளிவாகக் குறிக்கப்படும்.

source: Background
ta: பின்னணி

source: The :mod:`~qiskit.opflow` module was originally introduced as a layer between circuits and algorithms, a series of building blocks for quantum algorithms research and development.
ta: :mod:`~qiskit.opflow` தொகுதியானது, குவாண்டம் அல்காரிதம் ஆராய்ச்சி மற்றும் மேம்பாட்டிற்கான ஒரு தொடர் கட்டுமானத் தொகுதிகள், சுற்றுகள் மற்றும் வழிமுறைகளுக்கு இடையேயான அடுக்காக முதலில் அறிமுகப்படுத்தப்பட்டது.

source: The recent release of the :mod:`qiskit.primitives` introduced a new paradigm for interacting with backends. Now, instead of preparing a circuit to execute with a ``backend.run()`` type of method, the algorithms can leverage the :class:`.Sampler` and :class:`.Estimator` primitives, send parametrized circuits and observables, and directly receive quasi-probability distributions or expectation values (respectively). This workflow simplifies considerably the pre-processing and post-processing steps that previously relied on this module; encouraging us to move away from :mod:`~qiskit.opflow` and find new paths for developing algorithms based on the :mod:`~qiskit.primitives` interface and the :mod:`~qiskit.quantum_info` module.
ta: :mod:`qiskit.primitives` இன் சமீபத்திய வெளியீடு பின்தளங்களுடன் தொடர்புகொள்வதற்கான புதிய முன்னுதாரணத்தை அறிமுகப்படுத்தியது. இப்போது, ​​``backend.run()`` வகை முறை மூலம் இயக்க ஒரு சர்க்யூட்டைத் தயாரிப்பதற்குப் பதிலாக, அல்காரிதம்கள் :class:`.Sampler` மற்றும் :class:`.Estimator` ப்ரிமிட்டிவ்களைப் பயன்படுத்தி, அளவுருப்படுத்தப்பட்ட சுற்றுகளை அனுப்பலாம் மற்றும் கவனிக்கக்கூடியவை, மற்றும் நேரடியாக அரை-நிகழ்தகவு விநியோகங்கள் அல்லது எதிர்பார்ப்பு மதிப்புகள் (முறையே) பெறுகின்றன. இந்த பணிப்பாய்வு, முன்னர் இந்த தொகுதியை நம்பியிருந்த முன் செயலாக்க மற்றும் பிந்தைய செயலாக்க படிகளை கணிசமாக எளிதாக்குகிறது; :mod:`~qiskit.opflow` இலிருந்து விலகி, :mod:`~qiskit.primitives` இடைமுகம் மற்றும் :mod:`~qiskit.quantum_info` தொகுதியின் அடிப்படையில் அல்காரிதம்களை உருவாக்குவதற்கான புதிய பாதைகளைக் கண்டறிய எங்களை ஊக்குவிக்கிறது.

source: This guide traverses the opflow submodules and provides either a direct alternative (i.e., using :mod:`~qiskit.quantum_info`), or an explanation of how to replace their functionality in algorithms.
ta: இந்த வழிகாட்டி opflow துணைமட்யூல்களைக் கடந்து ஒரு நேரடி மாற்று (அதாவது :mod:`~qiskit.quantum_info` ஐப் பயன்படுத்துதல்) அல்லது அல்காரிதங்களில் அவற்றின் செயல்பாட்டை எவ்வாறு மாற்றுவது என்பது பற்றிய விளக்கத்தை வழங்குகிறது.

source: The functional equivalency can be roughly summarized as follows:
ta: செயல்பாட்டு சமநிலையை தோராயமாக பின்வருமாறு சுருக்கமாகக் கூறலாம்:

source: Opflow Module
ta: Opflow தொகுதி

source: Alternative
ta: மாற்று

source: Operators (:class:`~qiskit.opflow.OperatorBase`, :ref:`operator_globals`, :mod:`~qiskit.opflow.primitive_ops`, :mod:`~qiskit.opflow.list_ops`)
ta: ஆபரேட்டர்கள் (:class:`~qiskit.opflow.OperatorBase`, :ref:`operator_globals`, :mod:`~qiskit.opflow.primitive_ops`, :mod:`~qiskit.opflow.list_ops`)

source: :mod:`qiskit.algorithms.gradients`
ta: :mod:` qiskit.algorithms.gradients-action

source: Contents
ta: உள்ளடக்கம்

source: This document covers the migration from these opflow submodules:
ta: இந்த ஆவணம் இந்த ஓப்ஃப்ளோ துணைத் தொகுதிகளிலிருந்து இடம்பெயர்வதை உள்ளடக்கியது:

source: **Operators**
ta: **ஆபரேட்டர்கள்**

source: `Operator Base Class`_
ta: `ஆபரேட்டர் அடிப்படை வகுப்பு`_

source: `Operator Globals`_
ta: `ஆபரேட்டர் குளோபல்ஸ்`_

source: `Primitive and List Ops`_
ta: `முதன்மை மற்றும் பட்டியல் ஆப்ஸ்`_

source: `State Functions`_
ta: `நிலை செயல்பாடுகள்`_

source: **Converters**
ta: ** மாற்றிகள்**

source: `Converters`_
ta: ` மாற்றிகள் `_

source: `Evolutions`_
ta: `பரிணாமங்கள்`_

source: `Expectations`_
ta: `எதிர்பார்ப்புகள்`_

source: **Gradients**
ta: ** க்ரேடியன்ட்டுகள்**

source: `Gradients`_
ta: `க்ரேடியன்ட்டுகள்`_

source: Operator Base Class
ta: ஆபரேட்டர் அடிப்படை வகுப்பு

source: *Back to* `Contents`_
ta: *மீண்டும்* `உள்ளடக்கங்கள்`_

source: The :class:`qiskit.opflow.OperatorBase` abstract class can be replaced with :class:`qiskit.quantum_info.BaseOperator` , keeping in mind that :class:`qiskit.quantum_info.BaseOperator` is more generic than its opflow counterpart.
ta: :class:`qiskit.quantum_info.BaseOperator` என்பதை மனதில் வைத்து, :class:`qiskit.opflow.OperatorBase` சுருக்க வகுப்பை :class:`qiskit.quantum_info.BaseOperator` உடன் மாற்றலாம்.

source: Opflow
ta: ஓப்ஃப்ளோ

source: Despite the similar class names, :class:`qiskit.opflow.OperatorBase` and :class:`qiskit.quantum_info.BaseOperator` are not completely equivalent to each other, and the transition should be handled with care. Namely:
ta: ஒரே மாதிரியான வகுப்புப் பெயர்கள் இருந்தாலும், :class:`qiskit.opflow.OperatorBase` மற்றும் :class:`qiskit.quantum_info.BaseOperator` ஆகியவை ஒன்றுக்கொன்று முற்றிலும் சமமானவை அல்ல, மேலும் மாற்றத்தைக் கவனமாகக் கையாள வேண்டும். அதாவது:

source: 1. :class:`qiskit.opflow.OperatorBase` implements a broader algebra mixin. Some operator overloads that were commonly used :mod:`~qiskit.opflow` (for example ``~`` for ``.adjoint()``) are not defined for :class:`qiskit.quantum_info.BaseOperator`. You might want to check the specific :mod:`~qiskit.quantum_info` subclass instead.
ta: 1. :class:`qiskit.opflow.OperatorBase` ஒரு பரந்த அல்ஜீப்ரா கலவையை செயல்படுத்துகிறது. பொதுவாகப் பயன்படுத்தப்படும் சில ஆபரேட்டர் ஓவர்லோடுகள் :mod:`~qiskit.opflow` (உதாரணமாக ``~`` ``.adjoint()`` க்கு) :class:`qiskit.quantum_info.BaseOperator` க்கு வரையறுக்கப்படவில்லை. அதற்குப் பதிலாக குறிப்பிட்ட :mod:`~qiskit.quantum_info` துணைப்பிரிவை நீங்கள் சரிபார்க்க வேண்டும்.

source: 2. :class:`qiskit.opflow.OperatorBase` also implements methods such as ``.to_matrix()`` or ``.to_spmatrix()``, which are only found in some of the :class:`qiskit.quantum_info.BaseOperator` subclasses.
ta: 2. :class:`qiskit.opflow.OperatorBase` ஆனது ``.to_matrix()`` அல்லது ``.to_spmatrix()`` போன்ற முறைகளையும் செயல்படுத்துகிறது, இவை சில :class:`qiskit.quantum_info இல் மட்டுமே காணப்படுகின்றன. .BaseOperator` துணைப்பிரிவுகள்.

source: See :class:`~qiskit.opflow.OperatorBase` and :class:`~qiskit.quantum_info.BaseOperator` API references for more information.
ta: மேலும் தகவலுக்கு:class:`~qiskit.opflow.OperatorBase` மற்றும் :class:`~qiskit.quantum_info.BaseOperator` API குறிப்புகளைப் பார்க்கவும்.

source: Operator Globals
ta: ஆபரேட்டர் குளோபல்ஸ்

source: Opflow provided shortcuts to define common single qubit states, operators, and non-parametrized gates in the :ref:`operator_globals` module.
ta: :ref:`operator_globals` தொகுதியில் பொதுவான ஒற்றை குவிட் நிலைகள், ஆபரேட்டர்கள் மற்றும் அளவுரு அல்லாத வாயில்களை வரையறுக்க Opflow குறுக்குவழிகளை வழங்கியது.

source: These were mainly used for didactic purposes or quick prototyping, and can easily be replaced by their corresponding :mod:`~qiskit.quantum_info` class: :class:`~qiskit.quantum_info.Pauli`, :class:`~qiskit.quantum_info.Clifford` or :class:`~qiskit.quantum_info.Statevector`.
ta: இவை முக்கியமாக செயற்கையான நோக்கங்களுக்காக அல்லது விரைவான முன்மாதிரிக்காகப் பயன்படுத்தப்பட்டன, மேலும் அவற்றுடன் தொடர்புடைய :mod:`~qiskit.quantum_info` class: :class:`~qiskit.quantum_info.Pauli`, :class:`~qiskit.quantum_info மூலம் எளிதாக மாற்றலாம். .Clifford` அல்லது :class:`~qiskit.quantum_info.Statevector`.

source: The 1-qubit paulis were commonly used for quick testing of algorithms, as they could be combined to create more complex operators (for example, ``0.39 * (I ^ Z) + 0.5 * (X ^ X)``). These operations implicitly created operators of type :class:`~qiskit.opflow.primitive_ops.PauliSumOp`, and can be replaced by directly creating a corresponding :class:`~qiskit.quantum_info.SparsePauliOp`, as shown in the examples below.
ta: 1-குபிட் பாலிஸ் பொதுவாக அல்காரிதம்களின் விரைவான சோதனைக்காகப் பயன்படுத்தப்பட்டது, ஏனெனில் அவை மிகவும் சிக்கலான ஆபரேட்டர்களை உருவாக்குவதற்கு ஒருங்கிணைக்கப்படலாம் (உதாரணமாக, ``0.39 * (I ^ Z) 0.5 * (X ^ X)``). இந்த செயல்பாடுகள் மறைமுகமாக :class:`~qiskit.opflow.primitive_ops.PauliSumOp` வகையின் ஆபரேட்டர்களை உருவாக்கியது, மேலும் கீழே உள்ள உதாரணங்களில் காட்டப்பட்டுள்ளபடி, தொடர்புடைய :class:`~qiskit.quantum_info.SparsePauliOp` ஐ நேரடியாக உருவாக்குவதன் மூலம் மாற்றலாம்.

source: For direct compatibility with classes in :mod:`~qiskit.algorithms`, wrap in :class:`~qiskit.quantum_info.SparsePauliOp`.
ta: :mod:`~qiskit.algorithms` இல் உள்ள வகுப்புகளுடன் நேரடிப் பொருந்தக்கூடிய தன்மைக்கு, :class:`~qiskit.quantum_info.SparsePauliOp` இல் மடிக்கவும்.

source: Example 1: Defining the XX operator
ta: எடுத்துக்காட்டு 1: XX இயக்கியை ஏற்றுமதி செய்

source: **Opflow**
ta: ** நுழைவு **

source: **Alternative**
ta: ** மாற்று

source: Example 2: Defining a more complex operator
ta: எடுத்துக்காட்டு 2: அதிக சிக்கல் இயக்குநர்

source: Common non-parametrized gates (Clifford)
ta: பொதுவான மற்ற வாயுக்கள் (Clifford)

source: Append corresponding gate to :class:`~qiskit.circuit.QuantumCircuit`. If necessary, :class:`qiskit.quantum_info.Operator`\s can be directly constructed from quantum circuits. Another alternative is to wrap the circuit in :class:`~qiskit.quantum_info.Clifford` and call ``Clifford.to_operator()``.
ta: தொடர்புடைய வாயிலை :class:`~qiskit.circuit.QuantumCircuit` உடன் இணைக்கவும். தேவைப்பட்டால், :class:`qiskit.quantum_info.Operator`\s குவாண்டம் சர்க்யூட்களில் இருந்து நேரடியாக உருவாக்கப்படும். மற்றொரு மாற்று:class:`~qiskit.quantum_info.Clifford` இல் சர்க்யூட்டை மடித்து ``Clifford.to_operator()`` என அழைக்கவும்.

source: Constructing :mod:`~qiskit.quantum_info` operators from circuits is not efficient, as it is a dense operation and scales exponentially with the size of the circuit, use with care.
ta: Constructing :mod:` ~ qiskit.quantum_info ` செயல்களில் இருந்து இயக்குவோர் திறமையாகக் கொள்ளப்படாது, இது ஒரு அடர்த்தி செயற்பாடு மற்றும் உருக்களின் அளவு கொண்டு செல்லும் அளவு, கவனத்துடன் பயன்படும்.

source: Example 1: Defining the HH operator
ta: எடுத்துக்காட்டு 1: HH இயக்குநர்

source: If we want to turn this circuit into an operator, we can do:
ta: இந்த சுற்றுப்பாதை ஒரு இயக்கத்தில் திரும்ப வேண்டும் என்றால், நாம் செய்ய முடியும்:

source: :class:`~qiskit.quantum_info.Statevector` or simply :class:`~qiskit.circuit.QuantumCircuit`, depending on the use case.
ta: :class:` ~ qiskit.quantum_info.Statevector ` or simply :class:` ~ qiskit.circuit.QuantumCircuit `.

source: For efficient simulation of stabilizer states, :mod:`~qiskit.quantum_info` includes a :class:`~qiskit.quantum_info.StabilizerState` class. See API reference of :class:`~qiskit.quantum_info.StabilizerState` for more info.
ta: நிலைப்படுத்தி நிலைகளின் திறமையான உருவகப்படுத்துதலுக்கு, :mod:`~qiskit.quantum_info` ஒரு :class:`~qiskit.quantum_info.StabilizerState` வகுப்பை உள்ளடக்கியது. மேலும் தகவலுக்கு :class:`~qiskit.quantum_info.StabilizerState` இன் API குறிப்பைப் பார்க்கவும்.

source: Example 1: Working with stabilizer states
ta: எடுத்துக்காட்டு 1: நிலைமை மாநிலங்களுடன் வேலை

source: Primitive and List Ops
ta: பழமையான மற்றும் பட்டியல் ஆப்ஸ்

source: Most of the workflows that previously relied on components from :mod:`~qiskit.opflow.primitive_ops` and :mod:`~qiskit.opflow.list_ops` can now leverage elements from :mod:`~qiskit.quantum_info`\'s operators instead. Some of these classes do not require a 1-1 replacement because they were created to interface with other opflow components.
ta: பெரும்பாலும் :mod:` ~ qiskit.opflow.primitive_ ops ` and :mod:` ~ qiskit.opflow.list_ ops ` can now leverage elements from :mod:` ~ qiskit.quiskit.quantum_info `\tqiskit.quantum_info ` \ இவற்றில் சில வகுப்புகள் 1-1 மாற்றம் தேவைப்படுகிறது ஏனெனில் அவை மற்ற ஒளி பொருட்களுடன் இடைமுகத்துக்கு உருவாக்கப்பட்டன.

source: Primitive Ops
ta: பழமையான Ops

source: :class:`~qiskit.opflow.primitive_ops.PrimitiveOp` is the :mod:`~qiskit.opflow.primitive_ops` module's base class. It also acts as a factory to instantiate a corresponding sub-class depending on the computational primitive used to initialize it.
ta: :class:`~qiskit.opflow.primitive_ops.PrimitiveOp` என்பது :mod:`~qiskit.opflow.primitive_ops` தொகுதியின் அடிப்படை வகுப்பு. இது தொடங்குவதற்குப் பயன்படுத்தப்படும் கணக்கீட்டு முதற்பொருளைப் பொறுத்து தொடர்புடைய துணை-வகுப்பை உடனடியாக உருவாக்குவதற்கான ஒரு தொழிற்சாலையாகவும் செயல்படுகிறது.

source: Interpreting :class:`~qiskit.opflow.primitive_ops.PrimitiveOp` as a factory class:
ta: :class:` ~ qiskit.opflow.primitive_ops.PrimitiveOp ` ஒரு தொழில் வகுப்பு:

source: Class passed to :class:`~qiskit.opflow.primitive_ops.PrimitiveOp`
ta: வகுப்பு: class:`~qiskit.opflow.primitive_ops.PrimitiveOp` க்கு அனுப்பப்பட்டது

source: Subclass returned
ta: துணைப்பிரிவு திரும்பியது

source: Thus, when migrating opflow code, it is important to look for alternatives to replace the specific subclasses that are used "under the hood" in the original code:
ta: எனவே, ஓப்ஃப்ளோ குறியீட்டை நகர்த்தும்போது, ​​அசல் குறியீட்டில் "ஹூட்டின் கீழ்" பயன்படுத்தப்படும் குறிப்பிட்ட துணைப்பிரிவுகளை மாற்றுவதற்கான மாற்றுகளைத் தேடுவது முக்கியம்:

source: As mentioned above, this class is used to generate an instance of one of the classes below, so there is no direct replacement.
ta: மேலே குறிப்பிடப்பட்டிருப்பதால், இந்த வகுப்பு கீழே ஒரு வகுப்பின் ஒரு நிகழ்வை உருவாக்க பயன்படுகிறது, அதனால் நேரடியான மாற்றம் இல்லை.

source: :class:`~qiskit.quantum_info.Pauli`. For direct compatibility with classes in :mod:`qiskit.algorithms`, wrap in :class:`~qiskit.quantum_info.SparsePauliOp`.
ta: :class:`~qiskit.quantum_info.Pauli`. :mod:`qiskit.algorithms` இல் உள்ள வகுப்புகளுடன் நேரடி இணக்கத்தன்மைக்கு, :class:`~qiskit.quantum_info.SparsePauliOp` என்பதில் மடிக்கவும்.

source: :class:`~qiskit.quantum_info.SparsePauliOp`. See example :ref:`below <example_pauli_sum_op>`.
ta: :class:`~qiskit.quantum_info.SparsePauliOp`. உதாரணத்தைப் பார்க்கவும் :ref:`கீழே <example_pauli_sum_op>`.

source: This class was used to combine a :class:`.PauliSumOp` with its identified symmetries in one object. This functionality is not currently used in any workflow, and has been deprecated without replacement. See :class:`qiskit.quantum_info.analysis.Z2Symmetries` example for updated workflow.
ta: இந்த வகுப்பு ஒரு பொருளில் அதன் அடையாளம் காணப்பட்ட சமச்சீர்களுடன் ஒரு :class:`.PauliSumOp` ஐ இணைக்கப் பயன்படுத்தப்பட்டது. இந்த செயல்பாடு தற்போது எந்த பணிப்பாய்வுகளிலும் பயன்படுத்தப்படவில்லை, மேலும் மாற்றியமைக்கப்படாமல் நிறுத்தப்பட்டது. புதுப்பிக்கப்பட்ட பணிப்பாய்வுக்கு:class:`qiskit.quantum_info.analysis.Z2Symmetries` உதாரணத்தைப் பார்க்கவும்.

source: :class:`qiskit.quantum_info.analysis.Z2Symmetries`. See example :ref:`below <example_z2_sym>`.
ta: :class:`qiskit.quantum_info.analysis.Z2Symmetries`. உதாரணத்தைப் பார்க்கவும் :ref:`கீழே <example_z2_sym>`.

source: Example 1: ``PauliSumOp``
ta: எடுத்துக்காட்டு 1: ` PauliSumOp ` `

source: Example 2: ``Z2Symmetries`` and ``TaperedPauliSumOp``
ta: எடுத்துக்காட்டு 2: ``Z2Symmetries`` மற்றும் ``TaperedPauliSumOp``

source: The :mod:`~qiskit.opflow.list_ops` module contained classes for manipulating lists of :mod:`~qiskit.opflow.primitive_ops` or :mod:`~qiskit.opflow.state_fns`. The :mod:`~qiskit.quantum_info` alternatives for this functionality are the :class:`~qiskit.quantum_info.PauliList` and :class:`~qiskit.quantum_info.SparsePauliOp` (for sums of :class:`~qiskit.quantum_info.Pauli`\s).
ta: :mod:`~qiskit.opflow.list_ops` தொகுதியில் :mod:`~qiskit.opflow.primitive_ops` அல்லது :mod:`~qiskit.opflow.state_fns` பட்டியல்களை கையாளும் வகுப்புகள் உள்ளன. இந்தச் செயல்பாட்டிற்கான :mod:`~qiskit.quantum_info` மாற்றுகள் :class:`~qiskit.quantum_info.PauliList` மற்றும் :class:`~qiskit.quantum_info.SparsePauliOp` (:class:`~qiskit. quantum_info.Pauli`\s).

source: No direct replacement. This is the base class for operator lists. In general, these could be replaced with Python ``list``\s. For :class:`~qiskit.quantum_info.Pauli` operators, there are a few alternatives, depending on the use-case. One alternative is :class:`~qiskit.quantum_info.PauliList`.
ta: நேரடியான மாற்றம் இல்லை. இது இயக்குநர் பட்டியலுக்கான அடிப்படை வகுப்பு. பொதுவாக, இவை பைதான் ` ` பட்டியல் ` ` ` பட்டியலுடன் மாற்றமுடியும். :class:` ~ qiskit.quantum_info.Pauli ` இயக்குநர்கள், உபயோகத்தைப் பொறுத்து, சில மாற்றங்கள் உள்ளன. ஒரு மாற்று :class:` ~ qiskit.quantum_info.PauliList `.

source: No direct replacement. Current workflows do not require composition of states and operators within one object (no lazy evaluation).
ta: நேரடியான மாற்றம் இல்லை. தற்போதைய பணிபுரியும் மாநிலங்களின் தொகுப்பை தேவையிடுவதிலேயே ஒரு பொருள் (எல்லா மதிப்பீடுகள் இல்லை).

source: No direct replacement. For :class:`~qiskit.quantum_info.Pauli` operators, use :class:`~qiskit.quantum_info.SparsePauliOp`.
ta: நேரடியான மாற்றம் இல்லை. :class:` ~ qiskit.quantum_info.Pauli ` இயக்குநர்கள், :class:` ~ qiskit.quantum_info.SparsePauliOp `.

source: State Functions
ta: நிலை செயல்பாடுகள்

source: The :mod:`~qiskit.opflow.state_fns` module can be generally replaced by subclasses of :mod:`~qiskit.quantum_info`\'s :class:`qiskit.quantum_info.QuantumState`.
ta: :mod:` ~ qiskit.opflow.state_ fns ` module பொதுவாக :mod:` ~ qiskit.quantum_info `\'s :class:` qiskit.quantum_info.QuantumState `.

source: Similarly to :class:`~qiskit.opflow.primitive_ops.PrimitiveOp`, :class:`~qiskit.opflow.state_fns.StateFn` acts as a factory to create the corresponding subclass depending on the computational primitive used to initialize it.
ta: அதே போல :class:` ~ qiskit.opflow.primitive_ ops.PrimitiveOp `, :class:` ~ qiskit.opflow.opflow.state_ fns.StateFn ` செயல்பாடு ஒரு தொழிற்சாலைகளாக செயல்படுகிறது.

source: Interpreting :class:`~qiskit.opflow.state_fns.StateFn` as a factory class:
ta: :class:` ~ qiskit.opflow.opflow.state_ fns.StateFn ` ஒரு தொழில் வகுப்பு:

source: Class passed to :class:`~qiskit.opflow.state_fns.StateFn`
ta: வகுப்பு :class:` ~ qiskit.opflow.state_ fns.StateFn

source: Sub-class returned
ta: துணை வகுப்பு திரும்பி

source: This means that references to :class:`~qiskit.opflow.state_fns.StateFn` in opflow code should be examined to identify the subclass that is being used, to then look for an alternative.
ta: அதாவது:class:`~qiskit.opflow.state_fns.StateFn` க்கான குறிப்புகள் ஆப்ஃப்ளோ குறியீட்டில் பயன்படுத்தப்படும் துணைப்பிரிவை அடையாளம் காண, பின்னர் ஒரு மாற்றீட்டைத் தேட வேண்டும்.

source: In most cases, :class:`~qiskit.quantum_info.Statevector`. However, please remember that :class:`~qiskit.opflow.state_fns.StateFn` is a factory class.
ta: பெரும்பாலான வழக்குகளில், :class:`~ qiskit.quantum_info.Statevector `. எனினும், தயவு செய்து, :class:` ~ qiskit.opflow.state_ fns.StateFn ` ஒரு தொழிற்சாலைகளாகும்.

source: This class was used to store efficient representations of sparse measurement results. The :class:`~qiskit.primitives.Sampler` now returns the measurements as an instance of :class:`~qiskit.result.QuasiDistribution` (see example in `Converters`_).
ta: அரிதான அளவீட்டு முடிவுகளின் திறமையான பிரதிநிதித்துவங்களைச் சேமிக்க இந்த வகுப்பு பயன்படுத்தப்பட்டது. :class:`~qiskit.primitives.Sampler` இப்போது அளவீடுகளை :class:`~qiskit.result.QuasiDistribution` இன் உதாரணமாக வழங்குகிறது (உதாரணமாக `Converters`_ இல் பார்க்கவும்).

source: This class can be replaced with :class:`~qiskit.quantum_info.Statevector` or :class:`~qiskit.quantum_info.StabilizerState` (for Clifford-based vectors).
ta: இந்த வகுப்பை :class:`~qiskit.quantum_info.Statevector` அல்லது :class:`~qiskit.quantum_info.StabilizerState` (Clifford-அடிப்படையிலான திசையன்களுக்கு) என மாற்றலாம்.

source: No direct replacement. This class was used for sparse statevector representations.
ta: நேரடியான மாற்றம் இல்லை. இந்த வகுப்பு வெப்பமடைதலுக்கு பயன்படுத்தப்பட்டது.

source: No direct replacement. This class was used to represent measurements against operators.
ta: நேரடியான மாற்றம் இல்லை. இந்த வகுப்பு இயக்குநர்களுக்கு எதிரான அளவீடுகளைக் குறிக்கும்.

source: Used in :class:`~qiskit.opflow.expectations.CVaRExpectation`. Functionality now covered by :class:`.SamplingVQE`. See example in `Expectations`_.
ta: :class:`~qiskit.opflow.expectations.CVaRExpectation` இல் பயன்படுத்தப்பட்டது. செயல்பாடு இப்போது :class:`.SamplingVQE` ஆல் வழங்கப்படுகிறது. `எதிர்பார்ப்புகள்`_ இல் உதாரணத்தைப் பார்க்கவும்.

source: Example 1: Applying an operator to a state
ta: எடுத்துக்காட்டு 1: ஒரு மாநிலத்திற்கு ஒரு இயக்குநர் பயன்படுகிறது

source: See more applied examples in `Expectations`_ and `Converters`_.
ta: `எதிர்பார்ப்புகள்`_ மற்றும் `மாற்றிகள்`_ ஆகியவற்றில் பயன்படுத்தப்பட்ட கூடுதல் எடுத்துக்காட்டுகளைப் பார்க்கவும்.

source: Converters
ta: மாற்றிகள்
