Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/migration_guides/qi_migration.po
Languages: ta

source: Quantum Instance Migration Guide
ta: குவாண்டம் நிகழ்வு இடம்பெயர்வு வழிகாட்டி

source: The :class:`~qiskit.utils.QuantumInstance` is a utility class that allows the joint configuration of the circuit transpilation and execution steps, and provides functions at a higher level of abstraction for a more convenient integration with algorithms. These include measurement error mitigation, splitting/combining execution to conform to job limits, and ensuring reliable execution of circuits with additional job management tools.
ta: :class:`~qiskit.utils.QuantumInstance` என்பது சர்க்யூட் டிரான்ஸ்பிலேஷன் மற்றும் எக்ஸிகியூஷன் ஸ்டெப்களின் கூட்டு உள்ளமைவை அனுமதிக்கும் ஒரு பயன்பாட்டு வகுப்பாகும், மேலும் அல்காரிதங்களுடன் மிகவும் வசதியான ஒருங்கிணைக்க உயர் மட்ட சுருக்கத்தில் செயல்பாடுகளை வழங்குகிறது. அளவீட்டுப் பிழையைத் தணித்தல், வேலை வரம்புகளுக்கு இணங்க பிரித்தல்/ஒருங்கிணைத்தல் மற்றும் கூடுதல் வேலை மேலாண்மை கருவிகளுடன் சுற்றுகளை நம்பகமான முறையில் செயல்படுத்துவதை உறுதி செய்தல் ஆகியவை இதில் அடங்கும்.

source: The :class:`~qiskit.utils.QuantumInstance` is being deprecated for several reasons: On one hand, the functionality of :meth:`~qiskit.utils.QuantumInstance.execute` has now been delegated to the different implementations of the :mod:`~qiskit.primitives` base classes. On the other hand, with the direct implementation of transpilation at the primitives level, the algorithms no longer need to manage that aspect of execution, and thus :meth:`~qiskit.utils.QuantumInstance.transpile` is no longer required by the workflow. If desired, custom transpilation routines can still be performed at the user level through the :mod:`~qiskit.transpiler` module (see table below).
ta: :class:`~qiskit.utils.QuantumInstance` பல காரணங்களுக்காக நிராகரிக்கப்படுகிறது: ஒருபுறம், :meth:`~qiskit.utils.QuantumInstance.execute` இன் செயல்பாடுகள் இப்போது பல்வேறு செயலாக்கங்களுக்கு வழங்கப்பட்டுள்ளன:mod:`~qiskit.primitives` அடிப்படை வகுப்புகள். மறுபுறம், ப்ரிமிடிவ்ஸ் மட்டத்தில் டிரான்ஸ்பிலேஷனை நேரடியாகச் செயல்படுத்துவதால், அல்காரிதம்கள் செயல்படுத்தலின் அந்த அம்சத்தை நிர்வகிக்க வேண்டிய அவசியமில்லை, இதனால் :meth:`~qiskit.utils.QuantumInstance.transpile` பணிப்பாய்வுக்கு இனி தேவைப்படாது. . விரும்பினால், தனிப்பயன் டிரான்ஸ்பிலேஷன் நடைமுறைகளை இன்னும் பயனர் மட்டத்தில் :mod:`~qiskit.transpiler` தொகுதி மூலம் செய்யலாம் (கீழே உள்ள அட்டவணையைப் பார்க்கவும்).

source: The following table summarizes the migration alternatives for the :class:`~qiskit.utils.QuantumInstance` class:
ta: பின்வரும் அட்டவணை :class:`~qiskit.utils.QuantumInstance` வகுப்பிற்கான இடம்பெயர்வு மாற்றுகளை சுருக்கமாகக் கூறுகிறது:

source: QuantumInstance method
ta: QuantumInstance முறை

source: Alternative
ta: மாற்று

source: :meth:`qiskit.primitives.Sampler.run` or :meth:`qiskit.primitives.Estimator.run`
ta: :meth:`qiskit.primitives.Sampler.run` அல்லது :meth:`qiskit.primitives.Estimator.run`

source: The remainder of this guide will focus on the :meth:`.QuantumInstance.execute` to :mod:`~qiskit.primitives` migration path.
ta: இந்த வழிகாட்டியின் மீதமுள்ளவை :meth:`.QuantumInstance.execute` முதல் :mod:`~qiskit.primitives` இடம்பெயர்வு பாதையில் கவனம் செலுத்தும்.

source: Contents
ta: உள்ளடக்கம்

source: `Choosing the right primitive for your task`_
ta: `உங்கள் பணிக்கான சரியான பழமையானதைத் தேர்ந்தெடுப்பது`_

source: `Choosing the right primitive for your settings`_
ta: `உங்கள் அமைப்புகளுக்குச் சரியான பழமையானதைத் தேர்ந்தெடுப்பது`_

source: `Code examples`_
ta: `குறியீடு உதாரணங்கள்`_

source: **Background on the Qiskit Primitives**
ta: **கிஸ்கிட் ப்ரிமிட்டிவ்ஸின் பின்னணி**

source: The Qiskit Primitives are algorithmic abstractions that encapsulate the access to backends or simulators for an easy integration into algorithm workflows.
ta: கிஸ்கிட் ப்ரிமிடிவ்ஸ் என்பது அல்காரிதம் சுருக்கங்கள் ஆகும், அவை அல்காரிதம் பணிப்பாய்வுகளில் எளிதாக ஒருங்கிணைக்கப் பின்தளங்கள் அல்லது சிமுலேட்டர்களுக்கான அணுகலை இணைக்கின்றன.

source: The current pool of primitives includes **two** different types of primitives: Sampler and Estimator.
ta: தற்போதைய ஆரம்பநிலைகளின் தொகுப்பில் **இரண்டு** வெவ்வேறு வகையான முதற்பொருள்கள் உள்ளன: மாதிரி மற்றும் மதிப்பீட்டாளர்.

source: Qiskit provides reference implementations in :class:`qiskit.primitives.Sampler` and :class:`qiskit.primitives.Estimator`. Additionally, :class:`qiskit.primitives.BackendSampler` and a :class:`qiskit.primitives.BackendEstimator` are wrappers for ``backend.run()`` that follow the primitives interface.
ta: Qiskit :class:`qiskit.primitives.Sampler` மற்றும் :class:`qiskit.primitives.Estimator` இல் குறிப்பு செயலாக்கங்களை வழங்குகிறது. கூடுதலாக, :class:`qiskit.primitives.BackendSampler` மற்றும் ஒரு :class:`qiskit.primitives.BackendEstimator` ஆகியவை ``backend.run()``க்கான ரேப்பர்கள் ஆகும், அவை ப்ரிமிட்டிவ் இடைமுகத்தைப் பின்பற்றுகின்றன.

source: Providers can implement these primitives as subclasses of :class:`~qiskit.primitives.BaseSampler` and :class:`~qiskit.primitives.BaseEstimator` respectively. IBM's Qiskit Runtime (:mod:`qiskit_ibm_runtime`) and Aer (:mod:`qiskit_aer.primitives`) are examples of native implementations of primitives.
ta: வழங்குநர்கள் இந்த பழமையானவற்றை முறையே :class:`~qiskit.primitives.BaseSampler` மற்றும் :class:`~qiskit.primitives.BaseEstimator` ஆகியவற்றின் துணைப்பிரிவுகளாக செயல்படுத்தலாம். ஐபிஎம்மின் கிஸ்கிட் இயக்க நேரம் (:mod:`qiskit_ibm_runtime`) மற்றும் ஏர் (:mod:`qiskit_aer.primitives`) ஆகியவை ப்ரிமிட்டிவ்களின் சொந்த செயலாக்கத்திற்கான எடுத்துக்காட்டுகள்.

source: This guide uses the following naming convention:
ta: இந்த வழிகாட்டிப் பின்வரும் பெயரிடும் மரபைப் பயன்படுத்துகிறது:

source: *Primitives* - Any Sampler/Estimator implementation using base classes :class:`qiskit.primitives.BackendSampler` and a :class:`qiskit.primitives.BackendEstimator`.
ta: *முதன்மைகள்* - அடிப்படை வகுப்புகளைப் பயன்படுத்தி எந்த மாதிரி/மதிப்பீட்டாளர் செயல்படுத்தல் :class:`qiskit.primitives.BackendSampler` மற்றும் ஒரு :class:`qiskit.primitives.BackendEstimator`.

source: *Reference Primitives* - :class:`qiskit.primitives.Sampler` and :class:`qiskit.primitives.Estimator` are reference implementations that come with Qiskit.
ta: *குறிப்பு ப்ரிமிட்டிவ்ஸ்* - :class:`qiskit.primitives.Sampler` மற்றும் :class:`qiskit.primitives.Estimator` ஆகியவை Qiskit உடன் வரும் குறிப்புச் செயலாக்கங்கள்.

source: *Backend Primitives* - Instances of :class:`qiskit.primitives.BackendSampler` and :class:`qiskit.primitives.BackendEstimator`. These allow any backend to implement primitive interfaces
ta: *பின்னணி ப்ரிமிடிவ்ஸ்* - :class:`qiskit.primitives.BackendSampler` மற்றும் :class:`qiskit.primitives.BackendEstimator` இன் நிகழ்வுகள். பழமையான இடைமுகங்களைச் செயல்படுத்த எந்தப் பின்தளத்தையும் இவை அனுமதிக்கின்றன

source: For guidelines on which primitives to choose for your task, please continue reading.
ta: உங்கள் பணிக்கு எந்தப் பழமையானவற்றை தேர்வு செய்ய வேண்டும் என்பதற்கான வழிகாட்டுதல்களுக்கு, தொடர்ந்து படிக்கவும்.

source: Choosing the right primitive for your task
ta: உங்கள் பணிக்கான சரியான பழமையானதைத் தேர்ந்தெடுப்பது

source: The :class:`~qiskit.utils.QuantumInstance` was designed to be an abstraction over transpile/run. It took inspiration from :func:`~qiskit.execute_function.execute`, but retained config information that could be set at the algorithm level, to save the user from defining the same parameters for every transpile/execute call.
ta: :class:`~qiskit.utils.QuantumInstance` ஆனது டிரான்ஸ்பைல்/ரன் மீது சுருக்கமாக வடிவமைக்கப்பட்டுள்ளது. இது :func:`~qiskit.execute_function.execute` இலிருந்து உத்வேகம் பெற்றது, ஆனால் ஒவ்வொரு டிரான்ஸ்பைல்/எக்ஸிகியூட் அழைப்புக்கும் ஒரே அளவுருக்களை வரையறுப்பதில் இருந்து பயனரைக் காப்பாற்ற, அல்காரிதம் அளவில் அமைக்கக்கூடிய கட்டமைப்புத் தகவலைத் தக்கவைத்துக் கொண்டது.

source: The :mod:`qiskit.primitives` share some of these features, but unlike the :class:`~qiskit.utils.QuantumInstance`, there are multiple primitive classes, and each is optimized for a specific purpose. Selecting the right primitive (``Sampler`` or ``Estimator``) requires some knowledge about **what** it is expected to do and **where/how** it is expected to run.
ta: :mod:`qiskit.primitives` இந்த அம்சங்களில் சிலவற்றைப் பகிர்ந்து கொள்கிறது, ஆனால் :class:`~qiskit.utils.QuantumInstance` போலல்லாமல், பல பழமையான வகுப்புகள் உள்ளன, ஒவ்வொன்றும் ஒரு குறிப்பிட்ட நோக்கத்திற்காக உகந்ததாக இருக்கும். சரியான பழமையானதை (``மாதிரி`` அல்லது ``மதிப்பீட்டாளர்``) தேர்ந்தெடுப்பதற்கு, **என்ன** எதிர்பார்க்கப்படுகிறது மற்றும் **எங்கே/எப்படி** இயங்க வேண்டும் என்பது பற்றிய சில அறிவு தேவை.

source: The role of the primitives is two-fold. On one hand, they act as access points to backends and simulators. On the other hand, they are **algorithmic** abstractions with defined tasks:
ta: பிரிமிடிவ்ஸ்களின் பங்கு இரண்டு மடங்கு. ஒருபுறம், அவை பின்தளங்கள் மற்றும் சிமுலேட்டர்களுக்கான அணுகல் புள்ளிகளாகச் செயல்படுகின்றன. மறுபுறம், அவை வரையறுக்கப்பட்ட பணிகளுடன் **அல்காரிதம்** சுருக்கங்கள்:

source: The ``Estimator`` takes in circuits and observables and returns **expectation values**.
ta: `` மதிப்பீட்டாளர் `` சுற்றுகள் மற்றும் கவனிக்கக்கூடியவற்றை எடுத்து ** எதிர்பார்ப்பு மதிப்புகளை * * வழங்குகிறது.

source: The ``Sampler`` takes in circuits, measures them, and returns their **quasi-probability distributions**.
ta: ``மாதிரி`` சுற்றுகளை எடுத்து, அவற்றை அளவிடுகிறது மற்றும் அவற்றின் **அரை-நிகழ்தகவு விநியோகங்களை** வழங்குகிறது.

source: In order to know which primitive to use instead of :class:`~qiskit.utils.QuantumInstance`, you should ask yourself two questions:
ta: :class:`~qiskit.utils.QuantumInstance` என்பதற்குப் பதிலாக எந்தப் பழமையானவற்றைப் பயன்படுத்த வேண்டும் என்பதை அறிய, நீங்களே இரண்டு கேள்விகளைக் கேட்டுக்கொள்ள வேண்டும்:

source: What is the minimal unit of information used by your algorithm?
ta: உங்கள் அல்காரிதம் பயன்படுத்தும் குறைந்தபட்ச தகவல் அலகு என்ன?

source: **Expectation value** - you will need an ``Estimator``
ta: **எதிர்பார்ப்பு மதிப்பு** - உங்களுக்கு ``மதிப்பீட்டாளர்`` தேவைப்படும்

source: **Probability distribution** (from sampling the device) - you will need a ``Sampler``
ta: **நிகழ்தகவு விநியோகம்** (சாதனத்தை மாதிரி எடுப்பதிலிருந்து) - உங்களுக்கு ``மாதிரி`` தேவைப்படும்

source: How do you want to execute your circuits?
ta: உங்கள் சுற்றுகளை எவ்வாறு இயக்க விரும்புகிறீர்கள்?

source: This question is not new. In the legacy algorithm workflow, you would have to decide to set up a :class:`~qiskit.utils.QuantumInstance` with either a real backend from a provider, or a simulator. Now, this "backend selection" process is translated to **where** do you import your primitives from:
ta: இந்தக் கேள்வி புதிதல்ல. பாரம்பரிய அல்காரிதம் பணிப்பாய்வுகளில், வழங்குநரின் உண்மையான பின்தளம் அல்லது சிமுலேட்டருடன் :class:`~qiskit.utils.QuantumInstance` ஐ அமைக்க நீங்கள் முடிவு செய்ய வேண்டும். இப்போது, இந்த "பின்தளத்தில் தேர்வு" செயல்முறையானது **எங்கிருந்து** என மொழிபெயர்க்கப்பட்டுள்ளது:

source: Using **local** statevector simulators for quick prototyping: **Reference Primitives**
ta: விரைவான முன்மாதிரிக்கு **உள்ளூர்** ஸ்டேட்வெக்டர் சிமுலேட்டர்களைப் பயன்படுத்துதல்: **குறிப்பு முதன்மைகள்**

source: Using **local** noisy simulations for finer algorithm tuning: **Aer Primitives**
ta: சிறந்த அல்காரிதம் ட்யூனிங்கிற்காக **உள்ளூர்** சத்தமில்லாத உருவகப்படுத்துதல்களைப் பயன்படுத்துதல்: **Aer Primitives**

source: Accessing **runtime-enabled backends** (or cloud simulators): **Qiskit Runtime Primitives**
ta: **இயக்கநேரம்-செயல்படுத்தப்பட்ட பின்தளங்களை அணுகுகிறது** (அல்லது கிளவுட் சிமுலேட்டர்கள்): **கிஸ்கிட் ரன்டைம் ப்ரிமிட்டிவ்ஸ்**

source: Accessing **non runtime-enabled backends** : **Backend Primitives**
ta: **இயக்க நேர-இயக்கப்படாத பின்தளங்களை அணுகுகிறது** : **பின்புல முதன்மைகள்**

source: Arguably, the ``Sampler`` is the closest primitive to :class:`~qiskit.utils.QuantumInstance`, as they both execute circuits and provide a result back. However, with the :class:`~qiskit.utils.QuantumInstance`, the result data was backend dependent (it could be a counts ``dict``, a :class:`numpy.array` for statevector simulations, etc), while the ``Sampler`` normalizes its ``SamplerResult`` to return a :class:`~qiskit.result.QuasiDistribution` object with the resulting quasi-probability distribution.
ta: விவாதிக்கக்கூடிய வகையில், ``மாதிரி`` என்பது :class:`~qiskit.utils.QuantumInstance` க்கு மிக நெருக்கமான பழமையானது, ஏனெனில் அவை இரண்டும் சுற்றுகளை இயக்கி ஒரு முடிவைத் தருகின்றன. இருப்பினும், :class:`~qiskit.utils.QuantumInstance` உடன், முடிவுத் தரவு பின்தளத்தைச் சார்ந்தது (அது ஸ்டேட்வெக்டர் உருவகப்படுத்துதல்களுக்கான எண்ணிக்கைகள் ``டிக்ட்``, ஒரு :class:`numpy.array` போன்றவையாக இருக்கலாம்), ``Sampler`` அதன் ``SamplerResult`` ஐ இயல்பாக்கும் போது:class:`~qiskit.result.QuasiDistribution` பொருளை அதன் விளைவாக வரும் அரை-நிகழ்தகவுப் பரவலுடன் வழங்குகிறது.

source: The ``Estimator`` provides a specific abstraction for the expectation value calculation that can replace the use of :class:`.QuantumInstance` as well as the associated pre- and post-processing steps, usually performed with an additional library such as :mod:`qiskit.opflow`.
ta: ``மதிப்பீட்டாளர்`` என்பது எதிர்பார்ப்பு மதிப்புக் கணக்கீட்டிற்கான ஒரு குறிப்பிட்ட சுருக்கத்தை வழங்குகிறது, இது :class:`.QuantumInstance` மற்றும் அதனுடன் தொடர்புடைய முன் மற்றும் பிந்தைய செயலாக்க படிகள், பொதுவாக இது போன்ற கூடுதல் நூலகத்துடன் செய்யப்படுகிறது:mod:`qiskit.opflow`.

source: Choosing the right primitive for your settings
ta: உங்கள் அமைப்புகளுக்குச் சரியான பழமையானதைத் தேர்ந்தெடுப்பது

source: Certain :class:`~qiskit.utils.QuantumInstance` features are only available in certain primitive implementations. The following table summarizes the most common :class:`~qiskit.utils.QuantumInstance` settings and which primitives **expose a similar setting through their interface**:
ta: குறிப்பிட்ட :class:`~qiskit.utils.QuantumInstance` அம்சங்கள் சில பழமையான செயலாக்கங்களில் மட்டுமே கிடைக்கும். பின்வரும் அட்டவணை மிகவும் பொதுவான :class:`~qiskit.utils.QuantumInstance` அமைப்புகளைச் சுருக்கமாகக் கூறுகிறது:

source: In some cases, a setting might not be exposed through the interface, but there might an alternative path to make it work. This is the case for custom transpiler passes, which cannot be set through the primitives interface, but pre-transpiled circuits can be sent if setting the option ``skip_transpilation=True``. For more information, please refer to the API reference or source code of the desired primitive implementation.
ta: சில சந்தர்ப்பங்களில், ஒரு அமைப்பு இடைமுகத்தின் மூலம் வெளிப்படாமல் இருக்கலாம், ஆனால் அதைச் செயல்படுத்த மாற்றுப் பாதை இருக்கலாம். தனிப்பயன் டிரான்ஸ்பைலர் பாஸ்களுக்கு இது பொருந்தும், இது ப்ரிமிட்டிவ்ஸ் இடைமுகம் மூலம் அமைக்க முடியாது, ஆனால் ``skip_transpilation=True`` விருப்பத்தை அமைத்தால், முன் டிரான்ஸ்பைல் சுற்றுகள் அனுப்பப்படும். மேலும் தகவலுக்கு, விரும்பிய பழமையான செயலாக்கத்தின் API குறிப்பு அல்லது மூலக் குறியீட்டைப் பார்க்கவும்.

source: QuantumInstance
ta: குவாண்டம் இன்ஸ்டன்ஸ்

source: Reference Primitives
ta: குறிப்பு முதன்மைகள்

source: Aer Primitives
ta: ஏர் ப்ரிமிடிவ்ஸ்

source: Qiskit Runtime Primitives
ta: கிஸ்கிட் ரன்டைம் ப்ரிமிடிவ்ஸ்

source: Backend Primitives
ta: பின்தளத்தில் முதற்பொருள்கள்

source: Select ``backend``
ta: ``பின்னணி`` என்பதைத் தேர்ந்தெடுக்கவும்

source: No
ta: இல்லை

source: Yes
ta: ஆம்

source: Set ``shots``
ta: ``ஷாட்ஸ்`` அமைக்கவும்

source: Simulator settings: ``basis_gates``, ``coupling_map``, ``initial_layout``, ``noise_model``, ``backend_options``
ta: சிமுலேட்டர் அமைப்புகள்: ``basis_gates``, ``coupling_map``, ``initial_layout``, ``noise_model``, ``backend_options``

source: No (inferred from internal ``backend``)
ta: இல்லை (உள் ``பின்தளத்தில்`` இருந்து ஊகிக்கப்பட்டது)

source: Transpiler settings: ``seed_transpiler``, ``optimization_level``
ta: டிரான்ஸ்பைலர் அமைப்புகள்: ``seed_transpiler``, ``optimization_level``

source: Yes (via ``options``) (*)
ta: ஆம் (``options`` வழியாக) (*)

source: Yes (via ``.set_transpile_options()``)
ta: ஆம் (``.set_transpile_options()`` வழியாக)

source: Set unbound ``pass_manager``
ta: வரம்பற்ற ``pass_manager`` என்பதை அமைக்கவும்

source: No (but can ``skip_transpilation``)
ta: இல்லை (ஆனால் ``மாற்றம்_தவிர்க்கலாம்``)

source: Set ``bound_pass_manager``
ta: ``bound_pass_manager`` என்பதை அமைக்கவும்

source: Set ``backend_options``: common ones were ``memory`` and ``meas_level``
ta: ``பின்தளத்தில்_விருப்பங்கள்`` அமைக்கவும்: பொதுவானவை ``நினைவக`` மற்றும் ``மீஸ்_லெவல்``

source: No (only ``qubit_layout``)
ta: இல்லை (``qubit_layout`` மட்டும்)

source: Measurement error mitigation: ``measurement_error_mitigation_cls``, ``cals_matrix_refresh_period``, ``measurement_error_mitigation_shots``, ``mit_pattern``
ta: அளவீட்டுப் பிழைத் தணிப்பு: ``அளவீடு_பிழை_தணிப்பு_cls``, ``cals_matrix_refresh_period``, ``measurement_error_mitigation_shots``, ``mit_pattern``

source: Sampler default -> M3 (*)
ta: மாதிரி இயல்புநிலை -> M3 (*)

source: Job management: ``job_callback``, ``max_job_retries``, ``timeout``, ``wait``
ta: வேலை நிர்வாகம்: ``job_callback``, ``max_job_retries``, ``timeout``, ``wait``

source: Does not apply
ta: பொருந்தாது

source: Sessions, callback (**)
ta: அமர்வுகள், திரும்பத் திரும்ப (**)

source: (*) For more information on error mitigation and setting options on Qiskit Runtime Primitives, visit `this link <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`_.
ta: (*) Qiskit Runtime Primitives இல் பிழைத் தணிப்பு மற்றும் அமைப்பு விருப்பங்கள்பற்றிய கூடுதல் தகவலுக்கு, `இந்த இணைப்பைப் பார்வையிடவும். <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`_.

source: (**) For more information on Runtime sessions, visit `this how-to <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/run_session.html>`_.
ta: (**) இயக்க நேர அமர்வுகள்பற்றிய கூடுதல் தகவலுக்கு, `இது எப்படி <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/how_to/run_session.html>`_ ஐப் பார்வையிடவும்.

source: Code examples
ta: குறியீடு உதாரணங்கள்

source: Example 1: Circuit Sampling with Local Simulation
ta: எடுத்துக்காட்டு 1: சுற்றுச்சூழல் உள்ளமை சாம்பல்

source: **Using Quantum Instance**
ta: **குவாண்டம் நிகழ்வைப் பயன்படுத்துதல்**

source: The only alternative for local simulations using the quantum instance was using an Aer simulator backend. If no simulation method is specified, the Aer simulator will default to an exact simulation (statevector/stabilizer), if shots are specified, it will add shot noise. Please note that ``QuantumInstance.execute()`` returned the counts in hexadecimal format.
ta: குவாண்டம் நிகழ்வைப் பயன்படுத்தி உள்ளூர் உருவகப்படுத்துதல்களுக்கான ஒரே மாற்று ஏர் சிமுலேட்டர் பின்தளத்தைப் பயன்படுத்துவதாகும். உருவகப்படுத்துதல் முறை எதுவும் குறிப்பிடப்படவில்லை எனில், ஏர் சிமுலேட்டர் துல்லியமான உருவகப்படுத்துதலுக்கு (ஸ்டேட்வெக்டர்/ஸ்டெபிலைசர்) இயல்புநிலையாக இருக்கும், காட்சிகள் குறிப்பிடப்பட்டால், அது ஷாட் இரைச்சலைச் சேர்க்கும். ``QuantumInstance.execute()`` எண்களை ஹெக்ஸாடெசிமல் வடிவத்தில் வழங்கியது என்பதை நினைவில் கொள்ளவும்.

source: **Using Primitives**
ta: **முதன்மைகளைப் பயன்படுத்துதல்**

source: The primitives offer two alternatives for local simulation, one with the Reference primitives and one with the Aer primitives. As mentioned above the closest alternative to ``QuantumInstance.execute()`` for sampling is the ``Sampler`` primitive.
ta: ப்ரிமிடிவ்கள் உள்ளூர் உருவகப்படுத்துதலுக்கு இரண்டு மாற்றுகளை வழங்குகின்றன, ஒன்று குறிப்பு ப்ரிமிட்டிவ்ஸ் மற்றும் ஒன்று ஏர் ப்ரிமிட்டிவ்ஸ். மேலே குறிப்பிட்டுள்ளபடி மாதிரிக்கான ``QuantumInstance.execute()`` க்கு மிக நெருக்கமான மாற்று ``Sampler`` primitive ஆகும்.

source: **a. Using the Reference Primitives**
ta: **அ. குறிப்பு முதற்பொருட்களைப் பயன்படுத்துதல்**

source: Basic simulation implemented using the :mod:`qiskit.quantum_info` module. If shots are specified, the results will include shot noise. Please note that the resulting quasi-probability distribution does not use bitstrings but **integers** to identify the states.
ta: :mod:`qiskit.quantum_info` தொகுதியைப் பயன்படுத்தி அடிப்படை உருவகப்படுத்துதல் செயல்படுத்தப்பட்டது. ஷாட்கள் குறிப்பிடப்பட்டால், முடிவுகளில் ஷாட் இரைச்சல் அடங்கும். இதன் விளைவாக வரும் அரை-நிகழ்தகவு விநியோகம் பிட்ஸ்ட்ரிங்ஸைப் பயன்படுத்தாது, ஆனால் மாநிலங்களை அடையாளம் காண ** முழு எண்கள்** என்பதை நினைவில் கொள்ளவும்.

source: **b. Using the Aer Primitives**
ta: ** ஆ. ஏர் ப்ரிமிட்டிவ்களைப் பயன்படுத்துதல்**

source: Aer simulation following the statevector method. This would be the closer replacement of the :class:`~qiskit.utils.QuantumInstance` example, as they are both accessing the same simulator. For this reason, the output metadata is closer to the Quantum Instance's output. Please note that the resulting quasi-probability distribution does not use bitstrings but **integers** to identify the states.
ta: ஸ்டேட்வெக்டர் முறையைப் பின்பற்றும் ஏர் சிமுலேஷன். இது :class:`~qiskit.utils.QuantumInstance` எடுத்துக்காட்டுக்கு மிக நெருக்கமான மாற்றாக இருக்கும், ஏனெனில் அவை இரண்டும் ஒரே சிமுலேட்டரை அணுகுகின்றன. இந்த காரணத்திற்காக, வெளியீட்டு மெட்டாடேட்டா குவாண்டம் நிகழ்வின் வெளியீட்டிற்கு நெருக்கமாக உள்ளது. இதன் விளைவாக வரும் அரை-நிகழ்தகவு விநியோகம் பிட்ஸ்ட்ரிங்ஸைப் பயன்படுத்தாது, ஆனால் மாநிலங்களை அடையாளம் காண ** முழு எண்கள்** என்பதை நினைவில் கொள்ளவும்.

source: The :class:`qiskit.result.QuasiDistribution` class returned as part of the :class:`qiskit.primitives.SamplerResult` exposes two methods to convert the result keys from integer to binary strings/hexadecimal:
ta: :class:`qiskit.result.QuasiDistribution` வகுப்பு :class:`qiskit.primitives.SamplerResult` இன் ஒரு பகுதியாகத் திரும்பியது, முடிவு விசைகளை முழு எண்ணிலிருந்து பைனரி சரங்கள்/ஹெக்ஸாடெசிமலுக்கு மாற்றுவதற்கான இரண்டு முறைகளை வெளிப்படுத்துகிறது:

source: Example 2: Expectation Value Calculation with Local Noisy Simulation
ta: எடுத்துக்காட்டு 2: நிலை சத்தம் உருவகப்படுத்துதலுடன் எதிர்பார்ப்பு மதிப்பைக் கணக்கிடுதல்

source: While this example does not include a direct call to ``QuantumInstance.execute()``, it shows how to migrate from a :class:`~qiskit.utils.QuantumInstance`-based to a :mod:`~qiskit.primitives`-based workflow.
ta: இந்த எடுத்துக்காட்டில் ``QuantumInstance.execute()`` க்கு நேரடி அழைப்பு இல்லை என்றாலும், இது ஒரு :class:`~qiskit.utils.QuantumInstance`-லிருந்து ஒரு :mod:`~qiskit.primitives க்கு இடம்பெயர்வது எப்படி என்பதைக் காட்டுகிறது. `-அடிப்படையிலான பணிப்பாய்வு.

source: The most common use case for computing expectation values with the Quantum Instance was as in combination with the :mod:`~qiskit.opflow` library. You can see more information in the `opflow migration guide <http://qisk.it/opflow_migration>`_.
ta: குவாண்டம் நிகழ்வுடன் எதிர்பார்ப்பு மதிப்புகளைக் கணக்கிடுவதற்கான மிகவும் பொதுவான பயன்பாடு :mod:`~qiskit.opflow` நூலகத்துடன் இணைந்து பயன்படுத்தப்பட்டது. `opflow இடம்பெயர்வு வழிகாட்டி <http://qisk.it/opflow_migration>`_ இல் கூடுதல் தகவலைப் பார்க்கலாம்.

source: The primitives now allow the combination of the opflow and quantum instance functionality in a single ``Estimator``. In this case, for local noisy simulation, this will be the Aer Estimator.
ta: ப்ரிமிடிவ்கள் இப்போது ஒற்றை ``மதிப்பீட்டாளர்`` இல் ஓப்ஃப்ளோ மற்றும் குவாண்டம் நிகழ்வு செயல்பாடுகளின் கலவையை அனுமதிக்கின்றன. இந்த வழக்கில், உள்ளூர் இரைச்சல் உருவகப்படுத்துதலுக்கு, இது ஏர் மதிப்பீட்டாளராக இருக்கும்.

source: Example 3: Circuit Sampling on IBM Backend with Error Mitigation
ta: எடுத்துக்காட்டு 3: பிழைத் தணிப்புடன் IBM பின்தளத்தில் சர்க்யூட் மாதிரி

source: The ``QuantumInstance`` interface allowed the configuration of measurement error mitigation settings such as the method, the matrix refresh period or the mitigation pattern. This configuration is no longer available in the primitives interface.
ta: ``QuantumInstance`` இடைமுகமானது, முறை, மேட்ரிக்ஸ் புதுப்பிப்பு காலம் அல்லது தணிப்பு முறை போன்ற அளவீட்டுப் பிழைத் தணிப்பு அமைப்புகளை உள்ளமைக்க அனுமதித்தது. இந்தக் கட்டமைப்பு இனி primitives இடைமுகத்தில் கிடைக்காது.
