Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/migration_guides/qi_migration.po
Languages: ta

source: The Qiskit Runtime Primitives offer a suite of error mitigation methods that can be easily turned on with the ``resilience_level`` option. These are, however, not configurable. The sampler's ``resilience_level=1`` is the closest alternative to the Quantum Instance's measurement error mitigation implementation, but this is not a 1-1 replacement.
ta: Qiskit Runtime Primitives ஆனது ``resilience_level`` விருப்பத்துடன் எளிதாக இயக்கக்கூடிய பிழைத் தணிப்பு முறைகளின் தொகுப்பை வழங்குகிறது. இருப்பினும், இவை கட்டமைக்க முடியாதவை. மாதிரியின் ``resilience_level=1`` என்பது குவாண்டம் நிகழ்வின் அளவீட்டுப் பிழைத் தணிப்பு செயலாக்கத்திற்கு மிக நெருக்கமான மாற்றாகும், ஆனால் இது 1-1 மாற்றாக இல்லை.

source: For more information on the error mitigation options in the Qiskit Runtime Primitives, you can check out the following `link <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`_.
ta: Qiskit Runtime Primitives இல் உள்ள பிழைத் தணிப்பு விருப்பங்களைப் பற்றிய கூடுதல் தகவலுக்கு, பின்வரும் `இணைப்பைப் பார்க்கவும்.<https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.options.Options.html#qiskit_ibm_runtime.options.Options>`_.

source: Example 4: Circuit Sampling with Custom Bound and Unbound Pass Managers
ta: எடுத்துக்காட்டு 4: தனிப்பயன் மற்றும் வரம்பற்ற பாஸ் மேலாளர்களுடன் சுற்று மாதிரி

source: The management of transpilation is different between the ``QuantumInstance`` and the Primitives.
ta: டிரான்ஸ்பிலேஷன் மேலாண்மையானது ``குவாண்டம் இன்ஸ்டன்ஸ்`` மற்றும் ப்ரிமிட்டிவ்ஸ் ஆகியவற்றுக்கு இடையே வேறுபட்டது.

source: The Quantum Instance allowed you to:
ta: குவாண்டம் நிகழ்வு உங்களை அனுமதித்தது:

source: Define bound and unbound pass managers that will be called during ``.execute()``.
ta: ``. execute()`` இன் போது அழைக்கப்படும் பிணைக்கப்பட்ட மற்றும் வரம்பற்ற பாஸ் மேலாளர்களை வரையறுக்கவும்.

source: Explicitly call its ``.transpile()`` method with a specific pass manager.
ta: குறிப்பிட்ட பாஸ் மேலாளருடன் அதன் ``.ட்ரான்ஸ்பைல்()`` முறையை வெளிப்படையாக அழைக்கவும்.

source: However:
ta: எனினும்:

source: The Quantum Instance **did not** manage parameter bindings on parametrized quantum circuits. This would mean that if a ``bound_pass_manager`` was set, the circuit sent to ``QuantumInstance.execute()`` could not have any free parameters.
ta: குவாண்டம் நிகழ்வு அளவுருக் குவாண்டம் சுற்றுகளில் அளவுருப் பிணைப்புகளை நிர்வகிக்கவில்லை. இதன் பொருள் ``bound_pass_manager`` அமைக்கப்பட்டால், ``QuantumInstance.execute()`` க்கு அனுப்பப்பட்ட சர்க்யூட் எந்த இலவச அளவுருக்களையும் கொண்டிருக்க முடியாது.

source: On the other hand, when using the primitives:
ta: மறுபுறம், பழமையானவற்றைப் பயன்படுத்தும்போது:

source: You cannot explicitly access their transpilation routine.
ta: அவர்களின் டிரான்ஸ்பிலேஷன் வழக்கத்தை நீங்கள் வெளிப்படையாக அணுக முடியாது.

source: The mechanism to apply custom transpilation passes to the Aer, Runtime and Backend primitives is to pre-transpile locally and set ``skip_transpilation=True`` in the corresponding primitive.
ta: தனிப்பயன் டிரான்ஸ்பிலேஷன் பாஸ்களை ஏர், ரன்டைம் மற்றும் பேக்எண்ட் ப்ரிமிடிவ்களுக்குப் பயன்படுத்துவதற்கான வழிமுறையானது, உள்நாட்டில் முன்கூட்டியே டிரான்ஸ்பைல் செய்து, அதற்குரிய பழமையானதில் ``skip_transpilation=True`` ஐ அமைப்பதாகும்.

source: The only primitives that currently accept a custom **bound** transpiler pass manager are instances of :class:`~qiskit.primitives.BackendSampler` or :class:`~qiskit.primitives.BackendEstimator`. If a ``bound_pass_manager`` is defined, the ``skip_transpilation=True`` option will **not** skip this bound pass.
ta: தனிப்பயன் **கட்டுப்பட்ட** டிரான்ஸ்பைலர் பாஸ் மேலாளரை தற்போது ஏற்கும் ஒரே முதற்பொருள்கள் :class:`~qiskit.primitives.BackendSampler` அல்லது :class:`~qiskit.primitives.BackendEstimator`. ``bound_pass_manager`` வரையறுக்கப்பட்டால், ``skip_transpilation=True`` விருப்பம் **இல்லை** இந்த பிணைப்பு பாஸைத் தவிர்க்கும்.

source: Care is needed when setting ``skip_transpilation=True`` with the ``Estimator`` primitive. Since operator and circuit size need to match for the Estimator, should the custom transpilation change the circuit size, then the operator must be adapted before sending it to the Estimator, as there is no currently no mechanism to identify the active qubits it should consider.
ta: ``Estimator`` primitive உடன் ``skip_transpilation=True`` ஐ அமைக்கும்போது கவனம் தேவை. ஆபரேட்டர் மற்றும் சர்க்யூட் அளவு ஆகியவை மதிப்பீட்டாளருடன் பொருந்த வேண்டும் என்பதால், தனிப்பயன் டிரான்ஸ்பிலேஷன் சர்க்யூட் அளவை மாற்றினால், ஆபரேட்டரை மதிப்பீட்டாளருக்கு அனுப்பும் முன் மாற்றியமைக்க வேண்டும், ஏனெனில் அது கருத்தில் கொள்ள வேண்டிய செயலில் உள்ள குவிட்களை அடையாளம் காண தற்போது எந்த வழிமுறையும் இல்லை.

source: Note that the primitives **do** handle parameter bindings, meaning that even if a ``bound_pass_manager`` is defined in a :class:`~qiskit.primitives.BackendSampler` or :class:`~qiskit.primitives.BackendEstimator`, you do not have to manually assign parameters as expected in the Quantum Instance workflow.
ta: ப்ரிமிட்டிவ்கள் **do** அளவுரு பிணைப்புகளைக் கையாளுகின்றன என்பதை நினைவில் கொள்ளவும், அதாவது ``bound_pass_manager`` ஒரு :class:`~qiskit.primitives.BackendSampler` அல்லது :class:`~qiskit.primitives.BackendEstimator` இல் வரையறுக்கப்பட்டிருந்தாலும் , Quantum Instance பணிப்பாய்வுகளில் எதிர்பார்க்கப்படும் அளவுருக்களை நீங்கள் கைமுறையாக ஒதுக்க வேண்டியதில்லை.

source: The use-case that motivated the addition of the two-stage transpilation to the ``QuantumInstance`` was to allow running pulse-efficient transpilation passes with the :class:`~qiskit.opflow.CircuitSampler` class. The following example shows to migrate this particular use-case, where the ``QuantumInstance.execute()`` method is called under the hood by the :class:`~qiskit.opflow.CircuitSampler`.
ta: ``QuantumInstance`` க்கு இரண்டு-நிலை டிரான்ஸ்பிலேஷனைச் சேர்ப்பதற்கு ஊக்கமளித்த யூஸ்-கேஸ் :class:`~qiskit.opflow.CircuitSampler` வகுப்புடன் இயங்கும் துடிப்பு-திறமையான டிரான்ஸ்பிலேஷன் பாஸ்களை அனுமதிப்பதாகும். பின்வரும் உதாரணம் இந்த குறிப்பிட்ட பயன்பாட்டு வழக்கை நகர்த்துவதைக் காட்டுகிறது, அங்கு ``QuantumInstance.execute()`` முறையானது :class:`~qiskit.opflow.CircuitSampler` மூலம் பேட்டைக்கு கீழ் அழைக்கப்படுகிறது.

source: Let's see how the workflow changes with the Backend Sampler:
ta: பின்புல மாதிரியுடன் பணிப்பாய்வு எவ்வாறு மாறுகிறது என்பதைப் பார்ப்போம்:
