Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/getting_started.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, hi_in, it_it, ja_jp, ko_kr, ml_in, pt_un, ru_ru, ta_in, tr_tr, vi_vn, zh_tw

source: Getting started
bn_bn: শুরুর নির্দেশনা
de_de: Erste Schritte
el_gr: Ξεκινώντας
es_un: Primeros pasos
fr_fr: Mise en route
hi_in: प्रारंभ करें
it_it: Come iniziare
ja_jp: はじめに
ko_kr: 시작하기
ml_in: ആമുഖം
pt_un: Primeiros passos
ru_ru: Начало работы
ta_in: தொடங்குதல்
tr_tr: Başlarken
vi_vn: Bắt đầu

source: Installation
bn_bn: স্থাপন (ইনস্টলেশন)
el_gr: Εγκατάσταση
es_un: Instalación
hi_in: संस्थापन
it_it: Installazione
ja_jp: インストール
ko_kr: 설치
ml_in: ഇൻസ്റ്റാളേഷൻ
pt_un: Instalação
ru_ru: Инструкция по установке
ta_in: நிறுவல்
tr_tr: Kurulum
vi_vn: Cài đặt

source: Qiskit Machine Learning depends on the main Qiskit package which has its own `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ detailing the installation options for Qiskit and its supported environments/platforms. You should refer to that first. Then the information here can be followed which focuses on the additional installation specific to Qiskit Machine Learning.
bn_bn: Qiskit মেশিন লার্নিং মূল Qiskit প্যাকেজের উপর নির্ভর করে যার নিজস্ব `Qiskit শুরু করা <https://qiskit.org/docamentation/getting_start.html> `__ Qiskit এবং এর সমর্থিত পরিবেশ / প্ল্যাটফর্মগুলির জন্য ইনস্টলেশন বিকল্পগুলি বিশদ বর্ণনা করে। আপনার প্রথমে উল্লেখ করা উচিত। তারপরে এখানকার তথ্য অনুসরণ করা যেতে পারে যা কিসকিট মেশিন লার্নিং এর সাথে সম্পর্কিত অতিরিক্ত ইনস্টলেশনকে কেন্দ্র করে।
de_de: Qiskit Machine Learning hängt vom Qiskit-Hauptpaket ab, das einen eigenen Abschnitt ` Qiskit-Erste Schritte <https://qiskit.org/documentation/getting_started.html>` __ hat, der die Installationsoptionen für Qiskit und die unterstützten Umgebungen/Plattformen beschreibt. Dieses sollten Sie zuerst lesen. Dann können die Informationen hier nachgelesen werden, die sich auf die zusätzliche Installation speziell für Qiskit Machine Learning beziehen.
el_gr: Η Μηχανική Εκμάθηση Qiskit εξαρτάται από το κύριο πακέτο Qiskit που έχει το δικό του «Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>«__ που περιγράφει λεπτομερώς τις επιλογές εγκατάστασης για το Qiskit και τα υποστηριζόμενα περιβάλλοντα/πλατφόρμες. Στη συνέχεια, οι πληροφορίες εδώ μπορεί να ακολουθηθεί η οποία επικεντρώνεται στην πρόσθετη εγκατάσταση ειδικά για την Qiskit μάθηση μηχανής.
es_un: Qiskit Machine Learning depende del paquete principal de Qiskit, que tiene su propio `Qiskit Primeros Pasos <https://qiskit.org/documentation/getting_started.html>`__ que detalla las opciones de instalación de Qiskit y sus entornos/plataformas compatibles. Deberías referirte a eso primero. Luego, se puede seguir la información que está aquí, la cual se centra en la instalación adicional específica de Qiskit Machine Learning.
fr_fr: Qiskit Machine Learning dépend du package Qiskit principal qui a son propre " Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>` __ détaillant les options d'installation de Qiskit et de ses environnements et plateformes pris en charge. Vous devriez d'abord vous référer à cela. Ensuite, les informations ci-dessous peuvent être suivies qui concernent l'installation supplémentaire spécifique à Qiskit Machine Learning.
hi_in: Qiskit मशीन लर्निंग मुख्य Qiskit संकुलों पर निर्भर करती है जिसका अपना `Qiskit Get Started <https://qiskit.org/documentation/getting_started.html>`__ प्रारंभिक प्रलेखन समर्थित वातावरण/प्लेटफ़ॉर्म की स्थापना के लिए विकल्पों का विवरण करता है। आपको पहले इसका उल्लेख करना चाहिए। फिर यहां दी गई जानकारी का अनुसरण किया जा सकता है जो किस्किट मशीन लर्निंग के लिए विशिष्ट अतिरिक्त अधिष्ठापनों पर केंद्रित है।
it_it: Qiskit Machine Learning si basa sul modulo principale di Qiskit, il quale ha una specifica guida `Qiskit come iniziare <https://qiskit.org/documentation/getting_started.html>`__ che descrive in dettaglio le opzioni di installazione per Qiskit e gli ambienti/piattaforme che supporta. Dovresti fare riferimento prima a questa guida. Poi è possibile seguire le informazioni qui fornite, le quali specificano dettagli addizionali sull'installazione di Qiskit Machine Learning.
ja_jp: Qiskit 機械学習は、 Qiskit のインストール・オプションとそのサポート環境/プラットフォームを詳述した「`Qiskit はじめに <https://qiskit.org/documentation/getting_started.html>`__ 」にて説明された主要 Qiskit パッケージに依存しています。 まずそれを参照してください。次に、ここで説明する情報に従って、Qiskit 機械学習に固有の追加インストールをしましょう。
ko_kr: Qiskit Machine Learning은 Qiskit및 지원되는 환경/플랫폼의 설치 옵션을 자세히 설명하는 `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ 를 가지고 있는 기본 Qiskit 패키지에 의존한다. 먼저 그것을 참고해야 한다. 그 후 Qiskit Machine Learning의 추가 설치에 초점을 맞추는 이 내용을 따라라.
ml_in: ക്വിസ്കിറ്റ് മെഷീൻ ലേണിംഗ് പ്രധാന ക്വിസ്കിറ്റ് പാക്കേജിനെ ആശ്രയിച്ചിരിക്കുന്നു, അത് സ്വന്തമായി `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ ക്വിസ്കിറ്റിനായുള്ള ഇൻസ്റ്റലേഷൻ ഓപ്ഷനുകളും അതിനെ പിന്തുണയ്ക്കുന്ന പരിതസ്ഥിതികളും / പ്ലാറ്റ്ഫോമുകളും വിശദമാക്കുന്നു. നിങ്ങൾ ആദ്യം അത് റഫർ ചെയ്യണം. ക്വിസ്കിറ്റ് മെഷീൻ ലേണിംഗിനായി നിർദ്ദിഷ്ട അധിക ഇൻസ്റ്റാളേഷനിൽ ശ്രദ്ധ കേന്ദ്രീകരിക്കുന്ന വിവരങ്ങൾ ഇവിടെ പിന്തുടരാം.
pt_un: O Qiskit Machine Learning depende do pacote Qiskit principal que tem seu próprio `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ detalhando as opções de instalação para Qiskit e seus ambientes / plataformas suportados. Você deve se referir a isso primeiro. Em seguida, as informações aqui podem ser seguidas que se concentram na instalação adicional específica para Qiskit Machine Learning.
ru_ru: Пакет Qiskit Machine Learning зависит от основного пакета Qiskit, который имеет свою собственную страницу ` Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>` __ с подробным описанием опций установки Qiskit и поддерживаемых сред/платформ. Обратите на это внимание в первую очередь. Далее здесь можно найти информацию, которая сфокусируется на установке, специфичной для компонента Qiskit Machine Learning.
ta_in: Qiskit பொறி கற்றல் அதன் சொந்த `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ qiskit மற்றும் அதன் ஆதரவு சுற்றுச்சூழல்கள் / தளங்களுக்கான நிறுவல் விருப்பங்களை விவரிக்கும் முக்கிய qiskit தொகுப்பைப் பொறுத்தது. நீங்கள் அதை முதலில் குறிப்பிட வேண்டும். Qiskit இயந்திர கற்றலுக்கான குறிப்பிட்ட கூடுதல் நிறுவலை மையமாகக் கொண்ட தகவல்களை இங்கே பின்பற்றலாம்.
tr_tr: Qiskit Machine Learning, Qiskit ve desteklenen ortamları/platformları için kurulum seçeneklerini ayrıntılandıran kendi `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ olan ana Qiskit paketine bağlıdır. Önce buna bakmalısınız. Ardından, Qiskit Machine Learning'e özgü ek kuruluma odaklanan buradaki bilgiler takip edilebilir.
vi_vn: Qiskit Machine Learning phụ thuộc vào gói Qiskit chính sở hữu ' Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>` __ riêng, trình bày các lựa chọn cài đặt cho Qiskit và các môi trường/nền tảng được hỗ trợ của nó. Bạn nên tham khảo mục đó trước. Tiếp đó, các thông tin tập trung vào những cài đặt bổ sung cụ thể cho Qiskit Machine Learning có thể được xem thêm tại đây.
zh_tw: Qiskit 機器學習取決於主要 Qiskit 套件，它有自己的 "Qiskit 入門 <https://qiskit.org/documentation/getting_started.html>`__ 詳述了 Qiskit 的安裝選項及其支援的環境/平臺。 你應該先提到這一點。 然後，按照此處提供的訊息於 Qiskit 機器學習額外的特定安裝。

source: Qiskit Machine Learning has some functions that have been made optional where the dependent code and/or support program(s) are not (or cannot be) installed by default. Those are PyTorch and Sparse. See :ref:`optional_installs` for more information.
bn_bn: Qiskit মেশিন লার্নিংয়ের কিছু ফাংশন রয়েছে যা ঐচ্ছিকভাবে তৈরি করা হয়েছে যেখানে নির্ভরযোগ্য কোড এবং / বা সমর্থন প্রোগ্রাম (গুলি) ডিফল্টরূপে ইনস্টল করা হয় না (বা করা যায় না)। এগুলি হল পাইটর্চ (PyTorch) এবং স্পারস (Sparse)। আরও তথ্যের জন্য দেখুন: রেফ: `optional_installs`।
de_de: Qiskit Machine Learning hat einige Funktionen, die optional gemacht wurden, für den Fall dass der abhängige Code und/oder die Unterstützungsprogramme nicht standardmäßig installiert sind (oder nicht installiert werden können). Dabei handelt es sich um PyTorch und Sparse. Siehe auch :ref:`optional_installs` für weitere Informationen.
el_gr: Η Μηχανική Εκμάθηση Qiskit έχει κάποιες λειτουργίες που έχουν γίνει προαιρετικές όπου ο εξαρτώμενος κώδικας ή/και το πρόγραμμα(τα) υποστήριξης δεν είναι (ή δεν μπορεί να είναι) εγκατεστημένο από προεπιλογή. Αυτά είναι τα PyTorch και Sparse. Δείτε το :ref:`optional_installs` για περισσότερες πληροφορίες.
es_un: Qiskit Machine Learning tiene algunas funciones que se han hecho opcionales cuando el código dependiente y/o los programa(s) de soporte no están (o no pueden ser) instalados de forma predeterminada. Esos son PyTorch y Sparse. Consulta :ref:`optional_installs` para más información.
fr_fr: Qiskit Machine Learning a certaines fonctions qui ont été rendues optionnelles lorsque le code dépendant et/ou le(s) programme(s) de support(s) ne sont pas (ou ne peuvent pas être) installé(s) par défaut. Il s'agit de PyTorch et Sparse. Pour plus d'informations, voir :ref:`optional_installs`.
hi_in: Qiskit Machine Learning में कुछ ऐसे फलन हैं जिन्हें वैकल्पिक बना दिया गया है जहाँ आश्रित कोड और/अथवा समर्थन क्रमादेश वितथ रूप से स्थापित नहीं हैं (या नहीं किए जा सकते)। वे हैं PyTorch और Sparse। अधिक जानकारी के लिए :ref:`optional_installs`देखें।
it_it: Qiskit Machine Learning ha delle funzionalità che sono state rese opzionali nel caso in cui il codice in oggetto e/o i programmi supportati non siano (o non possano essere) installati di default. Questi sono PyTorch e Sparse. Per maggiori informazioni consulta :ref:`optional_installs`.
ja_jp: Qiskit 機械学習には、デフォルトで依存コードまたはサポート・プログラム ( あるいはその両方 ) がインストールされていない (または、それらを使用できない ) ような、オプション機能がいくつかあります。PyTorch および Sparse が該当します。詳細については、 :ref:`optional_installs` を参照してください。
ko_kr: Qiskit Machine Learning에는 종속 코드 및/또는 지원 프로그램이 기본적으로 설치되어 있지 않은 (또는 설치될 수 없는) 일부 선택적인 기능들이 있다. 이에는 PyTorch와 Sparse가 있다. 자세한 내용은 :ref:`optional_installs` 를 참조하여라.
ml_in: ആശ്രിത കോഡും കൂടാതെ / അല്ലെങ്കിൽ പിന്തുണാ പ്രോഗ്രാമുകളും സ്ഥിരസ്ഥിതിയായി ഇൻസ്റ്റാൾ ചെയ്യാത്ത (അല്ലെങ്കിൽ ഇൻസ്റ്റാൾ ചെയ്യാൻ കഴിയാത്ത) ഓപ്‌ഷണലായി മാറ്റിയ ചില പ്രവർത്തനങ്ങൾ ക്വിസ്‌കിറ്റ് മെഷീൻ ലേണിംഗിലുണ്ട്. പൈറ്റോർച്ച്(PyTorch), സ്പാർസ്(Sparse) എന്നിവയാണ് അവ. കൂടുതൽ വിവരങ്ങൾക്ക് :ref:`optional_installs` കാണുക.
pt_un: O Qiskit Machine Learning tem algumas funções que se tornaram opcionais onde o código dependente e/ou programa(s) de suporte não são (ou não podem ser) instalados por padrão. Esses são PyTorch e Sparse. Veja :ref:`optional_installs` para mais informações.
ru_ru: В Qiskit Machine Learning есть некоторые функции, которые были сделаны необязательными, если зависимые программы и/или программы поддержки не установлены (или не могут быть установлены) по умолчанию. Это PyTorch и Sparse. Дополнительная информация приведена в разделе :ref:` optional_installs `.
ta_in: Qiskit பொறி கற்றல் சில செயல்பாடுகளைக் கொண்டுள்ளது, அவை சார்பு குறியீடு மற்றும் / அல்லது ஆதரவு நிரல் (கள்) இயல்பாக நிறுவப்படவில்லை (அல்லது இருக்க முடியாது). அவை பைடார்ச் மற்றும் ஸ்பார்ஸ். மேலும் தகவலுக்கு :ref:`optional_installs` ஐப் பார்க்கவும்.
tr_tr: Qiskit Makine Öğrenmesi, bağımlı kod ve/veya destek program(lar)ın "varsayılan" olarak kurulmadığı (ya da kurulamadığı) opsiyonel birtakım fonksiyonlara sahiptir. Bunlar PyTorch ve Sparse'tir. Daha fazla bilgi için :ref:`optional_installs` 'a bakabilirsiniz.
vi_vn: Qiskit Machine Learning có một số chức năng đã được điều chỉnh thành tùy chọn để các code phụ thuộc và/hoặc (các) chương trình hỗ trợ không (hoặc không thể) được cài đặt theo mặc định. Các chức năng đó là PyTorch và Sparse. Xem :ref:`optional_installs` để biết thêm thông tin.
zh_tw: Qiskit 機器學習具有一些可選功能，例如在預設情況下沒有安裝（或不可用）依賴程式碼和/或支持程序。這包括 PyTorch 和 Sparse。請參閱：:ref:`optional_installs` 了解更多信息。

source: Start locally
bn_bn: স্থানীয়ভাবে শুরু করা
de_de: Lokal starten
el_gr: Εκκίνηση τοπικά
es_un: Comenzar localmente
fr_fr: Démarrer localement
hi_in: स्थानीय आरंभ करें
it_it: Come iniziare in locale
ja_jp: ローカルで始める
ko_kr: 로컬로 시작
ml_in: ലോക്കലായി ആരംഭിക്കുക
pt_un: Iniciar localmente
ru_ru: Запустить локально
ta_in: உள்ளூரில் தொடங்கவும்
tr_tr: Yerel Olarak Başlatma
vi_vn: Bắt đầu cục bộ
zh_tw: 在本端啟動

source: The simplest way to get started is to follow the getting started 'Start locally' for Qiskit here `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
bn_bn: সহজ করে শুরু করার উপায় হ'ল 'Start locally' থেকে শুরু করুন , `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
el_gr: Ο απλούστερος τρόπος για να ξεκινήσετε είναι να ακολουθήσετε το 'Ξεκινήστε τοπικά' για Qiskit εδώ ` Qiskit Ξεκινώντας <https://qiskit.org/documentation/getting_started.html>` __ _
es_un: La forma más sencilla de empezar es seguir el 'Comenzar localmente' de los primeros pasos para Qiskit que se encuentra aquí `Qiskit Primeros Pasos <https://qiskit.org/documentation/getting_started.html>`__
fr_fr: La façon la plus simple de commencer est de suivre l'initiation 'Démarrer localement' pour Qiskit ici `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>` __
hi_in: सरल आरंभ करने के लिए यहाँ पर Qiskit के लिए 'स्थानीय आरंभ करें' `Qiskit Get Started <https://qiskit.org/documentation/getting_started.html>`__।
it_it: Il modo più semplice per iniziare è seguire la guida `Qiskit come iniziare <https://qiskit.org/documentation/getting_started.html>`__, in particolare le istruzioni che si trovano in 'Come iniziare in locale'
ja_jp: 最も簡単な方法は「 `Qiskit はじめに <https://qiskit.org/documentation/getting_started.html>`__ 」の「ローカルで始める」を参照して開始することです。
ml_in: ക്വിസ്‌കിറ്റിൽ ആരംഭിക്കുന്നതിനുള്ള ഏറ്റവും ലളിതമായ മാർ‌ഗ്ഗം ക്വിസ്‌കിറ്റ് ആരംഭിക്കുന്നതിനുള്ള `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ പിന്തുടരുക എന്നതാണ്
ru_ru: Самый простой способ - начать с раздела 'Запуск локально' для Qiskit здесь `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
ta_in: தொடங்குவதற்கான எளிய வழி இங்கே கிஸ்கிட்டிற்கான 'Start locally' என்பதைப் பின்பற்றுவதே `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`_
tr_tr: Başlamanın en kolay yolu, Qiskit için 'Yerel Olarak Başlatma' bölümünü buradan takip ederek başlamaktır: `Qiskit Başlarken <https://qiskit.org/documentation/getting_started.html>`__
vi_vn: Cách dễ nhất để bắt đầu là làm theo hướng dẫn mở đầu của "Bắt đầu cục bộ" dành cho Qiskit tại `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__

source: In your virtual environment where you installed Qiskit simply add ``machine-learning`` to the extra list in a similar manner to how the extra ``visualization`` support is installed for Qiskit, i.e:
bn_bn: আপনার ভার্চুয়াল পরিবেশে যেখানে আপনি কিস্কিট (Qiskit) ইনস্টল করেছেন, কিস্কিটের জন্য কীভাবে অতিরিক্ত ``visualization`` সমর্থনটি ইনস্টল করা হয়েছে তার সাথে একইভাবে অতিরিক্ত তালিকায় ``machine-learning`` যুক্ত করুন:
de_de: In Ihrer virtuellen Umgebung, in der Sie Qiskit installiert haben, fügen Sie einfach ` ` machine-learning ` ` zur Extra-Liste hinzu, ähnlich wie die extra Unterstützung von ` ` Visualisierung ` ` für Qiskit installiert wird, also:
el_gr: Στο εικονικό περιβάλλον σας, όπου εγκαταστήσατε το Qiskit απλά προσθέστε το ``machine-learning`` στην επιπλέον λίστα με παρόμοιο τρόπο όπως εγκαθίσταται η επιπλέον υποστήριξη ``visualization`` για το Qiskit, δηλαδή:
es_un: En tu entorno virtual donde instalaste Qiskit, simplemente agrega ``machine-learning`` a la lista adicional de manera similar a cómo se instala el soporte adicional de ``visualization`` para Qiskit, es decir:
fr_fr: Dans l'environnement virtuel où vous avez installé Qiskit, ajoutez simplement ``machine-learning`` à la liste supplémentaire de manière similaire à la façon dont le support de ``visualisation`` supplémentaire est installé pour Qiskit, c'est-à-dire:
hi_in: जिस आभासी वातावरण में आपने Qiskit स्थापित किया है, उसकी अतिरिक्त सूची में ``machine-learning`` को उसी तरह से जोड़ें जिस प्रकार Qiskit के लिए अतिरिक्त ``visualization`` समर्थन की स्थापना की जाती है, अर्थात :
it_it: Nel tuo ambiente virtuale dove hai installato Qiskit, nello stesso modo in cui il supporto extra di ``visualization`` è stato installato per Qiskit, basta aggiungere semplicemente ``machine-learning`` alla lista extra, ad esempio:
ja_jp: Qiskit をインストールした仮想環境で、 Qiskit に追加の ``visualization`` サポートをインストールした方法と同様の方法で以下のようにして追加リストに ``machine-learning`` を追加してください:
ko_kr: Qiskit을 설치한 가상 환경에서 추가적인 ``visualization`` 지원을 설치한 방법과 마찬가지로 ``machine-learning`` 을 단순히 extra 리스트에 추가한다.
ml_in: നിങ്ങളുടെ വിർ‌ച്വൽ‌ എൻ‌വയോൺ‌മെൻറിൽ‌(virtual environment), ക്വിസ്‌കിറ്റിനായി `` വിഷ്വലൈസേഷൻ`` പിന്തുണ എങ്ങനെ ഇൻസ്റ്റാൾ ചെയ്തുവോ അതിന് സമാനമായ രീതിയിൽ അധിക പട്ടികയിലേക്ക് `` മെഷീൻ ലേണിംഗ്`` ചേർക്കുക, അതായത്:
pt_un: Em seu ambiente virtual onde você instalou o Qiskit, simplesmente adicione ``machine-learning`` à lista extra de maneira semelhante a como o suporte extra ``visualization`` é instalado para Qiskit, ou seja:
ru_ru: В Вашей виртуальной среде, где Вы установили Qiskit, просто добавьте ``machine-learning`` в список дополнительных пакетов подобно тому как устанавливается дополнительная поддержка ``visualization`` в Qiskit, например:
ta_in: நீங்கள் qiskit-ட்டை நிறுவிய உங்கள் மெய்நிகர் சூழலில், qiskit-டிற்கு கூடுதல் ``visualization`` ஆதரவு எவ்வாறு நிறுவப்பட்டுள்ளது என்பதற்கு ஒத்த முறையில் கூடுதல் பட்டியலில் ``machine-learning`` ஐச் சேர்க்கவும், அதாவது:
tr_tr: Qiskit'i kurduğunuz sanal ortamınızda, Qiskit için ekstra "görselleştirme" desteğinin nasıl kurulduğuna benzer şekilde, "makine öğrenimi"ni ekstra listeye eklemeniz yeterlidir, yani:
vi_vn: Trong môi trường ảo mà bạn đã cài đặt Qiskit, chỉ cần thêm ``machine-learning`` vào danh sách bổ sung tương tự như cách cài đặt hỗ trợ bổ sung ``visualization`` cho Qiskit, nghĩa là:
zh_tw: 在安裝了 Qiskit 的虛擬環境中，將“機器學習”添加到添加列表中，如下所示，類似於您在 Qiskit 中安裝額外的“可視化”支援的方式,i.e：

source: It is worth pointing out that if you're a zsh user (which is the default shell on newer versions of macOS), you'll need to put ``qiskit[machine-learning]`` in quotes:
bn_bn: মনে করিয়ে দেয়া প্রয়োজন, আপনি যদি zsh (ম্যাকওএস এর নতুনতর সংস্করণগুলোতে এটি পূর্বনির্ধারিত (ডিফল্ট) শেল) ব্যবহারকারী হয়ে থাকেন তাহলে আপনাকে উদ্ধৃতির মধ্যে ``qiskit[machine-learning]`` লিখতে হবে:
de_de: Als ein Benutzer von zsh (was die Standard-Shell der neueren Versionen von macOS ist) muss man ``qiskit[machine-learning]`` in Anführungszeichen setzen:
el_gr: Αξίζει να σημειωθεί ότι αν είστε ένας χρήστης zsh (που είναι το προεπιλεγμένο κέλυφος σε νεότερες εκδόσεις του MacOS), θα πρέπει να βάλετε ` ` qiskit[machine-learning]` ` σε εισαγωγικά:
es_un: Vale la pena señalar que si eres usuario de zsh (que es el shell predeterminado en las versiones más recientes de macOS), deberás poner ``qiskit[machine-learning]`` entre comillas:
fr_fr: Il est utile de préciser que si vous êtes un utilisateur de zsh (qui est le shell par défaut dans les nouvelles versions de macOS) que vous devrez mettre ``qiskit[machine-learning]`` entre guillemets :
hi_in: यह इंगित करने योग्य है कि यदि आप एक zsh उपयोगकर्ता हैं (जो कि macOS के नए संस्करणों पर डिफ़ॉल्ट शेल है), तो आपको उद्धरणों में ``qiskit[machine-learning]`` डालना होगा :
it_it: Vale la pena precisare che se si utilizza zsh (la shell di default nelle nuove versioni di macOS) bisognerà inserire ``qiskit[machine-learning]`` tra virgolette:
ja_jp: zsh ユーザー（新しいバージョンのmacOSのデフォルト・シェル）の場合は、 ``qiskit[machine-learning]`` を引用符で囲む必要があります。
ko_kr: Zsh 사용자 (최신 버전의 macOS 기본 쉘) 인 경우 ``qiskit[machine-learning]`` 을 큰 따옴표로 묶어야 한다:
ml_in: നിങ്ങൾ ഒരു zsh ഉപയോക്താവാണെങ്കിൽ (ഇത് macOS ൻ്റെ ഏറ്റവും പുതിയ പതിപ്പുകളിലെ സ്ഥിരസ്ഥിതി ഷെൽ ആണ്), നിങ്ങൾ ഉദ്ധരണികളിൽ(quotes) ``qiskit[machine-learning]`` എന്ന് നൽകേണ്ടതുണ്ട്:
pt_un: Vale a pena ressaltar que se você é um usuário zsh (que é o shell padrão em versões mais recentes do macOS), você vai precisar colocar ``qiskit[machine-learning]`` entre aspas:
ru_ru: Стоит отметить, что если Вы используете zsh (оболочка по умолчанию для более новых версий macOS), то Вам нужно поставить ``qiskit[machine-learning]`` в кавычки:
ta_in: நீங்கள் ஒரு zsh பயனராக இருந்தால் (இது macOSஸின் புதிய பதிப்புகளில் இயல்புநிலை ஷெல்) என்பதை சுட்டிக்காட்ட வேண்டியது அவசியம், நீங்கள் மேற்கோள்களில் ``qiskit[machine-learning]`` வைக்க வேண்டும்:
tr_tr: Bir zsh kullanıcısıysanız (macOS'un daha yeni sürümlerinde varsayılan kabuktur), tırnak içine ``qiskit[machine-learning]`` koymanız gerekeceğini belirtmekte fayda var:
vi_vn: Một điều đáng lưu ý là nếu bạn là một người sử dụng zsh (shell mặc định trên các phiên bản mới hơn của macOS), bạn sẽ cần phải đặt ``qiskit[machine-learning]`` vào trong dấu nháy đơn:
zh_tw: 值得指出的是，如果您是 zsh 使用者（在較新版本的 macOS 上是預設 Shell ），則需要將 ``qiskit[machine-learning]`` 放置在引號中：

source: Install from source
bn_bn: উৎস থেকে স্থাপন (Install)
de_de: Installieren aus dem Quelltext
el_gr: Εγκατάσταση από την πηγή
es_un: Instalar desde el código fuente
fr_fr: Installation à partir du code source
hi_in: स्रोत से संस्थापन
it_it: Installazione da codice sorgente
ja_jp: ソースからインストールする
ko_kr: 소스로부터 설치하기
ml_in: സോഴ്സിൽ നിന്ന് ഇൻസ്റ്റാൾ ചെയ്യുക
pt_un: Instalando da Fonte
ru_ru: Установить из исходного кода
ta_in: Source இலிருந்து நிறுவவும்
tr_tr: Kaynaktan Kurulum
vi_vn: Cài đặt từ nguồn
zh_tw: 從來源安裝
