Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/getting_started.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, hi_in, it_it, ja_jp, ko_kr, ml_in, pt_un, ru_ru, ta_in, tr_tr, vi_vn, zh_tw

source: **Sparse**, may be installed using command `pip install 'qiskit-machine-learning[sparse]'` to install the package. Sparse being installed will enable the usage of sparse arrays/tensors.
bn_bn: `pip install 'qiskit-machine-learning[sparse]'` কমান্ড ব্যবহার করে **Sparse** স্থাপন করা যেতে পারে| Sparse স্থাপন করলে sparse arrays/tensors ব্যবহার করা সম্ভব হবে|
el_gr: **Sparse**, μπορεί να εγκατασταθεί χρησιμοποιώντας την εντολή `pip install 'qiskit-machine-learning[sparse]'` για να εγκαταστήσετε το πακέτο. Το Sparse που εγκαθίσταται θα ενεργοποιήσει τη χρήση αραιών πινάκων/tensors.
hi_in: **Sparse**, संकुल को स्थापित करने के लिए `pip install 'qiskit-machine-learning[sparse]'` कमांड का उपयोग करके स्थापना की जा सकती है। Sparse स्थापित होने पर विरल सरणियों/प्रदिशों(टेंसर) के उपयोग को सक्षम करेगा।
it_it: **Sparse**, può essere installato utilizzando il comando `pip install 'qiskit - machine - learning[sparse]'` per installare il pacchetto. L'installazione di Sparse permetterà l'utilizzo di array/tensori sparsi.
ja_jp: **Sparse** は、コマンド `pip install 'qiskit-machine-learning[sparse]'` を使用してパッケージをインストールすることによってインストールできます。 インストールされた Sparse 使用すると、疎な配列/テンソルの使用が可能になります。
ml_in: ** Sparse **, പാക്കേജ് ഇൻസ്റ്റാൾ ചെയ്യുന്നതിന് pip install 'qiskit-machine-learning[sparse]'` കമാൻഡ് ഉപയോഗിച്ച് ഇൻസ്റ്റാൾ ചെയ്യാം. Sparse ഇൻസ്റ്റാൾ ചെയ്യുന്നത് Sparse അറേകളുടെ(array) / ടെൻസറുകളുടെ ഉപയോഗം പ്രാപ്തമാക്കും.
ta_in: **Sparse**, பேக்கேஜை நிறுவ `pip install 'qiskit-machine-learning[sparse]'` கட்டளையைப் பயன்படுத்தி நிறுவப்படலாம். சிதறல் நிறுவப்படுவது சிதறல் வரிசைகள் / டென்சார்களைப் பயன்படுத்த உதவும்.
tr_tr: **Sparse**, paketini kurmak için `pip install 'qiskit-machine-learning[sparse]'` komutu kullanılarak kurulabilir. Yüklenmekte olan Sparse paketi, dizilerin/tensörlerin kullanımını mümkün kılacaktır.
vi_vn: ** Sparse**, có thể được cài đặt bằng lệnh `pip install 'qiskit-machine-learning[sparse]'` để cài đặt gói. Sparse khi được cài đặt sẽ cho phép sử dụng các dãy/ten-xơ thưa thớt.

source: Ready to get going?...
bn_bn: আরো এগোতে প্রস্তুত ?...
de_de: Auf geht's...
el_gr: Έτοιμοι για να προχωρήσετε;...
es_un: ¿Listo para empezar?...
fr_fr: Prêt à y aller ?...
hi_in: आगे बढ़ने के लिए तैयार?...
it_it: Pronto per andare avanti?...
ja_jp: 準備はいいですか？...
ko_kr: 시작할 준비가 다 되었다면...
ml_in: തുടങ്ങാൻ തയ്യാറാണോ?...
pt_un: Pronto para começar?...
ru_ru: Готовы идти дальше?...
ta_in: செல்ல தயாரா?...
tr_tr: Başlamaya hazır mısınız?...
vi_vn: Bạn đã sẵn sàng khởi hành?...
zh_tw: 準備好開始了嗎？

source: **PyTorch**, may be installed either using command ``pip install 'qiskit-machine-learning[torch]'`` to install the package or refer to PyTorch `getting started <https://pytorch.org/get-started/locally/>`__. When PyTorch is installed, the `TorchConnector` facilitates its use of quantum computed networks.
es_un: **PyTorch**, se puede instalar usando el comando ``pip install 'qiskit-machine-learning[torch]'`` para instalar el paquete o consulta el `getting started <https://pytorch.org/get-started/locally/>`__ de PyTorch. Cuando se instala PyTorch, el `TorchConnector` facilita el uso de redes calculadas cuánticamente.
fr_fr: **PyTorch**, peut être installé soit en utilisant la commande ``pip install 'qiskit-machine-learning[torch]'`` pour installer le package, soit en se référant à PyTorch `getting started<https://pytorch.org/get-started/locally/>`__. Lorsque PyTorch est installé, le `TorchConnector` facilite l'utilisation des réseaux quantiques.

source: **Sparse**, may be installed using command ``pip install 'qiskit-machine-learning[sparse]'`` to install the package. Sparse being installed will enable the usage of sparse arrays/tensors.
es_un: **Sparse**, se puede instalar usando el comando ``pip install 'qiskit-machine-learning[sparse]'`` para instalar el paquete. La instalación de sparse permitirá el uso de arreglos/tensores dispersos.
fr_fr: ** Sparse**, peut être installé à l'aide de la commande ``pip install'qiskit-machine-learning[sparse]'``. L'installation de Sparse va permettre l'utilisation de tableaux et /ou tenseurs épars.

source: **PyTorch**, may be installed either using command `pip install 'qiskit-machine-learning[torch]'` to install the package or refer to PyTorch [getting started](https://pytorch.org/get-started/locally/). When PyTorch is installed, the `TorchConnector` facilitates its use of quantum computed networks.
ml_in: ** PyTorch **, പാക്കേജ് ഇൻസ്റ്റാൾ ചെയ്യുന്നതിന് `pip install 'qiskit-machine-learning[torch]'` കമാൻഡ് ഉപയോഗിച്ച് ഇൻസ്റ്റാൾ ചെയ്യാം അല്ലെങ്കിൽ PyTorch [getting started] (https://pytorch.org/get-started/locally/). പൈടോർച്ച് ഇൻസ്റ്റാൾ ചെയ്യുന്നതിനാൽ, ക്വാണ്ടം കമ്പ്യൂട്ട്ഡ് നെറ്റ്‌വർക്കുകളുടെ ഉപയോഗം `TorchConnector` സുഗമമാക്കുന്നു.
