Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/getting_started.po
Languages: bn_bn, de_de, el_gr, es_un, fr_fr, hi_in, it_it, ja_jp, ko_kr, ml_in, pt_un, ru_ru, ta_in, tr_tr, vi_vn, zh_tw

source: Installing Qiskit Machine Learning from source allows you to access the most recently updated version under development instead of using the version in the Python Package Index (PyPI) repository. This will give you the ability to inspect and extend the latest version of the Qiskit Machine Learning code more efficiently.
bn_bn: উৎস থেকে উপাদানগুলি ইনস্টল করলে আপনি Qiskit এর সর্বাধিক আপডেট হওয়া সংস্করণটি ব্যবহার করতে পারবেন Python Package Index (PyPI) রিপোসিটোরি থেকে ইনস্টল করার পরিবর্তে। এটি আপনাকে Qiskit মেশিন লার্নিং কোডের সর্বশেষ সংস্করণটি আরও নিখুঁত ভাবে পরিদর্শন করার এবং প্রসারিত করার দক্ষতা দেবে।.
el_gr: Η εγκατάσταση του Qiskit Machine Learning από την πηγή, σας επιτρέπει να αποκτήσετε πρόσβαση στην πιο πρόσφατα ενημερωμένη υπό ανάπτυξη έκδοση αντί να χρησιμοποιήσετε την έκδοση στο αποθετήριο του Python Package Index (PyPi). Αυτό θα σας δώσει τη δυνατότητα να επιθεωρήσετε και να επεκτείνετε πιο αποτελεσματικά την τελευταία έκδοση του κώδικα μηχανικής μάθησης Qiskit.
es_un: La instalación de Qiskit Machine Learning desde el código fuente te permite acceder a la versión actualizada más recientemente en desarrollo en lugar de usar la versión en el repositorio Python Package Index (PyPI). Esto te dará la capacidad de inspeccionar y extender la última versión del código de Qiskit Machine Learning de manera más eficiente.
fr_fr: Installer des éléments depuis la source vous permet d'utiliser la version la plus à jour de Qiskit, plutôt que d'utiliser la version du dépôt de PyPI (Python Package Index). Ceci vous donnera la possibilité d'inspecter et d'étendre plus efficacement la dernière version du code Qiskit.
hi_in: स्रोत से तत्वों को स्थापित करने से आप Python Package Index (PyPI) रिपॉजिटरी में संस्करण का उपयोग करने के बजाय Qiskit के सबसे अद्यतन संस्करण का उपयोग कर सकते हैं। यह आपको Qiskit कोड के नवीनतम संस्करण का अधिक कुशलता से निरीक्षण और विस्तार करने की क्षमता देगा।
it_it: L'installazione degli elementi di Qiskit Machine Learning direttamente dal sorgente consente di accedere alla versione più recente e ancora in via di sviluppo e invece della versione presente nella repository Python Package Index (PyPI). In questo modo si avrà la possibilità di ispezionare ed estendere in modo più efficiente l'ultima versione del codice di Qiskit Machine Learning.
ja_jp: ソースから Qiskit 機械学習をインストールすることにより、Python Package Index (PyPI) リポジトリのバージョンを使う代わりに、最新の Qiskit バージョンにアクセスすることが出来ます。これにより、Qiskit 機械学習コードの最新版を調査したり、拡張することがより効果的にできるようになります。
ko_kr: Python 패키지 인덱스 (PyPI) 저장소를 이용하여 설치하는 대신 소스 코드로부터 Qiskit 머신러닝을 설치하면 개발중인 가장 최근 업데이트된 버전을 사용할 수 있다. 이를 통해 손쉽게 Qiskit 머신러닝의 최신 코드를 들여다 보고 확장할 수 있다.
ml_in: സോഴ്‌സിൽ നിന്നും ക്വിസ്കിറ്റ് മെഷീൻ ലേണിംഗ് ഇൻസ്റ്റാൾ ചെയ്യുന്നതിനാൽ പൈത്തൺ പാക്കേജ് സൂചിക (Python Package Index [PyPI] ) ശേഖരത്തിൽ നിന്ന് പതിപ്പുകൾ ഉപയോഗിക്കുന്നതിനുപകരം വികസിപ്പിച്ചുകൊണ്ടിരിക്കുന്ന ഏറ്റവും പുതിയ അപ്‌ഡേറ്റ് ചെയ്ത പതിപ്പുകൾ ഉപയോഗിക്കാൻ നിങ്ങൾക്ക് സാധിക്കുന്നു. ക്വിസ്കിറ്റ് മെഷീൻ ലേണിംഗ് കോഡിന്റെ ഏറ്റവും പുതിയ പതിപ്പ് കൂടുതൽ കാര്യക്ഷമമായി പരിശോധിക്കാനും വിപുലീകരിക്കാനുമുള്ള കഴിവ് ഇത് നൽകുന്നു.
pt_un: A instalação do Qiskit Machine Learning da fonte permite que você acesse a versão atualizada mais recentemente em desenvolvimento, em vez de usar a versão no repositório Python Package Index (PyPI). Isso dará a você a capacidade de inspecionar e estender a versão mais recente do código do Qiskit Machine Learning com mais eficiência.
ru_ru: Установка элементов из исходного кода позволит Вам получить доступ к последней обновленной версии Qiskit Machine Learning вместо использования версии из репозитория Python Package Index (PyPI). Это даст Вам возможность более эффективно изучить и внести свой вклад в улучшение последней версии Qiskit Machine Learning кода.
ta_in: Source இலிருந்து Qiskit இயந்திரக் கற்றலை நிறுவுவது Python பேக்கேஜ் அட்டவணை (PyPI) களஞ்சியத்தில் பதிப்பைப் பயன்படுத்துவதற்குப் பதிலாக, சமீபத்தில் புதுப்பிக்கப்பட்ட பதிப்பை வளர்ச்சியின் கீழ் அணுக அனுமதிக்கிறது. இது Qiskit பொறி கற்றல் குறியீட்டின் சமீபத்திய பதிப்பை மிகவும் திறமையாக ஆய்வு செய்து நீட்டிக்கும் திறனை உங்களுக்கு வழங்கும்.
tr_tr: Qiskit Makine Öğrenimin'i kaynaktan yüklemek, Python Paket Dizini (PyPI) deposundaki sürümü kullanmak yerine, geliştirilmekte olan en son güncellenen sürüme erişmenizi sağlar. Bu size Qiskit Makine Öğrenmesi kodunun en son sürümünü daha verimli bir şekilde inceleme ve genişletme imkanı verecektir.
vi_vn: Cài đặt Qiskit Machine Learning từ nguồn cho phép bạn truy cập phiên bản đang phát triển được cập nhật gần nhất thay vì sử dụng phiên bản trong kho lưu trữ Python Package Index (PyPI). Điều này sẽ giúp bạn kiểm tra và mở rộng code của phiên bản Qiskit Machine Learning mới nhất một cách hiệu quả hơn.
zh_tw: 通過從來源安裝 Qiskit 機器學習，您可以訪問最新的 Qiskit 版本，而不是使用 Python Package Index (PyPI) 儲存庫的版本。這將使您能夠更有效地研究和擴展最新版本的 Qiskit 機器學習程式碼。

source: Since Qiskit Machine Learning depends on Qiskit, and its latest changes may require new or changed features of Qiskit, you should first follow Qiskit's `"Install from source"` instructions here `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
bn_bn: যেহেতু কিস্কিট মেশিন লার্নিং কিস্কিটের উপর নির্ভর করে এবং এর সর্বশেষ পরিবর্তনগুলিতে কিস্কিটের নতুন বা পরিবর্তিত বৈশিষ্ট্যগুলির প্রয়োজন হতে পারে, আপনার প্রথমে কিস্কিটের `"Install from source"` `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html> নির্দেশাবলী এখানে অনুসরণ করা উচিত।
de_de: Da Qiskit Machine Learning von Qiskit abhängt und due neuesten Änderungen möglicherweise neue oder geänderte Qiskit-Funktionen erfordern, folgen Sie zuerst den Anweisungen zu Qiskit `"Installieren aus dem Quelltext"` hier `Qiskit Erste Schritte <https://qiskit.org/documentation/getting_started.html>`__
el_gr: Δεδομένου ότι Qiskit Machine Learning εξαρτάται από Qiskit, και οι τελευταίες αλλαγές του μπορεί να απαιτήσουν νέα ή τροποποιημένα χαρακτηριστικά του Qiskit, θα πρέπει πρώτα να ακολουθήσετε τις οδηγίες του Qiskit `"Install from source"` εδώ `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
es_un: Dado que Qiskit Machine Learning depende de Qiskit, y sus últimos cambios pueden requerir características nuevas o modificadas de Qiskit, primero debes seguir las instrucciones de `"Instalar desde el código fuente"` de Qiskit aquí `Qiskit Primeros Pasos <https://qiskit.org/documentation/getting_started.html>`__
fr_fr: Puisque Qiskit Machine Learning dépend de Qiskit, et que ses dernières modifications peuvent nécessiter des fonctionnalités nouvelles ou modifiées de Qiskit, vous devez d'abord suivre l'installation de Qiskit "Installer à partir de la source" qui se trouve à cet endroit : `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>` __
hi_in: क्यूंकि Qiskit Machine Learning Qiskit पर निर्भर करता है, और इसके नवीनतम परिवर्तनों के लिए Qiskit की नई या परिवर्तित सुविधाओं की आवश्यकता हो सकती है, आपको पहले Qiskit के `"स्रोत से संस्थापन" में दिए गए निर्देशों का अनुसरण यहाँ `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ से करना चाहिए।
it_it: Dal momento che Qiskit Machine Learning dipende da Qiskit, e che le sue ultime modifiche possono richiedere funzionalità nuove o modificate di Qiskit, dovresti prima far riferimento alla pagina di Qiskit `Qiskit come iniziare <https://qiskit.org/documentation/getting_started.html>`__ e seguire le istruzioni di `"Installa dal sorgente"`
ja_jp: Qiskit 機械学習は Qiskit に依存しており、最新の変更が Qiskit の新規機能または変更された機能を必要とする場合があるので、まず「 `Qiskit はじめに <https://qiskit.org/documentation/getting_started.html>`__ 」の `「ソースからのインストール」` の指示に従ってください。
ko_kr: Qiskit Machine Learning은 Qiskit에 의존하므로 최신 변경 사항에는 Qiskit의 새로운 기능이나 변경된 기능이 필요할 수 있다. 따라서 다음 문서에 있는 Qiskit의 `"소스 코드로 설치"` 의 지시사항을 먼저 수행해야 한다: `Qiskit 시작하기 <https://qiskit.org/documentation/getting_started.html>`__
ml_in: ക്വിസ്കിറ്റ് മെഷീൻ ലേണിംഗ് ക്വിസ്കിറ്റിനെ ആശ്രയിച്ചിരിക്കുന്നതിനാൽ, അതിന്റെ ഏറ്റവും പുതിയ മാറ്റങ്ങൾക്ക് ക്വിസ്കിറ്റിന് പുതിയതോ മാറ്റപ്പെട്ടതോ ആയ സവിശേഷതകൾ ആവശ്യമായി വരാം എന്നതിനാൽ, നിങ്ങൾ ആദ്യം ക്വിസ്കിറ്റിന്റെ `"Install from source"` നിർദ്ദേശങ്ങൾ `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__ നിന്നും പാലിക്കണം.
pt_un: Como o Qiskit Machine Learning depende do Qiskit, e suas últimas mudanças podem exigir recursos novos ou modificados do Qiskit, você deve primeiro seguir as instruções `" Instalar a partir da fonte "` do Qiskit aqui `Introdução ao Qiskit <https://qiskit.org/documentation/getting_started.html>`__
ru_ru: Так как Qiskit Machine Learning зависит от Qiskit, и его последние изменения могут потребовать новых или измененных функций Qiskit, сначала следуйте инструкциям `"Установить из исходного кода"` здесь `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
ta_in: Qiskit பொறி கற்றல்__ qiskit-டைப் பொறுத்தது என்பதால், அதன் சமீபத்திய மாற்றங்களுக்கு qiskit-டின் புதிய அல்லது மாற்றப்பட்ட அம்சங்கள் தேவைப்படலாம் என்பதால், நீங்கள் முதலில் qiskit-டின் `"Install from source"` இங்கே அறிவுறுத்தல்களைப் பின்பற்ற வேண்டும் `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
tr_tr: Qiskit Makine Öğrenimi, Qiskit'e bağlı olduğundan ve en son değişiklikleri Qiskit'in yeni veya değiştirilmiş özelliklerini gerektirebileceğinden, önce Qiskit'in "Kaynaktan yükleme" talimatlarını buradan izlemelisiniz `Qiskit'e Başlarken <https://qiskit.org/documentation/getting_started.html>`__
vi_vn: Do Qiskit Machine Learning phụ thuộc vào Qiskit, và những thay đổi mới nhất của nó có thể sẽ yêu cầu các tính năng mới hoặc chỉnh sửa các tính năng của Qiskit, nên trước tiên bạn cần làm theo hướng dẫn `"Install from source"` của Qiskit tại `Qiskit Getting Started <https://qiskit.org/documentation/getting_started.html>`__
zh_tw: Qiskit 機器學習依賴於 Qiskit，最新的變化可能需要 Qiskit 中新增或更改的功能，所以你需要先按照 `Qiskit 入門<https://qiskit.org/documentation/getting_started.html>`__中的Qiskit's `"Install from source"` 指令。

source: Using the same development environment that you installed Qiskit in you are ready to install Qiskit Machine Learning.
bn_bn: আপনি যেই কিস্কিট ইনস্টল করেছেন সেই একই পরিবেশটি ব্যবহার করে আপনি কিস্কিট মেশিন লার্নিং ইনস্টল করতে প্রস্তুত।
de_de: Mit derselben Entwicklungsumgebung, in der Sie Qiskit installiert haben, können Sie Qiskit Machine Learning installieren.
el_gr: Χρησιμοποιώντας το ίδιο περιβάλλον ανάπτυξης που εγκαταστήσατε το Qiskit, είστε έτοιμοι να εγκαταστήσετε το Qiskit Machine Learning.
es_un: Usando el mismo entorno de desarrollo en el que instalaste Qiskit, estás listo para instalar Qiskit Machine Learning.
fr_fr: En utilisant l'environnement de développement dans lequel vous avez installé Qiskit, vous êtes prêt à installer Qiskit Machine Learning.
hi_in: आप उसी उत्थान वातावरण में Qiskit Machine Learning को स्थापित करने के लिए तैयार हैं जिस उत्थान वातावरण का उपयोग करते हुए आपने Qiskit को स्थापित किया था।
it_it: Utilizzando lo stesso ambiente di sviluppo dove hai installato Qiskit, puoi ora installare Qiskit Machine Learning.
ja_jp: Qiskit をインストールしたものと同じ開発環境を使用して、 Qiskit 機械学習をインストールすることができます。
ko_kr: Qiskit을 설치한 동일한 개발 환경을 사용하여 Qiskit Machine Learning을 설치할 준비가 되었다.
ml_in: നിങ്ങൾ ക്വിസ്കിറ്റ് ഇൻസ്റ്റാൾ ചെയ്ത അതേ ഡെവലപ്പ്മെന്റ് എൻവൈൺമെൻ്റ് (development environment) ഉപയോഗിച്ച് ക്വിസ്കിറ്റ് മെഷീൻ ലേണിംഗും ഇൻസ്റ്റാൾ ചെയ്യാവുന്നതാണ്.
pt_un: Usando o mesmo ambiente de desenvolvimento em que instalou o Qiskit, você está pronto para instalar o Qiskit Machine Learning.
ru_ru: Используя ту же среду разработки, в которой Вы установили Qiskit, Вы можете установить пакет Qiskit Machine Learning.
ta_in: நீங்கள் qiskit-டை நிறுவிய அதே மேம்பாட்டு சுற்றுச்சூழலைப் பயன்படுத்தி qiskit பொறி கற்றலை நிறுவ தயாராக உள்ளீர்கள்.
tr_tr: Qiskit'i kurduğunuz geliştirme ortamını kullanarak, Qiskit Makine Öğrenimini kurmaya hazırsınız.
vi_vn: Bây giờ bạn đã sẵn sàng để cài đặt Qiskit Machine Learning trên cùng môi trường phát triển mà bạn đã cài đặt Qiskit trước đó.
zh_tw: 您可以使用與安裝與Qiskit相同的開發環境來安裝 Qiskit 機器學習。

source: Clone the Qiskit Machine Learning repository.
bn_bn: Qiskit মেশিন লার্নিং রিপোজিটরি এর প্রতিলিপি (Clone) করুন
de_de: Klonen Sie das Qiskit-Repository für Machine Learning.
el_gr: Κλωνοποιήστε το αποθετήριο Qiskit Μηχανικής Εκμάθησης.
es_un: Clonar el repositorio de Qiskit Machine Learning.
fr_fr: Clonez le référentiel Qiskit Machine Learning.
hi_in: Qiskit Machine Learning रिपॉजिटरी को क्लोन करें।
it_it: Effettua la clone della repository di Qiskit Machine Learning.
ja_jp: Qiskit 機械学習リポジトリをクローンします。
ko_kr: Qiskit Machine Learning 저장소를 복제한다.
ml_in: ക്വിസ്കിറ്റ് മെഷീൻ ലേണിംഗ് റിപോസിട്ടറി ക്ലോൺ ചെയ്യുക.
pt_un: Clone o repositório do Qiskit Machine Learning.
ru_ru: Клонируйте репозиторий Qiskit Machine Learning.
ta_in: Qiskit பொறி கற்றல் களஞ்சியத்தை க்ளோன் செய்யுங்கள்.
tr_tr: Qiskit Makine Öğrenimi deposunu klonlayın.
vi_vn: Nhân bản kho lưu trữ của Qiskit Machine Learning.
zh_tw: 複製 Qiskit 機器學習儲存庫

source: Cloning the repository creates a local folder called ``qiskit-machine-learning``.
bn_bn: রিপোসিটোরিটিকে ক্লোন করলে ``qiskit-machine-learning`` নামক একটি স্থানীয় ফোল্ডার তৈরী হবে।
de_de: Klonen des Repository erzeugt einen lokalen Ordner namens ` ` qiskit-machine-learning ` `.
el_gr: Η κλωνοποίηση του αποθετηρίου δημιουργεί έναν τοπικό φάκελο που ονομάζεται ``qiskit-machine-learning``.
es_un: La clonación del repositorio crea una carpeta local llamada ``qiskit-machine-learning``.
fr_fr: Le clonage du référentiel crée un dossier local appelé ``qiskit-machine-learning``.
hi_in: रिपॉजिटरी को क्लोन करने से ``qiskit-machine-learning`` नामक एक स्थानीय फ़ोल्डर बन जाता है।
it_it: Effettuare la clone della repository andrà a crea una cartella in locale chiamata ``qiskit-machine-learning``.
ja_jp: レポジトリをクローンすると、``qiskit-machine-learning`` という名前のローカル・フォルダが作成されます。
ko_kr: 저장소를 복제하면 ``qiskit-machine-learning``라는 이름의 로컬 디렉토리가 생성된다.
ml_in: റിപോസിട്ടറി ക്ലോൺ ചെയ്യുന്നത് ``qiskit-machine-learning``എന്ന ലോക്കൽ ഫോൾഡർ സൃഷ്ടിക്കുന്നു.
pt_un: Clonar o repositório cria um diretório local nomeado ``qiskit-machine-learning``.
ru_ru: Клонирование репозитория создает локальную папку с названием ``qiskit-machine-learning``.
ta_in: களஞ்சியத்தை க்ளோன் செய்வது ``qiskit-machine-learning`` எனப்படும் உள்ளூர் கோப்புறையை உருவாக்குகிறது.
tr_tr: Depoyu klonlamak, ``qiskit-machine-learning`` adlı yerel bir klasör oluşturur.
vi_vn: Nhân bản kho lưu trữ sẽ tạo ra một thư mục cục bộ có tên ``qiskit-machine-learning``.
zh_tw: 複製儲存庫時，會建立名為 ``qiskit-machine-learning`` 的本端資料夾。

source: If you want to run tests or linting checks, install the developer requirements.
bn_bn: টেস্ট রান করানোর জন্য বা মোলায়েম করা (লিনটিং) চেক করার জন্য, ডেভেলপারের প্রয়োজন ইনস্টল করুন।
de_de: Wenn Sie Tests oder Linting-Prüfungen ausführen möchten, installieren Sie die Entwicklungsabhängigkeiten.
el_gr: Αν θέλετε να εκτελέσετε δοκιμές ή να επιβάλετε ελέγχους, εγκαταστήστε τις απαιτήσεις ανάπτυξης.
es_un: Si quieres ejecutar pruebas o verificaciones de linting, instala los requerimientos de desarrollador.
fr_fr: Si vous souhaitez réaliser des tests ou faire de l'analyse de code source (linting), installez les pré-requis Developeur.
hi_in: यदि आप परीक्षण या लिंटिंग परीक्षण चलाना चाहते हैं, तो डेवलपर आवश्यकताओं को स्थापित करें।
it_it: Se si desidera eseguire dei test o dei controlli di linting, bisogna installare i developer requirements.
ja_jp: もし、テストを実行したり文法をチェックしたい場合は、開発者向けライブラリーをインストールします。
ko_kr: 만약 테스트 코드를 실행하거나 철자법 검사를 하고자 한다면, 개발자 요구사항 라이브러리를 설치하라.
ml_in: നിങ്ങൾക്ക് ടെസ്റ്റുകളോ ലിന്റിംഗ്(linting) പരിശോധനകളോ പ്രവർത്തിപ്പിക്കണമെങ്കിൽ, ഡവലപ്പർ ആവശ്യകതകൾ ഇൻസ്റ്റാൾ ചെയ്യുക.
pt_un: Se você quiser executar testes ou análise de código, instale os requisitos de desenvolvedor.
ru_ru: Если Вы хотите запустить тесты, установите необходимые инструменты для разработчика.
ta_in: நீங்கள் சோதனைகள் அல்லது லிட்டிங் காசோலைகளை இயக்க விரும்பினால், உருவாக்குபவர் தேவைகளை நிறுவவும்.
tr_tr: Eğer testler veya tiftikleme kontrolleri yapmak istiyorsanız geliştirici gereksinimlerini yükleyin.
vi_vn: Nếu bạn muốn chạy test hoặc linting, hãy cài đặt các yêu cầu dành cho nhà phát triển.
zh_tw: 如果要執行測試或換行測試，請安裝開發人員需求。

source: Install ``qiskit-machine-learning``.
bn_bn: ``qiskit-machine-learning`` ইনস্টল করুন।
de_de: Installation von ` ` qiskit-machine-learning ` `.
el_gr: Εγκατάσταση " ` qiskit-learning-learning ` `.
es_un: Instalar ``qiskit-machine-learning``.
fr_fr: Installez ``qiskit-machine-learning``.
hi_in: ``qiskit-machine-learning`` स्थापित करें।
it_it: Installa ``qiskit-machine-learning``.
ja_jp: ``qiskit-machine-learning`` をインストールします。
ko_kr: ``qiskit-machine-learning``을 설치한다.
ml_in: `` ക്വിസ്കിറ്റ്-മെഷീൻ-ലേണിംഗ്`` ഇൻസ്റ്റാൾ ചെയ്യുക.
pt_un: Instale ``qiskit-machine-learning``.
ru_ru: Установите ``qiskit-machine-learning``.
ta_in: ``qiskit-machine-learning`` ஐ நிறுவவும்.
tr_tr: ``qiskit-machine-learning`` yükleyin.
vi_vn: Cài đặt ``qiskit-machine-learning``.
zh_tw: 安裝 ``qiskit-machine-learning ``。

source: If you want to install it in editable mode, meaning that code changes to the project don't require a reinstall to be applied, you can do this with:
bn_bn: আপনি যদি এটিকে সম্পাদনযোগ্য মোডে ইনস্টল করতে চান, মানে এই প্রজেক্টের কোড পরিবর্তনের জন্য প্রয়োগ করার জন্য পুনরায় ইনস্টল করা প্রয়োজন নেই, আপনি এটি করতে পারেন:
de_de: Wenn Sie im editierbaren Modus installieren möchten, in dem Änderungen des Codes im Projekt keine Neuinstallation erfordern, können Sie das folgendermaßen tun:
el_gr: Αν θέλετε να το εγκαταστήσετε σε επεξεργάσιμη λειτουργία, που σημαίνει ότι οι αλλαγές κώδικα στο έργο δεν απαιτούν την εφαρμογή επανεγκατάστασης, μπορείτε να το κάνετε με:
es_un: Si deseas instalarlo en modo editable, es decir, que los cambios en el código del proyecto no requieran ser instalados de nuevo, puedes hacerlo con:
fr_fr: Pour une installation en mode Editable (les changements dans le code sont alors pris en compte sans besoin de réinstaller le projet), vous pouvez choisir cette commande :
hi_in: यदि आप इसे संपादन योग्य मोड में स्थापित करना चाहते हैं, अर्थात प्रोजेक्ट में कोड परिवर्तन को लागू करने के लिए पुनर्स्थापना की आवश्यकता नहीं है, तो आप इसे इस प्रकार से लागू कर सकते हैं :
it_it: Se si vuole installarle in modalità modificabile, ovvero in modo che le modifiche al codice del progetto non richiedano una nuova installazione per essere applicate, bisogna farlo attraverso:
ja_jp: 編集可能モード (プロジェクトのコードを変更しても再インストールする必要なし) でインストールする場合は、次の手順を実行します:
ko_kr: 만약, 프로젝트에 코드가 변화하였을 때 재설치가 필요하지 않는, 수정 가능한 모드로 설치하고자 한다면, 다음의 명령어를 사용하라.
ml_in: നിങ്ങൾക്ക് ഇത് എഡിറ്റുചെയ്യാവുന്ന മോഡിൽ ഇൻസ്റ്റാൾ ചെയ്യണമെങ്കിൽ, പ്രോജക്റ്റിലെ കോഡ് മാറ്റങ്ങൾക്കായി വീണ്ടും ഇൻസ്റ്റാൾ ചെയ്യേണ്ട ആവശ്യമില്ലെന്നാണ് ഇതിനർത്ഥം, നിങ്ങൾക്ക് ഇത് ഇങ്ങനെ ചെയ്യാനാകും:
pt_un: Se você quiser instalá-lo em modo editável, o que significa que as alterações de código no projeto não requerem que uma reinstalação seja aplicada, você pode fazer isso com:
ru_ru: Если Вы хотите установить пакет в редактируемом режиме, который позволяет не переустанавливать пакет в случае изменения кода в проекте, Вы можете сделать это с помощью:
ta_in: நீங்கள் இதை திருத்தக்கூடிய பயன்முறையில் நிறுவ விரும்பினால், திட்டத்திற்கான குறியீடு மாற்றங்களுக்கு மறுநிறுவல் தேவையில்லை என்று பொருள், இதை நீங்கள் செய்யலாம்:
tr_tr: Eğer düzenlenebilir modda yüklemek istiyorsanız, yani projede yapılan kod değişikliklerinin uygulanması için yeniden yüklenmesi gerekmediği anlamına geliyorsa, bunu şununla yapabilirsiniz:
vi_vn: Nếu bạn muốn cài đặt ở chế độ có thể chỉnh sửa được, nghĩa là khi bạn thay đổi code trong project thì bạn không cần phải cài đặt lại, làm điều này bằng cách:
zh_tw: 如果您想用可編輯模式安裝，即變更專案的程式碼時不重新安裝，您可以這樣做：

source: Optional installs
bn_bn: ঐচ্ছিক ইনস্টল
de_de: Optionale Installationen
el_gr: Προαιρετικές εγκαταστάσεις
es_un: Instalaciones opcionales
fr_fr: Installations optionnelles
hi_in: वैकल्पिक संस्थापन
it_it: Installazioni facoltative
ja_jp: オプションのインストール
ko_kr: 선택적 설치
ml_in: നിർബന്ധമല്ലാത്ത ഇൻസ്റ്റാളുകൾ
pt_un: Instalações opcionais
ru_ru: Необязательные для установки компоненты
ta_in: விருப்ப நிறுவல்கள்
tr_tr: İsteğe bağlı yüklemeler
vi_vn: Các cài đặt tùy chọn
zh_tw: 選用安裝

source: **PyTorch**, may be installed either using command `pip install 'qiskit-machine-learning[torch]'` to install the package or refer to PyTorch `getting started <https://pytorch.org/get-started/locally/>`__. When PyTorch is installed, the `TorchConnector` facilitates its use of quantum computed networks.
bn_bn: ** PyTorch **, প্যাকেজ ইনস্টল করার জন্য `pip install 'qiskit-machine-learning[torch]'` কমান্ড ব্যবহার করে ইনস্টল করা যেতে পারে অথবা PyTorch `getting started <https://pytorch.org/get-started/locally/>`__ পড়ুন। যখন PyTorch ইনস্টল করা হয়, `TorchConnector` কোয়ান্টাম কম্পিউটেড নেটওয়ার্ক ব্যবহার করতে সুবিধা করে।
hi_in: **PyTorch**, package को install करने के लिए `pip install 'qiskit-machine-learning[torch]'` command का उपयोग करके install किया जा सकता है या फिर yTorch `getting started <https://pytorch.org/get-started/locally/>`__. उल्लेलख से देखकर। PyTorch की स्थापना होने पर `TorchConnector` क्वांटम गणना नेटवर्क के उपयोग की सुविधा प्रदान करता है।
it_it: **PyTorch**, può essere installato sia utilizzando il comando `pip install 'qiskit-machine-learning[torch]'` per installare il pacchetto, sia facendo riferimento a PyTorc `getting started <https://pytorch.org/get-started/locally/>`__. Quando PyTorch è installato, `TorchConnector` facilita il suo utilizzo per il calcolo quantistico di reti.
ja_jp: **PyTorch** は、コマンド `pip install 'qiskit-machine-learning[torch]'` を使用してパッケージをインストールするか、 PyTorch `getting started <https://pytorch.org/get-started/locally/>`__ を参照してインストールすることができます。 PyTorch がインストールされると、`TorchConnector` は量子計算ネットワークの使用を容易にします。
ta_in: **PyTorch**, தொகுப்பை நிறுவ `Pip install 'qiskit-machine-learning [torch]'` கட்டளையைப் பயன்படுத்தி நிறுவப்படலாம் அல்லது pytorch `தொடங்குதல் <https://pytorch.org/get-started/locally/>`__ ஐப் பார்க்க. PyTorch நிறுவப்பட்டதும், `TorchConnector` குவாண்டம் கம்ப்யூட்டட் நெட்வொர்க்குகளைப் பயன்படுத்த உதவுகிறது.
