Repository: qiskit-community/qiskit-translations
Catalog: machine-learning/docs/locale/*/LC_MESSAGES/index.po
Languages: es_un, ko_kr, ta_in

source: Overview
es_un: Descripción general
ko_kr: 개요
ta_in: கண்ணோட்டம்

source: Getting Started
es_un: Primeros Pasos
ko_kr: 시작하기
ta_in: தொடங்குதல்

source: Tutorials
es_un: Tutoriales
ko_kr: 튜토리얼
ta_in: பயிற்சிகள்

source: API Reference
es_un: Referencia de la API
ko_kr: API 참조
ta_in: API குறிப்பு

source: Release Notes
es_un: Notas de la Versión
ko_kr: 릴리스 노트
ta_in: வெளியீட்டு குறிப்புகள்

source: GitHub
ko_kr: 깃허브
ta_in: கிட்ஹப்

source: Qiskit Machine Learning overview
es_un: Descripción general de Qiskit Machine Learning
ko_kr: Qiskit 머신 러닝 개요
ta_in: Qiskit பொறி கற்றல் கண்ணோட்டம்

source: Qiskit Machine Learning introduces fundamental computational building blocks - such as Quantum Kernels and Quantum Neural Networks - used in different applications, including classification and regression. On the one hand, this design is very easy to use and allows users to rapidly prototype a first model without deep quantum computing knowledge. On the other hand, Qiskit Machine Learning is very flexible, and users can easily extend it to support cutting-edge quantum machine learning research.
es_un: Qiskit Machine Learning presenta bloques de construcción computacionales fundamentales, como Quantum Kernels y Quantum Neural Networks, que se utilizan en diferentes aplicaciones, incluidas la clasificación y la regresión. Por un lado, este diseño es muy fácil de usar y permite a los usuarios prototipar rápidamente un primer modelo sin conocimientos profundos de computación cuántica. Por otro lado, Qiskit Machine Learning es muy flexible y los usuarios pueden extenderlo fácilmente para respaldar la investigación de machine learning cuántico de vanguardia.
ko_kr: Qiskit Machine Learning은 분류 및 회귀를 포함한 다양한 애플리케이션에서 사용되는 양자 커널 및 양자 신경망과 같은 기본적인 컴퓨터의 구성 요소를 지니고 있다. 다른 한 편으로, 이 패키지는 사용하기가 매우 쉬우며 사용자가 전문적인 양자 컴퓨팅 지식 없이도 첫 번째 모델을 신속하게 프로토타입화할 수 있도록 해준다. 또한, Qiskit Machine Learning은 매우 유연하며, 사용자들이 이를 쉽게 확장하여 최첨단 양자 머신러닝 연구에 사용할 수 있도록 한다.
ta_in: Qiskit பொறி கற்றல், குவாண்டம் கர்னல்கள் மற்றும் குவாண்டம் நியூரல் நெட்வொர்க்குகள் போன்ற அடிப்படைக் கணக்கீட்டு கட்டுமானத் தொகுதிகளை அறிமுகப்படுத்துகிறது - வகைப்பாடு மற்றும் பின்னடைவு உள்ளிட்ட பல்வேறு பயன்பாடுகளில் பயன்படுத்தப்படுகிறது. ஒருபுறம், இந்த வடிவமைப்பு பயன்படுத்த மிகவும் எளிதானது மற்றும் பயனர்கள் ஆழமான குவாண்டம் கம்ப்யூட்டிங் அறிவு இல்லாமல் முதல் மாதிரியை விரைவாக முன்மாதிரி செய்ய அனுமதிக்கிறது. மறுபுறம், Qiskit பொறி கற்றல் மிகவும் நெகிழ்வானது, மேலும் பயனர்கள் அதிநவீன குவாண்டம் இயந்திர கற்றல் ஆராய்ச்சியை ஆதரிக்க எளிதாக நீட்டிக்க முடியும்.

source: Qiskit Machine Learning provides the :class:`~qiskit_machine_learning.kernels.QuantumKernel` class that can be easily used to directly compute kernel matrices for given datasets or can be passed to a Quantum Support Vector Classifier (:class:`~qiskit_machine_learning.algorithms.QSVC`) or Quantum Support Vector Regressor (:class:`~qiskit_machine_learning.algorithms.QSVR`) to quickly start solving classification or regression problems. It also can be used with many other existing kernel-based machine learning algorithms from established classical frameworks.
es_un: Qiskit Machine Learning proporciona la clase :class:`~qiskit_machine_learning.kernels.QuantumKernel` que se puede usar fácilmente para calcular directamente las matrices del kernel para conjuntos de datos dados o se puede pasar a un Clasificador Cuántico de Vectores de Soporte (Quantum Support Vector Classifier) (:class:`~qiskit_machine_learning.algorithms.QSVC`) o Regresor Cuántico de Vectores de Soporte (Quantum Support Vector Regressor) (:class:`~qiskit_machine_learning.algorithms.QSVR`) para empezar a resolver rápidamente problemas de clasificación o regresión. También se puede utilizar con muchos otros algoritmos de machine learning basados en kernels existentes de frameworks clásicos establecidos.
ko_kr: Qiskit Machine Learning은 주어진 데이터 세트에 대한 커널 행렬을 직접 계산하는 데 사용하거나, 분류 또는 회귀 문제 해결을 빠르게 시작할 수 있도록 Quantum Support Vector 분류자(:class:`~qiskit_machine_learning.algorithms.QSVC` )나 Quantum Support Vector Regressor(:class:`~qiskit_machine_learning.algorithms.QSVR`)에 전달할 수 있는 :class:`~qiskit_machine_learning.kernels.QuantumKernel` 클래스를 제공한다. 또한 고전적 프레임워크 안에서 설계된 커널 기반의 머신러닝 알고리즘들에도 이 클래스를 사용할 수 있다.
ta_in: Qiskit பொறி கற்றல் ஆனது :class:`~qiskit_machine_learning.kernels.QuantumKernel` வகுப்பை வழங்குகிறது, இது கொடுக்கப்பட்ட தரவுத்தொகுப்புகளுக்கான கர்னல் மெட்ரிக்குகளை நேரடியாகக் கணக்கிடுவதற்கு எளிதாகப் பயன்படுத்தப்படலாம் அல்லது Quantum Support Vector Classifier (:class:`~qiskit_machine_learning.algorithms.QSVC`) அல்லது Quantum Support Vector Regressor (:class:`~qiskit_machine_learning.algorithms.QSVR`) வகைப்படுத்துதல் அல்லது பின்னடைவு சிக்கல்களை விரைவாகத் தீர்க்கத் தொடங்கும். நிறுவப்பட்ட கிளாசிக்கல் கட்டமைப்பிலிருந்து ஏற்கனவே உள்ள கர்னல் அடிப்படையிலான இயந்திர கற்றல் வழிமுறைகளுடன் இது பயன்படுத்தப்படலாம்.

source: Qiskit Machine Learning defines a generic interface for neural networks that is implemented by different quantum neural networks. Multiple implementations are readily provided, such as the :class:`~qiskit_machine_learning.neural_networks.OpflowQNN`, the :class:`~qiskit_machine_learning.neural_networks.TwoLayerQNN`, and the :class:`~qiskit_machine_learning.neural_networks.CircuitQNN`. The :class:`~qiskit_machine_learning.neural_networks.OpflowQNN` allows users to combine parametrized quantum circuits with quantum mechanical observables. The circuits can be constructed using, for example, building blocks from Qiskit’s circuit library, and the QNN’s output is given by the expected value of the observable. The :class:`~qiskit_machine_learning.neural_networks.TwoLayerQNN` is a special case of the :class:`~qiskit_machine_learning.neural_networks.OpflowQNN` that takes as input a feature map and an ansatz. The :class:`~qiskit_machine_learning.neural_networks.CircuitQNN` directly takes the quantum circuit’s measurements as output without an observable. The output can be used either as a batch of samples, i.e., a list of bitstrings measured from the circuit’s qubits, or as a sparse vector of the resulting sampling probabilities for each bitstring. The former is of interest in learning distributions resulting from a given quantum circuit, while the latter finds application, e.g., in regression or classification. A post-processing step can be used to interpret a given bitstring in a particular context, e.g. translating it into a set of classes.
es_un: Qiskit Machine Learning define una interfaz genérica para redes neuronales que es implementada por diferentes redes neuronales cuánticas. Se proporcionan múltiples implementaciones listas para usarse, como la clase :class:`~qiskit_machine_learning.neural_networks.OpflowQNN`, la :class:`~qiskit_machine_learning.neural_networks.TwoLayerQNN`, y la :class:`~qiskit_machine_learning.neural_networks.CircuitQNN`. La clase :class:`~qiskit_machine_learning.neural_networks.OpflowQNN` permite a los usuarios combinar circuitos cuánticos parametrizados con observables mecánicos cuánticos. Los circuitos se pueden construir usando, por ejemplo, bloques de construcción de la biblioteca de circuitos de Qiskit, y la salida de QNN viene dada por el valor esperado del observable. La clase :class:`~qiskit_machine_learning.neural_networks.TwoLayerQNN` es un caso especial de la :class:`~qiskit_machine_learning.neural_networks.OpflowQNN` que toma como entrada un mapa de características y un ansatz. La clase :class:`~qiskit_machine_learning.neural_networks.CircuitQNN` toma directamente las mediciones del circuito cuántico como salida sin un observable. La salida se puede utilizar como un lote de muestras, es decir, una lista de cadenas de bits medidas a partir de los qubits del circuito, o como un vector disperso de las probabilidades de muestreo resultantes para cada cadena de bits. La primera es de interés en el aprendizaje de distribuciones resultantes de un circuito cuántico dado, mientras que la segunda tiene aplicación, por ejemplo, en regresión o clasificación. Se puede usar un paso de posprocesamiento para interpretar una cadena de bits dada en un contexto particular, por ejemplo, traduciéndola a un conjunto de clases.
ko_kr: Qiskit Machine Learning은 다양한 양자 신경망에 의해 구현되는 신경망들에도 사용할 수 있도록 인터페이스를 정의한다. 다음과 같은 인터페이스는 여러 방식에 사용할 수 있다: :class:`~qiskit_machine_learning.neural_networks.OpflowQNN` , :class:`~qiskit_machine_learning.neural_networks.TwoLayerQNN` 및 :class:`~qiskit_machine_learning.neural_networks.CircuitQNN` . :class:`~qiskit_machine_learning.neural_networks.OpflowQNN` 을 사용하면 매개변수화된 양자 회로를 양자 역학적 관측 가능 항목(Quantum mechanical observables)과 결합할 수 있다. 예를 들어, 회로는 Qiskit의 회로 라이브러리에 있는 빌딩 블록을 사용하여 구성할 수 있으며 QNN의 출력은 관축 가능한 항목의 기대값으로 제공된다. :class:`~qiskit_machine_learning.neural_networks.TwoLayerQNN` 은 특징 맵과 ansatz를 입력으로 사용하는 :class:`~qiskit_machine_learning.neural_networks.OpflowQNN` 의 특별한 경우이다. :class:`~qiskit_machine_learning.neural_networks.CircuitQNN` 은 관측값이 없이 양자 회로의 측정값을 출력으로 바로 제공받는다. 출력은 샘플 배치, 즉 회로의 큐비트에서 측정된 비트열 목록 또는 각 비트열에 대한 결과 샘플링 확률의 희소 벡터(sparse vector) 가 될 수 있다. 전자는 주어진 양자 회로에서 발생하는 확률 분포를 학습에 사용하는 것에 관심을 두는 반면 후자는 회귀 또는 분류와 같은 응용 분야를 탐색하는데 관심을 두고 사용된다. 후처리 단계를 사용하여 특정 맥락 주어진 비트스트링을 해석할 수 있는데 비트스트링을 클래스 집합으로 변환하여 해석하는 것이 그 예이다.
ta_in: வெவ்வேறு குவாண்டம் நரம்பியல் நெட்வொர்க்குகளால் செயல்படுத்தப்படும் நியூரல் நெட்வொர்க்குகளுக்கான பொதுவான இடைமுகத்தை கிஸ்கிட் மெஷின் லேர்னிங் வரையறுக்கிறது. :class:`~qiskit_machine_learning.neural_networks.OpflowQNN`, the :class:`~qiskit_machine_learning.neural_networks.TwoLayerQNN`, மற்றும் :class:`~qiskit_machine_learning.neural_networks.CircuitQNN`. :class:`~qiskit_machine_learning.neural_networks.OpflowQNN` ஆனது, குவாண்டம் மெக்கானிக்கல் அவதானிப்புகளுடன் அளவுருக் குவாண்டம் சுற்றுகளை இணைக்க பயனர்களை அனுமதிக்கிறது. எடுத்துக்காட்டாக, Qiskit இன் சர்க்யூட் லைப்ரரியில் இருந்து கட்டுமானத் தொகுதிகளைப் பயன்படுத்தி சுற்றுகளை உருவாக்கலாம், மேலும் QNN இன் வெளியீடு கவனிக்கக்கூடிய மதிப்பின் மூலம் வழங்கப்படுகிறது. :class:`~qiskit_machine_learning.neural_networks.TwoLayerQNN` என்பது :class:`~qiskit_machine_learning.neural_networks.OpflowQNN` என்பதன் சிறப்பு அம்சமாகும், இது ஒரு அம்ச வரைபடம் மற்றும் ஒரு ansatz ஐ உள்ளீட்டாக எடுத்துக்கொள்கிறது. :class:`~qiskit_machine_learning.neural_networks.CircuitQNN` நேரடியாக குவாண்டம் சர்க்யூட்டின் அளவீடுகளை கவனிக்காமல் வெளியீடாக எடுக்கிறது. வெளியீட்டை மாதிரிகளின் தொகுப்பாகப் பயன்படுத்தலாம், அதாவது, சர்க்யூட்டின் க்யூபிட்களில் இருந்து அளவிடப்படும் பிட்ஸ்ட்ரிங்களின் பட்டியல் அல்லது ஒவ்வொரு பிட்ஸ்ட்ரிங்க்கும் விளைந்த மாதிரி நிகழ்தகவுகளின் ஸ்பேஸ் வெக்டராகவும் பயன்படுத்தப்படலாம். முந்தையது கொடுக்கப்பட்ட குவாண்டம் சர்க்யூட்டின் விளைவாக விநியோகங்களைக் கற்றுக்கொள்வதில் ஆர்வமாக உள்ளது, பிந்தையது பயன்பாட்டைக் கண்டறிகிறது, எ.கா., பின்னடைவு அல்லது வகைப்படுத்தலில். ஒரு குறிப்பிட்ட சூழலில் கொடுக்கப்பட்ட பிட்ஸ்ட்ரிங்கை விளக்குவதற்கு பிந்தைய செயலாக்க படி பயன்படுத்தப்படலாம், எ.கா. அதை வகுப்புகளின் தொகுப்பாக மொழிபெயர்ப்பது.

source: The neural networks include the functionality to evaluate them for a given input as well as to compute the corresponding gradients, which is important for efficient training. To train and use neural networks, Qiskit Machine Learning provides a variety of learning algorithms such as the :class:`~qiskit_machine_learning.algorithms.NeuralNetworkClassifier` and :class:`~qiskit_machine_learning.algorithms.NeuralNetworkRegressor`. Both take a QNN as input and then use it in a classification or regression context. To allow an easy start, two convenience implementations are provided - the Variational Quantum Classifier (:class:`~qiskit_machine_learning.algorithms.VQC`) as well as the Variational Quantum Regressor (:class:`~qiskit_machine_learning.algorithms.VQR`). Both take just a feature map and an ansatz and construct the underlying QNN automatically.
es_un: Las redes neuronales incluyen la funcionalidad para evaluarlas para una entrada determinada, así como para calcular los gradientes correspondientes, lo cual es importante para un entrenamiento eficiente. Para entrenar y usar redes neuronales, Qiskit Machine Learning proporciona una variedad de algoritmos de aprendizaje como la clase :class:`~qiskit_machine_learning.algorithms.NeuralNetworkClassifier` y :class:`~qiskit_machine_learning.algorithms.NeuralNetworkRegressor`. Ambas toman una QNN como entrada y luego la utilizan en un contexto de clasificación o regresión. Para permitir un comienzo fácil, se proporcionan dos implementaciones convenientes: el Clasificador Cuántico Variacional (:class:`~qiskit_machine_learning.algorithms.VQC`) así como el Regresor Cuántico Variacional (:class:`~qiskit_machine_learning.algorithms.VQR`). Ambos toman solo un mapa de características y un ansatz y construyen la QNN subyacente automáticamente.
ko_kr: 신경망은 주어진 입력에 대해 평가함과 동시에 입력의 그래디언트를 계산하는 기능이 포함되어 있으며 이것은 효율적인 학습에 중요하다. 신경망을 학습하고 사용하기 위해 Qiskit Machine Learning은 :class:`~qiskit_machine_learning.algorithms.NeuralNetworkClassifier` 및 :class:`~qiskit_machine_learning.algorithms.NeuralNetworkRegressor` 와 같은 다양한 학습 알고리즘을 제공한다. 두가지 모두 QNN을 입력으로 받은 다음 분류 또는 회귀 목적으로 사용한다. 사용자가 쉽고 빠르게 시작할 수 있도록 Variational Quantum Classifier(:class:`~qiskit_machine_learning.algorithms.VQC` )와 Variational Quantum Regressor(:class:`~qiskit_machine_learning.algorithms.VQR` )의 두 가지 기능이 구현되어 편리하게 제공된다. 두 기능 모두 특성 맵과 ansatz만을 사용하며 기본적인 QNN을 자동으로 구성한다.
ta_in: நரம்பியல் நெட்வொர்க்குகள் கொடுக்கப்பட்ட உள்ளீட்டிற்காக அவற்றை மதிப்பிடுவதற்கான செயல்பாடுகளை உள்ளடக்கியது மற்றும் தொடர்புடைய சாய்வுகளைக் கணக்கிடுகிறது, இது திறமையான பயிற்சிக்கு முக்கியமானது. நரம்பியல் நெட்வொர்க்குகளைப் பயிற்றுவிப்பதற்கும் பயன்படுத்துவதற்கும், Qiskit பொறி கற்றல் பல்வேறு கற்றல் அல்காரிதம்களை வழங்குகிறது :class:`~qiskit_machine_learning.algorithms.NeuralNetworkClassifier` மற்றும் :class:`~qiskit_machine_learning.algorithms.NeuralNetworkRegressor` இருவரும் ஒரு QNN ஐ உள்ளீடாக எடுத்து பின்னர் அதை ஒரு வகைப்பாடு அல்லது பின்னடைவு சூழலில் பயன்படுத்துகின்றனர். எளிதான தொடக்கத்தை அனுமதிக்க, இரண்டு வசதிச் செயலாக்கங்கள் வழங்கப்படுகின்றன - மாறுபாடு குவாண்டம் வகைப்படுத்தி (:class:`~qiskit_machine_learning.algorithms.VQC`) அத்துடன் மாறுபாடு குவாண்டம் ரீக்ரஸர் (:class:`~qiskit_machine_learning.VQC`). இரண்டும் ஒரு அம்ச வரைபடத்தையும் ஒரு அன்சாட்ஸையும் எடுத்துக்கொண்டு, அடிப்படையான QNN ஐ தானாக உருவாக்குகின்றன.

source: In addition to the models provided directly in Qiskit Machine Learning, it has the :class:`~qiskit_machine_learning.connectors.TorchConnector`, which allows users to integrate all of our quantum neural networks directly into the `PyTorch <https://pytorch.org>`__ open source machine learning library. Thanks to Qiskit’s gradient framework, this includes automatic differentiation - the overall gradients computed by `PyTorch <https://pytorch.org>`__ during the backpropagation take into account quantum neural networks, too. The flexible design also allows the building of connectors to other packages in the future.
es_un: Además de los modelos provistos directamente en Qiskit Machine Learning, se tiene la clase :class:`~qiskit_machine_learning.connectors.TorchConnector`, que permite a los usuarios integrar todas nuestras redes neuronales cuánticas directamente en la biblioteca de machine learning de código abierto `PyTorch <https://pytorch.org>`__. Gracias al framework de gradiente de Qiskit, esto incluye la diferenciación automática, los gradientes generales calculados por `PyTorch <https://pytorch.org>`__ durante la retropropagación también toman en cuenta las redes neuronales cuánticas. El diseño flexible también permite la construcción de conectores a otros paquetes en el futuro.
ko_kr: Qiskit Machine Learning에서 직접 제공되는 모델 외에도 :class:`~qiskit_machine_learning.connectors.TorchConnector` 를 사용해 사용자가 모든 양자 신경망을 직접 `PyTorch <https://pytorch. org>`__ 오픈 소스 머신 러닝 라이브러리에 연결해 사용할 수도 있다. Qiskit의 그래디언트 프레임워크 덕분에 자동 미분 - 역전파(backpropagation) 동안 `PyTorch <https://pytorch.org>`__ 에서 계산되는 전체 그래디언트도 양자 신경에 사용할 수 있게 되었다. 이러한 유연한 디자인 덕분에 이후 또 다른 패키지에 대한 커넥터의 구축 또한 가능하다.
ta_in: Qiskit பொறி கற்றல் இல் நேரடியாக வழங்கப்பட்ட மாதிரிகள் தவிர, இதில் :class:`~qiskit_machine_learning.connectors.TorchConnector` உள்ளது, இது பயனர்கள் எங்கள் குவாண்டம் நியூரல் நெட்வொர்க்குகள் அனைத்தையும் நேரடியாக `PyTorch <https://pytorch இல் ஒருங்கிணைக்க அனுமதிக்கிறது. org>`__ திறந்த மூல இயந்திர கற்றல் நூலகம். Qiskit இன் சாய்வு கட்டமைப்பிற்கு நன்றி, இதில் தானியங்கி வேறுபாட்டை உள்ளடக்கியது `PyTorch <https://pytorch.org>`__ மூலம் கணக்கிடப்பட்ட ஒட்டுமொத்த சாய்வுகளும் குவாண்டம் நரம்பியல் நெட்வொர்க்குகளையும் கணக்கில் எடுத்துக்கொள்ளும். நெகிழ்வான வடிவமைப்பு எதிர்காலத்தில் மற்ற தொகுப்புகளுக்கு இணைப்பிகளை உருவாக்க அனுமதிக்கிறது.

source: Next Steps
es_un: Siguientes Pasos
ko_kr: 다음 단계들
ta_in: அடுத்த படிகள்

source: `Getting started <getting_started.html>`_
es_un: `Primeros pasos <getting_started.html>`_
ko_kr: `시작하기 <getting_started.html>`_
ta_in: `தொடங்குதல் <getting_started.html>`_

source: `Tutorials <tutorials/index.html>`_
es_un: `Tutoriales <tutorials/index.html>`_
ko_kr: `튜토리얼 <tutorials/index.html>`_
ta_in: `பயிற்சிகள் <tutorials/index.html>`_
