Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/tutorials/00_amplitude_estimation.po
Languages: bn_bn, de, es_un, fr_fr, ja, ko, pt_un, ta

source: This page was generated from `docs/tutorials/00_amplitude_estimation.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/00_amplitude_estimation.ipynb`__ থেকে বানানো হয়েছে।
de: Diese Seite wurde aus ` docs/tutorials/00_amplitude_estimation.ipynb ` __ generiert.
es_un: Esta página fue generada a partir de `docs/tutorials/00_amplitude_estimation.ipynb`__.
fr_fr: Cette page a été générée et traduite à partir de `docs/tutorials/00_amplitude_estimation` __.
ja: このページは `docs/tutorials/00_amplitude_estimation.ipynb`__ から生成されました。
ko: 이 페이지는 `docs/tutorials/00_amplitude_estimation.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada a partir de 'docs/tutorials/00_amplitude_estimation.ipynb'__.
ta: இந்தப் பக்கம் `docs/tutorials/00_amplitude_estimation.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Quantum Amplitude Estimation
bn_bn: কোয়ান্টাম বিস্তার অনুমান
de: Quanten-Amplituten-Abschätzung
es_un: Estimación de Amplitud Cuántica
fr_fr: Estimation d'amplitude quantique
ja: 量子振幅推定
ko: 양자 진폭 추정
pt_un: Estimativa de Amplitude Quântica
ta: குவாண்டம் வீச்சு மதிப்பீடு

source: Given an operator :math:`\mathcal{A}` that acts as
bn_bn: প্রদত্ত :math:`\mathcal{A}` অপারেটরটি যেভাবে কাজ করে,
de: Bei einem gegebenen Operator :math:`\mathcal{A}` , der als
es_un: Dado un operador :math:`\mathcal{A}` que actúa como
fr_fr: Etant donné un opérateur :math:`\mathcal{A}` qui agit comme
ja: 演算子 :math:`\mathcal{A}` が以下のように与えられたとします。
ko: 주어진 연산자 :math:`\mathcal{A}` 가 다음과 같이 작용할 때
pt_un: Dado um operador :math:`\mathcal{A}` que age como
ta: ஒரு ஆபரேட்டருக்கு கொடுக்கப்பட்டது :math:`\mathcal{A}` என்று செயல்படுகிறது

source: Quantum Amplitude Estimation (QAE) is the task of finding an estimate for the amplitude :math:`a` of the state :math:`|\Psi_1\rangle`:
bn_bn: কোয়ান্টাম বিস্তার অনুমান (QAE) হল :math:`|\Psi_1\rangle` অবস্থার :math:`a` বিস্তারের জন্য একটি অনুমান খুঁজে বের করার কাজ:
de: Quantum-Amplituden-Estimation (QAE) ist die Aufgabe eine Schätzung für die Amplitude :math:`a` des Zustands :math:`|\Psi_1\rangle` zu finden:
es_un: La Estimación de Amplitud Cuántica (Quantum Amplitude Estimation, QAE) es la tarea de encontrar una estimación de la amplitud :math:`a` del estado :math:`|\Psi_1\rangle`:
fr_fr: L'estimation de l'Amplitude Quantique (QAE pour Quantum Amplitude Estimation) consiste à trouver une estimation pour l'amplitude :math:`a` de l'état :math:`|\Psi_1\rangle`:
ja: 量子振幅推定 (QAE) は 状態 :math:`|\Psi_1\rangle`: の 振幅 :math:`a` を推定するタスクです。
ko: 양자 진폭 추정(Quantum Amplitude Estimation, QAE)은 상태 :math:`|\Psi_1\rangle` 의 진폭 :math:`a` 의 추정치를 찾는 작업이다:
pt_un: Estimativa de Amplitude Quântica (EAQ) é a tarefa de encontrar uma estimativa para a amplitude :math:`a` do estado :math:`|\Psi_1\rangle`:
ta: குவாண்டம் அலைவீச்சு மதிப்பீடு (QAE) என்பது வீச்சுக்கான மதிப்பீட்டை கண்டுபிடிக்கும் பணியாகும் :math:`a` நிலை :math:`|\Psi_1\rangle`:

source: This task has first been investigated by Brassard et al. [1] in 2000 and their algorithm uses a combination of the Grover operator
bn_bn: এই কাজটি প্রথমে ব্রাসার্ড et al. [১] দ্বারা 2000 সালে তদন্ত করা হয়েছে এবং তাদের অ্যালগরিদম গ্রোভার অপারেটরের সংমিশ্রণ ব্যবহার করে
es_un: Esta tarea fue investigada por primera vez por Brassard et al. [1] en 2000 y su algoritmo utiliza una combinación del operador Grover
fr_fr: Cette tâche a d'abord été étudiée par Brassard et al. [1] en 2000 et leur algorithme utilise une combinaison de l'opérateur Grover
ja: このタスクは Brassard et al. [1] in 2000 によって最初に研究されましたが、彼らのアルゴリズムはグローバー演算子の組み合わせを使います。
ko: 이 작업은 2000년에 Brassard et al. [1] 에 의해 먼저 연구되었으며, 해당 알고리즘은 다음의 Grover 연산자
pt_un: Esta tarefa foi investigada pela primeira vez por Brassard et al. [1] em 2000 e seus algoritmos usam uma combinação do operador Grover
ta: இந்த பணியை முதலில் பிராசார்ட் மற்றும் பலர் ஆராய்ந்தனர். [1] 2000 இல் மற்றும் அவற்றின் வழிமுறை க்ரோவர் ஆபரேட்டரின் கலவையைப் பயன்படுத்துகிறது

source: where :math:`\mathcal{S}_0` and :math:`\mathcal{S}_{\Psi_1}` are reflections about the :math:`|0\rangle` and :math:`|\Psi_1\rangle` states, respectively, and phase estimation. However this algorithm, called ``AmplitudeEstimation`` in Qiskit, requires large circuits and is computationally expensive. Therefore, other variants of QAE have been proposed, which we will showcase in this tutorial for a simple example.
bn_bn: যেখানে :math:`\mathcal{S}_0` এবং :math:`\mathcal{S}_{\Psi_1}` এর প্রতিফলন হল :math:`|0\rangle` এবং :math:`|\Psi_1\rangle` অবস্থা, যথাক্রমে, এবং পর্যায় অনুমান। তবে এই অ্যালগরিদম, যাকে Qiskit এর ``AmplitudeEstimation`` বলা হয়, এর জন্য বড় সার্কিটের প্রয়োজন হয় এবং এটি কম্পিউটেশনালভাবে ব্যয়বহুল। অতএব, QAE এর অন্যান্য রূপগুলি প্রস্তাব করা হয়েছে, যা আমরা একটি সহজ উদাহরণের জন্য এই টিউটোরিয়ালে দেখাব।
de: wobei :math:`\mathcal{S}_0`und :math:`\mathcal{S}_{\Psi_1}` Reflexionen über die Zustände :math:`|0\rangle` und :math:`|\Psi_1\rangle` sind, beziehungsweise Phasenschätzung. Dieser Algorithmus, genannt ``AmplitudeEstimation`` benötigt in Qiskit jedoch große Schaltkreise und ist rechnerisch teuer. Daher wurden andere Varianten der QAE vorgeschlagen, die in diesem Tutorial für ein einfaches Beispiel gezeigt werden.
es_un: donde :math:`\mathcal{S}_0` y :math:`\mathcal{S}_{\Psi_1}` son reflexiones sobre los estados :math:`|0\rangle` y :math:`|\Psi_1\rangle`, respectivamente, y la estimación de fase. Sin embargo, este algoritmo, llamado ``AmplitudeEstimation`` en Qiskit, requiere circuitos grandes y es computacionalmente costoso. Por lo tanto, se han propuesto otras variantes de QAE, que mostraremos en este tutorial para un ejemplo simple.
fr_fr: où :math:`\mathcal{S}_0` et :math:`\mathcal{S}_{\Psi_1}` sont des symétries par rapport à :math:`|0\rangle` et :math:`|\Psi_1\rangle` respectivement, et des estimation de phase. Cependant cet algorithme, appelé ``AmplitudeEstimation`` dans Qiskit, nécessite de grands circuits coûteux du point de vue du calcul. Par conséquent, d'autres variantes de QAE ont été proposées, que nous présenterons dans ce tutoriel avec un exemple simple.
ja: ここで :math:`\mathcal{S}_0` と :math:`\mathcal{S}_{\Psi_1}` はそれぞれ :math:`|0\rangle` と :math:`|\Psi_1\rangle` の状態に対する反転です。そして位相推定があります。しかしながら Qiskit で ``AmplitudeEstimation`` と呼ばれるこのアルゴリズムは、大きな回路を必要とし、計算コストが高いです。そのため、QAE の改良が提案されており、このチュートリアルでは簡単な例を紹介します。
ko: (여기서 :math:`\mathcal{S}_0` 와 :math:`\mathcal{S}_{\Psi_1}` 는 각각 :math:`|0\rangle` 과 :math:`|\Psi_1\rangle` 상태의 반사 연산자이다) 와 페이즈 추정의 조합을 사용한다. 그런데 Qiskit에서 ``AmplitudeEstimation`` 로 불리는 이 알고리즘은 큰 회로를 필요로 하고 계산량이 많다. 그러므로 QAE의 다른 변형들이 제안되었고, 이 지침서에서 간단한 예제로 소개할 것이다.
pt_un: onde :math:`\mathcal{S}_0` e :math:`\mathcal{S}_{\Psi_1}` são reflexos dos estados :math:`|0\rangle` e :math:`|\Psi_1\rangle` respectivamente, e estimativa de fase. Contudo estes algoritmos, chamados ``AmplitudeEstimation`` no Qiskit, necessitam de grandes circuitos e são computacionalmente caros. Portanto, outras variantes do EAQ foram propostas, as quais iremos mostrar neste tutorial em um simples exemplo.
ta: எங்கே :math:`\mathcal{S}_0` மற்றும் :math:`\mathcal{S}_{\Psi_1}` என்பது :math:`|0\rangle` மற்றும் :math:`|\Psi_1\rangle` நிலைகள், மற்றும் கட்ட மதிப்பீடு. இருப்பினும், Qiskit டில் ``AmplitudeEstimation`` என்று அழைக்கப்படும் இந்த வழிமுறைக்கு பெரிய சுற்றுகள் தேவை மற்றும் கணக்கீட்டு விலை அதிகம். எனவே, QAE இன் பிற வகைகள் முன்மொழியப்பட்டுள்ளன, இதை ஒரு எளிய எடுத்துக்காட்டுக்காக இந்த டுடோரியலில் காண்பிப்போம்.

source: In our example, :math:`\mathcal{A}` describes a Bernoulli random variable with (assumed to be unknown) success probability :math:`p`:
bn_bn: আমাদের উদাহরণে, :math:`\mathcal{A}` একটি বার্নোলি (Bernoulli) দৈব চল রাশি বর্ণনা করে (অজানা বলে ধরে নেওয়া হয়) সাফল্যের সম্ভাবনা :math:`p`:
de: In unserem Beispiel beschreibt :math:`\mathcal{A}`eine Bernoulli-Zufallsvariable mit (als unbekannt angenommenen) Erfolgswahrscheinlichkeit :math:`p`:
es_un: En nuestro ejemplo, :math:`\mathcal{A}` describe una variable aleatoria de Bernoulli con (se supone que es desconocida) probabilidad de éxito :math:`p`:
fr_fr: Dans notre exemple, :math:`\mathcal{A}` décrit une variable aléatoire de Bernoulli avec la probabilité de succès (supposée inconnue) :math:`p`:
ja: この例では、 :math:`\mathcal{A}` はベルヌーイ確率変数で、(本来は未知の) 成功確率 :math:`p` を持っています。
ko: 이 예에서는 :math:`\mathcal{A}` 가 (모르는 상태로 가정된) 성공 확률 :math:`p` 를 갖는 Bernoulli 임의 변수(random variable)을 기술한다:
pt_un: Em nosso exemplo, :math:`\mathcal{A}` descreve uma variável aleatória de Bernoulli com (presumindo que seja desconhecida) probabilidade de sucesso :math:`p`:
ta: எங்கள் எடுத்துக்காட்டில், :math:`{A}` பெர்னொல்லி சீரற்ற மாறியை (அறியப்படாததாகக் கருதப்படுகிறது) வெற்றி நிகழ்தகவுடன் விவரிக்கிறது :math:`p`:

source: On a quantum computer, we can model this operator with a rotation around the :math:`Y`-axis of a single qubit
bn_bn: একটি কোয়ান্টাম কম্পিউটারে আমরা এই অপারেটরকে একটি একক কিউবিটের :math:`Y` অক্ষের চারদিকে ঘুরিয়ে মডেল করতে পারি
de: Auf einem Quantencomputer können wir diesen Operator mit einer Drehung um die :math:` Y `-Achse eines einzelnen Qubits modellieren
es_un: En una computadora cuántica, podemos modelar este operador con una rotación alrededor del eje :math:`Y` de un solo qubit
fr_fr: Sur un ordinateur quantique, nous pouvons modéliser cet opérateur avec une rotation d'un qubit autour de l'axe :math:`Y`
ja: 量子コンピューターでは、単一量子ビットの :math:`Y` 軸の回転でこの演算子をモデル化することができます。
ko: 양자 컴퓨터에서는 이 연산자를 단일 큐비트의 :math:`Y`-축을 중심으로 한 회전으로 만들 수 있다.
pt_un: Em um computador quântico, nós podemos moldar este operador com a rotação em torno do eixo-:math:`Y de um único qubit
ta: குவாண்டம் கம்ப்யூட்டரில், இந்த ஆபரேட்டரைச் சுற்றி ஒரு சுழற்சியுடன் நாம் மாதிரியாகக் கொள்ளலாம் :math:`Y`ஒற்றை குவிட்டின் அச்சு

source: The Grover operator for this case is particularly simple
bn_bn: এই ক্ষেত্রে গ্রোভার অপারেটর বেশ সহজ
de: Der Grover Operator ist für diesen Fall besonders einfach
es_un: El operador Grover para este caso es particularmente simple
fr_fr: L'opérateur Grover pour ce cas est particulièrement simple
ja: このケースのグローバー演算子は特に単純です
ko: 이 경우에서 Grover 연산자는 특히 간단하다
pt_un: O operador Grover para este caso é particularmente simples
ta: இந்த வழக்கிற்கான க்ரோவர் ஆபரேட்டர் குறிப்பாக எளிமையானது

source: whose powers are very easy to calculate: :math:`\mathcal{Q}^k = R_Y(2k\theta_p)`.
bn_bn: যার ক্ষমতা গণনা করা খুব সহজ: :math:`\mathcal{Q}^k = R_Y(2k\theta_p)`।
de: deren Exponenten sehr einfach zu berechnen sind: :math:`\mathcal{Q}^k = R_Y(2k\theta_p)`.
es_un: cuyas potencias son muy fáciles de calcular: :math:`\mathcal{Q}^k = R_Y(2k\theta_p)`.
fr_fr: dont les puissances sont très faciles à calculer : :math:`\mathcal{Q}^k = R_Y(2k\theta_p)`.
ja: この累乗の計算は非常に簡単で次のようになります: :math:`\mathcal{Q}^k = R_Y(2k\theta_p)`
ko: 제곱도 매우 간단하게 계산할 수 있다: :math:`\mathcal{Q}^k = R_Y(2k\theta_p)`.
pt_un: cujas potências são fáceis de calcular :math:`\mathcal{Q}^k = R_Y(2k\theta_p)`.
ta: இதின் அடுக்குக் கணக்கிடுவது மிகவும் எளிதானது: :math:`\mathcal{Q}^k = R_Y(2k\theta_p)`.

source: We’ll fix the probability we want to estimate to :math:`p = 0.2`.
bn_bn: আমরা যে সম্ভাবনাটি অনুমান করতে চাই তা :math:`p = 0.2` এ ঠিক করব।
es_un: Fijaremos la probabilidad que queremos estimar en :math:`p = 0.2`.
fr_fr: Nous allons fixer la valeur de la probabilité que nous cherchons à estimer à :math:`p = 0,2`.
ja: 推定したい確率を :math:`p = 0.2` に固定します。
ko: 추정할 확률로써 :math:`p = 0.2` 를 고정시킬 것이다.
pt_un: Vamos corrigir a probabilidade que queremos estimar para :math:`p = 0.2`.
ta: நாம் மதிப்பிட விரும்பும் நிகழ்தகவை சரிசெய்வோம் :math:`p = 0.2`.

source: Now we can define circuits for :math:`\mathcal{A}` and :math:`\mathcal{Q}`.
bn_bn: এখন আমরা :math:`\mathcal{A}` এবং :math:`\mathcal{Q}` এর জন্য বর্তনী (সার্কিট) সংজ্ঞায়িত করতে পারি।
de: Jetzt werden die Schaltkreise für :math:`\mathcal{A}` and :math:`\mathcal{Q}` definiert.
es_un: Ahora podemos definir circuitos para :math:`\mathcal{A}` y :math:`\mathcal{Q}`.
ja: これで :math:`\mathcal{A}` と :math:`\mathcal{Q}` を定義できます。
ko: 이제 :math:`\mathcal{A}` 와 :math:`\mathcal{Q}` 의 회로를 정의할 수 있다.
pt_un: Agora nós podemos definir circuitos para :math:`\mathcal{A}` e :math:`\mathcal{Q}`.
ta: இப்போது நாம் சுற்றுகளை வரையறுக்கலாம் :math:`\mathcal{A}` மற்றும் :math:`\mathcal{Q}`.

source: Qiskit’s Amplitude Estimation workflow
bn_bn: Qiskit বিস্তার নির্ণয় কর্মধারা
es_un: Flujo de Trabajo de Estimación de Amplitud de Qiskit
fr_fr: Le workflow d’estimation d'amplitude de Qiskit
ja: Qiskit の振幅推定ワークフロー
ko: Qiskit의 진폭 추정 워크플로우
pt_un: Fluxo de trabalho de Estimativa de Amplitude do Qiskit
ta: Qiskit இன் வீச்சு மதிப்பீடு பணிப்பாய்வு

source: Qiskit implements several QAE algorithms that all derive from the ``AmplitudeEstimator`` interface. In the initializer we specify algorithm specific settings and the ``estimate`` method, which does all the work, takes an ``EstimationProblem`` as input and returns an ``AmplitudeEstimationResult`` object. Since all QAE variants follow the same interface, we can use them all to solve the same problem instance.
bn_bn: Qiskit বেশ কয়েকটি QAE অ্যালগরিদম প্রয়োগ করে যা সমস্ত ``AmplitudeEstimator`` ইন্টারফেস থেকে প্রাপ্ত। ইনিশিয়ালাইজারে আমরা অ্যালগরিদম সুনির্দিষ্ট সেটিংস এবং ``estimate`` পদ্ধতি উল্লেখ করি, যা সমস্ত কাজ করে, একটি ``EstimationProblem`` ইনপুট হিসাবে নেয় এবং একটি ``AmplitudeEstimationResult`` অবজেক্ট প্রদান করে। যেহেতু সব QAE ভেরিয়েন্ট একই ইন্টারফেস অনুসরণ করে, তাই আমরা একই সমস্যা সমাধানের জন্য তাদের সব ব্যবহার করতে পারি।
de: Qiskit implementiert mehrere QAE-Algorithmen, die alle aus der ``AmplitudeEstimator``-Schnittstelle hervor gehen. Im Initialisierungsoperator geben wir Algorithmen-spezifische Einstellungen vor. Die ``estimate`` -Methode übernimmt die ganze Arbeit. Sie nimmt ein ``EstimationProblem`` als Eingabe und gibt ein ``AmplitudeEstimationResult``-Objekt zurück. Da alle QAE-Varianten der gleichen Schnittstelle folgen, können wir sie alle verwenden, um die gleiche Probleminstanz zu lösen.
es_un: Qiskit implementa varios algoritmos QAE que se derivan de la interfaz ``AmplitudeEstimator``. En el inicializador especificamos la configuración específica del algoritmo y el método de ``estimate`` que hace todo el trabajo, toma un ``EstimationProblem`` como entrada y devuelve un objeto ``AmplitudeEstimationResult``. Dado que todas las variantes de QAE siguen la misma interfaz, podemos usarlas todas para resolver la misma instancia de problema.
fr_fr: Qiskit implémente plusieurs algorithmes QAE qui proviennent tous de l'interface ``AmplitudeEstimator``. Dans l'initialisation, nous spécifions des paramètres spécifiques à l'algorithme et la méthode ``estimation``, qui fait tout le travail, prend un ``EstimationProblem`` comme entrée et renvoie un objet ``AmplitudeEstimationResult``. Comme toutes les variantes de QAE suivent la même interface, nous pouvons toutes les utiliser pour résoudre la même instance de problème.
ja: Qiskit はいくつかの QAE のアルゴリズムを全て ``AmplitudeEstimator`` インタフェースを派生して実装します。初期化ではアルゴリズム固有の設定と ``estimate`` メソッドを指定します。このメソッドが全ての処理を行い、 ``EstimationProblem`` を入力にとり、``AmplitudeEstimationResult`` オブジェクトを返します。全ての QAE の実装は同じインタフェースに従うため、同じ問題インスタンスを解くために使えます。
ko: Qiskit은 ``AmplitudeEstimator`` 인터페이스에서 파생되는 여러 QAE 알고리즘들을 구현한다. 초기설정자에서는 알고리즘의 특정 설정을 지정하고, 작업을 전부 수행하는 ``estimate`` 메서드는 ``EstimationProblem`` 을 입력 받아 ``AmplitudeEstimationResult`` 객체를 반환한다. 모든 QAE의 변형들은 같은 인터페이스를 따르기 때문에 같은 문제 인스턴스를 풀 때 모두 사용할 수 있다.
pt_un: Qiskit implementa vários algoritmos QAE que derivam da interface ``AmplitudeEstimator``. No inicializador nós especificamos configurações específicas do algoritmo e o método ``estimate``, o qual faz todo o trabalho, recebe como entrada um ``EstimationProblem`` e retorna um objeto ``AmplitudeEstimationResult``. Já que todas variantes de QAE seguem a mesma interface, nós podemos utilizar todos eles para resolver a mesma instância de problema.
ta: Qiskit பல QAE வழிமுறைகளை செயல்படுத்துகிறது, அவை அனைத்தும் ``AmplitudeEstimator`` இடைமுகத்திலிருந்து பெறப்படுகின்றன. துவக்கத்தில் அல்காரிதம் குறிப்பிட்ட அமைப்புகளைக் குறிப்பிடுகிறோம் மற்றும் அனைத்து வேலைகளையும் செய்யும் ``estimate`` முறை, ``EstimationProblem`` உள்ளீடாக எடுத்து ``AmplitudeEstimationResult`` பொருளை அளிக்கிறது. அனைத்து QAE வகைகளும் ஒரே இடைமுகத்தைப் பின்பற்றுவதால், அவை அனைத்தையும் ஒரே பிரச்சனை நிகழ்வை தீர்க்க நாம் பயன்படுத்தலாம்.

source: Next, we’ll run all different QAE algorithms. To do so, we first define the estimation problem which will contain the :math:`\mathcal{A}` and :math:`\mathcal{Q}` operators as well as how to identify the :math:`|\Psi_1\rangle` state, which in this simple example is just :math:`|1\rangle`.
bn_bn: পরবর্তী, আমরা সমস্ত ভিন্ন QAE অ্যালগরিদম চালাব। এটি করার জন্য, আমরা প্রথমে অনুমানের সমস্যাটি সংজ্ঞায়িত করি যার মধ্যে :math:`\mathcal{A}` এবং :math:`\mathcal{Q}` অপারেটর থাকবে এবং সেইসাথে কিভাবে :math:`|\Psi_1\rangle` অবস্থা চিহ্নিত করতে হবে, যা এই সহজ উদাহরণে শুধু :math:`|1\rangle`।
es_un: A continuación, ejecutaremos todos los diferentes algoritmos de QAE. Para hacerlo, primero definimos el problema de estimación que contendrá los operadores :math:`\mathcal{A}` y :math:`\mathcal{Q}` así como también cómo identificar el estado :math:`|\Psi_1\rangle`, que en este ejemplo simple es :math:`|1\rangle`.
fr_fr: Ensuite, nous allons exécuter les différents algorithmes de QAE. Pour cela, nous définissons d'abord le problème d'estimation qui contiendra les opérateurs :math:`\mathcal{A}` et :math:`\mathcal{Q}` ainsi que comment identifier l'état :math:`|\Psi_1\rangle` qui dans cet exemple simple est juste :math:`|1\rangle`.
ja: 次に、異なる QAE アルゴリズムをすべて実行します。 これを行うには まず、 :math:`\mathcal{A}` と :math:`\mathcal{Q}` 演算子を含む推定問題と、 :math:`|\Psi_1\rangle` 状態を識別する方法を定義します。 この簡単な例では、その状態は :math:`|1\rangle` です。
ko: 다음으로 모든 QAE 알고리즘들을 실행할 것이다. 그러려면 먼저 (간단한 예제로서 :math:`|1\rangle` 인) :math:`|\Psi_1\rangle` 상태를 식별하는 방법뿐만 아니라 :math:`\mathcal{A}` 와 :math:`\mathcal{Q}` 연산자들을 포함할 추정 문제(estimation problem)을 정의한다.
pt_un: A seguir, nós iremos executar diferentes algoritmos QAE. Para tanto, nós primeiro definimos o problema de estimação, o qual irá conter os operadores :math:`\mathcal{A}` e :math:`\mathcal{Q}`, bem como identificar o estado :math:`|\Psi_1\rangle`, que neste exemplo simples é apenas :math:`|1\rangle`.
ta: அடுத்து, அனைத்து வெவ்வேறு QAE வழிமுறைகளையும் இயக்குவோம். இதைச் செய்ய, மதிப்பீடு சிக்கலை முதலில் வரையறுக்கிறோம் :math:`\mathcal{A}` மற்றும் :math:`\mathcal{Q}` ஆபரேட்டர்கள் மற்றும் எப்படி அடையாளம் காண்பது :math:`|\Psi_1\rangle` நிலை, இந்த எளிய எடுத்துக்காட்டில் இது தான் :math:`|1\rangle`.

source: To execute circuits we’ll use Qiskit’s statevector simulator.
bn_bn: সার্কিট চালানোর জন্য আমরা Qiskit এর অবস্থা ভেক্টর বা দিকরাশি সিমুলেটর ব্যবহার করব।
es_un: Para ejecutar circuitos usaremos el simulador de vector de estado de Qiskit.
fr_fr: Pour exécuter des circuits, nous utiliserons le simulateur d'état de Qiskit.
pt_un: Para executar circuitos nós iremos utilizar o simulador de vetor de estado do Qiskit.

source: Canonical AE
bn_bn: ক্যানোনিকাল এ.ই (Canonical AE)
de: Kanonisches AE
es_un: AE Canónica
fr_fr: AE (Amplitude Estimation) canonique
ja: 基本の振幅推定
ko: 정준 AE (Canonical AE)
pt_un: AE Canônico
ta: நியமன AE

source: Now let’s solve this with the original QAE implementation by Brassard et al. [1].
bn_bn: এখন আসুন ব্রাসার্ড এট আল দ্বারা মূল QAE বাস্তবায়নের সাহায্যে এটি সমাধান করি [১]।
es_un: Ahora solucionemos esto con la implementación QAE original de Brassard et al. [1].
fr_fr: Maintenant, résolvons cela avec l'implémentation originale de QAE par Brassard et al. [1].
ja: Brassard et al. [1] によるオリジナル QAE によって解いてみましょう。
ko: 이제 Brassard et al. [1] 에서 구현된 원래 QAE 구현으로 풀어보자.
pt_un: Agora vamos resolver isso com a implementação original do QAE de Brassard et al. [1].
ta: இப்போது பிராசார்ட் மற்றும் பலர் அசல் QAE செயல்படுத்தலுடன் இதைத் தீர்ப்போம். [1].

source: With the algorithm defined, we can call the ``estimate`` method and provide it with the problem to solve.
bn_bn: অ্যালগরিদম সংজ্ঞায়িত করার সাথে, আমরা ``estimate`` পদ্ধতিটি কল করতে পারি এবং এই সমস্যার সমাধান করতে পারি।
de: Mit dem definierten Algorithmus kann die ``estimate``-Methode aufgerufen werden um das Problem zu lösen.
es_un: Con el algoritmo definido, podemos llamar al método ``estimate`` y proporcionarle el problema a resolver.
fr_fr: Avec l'algorithme ainsi défini, nous pouvons appeler la méthode ``estimation`` et lui fournir le problème à résoudre.
ja: 定義されたアルゴリズムで、解くべき問題を与えて、``estimate`` メソッドを呼び出すことができます。
ko: 정의된 알고리즘에서는 ``estimate`` 메서드를 호출하고 문제를 제공하여 풀 수 있다.
pt_un: Com o algoritmo definido, nós podemos invocar o método ``estimate`` e fornecer a ele o problema para resolver.
ta: வரையறுக்கப்பட்ட அல்காரிதம் மூலம், நாம் ``estimate`` முறையை அழைக்கலாம் மற்றும் அதை தீர்க்க சிக்கலை வழங்கலாம்.

source: The estimate is available in the ``estimation`` key:
bn_bn: অনুমানটি ``estimate`` key তে পাওয়া যায়:
de: Die Schätzung ist unter dem ``estimation`` key verfügbar:
es_un: La estimación está disponible en la llave de ``estimation``:
fr_fr: L'estimation est disponible dans la clé ``estimation`` :
ja: 推定値は ``estimation`` キーにあります。
ko: 추정치는 ``estimation`` 키를 통해 얻을 수 있다.
pt_un: A estimativa está disponível na chave ``estimation``:
ta: மதிப்பீடு ``estimation`` விசையில் கிடைக்கிறது:

source: We see that this is not a very good estimate for our target of :math:`p=0.2`! That’s due to the fact the canonical AE is restricted to a discrete grid, specified by the number of evaluation qubits:
bn_bn: আমরা দেখতে পাচ্ছি যে এটি আমাদের লক্ষ্যের জন্য খুব ভাল অনুমান নয় :math:`p = 0.2`! এটি এই কারণে যে ক্যানোনিকাল AE একটি পৃথক গ্রিডের মধ্যে সীমাবদ্ধ, যা মূল্যায়ন কিউবিটের সংখ্যা দ্বারা নির্দিষ্ট করা হয়েছে:
es_un: ¡Vemos que esta no es una estimación muy buena para nuestro objetivo de :math:`p=0.2`! Eso se debe al hecho de que el AE canónico está restringido a una cuadrícula discreta, especificada por el número de qubits de evaluación:
fr_fr: Nous voyons que ce n'est pas une très bonne estimation pour notre objectif de :math:`p=0,2` ! Ceci est dû au fait que l'EA canonique est limitée à une grille discrète, spécifiée par le nombre de qubits d'évaluation:
ja: これは我々のターゲットである :math:`p=0.2` に対してあまり良い見積もりではありません! 基本の振幅推定は評価量子ビット数で指定した離散値に制限されているためです。
ko: 목표였던 :math:`p=0.2` 에 대해 별로 좋은 추정이 아니라는 것을 보았다! 그것은 정준 AE가 계산하는 큐비트 개수로 지정된 이산 그리드에 제한되기 때문이다:
pt_un: Nós observamos que essa não é uma boa estimativa muito boa para nosso alvo de :math:`p=0.2`! Isso se deve ao fato do AE canônico ser restrito a uma rede discreta, especificada pelo número de qubits de avaliação:
ta: எங்கள் இலக்குக்கு இது ஒரு நல்ல மதிப்பீடு அல்ல என்பதை நாங்கள் காண்கிறோம் :math:`p=0.2`! நியமன AE ஒரு தனித்துவமான கட்டத்திற்கு மட்டுப்படுத்தப்பட்டுள்ளது, இது மதிப்பீட்டு குவிட்களின் எண்ணிக்கையால் குறிப்பிடப்பட்டுள்ளது:
