Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/tutorials/00_amplitude_estimation.po
Languages: bn_bn, de, es_un, fr_fr, ja, ko, pt_un, ta

source: To improve the estimate we can interpolate the measurement probabilities and compute the maximum likelihood estimator that produces this probability distribution:
bn_bn: অনুমানের উন্নতির জন্য আমরা পরিমাপের সম্ভাব্যতাকে বিভক্ত করতে পারি এবং এই সম্ভাব্যতা বণ্টন তৈরির সর্বোচ্চ সম্ভাব্যতা নির্ণয়কারীকে হিসাব করতে পারি:
de: Um die Schätzung zu verbessern, können wir die Messwahrscheinlichkeiten interpolieren und die maximale Amplituden-Wahrscheinlichkeitsabschätzung berechnen, welche folgende Wahrscheinlichkeitsverteilung erzeugt:
es_un: Para mejorar la estimación, podemos interpolar las probabilidades de medición y calcular el estimador de máxima verosimilitud que produce esta distribución de probabilidad:
fr_fr: Pour améliorer l'estimation, nous pouvons interpoler les probabilités de mesure et calculer l'estimateur de vraisemblance maximum qui produit cette distribution de probabilité :
ja: 推定値を改善するために測定確率補完して、この確率分布を生成する最尤推定値を計算することができます。
ko: 추정치를 개선하고자 측정 확률을 보간(interpolate) 하고 확률 분포를 생성하는 최우 추정치(maximum likelihood estimator)를 계산한다.
pt_un: Para melhorar a estimativa nós podemos interpolar as probabilidades de medição e computar o estimador de máxima verossimilhança que produz esta distribuição de probabilidade:
ta: மதிப்பீட்டை மேம்படுத்த நாம் அளவீட்டு நிகழ்தகவுகளை இடைமறிக்கலாம் மற்றும் இந்த நிகழ்தகவு விநியோகத்தை உருவாக்கும் அதிகபட்ச சாத்தியக்கூறு மதிப்பீட்டைக் கணக்கிடலாம்:

source: We can have a look at the circuit that AE executes:
bn_bn: আমরা AE যে সার্কিটটি চালায় তার দিকে নজর দিতে পারি:
de: AE führt folgende Schaltung aus:
es_un: Podemos echar un vistazo al circuito que se ejecuta:
fr_fr: Nous pouvons regarder le circuit exécuté par AE :
ja: 振幅推定が実行する回路を見ることができます。
ko: AE가 실행하는 회로를 살펴볼 수 있다:
pt_un: Nós podemos dar uma olhada no circuito que o AE executa:
ta: AE செயல்படுத்தும் சுற்றுவட்டத்தை நாம் பார்க்கலாம்:

source: Iterative Amplitude Estimation
bn_bn: পুনরাবৃত্ত বিস্তার নির্ণয়
de: Iterative Amplitudenschätzung
es_un: Estimación de Amplitud Iterativa
fr_fr: Estimation itérative de l'amplitude
ja: 反復振幅推定
ko: 반복 진폭 추정 (Iterative Amplitude Estimation)
pt_un: Estimativa de Amplitude Iterativa
ta: ஐடரேட்டிவ் வீச்சு மதிப்பீடு

source: See [2].
bn_bn: [২] দেখুন।
de: Siehe [2].
es_un: Véase [2].
fr_fr: Voir [2].
ja: [2] を参照してください。
ko: [2] 를 보라.
pt_un: Veja [2].
ta: பார்க்கவும் [2].

source: The circuits here only consist of Grover powers and are much cheaper!
bn_bn: এখানে সার্কিট শুধুমাত্র গ্রোভার পাওয়ার নিয়ে গঠিত এবং অনেক সস্তা!
de: Die Schaltkreise bestehen hier nur aus Grover Exponenten und sind viel effizienter!
es_un: ¡Los circuitos de aquí solo consisten en potencias de Grover y son mucho más baratos!
fr_fr: Ici les circuits ne sont que des puissances Grover et sont beaucoup moins coûteux !
ja: ここでの回路はグローバーの累乗だけで構成されており、はるかに回路コストが低いです。
ko: 이 회로는 오직 Grover 지수로만 구성되고 훨씬 단순하다!
pt_un: Os circuitos aqui consistem apenas de potências Grover e são muito mais baratos!
ta: இங்குள்ள சுற்றுகள் க்ரோவர் சக்திகளைக் கொண்டுள்ளன மற்றும் மிகவும் மலிவானவை!

source: Maximum Likelihood Amplitude Estimation
bn_bn: সর্বাধিক সম্ভাব্যতা বিস্তার নির্ণয়
de: Maximale Amplituden-Wahrscheinlichkeitsabschätzung
es_un: Estimación de Amplitud de Máxima Verosimilitud
fr_fr: Estimation de l'amplitude à vraisemblance maximale
ja: 最尤振幅推定
ko: 최우 진폭 추정 (Maximum Likelihood Amplitude Estimation)
pt_un: Estimativa de Amplitude de Máxima Verossimilhança
ta: அதிகபட்ச சாத்தியக்கூறு வீச்சு மதிப்பீடு

source: See [3].
bn_bn: [৩] দেখুন।
de: Siehe [3].
es_un: Véase [3].
fr_fr: Voir [3].
ja: [3] を参照してください。
ko: [3] 을 보라.
pt_un: Veja [3].
ta: பார்க்கவும் [3].

source: Faster Amplitude Estimation
bn_bn: দ্রুততর বিস্তার নির্ণয়
de: Beschleunigte Amplitudenabschätzung
es_un: Estimación de Amplitud Más Rápida
fr_fr: Estimation plus rapide de l'amplitude
ja: 高速振幅推定
ko: 빠른 진폭 추정 (Faster Amplitude Estimation)
pt_un: Estimativa Mais Rápida de Amplitude
ta: வேகமான வீச்சு மதிப்பீடு

source: See [4].
bn_bn: [৪] দেখুন।
de: Siehe [4].
es_un: Véase [4].
fr_fr: Voir [4].
ja: [4] を参照してください。
ko: [4] 를 보라.
pt_un: Veja [4].
ta: பார்க்கவும் [4].

source: References
bn_bn: তথ্যসূত্র (রেফারেন্স)
de: Referenzen
es_un: Referencias
fr_fr: Références
ja: 参考文献
ko: 참고문헌
pt_un: Referências
ta: குறிப்புகள்

source: [1] Quantum Amplitude Amplification and Estimation. Brassard et al (2000). https://arxiv.org/abs/quant-ph/0005055
bn_bn: [১] Quantum Amplitude Amplification and Estimation. Brassard et al (2000). https://arxiv.org/abs/quant-ph/0005055
ta: [1] குவாண்டம் வீச்சு பெருக்கம் மற்றும் மதிப்பீடு. Brassard et al (2000). https://arxiv.org/abs/quant-ph/0005055

source: [2] Iterative Quantum Amplitude Estimation. Grinko, D., Gacon, J., Zoufal, C., & Woerner, S. (2019). https://arxiv.org/abs/1912.05559
bn_bn: [২] Iterative Quantum Amplitude Estimation. Grinko, D., Gacon, J., Zoufal, C., & Woerner, S. (2019). https://arxiv.org/abs/1912.05559
ta: [2] ஐட்டரேட்டிவ் குவாண்டம் வீச்சு மதிப்பீடு. Grinko, D., Gacon, J., Zoufal, C., & Woerner, S. (2019). https://arxiv.org/abs/1912.05559

source: [3] Amplitude Estimation without Phase Estimation. Suzuki, Y., Uno, S., Raymond, R., Tanaka, T., Onodera, T., & Yamamoto, N. (2019). https://arxiv.org/abs/1904.10246
bn_bn: [৩] Amplitude Estimation without Phase Estimation. Suzuki, Y., Uno, S., Raymond, R., Tanaka, T., Onodera, T., & Yamamoto, N. (2019). https://arxiv.org/abs/1904.10246
de: [3] Amplitude Estimation without Phase Estimation. Suzuki, Y., Uno, S., Raymond, R., Tanaka, T., Onodera, T., & Yamamoto, N. (2019). https://arxiv.org/abs/1904.1024
ta: [3] கட்ட மதிப்பீடு இல்லாமல் வீச்சு மதிப்பீடு. Suzuki, Y., Uno, S., Raymond, R., Tanaka, T., Onodera, T., & Yamamoto, N. (2019). https://arxiv.org/abs/1904.10246

source: [4] Faster Amplitude Estimation. K. Nakaji (2020). https://arxiv.org/pdf/2003.02417.pdf
bn_bn: [৪] Faster Amplitude Estimation. K. Nakaji (2020). https://arxiv.org/pdf/2003.02417.pdf
ta: [4] வேகமான வீச்சு மதிப்பீடு. K. Nakaji (2020). https://arxiv.org/pdf/2003.02417.pdf

source: \mathcal{A}|0\rangle = \sqrt{1 - p}|0\rangle + \sqrt{p}|1\rangle.
pt_un: hcal{A}|0\rangle = \sqrt{1 - p}|0\rangle + \sqrt{p}|1\rangle.

source: Now we can define define circuits for :math:`\mathcal{A}` and :math:`\mathcal{Q}`.
fr_fr: Nous pouvons à présent définir des circuits pour :math:`\mathcal{A}` et :math:`\mathcal{Q}`.

source: To execute circuits we’ll use ``Sampler``.
ja: 回路を実行するには、 ``Sampler`` を使います。
