Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/tutorials/01_portfolio_optimization.po
Languages: bn_bn, de_de, es_un, ko_kr, ta, vi_vn

source: This page was generated from `docs/tutorials/01_portfolio_optimization.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/01_portfolio_optimization.ipynb`__ -থেকে বানানো হয়েছে।
de_de: Diese Seite wurde aus` docs/tutorials/01_portfolio_optimization.ipynb ` __ generiert.
es_un: Esta página fue generada a partir de `docs/tutorials/01_portfolio_optimization.ipynb`__.
ko_kr: 이 페이지는 `docs/tutorials/01_portfolio_optimization.ipynb`__ 에서 생성되었다.
ta: இந்தப் பக்கம் `docs/tutorials/01_portfolio_optimization.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Portfolio Optimization
bn_bn: পোর্টফোলিও অপটিমাইজেশন
de_de: Portfolio-Optimierung
es_un: Optimización de Cartera
ko_kr: 포트폴리오 최적화
ta: போர்ட்ஃபோலியோ உகப்பாக்கம்

source: Introduction
bn_bn: ভূমিকা
de_de: Einführung
es_un: Introducción
ko_kr: 소개
ta: முன்னுரை

source: This tutorial shows how to solve the following mean-variance portfolio optimization problem for :math:`n` assets:
bn_bn: এই টিউটোরিয়াল দেখায় কীভাবে :math:`n` সম্পদের জন্য নীচের মীন-ভ্যারিয়্যান্স পোর্টফোলিও অপ্টিমাইজেশান সমস্যাটি সমাধান করা যায়:
de_de: Dieses Tutorial zeigt, wie das folgende Problem der Durchschnittvarianz-Portfoliooptimierung für :math:`n` Assets gelöst werden kann:
es_un: Este tutorial muestra cómo resolver el siguiente problema de optimización de cartera de varianza media para :math:`n` activos:
ko_kr: 이 학습서는 :math:`n` 개의 자산들에 대한 평균-분산 포트폴리오 최적화 문제를 해결하는 방법을 보여준다.
ta: இந்த டுடோரியல் பின்வரும் :math:`n` சராசரி-மாறுபாடு போர்ட்ஃபோலியோ தேர்வுமுறை சிக்கலை எவ்வாறு தீர்ப்பது என்பதைக் காட்டுகிறது:
vi_vn: Hướng dẫn này cho phép giải quyết vấn đề tối ưu hóa phương sai trung bình danh mục vốn đầu tư cho :math:`n` tài sản:

source: where we use the following notation:
bn_bn: যেখানে আমরা নিম্নলিখিত স্বরলিপি ব্যবহার করি:
de_de: in dem folgende Notation verwendet wird:
es_un: donde usamos la siguiente notación:
ko_kr: 여기서 다음과 같은 표기법을 사용한다:
ta: பின்வரும் குறியீட்டை நாங்கள் பயன்படுத்துகிறோம்:
vi_vn: trong đó chúng ta sử dụng ký hiệu sau:

source: :math:`x \in \{0, 1\}^n` denotes the vector of binary decision variables, which indicate which assets to pick (:math:`x[i] = 1`) and which not to pick (:math:`x[i] = 0`),
bn_bn: :math:`x \in \{0, 1\}^n` বাইনারি সিদ্ধান্ত ভেরিয়েবলের ভেক্টরকে বোঝায়, যা কোন সম্পদ বাছাই করে তা নির্দেশ করে (:math:`x[i] = 1`) এবং কোনটি বেছে নেবে না (:math:`x[i] = 0`),
de_de: :math:`x \in \{0, 1\}^n` bezeichnet den Vektor der binären Entscheidungsvariablen, die angeben, welche Assets ausgewählt (:math:`x[i] = 1`) und welche nicht ausgewählt werden sollen (:math:`x[i] = 0`),
es_un: :math:`x \in \{0, 1\}^n` denota el vector de variables de decisión binarias, que indican qué activos elegir (:math:`x[i] = 1`) y cuáles no elegir (:math:`x[i] = 0`),
ko_kr: :math:`x \in \{0, 1\}^n` 은 어떤 자산을 선택하거나 (:math:`x[i] = 1`) 선택하지 않는 (:math:`x[i] = 0`) 것을 나타내는 이진 의사 결정 변수의 벡터를 표기한다.
ta: :math:`x \in \{0, 1\}^n` இல் பைனரி முடிவு மாறிகளின் திசையனைக் குறிக்கிறது, இது எந்த சொத்துக்களை எடுக்க வேண்டும் என்பதைக் குறிக்கிறது (:math:`x[i] = 1`) மற்றும் எதை எடுக்கக்கூடாது (:math:`x[i] = 0`),
vi_vn: :math:`x \in \{0, 1\}^n` thể hiện véc-tơ của các biến quyết định nhị phân, thứ mà chỉ ra tài sản nào nên chọn (:math:`x[i] = 1`) và không nên chọn (:math:`x[i] = 0`),

source: :math:`\mu \in \mathbb{R}^n` defines the expected returns for the assets,
bn_bn: :math:`\mu \in \mathbb{R}^n` সম্পদের প্রত্যাশিত রিটার্ন সংজ্ঞায়িত করে,
de_de: :math:`\mu \in \mathbb{R}^n` definiert die erwarteten Erlöse der Assets,
es_un: :math:`\mu \in \mathbb{R}^n` define los rendimientos esperados de los activos,
ko_kr: :math:`\mu \in \mathbb{R}^n` 은 자산들의 예상 수익을 정의한다.
ta: :math:`\mu \in \mathbb{R}^n` என்பது எதிர்பார்க்கப்படும் தரவுகளை வரையறுக்கிறது,
vi_vn: :math:`\mu \in \mathbb{R}^n` được định nghĩa là kết quả trông đợi cho các tài sản,

source: :math:`\Sigma \in \mathbb{R}^{n \times n}` specifies the covariances between the assets,
bn_bn: :math:`\Sigma \in \mathbb{R}^{n \times n}` সম্পদের মধ্যে সমবায়িকাগুলি নির্দিষ্ট করে,
de_de: :math:`\Sigma \in \mathbb{R}^{n \times n}` gibt die Kovarianzen zwischen den Assets an,
es_un: :math:`\Sigma \in \mathbb{R}^{n \times n}` especifica las covarianzas entre los activos,
ko_kr: :math:`\Sigma \in \mathbb{R}^{n \times n}` 는 자산들 사이의 공분산(covariance)을 나타낸다.
ta: :math:`\Sigma \in \mathbb{R}^{n \times n}` என்பது தரவுகளுக்கு இடையிலான ஒற்றுமையைக் குறிப்பிடுகிறது,
vi_vn: :math:`\Sigma \in \mathbb{R}^{n \times n}` chỉ hiệp phương sai phương sai giữa hai tài sản,

source: :math:`q > 0` controls the risk appetite of the decision maker,
bn_bn: :math:`q > 0` সিদ্ধান্ত গ্রহণকারীর ঝুঁকি ক্ষুধা নিয়ন্ত্রণ করে,
de_de: :math:`q > 0` kontrolliert die Risikoaversität des Entscheiders
es_un: :math:`q > 0` controla el apetito por el riesgo de quien toma las decisiones,
ko_kr: :math:`q > 0` 은 의사 결정자의 리스크 선호를 제어한다.
ta: :math:`q > 0` முடிவெடுப்பவரின் ஆபத்து பசியைக் கட்டுப்படுத்துகிறது,
vi_vn: :math:`q>0` điều khiển độ cần rủi ro của bộ ra quyết định,

source: and :math:`B` denotes the budget, i.e. the number of assets to be selected out of :math:`n`.
bn_bn: এবং :math: `B` দ্বারা বোঝায় বাজেটকে, অর্থাৎ :math: `n` থেকে নির্বাচিত হওয়া সম্পদের সংখ্যাকে।
de_de: und :math:`B` enthält das Budget, also die Anzahl der ausgewählten Assets aus :math:`n`.
ko_kr: 그리고 :math:`B` 는 예산, 즉 :math:`n` 중에서 선택할 수 있는 자산의 수를 의미한다.
vi_vn: và :math:`B` thể hiện khoản tiền, tức số tài sản được chọn từ :math:`n`.

source: We assume the following simplifications: - all assets have the same price (normalized to 1), - the full budget :math:`B` has to be spent, i.e. one has to select exactly :math:`B` assets.
bn_bn: আমরা নিম্নোক্ত সরলীকরণগুলি ধরে নিই: - সমস্ত সম্পদের একই দাম রয়েছে (1 এ নরমালাইযকৃত ), - সম্পূর্ণ বাজেট :math: `B` যা ব্যয় করতে হবে, অর্থাত্ একজন ব্যক্তিকে অবিকল :math: ` B` সম্পদ নির্বাচন করতে হবে।
de_de: Wir setzen folgende Vereinfachungen voraus: - alle Assets haben den gleichen Preis (normiert auf 1), - das volle Budget :math:`B` muss ausgegeben werden, also genau :math:`B` Assets müssen ausgewählt werden.
ko_kr: 다음과 같은 단순화를 가정한다: - 모든 자산은 동일한 가격을 가지고 있다 (1로 정규화됨), - 전체 예산 :math:`B` 를 소비해야 한다. 즉, 정확히 :math:`B` 개의 자산을 선택해야 한다.

source: The equality constraint :math:`1^T x = B` is mapped to a penalty term :math:`(1^T x - B)^2` which is scaled by a parameter and subtracted from the objective function. The resulting problem can be mapped to a Hamiltonian whose ground state corresponds to the optimal solution. This notebook shows how to use the Variational Quantum Eigensolver (VQE) or the Quantum Approximate Optimization Algorithm (QAOA) to find the optimal solution for a given set of parameters.
bn_bn: সাম্যতার সীমাবদ্ধতা :math: `1^T x = B` একটি পেনাল্টি শর্ত :math:` (1^T x - B)^2`-তে ম্যাপ করা হয় যা একটি পরামিতি দ্বারা স্কেল করা হয় এবং নৈর্ব্যক্তিক অন্বয় (অব্জেক্টিভ ফাংশন) থেকে বিয়োগ করা হয়। ফলস্বরূপ প্রাপ্ত সমস্যাটি হ্যামিলটোনিয়ানে ম্যাপ করা যেতে পারে যার ভিত্তি/ভূমি মান বা অবস্থা সর্বোত্তম সমাধানের সাথে মিলে যায়। এই নোটবুকটি দেখায় যে কীভাবে ভ্যারিয়েশনাল কোয়ান্টাম আইজেনসলভার (ভিকিউই) বা কোয়ান্টাম অ্যাপ্রক্সিমেইট অপ্টিমাইজেশন অ্যালগরিদম (কিউএওএ) ব্যবহার করে কোনও নির্দিষ্ট পরামিতি সেটের জন্য অনুকূল সমাধান সন্ধান করা যায় ।
de_de: Die Bedingung :math:`1^T x = B` wird einem Strafterm :math:`(1^T x - B)^2` zugeordnet, der durch einen Parameter skaliert und von der Zielfunktion abgezogen wird. Das daraus resultierende Problem kann einem Hamiltonian zugeordnet werden, dessen Grundzustand der optimalen Lösung entspricht. Dieses Notizbuch zeigt, wie man mit dem Variational Quantum Eigensolver (VQE) oder dem Quantum Approximate Optimization Algorithmus (QAOA) die optimale Lösung für einen bestimmten Satz von Parametern findet.
ko_kr: 주어진 등식 :math:`1^T x = B` 는 매개변수에 의해 스케일링되고 목적 함수로부터 차감되는 페널티 항 :math:`(1^T x - B)^2` 에 매핑된다. 여기서 도출되는 문제는 바닥 상태가 최적의 해에 해당하는 해밀토니안에 매핑될 수 있다. 이 지침서는 VQE (Variational Quantum Eigensolver) 또는 QAOA (Quantum Approximate Optimization Algorithm)를 사용하여 지정된 매개변수 집합에 대한 최적의 솔루션을 찾는 방법을 보여준다.

source: Experiments on real quantum hardware for this problem are reported for instance in the following paper: `Improving Variational Quantum Optimization using CVaR. Barkoutsos et al. 2019. <https://arxiv.org/abs/1907.04769>`__
bn_bn: এই সমস্যার জন্য বাস্তব কোয়ান্টাম হার্ডওয়্যারের পরীক্ষাগুলি নিম্নলিখিত গবেষণাপত্রে আলোচিত হয়েছে: `Improving Variational Quantum Optimization using CVaR. Barkoutsos et al. 2019. <https://arxiv.org/abs/1907.04769>`__
de_de: Experimente auf realer Quantenhardware für dieses Problem werden beispielsweise in folgender Arbeit diskutiert: `Improving Variational Quantum Optimization using CVaR. Barkoutsos et al. 2019. <https://arxiv.org/abs/1907.04769>` __
ko_kr: 이 문제에 대해 실제 양자 하드웨어에서 행한 실험들은 다음의 논문에서 발표되었다: `Improving Variational Quantum Optimization using CVaR. Barkoutsos et al. 2019. <https://arxiv.org/abs/1907.04769>`__

source: [Optional] Setup token to run the experiment on a real device
bn_bn: [Optional] একটি বাস্তব ডিভাইসে পরীক্ষা চালানোর জন্য কুপন (টোকেন) সেটআপ করুন
de_de: [Optional] Einrichten eines Tokens zur Durchführung des Experiments auf einem echten Quantumgerät
es_un: [Opcional] Configurar un token para ejecutar el experimento en un dispositivo real
ko_kr: [Optional] 실제 장치에서 실험을 실행하기 위한 토큰 설정
ta: [Optional] உண்மையான சாதனத்தில் சோதனையை இயக்க டோக்கனை அமைக்கவும்
vi_vn: [Optional] Thiết lập để chạy thử nghiệm trên một thiết bị thật

source: If you would like to run the experiment on a real device, you need to setup your account first.
bn_bn: আপনি যদি সত্যিকারের ডিভাইসে পরীক্ষা চালাতে চান তবে আপনাকে প্রথমে আপনার অ্যাকাউন্টটি সেটআপ করতে হবে।
de_de: Wenn das Experiment auf einem echten Quantencomputer ausgeführt werden soll, muss zunächst ein Konto eingerichtet werden.
es_un: Si deseas ejecutar el experimento en un dispositivo real, primero debes configurar tu cuenta.
ko_kr: 실제 장치에서 실험을 실행하려면 먼저 계정을 설정해야 한다.
ta: நீங்கள் ஒரு உண்மையான சாதனத்தில் சோதனையை இயக்க விரும்பினால், முதலில் உங்கள் கணக்கை அமைக்க வேண்டும்.
vi_vn: Nếu bạn muốn thực hiện thí nghiệm trên một thiết bị thực, bạn cần thiết lập tài khoản trước.

source: Note: If you do not store your token yet, use ``IBMQ.save_account('MY_API_TOKEN')`` to store it first.
bn_bn: টীকা: আপনি যদি এখনও আপনার কুপন (টোকেন) সংরক্ষণ করে না রাখেন, তবে ``IBMQ.save_account('MY_API_TOKEN')`` ব্যবহার করে প্রথমে তা সংরক্ষণ করে নিন।
de_de: Hinweis: Falls der Token noch nicht gespeichert wurde, benutze zuerst ``IBMQ.save_account('MY_API_TOKEN')`` für die Speicherung.
es_un: Nota: Si aún no almacenas tu token, usa ``IBMQ.save_account('MY_API_TOKEN')`` para almacenarlo primero.
ko_kr: 참고: 아직 토큰을 저장하지 않은 경우 ``IBMQ.save_account('MY_API_TOKEN')`` 을 사용하여 저장한다.
ta: குறிப்பு: உங்கள் டோக்கனை நீங்கள் இன்னும் சேமிக்கவில்லை என்றால், அதை முதலில் சேமிக்க ``IBMQ.save_account('MY_API_TOKEN')`` ஐப் பயன்படுத்தவும்.
vi_vn: Lưu ý: Nếu bạn chưa lưu trữ token của bạn, thì sử dụng ``IBMQ.save_account('MY_API_TOKEN')`` để lưu nó trước.

source: Define problem instance
bn_bn: সমস্যা দৃষ্টান্ত (ইনস্ট্যান্স) সংজ্ঞায়িত করুন
de_de: Probleminstanz definieren
es_un: Definir la instancia del problema
ko_kr: 문제 인스턴스 정의
ta: சிக்கல் உதாரணத்தை வரையறுக்கவும்
vi_vn: Định nghĩa thực thể của vấn đề

source: Here an Operator instance is created for our Hamiltonian. In this case the paulis are from an Ising Hamiltonian translated from the portfolio problem. We use a random portfolio problem for this notebook. It is straight-forward to extend this to using real financial data as illustrated here: `Loading and Processing Stock-Market Time-Series Data <11_time_series.ipynb>`__
bn_bn: আমাদের হ্যামিলটনীয়ানের জন্য এখানে একটি অপারেটর উদাহরণ তৈরি করা হয়েছে। এক্ষেত্রে পলিসগুলি পোর্টফোলিও সমস্যা থেকে অনূদিত আইসিং হ্যামিলটোনিয়ান থেকে এসেছে। এই নোটবুকের জন্য আমরা একটি এলোমেলো পোর্টফোলিও সমস্যা ব্যবহার করি। বাস্তব অর্থনৈতিক ডাটা ব্যবহার করে একে বিস্তৃত করা বেশ সোজা-সাপ্টা, যেমনটা দেখানো হয়েছে এখানটায়: `Loading and Processing Stock-Market Time-Series Data <11_time_series.ipynb>`__
de_de: Hier wird beispielsweise ein Operator für unsere Hamilton-Funktion generiert. In diesem Fall sind die Pauli-Gates von einer Ising Hamilton-Funktion aus dem Problemportfolio übersetzt. Wir benutzen ein zufälliges bestehendes Problem für dieses Notebook. Dieses kann wie hier dargestellt: `Loading and Processing Stock-Market Time-Series Data <11_time_series.ipynb>`__ einfach um reale Finanzdaten erweitert werden
es_un: Aquí se crea una instancia de Operator para nuestro Hamiltoniano. En este caso, los paulis son de un Hamiltoniano de Ising traducido del problema de cartera. Usamos un problema de cartera aleatorio para este cuaderno. Es sencillo extender esto al uso de datos financieros reales como se ilustra aquí: `Carga y Procesamiento de Datos de Series Temporales del Mercado de Valores <11_time_series.ipynb>`__
ko_kr: 여기에 해밀토니안에 대한 Operator 인스턴스가 생성되었다. 이 경우, Pauli들은 포트폴리오 문제에 해당하는 이징 해밀토니안(Ising Hamiltonian)에서부터 나왔다. 이 노트북에선 무작위 포트폴리오를 사용한다. 실제 재무 데이터를 사용하여 이를 확장하는 것은 `Loading and Processing Stock-Market Time-Series Data <11_time_series.ipynb>`__ 에서 볼수 있다.
ta: இங்கே எங்கள் ஹாமில்டோனியனுக்காக ஒரு ஆபரேட்டர் உதாரணம் உருவாக்கப்பட்டது. இந்த வழக்கில் பவுலிஸ் போர்ட்ஃபோலியோ சிக்கலில் இருந்து மொழிபெயர்க்கப்பட்ட ஐசிங் ஹாமில்டோனியனிலிருந்து வந்தவர்கள். இந்த நோட்புக்கு ஒரு சீரற்ற போர்ட்ஃபோலியோ சிக்கலைப் பயன்படுத்துகிறோம். இங்கே விளக்கப்பட்டுள்ளபடி உண்மையான நிதித் தரவைப் பயன்படுத்த இதை நீட்டிப்பது நேராக முன்னோக்கி உள்ளது:`Loading and Processing Stock-Market Time-Series Data <11_time_series.ipynb>`__

source: We define some utility methods to print the results in a nice format.
bn_bn: ফলাফলগুলি সুন্দর বিন্যাসে মুদ্রণের জন্য আমরা কিছু উপযোগী কার্যপ্রণালী সংজ্ঞায়িত করি।
de_de: Wir definieren einige Hilfsmethoden, um die Ergebnisse in einem schönen Format auzugeben.
es_un: Definimos algunos métodos de utilidad para imprimir los resultados en un formato agradable.
ko_kr: 결과를 적절한 형태로 보여주고자 몇 가지 유용한 메서드를 정의한다.
ta: முடிவுகளை நல்ல வடிவத்தில் அச்சிட சில பயன்பாட்டு முறைகளை நாங்கள் வரையறுக்கிறோம்.
vi_vn: Chúng tôi xác định một số phương pháp tiện ích để in các kết quả theo định dạng tốt.

source: NumPyMinimumEigensolver (as a classical reference)
bn_bn: NumPyMinimumEigensolver (একটি ধ্রুপদী তথ্যসূত্র (রেফারেন্স) হিসাবে)
de_de: NumPyMinimumEigensolver (als klassischen Verweis)
es_un: NumPyMinimumEigensolver (como una referencia clásica)
ko_kr: NumPyMinimumEigensolver (고전적 참고치로서)
ta: NumPyMinimumEigensolver (ஒரு கிளாசிக்கல் குறிப்பாக)
vi_vn: NumPyimimumEigensolver (như một tham khảo cổ điển)

source: Lets solve the problem. First classically…
bn_bn: সমস্যাটির সমাধান করা যাক। প্রথমে ধ্রুপদী পদ্ধতিতে…
de_de: Lasst uns das Problem zunächst klassisch lösen…
ko_kr: 문제를 풀어보자. 먼저 고전적으로…
vi_vn: Hãy cùng giải bài toán này. Đầu tiên một cách cổ điển…

source: We can now use the Operator we built above without regard to the specifics of how it was created. We set the algorithm for the NumPyMinimumEigensolver so we can have a classical reference. The problem is set for ‘ising’. Backend is not required since this is computed classically not using quantum computation. The result is returned as a dictionary.
bn_bn: কীভাবে গঠন বা নির্মাণ (বিল্ড) হয়েছিল তার নির্দিষ্টতা বিবেচনা না করেই আমরা এখন উপরে নির্মিত অপারেটরটি ব্যবহার করতে পারি। আমরা NumPyMinimumEigensolver এর জন্য অ্যালগরিদম সেট করেছি যাতে আমাদের একটি শাস্ত্রীয় তথ্যসূত্র (রেফারেন্স) থাকতে পারে। সমস্যাটি 'ইজিং' এর জন্য সেট করা আছে।কোয়ান্টাম কম্পিউটেশনের পরিবর্তে, ধ্রুপদিভাবে হিসেব করা হয় বলে এখানে ব্যাকএন্ডের প্রয়োজন হয় না। ফলাফলটি ডিকশনারি হিসাবে ফিরে আসে
ko_kr: 어떻게 만들어졌는지와는 상관 없이 위에서 구축한 Operator를 사용할 수 있다. NumPyMinimumEigensolver에 대한 알고리즘을 설정하여 고전적 참고치를 얻을 수 있다. 문제는 ‘ising’으로 정해져 있다. 이것은 양자 연산을 사용하지 않고 고전적으로 계산되기 때문에 백엔드가 필요하지 않다. 결과는 사전 타입으로 반환된다.

source: Solution using VQE
bn_bn: ভি কিউ ই ব্যবহার করে সমাধান
de_de: Lösung mit VQE
ko_kr: VQE를 사용한 해
vi_vn: Giải pháp sử dụng VQE

source: We can now use the Variational Quantum Eigensolver (VQE) to solve the problem. We will specify the optimizer and variational form to be used.
bn_bn: সমস্যাটি সমাধানের জন্য আমরা এখন ভেরিয়েশনাল কোয়ান্টাম আইজেনসলভার (ভিকিউই) ব্যবহার করতে পারি। ব্যবহারের জন্য আমরা অপটিমাইজার (অনুকূলায়ক) এবং পরিবর্তনশীল (ভ্যারিয়েশনাল) ফর্মটি নির্দিষ্ট করব।
de_de: Wir nutzen den Variational-Quantum-Eigensolver (VQE) um das Problem zu lösen und legen die zu nutzenden Optimierer und variationale Form fest.
ko_kr: 이제 VQE를 사용하여 문제를 푼다. 사용할 최적자 및 변분 형태를 지정한다.
vi_vn: Bây giờ chúng ta có thể sử dụng Phương án Quantum Eigensolver (VQE) để giải bài toán. Chúng tôi sẽ xác định bộ tối ưu và dạng biến sẽ được sử dụng.

source: Note: You can switch to different backends by providing the name of backend.
bn_bn: টীকা: আপনি ব্যাকএন্ডের নাম সরবরাহ করে বিভিন্ন ব্যাকএন্ডে পরিবর্তন করতে পারেন।
ko_kr: 참고: 백엔드의 이름을 설정하여 다른 백엔드로 전환할 수 있다.
vi_vn: Lưu ý: Bạn có thể chuyển sang phần sau khác nhau bằng cách cung cấp tên của phần sau.

source: Solution using QAOA
bn_bn: কিউএওএ (QAOA) ব্যবহার করে সমাধান
de_de: Lösung mit QAOA
ko_kr: QAOA를 사용한 해
vi_vn: Giải pháp sử dụng QAOA

source: We also show here a result using the Quantum Approximate Optimization Algorithm (QAOA). This is another variational algorithm and it uses an internal variational form that is created based on the problem.
bn_bn: আমরা এখানে কোয়ান্টাম অ্যাপ্রক্সিমেইট অপ্টিমাইজেশন অ্যালগরিদম কিউএওএ (QAOA) ব্যবহার করে পাওয়া একটি ফলাফলও দেখাই। এটি আরেকটি পরিবর্তনশীল (ভ্যারিয়েশনাল) অ্যালগরিদম এবং এটি ব্যবহার করে সমস্যার ভিত্তিতে তৈরি একটি অভ্যন্তরীণ পরিবর্তনশীল (ভ্যারিয়েশনাল) ফর্ম।
de_de: Hier ist eine Lösung unter Verwendung des Quantum Approximate Optimization Algorithm (QAOA) gezeigt. Das ist ein anderer variationale Algorithmus, der eine interne variationale Form benutzt, die auf Basis des Problems erstellt wird.
ko_kr: QAOA를 사용한 결과 또한 보여 준다. 이는 다른 변분 알고리즘이며 문제를 기반으로 만들어지는 내부 변분 형태를 사용한다.
vi_vn: Chúng tôi cũng cho thấy kết quả là sử dụng thuật toán tối ưu hóa lượng tử (QAOA). Đây là một thuật toán biến khác và nó sử dụng một dạng biến nội bộ được tạo ra dựa trên vấn đề.

source: and :math:`B` denotes the budget, i.e. the number of assets to be selected out of :math:`n`.
es_un: y :math:`B` denota el presupuesto, es decir, el número de activos a ser seleccionados de :math:`n`.
ta: மற்றும் :math:`B` என்பது பட்ஜெட்டைக் குறிக்கிறது, அதாவது :math:`n` இலிருந்து தேர்ந்தெடுக்கப்பட வேண்டிய சொத்துக்களின் எண்ணிக்கை.

source: We assume the following simplifications: - all assets have the same price (normalized to 1), - the full budget :math:`B` has to be spent, i.e. one has to select exactly :math:`B` assets.
es_un: Suponemos las siguientes simplificaciones: - todos los activos tienen el mismo precio (normalizado a 1), - el presupuesto completo :math:`B` tiene que gastarse, es decir, uno tiene que seleccionar exactamente :math:`B` activos.
ta: பின்வரும் எளிமைப்படுத்தல்களை நாங்கள் கருதுகிறோம்: - அனைத்து சொத்துகளுக்கும் ஒரே விலை (1க்கு இயல்பாக்கப்பட்டது), - முழு பட்ஜெட் :math:`B` செலவழிக்கப்பட வேண்டும், அதாவது ஒருவர் சரியாக :math:`B` சொத்துக்களை தேர்ந்தெடுக்க வேண்டும்.

source: The equality constraint :math:`1^T x = B` is mapped to a penalty term :math:`(1^T x - B)^2` which is scaled by a parameter and subtracted from the objective function. The resulting problem can be mapped to a Hamiltonian whose ground state corresponds to the optimal solution. This notebook shows how to use the Sampling Variational Quantum Eigensolver (``SamplingVQE``) or the Quantum Approximate Optimization Algorithm (``QAOA``) to find the optimal solution for a given set of parameters.
es_un: La restricción de igualdad :math:`1^T x = B` se mapea a un término de penalización :math:`(1^T x - B)^2` que se escala mediante un parámetro y se resta de la función objetivo. El problema resultante se puede mapear a un Hamiltoniano cuyo estado fundamental corresponde a la solución óptima. Este cuaderno muestra cómo usar el Solucionador Propio Variacional Cuántico de Muestreo (Sampling Variational Quantum Eigensolver, ``SamplingVQE``) o el Algoritmo Cuántico de Optimización Aproximada (Quantum Approximate Optimization Algorithm, ``QAOA``) para encontrar la solución óptima para un conjunto de parámetros dado.
ta: சமத்துவக் கட்டுப்பாடு :math:`1^T x = B` என்பது ஒரு பெனால்டி வார்த்தைக்கு மேப் செய்யப்படுகிறது :math:`(1^T x - B)^2` இது ஒரு அளவுருவால் அளவிடப்பட்டு, புறநிலை செயல்பாட்டிலிருந்து கழிக்கப்படுகிறது. இதன் விளைவாக வரும் சிக்கலை ஒரு ஹாமில்டோனியனுக்கு வரைபடமாக்க முடியும், அதன் தரை நிலை உகந்த தீர்வுக்கு ஒத்திருக்கிறது. கொடுக்கப்பட்ட அளவுருக்களுக்கு உகந்த தீர்வைக் கண்டறிய, மாதிரி மாறுபாடு குவாண்டம் ஈஜென்சொல்வர் (``SamplingVQE``) அல்லது குவாண்டம் தோராயமான மேம்படுத்தல் அல்காரிதம் (``QAOA``) ஆகியவற்றை எவ்வாறு பயன்படுத்துவது என்பதை இந்த குறிப்பேடு காட்டுகிறது.

source: Experiments on real quantum hardware for this problem are reported for instance in the following paper: `Improving Variational Quantum Optimization using CVaR. Barkoutsos et al. 2019. <https://arxiv.org/abs/1907.04769>`__
es_un: Experimentos en hardware cuántico real para este problema se informan, por ejemplo, en el siguiente artículo: `Improving Variational Quantum Optimization using CVaR. Barkoutsos et al. 2019. <https://arxiv.org/abs/1907.04769>`__
ta: இந்தச் சிக்கலுக்கான உண்மையான குவாண்டம் வன்பொருளின் மீதான சோதனைகள் பின்வரும் தாளில் தெரிவிக்கப்பட்டுள்ளன: `CVaR ஐப் பயன்படுத்தி மாறுபாடு குவாண்டம் மேம்படுத்தல் மேம்படுத்துதல். Barkoutsos மற்றும் பலர். 2019. <https://arxiv.org/abs/1907.04769>`__

source: Lets solve the problem. First classically...
es_un: Resolvamos el problema. Primero clásicamente...
ta: சிக்கலை தீர்க்கலாம். முதலில் செம்மொழியாக...

source: We can now use the Operator we built above without regard to the specifics of how it was created. We set the algorithm for the NumPyMinimumEigensolver so we can have a classical reference. The problem is set for 'ising'. Backend is not required since this is computed classically not using quantum computation. The result is returned as a dictionary.
es_un: Ahora podemos usar el Operator que construimos anteriormente sin tener en cuenta los detalles de cómo fue creado. Configuramos el algoritmo para el NumPyMinimumEigensolver para que podamos tener una referencia clásica. El problema está configurado para 'ising'. No se requiere de un backend, ya que se calcula de forma clásica sin utilizar computación cuántica. El resultado se devuelve como un diccionario.
ta: இப்போது நாம் மேலே கட்டமைத்த ஆபரேட்டரைப் பயன்படுத்தலாம், அது எவ்வாறு உருவாக்கப்பட்டது என்பதற்கான பிரத்தியேகங்களைப் பொருட்படுத்தாமல். NumPyMinimumEigensolverக்கான அல்காரிதத்தை நாங்கள் அமைத்துள்ளோம், எனவே நாம் ஒரு கிளாசிக்கல் குறிப்பைப் பெறலாம். பிரச்சனை 'ஐசிங்' க்கு அமைக்கப்பட்டுள்ளது. இது குவாண்டம் கணக்கீட்டைப் பயன்படுத்தாமல் பாரம்பரியமாக கணக்கிடப்படுவதால் பின்தளம் தேவையில்லை. முடிவு அகராதியாகத் திரும்பியது.

source: Solution using ``SamplingVQE``
es_un: Solución usando ``SamplingVQE``
ta: ``SamplingVQE`` பயன்படுத்தி தீர்வு கண்டறிதல்

source: We can now use the Sampling Variational Quantum Eigensolver (``SamplingVQE``) to solve the problem. We will specify the optimizer and variational form to be used.
es_un: Ahora podemos usar el Solucionador Propio Variacional Cuántico de Muestreo (Sampling Variational Quantum Eigensolver, ``SamplingVQE``) para resolver el problema. Especificaremos el optimizador y la forma variacional que se utilizará.
ta: சிக்கலைத் தீர்க்க நாம் இப்போது மாதிரி மாறுபாடு குவாண்டம் ஈஜென்சோல்வரை (``SamplingVQE``) பயன்படுத்தலாம். பயன்படுத்தப்படும் ஆப்டிமைசர் மற்றும் மாறுபாடு படிவத்தை நாங்கள் குறிப்பிடுவோம்.

source: Solution using ``QAOA``
es_un: Solución usando ``QAOA``
ta: ``QAOA`` பயன்படுத்தி தீர்வு கண்டறிதல்
