Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/tutorials/01_portfolio_optimization.po
Languages: bn_bn, de_de, es_un, ko_kr, ta, vi_vn

source: We also show here a result using the Quantum Approximate Optimization Algorithm (``QAOA``). This is another variational algorithm and it uses an internal variational form that is created based on the problem.
es_un: También mostramos aquí un resultado utilizando el Algoritmo Cuántico de Optimización Aproximada (Quantum Approximate Optimization Algorithm, ``QAOA``). Este es otro algoritmo variacional y utiliza una forma variacional interna que se crea en función del problema.
ta: குவாண்டம் தோராயமான மேம்படுத்தல் அல்காரிதம் (``QAOA``) ஐப் பயன்படுத்தி ஒரு முடிவையும் இங்கே காட்டுகிறோம். இது மற்றொரு மாறுபாடு அல்காரிதம் மற்றும் இது சிக்கலின் அடிப்படையில் உருவாக்கப்பட்ட உள் மாறுபாடு வடிவத்தைப் பயன்படுத்துகிறது.
