Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/tutorials/02_portfolio_diversification.po
Languages: bn_bn, de, fr, ta

source: This page was generated from `docs/tutorials/02_portfolio_diversification.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/10_warm_start_qaoa.ipynb`__ থেকে বানানো হয়েছে।
de: Diese Seite wurde aus `docs/tutorials/02_portfolio_diversification.ipynb`__ generiert.
fr: Cette page a été générée à partir de `docs/tutorials/02_portfolio_diversification.ipynb` __.
ta: இந்தப் பக்கம் `docs/tutorials/02_portfolio_diversification.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Portfolio Diversification
bn_bn: পোর্টফোলিও ডাইভারসিফিকেশন বা দপ্তর বৈচিত্র্যকরণ।
de: Portfolio-Diversifikation
fr: Diversification du portefeuille
ta: போர்ட்ஃபோலியோ பல்வகைப்படுத்தல்

source: Introduction
bn_bn: ভূমিকা
de: Einführung
ta: முன்னுரை

source: In asset management, there are broadly two approaches: active and passive investment management. Within passive investment management, there are index-tracking funds and there are approaches based on portfolio diversification, which aim at representing a portfolio with a large number of assets by a smaller number of representative stocks. This notebook illustrates a portfolio diversification problem, which has recently become popular for two reasons: 1. it makes it possible to mimic the performance of an index (or a similarly large set of assets) with a limited budget, at limited transaction costs. That is: traditional index-tracking may purchase all assets in the index, ideally with the same weights as in the index. This may be impractical for a number of reasons: the total of even a single round lot per asset may amount to more than the assets under management, the large scale of the index-tracking problem with integrality constraints may render the optimization problem difficult, and the transaction costs of the frequent rebalancing to adjust the positions to the weights in the index may render the approach expensive. Thus, a popular approach is to select a portfolio of :math:`q` assets that represent the market with :math:`n` assets, where :math:`q` is significantly smaller than :math:`n`, but where the portfolio replicates the behavior of the underlying market. To determine how to group assets into :math:`q` clusters and how to determine which :math:`q` assets should represent the :math:`q` clusters amounts to solving a large-scale optimization problem. In the following we describe the mathematical model for the portfolio diversification problem as introduced in [Cornuejols & Tutuncu, 2006] 2. it allows for similarity measures between time-series beyond the covariance matrix. Notice that traditionally, modern portfolio theory considers the covariance matrix as a measure of similarity between the assets. As such, however, the covariance matrix is imperfect. Consider, for instance, a company listed both in London and New York. Although both listings should be very similar, only parts of the time series of the prices of the two listings will overlap, because of the partial overlap of the times the markets open. Instead of covariance, one can consider, for example, dynamic time warping of [Berndt and Clifford, 1994] as a measure of similarity between two time series, which allows for the fact that for some time periods, the data are captured by only one of the time series, while for others, both time series exhibit the similarity due to the parallel evolution of the stock price.
bn_bn: সম্পদ ব্যবস্থাপনায়, মূলত দুটি পন্থা রয়েছে: সক্রিয় এবং নিষ্ক্রিয় বিনিয়োগ ব্যবস্থাপনা। নিষ্ক্রিয় বিনিয়োগ ব্যবস্থাপনার মধ্যে, ইনডেক্স-ট্র্যাকিং ফান্ড রয়েছে এবং পোর্টফোলিও বৈচিত্র্যের উপর ভিত্তি করে পন্থা রয়েছে, যার লক্ষ্য হল অল্প সংখ্যক প্রতিনিধি স্টক দ্বারা বিপুল সংখ্যক সম্পদ সহ একটি পোর্টফোলিওকে প্রতিনিধিত্ব করা। এই নোটবুকটি একটি পোর্টফোলিও বৈচিত্র্যময় সমস্যার চিত্র তুলে ধরেছে, যা সম্প্রতি দুটি কারণে জনপ্রিয় হয়ে উঠেছে: ১. সীমিত লেনদেনের খরচে সীমিত বাজেটের মাধ্যমে একটি সূচকের (বা অনুরূপ সম্পদের সমষ্টি) কর্মক্ষমতা অনুকরণ করা সম্ভব করে তোলে। এটি হল: ঐতিহ্যগত সূচক-ট্র্যাকিং সূচকের সমস্ত সম্পদ কিনতে পারে, আদর্শভাবে সূচকের মতো একই ওজন সহ। এটি বেশ কয়েকটি কারণে অবাস্তব হতে পারে: সম্পত্তির প্রতি একক রাউন্ড লটের মোট পরিমাণ ব্যবস্থাপনার অধীনে সম্পদের চেয়ে বেশি হতে পারে, অখণ্ডতা সীমাবদ্ধতার সাথে সূচক-ট্র্যাকিং সমস্যার বৃহত আকার অপ্টিমাইজেশান সমস্যাটিকে কঠিন করে তুলতে পারে, এবং সূচকের ওজনগুলির সাথে অবস্থানগুলিকে সামঞ্জস্য করার জন্য ঘন ঘন পুনর্বিন্যাসের লেনদেনের খরচ পদ্ধতির ব্যয়বহুল হতে পারে। সুতরাং, একটি জনপ্রিয় পন্থা হল :math:`q` সম্পদের একটি পোর্টফোলিও নির্বাচন করা যা :math:`n` সম্পদের সাথে বাজারের প্রতিনিধিত্ব করে, যেখানে :math:`q`, :math:`n` এর তুলনায় উল্লেখযোগ্যভাবে ছোট, কিন্তু যেখানে পোর্টফোলিও অন্তর্নিহিত বাজারের আচরণের প্রতিলিপি করে। কিভাবে :math:`q` ক্লাস্টারে সম্পদগুলিকে গ্রুপ করা যায় এবং কোন :math:`q` সম্পদের :math:`q` ক্লাস্টারের প্রতিনিধিত্ব করা উচিত তা নির্ধারণ করার জন্য একটি বড় আকারের অপ্টিমাইজেশান সমস্যা সমাধানের জন্য নিচে আমরা সেই পোর্টফোলিও বৈচিত্র্য সমস্যার জন্য গাণিতিক মডেল বর্ণনা করেছি [Cornuejols & Tutuncu, 2006] ২-এ প্রবর্তিত হিসাবে। লক্ষ্য করুন যে ঐতিহ্যগতভাবে, আধুনিক পোর্টফোলিও তত্ত্ব কোভারিয়েন্স ম্যাট্রিক্সকে সম্পদের মধ্যে মিলের একটি পরিমাপ হিসাবে বিবেচনা করে। যেমন, যাইহোক, কোভারিয়েন্স ম্যাট্রিক্স অসম্পূর্ণ। উদাহরণস্বরূপ, লন্ডন এবং নিউইয়র্কে তালিকাভুক্ত একটি কোম্পানি বিবেচনা করুন। যদিও উভয় তালিকা খুব অনুরূপ হওয়া উচিত, দুটি তালিকার দামের সময় সিরিজের কিছু অংশ ওভারল্যাপ হবে, কারণ বাজারগুলি খোলা সময়ের আংশিক ওভারল্যাপের কারণে। কোভারিয়েন্স এর পরিবর্তে, কেউ বিবেচনা করতে পারে, উদাহরণস্বরূপ, [Berndt and Clifford, 1994] এর গতিশীল টাইম ওয়ারপিংকে দুই টাইম সিরিজের মধ্যে মিলের পরিমাপ হিসাবে বিবেচনা করা যেতে পারে, যা কিছু সময়ের জন্য, ডেটা শুধুমাত্র একটি দ্বারা ধরা হয় সময় সিরিজ, অন্যদের জন্য, উভয় সময় সিরিজ স্টক মূল্যের সমান্তরাল বিবর্তনের কারণে মিল দেখায়।
de: In der Vermögensverwaltung gibt es im Wesentlichen zwei Ansätze: Aktives und passives Anlagemanagement. Innerhalb des passiven Anlagemanagements gibt es Indexnachbildungsfonds und es gibt Ansätze auf der Grundlage der Portfoliodiversifizierung, die darauf abzielen, ein Portfolio mit einer großen Anzahl von Vermögenswerten durch eine geringere Anzahl repräsentativer Bestände darzustellen. Dieses notebook illustriert ein Portfoliodiversifizierungsproblem, das kürzlich aus zwei Gründen populär geworden ist: 1. Es ermöglicht es, die Leistung eines Index (oder einer ähnlich großen Menge von Vermögenswerten) mit einem begrenzten Budget zu imitieren, und zwar zu begrenzten Transaktionskosten. Das heißt: Die traditionelle Indexverfolgung kann alle Anlagen im Index erwerben, idealerweise mit den gleichen Gewichten wie im Index. Dies kann aus einer Reihe von Gründen unpraktisch sein: Die Summe sogar einer einzelnen Runde pro Anlage kann mehr als die verwalteten Vermögen betragen, der große Umfang des Index-Nachbildungs-Problems mit Integralitätseinschränkungen kann das Optimierungsproblem erschweren, und die Transaktionskosten des häufigen Neuausgleichs zur Anpassung der Positionen an die Gewichte im Index können den Ansatz teuer machen. Ein beliebter Ansatz ist daher, ein Portfolio von :math:` q ` -Assets auszuwählen, die den Markt mit :math:` n ` -Assets darstellen, wobei :math:` q ' deutlich kleiner ist als :math:` n `, aber wo das Portfolio das Verhalten des zugrunde liegenden Marktes repliziert. Um festzustellen, wie Assets in :math:` q ` -Clustern gruppiert werden sollen und wie Sie ermitteln können, welche :math:` q ` -Assets die :math:` q ` -Cluster darstellen sollen, ist die Lösung eines groß angelegten Optimierungsproblems zu ermitteln. Im Folgenden beschreiben wir das mathematische Modell für das Portfoliodiversifizierungsproblem, wie es von [Cornuejols & Tutuncu, 2006] 2 eingeführt wurde. Es erlaubt Ähnlichkeitsmaße zwischen Zeitreihen jenseits der Kovarianzmatrix. Beachten Sie, dass die moderne Portfoliotheorie die Kovarianzmatrix traditionell als Maß für die Ähnlichkeit zwischen den Vermögenswerten betrachtet. Als solche jedoch ist die Kovarianzmatrix unvollkommen. Betrachten wir zum Beispiel ein Unternehmen, das sowohl in London als auch in New York aufgeführt ist. Obwohl beide Listen sehr ähnlich sein sollten, überlappen sich nur Teile der Zeitreihen der Preise der beiden Listen, wegen der teilweisen Überschneidung der Zeiten, in denen die Märkte offen sind. Anstelle der Kovarianz kann man beispielsweise das dynamische Zeitverzug von [Berndt und Clifford, 1994] als Maß für die Ähnlichkeit zwischen den zwei Zeitreihen betrachten, was die Tatsache ermöglicht, dass die Daten für einige Zeiträume nur von einer der Zeitreihen erfasst werden, während für andere die beiden Zeitreihen die Ähnlichkeit aufgrund der parallelen Entwicklung des Aktienkurses aufweisen.
fr: Dans la gestion des actifs, il y a généralement deux approches: la gestion active et passive de l'investissement. Dans le cadre de la gestion passive des investissements, il existe des fonds de suivi des indices et des approches basées sur la diversification des portefeuilles, qui visent à représenter un portefeuille avec un grand nombre d'actifs par un plus petit nombre de stocks représentatifs. Ce bloc-notes illustre un problème de diversification de portefeuille, qui est récemment devenu populaire pour deux raisons : 1. Il permet d'imiter la performance d'un indice (ou d'un ensemble similaire d'actifs) avec un budget limité, à des coûts de transaction limités. C'est-à-dire que l'indice traditionnel peut acheter tous les actifs de l'indice, idéalement avec les mêmes poids que ceux de l'indice. Cela peut être peu pratique pour un certain nombre de raisons : la valeur totale d'un lot à tour unique par actif peut être supérieur à l'actif sous gestion, la grande échelle du problème de suivi de l'indice avec des contraintes d'intégration peut rendre le problème d'optimisation difficile, et les coûts de transaction du rééquilibrage fréquent pour ajuster les positions aux pondérations de l'indice peuvent rendre l'approche coûteuse. Ainsi, une approche populaire consiste à sélectionner un portefeuille de :math:`q` actifs qui représentent le marché avec :math:`n` actifs, où :math:`q` est significativement plus petit que :math:`n`, mais où le portefeuille reproduit le comportement du marché sous-jacent. Pour déterminer comment regrouper des actifs dans :math:`q` groupes et comment déterminer quels sont les :math:`q` actifs qui doivent les représenter, il s'agit de résoudre un problème d'optimisation à grande échelle. Dans ce qui suit, nous décrirons le modèle mathématique du problème de diversification des portefeuilles tel qu'il a été introduit dans [Cornuejols & Tutuncu, 2006] 2. Il permet des mesures de similarité entre les séries chronologiques au-delà de la matrice de covariance. Notez que, traditionnellement, la théorie moderne du portefeuille considère la matrice de covariance comme une mesure de similitude entre les actifs. Par conséquent, la matrice de covariance est imparfaite. Prenons par exemple une société cotée à la fois à Londres et à New York. Même si les deux listes devraient être très semblables, seules des parties de la série chronologique des prix des deux listes se chevaucheront, en raison du chevauchement partiel des périodes d'ouverture des marchés. Au lieu de covariance, on peut considérer, par exemple, un gauchissement dynamique de [Berndt et Clifford, 1994] comme une mesure de la similarité entre deux séries temporelles, ce qui permet au fait que pour certaines périodes, les données ne sont capturées que par une seule série temporelle, alors que pour d'autres, les deux séries temporelles présentent une similitude en raison de l'évolution parallèle du cours boursier.
ta: சொத்து நிர்வாகத்தில், பரவலாக இரண்டு அணுகுமுறைகள் உள்ளன: செயலில் மற்றும் செயலற்ற முதலீட்டு மேலாண்மை. செயலற்ற முதலீட்டு நிர்வாகத்திற்குள், குறியீட்டு-கண்காணிப்பு நிதிகள் உள்ளன மற்றும் போர்ட்ஃபோலியோ பல்வகைப்படுத்தலின் அடிப்படையில் அணுகுமுறைகள் உள்ளன, அவை குறைந்த எண்ணிக்கையிலான பிரதிநிதித்துவ பங்குகளால் அதிக எண்ணிக்கையிலான சொத்துக்களைக் கொண்ட ஒரு போர்ட்ஃபோலியோவை பிரதிநிதித்துவப்படுத்துவதை நோக்கமாகக் கொண்டுள்ளன. இந்த நோட்புக் ஒரு போர்ட்ஃபோலியோ பல்வகைப்படுத்தல் சிக்கலை விளக்குகிறது, இது சமீபத்தில் இரண்டு காரணங்களுக்காக பிரபலமாகிவிட்டது: 1. இது ஒரு வரையறுக்கப்பட்ட பட்ஜெட்டுடன், வரையறுக்கப்பட்ட பரிவர்த்தனை செலவில் ஒரு குறியீட்டின் (அல்லது இதேபோன்ற பெரிய சொத்துக்களின்) செயல்திறனைப் பிரதிபலிக்க உதவுகிறது. அதாவது: பாரம்பரிய குறியீட்டு-கண்காணிப்பு குறியீட்டில் உள்ள அனைத்து சொத்துக்களையும் வாங்கக்கூடும், குறியீட்டில் உள்ள அதே எடையுடன். இது பல காரணங்களுக்காக நடைமுறைக்கு மாறானதாக இருக்கலாம்: ஒரு சொத்துக்கு ஒரு சுற்று நிறைய கூட நிர்வாகத்தின் கீழ் உள்ள சொத்துக்களை விட அதிகமாக இருக்கலாம், ஒருங்கிணைந்த கட்டுப்பாடுகளுடன் கூடிய குறியீட்டு-கண்காணிப்பு சிக்கலின் பெரிய அளவு தேர்வுமுறை சிக்கலை கடினமாக்குகிறது, மற்றும் குறியீட்டில் உள்ள எடைகளுக்கு நிலைகளை சரிசெய்ய அடிக்கடி மறுசீரமைப்பின் பரிவர்த்தனை செலவுகள் அணுகுமுறையை விலை உயர்ந்ததாக மாற்றக்கூடும். எனவே, ஒரு பிரபலமான அணுகுமுறை :math:`q` சொத்துகள் சந்தையை பிரதிநிதித்துவப்படுத்தும் :math:`n` சொத்துக்கள், எங்கே :math:`q` ஐ விட கணிசமாக சிறியது :math:`n`, ஆனால் போர்ட்ஃபோலியோ அடிப்படை சந்தையின் நடத்தையை பிரதிபலிக்கிறது. சொத்துக்களை எவ்வாறு குழுவாக்குவது என்பதை தீர்மானிக்க :math:`q` கொத்துகள் மற்றும் எது தீர்மானிக்க வேண்டும் :math:`q` சொத்துக்கள் பின்வருவனவற்றைக் குறிக்க வேண்டும் :math:`q` கொத்துகள் ஒரு பெரிய அளவிலான தேர்வுமுறை சிக்கலைத் தீர்ப்பதற்கு சமம். [கார்னூஜோல்ஸ் & டுட்டுங்கு, 2006] இல் அறிமுகப்படுத்தப்பட்ட போர்ட்ஃபோலியோ பல்வகைப்படுத்தல் சிக்கலுக்கான கணித மாதிரியை பின்வருவனவற்றில் விவரிக்கிறோம். இது கோவாரன்ஸ் மேட்ரிக்ஸைத் தாண்டி நேரத் தொடர்களுக்கு இடையிலான ஒற்றுமை நடவடிக்கைகளை அனுமதிக்கிறது. பாரம்பரியமாக, நவீன போர்ட்ஃபோலியோ கோட்பாடு கோவாரன்ஸ் மேட்ரிக்ஸை சொத்துக்களுக்கு இடையிலான ஒற்றுமையின் ஒரு நடவடிக்கையாக கருதுகிறது என்பதைக் கவனியுங்கள். இருப்பினும், கோவாரன்ஸ் மேட்ரிக்ஸ் அபூரணமானது. உதாரணமாக, லண்டன் மற்றும் நியூயார்க்கில் பட்டியலிடப்பட்ட ஒரு நிறுவனத்தைக் கவனியுங்கள். இரண்டு பட்டியல்களும் மிகவும் ஒத்ததாக இருக்க வேண்டும் என்றாலும், இரண்டு பட்டியல்களின் விலைகளின் நேரத் தொடரின் பகுதிகள் மட்டுமே ஒன்றுடன் ஒன்று சேரும், ஏனெனில் சந்தைகள் திறக்கும் நேரங்களின் ஓரளவு ஒன்றுடன் ஒன்று. ஒத்திசைவுக்குப் பதிலாக, [பெர்ன்ட் மற்றும் கிளிஃபோர்ட், 1994] இன் டைனமிக் டைம் வார்பிங்கை இரண்டு நேரத் தொடர்களுக்கிடையிலான ஒற்றுமையின் ஒரு நடவடிக்கையாகக் கருதலாம், இது சில காலங்களுக்கு, தரவு ஒரே ஒருவரால் மட்டுமே கைப்பற்றப்படுகிறது என்பதை அனுமதிக்கிறது நேரத் தொடரின், மற்றவர்களுக்கு, இரு நேரத் தொடர்களும் பங்கு விலையின் இணையான பரிணாமத்தின் காரணமாக ஒற்றுமையை வெளிப்படுத்துகின்றன.

source: The overall workflow we demonstrate comprises:
bn_bn: সামগ্রিকভাবে আমাদের প্রদর্শিত কর্মধারা গঠিত হয়:
de: Der Gesamtworkflow, den wir zeigen, umfasst:
fr: Le workflow global que nous démontrons comprend :
ta: நாங்கள் நிரூபிக்கும் ஒட்டுமொத்த பணிப்பாய்வு பின்வருமாறு:

source: pick the ground set of assets. In our case, this is a small number of US stocks.
bn_bn: সম্পদের ভিত্তি (গ্রাউন্ড) সেট বাছাই করুন। আমাদের ক্ষেত্রে, এটি একটি অল্প সংখ্যক মার্কিন স্টক।
de: bestimme eine Grundauswahl an Assets. In diesem Fall ist das eine kleine Anzahl von US-Aktien.
fr: choisir l'ensemble des actifs de base. Dans notre cas, il s'agit d'un petit nombre d'actions américaines.
ta: சொத்துகளின் தரையைத் தேர்ந்தெடுக்கவும். எங்கள் விஷயத்தில், இது ஒரு சிறிய எண்ணிக்கையிலான அமெரிக்க பங்குகள்.

source: load the time series capturing the evolution of the prices of assets. In our case, this is a simplistic load of adjusted daily closing price data from Wikipedia or Nasdaq or LSE or EuroNext, whereas in a real asset management, a much higher frequency may be considered.
bn_bn: সম্পদের দামের বিবর্তনকে ধারণ করে সময় সিরিজ লোড করুন। আমাদের ক্ষেত্রে, এটি উইকিপিডিয়া বা Nasdaq বা LSE বা EuroNext থেকে সামঞ্জস্যকৃত দৈনিক সমাপনী মূল্যের তথ্যগুলির একটি সরল লোড, যেখানে একটি বাস্তব সম্পদ ব্যবস্থাপনায়, অনেক বেশি ফ্রিকোয়েন্সি বিবেচনা করা যেতে পারে
de: laden Sie die Zeitreihen, die die Entwicklung der Preise von Vermögenswerten erfassen. In unserem Fall handelt es sich um vereinfachende angepasste tägliche Schlusskursdaten von Wikipedia oder Nasdaq oder LSE oder EuroNext, während bei einem realen Asset-Management eine viel höhere Frequenz in Betracht gezogen werden kann.
fr: charger la série temporelle représentant l'évolution des prix des actifs. Dans notre cas, il s’agit de données simplistes de clôture journalière ajustées depuis Wikipédia ou Nasdaq ou LSE ou EuroNext, alors que dans une gestion réelle des actifs, une fréquence beaucoup plus élevée peut être envisagée.
ta: வலைப்பதிவுகளின் விகிதங்களின் பரிணாம வளர்ச்சி அளிக்கிறது. நமது வழக்கில், இது விக்கிபீடியா அல்லது நாச்டாக் அல்லது LSE அல்லது யூரோடெனில் இருந்து ஒழுங்குபடுத்தப்பட்ட தினசரி விலை தரவுகளின் ஒரு எளிதான ஏற்றுமதி உள்ளது, ஒவ்வொன்றும் ஒரு உண்மையான வர்த்தக நிர்வாகத்தில், ஒரு அதிக அதிக விகிதமாக கருதலாம்.

source: compute the pair-wise similarity among the time series. In our case, we run a linear-time approximation of the dynamic time warping, still on the classical computer.
bn_bn: টাইম সিরিজের মধ্যে জোড়া-ভিত্তিক মিল গণনা করুন। আমাদের ক্ষেত্রে, আমরা এখনও ক্লাসিক্যাল কম্পিউটারে ডাইনামিক টাইম ওয়ারপিং এর রৈখিক-টাইম আনুমানিকতা চালাই।
de: berechnet die paarweise Ähnlichkeit zwischen den Zeitreihen. In unserem Fall führen wir ein lineare Approximation des 'dynamic time warping' noch auf dem klassischen Computer durch.
fr: calculer la similitude par paire au sein de la série chronologique. Dans notre cas, nous exécutons une approximation linéaire, toujours sur l'ordinateur classique.
ta: நேரத் தொடர்களில் ஜோடி வாரியான ஒற்றுமையைக் கணக்கிடுங்கள். எங்கள் விஷயத்தில், கிளாசிக்கல் கணினியில், டைனமிக் டைம் வார்பிங்கின் நேரியல் நேர தோராயத்தை இயக்குகிறோம்.

source: compute the actual portfolio of :math:`q` representative assets, based on the similarity measure. This step is run twice, actually. First, we obtain a reference value by a run of an IBM solver (IBM ILOG CPLEX or the Exact Eigensolver) on the classical computer. Second, we run an alternative, hybrid algorithm partly on the quantum computer.
bn_bn: এর প্রকৃত পোর্টফোলিও গণনা করুন :math:`q` প্রতিনিধি সম্পদ, মিলের পরিমাপের উপর ভিত্তি করে। এই ধাপটি আসলে দুবার চালানো হয়। প্রথমত, আমরা ক্লাসিক্যাল কম্পিউটারে একটি IBM solver (IBM ILOG CPLEX বা Exact Eigensolver) দ্বারা একটি রেফারেন্স ভ্যালু পাই। দ্বিতীয়ত, আমরা একটি বিকল্প, হাইব্রিড অ্যালগরিদম আংশিকভাবে কোয়ান্টাম কম্পিউটারে চালাই।
de: berechnet das aktuelle Portfolio von :math:`q` repräsentativen Assets basierend auf der Ähnlichkeitsmessung. Dieser Schritt wird zweimal ausgeführt. Zunächst erhalten wir einen Referenzwert durch den Lauf eines IBM Solvers (IBM ILOG CPLEX oder des Exact Eigensolvers) auf dem klassischen Computer. Zweitens betreiben wir einen alternativen, hybriden Algorithmus teilweise auf dem Quantencomputer.
fr: calculer le portefeuille réel de :math:`q` actifs représentatifs, en se basant sur la mesure de similarité. Cette étape est exécutée deux fois, en fait. Tout d'abord, nous obtenons une valeur de référence par l'exécution d'un solveur IBM (IBM ILOG CPLEX ou l'exact Eigensolver) sur l'ordinateur classique. Ensuite, nous exécutons un algorithme alternatif hybride en partie sur l'ordinateur quantique.
ta: இதன் உண்மையான போர்ட்ஃபோலியோவைக் கணக்கிடுங்கள் :math:`q` பிரதிநிதி சொத்துக்கள், ஒற்றுமை அளவின் அடிப்படையில். இந்த படி உண்மையில் இரண்டு முறை இயக்கப்படுகிறது. முதலாவதாக, கிளாசிக்கல் கணினியில் ஒரு IBM தீர்வி (IBM ILOG CPLEX அல்லது சரியான ஐஜென்சால்வர்) மூலம் ஒரு குறிப்பு மதிப்பைப் பெறுகிறோம். இரண்டாவதாக, குவாண்டம் கணினியில் ஒரு மாற்று, கலப்பின வழிமுறையை இயக்குகிறோம்.

source: visualization of the results. In our case, this is again a simplistic plot.
bn_bn: ফলাফল দৃশ্যায়ন বা চিত্রায়ন। আমাদের ক্ষেত্রে, এটি আবার একটি সহজ সরল লেখচিত্র (প্লট)।
de: Visualisierung der Resultate. Hier ist das eine vereinfachte grafische Darstellung.
fr: visualisation des résultats, dans notre cas, il s'agit à nouveau d'un graphique simpliste.
ta: முடிவுகளின் காட்சிப்படுத்தல். எங்கள் விஷயத்தில், இது மீண்டும் ஒரு எளிய சதி.

source: In the following, we first explain the model used in (4) above, before we proceed with the installation of the pre-requisites and the data loading.
bn_bn: এটিতে আমরা পূর্ব প্রয়োজনীয় জিনিসগুলোর ইনস্টলেশন এবং ডেটা লোডিং করার আগে প্রথমে ওপরে (৪) ব্যবহৃত মডেলটিকে বর্ণনা করবো।
de: Im Folgenden erläutern wir zunächst das in (4) verwendete Modell, bevor wir mit der Installation der Abhängigkeiten und dem Laden der Daten fortfahren.
fr: Dans ce qui suit, nous expliquons d'abord le modèle utilisé ci-dessus (4), avant de procéder à l'installation des pré-requis et au chargement des données.
ta: பின்வருவனவற்றில், முன் தேவைகள் மற்றும் தரவு ஏற்றுதல் ஆகியவற்றை நிறுவுவதற்கு முன், மேலே (4) இல் பயன்படுத்தப்படும் மாதிரியை முதலில் விளக்குகிறோம்.

source: The Model
bn_bn: মডেল(নকশা)
de: Das Modell
fr: Le modèle
ta: மாதிரி

source: As discussed in [Cornuejols & Tutuncu, 2006], we describe a mathematical model that clusters assets into groups of similar ones and selects one representative asset from each group to be included in the index fund portfolio. The model is based on the following data, which we will discuss in more detail later:
bn_bn: [Cornuejols & Tutuncu, 2006] এ আলোচনা করা হয়েছে, আমরা একটি গাণিতিক মডেল বর্ণনা করি যা সম্পদগুলিকে একই রকমের গোষ্ঠীতে বিভক্ত করে এবং প্রতিটি গ্রুপ থেকে একটি প্রতিনিধি সম্পদ নির্বাচন করে সূচক তহবিলের পোর্টফোলিওতে অন্তর্ভুক্ত করা হয়। মডেলটি নিম্নলিখিত ডেটার উপর ভিত্তি করে তৈরি করা হয়েছে, যা আমরা পরে আরও বিস্তারিতভাবে আলোচনা করব:
de: Wie in [Cornuejols & Tutuncu, 2006] diskutiert, beschreiben wir ein mathematisches Modell, das Vermögenswerte in Gruppen von ähnlichen Clustern einführt und repräsentative Assets aus jeder Gruppe auswählt, die in das Portfolio des Indexfonds aufgenommen werden sollen. Das Modell basiert auf den folgenden Daten, auf die wir später noch näher eingehen werden:
fr: Comme discuté dans [Cornuejols & Tutuncu, 2006], nous décrivons un modèle mathématique qui regroupe les actifs en groupes d'actifs similaires et sélectionne un actif représentatif de chaque groupe à inclure dans le portefeuille de fonds. Le modèle est basé sur les données suivantes, dont nous discuterons plus en détail plus tard :
ta: [Cornuejols & Tutuncu, 2006] இல் விவாதிக்கப்பட்டபடி, ஒரு கணித மாதிரியை விவரிக்கிறோம், இது சொத்துக்களை ஒத்த குழுக்களாகக் கொத்துகிறது மற்றும் குறியீட்டு நிதி இலாகாவில் சேர்க்க ஒவ்வொரு குழுவிலிருந்தும் ஒரு பிரதிநிதி சொத்தைத் தேர்ந்தெடுக்கிறது. இந்த மாதிரி பின்வரும் தரவை அடிப்படையாகக் கொண்டது, பின்னர் விரிவாக விவாதிப்போம்:
