Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/tutorials/02_portfolio_diversification.po
Languages: bn_bn, de, fr, ta

source: ``exact_solution`` : to make sure that the Ising Hamiltonian is correctly encoded in the :math:`Z` basis, we can compute its eigendecomposition classically, i.e., considering a symmetric matrix of dimension :math:`2^N \times 2^N`. For the problem at hand :math:`n=3`, that is :math:`N = 12`, seems to be the limit for many laptops;
bn_bn: "exact_solution": আইসিং হ্যামিল্টোনিয়ান সঠিকভাবে এনকোড করা আছে তা নিশ্চিত করার জন্য :math:`Z` ভিত্তিতে, আমরা এর eigendecomposition গণনা করতে পারি ক্লাসিকভাবে, অর্থাৎ, মাত্রার একটি প্রতিসম ম্যাট্রিক্স বিবেচনা করে :math:`2^N \times 2^N`। নিকট সমস্যার জন্য :math:`n=3`, অর্থাৎ :math:`N = 12`, মনে হয় অনেক ল্যাপটপের সীমা;
de: ` ` exact_solution ` `: Um sicherzustellen, dass das Ising Hamiltonian korrekt in der :math:` Z ` -Basis kodiert wird, können wir seine Eigenzerlegung klassisch berechnen, d.h. unter Berücksichtigung einer symmetrischen Matrix der Dimension :math:` 2 ^ N \times 2 ^ N `. Für dieses Problem scheint das Limit vieler Laptops bei :math:` n=3 `, das ist :math:` N = 12 ` zu liegen;
fr: ``exact_solution``: pour s'assurer que le Hamiltonien Ising est correctement encodé dans la base :math:`Z`, nous pouvons calculer sa position propre de façon classique, c'est-à-dire en considérant une matrice symétrique de dimension :math:`2^N \times 2^N`. Pour le problème en question :math:` n=3 `, c'est-à-dire :math:` N = 12 `, semble être la limite pour de nombreux ordinateurs portables ;
ta: ``exact_solution`` : அதை உறுதிப்படுத்த Ising Hamiltonian :math:`Z` basis சரியாக குறியாக்கம் செய்யப்பட்டுள்ளதா என்றும், அதன் eigendecomposition ஐ நாம் கிளாசிக்கலாக கணக்கிடலாம், அதாவது, பரிமாணத்தின் சமச்சீர் அணியைக் கருத்தில் கொள்ளுங்கள் :math:`2^N \times 2^N`. கையில் உள்ள பிரச்சினைக்கு :math:`n=3`, அதாவது :math:`N = 12`, பல மடிக்கணினிகளுக்கான வரம்பாகத் தெரிகிறது;

source: Step 1
bn_bn: ধাপ 1
de: 1. Schritt
fr: Étape 1
ta: செயல் 1

source: Instantiate the quantum optimizer class with parameters: - the similarity matrix ``rho``; - the number of assets and clusters ``n`` and ``q``;
bn_bn: কোয়ান্টাম অনুকূলায়ক ক্লাসকে মুহূর্তায়িত বা ইনস্ট্যান্টিয়েট করুন পরামিতির দ্বারা: সদৃশ ম্যাট্রিক্স ``rho``;- ``n`` এবং ``q`` তে অ্যাসেট এবং ক্লাস্টার এর সংখ্যা;
de: Instanziiere die Quanten-Optimierer-Klasse mit den Parametern: - Ähnlichkeitsmatrix ``rho``; - Anzahl von Assets und Clustern ``n`` and ``q``;
fr: Instancions la classe d'optimiseur quantique avec les paramètres suivants : - la matrice de similarité : math:`rho` ; - le nombre de stocks et de groupes ``n`` et ``q`` ;
ta: அளவுருக்கள் மூலம் குவாண்டம் ஆப்டிமைசர் வகுப்பை நிறுவுங்கள்: - ஒற்றுமை அணி ``rho``; - சொத்துக்கள் மற்றும் கொத்துக்களின் எண்ணிக்கை ``n`` மற்றும் ``q``;

source: Step 2
bn_bn: ধাপ 2
de: 2. Schritt
fr: Étape 2
ta: செயல் 2

source: Encode the problem as a binary formulation (IH-QP).
bn_bn: দ্বিমিক (বাইনারি) সুত্র বা গঠনের (আইএইচ-কিউপি) হিসাবে সমস্যাটি এনকোড করুন।
de: Kodiere das Problem als binäre Formulierung (IH-QP).
fr: Encodons le problème en tant que formulation binaire (IH-QP).
ta: சிக்கலை பைனரி ஃபார்முலேஷன் (IH-QP) என குறியாக்கவும்.

source: Sanity check: make sure that the binary formulation in the quantum optimizer is correct (i.e., yields the same cost given the same solution).
bn_bn: স্যানিটি বা সদ্বিবেচনা পরীক্ষা: নিশ্চিত করুন যে কোয়ান্টাম অপ্টিমাইজারে দ্বিমিক (বাইনারি) সূত্র বা গঠন সঠিক কিনা (যেমন, একই সমাধানের জন্যে একই ব্যয় হয়)।
de: Zur Überprüfung: stelle sicher dass die binäre Formulierung des Quanten-Optimierer korrekt ist (also sich die selben Kosten für die selbe Lösung ergeben).
fr: Vérification : assurons-nous que la formulation binaire dans l'optimiseur quantique est correcte (c'est-à-dire qu'elle génère le même coût compte tenu de la même solution).
ta: நல்லறிவு சோதனை: குவாண்டம் ஆப்டிமைசரில் பைனரி உருவாக்கம் சரியானது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் (அதாவது, அதே தீர்வைக் கொடுக்கும் அதே செலவை அளிக்கிறது).

source: Step 3
bn_bn: ধাপ 3
de: 3. Schritt
fr: Étape 3
ta: செயல் 3

source: Encode the problem as an Ising Hamiltonian in the Z basis.
bn_bn: সমস্যাটিকে Z বেসিসে বা ভিত্তিতে একটি আইসিং হ্যামিল্টোনিয়ান হিসেবে এনকোড করুন।
de: Kodiere das Problem als Ising Hamiltonoperator in der Z-Basis.
fr: Encode le problème en tant qu'hamiltonien Ising dans la base Z.
ta: Z அடிப்படையில் ஐசிங் ஹாமில்டோனியனாக சிக்கலை குறியாக்குக.

source: Sanity check: make sure that the formulation is correct (i.e., yields the same cost given the same solution)
bn_bn: স্যানিটি বা সদ্বিবেচনা পরীক্ষা: নিশ্চিত করুন যে ফর্মূলেশন বা গঠনটি সঠিক কিনা (অর্থাৎ, একই সমাধানের জন্যে একই ব্যয় হয়)।
de: Zur Überprüfung: stelle sicher dass die Formulierung korrekt ist (also sich die selben Kosten für die selbe Lösung ergeben)
fr: Vérification : assurons-nous que la formulation binaire dans l'optimiseur quantique est correcte (c'est-à-dire qu'elle génère le même coût compte tenu de la même solution)
ta: நல்லறிவு சோதனை: உருவாக்கம் சரியானது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் (அதாவது, அதே தீர்வைக் கொடுக்கும் அதே செலவை அளிக்கிறது)

source: Step 4
bn_bn: ধাপ 4
de: 4. Schritt
fr: Étape 4
ta: செயல் 4

source: Step 5
bn_bn: ধাপ 5
fr: Étape 5
ta: செயல் 5

source: Visualize the solution
bn_bn: সমাধানটি দৃশ্যায়িত করা
fr: Visualisons la solution
ta: தீர்வுகளை காட்சிப்படுத்துங்கள்

source: ``vqe_solution`` : solves the problem :math:`(M)` via the Sampling Variational Quantum Eigensolver (``SamplingVQE``);
fr: ``vqe_solution``: résout le problème :math:`(M)` via l'échantillonnage Variational Quantum Eigensolver (``SamplingVQE``);

source: ``qaoa_solution`` : solves the problem :math:`(M)` via a Quantum Approximate Optimization Algorithm (``QAOA``).
fr: ``qaoa_solution``: résout le problème :math:`(M)` via un algorithme ``QAOA`` (Quantum Approximate Optimization Algorithm).

source: Solve the problem via ``SamplingVQE``. Notice that depending on the number of qubits, this can take a while: for 6 qubits it takes 15 minutes on a 2015 Macbook Pro, for 12 qubits it takes more than 12 hours. For longer runs, logging may be useful to observe the workings; otherwise, you just have to wait until the solution is printed.
fr: Résolvons le problème via ``SamplingVQE``. Notez que selon le nombre de qubits, cela peut prendre un certain temps : pour 6 qubits il faut 15 minutes pour un Macbook Pro 2015, pour 12 qubits il faut plus de 12 heures. Pour les exécutions plus longues, le journaling peut être utile pour observer le fonctionnement ; sinon, il suffit d'attendre que la solution soit affichée.

source: Solution shows the selected stocks via the stars and in green the links (via similarities) with other stocks that are represented in the fund by the linked stock. Keep in mind that SamplingVQE is a heuristic working on the QP formulation of the Ising Hamiltonian, though. For suitable choices of A, local optima of the QP formulation will be feasible solutions to the ILP (integer linear program). While for some small instances, as above, we can find optimal solutions of the QP formulation which coincide with optima of the ILP, finding optimal solutions of the ILP is harder than finding local optima of the QP formulation, in general. Even within the SamplingVQE, one may provide stronger guarantees, for specific variational forms (trial wave functions).
fr: La solution montre les stocks sélectionnés via les étoiles et en vert les liens (via les similitudes) avec d'autres stocks qui sont représentés dans le fonds. Gardez à l'esprit que SamplingVQE est un travail heuristique sur la formulation QP du hamiltonien Ising. Pour les choix appropriés de A, l'optimisation locale de la formulation QP sera une solution réalisable pour l'ILP (integer linear program). Bien que pour quelques petites instances, comme ci-dessus, nous pouvons trouver des solutions optimales de la formulation QP qui coïncident avec optima de l'ILP, il est en général plus difficile de trouver des solutions optimales de l'ILP que de trouver les optima locales de la formulation QP. Même dans le SamplingVQE, on peut fournir des garanties plus fortes, pour des formes variationnelles spécifiques (fonctions d'onde d'essai).

source: [2] E. Farhi, J. Goldstone, S. Gutmann e-print `arXiv 1411.4028, 2014 <https://arxiv.org/abs/1411.4028>`__
ta: [2] ஈ. ஃபர்ஹி, ஜே. கோல்ட்ஸ்டோன், எஸ். குட்மேன் e-print `arXiv 1411.4028, 2014 <https://arxiv.org/abs/1411.4028>`__

source: [4] DJ. Berndt and J. Clifford, *Using dynamic time warping to find patterns in time series*. In KDD workshop 1994 (Vol. 10, No. 16, pp. 359-370).
de: [4] DJ. Berndt and J. Clifford, *Using dynamic time warping to find patterns in time series *. In der KDD-Werkstatt 1994 (Vol. 10, Nr. 16, S. 359-370).
