Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/tutorials/02_portfolio_diversification.po
Languages: bn_bn, de, fr, ta

source: For example, :math:`\rho_{ii} = 1`, :math:`\rho_{ij} \leq 1` for :math:`i \neq j` and :math:`\rho_{ij}` is larger for more similar stocks. An example of this is the correlation between the returns of stocks :math:`i` and :math:`j`. But one could choose other similarity indices :math:`\rho_{ij}`.
bn_bn: উদাহরণস্বরূপ, :math:`i \neq j` এর জন্য :math:`\rho_{ii} = 1`, :math:`\rho_{ij} \leq 1` এবং অন্যান্য সদৃশ স্টকস এর জন্য :math:`\rho_{ij}` এর মান বৃহত্তর । এর একটি উদাহরণ হল স্টকস এর রিটার্ন :math:`i` এবং :math:`j` এর মধ্যেকার সম্পর্ক বা কোরিলেশন। কিন্তু কেউ অন্য সাদৃশ্য সূচক বা সিমিলারিটি ইনডেক্স :math:`\rho_{ij}` বেছে নিতে পারে।
de: Zum Beispiel :math:`\rho_{ii} = 1`, :math:`\rho_{ij} \leq 1` for :math:`i \neq j` und :math:`\rho_{ij}` ist größer für ahnlichere Aktien. Besipielhaft dafür ist die Korellation zwischen den Erträge von Aktivposten :math:`i` und :math:`j`. Man könnte mit :math:`\rho_{ij}` andere Ähnlichkeitsindizes wählen.
fr: Par exemple, :math:`\rho_{ii} = 1`, :math:`\rho_{ij} \leq 1` pour :math:`i \neq j` et :math:`\rho_{ij}` est plus grand pour des actions plus similaires. Un exemple de ceci est la corrélation entre les retours des actions :math:`i` et :math:`j`. Mais on pourrait choisir d'autres indices de similitude :math:`\rho_{ij}`.
ta: எடுத்துக்காட்டாக, :math:`\rho_{ii} = 1`, :math:`\rho_{ij} \leq 1` for :math:`i \neq j` and :math:`\rho_{ij}` இது போன்ற ஒத்த பங்குகளுக்கு பெரியது. இதற்கு ஒரு எடுத்துக்காட்டு பங்குகளின் வருவாய்க்கு இடையேயான தொடர்பு :math:`i` மற்றும் :math:`j`. ஆனால் ஒருவர் மற்ற ஒற்றுமை குறியீடுகளைத் தேர்வு செய்யலாம் :math:`\rho_{ij}`.

source: The problem that we are interested in solving is:
bn_bn: আমরা যে সমস্যা সমাধানে আগ্রহী সেটা হল:
de: Das zu lösende Problem ist:
fr: Le problème que nous voulons résoudre est :
ta: தீர்க்க நாங்கள் ஆர்வமாக உள்ள பிரச்சினை:

source: subject to the clustering constraint:
bn_bn: ক্লাস্টারিং সীমাবদ্ধতা সাপেক্ষে:
de: abhängig von der Clusterbedingung:
fr: sous réserve de la contrainte de mise en cluster :
ta: கிளஸ்டரிங் தடைக்கு உட்பட்டது:

source: to consistency constraints:
bn_bn: ধারাবাহিকতা সীমাবদ্ধতা সাপেক্ষে:
de: zu Konsistenzbedingungen:
fr: aux contraintes de cohérence :
ta: சீரான தடைகளுக்கு:

source: and integral constraints:
bn_bn: এবং সমাকলন সীমাবদ্ধতা সাপেক্ষে:
de: und Integrationsbedingungen:
fr: et les contraintes intégrales :
ta: மற்றும் ஒருங்கிணைந்த கட்டுப்பாடுகள்:

source: The variables :math:`y_j` describe which stocks :math:`j` are in the index fund (:math:`y_j = 1` if :math:`j` is selected in the fund, :math:`0` otherwise). For each stock :math:`i = 1,\dots,n`, the variable :math:`x_{ij}` indicates which stock :math:`j` in the index fund is most similar to :math:`i` (:math:`x_{ij} = 1` if :math:`j` is the most similar stock in the index fund, :math:`0` otherwise).
bn_bn: :math:`y_j` ভেরিয়েবলগুলি বর্ণনা করে যে কোন স্টক :math:`j` ইনডেক্স ফান্ডে আছে (:math:`y_j` হবে যদি :math:`j` ফান্ডে নির্বাচন করা হয়, অন্যথায় :math:`0`)। প্রতিটি স্টক :math:`i = 1,\dots,n`- এর জন্য, চল রাশি :math:`x_{ij}` ইঙ্গিত করে যে সূচক তহবিলে কোন স্টক :math:`j` সবচেয়ে বেশি :math:`i` এর সাথে মিলে (:math:`x_{ij} = 1` যদি :math:`j` সূচক তহবিলে সবচেয়ে অনুরূপ স্টক হয়, অন্যথায় :math:`0`).
de: Die Variablen :math:`y_j` beschreiben, welche Aktien :math:`j` im Indexfonds sind (:math:`y_j = 1`, wenn :math:`j` im Fonds ausgewählt wurde, :math:`0` sonst nicht). Für jedes Format :math:`i = 1,\dots,n`, die Variable :math:`x_{ij}` zeigt an, welche Aktie :math:`j` im Indexfonds am ähnlichsten ist wie :math:`i` (:math:`x_{ij} = 1`, wenn :math:`j` der ähnlichste Bestand im Indexfonds ist, :math:`0` sonst nicht).
fr: Les variables :math:`y_j` décrivent quelles actions :math:`j` sont dans le fonds d'index (:math:`y_j = 1` si :math:`j` est sélectionné dans le fonds, :math:`0` autrement). Pour chaque action :math:`i = 1,\dots,n`, la variable :math:`x_{ij}` indique quelle action :math:`j` dans le fonds d'index est la plus similaire à :math:`i` (:math:`x_{ij} = 1` si :math:`j` est le titre le plus similaire dans le fonds d'index, :math:`0` autrement).
ta: மாறிகள் :math:`y_j` எந்த பங்குகளை விவரிக்கிறது :math:`j` குறியீட்டு நிதியில் உள்ளன (:math:`y_j = 1` என்றால் :math:`j` நிதியில் தேர்ந்தெடுக்கப்பட்டது, :math:`0` இல்லையெனில்). ஒவ்வொரு பங்குக்கும் :math:`i = 1,\dots,n`, மாறி :math:`x_{ij}` எந்தப் பங்கைக் குறிக்கிறது :math:`j` குறியீட்டு நிதியில் மிகவும் ஒத்திருக்கிறது :math:`i` (:math:`x_{ij} = 1` if :math:`j` என்பது குறியீட்டு நிதியில் மிகவும் ஒத்த பங்கு , :math:`0` இல்லையெனில்).

source: The first constraint selects :math:`q` stocks in the fund. The second constraint imposes that each stock :math:`i` has exactly one representative stock :math:`j` in the fund. The third and fourth constraints guarantee that stock :math:`i` can be represented by stock :math:`j` only if :math:`j` is in the fund. The objective of the model maximizes the similarity between the :math:`n` stocks and their representatives in the fund. Different cost functions can also be considered.
bn_bn: প্রথম সীমাবদ্ধতা নির্বাচন করে তহবিলে :math:`q` স্টক। দ্বিতীয় সীমাবদ্ধতা আরোপ করে যে প্রতিটি স্টক :math:`i` এর ঠিক একটি প্রতিনিধি স্টক রয়েছে :math:`j` তহবিলে। তৃতীয় এবং চতুর্থ সীমাবদ্ধতা নিশ্চিত করে যে স্টক :math:`i` স্টক দ্বারা গণিত করা যেতে পারে :math:`j` শুধুমাত্র যদি :math:`j` তহবিলে থাকে। মডেলের উদ্দেশ্য :math:`n` স্টক এবং তহবিলে তাদের প্রতিনিধিদের মধ্যে মিলটি সর্বাধিক করে। বিভিন্ন খরচ ফাংশন এছাড়াও বিবেচনা করা যেতে পারে।
de: Die erste Randbedingung wählt :math:`q` Aktien im Fonds. Die zweite Randbedingung legt fest, dass jeder Stock :math:`i` genau einen repräsentativen Stock :math:`j` im Fonds hat. Die dritten und vierten Randbedingungen garantieren, dass der Bestand :math:`i` nur durch den Bestand von :math:`j` repräsentiert werden kann, wenn :math:`j` im Fonds ist. Das Modells maximiert die Ähnlichkeit zwischen den :math:`n` Aktien und ihren Vertretern im Fonds. Verschiedene Kostenfunktionen können ebenfalls in Betracht gezogen werden.
fr: La première contrainte sélectionne :math:`q` actions dans le fonds. La seconde contrainte impose que chaque stock :math:`i` ait exactement une action représentative :math:`j` dans le fonds. Les troisième et quatrième contraintes garantissent que le stock :math:`i` peut être représenté par le stock :math:`j` seulement si :math:`j` est dans le fonds. L'objectif du modèle maximise la similitude entre les stocks :math:`n` et leurs représentants dans le fonds. Différentes fonctions de coût peuvent également être envisagées.
ta: முதல் தடை தேர்வுசெய்கிறது :math:`q` நிதியில் இருப்புகள். இரண்டாவது தடை ஒவ்வொரு இருப்புக்கும் விதிக்கிறது :math:`i` சரியாக ஒரு பிரதிநிதி இருப்பு :math:`j` நிதியில். மூன்றாவது மற்றும் நான்காவது தடைகள் இருப்புக்கு உத்தரவாதம் அளிக்கின்றன :math:`i` ஐ பங்கு :math:`j` என்றால் மட்டுமே :math:`j` நிதியில் உள்ளது. மாதிரியின் நோக்கம் :math:`n` பங்குகள் மற்றும் நிதியில் அவற்றின் பிரதிநிதிகளுக்கு இடையிலான ஒற்றுமையை அதிகரிக்கிறது. வெவ்வேறு செலவு செயல்பாடுகளையும் கருத்தில் கொள்ளலாம்.

source: Let us concatenate the decision variables in one vector
bn_bn: আসুন একটি ভেক্টরে সিদ্ধান্তের ভেরিয়েবলগুলিকে একত্রিত করি
de: Die Entscheidungsvariablen werden in einem Vektor zusammengefasst
fr: Concaténons les variables de décision dans un seul vecteur
ta: ஒரு திசையனில் முடிவு மாறிகள் ஒன்றிணைப்போம்

source: whose dimension is :math:`{\bf z} \in \{0,1\}^N`, with :math:`N = n (n+1)` and denote the optimal solution with :math:`{\bf z}^*`, and the optimal cost :math:`f^*`.
bn_bn: যার মাত্রা হল :math:`{\bf z} \in \{0,1\}^N`, সাথে :math:`N = n (n+1)` এবং এর সাথে অনুকূল সমাধান নির্দেশ করুন :math:`{\bf z}^*`, এবং সর্বাপেক্ষা কাম্য খরচ :math:`f^*`।
de: dessen Dimension ist :math:`{\bf z} \in \{0,1\}^N`, with :math:`N = n (n+1)`, enthält die optimale Lösung mit :math:`{\bf z}^*` und die optimalen Kosten :math:`f^*`.
fr: dont la dimension est :math:`{ \bf z } \in \ { 0 ,1 \ } ^ N`, avec :math:`N = n (n + 1)` et dénote la solution optimale avec :math:`{ \bf z } ^ * `, et le coût optimal :math:` f ^ * `.
ta: இதன் பரிமாணம் :math:`{\bf z} \in \{0,1\}^N` , உடன் :math:`N = n (n+1)` மற்றும் இதனுடன் உகந்த தீர்வைக் குறிக்கவும் :math:`{\bf z}^*`, மற்றும் உகந்த செலவு :math:`f^*`.

source: A Hybrid Approach
bn_bn: একটি হাইব্রিড পদ্ধতি
de: Ein hybrider Ansatz
fr: Une approche hybride
ta: ஒரு கலப்பின அணுகல்

source: Here, we demonstrate an approach that combines classical and quantum computing steps, following the quantum approximate optimization approach of Farhi, Goldstone, and Gutmann (2014).
bn_bn: এখানে, আমরা Farhi, Goldstone, and Gutmann (2014) এর কোয়ান্টাম আনুমানিক অপ্টিমাইজেশন পদ্ধতির অনুসরণ করে শাস্ত্রীয় এবং কোয়ান্টাম কম্পিউটিং ধাপগুলিকে একত্রিত করে এমন একটি পদ্ধতি প্রদর্শন করি।
de: Hier wird ein Ansatz für die Kombination von Quantencomputing und klassischen Methoden demonstriert, der die Quanten-Näherungs-Optimierungs-Vorgehensweise von Farhi, Goldstone und Gutmann (2014) befolgt.
fr: Ici, nous démontrons une approche qui combine des étapes d'informatique classique et quantique, et nous suivons l'approche d'optimisation quantique approximative de Farhi, Goldstone et Gutman (2014).
ta: ஃபார்ஹி, கோல்ட்ஸ்டோன் மற்றும் குட்மேன் (2014) ஆகியவற்றின் குவாண்டம் தோராயமான தேர்வுமுறை அணுகுமுறையைப் பின்பற்றி, கிளாசிக்கல் மற்றும் குவாண்டம் கம்ப்யூட்டிங் படிகளை இணைக்கும் அணுகுமுறையை இங்கே நாங்கள் நிரூபிக்கிறோம்.

source: Construct a binary polynomial optimization
bn_bn: একটি দ্বিমিক বহুরাশিক অনুকূলকরণ (অপটিমাইজেশন) তৈরি করুন
de: Konstruiere eine binäre Polynomoptimierung
fr: Construction d'une optimisation polynomiale binaire
ta: பைனரி பல்லுறுப்புறுப்பு தேர்வுமுறையை உருவாக்குங்கள்

source: From :math:`(M)` one can construct a binary polynomial optimization with equality constraints only, by substituting the :math:`x_{ij} \leq y_j` inequality constraints with the equivalent equality constraints :math:`x_{ij} (1- y_j) = 0`. Then the problem becomes:
bn_bn: :math:`(M)` থেকে কেউ সমতা সীমাবদ্ধতার সাথে একটি বাইনারি বহুপদী অপ্টিমাইজেশান তৈরি করতে পারে, :math:`x_{ij} (1- y_j) = 0` সমতা সীমাবদ্ধতা দিয়ে :math:`x_{ij} \leq y_j` বৈষম্য সীমাবদ্ধতা প্রতিস্থাপন করে। তারপর সমস্যা হয়ে যায়:
de: Von :math:`(M)` kann man nur eine binäre polynomiale Optimierung mit Gleichheits Randbedingung erstellen, durch Ersetzen der :math:`x_{ij} \leq y_j` Ungleichheits Randbedingung mit den entsprechenden Gleichheits Randbedingungen :math:`x_{ij} (1- y_j) = 0`. Dann stellt sich das Problem:
fr: A partir de :math:` (M) ` on peut construire une optimisation polynomiale binaire avec des contraintes d'égalité seulement, en substituant les contraintes d'inégalité :math:` x_{ij} \leq y_j` avec les contraintes d'égalité équivalentes :math:` x_{ij} (1-y_j) = 0 `. Le problème devient alors:
ta: :math:`(M)` இல் இருந்து :math:`x_{ij} \leq y_j` சமத்துவமின்மை கட்டுப்பாடுகள் சமமான சமத்துவக் கட்டுப்பாடுகளுடன் மாற்றுவதன் மூலம் மட்டுமே சமத்துவக் கட்டுப்பாடுகளுடன் ஒரு binary constraints தேர்வுமுறையை உருவாக்க முடியும். :math:`x_{ij} (1- y_j) = 0`. பிறகு இந்த பிரச்சனை இவ்வாறு போகும்:

source: subject to the clustering constraint, the integral constraints, and the following modified consistency constraints:
bn_bn: ক্লাস্টারিং সীমাবদ্ধতা, সমাকলন সীমাবদ্ধতা, এবং নিচের পরিবর্তিত ধারাবাহিকতা সীমাবদ্ধতা সাপেক্ষে:
de: abhängig von der Clusterbedingung, den integralen Bedingungen und den folgenden modifizierten Konsistenzbedingungen:
fr: sous réserve de la contrainte de mise en cluster, des contraintes intégrales et des contraintes de cohérence modifiées suivantes :
ta: clustering கட்டுப்பாடுகள், ஒருங்கிணைந்த கட்டுப்பாடுகள், மற்றும் பின்வரும் திருத்தப்பட்ட தொடக்க கட்டுப்பாடுகள்:

source: \quad x_{jj} = y_j,\,\textrm{ for }\, j = 1,\ldots, n.
bn_bn: \sum_{j=1}^n x_{ij} = 1, \,\textrm{ for }\, i = 1,\ldots, n,

source: Construct the Ising Hamiltonian
bn_bn: আইসিং হ্যামিল্টোনীয়ান নির্মাণ করুন
de: Bestimme den Ising Hamiltonoperator
fr: Construction de l'hamiltonien Ising
ta: ஐசிங் ஹாமில்டோனியனை உருவாக்குங்கள்

source: We can now construct the Ising Hamiltonian (QUBO) by penalty methods (introducing a penalty coefficient :math:`A` for each equality constraint) as
bn_bn: আমরা এখন পেনাল্টি পদ্ধতি দ্বারা আইসিং হ্যামিল্টোনিয়ান (QUBO) তৈরি করতে পারি (সমতা প্রতিবন্ধকতার জন্য একটি পেনাল্টি সহগ :math:`A` প্রবর্তন) হিসাবে
de: Wir können nun das Ising Hamiltonian (QUBO) durch Straffunktionen (penalty methods) (Einführung eines Strafparameters :math:` A ` für jede Gleichheits Randbedingung) als
fr: Nous pouvons maintenant construire l'hamiltonien Ising (QUBO) par des méthodes de pénalité (introduisant un coefficient de pénalité :math:`A` pour chaque contrainte d'égalité) en tant que
ta: அபராதம் முறைகள் மூலம் நாம் இப்போது ஐசிங் ஹாமில்டோனியனை (QUBO) உருவாக்கலாம் (அபராதம் குணகத்தை அறிமுகப்படுத்துகிறோம் :math:`A` ஒவ்வொரு சமத்துவ தடைக்கும்)

source: From Hamiltonian to Quadratic Programming (QP) formulation
bn_bn: হ্যামিল্টোনিয়ান থেকে দ্বিঘাত (কোয়াড্রাটিক) প্রোগ্রামিং (QP) গঠন বা ফর্মুলেশন।
de: Vom Hamiltonoperator zur Quadratic-Programming (QP) Formulierung
fr: De l'Hamiltonien à la formulation de programmation quadratique (QP)
ta: Hamiltonian இருந்து Quadratic Programming (QP) வடிவம்

source: In the vector :math:`{\bf z}`, the Ising Hamiltonian elements can be rewritten as follows,
bn_bn: :math:`{\bf z}` ভেক্টরটিতে, আইসিং হ্যামিল্টোনিয়ান উপাদানগুলিকে এভাবে লেখা যেতে পারে,
de: In dem Vektor :math:`{\bf z}`, können Ising Hamiltonoperatoren wie folgt umgeschreiben werden,
fr: Dans le vecteur :math:`{ \bf z }`, les éléments hamiltoniens d'Ising peuvent être réécrits comme suit :
ta: திசையன் :math:`{\bf z}`, Ising ஹாமில்டோனிய கூறுகளை பின்வருமாறு மீண்டும் எழுதலாம்,

source: First term:
bn_bn: প্রথম পদ বা টার্ম:
de: Erster Term:
fr: Premier terme:
ta: முதல் கால எல்லை:

source: Second term:
bn_bn: দ্বিতীয় পদ:
de: Zweiter Term:
fr: Second terme :
ta: இரண்டாவது கால எல்லை:

source: Third term:
bn_bn: তৃতীয় পদ:
de: Dritter Term:
fr: Troisième terme :
ta: மூன்றாம் கால எல்லை:

source: which is equivalent to:
bn_bn: যেটির প্রায় সমান হল:
de: das entspricht:
fr: qui est équivalent à :
ta: இது சமமானது:

source: Fourth term:
bn_bn: চতুর্থ পদ বা টার্ম:
de: Vierter Term:
fr: Quatrième terme :
ta: நான்காவது கால எல்லை:

source: Fifth term:
bn_bn: পঞ্চম পদ বা টার্ম:
fr: Cinquième terme :
ta: ஐந்தாம் கால எல்லை:

source: Therefore, the formulation becomes,
bn_bn: অতএব, ফর্মুলেশন বা প্রস্তুতিটি হয়ে যায়,
de: Folglich wir die Formilierung
fr: Par conséquent, la formulation devient :
ta: எனவே, உருவாக்கம் ஆகிறது,

source: which can be passed to the variational quantum eigensolver.
bn_bn: যেটিকে ভেরিয়েশনাল কোয়ান্টাম আইগেনসলভার (ভিকিউই) এ পাস করা যায়।
de: welches in den Variational-Quantum-Eigensolver eingespeist werden kann.
fr: qui peuvent être transmis à l'eigensolver quantique variationnel.
ta: variational quantum eigensolver க்கு தேர்ச்சி செய்ய முடியும்.

source: References
bn_bn: তথ্যসূত্র (রেফারেন্স)
de: Referenzen
fr: Références
ta: குறிப்புகள்

source: [1] G. Cornuejols, M. L. Fisher, and G. L. Nemhauser, *Location of bank accounts to optimize float: an analytical study of exact and approximate algorithms*, Management Science, vol. 23(8), 1997
bn_bn: [1] *লোকেশন অফ ব্যাংক অ্যাকাউন্টস টু অপটিমাইজ ফ্লোট: অ্যান অ্যানালিটিক্যাল স্টাডি অফ এক্সাকট অ্যান্ড অ্যাপ্রক্সিমেট অ্যালগোরিদমস* G. Cornuejols, M. L. Fisher, and G. L. Nemhauser, *Location of bank accounts to optimize float: an analytical study of exact and approximate algorithms*, Management Science, vol. 23(8), 1997
de: [1] G. Cornuejols, M. L. Fisher, and G. L. Nemhauser, *Location of bank accounts to optimize float: an analytical study of exact and ungefähre Algorithmen *, Management Science, Vol. 23 (8), 1997

source: [3] G. Cornuejols and R. Tutuncu, `Optimization methods in finance <http://web.math.ku.dk/~rolf/CT_FinOpt.pdf>`__, 2006
bn_bn: [3] `অপটিমাইজেশন মেথড ইন ফাইন্যান্স` G. Cornuejols and R. Tutuncu, `Optimization methods in finance <http://web.math.ku.dk/~rolf/CT_FinOpt.pdf>`__, 2006
ta: [3] ஜி. கார்னூஜோல்ஸ் மற்றும் ஆர். டுட்டுங்கு, `Optimization methods in finance <http://web.math.ku.dk/~rolf/CT_FinOpt.pdf>`__, 2006

source: [5] `Max-Cut and Traveling Salesman Problem <https://github.com/Qiskit/qiskit-optimization/blob/main/docs/tutorials/06_examples_max_cut_and_tsp.ipynb>`__
bn_bn: [5] `সর্বোচ্চ লাভ এবং ভ্রাম্যমান বিক্রেতার সমস্যা` <https://github.com/Qiskit/qiskit-optimization/blob/main/docs/tutorials/06_examples_max_cut_and_tsp.ipynb>`__
ta: [5] `மேக்ஸ்-கட் மற்றும் டிராவலிங் சேல்ஸ்மேன் சிக்கல் <https://github.com/Qiskit/qiskit-optimization/blob/main/docs/tutorials/06_examples_max_cut_and_tsp.ipynb>`__

source: The Implementation
bn_bn: রূপায়ণ (ইমপ্লিমেন্টেশন)
de: Die Implementierung
fr: L'implémentation
ta: செயல்படுத்துதல்

source: First, we import the requisite modules.
bn_bn: প্রথমে, আমরা প্রয়োজনীয় মডিউল ইম্পোর্ট বা আনয়ন করলাম।
de: Zunächst werden die erforderlichen Module importiert.
fr: Tout d'abord, nous importons les modules requis.
ta: முதலில், நாங்கள் தேவையான மாதிரிகளை இறக்குமதி செய்யும்.

source: Next, we download price data for two stocks and compute their pair-wise similarity matrix (`dynamic time warping <https://en.wikipedia.org/wiki/Dynamic_time_warping>`__ distance normalized to (0,1] by taking the reciprocal). If this fails, e.g., due to you being offline or exceeding the daily limit for accesses to the stock-market data, we consider a constant matrix instead.
bn_bn: পরবর্তীতে, আমরা দুটি স্টকের জন্য মূল্য তথ্য ডাউনলোড করি এবং তাদের জোড়া-ভিত্তিক মিল ম্যাট্রিক্স (`dynamic time warping <https://en.wikipedia.org/wiki/Dynamic_time_warping>`__ বিপরীত গ্রহণের মাধ্যমে দূরত্বকে (0,1] এ নরমালাইজ) নির্ণয় করি। যদি এটি ব্যর্থ হয়, যেমন, আপনি অফলাইনে থাকার কারণে বা স্টক-মার্কেট ডেটা অ্যাক্সেসের দৈনিক সীমা অতিক্রম করার কারণে, আমরা পরিবর্তে একটি ধ্রুবক ম্যাট্রিক্স বিবেচনা করি।
de: Als Nächstes laden wir Preisdaten für zwei Aktien herunter und berechnen ihre gegenseitige Ähnlichkeitsmatrix (` dynamic time warping<https://en.wikipedia.org/wiki/Dynamic_time_warping>` __ Entfernung normalisiert auf (0, 1] durch die Verwendung des Kehrwerts). Wenn dies fehlschlägt, z. B. weil Sie offline sind oder die Tagesgrenze für Zugriffe auf die stock-market-Daten überschreiten, betrachten wir stattdessen eine konstante Matrix.
fr: Ensuite, nous téléchargerons les données de prix pour deux actions et calculerons leur matrice de similitude par paire (`dynamic time warping <https://en.wikipedia.org/wiki/Dynamic_time_warping>`__ normalisée à (0,1] en prenant la réciproque). Si cela échoue, par exemple si vous êtes hors ligne ou que vous dépassez la limite quotidienne d'accès aux données boursières, nous considérerons plutôt une matrice constante.
ta: அடுத்து, இரண்டு பங்குகளுக்கான விலைத் தரவைப் பதிவிறக்கம் செய்து அவற்றின் ஜோடி வாரியான ஒற்றுமை அணியைக் கணக்கிடுகிறோம் (`dynamic time warping <https://en.wikipedia.org/wiki/Dynamic_time_warping>`__ பரஸ்பரம் எடுத்துக்கொள்வதன் மூலம் (0,1] தூரம் இயல்பாக்கப்பட்டது).இது தோல்வியுற்றால், எ.கா., நீங்கள் ஆஃப்லைனில் இருப்பதால் அல்லது பங்குச் சந்தை தரவை அணுகுவதற்கான தினசரி வரம்பை மீறுவதால், அதற்கு பதிலாக ஒரு நிலையான மேட்ரிக்ஸை நாங்கள் கருதுகிறோம்.

source: Now we decide on the number of clusters. This has to be smaller than the number of stocks we have loaded.
bn_bn: এখন আমরা গুচ্ছ সংখ্যা নির্ধারণ করি। এটি আমাদের লোড করা স্টকের সংখ্যার চেয়ে ছোট হতে হবে।
de: Jetzt entscheiden wir über die Anzahl der Cluster. Diese muss kleiner sein als die Anzahl der Aktien die wir ausgewählt haben.
fr: Nous décidons maintenant du nombre de groupes, qui doit être plus petit que le nombre de stocks que nous avons chargés.
ta: இப்போது நாம் கொத்துக்களின் எண்ணிக்கையை தீர்மானிக்கிறோம். இது நாம் ஏற்றிய இருப்புகளின் எண்ணிக்கையை விட சிறியதாக இருக்க வேண்டும்.

source: Classical solution using IBM ILOG CPLEX
bn_bn: প্রথাগত (ক্লাসিক্যাল) সমাধান IBM ILOG CPLEX ব্যাবহার করে।
de: Klassische Lösung unter Benutzung von IBM ILOG CPLEX
fr: Solution classique utilisant IBM ILOG CPLEX
ta: IBM ILOG CPLEX ஐப் பயன்படுத்தி கிளாசிக்கல் தீர்வு

source: For a classical solution, we use IBM CPLEX. CPLEX is able to find the exact solution of this problem. We first define a ClassicalOptimizer class that encodes the problem in a way that CPLEX can solve, and then instantiate the class and solve it.
bn_bn: একটি প্রথাগত (ক্লাসিক্যাল) সমাধানের জন্য, আমরা আই.বি.এম সি.পি.এল. ই.এক্স (IBM CPLEX) ব্যবহার করি। সি.পি.এল.ই.এক্স এই সমস্যার সঠিক সমাধান খুঁজে পেতে সক্ষম। আমরা প্রথমে একটি প্রথাগত (ক্লাসিক্যাল) অপ্টিমাইজার শ্রেণি সংজ্ঞায়িত করি যা এমনভাবে সমস্যাটিকে এনকোড করে যাতে সিপিএলএক্স সমাধান করতে পারে এবং তারপরে ক্লাসটি তাৎক্ষণিক এবং সেটি সমাধান করে।
de: Für eine klassische Lösung verwenden wir IBM CPLEX. CPLEX ist in der Lage, die genaue Lösung dieses Problems zu finden. Zuerst definieren wir eine ClassicalOptimizer-Klasse, die das Problem in einer Weise codiert, die CPLEX lösen kann. Danach wird die Klassen Instanz erstellt und gelöst.
fr: Pour une solution classique, nous utilisons IBM ILOG CPLEX. CPLEX est capable de trouver la solution exacte pour ce problème. Nous définissons d'abord une classe ClassicalOptimizer qui code le problème d'une manière que CPLEX peut résoudre, puis nous instancions la classe et nous résolvons le problème.
ta: கிளாசிக்கல் தீர்வுக்கு, நாங்கள் IBM CPLEX பயன்படுத்துகிறோம். CPLEX இந்த சிக்கலின் சரியான தீர்வைக் கண்டுபிடிக்க முடியும். சிபிளெக்ஸ் தீர்க்கக்கூடிய வகையில் சிக்கலைக் குறியீடாக்கும் கிளாசிக்கல் ஆப்டிமைசர் வகுப்பை நாங்கள் முதலில் வரையறுக்கிறோம், பின்னர் வகுப்பை நிறுவி அதைத் தீர்க்கலாம்.

source: Solution shows the selected stocks via the stars and in green the links (via similarities) with other stocks that are represented in the fund by the linked stock.
bn_bn: সমাধানটি নির্বাচিত স্টকগুলিকে তারার মাধ্যমে এবং সবুজ রঙে (মিলের মাধ্যমে) অন্যান্য স্টকগুলির সাথে দেখায় যা লিঙ্কযুক্ত স্টক দ্বারা তহবিলে প্রতিনিধিত্ব করে।
de: Die Lösung zeigt die ausgewählten Aktien über die Sterne und grünen Links (über Ähnlichkeiten) mit anderen Aktien, die im Fonds durch die verknüpfte Aktie repräsentiert werden.
fr: La solution montre les stocks sélectionnés avec les étoiles et en vert les liens (via les similitudes) avec d'autres stocks qui sont représentés dans le fonds par le stock lié.
ta: தீர்வு தேர்ந்தெடுக்கப்பட்ட இருப்புகளை நட்சத்திரங்கள் வழியாகவும், பச்சை நிறத்தில் இணைப்புகள் (ஒற்றுமைகள் வழியாக) இணைக்கப்பட்ட இருப்புகளால் நிதியில் குறிப்பிடப்படும் பிற பங்குகளுடன் காண்பிக்கப்படுகிறது.

source: Quantum Computing with IBM Q
bn_bn: আই. বি. এম Q এর সাহায্যে কোয়ান্টাম কম্পিউটিং
de: Quantenrechnen mit IBM Q
fr: Informatique quantique avec IBM Q
ta: IBM Q உடன் குவாண்டம் கம்ப்யூட்டிங்

source: For the quantum solution, we use Qiskit. We first define a class QuantumOptimizer that encodes the quantum approach to solve the problem and then we instantiate it and solve it. We define the following methods inside the class:
bn_bn: কোয়ান্টাম সমাধানের জন্য, আমরা Qiskit ব্যবহার করি। আমরা প্রথমে একটি ক্লাস কোয়ান্টাম অপটিমাইজার সংজ্ঞায়িত করি যা সমস্যা সমাধানের জন্য কোয়ান্টাম পদ্ধতির এনকোড করে এবং তারপর আমরা তা তাৎক্ষণিক সমাধান করি। আমরা ক্লাসের ভিতরে নিম্নলিখিত পদ্ধতিগুলি সংজ্ঞায়িত করি:
de: Für die Quantenlösung verwenden wir Qiskit. Wir definieren zunächst eine Klasse QuantumOptimizer, die den Quanten Ansatz kodiert, um das Problem zu lösen. Danach wird eine Instanz gebildet und gelöst. Wir definieren die folgenden Methoden innerhalb der Klasse:
fr: Pour la solution quantique, nous utilisons Qiskit. Nous avons d'abord défini une classe QuantumOptimizer qui code l'approche quantique pour résoudre le problème, puis nous l'instancions et la résolvons. Nous définissons les méthodes suivantes dans la classe :
ta: குவாண்டம் தீர்வுக்கு, நாங்கள் Qiskitடைப் பயன்படுத்துகிறோம். சிக்கலை தீர்க்க குவாண்டம் அணுகுமுறையை குறியீடாக்கும் ஒரு வகுப்பு குவாண்டம் ஆப்டிமைசரை நாங்கள் முதலில் வரையறுக்கிறோம், பின்னர் அதை உடனடியாக நிறுவி தீர்க்கிறோம். வகுப்பினுள் பின்வரும் முறைகளை நாங்கள் வரையறுக்கிறோம்:
