Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/tutorials/03_european_call_option_pricing.po
Languages: bn_bn, ja

source: This page was generated from `docs/tutorials/03_european_call_option_pricing.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/03_european_call_option_pricing.ipynb`__ থেকে বানানো হয়েছে।
ja: このページは `docs/tutorials/03_european_call_option_pricing.ipynb`__ から生成されました。

source: Pricing European Call Options
bn_bn: ইউরোপীয় কল বিকল্পগুলির মূল্য নির্ধারণ
ja: ヨーロピアン・コール・オプションの価格推定

source: Introduction
bn_bn: ভূমিকা
ja: はじめに

source: Suppose a European call option with strike price :math:`K` and an underlying asset whose spot price at maturity :math:`S_T` follows a given random distribution. The corresponding payoff function is defined as:
bn_bn: মনে করা যাক স্ট্রাইক প্রাইস সহ একটি ইউরোপীয় পুট বিকল্প :math:`K` এবং একটি অন্তর্নিহিত সম্পদ যার পূর্ণ পরিণতিতে স্পট মূল্য :math:`S_T`, যেটি একটি প্রদত্ত এলোমেলো বিতরণ অনুসরণ করে। এই সম্পর্কিত পে অফ ফাংশনটি সংজ্ঞায়িত করা হয়:
ja: 権利行使価格 :math:`K` で、原資産の満期時のスポット価格 :math:`S_T` がある確率分布に従うヨーロピアン・コール・オプションを考えます。 その時のペイオフ関数は次のように定義されます:

source: In the following, a quantum algorithm based on amplitude estimation is used to estimate the expected payoff, i.e., the fair price before discounting, for the option:
bn_bn: নিম্নে একটি মানের (অ্যামপ্লিটিউড) উপর নির্ভরশীল কোয়ান্টাম অ্যালগোরিদম ব্যবহার করে প্রত্যাশিত পেঅফ, যা হলো ছাড় দেয়ার আগের আদর্শমূল্য, অনুমান করা হয়েছে।
ja: 以下では、振幅推定に基づく量子アルゴリズムを使用して、期待されるペイオフ、すなわちオプションの割引前の適正価格を見積もります。

source: as well as the corresponding :math:`\Delta`, i.e., the derivative of the option price with respect to the spot price, defined as:
bn_bn: একই সাথে সম্পর্কযুক্ত :math:`\Delta` অর্থাৎ স্পট দামের সাপেক্ষে বিকল্প দামের অন্তরকলন এভাবে সংজ্ঞায়িত:
ja: 同様に対応する :math:`\Delta`、すなわちスポット価格に対するオプション価格の微分係数は、次のように与えられます:

source: The approximation of the objective function and a general introduction to option pricing and risk analysis on quantum computers are given in the following papers:
bn_bn: অবজেক্টিভ ফাংশনের হিসাব এবং কোয়ান্টাম কম্পিউটারগুলিতে মূল্য নির্ধারণ এবং ঝুঁকি বিশ্লেষণের একটি সাধারণ ভূমিকা নিম্নলিখিত গবেষণাপত্রগুলোতে দেওয়া হয়েছে:
ja: 目的関数の近似と量子コンピューターによる一般的なオプション価格設定とリスク分析は、以下の論文で紹介されています。

source: Uncertainty Model
bn_bn: অনিশ্চয়তা মডেল
ja: 不確実性モデル

source: We construct a circuit factory to load a log-normal random distribution into a quantum state. The distribution is truncated to a given interval :math:`[\text{low}, \text{high}]` and discretized using :math:`2^n` grid points, where :math:`n` denotes the number of qubits used. The unitary operator corresponding to the circuit factory implements the following:
bn_bn: আমরা log-normal র‍্যান্ডম ডিস্ট্রিবিউশন কোয়ান্টামের স্টেটে যুক্ত করার জন্য একটি সার্কিট ফ্যাক্টরি তৈরি করি। ডিস্ট্রিবিউশনটি একটি নির্দিষ্ট ইন্টারভালে :math:`[\text{low}, \text{high}]` বিচ্ছিন্ন হয় এবং সেগুলি :math:`2^n` গ্রিড পয়েন্ট ব্যবহার করে বিযুক্ত করা হয়। এখানে :math:`n` দ্বারা কিউবিট সংখ্যার বর্ণনা করা হচ্ছে। সার্কিট ফ্যাক্টরির মত ইউনিটরি অপারেটর নিম্নলিখিতভাবে প্রয়োগ করা হয়:

source: where :math:`p_i` denote the probabilities corresponding to the truncated and discretized distribution and where :math:`i` is mapped to the right interval using the affine map:
bn_bn: যেখানে math:`p_i` কাটা এবং বিযুক্ত বিতরণগুলির সম্ভাবনা বোঝায় এবং :math:`i` এর সাদৃশ্যপূর্ণ ম্যাপ ব্যবহার করে ডান ব্যবধানে ম্যাপ করা হয়েছে:
ja: ここで :math:`p_i` は切り捨てられ離散化された分布を与える確率を表し、:math:`i` はアフィン写像で得られた正しい区間です。

source: Payoff Function
bn_bn: পেঅফ ফাংশন
ja: ペイオフ関数

source: The payoff function equals zero as long as the spot price at maturity :math:`S_T` is less than the strike price :math:`K` and then increases linearly. The implementation uses a comparator, that flips an ancilla qubit from :math:`\big|0\rangle` to :math:`\big|1\rangle` if :math:`S_T \geq K`, and this ancilla is used to control the linear part of the payoff function.
bn_bn: যতক্ষণ পরিপক্ক অবস্থায় স্ট্রাইক মূল্য :math:`S_T`, :math:`K` থেকে কম থাকছে ততক্ষণ পর্যন্ত পে অফ ফাঙ্কশন শূন্য থাকবে তারপর মান রৈখিকভাবে বৃদ্ধি পাবে। এই প্রয়োগপদ্ধতিতে একটি comparator ব্যবহার করা হয়, এটি :math:`\big|0\rangle` থেকে :math:`\big|1\rangle` পর্যন্ত যদি :math:`S_T \geq K` হয় তাহলে একটি অ্যানসিলা কিউবিট ফ্লিপ করে এবং অ্যানসিলাটি পে অফ ফাঙ্কশন এর লিনিয়ার অংশ নিয়ন্ত্রণ করতে ব্যবহৃত হয়।
ja: ペイオフ関数は、満期時のスポット価格 :math:`S_T` が権利行使価格 :math:`K` よりも小さい間はゼロであり、その後、線形に増加します。実装はコンパレーターを使用し、もし :math:`S_T \geq K` ならば補助量子ビットを :math:`\big|0\rangle` から :math:`\big|1\rangle` にフリップし、この補助量子ビットがペイオフ関数の線形部分を制御します。

source: The linear part itself is then approximated as follows. We exploit the fact that :math:`\sin^2(y + \pi/4) \approx y + 1/2` for small :math:`|y|`. Thus, for a given approximation rescaling factor :math:`c_\text{approx} \in [0, 1]` and :math:`x \in [0, 1]` we consider
bn_bn: রৈখিক অংশ (linear part) টি অনুমান করতে এই পদ্ধতি ব্যবহার করা হয়। ছোট :math:`|y|` এর মানের জন্যে :math:`\sin^2(y + \pi/4) \approx y + 1/2` হয়। ফলে যেকোনো প্রদত্ত আনুমানিক আরোহী গুণক (স্কেলিং factor) :math:`c_\text{approx} \in [0, 1]` এবং :math:`x \in [0, 1]` এর জন্যে আমরা ধরে নেই,
ja: 線形部分自体は、次のように近似されます。 小さい :math:`|y|` に対して :math:`\sin^2(y + \pi/4) \approx y + 1/2` という事実を利用します。 したがって、与えられた近似再スケーリング係数 :math:`c_\text{approx} \in [0, 1]` および :math:`x \in [0, 1]` に対して、以下を考えます。

source: \ for small :math:`c_\text{approx}`.
bn_bn: ছোট :math:`c_\text{approx}`এর জন্যে।
ja: ここで、:math:`c_\text{approx}` は十分小さいものとします。

source: We can easily construct an operator that acts as
bn_bn: আমরা খুব সহজেই একটি চালক বানাতে পারি যেটা
ja: 次のように機能する演算子を簡単に構築できます

source: using controlled Y-rotations.
bn_bn: নিয়ন্ত্রিত Y-রোটেশন ব্যবহার করে
ja: 制御Y-回転を使います。

source: Eventually, we are interested in the probability of measuring :math:`\big|1\rangle` in the last qubit, which corresponds to :math:`\sin^2(a*x+b)`. Together with the approximation above, this allows to approximate the values of interest. The smaller we choose :math:`c_\text{approx}`, the better the approximation. However, since we are then estimating a property scaled by :math:`c_\text{approx}`, the number of evaluation qubits :math:`m` needs to be adjusted accordingly.
bn_bn: অবশেষে, আমরা শেষ কিউবিটে :math:`\big|1\rangle` সম্ভাবনা পরিমাপে আগ্রহী, যা :math:`\sin^2(a*x+b)` এর সাথে মিলে যাবার কথা। এই অনুমান গুলোর সাহায্যে আমরা এক্সপেক্টেশন মানগুলির নিকটবর্তী মাত্রাগুলো পেয়ে যাব। যত ছোট :math:`c_{approx}` এর মান হবে, আমাদের প্রাপ্ত অনুমান তত ভালো হবে। কিন্তু এখানে এটাও মাথায় রাখা দরকার যে যেহেতু অনুমানটি :math:`c_{approx}` এর ওপরে নির্ভর তাই মূল্যায়নের কিউবিটগুলোর সংখ্যা :math:`m` সেই অনুসারে সামঞ্জস্য করা দরকার।
ja: 最終的には、 :math:`\sin^2(a*x+b)` に対応する最後の量子ビットで :math:`\big|1\rangle` を測定する確率に関心があります。 上記の近似と合わせて、対象の値を近似できます。小さい :math:`c_\text{approx}` を選択するほど、近似は良くなります。 ただし、 :math:`c_\text{approx}` でスケーリングされたプロパティを推定しているため、それに応じて評価量子ビットの数 :math:`m` を調整する必要があります。

source: For more details on the approximation, we refer to: `Quantum Risk Analysis. Woerner, Egger. 2018. <https://www.nature.com/articles/s41534-019-0130-6>`__
bn_bn: অনুমান সম্পর্কিত বিস্তারিত জানার জন্য এই গবেষণাপত্রটি দেখো: `Quantum Risk Analysis. Woerner, Egger. 2018. <https://www.nature.com/articles/s41534-019-0130-6>`__
ja: 近似の詳細については、次を参照してください: `Quantum Risk Analysis. Woerner, Egger. 2018. <https://www.nature.com/articles/s41534-019-0130-6>`__

source: Evaluate Expected Payoff
bn_bn: প্রত্যাশিত পেঅফ নির্ধারণ করা
ja: 期待ペイオフの評価

source: Instead of constructing these circuits manually, Qiskit’s finance module offers the ``EuropeanCallPricing`` circuit, which already implements this functionality as building block.
bn_bn: এই বর্তনীগুলো (সার্কিট) হাতে করে( ম্যানুয়ালি) তৈরি না করে, Qiskit এর ব্যবস্থাপনাবিদ্যা (ফিনান্স) মডিউলে ``EuropeanCallPricing`` বর্তনী (সার্কিট) আছে, যা এই কার্যকারিতার বিল্ডিং ব্লক হিসাবে কাজ করে।
ja: これらの回路を手動で構築する代わりに、Qiskitの finance モジュールは ``EuropeanCallPricing`` 回路を提供しています。この回路は、この機能をビルディングブロックとしてすでに実装しています。

source: Evaluate Delta
bn_bn: ডেল্টা মূল্যায়ন করা
ja: デルタの評価

source: The Delta is a bit simpler to evaluate than the expected payoff. Similarly to the expected payoff, we use a comparator circuit and an ancilla qubit to identify the cases where :math:`S_T > K`. However, since we are only interested in the probability of this condition being true, we can directly use this ancilla qubit as the objective qubit in amplitude estimation without any further approximation.
bn_bn: প্রত্যাশিত পেঅফের চেয়ে ডেল্টা মূল্যায়ন করা কিছুটা সহজ। প্রত্যাশিত পেঅফ এর মতোই আমরা :math:`S_T \leq K` কেসগুলি সনাক্ত করতে একটি তুলনামূলক বর্তনী (সার্কিট) এবং একটি অ্যানসিলা কিউবিট ব্যবহার করি। তবে, যেহেতু আমরা কেবলমাত্র এই অবস্থা সত্য হওয়ার সম্ভাবনা সম্পর্কে আগ্রহী, তাই আমরা আরও কিছু অনুমান ছাড়াই সরাসরি বিস্তার অনুমানে এই অ্যানসিলা কিউবিট টি অবজেক্টিভ কিউবিট হিসাবে ব্যবহার করতে পারি।
ja: デルタは期待ペイオフよりも少し評価が簡単です。 期待ペイオフと同様に、コンパレータ回路と補助量子ビットを使用して、 :math:`S_T > K` の場合を特定します。しかしながら、この条件が真であるときの確率のみに興味があるので、振幅推定において他に何も仮定せずにこの補助量子ビットを直接目的量子ビットとして使うことができます。

source: We construct a circuit to load a log-normal random distribution into a quantum state. The distribution is truncated to a given interval :math:`[\text{low}, \text{high}]` and discretized using :math:`2^n` grid points, where :math:`n` denotes the number of qubits used. The unitary operator corresponding to the circuit implements the following:
ja: 対数正規分布を量子状態にロードする回路を構築します。 分布は :math:`[\text{low}, \text{high}]` で指定された区間に切り捨てられ、 :math:`2^n` グリッドに離散化されます。ここで :math:`n` は使用する量子ビット数です。この回路に対応するユニタリー演算子は、次のように実装されます:
