Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/tutorials/04_european_put_option_pricing.po
Languages: bn_bn, de, ko

source: This page was generated from `docs/tutorials/04_european_put_option_pricing.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/04_european_put_option_pricing.ipynb`__ থেকে বানানো হয়েছে।
de: Diese Seite wurde aus `docs/tutorials/04_european_put_option_pricing.ipynb`__ generiert.
ko: 이 페이지는 `docs/tutorials/04_european_put_option_pricing.ipynb`__ 에서 생성되었다.

source: Pricing European Put Options
bn_bn: ইউরোপীয় পুট বিকল্পের মূল্য নির্ধারণ
de: Bepreisung von Europäischen Put Optionen
ko: 가격 책정 유럽 통화 풋 옵션

source: Introduction
bn_bn: ভূমিকা
de: Einführung
ko: 소개

source: Suppose a European put option with strike price :math:`K` and an underlying asset whose spot price at maturity :math:`S_T` follows a given random distribution. The corresponding payoff function is defined as:
bn_bn: ধরুন স্ট্রাইক প্রাইস সহ একটি ইউরোপীয় পুট বিকল্প :math:`K` এবং একটি অন্তর্নিহিত সম্পদ যার পরিপক্কতায় স্পট মূল্য :math:`S_T` একটি প্রদত্ত এলোমেলো বিতরণ অনুসরণ করে। সম্পর্কিত পেওফ ফাংশনটি হিসাবে সংজ্ঞায়িত করা হয়:
de: Betrachte eine Europäische Put Option mit Ausübungspreis :math:`K` und einem zugrundeliegendem Asset mit Kassakurs bei Fälligkeit :math:`S_T`, die eine gegebene Zufallsverteilung befolgt. Die Auszahlungsfunktion ist gegeben als:
ko: 행사가격이 :math:`K` 인 유럽 풋 옵션과, 만기시 현물가격이 :math:`S_T` 인 기본 자산이 주어진 랜덤 분포를 따른다고 가정해자. 이에 상응하는 보수(payoff) 함수는 다음과 같이 정의할 수 있다:

source: In the following, a quantum algorithm based on amplitude estimation is used to estimate the expected payoff, i.e., the fair price before discounting, for the option:
bn_bn: নিম্নে একটি মানের (অ্যামপ্লিটিউড) উপর নির্ভরশীল কোয়ান্টাম অ্যালগোরিদম ব্যবহার করে প্রত্যাশিত পেঅফ, যা হলো ছাড় দেয়ার আগের আদর্শমূল্য, অনুমান করা হয়েছে।
de: Im Folgenden wird ein auf Amplitudenschätzung basierter Quantenalgorithmus verwendet, um die Erwartende Auszahlung, d. h. den beizulegenden Zeitpreis vor der Diskontierung für die Option abzuschätzen:
ko: 다음에서, 진폭 추정에 기초한 양자 알고리즘은 옵션에 대하여 예상되는 지불가격, 즉 할인 전에 적정 가격을 추정하는데 사용된다.

source: as well as the corresponding :math:`\Delta`, i.e., the derivative of the option price with respect to the spot price, defined as:
bn_bn: একই সাথে, সম্পর্কযুক্ত :math:`\Delta` অর্থাৎ স্পট দামের সাপেক্ষে বিকল্প দামের অন্তরকলন এভাবে সংজ্ঞাযিত:
de: sowie das entsprechende :math:` \Delta `, also die Ableitung des Optionspreises in Bezug auf den Spotpreis, definiert als:
ko: 뿐만 아니라 대응하는 :math:`\Delta`, 즉, 현물 가격에 대한 옵션 가격의 미분은 다음과 같이 정의된다:

source: The approximation of the objective function and a general introduction to option pricing and risk analysis on quantum computers are given in the following papers:
bn_bn: উদ্দেশ্য অন্বয়ের (অবজেক্টিভ ফাংশন) আনুমানিকতা এবং কোয়ান্টাম কম্পিউটারগুলিতে বিকল্প মূল্য নির্ধারণ এবং ঝুঁকি বিশ্লেষণের একটি সাধারণ ভূমিকা নিম্নলিখিত গবেষণাপত্রগুলোতে দেওয়া হয়েছে:
de: Die Näherung der Objektfunktion und eine allgemeine Einführung zur Kassapreisgestaltung und Risikoanalyse auf Quantencomputern findet man in folgenden Arbeiten:
ko: 목표 함수의 근사치와 양자 컴퓨터에 대한 옵션 가격 결정 및 위험 분석에 대한 일반 소개는 다음과 연구자료에서 설명한다.

source: Uncertainty Model
bn_bn: অনিশ্চয়তা মডেল
de: Modellunsicherheit
ko: 불확실성 모델

source: We construct a circuit to load a log-normal random distribution into a quantum state. The distribution is truncated to a given interval :math:`[\text{low}, \text{high}]` and discretized using :math:`2^n` grid points, where :math:`n` denotes the number of qubits used. The unitary operator corresponding to the circuit implements the following:
de: Es wird ein Schaltkreis konstruiert, um eine logarithmisch-normalisierte Zufallsverteilung in einen Quantenzustand zu laden. Die Verteilung wird auf ein bestimmtes Intervall :math:`[\text{low}, \text{high}]` zugeschnitten und mit :math:`2^n` Rasterpunkten diskretisiert, wobei :math:`n` die Anzahl der verwendeten Qubits bezeichnet. Der Einheitsoperator, der dem Schaltkreis entspricht, implementiert die folgenden Schritte:
ko: 로그 정규 랜덤 분포를 양자 상태로 로딩하기 위해 회로를 구성한다. 분포는 주어진 간격 :math:`[\text{low}, \text{high}]` 으로 잘리고 :math:`2^n` 격자점을 이용해 이산화되어 있으며, 여기서 :math:`n` 은 사용된 큐비트의 수를 나타낸다. 회로에 해당하는 유니타리 연산자는 다음을 구현한다:

source: where :math:`p_i` denote the probabilities corresponding to the truncated and discretized distribution and where :math:`i` is mapped to the right interval using the affine map:
bn_bn: যেখানে math:`p_i` খণ্ডিত এবং বিযুক্ত বিতরণগুলির সম্ভাবনা বোঝায় এবং :math:`i` অ্যাফাইন ম্যাপ ব্যবহার করে ডান ব্যবধানে ম্যাপ করা হয়েছে:
de: wobei :math:`p_i` die Wahrscheinlichkeiten bezeichnen, die der abgeschnittenen und diskretisierten Distribution entsprechen, und wobei :math:`i` dem richtigen Intervall unter Verwendung der affinen Abbildung zugeordnet wird:
ko: 여기서 :math:`p_i` 는 절단되고 분리된 분포에 대응하는 확률을 나타내며, :math:`i` 는 아핀 맵을 사용하여 우측 간격으로 맵핑된다:

source: Payoff Function
bn_bn: মূল্যনির্ধারণ অন্বয়
de: Auszahlungsfunktion
ko: 페이오프 함수

source: The payoff function decreases linearly with an increasing spot price at maturity :math:`S_T` until it reaches zero for a spot price equal to the strike price :math:`K`, it stays constant to zero for larger spot prices. The implementation uses a comparator, that flips an ancilla qubit from :math:`\big|0\rangle` to :math:`\big|1\rangle` if :math:`S_T \leq K`, and this ancilla is used to control the linear part of the payoff function.
bn_bn: পেওফের কাজটি পরিপক্কতায় :math:`S_T` বর্ধমান স্পট দামের সাথে রৈখিকভাবে হ্রাস পায় যতক্ষণ না এটি স্ট্রাইক দামের সমান স্পট দাম শূন্যে পৌঁছায় :math:`K`, এটি বড় স্পট দামের জন্য স্থির থাকে শূন্যের দিকে। প্রয়োগটি একটি তুলনাকারী ব্যবহার করে, এটি থেকে একটি অ্যানসিলা কিউবিট ফ্লিপ করে :math: `\big|0\rangle` থেকে: :math:`\big|1\rangle` যদি :math:`S_T \leq K`, এবং এই অ্যানসিলাটি পেওফ ফাংশনের লিনিয়ার অংশ নিয়ন্ত্রণ করতে ব্যবহৃত হয়।.
de: Die Auszahlungsfunktion fällt mit dem Kassapreis bei Fälligkeit :math:`S_T` ab, bis dieser null erreicht. Für einen Kassapreis gleich dem Ausübungspreis :math:`K`, bleibt sie konstant null für größere Kassapreise. Die Implementierung verwendet einen Komparator, das ein Hilfs-Qubit von :math:`\big|0\rangle` zu to :math:`\big|1\rangle` umdreht, wenn :math:`S_T \leq K` erfüllt ist. Dieses Hilfs-Qubit wird verwendet, um den linearen Teil der Auszahlungsfunktion zu steuern.
ko: 만기시 현물 가격의 합 :math:`(S_T^1 + S_T^2)`가 행사가 :math:`K` 보다 적고 선형 적으로 증가하는 한 지불 함수는 0이다. 만약 :math:`(S_T^1 + S_T^2) \geq K` 라면, 구현에서는 먼저 가중치 합산 연산자를 사용하여 현물 가격의 합계를 ancilla 레지스터로 계산 한 다음 비교기를 사용하여 ancilla 큐비트를 :math:`\big|0\rangle` 에서 :math:`\big|1\rangle` 로 뒤집는다.이 ancilla는 페이오프함수의 선형 부분을 제어하는 ​​데 사용된다.

source: The linear part itself is then approximated as follows. We exploit the fact that :math:`\sin^2(y + \pi/4) \approx y + 1/2` for small :math:`|y|`. Thus, for a given approximation rescaling scaling factor :math:`c_\text{approx} \in [0, 1]` and :math:`x \in [0, 1]` we consider
bn_bn: রৈখিক অংশটি অনুমান করতে তারপর এই পদ্ধতি ব্যবহার করা হয় - ছোট মান এর :math:`|y|` এর জন্যে :math:`\sin^2(y + \pi/4) \approx y + 1/2` হয় যে কারণে যেকোনো প্রদত্ত আনুমানিক আরোহী গুণক (স্কেলিং factor) :math:`c_{approx} \in [0, 1]` ও :math:`x \in [0, 1]` এর জন্যে আমরা ধরি
de: Der lineare Teil selbst wird dann wie folgt genähert: Man nutzt die Tatsache, dass :math:`\sin^2(y + \pi/4) \approx y + 1/2` für kleine :math:`|y|`. Man betrachtet für einen gegebenen Näherungs-Umskalierungsfaktor :math:`c_\text{approx} \in [0, 1]` und :math:`x \in [0, 1]
ko: 선형 부품 자체는 다음과 같이 근사화된다. 우리는 작은 :math:`|y|` 에 대해 :math:`\sin^2(y + \pi/4) \approx y + 1/2` 이라는 사실을 이용한다. 따라서 근사 배율 조정 계수 :math:`c_\text{approx} \in [0, 1]` 와 :math:`x \in [0, 1]` 가 주어졌을 때 우리는 다음을

source: \ for small :math:`c_\text{approx}`.
de: \ für kleine :math:`c_\text{approx}`.
ko: \ 작은 :math:`c_\text{approx}` 값에 대해 고려할 수 있다.

source: We can easily construct an operator that acts as
bn_bn: আমরা খুব সহজেই একটি চালক বানাতে পারি যেটা
de: Der zugehörige Operator kann einfach bestimmt werden. Der fungiert nämlich als
ko: 다음과 같이 작동하는 연산자를 쉽게 구성할 수 있다.

source: using controlled Y-rotations.
bn_bn: নিয়ন্ত্রিত ওয়াই-ঘূর্ণন (Y-রোটেশন) ব্যবহার করে।
de: unter Verwendung kontrollierter Y-Rotationen.
ko: 제어된 Y-회전을 이용하자.

source: Eventually, we are interested in the probability of measuring :math:`\big|1\rangle` in the last qubit, which corresponds to :math:`\sin^2(a*x+b)`. Together with the approximation above, this allows to approximate the values of interest. The smaller we choose :math:`c_\text{approx}`, the better the approximation. However, since we are then estimating a property scaled by :math:`c_\text{approx}`, the number of evaluation qubits :math:`m` needs to be adjusted accordingly.
bn_bn: অবশেষে, আমরা শেষ কিউবিটে :math:`\big|1\rangle` পরিমাপের সম্ভাবনাতে আগ্রহী, যেটা কিনা :math:`\sin^2(a*x+b)` এর সাথে মিলে যাবার কথা। এই অনুমান গুলোর সাহায্যে আমরা আগ্রহের মানগুলির নিকটবর্তী মাত্রাগুলো পেয়ে যাবো। যত ছোট :math:`c_{approx}` এর মান হবে, আমাদের প্রাপ্ত অনুমান তত ভালো হবে। কিন্তু এখানে এটাও মাথায় রাখা দরকার যে যেহেতু অনুমানটি :math:`c_{approx}` এর ওপরে নির্ভর তাই মূল্যায়নের কিউবিটগুলির সংখ্যা :math:`m` সেই অনুসারে সামঞ্জস্য করা দরকার।
de: Schließlich betrachtet man die Wahrscheinlichkeitsmessung im letzten Qubit :math:`\big|1\rangle`, welche :math:`\sin^2(a*x+b)` entspricht. Zusammen mit der obigen Näherung erlaubt dies die Näherung der Werte, die uns interessieren. Je kleiner :math:`c_\text{approx}` gewählt wird, desto besser die Näherung. Da jedoch eine durch :math:`c_\text{approx}` skalierte Eigenschaft geschätzt wird, muss die Anzahl der Bewertungsqubits :math:`m` entsprechend angepasst werden.
ko: 결국 우리는 마지막 큐비트에서 :math:`\big|1\rangle` 을 측정 할 확률에 관심이 있다. 이는 :math:`\sin^2(a*x+b)` 에 해당한다. 위의 근사치와 함께이를 통해 관심있는 값을 근사화 할 수 있다. :math:`c_\text{approx}` 를 작게 선택할수록 근사치가 더 좋다. 그러나 다음으로 :math:`c_\text{approx}` 에 의해 스케일링 된 속성을 추정하기 때문에 평가 큐비트 수 :math:`m` 을 적절히 조정해야한다.

source: For more details on the approximation, we refer to: `Quantum Risk Analysis. Woerner, Egger. 2018. <https://arxiv.org/abs/1806.06893>`__
bn_bn: অনুমান বিষয়ে বিশদে জানতে এই গবেষণাপত্রটি পড়ুন: `Quantum Risk Analysis. Woerner, Egger. 2018. <https://arxiv.org/abs/1806.06893>`__
de: Für Einzelheiten zur Approximation: `Quantum Risk Analysis. Woerner, Egger. 2018. <https://arxiv.org/abs/1806.06893>`__
ko: 근사화에 대한 더 자세한 내용은 `Quantum Risk Analysis. Woerner, Egger. 2018. <https://arxiv.org/abs/1806.06893>`__ 에서 참조할 수 있다.

source: Evaluate Expected Payoff
bn_bn: প্রত্যাশিত বেতন মূল্যনির্ধারণ করো
de: Auswertung Erwartete Auszahlung
ko: 기대수익 (Expected Payoff) 평가

source: Evaluate Delta
bn_bn: ডেল্টা মূল্যায়ন করো।
de: Auswertung Delta
ko: 델타 (Delta) 평가

source: The Delta is a bit simpler to evaluate than the expected payoff. Similarly to the expected payoff, we use a comparator circuit and an ancilla qubit to identify the cases where :math:`S_T \leq K`. However, since we are only interested in the (negative) probability of this condition being true, we can directly use this ancilla qubit as the objective qubit in amplitude estimation without any further approximation.
bn_bn: প্রত্যাশিত পেওফের চেয়ে ডেল্টা মূল্যায়ন করা কিছুটা সহজ। প্রত্যাশিত বেতন হিসাবে একইভাবে, আমরা কেসগুলি সনাক্ত করতে একটি তুলনামূলক সার্কিট এবং একটি অ্যান্সিলা কিউবিট ব্যবহার করি যেখানে :math:`S_T \leq K`. তবে, যেহেতু আমরা কেবলমাত্র এই অবস্থার সত্যতা হওয়ার (নেতিবাচক) সম্ভাবনা সম্পর্কে আগ্রহী, তাই আমরা আরও কিছুটা অনুমান ছাড়াই সরাসরি প্রশস্ততা অনুমানে এই আন্সিলার কিউবিটটি উদ্দেশ্য কিউবিট হিসাবে ব্যবহার করতে পারি।
de: Das Delta ist einfacher auszuwerten als die Erwartete Auszahlung. Ähnlich wie zuvor verwenden wir eine Komparatorschaltung und ein Hilfs-Qubit, um die Fälle zu identifizieren, in denen :math:`S_T \leq K` gilt. Da jedoch nur die (negative) Wahrscheinlichkeit der Bedingung von Interesse ist, können wir dieses Hilfs-Qubit direkt als Zielqubit in der Amplitudenschätzung ohne weitere Näherung verwenden.
ko: 델타의 값은 예상 급여보다 약간 더 간단하게 구할 수 있다. 예상 급여와 유사하게, 우리는 :math:`S_T \leq K` 인 사례들을 식별하기 위해 비교기 회로와 ancilla 큐비트를 사용한다. 하지만 우리는 이 조건이 참인 경우의 (음수) 확률에만 관심이 있기 때문에 진폭 추정에서 추가적인 근사 없이 바로 이 ancilla 큐비트를 목표 큐비트로 사용할 수 있다.
