Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/tutorials/05_bull_spread_pricing.po
Languages: bn_bn, te

source: This page was generated from `docs/tutorials/05_bull_spread_pricing.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/05_bull_spread_pricing.ipynb`__ থেকে নেয়া হয়েছে।
te: ఈ పేజీ `docs/tutorials/05_bull_spread_pricing.ipynb`__ నుండి రూపొందించబడింది.

source: Pricing Bull Spreads
bn_bn: বুল স্প্রেডের মূল্য নির্ধারণ
te: ప్రైసింగ్ బుల్ స్ప్రెడ్స్

source: Introduction
bn_bn: ভূমিকা
te: ఇంట్రొడక్షన్

source: Suppose a `bull spread <http://www.theoptionsguide.com/bull-call-spread.aspx>`__ with strike prices :math:`K_1 < K_2` and an underlying asset whose spot price at maturity :math:`S_T` follows a given random distribution. The corresponding payoff function is defined as:
bn_bn: ধরুন একটি `bull spread <http://www.theoptionsguide.com/bull-call-spread.aspx>`__ স্ট্রাইক প্রাইস সহ :math:`K_1 < K_2` এবং একটি অন্তর্নিহিত সম্পদ যার পরিপক্কতার স্পট মূল্য :math:`S_T` একটি প্রদত্ত এলোমেলো বন্টন অনুসরণ করে। সংশ্লিষ্ট পরিশোধ ফাংশনটি সংজ্ঞায়িত করা হয়েছে:
te: స్ట్రైక్ ధరలతో `బుల్ స్ప్రెడ్ <http://www.theoptionsguide.com/bull-call-spread.aspx>`__ ఉదాహరణగా తీస్కుకుంటే :math:`K_1 < K_2` మరియు మెచ్యూరిటీలో స్పాట్ ధర ఉన్న అంతర్లీన ఆస్తి :math:` S_T` ఇచ్చిన యాదృచ్ఛిక పంపిణీని అనుసరిస్తుంది. సంబంధిత చెల్లింపు ఫంక్షన్ ఇలా నిర్వచించబడింది:

source: In the following, a quantum algorithm based on amplitude estimation is used to estimate the expected payoff, i.e., the fair price before discounting, for the option:
bn_bn: নিম্নে বিস্তার অনুমানের উপর ভিত্তি করে একটি কোয়ান্টাম অ্যালগরিদম ব্যবহার করা হয় প্রত্যাশিত পেঅফ, অর্থাৎ ছাড়ের আগে ন্যায্য মূল্য অনুমান করা হয়েছে:
te: కింది వాటిలో, ఆంప్లిట్యూడ్ ఎస్టిమేషన్పై ఆధారపడిన క్వాంటం అల్గోరిథం ఆశించిన చెల్లింపును అంచనా వేయడానికి ఉపయోగించబడుతుంది, అంటే, ఎంపిక కోసం తగ్గింపుకు ముందు సరసమైన ధర:

source: as well as the corresponding :math:`\Delta`, i.e., the derivative of the option price with respect to the spot price, defined as:
bn_bn: একই সাথে, সম্পর্কযুক্ত :math:`\Delta` অর্থাৎ স্পট দামের সাপেক্ষে বিকল্প দামের অন্তরীকরণ এভাবে সংজ্ঞাযিত:
te: అలాగే సంబంధిత :math:`\Delta`, అనగా, స్పాట్ ధరకు సంబంధించి ఎంపిక ధర యొక్క ఉత్పన్నం, ఇలా నిర్వచించబడింది:

source: The approximation of the objective function and a general introduction to option pricing and risk analysis on quantum computers are given in the following papers:
bn_bn: উদ্দেশ্য অন্বয়ের (অবজেক্টিভ ফাংশন) আনুমানিকতা এবং কোয়ান্টাম কম্পিউটারগুলিতে বিকল্প মূল্য নির্ধারণ এবং ঝুঁকি বিশ্লেষণের একটি সাধারণ ভূমিকা নিম্নলিখিত গবেষণাপত্রগুলোতে দেওয়া হয়েছে:
te: ఆబ్జెక్టివ్ ఫంక్షన్ యొక్క ఉజ్జాయింపు మరియు క్వాంటం కంప్యూటర్లలో ఎంపిక ధర మరియు ప్రమాద విశ్లేషణకు సాధారణ పరిచయం క్రింది పేపర్లలో ఇవ్వబడ్డాయి:

source: Uncertainty Model
bn_bn: অনিশ্চয়তা মডেল
te: అన్సర్టైనిటీ మోడల్

source: where :math:`p_i` denote the probabilities corresponding to the truncated and discretized distribution and where :math:`i` is mapped to the right interval using the affine map:
bn_bn: যেখানে math:`p_i` অগ্রভাগহীন এবং বিযুক্ত বিতরণগুলির সম্ভাবনা বোঝায় এবং :math:`i` অ্যাফাইন ম্যাপ ব্যবহার করে ডান ব্যবধানে ম্যাপ করা হয়েছে:
te: ఇక్కడ :math:`p_i` అనేది ట్రంకేట్ చేయబడిన మరియు విచక్షణారహిత డిస్ట్రిబ్యూషన్కి సంబంధించిన సంభావ్యతలను సూచిస్తుంది మరియు ఇక్కడ :math:`i` అఫైన్ మ్యాప్‌ని ఉపయోగించి సరైన విరామానికి మ్యాప్ చేయబడుతుంది:

source: Payoff Function
bn_bn: বেতনের ফাংশন
te: పేఆఫ్ ఫంక్షన్

source: The payoff function equals zero as long as the spot price at maturity :math:`S_T` is less than the strike price :math:`K_1`, then increases linearly, and is bounded by :math:`K_2`. The implementation uses two comparators, that flip an ancilla qubit each from :math:`\big|0\rangle` to :math:`\big|1\rangle` if :math:`S_T \geq K_1` and :math:`S_T \leq K_2`, and these ancillas are used to control the linear part of the payoff function.
bn_bn: যখন স্পট মূল্য :math:`S_T` পরিপক্ক অবস্থায় স্ট্রাইক মূল্য :math:`K_1` এর চেয়ে কম তখন পে অফ অন্বয়ের মান শূন্য। তারপরে রৈখিকভাবে বৃদ্ধিপায় এবং এটি :math:`K_2` দ্বারা আবদ্ধ। প্রয়োগটি দুইটি তুলনাকারী ব্যবহার করে, যা অ্যানসিলা কিউবিট ফ্লিপ করে :math:`\big|0\rangle` থেকে :math:`\big|1\rangle` তে যদি :math:`S_T \geq K_1` এবং :math:`S_T \leq K_2` হয়। এই অ্যানসিলাগুলো পেঅফ অন্বয়ের রৈখিক অংশ নিয়ন্ত্রণ করতে ব্যবহৃত হয়।

source: The linear part itself is then approximated as follows. We exploit the fact that :math:`\sin^2(y + \pi/4) \approx y + 1/2` for small :math:`|y|`. Thus, for a given approximation rescaling factor :math:`c_\text{approx} \in [0, 1]` and :math:`x \in [0, 1]` we consider
bn_bn: রৈখিক অংশ (linear part) টি অনুমান করতে এই পদ্ধতি ব্যবহার করা হয় - ছোট মান এর :math:`|y|` এর জন্যে :math:`\sin^2(y + \pi/4) \approx y + 1/2` হয়। সুতরাং, একটি প্রদত্ত আনুমানিক রিস্কেলিং ফ্যাক্টর :math:`c_\text{approx} \in [0, 1]` এবং :math:`x \in [0, 1]` এর জন্য আমরা বিবেচনা করি
te: లీనియర్ పార్ట్ కూడా ఈ క్రింది విధంగా ఆ తరువాత అంచనా వేయబడింది. మనము చిన్న :math:`|y|` కోసం :math:`\sin^2(y + \pi/4) \ approx y + 1/2` అనే వాస్తవాన్ని ఉపయోగించుకుంటాము. ఈ విధంగా, ఇవ్వబడిన అప్ప్రోక్సిమేషన్ రీస్కేలింగ్ కారకం కోసం :math:`c_\text{approx} \in [0, 1]` మరియు :math:`x \in [0, 1]` ని కన్సిడర్ చేసుకుంటాము

source: for small :math:`c_\text{approx}`.
bn_bn: ছোট :math:`c_{approx}`এর জন্যে।
te: చిన్న :math:`c_\text{approx}` కోసం.

source: We can easily construct an operator that acts as
bn_bn: আমরা খুব সহজেই একটি অপারেটর বানাতে পারি যেটা
te: మనము సులభంగా పనిచేసే ఆపరేటర్‌ని నిర్మించగలము

source: using controlled Y-rotations.
bn_bn: নিয়ন্ত্রিত Y-ঘূর্ণন ব্যবহার করে।
te: నియంత్రిత Y- రోటేషన్లని ఉపయోగించడం.

source: Eventually, we are interested in the probability of measuring :math:`\big|1\rangle` in the last qubit, which corresponds to :math:`\sin^2(a*x+b)`. Together with the approximation above, this allows to approximate the values of interest. The smaller we choose :math:`c_\text{approx}`, the better the approximation. However, since we are then estimating a property scaled by :math:`c_\text{approx}`, the number of evaluation qubits :math:`m` needs to be adjusted accordingly.
bn_bn: অবশেষে, আমরা শেষ কিউবিটে :math:`\big|1\rangle` পরিমাপের সম্ভাবনাতে আগ্রহী, যেটা কিনা :math:`\sin^2(a*x+b)` এর সাথে মিলে যাবার কথা। এই অনুমান গুলোর সাহায্যে আমরা আগ্রহের মানগুলির নিকটবর্তী মাত্রাগুলো পেয়ে যাব। যত ছোট :math:`c_{approx}` এর মান হবে, তত ভালো হবে আমাদের প্রাপ্ত অনুমান। কিন্তু এখানে এটাও মাথায় রাখা দরকার যে যেহেতু অনুমানটি :math:`c_{approx}` এর ওপরে নির্ভর তাই মূল্যায়নের কিউবিটগুলির সংখ্যা :math:`m` সেই অনুসারে সামঞ্জস্য করা দরকার।
te: చివరికి, చివరి క్కుబిట్లో :math:`\big|1\rangle`ని కొలిచే సంభావ్యతపై మనము ఆసక్తి కలిగి ఉన్నాము, ఇది :math:`\sin^2(a*x+b)`కి అనుగుణంగా ఉంటుంది. పైన ఉన్న అప్ప్రోక్సిమేషన్తో కలిపి, ఇది ఆసక్తి విలువలను అంచనా వేయడానికి అనుమతిస్తుంది. మనము ఎంత చిన్నదిగా ఎంచుకుంటే :math:`c_\text{approx}`, అప్ప్రోక్సిమేషన్ అంత మంచిది. అయితే, మనము అప్పుడు :math:`c_\text{approx}` ద్వారా స్కేల్ చేయబడిన ఆస్తిని అంచనా వేస్తున్నందున, మూల్యాంకన క్కుబిట్ల సంఖ్య :math:`m` దానికి అనుగుణంగా సర్దుబాటు చేయాలి.

source: For more details on the approximation, we refer to: `Quantum Risk Analysis. Woerner, Egger. 2018. <https://arxiv.org/abs/1806.06893>`__
bn_bn: আনুমানিকতা সম্পর্কে আরো বিস্তারিত জানার জন্য, আমরা উল্লেখ করি: `Quantum Risk Analysis. Woerner, Egger. 2018. <https://arxiv.org/abs/1806.06893>`__
te: అప్ప్రోక్సిమేషన్పై మరిన్ని వివరాల కోసం, మేము వీటిని సూచిస్తాము: `క్వాంటం రిస్క్ అనాలిసిస్. వోర్నర్, ఎగ్గర్. 2018. <https://arxiv.org/abs/1806.06893>`__

source: Evaluate Expected Payoff
bn_bn: প্রত্যাশিত বেতন মূল্যনির্ধারণ
te: ఆశించిన పే ఆఫ్ ని ఎవాల్యూయేట్ చేయండి

source: Evaluate Delta
bn_bn: ডেল্টা মূল্যায়ন
te: డెల్టాను ఎవాల్యూయేట్ చేయండి

source: The Delta is a bit simpler to evaluate than the expected payoff. Similarly to the expected payoff, we use comparator circuits and ancilla qubits to identify the cases where :math:`K_1 \leq S_T \leq K_2`. However, since we are only interested in the probability of this condition being true, we can directly use an ancilla qubit as the objective qubit in amplitude estimation without any further approximation.
bn_bn: প্রত্যাশিত পে-অফের চেয়ে ডেল্টা মূল্যায়ন করা কিছুটা সহজ। একইভাবে প্রত্যাশিত বেতন হিসাবে, আমরা যেসবক্ষেত্রে :math:`K_1 \leq S_T \leq K_2` হয়, সেগুলো শনাক্ত করতে একটি তুলনামূলক সার্কিট এবং একটি অ্যানসিলা কিউবিট ব্যবহার করি। তবে, যেহেতু আমরা কেবলমাত্র এই অবস্থার সত্য হওয়ার সম্ভাবনা সম্পর্কে আগ্রহী, তাই আমরা আর কোনো অনুমান ছাড়াই সরাসরি একটি অ্যানসিলা কিউবিটকে উদ্দেশ্যমূলক কিউবিট (অবজেক্টিভ কিউবিট) হিসাবে বিস্তার অনুমানে (অ্যামপ্লিটিউড এস্টিমেশন) ব্যবহার করতে পারি।
te: డెల్టా ఊహించిన పే ఆఫ్ కంటే కొంచెం సరళంగా ఎవాల్యూయేట్ చేయబడుతుంది. ఆశించిన చెల్లింపుల మాదిరిగానే, మనము కంపారిటర్ సర్క్యూట్‌లు మరియు యాన్సిల్లా క్విట్‌లను ఉపయోగించి :math:`K_1 \leq S_T \leq K_2` కేసులని అంచనా వేస్తాము. అయినప్పటికీ, ఈ పరిస్థితి నిజమయ్యే సంభావ్యతపై మాత్రమే మనము ఆసక్తి కలిగి ఉన్నందున, మనము తదుపరి అప్ప్రోక్సిమేషన్ లేకుండా యాంప్లిట్యూడ్ అంచనాలో ఆబ్జెక్టివ్ క్కుబిట్గా నేరుగా యాన్సిల్లా క్కుబిట్ని ఉపయోగించవచ్చు.

source: We construct a circuit to load a log-normal random distribution into a quantum state. The distribution is truncated to a given interval :math:`[\text{low}, \text{high}]` and discretized using :math:`2^n` grid points, where :math:`n` denotes the number of qubits used. The unitary operator corresponding to the circuit implements the following:
te: లాగ్-నార్మల్ యాదృచ్ఛిక డిస్ట్రిబ్యూషన్ని క్వాంటం స్టేట్కి లోడ్ చేయడానికి మనము సర్క్యూట్‌ను నిర్మిస్తాము. పంపిణీ ఇవ్వబడిన ఇంటర్వెల్ :math:`[\text{low}, \text{high}]` కి కుదించబడింది మరియు :math:`2^n` గ్రిడ్ పాయింట్‌లను ఉపయోగించి వివేచన చేయబడింది, ఇక్కడ :math:`n` క్యుబిట్ల సంఖ్యను సూచిస్తుంది. . సర్క్యూట్‌కు సంబంధించిన యూనిటరీ ఆపరేటర్ కింది వాటిని ఇంప్లిమెంట్ చేస్తుంది:
