Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/tutorials/06_basket_option_pricing.po
Languages: bn_bn

source: This page was generated from `docs/tutorials/06_basket_option_pricing.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/06_basket_option_pricing.ipynb`__ থেকে নেয়া হয়েছে।

source: Pricing Basket Options
bn_bn: প্রাইসিং বাস্কেট অপশন

source: Introduction
bn_bn: ভূমিকা

source: Suppose a basket option with strike price :math:`K` and two underlying assets whose spot price at maturity :math:`S_T^1`, :math:`S_T^2` follow given random distributions. The corresponding payoff function is defined as:
bn_bn: ধরুন আপনাকে একটি ঝুড়ি দেওয়া হলো যার মূল্য :math:`K` এবং তার সাথে দেওয়া হলো দুটি অন্তর্নিহিত সম্পদ যার পরিপক্কতায় দাম হবে :math:`S_T^1`, :math:`S_T^2`। আপনাকে এটাও বলা হলো যে এই ভেরিয়েবলগুলি অভিন্ন বিতরণ অনুসরণ করে। তাহলে পে-অফ ফাংশনটি নিম্নলিখিত উপায়ে সংজ্ঞায়িত করা হয়:

source: In the following, a quantum algorithm based on amplitude estimation is used to estimate the expected payoff, i.e., the fair price before discounting, for the option:
bn_bn: নিম্নে একটি মানের বিস্তারের উপর নির্ভরশীল কোয়ান্টাম অ্যালগোরিদম ব্যবহার করে প্রত্যাশিত পে-অফ, যা হলো ছাড় দেয়ার আগের আদর্শমূল্য, অনুমান করা হয়েছে:

source: The approximation of the objective function and a general introduction to option pricing and risk analysis on quantum computers are given in the following papers:
bn_bn: উদ্দেশ্য অন্বয়ের (অবজেক্টিভ ফাংশন) আনুমানিকতা এবং কোয়ান্টাম কম্পিউটারগুলিতে বিকল্প মূল্য নির্ধারণ এবং ঝুঁকি বিশ্লেষণের একটি সাধারণ ভূমিকা নিম্নলিখিত গবেষণাপত্রগুলোতে দেওয়া হয়েছে:

source: Uncertainty Model
bn_bn: অনিশ্চয়তা মডেল

source: We construct a circuit factory to load a multivariate log-normal random distribution into a quantum state on :math:`n` qubits. For every dimension :math:`j = 1,\ldots,d`, the distribution is truncated to a given interval :math:`[\text{low}_j, \text{high}_j]` and discretized using :math:`2^{n_j}` grid points, where :math:`n_j` denotes the number of qubits used to represent dimension :math:`j`, i.e., :math:`n_1+\ldots+n_d = n`. The unitary operator corresponding to the circuit factory implements the following:
bn_bn: আমরা :math:`n` কিউবিটের সাহায্যে একটি মাল্টিভিয়ারেট লগ-নর্মাল দৈব বিতরণকে কোয়ান্টামের স্টেটে জাঁতান করার জন্য একটি সার্কিট কারখানা তৈরি করি। প্রত্যেক :math:`j = 1,\ldots,d` মাত্রা (dimension) এর জন্যে বিতরণ একটি নির্দিষ্ট বিরতিতে :math:`[\text{low}_j, \text{high}_j]` কাটা হয় এবং সেগুলি :math:`2^{n_j}` গ্রিড পয়েন্ট ব্যবহার করে বিযুক্ত করা হয়। এখানে :math:`n_j` কিউবিট দ্বারা :math:`j`, i.e., :math:`n_1+\ldots+n_d = n` মাত্রা র বর্ণনা করা হচ্ছে। সার্কিট কারখানার অনুরূপ ইউনিটরি অপারেটর নিম্নলিখিতগুলিকে প্রয়োগ করে:

source: where :math:`p_{i_1\ldots i_d}` denote the probabilities corresponding to the truncated and discretized distribution and where :math:`i_j` is mapped to the right interval using the affine map:
bn_bn: যেখানে math:`p_{i_1\ldots i_d}` কাটা এবং বিযুক্ত বিতরণগুলির সম্ভাবনা বোঝায় এবং :math:`i_j` অ্যাফাইন ম্যাপ ব্যবহার করে ডান ব্যবধানে ম্যাপ করা হয়েছে:

source: For simplicity, we assume both stock prices are independent and identically distributed. This assumption just simplifies the parametrization below and can be easily relaxed to more complex and also correlated multivariate distributions. The only important assumption for the current implementation is that the discretization grid of the different dimensions has the same step size.
bn_bn: আমরা এখানে সরলতার জন্যে ধরে নিই যে উভয় স্টকের দামই স্বাধীন এবং অভিন্নরূপে বণ্টিত। এই ধৃষ্টতার ফলে নিচে দেওয়া পরামিতি গুলি সরল হয় ওঠে। এগুলি এবার আরো জটিল এবং সম্পর্কিত বহু বিতরণে বণ্টিত হয়। বর্তমান বাস্তবায়নের জন্য একমাত্র গুরুত্বপূর্ণ অনুমান হল যে বিভিন্ন মাত্রার বিচ্ছিন্নতা গ্রিডের একই ধাপের আকার রয়েছে।

source: Payoff Function
bn_bn: বেতনের ফাংশন

source: The payoff function equals zero as long as the sum of the spot prices at maturity :math:`(S_T^1 + S_T^2)` is less than the strike price :math:`K` and then increases linearly. The implementation first uses a weighted sum operator to compute the sum of the spot prices into an ancilla register, and then uses a comparator, that flips an ancilla qubit from :math:`\big|0\rangle` to :math:`\big|1\rangle` if :math:`(S_T^1 + S_T^2) \geq K`. This ancilla is used to control the linear part of the payoff function.
bn_bn: যতক্ষণ :math:`(S_T^1 + S_T^2)` (পরিপক্কতা দাম) মূল্য :math:`K` থেকে কম থাকছে ততক্ষণ পর্যন্ত বেতন এর অপেক্ষক শূন্য থাকবে। মূল্যের অধিক হলে অপেক্ষকটির মান রৈখিকভাবে বৃদ্ধি হয়। দামের যোগফলকে একটি অনসিল্লা রেজিস্টারে গণনা করতে আমরা এখানে যোগফলের ব্যবহার করছি। যদি :math:`(S_T^1 + S_T^2) \geq K` হয় তাহলে এটি একটি তুলনামূলক ব্যবহার করে যেটা একটি আনুষঙ্গিক (অন্সিল্লা) কুইবিটকে :math:`\big|0\rangle` থেকে উল্টে দেয়। আনুসঙ্গিক বা আন্সিল্লাটি বেতন অপেক্ষক এর রৈখিকভাবে চালাতে সাহায্য করে।

source: The linear part itself is approximated as follows. We exploit the fact that :math:`\sin^2(y + \pi/4) \approx y + 1/2` for small :math:`|y|`. Thus, for a given approximation rescaling factor :math:`c_\text{approx} \in [0, 1]` and :math:`x \in [0, 1]` we consider
bn_bn: রৈখিক অংশটি অনুমান করতে এই পদ্ধতি ব্যবহার করা হয় - ছোট মান এর :math:`|y|` এর জন্যে :math:`\sin^2(y + \pi/4) \approx y + 1/2` হয় যে কারণে যেকোনো প্রদত্ত আনুমানিক আরোহী গুণক (স্কেলিং factor) :math:`c_{approx} \in [0, 1]` ও :math:`x \in [0, 1]` এর জন্যে আমরা ধরি

source: \ for small :math:`c_\text{approx}`.
bn_bn: ছোট :math:`c_\text{approx}`এর জন্যে।

source: We can easily construct an operator that acts as
bn_bn: আমরা খুব সহজেই একটি অপারেটর বানাতে পারি যা

source: using controlled Y-rotations.
bn_bn: নিয়ন্ত্রিত ওয়াই-ঘূর্ণন (Y-রোটেশন) ব্যবহার করে।

source: Eventually, we are interested in the probability of measuring :math:`\big|1\rangle` in the last qubit, which corresponds to :math:`\sin^2(a*x+b)`. Together with the approximation above, this allows to approximate the values of interest. The smaller we choose :math:`c_\text{approx}`, the better the approximation. However, since we are then estimating a property scaled by :math:`c_\text{approx}`, the number of evaluation qubits :math:`m` needs to be adjusted accordingly.
bn_bn: অবশেষে, আমরা শেষ কিউবিট :math:`\big|1\rangle` পরিমাপের সম্ভাবনাতে আগ্রহী, যেটা কিনা :math:`\sin^2(a*x+b)` এর সাথে মিলে যাবার কথা। এই অনুমানগুলোর সাহায্যে আমরা আগ্রহের মানগুলির নিকটবর্তী মাত্রাগুলো পেয়ে ষাব। যত ছোট :math:`c_{approx}` এর মান হবে, তত ভালো হবে আমাদের প্রাপ্ত অনুমান। কিন্তু এখানে এটাও মাথায় রাখা দরকার যে যেহেতু অনুমানটি :math:`c_{approx}` এর ওপরে নির্ভর তাই মূল্যায়নের কিউবিট সংখ্যা :math:`m` সেই অনুসারে সামঞ্জস্য করা দরকার।

source: For more details on the approximation, we refer to: `Quantum Risk Analysis. Woerner, Egger. 2018. <https://arxiv.org/abs/1806.06893>`__
bn_bn: আনুমানিকতা সম্পর্কে আরো বিস্তারিত জানার জন্য, আমরা উল্লেখ করি: `Quantum Risk Analysis. Woerner, Egger. 2018. <https://arxiv.org/abs/1806.06893>`__

source: Since the weighted sum operator (in its current implementation) can only sum up integers, we need to map from the original ranges to the representable range to estimate the result, and reverse this mapping before interpreting the result. The mapping essentially corresponds to the affine mapping described in the context of the uncertainty model above.
bn_bn: যেহেতু ভারিত সমষ্টি অপারেটর (এর বর্তমান বাস্তবায়নে) কেবলমাত্র পূর্ণসংখ্যাগুলি যোগ করতে পারে তাই ফলাফলটি অনুমান করার জন্য আমাদের মূল পরিসীমা থেকে উপস্থাপনযোগ্য পরিসরে মানচিত্র তৈরি করতে হবে এবং ফলাফলটি ব্যাখ্যা করার আগে এই ম্যাপিংটি উল্টাতে করতে হবে। এই ম্যাপিং মূলত উপরের অনিশ্চয়তার মডেলের প্রসঙ্গে বর্ণিত অ্যাফাইন ম্যাপিংয়ের অনুরূপ।

source: Evaluate Expected Payoff
bn_bn: প্রত্যাশিত বেতন মূল্যনির্ধারণ করো

source: We first verify the quantum circuit by simulating it and analyzing the resulting probability to measure the :math:`|1\rangle` state in the objective qubit.
bn_bn: আমরা প্রথমে কোয়ান্টাম সার্কিটটি তা অনুকরণ করি এবং :math:`|1\rangle` স্টিথিটি উদ্দেশ্য কুইবেটে পরিমাপ করার ফলাফল সম্ভাবনা বিশ্লেষণ করে যাচাই করি।

source: Next we use amplitude estimation to estimate the expected payoff.
bn_bn: এর পরে আমরা প্রশস্ততা অনুমানের দ্বারা প্রাপ্য বেতন অনুমান করি।
