Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/tutorials/08_fixed_income_pricing.po
Languages: bn_bn, fr, ja, ko_kr

source: This page was generated from `docs/tutorials/08_fixed_income_pricing.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/08_fixed_income_pricing.ipynb`__ থেকে নেয়া হয়েছে।
fr: Cette page a été générée et traduite à partir de `docs/tutorials/08_fixed_income_pricing.ipynb`__.
ja: このページは `docs/tutorials/08_fixed_income_pricing.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `docs/tutorials/08_fixed_income_pricing.ipynb`__ 에서 생성되었다.

source: Pricing Fixed-Income Assets
bn_bn: *Pricing Fixed-Income Assets* (*নির্দিষ্ট আয় সম্পদ মূল্য নির্ধারণ*)
fr: Prix des actifs à revenu fixe
ja: 固定収入資産の価格推定
ko_kr: 가격 고정-수입 자산

source: Introduction
bn_bn: ভূমিকা
ja: はじめに
ko_kr: 소개

source: We seek to price a fixed-income asset knowing the distributions describing the relevant interest rates. The cash flows :math:`c_t` of the asset and the dates at which they occur are known. The total value :math:`V` of the asset is thus the expectation value of:
bn_bn: প্রাসঙ্গিক সুদের হারগুলি বর্ণনা করে এমন বিতরণগুলি জেনে আমরা একটি নির্দিষ্ট-আয়ের সম্পদের মূল্য চাই। সম্পদের নগদ :math:`c_t` প্রবাহ এবং যে তারিখে তারা ঘটে সেগুলি জানা যায়। সম্পত্তির মোট মূল্য :math:`V` হল এর গড় মান:
fr: Nous cherchons à évaluer le prix d'un actif à revenu fixe en connaissant les distributions décrivant les taux d'intérêt inhérents. Les flux de trésorerie :math:`c_t` de l'actif et les dates auxquelles ils se produisent sont connus. La valeur totale :math:`V` de l'actif est donc la valeur attendue de :
ja: 我々は金利の確率分布が分かっている固定収入資産の価格推定をします。資産のキャッシュフロー :math:`c_t` とキャッシュフローの期日は既知とします。資産の合計価値 :math:`V` は次の期待値になります：
ko_kr: 우리는 관련 이자율을 설명하는 분포를 아는 고정 수입 자산에 가격을 매기려고 한다. 자산의 현금 유동성 :math:`c_t` 와 발생일자는 알려져있다. 따라서 자산의 총 값 :math:`V` 는 다음의 기댓값이다.

source: Each cash flow is treated as a zero coupon bond with a corresponding interest rate :math:`r_t` that depends on its maturity. The user must specify the distribution modeling the uncertainty in each :math:`r_t` (possibly correlated) as well as the number of qubits he wishes to use to sample each distribution. In this example we expand the value of the asset to first order in the interest rates :math:`r_t`. This corresponds to studying the asset in terms of its duration. The approximation of the objective function follows the following paper: `Quantum Risk Analysis. Woerner, Egger. 2018. <https://arxiv.org/abs/1806.06893>`__
bn_bn: প্রতিটি নগদ প্রবাহকে শূন্য কুপন বন্ড হিসেবে বিবেচনা করা হয় যার সাথে সংশ্লিষ্ট সুদের হার :math:`r_t` যা তার পরিপক্কতার উপর নির্ভর করে। ব্যবহারকারীকে অবশ্যই প্রতিটি :math:`r_t` (সম্ভবত পারস্পরিক সম্পর্কযুক্ত) অনিশ্চয়তার বণ্টন মডেলিং নির্দিষ্ট করতে হবে এবং সেইসাথে প্রতিটি বন্টনের নমুনার জন্য তিনি যে কিউবিটগুলি ব্যবহার করতে চান তা উল্লেখ করতে হবে। এই উদাহরণে আমরা সম্পদের মান সুদের হারে প্রথম অর্ডারে প্রসারিত করি :math:`r_t`। এটি সম্পদের সময়কাল অনুসারে অধ্যয়নের সাথে মিলে যায়। উদ্দেশ্য ফাংশনের আনুমানিকতা নিম্নলিখিত গবেষণা অনুসরণ করে: `Quantum Risk Analysis. Woerner, Egger. 2018. <https://arxiv.org/abs/1806.06893>`__
fr: Chaque flux de trésorerie est traité comme une obligation zéro-coupon avec un taux d'intérêt correspondant :math:`r_t` qui dépend de sa maturité. L'utilisateur doit spécifier la distribution modélisant l'incertitude pour chaque :math:`r_t` (probablement corrélés) ainsi que le nombre de qubits qu'il souhaite utiliser pour échantillonner chaque distribution. Dans cet exemple, nous développons la valeur de l'actif au premier ordre par rapport au taux d'intérêt :math:`r_t`. Cela correspond à l'étude de l'actif en fonction de sa durée. L'approximation de la fonction objectif suit le document suivant: `Quantum Risk Analysis. Woerner, Egger. 2018. <https://arxiv.org/abs/1806.06893>`__
ja: 各キャッシュフローは、満期日に依存する、金利 :math:`r_t` のゼロ・クーポン債として扱われます。ユーザーは各 :math:`r_t` の(相関する可能性がある)不確実性モデルの確率分布と、サンプルに使う量子ビット数を指定しなければなりません。この例では我々は資産価値を金利 :math:`r_t` の一次関数で展開します。これは資産を期間の観点で調査することにあたります。目的関数の近似は次の論文に従います： `Quantum Risk Analysis. Woerner, Egger. 2018. <https://arxiv.org/abs/1806.06893>`__
ko_kr: 각각의 현금 유동성은 그의 성숙에 의존하는 대응하는 이자율 :math:`r_t` 을 갖는 제로 쿠폰 결합으로서 취급된다. 사용자는 각각의 :math:`r_t` (가능하게는 상관된) 에 대한 불확실성뿐만 아니라 각각의 분포를 샘플링하기 위해 사용하고자 하는 쿼비트들의 수를 모델링하는 것을 명시해야 한다. 이 예제에서는 이자 비율 :math:`r_t` 에서 자산의 값을 1차로 확장한다. 이것은 자산의 지속 기간 측면에서 자산을 연구하는 것에 해당한다. 목표 함수의 근사값은 다음과 같은 논문을 따른다. `Quantum Risk Analysis. Woerner, Egger. 2018. <https://arxiv.org/abs/1806.06893>`__

source: Uncertainty Model
bn_bn: অনিশ্চয়তা মডেল
fr: Modèle d'incertitude
ja: 不確実性モデル
ko_kr: 불확실성 모델

source: We construct a circuit to load a multivariate normal random distribution in :math:`d` dimensions into a quantum state. The distribution is truncated to a given box :math:`\otimes_{i=1}^d [low_i, high_i]` and discretized using :math:`2^{n_i}` grid points, where :math:`n_i` denotes the number of qubits used for dimension :math:`i = 1,\ldots, d`. The unitary operator corresponding to the circuit implements the following:
fr: Nous construisons un circuit afin de représenter une distribution aléatoire en dimension :math:`d` sur un état quantique sur :math:`n` qubits. La distribution est limitée à l'intervalle :math:`\otimes_{i=1}^d [low_i, high_i]` et discrétisée en utilisant :math:`2^{n_i}` points, où :math:`n_i`: correspond au nombre de qubits utilisés. L'opérateur unitaire correspondant à ce circuit est le suivant :
ja: :math:`d` 次元多変量正規分布を量子状態にロードする回路を構築します。その分布は所与のボックス :math:`\otimes_{i=1}^d [low_i, high_i]` に切り詰め、 :math:`2^{n_i}` グリッドに離散化します。ここで :math:`n_i` は、 :math:`i = 1,\ldots, d` 次元で使用される量子ビット数です。この回路のユニタリー演算子は次のようになります:
ko_kr: :math:`d` 차수의 다변량 정규 무작위 분포를 양자 상태로 로딩하기 위해 회로를 구성한다. 분포는 주어진 박스 :math:`\otimes_{i=1}^d [low_i, high_i]` 으로 잘리고 :math:`2^{n_i}` 격자점을 이용해 이산화되어 있으며, 여기서 :math:`n_i` 는 :math:`i = 1,\ldots, d` 차원을 나타내는데 사용되는 큐비트 수를 나타낸다. 회로에 해당하는 유니타리 연산자는 다음을 구현한다:

source: where :math:`p_{i_1, ..., i_d}` denote the probabilities corresponding to the truncated and discretized distribution and where :math:`i_j` is mapped to the right interval :math:`[low_j, high_j]` using the affine map:
bn_bn: যেখানে :math:`p_{i_1, ..., i_d}` সংক্ষিপ্ত এবং বিযুক্ত বিতরণগুলির সম্ভাবনা বোঝায় এবং :math:`i_j` অ্যাফাইন ম্যাপ ব্যবহার করে :math:`[low_j, high_j]` ডান বিরতি ব্যবধানে ম্যাপ করা হয়েছে:
fr: où :math:`p_{i_1, ..., i_d}` représentent les probabilités de chaque distribution tronquée et discrétisée et où :math:`i_j` est mappé sur l'intervalle approprié :math:`[low_j, high_j]` en utilisant la relation affine suivante :
ja: ここで :math:`p_{i_1, ..., i_d}` は、切り捨てられ離散化された分布を与える確率を表し、 :math:`i_j` はアフィン写像で得られた正しい区間 :math:`[low_j, high_j]` です。
ko_kr: 여기서, :math:`p_{i_1, ..., i_d}` 는 절단되고 이산화된 분포에 해당하는 확률을 나타내며, 여기서 :math:`i_j` 는 아핀 맵을 사용하여 오른쪽 간격 :math:`[low_j, high_j]` 에 맵핑된다.

source: In addition to the uncertainty model, we can also apply an affine map, e.g. resulting from a principal component analysis. The interest rates used are then given by:
ko_kr: 불확실성 모델 외에도 아핀 맵 (affine map)을 적용할 수도 있다 (예: 주성분 분석 결과). 다음에 사용되는 이자율은 이렇게 제공된다.

source: where :math:`\vec{x} \in \otimes_{i=1}^d [low_i, high_i]` follows the given random distribution.
bn_bn: যেখানে :math:`\vec{x} \in \otimes_{i=1}^d [low_i, high_i]` প্রদত্ত দৈব (random) বণ্টন অনুসরণ করে।
fr: où :math:\vec{x} \in \otimes_{i=1}^d [low_i, high_i]` suit une distribution aléatoire donnée.
ja: ここで :math:`\vec{x} \in \otimes_{i=1}^d [low_i, high_i]` は与えられた確率分布に従います。
ko_kr: 여기서 :math:`\vec{x} \in \otimes_{i=1}^d [low_i, high_i]` 는 주어진 무작위 분포를 따른다.

source: Cash flow, payoff function, and exact expected value
bn_bn: নগদ প্রবাহ, পে-অফ ফাংশন এবং সঠিক গড় মান
fr: Flux de trésorerie, fonction de paiement et valeur attendue
ja: キャッシュフロー、ペイオフ関数、そして正確な期待値
ko_kr: 현금 유동성, 보수 함수(payoff function) 및 정확한 기대값

source: In the following we define the cash flow per period, the resulting payoff function and evaluate the exact expected value.
bn_bn: নিম্নলিখিত অংশটিতে আমরা সময়কালে নগদ প্রবাহ সংজ্ঞায়িত করি, ফলাফলের পে-অফ ফাংশন এবং সঠিক গড় মানটি মূল্যায়ন করি।
fr: Dans ce qui suit, nous définissons le flux de trésorerie par période, la fonction de paiement qui en résulte et évaluons la valeur attendue.
ja: 以下では、期間あたりのキャッシュフロー、結果として得られるペイオフ関数を定義し、正確な期待値を評価します。
ko_kr: 다음으로 기간당 현금 유동성, 보수 함수를 정의하고 정확한 기대값을 평가한다.

source: For the payoff function we first use a first order approximation and then apply the same approximation technique as for the linear part of the payoff function of the `European Call Option <03_european_call_option_pricing.ipynb>`__.
bn_bn: পে-অফ ফাংশনের জন্য আমরা প্রথমে, প্রথম অর্ডার অনুমান ব্যবহার করি এবং তারপরে `European Call Option <03_european_call_option_pricing.ipynb>`__ এর পে-অফ ফাংশনের রৈখিক অংশের মতো একই আনুমানিক পদ্ধতি প্রয়োগ করি।
fr: Pour la fonction de paiement, nous utilisons d'abord une approximation de premier ordre, puis on applique la même technique d'approximation que pour la partie linéaire de la fonction de paiement de l'option d'achat Européenne "European Call Option <03_european_call_option_pricing.ipynb>`__.
ja: ペイオフ関数は、最初に一次近似を使用しますが、その後 `ヨーロピアン・コール・オプション <03_european_call_option_pricing.ipynb>`__ のペイオフ関数の線形部分と同じ近似テクニックを適用します。
ko_kr: 보상 함수의 경우 먼저 1차 근사를 사용하고 `유럽식 콜 옵션 <03_european_call_option_pricing.ipynb>`__ 의 보상 함수의 선형 부분에 같은 근사를 적용한다.

source: In addition to the uncertainty model, we can also apply an affine map, e.g. resulting from a principal component analysis. The interest rates used are then given by:
fr: En plus du modèle d'incertitude, nous pouvons également appliquer une correspondance affine, résultant par exemple d'une analyse en composantes principales. Les taux d'intérêt utilisés sont alors donnés par :
