Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/tutorials/10_qgan_option_pricing.po
Languages: bn_bn, es_un, ja

source: This page was generated from `docs/tutorials/10_qgan_option_pricing.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `docs/tutorials/10_qgan_option_pricing.ipynb`__ থেকে নেয়া হয়েছে।
es_un: Esta página fue generada a partir de `docs/tutorials/10_qgan_option_pricing.ipynb`__.
ja: このページは `docs/tutorials/10_qgan_option_pricing.ipynb`__ から生成されました。

source: Option Pricing with qGANs
bn_bn: qGANs দিয়ে বিকল্প মূল্য নির্ধারণ
es_un: Fijación de Precios de Opciones con qGANs
ja: qGANs によるオプション価格推定

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
ja: はじめに

source: In this notebook, we discuss how a Quantum Machine Learning Algorithm, namely a quantum Generative Adversarial Network (qGAN), can facilitate the pricing of a European call option. More specifically, a qGAN can be trained such that a quantum circuit models the spot price of an asset underlying a European call option. The resulting model can then be integrated into a Quantum Amplitude Estimation based algorithm to evaluate the expected payoff - see `European Call Option Pricing <03_european_call_option_pricing.ipynb>`__. For further details on learning and loading random distributions by training a qGAN please refer to `Quantum Generative Adversarial Networks for Learning and Loading Random Distributions. Zoufal, Lucchi, Woerner. 2019. <https://www.nature.com/articles/s41534-019-0223-2>`__
bn_bn: এখন আমরা আলোচনা করব কোয়ান্টাম জেনারেটিভ অ্যাডভারসারিয়াল নেটওয়ার্ক (qGAN) নামে একটি কোয়ান্টাম মেশিন লার্নিং ধারাক্রম (অ্যালগরিদম)। এর একটি ব্যবহারিক প্রয়োগ দেখানো হবে যেখানে qGAN ব্যবহার করে একটি কোয়ান্টাম সার্কিট মডেল করা হবে যা ইউরোপিয়ান কল অপশনের মূল্য নির্ধারন করতে পারবে। এই মডেলটিকে কোয়ান্টাম বিস্তার এস্টিমেশন এলগোরিদম দ্বারা যাচাই করা যাবে, যা থেকে গড় মূল্যের মান নির্ণয় করা যাবে। বিস্তারিত জানতে `European Call Option Pricing <03_european_call_option_pricing.ipynb>`__ এই নোটবুক ফাইল ব্যবহারের অনুরোধ রইল। একটি qGAN প্রশিক্ষণ দিয়ে দৈব বণ্টন শেখার এবং লোড করার বিষয়ে আরও বিস্তারিত জানার জন্য অনুগ্রহ করে এই সহায়িকা গবেষণাপত্রটি পড়ুন `Quantum Generative Adversarial Networks for Learning and Loading Random Distributions. Zoufal, Lucchi, Woerner. 2019. <https://www.nature.com/articles/s41534-019-0223-2>`__
es_un: En este cuaderno, discutimos cómo un Algoritmo Cuántico de Machine Learning, es decir, una Red Generativa Antagónica cuántica (quantum Generative Adversarial Network, qGAN), puede facilitar la fijación de precios de una opción de compra europea. Más específicamente, una qGAN se puede entrenar de manera que un circuito cuántico modele el precio al contado de un activo subyacente a una opción de compra europea. El modelo resultante se puede integrar en un algoritmo basado en Estimación de Amplitud Cuántica para evaluar la rentabilidad esperada; consulta `Fijación de Precios de Opciones de Compra Europeas <03_european_call_option_pricing.ipynb>`__. Para obtener más detalles sobre el aprendizaje y la carga de distribuciones aleatorias mediante el entrenamiento de una qGAN, consulta `Quantum Generative Adversarial Networks for Learning and Loading Random Distributions. Zoufal, Lucchi, Woerner. 2019. <https://www.nature.com/articles/s41534-019-0223-2>`__
ja: このnotebookでは、量子機械学習アルゴリズムについて説明します。 すなわち、量子敵対的生成ネットワーク(qGAN)は、ヨーロピアン・コール・オプションの価格設定を容易にすることができます。 具体的には、量子回路がヨーロピアン・コール・オプションの基盤となる資産のスポット価格をモデル化するように、qGANを訓練することができます。 得られたモデルを量子振幅推定に基づくアルゴリズムに統合して、期待されるペイオフを評価することができます。 `ヨーロピアン・コール・オプションの価格推 <03_european_call_option_pricing.ipynb>`__ を参照してください。qGANの学習によるランダム分布の学習とロードの詳細については、次の文献を参照してください。 `Quantum Generative Adversarial Networks for Learning and Loading Random Distributions. Zoufal, Lucchi, Woerner. 2019. <https://www.nature.com/articles/s41534-019-0223-2>`__

source: Uncertainty Model
bn_bn: অনিশ্চয়তা মডেল
es_un: Modelo de Incertidumbre
ja: 不確実性モデル

source: The Black-Scholes model assumes that the spot price at maturity :math:`S_T` for a European call option is log-normally distributed. Thus, we can train a qGAN on samples from a log-normal distribution and use the result as an uncertainty model underlying the option. In the following, we construct a quantum circuit that loads the uncertainty model. The circuit output reads
bn_bn: ব্ল্যাক-স্কোলস মডেল অনুমান করে যে পরিপক্কতার সময় স্পট মূল্য :math:`S_T` একটি ইউরোপীয় কল বিকল্পের জন্য log-normally distributed হয়। এইভাবে, আমরা একটি লগ-নরমাল ডিস্ট্রিবিউশন থেকে নমুনার উপর একটি qGAN প্রশিক্ষণ দিতে পারি এবং ফলাফলটিকে একটি অনিশ্চয়তা মডেল হিসেবে ব্যবহার করতে পারি। নিম্নলিখিতগুলিতে, আমরা একটি কোয়ান্টাম সার্কিট তৈরি করি যা অনিশ্চয়তা মডেল লোড করে। সার্কিট আউটপুটটি এইটা পড়ে
es_un: El modelo Black-Scholes asume que el precio al contado al vencimiento :math:`S_T` para una opción de compra europea tiene una distribución logarítmica normal. Por lo tanto, podemos entrenar una qGAN con muestras de una distribución logarítmica normal y usar el resultado como un modelo de incertidumbre subyacente a la opción. A continuación, construimos un circuito cuántico que carga el modelo de incertidumbre. La salida del circuito dice que
ja: Black-Scholes モデルでは、ヨーロピアン・コール・オプションの満期の :math:`S_T` のスポット価格が対数正規分布であると仮定しています。 よって、対数正規分布からのサンプルでqGANを訓練し、結果をオプションの背後にある不確実性モデルとして使用することができます。 以下では、不確実性モデルをロードする量子回路を構築し、回路出力が読み込まれます。

source: where the probabilities :math:`p_{\theta}^{j}`, for :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, represent a model of the target distribution.
bn_bn: যেখানে সম্ভাব্যতা :math:`p_{\theta}^{j}`, for :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, একটি লক্ষ্য বণ্টনের (টার্গেট ডিস্ট্রিবিউশন) মডেল প্রতিনিধিত্ব করে।
es_un: donde las probabilidades :math:`p_{\theta}^{j}`, para :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, representan un modelo de la distribución objetivo.
ja: ここで、:math:`j\in \left\{0, \ldots, {2^n-1} \right\}` における確率 :math:`p_{\theta}^{j}` はターゲット分布のモデルを表します。

source: Evaluate Expected Payoff
bn_bn: গড় বেতন মূল্য নির্ধারণ কর
es_un: Evaluar el Rendimiento Esperado
ja: 期待ペイオフの評価

source: Now, the trained uncertainty model can be used to evaluate the expectation value of the option’s payoff function with Quantum Amplitude Estimation.
bn_bn: এখন, প্রশিক্ষিত (ট্রেইনড) অসম্ভাব্যতা মডেলটি কোয়ান্টাম বিস্তার অনুমান (কোয়ান্টাম অ্যামপ্লিটিউড এস্টিমেশন) দিয়ে বিকল্প অন্বয়ের গড় মান বিশ্লেষণ করতে পারে।
ja: これで、訓練された不確実性モデルは、オプションのペイオフ関数の期待値を分析的に、そして量子振幅推定を用いて評価するために使用できるようになりました。

source: Plot the probability distribution
bn_bn: সম্ভাব্যতা বণ্টনের লেখচিত্র অঙ্কন কর
es_un: Graficar la distribución de probabilidad
ja: 確率分布をプロットする

source: Next, we plot the trained probability distribution and, for reasons of comparison, also the target probability distribution.
bn_bn: তারপর, আমরা প্রশিক্ষিত (ট্রেইনড) সম্ভাব্যতা বিস্তারের লেখচিত্র এবং তুলনা করার জন্য লক্ষ্য (টার্গেট) সম্ভাব্যতা বিস্তারের লেখচিত্রটিও অঙ্কন করি।
es_un: A continuación, graficamos la distribución de probabilidad entrenada y, para poder comparar, también la distribución de probabilidad objetivo.
ja: 次に、訓練された確率分布と、比較のために目標の確率分布をプロットします。

source: Now, the trained uncertainty model can be used to evaluate the expectation value of the option’s payoff function analytically and with Quantum Amplitude Estimation.
bn_bn: এখন, প্রশিক্ষিত (ট্রেইনড) অসম্ভাব্যতা মডেলটি কোয়ান্টাম বিস্তার অনুমান (কোয়ান্টাম অ্যামপ্লিটিউড এস্টিমেশন) দিয়ে বিকল্প মূল্য অন্বয়ের গড় মান বিশ্লেষণ করতে পারে।
ja: これで、訓練された不確実性モデルは、オプションのペイオフ関数の期待値を分析的に、そして量子振幅推定を用いて評価するために使用できるようになりました。

source: Now, the trained uncertainty model can be used to evaluate the expectation value of the option's payoff function with Quantum Amplitude Estimation.
es_un: Ahora, el modelo de incertidumbre entrenado se puede utilizar para evaluar el valor esperado de la función de rendimiento de la opción con Estimación de Amplitud Cuántica.

source: Now, the trained uncertainty model can be used to evaluate the expectation value of the option's payoff function analytically and with Quantum Amplitude Estimation.
es_un: Ahora, el modelo de incertidumbre entrenado se puede utilizar para evaluar el valor esperado de la función de rendimiento de la opción de forma analítica y con la Estimación de Amplitud Cuántica.
