Repository: qiskit-community/qiskit-translations
Catalog: finance/docs/locale/*/LC_MESSAGES/tutorials/11_time_series.po
Languages: bn_bn, es_un, fr, ko_kr, ta

source: This page was generated from `docs/tutorials/11_time_series.ipynb`__.
bn_bn: এই পেজটি `docs/tutorials/11_time_series.ipynb`__ থেকে তৈরি হয়েছে।
es_un: Esta página fue generada a partir de `docs/tutorials/11_time_series.ipynb`__.
fr: Cette page a été générée à partir de `docs/tutorials/11_time_series.ipynb` __.
ko_kr: 이 페이지는 `docs/tutorials/11_time_series.ipynb`__ 에서 생성되었다.
ta: இந்தப் பக்கம் `docs/tutorials/11_time_series.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Loading and Processing Stock-Market Time-Series Data
bn_bn: পুঁজিবাজার কালীন-সারি (টাইম-সিরিজ) সংক্রান্ত তথ্য লোডিং এবং প্রক্রিয়াকরণ
es_un: Carga y Procesamiento de Datos de Series Temporales del Mercado de Valores
fr: Chargement et transformation des données de la série temporelle boursière
ko_kr: 주식시장 시계열 데이터 로드 및 처리
ta: பங்குச் சந்தை நேர-தொடர் தரவை ஏற்றுகிறது மற்றும் செயலாக்குகிறது

source: Introduction
bn_bn: ভূমিকা
es_un: Introducción
ko_kr: 소개
ta: முன்னுரை

source: Across many problems in finance, one starts with time series. Here, we showcase how to generate pseudo-random time-series, download actual stock-market time series from a number of common providers, and how to compute time-series similarity measures.
bn_bn: ব্যবস্থাপনাবিদ্যায় অনেকগুলো সমস্যার মধ্যে, একটি হলো কালীন সারি (টাইম সিরিজ)। এখানে আমরা দেখব কীভাবে ছদ্ম-দৈবচয়নের মাধ্যমে (স্যুডো র‍্যান্ডম) কালীন সারি তৈরি, কিছু সংখ্যক প্রচলিত উৎস থেকে প্রকৃত পুঁজিবাজারের কালীন সারি উপাত্ত সংগ্রহ এবং এর সাদৃশ্য নিরূপণ করা হয়।
es_un: En muchos problemas en finanzas, uno comienza con series de tiempo. Aquí, mostramos cómo generar series de tiempo pseudoaleatorias, descargar series de tiempo reales del mercado de valores de varios proveedores comunes y cómo calcular medidas de similitud de series de tiempo.
fr: Dans de nombreux problèmes du domaine de la finance, on commence par une série chronologique. Ici, nous vous indiquons comment générer des séries temporelles pseudo-aléatoires, télécharger des séries temporelles de stock-temps réelles à partir d'un certain nombre de fournisseurs communs, et comment calculer des mesures de similarité pour des séries chronologiques.
ko_kr: 금융의 많은 문제들에 있어서, 하나는 시계열로 시작한다. 여기서는 유사-랜덤 시계열을 생성하고, 다수의 공통 제공자로부터 실제 주식 시장 시간 시리즈를 다운로드하는 방법 및 시계열 유사성 측정을 계산하는 방법을 소개한다.
ta: நிதிகளில் பல சிக்கல்களில், ஒன்று நேரத் தொடரில் தொடங்குகிறது. போலி-சீரற்ற நேரத் தொடரை எவ்வாறு உருவாக்குவது, பல பொதுவான வழங்குநர்களிடமிருந்து உண்மையான பங்கு-சந்தை நேரத் தொடரைப் பதிவிறக்குவது மற்றும் நேர-தொடர் ஒற்றுமை நடவடிக்கைகளை எவ்வாறு கணக்கிடுவது என்பதை இங்கே காண்பிக்கிறோம்.

source: Once the data are loaded, you can run a variety of algorithms on those to aggregate the data. Notably, you can compute the covariance matrix or a variant, which would consider alternative time-series similarity measures based on `dynamic time warping <https://en.wikipedia.org/wiki/Dynamic_time_warping>`__ (DTW). In DTW, changes that vary in speed, e.g., one stock’s price following another stock’s price with a small delay, can be accommodated.
bn_bn: একবার তথ্য লোড হয়ে গেলে, তথ্যগুলিকে একত্রিত করার জন্য আপনি বিভিন্ন ধরণের ধারাক্রম (অ্যালগোরিদম) চালাতে পারেন। বিশেষত, আপনি কোভারিয়েন্স ম্যাট্রিক্স বা এর ভিন্ন বিকল্প গণনা করতে পারেন, যা `dynamic time warping <https://en.wikipedia.org/wiki/Dynamic_time_warping>`__ (DTW) এর উপর ভিত্তি করে বিকল্প সময়-সিরিজের সাদৃশ্যতার পরিমাপ ব্যবস্থা বিবেচনা করবে। ডিডাব্লিউটি (DWT) তে, যেসকল পরিবর্তনগুলি গতির দিক দিয়ে ভিন্ন হয়ে থাকে, যেমন, একটি স্টকের দাম যা আরেকটি স্টকের দামকে সামান্য বিলম্বসহ অনুসরণ করে, তাদের সামঞ্জস্য করা যায়।
es_un: Una vez que los datos son cargados, puedes ejecutar una variedad de algoritmos en ellos para agregar los datos. En particular, puedes calcular la matriz de covarianza o una variante, lo que consideraría medidas de similitud de series de tiempo alternativas basadas en la `deformación dinámica del tiempo <https://en.wikipedia.org/wiki/Dynamic_time_warping>`__ (dynamic time warping, DTW). En DTW, se pueden acomodar cambios que varían en velocidad, por ejemplo, el precio de una acción siguiendo el precio de otra acción con un pequeño retraso.
ko_kr: 데이터가 로드되면 데이터를 집계하기 위해 다양한 알고리즘을 실행할 수 있다. 특히, `Dynamic Time Warping <https://en.wikipedia.org/wiki/Dynamic_time_warping>`__ (DTW) 을 기반으로 하는 대체 시계열 유사성 측도를 고려할 수 있는 공분산 행렬 또는 가변값을 계산할 수 있다. DTW 에서, 속도가 달라지는 변화, 예를 들어, 짧은 지연이 있는 다른 주식의 가격에 이은 하나의 주식의 가격이 수용될 수 있다.
ta: தரவு ஏற்றப்பட்டவுடன், தரவைச் சேர்க்க பல்வேறு வழிமுறைகளை நீங்கள் இயக்கலாம். குறிப்பிடத்தக்க வகையில், நீங்கள் கோவரியன்ஸ் மேட்ரிக்ஸ் அல்லது ஒரு மாறுபாட்டைக் கணக்கிடலாம், இது `dynamic time warping <https://en.wikipedia.org/wiki/Dynamic_time_warping> '__ (DTW) அடிப்படையிலான மாற்று நேர-தொடர் ஒற்றுமை நடவடிக்கைகளைக் கருத்தில் கொள்ளலாம்.DTW இல், வேகத்தில் மாறுபடும் மாற்றங்கள், எ.கா., ஒரு பங்கின் விலை மற்றொரு தாமதத்துடன் ஒரு சிறிய தாமதத்துடன், இடமளிக்க முடியும்.

source: If you wish, you can look into the underlying pseudo-random time-series using. Please note that the private class members (starting with underscore) may change in future releases of Qiskit.
bn_bn: যদি তুমি চাও, তুমি ছদ্ম-দৈবচয়নের ভিত্তিস্বরূপের মধ্যে দেখতে পারো। দয়া করে মনে রাখবে যে, ব্যক্তিগত শ্রেণী সদস্যগুলো (আন্ডারস্কোর দিয়ে শুরুকৃত) Qiskit-এর ভবিষ্যৎ রিলিজ বা প্রকাশে পরিবর্তন হতে পারে।
es_un: Si lo deseas, puedes consultar las series de tiempo pseudoaleatorias subyacentes utilizando lo siguiente. Ten en cuenta que los miembros de la clase privada (que comienzan con un guión bajo) pueden cambiar en futuras versiones de Qiskit.
fr: Si vous le souhaitez, vous pouvez consulter les séries temporelles pseudo-aléatoires sous-jacentes. Veuillez noter que les membres de la classe privée (à commencer par le tiret-bas) pourraient changer dans les prochaines versions de Qiskit.
ko_kr: 원하는 경우에 기본적인 의사 랜덤 (pseudo-random) 시계열을 검색할 수 있다. 개인용 클래스 멤버 (밑줄로 시작) 는 향후 Qiskit 릴리스에서 변경될 수 있다는 점에 유의하라.
ta: நீங்கள் விரும்பினால், நீங்கள் பயன்படுத்தும் போலி-சீரற்ற நேரத் தொடரைப் பார்க்கலாம். Qiskitடின் எதிர்கால வெளியீடுகளில் தனியார் வகுப்பு உறுப்பினர்கள் (அடிக்கோடிட்டு தொடங்கி) மாறக்கூடும் என்பதை நினைவில் கொள்க.

source: Clearly, you can adapt the number and names of tickers and the range of dates:
bn_bn: পরিষ্কারভাবে, তুমি ঘড়ির সংখ্যা এবং নাম, এবং তারিখের পরিসর মানিয়ে নিতে পারবে।
es_un: Claramente, puedes adaptar el número y los nombres de los tickers, y el rango de fechas:
fr: Évidemment, vous pouvez adapter le nombre et les noms des "tickers" et la plage des dates:
ko_kr: 명확히 티커의 수와 이름 및 날짜 범위를 조정할 수 있다.
ta: தெளிவாக, நீங்கள் டிக்கர்களின் எண்ணிக்கை மற்றும் பெயர்கள் மற்றும் தேதிகளின் வரம்பை மாற்றியமைக்கலாம்:

source: Access to closing-price time-series
bn_bn: কালীন সারির বন্ধকৃত মূল্যে প্রবেশ।
es_un: Acceso a series de tiempo de precios de cierre
fr: Accès à la série chronologique des prix de clôture
ko_kr: 주식 종가 데이터 사용하기
ta: இறுதி விலை நேரத் தொடருக்கான அணுகல்

source: While the access to real-time data usually requires a payment, it is possible to access historical (adjusted) closing prices via Wikipedia and Quandl free of charge, following registration at: https://www.quandl.com/?modal=register In the code below, one needs to specify actual tickers of actual NASDAQ issues and the access token you obtain from Quandl; by running the code below, you agree to the Quandl terms and conditions, including a liability waiver. Notice that at least two tickers are required for the computation of covariance and time-series matrices, but hundreds of tickers may go beyond the fair usage limits of Quandl.
bn_bn: যখন তাৎক্ষণিক তথ্যে প্রবেশ করতে সাধারণত মাসুল প্রয়োজন হয়, তখন Wikipedia এবং কোয়ানডেল/Quandl দিয়ে কোন মাসুল ছাড়াই ঐতিহাসিক বন্ধকৃত মূল্যগুলোতে প্রবেশ করা সম্ভব, নিবন্ধনঃ https://www.quandl.com/?modal=register নিচের কোডে, একজনকে প্রকৃত NASDAQ বিষয়গুলির প্রকৃত tickers এবং Quandl থেকে প্রাপ্ত অ্যাক্সেস টোকেন নির্দিষ্ট করতে হবে; নিচের কোডটি চালানোর মাধ্যমে তুমি Quandl-এর শর্তাবলীর সাথে একমত হয়েছ একটি দায় মওকুফের সাথে। লক্ষ্য করুন যে, কোভ্যারিয়েন্স এবং কালীন সারি ম্যাট্রিক্সের গণনার জন্য কমপক্ষে দুটি টিকারস (tickers) প্রয়োজন, কিন্তু শত শত টিকারস (tickers) কোয়ানডেলের ন্যায্য ব্যবহারের সীমার বাইরে যেতে পারে।
es_un: Si bien el acceso a los datos en tiempo real generalmente requiere un pago, es posible acceder a los precios de cierre históricos (ajustados) a través de Wikipedia y Quandl de forma gratuita, luego de registrarse en: https://www.quandl.com/?modal=register En el código a continuación, es necesario especificar los tickers concretos de los activos reales de NASDAQ y el token de acceso que obtienes de Quandl; al ejecutar el código de abajo, acepta los términos y condiciones de Quandl, incluida una exención de responsabilidad. Ten en cuenta que se requieren al menos dos tickers para el cálculo de las matrices de covarianza y de series de tiempo, pero cientos de tickers pueden ir más allá de los límites de uso justo de Quandl.

source: Once the data are loaded, you can again compute the covariance matrix or its DTW variants.
bn_bn: একবার তথ্য লোড হয়ে গেলে, আপনি আবার কোভ্যারিয়েন্স ম্যাট্রিক্স বা এর DTW ভ্যারিয়েন্ট গণনা করতে পারেন।
es_un: Una vez cargados los datos, puedes volver a calcular la matriz de covarianza o sus variantes de DTW.
fr: Une fois les données chargées, vous pouvez à nouveau calculer la matrice de covariance ou ses variantes DTW.
ko_kr: 데이터가 로드되면 공분산 행렬 또는 DTW 변형을 다시 계산할 수 있다.
ta: தரவு ஏற்றப்பட்டதும், நீங்கள் மீண்டும் கோணம் மேட்ரிக்ஸ் அல்லது அதன் DTW வகைகளை கணக்கிடலாம்.

source: If you wish, you can look into the underlying time-series using:
bn_bn: যদি তুমি চাও, তুমি কালীন সারির ভিত্তিস্বরূপের মধ্যে দেখতে পারোঃ
es_un: Si lo deseas, puedes ver la serie de tiempo subyacente utilizando:
fr: Si vous le souhaitez, vous pouvez examiner les séries temporelles sous-jacentes en utilisant :
ko_kr: 원하는 경우 다음을 사용하여 기본 시간 시리즈를 조사할 수 있다.
ta: நீங்கள் விரும்பினால், இதைப் பயன்படுத்தி அடிப்படை நேரத் தொடரைப் பார்க்கலாம்:

source: [Optional] Setup token to access recent, fine-grained time-series
bn_bn: [Optional] সাম্প্রতিক, সূক্ষ্ম-সময়সীমা অ্যাক্সেস করতে টোকেন সেটআপ করুন
es_un: [Opcional] Configurar un token para acceder a series temporales recientes y detalladas
fr: [Optional] Jeton de configuration pour accéder à des séries temporelles récentes et à granularité fine
ko_kr: [Optional] 설정 토큰을 설정하여 최신의 세분화된 시간-시리즈
ta: [Optional] சமீபத்திய, நேர்த்தியான நேரத் தொடரை அணுக டோக்கனை அமைக்கவும்

source: If you would like to download professional data, you will have to set-up a token with one of the major providers. Let us now illustrate the data with NASDAQ Data on Demand, which can supply bid and ask prices in arbitrary resolution, as well as aggregates such as daily adjusted closing prices, for NASDAQ and NYSE issues.
bn_bn: আপনি যদি পেশাদার ডেটা ডাউনলোড করতে চান, তাহলে আপনাকে একটি প্রধান প্রদানকারীর সাথে একটি টোকেন সেট-আপ করতে হবে। আসুন এখন আমরা নাসডাক (NASDAQ) তথ্য চাহিদামাফিক চিত্রিত করি, যা বিড সরবরাহ করতে পারে এবং নির্বিচারে রেজোলিউশনে দাম জিজ্ঞাসা করতে পারে, যেমন সেইসাথে নাসডাক এবং এনওয়াইএসই ইস্যুগুলির জন্য দৈনিক বন্ধের দামের সমষ্টি করতে পারে।
es_un: Si deseas descargar datos profesionales, deberás configurar un token con uno de los principales proveedores. Ilustremos ahora los datos con NASDAQ Data on Demand, que puede proporcionar precios de oferta y demanda a una resolución arbitraria, así como agregados, como precios de cierre ajustados diariamente, para activos de NASDAQ y de NYSE.
fr: Si vous souhaitez télécharger des données professionnelles, vous devez mettre en place un jeton avec l'un des principaux fournisseurs. Voyons maintenant les données avec le service NASDAQ Data on Demand, qui peut fournir des offres et demander des prix avec une résolution arbitraire, ainsi que des agrégats tels que les prix de clôture corrigés quotidiens, pour le NASDAQ et le NYSE.
ko_kr: 전문 데이터를 다운로드하려면 주요 제공자 중 하나를 사용하여 토큰을 설정해야 한다. 이제 나스닥 및 NYSE 문제에 대한 데이터를 조정하고, 가격을 조정하고 매일 조정하는 가격, 나스닥 및 NYSE 문제에 대한 조정과 같은 집계를 제공할 수 있는 나스닥 데이터의 데이터를 설명한다.
ta: நீங்கள் தொழில்முறை தரவைப் பதிவிறக்க விரும்பினால், முக்கிய வழங்குநர்களில் ஒருவரிடம் டோக்கனை அமைக்க வேண்டும். NASDAQ டேட்டா தேவை தரவை இப்போது விளக்குவோம், இது ஏலத்தை வழங்கலாம் மற்றும் தன்னிச்சையான தீர்மானத்தில் விலைகளைக் கேட்கலாம், அத்துடன் NASDAQ மற்றும் NYSE சிக்கல்களுக்கு தினசரி சரிசெய்யப்பட்ட நிறைவு விலைகள் போன்ற திரட்டுகளையும் வழங்கலாம்.

source: If you don’t have NASDAQ Data on Demand license, you can contact NASDAQ (cf. https://business.nasdaq.com/intel/GIS/Nasdaq-Data-on-Demand.html) to obtain a trial or paid license.
bn_bn: আপনার যদি ন্যাসডাক চাহিদানুযায়ী তথ্য (ডেটা অন ডিমান্ড) লাইসেন্স না থেকে থাকে, তবে ট্রায়াল বা প্রদেয় লাইসেন্স পেতে আপনি ন্যাসডাকের (cf. https://business.nasdaq.com/intel/GIS/Nasdaq-Data-on-Demand.html) সাথে যোগাযোগ করতে পারেন।
es_un: Si no tienes una licencia de NASDAQ Data on Demand, puedes ponerte en contacto con NASDAQ (cf. https://business.nasdaq.com/intel/GIS/Nasdaq-Data-on-Demand.html) para obtener una licencia de prueba o de pago.
ko_kr: 나스닥 데이터 온디맨드 라이센스가 없는 경우, 나스닥에 문의해 시험판 또는 유료 라이센스를 얻을 수 있다 (참조. https://business.nasdaq.com/intel/GIS/Nasdaq-Data-on-Demand.html).
ta: உங்களிடம் கோரிக்கை உரிமத்தில் NASDAQ தரவு இல்லையென்றால், சோதனை அல்லது கட்டண உரிமத்தைப் பெற NASDAQ (cf. https://business.nasdaq.com/intel/GIS/Nasdaq-Data-on-Demand.html) ஐ தொடர்பு கொள்ளலாம்.

source: If and when you have access to NASDAQ Data on Demand using your own token, you should replace REPLACE-ME below with the token. To assure the security of the connection, you should also have your own means of validating NASDAQ’s certificates. The DataOnDemandProvider constructor has an optional argument ``verify``, which can be ``None`` or a string or a boolean. If it is ``None``, certify certificates will be used (default). If verify is a string, it should be pointing to a certificate for the HTTPS connection to NASDAQ (dataondemand.nasdaq.com), either in the form of a CA_BUNDLE file or a directory wherein to look.
bn_bn: যদি এবং যখন নিজের টোকেনটি ব্যবহার করে ন্যাসডাক ডেটা অন ডিমান্ডে আপনার অ্যাক্সেস থাকে তখন আপনার নিচের REPLACE-ME কে টোকেন দিয়ে প্রতিস্থাপন করা উচিত। সংযোগের সুরক্ষা নিশ্চিত করতে, আপনার নাসডাকের সনদপত্র বৈধতা দেওয়ার নিজস্ব উপায়ও থাকা উচিত। DataOnDemandProvider কনস্ট্রাক্টরের একটি ঐচ্ছিক আর্গুমেন্ট ``verify`` রয়েছে, যা `None` বা স্ট্রিং বা বুলিয়ান হতে পারে। যদি এটি ``None`` হয়, প্রত্যয়িত সনদপত্রগুলি ব্যবহৃত হবে (ডিফল্ট)। যদি তা একটি স্ট্রিং হয়, তবে এটির সিএ_বান্ডিল ফাইল বা ডিরেক্টরি হিসাবে নাসডাকের (dataondemand.nasdaq.com) এইচটিটিপিএস সংযোগের জন্য রাখা সনদপত্রের দিকে ইঙ্গিত করা উচিত।
es_un: Si tienes y cuando tengas acceso a NASDAQ Data on Demand utilizando tu propio token, debes reemplazar más abajo REPLACE-ME con el token. Para garantizar la seguridad de la conexión, también debes tener tus propios medios para validar los certificados de NASDAQ. El constructor DataOnDemandProvider tiene un argumento opcional ``verify``, que puede ser ``None`` o una cadena o un valor booleano. Si es ``None``, se utilizarán certificados de confirmación (predeterminado). Si la verificación es una cadena, deberías apuntar a un certificado para la conexión HTTPS a NASDAQ (dataondemand.nasdaq.com), ya sea en forma de archivo CA_BUNDLE o de un directorio donde buscar.
ko_kr: 자신의 토큰을 사용하여 나스닥 데이터에 액세스할 수 있는 경우, 아래의 'REPLACE-ME' 를 토큰으로 대체해야 한다. 연결 보안을 보장하기 위해 나스닥 인증서의 유효성을 확인하는 고유한 방법도 가지고 있어야 한다. DataOnDemandProvider 생성자는 ``None`` 또는 문자열 또는 부울이 될 수 있는 선택적인 인수 검증 ``verify`` 를 갖고 있다. ``None`` 이면 인증서가 사용된다 (기본값). 검증이 문자열인 경우 CA_BUNDLE 파일 형식 또는 찾아볼 디렉토리 (dataondemand.nasdaq.com) 의 HTTPS 연결을 위한 인증서를 가리키고 있어야 한다.
ta: உங்கள் சொந்த டோக்கனைப் பயன்படுத்தி NASDAQ டேட்டா ஆன் டிமாண்டிற்கு அணுகல் இருந்தால், கீழேயுள்ள REPLACE-ME ஐ டோக்கனுடன் மாற்ற வேண்டும். இணைப்பின் பாதுகாப்பை உறுதிப்படுத்த, NASDAQ சான்றிதழ்களை சரிபார்க்க உங்கள் சொந்த வழிகளும் இருக்க வேண்டும். DataOnDemandProvider கட்டமைப்பாளருக்கு ஒரு விருப்ப வாதம் உள்ளது ``சரிபார்க்கவும்``, இது ``எதுவுமில்லை`` அல்லது சரம் அல்லது பூலியன். இது ``எதுவுமில்லை`` என்றால், சான்றிதழ் சான்றிதழ்கள் பயன்படுத்தப்படும் (இயல்புநிலை). சரிபார்ப்பு ஒரு சரம் என்றால், அது CA_BUNDLE கோப்பு வடிவில் அல்லது பார்க்க வேண்டிய கோப்பகத்தின் வடிவத்தில், NASDAQ (dataondemand.nasdaq.com) உடன் HTTPS இணைப்பிற்கான சான்றிதழை சுட்டிக்காட்ட வேண்டும்.

source: Another major vendor of stock market data is Exchange Data International (EDI), whose API can be used to query over 100 emerging and frontier markets that are Africa, Asia, Far East, Latin America and Middle East, as well as the more established ones. See: https://www.exchange-data.com/pricing-data/adjusted-prices.php#exchange-coverage for an overview of the coverage.
bn_bn: শেয়ার বাজারের ডেটাগুলির আরেকটি বড় বিক্রেতা হ'ল এক্সচেঞ্জ ডেটা ইন্টারন্যাশনাল (ইডিআই), যার এপিআই আফ্রিকা, এশিয়া, সুদূর পূর্ব, লাতিন আমেরিকা এবং মধ্যপ্রাচ্যের মতন ১০০টিরও বেশি উদীয়মান এবং সীমান্ত বাজারগুলিতে অনুসন্ধানের পাশাপাশি অন্যান্য স্থিতিশীল বাজারেও ব্যবহার করা সম্ভব।এই অন্তর্ভুক্তির একটি মোটামুটি ধারনা পেতে দেখুন: https://www.exchange-data.com/pricing-data/adjusted-prices.php#exchange-coverage
es_un: Otro proveedor principal de datos de mercado de valores es Exchange Data International (EDI), cuya API puede ser usada para consultar más de 100 mercados emergentes y fronterizos que son África, Asia, Extremo Oriente, América Latina y Medio Oriente, así como los mercados más establecidos. Consulta: https://www.exchange-data.com/pricing-data/adjusted-prices.php#exchange-coverage para un resumen de la cobertura.

source: The access again requires a valid access token to replace REPLACE-ME below. The token can be obtained on a trial or paid-for basis at: https://www.quandl.com/
bn_bn: নীচের REPLACE-ME প্রতিস্থাপনের জন্য অ্যাক্সেসটির আবারও একটি বৈধ প্রবেশাধিকার কুপন (টোকেন) দরকার। টোকেনটি একটি ট্রায়াল বা অর্থের ভিত্তিতে পাওয়া যেতে পারে এই অ্যাড্রেসটিতে: https://www.quandl.com/
es_un: El acceso nuevamente requiere un token de acceso válido para reemplazar más abajo REPLACE-ME. El token se puede obtener como una versión de prueba o de pago en: https://www.quandl.com/

source: One can also access Yahoo Finance Data, no token needed, from Yahoo! Finance.
bn_bn: কোনও টোকেন ছাড়াই Yahoo! Finance থেকে যে কোনো Yahoo Finance ডেটা অ্যাক্সেস সম্ভব।
es_un: También se puede acceder a los datos de Yahoo Finance, sin necesidad de token, desde Yahoo! Finance.
fr: On peut aussi accéder à Yahoo Finance Data depuis Yahoo ! Finances, aucun jeton d'accès n'est requis.
ko_kr: 또한 야후의 금융 데이터에 액세스할 수 있는 서비스를 제공하지 않아도 된다. 금융.
ta: Yahooவிலிருந்து Yahoo நிதி தரவையும் அணுகலாம், டோக்கன் தேவையில்லை.

source: For the actual use of the data, please see the portfolio_optimization or portfolio_diversification notebooks.
bn_bn: তথ্যের প্রকৃত ব্যবহারের জন্য, দয়া করে portfolio_optimization বা portfolio_diversification নোটবুকগুলি দেখুন।
es_un: Para conocer el uso real de los datos, consulta los cuadernos portfolio_optimization o portfolio_diversification.
fr: Pour l'utilisation effective de données, veuillez consulter les notebooks portfolio_optimization ou portfolio_diversification.
ko_kr: 데이터의 실제 사용을 위해 portfolio_optimization 또는 portfolio_diversification 노트북을 참조한다.
ta: தரவின் உண்மையான பயன்பாட்டிற்கு, தயவுசெய்து போர்ட்ஃபோலியோ_ஓப்டிமைசேஷன் அல்லது போர்ட்ஃபோலியோ_ பல்வகைப்படுத்தல் குறிப்பேடுகளைப் பார்க்கவும்.

source: While the access to real-time data usually requires a payment, it is possible to access historical (adjusted) closing prices via Wikipedia and Nasdaq Data Link free of charge, following registration at: https://data.nasdaq.com/sign-up In the code below, one needs to specify actual tickers of actual NASDAQ issues and the access token you obtain from Nasdaq Data Link; by running the code below, you agree to the Nasdaq Data Link terms and conditions, including a liability waiver. Notice that at least two tickers are required for the computation of covariance and time-series matrices, but hundreds of tickers may go beyond the fair usage limits of Nasdaq Data Link.
fr: Alors que l'accès aux données en temps réel nécessite généralement un paiement, il est possible d'accéder à des prix de clôture historiques (ajustés) via Wikipedia et le Nasdaq Data Link sans frais, à la suite de l'inscription à: https://data.nasdaq.com/sign-up Dans le code ci-dessous, il est nécessaire de spécifier les tickers réels des problèmes de NASDAQ réels et le jeton d'accès que vous obtenez de Nasdaq Data Link ; en exécutant le code ci-dessous, vous acceptez les termes et conditions du Nasdaq Data Link, y compris une dispense de responsabilité. Notez qu'au moins deux tickers sont requis pour le calcul des matrices de covariance et de séries chronologiques, mais des centaines de tickers peuvent dépasser les limites d'utilisation équitable de Nasdaq Data Link.
ko_kr: 실시간 데이터에 대한 액세스는 일반적으로 지불을 필요로 하지만, Wikipedia와 Nasdaq Data Link를 무료로 마감 가격에 액세스할 수 있다: https://data.nasdaq.com/sign-up 에 등록한 후에는 실제 나스닥 문제의 실제적인 스티커와 Nasdaq Data Link 에서 얻는 액세스 토큰을 지정해야 한다. 아래의 코드를 실행함으로 써 Nadsdaq Data Link의 약관에 동의하게 된다. 공분산 및 시계열 행렬의 계산에는 최소한 두 개의 티커가 필요하지만, 수백 개의 티커는 Nasdaq Data Link의 공정한 사용 한계를 넘어설 수 있다.
ta: நிகழ்நேர தரவுக்கான அணுகலுக்கு வழக்கமாக கட்டணம் தேவைப்பட்டாலும், பதிவுசெய்தலைத் தொடர்ந்து விக்கிபீடியா மற்றும் நாஸ்டாக் தரவு இணைப்பு வழியாக வரலாற்று (சரிசெய்யப்பட்ட) முடிவு விலைகளை இலவசமாக அணுக முடியும்: https://data.nasdaq.com/sign-up கீழே உள்ள குறியீட்டில், உண்மையான நாஸ்டாக் சிக்கல்களின் உண்மையான டிக்கர்கள் மற்றும் நாஸ்டாக் தரவு இணைப்பிலிருந்து நீங்கள் பெறும் அணுகல் டோக்கன் ஆகியவற்றைக் குறிப்பிட வேண்டும்; கீழே உள்ள குறியீட்டை இயக்குவதன் மூலம், பொறுப்பு தள்ளுபடி உட்பட நாஸ்டாக் தரவு இணைப்பு விதிமுறைகள் மற்றும் நிபந்தனைகளை ஒப்புக்கொள்கிறீர்கள். கோவேரியன்ஸ் மற்றும் டைம்-சீரிஸ் மேட்ரிஸைக் கணக்கிட குறைந்தது இரண்டு டிக்கர்கள் தேவை என்பதைக் கவனியுங்கள், ஆனால் நூற்றுக்கணக்கான டிக்கர்கள் நாஸ்டாக் தரவு இணைப்பின் நியாயமான பயன்பாட்டு வரம்புகளைத் தாண்டிச் செல்லக்கூடும்.

source: Another major vendor of stock market data is Exchange Data International (EDI), whose API can be used to query over 100 emerging and frontier markets that are Africa, Asia, Far East, Latin America and Middle East, as well as the more established ones. See: https://www.exchange-data.com/ for an overview of the coverage.
ko_kr: 주식 시장 데이터의 또 다른 주요 공급업체인 EDI (Exchange Data International) 는 아프리카, 아시아, 극동, 라틴 아메리카, 중동, 그리고 더 설정된 것들 뿐만 아니라 아프리카, 아시아, 극동, 라틴 아메리카, 중동과 같은 100개 이상의 신흥 시장을 조회하는 데 사용될 수 있는 API를 사용할 수 있다. 예를 들어 https://www.exchange-data.com/ 에서 전체에 대한 개요를 볼 수 있다.
ta: பங்குச் சந்தை தரவுகளின் மற்றொரு முக்கிய விற்பனையாளர் எக்ஸ்சேஞ்ச் டேட்டா இன்டர்நேஷனல் (ஈடிஐ) ஆகும், இதன் ஏபிஐ ஆப்பிரிக்கா, ஆசியா, தூர கிழக்கு, லத்தீன் அமெரிக்கா மற்றும் மத்திய கிழக்கு ஆகிய 100 க்கும் மேற்பட்ட வளர்ந்து வரும் மற்றும் எல்லைப்புற சந்தைகளையும், மேலும் நிறுவப்பட்ட சந்தைகளையும் விசாரிக்க பயன்படுத்தப்படலாம். பார்க்க: கவரேஜ் பற்றிய கண்ணோட்டத்திற்கு https://www.exchange-data.com/.

source: The access again requires a valid access token to replace REPLACE-ME below. The token can be obtained on a trial or paid-for basis at: https://data.nasdaq.com/sign-up
fr: L'accès nécessite à nouveau un jeton d'accès pour remplacer REPLACE-ME ci-dessous. Le jeton peut être obtenu à l'issue d'un essai ou d'un paiement, à l'adresse suivante: https://www.quandl.com/
ko_kr: 액세스를 다시 요청하려면 아래에 있는 REPLACE-ME를 대체할 유효한 액세스 토큰이 필요하다. 이 토큰은 다음과 같이 시험 또는 지불 방식으로 얻을 수 있다: https://data.nasdaq.com/sign-up
ta: அணுகலுக்கு கீழே உள்ள எம்.இ-க்கு பதிலாக மீண்டும் செல்லுபடியாகும் அணுகல் டோக்கன் தேவைப்படுகிறது. டோக்கனை சோதனை அடிப்படையில் பெறலாம் அல்லது கட்டண அடிப்படையில் பெறலாம்: https://data.nasdaq.com/sign-up
