Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/machine_learning/01_qsvm_classification.po
Languages: es_un, fr_fr, id_id, ja_jp, ko_kr, pt_br, ta_in

source: With the dataset ready we can setup the `QSVM <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QSVM.html>`__ algorithm to do a classification. Here we use the `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ data encoding circuit from the Qiskit circuit library.
es_un: Con el conjunto de datos listo podemos configurar el algoritmo `QSVM <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QSVM.html>`__ (Quantum-enhanced Support Vector Machine) para hacer una clasificación. Aquí utilizamos el circuito de codificación de datos `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ de la librería de circuitos Qiskit.
fr_fr: Avec le jeu de données prêt, nous pouvons configurer l'algorithme `QSVM <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QSVM.html>`__ pour faire une classification. Ici, nous utilisons le circuit d'encodage de données `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ de la bibliothèque de circuits Qiskit.
id_id: Jika dataset sudah siap kita dapat mempersiapkan algoritma `QSVM <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QSVM.html>`__ untuk melakukan klasifikasi. Di sini kita menggunakan sirkuit enkoding data `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ dari pustaka sirkuit Qiskit.
ja_jp: データセットの準備ができたので、 `QSVM <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QSVM.html>`__ アルゴリズムを設定して、分類を行います。ここでは `Qiskit circuit` ライブラリの `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ データ符号化回路を用います。
ko_kr: 데이터 세트를 사용하여 `QSVM <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QSVM.html>`__ 알고리즘을 설정하여 분류를 수행할 수 있다. 여기에서는 Qiskit 회로 라이브러리의 `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ 데이터 인코딩 회로를 사용한다.
pt_br: Com o conjunto de dados pronto, podemos configurar o algoritmo `QSVM <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QSVM.html>`__ para fazer uma classificação. Aqui utilizamos o circuito de codificação `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ de dados da biblioteca de circuitos Qiskit.
ta_in: தரவுத்தொகுப்பு தயார் நிலையில் நாம் அமைக்கலாம் `QSVM <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.QSVM.html>`__ ஒரு வகைப்பாடு செய்ய வழிமுறை. இங்கே நாம் `ZZFeatureMap ஐப் பயன்படுத்துகிறோம் <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ Qiskit சர்க்யூட் நூலகத்திலிருந்து தரவு குறியாக்க சுற்று.

source: Here the BasicAer ``qasm_simulator`` is used with 1024 shots.
es_un: Aquí se usa el ``qasm_simulator`` de BasicAer con 1024 iteraciones.
fr_fr: Ici, le simulateur ``qasm_simulator`` de BasicAer est utilisé avec 1024 measures.
id_id: Di sini digunakan BasicAer ``qasm_simulator`` dengan 1024 *shot*.
ja_jp: 今回は BasicAer の ``qasm_simulator`` を1024ショットで使用します。
ko_kr: 여기에는 1024샷을 넣은 'BasicAer' 의 'qasm_시뮬레이터' 가 사용된다.
pt_br: Aqui o BasicAer ``qasm_simulator`` é usado com 1024 coletas.
ta_in: இங்கு BasicAer ``qasm_ simulator`` 1024 சுற்றுகள் பயன்படுகிறது.

source: For the testing, the result includes the details and the success ratio. For the prediction, the result includes the predicted labels.
es_un: Para las pruebas, el resultado incluye los detalles y la tasa de éxito. Para la predicción, el resultado incluye las etiquetas predichas.
fr_fr: Pour les tests, le résultat comprend les détails et le ratio de réussite. Pour la prédiction, le résultat comprend les étiquettes prédites.
id_id: Untuk pengujian, hasilnya termasuk detail dan rasio keberhasilan. Untuk prediksi, hasilnya termasuk label yang diprediksi.
ja_jp: テストの結果には、詳細と成功率が含まれています。予測の結果には、予測ラベルが含まれています。
ko_kr: 테스트의 경우, 결과에는 세부사항 및 성공 비율이 포함된다. 예측에 대해, 결과에는 예측된 레이블이 포함된다.
pt_br: Para o teste, o resultado inclui os pormenores e a relação de sucesso; Para a previsão, o resultado inclui os rótulos previstos.
ta_in: சோதனைக்கு, இதன் விளைவாக விவரங்கள் மற்றும் வெற்றி விகிதம் அடங்கும். கணிப்புக்கு, இதன் விளைவாக கணிக்கப்பட்ட லேபிள்கள் அடங்கும்.

source: The following shows the kernel matrix that was built from the training sample of the dataset.
es_un: A continuación se muestra la matriz de kernel que se creó a partir de la muestra de entrenamiento del conjunto de datos.
fr_fr: Ce qui suit montre la matrice du noyau qui a été construit à partir de l'échantillon d'entraînement du jeu de données.
id_id: Berikut ini merupakan matriks kernel yang dibangun dari sampel *training* dari dataset.
ja_jp: データセットの訓練サンプルから作成したカーネル行列を以下に示します。
ko_kr: 다음은 데이터 세트의 훈련 표본에서 빌드된 커널 매트릭스를 나타다.
pt_br: O seguinte mostra a matriz de kernel que foi construída a partir da amostra de treinamento do dataset.
ta_in: தரவுத்தொகுப்பின் பயிற்சி மாதிரியிலிருந்து கட்டப்பட்ட கர்னல் மேட்ரிக்ஸை பின்வருவன காட்டுகிறது.

source: Qiskit also has a classical SVM implementation that takes the same input data for classification. Let’s run this and do a comparison. Now the ad hoc data set was created to show that there can be datasets where quantum could give an advantage.
es_un: Qiskit también tiene una implementación clásica de SVM que toma los mismos datos de entrada para la clasificación. Vamos a correr esto y hacer una comparación. Ahora el conjunto de datos ad hoc fue creado para mostrar que puede haber conjuntos de datos donde la cuántica podría dar una ventaja.
fr_fr: Qiskit dispose également d'une implémentation SVM classique qui prend les mêmes données d'entrée pour la classification. Utilisons la et faisons une comparaison. Maintenant, le jeu de données ad hoc a été créé pour montrer qu'il peut y avoir des ensembles de données où le calcul quantique pourrait donner un avantage.
id_id: Qiskit juga memiliki implementasi SVM klasik yang mengambil data masukan yang sama untuk klasifikasi. Mari kita jalankan dan bandingkan. Dataset ad hoc dibuat untuk menunjukkan bahwa terdapat dataset di mana kuantum bisa memberikan keuntungan.
ja_jp: Qiskit には、同じ入力データを取る古典的な SVM の実装もあります。これを実行して、比較を行ってみましょう。このアドホック・データは、量子が有利となるデータセットが存在していることを示すために作成されました。
ko_kr: 또한, Qiskit은 분류를 위해 동일한 입력 데이터를 취하는 고전적인 SVM 구현을 갖는다. 이것을 실행하고 비교해 보자. 이제 임시 데이터 세트가 작성되어 퀀텀이 장점을 제공할 수 있는 데이터 세트가 있음을 표시한다.
pt_br: Qiskit também tem uma implementação SVM clássica que usa os mesmos dados de entrada para a classificação. Vamos executar isso e fazer uma comparação. Agora, o conjunto de dados ad hoc foi criado para mostrar que pode haver conjuntos de dados onde o quantum poderia oferecer uma vantagem.
ta_in: Qiskit ஒரு கிளாசிக்கல் SVM செயல்படுத்தலையும் கொண்டுள்ளது, இது வகைப்படுத்தலுக்கு அதே உள்ளீட்டு தரவை எடுக்கும். இதை இயக்கி ஒப்பிட்டுப் பார்ப்போம். குவாண்டம் ஒரு நன்மையைத் தரக்கூடிய தரவுத்தொகுப்புகள் இருக்கக்கூடும் என்பதைக் காண்பிப்பதற்காக இப்போது ஆட் ஹாக் தரவுத்தொகுப்பு உருவாக்கப்பட்டது.

source: The breast cancer dataset
es_un: El conjunto de datos del cáncer de mama
fr_fr: Le jeu de données sur le cancer du sein
id_id: Dataset kanker payudara
ja_jp: 乳がんデータセット
ko_kr: 유방암 데이터 세트
pt_br: O conjunto de dados do câncer de mama
ta_in: மார்பக புற்றுநோய் தரவுத்தொகுப்பு

source: Now we run our algorithm with a real-world dataset: the breast cancer dataset, we use the first two principal components as features.
es_un: Ahora ejecutamos nuestro algoritmo con un conjunto de datos del mundo real: el conjunto de datos del cáncer de mama, usamos los dos primeros componentes principales como características.
fr_fr: Maintenant nous exécutons notre algorithme avec un jeu de données réel: le jeu de données sur le cancer du sein, nous utilisons les deux premiers composants principaux comme caractéristiques.
id_id: Sekarang kita jalankan algoritma kita dengan sebuah dataset nyata: dataset kanker payudara, kita gunakan dua komponen utama yang pertama sebagai fitur.
ja_jp: 次に、実データでアルゴリズムを実行します。乳がんデータセットの第一主成分と第二主成分を特徴量として用います。
ko_kr: 이제 실제 데이터 세트를 사용하여 알고리즘을 실행한다. 유방암 데이터 세트에서는 처음 두 개의 주요 구성요소를 기능으로 사용한다.
pt_br: Agora executamos nosso algoritmo com um conjunto de dados do mundo real: o conjunto de dados para o câncer de mama, nós usamos os dois primeiros componentes principais como recursos.
ta_in: இப்போது எங்கள் வழிமுறையை ஒரு நிஜ உலக தரவுத்தொகுப்புடன் இயக்குகிறோம்: மார்பக புற்றுநோய் தரவுத்தொகுப்பு, முதல் இரண்டு முக்கிய கூறுகளை அம்சங்களாகப் பயன்படுத்துகிறோம்.

source: The kernel matrix that was built from the training sample of the dataset.
es_un: La matriz de kernel que se creó a partir de la muestra de entrenamiento del conjunto de datos.
fr_fr: La matrice du noyau qui a été construit à partir de l'échantillon d'entraînement du jeu de données.
id_id: Matriks kernel yang dibangun dari sampel *training* dari dataset.
ja_jp: データセットの訓練サンプルから作成されたカーネル行列
ko_kr: 데이터 세트의 훈련 표본에서 빌드된 커널 행렬이다.
pt_br: A matriz de kernel que foi construída a partir da amostra de treinamento do conjunto de dados.
ta_in: தரவுத்தொகுப்பின் பயிற்சி மாதிரியிலிருந்து கட்டப்பட்ட கர்னல் மேட்ரிக்ஸ்.

source: Again we are able to compare the result to a classical approach.
es_un: De nuevo, podemos comparar el resultado contra el enfoque clásico.
fr_fr: Une fois de plus, nous pouvons comparer le résultat à une approche classique.
id_id: Sekali lagi dapat kita bandingkan hasilnya dengan pendekatan klasik.
ja_jp: ここでも、古典的なアプローチと結果を比較することができます。
ko_kr: 우리는 그 결과를 고전적인 접근 방식과 비교할 수 있다.
pt_br: Mais uma vez, podemos comparar o resultado com uma abordagem clássica.
ta_in: மீண்டும் ஒரு கிளாசிக்கல் அணுகுமுறையுடன் முடிவை ஒப்பிட முடிகிறது
