Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/machine_learning/01_qsvm_classification.po
Languages: es_un, fr_fr, id_id, ja_jp, ko_kr, pt_br, ta_in

source: This page was generated from `tutorials/machine_learning/01_qsvm_classification.ipynb`__.
es_un: Esta página fue generada a partir de `tutorials/machine_learning/01_qsvm_classification.ipynb`__.
fr_fr: Cette page a été générée depuis `tutorials/machine_learning/01_qsvm_classification.ipynb`__.
id_id: Halaman ini dibangkitkan dari `tutorials/machine_learning/01_qsvm_classification.ipynb`__.
ja_jp: このページは、 `tutorials/machine_learning/01_qsvm_classification.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/machine_learning/01_qsvm_classification.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada a partir de `tutorials/machine_learning/01_qsvm_classification.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/machine_learning/01_qsvm_classification.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/01_qsvm_classification.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/01_qsvm_classification.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/01_qsvm_classification.ipynb>`_.
id_id: Jalankan secara interaktif di `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/01_qsvm_classification.ipynb>`_.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/01_qsvm_classification.ipynb>`_ でインタラクティブに実行します。
ko_kr: `IBM 퀀텀 랩 <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/01_qsvm_classification.ipynb>`_ 에서 대화식으로 실행하십시오.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/01_qsvm_classification.ipynb>`_.
ta_in: `IBM Quantum ஆய்வகத்தில் <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/06_qaoa.ipynb>` _ இல் ஊடாடும் வகையில் இயக்கவும்.

source: Quantum-enhanced Support Vector Machine (QSVM)
es_un: Máquina de Vectores de Soporte Mejorada Cuánticamente (QSVM)
fr_fr: QSVM (Quantum-enhanced Support Vector Machine)
ja_jp: 量子サポート・ベクター・マシン (QSVM)
ko_kr: QSVM (Quantum-enhanced Support Vector Machine)
pt_br: Máquina de Vetor de Suporte aprimorado Quantum (QSVM)
ta_in: குவாண்டம் மேம்படுத்தப்பட்ட ஆதரவு திசையன் இயந்திரம் (QSVM)

source: Classification algorithms and methods for machine learning are essential for pattern recognition and data mining applications. Well known techniques such as support vector machines and neural networks have blossomed over the last two decades as a result of the spectacular advances in classical hardware computational capabilities and speed. This progress in computer power made it possible to apply techniques, that were theoretically developed towards the middle of the 20th century, on classification problems that were becoming increasingly challenging.
es_un: Los algoritmos y métodos de clasificación para aprendizaje automático son esenciales para reconocimiento de patrones y aplicaciones de minería de datos. Técnicas bien conocidas como máquinas de vectores de soporte y redes neuronales han florecido en las últimas dos décadas como resultado de los espectaculares avances en las capacidades computacionales y la velocidad del hardware clásico. Este progreso en el poder de cómputo hizo posible aplicar técnicas, que fueron teóricamente desarrolladas hacia mediados del siglo XX, en problemas de clasificación que se estaban volviendo cada vez más desafiantes.
fr_fr: Les algorithmes de classification et les méthodes d'apprentissage automatique sont essentiels pour la classification et l'exploration de données. Des techniques bien connues telles que les machines vectorielles de support et les réseaux neuronaux se sont multipliées au cours des deux dernières décennies à la suite des avancées spectaculaires des capacités et de la vitesse de calcul du matériel classique. Ce progrès de la puissance informatique a permis d'appliquer des techniques, dont les développements théoriques datent du milieu du XXe siècle, sur des problèmes de classification qui deviennent de plus en plus difficiles.
id_id: Algoritma klasifikasi dan metode untuk pembelajaran mesin sangat penting untuk pengenalan pola dan aplikasi penambangan data. Teknik yang terkenal seperti vector support machine dan neural network telah berkembang selama dua dekade terakhir sebagai hasil dari kemajuan yang menakjubkan pada kemampuan dan kecepatan komputasi perangkat keras. Kemajuan kekuatan komputasi ini memungkinkan penerapan teknik-teknik yang dikembangkan secara teoretis menjelang pertengahan abad ke-20 pada masalah klasifikasi yang semakin menantang.
ja_jp: 機械学習の分類アルゴリズムや手法は、パターン認識やデータマイニングの応用に不可欠です。サポート・ベクター・マシンやニューラル・ネットワークなどのよく知られた技術は、古典的なハードウェアの計算能力の目覚ましい進歩の結果として、過去二十年の間に開花しました。こうした計算能力の進歩によって、二十世紀半ばに理論的に開発された技術を、より難しい分類問題にも適用することが可能となってきました。
ko_kr: 기계 학습을 위한 고전 분류 알고리즘 및 방법들은 패턴 인식과 데이터 마이닝 애플리케이션에 필수적이다. 지원 벡터 기계 및 신경망과 같이 잘 알려진 기술들은 고전적인 하드웨어 계산 능력 및 속도의 극적인 발전의 결과로서 지난 20년에 걸쳐 꽃을 피웠다. 이러한 컴퓨터 파워의 진보는 20세기 중반까지 이론적으로만 발달되었던 기술들을 점점 더 어려워지는 분류 문제들에 적용하는 것을 가능하게 만들었다.
pt_br: Algoritmos de classificação e métodos para aprendizado de máquina são essenciais para o reconhecimento de padrões e aplicações de mineração de dados. Técnicas bem conhecidas, como máquinas vetoriais de suporte e redes neurais, floresceram nas duas últimas décadas como resultado dos espetaculares avanços nas capacidades e velocidade computacionais do hardware clássico. Este progresso no poder computacional permitiu a aplicação de técnicas cujas teorias foram desenvolvidas em meados do século 20, de problemas de classificação que se tornavam cada vez mais desafiadores.
ta_in: மாதிரி அங்கீகாரம் மற்றும் தரவு சுரங்க பயன்பாடுகளுக்கு வகைப்பாடு வழிமுறைகள் மற்றும் இயந்திர கற்றலுக்கான முறைகள் அவசியம். கிளாசிக்கல் வன்பொருள் கணக்கீட்டு திறன்கள் மற்றும் வேகத்தில் அற்புதமான முன்னேற்றங்களின் விளைவாக ஆதரவு திசையன் இயந்திரங்கள் மற்றும் நரம்பியல் நெட்வொர்க்குகள் போன்ற நன்கு அறியப்பட்ட நுட்பங்கள் கடந்த இரண்டு தசாப்தங்களாக மலர்ந்தன. கணினி சக்தியின் இந்த முன்னேற்றம் 20 ஆம் நூற்றாண்டின் நடுப்பகுதியில் கோட்பாட்டளவில் உருவாக்கப்பட்ட நுட்பங்களைப் பயன்படுத்துவதை சாத்தியமாக்கியது, வகைப்படுத்தல் சிக்கல்கள் பெருகிய முறையில் சவாலாக இருந்தன

source: A key concept in classification methods is that of a kernel. Data cannot typically be separated by a hyperplane in its original space. A common technique used to find such a hyperplane consists of applying a non-linear transformation function to the data. This function is called a feature map, as it transforms the raw features, or measurable properties, of the phenomenon or subject under study. Classifying in this new feature space -and, as a matter of fact, also in any other space, including the raw original one- is nothing more than seeing how close data points are to each other. This is the same as computing the inner product for each pair of data points in the set. So, in fact we do not need to compute the non-linear feature map for each datum, but only the inner product of each pair of data points in the new feature space. This collection of inner products is called the kernel and it is perfectly possible to have feature maps that are hard to compute but whose kernels are not.
es_un: Un concepto clave en los métodos de clasificación es el de kernel. Los datos típicamente no pueden ser separados por un hiperplano en su espacio original. Una técnica común utilizada para encontrar dicho hiperplano consiste en aplicar una función de transformación no lineal a los datos. Esta función se llama mapa de características, ya que transforma las características crudas, o propiedades medibles, del fenómeno o tema bajo estudio. Clasificar en este nuevo espacio de características —y, de hecho, también en cualquier otro espacio incluyendo el original en crudo— no es más que ver qué tan cerca se encuentran los puntos de datos unos a otros. Esto es lo mismo que calcular el producto interno para cada par de puntos de datos en el conjunto. Por lo tanto, de hecho no necesitamos calcular el mapa de características no linear para cada dato, sino solo el producto interno de cada par de puntos de datos en el nuevo espacio de características. Esta colección de productos internos se llama kernel y es perfectamente posible tener mapas de características que son difíciles de calcular pero cuyos kernels no lo son.
fr_fr: Un concept clé des méthodes de classification est celui de noyau. Les données ne peuvent généralement pas être séparées par un hyperplan dans son espace d'origine. Une technique commune utilisée pour trouver un tel hyperplan consiste à appliquer une fonction de transformation non linéaire aux données. Cette fonction est appelée une carte des caractéristiques, car elle transforme les caractéristiques brutes ou les propriétés mesurables, du phénomène ou du sujet à l'étude. Classification dans ce nouvel espace de fonctionnalités - et, en fait, aussi dans tout autre espace, y compris l'original - n'est rien de plus que de voir à quel point les points de données sont proches les uns des autres. C'est la même chose que de calculer le produit intérieur pour chaque paire de données dans l'ensemble. Donc, en fait, nous n'avons pas besoin de calculer la carte des fonctionnalités non linéaires pour chaque datum, mais seulement le produit intérieur de chaque paire de données dans le nouvel espace de fonctionnalité. Cette collection de produits intérieurs s'appelle le noyau et il est parfaitement possible d'avoir des cartes de fonctionnalités difficiles à calculer mais dont les noyaux ne le sont pas.
id_id: Sebuah konsep utama dalam metode klasifikasi adalah kernel. Data biasanya tidak dapat dipisahkan oleh suatu *hyperplane* pada ruang asalnya. Sebuah teknik yang umum digunakan untuk mendapatkan *hyperplane* tersebut melibatkan penerapan fungsi transformasi nonlinear terhadap data. Fungsi ini disebut peta fitur karena ia mengubah fitur mentah atau sifat yang dapat diukur dari sebuah fenomena atau subjek yang sedang diteliti. Melakukan klasifikasi dalam ruang fitur yang baru ini -dan sebenarnya dalam ruang apapun, termasuk ruang asal- tidaklah lebih dari melihat seberapa dekat satu titik data dengan yang lain. Hal ini sama dengan menghitung hasil kali dalam (*inner product*) untuk setiap pasang titik data pada himpunan tersebut. Jadi pada kenyataannya kita tidak perlu menghitung peta fitur nonlinear untuk setiap data, tetapi hanya hasil kali dalam untuk setiap pasang titik data pada ruang fitur yang baru. akumpulan hasil kali dalam ini disebut kernel dan sangat mungkin untuk memiliki peta fitur yang sulit dikomputasi namun kernelnya tidak.
ja_jp: 分類における重要な概念は、カーネルです。データは通常、元の空間では超平面で分離することができません。このような超平面を得るために用いられる一般的な手法は、データに対する非線形変換関数の適用からなります。この関数は、研究対象の特徴量や測定量を変換することから、特徴マップと呼ばれます。この新しい特徴空間で分類を行うことは、データ点が互いにどれだけ近いかを見ることに他なりません。これは実は、元の空間を含む他の空間においても同様です。これは、集合内の各データ点の組に対して内積を計算するのと同じです。つまり実際には、各データの非線形特徴マップを計算する必要はなく、新たな特徴空間の各データ点の組に対して内積を計算するだけで十分です。この内積の集合はカーネルと呼ばれます。特徴マップを計算するのは困難だが、カーネルは計算できるという場合はありえます。
ko_kr: 분류 메소드의 핵심 개념은 커널에 대한 개념이다. 데이터는 일반적으로 원래 공간에서는 초평면(hyperplane)에 의해 분리될 수 없다. 이러한 초평면을 찾는 데 사용되는 일반적인 기술은 데이터에 비선형 변환 함수를 적용하는 것으로 구성된다. 이 함수는 연구 중인 현상 또는 주제의 원시 기능 또는 측정 가능한 특성을 변환하기 때문에 특징 맵(feature map)이라고 불린다. 이 새 특징 공간에서의 -당연히 원본을 포함하여 다른 어떤 공간에서도- 분류는 데이터 점들이 서로 얼마나 근접해 있는지 확인하는 것에 불과하다. 이는 세트의 각 데이터 점 쌍에 대한 내적을 계산하는 것과 동일하다. 따라서, 사실상 우리는 각각의 데이터에 대해 비선형 특징 맵을 계산할 필요가 없고, 새로운 특징 공간에서 각각의 데이터 점 쌍에 대한 내적만 구해주면 된다. 이 내적들의 콜렉션을 커널이라고 하며, 특징 맵 그 자체는 계산하기 어렵지만 이의 커널은 그렇지 않은 경우도 충분히 가능하다.
pt_br: Um conceito-chave nos métodos de classificação é o de um kernel. Os dados normalmente não podem ser separados por um hiperplano no seu espaço original. Uma técnica comum usada para encontrar um tal hiperplano consiste em aplicar uma função de transformação não-linear aos dados. Esta função é chamada de um mapa de ativação, uma vez que transforma as características brutas, ou propriedades mensuráveis, do fenômeno ou do sujeito em estudo. Classificando este novo espaço de funcionalidade - e, de fato, também em qualquer outro espaço, incluindo o original - é nada mais do que ver como os pontos de dados estão próximos um do outro. Isso é o mesmo que calcular o produto interno para cada par de pontos de dados no conjunto. Então, na verdade, não precisamos calcular o mapa de ativação não-lineares para cada dado, mas apenas o produto interno de cada par de dados no novo espaço de recursos. Esta coleção de produtos internos é chamada de kernel e é perfeitamente possível ter mapas de recursos que são difíceis de calcular mas cujos kernels não são.
ta_in: வகைப்பாடு முறைகளில் ஒரு முக்கிய கருத்து ஒரு கர்னலின் கருத்து. தரவை அதன் அசல் இடத்தில் ஒரு ஹைப்பர் பிளேன் மூலம் பிரிக்க முடியாது. அத்தகைய ஹைப்பர் பிளேனைக் கண்டுபிடிக்கப் பயன்படுத்தப்படும் ஒரு பொதுவான நுட்பம் தரவுக்கு நேரியல் அல்லாத உருமாற்ற செயல்பாட்டைப் பயன்படுத்துகிறது. இந்த செயல்பாடு ஒரு அம்ச வரைபடம் என்று அழைக்கப்படுகிறது, ஏனெனில் இது நிகழ்வு அல்லது ஆய்வின் கீழ் உள்ள மூல அம்சங்களை அல்லது அளவிடக்கூடிய பண்புகளை மாற்றுகிறது. இந்த புதிய அம்ச இடைவெளியில் வகைப்படுத்துதல் - உண்மையில், மூல அசல் உட்பட வேறு எந்த இடத்திலும் - தரவு புள்ளிகள் ஒருவருக்கொருவர் எவ்வளவு நெருக்கமாக இருக்கின்றன என்பதைப் பார்ப்பதைத் தவிர வேறொன்றுமில்லை. தொகுப்பில் உள்ள ஒவ்வொரு ஜோடி தரவு புள்ளிகளுக்கும் உள் உற்பத்தியைக் கணக்கிடுவதற்கு இது சமம். எனவே, உண்மையில் ஒவ்வொரு தரவுக்கும் நேரியல் அல்லாத அம்ச வரைபடத்தை நாம் கணக்கிட தேவையில்லை, ஆனால் புதிய அம்ச இடத்தில் ஒவ்வொரு ஜோடி தரவு புள்ளிகளின் உள் தயாரிப்பு மட்டுமே. உள் தயாரிப்புகளின் இந்த தொகுப்பு கர்னல் என்று அழைக்கப்படுகிறது, மேலும் கணக்கிடுவது கடினம், ஆனால் அதன் கர்னல்கள் இல்லாத அம்ச வரைபடங்களை வைத்திருப்பது முற்றிலும் சாத்தியமாகும்.

source: In this notebook we provide an example of a classification problem that requires a feature map for which computing the kernel is not efficient classically -this means that the required computational resources are expected to scale exponentially with the size of the problem. We show how this can be solved in a quantum processor by a direct estimation of the kernel in the feature space. The method we used falls in the category of what is called supervised learning, consisting of a training phase (where the kernel is calculated and the support vectors obtained) and a test or classification phase (where new unlabeled data is classified according to the solution found in the training phase).
es_un: En este cuaderno proveemos un ejemplo de un problema de clasificación que requiere un mapa de características para el cual calcular el kernel no es eficiente clásicamente —esto significa que se espera que los recursos computacionales requeridos escalen exponencialmente con el tamaño del problema. Mostramos cómo se puede resolver esto en un procesador cuántico mediante una estimación directa del kernel en el espacio de características. El método que usamos cae en la categoría de lo que se llama aprendizaje supervisado, que consiste de una fase de entrenamiento (donde se calcula el kernel y se obtienen los vectores de soporte) y una fase de prueba o clasificación (donde los nuevos datos no etiquetados se clasifican de acuerdo a la solución encontrada en la fase de entrenamiento).
fr_fr: Dans ce bloc-notes nous fournissons un exemple de problème de classification qui nécessite une carte de fonctionnalités pour laquelle le calcul du noyau n'est pas efficace classiquement - ce qui signifie que les ressources de calcul requises sont censées s'adapter exponentiellement à la taille du problème. Nous montrons comment cela peut être résolu dans un processeur quantique par une estimation directe du noyau dans l'espace fonctionnel. La méthode que nous utilisons s'inscrit dans la catégorie de ce que l'on appelle l'apprentissage supervisé, consistant en une phase de formation (où le noyau est calculé et les vecteurs de support obtenus) et une phase de test ou de classification (où de nouvelles données non étiquetées sont classées en fonction de la solution trouvée dans la phase d'apprentissage).
id_id: Dalam Notebook ini kami memberikan sebuah contoh masalah klasifikasi yang membutuhkan peta fitur yang komputasi kernelnya secara klasik tidak efisien -ini berarti sumber daya komputasi yang dibutuhkan diprediksi akan meningkat secara eksponensial sesuai besarnya permasalahan. Kami menunjukkan bagaimana hal ini dapat diselesaikan dalam sebuah prosesor kuantum dengan estimasi langsung kernel di dalam ruang fitur. Metode yang kami gunakan termasuk dalam kategori *supervised learning*, yang terdiri dari fase *training* (di mana kernel dihitung dan *support vector* didapatkan) dan fase uji atau klasifikasi (di mana data baru yang belum diberikan label akan diklasifikasi menurut solusi yang didapat pada fase *training*).
ja_jp: このノートブックでは、カーネルの計算が古典手法では効率的でない特徴マップを要する分類問題の例を示します。効率的でないとは、必要な計算リソースが問題のサイズに対して指数関数的に大きくなることを意味しています。量子プロセッサで特徴空間のカーネルを直接的に推定することで、この問題を解決する方法を紹介します。用いた手法は、学習段階 (カーネルを計算し、サポート・ベクトルを得る段階) と、テストあるいは分類段階 (学習段階で得られた解に基づき、ラベルされていない新たなデータを分類する段階) からなる、いわゆる教師あり学習として分類されるものです。
ko_kr: 이 노트북에서는 커널이 효율적으로 효율적이지 않은 기능 맵을 필요로 하는 분류 문제의 예를 제공한다. 이는 필요한 계산 자원이 문제의 크기에 따라 기하급수적으로 확장될 것으로 예상됨을 의미한다. 우리는 이것이 특징 공간에서 커널의 직접적인 추정에 의해 양자 프로세서에서 어떻게 해결될 수 있는지를 보여준다. 사용한 방법은 훈련 단계 (커널이 계산되고 지원되는 지원 벡터) 와 테스트 또는 분류 단계 (새로운 비레이블 데이터는 훈련 단계에서 찾은 솔루션에 따라 분류되는 경우) 로 구성되는, 감독 학습이라고 하는 항목의 범주에 속한다.
pt_br: Neste capitulo nós fornecemos um exemplo de um problema de classificação que requer um mapa de ativação para o qual computar o kernel não é eficiente - isso significa que os recursos computacionais necessários devem escalar exponencialmente com o tamanho do problema. Nós mostramos como isso pode ser resolvido em um processador quântico através de uma estimativa direta do kernel no espaço de recurso. O método que utilizámos insere-se na categoria daquilo a que se chama aprendizado supervisionado, consistindo de uma fase de treinamento (onde o kernel é calculado e os vetores de suporte obtidos) e uma fase de teste ou classificação (onde dados não rotulados são classificados de acordo com a solução encontrada na fase de treinamento).
ta_in: இந்த நோட்புக்கில், ஒரு வகைப்படுத்தல் சிக்கலுக்கான ஒரு எடுத்துக்காட்டை நாங்கள் வழங்குகிறோம், அதற்கான அம்ச வரைபடம் தேவைப்படுகிறது, அதற்காக கர்னலைக் கணக்கிடுவது கிளாசிக்கல் திறமையாக இல்லை - இதன் பொருள் தேவையான கணக்கீட்டு வளங்கள் சிக்கலின் அளவோடு அதிவேகமாக அளவிடப்படும் என்று எதிர்பார்க்கப்படுகிறது. அம்ச இடைவெளியில் கர்னலின் நேரடி மதிப்பீட்டால் குவாண்டம் செயலியில் இதை எவ்வாறு தீர்க்க முடியும் என்பதை நாங்கள் காண்பிக்கிறோம். நாங்கள் பயன்படுத்திய முறை மேற்பார்வை கற்றல் என்று அழைக்கப்படுகிறது, இதில் ஒரு பயிற்சி கட்டம் (கர்னல் கணக்கிடப்பட்டு ஆதரவு திசையன்கள்) மற்றும் ஒரு சோதனை அல்லது வகைப்பாடு கட்டம் (புதிய பெயரிடப்படாத தரவு கண்டுபிடிக்கப்பட்ட தீர்வுக்கு ஏற்ப வகைப்படுத்தப்படும்) பயிற்சி கட்டத்தில்).

source: References and additional details:
es_un: Referencias y detalles adicionales:
fr_fr: Références et informations supplémentaires:
id_id: Referensi dan detail tambahan:
ja_jp: 参考文献と追加資料：
ko_kr: 참조 및 추가 세부사항:
pt_br: Referências e detalhes adicionais:
ta_in: குறிப்புகள் மற்றும் கூடுதல் விவரங்கள்:

source: [1] Vojtech Havlicek, Antonio D. C´orcoles, Kristan Temme, Aram W. Harrow, Abhinav Kandala, Jerry M. Chow, and Jay M. Gambetta1, “Supervised learning with quantum enhanced feature spaces,” `arXiv: 1804.11326 <https://arxiv.org/pdf/1804.11326.pdf>`__
es_un: [1] Vojtech Havlicek, Antonio D. C´orcoles, Kristan Temme, Aram W. Harrow, Abhinav Kandala, Jerry M. Chow, y Jay M. Gambetta1, “Supervised learning with quantum enhanced feature spaces,” `arXiv: 1804.11326 <https://arxiv.org/pdf/1804.11326.pdf>`__
id_id: [1] Vojtech Havlicek, Antonio D. C´orcoles, Kristan Temme, Aram W. Harrow, Abhinav Kandala, Jerry M. Chow, dan Jay M. Gambetta1, “Supervised learning with quantum enhanced feature spaces,” `arXiv: 1804.11326 <https://arxiv.org/pdf/1804.11326.pdf>`__

source: The ad hoc data set
es_un: El conjunto de datos ad hoc
fr_fr: Le jeu de données ad hoc
id_id: Dataset ad hoc
ja_jp: アドホック・データセット
ko_kr: 임시 데이터 세트
pt_br: Conjunto de dados ad hoc
ta_in: ஆட் ஹாக் தரவு தொகுப்பு

source: As a first example we will use the ad hoc dataset as described in the above referenced paper. From the dataset we take samples for use as training, testing and the final prediction (datapoints).
es_un: Como primer ejemplo utilizaremos el conjunto de datos ad hoc tal como se describe en el articulo referenciado anteriormente. Del conjunto de datos tomamos muestras para usarlas como entrenamiento, prueba y la predicción final (puntos de datos).
fr_fr: Comme pour le premier exemple nous utiliserons la base de données ad hoc telle que décrite dans le document mentionné ci-dessus. Nous échantillons cette base de données pour l’apprentissage, le test et les prédictions finales.
id_id: Sebagai contoh pertama kita akan menggunakan dataset ad hoc seperti yang dijelaskan dalam paper referensi di atas. Dari dataset tersebut kita ambil sampel untuk *training*, pengujian, dan prediksi akhir (titik data).
ja_jp: 最初の例として、上記の参考文献に記載されているアドホック・データセットを用います。このデータセットから、訓練・テスト・最終予測 (データ点) として使用するためのサンプルを取ります。
ko_kr: 첫 번째 예로, 위에서 참조된 논문에 설명된 대로 임시 데이터 세트를 사용할 것이다. 데이터 세트에서 학습, 테스트 및 최종 예측(데이터 지점)으로 사용하기 위해 표본들을 추출한다.
pt_br: Como um primeiro exemplo, usaremos o dataset ad hoc como descrito no documento referenciado acima. No conjunto de dados pegamos amostras para uso como treinamento, teste e previsão final (pontos de dados).
ta_in: முதல் எடுத்துக்காட்டு, மேலே குறிப்பிடப்பட்ட தாளில் விவரிக்கப்பட்டுள்ளபடி ஆட் ஹாக் தரவுத்தொகுப்பைப் பயன்படுத்துவோம். தரவுத்தொகுப்பிலிருந்து பயிற்சி, சோதனை மற்றும் இறுதி முன்கணிப்பு (தரவு புள்ளிகள்) என பயன்படுத்த மாதிரிகளை எடுத்துக்கொள்கிறோம்.
