Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/machine_learning/02_qsvm_multiclass.po
Languages: fr_fr, zh_tw

source: This page was generated from `tutorials/machine_learning/02_qsvm_multiclass.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/machine_learning/02_qsvm_multiclass.ipynb`__.
zh_tw: 此頁面是從 `tutorials/machine_learning/02_qsvm_multiclass.ipynb`__ 產生的。

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/02_qsvm_multiclass.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/02_qsvm_multiclass.ipynb>`_.
zh_tw: 在 `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/02_qsvm_multiclass.ipynb>`_中互動執行。

source: QSVM multiclass classification
fr_fr: QVSM: séparateurs multi-classes quantiques à vaste marge (machines à vecteurs de support quantique)
zh_tw: QSVM 多類別分類

source: A `multiclass extension <https://qiskit.org/documentation/apidoc/qiskit.aqua.components.multiclass_extensions.html>`__ works in conjunction with an underlying binary (two class) classifier to provide classification where the number of classes is greater than two.
fr_fr: Une `extension multi-classe <https://qiskit.org/documentation/apidoc/qiskit.aqua.components.multiclass_extensions.html>` __ fonctionne conjointement avec un discriminant binaire sous-jacent (deux classes) pour fournir une classification où le nombre de classes est supérieur à deux.
zh_tw: `多類別擴充功能 <https://qiskit.org/documentation/apidoc/qiskit.aqua.components.multiclass_extensions.html>`__ 會與基礎二進位（兩個類別）分類器一起運作，以提供類別數目大於 2 的分類。<https://qiskit.org/documentation/apidoc/qiskit.aqua.components.multiclass_extensions.html><https://qiskit.org/documentation/apidoc/qiskit.aqua.components.multiclass_extensions.html>

source: Currently the following multiclass extensions are supported:
fr_fr: Actuellement, les extensions multiclasses suivantes sont prises en charge :
zh_tw: 目前支援下列多類別擴充功能：

source: OneAgainstRest
zh_tw: OneAgainstRest （一對所有）

source: AllPairs
fr_fr: AllPaires
zh_tw: AllPairs （兩兩成對）

source: ErrorCorrectingCode
fr_fr: Code ErrorCorrectingCode
zh_tw: ErrorCorrectingCode （糾錯碼）

source: These use different techniques to group the data from the binary classification to achieve the final multiclass classification.
fr_fr: Ils utilisent des techniques différentes pour regrouper les données de la classification binaire afin d'obtenir la classification multi-classe finale.
zh_tw: 這些使用不同的技術將資料從二進位分類中分組，以達到最終的多類別分類。

source: We want a dataset with more than two classes, so here we choose the ``Wine`` dataset that has 3 classes.
fr_fr: Nous voulons une base de données avec plus de deux classes, nous choisissons ici la base de données ``Wine`` qui a 3 classes.
zh_tw: 我們想要有兩個以上類別的資料集，所以在這裡，我們會選擇有 3 個類別的 ``Wine`` 資料集。

source: To used a multiclass extension an instance thereof simply needs to be supplied, on the QSVM creation, using the ``multiclass_extension`` parameter. Although ``AllPairs()`` is used in the example below, the following multiclass extensions would also work:
fr_fr: Pour utiliser une extension multi-classe, il suffit d’utiliser le paramètre ``multiclass_extension`` lors de la création du QSVM. Bien que ``AllPairs()`` soit utilisé dans l'exemple ci-dessous, les extensions multi-classes suivantes seraient également acceptées :
zh_tw: 若要使用多類別擴充功能，只需在建立QSVM 時使用 ``multiclass_extension`` 參數提供實例（instance）。 雖然在以下範例中使用 ``AllPairs()`` ，但下列多類別擴充功能也會起作用：
