Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/machine_learning/03_vqc.po
Languages: es_un, fr_fr, pt_br, ta_in

source: This page was generated from `tutorials/machine_learning/03_vqc.ipynb`__.
es_un: Esta página fue generada a partir de `tutorials/machine_learning/03_vqc.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/machine_learning/03_vqc.ipynb`__.
pt_br: Esta página foi gerada a partir de `tutorials/machine_learning/03_vqc.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/machine_learning/03_vqc.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/03_vqc.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/03_vqc.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/03_vqc.ipynb>`_.
pt_br: Executar interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/03_vqc.ipynb>` _.
ta_in: `IBM Quantum ஆய்வகத்தில்<https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/03_vqc.ipynb>`_ இல் ஊடாடும் வகையில் இயக்கவும்.

source: Variational Quantum Classifier (VQC)
es_un: Clasificador variacional cuántico (VQC)
fr_fr: Classifieurs variationnels quantiques (VQC)
pt_br: Classificador Quântico Variacional (VQC)
ta_in: விரிவான Quantum Classifier (VQC)

source: The QSVM notebook demonstrated a kernel based approach. This notebook shows a variational method using the `VQC <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQC.html>`__ algorithm.
es_un: El cuaderno de QSVM demostró un enfoque basado en kernel. Este cuaderno muestra un método variacional utilizando el algoritmo `VQC <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQC.html>`__.
fr_fr: Le bloc-notes QSVM a démontré une approche basée sur un estimateur par noyau. Ce bloc-notes montre une méthode variationnelle utilisant l'algorithme `VQC <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQC.html>`__.
pt_br: O capitulo QSVM demonstrou uma abordagem baseada em kernel. Este notebook mostra um método variacional usando o algoritmo `VQC <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQC.html>`__.
ta_in: QSVM notebook ஒரு கெர்னல் சார்ந்த அணுகல் தெரிவித்தது. இந்த நூல் `VQC <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQC.html>` __ வழிமுறையைப் பயன்படுத்தி ஒரு வேற்றுமை முறையை காட்டுகிறது.

source: For further information see also the following reference, as given in the QSVM notebook, that also describes this approach: “Supervised learning with quantum enhanced feature spaces,” `arXiv: 1804.11326 <https://arxiv.org/pdf/1804.11326.pdf>`__
es_un: Para más información, véase también la siguiente referencia, tal como se indicó en el cuaderno de QSVM, que también describe este enfoque: “Supervised learning with quantum enhanced feature spaces,” `arXiv: 1804.11326 <https://arxiv.org/pdf/1804.11326.pdf>`__
fr_fr: Pour plus d'informations, voir aussi la référence suivante, comme indiqué dans le cahier QSVM, qui décrit également cette approche : « Apprentissage supervisé avec des espaces de fonctionnalités améliorés quantiques », « arXiv: 1804. 1326 <https://arxiv.org/pdf/1804.11326.pdf>`__
pt_br: Para mais informações veja também a seguinte referência, como dada no caderno QSVM, que também descreve esta abordagem: “Supervised learning with quantum enhanced feature spaces,” `arXiv: 1804.11326 <https://arxiv.org/pdf/1804.11326.pdf>`__
ta_in: மேலும் தகவல்களுக்கு, QSVM குறிப்பு புத்தகத்தில் கொடுக்கப்பட்ட பின்வரும் குறிப்புகளையும் பார்க்கவும், அத்துடன் இந்த அணுகுதலையும் விளக்குகிறது: “Supervised learning with quantum enhanced feature spaces,” `arXiv: 1804.11326 <https://arxiv.org/pdf/1804.11326.pdf>`__

source: As per the QSVM notebook again we will use the ad hoc dataset as described in the above referenced paper. From the dataset we take samples for use as training, testing and the final prediction (datapoints).
es_un: Tal como en el cuaderno de QSVM, usaremos nuevamente el conjunto de datos ad hoc como se describe en el artículo mencionado anteriormente. Del conjunto de datos tomamos muestras para usar como entrenamiento, prueba y la predicción final (puntos de datos).
fr_fr: Comme pour le bloc-notes QSVM , nous utiliserons la base de données ad hoc telle que décrite dans le document mentionné ci-dessus. Nous échantillons cette base de données pour l’apprentissage, le test et les prédictions finales.
pt_br: Por meio do caderno QSVM novamente usaremos o conjunto de dados ad hoc conforme descrito no documento referenciado acima. No conjunto de dados pegamos amostras para uso como treinamento, teste e previsão final (pontos de dados).
ta_in: QSVM நூலின் படி, மேலே குறிப்பிடப்பட்ட தாளில் விவரிக்கப்பட்டுள்ளபடி ஆட் ஹாக் தரவுத்தொகுப்பைப் பயன்படுத்துவோம். தரவுத்தொகுப்பிலிருந்து பயிற்சி, சோதனை மற்றும் இறுதி முன்கணிப்பு (தரவு புள்ளிகள்) என பயன்படுத்த மாதிரிகளை எடுத்துக்கொள்கிறோம்.

source: With the dataset ready we can setup the `VQC <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQC.html>`__ algorithm to do a classification. We use the `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ data encoding circuit from the Qiskit circuit library, like we did with QSVM. But this is a variational algorithm so we need a variational form, i.e. parameterized circuit, whose parameters can be varied by an optimizer when computing VQC’s cost function. For this we choose `TwoLocal <https://qiskit.org/documentation/stubs/qiskit.circuit.library.TwoLocal.html>`__ from the Qiskit circuit library. As the qasm_simulator has shot noise we choose to use `SPSA <https://qiskit.org/documentation/stubs/qiskit.aqua.components.optimizers.SPSA.html>`__ which is designed to perform under noisy conditions.
es_un: Con el conjunto de datos listo podemos configurar el algoritmo `VQC <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQC.html>`__ para hacer una clasificación. Utilizamos el circuito de codificación de datos `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ de la librería de circuitos de Qiskit, como hicimos con QSVM. Pero este es un algoritmo variacional por lo que necesitamos una forma variacional, es decir, un circuito parametrizado, cuyos parámetros se pueden variar mediante un optimizador cuando se calcula la función de costo de VQC. Para esto elegimos `TwoLocal <https://qiskit.org/documentation/stubs/qiskit.circuit.library.TwoLocal.html>`__ de la librería de circuitos de Qiskit. Como el qasm_simulator ha disparado ruido elegimos utilizar `SPSA <https://qiskit.org/documentation/stubs/qiskit.aqua.components.optimizers.SPSA.html>`__ que está diseñado para funcionar en condiciones ruidosas.
fr_fr: Avec le jeu de données prêt nous pouvons configurer l'algorithme `VQC <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQC.html>` __ pour effectuer une classification. Nous utilisons le circuit de codage de données `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>` __ de la bibliothèque de circuits de Qiskit, comme nous l'avons fait avec l'algorithme QSVM. Mais il s'agit d'un algorithme variationnel, de sorte que nous avons besoin d'une forme variationnelle, c'est-à-dire un circuit paramétré, dont les paramètres peuvent être variés par un optimiseur lors du calcul de la fonction de coût de VQC. Pour cela, nous choisissons `TwoLocal <https://qiskit.org/documentation/stubs/qiskit.circuit.library.TwoLocal.html>` __ de la bibliothèque de circuits de Qiskit. Comme le qasm_simulator est bruité à cause du nombre fini de répétitions (souvent 8192), nous choisissons d'utiliser `SPSA <https://qiskit.org/documentation/stubs/qiskit.aqua.components.optimizers.SPSA.html>` __ qui est conçu pour fonctionner dans des conditions bruitées.
pt_br: Com o conjunto de dados pronto, podemos configurar o algoritmo `VQC <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQC.html>`__ para fazer uma classificação. Nós usamos o `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ circuito de codificação de dados da biblioteca de circuitos Qiskit, como fizemos com QSVM. Mas esse é um algoritmo variacional, então precisamos de uma forma variacional, ou seja, circuito parametrizado, cujos parâmetros podem ser variados por um otimizador ao calcular a função de custo do VQC. Para isso, escolhemos `TwoLocal <https://qiskit.org/documentation/stubs/qiskit.circuit.library.TwoLocal.html>`__ da biblioteca de circuitos de Qiskit. Como o qasm_simulator tem ruído de disparo, nós escolhemos usar o `SPSA <https://qiskit.org/documentation/stubs/qiskit.aqua.components.optimizers.SPSA.html>`__ que é projetado para executar sob condições de ruído.
ta_in: தரவுத்தொகுப்பு தயாராக இருப்பதால், ஒரு வகைப்பாடு செய்ய `VQC <https://qiskit.org/documentation/stubs/qiskit.aqua.algorithms.VQC.html>`__ வழிமுறையை அமைக்கலாம். QSVM உடன் நாங்கள் செய்ததைப் போலவே, Qiskit சர்க்யூட் நூலகத்திலிருந்து `ZZFeatureMap <https://qiskit.org/documentation/stubs/qiskit.circuit.library.ZZFeatureMap.html>`__ தரவு குறியாக்க சர்க்யூட் பயன்படுத்துகிறோம். ஆனால் இது ஒரு மாறுபட்ட வழிமுறை, எனவே நமக்கு ஒரு மாறுபட்ட வடிவம் தேவை, அதாவது அளவுருவாக்கப்பட்ட சர்க்யூட், VQC-இன் செலவு செயல்பாட்டைக் கணக்கிடும்போது அதன் அளவுருக்கள் ஒரு தேர்வாளரால் மாறுபடும். இதற்காக Qiskit சர்க்யூட் நூலகத்திலிருந்து `TwoLocal <https://qiskit.org/documentation/stubs/qiskit.circuit.library.TwoLocal.html>`__ ஐ தேர்வு செய்கிறோம். இங்கு qasm_simulator, சுற்றுகளின் சத்தத்தைக் கொண்டுள்ளதால் `SPSA <https://qiskit.org/documentation/stubs/qiskit.aqua.components.optimizers.SPSA.html>`__ ஐப் பயன்படுத்த நாங்கள் தேர்வு செய்கிறோம், இது சத்தமில்லாத சூழ்நிலையில் செயல்பட வடிவமைக்கப்பட்டுள்ளது.

source: Here the BasicAer ``qasm_simulator`` is used with 1024 shots.
es_un: Aquí el ``qasm_simulator`` BasicAer se usa con 1024 iteraciones.
fr_fr: Ici, le simulateur ``qasm_simulator`` de BasicAer est utilisé avec 1024 mesures.
pt_br: Aqui o BasicAer ``qasm_simulator`` é usado com 1024 coletas.
ta_in: இங்கு BasicAer ``qasm_ simulator`` 1024 சுற்றுகளுடன் பயன்படுகிறது.

source: Now VQC, as well as QSVM, have ``train``, ``test`` and ``predict`` methods. The ``run`` method, as used above, will call these in turn based on whatever data was supplied to the algorithm. But the methods called directly to say train a model and then do predict. Since the vqc instance has already been trained, lets predict another set of sample datapoints by directly calling ``predict``.
es_un: Ahora VQC, así como QSVM, tiene los métodos ``train``, ``test`` y ``predict``. El método ``run`` como se usó anteriormente, los llamará a su vez en función de los datos que se suministraron al algoritmo. Pero los métodos se llaman directamente para decir que se entrene un modelo y luego hacer la predicción. Dado que la instancia vqc ya ha sido entrenada, podemos predecir otro conjunto de puntos de datos llamando directamente a ``predict``.
fr_fr: VQC comme QSVM ont les méthodes ``train``, ``test`` et ``predict``. La méthode ``run``, telle qu'utilisée ci-dessus, les appellera à leur tour en fonction des données fournies à l'algorithme. Mais les méthodes peuvent être appelées directement pour, par exemple, entraîner un modèle puis effectuer une prédiction. Puisque l'instance VQC a déjà été entraînée, nous pouvoir prédire un autre ensemble de points de données en appelant directement ``predict``.
pt_br: Agora o VQC, bem como QSVM, têm métodos ``train``, ``test`` e ``predict``. O método ``run``, como usado acima, irá chamá-los por vez, com base em quaisquer dados fornecidos ao algoritmo. Mas os métodos chamados diretamente para treinar um modelo e, depois, a prever. Como a instância do vqc já foi treinada, permite prever outro conjunto de dados de amostra chamando diretamente ``predict``.
ta_in: இப்போது VQC, மற்றும் QSVM, ``train``, ``test`` மற்றும் ``predict`` முறைகள் உள்ளன. மேலே பயன்படுத்தப்பட்ட ``run`` முறை, வழிமுறைக்கு வழங்கப்பட்ட எந்த தரவையும் அடிப்படையாகக் கொண்டு இவற்றை அழைக்கும். ஆனால் ஒரு மாதிரியைப் பயிற்றுவிக்கவும் பின்னர் கணிக்கவும் நேரடியாக இங்கு அழைக்கப்படுகின்றன. ஏனெனில் vqc நிகழ்வு ஏற்கனவே பயிற்சியளிக்கப்பட்டிருப்பதால், ``predict`` என்று நேரடியாக அழைப்பதன் மூலம் மற்றொரு மாதிரி தரவு புள்ளிகளைக் கணிக்க உதவுகிறது.

source: Finally I will note that the Qiskit classifier algorithms can ``save_model`` after training and also ``load_model`` that had been previously saved.
es_un: Finalmente indicaré que en los algoritmos clasificadores de Qiskit se puede llamar a ``save_model`` para guardar el modelo después del entrenamiento y también a ``load_model`` para cargar un modelo que haya sido guardado previamente.
fr_fr: Enfin, il faut noter que les algorithmes de classification de Qiskit peuvent être sauvegardés après l'entraînement avec la méthode ``save_model`` et un modèle déjà entraîné et sauvegardé peut être chargé avec la méthode ``load_model``.
pt_br: Por fim, se observa que os algoritmos classificadores Qiskit podem ``save_model`` após o treinamento e também ``load_model`` que haviam sido salvos previamente.
ta_in: இறுதியாக, Qiskit வகைப்படுத்தி வழிமுறைகள் பயிற்சியின் பின்னர் ``save_model`` மற்றும் முன்னர் சேமிக்கப்பட்ட ``load_model`` ஆகியவற்றையும் செய்ய முடியும் என்பதை நான் கவனிக்கிறேன்.
