Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/machine_learning/04_qgans_for_loading_random_distributions.po
Languages: es_un, fr_fr, id_id, pt_br, ta_in, zh_tw

source: Now, we plot the evolution of the generator’s and the discriminator’s loss functions during the training, as well as the progress in the relative entropy between the trained and the target distribution.
es_un: Ahora, graficamos la evolución de las funciones de pérdida del generador y del discriminador durante el entrenamiento, así como el progreso en la entropía relativa entre la distribución entrenada y la objetivo.
fr_fr: Maintenant, nous traçons l'évolution des fonctions de coût du générateur et du discriminateur pendant la formation, ainsi que les progrès de l'entropie relative entre la distribution formée et la distribution cible.
id_id: Sekarang kita plot evolusi *loss function* dari generator dan diskriminator selama *training* serta kemajuan entropi relatif antara distribusi yang di-*train* dengan target.
pt_br: Agora, visualizamos a evolução das funções de perda do gerador e do discriminador durante o treinamento, bem como o progresso na entropia relativa entre a distribuição treinada e a alvo.
ta_in: இப்போது, ​​ஜெனரேட்டரின் பரிணாம வளர்ச்சியையும், பயிற்சியின் போது பாகுபாடு காண்பவரின் இழப்பு செயல்பாடுகளையும், பயிற்சி பெற்ற மற்றும் இலக்கு விநியோகத்திற்கும் இடையிலான ஒப்பீட்டு என்ட்ரோபியின் முன்னேற்றத்தையும் நாங்கள் வரையறுக்கிறோம்.

source: Finally, we also compare the cumulative distribution function (CDF) of the trained distribution to the CDF of the target distribution.
es_un: Finalmente, también comparamos la función de distribución acumulada (CDF) de la distribución entrenada con la CDF de la distribución objetivo.
fr_fr: Enfin, nous comparons également la fonction de distribution cumulative (CDF) de la distribution entraînée au CDF de la distribution cible.
id_id: Akhirnya, kita juga bandingkan fungsi distribusi kumulatif (CDF) dari distribusi yang di-*train* dengan CDF dari distribusi target.
pt_br: Por último, comparamos também a função de distribuição cumulativa (CDF) da distribuição treinada ao CDF da distribuição alvo.
ta_in: இறுதியாக, பயிற்சி பெற்ற விநியோகத்தின் ஒட்டுமொத்த விநியோக செயல்பாட்டை (CDF) இலக்கு விநியோகத்தின் CDF உடன் ஒப்பிடுகிறோம்.
zh_tw: 最後，我們還將訓練分佈的累積分佈函數（CDF）與目標分佈的 CDF 進行比較。
