Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/machine_learning/04_qgans_for_loading_random_distributions.po
Languages: es_un, fr_fr, id_id, pt_br, ta_in, zh_tw

source: This page was generated from `tutorials/machine_learning/04_qgans_for_loading_random_distributions.ipynb`__.
es_un: Esta página fue generada a partir de `tutorials/machine_learning/04_qgans_for_loading_random_distributions.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/machine_learning/04_qgans_for_loading_random_distributions.ipynb`__.
id_id: Halaman ini dibangkitkan dari `tutorials/machine_learning/04_qgans_for_loading_random_distributions.ipynb`__.
pt_br: Esta página foi gerada a partir de `tutorials/machine_learning/04_qgans_for_loading_random_distributions.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/machine_learning/04_qgans_for_loading_random_distributions.ipynb`__ இலிருந்து உருவாக்கப்பட்டது.
zh_tw: 此頁面是從 `tutorials/machine_learning/04_qgans_for_loading_random_distributions.ipynb `__ 產生的。

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/04_qgans_for_loading_random_distributions.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/04_qgans_for_loading_random_distributions.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/04_qgans_for_loading_random_distributions.ipynb>`_.
id_id: Jalankan secara interaktif di `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/04_qgans_for_loading_random_distributions.ipynb>`_.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/04_qgans_for_loading_random_distributions.ipynb>`_.
ta_in: `IBM Quantum ஆய்வகத்தில் <https://quantum-computing.ibm.com/jupyter/tutorial/algorithms/06_qaoa.ipynb>` _ இல் ஊடாடும் வகையில் இயக்கவும்.
zh_tw: 在 `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/machine_learning/04_qgans_for_loading_random_distributions.ipynb>`_中互動執行。

source: qGANs for Loading Random Distributions
es_un: qGANs para Cargar Distribuciones Aleatorias
fr_fr: qGANs pour le chargement de distributions aléatoires
id_id: qGAN untuk Memuat Distribusi Acak
pt_br: qGANs para o Carregamento de Distribuições Aleatórias
ta_in: சீரற்ற விநியோகங்களை ஏற்றுவதற்கான qGAN கள்
zh_tw: 用於載入隨機分佈的 qGANs

source: Given :math:`k`-dimensional data samples, we employ a quantum Generative Adversarial Network (qGAN) to learn the data’s underlying random distribution and to load it directly into a quantum state:
es_un: Dadas unas muestras de datos :math:`k`-dimensionales, empleamos una red generativa antagónica cuántica (quantum Generative Adversarial Network, qGAN) para aprender la distribución aleatoria subyacente de los datos y cargarla directamente en un estado cuántico:
fr_fr: A partir des données d'exemple :math:`k`-dimensionnelles, nous utilisons un réseau antagoniste génératif quantique (quantum Generative Adversarial Network (qGAN)) pour apprendre la distribution aléatoire sous-jacente des données et la charger directement dans un état quantique:
id_id: Diberikan sampel data :math:`k`-dimensi, kita gunakan sebuah *quantum Generative Adversarial Network* (qGAN) untuk mempelajari distribusi acak yang mendasari data dan memuatnya secara langsung ke dalam sebuah *state* quantum:
pt_br: Dado amostras de dados :math:`k`-dimensionais nós empregamos uma Rede Adversária Generativa Quântica (qGAN) para aprender a distribuição aleatória subjacente aos dados e carregá-la diretamente em um estado quântico:
ta_in: கொடுக்கப்பட்டுள்ள :math:`k`-பரிமாண தரவு மாதிரிகள், தரவின் அடிப்படை சீரற்ற விநியோகத்தைக் கற்றுக்கொள்வதற்கும் அதை நேரடியாக ஒரு குவாண்டம் நிலைக்கு ஏற்றுவதற்கும் ஒரு quantum Generative Adversarial Network (qGAN) பயன்படுத்துகிறோம்:
zh_tw: 給定 :math:`k' 維資料樣本，我們採用了量子生成對抗網路（quantum Generative Adversarial Network, qGAN）來學習資料的基礎隨機分佈，並將其直接載入到量子狀態：

source: where :math:`p_{\theta}^{j}` describe the occurrence probabilities of the basis states :math:`\big| j\rangle`.
es_un: donde :math:`p_{\theta}^{j}` describe las probabilidades de ocurrencia de los estados base :math:`\big| j\rangle`.
fr_fr: où :math:`p_{\theta}^{j}` décrit la probabilité d'occurrence des états de base :math:`\big| j\rangle`.
id_id: di mana :math:`p_{\theta}^{j}` merupakan probabilitas kemunculan *basis state* :math:`\big| j\rangle`.
pt_br: onde :math:`p_{\theta}^{j}` descreve as probabilidades de ocorrência dos estados base :math:`\big| j\rangle`.
ta_in: இங்கே :math:`p_{\theta}^{j}` அடிப்படை நிகழ்தகவுகளை விவரிக்கிறது :math:`\big| j\rangle`.
zh_tw: 其中， :math:`p_{\theta}^{j}` 說明基底態的發生機率 :math:`\big| j\rangle`.

source: The aim of the qGAN training is to generate a state :math:`\big| g_{\theta}\rangle` where :math:`p_{\theta}^{j}`, for :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, describe a probability distribution that is close to the distribution underlying the training data :math:`X=\left\{x^0, \ldots, x^{k-1} \right\}`.
es_un: El objetivo del entrenamiento de qGAN es generar un estado :math:`\big| g_{\theta}\rangle` donde :math:`p_{\theta}^{j}`, para :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, describe una distribución de probabilidad cercana a la distribución subyacente de los datos de entrenamiento :math:`X=\left\{x^0, \ldots, x^{k-1} \right\}`.
fr_fr: Le but de l'apprentissage qGAN est de générer un état :math:`\big| g_{\theta}\rangle`où :math:`p_{\theta}^{j}`, pour :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, décrit la probabilité de distribution qui est proche de la distribution sous-jacente des données d'apprentissage :math:`X=\left\{x^0, \ldots, x^{k-1} \right\}`.
id_id: Tujuan pelatihan qGAN adalah untuk menghasilkan *state* :math:` \big | g_ {\theta}\rangle ` di mana :math:` p_ {\theta} ^{j}`, untuk :math:` j\in \left\{0, \ldots, {2 ^ n-1} \right\} `, adalah distribusi probabilitas yang dekat dengan distribusi data :math:` X = \left\ {x ^ 0, \ldots, x ^{k-1} \right\} `.
pt_br: O objetivo do treinamento da qGAN é gerar um estado :math:`\big| g_{\theta}\rangle` onde :math:`p_{\theta}^{j}`, for :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, descreve uma distribuição de probabilidade que esteja próxima da distribuição subjacente aos dados de treinamento :math:`X=\left\{x^0, \ldots, x^{k-1} \right\}`.
ta_in: ஒரு qGAN பயிற்சியின் நோக்கம் ஒரு நிலையை உருவாக்குவது :math:`\big| g_{\theta}\rangle` இங்கே :math:`p_{\theta}^{j}`, இதற்கு :math:`j\in \left\{0, \ldots, {2^n-1} \right\} `, பயிற்சித் தரவின் அடிப்படையிலான விநியோகத்திற்கு நெருக்கமான நிகழ்தகவு விநியோகத்தை விவரிக்கவும் :math:`X=\left\{x^0, \ldots, x^{k-1} \right\}`.
zh_tw: 量子生成對抗網路（qGAN）訓練的目的是產生一個 態 :math:`\big| g_{\theta}\rangle`，其中 :math:`p_{\theta}^{j}`, 對於 :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, 敘述一個接近於訓練資料分佈的機率分佈 :math:`X=\left\{x^0, \ldots, x^{k-1} \right\}`.

source: For further details please refer to `Quantum Generative Adversarial Networks for Learning and Loading Random Distributions <https://arxiv.org/abs/1904.00043>`__ *Zoufal, Lucchi, Woerner* [2019].
es_un: Para más detalles consulte `Quantum Generative Adversarial Networks for Learning and Loading Random Distributions <https://arxiv.org/abs/1904.00043>`__ *Zoufal, Lucchi, Woerner* [2019].
fr_fr: Pour plus de détails, merci de vous référer à "Réseaux Antagonistes Génératifs Quantique pour l'Apprentissage et le chargement de distribution aléatoire" (`Quantum Generative Adversarial Networks for Learning and Loading Random Distributions <https://arxiv.org/abs/1904.00043>`__) *Zoufal, Lucchi, Woerner* [2019].
id_id: Untuk rincian lebih lanjut silakan mengacu pada `Quantum Generative Adversarial Networks for Learning and Loading Random Distributions <https://arxiv.org/abs/1904.00043>`__ *Zoufal, Lucchi, Woerner* [2019].
pt_br: Para mais detalhes, consulte `Quantum Generative Adversarial Networks for Learning and Loading Random Distributions <https://arxiv.org/abs/1904.00043>`__ *Zoufal, Lucchi, Woerner* [2019].
ta_in: மேலும் விவரங்களுக்காக `Quantum Generative Adversarial Networks for Learning and Loading Random Distributions <https://arxiv.org/abs/1904.00043>`__ *Zoufal, Lucchi, Woerner* [2019].
zh_tw: 如需詳細資料，請參閱 `Quantum Generative Adversarial Networks for Learning and Loading Random Distributions <https://arxiv.org/abs/1904.00043>`__ *Zoufal， Lucchi， Woerner* [2019].

source: For an example of how to use a trained qGAN in an application, the pricing of financial derivatives, please see the `Option Pricing with qGANs <../finance/10_qgan_option_pricing.ipynb>`__ tutorial.
es_un: Para ver un ejemplo de cómo utilizar una qGAN entrenada en una aplicación, la fijación de precios de derivados financieros, consulte el tutorial `Fijación de Precios de Opciones con qGANs <../finance/10_qgan_option_pricing.ipynb>`__.
fr_fr: Pour un exemple d'utilisation d'un qGAN entraîné pour une application, la tarification des produits financiers dérivés par exemple, veuillez consulter le tutoriel `Tarification des options avec qGANs <../finance/10_qgan_option_pricing.ipynb>` __.
id_id: Sebagai contoh bagaimana menggunakan qGAN yang telah dilatih dalam suatu aplikasi, untuk mendapatkan harga derivatif keuangan, silakan baca tutorial `Option Pricing with qGANs <../finance/10_qgan_option_pricing.ipynb>`__.
pt_br: Para um exemplo de como usar uma qGAN treinada em uma aplicação, a precificação de derivativos financeiros, por favor veja o tutorial `Precificação de Opções com qGANs <../finance/10_qgan_option_pricing.ipynb>`__.
ta_in: ஒரு பயன்பாட்டில் பயிற்சியளிக்கப்பட்ட qGAN ஐ எவ்வாறு பயன்படுத்துவது என்பதற்கான எடுத்துக்காட்டுக்கு, நிதி வழித்தோன்றல்களின் விலை, தயவுசெய்து `Option Pricing with qGANs <../finance/10_qgan_option_pricing.ipynb>`__ பயிற்சிகளைப் பார்க்கவும்.
zh_tw: 如需如何使用訓練過的qGAN在財務衍生工具的計價範例，請參閱` 使用qGANs做選擇權計價（Option Pricing with qGANs） <..finance/10_qgan_option_pricing.ibynb>`__ 的教學。

source: Load the Training Data
es_un: Cargar los Datos de Entrenamiento
fr_fr: Chargement des données d'apprentissage
id_id: Memuat Data Training
pt_br: Carregando os Dados de Treinamento
ta_in: பயிற்சித் தரவை ஏற்றவும்
zh_tw: 載入訓練資料

source: First, we need to load the :math:`k`-dimensional training data samples (here k=1).
es_un: En primer lugar, necesitamos cargar las muestras de datos de entrenamiento :math:`k`-dimensionales (aquí k=1).
fr_fr: Tout d'abord, nous devons charger les échantillons de données d'apprentissage de dimension :math:"k" (ici k= 1).
id_id: Pertama, kita perlu memuat sampel data *training* :math:`k`-dimensi (di sini k= 1).
pt_br: Primeiramente, precisamos carregar as amostras de dados de treinamento :math:`k`-dimensionais (aqui k=1).
ta_in: முதலில், நாம் :math:`k`-பரிமாணப் பயிற்சித் தரவு மாதிரிகளை ஏற்ற வேண்டும் (இங்கு k=1).
zh_tw: 首先，我們需要載入 :math:`k' 維訓練資料樣本（這裡 k=1）。

source: Next, the data resolution is set, i.e. the min/max data values and the number of qubits used to represent each data dimension.
es_un: A continuación, se establece la resolución de los datos, es decir, los valores mín/máx de los datos y el número de qubits utilizados para representar cada dimensión de datos.
fr_fr: Ensuite, la résolution des données est définie, c'est-à-dire les valeurs de données min/max et le nombre de qubits utilisés pour représenter chaque dimension de données.
id_id: Lalu, tentukan resolusi data, yaitu nilai minimum/maksimum data dan jumlah qubit yang digunakan untuk merepresentasikan setiap dimensi data.
pt_br: Em seguida, a resolução dos dados é definida, ou seja, os valores min/max dos dados e o número de qubits usados para representar cada dimensão dos dados.
ta_in: அடுத்து, தரவுத் தீர்மானம் அமைக்கப்பட்டுள்ளது, அதாவது min/max தரவு மதிப்புகள் மற்றும் ஒவ்வொரு தரவு பரிமாணத்தையும் குறிக்கப் பயன்படுத்தப்படும் qubits எண்ணிக்கை.
zh_tw: 接下來，設定資料解析度，例如， min/max 資料的最大/最小值，以及用來代表每一個資料維度的量子位元數目。

source: Initialize the qGAN
es_un: Inicializar la qGAN
fr_fr: Initialiser le qGAN
id_id: Inisialisasi qGAN
pt_br: Inicialize a qGAN
ta_in: qGAN ஐத் தொடங்கவும்

source: The qGAN consists of a quantum generator :math:`G_{\theta}`, a variational quantum circuit, and a classical discriminator :math:`D_{\phi}`, a neural network.
es_un: La qGAN consiste de un generador cuántico :math:`G_{\theta}`, un circuito cuántico variacional, y un discriminador clásico :math:`D_{\phi}`, una red neuronal.
fr_fr: Le qGAN consiste en un générateur quantique :math:`G_ {\theta}`, un circuit quantique variationnel, et un discriminateur classique :math:`D_ { \phi }` implémenté grâce à un réseau neuronal.
id_id: qGAN terdiri dari sebuah *quantum generator* :math:`G_{\theta}`, sebuah sirkuit quantum variasional, dan diskriminator klasik :math:`D_{\phi}`, sebuah *neural network*.
pt_br: A qGAN consiste de um gerador quântico :math:`G_{\theta}`, um circuito quântico variacional, e um discriminador clássico :math:`D_{\phi}`, uma rede neural.
ta_in: qGAN ஒரு குவாண்டம் ஜெனரேட்டரைக் கொண்டுள்ளது :math:`G_{\theta}`, ஒரு மாறுபட்ட குவாண்டம் சர்க்யூட், மற்றும் ஒரு கிளாசிக்கல் பாகுபாடு காண்பிப்பவர் :math:`D_{\phi}`, ஒரு நியூரல் வலைப்பின்னல்.

source: To implement the quantum generator, we choose a depth-\ :math:`1` variational form that implements :math:`R_Y` rotations and :math:`CZ` gates which takes a uniform distribution as an input state. Notably, for :math:`k>1` the generator’s parameters must be chosen carefully. For example, the circuit depth should be :math:`>1` because higher circuit depths enable the representation of more complex structures.
es_un: Para implementar el generador cuántico, elegimos una forma variacional con profundidad :math:`1` que implementa rotaciones :math:`R_Y` y compuertas :math:`CZ` la cual toma una distribución uniforme como estado de entrada. En particular, para :math:`k>1, los parámetros del generador deben elegirse con cuidado. Por ejemplo, la profundidad del circuito debe ser :math:`>1` porque las profundidades del circuito más altas permiten la representación de estructuras más complejas.
fr_fr: Pour implémenter le générateur quantique, nous choisissons une forme variationnelle de profondeur-\ :math:`1` qui utilise des rotations :math:`R_Y` et des portes :math:`CZ` et qui prend une distribution uniforme en tant qu'état d'entrée. Notamment, pour :math:`k>1`, les paramètres du générateur doivent être choisis avec soin. Par exemple, la profondeur du circuit doit être :math:`>1` car des profondeurs de circuit plus élevées permettent la représentation de structures plus complexes.
id_id: Untuk mengimplementasi *quantum generator*, kita pilih sebuah bentuk variasional kedalaman-\ :math:`1` yang mengimplementasi rotasi :math:`R_Y` dan gerbang :math:`CZ` yang memiliki *state* input sebuah distribusi seragam. Terutama untuk :math:`k>1` parameter generator harus dipilih dengan hati-hati. Sebagai contoh, kedalaman sirkuit harus :math:`>1` karena kedalaman sirkuit yang lebih tinggi memungkinkan representasi struktur yang lebih kompleks.
pt_br: Para implementar o gerador quântico escolhemos uma forma variacional de profundidade \ :math:`1` que implementa rotações :math:`R_Y` e portas :math:`CZ` que recebe uma distribuição uniforme como um estado de entrada. Notadamente, para :math:`k>1` os parâmetros do gerador devem ser escolhidos com cuidado. Por exemplo, a profundidade do circuito deve ser :math:`>1` porque profundidades maiores de circuitos permitem a representação de estruturas mais complexas.
ta_in: குவாண்டம் ஜெனரேட்டரை செயல்படுத்த, ஒரு ஆழம்-\ :math:`1` மாறுபடும் வடிவத்தை நாங்கள் தேர்வு செய்கிறோம் :math:`R_Y` சுழற்சிகள் மற்றும் :math:`CZ` கேட்கள் ஒரு சீரான விநியோகத்தை உள்ளீட்டு நிலையாக எடுத்துக்கொள்கின்றன. குறிப்பாக, இதற்கு: :math:`k>1` ஜெனரேட்டரின் அளவுருக்கள் கவனமாக தேர்ந்தெடுக்கப்பட வேண்டும். எடுத்துக்காட்டாக, சர்க்யூட் ஆழம் :math:`>1` இருக்க வேண்டும், ஏனெனில் அதிக சர்க்யூட் ஆழங்கள் மிகவும் சிக்கலான கட்டமைப்புகளின் பிரதிநிதித்துவத்தை செயல்படுத்துகின்றன.
zh_tw: 為了實現量子產生器，我們選擇了實現 :math:"R_Y" 旋轉和 :math:`CZ` 閘的深度-\ :math:`1' 的變分形式，以均勻分佈為輸入狀態。 值得注意的是，對於 :math:`k>1` 產生器的參數必須小心選擇。 例如，電路深度應該是 :math:`>1` ，因為更高的電路深度能代表更複雜的結構。

source: The classical discriminator used here is based on a neural network implementation using NumPy. There is also a discriminator based on PyTorch which is not installed by default when installing Qiskit - see `Optional Install <https://github.com/Qiskit/qiskit-aqua#optional-installs>`__ for more information.
es_un: El discriminador clásico utilizado aquí se basa en una implementación de red neuronal utilizando NumPy. También hay un discriminador basado en PyTorch que no está instalado por defecto cuando se instala Qiskit - consulte `Instalación Opcional <https://github.com/Qiskit/qiskit-aqua#optional-installs>`__ para más información.
fr_fr: Le discriminateur classique utilisé ici est basé sur une implémentation de réseau neuronal à l'aide de NumPy. Il existe également un discriminateur basé sur PyTorch qui n'est pas installé par défaut lors de l'installation de Qiskit - voir `Installation en option <https://github.com/Qiskit/qiskit-aqua#optional-installs>`__ pour plus d'informations.
id_id: Diskrimator klasik yang digunakan di sini didasarkan pada implementasi *neural network* menggunakan NumPy. Ada juga diskrimator berdasarkan PyTorch yang tidak terpasang secara default saat memasang Qiskit - lihat `Optional Install <https://github.com/Qiskit/qiskit-aqua#optional-installs>` __ untuk informasi lebih lanjut.
pt_br: O discriminador clássico usado aqui baseia-se em uma implementação de rede neural usando o NumPy. Há também um discriminador baseado no PyTorch que não está instalado por padrão ao instalar o Qiskit - consulte `Instalações opcionais <https://github.com/Qiskit/qiskit-aqua#optional-installs>`__ para obter mais informações.
ta_in: இங்கே பயன்படுத்தப்படும் கிளாசிக்கல் பாகுபாடு NumPy ஐப் பயன்படுத்தி ஒரு நியூரல் பிணைய செயலாக்கத்தை அடிப்படையாகக் கொண்டது. Qiskit-டை நிறுவும் போது முன்னிருப்பாக நிறுவப்படாத PyTorch-ன் அடிப்படையில் ஒரு பாகுபாடு காண்பிப்பவர் இருக்கிறார் - மேலும் தகவலுக்கு `Optional Install <https://github.com/Qiskit/qiskit-aqua#optional-installs>`__ ஐப் பார்க்கவும்.
zh_tw: 這裡使用的古典鑑別器，是使用 NumPy 的類神經網路實作而成。 也有基於 PyTorch 的鑑別器，其在安裝Qiskit時並未預設安裝，如需相關資訊，請參閱「自訂安裝（Optional Install） <https://github.com/Qiskit/qiskit-aqua#optional-installs>`__ 」。

source: Here, both networks are updated with the ADAM optimization algorithm (ADAM is qGAN optimizer default).
es_un: Aquí, ambas redes se actualizan con el algoritmo de optimización ADAM (ADAM es el optimizador por defecto de qGAN).
fr_fr: Ici, les deux réseaux sont mis à jour avec l'algorithme d'optimisation ADAM (ADAM est la valeur par défaut de l'optimiseur qGAN).
id_id: Di sini, kedua *network* ini diperbarui dengan algoritma optimasi ADAM (ADAM adalah default pengoptimasi qGAN).
pt_br: Aqui, ambas as redes são atualizadas com o algoritmo de otimização ADAM (ADAM é o otimizador padrão da qGAN).
ta_in: இங்கு, இரண்டு வலைப்பதிவுகளும் ADAM optimization algorithm (ADAM is qGAN optimizer default) போன்றவற்றுடன் புதுப்பிக்கப்படுகிறது.
zh_tw: 在這裡，這兩個網路都會使用 ADAM 最佳化演算法進行更新（ADAM 是 qGAN 最佳化工具預設值）。

source: Run the qGAN Training
es_un: Ejecutar el Entrenamiento de qGAN
fr_fr: Exécuter l'entraînement du qGAN
id_id: Menjalankan qGAN Training
pt_br: Executar o Treinamento da qGAN
ta_in: qGAN பயிற்சியை இயக்கவும்
zh_tw: 執行 qGAN 訓練

source: During the training the discriminator’s and the generator’s parameters are updated alternately w.r.t the following loss functions:
es_un: Durante el entrenamiento, los parámetros del discriminador y del generador son actualizados alternativamente con respecto a las siguientes funciones de pérdida:
fr_fr: Pendant la formation, les paramètres du discriminateur et du générateur sont mis à jour alternativement avec les fonctions coût suivantes:
id_id: Selama *training*, parameter generator and diskriminator diperbarui secara bergantian dengan *loss function* berikut:
pt_br: Durante o treinamento os parâmetros do discriminador e do gerador são atualizados alternadamente com respeito às seguintes funções de perda:
ta_in: பயிற்சியின் போது பாகுபாடு காண்பிப்பவர் மற்றும் ஜெனரேட்டரின் அளவுருக்கள் பின்வரும் இழப்பு செயல்பாடுகளைப் பொறுத்து மாறி மாறி புதுப்பிக்கப்படும்:
zh_tw: 在訓練期間，鑑別器與產生器的參數會對於以下損失函數做交替更新：

source: and
es_un: y
fr_fr: et
id_id: dan
pt_br: e
ta_in: மற்றும்
zh_tw: 以及

source: with :math:`m` denoting the batch size and :math:`g^l` describing the data samples generated by the quantum generator.
es_un: con :math:`m` denotando el tamaño del lote y :math:`g^l` describiendo las muestras de datos generadas por el generador cuántico.
fr_fr: avec :math:`m` dénotant la taille du lot et :math:`g^l` décrivant les échantillons de données générés par le générateur quantique.
id_id: dengan :math:`m` merupakan ukuran *batch* dan :math:`g^l` merupakan sampel data yang dibangkitkan oleh *quantum generator*.
pt_br: com :math:`m` indicando o tamanho do lote (batch size) e :math:`g^l` descrevendo as amostras de dados geradas pelo gerador quântico.
ta_in: உடன் :math:`m` தொகுதி அளவைக் குறிக்கிறது மற்றும் :math:`g^l` குவாண்டம் ஜெனரேட்டரால் உருவாக்கப்பட்ட தரவு மாதிரிகளை விவரிக்கிறது.

source: Please note that the training, for the purpose of this notebook, has been kept briefer by the selection of a known initial point (``init_params``). Without such prior knowledge be aware training may take some while.
es_un: Por favor, note que el entrenamiento, a efectos de este cuaderno, ha sido más breve debido a la selección de un punto inicial conocido (``init_params``). Sin este conocimiento previo, tenga en cuenta que el entrenamiento puede tardar algún tiempo.
fr_fr: Veuillez noter que l'entraînement, aux fins de ce notebook, a été raccourcie par la sélection d'un point initial connu (``init_params``). Sans ces connaissances préalables, l'entraînement peut prendre un certain temps.
id_id: Harap diperhatikan bahwa *training* dalam Notebook ini dipersingkat dengan pemilihan titik awal yang diketahui (``init_params``). Tanpa pengetahuan awal seperti ini, ketahui bahwa *training* dapat memakan waktu lebih lama.
pt_br: Por favor, note que o treinamento, para a finalidade deste notebook, foi mantido mais curto pela seleção de um ponto inicial conhecido (``init_params``). Sem esse conhecimento prévio pode demorar algum tempo.
ta_in: இந்த நோட்புக்கின் நோக்கத்திற்காக, அறியப்பட்ட ஆரம்பப் புள்ளியை (``init_params``) தேர்ந்தெடுப்பதன் மூலம் பயிற்சிச் சுருக்கமாக வைக்கப்பட்டுள்ளது என்பதை நினைவில் கொள்க. அத்தகைய முன் அறிவு இல்லாமல் விழிப்புணர்வுப் பயிற்சி சிறிது நேரம் ஆகலாம்.

source: Training Progress & Outcome
es_un: Progreso del Entrenamiento y Resultados
fr_fr: Progrès & Résultats de l'entraînement
id_id: Progres Training dan Hasil
pt_br: Progresso do Treinamento & Resultados
ta_in: பயிற்சி முன்னேற்றம் & வெளியீடு
zh_tw: 訓練進度與成果
