Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/operators/01_operator_flow.po
Languages: bn_bn, es_mx, es_un, fr, ja_jp, ko_kr, pt_un, ta, tr

source: Every ``ListOp`` has four properties: \* ``oplist`` - The list of ``OperatorBase``\ s which may represent terms, factors, etc. \* ``combo_fn`` - The function taking a list of complex numbers to an output value which defines how to combine the outputs of the ``oplist`` items. For broadcasting simplicity, this function is defined over NumPy arrays. \* ``coeff`` - A coefficient multiplying the primitive. Note that ``coeff`` can be int, float, complex or a free ``Parameter`` object (from ``qiskit.circuit`` in Terra) to be bound later using ``my_op.bind_parameters``. \* ``abelian`` - Indicates whether the Operators in ``oplist`` are known to mutually commute (usually set after being converted by the ``AbelianGrouper`` converter).
bn_bn: প্রতি ``ListOp`` এর চারটি ধর্ম আছেঃ \* ``oplist`` - পদ, উৎপাদক এইত্যাদি ``OperatorBase``\ s তালিকার অন্তর্ভুক্ত। \* ``combo_fn``- অন্বয়টি একটি জটিল সংখ্যার তালিকা ইনপুট হিসেবে সম্পাদনা করে এমন একটি ফলাফল প্রদান করে যা ``oplist`` এর উপাদানগুলোর সাথে সমন্বয় করা যায়। আরও সহজভাবে বললে, এই অন্বয়টি বা ফাংশনটি NumPy এরে দ্বারা সংজ্ঞায়িত। \* ``coeff`` - একটি সহগ কে মৌলিক উৎপাদক দ্বারা গুণন। লক্ষণীয় যে, ``coeff`` এর ডাটা টাইপ পুর্ণসংখ্যা (int), দশমিক (ফ্লোট), জটিল (কমপ্লেক্স) অথবা মুক্ত চলক বা ``Parameter`` হতে পারে (যা ``qiskit.circuit`` টেরা থেকে গৃহীত) যা সীমা ``my_op.bind_parameters`` দ্বারা নির্ধারিত। \* ``abelian`` - নির্দেশ করে কার্যকারকের ``oplist` পারস্পরিক বিনিময়যোগ্য বা মিউচুয়ালি কমিউট ( যা ``AbelianGrouper`` পরিবর্তক বা রূপান্তরক (কনভার্টার) ব্যবহার করে রূপান্তর করা হয়)।
es_mx: Cada ``ListOp`` tiene cuatro propiedades: \* ``oplist`` - La lista de ``OperatorBase`` que pueden representar términos, factores, etc. \* ``combo_fn`` - La función toma una lista de números complejos a un valor de salida que define cómo combinar las salidas de los elementos ``oplist``. Para la simplicidad de la difusión, esta función se define sobre arreglos de NumPy. \* ``coeff`` - Un coeficiente que multiplica la primitiva. Tenga en cuenta que ``coeff`` puede ser de tipo int, float, complejo o un objeto libre ``Parámetro`` (de ``qiskit.circuit`` en Terra) para ser vinculado más tarde utilizando ``my_op. ind_parameters``. \* ``abelian`` - Indica si los operadores en ``oplist`` son conocidos por conmutar (generalmente establecido después de ser convertido por el conversor ``AbelianGrouper``).
ko_kr: 모든 ``ListOp`` 는 4개의 속성을 갖고 있다: \* ``oplist`` - 항과 인수 등을 나타내는 ``OperatorBase``\ 들의 목록. \* ``combo_fn`` - 복소수 목록을 받아 ``oplist`` 항목에 병합될 수 있도록 정의하는 출력값을 주는 함수. 브로드캐스팅을 단순하게 하고자 이 함수는 NumPy array 위에 정의되어 있다. \* ``coeff`` - 원시 자료형에 곱하는 계수. ``coeff`` 는 정수, 부동소수점으로 표현된 수, 복소수, 또 이후에 ``my_op.bind_parameters`` 를 이용하여 제한할 수 있는 자유로운 ``Parameter`` 객체 (Terra의 ``qiskit.circuit`` 에서 온)가 될 수 있다. \* ``abelian`` - ``oplist`` 에 있는 연산자들이 서로 교환 가능한지를 나타낸다 (대개 ``AbelianGrouper`` 변환기를 통해 변환된 후 정해진다).

source: Note that ``ListOp`` supports typical iteration overloads, so you can use indexing like ``my_op[4]`` to access the ``OperatorBase``\ s in ``oplist``.
bn_bn: লক্ষণীয় যে, ``ListOp`` শ্রেণী পুনরাবৃত্তি ব্যবহার অনুমিত দেয় ( সাপোর্টস টিপিকাল ইটারেশন অভারলোডস), ফলে ``OperatorBase``\ s অন্তর্ভুক্ত ``oplist`` এর তালিকা ব্যবহারের ক্ষেত্রে ``my_op[4]`` এইরুপ তালিকা ক্রম করা সম্ভব।
ko_kr: ``ListOp`` 는 일반적인 이터레이션 오버로드를 지원하므로, ``oplist`` 에 있는 ``OperatorBase``\ 들에 접근할 때 ``my_op[4]`` 와 같은 인덱싱을 사용할 수 있다.

source: The ``CircuitSampler`` traverses an Operator and converts any ``CircuitStateFns`` into approximations of the resulting state function by a ``DictStateFn`` or ``VectorStateFn`` using a quantum backend. Note that in order to approximate the value of the ``CircuitStateFn``, it must 1) send the state function through a depolarizing channel, which will destroy all phase information and 2) replace the sampled frequencies with **square roots** of the frequency, rather than the raw probability of sampling (which would be the equivalent of sampling the **square** of the state function, per the Born rule.)
bn_bn: ``CircuitSampler`` টি একটি অপারেটরকে অতিক্রম করে এবং কোনো ``CircuitStateFns``কে রূপান্তরিত করে একটি ``Dicstatefn`` অথবা`` `Vectorstatefn` দ্বারা আনুমানিক ফলস্বরুপ ফাংশনের মান বা অবস্থায় কোয়ানটাম ব্যাকএন্ডকে ব্যবহার করে। মনে রাখবেন যে ``CircuitStateFn`` এর মানটি আনুমানিক করার জন্য, এটি অবশ্যই ১) একটি বিমেরুকরণ (ডিপোলারাইজেশন) চ্যানেলের মাধ্যমে ফাংশনের মান বা অবস্থাকে পাঠান, যা সমস্ত দশার তথ্য ধ্বংস করবে এবং ২) নমুনা কম্পাঙ্কগুলির সাথে ** বর্গমূলগুলির ** কম্পাঙ্কের প্রতিস্থাপন করুন, যা নমুনাটির অপরিমার্জিত সম্ভাব্যতার পরিবর্তে হবে (যা ফাংশনের মান বা অবস্থার ** বর্গের ** নমুনার সমতুল্য হবে, Born নিয়মানুসারে।)
ko_kr: ``CircuitSampler`` 는 연산자를 오가며, 양자 백엔드를 사용하는 ``DictStateFn`` 또는 ``VectorStateFn`` 으로 ``CircuitStateFns`` 를 결과 상태 함수의 근사치로 변환한다. ``CircuitStateFn`` 의 값을 근사하려면, 1) 상태 함수를 모든 위상 정보를 파기하는 편광소멸 채널을 통해 보내야 하며, 2) 샘플 주파수들을 샘플링의 원래 확률(Born 규칙을 따라 상태 함수의 **제곱** 을 샘플링하는 것과 동등한) 이 아닌 주파수의 **제곱근** 으로 대체해야 한다.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/operators/01_operator_flow.ipynb>`_.
es_mx: Ejecuta interactivamente en `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/operators/01_operator_flow.ipynb>`_.

source: `Introduction <#introduction>`__
es_mx: `Introducción <#introduction>`__

source: `Pauli operators, sums, compositions, and tensor products <#paulioperators>`__
es_mx: `Operadores de Pauli, sumas, composiciones y productos de tensoriales <#paulioperators>`__

source: `Part I: State Functions and Measurements <#statefunctions>`__
es_mx: `Parte I: Funciones de estado y mediciones <#statefunctions>`__

source: `Algebraic operations and predicates <#algebraicoperations>`__
es_mx: `Operaciones algebraicas y predicados <#algebraicoperations>` __

source: `Part II: ``PrimitiveOp``\ s <#primitiveops>`__
es_mx: `Parte II: ``PrimitiveOp`` <#primitiveops>`__

source: `Matrix elements <#matrixelements>`__
es_mx: `Elementos de matriz <#matrixelements>`__

source: `Applying an operator to a state vector <#applyingoperator>`__
es_mx: `Aplicando un operador a un vector de estado <#applyingoperator>`__

source: `Part III ``ListOp`` and subclasses <#listopsubclasses>`__
es_mx: `Parte III ``ListOp`` y subclases <#listopsubclasses>`__

source: `Part IV: ``OperatorStateFn`` <#operatorstatefn>`__
es_mx: `Parte IV: ``OperatorStateFn`` <#operatorstatefn>`__

source: `Part V: Converters <#converters>`__
es_mx: `Parte V: Conversores <#converters>`__

source: `Evolutions, ``exp_i()``, and the ``EvolvedOp`` <#evolutions>`__
es_mx: `Evoluciones, ``exp_i()``, y el operador ``EvolvedOp`` <#evolutions>`__

source: `Weighted sum of Pauli operators <#weightedsum>`__
es_mx: `Suma ponderada de operadores de Pauli <#weightedsum>`__

source: `Expectations <#expectations>`__
es_mx: `Conversores Expectations <#expectations>`__

source: `Executing ``CircuitStateFn``\ s with the ``CircuitSampler`` <#executing>`__
es_mx: `Ejecutando ``CircuitStateFn`` con ``CircuitSampler`` <#executing>`__

source: In the preceding two examples, the tensor product and composition of Pauli operators were immediatley reduced to the equivalent (possibly multi-qubit) Pauli operator. If we tensor or compose more complicated objects, the result is objects representing the unevaluated operations. That is, algebraic expressions.
es_mx: En los dos ejemplos anteriores, el producto tensorial y la composición de los operadores de Pauli se redujeron inmediatamente al operador equivalente de Pauli (posiblemente multi-cúbit). Si tensamos o componemos objetos más complicados, como resultado obtendremos objetos que representan expresiones algebraicas, es decir, operaciones no evaluadas.

source: Quantum states are represented by subclasses of the class ``StateFn``. There are four representations of quantum states: ``DictStateFn`` is a sparse respresentation in the computational basis, backed by a ``dict``. ``VectorStateFn`` is a dense representation in the computational basis backed by a numpy array. ``CircuitStateFn`` is backed by a circuit and represents the state obtained by executing the circuit on the all-zero computational-basis state. ``OperatorStateFn`` represents mixed states via a density matrix. (As we will see later, ``OperatorStateFn`` is also used to represent observables.)
es_mx: Los estados cuánticos son representados por subclases de la clase ``StateFn``. Hay cuatro representaciones de estados cuánticos: ``DictStateFn`` es una representación dispersa en la base computacional, respaldada por un ``dict``. ``VectorStateFn`` es una representación densa en la base computacional respaldada por un arreglo de numpy. ``CircuitStateFn`` está respaldado por un circuito y representa el estado obtenido al ejecutar el circuito en el estado cero de la base computacional. ``OperatorStateFn`` representa estados mixtos a través de una matriz de densidad. (Como veremos más tarde, ``OperatorStateFn`` también se utiliza para representar observables.)

source: Be aware that parentheses are often neccessary to override **operator precedence**.
es_mx: Ten en cuenta que los paréntesis son a menudo necesarios para anular la **precedencia de operador**.

source: The composistion operator is used to perform an inner product, which by default is held in an unevaluated form. Here is a representation of :math:`\langle 1 | 1 \rangle`.
es_mx: El operador de composición se utiliza para realizar un producto interno, que por defecto se mantiene en una forma no evaluada. Ejemplo: :math:`\langle 1 | 1 \rangle`.

source: The ``eval`` method returns a column from an operator. For example, the Pauli :math:`X` operator is represented by a ``PauliOp``. Asking for a column returns an instance of the sparse representaion, a ``DictStateFn``.
es_mx: El método ``eval`` devuelve una columna de un operador. Por ejemplo, el operador de Pauli :math:`X` es representado por un ``PauliOp``. Si se solicita una columna se retorna una instancia de la representación dispersa, un ``DictStateFn``.
