Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/operators/01_operator_flow.po
Languages: bn_bn, es_mx, es_un, fr, ja_jp, ko_kr, pt_un, ta, tr

source: Quantum states are represented by subclasses of the class ``StateFn``. There are four representations of quantum states: ``DictStateFn`` is a sparse representation in the computational basis, backed by a ``dict``. ``VectorStateFn`` is a dense representation in the computational basis backed by a numpy array. ``CircuitStateFn`` is backed by a circuit and represents the state obtained by executing the circuit on the all-zero computational-basis state. ``OperatorStateFn`` represents mixed states via a density matrix. (As we will see later, ``OperatorStateFn`` is also used to represent observables.)
bn_bn: কোয়ান্টাম দশা ``StateFn`` উপশ্রেণী দ্বারা প্রকাশ করা যায়। চার ধরণের কোয়ান্টাম দশা প্রকাশভঙ্গী আছেঃ ``DictStateFn`` একটি গাণিতিক বেসিস দশা প্রকাশ করে, যা ``dict`` দ্বারা প্রকাশিত। ``VectorStateFn`` একটি নাম্পাই এরে দ্বারা প্রকাশিত একটি গাণিতিক দশা প্রকাশ ভঙ্গি। ``CircuitStateFn`` একটি যুক্তি বর্তনী ভিত্তিক প্রকাশভঙ্গী যা সকল-শুন্য বেসিস দশাস্থিত যুক্তি বর্তনীর উপর মহড়া সম্পাদন করে। ``OperatorStateFn`` একটি ডেনসিটি ম্যাট্রিক্স দ্বারা প্রকাশিত মিশ্র দশা অবস্থা। (আমরা পরবর্ততীতে দেখব কিভাবে এই ``OperatorStateFn` একটি পর্যবেক্ষণ কার্যকারকের কাজে ব্যবহার করা যায়।
es_un: Los estados cuánticos están representados por subclases de la clase ``StateFn``. Hay cuatro representaciones de estados cuánticos: ``DictStateFn`` es una representación escasa en la base computacional, respaldada por un ``dict``. ``VectorStateFn`` es una representación densa en la base computacional respaldada por un arreglo numpy. ``CircuitStateFn`` está respaldado por un circuito y representa el estado obtenido al ejecutar el circuito en el estado con todos sus qubits en cero en la base computacional. ``OperatorStateFn`` representa estados mixtos a través de una matriz de densidad. (Como veremos más adelante, ``OperatorStateFn`` también se usa para representar observables)
fr: Les états quantiques sont représentés par des sous-classes de la classe ``StateFn``. Il y a quatre représentations d'états quantiques: ``DictStateFn`` est une représentation éparse dans la base de calcul, s'appuyant sur un ``dict``. ``VectorStateFn`` est une représentation dense sur la base de calcul, et utilise un tableau numpy. ``CircuitStateFn`` est représenté par un circuit et désigne l'état obtenu en exécutant le circuit sur l'état ouù touls les qubits sont initialement à zéro dans la base de caclul. ``OperatorStateFn`` représente des états mixtes à l'aide d'une matrice de densité. (Comme nous le verrons plus loin, ``OperatorStateFn`` est également utilisé pour représenter des observables.)
ja_jp: 量子状態は ``StateFn`` クラスのサブクラスとして表されます。量子状態には4つの表現があります： ``DictStateFn`` は、``dict`` が背後にある計算基底での疎な表現です。 ``VectorStateFn`` はnumpy配列が背後にある計算規定での密な表現です。``CircuitStateFn`` は回路が背後にあり、全部ゼロである計算基底状態で回路を実行した時に得られる状態を表現します。``OperatorStateFn`` は密度行列に対する混合状態を表現します。(後述するように、``OperatorStateFn`` は観測量を表現するためにも使用されます。)
ko_kr: 양자 상태는 ``StateFn`` 클래스의 하위 클래스로 표현될 수 있다. 양자 상태를 표현하는 4개의 하위 클래스는 다음과 같다: ``DictStateFn`` 은 ``dict`` 를 기반으로 한 계산 기저의 희소 표현이다. ``VectorStateFn`` 은 NumPy array를 기반으로 한 계산 기저의 밀집 표현이다. ``CircuitStateFn`` 은 회로를 기반으로, 계산 기저가 전부 0인 상태를 회로에 수행시켜 얻은 상태를 나타낸다. ``OperatorStateFn`` 은 밀도 행렬로 표현한 섞인 상태를 나타낸다. (나중에 확인하겠지만, ``OperatorStateFn`` 은 관측량을 나타낼 때도 사용된다.)
pt_un: Os estados quânticos são representados por subclasses da classe ``StateFn``. Existem quatro representações de estados quânticos: ``DictStateFn`` é uma representação esparsa na base computacional, apoiada por um ``dict``. ``VectorStateFn`` é uma representação densa na base computacional apoiada por um array numpy. ``CircuitStateFn`` é apoiado por um circuito e representa o estado obtido executando o circuito sobre o estado de base computacional all-zero. ``OperatorStateFn`` representa estados mistos através de uma matriz de densidade. (Como veremos mais adiante, ``OperatorStateFn`` também é usado para representar observáveis.)
ta: குவாண்டம் நிலைகள் ``StateFn`` வகுப்பின் துணைப்பிரிவுகளால் குறிப்பிடப்படுகின்றன. குவாண்டம் நிலைகளின் நான்கு பிரதிநிதித்துவங்கள் உள்ளன: ``DicStateFn`` என்பது கணக்கீட்டு அடிப்படையில் ஒரு சிதறிய பிரதிநிதித்துவமாகும், இது ``dict`` ஆல் ஆதரிக்கப்படுகிறது. ``VectorStateFn`` என்பது கணக்கீட்டு அடிப்படையில் அடர்த்தியான பிரதிநிதித்துவமாகும். ``CircuitStateFn`` ஒரு சர்க்யூட் மூலம் ஆதரிக்கப்படுகிறது மற்றும் அனைத்து பூஜ்ஜிய கணக்கீட்டு அடிப்படையிலான நிலையில் சர்க்யூட்டை இயக்குவதன் மூலம் பெறப்பட்ட நிலையை குறிக்கிறது. ``OperatorStateFn`` என்பது டென்சிட்டி மேட்ரிக்ஸ் வழியாக கலப்பு நிலைகளைக் குறிக்கிறது. (பின்னர் பார்ப்போம், அவதானிப்புகளைக் குறிக்க ``OperatorStateFn`` பயன்படுத்தப்படுகிறது.)
tr: Kuantum durumları ``StateFn`` sınıfın alt sınıflarıyla temsil ediliyor. Kuantum durumların dört temsili var: ``DictStateFn`` bir ``dict`` ile desteklenen, hesaplama temelinde seyrek bir temsildir. ``VectorStateFn`` numpy'in bir dizi tarafından desteklenen hesaplama temelinde yoğun bir temsildir. ``CircuitStateFn`` bir devre tarafından desteklenir ve devrenin tamamen sıfır hesaplama tabanlı durumda yürütülmesiyle elde edilen durumu temsil eder. ``OperatorStateFn`` yoğun matris aracıyla karışık durumları temsil eder. (İlerde göreceğimiz üzere ``OperatorStateFn`` gözlemlenebilirleri de temsil edebilir.)

source: Several ``StateFn`` instances are provided for convenience. For example ``Zero, One, Plus, Minus``.
bn_bn: পাঠক সুবিধার্থে কিছু ``StateFn`` উদাহরণ দেয়া হল। যেমন ``শুন্য, এক, যোগবোধক/ ধনাত্মক, বিপরীতবোধক/ ঋণাত্মক``।.
es_mx: Se proporcionan varias instancias de ``StateFn``. Por ejemplo ``Cero, One, Plus, Minus``.
es_un: Se proporcionan varias instancias de ``StateFn`` para mayor comodidad. Por ejemplo ``Zero, One, Plus, Minus``.
fr: Plusieurs instances ``StateFn`` sont fournies pour des raisons de commodité. Par exemple, ``Zero, One, Plus, Minus``.
ja_jp: 便宜上、いくつかの``StateFn`` インスタンスが用意されています。例えば、``Zero, One, Plus, Minus`` です。
ko_kr: 몇 개의 ``StateFn`` 인스턴스가 편의를 위해 제공된다. 예를 들어, ``Zero, One, Plus, Minus`` 이다.
pt_un: Várias instâncias ``StateFn`` são fornecidas por conveniência. Por exemplo ``Zero, One, Plus, Minus``.
ta: பல ``StateFn`` நிகழ்வுகள் வசதிக்காக வழங்கப்படுகின்றன. உதாரணத்திற்கு ``Zero, One, Plus, Minus``.
tr: Kolaylık için birkaç ``StateFn`` örnekleri sağlanacak. Örneğin ``Zero, One, Plus, Minus``.

source: ``Zero`` and ``One`` represent the quantum states :math:`|0\rangle` and :math:`|1\rangle`. They are represented via ``DictStateFn``.
bn_bn: :math:`|0\rangle` দ্বারা কোয়ান্টাম দশা ``শুন্য`` এবং :math:`|1\rangle` দ্বারা কোয়ান্টাম দশা ``এক`` দ্বারা প্রকাশ করা হয়। এই প্রকাশভঙ্গী ``DictStateFn`` উপশ্রেণী অন্তর্ভুক্ত।.
es_mx: ``Zero`` y ``One`` representan los estados cuánticos :math:`|0\rangle` and :math:`|1\rangle`. Están representados a través de ``DictStateFn``.
es_un: ``Zero`` y ``One`` representan los estados cuánticos :math:`|0\rangle` y :math:`|1\rangle`. Están representados a través de ``DictStateFn``.
fr: ``Zéro`` et ``One`` représentent les états quantiques :math:`| 0\rangle` et :math:`| 1\rangle`. Ils sont représentés par ``DictStateFn``.
ja_jp: ``Zero`` と ``One`` は量子状態 :math:`|0\rangle` と :math:`|1\rangle` を表します。これらは ``DictStateFn`` で表されます。
ko_kr: ``Zero`` 와 ``One`` 은 각각 양자 상태 :math:`|0\rangle` 와 :math:`|1\rangle` 을 의미한다. 이들을 ``DictStateFn`` 을 통해 표현된다.
pt_un: ``Zero`` e ``One`` representam os estados quânticos :math:`|0\rangle` e :math:`|1\rangle`. Eles são representados via ``DictStateFn``.
ta: ``Zero`` மற்றும் ``One`` குவாண்டம் நிலைகளைக் குறிக்கும் :math:`|0\rangle` மற்றும் :math:`|1\rangle`. அவை ``DictStateFn`` வழியாக குறிப்பிடப்படுகின்றன.
tr: ``Zero`` ve ``One`` :math:`|0\rangle` ile :math:`|1\rangle` kuantum durumlarını temsil ediyor. ``DictStateFn`` yoluyla temsil edilirler.

source: ``Plus`` and ``Minus``, representing states :math:`(|0\rangle + |1\rangle)/\sqrt{2}` and :math:`(|0\rangle - |1\rangle)/\sqrt{2}` are represented via circuits. ``H`` is a synonym for ``Plus``.
bn_bn: :math:`(|0\rangle + |1\rangle)/\sqrt{2}` দ্বারা ``যোগবোধক/ ধনাত্মক`` দশা এবং :math:`(|0\rangle - |1\rangle)/\sqrt{2}` দ্বারা ``বিপরীতবোধক/ ঋণাত্মক`` দশা প্রকাশ করা হয়। এইক্ষেত্রে ``H`` ``যোগবোধক/ ধনাত্মক`` এর সমতুল্য।.
es_mx: ``Plus`` y ``Minus``, representan los estados :math:`(|0\rangle + |1\rangle)/\sqrt{2}` and :math:`(|0\rangle - |1\rangle)/\sqrt{2}` son representados a través de circuitos. ``H`` es un sinónimo para ``Plus``.
es_un: ``Plus`` y ``Minus``, representan los estados :math:`(|0\rangle + |1\rangle)/\sqrt{2}` y :math:`(|0\rangle - |1\rangle)/\sqrt{2}`, son representados a través de circuitos. ``H`` es un sinónimo para ``Plus``.
fr: ``Plus`` et ``Minus``, représentant les états :math:`(|0\rangle + |1\rangle)/\sqrt{2}` et :math:`(|0\rangle-|1\rangle)/\sqrt{2}` sont représentés par des circuits. ``H`` est un synonyme de ``Plus``.
ja_jp: ``Plus`` と ``Minus`` は、状態 :math:`(|0\rangle + |1\rangle)/\sqrt{2}` と :math:`(|0\rangle - |1\rangle)/\sqrt{2}` であり、回路を介して表されます。 ``H`` は ``Plus`` と同義です。
ko_kr: :math:`(|0\rangle + |1\rangle)/\sqrt{2}` 와 :math:`(|0\rangle - |1\rangle)/\sqrt{2}` 상태를 표현하는 ``Plus`` 와 ``Minus`` 가 회로를 통해 표현되었다. ``H`` 는 ``Plus`` 를 나타내는 동의어이다.
pt_un: ``Plus`` e ``Minus``, representando estados :math:`(|0\rangle + |1\rangle)/\sqrt{2}` e :math:`(|0\rangle - |1\rangle)/\sqrt{2}` são representados via circuitos. ``H`` é um sinônimo de ``Plus``.
ta: ``Plus`` மற்றும் ``Minus``, நிலைகளை குறிக்கும் :math:`(|0\rangle + |1\rangle)/\sqrt{2}` மற்றும் :math:`(|0\rangle - |1\rangle)/\sqrt{2}` சர்க்யூட்கள் வழியாக குறிப்பிடப்படுகின்றன. ``H`` என்பது ``Plus`` என்பதற்கு ஒரு பொருளாகும்.
tr: ``Plus`` ve ``Minus``, :math:`(|0\rangle + |1\rangle)/\sqrt{2}` ve :math:`(|0\rangle - |1\rangle)/\sqrt{2}` temsil ederek devrelerin tarafından temsil edilir. ``H``, ``Plus`` bir eş anlamlısıdır.

source: Indexing into quantum states is done with the ``eval`` method. These examples return the coefficients of the ``0`` and ``1`` basis states. (Below, we will see that the ``eval`` method is used for other computations, as well.)
bn_bn: কোয়ান্টাম দশার সংখ্যাক্রম (ইনডেক্সিং) ``eval`` পদ্ধতিতে নির্ণয় করা হয়। এই উদাহরণগুলো ``0`` এবং ``1`` বেসিস স্টেটের সহগ নির্ণয় পদ্ধতি বর্ণনা করে। (আমরা ``eval`` পদ্ধতিতে আরও গাণিতিক প্রক্রিয়া সম্পাদন পদ্ধতি বর্ণনা করব)।
es_mx: La indexación de estados cuánticos se realiza con el método ``eval``. Estos ejemplos devuelven los coeficientes de los estados base ``0`` y ``1``. (Abajo, podemos ver que el método ``eval`` también se utiliza para realizar otros cálculos.)
es_un: La indexación en estados cuánticos se realiza con el método ``eval``. Estos ejemplos devuelven los coeficientes de los estados base ``0`` y ``1``. (Abajo, podemos ver que el método ``eval`` también se utiliza para realizar otros cálculos.)
fr: L'indexation dans les états quantiques se fait avec la méthode ``eval``. Ces exemples renvoient les coefficients des états de base ``0`` et ``1``. (Ci-dessous, nous verrons que la méthode ``eval`` est aussi utilisée pour d'autres calculs.)
ja_jp: 量子状態のインデックス作成は ``eval`` メソッドで行われます。これらの例は ``0`` と ``1`` 基底状態の係数を返します。(以降、 ``eval`` メソッドが他の計算でも使用されることを示します。)
ko_kr: 양자 상태들의 인덱싱은 ``eval`` 메서드로 수행할 수 있다. 아래의 코드는 ``0`` 과 ``1`` 의 기저 상태의 계수를 반환하는 예제이다. (아래에서 ``eval`` 메서드가 다른 계산에 이용되는 것도 확인할 것이다.)
pt_un: Indexar em estados quânticos é feito com o método ``eval``. Estes exemplos retornam os coeficientes dos estados base ``0`` e ``1``. (Abaixo, veremos que o método ``eval`` é usado também para outras computações.)
ta: குவாண்டம் நிலைகளுக்குள் இடைவெளி ``eval`` முறையுடன் செய்யப்படுகிறது. இந்த உதாரணங்கள் ``0`` மற்றும் ``1`` அடிப்படை நிலைகளின் கோட்பாடு திரும்பும். (கீழே, நாம் அதைப் பார்ப்போம் ``eval`` முறை மற்ற கணக்கீடுகளுக்கும் பயன்படுத்தப்படுகிறது.)
tr: Kuantum durumlarını endekslenmeleri ``eval`` yöntemi ile yapılıyor. Bu örnekler ``0`` ve ``1`` temel durumlarının katsayılarını geri döndürüyor. (Aşağıda, ``eval`` yöntemi başka hesaplamalarında da kullanıldığını göreceğiz.)

source: The dual vector of a quantum state, that is the *bra* corresponding to a *ket* is obtained via the ``adjoint`` method. The ``StateFn`` carries a flag ``is_measurement``, which is ``False`` if the object is a ket and ``True`` if it is a bra.
bn_bn: ``adjoint`` পদ্ধতি দ্বারা কোয়ান্টাম দশা দ্বৈত দিকরাশি ভিত্তিক ম্যাট্রিক্স যেমন *bra* কে *ket* ম্যাট্রিক্সে পরিণত করা যাবে। ``StateFn`` ``is_measurement`` নামে একটি সংকেত প্রদান করে, যা ``False`` হলে কেট ম্যাট্রিক্স নির্দেশ করে এবং ``True`` হলে ব্রা ম্যাট্রিক্স নির্দেশ করে।.
es_mx: El vector dual de un estado cuántico, que es la *bra* correspondiente de un *ket* se obtiene mediante el método ``adjoint``. ``StateFn`` lleva una bandera ``is_measurement``, que es ``False`` si el objeto es un ket y ``True`` si es una bra.
es_un: El vector dual de un estado cuántico, que es el *bra* correspondiente de un *ket* se obtiene mediante el método ``adjoint``. El ``StateFn`` lleva una bandera ``is_measurement``, que es ``False`` si el objeto es un ket y ``True`` si es un bra.
fr: Le vecteur dual d'un état quantique, c'est-à-dire le *bra* correspondant à un *ket* est obtenu via la méthode ``adjoint``. ``StateFn`` porte un drapeau ``is_measurement``, qui est à ``Flase`` si l'objet est un ket et ``True`` s'il s'agit d'un bra.
ja_jp: 量子状態の双対ベクトル( *ket* に対応する *bra* ) は、``adjoint`` メソッドによって得られます。 ``StateFn`` は ``is_measurement`` フラグを持ちます。オブジェクトが ket の場合は ``False`` で、ブラの場合は ``True`` です。
ko_kr: 양자 상태의 쌍대 벡터 (dual vector), 즉 주어진 *ket* 에 해당하는 *bra* 는 ``adjoint`` 메서드를 통해 얻어진다. ``StateFn`` 은 ``is_measurement`` 라는 플래그를 가지고 있는데, 이것은 해당 객체가 ket이면 ``False`` 이고 bra 이면 ``True`` 상태가 된다.
pt_un: O vetor duplo de um estado quântico, que é o *bra* correspondente a um *ket* é obtido através do método ``adjoint``. O ``StateFn`` transporta uma medição ``is_measurement`` que é ``False`` se o objeto é um ket e ``True`` se é um bra.
ta: ஒரு குவாண்டம் நிலையில் இரட்டை திசையன், அதாவது *ket* உடன் தொடர்புடைய *bra* என்பது ``adjoint`` முறை மூலம் பெறப்படுகிறது. ``StateFn`` ஒரு flag ``is_measurement`` கொண்டு செல்கிறது, இது ஆப்ஜெக்ட் ஒரு ket ஆக இருந்தால் ``False`` மற்றும் அது bra வாக இருந்தால் ``True``.
tr: Bir kuantum durumunun ikili vektörü, bu da bir *ket*e ait olan bir *bra*, ``adjoint`` yöntemiyle elde edilebilir. ``StateFn`` bir ``is_measurement`` bayrak taşıyor ki eğer nesne bir ket olsa ``False``, bir bra olsa ``True`` gösterir.

source: Here, we construct :math:`\langle 1 |`.
bn_bn: এখন আমরা :math:`\langle 1 |` তৈরি করব।.
es_mx: Aquí, construimos :math:` \langle 1 | `.
es_un: Aquí, construimos :math:`\langle 1 |`.
fr: Ici, nous construisons :math:`\langle 1 |`.
ja_jp: ここでは :math:`\langle 1 |` を作成します。
ko_kr: 여기서 :math:`\langle 1 |` 을 구성한다.
pt_un: Aqui, nós construímos :math:`\langle 1 |`.
ta: இங்கே, நாங்கள் கட்டமைக்கிறோம் :math:`\langle 1 |`.
tr: Burada, :math:`\langle 1 |`. oluşturuyoruz.

source: For convenience, one may obtain the dual vector with a tilde, like this
bn_bn: প্রকাশ সুবিধার্থে, দ্বৈত দিকরাশি ম্যাট্রিক্স কে তীর (টিল্ড) চিহ্ন দ্বারা সংকেতায়িত করা যাবে
es_mx: Por comodidad, se puede obtener el vector dual con una tilde, de la siguiente manera
es_un: Por comodidad, se puede obtener el vector dual con una tilde, de la siguiente manera
fr: Pour des raisons de commodité, on peut obtenir le vecteur dual avec un tilde, comme celui-ci
ja_jp: 便宜上、以下のように、チルダを使用して双対ベクトルを得ることができます。
ko_kr: 편의상, 이와 같이 틸데(tilde)를 이용하여 쌍대 벡터를 얻을 수 있다.
pt_un: Por conveniência, pode-se obter o duplo vetor com um til, da seguinte forma
ta: வசதிக்காக, ஒருவர் இரட்டை திசையனை ஒரு tilde உடன் பெறலாம், இது போல
tr: Kolaylık olsun için, aşağıda gösterildiği gibi ikili vektörünü elde edebilir

source: Algebraic operations and predicates
bn_bn: বীজগাণিতিক কার্যকারক এবং প্রেডিকেটস
es_mx: Operaciones algebraicas y predicados
es_un: Operaciones algebraicas y predicados
fr: Opérations et prédicats algébriques
ja_jp: 代数演算と述語
ko_kr: 대수적 연산자들과 술어
pt_un: Operações algébricas e predicados
ta: இயற்கணித செயல்பாடுகள் மற்றும் கணிப்புகள்
tr: Cebirsel hesaplamaları ve tahminler

source: Many algebraic operations and predicates between ``StateFn``\ s are supported, including:
es_un: Se admiten muchas operaciones algebraicas y predicados entre ``StateFn``\ s, que incluyen:
fr: De nombreuses opérations algébriques et prédicats entre les ``StateFn``\ s sont pris en charge, notamment :
ja_jp: 以下を含む、 ``StateFns`` 間の多くの代数演算と述語がサポートされています。
pt_un: Muitas operações algébricas e predicados entre ``StateFn``\ s são suportados, incluindo:
ta: பல இயற்கணித செயல்பாடுகள் மற்றும் ``StateFn``\ களுக்கு இடையே உள்ள கணிப்புகள் துணைபுரிகின்றன, இதில் அடங்கும்:
tr: ``StateFn``\ ler arasındaki birçok cebirsel işlem ve karşılaştırma desteklenmektedir, bunlara şunlar dahildir:

source: ``+`` - addition
es_un: ``+`` - adición
ja_jp: ``+`` - 加算
pt_un: ``+`` - adição
ta: ``+`` - கூட்டல்
tr: ``+`` - toplama

source: ``-`` - subtraction, negation (scalar multiplication by -1)
es_un: ``-`` - resta, negación (multiplicación escalar por -1)
fr: ``-`` - soutraction, négation (multiplication scalaire par -1)
ja_jp: ``-`` - 減算、否定（-1によるスカラー乗算）
pt_un: ``-`` - subtração, negação (multiplicação escalar por -1)
ta: ``-`` - கழித்தல், மறுப்பு (ஸ்கேலார் பெருக்கல் -1)
tr: ``-`` - çıkarma, negatif yapma (-1 ile skaler çarpım)

source: ``*`` - scalar multiplication
es_un: ``*`` - multiplicación escalar
fr: ``*``-multiplication scalaire
ja_jp: ``*`` - スカラー乗法
pt_un: ``*`` - multiplicação escalar
ta: ``*`` - அளவிடல் பெருக்கல்
tr: ``*`` - skaler çarpma

source: ``/`` - scalar division
es_un: ``/`` - división escalar
fr: ``/`` division scalaire
ja_jp: ``/`` - スカラー除算
pt_un: ``/`` - divisão escalar
ta: ``/`` - அளவிடல் வகுத்தல்
tr: ``/`` - skaler bölme

source: ``@`` - composition
es_un: ``@`` - composición
ja_jp: ``@`` - 合成
pt_un: ``@`` - composição
ta: ``@`` - தொகுத்தல்
tr: ``@`` - bileşim

source: ``^`` - tensor product or tensor power (tensor with self n times)
es_un: ``^`` - producto tensorial o potencia tensorial (producto tensorial consigo mismo n veces)
fr: ` ` ^ ``-produit tensoriel ou tenseur (tenseur n fois avec soi-même)
ja_jp: ``^`` - テンソル積またはテンソルべき乗（自己n回のテンソル）
pt_un: ``^`` - produto tensorial ou potência tensorial (tensor com si mesmo n vezes)
ta: ``^`` - டென்சர் தயாரிப்பு அல்லது டென்சர் பவர் (செல்ஃப் n முறைகளுடன் கூடிய டென்சர்)
tr: ``^`` - tensör çarpımı veya tensör kuvveti (n kez kendisiyle tensör)

source: ``**`` - composition power (compose with self n times)
es_un: ``**`` - potencia de composición (componer consigo mismo n veces)
fr: ``**`` - puissance de composition (composition n fois de soi-même)
ja_jp: ``**`` - 合成べき乗（自己でn回合成）
pt_un: ``**`` - potência de composição (composição com si mesmo n vezes)
ta: ``**`` - தொகுத்தல் சக்தி (தன்னுடன் n முறை எழுதவும்)
tr: ``**`` - bileşim kuvveti (kendisiyle n kez birleştirme)

source: ``==`` - equality
es_un: ``==`` - igualdad
fr: ``==`` - égalité
ja_jp: ``==`` - 等式
pt_un: ``==`` - igualdade
ta: ``==`` - சமநிலை
tr: ``==`` - eşitlik

source: ``~`` - adjoint, alternating between a State Function and Measurement
es_un: ``~`` - adjunto, alternando entre una Función de Estado y Medición
fr: ``~`` - adjoint, alternant entre une Fonction d'Etat et une Mesure
ja_jp: ``~`` - 随伴、状態関数と測定を交互に繰り返す
pt_un: ``~`` - adjunto, alternando entre uma função de estado e medição
ta: ``~`` - ஒரு நிலை செயல்பாடு மற்றும் அளவீட்டுக்கு இடையில் மாறி

source: Be very aware that these operators obey the `Python rules for operator precedence <https://docs.python.org/3/reference/expressions.html#operator-precedence>`__, which might not be what you expect mathematically. For example, ``I^X + X^I`` will actually be parsed as ``I ^ (X + X) ^ I == 2 * (I^X^I)`` because Python evaluates ``+`` before ``^``. In these cases, you can use the methods (``.tensor()``, etc) or parentheses.
es_un: Ten en cuenta que estos operadores obedecen las `reglas de Python de precedencia de operadores <https://docs.python.org/3/reference/expressions.html#operator-precedence>`__, que puede que no sea lo que esperas matemáticamente. Por ejemplo, ``I^X + X^I`` en realidad se analizará como ``I ^ (X + X) ^ I == 2 * (I^X^I)`` porque Python evalúa ``+`` antes de ``^``. En estos casos, puedes utilizar los métodos (``.tensor()``, etc) o paréntesis.
fr: Sachez que ces opérateurs obéissent aux `règles Python pour la priorité de l'opérateur <https://docs.python.org/3/reference/expressions.html#operator-precedence>`__, ce qui pourrait ne pas être ce que vous attendez mathématiquement. Par exemple, ``I^X + X^I`` sera en fait analysé comme ``I ^ (X + X) ^ I == 2 * (I^X^I)`` parce que Python évalue ``+`` avant ``^``. Dans ces cas, vous pouvez utiliser les méthodes (``.tensor()``, etc) ou les parenthèses.
ja_jp: これらの演算子は、 `演算子の優先順位に関するPythonの規則 <https://docs.python.org/3/reference/expressions.html#operator-precedence>`__ に従うことに十分注意してください。これは、数学的に期待するものではない可能性があります。 たとえば、Pythonは ``^`` の前に ``+`` を評価するため、 ``I^X + X^I`` は実際には ``I ^ (X + X) ^ I == 2 * (I^X^I)`` として解析されます。 このような場合は、メソッド（ ``.tensor()`` など）または括弧を使用できます。
pt_un: Esteja bastante ciente de que esses operadores obedecem às `regras do Python para precedência de operador <https://docs.python.org/3/reference/expressions.html#operator-precedence>`__, o que pode não ser aquilo que você espera matematicamente. Por exemplo, ``I^X + X^I`` será realmente analisado como ``I ^ (X + X) ^ I == 2 * (I^X^I)`` porque o Python avalia ``+`` antes de ``^``. Nestes casos, você pode usar os métodos (``.tensor()``, etc) ou parênteses.
ta: இந்த ஆபரேட்டர்கள் `ஆபரேட்டர் முன்னுரிமைக்கான பைதான் விதிகளுக்குக் கீழ்ப்படிகிறார்கள் என்பதை கவனத்தில் கொள்ளவும் <https://docs.python.org/3/reference/expressions.html#operator-precedence>`__, இது நீங்கள் கணித ரீதியாக எதிர்பார்க்கவில்லை. எடுத்துக்காட்டாக, ``I^X + X^I`` உண்மையில் ``I ^ (X + X) ^ I == 2 * (I^X^I)`` என அலசப்படும், ஏனெனில் பைதான் ``+`` ஐ மதிப்பிடுகிறது. ``^`` க்கு முன். இந்த சந்தர்ப்பங்களில், நீங்கள் முறைகள் (``.tensor()``, etc) அல்லது அடைப்புக்குறிகளைப் பயன்படுத்தலாம்.
tr: Bu operatörlerin, matematiksel olarak beklediğiniz gibi olmayabilir, `Operatör önceliği için Python kuralları <https://docs.python.org/3/reference/expressions.html#operator-precedence>`__'na uyduğuna dikkat edin. Örneğin, ``I^X + X^I`` aslında ``I ^ (X + X) ^ I == 2 * (I^X^I)`` olarak ayrıştırılacaktır çünkü Python ``+`` değerini ``^``den önce değerlendirir. Bu durumlarda, metodları (``.tensor()``, vb.) veya parantezleri kullanabilirsiniz.

source: ``StateFn``\ s carry a coefficient. This allows us to multiply states by a scalar, and so to construct sums.
es_un: ``StateFn`` lleva un coeficiente. Esto nos permite multiplicar estados por un escalar, y de esta forma la posibilidad de construir sumas.
fr: Les ``StateFn``\ s portent un coefficient. Cela nous permet de multiplier les états par un scalaire, et donc de construire des sommes.
ja_jp: ``StateFn`` は係数を持ちます。 これにより、状態にスカラーを掛けて、合計を作成できます。
pt_un: ``StateFn``\ s carregam um coeficiente. Isso nos permite multiplicar estados por um escalar e, assim, construir somas.
ta: ``StateFn``\ கள் ஒரு குணகத்தைக் கொண்டு செல்கின்றன. இது நிலைகளை ஒரு அளவுகோலால் பெருக்க அனுமதிக்கிறது, மேலும் தொகைகளை உருவாக்குகிறது.
tr: ``StateFn``\ ler bir katsayı taşımaktadır. Bu da bize bir skaler ile durumları çarpmamıza, ve böylece toplamları oluşturmamıza izin verir.

source: Here, we construct :math:`(2 + 3i)|0\rangle`.
bn_bn: এইখানে আমরা :math:`(2 + 3i)|0\rangle` এই দশাটি প্রস্তুত করব।.
es_mx: Aquí construimos :math:`(2 + 3i)|0\rangle`.
es_un: Aquí construimos :math:`(2 + 3i)|0\rangle`.
fr: Ici, nous construisons :math:`(2 + 3i)|0\rangle`.
ja_jp: ここでは、:math:`(2 + 3i)|0\rangle` を構成します。
ko_kr: 여기서는 :math:`(2 + 3i)|0\rangle` 을 구성한다.
pt_un: Aqui, construímos :math:`(2 + 3i)|0\rangle`.
ta: இங்கே, நாங்கள் :math:`(2 + 3i)|0\rangle` கட்டமைக்கிறோம்.
tr: Burada, :math:`(2 + 3i)|0\rangle` oluşturuyoruz.
