Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/operators/01_operator_flow.po
Languages: bn_bn, es_mx, es_un, fr, ja_jp, ko_kr, pt_un, ta, tr

source: Note that converters act recursively, that is, they traverse an expression applying their action only where possible. So we can just convert our full evolution and measurement expression. We could have equivalently composed the converted ``h2_measurement`` with our evolution ``CircuitStateFn``. We proceed by applying the conversion on the entire expression.
bn_bn: টীকা যে রূপান্তরকারীরা পুনরাবৃতভাবে কাজ করে, অর্থাৎ, তারা শুধুমাত্র সম্ভব যেখানে সেইখানেই তাদের কর্ম প্রয়োগ করে একটি অভিব্যক্তিকে অতিক্রম করে। তাই আমরা শুধু আমাদের সম্পূর্ণ বিবর্তনকে এবং পরিমাপ অভিব্যক্তিকে রূপান্তর করতে পারি। আমরা সমানভাবে রূপান্তরিত 'h2_measurement " কে আমাদের বিবর্তনের ``CircuitStateFn`` সাথে সুবিন্যস্ত করতে পারতাম। আমরা সমগ্র অভিব্যক্তিটির উপর রূপান্তর প্রয়োগ করে এগিয়ে যেতে পারি।
es_un: Ten en cuenta que los conversores actúan recursivamente, es decir, atraviesan una expresión aplicando su acción sólo cuando sea posible. Así que sólo podemos convertir nuestra evolución y expresión de medición. Podríamos equivalentemente haber compuesto el ``h2_measurement`` convertido con nuestra evolución ``CircuitStateFn``. Procedemos aplicando la conversión en toda la expresión.
fr: Notez que les convertisseurs agissent récursivement, c'est-à-dire qu'ils traversent une expression en appliquant leur action uniquement lorsque cela est possible. Nous pouvons donc simplement convertir notre évolution complète et notre expression de mesure. Nous pourrions avoir également composé le ``h2_measurement`` converti avec notre évolution ``CircuitStateFn``. Nous procéderons en appliquant la conversion sur toute l'expression.
ja_jp: コンバーターは再帰的に動作することに注意してください。つまり、可能な限りアクションを適用する式にトラバースします。 時間発展と測定の完全な表現を変換することができます。 変換された ``h2_measurement`` を 時間発展 ``CircuitStateFn`` と同等に構成することができます。式全体を変換して進めます。
ko_kr: 변환기는 재귀적으로 동작하는데, 그 말은, 표현을 오가면서 오직 동작 가능한 경우에만 적용한다는 말이다. 그러므로 전체 시간 변화(full evolution)와 식 측정을 바로 변환할 수 있다. 변환된 ``h2_measurement`` 는 시간 변화 ``CircuitStateFn`` 으로 동등하게 구성될 수 있다. 이는 전체 표현에 변환을 적용하여 진행된다.
pt_un: Observe que os conversores agem recursivamente, ou seja, eles percorrem uma expressão aplicando sua ação apenas quando possível. Assim, podemos apenas converter a nossa expressão de evolução completa e a expressão de medição. Nós poderíamos ter composto de forma equivalente ``h2_measurement`` com nossa evolução ``CircuitStateFn``. Procedemos aplicando a conversão na expressão toda.
ta: மாற்றிகள் மீண்டும் மீண்டும் செயல்படுகின்றன என்பதை நினைவில் கொள்க, அதாவது, அவை முடிந்தவரை மட்டுமே தங்கள் செயலைப் பயன்படுத்தும் ஒரு வெளிப்பாட்டைக் கடந்து செல்கின்றன. எனவே நமது முழு பரிணாமத்தையும் அளவீட்டு வெளிப்பாட்டையும் மாற்றலாம். மாற்றப்பட்ட ``h2_measurement`` ஐ நமது பரிணாம வளர்ச்சியுடன் ``CircuitStateFn`` உடன் சமமாக இயற்றியிருக்கலாம். முழு வெளிப்பாட்டிலும் மாற்றத்தைப் பயன்படுத்துவதன் மூலம் நாங்கள் தொடர்கிறோம்.
tr: Dönüştürücülerin özyineleme olarak çalıştığını fark et, bu da, onlar bir ifadeyi onun eylemini alıp sadece mümkün olduğu yerlerde uygulayarak geçirir. Böylece bizim tam evrim ve ölçüm ifademizi dönüştürebiliriz. Dönüştürülmüş ``h2_measurement`` yi evrimimiz ``CircuitStateFn`` ile eşdeğer olarak oluşturabilirdik. Biz ifadenin tamamına bu dönüşümü uygulamaya geçeriz.

source: Now we bind multiple parameter values into a ``ListOp``, followed by ``eval`` to evaluate the entire expression. We could have used ``eval`` earlier if we bound earlier, but it would not be efficient. Here, ``eval`` will convert our ``CircuitStateFn``\ s to ``VectorStateFn``\ s through simulation internally.
bn_bn: এখন আমরা একাধিক পরামিতি মানকে একটি ``ListOp``তে আবদ্ধ করি,``eval``দ্বারা অনুসারিত সম্পূর্ণ অভিব্যাক্তিটি মূল্যায়ন করার জন্য। যদি আমরা আবদ্ধ করার জন্য ``eval``কে শীঘ্র ব্যবহার পারতাম, কিন্তু তা ও সাশ্রয়ী হতো না।এখানে,``eval``আমাদের``CircuitStateFn``\গুলিকে ``VectorStateFn``\গুলিতে পরিবর্তিত করে আভ্যন্তরীণভাবে সিমুলেশনের মাধ্যমে।
es_un: Ahora vinculamos múltiples valores de parámetro en un ``ListOp``, seguido por ``eval`` para evaluar toda la expresión. Podríamos haber usado ``eval`` antes si hubiéramos vinculado previamente, pero no sería eficiente. Aquí, ``eval`` convertirá nuestro ``CircuitStateFn``\ s a ``VectorStateFn``\ s a través de la simulación internamente.
fr: Maintenant nous associons plusieurs valeurs de paramètres dans un ``ListOp``, suivi par ``eval`` pour évaluer l'expression entière. Nous aurions pu utiliser ``eval`` plus tôt si nous lions plus tôt, mais cela ne serait pas efficace. Ici, ``eval`` convertira nos ``CircuitStateFn``\ s en ``VectorStateFn``\ s à travers la simulation interne.
ja_jp: 次に、複数のパラメータ値を ``ListOp`` にバインドし、式全体を評価するために ``eval`` を追加します。 先にバインドすれば ``eval`` を使えたかもしれませんが、効率的ではありません。 ここで、``eval`` は内部シミュレーションを通じて ``CircuitStateFn`` を ``VectorStateFn`` に変換します。
ko_kr: 이제 여러 매개변수를 ``ListOp`` 로 바인드 하고, 이어서 전체 표현을 ``eval`` 로 구한다. 바인딩이 먼저 되었다면 ``eval`` 을 먼저 사용할 수도 있지만, 별로 효과적이진 않다. 여기서는 내부 시뮬레이션을 통해 ``eval`` 이 ``CircuitStateFn``\ 들을 ``VectorStateFn``\ 들로 변환한다.
pt_un: Agora vamos vincular vários valores de parâmetros em uma ``ListOp``, seguida de ``eval`` para avaliar a expressão inteira. Poderíamos ter usado ``eval`` anteriormente se nós vinculássemos mais cedo, mas não seria eficiente. Aqui, ``eval`` irá converter nosso ``CircuitStateFn``\ s para ``VectorStateFn``\ s internamente através de simulação.
ta: இப்போது பல அளவுரு மதிப்புகளை ``ListOp`` ஆக பிணைக்கிறோம், அதன்பிறகு முழு வெளிப்பாட்டை மதிப்பீடு செய்ய ``eval``. நாம் முன்பே கட்டுப்பட்டிருந்தால் ``eval`` ஐ முன்னர் பயன்படுத்தியிருக்கலாம், ஆனால் அது திறமையாக இருக்காது. இங்கே, ``eval`` எங்கள் ``CircuitStateFn`` களை உள்நாட்டில் உருவகப்படுத்துதல் மூலம் ``VectorStateFn`` களாக மாற்றும்.
tr: Şimdi biz, birden fazla parametre değerini bir ``ListOp`` içine bağlarız ve ardından tüm ifadeyi değerlendirmek için ``eval``ile devam ederiz. Eğer biz önce bağlasaydık ``eval`` ı kullanabilirdik ama verimli olmazdı. Burada ``eval`` bizim ``CircuitStateFn``\ 'lerimizi iç bir simülasyondan geçirerek ``VectorStateFn``\ 'lere dönüştürecektir.

source: Here are the expectation values :math:`\langle \Phi_+| e^{iHt} H e^{-iHt} |\Phi_+\rangle` corresponding to the different values of the parameter.
bn_bn: এখানে গড় মানের মানগুলি হল :math:`\langle \Phi_+| e^{iHt} H e^{-iHt} |\Phi_+\rangle`পরামিতির বিভিন্ন সংশ্লিষ্ট মানগুলির সঙ্গে বজায়ে রেখে।
es_un: Estos son los valores esperados :math:`\langle \Phi_+| e^{iHt} H e^{-iHt} |\Phi_+\rangle` correspondientes a los diferentes valores del parámetro.
fr: Voici les valeurs d'espérance :math:`\langle \Phi_+| e^{iHt} H e^{-iHt} |\Phi_+\rangle` correspondant aux différentes valeurs du paramètre.
ja_jp: パラメータの異なる値に対応する :math:`\langle \Phi_+| e^{iHt} H e^{-iHt} |\Phi_+\rangle` の期待値は次のとおりです。
ko_kr: 여기 다양한 매개변수에 해당하는 기댓값들 :math:`\langle \Phi_+| e^{iHt} H e^{-iHt} |\Phi_+\rangle` 이 있다.
pt_un: Aqui estão os valores esperados :math:`\langle \Phi_+| e^{iHt} H e^{-iHt} |\Phi_+\rangle` correspondentes aos diferentes valores do parâmetro.
ta: எதிர்பார்ப்பு மதிப்புகள் இங்கே :math:`\langle \Phi_+| e^{iHt} H e^{-iHt} |\Phi_+\rangle` அளவுருவின் வெவ்வேறு மதிப்புகளுடன் தொடர்புடையது.
tr: Farklı parametrenin farklı değerlerine ait olan beklenti değerleri :math:`\langle \Phi_+| e^{iHt} H e^{-iHt} |\Phi_+\rangle` buradadır.

source: Executing ``CircuitStateFn``\ s with the ``CircuitSampler``
bn_bn: `সম্পাদন ``CircuitStateFn``\ s with the ``CircuitSampler`` <#সম্পাদন>`__
es_un: Ejecutar ``CircuitStateFn``\ s con el ``CircuitSampler``
fr: Exécution des ``CircuitStateFn``\ s avec le ``CircuitSampler``
ja_jp: ``CircuitSampler`` を用いて ``CircuitStateFn`` を実行する
ko_kr: ``CircuitSampler`` 로 ``CircuitStateFn``\ 들을 실행하기
pt_un: Executando ``CircuitStateFn``\ s com o ``CircuitSampler``
ta: ``CircuitSampler`` உடன் ``CircuitStateFn``\ s ஐ செயல்படுத்துகிறோம்
tr: ``CircuitSampler`` i ``CircuitStateFn``\ ler ile çalıştırmak

source: The ``CircuitSampler`` traverses an Operator and converts any ``CircuitStateFn``\ s into approximations of the resulting state function by a ``DictStateFn`` or ``VectorStateFn`` using a quantum backend. Note that in order to approximate the value of the ``CircuitStateFn``, it must 1) send the state function through a depolarizing channel, which will destroy all phase information and 2) replace the sampled frequencies with **square roots** of the frequency, rather than the raw probability of sampling (which would be the equivalent of sampling the **square** of the state function, per the Born rule).
es_un: El ``CircuitSampler`` recorre un Operador y convierte cualquier ``CircuitStateFn``\ s en aproximaciones de la función de estado resultante por un ``DictStateFn`` o ``VectorStateFn`` usando un backend cuántico. Ten en cuenta que para aproximar el valor del ``CircuitStateFn``, se debe 1) enviar la función de estado a través de un canal despolarizante, que destruirá toda la información de la fase y 2) reemplazar las frecuencias muestreadas con **raíces cuadradas** de la frecuencia, en lugar de la probabilidad cruda de muestreo (que sería el equivalente a muestrear el **cuadrado** de la función de estado, por la regla de Born).
fr: Le ``CircuitSampler`` traverse un Operator et convertit n'importe quel ``CircuitStateFn``\ s en approximations de la fonction d'état qui en résulte par un ``DictStateFn`` ou un ``VectorStateFn`` en utilisant un backend quantique. Notez que pour approcher la valeur du ``CircuitStateFn``, il doit 1) envoyer la fonction d'état par un canal dépolarisant, qui détruira toutes les informations de phase et 2) remplacera les fréquences échantillonnées par des **racines carrées** de la fréquence, plutôt que la probabilité brute d'échantillonnage (qui serait l'équivalent de l'échantillonnage du **carré** de la fonction d'état, selon la règle de Born).
ja_jp: ``CircuitSampler`` はOperatorをトラバースし、``CircuitStateFns`` を量子バックエンドを使用して、``DictStateFn`` または ``VectorStateFn`` により結果の状態関数の近似に変換します。 ``CircuitStateFn`` の値を近似するには、1) 全ての位相情報を破壊するデポラライズチャネルを介して状態関数を送信、2) サンプルした周波数を、サンプリングした生の確率 ではなく、周波数の **平方根** に置き換える(Bornルールにより、状態関数の **平方** をサンプリングするのと同等です)、必要があることに注意してください。
pt_un: O ``CircuitSampler`` percorre um Operador e converte qualquer ``CircuitStateFn``\ s em aproximações da função de estado resultante por um ``DictStateFn`` ou ``VectorStateFn`` usando um backend quântico. Observe que para aproximar o valor do ``CircuitStateFn``, ele deve 1) enviar a função de estado através de um canal despolarizante, que destruirá todas as informações de fase e 2) substituir as frequências amostradas por **raízes quadradas** da frequência, em vez da probabilidade bruta de amostragem (que seria o equivalente a amostrar o **quadrado** da função de estado, de acordo com a regra de Born).
ta: ``CircuitSampler`` ஒரு ஆபரேட்டரைக் கடந்து எந்த ``CircuitStateFn``\ களை ஒரு குவாண்டம் பின்தளத்தைப் பயன்படுத்தி ``DictStateFn` அல்லது ``VectorStateFn`` மூலம் விளைந்த நிலை செயல்பாட்டின் தோராயமாக மாற்றுகிறது. ``CircuitStateFn`` இன் மதிப்பை தோராயமாக மதிப்பிடுவதற்கு, அது 1) நிலை செயல்பாட்டை நீக்கும் சேனல் மூலம் அனுப்ப வேண்டும், இது அனைத்து கட்ட தகவல்களையும் அழிக்கும் மற்றும் 2) மாதிரி அதிர்வெண்களை **சதுர வேர்கள்** மூலம் மாற்றும் மாதிரியின் மூல நிகழ்தகவை விட அதிர்வெண் (இது பார்ன் விதியின்படி, மாநில செயல்பாட்டின் **சதுர** மாதிரிக்கு சமமாக இருக்கும்).
tr: ``CircuitSampler`` bir operatörü geçirir ve herhangi bir ``CircuitStateFn``'i bir kuantum arka ucunu kullanarak ``DictStateFn`` veya ``VectorStateFn`` ile elde edilen durum fonksiyonunun yaklaşık değerlerine dönüştürür. ``CircuitStateFn``'nin yaklaşık değeri için 1) durum fonksiyonunu, tüm faz bilgilerini yok edecek bir depolarize edici kanal aracılığıyla göndermek ve 2) örneklenen frekansları, ham örnekleme olasılığı yerine (ki, bu da, Born yasasına göre durum fonksiyonunun **karesini** örneklemeye eşdeğer olacaktı) frekansın **kare kökleri** ile değiştirmek zorunda olduğuna dikkat et.

source: Note again that the circuits are replaced by dicts with **square roots** of the circuit sampling probabilities. Take a look at one sub-expression before and after the conversion:
bn_bn: টীকা আবার যে বর্তনী (সার্কিট) এর নমুনা সম্ভাবনার ** বর্গমূল **এর ডিক্স দ্বারা বর্তনী (সার্কিট) গুলির সাথে প্রতিস্থাপিত হয়। রূপান্তরের আগে এবং পরে একটি উপ-অভিব্যক্তি চেহারার দিকে নজর দিনঃ
es_un: Ten en cuenta, de nuevo; que los circuitos son reemplazados por dicts con **raíces cuadradas** de las probabilidades de muestreo del circuito. Echa un vistazo a una subexpresión antes y después de la conversión:
fr: Notez à nouveau que les circuits sont remplacés par des dicts avec **racines carrées** des probabilités d'échantillonnage du circuit. Jetez un coup d'œil à une sous-expression avant et après la conversion :
ja_jp: 回路は、回路のサンプリング確率の **平方根** のdictに置き換えられることに再度注意してください。 変換前と変換後のひとつの部分式を見てみましょう。
ko_kr: 회로들이 회로 샘플링 확률들의 **제곱근** 을 갖는 사전형(dicts)으로 대체된다는 것에 유의하라. 변환 전후의 이 하위 표현식을 참고하라.
pt_un: Note novamente que os circuitos são substituídos por *dicts* com **raízes quadradas** das probabilidades de amostragem do circuito. Dê uma olhada em uma sub-expressão antes e depois da conversão:
ta: சர்க்யூட் மாதிரி நிகழ்தகவுகளின் **square roots** உடன் சர்க்யூட்கள் மாற்றப்படுகின்றன என்பதை மீண்டும் கவனியுங்கள். மாற்றத்திற்கு முன்னும் பின்னும் ஒரு துணை வெளிப்பாட்டைப் பாருங்கள்:
tr: Tekrar devrelerin, devre örnekleme olasılıklarının ** square roots ** olan dikteler ile değiştirildiğine fark et. Dönüşümden önce ve sonra bir alt ifadeye bak:

source: Let's take a closer look at the types introduced above. First the Pauli operators.
es_un: Echemos un vistazo a los tipos introducidos anteriormente. Primero a los operadores de Pauli.

source: All of the objects representing operators, whether as "primitive"s such as ``PauliOp``, or algebraic expressions carry a coefficient
es_un: Todos los objetos que representan operadores, ya sea una "primitiva" como ``PauliOp``, o expresiones algebraicas llevan un coeficiente

source: In the following we take a broader and deeper look at Qiskit's operators, states, and the building blocks of quantum algorithms.
es_un: A continuación, echamos un vistazo más amplio y profundo a los operadores, estados y los componentes básicos de los algoritmos cuánticos de Qiskit.

source: Terra's Pauli -> PauliOp
es_un: Pauli de Terra -> PauliOp

source: Terra's quantum_info.Operator -> MatrixOp
es_un: quantum_info.Operator de Terra -> MatrixOp

source: Part III: ``ListOp`` and subclasses
es_un: Parte III: ``ListOp`` y subclases
ta: பகுதி III: ``ListOp`` மற்றும் துணைப்பிரிவுகள்
tr: Bölüm III: ``ListOp`` ve alt sınıflar

source: ``ListOp``, introduced above, is useful for vectorizing operations. But, it also serves as the superclass for list-like composite classes. If you've already played around with the above, you'll notice that you can easily perform operations between ``OperatorBase``\ s which we may not know how to perform efficiently in general (or simply haven't implemented an efficient procedure for yet), such as addition between ``CircuitOp``\ s. In those cases, you may receive a ``ListOp`` result (or subclass thereof) from your operation representing the lazy execution of the operation. For example, if you attempt to add together a ``DictStateFn`` and a ``CircuitStateFn``, you'll receive a ``SummedOp`` representing the sum of the two. This composite State function still has a working ``eval`` (but may need to perform a non-scalable computation under the hood, such as converting both to vectors).
es_un: ``ListOp``, presentado anteriormente, es útil para operaciones de vectorización. Pero también sirve como la superclase para clases compuestas tipo lista. Si ya has jugado con lo anterior, notarás que puedes ejecutar operaciones fácilmente entre ``OperatorBase``\ s, que puede que no sepamos como ejecutarlo de manera óptima en general (o simplemente no se haya implementado un procedimiento eficiente por el momento), tales como la adición entre ``CircuitOp``\ s. En esos casos, puedes recibir un resultado ``ListOp`` (o una subclase) de tu operación que representa la ejecución diferida de la operación. Por ejemplo, si intentas agregar un ``DictStateFn`` y un ``CircuitStateFn``, recibirás un ``SummedOp`` que representa la suma de los dos. Esta función de estado compuesto todavía tiene un ``eval`` que funciona (pero es posible que deba realizar un cálculo no escalable tras bambalinas, como convertir ambos en vectores).

source: Converters are classes that manipulate operators and states and perform building blocks of algorithms. Examples include changing the basis of operators and Trotterization. Converters traverse an expression and perform a particular manipulation or replacement, defined by the converter's ``convert()`` method, of the Operators within. Typically, if a converter encounters an ``OperatorBase`` in the recursion which is irrelevant to its conversion purpose, that ``OperatorBase`` is left unchanged.
es_un: Los conversores son clases que manipulan operadores y estados y ejecutan bloques de construcción de algoritmos. Algunos ejemplos incluyen cambiar la base de operadores y Trotterización. Los conversores recorren una expresión y realizan una manipulación o sustitución particular, definida por el método ``convert()`` del conversor, de los operadores internos. Normalmente, si un conversor encuentra un ``OperatorBase`` en la recursión que es irrelevante para su propósito de conversión, ese ``OperatorBase`` se deja sin cambios.

source: Every ``PrimitiveOp`` and ``ListOp`` has an ``.exp_i()`` function such that ``H.exp_i()`` corresponds to :math:`e^{-iH}`. In practice, only a few of these Operators have an efficiently computable exponentiation (such as MatrixOp and the PauliOps with only one non-identity single-qubit Pauli), so we need to return a placeholder, or symbolic representation, (similar to how ``SummedOp`` is a placeholder when we can't perform addition). This placeholder is called ``EvolvedOp``, and it holds the ``OperatorBase`` to be exponentiated in its ``.primitive`` property.
es_un: Cada ``PrimitiveOp`` y ``ListOp`` tiene una función ``.exp_i()`` tal que ``H.exp_i()`` corresponde a :math:`e^{-iH}`. En la práctica, sólo unos pocos de estos operadores tienen una exponenciación computable eficiente (como por ejemplo MatrixOp y los PauliOps con solo un qubit que no sea identidad de Pauli), así que necesitamos devolver un marcador de posición o una representación simbólica, (similar a cómo ``SummedOp`` es un marcador de posición cuando no podemos realizar una suma). Este marcador de posición se llama ``EvolvedOp``, y contiene la ``OperatorBase`` para ser exponenciada en su propiedad ``.primitive``.

source: Qiskit operators fully support parameterization, so we can use a ``Parameter`` for our evolution time here. Notice that there's no "evolution time" argument in any function. The Operator flow exponentiates whatever operator we tell it to, and if we choose to multiply the operator by an evolution time, :math:`e^{-iHt}`, that will be reflected in our exponentiation parameters.
es_un: Los operadores de Qiskit soportan completamente la parametrización, así que podemos usar un ``Parameter`` para nuestro tiempo de evolución aquí. Ten en cuenta que no hay ningún argumento de "tiempo de evolución" en ninguna función. El flujo del Operator exponencia cualquier operador que se le indique, y si optamos por multiplicar el operador por un tiempo de evolución, :math:`e^{-iHt}`, se reflejará en nuestros parámetros de exponenciación.

source: ``bound`` is a ``ComposedOp``. The second factor is the circuit. Let's draw it to verify that the binding has taken place.
es_un: ``bound`` es un ``ComposedOp``. El segundo factor es el circuito. Dibujémoslo para verificar que se genera el enlace.

source: Terra’s Pauli -> PauliOp
bn_bn: টেরা পাউলী যুক্তিবর্তনী -> PauliOp
ja_jp: TerraのPauli -> PauliOp

source: Part III ``ListOp`` and subclasses
bn_bn: তৃতীয়াংশ ``ListOp`` এবং উপশ্রেণি
es_mx: Parte III ``ListOp`` y subclases
ja_jp: パート III ``ListOp`` とサブクラス
ko_kr: 파트 III ``ListOp`` 와 하위 클래스

source: ``ListOp``\ s: ``SummedOp``, ``ComposedOp``, ``TensoredOp``
ja_jp: ``ListOp``: ``SummedOp``, ``ComposedOp``, ``TensoredOp``
ko_kr: ``ListOp``\ 의 종류: ``SummedOp``, ``ComposedOp``, ``TensoredOp``

source: Many algebraic operations and predicates between ``StateFn``\ s are supported, including: \* ``+`` - addition \* ``-`` - subtraction, negation (scalar multiplication by -1) \* ``*`` - scalar multiplication \* ``/`` - scalar division \* ``@`` - composition \* ``^`` - tensor product or tensor power (tensor with self n times) \* ``**`` - composition power (compose with self n times) \* ``==`` - equality \* ``~`` - adjoint, alternating between a State Function and Measurement
bn_bn: অনেক বীজগাণিতিক কার্যকারক এবং প্রেডিকেটস এর গাণিতিক মহড়া ``StateFn``\ দ্বারা সম্পাদন করা যাবে, \* ``+``- সংযোজন \* ``-`` - বিয়োজন, বিপরীতকরণ (-১ দ্বারা গুণন) \* ``*`` - গুণন \* ``/`` - বিভাজন \* ``@`` - সমযোজন \* ``^`` - টেনসর গুণন বা টেনসর শক্তিমাত্রা ( n সংখ্যক বার টেনসর গুণন) \* ``**`` - সমযোজন শক্তিমাত্রা (n সংখ্যক বার সমযোজন) ``==`` - সমতা \* ``~`` -উদ্ঘাতী, দশা অন্বয় এবং পরিমাপের মধ্যে বিনিময় এর অন্তর্ভুক্ত।
es_mx: Muchas operaciones algebraicas y predicados entre ``StateFn`` son soportadas, incluyendo: \* ``+`` - suma \* ``-`` - resta, negación (multiplicación escalar por -1) \* ``*`` - multiplicación escalar \* ``/`` - división escalar \* ``@`` - composición \* ``^`` - producto tensorial o potencia tensorial (tensor por si mismo n veces) \* ``**`` - potencia de composición (composición con sigo mismo n veces) \* ``==`` - igualdad \* ``~`` - adjunto, alternando entre una función de estado y medición
ko_kr: ``StateFn`` 간에 다양한 대수적 연산자들과 술어들이 지원된다. \* ``+`` - 덧셈 \* ``-`` - 뺄셈, 부정 (스칼라 -1 곱) \* ``*`` - 스칼라 곱 \* ``/`` - 스칼라 나누기 \* ``@`` 합성 연산 \* ``^`` - 텐서 곱 또는 텐서 지수 (텐서의 n 제곱) \* ``**`` - 합성 지수 (합성 연산 후 n제곱) \* ``==`` - 동등 \* ``~`` - (상태 함수와 측정을 서로 바꾸는) 수반이 포함된다.

source: Be aware that parentheses are often necessary to override **operator precedence**.
bn_bn: মনে রাখতে হবে যে বন্ধনী প্রায়ই **operator precedence** বা কার্যকারক মহড়াক্রমের কাজে ব্যবহৃত হয়।.
ko_kr: **연산자 우선순위** 를 오버라이드 하기 위해 종종 괄호가 필요하다는 걸 알아두자.

source: ``StateFn``\ s carry a coefficient. This allows us multiply states by a scalar, and so to construct sums.
bn_bn: ``StateFn``\ একটি সহগসহ ফলাফল দেয়। যার ফলে আমরা দশা গুণন এবং সংযোজনের কাজ করতে পারি।.
es_mx: ``StateFn`` lleva un coeficiente. Esto nos permite multiplicar estados por un escalar, y de esta forma la posibilidad de construir sumas.
ko_kr: ``StateFn``\ 들은 계수를 지니고 있다. 이는 스칼라 곱과 합계를 만들 수 있게 해준다.

source: Statevector -> VectorStateFn
bn_bn: অবস্থা ভেক্টর বা দিকরাশি -> VectorStateFn

source: QuantumCircuit -> CircuitStateFn
bn_bn: কোয়ান্টাম যুক্তিবর্তনী -> CircuitStateFn

source: OperatorBase -> OperatorStateFn
bn_bn: অপারেটরবেস -> OperatorStateFn

source: QuantumCircuit -> CircuitOp
bn_bn: কোয়ান্টাম যুক্তিবর্তনী -> CircuitOp
