Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/operators/01_operator_flow.po
Languages: bn_bn, es_mx, es_un, fr, ja_jp, ko_kr, pt_un, ta, tr

source: The ``eval`` method returns a column from an operator. For example, the Pauli :math:`X` operator is represented by a ``PauliOp``. Asking for a column returns an instance of the sparse representation, a ``DictStateFn``.
bn_bn: ``eval`` একটি কার্যকারক থেকে একটি কলাম ম্যাট্রিক্স ফলাফল হিসেবে দেয়। যেমনঃ পাউলী :math:`X` অপারেটরকে ``PauliOp`` দ্বারা চিহ্নিত করা হয়। এখন একটি কলাম ম্যাট্রিক্স ফলাফল হিসেবে পেতে হলে ``DictStateFn`` ব্যবহার করতে হবে।
es_un: El método ``eval`` devuelve una columna de un operador. Por ejemplo, el operador Pauli :math:`X` está representado por un ``PauliOp``. Al solicitar una columna, se devuelve una instancia de la representación recortada, un ``DictStateFn``.
fr: La méthode ``eval`` renvoie une colonne d'un opérateur. Par exemple, l'opérateur Pauli :math:`X` est représenté par un ``PauliOp``. Le fait d'obtenir une colonne renvoie une instance de la représentation éparse, une ``DictStateFn``.
ja_jp: ``eval`` メソッドは演算子から列を返します。たとえば、パウリ :math:`X` 演算子は ``PauliOp`` によって表現されます。 列を要求すると、疎表現のインスタンス、``DictStateFn`` を返します。
ko_kr: ``eval`` 메서드는 연산자의 열을 반환한다. 예를 들어서 파울리 :math:`X` 연산자는 ``PauliOp`` 로 표현되어 있다. 열을 요청하는 것은 객체의 희소 표현 ``DictStateFn`` 을 반환한다.
pt_un: O método ``eval`` retorna uma coluna de um operador. Por exemplo, o operador Pauli :math:`X` é representado por um ``PauliOp``. Pedir uma coluna retorna uma instância da representação esparsa, uma ``DictStateFn``.
ta: ``eval`` முறை ஒரு ஆபரேட்டரிடமிருந்து ஒரு நெடுவரிசையைத் தருகிறது. எடுத்துக்காட்டாக, Pauli :math:`X` ஆபரேட்டர் ``PauliOp`` ஆல் குறிப்பிடப்படுகிறது. ஒரு நெடுவரிசையைக் கேட்பது சிதறிய பிரதிநிதித்துவத்தின் ஒரு உதாரணத்தை அளிக்கிறது, ``DictStateFn``.
tr: ``eval`` yöntemi bir sütünü bir operatörden geri getirir. örneğin, Pauli :math:`X` operatörü ``PauliOp`` ile temsil edilir. Bir sütünü istemek seyrek gösterimin bir örneğini, bir ``DictStateFn`` döndürür.

source: It follows that indexing into an operator, that is obtaining a matrix element, is performed with two calls to the ``eval`` method.
bn_bn: একটি কার্যকারকের মহড়াক্রম ( সংখ্যাক্রম বা ইনডেক্সিং) একটি ম্যাট্রিক্স উপাদান বা ভুক্তি নির্ণয় করে, যা ``eval`` পদ্ধতিকে দুইবার নির্দেশের মাধ্যমে অর্জন করা যায়।
es_mx: Podemos ver entonces que la indexación en un operador, es decir, la obtención de un elemento de una matriz, se realiza con dos llamadas al método ``eval``.
es_un: De ello se deduce que la indexación en un operador, es decir, la obtención de un elemento de matriz, se realiza con dos llamadas al método ``eval``.
fr: Il s'ensuit que l'indexation dans un opérateur, qui obtient un élément de matrice, est effectuée avec deux appels à la méthode ``eval``.
ja_jp: 演算子のインデックス生成、すなわち行列要素の取得は、2回 ``eval`` メソッドを呼び出すことで実行されます。
ko_kr: 연산자에 인덱싱을 하는 것, 즉 행렬의 원소를 얻는 것은 ``eval`` 메서드를 두 번 호출하는 것으로 수행할 수 있다.
pt_un: Daqui decorre que indexação em um operador, que está obtendo um elemento matrix é realizada com duas chamadas para o método ``eval``.
ta: ஒரு மேட்ரிக்ஸ் உறுப்பைப் பெறும் ஒரு ஆபரேட்டரில் குறியீட்டு முறை ``eval`` முறைக்கு இரண்டு அழைப்புகளுடன் செய்யப்படுகிறது.
tr: Bir matris elde etmekle, ``eval`` yöntemine iki çağrı yaparak bir operatöre indekslemeyi takip eder.

source: We have :math:`X = \left(\begin{matrix} 0 & 1 \\ 1 & 0 \end{matrix} \right)`. And the matrix element :math:`\left\{X \right\}_{0,1}` is
bn_bn: আমাদের ম্যাট্রিক্সটি হচ্ছে :math:`X = \left(\begin{matrix} 0 & 1 \\ 1 & 0 \end{matrix} \right)` এবং ম্যাট্রিক্সটির উপাদান বা ভুক্তি হচ্ছে :math:`\left\{X \right\}_{0,1}`
es_mx: Tenemos :math:`X = \left(\begin{matrix} 0 & 1 \\ 1 & 0 \end{matrix} \right)`. Y el elemento :math:`\left\{X \right\}_{0,1}` de la matriz es
es_un: Tenemos :math:`X = \left(\begin{matrix} 0 & 1 \\ 1 & 0 \end{matrix} \right)`. Y el elemento de matriz :math:`\left\{X \right\}_{0,1}` es
fr: Nous avons :math:` X = \left (\begin{matrix} 0 & 1 \\ 1 & 0 \end{matrix} \right) `. Et l'élément de matrice :math:` \left\ { X \right\ } _{0,1}` est
ja_jp: :math:`X = \left(\begin{matrix} 0 & 1 \\ 1 & 0 \end{matrix} \right)` であるので、行列要素 :math:`\left\{X \right\}_{0,1}` は、以下の通りです。
ko_kr: 행렬 :math:`X = \left(\begin{matrix} 0 & 1 \\ 1 & 0 \end{matrix} \right)` 이 주어지면, 행렬의 원소 :math:`\left\{X \right\}_{0,1}` 는 다음과 같이 구할 수 있다.
pt_un: Temos :math:`X = \left(\begin{matrix} 0 & 1 \\ 1 & 0 \end{matrix} \right)`. E o elemento da matriz :math:`\left\{X \right\}_{0,1}` é
ta: நம்மிடம் :math:`X = \left(\begin{matrix} 0 & 1 \\ 1 & 0 \end{matrix} \right)` உள்ளது. மற்றும் மேட்ரிக்ஸ் உறுப்பு :math:`\left\{X \right\}_{0,1}` ஆனது
tr: Biz de :math:`X = \left(\begin{matrix} 0 & 1 \\ 1 & 0 \end{matrix} \right)` var. Matrisin öğesi de :math:`\left\{X \right\}_{0,1}` dır

source: Here is an example using the two qubit operator ``CX``, the controlled ``X``, which is represented by a circuit.
bn_bn: এখানে একটি দুইকিউবিট কার্যকারক ``CX``, নিয়ন্ত্রিত ``X` যা একটি যুক্তিবর্তনী দিয়ে দেখানো হচ্ছে, তার উদাহরণ দেয়া হল।
es_mx: Aquí se muestra un ejemplo usando el operador de dos cúbits ``CX``, que es el operador ``X`` controlado, y su representación en un circuito.
es_un: Aquí se muestra un ejemplo usando el operador de dos qubits ``CX``, que es el operador ``X`` controlado, y su representación en un circuito.
fr: Voici un exemple utilisant l'opérateur de deux qubits ``CX``, le ``X`` contrôlé, qui est représenté par un circuit.
ja_jp: 回路で示したように、2量子ビット演算子 ``CX`` 、制御 ``X`` を使用した例は以下の通りです。
ko_kr: 여기에 회로로 표현된 두 큐비트 연산자 ``CX`` (제어 ``X``) 를 사용한 예시가 있다.
pt_un: Aqui está um exemplo usando o operador de dois qubit ``CX``, o ``X`` controlado, que é representado por um circuito.
ta: இரண்டு கியூபிட் ஆபரேட்டரைப் பயன்படுத்தி ஒரு எடுத்துக்காட்டு இங்கே ``CX``, கட்டுப்படுத்தப்பட்ட ``X``, இது ஒரு சர்க்யூட் மூலம் குறிக்கப்படுகிறது.
tr: Burada, bir devrede temsil edilen "kontrollü X" diye adlandırılan iki kübit operatörü ``CX`` kullandıldığı bir örnektir.

source: Applying an operator to a state vector
bn_bn: দশা দিকরাশির (স্টেট ভেক্টর) এর উপর কার্যকারক প্রয়োগ
es_mx: Aplicando un operador a un vector de estado
es_un: Aplicar un operador a un vector de estado
fr: Application d'un opérateur à un vecteur d'état
ja_jp: 状態ベクトルに演算子を適用する
ko_kr: 상태 벡터에 연산자 적용하기
pt_un: Aplicando um operador a um vetor de estado
ta: ஒரு நிலை திசையனுக்கு ஒரு ஆபரேட்டரைப் பயன்படுத்துதல்
tr: Bir durum vektörüne bir operatör uygulama

source: Applying an operator to a state vector may be done with the ``compose`` method (equivalently, ``@`` operator). Here is a representation of :math:`X | 1 \rangle = |0\rangle`.
bn_bn: দশা দিকরাশির (স্টেট ভেক্টর) উপর কার্যকারক প্রয়োগ ``compose`` দ্বারাও সম্পাদন করা সম্ভব (যা ``@`` কার্যকারকের সমতুল্য)। একটি উদাহরণ হচ্ছে :math:`X | 1 \rangle = |0\rangle`।
es_mx: La aplicación de un operador a un vector de estado puede hacerse con el método ``compose`` (o equivalentemente, el operador ``@``). Aquí está una representación de :math:`X | 1 \rangle = |0\rangle`.
es_un: La aplicación de un operador a un vector de estado puede hacerse con el método ``compose`` (o equivalentemente, el operador ``@``). Aquí está una representación de :math:`X | 1 \rangle = |0\rangle`.
fr: L'application d'un opérateur à un vecteur d'état peut être effectuée avec la méthode ``compose`` (équivalence, ``@`` opérateur). Voici une représentation de :math:`X | 1 \rangle = | 0\rangle`.
ja_jp: 状態ベクトルに演算子を適用するには、 ``compose`` メソッド ( ``@`` 演算子と同等)を使用します。:math:`X | 1 \rangle = |0\rangle` は次のように表されます。
ko_kr: 상태 벡터에 연산자를 가하는 것은 ``compose`` 메서드를 통해 할 수 있다 (``@`` 연산자도 가능하다). :math:`X | 1 \rangle = |0\rangle` 라는 표현은 다음과 같다.
pt_un: Aplicar um operador a um vetor de estado pode ser feito com o método ``compose`` (equivalentemente o operador ``@``). Aqui está uma representação de :math:`X | 1 \rangle = |0\rangle`.
ta: ஒரு நிலை திசையனுக்கு ஒரு ஆபரேட்டரைப் பயன்படுத்துவது ``compose`` முறை மூலம் செய்யப்படலாம் (equivalently, ``@`` operator). இங்கே ஒரு பிரதிநிதித்துவம் :math:`X | 1 \rangle = |0\rangle`.
tr: Bir durum vektörüne bir operatörün uygulanmasıyla (equivalently, ``@`` operator) ``compose`` yöntemiyle yapılabilir. Burada :math:`X | 1 \rangle = |0\rangle` temsili gösteriliyor.

source: A simpler representation, the ``DictStateFn`` representation of :math:`|0\rangle`, is obtained with ``eval``.
bn_bn: ``DictStateFn`` দ্বারা একই দশা দিকরাশি প্রকাশ করা যাবে :math:`|0\rangle` এইভাবে, যা বেশ সহজতর এবং এটি অর্জিত হয়েছে ``eval`` দ্বারা।
es_mx: Una representación más simple, la representación ``DictStateFn`` de :math:`|0\rangle`, se obtiene con ``eval``.
es_un: Una representación más simple, la representación ``DictStateFn`` de :math:`|0\rangle`, se obtiene con ``eval``.
fr: Une représentation plus simple, la représentation ``DictStateFn`` de :math:`| 0\rangle `, est obtenue avec ``eval``.
ja_jp: :math:`|0\rangle` のよりシンプルな表現、 ``DictStateFn`` 表現は ``eval`` で取得できます。
ko_kr: 더 간단한 표현으로, :math:`|0\rangle`의 ``DictStateFn`` 표현은 ``eval`` 메서드로 얻을 수 있다.
pt_un: Uma representação mais simples, a representação ` ` DictStateFn ` ` ` de :math:`|0\rangle`, é obtida com ` ` eval ` `.
ta: ஒரு எளிய பிரதிநிதித்துவம், ``DictStateFn`` பிரதிநிதித்துவம் :math:`|0\rangle`, ``eval`` உடன் பெறப்படுகிறது.
tr: Daha basit bir temsil olan :math:`|0\rangle` temsili ``DictStateFn`` ``eval`` yöntemiyle elde edilebilir.

source: The intermediate ``ComposedOp`` step may be avoided by using ``eval`` directly.
bn_bn: মধ্যবর্তী ``ComposedOp`` ধাপ পরিহার করা যাবে সরাসরি ``eval`` ব্যবহারে মাধ্যমে।
es_mx: El paso intermedio ``ComposedOp`` puede evitarse si se utiliza ``eval`` directamente.
es_un: El paso intermedio ``ComposedOp`` puede evitarse si se utiliza ``eval`` directamente.
fr: L'étape intermédiaire ``ComposedOp`` peut être évitée en utilisant ``eval`` directement.
ja_jp: ``eval`` を直接使用することで、中間の ``ComposedOp`` ステップを回避することができます。
ko_kr: ``eval`` 을 직접적으로 사용함으로써 중간 단계인 ``ComposedOp`` 을 건너뛸 수 있다.
pt_un: A etapa intermediária ``ComposedOp`` pode ser evitada com o uso ``eval`` diretamente.
ta: ``eval`` ஐ நேரடியாகப் பயன்படுத்துவதன் மூலம் இடைநிலை ``ComposedOp`` வழியைத் தவிர்க்கப்படலாம்.
tr: Direkt olarak ``eval``ı kullanarak ``ComposedOp`` orta düzey adımını önleyebiliriz.

source: Composition and tensor products of operators are effected with ``@`` and ``^``. Here are some examples.
bn_bn: সমযোজন এবং টেনসর গুণন ``@`` এবং ``^`` দ্বারা প্রভাবিত। কিছু উদাহরণের মাধ্যমে তা বুঝানো হল।
es_mx: Los productos tensoriales y de composición de los operadores se aplican con ``@`` y ``^``. Aquí se muestran algunos ejemplos.
es_un: Los productos tensoriales y de composición de los operadores se aplican con ``@`` y ``^``. Aquí se muestran algunos ejemplos.
fr: La composition et les produits tensoriels des opérateurs sont effectués avec ``@`` et ``^``. Voici quelques exemples.
ja_jp: 演算子の合成とテンソル積は ``@`` と ``^`` で表現されます。以下にいくつかの例を示します。
ko_kr: 연산자의 합성 및 텐서곱은 ``@`` 와 ``^`` 에 영향을 받는다. 여기 몇가지 예시들이 있다.
pt_un: Composições e produtos de tensor de operadores são feitos com ``@`` e ``^``. Aqui estão alguns exemplos.
ta: ஆபரேட்டர்கள் கலவை மற்றும் டென்சர் தயாரிப்பு ``@`` மற்றும் ``^``. இங்கே சில உதாரணங்கள்.
tr: Operatörlerin bileşim ve tensör çarpımları ``@`` ve ``^` ile etkilenir. İşte bazı örnekler.

source: ``ListOp`` is a container for effectively vectorizing operations over a list of operators and states.
bn_bn: ``ListOp`` কার্যকারকসমূহকে দিকরাশিতে রূপান্তরিত করার জন্য একটি যথার্থ কন্টেইনার যা কার্যকারক এবং দশাসমূহের তালিকা করে।
es_mx: ``ListOp`` es un contenedor para operaciones de vectorización sobre una lista de operadores y estados.
es_un: ``ListOp`` es un contenedor para vectorizar operaciones de manera efectiva sobre una lista de operadores y estados.
fr: ``ListOp`` est un conteneur pour des opérations de vectorisation efficace sur une liste d'opérateurs et d'états.
ja_jp: ``ListOp`` は、演算子と状態のリストに対し、効果的に演算をベクトル化するためのコンテナです。
ko_kr: ``ListOp`` 는 효과적으로 벡터화된 연산자들의 컨테이너로써 연산자와 상태들의 리스트에 가해진다.
pt_un: ``ListOp`` é um contêiner para vetorização efetiva de operações sobre uma lista de operadores e estados.
ta: ``ListOp`` என்பது ஆபரேட்டர்கள் மற்றும் நிலைகளின் பட்டியலில் செயல்பாடுகளை திறம்பட திசையமைப்பதற்கான ஒரு கொள்கலன்.
tr: ``ListOp``, operatörlerin ve durumların listesinin üzerinde etkili vektörleştirme hesaplamarı için bir kapsayıcıdır.

source: For example, the composition above is distributed over the lists (``ListOp``) using the simplification method ``reduce``.
bn_bn: উদাহরণস্বরূপ, উপরে বর্ণিত সমযোজনকে একটি সহজ ``reduce`` নির্দেশমালা দ্বারা একটি তালিকাভুক্ত করা হল (``ListOp`` এর মাধ্যমে)।
es_mx: Por ejemplo, la composición anterior se distribuye sobre las listas (``ListOp``) utilizando el método de simplificación ``reduce``.
es_un: Por ejemplo, la composición anterior se distribuye sobre las listas (``ListOp``) utilizando el método de simplificación ``reduce``.
fr: Par exemple, la composition ci-dessus est distribuée sur les listes (``ListOp``) à l'aide de la méthode de simplification ``reduce``.
ja_jp: 例えば、上記の合成は簡約化メソッド ``reduce`` を使用してリスト（ ``ListOp`` ）に分配されます。
ko_kr: 예를 들어, 위의 합성은 단순화 메서드 ``reduce`` 를 사용하여 리스트 (``ListOp``) 위에 분배된다.
pt_un: Por exemplo, a composição acima é distribuída através das listas (``ListOp``) usando o método de simplificação ``reduce``.
ta: எடுத்துக்காட்டாக, மேலே உள்ள கலவையை ``reduce`` என்னும் எளிமைப்படுத்தும் முறையைப் பயன்படுத்தி பட்டியல்களில் (``ListOp``) விநியோகிக்கப்படுகிறது.
tr: Örneğin yukardaki bileşim, basitleştirme yöntemi olan ``reduce`` u kullanarak (``ListOp``) listelerinin üzerinde dağıtılmıştır.

source: ``ListOp``, introduced above, is useful for vectorizing operations. But, it also serves as the superclass for list-like composite classes. If you’ve already played around with the above, you’ll notice that you can easily perform operations between ``OperatorBase``\ s which we may not know how to perform efficiently in general (or simply haven’t implemented an efficient procedure for yet), such as addition between ``CircuitOp``\ s. In those cases, you may receive a ``ListOp`` result (or subclass thereof) from your operation representing the lazy execution of the operation. For example, if you attempt to add together a ``DictStateFn`` and a ``CircuitStateFn``, you’ll receive a ``SummedOp`` representing the sum of the two. This composite State function still has a working ``eval`` (but may need to perform a non-scalable computation under the hood, such as converting both to vectors).
bn_bn: উপরে বর্ণিত ``ListOp`` একটি প্রয়োজনীয় দিকরাশিকরণ কার্যকারক (ভেক্টরাইজিং অপারেশন্স)। তবে ইহা কম্পোজিট শ্রেণীর মত সুপারক্লাস হিসেবেও কাজ করে। আপনি যদি ইহা ব্যবহার করে থাকেন তাহলে লক্ষ্য করে থাকবেন যে আপনি খুব সহজেই ``OperatorBase``\ s এর কার্যকারক সম্পাদনা করতে পারবেন, যদিও ইহার সঠিক প্রায়োগিক ব্যবহার সম্পর্কে আমাদের পর্যাপ্ত দক্ষতা না থাকতেই পারে (অথবা কার্যকরী কর্মপরম্পরা আমাদের অজানা হতে পারে), যেমন ``CircuitOp``\ s কার্যকারকের যোগ। এইসব ক্ষেত্রে আমরা ``ListOp`` ফলাফল হিসেবে পাব যা কার্যকারকের নিশ্চল (লেজি) সম্পাদনার তালিকা নির্দেশ করবে। উদাহরণস্বরূপ, ``DictStateFn`` এবং ``CircuitStateFn`` একসাথে যোগ করার ক্ষেত্রে ``SummedOp`` সংখ্যা দুইটির যোগফল দেখাবে। এই সমযোজন দশার (কম্পোজিট স্টেট) ক্ষেত্রে একটি ``eval`` সম্পাদনার কাজ চলমান রাখে ( তবে কোন কোন ক্ষেত্রে প্রচ্ছন্ন অগণন গাণিতিক কার্যক্রম বা নন-স্কেলেবল কম্পিউটেশন সম্পাদনার কাজ করতে পারে, যেমন উভয় শ্রেণিকে দিকরাশিতে রুপান্তর) ।
es_mx: ``ListOp``, mostrado arriba, es útil para operaciones de vectorización. Pero también sirve como la superclase para clases compuestas tipo lista. Si ya has jugado con lo anterior, notarás que puedes ejecutar operaciones fácilmente entre ``OperatorBase``, que puede que no sepamos como ejecutarlo de manera óptima en general (o simplemente no se haya implementado un procedimiento eficiente por el momento), tales como la adición entre varios ``CircuitOp``. En tales casos, puedes recibir un resultado ``ListOp`` (o su subclase) de la operación que representa la ejecución perezosa de la operación. Por ejemplo, si intentas agregar un ``DictStateFn`` y un ``CircuitStateFn``, recibirás un ``SummedOp`` que representa la suma de los dos. Esta función de estado compuesto todavía tiene un ``eval`` que funciona (pero puede tener que realizar un cálculo que no es escalable, tal como convertir ambos a vectores).
fr: ``ListOp``, introduit ci-dessus, est utile pour les opérations de vectorisation. Mais il sert aussi de superclasse pour les classes composites de type liste. Si vous avez déjà joué avec ce qui précède, vous remarquerez que vous pouvez facilement effectuer des opérations entre les ``OperatorBase`` que nous ne savons peut-être pas comment effectuer efficacement en général (ou simplement pas encore implémenté une procédure efficace), comme l'ajout entre les ``CircuitOp``\ s. Dans ces cas, vous pouvez recevoir un résultat ``ListOp`` (ou une sous-classe) de votre opération représentant l'exécution paresseuse de l'opération. Par exemple, si vous essayez d'ajouter ensemble un ``DictStateFn`` et un ``CircuitStateFn``, vous recevrez un ``SummedOp`` représentant la somme des deux. Cette fonction d'état composite a encore un ``eval`` fonctionnel (mais peut avoir besoin d'effectuer un calcul non évolutif sous le capot, comme la conversion des deux en vecteurs).
ja_jp: 上記で紹介した ``ListOp`` はベクトル化演算に役立ちますが、リストのような複合クラスのスーパークラスとしても機能します。 すでに上記の演算を行っている場合、 ``CircuitOp`` の加算など、一般的に効率的に実行する方法がわからない ``OperatorBase`` の演算を簡単にできることに気づくでしょう (あるいはまだ効率的な手順を実装していないだけです)。そのような場合、演算の遅延実行を表す演算から ``ListOp`` の結果 (またはそれらのサブクラス) を受け取ることができます。 例えば、``DictStateFn`` と ``CircuitStateFn`` を加算しようとした場合、2つの合計を表す ``SummedOp`` を受け取ります。 この 合成状態関数は ``eval`` が作用できます (ただし、両方をベクトルに変換するなど、内部でスケーラブルでない計算を実行する必要があるかもしれません) 。
ko_kr: 위에 소개된 ``ListOp`` 는 벡터화 연산에 유용하다. 게다가 리스트와 유사한 복합 클래스들의 상위 클래스 역할도 할 수 있다. 이미 상기의 내용을 다뤄봤을 경우, ``CircuitOp``\ 들 간의 덧셈과 같이, ``OperatorBase``\ 들 간에 연산이 (일반적으로 어떻게 효율적인 연산을 할 수 있을진 모르더라도, 혹은 간단하게 말해서 효율적인 절차가 구현되지 않았더라도) 잘 되리란 것을 알 수 있을 것이다. 이러한 경우, 지연 실행을 나타내는 연산으로부터 ``ListOp`` (또는 자식 클래스)의 결과를 받을 수 있다. 예를 들어 ``DictStateFn`` 와 ``CircuitStateFn`` 을 더하면 두 대상의 합을 나타내는 ``SummedOp`` 을 받을 것이다. 이 합성 상태 함수는 여전히 ``eval`` 과 동작한다 (그러나 두 대상을 벡터로 변환하는것과 같이 우리가 직접 알 필요까지는 없는 확장 불가능한 계산을 수행할 필요가 있을 수 있다).
pt_un: ``ListOp``, introduzido acima é útil para operações de vetorização. Mas, ele também serve como uma superclasse para classes compostas por listas. Se você já usou o que foi exposto acima, notará que você pode facilmente realizar operações entre ``OperatorBase``\ s que em geral podemos não saber como executar eficientemente (ou simplesmente por que não implementamos um procedimento eficiente ainda), como a adição entre ``CircuitOp``\ s. Nesses casos, você pode receber um resultado ``ListOp`` (ou uma subclasse destes) da sua operação, representando uma execução lenta da operação. Por exemplo, se você tentar adicionar em conjunto um ``DictStateFn`` and a ``CircuitStateFn``, você receberá um ``SummedOp`` representando a soma dos dois. Esta função Estado composta ainda tem um ``eval`` funcional (mas pode precisar realizar um cálculo não escalável por baixo dos panos, como por exemplo, converter ambos para vetores).
ta: மேலே அறிமுகப்படுத்தப்பட்ட ``ListOp``, திசையன் செயல்பாடுகளுக்கு பயனுள்ளதாக இருக்கும். ஆனால், இது பட்டியல் போன்ற கலப்பு வகுப்புகளுக்கான சூப்பர் கிளாஸாகவும் செயல்படுகிறது. நீங்கள் ஏற்கனவே மேற்கூறியவற்றைக் கொண்டு விளையாடியிருந்தால், ``OperatorBase``\ s இடையே நீங்கள் எளிதாக செயல்பாடுகளைச் செய்ய முடியும் என்பதை நீங்கள் கவனிப்பீர்கள், இது பொதுவாக திறமையாக எவ்வாறு செயல்படுவது என்று எங்களுக்குத் தெரியாது (அல்லது திறமையான நடைமுறையை செயல்படுத்தவில்லை இன்னும்), ``CircuitOp``\ s இடையே சேர்த்தல் போன்றவை. அந்த சந்தர்ப்பங்களில், செயல்பாட்டின் சோம்பேறி செயல்பாட்டைக் குறிக்கும் உங்கள் செயல்பாட்டிலிருந்து ``ListOp`` முடிவை (அல்லது அதன் துணைப்பிரிவு) பெறலாம். எடுத்துக்காட்டாக, நீங்கள் ஒரு ``DictStateFn`` மற்றும் ``CircuitStateFn`` ஆகியவற்றைச் சேர்க்க முயற்சித்தால், இரண்டின் கூட்டுத்தொகையைக் குறிக்கும் ``SummedOp`` பெறுவீர்கள். இந்த கலப்பு நிலை செயல்பாடு இன்னும் செயல்படும் ``eval`` ஐக் கொண்டுள்ளது (ஆனால் இரண்டையும் திசையன்களாக மாற்றுவது போன்ற ஹூடின் கீழ் அளவிட முடியாத கணக்கீட்டைச் செய்ய வேண்டியிருக்கலாம்).
tr: Yukarda tanıtılan ``ListOp``, hesapları vektörleştimek için kullanışlıdır, lakin liste-benzeri bileşik sınıflar için onların üst sınıfı olarak da işe yarar. Eğer yukardakini biraz denediysen belki genelde en etkili şekilde kullanışını bilmediğimiz (veya kendisi için daha etkili bir prosedür henüz bulamadığımız) ``CircuitOp``\ s toplaması gibi, ``OperatorBase``\ s ile kolayca hesaplamalar yapıldığını fark etmiş olacaksın. Bu durumda sen, operasyonunun tembelce yürütülmesini temsil eden operasyonundan gelen bir ``ListOp`` sonucunu (veya onun alt sınıflarından birini) alacaksın. Örnek olarak, eğer sen ``DictStateFn`` ile ``CircuitStateFn``birleştirmek istersen, ikisinin toplamasını elde edeceksin. Bu bileşik durumun fonksiyonu hâlâ çalışan bir ``eval``e sahiptir (ancak her ikisini de vektöre dönüştürmek gibi ölçeklendirilemeyen bir hesaplama gerçekleştirmesi gerekebilir).

source: These composite ``OperatorBase``\ s are how we construct increasingly complex and rich computation out of ``PrimitiveOp`` and ``StateFn`` building blocks.
bn_bn: এই সমযোজন ``OperatorBase``\ জটিল এবং বহুল গাণিতিক ব্যবহার (রিচ কম্পিউটেশন) সম্বলিত ``PrimitiveOp`` এবং ``StateFn`` এর মৌলিক ভিত্তি।
es_mx: Los componentes ``OperatorBase`` son la forma en que construimos bloques cada vez más complejos y ricos de ``PrimitiveOp`` y ``StateFn``.
es_un: Estos ``OperatorBase``\ s compuestos son la forma en que construimos computación cada vez más compleja y rica a partir de los bloques de construcción ``PrimitiveOp`` y ``StateFn``.
fr: Ces ``OperatorBase``\ s composites sont à l'image de comment nous construisons des calculs de plus en plus complexes et riches en utilisant les blocs de construction ``PrimitiveOp`` et ``StateFn``.
ja_jp: これらの合成 ``OperatorBase`` は、``PrimitiveOp`` と ``StateFn`` の構成要素から、ますます複雑で豊富な計算を構築する方法です。
ko_kr: 이렇게 합성된 ``OperatorBase``\ 들은 더 복잡하고 풍부한 계산을 할 때 ``PrimitiveOp`` 와 ``StateFn`` 빌딩 블록에서 벗어날 수 있게 한다.
pt_un: Estes ``OperatorBase``\ s compostos são como construímos uma computação rica e cada vez mais complexa a partir dos blocos de construção ``PrimitiveOp`` e ``StateFn``.
ta: இந்த கலப்பு ``OperatorBase``\ s பெருகிய முறையில் சிக்கலான மற்றும் சிறந்த கணக்கீட்டை எவ்வாறு உருவாக்குகிறோம் என்பதுதான் ``PrimitiveOp`` மற்றும் ``StateFn`` கட்டுமான தொகுதிகள்.
tr: Bu ``OperatorBase``\ s bileşiği ile``PrimitiveOp`` and ``StateFn`` yapı bloklarının dışında daha karmaşık ve zengin hesaplamalar yapıyoruz.

source: Every ``ListOp`` has four properties:
es_un: Cada ``ListOp`` tiene cuatro propiedades:
fr: Chaque ``ListOp`` a quatre propriétés :
ja_jp: ``ListOp`` には以下の 4 つのプロパティがあります。
pt_un: Cada ``ListOp`` tem quatro propriedades:
ta: ஒவ்வொரு ``லிஸ்ட்Op`` க்கும் நான்கு பண்புகள் உள்ளன:
tr: Her ``ListOp`` dört özelliğe sahiptir:

source: ``oplist`` - The list of ``OperatorBase``\ s which may represent terms, factors, etc.
es_un: ``oplist`` - La lista de ``OperatorBase``\ s que pueden representar términos, factores, etc.
fr: ``oplist`` - La liste des ``OperatorBase``\ s qui peuvent représenter des termes, des facteurs, etc.
ja_jp: ``oplist`` - 用語、因子などを表すことができる ``OperatorBase`` のリスト。
pt_un: ``oplist`` - A lista de ``OperatorBase``\ s, que podem representar termos, fatores, etc.
ta: ``oplist`` - விதிமுறைகள், காரணிகள் போன்றவற்றைக் குறிக்கக்கூடிய ``OperatorBase``\ களின் பட்டியல்.
tr: ``oplist`` - Terimleri, etkenleri vb. temsil edebilecek ``OperatorBase`` listesi.
