Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/operators/01_operator_flow.po
Languages: bn_bn, es_mx, es_un, fr, ja_jp, ko_kr, pt_un, ta, tr

source: This page was generated from `tutorials/operators/01_operator_flow.ipynb`__.
bn_bn: এই পৃষ্ঠাটি `tutorials/operators/01_operator_flow.ipynb`__-থেকে বানানো হয়েছে।
es_mx: Esta página ha sido generada a partir de `tutorials/operators/01_operator_flow.ipynb`__.
es_un: Esta página fue generada a partir de `tutorials/operators/01_operator_flow.ipynb`__.
fr: Cette page a été générée à partir de `tutorials/operators/01_operator_flow.ipynb`__.
ja_jp: このページは `tutorials/operators/01_operator_flow.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/operators/01_operator_flow.ipynb`__ 에서 생성되었다.
pt_un: Esta página foi gerada, a partir do `tutorials/operators/01_operator_flow.ipynb`__.
ta: இந்தப் பக்கம் `tutorials/operators/01_operator_flow.ipynb`__ லிருந்து உருவாக்கப்பட்டது.
tr: Bu sayfa `tutorials/operators/01_operator_flow.ipynb`__ adresinden oluşturulmuştur.

source: Operator Flow
bn_bn: কার্যকারক প্রক্রিয়া (অপারেটর ফ্লো)
es_mx: Flujo de operadores
es_un: Flujo del Operador
fr: Flux d'opérateur
ko_kr: 연산자 플로우 (Operator Flow)
pt_un: Fluxo do operador
ta: ஆபரேட்டர் ஓட்டம்
tr: Operatör akışı

source: Introduction
bn_bn: ভূমিকা
es_mx: Introducción
es_un: Introducción
ja_jp: はじめに
ko_kr: 소개
pt_un: Introdução
ta: முன்னுரை
tr: Giriş

source: Qiskit provides classes representing states and operators and sums, tensor products, and compositions thereof. These algebraic constructs allow us to build expressions representing operators.
bn_bn: কিস্কিট গাণিতিক রাশিমালা (এলজেব্রিক এক্সপ্রেশন) প্রকাশের জন্য প্রয়োজনীয় দশা সম্বলিত ক্লাস (ক্লাসেস রিপ্রেজেন্টিং স্টেটস), কার্যকারক, গাণিতিক যোগ, টেন্সর গুণন এবং কম্পোজিশন সরবরাহ করে। কিস্কিট সরবারকৃত এইসব ক্লাস ব্যবহার করে আমরা গাণিতিক রাশিমালা তৈরি করতে পারি।.
es_mx: Qiskit proporciona clases que representan estados, operadores, sumas, productos tensoriales y composiciones de los mismos. Estas construcciones algebraicas nos permiten construir expresiones que representan operadores.
es_un: Qiskit proporciona clases que representan estados, operadores, sumas, productos tensoriales y composiciones de los mismos. Estas construcciones algebraicas nos permiten construir expresiones que representan operadores.
fr: Qiskit fournit des classes représentant les états, les opérateurs, les combinaisons linéaires, les produits tensoriels et leurs compositions. Ces constructions algébriques nous permettent de construire des expressions représentant des opérateurs.
ja_jp: Qiskit には、状態と演算子、合計、テンソル積、合成を表すクラスが用意されています。これらの代数的構成物により、演算子を表す式を構築することができます。
ko_kr: Qiskit은 상태와 연산자와 그들의 합, 텐서 곱, 그리고 그들의 합성을 나타내는 클래스들을 제공한다. 이런 대수적 구조들은 연산자들을 나타내는 표현을 빌드할 수 있도록 해 준다.
pt_un: Qiskit fornece classes representando estados, operadores e somas, produtos de tensores e composições. Estas construções algébricas nos permitem construir expressões representando os operadores.
ta: Qiskit நிலைகள் மற்றும் ஆபரேட்டர்கள் மற்றும் தொகைகள், டென்சர் ப்ராடக்ட்கள் மற்றும் அதன் கலவைகளை குறிக்கும் வகுப்புகளை வழங்குகிறது. இந்த இயற்கணித கட்டமைப்புகள் ஆபரேட்டர்களைக் குறிக்கும் வெளிப்பாடுகளை உருவாக்க எங்களை அனுமதிக்கின்றன.
tr: Qiskit durum, operatör ve toplamalar, tensör ürünleri ve oluşturmaları açıklayan dersler veriyor. Bu cebirsel oluşmaları operatörleri temsil eden ifadeleri oluşturmamıza izin veriyor.

source: We introduce expressions by building them from Pauli operators. In subsequent sections we explore in more detail operators and states, how they are represented, and what we can do with them. In the last section we construct a state, evolve it with a Hamiltonian, and compute expectation values of an observable.
bn_bn: শুরুতে আমরা এইসব গাণিতিক রাশিমালা পাউলী কার্যকারক ব্যবহার করে প্রকাশ করব। পরবর্তী অধ্যায়গুলোতে, আমরা বিস্তারিতভাবে দেখাব কিভাবে এইসব কার্যকারক এবং দশা ব্যবহার করা যায়, তাদের প্রকাশ করা যায় এবং আরও কি কি রাশিমালা প্রকাশ করা যায়। সবশেষে দেখানো হবে কিভাবে এই দশা প্রস্তুত করা হয়, হ্যামিল্টনিয়ানের সাথে কিভাবে তা পরিবর্তিত হয় এবং সর্বোপরি একটি পর্যবেক্ষকের গড় মান নির্ণয় করা হবে।.
es_mx: Introducimos expresiones creándolas a partir de operadores de Pauli. En secciones posteriores exploraremos operadores y estados con mayor detalle, cómo están representados, y qué podemos hacer con ellos. En la última sección construiremos un estado, lo desarrollaremos con un Hamiltoniano, y calculamos los valores de esperados de un observable.
es_un: Introducimos expresiones creándolas a partir de operadores de Pauli. En secciones posteriores exploraremos operadores y estados con mayor detalle, cómo están representados, y qué podemos hacer con ellos. En la última sección construiremos un estado, lo desarrollaremos con un Hamiltoniano, y calcularemos los valores esperados de un observable.
fr: Nous introduisons des expressions en les construisant à partir des opérateurs de Pauli. Dans les sections suivantes, nous explorons plus en détail les opérateurs et les états, comment ils sont représentés et ce que nous pouvons faire avec eux. Dans la dernière section, nous construisons un état, le faisons évoluer avec un Hamiltonien, et calculons les valeurs d'espérance d'un observable.
ja_jp: まずパウリ演算子を用いて構築する式を紹介します。 後続のセクションでは、より詳細な演算子と状態、それらがどのように表現されるか、そしてそれらを使って何ができるかについて説明します。 最後のセクションでは、状態を構築し、ハミルトニアンでそれを発展させ、観測可能な期待値を計算します。
ko_kr: Pauli 연산자(Pauli operators)로부터 빌드되는 표현을 소개한다. 후속 절에서는 연산자와 상태, 그들이 어떻게 표현되는지, 그리고 그들로 무엇을 할 수 있는지 더 상세하게 알아본다. 마지막 절에서는 해밀토니안을 따라 변화(time-evolution)하는 상태를 구성하고, 관측가능량(observable)의 기댓값을 계산할 것이다.
pt_un: Introduzimos expressões construindo-as a partir de operadores Pauli. Nas seções subsequentes, exploramos com mais detalhes os operadores e os estados, como estão representados e o que podemos fazer com eles. Na última seção nós construímos um estado, evoluindo-o com um operador Hamiltoniano e calculando os valores de expectativa desse observável.
ta: Pauli ஆபரேட்டர்களிடமிருந்து அவற்றை உருவாக்குவதன் மூலம் வெளிப்பாடுகளை அறிமுகப்படுத்துகிறோம். அடுத்தடுத்த பிரிவுகளில், ஆபரேட்டர்கள் மற்றும் நிலைகள், அவை எவ்வாறு குறிப்பிடப்படுகின்றன, அவற்றுடன் நாம் என்ன செய்ய முடியும் என்பதை விரிவாக ஆராய்வோம். கடைசி பிரிவில் நாம் ஒரு நிலையை உருவாக்குகிறோம், அதை ஒரு ஹாமில்டோனியனுடன் உருவாக்குகிறோம், மேலும் கவனிக்கத்தக்க எதிர்பார்ப்பு மதிப்புகளைக் கணக்கிடுகிறோம்.
tr: Biz bu ifadeleri Pauli operatörlerinden oluşturarak girdiriyoruz. Sonraki bölümlerde biz operatörleri ile durumları, onların nasıl temsil edildiği ve onlarla ne yapabileceğimiz gibi daha detaylı bir araştırma yapacağız. Son bölümde ise biz bir durumu oluşturuyoruz, bir Hamiltonian ile evrimleştiriyoruz, ve bir gözlemlenenin beklenti değerlerini hesaplıyoruz.

source: Pauli operators, sums, compositions, and tensor products
bn_bn: পাউলি কার্যকারক (অপারেটরস), গাণিতিক সংযোজন, কম্পোজিশন এবং টেন্সর গুণফল
es_mx: Operadores de Pauli, sumas, composiciones y productos tensoriales
es_un: Operadores de Pauli, sumas, composiciones y productos tensoriales
fr: Opérateurs de Pauli, sommes, compositions et produits tensoriels
ja_jp: パウリ演算子、和、合成、およびテンソル積
ko_kr: Pauli 연산자, 합계, 합성 및 텐서 곱
pt_un: Operadores Pauli, somas, composições e produtos de tensor
ta: Pauli ஆபரேட்டர்கள், தொகைகள், கலவை மற்றும் டென்சர் ப்ராடக்ட்கள்
tr: Pauli operatörleri, toplamalar, oluşturmalar, ve tensör ürünleri

source: The most important base operators are the Pauli operators. The Pauli operators are represented like this.
bn_bn: সবচেয়ে গুরুত্ত্বপুর্ণ কার্যকারক হচ্ছে পাউলী কার্যকারক। এই পাউলী কার্যকারকের প্রকাশভঙ্গী নিম্নরূপ।.
es_mx: Los operadores fundamentales más importantes son los operadores de Pauli, los cuales se representan de esta manera.
es_un: Los operadores base más importantes son los operadores de Pauli, los cuales son representados de esta manera.
fr: Les opérateurs de base les plus importants sont les opérateurs Pauli. Les opérateurs Pauli sont représentés comme ceci.
ja_jp: 最も重要な基礎的演算子は、パウリ演算子です。パウリ演算子は、このように表現されます。
ko_kr: 가장 중요한 기반 연산자는 Pauli 연산자이다. Pauli 연산자는 다음과 같이 표현된다.
pt_un: Os operadores de base mais importantes são os operadores Pauli. Os operadores Pauli estão representados assim.
ta: மிக முக்கியமான அடிப்படை ஆபரேட்டர்கள் Pauli ஆபரேட்டர்கள். Pauli ஆபரேட்டர்கள் இதுபோன்று குறிப்பிடப்படுகிறார்கள்.
tr: En önemli temel operatörler Pauli operatörleridir. Pauli operatörleri bu şekilde temsil edilir.

source: These operators may also carry a coefficient.
bn_bn: এইসব অপারেটর সহগ সম্বলিতও হতে পারে।
es_mx: Estos operadores también pueden llevar un coeficiente.
es_un: Estos operadores también pueden llevar un coeficiente.
fr: Ces opérateurs peuvent également porter un coefficient.
ja_jp: これらの演算子は係数を持つこともできます。
ko_kr: 이 연산자들은 계수 또한 가져갈 수 있다.
pt_un: Estes operadores também podem transportar um coeficiente.
ta: இந்த ஆபரேட்டர்கள் ஒரு குணகத்தையும் கொண்டு செல்லக்கூடும்.
tr: Bu operatörler ayrıca bir katsayı taşıyabilir.

source: These coefficients allow the operators to be used as terms in a sum.
bn_bn: এই সহগগুলো গাণিতিক সংযোজনের সময় একটি পদ (টার্ম) হিসেবে ব্যবহার করা যায়।.
es_mx: Estos coeficientes permiten que los operadores se utilicen como términos en una suma.
es_un: Estos coeficientes permiten que los operadores se utilicen como términos en una suma.
fr: Ces coefficients permettent aux opérateurs d'être utilisés comme termes dans une somme.
ja_jp: これらの係数により、演算子は和の項として使用できます。
ko_kr: 이 계수들은 연산자들을 합계의 항들로 사용할 수 있도록 해준다.
pt_un: Estes coeficientes permitem que os operadores sejam utilizados como termos em uma soma.
ta: இந்த குணகங்கள் ஆபரேட்டர்களை ஒரு தொகையாக சொற்களாகப் பயன்படுத்த அனுமதிக்கின்றன.
tr: Bu katsayıları, operatörlerin bir toplamada terim olarak kullanılmasına izin veriyor.

source: Tensor products are denoted with a caret, like this.
bn_bn: টেনসর গুণনকে একটি ক্যারেট দিয়ে প্রকাশ করা যায়, যা দেখতে অনেকটা এইরকম।.
es_mx: Los productos tensoriales se denotan con un caret (acento circunflejo), como este.
es_un: Los productos tensoriales se denotan con un caret (acento circunflejo), como este.
fr: Les produits tensoriels sont signalés par un caret, comme celui-ci.
ja_jp: テンソル積は、次のようにキャレット(脱字記号) で表されます。
ko_kr: 텐서 곱은 이와 같이 캐럿(caret)으로 표시된다.
pt_un: Os produtos de tensor são denotados com um identificador, como este.
ta: டென்சர் ப்ராடக்ட்கள் இது போன்ற ஒரு caret உடன் குறிக்கப்படுகின்றன.
tr: Tensör ürünleri gösterilen şapka simgesi ile belirtiliyor.

source: Composition is denoted by the ``@`` symbol.
bn_bn: কম্পোজিশন কে প্রকাশ করা হয় ``@`` এই সংকেত দ্বারা।.
es_mx: La composición se denotada por el símbolo ``@``.
es_un: La composición es denotada por el símbolo ``@``.
fr: La composition est indiquée par le symbole ``@``.
ja_jp: 合成は``@`` 記号で表されます。
ko_kr: 합성은 ``@`` 기호로 표시된다.
pt_un: A composição é indicada pelo símbolo ``@``.
ta: கலவை என்பது ``@`` சின்னத்தால் குறிக்கப்படுகிறது.
tr: Oluşturmalar ``@`` simgesi ile belirtiliyor.

source: In the preceding two examples, the tensor product and composition of Pauli operators were immediately reduced to the equivalent (possibly multi-qubit) Pauli operator. If we tensor or compose more complicated objects, the result is objects representing the unevaluated operations. That is, algebraic expressions.
bn_bn: উল্লেখিত উদাহরণ দুইটিতে, পাউলী কার্যকারকের টেনসর গুণন এবং কম্পোজিশন বহুকিউবিট সমতুল্য একটি পাউলী কার্যকারকে পরিণত হয়েছে। আরও টেনসর গুণন অথবা কম্পোশজিশন ফলাফলটিকে আনইভালুয়েটেড কার্যকারকে পরিণত করে, যা বীজগাণিতিক রাশিমালা হিসেবে ব্যবহার করা যাবে।.
es_un: En los dos ejemplos anteriores, el producto tensorial y la composición de los operadores de Pauli se redujeron inmediatamente al operador de Pauli equivalente (posiblemente de múltiples qubits). Si aplicamos el producto tensorial o componemos objetos más complicados, el resultado son objetos que representan las operaciones no evaluadas. Es decir, expresiones algebraicas.
fr: Dans les deux exemples précédents, le produit tensoriel et la composition des opérateurs de Pauli ont été immédiatement réduits à l'opérateur de Pauli équivalent (éventuellement multiqubit). Si nous composons des objets plus complexes, le résultat sera un objet représentant le s opérations à évaluer. Il s'agit d'expressions algébriques.
ja_jp: 前述の2つの例では、テンソル積とパウリ演算子の合成は即時に(おそらく複数量子ビットの) 等価なパウリ演算子に減らされました。 テンソルまたはより複雑なオブジェクトを構成する場合、結果は評価されていない演算を表すオブジェクトになります。つまり、代数式です。
ko_kr: 앞의 두 예에서, Pauli 연산자들의 텐서 곱과 합성은 즉각 동등한 (다수의 큐비트일 가능성이 있는) Pauli 연산자로 줄여 표현되었다. 텐서 곱과 합성이 포함된 더 복잡한 객체의 경우, 결과는 평가 전의 연산들(unevaluated operations)을 나타내는 객체가 된다. 즉, 대수적 표현으로 나타난다.
pt_un: Nos dois exemplos anteriores, o produto de tensor e a composição dos operadores Pauli foram imediatamente reduzidos ao equivalente (possivelmente multi-qubit) operador Pauli. Se usar o tensor ou se compormos objetos mais complicados, o resultado são objetos que representam as operações não avaliadas, ou seja, expressões algébricas.
ta: முந்தைய இரண்டு எடுத்துக்காட்டுகளில், Pauli ஆபரேட்டர்களின் டென்சர் ப்ராடக்ட் மற்றும் கலவை உடனடியாக சமமான (சாத்தியமான பல-கியூபிட்) Pauli ஆபரேட்டராக குறைக்கப்பட்டது. நாம் மிகவும் சிக்கலான ஆப்ஜெக்ட்களை டென்சர் செய்தால் அல்லது உருவாக்கினால், இதன் விளைவு மதிப்பிடப்படாத செயல்பாடுகளைக் குறிக்கும் ஆப்ஜெக்ட்கள். அதாவது, இயற்கணித வெளிப்பாடுகள்.
tr: Önceki iki örnekteki tensör çarpımı ve Pauli operatörlerinin bileşimi bir anda (büyük ihtimalle çok-kübitli) eşdeğer olan Pauli operatörüne indirgendi. Eğer biz daha karmaşık nesneler tensörleştirir veya birleştirirsek, sonuç, değerlendirilmemiş işlemleri temsil eden nesneler olacaktır. Bu da, cebir ifadelerdir.

source: For example, composing two sums gives
bn_bn: উদাহরণস্বরূপ, দুইটি গাণিতিক সংযোজনের কম্পোজিশন
es_mx: Por ejemplo, la composición de dos sumas
es_un: Por ejemplo, la composición de dos sumas
fr: Par exemple, composer deux sommes donne
ja_jp: 例えば、2つの和を合成すると：
ko_kr: 예를 들어, 두 합의 합성은 다음을 주고
pt_un: Por exemplo, compondo duas somas temos
ta: உதாரணமாக, இரண்டு தொகைகளை உருவாக்கினால், இவ்வாறு அளிக்கும்
tr: Örneğin, iki toplama kompoze etmek bize aşağıdaki sonucu veriyor

source: And tensoring two sums gives
bn_bn: এবং দুইটি গাণিতিক সংযোজনের টেনসর হবে
es_mx: Y el producto tensorial de dos sumas da
es_un: Y el producto tensorial de dos sumas da
fr: Et le produit tensoriel de deux sommes donne
ja_jp: また、2つの和のテンソル積を取ると：
ko_kr: 두 합의 텐서 곱은 다음을 준다
pt_un: E usando o tensor, duas somas retornam
ta: மற்றும் இரண்டு தொகைகளை டென்சார் செய்வது, இப்படியாகும்
tr: Tensör etmemiz ise

source: Let’s take a closer look at the types introduced above. First the Pauli operators.
bn_bn: এবার উপরে বর্নিত কার্যকারকের একটু বিস্তারিত ব্যখ্যা করা যাক। শুরুতে পাউলী কার্যকারক।.
es_mx: Echemos un vistazo a los tipos introducidos anteriormente. Primero a los operadores de Pauli.
fr: Examinons de plus près les types présentés ci-dessus. D'abord les opérateurs de Pauli.
ja_jp: 上記の種類を詳しく見てみましょう。まずはパウリ演算子です。
ko_kr: 위에 소개된 유형을 자세히 살펴보자. 먼저, Pauli 연산자들이 있다.
pt_un: Vamos dar uma olhada nos tipos introduzidos acima. Primeiro nos operadores Pauli.
ta: மேலே அறிமுகப்படுத்தப்பட்ட வகைகளை உற்று நோக்கலாம். முதலில் Pauli ஆபரேட்டர்கள்.
tr: Yukarda gösterilen türlerine yakından bakalım. Evvela Pauli operatörleri.

source: Each Pauli operator is an instance of ``PauliOp``, which wraps an instance of ``qiskit.quantum_info.Pauli``, and adds a coefficient ``coeff``. In general, a ``PauliOp`` represents a weighted tensor product of Pauli operators.
bn_bn: প্রত্যেক পাউলী কার্যকারক ``PauliOp`` এর ইন্সটান্স, যা ``qiskit.quantum_info.Pauli`` এর একটি ইন্সটান্স এবং একটি সহগ `coeff`` যুক্ত করে। সাধারণত একটি ``PauliOp``পাউলী কার্যকারকের আবেশিত টেনসর গুণন প্রকাশ করে।.
es_mx: Cada operador Pauli es una instancia de ``PauliOp``, que envuelve a una instancia de ``qiskit.quantum_info.Pauli``, y añade un coeficiente ``coeff``. En general, un ``PauliOp`` representa un producto tensorial ponderado de operadores Pauli.
es_un: Cada operador Pauli es una instancia de ``PauliOp``, que envuelve a una instancia de ``qiskit.quantum_info.Pauli``, y añade un coeficiente ``coeff``. En general, un ``PauliOp`` representa un producto tensorial ponderado de operadores Pauli.
fr: Chaque opérateur de Pauli est une instance de ``PauliOp``, qui enveloppe une instance de ``qiskit.quantum_info.Pauli``, et ajoute un coefficient ``coeff``. D'une manière générale, un `` PauliOp`` représente un produit tensoriel pondéré d'opérateurs de Pauli.
ja_jp: 各パウリ演算子は ``PauliOp`` のインスタンスで、``qiskit.quantum_info.Pauli`` のインスタンスをラップし、係数 ``coeff`` を追加します。一般的に, ``PauliOp`` はパウリ演算子の加重テンソル積を表します.
ko_kr: 각 Pauli 연산자는 ``PauliOp`` 인스턴스로써 ``qiskit.quantum_info.Pauli`` 인스턴스를 래핑하고, 계수 ``coeff`` 를 갖는다. 일반적으로 ``PauliOp`` 는 Pauli 연산자의 가중 텐서 곱을 나타낸다.
pt_un: Cada operador Pauli é uma instância de ``PauliOp``, que envolve uma instância de ``qiskit.quantum_info.Pauli`` e adiciona um coeficiente ``coeff``. Em geral, um ``PauliOp`` representa um produto de tensor ponderado dos operadores Pauli.
ta: ஒவ்வொரு Pauli ஆபரேட்டரும் ``PauliOp`` இன் ஒரு எடுத்துக்காட்டு, இது ``qiskit.quantum_info.Pauli`` இன் ஒரு நிகழ்வை மடக்கி, ஒரு குணகம் ``coeff`` ஐ சேர்க்கிறது. பொதுவாக, ``PauliOp`` என்பது Pauli ஆபரேட்டர்களின் எடையுள்ள டென்சர் ப்ராடக்ட்டைக் குறிக்கிறது.
tr: Her Pauli operatörü, ``qiskit.quantum_info.Pauli``nın bir örneğini saran, ve bir ``coeff`` katsayısını ekleyen bir ``PauliOp`` nın örneğidir. Genel olarak, bir ``PauliOp`` Pauli operatörlerinin ağırlıklı tensör ürününü temsil ediyor.

source: For the encoding of the Pauli operators as pairs of Boolean values, see the documentation for ``qiskit.quantum_info.Pauli``.
bn_bn: পাউলী কার্যকারকসমূহকে একজোড়া বুলিয়ান মান হিসেবে এনকোড করতে চাইলে, ``qiskit.quantum_info.Pauli``. এই নির্দেশনা (ডকুমেন্টেশন) ব্যবহারের অনুরোধ রইল।.
es_mx: Para la codificación de los operadores de Pauli como pares de valores booleanos, ve la documentación de ``qiskit.quantum_info.Pauli``.
es_un: Para la codificación de los operadores de Pauli como pares de valores booleanos, ve la documentación de ``qiskit.quantum_info.Pauli``.
fr: Pour le codage des opérateurs Pauli en tant que paires de valeurs booléennes, consultez la documentation de ``qiskit.quantum_info.Pauli``.
ja_jp: パウリ演算子をブール値のペアとしてエンコーディングするには、``qiskit.quantum_info.Pauli`` のドキュメントを参照してください。
ko_kr: Pauli 연산자를 불리언 값 쌍으로 인코딩하려면 ``qiskit.quantum_info.Pauli`` 문서를 참조하라.
pt_un: Para a codificação dos operadores Pauli como pares de valores booleanos, consulte a documentação ``qiskit.quantum_info.Pauli``.
ta: Pauli ஆபரேட்டர்களை பூலியன் மதிப்புகளின் ஜோடிகளாக குறியாக்க, ``qiskit.quantum_info.Pauli`` க்கான ஆவணங்களைக் காண்க.
tr: Pauli operatörlerinin Boolean değerleri olarak kodlanmaları için ``qiskit.quantum_info.Pauli`` belgelerine bakınız.

source: All of the objects representing operators, whether as “primitive”s such as ``PauliOp``, or algebraic expressions carry a coefficient
bn_bn: সকল কার্যকারক নির্দেশকারী অবজেক্ট, হোক তা “primitive” যেমন ``PauliOp`` অথবা গাণিতিক রাশিমালা ভিত্তিক সবক্ষেত্রেই একটি সহগ বিদ্যমান থাকবে।
es_mx: Todos los objetos que representan operadores, ya sea una “primitiva” como ``PauliOp``, o expresiones algebraicas llevan un coeficiente
fr: Tous les objets représentant les opérateurs, qu'il s'agisse de "primitives" telles que ``PauliOp``, ou d'expressions algébriques ont un coefficient
ja_jp: 演算子を表現する全てのオブジェクトは、 ``PauliOp`` のような「プリミティブ」でも代数式でも、係数を持ちます。
ko_kr: ``PauliOp`` 의 “primitive”든 대수적 표현이든, 연산자를 나타내는 모든 객체들은 계수를 가진다.
pt_un: Todos os objetos representando os operadores, sejam como “primitivas” tais como o ``PauliOp`` ou expressões algébricas, carregam um coeficiente
ta: ஆபரேட்டர்களைக் குறிக்கும் அனைத்து ஆப்ஜெக்ட்களும், ``PauliOp`` போன்ற "பழமையானவை", அல்லது இயற்கணித வெளிப்பாடுகள் ஒரு குணகத்தைக் கொண்டுள்ளன
tr: Operatör temsil eden her nesne, ister ``PauliOp`` gibi temel olsun, veya cebirsel bir ifade olsun, bir katsayı taşıyor

source: In the following we take a broader and deeper look at Qiskit’s operators, states, and the building blocks of quantum algorithms.
bn_bn: আমরা এখন আরও বিস্তারিতভাবে কিস্কিট কার্যকারক, দশা এবং কোয়ান্টাম ধারাক্রমের (এলগোরিদমে) মূল উপাদান নিয়ে আলোচনা করব।.
es_mx: A continuación analizamos a fondo los operadores de Qiskit, los estados además de los elementos básicos de los algoritmos cuánticos.
fr: Dans ce qui suit, nous avons un regard plus large et plus approfondi sur les opérateurs de Qiskit, les états et les blocs de construction des algorithmes quantiques.
ja_jp: 以下では、Qiskitの演算子、状態、および量子アルゴリズムの構成要素をより幅広く詳しく見ていきます。
ko_kr: 다음으로, Qiskit의 연산자, 상태 및 양자 알고리즘의 빌딩 블록을 보다 광범위하고 심도 있게 살펴본다.
pt_un: No que se segue, analisamos mais ampla e profundamente os operadores do Qiskit, os estados e os blocos de construção de algoritmos quânticos.
ta: பின்வருவனவற்றில் Qiskit இன் ஆபரேட்டர்கள், நிலைகள் மற்றும் குவாண்டம் வழிமுறைகளின் கட்டுமானத் தொகுதிகள் குறித்து நாம் விரிவாகவும் ஆழமாகவும் பார்க்கிறோம்.
tr: Aşağıda Qiskit operatörlerine, durumlarına, ve kuantum algoritmalarının yapı temellerine daha geniş ve derin bir bakış atıyoruz.

source: Part I: State Functions and Measurements
bn_bn: প্রথমতঃ দশার অন্বয় (ফাংশন) এবং পরিমাপ (মেজারমেন্টস)
es_mx: Parte I: Funciones de Estado y Mediciones
es_un: Parte I: Funciones de Estado y Mediciones
fr: Partie I: Fonctions et mesures
ja_jp: パートI: 状態関数と測定
ko_kr: 파트 I: 상태 함수 및 측정
pt_un: Parte I: Funções e Medidas do Estado
ta: பகுதி I: நிலை செயல்பாடுகள் மற்றும் அளவீடுகள்
tr: Bölüm 1: Durum fonksiyonları ve ölçmeler
