Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/operators/01_operator_flow.po
Languages: bn_bn, es_mx, es_un, fr, ja_jp, ko_kr, pt_un, ta, tr

source: A Hamiltonian expressed as a linear combination of multi-qubit Pauli operators may be constructed like this.
bn_bn: একটি হ্যামিল্টনিয়ান কে বহুকিউবিট পাউলী অপারেটর ভিত্তিক যোগাশ্রয়ী সমযোজন দ্বারা প্রকাশ করা যায়।
es_un: Un Hamiltoniano expresado como una combinación lineal de operadores de Pauli multi-qubit puede ser construido de este modo.
fr: Un Hamiltonien exprimé comme une combinaison linéaire d'opérateurs Pauli multi-qubit peut être construit comme ceci.
ja_jp: 多量子ビットパウリ演算子の線型結合として表現されるハミルトニアンは、次のように構築することができます。
ko_kr: 멀티 큐비트 Pauli 연산자들의 선형 결합으로 표현되는 해밀토니안은 이와 같이 구성될 수 있다.
pt_un: Um Hamiltoniano expresso como uma combinação linear de operadores Pauli multi-qubit podem ser construídos assim.
ta: மல்டி-கியூபிட் Pauli ஆபரேட்டர்களின் நேரியல் கலவையாக வெளிப்படுத்தப்பட்ட ஒரு ஹாமில்டோனியன் இதுபோன்று கட்டமைக்கப்படலாம்.
tr: Bir çoklu kübit Pauli operatörlerinin bir lineer kombinasyon olarak ifade edilen bir Hamiltonian'ı bu şekilde oluşturulabilir.

source: Note that ``two_qubit_H2`` is represented as a ``SummedOp`` whose terms are ``PauliOp``\ s.
bn_bn: লক্ষণীয় যে, ``two_qubit_H2`` কে একটি ``SummedOp`` দ্বারা প্রকাশ করা যায়, যা ``PauliOp``\ s এর অধিভুক্ত।
es_un: Nota que ``two_qubit_H2`` está representado como un ``SummedOp`` cuyos términos son ``PauliOp``\ s.
fr: Notez que ``two_qubit_H2`` est représenté comme un ``SummedOp`` dont les termes sont des ``PauliOp``\ s.
ja_jp: ここで、``two_qubit_H2`` は、項が ``PauliOp`` である ``SummedOp`` として表現されます。
ko_kr: ``two_qubit_H2`` 는 ``PauliOp``\ 들의 항을 갖는 ``SummedOp`` 로 표현된다.
pt_un: Observe que ``two_qubit_H2`` é representado como um ``SummedOp`` cujos termos são ``PauliOp``\ s.
ta: ``wo_qubit_H2`` என்பது ``SummedOp`` எனக் குறிப்பிடப்படுகிறது, இதன் சொற்கள் ``PauliOp``\ s.
tr: ``two_qubit_H2`` nın kendi terimleri ``PauliOp``\ s olan ``SummedOp`` olarak temsil edildiğine fark et.

source: Next, we multiply the Hamiltonian by a ``Parameter``. This ``Parameter`` is stored in the ``coeff`` property of the ``SummedOp``. Calling ``exp_i()`` on the result wraps it in ``EvolvedOp``, representing exponentiation.
bn_bn: এরপর, আমরা হ্যামিল্টোনিয়ানটিকে ``Parameter`` দিয়ে গুণিত করি, ``Parameter``টিকে ``SummedOp``এর বৈশিষ্ট্য``coeff``এতে সংগ্রহ করে রাখা হয়। ফলাফলেতে ``exp_i()``কে ডাকা মানে এটিকে``EvolvedOp``এতে আবৃত করা, সজ্জাকে প্রদর্শিত করে।
es_un: A continuación, multiplicamos al Hamiltoniano por un ``Parameter``. Este ``Parameter`` se almacena en la propiedad ``coeff`` de ``SummedOp``. Llamando a ``exp_i()``, en el resultado; lo envuelve en ``EvolvedOp``, representando la exponenciación.
fr: Ensuite, nous multiplions l'Hamiltonien par un ``Parameter``. Ce ``Parameter`` est stocké dans la propriété ``coeff`` du ``SummedOp``. Appeler ``exp_i()`` sur le résultat l'enveloppe dans ``EvolvedOp``, représentant l'exponentiation.
ja_jp: 次に、ハミルトニアンに ``Parameter`` を掛けます。この ``Parameter`` は ``SummedOp`` の ``coeff`` プロパティに保存されています。 結果に対し ``exp_i()`` を呼び出すと、指数化を表す ``EvolvedOp`` でラップされます。
ko_kr: 다음에는 해밀토니안에 ``Parameter`` 를 곱할 것이다. 이 ``Parameter`` 는 ``SummedOp`` 의 ``coeff`` 속성에 저장되어 있다. ``exp_i()`` 를 결과에 호출하면 그것을 지수 표현인 ``EvolvedOp`` 에 감싼다.
pt_un: Em seguida, multiplicamos o Hamiltoniano por um ``Parameter``. Este ``Parameter`` é armazenado na propriedade ``coeff`` do ``SummedOp``. Chamando ``exp_i()`` no resultado, envolve-o em ``EvolvedOp``, representando uma exponenciação.
ta: அடுத்து, ஹாமில்டோனியனை ``Parameter`` மூலம் பெருக்குகிறோம். இந்த ``Parameter`` ``SummedOp`` இன் ``coeff`` பண்பில் சேமிக்கப்படுகிறது. முடிவில் ``exp_i()`` என்று அழைப்பது, அதை ``EvolvedOp`` போர்த்தி, அடுக்காகக் குறிக்கிறது.
tr: Sonra, Hamiltonian'ı ``Parameter`` ile çarpıyoruz. Bu ``Parameter`` ``SummedOp`` 'nun ``coeff`` özelliğinde saklanıyor. Sonuçlarda ``exp_i()`` çalıştırarak üslenmeyi temsil eden `` EvolvedOp '' ile sarılır.

source: We construct ``h2_measurement``, which represents ``two_qubit_H2`` as an observable.
bn_bn: আমরা ``h2_measurement`` নির্মাণ করি, যা একটি পর্যবেক্ষণযোগ্য হিসাবে ``two_qubit_H2`` প্রতিনিধিত্ব করে।
es_un: Construimos ``h2_measurement``, que representa ``two_qubit_H2`` como un observable.
fr: Nous construisons ``h2_measurement``, qui représente ``two_qubit_H2`` comme observable.
ja_jp: ``two_qubit_H2`` の観測量として、``h2_measurement`` を構築しましょう。
ko_kr: ``two_qubit_H2`` 를 관측가능량으로 나타내는 ``h2_measurement`` 를 구성할 것이다.
pt_un: Nós construímos ``h2_measurement``, que representa ``two_qubit_H2`` como um observável.
ta: ``h2_measurement`` ஐ உருவாக்குகிறோம், இது ``two_qubit_H2`` ஐக் காணக்கூடியதாகக் குறிக்கிறது.
tr: Bir gözlemlenebilir olarak ``two_qubit_H2`` temsil eden, biz ``h2_measurement``oluşturuyoruz.

source: We construct a Bell state :math:`|\Phi_+\rangle` via :math:`\text{CX} (H\otimes I) |00\rangle`.
bn_bn: :math:`|\Phi_+\rangle` এবং :math:`\text{CX} (H\otimes I) |00\rangle` দ্বারা একটি বেল স্টেট অবস্থা নির্ণয় করা হয়।
es_un: Construimos un estado de Bell :math:`|\Phi_+\rangle` vía :math:`\text{CX} (H\otimes I) |00\rangle`.
fr: Nous construisons un état Bell :math:`|\Phi_+\rangle` via :math:`\text{CX} (H\otimes I) |00\rangle`.
ja_jp: :math:`\text{CX} (H\otimes I) |00\rangle` を用いて、ベル状態 :math:`|\Phi_+\rangle` を構築します。
ko_kr: :math:`\text{CX} (H\otimes I) |00\rangle` 를 통해 Bell 상태 :math:`|\Phi_+\rangle` 를 구축한다.
pt_un: Nós construímos o estado de Bell :math:`|\Phi_+\rangle` através de :math:`\text{CX} (H\otimes I) |00\rangle`.
ta: நாங்கள் ஒரு பெல் நிலையை உருவாக்குகிறோம் :math:`|\Phi_+\rangle` via :math:`\text{CX} (H\otimes I) |00\rangle`.
tr: :math:`\text{CX} (H\otimes I) |00\rangle`. yoluyla bir :math:`|\Phi_+\rangle` Bell durumunu oluşturuyoruz.

source: Here is the expression :math:`H e^{-iHt} |\Phi_+\rangle`.
bn_bn: যার গাণিতিক প্রকাশভঙ্গী :math:`H e^{-iHt} |\Phi_+\rangle`.
es_un: Esta es la expresión :math:`H e^{-iHt} |\Phi_+\rangle`.
fr: Voici l'expression :math:`H e^{-iHt} |\Phi_+\rangle`.
ja_jp: 次は、 :math:`H e^{-iHt} |\Phi_+\rangle` の式です。
ko_kr: 여기서는 :math:`H e^{-iHt} |\Phi_+\rangle` 표현이 있다.
pt_un: Aqui está a expressão :math:`H e^{-iHt} |\Phi_+\rangle`.
ta: இங்கே வெளிப்பாடு :math:`H e^{-iHt} |\Phi_+\rangle`.
tr: İfade şu şekildedir: :math:`H e^{-iHt} |\Phi_+\rangle`.

source: Typically, we want to approximate :math:`e^{-iHt}` using two-qubit gates. We achieve this with the ``convert`` method of ``PauliTrotterEvolution``, which traverses expressions applying trotterization to all ``EvolvedOp``\ s encountered. Although we use ``PauliTrotterEvolution`` here, there are other possibilities, such as ``MatrixEvolution``, which performs the exponentiation exactly.
bn_bn: সাধারণত, আমরা :math:`e^{-iHt}` কে অনুমান করতে চাই দুই-কিউবিট (two-qubit) বর্তনী দিয়ে। আমরা এটা ``convert`` পদ্ধতির ``PauliTrotterEvolution`` দিয়ে করি, যেটা সব ``EvolvedOp`` এর উপর trotterization প্র​য়োগ​ করে।যদিও আমরা এখানে ``PauliTrotterEvolution` ব্যবহার করেছি, অন্য পদ্ধতি যেমন ``MatrixEvolution`` ও এই exponentiation করতে পারে।
es_un: Normalmente, queremos aproximar :math:`e^{-iHt}` usando compuertas de dos qubits. Esto se logra con el método ``convert`` de ``PauliTrotterEvolution``, que recorre expresiones aplicando la trotterización a todos los ``EvolvedOp``\ s encontrados. Aunque utilizamos ``PauliTrotterEvolution`` aquí, hay otras posibilidades, como ``MatrixEvolution``, que realiza la exponenciación exactamente.
fr: Généralement, nous voulons approximer :math:`e^{-iHt}` en utilisant des portes à deux qubits. Nous y parvenons avec la méthode ``convert`` de ``PauliTrotterEvolution``, qui traverse les expressions en appliquant la trotterisation à tous les ``EvolvedOp``\ s rencontrés. Bien que nous utilisions ``PauliTrotterEvolution`` ici, il y a d'autres possibilités, telles que ``MatrixEvolution``, qui effectue l'exponentiation exactement.
ja_jp: 通常、2量子ビットゲートを使用して、 :math:`e^{-iHt}` を近似します。 これは 、出現する全ての ``EvolvedOp`` をトロッター化した式をトラバースする ``PauliTrotterEvolution`` の ``convert`` メソッドによって達成されます。 ここでは ``PauliTrotterEvolution`` を使用していますが、他にも正確に指数化を実行する ``MatrixEvolution`` のような可能性があります。
ko_kr: 대체로 :math:`e^{-iHt}`는 두 큐비트 게이트로 근사된다. 이는 표현들을 오가며 마주한 모든 ``EvolvedOp`` 에 트로터리제이션을 적용하는 ``PauliTrotterEvolution`` 의 ``convert`` 메서드로 얻을 수 있다. 여기서는 ``PauliTrotterEvolution`` 을 사용했지만, 같은 지수화를 수행하는 ``MatrixEvolution`` 과 같은 다양한 방법들도 있다.
pt_un: Normalmente, queremos aproximar :math:`e^{-iHt}` usando portões two-qubit. Conseguimos isso com o método ``convert`` do ``PauliTrotterEvolution``, que analisa expressões aplicando trotterização para todos ``EvolvedOp``\ s encontrados. Embora utilizemos ``PauliTrotterEvolution`` aqui, existem outras possibilidades, como ``MatrixEvolution``, que executa a exponenciação de forma exata.
ta: பொதுவாக, தோராயமாக மதிப்பிட விரும்புகிறோம் :math:`e^{-iHt}` இரண்டு-கியூபிட்டு கேட்களைப் பயன்படுத்துதல். ``PauliTrotterEvolution`` இன் ``convert`` முறையால் இதை நாங்கள் அடைகிறோம், இது எதிர்கொள்ளும் அனைத்து ``EvolvedOp``\ s ட்ரொட்டரைசேஷனைப் பயன்படுத்துவதற்கான வெளிப்பாடுகளைக் கடந்து செல்கிறது. நாம் இங்கே ``PauliTrotterEvolution`` ஐப் பயன்படுத்தினாலும், ``MatrixEvolution`` போன்ற பிற சாத்தியக்கூறுகள் உள்ளன, அவை அதிவேகத்தை சரியாகச் செய்கின்றன.
tr: Normalde, biz iki kübitli kapıları kullanarak :math:`e^{-iHt}` 'ı yaklaştırmak istiyoruz. Bunu bulunan bütün ``EvolvedOp``\ lere trotterizasyonu uygulayarak ifadeleri geçiren ``PauliTrotterEvolution``'nun ``convert`` yöntemiyle elde ediyoruz. buna rağmen biz burada ``PauliTrotterEvolution`` kullanıyoruz, başka seçenekler de var, üs almayı tam olarak gerçekleştiren``MatrixEvolution`` gibi.

source: ``trotterized_op`` contains a ``Parameter``. The ``bind_parameters`` method traverses the expression binding values to parameter names as specified via a ``dict``. In this case, there is only one parameter.
bn_bn: ``trotterized_op``এতে থাকে একটি ``Parameter``, ``bind_parameters``পদ্ধতিটি বন্ধিতমানকে নির্দিষ্ট পরামিতির নামেতে প্রকাশন করতে ``dict`` হয়ে ঘোরে।এইক্ষেত্রে, একটি মাত্রই পরামিতি রয়েছে।
es_un: ``trotterized_op`` contiene un ``Parameter``. El método ``bind_parameters`` recorre los valores de enlace de la expresión a los nombres de los parámetros mediante un ``dict``. En este caso, sólo hay un parámetro.
fr: ``trotterized_op`` contient un ``Parameter``. La méthode ``bind_parameters`` traverse les valeurs de liaison de l'expression aux noms de paramètres comme spécifié via un ``dict``. Dans ce cas, il n'y a qu'un seul paramètre.
ja_jp: ``trotterized_op`` は ``Parameter`` を含んでいます。``bind_parameters`` メソッドは、``dict`` で指定されたパラメータ名をバインドする式をトラバースします。 この場合、パラメータは一つしかありません。
ko_kr: ``trotterized_op`` 는 ``Parameter`` 를 포함하고 있다. ``bind_parameters`` 메서드는 표현을 오가며 ``dict`` 로 지정된 매개변수 이름과 해당하는 값을 바인딩 한다. 여기서는 파라미터가 1개 뿐인 경우이다.
pt_un: ``trotterized_op`` contém um ``Parameter``. O método ``bind_parameters`` percorre a expressão ligando valores para nomes de parâmetro como especificado através da ``dict``. Neste caso, há apenas um parâmetro.
ta: ``trotterized_op`` இல் ``Parameter`` உள்ளது. ``bind_parameters`` முறை, ``dict`` வழியாக குறிப்பிடப்பட்டுள்ளபடி, வெளிப்பாடு பிணைப்பு மதிப்புகளை அளவுரு பெயர்களுக்குச் செல்கிறது. இந்த வழக்கில், ஒரே ஒரு அளவுரு மட்டுமே உள்ளது.
tr: ``trotterized_op`` bir ``Parameter`` 'i içerir. ``bind_parameters`` yöntemi belli bir `dict`` yoluya ifade bağlama değerlerini parametre adlarına geçirir. Bu durumda, tek bir parametre vardır.

source: ``bound`` is a ``ComposedOp``. The second factor is the circuit. Let’s draw it to verify that the binding has taken place.
bn_bn: ``ComposedOp`` হল একটি ``bound``।দ্বিতীয় উৎপাদক হল একটি বর্তনী (সার্কিট)।যে বন্ধনটি ঘটেছে তা যাচাই করার জন্য অঙ্কন করা যাক।
fr: ``bound`` est un ``ComposedOp``. Le second facteur est le circuit. Dessinons-le pour vérifier que la liaison a eu lieu.
ja_jp: ``bound`` は ``ComposedOp`` です。2番目の因子は回路です。バインディングが行われたことを確認するために、描画してみましょう。
ko_kr: ``bound`` 는 ``ComposedOp`` 이다. 두 번째 인자는 회로이다. 바인딩이 되었는지 확인하고자 회로를 그려보자.
pt_un: ``bound`` é um ``ComposedOp``. O segundo fator é o circuito. Vamos desenhá-lo para confirmar que a ligação ocorreu.
ta: ``bound`` என்பது ``ComposedOp``. இரண்டாவது காரணி சர்க்யூட். பிணைப்பு நடந்ததா என்பதை சரிபார்க்க அதை வரைவோம்.
tr: ``bound`` bir ``ComposedOp``'tur. Devrenin ikinci faktörüdür. Bağlanma gerçekleştiğini kanıtlamak için onu çizelim.

source: Expectations
bn_bn: গড় মান
es_un: Valor Esperado
fr: Espérances
ja_jp: 期待値
ko_kr: 기댓값
pt_un: Expectativas
ta: எதிர்பார்ப்புகள்
tr: Beklentiler

source: ``Expectation``\ s are converters that enable the computation of expectation values of observables. They traverse an Operator tree, replacing ``OperatorStateFn``\ s (observables) with equivalent instructions which are more amenable to computation on quantum or classical hardware. For example, if we want to measure the expectation value of an Operator ``o`` expressed as a sum of Paulis with respect to some state function, but can only access diagonal measurements on quantum hardware, we can create an observable ``~StateFn(o)`` and use a ``PauliExpectation`` to convert it to a diagonal measurement and circuit pre-rotations to append to the state.
bn_bn: ``Expectation``\গুলি হল পরিবর্তক (কনভার্টার) যেটা গড় মানের পর্যবেক্ষণযোগ্য বা দৃষ্টিগ্রাহ্য (অবজারভেবল) মান গণনা চালু করে। তারা একটি অপারেটর ট্রিকে অতিক্রম করে,``OperatorStateFn``\(অবজারভেবল) গুলিকে সমতূল্য নির্দেশনা দিয়ে বদলে দেয় যা কোয়ান্টাম বা ধ্রুপদী (ক্লাসিক্যাল) হার্ডওয়্যারের উপর গণনা আরো সুবিধাজনক।উদাহরণ স্বরূপ, যদি আমরা একটি অপারেটর ``o``এর গড় মানের মানকে এমনভাবে পরিমাপ করতে চাই যাতে তা একটি পাওলির সমষ্টি বোঝায় কোনো ফাংশনমান বা অবস্থার সাপেক্ষে, কিন্তু একমাত্র কোয়ান্টাম হার্ডওয়্যারের কর্ণ বরাবর পরিমাপ করার প্রবেশাধিকার রয়েছে, আমরা তৈরী করতে পারি একটি পর্যবেক্ষণযোগ্য ``~StateFn(o)``এবং একটি ``PauliExpectation`` কে ব্যবহার করে কর্ণ বরাবর পরিমাপেতে এবংবর্তনী (সার্কিট) কে প্রাক-ঘূর্ণন মান বা অবস্থাতে যোগ করার জন্য।
es_un: ``Expectation``\ s son conversores que permiten el cálculo de los valores esperados de observables. Recorren un árbol de operadores, reemplazando ``OperatorStateFn``\ s (observables) con instrucciones equivalentes que son más susceptibles a la computación en hardware cuántico o clásico. Por ejemplo, si queremos medir el valor esperado de un Operador ``o`` expresado como una suma de Paulis con respecto a alguna función de estado, pero solo puede acceder a mediciones diagonales en hardware cuántico, podemos crear un observable ``~StateFn(o)`` y usar una ``PauliExpectation`` para convertirlo en una medición diagonal y pre-rotaciones de circuito para añadirlo al estado.
fr: Les ``Expectation``\ s sont des convertisseurs qui permettent le calcul des valeurs attendues des observables. Ils traversent une arborescence de Operator, remplaçant les ``OperatorStateFn``\ s (observables) par des instructions équivalentes qui sont plus aptes au calcul sur le matériel quantique ou classique. Par exemple, si nous voulons mesurer la valeur attendue d'un Operator ``o`` exprimé en somme de Paulis par rapport à une fonction d'état, mais que nous ne pouvons accéder qu'aux mesures diagonales sur le matériel quantique, nous pouvons créer un observable ``~StateFn(o)`` et utiliser une ``PauliExpectation`` pour le convertir en une mesure diagonale et des pré-rotations de circuit à ajouter à l'état.
ja_jp: ``Expectation`` は、観測量の期待値の計算を可能にするコンバーターです。 これらは ``OperatorStateFn`` (観測量) を、量子ハードウェアや古典ハードウェア上の計算により適している等価な命令に置き換えるよう、Operator構造をトラバースします。 例えば、 ある状態関数に対するパウリ行列の合計として表現されたOperator ``o`` の期待値を測定したいけれど、量子ハードウェア上の対角化された測定にしかアクセスできない場合、 観測可能な ``~StateFn(o)`` を作成し ``PauliExpectation`` を使用して、対角化測定と状態に追加する回路のプリローテーションに変換します。
ko_kr: ``Expectation``\ 들은 관측가능량들의 기댓값을 계산할 수 있는 변환기이다. 이들은 연산자 트리를 오가며 ``OperatorStateFn``\ 들(관측가능량)을 양자 혹은 고전 하드웨어에서의 계산에 적합하도록 동등한 명령어로 대체한다. 예를 들어서, 어떤 상태 함수에 대한 Pauli 연산자들의 합으로 표현된 연산자 ``o`` 의 기댓값을 측정하고 싶다면, 양자 하드웨어에서는 오직 대각 성분 측정에만 접근할 수 있으므로, 관측가능량 ``~StateFn(o)`` 을 생성하고 ``PauliExpectation`` 을 사용하여 그것을 대각 성분 측정으로 변환하고 회전 전 회로를 상태에 추가할 수 있다.
pt_un: ``Expectation``\ s são conversores que permitem o cálculo dos valores probabilísticos esperados de observáveis. Eles percorrem uma árvore do Operador, substituindo ``OperatorStateFn``\ s (observáveis) por instruções equivalentes que são mais fáceis de calcular em hardware quântico ou clássico. Por exemplo, se quisermos medir o valor esperado de um Operador ``o`` expresso como uma soma de Paulis em relação a alguma função de estado, mas só podemos acessar medições diagonais em hardware quântico, nós podemos criar um ``~StateFn(o)`` e usar um ``PauliExpectation`` para convertê-lo em medições diagonais e pré-rotações de circuito para anexar ao estado.
ta: ``Expectation``\ s மாற்றக்கூடியவை, அவை அவதானிக்கக்கூடியவர்களின் எதிர்பார்ப்பு மதிப்புகளைக் கணக்கிட உதவும். அவை ஒரு ஆபரேட்டர் மரத்தில் பயணிக்கின்றன, ``OperatorStateFn``\ s (அவதானிக்கக்கூடியவை) சமமான வழிமுறைகளுடன் குவாண்டம் அல்லது கிளாசிக்கல் வன்பொருளில் கணக்கிடுவதற்கு மிகவும் ஏற்றது. எடுத்துக்காட்டாக, சில மாநில செயல்பாடுகளைப் பொறுத்து Paulis-ன் தொகையாக வெளிப்படுத்தப்பட்ட ஒரு ஆபரேட்டரின் எதிர்பார்ப்பு மதிப்பை அளவிட விரும்பினால், ஆனால் குவாண்டம் வன்பொருளில் மூலைவிட்ட அளவீடுகளை மட்டுமே அணுக முடியும் என்றால், நாம் கவனிக்கத்தக்க ``o`` ஐ உருவாக்க முடியும். ``~StateFn(o)`` மற்றும் ஒரு ``PauliExpectation`` ஐப் பயன்படுத்தி அதை ஒரு மூலைவிட்ட அளவீடு மற்றும் சர்க்யூட்டுக்கு முந்தைய சுழற்சிகளாக மாற்றவும்.
tr: ``Expectation``\ lar gözlemlenebilirlerin beklenti değerlerini hesaplamalarını etkinleştiren dönüştürücülerdir. Bunlar ``OperatorStateFn``\ (gözlemlenebilirler) 'i kuantum veya klasik donanım üzerinde hesaplamaya daha uygun olan eşdeğer hesaplamalarla değiştirerek bir Operatör ağacını geçerler. Örneğin, Bir fonksiyonun durumuna bağlı olarak Pauli operatörlerinin toplanmalarıyla ifade edilen bir ``o`` operatörünün beklenti değerini hesaplamak istiyorsak, ama yalnızca kuantum donanımın üzerindeki çapraz hesaplamalarına erişebilirsek, bir ``~StateFn(o)`` gözlemlenebiliri oluşturup ve onu çapraz bir hesaplamaya ve duruma eklemek devrenin ön rotasyonlarına dönüştürmek için ``PauliExpectation``'u kullanabiliriz.

source: Another interesting ``Expectation`` is the ``AerPauliExpectation``, which converts the observable into a ``CircuitStateFn`` containing a special expectation snapshot instruction which ``Aer`` can execute natively with high performance.
bn_bn: অন্য আরেকটি কৌতূহলোদ্দীপক ``Expectation`` হল ``AerPauliExpectation``, যা পর্যবেক্ষণযোগ্যকে একটি``CircuitStateFn``এতে রূপান্তরিত করে যার মধ্যে একটি নির্দিষ্ট গড় মান স্ন্যাপশট নির্দেশনা যা ``Aer`` উচ্চ কর্মদক্ষতাসহ সপাদন করতে পারে।
es_un: Otra ``Expectation`` interesante es la ``AerPauliExpectation``, que convierte el observable en un ``CircuitStateFn`` que contiene una instrucción especial de una instantánea de un valor esperado que ``Aer`` puede ejecutar nativamente con alto rendimiento.
fr: Une autre ``Expectation`` intéressante est la ``AerPauliExpectation``, qui convertit l'observable en un ``CircuitStateFn`` contenant une instruction intstantanée d'espérance que ``Aer`` peut exécuter nativement avec de hautes performances.
ja_jp: 興味深いもう一つの ``Expectation`` は ``AerPauliExpectation`` です。 これは、期待値を、``Aer`` が高性能でネイティブに実行できる特別な期待値スナップショットの命令を含む ``CircuitStateFn`` に変換します。
ko_kr: 다른 흥미로운 ``Expectation`` 은 ``AerPauliExpectation`` 으로, 관측가능량을 ``Aer`` 이 고성능으로 처리할 수 있는 특별한 기댓값 스냅샷을 가진 ``CircuitStateFn`` 으로 변환한다.
pt_un: Outra ``Expectation`` interessante é a ``AerPauliExpectation``, que converte o observável em um ``CircuitStateFn`` contendo um instantâneo da instrução especial que ``Aer`` pode executar nativamente com alto desempenho.
ta: மற்றொரு சுவாரஸ்யமான ``Expectation`` என்பது ``AerPauliExpectation`` ஆகும், இது கவனிக்கத்தக்கதை ``CircuitStateFn`` ஆக மாற்றுகிறது, இது ஒரு சிறப்பு எதிர்பார்ப்பு ஸ்னாப்ஷாட் அறிவுறுத்தலைக் கொண்டுள்ளது, இது ``Ae`` உயர் செயல்திறனுடன் இயல்பாக இயக்க முடியும்.
tr: Başka ilginç ``Expectation`` bir gözlemlenebiliri ``Aer``in yüksek performansla yerel olarak yürütebileceği özel bir beklenti anlık talimatını içeren ``CircuitStateFn``'e dönüştüren ``AerPauliExpectation``'dır.

source: By default ``group_paulis=True``, which will use the ``AbelianGrouper`` to convert the ``SummedOp`` into groups of mutually qubit-wise commuting Paulis. This reduces circuit execution overhead, as each group can share the same circuit execution.
bn_bn: স্বতঃসিদ্ধ নিয়মানুসারে ``group_paulis=True``, যেটা ``AbelianGrouper`` কে ব্যবহার করে ``SummedOp``কে সমসংখক কিউবিট অনুযায়ী সমসংখক পাউলিদের দলে পরিবর্তিত করে। এটা বর্তনী (সার্কিট) এর চালনার ঊর্ধ্বস্থিতকে কমায়ে, যেমন প্রতিটি দল সমান বর্তনী (সার্কিট) কে ভাগ করে চালনা করতে পারে।
es_un: De forma predeterminada ``group_paulis=True``, que utilizará el ``AbelianGrouper`` para convertir el ``SummedOp`` en grupos de Paulis que conmutan mutuamente a nivel de qubits. Esto reduce la sobrecarga de ejecución del circuito, ya que cada grupo puede compartir la misma ejecución del circuito.
fr: Par défaut ``group_paulis=True``, qui utilisera le ``AbelianGrouper`` pour convertir le ``SummedOp`` en des groupes de Paulis commutant mutuellement sur les qubits. Cela réduit la surcharge d'exécution du circuit, car chaque groupe peut partager le même circuit exécution.
ja_jp: デフォルトの ``group_paulis=True`` では、 ``AbrianGrouper`` を使用して ``SummedOp`` を互いに量子的に可換なパウリのグループに変換します。 これにより、各グループが同じ回路実行を共有できるため、回路の実行オーバーヘッドが低減されます。
ko_kr: 기본값 키워드 ``group_paulis=True`` 는 ``AbelianGrouper`` 를 사용하여 ``SummedOp`` 를 큐비트 단위로 상호 교환 가능한 Pauli 연산자의 모음으로 변환한다. 각각의 모음이 동일한 회로 실행을 공유하므로, 이를 통해 전반적인 회로 실행을 줄일 수 있다.
pt_un: Por padrão o ``group_paulis=True``, que irá utilizar o ``AbelianGrouper`` para converter o ``SummedOp`` em grupos de Paulis mutuamente comutativos qubit-wise. Isto reduz a sobrecarga na execução do circuito, pois cada grupo pode compartilhar a execução do mesmo circuito.
ta: இயல்பாகவே ``group_paulis=True``, இது ``SummedOp`` ஐ பரஸ்பர கியூபிட் வாரியாக பயணிக்கும் பவுலிஸின் குழுக்களாக மாற்ற ``AbelianGrouper`` பயன்படுத்தும். இது சர்க்யூட் செயல்பாட்டை மேல்நோக்கி குறைக்கிறது, ஏனெனில் ஒவ்வொரு குழுவும் ஒரே சர்க்யூட் செயல்பாட்டை பகிர்ந்து கொள்ளலாம்.
tr: ``SummedOp``u karşılıklı olarak kübit-bilge iletişim Pauli gruplarına dönüştürmek için ``AbelianGrouper``ı kullanacak olan varsayılan ``group_paulis=True``. Bu, her grup aynı devre uygulamasını paylaşabildiğinden, devre yürütme ek yükünü azaltır.
