Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/operators/01_operator_flow.po
Languages: bn_bn, es_mx, es_un, fr, ja_jp, ko_kr, pt_un, ta, tr

source: ``combo_fn`` - The function taking a list of complex numbers to an output value which defines how to combine the outputs of the ``oplist`` items. For broadcasting simplicity, this function is defined over NumPy arrays.
es_un: ``combo_fn`` - La función toma una lista de números complejos a un valor de salida que define cómo combinar las salidas de los elementos ``oplist``. Para simplificar la transmisión, esta función se define sobre arreglos NumPy.
fr: ``combo_fn`` - La fonction qui prend une liste de nombres complexes à une valeur de sortie qui définit comment combiner les sorties des éléments ``oplist``. Pour la simplicité de diffusion, cette fonction est définie sur les tableaux NumPy.
ja_jp: ``combo_fn`` - ``oplist`` アイテムの出力を組み合わせる方法を定義する、複素数のリストを出力値に取得する関数。簡単にブロードキャスティングするため、この関数は Numpy 配列で定義されています。
pt_un: ``combo_fn`` - A função leva uma lista de números complexos para um valor de saída que define como combinar as saídas dos itens do ``oplist``. Para simplificar a transmissão, essa função é definida em arrays NumPy.
ta: ``combo_fn`` - ``oplist`` உருப்படிகளின் வெளியீடுகளை எவ்வாறு இணைப்பது என்பதை வரையறுக்கும் ஒரு வெளியீட்டு மதிப்புக்குக் கலப்பு எண்களின் பட்டியலை எடுக்கும் செயல்பாடு. ஒளிபரப்பு எளிமைக்காக, இந்தச் செயல்பாடு NumPy வரிசைகளில் வரையறுக்கப்படுகிறது.
tr: ``combo_fn`` - Karmaşık sayılar listesini, ``oplist`` öğelerinin çıktılarının nasıl birleştirileceğini tanımlayan bir çıktı değerine götüren fonksiyon. Yayın kolaylığı için bu fonksiyon NumPy dizileri üzerinden tanımlanır.

source: ``coeff`` - A coefficient multiplying the primitive. Note that ``coeff`` can be int, float, complex or a free ``Parameter`` object (from ``qiskit.circuit`` in Terra) to be bound later using ``my_op.bind_parameters``.
es_un: ``coeff`` - Un coeficiente que multiplica la primitiva. Ten en cuenta que ``coeff`` puede ser int, float, complex o un objeto ``Parameter`` libre (de ``qiskit.circuit`` en Terra) para ser vinculado más tarde usando ``my_op.bind_parameters``.
fr: ``coeff`` - Un coefficient multiplicateur de la primitive. Notez que ``coeff`` peut être int, float, complexe ou un objet ``Parameter`` libre (à partir de ``qiskit. ircuit`` dans Terra) pour être lié plus tard en utilisant ``my_op.bind_parameters``.
ja_jp: ``coeff`` - プリミティブを掛ける係数。 ``coeff`` は int, float, complex or free ``Parameter`` オブジェクト ( ``qiskit.circuit`` から) になることに注意してください。 ``my_op.bind_parameters`` を使って後にバインドされます。
pt_un: ``coeff`` - Um coeficiente que multiplica o primitivo. Note que ``coeff`` pode ser int, float, complex ou um objeto ``Parameter`` livre (do ``qiskit.circuit`` no Terra) para ser vinculado posteriormente usando ``my_op.bind_parameters``.
ta: ``coeff`` - பழமையானதைப் பெருக்கும் குணகம். ``coeff`` int, float, complex அல்லது இலவச ``Parameter`` பொருளாக இருக்கலாம் (Terra இல் ``qiskit.circuit`` இலிருந்து) பின்னர் ``my_op.bind_parameters`` ஐப் பயன்படுத்தி பிணைக்கப்படும்.
tr: ``coeff`` - Temel öğeyi çarpan bir katsayı. ``coeff``'in int, float, karmaşık veya serbest bir ``Parameter`` nesnesi (Terra'daki ``qiskit.circuit``'ten) olabileceğini ve daha sonra ``my_op.bind_parameters`` kullanılarak bağlanabileceğini unutmayın.

source: ``abelian`` - Indicates whether the Operators in ``oplist`` are known to mutually commute (usually set after being converted by the ``AbelianGrouper`` converter).
es_un: ``abelian`` - Indica si se sabe que los operadores en ``oplist`` conmutan mutuamente (generalmente se establece después de ser transformado por el convertidor ``AbelianGrouper``).
fr: ``abelian`` - Indique si les Opérateurs de ``oplist`` sont connus pour être mutuellement commutés (généralement définis après avoir été convertis par le convertisseur ``AbelianGrouper``).
ja_jp: ``abelian`` - ``oplist`` の演算子が相互変換することが知られているかどうかを示します(通常は ``AbrianGrouper`` コンバータによって変換された後に設定されます)。
pt_un: ``abelian`` - Indica se os Operadores em ``oplist`` são conhecidos por comutarem mutuamente (geralmente definidos após serem convertidos pelo conversor ``AbelianGrouper``).
ta: ``abelian`` - ``oplist`` இல் உள்ள ஆபரேட்டர்கள் பரஸ்பரம் பயணிக்கத் தெரிந்தவர்களா என்பதைக் குறிக்கிறது (பொதுவாக ``AbelianGrouper`` மாற்றிமூலம் மாற்றப்பட்ட பிறகு அமைக்கப்படும்).
tr: ``abelian`` - ``oplist`` içindeki operatörlerin birbirinin yerine kullanılabilirliğinin bilinip bilinmediğini belirtir (genellikle ``AbelianGrouper`` dönüştürücü tarafından dönüştürüldükten sonra ayarlanır).

source: Note that ``ListOp`` supports typical sequence overloads, so you can use indexing like ``my_op[4]`` to access the ``OperatorBase``\ s in ``oplist``.
es_un: Ten en cuenta que ``ListOp`` soporta sobrecargas de secuencia típicas, así que puedes usar indexación como ``my_op[4]`` para acceder a la ``OperatorBase`` en ``oplist``.
fr: Notez que ``ListOp`` supporte les surcharges de séquences typiques, donc vous pouvez utiliser l'indexation comme ``my_op[4]`` pour accéder aux ``OperatorBase``\ s dans ``oplist``.
ja_jp: ``ListOp`` は、典型的なイテレーターのオーバーロードをサポートしているので、``my_op[4]`` のように添字を使って、``oplist`` 中の ``OperatorBase`` にアクセスすることができます。
pt_un: Observe que ``ListOp`` suporta sobrecargas de sequência típicas, então você pode usar indexação como ``my_op[4]`` para acessar o ``OperatorBase``\ s em ``oplist``.
ta: ``ListOp`` வழக்கமான வரிசை ஓவர்லோடுகளை ஆதரிக்கிறது, எனவே ``oplist`` இல் ``OperatorBase``\ களை அணுக ``my_op[4]`` போன்ற அட்டவணையைப் பயன்படுத்தலாம்.
tr: ``ListOp``'un tipik sıralama aşırı yüklemelerini desteklediğine dikkat edin, o yüzden ``oplist``'te olan ``OperatorBase``\ 'lere erişebilmek için ``my_op[4]`` gibi bir indeksleme kullanabilirsin.

source: We mentioned above that ``OperatorStateFn`` represents a density operator. But, if the ``is_measurement`` flag is ``True``, then ``OperatorStateFn`` represents an observable. The expectation value of this observable can then be constructed via ``ComposedOp``. Or, directly, using ``eval``. Recall that the ``is_measurement`` flag (property) is set via the ``adjoint`` method.
bn_bn: পুর্বে বর্ণিত হয়েছে ``OperatorStateFn`` একটি ডেনসিটি কার্যকারক নির্দেশ করে। কিন্তু যদি ``is_measurement`` নির্দেশনা ``True`` হয় সেইক্ষেত্রে ``OperatorStateFn`` একটি কার্যকারক হিসেবে কাজ করে। এই কার্যকারকের গড় মান ``ComposedOp`` দ্বারা তৈরি করা যায়। অথবা সরাসরি ``eval`` পদ্ধতি দ্বারা একই গড় মান নির্ণয় করা যাবে। বিশেষভাবে লক্ষণীয় যে, ``is_measurement`` নির্দেশনা একটি ``adjoint`` পদ্ধতি দ্বারা নির্ণয় করা যায়।
es_un: Se ha mencionado anteriormente que ``OperatorStateFn`` representa un operador de densidad. Pero, si la bandera ``is_measurement`` es ``True``, entonces ``OperatorStateFn`` representa un observable. El valor esperado de este observable puede construirse a través de ``ComposedOp``. O, directamente, utilizando ``eval``. Recuerda que la bandera (propiedad) ``is_measurement`` se establece mediante el método ``adjoint``.
fr: Nous avons mentionné ci-dessus que ``OperatorStateFn`` représente un opérateur de densité. Mais si le flag ``is_measurement`` est ``True``, alors ``OperatorStateFn`` représente un observable. La valeur attendue de cette observable peut alors être construite via ``ComposedOp``. Ou directement, en utilisant ``eval``. Rappelez-vous que le flag ``is_measurement`` (property) est défini via la méthode ``adjoint``.
ja_jp: 前述のように ``OperatorStateFn`` は密度演算子を表していますが、``is_measurement`` フラグが ``True`` の場合、``OperatorStateFn`` は 観測量を表します。 この観測量の期待値は ``ComposedOp`` を用いて構築することもできます。または、直接 ``eval`` を使用して構築することもできます。 ``is_measurement`` フラグ(プロパティ) が ``adjoint`` メソッドで設定されることを思い出してください。
ko_kr: 위에서 ``OperatorStateFn`` 은 밀도 연산자를 나타낸다고 했다. 그러나 ``is_measurement`` 플래그가 ``True`` 일 경우, ``OperatorStateFn`` 은 관측가능량을 나타낸다. 이 관측가능량의 기댓값은 ``ComposedOp`` 를 통해 만들 수 있다. 또는 ``eval`` 을 직접 이용할 수도 있다. ``is_measurement`` 플래그(특성)는 ``adjoint`` 매서드로 설정된다는 것을 기억하라.
pt_un: Nós mencionamos acima que ``OperatorStateFn`` representa um operador de densidade. Mas, se a medição ``is_measurement`` é ``True``, então ``OperatorStateFn`` representa um observável. O valor esperado deste observável pode então ser construído através de ``ComposedOp``. Ou, diretamente, usando ``eval``. Lembre que a medição ``is_measurement`` (propriedade) é definida através do método ``adjoint``.
ta: ``OperatorStateFn`` ஒரு அடர்த்தி ஆபரேட்டரைக் குறிக்கிறது என்பதை நாங்கள் மேலே குறிப்பிட்டோம். ஆனால், ``is_measurement`` flag ``True`` எனில், ``OperatorStateFn`` என்பது கவனிக்கத்தக்கதைக் குறிக்கிறது. இந்த அனுசரிப்புக்கான எதிர்பார்ப்பு மதிப்பு பின்னர் ``ComposedOp`` வழியாக உருவாக்கப்படலாம். அல்லது, நேரடியாக, ``eval`` ஐப் பயன்படுத்துதல். ``adjoint`` முறை வழியாக ``is_measurement`` flag (property) அமைக்கப்பட்டுள்ளது என்பதை நினைவில் கொள்க.
tr: Yukarıda ``OperatorStateFn`` nun bir yoğunluk operatörünü temsil ettiğini söylemiştik. Ama eğer ``is_measurement`` bayrağı ``True`` ise, o zaman, ``OperatorStateFn`` gözlemlenebiliri temsil etmektedir. Bu gözlemlenebilirin beklenti değeri o takdirde, ``ComposedOp`` yoluyla veya ``eval`` 'ı doğru doğruya kullanarak oluşturulabilir. ``is_measurement`` bayrağını (özelliğini) ``adjoint`` yöntemiyle kurulduğunu hatırla.

source: Here we construct the observable corresponding to the Pauli :math:`Z` operator. Note that when printing, it is called ``OperatorMeasurement``.
bn_bn: এইখানে পাউলী :math:`Z` কার্যকারক দ্বারা সংশ্লিষ্ট পর্যবেক্ষনসমূহ তৈরি প্রক্রিয়া দেখানো হবে। বিশেষ লক্ষণীয় যে, যখন কার্যকারকটি সম্পাদিত হবে তখন তাকে বলা হবে ``OperatorMeasurement``।
es_un: Aquí construimos el observable correspondiente al operador de Pauli :math:`Z`. Ten en cuenta que al imprimirlo, se le llama ``OperatorMeasurement``.
fr: Ici nous construisons l'observable correspondant à l'opérateur Pauli :math:`Z`. Notez que lors de l'impression, il est appelé ``OperatorMeasurement``.
ja_jp: ここでは、 パウリ :math:`Z` 演算子に対応する観測量を構築します。 出力時には、``OperatorMeasurement`` と呼ばれることに注意してください。
ko_kr: 여기서는 Pauli :math:`Z` 연산자에 해당하는 관측가능량을 구성한다. 프린트를 할 때는 ``OperatorMeasurement`` 로 불리는 것을 주의하라.
pt_un: Aqui construímos o observável correspondente ao operador Pauli :math:`Z`. Observe que, ao imprimir, ele é chamado de ``OperatorMeasurement``.
ta: Pauli :math:`Z` ஆபரேட்டருக்கு ஒத்ததாகக் காணக்கூடியதை இங்கே உருவாக்குகிறோம். அச்சிடும் போது, ​​அது ``OperatorMeasurement`` என்று அழைக்கப்படுகிறது என்பதை நினைவில் கொள்க.
tr: Burada Pauli :math:`Z` operatörüne ait bir gözlemlenebiliri oluşturuyoruz. Onu görüntülediğimizde ``OperatorMeasurement`` diye adlandırıldığına fark et.

source: Here, we compute :math:`\langle 0 | Z | 0 \rangle`, :math:`\langle 1 | Z | 1 \rangle`, and :math:`\langle + | Z | + \rangle`, where :math:`|+\rangle = (|0\rangle + |1\rangle)/\sqrt{2}`.
bn_bn: এখন আমরা :math:`\langle 0 | Z | 0 \rangle`, :math:`\langle 1 | Z | 1 \rangle` এবং :math:`\langle + | Z | + \rangle` গণনা করব, যেখানে :math:`|+\rangle = (|0\rangle + |1\rangle)/\sqrt{2}`।
es_un: Aquí calculamos :math:`\langle 0 | Z | 0 \rangle`, :math:`\langle 1 | Z | 1 \rangle`, y :math:`\langle + | Z | + \rangle`, donde :math:`|+\rangle = (|0\rangle + |1\rangle)/\sqrt{2}`.
fr: Ici, nous calculons :math:`\langle 0 | Z | 0 \rangle`, :math:`\langle 1 | Z | 1 \rangle`, and :math:`\langle + | Z | + \rangle`, where :math:`|+\rangle = (|0\rangle + |1\rangle)/\sqrt{2}`.
ja_jp: ここでは、:math:`\langle 0 | Z | 0 \rangle`と :math:`\langle 1 | Z | 1 \rangle`、:math:`\langle + | Z | + \rangle` を計算します。ここで、:math:`|+\rangle = (|0\rangle + |1\rangle)/\sqrt{2}` です。
ko_kr: 이번에는 :math:`\langle 0 | Z | 0 \rangle`, :math:`\langle 1 | Z | 1 \rangle`, 그리고 :math:`\langle + | Z | + \rangle` 를 계산할 것이다. 이 때 :math:`|+\rangle = (|0\rangle + |1\rangle)/\sqrt{2}` 이다.
pt_un: Aqui, calculamos :math:`\langle 0 | Z | 0 \rangle`, :math:`\langle 1 | Z | 1 \rangle`, e :math:`\langle + | Z | + \rangle`, onde :math:`|+\rangle = (|0\rangle + |1\rangle)/\sqrt{2}`.
ta: இங்கே, நாம் :math:`\langle 0 | Z | 0 \rangle`, :math:`\langle 1 | Z | 1 \rangle`, மற்றும் :math:`\langle + | Z | + \rangle` கணக்கிடுகிறோம், இதில் :math:`|+\rangle = (|0\rangle + |1\rangle)/\sqrt{2}`.
tr: Burada biz :math:`|+\rangle = (|0\rangle + |1\rangle)/\sqrt{2}` olduğu yerde, :math:`\langle 0 | Z | 0 \rangle`, :math:`\langle 1 | Z | 1 \rangle` ve :math:`\langle + | Z | + \rangle`.

source: Part IV: Converters
bn_bn: চতুর্থাংশঃ রূপান্তরক
es_un: Parte IV: Conversores
fr: Partie IV : Convertisseurs
ja_jp: パートIV: コンバーター
ko_kr: 파트 IV: 변환기 (Converters)
pt_un: Parte IV: Conversores
ta: பகுதி IV: மாற்றிகள்
tr: Bölüm IV: Dönüştürücüler

source: Converters are classes that manipulate operators and states and perform building blocks of algorithms. Examples include changing the basis of operators and Trotterization. Converters traverse an expression and perform a particular manipulation or replacement, defined by the converter’s ``convert()`` method, of the Operators within. Typically, if a converter encounters an ``OperatorBase`` in the recursion which is irrelevant to its conversion purpose, that ``OperatorBase`` is left unchanged.
bn_bn: রূপান্তরক হচ্ছে বিশেষ শ্রেণী যা কার্যকারক এবং দশাসমূর উপর প্রায়োগিক ব্যবহার আছে এবং এই রূপান্তরকসমূহ ধারাক্রমের মূল ভিত্তি হিসেবে কাজ করে। উদাহরণস্বরূপ বেসিস কার্যকারকের পরিবর্তন এবং ট্রটারাইজেশন। রূপান্তরের প্রকাশ প্রক্রিয়া এবং সম্পাদন প্রক্রিয়া ``convert()`` প্রক্রিয়া দ্বারা সংজ্ঞায়িত করা হয়। সাধারণত, যদি রুপান্তরকসমূহ ``OperatorBase`` একটি প্রত্যাবর্তী প্রক্রিয়া মেনে চলে যা রূপান্তরক প্রক্রিয়ার সাথে অপ্রাসঙ্গিক কারণ এতে ``OperatorBase`` অপরিবর্তিত থাকে।
fr: Les convertisseurs sont des classes qui manipulent les opérateurs et les états et exécutent des blocs de construction d'algorithmes. Par exemple, modifier la base des opérateurs et de Trotterisation. Les convertisseurs traversent une expression et effectuent une manipulation ou un remplacement particuliers, définis par la méthode ``convert()`` du convertisseur, des Opérateurs à l'intérieur. Typiquement, si un convertisseur rencontre une ``OperatorBase`` dans la récursion qui n'est pas pertinente à son but de conversion, que ``OperatorBase`` est laissé inchangé.
ja_jp: コンバーターは、演算子と状態を操作し、アルゴリズムの構成要素を実行するクラスです。例えば、演算子とトロッター化の基底を変更することなどがあります。 コンバーターは式をトラバースし、演算子内のコンバーターの ``convert()`` メソッドによって定義された特定の操作または置き換えを実行します。 通常、コンバーターが `変換目的とは関係のない再帰中に`OperatorBase`` に遭遇した場合、``OperatorBase`` は変更されません。
ko_kr: 변환기는 연산자 및 상태들을 조작하고 알고리즘의 빌딩 블록을 수행하는 클래스이다. 예로는 연산자나 트로터리제이션(Trotterization)의 기저를 변경하는 것이 있다. 변환기는 표현식을 순회하고 변환기의 ``convert()`` 메서드로 정의된 특정 조작 또는 대체를 수행한다. 일반적으로 변환기가가 변환 목적이 아닌 재귀에서 ``OperatorBase`` 를 만나면 ``OperatorBase`` 는 변하지 않고 남는다.
pt_un: Conversores são classes que manipulam operadores e estados e executam blocos de construção de algoritmos. Exemplos incluem mudar a base dos operadores e Trotterização. Conversores examinam uma expressão e executam uma determinada manipulação ou substituição, definida pelo método ``convert()`` do conversor, dos Operadores internos. Normalmente, se um conversor encontra um ``OperatorBase`` na recursão que é irrelevante para o seu propósito de conversão, o ``OperatorBase`` é deixado inalterado.
ta: மாற்றிகள் ஆபரேட்டர்கள் மற்றும் நிலைகளை கையாளும் மற்றும் வழிமுறைகளின் கட்டுமானத் தொகுதிகளைச் செய்யும் வகுப்புகள். எடுத்துக்காட்டுகள் ஆபரேட்டர்களின் அடிப்படையை மாற்றுவது மற்றும் ட்ரொட்டரைசேஷன் ஆகியவை அடங்கும். மாற்றிகள் ஒரு வெளிப்பாட்டைக் கடந்து, ஒரு குறிப்பிட்ட கையாளுதல் அல்லது மாற்றீட்டைச் செய்கின்றன, இது மாற்றியின் ``convert()`` முறையால் வரையறுக்கப்படுகிறது. பொதுவாக, ஒரு மாற்றி அதன் மாற்ற நோக்கத்திற்கு பொருத்தமற்ற மறுநிகழ்வில் ``OperatorBase`` ஐ எதிர்கொண்டால், அந்த ``OperatorBase`` மாறாமல் இருக்கும்.
tr: Dönüştürücüler, operatörleri ve durumları manipüle eden, algoritmaların inşa bloklarını çalıştıran sınıflardır. Bazı örnekler operatörlerin bazlarını ve trotterizasyonun değiştirmesini içeriyor. Dönüştürücüler bir ifadeyi geçirir ve ``convert()`` dönüştürücü yöntemiyle tanımlanan içindeki operatörlerine belirli bir manipülasyonu ve yer değiştirmeyi gerçekleştirir. Normalde, eğer bir dönüştürücü, özyinelemede dönüştürme amacı ile ilgisi olmayan bir ``OperatorBase`` ile karşılaşırsa, o ``OperatorBase`` değiştirilmez.

source: Evolutions, ``exp_i()``, and the ``EvolvedOp``
bn_bn: পরিবর্তন, ``exp_i()``, এবং ``EvolvedOp``
es_un: Evoluciones, ``exp_i()``, y ``EvolvedOp``
fr: Evolutions, ``exp_i()`` et le ``EvolvedOp``
ja_jp: 時間発展と ``exp_i()`` 、 ``EvolvedOp``
ko_kr: 시간 변화, ``exp_i()``, 그리고 ``EvolvedOp``
pt_un: Evoluções, ``exp_i()``, e o ``EvolvedOp``
ta: பரிணாமங்கள், ``exp_i ()``, மற்றும் ``EvolvedOp``
tr: Evrimler, ``exp_i()`` ve ``EvolvedOp``

source: Every ``PrimitiveOp`` and ``ListOp`` has an ``.exp_i()`` function such that ``H.exp_i()`` corresponds to :math:`e^{-iH}`. In practice, only a few of these Operators have an efficiently computable exponentiation (such as MatrixOp and the PauliOps with only one non-identity single-qubit Pauli), so we need to return a placeholder, or symbolic representation, (similar to how ``SummedOp`` is a placeholder when we can’t perform addition). This placeholder is called ``EvolvedOp``, and it holds the ``OperatorBase`` to be exponentiated in its ``.primitive`` property.
bn_bn: প্রত্যেক ``PrimitiveOp`` এবং ``ListOp`` এর একটি ``.exp_i()`` অন্বয় আছে যেখানে ``H.exp_i()`` নির্দেশ করে :math:`e^{-iH}`। এই ক্ষেত্রে অল্প কিছু কার্যকারক খুবই দক্ষতার সাথে সূচকীয় হারে গণনার কাজ সম্পাদন করে (যেমন MatrixOp এবং PauliOps একটি অ-অভেদক একক কিউবিট পাউলী যুক্তিবর্তনীর উপর কাজ করে), সুতরাং আমাদের একটি সাংকেতিক প্রকাশক দরকার (যা অনেকটা ``SummedOp`` এর মত কারণ তা যোগের কাজ করতে পারে না)। এই প্লেসহোল্ডারকে বলা হয় ``EvolvedOp`` এবং এইটি সূচকীয় ভিত্তিতে ``.primitive`` এবং ``OperatorBase`` এর সাথে সম্পর্ক স্থাপন করে।
fr: Chaque ``PrimitiveOp`` et ``ListOp`` a une fonction ``.exp_i()`` telle que ``H.exp_i()`` correspond à :math:`e^{-iH}`. Dans la pratique, seuls quelques-uns de ces opérateurs disposent d'une exponentiation calculable de manière efficace (comme MatrixOp et PauliOps avec un seul qubit), donc nous avons besoin de retourner un espace réservé, ou une représentation symbolique (similaire à la façon dont ``SummedOp`` est un espace réservé quand nous ne pouvons pas effectuer d'ajout). Ce espace réservé s'appelle ``EvolvedOp``, et il contient la ``OperatorBase`` pour être exponentiée dans sa propriété ``.primitive``.
ja_jp: 全ての ``PrimitiveOp`` と ``ListOp`` は、``H.exp_i()`` が :math:`e^{-iH}` に対応するような ``.exp_i()`` 関数を持ちます。 実際には、効率的に計算可能な指数を持つ演算子は数個しかありません (単位行列ではない単一量子ビットのパウリのみを持つMatrixOp や PauliOpsのように)。 ですから、プレースホルダーや記号表現を返す必要があります (加算できない場合 ``SummedOp`` がプレースホルダーであることに似ています)。 このプレースホルダーは ``EvolvedOp`` と呼ばれ、``.primitive`` プロパティで指数化される ``OperatorBase`` を保持します。
ko_kr: 모든 ``PrimitiveOp`` 와 ``ListOp`` 는 ``.exp_i()`` 함수를 가지고 있고, 여기서 ``H.exp_i()`` 는 :math:`e^{-iH}` 에 해당한다. 실제로 이런 연산자들 중에서 일부만 효과적으로 계산할 수 있는 지수를 가지기 때문에 (MatrixOp나 단위 행렬이 아닌 단일 큐비트 Pauli를 가진 PauliOp와 같은), 임의의 자리나 심볼릭 표현을 반환할 수 있어야 한다 (``SummedOp`` 가 덧셈이 불가능한 경우 임의의 자리로 되는 것과 비슷하게). 이 임의의 자리는 ``EvolvedOp`` 라 불리며 ``OperatorBase`` 를 ``.primitive`` 속성이 지수가 되도록 가지고 있다.
pt_un: Todo ``PrimitiveOp`` e ``ListOp`` tem uma função ``.exp_i()`` tal que ``H.exp_i()`` corresponde a :math:`e^{-iH}`. Na prática, apenas alguns desses Operadores têm uma exponenciação computável eficientemente (como a MatrixOp e os PauliOps com apenas um único single-qubit Pauli não-identidade), por isso precisamos retornar um parâmetro provisório, ou representação simbólica, (semelhante a como ``SummedOp`` é um resultado representativo para quando não podemos realizar adição). Este marcador é chamado ``EvolvedOp`` e contém a ``OperatorBase`` a ser exponenciada em sua propriedade ``.primitive``.
ta: ஒவ்வொரு ``PrimitiveOp`` மற்றும் ``ListOp`` ஆகியவற்றுக்கு ``.exp_i()`` செயல்பாடு உள்ளது, அதாவது ``H.exp_i()`` இதற்கு ஒத்திருக்கிறது :math:`e^{-iH}`. நடைமுறையில், இந்த ஆபரேட்டர்களில் சிலருக்கு மட்டுமே திறமையாக கணக்கிடக்கூடிய அதிவேகத்தன்மை உள்ளது (MatrixOp மற்றும் PauliOps போன்றவை ஒரே அடையாளமில்லாத ஒற்றை-கியூபிட் Pauli மட்டுமே), எனவே நாம் ஒரு ஒதுக்கிடத்தை அல்லது குறியீட்டு பிரதிநிதித்துவத்தை திருப்பித் தர வேண்டும் (எப்படி எங்களால் கூடுதலாகச் செய்ய முடியாதபோது ``SummedOp`` என்பது ஒரு ஒதுக்கிடமாகும்). இந்த ஒதுக்கிடத்தை ``EvolvedOp`` என்று அழைக்கப்படுகிறது, மேலும் இது ``OperatorBase`` ஐ அதன் ``.primitive`` சொத்தில் அதிவேகப்படுத்த வேண்டும்.
tr: Her ``PrimitiveOp`` ve ``ListOp`` :math:`e^{-iH}` ye ait olan ``H.exp_i()`` bir ``.exp_i()`` fonksiyonuna sahiptir. Uygulamada, bu operatörlerden sadece birkaçı (MatrixOp ve tek bir birim-olmayan tek kübitli Pauli ile PauliOps gibi) verimli bir şekilde hesaplanabilir üs alma özelliğine sahiptir; Bu nedenle bir yer tutucuyu veya (``SummedOp`` toplama yapamadığımız zamanlarda bir yer tutucu olduğu gibi) bir simgesel temsilini geri almak gerekir. Bu yer tutucu ``EvolvedOp`` diye adlandırılır ve ``.primitive`` özelliğinde üslenecek olan ``OperatorBase`` tutarını tutar.

source: Qiskit operators fully support parameterization, so we can use a ``Parameter`` for our evolution time here. Notice that there’s no “evolution time” argument in any function. The Operator flow exponentiates whatever operator we tell it to, and if we choose to multiply the operator by an evolution time, :math:`e^{-iHt}`, that will be reflected in our exponentiation parameters.
bn_bn: কিসকিট(Qiskit)অপারেটরগুলি সম্পূর্ণভাবে পরিমিতিকরণে সাহায্য করে, সেজন্য আমরা একটি ``Parameter``কে আমাদের বিবর্তন সময়ের জন্য এখানে ব্যবহার করতে পারবো। লক্ষ্য করুন যে, এখানে কোনো ফাংশনে কোনো “evolution time”আর্গুমেন্ট নেই। অপারেটর প্রবাহটি যে কোনও অপারেটরকেই প্রকাশ করে যাকেই আমরা এটিকে করতে বলি, এবং যদি আমরা একটি বিবর্তন সময়ের দ্বারা অপারেটরকে গুণিত করতে বেছে নিয়ি,:math:`e^{-iHt}`,যা আমাদের পরিমিতিদের সজ্জাতে প্রকাশিত হবে।
fr: Les opérateurs Qiskit supportent entièrement le paramétrage, donc nous pouvons utiliser un ``Parameter`` pour notre temps d'évolution ici. Notez qu’il n’y a pas d’argument « temps d’évolution» dans une fonction. Le flux de l'opérateur exponentialise n'importe quel opérateur que nous lui désignons, et si nous choisissons de multiplier l'opérateur par un temps d'évolution, :math:`e^{-iHt}`, ce sera reflété dans nos paramètres d'exponentiation.
ja_jp: Qiskit 演算子はパラメーター化を完全にサポートしているため、ここでは発展時間に ``Parameter`` を使用できます。 どの関数にも「発展時間」引数がないことに注意してください。 どのような演算子でも、指数パラメーターに反映される発展時間 :math:`e^{-iHt}` を演算子にかけることを選択した場合、Operator flowは指数関数に取ります。
ko_kr: Qiskit 연산자는 완전한 매개변수화를 지원하므로 여기서는 시간 변화에 ``Parameter`` 를 사용할 수 있다. 함수에 “evolution time” 인자가 없다는 것에 주목하자. 연산자 플로우는 어떤 연산자를 말하건 지수화를 하며, 시간 변화 :math:`e^{-iHt}` 를 곱할 연산자를 선택하면 그것은 지수 매개변수에 반영될 것이다.
pt_un: Operadores Qiskit suportam parametrização integralmente, então podemos usar um ``Parameter`` para o nosso tempo de evolução aqui. Observe que não há nenhum argumento de "tempo de evolução" em qualquer função. O Operador flui exponencialmente seja qual for o operador informado a ele, e se escolhermos multiplicar o operador por um tempo de evolução, :math:`e^{-iHt}`, isso será refletido em nossos parâmetros de exponenciação.
ta: Qiskit ஆபரேட்டர்கள் அளவுருவை முழுமையாக ஆதரிக்கிறார்கள், எனவே இங்குள்ள நமது பரிணாம நேரத்திற்கு ``Parameter`` ஐப் பயன்படுத்தலாம். எந்தவொரு செயல்பாட்டிலும் “evolution time” ஆர்கியுமென்ட் இல்லை என்பதைக் கவனியுங்கள். ஆபரேட்டர் ஓட்டம் நாம் எந்த ஆபரேட்டரிடம் சொன்னாலும் அதை வெளிப்படுத்துகிறது, மேலும் ஒரு ஆபரேட்டரை ஒரு பரிணாம நேரத்தால் பெருக்க நாங்கள் தேர்வுசெய்தால் :math:`e^{-iHt}`, இது எங்கள் அதிவேக அளவுருக்களில் பிரதிபலிக்கும்.
tr: Qiskit operatörleri parametrizasyonu tamamen destekliyor, bu yüzden buradaki zaman evrimiz için bir ``Parameter`` kullanabiliriz. Hiç bir fonksiyonda "zaman evrimi" argüman olmadığına fark et. Operatör akışı, hangi operatörün üslemesini söylüyorsak üsluyor, ve operatörü bir :math:`e^{-iHt}` zaman evrimi ile çarpmak istiyorsak, üs alma parametrelerimize yansıtılacaktır.

source: Weighted sum of Pauli operators
bn_bn: পাউলী কার্যকারকের আবেশিত যোগফল
es_un: Suma ponderada de los operadores de Pauli
fr: Somme pondérée des opérateurs Pauli
ja_jp: パウリ演算子の加重和
ko_kr: Pauli 연산자의 가중합
pt_un: Soma ponderada dos operadores Pauli
ta: Pauli ஆபரேட்டர்களின் எடையுள்ள தொகை
tr: Pauli operatörlerinin ağırlıklı toplamı
