Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/operators/01_operator_flow.po
Languages: bn_bn, es_mx, es_un, fr, ja_jp, ko_kr, pt_un, ta, tr

source: Here, we see that adding two ``DictStateFn``\ s returns an object of the same type. We construct :math:`|0\rangle + |1\rangle`.
bn_bn: দুইটি ``DictStateFn``\ এর যোগ একই রকমের একটি অবজেক্ট ফলাফল হিসেবে দেয়। ফলে আমরা :math:`|0\rangle + |1\rangle` প্রস্তুত করতে পারি।.
es_mx: Aquí vemos que al añadir dos ``DictStateFn`` se devuelve un objeto del mismo tipo. Construimos :math:`|0\rangle + |1\rangle`.
es_un: Aquí vemos que al añadir dos ``DictStateFn`` se devuelve un objeto del mismo tipo. Construimos :math:`|0\rangle + |1\rangle`.
fr: Ici, nous voyons que l'ajout de deux ``DictStateFn`` \ s renvoie un objet du même type. Nous construisons :math:` |0\rangle + |1\rangle `.
ja_jp: ここでは、2 つの ``DictStateFn`` を足すと、同じ型のオブジェクトが返されることを見ましょう。 :math:`|0\rangle + |1\rangle` を構築します。
ko_kr: 여기에서는 두 개의 ``DictStateFn`` 을 더하는 것이 동일한 유형의 객체를 반환하는 것을 볼 수 있다: :math:`|0\rangle + |1\rangle`
pt_un: Aqui, vemos que adicionando dois ``DictStateFn``\ s retorna um objeto do mesmo tipo. Construímos :math:`|0\rangle + |1\rangle`.
ta: இங்கே, இரண்டைச் சேர்ப்பதைக் காண்கிறோம் ``DictStateFn``\ s அதே வகை ஒரு ஆப்ஜெக்ட்டை வழங்குகிறது. நாங்கள் :math:`|0\rangle + |1\rangle` கட்டமைக்கிறோம்.
tr: Burada, iki ``DictStateFn``\ s toplayarak aynı türünden olan bir nesneyi geri verdiğini görüyoruz. Biz :math:`|0\rangle + |1\rangle` oluşturuyoruz.

source: Note that you must normalize states by hand. For example, to construct :math:`(|0\rangle + |1\rangle)/\sqrt{2}`, we write
bn_bn: দশার অভিলম্বীকরন (নরমালাইজ) হাতে কলমে করতে হবে। উদাহরণস্বরূপ কোন দশা :math:`(|0\rangle + |1\rangle)/\sqrt{2}` হলে আমরা লিখতে পারি
es_mx: Ten en cuenta que debes normalizar los estados a mano. Por ejemplo, para construir :math:`(|0\rangle + |1\rangle)/\sqrt{2}` escribimos
es_un: Ten en cuenta que debes normalizar los estados a mano. Por ejemplo, para construir :math:`(|0\rangle + |1\rangle)/\sqrt{2}` escribimos
fr: Notez que vous devez normaliser les états à la main. Par exemple, pour construire :math:`(|0\rangle + |1\rangle)/\sqrt{2}`, nous écrivons
ja_jp: 状態を手動で正規化する必要があることに注意してください。例えば、:math:`(|0\rangle + |1\rangle)/\sqrt{2}` を構築するには、次のように記述します。
ko_kr: 상태를 수동으로 정규화해야 하는 것에 유의하라. 예를 들어, :math:`(|0\rangle + |1\rangle)/\sqrt{2}` 를 구성하고자 아래와 같이 작성할 수 있다
pt_un: Observe que você deve normalizar os estados manualmente. Por exemplo, para construir :math:`(|0\rangle + |1\rangle)/\sqrt{2}`, nós escrevemos
ta: நீங்கள் கையால் நிலைகளை இயல்பாக்க வேண்டும் என்பதை நினைவில் கொள்க. உதாரணமாக, :math:`(|0\rangle + |1\rangle)/\sqrt{2}` கட்டமைக்க, நாம் இவ்வாறு எழுதுகிறோம்
tr: Durumları elle normalleştirmen gerektiğine dikkat et. Örneğin, :math:`(|0\rangle + |1\rangle)/\sqrt{2}` oluşturmak için biz şöyle yazıyoruz

source: In other cases, the result is a symbolic representation of a sum. For example, here is a representation of :math:`|+\rangle + |-\rangle`.
bn_bn: অন্যান্য ক্ষেত্রে, দশাকে যোগ সম্বলিত চিহ্নসহ সংকেতায়িত করা হয়। উদাহরণস্বরূপ, একটি দশার সংকেত হচ্ছে :math:`|+\rangle + |-\rangle`.
es_mx: En otros casos, el resultado es una representación simbólica de una suma. Por ejemplo, aquí hay una representación de :math:`|+\rangle + |-\rangle`.
es_un: En otros casos, el resultado es una representación simbólica de una suma. Por ejemplo, aquí hay una representación de :math:`|+\rangle + |-\rangle`.
fr: Dans d'autres cas, le résultat est une représentation symbolique d'une somme. Par exemple, voici une représentation de :math:`|+\rangle + |-\rangle`.
ja_jp: 他の場合では、結果は和の記号表現になります。 例えば、次は :math:`|+\rangle + |-\rangle` の表現です。
ko_kr: 다른 경우에는 결과가 합계의 심볼릭 표현으로 쓰여진다. 예를 들어, :math:`|+\rangle + |-\rangle` 의 표현은 다음과 같다.
pt_un: Em outros casos, o resultado é uma representação simbólica de uma soma. Aqui, por exemplo, está uma representação de :math:`|+\rangle + |-\rangle`.
ta: மற்ற சந்தர்ப்பங்களில், இதன் விளைவாக ஒரு தொகையின் குறியீட்டு பிரதிநிதித்துவம் ஆகும். எடுத்துக்காட்டாக, இங்கே ஒரு பிரதிநிதித்துவம் உள்ளது :math:`|+\rangle + |-\rangle`.
tr: Başka durumlarda, sonuç bir toplamanın sembolik temsilidir. Mesela, burada :math:`|+\rangle + |-\rangle` nın bir temsili var.

source: The composition operator is used to perform an inner product, which by default is held in an unevaluated form. Here is a representation of :math:`\langle 1 | 1 \rangle`.
bn_bn: সমযোজন কার্যকারক (কম্পোজিশন অপারেটর) ইনার গুণন (ইনার প্রডাক্ট) এর কাজে ব্যবহৃত হয়, যা একটি আনইভালুয়েটেড অবস্থা। এইখানে ইনার গুণনের প্রকাশ দেখানো হল :math:`\langle 1 | 1 \rangle`।.
es_un: El operador de composición se utiliza para realizar un producto interno, que de forma predeterminada se mantiene en una forma sin evaluar. Aquí hay una representación de :math:`\langle 1 | 1 \rangle`.
fr: L'opérateur de composition est utilisé pour effectuer un produit intérieur qui, par défaut, est détenu sous une forme non évaluée. Voici une représentation de :math:`\langle 1 | 1 \rangle`.
ja_jp: 合成演算子は、デフォルトでは評価されていない形の内積を計算するのに使用します。次は :math:`\langle 1 | 1 \rangle` の表現です。
ko_kr: 합성 연산자는 내적을 수행할 때 사용될 수 있으며, 내적 값이 계산되지 않은 상태로 초기화된다. :math:`\langle 1 | 1 \rangle` 의 표현은 다음과 같다.
pt_un: O operador composição é usado para realizar um produto interno, que por padrão é mantido em uma forma não calculada. Aqui está uma representação de :math:`\langle 1 | 1 \rangle`.
ta: கலவை ஆபரேட்டர் ஒரு உள் தயாரிப்பைச் செய்யப் பயன்படுகிறது, இது இயல்பாகவே மதிப்பிடப்படாத வடிவத்தில் வைக்கப்படுகிறது. இங்கே ஒரு பிரதிநிதித்துவம் :math:`\langle 1 | 1 \rangle`.
tr: Kompozisyon operatörü, varsayılan olarak değerlendirilmemiş bir biçimde tutulan bir iç çarpımı gerçekleştirmek için kullanılır. Burada bir :math:`\langle 1 | 1 \rangle` temsili gösteriyoruz.

source: Note that the ``is_measurement`` flag causes the (bra) state ``~One`` to be printed ``DictMeasurement``.
bn_bn: লক্ষণীয় যে, ``is_measurement`` ব্রা দশাকে ``~One`` হিসেবে সংকেতায়িত করে, যা ``DictMeasurement`` এ জমা থাকে।.
es_mx: Ten en cuenta que la bandera ``is_measurement`` causa que el estado (bra) ``~One`` sea impreso ``DictMeasurement``.
es_un: Ten en cuenta que la bandera ``is_measurement`` causa que el estado (bra) ``~One`` sea impreso ``DictMeasurement``.
fr: Notez que l'indicateur ``is_measurement`` fait que l'état (bra) ``~ One`` doit être imprimé ``DictMeasurement``.
ja_jp: ``is_measurement`` フラグは、 (ブラ) 状態 ``~One`` に ``DictMeasurement`` を表示させることに注意してください。
ko_kr: ``is_measurement`` 플래그는 (브라) 상태 ``~One`` 이 ``DictMeasurement`` 에 출력되도록 했다.
pt_un: Note que a flag ``is_measurement`` faz com que o estado (bra) ``~One`` seja impresso como ``DictMeasurement``.
ta: ``is_measurement`` flag (bra) நிலையை ``~One`` ஐ ``DictMeasurement`` என அச்சிட காரணமாகிறது என்பதை நினைவில் கொள்க.
tr: ``is_measurement`` bayrağının bra durumu ``~One`` nın ``DictMeasurement`` olarak basılmasının sebep olduğuna dikkat et.

source: Symbolic expressions may be evaluated with the ``eval`` method.
bn_bn: সংকেত সম্বলিত রাশিমালাকে ``eval`` পদ্ধতি দ্বারা পরীক্ষণ করা যাবে।
es_mx: Las expresiones simbólicas pueden ser evaluadas con el método ``eval``.
es_un: Las expresiones simbólicas pueden ser evaluadas con el método ``eval``.
fr: Les expressions symboliques peuvent être évaluées avec la méthode ``eval``.
ja_jp: 記号式は ``eval`` メソッドで評価することができます。
ko_kr: 심볼릭 표현은 ``eval`` 메서드로 값을 구할 수 있다.
pt_un: Expressões simbólicas podem ser calculadas com o método ``eval``.
ta: குறியீட்டு வெளிப்பாடுகள் ``eval`` முறை மூலம் மதிப்பீடு செய்யப்படலாம்.
tr: Sembolik ifadeler ``eval`` yöntemiyle değerlendirilebilirler.

source: Here is :math:`\langle - | 1 \rangle = \langle (\langle 0| - \langle 1|)/\sqrt{2} | 1\rangle`.
bn_bn: এইখানে :math:`\langle - | 1 \rangle = \langle (\langle 0| - \langle 1|)/\sqrt{2} | 1\rangle`।.
es_mx: Aquí se muestra :math:`\langle - | 1 \rangle = \langle (\langle 0| - \langle 1|)/\sqrt{2} | 1\rangle`.
es_un: Aquí se muestra :math:`\langle - | 1 \rangle = \langle (\langle 0| - \langle 1|)/\sqrt{2} | 1\rangle`.
fr: Ici est :math:`\langle - | 1 \rangle = \langle (\langle 0| - \langle 1|)/\sqrt{2} | 1\rangle`.
ja_jp: 次は、:math:`\langle - | 1 \rangle = \langle (\langle 0| - \langle 1|)/\sqrt{2} | 1\rangle` です。
ko_kr: 여기 :math:`\langle - | 1 \rangle = \langle (\langle 0| - \langle 1|)/\sqrt{2} | 1\rangle` 이 있다.
pt_un: Aqui está :math:`\langle - | 1 \rangle = \langle (\langle 0| - \langle 1|)/\sqrt{2} | 1\rangle`.
ta: இங்கே :math:`\langle - | 1 \rangle = \langle (\langle 0| - \langle 1|)/\sqrt{2} | 1\rangle`.
tr: İşte :math:`\langle - | 1 \rangle = \langle (\langle 0| - \langle 1|)/\sqrt{2} | 1\rangle`.

source: The composition operator ``@`` is equivalent to calling the ``compose`` method.
bn_bn: সমযোজন কার্যকারক (কম্পোজিশন অপারেটর) ``@`` ``compose`` পদ্ধতির সমতুল্য।.
es_mx: El operador de composición ``@`` es equivalente a llamar al método ``compose``.
es_un: El operador de composición ``@`` es equivalente a llamar al método ``compose``.
fr: L'opérateur de composition ``@`` est équivalent à l'appel de la méthode ``compose``.
ja_jp: 合成演算子 ``@`` は、``compose`` メソッドを呼び出すのと同等です。
ko_kr: 합성 연산자 ``@`` 는 ``compose`` 메서드를 호출하는 것과 동등하다.
pt_un: O operador composição ``@`` é equivalente a chamar o método ``compose``.
ta: கலவை ஆபரேட்டர் ``@`` என்று அழைப்பதற்கு சமம் ``compose`` முறை.
tr: ``@`` kompozisyon operatörü ``compose`` yöntemi eşdeğerdir.

source: Inner products may also be computed using the ``eval`` method directly, without constructing a ``ComposedOp``.
bn_bn: ইনার গুণন সরাসরি ``eval`` পদ্ধতি দ্বারাও নির্ণয় করা যাবে, ``ComposedOp`` এর ব্যবহার ছাড়াই।
es_mx: Los productos internos también pueden ser evaluados usando el método ``eval`` directamente, sin necesidad de construir un ``ComposedOp``.
es_un: Los productos internos también pueden ser evaluados usando el método ``eval`` directamente, sin necesidad de construir un ``ComposedOp``.
fr: Les produits internes peuvent également être calculés à l'aide de la méthode ``eval`` directement, sans construire de ``ComposedOp``.
ja_jp: 内積は、 ``ComposedOp`` を構築せずに、 ``eval`` メソッドを直接使用して計算することもできます。
ko_kr: 내적은 ``ComposedOp`` 를 통해 구성하지 않고도 ``eval`` 메서드를 통해 바로 계산하는 것도 가능하다.
pt_un: Produtos internos também podem ser calculados usando o método ``eval`` diretamente, sem construir um ``ComposedOp``.
ta: ``ComposedOp`` ஐ உருவாக்காமல், நேரடியாக ``eval`` முறையைப் பயன்படுத்தி உள் தயாரிப்புகளையும் கணக்கிடலாம்.
tr: İç çarpımlar, ``ComposedOp`` oluşturmadan direkt ``eval`` yöntemini kullanarak hesaplanabilirler.

source: Symbolic tensor products are constructed as follows. Here is :math:`|0\rangle \otimes |+\rangle`.
bn_bn: সংকেতায়িত টেনসর গুণন কে নিম্নরুপে প্রস্তুত করা যাবে :math:`|0\rangle \otimes |+\rangle`।.
es_mx: Los productos tensoriales simbólicos se construyen de la siguiente manera. Aquí se muestra :math:`|0\rangle \otimes |+\rangle`.
es_un: Los productos tensoriales simbólicos se construyen de la siguiente manera. Aquí se muestra :math:`|0\rangle \otimes |+\rangle`.
fr: Les produits tensoriels symboliques sont construits comme suit. Voici :math:`|0\rangle \otimes | + \rangle`.
ja_jp: テンソル積の記号は次のように構築されます。次は :math:`|0\rangle \otimes |+\rangle` です。
ko_kr: 심볼릭 텐서 곱은 다음과 같이 만들어질 수 있다. 여기서는 :math:`|0\rangle \otimes |+\rangle` 의 경우이다.
pt_un: Produtos de tensor simbólicos são construídos da seguinte forma. Aqui está :math:`|0\rangle \otimes |+\rangle`.
ta: குறியீட்டு டென்சர் ப்ராடக்ட்கள் பின்வருமாறு கட்டப்பட்டுள்ளன. இங்கே :math:`|0\rangle \otimes |+\rangle`.
tr: Sembolik tensör ürünü gösterilecek şekli üzere oluşturulur. İşte :math:`|0\rangle \otimes |+\rangle`.

source: This may be represented as a simple (not compound) ``CircuitStateFn``.
bn_bn: যা সরল (যৌগিক নয় বা নট কম্পাউন্ড) ``CircuitStateFn`` দ্বারা প্রকাশ করা যাবে।.
es_mx: Esto puede ser representado como un ``CircuitStateFn`` (simple, no compuesto).
es_un: Esto puede ser representado como un ``CircuitStateFn`` simple (no compuesto).
fr: Cela peut être représenté comme un ``CircuitStateFn`` simple (et non pas composé).
ja_jp: これは、シンプルな(複合していない) ``CircuitStateFn`` として表現されています。
ko_kr: 이는 간단한 (합성되지 않은) ``CircuitStateFn`` 로 표현될 수 있다.
pt_un: Isto pode ser representado como um simples (não composto) ``CircuitStateFn``.
ta: இது ஒரு எளிய (கலவை அல்ல) ``CircuitStateFn`` என குறிப்பிடப்படலாம்.
tr: Bu da, (bileşik olmayan) basit bir ``CircuitStateFn`` olarak temsil edilebilir.

source: Tensor powers are constructed using the caret ``^`` as follows. Here are :math:`600 (|11111\rangle + |00000\rangle)`, and :math:`|10\rangle^{\otimes 3}`.
bn_bn: টেনসর শক্তিমাত্রা ``^`` এই ক্যারেট দ্বারা প্রকাশ করা হয়, যেমন :math:`600 (|11111\rangle + |00000\rangle)` এবং :math:`|10\rangle^{\otimes 3}`।.
es_mx: Las potencias tensoriales se construyen utilizando el caret (acento circunflejo) ``^`` de la siguiente manera. Ejemplos: :math:`600 (|11111\rangle + |00000\rangle)`, y :math:`|10\rangle^{\otimes 3}`.
es_un: Las potencias tensoriales se construyen utilizando el caret (acento circunflejo) ``^`` de la siguiente manera. Aquí se muestran :math:`600 (|11111\rangle + |00000\rangle)`, y :math:`|10\rangle^{\otimes 3}`.
fr: Les puissances de Tensor sont construites à l'aide du caret ``^`` comme suit : :math:`600 (| 11111\rangle + |00000\rangle)`, et :math:`|10\rangle^{\otimes 3 }`.
ja_jp: テンソル乗はキャレット ``^`` を使用して、以下のように構築されます。次は、 :math:`600 (|11111\rangle + |00000\rangle)` と :math:`|10\rangle^{\otimes 3}` です。
ko_kr: 텐서 파워는 탈자 기호 ``^`` 를 사용하여 다음과 같이 구성된다. 여기 :math:`600 (|11111\rangle + |00000\rangle)` 와 :math:`|10\rangle^{\otimes 3}` 이 있다.
pt_un: Potências de tensor são construídos usando o acento circunflexo ``^`` da seguinte forma. Aqui está o :math:`600 (|11111\rangle + |00000\rangle)` e :math:`|10\rangle^{\otimes 3}`.
ta: பின்வருமாறு ``^`` என்ற caret பயன்படுத்தி டென்சர் அதிகாரங்கள் கட்டமைக்கப்படுகின்றன. இங்கே உள்ளவை :math:`600 (|11111\rangle + |00000\rangle)`, மற்றும் :math:`|10\rangle^{\otimes 3}`.
tr: Tensör kuvvetleri gösterilecek şekli üzerinde ``^`` şapka simgesini kullanarak oluşturulurlar. Burada :math:`600 (|11111\rangle + |00000\rangle)`, and :math:`|10\rangle^{\otimes 3}`.

source: The method ``to_matrix_op`` converts to ``VectorStateFn``.
bn_bn: ``to_matrix_op`` থেকে ``VectorStateFn`` রূপান্তর প্রক্রিয়া।.
es_mx: El método ``to_matrix_op`` convierte a ``VectorStateFn``.
es_un: El método ``to_matrix_op`` convierte a ``VectorStateFn``.
fr: La méthode ``to_matrix_op`` convertit en ``VectorStateFn``.
ja_jp: ``to_matrix_op`` メソッドは ``VectorStateFn`` に変換します。
ko_kr: ``to_matrix_op`` 는 ``VectorStateFn`` 으로 변환된다.
pt_un: O método ``to_matrix_op`` converte para ``VectorStateFn``.
ta: ``to_matrix_op`` முறை ``VectorStateFn`` க்கு மாற்றுகிறது.
tr: ``to_matrix_op`` yöntemi ``to_matrix_op`` ya dönüşür.

source: Constructing a StateFn is easy. The ``StateFn`` class also serves as a factory, and can take any applicable primitive in its constructor and return the correct StateFn subclass. Currently the following primitives can be passed into the constructor, listed alongside the ``StateFn`` subclass they produce:
bn_bn: StateFn প্রস্তুত করা বেশ সহজ। ``StateFn`` ক্লাস একটি প্রস্তুতকারক (কন্সট্রাক্টর) হিসেবে কাজ করে যা যেকোনো ব্যবহারিক শ্রেণীকে ইনপুট হিসেবে নেয় আর সঠিক StateFn সাবক্লাস ফলাফল হিসেবে দেয়। এখন নিম্নোক্ত প্রাইমেটিভস কে কন্সট্রাকটর হিসেবে ব্যবহার করে এবং ``StateFn`` এর সাবক্লাস হিসেবে তালিকাভুক্ত করে।:
es_mx: Construir un StateFn es sencillo. La clase ``StateFn`` también sirve como una fábrica, y puede tomar cualquier primitiva valida en su constructor y devolver la subclase StateFn correcta. Actualmente se pueden pasar las siguientes primitivas al constructor, listadas junto a la subclase ``StateFn`` que producen:
es_un: Construir un StateFn es sencillo. La clase ``StateFn`` también sirve como una fábrica, y puede tomar cualquier primitiva aplicable en su constructor y devolver la subclase StateFn correcta. Actualmente, se pueden pasar las siguientes primitivas al constructor, listadas junto a la subclase ``StateFn`` producen:
fr: Construire un StateFn est facile. La classe ``StateFn`` sert également de fabrique, et peut prendre n'importe quelle primitive applicable dans son constructeur et retourner la sous-classe StateFn correcte. Actuellement, les primitives suivantes peuvent être transmises au constructeur, répertoriées pour la sous-classe ``StateFn`` ils produisent :
ja_jp: StateFnを構築するのは簡単です。 ``StateFn`` クラスはファクトリーとしても機能し、該当するプリミティブをコンストラクターに取り込み、正しい StateFn サブクラスを返すことができます。 現在、以下のプリミティブをコンストラクタに渡すことができ、生成される ``StateFn`` サブクラスと一緒にリストしています。
ko_kr: StateFn을 생성하는 것은 쉽다. ``StateFn`` 은 팩토리로도 제공되며, 어떤 원시 자료형이라도 생성자에서 받을 수 있으며, 정확한 StateFn 하위 클래스를 반환할 수 있다. 현재 다음과 같은 원시 자료형을 생성자로 전달할 수 있으며, 이는 그들이 생성하는 ``StateFn`` 하위 클래스들과 나란히 나열되어 있다.
pt_un: Construir um StateFn é fácil. A classe ``StateFn`` também serve como uma fábrica e pode receber qualquer primitivo aplicável em seu construtor e retornar a subclasse StateFn correta. Atualmente, os seguintes primitivos podem ser passados para o construtor, listados junto com a subclasse ``StateFn`` que eles produzem:
ta: StateFn அமைப்பது எளிதானது. ``StateFn`` வர்க்கம் ஒரு தொழிற்சாலையாகவும் செயல்படுகிறது, மேலும் அதன் கட்டமைப்பாளருக்கு பொருந்தக்கூடிய எந்தவொரு primitives சையும் எடுத்து சரியான StateFn துணைப்பிரிவை திருப்பித் தரலாம். தற்போது பின்வரும் primitives களை constructor ருக்கு அனுப்பலாம், அதனுடன் பட்டியலிடப்பட்டுள்ளது ``StateFn`` தயாரிக்கும் துணைப்பிரிவு:
tr: Bir StateFn oluşturmak kolaydır. ``StateFn`` sınıfı da fabrika gibi hizmet eder, yapıcısındaki herhangi bir uygulanabilir ilkeli alabilir ve doğru StateFn alt sınıfını döndürebilir. Şimdi, aşağıdaki ilkeliler yapıcısına geçirilebilir, ``StateFn``alt sınıfının yanında listelendiği zaman bunu oluşturuyor:

source: str (equal to some basis bitstring) -> DictStateFn
bn_bn: str (বেসিস বিটমালা বা বিটস্ট্রিং এর সমতুল্য) -> DictStateFn
es_mx: str (igual a alguna base de bitstring) -> DictStateFn
es_un: str (igual a alguna base de cadena de bits) -> DictStateFn
fr: str (égal à une chaîne de bits de base) -> DictStateFn
ja_jp: str (ある基底ビット文字列に等しい) -> DictStateFn
ko_kr: str (일부 기저 비트 문자열과 동일) -> DictStateFn
pt_un: str (igual a alguma bitstring de base) -> DictStateFn
ta: str (சில அடிப்படை பிட்ஸ்ட்ரிங்கிற்கு சமம்) -> DictStateFn

source: Qiskit Result object -> DictStateFn
bn_bn: কিস্কিট ফলাফল অবজেক্ট -> DictStateFn
es_un: Objeto de resultado de Qiskit -> DictStateFn
fr: Objet Résultat Qiskit-> DictStateFn
ja_jp: QisKitのResultオブジェクト -> DictStateFn
pt_un: Objeto Result do Qiskit -> DictStateFn
tr: Qiskit Sonuç nesnesi -> DictStateFn

source: list -> VectorStateFn
bn_bn: তালিকা -> VectorStateFn
pt_un: lista -> VectorStateFn

source: Instruction -> CircuitStateFn
bn_bn: নির্দেশমালা -> CircuitStateFn
pt_un: Instrução -> CircuitStateFn

source: Part II: ``PrimitiveOp``\ s
bn_bn: দ্বিতীয়াংশঃ ``PrimitiveOp``\ s
es_mx: Parte II: ``PrimitiveOp``
es_un: Parte II: ``PrimitiveOp``
fr: Partie II: ``PrimitiveOp``\ s
ja_jp: パート II: ``PrimitiveOp``
ko_kr: 파트 II: ``PrimitiveOp``\ s
pt_un: Parte II: ``PrimitiveOp``\ s
ta: பகுதி II: ``PrimitiveOp``\ s
tr: Bölüm II: ``PrimitiveOp``\ s

source: The basic Operators are subclasses of ``PrimitiveOp``. Just like ``StateFn``, ``PrimitiveOp`` is also a factory for creating the correct type of ``PrimitiveOp`` for a given primitive. Currently, the following primitives can be passed into the constructor, listed alongside the ``PrimitiveOp`` subclass they produce:
bn_bn: মৌলিক কার্যকারকসমূহ হচ্ছে ``PrimitiveOp`` উপশ্রেণি। ``StateFn`` এর অনুরূপ, ``PrimitiveOp`` হচ্ছে সঠিক ``PrimitiveOp`` ফলাফল প্রদানের মৌলিক শ্রেণি। এখন নিম্নোক্ত প্রাইমেটিভস কে কন্সট্রাকটর হিসেবে ব্যবহার করে এবং ``PrimitiveOp`` এর সাবক্লাস হিসেবে তালিকাভুক্ত করে:
es_mx: Los operadores básicos son subclases de ``PrimitiveOp``. Al igual que ``StateFn``, ``PrimitiveOp`` también es una fábrica para crear el tipo correcto de ``PrimitiveOp`` para una primitiva dada. Actualmente, las siguientes primitivas pueden pasarse al constructor, listadas junto a la subclase ``PrimitiveOp`` producen:
es_un: Los operadores básicos son subclases de ``PrimitiveOp``. Al igual que ``StateFn``, ``PrimitiveOp`` también es una fábrica para crear el tipo correcto de ``PrimitiveOp`` para una primitiva dada. Actualmente, las siguientes primitivas pueden pasarse al constructor, listadas junto a la subclase ``PrimitiveOp`` producen:
fr: Les opérateurs de base sont des sous-classes de ``PrimitiveOp``. Tout comme ``StateFn``, ``PrimitiveOp`` est aussi un constructeur pour créer le type correct de ``PrimitiveOp`` pour une primitive donnée. Actuellement, les primitives suivantes peuvent être transmises au constructeur, répertoriées à côté de la sous-classe ``PrimitiveOp`` ils produisent :
ja_jp: 基本的な演算子は ``PrimitiveOp`` のサブクラスです。 ``StateFn`` と同じように、 ``PrimitiveOp`` は与えられたプリミティブに対して正しい型の ``PrimitiveOp`` を作成するためのファクトリーでもあります。 現在、以下のプリミティブをコンストラクタに渡すことができ、生成される ``PrimitiveOp`` サブクラスと一緒にリストしています。
ko_kr: 기본 연산자들은 ``PrimitiveOp`` 의 하위 클래스이다. ``StateFn`` 과 마찬가지로 ``PrimitiveOp`` 는 주어진 원시 자료형에 올바른 자료형을 생성하기 위한 팩토리이기도 하다. 지금은 다음의 원시 자료형들이 생성자를 통해 ``PrimitiveOp`` 의 하위 클래스로서 만들어 질 수 있다.
pt_un: Os operadores básicos são subclasses de ``PrimitiveOp``. Assim como ``StateFn``, ``PrimitiveOp`` é também uma fábrica para criar o tipo correto de ``PrimitiveOp`` para um dado primitivo. Atualmente, os seguintes primitivos podem ser passados para o construtor, listados junto com a subclasse ``PrimitiveOp`` que eles produzem:
ta: அடிப்படை ஆபரேட்டர்கள் ``PrimitiveOp`` இன் துணைப்பிரிவுகள். ``StateFn`` போலவே, ``PrimitiveOp`` என்பது ஒரு குறிப்பிட்ட பழமையானவருக்கு சரியான வகை ``PrimitiveOp`` ஐ உருவாக்குவதற்கான ஒரு தொழிற்சாலையாகும். தற்போது, ​​பின்வரும் பழமையானவைகளை அவர்கள் உருவாக்கும் ``PrimitiveOp`` துணைப்பிரிவுடன் பட்டியலிடப்பட்ட கன்ஸ்ட்ரக்டருக்கு அனுப்பலாம்:
tr: Temel operatörler ``PrimitiveOp`` 'ın alt sınıflarırdır. ``StateFn`` gibi, verilen bir ilkele doğru ``PrimitiveOp`` türünü oluşturmak için ``PrimitiveOp`` da bir fabrikadır. Şimdi, aşağıdaki ilkeleri, oluşturdukları ``PrimitiveOp`` altsınıflarının yanında listelenmiş olarak oluşturucudan geçirebilir:

source: Instruction -> CircuitOp
bn_bn: নির্দেশমালা -> CircuitOp
pt_un: Instrução -> CircuitOp

source: 2d List -> MatrixOp
bn_bn: দ্বিমাত্রিক তালিকা -> MatrixOp
es_un: Lista 2d -> MatrixOp
pt_un: Lista 2d -> MatrixOp

source: Terra’s quantum_info.Operator -> MatrixOp
ja_jp: Terra の quantum_info.Operator -> MatrixOp
ko_kr: 테라의 (Terra’s) quantum_info.Operator -> MatrixOp
pt_un: quantum_info.Operator Terra -> MatrixOp

source: Matrix elements
bn_bn: ম্যাট্রিক্স উপাদান বা ভুক্তি
es_mx: Elementos de matriz
es_un: Elementos de matriz
fr: Eléments de matrice
ja_jp: 行列要素
ko_kr: 행렬 원소
pt_un: Elementos da Matriz
ta: மேட்ரிக்ஸ் உறுப்புகள்
tr: Matris öğeleri
