Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/chemistry/01_electronic_structure.po
Languages: es_mx, fr_fr, id_id, ko_kr, pt_br, ta_in

source: This page was generated from `tutorials/chemistry/01_electronic_structure.ipynb`__.
es_mx: Esta página fue generada a partir de `tutorials/chemistry/01_electronic_structure.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/chemistry/1_programmatic_approach.ipynb`__.
id_id: Halaman ini dibuat berdasarkan `tutorials/chemistry/01_electronic_structure.ipynb`__.
ko_kr: 이 페이지는 `tutorials/chemistry/01_electronic_structure.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada a partir do `tutorials/chemistry/01_electronic_structure.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/chemistry/01_electronic_structure.ipynb`__ ஆல் உருவாக்கப்பட்டது.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/01_electronic_structure.ipynb>`_.
es_mx: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/01_electronic_structure.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/01_electronic_structure.ipynb>`_.
id_id: Jalankan secara interaktif di ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/01_electronic_structure.ipynb>` _.
ko_kr: `IBM 퀀텀 랩 <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/01_electronic_structure.ipynb>`_ 에서 대화식으로 실행하시오.
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/01_electronic_structure.ipynb>`_.
ta_in: ஊடாடும் வகையில் `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/01_electronic_structure.ipynb>`_ இயக்கவும்.

source: Electronic structure
es_mx: Estructura electrónica
fr_fr: Structure électronique
id_id: Struktur elektronik
ko_kr: 전자 구조
pt_br: Estrutura eletrônica
ta_in: மின்னணு கட்டமைப்பு

source: Introduction
es_mx: Introducción
id_id: Pengantar
ko_kr: 소개
pt_br: Introdução
ta_in: அறிமுகம்

source: The molecular Hamiltonian is
es_mx: El Hamiltoniano molecular es
fr_fr: Le Hamiltonien moléculaire est
id_id: Hamiltonian molekul adalah
ko_kr: 분자 해밀톤은
pt_br: O Hamiltoniano molecular é
ta_in: மூலக்கூறு ஹாமில்டோனியன்

source: Because the nuclei are much heavier than the electrons they do not move on the same time scale and therefore, the behavior of nuclei and electrons can be decoupled. This is the Born-Oppenheimer approximation.
es_mx: Cómo los núcleos son mucho más pesados que los electrones, no se mueven en la misma escala de tiempo, entonces, el comportamiento de los núcleos y los electrones puede estar desacoplado. Esta es la aproximación de Born-Oppenheimer.
fr_fr: Comme les noyaux d'atomes sont beaucoup plus lourds que les électrons ils ne bougent pas sur la même échelle de temps et, par conséquent, le comportement des noyaux et du nuage d'électrons peuvent être découplés. C'est l'approximation de Born-Oppenheimer.
id_id: Karena inti atom memiliki massa yang jauh lebih massif daripada elektron, keduanya tidak bergerak pada skala waktu yang sama. Oleh karena itu, sifat inti atom dan elektron dapat dianggap terpisah. Hal ini disebut dengan aproksimasi Born-Oppenheimer.
ko_kr: 핵들은 동일한 시간 축척으로 이동하지 않는 전자들보다 훨씬 더 무거운 것이기 때문에, 핵들 및 전자들의 거동은 분리될 수 있다. 이것은 Born-Oppenheimer 근사치이다.
pt_br: Porque os núcleos são muito mais pesados que os elétrons eles não se movem na mesma escala de tempo e, portanto, o comportamento de núcleos e elétrons pode ser desacoplado. Esta é a aproximação Born-Oppenheimer.
ta_in: கருக்கள் ஒரே நேரத்தில் செல்லாத எலக்ட்ரான்களை விட கனமானவை என்பதால், கருக்கள் மற்றும் எலக்ட்ரான்களின் நடத்தை துண்டிக்கப்படலாம். இது பார்ன்-ஓபன்ஹைமர் தோராயமாகும்

source: Therefore, one can first tackle the electronic problem with nuclear coordinate entering only as parameters. The energy levels of the electrons in the molecule can be found by solving the non-relativistic time independent Schroedinger equation,
es_mx: Por lo tanto, primero se puede abordar el problema electrónico con la entrada de coordenadas nucleares solo como parámetros. Los niveles de energía de los electrones en la molécula se pueden encontrar resolviendo la ecuación de Schröedinger no relativista independiente del tiempo,
fr_fr: Par conséquent, on peut d'abord s'attaquer au problème électronique en utilisant comme paramètres les coordonnées nucléaires seulement. Les niveaux d'énergie des électrons de la molécule peuvent être trouvés en résolvant l'équation Schroedinger non relativiste indépendante du temps
ko_kr: 그러므로, 핵 좌표를 매개 변수로만 입력하는 전자 문제를 먼저 다룰 수 있다. 분자 내의 전자의 에너지 수준은 비-상대성의 시간 독립적인 슈뢰딩거 방정식을 해결함으로써 발견될 수 있다.
ta_in: எனவே, அணுசக்தி ஒருங்கிணைப்பு அளவுருக்களாக மட்டுமே நுழைவதால் மின்னணு சிக்கலை முதலில் சமாளிக்க முடியும். சார்பற்ற நேர சுயாதீனமான ஷ்ரோடிங்கர் சமன்பாட்டைத் தீர்ப்பதன் மூலம் மூலக்கூறில் உள்ள எலக்ட்ரான்களின் ஆற்றல் அளவைக் காணலாம்,

source: where
es_mx: donde
fr_fr: où
id_id: dengan
ko_kr: 여기서 이는 다음과 같다
pt_br: onde
ta_in: எங்கே

source: In particular the ground state energy is given by:
es_mx: En particular, la energía del estado base es dada por:
fr_fr: En particulier, l'énergie de l'état fondamental est donnée par:
id_id: Secara khusus, energi pada keadaan dasar adalah:
ko_kr: 특히, 접지 상태 에너지는 다음과 같이 주어진다:
pt_br: Em particular a energia do estado fundamental é dada por:
ta_in: குறிப்பாக நில நிலை ஆற்றல் பின்வருமாறு:

source: where :math:`\Psi_0` is the ground state of the system.
es_mx: donde :math:`\Psi_0` es el estado base del sistema.
fr_fr: où :math:`\Psi_0` est l'état fondamental du système.
id_id: dimana :math:` \Psi_0 ` adalah state dasar dari sistem.
ko_kr: 여기서 :math:`\Psi_0` 는 시스템의 접지 상태이다.
pt_br: onde :math:`\Psi_0` é o estado fundamental do sistema.
ta_in: அதில் :math:`\Psi_0` என்பது அமைப்பின் தரை நிலை.

source: However, the dimensionality of this problem grows exponentially with the number of degrees of freedom. To tackle this issue we would like to prepare :math:`\Psi_0` on a quantum computer and measure the Hamiltonian expectation value (or :math:`E_0`) directly.
es_mx: Sin embargo, la dimensionalidad de este problema crece exponencialmente con el número de grados de libertad. Para abordar este problema nos gustaría preparar :math:` \Psi_0 ` en una computadora cuántica y medir el valor esperado del Hamiltoniano (o :math:` E_0 `) directamente.
fr_fr: Cependant, la dimension de ce problème croît de manière exponentielle avec le nombre de degrés de liberté. Pour résoudre ce problème, nous aimerions préparer :math:`\Psi_0` sur un ordinateur quantique et mesurer la valeur d'espérance Hamiltonienne (ou :math:`E_0`) directement.
id_id: Namun, dimensi masalah ini meningkat secara eksponensial dengan banyaknya derajat kebebasan. Untuk mengatasi masalah ini, kita akan menyiapkan :math:`\Psi_0` pada komputer kuantum dan mengukur nilai ekspektasi Hamiltonian (atau :math:`E_0`) secara langsung.
ko_kr: 그러나, 이러한 문제의 차원은 자유도의 수에 따라 기하급수적으로 증가한다. 이 문제를 해결하기 위해 우리는 양자 컴퓨터에 :math:`\Psi_0` 을 준비하고 해밀턴 기대값 (또는 :math:`E_0`) 을 직접 측정하고자 한다.
pt_br: No entanto, a dimensionalidade desse problema cresce exponencialmente com o número de graus de liberdade. Para enfrentar esta questão gostaríamos de preparar :math:`\Psi_0` em um computador quântico e medir o valor esperado do Hamiltoniano (ou :math:`E_0`) diretamente.
ta_in: இருப்பினும், இந்த சிக்கலின் பரிமாணமானது சுதந்திரத்தின் அளவுகளின் எண்ணிக்கையுடன் அதிவேகமாக வளர்கிறது. இந்த சிக்கலைச் சமாளிக்க நாங்கள் குவாண்டம் கணினியில் தயார் செய்ய விரும்புவது :math:`\Psi_0` மற்றும் ஹாமில்டோனிய எதிர்பார்ப்பு மதிப்பை (or :math:`E_0`) நேரடியாக கணக்கிட முடியும்.

source: So how do we do that concretely?
es_mx: Entonces, ¿Cómo lo hacemos concretamente?
fr_fr: Alors, comment le faire concrètement?
id_id: Jadi, bagaimana kita bisa melakukannya?
ko_kr: 어떻게 구체적으로 표현할 수 있을까?
pt_br: Então, como fazer isso concretamente?
ta_in: எனவே அதை நாம் எவ்வாறு உறுதியாகச் செய்வது?

source: The Hartree-Fock initial state
es_mx: Estado inicial de Hartree-Fock
fr_fr: L'état initial de Hartree-Fock
id_id: Keadaan awal Hartree-Fock
ko_kr: Hartree-Fock 초기 상태
pt_br: O estado inicial de Hartree-Fock
ta_in: ஹார்ட்ரீ-ஃபாக் ஆரம்ப நிலை

source: A good starting point for solving this problem is the Hartree-Fock (HF) method. This method approximates a N-body problem into N one-body problems where each electron evolves in the mean-field of the others. Classically solving the HF equations is efficient and leads to the exact exchange energy but does not include any electron correlation. Therefore, it is usually a good starting point to start adding correlation.
es_mx: Un buen punto de partida para resolver este problema es el método Hartree-Fock (HF). Este método aproxima un problema de N-cuerpos en N problemas de un solo cuerpo donde cada electrón evoluciona en el campo medio de los demás. Resolver clásicamente las ecuaciones de HF es eficiente y conduce a la energía de intercambio exacta, pero no incluye ninguna correlación entre los electrones. Por lo tanto, suele ser un buen punto de partida para empezar a añadir las correlaciones.
fr_fr: Un bon point de départ pour résoudre ce problème est la méthode Hartree-Fock (HF). Cette méthode transforme un problème à N-corps par approximation en N problèmes à un corps où chaque électron évolue dans le champ moyen des autres. La résolution classique des équations HF est efficace et conduit à l'énergie d'échange exacte, mais n'inclut pas de corrélation électronique. Par conséquent, il s'agit généralement d'un bon point de départ pour commencer à ajouter une corrélation.
id_id: Kita dapat memulai menyelesaikan masalah ini dengan metode Hartree-Fock (HF). Metode ini mengaproksimasi sistem benda-N (N-body problem) menjadi sistem benda-satu (one-body problem) sebanyak N, dengan setiap elektronnya berubah dalam medan rata-rata (mean-field) elektron lainnya. Penyelesaian secara klasik persamaan HF efisien dan menghitung energi pertukaran dengan tepat, tetapi tidak memasukkan pengaruh korelasi elektron. Oleh karena itu, kita dapat menambahkan korelasi untuk memulai.
ko_kr: 이 문제를 해결하기 위한 좋은 출발점은 HF (Hartree-Fock) 방식이다. 이 방법은 N체 문제를, 각각의 전자가 다른 것들의 평균-필드에서 진화하는 N개의 일체 문제 (one-body problem) 로 근사화한다. HF 방정식을 분류적으로 해결하는 것은 효율적이며 정확한 교환 에너지를 유도하지만 어떠한 전자 상관도 포함하지 않는다. 따라서 일반적으로 상관 추가를 시작하는 것이 좋은 시작점이다.
pt_br: Um bom ponto de partida para resolver esse problema é o método de Hartree-Fock (HF). Este método aproxima um problema de N corpos em N problemas de um corpo onde cada elétron evolui no campo médio dos outros. Resolver classicamente as equações de HF é eficiente e leva à energia de troca exata mas não inclui nenhuma correlação dos elétrons. Portanto, geralmente é um bom ponto de partida para começar a adicionar correlação.
ta_in: இந்த சிக்கலை தீர்க்க ஒரு நல்ல தொடக்க புள்ளி ஹார்ட்ரீ-ஃபாக் (HF) முறை. இந்த முறை ஒரு N- உடல் சிக்கலை N ஒரு-உடல் சிக்கல்களாக தோராயமாக மதிப்பிடுகிறது, அங்கு ஒவ்வொரு எலக்ட்ரானும் மற்றவர்களின் சராசரி புலத்தில் உருவாகிறது. HF சமன்பாடுகளை கிளாசிக்கல் முறையில் தீர்ப்பது திறமையானது மற்றும் சரியான பரிமாற்ற ஆற்றலுக்கு வழிவகுக்கிறது, ஆனால் எந்த எலக்ட்ரான் தொடர்பும் இல்லை. எனவே, பொதுவாகத் தொடர்புகளைச் சேர்ப்பது ஒரு நல்ல தொடக்கப் புள்ளியாகும்.

source: The Hamiltonian can then be re-expressed in the basis of the solutions of the HF method, also called Molecular Orbitals (MOs):
es_mx: Luego, el Hamiltoniano se puede volver a expresar en la base de las soluciones del método HF, también llamado Orbitales Moleculares (MO):
fr_fr: Le Hamtiltonien peut alors être reformulé dans la base des solutions de la méthode HF, aussi appelées Orbitales Moléculaires (MO - Molecular Orbitals) :
ko_kr: 이어서, 해밀토니안은 또한 분자 오비탈 (Molecular Orbitals, MOs) 이라고도 불리는 HF 방법의 해법에 기초하여 다시 표현될 수 있다.
ta_in: HF முறையின் தீர்வுகளின் அடிப்படையில் ஹாமில்டோனியனை மீண்டும் வெளிப்படுத்தலாம், இது மூலக்கூறு சுற்றுப்பாதைகள் (MO கள்) என்றும் அழைக்கப்படுகிறது:

source: with the 1-body integrals
es_mx: con las integrales de 1 cuerpo
fr_fr: avec les intégrales sur 1 corps
id_id: dengan integral 1-body
ko_kr: 일체 통합물을 사용하는 경우
pt_br: com as integrais de 1 corpo
ta_in: 1-உடல் ஒருங்கிணைப்புகளுடன்

source: and 2-body integrals
es_mx: y las integrales de 2 cuerpos
fr_fr: et les intégrales à 2 corps
id_id: dan integral 2-body
ko_kr: 및 2체 적분
pt_br: e integrais de 2 corpos
ta_in: மற்றும் 2-உடல் ஒருங்கிணைப்புகள்

source: The MOs (:math:`\phi_u`) can be occupied or virtual (unoccupied). One MO can contain 2 electrons. However, in what follows we actually work with Spin Orbitals which are associated with a spin up (:math:`\alpha`) of spin down (:math:`\beta`) electron. Thus Spin Orbitals can contain one electron or be unoccupied.
es_mx: Los MOs (:math:`\phi_u`) pueden ser ocupados o virtuales (desocupados). Un MO puede contener 2 electrones. Sin embargo, en lo que sigue realmente trabajamos con orbitales de espín que están asociados con un espín de electrón hacia arriba (:math:`\alpha`) o hacia abajo (:math:`\beta`). Así, los orbitales de espín pueden contener un electrón o estar desocupados.
fr_fr: Les Orbitales Moléculaires (´´Molecular Orbitals´´ ou ´´MOs´´ (:math:`\phi_u`) peuvent être occupés ou virtuels (non occupés). Un MO peut contenir 2 électrons. Cependant, dans ce qui suit nous travaillons avec Spin Orbitals qui sont associés à un spin up (:math:`\alpha`) d'un spin down (:math:`\beta`) electron. Ainsi, Spin Orbitals peuvent contenir un électron ou être inoccupé.
id_id: MO (:math:`\phi_u`) dapat ditempati atau virtual (tidak ditempati). Satu MO dapat berisi 2 elektron. Tetapi, kedepannya kita akan bekerja dengan orbital spin yang terkait dengan elektron spin-naik (:math:`\alpha`) dan spin-turun (:math:`\beta`). Dengan demikian, orbital spin dapat berisi satu elektron atau tidak terisi.
ko_kr: MOs (:math:`\phi_u`) 는 점유하거나 가상 (점유되지 않음) 될 수 있다. 하나의 MO는 2개의 전자를 포함할 수 있다 그러나 스핀 다운 (:math:`\beta`) 전자의 스핀 업 (:math:`\alpha`) 과 연관된 스핀오비탈 (Spin Orbitals) 과 실제로 작업하는 것은 다음과 같다. 따라서, 스핀오비탈은 하나의 전자를 포함할 수 있거나 점유되지 않을 수 있다.
pt_br: Os MOs (:math:`\phi_u`) podem ser ocupados ou virtuais (desocupados). Um MO pode conter 2 elétrons. No entanto, a seguir nós na verdade trabalhamos com Orbitais de Spin que estão associados a um elétron com spin up (:math:`\alpha`) ou spin down (:math:`\beta`). Assim Orbitais de Spin podem conter um elétron ou ser desocupados.
ta_in: MOகள் (:math:`\phi_u`) ஆக்கிரமிக்கப்படலாம் அல்லது மெய்நிகர் (பயன்படுத்தப்படாதது). ஒரு MO இல் 2 எலக்ட்ரான்கள் இருக்கலாம். எவ்வாறாயினும், பின்வருவனவற்றில் நாம் உண்மையில் ஸ்பின் ஆர்பிட்டால்களுடன் வேலை செய்கிறோம், அவை ஸ்பின் அப் (:math:`\alpha`) -ன் ஸ்பின் டவுன் (:math:`\beta`) எலக்ட்ரானுடன் தொடர்புடையது. இதனால் ஸ்பின் ஆர்பிட்டால்கள் ஒரு எலக்ட்ரானைக் கொண்டிருக்கலாம் அல்லது பயன்படுத்தப்படாமலும் இருக்கலாம்.

source: We now show how to concretely realise these steps with Qiskit.
es_mx: Ahora mostramos cómo realizar estos pasos concretamente con Qiskit.
fr_fr: Nous montrons maintenant comment réaliser concrètement ces étapes avec Qiskit.
ta_in: Qiskit மூலம் இந்த நடவடிக்கைகளை எவ்வாறு உறுதியாக உணர்ந்து கொள்வது என்பதை இப்போது காண்பிக்கிறோம்.

source: Qiskit is interfaced with different classical codes which are able to find the HF solutions. Interfacing between Qiskit and the following codes is already available: \* Gaussian \* Psi4 \* PyQuante \* PySCF
es_mx: Qiskit está interconectado con diferentes códigos clásicos que son capaces de encontrar las soluciones de HF. Ya está disponible la interconexión entre Qiskit y los siguientes códigos: \* Gaussian \* Psi4 \* PyQuante \* PySCF
fr_fr: Qiskit est interfacé avec différents codes classiques qui sont en mesure de trouver les solutions HF. Une interface entre Qiskit et les codes suivants est déjà disponible : \* Gaussien \* Psi4 \* PyQuante \* PySCF
id_id: Qiskit bisa dihubungkan dengan kode-kode klasik berbeda yang mampu menemukan solusi HF. Koneksi antara Qiskit dan kode-kode software berikut ini sudah tersedia: \ * Gaussian \ * Psi4 \ * PyQuante \ * PySCF
ko_kr: 키스킷은 HF 솔루션을 찾을 수 있는 다양한 클래식 코드와 인터페이스한다. 키스킷 사이의 인터페이싱 및 다음 코드가 이미 사용 가능하다.\* Gaussian\* Psi4\* PyQuante\* PySCF
pt_br: O Qiskit faz interface com diferentes códigos clássicos que são capazes de encontrar as soluções de HF. A interface entre o Qiskit e os códigos a seguir já está disponível: \* Gaussian \* Psi4 \* PyQuante \* PySCF
ta_in: Qiskit வெவ்வேறு கிளாசிக்கல் குறியீடுகளுடன் இணைக்கப்பட்டுள்ளது, அவை HF தீர்வுகளைக் கண்டறிய வைக்கிறது. Qiskit மற்றும் பின்வரும் குறியீடுகளுக்கு இடையில் இடைமுகம் ஏற்கனவே கிடைக்கிறது: \* Gaussian \* Psi4 \* PyQuante \* PySCF

source: In the following we set up a PySCF driver, for the hydrogen molecule at equilibrium bond length (0.735 angstrom) in the singlet state and with no charge.
es_mx: A continuación establecemos un driver PySCF, para la molécula de hidrógeno en la longitud de equilibrio de enlace (0.735 angstrom) en el estado singlete y sin carga.
fr_fr: Dans ce qui suit, nous avons mis en place un moteur PySCF pour la molécule d'hydrogène à la longueur de la liaison d'équilibre (0.735 angstrom) dans l'état singulet et sans charge.
id_id: Dalam hal berikut kami menyiapkan driver PySCF, untuk molekul hidrogen pada panjang bond ekuilibrium (0.735 angstrom) di state singlet dan tanpa muatan.
ko_kr: 아래에서는 수소 분자를 전하가 없는 단일항 상태의 평형 결합 길이 (0.735 옹스트롬) 에 두고자 PySCF 드라이버를 설정한다.
pt_br: A seguir, montamos um driver PySCF, para a molécula de hidrogênio com comprimento de ligação em equilíbrio (0,735 angstrom) no estado singleto e sem carga nenhuma.
ta_in: பின்வருவனவற்றில், ஹைட்ரஜன் மூலக்கூறுக்கு ஒற்றை நிலையில் சமநிலை பிணைப்பு நீளத்தில் (0.735 angstrom) ஒரு மின்சுமையற்ற, ஒரு PySCF driver அமைக்கப்படும்.

source: For further information about the drivers see https://qiskit.org/documentation/apidoc/qiskit.chemistry.drivers.html
es_mx: Para más información acerca de los controladores, lee https://qiskit.org/documentation/apidoc/qiskit.chemistry.drivers.html
fr_fr: Pour plus d'informations sur les conducteurs (´´drivers´´), voir https://qiskit.org/documentation/apidoc/qiskit.chemistry.drivers.html
id_id: Untuk informasi lebih lanjut tentang driver lihat https://qiskit.org/documentation/apidoc/qiskit.chemistry.drivers.html
ko_kr: 드라이버에 대한 자세한 정보는 https://qiskit.org/documentation/apidoc/qiskit.chemistry.drivers.html를 참조하라
pt_br: Para mais informações sobre os drivers consulte https://qiskit.org/documentation/apidoc/qiskit.chemistry.drivers.html
ta_in: டிரைவர்கள் பற்றிய கூடுதல் தகவலுக்கு பார்க்க https://qiskit.org/documentation/apidoc/qiskit.chemistry.drivers.html

source: The mapping from fermions to qubits
es_mx: El mapeo de fermiones a qubits
fr_fr: Le mappage entre les fermions et les qubits
id_id: Pemetaan dari fermion ke qubit
ko_kr: 페르미온(fermions) 에서 큐비트로의 매핑
pt_br: O mapeamento de fermions a qubits
ta_in: ஃபெர்மியன்களிலிருந்து qubit-களுக்கு மேப்பிங்

source: The Hamiltonian given in the previous section is expressed in terms of fermionic operators. To encode the problem into the state of a quantum computer, these operators must be mapped to spin operators (indeed the qubits follow spin statistics).
es_mx: El Hamiltoniano dado en la sección previa esta expresado en términos de operadores fermiónicos. Para codificar el problema en el estado de una computadora cuántica, estos operadores deben ser mapeados a operadores de espín (de hecho, los qubits siguen las estadísticas de espín).
fr_fr: L' Hamiltonien donné dans la section précédente est exprimé en termes d'opérateurs fermioniques. Pour encoder le problème dans l'état d'un ordinateur quantique, ces opérateurs doivent être mappés aux opérateurs de spin (en effet les qubits suivent des statistiques de spin).
id_id: Hamiltonian yang diberikan pada bagian sebelumnya adalah dalam operator fermionik. Untuk menulis kode masalah ke komputer kuantum, operator ini harus dipetakan ke operator spin (karena memang qubits mengikuti statistik spin).
pt_br: O Hamiltoniano dado na seção anterior é expresso em termos de operadores fermiônicos. Para codificar o problema no estado de um computador quântico, esses operadores devem ser mapeados para operadores de spin (na verdade, os qubits seguem estatísticas de spin).
ta_in: முந்தைய பிரிவில் கொடுக்கப்பட்ட ஹாமில்டோனியன் ஃபெர்மியோனிக் ஆபரேட்டர்கள் அடிப்படையில் வெளிப்படுத்தப்படுகிறது. ஒரு குவாண்டம் கணினியின் நிலைக்கு சிக்கலைக் குறியிட, இந்த ஆபரேட்டர்கள் ஸ்பின் ஆபரேட்டர்களுடன் பொருத்தப்பட வேண்டும் (உண்மையில் qubit-கள் ஸ்பின் புள்ளிவிவரங்களைப் பின்பற்றுகின்றன).

source: There exist different mapping types with different properties. Qiskit already supports the following mappings: \* The Jordan-Wigner ‘jordan_wigner’ mapping (über das paulische äquivalenzverbot. In The Collected Works of Eugene Paul Wigner (pp. 109-129). Springer, Berlin, Heidelberg (1993)). \* The Parity ‘parity’ (The Journal of chemical physics, 137(22), 224109 (2012)) \* The Bravyi-Kitaev ‘bravyi_kitaev’ (Annals of Physics, 298(1), 210-226 (2002)) \* The Bravyi-Kitaev Super Fast ‘bksf’ (Annals of Physics, 298(1), 210-226 (2002))
es_mx: Existen diferentes tipos de mapeo con diferentes propiedades. Qiskit ya soporta los siguientes mapeos: \* The Jordan-Wigner ‘jordan_wigner’ mapping (über das paulische äquivalenzverbot. In The Collected Works of Eugene Paul Wigner (pp. 109-129). Springer, Berlin, Heidelberg (1993)). \* The Parity ‘parity’ (The Journal of chemical physics, 137(22), 224109 (2012)) \* The Bravyi-Kitaev ‘bravyi_kitaev’ (Annals of Physics, 298(1), 210-226 (2002)) \* The Bravyi-Kitaev Super Fast ‘bksf’ (Annals of Physics, 298(1), 210-226 (2002))
fr_fr: Il existe différents types de correspondances avec des propriétés différentes. Qiskit supporte déjà les correspondances suivants: \ * The Jordan-Wigner'jordan\_wigner'mapping (über das paulische äquivalenzverbot. Dans The Collected Works of Eugene Paul Wigner (pp. 109-129). Springer, Berlin, Heidelberg (1993)). \ * The Parity'parité'(The Journal of chemical physiques, 137 (22), 224109 (2012)) \ * The Bravyi-Kitaev'bravyi\_kitaev'(Annals of Physics, 298 (1), 210-226 (2002)) \ * The Bravyi-Kitaev Super Fast'bksf'(Annals of Physics, 298 (1), 210-226 (2002))
id_id: Ada beberapa jenis pemetaan dengan properti yang berbeda. Qiskit mendukung pemetaan berikut: \ * Pemetaan Jordan-Wigner 'jordan\_wigner' (über das paulische äquivalenzverbot. In The Collected Works of Eugene Paul Wigner (pp. 109-129). Springer, Berlin, Heidelberg (1993)). \* Parity 'parity' (The Journal of chemical physics, 137(22), 224109 (2012)) \* Bravyi-Kitaev 'bravyi\_kitaev' (Annals of Physics, 298(1), 210-226 (2002)) \* The Bravyi-Kitaev Super Fast 'bksf' (Annals of Physics, 298(1), 210-226 (2002))
pt_br: Existem diferentes tipos de mapeamento com propriedades diferentes. O Qiskit já suporta os seguintes mapeamentos: \ * O mapeamento Jordan-Wigner ‘jordan_wigner’ mapping (über das paulische äquivalenzverbot. In The Collected Works of Eugene Paul Wigner (pp. 109-129). Springer, Berlin, Heidelberg (1993)). \ * A paridade ‘parity’ (The Journal of chemical physics, 137(22), 224109 (2012)) \ * O Bravyi-Kitaev ‘bravyi_kitaev’ (Annals of Physics, 298(1), 210-226 (2002)) \* The Bravyi-Kitaev Super Fast ‘bksf’ (Annals of Physics, 298(1), 210-226 (2002))
ta_in: வெவ்வேறு பண்புகளுடன் வெவ்வேறு மேப்பிங் வகைகள் உள்ளன. Qiskit ஏற்கனவே பின்வரும் வரைபடங்களை ஆதரிக்கிறது: \* The Jordan-Wigner ‘jordan_wigner’ mapping (über das paulische äquivalenzverbot. In The Collected Works of Eugene Paul Wigner (pp. 109-129). Springer, Berlin, Heidelberg (1993)). \* The Parity ‘parity’ (The Journal of chemical physics, 137(22), 224109 (2012)) \* The Bravyi-Kitaev ‘bravyi_kitaev’ (Annals of Physics, 298(1), 210-226 (2002)) \* The Bravyi-Kitaev Super Fast ‘bksf’ (Annals of Physics, 298(1), 210-226 (2002))
