Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/chemistry/01_electronic_structure.po
Languages: es_mx, fr_fr, id_id, ko_kr, pt_br, ta_in

source: The Jordan-Wigner mapping is particularly interesting as it maps each Spin Orbital to a qubit (as shown on the Figure above).
es_mx: El mapeo Jordan-Wigner es particularmente interesante ya que mapea cada orbital de espín a un qubit (como se mostró en la figura anterior).
fr_fr: Le mapping Jordan-Wigner est particulièrement intéressant car il fait correspondre chaque Spin Orbital à un qubit (comme indiqué sur la figure ci-dessus).
id_id: Pemetaan Jordan-Wigner secara khusus menarik karena memetakan setiap Spin Orbital ke sebuah qubit (seperti yang ditunjukkan pada Gambar di atas).
pt_br: O mapeamento Jordan-Wigner é particularmente interessante já que mapeia cada Orbital de Spin a um qubit (como mostrado na Figura acima).
ta_in: ஜோர்டான்-விக்னர் மேப்பிங் குறிப்பாக சுவாரஸ்யமானது, ஏனெனில் இது ஒவ்வொரு ஸ்பின் சுற்றுப்பாதையையும் ஒரு qubit-டிற்கு வரைபடமாக்குகிறது (மேலே உள்ள படத்தில் காட்டப்பட்டுள்ளபடி).

source: Here we set up an object which contains all the information about any transformation of the fermionic Hamiltonian to the qubits Hamiltonian. In this example we simply ask for the Jordan-Wigner mapping.
es_mx: Aquí establecemos un objeto que contiene toda la información sobre cualquier transformación del Hamiltoniano fermiónico al Hamiltoniano de qubits. En este ejemplo, simplemente pedimos el mapeo Jordan-Wigner.
fr_fr: Ici nous avons mis en place un objet qui contient toutes les informations sur toute transformation du Hamiltonien fermionique en Hamiltonien de qubits. Dans cet exemple, nous demandons simplement le mappage Jordan-Wigner.
id_id: Di sini kita mengatur sebuah objek berisi semua informasi tentang transformasi apa pun dari Hamiltonian fermionik untuk Hamiltonian qubit. Dalam contoh ini kita hanya melakukan pemetaan Jordan-Wigner.
pt_br: Aqui montamos um objeto que contém todas as informações sobre qualquer transformação do Hamiltoniano fermiônico para o Hamiltoniano do qubit. Neste exemplo simplesmente pedimos o mapeamento Jordan-Wigner.
ta_in: ஃபெர்மியோனிக் ஹாமில்டோனியனின் எந்தவொரு மாற்றத்தைப் பற்றிய அனைத்து தகவல்களையும் உள்ளடக்கிய ஒரு பொருளை இங்கே அமைத்துள்ளோம். இந்த எடுத்துக்காட்டில் ஜோர்டான்-விக்னர் மேப்பிங்கை நாங்கள் கேட்கிறோம்.

source: If we now transform this Hamiltonian for the given driver defined above we get our qubit operator:
es_mx: Si ahora transformamos este Hamiltoniano para el driver dado definido anteriormente obtenemos nuestro operador de qubits:
fr_fr: Si nous transformons maintenant cet Hamiltonien pour le conducteur (``driver``) donné et défini ci-dessus, nous obtenons notre opérateur de qubit:
id_id: Jika kita sekarang mengubah Hamiltonian ini untuk driver yang didefinisikan di atas kita mendapatkan operator qubit:
pt_br: Se agora transformarmos este Hamiltoniano para o determinado driver definido acima obtemos nosso operador de qubit:
ta_in: மேலே வரையறுக்கப்பட்டு கொடுக்கப்பட்ட இயக்கிக்கு இப்போது இந்த ஹாமில்டோனியனை மாற்றினால், எங்கள் qubit ஆபரேட்டரைப் பெறுகிறோம்:

source: In the minimal (STO-3G) basis set 4 qubits are required. We could even lower the qubit count by using the Parity mapping which allows to get rid of to qubits by symmetry considerations.
es_mx: En el conjunto de base mínimo (STO-3G) se requieren 4 qubits. Incluso podríamos bajar el conteo de qubits usando el mapeo de Paridad que permite deshacerse de los qubits por consideraciones de simetría.
fr_fr: Dans la base minimale (STO-3G), il faut 4 qubits. Nous pourrions même abaisser le nombre de qubits en utilisant le mappage Parity qui permet de se débarrasser des qubits par des considérations de symétrie.
id_id: Dalam basis dasar minimal (STO-3G) diperlukan 4 qubits. Kita bahkan bisa mengurangi jumlah qubit dengan menggunakan pemetaan Parity untuk pengurangan qubits dengan memperhatikan simetri.
pt_br: No conjunto base mínimo (STO-3G) 4 qubits são necessários. Poderíamos reduzir ainda mais a contagem de qubits utilizando o mapeamento de Paridade, que permite que nos livermos de qubits ao considerar as simetrias.
ta_in: குறைந்தபட்ச (STO-3G) அடிப்படையில் 4 qubit-கள் தேவை. பாரிட்டி மேப்பிங்கைப் பயன்படுத்துவதன் மூலம் qubit எண்ணிக்கையை நாம் குறைக்க முடியும், இது சமச்சீர் கருத்தாய்வுகளால் வினாடிகளை அகற்ற அனுமதிக்கிறது.

source: This time only 2 qubits are needed.
es_mx: Esta vez sólo se necesitan 2 qubits.
fr_fr: Cette fois-ci, seulement 2 qubits sont nécessaires.
id_id: Kali ini hanya 2 qubit yang dibutuhkan.
ko_kr: 이번에는 2 개의 큐비트가 필요하다.
pt_br: Desta vez apenas 2 qubits são necessários.
ta_in: இந்த முறை 2 qubit-கள் மட்டுமே தேவை.

source: Another possibility is to use the Particle-Hole transformation (Physical Review A, 98(2), 022322 (2018)). This shifts the vacuum state to a state lying in the N-particle Fock space. In this representation the HF (reference) state has a null energy and the optimization procedure is more faster.
es_mx: Otra posibilidad es utilizar la transformación Particle-Hole (Physical Review A, 98 (2), 022322 (2018)). Esto cambia el estado de vacío a un estado que se encuentra en el espacio de Fock de N-partículas. En esta representación, el estado de HF (referencia) tiene una energía nula y el procedimiento de optimización es más rápido.
fr_fr: Une autre possibilité est d'utiliser la tranformation Particule-Trou (Physical Review A, 98 (2), 022322 (2018)). Ceci déplace l'état de vide vers un état situé dans l'espace de Fock à N-particules. Dans cette représentation, l'état HF (référence) a une énergie nulle et la procédure d'optimisation est plus rapide.
ko_kr: 또 다른 가능성은 입자 구멍(Particle-Hole) 의 변형을 사용하는 것이다 (문헌 [Physical Review A, 98 (2), 022322 (2018)]). 이는 진공 상태를 N-입자 포크 공간(Fork space) 에 놓인 상태로 이동시킨다. 이 표현에서, HF (레퍼런스) 상태는 null 에너지를 갖고, 최적화 절차는 더 빠르다.
ta_in: துகள்-துளை உருமாற்றம் (இயற்பியல் விமர்சனம் A, 98 (2), 022322 (2018)) பயன்படுத்துவது மற்றொரு வாய்ப்பு. இது வெற்றிட நிலையை N- துகள் ஃபாக் இடத்தில் கிடக்கும் நிலைக்கு மாற்றுகிறது. இந்த பிரதிநிதித்துவத்தில் HF (குறிப்பு) நிலை பூஜ்ய ஆற்றலைக் கொண்டுள்ளது மற்றும் தேர்வுமுறை செயல்முறை மிகவும் வேகமானது.

source: The list of available mappings and transformations are
es_mx: La lista de mapeos y transformaciones disponibles son
fr_fr: La liste des mappages et des transformations disponibles est
id_id: Daftar pemetaan dan transformasi yang tersedia adalah
ko_kr: 사용 가능한 맵핑 및 변환 목록은 다음과 같다.
pt_br: A lista de mapeamentos e transformações disponíveis são
ta_in: கிடைக்கக்கூடிய மேப்பிங் மற்றும் மாற்றங்களின் பட்டியல்

source: Now that the Hamiltonian is ready, it can be used in a quantum algorithm to find information about the electronic structure of the corresponding molecule. Check out our tutorials on Ground State Calculation and Excited States Calculation to learn more about how to do that in Qiskit!
es_mx: Ahora que el Hamiltoniano está listo, se puede utilizar en un algoritmo cuántico para encontrar información sobre la estructura electrónica de la molécula correspondiente. ¡Revisa nuestros tutoriales sobre Cálculo del Estado Base y Cálculo de Estados Excitados para aprender más acerca de cómo hacer eso en Qiskit!
fr_fr: Maintenant que l'Hamiltonien est prêt, il peut être utilisé dans un algorithme quantique pour trouver des informations sur la structure électronique de la molécule correspondante. Consultez nos tutoriels sur Calcul de l'état du sol (``Ground State Calculation``) et Calcul des états excités (``Excited State Calculation``) pour en savoir plus sur la façon de le faire dans Qiskit !
id_id: Ketika Hamiltonian sudah siap, itu dapat digunakan di algoritma kuantum untuk menemukan informasi tentang struktur elektronik dari molekul yang berkaitan. Lihat tutorial tentang Perhitungan State Dasar dan Eksitasi untuk mempelajari lebih lanjut tentang bagaimana melakukan itu di Qiskit!
pt_br: Agora que o Hamiltoniano está pronto, ele pode ser usado em um algoritmo quântico para encontrar informações sobre a estrutura eletrônica da molécula correspondente. Confira nossos tutoriais em Cálculo do Estado Fundamental e Cálculo dos Estados Excitados para saber mais sobre como fazer isso no Qiskit!
ta_in: இப்போது ஹாமில்டோனியன் தயாராக இருப்பதால், அதனுடன் தொடர்புடைய மூலக்கூறின் மின்னணு அமைப்பு குறித்த தகவல்களைக் கண்டுபிடிக்க ஒரு குவாண்டம் வழிமுறையைப் பயன்படுத்தலாம். Qiskit-ல் அதை எப்படி செய்வது என்பது பற்றி மேலும் அறிய அடி நிலை கணக்கீடு மற்றும் கிளர்வுற்ற நிலை கணக்கீடு பற்றிய எங்கள் பயிற்சிகளைப் பாருங்கள்!

source: \mathcal{H} = - \sum_I \frac{\nabla_{R_I}^2}{M_I} - \sum_i \frac{\nabla_{r_i}^2}{m_e} - \sum_I\sum_i \frac{Z_I e^2}{|R_I-r_i|} + \sum_i \sum_{j>i} \frac{e^2}{|r_i-r_j|} + \sum_I\sum_{J>I} \frac{Z_I Z_J e^2}{|R_I-R_J|}
fr_fr: \mathcal{H} = - \sum_I \frac{\nabla_{R_I}^2}{M_I} - \sum_i \frac{\nabla_{r_i}^2}{m_e} - \sum_I\sum_i \frac{Z_I e^2}{|R_I-r_i|} + \sum_i \sum_i \sum_{j>i}{|r_i-r_j|} + \frac{e^2} + \sum_I\sum_{J>I} \frac{Z_J e^2}{|R_I-R_J|}

source: Therefore, one can first tackle the electronic problem with nuclear coordinate entering only as parameters. The energy levels of the electrons in the molecule can be found by solving the non-relativistic time independant Schroedinger equation,
id_id: Oleh karena itu, masalah elektronika dapat terlebih dahulu diselesaikan dengan memasukkan koordinat nuklir hanya sebagai parameter. Tingkat energi elektron pada molekul dapat dicari dengan menyelesaikan persamaan Schrodinger bebas waktu nonrelativistik,
pt_br: Por conseguinte, é possível resolver primeiro o problema eletrônico com as coordenadas nucleares entrando apenas como parâmetros. Os níveis de energia dos elétrons na molécula podem ser encontrados resolvendo a equação de Schroedinger não relativística e independente do tempo,

source: The Hamtiltonian can then be re-expressed in the basis of the solutions of the HF method, also called Molecular Orbitals (MOs):
id_id: Hamiltonian dapat diekspresikan kembali sebagai basis solusi dari metode HF, atau yang disebut Orbital Molekul (MO):
pt_br: O Hamiltoniano pode então ser re-expresso em função das soluções do método de HF, também chamadas de Orbitais Moleculares (MOs):

source: We now show how to concreatly realise these steps with Qiskit.
id_id: Sekarang kita akan menunjukkan bagaimana menjalankan langkah-langkah di atas dengan Qiskit.
pt_br: Mostramos agora como realizar concretamente esses passos com o Qiskit.

source: Another possibility is to use the Particle-Hole tranformation (Physical Review A, 98(2), 022322 (2018)). This shifts the vacuum state to a state lying in the N-particle Fock space. In this representation the HF (reference) state has a null energy and the optimization procedure is more faster.
id_id: Kemungkinan lain adalah dengan menggunakan tranformasi Partikel-Hole (Physical Review A, 98 (2), 022322 (2018)). Hal ini menggeser state vakum ke state yang ada di space Fock N-partikel. Dalam representasi tersebut, state HF memiliki energi kosong dan prosedur optimasi lebih cepat.
pt_br: Outra possibilidade é utilizar a tranformação Partícula-Buraco (Physical Review A, 98(2), 022322 (2018)). Isso desloca o estado de vácuo para um estado situado no espaço de Fock de N partículas. Nessa representação o estado de HF (referência) possui uma energia nula e o procedimento de otimização é mais rápido.
