Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/chemistry/02_vibronic_structure.po
Languages: id_id, ta_in

source: This page was generated from `tutorials/chemistry/02_vibronic_structure.ipynb`__.
id_id: Halaman ini dihasilkan dari ` tutorials/chemistry/02_vibronic_structure.ipynb ` __.
ta_in: இந்த பக்கம் `tutorials/chemistry/02_vibronic_structure.ipynb`__ ஆல் உருவாக்கப்பட்டது.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/02_vibronic_structure.ipynb>`_.
id_id: Jalankan secara interaktif di ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/02_vibronic_structure.ipynb>` _.
ta_in: ஊடாடும் வகையில் `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/02_vibronic_structure.ipynb>`_ இயக்கவும்.

source: Vibronic structure
id_id: Struktur vibronik
ta_in: வைப்ரோனிக் கட்டமைப்பு

source: Introduction
id_id: Pendahuluan
ta_in: அறிமுகம்

source: The molecular Hamiltonian is
id_id: Hamiltonian molekul adalah
ta_in: மூலக்கூறு ஹாமில்டோனியன்

source: Because the nuclei are much heavier than the electrons they do not move on the same time scale and therefore, the behavior of nuclei and electrons can be decoupled. This is the Born-Oppenheimer approximation.
ta_in: கருக்கள் ஒரே நேரத்தில் செல்லாத எலக்ட்ரான்களை விட கனமானவை என்பதால், கருக்கள் மற்றும் எலக்ட்ரான்களின் நடத்தை துண்டிக்கப்படலாம். இது பார்ன்-ஓபன்ஹைமர் தோராயமாகும்.

source: Within the Born-Oppenheimer approximation, a molecular wave function is factorized as a product of an electronic part, which is the solution of the electronic Schroedinger equation, and a vibro-rotational one, which is the solution of the nuclear Schroedinger equation in the potential energy surface (PES) generated by sampling the eigenvalues of the electronic Schroedinger equation for different geometries.
id_id: Dalam pendekatan Born-Oppenheimer, sebuah fungsi gelombang molekuler difaktorisasi sebagai perkalian produk dari bagian elektronik, yang merupakan solusi dari persamaan Schroedinger untuk elektron, dan vibro-rotational, yang merupakan solusi dari persamaan Schroedinger untuk inti pada potential energy surface (PES) yang dihasilkan oleh sampling nilai eigen dari persamaan Schroedinger elektronik untuk geometri yang berbeda.
ta_in: பார்ன்-ஓப்பன்ஹைமர் தோராயத்திற்குள், ஒரு மூலக்கூறு அலை செயல்பாடு ஒரு மின்னணு பகுதியின் உற்பத்தியாக காரணியாக்கப்படுகிறது, இது மின்னணு ஷ்ரோடிங்கர் சமன்பாட்டின் தீர்வாகும், மேலும் ஒரு அதிர்வு-சுழற்சி ஒன்றாகும், இது அணுசக்தி ஷ்ரோடிங்கர் சமன்பாட்டின் தீர்வாகும் வெவ்வேறு வடிவவியல்களுக்கான மின்னணு ஷ்ரோடிங்கர் சமன்பாட்டின் சமநிலை மதிப்பீடுகளை மாதிரியாக உருவாக்குவதன் மூலம் உருவாக்கப்படும் ஆற்றல் மேற்பரப்பு (PES).

source: The nuclear Schroedinger equation is usually solved in two steps, in analogy with its electronic counterpart. A single-particle basis (the basis functions are called, in this case, modals) is obtained either by the harmonic approximation applied to the PES or from a vibrational self-consistent field (VSCF) calculation. Vibrational anharmonic correlations are added a-posteriori with perturbative or variational approaches. The latter include Vibrational Configuration Interaction (VCI) and Vibrational Coupled Cluster (VCC) for highly-accurate anharmonic energies. The main advantage of VCI and VCC over alternative approaches (such as perturbation theories) is that their accuracy can be systematically improved towards the complete basis set limit for a given PES. However, their applicability is limited to small molecules with up to about 10 atoms due to their unfavorable scaling with system size.
ta_in: அணுசக்தி ஷ்ரோடிங்கர் சமன்பாடு வழக்கமாக இரண்டு படிகளில் தீர்க்கப்படுகிறது, அதன் மின்னணு எண்ணுடன் ஒப்புமை. ஒற்றை-துகள் அடிப்படை (அடிப்படை செயல்பாடுகள் என அழைக்கப்படுகின்றன, இந்த விஷயத்தில், மோடல்கள்) PES க்கு பயன்படுத்தப்படும் இணக்கமான தோராயத்தால் அல்லது அதிர்வுறும் சுய-நிலையான புலம் (VSCF) கணக்கீட்டிலிருந்து பெறப்படுகின்றன. அதிர்வுறும் அன்ஹார்மோனிக் தொடர்புகள் குழப்பமான அல்லது மாறுபட்ட அணுகுமுறைகளுடன் ஒரு போஸ்டீரியாக சேர்க்கப்படுகின்றன. பிந்தையவற்றில் மிகவும் துல்லியமான அன்ஹார்மோனிக் ஆற்றல்களுக்கான அதிர்வு கட்டமைப்பு தொடர்பு (வி. சி. ஐ) மற்றும் அதிர்வு இணைந்த கிளஸ்டர் (வி. சி. சி) ஆகியவை அடங்கும். மாற்று அணுகுமுறைகள் (குழப்பக் கோட்பாடுகள் போன்றவை) மீது வி. சி. ஐ மற்றும் வி. சி. சி யின் முக்கிய நன்மை என்னவென்றால், கொடுக்கப்பட்ட பி. இ. எஸ்ஸிற்கான முழுமையான அடிப்படை நிர்ணய வரம்பை நோக்கி அவற்றின் துல்லியத்தை முறையாக மேம்படுத்த முடியும். இருப்பினும், அவற்றின் பொருந்தக்கூடியது கணினி மூலத்துடன் சாதகமற்ற அளவிடுதல் காரணமாக சுமார் 10 அணுக்கள் வரை சிறிய மூலக்கூறுகளுக்கு மட்டுமே.

source: To tackle the scaling problem we would like to use quantum algorithms.
id_id: Untuk mengatasi masalah penskalaan kita ingin menggunakan algoritma kuantum.
ta_in: அளவிடுதல் சிக்கலைச் சமாளிக்க குவாண்டம் வழிமுறைகளைப் பயன்படுத்த விரும்புகிறோம்.

source: The nuclear Schroedinger equation is
id_id: Persamaan Schroedinger untuk inti adalah
ta_in: அணு ஷ்ரோடிங்கர் சமன்பாடு என்னவென்றால்

source: The so-called Watson Hamiltonian (neglecting vibro-rotational coupling terms) is
id_id: Maka Hamiltonian Watson (mengabaikan suku kopling vibro-rotational) dapat ditulis
ta_in: வாட்சன் ஹாமில்டோனியன் என்று அழைக்கப்படுவது (வைப்ரோ-சுழற்சி இணைப்பு விதிமுறை புறக்கணித்தல்)

source: where :math:`Q_l` are the harmonic mass-weighted normal coordinates.
id_id: dimana :math:` Q_l ` adalah massa terbobot harmonik pada koordinat normal.
ta_in: இங்கே :math:`Q_l` என்னவென்றால் ஹார்மோனிக் வெகுஜன எடையுள்ள சாதாரண ஆயத்தொகுப்புகள் ஆகும்.

source: where :math:`V_0` is the electronic energy of the reference geometry, the one-mode term :math:`V^{[l]}(Q_l)` represents the variation of the PES upon change of the :math:`l`-th normal coordinate from the equilibrium position. Similarly, the two-body potential :math:`V^{[l,m]}(Q_l, Q_m)` represents the change in the exact PES upon a simultaneous displacement along the :math:`l`-th and :math:`m`-th coordinates. Often, including terms up to three-body in the :math:`L`-body expansion is sufficient to obtain an accuracy of about 1~cm\ :math:`^{-1}`. We highlight that the many-body expansion of the potential operator defining the Watson Hamiltonian contains arbitrarily high coupling terms. This is a crucial difference compared to the non-relativistic electronic-structure Hamiltonian that contains only pairwise interactions.
ta_in: எங்கே:math: `V_0` என்பது குறிப்பு வடிவவியலின் மின்னணு ஆற்றல், ஒரு முறை சொல்:math:` V ^ {[l]} (Q_l) `:math:`l` மாற்றத்தின் போது PES இன் மாறுபாட்டைக் குறிக்கிறது. சமநிலை நிலையில் இருந்து சாதாரண ஒருங்கிணைப்பு. இதேபோல், இரண்டு-உடல் ஆற்றல்:math: `V ^ {[l, m]} (Q_l, Q_m)` ஒரே நேரத்தில் இடப்பெயர்ச்சி செய்யும்போது சரியான PES இன் மாற்றத்தைக் குறிக்கிறது:math: `l`-th மற்றும்:math: `m`-வது ஆயத்தொலைவுகள். பெரும்பாலும், கணிதத்தில் மூன்று உடல் வரையிலான சொற்கள் உட்பட:math: `L`-உடல் விரிவாக்கம் சுமார் 1 ~ செ.மீ of துல்லியத்தை பெற போதுமானது:math:` ^ {-1} `. வாட்சன் ஹாமில்டோனியனை வரையறுக்கும் சாத்தியமான ஆபரேட்டரின் பல உடல் விரிவாக்கம் தன்னிச்சையாக உயர் இணைப்பு சொற்களைக் கொண்டுள்ளது என்பதை நாங்கள் எடுத்துக்காட்டுகிறோம். சார்பியல் அல்லாத மின்னணு-கட்டமைப்பு ஹாமில்டோனியனுடன் ஒப்பிடும்போது இது ஒரு முக்கியமான வேறுபாடு, இது ஜோடிவரிசை இடைவினைகளை மட்டுமே கொண்டுள்ளது.

source: A flexible second quantization form of the Watson Hamiltonian is obtained within the so-called n-mode representation. Let us assume that each mode :math:`l` is described by a :math:`N_l`-dimensional basis set :math:`S_l` defined as follows:
id_id: Bentuk fleksibel kuantisasi kedua dari Hamiltonian Watson diperoleh dalam suatu representasi mode-n. Asumsikan bahwa setiap mode :math:` l ` dijelaskan oleh sebuah basis :math:` N_l `-dimensi himpunan :math:` S_l ` yang didefinisikan sebagai berikut:
ta_in: வாட்சன் ஹாமில்டோனியனின் நெகிழ்வான இரண்டாவது அளவீட்டு வடிவம் n- முறை பிரதிநிதித்துவம் என்று அழைக்கப்படுவதற்குள் பெறப்படுகிறது. ஒவ்வொரு பயன்முறையும்: :math:`l` விவரிக்கப்பட்டு :math:`N_l` பரிமாண அடிப்படை தொகுப்பு :math:`S_l` பின்வருமாறு வரையறுக்கப்பட்டுள்ளது:

source: The :math:`n`-mode wave function can be expanded in the product basis :math:`\mathcal{S} = \otimes_{i=1}^L \mathcal{S}_i` as the following CI-like expansion:
id_id: Fungsi gelombang mode-:math:` n ` dapat diperluas dalam basis perkalian produk :math:` \mathcal{S} = \otimes_ {i= 1} ^ L \mathcal{S}_i ` sebagai ekspansi CI-like berikut ini:
ta_in: :math:`n`-பயன்முறை அலை செயல்பாட்டை தயாரிப்பு அடிப்படையில் விரிவாக்கலாம் :math:`\mathcal{S} = \otimes_{i=1}^L \mathcal{S}_i` பின்வரும் CI போன்றது விரிவாக்கம்:

source: The many-body basis function :math:`\phi_{k_1}^{(1)}(Q_1) \cdots \phi_{k_L}^{(L)}(Q_L)` are encoded within the so-called :math:`n`-mode second quantization as occupation-number vectors (ONVs) as follows:
id_id: Fungsi basis badan-banyak :math:` \phi_{k_1}^ {(1)} (Q_ 1) \cdots \phi_{k_L}^ {(L)} (Q_L) ` dikodekan dalam kuantisasi kedua mode-:math:` n ` sebagai vektor bilangan pendudukan atau Occupation Number Vectors (ONVs) sebagai berikut:
ta_in: பல உடல் அடிப்படையிலான செயல்பாடு :math:`\phi_{k_1}^{(1)}(Q_1) \cdots \phi_{k_L}^{(L)}(Q_L)` ஆனது :math:`n`-பயன்முறை இரண்டாவது அளவாக குறியாக்கம் செய்யப்பட்டு occupation-number vectors (ONVs) ஆகா மாறியுள்ளது:

source: The ONV defined above is, therefore, the product of :math:`L` mode-specific ONVs, each one describing an individual mode. Since each mode is described by one and only one basis function, the occupation of each mode-specific ONV is one. From a theoretical perspective, each mode can be interpreted as a distinguishable quasi-particle (defined as phonons in solid-state physics). Distinguishability arises from the fact that the PES is not invariant by permutation of two modes, also in this case unlike the Coulomb interaction between two equal particles. From this perspective, a molecule can be interpreted as a collection of :math:`L` indistinguishable particles that interact through the PES operator.
id_id: Oleh karena itu, ONV yang didefinisikan di atas adalah produk dari :math:` L ` mode-spesifik ONV, yang masing-masing menggambarkan mode individu. Karena setiap mode digambarkan oleh satu dan hanya satu basis fungsi, pendudukan/occupation dari setiap mode-spesifik ONV adalah satu. Dari perspektif teoretis, setiap modus dapat diartikan sebagai suatu kuasi-partikel yang dapat dibedakan (didefinisikan sebagai fonon dalam fisika zat padat). Sifat kuasi-partikel yang dapat dibedakan ini muncul dari fakta bahwa PES tidak invarian oleh permutasi dua mode, juga dalam hal ini tidak seperti interaksi Coulomb antara dua partikel yang sama. Dari perspektif ini, sebuah molekul dapat diinterpretasikan sebagai kumpulan dari :math:` L ` partikel tak dapat dibedakan yang berinteraksi melalui operator PES.
ta_in: மேலே வரையறுக்கப்பட்ட ONV ஆனது :math:`L` பயன்முறை-குறிப்பிட்ட ONV களின் பெருக்குத்தொகை ஆகும். ஒவ்வொரு பயன்முறையும் ஒரே ஒரு அடிப்படை செயல்பாட்டால் விவரிக்கப்படுவதால், ஒவ்வொரு பயன்முறை-குறிப்பிட்ட ONV இன் ஆக்கிரமிப்பும் ஒன்றாகும். ஒரு தத்துவார்த்த கண்ணோட்டத்தில், ஒவ்வொரு பயன்முறையும் ஒரு தனித்துவமான quasi-துகள் (திட-நிலை இயற்பியலில் ஃபோனான்கள் என வரையறுக்கப்படுகிறது) என்று பொருள் கொள்ளலாம். இரண்டு முறைகள் வரிசைமாற்றத்தால் PES மாறாது என்பதில் இருந்து வேறுபாடு எழுகிறது, இந்த விஷயத்தில் இரண்டு சம துகள்களுக்கு இடையிலான கூலொம்ப் தொடர்பு போலல்லாமல். இந்த கண்ணோட்டத்தில், ஒரு மூலக்கூறானது :math:`L` தொகுப்புகள் கொண்ட PES ஆபரேட்டர் மூலம் தொடர்பு கொள்ளும் பிரித்தறிய முடியாத துகள்களாக விளக்கப்படலாம்.

source: with
id_id: dengan
ta_in: உடன்

source: The second quantization form is obtained by expressing the potential as
id_id: Bentuk kuantisasi kedua diperoleh dengan mengekspresikan potensial sebagai
ta_in: திறனை வெளிப்படுத்துவதன் மூலம் இரண்டாவது அளவீட்டு வடிவம் இவ்வாறு பெறப்படுகிறது

source: We highlight here the difference between the operators defined here above and the electronic structure one. First, as we already mentioned, the potential contains (in principle) three- and higher-body coupling terms that lead to strings with six (or more) second-quantization operators. Moreover, the Hamiltonian conserves the number of particles for each mode, as can be seen from the fact that the number of creation and annihilation operators for a given mode is the same in each term. Nevertheless, different modes are coupled by two- (and higher) body terms containing SQ operators belonging to different modes :math:`l` and :math:`m`.
id_id: Kami menyoroti perbedaan antara operator yang ditentukan di atas dan struktur elektronik satu. Pertama, seperti yang sudah disebutkan, potensial mengandung (pada prinsipnya) suku kopling badan-tiga dan -lebih tinggi yang mengarah ke string dengan enam (atau lebih) operator kuantisasi kedua. Selain itu, Hamiltonian tidak mengubah jumlah partikel untuk setiap mode, seperti yang dapat dilihat dari fakta bahwa jumlah operator penciptaan dan penihilan untuk sebuah modus tertentu sama dalam setiap suku. Namun, mode yang berbeda digabungkan oleh suku-suku badan-dua (dan -lebih tinggi) berisi operator SQ yang tergabung dalam mode yang berbeda :math:` l ` dan :math:` m `.
ta_in: மேலே வரையறுக்கப்பட்ட ஆபரேட்டர்களுக்கும் மின்னணு கட்டமைப்புக்கும் உள்ள வித்தியாசத்தை இங்கு எடுத்துக்காட்டுகிறோம். முதலாவதாக, நாம் ஏற்கனவே குறிப்பிட்டுள்ளபடி, உந்துசக்தியானது (கொள்கைப்படி) மூன்று- மற்றும் உயர்-உடல் இணைப்பு பகுதிகளானது ஆறு (அல்லது மேற்பட்ட) இரண்டாவது-அளவீட்டு ஆபரேட்டர்கள் வசிக்கும் ஸ்ட்ரிங்ற்கு அழைத்துச் செல்லும். மேலும், ஒவ்வொரு பயன்முறையிலும் துகள்களின் எண்ணிக்கையை ஹாமில்டோனியன் பாதுகாக்கிறது, கொடுக்கப்பட்ட பயன்முறையில் உருவாக்கம் மற்றும் நிர்மூலமாக்கல் ஆபரேட்டர்களின் எண்ணிக்கை ஒவ்வொரு காலத்திலும் ஒரே மாதிரியாக இருப்பதைக் காணலாம். ஆயினும்கூட, வெவ்வேறு முறைகள் வெவ்வேறு முறைகளுக்குச் சொந்தமான SQ ஆபரேட்டர்களைக் :math:`l` and :math:`m` கொண்ட இரண்டு (மற்றும் அதற்கு மேற்பட்ட) உடல் பகுதிகளால் இணைக்கப்படுகின்றன.

source: Reference: Ollitrault, Pauline J., et al., arXiv:2003.12578 (2020).
id_id: Referensi: Ollitrault, Pauline J., et al., arXiv:2003.12578 (2020).
ta_in: குறிப்பு: Ollitrault, Pauline J., et al., arXiv:2003.12578 (2020).

source: Compute the electronic potential
id_id: Menghitung potensial elektronik
ta_in: மின்னணு திறனைக் கணக்கிடுதல்

source: Solving the ESE for different nuclear configurations to obtain the PES function :math:`V(Q_1, \ldots, Q_L)`. So far Qiskit gives the possibility to approximate the PES with a quartic force field.
id_id: Memecahkan ESE ini untuk konfigurasi nuklir yang berbeda untuk mendapatkan fungsi PES :math:` V (Q_1, \ldots, Q_L) `. Sejauh ini Qiskit memungkinkan untuk memperkirakan PES dengan medan gaya kuartik.
ta_in: PES செயல்பாட்டைப் பெற வெவ்வேறு அணு உள்ளமைவுகளுக்கு ESE ஐத் தீர்ப்பது :math:`V(Q_1, \ldots, Q_L)`. இதுவரை Qiskit PES ஐ ஒரு குவார்டிக் ஃபோர்ஸ் புலத்துடன் தோராயமாக மதிப்பிடுவதற்கான வாய்ப்பை வழங்குகிறது.

source: The advantage of such form for the PES is that the anharmonic force fields (:math:`k_{ij}`, :math:`k_{ijk}`, :math:`k_{ijkl}`) can be calculated by finite-difference approaches. For methods for which the nuclear energy Hessian can be calculated analytically with response theory-based methods (such as HF and DFT), the quartic force field can be calculated by semi-numerical differentiation as:
id_id: Keuntungan dari bentuk tersebut untuk PES adalah bahwa medan gaya anharmonic (:math:` k_{ij}`, :math:` k_{ijk}`, :math:` k_{ijkl}`) dapat dihitung dengan pendekatan finite-difference. Untuk metode yang mana energi nuklir Hessian dapat dihitung secara analitik dengan metode berbasis teori respon (seperti HF dan DFT), medan gaya kuartik dapat dihitung oleh diferensiasi semi-numerik sebagai:
ta_in: PES க்கான அத்தகைய வடிவத்தின் நன்மை என்னவென்றால், அன்ஹார்மோனிக் படை புலங்களை (:math:`k_{ij}`, :math:`k_{ijk}`, :math:`k_{ijkl}`) வரையறுக்கப்பட்ட-வேறுபாடு அணுகுமுறைகளால் கணக்கிட முடியும். அணுசக்தி ஹெஸ்ஸியனை மறுமொழி கோட்பாடு அடிப்படையிலான முறைகள் (HF மற்றும் DFT போன்றவை) மூலம் பகுப்பாய்வு முறையில் கணக்கிடக்கூடிய முறைகளுக்கு, குவார்டிக் ஃபோர்ஸ் புலத்தை அரை எண் வேறுபாட்டால் கணக்கிடலாம்:

source: and
id_id: dan
ta_in: மற்றும்

source: Such numerical procedure is implemented, for instance, in the Gaussian suite of programs.
id_id: Prosedur numerik seperti ini diimplementasikan, misalnya, dalam rangkaian program Gaussian.
ta_in: இத்தகைய எண் நடைமுறை காஸ்ஸியன் தொகுப்புகளில் செயல்படுத்தப்படுகிறது.

source: In practice this can be done with Qiskit using the GaussianForceDriver.
id_id: Dalam praktiknya hal ini dapat dilakukan dengan Qiskit menggunakan GaussianForceDriver.
ta_in: நடைமுறையில் இதை காஸியன் ஃபோர்ஸ் டிரைவர் பயன்படுத்தி Qiskit மூலம் செய்யலாம்.

source: Map to a qubit Hamiltonian
id_id: Memetakan ke Hamiltonian qubit
ta_in: Qubit ஹாமில்டோனியனுக்கு வரைபடுத்துதல்

source: Now that we have an approximation for the potential, we need to write the Hamiltonian in second quantization. To this end we need to select a modal basis to calculate the one-body integrals :math:`\langle\phi_{k_i}| V(Q_i) | \phi_{h_i} \rangle`, two-body integrals :math:`\langle\phi_{k_i} \phi_{k_j}| V(Q_i,Q_j) | \phi_{h_i} \phi_{h_j} \rangle`\ …
id_id: Setelah kita memiliki perkiraan untuk potensial tersebut, kita perlu menulis Hamiltonian dalam kuantisasi kedua. Untuk tujuan ini, kita perlu memilih sebuah basis modal untuk menghitung integral badan-satu :math:` \langle\phi_{k_i}| V (Q_i) | \phi_{h_i} \rangle `, integral badan-dua :math:` \langle\phi_{k_i} \phi_{k_j}| V (Q_i, Q_j) | \phi_{h_i} \phi_{h_j} \rangle ` \ …
ta_in: இப்போது நாம் திறனுக்கான தோராயத்தைக் கொண்டுள்ளதால், ஹாமில்டோனியனை இரண்டாவது அளவீட்டில் எழுத வேண்டும். இந்த நோக்கத்திற்காக, ஒரு-உடல் ஒருங்கிணைப்புகளைக் கணக்கிட :math:`\langle\phi_{k_i}| V(Q_i) | \phi_{h_i} \rangle`, இரு-உடல் ஒருங்கிணைப்புகளைக் கணக்கிட :math:`\langle\phi_{k_i} \phi_{k_j}| V(Q_i,Q_j) | \phi_{h_i} \phi_{h_j} \rangle`\ ஒரு மாதிரி அடிப்படையைத் தேர்ந்தெடுக்க வேண்டும்…

source: In the simplest case, the :math:`\phi` functions are the harmonic-oscillator eigenfunctions for each mode. The main advantage of this choice is that the integrals of a PES expressed as a Taylor expansion are easy to calculate with such basis. A routine for computing these integrals is implemented in Qiskit.
id_id: Dalam kasus yang paling sederhana, fungsi :math:` \phi ` adalah fungsi eigen osilator harmonik untuk setiap mode. Keuntungan utama dari opsi ini adalah bahwa integral PES yang dinyatakan sebagai ekspansi Taylor mudah untuk dihitung dengan basis tersebut. Sebuah rutin untuk komputasi integral ini diimplementasikan dalam Qiskit.
ta_in: எளிமையான வழக்கில், :math:`\phi` செயல்பாடுகள் ஒவ்வொரு பயன்முறையிலும் ஹார்மோனிக்-ஆஸிலேட்டர் eigenfunctions ஆகும். இந்த தேர்வின் முக்கிய நன்மை என்னவென்றால், டெய்லர் விரிவாக்கமாக வெளிப்படுத்தப்படும் PES இன் ஒருங்கிணைப்புகள் அத்தகைய அடிப்படையில் கணக்கிட எளிதானது. இந்த ஒருங்கிணைப்புகளைக் கணக்கிடுவதற்கான ஒரு வழக்கம் Qiskit-ல் செயல்படுத்தப்படுகிறது.

source: The bosonic operator, :math:`\mathcal{H}_\text{vib}^{SQ}`, is then created and must be mapped to a qubit operator. The direct mapping introduced in the first section of this tutorial can be used is Qiskit as follows:
id_id: Operator bosonnya, :math:` \mathcal{H}_\text{vib}^{SQ}`, kemudian dibuat dan harus dipetakan ke operator qubit. Pemetaan langsung yang diperkenalkan pada bagian pertama tutorial ini dapat digunakan dalam Qiskit sebagai berikut:
ta_in: போசோனிக் ஆபரேட்டர், :math:`\mathcal{H}_\text{vib}^{SQ}`, பின்னர் உருவாக்கப்பட்டு, அது ஒரு qubit ஆபரேட்டருடன் பொருத்தப்பட வேண்டும். இந்த டுடோரியலின் முதல் பிரிவில் அறிமுகப்படுத்தப்பட்ட நேரடி மேப்பிங் பின்வருமாறு Qiskit-ல் பயன்படுத்தப்படலாம்:

source: In the previous cell we defined a bosonic transformation to express the Hamiltonian in the harmonic modal basis, with 2 modals per mode with the potential truncated at order 2 and the ‘direct’ boson to qubit mapping. The calculation is then ran as:
id_id: Dalam sel sebelumnya kami mendefinisikan transformasi bosonik untuk mengekspresikan Hamiltonian di basis modal harmonik, dengan 2 modal per mode dengan potensial dipotong di urutan 2 dan 'langsung' boson untuk pemetaan qubit. Perhitungan tersebut kemudian dijalankan sebagai:
ta_in: முந்தைய கலத்தில், ஹாமில்டோனியனை ஹார்மோனிக் மோடல் அடிப்படையில் வெளிப்படுத்த ஒரு போசோனிக் உருமாற்றத்தை நாங்கள் வரையறுத்துள்ளோம், ஒரு பயன்முறையில் 2 மோடல்கள் ஒழுங்கு 2 இல் துண்டிக்கப்பட்டுள்ள திறனுடன் மற்றும் மேப்பிங்கைத் தவிர்ப்பதற்கான ‘நேரடி’ போஸனுடன். கணக்கீடு பின்வருமாறு இயக்கப்படுகிறது:

source: To have a different number of modals per mode:
id_id: Untuk memiliki jumlah modals per mode yang berbeda:
ta_in: ஒரு பயன்முறையில் வெவ்வேறு எண்ணிக்கையிலான மோடல்களைக் கொண்டிருக்க:

source: Now that the Hamiltonian is ready, it can be used in a quantum algorithm to find information about the vibronic structure of the corresponding molecule. Check out our tutorials on Ground State Calculation and Excited States Calculation to learn more about how to do that in Qiskit!
id_id: Ketika Hamiltonian sudah siap, itu dapat digunakan di algoritma kuantum untuk menemukan informasi tentang struktur elektronik dari molekul yang berkaitan. Lihat tutorial tentang Perhitungan State Dasar dan Eksitasi untuk mempelajari lebih lanjut tentang bagaimana melakukan itu di Qiskit!
ta_in: இப்போது ஹாமில்டோனியன் தயாராக இருப்பதால், அதனுடன் தொடர்புடைய மூலக்கூறின் வைப்ரானிக் அமைப்பு குறித்த தகவல்களைக் கண்டுபிடிக்க ஒரு குவாண்டம் வழிமுறையைப் பயன்படுத்தலாம். Qiskit-ல் அதை எப்படி செய்வது என்பது பற்றி மேலும் அறிய அடி நிலை கணக்கீடு மற்றும் கிளர்வுற்ற நிலை கணக்கீடு பற்றிய எங்கள் பயிற்சிகளைப் பாருங்கள்!

source: :math:`\mathcal{H}_\text{vib}` must be mapped to an operator that acts on the states of a given set of :math:`N_q` qubits in order to calculate its eigenfunctions on quantum hardware. In electronic structure calculations, the mapping is achieved by expressing the non-relativistic electronic Hamiltonian in second quantization, :nbsphinx-math:`\textit{i.e.}` by projecting it onto the complete set of antisymmetrized occupation number vectors (ONV) generated by a given (finite) set of orbitals. To encode the vibrational Hamiltonian in an analogous second quantization operators, we expand the potential :math:`V(Q_1, \ldots, Q_L)` with the :math:`n`-body expansion as follows:
id_id: :math:` \mathcal{H}_\text{vib}` harus dipetakan sebagai operator yang dikenakan pada keadaan dari suatu set tertentu dari :math:` N_q ` qubits dalam rangka untuk menghitung fungsieigen pada perangkat keras kuantum. Dalam perhitungan struktur elektronik, pemetaan dicapai dengan mengekspresikan Hamiltonian elektronik non-relativistik dalam kuantisasi kedua, :nbsphinx-math:`\textit{i.e.}` dengan memproyeksikan itu ke set yang lengkap ke occupation number vectors (ONV) tak simetri yang dihasilkan oleh himpunan orbital (tertentu). Untuk mengkodekan Hamiltonian vibrasi dalam sebuah analog seperti operator kuantisasi kedua, kita ekspasikan potensial :math:` V (Q_1, \ldots, Q_L) ` dengan :math:` n `-benda sebagai berikut:

source: Based on this second-quantization representation we introduce a pair of creation and annihilation operators per mode :math:`l` :nbsphinx-math:`\textit{and}` per basis function :math:`k_l` defined as:
id_id: Berdasarkan represenatsi kuantisasi kedua ini, diperkenalkan suatu pasangan operator penciptaan dan penihilan setiap mode :math:`l` :nbsphinx-math:`\textit{and}` untuk setiap fungsi basis :math:`k_l` yang didefinisikan sebagai:
