Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/chemistry/03_ground_state_solvers.po
Languages: es_un, fr_fr, id_id, ja_jp, pt_br

source: This page was generated from `tutorials/chemistry/03_ground_state_solvers.ipynb`__.
es_un: Esta página fue generada a partir de `tutorials/chemistry/03_ground_state_solvers.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/chemistry/03_ground_state_solvers.ipynb`__.
id_id: Halaman ini dihasilkan dari ` tutorials/chemistry/02_vibronic_structure.ipynb ` __.
ja_jp: 当ページは `tutorials/chemistry/03_ground_state_solvers.ipynb`__ から生成されました。
pt_br: Esta página foi gerada a partir do `tutorials/chemistry/1_programmatic_approach.ipynb`__.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/03_ground_state_solvers.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/03_ground_state_solvers.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/03_ground_state_solvers.ipynb>_.
id_id: Jalankan secara interaktif di ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/02_vibronic_structure.ipynb>` _.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/03_ground_state_solvers.ipynb>`_ でインタラクティブに実行します。
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/03_ground_state_solvers.ipynb>`_.

source: Ground state solvers
es_un: Solucionadores para el estado base
fr_fr: Solveurs d'état au sol (``Ground State Solvers``)
id_id: Solver keadaan dasar (ground state)
ja_jp: 基底状態ソルバー
pt_br: Solucionadores de estado fundamental

source: Introduction
es_un: Introducción
id_id: Pengantar
ja_jp: はじめに
pt_br: Introdução

source: In this tutorial we are going to discuss the ground state calculation interface of Qiskit Chemistry. The goal is to compute the ground state of a molecular Hamiltonian. This Hamiltonian can be electronic or vibronic. To know more about the preparation of the Hamiltonian, check out the Electronic structure and Vibronic structure tutorials.
es_un: En este tutorial hablaremos de la interfaz de cálculo del estado base de Qiskit Chemistry. El objetivo es calcular el estado base de un Hamiltoniano molecular. Este Hamiltoniano puede ser electrónico o vibrónico. Para conocer más acerca de la preparación del Hamiltoniano, revisa los tutoriales de estructura Electrónica y Vibrónica.
fr_fr: Dans ce tutoriel, nous allons discuter de l'interface pour le calcul de l'état fondamental avec Qiskit Chemistry. L'objectif est de calculer l'état fondamental d'un hamiltonien moléculaire. Cet hamiltonien peut être électronique ou vibronique. Pour en savoir plus sur la préparation de l'hamiltonien, consultez les tutoriels de la structure électronique et les tutoriels de la structure vibronique.
id_id: Dalam tutorial ini kita akan membahas tentang antarmuka kalkulasi keadaan dasar Qiskit Chemistry. Tujuannya adalah untuk menghitung keadaan dasar dari Hamiltonian molekul. Hamiltonian ini dapat berupa elektronik atau vibronik. Untuk mengetahui lebih lanjut tentang preparasi Hamiltonian-nya, cek tutorial Struktur Elektronik dan Vibronik.
ja_jp: このチュートリアルでは、 Qiskit Chemistry の基底状態計算インターフェースについて説明します。目標は、分子ハミルトニアンの基底状態を計算することです。このハミルトニアンは、電子的あるいは振動的なものである可能性があります。ハミルトニアンの準備についての詳細は、電子構造と振動構造のチュートリアルをチェックしてください。
pt_br: Neste tutorial vamos discutir a interface de cálculo de estado fundamental do Qiskit Chemistry. O objetivo é computar o estado fundamental de um Hamiltoniano molecular. Este Hamiltoniano pode ser eletrônico ou vibrônico. Para saber mais sobre a preparação do Hamiltoniano, confira os tutoriais de Estrutura Eletrônica e Estrutura Vibrônica.

source: The first step is to define the molecular system. In the following we ask for the electronic part of a hydrogen molecule.
es_un: El primer paso es definir el sistema molecular. A continuación, pedimos la parte electrónica de una molécula de hidrógeno.
fr_fr: La première étape consiste à définir le système moléculaire. Dans se qui suit, nous demandons la partie électronique d'une molécule d'hydrogène.
id_id: Langkah pertama adalah mendefinisikan sistem molekular. Berikut kita akan mencari bagian elektronik dari molekul hidrogen.
ja_jp: まず分子系の定義から始めます。以下では、水素分子の電子部分を求めています。
pt_br: O primeiro passo é definir o sistema molecular. A seguir, pedimos a parte eletrônica de uma molécula de hidrogênio.

source: The Solver
es_un: El Solucionador
fr_fr: Le Solveur (``The Solver``)
id_id: Solver
ja_jp: ソルバー
pt_br: O Solucionador

source: Then we need to define a solver. The solver is the algorithm through which the ground state is computed.
es_un: Después necesitamos definir un solucionador. El solucionador es el algoritmo mediante el cual el estado base es calculado.
fr_fr: Ensuite, nous devons définir un solveur (``Solver``) : le solveur est l'algorithme par lequel l'état du sol (``Ground State``) est calculé.
id_id: Kemudian kita perlu mendefinisikan solver. Solver adalah algoritma yang emnghitung keadaan dasar.
ja_jp: 次に、ソルバーを定義する必要があります。ソルバーとは、基底状態を求めるアルゴリズムのことです。
pt_br: Então precisamos definir um solucionador. O solucionador é o algoritmo através do qual o estado fundamental é computado.

source: Let’s first start with a purely classical example: the NumPy minimum eigensolver. This algorithm exactly diagonalizes the Hamiltonian. Although it scales badly, it can be used on small systems to check the results of the quantum algorithms.
es_un: Comencemos primero con un ejemplo puramente clásico: el solucionador propio (eigensolver) mínimo de NumPy. Este algoritmo diagonaliza exactamente al hamiltoniano. Aunque escala mal, se puede usar en sistemas pequeños para verificar los resultados de los algoritmos cuánticos.
pt_br: Vamos começar com um exemplo puramente clássico: o NumPy minimum eigensolver. Esse algoritmo diagonaliza exatamente o Hamiltoniano. Embora escalone mal, ele pode ser usado em sistemas pequenos para verificar os resultados dos algoritmos quânticos.

source: To find the ground state we coul also use the Variational Quantum Eigensolver (VQE) algorithm. The VQE algorithms works by exchanging information between a classical and a quantum computer as depicted in the following figure.
es_un: Para encontrar el estado base también podríamos usar el algoritmo Variational Quantum Eigensolver (VQE). El algoritmo VQE funciona intercambiando información entre una computadora clásica y una computadora cuántica, cómo se muestra en la siguiente figura.
fr_fr: Pour trouver l'état fondamental (``Ground State``), nous utilisons également l'algorithme Variational Quantum Eigensolver (VQE). Les algorithmes VQE fonctionnent en échangeant des informations entre un ordinateur classique et un ordinateur quantique, tel que décrit dans la figure suivante.
id_id: Untuk menemukan keadaan dasar kita dapat pula menggunakan algoritma Variational Quantum Eigensolver (VQE). Algoritme VQE bekerja dengan cara menukarkan informasi antara komputer klasik dan komputer kuantum seperti yang digambarkan dalam gambar berikut.
ja_jp: 基底状態を見つけるために、変分量子固有ソルバー (VQE) アルゴリズムを用いることもできます。 VQE アルゴリズムは次の図に示すように、古典コンピューターと量子コンピューターの間で情報を交換することによって動作します。
pt_br: Para encontrar o estado fundamental que poderiamos também usar o algoritmo Variational Quantum Eigensolver (VQE). Os algoritmos de VQE funcionam trocando informações entre um computador clássico e um quântico como retratado na figura a seguir.

source: Let’s initialize a VQE solver.
es_un: Inicialicemos un solucionador de VQE.
fr_fr: Initialisons un solveur VQE.
id_id: Mari kita menginisialisasi solver VQE.
ja_jp: VQE ソルバーを初期化しましょう。
pt_br: Vamos inicializar um solucionador VQE.

source: To define the VQE solver one needs two essential elements:
es_un: Para definir el solucionador de VQE necesitamos dos elementos esenciales:
fr_fr: Pour définir le solveur VQE on a besoin de deux éléments essentiels :
id_id: Untuk menentukan solver VQE, diperlukan dua elemen esensial:
ja_jp: VQE ソルバーを定義するには、二つの重要な要素が必要です。
pt_br: Para definir o solucionador VQE precisamos de dois elementos essenciais:

source: A variational form: here we use the Unitary Coupled Cluster (UCC) ansatz (see for instance [Physical Review A 98.2 (2018): 022322]). Since it is a chemistry standard, a factory is already available allowing a fast initialization of a VQE with UCC. The default is to use all single and double excitations. However, the excitation type (S, D, SD) as well as other parameters can be selected.
es_un: Una forma variacional: aquí utilizamos el Ansatz del Clúster Unido Unitario (UCC) (ver [Physical Review A 98.2 (2018): 022322]). Ya que es un estándar en la química, una fábrica que permite una rápida inicialización de un VQE con UCC ya está disponible. Por defecto se usan todas las excitaciones simples y dobles. Sin embargo, se pueden seleccionar las excitaciones de tipo (S, D, SD) así como otros parámetros.
fr_fr: Une forme variationnelle : ici nous utilisons l'ansatz Unitary Coupled Cluster (UCC) (voir par exemple [Physical Review A 98,2 (2018): 022322]). Comme il s'agit d'un standard chimique, une manufacture est déjà disponible, permettant une initialisation rapide d'un VQE avec UCC. La valeur par défaut est d'utiliser toutes les excitations simples et doubles, mais le type d'excitation (S, D, SD) ainsi que d'autres paramètres peuvent être sélectionnés.
id_id: Bentuk yang variasional: di sini kita menggunakan Unitary Coupled Cluster (UCC) ansatz (lihat pada misalnya [Physical Review A 98.2 (2018): 022322]). Karena ini adalah standar kimia, sebuah factory sudah tersedia yang memungkinkan inisialisasi cepat dari VQE dengan UCC. Default-nya adalah menggunakan semua eksitasi tunggal dan ganda. Namun, jenis eksitasi (S, D, SD) serta parameter lainnya dapat dipilih.
ja_jp: 変分形式: ここでは、ユニタリー結合クラスター (UCC) のansatz (例として、[Physical Review A 98.2 (2018): 022322] を参照してください) を使用します。これは化学の標準なので、UCC を用いた VQE の高速な初期化を可能にするファクトリーが既に利用できます。デフォルトでは、全ての一電子励起と二電子励起を使用します。しかし、励起タイプ (S, D, SD) だけでなく、他のパラメーターを選択することもできます。
pt_br: Uma forma variacional: aqui usamos o ansatz de Cluster Acoplado Unitário (UCC) (ver, por exemplo, [Physical Review A 98.2 (2018): 022322]). Uma vez que é um padrão da química, já está disponível uma fábrica que permite uma inicialização rápida de um VQE com um UCC. O padrão é usar todas as excitações simples e duplas. No entanto, o tipo de excitação (S, D, SD), bem como outros parâmetros podem ser selecionados.

source: An initial state: the initial state of the qubits. In the factory used above, the qubits are initialized in the Hartree-Fock (see the electronic structure tutorial) initial state (the qubits corresponding to occupied MOs are :math:`|1\rangle` and those corresponding to virtual MOs are :math:`|0\rangle`.
es_un: Un estado inicial: el estado inicial de los qubits. En la fabrica usada anteriormente, los qubits son inicializados al estado inicial de Hartree-Fock (ver el tutorial de estructura electrónica), (los qubits que corresponden a orbitales moleculares ocupados son :math:`|1\rangle` y los que corresponden a orbitales moleculares virtuales son :math:`|0\rangle`).
fr_fr: Un état initial : l'état initial des qubits. Dans la manufacture utilisée ci-dessus, les qubits sont initialisés dans le Hartree-Fock (voir le tutoriel de la structure électronique) état initial (les qubits correspondant aux MOs occupés sont :math:`|1\rangle` et ceux correspondant aux MOs virtuels sont :math:`|0\rangle`.
id_id: Sebuah keadaan awal: keadaan awal dari qubits. Pada factory yang digunakan di atas, qubit diinisialisasi dalam Hartree-Fock (lihat tutorial struktur elektronik) keadaan awal (qubits yang sesuai dengan MOs yang diduduki adalah :math:` | 1\rangle ` dan yang sesuai dengan MOs virtual adalah :math:` | 0\rangle `.
ja_jp: 量子ビットの初期状態: 上記のファクトリーで、量子ビットは Hartree-Fock (電子構造チュートリアルを参照) の初期状態で初期化されています (被占軌道に対応する量子ビットは :math:`|1\rangle` 、空軌道に対応する量子ビットは :math:`|0\rangle` です) 。
pt_br: Um estado inicial: o estado inicial dos qubits. Na fábrica usada acima, os qubits são inicializados no estado inicial de Hartree-Fock (veja o tutorial de estrutura eletrônica) (os qubits correspondentes aos MOs ocupados são :math:`|1\rangle` e aqueles que correspondem aos MOs virtuais são :math:`|0\rangle`.

source: The backend: this is the quantum machine on which the right part of the figure above will be performed. Here we ask for the perfect quantum emulator (``statevector_simulator``).
es_un: El backend: esta es la máquina cuántica en la cual la parte derecha de la figura anterior va a ser ejecutada. Aquí pedimos el emulador cuántico perfecto (``statevector_simulator``).
fr_fr: Le backend (``Backend``): c'est la machine quantique sur laquelle la partie droite de la figure ci-dessus sera effectuée. Ici nous demandons l'émulateur quantique parfait (` ` statevector_simulateur ` `).
id_id: Backend: ini adalah mesin kuantum yang akan dioperasikan pada bagian kanan dari gambar di atas. Di sini kita meminta emulator kuantum sempurna (` ` statevector_simulator ` `).
ja_jp: バックエンド: これは上図の右の部分が実行される量子マシンです。ここでは、完璧な量子エミュレーター (``statevector_simulator``) を用います。
pt_br: O backend: esta é a máquina quântica na qual a parte à direita da figura acima será executada. Aqui pedimos pelo emulador quântico perfeito (``statevector_simulator``).

source: One could also use any available variational form / initial state or even define one’s own. For instance,
es_un: Uno podría usar cualquier forma variacional / estado inicial disponible, o incluso definir uno propio. Por ejemplo,
fr_fr: On pourrait aussi utiliser n'importe quelle forme variationnelle disponible / état initial, ou même définir sa/son propre. Par exemple,
id_id: Dapat pula digunakan bentuk variasional apa saja yang tersedia/keadaan awal atau bahkan mendefinisikannya sendiri. Sebagai contoh,
ja_jp: また、任意の利用可能な変分形式・初期状態を使用することもできますし、独自に定義することも可能です。以下にその例を示します。
pt_br: Também poderia-se usar qualquer forma variacional disponível / estado inicial ou até mesmo definir um próprio. Por exemplo,

source: The calculation and results
es_un: El cálculo y los resultados
fr_fr: Le calcul et les résultats
id_id: Perhitungan dan hasilnya
ja_jp: 計算と結果
pt_br: O cálculo e os resultados

source: We are now ready to run the calculation.
es_un: Ahora estamos listos para ejecutar el cálculo.
fr_fr: Nous sommes maintenant prêts à effectuer le calcul.
id_id: Kita sekarang siap untuk menjalankan kalkulasi.
ja_jp: これで計算を実行する準備が整いました。
pt_br: Estamos agora prontos para executar o cálculo.

source: We can compare the VQE results to the NumPy exact solver and see that they match.
es_un: Podemos comparar los resultados de VQE con el solucionador exacto de NumPy y ver que sí coinciden.
fr_fr: Nous pouvons comparer les résultats du VQE au solveur exact de NumPy et voir qu'ils correspondent.
id_id: Kita dapat membandingkan hasil VQE dengan solver eksak NumPy dan melihat bahwa mereka cocok.
ja_jp: NumPy の正確なソルバーと比較して、VQE の結果が一致していることを確認できます。
pt_br: Podemos comparar os resultados do VQE com o solucionador exato NumPy e ver que eles correspondem.

source: Using a filter function
es_un: Usando una función filtro
fr_fr: Utiliser une fonction de filtre
id_id: Menggunakan sebuah fungsi filter
ja_jp: フィルター関数の使用
pt_br: Usando uma função de filtro

source: Sometimes the true ground state of the Hamiltonian is not of interest because it lies in a different symmetry sector of the Hilbert space. In this case the NumPy eigensolver can take a filter function to return only the eigenstates with for example the correct number of particles. This is of particular importance in the case of vibronic structure calculations where the true ground state of the Hamiltonian is the vacuum state. A default filter function to check the number of particles is implemented in the different transformations and can be used as
es_un: A veces el verdadero estado del Hamiltoniano no es de interés ya que yace en un sector de simetría distinto del espacio de Hilbert. En este caso, el NumPy eigensolver puede tomar una función filtro para devolver solo los eigenestados con, por ejemplo, el número correcto de partículas. Esto es de particular importancia en el caso de los cálculos de estructuras vibrónicas donde el estado real del Hamiltoniano es el estado de vacío cuántico. Una función filtro predeterminada para revisar el número de partículas es implementado en las diferentes transformaciones y puede ser usado como
fr_fr: Parfois, le véritable état au sol des Hamiltoniens n'est pas intéressant parce qu'il se trouve dans un autre secteur de symétrie de l'espace Hilbert. Dans ce cas, le NumPy eigensolver peut prendre une fonction de filtre pour retourner seulement les eigenstates avec par exemple le nombre correct de particules. Ceci est particulièrements important dans le cas des calculs de structures vibroniques où le véritable état au sol du Hamiltonien est l'état du vide. Une fonction de filtre par défaut pour vérifier le nombre de particules est implémentée dans les différentes transformations et peut être utilisée comme
id_id: Terkadang keadaan dasar sebenarnya dari Hamiltonian tidak menarik karena terletak pada sektor simetri yang berbeda dari ruang Hilbert. Dalam hal ini NumPy eigensolver dapat mengambil fungsi filter untuk mengembalikan hanya keadaan eigen-nya saja, misalnya jumlah partikel yang benar. Hal ini sangat penting dalam kasus perhitungan struktur vibronik di mana keadaan dasar sesungguhnya dari Hamiltonian adalah keadaan vakum. Fungsi filter bawaan untuk memeriksa jumlah partikel diimplementasikan dalam transformasi yang berbeda dan dapat digunakan sebagai
ja_jp: ハミルトニアンの真の基底状態がヒルベルト空間の異なる対称性領域にあるため、そうした解に興味がないという場合もあります。こうした場合に NumPy 固有値ソルバーは、フィルター関数を取って、正しい粒子数をもつ固有状態だけを返すようにすることが可能です。これは特に、ハミルトニアンの真の基底状態が真空状態となる、振動構造計算の場合に重要です。粒子数をチェックするためのデフォルトのフィルター関数は、様々な変換に実装されており、以下のように用いることができます。
pt_br: Às vezes, o verdadeiro estado fundamental do Hamiltoniano não é de interesse, porque reside num sector de simetria diferente do espaço de Hilbert. Neste caso o NumPy eigensolver pode pegar uma função de filtro para retornar apenas os autoestados com, por exemplo, o número correto de partículas. Isto é particularmente importante no caso de cálculos de estruturas vibrônicas em que o verdadeiro estado fundamental do Hamiltonismo é o estado de vácuo. Uma função de filtro padrão para verificar o número de partículas é implementada nas diferentes transformações e pode ser usada como

source: Let’s first start with a purely classical example: the NumPy minimum eigensolver. This algorithm exactly diagonalizes the Hamiltonian. Although it scales badely, it can be used on small systems to check the results of the quantum algorithms.
ja_jp: まず、純粋に古典的な NumPy の最小固有値ソルバーの例から始めましょう。このアルゴリズムは、ハミルトニアンを正確に対角化します。これは規模の大きな問題には適用できませんが、小さな系で量子アルゴリズムの結果を確認するために用いることができます。
