Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/chemistry/04_excited_states_solvers.po
Languages: fr_fr, id_id, ja_jp, pt_br, ta_in

source: This page was generated from `tutorials/chemistry/04_excited_states_solvers.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/chemistry/04_excited_states_solvers.ipynb`__.
id_id: Halaman ini dihasilkan dari ` tutorials/chemistry/02_vibronic_structure.ipynb ` __.
ja_jp: 当ページは `tutorials/chemistry/04_excited_states_solvers.ipynb`__ から生成されました。
pt_br: Esta página foi gerada a partir do `tutorials/chemistry/04_excited_states_solvers.ipynb`__.
ta_in: இந்த பக்கம் `tutorials/chemistry/04_excited_states_solvers.ipynb`__ இல் இருந்து உருவாக்கப்பட்டது.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/04_excited_states_solvers.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/04_excited_states_solvers.ipynb>_.
id_id: Jalankan secara interaktif di ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/02_vibronic_structure.ipynb>` _.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/04_excited_states_solvers.ipynb>`_ でインタラクティブに実行します。
pt_br: Execute interativamente no `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/04_excited_states_solvers.ipynb>`_.
ta_in: ஊடாடும் வகையில் `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/04_excited_states_solvers.ipynb>`_ இயக்கவும்.

source: Excited states solvers
fr_fr: Solveurs d'états excités (``excited states``)
id_id: Solver keadaan tereksitasi
ja_jp: 励起状態ソルバー
pt_br: Solucionador de estados excitados
ta_in: கிளர்வுற்ற நிலை தீர்வுகள்

source: Introduction
id_id: Pengantar
ja_jp: はじめに
pt_br: Introdução
ta_in: முன்னுரை

source: In this tutorial we are going to discuss the excited states calculation interface of Qiskit Chemistry. The goal is to compute the excited states of a molecular Hamiltonian. This Hamiltonian can be electronic or vibronic. To know more about the preparation of the Hamiltonian, check out the Electronic structure and Vibronic structure tutorials.
fr_fr: Dans ce tutoriel, nous allons discuter de l'interface de calcul des états excités (``excited states``) de Qiskit Chemistry. Le but est de calculer les états excités d'un Hamiltonien moléculaire. Cet Hamiltonien peut être électronique ou vibronique. Pour en savoir plus sur la préparation de l'Hamiltonien, consultez les tutoriels sur la structure électronique et les tutoriels sur la structure vibronique.
id_id: Dalam tutorial ini kita akan membahas tentang antarmuka kalkulasi keadaan tereksitasi di Qiskit Chemistry. Tujuannya adalah untuk menghitung keadaan tereksitasi dari Hamiltonian molekul. Hamiltonian ini dapat berupa elektronik atau vibronik. Untuk mengetahui lebih lanjut tentang preparasi Hamiltonian-nya, cek tutorial Struktur Elektronik dan Vibronik.
ja_jp: このチュートリアルでは、 Qiskit Chemistry の励起状態計算インターフェースについて説明します。目標は、分子ハミルトニアンの励起状態を計算することです。このハミルトニアンは、電子的あるいは振動的なものである可能性があります。ハミルトニアンの準備についての詳細は、電子構造と振動構造のチュートリアルをチェックしてください。
pt_br: Neste tutorial vamos discutir a interface de cálculo de estados excitados do Qiskit Chemistry. O objetivo é computar os estados excitados de um Hamiltoniano molecular. Este Hamiltoniano pode ser eletrônico ou vibrônico. Para saber mais sobre a preparação do Hamiltoniano, confira os tutoriais de Estrutura Eletrônica e Estrutura Vibrônica.
ta_in: இந்த பயிற்சியில் Qiskit வேதியியலின் கிளர்வுற்ற நிலைகளின் கணக்கீட்டு இடைமுகத்தைப் பற்றி விவாதிக்க உள்ளோம். ஒரு மூலக்கூறு ஹாமில்டோனியனின் கிளர்வுற்ற நிலைகளைக் கணக்கிடுவதே குறிக்கோள். இந்த ஹாமில்டோனியன் மின்னணு அல்லது வைப்ரோனிக் ஆகவும் இருக்கலாம். ஹாமில்டோனியனைத் தயாரிப்பது பற்றி மேலும் அறிய, மின்னணு அமைப்பு மற்றும் வைப்ரோனிக் கட்டமைப்பு பயிற்சிகளைப் பாருங்கள்.

source: The first step is to define the molecular system. In the following we ask for the electronic part of a hydrogen molecule.
fr_fr: La première étape consiste à définir le système moléculaire. Dans se qui suit, nous demandons la partie électronique d'une molécule d'hydrogène.
id_id: Langkah pertama adalah mendefinisikan sistem molekuler. Berikut kita akan mencari bagian elektronik dari molekul hidrogen.
ja_jp: まず分子系の定義から始めます。以下では、水素分子の電子部分を求めています。
pt_br: O primeiro passo é definir o sistema molecular. A seguir, pedimos a parte eletrônica de uma molécula de hidrogênio.
ta_in: முதல் படியானது மூலக்கூறு அமைப்பை வரையறுப்பது. பின்வருவனவற்றில் ஒரு ஹைட்ரஜன் மூலக்கூறின் மின்னணு பகுதியைக் கேட்கிறோம்.

source: The Solver
fr_fr: Le Solveur (``The Solver``)
id_id: Solver
ja_jp: ソルバー
pt_br: O Solucionador
ta_in: தீர்வி

source: Then we need to define a solver. The solver is the algorithm through which the ground state is computed.
fr_fr: Ensuite, nous devons définir un solveur (``Solver``). Le solveur est l'algorithme par lequel l'état du sol (``Ground State``) est calculé.
id_id: Kemudian kita perlu mendefinisikan solver. Solver adalah algoritma yang menghitung keadaan dasar.
ja_jp: 次に、ソルバーを定義する必要があります。ソルバーとは、基底状態を求めるアルゴリズムのことです。
pt_br: Então precisamos definir um solucionador. O solucionador é o algoritmo através do qual o estado fundamental é computado.
ta_in: நாம் ஒரு தீர்வியை வரையறுக்க வேண்டும். தீர்வி என்பது அடி நிலை கணக்கிடப்படும் வழிமுறையாகும்.

source: Letâ€™s first start with a purely classical example: the NumPy eigensolver. This algorithm exactly diagonalizes the Hamiltonian. Although it scales badely, it can be used on small systems to check the results of the quantum algorithms. Here, we are only interested to look at eigenstates with a given number of particle. To compute only those states a filter function can be passed to the NumPy eigensolver. A default filter function is already implemented in Qiskit and can be used in this way:
id_id: Mari kita mulai dengan contoh klasik: eigensolver NumPy. Algoritma ini secara tepat mendiagonalisasi Hamiltonian. Meskipun berskala buruk, algoritma ini dapat digunakan pada sistem kecil untuk memeriksa hasil algoritma kuantum. Di sini, kita hanya tertarik untuk melihat keadaan eigen dengan sejumlah partikel tertentu. Untuk menghitung keadaan-keadaan tersebut, fungsi filter dapat diteruskan ke eigensolver NumPy. Fungsi filter default sudah diterapkan di Qiskit dan dapat digunakan sebagai berikut:

source: The excitation energies can also be accessed with the qEOM algorithm [arXiv preprint arXiv:1910.12890 (2019)]. The EOM method finds the excitation energies (differences in energy between the ground state and all :math:`n`\ th excited states) by solving the following pseudo-eigenvalue problem.
fr_fr: Les énergies d'excitation sont également accessibles avec l'algorithme qEOM [arXiv preprint arXiv:1910.12890 (2019)]. La méthode EOM trouve les énergies d'excitation (différences d'énergie entre l'état fondamental et tous les états excités de :math:`n`\ ) en résolvant le problème de pseudo-valeur propre (``pseudo-eigenvalue``) suivant.
id_id: Energi eksitasi juga dapat diakses dengan algoritma qEOM [arXiv preprint arXiv:1910.12890 (2019)]. Metode EOM mencari energi eksitasi (perbedaan energi antara keadaan dasar dan semua :math:` n ` n keadaan tereksitasi) dengan memecahkan permasalahan pseudo-eigenvalue berikut.
ja_jp: 励起エネルギーは、 qEOM アルゴリズム [arXiv preprint arXiv:1910.12890 (2019)] によっても求めることができます。 EOM 法は、以下の擬似固有値問題を解くことにより、励起エネルギー (基底状態と全ての第 :math:`n` 励起状態との間のエネルギー差) を求めます。
pt_br: As energias de excitação também podem ser acessadas com o algoritmo qEOM [arXiv preprint arXiv:1910.12890 (2019)]. O método EOM encontra as energias de excitação (diferenças de energia entre o estado fundamental e todos os :math:`n`\ th estados excitados) resolvendo o seguinte problema de pseudo-autovalor.
ta_in: கிளர்வுற்ற ஆற்றல்களை qEOM வழிமுறை [arXiv preprint arXiv: 1910.12890 (2019)] உடன் அணுகலாம். பின்வரும் pseudo-eigenvalue சிக்கலைத் தீர்ப்பதன் மூலம் கிளர்வுற்ற ஆற்றல்களை (அடி நிலைக்கும் எல்லாவற்றிற்கும் இடையிலான ஆற்றலில் உள்ள வேறுபாடுகள் :math: `n`\ th கிளர்வுற்ற நிலைகள்) EOM முறை காண்கிறது.

source: with
fr_fr: avec
id_id: dengan
ja_jp: ただし
pt_br: com
ta_in: உடன்

source: Although the previous equation can be solved classically, each matrix element must be measured on the quantum computer with the corresponding ground state. To use the qEOM as a solver in Qiskit, we have to define a ground state calculation first, explaining the algorithms how to find the ground state. With this the qEOM solver can be initialized:
fr_fr: Bien que l'équation précédente puisse être résolue classiquement, chaque élément de la matrice doit être mesuré sur l'ordinateur quantique avec l'état de sol (``ground state``) correspondant. Pour utiliser qEOM comme un solveur dans Qiskit, nous devons d'abord définir un calcul de l'état du sol (``ground state``) expliquant aux algorithmes comment trouver l'état du sol (``ground state``). Avec cela, le solveur qEOM peut être initialisé :
id_id: Meskipun persamaan sebelumnya dapat diselesaikan secara klasik, setiap elemen matriks harus diukur pada komputer kuantum dengan keadaan dasar yang bersesuaian. Untuk menggunakan qEOM sebagai solver di Qiskit, kita harus menentukan penghitungan keadaan dasar terlebih dahulu, menjelaskan algoritma cara menemukan keadaan dasar. Dengan ini solver qEOM dapat diinisialisasi:
ja_jp: 上の方程式は古典的に解くことができますが、各行列要素は対応する基底状態を量子コンピューター上で測定しなければなりません。 qEOM を Qiskit のソルバーとして使用するには、まず基底状態の計算を定義し、基底状態を得るためのアルゴリズムを設定します。これにより、 qEOM ソルバーを初期化することができます。
pt_br: Embora a equação anterior possa ser resolvida classicamente, cada elemento da matriz deve ser medido no computador quântico com o estado fundamental correspondente. Para usar o qEOM como um solucionador no Qiskit, temos que definir um cálculo do estado fundamental primeiro, explicando aos algoritmos como encontrar o estado fundamental. Com isso o solucionador qEOM pode ser inicializado:
ta_in: முந்தைய சமன்பாட்டை சிறப்பாக தீர்க்க முடியும் என்றாலும், ஒவ்வொரு மேட்ரிக்ஸ் உறுப்புகளும் குவாண்டம் கணினியில் அதனுடன் தொடர்புடைய அடி நிலையுடன் அளவிடப்பட வேண்டும். Qiskit-ல் qEOM-ஐ ஒரு தீர்வாகப் பயன்படுத்த, நாம் முதலில் ஒரு அடி நிலைக் கணக்கீட்டை வரையறுக்க வேண்டும், இது அடி நிலையை எவ்வாறு கண்டுபிடிப்பது என்பதற்கான வழிமுறைகளை விளக்குகிறது. இதன் மூலம் qEOM தீர்வி துவக்கப்படலாம்:

source: The calculation and results
fr_fr: Le calcul et les résultats
id_id: Perhitungan dan hasilnya
ja_jp: 計算と結果
pt_br: O cálculo e os resultados
ta_in: கணக்கீடு மற்றும் முடிவுகள்

source: The results are computed and printed
fr_fr: Les résultats sont calculés et imprimés
id_id: Hasilnya dihitung dan ditampilkan
ja_jp: 結果が計算されて、表示されます。
pt_br: Os resultados são computados e impressos
ta_in: முடிவுகள் கணக்கிடப்பட்டு அச்சிடப்படுகின்றன

source: One can see from these results that one state is missing from the NumPy results. The reason for this is because the spin is also used as a filter and only singlet states are shown. In the following we use a custom filter function to check consistently our results and only filter out states with incorrect number of particle (in this case the number of particle is 2).
fr_fr: On peut voir à partir de ces résultats qu'un état est absent des résultats de NumPy. La raison en est que la rotation (``spin``) est également utilisée comme filtre et que seuls les statuts de singlet sont affichés. Dans ce qui suit, nous utilisons une fonction de filtre personnalisée (``custom``) pour vérifier systématiquement nos résultats et seulement filtrer les états avec un nombre incorrect de particules (dans ce cas, le nombre de particules est 2).
id_id: Dapat dilihat dari hasil ini bahwa satu keadaan hilang dari hasil NumPy. Alasannya adalah karena spin juga digunakan sebagai filter dan hanya keadaan singlet yang ditampilkan. Berikut ini kita menggunakan fungsi filter kustom untuk memeriksa secara konsisten hasilnya dan hanya menyaring keadaan dengan jumlah partikel yang salah (dalam hal ini jumlah partikelnya 2).
ja_jp: これらの結果から、NumPy の結果と比べて状態が一つ足りないことがわかります。これは、スピンもフィルターとして使用され、一重項状態のみが表示されているためです。以下では、一貫性をもって結果を確認し、粒子数が正しくない状態 (今回は粒子数が 2) だけをフィルタリングするように、カスタムのフィルター関数を用いています。
pt_br: Pode-se observar a partir desses resultados que um estado está faltando nos resultados do NumPy. A razão para isso é porque o spin também é usado como um filtro e apenas estados singleto são mostrados. A seguir, utilizamos uma função de filtro personalizada para verificar consistentemente nossos resultados e apenas filtrar estados com números incorretos de partículas (neste caso o número de partículas é 2).
ta_in: இந்த முடிவுகளிலிருந்து ஒரு நிலையை NumPy முடிவுகளில் காணவில்லை என்பதை ஒருவர் காணலாம். இதற்குக் காரணம், சுழல் ஒரு வடிப்பானாகவும் பயன்படுத்தப்படுகிறது மற்றும் ஒற்றை நிலைகள் மட்டுமே காட்டப்படுகின்றன. பின்வருவனவற்றில் எங்கள் முடிவுகளை தொடர்ச்சியாக சரிபார்க்க தனிப்பயன் வடிகட்டி செயல்பாட்டைப் பயன்படுத்துகிறோம் மற்றும் தவறான எண்ணிக்கையிலான துகள்களைக் கொண்ட நிலைகளை மட்டுமே வடிகட்டுகிறோம் (இந்த விஷயத்தில் துகள்களின் எண்ணிக்கை 2).

source: Let’s first start with a purely classical example: the NumPy eigensolver. This algorithm exactly diagonalizes the Hamiltonian. Although it scales badly, it can be used on small systems to check the results of the quantum algorithms. Here, we are only interested to look at eigenstates with a given number of particle. To compute only those states a filter function can be passed to the NumPy eigensolver. A default filter function is already implemented in Qiskit and can be used in this way:
pt_br: Vamos começar primeiramente com um exemplo puramente clássico: o NumPy eigensolver. Este algoritmo diagonaliza o Hamiltoniano exatamente. Apesar de escalar mal, ele pode ser usado em sistemas pequenos para verificar os resultados dos algoritmos quânticos. Aqui, só estamos interessados em olhar para autoestados com um determinado número de partículas. Para computar apenas aqueles estados, uma função de filtro pode ser passada para o NumPy eigensolver. Uma função de filtro padrão já é implementada no Qiskit e pode ser usada desta forma:
ta_in: முதலில் முற்றிலும் கிளாசிக்கல் எடுத்துக்காட்டுடன் ஆரம்பிக்கலாம்: NumPy eigensolver. இந்த வழிமுறை சரியாக ஹாமில்டோனியனை குறுக்காகக் கொண்டுள்ளது. இது மோசமாக அளவிடப்பட்டாலும், குவாண்டம் வழிமுறைகளின் முடிவுகளை சரிபார்க்க சிறிய கணினிகளில் இதைப் பயன்படுத்தலாம். இங்கே, ஒரு குறிப்பிட்ட எண்ணிக்கையிலான துகள்களுடன் ஐஜென்ஸ்டேட்களைப் பார்க்க மட்டுமே நாங்கள் ஆர்வமாக உள்ளோம். அந்த மாநிலங்களை மட்டுமே கணக்கிட ஒரு வடிகட்டி செயல்பாட்டை NumPy eigensolver க்கு அனுப்ப முடியும். இயல்புநிலை வடிகட்டி செயல்பாடு ஏற்கனவே கிஸ்கிட்டில் செயல்படுத்தப்பட்டுள்ளது, இதை இந்த வழியில் பயன்படுத்தலாம்:
