Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/chemistry/05_Sampling_potential_energy_surfaces.po
Languages: es_un, fr_fr, id_id, ja_jp, ta_in

source: This page was generated from `tutorials/chemistry/05_Sampling_potential_energy_surfaces.ipynb`__.
es_un: Esta página fue generada a partir de `tutorials/chemistry/05_Sampling_potential_energy_surfaces.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/chemistry/05_Sampling_potential_energy_surfaces.ipynb`__.
id_id: Halaman ini dibuat dari `tutorials/chemistry/01_electronic_structure.ipynb`__.
ja_jp: 当ページは、 `tutorials/chemistry/05_Sampling_potential_energy_surfaces.ipynb`__ から生成されました。
ta_in: இந்த பக்கம் `tutorials/chemistry/05_Sampling_potential_energy_surfaces.ipynb`__ ஆல் உருவாக்கப்பட்டது.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/05_Sampling_potential_energy_surfaces.ipynb>`_.
es_un: Puedes correr esta sección de manera interactiva en el `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/05_Sampling_potential_energy_surfaces.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/05_Sampling_potential_energy_surfaces.ipynb>`_.
id_id: Jalankan secara interaktif di ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/01_electronic_structure.ipynb>` _.
ja_jp: `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/05_Sampling_potential_energy_surfaces.ipynb>`_ でインタラクティブに実行します。
ta_in: ஊடாடும் வகையில் `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/05_Sampling_potential_energy_surfaces.ipynb>`_ இயக்கவும்.

source: Sampling the potential energy surface
es_un: Muestreo de la superficie de energía potencial
fr_fr: Échantillonnage de la surface d'énergie potentielle
id_id: Sampling (penyampelan) energi potensial permukaan
ja_jp: ポテンシャル・エネルギー面のサンプリング
ta_in: சாத்தியமான ஆற்றல் மேற்பரப்பின் மாதிரியை செய்தல்

source: Introduction
es_un: Introducción
id_id: Pengantar
ja_jp: はじめに
ta_in: முன்னுரை

source: This interactive notebook demonstrates how to utilize the Potential Energy Surface (PES) samplers algorithm of qiskit chemistry to generate the dissociation profile of a molecule. We use the Born-Oppenhemier Potential Energy Surface (BOPES)and demonstrate how to exploit bootstrapping and extrapolation to reduce the total number of function evaluations in computing the PES using the Variational Quantum Eigensolver (VQE).
es_un: Este cuaderno interactivo demuestra cómo utilizar el algoritmo muestreador de la Superficie de Energía Potencial (PES) de Qiskit Chemistry para generar el perfil de disociación de una molécula. Usamos la Superficie de Energía Potencial de Born-Oppenheimer (BOPES) y demostramos cómo explotar el re-muestreo y la extrapolación para reducir el número total de evaluaciones de la función en el cálculo de la PES utilizando el Eigensolucionador Variacional Cuántico (VQE).
fr_fr: Ce bloc-notes (``notebook``) interactif montre comment utiliser l'algorithme d'échantillonneurs potentiels d'énergie Surface (``Potential Energy Surface`` ou PES) de la chimie qiskit pour générer le profil de dissociation d'une molécule. Nous utilisons la surface d'énergie potentielle de Born-Oppenhemier (``Born-Oppenheimer Potential Energy Surface`` ou BOPES) et nous démontrons comment exploiter le bootstrap et l'extrapolation pour réduire le nombre total d'évaluations de fonctions dans le calcul du PSE à l'aide du Variational Quantum Eigensolver (VQE).
id_id: Notebook interaktif ini mendemonstrasikan cara menggunakan algoritma samplers (penyampel) Potential Energy Surface (PES) dari qiskit chemistry untuk menghasilkan profil disosiasi sebuah molekul. Kami menggunakan Born-Oppenhemier Potential Energy Surface (BOPES) dan mendemonstrasikan cara menggunakan bootstrapping dan ekstrapolasi untuk mengurangi jumlah total evaluasi fungsi dalam menghitung PES menggunakan Variational Quantum Eigensolver (VQE).
ja_jp: この対話的ノートブックでは、 qiskit chemistry の PES (Potential Energy Surface) サンプラー・アルゴリズムを用いて、分子の解離プロファイルを生成する方法を実演します。 Born-Oppenhemier ポテンシャル・エネルギー面 (BOPES) を使用し、変分量子固有ソルバー (VQE) を用いて、PES を計算する際の関数評価の回数を減らすために、ブートストラップと外挿を利用する方法を示します。
ta_in: இந்த ஊடாடும் நோட்புக் ஒரு மூலக்கூறின் விலகல் சுயவிவரத்தை உருவாக்க qiskit chemistry-ன் Potential Energy Surface (PES) மாதிரி வழிமுறையை எவ்வாறு பயன்படுத்துவது என்பதை விளக்குகிறது. நாங்கள் Born-Oppenhemier Potential Energy Surface (BOPES) பயன்படுத்துகிறோம், மேலும் Variational Quantum Eigensolver (VQE) ஐப் பயன்படுத்தி PES ஐ கணக்கிடுவதில் மொத்த செயல்பாட்டு மதிப்பீடுகளின் எண்ணிக்கையை குறைக்க பூட்ஸ்ட்ராப்பிங் மற்றும் எக்ஸ்ட்ராபோலேஷனை எவ்வாறு பயன்படுத்துவது என்பதை நிரூபிக்கிறோம்.

source: Here, we use the H2 molecule as a model system for testing.
es_un: Aquí, usamos la molécula de H2 como un sistema modelo para hacer pruebas.
fr_fr: Ici, nous utilisons la molécule H2 comme système modèle de test.
id_id: Di sini, kami menggunakan molekul H2 sebagai model sistem untuk pengujian.
ja_jp: ここでは、 H2 分子をテスト用のモデル系として使用します。
ta_in: இங்கு, நாம் H2 மூலக்கூறுகளைப் பயன்படுத்தி சோதனைக்கான ஒரு மாதிரி அமைக்கிறோம்.

source: Make a perturbation to the molecule along the absolute_stretching dof
es_un: Hacer una perturbación a la molécula a lo largo del grado de libertad absolute_stretching
fr_fr: Faire une perturbation à la molécule le long de la dof absolute_stretching
id_id: Membuat sebuah perturbasi pada molekul di sepanjang dof absolute_stretching
ja_jp: absolute_stretching 自由度に沿った分子の摂動
ta_in: மூலக்கூறுக்கு absolute_stretching dof உடன் ஒரு இடையூறை ஏற்படுத்துங்கள்

source: Calculate bond dissociation profile using BOPES Sampler
es_un: Calcular el perfil de disociación de enlace utilizando el muestreador BOPES
fr_fr: Calculer le profil de dissociation de la liaison (``bond``) à l'aide de BOPES Sampler
id_id: Hitung profil disosiasi ikatan menggunakan BOPES Sampler
ja_jp: BOPES サンプラーを用いて、結合解離プロファイルを計算する
ta_in: BOPES மாதிரியைப் பயன்படுத்தி பிணைப்பு விலகல் சுயவிவரத்தைக் கணக்கிடுங்கள்

source: Here, we pass the molecular information and the VQE to a built-in type called the BOPES Sampler. The BOPES Sampler allows the computation of the potential energy surface for a specified set of degrees of freedom/points of interest.
es_un: Aquí, pasamos la información molecular y el VQE a un tipo integrado llamado el Muestreador BOPES. El Muestreador BOPES permite el cálculo de la superficie de energía potencial para un conjunto de grados de libertad/puntos de interés especificado.
fr_fr: Ici, nous passons l'information moléculaire et le VQE à un type intégré appelé le BOPES Sampler. L'échantillonneur (``Sampler``) BOPES permet le calcul de la surface d'énergie potentielle pour un ensemble déterminé de degrés de liberté/points d'intérêt.
id_id: Di sini, kita meneruskan informasi molekuler dan VQE ke tipe bawaan yang disebut BOPES Sampler. BOPES Sampler memungkinkan komputasi energi potensial permukaan untuk satu set tertentu dari kebebasan/titik interest.
ja_jp: ここでは、BOPES サンプラーと呼ばれる組み込み型に、分子の情報と VQE を渡します。 BOPES サンプラーにより、指定された自由度や点の組について、ポテンシャル・エネルギー面の計算が可能できます。
ta_in: இங்கே, மூலக்கூறு தகவல்களையும் VQE யையும் BOPES Sampler எனப்படும் உள்ளமைக்கப்பட்ட வகைக்கு அனுப்புகிறோம். BOPES Sampler ஒரு குறிப்பிட்ட அளவு சுதந்திரத்திற்கு ஆற்றல் மேற்பரப்பைக் கணக்கிட அனுமதிக்கிறது.

source: First we compare no bootstrapping vs bootstrapping
es_un: Primero comparamos sin remuestreo vs con remuestreo
fr_fr: D'abord, nous comparons ´´pas de bootstrapping ´´vs ´´bootstrapping
id_id: Pertama-tama, bandingkan antara tanpa bootstrapping vs bootstrapping
ja_jp: まず、ブートストラップなしの場合とありの場合を比較します。
ta_in: முதலில் பூட்ஸ்ட்ராப்பிங் அல்லாததையும் பூட்ஸ்ட்ராப்பிங்கையும் ஒப்பிடுகிறோம்

source: Bootstrapping the BOPES sampler involves utilizing the optimal variational parameters for a given degree of freedom, say r (ex. interatomic distance) as the initial point for VQE at a later degree of freedom, say r + :math:`\epsilon`. By default, if bootstrapping is set to True, all previous optimal parameters are used as initial points for the next runs.
es_un: El procedimiento del muestreador BOPES implica utilizar los parámetros variacionales óptimos para un grado dado de libertad, digamos r (por ejemplo, la distancia interatómica) como el punto inicial para VQE en un grado posterior de libertad, digamos r + :math:`\epsilon`. De forma predeterminada, si el bootstrapping se establece en True, todos los parámetros óptimos anteriores se utilizan como puntos iniciales para las siguientes ejecuciones.
fr_fr: Le bootstrap de l'échantillonneur BOPES implique l'utilisation des paramètres variationnels optimaux pour un degré de liberté donné, par exemple r (ex. distance interatomique) comme point initial pour le VQE à un degré ultérieur de liberté, par exemple r + :math:` \epsilon`. Par défaut, si le bootstrapping est défini à True, tous les paramètres optimaux précédents sont utilisés comme points initiaux pour les prochaines exécutions.

source: Compare to classical eigensolver
es_un: Comparar con un eigensolucionador clásico
fr_fr: Comparer avec eigensolver classique
id_id: Membandingkan dengan eigensolver klasik
ja_jp: 古典固有値ソルバーとの比較
ta_in: கிளாசிக்கல் eigensolver உடன் ஒப்பிடுக

source: Plot results
es_un: Graficar resultados
fr_fr: Tracer (``Plot``) les résultats
id_id: Plot hasilnya
ja_jp: 結果のプロット
ta_in: முடிவுகளை வரைக

source: Compare number of evaluations
es_un: Comparar número de evaluaciones
fr_fr: Comparer le nombre d'évaluations
id_id: Bandingkan banyaknya evaluasi
ja_jp: 評価回数の比較
ta_in: மதிப்பீடுகளின் எண்ணிக்கையை ஒப்பிடுக

source: Extrapolation
es_un: Extrapolación
id_id: Ekstrapolasi
ja_jp: 外挿
ta_in: எக்ஸ்ட்ராபோலேஷன்

source: Here, an extrapolator added that will try to fit each (param,point) set to some specified function and suggest an initial parameter set for the next point (degree of freedom).
es_un: Aquí, un extrapolador añadido que intentará ajustar cada conjunto (param,point) a alguna función especificada y sugerir un conjunto de parámetros iniciales para el siguiente punto (grado de libertad).
fr_fr: Ici, un extrapolator est ajouté, qui essaiera de s'adapter à chacun (param, point) défini à une fonction spécifiée, et suggère un paramètre initial défini pour le point suivant (degré de liberté).
id_id: Di sini, sebuah ekstrapolator ditambahkan yang akan mencoba menyesuaikan setiap (param, titik) yang disetel ke beberapa fungsi tertentu dan menyarankan set parameter awal untuk titik berikutnya (derajat kebebasan).
ja_jp: ここでは、指定した関数に各 (param, point) の組をフィッティングし、次の点 (自由度) の初期パラメーターの組を提案する外挿器を追加しています。
ta_in: இங்கே, ஒரு குறிப்பிட்ட செயல்பாட்டிற்கு அமைக்கப்பட்ட ஒவ்வொரு (param, point) பொருத்த முயற்சிக்கும் ஒரு எக்ஸ்ட்ராபோலேட்டர், அடுத்த புள்ளிக்கு (சுதந்திரத்தின் அளவு) ஆரம்ப அளவுருவை பரிந்துரைக்கும்.

source: Extrapolator is based on an external extrapolator that sets the ‘window’, that is, the number of previous points to use for extrapolation, while the internal extrapolator proceeds with the actual extrapolation.
es_un: El extrapolador está basado en un extrapolador externo que establece la ‘ventana’, es decir, el número de puntos anteriores a usar para la extrapolación, mientras que el extrapolador interno procede con la extrapolación real.
fr_fr: Extrapolator est basé sur un extrapolator externe qui fixe la "fenêtre" (´´window´´), c'est-à-dire le nombre de points précédents à utiliser pour l'extrapolation, tandis que l'extrapolator interne procède à l'extrapolation réelle.
id_id: Ekstrapolator didasarkan pada ekstrapolator eksternal yang menetapkan 'jendela', yaitu jumlah titik sebelumnya yang digunakan untuk ekstrapolasi, sedangkan ekstrapolator internal melanjutkan dengan ekstrapolasi sesungguhnya.
ja_jp: 外挿器は、外部の外挿器が ‘window’ 、つまり外挿に使用する前の点の数を設定し、内部の外挿器が実際の外挿を進めるという手順に基づいています。
ta_in: எக்ஸ்ட்ராபோலேட்டர் என்பது ஒரு வெளிப்புற எக்ஸ்ட்ராபோலேட்டரை அடிப்படையாகக் கொண்டது, இது ‘சாளரத்தை’ அமைக்கிறது, அதாவது, எக்ஸ்ட்ராபோலேஷனுக்குப் பயன்படுத்த வேண்டிய முந்தைய புள்ளிகளின் எண்ணிக்கையை அமைக்கிறது, அதே நேரத்தில் உள் எக்ஸ்ட்ராபோலேட்டர் உண்மையான எக்ஸ்ட்ராபோலேஷனுடன் தொடர்கிறது.

source: In practice, the user sets the window by specifying an integer value to num_bootstrap - which is also the number of previous points to use for bootstrapping. Additionally, the external extrapolator defines the space within how to extrapolate - here PCA, clustering and the standard window approach.
es_un: En la práctica, el usuario establece la ventana especificando un valor entero a num_bootstrap —que es también el número de puntos anteriores a usar para remuestrear. Adicionalmente, el extrapolador externo define el espacio dentro de cómo extrapolar— aquí PCA, agrupamiento en clúster y el enfoque de ventana estándar.
fr_fr: En pratique, l'utilisateur définit la fenêtre (``window``) en spécifiant une valeur entière à num_bootstrap - qui est également le nombre de points précédents à utiliser pour le bootstrap. En outre, l'extrapolation externe définit l'espace dans la manière d'extrapoler - ici PCA, la mise en cluster et l'approche standard des fenêtres (``standard windows approach``).
id_id: Dalam praktiknya, pengguna menetapkan jendela dengan menentukan nilai integer ke num_bootstrap - yang juga merupakan jumlah poin sebelumnya untuk bootstrapping. Selain itu, ekstrapolator eksternal mendefinisikan ruang di dalam bagaimana untuk mengekstrapolasi - di sini PCA, clustering dan pendekatan jendela standar.
ja_jp: 実際には、ユーザーはブートストラップに使用する前の点の数である整数をnum_bootstrap に指定して、ウィンドウを設定します。さらに、外部の外挿器がどのように外挿を行うのか、空間を定義します。ここでは、 PCA, クラスタリング、標準ウィンドウ・アプローチです。
ta_in: நடைமுறையில், பயனர் ஒரு முழு மதிப்பை num_bootstrap க்கு குறிப்பிடுவதன் மூலம் சாளரத்தை அமைக்கிறார் - இது பூட்ஸ்ட்ராப்பிங்கிற்கு பயன்படுத்த முந்தைய புள்ளிகளின் எண்ணிக்கையும் ஆகும். கூடுதலாக, வெளிப்புற எக்ஸ்ட்ராபோலேட்டர் எவ்வாறு எக்ஸ்ட்ராபொலேட் செய்வது என்பதற்கான இடத்தை வரையறுக்கிறது - இங்கே PCA, க்ளஸ்டரிங் மற்றும் நிலையான சாளர அணுகுமுறை.

source: In practice, if no extrapolator is defined and bootstrapping is True, then all previous points will be bootstrapped. If an extrapolator list is defined and no points are specified for bootstrapping, then the extrapolation will be done based on all previous points.
es_un: En la práctica, si no se definió un extrapolador y el remuestreo es True, entonces todos los puntos anteriores serán remuestreados. Si se define una lista de extrapoladores y no se especifican puntos para remuestrear, entonces la extrapolación será hecha basada en todos los puntos anteriores.
fr_fr: En pratique, si aucune extrapolation n'est définie et que le bootstrap est True, tous les points précédents seront bootstrapped. Si une liste d'extrapolateurs est définie et qu'aucun point n'est spécifié pour le bootstrap, l'extrapolation sera effectuée en fonction de tous les points précédents.
id_id: Dalam praktiknya, jika tidak ada ekstrapolator yang ditentukan dan bootstrapping adalah True, maka semua titik sebelumnya akan di-bootstrap. Jika daftar ekstrapolator ditentukan dan tidak ada titik yang ditentukan untuk bootstrapping, maka ekstrapolasi akan dilakukan berdasarkan semua titik sebelumnya.
ja_jp: 実際には、外挿器が定義されておらず bootstrapping が True となっている場合、前の全ての点がブートストラップされます。外挿器のリストが定義されていてブートストラップの点が指定されていない場合には、外挿は全て前の点に基づいて行われます。
ta_in: நடைமுறையில், எக்ஸ்ட்ராபோலேட்டர் வரையறுக்கப்படவில்லை மற்றும் பூட்ஸ்ட்ராப்பிங் உண்மை என்றால், முந்தைய புள்ளிகள் அனைத்தும் பூட்ஸ்ட்ராப் செய்யப்படும். ஒரு எக்ஸ்ட்ராபோலேட்டர் பட்டியல் வரையறுக்கப்பட்டு, பூட்ஸ்ட்ராப்பிங்கிற்கு புள்ளிகள் எதுவும் குறிப்பிடப்படவில்லை என்றால், முந்தைய எல்லா புள்ளிகளின் அடிப்படையிலும் எக்ஸ்ட்ராபோலேஷன் செய்யப்படும்.

source: Window Extrapolator: An extrapolator which wraps another extrapolator, limiting the internal extrapolator’s ground truth parameter set to a fixed window size
es_un: Extrapolador de ventana: Un extrapolador que envuelve otro extrapolador, limitando el conjunto de parámetros verdaderos del extrapolador interno a un tamaño fijo de ventana
fr_fr: Extrapolateur de fenêtre (``Window Extraplotor``): un extrapolateur qui encapsule une autre extrapolation, limitant la valeur du paramètre de vérité du sol (``ground truth parameter``) de l'extrapolateur interne à une taille de fenêtre fixe
id_id: Ekstrapolator Jendela: Ekstrapolator yang membungkus ekstrapolator lain, membatasi parameter kebenaran dasar ekstrapolator internal yang disetel ke ukuran jendela tetap
ja_jp: Window Extrapolator: 別の外挿器をラップする外挿器で、内部の外挿器の正解パラメーターを固定されたウィンドウ・サイズに限定します。
ta_in: Window Extrapolator: ஒரு எக்ஸ்ட்ராபோலேட்டர் மற்றொரு எக்ஸ்ட்ராபொலேட்டரை வரையறுத்து, உள் எக்ஸ்ட்ராபொலேட்டரின் அடி உண்மை அளவுருவை ஒரு நிலையான சாளர அளவிற்கு அமைக்கிறது

source: PCA Extrapolator: A wrapper extrapolator which reduces the points’ dimensionality with PCA, performs extrapolation in the transformed pca space, and untransforms the results before returning.
es_un: Extrapolador PCA: Un extrapolador envolvente que reduce la dimensionalidad de los puntos con PCA, realiza la extrapolación en el espacio pca transformado, y revierte la transformación de los resultados antes de retornarlos.
fr_fr: Extrapolator PCA: une extrapolation de l'encapsuleur (``wrapper``) qui réduit la dimensionnalité des points avec la PCA, effectue une extrapolation dans l'espace de PCA transformé, et détransforme les résultats avant de retourner.
id_id: Ekstrapolator PCA: Ekstrapolator pembungkus yang mengurangi dimensi titik dengan PCA, melakukan ekstrapolasi dalam ruang pca tertransformasi, dan membatalkan transformasi hasilnya sebelum kembali.
ja_jp: PCA Extrapolator: PCA によって点の次元を削減し、変換された PCA 空間で外挿を行って、結果を返す前に逆変換を施すラッパー外挿器です。
ta_in: PCA Extrapolator: PCA உடனான புள்ளிகளின் பரிமாணத்தை குறைக்கும், மாற்றப்பட்ட PCA இடத்தில் எக்ஸ்ட்ராபோலேஷன் செய்கிறது மற்றும் திரும்புவதற்கு முன் முடிவுகளை மாற்றியமைக்காத ஒரு ரேப்பர் எக்ஸ்ட்ராபோலேட்டர்.

source: Sieve Extrapolator: A wrapper extrapolator which performs an extrapolation, then clusters the extrapolated parameter values into two large and small clusters, and sets the small clusters’ parameters to zero.
es_un: Extrapolador de Tamiz: Un extrapolador envolvente que realiza una extrapolación, luego agrupa los valores de los parámetros extrapolados en dos grupos grandes y pequeños, y establece los parámetros de los grupos pequeños en cero.
fr_fr: Extrapolator Sieve: un extrapolator d'encapsuleur (``wrapper``) qui effectue une extrapolation, puis regroupe les valeurs extrapolées des paramètres en deux grands et petits groupes (``clusters``), et définit les paramètres des petits groupes à zéro.
id_id: Ekstrapolator Sieve: Ekstrapolator pembungkus yang melakukan ekstrapolasi, kemudian mengelompokkan nilai parameter yang diekstrapolasi menjadi dua kluster besar dan kecil, dan menetapkan parameter kluster kecil ke nol.
ja_jp: Sieve Extrapolator: 外挿を行って、外挿されたパラメーター値を値の大小に応じて二つのクラスターにクラスタリングし、値が小さい方のクラスターのパラメーターをゼロに設定するラッパー外挿器です。
ta_in: Sieve Extrapolator: ஒரு எக்ஸ்ட்ராபோலேஷனைச் செய்யும் ஒரு ரேப்பர் எக்ஸ்ட்ராபோலேட்டர், பின்னர் எக்ஸ்ட்ராபோலேட்டட் அளவுரு மதிப்புகளை இரண்டு பெரிய மற்றும் சிறிய கிளஸ்டர்களாக உருவாக்கி, சிறிய கிளஸ்டர்களின் அளவுருக்களை பூஜ்ஜியமாக அமைக்கிறது.

source: Polynomial Extrapolator: An extrapolator based on fitting each parameter to a polynomial function of a user-specified degree.
es_un: Extrapolador Polinomial: Un extrapolador basado en ajustar cada parámetro a una función polinomial de un grado especificado por el usuario.
fr_fr: Extrapolateur Polynomial: extrapolateur basé sur l'ajustement de chaque paramètre à une fonction polynomiale d'un degré spécifié par l'utilisateur.
id_id: Ekstrapolator Polinomial: Ekstrapolator yang berdasarkan pada penyesuaian setiap parameter ke fungsi polinomial pada derajat yang ditentukan pengguna.
ja_jp: Polynomial Extrapolator: ユーザーが指定した次数の多項式関数への、各パラメーターのフィッティングに基づく外挿器です。
ta_in: Polynomial Extrapolator: ஒவ்வொரு அளவுருவையும் பயனர் குறிப்பிட்ட பட்டத்தின் பல்லுறுப்பு செயல்பாட்டிற்கு பொருத்துவதன் அடிப்படையில் ஒரு எக்ஸ்ட்ராபோலேட்டர்.

source: Differential Extrapolator: An extrapolator based on treating each param set as a point in space, and performing regression to predict the param set for the next point. A user-specified degree also adds derivatives to the values in the point vectors which serve as features in the training data for the linear regression.
es_un: Extrapolador Diferencial: Un extrapolador basado en tratar cada conjunto de parámetros como un punto en el espacio, y realizar la regresión para predecir el conjunto de parámetros para el siguiente punto. Un grado especificado por el usuario también añade derivadas a los valores en los vectores de puntos que sirven como características en los datos de entrenamiento para la regresión lineal.
fr_fr: Extrapolateur Différentiel: une extrapolation basée sur le traitement de chaque ensemble de paramètres comme un point dans l'espace, et une régression permettant de prédire le paramètre défini pour le point suivant. Un degré spécifié par l'utilisateur ajoute également des dérivées aux valeurs des vecteurs de points qui servent comme caractéristiques dans les données de formation (``training``) pour la régression linéaire.
id_id: Ekstrapolator Diferensial: Ekstrapolator yang didasarkan pada perlakuan setiap himpunan parameter sebagai titik dalam ruang, dan melakukan regresi untuk memprediksi himpunan parameter untuk titik berikutnya. Derajat yang ditentukan pengguna juga menambahkan turunan ke nilai di vektor titik yang berfungsi sebagai fitur dalam data pelatihan untuk regresi linier.
ja_jp: Differential Extrapolator: 各パラメーター集合を空間内の点として扱って次の点のパラメーター集合を予測する回帰に基づいた外挿器です。ユーザーが指定した次数に応じて、線形回帰の訓練データの特徴量として機能する点ベクトルの値に微分が加えられます。
ta_in: Differential Extrapolator: ஒவ்வொரு param தொகுப்பையும் விண்வெளியில் ஒரு புள்ளியாகக் கருதுவதை அடிப்படையாகக் கொண்ட ஒரு எக்ஸ்ட்ராபோலேட்டர், அடுத்த புள்ளிக்கான param தொகுப்பைக் கணிக்க பின்னடைவைச் செய்யும். பயனர் குறிப்பிட்ட பட்டம் நேரியல் பின்னடைவுக்கான பயிற்சி தரவுகளில் அம்சங்களாக செயல்படும் புள்ளி திசையன்களில் உள்ள மதிப்புகளுக்கு வழித்தோன்றல்களை சேர்க்கிறது.

source: Here we test two different extrapolation techniques
es_un: Aquí probamos dos técnicas de extrapolación diferentes
fr_fr: Nous testons ici deux techniques d'extrapolation différentes
id_id: Di sini kami mengetes dua teknik ekstrapolasi yang berbeda
ja_jp: ここでは、二つの異なる外挿手法を試します。
ta_in: இங்கே நாம் இரண்டு வெவ்வேறு எக்ஸ்ட்ராபோலேஷன் நுட்பங்களை சோதிக்கிறோம்

source: Bootstrapping the BOPES sampler involves utilizing the optimal variational parameters for a given degree of freedom, say r (ex. interatomic distance) as the initial point for VQE at a later degree of freedom, say r + :math:`\epsilon`. By default, if boostrapping is set to True, all previous optimal parameters are used as initial points for the next runs.
id_id: Bootstrapping sampler BOPES ini melibatkan pemanfaatan parameter variasional optimal untuk derajat kebebasan tertentu, katakanlah r (misal jarak antaratom) sebagai titik awal untuk VQE pada derajat kebebasan setelahnya, katakanlah r + :math:` \epsilon `. Secara default, jika boostrapping diatur ke True, semua parameter optimal sebelumnya digunakan sebagai titik awal untuk langkah berikutnya.
