Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/chemistry/06_calculating_thermodynamic_observables.po
Languages: fr_fr, id_id

source: This page was generated from `tutorials/chemistry/06_calculating_thermodynamic_observables.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/chemistry/06_calculating_thermodynamic_observables.ipynb`__.
id_id: Halaman ini dibuat dari `tutorials/chemistry/01_electronic_structure.ipynb`__.

source: Run interactively in the `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/06_calculating_thermodynamic_observables.ipynb>`_.
fr_fr: Exécuter en mode interactif dans le `IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/06_calculating_thermodynamic_observables.ipynb>`_.
id_id: Jalankan secara interaktif di ' IBM Quantum lab <https://quantum-computing.ibm.com/jupyter/tutorial/chemistry/01_electronic_structure.ipynb>` _.

source: Calculating Thermodynamics Observables with a quantum computer
fr_fr: Calcul des observables thermodynamiques avec un ordinateur quantique
id_id: Menghitung Observable Termodinamik dengan komputer kuantum

source: A preliminary draft with more information related to this tutorial can be found in preprint: Stober et al, arXiv 2003.02303 (2020)
fr_fr: Une version préliminaire avec plus d'informations sur ce tutoriel se trouve dans la prépublication : Stober et al, arXiv 2003.02303 (2020)

source: Calculation of the Born Oppenheimer Potential Energy Surface (BOPES)
fr_fr: Calcul de la surface d'énergie potentielle dans l'approximation de Born Oppenheimer (BOPES)

source: To compute thermodynamic observables we begin with single point energy calculation which calculates the wavefunction and charge density and therefore the energy of a particular arrangement of nuclei. Here we compute the Born-Oppenheimer potential energy surface of a hydrogen molecule, as an example, which is simply the electronic energy as a function of bond length.
fr_fr: Pour calculer les observables thermodynamiques, nous commençons par le calcul de la fonction d'onde, de la densité de charge et de l'énergie pour un arrangement particulier des noyaux. A titre d'exemple, nous calculons ici la surface d'énergie potentielle d'une molécule d'hydrogène dans l'approximation de Born-Oppenheimer; cela revient simplement à calculer l'énergie électronique en fonction de la longueur de la liaison.
id_id: Untuk menghitung observable termodinamik, kami mulai dengan kalkulasi energi titik tunggal yang menghitung fungsi gelombang, kerapatan muatan dan energi dari susunan inti tertentu. Di sini kami menghitung energi potensial permukaan Born-Oppenheimer dari molekul hidrogen, sebagai contoh, yang secara sederhana merupakan energi elektronik sebagai fungsi dari panjang ikatan.

source: Calculation of the molecular Vibronic Energy levels
fr_fr: Calcul des niveaux d'énergie vibrationnelles de la molécule
id_id: Perhitungan dari tingkat Energi Vibronik molekul

source: The Born-Oppeheimer approximation removes internuclear vibrations from the molecular Hamiltonian and the energy computed from quantum mechanical ground-state energy calculations using this approximation contain only the electronic energy. Since even at absolute zero internuclear vibrations still occur, a correction is required to obtain the true zero-temperature energy of a molecule. This correction is called the zero-point vibrational energy (ZPE), which is computed by summing the contribution from internuclear vibrational modes. Therefore, the next step in computing thermodynamic observables is determining the vibrational energy levels. This can be done by constructing the Hessian matrix based on computed single point energies close to the equilibrium bond length. The eigenvalues of the Hessian matrix can then be used to determine the vibrational energy levels and the zero-point vibrational energy
fr_fr: L'approximation de Born-Oppeheimer néglige les vibrations des noyaux dans l'hamiltonien moléculaire; l'énergie vibrationnelle calculée dans cette approximation ne contient donc que l'énergie vibrationnelle électronique. Cependant, si l'on considère les noyaux comme des oscillateurs quantiques, l’énergie vibrationnelle n'est jamais nulle, même au zéro absolu. On appelle cette correction, l'énergie vibrationnelle du point zéro (ZPE), elle est calculée en additionnant l'énergie fondamentale de chaque modes vibrationnels des noyaux. Pour déterminer les niveaux d'énergie proche de l’équilibre, on construit une matrice hessienne de l’énergie potentielle centrée sur la longueur de la liaison en équilibre. Les valeurs propres de la matrice hessienne peuvent ensuite être utilisées pour déterminer les niveaux d'énergie vibrationnelle et l'énergie vibrationnelle du point zéro
id_id: Pendekatan Born-Oppeheimer menghilangkan getaran antar nuklir dari Hamiltonian molekul dan energi yang dihitung dari perhitungan energi keadaan dasar mekanika kuantum dengan pendekatan yang hanya mengandung energi elektronik. Karena pada nol mutlak vibrasi internuklir masih terjadi, koreksi diperlukan untuk mendapatkan energi suhu nol yang sebenarnya dari sebuah molekul. Koreksi ini disebut zero-point vibrasional energy (ZPE), yang dihitung dengan menjumlahkan kontribusi dari mode vibrasi inter nuklir. Oleh karena itu, langkah berikutnya dalam komputasi termodinamika observabel adalah menentukan tingkat energi vibrasi. Hal ini dapat dilakukan dengan membuat matriks Hessian berdasarkan perhitungan energi titik tunggal yang dekat dengan panjang ikatan kesetimbangan. Eigen nilai matriks Hessian kemudian dapat digunakan untuk menentukan tingkat energi vibrasi dan energi vibrasi titik nol

source: :nbsphinx-math:`\begin{equation} {\rm ZPE} = \frac{1}{2}\, \sum_i ^M \nu_i \, , \end{equation}` with :math:`\nu_i` being the vibrational frequencies, :math:`M = 3N − 6` or :math:`M = 3N − 5` for non-linear or linear molecules, respectively, and :math:`N` is number of the particles.
fr_fr: :nbsphinx-math:` \begin{equation} {\rm ZPE } = \frac{1}{2}\, \sum_i ^ M \nu_i \,, \end{equation}` avec :math:`\nu_i ` les fréquences vibrationnelles, :math:` M = 3N − 6 ` ou :math:` M = 3N − 5 ` pour respectivement les molécules non linéaires et linéaires , et :math:` N` le nombre de particules.
id_id: :nbsphinx-math:`\begin{equation} {\rm ZPE} = \frac{1}{2}\, \sum_i ^M \nu_i \, , \end{equation}` dengan :math:`\nu_i` sebagai frekuensi vibrasional, :math:`M = 3N − 6` atau :math:`M = 3N − 5` untuk molekul non-linear atau linear, secara berurutan, dan :math:`N` adalah banyaknya partikel.

source: Here we fit a “full” energy surface using a 1D spline potential and use it to evaluate molecular vibrational energy levels.
fr_fr: Ici, nous ajustons une surface d'énergie complète à l'aide d'un potentiel de spline 1D et nous l'utilisons pour évaluer les niveaux d'énergie vibrationnelle moléculaire.
id_id: Di sini kami menyesuaikan energi permukaan "penuh" menggunakan potensial spline 1D dan menggunakannya untuk mengevaluasi tingkat energi vibrasional molekul.

source: Create a partition function for the calculation of heat capacity
fr_fr: Création d'une fonction de partition pour le calcul de la capacité thermique
id_id: Buat fungsi partisi untuk perhitungan kapasitas kalor

source: The partition function for a molecule is the product of contributions from translational, rotational, vibrational, electronic, and nuclear degrees of freedom. Having the vibrational frequencies, now we can obtain the vibrational partition function :math:`q_{\rm vibration}` to compute the whole molecular partition function :nbsphinx-math:`\begin{equation} q_{\rm vibration} = \prod_{i=1} ^M \frac{\exp\,(-\Theta_{\nu_i}/2T)}{1-\exp\,(-\Theta_{\nu_i}/2T} \, . \end{equation}` Here :math:`\Theta_{\nu_i}= h\nu_i/k_B`, :math:`T` is the temperature and :math:`k_B` is the Boltzmann constant.
fr_fr: La fonction de partition d'une molécule est le produit des contributions des différents degrés de liberté: mouvements de la molécule dans l'espace (translations et rotations) et vibrations, électroniques ou nucléaires, autour de l’équilibre. La partie vibratoire de la fonction de partition s'exprime simplement en fonction des fréquences vibratoires :math:`q_{\rm vibration}` pour calculer toute la fonction de partition moléculaire :nbsphinx-math:`\begin{equation} q_{\rm vibration} = \prod_{i=1} ^M \frac{\exp\, -\Theta_{\nu_i}/2T)}{1-\exp\,(-\Theta_{\nu_i}/2T} \, . \end{equation}` Ici :math:`\Theta_{\nu_i}= h\nu_i/k_B`, :math:`T` est la température et :math:`k_B` la constante de Boltzmann.
id_id: Fungsi partisi untuk sebuah molekul adalah produk merupakan kontribusi dari translasi, rotasi, vibrasi, elektronik dan derajat kebebasan nuklir. Dengan frekusi vibrasional, sekarang kita bisa mendapatkan fungsi partisi vibrasional :math:`q_{\rm vibration}` untuk menghitung keseluruhan fungsi partisi vibrasional :nbsphinx-math:`\begin{equation} q_{\rm vibration} = \prod_{i=1} ^M \frac{\exp\,(-\Theta_{\nu_i}/2T)}{1-\exp\,(-\Theta_{\nu_i}/2T} \, . \end{equation}` Here :math:`\Theta_{\nu_i}= h\nu_i/k_B`, :math:`T adalah temperatur dan :math:`k_B` adalah konstanta Boltzmann.

source: The single-point energy calculations and the resulting partition function can be used to calculate the (constant volume or constant pressure) heat capacity of the molecules. The constant volume heat capacity, for example, is given by
fr_fr: Les calculs d'énergie et la fonction de partition qui en résulte peuvent être utilisés pour calculer la capacité thermique (à volume ou à pression constante) des molécules. La capacité thermique à volume constant, par exemple, est donnée par
id_id: Perhitungan energi titik tunggal dan fungsi partisi yang dihasilkan dapat digunakan untuk menghitung kapasitas kalor (volume konstan atau tekanan konstan) molekul. Kapasitas kalor volume konstan, misalnya, diberikan oleh

source: :math:`U` is the internal energy, :math:`V` is the volume and :math:`Q` is the partition function.
fr_fr: :math:` U ` est l'énergie interne, :math:` V ` le volume et :math:` Q ` est la fonction de partition.
id_id: :math:`U` adalah energi internal, :math:`V` adalah volume dan :math:`Q` adalah fungsi partisi.

source: Here we illustrate the simplest usage of the partition function, namely creating a Thermodynamics object to compute properties like the constant pressure heat capacity defined above.
fr_fr: Nous illustrons ici l'utilisation la plus simple de la fonction de partition, à savoir la création d'un objet thermodynamique pour calculer des propriétés telles que la capacité thermique à pression constante définie ci-dessus.
id_id: Di sini kami mengilustrasikan penggunaan paling sederhana dari fungsi partisi, yaitu membuat objek Termodinamika untuk menghitung properti seperti kapasitas kalor tekanan konstan yang didefinisikan di atas.

source: Here we demonstrate how to access particular components (the rotational part) of the partition function, which in the H2 case we can further split to para-hydrogen and ortho-hydrogen components.
fr_fr: Nous démontrons ici comment accéder à une composante particulière (la partie rotationnelle) de la fonction de partition, qui dans le cas de H2 peut être diviser en composants para-hydrogène et ortho-hydrogène.
id_id: Di sini kami mendemonstrasikan cara mengakses komponen tertentu (bagian rotasi) dari fungsi partisi, yang dalam kasus H2 selanjutnya dapat dipisahkan menjadi komponen para-hidrogen dan orto-hidrogen.

source: We will now plot the constant volume heat capacity (of the rotational part) demonstrating how we can call directly the functions in the ‘thermodynamics’ module, providing a callable object for the partition function (or in this case its rotational component). Note that in the plot we normalize the plot dividing by the universal gas constant R (Avogadro’s number times Boltzman’s constant) and we use crossed to compare with experimental data found in literature.
fr_fr: Nous allons maintenant tracer la capacité thermique à volume constant de la partie rotationnelle: en créant un objet pour la fonction de partition (ou dans ce cas sa composante rotationnelle), nous pouvons appeler directement les fonctions dans le module "thermodynamique". Notez que la courbe est normalisée par la constante de gaz universelle R (le nombre d'Avogadro multiplie par la constante de Boltzman) et que des croix sont utilisées pour comparer avec les données expérimentales trouvées dans la littérature.
id_id: Sekarang kita akan memplot kapasitas kalor volume konstan (dari bagian rotasi) yang mendemonstrasikan bagaimana kita dapat memanggil secara langsung fungsi dalam modul 'termodinamika', menyediakan objek yang dapat dipanggil untuk fungsi partisi (atau dalam hal ini komponen rotasinya). Perhatikan bahwa dalam plot kami menormalkan plot yang membagi dengan konstanta gas universal R (bilangan Avogadro dikali konstanta Boltzman) dan kami menggunakan persilangan untuk membandingkan dengan data eksperimental yang ditemukan dalam literatur.

source: A preliminary draft with more information related to this tutorial can be foung in preprint: Stober et al, arXiv 2003.02303 (2020)
id_id: Draf pendahuluan dengan lebih banyak informasi terkait dengan tutorial ini dapat ditemukan dalam pracetak: Stober et al, arXiv 2003.02303 (2020)

source: Calculation of the Born Openheimer Potenitial Energy Surface (BOPES)
id_id: Perhitungan dari Energi Potensial Permukaan Born Oppenheimer / Born Openheimer Potenitial Energy Surface (BOPES)
