Repository: qiskit-community/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/chemistry/1_programmatic_approach.po
Languages: es_mx, fr_fr, id_id, ja_jp, ko_kr, pt_br, tr_tr

source: This page was generated from `tutorials/chemistry/1_programmatic_approach.ipynb`__.
es_mx: Esta página fue generada a partir de `tutorials/chemistry/1_programmatic_approach.ipynb`__.
fr_fr: Cette page a été générée à partir de `tutorials/chemistry/1_programmatic_approach.ipynb`__.
id_id: Halaman ini dibuat dari ` tutorials/chemistry/1_programmatic_approach.ipynb ` __.
ja_jp: 当ページは `tutorials/chemistry/1_programmatic_approach.ipynb`__ から生成されました。
ko_kr: 이 페이지는 `tutorials/chemistry/1_programmatic_approach.ipynb`__ 에서 생성되었다.
pt_br: Esta página foi gerada a partir do `tutorials/chemistry/1_programmatic_approach.ipynb`__.
tr_tr: Bu sayfa `tutorials/chemistry/1_programmatic_approach.ipynb`__ adresinden oluşturulmuştur.

source: **Qiskit Chemistry, Programmatic Approach**
es_mx: **Química Qiskit, Enfoque Programático**
fr_fr: ** Qiskit Chimie, Approche programmatique * *
id_id: **Qiskit Kimia, Pendekatan Program**
ja_jp: **Qiskit Chemistryにおけるプログラム的アプローチ**
ko_kr: **키스킷 화학(Qiskit Chemistry), 프로그램적 접근법**
pt_br: **Química Qiskit, Abordagem Programática**
tr_tr: **Qiskit Kimya, Programlamasal Yaklaşım**

source: The latest version of this notebook is available on https://github.com/Qiskit/qiskit-tutorial.
es_mx: La última versión de este notebook está disponible en https://github.com/Qiskit/qiskit-tutorial.
pt_br: A última versão deste notebook está disponível em https://github.com/Qiskit/qiskit-tutorial.

source: Contributors
es_mx: Colaboradores
pt_br: Colaboradores

source: Richard Chen[1], Antonio Mezzacapo[1], Marco Pistoia[1], Stephen Wood[1] ### Affiliation - [1]IBMQ
es_mx: Richard Chen[1], Antonio Mezzacapo[1], Marco Pistoia[1], Madera de Stephen[1] ### Afiliación - [1]IBMQ
pt_br: Richard Chen[1], Antonio Mezzacapo[1], Marco Pistoia[1], Stephen Wood[1] ### Afiliação - [1]IBMQ

source: Introduction
es_mx: Introducción
id_id: Pengantar
ja_jp: はじめに
ko_kr: 도입
pt_br: Introdução
tr_tr: Giriş

source: This notebook illustrates how to use Qiskit Chemistry's programmatic APIs.
es_mx: Este notebook ilustra cómo utilizar las API programáticas de Qiskit Chemistry.
fr_fr: Ce bloc-notes explique comment utiliser les API de programmation de Qiskit Chimie.
id_id: Notebook ini menjelaskan cara menggunakan API programatik Qiskit Kimia.
ja_jp: このノートブックでは、Qiskit ChemistryのプログラムAPIを使用する方法を説明します。
ko_kr: 이 노트북은 키스킷 화학의 프로그램 API를 사용하는 방법을 설명한다.
pt_br: Este notebook ilustra como usar as APIs programáticas do Química Qiskit.
tr_tr: Bu not defteri, Qiskit Kimya'nın programlamasal API'lerinin nasıl kullanılacağını göstermektedir.

source: In this notebook, we decompose the computation of the ground state energy of a molecule into 4 steps: 1. Define a molecule and get integrals from a computational chemistry driver (PySCF in this case) 2. Construct a Fermionic Hamiltonian and map it onto a qubit Hamiltonian 3. Instantiate and initialize dynamically-loaded algorithmic components, such as the quantum algorithm VQE, the optimizer and variational form it will use, and the initial\_state to initialize the variational form 4. Run the algorithm on a quantum backend and retrieve the results
es_mx: En este notebook, descomponemos el cálculo de la energía correspondiente al estado base de una molécula en cuatro pasos: 1. Definir una molécula y obtener sus integrales a partir de un driver computacional de química (PySCF en este caso). 2. Construir un Hamiltoniano fermiónico y mapearlo a un Hamiltoniano de qubits. 3. Crear una instancia e inicializar los componentes algorítmicos cargados dinámicamente, como lo son el algoritmo cuántico VQE, el optimizador y la forma variacional a utilizar, y el initial\_state para inicializar la forma variacional. 4. Ejecutar el algoritmo en un backend cuántico y recuperar los resultados
fr_fr: Dans ce bloc-notes, nous décomposons le calcul de l'énergie d'état fondamental d'une molécule en 4 étapes: 1. Définition de la molécule et obtention des intégrales d'un pilote de chimie computationnelle (PySCF dans ce cas) ; 2. Construction d'un Hamiltonien Fermionique sa modélisation sur un Hamiltonien de qubits ; 3. Instanciation et initialisation des composants algorithmiques chargés dynamiquement, tels que l'algorithme quantique VQE, l'optimiseur et la forme variationnelle qu'il utilisera ainsi que l'``initial\_state`` de la forme variationnelle ; 4. Exécution de l'algorithme sur un backend quantique et extraction des résultats
id_id: Pada notebook ini, kita menguraikan perhitungan energi terendah dari sebuah molekul menjadi 4 langkah: 1. Mendefinisikan molekul dan mendapatkan integral dari driver kimia komputasi (PySCF dalam hal ini) 2. Mendefinsikan Hamiltonian Fermionik dan memetannya ke dalam Hamiltonian qubit 3. Menginisiasi dan merealisasikan komponen algoritmik yang dimuat secara dinamis, seperti algoritma quantum VQE, pengoptimalan dan bentuk variasional yang akan digunakan, dan inisial\_state untuk menginisiasi bentuk variasional 4. Jalankan algoritma pada backend quantum dan mengambil hasilnya
ja_jp: このノートでは、分子の基底状態エネルギーの計算を 4 つのステップに分解します。 1. 分子を定義し、計算化学ドライバー (この場合には PySCF) から積分値を得ます。 2. フェルミオン・ハミルトニアンを構成し、それを量子ビットハミルトニアンにマップします。3. 動的にロードされたアルゴリズム・コンポーネントをインスタンス化して初期化します。例えば、量子アルゴリズムの「 VQE」、最適化プログラム、および変分フォームが使用され、initial\_state が変分フォームの初期化に利用されます。4. 量子バックエンドでアルゴリズムを実行し、結果を取得します。
ko_kr: 이 노트북에서 분자의 바닥 상태 에너지의 계산을 4단계로 분해한다. 1. 분자를 정의하고 계산 화학 드라이버로부터 적분을 얻는다. (이 경우에는 PySCF) 2. 페르미오닉 해밀토안(Fermionic Hamiltonian) 을 구성하고, 그것을 큐비트 해밀토니안에 사상한다. 3. 양자 알고리즘 VQE, 사용할 최적화 프로그램 및 변형 양식, 변형 양식을 초기화하는 초기 상태(initial\_state) 와 같이 동적으로 로드된 알고리즘 구성 요소를 만들고, 초기화 한다. 4. 양자 후위 처리 장치에서 알고리즘을 구현하고, 결과를 추출한다.
pt_br: Neste notebook, decompomos o cálculo da energia do solo de uma molécula em 4 etapas: 1. Defina uma molécula e obtenha integrais de um driver de química computacional (PySCF neste caso) 2. Construa um Hamiltoniano Fermiônico e mapeie-o para um qubit Hamiltoniano 3. Instancie e inicialize componentes de algorítmicos carregados dinamicamente, como o algoritmo quântico VQE, o otimizador e a forma variacional que ele usará, e o initial\_state para inicializar a forma variacional 4. Execute o algoritmo em um backend quântico e receba os resultados
tr_tr: Bu not defterinde, bir molekülün temel hal enerjisinin hesaplanmasını 4 adıma ayırıyoruz: 1. Bir molekül tanımlayın ve bir hesaplamalı kimya sürücüsünden (bu durumda PySCF) integralleri alın 2. Bir Fermionic Hamiltonyen oluşturun ve bir kübit Hamiltonyenine üzerine eşleyin 3. VQE kuantum algoritması, kullanacağı eniyileştirici ve kullanılacağı varyasyonel formu başlatmak için başlangıç durumu gibi dinamik olarak yüklenmiş algoritmik bileşenleri başlatın 4. Algoritmayı bir kuantum arka ucunda çalıştırın ve sonuçları alın

source: Step 1: Define a molecule
es_mx: Paso 1: Define una molécula
fr_fr: Étape 1: Définir une molécule
id_id: Langkah 1: Definisikan molekul
ja_jp: ステップ 1: 分子の定義
ko_kr: 단계 1: 분자 정의
pt_br: Passo 1: defina uma molécula
tr_tr: Adım 1: Bir molekül tanımlama

source: Here, we use LiH in the sto3g basis with the PySCF driver as an example. The ``molecule`` object records the information from the PySCF driver.
es_mx: Aquí, usamos LiH en la base de sto3g con el driver PySCF como ejemplo. El objeto ``molecule`` registra la información del controlador PySCF.
fr_fr: Dans ce cas, nous utilisons LiH de la base sto3g avec le pilote PySCF comme exemple. L'objet ``molecule`` reçoit les informations du pilote PySCF.
id_id: Di sini, kita menggunakan LiH dalam basis sto3g dengan driver PySCF sebagai contoh. Objek ` ` molecule ` ` mencatat informasi dari driver PySCF.
ja_jp: ここでは、例として PySCF ドライバを使用して、 STO3g 基底での LiH を扱います。``molecule`` オブジェクトはPySCFドライバーからの情報を記録します。
ko_kr: 여기에서, 예로서 PySCF 드라이버로 sto3g 기저에서 LiH를 사용한다. 이 ``분자`` 객체는 PySCF 드라이버로 부터의 정보를 기록한다.
pt_br: Aqui, usamos LiH na base sto3g com o driver PySCF como exemplo. O objeto ``molecule`` registra a informação do driver PySCF.
tr_tr: Burada, örnek olarak PySCF sürücüsü ile sto3g bazında LiH kullanıyoruz. ``molekül`` nesnesi PySCF sürücüsünden bilgileri kaydeder.

source: Step 2: Prepare qubit Hamiltonian
es_mx: Paso 2: Preparar el Hamiltoniano de cúbits
fr_fr: Etape 2: Préparation de l'Hamiltonien pour les qubits
id_id: Langkah 2: Siapkan Hamiltonian qubit
ja_jp: ステップ 2: 量子ビットのハミルトニアンを準備する
ko_kr: 2단계: 큐비트 해밀토니안 준비
pt_br: Passo 2: Prepare o qubit Hamiltoniano
tr_tr: Adım 2: Kübit Hamiltonyenini hazırlayın

source: Here, we setup the **to-be-frozen** and **to-be-removed** orbitals to reduce the problem size when we map to the qubit Hamiltonian. Furthermore, we define the **mapping type** for the qubit Hamiltonian. For the particular ``parity`` mapping, we can further reduce the problem size.
es_mx: Aquí configuramos los orbitales **to-be-frozen** y **to-be removed** para reducir el tamaño del problema a la hora de mapear al Hamiltoniano de qubits. Además, definimos el **mapping type** (tipo de mapeo) para el Hamiltoniano de qubits. En particular, el tipo de mapeo ``parity`` nos permite reducir aún más el tamaño del problema.
fr_fr: Ici, nous avons mis en place les orbitales ** to-be-frozen** et ** to-be-removed** pour réduire la taille du problème lorsque nous préparons l'Hamiltonien des qubits. De plus, nous définissons le **mapping type** pour celui-ci. Pour le la correspondance de ``parity``, nous pouvons encore réduire la taille du problème.
id_id: Di sini, kita mengatur orbital ** terbeku** dan ** terhilang** untuk mengurangi skala masalah ketika kita memetakannya ke Hamiltonian qubit. Selanjutnya, kita menentukan **jenis pemetaan** untuk Hamiltonian qubit. Untuk pemetaan ` ` parity``, kita dapat lebih lanjut mengurangi skala masalah.
ja_jp: ここでは、 **to-be-frozen** と **to-be - removed** 軌道をセットアップして、ハミルトニアンにマップするときの問題サイズを小さくします。 さらにハミルトニアンの **mapping type** を定義します。 特定の ``parity`` マッピングについては、問題サイズをさらに小さくすることができます。
ko_kr: 여기서는 큐비트 해밀토니안으로 사상할 때, 문제 크기를 줄이기 위해서 **to-be-frozen**과 **to-be-removed** 궤도(orbitals) 을 설정한다. 더욱이 큐비트 해밀토니안을 위해 **사상 형식(mapping type)**을 정의한다. 특정 ``패리티(parity)`` 사상을 위해서 문제 크기를 더 많이 줄일 수 있다.
pt_br: Aqui, configuramos os orbitais **to-be-frozen** e **to-be-removed** para reduzir o tamanho do problema quando mapeamos para o qubit Hamiltoniano. Além disso, definimos o **tipo de mapeamento** para o qubit Hamiltoniano. Para o mapeamento específico ``parity``, podemos reduzir ainda mais o tamanho do problema.
tr_tr: Burada, Hamiltonyen kübit ile eşleştirdiğimizde problem boyutunu azaltmak için **dondurulacak** ve **kaldırılacak** orbitalleri kurduk. Ayrıca, qubit Hamiltonyen için **eşleme tipini** tanımladık. Belirli ``parite`` eşlemesi için sorun boyutunu daha da azaltabiliriz.

source: We use the classical eigen decomposition to get the smallest eigenvalue as a reference.
es_mx: Utilizamos la descomposición espectral clásica para obtener el valor propio (eigenvalor) más pequeño como referencia.
fr_fr: Nous utilisons la décomposition classique spectrale pour obtenir la plus petite valeur propre comme référence.
id_id: Kita menggunakan penguraian eigen klasik untuk mendapatkan nilai eigennilai terkecil sebagai referensi.
ja_jp: 古典的な固有値分解を用いて、最小固有値を参照します。
ko_kr: 가장 작은 고유치 (eigenvalue) 를 얻기 위해서 전통적인 고유치 분해법을 사용한다.
pt_br: Usamos a clássica Decomposição Eigen para obter o menor eigenvalue como referência.
tr_tr: Referans olarak en küçük öz değeri elde etmek için klasik öz ayrışmasını kullanırız.

source: Step 3: Initiate and configure dynamically-loaded instances
es_mx: Paso 3: Iniciar y configurar las instancias cargadas dinámicamente
fr_fr: Etape 3: Lancement et configuration des instances chargées dynamiquement
id_id: Langkah 3: Memulai dan mengkonfigurasi instans yang dimuat secara dinamis
ja_jp: ステップ 3: 動的にロードされたインスタンスを開始および構成する
ko_kr: 3단계: 동적으로 로드된 인스턴스의 시작 및 구성
pt_br: Passo 3: Iniciar e configurar instâncias carregadas dinamicamente
tr_tr: Adım 3: Dinamik olarak yüklenen örnekleri başlatma ve yapılandırma

source: To run VQE with the UCCSD variational form, we require:
es_mx: Para ejecutar VQE con la forma variacional UCCSD, necesitamos:
fr_fr: Pour exécuter VQE avec la forme variationnelle UCCSD, nous avons besoin de :
id_id: Untuk menjalankan VQE dengan bentuk variasional UCCSD, kita memerlukan:
ja_jp: UCCSD の変分フォームを使用して VQE を実行するには、以下のものが必要です。
ko_kr: VQE를 UCCSD 변형 양식으로 사용하는 방법은 다음과 같다:
pt_br: Para executar o VQE com o formulário de variação do UCCSD, precisamos:
tr_tr: VQE'yi UCCSD varyasyonel formuyla çalıştırmak için şunları gerekli kılıyoruz:

source: VQE algorithm
es_mx: Algoritmo VQE
fr_fr: Algorithme VQE
id_id: Algoritma VQE
ja_jp: VQE アルゴリズム
ko_kr: VQE 알고리즘
pt_br: Algoritmo VQE
tr_tr: VQE algoritması

source: Classical Optimizer
es_mx: Optimizador clásico
fr_fr: Optimiseur classique
id_id: Pengoptimasi Klasik
ja_jp: 古典オプティマイザー
ko_kr: 고전적 최적화 프로그램
pt_br: Otimizador Clássico
tr_tr: Klasik Eniyileyici

source: UCCSD variational form
es_mx: Forma variacional UCCSD
fr_fr: Forme variationnelle UCCSD
id_id: Format variasional UCCSD
ja_jp: UCCSD 変分フォーム
ko_kr: UCCSD 변형 양식
pt_br: Formulário de variação UCCSD
tr_tr: UCCSD varyasyonel formu

source: Prepare the initial state in the HartreeFock state
es_mx: Preparar el estado inicial en el estado HartreeFock
fr_fr: Préparer l'état initial dans l'état HartreeFock
id_id: Siapkan keadaan dalam HartreeFock state
ja_jp: 初期状態を HartreeFock 状態で準備します。
ko_kr: 하트리∙폭 (HartreeFock) 상태에서 초기 상태 준비하기
pt_br: Preparar o estado inicial no estado HartreeFock
tr_tr: İlk durumu HartreeFock halinde hazırlayın

source: [Optional] Setup token to run the experiment on a real device
es_mx: [Optional] Preparación del token para ejecutar el experimento en un dispositivo real
fr_fr: [Optional] Préparation du jeton d'accès pour exécuter l'expérimentation sur un backend réel
id_id: [Optional] token pengaturan untuk menjalankan percobaan pada perangkat nyata
ja_jp: [Optional] 実デバイスで実験を実行するためのトークンを設定します。
ko_kr: [Optional] 실제 장치에서 실험을 실행하려면 토큰을 설정해야 한다.
pt_br: [Optional] Configuração do token para executar o experimento em um dispositivo real

source: If you would like to run the experiment on a real device, you need to setup your account first.
es_mx: Si quiere ejecutar el experimento en un dispositivo real, primero debe configurar tu cuenta.
fr_fr: Si vous souhaitez exécuter l'expérience sur un backend réel, vous devez d'abord configurer votre compte.
id_id: Jika Anda ingin menjalankan percobaan pada perangkat yang sebenarnya, Anda perlu mengatur akun Anda terlebih dahulu.
ja_jp: 実際のデバイスでテストを実行したい場合は、最初にアカウントをセットアップする必要があります。
ko_kr: 실제 장치에서 실험을 실행하려면 먼저 계정을 설정해야 한다.
pt_br: Se você quer executar o experimento em um dispositivo real, você precisa configurar sua conta primeiro.
tr_tr: Denemeyi gerçek bir cihazda çalıştırmak istiyorsanız, önce hesabınızı ayarlamanız gerekir.

source: Note: If you did not store your token yet, use ``IBMQ.save_account('MY_API_TOKEN')`` to store it first.
es_mx: Nota: Si todavía no ha guardado su token, primero utilice ``IBMQ.save_account('MY_API_TOKEN')``.
fr_fr: Note: Si vous n'aviez pas encore sauvegardé votre jeton, utilisez d'abord ``IBMQ.save_account ('MY_API_TOKEN')``.
id_id: Catatan: Jika Anda belum menyimpan token Anda, gunakan ` `IBMQ.save_account ('MY_API_TOKEN') ` ` untuk menyimpan token ini terlebih dahulu.
ja_jp: 注: トークンをまだ保存していない場合は、 ``IBMQ.save_account('MY_API_TOKEN')`` を使用してトークンを保存してください。
ko_kr: 참고: 토큰을 저장하지 않은 경우에는 ``IBMQ.save_account(MY_API_TOKEN)`` 를 사용하여 먼저 저장한다.
pt_br: Nota: Se você ainda não armazenou seu token, use ``IBMQ.save_account('MY_API_TOKEN')`` para armazená-lo primeiro.

source: Step 4: Run algorithm and retrieve the results
es_mx: Paso 4: Ejecutar el algoritmo y recuperar los resultados
fr_fr: Étape 4 : Exécuter l'algorithme et récupérer les résultats
id_id: Langkah 4: Jalankan algoritma dan ambil hasilnya
ja_jp: ステップ 4: アルゴリズムを実行し、結果を取得する
ko_kr: 4단계: 알고리즘 실행 및 결과 추출
pt_br: Passo 4: Execute um algoritmo e recupere os resultados
tr_tr: Adım 4: Algoritmayı çalıştırın ve sonuçları alın

source: results = vqe.run(quantum\_instance) print('The computed ground state energy is: {:.12f}'.format(results.eigenvalue.real)) print('The total ground state energy is: {:.12f}'.format(results.eigenvalue.real + energy\_shift + nuclear\_repulsion\_energy)) print("Parameters: {}".format(results.optimal\_point))
id_id: hasil = vqe.run( quantum\_instance) cetak ('energi keadaan dasar yang dihitung adalah: {:.12f}' .format(results.eigenvalue.real)) cetak ('Total energi keadaan dasar adalah: {:.12f}' .format (results.eigenvalue.real + energy\_shift + nuclear \_repulsion\_energi)) cetak (" Parameter: {numOfOthers}. format(results.optimal\_point))
ja_jp: results = vqe.run(quantum\_instance) print('計算された基底エネルギーは {:.12f}'.format(results.eigenvalue.real)) print('基底エネルギーの合計は {:.12f}'.format(results.eigenvalue.real + energy\_shift + nuclear\_repulsion\_energy)) print("Parameters: {}".format(results.optimal\_point))
